Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/hubs/*.po
Languages: pt_br

source: Due to very high requirements of bandwidth, storage and adminstration the FreeBSD Project has decided not to allow public mirrors of packages. For sites with lots of machines, it might be advantagous to run a caching HTTP proxy for the <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>8</manvolnum></citerefentry> process. Alternatively specific packages and their dependencies can be fetched by running something like the following:
pt_br: Devido a exigências muito altas de largura de banda, armazenamento e administração, o Projeto FreeBSD decidiu não permitir espelhos públicos de pacotes. Para sites com muitas máquinas, pode ser vantajoso executar um proxy HTTP para fazer cache do <citerefentry><refentrytitle>pkg</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. Alternativamente, pacotes específicos e suas dependências podem ser baixados executando algo assim:

source: Once those packages have been fetched, the repository metadata must be generated by running:
pt_br: Quando esses pacotes forem baixados, os metadados do repositório devem ser gerados executando:

source: Once the packages have been fetched and the metadata for the repository has been generated, serve the packages up to the client machines via HTTP. For additional information see the man pages for <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, specifically the <citerefentry><refentrytitle>pkg-repo</refentrytitle><manvolnum>8</manvolnum></citerefentry> page.
pt_br: Uma vez que os pacotes tenham sido baixados e os metadados para o repositório tenham sido gerados, sirva os pacotes até as máquinas clientes via HTTP. Para obter informações adicionais, consulte as páginas de manual do <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, mais especificamente a página <citerefentry><refentrytitle>pkg-repo</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: How Often Should I Mirror?
pt_br: Com que frequência eu devo atualizar o conteúdo do meu espelho?

source: Every mirror should be updated at a minimum of once per day. Certainly a script with locking to prevent multiple runs happening at the same time will be needed to run from <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Since nearly every admin does this in their own way, specific instructions cannot be provided. It could work something like this:
pt_br: Todo site espelho deve ser atualizado no mínimo uma vez por dia. Certamente, um script com bloqueio para impedir que várias execuções ocorram ao mesmo tempo será necessário para executar a partir do <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Como quase todo administrador faz isso à sua maneira, instruções específicas não podem ser fornecidas. Mas poderia ser algo como:

source: Put the command to run your mirroring application in a script. Use of a plain <command>/bin/sh</command> script is recommended.
pt_br: Coloque o comando para executar seu aplicativo de espelhamento em um script. Recomenda-se o uso de um script simples <command>/bin/sh</command>.

source: Add some output redirections so diagnostic messages are logged to a file.
pt_br: Adicione alguns redirecionamentos de saída para que as mensagens de diagnóstico sejam registradas em um arquivo.

source: Test if your script works. Check the logs.
pt_br: Teste se o seu script funciona. Verifique os logs.

source: Use <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry> to add the script to the appropriate user's <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>5</manvolnum></citerefentry>. This should be a different user than what your FTP daemon runs as so that if file permissions inside your FTP area are not world-readable those files cannot be accessed by anonymous FTP. This is used to <quote>stage</quote> releases — making sure all of the official mirror sites have all of the necessary release files on release day.
pt_br: Use o <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry> para adicionar o script ao <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>5</manvolnum></citerefentry> do usuário apropriado. Este deve ser um usuário diferente daquele sob o qual o daemon FTP está sendo executado, de forma que, se as permissões de arquivo dentro de sua área FTP não forem legíveis por todos, esses arquivos não poderão ser acessados ​​por FTP anônimo. Isto é usado para fazer o <quote>stage</quote> de uma release - assegurando que todos os sites espelhos oficiais tenham todos os arquivos necessários da release no dia do lançamento.

source: Here are some recommended schedules:
pt_br: Aqui estão alguns agendamentos recomendados:

source: FTP fileset: daily
pt_br: Conjunto de arquivos FTP: diariamente

source: WWW pages: daily
pt_br: Páginas WWW: diariamente

source: Where to Mirror From
pt_br: De onde espelhar

source: This is an important issue. So this section will spend some effort to explain the backgrounds. We will say this several times: under no circumstances should you mirror from <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>.
pt_br: Esta é uma questão importante. Então, esta seção vai gastar algum esforço para explicar mais a fundo. Nós diremos isso várias vezes: sob nenhuma circunstância você deve espelhar a partir do <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>.

source: A few Words About the Organization
pt_br: Algumas palavras sobre a organização

source: Mirrors are organized by country. All official mirrors have a DNS entry of the form <systemitem class="fqdomainname">ftpN.CC.FreeBSD.org</systemitem>. <emphasis>CC</emphasis> (i.e., country code) is the <emphasis>top level domain</emphasis> (TLD) of the country where this mirror is located. <emphasis>N</emphasis> is a number, telling that the host would be the <emphasis>Nth</emphasis> mirror in that country. (Same applies to <systemitem>wwwN.CC.FreeBSD.org</systemitem>, etc.) There are mirrors with no <emphasis>CC</emphasis> part. These are the mirror sites that are very well connected and allow a large number of concurrent users. <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem> is actually two machines, one currently located in Denmark and the other in the United States. It is <emphasis>NOT</emphasis> a master site and should never be used to mirror from. Lots of online documentation leads <quote>interactive</quote>users to <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem> so automated mirroring systems should find a different machine to mirror from.
pt_br: Os espelhos são organizados por país. Todos os espelhos oficiais possuem uma entrada de DNS no formato <systemitem class="fqdomainname"> ftpN.CC.FreeBSD.org</systemitem>. O <emphasis>CC</emphasis> (ou seja, o código do país) é o <emphasis>domínio de nível superior</emphasis> (TLD) do país onde esse espelho está localizado. <emphasis>N</emphasis> é um número, dizendo que o host seria o espelho <emphasis>Nth</emphasis> daquele país. (O mesmo se aplica a <systemitem>wwwN.CC.FreeBSD.org</systemitem>, etc.) Há espelhos sem partes <emphasis>CC</emphasis>. Esses são os sites espelhos que são muito bem conectados e permitem um grande número de usuários simultâneos. O <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem> é na verdade duas máquinas, uma atualmente localizada na Dinamarca e outra nos Estados Unidos. Este <emphasis>NÃO</emphasis> é um site mestre e nunca deve ser usado para se espelhar. Muitos documentos on-line conduzem os usuários <quote>interativos</quote> para <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>, portanto os sistemas automatizados de espelhamento devem utilizar uma máquina diferente para se espelhar.

source: Additionally there exists a hierarchy of mirrors, which is described in terms of <emphasis>tiers</emphasis>. The master sites are not referred to but can be described as <emphasis>Tier-0</emphasis>. Mirrors that mirror from these sites can be considered <emphasis>Tier-1</emphasis>, mirrors of <emphasis>Tier-1</emphasis>-mirrors, are <emphasis>Tier-2</emphasis>, etc. Official sites are encouraged to be of a low <emphasis>tier</emphasis>, but the lower the tier the higher the requirements in terms as described in <xref linkend="mirror-requirements"/>. Also access to low-tier-mirrors may be restricted, and access to master sites is definitely restricted. The <emphasis>tier</emphasis>-hierarchy is not reflected by DNS and generally not documented anywhere except for the master sites. However, official mirrors with low numbers like 1-4, are usually <emphasis>Tier-1</emphasis> (this is just a rough hint, and there is no rule).
pt_br: Além disso, existe uma hierarquia de espelhos, descrita em termos de <emphasis>camadas</emphasis>. Os sites mestres não são referenciados, mas podem ser descritos como <emphasis>Tier-0</emphasis>. Espelhos que espelham desses sites podem ser considerados <emphasis>Tier-1</emphasis>, espelhos de <emphasis>Tier-1</emphasis>mirrors, são<emphasis>Tier-2</emphasis>, etc. Os sites oficiais são encorajados a ter um <emphasis>nível</emphasis> baixo, mas quanto mais baixo o nível, maiores os requisitos em termos, conforme descrito em <xref linkend="mirror-requirements"/>. Também o acesso a espelhos de baixo nível pode ser restrito, e o acesso a sites mestres é definitivamente restrito. A <emphasis>tier</emphasis>-hierarchy não é refletida pelo DNS e geralmente não é documentada em nenhum lugar, exceto nos sites mestres. No entanto, os espelhos oficiais com números baixos como 1-4, geralmente são <emphasis>Tier-1</emphasis> (isso é apenas uma dica, e não há regra).

source: Ok, but Where Should I get the Stuff Now?
pt_br: Ok, mas de onde devo baixar os arquivos agora?

source: Under no circumstances should you mirror from <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>. The short answer is: from the site that is closest to you in Internet terms, or gives you the fastest access.
pt_br: Em nenhuma circunstância você deve espelhar a partir de <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>. A resposta simples é: do site que está mais próximo de você em termos de Internet ou que lhe ofereça o acesso mais rápido.

source: I Just Want to Mirror from Somewhere!
pt_br: Eu só quero espelhar de algum lugar!

source: If you have no special intentions or requirements, the statement in <xref linkend="mirror-where-where"/> applies. This means:
pt_br: Se você não tem nenhuma intenção ou requisito especial, a declaração em <xref linkend="mirror-where-where"/> se aplica. Isso significa:

source: Check for those which provide fastest access (number of hops, round-trip-times) and offer the services you intend to use (like <application>rsync</application>).
pt_br: Verifique quais fornecem acesso mais rápido (número de saltos, tempos de ida e volta) e ofereçam os serviços que você pretende usar (como <application>rsync</application>).

source: Contact the administrators of your chosen site stating your request, and asking about their terms and policies.
pt_br: Entre em contato com os administradores do site escolhido, informando sua solicitação e perguntando sobre seus termos e políticas.

source: Set up your mirror as described above.
pt_br: Configure o seu espelho conforme descrito acima.

source: I am an Official Mirror, What is the Right Rite for Me?
pt_br: Eu sou um espelho oficial, qual é o site certo para mim?

source: In general the description in <xref linkend="mirror-where-simple"/> still applies. Of course you may want to put some weight on the fact that your upstream should be of a low tier. There are some other considerations about <emphasis>official</emphasis> mirrors that are described in <xref linkend="mirror-official"/>.
pt_br: Em geral, a descrição em <xref linkend="mirror-where-simple"/> ainda se aplica. É claro que você pode querer colocar algum peso no fato de que seu upstream deve ser de nível baixo. Existem algumas outras considerações sobre os espelhos <emphasis>oficiais</emphasis> que são descritos em <xref linkend="mirror-official"/>.

source: I Want to Access the Master Sites!
pt_br: Eu quero acessar os sites principais!

source: If you have good reasons and good prerequisites, you may want and get access to one of the master sites. Access to these sites is generally restricted, and there are special policies for access. If you are already an <emphasis>official</emphasis> mirror, this certainly helps you getting access. In any other case make sure your country really needs another mirror. If it already has three or more, ask the <quote>zone administrator</quote> (<email>hostmaster@CC.FreeBSD.org</email>) or <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">FreeBSD mirror sites mailing lists</link> first.
pt_br: Se você tiver boas razões e pré-requisitos, poderá querer e obter acesso a um dos sites mestres. O acesso a esses sites é geralmente restrito e existem políticas especiais para acesso. Se você já é um espelho <emphasis>oficial</emphasis>, isso certamente irá ajudar você a obter acesso. Em qualquer outro caso, certifique-se de que seu país realmente precisa de outro espelho. Se já tiver três ou mais, pergunte ao <quote>administrador de região</quote>(<email>hostmaster@CC.FreeBSD.org</email>) ou<link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs"> Listas de discussão de sites espelho do FreeBSD</link> primeiro.

source: Whoever helped you become, an <emphasis>official</emphasis> should have helped you gain access to an appropriate upstream host, either one of the master sites or a suitable Tier-1 site. If not, you can send email to <email>mirror-admin@FreeBSD.org</email> to request help with that.
pt_br: Quem ajudou você a se tornar um espelho <emphasis>oficial</emphasis> deve ajudar você a obter acesso a um host de upstream apropriado, seja um dos sites mestres ou um site Tier-1 adequado. Caso contrário, você pode enviar um email para <email>mirror-admin@FreeBSD.org</email> para solicitar ajuda com isso.

source: There is one master site for the FTP fileset.
pt_br: Existe um site principal para o conjunto de arquivos FTP.

source: This is the master site for the FTP fileset.
pt_br: Este é o site principal do conjunto de arquivos FTP.

source: <systemitem>ftp-master.FreeBSD.org</systemitem> provides <application>rsync</application> access, in addition to FTP. Refer to <xref linkend="mirror-ftp-rsync"/>.
pt_br: O <systemitem>ftp-master.FreeBSD.org</systemitem> fornece acesso por <application>rsync</application>, além do acesso normal por FTP. Consulte <xref linkend="mirror-ftp-rsync"/>.

source: Mirrors are also encouraged to allow <application>rsync</application> access for the FTP contents, since they are <emphasis>Tier-1</emphasis>-mirrors.
pt_br: Os espelhos também são encorajados a permitir acesso por <application>rsync</application> para o conteúdo FTP, já que eles são espelhos de <emphasis>Tier-1</emphasis>.

source: Official Mirrors
pt_br: Espelhos Oficiais

source: Official mirrors are mirrors that
pt_br: Espelhos oficiais são os espelhos que

source: a) have a <systemitem>FreeBSD.org</systemitem> DNS entry (usually a CNAME).
pt_br: a) tem uma entrada de DNS <systemitem>FreeBSD.org</systemitem> (geralmente um CNAME).

source: b) are listed as an official mirror in the FreeBSD documentation (like handbook).
pt_br: b) são listados como um espelho oficial na documentação do FreeBSD (como no Handbook).

source: So far to distinguish official mirrors. Official mirrors are not necessarily <emphasis>Tier-1</emphasis>-mirrors. However you probably will not find a <emphasis>Tier-1</emphasis>-mirror, that is not also official.
pt_br: Até agora, para distinguir espelhos oficiais. Espelhos oficiais não são necessariamente espelhos <emphasis>Tier-1</emphasis>. No entanto, você provavelmente não encontrará um espelho <emphasis>Tier-1</emphasis> que também não é oficial.

source: Special Requirements for Official (tier-1) Mirrors
pt_br: Requisitos especiais para sites espelhos oficiais (Tier-1)

source: It is not so easy to state requirements for all official mirrors, since the project is sort of tolerant here. It is more easy to say, what <emphasis>official tier-1 mirrors</emphasis> are required to. All other official mirrors can consider this a big <emphasis>should</emphasis>.
pt_br: Não é tão fácil declarar os requisitos para todos os sites espelhos oficiais, uma vez que o projeto é um pouco tolerante aqui. É mais fácil dizer o que um <emphasis>site espelho oficial Tier-1 </emphasis> precisa ter. Todos os outros sites espelhos oficiais podem considerar isto como um grande <emphasis>deve</emphasis>.

source: Tier-1 mirrors are required to:
pt_br: Os sites espelhos Tier-1 precisam:

source: carry the complete fileset
pt_br: ter o conjunto completo de arquivos

source: allow access to other mirror sites
pt_br: permitir acesso a outros sites espelho

source: provide <application>FTP</application> and <application>rsync</application> access
pt_br: fornecer acesso por <application>FTP</application> e <application>rsync</application>

source: Furthermore, admins should be subscribed to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">FreeBSD mirror sites mailing lists</link>. See <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">this link</link> for details, how to subscribe.
pt_br: Além disso, os administradores devem estar inscritos nas <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">listas de discussão de sites espelho do FreeBSD</link>. Consulte <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">este link</link> para obter detalhes em como se inscrever.

source: It is <emphasis>very</emphasis> important for a hub administrator, especially Tier-1 hub admins, to check the <link xlink:href="https://www.FreeBSD.org/releng/">release schedule</link> for the next FreeBSD release. This is important because it will tell you when the next release is scheduled to come out, and thus giving you time to prepare for the big spike of traffic which follows it.
pt_br: É <emphasis>muito</emphasis> importante para um administrador de hub, especialmente administradores de hub de Tier-1, verificar o <link xlink:href="https://www.FreeBSD.org/releng/">calendário de lançamentos </link> para a próxima versão do FreeBSD. Isto é importante porque lhe dirá quando o próximo lançamento está programado para sair, e assim lhe dará tempo para se preparar para o grande pico de tráfego que virá.

source: It is also important that hub administrators try to keep their mirrors as up-to-date as possible (again, even more crucial for Tier-1 mirrors). If Mirror1 does not update for a while, lower tier mirrors will begin to mirror old data from Mirror1 and thus begins a downward spiral... Keep your mirrors up to date!
pt_br: Também é importante que os administradores do hub tentem manter seus espelhos o mais atualizados possível (novamente, ainda mais importante para os espelhos Tier-1). Se o Mirror1 não for atualizado por um tempo, os espelhos de camada inferior começarão a espelhar os dados antigos do Mirror1 e, portanto, iniciará uma espiral descendente... Mantenha seus espelhos atualizados!

source: How to Become Official Then?
pt_br: Como se tornar um site espelho oficial?

source: We are not accepting any new mirrors at this time.
pt_br: Não estamos aceitando novos sites espelhos neste momento.

source: Some Statistics from Mirror Sites
pt_br: Algumas estatísticas dos sites espelho

source: Here are links to the stat pages of your favorite mirrors (aka the only ones who feel like providing stats).
pt_br: Aqui estão os links para as páginas de estatísticas dos seus sites espelho favoritos (também conhecidos como os únicos que têm a boa vontade de fornecer as estatísticas).

source: FTP Site Statistics
pt_br: Estatísticas do site FTP

source: ftp.is.FreeBSD.org - <email>hostmaster@is.FreeBSD.org</email> - <link xlink:href="http://www.rhnet.is/status/draupnir/draupnir.html"> (Bandwidth)</link> <link xlink:href="http://www.rhnet.is/status/ftp/ftp-notendur.html">(FTP processes)</link> <link xlink:href="http://www.rhnet.is/status/ftp/http-notendur.html">(HTTP processes)</link>
pt_br: ftp.is.FreeBSD.org - <email> hostmaster@is.FreeBSD.org </email> - <link xlink:href="http://www.rhnet.is/status/draupnir/draupnir.html">(Largura de Banda)</link> <link xlink:href="http://www.rhnet.is/status/ftp/ftp-notendur.html">(Processos FTP)</link> <link xlink:href="http://www.rhnet.is/status/ftp/http-notendur.html">(Processos HTTP)</link>

source: ftp2.ru.FreeBSD.org - <email>mirror@macomnet.ru</email> - <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_195.128.64.25.html">(Bandwidth)</link> <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_proc.html">(HTTP and FTP users)</link>
pt_br: ftp2.ru.FreeBSD.org - <email> mirror@macomnet.ru </email> - <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_195.128.64.25.html">(Largura de Banda)</link> <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_proc.html">(Usuários HTTP e FTP)</link>
