Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/hubs/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Mauro Risonho de Paula Assumpção, mauro.risonho@gmail.com, 2018

source: Mirroring FreeBSD
pt_br: Espelhando o FreeBSD

source: An in-progress article on how to mirror FreeBSD, aimed at hub administrators.
pt_br: Um artigo em andamento sobre como espelhar o FreeBSD, destinado à administradores de hubs.

source: We are not accepting new mirrors at this time.
pt_br: Nós não estamos aceitando novos sites espelho neste momento.

source: Contact Information
pt_br: Informações de contato

source: The Mirror System Coordinators can be reached through email at <email>mirror-admin@FreeBSD.org</email>. There is also a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">FreeBSD mirror sites mailing lists</link>.
pt_br: Os Coordenadores do Sistema de Espelhamento podem ser contatados pelo email <email>mirror-admin@FreeBSD.org</email>. Existe também uma <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">lista de discussão de sites espelho do FreeBSD</link>.

source: Requirements for FreeBSD Mirrors
pt_br: Requisitos para um site espelho do FreeBSD

source: Disk Space
pt_br: Espaço em disco

source: Disk space is one of the most important requirements. Depending on the set of releases, architectures, and degree of completeness you want to mirror, a huge amount of disk space may be consumed. Also keep in mind that <emphasis>official</emphasis> mirrors are probably required to be complete. The web pages should always be mirrored completely. Also note that the numbers stated here are reflecting the current state (at 10.4-RELEASE/11.2-RELEASE). Further development and releases will only increase the required amount. Also make sure to keep some (ca. 10-20%) extra space around just to be sure. Here are some approximate figures:
pt_br: O espaço em disco é um dos requisitos mais importantes. Dependendo do conjunto de releases, arquiteturas e grau de cobertura que você deseja espelhar, uma quantidade enorme de espaço em disco pode ser consumida. Também tenha em mente que espelhos <emphasis>oficiais</emphasis> provavelmente precisam ser completos. As páginas web devem ser sempre espelhadas completamente. Observe também que os números indicados aqui refletem o estado atual (para 10.4-RELEASE/11.2-RELEASE). Desenvolvimentos adicionais e novas releases só aumentarão a quantidade necessária. Também certifique-se de ter algum espaço extra (cerca de 10-20%) apenas para ter certeza de que não irá faltar espaço. Aqui estão alguns números aproximados:

source: Full FTP Distribution: 1.4 TB
pt_br: Distribuição FTP completa: 1.4 TB

source: CTM deltas: 10 GB
pt_br: Deltas do CTM: 10 GB

source: Web pages: 1GB
pt_br: Páginas Web: 1GB

source: The current disk usage of FTP Distribution can be found at <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes">ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes</link>.
pt_br: O uso atual de disco da Distribuição por FTP pode ser encontrado em <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes">ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes</link>.

source: Network Connection/Bandwidth
pt_br: Conexão de Rede/Largura de Banda

source: Of course, you need to be connected to the Internet. The required bandwidth depends on your intended use of the mirror. If you just want to mirror some parts of FreeBSD for local use at your site/intranet, the demand may be much smaller than if you want to make the files publicly available. If you intend to become an official mirror, the bandwidth required will be even higher. We can only give rough estimates here:
pt_br: Claro, você precisa estar conectado à Internet. A largura de banda necessária depende do uso pretendido do site espelho. Se você quiser espelhar apenas algumas partes do FreeBSD para uso na sua rede local/intranet, a demanda pode ser muito menor do que se você quiser disponibilizar os arquivos publicamente. Se você pretende se tornar um site espelho oficial, a largura de banda necessária será ainda maior. Podemos apenas dar estimativas aproximadas aqui:

source: Local site, no public access: basically no minimum, but &lt; 2 Mbps could make syncing too slow.
pt_br: Site local, sem acesso público: basicamente sem valor mínimo, mas se for menor que &lt; 2 Mbps, pode deixar a sincronização bem lenta.

source: Unofficial public site: 34 Mbps is probably a good start.
pt_br: Site público não oficial: 34 Mbps é provavelmente um bom começo.

source: Official site: &gt; 100 Mbps is recommended, and your host should be connected as close as possible to your border router.
pt_br: Site oficial: &gt; 100 Mbps é recomendado, e seu host deve estar conectado o mais próximo possível do seu roteador de borda.

source: System Requirements, CPU, RAM
pt_br: Requisitos de Sistema, CPU, RAM

source: One thing this depends on the expected number of clients, which is determined by the server's policy. It is also affected by the types of services you want to offer. Plain FTP or HTTP services may not require a huge amount of resources. Watch out if you provide rsync. This can have a huge impact on CPU and memory requirements as it is considered a memory hog. The following are just examples to give you a very rough hint.
pt_br: Isto depende muito do número esperado de clientes, que é determinado pela política do servidor. O dimensionamento também é afetado pelo tipo de serviços que você deseja oferecer. Serviços FTP ou HTTP simples podem não exigir uma quantidade enorme de recursos. Tenha cuidado se você fornecer o rsync. Isso pode ter um grande impacto nos requisitos de CPU e memória, já que este serviço é considerado um devorador de memória. Os exemplos a seguir, visam lhe dar uma ideia simples deste dimensionamento.

source: For a moderately visited site that offers <application>rsync</application>, you might consider a current CPU with around 800MHz - 1 GHz, and at least 512MB RAM. This is probably the minimum you want for an <emphasis>official</emphasis> site.
pt_br: Para um site com visitação moderada o qual ofereça o serviço de <application>rsync</application>, você pode considerar uma CPU entre 800 MHz - 1 GHz, e pelo menos 512 MB de memória RAM. Esta é provavelmente a configuração mínima para um site espelho <emphasis>oficial</emphasis>.

source: For a frequently used site you definitely need more RAM (consider 2GB as a good start) and possibly more CPU, which could also mean that you need to go for a SMP system.
pt_br: Para um site com visitação frequente, você definitivamente vai precisar de mais memória RAM (considere 2 GB como um bom ponto de partida) e possivelmente de mais poder de processamento (CPU), o que pode significar que você precisará ir para um sistema multiprocessado (SMP).

source: You also want to consider a fast disk subsystem. Operations on the SVN repository require a fast disk subsystem (RAID is highly advised). A SCSI controller that has a cache of its own can also speed up things since most of these services incur a large number of small modifications to the disk.
pt_br: Você também pode querer considerar um subsistema de disco rápido. As operações no repositório SVN requerem um subsistema de disco rápido (o RAID é altamente recomendado). Um controlador SCSI que possua um cache próprio também pode acelerar as coisas, já que a maioria desses serviços incorrem em um grande número de pequenas modificações no disco.

source: Services to Offer
pt_br: Serviços para oferecer

source: Every mirror site is required to have a set of core services available. In addition to these required services, there are a number of optional services that server administrators may choose to offer. This section explains which services you can provide and how to go about implementing them.
pt_br: Todo site espelho é obrigado a disponibilizar um conjunto de serviços básicos. Em adição a estes serviços obrigatórios, existe um grande número de serviços opcionais aos quais o administrador do servidor pode optar por oferecer. Esta sessão irá detalhar quais serviços você pode oferecer, bem como implementá-los.

source: FTP (required for FTP Fileset)
pt_br: FTP (necessário para o conjunto de arquivos do FTP)

source: This is one of the most basic services, and it is required for each mirror offering public FTP distributions. FTP access must be anonymous, and no upload/download ratios are allowed (a ridiculous thing anyway). Upload capability is not required (and <emphasis>must</emphasis> never be allowed for the FreeBSD file space). Also the FreeBSD archive should be available under the path <filename>/pub/FreeBSD</filename>.
pt_br: Este é um dos serviços mais básicos, e ele é obrigatório em todos os sites espelhos que oferecem acesso público às distribuições via FTP. O acesso ao FTP deve ser anônimo, e não é permitido o uso de nenhum controle nas taxas de upload/download (o que seria uma coisa ridícula de qualquer maneira). Não é necessário ter o upload de arquivos habilitado (e isso <emphasis>nunca</emphasis> deve ser permitido na área onde os arquivos do FreeBSD são mantidos). Os arquivos do FreeBSD devem ficar disponíveis sob o caminho <filename>/pub/FreeBSD</filename>.

source: There is a lot of software available which can be set up to allow anonymous FTP (in alphabetical order).
pt_br: Existem diversos softwares disponíveis que podem ser configurados para operar como um servidor de FTP anônimo. Por exemplo (em ordem alfabética)

source: <command>/usr/libexec/ftpd</command>: FreeBSD's own ftpd can be used. Be sure to read <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: <command>/usr/libexec/ftpd</command>: o próprio ftpd do FreeBSD pode ser usado. Não deixe de ler o manual do <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: <package>ftp/ncftpd</package>: A commercial package, free for educational use.
pt_br: <package>ftp/ncftpd</package>: Um pacote comercial, grátis para uso educacional.

source: <package>ftp/oftpd</package>: An ftpd designed with security as a main focus.
pt_br: <package>ftp/oftpd</package>: Um ftpd projetado tendo a segurança como foco principal.

source: <package>ftp/proftpd</package>: A modular and very flexible ftpd.
pt_br: <package>ftp/proftpd</package>: Um ftpd modular e muito flexível.

source: <package>ftp/pure-ftpd</package>: Another ftpd developed with security in mind.
pt_br: <package>ftp/pure-ftpd</package>: Outro ftpd desenvolvido com segurança em mente.

source: <package>ftp/twoftpd</package>: As above.
pt_br: <package>ftp/twoftpd</package>: Mais um ftpd desenvolvido com segurança em mente.

source: <package>ftp/vsftpd</package>: The <quote>very secure</quote> ftpd.
pt_br: <package>ftp/vsftpd</package>: Um ftpd <quote>muito seguro</quote>.

source: FreeBSD's <application>ftpd</application>, <application>proftpd</application> and maybe <application>ncftpd</application> are among the most commonly used FTPds. The others do not have a large userbase among mirror sites. One thing to consider is that you may need flexibility in limiting how many simultaneous connections are allowed, thus limiting how much network bandwidth and system resources are consumed.
pt_br: O <application>ftpd</application> nativo do FreeBSD, o <application>proftpd</application>, e talvez o <application>ncftpd</application> são alguns dos servidores de FTP mais utilizados. Os demais não possuem uma grande base de usuários entre os sites espelhos. Um item a ser considerado é que você pode precisar de flexibilidade para controlar quantas conexões simultâneas serão permitidas no servidor, limitando desta forma o consumo do seu link IP e dos demais recursos do sistema.

source: Rsync (optional for FTP Fileset)
pt_br: Rsync (opcional para o conjunto de arquivos do FTP)

source: <application>Rsync</application> is often offered for access to the contents of the FTP area of FreeBSD, so other mirror sites can use your system as their source. The protocol is different from FTP in many ways. It is much more bandwidth friendly, as only differences between files are transferred instead of whole files when they change. <application>Rsync</application> does require a significant amount of memory for each instance. The size depends on the size of the synced module in terms of the number of directories and files. <application>Rsync</application> can use <command>rsh</command> and <command>ssh</command> (now default) as a transport, or use its own protocol for stand-alone access (this is the preferred method for public rsync servers). Authentication, connection limits, and other restrictions may be applied. There is just one software package available:
pt_br: O <application>Rsync</application> é muitas vezes oferecido para acesso ao conteúdo da área de FTP de um site espelho do FreeBSD, desta forma outros sites espelhos podem utilizar o seu sistema como fonte para se espelhar. O protocolo do rsync é diferente do FTP em muitos aspectos. Ele é muito mais amigável em relação ao consumo de banda IP, uma vez que quando um arquivo é alterado ao invés de transferí-lo por completo novamente, ele transfere apenas as diferenças entre as duas versões do arquivo. O <application>Rsync</application> requer uma grande quantidade de memória para cada instância. A quantidade de memória alocada depende do tamanho do modulo sincronizado em termos do número de diretórios e de arquivos. O <application>Rsync</application> pode utilizar <command>rsh</command> e o <command>ssh</command> (que agora é padrão) para transporte dos dados, ou então utilizar o seu próprio protocolo para acesso stand-alone (este é o método preferido para um servidor público de Rsync). Obrigatoriedade de autenticação, limites ao número de conexões simultâneas e outras restrições podem ser aplicadas. Há apenas um pacote de software disponível para se implementar um servidor de Rsync:

source: HTTP (required for Web Pages, Optional for FTP Fileset)
pt_br: HTTP (necessário para as páginas web, opcional para o conjunto de arquivos do FTP)

source: If you want to offer the FreeBSD web pages, you will need to install a web server. You may optionally offer the FTP fileset via HTTP. The choice of web server software is left up to the mirror administrator. Some of the most popular choices are:
pt_br: Se você deseja disponibilizar as páginas web do FreeBSD, você vai precisar instalar um servidor web. Opcionalmente você poderá oferecer acesso a sua árvore de FTP via HTTP. A escolha do software do servidor web é uma escolha do administrador do site espelho. As opções mais populares são:

source: <package>www/apache24</package>: <application>Apache</application> is still one of the most widely deployed web servers on the Internet. It is used extensively by the FreeBSD Project.
pt_br: <package>www/apache24</package>: O <application>Apache</application> é o servidor web mais amplamente utilizado na internet. Ele é usado extensivamente pelo projeto FreeBSD.

source: <package>www/boa</package>: <application>Boa</application> is a single-tasking HTTP server. Unlike traditional web servers, it does not fork for each incoming connection, nor does it fork many copies of itself to handle multiple connections. Although, it should provide considerably great performance for purely static content.
pt_br: <package>www/boa</package>: O <application>Boa</application> é um servidor HTTP single-task. Ao contrário dos servidores Web tradicionais, o seu processo não se divide para cada conexão de entrada e nem cria muitas cópias de si mesmo para lidar com várias conexões. Entretanto, ele fornece um desempenho excelente para conteúdo puramente estático.

source: <package>www/cherokee</package>: <application>&gt;Cherokee</application> is a very fast, flexible and easy to configure web server. It supports the widespread technologies nowadays: FastCGI, SCGI, PHP, CGI, SSL/TLS encrypted connections, vhosts, users authentication, on the fly encoding and load balancing. It also generates <application>Apache</application> compatible log files.
pt_br: <package>www/cherokee</package>: O <application>&gt;Cherokee</application> é um servidor web muito rápido, flexível e fácil de configurar. Ele suporta as tecnologias difundidas atualmente: FastCGI, SCGI, PHP, CGI, conexões criptografadas por SSL/TLS, vhosts, autenticação de usuários, codificação on the fly e balanceamento de carga. Ele também gera arquivos de log compatíveis com o <application>Apache</application>.

source: <package>www/lighttpd</package>: <application>lighttpd</application> is a secure, fast, compliant and very flexible web server which has been optimized for high-performance environments. It has a very low memory footprint compared to other web servers and takes care of cpu-load.
pt_br: <package>www/lighttpd</package>: O <application>lighttpd</application> é um servidor web seguro, rápido, compatível com os padrões e muito flexível o qual foi otimizado para ambientes de alto desempenho. Tem um consumo de memória muito baixo em comparação com outros servidores Web, bem como um baixo consumo de CPU.

source: <package>www/nginx</package>: <application>nginx</application> is a high performance edge web server with a low memory footprint and key features to build a modern and efficient web infrastructure. Features include a HTTP server, HTTP and mail reverse proxy, caching, load balancing, compression, request throttling, connection multiplexing and reuse, SSL offload and HTTP media streaming.
pt_br: <package>www/nginx</package>: O <application>nginx</application> é um servidor web de alto desempenho com baixo consumo de memória e recursos-chave para construir uma infraestrutura web moderna e eficiente. Os recursos incluem um servidor HTTP, proxy reverso de HTTP e email, armazenamento em cache, balanceamento de carga, compactação, limitação de solicitações, multiplexação e reutilização de conexões, descarregamento de SSL e streaming de mídia por HTTP.

source: <package>www/thttpd</package>: If you are going to be serving a large amount of static content you may find that using an application such as <application>thttpd</application> is more efficient than others. It is also optimized for excellent performance on FreeBSD.
pt_br: <package>www/thttpd</package>: Se você estiver servindo uma grande quantidade de conteúdo estático, você pode descobrir que usar uma aplicação como o <application>thttpd</application> é mais eficiente do que outros servidores web. Ele também é otimizado para ter um excelente desempenho no FreeBSD.

source: How to Mirror FreeBSD
pt_br: Como espelhar o FreeBSD

source: Ok, now you know the requirements and how to offer the services, but not how to get it. :-) This section explains how to actually mirror the various parts of FreeBSD, what tools to use, and where to mirror from.
pt_br: Ok, agora você conhece os requisitos e sabe como oferecer os serviços, mas não sabe como obtê-los. :-) Esta seção explica como realmente espelhar as várias partes do FreeBSD, quais ferramentas utilizar e de onde espelhar.

source: Mirroring the FTP Site
pt_br: Espelhando o site FTP

source: The FTP area is the largest amount of data that needs to be mirrored. It includes the <emphasis>distribution sets</emphasis> required for network installation, the <emphasis>branches</emphasis> which are actually snapshots of checked-out source trees, the <emphasis>ISO Images</emphasis> to write CD-ROMs with the installation distribution, a live file system, and a snapshot of the ports tree. All of course for various FreeBSD versions, and various architectures.
pt_br: A área FTP possui a maior quantidade de dados a serem espelhados. Ela inclui os <emphasis>conjuntos de distribuição</emphasis> necessários para a instalação em rede, os <emphasis>branches</emphasis> que são snapshots das árvores de código fonte, as <emphasis>Imagens ISO</emphasis> para gravar CD-ROMs com a distribuição de instalação, um sistema de arquivos ativo e um snapshot da árvore de ports. E claro, tudo isso para as várias versões do FreeBSD e diversas arquiteturas.

source: The best way to mirror the FTP area is <application>rsync</application>. You can install the port <package>net/rsync</package> and then use rsync to sync with your upstream host. <application>rsync</application> is already mentioned in <xref linkend="mirror-serv-rsync"/>. Since <application>rsync</application> access is not required, your preferred upstream site may not allow it. You may need to hunt around a little bit to find a site that allows <application>rsync</application> access.
pt_br: A melhor maneira de espelhar a área FTP é com o <application>rsync</application>. Você pode instalar o port <package>net/rsync</package> e então usar o rsync para sincronizar com seu host upstream. O <application>rsync</application> já foi mencionado em <xref linkend="mirror-serv-rsync"/>. Como o acesso <application>rsync</application> não é necessário, seu site de upstream preferido pode não permitir isso. Talvez você precise procurar um pouco mais para localizar um site que permita acesso por <application>rsync</application>.

source: Since the number of <application>rsync</application> clients will have a significant impact on the server machine, most admins impose limitations on their server. For a mirror, you should ask the site maintainer you are syncing from about their policy, and maybe an exception for your host (since you are a mirror).
pt_br: Como o número de clientes <application>rsync</application> terá um impacto significativo na performance do servidor, a maioria dos administradores impõe limitações em seus servidores. Para um espelho, você deve perguntar ao mantenedor do site com o qual você está sincronizando sobre sua política, e talvez pedir uma exceção para o seu host (já que você também é um site espelho).

source: A command line to mirror FreeBSD might look like:
pt_br: Um exemplo de linha de comando para espelhar o FreeBSD pode ser verificada abaixo:

source: Consult the documentation for <application>rsync</application>, which is also available at <link xlink:href="http://rsync.samba.org/">http://rsync.samba.org/</link>, about the various options to be used with rsync. If you sync the whole module (unlike subdirectories), be aware that the module-directory (here "FreeBSD") will not be created, so you cannot omit the target directory. Also you might want to set up a script framework that calls such a command via <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Consulte a documentação do <application>rsync</application>, que também está disponível em <link xlink:href="http://rsync.samba.org/">http://rsync.samba.org/</link>, sobre as várias opções a serem usadas com o rsync. Se você sincronizar o módulo inteiro (diferentemente dos subdiretórios), esteja ciente de que o diretório do módulo (aqui "FreeBSD") não será criado, então você não pode omitir o diretório de destino. Além disso, você pode querer configurar um script que chame tal comando via <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Mirroring the WWW Pages
pt_br: Espelhando as páginas WWW

source: The FreeBSD website should only be mirrored via <application>rsync</application>.
pt_br: O site do FreeBSD deve ser espelhado apenas via <application>rsync</application>.

source: A command line to mirror the FreeBSD web site might look like:
pt_br: Uma linha de comando para espelhar o site do FreeBSD pode parecer com:

source: Mirroring Packages
pt_br: Espelhando os Pacotes
