<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/es/news/press-rel-1.sgml,v 1.2 1999/09/06 07:03:03 peter Exp $">
<!ENTITY title "FreeBSD Nota de Prensa: Abril 22, 1999">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
<!ENTITY % newsincludes SYSTEM "includes.sgml"> %newsincludes;
]>
<!-- $FreeBSD: www/es/news/press-rel-1.sgml,v 1.2 1999/09/06 07:03:03 peter Exp $ -->

<html>
&header;

<!--
<img src="../gifs/pressreleases.jpg" align="right" border="0">
-->

<p></p>

<h2>FreeBSD utilizado para Generar Espectaculares Efectos Especiales</h2>

<p><b>Concord, CA, Abril 22, 1999</b>:
32 m&aacute;quinas con procesador dual y FreeBSD se han utilizdo para
generar los efectos especiales de la pel&iacute;cula <em>The Matrix</em>,
de Warner Brothers.</p>

<p>La empresa Manex  Visual  Effects ha usado 32 m&aacute;quinas Dell
Precision  410  Dual  P-II/450 con FreeBSD como n&uacute;cleo de
renderizaci&oacute;n. Charles Henrich, administrador de sistemas senior
comenta, "Llegamos a un punto en el que no ten&iacute;amos suficiente
potencia de computaci&oacute;n para las secuencias 3-D con nuestra 
infraestructura de sistemas existente basada en SGI. Ah&iacute; fue
cuando decidimos usar una soluci&oacute;n basada en FreeBSD, debido a la
posibilidad de obtener de manera r&aacute;pida todo el hardware necesario,
adem&aacute;s de la facilidad de instalaci&oacute;n y adminitraci&oacute;n
de FreeBSD. Trabajando con Dell, adquirimos 32 de estos sistemas un 
mi&eacute;rcoles, y el s&aacute;bado por la tarde ya estaban renderizando
en producci&oacute;n. Fue un gran esfuerzo por parte de todos, y no creo
que esto hubiese sido posible si hubiesemos escogido cualquier otro
Sistema Operativo."</p>

<p>FreeBSD es un potente sistema operativo, con todo el c&oacute;digo 
fuente de libre distribuci&oacute;n basado en el UNIX de la
Berkeley Software Distribution. Est&aacute; disponible gratuitamente en
numerosos servidores de Internet y en CD-ROM a trav&eacute;s de Walnut
Creek CD-ROM, e incluye miles de aplicaciones portadas incluyendo
renderizaci&oacute;n de gr&aacute;ficos 3D y muchas otras herramientas de
igual potencia. FreeBSD est&aacute; optimizado para usar con procesadores
Inter x86, coraz&oacute;n de la versatilidad y comodidad de los computadores
personales. Infinitamente personalizable, FreeBSD est&aacute; en el 
coraz&oacute;n de las principales aplicaciones de alto rendimiento en
Internet como Yahoo! y U.S. West ya que no existen restricciones de
licencia y puede ser copiado y modificado libremente.</p>

<p>Para m&aacute;s informaci&oacute;n sobre FreeBSD, visitar 
<a href="http://www.freebsd.org/">http://www.freebsd.org/</a> y
<a href="http://www.cdrom.com/">http://www.cdrom.com/</a>. Para m&aacute;s
informaci&oacute;n sobre Manex Visual Effects, por favor, visitar
<a href="http://www.mvfx.com/">http://www.mvfx.com/</a>.</p>

&footer;
</body>
</html>
