<!--
     The FreeBSD Documentation Project

     The FreeBSD Spanish Documentation Project
     %SOURCE% en_US.ISO8859-1/books/handbook/x11/chapter.sgml
     %SRCID%    1.190

     $FreeBSD$
     $FreeBSDes: doc/es_ES.ISO8859-1/books/handbook/x11/chapter.sgml,v 1.5 2004/10/09 01:38:16 jesusr Exp $
-->

<chapter id="x11">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Ken</firstname>
        <surname>Tom</surname>
        <contrib>Actualizado al servidor X11 de X.Org por </contrib>
      </author>
      <author>
        <firstname>Marc</firstname>
        <surname>Fonvieille</surname>
      </author>
    </authorgroup>
  </chapterinfo>

  <title>El sistema X Window</title>

  <sect1 id="x11-synopsis">
    <title>Sinopsis</title>

    <para>&os; usa X11 para proporcionar una potente interfaz
      gr&aacute;fica.  X11 es una implementaci&oacute;n de c&oacute;digo
      abierto del sistema X Window que incluye
      <application>&xorg;</application> y
      <application>&xfree86;</application>.  En las versiones de
      &os; hasta &os;&nbsp;4.10-RELEASE y &os;&nbsp;5.3-RELEASE el
      sistema X window que se instalar&aacute; por defecto es
      <application>&xfree86;</application>, el servidor X11
      distribuido por el proyecto &xfree86;.  Despu&eacute;s de
      &os;&nbsp;5.3-RELEASE el sistema X Window pas&oacute; a
      ser <application>&xorg;</application>, el servidor X11
      distribuido por la Fundaci&oacute;n X.Org.</para>

    <para>Este cap&iacute;tulo cubre la instalaci&oacute;n y
      configuraci&oacute;n de X11 poniendo &eacute;nfasis en
      <application>&xorg;</application>.  Si quiere
      informaci&oacute;n sobre la configuraci&oacute;n de
      <application>&xfree86;</application> o versiones
      anteriores de &xorg; consulte las versiones archivadas
      del &laquo;Handbook&raquo; de &os; en <ulink
       url="http://docs.FreeBSD.org/doc/"></ulink>.</para>

    <para>Para mas informaci&oacute;n del hardware de v&iacute;deo
      que X11 soporta consulte la p&aacute;gina web de <ulink
      url="http://www.x.org/">&xorg;</ulink>.</para>


    <para>Despu&eacute;s de leer este cap&iacute;tulo usted
      sabr&aacute;:</para>

    <itemizedlist>
      <listitem>
        <para>Cu&aacute;les son los diferentes componentes del
	  sistema X Window y como interoperan.</para>
      </listitem>

      <listitem>
        <para>C&oacute;mo instalar y configurar X11.</para>
      </listitem>

      <listitem>
        <para>C&oacute;mo instalar y usar diferentes gestores
	  de ventanas.</para>
      </listitem>

      <listitem>
        <para>C&oacute;mo usar tipos de letra &truetype; en X11.  
	  </para>
      </listitem>

      <listitem>
        <para>Como preparar su sistema para iniciar la sesi&oacute;n
          de forma gr&aacute;fica (<application>XDM</application>).</para>
      </listitem>
    </itemizedlist>

    <para>Antes de leer este cap&iacute;tulo deber&iacute;a:</para>

    <itemizedlist>
      <listitem>
        <para>Saber c&oacute;mo instalar software de terceros
          (<xref linkend="ports">).</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>Este cap&iacute;tulo cubre la instalaci&oacute;n y
         configuraci&oacute;n de los servidores X11
         <application>&xorg;</application> y
         <application>&xfree86;</application>.  La mayor&iacute;a de los
         ficheros de configuraci&oacute;n, &oacute;rdenes y sintaxis son
         id&eacute;nticos.  En los casos en que haya diferencias se
         mostrar&aacute; la sintaxis de
         <application>&xorg;</application> y
         <application>&xfree86;</application>.</para>
     </note>

  </sect1>

  <sect1 id="x-understanding">
    <title>Entender X</title>

    <para>Usar X por primera vez puede resultar chocante para alguien
      familiarizado con otros entornos gr&aacute;ficos, como
      &microsoft.windows; o &macos;.</para>

    <para>No es necesario entender todos los detalles de los diferentes
      componentes de X y como interact&uacute;an, pero un conocimiento
      b&aacute;sico hace posible el sacarle m&aacute;s provecho a la
      potencia de X.</para>

    <sect2>
      <title>&iquest;Por qu&eacute; X?</title>

      <para>X no es el primer sistema de ventanas escrito para &unix;
        pero es el m&aacute;s popular de todos ellos.  El equipo original
        que desarroll&oacute; X trabaj&oacute; en otro sistema de ventanas
        antes de escribir X.  Ese sistema se llam&oacute; &laquo;W&raquo;
        (de &laquo;Window&raquo; que significa ventana en ingl&eacute;s).  
        X era solo la siguiente letra en el alfabeto Romano.</para>

      <para>X se puede llamar &laquo;X&raquo;
        &laquo;X Window System&raquo;, &laquo;X11&raquo; y de otras
        formas. Tambi&eacute;n puede usar el t&eacute;rmino
        &laquo;X Windows&raquo; para describir X11 si lo que quiere es
        ofender a algunas personas; si quiere saber m&aacute;s sobre esto
        consulte &man.X.7;.</para>
    </sect2>

    <sect2>
      <title>El modelo cliente/servidor de X</title>

      <para>X fue dise&ntilde;ado desde el principio pensando en redes
        y adopt&oacute; un modelo &laquo;cliente-servidor&raquo;.</para>

      <para>En el modelo de X el &laquo;servidor X&raquo; se ejecuta en la
        m&aacute;quina que tiene el teclado, monitor y rat&oacute;n.  El servidor
        es responsable de manejar la pantalla, la entrada de datos a
        trav&eacute;s del teclado, el rat&oacute;n, etc.  Cada
        aplicaci&oacute;n X (como una <application>XTerm</application> o
        <application>&netscape;</application>) es un
        &laquo;cliente&raquo;.  Un cliente manda mensajes al servidor como
        &laquo;Por favor dibuja una ventana en estas coordenadas&raquo; y el
        servidor devuelve mensajes como &laquo;El usuario ha pulsado el
        bot&oacute;n OK&raquo;.</para>

      <para>S&iacute; solo hay un ordenador involucrado, como en una
        casa o una peque&ntilde;a oficina, el servidor X y los clientes
        X seguramente se ejecutar&aacute;n en el mismo sistema.  Sin embargo, es
        perfectamente posible ejecutar el servidor X en un sistema de
        escritorio menos potente y ejecutar las aplicaciones X (los
        clientes) en, por ejemplo, la potente y cara m&aacute;quina que sirve
        la oficina.  En este panorama la comunicaci&oacute;n entre el
        cliente X y el servidor tiene lugar a trav&eacute;s de la red.</para>

      <para>Esto confunde a algunas personas, porque la terminolog&iacute;a es
        exactamente opuesta a lo que ellos esperan.  Ellos esperan que el
        &laquo;servidor X&raquo; sea la m&aacute;quina grande que hay en el 
	s&oacute;tano y que el &laquo;cliente X&raquo; sea la m&aacute;quina
        de su mesa.</para>

      <para>Es importante que recuerde que el servidor X es la
        m&aacute;quina con el monitor y el teclado y que los clientes
        X son los programas que muestran las ventanas.</para>

      <para>No hay nada en el protocolo que obligue a que el cliente y el
        servidor tengan que usar el mismo sistema operativo o incluso que
        est&eacute;n en el mismo sistema.  Es posible ejecutar un servidor X
        en &microsoft.windows; o en el &macos; de Apple; de hecho hay varias
        aplicaciones libres y comerciales que hacen exactamente eso.</para>

      <para>A partir de &os;&nbsp;5.3-RELEASE, el servidor X que se instala
        con &os; es <application>&xorg;</application>, que es libre  y
        se distribuye bajo una licencia muy similar a la de &os;.  
        Tambi&eacute;n hay servidores X comerciales para &os;.</para>
    </sect2>

    <sect2>
      <title>El gestor de ventanas</title>

      <para>La filosof&iacute;a de dise&ntilde;o de X es m&aacute;s parecida
        a la de &unix;: &laquo;herramientas, no normas&raquo;.  Esto
        significa que X no impone c&oacute;mo debe hacerse una tarea.  En
        lugar de eso proporciona herramientas al usuario y es responsabilidad
        suya decidir qu&eacute; hacer con ellas.</para>

      <para>Esta filosof&iacute;a se extiende a X; no impone como deben verse
        las ventanas en la pantalla, c&oacute;mo moverlas con el rat&oacute;n,
        qu&eacute; teclas deber&iacute;an usarse para moverse entre ventanas
        (por ejemplo <keycombo action="simul">
          <keycap>Alt</keycap>
          <keycap>Tab</keycap>
        </keycombo>, en &microsoft.windows;), c&oacute;mo deben ser las
        barras de t&iacute;tulo en cada ventana, si tienen o no bot&oacute;n
        de cierre, etc.</para>

      <para>En lugar de eso X delega esta responsabilidad en una
        aplicaci&oacute;n llamada &laquo;gestor de ventanas&raquo;.  Hay
        docenas de gestores de ventanas disponibles para X:
        <application>AfterStep</application>,
        <application>Blackbox</application>, <application>ctwm</application>,
        <application>Enlightenment</application>,
        <application>fvwm</application>, <application>Sawfish</application>,
        <application>twm</application>,
	<application>Window Maker</application>, etc.  Cada uno de estos
	gestores de ventanas tiene un aspecto diferente; algunos soportan
	&laquo;escritorios virtuales&raquo;; otros permiten personalizar las
	teclas para manejar el escritorio; otros tienen un bot&oacute;n de
	&laquo;Inicio&raquo; o algo similar; otros tienen
	&laquo;dise&ntilde;os modificables&raquo;, permitiendo un cambio
	completo del aspecto mediante un nuevo dise&ntilde;o.  Estos gestores
	de ventanas, y muchos otros, est&aacute;n en la
	categor&iacute;a <filename>x11-wm</filename> de los ports.</para>

      <para>Adem&aacute;s, los entornos de escritorio
        <application>KDE</application> y <application>GNOME</application>
        tienen sus propios gestores de ventanas integrados con el
        escritorio.</para>

      <para>Cada gestor de ventanas tiene diferentes mecanismos de
        configuraci&oacute;n; en algunos debe escribir el fichero de
        configuraci&oacute;n a mano, otros tienen herramientas gr&aacute;ficas
        para la mayor parte de la configuraci&oacute;n; y al menos uno
        (<application>Sawfish</application>) tiene un fichero de
        configuraci&oacute;n escrito en un dialecto del lenguaje Lisp.</para>

      <note>
        <title>Pol&iacute;tica de foco</title>

        <para>Otra responsabilidad del gestor de ventanas es la
          &laquo;pol&iacute;tica de foco&raquo; del rat&oacute;n.  Todos los
          sistemas de ventanas necesitan algo para elegir una ventana activa
          que recibir&aacute; los eventos y tambi&eacute;n debieran indicar
          claramente qu&eacute; ventana est&aacute; activa.
        </para>

        <para>Una pol&iacute;tica muy popular es la de &laquo;click to
          focus&raquo;.  Este es el modelo que utiliza
          &microsoft.windows;, en el que una ventana se convierte en activa
          al recibir un clic del rat&oacute;n.
        </para>

        <para>X no tiene ninguna pol&iacute;tica de foco.  En lugar de eso el 
          gestor de ventanas controla qu&eacute; ventana tiene el foco en todo 
          momento.  Los diferentes gestores de ventanas tienen diferentes 
          pol&iacute;ticas de foco.  Todos soportan la pol&iacute;tica 
          &laquo;clic-para-foco&raquo; y la mayor&iacute;a de ellos 
          tambi&eacute;n soportan otros m&eacute;todos.</para>

        <para>Las pol&iacute;ticas de foco m&aacute;s populares son:</para>

        <variablelist>
          <varlistentry>
            <term>el-foco-sigue-al-rat&oacute;n
	      (<literal>focus-follows-mouse</literal>)</term>

            <listitem>
              <para>La ventana que esta bajo el puntero del rat&oacute;n es
                la ventana que tiene el foco.  No es necesario que la ventana
                est&eacute; encima de las dem&aacute;s ventanas.  El foco se
                cambia al apuntar a otra ventana, aunque no es necesario hacer
                clic en ella.</para>
            </listitem>
          </varlistentry>

          <varlistentry>
            <term>foco-descuidado
	      <literal>sloppy-focus</literal></term>

            <listitem>
              <para>Esta pol&iacute;tica es una peque&ntilde;a
                extensi&oacute;n de
                &laquo;el-foco-sigue-al-rat&oacute;n&raquo;.  En
                &laquo;el-foco-sigue-al-rat&oacute;n&raquo; si el
                rat&oacute;n se mueve sobre la ventana ra&iacute;z (o fondo)
                ninguna ventana tiene el foco y las pulsaciones del
                teclado se perder&aacute;n.  Con la pol&iacute;tica
                &laquo;foco-descuidado&raquo; el foco s&oacute;lo cambia
                cuando el cursor entra en una nueva ventana y no cuando
                sale de la ventana actual.</para>
            </listitem>
          </varlistentry>

          <varlistentry>
            <term>click-para-foco
	      <literal>click-to-focus</literal></term>

            <listitem>
              <para>La ventana activa se selecciona con un clic del
                rat&oacute;n.  La ventana se puede &laquo;levantar&raquo;
                y aparecer delante de las dem&aacute;s ventanas.  Todas las
                pulsaciones de teclado ser&aacute;n redirigidas a esa ventana
                aunque el cursor se mueva a otra ventana.</para>
            </listitem>
          </varlistentry>
        </variablelist>

        <para>Muchos gestores de ventanas soportan otras pol&iacute;ticas o
          variaciones de estas.  Consulte la documentaci&oacute;n del propio
          gestor de ventanas.</para>
      </note>
    </sect2>

    <sect2>
      <title>Widgets</title>

      <para>La idea de X de hacer herramientas en vez de normas
        y se extiende a los &laquo;widgets&raquo; que se ven en la
        pantalla de cada aplicaci&oacute;n.</para>

      <para>&laquo;Widget&raquo; es un t&eacute;rmino que abarca todos los
        objetos en el interfaz de usuario que pueden pulsarse con el
	rat&oacute;n manipularse de alguna manera: botones,
        &laquo;check boxes&raquo;, listas, etc.  &microsoft.windows; los
        llama &laquo;controles&raquo;.</para>

      <para>&microsoft.windows; y &macos; de Apple tienen una pol&iacute;tica
        de &laquo;widgets&raquo; muy r&iacute;gida.  Se supone que los
        desarrolladores de aplicaciones comparten el aspecto.  En X no se
        consider&oacute; imponer un estilo gr&aacute;fico o un conjunto de
        &laquo;widgets&raquo; al que adherirse.</para>

      <para>Como resultado no se puede esperar que las aplicaciones de X
        tengan un aspecto homog&eacute;neo.  Hay varios conjuntos de
        &laquo;widgets&raquo; y variaciones muy populares como el
        &laquo;widget&raquo; Athena creado en el MIT,
        <application>&motif;</application> (donde los &laquo;widgets&raquo;
	de &microsoft.windows; fueron modelados, con todos los bordes
	biselados y tres tonos de gris), <application>OpenLook</application>,
	y otros.</para>

      <para>Las aplicaciones m&aacute;s modernas de X usan un conjunto
        de &laquo;widgets&raquo; con mejor aspecto, o Qt, utilizado
	por <application>KDE</application>, o GTK+, que usa el proyecto
	<application>GNOME</application>.  Se intenta que el aspecto del
	escritorio de &unix; sea parecido, lo que hace la vida m&aacute;s
	f&aacute;cil al usuario novato.</para>
    </sect2>
  </sect1>     

  <sect1 id="x-install">
    <title>Instalar X11</title>

    <para><application>&xorg;</application> es la implementaci&oacute;n
      de X11 por omisi&oacute;n en &os;.  <application>&xorg;</application>
      est&aacute; basado en c&oacute;digo de
      <application>&xfree86&nbsp;4.4RC2</application> y X11R6.6.  
      La versi&oacute;n de <application>&xorg;</application> que se
      distribuye actualmente en la Colecci&oacute;n de Ports de &os; es
      la &xorg.version;.</para>

    <para>Para compilar e instalar <application>&xorg;</application>
    desde la colecci&oacute;n de ports:</para>

    <screen>&prompt.root; <userinput>cd /usr/ports/x11/xorg</userinput> 
&prompt.root; <userinput>make install clean</userinput></screen>

    <note>
      <para>Si quiere compilar e instalar <application>&xorg;</application>
        entero, aseg&uacute;rese de tener como m&iacute;nimo
        2GB de espacio disponible.<para>
    </note>


    <para>Si lo prefiere puede instalar &xorg; con packages.  Cuando
      utilice la capacidad de &man.pkg.add.1; para instalar packages
      que descargue remotamente recuerde que no debe escribir el
      n&uacute;mero de versi&oacute;n.  &man.pkg.add.1; descargar&aacute;
      autom&aacute;ticamente la &uacute;ltima versi&oacute;n de la
      aplicaci&oacute;n..</para>

    <para>Veamos qu&eacute; es lo que hay que hacer para descargar e
      instalar el package de
      <application>&xorg;</application>:</para>

    <screen>&prompt.root; <userinput>pkg_add -r xorg</userinput></screen>

    <note><para>El anterior ejemplo instala la distribuci&oacute;n X11
      completa, es decir, servidores, clientes, tipos de letra, etc.  
      Hay packages y ports con cada uno de esos elementos por
      separado.</para></note>

    <para>En el resto del cap&iacute;tulo se explica c&oacute;mo
      configurar X11 y c&oacute;mo configurar un entorno de escritorio
      que le resulte productivo.</para>


  </sect1>

  <sect1 id="x-config">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Christopher</firstname>
          <surname>Shumway</surname>
          <contrib>Escrito por </contrib>
          <!-- Julio 2001 -->
        </author>
      </authorgroup>
    </sect1info>
    <title>Configuraci&oacute;n de X11</title>


    <indexterm><primary>&xorg;</primary></indexterm>
    <indexterm><primary>X11</primary></indexterm>

    <sect2>
      <title>Antes de empezar</title>

      <para>Antes de configurar X11 necesitar&aacute; la siguiente
        informaci&oacute;n sobre el sistema:</para>

      <itemizedlist>
        <listitem><para>Especificaciones del monitor</para></listitem>
        <listitem><para>Chipset de la tarjeta de v&iacute;deo</para>
	  </listitem>
        <listitem><para>Memoria de la tarjeta de v&iacute;deo</para>
	  </listitem>
      </itemizedlist>

      <indexterm><primary>horizontal scan rate</primary></indexterm>
      <indexterm><primary>vertical scan rate</primary></indexterm>

      <para>X11 usa las especificaciones del monitor para determinar
        la resoluci&oacute;n y la frecuencia de refresco a la que
        funcionar&aacute;.  Estas especificaciones se pueden encontrar
        normalmente en la documentaci&oacute;n que viene con el monitor o
        en la web del fabricante.  Se necesitan dos rangos de n&uacute;meros: la
        frecuencia de refresco horizontal y la vertical.</para>

      <para>El chipset de la tarjeta de v&iacute;deo define qu&eacute;
        controlador utilizar&aacute; X11 para comunicarse con el hardware
        gr&aacute;fico.  Con la mayor&iacute;a de chipsets es posible
	detectarlo autom&aacute;ticamente pero es &uacute;til saberlo en
        caso de que la detecci&oacute;n autom&aacute;tica no
        funcione.</para>

      <para>La memoria de la tarjeta gr&aacute;fica determina la
        resoluci&oacute;n y la profundidad de color a la que el sistema
        funcionar&aacute;.  Es importante saberlo para que el usuario
        conozca las limitaciones del sistema.</para>

    </sect2>

    <sect2>
      <title>Configurar X11</title>


<!--

 hemendik

 -->


      <para>A partir de la versi&oacute;n 7.3
        <application>&xorg;</application> puede funcionar sin utilizar
	fichero de configuraci&oacute;n; basta con teclear en el
	prompt:</para>

      <screen>&prompt.user; <userinput>startx</userinput></screen>

      <para>Si no funciona, o si la configuraci&oacute;n por
        omisi&oacute;n no es aceptable, hay que configurar X11
	a mano.</para>

      <note>
	<para>Ciertos entornos de escritorio como
	  <application>GNOME</application>,
	  <application>KDE</application> o
	  <application>XFce</application> tienen herramientas que permiten
	  al usuario configurar f&aacute;cilmente par&aacute;metros
	  de la pantalla como la resoluci&oacute;n.  Si la
	  configuraci&oacute;n por omisi&oacute;n no sirve y tiene
	  idea de instalar un entorno de escritorio puede seguir
	  adelante tranquilamente con la instalaci&oacute;n del entorno
	  de escritorio y utilice la herramienta que el software que
	  instale le facilite.</para>
      </note>

      <para>La configuraci&oacute;n de X11 es un proceso que consta de
        m&uacute;ltiples pasos.  El primero es generar un fichero inicial
	de configuraci&oacute;n.  Como superusuario teclee:</para>

      <screen>&prompt.root; <userinput>Xorg -configure</userinput></screen>

      <para>Esto generar&aacute; un fichero de configuraci&oacute;n
        bastante esquem&aacute;tico pero completo en
        <filename>/root</filename> llamado
	<filename>xorg.conf.new</filename> (si ha utilizado &man.su.1; o
	ha entrado directamente como superusuario afectar&aacute; al valor
	que tenga la variable de directorio
	<envar>$HOME</envar>).  X11 intentar&aacute; probar el hardware
	gr&aacute;fico del sistema y escribir un fichero de
	configuraci&oacute;n en el que registrar los controladores de
	dispositivo adecuados para hacer funcionar el harware que haya
	detectado.</para>

      <para>El siguiente paso es probar el fichero generado para
        verificar si <application>&xorg;</application>
        puede funcionar con el hardware gr&aacute;fico del sistema.  Para
	ello teclee:</para>

      <screen>&prompt.root; <userinput>Xorg -config xorg.conf.new</userinput></screen>

      <para>Si aparece una rejilla negra y gris junto con el cursor del
        rat&oacute;n con forma de X es que la configuraci&oacute;n ha
	tenido &eacute;xito.  Para salir de la prueba pulse
	simult&aacute;neamente
        <keycombo action="simul">
          <keycap>Ctrl</keycap>
          <keycap>Alt</keycap>
          <keycap>Retroceso</keycap>
        </keycombo>.</para>

	<note><para>Si el rat&oacute;n no funciona tendr&aacute; que
	  configurarlo antes de continuar.  Consulte la
	  <xref linkend="mouse"> en el cap&iacute;tulo de instalaci&oacute;n
	  de &os;.</para></note>

      <indexterm><primary>X11 tuning</primary></indexterm>

      <para>Despu&eacute;s modifique el fichero <filename>xorg.conf.new</filename>
        a su gusto.  Abra el fichero con un editor de texto (como
        &man.emacs.1; o &man.ee.1;).  Primero a&ntilde;ada las frecuencias
	del monitor.  Estas suelen estar expresadas en frecuencia de refresco
	horizontal y vertical.  Estos valores se a&ntilde;aden al fichero
        <filename>xorg.conf.new</filename> en la secci&oacute;n
        <literal>"Monitor"</literal>:</para>

      <programlisting>Section "Monitor"
        Identifier   "Monitor0"
        VendorName   "Monitor Vendor"
        ModelName    "Monitor Model"
        HorizSync    30-107
        VertRefresh  48-120
EndSection</programlisting>



      <para>Las palabras <literal>HorizSync</literal> y
        <literal>VertRefresh</literal>  podr&iacute;an no existir en el
        fichero de configuraci&oacute;n.  Si no existen es necesario
        a&ntilde;adirlas con la frecuencia horizontal correcta puesta
        despu&eacute;s de la palabra <literal>HorizSync</literal> y la
        frecuencia vertical correcta despu&eacute;s de la palabra
        <literal>VertRefresh</literal>.  En el ejemplo anterior se pusieron
        las frecuencias del monitor.</para>

      <para>X permite usar las caracter&iacute;sticas DPMS (Energy Star)
        con los monitores que lo soportan.  El programa &man.xset.1; controla
        el &laquo;timeout&raquo;, y puede forzar los modos
        &laquo;standby&raquo;, suspendido o apagado.  Si desea habilitar las
        caracter&iacute;sticas DPMS para su monitor tendr&aacute; que
        a&ntilde;adir la siguiente l&iacute;nea en la secci&oacute;n
        <literal>monitor</literal>:</para>


      <programlisting>
        Option       "DPMS"</programlisting>

      <indexterm>
        <primary><filename>xorg.conf</filename></primary>
      </indexterm>


      <para>Agrege a su
        <filename>xorg.conf.new</filename>
        la resoluci&oacute;n por omisi&oacute;n y la profundidad de
        color deseada.  Esto se define en la secci&oacute;n
        <literal>"Screen"</literal>:</para>

      <programlisting>Section "Screen"
        Identifier "Screen0"
        Device     "Card0"
        Monitor    "Monitor0"
        DefaultDepth 24
        SubSection "Display"
                Viewport  0 0
                Depth     24
                Modes     "1024x768"
        EndSubSection
EndSection</programlisting>


     <para>La palabra <literal>DefaultDepth</literal> describe la profundidad
        de color a la que arrancar&aacute; por omisi&oacute;n.  Esto puede
        sobrescribirse con el argumento <command>-bpp</command> de
	&man.Xorg.1; (o &man.XFree86.1;).  La palabra <literal>Modes</literal>
	describe la resoluci&oacute;n a la que funcionar&aacute; para esa
	profundidad de color.  Observe que s&oacute;lo los modos
	est&aacute;ndar VESA est&aacute;n soportados por el hardware
        gr&aacute;fico.  En el ejemplo anterior la profundidad de color es
        24 bits por pixel.  En esta profundidad de color la resoluci&oacute;n
        aceptada es 1024 por 768 pixels.</para>

      <para>Para acabar guarde el fichero de configuraci&oacute;n y
        pru&eacute;belo usando el modo de prueba descrito anteriormente
	</para>

      <note>
        <para>Una de las herramientas disponibles para ayudarle con el
          proceso de soluci&oacute;n de problemas es el fichero de
          &laquo;logs&raquo;, que contiene informaci&oacute;n de cada
          dispositivo al que el servidor X11 se conecta.  Los
          &laquo;logs&raquo; (o bit&aacute;coras) de
          <application>&xorg;</application> se pueden encontrar en
          <filename>/var/log/Xorg.0.log</filename>
          El nombre exacto del fichero de &laquo;log&raquo; puede variar
          entre <filename>Xorg.0.log</filename> y
          <filename>Xorg.8.log</filename> y as&iacute;
          sucesivamente.</para>
      </note>


      <para>Si todo ha ido bien ha llegado el momento de ubicar el
        fichero de configuraci&oacute;n donde &man.Xorg.1; pueda
	encontrarlo.  Puede dejarlo en
	<filename>/etc/X11/xorg.conf</filename> o
	<filename>/usr/local/etc/X11/xorg.conf</filename>.</para>

      <screen>&prompt.root; <userinput>cp xorg.conf.new /etc/X11/xorg.conf</userinput></screen>

      <para>El proceso de configuraci&oacute;n de X11 ha concluido.  
	Arranque <application>&xorg;</application> mediante
	&man.startx.1;.  Puede tambi&eacute;n arrancar el servidor X11
        utilizando &man.xdm.1;.</para>

      <note><para>Existe tambi&eacute;n una herramienta gr&aacute;fica de
	configuraci&oacute;n en X11, &man.xorgcfg.1;.  Permite definir de
	forma interactiva su configuraci&oacute; mediante la elecci&oacute;n
	de los controladores y las opciones adecuadas.  Este programa
	tambi&eacute;n puede usarse desde consola mediante la orden
	<command>xorgcfg -textmode</command>.  Para m&aacute;s
	informaci&oacute;n consulte la p&aacute;gina de manual de
	&man.xorgcfg.1;.</para>

      <para>Puede usar tambi&eacute;n &man.xorgconfig.1;.  Este programa es
        una herramienta orientada a consola que es bastante menos atractiva
	para el usuario, pero que puede funcionar en situaciones en las que
	otras herramientas no sirven.</para></note>



    </sect2>

    <sect2>
      <title>Configuraci&oacute;n avanzada</title>

      <sect3>
        <title>Configuraci&oacute;n de chipsets gr&aacute;ficos &intel; 
          i810</title>

        <indexterm><primary>Intel i810 graphic chipset</primary></indexterm>

        <para>Para configurar los chipsets integrados &intel; i810 es
          necesario el interfaz de programaci&oacute;n AGP
          <devicename>agpart</devicename> para que
          X11 pueda usarla.  Consulte la p&aacute;gina de manual de
          &man.agp.4; para m&aacute;s informaci&oacute;n.</para>


	<para>Hecho esto podr&aacute; configurar el hardware como cualquier
	  otra tarjeta gr&aacute;fica.  Tenga en cuenta que si en un
	  sistema que no tenga el controlador &man.agp.4; intenta cargar
	  el m&oacute;dulo del kernel con &man.kldload.8; no va a
	  funcionar.  El controlador tiene necesariamente que estar en el
	  kernel desde el mismo momento del arranque, cosa que puede
	  obtenerse bien compilando un nuevo kernel, bien utilizando
	  <filename>/boot/loader.conf</filename>.</para>
      </sect3>



      <sect3>
	<title>A&ntilde;adir una pantalla panor&aacute;mica a nuestro sistema</title>

	<indexterm><primary>widescreen flatpanel configuration</primary></indexterm>

	<para>A lo largo de esta secci&oacute;n se asumen unos m&iacute;nimos
	  de soltura con ciertos aspectos de configuraci&oacute;n avanzada.  Si
	  Si las herramientas est&aacute;ndar de configuraci&oacute;n que se
	  han descrito previamente no le ayudan a tener una
	  configuraci&oacute;n funcional busque en los ficheros de log,
	  ah&iacute; encontrar&aacute; informaci&oacute;n suficiente para
	  lograrlo.  Tendr&aacute; que utilizar un editor de texto a lo
	  largo de estas instrucciones.</para>

	<para>Los formatos actuales de pantalla panor&aacute;mica,
	  (tambi&eacute;n conocidas como &laquo;Widescreen&raquo;, WSXGA,
	  WSXGA+, WUXGA, WXGA, WXGA+, etc, soportan formatos de
	  16:10 y 10:9 o aspectos-tasa que pueden ser
	  problem&aacute;ticos.  Veamos algunos ejemplos de resoluciones de
	  pantalla en formatos 16:10:</para>

	<itemizedlist>
	  <listitem><para>2560x1600</para></listitem>
	  <listitem><para>1920x1200</para></listitem>
	  <listitem><para>1680x1050</para></listitem>
	  <listitem><para>1440x900</para></listitem>
	  <listitem><para>1280x800</para></listitem>
	</itemizedlist>

	<para>At some point, it will be as easy as adding one of these
	  resolutions as a possible <literal>Mode</literal> in the <literal>Section
	  "Screen"</literal> as such:</para>

	<programlisting>Section "Screen"
Identifier "Screen0"
Device     "Card0"
Monitor    "Monitor0"
DefaultDepth 24
SubSection "Display"
	Viewport  0 0
	Depth     24
	Modes     "1680x1050"
EndSubSection
EndSection</programlisting>

	<para><application>&xorg;</application> se basta y se sobra para
	  recabar la informaci&oacute;n de resoluci&oacute;n de su pantalla
	  panor&aacute;mica mediante la informaci&oacute;n
	  I2C/DDC, as&iacute; que sabe qu&eacute; frecuencias y
	  resoluciones puede manejar el monitor.</para>

	<para>Si esas <literal>ModeLines</literal> no existen en los
	  controladores tendr&aacute; usted que ayudar un poco a
	  <application>&xorg;</application>.  Lea atentamente el contenido
	  de <filename>/var/log/Xorg.0.log</filename>; de &eacute;l
	  podr&aacute; extraer suficiente informaci&oacute;n como para
	  crear un <literal>ModeLine</literal> que funcione.  Todo lo que
	  tiene que hacer es buscar informaci&oacute;n que se parezca
	  a esta:</para>

	<programlisting>(II) MGA(0): Supported additional Video Mode:
(II) MGA(0): clock: 146.2 MHz   Image Size:  433 x 271 mm
(II) MGA(0): h_active: 1680  h_sync: 1784  h_sync_end 1960 h_blank_end 2240 h_border: 0
(II) MGA(0): v_active: 1050  v_sync: 1053  v_sync_end 1059 v_blanking: 1089 v_border: 0
(II) MGA(0): Ranges: V min: 48  V max: 85 Hz, H min: 30  H max: 94 kHz, PixClock max 170 MHz</programlisting>

	<para>Esta informaci&oacute;n se llama informaci&oacute;n EDID.  Para
	  crear una <literal>ModeLine</literal> a partir de estos datos solamente
	  tiene que poner los n&uacute;meros en el orden correcto:</para>

	<programlisting>ModeLine &lt;name&gt; &lt;clock&gt; &lt;4 horiz. timings&gt; &lt;4 vert. timings&gt;</programlisting>

	<para>As&iacute; que la <literal>ModeLine</literal>
	  en la <literal>Section "Monitor"</literal> del ejemplo
	  tendr&iacute;a este aspecto:</para>

	<programlisting>Section "Monitor"
Identifier      "Monitor1"
VendorName      "Bigname"
ModelName       "BestModel"
ModeLine        "1680x1050" 146.2 1680 1784 1960 2240 1050 1053 1059 1089
Option          "DPMS"
EndSection</programlisting>

	<para>Como ve, con un poco de edici&oacute;n hemos culminado la tarea
	  y X deber&iacute;a ya poder arrancar sin problemas en su nuevo
	  monitor panor&aacute;mico.</para>
      </sect3>

    </sect2>
  </sect1>
  <sect1 id="x-fonts">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Murray</firstname>
          <surname>Stokely</surname>
          <contrib>Escrito por </contrib>
        </author>
      </authorgroup>
    </sect1info>
    <title>Uso de tipos en X11</title>

    <sect2 id="type1">
      <title>Tipos Type1</title>

      <para>Los tipos que X11 incluye por omisi&oacute;n no son precisamente
        ideales para las aplicaciones t&iacute;picas.  Los tipos grandes para
	presentaciones
        aparecen dentados y con un aspecto poco profesional, mientras
        que los tipos peque&ntilde;os en
        <application>&netscape;</application> son pr&aacute;cticamente
        ilegibles.  Sin embargo hay varios tipos de letra libres
        Type1 de alta calidad (&postscript;) que se pueden usar con
        X11.  Por ejemplo los tipos URW
        (<filename role="package">x11-fonts/urwfonts</filename>) incluyen
        una versi&oacute;n de alta calidad de los tipos est&aacute;ndar Type
	1 (<trademark class="registered">Times Roman</trademark>,
        (<trademark class="registered">Helvetica</trademark>,
        (<trademark class="registered">Palatino</trademark>, y muchas otras).  
        Las Freefonts (<filename role="package">x11-fonts/freefonts</filename>
	) incluyen muchas m&aacute;s pero la mayor&iacute;a est&aacute;n
        pensadas para usarse con software gr&aacute;fico como el
        <application>Gimp</application> y no son lo bastante completos para
        usarse como tipos de pantalla.  Adem&aacute;s X11 se
        puede configurar para usar tipos &truetype; con un
        esfuerzo m&iacute;nimo.  Para m&aacute;s detalles sobre esto consulte
        la p&aacute;gina del manual &man.X.7; o la
        <link 
        linkend="truetype">secci&oacute;n de tipos &truetype;</link>.</para>

      <para>Para instalar los tipos Type1 desde
        los ports ejecute las siguientes &oacute;rdenes:</para>

  <screen>&prompt.root; <userinput>cd /usr/ports/x11-fonts/urwfonts</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

      <para>Proceda del mismo modo con los FreeFonts o cualesquiera otras.  
        Para que el servidor X las detecte a&ntilde;ada la siguiente
        l&iacute;nea al fichero de configuraci&oacute;n de X
        (<filename>/etc/X11/xorg.conf</filename>:</para>

      <programlisting>FontPath "/usr/X11R6/lib/X11/fonts/URW/"</programlisting>

      <para>o bien desde una emulaci&oacute;n de terminal durante una
        sesi&oacute;n X ejecute</para>

      <screen>&prompt.user; <userinput>xset fp+ /usr/X11R6/lib/X11/fonts/URW</userinput>
&prompt.user; <userinput>xset fp rehash</userinput></screen>

      <para>Esto funcionar&aacute; hasta que la sesi&oacute;n X se cierre a
        menos que lo a&ntilde;ada a su fichero de inicio
        (<filename>~/.xinitrc</filename> en el caso de una sesi&oacute;n
        <command>startx</command> normal o <filename>~/.xsession</filename>
        si hace login desde un gestor gr&aacute;fico como
        <application>XDM</application>).  Una tercera forma ser&iacute;a
        usando el nuevo fichero
        <filename>/usr/X11R6/etc/fonts/local.conf</filename>:
        consulte la secci&oacute;n de <link
        linkend="antialias">anti-aliasing</link>.
      </para>
    </sect2>

    <sect2 id="truetype">
      <title>Tipos &truetype;</title>

      <indexterm><primary>Tipos TrueType</primary></indexterm>
      <indexterm><primary>fonts</primary>
        <secondary>TrueType</secondary>
      </indexterm>

        <para><application>&xorg;</application> se dise&ntilde;&oacute;
        pensando en que utilizara tipos &truetype;.  Hay dos
	m&oacute;dulos diferentes que pueden habilitar esta opci&oacute;n.  El
	m&oacute;dulo freetype se usa en en este ejemplo porque es m&aacute;s
	consistente con el resto de &laquo;back-ends&raquo; de
	representaci&oacute;n.  Para habilitar el m&oacute;dulo freetype debe
	a&ntilde;adir la siguiente l&iacute;nea a la secci&oacute;n
	<literal>"Module"</literal> del fichero
        <filename>/etc/X11/xorg.conf</filename>.</para>

      <programlisting>Load "freetype"</programlisting>

      <para>Ahora haga un directorio para los tipos &truetype; (por ejemplo
        <filename>/usr/X11R6/lib/X11/fonts/TrueType</filename>) y copie todos
        los tipos &truetype; en este directorio.  Recuerde que los
        tipos &truetype; no se pueden coger directamente de
        un &macintosh;; tienen que estar en formato &unix;/&ms-dos;/&windows;
        para usarlas con X11.  Una vez que los ficheros
        se hayan copiado en este directorio use
        <application>ttmkfdir</application> para crear un fichero
        <filename>fonts.dir</filename>, para que el representador de tipos
        de X sepa que se han instalado estos ficheros 
        nuevos.  <command>ttmkfdir</command> forma parte de la Colecci&oacute;n
        de Ports de &os;: <filename role="package">x11-fonts/ttmkfdir</filename>.
      </para>

<screen>&prompt.root; <userinput>cd /usr/local/lib/X11/fonts/TrueType</userinput>
&prompt.root; <userinput>ttmkfdir -o fonts.dir</userinput></screen>

      <para>Ahora a&ntilde;ada el directorio &truetype; a la ruta de
        tipos.  Esto es igual que lo anteriormente descrito sobre los
        tipos <link linkend="type1">Type1</link>.  Ejecute:</para>

<screen>&prompt.user; <userinput>xset fp+ /usr/local/lib/X11/fonts/TrueType</userinput>
&prompt.user; <userinput>xset fp rehash</userinput></screen>


      <para>o a&ntilde;ada una l&iacute;nea <literal>FontPath</literal> en su
        <filename>/etc/X11/xorg.conf</filename>.</para>

      <para>Esto es todo.  Ahora <application>&netscape;</application>,
        <application>Gimp</application>,
        <application>&staroffice;</application> y el resto de aplicaciones X
        debieran reconocer los tipos &truetype; instalados.  
        Los tipos muy  peque&ntilde;os (como el texto en una pantalla con
	alta resoluci&oacute;n viendo una p&aacute;gina web) y los
        tipos muy grandes (Dentro de
        <application>&staroffice;</application>) se ver&aacute;n
        much&iacute;simo mejor ahora.</para>
    </sect2>

    <sect2 id="antialias">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Joe Marcus</firstname>
            <surname>Clarke</surname>
            <contrib>Actualizado por </contrib>
            <!-- Mayo 2003 -->
          </author>
        </authorgroup>
      </sect2info>
      <title>Tipos Anti-Aliasing</title>

      <indexterm><primary>anti-aliased fonts</primary></indexterm>
      <indexterm><primary>fonts</primary>
        <secondary>anti-aliased</secondary></indexterm>

      <para>Los &laquo;tipos anti-aliasing&raquo; han estado en
        X11 desde
        <application>&xfree86;</application> 4.0.2.  Aunque la
        configuraci&oacute;n de los tipos era inc&oacute;moda
        antes de
        <application>&xfree86;</application> 4.3.0.  A partir de
        <application>&xfree86;</application> 4.3.0 todos los
        tipos de X11 que se encuentren en
        <filename>/usr/local/lib/X11/fonts/</filename> y
        <filename>~/.fonts/</filename> est&aacute;n disponibles
        autom&aacute;ticamente para aplicaciones que soporten Xft.  No todas
        las aplicaciones soportan Xft pero muchas ya tienen soporte
        Xft.  Ejemplos de aplicaciones que lo soportan son Qt 2.3 o superior
        (el &laquo;toolkit&raquo; del escritorio
        <application>KDE</application>), GTK+ 2.0 o superior (el
        &laquo;toolkit&raquo; del escritorio <application>GNOME</application>
	) y <application>Mozilla</application> 1.2 o superior.</para>

      <para>Para controlar qu&eacute; tipos
        &laquo;anti-aliasing&raquo; o configurar las propiedades
        &laquo;anti-aliasing&raquo; cr&eacute;e (o edite, si ya existe)
        el fichero
        <filename>/usr/local/etc/fonts/local.conf</filename>.  Se pueden
        modificar diversas opciones avanzadas del sistema de tipos Xft
	usando este fichero; esta secci&oacute;n describe solo algunas
	posibilidades simples.  Para m&aacute;s detalles consulte
	&man.fonts-conf.5;.</para>

      <indexterm><primary>XML</primary></indexterm>

      <para>Este fichero tiene que estar en formato XML.  Preste especial
        atenci&oacute;n a las may&uacute;sculas y min&uacute;sculas y
        aseg&uacute;rese de que las etiquetas est&aacute;n cerradas
        correctamente.  El fichero empieza con la t&iacute;pica cabecera XML
        seguida de una definici&oacute;n DOCTYPE y despu&eacute;s la etiqueta
        <literal>&lt;fontconfig&gt;</literal>:</para>

      <programlisting>
        &lt;?xml version="1.0"?&gt;
        &lt;!DOCTYPE fontconfig SYSTEM "fonts.dtd"&gt;
        &lt;fontconfig&gt;
      </programlisting>

      <para>Como se ha dicho antes todos los tipos en
        <filename>/usr/local/lib/X11/fonts/</filename> y en
        <filename>~/.fonts/</filename> est&aacute;n ya disponibles para las
        aplicaciones que soporten Xft.  Si usted desea a&ntilde;adir otro
        directorio adem&aacute;s de estos dos &aacute;rboles de directorios
        a&ntilde;ada una l&iacute;nea similar a esta en el fichero
        <filename>/usr/local/etc/fonts/local.conf</filename>:</para>
      
      <programlisting>&lt;dir&gt;/ruta/de/mis/tipos&lt;/dir&gt;</programlisting>

      <para>Despu&eacute;s de a&ntilde;adir los nuevos tipos, 
        y en especial los nuevos directorios de tipos, 
        debe ejecutar la siguiente orden para 
        reconstruir la cach&eacute; de tipos:</para>

      <screen>&prompt.root; <userinput>fc-cache -f</userinput></screen>

      <para>Los &laquo;tipos anti-aliasing&raquo; hacen los bordes
        ligeramente borrosos, lo que hace que el texto muy
        peque&ntilde;o sea m&aacute;s legible y elimina los escalones del
        texto grande pero puede causar fatiga visual aplicada al texto
        normal.  Para excluir los tipos de menos de 14
        puntos del &laquo;anti-aliasing&raquo; incluya las siguientes
        l&iacute;neas:</para>

      <programlisting>        &lt;match target="font"&gt;
            &lt;test name="size" compare="less"&gt;
                &lt;double&gt;14&lt;/double&gt;
            &lt;/test&gt;
            &lt;edit name="antialias" mode="assign"&gt;
                &lt;bool&gt;false&lt;/bool&gt;
            &lt;/edit&gt;
        &lt;/match&gt;
        &lt;match target="font"&gt;
            &lt;test name="pixelsize" compare="less" qual="any"&gt;
                &lt;double&gt;14&lt;/double&gt;
            &lt;/test&gt;
            &lt;edit mode="assign" name="antialias"&gt;
                &lt;bool&gt;false&lt;/bool&gt;
            &lt;/edit&gt;
        &lt;/match&gt;</programlisting>

      <indexterm><primary>fonts</primary>
        <secondary>spacing</secondary></indexterm>

      <para>El espacio entre algunos tipos tambi&eacute;n
        podr&iacute;a ser inapropiado con &laquo;anti-aliasing&raquo;, por ejemplo
        en el caso de <application>KDE</application>.  
        Una posible soluci&oacute;n para esto es forzar que el espacio entre
        los tipos sea 100.  A&ntilde;ada las siguientes 
        l&iacute;neas:</para>

       <programlisting>       &lt;match target="pattern" name="family"&gt;
             &lt;test qual="any" name="family"&gt;
                 &lt;string&gt;fixed&lt;/string&gt;
             &lt;/test&gt;
             &lt;edit name="family" mode="assign"&gt;
                 &lt;string&gt;mono&lt;/string&gt;
             &lt;/edit&gt;
          &lt;/match&gt;
          &lt;match target="pattern" name="family"&gt;
              &lt;test qual="any" name="family"&gt;
                  &lt;string&gt;console&lt;/string&gt;
              &lt;/test&gt;
              &lt;edit name="family" mode="assign"&gt;
                  &lt;string&gt;mono&lt;/string&gt;
              &lt;/edit&gt;
          &lt;/match&gt;</programlisting>

      <para>(Esto selecciona los otros nombres comunes para
        &laquo;tipos fixed&raquo; como <literal>"mono"</literal>);
        a&ntilde;ada tambi&eacute;n lo siguiente:</para>

      <programlisting>         &lt;match target="pattern" name="family"&gt;
             &lt;test qual="any" name="family"&gt;
                 &lt;string&gt;mono&lt;/string&gt;
             &lt;/test&gt;
             &lt;edit name="spacing" mode="assign"&gt;
                 &lt;int&gt;100&lt;/int&gt;
             &lt;/edit&gt;
         &lt;/match&gt;      </programlisting>

      <para>Algunos tipos, como Helvetica, podr&iacute;an
        tener problemas con &laquo;anti-aliasing&raquo;.  Normalmente esto
	se manifiesta en tipos que parecen cortados verticalmente por la
        mitad.  En el peor de los casos podr&iacute;a causar que el
        funcionamiento de aplicaciones como
        <application>Mozilla</application> se interrumpiese.  Para evitar
        esto puede a&ntilde;adir lo siguiente a
        <filename>local.conf</filename>:
      </para>

      <programlisting>         &lt;match target="pattern" name="family"&gt;
             &lt;test qual="any" name="family"&gt;
                 &lt;string&gt;Helvetica&lt;/string&gt;
             &lt;/test&gt;
             &lt;edit name="family" mode="assign"&gt;
                 &lt;string&gt;sans-serif&lt;/string&gt;
             &lt;/edit&gt;
         &lt;/match&gt;        </programlisting>

      <para>Una vez que haya terminado de editar
        <filename>local.conf</filename> aseg&uacute;rese de que el fichero
        termina con la etiqueta <literal>&lt;/fontconfig&gt;</literal>.  Si no
        lo hace los cambios  que haya hecho ser&aacute;n ignorados.</para>

      <para>Los tipos por omisi&oacute;n que vienen con
        X11 no son los ideales para &laquo;anti-aliasing&raquo;.  
        Puede encontrar otros mucho mejores en el port
        <filename role="package">x11-fonts/bitstream-vera</filename>.  Este
        port instalar&aacute; el fichero
        <filename>/usr/local/etc/fonts/local.conf</filename> si aun no se ha
        creado.  Si el fichero existe el port creara el fichero
        <filename>/usr/local/etc/fonts/local.conf-vera</filename>.  Combine
        el contenido de este fichero con
        <filename>/usr/local/etc/fonts/local.conf</filename> y los tipos
        Bitstream reemplazar&aacute;n autom&aacute;ticamente los
        tipos por defecto por X11 Serif, Sans Serif y
        Monospaced.</para>

      <para>Por si esto fuera poco los usuarios pueden a&ntilde;adir sus
        propios ajustes mediante sus ficheros personales
        <filename>.fonts.conf</filename>.  Los usuarios que deseen hacerlo
        deber&aacute;n crear un fichero <filename>~/.fonts.conf</filename>.  
        Este fichero tiene que estar tambi&eacute;n en formato XML.</para>

      <indexterm><primary>LCD screen</primary></indexterm>
      <indexterm><primary>Fonts</primary>
        <secondary>LCD screen</secondary></indexterm>

      <para>Un &uacute;ltimo punto: con pantallas LCD ser&iacute;a
        deseable un muestreo de subpixel, que consiste en configurar los
        componentes (separados horizontalmente) rojo, verde y azul para
        mejorar la resoluci&oacute;n horizontal; los resultados pueden ser
        impresionantes.  Para habilitarlo a&ntilde;ada la siguiente
        l&iacute;nea a
        <filename>local.conf</filename>:</para>

      <programlisting>
        &lt;match target="font"&gt;
            &lt;test qual="all" name="rgba"&gt;
                &lt;const&gt;unknown&lt;/const&gt;
            &lt;/test&gt;
            &lt;edit name="rgba" mode="assign"&gt;
                &lt;const&gt;rgb&lt;/const&gt;
            &lt;/edit&gt;
        &lt;/match&gt;
      </programlisting>

      <note><para>Dependiendo del tipo de pantalla <literal>rgb</literal>
        podr&iacute;a ser <literal>bgr</literal> o <literal>vrgb</literal> o
        <literal>vbgr</literal>: experimente y elija cu&aacute;l de ellos funciona
        mejor.</para></note>

      <indexterm><primary>Mozilla</primary></indexterm>
      <indexterm><primary>web browsers</primary>
        <secondary>Mozilla</secondary>
        <see>Mozilla</see></indexterm>

      <para>Una vez concluido el proceso &laquo;anti-aliasing&raquo; se
        deber&iacute;a activar la pr&oacute;xima vez que arranque X, aunque
        los programas necesitan saber como utilizarlo.  En 
        este momento el &laquo;toolkit&raquo; Qt es capaz de hacerlo, as&iacute;
        que <application>KDE</application> entero puede usar
        &laquo;tipos  anti-aliasing&raquo;.  GTK+ y
        <application>GNOME</application> tambi&eacute;n pueden usar
        &laquo;tipos anti-aliasing&raquo; mediante el &laquo;applet&raquo;
	&laquo;Font&raquo; (consulte <xref
        linkend="x11-wm-gnome-antialias"> para m&aacute;s detalle).  Por
        omisi&oacute;n <application>Mozilla</application>
        1.2 y versiones siguientes usar&aacute;n autom&aacute;ticamente
        &laquo;tipos anti-aliasing&raquo;.  Para deshabilitarlos
        recompile <application>Mozilla</application> usando el
        par&aacute;metro <makevar>-DWITHOUT_XFT</makevar>.</para>
    </sect2>
  </sect1>

  <sect1 id="x-xdm">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Seth</firstname>
          <surname>Kingsley</surname>
          <contrib>Escrito por </contrib>
        </author>
      </authorgroup>
    </sect1info>
    <title>El gestor de pantalla X</title>
    <sect2>
      <title>Descripci&oacute;n</title>

      <indexterm><primary>X Display Manager</primary></indexterm>
      <para>El gestor de pantalla X (<application>XDM</application>) es una
        parte opcional del sistema X Window que se usa para la gesti&oacute;n de
        sesiones.  Esto es &uacute;til en diferentes situaciones, como
        &laquo;Terminales X&raquo; con escritorios m&iacute;nimos y grandes
        servidores de red.  Como X Window System es independiente
        del protocolo y de la red hay muchas configuraciones posibles para
        ejecutar clientes y servidores X en diferentes equipos conectados a
        una red.  <application>XDM</application> dispone de un interfaz
        gr&aacute;fico para elegir a qu&eacute; pantalla se quiere
        conectar y pedir la informaci&oacute;n de autentificaci&oacute;n como
        el nombre de usuario y le contrase&ntilde;a.</para>

      <para><application>XDM</application> ac6t&uacute;a como proveedor de la
        misma funcionalidad que &man.getty.8; (consulte
        <xref linkend="term-config"> para m&aacute;s detalles).  Esto quiere
        decir que se encarga de las entradas al sistema en la pantalla a la
        que est&aacute; conectado y arranca el gestor de sesiones para que lo
        utilice el usuario (normalmente un gestor de ventanas
        X).  <application>XDM</application> espera a que el
	programa termine, env&iacute;a la se&ntilde;al de que el usuario ha
	terminado y que se le
        deber&iacute;a  desconectar de la pantalla.  En este punto
        <application>XDM</application> puede mostrar las pantallas de entrada
        al sistema y de selecci&oacute;n de pantalla para que el siguiente
        usuario intente acceder al sistema.</para>
    </sect2>

    <sect2>
      <title>Uso de XDM</title>

      <para>El d&aelig;mon <application>XDM</application> est&aacute; en
        <filename>/usr/local/bin/xdm</filename>.  Este programa se puede
        arrancar en cualquier momento como <username>root</username> y
        empezar&aacute; a gestionar la pantalla X en la m&aacute;quina
        local.  Si se quiere que <application>XDM</application> arranque cada
        vez que la m&aacute;quina se encienda puede hacerlo a&ntilde;adiendo
        una entrada a <filename>/etc/ttys</filename>.  Para m&aacute;s
        informaci&oacute;n sobre el formato y uso de este fichero consulte la
	<xref linkend="term-etcttys">.  Por omisi&oacute;n hay una l&iacute;nea en
        <filename>/etc/ttys</filename> que permite arrancar el
	d&aelig;mon <application>XDM</application> en una terminal virtual:
	</para>

      <screen>ttyv8   "/usr/local/bin/xdm -nodaemon"  xterm   off secure</screen>

      <para>Por omisi&oacute;n esta entrada est&aacute; deshabilitada; para habilitarla
        cambie el campo 5 de <literal>off</literal> a <literal>on</literal> y
        reinicie &man.init.8; usando los pasos descritos en la <xref
        linkend="term-hup">.  El primer campo es el nombre de la terminal que
        que gestiona el programa, <literal>ttyv8</literal>.  Es decir,
        <application>XDM</application> empezar&aacute; a
        ejecutarse en la terminal virtual n&uacute;mero 9.</para>
    </sect2>

    <sect2>
      <title>Configuraci&oacute;n de XDM</title>

      <para>El directorio de configuraci&oacute;n de
        <application>XDM</application> est&aacute; en
        <filename>/usr/local/lib/X11/xdm</filename>.  En este directorio hay
        varios ficheros que se usan para intervenir en el comportamiento y la
        apariencia de <application>XDM</application>.  Normalmente tendr&aacute;
        estos ficheros:</para>

      <informaltable frame="none">
        <tgroup cols="2">
          <thead>
            <row>
              <entry>Fichero</entry>
              <entry>Descripci&oacute;n</entry>
            </row>
          </thead>

          <tbody>
            <row>
              <entry><filename>Xaccess</filename></entry>
              <entry>Reglas de acceso para clientes.</entry>
            </row>

            <row>
              <entry><filename>Xresources</filename></entry>
              <entry>Recursos de X por omisi&oacute;n.</entry>
            </row>

            <row>
              <entry><filename>Xservers</filename></entry>
              <entry>Lista de pantallas locales y remotas a gestionar.</entry>
            </row>

            <row>
              <entry><filename>Xsession</filename></entry>
              <entry>&laquo;script&raquo; por omisi&oacute;n para el acceso al
                sistema.</entry>
            </row>

            <row>
              <entry><filename>Xsetup_</filename>*</entry>
              <entry>&laquo;script&raquo; para lanzar aplicaciones antes del
                acceso al sistema.</entry>
            </row>

            <row>
              <entry><filename>xdm-config</filename></entry>
              <entry>Configuraci&oacute;n de todas las pantallas de
              este equipo.</entry>
            </row>

            <row>
              <entry><filename>xdm-errors</filename></entry>
              <entry>Errores generados por el programa servidor.</entry>
            </row>

            <row>
              <entry><filename>xdm-pid</filename></entry>
              <entry>El ID de proceso del XDM que est&aacute;
                 funcionando.</entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>

      <para>En este directorio tambi&eacute;n hay unos cuantos programas y
        &laquo;scripts&raquo; que se usan para arrancar el escritorio cuando
        <application>XDM</application> se est&aacute; ejecutando.  
        El objetivo de cada uno de estos ficheros ser&aacute; descrito
        brevemente.  La sintaxis exacta y el uso de todos estos ficheros
        se describe en &man.xdm.1;.</para>

      <para>La configuraci&oacute;n por omisi&oacute;n es una simple ventana
        rectangular de acceso al sistema con el nombre de la m&aacute;quina
        en la parte superior en un tipo de letra grande y unos campos para que
        introduzca&laquo;Login:&raquo; y &laquo;Password:&raquo; debajo.  Este es
        un buen punto de partida para aprender a cambiar el aspecto de las
        pantallas de <application>XDM</application>.</para>

      <sect3>
        <title>Xaccess</title>

        <para>El protocolo para conectar con las pantallas controladas por
          <application>XDM</application> se llama &laquo;X Display Manager Connection
          Protocol&raquo; (XDMCP).  Este fichero es un conjunto de reglas para
          controlar las conexiones XDMCP desde otros equipos.  Por defecto
          permite a cualquier cliente conectar, pero eso no importa a menos
          que <filename>xdm-config</filename> se cambie para escuchar
          conexiones remotas.  La configuraci&oacute;n b&aacute;sica no
	  permite conexiones desde ning&uacute;n cliente.</para>
      </sect3>

      <sect3>
        <title>Xresources</title>

        <para>Este es el fichero de opciones por defecto para el selector de
          pantalla y acceso al sistema.  Aqu&iacute; es donde se puede
          modificar la apariencia del programa de &laquo;login&raquo;.  
          El formato es id&eacute;ntico al fichero de opciones por defecto
          descrito en la documentaci&oacute;n de X11.</para>
      </sect3>

      <sect3>
        <title>Xservers</title>

        <para>Una lista de pantallas remotas entre las que elegir.</para>

      </sect3>

      <sect3>
        <title>Xsession</title>

        <para>Este es el &laquo;script&raquo; de sesi&oacute;n que por
	  defecto <application>XDM</application> arrancar&aacute;
	  despu&eacute;s de que el usuario acceda al sistema.  Normalmente
	  cada usuario tendr&aacute; una versi&oacute;n personalizada del
          &laquo;script&raquo; de sesi&oacute;n en
          <filename>~/.xsession</filename> que sobreescribe el
          &laquo;script&raquo; por defecto.</para>
      </sect3>

      <sect3>
        <title>Xsetup_*</title>

        <para>Estos se arrancar&aacute;n autom&aacute;ticamente antes de que
	  se muestre el interfaz de selecci&oacute;n o de acceso al sistema.  
          Hay un &laquo;script&raquo; por cada gestor de ventanas disponible
          llamados <filename>Xsetup_</filename> seguido por el n&uacute;mero
	  de pantalla local (por ejemplo <filename>Xsetup_0</filename>).  
	  Normalmente estos &laquo;scripts&raquo; arrancan uno o dos
	  programas en segundo plano, por ejemplo <command>xconsole</command>.
	  </para>
      </sect3>

      <sect3>
        <title>xdm-config</title>

        <para>Este fichero contiene las opciones por defecto aplicables a
          todas las pantallas que gestiona la instalaci&oacute;n.</para>
      </sect3>

      <sect3>
        <title>xdm-errors</title>
        <para>Este fichero contiene la salida de los servidores X que
          <application>XDM</application> intente arrancar.  Si alguna pantalla
          que <application>XDM</application> intente arrancar se cuelga por
          alguna raz&oacute;n este es un buen sitio para buscar los mensajes
          de error.  Estos mensajes tambi&eacute;n se escriben en el fichero
          <filename>~/.xsession-errors</filename> del usuario en cada
          sesi&oacute;n.</para>
      </sect3>
    </sect2>

    <sect2>
      <title>Ejecutar un servidor de pantalla a trav&eacute;s de la red
        </title>

      <para>Para que otros clientes puedan conectar al servidor de pantalla
        edite las reglas de acceso y habilite la escucha en la
        conexi&oacute;n.  Por omisi&oacute;n se aplican restricciones.  Si quiere
        que <application>XDM</application> escuche conexiones
        comente la siguiente l&iacute;nea en el fichero
        <filename>xdm-config</filename>:</para>

      <screen>! SECURITY: do not listen for XDMCP or Chooser requests
! Comment out this line if you want to manage X terminals with xdm
DisplayManager.requestPort:     0</screen>

      <para>y despu&eacute;s reinicie <application>XDM</application>.  
        Recuerde que los comentarios en los ficheros de opciones por defecto
        comienzan con el car&aacute;cter&laquo;!&raquo; en
        vez del t&iacute;pico &laquo;#&raquo;.  Puede aplicar controles
        m&aacute;s restrictivos.  Consulte las opciones de ejemplo en
        <filename>Xaccess</filename> y la p&aacute;gina de manual de
        &man.xdm.1;.</para>
    </sect2>

    <sect2>
      <title>Alternativas a XDM</title>

      <para>Hay algunas alternativas al programa por defecto
        <application>XDM</application>.  Una de ellas,
        <application>kdm</application> (que se incluye con 
        <application>KDE</application>) se describe m&aacute;s adelante en este
        cap&iacute;tulo.  <application>kdm</application> ofrece muchas 
	ventajas visuales y funcionalidad para permitir a los usuarios elegir
	su gestor de ventanas en el momento del acceso al sistema.</para>
    </sect2>
  </sect1>

  <sect1 id="x11-wm">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Valentino</firstname>
          <surname>Vaschetto</surname>
          <contrib>Escrito por </contrib>
        </author>
        <!-- Junio 2001 -->
      </authorgroup>
    </sect1info>

    <title>Entornos de escritorio</title>

    <para>Est&aacute; secci&oacute;n describe los diferentes entornos de
      escritorio disponibles para X en &os;.  Un &laquo;entorno de
      escritorio&raquo; puede ser cualquier cosa que vaya desde un simple
      gestor de ventanas hasta una completa &laquo;suite&raquo; de
      aplicaciones de escritorio como <application>KDE</application> o
      <application>GNOME</application>.</para>

    <sect2 id="x11-wm-gnome">
      <title>GNOME</title>

      <sect3 id="x11-wm-gnome-about">
        <title>Acerca de GNOME</title>
        <indexterm><primary>GNOME</primary></indexterm>
        <para><application>GNOME</application> es un entorno de escritorio
          amigable que permite a los usuarios una configuraci&oacute;n
          f&aacute;cil de sus sistemas.  <application>GNOME</application>
          incluye un panel (para iniciar las aplicaciones y mostrar su
          estado),  un escritorio (donde pueden colocarse los datos y las
          aplicaciones), un conjunto de herramientas y aplicaciones de
          escritorio est&aacute;ndar y un conjunto de convenciones para
          facilitar la creaci&oacute;n de aplicaciones que sean consistentes
	  y colaboren unas con otras.  Los usuarios de otros sistemas
	  operativos o entornos pueden sentirse como en casa utilizando el
	  poderoso entorno gr&aacute;fico <application>GNOME</application>.  
	  Encontrar&aacute; m&aacute;s informaci&oacute;n sobre
	  <application>GNOME</application> en &os; en la p&aacute;gina
	  <ulink url="http://www.FreeBSD.org/gnome">del
          Proyecto FreeBSD GNOME</ulink>.</para>
      </sect3>

      <sect3 id="x11-wm-gnome-install">
        <title>Instaci&oacute;n de GNOME</title>

          <para><application>GNOME</application> puede instalarse 
	  f&aacute;cilmente utilizando packages
          precompilados o desde la Colecci&oacute;n de Ports:</para>

        <para>Para instalar el paquete de <application>GNOME</application>
          desde la red, simplemente teclee:</para>

        <screen>&prompt.root; <userinput>pkg_add -r gnome2</userinput></screen>

        <para>Para compilar <application>GNOME</application> a partir del
          c&oacute;digo fuente, es decir, como port:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11/gnome2</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Una vez <application>GNOME</application> est&eacute; instalado
          debe indicarle al servidor X como iniciar
          <application>GNOME</application> para convertirlo en el gestor de
          ventanas predeterminado.</para>
	  


	  
        <para>La manera m&aacute;s f&aacute;cil de arrancar
          <application>GNOME</application> es con
          <application>GDM</application>, el gestor de pantalla de GNOME.  
          <application>GDM</application>, que se instala con el escritorio
          <application>GNOME</application> al ser parte del mismo (aunque venga
          desactivado por omisi&oacute;n) se activa a&ntilde;adiendo
          <literal>gdm_enable="YES"</literal> a
          <filename>/etc/rc.conf</filename>.  Tras reiniciar,
          <application>GNOME</application> arrancar&aacute; autom&aacute;ticamente
          al acceder al sistema; no es necesario configurar nada
          m&aacute;s.</para>

        <para>Puede arrancar <application>GNOME</application> tambi&eacute;n
	  desde la l&iacute;nea de &oacute;rdenes configurando adecuadamente
	  un fichero llamado <filename>.xinitrc</filename>.  Si ya tiene un
          <filename>.xinitrc</filename> personalizado tendr&aacute; que
	  reemplazar la l&iacute;nea que arranca el gestor de ventanas anterior
          por otra que contenga
	  <application>/usr/local/bin/gnome-session</application>.  Si no ha
	  modificado el fichero previamente basta con que tecl&eacute;e lo
	  siguiente:</para>

<screen>&prompt.user; <userinput>echo "/usr/local/bin/gnome-session" &gt; ~/.xinitrc</userinput></screen>

        <para>Despu&eacute;s tecl&eacute;e <command>startx</command> y deber&iacute;a
          iniciarse el entorno de escritorio
          <application>GNOME</application>.</para>

        <note><para>Si utiliza un gestor de pantalla ant&iacute;guo,
	  como <application>XDM</application>, lo anteriormente descrito no
	  funcionar&aacute;.  Cree un fichero ejecutable
          <filename>.xsession</filename> con la misma orden en
          &eacute;l.  Edite el fichero y sustituya la orden
          para iniciar su actual gestor de ventanas por
          <application>/usr/local/bin/gnome-session</application>:
          </para></note>

        <screen>&prompt.user; <userinput>echo "#!/bin/sh" &gt; ~/.xsession</userinput>
&prompt.user; <userinput>echo "/usr/local/bin/gnome-session" &gt;&gt; ~/.xsession</userinput>
&prompt.user; <userinput>chmod +x ~/.xsession</userinput></screen>

        <para>Otra opci&oacute;n es configurar el gestor de pantalla para que
          permita seleccionar el gestor de ventanas durante el acceso;  
          la secci&oacute;n de <link
          linkend="x11-wm-kde-details">detalles de KDE</link> explica c&oacute;mo
          hacerlo para <application>kdm</application>, el gestor de pantalla
          de <application>KDE</application>.</para>
      </sect3>


      <sect3 id="x11-wm-gnome-antialias">
        <title>Tipos &laquo;Anti-aliased&raquo; en GNOME</title>

        <indexterm><primary>GNOME</primary>
          <secondary>anti-aliased fonts</secondary></indexterm>
	<para>X11 soporta &laquo;anti-aliasing&raquo; a
          trav&eacute;s de la extensi&oacute;n &laquo;RENDER&raquo;.  Gtk+
	  2.0 y superiores (el &laquo;toolkit&raquo; utilizado por 
          <application>GNOME</application>) disponen de esta funcionalidad.  
	  La configuraci&oacute;n del &laquo;anti-aliasing&raquo; se describe
	  en la <xref linkend="antialias">.  Una vez configurado el software es
          posible utilizar &laquo;anti-aliasing&raquo; en el entorno de 
          escritorio <application>GNOME</application>.  S&oacute;lamente tiene
	  que ir a
	  <menuchoice>
	    <guimenu>Applications</guimenu>
	    <guisubmenu>Desktop Preferences</guisubmenu>
	    <guimenuitem>Font</guimenuitem></menuchoice>,
          y seleccione entre
	  <guibutton>Best shapes</guibutton>,
	  <guibutton>Best contrast</guibutton>, o
	  <guibutton>Subpixel smoothing (LCDs)</guibutton>.  En el caso de una
	  aplicaci&oacute;n Gtk+ que no forme parte del escritorio
	  <application>GNOME</application> asigne a la variable de entorno
          <varname>GDK_USE_XFT</varname> un valor de <literal>1</literal> antes de
	  arrancar el programa.</para>
      </sect3>
    </sect2>

    <sect2 id="x11-wm-kde">
      <title>KDE</title>

      <indexterm><primary>KDE</primary></indexterm>
      <sect3 id="x11-wm-kde-about">
        <title>Acerca de KDE</title>

        <para><application>KDE</application> es un entorno de escritorio
          contempor&aacute;neo y f&aacute;cil de usar.  Veamos alguna de las cosas
	  que <application>KDE</application> brinda al usuario:</para>

        <itemizedlist>
          <listitem>
	    <para>Un bello escritorio contempor&aacute;neo.</para>
	  </listitem>

          <listitem>
	    <para>Un escritorio completamente transparente en red.</para>
	  </listitem>

          <listitem>
	    <para>Un sistema de ayuda integrado que facilita un acceso adecuado y
              consistente a la ayuda durante el uso del escritorio
	      <application>KDE</application> y sus aplicaciones.</para>
	  </listitem>

          <listitem>
	    <para>Un aspecto consistente de todas las aplicaciones
              <application>KDE</application>.</para>
	  </listitem>

          <listitem>
	    <para>Men&uacute;s y barras de herramientas est&aacute;ndares,
	      teclas programables, esquemas de color, etc.</para>
	  </listitem>

          <listitem>
	    <para>Internacionalizaci&oacute;n: <application>KDE</application> 
              est&aacute; disponible en m&aacute;s de 40 idiomas.</para>
	  </listitem>

          <listitem>
	    <para>Un di&aacute;logo de configuraci&oacute;n del escritorio
              centralizado y consistente.</para>
	  </listitem>

          <listitem>
	    <para>Un gran n&uacute;mero de &uacute;tiles aplicaciones
              <application>KDE</application>.</para>
	  </listitem>
        </itemizedlist>

        <para><application>KDE</application> incluye un navegador web llamado
          <application>Konqueror</application>, que es un s&oacute;lido
	  competidor del resto de navegadores web existentes en sistemas
	  &unix;.  Puede encontrar m&aacute;s
	  informaci&oacute;n sobre <application>KDE</application> en el
	  <ulink url="http://www.kde.org/"> sitio web de KDE</ulink>.  Si quiere
          informaci&oacute;n espec&iacute;fica y recursos sobre
          <application>KDE</application> en &os; consulte el sitio web del
	  <ulink
          url="http://freebsd.kde.org/">equipo de KDE en &os;</ulink>.</para>

        <para>Hay dos versiones de <application>KDE</application> en &os;: la
          versi&oacute;n 3 lleva ya bastante tiempo en el sistema y es muy
	  estable en todos los sentidos.  La versi&oacute;n 4, la nueva
	  generaci&oacute;n de <application>KDE</application>, tambi&eacute;n
	  est&aacute; en los ports.  Si quiere puede instalar ambas versiones
	  simult&aacute;neamente.</para>

      </sect3>

      <sect3 id="x11-wm-kde-install">
        <title>Instalaci&oacute;n de KDE</title>

        <para>Igual que sucede con <application>GNOME</application> o cualquier
          otro entorno de escritorio puede instalarlo como package o desde la
          Colecci&oacute;n de Ports:</para>

        <para>Si quiere instalar como package <application>KDE3</application>
          (desde la red) escriba:</para>

        <screen>&prompt.root; <userinput>pkg_add -r kde</userinput></screen>

        <para>Si quiere instalar como package <application>KDE4</application>
          (desde la red) escriba:</para>

        <screen>&prompt.root; <userinput>pkg_add -r kde4</userinput></screen>


	<para>&man.pkg.add.1; descargar&aacute; autom&aacute;ticamente
          la versi&oacute;n m&aacute;s reciente de la aplicaci&oacute;n.</para>

        <para>Si lo que desea es compilar <application>KDE3</application> desde
	  el c&oacute;digo fuente utilice el &aacute;rbol de ports:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11/kde3</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>


        <para>Si lo que desea es compilar <application>KDE4</application> desde
	  el c&oacute;digo fuente utilice el &aacute;rbol de ports:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11/kde4</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>


        <para>Una vez instalado <application>KDE</application>
	  debe indicarle al servidor X c&oacute;mo iniciar la aplicaci&oacute;n
	  para que se convierta en el gestor de ventanas por defecto.  Edite
	  <filename>.xinitrc</filename>:</para>

	<para>Para <application>KDE3</application>:</para>


        <screen>&prompt.user; <userinput>echo "exec startkde" &gt; ~/.xinitrc</userinput></screen>




	<para>Para <application>KDE4</application>:</para>


        <screen>&prompt.user; <userinput>echo "exec /usr/local/kde4/bin/startkde" &gt; ~/.xinitrc</userinput></screen>




	<para>A partir de ahora cuando se llame al sistema X Window con
          <command>startx</command> el escritorio ser&aacute;
          <application>KDE</application>.</para>

        <para>Si utiliza un gestor de pantalla, como por ejemplo
          <application>xdm</application>, la configuraci&oacute;n es
          ligeramente diferente.  En vez de lo antedicho edite
          <filename>.xsession</filename>.  Las instrucciones para
          <application>kdm</application> se decribir&aacute;n m&aacute;s
          adelante en este cap&iacute;tulo.</para>
      </sect3>
    </sect2>

    <sect2 id="x11-wm-kde-details">
        <title>M&aacute;s detalles sobre KDE</title>

        <para>Una vez <application>KDE</application> est&aacute; instalado
	  en el sistema la mayor&iacute;a de las cosas se pueden ir descubriendo
          utilizando las p&aacute;ginas de ayuda o sencillamente a golpe de
	  rat&oacute;n en los diversos men&uacute;s.  Los usuarios de
          &windows; y &mac; se sentir&aacute;an como en casa.</para>

        <para>La mejor referencia para <application>KDE</application> es
          la documentaci&oacute;n &laquo;on-line&raquo;.  
	  <application>KDE</application>
          incluye su propio navegador, <application>Konqueror</application>,
          docenas de &uacute;tiles aplicaciones y una extensa
          documentaci&oacute;n.  El resto de esta secci&oacute;n trata sobre
          cuestiones t&eacute;cnicas que son dif&iacute;ciles de aprender
          mediante una exploraci&oacute;n al azar.</para>

      <sect3 id="x11-wm-kde-kdm">
        <title>El gestor de pantalla de KDE</title>


        <indexterm><primary>KDE</primary>
          <secondary>display manager</secondary></indexterm>
        <para>El administrador de un sistemas multiusuario puede querer ofrecer
	  a sus usuarios una pantalla de bienvenido que se les presente
	  al acceder al sistema.  Tal y como se ha explicado previamente puede
          usar <link linkend="x-xdm">XDM</link>.  De todos modos
          <application>KDE</application> incluye su propia alternativa,
          alternative, <application>kdm</application>, dise&ntilde;ado pensando
	  en ser m&aacute;s atractivo y tener m&aacute;s opciones que ofrecer
	  en el momento del acceso al sistema.  M&aacute;s concretamente ofrece
	  a los usuarios la posibilidad de elegir mediante un men&uacute;
	  qu&eacute; entorno de escritorio
          (<application>KDE</application>,
          <application>GNOME</application>, o cualquier otro) quiere ejecutar
	  el usuario una vez validado.</para>

        <para>Si quiere activar <application>kdm</application> debe modificar
	  la entrada de <literal>ttyv8</literal> en
	  <filename>/etc/ttys</filename>.  La l&iacute;nea debe quedar
	  del siguiente modo:</para>

	<para>Si va a usar <application>KDE3</application>:</para>

	 <programlisting>ttyv8 "/usr/local/bin/kdm -nodaemon" xterm on secure</programlisting>

	<para>En el caso de <application>KDE4</application>:</para>

	<programlisting>ttyv8 "/usr/local/kde4/bin/kdm -nodaemon" xterm on secure</programlisting>



       </sect3>
     </sect2>

     <sect2 id="x11-wm-xfce">
         <title>XFce</title>
       <sect3 id="x11-wm-xfce-about">
         <title>Acerca de XFce</title>

        <para><application>XFce</application> es un entorno de escritorio
          basado en el &laquo;toolkit&raquo; GTK utilizado por
          <application>GNOME</application> pero es mucho m&aacute;s ligero y
          est&aacute; pensado para aquellos que quieran un escritorio
	  sencillo, eficiente y f&aacute;cil de utlizar y configurar.  
	  Visualmente es muy parecido a <application>CDE</application>, que
	  podemos encontrar en sistemas &unix; comerciales.  Alguna de las
	  caracter&eacute;sticas de <application>XFce</application> son:
	  </para>

         <itemizedlist>
           <listitem>
	     <para>Un escritorio sencillo y f&aacute;cil de utilizar.</para>
           </listitem>

           <listitem>
	     <para>Completamente configurable utilizando el rat&oacute;n, con
               arrastrar y soltar, etc.</para>
           </listitem>

           <listitem>
	     <para>Panel principal similar al de
               <application>CDE</application>, con men&uacute;s,
               &laquo;applets&raquo; y accesos directos a las
               aplicaciones.</para>
           </listitem>

           <listitem>
	     <para>Gestor de ventanas integrado, gestor de ficheros, gestor
	       de sonido, m&oacute;dulo de compatibilidad con
           <application>GNOME</application>, y muchas cosas m&aacute;s.</para>
           </listitem>

           <listitem>
	     <para>Aspecto configurable (utiliza GTK).</para>
           </listitem>

           <listitem>
	     <para>R&aacute;pido, ligero y eficiente: ideal para
               m&aacute;quinas viejas, lentas o m&aacute;quinas con
	       memoria limitada.</para>
           </listitem>
         </itemizedlist>

         <para>Puede encontrar m&aacute;s informaci&oacute;n sobre
          <application>XFce</application> en el
          <ulink url="http://www.xfce.org/"> sitio web de XFce</ulink>.</para>
       </sect3>

       <sect3 id="x11-wm-xfce-install">
         <title>Instalar XFce</title>

        <para>En el momento de escribir este texto existe un paquete binario
          para <application>XFce</application>.  Para instalarlo
          escriba:</para>

        <screen>&prompt.root; <userinput>pkg_add -r xfce4</userinput></screen>

        <para>Tambi&eacute;n puede compilarlo desde el
          c&oacute;digo gracias a la Colecci&oacute;n de Ports:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11-wm/xfce4</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Para indicar al servidor X que use
         <application>XFce</application> la pr&oacute;xima vez que arranque
         simplemente escriba lo siguiente:</para>

        <screen>&prompt.user; <userinput>echo "/usr/X11R6/bin/startxfce4" &gt; ~/.xinitrc</userinput></screen>

        <para>La pr&oacute;xima vez que arranque X
          <application>XFce</application> ser&aacute; el escritorio.  
          Como antes, si se usa un gestor de pantalla como
          <filename>xdm</filename> cree un <filename>.xsession</filename> tal
	  y como se ha descrito en la anterior secci&oacute;n en <link
          linkend="x11-wm-gnome">GNOME</link>, pero con la orden
	  <filename>/usr/local/bin/startxfce4</filename>; puede configurar el
	  gestor de pantalla para permitir elegir el escritorio en el momento
	  de acceder al sistema tal y como se ha explicado en la
	  secci&oacute;n de <link linkend="x11-wm-kde-kdm">kdm</link>.</para>
      </sect3>
    </sect2>
  </sect1>

</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
