<!--
     The FreeBSD Documentation Project

     $FreeBSD$
     $FreeBSDes: doc/es_ES.ISO8859-1/books/handbook/x11/chapter.sgml,v 1.5 2004/10/09 01:38:16 jesusr Exp $
-->
<!-- version en ingles traducida: 1.150 -->

<chapter id="x11">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Ken</firstname>
        <surname>Tom</surname>
        <contrib>Actualizado al servidor X11 de X.Org por </contrib>
      </author>
      <author>
        <firstname>Marc</firstname>
        <surname>Fonvieille</surname>
      </author>
    </authorgroup>
  </chapterinfo>

  <title>El sistema X Window</title>

  <sect1 id="x11-synopsis">
    <title>Sinopsis</title>

    <para>FreeBSD usa X11 para proporcionar una potente interfaz 
      gr&aacute;fica.  X11 es una implementaci&oacute;n de c&oacute;digo 
      abierto del sistema X Window que incluye 
      <application>&xorg;</application> y
      <application>&xfree86;</application>.  En las versiones de &os;
      hasta &os;&nbsp;4.10-RELEASE y &os;&nbsp;5.3-RELEASE el sistema
      X window que se instalar&aacute; por defecto es 
      <application>&xfree86;</application>, el servidor X11 
      distribuido por el proyecto &xfree86;.  Despues de &os;&nbsp;5.3-RELEASE 
      el sistema X Window ha cambiado a <application>&xorg;</application>, 
      el servidor X11 distribuido por la fundaci&oacute;n X.Org.</para>

    <para>Este cap&iacute;tulo cubre la instalaci&oacute;n y 
      configuraci&oacute;n de X11 poniendo &eacute;nfasis en 
      <application>&xorg;</application>.</para>

    <para>Para mas informaci&oacute;n del hardware de v&iacute;deo 
      que X11 soporta consulte la p&aacute;gina web de <ulink
      url="http://www.x.org/">&xorg;</ulink> o <ulink
      url="http://www.XFree86.org/">&xfree86;</ulink>.</para>


    <para>Despu&eacute;s de leer este cap&iacute;tulo usted 
      sabr&aacute;:</para>

    <itemizedlist>
      <listitem>
        <para>Los diferentes componentes del sistema X Window y como 
          interoperan.</para>
      </listitem>

      <listitem>
        <para>C&oacute;mo instalar y configurar X11.</para>
      </listitem>

      <listitem>
        <para>C&oacute;mo instalar y usar diferentes gestores de ventanas.
	  </para>
      </listitem>

      <listitem>
        <para>C&oacute;mo usar tipos de letra &truetype; en X11.
	  </para>
      </listitem>

      <listitem>
        <para>Como preparar su sistema para iniciar la sesi&oacute;n de forma 
          gr&aacute;fica (<application>XDM</application>).</para>
      </listitem>
    </itemizedlist>

    <para>Antes de leer este cap&iacute;tulo deber&iacute;a:</para>

    <itemizedlist>
      <listitem>
        <para>Saber c&oacute;mo instalar software de terceros 
          (<xref linkend="ports">).</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>Este cap&iacute;tulo cubre la instalaci&oacute;n y 
         configuraci&oacute;n de los servidores X11 
         <application>&xorg;</application> y 
         <application>&xfree86;</application>.  La mayor&iacute;a de los 
         ficheros de configuraci&oacute;n, &oacute;rdenes y sintaxis son 
         id&eacute;nticos.  En los casos en que haya diferencias se 
         mostrar&aacute; la sintaxis de 
         <application>&xorg;</application> y 
         <application>&xfree86;</application>.</para>
     </note>

  </sect1>

  <sect1 id="x-understanding"> 
    <title>Entender X</title>

    <para>Usar X por primera vez puede resultar chocante para alguien 
      familiarizado con otros entornos gr&aacute;ficos, como 
      &microsoft.windows; o &macos;.</para>

    <para>No es necesario entender todos los detalles de los diferentes 
      componentes de X y como interaccionan, un conocimiento b&aacute;sico 
      hace posible obtener mayor provecho de la potencia de 
      X.</para>

    <sect2>
      <title>&iquest;Por qu&eacute; X?</title>

      <para>X no es el primer sistema de ventanas escrito para &unix; 
        pero es el m&aacute;s popular de ellos.  El equipo original que 
        desarroll&oacute; X trabaj&oacute; en otro sistema de ventanas 
        antes de escribir X.  Ese sistema se llam&oacute; <quote>W</quote> 
        (de <quote>Window</quote> que significa ventana en ingl&oacute;s).  
        X era solo la siguiente letra en el alfabeto Romano.</para>

      <para>X se puede llamar <quote>X</quote> 
        <quote>X Window System</quote>, <quote>X11</quote> y de otras 
        formas. Tambi&eacute;n es posible usar el termino 
        <quote>X Windows</quote> para describir X11 si lo que quiere es 
        ofender a algunas personas; si quiere saber m&aacute;s sobre esto 
        consulte &man.X.7;.</para>
    </sect2>

    <sect2>
      <title>El modelo cliente/servidor de X</title>

      <para>X fue dise&ntilde;ado desde el principio pensando en redes 
        y adopt&oacute; un modelo <quote>cliente-servidor</quote>.</para>

      <para>En el modelo de X el <quote>servidor X</quote> se ejecuta sobre el 
        ordenador que tiene el teclado, monitor y rat&oacute;n.  El servidor 
        es responsable de manejar la pantalla, la entrada de datos a 
        trav&eacute;s del teclado, el rat&oacute;n, etc.  Cada 
        aplicaci&oacute;n X (como una <application>XTerm</application> o 
        <application>&netscape;</application>) es un 
        <quote>cliente</quote>.  Un cliente manda mensajes al servidor como 
        <quote>Por favor dibuja una ventana en estas coordenadas</quote> y el 
        servidor devuelve mensajes como <quote>El usuario ha pulsado el 
        bot&oacute;n OK</quote>.</para>

      <para>S&iacute; solo hay un ordenador involucrado, como en una
        casa o una peque&ntilde;a oficina, el servidor X y los clientes
        X seguramente correran en el mismo ordenador.  Sin embargo, es
        perfectamente posible correr el servidor X en un ordenador de
        escritorio menos potente, y correr las aplicaciones X (los
        clientes) en, por ejemplo, la potente y cara m&aacute;quina que sirve
        la oficina.  En este panorama la comunicaci&oacute;n entre el
        cliente X y el servidor tiene lugar a trav&eacute;s de la red.</para>

      <para>Esto confunde a algunas personas, porque la terminolog&iacute;a es
        exactamente opuesta a lo que ellos esperan.  Ellos esperan que el
        <quote>servidor X</quote> sea la m&aacute;quina grande que hay en el 
	s&oacute;tano y que el <quote>cliente X</quote> sea la m&aacute;quina
        de su mesa.</para>

      <para>Es importante que recuerde que el servidor X es la 
        m&aacute;quina con el monitor y el teclado y que los clientes 
        X son los programas que muestran las ventanas.</para>

      <para>No hay nada en el protocolo que obligue a que el cliente y el 
        servidor tengan que usar el mismo sistema operativo o incluso que
        est&eacute;n en el mismo ordenador.  Es posible ejecutar un servidor X 
        en &microsoft.windows; o en el &macos; de Apple; de hecho hay varias 
        aplicaciones libres y comerciales que hacen exactamente eso.</para>

      <para>A partir de &os;&nbsp;5.3-RELEASE, el servidor X que se instala 
        con &os; es <application>&xorg;</application> que es libre  y 
        se distribuye bajo una licencia muy similar a la de &os;.  
        Tambi&eacute;n hay servidores X comerciales para &os;.</para>
    </sect2>

    <sect2>
      <title>El gestor de ventanas</title>

      <para>La filosof&iacute;a de dise&ntilde;o de X es m&aacute;s parecida 
        a la de &unix;: <quote>herramientas, no pol&iacute;tica</quote>.  Esto 
        significa que X no impone c&oacute;mo una tarea debe hacerse.  En 
        lugar de eso proporciona herramientas al usuario y es responsabilidad 
        suya decidir qu&eacute; hacer con ellas.</para>

      <para>Esta filosof&iacute;a se extiende a X; no impone como deben verse 
        las ventanas en la pantalla, c&oacute;mo moverlas con el rat&oacute;n, 
        que teclas deber&iacute;an usarse para moverse entre ventanas 
        (por ejemplo <keycombo action="simul">
          <keycap>Alt</keycap>
          <keycap>Tab</keycap>
        </keycombo>, en &microsoft.windows;), c&oacute;mo deben ser las 
        barras de t&iacute;tulo en cada ventana, si tienen o no bot&oacute;n 
        de cierre, etc.</para>

      <para>En lugar de eso X delega esta responsabilidad en una 
        aplicaci&oacute;n llamada <quote>gestor de ventanas</quote>.  Hay 
        docenas de gestores de ventanas disponibles para X: 
        <application>AfterStep</application>,
        <application>Blackbox</application>, <application>ctwm</application>, 
        <application>Enlightenment</application>, 
        <application>fvwm</application>, <application>Sawfish</application>, 
        <application>twm</application>,
	<application>Window Maker</application>, etc.  Cada uno de estos 
	gestores de ventanas tiene un aspecto diferente; algunos soportan 
	<quote>escritorios virtuales</quote>; otros permiten personalizar las
	teclas para manejar el escritorio; otros tienen un bot&oacute;n de 
	<quote>Inicio</quote> o algo similar; otros tienen 
	<quote>dise&ntilde;os modificables</quote>, permitiendo un cambio 
	completo del aspecto mediante un nuevo dise&ntilde;o.  Estos gestores
	de ventanas, y muchos otros, est&aacute;n disponibles en la 
	categor&iacute;a <filename>x11-wm</filename> de los ports.</para>

      <para>Adem&aacute;s, los entornos de escritorio 
        <application>KDE</application> y <application>GNOME</application> 
        tienen sus propios gestores de ventanas integrados con el 
        escritorio.</para>

      <para>Cada gestor de ventanas tiene diferentes mecanismos de 
        configuraci&oacute;n; en algunos debe escribir el fichero de 
        configuraci&oacute;n a mano, otros tienen herramientas gr&aacute;ficas 
        para la mayor parte de la configuraci&oacute;n; y al menos uno 
        (<application>Sawfish</application>) tiene un fichero de 
        configuraci&oacute;n escrito en el lenguaje Lisp.</para>

      <note>
        <title>Pol&iacute;tica de foco</title>

        <para>Otra responsabilidad del gestor de ventanas es la 
          <quote>pol&iacute;tica de foco</quote> del rat&oacute;n.  Todos los 
          sistemas de ventanas necesitan algo para elegir una ventana activa 
          que recibir&aacute; los eventos y tambi&eacute;n debieran indicar 
          visiblemente que ventana esta activa.
        </para>

        <para>Una pol&iacute;tica familiar podr&iacute;a ser 
          <quote>clic-para-foco</quote>.  Este es el modelo utilizado por 
          &microsoft.windows;, en el que una ventana se convierte en activa 
          al recibir un clic del rat&oacute;n.
        </para>

        <para>X no tiene ninguna pol&iacute;tica de foco.  En lugar de eso el 
          gestor de ventanas controla qu&eacute; ventana tiene el foco en todo 
          momento.  Los diferentes gestores de ventanas tienen diferentes 
          pol&iacute;ticas de foco.  Todos soportan la pol&iacute;tica 
          <quote>clic-para-foco</quote> y la mayor&iacute;a de ellos 
          tambi&eacute;n soportan otros m&eacute;todos.</para>

        <para>Las pol&iacute;ticas de foco m&aacute;s populares son:</para>

        <variablelist>
          <varlistentry>
            <term>el-foco-sigue-al-rat&oacute;n</term>

            <listitem>
              <para>La ventana que esta bajo el puntero del rat&oacute;n es 
                la ventana que tiene el foco.  No es necesario que la ventana 
                est&eacute; encima de las dem&aacute;s ventanas.  El foco se 
                cambia al apuntar a otra ventana, aunque no es necesario hacer 
                clic en ella.</para>
            </listitem>
          </varlistentry>

          <varlistentry>
            <term>foco-descuidado</term>

            <listitem>
              <para>Esta pol&iacute;tica es una peque&ntilde;a 
                extensi&oacute;n de 
                <quote>el-foco-sigue-al-rat&oacute;n</quote>.  Con 
                <quote>el-foco-sigue-al-rat&oacute;n</quote>, si el 
                rat&oacute;n se mueve sobre la ventana ra&iacute;z (o fondo) 
                entonces ninguna ventana tiene el foco y las pulsaciones del 
                teclado se perder&aacute;n.  Con la pol&iacute;tica 
                <quote>foco-descuidado</quote> el foco s&oacute;lo cambia 
                cuando el cursor entra en una nueva ventana y no cuando 
                sale de la ventana actual.</para>
            </listitem>
          </varlistentry>

          <varlistentry>
            <term>click-para-foco</term>

            <listitem>
              <para>La ventana activa se selecciona con un clic del 
                rat&oacute;n.  La ventana se puede <quote>levantar</quote> 
                y aparecer delante de las dem&aacute;s ventanas.  Todas las 
                pulsaciones de teclado ser&aacute;n redirigidas a esa ventana 
                aunque el cursor se mueva a otra ventana.</para>
            </listitem>
          </varlistentry>
        </variablelist>

        <para>Muchos gestores de ventanas soportan otras pol&iacute;ticas o 
          variaciones de estas.  Consulte la documentaci&oacute;n del propio 
          gestor de ventanas.</para>
      </note>
    </sect2>

    <sect2>
      <title>Widgets</title>

      <para>La idea de X es hacer herramientas en vez de pol&iacute;tica 
        y se extiende a los <quote>widgets</quote> que se ven en la pantalla 
        de cada aplicaci&oacute;n.</para>

      <para><quote>Widget</quote> es un t&eacute;rmino para todos los objetos 
        en el interfaz de usuario que pueden ser pulsados con el rat&oacute;n 
        o manipulados de alguna forma: botones, <quote>check boxes</quote>, 
        iconos, listas, etc.  &microsoft.windows; los llama 
        <quote>controles</quote>.</para>

      <para>&microsoft.windows; y &macos; de Apple tienen una pol&iacute;tica 
        de <quote>widgets</quote> muy r&iacute;gida.  Se supone que los 
        desarrolladores de aplicaciones comparten el aspecto.  En X no se 
        consider&oacute; imponer un estilo gr&aacute;fico o un conjunto de 
        <quote>widgets</quote> al que adherirse.</para>

      <para>Como resultado no se puede esperar que las aplicaciones de X 
        tengan un aspecto com&uacute;n.  Hay varios conjuntos de 
        <quote>widgets</quote> y variaciones muy populares como el 
        <quote>widget</quote> Athena creado en el MIT, 
        <application>&motif;</application> (donde los <quote>widgets</quote> 
	de &microsoft.windows; fueron modelados, con todos los bordes 
	biselados y tres tonos de gris), <application>OpenLook</application>,
	y otros.</para>

      <para>Las aplicaciones m&aacute;s modernas de X hoy en d&iacute;a usan 
        un conjunto de <quote>widgets</quote> con mejor aspecto, o Qt, usado 
	por <application>KDE</application>, o GTK+, usado por el proyecto 
	<application>GNOME</application>.  Se intenta que el aspecto del 
	escritorio de &unix; sea parecido, lo que hace la vida m&aacute;s 
	f&aacute;cil al usuario novato.</para>
    </sect2>
  </sect1>     

  <sect1 id="x-install">
    <title>Instalar X11</title>

    <para>Se puede instalar <application>&xorg;</application> o 
      <application>&xfree86;</application> en 
      &os;.  A partir de &os;&nbsp;5.3-RELEASE 
      <application>&xorg;</application> es la implementaci&oacute;n X11 por 
      defecto para &os;.  <application>&xorg;</application> es el 
      servidor X11 de la distribuci&oacute;n X11R6.7 lanzado por la 
      fundaci&oacute;n X.Org.  X11R6.7 esta basado en el c&oacute;digo 
      de <application>&xfree86;&nbsp;4.4RC2</application> y 
      X11R6.6.  La fundaci&oacute;n X.Org lanz&oacute; X11R6.7 en 
      abril de 2004.</para>

    <para>Para compilar e instalar <application>&xorg;</application> 
    desde la colecci&oacute;n de ports:</para>

    <screen>&prompt.root; <userinput>cd /usr/ports/x11/xorg</userinput> 
&prompt.root; <userinput>make install clean</userinput></screen>

    <note>
      <para>Para compilar e instalar <application>&xorg;</application> 
        completamente, aseg&uacute;rese de tener como m&iacute;nimo 
        2GB de espacio disponible.<para>
    </note>

    <para>Para compilar e instalar 
      <application>&xfree86;&nbsp;4.X</application> desde la 
      colecci&oacute;n de ports:</para>

    <screen>&prompt.root; <userinput>cd /usr/ports/x11/XFree86-4</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

    <para>Tambi&eacute;n, X11 se puede instalar directamente 
      desde paquetes.  Tambi&eacute;n existen paquetes 
      binarios para usar con la herramienta &man.pkg.add.1;.  Cuando 
      se usa la opci&oacute;n de bajar binarios de &man.pkg.add.1; la 
      versi&oacute;n del paquete no se tiene que 
      especificar.  &man.pkg.add.1; descargar&aacute; autom&aacute;ticamente 
      la &uacute;ltima versi&oacute;n de la aplicaci&oacute;n.</para>

    <para>As&iacute; que para descargar e instalar el paquete de 
      <application>&xorg;</application> simplemente escriba:</para>

    <screen>&prompt.root; <userinput>pkg-add -r XFree86</userinput></screen>

    <note><para>Los ejemplos anteriores instalar&aacute; la 
      distribuci&oacute;n completa de X11 incluyendo servidores, clientes, 
      tipos de letra, etc.  Tambi&eacute;n hay paquetes separados y 
      ports para las diferentes partes de X11.</para></note>

    <para>El resto de este cap&iacute;tulo explicar&aacute; c&oacute;mo 
      configurar X11 y c&oacute;mo instalar un entorno de escritorio 
      productivo.</para>

<!-- La forma mas sencilla es desde sysinstall para XFree86 4.X -->
    <sect2 id="x-to-xorg">
      <title>C&oacute;mo Sustitu&iacute;r <application>&xfree86;</application> 
        por <application>&xorg;</application></title>

      <para>Como con cualquier port deber&iacute;a usted consultar el 
        fichero <filename>/usr/ports/UPDATING</filename> para ver los 
        cambios.  En este fichero se incluyen instrucciones para 
        convertir su sistema de <application>&xfree86;</application> a 
        <application>&xorg;</application>.</para>

      <para>Use <application>CVSup</application> para actualizar su 
        &aacute;rbol de ports antes de intentar cualquier migraci&oacute;n 
        de este estilo.  Tambi&eacute;n necesitar&aacute; instalar 
        <filename role="package">sysutils/portupgrade</filename>.</para>

      <para>A&ntilde;ada en su <filename>/etc/make.conf</filename> la 
        variable <literal>X_WINDOW_SYSTEM=xorg</literal>.  Esto asegura 
        que su sistema sepa que sistema X window se esta usando.  La antigua 
        variable <literal>XFREE86_VERSION</literal> esta obsoleta y se ha 
        reemplazado con la variable <literal>X_WINDOW_SYSTEM</literal>.</para>

      <para>Hecho esto use las siguientes &oacute;rdenes:</para>

<screen>&prompt.root; <userinput>pkg_delete -f /var/db/pkg/imake-4* /var/db/pkg/XFree86-*</userinput>
&prompt.root; <userinput>cd /usr/ports/x11/xorg</userinput>
&prompt.root; <userinput>make install clean</userinput>
&prompt.root; <userinput>pkgdb -F</userinput></screen>

      <para>&man.pkgdb.1; forma parte del software 
        <application>portupgrade</application> y actualizar&aacute; 
        varias dependencias del paquete.</para>
      <note>
        <para>Si desea compilar <application>&xorg;</application> 
          al completo aseg&uacute;rese de tener como m&iacute;nimo 
          2GB de espacio disponible.<para>
      </note>
    </sect2>
  </sect1>

  <sect1 id="x-config">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Christopher</firstname>
          <surname>Shumway</surname>
          <contrib>Escrito por </contrib>
          <!-- Julio 2001 -->
        </author>
      </authorgroup>
    </sect1info>
    <title>Configuraci&oacute;n de X11</title>


    <indexterm><primary>&xfree86;&nbsp;4.X</primary></indexterm>
    <indexterm><primary>&xfree86;</primary></indexterm>
    <indexterm><primary>&xorg;</primary></indexterm>
    <indexterm><primary>X11</primary></indexterm>

    <sect2>
      <title>Antes de empezar</title>

      <para>Antes de configurar X11 necesitar&aacute; la siguiente 
        informaci&oacute;n sobre el sistema:</para>

      <itemizedlist>
        <listitem><para>Especificaciones del monitor</para></listitem>
        <listitem><para>Chipset de la tarjeta de v&iacute;deo</para>
	  </listitem>
        <listitem><para>Memoria de la tarjeta de v&iacute;deo</para>
	  </listitem>
      </itemizedlist>

      <indexterm><primary>horizontal scan rate</primary></indexterm>
      <indexterm><primary>vertical scan rate</primary></indexterm>

      <para>X11 usa las especificaciones del 
        monitor para determinar la resoluci&oacute;n y la frecuencia de 
        refresco a la que funcionar&aacute;.  Estas especificaciones se 
        pueden obtener de la documentaci&oacute;n que viene con el monitor o 
        de la web del creador.  Se necesitan dos rangos de n&uacute;meros: la 
        frecuencia de refresco horizontal y vertical.</para>

      <para>El chipset de la tarjeta de v&iacute;deo define que controlador 
        utilizar&aacute; X11 para hablar con el hardware 
        gr&aacute;fico.  Con la mayor&iacute;a de chipsets es posible 
	detectarlo autom&aacute;ticamente pero es &uacute;til saberlo en 
        caso de que la detecci&oacute;n autom&aacute;tica no funcione de forma 
        correcta.</para>

      <para>La memoria de la tarjeta gr&aacute;fica determina la 
        resoluci&oacute;n y la profundidad de color a la que el sistema 
        funcionar&aacute;.  Es importante saberlo, as&iacute; el usuario 
        conoce las limitaciones del sistema.</para>

    </sect2>

    <sect2>
      <title>Configurar X11</title>

      <para>La configuraci&oacute;n de X11 
        es un proceso de varios pasos.  El primer paso es 
        generar una configuraci&oacute;n inicial.  Como super usuario 
        simplemente ejecute:</para>

      <screen>&prompt.root; <userinput>Xorg -configure</userinput></screen>

      <para>En el caso de <application>&xfree86;</application> escriba:</para>

      <screen>&prompt.root; <userinput>XFree86 -configure</userinput></screen>

      <para>Esto generar&aacute; el esqueleto del fichero de 
        configuraci&oacute;n de X11 en el 
        directorio <filename>/root</filename> con el nombre 
        <filename>xorg.conf.new</filename> (si usted us&oacute; 
        &man.su.1; o hizo un login directo afecta a la variable 
        <envar>$HOME</envar>).  En <application>&xfree86;</application> 
        este fichero de configuraci&oacute;n se llama 
        <filename>XF86Config.new</filename>.  El programa X11 
        intentar&aacute; encontrar el hardware gr&aacute;fico del sistema 
        y escribir&aacute; el fichero de configuraci&oacute;n que 
        cargar&aacute; los controladores adecuados que se han 
        detectado.</para>

      <para>El siguiente paso es probar la configuraci&oacute;n para 
        verificar que <application>&xorg;</application> puede trabajar con 
        el hardware gr&aacute;fico del sistema.  Escriba:</para>

      <screen>&prompt.root; <userinput>Xorg -config xorg.conf.new</userinput></screen>

      <para>Los usuarios de <application>&xfree86;</application> 
        deben escribir:</para>

      <screen>&prompt.root; <userinput>XFree86 -xf86config XF86Config.new</userinput></screen>

      <para>Si aparece una rejilla negra y gris junto con el cursor del 
        rat&oacute;n de X la configuraci&oacute;n ha tenido 
        &eacute;xito.  Para salir de la prueba pulse 
        <keycombo action="simul">
          <keycap>Ctrl</keycap>
          <keycap>Alt</keycap>
          <keycap>Retroceso</keycap>
        </keycombo> a la vez.</para>

      <note><para>Si el rat&oacute;n no funciona tendr&aacute; que 
        configurarlo antes de continuar.  Consulte <xref linkend="mouse"> 
        en el cap&iacute;tulo de instalaci&oacute;n de &os;.</para></note>

      <indexterm><primary>X11 Tuning</primary></indexterm>

      <para>Despu&eacute;s, modifique 
        <filename>xorg.conf.new</filename> (o 
        <filename>XF86Config.new</filename> si est&aacute; utilizando 
        <application>&xfree86;</application>)  a su 
        gusto.  Abra el fichero con un editor de texto como &man.emacs.1; o 
        &man.ee.1;.  Primero a&ntilde;ada las frecuencias del monitor.  Estas 
        suelen estar expresadas en frecuencia de refresco horizontal y 
	vertical.  Estos valores se a&ntilde;aden al fichero 
        <filename>xorg.conf.new</filename> en la secci&oacute;n 
        <literal>"Monitor"</literal>:</para>

      <programlisting>Section "Monitor"
        Identifier   "Monitor0"
        VendorName   "Monitor Vendor"
        ModelName    "Monitor Model"
        HorizSync    30-107
        VertRefresh  48-120
EndSection</programlisting>

      <para>Las palabras <literal>HorizSync</literal> y 
        <literal>VertRefresh</literal>  podr&iacute;an no existir en el 
        fichero de configuraci&oacute;n.  Si no existen es necesario 
        a&ntilde;adirlas con la frecuencia horizontal correcta puesta 
        despu&eacute;s de la palabra <literal>HorizSync</literal> y la 
        frecuencia vertical correcta despu&eacute;s de la palabra 
        <literal>VertRefresh</literal>.  En el ejemplo anterior se pusieron 
        las frecuencias del monitor.</para>

      <para>X permite usar las caracter&iacute;sticas DPMS (Energy Star) 
        con los monitores que lo soportan.  El programa &man.xset.1; controla 
        el <quote>timeout</quote>, y puede forzar los modos 
        <quote>standby</quote>, suspendido, o apagado.  Si desea habilitar las 
        caracter&iacute;sticas DPMS para su monitor tendr&aacute; que 
        a&ntilde;adir la siguiente l&iacute;nea en la secci&oacute;n 
        <literal>monitor</literal>:</para>

      <programlisting>
        Option       "DPMS"</programlisting>

      <indexterm>
        <primary><filename>xorg.conf</filename></primary>
      </indexterm>
      <indexterm>
        <primary><filename>XF86Config</filename></primary>
      </indexterm>

      <para>Mientras el fichero de configuraci&oacute;n 
        <filename>xorg.conf.new</filename> (o 
        <filename>XF86Config.new</filename>) sigue abierto en el editor 
        seleccione la resoluci&oacute;n por defecto y la profundidad de color 
        deseada.  Esto se define en la secci&oacute;n 
        <literal>"Screen"</literal>:</para>

      <programlisting>Section "Screen"
        Identifier "Screen0"
        Device     "Card0"
        Monitor    "Monitor0"
        DefaultDepth 24
        SubSection "Display"
                Viewport  0 0
                Depth     24
                Modes     "1024x768"
        EndSubSection
EndSection</programlisting>
      <para>La palabra <literal>DefaultDepth</literal> describe la profundidad 
        de color a la que arrancar&aacute; por defecto.  Esto puede 
        sobrescribirse con el argumento <command>-bpp</command> de 
	&man.Xorg.1; (o &man.XFree86.1;).  La palabra <literal>Modes</literal>
	describe la resoluci&oacute;n a la que funcionar&aacute; para esa 
	profundidad de color.  Observe que s&oacute;lo los modos 
	est&aacute;ndar VESA est&aacute;n soportados por el hardware 
        gr&aacute;fico.  En el ejemplo anterior la profundidad de color es 
        24 bits por pixel.  En esta profundidad de color la resoluci&oacute;n 
        aceptada es 1024 por 768 pixels.</para>

      <para>Para acabar guarde el fichero de configuraci&oacute;n y 
        pru&eacute;belo usando el modo de prueba descrito anteriormente.
	</para>

      <note>
        <para>Una de las herramientas disponibles para ayudarle con el 
          proceso de soluci&oacute;n de problemas es el fichero de 
          <quote>logs</quote>, que contiene informaci&oacute;n de cada 
          dispositivo al que el servidor X11 se conecta.  Los 
          <quote>logs</quote> (o bit&aacute;coras) de 
          <application>&xorg;</application> se pueden encontrar en 
          <filename>/var/log/Xorg.0.log</filename> 
          (los <quote>logs</quote> de <application>&xfree86;</application> 
          se pueden encontrar en <filename>XFree86.0.Log</filename>).  
          El nombre exacto del fichero de <quote>log</quote> puede variar 
          entre <filename>Xorg.0.log</filename> y 
          <filename>Xorg.8.log</filename> y as&iacute; 
          sucesivamente.</para>
      </note>

      <para>Si todo es correcto el fichero de configuraci&oacute;n tiene que 
        instalarse en un lugar donde &man.Xorg.1; (o &man.XFree86.1;) lo 
        encuentre.  Este lugar es normalmente 
        <filename>/etc/X11/xorg.conf</filename> o 
        <filename>/usr/X11R6/etc/X11/xorg.conf</filename> (para 
        <application>&xfree86;</application> es 
        <filename>/etc/X11/XF86Config</filename> o 
        <filename>/usr/X11R6/etc/X11/XF86Config</filename>).</para>

      <screen>&prompt.root; <userinput>cp xorg.conf.new /etc/X11/xorg.conf</userinput></screen>

      <para>Para <application>&xfree86;</application>:</para>

      <screen>&prompt.root; <userinput>cp XF86Config.new /etc/X11/XF86Config</userinput></screen>

      <para>El proceso de configuraci&oacute;n de X11 ahora est&aacute; 
        completo.  Para arrancar <application>&xfree86;&nbsp;4.X</application>
        con &man.startx.1;, instale el port 
        <filename role="package">x11/wrapper</filename>. &nbsp; 
        <application>&xorg;</application> incluye el c&acute;digo del 
        <quote>wrapper</quote> y no necesita que se instale el port del 
        <quote>wrapper</quote>.  El servidor X11 tambi&eacute;n se puede 
        arrancar mediante &man.xdm.1;.</para>

      <note><para>Tambi&eacute;n hay una herramienta gr&aacute;fica para 
        configurar &man.xorgcfg.1; (&man.xf86cfg.1; para 
        <application>&xfree86;</application>)  que viene con la 
        distribuci&oacute;n X11.  Permite definir la 
        configuraci&oacute;n de forma interactiva y elegir los controladores 
        y las opciones adecuadas.  Este programa tambi&eacute;n se puede usar 
        desde consola mediante la orden 
        <command>xorgcfg -textmode</command>.  Para mas informaci&oacute;n 
        consulte las p&aacute;ginas del manual &man.xorgcfg.1; y 
        &man.xf86cfg.1;.</para>

      <para>Tambi&eacute;n existe una herramienta llamada 
        &man.xorgconfig.1; (&man.xf86config.1; para 
        <application>&xfree86;</application>).  Este programa es una 
        utilidad de consola que es menos atractiva para el usuario pero 
        que puede funcionar en situaciones donde las otras herramientas 
        no sirven.<para></note>

    </sect2>

    <sect2>
      <title>Configuraci&oacute;n avanzada</title>

      <sect3>
        <title>Configuraci&oacute;n de chipsets gr&aacute;ficos &intel; 
          i810</title>

        <indexterm><primary>Intel i810 graphic chipset</primary></indexterm>

        <para>Para configurar los chipsets integrados &intel; i810 es 
          necesario el interfaz de programaci&oacute;n AGP 
          <devicename>agpart</devicename> para que 
          X11 pueda usarla.  El controlador 
          &man.agp.4; viene con el kernel <filename>GENERIC</filename> desde 
          4.8-RELEASE y 5.0-RELEASE.  En las versiones anteriores es necesario 
          a&ntilde;adir la siguiente l&iacute;nea:</para>

        <programlisting>device agp</programlisting>

        <para>en el fichero de configuraci&oacute;n de su kernel y 
          recompilarlo.  Aunque quiz&aacute; prefiera cargar el m&oacute;dulo 
          del kernel <filename>agp.ko</filename> autom&aacute;ticamente con 
          &man.loader.8; al arrancar.  Si es su caso simplemente a&ntilde;ada 
          la siguiente l&iacute;nea a 
          <filename>/boot/loader.conf</filename>:</para>

        <programlisting>agp_load="YES"</programlisting>

        <para>Si usted usa FreeBSD 4.X o alguna versi&oacute;n anterior 
          es necesario crear el fichero de dispositivo para el 
          interfaz de programaci&oacute;n.  Para crear el fichero de 
	  dispositivo AGP ejecute &man.MAKEDEV.8; en el directorio 
          <filename>/dev</filename>:</para>

        <screen>&prompt.root; <userinput>cd /dev</userinput>
&prompt.root; <userinput>sh MAKEDEV agpart</userinput></screen>

        <note>
          <para>En FreeBSD 5.X o posterior no necesita ejecutar esta orden 
            debido a que &man.devfs.5; lo hace 
	    autom&aacute;ticamente.</para>
        </note>

        <para>Esto permitir&aacute; la configuraci&oacute;n del hardware como 
          si fuese cualquier otra tarjeta.  Tenga en cuenta que en sistemas 
          sin el controlador &man.agp.4; compilado intentar cargarlo con 
          &man.kldload.8; no funcionar&aacute;.  Este controlador tiene que 
          estar compilado en el kernel o cargarse en el arranque mediante 
          <filename>/boot/loader.conf</filename>.</para>

        <para>Si esta usando <application>&xfree86;&nbsp;4.1.0</application> 
	  (o superior) y obtiene mensajes sobre s&iacute;mbolos sin resolver 
	  como <literal>fbPictureInit</literal>, pruebe a&ntilde;adiendo la 
	  siguiente l&iacute;nea despu&eacute;s de 
          <literal>Driver "i810"</literal> en el fichero de 
          configuraci&oacute;n de X11:</para>
        <programlisting>Option "NoDDC"</programlisting>
      </sect3>
    </sect2>
  </sect1>
  <sect1 id="x-fonts">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Murray</firstname>
          <surname>Stokely</surname>
          <contrib>Escrito por </contrib>
        </author>
      </authorgroup>
    </sect1info>
    <title>Uso de tipos en X11</title>

    <sect2 id="type1">
      <title>Fonts Type1</title>

      <para>Los tipos que vienen por defecto con 
        X11 no son ideales para las 
        aplicaciones t&iacute;picas.  Los tipos grandes para 
        presentaciones aparecen dentadas y con un aspecto poco profesional 
        y los tipos peque&ntilde;os en 
        <application>&netscape;</application> son pr&aacute;cticamente 
        ilegibles.  Sin embargo hay varios tipos de letra libres 
        Type1 de alta calidad (&postscript;) que se pueden usar con 
        X11.  Por ejemplo los tipos URW 
        (<filename role="package">x11-fonts/urwfonts</filename>) incluyen 
        una versi&oacute;n de alta calidad de los tipos est&aacute;ndar Type 
	1 (<trademark class="registered">Times Roman</trademark>, 
        (<trademark class="registered">Helvetica</trademark>, 
        (<trademark class="registered">Palatino</trademark>, y muchas otras).  
        Las Freefonts (<filename role="package">x11-fonts/freefonts</filename>
	) incluyen muchas m&aacute;s pero la mayor&iacute;a est&aacute;n 
        pensadas para usarse con software gr&aacute;fico como el 
        <application>Gimp</application> y no son lo bastante completos para 
        usarse como tipos de pantalla.  Adem&aacute;s X11 se 
        puede configurar para usar tipos &truetype; con un 
        esfuerzo m&iacute;nimo.  Para m&aacute;s detalles sobre esto consulte 
        la p&aacute;gina del manual &man.X.7; o la  
        <link 
        linkend="truetype">secci&oacute;n de tipos &truetype;</link>.</para>

      <para>Para instalar los tipos Type1 desde 
        los ports ejecute las siguientes &oacute;rdenes:</para>

  <screen>&prompt.root; <userinput>cd /usr/ports/x11-fonts/urwfonts</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

      <para>Proceda del mismo modo con las FreeFonts o cualesquiera otras.  
        Para que el servidor X las detecte a&ntilde;ada la siguiente 
        l&iacute;nea al fichero de configuraci&oacute;n de las X en 
        <filename>/etc/X11/</filename> (<filename>xorg.conf</filename> para 
        <application>&xorg;</application>  y 
        <filename>XF86Config</filename> para 
        <application>&xfree86;</application>):</para>

      <programlisting>FontPath "/usr/X11R6/lib/X11/fonts/URW/"</programlisting>

      <para>o bien desde una emulaci&oacute;n de terminal durante 
        sesi&oacute;n X:</para>

      <screen>&prompt.user; <userinput>xset fp+ /usr/X11R6/lib/X11/fonts/URW</userinput>
&prompt.user; <userinput>xset fp rehash</userinput></screen>

      <para>Esto funcionar&aacute; hasta que la sesi&oacute;n X se cierre a 
        menos que lo a&ntilde;ada a su fichero de inicio 
        (<filename>~/.xinitrc</filename> para una sesi&oacute;n 
        <command>startx</command> normal o <filename>~/.xsession</filename> 
        si hace login desde un gestor gr&aacute;fico como 
        <application>XDM</application>).  Una tercera forma ser&iacute;a 
        usando el nuevo fichero 
        <filename>/usr/X11R6/etc/fonts/local.conf</filename>:
        mire la secci&oacute;n de <link
        linkend="antialias">anti-aliasing</link>.
      </para>
    </sect2>

    <sect2 id="truetype">
      <title>Fonts &truetype;</title>

      <indexterm><primary>TrueType Fonts</primary></indexterm>
      <indexterm><primary>fonts</primary>
        <secondary>TrueType</secondary>
      </indexterm>

      <para>Tanto <application>&xfree86;&nbsp; 4.X</application> como 
        <application>&xorg;</application> se dise&ntilde;aron 
        para soportar tipos &truetype;.  Hay dos 
	m&oacute;dulos diferentes que pueden habilitar esta opci&oacute;n.  El
	m&oacute;dulo freetype se usa en en este ejemplo porque es m&aacute;s
	consistente con el resto de <quote>back-ends</quote> de 
	representaci&oacute;n.  Para habilitar el m&oacute;dulo freetype solo
	a&ntilde;ada la siguiente l&iacute;nea a la secci&oacute;n 
	<literal>"Module"</literal> del fichero 
        <filename>/etc/X11/xorg.conf</filename> o 
        <filename>/etc/X11/XF86Config</filename>.</para>

      <programlisting>Load "freetype"</programlisting>

      <para>Para <application>&xfree86;&nbsp;3.3.X</application> hace falta un
        servidor de tipos &truetype; separado.   Normalmente
	se usa <application>Xfstt</application> para este prop&oacute;sito.  
	Para instalar <application>Xfstt</application>, simplemente instale el
	port <filename role="package">x11-server/Xfstt</filename>.</para>

      <para>Ahora haga un directorio para los tipos &truetype; (por ejemplo 
        <filename>/usr/X11R6/lib/X11/fonts/TrueType</filename>) y copie todos 
        los tipos &truetype; en este directorio.  Recuerde que los 
        tipos &truetype; no se pueden coger directamente de 
        un &macintosh;; tienen que estar en formato &unix;/&ms-dos;/&windows; 
        para usarlas con X11.  Una vez que los ficheros 
        se hayan copiado en este directorio use 
        <application>ttmkfdir</application> para crear un fichero 
        <filename>fonts.dir</filename>, para que el representador de tipos 
        de X sepa que se han instalado estos ficheros 
         nuevos.  <command>ttmkfdir</command> esta disponible desde los ports 
        de &os; como <filename role="package">x11-fonts/ttmkfdir</filename>.
      </para>

<screen>&prompt.root; <userinput>cd /usr/X11R6/lib/X11/fonts/TrueType</userinput>
&prompt.root; <userinput>ttmkfdir > fonts.dir</userinput></screen>

      <para>Ahora a&ntilde;ada el directorio &truetype; a la ruta de 
        tipos.  Esto es igual que lo anteriormente descrito sobre los 
        tipos <link linkend="type1">Type1</link>.  
        ejecute:</para>

<screen>&prompt.user; <userinput>xset fp+ /usr/X11R6/lib/X11/fonts/TrueType</userinput>
&prompt.user; <userinput>xset fp rehash</userinput></screen>


      <para>o a&ntilde;ada una l&iacute;nea <literal>FontPath</literal> al 
        fichero <filename>xorg.conf</filename> 
        (o <filename>XF86Config</filename>).</para>

      <para>Esto es todo.  Ahora <application>&netscape;</application>, 
        <application>Gimp</application>, 
        <application>&staroffice;</application> y el resto de aplicaciones X 
        debieran reconocer los tipos &truetype; instalados.  
        Los tipos muy  peque&ntilde;os (como el texto en una pantalla con 
	alta resoluci&oacute;n viendo una p&aacute;gina web) y los 
        tipos muy grandes (Dentro de 
        <application>&staroffice;</application>) se ver&aacute;n 
        much&iacute;simo mejor ahora.</para>
    </sect2>

    <sect2 id="antialias">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Joe Marcus</firstname>
            <surname>Clarke</surname>
            <contrib>Actualizado por </contrib>
            <!-- Mayo 2003 -->
          </author>
        </authorgroup>
      </sect2info>
      <title>Fonts Anti-Aliased</title>

      <indexterm><primary>anti-aliased fonts</primary></indexterm>
      <indexterm><primary>fonts</primary>
        <secondary>anti-aliased</secondary></indexterm>

      <para>Los <quote>tipos anti-aliasing</quote> han estado en 
        X11 desde 
        <application>&xfree86;</application> 4.0.2.  Aunque la 
        configuraci&oacute;n de los tipos era inc&oacute;moda 
        antes de 
        <application>&xfree86;</application> 4.3.0.  A partir de 
        <application>&xfree86;</application> 4.3.0 todos los 
        tipos de X11 que se encuentren en 
        <filename>/usr/X11R6/lib/X11/fonts/</filename> y 
        <filename>~/.fonts/</filename> est&aacute;n disponibles 
        autom&aacute;ticamente para aplicaciones que soporten Xft.  No todas 
        las aplicaciones soportan Xft pero muchas ya tienen soporte 
        Xft.  Ejemplos de aplicaciones que lo soportan son Qt 2.3 o superior 
        (el <quote>toolkit</quote> del escritorio 
        <application>KDE</application>), GTK+ 2.0 o superior (el 
        <quote>toolkit</quote> del escritorio <application>GNOME</application>
	) y <application>Mozilla</application> 1.2 o superior.
      </para>

      <para>Para controlar qu&eacute; tipos son 
        <quote>anti-aliasing</quote> o configurar las propiedades 
        <quote>anti-aliasing</quote> cr&eacute;e (o edite, si ya existe) 
        el fichero 
        <filename>/usr/X11R6/etc/fonts/local.conf</filename>.  Se pueden 
        modificar diversas opciones avanzadas del sistema de tipos Xft 
	usando este fichero; esta secci&oacute;n describe solo algunas 
	posibilidades simples.  Para m&aacute;s detalles consulte 
	&man.fonts-conf.5;.</para>

      <indexterm><primary>XML</primary></indexterm>

      <para>Este fichero tiene que estar en formato XML.  Preste especial 
        atenci&oacute;n a las may&uacute;sculas y min&uacute;sculas y 
        aseg&uacute;rese de que las etiquetas est&aacute;n cerradas 
        correctamente.  El fichero empieza con la t&iacute;pica cabecera XML 
        seguida de una definici&oacute;n DOCTYPE y despu&eacute;s la etiqueta 
        <literal>&lt;fontconfig&gt;</literal>:</para>

      <programlisting>
        &lt;?xml version="1.0"?&gt;
        &lt;!DOCTYPE fontconfig SYSTEM "fonts.dtd"&gt;
        &lt;fontconfig&gt;
      </programlisting>

      <para>Como se ha dicho antes todos los tipos en 
        <filename>/usr/X11R6/lib/X11/fonts/</filename> y en 
        <filename>~/.fonts/</filename> est&aacute;n ya disponibles para las 
        aplicaciones que soporten Xft.  Si usted desea a&ntilde;adir otro 
        directorio adem&aacute;s de estos dos &aacute;rboles de directorios 
        a&ntilde;ada una l&iacute;nea similar a esta en el fichero 
        <filename>/usr/X11R6/etc/fonts/local.conf</filename>:</para>
      
      <programlisting>&lt;dir&gt;/path/to/my/fonts&lt;/dir&gt;</programlisting>

      <para>Despu&eacute;s de a&ntilde;adir los nuevos tipos, 
        y en especial los nuevos directorios de tipos, 
        debe ejecutar la siguiente orden para 
        reconstruir la cach&eacute; de tipos:</para>

      <screen>&prompt.root; <userinput>fc-cache -f</userinput></screen>

      <para>Los <quote>tipos anti-aliasing</quote> hacen los bordes 
        ligeramente borrosos, lo que hace que el texto muy 
        peque&ntilde;o sea m&aacute;s legible y elimina los escalones del 
        texto grande pero puede causar fatiga visual aplicada al texto 
        normal.  Para excluir los tipos de menos de 14 
        puntos del <quote>anti-aliasing</quote> incluya las siguientes 
        l&iacute;neas:</para>

      <programlisting>        &lt;match target="font"&gt;
            &lt;test name="size" compare="less"&gt;
                &lt;double&gt;14&lt;/double&gt;
            &lt;/test&gt;
            &lt;edit name="antialias" mode="assign"&gt;
                &lt;bool&gt;false&lt;/bool&gt;
            &lt;/edit&gt;
        &lt;/match&gt;
        &lt;match target="font"&gt;
            &lt;test name="pixelsize" compare="less" qual="any"&gt;
                &lt;double&gt;14&lt;/double&gt;
            &lt;/test&gt;
            &lt;edit mode="assign" name="antialias"&gt;
                &lt;bool&gt;false&lt;/bool&gt;
            &lt;/edit&gt;
        &lt;/match&gt;</programlisting>

      <indexterm><primary>fonts</primary>
        <secondary>spacing</secondary></indexterm>

      <para>El espacio entre algunos tipos tambi&eacute;n 
        podr&iacute;a ser inapropiado con <quote>anti-aliasing</quote>.  Esto 
        parece un problema con <application>KDE</application> en particular.  
        Una posible soluci&oacute;n para esto es forzando que el espacio entre 
        los tipos sea 100.  A&ntilde;ada las siguientes 
        l&iacute;neas:</para>

       <programlisting>       &lt;match target="pattern" name="family"&gt;
             &lt;test qual="any" name="family"&gt;
                 &lt;string&gt;fixed&lt;/string&gt;
             &lt;/test&gt;
             &lt;edit name="family" mode="assign"&gt;
                 &lt;string&gt;mono&lt;/string&gt;
             &lt;/edit&gt;
          &lt;/match&gt;
          &lt;match target="pattern" name="family"&gt;
              &lt;test qual="any" name="family"&gt;
                  &lt;string&gt;console&lt;/string&gt;
              &lt;/test&gt;
              &lt;edit name="family" mode="assign"&gt;
                  &lt;string&gt;mono&lt;/string&gt;
              &lt;/edit&gt;
          &lt;/match&gt;</programlisting>

      <para>(Esto selecciona los otros nombres comunes para 
        <quote>tipos fixed</quote> como <literal>"mono"</literal>) y 
        despu&eacute;s a&ntilde;ada:</para>

      <programlisting>         &lt;match target="pattern" name="family"&gt;
             &lt;test qual="any" name="family"&gt;
                 &lt;string&gt;mono&lt;/string&gt;
             &lt;/test&gt;
             &lt;edit name="spacing" mode="assign"&gt;
                 &lt;int&gt;100&lt;/int&gt;
             &lt;/edit&gt;
         &lt;/match&gt;      </programlisting>

      <para>Algunos tipos como Helvetica podr&iacute;an 
        tener problemas con <quote>anti-aliasing</quote>.  Normalmente esto 
	se manifiesta en tipos que parecen cortados 
        verticalmente por la mitad.  En el peor de los casos podr&iacute;a  
        causar que el funcionamiento de aplicaciones como 
        <application>Mozilla</application> se interrumpiese.  Para evitar 
        esto considere a&ntilde;adir lo siguiente a 
        <filename>local.conf</filename>:
      </para>

      <programlisting>         &lt;match target="pattern" name="family"&gt;
             &lt;test qual="any" name="family"&gt;
                 &lt;string&gt;Helvetica&lt;/string&gt;
             &lt;/test&gt;
             &lt;edit name="family" mode="assign"&gt;
                 &lt;string&gt;sans-serif&lt;/string&gt;
             &lt;/edit&gt;
         &lt;/match&gt;        </programlisting>

      <para>Una vez que haya terminado de editar 
        <filename>local.conf</filename> aseg&uacute;rese de que el fichero 
        termina con la etiqueta <literal>&lt;/fontconfig&gt;</literal>.  No 
        hacer esto causar&aacute; que sus cambios sean ignorados.</para>

      <para>Los tipos por defecto que vienen con 
        X11 no son los ideales para <quote>anti-aliasing</quote>.  
        Puede encontrar otros mucho mejores en el port 
        <filename role="package">x11-fonts/bitstream-vera</filename>.  Este 
        port instalar&aacute; el fichero 
        <filename>/usr/X11R6/etc/fonts/local.conf</filename> si aun no se ha 
        creado.  Si el fichero existe el port creara el fichero 
        <filename>/usr/X11R6/etc/fonts/local.conf-vera</filename>.  Combine 
        el contenido de este fichero con 
        <filename>/usr/X11R6/etc/fonts/local.conf</filename> y los tipos 
        Bitstream reemplazar&aacute;n autom&aacute;ticamente los 
        tipos por defecto por X11 Serif, Sans Serif y 
        Monospaced.</para>

      <para>Por si esto fuera poco los usuarios pueden a&ntilde;adir sus 
        propios ajustes  mediante sus ficheros personales 
        <filename>.fonts.conf</filename>.  Los usuarios que deseen hacerlo 
        deber&aacute;n crear un fichero <filename>~/.fonts.conf</filename>.  
        Este fichero tiene que estar tambi&eacute;n en formato XML.</para>

      <indexterm><primary>LCD screen</primary></indexterm>
      <indexterm><primary>Fonts</primary>
        <secondary>LCD screen</secondary></indexterm>

      <para>Un &uacute;ltimo punto: con una pantalla LCD ser&iacute;a 
        deseable un muestreo de subpixel.  Esto b&aacute;sicamente trata los 
        componentes (separados horizontalmente) rojo, verde y azul para 
        mejorar la resoluci&oacute;n horizontal; los resultados pueden ser 
        impresionantes.  Para habilitar esto a&ntilde;ada la siguiente 
        l&iacute;nea al fichero 
        <filename>local.conf</filename>:</para>

      <programlisting>
        &lt;match target="font"&gt;
            &lt;test qual="all" name="rgba"&gt;
                &lt;const&gt;unknown&lt;/const&gt;
            &lt;/test&gt;
            &lt;edit name="rgba" mode="assign"&gt;
                &lt;const&gt;rgb&lt;/const&gt;
            &lt;/edit&gt;
        &lt;/match&gt;
      </programlisting>

      <note><para>Dependiendo del tipo de pantalla <literal>rgb</literal> 
        podr&iacute;a ser <literal>bgr</literal> o <literal>vrgb</literal> o 
        <literal>vbgr</literal>: experimente y elija cual funciona 
        mejor.</para></note>

      <indexterm><primary>Mozilla</primary></indexterm>
      <indexterm><primary>web browsers</primary>
        <secondary>Mozilla</secondary>
        <see>Mozilla</see></indexterm>

      <para>Una vez concluido el proceso <quote>anti-aliasing</quote> se 
        deber&iacute;a activar la pr&oacute;xima vez que arranque X, aunque 
        los programas necesitan saber como utilizarlo.  En 
        este momento el <quote>toolkit</quote> Qt sabe, as&iacute; que 
        <application>KDE</application> entero puede usar 
        <quote>tipos  anti-aliasing</quote> (consulte  
        <xref linkend="x11-wm-kde-antialias"> en 
        <application>KDE</application> para m&aacute;s detalle).  GTK+ y 
        <application>GNOME</application> tambi&eacute;n pueden usar 
        <quote>tipos anti-aliasing</quote> mediante <quote>Font</quote>
        (consulte <xref 
        linkend="x11-wm-gnome-antialias"> para m&aacute;s detalle).  Por 
        defecto <application>Mozilla</application> 
        1.2 o superior usar&aacute; autom&aacute;ticamente 
        <quote>tipos anti-aliasing</quote>.  Para deshabilitarlos 
        recompile <application>Mozilla</application> usando el 
        par&aacute;metro <makevar>-DWITHOUT_XFT</makevar>.</para>
    </sect2>
  </sect1>

  <sect1 id="x-xdm">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Seth</firstname>
          <surname>Kingsley</surname>
          <contrib>Escrito por </contrib>
        </author>
      </authorgroup>
    </sect1info>
    <title>El gestor de pantalla X</title>
    <sect2>
      <title>Descripci&oacute;n</title>

      <indexterm><primary>X Display Manager</primary></indexterm>
      <para>El gestor de pantalla X (<application>XDM</application>) es una 
        parte opcional del sistema X Window que se usa para el manejo de 
        sesiones.  Esto es &uacute;til para diferentes situaciones tales como 
        <quote>Terminales X</quote> con escritorios m&iacute;nimos y grandes 
        servidores de red.  Como X Window System es independiente 
        del protocolo y de la red hay muchas posibles configuraciones para 
        ejecutar clientes y servidores X en diferentes equipos conectados a 
        una red.  <application>XDM</application> da un interfaz 
        gr&aacute;fico para elegir a qu&eacute; pantalla se quiere 
        conectar y pedir la informaci&oacute;n de autenticaci&oacute;n como 
        el nombre de usuario y le contrase&ntilde;a.</para> 

      <para>Piense en <application>XDM</application> como proveedor de la 
        misma funcionalidad que la utilidad &man.getty.8; (consulte 
        <xref linkend="term-config"> para m&aacute;s detalles).  Esto quiere 
        decir que se encarga de los ingresos del sistema en la pantalla a la 
        que est&aacute; conectado y arranca el gestor de sesiones para el 
        usuario (normalmente un gestor de ventanas 
        X).  <application>XDM</application> entonces espera a que este 
	programa termine, se&ntilde;alando que el usuario ha terminado y que 
        se deber&iacute;a  desconectar de la pantalla.  En este punto 
        <application>XDM</application> puede mostrar las pantallas de entrada 
        al sistema y de selecci&oacute;n de pantalla para que el siguiente 
        usuario intente acceder al sistema.</para>
    </sect2>

    <sect2>
      <title>Uso de XDM</title>

      <para>El d&aelig;mon <application>XDM</application> se encuentra en 
        <filename>/usr/X11R6/bin/xdm</filename>.  Este programa se puede 
        arrancar en cualquier momento como <username>root</username> y 
        empezar&aacute; a gestionar la pantalla X en la m&aacute;quina 
        local.  Si se quiere que <application>XDM</application> arranque cada 
        vez que la m&aacute;quina se encienda puede hacerlo a&ntilde;adiendo 
        una entrada a <filename>/etc/ttys</filename>.  Para m&aacute;s  
        informaci&oacute;n sobre el formato y uso de este fichero consulte 
	<xref linkend="term-etcttys">.  Hay una l&iacute;nea en el fichero 
        <filename>/etc/ttys</filename> por defecto para arrancar el 
	d&aelig;mon <application>XDM</application> en una terminal virtual:
	</para>

      <screen>ttyv8   "/usr/X11R6/bin/xdm -nodaemon"  xterm   off secure</screen>

      <para>Por defecto esta entrada esta deshabilitada; para habilitarla 
        cambie el campo 5 de <literal>off</literal> a <literal>on</literal> y 
        reinicie &man.init.8; usando los pasos descritos en <xref 
        linkend="term-hup">.  El primer campo es el nombre de la terminal que 
        este programa manejar&aacute;: <literal>ttyv8</literal>.  Esto 
        significa que <application>XDM</application> empezar&aacute; a 
        ejecutarse en la terminal virtual n&uacute;mero 9.</para>
    </sect2>

    <sect2>
      <title>Configurar XDM</title>

      <para>El directorio de configuraci&oacute;n de 
        <application>XDM</application> esta en 
        <filename>/usr/X11R6/lib/X11/xdm</filename>.  En este directorio hay 
        varios ficheros usados para cambiar el comportamiento y la apariencia 
        de <application>XDM</application>.  Normalmente encontrar&aacute; 
        estos ficheros:</para>

      <informaltable frame="none">
        <tgroup cols="2">
          <thead>
            <row>
              <entry>Fichero</entry>
              <entry>Descripci&oacute;n</entry>
            </row>
          </thead>

          <tbody>
            <row>
              <entry><filename>Xaccess</filename></entry>
              <entry>Reglas de acceso para clientes.</entry>
            </row>

            <row>
              <entry><filename>Xresources</filename></entry>
              <entry>Recursos de X por defecto.</entry>
            </row>

            <row>
              <entry><filename>Xservers</filename></entry>
              <entry>Lista de pantallas locales y remotas a gestionar.</entry>
            </row>

            <row>
              <entry><filename>Xsession</filename></entry>
              <entry><quote>script</quote> por defecto para el acceso al 
                sistema.</entry>
            </row>

            <row>
              <entry><filename>Xsetup_</filename>*</entry>
              <entry><quote>script</quote> para lanzar aplicaciones antes del 
                acceso al sistema.</entry>
            </row>

            <row>
              <entry><filename>xdm-config</filename></entry>
              <entry>Configuraci&oacute;n de todas las pantallas de
              este equipo.</entry>
            </row>

            <row>
              <entry><filename>xdm-errors</filename></entry>
              <entry>Errores generados por el programa servidor.</entry>
            </row>

            <row>
              <entry><filename>xdm-pid</filename></entry>
              <entry>El ID de proceso del XDM que est&aacute; 
                 funcionando.</entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>

      <para>En este directorio tambi&eacute;n hay unos cuantos programas y 
        <quote>scripts</quote> usados para arrancar el escritorio cuando 
        <application>XDM</application> se est&aacute; ejecutando.  
        El objetivo de cada uno de estos ficheros ser&aacute; descrito 
        brevemente.  La sintaxis exacta y el uso de todos estos ficheros 
        se describe en &man.xdm.1;.</para>

      <para>La configuraci&oacute;n por defecto es una simple ventana 
        rectangular de acceso al sistema con el nombre de la m&aacute;quina 
        en la parte superior en un tipo de letra grande y 
        <quote>Login:</quote> y <quote>Password:</quote> debajo.  Este es un 
        buen punto para aprender a cambiar el aspecto de las pantallas 
        de <application>XDM</application>.</para>

      <sect3>
        <title>Xaccess</title>

        <para>El protocolo para conectar con las pantallas controlada por 
          <application>XDM</application> se llama X Display Manager Connection 
          Protocol (XDMCP).  Este fichero es un conjunto de reglas para 
          controlar las conexiones XDMCP desde otros equipos.  Por defecto 
          permite a cualquier cliente conectar pero eso no importa a menos 
          que <filename>xdm-config</filename> se cambie para escuchar 
          conexiones remotas.</para>
      </sect3>

      <sect3>
        <title>Xresources</title>

        <para>Este es el fichero de opciones por defecto para el selector de 
          pantalla y acceso al sistema.  Aqu&iacute; es donde se puede 
          modificar la apariencia del programa de <quote>login</quote>.  
          El formato es id&eacute;ntico al fichero de opciones por defecto 
          descrito en la documentaci&oacute;n de X11.</para>
      </sect3>

      <sect3>
        <title>Xsession</title>

        <para>Este es el <quote>script</quote> de sesi&oacute;n que por 
	  defecto <application>XDM</application> arrancar&aacute; 
	  despu&eacute;s de que el usuario acceda al sistema.  Normalmente 
	  cada usuario tendr&aacute; una versi&oacute;n personalizada del 
          <quote>script</quote> de sesi&oacute;n en 
          <filename>~/.xsession</filename> que sobreescribe el 
          <quote>script</quote> por defecto.</para>
      </sect3>

      <sect3>
        <title>Xsetup_*</title>

        <para>Estos se arrancar&aacute;n autom&aacute;ticamente antes de que 
	  se muestre el interfaz de selecci&oacute;n o de acceso al sistema.  
          Hay un <quote>script</quote> por cada gestor de ventanas disponible 
          llamados <filename>Xsetup_</filename> seguido por el n&uacute;mero 
	  de pantalla local (por ejemplo <filename>Xsetup_0</filename>).  
	  Normalmente estos <quote>scripts</quote> arrancan uno o dos 
	  programas en segundo plano, por ejemplo <command>xconsole</command>.
	  </para>
      </sect3>

      <sect3>
        <title>xdm-config</title>

        <para>Este fichero contiene las opciones por defecto aplicables a 
          todas las pantallas que gestiona esta instalaci&oacute;n.</para>
      </sect3>

      <sect3>
        <title>xdm-errors</title>
        <para>Este fichero contiene la salida de los servidores X que 
          <application>XDM</application> intente arrancar.  Si alguna pantalla 
          que <application>XDM</application> intente arrancar se cuelga por 
          alguna raz&oacute;n este es un buen sitio para buscar los mensajes 
          de error.  Estos mensajes tambi&eacute;n se escriben en el fichero 
          <filename>~/.xsession-errors</filename> del usuario en cada 
          sesi&oacute;n.</para>
      </sect3>
    </sect2>

    <sect2>
      <title>Ejecutar un servidor de pantalla a trav&eacute;s de la red
        </title>

      <para>Para que otros clientes puedan conectar al servidor de pantalla 
        edite las reglas de acceso y habilite la escucha en la 
        conexi&oacute;n.  Por defecto tiene valores restrictivos.  Para 
        hacer que <application>XDM</application> escuche conexiones 
        primero comente una l&iacute;nea en el fichero 
        <filename>xdm-config</filename>:</para>

      <screen>! SECURITY: do not listen for XDMCP or Chooser requests
! Comment out this line if you want to manage X terminals with xdm
DisplayManager.requestPort:     0</screen>

      <para>y despu&eacute;s reinicie <application>XDM</application>.  
        Recuerde que los comentarios en los ficheros de opciones por defecto 
        comienzan con el car&aacute;cter<quote>!</quote> en 
        vez del t&iacute;pico <quote>#</quote>.  Ser&iacute;a deseable usar 
        accesos de control mas restrictivos.  Mire las opciones de ejemplo en 
        <filename>Xaccess</filename>, y la p&aacute;gina del manual 
        &man.xdm.1;.</para>
    </sect2>

    <sect2>
      <title>Alternativas a XDM</title>

      <para>Hay algunas alternativas al programa por defecto 
        <application>XDM</application>.  Una de ellas, 
        <application>kdm</application>, (que se incluye con 
        <application>KDE</application>) se describe despu&eacute;s en este 
        cap&iacute;tulo.  <application>kdm</application> ofrece muchas 
	ventajas visuales y funcionalidad para permitir a los usuarios elegir
	su gestor de ventanas en el momento del acceso al sistema.</para>
    </sect2>
  </sect1>

  <sect1 id="x11-wm">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Valentino</firstname>
          <surname>Vaschetto</surname>
          <contrib>Escrito por </contrib>
        </author>
        <!-- Junio 2001 -->
      </authorgroup>
    </sect1info>

    <title>Entornos de escritorio</title>

    <para>Est&aacute; secci&oacute;n describe los diferentes entornos de 
      escritorio disponibles para X en &os;.  Un <quote>entorno de 
      escritorio</quote> puede ser cualquier cosa que vaya desde un simple 
      gestor de ventanas hasta una completa <quote>suite</quote> de 
      aplicaciones de escritorio tales como <application>KDE</application> o 
      <application>GNOME</application>.</para>

    <sect2 id="x11-wm-gnome">
      <title>GNOME</title>

      <sect3 id="x11-wm-gnome-about">
        <title>Sobre GNOME</title>
        <indexterm><primary>GNOME</primary></indexterm>
        <para><application>GNOME</application> es un entorno de escritorio 
          amigable que permite a los usuarios una configuraci&oacute;n 
          f&aacute;cil de sus sistemas.  <application>GNOME</application> 
          incluye un panel (para iniciar las aplicaciones y mostrar su 
          estado),  un escritorio (donde pueden colocarse los datos y las 
          aplicaciones), un conjunto de herramientas y aplicaciones de 
          escritorio est&aacute;ndar y un conjunto de convenciones para 
          facilitar la creaci&oacute;n de aplicaciones que sean consistentes 
	  y colaboren unas con otras.  Los usuarios de otros sistemas 
	  operativos o entornos pueden sentirse como en casa utilizando el 
	  poderoso entorno gr&aacute;fico <application>GNOME</application>.  
	  Encontrar&aacute; m&aacute;s informaci&oacute;n sobre 
	  <application>GNOME</application> en &os; en la p&aacute;gina 
	  <ulink url="http://www.FreeBSD.org/gnome">del 
          Proyecto FreeBSD GNOME</ulink>.</para>
      </sect3>

      <sect3 id="x11-wm-gnome-install">
        <title>Instaci&oacute;n de GNOME</title>

        <para>La manera m&aacute;s sencilla de instalar 
          <application>GNOME</application> es escogerlo en el men&uacute; 
          <quote>Desktop Configuration</quote> durante el proceso de 
          instalaci&oacute;n de &os; tal y como se describe en <xref
	  linkend="default-desktop"> del cap&iacute;tulo 2. Tambi&eacute;n 
          puede instalarse f&aacute;cilmente desde paquetes 
          pre-compilados o desde la colecci&oacute;n de ports:</para>

        <para>Para instalar el paquete de <application>GNOME</application>
          desde la red, simplemente teclee:</para>

        <screen>&prompt.root; <userinput>pkg_add -r gnome2</userinput></screen>

        <para>Para compilar <application>GNOME</application> a partir del 
          c&oacute;digo fuente utilice el &aacute;rbol de ports:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11/gnome2</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Una vez <application>GNOME</application> est&eacute; instalado 
          debe indicarle al servidor X como iniciar 
          <application>GNOME</application> para convertirlo en el gestor de 
          ventanas predeterminado.  S&iacute; dispone ya de un fichero 
          <filename>.xinitrc</filename> personalizado simplemente sustituya 
          la l&iacute;nea que inicia su actual gestor de ventanas por 
          <application>/usr/X11R6/bin/gnome-session</application>.  
          Si entonces no pasa nada extra&ntilde;o con su fichero de 
          configuraci&oacute;n basta con que teclee:</para>

<screen>&prompt.user; <userinput>echo "/usr/X11R6/bin/gnome-session" &gt; ~/.xinitrc</userinput></screen>

        <para>Despu&eacute;s teclee <command>startx</command> y deber&iacute;a 
          iniciarse el entorno de escritorio 
          <application>GNOME</application>.</para>

        <note><para>S&iacute; est&aacute; utilizando un gestor de pantalla 
	  como <application>XDM</application> lo anterior no 
	  funcionar&aacute;.  Cree un fichero ejecutable 
          <filename>.xsession</filename> con la misma orden en 
          &eacute;l.  Para hacerlo edite el fichero y sustituya la orden 
          para iniciar su actual gestor de ventanas por 
          <application>/usr/X11R6/bin/gnome-session</application>:
          </para></note>

        <screen>&prompt.user; <userinput>echo "#!/bin/sh" > ~/.xsession</userinput>
&prompt.user; <userinput>echo "/usr/X11R6/bin/gnome-session" >> ~/.xsession</userinput>
&prompt.user; <userinput>chmod +x ~/.xsession</userinput></screen>

        <para>Otra opci&oacute;n es configurar el gestor de pantalla para que 
          permita seleccionar el gestor de ventanas durante el acceso;  
          la secci&oacute;n de <link
          linkend="x11-wm-kde-details">detalles de KDE</link> explica como 
          hacerlo para <application>kdm</application>, el gestor de pantalla 
          de <application>KDE</application>.</para>
      </sect3>


      <sect3 id="x11-wm-gnome-antialias">
        <title><quote>Fonts Anti-aliased</quote> en GNOME</title>

        <indexterm><primary>GNOME</primary>
          <secondary>anti-aliased fonts</secondary></indexterm>
	<para>X11 soporta <quote>anti-aliasing</quote> a 
          trav&eacute;s de la extensi&oacute;n <quote>RENDER</quote>.  Gtk+ 
	  2.0 y superiores (el <quote>toolkit</quote> utilizado por 
          <application>GNOME</application>) disponen de esta funcionalidad.  
	  La configuraci&oacute;n del <quote>anti-aliasing</quote> se describe
	  en <xref linkend="antialias">.  Una vez configurado el software es 
          posible utilizar <quote>anti-aliasing</quote> en el entorno de 
          escritorio <application>GNOME</application>.  S&oacute;lamente vaya
	  a 
	  <menuchoice>
	    <guimenu>Applications</guimenu>
	    <guisubmenu>Desktop Preferences</guisubmenu>
	    <guimenuitem>Font</guimenuitem></menuchoice>,
          y seleccione entre 
	  <guibutton>Best shapes</guibutton>, 
	  <guibutton>Best contrast</guibutton>, o 
	  <guibutton>Subpixel smoothing (LCDs)</guibutton>.  Para una 
	  aplicaci&oacute;n Gtk+ que no forme parte del escritorio 
	  <application>GNOME</application>, establece la variable de entorno 
          <varname>GDK_USE_XFT</varname> a <literal>1</literal> antes de 
	  iniciar el programa.</para>
      </sect3>
    </sect2>

    <sect2 id="x11-wm-kde">
      <title>KDE</title>

      <indexterm><primary>KDE</primary></indexterm>
      <sect3 id="x11-wm-kde-about">
        <title>Sobre KDE</title>

        <para><application>KDE</application> es un entorno de escritorio 
          contempor&aacute;neo y f&aacute;cil de usar.  Alguna de las cosas 
	  que <application>KDE</application> brinda al usuario son:</para>

        <itemizedlist>
          <listitem>
	    <para>Un bello escritorio contempor&aacute;neo</para>
	  </listitem>

          <listitem>
	    <para>Un escritorio completamente transparente en red</para>
	  </listitem>

          <listitem>
	    <para>Un sistema de ayuda integrado que facilita un adecuado y 
              consistente acceso a la ayuda durante el uso del escritorio 
	      <application>KDE</application> y sus aplicaciones</para>
	  </listitem>

          <listitem>
	    <para>Un aspecto consistente de todas las aplicaciones 
              <application>KDE</application></para>
	  </listitem>

          <listitem>
	    <para>Men&uacute;s y barras de herramientas est&aacute;ndar, 
	      teclas programables, esquemas de color, etc.</para>
	  </listitem>

          <listitem>
	    <para>Internacionalizaci&oacute;n: <application>KDE</application> 
              est&aacute; disponible en m&aacute;s de 40 idiomas</para>
	  </listitem>

          <listitem>
	    <para>Un di&aacute;logo de configuraci&oacute;n del escritorio 
              centralizado y  consistente</para>
	  </listitem>

          <listitem>
	    <para>Un gran n&uacute;mero de aplicaciones 
              <application>KDE</application> &uacute;tiles.</para>
	  </listitem>
        </itemizedlist>

        <para><application>KDE</application> posee una suite ofim&aacute;tica 
          basada en la tecnolog&iacute;a <application>KDE</application> 
          <quote>KParts</quote> que consta de una hoja de c&aacute;lculo, una 
          aplicaci&oacute;n para presentaciones, un organizador, un cliente 
	  de not&iacute;cias y mucho m&aacute;s.  
	  <application>KDE</application> tambi&eacute;n viene con un navegador
	  web llamado <application>Konqueror</application>, un 
          s&oacute;lido competidor frente a otros navegadores existentes en 
	  los sistemas &unix;.  Puede encontrarse m&aacute;s 
	  informaci&oacute;n sobre <application>KDE</application> en el 
	  <ulink url="http://www.kde.org/"> sitio web de KDE </ulink>.  Para 
          informaci&oacute;n espec&iacute;fica y recursos de 
          <application>KDE</application> en &os; consulte el sitio web del 
	  <ulink
          url="http://freebsd.kde.org/">equipo FreeBSD-KDE</ulink>.</para>
      </sect3>

      <sect3 id="x11-wm-kde-install">
        <title>Instalar KDE</title>

        <para>Igual que con <application>GNOME</application> o cualquier otro 
          entorno de escritorio la manera m&aacute;s f&aacute;cil de instalar 
          <application>KDE</application> es escogerlo en el men&uacute; 
          <quote>Desktop Configuration</quote> durante el proceso de 
          instalaci&oacute;n de &os; tal y como se describe en <xref 
          linkend="default-desktop"> del cap&iacute;tulo 2.  Una vez 
          m&aacute;s el software puede ser f&aacute;cilmente instalado desde 
          un paquete binario o desde la colecci&oacute;n de ports:</para>

        <para>Para instalar el paquete binario <application>KDE</application> 
          desde la red simplemente teclee:</para>

        <screen>&prompt.root; <userinput>pkg_add -r kde</userinput></screen>

	<para>&man.pkg.add.1; deber&iacute;a descargar autom&aacute;ticamente 
          la &uacute;ltima versi&oacute;n de la aplicaci&oacute;n.</para>

        <para>Si lo que desea es compilar <application>KDE</application> desde
	  el c&oacute;digo fuente utilice el &aacute;rbol de ports:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11/kde3</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Despu&eacute;s de haber instalado <application>KDE</application>
	  debe indicarle al servidor X como iniciar esta aplicaci&oacute;n 
	  para que se convierta en el gestor de ventanas por defecto.  Esto se
	  consigue editando el fichero <filename>.xinitrc</filename>:</para>

        <screen>&prompt.user; <userinput>echo "exec startkde" &gt; ~/.xinitrc</userinput></screen>

	<para>A partir de ahora cuando se llame al sistema X Window con 
          <command>startx</command> el escritorio deber&iacute;a ser 
          <application>KDE</application>.</para>

        <para>S&iacute; utiliza un gestor de pantalla, como por ejemplo
          <application>xdm</application>, la configuraci&oacute;n es 
          ligeramente diferente.  En vez de lo antedicho edite el fichero 
          <filename>.xsession</filename>.  Las instrucciones para 
          <application>kdm</application> se decribir&aacute;n m&aacute;s 
          adelante en este cap&iacute;tulo.</para>
      </sect3>
    </sect2>

    <sect2 id="x11-wm-kde-details">
        <title>M&aacute;s detalles sobre KDE</title>

        <para>Ahora que <application>KDE</application> est&aacute; instalado 
	  en el sistema muchas cosas se pueden descubrir mediante las 
          p&aacute;ginas de ayuda o solamente se&ntilde;alando y haciendo clic
	  en los diversos men&uacute;s.  Los usuarios de &windows; o &mac; 
          deber&iacute;an sentirse como en casa.</para>

        <para>La mejor referencia para <application>KDE</application> es 
          la documentaci&oacute;n on-line.  <application>KDE</application> 
          viene con su propio navegador, <application>Konqueror</application>,
          docenas de aplicaciones &uacute;tiles y una extensa 
          documentaci&oacute;n.  El resto de esta secci&oacute;n trata sobre  
          cuestiones t&eacute;cnicas que son dif&iacute;ciles de aprender 
          mediante una exploraci&oacute;n al azar.</para>

      <sect3 id="x11-wm-kde-kdm">
        <title>El gestor de pantalla de KDE</title>

        <indexterm><primary>KDE</primary>
          <secondary>display manager</secondary></indexterm>
        <para>El administrador de un sistema multiusuario puede desear ofrecer
	  a sus usuarios la bienvenida con una pantalla de acceso 
          gr&aacute;fico.  Puede utilizarse <link
          linkend="x-xdm"><filename>xdm</filename></link> tal y como se ha 
          descrito anteriormente.  Sin embargo <application>KDE</application>
          incluye una alternativa, <application>kdm</application>, 
          dise&ntilde;ada para parecer atractiva e incluye m&aacute;s opciones
	  durante el acceso.  En concreto los usuarios pueden escoger 
	  f&aacute;cilmente (v&iacute;a men&uacute;) qu&eacute; entorno de 
	  escritorio (<application>KDE</application>,
          <application>GNOME</application>, o cualquier otro) se 
          ejecutar&aacute; despu&eacute;s de acceder al sistema.</para>

        <para>Para empezar ejecute el panel de control 
          <application>KDE</application>, <command>kcontrol</command>, como 
          <username>root</username>.  Generalmente se considera inseguro 
          ejecutar el entorno X como <username>root</username>, as&iacute; que
          puede ejecutar el gestor de ventanas como un usuario normal, para 
	  despu&eacute;s abrir una terminal (por ejemplo 
          <filename>xterm</filename> o sin ir m&aacute;s lejos 
          <filename>konsole</filename>, incluido en 
          <application>KDE</application>).  Convi&eacute;rtase en 
          <username>root</username> con  <userinput>su</userinput> 
          (el usuario debe estar presente en el grupo 
          <groupname>wheel</groupname> en <filename>/etc/group</filename>) y 
          entonces teclee <userinput>kcontrol</userinput>.</para>

	<para>Haga clic en el icono de la izquierda con el nombre 
	  <guibutton>System</guibutton>, despu&eacute;s en <guibutton>Login 
	  manager</guibutton>.  A la derecha hay varias opciones de 
          configuraci&oacute;n que el manual de 
	  <application>KDE</application> explica detalladamente.  Haga clic 
          en <guibutton>sessions</guibutton> a la derecha.  Luego haga clic 
          en <guibutton>New type</guibutton> para 
          a&ntilde;adir varios gestores de ventanas y entornos de 
          escritorio.  Esto solo son etiquetas, as&iacute; que puede poner 
          <application>KDE</application> y 
          <application>GNOME</application> en vez de 
          <application>startkde</application> o 
          <application>gnome-session</application>.  
          Incluya una etiqueta <literal>failsafe</literal>.</para>

        <para>Pruebe tambi&eacute;n con otros men&uacute;s: son bonitos y se 
          explican por s&iacute; mismos.  Cuando haya terminado haga clic en 
          <guibutton>Apply</guibutton> en la parte inferior y salga  del panel
          de control.</para>

        <para>Para asegurarse de que <application>kdm</application> entiende 
          lo que las etiquetas (<application>KDE</application>,
          <application>GNOME</application> etc) significan edite los ficheros 
          utilizados por <link linkend="x-xdm">XDM</link>.  
          <note><para>En <application>KDE 2.2</application> esto ha cambiado: 
          <application>kdm</application> ahora usa sus propios ficheros 
          de configuraci&oacute;n. Por favor, consulte la 
	  documentaci&oacute;n de <application>KDE 2.2</application> para 
	  m&aacute;s detalles.</para></note>
          En una terminal, como <username>root</username>, edite el fichero 
          <filename>/usr/X11R6/lib/X11/xdm/Xsession</filename>.  Hay 
          una secci&oacute;n como esta hacia la parte central:</para>

	<screen>case $# in
1)
        case $1 in
        failsafe)
                exec xterm -geometry 80x24-0-0
                ;;
        esac
esac</screen>

        <para>Hay que a&ntilde;adir unas pocas l&iacute;neas a esta 
          secci&oacute;n.  Asumiendo que las etiquetas usadas fuesen 
          <quote>KDE</quote> y <quote>GNOME</quote>, use lo siguiente:</para>

	<screen>case $# in
1)
        case $1 in
        kde)
                exec /usr/local/bin/startkde
                ;;
        GNOME)
                exec /usr/X11R6/bin/gnome-session
                ;;
        failsafe)
                exec xterm -geometry 80x24-0-0
                ;;
        esac
esac</screen>

        <para>Para que el fondo de escritorio de 
	  <application>KDE</application> se mantenga a la hora de acceder al 
	  sistema los usuarios se debe a&ntilde;adir la siguiente 
	  l&iacute;nea a <filename>/usr/X11R6/lib/X11/xdm/Xsetup_0</filename>:
	  </para>

        <screen>/usr/local/bin/kdmdesktop</screen>

        <para>Ahora debe asegurarse de que <application>kdm</application> 
          est&eacute; activado en <filename>/etc/ttys</filename> para que 
          arranque en el siguiente inicio del sistema.  Solo tiene que seguir 
          las instrucciones de la secci&oacute;n anterior en 
          <link linkend="x-xdm">XDM</link> y cambie las entradas del 
          programa <command>/usr/X11R6/bin/xdm</command>  por 
          <command>/usr/local/bin/kdm</command>.</para>
      </sect3>

      <sect3 id="x11-wm-kde-antialias">
        <title><quote>Fonts anti-aliased</quote></title>

        <indexterm><primary>KDE</primary>
          <secondary>anti-aliased fonts</secondary></indexterm>
        <para>X11 soporta <quote>anti-aliasing</quote> mediante 
	  su extensi&oacute;n <quote>RENDER</quote>, y a partir de la 
          versi&oacute;n 2.3, Qt (el <quote>toolkit</quote> usado por 
          <application>KDE</application>) soporta esta 
          extensi&oacute;n.  La configuraci&oacute;n se describe en la
          <xref linkend="antialias"> en 
          <quote>tipos X11 antialiasing</quote>. As&iacute;, 
          con software al d&iacute;a, es posible usar <quote>tipos 
          anti-aliasing</quote> en el escritorio 
          <application>KDE</application>.  Vaya al men&uacute; de KDE y 
          busque 
	  <menuchoice>
	    <guimenu>Preferences</guimenu>
	    <guisubmenu>Look and Feel</guisubmenu>
	    <guimenuitem>Fonts</guimenuitem></menuchoice> y haga clic en el 
          <quote>check box</quote> 
          <guibutton>Use Anti-Aliasing for Fonts and Icons</guibutton>.
          Para una aplicaci&oacute;n que no forme parte de 
	  <application>KDE</application> es necesario poner la variable 
          de entorno <varname>QT_XFT</varname> a <literal>true</literal>
          antes de arrancar el programa.</para>

       </sect3>
     </sect2>

     <sect2 id="x11-wm-xfce">
         <title>XFce</title>
       <sect3 id="x11-wm-xfce-about">
         <title>Sobre XFce</title>

        <para><application>XFce</application> es un entorno de escritorio 
          basado en el <quote>toolkit</quote> GTK utilizado por 
          <application>GNOME</application> pero es mucho m&aacute;s ligero y 
          est&aacute; pensado para aquellos que quieran un escritorio 
	  sencillo, eficiente y f&aacute;cil de utlizar y configurar.  
	  Visualmente es muy parecido a <application>CDE</application>, que 
	  podemos encontrar en sistemas &unix; comerciales.  Alguna de las 
	  caracter&eacute;sticas de <application>XFce</application> son:
	  </para>

         <itemizedlist>
           <listitem>
	     <para>Un escritorio sencillo y f&aacute;cil de utilizar</para>
           </listitem>

           <listitem>
	     <para>Completamente configurable v&iacute;a rat&oacute;n con 
               arrastrar y soltar, etc</para>
           </listitem>

           <listitem>
	     <para>Panel principal similar al de 
               <application>CDE</application>, con menos, 
               <quote>applets</quote> y  accesos directos a las 
               aplicaciones</para>
           </listitem>

           <listitem>
	     <para>Gestor de ventanas integrado , gestor de ficheros, gestor 
	       de sonido, m&oacute;dulo de compatibilidad con 
           <application>GNOME</application>, y otras mucho m&aacute;s.</para>
           </listitem>

           <listitem>
	     <para>Aspecto configurable (desde que utiliza GTK)</para>
           </listitem>

           <listitem>
	     <para>R&aacute;pido, ligero y eficiente: ideal para 
               m&aacute;quinas viejas/lentas o m&aacute;quinas con 
	       limitaciones de memoria</para>
           </listitem>
         </itemizedlist>

         <para>Puede encontrarse m&aacute;s informaci&oacute;n sobre 
          <application>XFce</application> en el 
          <ulink url="http://www.xfce.org/"> sitio web de XFce</ulink>.</para>
       </sect3>

       <sect3 id="x11-wm-xfce-install">
         <title>Instalar XFce</title>

        <para>En el momento de escribir este texto existe un paquete binario 
          para <application>XFce</application>.  Para instalarlo  
          simplemente escriba:</para>

        <screen>&prompt.root; <userinput>pkg_add -r xfce4</userinput></screen>

        <para>Tambi&eacute;n puede compilarlo desde el 
          c&oacute;digo usando la colecci&oacute;n de ports:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11-wm/xfce4</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Para indicar al servidor X que use 
         <application>XFce</application> la pr&oacute;xima vez que arranque 
         simplemente escriba lo siguiente:</para>

        <screen>&prompt.user; <userinput>echo "/usr/X11R6/bin/startxfce4" &gt; ~/.xinitrc</userinput></screen>

        <para>La pr&oacute;xima vez que arranque X 
          <application>XFce</application> ser&aacute; el escritorio.  
          Como antes, si se usa un gestor de pantalla como 
          <filename>xdm</filename> cree un <filename>.xsession</filename> tal
	  y como se ha descrito en la anterior secci&oacute;n en <link 
          linkend="x11-wm-gnome">GNOME</link>, pero con la orden 
	  <filename>/usr/X11R6/bin/startxfce4</filename>; Puede configurar el
	  gestor de pantalla para permitir elegir el escritorio en el momento
	  de acceder al sistema tal y como se ha explicado en esta 
	  secci&oacute;n en <link linkend="x11-wm-kde-kdm">kdm</link>.</para>
      </sect3>
    </sect2>
  </sect1>

</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
