<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Proyecto de documentaci&oacute;n de FreeBSD">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>
<!-- $FreeBSD$ -->

<html>
&header;

    <h2>Introducci&oacute;n</h2>

    <p>Tener el control de un nuevo y complejo sistema operativo es siempre
      una tarea complicada, no importa los gr&aacute;ficos que tenga. FreeBSD
      no es diferente en este aspecto.</p>

    <p>Aunque existe una gr&aacute;n cantidad de libros sobre Unix BSD (y Unix en 
      general), FreeBSD tiene sus propias caracter&iacute;sticas y
      procedimientos.</p>

    <p>Adem&aacute;s, FreeBSD puede ser la primera aproximaci&oacute;n a 
      sistemas Unix para muchos de sus usuarios, por lo que la disponibilidad
      de documentaci&oacute;n de alta calidad es muy importante.</p>

    <p>El Proyecto de Documentaci&oacute;n de FreeBSD existe para ayudar
      en este campo. Existen dos maneras de trabajar;</p>

    <ol>
      <li><p>Miembros del proyecto de documentaci&oacute;n escriben
          documentos para ser incluidos en la <em>Distribuci&oacute;n de
          Documentaci&oacute;n de FreeBSD</em>.</p></li>

      <li><p>Miembros del proyecto de documentaci&oacute;n discuten y
          trabajan la organizaci&oacute;n de la <em>Distribuci&oacute;n
          de Documentaci&oacute;n de FreeBSD</em>.</p></li>
    </ol>

    <table bgcolor="#ffffcc" border="1" cellpadding="4" width="100%">
      <tr>
	<td><h2 align="center"><a href="current.html">Proyectos
	      actuales</a></h2>
	  
          <p>Existen en estos momentos diferentes proyectos <em>en
            progreso</em> como parte del esfuerzo de documentaci&oacute;n.
            Por favor, mira en esta lista por si hay algo en lo que
            <b>t&uacute;</b> nos puedas ayudar.</p></td>
      </tr>
    </table>
    
    <h2><a href="who.html">Quienes somo, c&oacute;mo participar</a></h2>

    <p>Esta p&aacute;gina explica qui&eacute;n forma parte del Proyecto de
      Documentaci&oacute;n y como participar.</p>

    <h2><a href="doc-set.html">La distribuci&oacute;n de Documentaci&oacute;n de FreeBSD</a></h2>


    <h2><a href="sgml.html">SGML y el Proyecto de Documentaci&oacute;n</a></h2>

    <p>El Proyecto intenta usar SGML para la documentaci&oacute;n. Esta
      p&aacute;gina indica como se consigue, apuntando al lector algunas
      fuentes de informaci&oacute;n sobre SGML.</p>

    <h2><a href="submitting.html">Enviando Documentaci&oacute;n</a></h2>

    <p>Enviar documentaci&oacute;n es la mejor manera de entrar a formar
      parte del proyecto, y hacer que FreeBSD sea m&aacute;s sencillo de usar.
      Esta p&aacute;gina explica la mejor manera de enviar la
      documentaci&oacute;n para que est&eacute; visible lo antes posible.</p>

    <p>Traducciones de la documentaci&oacute;n de FreeBSD, p&aacute;ginas
      Web, Handbook, p&aacute;gina man y las FAQ.</p>

      &footer
  </body>
</html>
