<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Proyecto de Documentaci&oacute;n de FreeBSD: SGML">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>
<!-- $FreeBSD$ -->

<html>
    &header;

    <p>El proyecto de Documentaci&oacute;n intenta usar SGML como 
    m&eacute;todo estandar de representar la documentaci&oacute;n.</p>

    <p>SGML es el lenguaje <b>S</b>tandard <b>G</b>eneralised <b>M</b>arkup
      <b>L</b>.</p>

    <p>Brevemente (y disculpas para los puristas de SGML que puedan sentirse
      ofendidos), SGML es un lenguaje para escribir otros lenguajes.</p>

    <p>Probablemente ya has usado SGML sin saberlo. HTML, el leguaje en el
      que se escriben las p&aacute;ginas web, tiene una descripci&oacute;n 
      formal. Esa descripci&oacute;n est&aacute; escrita en SGML. Cuando
      escribes en HTML <b>no</b> est&aacute;s escribiendo SGML, pero s&iacute;
      est&aacute;s usando un lenguaje definido por SGML.</p>

    <p>Existen muchos, muchos lenguajes "markup" que est&aacute;n definidos
      usando SGML. HTML es uno de ellos. Otro es el llamado "LinuxDoc". Como
      puedes adivinar, fue creado por los grupos de usuarios de Linux para
      escribir su documentaci&oacute;n, y el Proyecto de Documentaci&oacute;n
      de FreeBSD lo adopt&oacute;.</p>

    <p>Otro lenguaje "markup" definido usando SGML es el llamado "DocBook".
      Este es un lenguaje dise&ntilde;ado espec&iacute;ficamente para escribir
      documentaci&oacute;n t&eacute;cnica.</p>

    <p>Por ejemplo, as&iacute; estar&iacute;a escrito un breve p&aacute;rrafo
      en HTML (no te preocupes del contenido, solo f&iacute;jate en los
      tags):</p>

    <pre><![ CDATA [
    <p>The system's passwords are stored in <tt>/etc/passwd</tt>. To edit
      this file you should use <b><tt>vipw</tt></b>. However, if you just
      want to add a new user you can use <b><tt>adduser</tt></b>.</p>
]]></pre>
    
    <p>El mismo p&aacute;rrafo usando DocBook ser&iacute;a:</p>

    <pre><![ CDATA [
    <para>The system's passwords are stored in
      <filename>/etc/passwd</filename>. To edit this file you should use
      <command>vipw</command>. However, if you just want to add a new user
      you can use <command>adduser</command>.</para>
]]></pre>
    
    <p>Como puedes ver, DocBook es mucho m&aacute;s expresivo que HTML. En el
      ejemplo HTML el nombre del fichero se muestra con una fuente de tipo
      "typewriter". En el ejemplo de DocBook, el nombre de fichero est&aacute;
      marcado como que es un "filename", la representaci&oacute;n de un
      nombre de fichero no est&aacute; descrita.</p>

    <p>Hay grande ventajas en esta manera m&aacute;s expresiva de lenguaje:</p>

    <ul>
      <li><p>No es ambiguo o inconsistente.</p> <p>No pierdes tiempo
          pensando "Hmm, necesito mostrar un nombre de fichero, deber&iacute;a
          usar "tt", o "b", o "em"</p> <p>En lugar de eso, usas el tag 
          correcto para el trabajo correcto.</p>

        <p>El proceso de conversi&oacute;n de DocBook a otros formatos como
          HTML o Postscript asegura que todos ser&aacute;n vistos de la
          misma manera.</p>
      </li>

      <li><p>Dejar de pensar en como representar la documentaci&oacute;n, 
          y solo te concentras en el contenido.</p>

      <li><p>Como la documentaci&oacute;n no est&aacute; pensada para un 
          determinado formato de salida, la misma documentaci&oacute;n puede
          crearse en diferentes formatos - texto, HTML, Postscript, RTF,
           PDF, etc.</p></li>

      <li><p>La documentaci&oacute;n es m&aacute;s "inteligente", lo que
          permite hacer cosas m&aacute;s inteligentes con ella. Por ejemplo,
          es posible crear un &iacute;ndice autom&aacute;tico que liste cada
          comando mostrado en la documentaci&oacute;n.</p>.</li>
    </ul>

    <p>Si est&aacute;s familiarizado con ellos, es como las galer&iacute;as 
      de estilo de Microsoft Word, solo que infinitamente m&aacute;s
      potente.</p>

    <p>Por supuesto, esta potencia tiene un precio;</p>

    <ul>
      <li><p>Al existir un mayor n&uacute;mero de tags, hace que tardes
          m&aacute;s en aprenderlos y como usarlos efectivamente.</p>
	
        <p>La mejor manera de aprender es leer los fuentes de muchos 
          documentos de ejemplo, viendo como otros autores han escrito
          informaci&oacute;n similar.</p></li>

      <li><p>El proceso de conversi&oacute;n no es tan simple.</p></li>
    </ul>

    <p>Actualmente, el Proyecto est&aacute; usando LinuxDoc para el 
      Handbook y las FAQ. Esto est&aacute; cambiando, ya que se est&aacute;
      haciendo una migraci&oacute;n de la documentaci&oacute;n a DocBook.</p>
  
    <h2>Qu&eacute; pasa si no se LinuxDoc/DocBook? Todav&iacute;a puedo
      contribuir?</h2>
    
    <p>S&iacute;, por supuesto. Cualquier documentaci&oacute;n es mejor
      que no tener nada. Si tienes documentaci&oacute;n con la que
      contribuir y no est&aacute; en formato LinuxDoc o DocBook, no
      te preocupes.</p>

    <p><a href="submitting.html">Env&iacute;a</a> la documentaci&oacute;n 
      de la manera habitual. Alguien del proyecto recoger&aacute; los
      documentos enviados y los convertir&aacute; por t&iacute;. Con un 
      poco de suerte, te ser&aacute; devuelta ya marcada en DocBook. As&iacute;
      puedes comparar el documento original con el que has recibido y 
      aprender a hacerlo t&uacute; mismo.</p>

    <p>Obviamente, esto retrasa el que la documentaci&oacute;n est&eacute;
      online, pero no te preocupes.</p>

    <h2>M&aacute; informaci&oacute;n sobre SGML y DocBook?</h2>

    <p>Primero deber&iacute;s leer el <a
      href="&base;/tutorials/docproj-primer/"><b>Documentation Project
      Primer</b></a>. Es una extensa explicaci&oacute;n de todo lo que 
      necesitas saber para poder trabajar con la documentaci&oacute;n de
      FreeBSD.</p>

    <p>Es un documento largo, dividido en m&uacute;ltiples ficheros
    diferentes de peque&ntilde;o tama&ntilde;o. Tambi&eacute;n puedes
    verlo en formato de <a
    href="&base;/tutorials/docproj-primer/book.html"><b>un s&oacute;lo
    fichero</b></a>.</p>

    <dl>
      <dt><a
	  href="http://www.oasis-open.org/cover/sgml-xml.html"><b>http://www.oasis-open.org/cover/sgml-xml.html</b></a></dt>

      <dd><p>El web de SGML/XML. Incluye m&aacute;s recursos sobre SGML.</p></dd>

      <dt><a
	  href="http://www-tei.uic.edu/orgs/tei/sgml/teip3sg/index.html"><b>http://www-tei.uic.edu/orgs/tei/sgml/teip3sg/index.html</b></a></dt>

      <dd><p>The "Gentle Introduction to SGML". De recomendada lectura para
      cualquiera que desee tener conocimientos avanzados de SGML.</p></dd>
      
      <dt><a
	  href="http://www.ora.com/davenport/"><b>http://www.ora.com/davenport/</b></a></dt>
      <dd><p>El DTD DocBook es mantenido por OASIS. 
        Estas p&aacute;ginas est&aacute;n pensadas para usuarios que
        se sienten de manera confortable con SGML y quieren aprender
        DocBook.</p>
	<p>La Documentaci&oacute;n DocBook est&aacute; disponible en formato PDF
	en <a href="http://www.freebsd.org/~wosch/docbook/">http://www.freebsd.org/~wosch/docbook/</a></p></dd>

      <dt><a
	  href="http://fallout.campusview.indiana.edu/~jfieber/docbook/"><b>http://fallout.campusview.indiana.edu/~jfieber/docbook/</b></a></dt>

      <dd><p>La p&aacute;gina de John Fieber contiene links a otros recursos
          de DocBook y documentos de ejemplo. Tambi&eacute; incluye una 
          gu&iacute;a de marcas para FreeBSD.</dd>

      <dt><a
	  href="http://www.nothing-going-on.demon.co.uk/FreeBSD/"><b>http://www.nothing-going-on.demon.co.uk/FreeBSD/</b></a></dt>

      <dd><p>La p&aacute;gina de Nik Clayton contiene links a 
          documentaci&oacute;n escrita y despu&eacute;s convertida a HTML.
          Los ficheros DocBook originales est&aacute;n disponibles, dando
          una idea muy razonable de como usar los diferentes elementos
          de DocBook.</p></dd>

      <dt><a
          href="http://www.freebsd.org/~wosch/papers/webbuild.html"><b>
          http://www.freebsd.org/~wosch/papers/webbuild.html</b></a></dt> 

      <dd><p>
      Este documento describe como crear y actualizar las p&aacute;ginas Web
      de FreeBSD  a mano desde el CVS.
      </p></dd>
    </dl>
    
      
      <p></p><a href="docproj.html">FreeBSD Documentation Project Home</a>
&footer;
  </body>
</html>
