<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/es/docproj/sgml.sgml,v 1.12 2006/08/19 21:22:31 hrs Exp $">
<!ENTITY title "Proyecto de Documentaci&oacute;n de FreeBSD: SGML">
<!ENTITY % navinclude.docs "INCLUDE">
]>

<!-- The FreeBSD Spanish Documentation Project
     Original Revision: r1.27			-->

<html>
    &header;

    <p>El proyecto de Documentaci&oacute;n usa SGML como
      m&eacute;todo est&aacute;ndar de representar la documentaci&oacute;n.</p>

    <p>SGML es el lenguaje <b>S</b>tandard <b>G</b>eneralised <b>M</b>arkup
      <b>L</b>anguage.</p>

    <p>Brevemente (y disculpas para los puristas de SGML que puedan sentirse
      ofendidos), SGML es un lenguaje para escribir otros lenguajes.</p>

    <p>Probablemente ya us&oacute; SGML sin saberlo.  HTML, el leguaje en el
      que se escriben las p&aacute;ginas web, tiene una descripci&oacute;n
      formal.  Esta descripci&oacute;n est&aacute; escrita en SGML.  Cuando
      escribe en HTML <b>no</b> est&aacute; escribiendo SGML, pero s&iacute;
      est&aacute; usando un lenguaje definido por SGML.</p>

    <p>Existen muchos, muchos lenguajes "markup" que est&aacute;n definidos
      usando SGML.  HTML es uno de ellos.  Otro es el llamado "DocBook".
      &Eacute;ste es un lenguaje dise&ntilde;ado espec&iacute;ficamente para
      escribir documentaci&oacute;n t&eacute;cnica y tiene muchos "tags"
      (las se&ntilde;as de la forma <tt>&lt;tag&nbsp;contenido&gt;</tt>)
      para describir documentaci&oacute;n t&eacute;cnica para un
      formaci&oacute;n siguiente.  FreeBSD lo adopt&oacute; y definid&oacute;
      nuevos elemento para hacerlo m&aacute;s preciso.</p>

    <p>Por ejemplo, as&iacute; estar&iacute;a escrito un breve p&aacute;rrafo
      en HTML (no se preocupe del contenido, solo fijele en los
      tags):</p>

    <pre><![ CDATA [
    <p>The system's passwords are stored in <tt>/etc/passwd</tt>. To edit
      this file you should use <b><tt>vipw</tt></b>. However, if you just
      want to add a new user you can use <b><tt>adduser</tt></b>.</p>
]]></pre>

    <p>El mismo p&aacute;rrafo usando DocBook ser&iacute;a:</p>

    <pre><![ CDATA [
    <para>The system's passwords are stored in
      <filename>/etc/passwd</filename>. To edit this file you should use
      <command>vipw</command>. However, if you just want to add a new user
      you can use <command>adduser</command>.</para>
]]></pre>

    <p>Como puede ver, DocBook es mucho m&aacute;s expresivo que HTML.  En el
      ejemplo HTML el nombre del fichero se muestra con una fuente de tipo
      "typewriter".  En el ejemplo de DocBook, el nombre de fichero est&aacute;
      marcado como que es un "filename", la representaci&oacute;n de un
      nombre de fichero no est&aacute; descrita.</p>

    <p>Hay grandes ventajas en esta manera m&aacute;s expresiva de
      lenguaje:</p>

    <ul>
      <li>
	<p>No es ambiguo o inconsistente.</p> <p>No pierde tiempo
	  pensando "&iquest;Hmm, necesito mostrar un nombre de fichero,
	  deber&iacute;a usar "tt", o "b", o "em"?</p>

	<p>En lugar de eso, use el tag correcto para el trabajo correcto.</p>

	<p>El proceso de conversi&oacute;n de DocBook a otros formatos como
	  HTML o Postscript asegura que todos ser&aacute;n vistos de la
	  misma manera.</p>
      </li>

      <li>
	<p>Dejar de pensar en como representar la documentaci&oacute;n,
	  y solamente se concentra en el contenido.</p>

      <li>
	<p>Como la documentaci&oacute;n no est&aacute; pensada para un
	  determinado formato de salida, la misma documentaci&oacute;n puede
	  crearse en diferentes formatos - texto, HTML, Postscript, RTF,
	  PDF, etc.</p></li>

      <li>
	<p>La documentaci&oacute;n es m&aacute;s "inteligente", lo que
	  permite hacer cosas m&aacute;s inteligentes con ella.  Por ejemplo,
	  es posible crear un &iacute;ndice autom&aacute;tico que liste cada
	  comando mostrado en la documentaci&oacute;n.</p>.</li>
    </ul>

    <p>Si est&aacute familiarizado con ellos, es como las galer&iacute;as
      de estilo de Microsoft Word, s&oacute;lo que infinitamente m&aacute;s
      potente.</p>

    <p>Por supuesto, esta potencia tiene un precio:</p>

    <ul>
      <li><p>Al existir un mayor n&uacute;mero de tags, hace que tarde
	  m&aacute;s en aprenderlos y como usarlos efectivamente.</p>

	<p>La mejor manera de aprender es leer los fuentes de muchos
	  documentos de ejemplo, viendo como otros autores escribieron
	  informaci&oacute;n similar.</p></li>

      <li><p>El proceso de conversi&oacute;n no es tan simple.</p></li>
    </ul>

    <h2>&iquest;Qu&eacute; pasa si no conoce DocBook?  &iquest;Todav&iacute;a
      puede contribuir?</h2>

    <p>S&iacute;, por supuesto.  Cualquier documentaci&oacute;n es mejor
      que no tener nada.  Si tiene documentaci&oacute;n con la que
      contribuir y no est&aacute; en formato DocBook, no se preocupe.</p>

    <p><a href="submitting.html">Envie</a> la documentaci&oacute;n
      de la manera habitual.  Alguien del proyecto recoger&aacute; los
      documentos enviados y los convertir&aacute; para usted.  Con un
      poco de suerte, le ser&aacute; devuelta ya marcada en DocBook.
      As&iacute; puede comparar el documento original con el que ha
      recibido y aprender a hacerlo si mismo.</p>

    <p>Obviamente, esto retrasa el que la documentaci&oacute;n est&eacute;
      online porque su documento se tiene que convertir a marcado.  Esto
      puede quitar unas horas o unos d&iacute;as pero &eacute;l estar&aacute;
      integrado.</p>

    <h2>&iquest; Necesita m&aacute; informaci&oacute;n sobre SGML y
      DocBook?</h2>

    <p>Primero deber&iacute; leer el <a
      href="&base;/../doc/en_US.ISO8859-1/books/fdp-primer/index.html">
      <b>Documentation Project Primer</b></a>.  Es una extensa
      explicaci&oacute;n de todo lo que necesita saber para poder trabajar
      con la documentaci&oacute;n de FreeBSD.  Es un documento largo,
      dividido en m&uacute;ltiples p&aacute;ginas diferentes de peque&ntilde;o
      tama&ntilde;o.  Tambi&eacute;n puede verlo en formato de <a
	href="&base;/../doc/en_US.ISO8859-1/books/fdp-primer/book.html"><b>un sola p&aacute;gina</b></a>.</p>

    <dl>
      <dt><a
	  href="http://www.oasis-open.org/cover/sgml-xml.html"><b>http://www.oasis-open.org/cover/sgml-xml.html</b></a></dt>

      <dd><p>El web de SGML/XML.  Incluye m&aacute;s recursos sobre SGML.</p></dd>

      <dt><a
	  href="http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html"><b>http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html</b></a></dt>

      <dd><p>El "Gentle Introduction to SGML".  De recomendada lectura para
	cualquiera que desee tener conocimientos avanzados de SGML.</p></dd>

      <dt><a
	  href="http://www.oasis-open.org/docbook/"><b>http://www.oasis-open.org/docbook/</b></a></dt>

      <dd><p>El DTD DocBook es mantenido por OASIS.  Estas p&aacute;ginas
	est&aacute;n pensadas para usuarios que se sienten de manera
	confortable con SGML y quieren aprender DocBook.</p>
      </dd>
    </dl>

    <p></p><a href="docproj.html">Inicio del Proyecto de Documentaci&oacute;n de FreeBSD</a>

  &footer;
  </body>
</html>
