<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Proyecto de Documentaci&oacute;n de FreeBSD: Enviando Documentaci&oacute;n">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>
<!-- $FreeBSD$ -->

<html>
    &header;

    <h2>He escrito algunos documentos, como los env&iacute;o?</h2>

    <p>Ante todo, gracias por ocupar tu tiempo en hacerlo.</p>

    <p>Tendr&iacute;as que poner los documentos disponibles para ser revisados
      . Si puedes ponlos en un espacio FTP o Web. Si no tienes espacio
      propio, env&iacute;alos a <a
      href="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/incoming/">ftp://ftp.FreeBSD.ORG/pub/FreeBSD/incoming/</a>, y usa <b>send-pr</b> para comunicar a los 
      "committers" que est&aacute; disponible.</p>

    <p>A continuaci&oacute;n env&iacute;a un mensaje a la lista de 
      distribuci&oacute;n freebsd-doc, con una breve descripci&oacute;n
      y su localizaci&oacute;n. Pide opiniones.</p>
    
    <p>Tambi&eacute;n deber&iacute;as enviar una copia del mensaje a otras
      listas relacionadas. Por ejemplo, algo relativo al uso de CVSup para
      mantener actualizado el c&oacute;digo fuente, tambi&eacute;n ser&iacute;a
      de inter&eacute;s para los subscriptores de las listas
      <tt>FreeBSD-current</tt> y <tt>FreeBSD-stable</tt>.</p>
      
    <p>Una vez la gente haya visto tu documento y hayas podido incorporar 
      las posibles sugerencias que te hayan hecho, est&aacute;s preparado
      para enviarlo.</p>
  
    <p>Para hacerlo, compacta el/los documentos en un fichero tar. Si tu
     documentaci&oacute;n consta de 3 ficheros, <tt/uno/, <tt/dos/ y <tt/tres/,
     y quieres compactarlos en el fichero <tt/doc.tar/, haz</p>

    <pre>
    % <b>tar cf doc.tar one two three</b>
    </pre>

    <p>Una vez hecho, comprime el fichero tar,</p>

    <pre>
    % <b>gzip -9 doc.tar</b>
    </pre>

    <p>creando el fichero <tt>doc.tar.gz</tt>.</p>

    <p>A continuaci&oacute;n env&iacute;a el fichero <tt/doc.tar.gz/ (
      obviamente, ponle un nombre m&aacute;s indicativo del contenido pero
      siempre manteniendo la extensi&oacute;n <tt/tar.gz/) a 
      <tt/ftp.freebsd.org/, en el directorio
      <tt>/pub/FreeBSD/incoming/</tt>.</p>

    <p>Ahora tienes que comunicar al proyecto de documentaci&oacute;n la
      existencia del fichero. La manera correcta de hacerlo es usar un
      comando llamado <b>send-pr</b>, el cual deber&iacute;a estar instalado
      en tu m&aacute;quina.</p>

    <p>Tienes que hacer esto para que tu env&iacute;o pueda ser controlado.
      Cuando env&iacute;as un PR (Problem Report) se le asigna un 
      n&uacute;mero &uacute;nico. As&iacute; uno de los committers puede
      asignarse el PR, y ponerse de acuerdo contigo para hacer el env&iacute;o
      final.</p>

    <p>Make sure the "Category" is set to "docs" and that the "Class" is set
      to one of "change-request". And do not forget to include the name of the
      file that you uploaded, so that the committers can find it!</p>
    <p>Aseg&uacute;rate que el campo "Category" tiene como valor "docs" y que
      el campo "Class" est&aacute; en "change-request". No te olvides de
      incluir el nombre del fichero que has enviado, para que el committer
      pueda encontrarlo.</p>

    <p>Cuando sales del editor, ser&aacute; enviado un mensaje de PR al 
      lugar correcto. En un corto periodo de tiempo recibir&aacute;s un
      mensaje de notificaci&oacute;n indicandote el n&uacute;mero de PR
      asignado, pudiendo usar este n&uacute;mero para hacer el seguimiento
      del estado en que se encuentra.</p>

    <p>Alternativamente, puedes usar un interface web en <a
	href="http://www.freebsd.org/send-pr.html">http://www.freebsd.org/send-pr.html</a>.</p>
    
    <h2>He hecho algunos cambios a documentaci&oacute;n ya existente. Como 
      la env&iacute;o?</h2>

    <p>De nuevo, gracias por ocuparte de ello.</p>

    <p>Lo primero que tienes que hacer es crear un fichero especial llamado
      <i>diff</i>. Este fichero mostrar&aacute; &uacute;nica y exclusivamente
      las modificaciones realizadas sobre la documentaci&oacute;n original.</p>

    <p>Para hacer un "diff" tienes que;</p>

    <ol>
      <li><p>Hacer una copia del fichero que vas a modificar. Si est&aacute;s
          cambiando el fichero <tt/foo.sgml/, haz</p>

	<pre>
    % <b>cp foo.sgml foo.sgml.old</b>
	</pre></li>
      
      <li><p>Entonces, haz los cambios en el fichero foo.sgml</p>

	<pre>
    % <b>vi foo.sgml</b>
    ... tap tap tap ...

    ... testea los cambios, leelos y revisalos...
	</pre></li>

      <li><p>Haz el diff. El comando para hacerlo es</p>

	<pre>
    % <b>diff -c foo.sgml.old foo.sgml > foo.diff</b>
	</pre>

        <p>Este comando buscar&aacute; las diferencias entre los dis ficheros
        escribiendolas en el fichero <tt/foo.diff/.</p></li>
    </ol>
	
    <p>Ya puedes enviar el fichero <tt/foo.diff/ al proyecto.</p>

    <p>Tambi&eacute;n puedes enviar el fichero <tt/foo.diff/ a <a
      href="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/incoming/">ftp://ftp.FreeBSD.ORG
/pub/FreeBSD/incoming/</a> o, si es muy pque&ntilde;o, incluir el diff
      directamente en el PR, en la secci&oacute;n "Fix:"</p>

    <p>De cualquier manera, usar&aacute;s el comando <b>send-pr</b> para
      hacer saber a los "committers" que se han producido modificaciones.
      Aseg&uacute;rate que el campo "Category" contiene "docs" y que el
      campo "Class" es "doc-bug" (si tu cambio modifica alg&uacute;n error
      ya existente) o "change-request" (si est&aacute;s a&ntilde;adiendo
      nueva informaci&oacute;n a una secci&oacute;n ya existente).</p>

      <p></p><a href="docproj.html">FreeBSD Documentation Project Home</a>
&footer
  </body>
</html>
