<!--
  The FreeBSD Spanish Documentation Project 
  $FreeBSD$
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN">
%freebsd;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//ES">
%mailing-lists;
<!ENTITY % es-mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Spanish Mailing List Entities//ES">
%es-mailing-lists;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//ES">
%translators;
]>

<article lang=es>
  <articleinfo>
    <title>Introducci&oacute;n al FDP-es</title>

    <author>
      <firstname>J. Vicente</firstname>
      <surname>Carrasco Vay&aacute;</surname>

      <affiliation>
	<address><email>carvay@FreeBSD.org</email></address>
      </affiliation>
    </author>

    <abstract>
      <para>Este documento ha sido escrito para que sirva de gu&iacute;a
	somera a quienes quieren colaborar con &os; traduciendo
	documentaci&oacute;n o alguna secci&oacute;n de la web de &os; al
	castellano.  &os; es un proyecto que crece diariamente gracias al
	trabajo voluntario de miles de personas de todo el mundo.  La
	traducci&oacute;n de documentaci&oacute;n y de la web supone una enorme
	ayuda para quienes se acercan a &os; y no saben ingl&eacute;s
	(o alguna de las lenguas a las que ya es&aacute; traducido todo o parte
	de dicho material).  Casi cualquier persona puede ayudar en alguna
	tarea.  Si quiere colaborar reciba nuestra m&aacute;s calurosa
	bienvenida y siga leyendo.</para>

      <para>Este documento no pretende ser exhaustivo.  Casi toda la
	informaci&oacute;n necesaria para trabajar en el FDP est&aacute;
	en el libro <ulink
	  url="http://www.es.freebsd.org/doc/en_US.ISO8859-1/books/fdp-primer/">fdp-primer</ulink>
	(que esperamos poder tener traducido alg&uacute;n dia) y en cuya
	secci&oacute;n de estilo est&aacute; basada gran parte de este
	texto.  Si quiere ampliar los conocimientos que aqu&iacute; se esbozan
	(y si va a trabajar con la documentaci&oacute;n de &os; seguramente
	querr&aacute; hacerlo) le rogamos que lo lea cuidadosamente.  Recuerde
	que cualquier duda que pudiera salirle al paso mientras trabaja en la
	documentaci&oacute;n de &os; puede enviarla a la &a.es.doc;</para>

      <para>Si tiene alguna sugerencia, cr&iacute;tica o duda relacionada con
	este art&iacute;culo no dude en escribir al autor.</para>
    </abstract>
  </articleinfo>

  <sect1>
    <title>El FDP-es</title>

    <para>El &os; Spanish Documentation Project (en adelante FDP-es) tiene
      las siguientes funciones:</para>

    <itemizedlist>
      <listitem>
	<para>Mantener al d&iacute;a la documentaci&oacute;n existente en
	  castellano e ir traduciendo m&aacute;s siempre que los recursos
	  lo permitan.</para>
      </listitem>

      <listitem>
	<para>Traducir y mantener la web <ulink
	    url="http://www.es.freebsd.org/es/">http://www.freebsd.org/es/</ulink>.</para>
      </listitem>

      <listitem>
	<para>Desarrollar documentos propios como &eacute;ste.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1>
    <title>Tareas pendientes</title>

    <para> Glosario: Confecci&oacute;n y Mantenimiento de un Glosario de
      t&eacute;rminos frecuentes en la Documentaci&oacute;n para
      ayuda y referencia del traductor.</para>

    <para> P&aacute;ginas man:  El Proyecto de Documentaci&oacute;n de
      &os; tambi&eacute;n se encarga de desarrollar, mantener y
      corregir las p&aacute;ginas <literal>man</literal> del sistema pero
      debido a la escasez de voluntarios es una tarea que (siendo muy
      optimistas) preferimos pensar que podremos acometer a medio o
      largo plazo.</para>

    <para><quote>Scripts</quote> <filename>accent2xml</filename> y
      <filename>xml2accent</filename>.  Existen dos <quote>scripts</quote>
      que traducen los caracteres que no existen en ingl&eacute;s a
      c&oacute;digo sgml; por ejemplo <literal><![ CDATA [&aacute;]]></literal>
      a <quote><literal>&aacute;</literal></quote>, <![ CDATA [&iquest;]]>
      a <quote><literal>&iquest;</literal></quote>, etc&eacute;tera.
      Ser&iacute;a muy &uacute;til disponer de sus hom&oacute;logos xml
      para facilitar el trabajo de aquellas personas que traducen
      secciones de la web y (cosa poco sorprendente) no conozcan de
      memoria todos los secretos de xml.</para>
  </sect1>

  <sect1>
    <title>C&oacute;mo formar parte del FPD-es</title>

    <para>Casi cualquier persona puede formar parte del FDP-es.  Igual que
      sucede en el FDP no hay cuota mensual que haya que pagar ni una cantidad
      mensual o anual de material que haya que traducir de forma obligatoria.
      Basta con suscribirse a la &a.es.doc;.  Puede aportar sus conocimientos
      de ingl&eacute;s para ayudar con las dudas de quienes est&aacute;n
      traduciendo o quiz&aacute;s pueda dedicar un poco de su tiempo a
      traducir.</para>

    <sect2>
      <title>Asignaci&oacute;n de trabajos</title>

      <para>Al depender del esfuerzo voluntario es l&oacute;gico que cada cual
	pueda elegir qu&eacute; parte de la web o de la documentaci&oacute;n
	desea traducir.  Dentro de poco esperamos disponer de una
	p&aacute;gina web p&uacute;blica en la que poder consultar qu&eacute;
	textos est&aacute;n asignados y desde cuando.  De momento el
	procedimiento es el siguiente:</para>

      <itemizedlist>
	<listitem>
	  <para>la persona interesada en traducir elige un texto que desea
	    traducir y dos alternativas por si su primera elecci&oacute;n ya
	    est&aacute; asignada</para>
	</listitem>

	<listitem>
	  <para>el coordinador de traducciones le asigna el texto</para>
	</listitem>

	<listitem>
	  <para>el texto traducido es revisado e inclu&iacute;do en el
	    repositorio del FDP-es primero y en el del FDP
	    despu&eacute;s.</para>
        </listitem>
      </itemizedlist>
    </sect2>

    <sect2>
      <title>Si puede dedicar un poco de tiempo</title>

      <para>Puede traducir una sección de la web, un cap&iacute;tulo del
	handbook o un art&iacute;culo y entregarlo en formato ASCII (texto
	plano).  Tenga en cuenta que alguien tendr&aacute; que darle formato
	(DocBook o xml en el caso de la web).   Ser&aacute; de
        grand&iacute;sima ayuda si entrega su trabajo con los acentos,
        e&ntilde;es y dem&aacute;s signos caracter&iacute;sticos de nuestro
        idioma corregidos al formato adecuado.  Consulte la tabla que
        encontrar&aacute; en <ulink
	  url="http://www.theorem.ca/~mvcorks/code/charsets/latin1.html">http://www.theorem.ca/~mvcorks/code/charsets/latin1.html</ulink>
	o utilice el <quote>script</quote> perl <filename>
	accent2sgml.pl</filename> ubicado en <filename>
	doc/share/examples/vim/</filename>.  La parte m&aacute;s
	dif&iacute;cil del trabajo es sin
	duda alguna la traducci&oacute;n pero si pudiera avanzar trabajo
	adaptando en lo posible la sintaxis del texto a sgml o xml (o
	maquet&aacute;ndolo usted, pru&eacute;belo: no es dif&iacute;cil)
	aligerar&aacute; notablemente la carga de trabajo de unos cuantos (y
	mortales) voluntarios y voluntarias.  Tenga en cuenta que no sobra
	precisamente el personal para estas tareas y enfrentarse a
	convertir un texto ASCII de 5.000 l&iacute;neas a DocBook puede
	hacer flaquear al voluntario m&aacute;s comprometido.</para>
    </sect2>

    <sect2>
      <title>Con un poco m&aacute;s de tiempo</title>

      <para>La forma ideal de entrega de trabajos al FDP-es es enviarlos
	listos para incluir en el &aacute;rbol cvs de &os;.  Si tiene un
	especial inter&eacute;s en un texto en concreto puede encargarse
	de su mantenimiento (es lo que llamamos <quote>apadrinar</quote>
	ese texto).  En poco tiempo se convertir&aacute; en su mejor
	conocedor y no le resultar&aacute; dif&iacute;cil ir a&ntilde;adiendo
	los cambios a medida que se vayan produciendo en el original.
	De este modo al menos una fracci&oacute;n de la documentaci&oacute;n
	tendr&aacute; m&aacute;s posibilidades de estar
	<emphasis>al dia</emphasis>;-)</para>
    </sect2>

    <sect2>
      <title>Colaboraci&oacute;n espor&aacute;dica</title>

      <para>En la &a.es.doc; hay personas que colaboran resolviendo dudas
	que surgen a los traductores.  Si por el motivo que fuera no
	quiere o no puede traducir textos no deber&iacute;a subestimar
	la importancia de la ayuda que puede prestarse de este modo.
	Gracias a estas personas los traductores encuentran m&aacute;s
	argumentos a favor o en contra de traducir ciertos t&eacute;rminos,
	con lo que la documentaci&oacute;n resulta m&aacute;s &uacute;til;
	y nuestro trabajo consiste en hacer algo &uacute;til.</para>

    </sect2>

    <sect2>
      <title>&iquest;Todo el mundo puede traducir?</title>

      <para>En principio s&iacute;, pero no necesariamente.  Le recomendamos
	que si quiere traducir documentaci&oacute;n se familiarice con otros
	textos ya traducidos y comience por colaborar con las dudas de los
	traductores en la &a.es.doc;.</para>

      <para>La documentaci&oacute;n de &os; goza de una merecida fama de
	calidad, lo que hace que el trabajo de un proyecto de traducci&oacute;n
	como el nuestro implique una gran responsabilidad.  Es imposible
	mantener una fidelidad absoluta al original, pero dentro de lo posible
	lo intentamos.  Al tratarse de textos t&eacute;cnicos hay que tener
	muy presente al traducirlos que sin duda alguna van a ser utilizados
	como gu&iacute;a.  Se suele <emphasis>exigir</emphasis> a los
	reci&eacute;n llegados a &os; que lean la documentaci&oacute;n
	relacionada con sus dudas <emphasis>antes</emphasis> de preguntar
	dudas, as&iacute; que, al menos en teor&iacute;a, lo que usted
	traduzca tendr&aacute; &aacute;vidos lectores.  Tenga esto muy
	presente al traducir: mejor preguntar una duda de m&aacute;s en
	la &a.es.doc; que incluir informaci&oacute;n err&oacute;nea en un
	texto.</para>

      <para>Se estar&aacute; preguntando &iquest;cu&aacute;l es el perfil
	necesario para traducir? La verdad es que no hay un acuerdo sobre
	esto.  Es obvio que necesita comprender el ingl&eacute;s
	t&eacute;cnico (americano) en el que est&aacute; escrita la
	documentaci&oacute;n de &os;,
	<footnote>
	  <para>Tambi&eacute;n puede traducir desde alguno de los idiomas en
	    los que hay documentaci&oacute;n de &os;.  Puede echar un
	    vistazo a los textos traducidos a distintas lenguas en <ulink
	      url="http://www.es.FreeBSD.org/doc/">http://www.es.FreeBSD.org/doc/</ulink>.</para>
	</footnote>
        y por supuesto s&oacute;lidos conocimientos de castellano.  Dicho
	de otro modo, no es imprescindible <emphasis>hablar</emphasis>
	ingl&eacute;s, basta con comprenderlo lo mejor posible, pero
	es imprescindible la expresi&oacute;n escrita en castellano.
	La calidad de una traducci&oacute;n es algo totalmente subjetivo,
	pero suele haber acuerdo entre los miembros de la lista entre lo
	que es asumible
	<footnote>
	  <para> es decir, lo que podemos subir al cvs para que cualquiera
	    pueda verlo repartido por los sitios web de &os; del mundo
	    entero</para>
	</footnote>
	y lo que no lo es.  El trabajo de arreglar una mala traducci&oacute;n
	puede ser igual de largo que traducir desde cero un texto y es
	varios &oacute;rdenes de magnitud m&aacute;s penoso.  Encontrar
	un buen traductor de textos t&eacute;cnicos es tanto o m&aacute;s
	dif&iacute;cil que encontrar un buen programador, como sabe
	cualquiera que haya abierto m&aacute;s de una docena de
	libros t&eacute;cnicos traducidos a nuestro idioma
	<footnote>
	  <para>Si es su caso, ya sabe a ciencia cierta que tener una o
	    m&aacute;s carreras, t&eacute;cnicas o no, no evita que alguien
	    sea capaz de perpetrar <quote>traducciones</quote> abominables y
	    adem&aacute;s cobrar por ello.  Nosotros no pagamos, pero somos
	    mucho m&aacute;s estrictos.</para>
	</footnote>
	Cuando env&iacute;e un texto traducido para su revisi&oacute;n es
	posible que, aunque ponga mucho cuidado para evitarlo, aparezcan
	errores en el c&oacute;digo SGML o en el propio texto.  El trabajo
	de revisi&oacute;n consiste precisamente en eso as&iacute; que no se
	preocupe, dentro de la ayuda espor&aacute;dica que algunas personas
	ofrecen al FDP-es est&aacute; la de revisar textos de otros.  Un
	voluntario depurar&aacute; el texto en caso de que haga falta y lo
	dejar&aacute; listo para subir al cvs
	<footnote>
	  <para>es posible que el revisor le devuelva el texto si las
	    modificaciones que hay que hacer son muchas y usted mismo puede
	    hacerlas)</para>
	</footnote>.</para>
    </sect2>
  </sect1>

  <sect1>
    <title>Gu&iacute;a de estilo</title>

    <para>Esta secci&oacute;n est&aacute;n basada en la secci&oacute;n
      <quote>writing style</quote> del libro <quote>fdp-primer</quote> que
      puede consultarse en (<ulink
	url="http://www.es.FreeBSD.org/doc/en_US.ISO8859-1/books/fdp-primer/writing-style.html"></ulink>).</para>

    <para>Es necesario intentar mantener la consistencia entre la multitud de
      autores que trabajan en la Documentaci&oacute;n de &os;, raz&oacute;n por
      la cual se han creado unas l&iacute;neas generales.  A esta
      b&uacute;squeda de la consistencia se opone tambi&eacute;n la variedad de
      or&iacute;genes de los traductores de la Documentaci&oacute;n, por lo
      que se listan aqu&iacute; unas cuantas normas que pueden ser de ayuda.
      Dado que la Documentaci&oacute;n que va a traducir ya ha pasado por
      m&aacute;s de una mano experta puede usarla como plantilla para su
      traducci&oacute;n.</para>

    <itemizedlist>
      <title>Idioma</title>
      <listitem>
	<para>El idioma oficial del FDP-es es el castellano (o espa&ntilde;ol
	  de Espa&ntilde;a), es_ES; la decisi&oacute;n de tener lengua oficial
	  no es una idea exclusiva nuestra puesto que en el el Proyecto de
	  Documentación de &os; el idioma oficial es el ingl&eacute;s de los
	  Estados Unidos de Am&eacute;rica (en_US).  Se intenta evitar el uso
	  de palabras <quote>agresivas</quote> con otros castellanoparlantes
	  como <literal>ordenador</literal> (computador, computadora, sistema,
	  m&aacute;quina o incluso host) pero al iniciar los trabajos
	  necesitaban una norma y l&oacute;gicamente usaron la que
	  la que m&aacute;s cerca ten&iacute;an.</para>
      </listitem>

      <listitem>
	<para>Evite frases redundantes</para>

<!--    <itemizedlist> -->
	<para>Intente evitar usar frases redundantes.  Por ejemplo
	  <quote>el comando</quote>, <quote>el fichero</quote> y
	  <quote>man comando</quote> probablemente son redundantes.</para>

	<para>He aqu&iacute; dos ejemplos en el caso de los comandos. El
	  segundo ejemplo mostrado es el recomendable.</para>
      </listitem>

      <listitem>
	<informalexample>
	  <para>Utilice el comando <command>cvsup</command> para actualizar
	    sus fuentes</para>
	</informalexample>
      </listitem>
      
      <listitem>
	<informalexample>
	  <para>Utilice <command>cvsup</command> para actualizar sus
	    fuentes</para>
	</informalexample>
      </listitem>
    </itemizedlist>

    <para>Veamos dos ejemplos para nombres de ficheros.  Recomendamos
      el uso del segundo ejemplo.</para>
	
    <informalexample>
      <para>&hellip; en el fichero llamado
	<filename>/etc/rc.local</filename>&hellip;</para>
    </informalexample>

    <informalexample>
      <para>&hellip; en
	<filename>/etc/rc.local</filename>&hellip;</para>
    </informalexample>

    <para>Veamos un ejemplo sobre p&aacute;ginas man.  Recomendamos el
      uso del segundo caso, que usa <sgmltag>citerefentry</sgmltag>.</para>

    <informalexample>
      <para>Para m&aacute;s informaci&oacute;n consulte
	<command>man csh</command>.</para>
    </informalexample>
	
    <informalexample>
      <para>Consulte &man.csh.1;</para>
    </informalexample>

    <variablelist>
      <varlistentry>
	<term>Dos espacios al final de cada frase</term>

	<listitem>
	  <para>Deje siempre dos espacios al final de cada frase.
	    El texto ser&aacute; m&aacute;s legible y se facilita el
	    uso de herramientas como <application>Emacs</application>.</para>

	  <para>Puede pensarse que una may&uacute;scula tras un punto
	    indica nueva frase pero no siempre es as&iacute;, sobre
	    todo si se trata del nombre de algunas personas.
	    <quote>Jordan K. Hubbard</quote> es un buen ejemplo de ello.
	    Tiene una <literal>H</literal> may&uacute;scula tras un punto
	    y un espacio y es evidente que no es una nueva frase.</para>
	</listitem>
      </varlistentry>
    </variablelist>
  </sect1>

  <sect1 id="sintaxis">
    <title>Gu&iacute;a de sintaxis</title>

    <para>Por favor, siga &eacute;stas sencillas reglas para facilitar el
      trabajo de toda la gente que mantiene el c&oacute;digo fuente de la
      documentaci&oacute;n.</para>

    <sect2>
      <title>Min&uacute;sculas</title>

      <para>Las etiquetas van siempre en min&uacute;sculas:
	<literal>&lt;para&gt;</literal>, <emphasis>no</emphasis>
	<literal>&lt;PARA&gt;</literal>.</para>

      <para>El texto SGML normalmente se escribe en may&uacute;sculas:
	<literal>&lt!ENTITY&hellip;&gt;</literal> y
	<literal>&lt;!DOCTYPE&hellip;&gt;</literal>,
	<emphasis>no</emphasis>
	<literal>&lt;!entity&hellip;&gt;</literal> o
	<literal>&lt;!doctype&hellip;&gt;</literal>.</para>
    </sect2>

    <sect2>
      <title>Sangrado</title>

      <para>Cada fichero comienza con un sangrado nulo, es decir,
	en la columna 0, <emphasis>sin tener en cuenta</emphasis>
	el nivel de sangrado del fichero que pueda contenerlo.</para>

      <para>La apertura de etiquetas incrementa el nivel de sangrado en
	2 espacios.  Reemplace los bloques de 8 espacios al inicio de una
	l&iacute;nea con una tabulaci&oacute;n.  No use espacios antes de
	una tabulaci&oacute;n y no a&ntilde;ada espacios al final de una
	l&iacute;nea.  El contenido que est&eacute; entre elementos
	debe sangrarse en dos espacios si el contenido ocupa m&aacute;s
	de una l&iacute;nea.</para>

      <para>Por ejemplo, el c&oacute;digo fuente de esta secci&oacute;n
	es algo parecido a esto:</para>

      <programlisting><![ CDATA [+--- Ésta es la columna 0
V

  <sect1>
    <title>...</title>

    <sect2>
      <title>Sangrado</title>

      <para>Cada fichero comienza con un sangrado nulo, es decir,
	en la columna 0, <emphasis>sin tener en cuenta</emphasis>
	el nivel de sangrado del fichero que pueda contenerlo.</para>

      ...
    </sect2>
  </sect1>
</chapter>]]></programlisting>

      <para>Si usa <application>Emacs</application> o
	<application>XEmacs</application> para editar ficheros
	que forman parte de la Documentaci&oacute;n se cargar&aacute;
	autom&aacute;ticamente el <literal>sgml-mode</literal> y las
	variables locales que <application>Emacs</application>
	encontrar&aacute; al principio de cada fichero podr&aacute;n
	utilizarse.</para>

      <para>Si usa <application>Vim</application> puede serle muy
	&uacute;til incluir lo siguiente en la configuraci&oacute;n
	de su editor:</para>

      <programlisting>augroup sgmledit
  autocmd FileType sgml set formatoptions=cq2l " Opciones especiales de formato
  autocmd FileType sgml set textwidth=70       " Corta las lìneas a 70 espacios
  autocmd FileType sgml set shiftwidth=2       " Sangra automáticamente
  autocmd FileType sgml set softtabstop=2      " Tabulación = 2 espacios
  autocmd FileType sgml set tabstop=8          " Reemplaza 8 espacios con Tab
  autocmd FileType sgml set autoindent         " Sangrado automático
augroup END</programlisting>

    </sect2>

    <sect2>
      <title>Etiquetas</title>

      <sect3>
	<title>Espacios en las etiquetas</title>

	<para>Las etiquetas que comienzan en el mismo nivel de sangrado
	  que la etiqueta anterior deben separarse con una l&iacute;nea
	  en blanco, y las que no est&aacute;n al mismo nivel de sangrado
	  que la anterior <emphasis>no</emphasis>:</para>

	<informalexample>
	  <programlisting><![ CDATA [<article>
  <articleinfo>
    <title>NIS</title>

    <pubdate>Octubre 1999</pubdate>

    <abstract>
      <para>...
	...
	...</para>
    </abstract>
  </articleinfo>

  <sect1>
    <title>...</title>

    <para>...</para>
  </sect1>

  <sect1>
    <title>...</title>

    <para>...</para>
  </sect1>
</article>]]></programlisting>
	</informalexample>
      </sect3>
    </sect2>
  </sect1>

  <sect1>
    <title>Trato al lector o lectora</title>

    <para> Cuando hay que dirigirse al lector o lectora siempre usamos el
      usted, habitual en muchos pa&iacute;ses en cualquier &aacute;mbito y
      respetuoso en cualquiera de los dem&aacute;s.  Como puede verse en el
      t&iacute;tulo existe tambi&eacute;n el problema del g&eacute;nero
      de quien lee el texto; casi siempre hay una manera de evitar usarlo
      (buscando bien) pero puede alternarse el uso del g&eacute;nero.  Evitamos
      el uso de la forma lector/a, programador/a, etc&eacute;tera, que a costa
      de una pretendida correcci&oacute;n pol&iacute;tica convierte a los
      textos en algo bastante m&aacute;s dif&iacute;cil de leer.</para>
  </sect1>

  <sect1>
    <title>L&eacute;xico</title>

    <para> Es muy importante intentar evitar argot, giros, dichos o
      bromas exclusivos de un s&oacute;lo pa&iacute;s, regi&oacute;n,
      ciudad o grupo social.  La Documentaci&oacute;n ser&aacute;
      le&iacute;da por gentes muy diversas en cualquier lugar del mundo y
      puede ser muy frustrante que lo que uno quiere hacer est&eacute;
      documentado pero no lo podamos entender <quote>por no haber viajado
      suficiente</quote>.</para>
  </sect1>

  <sect1>
    <title>Ayuda</title>

    <sect2>
      <title>Lista doc@es.FreeBSD.org</title>

      <para>La &a.es.doc; es el lugar ideal para enviar:</para>

      <para>dudas de traducci&oacute;n</para>

      <para>ideas, sugerencias, cr&iacute;ticas sobre la
	documentaci&oacute;n (en castellano o relacionadas con
	la Documentaci&oacute;n en ingl&eacute;s)</para>

      <para>errores en la generaci&oacute;n de documentaci&oacute;n</para>
    </sect2>

    <sect2>
      <title>Diccionarios en Internet</title>

      <para>Existen muchos diccionarios en Internet y en bastantes de
	ellos podemos consultar t&eacute;rminos
	<emphasis>gratuitamente</emphasis>.  Las palabras m&aacute;s
	t&eacute;cnicas y muchas exclusivas de &os; no aparecer&aacute;n
	en ninguno de estos diccionarios y en pocos de los editados
	en papel, por lo que tendr&aacute; que recurrir a otros documentos
	ya traducidos o a la &a.es.doc;.</para>
    </sect2>
  </sect1>

  <sect1>
    <title>Env&iacute;o de traducciones</title>

    <orderedlist>
      <listitem>
	<para>Por correo electr&oacute;nico al coordinador, o bien</para>
      </listitem>
      <listitem>
	<para>si lo considera conveniente, enviarlo a la &a.es.doc; para
	  su revisi&oacute;n.</para>
      </listitem>
      <listitem>
	<para>&man.send-pr.1;</para>
      </listitem>
    </orderedlist>
  </sect1>

  <sect1 id="voluntarios-fdp-es">
    <title>Voluntarios del FDP-es</title>

    <para>Estos son los colaboradores habituales del FDP-es.  Si cree
      que su nombre debe (o no debe) aparecer en esta lista puede
      escribir al autor.</para>

    <para>(en orden alfab&eacute;tico por apellido):</para>

    <itemizedlist>
      <listitem>
	<para>&a.es.baz;</para>
      </listitem>

      <listitem>
	<para>&a.es.carvay;</para>
      </listitem>

      <listitem>
	<para>&a.es.cronopio;</para>
      </listitem>

      <listitem>
 	<para>&a.es.jcamou;</para>
      </listitem>

      <listitem>
	<para>&a.jesusr;</para>
      </listitem>

      <listitem>
	<para>&a.es.jrh;</para>
      </listitem>

      <listitem>
	<para>&a.es.quique;</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1>
    <title>Agradecimientos</title>

    <para>A la &a.es.doc; por su <emphasis>infinita</emphasis>
      paciencia durante las revisiones de este documento (y
      desde mucho antes) y a &a.jesusr; por lo mismo y
      adem&aacute;s por animarme.  Que tiene delito.</para>
  </sect1>
</article>
