freebsd/freebsd-doc/ja/man/man8/addgroup.8
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %Id: addgroup.8,v 1.1.2.2 1997/03/06 07:59:13 mpp Exp %
.\" jpman %Id: addgroup.8,v 1.3 1997/07/22 16:43:02 horikawa Stab %

.Dd Oct, 30, 1996
.Dt ADDGROUP 8
.Os FreeBSD 2.2
.Sh 名称
.Nm addgroup
.Nd グループ追加もしくはユーザをグループへ追加
.Sh 書式
.Nm 
.Op Fl g Ar gid 
.Ar group 
.Op Ar user Ns , Ns Ar user,...
.Sh 解説
.Nm 
コマンドは
.Xr group 5
データベースにグループを加えます。
オプションの
.Ar user
引数が与えられた場合、グループのメンバーリストにそのユーザが
加えられます。
.Ar user
引数は、コンマ (,) で区切られたユーザ名のリストです。
もし、
.Ar group
が既に存在した場合、
.Ar user
が
.Ar group 
に加えられます。
.Sh オプション
.Bl -tag -width Ds
.It Sy -g gid
グループ id が
.Ar gid
の新しいグループを、作ることが可能であるかそれより大きな id が
空いている場合は、作成されます。デフォルトの gid は 1000 です。
このオプションは新しいグループを作る時にだけ使えます。
.El
.Sh 使用例
.Pp
$ addgroup -g 5000 cracau
.Pp
グループ id 5000 以上の `cracau' というグループを作ります。
.Pp
$ addgroup foo blech,bar
.Pp
ユーザ `blech' と `bar' をグループ `foo' に加えます。
もし、グループ `foo' が無い場合は、新たに作ります。
.Sh 関連項目
.Xr group 5 ,
.Xr adduser 8 ,
.Xr rmgroup 8 ,
.Xr rmuser 8
.Sh 歴史
.Nm
コマンドは
.Fx 2.2 
から導入されました。
