freebsd/freebsd-doc/ja/man/man8/amd.8
.\"
.\" Copyright (c) 1989 Jan-Simon Pendry
.\" Copyright (c) 1989 Imperial College of Science, Technology & Medicine
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Jan-Simon Pendry at Imperial College, London.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)amd.8	5.10 (Berkeley) 4/19/94
.\" jpman %Id: amd.8,v 1.2 1997/04/15 00:24:08 mutoh Stab %
.\"
.\" %Id: amd.8,v 1.2.2.1 1997/03/06 07:59:18 mpp Exp %
.\"
.Dd "April 19, 1994"
.Dt AMD 8
.Os
.Sh 名称
.Nm amd
.Nd 自動マウントファイルシステム
.Sh 書式
.Nm amd
.Op Fl nprv
.Op Fl a Ar mount_point
.Op Fl c Ar duration
.Op Fl d Ar domain
.Bk -words
.Op Fl k Ar kernel-arch
.Ek
.Op Fl l Ar logfile
.Op Fl t Ar interval.interval
.Bk -words
.Op Fl w Ar interval
.Ek
.Op Fl x Ar log-option
.Op Fl y Ar YP-domain
.Bk -words
.Op Fl C Ar cluster-name
.Ek
.Op Fl D Ar option
.Oo
.Ar directory mapname
.Op Fl map-options
.Oc
.Ar ...
.Sh 解説
.Nm amd
は、ファイルシステムがアクセスされたときに自動的にそのファイルシステムを
マウントするデーモンです。マウントされたファイルシステムは、アクセスがな
ければ自動的にアンマウントされます。
.Pp
.Nm amd
は、自分自身をNFSサーバとして、指定された
.Ar directory
に結び付けます。
その指定ディレクトリ内でのファイルアクセスは
.Nm amd
によって処理されます。
.Nm amd
は、
.Ar mapname
で定義されたマップを使って、あるディレクトリ
にどのファイルシステムを割り当てるかを決定します。
一般に
.Ar mapname
は、ホスト名やファイルシステムの情報、
マウントオプションから構成されます。
.Sh オプション
.Bl -tag -width Ds
.It Fl a  Ar temporary-directory
実際にファイルシステムをマウントする位置を指定します。
デフォルトは
.Pa /a
です。
.It Fl c  Ar duration
ディレクトリが使われないときに、探索に使われた名前をキャッシュ
して保持する秒数を指定します。デフォルトは5分です。
.It Fl d  Ar domain
ローカルドメイン名を指定します。もしこのオプションが与
えられなければ、ドメイン名はホスト名から決定されます。
.It Fl k  Ar kernel-arch
カーネルアーキテクチャを指定します。これは単に ${karch} セレクタ
を指定するだけです。
.It Fl l  Ar logfile
マウントおよびアンマウントのイベントを記録するログファイル
を指定します。
もし、
.Ar logfile
が ``syslog'' という文字列なら、ログメッセージは
.Xr syslog 3
によってシステムログデーモンに送られます。
.It Fl n
ホスト名を正規化します。${rhost}で参照される名前は、使わ
れる前にホストデータベースに関連づけて正規化されます。
これは、エイリアスを `` 公式 (official)'' ホスト名に変換する効果があります。
.It Fl p
プロセスIDを表示します。
.Nm amd
のプロセス ID を標準出力に出力して、ファイルに保存することができます。
.It Fl r
存在するマウントをリスタートします。
.Nm amd
はマウントファイルテーブルをスキャンして、
現在マウントされているファイルシステムを判断します。
ファイルシステムが自動マウントされたものであれば、
.Nm amd
は、その情報を継承します。
.It Fl t  Ar interval.interval
NFS/RPC/UDPのリトライの間隔を、10分の1秒単位で指定します。
デフォルト値は0.8秒です。2番目の値は再送カウンタを変更します。
どちらか一方か、両方の値が設定されていなければ、
適当なデフォルト値が設定されます。
.It Fl v
バージョンを表示します。標準エラー出力に設定情報を表示します。
.It Fl w  Ar interval
キャッシュする時間を超えたファイルシステムのマウントを解除する時間を
秒単位で指定します。デフォルト値は2分です。
.It Fl y  Ar domain
NISマップをとってくる際に用いるNISドメインを指定します。
デフォルトはシステムのドメイン名です。このオプションは、NIS
を動かしていないときには無視されます。
.It Fl x  Ar options
実行時に何をログに記録するかを指定します。
.Ar options
には以下のものをカンマで区切って使用できます: 
fatal, error, user, warn, info, map, stats, all
.\" 次の文は原文に表記無し (Feb 1997 jpman J.Sakai)
.\" .Ar options
.\" の最初に``no''をつけたもの(たとえば``noinfo'')は、記録されません。
.It Fl D  Ar option
デバッグオプションの種類を選択することができます。
.Ar option
の頭に
.Ar no
をつけると、そのオプションの逆の影響を与えます。
オプションは並べて指定することができます。もっとも役に立つのは
.Ar all
です。
.El
.Pp
.Fl D
はデバッグのときにだけ使うものであるため、ここでは他のオプションに
ついては説明しません。サポートされているオプションは
.Fl v
オプションで表示されますが、詳細はソースコードに記述されています。
.\" 以下の使用例は FreeBSD の英語マニュアルには載ってない。
.\" 内容の正しさを完全には吟味できないので、ここではコメントアウトした。
.\"						(Feb 1997 jpman J.Sakai)
.\" .Pp
.\" .Ss 使用例
.\" .Pp
.\" .Pa /etc/netstart
.\" で以下の部分を記述します。
.\" テンプレートがすでに用意されています。
.\" .Pp
.\" .Bd -literal -offset indent
.\" amd=YES
.\" amd_dir=/am                     # AMD's mount directory
.\" amd_master=/etc/amd/master      # AMD 'master' map
.\" .Ed
.\" .Pp
.\" .Pa /etc/amd
.\" というディレクトリを作成します。
.\" .Pp
.\" .Pa /etc/amd/master
.\" ファイルを作成します。
.\" .Pa /etc/amd/master
.\" の内容:
.\" .Pp
.\" .Bd -literal -offset indent
.\" /home   /etc/amd/am-home -cache:=inc
.\" .Ed
.\" .Pp
.\" amdマップとして、am-homeを指定しています。
.\" .Pp
.\" .Pa /etc/amd/am-home
.\" を作成します。
.\" .Pa /etc/amd/am-home
.\" の内容:
.\" .Pp
.\" .Bd -literal -offset indent
.\" /default        opts:=rw,intr,soft,bg,grpid,timeo=30;\\
.\"                 type:=nfs;fs:=${autodir}/home/${key};rfs:=/home
.\" .Ed
.\" .Pp
.\" .Bd -literal -offset indent
.\" mizuno        host==mercury;type:=ufs;dev:=/dev/sd0a
.\" *             type:=error
.\" .Ed
.\" .Pp
.\" このような設定を行い、リブートしてください。
.\" .Pa /home/mizuno
.\" をアクセスすると、
.\" .Pa /dev/sd0a
.\" が
.\" .Pa /am/mercury/home/mizuno
.\" としてマウントされ、
.\" .Pa /home/mizuno
.\" が 
.\" .Pa /am/mercury/home/mizuno
.\" へのシンボリックリンクとなります。
.\" .Pa /home/mizuno
.\" 以外がアクセスされるとエラーとなります。
.\" .Pp
.\" .Pp
.Sh 関連ファイル
.Bl -tag -width /axx
.It Pa /a
動的にファイルシステムがマウントされるディレクトリ
.El
.Pp
.Sh 注意
マウントマップを作成する場合には注意が必要です。
.Pp
.Tn NFS
ファイルシステム上のシンボリックリンクは、信じられないほど
非効率的です。
.Tn NFS
を実装した多くのシステムでは、
シンボリックリンクの展開結果はカーネルがキャッシュせずに、
.Em lookuppn
(パス名変換)時にシンボリックリンクに出会うたびに
NFSサーバに対してRPCコールを行うようになっています。
キャッシュをどこかに加えることによって、かなり大きな性能の向上が
得られるはずです。
上手に実現したオートマウントシステムで
.Xr symlink 2
を置き換えれば大きくスピードアップすることができますが、
同時に多くのコンテキストスイッチも起こします。
.Pp
.Nm amd
のすべての機能を駆使できれば非常に便利ですが、
それにはかなりの想像力が必要になります。
.Pp
.Sh 関連項目
.Xr hostname 1 ,
.Xr amq 8 ,
.Xr mount 8 ,
.Xr umount 8
.Rs
.%T Amd \- The 4.4 BSD Automounter.
.\" 以下の参考文献の節も原文にはない。
.\" しかし参考にはなるだろうから この節は残すことにした。(Feb 1997 jpman Sakai)
.Sh 参考文献
.Bl -bullet -offset indent -compact
.It
アスキー UNIX MAGAZINE 1991 4, 5月号: UNIX Communication Notes --- amd
.It
アスキー NUTSHELL HANDBOOKS: Managing NFS \& NIS --- 自動マウンタ
.El
.Pp
.Re
.Sh 作者
.An Jan-Simon Pendry
<jsp@doc.ic.ac.uk>, Department of Computing, Imperial College, London, UK.
.Sh 歴史
.Nm amd
は 4.4BSD にはじめて導入されました。
