freebsd/freebsd-doc/ja/man/man8/arp.8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)arp.8	8.1 (Berkeley) 6/6/93
.\"
.\" Original Revision: 1.6
.\" jpman %Id: arp.8,v 1.3 1997/07/22 16:36:26 horikawa Stab %
.\"
.Dd June 6, 1993
.Dt ARP 8
.Os BSD 4.3
.Sh 名称
.Nm arp
.Nd アドレス解決の表示と制御
.Sh 書式
.Nm arp
.Op Fl n
.Ar hostname
.Nm arp
.Op Fl n
.Fl a
.Nm arp
.Fl d Ar hostname
.Op Ar proxy
.Nm arp
.Fl d
.Fl a
.Nm arp
.Fl s Ar hostname ether_addr
.Op Ar temp
.Op Ar pub
.Nm arp
.Fl S Ar hostname ether_addr
.Op Ar temp
.Op Ar pub
.Nm arp
.Fl f Ar filename
.Sh 解説
.Nm
プログラムは
アドレス解決プロトコル
.Pq Xr arp 4
で使われる、インターネットからイーサネットへのアドレス変換テーブルの
表示と変更をします。
フラグなしの場合、プログラムは
.Ar hostname
の現在の
.Tn ARP
エントリを表示します。
ホストは名前か、インターネットドット表記の数字で指定します。
.Pp
有効なオプション:
.Bl -tag -width Ds
.It Fl a
プログラムは現在の
.Tn ARP
エントリを全て表示もしくは消去します。
.It Fl d
スーパユーザならば
.Ar hostname
というホストのエントリを消去することができます。
.Fl a
フラグと組み合わせて全エントリを消去することができます。
.It Fl n
ネットワークアドレスを数値で表示します (通常
.Nm
はアドレスをシンボルで表示しようとします)。
.It Fl s Ar hostname ether_addr
ホスト
.Ar hostname
イーサネットアドレス
.Ar ether_addr
の
.Tn ARP
エントリを作成します。
イーサネットアドレスはコロンで区切った六つの 16 進バイトで表現します。
エントリは、語
.Ar temp
がコマンド中にない限り永久的なものです。
語
.Ar pub
があれば、エントリは「公表」されます; すなわち、システムは
.Tn ARP
サーバとして動作し、
.Ar hostname
に対する要求に、たとえホストアドレスが自分自身ではないとしても、
返答します。
この場合、ether_addr は ``auto'' と指定可能です。
この様に指定した場合、
自ホストのインタフェースを検査し、
インタフェースのどれか一つが
指定したホストアドレスと同じサブネットに属す場合、
そのインタフェースの ether_addr を使います。
.It Fl S Ar hostname ether_addr
このホストに関する、すでにある arp エントリが最初に削除されることを除いて、
.Fl s
と同様です。
.It Fl f
ファイル
.Ar filename
を読み込んで、複数のエントリを
.Tn ARP
テーブルに設定します。
ファイル中のエントリは
.Pp
.Bd -filled -offset indent -compact
.Ar hostname ether_addr
.Op Ar temp
.Op Ar pub
.Ed
.Pp
の形にするべきです。ここで引数の意味は上で与えられた通りです。
.El
.Sh 関連項目
.Xr inet 3 ,
.Xr arp 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
コマンドは
.Bx 4.3
から登場しました。
