freebsd/freebsd-doc/ja/man/man8/boot_i386.8
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software written and contributed
.\" to Berkeley by William Jolitz.
.\"
.\" Almost completely rewritten for FreeBSD 2.1 by Joerg Wunsch.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_i386.8	8.2 (Berkeley) 4/19/94
.\" %Id: boot_i386.8,v 1.14 1998/09/23 06:54:14 yokota Exp %
.\" jpman %Id: boot_i386.8,v 1.5 1997/12/04 18:33:50 ken Exp %
.\"
.\"
.Dd April 19, 1994
.Dt BOOT 8 i386
.Os
.Sh 名称
.Nm boot
.Nd
システム立上げ時の手続き
.Sh 解説
.Sy 電源断とクラッシュからの回復。
通常、電源復旧時とクラッシュ発生後には、システムは自動的にリブートし
ます。ファイルシステムの整合性チェックが自動実行され、途中で失敗しな
ければ、システムはマルチユーザ・モードに移行します。
.Pp
.Sy コールドスタート。
大多数の 386
.Tn "PC AT" 
互換機は、まずフロッピードライブ 0 (ドライブ A: ともいう) からの
ブートを試み、それに失敗すると、ハードディスクドライブ 0 (ドライブ C: も
しくは (紛らわしいが) ハードディスクドライブ 1 とも BIOS のドライブ 
0x80 ともいう) からブートしようとします。いくつかの BIOS では、この
デフォルトの順序を変えたり、 CD-ROM デバイスをブートデバイスとして含
めることができます。
ブートブロックがロードされたあとで、次のようなプロンプトが現れます。
.Bd -literal
>> FreeBSD BOOT @ 0x10000: 640/7168 k of memory, internal console
Boot default: 0:wd(0,a)kernel

boot:
.Ed
.Pp
(スクリーン上にはいくつかの情報も出力されているかもしれません)
.Pp
自動ブートにおいては、フロッピー
もしくはハードディスクのパーティション
.Ql a
から
.Pa /kernel
をロードしようとします。
この動作は 
.Ql boot:
というプロンプトが出ている間なら、キーボードから適当な文字を入力する
ことで中断できます。以下にあげるような入力はブート動作に対する指示と
して受付けられます。
.Bl -tag -width 10x
.It \&?
ブートファイルを探す際のヒントとして、デフォルトのブートデバイスの
ルートディレクトリにあるファイルの名前を表示します。
.It Op bios_drive:interface(unit,part) Op filename Op Fl aCcDdghPrsv
ブートファイルとブートフラグを指定します。
.Bl -tag -width 10x -compact
.It bios_drive
BIOS によって認識されるドライブ番号です。 1 つ目のドライブに対しては 
0 、 2 つ目のドライブに対しては 1 、などです。
.It interface
そこからブートするコントローラのタイプです。ブートファイルのイメージ
をロードするのには BIOS の機能を使用するので、そのコントローラに対す
る BIOS サポートが必要となることに注意して下さい。
.Pp
サポートされているインタフェースを以下にあげます。
.Bl -tag -width "wdXX" -compact
.It wd
WD100[2367] とその互換コントローラ上の ST506, IDE, ESDI, RLL ディスク
.It fd
5 1/4" または 3 1/2" 高密度 フロッピ
.It da
サポートされている SCSI コントローラ上の SCSI ディスク
.\".It cd
.\"CDROM からのブート
.El
.It unit
使用されているインタフェース上のドライブのユニット番号です。 1 つ
目のドライブに対しては 0 、 2 つ目のドライブに対しては 1 、などです。
.It part
ディスク上の BSD 部分内のパーティション文字です。詳しくは
.Xr disklabel 8  
を参照して下さい。慣例として、パーティション
.Ql a
のみが ブート可能なイメージを含んでいます。ディスクにスライス
.Pq Dq fdisk  パーティション
が設けられていた場合、最初の BSD スライスからのみブートが可能です。
また、パーティション文字は常に最初のスライスについてのものとなります。
.It /filename
ブートファイルの (指定されたパーティションのルートディレクトリからの
相対) パス名です。デフォルトでは
.Pa /kernel 
となります。シンボリックリンクはサポートされていません (ハードリンク
は使用できます)。
.It Fl acCdDghPrsv
ブートフラグです。
.Bl -tag -width "-CXX" -compact
.It Fl a
カーネル初期化中に、ルートファイルシステムとしてマウントされるデバイスを
尋ねて来るようにします。
.It Fl C
CDROM からブートします。
.It Fl c
ロードしたカーネルに対し、ハードウェアのパラメータを変更するため、 
UserConfig を実行します。
カーネルが USERCONFIG_BOOT オプション付きで構築された場合、
スクリプト中に
.Ic quit
コマンドがあったとしても、UserConfig 中にとどまります。
.It Fl D
シングルとデュアルのコンソール設定を切り替えます。シングル設定では、
下記の
.Fl h
オプションの状態によって、コンソールは内部ディスプレイかシリアルポートの
いずれかになります。デュアルコンソール設定では、内部ディスプレイ
とシリアルポートの両方が、
.Fl h
オプションの状態によらず、同時にコンソールになります。しかし、
デュアルコンソール設定は、ブートプロンプトの間だけでしか効果を持ちません。
一旦カーネルがロードされると、
.Fl h
オプションによって指定されたコンソールが唯一のコンソールになります。
.It Fl d
カーネルの初期化のできる限り早い段階で DDB カーネルデバッガ
.Pq Xr ddb 4 を参照
に入ります。
.It Fl g
GDB リモートデバッギングプロトコルを使用します。
.It Fl h
内部コンソールとシリアルコンソールの切替えを行います。これを使用して
コンソールデバイスを変更できます。例えば、内部コンソールからブートし
た場合、カーネルがコンソールデバイスとしてシリアルポートを使用するよ
うにするため、
.Fl h
オプションを使用できます。反対に、シリアルポートからブートした場合、
カーネルがコンソールとして代わりに内部ディスプレイを使用するようにす
るため、このオプションを使用できます。
カーネルを
.Em options COMCONSOLE
付きでコンパイルした場合には、このオプションは効果ありません。
.It Fl P
キーボードを検出します。キーボードが発見できなかった場合には、
.Fl D
と
.Fl h
オプションが自動的にセットされます。
.It Fl r
ルートファイルシステムを含むデバイスとしてスタティックに config され
たデフォルトを使用します
.Pq Xr config 8 を参照
。
.It Fl s
シングルユーザ・モードで立上がるようになります。コンソールが
.Dq insecure
.Pq Xr ttys 5 を参照
に設定されていた場合には、root のパスワードを入力しなければなり
ません。
.It Fl v
デバイス検出の際 (そしてその後も) 、詳細を出力します。
.El
.El
.El
.Pp
デフォルトを設定するため、BIOS ドライブ番号, コントローラタイプ, 
ユニット番号, パーティション, カーネルファイル名と
.Fl D ,
.Fl h ,
.Fl P
オプションを
.Pa /boot.config
に書くこともできます。
.Ql boot:
プロンプトでタイプするように、 1 行で書いてください。
.Sh 関連ファイル
.Bl -tag -width /kernel.old.config -compact
.It Pa /boot.config
ブートローダに対するパラメータ (必須ではない)
.It Pa /boot.help
ヘルプメッセージ
.It Pa /kernel
デフォルトカーネル
.It Pa /kernel.config
デフォルトカーネルに対するパラメータ (必須ではない)
.It Pa /kernel.old
ふつうは非デフォルトカーネル (必須ではない)
.It Pa /kernel.old.config
非デフォルトカーネルに対するパラメータ (必須ではない)
.\" .It Pa /boot
.\" system bootstrap
.El
.Sh 関連項目
.Xr ddb 4 ,
.Xr ttys 5 ,
.Xr config 8 ,
.Xr disklabel 8 ,
.Xr halt 8 ,
.Xr reboot 8 ,
.Xr shutdown 8
.Sh バグ
このバージョンの
.Bx
で使用されているディスクラベルのフォーマットは、他のアーキテクチャで
使用されている物とは全く異なっています。
.Pp
一文字だけのブートフラグはあまり分かりやすい物とは言えず、有用と思わ
れるオプションをすべて実現するには、アルファベットの文字数は少なすぎ
ます。
