freebsd/freebsd-doc/ja/man/man8/dhclient.8
.\"	dhclient.8
.\"
.\" Copyright (c) 1997 The Internet Software Consortium.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of The Internet Software Consortium nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INTERNET SOFTWARE CONSORTIUM AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE INTERNET SOFTWARE CONSORTIUM OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This software has been written for the Internet Software Consortium
.\" by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
.\" Enterprises.  To learn more about the Internet Software Consortium,
.\" see ``http://www.isc.org/isc''.  To learn more about Vixie
.\" Enterprises, see ``http://www.vix.com''.
.\" jpman %Id: dhclient.8,v 1.3 1999/05/03 09:15:28 horikawa Stab %
.\" WORD: Dynamic Host Configuration Protocol (DHCP)	動的ホスト設定プロトコル
.\" WORD: lease			リース [dhclient.8]
.\" WORD: mobile host		移動ホスト
.\" WORD: networking framework	ネットワーキングフレームワーク
.TH dhclient 8
.SH 名称
dhclient - 動的ホスト設定プロトコルのクライアント
.SH 書式
.B dhclient
[
.B -p
.I port
]
[
.B -1
]
[
.B -d
]
[
.I if0
[
.I ...ifN
]
]
.SH 解説
Internet Software Consortium の DHCP クライアントである dhclient
は動的ホスト設定プロトコル (DHCP: Dynamic Host Configuration Protocol)
または BOOTP プロトコルを用いて、あるいは
これらのプロトコルが失敗した場合にはアドレスを静的に割り当てて、
1 つ以上のネットワークインタフェースを設定する方法を提供します。
.SH 操作
.PP
DHCP プロトコルでは、1 つ以上のサブネットに割り当てることのできる
IP アドレスのリストを管理する中央サーバに、ホストがアクセスできます。
DHCP クライアントはこのリストからアドレスを要求して、
それをネットワーク通信の一時的な土台に用いることができます。
また DHCP プロトコルは、デフォルトルータの場所やネームサーバの場所など、
クライアントが接続しているネットワークに関する重要な情報を
クライアントに詳細に知らせる機構も提供します。
.PP
起動時に dhclient は
.IR dhclient.conf
から設定指示を読み取ります。
それから現在のシステムに組み込まれている
すべてのネットワークインタフェースのリストを取得します。
各インタフェースに対し dhclient は DHCP プロトコルを用いて設定を試みます。
.PP
システムリブートやサーバ再起動の際にリースを失わないように、
dhclient は割り当てられたリースのリストを
dhclient.leases(5) ファイルに保存します。
起動時、dhclient.conf ファイルを読み取った後、
dhclient は dhclient.leases ファイルを読み込んで、
割り当てられたリースに関するメモリを更新します。
.PP
新しいリースを取得すると、dhclient.leases ファイルの末尾に付け加えられます。
ファイルが極端に大きくなるのを防ぐために、
dhclient は時おりコア内部のリースデータベースから
新規 dhclient.leases ファイルを作成します。
古いほうの dhclient.leases ファイルは、
dhclient が次にデータベースを作り替えるまで、
.IR dhcpd.leases~
という名前で保存されます。
.PP
dhclient が最初に起動されたとき
(一般的にはシステムブート初期過程の間) に DHCP サーバが利用できなければ、
古いリースは残されます。
その場合、dhclient.leases ファイルから
まだ期限の切れていない古いリースを検査し、
有効であると判断されれば、それらの期限が切れるか
または DHCP サーバが利用できるようになるまで、そのリースを使います。
.PP
時には DHCP サーバが存在しないネットワークにアクセスする必要があるような
移動ホストは、そのネットワーク上の固定アドレスのリースを
あらかじめ読み込んでおくことができます。
DHCP サーバへのアクセスがどれも成功しなかった場合、
dhclient はその静的なリースが有効であるか検証し、
有効であれば次に再起動されるまでそのリースを使います。
.PP
また移動ホストは、DHCP は利用できないが BOOTP なら利用できるような
ネットワークへ移動することもあるでしょう。
そのような場合は、古いリースを順次試すよりも、
そのネットワークの管理者と相談して
BOOTP データベースにエントリを作成してもらい、
そのネットワーク上で素早くブートできるようにするとよいでしょう。
.SH コマンドライン
.PP
dhclient が設定しようとするネットワークインタフェースの名前を
コマンドラインで指定できます。
コマンドラインでインタフェース名が指定されなければ、
dhclient はすべてのネットワークインタフェースを識別し、
可能なら非ブロードキャストインタフェースは除いて、
それぞれのインタフェースを設定しようとします。
.PP
標準 (ポート 68) 以外のポートで dhclient に送受信させるには、
.B -p
フラグが使えます。
このフラグに続けて、dhclient が使う udp ポート番号を指定します。
これは主にデバッグ目的に有用です。
.B -p
フラグを指定すると、指定した番号より 1 つ小さなポート番号を使用して、
クライアントはサーバへの応答を送信します -
つまり、
.B -p
68 と指定した場合には、
クライアントはポート 68 で listen してポート 67 で送信します。
リレーエージェントを介す必要があるデータグラムは、
.B -p
フラグで指定されるポート番号に送られます -
代替ポート番号を使用したい場合、
使用しているリレーエージェントを設定して、
同じ代替ポート番号を使用させる必要があります。
.PP
通常、dhclient はインタフェースを設定するまではフォアグラウンドで動作し、
その後バックグラウンドの動作に移行します。
dhclient を常にフォアグラウンドプロセスとして実行させるには、
.B -d
フラグを指定してください。
これは dhclient をデバッガ内で実行するときや、
System V システムで inittab 外で実行するときに便利です。
.PP
.B -1
フラグを指定すると、
dhclient はひとつのリースに対し 1 度だけしか取得を試みません。
もし取得に失敗すれば dhclient は終了します。
.PP
.SH 設定
dhclient.conf(8) ファイルの書式は別に解説されています。
.SH 関連ファイル
.B /etc/dhclient.conf, /var/db/dhclient.leases, /var/run/dhclient.pid,
.B /var/db/dhclient.leases~
.SH 関連項目
dhclient.conf(5), dhclient.leases(5), dhclient-script(8)
.SH 作者
.B dhclient(8)
は Ted Lemon <mellon@fugue.com> が
Vixie Enterprises と協力して Internet Software Consortium のために
書きました。
Internet Software Consortium についてより詳しくは、
.B http://www.vix.com/isc
をご覧ください。
Vixie Enterprises についてより詳しくは、
.B http://www.vix.com
をご覧ください。
.PP
本クライアントは、Elliot Poger が
Stanford 大学の MosquitoNet プロジェクトに参加している間に、
Linux での利用に際し大幅に修正、改良を行いました。
.PP
現在のバージョンは、Elliot による Linux での改良に負うところが大きいですが、
Internet Software Consortium の DHCP サーバが使うものと同じ
ネットワーキングフレームワークを用いるように、Ted Lemon が
大幅な再編成や部分的な書き換えを行いました。
システム特有の設定コードの大部分はシェルスクリプトに移されたので、
より多くのオペレーティングシステムのサポートが加えられるにつれ、
システム特有の設定コードをそのオペレーティングシステムに
移植したり管理したりする必要はなくなるでしょう。
代わりに、シェルスクリプトが環境に合ったツールを呼び出して
その目的を果たしてくれます。
.PP
