freebsd/freebsd-doc/ja/man/man8/disklabel.8
.\" Copyright (c) 1987, 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Symmetric Computer Systems.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)disklabel.8	8.2 (Berkeley) 4/19/94
.\"	%Id: disklabel.8,v 1.3.2.2 1997/08/25 21:28:37 jkh Exp %
.\" jpman %Id: disklabel.8,v 1.2 1997/03/31 14:09:16 horikawa Stab %
.\"
.Dd April 19, 1994
.Dt DISKLABEL 8
.Os BSD 4.2
.Sh 名称
.Nm disklabel
.Nd ディスクラベルの読み書きを行う
.Sh 書式
.Nm disklabel
.Op Fl r
.Ar disk
.br
.Nm disklabel
.Fl w
.Op Fl r
.Ar disk Ar disktype
.Oo Ar packid Oc
.br
.Nm disklabel
.Fl e
.Op Fl r
.Ar disk
.br
.Nm disklabel
.Fl R
.Op Fl r
.Ar disk Ar protofile
.br
.Nm disklabel
.Op Fl NW
.Ar disk
.sp
.br
.Nm disklabel
.Fl B
.Oo
.Fl b Ar boot1
.Op Fl s Ar boot2
.Oc
.Ar disk
.Oo Ar disktype Oc
.br
.Nm disklabel
.Fl w
.Fl B
.Oo
.Fl b Ar boot1
.Op Fl s Ar boot2
.Oc
.Ar disk Ar disktype
.Oo Ar packid Oc
.br
.Nm disklabel
.Fl R
.Fl B
.Oo
.Fl b Ar boot1
.Op Fl s Ar boot2
.Oc
.Ar disk Ar protofile
.Oo Ar disktype Oc
.\" 注: 上記 .br は改行動作のために挿入
.\" By horikawa@jp.freebsd.org (30 Mar 1997)
.Sh 解説
.Nm disklabel
はディスクドライブやディスクパックにラベルを書き込んだり、
確認したり、修正したりするために使われます。
ラベルを書き込む際には、ドライブの識別子を変更したり、
ディスクのパーティションを変更したり、
異常のあるラベルを置き換えたりすることができます。
システムによっては、
.Nm disklabel
は同時にブートストラップコードを
インストールするためにも使われます。
コマンドには、ディスク上のラベルを読んだり (表示したり)、書き込んだり、
編集したりするいくつかの形式があります。
それぞれの形式に
.Fl r
オプションをつけると、ラベルの読み書きをシステムの
メモリ内のコピーに対して行うかわりに、ディスクに対して直接行います。
このオプションをつけると、システムに最初にラベルを書き込むときのように、
カーネルがそのラベルを保持していないような場合にもディスクへラベルを
書き込むことができるようになります。つまり、最初にディスクへラベルを
書き込むときには必ずこのオプションが必要になるということです。
.Fl r
スイッチの特別な機能については、それぞれのコマンドで解説しています。
ラベルの読み込みや書き込みの形式に対しては、ブートストラップコードを
インストールするために
.Fl B
スイッチを指定することができます。
これらの違いについてもあとで解説します。
.Pp
コマンドの最初の形式 (read) は、
指定したディスクドライブ (例: sd0 や /dev/rsd0c) のラベルを確認するため
に使用されます。
これによってドライブに関するすべてのパラメータとパーティションのレイアウトを
表示します。
.Fl r
フラグを指定しない場合には、カーネルのメモリ内にあるラベルのコピーが
表示されます。
もしディスクにラベルが書き込まれていなかったり、ディスクのパーティション形式が
正しくない場合には、カーネルが作り直したり、修正したりしたラベルが
表示されるかもしれません。
.Fl r
フラグが与えられると、メモリ内のラベルを表示するかわりにディスク上の実際の
ラベルが表示されます。
.Pp
2 番目の形式は、
.Fl w
フラグ付きの形式で、指定したドライブへ標準のラベルを書き込む
ために使用されます。
コマンドには引数として、ラベルを書き込むドライブ名 (例: sd0)、および
.Xr disktab 5
に書かれているドライブタイプが必要です。
ドライブのパラメータとパーティション情報は、このファイルから得られたもの
が使われます。
もし、同じ型のディスクに異なるパーティション情報を持たせたい場合には、
disktab にそれぞれ別々のエントリを書いておくか、ラベルを書き込んだあとで
後述する方法でそれを編集する必要があります。
オプションの引数として、16 文字までのパック識別用文字列を指定します。
パック名に空白を含める場合にはそれをクォートする必要があります。
.Fl r
フラグが与えられると、ディスクのラベルとブートストラップが
直接書き換えられます。
この副作用として、すでにあるブートストラップ用コードが上書きされてしまうため、
ディスクがブート不能にされてしまいます。
.Fl r
が指定されない場合には、ラベルはメモリ内のコピーを通して書き換えられる
ため、ブートストラップコードは影響されません。
もしまだディスクがラベル付けされていなければ、
.Fl r
フラグをつけなければなりません。
どちらの方法でも、カーネルのメモリ内コピーは変更されます。
.Pp
.Xr disktab 5
に記載されていない未使用のディスクに対しては、
.Ar disktype
として
.Dq auto
を指定できます。
この場合、ディスクの最初のラベルを生成するようにドライバに要求します。
これは成功するかも知れないし成功しないかも知れません。
これはディスクドライバがディスクを全く読む事無く
必要なデータを取得できるか否かに依存します。
全ての SCSI ディスクとほとんどの IDE ディスクと vnode デバイスにおいて
成功するでしょう。
ディスクに対するラベルの書き込みは唯一サポートされた操作であり、
.Ar disk
自身は標準の名前(フルパス名であってはなりません)で提供される必要があります。
.Pp
.Fl e
フラグによって、すでに存在するディスクラベルを編集することができます。
ラベルはカーネルのメモリ内コピーから、または
.Fl r
フラグが与えられた場合には直接ディスクから読み込まれます。
ラベルは整形され、編集するためのエディタへ渡されます。
.Ev EDITOR
環境変数によるエディタの指定がない場合には、このエディタには
.Xr vi 1
が使用されます。
エディタを終了すると、整形されたラベルが再読み込まれて、
ディスクラベルに再び書き込まれます。
.Fl r
フラグの指定の有無にかかわらず、
すでにあるブートストラップコードは変更されません。
.Pp
.Fl R
フラグを指定すると、
.Nm disklabel
は以前の操作により整形済でアスキーファイルとして保存されているディスクラベル
をディスクへ書き戻します。
ラベルを作成するときに使われるプロトタイプファイルは、ラベルを読み込んだり
編集したりするときのものと同じフォーマットである必要があります。
コメントは
.Ar \&#
と改行で区切られます。
.Fl w
のように、
.Fl r
が指定されているとブートストラップコードは使えなくなってしまいます。
.Pp
.Nm disklabel
コマンドの
.Fl NW
フラグはそれぞれ、指定したディスクのパックラベルエリアへの書き込みを
明示的に禁止したり、許可したりします。
.Pp
.Nm disklabel
の最後の 3 つの形式は、ブートストラップコードがラベルの一部である
ようなマシンで、ブートストラップコードをインストールするために使われます。
ブートストラップコードには、
マシンに依存する 1 つまたは 2 つのプログラムが含まれます。
.Fl B
フラグは、ブートストラップコードをインストールすることを示すために
使われます。
.Fl r
フラグの機能は
.Fl B
フラグに含まれているので、同時に指定しないようにしてください。
インストールされるブートストラップコードの名前は、
いくつかの方法で選択することができます。
第1に、
.Fl b
や
.Fl s
フラグによって明示的に名前を指定することができます。
1 段階のブートプログラムのみが必要なマシンでは、
.Fl b
によって指定するものがそのプログラムです。
2 段階のブートストラップを行うマシンでは、
.Fl b
で指定するのが最初のブートプログラムで、
.Fl s
で指定するのが 2 段階目のプログラムになります。
プログラム名が明示的に与えられなければ、標準ブートプログラムが使われます。
ブートプログラムは、
.Pa /usr/mdec
に置かれます。
もし、
.Ar disktype
が与えられ、それに対応する
.Xr disktab 5
のエントリが存在し、
なおかつ ``b0'' , ``b1'' の 2 つのパラメータがある場合には、
ブートプログラムはこれらのパラメータから得られます。
さもなければ、ブートプログラム名はディスク名から得られます。
この名前は、1段階目のブートストラップに対しては
.Pa basename Ns boot
、2 段階目のブートストラップに対しては
.Pf boot Pa basename
になります。
たとえば、ディスクデバイスが
.Em sd0
である場合には、これらの名前は
.Pa /usr/mdec/sdboot
や
.Pa /usr/mdec/bootsd
になります。
.Pp
3 つのブートプログラムインストールの形式のなかで最初のものは、
すでに存在するディスクラベルを変更せずにブートストラップコードを
インストールするために使われます。
これは、ディスクラベル自身に対しては本質的には読み込みコマンドで、
すべてのオプションはすでに記したように
ブートプログラムを特定するのに関するものです。
あとの 2 つの形式は同様に、ディスクラベルを書き込んだり復元したりするのと同時に
ブートストラップコードをインストールするものです。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /etc/disktab
.It Pa /usr/mdec/ Ns Em xx Ns boot
.It Pa /usr/mdec/boot Ns Em xx
.El
.Sh 使用例
.Dl disklabel sd0
.Pp
sd0 のラベルとしてカーネル内のコピーを
.Pa /dev/rsd0c
から得られたものとして表示します。
.Pp
.Dl disklabel -w -r /dev/rsd0c sd2212 foo
.Pp
.Pa /etc/disktab
に書かれている ``sd2212'' の情報を
sd0 のラベルとして書き込みます。
存在したブートストラップコードは使えなくなります。
.Pp
.Dl disklabel -e -r sd0
.Pp
sd0 のディスク上のラベルを読み込み、編集し、再び書き込みます。
ディスク上のラベルとともにカーネル内コピーも書き換えられます。
存在したブートストラップコードは影響を受けません。
.Pp
.Dl disklabel -r -w sd0 auto
.Pp
sd0 から必要な情報を自動検出し、新しいラベルをディスクに書こうとします。
パーティションおよびファイルシステム情報を編集するために、
この後で disklabel -e コマンドを使って下さい。
.Pp
.Dl disklabel -R sd0 mylabel
.Pp
.Pa mylabel
に書かれている情報を
sd0 のラベルとして書き込みます。
ディスク上のラベルとともにカーネル内コピーも書き換えられます。
存在したブートストラップコードは影響を受けません。
.Pp
.Dl disklabel -B sd0
.Pp
sd0 に新たにブートストラップコードを書き込みます.
ブートストラップコードは
.Pa /usr/mdec/sdboot
、およびもし必要ならば
.Pa /usr/mdec/bootsd
です。
ディスク上のラベルおよびカーネル内コピーは影響を受けません。
.Pp
.Dl disklabel -w -B /dev/rsd0c -b newboot sd2212
.Pp
新たなラベルとブートストラップコードを書き込みます。
ラベルは disktab の ``sd2212'' の情報を使用し、
ディスク上のラベルとともにカーネル内コピーも書き換えられます。
ブートストラップコードは
.Pa /usr/mdec/newboot
です。
.Sh 関連項目
.Xr disklabel 5 ,
.Xr disktab 5
.Sh 診断
デバイスドライバは、
オープンされているパーティションに関して、
サイズが小さくなることおよびオフセットが変化することを許しません。
デバイスドライバの中には、
ラベルを持たないディスクに対して 1 パーティションのみからなる
ラベルを作成するものがあります。
そのため、
オープンされているディスクのラベルは ``a'' パーティションに書く必要があります。
このような理由で、
次の 2 ステップにより、
所望のラベルを作成する必要がある場合があります。
第 1 ステップは少なくとももう 1 つのパーティションを作成することであり、
第 2 ステップは ``a'' パーティションを小さくしながら
新たなパーティションのラベルを設定することです。
.Pp
ファイルシステムによっては、
用意された領域にブートストラップコードが収まり切らないような
マシンがあるかも知れません
その結果として、``ブート可能な'' ディスクのパーティションに
ファイルシステムを作成できない場合があります。
ブートストラップコードを書き込む時に、
.Nm disklabel
はこのようなケースをチェックします。
FS_UNUSED タイプのパーティションに重なるように
ブートストラップコードが書き込まれる場合には、
そのパーティションは FS_BOOT とマークされます。
.Xr newfs 8
ユーティリティは、
FS_BOOT パーティションにファイルシステムを作成することを禁止します。
また逆に、
パーティションのタイプが FS_UNUSED もしくは FS_BOOT では無い場合、
.Nm disklabel
はそのパーティションに重なるようなブートストラップコードを書き込みません。
.Sh バグ
ディスク名がフルパスで指定されない場合には、
デバイス名は tahoe の場合 ``a'' パーティションになり、
その他の場合は ``c'' パーティションになります。
.Pp
i386 アーキテクチャでは、プライマリブートストラップセクタに、
組み込みの
.Em fdisk
テーブルを持ちます。
.Nm disklabel
は、
ブートストラップのみをインストールする時
.Pq Fl B
もしくはラベルを編集する時
.Pq Fl e
にこれを壊さないように気を付けます。
しかし、
.Fl w
や
.Fl R
を指定した時には、
無条件でプライマリブートストラッププログラムをディスクに書き込みますので、
.Em fdisk
テーブルをブートストラッププログラム内のダミーに置き換えます。
これはディスク全体を専用に使う場合、
すなわち BSD ディスクラベルがディスクの絶対ブロック 0 から始まる場合
のみ関係あります。
