freebsd/freebsd-doc/ja/man/man8/dset.8
.\"
.\" Copyright (c) 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: dset.8,v 1.7 1998/06/03 04:21:39 jkoshy Exp %
.\" jpman %Id: dset.8,v 1.3 1997/09/04 16:35:08 horikawa Stab %
.\" "
.Dd May 2, 1996
.Dt DSET 8
.Os FreeBSD
.Sh 名称
.Nm dset
.Nd "ブートファイルの現在の設定への更新"
.Sh 書式
.Nm dset
.Op Fl vqt
.Sh 解説
.Nm dset
は、
.Fl c
オプションを用いて起動した際に
.Em UserConfig
により変更された ISA デバイスの設定を記録します。
(変更があった場合)変更は、
.Xr getbootfile 3
から得られる名前のファイルに記録されます。
.Nm dset
は、通常
.Pa /etc/rc
から起動されます。
.Pp
.Nm dset
には以下のオプションがあります。
.Bl -tag -width indent -compact
.It Fl v
冗長; 何を行ったかを表示します。
.It Fl q
静寂; 如何なるエラーメッセージも表示しません。
.It Fl t
テストのみ; 実際のブートファイルへの変更の記録は行わず、
何が行われる可能性があるかの表示だけを行います。
このオプションは暗に
.Fl v
オプションを含みます。
.El
.Sh 診断
.Nm
ユーティリティは成功した場合、終了コード 0 で終了し、何か問題が発生した
場合、終了コード 1 で終了します。
.Fl q
オプションが指定されていなければ、問題の原因のヒントとなるメッセージを
標準エラーに出力します。
.Sh 関連項目
.Xr getbootfile 3 ,
.Xr boot_i386 8 ,
.Xr rc 8
.Sh 歴史
.Nm
コマンドは
.Fx 2.0.5
から登場しました。
