freebsd/freebsd-doc/ja/man/man8/dumplfs.8
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)dumplfs.8	8.1 (Berkeley) 6/18/93
.\"	%Id: dumplfs.8,v 1.1.1.1.8.1 1997/01/02 17:47:28 mpp Exp %
.\" jpman %Id: dumplfs.8,v 1.2 1997/05/23 04:07:38 mitchy Stab %
.\"
.Dd June 18, 1993
.Dt DUMPLFS 8
.Os BSD 4.4
.Sh 名称
.Nm dumplfs
.Nd ファイルシステムの情報のダンプ (lfs 用)
.Sh 書式
.Nm dumplfs
.Op Ar filesys No \&| Ar device
.Sh 解説
.Nm dumplfs
は、指定した LFS ファイルシステムまたはスペシャルデバイスのレイアウト
情報を表示します。表示は非常に長く、詳細なものです。このコマンドは、主
にファイルシステムのブロックサイズのような、ある特定のファイルシステム情報を
調べるのに役立ちます。
.Sh 関連項目
.Xr disktab 5 ,
.Xr fs 5 ,
.Xr disklabel 8 ,
.Xr newlfs 8
.Sh 歴史
.Nm dumplfs
コマンドは
.Bx 4.4
から登場しました。
