freebsd/freebsd-doc/ja/man/man8/ft.8
.\" Copyright (c) 1980, 1989, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)ft.8
.\"	%Id: ft.8,v 1.5 1998/06/30 06:22:05 charnier Exp %
.\" jpman %Id: ft.8,v 1.3 1997/08/20 11:58:37 horikawa Stab %
.\"
.Dd February 7, 1994
.Dt FT 8
.Os BSD 4
.Sh 名称
.Nm ft
.Nd QIC 40/80 フロッピテープドライブコントローラ
.Sh 書式
.Nm ft
.Op Fl f Ar tape
.Op Fl r
.Op Ar description
.Sh 解説
.Nm
コマンドはあらかじめフォーマットされている QIC-40/80 テープに対する、
マルチボリュームのダンプ、抽出、テープラベルの閲覧を行ないます。
これは完全にシステム依存であり、QIC 標準とは無関係です。
.Pp
以下のオプションを使用可能です:
.Bl -tag -width indent
.It Fl f Ar tape
指定された
.Ar tape
から読み書きします
(環境変数
.Ev TAPE
が設定されていなければ、デフォルトは
.Pa /dev/rft0
です)。
.It Fl r
テープを保持します。
.El
.Pp
.Nm
はおもにテープ I/O のフィルタとして使われます。
例えば、
.Pa /usr
ディレクトリをテープに圧縮して保存するには、以下のように入力します。
.Bd -literal -offset indent
% tar cvzf - /usr | ft "/usr save"
.Ed
.Pp
テープから /usr を取り出すには、以下のように入力します。
.Bd -literal -offset indent
% ft | tar xvzf -
.Ed
.\" .Sh 関連項目
.\" .Xr qtar 1
.Sh バグ
フォーマットとベリファイ機能については作業中です。
現在これらを行なうには、今あるバックアッププログラムを使う必要があるでしょう。
.Sh 注釈
フロッピーテープドライバは、
Colorado Jumbo、Mountain Summit Express やいくつかの Archive/Conner モデル、
またおそらくその他のものもサポートしています。
これらのテープドライブはフロッピディスクコントローラカードと
フロッピディスクのリボンケーブルの間に接続されます。
現在のところこのドライバは、
専用のテープコントローラカードやパラレルポートをサポートしていません。
.Pp
QIC-40/80 ドライブは SCSI ドライブに比べ CPU に負荷がかかります。
マシンがネットワークに接続されていたり、
複数のユーザが同時に作業していたりする場合は、
QIC-40/80 ドライブは単なる 1 つの負荷の要素に過ぎません。
個人ユースでは (すなわち典型的なホーム Unix ユーザ)、
応答時間は完全に許容できるものです。
テープドライブは書き込みエラーを検出できません。
そのかわりに、CRC やエラー訂正や不良箇所マッピングを使用しています。
そのため、フォーマット時間は非常に長くなります。
ドライブは最初のパスでテープ全体にセクタを書いていきます。
そして、2 番目のパスを (感度をよくするために) 通常より遅いレートにして、
テープの不良箇所を検出します。
通常、1 本の QIC-80 テープ (120Mb 圧縮なし) をフォーマットするには
1 時間かかります。
.Sh 作者
.An Steve Gerakines Aq steve2@genesis.nred.ma.us
