freebsd/freebsd-doc/ja/man/man8/iostat.8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)iostat.8	8.1 (Berkeley) 6/6/93
.\" jpman %Id: iostat.8,v 1.2 1997/05/19 04:57:59 mitchy Stab %
.\"
.Dd June 6, 1993
.Dt IOSTAT 8
.Os BSD 4
.Sh 名称
.Nm iostat
.Nd
.Tn I/O
の統計情報を表示する
.Sh 書式
.Nm iostat
.Op Fl c Ar count
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
.Op Ar drives
.Sh 解説
.Nm iostat
は、端末やディスク、CPU操作のカーネル
.Tn I/O
統計を表示します。
.Pp
オプションは以下のとおりです:
.Bl -tag -width flag
.It Fl c Ar count
I/O統計情報の表示を
.Ar count
回繰り返します。最初の表示はリブート時からの統計です。
その後の表示は、最後に表示してから次に表示するまでの間の統計です。
間隔
.Ar wait
が指定されていときは、デフォルトの1秒が使われます。
.It Fl M Ar core
名前リストから値を取り出す際に、デフォルトの
.Dq Pa /dev/kmem
のかわりに指定した
.Ar core
を使います。
.It Fl N  Ar system
名前のリストを取り出す際に、デフォルトの
.Dq Pa /kernel
のかわりに
.Ar system
を使います。
.It Fl w  Ar wait
各表示の間隔を、
.Ar wait
秒とします。繰り返し回数
.Ar count
が指定
されていなければ、デフォルトでは無限に表示を繰り返します。
.El
.Pp
.Nm iostat
の、表示する情報のフォーマットは以下のとおりです:
.Bl -tag -width flag
.It tty
.Bl -tag -width indent -compact
.It tin
端末から読み込んだ文字数
.It tout
端末から書き出した文字数
.El
.It disks
ディスク操作。このフィールドはシステム依存です。このフィールドのヘッダ
はディスクの名前とユニット番号です。システムが4つ以上のディスクドライブ
を扱うように設定されていても、
.Nm iostat
は最初の4つのドライブだけ
を表示します。特定のドライブを表示するには、コマンドラインでドライブ
の名前を指定します。
.Pp
.Bl -tag -width indent -compact
.It sps
1秒間に転送されたセクタ数
.It tps
1秒間の転送回数
.It msps
平均シーク時間(ミリ秒単位、シーク時間と回転遅延を含む)
.El
.It cpu
.Bl -tag -width indent -compact
.It \&us
ユーザモードのCPU時間の % 表示
.It \&ni
niceで優先順位づけられたプロセスを動作させるユーザモードのCPU時間
の % 表示
.It \&sy
システムモードのCPU時間の % 表示
.It \&in
インタラプトモードのCPU時間の % 表示
.It \&id
アイドルモードのCPU時間の % 表示
.El
.El
.Sh 関連ファイル
.Bl -tag -width /dev/kmem -compact
.It Pa /kernel
デフォルトのカーネルの名前リスト
.It Pa /dev/kmem
デフォルトのメモリファイル
.El
.Sh 関連項目
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr pstat 8 ,
.Xr vmstat 8
.Pp
.%T "Installing and Operating 4.3BSD"
の ``Interpreting system activity'' で始まる章
