freebsd/freebsd-doc/ja/man/man8/ipmon.8
.TH ipmon 8
.\" jpman %Id: ipmon.8,v 1.3 1998/10/12 11:28:11 horikawa Stab %
.\"
.\" WORD: normal IP filter	通常 IP フィルタ[ipmon.8]
.\"
.SH 名称
.\"X ipmon \- monitors /dev/ipl for logged packets
ipmon \- ログしたパケットのために /dev/ipl をモニタする
.SH 書式
.B ipmon
[
.B \-aFhnstvxX
] [
.B "\-o [NSI]"
] [
.B "\-O [NSI]"
] [
.B "\-N <device>"
] [
.B "\-S <device>"
] [
.B "\-f <device>"
] [
.B <filename>
]
.SH 解説
.LP
\fBipmon\fP は、\fB/dev/ipl\fP を読み出すためにオープンし、パケットフィルタ
から保存されるデータを待ちます。デバイスから読み出されたバイナリデータを
可読形式で再表示します。ただし、IP番号はホスト名に変換されません。また、
ポート番号もサービス名に変換されません。この出力は、デフォルトで標準出力に
向けられます。もしくは、コマンド行でファイル名が指定された場合は、出力は
そのファイルに向けられます。
\fB-s\fP オプションを使用した場合、出力はそちらでなく \fBsyslogd(8)\fP
に向けられます。syslog 経由で送られたメッセージでは、年月日は削除されて
いますが、ログに記録された時刻 (マイクロ秒含む) は残っています。
.SH オプション
.TP
.B \-a
すべてのデバイスログファイルをオープンし、ログエントリをそこから読み込み
ます。すべてのエントリを同じ出力「デバイス」(標準エラー出力または syslog)に
表示します。
.TP
.B "\-f <device>"
通常 IP フィルタログ記録を表すログ情報を読み込むための、
別のデバイス/ファイルを指定します。
.TP
.B \-F
現在のパケットログバッファをフラッシュします。フラッシュされたバイト数は
(結果が 0 であっても) 表示されます。
.TP
.B \-n
可能であれば、IP アドレスとポート番号をホスト名とサービス名に変換します。
.TP
.B "\-N <device>"
NAT ログ記録読み込み用にオープンするログファイルを <device> に設定します。
.TP
.B \-o
実際にデータを読み込むログファイルを指定します。N - NAT ログファイル、
S - 状態ログファイル、I - 通常 IP フィルタログファイルです。
\fB-a\fP オプションは、\fB-o NSI\fP を指定するのと等価です。
.TP
.B \-O
どのログファイルを読み込まないかを指定します。これを \fB-a\fP と
いっしょに使用することが、もっとも意味のある使い方でしょう。
パラメータとして利用可能な文字は、\fB-o\fP と同様です。
.TP
.B \-s
読み込んだパケット情報をファイルに保存するのでなく、syslogd 経由で送信
します。以下で示すレベルが利用できます。
.IP
.B LOG_INFO
\- アクションが pass や block でなく、
キーワード "log" を用いて記録されたパケット。
.IP
.B LOG_NOTICE
\- 通過し、記録されたパケット
.IP
.B LOG_WARNING
\- ブロックされ、記録されたパケット
.IP
.B LOG_ERR
\- すでに記録され、「短い」かもしれないと見なされたパケット
.TP
.B "\-S <device>"
状態ログ記録読み込み用にオープンするログファイルを <device> に設定します。
.TP
.B \-t
tail(1) と似た方法で入力ファイル/デバイスから読み込みます。
.TP
.B \-x
パケットデータを 16 進数で表示します。
.TP
.B \-X
ログヘッダ記録データを 16 進数で表示します。
.SH 診断
\fBipmon\fP は、読み込むデータは、どう保存すべきかについての一貫性が
とれていると想定しています。記録されたデータから異常を検知するテスト
に失敗した場合、処理を中断します。
.SH 関連ファイル
/dev/ipl
.br
/dev/ipnat
.br
/dev/ipstate
.SH 関連項目
ipl(4), ipf(8), ipfstat(8), ipnat(8)
.\"X .SH バグ
