freebsd/freebsd-doc/ja/man/man8/ipmon.8
.TH ipmon 8
.\" jpman %Id: ipmon.8,v 1.2 1998/10/08 08:27:25 kuma Stab %
.\"
.\" WORD: normal IP filter	通常 IP フィルタ[ipmon.8]
.\"
.SH 名称
.\"X ipmon \- monitors /dev/ipl for logged packets
ipmon \- ログパケット用 /dev/ipl のモニタ
.SH 書式
.B ipmon
[
.B \-aFhnstvxX
] [
.B "\-o [NSI]"
] [
.B "\-O [NSI]"
] [
.B "\-N <device>"
] [
.B "\-S <device>"
] [
.B "\-f <device>"
] [
.B <filename>
]
.SH 解説
.LP
.\"X \fBipmon\fP opens \fB/dev/ipl\fP for reading and awaits data to be saved from
.\"X the packet filter.  The binary data read from the device is reprinted in
.\"X human readable for, however, IP#'s are not mapped back to hostnames, nor are
.\"X ports mapped back to service names.  The output goes to standard output by
.\"X default or a filename, if given on the command line.  Should the \fB\-s\fP
.\"X option be used, output is instead sent to \fBsyslogd(8)\fP.  Messages sent
.\"X via syslog have the day, month and year removed from the message, but the
.\"X time (including microseconds), as recorded in the log, is still included.
\fBipmon\fP は、\fB/dev/ipl\fP を読み出しでオープンし、パケットフィルタ
から保存されるデータを待ちます。デバイスから読み出されたバイナリデータを
可読形式で再表示します。ただし、IP番号はホスト名に変換されません。また、
ポート番号もサービス名に変換されません。この出力は、デフォルトで標準出力に
向けられます。もしくは、コマンド行でファイル名が指定された場合は、出力は
そのファイルに向けられます。
\fB-s\fP オプションを使用した場合、出力はそちらでなく \fBsyslogd(8)\fP
に向けられます。syslog 経由で送られたメッセージでは、年月日は削除されて
いますが、ログに記録された時刻(マイクロ秒含む)は残っています。
.SH オプション
.TP
.B \-a
.\"X Open all of the device logfiles for reading log entries from.  All entries
.\"X are displayed to the same output 'device' (stderr or syslog).
すべてのデバイスログファイルをオープンし、ログエントリをそこから読み込み
ます。すべてのエントリを同じ出力「デバイス」(標準エラー出力または syslog)に
表示します。
.TP
.B "\-f <device>"
.\"X specify an alternative device/file from which to read the log information
.\"X for normal IP Filter log records.
通常 IP フィルタログ記録を表すログ情報を読み込むための、
別のデバイス/ファイルを指定します。
.TP
.B \-F
.\"X Flush the current packet log buffer.  The number of bytes flushed is displayed,
.\"X even should the result be zero.
現在のパケットログバッファをフラッシュします。フラッシュされたバイト数は
(結果が 0 であっても)表示されます。
.TP
.B \-n
.\"X IP addresses and port numbers will be mapped, where possible, back into
.\"X hostnames and service names.
可能であれば、IP アドレスとポート番号をホスト名とサービス名に変換します。
.TP
.B "\-N <device>"
.\"X Set the logfile to be opened for reading NAT log records from to <device>.
NAT ログ記録読み込み用にオープンするログファイルを <device> に設定します。
.TP
.B \-o
.\"X Specify which log files to actually read data from.  N - NAT logfile,
.\"X S - State logfile, I - normal IP Filter logfile.  The \fB-a\fP option is
.\"X equivalent to using \fB-o NSI\fP.
実際にデータを読み込むログファイルを指定します。N - NAT ログファイル、
S - 状態ログファイル、I - 通常 IP フィルタログファイルです。
\fB-a\fP オプションは、\fB-o NSI\fP を指定するのと等価です。
.TP
.B \-O
.\"X Specify which log files you do not wish to read from.  This is most sensibly
.\"X used with the \fB-a\fP.  Letters available as parameters to this are the same
.\"X as for \fB-o\fP.
どのログファイルを読み込まないかを指定します。これを \fB-a\fP と
いっしょに使用することが、もっとも意味のある使い方でしょう。
パラメータとして利用可能な文字は、\fB-o\fP と同様です。
.TP
.B \-s
.\"X Packet information read in will be sent through syslogd rather than
.\"X saved to a file.  The following levels are used:
読み込んだパケット情報をファイルに保存するのでなく、syslogd 経由で送信
します。以下で示すレベルが利用できます。
.IP
.B LOG_INFO
.\"X \- packets logged using the "log" keyword as the action rather
.\"X than pass or block.
\- アクションが pass や block でなく、
キーワード "log" を用いて記録されたパケット。
.IP
.B LOG_NOTICE
.\"X \- packets logged which are also passed
\- 通過し、記録されたパケット
.IP
.B LOG_WARNING
.\"X \- packets logged which are also blocked
\- ブロックされ、記録されたパケット
.IP
.B LOG_ERR
.\"X \- packets which have been logged and which can be considered
.\"X "short".
\- すでに記録され、「短い」かもしれないと見なされたパケット
.TP
.B "\-S <device>"
.\"X Set the logfile to be opened for reading state log records from to <device>.
状態ログ記録読み込み用にオープンするログファイルを <device> に設定します。
.TP
.B \-t
.\"X read the input file/device in a manner akin to tail(1).
tail(1) と似た方法で入力ファイル/デバイスから読み込みます。
.TP
.B \-x
.\"X show the packet data in hex.
パケットデータを 16 進数で表示します。
.TP
.B \-X
.\"X show the log header record data in hex.
ログヘッダ記録データを 16 進数で表示します。
.SH 診断
.\"X \fBipmon\fP expects data that it reads to be consistent with how it should be
.\"X saved and will abort if it fails an assertion which detects an anomoly in the
.\"X recorded data.
\fBipmon\fP は、読み込むデータは、どう保存すべきかについての一貫性が
とれていると想定しています。記録されたデータから異常を検知するテスト
に失敗した場合、処理を中断します。
.SH 関連ファイル
/dev/ipl
.br
/dev/ipnat
.br
/dev/ipstate
.SH 関連項目
ipl(4), ipf(8), ipfstat(8), ipnat(8)
.\"X .SH バグ
