freebsd/freebsd-doc/ja/man/man8/joy.8
.\"
.\" Copyright (c) 1996 Jean-Marc Zucconi <jmz@cabri.obs-besancon.fr>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: joy.8,v 1.4.2.1 1999/04/06 13:55:20 ghelmer Exp %
.\"
.\" jpman %Id: joy.8,v 1.3 1997/07/22 16:48:04 horikawa Stab %
.Dd March 16, 1996
.Dt JOY 8
.Os FreeBSD
.Sh 名称
.Nm joy
.Nd ジョイスティックドライバのカーネルモジュールを読み込む。
.Sh 書式
.Nm joy
.Sh 解説
.Nm
は、ジョイスティックドライバのカーネルモジュールを読み込みます。
.Sh 関連ファイル
.Bl -tag -width /modules/joy.ko 
.It Pa /modules/joy.ko
ジョイスティックの読み込み可能カーネルモジュール
.Sh 関連項目
.Xr joy 4 ,
.\"no equivalent for kld's yet":.Xr lkm 4 ,
.Xr kldload 8
