freebsd/freebsd-doc/ja/man/man8/kzip.8
.\"
.\" Copyright (c) 1996 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: kzip.8,v 1.1.2.1 1997/07/21 11:56:34 charnier Exp %
.\" jpman %Id: kzip.8,v 1.3 1997/08/16 13:18:54 horikawa Stab %
.\"
.Dd August 15, 1996
.Os
.Dt KZIP 8
.Sh 名称
.Nm kzip
.Nd カーネルを圧縮する
.Sh 書式
.Nm kzip
.Op Fl v
.Op Fl l Ar loadaddr
.Sh 解説
このプログラムは、
.Xr gzip 1
を用いてカーネルを圧縮し、ディスク容量を節約します。
メモリ上にロードされた後の、メモリ使用量を減らすわけでは有りません。
シンボル情報は全て失われるので、利用法は限られます。
主な利用目的は、インストールフロッピや fixit フロッピ等のための
カーネルを作成することです。
.Pp
次のオプションが利用可能です:
.Bl -tag -width flag
.It Fl v
詳細出力モード。圧縮後のカーネルが使用するメモリ量を報告します。
そのカーネルが 4MB 境界を越えていないことも確認できます。
.It Fl l Ar loadaddr
カーネルをメモリ上にロードするアドレスを指定します。
.Sh 診断
.Nm
ユーティリティは、与えられた引数が不正の場合、終了コード 1 で終了します。
終了コードが 2 である場合は、
.Nm
がカーネルファイルを読めないか、処理できないことを示しています。
.Sh 関連項目
.Xr gzip 1
.\" .Sh 規格
.Sh 歴史
.Nm
コマンドは
.Fx 2.0.5
から登場しました。
Linux から 386BSD を経て取り込まれました。
Linus Torvalds の tools/build.c がベースになっており、
Serge Vakulenko が 386BSD に移植しました。
.Sh 作者
このマニュアルページは David E. O'Brien が記述しました。
.\" .Sh バグ
