freebsd/freebsd-doc/ja/man/man8/lfs_cleanerd.8
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)lfs_cleanerd.8	8.2 (Berkeley) 12/11/93
.\"	%Id: lfs_cleanerd.8,v 1.3.2.1 1997/12/15 07:11:53 charnier Exp %
.\" jpman %Id: lfs_cleanerd.8,v 1.2 1997/05/24 05:44:44 mitchy Stab %
.\"
.Dd "December 11, 1993"
.Dt LFS_CLEANERD 8
.Os BSD 4.4
.Sh 名称
.Nm lfs_cleanerd
.Nd lfs のガーベージコレクションを行う
.Sh 書式
.Nm lfs_cleanerd
.Op Fl ds
.Pa node
.Sh 解説
.Nm
は、指定した
.Ar node
にある log-structured ファイルシステム (LFS) のガーベージコレクションを行う
デーモンプロセスを開始させます。
このコマンドは、通常 log-structured ファイルシステムがマウントされるときに
.Xr mount_lfs 8
によって起動されます。
このコマンドによって起動されるデーモンは、クリーニングを行なう
ファイルシステムがアンマウントされたあと、しばらくすると終了します。
.Pp
LFS でのガーベージコレクションは、アクティブな (参照されている) データを持
つファイルシステムセグメントを検索し、それを新しいセグメントへコピーするこ
とで行われます。
与えられたセグメントのすべてのアクティブデータを新しいセグメントにコピーし
終わると、そのセグメントは空きとなり、再利用できるようになります。
.Pp
オプションは以下のとおりです:
.Bl -tag -width indent
.It Fl d
デバッグモードで実行します。デーモンプロセスにはならず、
デバッグ情報を表示します。
.It Fl s
ファイルシステムをクリーニングするとき、データを小さな単位で読み込みます。
.El
.Sh 関連項目
.Xr mount_lfs 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.4
から登場しました。
