freebsd/freebsd-doc/ja/man/man8/loader.4th.8
.\" Copyright (c) 1999 Daniel C. Sobral
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: loader.4th.8,v 1.1.2.3 1999/05/15 19:46:42 dcs Exp %
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.\"
.\" jpman %Id: loader.4th.8,v 1.2 1999/05/07 11:24:51 horikawa Stab %
.Dd May 16, 1999
.Dt LOADER.4TH 8
.Os
.Sh 名称
.Nm loader.4th
.Nd loader.conf の処理ツール
.Sh 解説
.Nm
の名前で知られるファイルは、
.Xr loader.conf 5
ファイルを操作するためにデザインされたコマンドの集合です。
デフォルトの
.Pa /boot/loader.rc
は、
.Nm
を組み込み、そのコマンドのうちのひとつを使用することにより、標準の
.Xr loader.conf 5
ファイルを自動的に読み込んで処理します。
他のコマンドは、ユーザが別の設定を指定することを助けるために存在しています。
.Pp
.Nm
のコマンド自身は、
ほとんど全部の用途に間に合う程には十分ではありません。
最もありふれた状況における使用例については、
後述の使用例を参照してください。
追加のコマンドについては、
.Xr loader 8
を参照してください。
.Pp
.Nm
で提供されるコマンドを使用する前に、
.Nm
を次のコマンドで組み込む必要があります:
.Pp
.Dl include loader.4th
.Pp
この行は、デフォルトの
.Pa /boot/loader.rc
ファイルにありますので、標準の設定では不要です (し、再発行してはなりません)。
.Pp
これにより提供されるコマンドは、次の通りです:
.Bl -tag -width disable-module_module -offset indent
.It Ic boot-conf
読み込んだ
.Xr loader.conf 5
ファイルに指定される通りにブートへ進みます。
.Ic autoboot
を使用しますので、止めることが可能です。
.It Ic start
.Pa /boot/defaults/loader.conf
と、ここで指定される他のすべての
.Xr loader.conf 5
ファイルを読み込み、これらに指定される通りにブートへ進みます。
これはデフォルトの
.Pa /boot/loader.rc
ファイルで指定されるコマンドであり、
.Pa autoboot
コマンド (
.Xr loader 8
参照) を使用しますので、更に
.Xr loader 8
と対話するために止めることが可能です。
.It Ic initialize
サポートライブラリを初期化します。これにより、最初に
.Ic start
を実行することなくコマンドを使用可能となります。
.Ic start
のように、
.Pa /boot/defaults/loader.conf
とそこで指定される他の
.Xr loader.conf 5
ファイルを読み込みます。
スタック上にフラグを返し、
なんらかの設定ファイルを成功裏にロードできたかを示します。
.It Ic read-conf Ar filename
.Xr loader.conf 5
ファイルを読み込み、処理します。ブートへは進みません。
.It Ic enable-module Ar module
.Ar module
のロードを有効にします。
.It Ic disable-module Ar module
.Ar module
のロードを無効にします。
.It Ic toggle-module Ar module
.Ar module
のロードのオンオフを切り替えます。
.It Ic show-module Ar module
モジュール
.Ar module
に関して
.Xr loader.conf 5
ファイル中で収集した情報を表示します。
.It Ic retry
.Xr loader.conf 5
ファイル中で使用され、モジュールのロードに失敗した後の動作を指定します。
.It Ic ignore
.Xr loader.conf 5
ファイル中で使用され、モジュールのロードに失敗した後の動作を指定します。
.El
.Sh 関連ファイル
.Bl -tag -width /boot/loader.4th -compact
.It Pa /boot/loader
.Xr loader 8
です。
.It Pa /boot/loader.4th
.Nm
自身です。
.It Pa /boot/loader.rc
.Xr loader 8
ブートストラップスクリプトです。
.It Pa /boot/defaults/loader.conf
.Ic start
コマンドによってロードされるファイルです。
.El
.Sh 使用例
標準の
.Pa /boot/loader.rc
は次のようになっています:
.Pp
.Bd -literal -offset indent -compact
include /boot/loader.4th
start
.Ed
.Pp
標準の設定で別のカーネルをロードするには、次のようにします:
.Pp
.Bd -literal -offset indent -compact
set kernel="kernel.old"
unload
boot-conf
.Ed
.Pp
追加の設定ファイルを読み込み、ブートへ進みます:
.Pp
.Bd -literal -offset indent -compact
unload
read-conf /boot/special.conf
boot-conf
.Ed
.Pp
起動画面モジュールとビットマップの読み込みを無効化し、ブートへ進みます:
.Pp
.Bd -literal -offset indent -compact
unload
disable-module splash_bmp
disable-module bitmap
boot-conf
.Ed
.Pp
.Sh 関連項目
.Xr loader.conf 5 ,
.Xr loader 8
.Sh 歴史
.Nm
が最初に登場したのは
.Fx 3.2
です。
.Sh 作者
.Nm
は
.An Daniel C. Sobral Aq dcs@freebsd.org
が記述しました。
.Sh バグ
英国のスパイ活動シリーズです (A british espionage series)。
