freebsd/freebsd-doc/ja/man/man8/lptcontrol.8
.\"
.\" lptcontrol - a utility for manipulating the lpt driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"
.\" %Id: lptcontrol.8,v 1.3.2.3 1998/07/18 11:10:46 jkh Exp %
.\" jpman %Id: lptcontrol.8,v 1.3 1997/08/16 13:20:55 horikawa Stab %
.Dd September 3, 1994
.Dt LPTCONTROL 8
.Os FreeBSD 2
.Sh 名称
.Nm \&lptcontrol 
.Nd lpt プリンタドライバ操作ユーティリティ
.Sh 書式
.Nm \&lptcontrol
.Cm -i
|
.Cm -p
.Op Fl u Ar unit no
.Sh 解説
.Nm
コマンドは、各
.Xr lpt 4
デバイスの割り込み駆動モード/ポーリングモードを設定するのに用いられます。
プリンタが割り込み駆動モード/ポーリングモード間で切り替えられると、
その切り替えは次回デバイスがオープンされたときに有効になります。
.Sh オプション
.TP
以下のコマンドラインオプションがサポートされています:
.Bl -tag -width indent 
.It Fl i
割り込み駆動モードにします。
.It Fl p
ポーリングモードにします。
.It Fl u  Ar n
.Em n
で指定されたプリンタデバイスのモードを設定します。
.Em n
のデフォルト値は
.Em 0
(つまり
.Pa /dev/lpt0
)です。
.El
.Pp
.Fl i
または
.Fl p
のいずれか一方を必ず指定しなければなりません。
.Pp
.Sh 関連ファイル
.Bl -tag -width /sys/i386/conf/GENERIC -compact
.It Pa /dev/lpt?
プリンタデバイス。
.It Pa /dev/lpctl?
プリンタ制御デバイス。
.It Pa /sys/i386/conf/GENERIC
カーネル設定ファイル。
.El
.Sh バグ
きっといくつかあるでしょう。
.Sh 関連項目
.Xr lpt 4 
.Sh 作者
.An Geoffrey M. Rehmet
.Sh 歴史
.Nm
は
.Fx 1.1.5
で初めて登場しました。
