freebsd/freebsd-doc/ja/man/man8/makemap.8
.\" Copyright (c) 1998 Sendmail, Inc.  All rights reserved.
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     @(#)makemap.8	8.10 (Berkeley) 5/19/98
.\" jpman %Id: makemap.8,v 1.3 1997/07/26 21:58:03 horikawa Stab %
.\"
.Dd November 16, 1992
.Dt MAKEMAP 8
.Os BSD 4.4
.Sh 名称
.Nm makemap
.Nd sendmail 用のデータベースマップを作成する
.Sh 書式
.Nm makemap
.Op Fl N
.Op Fl d
.Op Fl f
.Op Fl o
.Op Fl r
.Op Fl s
.Op Fl v
.Ar maptype
.Ar mapname
.Sh 解説
.Nm
は、
.Xr sendmail 8
がキー付きマップを検索する際に用いるデータベースマップを作成します。
これは標準入力から読み込みを行い、指定された
.Ar mapname
に出力を行います。
.Pp
コンパイル方法に依存しますが、
.Nm
は最大 3 種類のデータベースフォーマットを扱います。
扱うフォーマットは
.Ar maptype
で指定します。
.Ar maptype
には、以下のようなものがあります。
.Pp
.Bl -tag -width Fl
.It Li dbm
.Tn DBM
フォーマットマップ。
.Xr ndbm 3
ライブラリが必要です。
.It Li btree
B-Treeフォーマットマップ。
新しい Berkeley DB
ライブラリが必要です。
.It Li hash
ハッシュフォーマットマップ。
同じく
Berkeley DB
ライブラリが必要です。
.El
.Pp
すべてのフォーマットで、
.Nm makemap
は標準入力から空白文字で区切られた 2 つの単語を読み込みます。
最初の単語はデータベースキーで、2番目の単語がその値です。
値が
``%\fIn\fP''
.Pf ( Ar n
は数字)という文字列を含んでいると、sendmail がパラメータ置換を行います。
.Dq %
という文字を含めるには、``%%'' とする必要があります。
空行や ``#'' から始まる行は無視されます。
.Pp
.Ss フラグ
.Bl -tag -width Fl
.It Fl N
文字列の終端記号として、ヌル文字もマップに含めます。
これは、sendmail.cf の ``K'' 行における \-N フラグと一致していなければ
なりません。
.It Fl d
マップ中に重複するキーが存在することを許します。
B-Treeフォーマットマップでのみ可能です。
2 つの同じキーが読まれた場合、両方ともマップに挿入されます。
.It Fl f
通常、キーのなかのすべての大文字(upper case)は、
すべて小文字(lower case)として記録されますが、
このフラグを指定することによってこの動作を行わないように指定できます。
これは、sendmail.cf 中の
\fBK\fP
行における
\-f フラグと一致していなければなりません。
.It Fl o
すでにあるファイルに追加が行われます。
すでに存在するファイルを引数として指定することができます。
.It Fl r
すでに存在しているキーを置き換えます。
通常はすでに入力したキーをさらに繰り返して入力しても、
.Nm
は警告を出力し、データベースには取り込みません。
.It Fl s
生成されるマップの安全チェックを無視します。
これには、
だれでも書き込めるディレクトリへのハードリンクおよびシンボリックのチェックも
含まれます。
.It Fl v
処理の内容を詳細に表示します。
.El
.Sh 関連項目
.Xr sendmail 8
.Sh 歴史
.Nm
コマンドは
.Bx 4.4
から登場しました。
