freebsd/freebsd-doc/ja/man/man8/mount_lfs.8
.\" Copyright (c) 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)mount_lfs.8	8.5 (Berkeley) 3/30/94
.\" jpman %Id: mount_lfs.8,v 1.2 1997/04/12 15:53:04 horikawa Stab %
.\"
.Dd "March 30, 1994"
.Dt MOUNT_LFS 8
.Os BSD 4.4
.Sh 名称
.Nm mount_lfs
.Nd ログ構造化ファイルシステム
.Pf ( Tn LFS )
をマウントする
.Pp
.Sh 書式
.Nm mount_lfs
.Op Fl dns
.Op Fl o Ar options
.Ar special
.Ar node
.Sh 解説
.Nm mount_lfs
は、
.Ar special
で指定される
ログ構造化ファイルシステム
.Pf ( Tn LFS )
を
.Ar node
にマウントします。
さらに、
.Xr lfs_cleanerd 8
が、このファイルシステムを定期的に整理するために起動されます。
.Pp
このコマンドは、普通ブート時に
.Xr mount 8
によって実行されます。
.Pp
オプションは以下の通りです:
.Bl -tag -width Ds
.It Fl d
.Xr lfs_cleanerd 8
をデバッグモードで動かします。
.It Fl o
.Fl o
のあとに、コンマで区切ってオプションを指定できます。
指定できるオプションとその意味は
.Xr mount 8
を参照してください。
.It Fl n
.Xr lfs_cleanerd 8
を動かしません。
.It Fl s
.Xr lfs_cleanerd 8
がファイルシステムを整理するときに、データを小さい単位で読むようにします。
.El
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr lfs_cleanerd 8 ,
.Xr mount 8
.sp
.Rs
.%A Ousterhout and Douglis
.%D 1989
.%T "Beating the I/O Bottleneck: A Case for Log-structured File Systems"
.%J "Operating Systems Review"
.%V Vol. 23
.%N No. 1
.%P pp. 11-27
.%O "also available as Technical Report UCB/CSD 88/467"
.Re
.Pp
.Rs
.%A Rosenblum and Ousterhout
.%D 1991
.%T "The Design and Implementation of a Log-Structured File System"
.%J "ACM SIGOPS Operating Systems Review"
.%V Vol. 25
.%N No. 5
.Re
.Pp
.Rs
.%A Seltzer
.%D 1992
.%T "File System Performance and Transaction Support"
.%B "PhD Thesis, University of California, Berkeley"
.%O "also available as Technical Report UCB/ERL M92"
.Re
.Pp
.Rs
.%A Seltzer, Bostic, McKusick and Staelin
.%D 1993
.%T "An Implementation of a Log-Structured File System for UNIX"
.%J "Proc. of the Winter 1993 USENIX Conf."
.%P pp. 315-331
.Re
.Sh バグ
LFS は現在 FreeBSD のバリアントでは動作しませんので使用すべきではありません。
.Sh 歴史
.Nm mount_lfs
は
.Bx 4.4
から登場しています。
