freebsd/freebsd-doc/ja/man/man8/mount_msdos.8
.\"
.\" Copyright (c) 1993,1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: mount_msdos.8,v 1.3 1996/04/03 23:11:08 gpalmer Exp %
.\" jpman %Id: mount_msdos.8,v 1.3 1997/09/08 01:55:26 seki Stab %
.\"
.Dd April 7, 1994
.Dt MOUNT_MSDOS 8
.Os FreeBSD 2.0
.Sh 名称
.Nm mount_msdos
.Nd MS-DOS ファイルシステムをマウントする
.Sh 書式
.Nm mount_msdos
.Op Fl u Ar uid
.Op Fl g Ar gid
.Op Fl m Ar mask
.Pa special
.Pa node
.Sh 解説
.Nm mount_msdos
コマンドは、デバイス名
.Pa special
上の MS-DOS ファイルシステムを、
グローバルファイルシステムの名前空間の
.Pa node
の示す位置に接続します。
通常このコマンドは、ブート時に
.Xr mount 8
によって実行されますが、
任意のユーザが、
自分の所有する任意のディレクトリに
MS-DOS ファイルシステムをマウントするために使うこともできます。
(もちろん、
そのファイルシステムを含むデバイスに対して
適切なアクセスを行えることが条件ですが。)
.Pp
オプションは以下のものが使用できます:
.Bl -tag -width Ds
.It Fl u
ファイルシステム上のファイルの所有者を
.Ar uid
にします。デフォルトの所有者はファイルシステムがマウントされるディレクトリの
所有者です。
.It Fl g
ファイルシステム上のファイルのグループを
.Ar gid
にします。デフォルトのグループはファイルシステムがマウントされるディレクトリの
グループです。
.It Fl m
ファイルシステム上のファイルの最大のパーミッションを指定します。
(例えば、マスク
.Li 755
は、デフォルトで、
.\" ここでの by default は「MS-DOS の『ファイル属性』として特別な指定
.\" がないとき」という意味であると思われる。意味がわかりにくいが、原文
.\" もわかりにくいので、特に説明を補わない。
.\"	by <seki@sysrap.cs.fujitsu.co.jp>
所有者がファイルの読み書き実行の権限を持ち、
他のユーザが読みと実行の権限だけを持つことを指定します。
8 進のファイルモードに関しては
.Xr chmod 1
を御覧下さい。)
.Ar mask
の下位 9 ビットのみが使用されます。
デフォルトのマスクは、
ファイルシステムがマウントされるディレクトリから取得されます。
.El
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5
.Sh 警告
.Nm msdos
ファイルシステムは MS-DOS バージョン 3.3 以降で作成されたファイルシステムで
うまく動くかどうかわかっていません。
.Pp
MS-DOS が義務付けるファイル名の制限は、良く言っても奇妙です。
例えば大文字小文字は区別されず、8 文字に 3 文字の拡張子しか許されません。
.Pp
次のような警告:
.Pp
mountmsdosfs(): Warning: root directory is not a multiple of the clustersize in length
.Pp
が表示されるときには、
MS-DOS ファイルシステムへ書き込みを行うと
ディスクの内容を壊してしまう可能性があります。
これは直さなければならない問題点です。
.Sh 歴史
.Nm mount_msdos
は FreeBSD 2.0 にて初めて登場しました。
この元になった、
.Nm mount_pcfs
は FreeBSD 1 にて登場しましたが、
よりそれらしい名前の
.Nm mount_msdos
が出来たため廃止されました。
