freebsd/freebsd-doc/ja/man/man8/named-xfer.8
.\" ++Copyright++ 1985
.\" -
.\" Copyright (c) 1985
.\"    The Regents of the University of California.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" 	This product includes software developed by the University of
.\" 	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" -
.\" Portions Copyright (c) 1993 by Digital Equipment Corporation.
.\" 
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies, and that
.\" the name of Digital Equipment Corporation not be used in advertising or
.\" publicity pertaining to distribution of the document or software without
.\" specific, written prior permission.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS" AND DIGITAL EQUIPMENT CORP. DISCLAIMS ALL
.\" WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS.   IN NO EVENT SHALL DIGITAL EQUIPMENT
.\" CORPORATION BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\" -
.\" --Copyright--
.\"
.\"	from named.8	6.6 (Berkeley) 2/14/89
.\"
.TH NAMED-XFER 8 "June 26, 1993"
.\" jpman %Id: named-xfer.8,v 1.2 1997/06/06 11:08:51 bobson Stab %
.UC 4
.SH 名称
named-xfer \- ゾーン転送のための補助エージェント
.SH 書式
.B named-xfer
.B \-z
.I zone_to_transfer
.B \-f
.I db_file
.B \-s
.I serial_no
[
.B \-d
.I debuglevel
] [
.B \-l
.I debug_log_file
] [
.B \-t
.I trace_file
] [
.B \-p
.I port#
] [
.B \-S
]
.I nameserver
...
.SH 解説
インターネットネームサーバの補助プログラムです。
.I named-xfer
は、
.IR named (8)
によって実行される補助プログラムです。
インターネットネームサーバから呼び出されて、ゾーン情報を受け取ります。
直接実行されることはまれであり、ゾーン転送の問題を解決するために
システム管理者にいよってのみ実行されることがある程度です。
インターネットネームドメインシステムについての詳細は、
RFC 1033 、1034 、1035 を参照してください。
.PP
オプションとしては、以下のものがあります:
.TP
.B \-z
転送されるゾーン名を指定します。
.TP
.B \-f
プライマリサーバーからゾーンが転送された際に、ゾーンの情報をダンプ (格納) する
ファイル名を指定します。
.TP
.B \-s
転送されるゾーンの情報のシリアル番号を指定します。プライマリサーバーから
得た \s-1SOA RR\s+1 が、このシリアル番号よりも高いシリアル番号を持たない
場合は、転送は中止されます。
.TP
.B \-d
デバッグ情報を出力します。``d'' のあとの数字は出力されるメッセージのレベルを
決定します。
.TP
.B \-l
デバッグメッセージのログファイルを指定します。デフォルトでは
システムに依存しますが、通常は
.I /var/tmp
または
.IR /usr/tmp
です。このオプションは
.I \-d
と同時に指定されたときのみ適用されますので注意してください。
.TP
.B \-t
ゾーン情報転送のプロトコルトレースを格納するトレースファイルを指定します。
このオプションはネームサーバーそのものをデバッグする人にとってのみ
有益なのかもしれません。
.TP
.B \-p
デフォルト以外のポート番号を使用するときに指定します。
デフォルトの標準ポートナンバーは
``domain'' サービスの getservbyname(3) の返す値になります。
.TP
.B \-S
SOA レコードと NS レコードの転送のみを許可し、
ゾーンに対して A レコードを結合します。
SOA レコードは named によって読み込まれませんが、
NS レコードをいつ検証するのかを決定するのに使用されます。
詳しくは
.IR named (8)
の ``stubs''を参照してください。
.TP
.PP
付加的な引数としてネームサーバーのアドレスを、いわゆる ``dotted-quad'' 
構文でのみ、とります。ネームサーバのアドレスの省略は許されません。
少なくとも一つのアドレスを指定しなくてはなりません。
ネームサーバーのアドレスが複数指定されると、最初のサーバーが転送を失敗すると、
順番にサーバーを切替えて転送を試みます。

.SH 関連項目
named(8), resolver(3), resolver(5), hostname(7),
RFC 882, RFC 883, RFC 973, RFC 974, RFC 1033, RFC 1034, RFC 1035, RFC 1123,
\fIName Server Operations Guide for \s-1BIND\s+1\fR
