freebsd/freebsd-doc/ja/man/man8/ndc.8
.\" Copyright (c) 1994
.\"    The Regents of the University of California.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" 	This product includes software developed by the University of
.\" 	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" jpman %Id: ndc.8,v 1.3 1997/09/07 14:10:53 horikawa Stab %
.TH NDC 8 "November 27, 1994"
.UC 5
.SH 名称
ndc \- ネームサーバデーモン制御インタフェース
.SH 書式
.B ndc
.I directive
[ ... ]
.SH 解説
このコマンドを使用する事により、ネームサーバの管理者はネームサーバに
各種シグナルを送ったり、ネームサーバをリスタートする事ができます。
以下のリストの 0 個以上の命令を指定する事ができます。
.TP
.B status
.BR ps (1)
で得られる
.B named
の現在の状態を表示します。
.TP
.B dumpdb
.B named
のデータベースおよびキャッシュを
.B /var/tmp/named_dump.db
に出力します。
(INT シグナルを用います。)
.TP
.B reload
.B named
の全てのプライマリおよびセカンダリゾーンのシリアル番号を調べ、
変更のあったものをリロードします。
(HUP シグナルを用います。)
.TP
.B stats
.B named
の現在の統計的な状況を
.B /var/tmp/named.stats
に出力します。
(IOT ないし ABRT シグナルを用います。)
.TP
.B trace
.B named
の ``tracing level'' を 1 だけ増加させます。``tracing level'' が 0 以上の時、
トレース情報は
.BR /var/tmp/named.run
に出力します。``tracing level'' が高い程、詳細な情報が得られます。
(USR1 シグナルを用います。)
.TP
.B notrace
.B named
の ``tracing level'' を 0 にし、
.B /var/tmp/named.run
がオープンされていればクローズします。
(USR2 シグナルを用います。)
.TP
.B querylog
.B named
の ``query logging'' を、現在有効になっていれば無効へ、
現在無効になっていれば有効へ変更します。
(WINCH シグナルを用います。)
``query logging'' が有効になっている場合、
ネームサーバへの問い合わせ情報を
.BR syslog (3)
に記録します。
``query logging'' を有効にすると非常に多くの情報がログファイルに
記録されることに注意して下さい。この命令は
.BR qrylog
と指定することも可能です。
.TP
.B start
.B named
が実行中でなければ、実行を開始します。
.TP
.B stop
.B named
が実行中であれば、停止します。
.TP
.B restart
.B named
を停止させた後、再度実行します。
.SH バグ
.B named
への引数は、
.BR restart
では保存されず、
.BR start
では指定できません。
パラメータや環境を制御する何らかの方法が必要でしょう。
.PP
.BR sh (1)
スクリプトにより作成されています。
.SH 作者
Paul Vixie (Internet Software Consortium)
.SH 関連項目
named(8),
named.reload(8),
named.restart(8)
