freebsd/freebsd-doc/ja/man/man8/netboot.8
.\"	%Id: netboot.8,v 1.4 1997/09/29 19:11:29 wosch Exp %
.\" jpman %Id%
.\"
.\"	Japanese Translation made by Norihiro Kumagai, 12/5/97.
.\"	The translation is for the FreeBSD-jpman Project, convened
.\"	by Kazuo Horikawa.
.\" 
.Dd May 15, 1997
.Dt NETBOOT 8
.\".Os BSD 4
.Sh 名称
.Nm netboot
.Nd オペレーティングシステムのリモートブート
.Sh 書式
.Nm
.Bl -tag -width Ds
は、ネットワークカード経由でオペレーティングシステムをブートするために
用います。ブートプログラムは ROM に焼き込むか、DOS から起動します。
.Pp
.Sh 解説
.Nm
は、IPアドレス、カーネル名、ファイルシステム名などのパラメータを bootp 
サーバから読み込み、指定されたルートファイルシステムとスワップファイル
システムをマウントしようと試み、指定されたカーネルをルートファイル
システムから NFS バージョン2 プロトコルを使ってロードして、最後にその
カーネルに制御を移します。
.Pp
ただし、bootp サーバをきちんと設定しておく必要があります。
/etc/bootptab の設定の例を以下に示します。
.Bd -literal
  .default:\\
	:sm=255.255.255.0:\\
	:gw=your.gateway.ip:\\
	:hn:ht=ether:vm=rfc1048:\\
	:rp="rootfs.ip:/rootfs/path":\\
	:T128="swapfs.ip:/swapfs/path":\\
	:T129=swapsize:\\
	:T130="root,mount,options":\\
	:T131="swap,mount,options":\\
	:ra=255.255.255.255:
  client01:bf="kernel.300":ha=00400530d6d9:tc=.default:
  client02:bf="kernel.280":ha=00400530d6d3:tc=.default:
  ...
.Ed
.Pp
bootptab パラメータの正確な記述方法については、bootptab (5) を参照して
ください。
.Pp
このうち、
.Nm
のコードは以下のオプションを使用します。
.Bl -tag -width indent
.It Cm sm
サブネットマスクを指定します。
.It Cm gw
ゲートウェイの IP アドレスを指定します。
.It Cm hn
応答に含めて送るホスト名をbootp サーバに知らせます。
.It Cm ht= Ns Ar ether
.\.It ht=ether
ハードウェアがイーサネットであることを指定します。
.It Cm vm= Ns Ar rfc1048
rfc1048 拡張機能の使用を指定します。
.It Cm rp
ルートファイルシステムとしてマウントするディレクトリの場所を指定します。
サーバの IP アドレスの後ろに `:' とディレクトリのパス名を付けて指定する
必要があります。
.It Cm T128
スワップファイルを含むディレクトリの場所を指定します。サーバの IP
アドレスの後ろに `:' とディレクトリのパス名を付けて指定する必要があります。
実際にスワップファイルとして使用されるものは、swap.X.Y.Z.T (ここで、
X.Y.Z.T はクライアントの IP アドレスです) という名前を持つファイル
になります。この引数を指定する場合、該当するスワップファイルが必ず存在する
必要があります。
.It Cm T129
スワップファイルの大きさ(KB単位)を指定します。これは、16進8桁の数として
指定する必要があります。スワップが 16 MB の場合、T129=00004000
となります。この引数はオプションです。指定しない場合、スワップファイルの
大きさはサーバから読み込まれます。
.It Cm T130
ルートをマウントする際のオプション(soft, intr, tcp など)を指定します。
この引数はオプションです。デフォルトでは UDP を使います。
.It Cm T131
スワップをマウントする際のオプションを指定します。この引数はオプション
です。
.It Cm bf
カーネル名を指定します。指定しない場合、デフォルトとして "kernel" 
を使用します。
.It Cm ra
リプライアドレスを上書きするのに用います。

.Sh 関連ファイル
.Bl -tag -width /usr/mdec/nb3c509.rom -compact
.It Pa /usr/mdec/nb8390.rom
NE1000/NE2000 カード用の ROM イメージ。
.It Pa /usr/mdec/nb8390.com
NE1000/NE2000 カード用の DOS 実行形式ファイル。
.It Pa /usr/mdec/nb3c509.rom
3C509 カード用の ROM イメージ。
.It Pa /usr/mdec/nb3c509.com
3C509 カード用の DOS 実行形式ファイル。

.Sh 関連項目
.Xr bootptab 5 ,
.Xr bootpd 8

.Sh バグ
netboot を Western Digital/SMC や 3C503 カードで使用する場合、Makefile 
をちょっと触ってから再コンパイルする必要があります。
