freebsd/freebsd-doc/ja/man/man8/newfs.8
.\" Copyright (c) 1983, 1987, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)newfs.8	8.3 (Berkeley) 3/27/94
.\" jpman %Id: newfs.8,v 1.3 1997/07/26 22:02:06 horikawa Stab %
.\"
.Dd March 27, 1994
.Dt NEWFS 8
.Os BSD 4.2
.Sh 名称
.Nm newfs ,
.Nm mfs
.Nd 新しいファイルシステムを作成する
.Sh 書式
.Nm newfs
.Op Fl NO
.Op Fl S Ar sector-size
.Op Fl a Ar maxcontig
.Op Fl b Ar block-size
.Op Fl c Ar cylinders
.Op Fl d Ar rotdelay
.Op Fl e Ar maxbpg
.Op Fl f Ar frag-size
.Op Fl i Ar bytes
.Op Fl k Ar skew
.Op Fl l Ar interleave
.Op Fl m Ar free space
.Op Fl o Ar optimization
.Op Fl p Ar sectors
.Op Fl r Ar revolutions
.Op Fl s Ar size
.Op Fl t Ar tracks
.Op Fl u Ar sectors
.Op Fl x Ar sectors
.Ar special
.Nm mount_mfs
.Op Fl N
.Op Fl F Ar file
.Op Fl T Ar disktype
.Op Fl a Ar maxcontig
.Op Fl b Ar block-size
.Op Fl c Ar cylinders
.Op Fl d Ar rotdelay
.Op Fl e Ar maxbpg
.Op Fl f Ar frag-size
.Op Fl i Ar bytes
.Op Fl m Ar free space
.Op Fl o Ar options
.Op Fl s Ar size
.Ar special node
.Sh 解説
.Nm newfs
は、わかりにくい
.Xr mkfs 8
の代わりとなるものです。
.Nm newfs
や
.Nm mount_mfs
を走らせる前に、
.Xr disklabel 8
を使ってディスクラベルが書き込んでいなければなりません。
.Nm newfs
は、指定したスペシャルデバイスにファイルシステムを作成します。
デフォルト値はたいてい妥当な値となりますが、
.Nm newfs
にはこの値を変更するための数多くのオプションがあります。
.Pp
.Nm mount_mfs
は、仮想メモリ上にファイルシステムを構築し、指定したノード
にそのファイルシステムをマウントするために使います。
ファイルシステムがアンマウントされると、
.Nm mount_mfs
は終了し、このファイルシステムの内容は失われます。
.Nm mount_mfs
にシグナルが送られると、
ファイルシステムをアンマウントしようとします。たとえば、
シャットダウンする場合がこれにあたります。 
.Nm mount_mfs
に指定するパラメータは 
.Nm newfs
のものと同じです。
スペシャルファイルはディスクラベルを読むためにのみ使われ、
それによってメモリベースファイルシステムへのコンフィギュレーション
パラメータが得られます。
このスペシャルファイルは通常、第一スワップ領域を指定します。という
のは、フリーメモリが少なくなって、ファイルシステムをサポートす
るメモリ領域がページングされるとき、ファイルシステムがそこに
バックアップされるからです。
.Pp
以下のオプションにて一般的な配置方針を定義します。
.Bl -tag -width Fl
.It Fl T Ar disktype
過去のものとの互換性のためと
.Nm mount_mfs
のための物です。
.It Fl F Ar file
.Nm mount_mfs
は、ファイルシステムのイメージとしてこのファイルを使用します。
.Nm mount_mfs
が終了した時、このファイルは残されます。
.It Fl N
実際にはファイルシステムを構築せずに、ファイルシステム
パラメータの表示のみを行います。
.It Fl O
4.3BSD フォーマットのファイルシステムを作成します。この
オプションは、古いブート ROM が理解できるルートファイル
システムを使う必要がある場合に使います。
.It Fl a Ar maxconting
回転遅延 (rotational delay) を強制する前に
配置される連続ブロックの最大数を指定します (
.Fl d
オプションを参照)。
デフォルトは 1 です。このオプションをどのように設定す
るかについて、詳しくは
.Xr tunefs 8
を参照してください。
.It Fl b Ar block-size
ファイルシステムのブロックサイズをバイト単位で指定します。
.It Fl c Ar #cylinders/group
ファイルシステムのシリンダグループごとのシリンダ数を指定
します。デフォルトは 16 です。
.It Fl d Ar rotdelay
同じディスクに対する
ディスク転送完了割り込みサービスと新たな転送開始に費す時間の
期待値を指定します (ミリ秒単位)。デフォルトは0ミリ秒です。詳細は、
.Xr tunefs 8
を参照してください。
.It Fl e Ar maxbpg
単一のファイルが他のシリンダグループへまたがることを強制される前に、
1 つのシリンダグループから割り当てることのできる最大のブロック数を指定し
ます。デフォルト値は、シリンダグループのブロック数の約 1/4 です。この
オプションの詳細については、
.Xr tunefs 8
を参照してください。
.It Fl f Ar frag-size
ファイルシステムのフラグメントサイズをバイト単位で指定します。
.It Fl i Ar number of bytes per inode
ファイルシステム中の i ノードの密度を設定します。デフォルト
は、(4 * フラグメントサイズ) バイトのデータ領域ごとに1つの i ノードを作ります。
i ノード数を少なくしたい場合は大きな値を指定し、
i ノード数を多くしたい場合は小さな値を指定します。
.It Fl m Ar free space \&%
通常のユーザからは保護されている領域のパーセンテージを
指定します。
これは最低限の空き領域のしきい値となります。
デフォルト値は
.Ao Pa ufs/ffs/fs.h Ac
にて
.Dv MINFREE
と定義され、現在 8% です。
このオプションの詳細については、
.Xr tunefs 8
を参照してください。
.It Fl n Ar number of distinguished rotational positions
ディスク一回転あたりに確保する回転時間の数を設定します。デフォルトは 1 
で、回転位置テーブルを無効にすることを意味します。
.It Fl o Ar optimization\ preference
.Pq ``space'' か ``time''
ブロック確保に費す時間を最小にするか、
ディスク上のフラグメント領域を最小にするかを、
ファイルシステムに指示します。
デフォルトで minfree (前述) が 8% を下回る場合は、
領域の最小化が行われ、8% 以上ならば時間の最小化が行われます。
このオプションの詳細については、
.Xr tunefs 8
を参照してださい。
.It Fl s Ar size
ファイルシステムサイズをセクタ単位で指定します。
.El
.Pp
次のオプションは、ディスクジオメトリの標準設定を変更します。
デフォルトの値はディスクラベルから得られます。
これらの値を変更するのは、
最初にファイルシステムを構築したときとは異なるタイプのディスク上で
ロウイメージを使用してファイルシステムを構築するようなときだけです
(たとえば、ライトワンスディスク上など)。
これらの値をデフォルトの
値から変更すると、標準のスーパブロックが壊れたときに、
.Xr fsck 8
が代替のスーパブロックを見つけることができなくなるので注意して
ください。
.Bl -tag -width Fl
.It Fl S Ar sector-size
セクタサイズ (バイト単位) です (通常 512 以外は使用しません)。
.It Fl k Ar sector \&0 skew , per track
遅いコントローラを補うためにメディアのフォーマット時の補正を指定します。
トラックスキューは同じシリンダ上のトラック N のセクタ 0 とトラック N-1
のセクタ 0 のオフセットです。
.It Fl l Ar hardware sector interleave
遅いコントローラを補うためにメディアのフォーマット時の補正を指定します。
インタリーブはトラック毎の物理セクタのインタリーブで、次の比の分母で
定義されます:
.Dl 読まれるセクタ/通過するセクタ
つまりインタリーブの 1/1 は連続的に配置されていることを、 1/2 は論理
セクタ 0 と論理セクタ 1 との間に 1 セクタあることを示します。 
.It Fl p Ar spare sectors per track
予備セクタ (不良セクタと置き換えるセクタ) は、
各トラックの最後の物理セクタを使用します。
これらには、ファイルシステムとしてデータを割り当てることができないため、
セクタ/トラック
.Pq Fl u
に含まれません。
.It Fl r Ar revolutions/minute
1 分間あたりのディスク回転速度を指定します。
.It Fl t Ar #tracks/cylinder
ファイルシステムによってデータを割り当てることができるシリンダあたりの
トラック数です。デフォルトは 1 です。0 が設定された場合にはディスクラベル
に指定されている値が使われます。
.It Fl u Ar sectors/track
ファイルシステムによってデータを割り当てることができるトラックあたりの
セクタ数です。デフォルトは 4096 です。 0 が設定された場合にはディスクラベルに
指定されている値が使われます。この値には、各トラックの最後に確保
される不良ブロックの置き換えのための予備セクタは含まれません (
.Fl p
オプションを参照)。
.It Fl x Ar spare sectors per cylinder
予備セクタ (不良セクタと置き換えるセクタ) は、シリンダの最後のトラック
の物理セクタを使用します。これらには、ファイルシステムとしてデータを
割り当てることができないため、セクタ/トラック
.Pq Fl u
には含まれません。
.El
.Pp
.Nm mount_mfs
コマンドのオプションは、
.Fl o
オプションを除いて
.Nm newfs
コマンドと同じものです。
.Pp
.Fl o
オプションは以下のとおりです:
.Bl -tag -width indent
.It Fl o
.Fl o
フラグに続いて指定されるオプションは、コンマで区切られた文字列です。
指定できるオプションとその意味は
.Xr mount 8
を参照してください。
.El
.Sh 使用例
.Pp
.Dl mount_mfs -s=20480 -o nosuid,nodev /dev/sd0b /tmp
.Pp
.Xr mount 8
の nosuid と nodev のオプションを指定し、
10240 KB の大きさのメモリファイルシステムを /tmp にマウントします。
.Sh 関連項目
.Xr fdformat 1 ,
.Xr disktab 5 ,
.Xr fs 5 ,
.Xr disklabel 8 ,
.Xr diskpart 8 ,
.Xr dumpfs 8 ,
.Xr fsck 8 ,
.Xr mount 8 ,
.Xr scsiformat 8 ,
.Xr tunefs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T A Fast File System for UNIX ,
.%J ACM Transactions on Computer Systems 2
.%V 3
.%P pp 181-197
.%D August 1984
.%O (reprinted in the BSD System Manager's Manual)
.Re
.Sh 歴史
.Nm
コマンドは、
.Bx 4.2
から登場しています。
