freebsd/freebsd-doc/ja/man/man8/newlfs.8
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)newlfs.8	8.1 (Berkeley) 6/19/93
.\" jpman %Id: newlfs.8,v 1.3 1997/07/22 16:39:29 horikawa Stab %
.\"	%Id: newlfs.8,v 1.2.2.1 1997/03/03 07:01:35 mpp Exp %
.\"
.Dd June 19, 1993
.Dt NEWLFS 8
.Os BSD 4.4
.Sh 名称
.Nm newlfs
.Nd 新しい LFS ファイルシステムを作成する
.Sh 書式
.Nm newlfs
.Fl L
.Op Ar newlfs-options
.Ar special
.Sh 解説
.Nm newlfs
は、指定したスペシャルデバイスに、ディスクラベルに書かれている
デフォルトの情報にしたがって、ログ構造ファイルシステム (LFS) を
作成します
.Ns ( Nm newlfs
を実行する前には、
.Xr disklabel 8
を用いてディスクにディスクラベルをつける必要があります) 。
.Pp
以下のオプションで、全体的なレイアウトポリシーを定義できます。
.Bl -tag -width Fl
.It Fl B
ファイルシステムの論理セグメントサイズをバイト単位で指定します。
.It Fl b Ar block-size
ファイルシステムのブロックサイズをバイト単位で指定します。
.It Fl L
ログ構造ファイルシステム (LFS) を作成します。
現在のところ、このフラグが必要です。
.It Fl m Ar free space \&%
通常ユーザが使えないようにする領域の割合;
最小の空き領域のしきい値です。
デフォルト値は 10% です。
このオプションのさらに詳しい設定方法は
.Xr tunefs 8
を参照してください。
.It Fl s Ar size
ファイルシステムの大きさをセクタ単位で指定します。
.El
.Sh 関連項目
.Xr disktab 5 ,
.Xr fs 5 ,
.Xr disklabel 8 ,
.Xr diskpart 8 ,
.Xr dumplfs 8 ,
.Xr tunefs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T A Fast File System for UNIX ,
.%J ACM Transactions on Computer Systems 2
.%V 3
.%P pp 181-197
.%D August 1984
.%O (reprinted in the BSD System Manager's Manual)
.Re
.Sh バグ
LFS は現在、FreeBSD のどの種類でも動作しないので、使うべきではありません。
.Sh 歴史
.Nm
コマンドは
.Bx 4.4
から登場しました。
