freebsd/freebsd-doc/ja/man/man8/ppp.8
.\" %Id: ppp.8,v 1.19.2.32 1997/10/05 14:28:27 brian Exp %
.\" jpman %Id: ppp.8,v 1.4 1997/06/08 18:41:58 saeki Stab %
.Dd 20 September 1995
.Os FreeBSD
.Dt PPP 8
.Sh 名称
.Nm ppp
.Nd
PPP (Point to Point Protocol) (別名 iijppp)
.Sh 書式
.Nm
.Op Fl auto | background | ddial | direct | dedicated 
.Op Fl alias
.Op Ar system
.Sh 解説
本プログラムは、ユーザプロセスとして動作する
.Em PPP
パッケージです。
.Em PPP
は通常、(pppd でそうなっているように) カーネルの一部として実装されますが、
そのため、デバッグや動作の変更が少々難しい場合があります。
しかしながら、この実装ではトンネルデバイス (tun) を利用して、ユーザプロセスで
.Em PPP
を実現しています。

.Sh 主な特徴

.Bl -diag
.It 対話的なユーザインターフェースを提供
コマンドモードで利用する場合、ユーザがコマンドを
入力することで、簡単にリモートコンピュータとの接続の確立や接続状態の確認、
接続の解放を行なうことができます。
オプションとして、セキュリティ確保のために
すべての機能をパスワードで保護することができます。

.It 手動と自動でのダイアルをサポート
対話モードでは、直接モデムと通信できるように
.Dq term
コマンドが用意されています。
モデムがリモートホストと接続されて、
.Em PPP
での通信が始まったら、
.Em PPP
はそれを検出して自動的にパケットモードに移行します。
ひとたびリモートホストとの接続に必要なコマンドシーケンスがわかったら、
後々の接続を簡単にするため、必要なダイアル手順やログイン手順を定義した
チャットスクリプトを書くことができます。

.It オンデマンドでのダイアルアップをサポート
auto モード (自動モード) では
.Nm
はデーモンとして動作し、
.Em PPP
リンクを通して送られるパケットを待ちうけます。
パケットを検出すると、デーモンが自動的にダイアルを行なって接続を確立します。

ddial モード (専用モードまたはデーモンダイアルモード) でも
ほぼ同様に、自動ダイアルと接続の確立を行ないます。
しかしながらこのモードは、送るべきパケットが存在しない場合にも、
リンクが切れていることを検出するといつでもリモートへダイアルするという点が
auto モードと異なります。
このモードは、電話料金よりも常時接続されていることが重視される場合に有用です。

.It パケットエイリアシングをサポート
一般には IP マスカレードとして知られるパケットエイリアシングにより、
未登録でプライベートなネットワーク上のコンピュータからも
インターネットにアクセスすることが可能です。
.Em PPP
ホストはマスカレードゲートウェイとして動作します。
送信パケットの IP アドレスと TCP や UDP のポート番号は
どちらもエイリアスされ、返信パケットではエイリアスが元に戻されます。

.It バックグラウンド PPP 接続をサポート
バックグラウンドモードでは、接続を確立するのに成功した場合に
.Nm
はデーモンになります。
それ以外の場合はエラーで終了します。

.It サーバとしての PPP 接続をサポート
ダイレクトモードでは、
.Nm
は標準入力/標準出力からの
.Em PPP
接続を受け入れるサーバとして動作させることができます。

.It PAP と CHAP による認証をサポート

.It 代理 arp (Proxy Arp) をサポート
.Em PPP
がサーバとして動作している時、その接続について代理 arp を行なうよう
設定できます。

.It パケットのフィルタリングをサポート
ユーザは 4 種類のフィルタを定義できます。
.Em ifilter
は受信パケットに対するフィルタです。
.Em ofilter
は送信パケットに対するフィルタです。
.Em dfilter
はダイアルを行なうきっかけとなるパケットを定義するフィルタで、
.Em afilter
は接続を保持するためのパケットを定義するフィルタです。

.It トンネルドライバは bpf (Berkeley Packet Filter) をサポート
.Em PPP
リンクを流れるパケットを調べるために、
.Xr tcpdump 1
を使うことができます。

.It PPP over TCP をサポート

.It IETF ドラフトの Predictor-1 圧縮をサポート
.Nm
は VJ 圧縮の他に Predictor-1 圧縮もサポートしています。
モデムは通常 (たとえば v42.bis のような) 組み込みの圧縮機能を持っており、
その結果システムは 
.\"(訳注)「転送データレートよりも」をここにいれたいと考えています。
.\" 2.2.1R 対象(1997/04/02) Takeshi MUTOH <mutoh@info.nara-k.ac.jp>
より高いデータレートで通信できます。
これは一般には良いことですが、より高速のデータによってシリアル回線からの
割り込みが増加します。
システムはこの割り込みをモデムと通信して処理しなくてはならないため、
システムの負荷と遅延時間が増加することになります。
VJ 圧縮とは異なり、Predictor-1 圧縮はリンクを通る
.Em すべての
データをあらかじめ圧縮しておくことで、オーバヘッドを最小にします。

.It マイクロソフトの IPCP 拡張をサポート
マイクロソフトの
.Em PPP
スタックを使用するクライアント (つまり Win95, WinNT) との間で
ネームサーバのアドレスと NetBIOS ネームサーバのアドレスを
調停することができます。
.El

.Sh パーミッション
.Nm ppp
はユーザ
.Dv root
、グループ
.Dv network
、パーミッション
.Dv 4550
でインストールされます。
.Nm ppp
は、起動したユーザ ID が 0 でない場合には、
クライアントモードでは実行しません。
.Nm ppp
は、通常ユーザの場合には、
.Fl direct
モードで実行します。
しかし実行パーミッションの都合により、
このユーザはグループ
.Dv network
に属する必要があります。
通常ユーザとして実行するする場合には、
システムのルーティングテーブルを変更するために、
.Nm
はユーザ ID 0 に変わります。
全ての外部コマンド ("shell" や "!bg" で実行されます) は、
.Nm ppp
を起動したユーザ ID で実行されます。

.Sh 始める前に

最初に
.Nm
を実行する時には、いくつかの初期設定を整える必要があります。
まず、カーネルにトンネルデバイスが含まれていなければ
なりません (GENERIC カーネルではデフォルトで 1 つ含まれます)。
もし含まれていない場合や複数の tun インタフェースが必要な場合、
以下の行をカーネル設定ファイルに追加して、
カーネルを再構築する必要があります。

.Dl pseudo-device tun N

ここで
.Ar N
は
.Em PPP
接続を行ないたい最大の数です。

つぎに、
.Pa /dev
ディレクトリにトンネルデバイスのエントリ
.Pa /dev/tunN
があるかどうかを調べてください。
ここで
.Ar N
は、0 から始まる tun デバイスの番号です。
もし無いようならば、"MAKEDEV tunN" を実行すれば作ることができます。
これにより 0 から
.Ar N
までの tun デバイスが作成されます。

最後に、ログファイルを作成します。
.Nm ppp
は
.Xr syslog 3
を使用して情報をログします。通常のログファイル名は
.Pa /var/log/ppp.log
です。
このファイルに出力を行うためには、以下の行を
.Pa /etc/syslog.conf
ファイルに記述してください:

.Dl !ppp
.Dl *.*<TAB>/var/log/ppp.log

TAB と書かれている場所には、実際にはタブを入力します。
スペースを使うと、なにも知らされぬままこの行は無視されます。

ppp の実行形式にリンクを作成することにより、
複数の ppp ログファイルを持つことが可能です:

.Dl # cd /usr/sbin
.Dl # ln ppp ppp0

として
.Pa /etc/syslog.conf
で

.Dl !ppp0
.Dl *.* /var/log/ppp0.log

とします。
.Pa /etc/syslog.conf
を更新した後に、
.Nm syslogd
に
.Dv HUP
シグナルを送ることをお忘れなく。

.Sh 手動ダイアル

以下の例では、あなたのマシン名が
.Nm awfulhak
であるとして説明します。

ホスト名とパスワードを
.Pa /etc/ppp/ppp.secret
に設定している場合、help, passwd, quit コマンドしか実行できないでしょう。

.Bd -literal -offset indent
ppp on "your hostname"> help
 help    : Display this message
 passwd  : Password for security
 quit    : Quit the PPP program
ppp on awfulhak> pass <password>
.Ed

正しいパスワードを入力すると、プロンプトの "on" は "ON" に変わります。

.Bd -literal -offset indent
ppp ON awfulhak>
.Ed

ここで、モデムのデバイス名、スピードやパリティの設定、
CTS/RTS 信号を使うかどうか (デフォルトでは CTS/RTS が使用されます) を
指定できます。もしハードウェアが CTS/RTS 信号を持っていない場合
(これは ppp 可能な端末サーバに直接つなぐ場合に起こり得ます)、
.Nm
は そのポートを通してどんな出力も送らず、来るはずのない信号を待ち続けます。
したがって、直接接続で通信ができないような場合には、
ctsrts を off にしてみてください。

.Bd -literal -offset indent
ppp ON awfulhak> set line /dev/cuaa0
ppp ON awfulhak> set speed 38400
ppp ON awfulhak> set parity even
ppp ON awfulhak> set ctsrts on
ppp ON awfulhak> show modem

* モデム関連のパラメータが、ここに示されます *

ppp ON awfulhak>
.Ed

ここでは、直接モデムと通信するために term コマンドを使用可能です。

.Bd -literal -offset indent
ppp ON awfulhak> term
at
OK
atdt123456
CONNECT
login: ppp
Password:
Protocol: ppp
.Ed

相手が PPP で話しはじめると、
.Nm
はそれを自動的に検出してコマンドモードに戻ります。

.Bd -literal -offset indent
ppp ON awfulhak>
PPP ON awfulhak>
.Ed

これで接続されました!
プロンプトの
.Sq PPP
が大文字に変化して、接続されたことを知らせます。
show コマンドを使用すれば、どのように事態が進行しているのかが分ります:

.Bd -literal -offset indent
PPP ON awfulhak> show lcp
 
* LCP 関連の情報がここに表示されます *
 
PPP ON awfulhak> show ipcp
 
* IPCP 関連の情報がここに表示されます *
.Ed

この時点で、マシンは接続先に対するホスト単位のルート (host route)
を持っています。
これはリンクの相手のホストとのみ接続可能であるという意味です。
デフォルトルートのエントリ
(他のルーティングエントリを持たずに、全パケットを ppp リンクの相手に送る
ように、あなたのマシンに指示します)を追加したければ、
以下のコマンドを入力してください。

.Bd -literal -offset indent
PPP ON awfulhak> add 0 0 HISADDR
.Ed

.Sq HISADDR
という文字列は、相手側の IP アドレスを表します。
この変数は接続が確立して始めて使用可能となります。
よくある誤りとして、上記記述を
.Pa ppp.conf
ファイルに指定してしまうということがあります。
このファイルが読まれる時には、リモート IP アドレスは確立していませんので、
うまくいきません。

ここで、(ping, telnet, ftp のような) ネットワークアプリケーションを
別のウインドウで使用可能です。

使用可能コマンドの詳細は PPP コマンドリストの節を参照してください。

.Sh 自動ダイアル

自動ダイアルを行なうためには、 Dial と Login のチャットスクリプトを
用意しなければなりません。定義の例は
.Pa /etc/ppp/ppp.conf.sample
を見てください (ppp.conf の書式は非常に簡単です)。

.Bl -bullet -compact

.It
各行には一つのコマンドまたはラベル、コメントのいずれかが書かれます。

.It
.Sq #
で始まる行は、コメントとして扱われます。
.It
ラベルは行頭から始まり、最後にコロン (:) が続かなければなりません。

.It
コマンド行は、空白かタブで始まらなければなりません。

.El

.Pa ppp.conf
ファイルには少くとも
.Dq default
セクションが存在する必要があります。
このセクションは常に実行されます。
このファイルには 1 以上のセクションが含まれます。
セクション名は用途に応じて付けます。例えば、
.Dq MyISP
はあなたの ISP を表したり、
.Dq ppp-in
は入力の
.Nm
構成を表したります。

.Nm ppp
を立ち上げる際に、接続先のラベル名を指定可能です。
.Dq default
ラベルに関係づけられたコマンドが実行されてから、
接続先ラベルに関連づけられたコマンドが実行されます。
.Nm
を引数無しで起動した場合、
.Dq default
だけは実行されます。load コマンドを使用して、
.Pa ppp.conf
のセクションを手動でロード可能です:

.Bd -literal -offset indent
PPP ON awfulhak> load MyISP
.Ed

ひとたび接続が確立したなら、プロンプトの ppp は PPP に変わります:

.Bd -literal -offset indent
# ppp MyISP
...
ppp ON awfulhak> dial
dial OK!
login OK!
PPP ON awfulhak>
.Ed

もし
.Pa /etc/ppp/ppp.linkup
が存在していれば、
.Em PPP
接続が確立された時に、その内容が実行されます。
デフォルトルート追加については。
提供されている
.Pa /etc/ppp/ppp.conf.sample
の
.Dq pmdeman
の例を参照してください。
HISADDR という文字列はリモート側の IP アドレスを表しています。
同様に、接続が閉じられると、
.Pa /etc/ppp/ppp.linkdown
ファイルの内容が実行されます。

.Sh バックグラウンドダイアル

.Nm ppp
を使って非対話的に接続を確立したい場合 (たとえば
.Xr crontab(5) 
エントリや
.Xr at(1)
ジョブから使うような場合) には、
.Fl background
オプションを使います。この場合にも
.Pa /etc/ppp/ppp.conf
で定義された接続先のラベルを指定しなければなりません。
このラベルには
.Dq set ifaddr
コマンドが含まれ、
リモートの接続先の IP アドレスを定義する必要があります。(
.Pa /etc/ppp/ppp.conf.sample
参照。)

.Fl background
が指定された場合、
.Nm
はすぐに接続を確立しようとします。
複数の電話番号が指定された場合には、各電話番号が一回づつ試されます。
これらに失敗すると、
.Nm
は即座に終了し、0 でない終了コードを返します。

接続に成功すると
.Nm
はデーモンになり、呼び出し側に終了コード 0 を返します。
デーモンは、リモートシステムが接続を終了した場合、
もしくは
.Dv TERM
シグナルを受け取った場合に、自動的に終了します。

.Sh ダイアル・オンデマンド

デマンドダイアル機能は
.Fl auto
または
.Fl ddial
オプションにて有効にされます。この場合にも
.Pa /etc/ppp/ppp.conf
で定義された接続先のラベルを指定しなければなりません。
これには、リモート接続先の IP アドレスを指定するための
.Dq set ifaddr
コマンドも書かれていなければなりません (
.Pa /etc/ppp/ppp.conf.sample 
を参照してください)。

.Bd -literal -offset indent
# ppp -auto pmdemand
...
#
.Ed

.Fl auto
または
.Fl ddial
が指定された時に
.Nm
はデーモンとして動作しますが、以下のように診断ポートを
通じて設定を確認したり変更したりすることができます
(これは
.Fl background
や
.Fl direct
のモードでも可能です):

.Bd -literal -offset indent
# pppctl -v 3000 show ipcp
Password:
IPCP [OPEND]
  his side: xxxx
  ....
.Ed

現在
.Xr telnet 1
を使用して対話的に会話できます。

.Pp
それぞれの
.Nm
デーモンは "3000 + トンネルデバイス番号" で計算される番号のポートで
参照できます。

.Fl auto
モードにて
送信パケットが検出された時、
.Nm
は (チャットスクリプトにもとづいて) ダイアルを行ない、
通信相手に接続しようとします。
.Fl ddial
モードでは回線がダウンしていることが確認された場合にはいつでも
ダイアルが行なわれます。

接続に失敗したら、デフォルトの動作では 30 秒間待ち、
別の送信パケットが検出された時に接続しようとします。
この動作は
.Bd -literal -offset indent
set redial seconds|random[.nseconds|random] [dial_attempts]
.Ed
.Pp
によって変更することができます。
.Sq seconds
は、再び接続しようとするまでの秒数です。
引数が
.Sq random 
の場合には、待ち時間を 0 秒から 30 秒の間でランダムに選びます。
.Sq nseconds
は電話番号リストの中の次の番号をダイアルする前に待つ秒数です。(
.Dq set phone
コマンドを参照してください)。これのデフォルトは 3 秒です。
繰り返しますが、引数が
.Sq random 
の場合には、待ち時間を 0 秒から 30 秒の間でランダムに選びます。
.Sq dial_attempts
は、受け取った個々の送信パケットに対して、何回接続を試みるのかを示す
数字です。
このパラメータが省略された場合には、以前の値がそのまま使われます。
.Sq dial_attempts
に 0 が指定された場合には、
.Nm
は接続できるまでダイアルを続けます。
.Bd -literal -offset indent
set redial 10.3 4
.Ed
.Pp
は個々の送信パケットに対して 4 回接続を試み、
番号間の待ち時間が 3 秒で、すべての番号を試した後に
10 秒待つことをあらわします。
複数の電話番号が指定されている場合でも、トータルのダイアル回数は
4 回のままです。 (それぞれの番号を 4 回ダイアルするのではありません)。

リンクの両端が
.Nm
のデマンドダイアルモードを利用している場合は、
ダイアル間隔を変更しておくのが良いでしょう。
もし、リンクの両端が同じタイムアウト時間に設定されていて、
リンクが切れて両方に送信待ちのパケットがあった場合、
両方が同時に相手を呼び出しあうことになってしまいます。

場所によっては、シリアルリンクに信頼性がなく、
切れるべきでない時にキャリアが失われるかもしれません。
セッションの途中で予期せずキャリアが失われた場合、
.Nm
にリダイアルさせることができます。
.Bd -literal -offset indent
set reconnect timeout ntries
.Ed

このコマンドは、キャリアが失われた時に
.Ar timeout
秒待ってから
.Ar ntries
回まで接続を再確立するよう ppp に指示します。たとえば、
.Bd -literal -offset indent
set reconnect 3 5
.Ed

は、予期せぬキャリア喪失の際に
.Ar 3
秒待ってから再接続を試みるように
.Nm
に指示します。これは
.Nm
があきらめる前に
.Ar 5
回まで行なわれます。
ntries のデフォルト値はゼロ (再接続しない) です。
このオプションを使用する際には注意が必要です。
もしローカル側のタイムアウトがリモート側よりもわずかに長いと、
リモート側がタイムアウトにより回線を切断した場合に、
再接続機能が (指定した回数まで) 起動されてしまいます。

注: この文脈においては、多くの LQR を喪失するとキャリア喪失を引き起こし、
ひいては再接続を引き起こします。

.Fl background
フラグが指定された場合、接続が行なえるまで
すべての電話番号が最大一回ダイアルされます。
.Dq set redial
コマンドにて、リダイアル期間の後には、
再接続回数を指定します。
リダイアル値が指定した電話番号数より少ない場合、
指定した電話番号で使用されないものが出来ます。

プログラムを終了させるには、以下のように入力してください。

  PPP ON awfulhak> close
  ppp ON awfulhak> quit all

.Pp
.Dq quit
コマンドは telnet による接続を終了しますが、
プログラム自身は終了させません。
プログラムも終了させたい場合には、
.Dq quit all
を実行してください。

.Sh PPP 接続の受け入れ (方法その 1)

.Em PPP
接続要求を受け入れるには、以下の手順にしたがってください。

.Bl -enum
.It
モデムと、 (必要であれば) 
.Pa /etc/rc.serial
が正しく設定されていることを確認します。
.Bl -bullet -compact
.It
フロー制御にはハードフロー (CTS/RTS) を使います。
.It
モデムはエコーバックを行なわず (ATE0) 、コマンドの結果も報告しない (ATQ1) 
ように設定されていなければなりません。
.El

.It
モデムが接続されているポートで getty が起動されるように
.Pa /etc/ttys
を編集します。

たとえば、以下のように設定すれば良いでしょう。

.Dl ttyd1  "/usr/libexec/getty std.38400" dialup on secure

getty を起動するために init プロセスに
.Dv HUP
シグナルを送るのを
忘れないでください。

.Dl # kill -HUP 1

.It
接続するユーザのためのアカウントを用意します。
.Bd -literal
ppp:xxxx:66:66:PPP Login User:/home/ppp:/usr/local/bin/ppplogin
.Ed

.It
.Pa /usr/local/bin/ppplogin
ファイルを以下のような内容で作成します。
.Bd -literal -offset indent
#!/bin/sh -p
exec /usr/sbin/ppp -direct
.Ed

(さらに制御を行なうためにラベル名を指定することもできます。)

.Pp
ダイレクトモード (
.Fl direct )
では、
.Nm
は標準入力と標準出力を使って動作します。クライアント動作の
.Nm
と同様に、
.Nm pppctl
を使用するか、3000 番 + 現在のトンネルデバイス番号のポートに
.Nm telnet
することでコマンドモードでの制御が可能です。

.It
ネームサーバのアドレスと NetBIOS ネームサーバのアドレスを調停する、
マイクロソフトの IPCP 拡張のサポートを有効にするには、
.Dq enable msext
と
.Dq set ns pri-addr [sec-addr]
および
.Dq set nbns pri-addr [sec-addr]
を ppp.conf ファイルに追加します。

.El

.Sh PPP 接続の受け入れ (方法その 2)

この方法は、モデムの接続を扱うのに
.Em mgetty+sendfax
を使用するようにすすめている点が異なります。
最近のバージョン 0.99 では、
.Dq AUTO_PPP
オプションをつけてコンパイルすることで、クライアントが
ログインプロンプトに向かって PPP を話すのを検出することができます。

手順は以下の通りです:

.Bl -enum

.It
AUTO_PPP オプションが使えるように、バージョン 0.99 か
それ以降の mgetty+sendfax を入手、設定、インストールします。

.It
モデムが接続されているポートで mgetty が起動されるように
.Pa /etc/ttys
を編集します。
例えば、以下のように設定すれば良いでしょう:

.Dl cuaa1  "/usr/local/sbin/mgetty -s 57600"       dialup on

.It
接続するユーザのためのアカウントを用意します。
.Bd -literal
Pfred:xxxx:66:66:Fred's PPP:/home/ppp:/etc/ppp/ppp-dialup
.Ed

.It
以下のファイルをよく読んで、要点を理解してください。
.Pa /etc/ppp/sample.ppp-dialup
.Pa /etc/ppp/sample.ppp-pap-dialup
.Pa /etc/ppp/ppp.conf.sample
以下のようにすると ppp-pap-dialup が
.Pa /usr/local/etc/mgetty+sendfax/login.conf
から呼び出されます。

.Dl /AutoPPP/ -     -       /etc/ppp/ppp-pap-dialup
.El

.Sh PPP オーバ TCP (別名: トンネリング)

シリアルリンク上以外の ppp の使用方法として、
ホストとポートを指定することにより、
tcp 接続を使用することが可能です。

.Dl set device ui-gate:6669

シリアルデバイスをオープンする代りに、
.Nm
は指定されたマシンンの指定されたソケットへの tcp 接続をオープンします。
.Nm
は telnet プロトコルを使用しないこと、
telnet サーバと交渉できないことに注意を払うべきです。
受信マシン (ui-gate) 上に、
この ppp 接続を受信するポートを設定する必要があります。まず
.Pa /etc/services
を更新して、サービスを定義します:

.Dl ppp-in 6669/tcp # Incoming ppp connections over tcp

そして
.Pa /etc/inetd.conf
を更新して、このポートへの受信接続をどのように扱うかを inetd に指示します:

.Dl ppp-in stream tcp nowait root /usr/sbin/ppp ppp -direct ppp-in

.Pa /etc/inetd.conf
を更新した後には、
.Nm inetd
に
.Dv HUP
シグナルを送るのをお忘れなく。

ここではラベル名
.Dq ppp-in
を使用します。
ui-gate (受信側) の
.Pa /etc/ppp/ppp.conf
エントリは以下を含みます:

.Bd -literal -offset indent
ppp-in:
 set timeout 0
 set ifaddr 10.0.4.1 10.0.4.2
 add 10.0.1.0 255.255.255.0 10.0.4.1
.Ed

セキュリティのために PAP もしくは CHAP の設定をしたいかもしれません。
PAP を有効にするには以下の行を追加します:
.Bd -literal -offset indent
 enable PAP
.Ed
.Pp
また、以下のエントリを
.Pa /etc/ppp/ppp.secret
に作成する必要があります:
.Bd -literal -offset indent
MyAuthName MyAuthPasswd
.Ed
.Pp
awfulhak (起動側) の
.Pa /etc/ppp/ppp.conf
エントリは以下を含む必要があります:

.Bd -literal -offset indent
ui-gate:
 set escape 0xff
 set device ui-gate:ppp-in
 set dial
 set timeout 30 5 4 
 set log Phase Chat Connect Carrier hdlc LCP IPCP CCP tun
 set ifaddr 10.0.4.2 10.0.4.1
 add 10.0.2.0 255.255.255.0 10.0.4.2
.Ed
.Pp
PAP を有効にしようとしている場合、以下の設定も必要です:
.Bd -literal -offset indent
 set authname MyAuthName
 set authkey MyAuthKey
.Ed

我々は、
ui-gate に 10.0.4.1 のアドレスを割り当て、
awfulhak に 10.0.4.2 のアドレスを割り当てようとしています。

接続をオープンするためには、以下をタイプするだけで良いです。

.Dl awfulhak # ppp -background ui-gate

結果として、
awfulhak にはネットワーク 10.0.2.0/24 への新たな「ルート」が、
ui-gate にはネットワーク 10.0.1.0/24 への新たな「ルート」が、
tcp 接続経由でそれぞれ作成されます。

ネットワークは実質的にブリッジされます -
下にある tcp 接続はパブリックなネットワーク (例えばインターネット) を
またがっても良いです。
また 2 つのゲートウェイ間では ppp トラフィックは
概念的に tcp ストリーム中でカプセル化されます
(パケットがパケットに対応するわけではありません)。

この機構の大きな欠点は、同時に 2 つの「配送保証」機構が存在することです -
この 2 つとは、下の tcp ストリームと ppp リンク上で使用されるプロトコルであり、
おそらくまた tcp でしょう。
パケット喪失が起ると、両者はそれぞれの方法で喪失したパケットを再送しようと
するでしょう。

.Sh パケットエイリアシング

.Fl alias
コマンドラインオプションにより、パケットエイリアシングが有効になります。
これにより、ppp ホストがローカルエリアネットワークの他のコンピュータに対して
マスカレードゲートウェイとして動作するようになります。
送信される IP パケットは、まるで ppp ホストから来たかのようにエイリアスされ、
受信パケットは、それがローカルエリアネットワークの正しいマシンに
送られるようにエイリアスが戻されます。

パケットエイリアシングにより、
未登録でプライベートなサブネット上のコンピュータを
外部から見えないようにしつつ、
インターネットへアクセス可能とします。

一般に、ppp が正しく動作していることの確認は、
まず最初にパケットエイリアシングを禁止して行ないます。
次に
.Fl alias
オプションを有効にして、ppp ホストの上で (ウェブブラウザや telnet, ftp, ping, 
traceroute などの) ネットワークアプリケーションの動作を確認します。
最後に、LAN 上の別のコンピュータの上で同様なアプリケーションの
動作を確認することになります。

ppp ホストではネットワークアプリケーションが正しく動作するのに、
LAN 上の別のコンピュータでは動かないのであれば、マスカレードソフトウェアは
正しく動いているけれども、ホストが IP パケットをフォワーディングしないか、
ひょっとするとパケットが送られて来ていないかのどちらかです。
.Pa /etc/rc.conf
で IP フォワーディングが有効にされていることと、
他のコンピュータで ppp ホストがその LAN のゲートウェイとして
指定されていることを確認してください。

.Sh パケットのフィルタリング

この実装では、パケットのフィルタリングがサポートされています。
ifilter, ofilter, dfilter の 3 種類のフィルタがあります。
ここでは基本的なことについて書くことにします。

.Bl -bullet -compact
.It
フィルタ定義は以下のような構文になっています。

set filter-name rule-no action [src_addr/src_width] [dst_addr/dst_width]
[proto [src [lt|eq|gt] port ]] [dst [lt|eq|gt] port] [estab]
.Bl -enum
.It
.Sq filter-name
には、ifilter, ofilter, dfilter, afilter のうちのどれか一つを指定します。
.It
.Sq permit
と
.Sq deny
の二つの action があります。
もし、あるパケットが規則に一致した場合、
結びつけられた action が直ちに実行されます。
.It
.Sq src_width
と
.Sq dst_width
は、アドレスの範囲を表現するネットマスクのように働きます。
.It
.Sq proto
は icmp, udp, tcp のうちのいずれか一つです。
.It
.Sq port number
は数字で指定するか、
.Pa /etc/services
のサービス名で指定することができます。

.El

.It
各フィルタは規則 0 から始まり、20 個までの規則をもつことができます。
規則の集合は、規則 0 が定義されていなければ、有効にはなりません。
すなわち、デフォルトでは全てが通されます。

.It
パケットにマッチする規則が無い場合は、パケットは破棄 (ブロック) されます。

.It
すべての規則を消去するには、
.Dq set filter-name -1
を使ってください。

.El

.Pa /etc/ppp/ppp.conf.filter.example
を参照してください。


.Sh アイドルタイマ、回線品質要求タイマ、リトライタイマの設定

アイドルタイマを調べたり/設定するためには、それぞれ
.Dq show timeout
と
.Dq set timeout [lqrtimer [retrytimer]]
コマンドを使ってください:

.Bd -literal -offset indent
ppp ON awfulhak> set timeout 600
.Ed

タイムアウト時間は秒数で指定します。デフォルト値は timeout が 180 秒
 (3 分)、lprtimer が 30 秒、 retrytimer が 3 秒です。
アイドルタイマ機能を使わないようにするためには、
.Bd -literal -offset indent
ppp ON awfulhak> set timeout 0
.Ed
コマンドを利用してください。

.Fl auto
モードでは、アイドルタイムアウトが発生すると
.Nm
プログラムは実行したままで
.Em PPP
セッションを終了します。別の引金となるパケットがきた時に
リンクを再び確立しようとします。

.Sh Predictor-1 圧縮

このバージョンでは、現在の IETF ドラフトに基づいた CCP および Predictor type 1
圧縮をサポートしています。
デフォルトの動作として、
.Nm
は、接続相手が同意 (あるいは要求) した場合に、
この機能を使おうと (もしくは受け入れようと) します。

完全に CCP/predictor 機能を停止するためには、
.Dq disable pred1
と
.Dq deny pred1
コマンドを使ってください。

.Sh IP アドレスの制御

.Nm
は IP アドレスの調停のために IPCP を使います。接続の両側は、自分が
使おうとするアドレスを提示し、要求された IP アドレスが受け入れ可能な
ものであれば、相手に ACK (肯定応答) を返します。
受け入れることができなければ、別の IP アドレスの使用を促すために
.Nm
は相手に NAK (否定応答) を返します。
接続の両側が受け取った要求に同意し (ACK を送っ) た時、
IPCP はオープン状態にセットされ、ネットワーク層での接続が確立されます。

IPCP の動作を制御するために、この実装はローカルとリモートの IP 
アドレスを定義するための
.Dq set ifaddr
コマンドを持っています。

.Bd -literal -offset indent
set ifaddr [src_addr [dst_addr [netmask [trigger_addr]]]]
.Ed

ここで、
.Sq src_addr
はローカル側で使おうと思っている IP アドレスで、
.Sq dst_addr
はリモート側が使用すべき IP アドレスです。
.Sq netmask
は使用すべきネットマスクです。
.Sq src_addr
と
.Sq dst_addr
のデフォルトは 0.0.0.0 であり、
.Sq netmask
のデフォルトは
.Sq src_addr
に適したマスク値です。
.Sq netmask
は小さくすることのみ可能です。便利な値は 255.255.255.255 でしょう。
誤った ppp の実装には、接続ネゴシエーションのために、
.Sq src_addr
ではなく特別な IP アドレスを使用しなければならないものがあります。
この場合、
.Sq trg_addr
で指定した IP アドレスが使用されます。
相手がこの提案された番号に同意しない限り、
ルーティングテーブルには影響しません。

.Bd -literal -offset indent
set ifaddr 192.244.177.38 192.244.177.2 255.255.255.255 0.0.0.0
.Ed

上の例は、
.Bl -bullet -compact
.It
自分の IP アドレスとしてまず 0.0.0.0 を提案しますが、
アドレス 192.244.177.38 のみは受け付けます。

.It
相手側のアドレスとして 192.244.177.2 を使うように要求し，
192.244.177.2 以外のどんなアドレスを使うことも許可しません。
相手側が別の IP アドレスを要求してきた時は、いつでも
192.244.177.2 を提案します。

.It
ルーティングテーブルのネットマスク値は 0xffffffff に設定されます。
.El

これは、両側が既に決まった IP アドレスを持っている場合には
うまくいきますが、多くの場合、一方がすべての IP アドレスを制御する
サーバとして動作しており、もう一方はその方針に従わなくてはなりません。

より柔軟な動作をさせるために、`ifaddr' 変数の IP アドレス指定を
もっと緩やかにすることが可能です:

.Dl set ifaddr 192.244.177.38/24 192.244.177.2/20

スラッシュ (/) に続く数字は、この IP アドレスで意味のあるビットの数を
表現しています。上の例は以下のことを示しています。

.Bl -bullet -compact
.It
可能なら自分のアドレスとして 192.244.177.38 を使おうとしますが、
192.244.177.0 から 192.244.177.255 の間の任意の IP アドレスも受け入れます。

.It
相手のアドレスとして 192.244.177.2 を使うことを希望しますが、
192.244.176.0 から 192.244.191.255 の間の任意の IP アドレスも許可します。

.It
すでにお気づきと思いますが、 192.244.177.2 は 192.244.177.2/32 と書くことと
等価です。

.It
例外として、0 は 0.0.0.0/0 と等価であり、希望する IP アドレスは
特に無く、リモート接続先の選択に従うことを意味します。
0 を使用した場合は、接続が確立するまで、ルーティングテーブルエントリは
まったく設定されません。

.It
192.244.177.2/0 は、どんな IP アドレスでも受け入れる/許可することを
意味しますが、最初に 192.244.177.2 を使うように提案します。
.El

.Sh インターネットサービスプロバイダと接続する

プロバイダに接続する際には、以下のステップを踏む必要があるでしょう。

.Bl -enum
.It
.Dq set phone
コマンドを使って、ダイアルスクリプトにプロバイダの電話番号を記述します。
ダイアルやリダイアルに使用する電話番号は、
パイプ (|) またはコロン (:) で区切って
複数指定することができます。たとえば、以下のようになります。
.Bd -literal -offset indent
set phone "111[|222]...[:333[|444]...]...
.Ed
最初のパイプで区切られたリストの番号は、
直前の番号でダイアルもしくはログインスクリプトが失敗した場合のみ使用されます。
コロンで区切られた番号は、直前の番号の使用によりなにが起ったのかにかかわらず、
この順番で使用されます。例えば:
.Bd -literal -offset indent
set phone "1234567|2345678:3456789|4567890"
.Ed
.Pp
この場合、まず 1234567 にダイアルしてみます。
ダイアルもしくはログインスクリプトに失敗したら、
次は 2345678 を使用します。
しかしこれはダイアルもしくはログインスクリプトに失敗したとき「のみ」です。
このダイアルの後、3456789 が使用されます。
4567890 は 345689 でダイアルもしくはログインスクリプトに失敗したときのみ
使用されます。
2345678 のログインスクリプトが失敗したとしても、次の番号は 3456789 です。
必要な数だけ、パイプとコロンを使用可能です
(しかし、通常はパイプのみかコロンのみの使用となるでしょう)。
次の番号へのリダイアルまでのタイムアウトは、全ての番号にて使用されます。
リストが終了すると、
通常のリダイアル期間だけ待ち、
最初から再開します。

.Dq set dial
コマンドの \\\\T 文字列は選択された番号で置きかえられます。
(以下を参照してください)。

.It
リダイアルに関する設定は、
.Dq set redial
で行ないます。
たとえば回線の調子が悪かったり、 (最近では 
それほど多くないでしょうが) プロバイダがいつも話中だったりすると、
以下のように設定したくなるかもしれません。
.Bd -literal -offset indent
set redial 10 4
.Ed
.Pp
これは最初の番号にリダイアルを行なう前に 10 秒待って、
4 回までダイアルしてみるという意味になります。

.It
.Dq set dial
と
.Dq set login
コマンドを使ってログイン手続きを記述します。
.Dq set dial
コマンドはモデムと通信してプロバイダへのリンクを確立するのに使われます。
たとえば、以下のようになります。
.Bd -literal -offset indent
set dial "ABORT BUSY ABORT NO\\\\sCARRIER TIMEOUT 4 \\"\\" ATZ OK-ATZ-OK ATDT\\\\T TIMEOUT 60 CONNECT"
.Ed
.Pp
このモデム「チャット」文字列の意味は以下の通りです。

.Bl -bullet
.It
"BUSY" または "NO CARRIER" を受信した場合には処理を中止します。
.It
タイムアウトを 4 秒にセットします。
.It
文字列の受信待ちは行ないません。
.It
ATZ を送信します。
.It
OK の受信待ちを行ないます。もし受信できなければ、
もう一度 ATZ を送信し、OK の受信待ちを行ないます。
.It
ATDTxxxxxxx を送信します。xxxxxxx は
上の電話番号リストの中の、次にダイアルする番号です。
.It
タイムアウトを 60 にセットします。
.It
文字列 CONNECT の受信待ちを行ないます。
.El

一旦接続が確立されると、ログインスクリプトが実行されます。
このスクリプトはダイアルスクリプトと同じスタイルで書かれます。
.Bd -literal -offset indent
set login "TIMEOUT 15 login:-\\\\r-login: awfulhak word: xxx ocol: PPP HELLO"
.Ed
.Pp
このログイン「チャット」文字列の意味は以下の通りです。

.Bl -bullet
.It
タイムアウトを 15 秒にセットします。
.It
"login:" の受信待ちを行ないます。もし受信できなければ
改行文字を送信して、再び "login:" の受信待ちを行ないます。
.It
"awfulhak" を送信します。
.It
"word:" ("Password:" プロンプトの末尾) の受信待ちを行ないます。
.It
"xxx" を送信します。
.It
"ocol:" ("Protocol:" プロンプトの末尾) の受信待ちを行ないます。
.It
"PPP" を送信します。
.It
"HELLO" の受信待ちを行ないます。
.El
.Pp
ログインスクリプトはプロバイダによって大きく違うものになるでしょう。

.It
シリアル回線と通信速度を指定するためには
.Dq set line
と
.Dq set speed
を使います。たとえば以下のようになります。
.Bd -literal -offset indent
set line /dev/cuaa0
set sp 115200
.Ed
.Pp
FreeBSD では cuaa0 が一つめのシリアルポートになります。
OpenBSD で
.Nm
を実行している場合には cua00 が一つめです。
あなたのモデムが 28800 かそれ以上のビットレートで通信することが
できるなら、シリアルポートの速度には 115200 を指定しておくべきでしょう。
一般に、シリアルポートの速度はモデムの速度の約 4 倍にしておきます。

.It
.Dq set ifaddr
コマンドで IP アドレスを定義します。
.Bl -bullet
.It
プロバイダがどの IP アドレスを使っているのか知っている場合には、
それをリモートアドレス (dst_addr) として使ってください。
知らない場合には、10.0.0.2/0 か何かを使ってください (以下を参照してください)。
.It
特定の IP アドレスをプロバイダから割り当てられている場合は、
それをローカルアドレス (src_addr) として使ってください。
.It
プロバイダが IP アドレスを動的に割り当てる場合は、適当に控えめで
緩やかに記述した IP アドレスをローカルアドレスに選んでください。
10.0.0.1/0 が適切でしょう。
/ に続く数値は、このアドレスのうち何ビットを重視しているかを示します。
もしもクラス C のネットワーク 1.2.3.0 上のアドレスを使うことを
主張したいのなら、1.2.3.1/24 と指定することができます。
.It
ISP があなたが提示した最初の IP 番号を受け付ける場合、
第 3, 4 の引数に
.Dq 0.0.0.0
を指定してください。
これにより ISP が番号を割当てます。
(3 つめの引数は、
.Sq src_addr
に対してデフォルトのマスクよりも制約が緩いため、無視されます。)
.El
.Pp
自分の IP アドレスもプロバイダの IP アドレスも
知らない場合には、以下の例のようにするとよいでしょう。
.Bd -literal -offset indent
set ifaddr 10.10.10.10/0 10.10.11.11/0 0.0.0.0 0.0.0.0
.Ed

.It
ほとんどの場合、プロバイダはデフォルトルータでもあるでしょう。
この場合、以下の行を
.Pa ppp.conf
に追加します。

.Bd -literal -offset indent
delete ALL
add 0 0 HISADDR
.Ed

.Pp
これは、
.Nm
が使用している tun インタフェースに関連する直接ではない
ルーティングエントリを削除して、
それから 10.10.11.11 をデフォルトルートとして追加するよう
.Nm
に指示します。
.Pp
もし動的 IP アドレスを使うのであれば、以下の 2 行を
.Pa ppp.linkup
ファイルに追加しておかなければなりません:

.Bd -literal -offset indent
delete ALL
add 0 0 HISADDR
.Ed

HISADDR は「相手」の IP 番号を意味するマクロです。
使用する IP 番号に関して、
(IPCP を使用して) 合意されて始めて、使用可能です。
一旦接続が確立されると、
.Nm
は直接ではないインタフェースのルートを全て削除し、
デフォルトルートが相手の IP 番号を差すように設定します。
.Pa ppp.conf
で使ったのと同じラベルを使用してください。
.Pp
もしコマンドを対話的に入力しているのであれば、接続に成功した後で
.Bd -literal -offset indent
add 0 0 HISADDR
.Ed
.Pp
とタイプするだけで充分です。

.It
プロバイダが PAP/CHAP による認証を要求している場合は、
.Pa ppp.conf
ファイルに以下の行を追加してください。
.Bd -literal -offset indent
set authname MyName
set authkey MyPassword
.Ed
.Pp
デフォルトではどちらも受け付けられますので、ISP が何を要求しても大丈夫です。
.El

現実の例を見たい場合には、
.Pa /etc/ppp/ppp.conf.sample
と
.Pa /etc/ppp/ppp.linkup.sample
を参照してください。
ラベル pmdemand は、ほとんどのプロバイダで使用できるでしょう。

.Sh ログ機能

.Nm
は以下のログ情報を
.Xr syslog 3
経由で出力することができます。

.Bl -column SMMMMMM -offset indent
.It Li Async	非同期レベルパケットの 16 進ダンプ
.It Li Carrier	'CARRIER' まで含めたチャットログの生成
.It Li CCP	CCP パケットトレースの生成
.It Li Chat	チャットスクリプトのトレースログの生成
.It Li Command	コマンド実行のログ
.It Li Connect	完全なチャットログの生成
.It Li Debug	(非常に長い)デバッグ情報のログ
.It Li HDLC	HDLC パケットの 16 進ダンプ
.It Li IPCP	IPCP パケットトレースの生成
.It Li LCP	LCP パケットトレースの生成
.It Li Link	アドレスの割当およびリンクの確立、解放イベントのログ
.It Li LQM	LQR レポートの生成
.It Li Phase	フェイズ遷移ログの出力
.It Li TCP/IP	全 TCP/IP パケットのダンプ
.It Li TUN	ログの各行に tun デバイスを含めます
.It Li Warning	ターミナルデバイスへの出力。ターミナルが存在しない場合は、LOG_WARNING を使用してファイルに送ります。
.It Li Error	ターミナルデバイスとログファイルへの出力で、LOG_ERROR を使用します。
.It Li Alert	ログファイルへの出力で、LOG_ALERT を使用します。
.El

.Dq set log
コマンドで、ログの出力レベルを設定することができます。
また、複数のレベルを指定することも可能です。
デフォルトは、
.Dq set log Carrier Link Phase 
です。

.Dq set log
への最初の引数が '+' か  '-' の文字で始まる場合、
現在のログレベルを消去せずに修正します。例えば:

.Bd -literal -offset indent
PPP ON awfulhak> show log
Log: Carrier Link Phase
PPP ON awfulhak> set log -Link +tcp/ip
PPP ON awfulhak> show log
Log: Carrier Phase TCP/IP
.Ed

レベル Warning, Error, Alert のメッセージログは
.Dq set log
では制御できません。

.Sh シグナルハンドリング

.Nm ppp
は以下のシグナルを扱います:

.Bl -tag -width 20
.It INT
このシグナルを受信すると、現在の接続がもしあればそれを終了します。
.Fl auto
もしくは
.Fl ddial
のモードではない場合、
.Nm
は終了します。

.It HUP, TERM, QUIT
.Nm
を終了させます。

.It USR1
対話モードではない場合、
.Nm
にサーバソケットが存在する場合にはそれらをクローズさせ、
デフォルトのポート番号選択規則で選んだインターネットソケットを
オープンさせます - このポートは 3000 + トンネルデバイス番号です。

.El

.Sh PPP コマンドリスト

この節では利用可能コマンドとその効果をリストします。
ppp セッションで対話的に使用することも、
コンフィギュレーションファイルで指定することも、
telnet セッションで指定することも可能です。

.Bl -tag -width 20
.It accept|deny|enable|disable option....
これらのディレクティブは
最初の接続においてどのように相手と交渉するかを
.Nm
に指示します。各
.Dq option
には、accept/deny および enable/disable のデフォルトを持ちます。
.Dq accept
は相手がこのオプションを要求したら、ACK を送ることを意味します。
.Dq deny
は相手がこのオプションを要求したら、NACK を送ることを意味します。
.Dq enable
はこのオプションを当方が要求することを意味します。
.Dq disable
はこのオプションを当方が要求しないことを意味します。
.Pp
.Dq option
は以下のいずれかです:

.Bl -tag -width 20
.It vjcomp
デフォルト: enable かつ accept。
このオプションは Van Jacobson ヘッダ圧縮を使用するかどうかを決定します。

.It lqr
デフォルト: disable かつ accept。
このオプションはリンク品質要求 (Link Quality Request) を送信するかどうかを
決定します。
LQR は、モデムのキャリア検出を使用せずに、リンクダウンを
.Nm
に決定させるプロトコルです。

.It chap
デフォルト: disable かつ accept。
CHAP はチャレンジ交換承認プロトコル
(Challenge Handshake Authentication Protocol) を意味します。
CHAP もしくは PAP (後述) のどちらか一方のみ交渉可能です。
CHAP では、承認者は「チャレンジ」メッセージを相手に送ります。
相手は一方向ハッシュ関数を使用して「チャレンジ」を暗号化し、
結果を送り返します。
承認者は同じことを行い結果を比較します。
この機構の利点は、接続を介してパスワードを送らないことです。

接続が最初に確立する時にチャレンジが行われます。
更なるチャレンジが行われるかもしれません。
相手の承認を行いたい場合は、
.Dq enable chap
を
.Pa ppp.conf
に書き、相手のエントリを
.Pa ppp.secret
に書く必要があります。
.Pp
クライアントとして CHAP を使用する場合、
.Dq AuthName
と
.Dq AuthKey
を
.Pa ppp.conf
に指定するだけで良いです。
CHAP はデフォルトで accept されます。

.It pap
デフォルト: disable かつ accept。
PAP はパスワード承認プロトコル (Password Authentication Protocol) を
意味します。
CHAP (前述) もしくは PAP のどちらか一方のみ交渉可能です。
PAP では、ID とパスワードが相手に送られ続け、
承認されるか接続が終了されるかまでこれが続きます。
これは比較的良くないセキュリティ機構です。
接続が最初に確立した時のみ実行可能です。

相手の承認を行いたい場合は、
.Dq enable pap
を
.Pa ppp.conf
に書き、相手のエントリを
.Pa ppp.secret
に書く必要があります (ただし、後述の
.Dq passwdauth
オプションを参照)。
.Pp
クライアントとして PAP を使用する場合、
.Dq AuthName
と
.Dq AuthKey
を
.Pa ppp.conf
に指定するだけで良いです。
PAP はデフォルトで accept されます。

.It acfcomp
デフォルト: enable かつ accept。
ACFComp はアドレスおよびコントロールフィールド圧縮
(Address and Control Field Compression) を意味します。
LCP パケット以外は非常に良く似たフィールトを持ちますので、
簡単に圧縮可能です。

.It protocomp
デフォルト: enable かつ accept。
このオプションは PFC (プロトコルフィールド圧縮)
の交渉を行うために使用されます。
この機構により、
プロトコルフィールドが 2 オクテッドから 1 オクテッドに減ります。

.It pred1
デフォルト: enable かつ accept。
このオプションは Predictor 1 圧縮を使用するかどうかを決定します。

.It msext
デフォルト: disable。
このオプションは Microsoft の ppp 拡張を使用を許可します。
これにより、Microsoft PPP DNS と Microsoft NetBIOS NS をサポートします。
このオプションを有効にすることにより、"set ns" と "set nbns" で
与えられる値を渡せるようになります。

.El
以下のオプションは、実際には相手と交渉しません。
それゆえ accept および deny は意味を持ちません。

.Bl -tag -width 20
.It proxy
デフォルト: disable。
このオプションを指定することにより、
.Nm
に相手へのプロクシ ARP をさせます。

.It passwdauth
デフォルト: disable。
このオプションを指定することにより、
PAP 承認コードが呼び出し側を承認する時に、
.Pa ppp.secret
ファイルではなく
.Pa passwd
ファイルを使用させます。

.It utmp
デフォルト: enable。
通常ユーザが PAP もしくは CHAP で承認された時で、
.Nm
が
.Fl direct
モードで実行されている時は、このユーザのエントリが
utmp ファイルおよび wtmp ファイルに作成されます。
このオプションを disable すると、utmp および wtmp のエントリは作成されません。
通常、
ユーザがログインしかつ承認することを要求する場合のみ必要です。

.El

.It add dest mask gateway
.Dq dest
は宛先 IP アドレスであり、
.Dq mask
はそのマスクです。
.Dq 0 0
はデフォルトルートを意味します。
.Dq gateway
は、
.Dq dest
マシン/ネットワークに至る、次のホップのゲートウェイです。

.It [!]bg command
指定したコマンドをバックグラウンドで実行します。
擬似引数
.Dv HISADDR ,
.Dv INTERFACE ,
.Dv MYADDR
は適切な値に置き換えられます。
コマンド実行中に
.Nm
を停止させたい場合は、
.Dv shell
コマンドを使用してください。

.It close
現在の接続をクローズします (が終了しません)。

.It delete ALL | dest [gateway [mask]]
.Dq ALL
が指定された場合、
.Nm
が使用中のインタフェースの非直接エントリが全て削除されます。
tunX のエントリで実際のリンク以外を削除することを意味します。
.Dq ALL
を使用しない場合、宛先
.Dq dest
、宛先ネットワーク
.Dq mask
.Dq gateway
へのルートが削除されます。
デフォルトの
.Dq mask
の値は 0.0.0.0 です

.It dial|call [remote]
.Dq remote
が指定されている場合、
.Dq remote
システムへの接続が
.Dq dial
および
.Dq login
スクリプトを使用して確立されます。
そうでない場合、現在の設定が使用されて接続が確立されます。

.It display
上述
.Dq accept|deny|enable|disable option....
で指定された、交渉可能な値の現在の状態を表示します。

.It passwd pass
全ての
.Nm
コマンドセットにアクセスするために要求されるパスワードを指定します。

.It load [remote]
指定された
.Dq remote
ラベルをロードします。
.Dq remote
が指定されない場合、
.Dq default
ラベルが仮定されます。

.It save
このオプションは (まだ) 実装されていません。

.It set[up] var value
このオプションは以下の変数の設定のために使用します:

.Bl -tag -width 20
.It set accmap hex-value
ACCMap は非同期制御文字マップ (Asyncronous Control Character Map) を
意味します。
これはいつも相手と交渉され、デフォルト値は 0x00000000 です。
このプロトコルが必要なのは、
特定の文字 (XON/XOFF など) を終点間で受渡すことに依存するハードウェアを
使用する場合です。

.It set filter-name rule-no action [src_addr/src_width]
[dst_addr/dst_width] [proto [src [lt|eq|gt] port ]]
[dst [lt|eq|gt] port] [estab]
.Pp
.Nm ppp
は 4 つのフィルタセットをサポートします。
afilter は接続を維持 - アイドルタイマをリセット - 
するためのパケットを指定します。
dfilter は 
.Fl auto
モードにおいて
.Nm
にリダイアルさせるパケットを指定します。
ifilter はマシンに入力可能なパケットを指定します。
ofilter はマシンから出力可能なパケットを指定します。
デフォルトでは全てのフィルタが全パケットを通過させる値に設定されます。

ルールは
.Dq n
に従って順番に処理されます。
各セットに対し 20 までのルールを指定可能です。
指定されるセットにおけるどのルールにもマッチしないパケットは破棄されます。
ifilter と ofilter では、パケットをドロップすることを意味します。
afilter では、アイドルタイマをリセットしないことを意味します。
dfilter ではダイアルさせることにはならないことを意味します。

上述のパケットのフィルタリングの節を参照してください。

.It set authkey|key value
クライアントモードでの PAP または CHAP の交渉で使用される
認証キー (もしくはパスワード) を、指定した値に設定します。
ダイアルもしくはログインスクリプトで使用されるパスワードを指定しますが、
実際のパスワードがログされることを防ぎます。

.It set authname id
クライアントモードでの PAP または CHAP の交渉で使用される
認証 ID を設定します。

.It set ctsrts
ハードウェアフロー制御をセットします。
これがデフォルトです。

.It set device|line value
ppp が使用するデバイスを指定する
.Dq value
に設定します。
全シリアルデバイス名は
.Pa /dev/
から始まることが仮定されています。
.Dq value
が
.Pa /dev/
から始まらない場合、
.Dq host:port
の形式である必要があります。
この場合、
.Nm
指定された
.Dq host
の指定された
.Dq port
と接続しようとします。
詳細は上述の PPP オーバ TCP の節を参照してください。

.It set dial chat-script
相手へダイアルする際に使用されるチャットスクリプトを指定します。
後述の
.Dv set login
コマンドも参照してください。
チャットスクリプトのフォーマットの詳細については、
.Xr chat 8
とコンフィギュレーションファイルの例を参照してください。
文字列 \\\\T は現在の電話番号に置換されます (後述の
.Dq set phone
参照) 。
文字列 \\\\P はパスワードに置換されます (後述の
.Dq set key
参照) 。

.It set hangup chat-script
モデムをクローズする前にこれをリセットする時に使用する、
チャットスクリプトを指定します。

.It set escape value...
このオプションは上述の
.Dq set accmap
オプションに似ています。
リンクを経由する時に「エスケープ」される文字を指定するために使用します。

.It set ifaddr [myaddr [hisaddr [netmask [triggeraddr]]]]
このコマンドは、IPCP 交渉の間使用される IP アドレスを指定します。
アドレスのフォーマットは以下の通りです。

.Dl a.b.c.d/n

a.b.c.d は IP アドレスであり、
n はこのうち何ビットが有効であるかを示します。
もし /n ビットが省略された場合、デフォルトの /32 になります。
ただし IP アドレスが 0.0.0.0 である場合には、マスクのデフォルトは /0 です。

.Dq triggeraddr
が指定された場合、この値が
.Dq myaddr
の代りに IPCP 交渉で使用されます。
ただし、
.Dq myaddr
の範囲のアドレスのみ受け入れられます。

.It set loopback on|off
.Dq on
に設定された場合 (デフォルトです)、
宛先アドレスが ppp インタフェースのアドレスと同一の送出パケットを、
.Nm
は自動的にループバックさせます。
.Dq off
に設定された場合、
.Nm
はパケットを送信します。
この場合おそらく相手方で ICMP リダイレクトが発生します。

.It set log [+|-]value...
このコマンドにより現在のログレベルを修正できます。
詳細はログ機能の節を参照してください。

.It set login chat-script
このチャットスクリプトはダイアルスクリプトを補います。
もし両方が指定された場合、ダイアルスクリプトの後で、
ログインスクリプトが実行されます。
ダイアルスクリプト中で使用可能なエスケープシーケンスはここでも使用可能です。

.It set mru value
デフォルトの MRU は 1500 です。
この値を増加させた場合、相手は MTU を増加させても *かまいません*。
デフォルトの MRU より減らすことは意味がありません。
なぜなら、PPP プロトコルでは少なくとも 1500 オクテッドのパケットを
受信できなければ *ならない* からです。

.It set mtu value
デフォルトの MTU は 1500 です。
相手が指定した MRU によって増加させることができます。
MTU はこのオプションによってのみ減らすことが可能です。
この値を増加させることは無効です。
なぜなら、相手は大きくなったパケットを受信できる保証が無いからです。

.It set openmode active|passive
デフォルトでは、openmode は常に active です。
この場合、
.Nm
はいつでも LCP/IPCP/CCP の交渉を開始します。
相手が交渉開始するのを待ちたい場合は、値
.Dq passive
を使用します。

.It set parity odd|even|none|mark
ラインのパリティを設定できます。デフォルト値は none です。

.It set phone telno[|telno]...[:telno[|telno]...]...
ダイアルおよびログインのチャットスクリプトで使用される \\\\T 文字列が
置き換えられる電話番号を指定できます。
複数の電話番号をパイプ (|) もしくはコロン (:) で区切って指定可能です。
パイプの後の番号がダイアルされるのは、
直前の番号へのダイアルもしくはログインのスクリプトが失敗した場合のみです。
ラインの切断の理由にかかわらず、
コロンで区切られた番号は順番に試行されます。
複数の番号を指定した場合、接続が確立するまで
.Nm
はこのルールに基いてダイアルします。
再試行の最大値は、後述の
.Dq set redial
で指定します。
.Fl background
モードでは各番号は最大 1 回試行されます。

.It set reconnect timeout ntries
(CD の喪失もしくは LQR の失敗により) 予想外のライン切断となった場合、
指定した
.Dq timeout
の後に接続が再確立されます。
ラインは最大
.Dq ntries
回、再接続されます。
.Dq ntries
のデフォルトは 0 です。
.Dq timeout
に
.Dq random
を指定すると、0 から 30 秒の間の任意時間の停止となります。

.It set redial seconds[.nseconds] [attempts]
.Nm ppp
に
.Dq attempts
回のリダイアルを指示できます。
1 より大きな数を指定した場合 (上述の
.Dq set phone
参照)、
各番号にダイアルする前に、
.Dq nseconds
だけ停止します。
最初の番号にダイアル開始する前に
.Dq seconds
だけ停止します。
.Dq random
もここで使用できます。

.It set stopped [LCPseconds [IPCPseconds [CCPseconds]]]
このオプションが指定されると、
指定した有限状態機械が停止状態になってから
.Dq seconds
で指定した秒数だけ停止したのち、
.Nm
はタイムアウトします。
このオプションが便利かもしれないのは、
ppp が停止状態になったことにより返事をしないといった状態を見る場合です。
.Dq set log +lcp +ipcp +ccp
を使用すると、
.Nm
は全状態遷移をログします。
.Pp
デフォルト値は 0 であり、
停止状態による ppp のタイムアウトは発生しません。

.It set server|socket TcpPort|LocalName|none [mask]
通常、対話モードでない場合には、
.Nm
はコマンド接続を受け入れるために TCP ソケットを listen します。
デフォルトのソケット番号は、3000 + 
.Nm
がオープンしたトンネルデバイス番号で計算されます。
例えば、
.Nm
が tun2 をオープンした場合、ソケット 3002 を使用します。
.Pp
このコマンドを使用すると、
ポート番号やローカルドメインソケット (絶対ファイル名として指定) を指定可能
ですし、
.Nm
にコマンド接続を拒否させることも可能です。
ローカルドメインソケットが指定された場合、
ソケット作成の前にオクテットマスクを指定可能です。
.Dv USR1
シグナルの使用方法も参照してください。

.Pp
.Nm
をサーバソケットと共に使用する場合、通信機構として
.Xr pppctl 8
コマンドを使用する方が好ましいです。
現在
.Xr telnet 1
も使用可能ですが、将来リンク暗号化が実装されますので、
.Nm telnet
に依存しないようにしてください。

.It set speed value
シリアルデバイスの速度を指定します。

.It set timeout Idle [ lqr [ retry ] ]
アイドルタイマ、
(有効にされているなら )LQR タイマ、
リトライタイマの値を指定します。

.It set ns x.x.x.x y.y.y.y
このオプションは交渉される Microsoft DNS サーバを設定します。

.It set nbns x.x.x.x y.y.y.y
このオプションは交渉される Microsoft NetBIOS DNS サーバを設定します。

.It set help|?
使用可能なセットコマンドのまとめを表示します。
.El

.It shell|! [command]
.Dq command
が指定されない場合、
.Dv SHELL
環境変数で指定されるシェルが起動されます。
そうでなければ指定されたコマンドが実行されます。
擬似引数
.Dv HISADDR ,
.Dv INTERFACE ,
.Dv MYADDR
は適切な値に置き換えられます。! 文字を使用した場合、
この後のコマンドとの間にスペースが必要です。
このコマンドはフォアグラウンドで実行されることに注意してください -
ppp はプロセスが終了するまでは実行を続けません。
バックグラウンドでコマンド処理を行いたい場合には、
.Dv bg
コマンドを使用してください。

.It show var
このコマンドを使用して、以下を確認できます:

.Bl -tag -width 20
.It show [adio]filter
指定したフィルタの現在の規則をリストします。

.It show auth
現在の authname と authkey を表示します。

.It show ccp
現在の CCP 統計を表示します。

.It show compress
現在の圧縮統計を表示します。

.It show escape
現在のエスケープ文字を表示します。

.It show hdlc
現在の HDLC 統計を表示します。

.It show ipcp
現在の IPCP 統計を表示します。

.It show lcp
現在の LCP 統計を表示します。

.It show loopback
現在のループバック状態を表示します。

.It show log
現在のログ値を表示します。

.It show mem
現在のメモリ統計を表示します。

.It show modem
現在のモデム統計を表示します。

.It show mru
現在の MRU を表示します。

.It show mtu
現在の MTU を表示します。

.It show proto
現在のプロトコルの総計を表示します。

.It show reconnect
現在の再接続値を表示します。

.It show redial
現在のリダイアル値を表示します。

.It show stopped
現在の stopped タイムアウト値を表示します。

.It show route
現在のルーティングテーブルを表示します。

.It show timeout
現在のタイムアウト値を表示します。

.It show msext
現在の Microsoft 拡張値を表示します。

.It show version
ppp の現在のバージョン番号を表示します。

.It show help|?
利用可能な show コマンドのまとめを表示します。
.El

.It term
ターミナルモードに移行します。
キーボードからタイプした文字はモデムに送られます。
モデムから読んだ文字はスクリーンに表示されます。
モデムの相手側に
.Nm
の相手が認識された時には、
.Nm
は自動的にパケットモードを有効にし、コマンドモードに戻ります。

.It alias .....
このコマンドは
.Nm ppp
組込みのエイリアシング (マスカレーディング) 機能を
制御するために使用します。
このコードが必要となるまで、
.Nm ppp
はこのコードをロードしません。
エイリアスライブラリがあなたのシステムにインストールされないことも
大いにありえます
(エイリアスライブラリがセキュリティ的に危険だと認識する管理者もいます)。

あなたのシステムでエイリアシングが有効になると、
以下のコマンドが使用可能となります:

.Bl -tag -width 20
.It alias enable [yes|no]
エイリアシングを有効もしくは無効にします。
.Fl alias
コマンドラインフラグは
.Dq alias enable yes
と同じ意味です。

.It alias port [proto targetIP:targetPORT [aliasIP:]aliasPORT]
このコマンドにより、
マシン [aliasIP] の
.Dq aliasPORT
へ到着する接続を、
.Dq targetIP
の
.Dq targetPORT
へリダイレクトします。
proto を指定した場合、指定したプロトコルの接続のみマッチします。
あなたのゲートウェイの後のマシンでインターネット電話等を実行したい場合に、
このオプションは有用です。

.It alias addr [addr_local addr_alias]
このコマンドにより、
.Dq addr_alias
へのデータを
.Dq addr_local
へリダイレクトします。
あなたのゲートウェイの後で
少数の実  IP アドレスを持ち、
これらをあなたのゲートウェイの後の特定のマシンにマップしたい場合に有用です。

.It alias deny_incoming [yes|no]
yes に設定した場合、ファイアウォールがパケットを落すのと同様に、
全ての入力の接続を拒否します。

.It alias log [yes|no]
このオプションを指定することにより、
種々のエイリアシングの統計と情報を、ファイル
.Pa /var/log/alias.log
にログします。

.It alias same_ports [yes|no]
有効になると、
エイリアスライブラリが出力パケットのポート番号を変更しようとすることを
止めさせます。
RPC や LPD といった、
ウェルノウンポート (well known port) からの接続を要求する
プロトコルをサポートするのに有用です。

.It alias use_sockets [yes|no]
有効になると、
エイリアスライブラリにソケットを作成させ、
正しい ftp データ入力と IRC 接続を保証できるようになります。

.It alias unregistered_only [yes|no]
出力パケットを、登録されていない送信元アドレスに変更することだけを行います。
RFC1918 に依ると、登録されていない送信元アドレスは
10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16 です。

.It alias help|?
このコマンドにより、
使用可能なエイリアスコマンドのまとめを表示します。

.El

.It quit|bye [all]
.Nm ppp
を終了します。
.Nm
が対話モードであるか
.Dq all
引数が指定された場合、ppp は終了し、接続をクローズします。
単に
.Dq quit
を telnet セッションから入力するだけでは現在の接続をクローズしません。

.It help|? [command]
利用可能なコマンドをリストします。
.Dq command
を指定した場合、このコマンドの使用方法を表示します。

.It down
リンクを切断しますが、綺麗な方法ではありません。
このコマンドを使用することは丁寧ではないとされています。

.El

.Sh 更に詳細について

.Bl -bullet -compact

.It
設定ファイルの例を読んでください。良い情報源です。

また、
.It
.Dq help ,
.Dq show ? ,
.Dq alias ? ,
.Dq set ? ,
.Dq set ? <var>
コマンドを使ってください。
.El

.Sh 関連ファイル
.Nm
は、ppp.conf, ppp.linkup, ppp.linkdown, ppp.secret を参照します。
これらのファイルは
.Pa /etc/ppp 
に置かれますが、ユーザが自分用のファイルを
.Pa .ppp.conf ,
.Pa .ppp.linkup ,
.Pa .ppp.linkdown ,
.Pa .ppp.secret
として $HOME ディレクトリに作成することもできます。
いつでも
.Nm
はユーザの個人設定を優先的に参照します。

.Bl -tag -width flag
.Pa $HOME/ppp/.ppp.[conf|linkup|linkdown|secret]
ユーザ個人の設定ファイル。

.Pa /etc/ppp/ppp.conf
システムのデフォルト設定ファイル。

.Pa /etc/ppp/ppp.secret
各システム用の認証設定ファイル。

.Pa /etc/ppp/ppp.linkup
.Nm
がネットワーク層の接続を確立した時に実行されるファイル。

.Pa /etc/ppp/ppp.linkdown
.Nm
がネットワークレベルの接続を閉じるときにチェックするファイル。
 
.Pa /var/log/ppp.log
ログとデバッグ情報のファイル。

.Pa /var/spool/lock/LCK..* 
tty ポートをロックするためのファイル。詳細は
.Xr uucplock 8
を参照してください。

.Pa /var/run/tunX.pid
tunX デバイスに接続されている ppp プログラムのプロセス id (pid) 。
ここで 'X' はデバイスの番号です。このファイルは
.Fl background ,
.Fl auto ,
.Fl ddial
のいずれかのモードの時のみ作成されます。

.Pa /var/run/ttyXX.if
このポートで使われている tun インターフェース。
このファイルも
.Fl background ,
.Fl auto ,
.Fl ddial
のいずれかのモードの時のみ作成されます。

.Pa /etc/services
サービス名でポート番号が指定されている場合に、ポート番号を取得します。
.El

.Sh 関連項目
.Xr chat 8 ,
.Xr pppd 8 ,
.Xr uucplock 3 ,
.Xr syslog 3 ,
.Xr syslog.conf 5 ,
.Xr syslogd 8 ,
.Xr pppctl 8 ,
.Xr telnet 1

.Sh 歴史
元のプログラムは Toshiharu OHNO (tony-o@iij.ad.jp) が作成し、
FreeBSD-2.0.5 に Atsushi Murai (amurai@spec.co.jp) が提出しました。
多くの面で性能向上が計られたため、見た目がかなり異なります。
