freebsd/freebsd-doc/ja/man/man8/pppctl.8
.\" %Id: pppctl.8,v 1.1.2.3 1997/10/05 14:23:26 brian Exp %
.Dd 26 June 1997
.Os FreeBSD
.Dt PPPCTL 8
.Sh 名称
.Nm pppctl
.Nd
PPP 制御プログラム
.Sh 書式
.Nm
.Op Fl v
.Op Fl t Ar n
.Op Fl p Ar passwd
.Ar [host:]Port | LocalSocket
.Ar command
.Op Ar ;command
.Ar ...
.Sh 解説
このプログラムは
.Nm ppp
デーモンのコマンドラインからの制御手段を提供します。
基本的な使い方は、実行中のデーモンを制御する単純なスクリプトを
簡単に書けるようにすることです。

.Nm
は少なくともふたつの引数を必要とします。ひとつめは
.Nm ppp
デーモンが listen しているソケットを指定します。ソケットが
先頭に '/' を含んでいると、 AF_LOCAL ソケットとして扱われます。
コロンを含んでいると host:port の組として扱われ、
それ以外は単にローカルマシン (127.0.0.1) のポートを
指定したものとみなされます。
DNS 検索を避けたい場合や、
.Pa /etc/services
内に指定されたポートのエントリがない場合には、
host と port には数字で指定することができます。

.Pp
残りの引数はすべて、
.Nm ppp
デーモンに送られるコマンドを形成するために連結されます。
セミコロン文字はコマンドデリミタとして扱われ、ひとつの 
"セッション" で複数のコマンドを指定することが可能です。
例えば;

  pppctl 3000 set timeout 300\\; show timeout

ほとんどのシェルでは ';' は特殊文字として扱われるので、
エスケープかクォートすることを忘れないようにしてください。

以下のコマンドラインオプションが利用可能です:
.Bl -tag -width Ds
.It Fl v
.Nm ppp
デーモンに送られたデータ、
.Nm ppp
デーモンから受け取ったデータをすべて表示します。
.Nm pppctl
は通常、受け取った non-prompt 行のみ表示します。
.It Fl t Ar n
デフォルトの 2 秒の代わりに
.Ar n
をタイムアウトの値として用います。
これは (dialup も含む) 遅いリンク上でデーモンを制御しようとする
場合に必要かもしれません。
.It Fl p Ar passwd
.Nm ppp
デーモンが必要とするパスワードを指定します。
このスイッチが指定されないと、
.Nm
は
.Nm ppp
への接続が成功した時にパスワードの入力を促します。
.El

.Sh 使用例
.Nm ppp
を
.Fl auto
モードで実行する場合、
.Nm
は多くの仕事を自動化するのに利用できます。
.Xr ps 1
によりあなたの秘密がもれてしまう可能性のために、
.Fl p
オプションは
(たとえスクリプトが他の人に読めないようになっていたとしても)
お勧めできません。
.Pp
.Nm pppctl
と共に利用可能なソケットを
.Nm ppp
が作るようにするためには、ローカルシステムに
パスワードを設定する必要があります。
.Bd -literal -offset indent
# touch /etc/ppp/ppp.secret
# chown root.wheel /etc/ppp/ppp.secret
# chmod 400 /etc/ppp/ppp.secret
# echo "`hostname -s` MyPassword" >>/etc/ppp/ppp.secret
.Ed

.Pp
簡単で安全に
.Nm
へアクセスできるようにしたり、
.Nm ppp
をいくつも起動した場合にそれらを識別したりする最も安全な方法は、
.Pa /etc/ppp/ppp.conf
(の正しいセクション) にローカルサーバソケットを作成することです:

.Bd -literal -offset indent
set server /var/run/internet 0666
.Ed

これはデフォルトで作られる tcp ソケットではなく、
ローカルドメインソケットを作成するように
.Nm ppp
に指示します。より詳しい解説はマニュアルページ
.Xr ppp 8
を参照してください。

.Pp
このようにするといくつかのお気楽スクリプトが作成可能になります。
インターネットに接続するには:

.Bd -literal -offset indent
#! /bin/sh
test $# -eq 0 && time=300 || time=$1
exec pppctl -t 60 /var/run/internet set timeout $time\\; dial
.Ed

.Pp
切断するには:
.Bd -literal -offset indent
#! /bin/sh
exec pppctl /var/run/internet set timeout 300\\; close
.Ed

.Pp
接続されているかどうか確かめるには:
.Bd -literal -offset indent
#! /bin/sh
pppctl -p '' -v /var/run/internet '' | grep ^PPP >/dev/null
if [ $? -eq 0 ]; then
  echo Link is up
else
  echo Link is down
fi
.Ed

.Pp
このような汎用スクリプトも作成可能です:
.Bd -literal -offset indent
#! /bin/sh
exec pppctl /var/run/internet "$@"
.Ed

.Sh 関連項目
.Xr ppp 8 ,
.Xr services 5

.Sh 歴史
.Nm
コマンドは FreeBSD 2.2.5 で最初に登場しました。
