freebsd/freebsd-doc/ja/man/man8/praliases.8
.\"	@(#)praliases.8	8.1 (Berkeley) 9/21/96
.\" jpman %Id: praliases.8,v 1.3 1997/08/30 16:46:16 take-i Stab %
.Dd April 25, 1996
.Dt PRALIASES 1
.Os BSD 3
.Sh 名称
.Nm praliases
.Nd システムメールエイリアスの表示
.Sh 書式
.Nm praliases
.Op Fl f Ar ファイル
.Sh 解説
.Nm praliases
ユーティリティーは、
現在のシステムエイリアスを 1 行につき 1 つ
ずつ ( 但し項目順ではなく ) 表示します。
.Pp
オプションは次の通りです :
.Bl -tag -width Ds
.It Fl f
デフォルトの
.Nm sendmail
システムのエイリアスファイルの代わりに、
指定されたファイルを読みます。
.El
.Pp
.Nm praliases
ユーティリティーは成功すると 0 、
エラーが発生すると 0 より大きな値を返します。
.Sh 関連ファイル
.Bl -tag -width /var/log/sendmail.stXX -compact
.It Pa /etc/aliases
デフォルトの
.Nm sendmail
システムのエイリアスファイル
.It Pa /etc/aliases.db
.Pa /etc/aliases
ファイルのデータベース版
.El
.Sh 関連項目
.Xr mailq 1 ,
.Xr sendmail 8
