freebsd/freebsd-doc/ja/man/man8/qcam.8
.\"
.\" Copyright (c) 1996 Paul Traina <pst@shockwave.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: qcam.8,v 1.1.1.1 1996/03/16 22:06:26 pst Exp %
.\" jpman %Id: qcam.8,v 1.3 1997/07/22 16:54:16 horikawa Stab %
.\"
.Dd March 18, 1996
.Dt QCAM 8
.Os FreeBSD
.Sh 名称
.Nm qcam
.Nd Connectix QuickCam(TM) ドライバのカーネルモジュールを読み込む
.Sh 書式
.Nm qcam
.Sh 解説
.Nm
ユーティリティは、QuickCam ドライバのカーネルモジュールを読み込みます。
.Sh 関連ファイル
.Bl -tag -width /lkm/qcam_mod.o 
.It Pa /lkm/qcam_mod.o
QuickCam の読み込み可能カーネルモジュール
.Sh 関連項目
.Xr qcam 4 ,
.Xr modload 8 ,
.Xr lkm 4
.Sh 商標
QuickCam は Connectix, Inc の登録商標です。
.Sh 注釈
このドライバは Connectix によってサポートされていませんし、
リバースエンジニアリングによって開発されています。
リスクを覚悟して使ってください。
