freebsd/freebsd-doc/ja/man/man8/rc.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rc.8	8.2 (Berkeley) 12/11/93
.\"	%Id: rc.8,v 1.4 1998/02/26 02:44:17 jkh Exp %
.\" jpman %Id: rc.8,v 1.3 1997/08/16 13:37:00 horikawa Stab %
.\"
.Dd December 11, 1993
.Dt RC 8
.Os BSD 4
.Sh 名称
.Nm rc
.Nd 自動リブート処理とデーモン起動のためのコマンドスクリプト
.Sh 書式
.Nm rc
.Nm rc.conf
.Nm rc.conf.local
.Nm rc.serial
.Nm rc.pccard
.Nm rc.network
.Nm rc.firewall
.Nm rc.<arch>
.Nm rc.local
.Nm rc.shutdown
.Sh 解説
.Nm rc
は自動リブート処理 (他のスクリプトを呼びます) を制御するコマンドスクリプトで、
.Nm rc.local
は特定サイトに特化したコマンドを記述するスクリプトです。
.Nm rc.conf
は rc ファイル群から参照されるグローバルなシステム構成情報を持ち、
.Nm rc.conf.local
はローカルなシステム構成情報を持ちます。
.Pp
.Nm Rc.shutdown
は、システムシャットダウンにおいて実行されることが必要なコマンドを持つ
コマンドスクリプトです。
.Pp
自動リブート処理の進行中、
.Nm rc
は
.Em autoboot
を引数として起動されます。
.Nm rc
はその最初の部分で
.Xr fsck 8
を
.Fl p
オプション付きで実行し、
前回のシステムシャットダウンによる些細なディスク不整合を全て「修繕」し、
ハードウェアあるいはソフトウェアの障害から生じた
重大なディスク不整合を調べます。
この自動チェックと修繕がうまくいくと、
.Nm rc
の第二部が開始します。
.Pp
.Nm rc
の第二部は
自動リブート処理が成功した後および
シングルユーザモードのシェルが終了して
.Nm rc
が起動された場合(
.Xr init 8
参照)に実行されます。
この第二部はシステムの全てのデーモンを起動し、
エディタファイルを保存し、
一時ディレクトリ
.Pa /tmp
をクリアします。
.Pp
.Nm rc.serial
は、シリアルデバイスの特殊な構成があればそれを設定するために使用します。
.Pp
.Nm rc.pccard
は PC カードを有効にするために使用します。
.Pp
.Nm rc.network
はネットワークを起動するために使用します。
ネットワークの起動は 3 パスで行われます。
最初のパスは、ホスト名とドメイン名を設定し、
ネットワークインタフェースを構成し、
IP ファイアウォール規則があれば有効にし、ルーティングを有効にします。
第 2 パスは、ほとんどのネットワーク関連デーモンの起動を行います。
第 3 パスは、NFS, amd, rwhod, Kerberos, マルチキャストルーティングデーモンの
起動を行います。
.Pp
.Nm rc.firewall
は、カーネルベースのファイアウォールサービスの規則の設定に使用されます。
.Pp
.Bl -tag -width "fBfilename" -compact -offset indent
.It open
全入力を許可します。
.It client
このマシンのみを保護しようとします。
.It simple
全ネットワークを保護しようとします。
.It closed
lo0 以外の全 IP サービスを無効にします。
.It UNKNOWN
ファイアウォール規則のロードを無効にします。
.It filename
指定したファイル名の規則をロードします (フルパス指定が必要)。
.El
.Pp
.Nm rc.<arch>
はアーキテクチャ依存のプログラムを起動します。
.Pp
.Nm rc.local
が起動されるのは、上記スクリプトの後ですが、残りの
.Nm rc
ファイルが完了する前です。
現在、
.Nm rc.local
がすることは、バージョン情報を
.Pa /etc/motd
に設定することだけです。
.Pp
伝統に従い、スタートアップファイルは
.Pa /etc
ディレクトリに置かれます。
.Sh 関連項目
.Xr rc.conf 5 ,
.Xr init 8 ,
.Xr reboot 8 ,
.Xr savecore 8
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
で登場しました。
