freebsd/freebsd-doc/ja/man/man8/rexecd.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rexecd.8	8.2 (Berkeley) 12/11/93
.\" jpman %Id: rexecd.8,v 1.2 1997/05/28 07:05:49 yugawa Stab %
.\"	%Id: rexecd.8,v 1.3.2.2 1996/11/23 08:25:35 phk Exp %
.\"
.Dd September 23, 1994
.Dt REXECD 8
.Os BSD 4.2
.Sh 名称
.Nm rexecd
.Nd リモート実行サーバ
.Sh 書式
.Nm rexecd
.Sh 解説
.Nm rexecd
は、
.Xr rexec 3
ルーチンのためのサーバです。本サーバは、ユーザ名と
パスワードに基づいたユーザ認証による、リモートプロセス実行の環境
を提供します。
.Pp
.Nm rexecd
は、
.Xr services 5
にて ``exec'' サービスが定義されたポートを
監視します。サービス要求を受信した際に、以下のプロトコルが
実行されます。
.Bl -enum
.It
サーバは、ソケットから NUL
.Pq Ql \e0
を受信するまで文字を読みとります。受信した文字は
.Tn ASCII
文字からなる 10 進数の数字として評価されます。
.It 
ステップ 1 で受信した番号が 0 でない場合、その番号は
.Em  stderr
のために用いられる
ストリームのためのポート番号として用いられます。その後、第二の接続がクライア
ントホスト上の指定されたポートとの間に生成されます。
.It
NUL で終了する最大 16 文字のユーザ名が最初のソケットより取得されます。
.It
NUL で終了する、暗号化が施されていない最大 16 文字のパス
ワードが最初の socket より取得されます。
.It
NUL で終了する、シェルに渡されるコマンドが最初の socket より取得
されます。コマンドの長さは、システムの引数リストの制限を越えない長さに
制限されます。
.It
.Nm rexecd
は、次に、ログイン時と同様にユーザの認証を行い、
ユーザ認証が成功した場合、
カレントディレクトリを当該ユーザのホームディレクトリに変更し、
ユーザとグループの保護を行ないます。仮にこれらの段階が失敗した場合、
コネクションを切断し、診断メッセージを返します。
.It
NUL 文字が最初のソケットに返却され、コマンドラインは当該ユーザの
通常のログインシェルに渡されます。シェルは
.Nm rexecd
によって確立されたネットワークコネクションを継承します。
.El
.Sh 警告
.Nm rexecd
は root のログイン、/etc/ftpusers にリストされたユーザでのアクセス、
パスワードの無いユーザのアクセスを許可しません。
これらはすべて重大なセキュリティホールでした。
rexec/rexecd のコンセプトは、メジャーなセキュリティホールと、それをさせない
ための例です。
.Nm rexecd
は /etc/inetd.conf ではデフォルトで無効になっています。
.Sh 診断
以下のリストの一番最後のものを除き、全ての診断メッセージは、
他のネットワークコネクションが切断された後に、最初の socket を経由して返却
されます。エラーは、最初のバイトが値 1 であることで示されます
(コマンドの実行に先立つ全てのステップが正常に終了した場合、上記のステップ 7
で、値 0 が返されます)。
.Pp
.Bl -tag -width Ds
.It Sy username too long
ユーザ名が 16 文字を越えてます。
.It Sy password too long
パスワードが 16 文字を越えてます。
.It Sy command too long
コマンドラインの長さが(設定されている)システムの引数の長さ制限を越えてます。
.It Sy Login incorrect.
パスワードファイルのエントリに当該ユーザ名がありません。
.It Sy Password incorrect.
パスワードが不正です。
.It Sy \&No remote directory.
ホームディレクトリへの
.Xr chdir
コマンドが失敗しました。
.It Sy Try again.
サーバによる
.Xr fork
が失敗しました。
.It Sy <shellname>: ...
ユーザのログインシェルが起動できませんでした。このメッセージは
.Em stderr
のために確立されたコネクションを用いて送信されます。
そして、先頭にフラグバイトがつくことはありません。
.El
.Sh 関連項目
.Xr rexec 3
.Sh バグ
すべてのデータとパスワードを交換する場合に、それらの暗号化を行なう機構が
用意されるべきでしょう。
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
