freebsd/freebsd-doc/ja/man/man8/rpc.rwalld.8
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: rpc.rwalld.8,v 1.1.1.1 1994/08/28 14:58:36 csgr Exp %
.\" jpman %Id: rpc.rwalld.8,v 1.2 1997/05/22 08:15:10 mitchy Stab %
.\"
.Dd June 7, 1993
.Dt RPC.RWALLD 8
.Os BSD 4.3
.Sh 名称
.Nm rpc.rwalld
.Nd ログインしているユーザにメッセージを送るためのサーバ
.Sh 書式
.Nm /usr/libexec/rpc.rwalld
.Sh 解説
.Nm rpc.rwalld
は、システムにログインしている全てのユーザに対して
メッセージを送るためのサーバです。本サーバは
.Xr wall 1
を起動し、メッセージの送信を行ないます。
.Pp
メッセージは、
.Xr rwall 1
コマンドを用いて本サーバに送信されます。
.Nm  rpc.walld
デーモンは、通常は
.Xr inetd 8
から起動されます。
.Pp
.Nm rpc.rwalld
は、
.Pa /usr/include/rpcsvc/rwall.x
に定義された RPC プロトコルを使用します。
.Sh 関連項目
.Xr rwall 1 ,
.Xr wall 1 ,
.Xr inetd 8
