freebsd/freebsd-doc/ja/man/man8/scsiformat.8
.\" Copyright (c) 1993 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)scsiformat.8	5.1 (Berkeley) 6/5/93
.\"	%Id: scsiformat.8,v 1.4.2.2 1997/03/02 11:27:07 joerg Exp %
.\" jpman %Id: scsiformat.8,v 1.4 1997/07/26 22:08:08 horikawa Stab %
.\"
.Dd June 5, 1993
.Dt SCSIFORMAT 8
.Os BSD 4
.Sh 名称
.Nm scsiformat
.Nd SCSI ディスクのフォーマットと SCSI パラメータの表示
.Sh 書式
.Nm scsiformat
.Op Fl qyw
.Op Fl p Ar page-control
.Ar device-name
.Sh 解説
.Nm scsiformat
ユーティリティは接続時の SCSI フォーマットをサポートした、
固定 SCSI ディスクをフォーマットするのに使われます。
また、SCSI コントローラに設定されたいくつかのパラメータを表示することも
できます。
.Ar device-name
は
.Ql sd0
のようなディスク名か、
.Pa /dev/rsd0.ctl
のようなディスクのコントロール装置のパス名にします。
メディアのフォーマットが壊れている装置の場合などは、
通常のディスク装置を使っても動作しないでしょう。
.Pp
オプションは次の通りです:
.Bl -tag -width indent
.It Fl p
SCSI のモードセンスページの問合せの方法を変更します。
デフォルトでは、
.Nm scsiformat
は現在の設定をもとにします。
ページ制御フラグは次のうちのどれかです:
.sp
.Bl -tag -width XXX -compact
.It Li c
現在の設定から得ます。
.It Li d
(ディスクの工場で与えられた) デフォルトの設定から得ます。
.It Li s
(電源オフしても存続する) 保存した設定から得ます。
.It Li v
変更可能であるパラメータを表示します。
.El
.It Fl q
静かな動作 (Quiet); モードページ出力を抑制します。
inquiry 文字列だけが出力されるので、
オペレータは予定したドライブをフォーマットしていることを確認できます。
.It Fl y
肯定 (Yes); 質問を行なうことなしにフォーマットします。
もしこのオプションが与えられなかった場合、
.Nm scsiformat
は、実際に装置のフォーマットを始める前によいかどうか尋ねます。
ここで、割り込みキー (通常 Control-C) を打つことでプログラムを中断できます。
.It Fl w
実際にフォーマットをする;
デフォルトでは、ディスクパラメータの表示だけを行ないます。
.El
.Sh 診断
メッセージの意味の多くは、そこに説明してある通りです。
しかし、SCSI 標準のコピー (あるいは、読みやすい解説書) が
助けになるでしょう。
.Sh 関連項目
.Xr scsi 8 .
.Sh 歴史
.Nm scsiformat
ユーティリティは
.Bx 4.4
から登場しました。
現在のバージョンのものは、
Peter Dufault によって
.Fx 2.1
の
.Xr scsi 8
対応として再び稼働しました。
