freebsd/freebsd-doc/ja/man/man8/slattach.8
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)slattach.8	6.4 (Berkeley) 3/16/91
.\"	%Header: /home/ncvs/src/sbin/slattach/slattach.8,v 1.11.2.3 1998/08/12 06:57:33 charnier Exp %
.\"
.\" jpman %Id: slattach.8,v 1.2 1997/05/19 05:35:41 mitchy Stab %
.\"
.Dd April 4, 1993
.Dt SLATTACH 8
.Os BSD 4.3
.Sh 名称
.Nm slattach
.Nd シリアルラインをネットワークインタフェースに割り当てる
.Sh 書式
.Nm slattach
.Op Fl a
.Op Fl c
.Op Fl e Ar exit-command
.Op Fl f
.Op Fl h
.Op Fl l
.Op Fl n
.Op Fl z
.Op Fl L
.Op Fl r Ar redial-command
.Op Fl s Ar baudrate
.Op Fl u Ar unit-command
.Op Fl K Ar keepalive
.Op Fl O Ar outfill
.Op Fl S Ar unit
.Ar ttyname 
.Sh 解説
.Nm slattach
は、シリアルポートをネットワークインタフェースに割り当て自分と相手の
アドレスを定義するために使用されます。
.Nm slattach
の、オプションは以下のとおりです:
.Bl -tag -width Ar
.It Fl a
VJ ヘッダ圧縮を自動許可します。
リンクの相手が VJ ヘッダ圧縮可能な時これを使用し、そうでなければ
標準ヘッダを使用します。
.It Fl c
VJ ヘッダ圧縮を指定します。リンクの両端が VJ ヘッダ圧縮を使用できなければ
ならないことに注意してください。
.It Fl e Ar exit-command
.Nm slattach
が終了する前にシェルで
.Ql sh \-c Ar exit-command
のように呼び出されるコマンドを指定します。
.It Fl f
.Nm slattach
をバックグラウンドで動かすための daemon() の呼び出しを行いません。
.It Fl h
cts/rts によるシリアルのフロー制御を有効にします。無指定時には、
フロー制御はサポートされません。
.It Fl l
slip ポートのモデム制御 (CLOCAL) を無効にしキャリア検出を無視します。
無指定時には、キャリアが落ちた時に
.Ar redial-command
を呼び出しますが、
.Ar redial-command
が指定されていなければ
.Nm slattach
は終了します。
.It Fl n
ICMP パケットを捨てます。 slip インタフェースは
ICMP レスポンスによるシリアルラインの遅延を防止するよう
ICMP パケットを無視します。
.It Fl r Ar redial-command
シリアルラインのキャリアが失われた時にシェルで
.Ql sh \-c Ar redial-command
のように呼び出されるコマンドを指定します。
.Ar redial-command
として空白を指定 (すなわち
.Fl r Qq ""
) することで、専用線で外部コマンドを実行せずに再接続を試みます。
.It Fl s Ar baudrate
接続速度を指定します。このオプションが指定されない場合には、
9600 bps になります。
.It Fl u Ar unit-command
シリアルラインが slip に切り替わった時、
.Ql Nm "sh -c" Ar unit-command old new
が実行されます。
.Ar old
と
.Ar new
はそれぞれ slip の最後にオープンされた時のユニット番号と現在のコネクションの
ユニット番号です。
このユニット番号は 2 つ以上の slip ラインを使用すればリダイアル後に
変更することが出来ます。
.Nm slattach
の接続が初めて確立されたとき、
.Ql Nm "sh -c" Ar unit-command new Nm \-1
が実行されます。
.Nm slattach
の接続が切れたとき、
.Ql Nm "sh -c" Ar unit-command old Nm \-1
が実行されます。
.Nm slattach
は、ユニット番号が変更され
.Ql Fl u Ar \%unit-command
が指定されないとき終了します。
.It Fl z
開始時にキャリアにかかわり無く
.Ar redial-command
のリダイアルを行います。
.It Fl L
uucp方式のデバイスロックを行います。
他の uucp ロックを行うプログラムから
.Nm slattach
を開始する場合以外は、このオプションが必要です。
デフォルトではそのようなプログラムの使用を考え uucp ロックをしません。
.It Fl K Ar keepalive
SLIP "keep alive" タイムアウト時間を秒単位で設定します。
FRAME_END がこの時間内に受信できない時、再接続が行われます。
省略時はタイムアウトは設定されません。
.It Fl O Ar outfill
SLIP "out fill" タイムアウト時間を秒単位で設定します。
これにより、相手側の "keep alive" タイムアウトに必要な
FRAME_END をこの時間内に送信します。
省略時はタイムアウトは設定されません。
.It Fl S Ar unit
SLIP ユニット番号を直接指定します。
2 つのインタフェースが同じユニット番号にならないかチェックをしないので、
注意が必要です。
省略時は動的にユニット番号を割り当てます。
.It Ar ttyname
ttyデバイスの名前を指定します。
.Ar ttyname
は
.Ql ttyXX
か
.Ql /dev/ttyXX
の形式で記述します。
.El
.Pp
本コマンドを用いてシリアルポートをネットワークインタフェースに
割り当てることが出来るのはスーパーユーザに限られます。
.Pp
ネットワークインタフェースの割り当てを解除する場合は、
.Nm slattach
プロセスを
.Ql kill -INT
を使って kill した後に
.Dq Li ifconfig interface-name down
を実行してください。
.Ar Interface-name
は
.Xr netstat 1
で見ることが出来ます。
.Pp
.Nm slattach
をキャリアを失った時にリダイアルするように設定するには、
.Fl r Ar redial-command
オプションを使って slip サーバに再接続するスクリプトかコマンドを指定
します。スクリプトはサーバにリダイアルしログインするようなものです。
.Pp
slipユニット番号が変わった時にネットワークインタフェースを再構成するには、
.Fl u Ar unit-command
オプションを使用して
.Ql sh \-c Ar unit-command old new
のように呼び出す、スクリプトかコマンドを指定します。
.Ar old
と
.Ar new
は再接続前後の slip ユニット番号です。
同時に 2 つ以上のラインが切断されているときユニット番号が変わる可能性
があります。
最初の再接続に成功した slip が一番小さいユニット番号を得られます。
.Pp
.Nm slattach
を kill するには、 tty をクローズしてから終了するように
.Ql kill -INT
(SIGINT)を使用します。
.Pp
強制的にリダイアルするには、
.Ql kill -HUP
を使用し
.Nm slattach
がキャリアを失ったように思わせて
.Ql sh \-c Ar redial-command
でサーバに再接続させます。
.Pp
.Nm slattach
をモデム経由でなく直結で使用する場合、 slip ラインのキャリアを無視するために
.Fl l
オプション付きで実行します。
.Sh 使用例
.Bd -literal -offset indent -compact
slattach ttyd8
slattach \-s 4800 /dev/ttyd1
slattach \-c \-s 38400 /dev/cuaa1
slattach \-r 'kermit -y dial.script >kermit.log 2>&1'
.Ed
.Sh 診断
エラーメッセージは
.Pa /var/log/messages
にあります (
.Nm slattach
はデーモンです)
指定したネットワークインタフェースが終了しない、
要求されたアドレスがみつからない、権限のないユーザが
ネットワークインタフェースの設定を変更しようとした、というメッセージは
ここに記録されます。
.Nm slattach
は端末の制御の設定の失敗や、
シグナルハンドラの登録の失敗も記録します。
コネクション開始時とリダイアル時に tty 名と回線速度が記録され、
終了時に tty 名が記録されます。
.Pp
.Sh 関連ファイル
.Pa /var/run/slattach.<tty>.pid
.Pp
この
.Ar tty
は
.Ar tty 名
に置き換えられます。
このファイルには
.Nm slattach
のプロセス番号が含まれ、
.Nm slattach
にシグナルを送るスクリプトで確かめることができます。
.Sh 関連項目
.Xr netstat 1 ,
.Xr startslip 1 ,
.Xr uustat 1,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr rc 8 ,
.Xr sliplogin 8
.Sh 歴史
.Nm
は
.Bx 4.3
ではじめて登場しました。
