freebsd/freebsd-doc/ja/man/man8/tcpdchk.8
.\" jpman %Id: tcpdchk.8,v 1.2 1999/05/07 11:25:42 horikawa Stab %
.TH TCPDCHK 8
.SH 名称
tcpdchk \- tcp ラッパの設定チェッカ
.SH 書式
tcpdchk [-a] [-d] [-i inet_conf] [-v]
.SH 解説
.PP
\fItcpdchk\fR は、tcp ラッパの設定を検査し、
潜在的な問題と実際の問題で発見したものをすべて報告します。
このプログラムは、\fItcpd\fR のアクセス制御ファイル
(デフォルトでは \fI/etc/hosts.allow\fR と \fI/etc/hosts.deny\fR です)
を検査し、これらのファイルのエントリと
\fIinetd\fR または \fItlid\fR のネットワーク制御ファイルのエントリとを
比較します。
.PP
\fItcpdchk\fR が報告する問題は次のようなものです:
存在しないパス名;
\fItcpd\fR のアクセス制御ルールには存在するものの、
\fItcpd\fR の制御下にないサービス;
ラッパで包まれてはならないサービス;
存在しないホスト名や非インターネットアドレス形式;
正式なホスト名の代わりの、ホストの別名の使用;
名前/アドレスに衝突があるホスト;
ワイルドカードパターンの不適切な使用;
NIS netgroup の不適切な使用や、存在しない NIS netgroup の参照;
存在しないオプションの参照;
オプションへの不正な引数;
など。
.PP
可能であれば 、問題解決の助けとなる提案を \fItcpdchk\fR は提供します。
.SH オプション
.IP -a
明示的な ALLOW キーワード無しにアクセスを許可されるアクセス制御ルールを
報告します。
これがあてはまるのは、拡張制御言語が有効なとき
(-DPROCESS_OPTIONS 付きで構築されたとき) だけです。
.IP -d
デフォルトのものでなく、
カレントディレクトリのファイル \fIhosts.allow\fR と \fIhosts.deny\fR を
検査します。
.IP "-i inet_conf"
\fIinetd.conf\fR か \fItlid.conf\fR の
ネットワーク設定ファイルを \fItcpdchk\fR が見付けられないときか、
誤ったものを使っている疑いがあるときに、
このオプションを使用してください。
.IP -v
各アクセス制御ルールの内容を表示します。
デーモンのリスト、クライアントのリスト、シェルコマンド、オプションを、
清書して表示します;
これにより、あなたの期待したものとプログラムが解釈したものとの間の食い違いを、
容易に発見できるようにします。
.SH 関連ファイル
.PP
\fItcpd\fR のアクセス制御表の、デフォルトの置場は次の通りです:
.PP
/etc/hosts.allow
.br
/etc/hosts.deny
.SH 関連項目
.na
.nf
tcpdmatch(8), 個々の場合に tcpd が何を行うかの解説。
hosts_access(5), tcpd のアクセス制御表の書式。
hosts_options(5), 言語拡張の書式。
inetd.conf(5), inetd 制御ファイルの書式。
tlid.conf(5), tlid 制御ファイルの書式。
.SH 作者
.na
.nf
Wietse Venema (wietse@wzv.win.tue.nl),
Department of Mathematics and Computing Science,
Eindhoven University of Technology
Den Dolech 2, P.O. Box 513, 
5600 MB Eindhoven, The Netherlands
\" @(#) tcpdchk.8 1.3 95/01/08 17:00:30
