freebsd/freebsd-doc/ja/man/man8/tickadj.8
''' %Id: tickadj.8,v 1.2 1996/10/05 22:27:28 wosch Exp %
.\" jpman %Id: tickadj.8,v 1.4 1997/07/26 22:12:09 horikawa Stab %
''' 
.de Sh
.br
.ne 5
.PP
\fB\\$1\fR
.PP
..
.de Sp
.if t .sp .5v
.if n .sp
..
.de Ip
.br
.ie \\n.$>=3 .ne \\$3
.el .ne 3
.IP "\\$1" \\$2
..
'''
'''     Set up \*(-- to give an unbreakable dash;
'''     string Tr holds user defined translation string.
'''     Greek uppercase omega is used as a dummy character.
'''
.tr \(*W-|\(bv\*(Tr
.ie n \{\
.ds -- \(*W-
.if (\n(.H=4u)&(1m=24u) .ds -- \(*W\h'-12u'\(*W\h'-12u'-\" diablo 10 pitch
.if (\n(.H=4u)&(1m=20u) .ds -- \(*W\h'-12u'\(*W\h'-8u'-\" diablo 12 pitch
.ds L" ""
.ds R" ""
.ds L' '
.ds R' '
'br\}
.el\{\
.ds -- \(em\|
.tr \*(Tr
.ds L" ``
.ds R" ''
.ds L' `
.ds R' '
'br\}
.TH TICKADJ 8 LOCAL
.SH 名称
tickadj - カーネル内の時間に関連した変数をだます
.SH 書式
.B tickadj
[
.B -Aqs
] [
.B -a
.I new_tickadj
] [
.B -t
.I new_tick
]
.SH 解説
.I tickadj
プログラムは、動いているカーネル内のいくつかの時間を守ることに関係する
変数を
.IR /dev/kmem 
を通して読み込んだり、変更したりします。
これらの変数は以下の通りです。
.IR tick 
は、クロック割り込みによってシステム時間に加えられる時間を
マイクロ秒で表現しています。
.IR tickadj
は、
.IR adjtime (2)
システムコールによって使われる時間を遅らせる率と時間の解像度を
設定しています。
.IR dosynctodr 
は、あるマシン上で、
内部的にシステム時計をタイムオブデイ (time of day)
クロックと合わせる必要が有るか否かを
カーネルに示します。
.PP
デフォルトでは、オプションの無い
.I tickadj
は、カーネル内の興味のある変数を読み込み、それを出力します。
同時に、目的が
.IR xntpd (8)
(ネットワークタイムプロトコルデーモン) を実行することならば、
.I tickadj
変数をそのための \*(L"最適な\*(R" 値に決定し、表示します。
カーネルを読み込む時の  
.I tickadj
の操作は、
.IR xntpd (8)
プログラムの操作と非常に似ているため、
.IR xntpd (8)
の問題のデバグを行うために有用です。
.PP
実行中のカーネル内の興味ある変数を変更するためにさまざまなフラグが
指定できます。
.B -a
フラグは、
.I tickadj
の引数で与えられた変数を設定します。
.B -A
は、同様に
.I tickadj
を変更しますが、内部的に計算された \*(L"最適な\*(R" 値に設定することが
異ります。
.B -t
フラグは、カーネルの
.IR tick 
値をリセットするために使われます。この機能はとても変な時計を持った
機械では有効です。
.B -s
フラグは、プログラムに
.I dosynctodr
変数の値をゼロに設定するように伝えます。これは、
.IR xntpd (8)
デーモンを SunOS 4.0 で実行する時の前提条件です。一般に、
.I tickadj
は、自分が行ったことを非常に冗長に報告します。
.B -q
フラグは、エラー以外はなにも報告しないようにします。
.PP
異ったタイプの機械上で始めに使う時には、
.I tickadj
は、注意して動かさなければならないことに気を付けてください。
.I tickadj
が行おうとする操作は、全ての UNIX マシンで動くことが保証されているわけ
ではありません。
.SH 関連ファイル
.nf
/vmunix
/unix
(訳注: FreeBSD では /kernel です)
.\"(訳注)原文には上記2つが記述されていたが、FreeBSDでは/kernel
.\"     であるので、変更した。
.\" 2.2.1R 対象(1997/04/23) Takeshi MUTOH <mutoh@info.nara-k.ac.jp>
.\" 原文の記述に戻し、訳注を追加
.\" 2.2.2R 対象(1997/07/27) Kazuo Horikawa <horikawa@jp.freebsd.org>
/dev/kmem
.fi
.SH 関連項目
xntpd(8)
.SH 歴史
トロント大学の Dennis Ferguson によって書かれました。
.SH バグ
実行時に普通の操作の一部としてカーネル変数をだますことは恐ろしい習慣です。
この恐ろしい習慣の理由は、多くのカーネルで
.IR adjtime (8)
の実装が無いことおよび/もしくはベンダによってはカーネル内の
システム時計が壊れていることのみです。
カーネルを修正して
.I tickadj
を捨てるならば、その方が良いです。
