freebsd/freebsd-doc/ja/man/man8/tzsetup.8
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %Id: tzsetup.8,v 1.3.2.3 1998/03/09 14:46:17 jkh Exp %
.\" jpman %Id: tzsetup.8,v 1.3 1997/07/22 17:04:38 horikawa Stab %

.Dd January 1996
.Dt TZSETUP 8
.Os FreeBSD

.Sh 名称
.Nm tzsetup
.Nd ローカルタイムゾーンを設定する

.Sh 書式
.Nm tzsetup
.Op Fl n

.Sh 解説
.Nm
は、メニューによるローカルタイムゾーンの設定を行うためのプログラムです。
もっとも良くあなたの場所を表現している大陸と (例えば、あなたの首都の様な)
都市を選びます。すると
.Nm
が全ての仕事を行ってくれます。
.Pp
以下のオプションが使用可能です:
.Bl -tag -width indent
.It Fl n
実際には何も行わない。
.El

.Sh バグ
変更が効果を持つためには、機械をリブートする必要があります。

.Sh 関連ファイル
.Bl -tag -width /etc/wall_cmos_clock -compact
.It Pa /etc/localtime
現在のタイムゾーンのファイル
.It Pa /usr/share/zoneinfo
ゾーン情報ファイルのためのディレクトリ
.It Pa /etc/wall_cmos_clock
.Xr adjkerntz 8
を見てください。
.El

.Sh 関連項目
.Xr date 1 ,
.Xr adjtime 2 ,
.Xr ctime 3 ,
.Xr timezone 3 ,
.Xr tzfile 5 ,
.Xr adjkerntz 8 ,
.Xr zdump 8 ,
.Xr zic 8 
