freebsd/freebsd-doc/ja/man/man8/usbdevs.8
.\" %NetBSD: usbdevs.8,v 1.3 1998/07/23 13:57:51 augustss Exp %
.\" FreeBSD %Id: usbdevs.8,v 1.2 1998/12/14 09:40:15 n_hibma Exp %
.\" jpman %Id: usbdevs.8,v 1.2 1999/02/07 01:26:08 yohta Stab %
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt USBDEVS 8
.Os
.Sh 名称
.Nm usbdevs
.Nd システムに接続されている USB 機器を表示する
.Sh 書式
.Nm
.Op Fl a Ar addr
.Op Fl f Ar dev
.Op Fl v
.Sh 解説
.Nm
はシステムに接続されているすべての USB 機器について、
それぞれの機器に関する多少の情報と共に表示します。
各行のインデントは root からの距離を示しています。
.Pp
オプションは以下のとおりです:
.Bl -tag -width Ds
.It Fl a Ar addr
指定されたアドレスにある機器の情報のみを表示します。
.It Fl f Ar dev
指定された USB コントローラの情報のみを表示します。
.It Fl v
冗長になります。
.El
.Sh 関連項目
.Xr usb 4
.Sh 歴史
コマンドは
.Nx 1.4
で登場しました。
