freebsd/freebsd-doc/ja/man/man8/uucpd.8
.\" Copyright (c) 1983, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rshd.8	8.1 (Berkeley) 6/4/93
.\"	%Id: uucpd.8,v 1.6 1997/12/04 07:20:42 charnier Exp %
.\"
.\" jpman %Id: uucpd.8,v 1.3 1997/09/04 16:43:12 horikawa Stab %
.Dd Feb 18, 1996
.Dt UUCPD 8
.Os BSD 4.4
.Sh 名称
.Nm uucpd
.Nd uucp ネットワークサーバ
.Sh 書式
.Nm /usr/libexec/uucpd
.Sh 解説
.Nm
は、ネットワーク経由での uucp 接続をサポートするサーバです。
.Nm
は、``uucp'' サービスとして定められたポート(
.Xr services 5
参照)を監視し、リクエストが来るのを待ちます。
サーバは、ログイン名とパスワードによる認証を行った後、実際の転送を行う
.Nm uucico
を起動します。
.Sh 関連項目
.Xr inetd.conf 5 ,
.Xr services 5 ,
.Xr inetd 8 ,
.Xr uucico 8
.Sh 関連ファイル
.Bl -tag -width /etc/hosts -compact
.It Pa /etc/services
.It Pa /etc/inetd.conf
.El
.Sh 歴史
.Nm
ユーティリティは、
.Bx 4.3
から登場しました。
