freebsd/freebsd-doc/ja/man/man8/vipw.8
.\"	%NetBSD: vipw.8,v 1.4 1995/01/20 19:19:56 mycroft Exp %
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)vipw.8	8.1 (Berkeley) 6/6/93
.\" jpman %Id: vipw.8,v 1.2 1997/04/10 02:03:18 mutoh Stab %
.\"
.Dd June 6, 1993
.Dt VIPW 8
.Os BSD 4
.Sh 名称
.Nm vipw
.Nd パスワードファイルの編集
.Sh 書式
.Nm vipw
.Sh 解説
.Nm vipw
は、適切なロックをしてパスワードファイルの編集を行い、
ロックを解除した後で必要な処理を行います。すでに他のユーザによって
パスワードファイルが編集中でロックされていた場合には、 
.Nm vipw
は後で再度実行するように知らせます。
デフォルトでは、
.Xr vi 1
がエディタとして使用されます。
.Pp
.Nm vipw
はパスワードファイルエントリの多くの整合性をチェックし、「間違った」エントリを
含むパスワードファイルがインストールされないようにします。
間違っていた場合にはユーザに再編集を要求します。
.Pp
パスワードファイルの情報が正しいことが確かめられると、
.Nm vipw
は
.Xr pwd_mkdb 8
を使ってデータベースを更新します。これはバックグラウンドで行なわれ、
大きなサイトでは数分かかります。
この更新が終了するまで、他でパスワードファイルを更新したり、
新しい情報をプログラムで利用することはできません。
.Sh 環境変数
以下の環境変数が 
.Nm  vipw
で参照されます。
.Bl -tag -width EDITOR
.It Ev EDITOR
起動するエディタを指定します。指定がなければ
.Xr vi 1
を使用します。
.El
.Sh 関連項目
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr passwd 5 ,
.Xr adduser 8 ,
.Xr pwd_mkdb 8
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
から登場しました。
