freebsd/freebsd-doc/ja/man/man8/vnconfig.8
.\" Copyright (c) 1993 University of Utah.
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)vnconfig.8	8.1 (Berkeley) 6/5/93
.\" jpman %Id: vnconfig.8,v 1.2 1997/05/03 13:45:51 horikawa Stab %
.\"
.Dd July 8, 1993
.Dt VNCONFIG 8
.Os BSD 4
.Sh 名称
.Nm vnconfig
.Nd vnode ディスクを構築して利用できるようする
.Sh 書式
.Nm vnconfig
.Op Fl cdeguv
.Op Fl s Ar option
.Op Fl r Ar option
.Ar special_file Ar regular_file
.Oo Ar feature Oc
.Nm vnconfig
.Fl a 
.Op Fl cdeguv
.Op Fl s Ar option
.Op Fl r Ar option
.Op Fl f Ar config_file
.Sh 解説
.Nm
コマンドは、vnode 疑似ディスクデバイスを構築して使用可能にします。
コマンドの最初の書式では、スペシャルファイル
.Ar special_file
を通常ファイル
.Ar regular_file
に結びつけ、
後で通常ファイルをディスクであるかのようにアクセスできるようにします。
これによりファイルシステム中の通常ファイルを、
スワップや、名前空間にマウントされるファイルシステムと出来ます。
.Pp
オプションは動作を指定します:
.Bl -tag -width indent
.It Fl a
コマンドファイルを読み込み、
各デバイス/ファイルの組に対して指定された動作を実行します。
.It Fl c
デバイスを構築します。
成功すると、
.Ar special_file
への参照は、
.Ar regular_file
の内容へのアクセスとなります。
.It Fl d
指定した
.Ar feature
を(可能であれば)無効にします。
.It Fl e
デバイスを構築し、指定された
.Ar feature
を有効にします。
.Ar feature
が指定されないと、
.Fl e
は
.Fl c
と同じ意味になります。
.It Fl f Ar config_file
.Ar config_file
を設定ファイルの代りに使用します。
.It Fl g
global オプションを制御します。
.It Fl r Ar option
.Ar option
をリセットします。
.Ar option
は labels, follow, debug, io, all, none のいずれかです。
.It Fl s Ar option
.Ar option
をセットします。
.It Fl u
デバイスを無効にし、``無構築状態'' にします。
.It Fl v
実行される動作の内容を標準出力に表示します。
.El
.Pp
動作を指定するオプションがない場合には、
.Fl c
が指定されたものと見なします。
.Pp
.Ar feature
引数は、
.Fl e
によって有効になる機能を指定します。
.Bl -tag -width indent
.It Dv swap
スペシャルファイル上でのスワップを有効にします。
.Xr swapon 2
を参照してください。
.It Dv Pf mountro= Pa mount_point
スペシャルファイルは、
.Ar mount_point
へ読み込み専用マウントされます。
.Xr mount 2
を参照してください。
.It Dv Pf mountrw= Pa mount_point
スペシャルファイルは、
.Ar mount_point
へ読み書き可能マウントされます。
.Xr mount 2
を参照してください。
.It Dv Pf mount= Pa mount_point
``mountrw='' と同じです。
.El
.Pp
設定ファイルは、1 行にデバイスとファイル名の組を次の形式で持ちます:
.Bd -literal
	special_file	regular_file	[ feature ]
.Ed
.Pp
ここでは各フィールドはスペースで分割されます。
設定ファイル中のすべてのデバイスの動作に関して、
前述の動作オプションが有効です。
.Sh 関連ファイル
.Bl -tag -width /etc/vntab -compact
.It Pa /etc/vntab
.Fl a
オプションで使われるデフォルトの設定ファイル
.El
.Sh 使用例
.Pp
.Dl vnconfig /dev/vn0c /tmp/diskimage
.Pp
vnode ディスクデバイス
.Pa vn0c
を構築します。
.Pp
.Dl vnconfig -e /dev/vn0c /var/swapfile swap
.Pp
vnode ディスクデバイス
.Pa vn0c
を構築し、それをスワップ領域として使うようにします。
.Pp
.Dl vnconfig -d /dev/vn0c myfilesystem mount=/mnt
.Pp
vnode ディスクデバイス
.Pa vn0c
のマウントを解除します(また無構築状態にします)。
.Pp
.Dl vnconfig -ae
.Pp
.Pa /etc/vntab
に記述されているすべてのデバイスを構築して使用可能にします。
.Sh 関連項目
.Xr mount 2 ,
.Xr swapon 2 ,
.Xr unmount 2 ,
.Xr vn 4 .
