freebsd/freebsd-doc/ja/man/man8/wormcontrol.8
.\" 
.\" Copyright (C) 1996
.\"   interface business GmbH
.\"   Tolkewitzer Strasse 49
.\"   D-01277 Dresden
.\"   F.R. Germany
.\"
.\" All rights reserved.
.\"
.\" Written by Joerg Wunsch <joerg_wunsch@interface-business.de>
.\"
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
.\" OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
.\" LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE
.\" USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %Id: wormcontrol.8,v 1.3.2.3 1997/11/18 07:28:14 charnier Exp %
.\" jpman %Id: wormcontrol.8,v 1.3 1997/08/16 13:45:04 horikawa Stab %
.\"
.\" arrgh, hilit19 needs this" :-(
.Dd Jan 27, 1996
.Os
.Dt WORMCONTROL 8
.Sh 名称
.Nm wormcontrol
.Nd CD-R ドライバの制御
.Sh 書式
.Nm wormcontrol
.Op Fl f Ar device
.Ar command
.Op Ar params...
.Sh 解説
.Nm
は、書き込み可能 CD
.Pq CD-R
の様々なパラメータを調整するために
.Xr worm 4
ドライバの動作を制御するのに用いられるユーティリティです。
.Pp
他の多くのデバイスと異なり、
CD-R デバイスは大変厳密な処理手順を要求します。
データ書き込みに先立って、ドライブ速度を選択しなければなりません。
またドライブを
.Ql dummy
モードにすることも出来ます。
このモードでは、あらゆる動作はレーザを止めて行われます。
このようにして、最悪の事態に陥ってメディアを破壊することなく、
書き込み環境が実際に CD-R を焼くのに十分なデータ速度を提供できるか否かを
テストすることができます。
.Pp
新しいトラックに書き込むには、そのトラックが音声トラックになるのか
データトラックになるのかをドライブに教えてやる必要があります。
音声トラックはブロックサイズ 2352 バイトで書き込まれますが、
データトラックはブロックあたり 2048 バイトです。
実際に利用できるデータフォーマットは他にもありますが、
このドライバが現在のところサポートしているのは、この
.Em Yellow Book
モード 1 フォーマットだけです。
音声トラックについては、ドライバは更に、
データをプリエンファシス付きで書き込むかどうかについても
知る必要があります。
.Pp
ひとたび、あるセッションの全トラックが書き込まれると、
ディスクは
.Em 定着
させなければなりません。
これは目録とリードアウト情報をディスクに書き込む処理であり、
この処理をしなくてはディスクは利用できません。
以下のオプションを指定可能です:
.Bl -tag -width ident
.It Fl f Ar device
デフォルトの
.Pa /dev/rworm0
ではなく
.Ar device
を使用します。
.It select Ar vendor-id model-id
残念なことに、各 CD-R ドライブベンダは独自の SCSI コマンドセットを
実装することになってしまいました。従って
.Xr worm 4
ドライバは、ある特定のデバイスのためにどの
.Ql quirk
ファンクションを使うのか知る必要があります。
現在のところ、ドライバ内に quirk 情報がスタティックにコンパイルされている
デバイスのみ動作します。
しかし将来的には、これらをローダブル・モジュールとして
利用できるようにする予定です。
.Em select
コマンドは、適切な quirk を見つけるようドライバに指示します。
ドライバは指定された
.Ar vendor-id
および
.Ar model-id
を既知の quirk リストと照合します。
一致するものがなければエラーが返され、
そのデバイスは quirk レコードが正しく選択されるまで
他の処理に利用できなくなります。
.Pp
現在までに、ベンダ/モデル名として
.Dq PLASMON
\&/
.Dq RF4100 ,
.Dq PHILIPS
\&/
.Dq CDD2000 ,
.Dq HP
\&/
.Dq 4020i
が知られています。
.It prepdisk Ar single \&| double Op Ar dummy
ディスクの書き込み準備を行います。
この処理はトラック準備の前に行い、
セッションが完了するまでその状態を保つ必要があります。
通常 (single) 速度
.Pq 音声データ用
あるいは倍速 (double) 
.Pq CD-ROM データ用
のいずれかを指定しなければなりません。
オプションで引数
.Ar dummy
を指定することで、テスト用にレーザをオフにしておくよう
ドライブに指示することができます。
.It track Ar audio \&| data Op Ar preemp
次トラックのフォーマットに関する情報をドライバに伝えます。
.Ar audio
あるいは
.Ar data
.Pq CD-ROM
を選択しなければなりません。
音声トラックにおいてデータをプリエンファシス付きで書き込むためには、
オプション引数
.Ar preemp
を指定しなければなりません。
ひとたびこのコマンドを正しく指定したら、
トラックの書き込み準備は完了です。
.It fixate Ar toc-type Op Ar onp
ひとたび全トラックを書き込んだら、このコマンドにより
現在のセッションをクローズします。
引数
.Ar toc-type
は 0 から 4 までの 1 桁の数で、以下の意味を持ちます:
.Bl -item
.It
0     CD 音声
.It
1     CD-ROM
.It
2     CD-ROM  第 1 トラック モード 1
.It
3     CD-ROM  第 1 トラック モード 2
.It
4     CDI
.El
.Pp
オプション引数
.Ar onp
は
.Dq open next program area
の意で、この CD-R の次のセッションが将来オープンされ、
書き込みが可能であることを意味します。
それ以外の場合、この CD-R はクローズされ、修正できないままとなります。
.El
.Sh 診断
内部で呼び出される
.Xr ioctl 2
コマンドのエラーコードが
.Xr err 3
機能によって表示されます。
.Sh 使用例
データ CD-R を焼く典型的な手順はこのようになります:
.Bd -literal
# wormcontrol select PLASMON RF4100
# wormcontrol prepdisk double
# wormcontrol track data
# rtprio 5 team -v 1m 5 < cdrom.image | rtprio 5 dd of=/dev/rworm0 obs=20k
# wormcontrol fixate 1
.Ed
.Pp
注意: 上の
.Xr dd 1
コマンドは主として、データストリームを
.Dq スライス
するために用いられています。
これは、かなり特殊なブロックサイズで音声データを書き込む際に、特に有用です。
内部で用いられるデバイスは
.Em ロウ
デバイスなので、上のコマンドで用いられるブロックサイズは CD-R の
ブロックサイズの整数倍でなければなりません。
.Pp
上に述べたコマンド
.Xr team 1
は基本システムの一部ではありませんが、
一定のデータストリームを CD レコーダにパイプで流し込むのに
極めて有用です。
.Sh 関連項目
.Xr dd 1 ,
.Xr team 1 ,
.Xr ioctl 2 ,
.Xr err 3 ,
.Xr worm 4
.Pp
.Pa /usr/share/examples/worm/*
.Sh 歴史
.Nm wormcontrol
は現在も開発途上です。
.Sh 作者
本プログラムは
.ie t J\(:org Wunsch
.el Joerg Wunsch
Dresden によって寄贈されました。
