freebsd/freebsd-doc/ja/man/man8/yppush.8
.\" Copyright (c) 1991, 1993, 1995
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: yppush.8,v 1.4 1996/04/03 03:23:59 wpaul Exp %
.\" jpman %Id: yppush.8,v 1.3 1997/09/09 04:08:40 yugawa Stab %
.\"
.Dd February 5, 1995
.Dt YPPUSH 8
.Os
.Sh 名称
.Nm yppush
.Nd "NIS データベースの更新を強制的に伝搬させる"
.Sh 書式
.Nm yppush
.Op Fl d Ar domain
.Op Fl t Ar timeout
.Op Fl j Ar #parallel jobs
.Op Fl h Ar host
.Op Fl p Ar path
.Op Fl v
.Ar mapname
.Sh 解説
.Nm yppush
は、NIS ドメインにおいて、更新した NIS データベース(もしくは
.Pa マップ )
を NIS マスタサーバから NIS スレーブサーバへ配布します。
通常、NIS マップが更新された場合に NIS マスタの
.Pa /var/yp/Makefile
からのみ起動されます。
.Pa /var/yp/Makefile
はデフォルトでは
.Nm yppush
を起動しない事に注意して下さい:
これを変えるにはまず、Makefile 中の
.Nm NOPUSH=True
エントリをコメントアウトしなければなりません
(デフォルトの FreeBSD の設定は小さなネットワークに
単一の NIS サーバがある状況を想定しています; この様な設定では
.Nm yppush
は不要です)。
.Pp
デフォルトでは、
.Nm yppush
はドメイン内のスレーブサーバ名を決定するために
.Pa ypservers
マップを検索します。
宛先ホスト(もしくはホストのリスト)は手動でコマンドラインから指定可能です。
スレーブサーバのリストが与えられると、
`マップ転送' 要求を各スレーブに送信します。
今度はスレーブが、
.Xr ypxfr 8
を使用して、NIS マスタサーバからマップのコピーを読み取ります。
コピーされるマップ名と
.Xr ypxfr 8
が
.Nm yppush
に `コールバック' して転送を完遂するために必要な特別な情報とが、
各リクエストに含まれます。
コールバックにおいて
.Nm yppush
が
.Xr ypxfr 8
から受け取るエラーメッセージは全て標準エラー出力に出力されます。
.Pp
.Sh オプション
.Nm yppush
は以下のオプションをサポートしています:
.Bl -tag -width flag
.It Fl d Ar domain
ドメイン名を指定します。
ローカルホストの NIS ドメイン名がデフォルトで使用されます。
ローカルホストのドメイン名が設定されていない場合には、
このフラグでドメイン名を指定しなければなりません。
.It Fl t Ar timeout
.Fl t
フラグにてタイムアウト値を秒単位で指定します。
このタイムアウトは、
.Nm yppush
がリスト中の次のスレーブサーバ宛にマップ転送要求を送る前に
返答をどれくらい待つかを制御します。
.It Fl j Ar #parallel jobs
.Nm yppush
は通常、転送を逐次的に行います。これはどういうことかというと、
マップ転送要求をスレーブサーバに送り、
次のスレーブサーバに取り掛かる前に返答を待つということです。
多くのスレーブがいる環境では、
同時に複数のマップ転送を開始し、転送を並列に行う方が効率が良くなります。
.Fl j
フラグにて並列処理するジョブ数を指定します:
.Nm yppush
は指定された数の転送をすぐに開始し、返答を待ちます。
並列ジョブ数がスレーブ数より少ない場合は、
.Nm yppush
は指定されたジョブ数の処理のみを開始し、返答を待ち、
処理が完了してから残りの処理に取り掛かります。
.Pp
.Nm yppush
はコールバックを非同期に取り扱う事に注意して下さい。
これはどういうことかというと、
全てのマップ転送要求を送信する前であろうとも、
.Xr ypxfr 8
からコールバック情報を受け取るとすぐに、
この情報を表示する事を意味します。
.It Fl h Ar host
.Fl h
フラグにて、
.Pa ypservers
マップ中のサーバのリストの代わりに、
ユーザが指定するマシンもしくはマシンのグループ宛にマップを転送できます。
複数のホストを指定するためには、複数の
.Fl h
フラグを使用します。
.It Fl p Ar path
デフォルトでは、
.Nm yppush
は全てのローカル NIS マップは
.Pa /var/yp
以下に格納してあると期待しています。
.Fl p
フラグにて別のパスを指定することにより、
システム管理者が NIS マップを別の場所に格納する状況に対処できます。
.It Fl v
冗長モード:
.Nm yppush
の実行時にデバッグ情報を表示させます。
このフラグを 2 回指定すると、
.Nm yppush
はより冗長に情報を表示します。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /var/yp/[domainname]/ypservers
ある NIS ドメインにおける全てのサーバ名を格納した NIS ypservers マップ。
.El
.Sh 関連項目
.Xr yp 4 ,
.Xr ypserv 8 ,
.Xr ypxfr 8
.Sh バグ
NIS v1 における NIS マップ転送機構は NIS v2 におけるものとは異なります。
このバージョンの
.Nm yppush
は NIS v2 システム宛のマップ転送のみをサポートしています。
.Sh 作者
Bill Paul <wpaul@ctr.columbia.edu>
