freebsd/freebsd-doc/ja/man/man8/ypset.8
.\"
.\" Copyright (c) 1994 Jason R. Thorpe
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Jason Thorpe.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: ypset.8,v 1.1.2.2 1997/11/18 07:54:08 charnier Exp %
.\" jpman %Id: ypset.8,v 1.2 1997/04/06 14:59:23 horikawa Stab %
.\"
.Dd October 25, 1994
.Dt YPSET 8
.Os
.Sh 名称
.Nm ypset
.Nd
.Xr ypbind 8
に使用すべき YP サーバを指示する
.Sh 書式
.Nm ypset
.Op Fl h Ar host
.Op Fl d Ar domain
.Ar server
.Sh 解説
.Nm ypset
は、同一マシン上の
.Xr ypbind 8
プロセスに、通信すべき YP サーバプロセスを指示します。
もし
.Ar server
がダウンしていたり YP サーバプロセスが動作していない場合、
YP クライアントプロセスが
YP マップにアクセスしようと試みるまでは検知されません。
YP マップをアクセスしようとした時に、
.Xr ypbind 8
はバインドをテストして適切な処理を行います。
.Pp
.Nm ypset
は、最も近い YP サーバともブロードキャストネットワークが異なる
YP クライアントをバインドする場合に最も有用ですが、
ローカルなネットワークの YP の構成をデバッグする場合、
特定の YP クライアントのプログラムをテストする場合、
ローカルネットワークに存在する複数の YP サーバの中から
特定のサーバにバインドする場合にも使用できます。
.Pp
オプションは以下の通りです:
.Bl -tag -width flag
.It Fl h Ar host
ローカルマシンではなく、指定したホスト
.Ar host
にバインドします。
.It Fl d Ar domain
.Xr domainname 1
が返すデフォルトドメインではなく、指定した YP ドメイン
.Ar domain
を使用します。
.El
.Sh 関連項目
.Xr domainname 1 ,
.Xr yp 8
.Xr ypcat 1 ,
.Xr ypmatch 1 ,
.Xr ypbind 8 ,
.Sh 作者
.An Theo De Raadt
