Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/developers-handbook/ipv6/_index.po
Languages: ru

source: Basic crypto functions can be found in directory "sys/crypto". ESP/AH transform are listed in {esp,ah}_core.c with wrapper functions. If you wish to add some algorithm, add wrapper function in {esp,ah}_core.c, and add your crypto algorithm code into sys/crypto.
ru: Основные криптографические функции можно найти в директории `sys/crypto`. Преобразования ESP/AH перечислены в `{esp,ah}_core.c` с обёрточными функциями. Если вы хотите добавить какой-либо алгоритм, добавьте обёрточную функцию в `{esp,ah}_core.c` и поместите код вашего криптографического алгоритма в `sys/crypto`.

source: Tunnel mode is partially supported in this release, with the following restrictions:
ru: Режим туннеля частично поддерживается в этом выпуске со следующими ограничениями:

source: IPsec tunnel is not combined with GIF generic tunneling interface. It needs a great care because we may create an infinite loop between ip_output() and tunnelifp->if_output(). Opinion varies if it is better to unify them, or not.
ru: Туннель IPsec не объединён с универсальным туннельным интерфейсом GIF. Это требует особой осторожности, так как может возникнуть бесконечный цикл между `ip_output()` и `tunnelifp->if_output()`. Мнения расходятся относительно того, лучше ли их объединить или нет.

source: MTU and Don't Fragment bit (IPv4) considerations need more checking, but basically works fine.
ru: MTU и бит Don't Fragment (IPv4) требуют дополнительной проверки, но в основном работают нормально.

source: Authentication model for AH tunnel must be revisited. We will need to improve the policy management engine, eventually.
ru: Модель аутентификации для туннеля AH должна быть пересмотрена. Нам потребуется улучшить механизм управления политиками в конечном итоге.

source: Conformance to RFCs and IDs
ru: Соответствие RFC и ID

source: The IPsec code in the kernel conforms (or, tries to conform) to the following standards:
ru: Код IPsec в ядре соответствует (или пытается соответствовать) следующим стандартам:

source: "old IPsec" specification documented in [.filename]#rfc182[5-9].txt#
ru: Спецификация "старого IPsec", описанная в [.filename]#rfc182[5-9].txt#

source: "new IPsec" specification documented in [.filename]#rfc240[1-6].txt#, [.filename]#rfc241[01].txt#, [.filename]#rfc2451.txt# and [.filename]#draft-mcdonald-simple-ipsec-api-01.txt# (draft expired, but you can take from link:ftp://ftp.kame.net/pub/internet-drafts/[ ftp://ftp.kame.net/pub/internet-drafts/]). (NOTE: IKE specifications, [.filename]#rfc241[7-9].txt# are implemented in userland, as "racoon" IKE daemon)
ru: Спецификация "new IPsec" описана в [.filename]#rfc240[1-6].txt#, [.filename]#rfc241[01].txt#, [.filename]#rfc2451.txt# и [.filename]#draft-mcdonald-simple-ipsec-api-01.txt# (черновик устарел, но его можно взять по ссылке: link:ftp://ftp.kame.net/pub/internet-drafts/[ ftp://ftp.kame.net/pub/internet-drafts/]). (ПРИМЕЧАНИЕ: Спецификации IKE, [.filename]#rfc241[7-9].txt#, реализованы в пользовательском пространстве в виде демона IKE "racoon")

source: Currently supported algorithms are:
ru: В настоящее время поддерживаются следующие алгоритмы:

source: null crypto checksum (no document, just for debugging)
ru: нулевая криптографическая контрольная сумма (нет документа, только для отладки)

source: keyed MD5 with 128bit crypto checksum ([.filename]#rfc1828.txt#)
ru: MD5 с ключом и с 128-битной криптографической контрольной суммой ([.filename]#rfc1828.txt#)

source: keyed SHA1 with 128bit crypto checksum (no document)
ru: SHA1 с ключом и с 128-битной криптографической контрольной суммой (без документа)

source: HMAC MD5 with 128bit crypto checksum ([.filename]#rfc2085.txt#)
ru: HMAC MD5 с 128-битной криптографической контрольной суммой ([.filename]#rfc2085.txt#)

source: HMAC SHA1 with 128bit crypto checksum (no document)
ru: HMAC SHA1 с 128-битной криптографической контрольной суммой (без документа)

source: null encryption (no document, similar to [.filename]#rfc2410.txt#)
ru: нулевое шифрование (нет документа, аналогично [.filename]#rfc2410.txt#)

source: DES-CBC mode ([.filename]#rfc1829.txt#)
ru: Режим DES-CBC ([.filename]#rfc1829.txt#)

source: keyed MD5 with 96bit crypto checksum (no document)
ru: MD5 с ключом и с 96-битной криптографической контрольной суммой (нет документа)

source: keyed SHA1 with 96bit crypto checksum (no document)
ru: SHA1 с ключом и с 96-битной криптографической контрольной суммой (без документа)

source: HMAC MD5 with 96bit crypto checksum ([.filename]#rfc2403.txt#)
ru: HMAC MD5 с 96-битной криптографической контрольной суммой ([.filename]#rfc2403.txt#)

source: HMAC SHA1 with 96bit crypto checksum ([.filename]#rfc2404.txt#)
ru: HMAC SHA1 с 96-битной криптографической контрольной суммой ([.filename]#rfc2404.txt#)

source: null encryption ([.filename]#rfc2410.txt#)
ru: нулевое шифрование ([.filename]#rfc2410.txt#)

source: DES-CBC with derived IV ([.filename]#draft-ietf-ipsec-ciph-des-derived-01.txt#, draft expired)
ru: DES-CBC с производным IV ([.filename]#draft-ietf-ipsec-ciph-des-derived-01.txt#, черновик истек)

source: DES-CBC with explicit IV ([.filename]#rfc2405.txt#)
ru: DES-CBC с явным вектором инициализации ([.filename]#rfc2405.txt#)

source: 3DES-CBC with explicit IV ([.filename]#rfc2451.txt#)
ru: 3DES-CBC с явным вектором инициализации ([.filename]#rfc2451.txt#)

source: each of the above can be combined with:
ru: каждый из вышеперечисленных может быть объединён с:

source: ESP authentication with HMAC-MD5(96bit)
ru: Аутентификация ESP с HMAC-MD5 (96 бит)

source: ESP authentication with HMAC-SHA1(96bit)
ru: Аутентификация ESP с HMAC-SHA1(96 бит)

source: The following algorithms are NOT supported:
ru: Следующие алгоритмы НЕ поддерживаются:

source: HMAC MD5 with 128bit crypto checksum + 64bit replay prevention ([.filename]#rfc2085.txt#)
ru: HMAC MD5 с 128-битной криптографической контрольной суммой + 64-битная защита от повторного воспроизведения ([.filename]#rfc2085.txt#)

source: keyed SHA1 with 160bit crypto checksum + 32bit padding ([.filename]#rfc1852.txt#)
ru: SHA1 с ключом и с 160-битной криптографической контрольной суммой + 32-битное дополнение ([.filename]#rfc1852.txt#)

source: IPsec (in kernel) and IKE (in userland as "racoon") has been tested at several interoperability test events, and it is known to interoperate with many other implementations well. Also, current IPsec implementation as quite wide coverage for IPsec crypto algorithms documented in RFC (we cover algorithms without intellectual property issues only).
ru: IPsec (в ядре) и IKE (в пользовательском пространстве как "racoon") были протестированы на нескольких мероприятиях по тестированию взаимодействия и известно, что они хорошо работают со многими другими реализациями. Кроме того, текущая реализация IPsec поддерживает довольно широкий спектр криптографических алгоритмов IPsec, описанных в RFC (мы поддерживаем только алгоритмы без проблем с интеллектуальной собственностью).

source: ECN Consideration on IPsec Tunnels
ru: Учет ECN в IPsec-туннелях

source: ECN-friendly IPsec tunnel is supported as described in [.filename]#draft-ipsec-ecn-00.txt#.
ru: Поддерживается ECN-совместимый IPsec-туннель, как описано в [.filename]#draft-ipsec-ecn-00.txt#.

source: Normal IPsec tunnel is described in RFC2401. On encapsulation, IPv4 TOS field (or, IPv6 traffic class field) will be copied from inner IP header to outer IP header. On decapsulation outer IP header will be simply dropped. The decapsulation rule is not compatible with ECN, since ECN bit on the outer IP TOS/traffic class field will be lost.
ru: Обычный IPsec-туннель описан в RFC2401. При инкапсуляции поле TOS IPv4 (или поле класса трафика IPv6) копируется из внутреннего IP-заголовка во внешний IP-заголовок. При декапсуляции внешний IP-заголовок просто отбрасывается. Правило декапсуляции несовместимо с ECN, так как бит ECN в поле TOS/класса трафика внешнего IP-заголовка будет потерян.

source: To make IPsec tunnel ECN-friendly, we should modify encapsulation and decapsulation procedure. This is described in http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt[ http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt], chapter 3.
ru: Чтобы сделать IPsec-туннель дружественным к ECN, следует изменить процедуры инкапсуляции и декапсуляции. Это описано в http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt[ http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt], глава 3.

source: IPsec tunnel implementation can give you three behaviors, by setting net.inet.ipsec.ecn (or net.inet6.ipsec6.ecn) to some value:
ru: Реализация туннеля IPsec может обеспечить три варианта поведения, в зависимости от значения параметра `net.inet.ipsec.ecn` (или `net.inet6.ipsec6.ecn`):

source: RFC2401: no consideration for ECN (sysctl value -1)
ru: RFC2401: отсутствие учета ECN (значение sysctl -1)

source: ECN forbidden (sysctl value 0)
ru: ECN запрещён (значение sysctl 0)

source: ECN allowed (sysctl value 1)
ru: ECN разрешён (значение sysctl 1)

source: Note that the behavior is configurable in per-node manner, not per-SA manner (draft-ipsec-ecn-00 wants per-SA configuration, but it looks too much for me).
ru: Обратите внимание, что поведение настраивается для каждого узла, а не для каждой SA (в draft-ipsec-ecn-00 предлагается настройка для каждой SA, но это кажется излишним).

source: The behavior is summarized as follows (see source code for more detail):
ru: Поведение можно обобщить следующим образом (подробности см. в исходном коде):

source: General strategy for configuration is as follows:
ru: Общая стратегия настройки выглядит следующим образом:

source: if both IPsec tunnel endpoint are capable of ECN-friendly behavior, you should better configure both end to "ECN allowed" (sysctl value 1).
ru: если оба конечных пункта туннеля IPsec поддерживают поведение, дружественное к ECN, лучше настроить оба конца на "разрешено ECN" (значение sysctl 1).

source: if the other end is very strict about TOS bit, use "RFC2401" (sysctl value -1).
ru: если другая сторона очень строга к биту TOS, используйте "RFC2401" (значение sysctl -1).

source: in other cases, use "ECN forbidden" (sysctl value 0).
ru: в остальных случаях используйте "ECN запрещено" (значение sysctl 0).

source: The default behavior is "ECN forbidden" (sysctl value 0).
ru: Поведение по умолчанию — "ECN запрещён" (значение sysctl 0).

source: For more information, please refer to:
ru: Для получения дополнительной информации обратитесь к:

source: http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt[ http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt], RFC2481 (Explicit Congestion Notification), src/sys/netinet6/{ah,esp}_input.c
ru: http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt[ http://www.aciri.org/floyd/papers/draft-ipsec-ecn-00.txt], RFC2481 (Явное Уведомление о Перегрузке), src/sys/netinet6/{ah,esp}_input.c

source: (Thanks goes to Kenjiro Cho mailto:kjc@csl.sony.co.jp[kjc@csl.sony.co.jp] for detailed analysis)
ru: (Благодарности Kenjiro Cho mailto:kjc@csl.sony.co.jp[kjc@csl.sony.co.jp] за детальный анализ)

source: Interoperability
ru: Совместимость

source: Here are (some of) platforms that KAME code have tested IPsec/IKE interoperability in the past. Note that both ends may have modified their implementation, so use the following list just for reference purposes.
ru: Вот некоторые из платформ, на которых код KAME тестировал взаимодействие IPsec/IKE в прошлом. Обратите внимание, что обе стороны могли изменить свои реализации, поэтому используйте следующий список только в справочных целях.
