<!-- $Id: hackers.sgml,v 1.4 1998-12-29 02:00:05 jesusr Exp $ -->
<!-- The FreeBSD Documentation Spanish Project -->
  <sect>
    <heading>S&oacute;lo para hackers serios de FreeBSD<label id="hackers">
    </heading>

    <sect1>
      <heading>
        Que son SNAPs y RELEASEs?
      </heading>

      <p>Hay actualmente tres ramas activas/semi-activas en el desarrollo de
      FreeBSD y en su
      <url url="http://www.freebsd.org/cgi/cvsweb.cgi" name="CVS Repository">:

      <itemize>
        <item><bf/RELENG_2_1_0/ AKA <bf/2.1-stable/ AKA <bf/"2.1 branch"/
        <item><bf/RELENG_2_2/   AKA <bf/2.2-stable/ AKA <bf/"2.2 branch"/
        <item><bf/HEAD/         AKA <bf/-current/ AKA <bf/3.0-current/
      </itemize>

      <p><bf/HEAD/ no es una rama actual, como las otras dos, es
      simplemente una constante simb&oacute;lica para <em/la versi&oacute;n 
      de desarrollo actual/ a la cual nos referimos simplemente como 
      <bf/-current/.

      <p>Actualmente, <bf/-current/ es el desarrollo de la versi&oacute;n 3.0 y
      la <bf/2.2-stable/.

    <sect1>
      <heading>
        C&oacute;mo puedo hacerme mi propia release personalizada?<label id="custrel">
      </heading>

      <p>Para hacer una release necesitas hacer tres cosas: primero,
      necesitas usar un kernel con el driver <htmlurl
      url="http://www.freebsd.org/cgi/man.cgi?vn" name="vn"> configurado.
      A&ntilde;ade esto a tu fichero de configuraci&oacute;n del kernel y 
      crea un nuevo kernel:

      <verb>
        pseudo-device vn         #Vnode driver (turns a file into a device)
      </verb>

      <p>Segundo, debes tener las herramientas del CVS a mano. Para hacer
      esto, puedes usar <url url="../../handbook/cvsup.html" name="CVSUP">
      pero en tu supfile pon el nombre de la release a cvs y borra cualquier
      tag campo de fecha:

      <verb>
        *default prefix=/home/ncvs
        *default base=/a
        *default host=cvsup.FreeBSD.org
        *default release=cvs
        *default delete compress use-rel-suffix

        ## Main Source Tree
        src-all
        src-eBones
        src-secure

        # Other stuff
        ports-all
        www
        doc-all
      </verb>

      <p>A continuaci&oacute;n ejecuta <tt/cvsup -g supfile/ para tener todos 
      los bits correctos en tu ordenador.

      <p>Finalmente, necesitas una buena cantidad de espacio vac&iacute;o para
      crear en el la release. Digamos que est&aacute; en 
      <tt>/algun/disco/grande</tt> y en el ejemplo anterior has dejado los 
      ficheros del CVS en <tt>/home/ncvs</tt>:

      <verb>
        setenv CVSROOT /home/ncvs        # or export CVSROOT=/home/ncvs
        cd /usr/src/release
        make release BUILDNAME=3.0-MY-SNAP CHROOTDIR=/algun/disco/grande/release
      </verb>

      <p>Una release completa ser&aacute; creada en 
      <tt>/algun/disco/grande/</tt> y tendr&aacute;s una instalaci&oacute;n 
      completa de tipo FTP en <tt>/algun/disco/grande/R/ftp</tt> cuando acabes.
      Si quieres crear tu SNAP usando otra rama de desarrollo diferente de 
      -current, puedes a&ntilde;adir <tt/RELEASETAG=SOMETAG/ a la l&iacute;nea 
      de comando anterior de creaci&oacute;n de la release. Por ejemplo, 
      <tt/RELEASETAG=RELENG_2_2/ crear&iacute;a un snapshot 2.2 GAMMA.

    <sect1>
      <heading>C&oacute;mo creo discos de instalaci&oacute;n personalizados?</heading>

      <p>El proceso completo de creacaci&oacute;n de discos de 
      instalaci&oacute;n y archivos fuentes y binarios esta automatizado por 
      varios targets en <tt>/usr/src/release/Makefile</tt>. La 
      informaci&oacute;n alli contenida deber&iacute;a ser suficiente para que 
      puedas empezar. Falta decir que este proceso necesita la ejecuci&oacute;n
      del comando "make world" y quiz&aacute;s te use mucho tiempo y espacio 
      en disco.

    <sect1>
      <heading>``make world'' destruye mis binarios instalados.</heading>

      <p>S&iacute;, esta es la idea general; como su nombre sugiere, 
      "make world" rehace todos los binarios del sistema, de manera que puedas 
      estar seguro de tener un entorno limpio y consistente al final (que es
      por lo que tarda tanto).

      <p>Si la variable de entorno <tt/DESTDIR/ est&aacute; definida mientras se
      ejecuta <tt/make world/ o <tt/make install/, los binarios creados
      nuevamente seran depositados en un &aacute;rbol de directorios 
      id&eacute;ntico al instalado, y a partir de 
      <tt>&dollar;&lcub;DESTDIR&rcub;</tt>.  Algunas combinaciones aleatorias 
      de modificaciones de librer&iacute;as compartidas y programas pueden 
      causar que falle el <tt/make world/.

    <sect1>
      <heading>
        Cuando mi sistema arranca, dice (bus speed defaulted).
      </heading>

      <p>Las controladoras SCSI Adaptec 1542 permiten al usuario configurar
      su velocidad de acceso al bus en software. Versiones anteriores del
      driver de la 1542 intentaban determinar la velocidad m&aacute;s alta 
      factible y configurar la Adaptec a esta. Nos hemos encontrado con que esto
      hace fallar el sistema de algunos usuarios, por lo que tienes que
      definir la opci&oacute;n de configuraci&oacute;n del kernel
      <tt/TUNE&lowbar;1542/ para que esto ocurra. En algunos sistemas puede
      que puede hacer que los discos vayan m&aacute;s r&aacute;pidos, pero en 
      otros puede que los datos queden corrompidos.


    <sect1>
      <heading>
        Puedo seguir la rama current con acceso limitado a Internet?<label id="ctm">
      </heading>

      <p>S&iacute;, puedes hacerlo <tt/sin/ bajarte todo el c&oacute;digo 
      fuente usando la
      utilidad <url url="../../handbook/ctm.html" name="CTM.">

    <sect1>
      <heading>C&oacute;mo partir la distribuci&oacute;n en ficheros de 240k?</heading>

      <p>Los sistemas BSD m&aacute;s modernos tienen una opci&oacute;n 
      <tt/-b/ para partir que les permite partir los ficheros en 
      tama&ntilde;os arbitrarios.

      <p>Aqui hay un ejemplo de <tt>/usr/src/Makefile</tt>.

      <verb>
        bin-tarball:
        (cd $&lcub;DISTDIR&rcub;; \
        tar cf - . \
        gzip --no-name -9 -c | \
        split -b 240640 - \
        $&lcub;RELEASEDIR&rcub;/tarballs/bindist/bin_tgz.)
      </verb>

    <sect1>
      <heading>He escrito una extensi&oacute;n del kernel, a quien la 
      env&iacute;o?</heading>

      <p>Por favor, mira en <url url="../../handbook/contrib.html"
      name="como enviar c&oacute;digo.">

      <p>Y gracias por pensar en nosotros!

    <sect1>
      <heading>Soportar&aacute; FreeBSD otras arquitecturas?</heading>

      <p>Diferentes grupos de trabajo nos han expresado su inter&eacute;s en
      trabajar en el soporte multi-artquitectura para FreeBSD y algunas
      personas est&aacute;n actualmente trabajando en portar FreeBSD a ALPHA,
      con la cooperaci&oacute;n de DEC. Para discusiones generales sobre
      nuevas arquietecturas, usa la lista <tt>&lt;platforms@FreeBSD.ORG&gt;</tt>

    <sect1>
      <heading>Necesito un numero de dispositivo para un driver propio</heading>
     
      <p>Esto depende de si quieres hacer que el driver est&eacute; 
      p&uacute;blicamente disponible. Si la respuesta es afirmativa, por favor,
      envianos una copia del c&oacute;digo fuente del driver y las 
      modificaciones apropiadas del fichero <tt>files.i386</tt>, un ejemplo de 
      configuraci&oacute;n y el c&oacute;digo apropiado de <htmlurl 
      url="http://www.freebsd.org/cgi/man.cgi?MAKEDEV" name="MAKEDEV"> para
      crear cualquier fichero especial que use tu dispositivo. Puedes enviar
      todo lo necesario a <tt>&lt;freebsd-hackers@FreeBSD.ORG&gt;</tt>.



</sect>
