<!-- $Id: install.sgml,v 1.10 1999-06-09 01:04:47 jesusr Exp $ -->
<!-- The FreeBSD Documentation Spanish Project -->
  <sect>
    <heading>Instalaci&oacute;n<label id="install"></heading>

    <sect1>
      <heading>&iquest;Qu&eacute; fichero necesito para instalar FreeBSD?</heading>

      <p>Generalmente solo es necesario un disco de 1,44Mb con una im&aacute;gen
      del fichero <em>floppies/boot.flp</em>. Arranca con este disco para
      comenzar con el programa de instalaci&oacute;n, el cual se 
      encargar&aacute; de realizar todas las operaciones necesarias 
      (gesti&oacute;n de TCP/IP, cintas, CDROMs, floppies, particiones DOS 
      y cualquier cosa necesaria para realizar la instalaci&oacute;n).

      <p>Si necesitas bajarte las distribuciones (para una instalaci&oacute;n 
      desde una partici&oacute;n DOS por ejemplo), estas son las distribuciones
      m&iacute;nimas que necesitar&aacute;s:

      <itemize>
      <item> bin/<newline>
      <item> manpages/<newline>
      <item> compat*/<newline>
      <item> doc/ <newline>
      <item> src/ssys.* <newline>
      </itemize> 

      <p>Todas las instrucciones sobre este procedimiento y una 
      ampliaci&oacute;n de la documentaci&oacute;n se puede encontrar en <url
      url="../../handbook/install.html"
      name="Instalaci&oacute;n de FreeBSD.">

    <sect1>
      <heading>Ayuda!, La imagen del disco de arranque no cabe en un floppy</heading>
      <p>Un floppy de 1.44MB puede contener hasta 1474560 bytes de datos. La
      im&aacute;gen de arranque es exactamente de 1474560 bytes.
      <p>Los errores mas comunes en la preparaci&oacute;n de disco de arranque 
      son:
      <itemize>

      <item>No bajarse la imagen en modo <tt>binario</tt> cuando se usa 
       <tt>FTP</tt>.
       <p>Algunos clientes FTP intentan bajar por defecto los ficheros en modo
       <tt>ASCII</tt> e intentan cambiar los car&aacute;cteres de final de 
       l&iacute;nea recibidos por el que utilice el sistema cliente.
       Esto corromper&aacute; inevitablemente la imagen de arranque. Revisa el 
       tama&ntilde;o de la imagen: si no es <em>exactamente</em> el mismo 
       tama&ntilde;o del fichero existente en el servidor, la imagen no 
       servir&aacute;.
       <p>Soluci&oacute;n: teclea <tt>binary</tt> en la l&iacute;nea de 
       comandos del FTP despu&eacute;s de conectar y antes de empezar a bajar 
       la im&aacute;gen.

      <item>Usando el comando <tt>copy</tt> de DOS (o cualquier herramienta
       GUI equivalente) para transferir la imagen a un disquete.
       <p>Programas como <tt>copy</tt> no funcionar&aacute;n para la 
       transferencia de la im&aacute;gen a un disco. La im&aacute;gen tiene el 
       contenido completo del disco, pista por pista, y no est&aacute; pensada 
       para ser trasladada a un disquete como un fichero normal. Tienes que 
       hacer una transferencia "raw" usando herramientas de bajo nivel como 
       <tt>fdimage</tt> o
       <tt>rawrite</tt>, descritas en <url url="../../handbook/install.html"
        name="la gu&iacute;a de instalaci&oacute;n de FreeBSD">.
      </itemize>

    <sect1>
      <heading>&iquest;D&oacute;nde puedo encontrar las instrucciones de instalaci&oacute;n de FreeBSD?</heading>

      <p>Las instrucciones de instalaci&oacute;n est&aacute;n en
      <url url="../../handbook/install.html"
      name="Instalaci&oacute;n de FreeBSD.">

    <sect1>
      <heading>&iquest;Qu&eacute; necesito para poder ejecutar FreeBSD?</heading>

      <p>Necesitar&aacute;s un PC con 386 o superior, 5 Mb o mas de memoria
      RAM y al menos 60 Mb de espacio en disco duro. Puede funcionar con
      tarjetas gr&aacute;ficas de bajo nivel (Hercules), pero para poder 
      ejecutar X11R6 es necesario una tarjeta VGA o superior.

    <sect1>
      <heading>Solo tengo 4Mb de RAM. &iquest;Puedo instalar FreeBSD?</heading>

      <p>FreeBSD 2.1.7 fue la &uacute;ltima version de FreeBSD que pod&iacute;a
      ser instalada en un sistema de 4Mb. Las nuevas versiones de FreeBSD, 
      como la 2.2, necesitan al menos 5Mb para poder ser instaladas.

      <p>Todas las versiones de FreeBSD, incluyendo la 3.0, funcionar&aacute;n 
      en sistemas con 4Mb de RAM, lo que no pueden ejecutar es la 
      instalaci&oacute;n en sistemas con 4Mb. Puedes a&ntilde;adir memoria 
      extra para el proceso de instalaci&oacute;n, y una vez instalado, volver 
      a los 4Mb. Tambien puedes instalar tu disco en una m&aacute;quina con 
      m&aacute;s de 4Mb, realizar la instalaci&oacute;n y volver el disco a su 
      m&aacute;quina con 4Mb.

      <p>Hay algunas situaciones en las que FreeBSD 2.1.7 no se instalar&aacute;
      en sistemas con 4Mb. Para ser exactos: no se instalar&aacute; con 640Kb de
      memoria base + 3Mb de memoria extendida. Si tu placa base puede 
      remapear algo de la memoria "perdida" fuera de los 640Kb a la 
      regi&oacute;n de 1Mb, entonces aun podr&aacute;s instalar FreeBSD 2.1.7.

      <p>Intenta entrar en el setup de tu BIOS y busca la opci&oacute;n "remap".
      Act&iacute;vala. Quiz&aacute;s tendr&aacute;s que desactivar la 
      opci&oacute;n de ROM shadowing.

      <p>Es m&aacute;s f&aacute;cil a&ntilde;adir en la m&aacute;quina 4Mb de 
      memoria para la instalaci&oacute;n. Crea un kernel unicamente con las 
      opciones que necesites y vuelve a quitar los 4Mb a&ntilde;adidos.

      <p>Tambi&eacute;n puedes instalar la versi&oacute;n 2.0.5 y a 
      continuaci&oacute;n actualizar tu sistema a la 2.1.7 con la opci&oacute;n
      "upgrade" del programa de instalaci&oacute;n de la versi&oacute;n 2.1.7.

      <p>Despu&eacute;s de la instalaci&oacute;n, si te creas un kernel 
      personalizado, funcionar&aacute; en 4Mb. Algunos fueron capaces de 
      arrancar con 2Mb (aunque despu&eacute;s el sistema era incapaz de hacer 
      nada mas :-)) 

    <sect1>
      <heading>&iquest;C&oacute;mo puedo hacer mi propio disco de instalaci&oacute;n?  </heading>

      <p>Actualmente, no hay una manera para *s&oacute;lo* hacer un disco de
      instalaci&oacute;n personalizado. Hay alg&uacute;n c&oacute;digo en
      <tt>/usr/src/release/floppies/Makefile</tt> que supuestamente es para
      hacer *s&oacute;lo* un disco de instalaci&oacute;n personalizado, pero 
      no est&aacute; realmente testeado todav&iacute;a.

    <sect1>
      <heading>&iquest;Puedo tener m&aacute;s de un sistema operativo en mi PC?</heading>

      <p>Echa un vistazo en <url url="../tutorials/multios/multios.html"
      name="La p&aacute;gina multi-OS.">

    <sect1>
      <heading>&iquest;Puede Windows 95 coexistir con FreeBSD?</heading>

      <p>Instala primero Windows 95 y despu&eacute;s FreeBSD. El boot manager de
      FreeBSD se encargar&aacute; de darte la opci&oacute;n de arrancar con 
      cualquiera de los dos sistemas. Si lo haces al reves, Windows 95 
      borrar&aacute; el boot manager sin hacer ninguna pregunta previa. Si 
      ocurre esto, pasa a la siguiente secci&oacute;n.

    <sect1>
      <heading>
        Windows 95 desinstal&oacute; mi boot manager! &iquest;C&oacute;mo lo recupero?
      </heading>

      <p>Puedes reinstalar el boot manager que viene con FreeBSD de dos 
      maneras:

      <itemize>
        <item>Ejecutando el DOS, entra en el directorio tools/ de tu 
        distribuci&oacute;n de FreeBSD y busca el archivo <bf>bootinst.exe</bf>.
        Ejec&uacute;talo de la siguiente manera:

        <p><bf>bootinst.exe boot.bin</bf>

        <p>Y el boot manager estar&aacute; reinstalado.

        Arranca con el disco de instalaci&oacute;n de FreeBSD y entra en la 
        secci&oacute;n "Custom Installation". Selecciona "Partition". Escoge 
        el disco en el cual debe estar instalado el boot manager, y cuando 
        entres en &eacute;l editor de particiones, sin hacer ning&uacute;n 
        cambio, selecciona (W)rite. Ser&aacute;s preguntado para confirmar la 
        acci&oacute;n, responde "s&iacute;", y cuando est&eacute;s en la 
        ventana de "Boot manager selection" aseg&uacute;rate de seleccionar 
        "Boot Manager". Esto reescribir&aacute; el boot manager en el disco. 
        Ahora, sal del programa de instalaci&oacute;n y rearranca el ordenador 
        de la manera habitual.
      </itemize>

    <sect1>
      <heading>&iquest;Puedo instalar FreeBSD en un disco con sectores err&oacute;neos?</heading>

      <p>La gesti&oacute;n de sectores err&oacute;neos por parte de FreeBSD no 
      est&aacute; desarrollada todav&iacute;a al 100% y desgraciadamente 
      debemos decirte que si tienes discos IDE o ESDI con gran cantidad de 
      sectores err&oacute;neos, FreeBSD no es para t&iacute;. De todas maneras,
      te aconsejamos que antes de descartar la instalaci&oacute;n, hagas un 
      intento.

    <sect1>
      <heading>
        Ocurren cosas extra&ntilde;as cuando arranco con el disco de instalaci&oacute;n
      </heading>

      <p>Si observas cosas como que la maquina se "cuelga" o se resetea
      espontaneamente cuando intentas arrancar con el disco de 
      instalaci&oacute;n, aqu&iacute; tienes tres preguntas que debes 
      responder tu mismo:-

      <enum>
        <item>Est&aacute;s usando un disco nuevo, reci&eacute;n formateado y 
        libre de errores, o est&aacute;s usando el disco de publicidad que 
        ven&iacute;a con la revista que lleva guardada varios meses debajo de 
        la cama?

        <item>"Bajaste" por ftp la im&aacute;gen del disco en modo binario?... 
        (no te preocupes ya que hasta el mejor de nosotros, por lo menos una
        vez, ha bajado un fichero en modo ASCII)

        <item>Si est&aacute;s usando uno de esos nuevos sistemas operativos como
        Windows 95 o Windows NT, debes arrancar la m&aacute;quina en modo DOS 
        puro, ya que parece ser que los Windows no se llevan bi&eacute;n con los
        programas que escriben directamente sobre los dispositivos hardware,
        como hace el programa de creaci&oacute;n de discos de 
        instalaci&oacute;n de FreeBSD.
      </enum>

      <p>Han habido informaciones referentes a problemas al bajar el disco
      de instalaci&oacute;n con Netscape, por lo que te recomentados que uses
      un programa diferente como cliente de ftp.

    <sect1>
      <heading>Ayuda! No puedo instalar desde una cinta!</heading>

      <p>Si estas instalando la version 2.1.7R desde una cinta, debes crear
      esa cinta con un tama&ntilde;o de bloque de tar de 10 (5120 bytes). El
      tama&ntilde;o por defecto de los bloques tar es de 20 (10240 bytes), y las
      cintas creadas con este tama&ntilde;o por defecto no pueden ser usadas
      para instalar FreeBSD 2.1.7R; con estas cintas tendr&aacute;s un error
      referente a un tama&ntilde;o de registro demasiado grande.

    <sect1>
      <heading>
        Conexi&oacute;n de dos m&aacute;quinas FreeBSD v&iacute;a puerto paralelo (PLIP)
      </heading>

      <p>Coge un cable de laplink y asegurate que ambos ordenadores tienen un
      kernel que soporta el puerto paralelo.

      <verb>
      $ dmesg | grep lp
      lpt0 at 0x378-0x37f irq 7 on isa
      lpt0: Interrupt-driven port
      lp0: TCP/IP capable interface
      </verb>

      <p>Conecta el cable en los dos puertos paralelos.

      <p>Configura los par&aacute;metros de red para el interfaz lp0 (como 
      root) en ambas m&aacute;quinas. Por ejemplo, si quieres conectar la 
      m&aacute;quina max y moritz:

      <verb>
                 max <-----> moritz
Direccion IP   10.0.0.1      10.0.0.2
      </verb>

     En el arranque de max
     <verb>
        # ifconfig lp0 10.0.0.1 10.0.0.2
     </verb>

En el arranque de moritz

     <verb>
        # ifconfig lp0 10.0.0.2 10.0.0.1
     </verb>

     <p>Esto es todo!!. Por favor, lee los man de lp(4) y lpt(4).

     <p>Tambi&eacute;n deber&iacute;as a&ntilde;adir las m&aacute;quinas en el 
     fichero /etc/hosts:

      <verb>
     127.0.0.1               localhost.my.domain localhost
     10.0.0.1                max.my.domain max
     10.0.0.2                moritz.my.domain moritz
     </verb>

     <P>Para asegurar que funciona haz:

     en max:

<verb>
$ ifconfig lp0
lp0: flags=8851<UP,POINTOPOINT,RUNNING,SIMPLEX,MULTICAST> mtu 1500
        inet 10.0.0.1 --> 10.0.0.2 netmask 0xff000000
</verb>

<verb>
$ netstat -r
Routing tables

Internet:
Destination        Gateway            Flags     Refs     Use     Netif Expire
moritz              max              UH          4   127592       lp0
</verb>

<verb>
$ ping -c 4 moritz
PING moritz (10.0.0.2): 56 data bytes
64 bytes from 10.0.0.2: icmp_seq=0 ttl=255 time=2.774 ms
64 bytes from 10.0.0.2: icmp_seq=1 ttl=255 time=2.530 ms
64 bytes from 10.0.0.2: icmp_seq=2 ttl=255 time=2.556 ms
64 bytes from 10.0.0.2: icmp_seq=3 ttl=255 time=2.714 ms

--- moritz ping statistics ---
4 packets transmitted, 4 packets received, 0% packet loss
round-trip min/avg/max/stddev = 2.530/2.643/2.774/0.103 ms
</verb>

    <sect1>
      <heading>
        &iquest;Puedo instalar FreeBSD en mi port&aacute;til sobre PLIP (Parallel Line IP)?
      </heading>

      <p>Conecta los dos ordenadores usando Laplink mediante el puerto
      paralelo y usa las siguientes caracter&iacute;sticas:

      <verb>
            +----------------------------------------+
            |A-name A-End   B-End   Descr.  Port/Bit |
            +----------------------------------------+
            |DATA0  2       15      Data    0/0x01   |
            |-ERROR 15      2               1/0x08   |
            +----------------------------------------+
            |DATA1  3       13      Data    0/0x02   |
            |+SLCT  13      3               1/0x10   |
            +----------------------------------------+
            |DATA2  4       12      Data    0/0x04   |
            |+PE    12      4               1/0x20   |
            +----------------------------------------+
            |DATA3  5       10      Strobe  0/0x08   |
            |-ACK   10      5               1/0x40   |
            +----------------------------------------+
            |DATA4  6       11      Data    0/0x10   |
            |BUSY   11      6               1/0x80   |
            +----------------------------------------+
            |GND    18-25   18-25   GND -            |
            +----------------------------------------+
      </verb>

      <p>Mira tambi&eacute;n <ref id="pao" name="esta nota"> en la 
      p&aacute;gina de inform&aacute;tica m&oacute;vil.

    <sect1>
      <heading>
        &iquest;Que geometr&iacute;a debo usar para mis discos?<label id="geometry">
      </heading>

      <p>(Por geometr&iacute;a de un disco, entendemos el numero de cilindros,
      cabezales y sectores por pista en el disco - de ahora en adelante
      nos referiremos por conveniencia a estos par&aacute;metros como C/H/S. 
      As&iacute; es como trabaja la BIOS de los PC's para gestionar la 
      lectura/escritura.

      <p>Por alguna raz&oacute;n, esto parece crear mucha confusi&oacute;n. 
      Ante todo, la geometr&iacute;a <tt /f&iacute;sica/ de un disco SCSI es 
      totalmente irrelevante ya que FreeBSD trabaja en t&eacute;rminos de 
      bloques de disco. Con discos IDE, FreeBSD trabaja en t&eacute;rminos de 
      C/H/S, pero todos los discos modernos convierten estos datos en 
      referencias internas de bloques.

      <p>Para discos SCSI, la geometr&iacute;a a usar depende de si tenemos
      activado en la controladora el soporte de translaci&oacute;n (comunmente
      conocido como "soporte para discos mayores de &gt;1GB" o algo
      similar). Si esta opci&oacute;n est&aacute; desactivada, entonces usa 
      N cilindros, 64 cabezales y 32 sectores por pista, donde N es la 
      capacidad del disco en MB. Por ejemplo, para un disco de 2GB, los 
      par&aacute;metros correctos ser&iacute;an 2048 cilindros, 64 cabezales y 
      32 sectores.

      <p>Si el soporte de translaci&oacute;n est&aacute; activado y la 
      capacidad del disco es mayor de 1GB, usa M cilindros, 63 cabezales 
      (*no* 64), y 255 sectores, donde M es la capacidad del disco en MB 
      dividida por 7.844238. Para nuestro ejemplo de un disco de 2GB, los 
      par&aacute;metros ser&iacute;an 261 cilindros, 62 cabezales y 255 
      sectores.

      <p>Si no est&aacute;s seguro sobre los par&aacute;metros a usar, o 
      FreeBSD falla al detectar la geometr&iacute;a correcta del disco durante 
      la instalaci&oacute;n, el m&eacute;todo mas simple para solucionar este 
      problema es crear una peque&ntilde;a partici&oacute;n DOS en el disco. 
      Entonces, la geometr&iacute;a deber&iacute;a ser detectada correctamente 
      (y siempre puedes borrar esa partici&oacute;n desde el "editor de 
      particiones" si no quieres mantenerla).

      <p>Alternativamente, existe una utilidad de libre distribuci&oacute;n
      incluida en FreeBSD llamada <tt/pfdisk.exe/ (situada en el directorio
      <tt>tools</tt> del cd-rom de distribuci&oacute;n o en cualquiera de los
      servidores ftp) que nos dice la geometr&iacute;a del disco usada por el
      sistema operativo DOS. Lo &uacute;nico que tenemos que hacer es introducir
      los datos obtenidos en el editor de particiones de FreeBSD.

    <sect1>
      <heading>&iquest;Existe alguna restricci&oacute;n en como dividir el disco?</heading>

      <p>Si. Debes asegurarte de que la partici&oacute;n raiz esta por debajo 
      del cilindro 1024, para que la BIOS pueda arrancar el kernel desde ella.
      (Esta es una limitaci&oacute;n de las BIOS de PC's, no de FreeBSD).

      <p>Para discos SCSI, esto implica que la partici&oacute;n raiz debe estar
      instalada en los primeros 1024MB (o en los primeros 4096MB si la
      translaci&oacute;n extendida esta activada). Para discos IDE, la 
      partici&oacute;n raiz debe estar en los primeros 504MB.

    <sect1>
      <heading>
        &iquest;Qu&eacute; hay sobre los "disk managers"?
      </heading>

      <p>FreeBSD reconoce el disk manager Ontrack. Otros disk managers no
      son soportados.

      <p>Si quieres usar el disco solo con FreeBSD no necesitas el
      disk manager. Solo configura el disco para el espacio m&aacute;ximo que
      pueda manejar la BIOS (usualmente 504MB), y FreeBSD se encargar&aacute;
      de averiguar cuanto espacio tienes realmente. Si est&aacute;s usando
      un disco antiguo con controladora MFM, necesitar&aacute;s decirle
      expl&iacute;citamente a FreeBSD cuantos cilindros puede usar.

      <p>Si quieres usar el disco con FreeBSD y otro sistema operativo,
      todav&iacute;a puedes hacerlo sin necesitar un disk manager; solo 
      asegurate que la partici&oacute;n raiz de FreeBSD y la partici&oacute;n 
      de arranque del otro sistema operativo est&aacute;n en los primeros 1024 
      cilindros. Si eres cuidadoso, una partici&oacute;n raiz de 20MB 
      deber&iacute;a ser suficiente.

    <sect1>
      <heading>
        Cuando arranco FreeBSD obtengo ``Missing Operating System''
        <label id="missing_os">
      </heading>

      <p>Esto es un cl&aacute;sico conflicto entre FreeBSD y DOS u otro sistema
      operativo sobre sus ideas de <ref id="geometry" name="geometr&iacute;a.">.
      Tendr&aacute;s que reinstalar FreeBSD, pero teniendo en cuenta la 
      informaci&oacute;n que te damos m&aacute;s arriba sobre este tema.

    <sect1>
      <heading>No puedo pasar del prompt`F?'.</heading>

      <p>Este es otro problema descrito en el parrafo anterior. La 
      geometr&iacute;a de tu BIOS y los datos de configuraci&oacute;n de 
      FreeBSD no coinciden. Si tu controladora o BIOS soporta la 
      translaci&oacute;n de cilindros (tambi&eacute;n conocido como "soporte 
      para discos de m&aacute;s de 1GB"), intenta activar/desactivar esta 
      opci&oacute;n y reinstala FreeBSD.

    <sect1>
      <heading>
        Tengo &gt;16MB de RAM. &iquest;Puede causar esto problemas?<label id="bigram">
      </heading>

      <p>Aparte del rendimiento, no. FreeBSD 2.X tiene buffers que permiten
      al "bus mastering controller" acceder a mas de 16MB. (Esto s&oacute;lo es
      aplicable si est&aacute;s usando dispositivos ISA).

      <p>Tambi&eacute;n mira la secci&oacute;n <ref id="reallybigram"
      name="maqu&iacute;nas con &gt;64M"> si tienes esta cantidad de memoria o 
      si usas m&aacute;quinas Compaq u otra BIOS que no da correctamente la 
      cantidad de memoria disponible.

    <sect1>
      <heading>&iquest;Necesito instalar las fuentes completas?</heading>

      <p>En general, no. De todas maneras, te recomendamos que instales,
      por lo menos, el kit de fuentes <tt/base/, el cual incluye muchos de
      de los ficheros aqu&iacute; mencionados, y el kit <tt/sys/, que incluye el
      c&oacute;digo fuente del kernel. No hay nada en el sistema que requiera el
      c&oacute;digo fuente para funcionar, a excepci&oacute;n del programa de 
      configuraci&oacute;n de kernel 
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?config"
      name="config">. Con la excepci&oacute;n de las fuentes del kernel, nuestra
      estructura esta dise&ntilde;ada para que puedas montar una unidad en solo
      lectura via NFS en la que exista el c&oacute;digo fuente, y aun 
      as&iacute;, ser capaz de compilar los nuevos binarios. (Debido a las 
      restriciones de los fuentes del kernel, recomendamos que no montes estos 
      en <tt>/usr/src</tt> directamente, sino en cualquier otra parte del disco
      con los links simb&oacute;licos apropiados para duplicar la estructura
      principal del &aacute;rbol de directorios original),

      <p>Teniendo los fuentes on-line y sabiendo como crear un sistema con
      ellas (compilar), te haremos mucho mas f&aacute;cil la 
      actualizaci&oacute;n a futuras versiones de FreeBSD.

      <p>Actualmente, para seleccionar una parte del c&oacute;digo fuente, usa
      la opci&oacute;n Custom del men&uacute; cuando est&aacute;s en el 
      men&uacute; Distributions de la herramienta de instalaci&oacute;n. El 
      script <tt>src/install.sh</tt> instalar&aacute; solo partes de la 
      distribuci&oacute;n de fuentes dependiendo de los par&aacute;metros 
      (argumentos) que se le pasen.

    <sect1>
      <heading>&iquest;Necesito crear un nuevo kernel?</heading>

      <p>La creaci&oacute;n de un nuevo kernel era, originariamente, un paso
      requerido en la instalaci&oacute;n de FreeBSD, pero en las versiones 
      m&aacute;s recientes nos hemos beneficiado de la introducci&oacute;n de 
      una herramienta de configuraci&oacute;n de kernel mucho m&aacute;s 
      amigable. Cuando en el prompt de arranque de FreeBSD (boot:), usamos el 
      par&aacute;metro "-c", llegamos a una pantalla de configuraci&oacute;n 
      visual la cual permite configurar las opciones del kernel para la 
      mayor&iacute;a de tarjetas ISA.

      <p>Todav&iacute;a es recomendable la creaci&oacute;n de un nuevo kernel 
      conteniendo solo los drivers que nos sean necesarios para ahorrar un 
      poco de RAM, pero no es estrictamente necesario para la mayor&iacute;a 
      de sistemas.

    <sect1>
      <heading>Vivo fuera de USA. &iquest;Puedo usar la encriptaci&oacute;n DES?</heading>

      <p>Si no es absolutamente necesario que uses la encriptaci&oacute;n DES,
      puedes usar la encriptaci&oacute;n por defecto de FreeBSD para una
      <bf/mejor/ seguridad, y sin restricciones de importaci&oacute;n. La
      encriptaci&oacute;n por defecto de los passwords en FreeBSD est&aacute; 
      basada en <bf/MD5/, y es necesario un mayor uso intensivo de CPU
      con programas de descubrimiento de passwords que en DES. La &uacute;nica
      raz&oacute;n para no usar hoy en d&iacute;a la encriptaci&oacute;n 
      <bf/MD5/ ser&iacute;a usar un sistema de passwords compartidos entre 
      sistemas FreeBSD y no FreeBSD.

      <p>Desde que el algoritmo de encriptaci&oacute;n DES no puede ser 
      legalmente exportado fuera de USA, los usuarios externos a USA 
      deber&iacute;an NO bajar este software desde los servidores FTP situados 
      en USA.

      <p>Existe una alternativa para las librer&iacute;as de encriptaci&oacute;n
      basadas en el c&oacute;digo escrito en Australia por David Burren. Este
      c&oacute;digo est&aacute; disponible en algunos mirrors de FreeBSD fuera 
      de USA. Las fuentes de las librer&iacute;as de encriptaci&oacute;n, y los
      binarios de los programas que las usan pueden encntrase en los siguientes
      servidores FTP:

      <descrip>
        <tag/South Africa/
          <tt>ftp://ftp.internat.FreeBSD.org/pub/FreeBSD</tt><newline>
          <tt>ftp://storm.sea.uct.ac.za/pub/FreeBSD</tt>

        <tag/Brazil/
          <tt>ftp://ftp.iqm.unicamp.br/pub/FreeBSD</tt>

        <tag/Finland/
          <tt>ftp://nic.funet.fi/pub/unix/FreeBSD/eurocrypt</tt>
      </descrip>

      <p>Los usuarios de fuera de los USA, no deben bajarse ning&uacute;n
      software de encriptaci&oacute;n de servidores situados en USA, ya que de
      no seguir esta norma, los responsables de esos servidores podr&iacute;an
      verse envueltos en importantes problemas legales.

      <p>Una distribuci&oacute;n no americana de Kerberos est&aacute; siendo 
      desarrollada y las versiones actuales pueden obtenerse v&iacute;a ftp 
      an&oacute;nimo en <tt>braae.ru.ac.za</tt>.

      <p>Existe tambi&eacute;n una <ref id="mailing" 
      name="lista de distribuci&oacute;n"> para la discusi&oacute;n de software
      de encriptaci&oacute;n externo a USA. Para m&aacute;s informaci&oacute;n 
      env&iacute;a un email con una simplre l&iacute;nea diciendo "<tt/help/
      en el cuerpo del mensaje a:

          <tt>&lt;majordomo@braae.ru.ac.za&gt;</tt>.

    <sect1>
      <heading>El "boot disc" arranca pero se cuelga en la pantalla "Probing Devices..."</heading>

      <p>Si tienes un ZIP ide o un JAZZ instalado, desinstalalo e intentalo
      de nuevo. El disco de arranque puede haberse confundido con los discos.
      Una vez el sistema est&eacute; instalado, puedes volver a 
      instalar/conectar los dispositivos. Esperamos que esto sea fijado en las 
      pr&oacute;ximas releases.

    <sect1>
      <heading>Aparece el siguiente error "panic: cant mount root" al 
      reiniciar el ordenador despu&eacute;s de la instalaci&oacute;n</heading>

      <p>Este error proviene de la confusi&oacute;n entre los bloques de 
      arranque y lo que ve el kernel en los discos. El error se suele 
      manifestar en sistemas con dos discos IDE, con los discos duros 
      dispuestos como master o "single" en controladoras diferentes, estando 
      FreeBSD instalado en la controladora IDE secundaria. Los bloques de 
      arranque piensan que el sistema est&aacute; instalado en wd1 (el segundo 
      disco en la BIOS) mientras el kernel asigna el primer disco de la 
      controladora secundaria wd2. Despu&eacute;s de la detecci&oacute;n de 
      dispositivos, el kernel intenta montar lo que los bloques de arranque 
      piensan que es el disco de arranque, wd1, cuando realmente es el wd2, y 
      falla.

      <p>Para solucionar el problema, haz una de las siguientes cosas:

      <enum>
       <item>En el prompt de arranque (boot:), pon
       <tt>1:wd(2,a)kernel</tt> y presiona Enter. Si el sistema arranca, 
       ejecuta el comando:
<verb>
echo "1:wd(2,a)kernel" > /boot.config
</verb>
       para actualizar la cadena de arranque por defecto.
       <item>Mueve el disco de FreeBSD a la controladora IDE primaria para
       que los discos sean consecutivos.
       <item><url url="../../handbook/kernelconfig.html" 
       name="Crea un nuevo kernel,"> modifica las l&iacute;neas de 
       configuraci&oacute;n de wd de la siguiente manera:
<verb>
controller      wdc0    at isa? port "IO_WD1" bio irq 14 vector wdintr
disk            wd0     at wdc0 drive 0
# disk            wd1     at wdc0 drive 1 # comment out this line

controller      wdc1    at isa? port "IO_WD2" bio irq 15 vector wdintr
disk            wd1     at wdc1 drive 0 # change from wd2 to wd1
disk            wd2     at wdc1 drive 1 # change from wd3 to wd2
</verb> 
       Instala el nuevo kernel:
       Si moviste los discos y quieres recuperar la configuraci&oacute;n 
       previa, reemplaza los discos en la configuraci&oacute;n deseada y 
       rearranca el sistema. Tu sistema deber&iacute;a arrancar sin problemas.
      </enum>

    <sect1>
      <heading>&iquest;Cu&aacute;l es el l&iacute;mite de memoria?.</heading>

      <p>Para memoria, el l&iacute;mite (te&oacute;rico) es de 4 gigabytes. Un 
      gigabyte ha sido comprobado y funciona sin problemas: generalmente no se 
      pueden comprar equipos i386 que soporten m&aacute;s cantidad de memoria.

    <sect1>
      <heading>&iquest;Cu&aacute;l es el l&iacute;mite del sistema de ficheros ffs?</heading>

      <p>Para sistemas de ficheros ffs, el m&aacute;ximo te&oacute;rico 
      est&aacute; en 8 terabytes (bloques de 2G), o 16TB para el tama&ntilde;o 
      de bloque por defecto de 8K. En la pr&aacute;ctica hay un l&iacute;mite 
      por soft de 1 terabyte, pero con peque&aacute;as modificaciones es 
      posible (y existen) sistemas de ficheros de 4 terabytes.

      <p>El tama&ntilde;o m&aacute;ximo de un ffs simple es aproximadamente de 
      bloques de 1G (4TB) y el tama&ntilde;o del bloque es de 4K.

      <verb>
                           maxfilesize
                ----------------------------------
                2.2.7    3.0
fs block size   -stable  -current  works  should-work
-------------   -------  --------  -----  -----------
4K              4T-1       4T-1    4T-1   4+T
8K              32+G       8T-1    32+G   16T-1
16K             128+G      16T-1   128+G  32T-1
32K             512+G      32T-1   512+G  64T-1
64K             2048+G     64T-1   2048+G 128T-1
     </verb>

     <p>Cuando el tama&ntilde;o del bloque del sistema de ficheros es de 4K, 
     los bloques triples funcionan y todo deber&iacute;a estar limitado por el 
     n&uacute;mero m&aacute;ximo de bloques que puede ser representado usando 
     los bloques triples indirectos (aproximadamente 1K^3 + 1K^2 + 1K), pero 
     todo est&aacute; limitado por un (mal) l&iacute;mite de 1G-1 en el 
     n&uacute;mero de bloques. El l&iacute;mite en el n&uacute;mero de bloques 
     deber&iacute;a ser de 2G-1, pero estos n&uacute;meros de bloque son 
     inalcancables cuando los bloques del sistema de ficheros son de 4K.

    <sect1>
      <heading>&iquest;C&oacute;mo puede poner ficheros de 1TB en un disquete?</heading>
     
      <p>El tama&ntilde;o maximo de un fichero no depende directamente del 
      tama&ntilde;o m&aacute;ximo del disco. El tama&ntilde;o m&aacute;ximo 
      del disco es de 1TB. Es una ventaja que el tama&ntilde;o del fichero 
      pueda ser mayor que el tama&ntilde;o del disco.

      <p>El siguiente ejemplo crea un fichero con un tama&ntilde;o de 1TB usando
      32K de espacio de disco (3 bloques indirectos y 1 bloque de datos) en
      una peque&ntilde;a partici&oacute;n raiz.

<verb>
ttyv0:bde@alphplex:/tmp/q> cat foo
df .
dd if=/dev/zero of=z bs=1 seek=`echo 2^43 - 2 | bc` count=1
ls -l z
du z
df .
ttyv0:bde@alphplex:/tmp/q> sh foo
Filesystem  1024-blocks     Used    Avail Capacity  Mounted on
/dev/sd0a         64479    27702    31619    47%    /
1+0 records in
1+0 records out
1 bytes transferred in 0.000187 secs (5346 bytes/sec)
-rw-r--r--  1 bde  bin  8796093022207 Sep  7 16:04 z
32      z
Filesystem  1024-blocks     Used    Avail Capacity  Mounted on
/dev/sd0a         64479    27734    31587    47%    /
ttyv0:bde@alphplex:/tmp/q> exit
</verb>

<p>Bruce Evans, September 1998

  <sect1>
    <heading>He compilado un nuevo kernel y al arrancar aparece el error
    "archsw.readin.failed".</heading>

    <p>Puedes arrancar especificando el kernel directamente en el segundo
    estado del boot, pulsando cualquier tecla cuando veas el 
    s&iacute;mbolo | justo antes de que se cargue el loader. M&aacute;s
    espec&iacute;ficamente, has actualizado los fuentes para tu kernel,
    y lo has creado y actualizado a partir de ellos <em>s&iacute;n hacer
    un "make world"</em>. As&iacute; no funciona. Haz un "make world".

</sect>
