Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/releng/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Wendell Borges, perlporter@gmail.com, 2018 Silvio Ap Silva, contato@kanazuchi.com, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G Baio, dbaio@FreeBSD.org, 2018

source: FreeBSD Release Engineering
pt_br: Engenharia de Release do FreeBSD

source: November 2001
pt_br: Novembro de 2001

source: BSDCon Europe
pt_br: BSDCon Europa

source: I've been involved in the development of FreeBSD based products since 1997 at Walnut Creek CDROM, BSDi, and now Wind River Systems. FreeBSD 4.4 was the first official release of FreeBSD that I played a significant part in.
pt_br: Eu estive envolvido no desenvolvimento de produtos baseados no FreeBSD desde 1997 na Walnut Creek CDROM, BSDi e agora na Wind River Systems. O FreeBSD 4.4 foi o primeiro release oficial do FreeBSD no qual eu participei de forma significativa.

source: $FreeBSD: head/en_US.ISO8859-1/articles/releng/article.xml 51824 2018-06-12 18:54:46Z bcr $
pt_br: $FreeBSD$

source: This document is outdated and does not accurately describe the current release procedures of the FreeBSD Release Engineering team. It is retained for historical purposes. The current procedures used by the FreeBSD Release Engineering team are available in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/freebsd-releng/article.html">FreeBSD Release Engineering</link> article.
pt_br: Este documento está desatualizado e não descreve com precisão os procedimentos atuais de lançamentos da equipe de Engenharia de Release (Versão) do FreeBSD. É retido para fins históricos. Os procedimentos atuais usados pela equipe de Engenharia de Release do FreeBSD estão disponíveis no artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/freebsd-releng/article.html">Engenharia de Release do FreeBSD</link>.

source: This paper describes the approach used by the FreeBSD release engineering team to make production quality releases of the FreeBSD Operating System. It details the methodology used for the official FreeBSD releases and describes the tools available for those interested in producing customized FreeBSD releases for corporate rollouts or commercial productization.
pt_br: Este artigo descreve a abordagem usada pela equipe de engenharia de release do FreeBSD para produzir versões do Sistema Operacional FreeBSD com qualidade de produção. Ele detalha a metodologia utilizada para as versões oficiais do FreeBSD e descreve as ferramentas disponíveis para aqueles interessados em produzir versões customizadas do FreeBSD para uso corporativo ou para uso em produtos comerciais.

source: Introduction
pt_br: Introdução

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">FreeBSD committers</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">Committers do FreeBSD</link>

source: <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">FreeBSD Core Team</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">Core Team do FreeBSD</link>

source: The development of FreeBSD is a very open process. FreeBSD is comprised of contributions from thousands of people around the world. The FreeBSD Project provides Subversion <_:footnote-1/> access to the general public so that others can have access to log messages, diffs (patches) between development branches, and other productivity enhancements that formal source code management provides. This has been a huge help in attracting more talented developers to FreeBSD. However, I think everyone would agree that chaos would soon manifest if write access to the main repository was opened up to everyone on the Internet. Therefore only a <quote>select</quote> group of nearly 300 people are given write access to the Subversion repository. These <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">committers</link> <_:footnote-2/> are usually the people who do the bulk of FreeBSD development. An elected <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">Core Team</link> <_:footnote-3/> of developers provide some level of direction over the project.
pt_br: O desenvolvimento do FreeBSD é um processo muito aberto. O FreeBSD é composto por contribuições de milhares de pessoas em todo o mundo. O Projeto FreeBSD fornece acesso ao Subversion <_:footnote-1/> para o público em geral para que outros possam ter acesso a mensagens de log, diffs (patches) entre branches (ramificações) de desenvolvimento e outros aprimoramentos de produtividade que o gerenciamento formal de código-fonte proporciona. Isso tem sido uma grande ajuda na atração de desenvolvedores talentosos para o FreeBSD. No entanto, acho que todos concordariam que o caos logo se manifestaria se o acesso para modificar o repositório principal fosse aberto a todos na Internet. Dessa forma, apenas um grupo <quote>seleto</quote> de quase 300 pessoas recebe acesso de escrita ao repositório do Subversion. Estes <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/article.html#staff-committers">committers</link> <_:footnote-2/> são normalmente as pessoas que fazem a maior parte do desenvolvimento do FreeBSD. Um <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-core">Core team</link> <_:footnote-3/> eleito fornece algum nível de orientação sobre o projeto.

source: The rapid pace of <systemitem>FreeBSD</systemitem> development makes the main development branch unsuitable for the everyday use by the general public. In particular, stabilizing efforts are required for polishing the development system into a production quality release. To solve this conflict, development continues on several parallel tracks. The main development branch is the <emphasis>HEAD</emphasis> or <emphasis>trunk</emphasis> of our Subversion tree, known as <quote>FreeBSD-CURRENT</quote> or <quote>-CURRENT</quote> for short.
pt_br: O ritmo acelerado de desenvolvimento do <systemitem>FreeBSD</systemitem> torna a principal branch de desenvolvimento inadequada para o uso diário pelo público em geral. Em particular, são necessários esforços de estabilização para polir o sistema de desenvolvimento em uma release de qualidade apropriada para uso em ambiente produtivo. Para resolver este conflito, o desenvolvimento continua em várias trilhas paralelas. A principal branch de desenvolvimento é a <emphasis>HEAD</emphasis> ou <emphasis>trunk</emphasis> da nossa árvore do Subversion, conhecida como <quote>FreeBSD-CURRENT</quote> ou <quote>-CURRENT</quote> quando abreviado.

source: A set of more stable branches are maintained, known as <quote>FreeBSD-STABLE</quote> or <quote>-STABLE</quote> for short. All branches live in a master Subversion repository maintained by the FreeBSD Project. FreeBSD-CURRENT is the <quote>bleeding-edge</quote> of FreeBSD development where all new changes first enter the system. FreeBSD-STABLE is the development branch from which major releases are made. Changes go into this branch at a different pace, and with the general assumption that they have first gone into FreeBSD-CURRENT and have been thoroughly tested by our user community.
pt_br: Um conjunto de branches mais estáveis é mantido, e é conhecido como <quote>FreeBSD-STABLE</quote> ou <quote>-STABLE</quote> na forma abreviada. Todas as branchs ficam em um repositório principal do Subversion mantido pelo Projeto FreeBSD. O FreeBSD-CURRENT é a <quote>vanguarda do desenvolvimento tecnológico</quote> do FreeBSD, pelo qual todas as novas alterações entram no sistema pela primeira vez. O FreeBSD-STABLE é a branch de desenvolvimento a partir do qual as releases principais são feitas. Mudanças entram nesta branch em um ritmo diferente, e com a suposição geral de que elas foram primeiro para o FreeBSD-CURRENT e foram exaustivamente testadas por nossa comunidade de usuários.

source: The term <emphasis>stable</emphasis> in the name of the branch refers to the presumed Application Binary Interface stability, which is promised by the project. This means that a user application compiled on an older version of the system from the same branch works on a newer system from the same branch. The ABI stability has improved greatly from the compared to previous releases. In most cases, binaries from the older <emphasis>STABLE</emphasis> systems run unmodified on newer systems, including <emphasis>HEAD</emphasis>, assuming that the system management interfaces are not used.
pt_br: O termo <emphasis>stable</emphasis> no nome da branch refere-se à estabilidade presumida da Interface Binária da Aplicação (ABI), que é prometida pelo projeto. Isso significa que um aplicativo de usuário compilado em uma versão mais antiga do sistema da mesma branch funciona em um sistema mais novo da mesma branch. A estabilidade do ABI melhorou muito em relação às versões anteriores. Na maioria dos casos, os binários dos sistemas <emphasis>STABLE</emphasis> mais antigos são executados sem modificações em sistemas mais recentes, incluindo o <emphasis>HEAD</emphasis>, assumindo que as interfaces de gerenciamento do sistema não são usadas.

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/makeworld.html">Rebuilding "world"</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/makeworld.html">Re-construindo o "mundo"</link>

source: In the interim period between releases, weekly snapshots are built automatically by the FreeBSD Project build machines and made available for download from <systemitem>ftp://ftp.FreeBSD.org/pub/FreeBSD/snapshots/</systemitem>. The widespread availability of binary release snapshots, and the tendency of our user community to keep up with -STABLE development with Subversion and <quote><command>make</command> <_:buildtarget-1/></quote> <_:footnote-2/> helps to keep FreeBSD-STABLE in a very reliable condition even before the quality assurance activities ramp up pending a major release.
pt_br: No período intermediário entre as versões, snapshots semanais são construídos automaticamente pelas máquinas de build do Projeto FreeBSD e disponibilizados para download em <systemitem>ftp://ftp.FreeBSD.org/pub/FreeBSD/snapshots/</systemitem>. A ampla disponibilidade de snapshots binários e a tendência da nossa comunidade de usuários para acompanhar o desenvolvimento do -STABLE com o Subversion e <quote><command>make</command> <_:buildtarget-1/></quote> <_:footnote-2/> ajuda a manter o FreeBSD-STABLE em uma condição muito confiável, mesmo antes que as atividades de garantia de qualidade aumentem na proximidade de um grande lançamento.

source: In addition to installation ISO snapshots, weekly virtual machine images are also provided for use with <application>VirtualBox</application>, <application>qemu</application>, or other popular emulation software. The virtual machine images can be downloaded from <systemitem>ftp://ftp.FreeBSD.org/pub/FreeBSD/snapshots/VM-IMAGES/</systemitem>.
pt_br: Além dos snapshots de instalação no formato ISO, imagens semanais de máquinas virtuais também são fornecidas para uso com o <application>VirtualBox</application>, o <application>qemu</application> ou outros softwares populares de emulação. As imagens de máquinas virtuais podem ser baixadas em <systemitem>ftp://ftp.FreeBSD.org/pub/FreeBSD/snapshots/VM-IMAGES/</systemitem>.

source: The virtual machine images are approximately 150MB <citerefentry><refentrytitle>xz</refentrytitle><manvolnum>1</manvolnum></citerefentry> compressed, and contain a 10GB sparse filesystem when attached to a virtual machine.
pt_br: As imagens das máquinas virtuais tem aproximadamente 150MB compactadas com o <citerefentry> <refentrytitle>xz</refentrytitle><manvolnum>1</manvolnum></citerefentry> e contêm um sistema de arquivos esparso de 10GB quando atachado a uma máquina virtual.

source: Bug reports and feature requests are continuously submitted by users throughout the release cycle. Problems reports are entered into our <application>Bugzilla</application> database through the web interface provided at <uri xlink:href="https://www.freebsd.org/support/bugreports.html">https://www.freebsd.org/support/bugreports.html</uri>.
pt_br: Relatórios de bugs e solicitações de recursos são enviados continuamente pelos usuários durante todo o ciclo da release. Os relatórios de problemas são inseridos em nosso banco de dados do <application>Bugzilla</application> por meio da interface da Web disponibilizada em <uri xlink:href="https://www.freebsd.org/support/bugreports.html">https://www.freebsd.org/support/bugreports.html</uri>.

source: To service our most conservative users, individual release branches were introduced with FreeBSD 4.3. These release branches are created shortly before a final release is made. After the release goes out, only the most critical security fixes and additions are merged onto the release branch. In addition to source updates via Subversion, binary patchkits are available to keep systems on the <emphasis>releng/<replaceable>X</replaceable>.<replaceable>Y</replaceable></emphasis> branches updated.
pt_br: Para atender nossos usuários mais conservadores, versões individuais foram introduzidas com o FreeBSD 4.3. Estas branchs de versões são criadas pouco antes de uma liberação final ser feita. Após o lançamento, somente as correções e adições de segurança mais críticas são aplicadas na branch da versão. Além das atualizações do código fonte via Subversion, patchkits binários estão disponíveis para manter os sistemas nas branchs <emphasis>releng/<replaceable>X</replaceable>.<replaceable>Y</replaceable></emphasis> atualizadas.

source: What This Article Describes
pt_br: O que Este Artigo Descreve

source: The following sections of this article describe:
pt_br: As seções a seguir deste artigo descrevem:

source: The different phases of the release engineering process leading up to the actual system build.
pt_br: As diferentes fases do processo de engenharia de release que levam à criação do sistema atual.

source: The actual build process.
pt_br: O processo de criação atual.

source: How the base release may be extended by third parties.
pt_br: Como o release base pode ser estendido por terceiros.

source: Some of the lessons learned through the release of FreeBSD 4.4.
pt_br: Algumas das lições aprendidas através do lançamento do FreeBSD 4.4.

source: Future directions of development.
pt_br: Direções futuras de desenvolvimento.

source: Release Process
pt_br: Processos de Release (Versão)

source: New releases of FreeBSD are released from the -STABLE branch at approximately four month intervals. The FreeBSD release process begins to ramp up 70-80 days before the anticipated release date when the release engineer sends an email to the development mailing lists to remind developers that they only have 15 days to integrate new changes before the code freeze. During this time, many developers perform what have become known as <quote>MFC sweeps</quote>.
pt_br: Novas versões do FreeBSD são liberadas a partir da branch -STABLE em intervalos de aproximadamente quatro meses. O processo de release do FreeBSD começa a se desenhar cerca de 70-80 dias antes da data de lançamento prevista, quando o engenheiro de versão envia um email para as listas de discussão de desenvolvimento para lembrar aos desenvolvedores que eles só têm 15 dias para integrar novas alterações antes do congelamento de código. Durante esse tempo, muitos desenvolvedores executam o que ficou conhecido como <quote>MFC sweeps</quote>.

source: <acronym>MFC</acronym> stands for <quote>Merge From CURRENT</quote> and it describes the process of merging a tested change from our -CURRENT development branch to our -STABLE branch. Project policy requires any change to be first applied to trunk, and merged to the -STABLE branches after sufficient external testing was done by -CURRENT users (developers are expected to extensively test the change before committing to -CURRENT, but it is impossible for a person to exercise all usages of the general-purpose operating system). Minimal MFC period is 3 days, which is typically used only for trivial or critical bugfixes.
pt_br: <acronym>MFC</acronym> significa <quote>Merge From CURRENT</quote> e descreve o processo de fusão de uma alteração testada de nossa branch de desenvolvimento -CURRENT com a nossa branch -STABLE. A política do projeto requer que qualquer mudança seja aplicada pela primeira vez ao trunk, e aplicada às branches -STABLE após testes externos suficientes serem feitos pelos usuários no -CURRENT (espera-se que os desenvolvedores testem extensivamente a mudança antes de enviarem a mesma para o -CURRENT, mas é impossível para uma pessoa exercer todos os usos de um sistema operacional de propósito geral). O período mínimo de MFC é de 3 dias, que normalmente é usado apenas para correções de bugs triviais ou críticas.

source: Code Review
pt_br: Revisão de código

source: Sixty days before the anticipated release, the source repository enters a <quote>code freeze</quote>. During this time, all commits to the -STABLE branch must be approved by Release Engineering Team <email>re@FreeBSD.org</email>. The approval process is technically enforced by a pre-commit hook. The kinds of changes that are allowed during this period include:
pt_br: Sessenta dias antes do lançamento previsto, o repositório de código entra um <quote>congelamento de código</quote>. Durante esse tempo, todos os commits para a branch -STABLE devem ser aprovados pela equipe de engenharia de release (versão) <email>re@FreeBSD.org</email>. O processo de aprovação é tecnicamente aplicado por um "pre-commit hook". Os tipos de alterações permitidos durante esse período incluem:

source: Bug fixes.
pt_br: Correções de bugs.

source: Documentation updates.
pt_br: Atualizações de documentação.

source: Security-related fixes of any kind.
pt_br: Correções relacionadas à segurança de qualquer tipo.

source: Minor changes to device drivers, such as adding new Device IDs.
pt_br: Pequenas alterações nos drivers de dispositivos, como a adição de novos IDs de dispositivos.

source: Driver updates from the vendors.
pt_br: Atualizações de driver dos fornecedores.

source: Any additional change that the release engineering team feels is justified, given the potential risk.
pt_br: Qualquer mudança adicional que a equipe de engenharia de release julgue justificada, dado o risco potencial.

source: Shortly after the code freeze is started, a <emphasis>BETA1</emphasis> image is built and released for widespread testing. During the code freeze, at least one beta image or release candidate is released every two weeks until the final release is ready. During the days preceding the final release, the release engineering team is in constant communication with the security-officer team, the documentation maintainers, and the port maintainers to ensure that all of the different components required for a successful release are available.
pt_br: Logo após o início do congelamento de código, uma imagem <emphasis>BETA1</emphasis> é criada e liberada para testes generalizados. Durante o congelamento de código, pelo menos uma imagem beta ou um candidato a versão é lançado a cada duas semanas até que a versão final esteja pronta. Durante os dias que antecedem a versão final, a equipe de engenharia de release está em constante comunicação com a equipe de segurança, os mantenedores de documentação e os mantenedores de ports para garantir que todos os diferentes componentes necessários para uma versão bem-sucedida estejam disponíveis.

source: After the quality of the BETA images is satisfying enough, and no large and potentially risky changes are planned, the release branch is created and <emphasis>Release Candidate</emphasis> (RC) images are built from the release branch, instead of the BETA images from the STABLE branch. Also, the freeze on the STABLE branch is lifted and release branch enters a <quote>hard code freeze</quote> where it becomes much harder to justify new changes to the system unless a serious bug-fix or security issue is involved.
pt_br: Após a qualidade das imagens BETA ser satisfatória o suficiente, e nenhuma mudança grande e potencialmente arriscada estar planejada, a branch release é criada e as imagens <emphasis>Release Candidate</emphasis> (RC) são construídas a partir da branch release, ao invés das Imagens BETA serem construidas da branch STABLE. Além disso, o congelamento na branch STABLE é suspenso e a branch de release entra em um <quote>congelamento de código rígido</quote>, onde fica muito mais difícil justificar novas alterações no sistema, a menos que envolva uma correção séria de bug ou um problema de segurança.

source: Final Release Checklist
pt_br: Checklist Final para uma Release

source: When several BETA images have been made available for widespread testing and all major issues have been resolved, the final release <quote>polishing</quote> can begin.
pt_br: Quando várias imagens BETA já tiverem sido disponibilizadas para testes generalizados e todos os principais problemas tiverem sido resolvidos, o <quote>polimento</quote> da versão final pode começar.

source: Creating the Release Branch
pt_br: Criação da Branch (Ramificação) da Release (Versão)

source: In all examples below, <literal>$FSVN</literal> refers to the location of the FreeBSD Subversion repository, <literal>svn+ssh://svn.FreeBSD.org/base/</literal>.
pt_br: Em todos os exemplos abaixo, <literal>$FSVN</literal> refere-se ao local do repositório Subversion do FreeBSD, <literal>svn+ssh://svn.FreeBSD.org/base/</literal>.

source: The layout of FreeBSD branches in Subversion is described in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/subversion-primer.html#subversion-primer-base-layout">Committer's Guide</link>. The first step in creating a branch is to identify the revision of the <literal>stable/<replaceable>X</replaceable></literal> sources that you want to branch <emphasis>from</emphasis>.
pt_br: O layout das branchs do FreeBSD no Subversion é descrito no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/subversion-primer.html#subversion-primer-base-layout">Guia do Commiter</link>. O primeiro passo na criação de uma branch é identificar a revisão do código fonte do <literal>stable/<replaceable>X</replaceable></literal>, a partir do qual você deseja criar a nova <emphasis>branch</emphasis>.

source: The next step is to create the <emphasis>release branch</emphasis>
pt_br: O próximo passo é criar a <emphasis>branch da release</emphasis>

source: This branch can be checked out:
pt_br: Esta branch pode ser obtida com:

source: Creating the <literal>releng</literal> branch and <literal>release</literal> tags is done by the <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-re">Release Engineering Team</link>.
pt_br: A criação das tags da branch <literal>releng</literal> e de <literal>release</literal> é feita pela <link xlink:href="@@URL_RELPREFIX@@/administration.html#t-re">Equipe de Engenharia de Release</link>.

source: <imageobject> <imagedata fileref="branches-head" align="center"/> </imageobject> <textobject> <phrase>FreeBSD Development Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-head" align="center"/> </imageobject> <textobject><phrase>Branch de Desenvolvimento do FreeBSD</phrase></textobject>

source: <imageobject> <imagedata fileref="branches-releng3" align="center"/> </imageobject> <textobject> <phrase>FreeBSD 3.x STABLE Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-releng3" align="center"/> </imageobject> <textobject><phrase>Branch FreeBSD 3.x STABLE</phrase></textobject>
