Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/releng/*.po
Languages: pt_br

source: <imageobject> <imagedata fileref="branches-releng4" align="center"/> </imageobject> <textobject> <phrase>FreeBSD 4.x STABLE Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-releng4" align="center"/> </imageobject> <textobject> <phrase>Branch FreeBSD 4.x STABLE</phrase></textobject>

source: <imageobject> <imagedata fileref="branches-releng5" align="center"/> </imageobject> <textobject> <phrase>FreeBSD 5.x STABLE Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-releng5" align="center"/> </imageobject> <textobject><phrase>Branch FreeBSD 5.x STABLE</phrase></textobject>

source: <imageobject> <imagedata fileref="branches-releng6" align="center"/> </imageobject> <textobject> <phrase>FreeBSD 6.x STABLE Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-releng6" align="center"/></imageobject><textobject><phrase>Branch FreeBSD 6.x STABLE</phrase></textobject>

source: <imageobject> <imagedata fileref="branches-releng7" align="center"/> </imageobject> <textobject> <phrase>FreeBSD 7.x STABLE Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-releng7" align="center"/></imageobject><textobject><phrase>Branch FreeBSD 7.x STABLE</phrase></textobject>

source: <imageobject> <imagedata fileref="branches-releng8" align="center"/> </imageobject> <textobject> <phrase>FreeBSD 8.x STABLE Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-releng8" align="center"/> </imageobject><textobject><phrase>Branch FreeBSD 8.x STABLE</phrase></textobject>

source: <imageobject> <imagedata fileref="branches-releng9" align="center"/> </imageobject> <textobject> <phrase>FreeBSD 9.x STABLE Branch</phrase> </textobject>
pt_br: <imageobject> <imagedata fileref="branches-releng9" align="center"/> </imageobject> <textobject><phrase>Branch FreeBSD 9.x STABLE</phrase></textobject>

source: Bumping up the Version Number
pt_br: Incrementando o número da versão

source: Before the final release can be tagged, built, and released, the following files need to be modified to reflect the correct version of FreeBSD:
pt_br: Antes que a versão final possa ser marcada, construída e lançada, os seguintes arquivos precisam ser modificados para refletir a versão correta do FreeBSD:

source: The release notes and errata files also need to be adjusted for the new release (on the release branch) and truncated appropriately (on the stable/current branch):
pt_br: As notas de versão e os arquivos de errata também precisam ser ajustados para a nova versão (na branch (ramificação) da release) e truncados apropriadamente (na branch stable/current):

source: FreeBSD Ports Collection <uri xlink:href="https://www.FreeBSD.org/ports">https://www.FreeBSD.org/ports</uri>
pt_br: Coleção de Ports do FreeBSD <uri xlink:href="https://www.FreeBSD.org/ports">https://www.FreeBSD.org/port</uri>

source: <application>Sysinstall</application> should be updated to note the number of available ports and the amount of disk space required for the Ports Collection. <_:footnote-1/> This information is currently kept in <filename>src/usr.sbin/bsdinstall/dist.c</filename>.
pt_br: O <application>Sysinstall</application> deve ser atualizado para exibir o número de ports disponíveis e a quantidade de espaço em disco necessária para a Coleção de Ports. <_:footnote-1/> Esta informação é atualmente mantida em <filename>src/usr.sbin/bsdinstall/dist.c</filename>.

source: After the release has been built, a number of files should be updated to announce the release to the world. These files are relative to <literal>head/</literal> within the <literal>doc/</literal> subversion tree.
pt_br: Após a release ter sido construida, vários arquivos devem ser atualizados para anunciar a versão para o mundo. Esses arquivos são relativos a <literal>head/</literal> dentro da árvore <literal>doc/</literal> do subversion.

source: Additionally, update the <quote>BSD Family Tree</quote> file:
pt_br: Além disso, atualize o arquivo da <quote>Árvore Genealógica do BSD</quote>:

source: Creating the Release Tag
pt_br: Criando a Tag de Release

source: When the final release is ready, the following command will create the <literal>release/9.2.0</literal> tag.
pt_br: Quando a versão final estiver pronta, o seguinte comando criará a tag <literal>release/9.2.0</literal>.

source: The Documentation and Ports managers are responsible for tagging their respective trees with the <literal>tags/RELEASE_9_2_0</literal> tag.
pt_br: Os gerentes de Documentação e do Ports são responsáveis por marcar suas respectivas árvores com a tag <literal>tags/RELEASE_9_2_0</literal>.

source: When the Subversion <command>svn cp</command> command is used to create a <emphasis>release tag</emphasis>, this identifies the source at a specific point in time. By creating tags, we ensure that future release builders will always be able to use the exact same source we used to create the official FreeBSD Project releases.
pt_br: Quando o comando <command>svn cp</command> do Subversion é usado para criar uma <emphasis>tag de versão</emphasis>, isso identifica o código fonte em um ponto específico no tempo. Criando tags, nós garantimos que futuros construtores de versões sempre poderão usar exatamente o mesmo código fonte que usamos para criar as releases oficiais do Projeto FreeBSD.

source: Release Building
pt_br: Construção da Release (Versão)

source: FreeBSD <quote>releases</quote> can be built by anyone with a fast machine and access to a source repository. (That should be everyone, since we offer Subversion access! See the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Subversion section in the Handbook</link> for details.) The <emphasis>only</emphasis> special requirement is that the <citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry> device must be available. If the device is not loaded into your kernel, then the kernel module should be automatically loaded when <citerefentry><refentrytitle>mdconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> is executed during the boot media creation phase. All of the tools necessary to build a release are available from the Subversion repository in <filename>src/release</filename>. These tools aim to provide a consistent way to build FreeBSD releases. A complete release can actually be built with only a single command, including the creation of <acronym>ISO</acronym> images suitable for burning to CDROM or DVD, and an FTP install directory. <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> fully documents the <command>src/release/generate-release.sh</command> script which is used to build a release. <command>generate-release.sh</command> is a wrapper around the Makefile target: <command>make release</command>.
pt_br: As <quote>releases</quote> do FreeBSD podem ser construídas por qualquer pessoa com uma máquina rápida e acesso a um repositório de código-fonte. (Isso deveria ser todo mundo, já que oferecemos acesso ao Subversion! Veja a seção sobre <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Subversion</link> no Handbook para detalhes.) O <emphasis>único</emphasis> requisito especial é que o dispositivo <citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry> esteja disponível. Se o dispositivo não estiver carregado em seu kernel, então o módulo do kernel deve ser carregado automaticamente quando o <citerefentry><refentrytitle>mdconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> for executado durante a fase de criação da mídia de boot. Todas as ferramentas necessárias para construir uma release estão disponíveis no repositório Subversion em <filename>src/release</filename>. Essas ferramentas visam fornecer uma maneira consistente de construir versões do FreeBSD. Uma release completa pode ser construída com apenas um único comando, incluindo a criação de imagens <acronym>ISO</acronym> adequadas para gravação em CD-ROM ou DVD e um diretório para instalação por FTP. A pagina de manual <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> documenta completamente o script <command>src/release/generate-release.sh</command> que é usado para construir uma release. O <command>generate-release.sh</command> é um invólucro em torno do target do Makefile: <command>make release</command>.

source: Building a Release
pt_br: Construindo uma Release (Versão)

source: <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> documents the exact commands required to build a FreeBSD release. The following sequences of commands can build an 9.2.0 release:
pt_br: A página de manual <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> documenta os comandos exatos necessários para construir uma Release do FreeBSD. As seguintes sequências de comandos podem construir uma versão 9.2.0:

source: After running these commands, all prepared release files are available in <filename>/local3/release/R</filename> directory.
pt_br: Depois de executar esses comandos, todos os arquivos preparados da versão estarão disponíveis no diretório <filename>/local3/release/R</filename>.

source: The release <filename>Makefile</filename> can be broken down into several distinct steps.
pt_br: O release <filename>Makefile</filename> pode ser dividido em várias etapas distintas.

source: Creation of a sanitized system environment in a separate directory hierarchy with <quote><command>make installworld</command></quote>.
pt_br: Criação de um ambiente de sistema limpo em uma hierarquia de diretório separada com <quote><command>make installworld</command></quote>.

source: Checkout from Subversion of a clean version of the system source, documentation, and ports into the release build hierarchy.
pt_br: Checkout do Subversion de uma versão limpa do código fonte do sistema, da documentação e e da coleção de ports na hierarquia de build do release.

source: Population of <filename>/etc</filename> and <filename>/dev</filename> in the chrooted environment.
pt_br: Popula o <filename>/etc</filename> e o <filename>/dev</filename> no ambiente chrooted (Processo de transferir o diretório root para outro lugar).

source: chroot into the release build hierarchy, to make it harder for the outside environment to taint this build.
pt_br: Faz chroot na hierarquia de build (construção) da release, para tornar mais difícil para o ambiente externo corromper essa construção.

source: <command>make world</command> in the chrooted environment.
pt_br: Execução do comando <command>make world</command> no ambiente chrooted.

source: Build of Kerberos-related binaries.
pt_br: Compilação dos binários relacionados ao Kerberos.

source: Build <filename>GENERIC</filename> kernel.
pt_br: Compilação do kernel <filename>GENERIC</filename>.

source: Creation of a staging directory tree where the binary distributions will be built and packaged.
pt_br: Criação uma árvore de diretórios temporários onde as distribuições binárias serão compiladas e empacotadas.

source: Build and installation of the documentation toolchain needed to convert the documentation source (SGML) into HTML and text documents that will accompany the release.
pt_br: Compilação e instalação do toolchain necessário para converter o fonte da documentação (SGML) em HTML e demais documentos de texto que acompanharão a versão.

source: Build and installation of the actual documentation (user manuals, tutorials, release notes, hardware compatibility lists, and so on.)
pt_br: Compilação e instalação da documentação propriamente dita (manuais do usuário, tutoriais, notas de versão, listas de compatibilidade de hardware e assim por diante).

source: Package up distribution tarballs of the binaries and sources.
pt_br: Empacotamento dos tarballs de distribuição dos binários e fontes.

source: Create FTP installation hierarchy.
pt_br: Criação da hierarquia de instalação por FTP.

source: <emphasis>(optionally)</emphasis> Create ISO images for CDROM/DVD media.
pt_br: <emphasis>(opcionalmente)</emphasis> Criação das imagens ISO para mídia de CDROM/DVD.

source: For more information about the release build infrastructure, please see <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.
pt_br: Para obter maiores informações sobre a infraestrutura de criação de versões, consulte <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.

source: It is important to remove any site-specific settings from <filename>/etc/make.conf</filename>. For example, it would be unwise to distribute binaries that were built on a system with <varname>CPUTYPE</varname> set to a specific processor.
pt_br: É importante remover qualquer configuração específica do seu servidor do <filename>/etc/make.conf</filename>. Por exemplo, seria imprudente distribuir binários que foram compilados em um sistema com <varname>CPUTYPE</varname> configurado para um processador específico.

source: Contributed Software (<quote>ports</quote>)
pt_br: Software Contribuído (<quote>ports</quote>)

source: The <link xlink:href="https://www.FreeBSD.org/ports">FreeBSD Ports collection</link> is a collection of over 24,000 third-party software packages available for FreeBSD. The Ports Management Team <email>portmgr@FreeBSD.org</email> is responsible for maintaining a consistent ports tree that can be used to create the binary packages that accompany official FreeBSD releases.
pt_br: A <link xlink:href="https://www.FreeBSD.org/ports">Coleção de Ports do FreeBSD</link> é uma coleção de mais de 24.000 pacotes de software de terceiros disponíveis para o FreeBSD. A Equipe de Gerenciamento de Ports <email>portmgr@FreeBSD.org</email> é responsável por manter uma árvore de ports consistente que pode ser usada para criar os pacotes binários que acompanham as releases oficiais do FreeBSD.

source: Release ISOs
pt_br: ISOs das Releases (Versões)

source: Starting with FreeBSD 4.4, the FreeBSD Project decided to release all four ISO images that were previously sold on the <emphasis>BSDi/Wind River Systems/FreeBSD Mall</emphasis> <quote>official</quote> CDROM distributions. Each of the four discs must contain a <filename>README.TXT</filename> file that explains the contents of the disc, a <filename>CDROM.INF</filename> file that provides meta-data for the disc so that <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> can validate and use the contents, and a <filename>filename.txt</filename> file that provides a manifest for the disc. This <emphasis>manifest</emphasis> can be created with a simple command:
pt_br: Começando no FreeBSD 4.4, o Projeto FreeBSD decidiu liberar todas as quatro imagens ISO que eram vendidas anteriormente nas distribuições <quote>oficiais</quote> em CDROM pela <emphasis>BSRi/Wind River Systems/FreeBSD Mall</emphasis>. Cada um dos quatro discos deve conter um arquivo <filename>README.TXT</filename> que explica o conteúdo do disco, um arquivo <filename>CDROM.INF</filename> que fornece metadados do disco para que o <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> possa validar e usar o conteúdo, e um arquivo <filename>filename.txt</filename> que fornece um manifesto para o disco. Este <emphasis>manifesto</emphasis> pode ser criado com um simples comando:

source: The specific requirements of each CD are outlined below.
pt_br: Os requisitos específicos de cada CD são descritos abaixo.

source: Disc 1
pt_br: Disco 1

source: The first disc is almost completely created by <command>make release</command>. The only changes that should be made to the <filename>disc1</filename> directory are the addition of a <filename>tools</filename> directory, and as many popular third party software packages as will fit on the disc. The <filename>tools</filename> directory contains software that allow users to create installation floppies from other operating systems. This disc should be made bootable so that users of modern PCs do not need to create installation floppy disks.
pt_br: O primeiro disco é quase completamente criado por <command>make release</command>. As únicas alterações que devem ser feitas no diretório <filename>disc1</filename> são a adição de um diretório <filename>tools</filename> e tantos pacotes de software de terceiros quanto couberem no disco. O diretório <filename>tools</filename> contém software que permite aos usuários criar disquetes de instalação a partir de outros sistemas operacionais. Esse disco deve ser inicializado para que os usuários dos PCs modernos não precisem criar disquetes de instalação.

source: If a custom kernel of FreeBSD is to be included, then <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> must be updated to include installation instructions. The relevant code is contained in <filename>src/release</filename> and <filename>src/usr.sbin/bsdinstall</filename>. Specifically, the file <filename>src/release/Makefile</filename>, and <filename>dist.c</filename>, <filename>dist.h</filename>, <filename>menus.c</filename>, <filename>install.c</filename>, and <filename>Makefile</filename> will need to be updated under <filename>src/usr.sbin/bsdinstall</filename>. Optionally, you may choose to update <filename>bsdinstall.8</filename>.
pt_br: Se um kernel customizado do FreeBSD precisa ser incluído, então o <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> e o <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> deve ser atualizado para incluir instruções de instalação. O código relevante está contido em <filename>src/release</filename> e <filename>src/usr.sbin/bsdinstall</filename>. Especificamente, os arquivos <filename>src/release/Makefile</filename>, <filename>dist.c</filename>, <filename>dist.h</filename>, <filename>menus.c</filename> , <filename>install.c</filename>, e <filename>Makefile</filename> precisarão ser atualizados em <filename>src/usr.sbin/bsdinstall</filename>. Opcionalmente, você pode escolher atualizar o <filename>bsdinstall.8</filename>.

source: Disc 2
pt_br: Disco 2

source: The second disc is also largely created by <command>make release</command>. This disc contains a <quote>live filesystem</quote> that can be used from <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> to troubleshoot a FreeBSD installation. This disc should be bootable and should also contain a compressed copy of the CVS repository in the <filename>CVSROOT</filename> directory and commercial software demos in the <filename>commerce</filename> directory.
pt_br: O segundo disco também é largamente criado por <command>make release</command>. Este disco contém um <quote>live filesystem</quote> que pode ser usado por <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> para solucionar problemas de instalação do FreeBSD. Este disco deve ser inicializável e também deve conter uma cópia compactada do repositório CVS no diretório <filename>CVSROOT</filename> e demos de software comercial no diretório <filename>commerce</filename>.

source: Multi-volume Support
pt_br: Suporte para vários volumes

source: <application>Sysinstall</application> supports multiple volume package installations. This requires that each disc have an <filename>INDEX</filename> file containing all of the packages on all volumes of a set, along with an extra field that indicates which volume that particular package is on. Each volume in the set must also have the <literal>CD_VOLUME</literal> variable set in the <filename>cdrom.inf</filename> file so that bsdinstall can tell which volume is which. When a user attempts to install a package that is not on the current disc, bsdinstall will prompt the user to insert the appropriate one.
pt_br: O <application>Sysinstall</application> suporta a instalação de pacotes a partir de vários volumes. Isso requer que cada disco tenha um arquivo <filename>INDEX</filename> contendo todos os pacotes em todos os volumes de um conjunto, junto com um campo extra que indica em qual volume esse pacote específico está. Cada volume no conjunto também deve ter a variável <literal>CD_VOLUME</literal> definida no arquivo <filename>cdrom.inf</filename> para que o bsdinstall possa informar qual volume é qual. Quando um usuário tentar instalar um pacote que não esteja no disco atual, o bsdinstall solicitará que o usuário insira o disco apropriado.

source: Distribution
pt_br: Distribuição

source: FTP Sites
pt_br: Sites FTP

source: When the release has been thoroughly tested and packaged for distribution, the master FTP site must be updated. The official FreeBSD public FTP sites are all mirrors of a master server that is open only to other FTP sites. This site is known as <systemitem>ftp-master</systemitem>. When the release is ready, the following files must be modified on <systemitem>ftp-master</systemitem>:
pt_br: Quando a release for totalmente testada e empacotada para distribuição, o site FTP principal deverá ser atualizado. Os sites de FTP públicos oficiais do FreeBSD são todos espelhos de um servidor principal que está acessível somente a outros sites FTP. Este site é conhecido como <systemitem>ftp-master</systemitem>. Quando a release estiver pronta, os seguintes arquivos devem ser modificados no <systemitem>ftp-master</systemitem>:

source: The installable FTP directory as output from <command>make release</command>.
pt_br: O diretório FTP instalável como saída de <command>make release</command>.

source: The complete package build for this release.
pt_br: O pacote completo criado para esta versão.

source: A symlink to <filename>../../../tools</filename>.
pt_br: Um link simbólico para <filename>../../../tools</filename>.

source: A symlink to <filename>../../../ports/<replaceable>arch</replaceable>/packages-<replaceable>X.Y</replaceable>-release</filename>.
pt_br: Um link simbólico para <filename>../../../ports/<replaceable>arch</replaceable>/packages-<replaceable>X.Y</replaceable>-release</filename>.

source: The ISO images. The <quote>*</quote> is <filename>disc1</filename>, <filename>disc2</filename>, etc. Only if there is a <filename>disc1</filename> and there is an alternative first installation CD (for example a stripped-down install with no windowing system) there may be a <filename>mini</filename> as well.
pt_br: As imagens ISO. O <quote>*</quote> é o <filename>disc1</filename>, <filename> disc2 </filename>, etc. Somente se houver um <filename>disc1</filename> e houver um CD alternativo para o primeiro disco de instalação (por exemplo, uma instalação simplificada sem sistema de janelas) também pode haver um <filename>mini</filename>.

source: For more information about the distribution mirror architecture of the FreeBSD FTP sites, please see the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/hubs/">Mirroring FreeBSD</link> article.
pt_br: Para mais informações sobre a arquitetura do sistema de espelhamento dos sites de FTP para distribuição do FreeBSD, por favor veja o artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/hubs/">Espelhando o FreeBSD</link>.
