<!--
     The FreeBSD Documentation Project

     $FreeBSD$
-->

<chapter id="introduction">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Jim</firstname>
        <surname>Mock</surname>
        <contrib>Restructured, reorganized, and parts
          rewritten by </contrib>
      </author>
    </authorgroup>
  </chapterinfo>

  <title>Introducci&oacute;n</title>

  <sect1 id="introcution-synopsis">
    <title>Sinopsis</title>

    <para>¡Gracias por tu inter&eacute;s en FreeBSD!  El siguiente cap&iacute;tulo
      trata varios temas relativos al Proyecto FreeBSD, como su historia,
      objetivos, modelo de desarrollo, etc.</para>

    <para>Despu&eacute;s de leer este cap&iacute;tulo sabr&aacute;s:</para>

    <itemizedlist>
      <listitem>
        <para>Qu&eacute; relaci&oacute;n guarda FreeBSD con otros sistemas
        operativos.</para>
      </listitem>
      <listitem>
        <para>La historia del Proyecto FreeBSD.</para>
      </listitem>
      <listitem>
        <para>Los objetivos del Proyecto FreeBSD.</para>
      </listitem>
      <listitem>
        <para>Los fundamentos del modelo de desarrollo de c&oacute;digo abierto
          de FreeBSD.</para>
      </listitem>
      <listitem>
        <para>Y por supuesto: de d&oacute;nde procede el nombre "FreeBSD".</para>
      </listitem>
    </itemizedlist>

  </sect1>

  <sect1 id="nutshell">
    <title>¡Bienvenido a FreeBSD!</title>
    <indexterm><primary>4.4BSD-Lite</primary></indexterm>
    <para>FreeBSD es un sistema operativo basado en 4.4BSD-Lite para la
      arquitectura Intel (x86) y sistemas basados en DEC Alpha. Se est&aacute;
      trabajando tambi&eacute;n en versiones para otras arquitecturas.  Para
      una breve perspectiva general de FreeBSD consulta la <link
      linkend="nutshell">siguiente secci&oacute;n</link>.  Puedes tambi&eacute;n leer
      sobre <link linkend="history">la historia de FreeBSD</link>, o
      sobre la <link linkend="relnotes">distribuci&oacute;n actual</link>.  Si
      est&aacute;s interesado en contribuir de alg&uacute;n modo al proyecto (c&oacute;digo,
      hardware, billetes sin marcar), m&iacute;rate el art&iacute;culo <ulink
      url="../../articles/contributing/index.html">Contribuir a
      FreeBSD</ulink>.</para>

    <sect2 id="os-overview">
      <title>¿Qu&eacute; puede hacer FreeBSD?</title>

      <para>FreeBSD tiene muchas caracter&iacute;sticas notables.  Algunas de
        ellas son:</para>

      <itemizedlist>
        <indexterm><primary>multitarea expropiativa</primary></indexterm>
        <listitem>
          <para><emphasis>Multitarea expropiativa</emphasis> con
            prioridades din&aacute;micamente ajustadas para asegurar que
            distintas aplicaciones y usuarios compartan el ordenador de
            un modo equitativo, incluso bajo la mayor de las
            cargas.</para>
        </listitem>

        <indexterm><primary>servicios multiusuario</primary></indexterm>
        <listitem>
          <para><emphasis>Servicios multiusuario</emphasis> que permiten
            a mucha gente usar un sistema FreeBSD simult&aacute;neamente para
            distintas cosas.  Esto significa, por ejemplo, que los
            perif&eacute;ricos del sistema como impresoras y dispositivos de
            cinta son compartidos adecuadamente por varios usuarios del
            sistema o la red, y que pueden establecerse l&iacute;mites sobre
            recursos concretos para usuarios o grupos de usuarios,
            protegiendo de este modo al sistema de posibles
            abusos.</para>
        </listitem>

        <indexterm><primary>redes TCP/IP</primary></indexterm>
        <listitem>
          <para>Conexi&oacute;n de <emphasis>redes TCP/IP</emphasis> muy
            robusta, con soporte para est&aacute;ndares industriales como SLIP,
            PPP, NFS, DHCP, y NIS.  Esto quiere decir que tu m&aacute;quina
            FreeBSD puede interoperar f&aacute;cilmente con otros sistemas y
            hacer de servidor en una empresa, proporcionando importantes
            funciones como NFS (acceso a ficheros remotos) y servicios
            de correo electr&oacute;nico, o poniendo a tu organizaci&oacute;n en
            Internet con WWW, FTP, servicios de enrutado y
            cortafuegos.</para>
        </listitem>

        <indexterm><primary>protecci&oacute;n de memoria</primary></indexterm>
        <listitem>
           <para>La <emphasis>protecci&oacute;n de memoria</emphasis> garantiza
            que las aplicaciones (o los usuarios) no pueden
            interferirse.  Un error fatal en una aplicaci&oacute;n no afecta al
            resto.</para>
        </listitem>

        <listitem>
          <para>FreeBSD es un sistema operativo de
            <emphasis>32-bits</emphasis> (de <emphasis>64-bits</emphasis>
            sobre Alpha) y fue diseñado como tal desde el
            comienzo.</para>
        </listitem>

        <indexterm>
          <primary>X Window System</primary>
          <seealso>XFree86</seealso>
        </indexterm>
        <listitem>
          <para><emphasis>X Window System</emphasis> (X11R6), est&aacute;ndar
            de la industria, provee a los usuarios de una interfaz
            gr&aacute;fica (GUI) por el coste de una tarjeta VGA y un monitor
            comunes, y viene con los fuentes completos.</para>
        </listitem>

        <indexterm>
          <primary>compatibilidad binaria</primary>
          <secondary>Linux</secondary>
        </indexterm>
        <indexterm>
          <primary>compatibilidad binaria</primary>
          <secondary>SCO</secondary>
        </indexterm>
        <indexterm>
          <primary>compatibilidad binaria</primary>
          <secondary>SVR4</secondary>
        </indexterm>
        <indexterm>
          <primary>compatibilidad binaria</primary>
          <secondary>BSD/OS</secondary>
        </indexterm>
        <indexterm>
          <primary>compatibilidad binaria</primary>
          <secondary>NetBSD</secondary>
        </indexterm>
        <listitem>
          <para><emphasis>Compatibilidad binaria</emphasis> con muchos
            programas nativos de Linux, SCO, SVR4, BSDI y NetBSD.</para>
        </listitem>

        <listitem>
          <para>Miles de aplicaciones <emphasis>listas para ser
            usadas</emphasis> se hallan disponibles en la colecci&oacute;n de
            <emphasis>ports</emphasis> y <emphasis>paquetes</emphasis>.
            ¿Para qu&eacute; buscar en la red si puedes encontrarlo todo aqu&iacute;
            mismo?</para>
        </listitem>

        <listitem>
          <para>Miles de aplicaciones <emphasis>f&aacute;ciles de
            portar</emphasis> se encuentran disponibles en Internet.
            FreeBSD tiene un c&oacute;digo fuente compatible con el de los m&aacute;s
            populares sistemas Unix comerciales y por ello la mayor&iacute;a de
            las aplicaciones tan s&oacute;lo necesitan unos pocos cambios, si
            alguno, para compilar.</para>
        </listitem>

        <indexterm><primary>memoria virtual</primary></indexterm>
        <listitem>
          <para>El diseño de la <emphasis>memoria virtual</emphasis> con
            paginaci&oacute;n bajo demanda y de la <quote>cach&eacute; unificada de
            VM/buffer</quote> satisface a aplicaciones que requieren
            grandes cantidades de memoria de forma eficiente aun
            dando respuestas interactivas a otros usuarios.</para>
        </listitem>

        <indexterm>
          <primary>Multiprocesamiento sim&eacute;trico (SMP)</primary>
        </indexterm>
        <listitem>
          <para>Soporte para <emphasis>SMP</emphasis> en m&aacute;quinas con
            m&uacute;ltiples CPUs.</para>
        </listitem>

        <indexterm>
          <primary>compiladores</primary>
          <secondary>C</secondary>
        </indexterm>
        <indexterm>
          <primary>compiladores</primary>
          <secondary>C++</secondary>
        </indexterm>
        <indexterm>
          <primary>compiladores</primary>
          <secondary>Fortran</secondary>
        </indexterm>
        <listitem>
          <para>Una colecci&oacute;n completa de herramientas de desarrollo en
            <emphasis>C</emphasis>, <emphasis>C++</emphasis>,
            <emphasis>Fortran</emphasis>, y <emphasis>Perl</emphasis>.
            Muchos m&aacute;s lenguajes adicionales para investigaci&oacute;n y
            desarrollo avanzados se encuentran tambi&eacute;n disponibles en la
            colecci&oacute;n de ports y paquetes.</para>
        </listitem>

        <indexterm><primary>c&oacute;digo fuente</primary></indexterm>
        <listitem>
          <para>Disponer del <emphasis>c&oacute;digo fuente</emphasis> del
            sistema entero significa contar con el mayor nivel de
            control posible sobre tu entorno.  ¿Para qu&eacute; ligarte a una
            soluci&oacute;n propietaria a la merced de un fabricante cuando
            puedes tener un verdadero sistema abierto?</para>
        </listitem>

        <listitem>
          <para>Extensa <emphasis>documentaci&oacute;n en
            l&iacute;nea</emphasis>.</para>
        </listitem>

        <listitem>
          <para><emphasis>¡Y mucho m&aacute;s!</emphasis></para>
        </listitem>
      </itemizedlist>

      <indexterm><primary>4.4BSD-Lite</primary></indexterm>
      <indexterm>
        <primary>Computer Systems Research Group (CSRG)</primary>
      </indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <para>FreeBSD est&aacute; basado en la versi&oacute;n 4.4BSD-Lite del Computer
        Systems Research Group (CSRG) de la Universidad de California en
        Berkeley, y contin&uacute;a la distinguida tradici&oacute;n de desarrollo de
        sistemas BSD.  Adem&aacute;s del excelente trabajo del CSRG, el
        Proyecto FreeBSD ha invertido miles de horas en ajustar el
        sistema para conseguir un rendimiento y una fiabilidad m&aacute;ximos
        en situaciones de carga reales.  Mientras que muchos de los
        gigantes comerciales se esfuerzan en dotar a los sistemas
        operativos para PCs de esas caracter&iacute;sticas, rendimiento y
        fiabilidad, FreeBSD puede ofrecerlas
        ¡<emphasis>ya</emphasis>!</para>

      <para>Las posibles aplicaciones en las que puede usarse FreeBSD
        est&aacute;n en verdad limitadas tan s&oacute;lo por tu imaginaci&oacute;n.  Desde
        desarrollo de programas hasta automatizaci&oacute;n de f&aacute;bricas, desde
        control de inventarios hasta correcci&oacute;n de azimut de antenas de
        sat&eacute;lites remotos; si puede realizarse con un Unix comercial lo
        m&aacute;s seguro es que tambi&eacute;n pueda llevarse a cabo con FreeBSD.
        FreeBSD tambi&eacute;n se beneficia de las literalmente miles de
        aplicaciones de alta calidad desarrolladas en centros de
        investigaci&oacute;n y universidades de todo el mundo, frecuentemente
        disponibles por poco o ning&uacute;n coste.  Tambi&eacute;n se dispone de
        aplicaciones comerciales, cuyo n&uacute;mero aumenta cada d&iacute;a.</para>

      <para>Dado que el c&oacute;digo fuente de FreeBSD est&aacute; disponible, el
        sistema puede ser tambi&eacute;n personalizado en un grado nunca visto
        para aplicaciones o proyectos especiales, y de maneras
        generalmente no posibles con los sistemas operativos de la
        mayor&iacute;a de los fabricantes comerciales.  Aqu&iacute; damos tan s&oacute;lo una
        muestra de aplicaciones en las que se est&aacute; actualmente usando
        FreeBSD:</para>
        
      <itemizedlist>
      <listitem>
        <para><emphasis>Servicios de Internet:</emphasis> La robusta
          conectividad TCP/IP integrada en FreeBSD hace de este sistema
          una plataforma ideal para servicios Internet como:</para>

        <itemizedlist>
          <indexterm><primary>servidores FTP</primary></indexterm>
          <listitem>
            <para>servidores FTP</para>
          </listitem>

          <indexterm><primary>servidores web</primary></indexterm>
          <listitem>
            <para>Servidores web (est&aacute;ndares o seguros [SSL])</para>
          </listitem>

          <indexterm><primary>cortafuegos</primary></indexterm>
          <indexterm><primary>enmascaramiento IP</primary></indexterm>
          <listitem>
            <para>Cortafuegos y pasarelas NAT (<quote>enmascaramiento
              IP</quote>).</para>
          </listitem>

          <indexterm><primary>correo electr&oacute;nico</primary></indexterm>
          <listitem>
            <para>Servidores de correo electr&oacute;nico</para>
          </listitem>

          <indexterm><primary>USENET</primary></indexterm>
          <listitem>
            <para>USENET y BBSs</para>
          </listitem>

          <listitem>
            <para>Y m&aacute;s...</para>
          </listitem>
        </itemizedlist>

        <para>Con FreeBSD puedes empezar f&aacute;cilmente con un econ&oacute;mico 386
          e ir actualizando tu equipo hasta un tetraprocesador Xeon con
          almacenamiento RAID a medida que tu proyecto crezca.</para>
      </listitem>

      <listitem>
        <para><emphasis>Educaci&oacute;n:</emphasis> ¿Eres estudiante de
          inform&aacute;tica o de alg&uacute;n campo de la ingenier&iacute;a relacionado?  No
          hay mejor modo de estudiar sistemas operativos, arquitectura
          de computadores y redes que la experiencia a bajo nivel que
          FreeBSD puede aportar.  Para aqu&eacute;llos cuyo principal inter&eacute;s
          en los ordenadores no es otro que el de poder realizar su
          trabajo existe una serie de paquetes gratuitos de CAD,
          matem&aacute;ticas, diseño gr&aacute;fico, etc., que hacen de FreeBSD un
          sistema verdaderamente &uacute;til.</para>
      </listitem>

      <listitem>
        <para><emphasis>Investigaci&oacute;n:</emphasis> Encontr&aacute;ndose
          disponible el c&oacute;digo fuente del sistema entero, FreeBSD es una
          excelente plataforma para la investigaci&oacute;n en sistemas
          operativos y otras ramas de la inform&aacute;tica.  El hecho de que
          FreeBSD est&eacute; disponible gratuitamente hace posible que grupos
          remotos puedan colaborar con ideas o compartan desarrollos sin
          tener que preocuparse de acuerdos en licencias especiales o de
          limitaciones acerca de lo que puede discutirse en foros
          p&uacute;blicos.</para>
      </listitem>

      <indexterm><primary>enrutado</primary></indexterm>
      <indexterm><primary>servidor DNS</primary></indexterm>
      <listitem>
        <para><emphasis>Redes:</emphasis> ¿Necesitas un nuevo enrutador?
          ¿Un servidor de nombres (DNS)?  ¿Un cortafuegos para mantener
          a la gente fuera de tu red interna?  FreeBSD puede convertir
          aquel 386 o 486 arrinconado en un enrutador avanzado con
          sofisticadas capacidades de filtrado de paquetes
          f&aacute;cilmente.</para>
      </listitem>

      <indexterm>
        <primary>X Window System</primary>
        <secondary>XFree86</secondary>
      </indexterm>
      <indexterm>
        <primary>X Window System</primary>
        <secondary>X acelerada</secondary>
      </indexterm>
      <listitem>
        <para><emphasis>Estaci&oacute;n de trabajo X:</emphasis> FreeBSD es una
          magn&iacute;fica elecci&oacute;n como terminal X de bajo coste, ya sea
          usando el libremente disponible servidor XFree86 o uno de los
          excelentes servidores comerciales de X Inside.  A diferencia
          de las terminales X, FreeBSD permite ejecutar muchas
          aplicaciones localmente, si as&iacute; se quiere, aligerando de este
          modo la carga soportada por un servidor central.  FreeBSD
          puede incluso arrancar <quote>sin disco</quote>, permitiendo
          que las estaciones sean a&uacute;n m&aacute;s econ&oacute;micas y f&aacute;ciles de
          administrar.</para>
      </listitem>

      <indexterm><primary>colecci&oacute;n de compiladores GNU</primary></indexterm>
      <listitem>
        <para><emphasis>Desarrollo de software:</emphasis> El sistema
          base de FreeBSD viene con una completa colecci&oacute;n de
          herramientas de desarrollo que incluyen el famoso compilador y
          depurador de C/C++ de GNU.</para>
      </listitem>
    </itemizedlist>

    <para>Los fuentes y binarios de FreeBSD se hallan disponibles en
      CDROM y por FTP an&oacute;mimo.  Por favor, consulta <xref
      linkend="mirrors"> para m&aacute;s informaci&oacute;n sobre c&oacute;mo conseguir
      FreeBSD.</para>
  </sect2>

  <sect2>
    <title>¿Qui&eacute;n usa FreeBSD?</title>

      <indexterm>
        <primary>Usuarios</primary>
        <secondary>Grandes sitios corriendo FreeBSD</secondary>
      </indexterm>

      <para>Sobre FreeBSD corren algunos de los m&aacute;s grandes sitios web
        incluyendo:</para>

      <itemizedlist>
        <indexterm><primary>Yahoo!</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.yahoo.com/">Yahoo!</ulink></para>
        </listitem>

        <indexterm><primary>Apache</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.apache.org/">Apache</ulink></para>
        </listitem>

        <indexterm><primary>Blue Mountain Arts</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.bluemountain.com/">Blue Mountain
	    Arts</ulink></para>
        </listitem>

        <indexterm><primary>Pair Networks</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.pair.com/">Pair
            Networks</ulink></para>
        </listitem>

        <indexterm><primary>Sony Jap&oacute;n</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.sony.co.jp/">Sony
            Jap&oacute;n</ulink></para>
        </listitem>

        <indexterm><primary>Netcraft</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.netcraft.com/">Netcraft</ulink>
            </para>
        </listitem>

        <indexterm><primary>Weathernews</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.wni.com/">Weathernews</ulink></para>
        </listitem>

        <indexterm><primary>Supervalu</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.supervalu.com/">Supervalu</ulink></para>
        </listitem>

        <indexterm><primary>TELEHOUSE America</primary></indexterm>
        <listitem>
          <para><ulink url="http://www.telehouse.com/">TELEHOUSE America</ulink></para>
        </listitem>

	<indexterm><primary>Sophos Anti-Virus</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.sophos.com/">Sophos
	    Anti-Virus</ulink></para>
	</listitem>

	<indexterm><primary>JMA Wired</primary></indexterm>
	<listitem>
	  <para><ulink
	    url="http://www.jmawired.com/">JMA Wired</ulink></para>
	</listitem>
      </itemizedlist>

      <para>y muchos m&aacute;s.</para>
    </sect2>

  </sect1>

  <sect1 id="history">
    <title>Acerca del proyecto FreeBSD</title>

    <para>En la siguiente secci&oacute;n se explican ciertos aspectos del
      proyecto, una breve historia, objetivos, y modelo de
      desarrollo.</para>

    <sect2 id="intro-history">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Jordan</firstname>
            <surname>Hubbard</surname>
            <contrib>Contributed by </contrib>
          </author>
        </authorgroup>
      </sect2info>

      <title>Breve historia de FreeBSD</title>

      <indexterm><primary>386BSD Patchkit</primary></indexterm>
      <indexterm><primary>Hubbard, Jordan</primary></indexterm>
      <indexterm><primary>Williams, Nate</primary></indexterm>
      <indexterm><primary>Grimes, Rod</primary></indexterm>
      <indexterm>
        <primary>Proyecto FreeBSD</primary>
        <secondary>Historia</secondary>
      </indexterm>
      <para>La g&eacute;nesis del proyecto FreeBSD se remonta a comienzos de
        1993, en parte como una extensi&oacute;n del <quote>Unofficial 386BSD
        Patchkit</quote> debida a los tres &uacute;ltimos coordinadores del
        patchkit: Nate Williams, Rod Grimes y yo mismo.</para>

      <indexterm><primary>386BSD</primary></indexterm>
      <para>Nuestro objetivo original era producir una instant&aacute;nea de
        386BSD intermedia para arreglar una serie de problemas que no se
        pod&iacute;an solventar v&iacute;a patchkits.  Algunos quiz&aacute; record&eacute;is que el
        primer nombre del proyecto fue <quote>386BSD 0.5</quote> o
        <quote>386BSD Interim</quote> en referencia a ese hecho.</para>

      <indexterm><primary>Jolitz, Bill</primary></indexterm>

      <para>386BSD era el sistema operativo de Bill Jolitz, que hasta
        ese punto hab&iacute;a estado sufriendo severamente las consecuencias
        de pr&aacute;cticamente un año que m&aacute;s vale olvidar.  A medida que el
        patchkit se iba haciendo m&aacute;s inc&oacute;modo d&iacute;a a d&iacute;a, nosotros
        estuvimos un&aacute;nimente de acuerdo en que algo se ten&iacute;a que hacer y
        decidimos ayudar a Bill ofreciendo esta instant&aacute;nea
        <quote>limpia</quote> como &iacute;nterin.  Aquellos planes fueron
        bruscamente interrumpidos cuando Bill Jolitz de repente decidi&oacute;
        retirar su aprobaci&oacute;n al proyecto sin ninguna indicaci&oacute;n clara
        de lo que en su lugar deber&iacute;a hacerse.</para>

      <indexterm><primary>Greenman, David</primary></indexterm>
      <indexterm><primary>CDROM de Walnut Creek</primary></indexterm>
      <para>No tardamos mucho en decidir que el objetivo segu&iacute;a valiendo
        la pena, aun sin el soporte de Bill, y fue as&iacute; que adoptamos el
        nombre <quote>FreeBSD</quote>, debido a David Greenman.
        Nuestros objetivos iniciales se fijaron una vez consultamos a
        los usuarios del sistema, y cuando qued&oacute; claro que el proyecto
        estaba en marcha y que pod&iacute;a llegar a ser una realidad contact&eacute;
        con Walnut Creek CDROM con la idea de mejorar los canales de
        distribuci&oacute;n de FreeBSD en CD, pero hasta llegamos a disponer de
        una m&aacute;quina con la que trabajar y una conexi&oacute;n a Internet
        r&aacute;pida.  Sin la fe casi sin precedentes que tuvo Walnut Creek
        CDROM en lo que era por aquel tiempo un proyecto completamente
        desconocido, es bastante improbable que FreeBSD hubiera logrado
        tanto y tan r&aacute;pido como ha logrado hoy por hoy.</para>

      <indexterm><primary>4.3BSD-Lite</primary></indexterm>
      <indexterm><primary>Net/2</primary></indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <indexterm><primary>386BSD</primary></indexterm>
      <indexterm><primary>Free Software Foundation</primary></indexterm>
      <para>La primera distribuci&oacute;n en CDROM (y disponible por la red)
        fue FreeBSD 1.0, publicado en diciembre de 1993.  Estaba basado
        en la cinta de U.C. Berkeley del 4.3BSD-Lite
        (<quote>Net/2</quote>), con bastantes componentes de 386BSD y la
        Free Software Foundation.  Fue un logro bastante razonable para
        una primera versi&oacute;n, y le sigui&oacute; FreeBSD 1.1 en mayo de 1994,
        que tuvo un gran &eacute;xito.</para>

      <indexterm><primary>Novell</primary></indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <indexterm><primary>Net/2</primary></indexterm>
      <indexterm><primary>AT&amp;amp;T</primary></indexterm>
      <para>Por entonces se formaron unos inesperados nubarrones en el
        horizonte ya que Novell y U.C. Berkeley resolvieron el largo
        juicio acerca del estatus legal de la cinta de Berkeley Net/2.
        Una condici&oacute;n del acuerdo fue la concesi&oacute;n por parte de
        U.C. Berkeley de que una gran parte de Net/2 era c&oacute;digo
        <quote>gravado</quote> y propiedad de Novell, quien a su vez lo
        hab&iacute;a adquirido de AT&amp;T anteriormente.  Berkeley obtuvo a
        cambio de Novell el <quote>benepl&aacute;cito</quote> para que
        4.4BSD-Lite, cuando saliera, fuera declarado como no-gravado y
        se instara a los usuarios de Net/2 a cambiar.  Esto inclu&iacute;a a
        FreeBSD, y se dio hasta julio de 1994 para dejar de sacar su
        propio producto basado en Net/2.  Bajo los t&eacute;rminos de aquel
        acuerdo, se le permit&iacute;a al proyecto sacar una &uacute;ltima versi&oacute;n
        antes de la fecha l&iacute;mite, esa versi&oacute;n fue FreeBSD
        1.1.5.1.</para>

      <para>FreeBSD tuvo entonces que acometer la &aacute;rdua tarea de
        literalmente reinventarse a s&iacute; mismo a partir de trozos nuevos y
        bastante incompletos de 4.4BSD-Lite.  Las versiones
        <quote>Lite</quote> eran ligeras en parte porque el CSRG de
        Berkeley quit&oacute; grandes partes del c&oacute;digo necesario para
        construir un sistema que pudiera arrancar (debido a diversos
        requisitos legales) y porque la versi&oacute;n del 4.4 para Intel era
        muy incompleta.  No fue hasta noviembre de 1994 que el proyecto
        realiz&oacute; esa transici&oacute;n, en ese punto sac&oacute; FreeBSD 2.0 en la red
        y en CDROM (a finales de diciembre).  A pesar de no estar
        suficientemente pulida, esta distribuci&oacute;n fue un &eacute;xito
        significativo y le sigui&oacute; el m&aacute;s robusto y f&aacute;cil de instalar
        FreeBSD 2.0.5 en junio de 1995.</para>

      <para>Sacamos FreeBSD 2.1.5 en agosto de 1996, y pareci&oacute; ser
        suficientemente popular entre ISPs y otras comunidades
        comerciales como para que mereciera otra versi&oacute;n de la rama
        2.1-STABLE.  Ésa fue FreeBSD 2.1.7.1, publicada en febrero de
        1997, que marc&oacute; el final de la l&iacute;nea principal de desarrollo en
        2.1-STABLE.  Una vez en modo mantenimiento, en esa rama
        (RELENG_2_1_0) s&oacute;lo se har&iacute;an ya mejoras en seguridad y
        correcciones de errores cr&iacute;ticos.</para>

      <para>FreeBSD se ramific&oacute; desde la l&iacute;nea principal de desarrollo
        (<quote>-CURRENT</quote>) en noviembre de 1996 como la rama
        RELENG_2_2, y la primera versi&oacute;n completa (2.2.1) sali&oacute; en abril
        de 1997.  Se hicieron m&aacute;s versiones de la rama 2.2 en verano y
        otoño de 1997, la &uacute;ltima de las cuales (2.2.8) apareci&oacute; en
        noviembre de 1998.  La primera versi&oacute;n 3.0 oficial sali&oacute; en
        octubre de 1998 y marc&oacute; el inicio del fin de la rama 2.2.</para>

      <para>El &aacute;rbol se ramific&oacute; de nuevo el 20 de enero de 1999, dando
        lugar a las ramas 4.0-CURRENT y 3.X-STABLE.  De la 3.X-STABLE,
        3.1 sali&oacute; el 15 de febrero de 1999, 3.2 el 15 de mayo de 1999,
        3.3 el 16 de septiembre de 1999, 3.4 el 20 de diciembre de 1999,
        y 3.5 el 24 de junio de 2000, a la que sigui&oacute; pocos d&iacute;as despu&eacute;s
        una actualizaci&oacute;n menor, la 3.5.1, que incorporaba mejoras de
        seguridad de &uacute;ltima hora para Kerberos.  Ésa fue la &uacute;ltima
        versi&oacute;n de la rama 3.X.</para>

      <para>Hubo otra ramificaci&oacute;n el 13 de marzo de 2000, que di&oacute; lugar
        a la rama 4.X-STABLE, considerada ahora la "actual rama
        -stable".  Han habido varias versiones de la misma desde
        entonces: 4.0-RELEASE sali&oacute; en marzo de 2000, 4.3 en abril de
        2001, y 4.4 en septiembre de 2001.  Habr&aacute; m&aacute;s versiones de
        la rama 4.X-STABLE (RELENG_4) entrado 2002.</para>

      <para>Proyectos a largo plazo siguen teniendo lugar en la rama
        (principal) 5.0-CURRENT, e instant&aacute;neas de la 5.0 en CDROM (y,
        naturalmente, en la red) se hallan cont&iacute;nuamente disponibles
        desde <ulink
        url="ftp://current.FreeBSD.org/pub/FreeBSD/snapshots/">el
        servidor de instant&aacute;neas</ulink> a medida que el trabajo
        progresa.</para> 
    </sect2>

    <sect2 id="goals">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Jordan</firstname>
            <surname>Hubbard</surname>
            <contrib>Contributed by </contrib>
          </author>
        </authorgroup>
      </sect2info>

      <title>Objetivos del Proyecto FreeBSD</title>

      <indexterm>
        <primary>Proyecto FreeBSD</primary>
        <secondary>Objetivos</secondary>
      </indexterm>
      <para>Los objetivos del Proyecto FreeBSD son proveer software que
        pueda ser usado con cualquier prop&oacute;sito y sin compromiso alguno.
        Muchos de nosotros participamos significativamente en el c&oacute;digo
        (y en el proyecto) y ciertamente no nos importar&iacute;a recibir una
        pequeña compensaci&oacute;n econ&oacute;mica de vez en cuando, pero
        decididamente no estamos dispuestos a insitir en ello.  Creemos
        que nuestra m&aacute;s importante y primordial <quote>misi&oacute;n</quote> es
        dar c&oacute;digo a todo el que venga, y para lo que quiera, de manera
        que el c&oacute;digo sea tan usado y d&eacute; tanto provecho como sea
        posible.  Creo que &eacute;ste es uno de los objetivos m&aacute;s
        fundamentales del software libre y uno que nosotros apoyamos con
        entusiasmo.</para>

      <indexterm>
        <primary>GNU General Public License (GPL)</primary>
      </indexterm>
      <indexterm>
        <primary>GNU Lesser General Public License (LGPL)</primary>
      </indexterm>
      <indexterm><primary>Copyright BSD</primary></indexterm>
      <para>El c&oacute;digo fuente de nuestro &aacute;rbol que se halla bajo la GNU
        General Public License (GPL) o la Library General Public License
        (LGPL) viene con algunas restricciones m&aacute;s, si bien de cara a
        garantizar acceso al mismo, no al contrario que es lo habitual.
        Debido a las complicaciones adicionales que pueden surgir en el
        uso comercial de software con licencia GPL, preferimos que el
        software contribuido lo sea bajo la licencia BSD, menos
        estricta, cuando &eacute;sa sea una opci&oacute;n razonable.</para> 
      </sect2>

    <sect2 id="development">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Satoshi</firstname>
            <surname>Asami</surname>
            <contrib>Contributed by </contrib>
          </author>
        </authorgroup>
      </sect2info>

      <title>El modelo de desarrollo de FreeBSD</title>

      <indexterm>
        <primary>Proyecto FreeBSD</primary>
        <secondary>Modelo de desarrollo</secondary>
      </indexterm>
      <para>El desarrollo de FreeBSD es un proceso muy abierto y
        flexible, estando FreeBSD construido literalmente a partir de
        las contribuciones de centenares de personas de todo el mundo,
        como puede verse en nuestra <ulink
        url="../../articles/contributors/article.html">lista de
        contribuidores</ulink>.  Estamos constantemente a la b&uacute;squeda de
        nuevos desarrolladores e ideas, y aqu&eacute;llos interesados en
        vincularse m&aacute;s al proyecto tan s&oacute;lo tienen que ponerse en
        contacto con nostros en &a.hackers;.  La lista &a.announce;
        tambi&eacute;n se halla disponible para quienes deseen dar a conocer a
        otros usuarios de FreeBSD grandes &aacute;reas de trabajo.</para>

      <para>Cosas &uacute;tiles de saber sobre el Proyecto FreeBSD y su proceso
        de desarrollo, ya sea trabajando de forma independiente on en
        estrecha cooperaci&oacute;n:</para>

      <variablelist>
        <varlistentry>
          <term>El repositorio CVS<anchor
            id="development-cvs-repository"></term>
          <indexterm>
            <primary>CVS</primary>
            <secondary>repositorio</secondary>
          </indexterm>
          <indexterm>
            <primary>Concurrent Versions System</primary>
            <see>CVS</see>
          </indexterm>
          <listitem>
            <para>El &aacute;rbol de c&oacute;digo fuente central de FreeBSD se
              mantiene con <ulink
              url="http://www.cvshome.org/">CVS</ulink> (Concurrent
              Versions System), una herramienta de control de versiones
              de c&oacute;digo fuente que se halla libremente disponible y
              viene con FreeBSD.  El <ulink
              url="http://www.FreeBSD.org/cgi/cvsweb.cgi">repositorio
              CVS</ulink> principal reside en una m&aacute;quina en Santa Clara
              CA, USA desde la que es replicado a numerosos mirrors
              distribuidos por todo el mundo.  El &aacute;rbol del CVS, as&iacute;
              como los &aacute;rboles <link linkend="current">-CURRENT</link> y
              <link linkend="stable">-STABLE</link> que se extraen del
              mismo, pueden ser replicados f&aacute;cilmente en tu m&aacute;quina
              tambi&eacute;n.  Por favor, consulta la secci&oacute;n <link
              linkend="synching">Sincronizando el &aacute;rbol de c&oacute;digo
              fuente</link> para m&aacute;s informaci&oacute;n sobre c&oacute;mo
              hacerlo.</para>
          </listitem>
        </varlistentry>

        <varlistentry>
          <term>La lista de committers<anchor
            id="development-committers"></term>
          <indexterm><primary>committers</primary></indexterm>
          <listitem>
            <para>Los <firstterm>committers</firstterm> son gente que
              tienen permisos de <emphasis>escritura</emphasis> en el
              &aacute;rbol del CVS, y est&aacute;n por tanto autorizados a realizar
              modificaciones en los fuentes de FreeBSD (el t&eacute;rmino
              <quote>committer</quote> viene del comando
              <command>commit</command> de &man.cvs.1;, que sirve para
              subir nuevos cambios al repositorio del CVS).  La mejor
              manera de enviar aportaciones para que sean revisadas por
              los committers es usar el comando &man.send-pr.1;, aunque
              si pareciera que algo va mal en el sistema tambi&eacute;n puedes
              contactarlos por mail en &a.committers;.</para>
          </listitem>
        </varlistentry>

        <varlistentry>
          <term>El equipo core de FreeBSD<anchor id="development-core"></term>

          <indexterm><primary>equipo core</primary></indexterm>
          <listitem>
            <para>El <firstterm>equipo core de FreeBSD</firstterm> ser&iacute;a
              lo equivalente a una junta directiva si el Proyecto
              FreeBSD fuese una compañ&iacute;a.  La principal tarea de este
              equipo es la de garantizar que el proyecto, como un todo,
              tiene salud y sigue las direcciones correctas.  Invitar a
              desarrolladores comprometidos y responsables a unirse a
              nuestro grupo de committers es una de las funciones del
              equipo core, as&iacute; como el reclutamiento de nuevos miembros
              del equipo cuando otros se van.  El equipo core fue
              elegido de un conjunto de committers candidatos en octubre
              de 2000.  Se celebran elecciones cada 2 años.</para>

            <para>Algunos miembros del equipo core tienen tambi&eacute;n &aacute;reas
              de responsabilidad espec&iacute;ficas, en cuanto a que se
              encargan de garantizar que cierta parte extensa del
              sistema funciona seg&uacute;n lo previsto.  Hay una lista
              completa de desarrolladores de FreeBSD con sus &aacute;reas de
              responsabilidad respectivas, consulta la <ulink
              url="../../articles/contributors/article.html">Lista de
              contribuidores</ulink>.</para>
          
            <note>
              <para>La mayor&iacute;a de los miembros del equipo core son
                voluntarios a la hora de desarrollar FreeBSD y no se
                benefician econ&oacute;micamente del proyecto, por ello
                <quote>compromiso</quote> no deber&iacute;a confundirse con
                <quote>soporte garantizado</quote>.  La anterior
                analog&iacute;a de la <quote>junta directiva</quote> en
                realidad no es del todo exacta, quiz&aacute; fuera m&aacute;s acertado
                decir que &eacute;sa es la gente que dedica su vida a FreeBSD
                ¡en contra de lo que les aconseja su propio
                juicio!</para>
            </note>
          </listitem>
        </varlistentry>

        <varlistentry>
          <term>Contribuidores externos</term>

          <indexterm><primary>contribuidores</primary></indexterm>
          <listitem>
            <para>Por &uacute;ltimo, y no por ello menos importante, el mayor
              grupo de desarrolladores est&aacute; formado por los mismos
              usuarios, quienes constantemente aportan feedback y
              correcciones de errores.  La principal manera de estar en
              contacto con el m&aacute;s descentralizado desarrollo de FreeBSD
              es suscribirse a &a.hackers; (ver <link
              linkend="eresources-mail">informaci&oacute;n sobre listas de
              distribuci&oacute;n</link>) donde se discuten ese tipo de
              cosas.</para>

            <para><citetitle><ulink
              url="../../articles/contributors/article.html">La lista de
              contribuidores</ulink></citetitle> es larga y no cesa de
              crecer, as&iacute; que ¿por qu&eacute; no te apuntas y contribuyes a
              FreeBSD hoy mismo?</para>

            <para>Aportar c&oacute;digo no es la &uacute;nica manera de contribuir al
              proyecto; tienes un lista m&aacute;s completa de cosas que hay
              que hacer en el <ulink url="../../../../index.html">sitio
              web del Proyecto FreeBSD</ulink>.</para> 
          </listitem>
        </varlistentry> 
      </variablelist>

      <para>En resumen, nuestro modelo de desarrollo est&aacute; organizado
        como un conjunto de c&iacute;rculos conc&eacute;ntricos.  El modelo
        centralizado est&aacute; diseñado para conveniencia de los
        <quote>usuarios</quote> de FreeBSD, que as&iacute; tienen un modo
        sencillo de estar al d&iacute;a con una base de c&oacute;digo central, ¡no
        para excluir a contribuidores potenciales!  Nuestro deseo es
        presentar un sistema operativo estable con un gran conjunto de
        <link linkend="ports">aplicaciones</link> coherentes que los
        usuarios puedan instalar y usar f&aacute;cilmente, y este modelo
        funciona bien para lograrlo.</para>

      <para>Lo &uacute;nico que pedimos a quienes quisieran unirse a nosotros
        como desarrolladores de FreeBSD es la misma dedicaci&oacute;n que los
        integrantes actuales tienen para mantener su &eacute;xito.</para>
    </sect2>

    <sect2 id="relnotes">
      <title>La actual distribuci&oacute;n FreeBSD</title>

      <indexterm><primary>NetBSD</primary></indexterm>
      <indexterm><primary>OpenBSD</primary></indexterm>
      <indexterm><primary>386BSD</primary></indexterm>
      <indexterm><primary>Free Software Foundation</primary></indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <indexterm>
        <primary>Computer Systems Research Group (CSRG)</primary>
      </indexterm>
      <para>FreeBSD est&aacute; libremente disponible, todo el c&oacute;digo fuente de
        la distribuci&oacute;n basada en 4.4BSD-Lite para sistemas bajo Intel
        i386, i486, Pentium Pro, Celeron, Pentium II, Pentium III (o
        compatible) y DEC Alpha.  Est&aacute; principalmente basado en software
        &i386;, &i486;, &pentium;, &pentium;&nbsp;Pro, &celeron;, 
        &pentium;&nbsp;II, &pentium;&nbsp;III, &pentium;&nbsp;4 (o compatible),
        &xeon;, DEC <trademark>Alpha</trademark> y sistemas basados en Sun 
        &ultrasparc;. Est&aacute; principalmente basado en software
        del grupo CSRG de U.C. Berkeley, con algunas mejoras
        provenientes de NetBSD, OpenBSD, 386BSD, y la Free Software
        Foundation.</para>

      <para>Desde la versi&oacute;n 2.0 de FreeBSD de finales del 94, el
        rendimiento, conjunto de funcionalidades, y estabilidad del
        sistema han mejorado dr&aacute;sticamente.  El &uacute;ltimo cambio consiste
        en un rediseño del sistema de memoria virtual con una cach&eacute;
        unificada de VM/buffer que no s&oacute;lo aumenta el rendimiento, sino
        que tambi&eacute;n reduce el consumo de memoria de FreeBSD, haciendo
        que una configuraci&oacute;n de 5MB sea un m&iacute;nimo m&aacute;s aceptable.  Otras
        mejoras incluyen soporte completo para clientes y servidores
        NIS, soporte para transacciones TCP, llamada bajo demanda PPP,
        soporte para DHCP integrado, un subsistema SCSI mejorado,
        soporte para ISDN, soporte para ATM, FDDI, adaptadores Fast y
        Gigabit Ethernet (1000Mbit), soporte mejorado para los &uacute;ltimos
        controladores Adaptec, y cientos de correcciones de
        errores.</para>

      <para>Tambi&eacute;n hemos considerado los comentarios y sugerencias de
        muchos de nuestros usuarios y hemos intentado ofrecer lo que
        esperamos sea un proceso de instalaci&oacute;n m&aacute;s sensato y f&aacute;cil de
        entender.  ¡Tu feedback sobre este proceso (en constante
        evoluci&oacute;n) es especialmente bienvenido!</para>

      <para>Adem&aacute;s de las distribuciones base, FreeBSD ofrece una
        colecci&oacute;n de software con miles de programas com&uacute;nmente
        solicitados.  ¡En el momento de escribir esto hay unos
        &os.numports; ports!  La lista de ports comprende desde
        servidores HTTP (WWW), hasta juegos, lenguages, editores, y
        pr&aacute;cticamente cualquier cosa intermedia.  La colecci&oacute;n de ports
        completa requiere un espacio de aproximadamente 100MB, todos
        ellos expresados como <quote>deltas</quote> de sus fuentes
        originales.  Esto hace que nos sea mucho m&aacute;s f&aacute;cil actualizar
        ports, y reduce de un modo importante el espacio en disco que
        necesitaba la anterior colecci&oacute;n de ports 1.0.  Para compilar un
        port uno simplemente se sit&uacute;a bajo el directorio del programa
        que desea instalar, escribe <command>make install</command>, y
        deja que el sistema se encargue del resto.  La distribuci&oacute;n
        original completa de cada port que construyes se recupera
        din&aacute;micamente de un CDROM o un sitio FTP, de modo que s&oacute;lo
        necesitas el espacio usado para construir los ports que tu
        quieras.  La mayor&iacute;a de los ports tambi&eacute;n est&aacute;n disponibles
        precompilados en <quote>paquetes</quote>, que pueden instalarse
        con un simple comando (<command>pkg_add</command>) para aqu&eacute;llos
        que no quieran compilar sus propios ports a partir de los
        fuentes.</para>

      <para>Algunos documentos que pueden ser de ayuda en el proceso de
        instalaci&oacute;n y al utilizar FreeBSD pueden tambi&eacute;n encontrarse en
        el directorio <filename>/usr/share/doc</filename> de cualquier
        m&aacute;quina bajo FreeBSD 2.1 o posterior.  Puedes ver los manuales
        que est&aacute;n instalados en local con cualquier navegador que pueda
        mostrar HTML v&iacute;a las siguientes URLs:</para>

      <variablelist>
        <varlistentry>
          <term>El manual de FreeBSD</term>

          <listitem>
            <para><ulink type="html"
              url="file://localhost/usr/share/doc/handbook/index.html">/usr/share/doc/handbook/index.html</ulink></para>
          </listitem>
        </varlistentry>

        <varlistentry>
          <term>El FAQ de FreeBSD</term>

          <listitem>
            <para><ulink type="html"
              url="file://localhost/usr/share/doc/faq/index.html">/usr/share/doc/faq/index.html</ulink></para>
          </listitem>
        </varlistentry>
      </variablelist>

      <para>Tambi&eacute;n puedes ver la copia original (y m&aacute;s frecuentemente
        actualizada) en <ulink
        url="../../../../index.html">http://www.FreeBSD.org/</ulink>.</para>
    </sect2>
  </sect1>
</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
