<!--
     The FreeBSD Documentation Project

     $FreeBSD$
-->

<chapter id="introduction">
  <title>Introducci&oacute;n</title>

  <para>FreeBSD es un sistema operativo basado en 4.4BSD-Lite para
	arquitectura Intel (x86). Para una descripci&oacute;n de FreeBSD,
	mira <link linkend="nutshell"> FreeBSD en una palabra</link>. Para
	conocer la historia del proyecto, lee <link linkend="history"> una
	breve historia de FreeBSD</link>. Para ver la descripci&oacute;n de
	la &uacute;ltima release, lee <link linkend="relnotes"> sobre la
	release actual</link>. Si est&aacute;s interesado en contribuir de
	alguna manera al proyecto FreeBSD, (c&oacute;digo, equipamiento, 
	donaciones, etc), por favor, lee la secci&oacute;n 
	<link linkend="contrib"> contribuyendo a FreeBSD</link>.</para>

  <sect1 id="nutshell">
    <title>FreeBSD en una palabra</title>

  <para>FreeBSD es un sistema operativo para ordenadores personales basado 
	en CPU's de arquitectura Intel, incluyendo procesadores 386, 486, 
	y Pentium (versiones SX y DX). Tambi&eacute;n son soportados los 
	procesadores compatibles Intel como AMD y Cyrix. FreeBSD te ofrece
	muchas caracter&iacute;sticas avanzadas antes solo disponibles en
	ordenadores mucho m&aacute;s caros. Estas caracter&iacute;sticas
	incluyen:</para>

	<itemizedlist>

		<listitem>
			<para><emphasis>Preemptive multitasking</emphasis> con
			ajuste din&aacute;mico de prioridades para asegurar
			la mejor compartici&oacute;n de recursos entre 
			aplicaciones y usuarios.</para>
		</listitem>

		<listitem>
			<para><emphasis>Acceso Multiusuario</emphasis> 
			significa que diferentes personas pueden usar un
			sistema FreeBSD simultaneamente para realizar 
			diferentes trabajos. Los perif&eacute;ricos del sistema
			como impresoras y cintas tambi&eacute;n pueden ser
			compartidas entre todos los usuarios del sistema.
			</para>
		</listitem>

		<listitem>
			<para>Completa <emphasis>conectividad TCP/IP</emphasis>
			incluyendo soporte SLIP, PPP, NFS y NIS. Esto significa
			que tu m&aacute;quina FreeBSD puede comunicarse 
			facilmente con otros sistemas, adem&aacute;s de actuar
			como servidor principal, proveyendo de funciones 
			vitales como NFS (acceso a ficheros remotos), servicios
			de correo electr&oacute;nico o poner a tu 
			organizaci&oacute;n en Internet con WWW, ftp, router, 
			firewall (seguridad).</para>
		</listitem>

		<listitem>
			<para><emphasis>La protecci&oacute;n de memoria
			</emphasis> asegura que las aplicaciones (o usuarios)
			no puedan interferirse unos con los otros. En caso de
			que una aplicaci&oacute;n falle, no afectar&aacute; al
			resto de aplicaciones en funcionamiento.</para>
		</listitem>

		<listitem>
			<para>FreeBSD es un <emphasis>sistema operativo de 32
			bits</emphasis> y fue dise&ntilde;ado as&iacute; 
			desde el primer momento.</para>
		</listitem>

		<listitem>
			<para>El sistema estandar en la industria <emphasis>X
			Window</emphasis> (X11R6) provee una interficie 
			gr&aacute;fica de usuario (GUI) para las tarjetas VGA
			y monitores m&aacute;s comunes incluyendo todo el 
			c&oacute;digo fuente.</para>
		</listitem>

		<listitem>
			<para><emphasis>Compatibilidad binaria</emphasis> con
			muchos programas nativos de SCO, BSDI, NetBSD, Linux
			y 386BSD.</para>
		</listitem>

		<listitem>
			<para>Cientos de aplicaciones <emphasis>
			ready-to-run</emphasis> est&aacute;n disponibles en
			las colecci&oacute;nes de <emphasis>ports</emphasis>
			y <emphasis>packages</emphasis>. Porqu&eacute; buscar
			en la red cuando puedes encontrarlo todo aqu&iacute;?.
			</para>
		</listitem>

		<listitem>
			<para>Miles de aplicaciones <emphasis>f&aacute;ciles
			de portar</emphasis> disponibles en Internet. FreeBSD
			es compatible con el c&oacute;digo fuente de los 
			m&aacute;s populares y comerciales sistemas Unix, y
			las aplicaciones requieren unos m&iacute;nimos
			cambios (si es que lo requieren) para compilar.</para>
		</listitem>

		<listitem>
			<para><emphasis>Memoria virtual</emphasis> paginada
			bajo demanda satisface eficientemente a las 
			aplicaciones con mucho consumo de memoria, manteniendo
			aun respuestas interactivas al resto de usuarios.
			</para>
		</listitem>

		<listitem>
			<para><emphasis>Librer&iacute;s compartidas</emphasis> 
			(el equivalente en Unix a las DLLs de Windows) que 
			ofrecen un uso eficiente del espacio en disco y memoria
			.</para>
		</listitem>

		<listitem>
			<para>Se incluye un completo conjunto de herramientas
			de desarrollo en <emphasis>C</emphasis>, <emphasis>
			C++</emphasis> y <emphasis>Fortran</emphasis>. Muchos
			lenguajes adicionales para investigaci&oacute;n 
			avanzada y desarrollo est&aacute;n incluidos en las
			colecciones de ports y packages.</para>
		</listitem>

		<listitem>
			<para><emphasis>C&oacute;digo fuente</emphasis> 
			completo de todo el sistema, ofreciendote el 
			m&aacute;ximo grado de control sobre tu entorno. 
			Porqu&eacute; estar bloqueado en una soluci&oacute;n
			propietaria cuando puedes tener un verdadero sistema
			abierto?.</para>
		</listitem>

		<listitem>
			<para>Extensa <emphasis>documentaci&oacute;n on-line
			</emphasis>.</para>
		</listitem>

		<listitem>
			<para><emphasis>Y mucho m&aacute;s!</emphasis>
			</para>
		</listitem>

	</itemizedlist>

  <para>FreeBSD est&aacute; basado en la release 4.4BSD-Lite del Computer
	Systems Research Group (CSRG) de la Universidad de California en 
	Berkeley, siguiendo la tradici&oacute;n que ha distinguido el 
	desarrollo de los sistemas BSD. Adem&aacute;s del buen trabajo 
	realizado por el CSRG, el proyecto FreeBSD ha invertido miles de horas
	en ajustar el sistema para ofrecer las m&aacute;ximas prestaciones en
	situaciones de carga real.</para>

  <para>Las aplicaciones a las que se puede someter FreeBSD est&aacute;n solo
	limitadas por tu imaginaci&oacute;n. Desde desarrollo de software
	hasta automatizaci&oacute;n o rob&oacute;tica, control de inventarios
	o correcciones de azimuts de antenas de sat&eacute;lite remotas; si
	puede hacerse con un producto Unix comercial, es m&aacute;s que seguro
	que puede hacerse con FreeBSD. FreeBSD se beneficia significantemente
	de las miles de aplicaciones de alta calidad desarrolladas por centros
	de investigaci&oacute;n y universidades de todo el mundo, disponibles
	a un coste m&iacute;nimo o sin coste alguno. Las aplicaciones 
	comerciales tambi&eacute;n est&aacute;n disponibles apareciendo en 
	mayor n&uacute;mero cada d&iacute;a.</para>

  <para>Gracias a que disponemos de todo el c&oacute;digo del sistema, 
	&eacute;ste puede ser personalizado para aplicaciones o proyectos
	especiales de maneras que generalmente no son posibles con la 
	mayor&iacute;a de los sistemas operativos comerciales. Aqu&iacute;
	tienes algunos ejemplos de aplicaciones de FreeBSD:</para>

	<itemizedlist>

		<listitem>
			<para><emphasis>Servicios Internet:</emphasis> El 
			robusto stack TCP/IP integrado en FreeBSD lo hace una
			plataforma ideal para una gran cantidad de servicios
			Internet como:</para>
			<itemizedlist>

				<listitem>
					<para>Servidores FTP</para>
				</listitem>

				<listitem>
					<para>Servidores WWW</para>
				</listitem>

				<listitem>
					<para>Servidores Gopher</para>
				</listitem>

				<listitem>
					<para>Servidores de Correo 
					electr&oacute;nico</para>
				</listitem>

				<listitem>
					<para>News USENET</para>
				</listitem>

				<listitem>
					<para>Sistema de BBS</para>
				</listitem>

				<listitem>
					<para>Y mucho m&aacute;s... </para>
				</listitem>
			</itemizedlist>

			<para>Puedes empezar facilmente con un ordenador PC
			386 e ir actualizandolo a medida que crezcan tus 
			necesidades.</para>
		</listitem>

		<listitem>
			<para><emphasis>Edicaci&oacute;n: </emphasis>Eres un
			estudiante de inform&aacute;tica o de algun campo
			relacionado con la ingenier&iacute;a?. No hay mejor
			manera de aprender sobre sistemas operativos, 
			arquitectura de computadores y redes que poder "poner
			las manos" en el c&oacute;digo completo de un sistema
			operativo como FreeBSD. Cantidad de packages 
			libremente disponibles sobre CAD, matem&aacute;ticas y
			dise&ntilde;o gr&aacute;fico hacen de este sistema la
			herramienta ideal para aquellos que usan los 
			ordenadores para <emphasis>otras</emphasis> cosas.
			</para>
		</listitem>

		<listitem>
			<para><emphasis>Investigaci&oacute;n:</emphasis> Con
			todo el c&oacute;digo fuente disponible, FreeBSD es una
			excelente plataforma de investigaci&oacute;n en 
			sistemas operativos. La naturaleza de libre 
			distribuci&oacute;n de FreeBSD ha hecho posible que 
			grupos remotos hayan podido trabajar y colaborar
			en desarrollos compartidos sin tener que preocuparse
			de licencias especiales o limitaciones de ning&uacute;n
			tipo.</para>
		</listitem>

		<listitem>
			<para><emphasis>Networking:</emphasis> Necesitas un 
			nuevo router?. Un servidor de nombres (DNS)? Un
			firewall para mantener a la gente fuera de tu red 
			interna?. FreeBSD puede convertir esos antiguos
			PC's 386 o 486 en routers avanzados con capacidades
			avanzadas de filtrado de paquetes.</para>
		</listitem>

		<listitem>
			<para><emphasis>Estaci&oacute;n de trabajo X Window:
			</emphasis> FreeBSD es una buena elecci&oacute;n para
			una soluci&oacute;n de terminales X baratos, usando
			el servidor libre XFree86 o uno de los excelentes
			servidores comerciales producidos por X Inside. 
			FreeBSD te permite ejecutar localmente las aplicaciones
			adem&aacute;s de ejecutar las del servidor central.
			</para>
		</listitem>

		<listitem>
			<para><emphasis>Desarrollo de software:</emphasis> El
			sistema b&aacute;sico de FreeBSD incluye un 
			complemento completo de herramientas de desarrollo
			incluyendo el compilador y debugger GNU C/C++.</para>
		</listitem>

	</itemizedlist>

	<para>FreeBSD est&aacute; disponible en formato binario o 
	c&oacute;digo fuente en CDROM y v&iacute;a ftp an&oacute;nimo. Mira
	<link linkend="mirrors"> Obteniendo FreeBSD</link> para m&aacute;s 
	detalles.</para>

  </sect1>

  <sect1 id="history">
    <title>Una breve historia de FreeBSD</title>

    <para><emphasis>Contribuido por &a.jkh;</emphasis>.</para>

    <para>El proyecto FreeBSD tuvo naci&oacute; en los inicios de 1993 por
      una escisi&oacute;n parcial de los 3 coordinadores del 
      &ldquo;Unofficial 386BSD Patchkit&rdquo;: Nate William, Rod Grimes y
      yo mismo.</para>

    <para>Nuestro objetivo original era producir una muestra intermedia de
      386BSD para solucionar una serie de problemas que el mecanismo del
      patchkit no era capaz de solucionar. Alguno de vosotros quiz&aacute;s
      recuerde el nombre inicial del proyecto 
      &ldquo;386BSD 0.5&rdquo; o &ldquo;386BSD Interim&rdquo;.</para>

    <para>386BSD era el sistema operativo de Bill Jolitz y hab&iacute;a estado
      muy desatendido durante todo un a&ntilde;o. Al sentirse todo el patchkit
      cada vez m&aacute;s desanimado, decidimos que hab&iacute;a que hacer algo
      e intentamos ayudar a Bill haciendo esta muestra sin fallos. Estos planes
      se vieron frenados cuando Bill decidi&oacute; de repente dejar de formar
      parte del proyecto.</para>

    <para>No nos cost&oacute; demasiado decidir seguir adelante, a&uacute;n sin
      el soporte de Bill, as&iacute; que adoptamos el nombre de 
      &ldquo;FreeBSD&rdquo;, sugerido por David Greenman. Nuestro objetivo 
      inicial era consultar con los usuarios actuales del sistema, y, una vez
      aclaradas las cosas, intentar que el proyecto se convirtiese en una
      realidad. Contact&eacute; con Walnut Creek CDROM con la intenci&oacute;n
      de disponer de un canal de distribuci&oacute;n para todos aquellos que
      no tuvisen un f&aacute;il acceso a Internet. Walnut Creek no s&oacute;lo
      apoy&oacute; la idea de distribuir FreeBSD en CDROM si no que 
      aport&oacute; una m&aacute;quina sobre la que desarrollar los proyectos
      y una r&aacute;pida conexi&oacute;n a Internet. Sin el apoyo y la 
      confianza que Walnut Creek deposit&oacute; en un proyecto desconocido
      y reci&eacute;n nacido, es seguro que FreeBSD no hubiese podido llegar 
      t&aacute;n lejos y t&aacute;n r&aacute;pido como lo ha hecho.</para>

    <para>Durante esta &eacute;poca, aparecieron una serie de nubarrones
      inesperados en el horizonte ya que Novell y la U.C. Berkeley 
      solucionaron su larga pugna legal sobre el estatus del Net/2 de 
      Berkeley. Una de las condiciones del acuerdo fue la concesi&oacute;n
      por parte de la U.C. Berkeley de que Novell se hiciese cargo de
      gran parte del c&oacute;digo de Net/2, ya que de hecho la hab&iacute;a
      adquirido anteriormente a AT&amp;T. Lo que Berkeley recibi&oacute; a
      cambio fue el permiso de declarar libre la release de 4.4BSD-Lite, y
      que todos los usuarios existentes de Net/2 ser&iacute;n conminados
      a migrar de sistema. Esto incluy&oacute; a FreeBSD, y el proyecto 
      obtuvo de plazo hasta Julio de 1994 para terminar de ofrecer su
      producto basado en Net/2. Bajo los t&eacute;rminos de este acuerdo, 
      se le permiti&oacute; al proyecto una &uacute;ltima release, 
      FreeBSD 1.1.5.1.</para>

    <para>A partir de ese momento, FreeBSD se dedic&oacute; a la &aacute;rdua
      tarea de, literalmente, reinventarse a si mismo, desde un nuevo
      e incompleto 4.4BSD-Lite. El proyect&oacute; termin&oacute; esta
      transici&oacute;n en Diciembre de 1994, y, en Enero de 1995 se
      public&oacute; la release FreeBSD 2.0 en Internet y en CDROM. Teniendo
      en cuenta todos los problemas, la release obtuvo un &eacute;xito
      importante, seguida de la m&aacute;s robusta y f&aacute;cil de
      instalar FreeBSD 2.0.5 en Junio de 1995.</para>

    <para>En Agosto de 1996 se public&oacute; la release 2.1.5, consiguiendo
      ser suficientemente conocida entre ISP y comunidades comerciales. La
      release 2.1.7.1 en Febrero de 1997 se convirti&oacute; en el final
      del desarrollo de la rama 2.1-stable. En estos momentos, &eacute;sta
      rama se encuentra en modo de mantenimiento, realizando s&oacute;lo
      trabajos de seguridad o soluci&oacute;n de problemas cr&iacute;ticos
      </para>

    <para>FreeBSD 2.2 naci&oacute; de la l&iacute;nea principal de desarrollo
      (&ldquo;-current&rdquo;) en Noviembre de 1996 como la rama
      RELENG_2_2, y la primera release completa se realiz&oacute; en Abril de
      1997. Las siguientes releases de la rama 2.2 fueron en verano y 
      oto&ntilde;o de 1997, apareciendo la &uacute;ltima en Julio de 1998.
      La primera release oficial de la rama 3.0 apareci&oacute; en Octubre de
      1998, siendo publicada la &uacute;ltima release de la rama 2.2 (2.2.8)
      en Noviembre de 1998.</para>

    <para>Desarrollos a largo plazo como el soporte SMP o de la plataforma DEC
      de ALPHA continuar&aacute; en la rama 3.0-current (ya 4.0-current) y
      SNAPshots de la 3.0 en CDROM /y, por supuesto, en la red).</para>
 
  </sect1>

  <sect1 id="goals">
    <title>Objetivos del Proyecto FreeBSD</title>

    <para><emphasis>Contribuido por &a.jkh;</emphasis>.</para>

    <para>Los objetivos del Proyecto FreeBSD son proveer software que pueda
      ser usado para cualquier objetivo sin que &eacute;sto acarree una
      carga. Muchos de nosotros tenemos bastante que ver con el c&oacute;digo
      (y proyecto). Creemos que nuestra primera y m&aacute;s importante
      &ldquo;misi&oacute;n&rdquo; es proveer c&oacute;digo a cualquier persona
      de manera que el c&oacute;digo pueda ser muy distribuido y ofrezca el 
      mayor n&uacute;mero posible de beneficios. Este es, creo, uno de los
      objetivos principales del Software Libre, al que apoyamos 
      entusiastamente.</para>

    <para>El c&oacute;digo incluido en nuestra distribuci&oacute;n que se
      encuentra bajo licencia GPL, GNU o GLPL tiene algunas restricciones
      m&aacute;s. Debido a los problemas que puede acarrear el uso de
      software de licencia GPL de manera comercial, invitamos a reemplazar
      este software por otros bajo licencias mas relajadas como BSD, 
      siempre y cuando sea posible.</para>

  </sect1>

  <sect1 id="development">
    <title>El modelo de desarrollo de FreeBSD</title> 

    <para><emphasis>Contribuido por &a.asami;</emphasis>.</para>

    <para>El desarrollo de FreeBSD es un proceso muy abierto y flexible,
      siendo, literalmente, creado a partir de las contribuciones de cientos
      de personas de todo el mundo, como se puede ver en nuestra <link
      linkend="staff">lista de participantes</link>. Estamos constantemente
      en la b&uacute;squeda de nuevos desarrolladores e ideas, y aquellos 
      interesados en estar m&aacute;s envueltos en el proyecto, s&oacute;lo
      necesitan ponerse en contacto con nosotros a trav&eacute;s de la lista
      &a.hackers;. Aquellos que prefieran trabajar m&aacute;s 
      independientemente tambi&eacute;n son bienvenidos, pudiendo usar las
      facilidades de nuestro servidor FTP en <ulink 
      URL="ftp://ftp.freebsd.org/pub/FreeBSD/incoming">ftp.freebsd.org</ulink>
      para distribuir sus propios parches o c&oacute;digo fuente de trabajos
      en progreso. La lista &a.announce; est&aacute; disponible para 
      comunicar a otros usuarios de FreeBSD las &aacute;reas m&aacute;s 
      importantes de trabajo.</para>

    <para>Cosas &uacute;tiles de conocer sobre el Proyecto FreeBSD y sus
      procesos de desarrollo, ya sea de manera independiente o 
      cooperaci&oacute;n en grupos:</para>

    <variablelist>
      <varlistentry><term>El dep&oacute;sito
        CVS <anchor id="development-cvs-repository"></term>
        <listitem>
          <para>El &aacute;rbol de c&oacute;digo fuente principal es mantenido
            por <ulink
            URL="http://www.cyclic.com/cyclic-pages/CVS-sheet.html">CVS</ulink> (Concurrent Version System), una herramienta de libre disposici&oacute;n para
            el control de c&oacute;digo fuente que est&aacute; incluida en
            FreeBSD. El <ulink URL="http://www.freebsd.org/cgi/cvsweb.cgi">CVS 
            principal</ulink> reside en un servidor de Concord, California, 
            desde el que se replica a numerosos servidores mirror repartidos
            por todo el mundo. El &aacute;rbol CVS, as&iacute; como las ramas
            <link linkend="current">-current</link> y
            <link linkend="stable">-stable</link> pueden ser facilmente
            replicadas en tu propia m&aacute;quina. Por favor, mira en la
            secci&oacute;n <link linkend="synching">Sincronizando tu 
            &aacute;rbol de c&oacute;digo fuente</link> para m&aacute;s
            informaci&oacute;n sobre este sistema.</para>
        </listitem>
      </varlistentry>
      <varlistentry><term>La lista de 
        "committers"<anchor id="development-committers"></term>

        <listitem>
          <para>Los <link linkend="staff-committers">committers</link>
            son las personas que tienen acceso de 
            <emphasis>escritura</emphasis> al CVS, y est&aacute;n autorizados
            para realizar modificaciones en el c&oacute;digo fuente (el 
            t&eacute;rmino &ldquo;committer&rdquo; proviene del comando
            <citerefentry><refentrytitle>cvs</refentrytitle><manvolnum>1</manvolnum></citerefentry> <command>commit</command>, usado para incorporar los nuevos
            cambios en el CVS). La mejor manera de hacer env&iacute;os para que
            sean revisados por los committers es el comando
            <citerefentry><refentrytitle>send-pr</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Tambi&eacute;n puedes enviar un mail a la 
            direcci&oacute;n <email>committers@freebsd.org</email>.</para>
        </listitem>
      </varlistentry>

      <varlistentry><term>El core-team de 
        FreeBSD<anchor id="development-core"></term>

        <listitem>
          <para>El <link linkend="staff-core">FreeBSD core team</link>
          ser&iacute; el equivalente al conjunto de directores si FreeBSD
          fuese una compa&ntilde;&iacute;a. La tarea principal del core team
          es asegurar que el proyecto, como una unidad, est&aacute; en el 
          bu&eacute;n camino y apuntar hacia la direcci&oacute; correcta.
          Invitar a los desarrolladores dedicados y responsables a participar
          en el grupo de committers es otra de las funciones del core team, 
          as&iacute; como incorporar nuevos miembros al mismo. Muchos de los
          miembros del core team empezaron como committers, y a los que la
          adicci&oacute;n al proyecto ha conseguido lo mejor de ellos.</para>

         <para>Algunos miembros del core team tambi&eacute;n tienen algunas
         <link linkend="staff-who">&aacute;reas de responsabilidad</link>
         espec&iacute;ficas, significando que se encargan de asegurar que
         partes importantes del sistema funcionen como se espera.</para>

         <note>
           <para>La mayor&iacute;a de miembros del core team son voluntarios
           y no se benefician del proyecto economicamente. La analog&iacute;a
           de &ldquo;equipo de directores&rdquo; actualmente no es demasiado
           acertada, y es m&aacute;s justo decir que estas personas son las
           personas que dan sus vidas en favor de FreeBSD y en contra de su
           sano juicio <!-- smiley --><emphasis>;)</emphasis></para>
         </note>
       </listitem>
     </varlistentry>

     <varlistentry><term>Contribuyentes externos</term>

       <listitem>
         <para>El m&aacute;s importante grupo de desarrolladores son los
         propios usuarios, ya que nos ofrecen sus idea, aportaciones, parches,
         c&oacute;digo, etc. La principal manera de participar en el desarrollo
         de FreeBSD es subscribirse en la lista &a.hackers; (mira en la
         <link linkend="eresources-mail">informaci&oacute;n de listas</link>)
         donde se discuten este tipo de cosas.</para>

         <para><link linkend="contrib-additional">La lista</link> de aquellos
         que han contribuido con alguna parte de c&oacute;digo es muy larga
         y creciendo cada d&iacute;a, as&iacute; que porqu&eacute; no 
         participar en ella y contribuir con algo hoy mismo a FreeBSD?
         <!-- smiley --><emphasis>:-)</emphasis></para>

         <para>Enviar c&oacute;digo no es la &uacute;nica manera de contribuir
         al proyecto; para una lista m&aacute;s completa de cosas por hacer, 
         por favor, mira en la secci&oacute;n <link linkend="contrib">
         c&oacute;omo contribuir</link> de este manual.</para>
       </listitem>
      </varlistentry>
     </variablelist>

     <para>En definitiva, nuestro modelo dedesarrollo est&aacute; organizado
       como una serie de c&iacute;rculos conc&eacute;ntricos. El modelo 
       centralizdo est&aacute; dise&ntilde;ado para la conveniencia de los
       <emphasis>usuarios</emphasis> de FreeBSD, que tienen la posibilidad de
       seguir un c&oacute;digo fuente centralizado, sin dejar fuera a los
       potenciales participantes y contribuyentes de c&oacute;digo. Nuestro
       deseo es presentar un sistema operativo estable con una larga y 
       coherente serie de <link linkend="ports">aplicaciones</link> que sean
       sencillos de instalar y usar, y este modelo funciona muy bien para
       conseguir estos objetivos.</para>

     <para>Todo lo que le pedimos a aquellos que quieran participar como
       desarrolladores de FreeBSD es la misma dedicaci&oacute;n que tienen
       los desarrolladores actuales para poder seguir trabajando de la misma
       manera que se ha hecho hasta ahora.</para>

   </sect1>

   <sect1 id="relnotes">

     <title>Sobre la Release Actual</title>

     <para>FreeBSD es un sistema de libre disponibilidad, con el c&oacute;digo
       fuente completo y basado en 4.4BSD-Lite para m&aacute;quinas
       Intel i386/i486/Pentium/PentiumPro/Pentium II (o compatibles). 
       Est&aacute; basado en el software del grupo CSRG de la U.C.
       Berkeley, con algunas mejoras de NetBSD, OpenBSD, 286BSD y la Free
       Software Foundation.</para>

     <para>Desde nuestra release FreeBSD 2.0 en Enero de 1995, el rendimiento,
       caracter&iacute;sticas y estabilidad de FreeBSD ha aumentado 
       considerablemente. El cambio m&aacute;s importante es el sistema de
       memoria virtual con un buffer de cache VM/file que no s&oacute;lo
       incrementa el rendimiento, si no que adem&aacute;s reduce el 
       consumo de memoria, haciendo que el sistema s&oacute;lo necesite
       5Mb de memoria en su configuraci&oacute;n m&iacute;nima. Otras mejoras
       incluyen soporte completo de cliente y servidor NIS, soporte de
       transacciones TCP, dial-on-demand PPP, un nuevo subsistema SCSI, 
       soporte de RDSI, soporte de tarjetas FDDI y Fast Ethernet, soporte
       de la tarjeta ADAPTEC 2940, y cientos de soluciones en errores 
       anteriores.</para>

     <para>Tambi&eacute;n hemos tomado muy en cuenta los comentarios y
       sugerencias de nuestros usuarios para hacer lo que creemos es un
       sistema de instalaci&oacute;n sencillo y eficiente. Tus comentarios
       sobre este proceso son bienvenidos, ya que es un trabajo en constante
       evoluci&oacute;n.</para>

    <para>Adem&aacute;s de las distribuciones base, FreeBSD ofrece una nueva
      colecci&oacute;n de software portado con cientos de programas. A
      finales de Agosto de 1998 estabamos en m&aacute;s de 1700 ports!. La
      lista de ports va desde servidores http, hasta juegos, lenguajes de 
      programaci&oacute;n, editores y cualquier otra cosa que te puedas
      imaginar. La colecci&oacute;n de ports completa requiere alrededor de
      26Mb de espacio, siendo todos los ports &ldquo;deltas&rdquo; a sus
      c&oacute;digos fuente originales. Esto hace que para nosotros sea mucho
      m&aacute;s sencillo actualizar los ports, y reduce considerablemente 
      el espacio en disco requerido. Para compilar un port, simplemente
      necesitas cambiar al directorio del programa que quieres instalar, 
      y teclear <command>make all</command> seguido de
      <command>make install</command> despu&eacute;s de la compilaci&oacute;n
      dejando al sistema que haga el resto. La distribuci&oacute;n original
      completa de cada port se obtiene din&aacute;micamente del CDROM o un
      servidor local FTP, de manera que s&oacute;lo necesitas el espacio de
      disco necesario para los ports que quieras instalar. La mayor&iacute;a
      de ports tambi&eacute;n se pueden obtener en formato precompilado, 
      llamado &ldquo;package&rdquo;, que puede ser instalado con un simple
      comando (pkg_add) para aquellos que no quieran compilar sus propios
      ports a partir del c&oacute;digo fuente.</para>

    <para>Documentaci&oacute;n adicional sobre el proceso de instalaci&oacute;n
      y uso de FreeBSD la puedes encontrar en el directorio
      <filename>/usr/share/doc</filename> en cualquier m&aacute;quina con
      FreeBSD 2.1 o posterior. Tambi&eacute;n puedes ver los manuales
      instalados de manera local con cualquier navegador HTML usando las
      siguientes URLs:</para>

    <variablelist>
      <varlistentry><term>El Handbook de FreeBSD</term>
        <listitem>
          <para><ulink
            URL="file:/usr/share/doc/handbook/handbook.html">file:/usr/share/doc/handbook/handbook.html</ulink></para>
        </listitem>
      </varlistentry>

      <varlistentry><term>Las FAQ de FreeBSD</term>
        <listitem>
          <para><ulink
            URL="file:/usr/share/doc/FAQ/FAQ.html">file:/usr/share/doc/FAQ/FAQ.html</ulink></para>
        </listitem>
      </varlistentry>
    </variablelist>

    <para>Tambi&eacute;n puedes visital las copias centrales (y normalmente
      m&aacute;s actualizadas) en <ulink 
      URL="http://www.freebsd.org">http://www.freebsd.org</ulink>.</para>

    <para>La distribuci&oacute;n principal de FreeBSD no contiene el 
      c&oacute;digo DES, al estar prohibida su exportaci&oacute;n fuera de
      USA. Hay un package, para usar s&oacute;lo en USA, que contiene los
      programas que normalmente usa DES. Una distribuci&oacute;n DES europea
      y libremente distribuible fuera de USA, tambi&eacute;n est&aacute;
      disponible, c&oacute;omo se describe en las 
      <ulink URL="../FAQ/FAQ.html">FAQ</ulink>.</para>

    <para>Si todo lo que necesitas es seguridad de passwords en FreeBSD, y no
      tienes necesidad de copiar passwords encriptados desde diferentes
      m&aacute;quinas (Sun, DEC, etc) al fichero de passwords de FreeBSD, 
      entonces la seguridad basada en MD5 que te ofrece FreeBSD es lo que
      necesitas. Creemos que nuestro modelo de seguridad no tiene nada que
      perder con respecto a DES, y sin ning&uacute;n problema de 
      restricci&oacute;n de exportaci&oacute;n. Si est&aacute;s fuera (o 
      incluso dentro) de USA, pru&eacute;balo!.</para>

  </sect1>
</chapter>

<!--        
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End: 
-->
