Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: Advanced networking in FreeBSD: basics of gateways and routes, CARP, how to configure multiple VLANs on FreeBSD, etc
es: Redes Avanzadas en FreeBSD: conceptos básicos de gateways y rutas, CARP, cómo configurar múltiples VLANs en FreeBSD, etc
ko: FreeBSD의 고급 네트워킹: 게이트웨이와 라우팅의 기본, CARP, FreeBSD에서 다중 VLAN을 구성하는 방법 등
ru: Сложные вопросы работы в сети в FreeBSD: основы шлюзов и маршрутов, CARP, настройка нескольких VLAN в FreeBSD и так далее

source: IV. Network Communication
es: IV. Comunicación de Red
ko: IV. 네트워크 통신
ru: IV. Сетевое взаимодействие

source: Chapter 33. Advanced Networking
es: Capítulo 33. Redes Avanzadas
ko: 33장. 고급 네트워킹

source: Advanced Networking
es: Redes Avanzadas
ko: 고급 네트워킹
ru: Сложные вопросы работы в сети

source: Synopsis
es: Sinopsis
ko: 요약
ru: Обзор

source: This chapter covers a number of advanced networking topics.
es: Este capítulo cubre cierto número de temas avanzados de redes.
ko: 이 장에서는 여러 가지 고급 네트워킹 주제를 다룹니다.
ru: Эта глава охватывает ряд сложных тем, связанных с сетями.

source: After reading this chapter, you will know:
es: Después de leer este capítulo, sabrás:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: The basics of gateways and routes.
es: Lo básico acerca de gateways y rutas.
ko: 게이트웨이와 라우팅의 기본.
ru: Основы шлюзов и маршрутов.

source: How to set up USB tethering.
es: Cómo configurar tethering por USB.
ko: USB 테더링 설정 방법.
ru: Как настроить USB-тетеринг.

source: How to set up IEEE(R) 802.11 and Bluetooth(R) devices.
es: Cómo configurar dispositivos IEEE(R) 802.11 y Bluetooth(R).
ko: IEEE(R) 802.11 및 Bluetooth(R) 장치를 설정하는 방법.
ru: Как настроить устройства IEEE(R) 802.11 и Bluetooth(R).

source: How to make FreeBSD act as a bridge.
es: Cómo hacer que FreeBSD actúe como un puente.
ko: FreeBSD를 브릿지로 작동시키는 방법.
ru: Как сделать так, чтобы система FreeBSD работала как мост.

source: How to set up network PXE booting.
es: Cómo configurar arranque por red PXE.
ko: 네트워크 PXE 부팅을 설정하는 방법.
ru: Как настроить загрузку системы из сети с помощью PXE.

source: How to set up IPv6 on a FreeBSD machine.
es: Cómo configurar IPv6 en una máquina FreeBSD.
ko: FreeBSD 머신에서 IPv6를 설정하는 방법.

source: How to enable and utilize the features of the Common Address Redundancy Protocol (CARP) in FreeBSD.
es: Cómo habilitar y utilizar las características del Common Address Redundancy Protocol (CARP) en FreeBSD.
ko: FreeBSD에서 공통 주소 중복 프로토콜(Common Address Redundancy Protocol, CARP)의 기능을 활성화하고 활용하는 방법.
ru: Как включить и использовать возможности протокола Common Address Redundancy Protocol (CARP) в FreeBSD.

source: How to configure multiple VLANs on FreeBSD.
es: Cómo configurar múltiples VLANs en FreeBSD.
ko: FreeBSD에서 다중 VLAN을 구성하는 방법.
ru: Как настроить несколько VLAN в FreeBSD.

source: Configure bluetooth headset.
es: Configurar unos auriculares con micrófono vía bluetooth.
ko: 블루투스 헤드셋 구성.
ru: Как настроить гарнитуру Bluetooth.

source: Before reading this chapter, you should:
es: Antes de leer este capítulo, deberías:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Understand the basics of the [.filename]#/etc/rc# scripts.
es: Comprender lo básico acerca de los scripts [.filename]#/etc/rc#.
ko: [.filename]#/etc/rc# 스크립트의 기초를 알고 있어야 합니다.
ru: Понимать основы скриптов [.filename]#/etc/rc#.

source: Be familiar with basic network terminology.
es: Estar familiarizado con la terminología básica de red.
ko: 네트워크 용어에 익숙해야 합니다.
ru: Знать основные термины и понятия сетевых технологий.

source: Know how to configure and install a new FreeBSD kernel (crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]).
es: Saber cómo configurar e instalar un nuevo kernel de FreeBSD (crossref:kernelconfig[kernelconfig,Configurando el Núcleo de FreeBSD]).
ko: 새 FreeBSD 커널을 구성하고 설치하는 방법을 알고 있어야 합니다(crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]).
ru: Знать, как настроить и установить новое ядро FreeBSD (crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]).

source: Know how to install additional third-party software (crossref:ports[ports,Installing Applications: Packages and Ports]).
es: Cómo instalar software adicional de terceros (crossref:ports[ports,Instalando Aplicaciones: Paquetes y Ports]).
ko: 타사 소프트웨어를 추가로 설치하는 방법을 알고 있어야 합니다(crossref:ports[ports,Installing Applications: Packages and Ports]).
ru: Знать, как устанавливать дополнительное стороннее программное обеспечение (crossref:ports[ports,Установка приложений: Пакеты и Порты]).

source: Gateways and Routes
es: Gateways y Rutas
ko: 게이트웨이와 라우트
ru: Шлюзы и Маршруты

source: _Routing_ is the mechanism that allows a system to find the network path to another system. A _route_ is a defined pair of addresses which represent the "destination" and a "gateway". The route indicates that when trying to get to the specified destination, send the packets through the specified gateway. There are three types of destinations: individual hosts, subnets, and "default". The "default route" is used if no other routes apply. There are also three types of gateways: individual hosts, interfaces, also called links, and Ethernet hardware (MAC) addresses. Known routes are stored in a routing table.
es: _Routing_ es el mecanismo que permite a un sistema encontrar el camino de red a otro sistema. Una _ruta_ es un par de direcciones definido las cuales representan el "destino" y el "gateway". La ruta indica que cuando se trata de llegar a un destino especificado, se deben enviar los paquetes a través del gateway especificado. Hay tres tipos de destinos: hosts individuales, subredes, y "default". La "ruta por defecto" se utiliza si no se puede aplicar ninguna otra ruta. También hay tres tipos de gateways: hosts individuales, interfaces, también llamados enlaces, y direcciones Ethernet (MAC). Las rutas conocidas se almacenan en una tabla de enrutamiento.
ko: _라우팅_은 시스템이 다른 시스템에 대한 네트워크 경로를 찾을 수 있도록 하는 메커니즘입니다. _라우팅_은 "목적지"와 "게이트웨이"를 나타내는 정의된 주소 쌍입니다. 라우팅은 지정된 목적지에 도달하려고 할 때 지정된 게이트웨이를 통해 패킷을 보내도록 지시합니다. 목적지에는 개별 호스트, 서브넷 및 "기본값(default)"의 세 가지 유형이 있습니다. 다른 경로가 적용되지 않는 경우 "기본 경로"가 사용됩니다. 게이트웨이에는 개별 호스트, 인터페이스라고도 하는 링크, 이더넷 하드웨어(MAC) 주소의 세 가지 유형도 있습니다. 알려진 경로는 라우팅 테이블에 저장됩니다.
ru: _Маршрутизация_ — это механизм, позволяющий системе находить сетевой путь к другой системе. _Маршрут_ — это определенная пара адресов, представляющих "назначение" и "шлюз". Маршрут указывает, что при попытке достичь указанного назначения пакеты должны отправляться через указанный шлюз. Существует три типа назначений: отдельные хосты, подсети и "маршрут по умолчанию". "Маршрут по умолчанию" используется, если не подходит ни один другой маршрут. Также существует три типа шлюзов: отдельные хосты, интерфейсы (также называемые линками) и аппаратные (MAC) адреса Ethernet. Известные маршруты хранятся в таблице маршрутизации.

source: This section provides an overview of routing basics. It then demonstrates how to configure a FreeBSD system as a router and offers some troubleshooting tips.
es: Esta sección proporciona una visión general de aspectos básicos de enrutado. Luego muestra cómo configurar un sistema FreeBSD como un router y proporciona algunas pistas para resolver problemas.
ko: 이 섹션에서는 라우팅 기본 사항에 대한 개요를 제공합니다. 그런 다음 FreeBSD 시스템을 라우터로 구성하는 방법을 시연하고 몇 가지 문제 해결 팁을 제공합니다.
ru: В этом разделе представлен обзор основ маршрутизации. Затем показано, как настроить систему FreeBSD в качестве маршрутизатора, и даны некоторые советы по устранению неполадок.

source: Routing Basics
es: Enrutamiento Básico
ko: 라우팅 기초
ru: Основы маршрутизации

source: To view the routing table of a FreeBSD system, use man:netstat[1]:
es: Para ver la tabla de enrutamiento de un sistema FreeBSD, usa man:netstat[1]:
ko: FreeBSD 시스템의 라우팅 테이블을 보려면 man:netstat[1]을 사용하세요:
ru: Для просмотра таблицы маршрутизации системы FreeBSD используйте man:netstat[1]:

source: The entries in this example are as follows:
es: Las entradas en este ejemplo son como sigue:
ko: 이 예의 항목은 다음과 같습니다:
ru: Записи в этом примере следующие:

source: default
es: Defecto

source: The first route in this table specifies the `default` route. When the local system needs to make a connection to a remote host, it checks the routing table to determine if a known path exists. If the remote host matches an entry in the table, the system checks to see if it can connect using the interface specified in that entry.
es: La primera ruta en esta tabla especifica la ruta por defecto (`default`). Cuando el sistema local necesita conectarse a un host remoto, comprueba la tabla de enrutamiento para determinar si existe un camino. Si el host remoto tiene una entrada en la tabla, el sistema comprueba si puede conectar utilizando el interfaz especificado en dicha entrada.
ko: 이 표의 첫 번째 경로는 `default` 경로를 지정합니다. 로컬 시스템이 원격 호스트에 연결해야 할 때 라우팅 테이블을 확인하여 알려진 경로가 존재하는지 확인합니다. 원격 호스트가 테이블의 항목과 일치하면 시스템은 해당 항목에 지정된 인터페이스를 사용하여 연결할 수 있는지 확인합니다.
ru: Первый маршрут в этой таблице указывает маршрут по умолчанию (`default`). Когда локальной системе требуется установить соединение с удалённым узлом, она проверяет таблицу маршрутизации, чтобы определить, существует ли известный путь. Если удалённый узел соответствует записи в таблице, система проверяет, может ли она подключиться, используя интерфейс, указанный в этой записи.

source: If the destination does not match an entry, or if all known paths fail, the system uses the entry for the default route. For hosts on a local area network, the `Gateway` field in the default route is set to the system which has a direct connection to the Internet. When reading this entry, verify that the `Flags` column indicates that the gateway is usable (`UG`).
es: Si el destino no tiene una entrada, o si todos los caminos conocidos fallan, el sistema utiliza la entrada para el enrutamiento por defecto. Para hosts en la red de área local, el campo `Gateway` en la ruta por defecto se establece al sistema que tiene una conexión directa a Internet. Cuando se lee esta entrada, verifica que la columna `Flags` indica que el gateway se puede usar (`UG`).
ko: 목적지가 항목과 일치하지 않거나 알려진 모든 경로가 실패하면 시스템은 기본 경로의 항목을 사용합니다. 로컬 영역 네트워크에 있는 호스트의 경우 기본 경로의 `Gateway` 필드는 인터넷에 직접 연결되어 있는 시스템으로 설정됩니다. 이 항목을 읽을 때 `Flags` 열에 게이트웨이가 사용 가능(`UG`)함을 나타내는지 확인합니다.
ru: Если назначение не соответствует ни одной записи или если все известные пути недоступны, система использует запись для маршрута по умолчанию. Для хостов в локальной сети поле `Gateway` в маршруте по умолчанию указывает на систему, имеющую прямое подключение к Интернету. При чтении этой записи убедитесь, что столбец `Flags` указывает на то, что шлюз доступен (`UG`).

source: The default route for a machine which itself is functioning as the gateway to the outside world will be the gateway machine at the Internet Service Provider (ISP).
es: La ruta por defecto para una máquina que está funcionando como gateway para el mundo exterior será la máquina gateway del Proveedor de Servicio de Internet (ISP).
ko: 외부 세계로 향하는 게이트웨이 역할을 하는 머신의 기본 경로는 인터넷 서비스 제공업체(ISP)의 게이트웨이 머신이 됩니다.
ru: Маршрут по умолчанию для машины, которая сама функционирует как шлюз во внешний мир, будет шлюзом провайдера интернет-услуг (ISP).

source: The second route is the `localhost` route. The interface specified in the `Netif` column for `localhost` is [.filename]#lo0#, also known as the loopback device. This indicates that all traffic for this destination should be internal, rather than sending it out over the network.
es: La segunda ruta es `localhost`. El interfaz especificado en la columna `Netif` para `localhost` es [.filename]#lo0#, también conocido como el dispositivo loopback. Esto indica que todo el tráfico para este destino debería ser interno, en lugar de enviarlo a través de la red.
ko: 두 번째 경로는 `localhost` 경로입니다. `localhost`의 `Netif` 열에 지정된 인터페이스는 루프백 장치라고도 하는 [.filename]#lo0#입니다. 이는 이 대상에 대한 모든 트래픽이 네트워크를 통해 전송되지 않고 내부에 있어야 함을 나타냅니다.
ru: Второй маршрут — это маршрут `localhost`. Интерфейс, указанный в столбце `Netif` для `localhost`, — это [.filename]#lo0#, также известное как loopback-устройство. Это означает, что весь трафик для этого назначения должен быть внутренним, а не отправляться через сеть.

source: MAC address
es: Dirección MAC
ru: MAC адрес

source: The addresses beginning with `0:e0:` are MAC addresses. FreeBSD will automatically identify any hosts, `test0` in the example, on the local Ethernet and add a route for that host over the Ethernet interface, [.filename]#re0#. This type of route has a timeout, seen in the `Expire` column, which is used if the host does not respond in a specific amount of time. When this happens, the route to this host will be automatically deleted. These hosts are identified using the Routing Information Protocol (RIP), which calculates routes to local hosts based upon a shortest path determination.
es: Las direcciones que comienzan con `0:e0` son direcciones MAC. FreeBSD identificará automáticamente cualquier host, `test0` en el ejemplo, en el Ethernet local y añadirá una ruta para ese host sobre el interfaz Ethernet, [.filename]#re0#. Este tipo de ruta tiene un timeout, mostrado en la columna `Expire`, que es usado si el host no responde en un tiempo determinado. Cuando esto sucede, la ruta a este host será automáticamente borrada. Estos hosts se identifican usando el Routing Information Protocol (RIP), que calcula rutas a los hosts locales basándose en la determinación del camino más corto.
ko: `0:e0:`로 시작하는 주소는 MAC 어드레스입니다. FreeBSD는 로컬 이더넷에 있는 호스트(예제에서는 `test0`)를 자동으로 식별하고 이더넷 인터페이스를 통해 해당 호스트에 대한 경로인 [.filename]#re0#을 추가합니다. 이 유형의 경로에는 `Expire` 열에 표시된 시간 제한이 있으며, 호스트가 특정 시간 내에 응답하지 않는 경우에 사용됩니다. 이 경우 이 호스트에 대한 경로가 자동으로 삭제됩니다. 이러한 호스트는 최단 경로 결정을 기반으로 로컬 호스트에 대한 경로를 계산하는 RIP(라우팅 정보 프로토콜)를 사용하여 식별됩니다.
ru: Адреса, начинающиеся с `0:e0:`, являются MAC-адресами. FreeBSD автоматически определит любые хосты, например `test0`, в локальной сети Ethernet и добавит маршрут для этого хоста через интерфейс Ethernet [.filename]#re0#. Такой маршрут имеет время жизни, указанное в столбце `Expire`, которое используется, если хост не отвечает в течение определённого времени. В этом случае маршрут к этому хосту будет автоматически удалён. Эти хосты определяются с помощью Протокола маршрутной информации (RIP — Routing Information Protocol), который вычисляет маршруты к локальным хостам на основе определения кратчайшего пути.

source: subnet
es: subred

source: FreeBSD will automatically add subnet routes for the local subnet. In this example, `10.20.30.255` is the broadcast address for the subnet `10.20.30` and `example.com` is the domain name associated with that subnet. The designation `link#1` refers to the first Ethernet card in the machine.
es: FreeBSD añadirá rutas para la subred local. En este ejemplo, `10.20.30.255` es la dirección de broadcast para la subred `10.20.30` y `example.com` es el nombre de dominio asociado con esa subred. La designación `link#1` hace referencia a la primera tarjeta Ethernet de la máquina.
ko: FreeBSD는 로컬 서브넷에 대한 서브넷 경로를 자동으로 추가합니다. 이 예에서 `10.20.30.255`는 서브넷 `10.20.30`의 브로드캐스트 주소이고 `example.com`은 해당 서브넷과 연결된 도메인 이름입니다. `link#1`은 머신의 첫 번째 이더넷 카드를 나타냅니다.
ru: FreeBSD автоматически добавит маршруты для локальной подсети. В этом примере `10.20.30.255` — это широковещательный адрес для подсети `10.20.30`, а `example.com` — доменное имя, связанное с этой подсетью. Обозначение `link#1` относится к первой Ethernet-карте в машине.

source: Local network hosts and local subnets have their routes automatically configured by a daemon called man:routed[8]. If it is not running, only routes which are statically defined by the administrator will exist.
es: Hosts en la red local y subredes locales tienen sus rutas configuradas automáticamente por un demonio llamado man:routed[8]. Si no se está ejecutando, sólo existirán las rutas que hayan sido configuradas estáticamente por el administrador.
ko: 로컬 네트워크 호스트와 로컬 서브넷은 man:routed[8]라는 데몬에 의해 경로가 자동으로 구성됩니다. 이 데몬이 실행되지 않으면 관리자가 정적으로 정의한 경로만 존재합니다.
ru: Локальные хосты сети и локальные подсети автоматически получают маршруты через демон man:routed[8]. Если он не запущен, будут существовать только маршруты, статически определённые администратором.

source: The `host1` line refers to the host by its Ethernet address. Since it is the sending host, FreeBSD knows to use the loopback interface ([.filename]#lo0#) rather than the Ethernet interface.
es: La línea `host1` hace referencia al host mediante su dirección Ethernet. Puesto que es el host que envía, FreeBSD sabe que tienen que usar el interfaz loopback ([.filename]#lo0#) en lugar del interfaz Ethernet.
ko: `host1` 줄은 이더넷 주소로 호스트를 나타냅니다. 이 호스트는 보내는 호스트이므로, FreeBSD는 이더넷 인터페이스가 아닌 루프백 인터페이스([.filename]#lo0#)를 사용한다는 것을 알고 있습니다.
ru: Строка `host1` ссылается на хост по его Ethernet-адресу. Поскольку это отправляющий хост, FreeBSD использует loopback-интерфейс ([.filename]#lo0#) вместо Ethernet-интерфейса.

source: The two `host2` lines represent aliases which were created using man:ifconfig[8]. The `=>` symbol after the [.filename]#lo0# interface says that an alias has been set in addition to the loopback address. Such routes only show up on the host that supports the alias and all other hosts on the local network will have a `link#1` line for such routes.
es: Las dos líneas `host2` representan alias que se crean utilizando man:ifconfig[8]. El símbolo `=>` después del interfaz [.filename]#lo0# indica que se ha establecido un alias además de la dirección de loopback. Estas rutas sólo se muestran en el host que suporta el alias y el resto de hosts en la red local tendrán una línea `link#1` para esas rutas.
ko: 두 개의 `host2` 줄은 man:ifconfig[8]을 사용하여 생성된 별칭(alias)을 나타냅니다. [.filename]#lo0# 인터페이스 뒤의 `=>` 기호는 루프백 주소 외에 별칭이 설정되었음을 나타냅니다. 이러한 경로는 별칭을 지원하는 호스트에만 표시되며 로컬 네트워크의 다른 모든 호스트에는 해당 경로에 대한 `link#1` 줄이 있습니다.
ru: Две строки `host2` представляют собой псевдонимы, созданные с помощью man:ifconfig[8]. Символ `=>` после интерфейса [.filename]#lo0# указывает, что помимо loopback-адреса был установлен псевдоним. Такие маршруты отображаются только на хосте, поддерживающем псевдоним, а все остальные хосты в локальной сети будут иметь строку `link#1` для таких маршрутов.

source: The final line (destination subnet `224`) deals with multicasting.
es: La última línea (subred de destino `224`) tiene que ver con multicasting.
ko: 마지막 줄(destination subnet `224`)은 멀티캐스팅을 처리합니다.
ru: Последняя строка (подсеть назначения `224`) относится к многоадресной рассылке.

source: Various attributes of each route can be seen in the `Flags` column. <<routeflags>> summarizes some of these flags and their meanings:
es: Se pueden ver varios atributos para cada ruta en la columna `Flags`. <<routeflags>> resume algunos de estos flags y sus significados:
ko: 각 경로의 다양한 속성은 `Flags` 열에서 확인할 수 있습니다. <<routeflags>>에는 이러한 플래그 중 일부와 그 의미가 요약되어 있습니다:

source: Commonly Seen Routing Table Flags
es: Flags Habituales de la Tabla de Enrutado
ko: 흔히 볼 수 있는 라우팅 테이블 플래그
ru: Часто встречающиеся флаги таблицы маршрутизации

source: Command
es: Comando

source: Purpose
es: Propósito
ko: 목적
ru: Назначение

source: The route is active (up).
es: La ruta está activa (up).
ko: 경로가 활성화되었습니다(up).
ru: Маршрут активен (поднят).

source: The route destination is a single host.
es: La ruta de destino es un único host.
ko: 라우팅 대상은 단일 호스트입니다.
ru: Целью маршрута является отдельный хост.

source: Send anything for this destination on to this gateway, which will figure out from there where to send it.
es: Envía cualquier cosa a este destino a través de este gateway, que averiguará a dónde enviarlo a continuación.
ko: 이 대상에 대한 모든 것을 이 게이트웨이로 보내면 게이트웨이가 어디로 보낼지 알아서 결정합니다.
ru: Отправляйте всё для этого назначения на этот шлюз, который разберётся, куда это нужно отправить.

source: This route was statically configured.
es: Esta ruta se ha configurado de forma estática.
ko: 이 경로는 정적으로 구성되어 있습니다.
ru: Этот маршрут был настроен статически.

source: Clones a new route based upon this route for machines to connect to. This type of route is normally used for local networks.
es: Clona una nueva ruta basada en esta ruta para que las máquinas puedan conectarse. Este tipo de ruta se usa normalmente para redes locales.
ko: 이 경로를 기반으로 새 경로를 복제하여 머신이 연결할 수 있도록 합니다. 이 유형의 경로는 일반적으로 로컬 네트워크에 사용됩니다.
ru: Клонирует новый маршрут на основе данного для подключения машин. Такой тип маршрута обычно используется для локальных сетей.

source: The route was auto-configured based upon a local area network (clone) route.
es: La ruta ha sido auto configurada basada en una ruta (clonada) de una red de área local.
ko: 경로는 로컬 영역 네트워크(클론) 경로를 기반으로 자동 구성되었습니다.
ru: Маршрут был автоматически настроен на основе локальной сети (клон) маршрута.

source: Route involves references to Ethernet (link) hardware.
es: La ruta incluye referencias a hardware Ethernet (link).
ko: 라우트에는 이더넷(링크) 하드웨어에 대한 참조가 포함됩니다.
ru: Маршрут включает ссылки на оборудование Ethernet (link).

source: On a FreeBSD system, the default route can defined in [.filename]#/etc/rc.conf# by specifying the IP address of the default gateway:
es: En un sistema FreeBSD, la ruta por defecto se puede configurar en [.filename]#/etc/rc.conf# especificando la dirección IP del gateway por defecto:
ko: FreeBSD 시스템에서는 기본 게이트웨이의 IP 주소를 지정하여 [.filename]#/etc/rc.conf#에서 기본 경로를 정의할 수 있습니다:
ru: На системе FreeBSD маршрут по умолчанию может быть определён в [.filename]#/etc/rc.conf# путём указания IP-адреса шлюза по умолчанию:

source: It is also possible to manually add the route using `route`:
es: También es posible añadir la ruta de forma manual usando `route`:
ko: `route`를 사용하여 수동으로 경로를 추가할 수도 있습니다:
ru: Также можно вручную добавить маршрут с помощью `route`:

source: Note that manually added routes will not survive a reboot. For more information on manual manipulation of network routing tables, refer to man:route[8].
es: Date cuenta de que las rutas añadidas manualmente no persisten entre reinicios. Para más información sobre la manipulación manual de tablas de enrutamiento de red, consulta man:route[8].
ko: 수동으로 추가한 경로는 재부팅 후에 살아남지 못한다는 점에 유의하세요. 네트워크 라우팅 테이블의 수동 조작에 대한 자세한 내용은 man:route[8]을 참조하세요.
ru: Обратите внимание, что вручную добавленные маршруты не сохранятся после перезагрузки. Для получения дополнительной информации о ручном управлении таблицами сетевой маршрутизации обратитесь к man:route[8].

source: Configuring a Router with Static Routes
es: Configurando un Router con Rutas Estáticas
ko: 정적 경로로 라우터 구성하기
ru: Настройка маршрутизатора со статическими маршрутами
