Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: Separate from the underlying transmission techniques, 802.11 networks have a variety of security mechanisms. The original 802.11 specifications defined a simple security protocol called WEP. This protocol uses a fixed pre-shared key and the RC4 cryptographic cipher to encode data transmitted on a network. Stations must all agree on the fixed key in order to communicate. This scheme was shown to be easily broken and is now rarely used except to discourage transient users from joining networks. Current security practice is given by the IEEE(R) 802.11i specification that defines new cryptographic ciphers and an additional protocol to authenticate stations to an access point and exchange keys for data communication. Cryptographic keys are periodically refreshed and there are mechanisms for detecting and countering intrusion attempts. Another security protocol specification commonly used in wireless networks is termed WPA, which was a precursor to 802.11i. WPA specifies a subset of the requirements found in 802.11i and is designed for implementation on legacy hardware. Specifically, WPA requires only the TKIP cipher that is derived from the original WEP cipher. 802.11i permits use of TKIP but also requires support for a stronger cipher, AES-CCM, for encrypting data. The AES cipher was not required in WPA because it was deemed too computationally costly to be implemented on legacy hardware.
es: De forma separada de las técnicas de transmisión subyacentes, las redes 802.11 tienen un conjunto de mecanismos de seguridad. Las especificaciones 802.11 originales definían un protocolo de seguridad sencillo denominado WEP. Este protocolo utiliza una clave compartida prefijada y el codificador criptográfico RC4 para codificar los datos transmitidos por la red. Todas las estaciones deben ponerse de acuerdo en la clave fijada para poder comunicarse. Se ha demostrado que este esquema se puede romper fácilmente y actualmente no se usa salvo para desaconsejar a algunos usuarios que se conecten a algunas redes. La práctica de seguridad actual se fija por la especificación IEEE(R) 802.11i que define nuevos codificadores criptográficos y un protocolo adicional para autenticar estaciones contra un punto de acceso e intercambiar claves para realizar la comunicación. Las claves criptográficas se refrescan periódicamente y hay mecanismos para detectar y contrarrestar intentos de intrusión. Otra especificación de protocolo de seguridad que se usa en redes inalámbricas habitualmente se denomina WPA, que fue un precursos de 802.11i. WPA especifica un subconjunto de los requisitos que se encuentran en 802.11i y está diseñado para poder se implementado en hardware heredado. Específicamente, WPA sólo requiere el codificador TKIP que se deriva del codificador original WEP. 802.11i permite el uso de TKIP pero también requiere soporte para un codificador más fuerte, AES-CCM, para encriptar los datos. El codificador AES no era necesario en WPA porque se consideraba demasiado costoso computacionalmente como para se implementado en hardware heredado.
ko: 기본 전송 기술과는 별개로 802.11 네트워크에는 다양한 보안 메커니즘이 있습니다. 원래 802.11 사양은 WEP라는 간단한 보안 프로토콜을 정의했습니다. 이 프로토콜은 미리 공유된 고정 키와 RC4 암호화 암호를 사용하여 네트워크에서 전송되는 데이터를 인코딩합니다. 통신을 위해서는 모든 스테이션이 고정 키에 동의해야 합니다. 이 방식은 쉽게 깨질 수 있는 것으로 밝혀져 현재는 일시적인 사용자의 네트워크 참여를 막는 경우를 제외하고는 거의 사용되지 않습니다. 현재 보안 관행은 새로운 암호화 암호와 액세스 포인트에 대한 스테이션 인증 및 데이터 통신을 위한 키 교환을 위한 추가 프로토콜을 정의하는 IEEE(R) 802.11i 사양에 의해 제공됩니다. 암호화 키는 주기적으로 새로 고쳐지며 침입 시도를 감지하고 대응하는 메커니즘이 있습니다. 무선 네트워크에서 일반적으로 사용되는 또 다른 보안 프로토콜 사양은 802.11i의 전신인 WPA라고 합니다. WPA는 802.11i에서 발견되는 요구 사항의 하위 집합을 지정하며 레거시 하드웨어에서 구현하도록 설계되었습니다. 특히, WPA는 원래 WEP 암호에서 파생된 TKIP 암호만 필요합니다. 802.11i는 TKIP 사용을 허용하지만 데이터 암호화를 위해 더 강력한 암호인 AES-CCM에 대한 지원도 필요합니다. AES 암호는 레거시 하드웨어에서 구현하기에는 계산 비용이 너무 많이 드는 것으로 간주되었기 때문에 WPA에서는 요구되지 않았습니다.

source: The other standard to be aware of is 802.11e. It defines protocols for deploying multimedia applications, such as streaming video and voice over IP (VoIP), in an 802.11 network. Like 802.11i, 802.11e also has a precursor specification termed WME (later renamed WMM) that has been defined by an industry group as a subset of 802.11e that can be deployed now to enable multimedia applications while waiting for the final ratification of 802.11e. The most important thing to know about 802.11e and WME/WMM is that it enables prioritized traffic over a wireless network through Quality of Service (QoS) protocols and enhanced media access protocols. Proper implementation of these protocols enables high speed bursting of data and prioritized traffic flow.
es: El otro estándar que hay que considerar es 802.11e. Define protocolos para desplegar aplicaciones multimedia, como streaming de voz y vídeo sobre IP (VoIP), en una red 802.11. Al igual que 802.11i, 802.11e también tiene una especificación precedente llamada WME (posteriormente renombrada a WMM) que ha sido definida por un grupo industrial como un subconjunto de 802.11e que se puede desplegar actualmente para habilitar aplicaciones multimedia mientras se espera a la ratificación final de 802.11e. Lo más importante que hay que saber acerca de 802.11e y WME/WMM es que habilita la priorización de tráfico sobre redes inalámbricas mediante protocolos de tipo Calidad de Servicio (QoS) y mejora los protocolos de acceso a medios. La implementación adecuada de estos protocolos habilita los picos de datos de alta velocidad y flujos de tráfico priorizados.
ko: 알아두어야 할 또 다른 표준은 802.11e입니다. 이 표준은 802.11 네트워크에서 스트리밍 비디오 및 VoIP(Voice over IP)와 같은 멀티미디어 애플리케이션을 배포하기 위한 프로토콜을 정의합니다. 802.11i와 마찬가지로 802.11e에는 802.11e의 최종 승인을 기다리는 동안 멀티미디어 애플리케이션을 활성화하기 위해 지금 배포할 수 있는 802.11e의 하위 집합으로 업계 그룹에서 정의한 WME(나중에 WMM으로 이름 변경)라는 전구 사양도 있습니다. 802.11e와 WME/WMM에 대해 알아야 할 가장 중요한 점은 서비스 품질(QoS) 프로토콜과 향상된 미디어 액세스 프로토콜을 통해 무선 네트워크에서 트래픽의 우선순위를 지정할 수 있다는 것입니다. 이러한 프로토콜을 올바르게 구현하면 데이터의 고속 버스팅과 트래픽 흐름의 우선순위를 지정할 수 있습니다.

source: FreeBSD supports networks that operate using 802.11a, 802.11b, and 802.11g. The WPA and 802.11i security protocols are likewise supported (in conjunction with any of 11a, 11b, and 11g) and QoS and traffic prioritization required by the WME/WMM protocols are supported for a limited set of wireless devices.
es: FreeBSD soporta redes que operan usando 802.11a, 802.11b, y 802.11g. Los protocolos de seguridad WPA y 802.11i también están soportados (junto con cualquiera de 11a, 11b, y 11g) y QoS y la priorización de tráfico necesarios para los protocolos WME/WMM están soportados para un conjunto limitado de dispositivos inalámbricos.
ko: FreeBSD는 802.11a, 802.11b 및 802.11g를 사용하여 작동하는 네트워크를 지원합니다. WPA 및 802.11i 보안 프로토콜도 마찬가지로 지원되며(11a, 11b, 11g 중 하나와 함께), WME/WMM 프로토콜에 필요한 QoS 및 트래픽 우선 순위 지정은 제한된 무선 장치 세트에 대해 지원됩니다.

source: Quick Start
es: Inicio rápido
ko: 빠른 시작

source: Connecting a computer to an existing wireless network is a very common situation. This procedure shows the steps required.
es: Conectar un ordenador a una red inalámbrica existente es una situación muy común. Este procedimiento muestra los pasos necesarios.
ko: 컴퓨터를 기존 무선 네트워크에 연결하는 것은 매우 일반적인 상황입니다. 이 절차는 필요한 단계를 보여줍니다.

source: Obtain the SSID (Service Set Identifier) and PSK (Pre-Shared Key) for the wireless network from the network administrator.
es: Obtén el SSID (Service Set Identifier) y PSK (Pre-Shared Key) para la red inalámbrica a través del administrador de la red.
ko: 네트워크 관리자로부터 무선 네트워크의 SSID(Service Set Identifier) 및 PSK(사전 공유 키)를 받습니다.

source: Identify the wireless adapter. The FreeBSD [.filename]#GENERIC# kernel includes drivers for many common wireless adapters. If the wireless adapter is one of those models, it will be listed in the man:sysctl[8] `net.wlan.devices` variable:
es: Identifica el adaptador inalámbrico. El kernel [.filename]#GENERIC# de FreeBSD incluye controladores para muchos adaptadores inalámbricos habituales. Si el adaptador inalámbrico es uno de esos modelos aparecerá en la lista de la variable `net.wlan.devices` de man:sysctl[8]:
ko: 무선 어댑터를 확인합니다. FreeBSD [.filename]#GENERIC# 커널에는 많은 일반적인 무선 어댑터용 드라이버가 포함되어 있습니다. 무선 어댑터가 이러한 모델 중 하나인 경우, man:sysctl[8] `net.wlan.devices` 변수에 나열됩니다:

source: If a wireless adapter is not listed, an additional kernel module might be required, or it might be a model not supported by FreeBSD.
es: Si un adaptador inalámbrico no aparece en la lista, podrían ser necesarios módulos adicionales para el kernel, o podría ser un modelo no soportado por FreeBSD.
ko: 무선 어댑터가 목록에 없다면, 추가 커널 모듈이 필요하거나 FreeBSD에서 지원하지 않는 모델일 수 있습니다.

source: This example shows the Atheros `ath0` wireless adapter.
es: Este ejemplo muestra el adaptador inalámbrico Atheros `ath0`.
ko: 이 예는 Atheros `ath0` 무선 어댑터를 보여줍니다.

source: Add an entry for this network to [.filename]#/etc/wpa_supplicant.conf#. If the file does not exist, create it. Replace _myssid_ and _mypsk_ with the SSID and PSK provided by the network administrator.
es: Añade una entrada para esta red en [.filename]#/etc/wpa_supplicant.conf#. Si el fichero no existe, créalo. Sustituye _myssid_ y _mypsk_ con el SSID y el PSK proporcionado por el administrador de red.
ko: 이 네트워크에 대한 항목을 [.filename]#/etc/wpa_supplicant.conf#에 추가합니다. 파일이 없는 경우 파일을 생성합니다. _myssid_ 및 _mypsk_를 네트워크 관리자가 제공한 SSID 및 PSK로 바꿉니다.

source: Add entries to [.filename]#/etc/rc.conf# to configure the network on startup:
es: Añade entradas a [.filename]#/etc/rc.conf# para configurar la red durante el arranque:
ko: 시작 시 네트워크를 구성하려면 [.filename]#/etc/rc.conf#에 항목을 추가하세요:

source: Restart the computer, or restart the network service to connect to the network:
es: Reinicia el ordenador, o reinicia el servicio de red para conectar a la red:
ko: 컴퓨터를 다시 시작하거나 네트워크 서비스를 다시 시작하여 네트워크에 연결합니다:

source: Basic Setup
es: Configuración Básica
ko: 기본 설정

source: Kernel Configuration
es: Configuración del kernel
ko: 커널 구성

source: To use wireless networking, a wireless networking card is needed and the kernel needs to be configured with the appropriate wireless networking support. The kernel is separated into multiple modules so that only the required support needs to be configured.
es: Para usar redes inalámbricas, se necesita una tarjeta de red inalámbrica y el kernel necesita estar configurado con el soporte de red apropiado para redes inalámbricas. El kernel está separado en múltiples módulos de forma que sólo se necesita configurar el suporte necesario.
ko: 무선 네트워킹을 사용하려면 무선 네트워킹 카드가 필요하며 커널을 적절한 무선 네트워킹 지원으로 구성해야 합니다. 커널은 여러 모듈로 분리되어 있으므로 필요한 지원만 구성하면 됩니다.

source: The most commonly used wireless devices are those that use parts made by Atheros. These devices are supported by man:ath[4] and require the following line to be added to [.filename]#/boot/loader.conf#:
es: Los dispositivos inalámbricos más utilizados son aquellos que utilizan partes fabricadas por Atheros. Estos dispositivos están soportados por man:ath[4] y requieren la siguiente línea en [.filename]#/boot/loader.conf#:
ko: 가장 일반적으로 사용되는 무선 장치는 Atheros에서 만든 부품을 사용하는 장치입니다. 이러한 장치는 man:ath[4]에서 지원되며 [.filename]#/boot/loader.conf#에 다음 줄을 추가해야 합니다:

source: The Atheros driver is split up into three separate pieces: the driver (man:ath[4]), the hardware support layer that handles chip-specific functions (man:ath_hal[4]), and an algorithm for selecting the rate for transmitting frames. When this support is loaded as kernel modules, any dependencies are automatically handled. To load support for a different type of wireless device, specify the module for that device. This example is for devices based on the Intersil Prism parts (man:wi[4]) driver:
es: El controlador Atheros está separado en tres piezas independientes: el controlador (man:ath[4]), la capa de soporte hardware que maneja funciones específicas del chip (man:ath_hal[4]), y el algoritmo para seleccionar la tasa de transmisión de marcos (frames). Cuando se carga este soporte como módulos del kernel, cualquier dependencia se maneja de forma automática. Para cargar soporte para un tipo de dispositivo inalámbrico distinto, especifica el módulo para dicho dispositivo. Este ejemplo es para dispositivos basados en el controlador Intersil Prism (man:wi[i]):
ko: Atheros 드라이버는 드라이버(man:ath[4]), 칩별 기능을 처리하는 하드웨어 지원 계층(man:ath_hal[4]), 프레임 전송 속도를 선택하는 알고리즘의 세 부분으로 나뉘어져 있습니다. 이 지원이 커널 모듈로 로드되면 모든 종속성이 자동으로 처리됩니다. 다른 유형의 무선 장치에 대한 지원을 로드하려면 해당 장치에 대한 모듈을 지정합니다. 이 예는 Intersil Prism 부품(man:wi[4]) 드라이버를 기반으로 하는 장치에 대한 것입니다:

source: The examples in this section use an man:ath[4] device and the device name in the examples must be changed according to the configuration. A list of available wireless drivers and supported adapters can be found in the FreeBSD Hardware Notes, available on the https://www.FreeBSD.org/releases/[Release Information] page of the FreeBSD website. If a native FreeBSD driver for the wireless device does not exist, it may be possible to use the Windows(R) driver with the help of the crossref:config[config-network-ndis,NDIS] driver wrapper.
es: Los ejemplos en esta sección utilizan un dispositivo man:ath[4] y el nombre del dispositivo en los ejemplos se debe cambiar de acuerdo con la configuración. Se puede encontrar una lista de los controladores inalámbricos disponibles así como los adaptadores soportados en las Notas de Hardware de FreeBSD en la página https://www.FreeBSD.org/releases/[Release Information] del sitio web de FreeBSD. Si no existe un controlador nativo de FreeBSD para el dispositivo inalámbrico, podría ser posible utilizar el controlador de Windows(R) con la ayuda del adaptador de controladores .crossref:config[config-network-ndis,NDIS].
ko: 이 섹션의 예제에서는 man:ath[4] 장치를 사용하며, 예제에서 장치 이름은 구성에 따라 변경해야 합니다. 사용 가능한 무선 드라이버 및 지원되는 어댑터 목록은 FreeBSD 웹 사이트의 https://www.FreeBSD.org/releases/[릴리즈 정보] 페이지에서 제공되는 FreeBSD 하드웨어 노트에서 찾을 수 있습니다. 무선 장치에 대한 기본 FreeBSD 드라이버가 없는 경우, crossref:config[config-network-ndis,NDIS] 드라이버 래퍼를 사용하여 Windows(R) 드라이버를 사용할 수 있습니다.

source: In addition, the modules that implement cryptographic support for the security protocols to use must be loaded. These are intended to be dynamically loaded on demand by the man:wlan[4] module, but for now they must be manually configured. The following modules are available: man:wlan_wep[4], man:wlan_ccmp[4], and man:wlan_tkip[4]. The man:wlan_ccmp[4] and man:wlan_tkip[4] drivers are only needed when using the WPA or 802.11i security protocols. If the network does not use encryption, man:wlan_wep[4] support is not needed. To load these modules at boot time, add the following lines to [.filename]#/boot/loader.conf#:
es: Además, se tienen que cargar los módulos que implementan el soporte criptográfico para los protocolos de seguridad. Estos están pensados para ser cargados dinámicamente bajo demanda por el módulo man:wlan[4], pero por el momento se deben configurar manualmente. Los siguientes módulos están disponibles: man:wlan_wep[4], man:wlan_ccmp[4], y man:wlan_tkip[4]. Los constroladores man:wlan_ccmp[4] y man:wlan_tkip[4] sólo son necesarios cuando se utilizan protocolos de seguridad WPA o 802.11i. Si la red no soporta encriptación, no se necesita man:wlan_wep[4]. Para cargar estos módulos en el arranque, añade las siguientes líneas a [.filename]#/boot/loader.conf#:
ko: 또한 사용할 보안 프로토콜에 대한 암호화 지원을 구현하는 모듈을 로드해야 합니다. 이러한 모듈은 man:wlan[4] 모듈에 의해 요청 시 동적으로 로드되도록 설계되었지만 현재로서는 수동으로 구성해야 합니다. 다음 모듈을 사용할 수 있습니다: man:wlan_wep[4], man:wlan_ccmp[4], man:wlan_tkip[4]. man:wlan_ccmp[4] 및 man:wlan_tkip[4] 드라이버는 WPA 또는 802.11i 보안 프로토콜을 사용할 때만 필요합니다. 네트워크에서 암호화를 사용하지 않는 경우 man:wlan_wep[4] 지원이 필요하지 않습니다. 부팅 시 이러한 모듈을 로드하려면 [.filename]#/boot/loader.conf#에 다음 줄을 추가합니다:

source: Once this information has been added to [.filename]#/boot/loader.conf#, reboot the FreeBSD box. Alternately, load the modules by hand using man:kldload[8].
es: Una vez que se ha añadido esta información a [.filename]#/boot/loader.conf#, reinicia la máquina FreeBSD. De forma alternativa, carga los módulos a mano utilizando man:kldload[8].
ko: 이 정보를 [.filename]#/boot/loader.conf#에 추가한 후, FreeBSD 박스를 재부팅합니다. 또는 man:kldload[8]를 사용하여 수동으로 모듈을 로드합니다.

source: For users who do not want to use modules, it is possible to compile these drivers into the kernel by adding the following lines to a custom kernel configuration file:
es: Para usuarios que no quieren usar módulos, es posible compilar estos controladores en el kernel añadiendo las siguientes líneas al fichero de configuración de un kernel personalizado:
ko: 모듈을 사용하지 않으려는 사용자의 경우 커스텀 커널 구성 파일에 다음 줄을 추가하여 이러한 드라이버를 커널에 컴파일할 수 있습니다:

source: With this information in the kernel configuration file, recompile the kernel and reboot the FreeBSD machine.
es: Con esta información en el fichero de configuración del kernel, recompila el kernel y reinicia la máquina FreeBSD.
ko: 커널 구성 파일에 있는 이 정보를 사용하여 커널을 다시 컴파일하고 FreeBSD 머신을 재부팅합니다.

source: Information about the wireless device should appear in the boot messages, like this:
es: En los mensajes de arranque debería aparecer información como esta acerca del dispositivo inalámbrico:
ko: 부팅 메시지에 다음과 같이 무선 장치에 대한 정보가 표시되어야 합니다:

source: Setting the Correct Region
es: Estableciendo la Región Correcta
ko: 올바른 지역 설정하기

source: Since the regulatory situation is different in various parts of the world, it is necessary to correctly set the domains that apply to your location to have the correct information about what channels can be used.
es: Como la situación regulatoria es diferente en varios puntos del mundo, es necesario establecer correctamente los dominios que aplican a tu localización para así tener información correcta sobre los canales que se pueden utilizar.
ko: 전 세계 여러 지역의 규제 상황이 다르기 때문에 사용할 수 있는 채널에 대한 정확한 정보를 얻으려면 해당 지역에 적용되는 도메인을 올바르게 설정해야 합니다.

source: The available region definitions can be found in [.filename]#/etc/regdomain.xml#. To set the data at runtime, use `ifconfig`:
es: Se pueden encontrar las definiciones de las regiones disponibles en [.filename]#/etc/regdomain.xml#. Para establecer datos en tiempo de ejecución, usa `ifconfig`:
ko: 사용 가능한 지역 정의는 [.filename]#/etc/regdomain.xml#에서 찾을 수 있습니다. 런타임에 데이터를 설정하려면 `ifconfig`를 사용합니다:

source: To persist the settings, add it to [.filename]#/etc/rc.conf#:
es: Para hacer los cambios persistentes, añádelos a [.filename]#/etc/rc.conf#:
ko: 설정을 유지하려면 [.filename]#/etc/rc.conf#에 추가하세요:

source: Infrastructure Mode
es: Modo Infraestructura
ko: Infrastructure 모드

source: Infrastructure (BSS) mode is the mode that is typically used. In this mode, a number of wireless access points are connected to a wired network. Each wireless network has its own name, called the SSID. Wireless clients connect to the wireless access points.
es: El modo infraestructura (BSS) es el modo que se utiliza habitualmente. En este modo, un número de puntos de acceso inalámbrico se conectan a una red por cable. Cada red inalámbrica tiene su propio nombre, llamado SSID. Los clientes inalámbricos se conectan a los puntos de acceso inalámbricos.
ko: Infrastructure(BSS) 모드는 일반적으로 사용되는 모드입니다. 이 모드에서는 여러 무선 액세스 포인트가 유선 네트워크에 연결됩니다. 각 무선 네트워크에는 SSID라고 하는 고유한 이름이 있습니다. 무선 클라이언트는 무선 액세스 포인트에 연결합니다.

source: FreeBSD Clients
es: Clientes FreeBSD
ko: FreeBSD 클라이언트

source: How to Find Access Points
es: Cómo Encontrar Puntos de Acceso
ko: 액세스 포인트 찾는 방법

source: To scan for available networks, use man:ifconfig[8]. This request may take a few moments to complete as it requires the system to switch to each available wireless frequency and probe for available access points. Only the superuser can initiate a scan:
es: Para escanear redes disponibles, usa man:ifconfig[8]. Esta petición puede tardar un poco en completarse ya que requiere que el sistema cambie para cada una de las frecuencias inalámbricas disponibles y escanee puntos de acceso disponibles. Sólo el super usuario puede iniciar un escaneo:
ko: 사용 가능한 네트워크를 검색하려면 man:ifconfig[8]를 사용합니다. 이 요청은 시스템이 사용 가능한 각 무선 주파수로 전환하여 사용 가능한 액세스 포인트를 검색해야 하므로 완료하는 데 몇 분 정도 걸릴 수 있습니다. 수퍼유저만 스캔을 시작할 수 있습니다:

source: The interface must be `up` before it can scan. Subsequent scan requests do not require the interface to be marked as up again.
es: El interfaz debe estar levantado (`up`) para poder escanear. Escaneos subsiguientes no necesitan que la interfaz se levante de nuevo.
ko: 스캔하려면 인터페이스가 `up`상태여야 합니다. 이후 스캔 요청 시 인터페이스를 다시 `up`으로 표시할 필요가 없습니다.

source: The output of a scan request lists each BSS/IBSS network found. Besides listing the name of the network, the `SSID`, the output also shows the `BSSID`, which is the MAC address of the access point. The `CAPS` field identifies the type of each network and the capabilities of the stations operating there (see the definition of `list scan` in man:ifconfig[8] for more details).
es: La salida de una petición de escaneo lista cada red BSS/IBSS encontrada. Además de listar el nombre de la red, el `SSID`, la salida también muestra el `BSSID`, que es la dirección MAC del punto de acceso. El campo `CAPS` identifica el tipo de cada red y las capacidades de las estaciones de operación (consulta la definición de `list scan` en man:ifconfig[8] para más detalles).
ko: 스캔 요청의 출력에는 발견된 각 BSS/IBSS 네트워크가 나열됩니다. 출력에는 네트워크 이름인 `SSID` 외에도 액세스 포인트의 MAC 주소인 `BSSID`도 표시됩니다. `CAPS` 필드는 각 네트워크의 유형과 해당 네트워크에서 작동하는 스테이션의 기능을 식별합니다(자세한 내용은 man:ifconfig[8]에서 `list scan`의 정의를 참조하세요).

source: One can also display the current list of known networks with:
es: También se puede mostrar la lista actual de redes conocidas con:
ko: 알려진 네트워크의 현재 목록을 표시할 수도 있습니다:

source: This information may be updated automatically by the adapter or manually with a `scan` request. Old data is automatically removed from the cache, so over time this list may shrink unless more scans are done.
es: La información puede ser actualizada automáticamente por el adaptador o de forma manual con una petición `scan`. Los datos antiguos se eliminan automáticamente de la caché, de forma que con el tiempo esta lista se hace más pequeña a menos que se hagan más escaneos.
ko: 이 정보는 어댑터에 의해 자동으로 업데이트되거나 `scan` 요청을 통해 수동으로 업데이트될 수 있습니다. 오래된 데이터는 캐시에서 자동으로 제거되므로 시간이 지남에 따라 더 많은 스캔을 수행하지 않으면 이 목록이 줄어들 수 있습니다.

source: Basic Settings
es: Configuración Básica
ko: 기본 설정
ru: Основные настройки

source: This section provides a simple example of how to make the wireless network adapter work in FreeBSD without encryption. Once familiar with these concepts, it is strongly recommend to use <<network-wireless-wpa,WPA>> to set up the wireless network.
es: Esta sección proporciona un ejemplo sencillo de cómo hacer que un adaptador de red inalámbrico funcione en FreeBSD sin encriptación. Una vez familiarizados con estos conceptos, se recomienda encarecidamente usar <<network-wireless-wpa,WPA>> para configurar la red inalámbrica.
ko: 이 섹션에서는 암호화 없이 FreeBSD에서 무선 네트워크 어댑터를 작동시키는 방법에 대한 간단한 예를 제공합니다. 이러한 개념에 익숙해지면, <<network-wireless-wpa,WPA>>를 사용하여 무선 네트워크를 설정할 것을 강력히 권장합니다.

source: There are three basic steps to configure a wireless network: select an access point, authenticate the station, and configure an IP address. The following sections discuss each step.
es: Hay tres pasos básicos para configurar una red inalámbrica: seleccionar el punto de acceso, autenticar la estación, y configurar una dirección IP. Las secciones siguientes discuten cada uno de los pasos.
ko: 무선 네트워크를 구성하는 데는 액세스 포인트 선택, 스테이션 인증, IP 주소 구성의 세 가지 기본 단계가 있습니다. 다음 섹션에서는 각 단계에 대해 설명합니다.

source: ====== Selecting an Access Point
es: ====== Seleccionar un Punto de Acceso
ko: ====== 액세스 포인트 선택하기
