Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: The `identity` field contains the identity string for EAP.
es: El campo `identity` contiene la cadena de identidad para EAP.
ko: `identity` 필드에는 EAP의 ID 문자열이 포함됩니다.
ru: Поле `identity` содержит строку идентификации для EAP.

source: The `ca_cert` field indicates the pathname of the CA certificate file. This file is needed to verify the server certificate.
es: El campo `ca_cert` indica la ruta al fichero del certificado de CA. Este fichero es necesario para verificar el certificado de servidor.
ko: `ca_cert` 필드는 CA 인증서 파일의 경로명을 나타냅니다. 이 파일은 서버 인증서를 확인하는 데 필요합니다.
ru: Поле `ca_cert` указывает путь к файлу сертификата CA. Этот файл необходим для проверки сертификата сервера.

source: The `client_cert` line gives the pathname to the client certificate file. This certificate is unique to each wireless client of the network.
es: La línea `cliente_cert` da la ruta al fichero de certificado del cliente. Este certificado es único para cada cliente inalámbrico de la red.
ko: `client_cert` 줄은 클라이언트 인증서 파일의 경로명을 제공합니다. 이 인증서는 네트워크의 각 무선 클라이언트마다 고유합니다.
ru: Строка `client_cert` указывает путь к файлу сертификата клиента. Этот сертификат уникален для каждого беспроводного клиента в сети.

source: The `private_key` field is the pathname to the client certificate private key file.
es: El campo `private_key` es la ruta al fichero de clave privada del certificado del cliente.
ko: `private_key 필드는 클라이언트 인증서 개인 키 파일의 경로 이름입니다.
ru: Поле `private_key` содержит путь к файлу закрытого ключа клиентского сертификата.

source: The `private_key_passwd` field contains the passphrase for the private key.
es: El campo `private_key_passwd` contienen la contraseña para la clave privada.
ko: `private_key_passwd` 필드에는 개인키의 비밀번호가 입력됩니다.
ru: Поле `private_key_passwd` содержит парольную фразу для закрытого ключа.

source: Then, add the following lines to [.filename]#/etc/rc.conf#:
es: Después, añade las siguientes líneas a [.filename]#/etc/rc.conf#:
ko: 다음으로, [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:
ru: Затем добавьте следующие строки в [.filename]#/etc/rc.conf#:

source: The next step is to bring up the interface:
es: El siguiente paso es levantar la interfaz:
ko: 다음 단계는 인터페이스를 불러오는 것입니다:
ru: Следующий шаг — поднять интерфейс:

source: It is also possible to bring up the interface manually using man:wpa_supplicant[8] and man:ifconfig[8].
es: También es posible levantar la interfaz manualmente utilizando man:wpa_supplicant[8] y man:ifconfig[8].
ko: man:wpa_supplicant[8] 및 man:ifconfig[8]를 사용하여 수동으로 인터페이스를 불러올 수도 있습니다.
ru: Также можно поднять интерфейс вручную с помощью man:wpa_supplicant[8] и man:ifconfig[8].

source: ====== WPA with EAP-TTLS
es: ====== WPA con EAP-TTLS
ko: ====== EAP-TTLS를 사용한 WPA

source: With EAP-TLS, both the authentication server and the client need a certificate. With EAP-TTLS, a client certificate is optional. This method is similar to a web server which creates a secure SSL tunnel even if visitors do not have client-side certificates. EAP-TTLS uses an encrypted TLS tunnel for safe transport of the authentication data.
es: Con EAP-TLS, tanto la autenticación de servidor como la de cliente necesitan un certificado. Con EAP-TTLS, el certificado de cliente es opcional. Este método es similar a un servidor web que crea un tunel SSL seguro incluso cuando los visitantes no tienen certificados de cliente. EAP-TTLS utiliza un túnel encriptado con TLS para el transporte seguro de los datos de autenticación.
ko: EAP-TLS를 사용하면 인증 서버와 클라이언트 모두 인증서가 필요합니다. EAP-TTLS를 사용하면 클라이언트 인증서는 선택 사항입니다. 이 방법은 방문자에게 클라이언트 측 인증서가 없는 경우에도 안전한 SSL 터널을 생성하는 웹 서버와 유사합니다. EAP-TTLS는 인증 데이터의 안전한 전송을 위해 암호화된 TLS 터널을 사용합니다.
ru: С EAP-TLS и сервер аутентификации, и клиент нуждаются в сертификате. С EAP-TTLS сертификат клиента необязателен. Этот метод аналогичен веб-серверу, который создает защищенный SSL-туннель, даже если у посетителей нет клиентских сертификатов. EAP-TTLS использует зашифрованный TLS-туннель для безопасной передачи данных аутентификации.

source: The required configuration can be added to [.filename]#/etc/wpa_supplicant.conf#:
es: La configuración necesaria se puede añadir a [.filename]#/etc/wpa_supplicant.conf#:
ko: 필요한 구성은 [.filename]#/etc/wpa_supplicant.conf#에 추가할 수 있습니다:
ru: Требуемая конфигурация может быть добавлена в [.filename]#/etc/wpa_supplicant.conf#:

source: This field specifies the EAP method for the connection.
es: Este campo especifica el método EAP para la conexión.
ko: 이 필드는 EAP에 대한 연결방법을 지정합니다.
ru: Это поле определяет метод EAP для подключения.

source: The `identity` field contains the identity string for EAP authentication inside the encrypted TLS tunnel.
es: El campo `identity` contiene la cadena de identidad para la autenticación EAP dentro del túnel encriptado con TLS.
ko: `identity` 필드에는 암호화된 TLS 터널 내부의 EAP 인증을 위한 ID 문자열이 포함되어 있습니다.
ru: Поле `identity` содержит строку идентификации для аутентификации EAP внутри зашифрованного TLS-туннеля.

source: The `password` field contains the passphrase for the EAP authentication.
es: El campo `password` contiene la contraseña para la autenticación EAP.
ko: `password` 필드에는 EAP 인증을 위한 비밀번호가 입력됩니다.
ru: Поле `password` содержит парольную фразу для аутентификации EAP.

source: This field specifies the authentication method used in the encrypted TLS tunnel. In this example, EAP with MD5-Challenge is used. The "inner authentication" phase is often called "phase2".
es: Este campo especifica el método de autenticación usado en el túnel TLS encriptado. En este ejemplo, se utiliza EAP con MD5-Challenge. La fase de "autenticación interna" se llama habitualmente "phase2".
ko: 이 필드는 암호화된 TLS 터널에 사용되는 인증 방법을 지정합니다. 이 예에서는 MD5-Challenge가 포함된 EAP가 사용됩니다. "내부 인증(inner authentication)" 단계는 종종 "2 단계(phase 2)"라고 합니다.
ru: Это поле определяет метод аутентификации, используемый в зашифрованном TLS-туннеле. В данном примере используется EAP с MD5-Challenge. Фаза "внутренней аутентификации" часто называется "phase2".

source: Next, add the following lines to [.filename]#/etc/rc.conf#:
es: Después, añade las siguientes líneas a [.filename]#/etc/rc.conf#:
ko: 그런 다음 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:
ru: Далее добавьте следующие строки в [.filename]#/etc/rc.conf#:

source: ====== WPA with EAP-PEAP
es: ====== WPA con EAP-PEAP
ko: ====== EAP-PEAP를 사용한 WPA

source: PEAPv0/EAP-MSCHAPv2 is the most common PEAP method. In this chapter, the term PEAP is used to refer to that method.
es: PEAPv0/EAP-MSCHAPv2 es el método PEAP más común. En este capítulo, el término PEAP se usa para referirnos a ese método.
ko: PEAPv0/EAP-MSCHAPv2는 가장 일반적인 PEAP 방법입니다. 이 장에서는 PEAP라는 용어를 사용하여 해당 방법을 지칭합니다.
ru: PEAPv0/EAP-MSCHAPv2 является наиболее распространенным методом PEAP. В этой главе термин PEAP используется для обозначения данного метода.

source: Protected EAP (PEAP) is designed as an alternative to EAP-TTLS and is the most used EAP standard after EAP-TLS. In a network with mixed operating systems, PEAP should be the most supported standard after EAP-TLS.
es: Protected EAP (PEAP) se diseñó como una alternativa a EAP-TTLS y es el segundo estándar EAP más usado por detrás de EAP-TLS. En una red con sistemas operativos variados, PEAP debería ser el estándar más soportado por detrás de EAP-TLS.
ko: PEAP(Protected EAP)은 EAP-TTLS의 대안으로 설계되었으며 EAP-TLS 다음으로 가장 많이 사용되는 EAP 표준입니다. 운영 체제가 혼합된 네트워크에서는 PEAP이 EAP-TLS 다음으로 가장 많이 지원되는 표준이어야 합니다.
ru: Защищенный EAP (PEAP) разработан как альтернатива EAP-TTLS и является наиболее используемым стандартом EAP после EAP-TLS. В сети с разными операционными системами PEAP должен быть наиболее поддерживаемым стандартом после EAP-TLS.

source: PEAP is similar to EAP-TTLS as it uses a server-side certificate to authenticate clients by creating an encrypted TLS tunnel between the client and the authentication server, which protects the ensuing exchange of authentication information. PEAP authentication differs from EAP-TTLS as it broadcasts the username in the clear and only the password is sent in the encrypted TLS tunnel. EAP-TTLS will use the TLS tunnel for both the username and password.
es: PEAP es similar a EAP-TTLS ya que utiliza un certificado de servidor para autenticar clientes mediante la creación de un túnel TLS encriptado entre el cliente y el servidor de autenticación, el cual protege el subsiguiente intercambio de información de autenticación. La autenticación PEAP es diferente de EAP-TTLS ya que emite el usuario sin encriptar y sólo la contraseña se envía por el túnel TLS encriptado. EAP-TTLS utilizará el túnel TLS tanto para el nombre de usuario como para la contraseña.
ko: PEAP은 서버 측 인증서를 사용하여 클라이언트와 인증 서버 사이에 암호화된 TLS 터널을 생성하여 클라이언트를 인증하고, 이후 인증 정보 교환을 보호한다는 점에서 EAP-TTLS와 유사합니다. PEAP 인증은 사용자 이름을 그대로 브로드캐스트하고 암호화된 TLS 터널에서 비밀번호만 전송한다는 점에서 EAP-TTLS와 다릅니다. EAP-TTLS는 사용자 이름과 비밀번호 모두에 TLS 터널을 사용합니다.
ru: PEAP аналогичен EAP-TTLS, так как использует сертификат на стороне сервера для аутентификации клиентов путем создания зашифрованного TLS-туннеля между клиентом и сервером аутентификации, что защищает последующий обмен аутентификационной информацией. Аутентификация PEAP отличается от EAP-TTLS тем, что передает имя пользователя в открытом виде, и только пароль отправляется в зашифрованном TLS-туннеле. EAP-TTLS использует TLS-туннель как для имени пользователя, так и для пароля.

source: Add the following lines to [.filename]#/etc/wpa_supplicant.conf# to configure the EAP-PEAP related settings:
es: Añade las siguientes líneas a [.filename]#/etc/wpa_supplicant.conf# para configurar los parámetros relacionados con EAP-PEAP:
ko: [.filename]#/etc/wpa_supplicant.conf#에 다음 줄을 추가하여 EAP-PEAP 관련 설정을 구성합니다:
ru: Добавьте следующие строки в [.filename]#/etc/wpa_supplicant.conf# для настройки параметров, связанных с EAP-PEAP:

source: This field contains the parameters for the first phase of authentication, the TLS tunnel. According to the authentication server used, specify a specific label for authentication. Most of the time, the label will be "client EAP encryption" which is set by using `peaplabel=0`. More information can be found in man:wpa_supplicant.conf[5].
es: Este campo contiene los parámetros para la primera fase de autenticación, el túnel TLS. Según el servidor de autenticación utilizado, especifica una etiqueta concreta para la autenticación. La mayoría de las veces la etiqueta será "cliente EAP encryption" que se establece usando `peaplabel=0`. Se puede encontrar más información en man:wpa_supplicant.confg[5].
ko: 이 필드에는 인증의 첫 번째 단계인 TLS 터널에 대한 매개변수가 포함되어 있습니다. 사용하는 인증 서버에 따라 인증에 사용할 특정 레이블을 지정합니다. 대부분의 경우 레이블은 `peaplabel=0`을 사용하여 설정하는 "client EAP encryption"이 됩니다. 자세한 내용은 man:wpa_supplicant.conf[5]에서 확인할 수 있습니다.
ru: Это поле содержит параметры для первой фазы аутентификации, TLS-туннеля. В зависимости от используемого сервера аутентификации укажите конкретную метку для аутентификации. В большинстве случаев меткой будет "client EAP encryption", которая устанавливается с помощью `peaplabel=0`. Дополнительную информацию можно найти в man:wpa_supplicant.conf[5].

source: This field specifies the authentication protocol used in the encrypted TLS tunnel. In the case of PEAP, it is `auth=MSCHAPV2`.
es: Este campo especifica el protocolo de autenticación utilizado en el túnel encriptado con TLS. En el caso de PEAP, es `auth=MSCHAPV2`.
ko: 이 필드는 암호화된 TLS 터널에서 사용되는 인증 프로토콜을 지정합니다. PEAP의 경우 `auth=MSCHAPV2`입니다.
ru: Это поле определяет протокол аутентификации, используемый в зашифрованном TLS-туннеле. В случае PEAP, это `auth=MSCHAPV2`.

source: Add the following to [.filename]#/etc/rc.conf#:
es: Añade lo siguiente a [.filename]#/etc/rc.conf#:
ko: [.filename]#/etc/rc.conf#에 다음을 추가합니다:
ru: Добавьте следующее в [.filename]#/etc/rc.conf#:

source: Wired Equivalent Privacy (WEP) is part of the original 802.11 standard. There is no authentication mechanism, only a weak form of access control which is easily cracked.
es: Wired Equivalent Privacy (WEP) es parte del estándar 802.11 original. No hay mecanismo de autenticación, sólo una débil forma de control de acceso que se rompe fácilmente.
ko: WEP(Wired Equivalent Privacy)는 원래 802.11 표준의 일부입니다. 인증 메커니즘이 없으며, 쉽게 뚫릴 수 있는 약한 형태의 액세스 제어만 있습니다.

source: WEP can be set up using man:ifconfig[8]:
es: Se puede configurar WEP usando man:ifconfig[8]:
ko: WEP는 man:ifconfig[8]를 사용하여 설정할 수 있습니다:

source: The `weptxkey` specifies which WEP key will be used in the transmission. This example uses the third key. This must match the setting on the access point. When unsure which key is used by the access point, try `1` (the first key) for this value.
es: `weptxkey` especifica qué clave WEP se usará en la transmisión. Este ejemplo utiliza la tercera clave. Esto debe concordar con la configuración del punto de acceso. Cuando no estés seguro de qué clave utiliza el punto de acceso, utiliza `1` (la primera clave) para este valor.
ko: `weptxkey`는 전송에 사용할 WEP 키를 지정합니다. 이 예에서는 세 번째 키를 사용합니다. 이 키는 액세스 포인트의 설정과 일치해야 합니다. 액세스 포인트에서 어떤 키를 사용하는지 확실하지 않은 경우 이 값에 `1`(첫 번째 키)을 사용해 보십시오.

source: The `wepkey` selects one of the WEP keys. It should be in the format _index:key_. Key `1` is used by default; the index only needs to be set when using a key other than the first key.
es: `wepkey` selecciona una de las claves WEP. Debería seguir el formato _index:key_. La clave `1` se utiliza por defecto; sólo se necesita especificar el índice cuando se usa otra clave que no sea la primera.
ko: `wepkey`는 WEP 키 중 하나를 선택합니다. 색인은 _index:key_ 형식이어야 합니다. 기본적으로 `1` 키가 사용되며, 첫 번째 키가 아닌 다른 키를 사용할 때만 인덱스를 설정하면 됩니다.

source: Replace the `0x3456789012` with the key configured for use on the access point.
es: Remplaza `0x3456789012` con la clave configurada para ser usada en el punto de acceso.
ko: `0x3456789012`를 액세스 포인트에서 사용하도록 구성된 키로 바꿉니다.

source: Refer to man:ifconfig[8] for further information.
es: Consulta man:ifconfig[8] para más información.
ko: 자세한 내용은 man:ifconfig[8]을 참조하세요.

source: The man:wpa_supplicant[8] facility can be used to configure a wireless interface with WEP. The example above can be set up by adding the following lines to [.filename]#/etc/wpa_supplicant.conf#:
es: La utilidad man:wpa_suppliccant[8] se puede usar para configurar una interfaz inalámbrica con WEP. El ejemplo de arriba se puede modificar añadiendo las siguientes líneas a [.filename]#/etc/wpa_supplicant.conf#:
ko: man:wpa_supplicant[8] 기능을 사용하여 WEP로 무선 인터페이스를 구성할 수 있습니다. 위의 예는 [.filename]#/etc/wpa_supplicant.conf#에 다음 줄을 추가하여 설정할 수 있습니다:

source: Then:
es: Después:
ko: 다음으로:

source: Ad-hoc Mode
es: Modo Ad-hoc
ko: Ad-hoc 모드

source: IBSS mode, also called ad-hoc mode, is designed for point to point connections. For example, to establish an ad-hoc network between the machines `A` and `B`, choose two IP addresses and a SSID.
es: El modo IBSS, también llamado modo ad-hoc, está diseñado para comunicaciones punto a punto. Por ejemplo, para establecer una red ad-hoc entre las máquinas `A` y `B`, escoge dos direcciones IP y un SSID.
ko: ad-hoc 모드라고도 하는 IBSS 모드는 지점 간 연결을 위해 설계되었습니다. 예를 들어, 머신 `A`와 `B` 사이에 ad-hoc 네트워크를 설정하려면 두 개의 IP 주소와 하나의 SSID를 선택합니다.
ru: Режим IBSS, также называемый ad-hoc режимом, предназначен для соединений точка-точка. Например, чтобы создать ad-hoc сеть между машинами `A` и `B`, выберите два IP-адреса и SSID.

source: On `A`:
es: En `A`:
ko: `A`에서:
ru: На `A`:

source: The `adhoc` parameter indicates that the interface is running in IBSS mode.
es: El parámetro `ad-hoc` indica que el interfaz está funcionando en modo IBSS.
ko: `adhoc` 매개 변수는 인터페이스가 IBSS 모드에서 실행 중임을 나타냅니다.
ru: Параметр `adhoc` указывает, что интерфейс работает в режиме IBSS.

source: `B` should now be able to detect `A`:
es: Ahora `B` debería ser capaz de detecta a `A`:
ko: 이제 `B`는 `A`를 감지할 수 있어야 합니다:
ru: `B` теперь должен иметь возможность обнаруживать `A`:

source: The `I` in the output confirms that `A` is in ad-hoc mode. Now, configure `B` with a different IP address:
es: La `I` en la salida confirma que `A` está en modo ad-hoc. Ahora, configura `B` con una dirección IP diferente:
ko: 출력의 `I`는 `A`가 ad-hoc 모드에 있음을 확인합니다. 이제 `B`를 다른 IP 주소로 구성합니다:
ru: `I` в выводе подтверждает, что `A` находится в режиме ad-hoc. Теперь настройте `B` с другим IP-адресом:

source: Both `A` and `B` are now ready to exchange information.
es: Ahora `A` y `B` están listas para intercambiar información.
ko: 이제 `A`와 `B` 모두 정보를 교환할 준비가 되었습니다.
ru: Оба `A` и `B` теперь готовы обмениваться информацией.

source: FreeBSD Host Access Points
es: Puntos de Acceso Host FreeBSD
ko: FreeBSD 호스트 액세스 포인트
ru: Хост FreeBSD в роли точки доступа

source: FreeBSD can act as an Access Point (AP) which eliminates the need to buy a hardware AP or run an ad-hoc network. This can be particularly useful when a FreeBSD machine is acting as a gateway to another network such as the Internet.
es: FreeBSD puede actuar como un Punto de Acceso (AP) lo que elimina la necesidad de comparar un hardware AP o montar una red ad-hoc. Esto puede ser particularmente útil cuando una máquina FreeBSD está actuando como gateway a otra red como Internet.
ko: FreeBSD는 하드웨어 AP를 구입하거나 ad-hoc 네트워크를 실행할 필요 없이 액세스 포인트(AP) 역할을 할 수 있습니다. 이는 FreeBSD 머신이 인터넷과 같은 다른 네트워크의 게이트웨이 역할을 할 때 특히 유용할 수 있습니다.
ru: FreeBSD может функционировать как точка доступа (AP), что устраняет необходимость покупки аппаратной точки доступа или организации ad-hoc сети. Это может быть особенно полезно, когда машина FreeBSD выступает в качестве шлюза к другой сети, например, к Интернету.

source: Before configuring a FreeBSD machine as an AP, the kernel must be configured with the appropriate networking support for the wireless card as well as the security protocols being used. For more details, see <<network-wireless-basic>>.
es: Antes de configurar una máquina FreeBSD como un AP, el kernel se tiene que configurar con el soporte de red apropiado para la tarjeta inalámbrica así como con los protocolos de seguridad que se utilizarán. Para más detalles, consulta <<network-wireless-basic>>.
ko: FreeBSD 머신을 AP로 구성하기 전에, 커널은 무선 카드에 대한 적절한 네트워킹 지원과 사용 중인 보안 프로토콜로 구성해야 합니다. 자세한 내용은 <<network-wireless-basic>>을 참조하십시오.

source: The NDIS driver wrapper for Windows(R) drivers does not currently support AP operation. Only native FreeBSD wireless drivers support AP mode.
es: El adaptador de controladores NDIS para controladores de Windows(R) actualmente no soporta operar en modo AP. Sólo los controladores inalámbricos nativos de FreeBSD soportan modo AP.
ko: Windows(R) 드라이버용 NDIS 드라이버 래퍼는 현재 AP 작동을 지원하지 않습니다. 네이티브 FreeBSD 무선 드라이버만 AP 모드를 지원합니다.
ru: Драйвер-оболочка NDIS для драйверов Windows(R) в настоящее время не поддерживает работу в режиме точки доступа. Только родные беспроводные драйверы FreeBSD поддерживают режим AP.

source: Once wireless networking support is loaded, check if the wireless device supports the host-based access point mode, also known as hostap mode:
es: Una vez que se ha cargado el soporte para redes inalámbricas, comprueba si el dispositivo inalámbrico soporta el modo de punto de acceso basado en host, también conocido como modo hostap:
ko: 무선 네트워킹 지원이 로드되면 무선 장치가 호스트 기반 액세스 포인트 모드(hostap 모드라고도 함)를 지원하는지 확인합니다:
ru: После загрузки поддержки беспроводной сети проверьте, поддерживает ли беспроводное устройство режим точки доступа на основе хоста, также известный как режим hostap:

source: This output displays the card's capabilities. The `HOSTAP` word confirms that this wireless card can act as an AP. Various supported ciphers are also listed: WEP, TKIP, and AES. This information indicates which security protocols can be used on the AP.
es: Esta salida muestra las capacidades de la tarjeta. La palabra `HOSTAP` confirma que la tarjeta inalámbrica puede actuar como un AP. También se listan varios encriptadores soportados: WEP, TKIP, y AES. Esta información indica qué protocolos de seguridad se pueden utilizar con el AP.
ko: 이 출력은 카드의 기능을 표시합니다. `HOSTAP` 단어는 이 무선 카드가 AP로 작동할 수 있음을 확인합니다. 지원되는 다양한 암호도 나열됩니다: WEP, TKIP 및 AES. 이 정보는 AP에서 사용할 수 있는 보안 프로토콜을 나타냅니다.
ru: Этот вывод показывает возможности карты. Слово `HOSTAP` подтверждает, что эта беспроводная карта может работать как точка доступа. Также перечислены различные поддерживаемые алгоритмы шифрования: WEP, TKIP и AES. Эта информация указывает, какие протоколы безопасности можно использовать на точке доступа.

source: The wireless device can only be put into hostap mode during the creation of the network pseudo-device, so a previously created device must be destroyed first:
es: El dispositivo inalámbrico sólo puede ser puesto en modo hostap durante la creación del pseudo-dispositivo de red, de forma que si hay una dispositivo creado anteriormente se tiene que destruir primero:
ko: 무선 디바이스는 네트워크 의사 디바이스를 생성하는 동안에만 hostap 모드로 전환할 수 있으므로 이전에 생성한 디바이스를 먼저 삭제해야 합니다:
ru: Беспроводное устройство можно перевести в режим hostap только во время создания сетевого псевдоустройства, поэтому ранее созданное устройство необходимо сначала удалить:

source: then regenerated with the correct option before setting the other parameters:
es: después regenerado con la opción correcta antes de establecer otros parámetros:
ko: 그리고 나서 다른 매개변수를 설정하기 전에 올바른 옵션으로 다시 생성합니다:
ru: затем повторно создать с правильной опцией перед установкой остальных параметров:

source: Use man:ifconfig[8] again to see the status of the [.filename]#wlan0# interface:
es: Usa man:ifconfig[8] de nuevo para ver el estado de la interfaz [.filename]#wlan0#:
ko: man:ifconfig[8]을 다시 사용하여 [.filename]#wlan0# 인터페이스의 상태를 확인합니다:
ru: Используйте man:ifconfig[8] снова, чтобы посмотреть состояние интерфейса [.filename]#wlan0#:

source: The `hostap` parameter indicates the interface is running in the host-based access point mode.
es: El parámetro `hostap` indica que el interfaz está funcionando en modo punto de acceso basado en host.
ko: `hostap` 매개 변수는 인터페이스가 호스트 기반 액세스 포인트 모드에서 실행 중임을 나타냅니다.
ru: Параметр `hostap` указывает, что интерфейс работает в режиме точки доступа на основе хоста.

source: The interface configuration can be done automatically at boot time by adding the following lines to [.filename]#/etc/rc.conf#:
es: La configuración del interfaz se puede hacer de forma automática al arrancar añadiendo las siguientes líneas a [.filename]#/etc/rc.conf#:
ko: 인터페이스 구성은 [.filename]#/etc/rc.conf#에 다음 줄을 추가하여 부팅 시 자동으로 수행할 수 있습니다:
ru: Настройка интерфейса может быть выполнена автоматически при загрузке, если добавить следующие строки в [.filename]#/etc/rc.conf#:

source: Host-based Access Point Without Authentication or Encryption
es: Punto de Acceso basado en Host Sin Autenticación o Encriptación
ko: 인증 또는 암호화가 없는 호스트 기반 액세스 포인트
ru: Точка доступа на основе хоста без аутентификации или шифрования

source: Although it is not recommended to run an AP without any authentication or encryption, this is a simple way to check if the AP is working. This configuration is also important for debugging client issues.
es: Aunque no se recomienda ejecutar un AP sin ninguna autenticación o encriptación, es una forma simple de comprobar que el AP funciona. Esta configuración también es importante para depurar problemas en el cliente.
ko: 인증이나 암호화 없이 AP를 실행하는 것은 권장하지 않지만, AP가 작동하는지 간단하게 확인할 수 있는 방법입니다. 이 구성은 클라이언트 문제를 디버깅하는 데에도 중요합니다.
ru: Хотя не рекомендуется запускать точку доступа без какой-либо аутентификации или шифрования, это простой способ проверить, работает ли точка доступа. Такая конфигурация также важна для отладки проблем с клиентами.

source: Once the AP is configured, initiate a scan from another wireless machine to find the AP:
es: Una vez que el AP está configurado, inicia un escaneo desde otra máquina inalámbrica para encontrar el AP:
ko: AP가 구성되면 다른 무선 기기에서 스캔을 시작하여 AP를 찾습니다:
ru: После настройки точки доступа выполните сканирование с другого беспроводного устройства для её обнаружения:
