Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: The Bluetooth stack in FreeBSD is implemented using the man:netgraph[4] framework. A broad variety of Bluetooth USB dongles is supported by man:ng_ubt[4]. Broadcom BCM2033 based Bluetooth devices are supported by the man:ubtbcmfw[4] and man:ng_ubt[4] drivers. The 3Com Bluetooth PC Card 3CRWB60-A is supported by the man:ng_bt3c[4] driver. Serial and UART based Bluetooth devices are supported by man:sio[4], man:ng_h4[4], and man:hcseriald[8].
es: La pila Bluetooth en FreeBSD está implementada utilizando el framework man:netgraph[4]. Una gran variedad de conectores USB Bluetooth se soporta con man:ng_ubt[4]. Los dispositivos Bluetooth basados en Broadcom BCM2033 se soportan mediante los controladores man:ubtbcmfw[4] y man:ng_ubt[4]. La tarjeta 3Com Bluetooth PC Card 3CRWB60-A está soportada por el controlador man:ng_bt3c[4]. Los dispositivos serie y UART Bluetooth están soportados por man:sio[4], man:ng_h4[4], y man:hcseriald[8].
ko: FreeBSD의 블루투스 스택은 man:netgraph[4] 프레임워크를 사용하여 구현됩니다. 다양한 블루투스 USB 동글은 man:ng_ubt[4]에 의해 지원됩니다. 브로드컴 BCM2033 기반 블루투스 장치는 man:ubtbcmfw[4] 및 man:ng_ubt[4] 드라이버에 의해 지원됩니다. 3Com Bluetooth PC 카드 3CRWB60-A는 man:ng_bt3c[4] 드라이버에 의해 지원됩니다. 직렬 및 UART 기반 블루투스 장치는 man:sio[4], man:ng_h4[4], man:hcseriald[8]에서 지원됩니다.
ru: Стек Bluetooth в FreeBSD реализован с использованием фреймворка man:netgraph[4]. Широкий спектр Bluetooth USB-адаптеров поддерживается драйвером man:ng_ubt[4]. Устройства Bluetooth на базе Broadcom BCM2033 поддерживаются драйверами man:ubtbcmfw[4] и man:ng_ubt[4]. Карта Bluetooth PC Card 3CRWB60-A от 3Com поддерживается драйвером man:ng_bt3c[4]. Bluetooth-устройства на основе последовательного порта и UART поддерживаются драйверами man:sio[4], man:ng_h4[4] и утилитой man:hcseriald[8].

source: Before attaching a device, determine which of the above drivers it uses, then load the driver. For example, if the device uses the man:ng_ubt[4] driver:
es: Antes de conectar un dispositivo, determina cuál de los controladores anteriores utiliza, después carga el controlador. Por ejemplo, si el dispositivo utiliza el controlador man:ng_ubt[4]:
ko: 장치를 연결하기 전에 위의 드라이버 중 어떤 드라이버를 사용하는지 확인한 다음 해당 드라이버를 로드합니다. 예를 들어 장치가 man:ng_ubt[4] 드라이버를 사용하는 경우:
ru: Прежде чем подключить устройство, определите, какой из вышеуказанных драйверов оно использует, затем загрузите драйвер. Например, если устройство использует драйвер man:ng_ubt[4]:

source: If the Bluetooth device will be attached to the system during system startup, the system can be configured to load the module at boot time by adding the driver to [.filename]#/boot/loader.conf#:
es: Si el dispositivo Bluetooth se va a conectar al sistema durante el arranque, éste se puede configurar para cargar el módulo durante el arranque añadiendo el controlador a [.filename]#/boot/loader.conf#:
ko: 시스템 시작 시 Bluetooth 장치가 시스템에 연결되는 경우, [.filename]#/boot/loader.conf#에 드라이버를 추가하여 부팅 시 모듈을 로드하도록 시스템을 구성할 수 있습니다:
ru: Если устройство Bluetooth будет подключено к системе во время её загрузки, можно настроить систему на автоматическую загрузку модуля, добавив драйвер в [.filename]#/boot/loader.conf#:

source: Once the driver is loaded, plug in the USB dongle. If the driver load was successful, output similar to the following should appear on the console and in [.filename]#/var/log/messages#:
es: Una vez que el controlador está cargado, conecta el dispositivo USB. Si el controlador se cargó de forma correcta, en la consola y en [.filename]#/var/log/messages# debería aparecer una salida similar a la siguiente:
ko: 드라이버가 로드되면 USB 동글을 연결합니다. 드라이버 로드에 성공하면 콘솔과 [.filename]#/var/log/messages#에 다음과 유사한 출력이 나타납니다:
ru: После загрузки драйвера подключите USB-адаптер. Если загрузка драйвера прошла успешно, на консоли и в [.filename]#/var/log/messages# появится вывод, похожий на следующий:

source: To start and stop the Bluetooth stack, use its startup script. It is a good idea to stop the stack before unplugging the device. Starting the bluetooth stack might require man:hcsecd[8] to be started. When starting the stack, the output should be similar to the following:
es: Para iniciar y parar la pila Bluetooth, utiliza su script de arranque. Es una buena idea parar la pila después de desconectar el dispositivo. Arrancar la pila bluetooth podría necesitar que se arranque man:hcsecd[8]. Cuando se arranca la pila, la salida debería ser similar a la siguiente:
ko: Bluetooth 스택을 시작 및 중지하려면 시작 스크립트를 사용합니다. 장치의 플러그를 뽑기 전에 스택을 중지하는 것이 좋습니다. 블루투스 스택을 시작하려면 man:hcsecd[8]를 시작해야 할 수 있습니다. 스택을 시작할 때 출력은 다음과 비슷해야 합니다:
ru: Для запуска и остановки стека Bluetooth используйте его стартовый скрипт. Рекомендуется остановить стек перед отключением устройства. Запуск стека Bluetooth может потребовать запуска man:hcsecd[8]. При запуске стека вывод должен быть похож на следующий:

source: Finding Other Bluetooth Devices
es: Encontrando Otros Dispositivos Bluetooth
ko: 다른 Bluetooth 장치 찾기
ru: Поиск других устройств Bluetooth

source: The Host Controller Interface (HCI) provides a uniform method for accessing Bluetooth baseband capabilities. In FreeBSD, a netgraph HCI node is created for each Bluetooth device. For more details, refer to man:ng_hci[4].
es: El Host Controller Interface (HCI) proporciona un método uniforme para acceder a las capacidades de la banda base de Bluetooth. En FreeBSD, se crea un nodo HCI de netgraph para cada dispositivo Bluetooth. Para más detalles, consulta man:ng_hci[4].
ko: 호스트 컨트롤러 인터페이스(HCI)는 블루투스 베이스밴드 기능에 액세스하기 위한 통일된 방법을 제공합니다. FreeBSD에서는 각 블루투스 장치에 대해 netgraph HCI 노드가 생성됩니다. 자세한 내용은 man:ng_hci[4]를 참조하십시오.
ru: Интерфейс Host Controller Interface (HCI) предоставляет единый метод доступа к базовым возможностям Bluetooth. В FreeBSD узел netgraph HCI создается для каждого устройства Bluetooth. Подробнее см. man:ng_hci[4].

source: One of the most common tasks is discovery of Bluetooth devices within RF proximity. This operation is called _inquiry_. Inquiry and other HCI related operations are done using man:hccontrol[8]. The example below shows how to find out which Bluetooth devices are in range. The list of devices should be displayed in a few seconds. Note that a remote device will only answer the inquiry if it is set to _discoverable_ mode.
es: Una de las tareas más comunes es el descubrimiento de dispositivos Bluetooth dentro del rango de proximidad de RF. Esta operación se llama _inquiry_ (pregunta). Inquiry y otras operaciones HCI relacionadas se ejecutan con man:hccontrol[8]. El ejemplo de abajo muestra cómo encontrar dispositivos Bluetooth que están dentro de rango. La lista de dispositivos debería mostrarse en unos pocos segundos. Ten en cuenta que un dispositivo remoto sólo contestará a la pregunta si está en modo _descubrible_.
ko: 가장 일반적인 작업 중 하나는 RF 근접 거리 내에서 Bluetooth 장치를 검색하는 것입니다. 이 작업을 _inquiry_라고 합니다. 조회 및 기타 HCI 관련 작업은 man:hccontrol[8]을 사용하여 수행됩니다. 아래 예는 범위 내에 있는 블루투스 장치를 찾는 방법을 보여줍니다. 몇 초 후에 장치 목록이 표시됩니다. 원격 장치가 _discoverable_ 모드로 설정된 경우에만 문의에 응답한다는 점에 유의하세요.
ru: Одной из наиболее распространённых задач является обнаружение Bluetooth-устройств в радиусе действия. Эта операция называется _ сканирование (inquiry)_. Запрос и другие операции, связанные с HCI, выполняются с помощью man:hccontrol[8]. В приведённом ниже примере показано, как выяснить, какие Bluetooth-устройства находятся в зоне действия. Список устройств должен отобразиться через несколько секунд. Обратите внимание, что удалённое устройство ответит на запрос только в том случае, если оно находится в режиме _ обнаруживаемое (discoverable)_.

source: The `BD_ADDR` is the unique address of a Bluetooth device, similar to the MAC address of a network card. This address is needed for further communication with a device and it is possible to assign a human readable name to a `BD_ADDR`. Information regarding the known Bluetooth hosts is contained in [.filename]#/etc/bluetooth/hosts#. The following example shows how to obtain the human readable name that was assigned to the remote device:
es: `BD_ADDR` es la dirección única de un dispositivo Bluetooth, similar a la dirección MAC de una tarjeta de red. Esta dirección es necesaria para la comunicación posterior con el dispositivo y es posible asignarle un valor que se amigable de leer. Hay información acerca de los hosts Bluetooth conocidos en [.filename]#/etc/bluetooth/hosts#. El siguiente ejemplo muestra cómo obtener un nombre legible por las personas que ha sido asignado a un dispositivo remoto:
ko: `BD_ADDR`은 네트워크 카드의 MAC 주소와 유사한 블루투스 장치의 고유 주소입니다. 이 주소는 장치와의 추가 통신에 필요하며 사람이 읽을 수 있는 이름을 `BD_ADDR`에 할당할 수 있습니다. 알려진 블루투스 호스트에 관한 정보는 [.filename]#/etc/bluetooth/hosts#에 포함되어 있습니다. 다음 예는 원격 장치에 할당된 사람이 읽을 수 있는 이름을 얻는 방법을 보여줍니다:
ru: `BD_ADDR` — это уникальный адрес Bluetooth-устройства, аналогичный MAC-адресу сетевой карты. Этот адрес необходим для дальнейшего взаимодействия с устройством, и ему можно присвоить удобочитаемое имя. Информация об известных Bluetooth-хостах содержится в файле [.filename]#/etc/bluetooth/hosts#. В следующем примере показано, как получить удобочитаемое имя, присвоенное удалённому устройству:

source: If an inquiry is performed on a remote Bluetooth device, it will find the computer as "your.host.name (ubt0)". The name assigned to the local device can be changed at any time.
es: Si se realiza una pregunta a un dispositivo Bluetooth remoto, encontrará tu ordenador como "your.host.name (ubt0)". El nombre asignado al dispositivo local se puede cambiar en cualquier momento.
ko: 원격 Bluetooth 장치에서 조회를 수행하면 해당 컴퓨터가 "your.host.name (ubt0)"으로 검색됩니다. 로컬 장치에 할당된 이름은 언제든지 변경할 수 있습니다.
ru: Если выполняется запрос к удалённому устройству Bluetooth, компьютер будет обнаружен как "your.host.name (ubt0)". Имя, назначенное локальному устройству, можно изменить в любое время.

source: Remote devices can be assigned aliases in [.filename]#/etc/bluetooth/hosts#. More information about [.filename]#/etc/bluetooth/hosts# file might be found in man:bluetooth.hosts[5].
es: Se puede asignar alias a los dispositivos remotos en [.filename]#/etc/bluetooth/hosts#. Se puede encontrar más información acerca de [.filename]#/etc/bluetooth/hosts# en man:bluetooth.hosts[5].
ko: 원격 장치에 별칭을 지정할 수 있는 위치는 [.filename]#/etc/bluetooth/hosts#입니다. [.filename]#/etc/bluetooth/hosts# 파일에 대한 자세한 정보는 man:bluetooth.hosts[5]에서 확인할 수 있습니다.
ru: Удаленным устройствам могут быть назначены псевдонимы в [.filename]#/etc/bluetooth/hosts#. Дополнительная информация о файле [.filename]#/etc/bluetooth/hosts# может быть найдена в man:bluetooth.hosts[5].

source: The Bluetooth system provides a point-to-point connection between two Bluetooth units, or a point-to-multipoint connection which is shared among several Bluetooth devices. The following example shows how to create a connection to a remote device:
es: El sistema Bluetooth proporciona conexión punto a punto entre dos unidades Bluetooth, o punto a multipunto que se comparte entre varios dispositivos Bluetooth. El siguiente ejemplo muestra cómo crear una conexión con un dispositivo remoto:
ko: 블루투스 시스템은 두 개의 블루투스 장치 간의 지점 간 연결 또는 여러 블루투스 장치 간에 공유되는 지점 간 다중 지점 연결을 제공합니다. 다음 예는 원격 장치에 대한 연결을 만드는 방법을 보여줍니다:
ru: Система Bluetooth обеспечивает соединение точка-точка между двумя устройствами Bluetooth или соединение точка-многоточка, разделяемое между несколькими устройствами Bluetooth. В следующем примере показано, как создать соединение с удалённым устройством:

source: `create_connection` accepts `BT_ADDR` as well as host aliases in [.filename]#/etc/bluetooth/hosts#.
es: `create_connection` acepta `BT_ADDR` así como los alias encontrados en [.filename]#/etc/bluetooth/hosts#.
ko: `create_connection`은 `BT_ADDR`과 [.filename]#/etc/bluetooth/hosts#의 호스트 별칭을 허용합니다.
ru: `create_connection` принимает `BT_ADDR`, а также псевдонимы хостов в файле [.filename]#/etc/bluetooth/hosts#.

source: The following example shows how to obtain the list of active baseband connections for the local device:
es: El siguiente ejemplo muestra cómo obtener la lista de conexiones activas en la banda base para el dispositivo local:
ko: 다음 예는 로컬 디바이스에 대한 활성 베이스밴드 연결 목록을 가져오는 방법을 보여줍니다:
ru: Следующий пример показывает, как получить список активных базовых соединений для локального устройства:

source: A _connection handle_ is useful when termination of the baseband connection is required, though it is normally not required to do this by hand. The stack will automatically terminate inactive baseband connections.
es: Un _manejador de conexión_ es útil cuando se requiere la terminación de una conexión de la banda base, aunque normalmente no es necesario hacer esto a mano. La pila terminará automáticamente las conexiones de banda base inactivas.
ko: _connection handle_은 베이스밴드 연결을 종료해야 할 때 유용하지만, 일반적으로는 직접 종료할 필요는 없습니다. 스택은 비활성 베이스밴드 연결을 자동으로 종료합니다.
ru: _Дескриптор соединения (connection handle)_ полезен, когда требуется разрыв базового соединения, хотя обычно это не нужно делать вручную. Стек автоматически разрывает неактивные базовые соединения.

source: Type `hccontrol help` for a complete listing of available HCI commands. Most of the HCI commands do not require superuser privileges.
es: Teclea `hccontrol help` para obtener un listado completo de los comandos HCI disponibles. La mayoría de los comandos HCI no requieren privilegios de súper usuario.
ko: 사용 가능한 HCI 명령의 전체 목록을 보려면 `hccontrol help`를 입력하세요. 대부분의 HCI 명령에는 수퍼유저 권한이 필요하지 않습니다.
ru: Введите `hccontrol help` для получения полного списка доступных команд HCI. Большинство команд HCI не требуют прав суперпользователя.

source: Device Pairing
es: Emparejamiento de Dispositivos
ko: 디바이스 페어링
ru: Сопряжение устройств

source: By default, Bluetooth communication is not authenticated, and any device can talk to any other device. A Bluetooth device, such as a cellular phone, may choose to require authentication to provide a particular service. Bluetooth authentication is normally done with a _PIN code_, an ASCII string up to 16 characters in length. The user is required to enter the same PIN code on both devices. Once the user has entered the PIN code, both devices will generate a _link key_. After that, the link key can be stored either in the devices or in a persistent storage. Next time, both devices will use the previously generated link key. This procedure is called _pairing_. Note that if the link key is lost by either device, the pairing must be repeated.
es: Por defecto, la comunicación Bluetooth no está autenticada, y cualquier dispositivo puede hablar con cualquier otro. Un dispositivo Bluetooth, como un teléfono móvil, podría decidir requerir autenticación para proporcionar un servicio particular. La autenticación Bluetooth se hacer normalmente con un _código PIN_, una cadena ASCII de hasta 16 caracteres. Se requiere que el usuario introduzca el mismo código PIN en ambos dispositivos. Una vez que el usuario ha introducido el código PIN, ambos dispositivos generarán una _clave de enlace_. Después de eso, la clave de enlace se puede almacenar en los dispositivos o en almacenamiento persistente. La siguiente vez, ambos dispositivos utilizarán las claves de enlace generadas previamente. Este procedimiento se llama _emparejamiento_. Ten en cuenta que si alguno de los dispositivos pierde la clave de enlace, se tiene que repetir el emparejamiento.
ko: 기본적으로 Bluetooth 통신은 인증되지 않으며, 어떤 장치든 다른 장치와 통신할 수 있습니다. 휴대폰과 같은 블루투스 장치는 특정 서비스를 제공하기 위해 인증이 필요하도록 선택할 수 있습니다. 블루투스 인증은 일반적으로 최대 16자 길이의 아스키 문자열인 _PIN 코드_를 사용하여 수행됩니다. 사용자는 두 장치에 동일한 PIN 코드를 입력해야 합니다. 사용자가 PIN 코드를 입력하면 두 장치 모두 _link key_를 생성합니다. 그 후 링크 키는 장치 또는 영구 저장소에 저장할 수 있습니다. 다음 번에는 두 장치 모두 이전에 생성된 링크 키를 사용합니다. 이 절차를 _페어링_이라고 합니다. 어느 한 쪽 장치에서 링크 키를 분실하면 페어링을 반복해야 합니다.
ru: По умолчанию Bluetooth-связь не требует аутентификации, и любое устройство может взаимодействовать с любым другим устройством. Устройство Bluetooth, такое как сотовый телефон, может потребовать аутентификацию для предоставления определенной услуги. Аутентификация Bluetooth обычно выполняется с помощью _PIN-кода_ — строки ASCII длиной до 16 символов. Пользователь должен ввести один и тот же PIN-код на обоих устройствах. После ввода PIN-кода оба устройства сгенерируют _ключ связи_. Затем ключ связи может быть сохранен либо в самих устройствах, либо в постоянном хранилище. В следующий раз оба устройства будут использовать ранее сгенерированный ключ связи. Эта процедура называется _сопряжением (pairing)_. Обратите внимание, что если ключ связи будет утерян одним из устройств, спаривание необходимо повторить.

source: The man:hcsecd[8] daemon is responsible for handling Bluetooth authentication requests. The default configuration file is [.filename]#/etc/bluetooth/hcsecd.conf#. An example section for a cellular phone with the PIN code set to `1234` is shown below:
es: El demonio man:hcsecd[8] es el responsable de manejar las peticiones de autenticación Bluetooth. El fichero de configuración por defecto es [.filename]#/etc/bluetooth/hcsecd.conf#. A continuación se muestra un ejemplo de sección para un teléfono móvil con el PIN establecido a `1234`:
ko: man:hcsecd[8] 데몬은 블루투스 인증 요청 처리를 담당합니다. 기본 구성 파일은 [.filename]#/etc/bluetooth/hcsecd.conf#입니다. PIN 코드가 `1234`로 설정된 휴대폰에 대한 예제 섹션은 아래와 같습니다:
ru: Демон man:hcsecd[8] отвечает за обработку запросов аутентификации Bluetooth. Конфигурационный файл по умолчанию — [.filename]#/etc/bluetooth/hcsecd.conf#. Пример раздела для мобильного телефона с PIN-кодом `1234` приведён ниже:

source: The only limitation on PIN codes is length. Some devices, such as Bluetooth headsets, may have a fixed PIN code built in. The `-d` switch forces man:hcsecd[8] to stay in the foreground, so it is easy to see what is happening. Set the remote device to receive pairing and initiate the Bluetooth connection to the remote device. The remote device should indicate that pairing was accepted and request the PIN code. Enter the same PIN code listed in [.filename]#hcsecd.conf#. Now the computer and the remote device are paired. Alternatively, pairing can be initiated on the remote device.
es: La única limitación de los códigos PIN es la longitud. Algunos dispositivos, como los auriculares Bluetooth, podrían tener un código PIN fijo de fábrica. La opción `-d` fuerza a man:hcsecd[8] a permanecer en primer plano, de forma que es fácil ver lo que está pasando. Establece el dispositivo remoto para que reciba emparejamientos e inicia la conexión Bluetooth con el dispositivo remoto. El dispositivo remoto debería indicar que el emparejamiento ha sido aceptado y solicitar el código PIN. Introduce el mismo código PIN listado en [.filename]#hcsecd.conf#. Ahora el ordenador y el dispositivo remoto están emparejados. De forma alternativa, el emparejamiento puede ser iniciado por el dispositivo remoto.
ko: PIN 코드에 대한 유일한 제한은 길이입니다. 블루투스 헤드셋과 같은 일부 장치에는 고정 PIN 코드가 내장되어 있을 수 있습니다. `-d` 스위치를 사용하면 man:hcsecd[8]가 전면에 표시되므로 무슨 일이 일어나고 있는지 쉽게 확인할 수 있습니다. 원격 장치가 페어링을 수신하도록 설정하고 원격 장치에 대한 블루투스 연결을 시작합니다. 원격 장치에서 페어링이 수락되었음을 표시하고 PIN 코드를 요청해야 합니다. [.filename]#hcsecd.conf#에 나열된 것과 동일한 PIN 코드를 입력합니다. 이제 컴퓨터와 원격 장치가 페어링되었습니다. 또는 원격 장치에서 페어링을 시작할 수도 있습니다.
ru: Единственное ограничение PIN-кодов — их длина. Некоторые устройства, например Bluetooth-гарнитуры, могут иметь встроенный фиксированный PIN-код. Ключ `-d` заставляет man:hcsecd[8] оставаться на переднем плане, что упрощает отслеживание происходящего. Настройте удалённое устройство на приём сопряжения и инициируйте Bluetooth-соединение с ним. Удалённое устройство должно подтвердить принятие сопряжения и запросить PIN-код. Введите тот же PIN-код, который указан в [.filename]#hcsecd.conf#. Теперь компьютер и удалённое устройство сопряжены. Также сопряжение можно инициировать с удалённого устройства.

source: The following line can be added to [.filename]#/etc/rc.conf# to configure man:hcsecd[8] to start automatically on system start:
es: Se puede añadir la siguiente línea a [.filename]#/etc/rc.conf# para configurar que man:hcsecd[8] arranque automáticamente cuando se inicia el sistema:
ko: 다음 줄을 [.filename]#/etc/rc.conf#에 추가하여 시스템 시작 시 man:hcsecd[8]가 자동으로 시작되도록 구성할 수 있습니다:
ru: Следующую строку можно добавить в [.filename]#/etc/rc.conf#, чтобы настроить автоматический запуск man:hcsecd[8] при загрузке системы:

source: The following is a sample of the man:hcsecd[8] daemon output:
es: Lo siguiente es una muestra de la salida del demonio man:hcsecd[8]:
ko: 다음은 man:hcsecd[8] 데몬 출력의 샘플입니다:
ru: Вот пример вывода демона man:hcsecd[8]:

source: Network Access with PPP Profiles
es: Acceso a la Red con Perfiles PPP
ko: PPP 프로필을 통한 네트워크 액세스
ru: Доступ в сеть с профилями PPP

source: A Dial-Up Networking (DUN) profile can be used to configure a cellular phone as a wireless modem for connecting to a dial-up Internet access server. It can also be used to configure a computer to receive data calls from a cellular phone.
es: Es posible utilizar un perfil DUN (Dial-Up Networking) para configurar un teléfono móvil como un módem inalámbrico para conectarse a un servidor de acceso a Internet. También se puede utilizar para configurar un ordenador para recibir llamadas de datos desde un teléfono móvil.
ko: 전화 접속 네트워킹(DUN) 프로필을 사용하여 휴대폰을 전화 접속 인터넷 액세스 서버에 연결하기 위한 무선 모뎀으로 구성할 수 있습니다. 또한 휴대폰에서 데이터 전화를 수신하도록 컴퓨터를 구성하는 데 사용할 수도 있습니다.
ru: Профиль Dial-Up Networking (DUN) может использоваться для настройки сотового телефона в качестве беспроводного модема для подключения к серверу доступа в Интернет через коммутируемое соединение. Он также может применяться для настройки компьютера для приёма входящих вызовов передачи данных с сотового телефона.

source: Network access with a PPP profile can be used to provide LAN access for a single Bluetooth device or multiple Bluetooth devices. It can also provide PC to PC connection using PPP networking over serial cable emulation.
es: Se puede usar el acceso a la red mediante un perfil PPP para proporcionar acceso LAN para uno o varios dispositivos Bluetooth. También puede proporcionar conexión PC a PC usando PPP sobre emulación de cable serie.
ko: PPP 프로필을 통한 네트워크 액세스는 단일 Bluetooth 장치 또는 여러 Bluetooth 장치에 대한 LAN 액세스를 제공하는 데 사용할 수 있습니다. 또한 직렬 케이블 에뮬레이션을 통해 PPP 네트워킹을 사용하여 PC 간 연결을 제공할 수도 있습니다.
ru: Доступ к сети с профилем PPP может использоваться для предоставления доступа к LAN для одного устройства Bluetooth или нескольких устройств Bluetooth. Также он может обеспечить соединение между компьютерами с использованием PPP-сетей через эмуляцию последовательного кабеля.

source: In FreeBSD, these profiles are implemented with man:ppp[8] and the man:rfcomm_pppd[8] wrapper which converts a Bluetooth connection into something PPP can use. Before a profile can be used, a new PPP label must be created in [.filename]#/etc/ppp/ppp.conf#. Consult man:rfcomm_pppd[8] for examples.
es: En FreeBSD, estos perfiles se implementan con man:ppp[8] y el adaptador man:rfcomm_pppd[8] que convierte la conexión Bluetooth en algo que PPP puede usar. Antes de que se pueda usar el perfile, se debe crear una nueva etiqueta PPP en [.filename]#/etc/ppp/ppp.conf#. Consulta man:rfcomm_pppd[8] para ver ejemplos.
ko: FreeBSD에서, 이러한 프로파일은 블루투스 연결을 PPP가 사용할 수 있는 것으로 변환하는 man:ppp[8] 및 man:rfcomm_pppd[8] 래퍼를 사용하여 구현됩니다. 프로파일을 사용하려면 [.filename]#/etc/ppp/ppp.conf#에 새 PPP 레이블을 만들어야 합니다. 예제는 man:rfcomm_pppd[8]를 참조하세요.
ru: В FreeBSD эти профили реализованы с помощью man:ppp[8] и обёртки man:rfcomm_pppd[8], которая преобразует Bluetooth-соединение в форму, пригодную для использования PPP. Перед использованием профиля необходимо создать новую метку PPP в [.filename]#/etc/ppp/ppp.conf#. Примеры можно найти в man:rfcomm_pppd[8].
