Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: The client machine found the AP and can be associated with it:
es: La máquina cliente ha encontrado el AP y se puede asociar con él:
ko: 클라이언트 컴퓨터가 AP를 발견하여 연결할 수 있습니다:
ru: Клиентская машина обнаружила точку доступа и может быть ассоциирована с ней:

source: WPA2 Host-based Access Point
es: Punto de Acceso WPA2 basado en Host
ko: WPA2 호스트 기반 액세스 포인트
ru: WPA2 Точка доступа на основе хоста

source: This section focuses on setting up a FreeBSD access point using the WPA2 security protocol. More details regarding WPA and the configuration of WPA-based wireless clients can be found in <<network-wireless-wpa>>.
es: Esta sección se centra en configurar un punto de acceso FreeBSD usando el protocolo de seguridad WPA2. Se pueden encontrar más detalles acerca de WPA y de la configuración de clientes inalámbricos basados en WPA en <<network-wireless-wpa>>.
ko: 이 섹션에서는 WPA2 보안 프로토콜을 사용하여 FreeBSD 액세스 포인트를 설정하는 데 중점을 둡니다. WPA와 WPA 기반 무선 클라이언트의 구성에 대한 자세한 내용은 <<network-wireless-wpa>>에서 확인할 수 있습니다.

source: The man:hostapd[8] daemon is used to deal with client authentication and key management on the WPA2-enabled AP.
es: El demonio man:hostapd[8] se usa para manejar la autenticación del cliente y la gestión de la clave en el AP con WPA2 habilitado.
ko: man:hostapd[8] 데몬은 WPA2 지원 AP에서 클라이언트 인증 및 키 관리를 처리하는 데 사용됩니다.
ru: Демон man:hostapd[8] используется для обработки аутентификации клиентов и управления ключами на точке доступа с поддержкой WPA2.

source: The following configuration operations are performed on the FreeBSD machine acting as the AP. Once the AP is correctly working, man:hostapd[8] can be automatically started at boot with this line in [.filename]#/etc/rc.conf#:
es: Una máquina FreeBSD configurada como AP realiza las siguientes operaciones de configuración. Una vez que el AP está funcionando correctamente, se puede iniciar man:hostapd[8] durante el arranque con esta línea en [.filename]#/etc/rc.conf#:
ko: 다음 구성 작업은 AP 역할을 하는 FreeBSD 머신에서 수행됩니다. AP가 올바르게 작동하면 부팅 시 [.filename]#/etc/rc.conf#에 있는 이 줄을 사용하여 man:hostapd[8]를 자동으로 시작할 수 있습니다:
ru: В следующих операциях конфигурации выполняются на машине FreeBSD, выступающей в качестве точки доступа (AP). После того как точка доступа работает корректно, man:hostapd[8] можно автоматически запускать при загрузке, добавив эту строку в [.filename]#/etc/rc.conf#:

source: Before trying to configure man:hostapd[8], first configure the basic settings introduced in <<network-wireless-ap-basic>>.
es: Antes de intentar configurar man:hostapd[8], primero configura los parámetros básicos presentados en <<network-wireless-ap-basic>>.
ko: man:hostapd[8]를 구성하기 전에 먼저 <<network-wireless-ap-basic>에 소개된 기본 설정을 구성합니다.

source: WPA2-PSK is intended for small networks where the use of a backend authentication server is not possible or desired.
es: WPA2-PSK está pensado para pequeñas redes donde no se puede o no es deseable utilizar un servidor de autenticación.
ko: WPA2-PSK는 백엔드 인증 서버를 사용할 수 없거나 원하지 않는 소규모 네트워크를 위한 것입니다.
ru: WPA2-PSK предназначен для небольших сетей, где использование сервера аутентификации невозможно или нежелательно.

source: The configuration is done in [.filename]#/etc/hostapd.conf#:
es: La configuración se hace en [.filename]#/etc/hostapd.conf#:
ko: 구성은 [.filename]#/etc/hostapd.conf#에서 합니다:
ru: Конфигурация выполняется в [.filename]#/etc/hostapd.conf#:

source: Wireless interface used for the access point.
es: Interfaz inalámbrica utilizada para el punto de acceso.
ko: 액세스 포인트에 사용되는 무선 인터페이스.
ru: Беспроводной интерфейс, используемый для точки доступа.

source: Level of verbosity used during the execution of man:hostapd[8]. A value of `1` represents the minimal level.
es: Nivel de verbosidad utilizado durante la ejecución de man:hostapd[8]. Un valor de `1` representa el nivel mínimo.
ko: man:hostapd[8]를 실행하는 동안 사용되는 상세도 수준입니다. 값이 `1`이면 최소 수준을 나타냅니다.
ru: Уровень детализации, используемый во время выполнения man:hostapd[8]. Значение `1` представляет минимальный уровень.

source: Pathname of the directory used by man:hostapd[8] to store domain socket files for communication with external programs such as man:hostapd_cli[8]. The default value is used in this example.
es: Ruta del directorio utilizado por man:hostapd[8] para almacenar ficheros de sockets de dominio para comunicación con programas externos como man:hostapd_cli[8]. En este ejemplo se usa el valor por defecto.
ko: man:hostapd_cli[8]와 같은 외부 프로그램과의 통신을 위해 도메인 소켓 파일을 저장하는 데 man:hostapd[8]가 사용하는 디렉터리의 경로명입니다. 이 예제에서는 기본값이 사용됩니다.
ru: Путь к каталогу, используемому man:hostapd[8] для хранения файлов доменных сокетов для взаимодействия с внешними программами, такими как man:hostapd_cli[8]. В этом примере используется значение по умолчанию.

source: The group allowed to access the control interface files.
es: El grupo que tiene permitido el acceso a los ficheros de control del interfaz.
ko: 제어 인터페이스 파일에 액세스할 수 있는 그룹.
ru: Группа, которой разрешён доступ к файлам управляющего интерфейса.

source: The wireless network name, or SSID, that will appear in wireless scans.
es: El nombre de la red inalámbrica, o SSID, que aparecerá en los escaneos inalámbricos.
ko: 무선 스캔에 표시되는 무선 네트워크 이름 또는 SSID입니다.
ru: Имя беспроводной сети, или SSID, которое будет отображаться при сканировании беспроводных сетей.

source: Enable WPA and specify which WPA authentication protocol will be required. A value of `2` configures the AP for WPA2 and is recommended. Set to `1` only if the obsolete WPA is required.
es: Activa WPA y especifica qué protocolo de autenticación WPA se requerirá. Un valor de `2` configura el AP para WPA2 y es el recomendado. Establécelo a `1` sólo si se necesita el obsoleto WPA.
ko: WPA를 활성화하고 필요한 WPA 인증 프로토콜을 지정합니다. 값이 `2`이면 AP가 WPA2를 사용하도록 구성되며 권장설정입니다. 더 이상 사용되지 않는 WPA가 필요한 경우에만 `1`로 설정합니다.
ru: Включает WPA и указывает, какой протокол аутентификации WPA будет использоваться. Значение `2` настраивает точку доступа на WPA2 и является рекомендуемым. Установите значение `1` только если требуется устаревший WPA.

source: ASCII passphrase for WPA authentication.
es: Contraseña ASCII para la autenticación WPA.
ko: WPA 인증용 ASCII 암호 구문.
ru: ASCII-пароль для аутентификации WPA.

source: The key management protocol to use. This example sets WPA-PSK.
es: El protocolo de gestión de claves a usar. Este ejemplo establece WPA-PSK.
ko: 사용할 키 관리 프로토콜입니다. 이 예에서는 WPA-PSK를 설정합니다.
ru: Протокол управления ключами для использования. В этом примере установлен WPA-PSK.

source: Encryption algorithms accepted by the access point. In this example, only the CCMP (AES) cipher is accepted. CCMP is an alternative to TKIP and is strongly preferred when possible. TKIP should be allowed only when there are stations incapable of using CCMP.
es: Algoritmos de encriptación aceptados por el punto de acceso. En este ejemplo, sólo se acepta el encriptador CCMP (AES). CCMP es una alternativa a TKIP y se prefiere siempre que se a posible. TKIP sólo debería permitirse cuando las estaciones con incapaces de usar CCMP.
ko: 액세스 포인트에서 허용하는 암호화 알고리즘으로 이 예에서는 CCMP(AES) 암호만 허용됩니다. CCMP는 TKIP의 대안이며 가능한 경우 강력히 권장됩니다. CCMP를 사용할 수 없는 스테이션이 있는 경우에만 TKIP를 허용해야 합니다.
ru: Алгоритмы шифрования, принимаемые точкой доступа. В этом примере принимается только шифр CCMP (AES). CCMP является альтернативой TKIP и настоятельно рекомендуется к использованию, когда это возможно. TKIP следует разрешать только в случае наличия станций, не способных использовать CCMP.

source: The next step is to start man:hostapd[8]:
es: El siguiente paso es arrancar man:hostapd[8]:
ko: 다음 단계는 man:hostapd[8]를 실행하는 것입니다:
ru: Следующий шаг — запустить man:hostapd[8]:

source: Once the AP is running, the clients can associate with it. See <<network-wireless-wpa>> for more details. It is possible to see the stations associated with the AP using `ifconfig _wlan0_ list sta`.
es: Una vez que el AP está funcionando, los clientes se pueden asociar a él. Consulta <<network-wireless-wpa>> para más detalles. Es posible ver las estaciones asociadas con el AP usando `ifconfig _wlan0_ list sta`.
ko: AP가 실행되면 클라이언트가 AP에 연결할 수 있습니다. 자세한 내용은 <<network-wireless-wpa>>을 참조하세요. `ifconfig _wlan0_ list sta`를 사용하여 AP와 연결된 스테이션을 확인할 수 있습니다.

source: WEP Host-based Access Point
es: Punto de acceso WEP basado en Host
ko: WEP 호스트 기반 액세스 포인트

source: It is not recommended to use WEP for setting up an AP since there is no authentication mechanism and the encryption is easily cracked. Some legacy wireless cards only support WEP and these cards will only support an AP without authentication or encryption.
es: No se recomienda utilizar WEP para configurar un AP ya que no hay mecanismo de autenticación y la encriptación se rompe fácilmente. Algunas tarjetas inalámbricas heredades sólo soportan WEP y estas tarjetas sólo soportarán un AP sin autenticación o encriptación.
ko: 인증 메커니즘이 없고 암호화가 쉽게 해독되므로 AP 설정에 WEP를 사용하는 것은 권장하지 않습니다. 일부 레거시 무선 카드는 WEP만 지원하며 이러한 카드는 인증이나 암호화 없는 AP만 지원합니다.

source: The wireless device can now be put into hostap mode and configured with the correct SSID and IP address:
es: El dispositivo inalámbrico se pude poner ahora en modo hostap y se puede configurar con la SSID correcta y la dirección IP:
ko: 이제 무선 장치를 호스트 모드로 전환하고 올바른 SSID 및 IP 주소로 구성할 수 있습니다:

source: The `weptxkey` indicates which WEP key will be used in the transmission. This example uses the third key as key numbering starts with `1`. This parameter must be specified in order to encrypt the data.
es: `weptxkey` indica qué clave WEP se usará en la transmisión. Este ejemplo usa la tercera clave ya que la numeración de las claves empieza por `1`. Este parámetro se debe especificar para encriptar los datos.
ko: `weptxkey`는 전송에 사용할 WEP 키를 나타냅니다. 이 예에서는 키 번호가 `1`로 시작하므로 세 번째 키를 사용합니다. 데이터를 암호화하려면 이 매개변수를 지정해야 합니다.

source: The `wepkey` sets the selected WEP key. It should be in the format _index:key_. If the index is not given, key `1` is set. The index needs to be set when using keys other than the first key.
es: `wepkey` establece la clave WEP seleccionada. Debería estar en el formato _index:key_. Si no se proporciona índice, se establece la clave a `1`. El índice necesita establecerse cuando se usa otra clave que no sea la primera.
ko: `wepkey`는 선택한 WEP 키를 설정합니다. _index:key_ 형식이어야 합니다. 인덱스가 지정되지 않으면 키 `1`이 설정됩니다. 첫 번째 키가 아닌 다른 키를 사용할 때는 인덱스를 설정해야 합니다.

source: Use man:ifconfig[8] to see the status of the [.filename]#wlan0# interface:
es: Usa man:ifconfig[8] para ver el estado del interfaz [.filename]#wlan0#:
ko: man:ifconfig[8]을 사용하여 [.filename]#wlan0# 인터페이스의 상태를 확인합니다:

source: From another wireless machine, it is now possible to initiate a scan to find the AP:
es: Desde otra máquina inalámbrica, ahora es posible iniciar un escaneo para encontrar el AP:
ko: 이제 다른 무선 기기에서 스캔을 시작하여 AP를 찾을 수 있습니다:

source: In this example, the client machine found the AP and can associate with it using the correct parameters. See <<network-wireless-wep>> for more details.
es: En este ejemplo, la máquina cliente ha encontrado el AP y se puede asociar a él usando los parámetros correctos. Consulta <<network-wireless-wep>> para más detalles.
ko: 이 예제에서는 클라이언트 컴퓨터가 AP를 찾았고 올바른 매개변수를 사용하여 AP와 연결할 수 있습니다. 자세한 내용은 <<network-wireless-wep>>을 참조하세요.

source: Using Both Wired and Wireless Connections
es: Usando Tanto Redes con Cable como Inalámbricas
ko: 유선 및 무선 연결 모두 사용하기

source: A wired connection provides better performance and reliability, while a wireless connection provides flexibility and mobility. Laptop users typically want to roam seamlessly between the two types of connections.
es: Una conexión por cable proporciona mejor rendimiento y fiabilidad, mientras que una conexión inalámbrica proporciona flexibilidad y movilidad. Los usuarios de portátiles típicamente prefieren moverse entre los dos tipos de conexiones sin interrupciones.
ko: 유선 연결은 더 나은 성능과 안정성을 제공하는 반면, 무선 연결은 유연성과 이동성을 제공합니다. 노트북 사용자는 일반적으로 두 가지 유형의 연결 사이를 원활하게 이동하기를 원합니다.

source: On FreeBSD, it is possible to combine two or even more network interfaces together in a "failover" fashion. This type of configuration uses the most preferred and available connection from a group of network interfaces, and the operating system switches automatically when the link state changes.
es: En FreeBSD, es posible combinar dos o incluso más interfaces de red en una modalidad "failover". Este tipo de configuración utiliza la conexión más disponible y preferente de un grupo de interfaces de red, y el sistema operativo cambia automáticamente cuando el estado del enlace cambia.
ko: FreeBSD에서는 두 개 이상의 네트워크 인터페이스를 "failover" 방식으로 결합할 수 있습니다. 이 유형의 구성은 네트워크 인터페이스 그룹에서 가장 선호되고 사용 가능한 연결을 사용하며, 링크 상태가 변경되면 운영 체제가 자동으로 전환됩니다.

source: Link aggregation and failover is covered in <<network-aggregation>> and an example for using both wired and wireless connections is provided at <<networking-lagg-wired-and-wireless>>.
es: La agregación de enlaces y el failover se cubre en <<network-aggregation>> y en <<networking-lagg-wired-and-wireless>> se proporciona un ejemplo para usar tanto una conexión por cable como una inalámbrica.
ko: 링크 집계 및 장애 조치에 대해서는 <<network-aggregation>>에서 다루고 있으며, 유선 및 무선 연결을 모두 사용하는 예제는 <<networking-lagg-wired-and-wireless>>에서 제공됩니다.

source: This section describes a number of steps to help troubleshoot common wireless networking problems.
es: Esta sección describe una serie de pasos para ayudar a solucionar problemas comunes de redes inalámbricas.
ko: 이 섹션에서는 일반적인 무선 네트워킹 문제를 해결하는 데 도움이 되는 여러 단계에 대해 설명합니다.

source: If the access point is not listed when scanning, check that the configuration has not limited the wireless device to a limited set of channels.
es: Si el punto de acceso no está en la lista cuando se escanea, comprueba que la configuración no ha limitado el dispositivo inalámbrico a un conjunto limitado de canales.
ko: 스캔할 때 액세스 포인트가 나열되지 않으면 구성에서 무선 장치를 한정된 채널 집합으로 제한하지 않았는지 확인하세요.

source: If the device cannot associate with an access point, verify that the configuration matches the settings on the access point. This includes the authentication scheme and any security protocols. Simplify the configuration as much as possible. If using a security protocol such as WPA or WEP, configure the access point for open authentication and no security to see if traffic will pass.
es: Si el dispositivo no se puede asociar con el punto de acceso, verifica que la configuración concuerda con los parámetros del punto de acceso. Esto incluye el esquema de autenticación y cualquier protocolo de seguridad. Simplifica la configuración lo más posible. Si se usa un protocolo de seguridad como WAP o WEP, configura el punto de acceso con autenticación abierta y sin seguridad para ver si el tráfico pasa.
ko: 장치가 액세스 포인트에 연결할 수 없는 경우 구성이 액세스 포인트의 설정과 일치하는지 확인합니다. 여기에는 인증 체계 및 모든 보안 프로토콜이 포함됩니다. 가능한 한 구성을 단순화하세요. WPA 또는 WEP와 같은 보안 프로토콜을 사용하는 경우, 액세스 포인트를 개방형 인증 및 보안 없음으로 구성하여 트래픽이 통과되는지 확인하세요.

source: Debugging support is provided by man:wpa_supplicant[8]. Try running this utility manually with `-dd` and look at the system logs.
es: El soporte para depuración lo proporciona man:wpa_supplicant[8]. Intenta ejecutar esta utilidad manualmente con `-dd` y mira los logs del sistema.
ko: 디버깅 지원은 man:wpa_supplicant[8]에서 제공합니다. 이 유틸리티를 `-dd`로 수동 실행하고 시스템 로그를 살펴보세요.

source: Once the system can associate with the access point, diagnose the network configuration using tools like man:ping[8].
es: Una vez que el sistema se pueda asociar con el punto de acceso, diagnostica la configuración de la red utilizando herramientas como man:ping[8].
ko: 시스템이 액세스 포인트에 연결할 수 있으면 man:ping[8]과 같은 도구를 사용하여 네트워크 구성을 진단합니다.

source: There are many lower-level debugging tools. Debugging messages can be enabled in the 802.11 protocol support layer using man:wlandebug[8]. For example, to enable console messages related to scanning for access points and the 802.11 protocol handshakes required to arrange communication:
es: Hay muchas herramientas de depuración de bajo nivel. Los mensajes de depuración se pueden habilitar en la capa de soporte del protocolo 802.11 usando man:wlandebug[8]. Por ejemplo, para activar mensajes de consola relativos al escaneo de puntos de acceso y las negociaciones del protocolo 802.11 requeridas para establecer la comunicación:
ko: 더 낮은 수준의 디버깅 도구가 많이 있습니다. 802.11 프로토콜 지원 계층에서 man:wlandebug[8]를 사용하여 디버깅 메시지를 활성화할 수 있습니다. 예를 들어, 액세스 포인트 검색과 관련된 콘솔 메시지 및 통신을 준비하는 데 필요한 802.11 프로토콜 핸드셰이크와 관련된 메시지를 활성화할 수 있습니다:

source: Many useful statistics are maintained by the 802.11 layer and `wlanstats`, found in [.filename]#/usr/src/tools/tools/net80211#, will dump this information. These statistics should display all errors identified by the 802.11 layer. However, some errors are identified in the device drivers that lie below the 802.11 layer so they may not show up. To diagnose device-specific problems, refer to the driver documentation.
es: La capa 802.11 mantiene muchas estadísticas útiles y `wlanstats`, que se encuentra en [.filename]#/usr/src/tools/tools/net80211#, mostrará esta información. Estas estadísticas deberían mostrar todos los errores identificados por la capa 802.11. Sin embargo, algunos errores son identificados en los controladores de dispositivo que está por debajo de la capa 802.11 de forma que podrían no verse. Para diagnosticar problemas específicos del dispositivo, consulta la documentación del controlador.
ko: 802.11 계층에서 많은 유용한 통계를 유지 관리하며, [.filename]#/usr/src/tools/tools/net80211#에 있는 `wlanstats`가 이 정보를 덤프합니다. 이 통계에는 802.11 계층에서 식별된 모든 오류가 표시되어야 합니다. 그러나 일부 오류는 802.11 계층 아래에 있는 장치 드라이버에서 식별되므로 표시되지 않을 수 있습니다. 디바이스별 문제를 진단하려면 드라이버 설명서를 참조하세요.

source: If the above information does not help to clarify the problem, submit a problem report and include output from the above tools.
es: Si la información de arriba no ayuda a clarificar el problema, envía un informe de error e incluye la salida de las herramientas de arriba.
ko: 위의 정보로 문제를 명확히 파악하는 데 도움이 되지 않는 경우 문제 보고서를 제출하고 위의 도구에서 출력한 내용을 포함하세요.

source: USB Tethering
es: Tethering USB
ko: USB 테더링
ru: Раздача интернета через USB

source: Many cellphones provide the option to share their data connection over USB (often called "tethering"). This feature uses one of RNDIS, CDC, or a custom Apple(R) iPhone(R)/iPad(R) protocol.
es: Muchos teléfonos móviles proporcionan la opción de compartir su conexión de datos a través de USB (habitualmente llamado "tethering"). Esta característica usa uno de los protocolos RNDIS, CDC o el protocolo personalizado Apple(R) iPhone(R)/iPad(R).
ko: 대부분의 휴대폰은 USB를 통해 데이터 연결을 공유하는 옵션을 제공합니다("테더링"이라고도 함). 이 기능은 RNDIS, CDC 또는 사용자 지정 Apple(R) iPhone(R)/iPad(R) 프로토콜 중 하나를 사용합니다.
ru: Многие мобильные телефоны предоставляют возможность совместного использования своего интернет-подключения через USB (часто называемую "тетеринг, раздача Интернета или режим модема"). Эта функция использует один из протоколов: RNDIS, CDC или проприетарный протокол Apple(R) iPhone(R)/iPad(R).

source: Android(TM) devices generally use the man:urndis[4] driver.
es: Los dispositivos Android(TM) normalmente utilizan el controlador man:urndis[4].
ko: Android(TM) 장치는 일반적으로 man:urndis[4] 드라이버를 사용합니다.
ru: Устройства Android(TM) обычно используют драйвер man:urndis[4].

source: Apple(R) devices use the man:ipheth[4] driver.
es: Los dispositivos Apple(R) usan el controlador man:ipheth[4].
ko: Apple(R) 장치는 man:ipheth[4] 드라이버를 사용합니다.
ru: Устройства Apple(R) используют драйвер man:ipheth[4].

source: Older devices will often use the man:cdce[4] driver.
es: Dispositivos más antiguos usarán habitualmente el controlador man:cdce[4].
ko: 구형 디바이스에서는 man:cdce[4] 드라이버를 사용하는 경우가 많습니다.
ru: Старые устройства часто используют драйвер man:cdce[4].

source: Before attaching a device, load the appropriate driver into the kernel:
es: Antes de conectar un dispositivo, carga el controlador apropiado en el kernel:
ko: 장치를 연결하기 전에 적절한 드라이버를 커널에 로드합니다:
ru: Перед подключением устройства загрузите соответствующий драйвер в ядро:

source: Once the device is attached ``ue``_0_ will be available for use like a normal network device. Be sure that the "USB tethering" option is enabled on the device.
es: Una vez que el dispositivo está conectado ``ue``_0_ estará disponible para que lo usemos como un dispositivo de red normal. Asegúrate de que el dispositivo tiene la opción "USB tethering" activada.
ko: 장치가 연결되면 ``ue``_0_을 일반 네트워크 장치처럼 사용할 수 있습니다. 장치에서 'USB 테더링' 옵션이 활성화되어 있는지 확인하세요.
ru: После подключения устройства ``ue``_0_ будет доступен для использования как обычное сетевое устройство. Убедитесь, что на устройстве включена опция "USB-тетеринг".

source: To make this change permanent and load the driver as a module at boot time, place the appropriate line of the following in [.filename]#/boot/loader.conf#:
es: Para hacer este cambio permanente y cargar el controlador como un módulo en el arranque, escribe la línea apropiada de las siguientes en [.filename]#/boot/loader.conf#:
ko: 이 변경 사항을 영구적으로 적용하고 부팅 시 드라이버를 모듈로 로드하려면 [.filename]#/boot/loader.conf#에 다음 중 적절한 줄을 배치합니다:
ru: Чтобы сделать это изменение постоянным и загружать драйвер как модуль при загрузке, добавьте соответствующую строку из следующих в [.filename]#/boot/loader.conf#:

source: Bluetooth is a wireless technology for creating personal networks operating in the 2.4 GHz unlicensed band, with a range of 10 meters. Networks are usually formed ad-hoc from portable devices such as cellular phones, handhelds, and laptops. Unlike Wi-Fi wireless technology, Bluetooth offers higher level service profiles, such as FTP-like file servers, file pushing, voice transport, serial line emulation, and more.
es: Bluetooth es una tecnología inalámbrica para crear redes personales que operen en la banda sin licenciar de 2.4 GHz, con un rago de 10 metros. Las redes se forman normalmente como ad-hoc a partir de dispositivos portátiles como teléfonos móviles, tabletas, y portátiles. A diferencia de la tecnología inalámbrica Wi-Fi, Bluetooth ofrece perfiles de servicio de más alto nivel, como servidores de fichero tipo FTP, envío de ficheros, transporte de voz, emulación de línea serie, y más.
ko: 블루투스는 2.4GHz 비면허 대역에서 작동하는 10미터 범위의 개인 네트워크를 생성하기 위한 무선 기술입니다. 네트워크는 일반적으로 휴대폰, 핸드헬드, 랩톱과 같은 휴대용 장치에서 임시로 형성됩니다. Wi-Fi 무선 기술과 달리 Bluetooth는 FTP와 같은 파일 서버, 파일 푸시, 음성 전송, 직렬 회선 에뮬레이션 등과 같은 더 높은 수준의 서비스 프로필을 제공합니다.
ru: Bluetooth — это беспроводная технология для создания персональных сетей, работающих в нелицензируемом диапазоне 2.4 ГГц, с радиусом действия до 10 метров. Сети обычно формируются на лету из портативных устройств, таких как мобильные телефоны, карманные компьютеры и ноутбуки. В отличие от технологии Wi-Fi, Bluetooth предоставляет сервисы более высокого уровня, такие как FTP-подобные файловые серверы, передача файлов, передача голоса, эмуляция последовательной линии и многое другое.

source: This section describes the use of a USB Bluetooth dongle on a FreeBSD system. It then describes the various Bluetooth protocols and utilities.
es: Esta sección describe el uso de un conector USB Bluetooth en un sistema FreeBSD. Después describe varias de las utilidades y protocolos de Bluetooth.
ko: 이 섹션에서는 FreeBSD 시스템에서 USB 블루투스 동글을 사용하는 방법을 설명합니다. 그런 다음 다양한 블루투스 프로토콜과 유틸리티에 대해 설명합니다.
ru: Этот раздел описывает использование USB Bluetooth адаптера в системе FreeBSD. Затем рассматриваются различные протоколы и утилиты Bluetooth.

source: Loading Bluetooth Support
es: Cargando Soporte Bluetooth
ko: 블루투스 지원을 로딩하기
ru: Загрузка поддержки Bluetooth
