Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: Most of the time, it is sufficient to let the system choose an access point using the builtin heuristics. This is the default behavior when an interface is marked as up or it is listed in [.filename]#/etc/rc.conf#:
es: La mayoría de las veces, es suficiente con dejar al sistema escoger un punto de acceso utilizando las heurísticas integradas. Este es el comportamiento por defecto cuando una interfaz se marca como levantada o si está listada en [.filename]#/etc/rc.conf#:
ko: 대부분의 경우 시스템이 내장된 휴리스틱을 사용하여 액세스 포인트를 선택하도록 하는 것으로 충분합니다. 인터페이스가 위로 표시되어 있거나 [.filename]#/etc/rc.conf#에 나열되어 있는 경우 기본 동작입니다:

source: If there are multiple access points, a specific one can be selected by its SSID:
es: Si hay varios puntos de acceso, se puede seleccionar uno específico por su SSID:
ko: 액세스 포인트가 여러 개 있는 경우, 해당 SSID로 특정 액세스 포인트를 선택할 수 있습니다:

source: In an environment where there are multiple access points with the same SSID, which is often done to simplify roaming, it may be necessary to associate to one specific device. In this case, the BSSID of the access point can be specified, with or without the SSID:
es: En entornos donde hay varios puntos de acceso con el mismo SSID, que es algo habitual para simplificar el roaming, podría ser necesario asociar con un dispositivo específico. En este caso, se puede especificar el BSSID del punto de acceso, con o sin el SSID:
ko: 로밍을 간소화하기 위해 동일한 SSID를 사용하는 액세스 포인트가 여러 개 있는 환경에서는 하나의 특정 장치에 연결해야 할 수 있습니다. 이 경우 SSID를 포함하거나 포함하지 않고 액세스 포인트의 BSSID를 지정할 수 있습니다:

source: There are other ways to constrain the choice of an access point, such as limiting the set of frequencies the system will scan on. This may be useful for a multi-band wireless card as scanning all the possible channels can be time-consuming. To limit operation to a specific band, use the `mode` parameter:
es: Hay otras formas de limitar la elección de un punto de acceso, como limitar el conjunto de frecuencias que puede escanear el sistema. Esto podría ser útil para tarjetas inalámbricas multi-banda ya que escanear todos los canales puede llevar mucho tiempo. Para limitar la operación a una banda específica, utiliza el parámetro `mode`:
ko: 시스템에서 스캔할 주파수 세트를 제한하는 등 액세스 포인트 선택을 제한하는 다른 방법도 있습니다. 가능한 모든 채널을 스캔하는 데 시간이 많이 소요될 수 있으므로 다중 대역 무선 카드에 유용할 수 있습니다. 특정 대역으로 작동을 제한하려면 `mode` 매개변수를 사용합니다:

source: This example will force the card to operate in 802.11g, which is defined only for 2.4GHz frequencies so any 5GHz channels will not be considered. This can also be achieved with the `channel` parameter, which locks operation to one specific frequency, and the `chanlist` parameter, to specify a list of channels for scanning. More information about these parameters can be found in man:ifconfig[8].
es: Este ejemplo forzará a la tarjeta a operar en 802.11g, que sólo se define para frecuencias de 2.4GHz de forma que no se considerarán los canales de 5GHz. Esto también se puede hacer con el parámetro `channel`, que fija la operación a una frecuencia específica, y el parámetro `chanlist`, para especificar una lista de canales para escanear. Se puede encontrar más información acerca de estos parámetros en man:ifconfig[8].
ko: 이 예에서는 카드가 2.4GHz 주파수로만 정의된 802.11g에서 작동하도록 강제하므로 5GHz 채널은 고려되지 않습니다. 특정 주파수로 작동을 고정하는 `channel` 매개변수와 스캔할 채널 목록을 지정하는 `chanlist` 매개변수를 사용하여 이 작업을 수행할 수도 있습니다. 이러한 매개변수에 대한 자세한 내용은 man:ifconfig[8]에서 확인할 수 있습니다.

source: ====== Authentication
es: ====== Autenticación
ko: ====== 인증

source: Once an access point is selected, the station needs to authenticate before it can pass data. Authentication can happen in several ways. The most common scheme, open authentication, allows any station to join the network and communicate. This is the authentication to use for test purposes the first time a wireless network is setup. Other schemes require cryptographic handshakes to be completed before data traffic can flow, either using pre-shared keys or secrets, or more complex schemes that involve backend services such as RADIUS. Open authentication is the default setting. The next most common setup is WPA-PSK, also known as WPA Personal, which is described in <<network-wireless-wpa-wpa-psk>>.
es: Una vez que se ha seleccionado un punto de acceso, la estación necesita autenticarse antes de que pueda pasar datos. La autenticación se puede hacer de varias maneras. El esquema más común, autenticación abierta, permite a cualquier estación unirse a la red y comunicarse. Esta es la autenticación utilizada para realizar pruebas la primera vez que se configura una red inalámbrica. Otros esquemas requieren que se completen negociaciones criptográficas antes de que los datos puedan fluir, bien utilizando claves o secretos previamente compartidos, o esquemas más completos que involucran servicios de backend como RADIUS. La autenticación abierta es la configuración por defecto. La siguiente configuración más habitual es WPA-PSK, también conocida como WPA Personal, que se describe en <<network-wireless-wpa-wpa-psk>>.
ko: 액세스 포인트를 선택하면 스테이션이 데이터를 전달하기 전에 인증을 받아야 합니다. 인증은 여러 가지 방법으로 이루어질 수 있습니다. 가장 일반적인 방식인 개방형 인증은 모든 스테이션이 네트워크에 참여하여 통신할 수 있도록 허용합니다. 이 인증은 무선 네트워크를 처음 설정할 때 테스트 목적으로 사용하는 인증입니다. 다른 방식은 데이터 트래픽이 흐르기 전에 미리 공유된 키 또는 비밀을 사용하거나 RADIUS와 같은 백엔드 서비스를 포함하는 더 복잡한 방식을 사용하여 암호화 핸드셰이크를 완료해야 합니다. 기본 설정은 개방형 인증입니다. 다음으로 가장 일반적인 설정은 <<network-wireless-wpa-wpa-psk>>에 설명된 WPA 개인이라고도 하는 WPA-PSK입니다.

source: If using an Apple(R) AirPort(R) Extreme base station for an access point, shared-key authentication together with a WEP key needs to be configured. This can be configured in [.filename]#/etc/rc.conf# or by using man:wpa_supplicant[8]. For a single AirPort(R) base station, access can be configured with:
es: Si se usa una estación base Apple(R) AirPort(R) Extreme como punto de acceso, se necesita configurar una clave WEP junto con autenticación de clave compartida. Esto se puede configurar en [.filename]#/etc/rc.conf# o usando man:wpa_supplicant[8]. Para una única estación base AirPort(R), se puede configurar el acceso con:
ko: Apple(R) AirPort(R) Extreme 베이스 스테이션을 액세스 포인트에 사용하는 경우, WEP 키와 함께 공유 키 인증을 구성해야 합니다. 이 구성은 [.filename]#/etc/rc.conf#에서 구성하거나 man:wpa_supplicant[8]를 사용하여 구성할 수 있습니다. 단일 AirPort(R) 베이스 스테이션의 경우 다음을 사용하여 액세스를 구성할 수 있습니다:

source: In general, shared key authentication should be avoided because it uses the WEP key material in a highly-constrained manner, making it even easier to crack the key. If WEP must be used for compatibility with legacy devices, it is better to use WEP with `open` authentication. More information regarding WEP can be found in <<network-wireless-wep>>.
es: En general, se debería evitar utilizar la autenticación de clave compartida porque utiliza la clave WEP de forma muy restringida, haciéndola incluso más fácil de romper. Si se tiene que usar WEP por compatibilidad con dispositivos heredados, es mejor usar WEP con autenticación `open`. Se puede encontrar más información acerca de WEP en <<network-wireless-wep>>.
ko: 일반적으로 공유 키 인증은 WEP 키 자료를 매우 제한적인 방식으로 사용하므로 키를 더 쉽게 해독할 수 있으므로 피해야 합니다. 레거시 장치와의 호환성을 위해 WEP를 사용해야 하는 경우 `open` 인증과 함께 WEP를 사용하는 것이 좋습니다. WEP에 대한 자세한 내용은 <<network-wireless-wep>>에서 확인할 수 있습니다.

source: ====== Getting an IP Address with DHCP
es: ====== Obteniendo una Dirección IP con DHCP
ko: ====== DHCP로 IP 주소 얻기

source: Once an access point is selected and the authentication parameters are set, an IP address must be obtained in order to communicate. Most of the time, the IP address is obtained via DHCP. To achieve that, edit [.filename]#/etc/rc.conf# and add `DHCP` to the configuration for the device:
es: Una vez que se ha seleccionado un punto de acceso y se han configurado los parámetros de autenticación, se necesita obtener una dirección IP para poder comunicarse. La mayoría de las veces la dirección IP se obtiene mediante DHCP. Para conseguirlo, edita [.filename]#/etc/rc.conf# y añade `DHCP` a la configuración del dispositivo:
ko: 액세스 포인트를 선택하고 인증 매개변수를 설정한 후에는 통신을 위해 IP 주소를 얻어야 합니다. 대부분의 경우 IP 주소는 DHCP를 통해 얻습니다. 이를 위해 [.filename]#/etc/rc.conf#를 편집하고 장치 구성에 `DHCP`를 추가합니다:

source: The wireless interface is now ready to bring up:
es: Ahora el interfaz inalámbrico está listo para ser levantado:
ko: 이제 무선 인터페이스를 불러올 준비가 되었습니다:

source: Once the interface is running, use man:ifconfig[8] to see the status of the interface [.filename]#ath0#:
es: Una vez que el interfaz se está ejecutando, utiliza man:ifconfig[8] para ver el estado del interfaz [.filename]#ath0#:
ko: 인터페이스가 실행 중이면 man:ifconfig[8]을 사용하여 인터페이스 [.filename]#ath0#의 상태를 확인합니다:

source: The `status: associated` line means that it is connected to the wireless network. The `bssid 00:13:46:49:41:76` is the MAC address of the access point and `authmode OPEN` indicates that the communication is not encrypted.
es: La línea `status:associated` significa que está conectado a la red inalámbrica. `bssid 00:13:46:49:41:76` es la dirección MAC del punto de acceso y `authmode OPEN` indica que la comunicación no está encriptada.
ko: `status: associated` 줄은 무선 네트워크에 연결되어 있음을 의미합니다. `bssid 00:13:46:49:41:76`은 액세스 포인트의 MAC 주소이며, `authmode OPEN`은 통신이 암호화되지 않았음을 나타냅니다.

source: ====== Static IP Address
es: ====== Dirección IP Estática
ko: ====== 고정 IP 주소

source: If an IP address cannot be obtained from a DHCP server, set a fixed IP address. Replace the `DHCP` keyword shown above with the address information. Be sure to retain any other parameters for selecting the access point:
es: Si no se puede obtener una dirección IP de un servidor DHCP, establece una dirección IP fija. Reemplaza la palabra clave `DHCP` mostrada arriba con la información de la dirección. Asegúrate de mantener cualquier otro parámetro para seleccionar el punto de acceso:
ko: DHCP 서버에서 IP 주소를 얻을 수 없는 경우 고정 IP 주소를 설정합니다. 위에 표시된 `DHCP` 키워드를 주소 정보로 바꿉니다. 액세스 포인트 선택을 위한 다른 매개변수는 그대로 유지하세요:

source: Wi-Fi Protected Access (WPA) is a security protocol used together with 802.11 networks to address the lack of proper authentication and the weakness of WEP. WPA leverages the 802.1X authentication protocol and uses one of several ciphers instead of WEP for data integrity. The only cipher required by WPA is the Temporary Key Integrity Protocol (TKIP). TKIP is a cipher that extends the basic RC4 cipher used by WEP by adding integrity checking, tamper detection, and measures for responding to detected intrusions. TKIP is designed to work on legacy hardware with only software modification. It represents a compromise that improves security but is still not entirely immune to attack. WPA also specifies the AES-CCMP cipher as an alternative to TKIP, and that is preferred when possible. For this specification, the term WPA2 or RSN is commonly used.
es: Wi-Fi Protected Access (WPA) es un protocolo de seguridad utilizado junto a redes 802.11 para atajar la falta de autenticación adecuada y las debilidades de WEP. WPA utiliza el protocolo de autenticación 802.1X y usa uno o varios encriptadores en lugar de WEP para favorecer la integridad de los datos. El único encriptador requerido por WPA es el Temporary Key Integrity Protocol (TKIP). TKIP es un encriptador que extiende el encriptador básico RC4 usado por WEP y le añade comprobación de integridad, detección de modificaciones, y medidas para responder a las intrusiones detectadas. TKIP está diseñado para funcionar en hardware heredado sólo con modificaciones software. Representa un compromiso que mejora la seguridad pero que todavía no es inmune a ataques. WPA también especifica en encriptador AES-CCMP como alternativa TKIP, y es el preferido si es posible. Para esta especificación, los términos WPA2 o RSN se usan comúnmente.
ko: WPA(Wi-Fi Protected Access)는 802.11 네트워크와 함께 사용되는 보안 프로토콜로, 적절한 인증이 부족하고 WEP의 취약점을 해결하기 위해 사용됩니다. WPA는 802.1X 인증 프로토콜을 활용하며 데이터 무결성을 위해 WEP 대신 여러 암호 중 하나를 사용합니다. WPA에서 요구하는 유일한 암호는 임시 키 무결성 프로토콜(Temporary Key Integrity Protocol, TKIP)입니다. TKIP는 무결성 검사, 변조 감지 및 감지된 침입에 대응하기 위한 조치를 추가하여 WEP에서 사용하는 기본 RC4 암호를 확장한 암호입니다. TKIP는 소프트웨어 수정만으로 레거시 하드웨어에서 작동하도록 설계되었습니다. 이는 보안을 개선하기 위한 절충안이지만 여전히 공격으로부터 완전히 자유롭지는 않습니다. WPA는 또한 TKIP의 대안으로 AES-CCMP 암호를 지정하고 있으며, 가능한 경우 이 암호를 선호합니다. 이 사양에서는 WPA2 또는 RSN이라는 용어가 일반적으로 사용됩니다.

source: WPA defines authentication and encryption protocols. Authentication is most commonly done using one of two techniques: by 802.1X and a backend authentication service such as RADIUS, or by a minimal handshake between the station and the access point using a pre-shared secret. The former is commonly termed WPA Enterprise and the latter is known as WPA Personal. Since most people will not set up a RADIUS backend server for their wireless network, WPA-PSK is by far the most commonly encountered configuration for WPA.
es: WPA define protocolos de encriptación y autenticación. La autenticación se hace habitualmente utilizando alguna de estas dos técnicas: usando 802.1X y un servicio de autenticación backend como RADIUS, o mediante una negociación mínima entre la estación y el punto de acceso utilizando un secreto previamente compartido. El primero se suele denominar WPA Enterprise y el segundo se conoce como WPA Personal. Como la mayoría de la gente no configurará un servidor RADIUS como backend para su red inalámbrica, WPA-PSK es de lejos la configuración más habitual para WPA.
ko: WPA는 인증 및 암호화 프로토콜을 정의합니다. 인증은 802.1X 및 RADIUS와 같은 백엔드 인증 서비스 또는 미리 공유한 암호를 사용하여 스테이션과 액세스 포인트 간 최소한의 핸드셰이크를 사용하는 두 가지 기술 중 하나를 사용하여 수행됩니다. 전자는 일반적으로 WPA 엔터프라이즈라고 하고 후자는 WPA 개인이라고 합니다. 대부분의 사람들이 무선 네트워크에 RADIUS 백엔드 서버를 설정하지 않기 때문에 WPA-PSK가 가장 일반적으로 사용되는 WPA 구성입니다.

source: The control of the wireless connection and the key negotiation or authentication with a server is done using man:wpa_supplicant[8]. This program requires a configuration file, [.filename]#/etc/wpa_supplicant.conf#, to run. More information regarding this file can be found in man:wpa_supplicant.conf[5].
es: El control de la conexión wireless y la negociación de la clave o la autenticación con un servidor se realiza utilizando man:wpa_supplicant[8]. Este programa requiere un fichero de configuración, [.filename]#/etc/wpa_supplicant.conf#, para ejecutarse. Se puede encontrar más información acerca de este fichero en man:wpa_supplicant.conf[5].
ko: 무선 연결 제어와 서버와의 키 협상 또는 인증은 man:wpa_supplicant[8]를 사용하여 수행합니다. 이 프로그램을 실행하려면 구성 파일인 [.filename]#/etc/wpa_supplicant.conf#가 필요합니다. 이 파일에 대한 자세한 정보는 man:wpa_supplicant.conf[5]에서 확인할 수 있습니다.

source: WPA-PSK, also known as WPA Personal, is based on a pre-shared key (PSK) which is generated from a given password and used as the master key in the wireless network. This means every wireless user will share the same key. WPA-PSK is intended for small networks where the use of an authentication server is not possible or desired.
es: WPA-PSK, también conocido como WPA Personal, se basa en una clave previamente compartida (PSK) que se genera a partir de una contraseña dada y se usa como clave maestra en la red inalámbrica. Esto significa que cada usuario inalámbrico compartirá la misma clave. WPA-PSK está pensado para redes pequeñas donde el uso de un servidor de autenticación no es posible o deseable.
ko: WPA 개인이라고도 하는 WPA-PSK는 주어진 비밀번호로 생성되어 무선 네트워크에서 마스터 키로 사용되는 사전 공유 키(PSK)를 기반으로 합니다. 즉, 모든 무선 사용자가 동일한 키를 공유하게 됩니다. WPA-PSK는 인증 서버를 사용할 수 없거나 원치 않는 소규모 네트워크를 위한 것입니다.

source: Always use strong passwords that are sufficiently long and made from a rich alphabet so that they will not be easily guessed or attacked.
es: Utiliza siempre contraseñas fuertes que sean suficientemente largas y creadas a partir de un alfabeto rico y que no sean fáciles de adivinar o atacar.
ko: 항상 충분히 길고 다양한 알파벳으로 구성된 강력한 비밀번호를 사용하여 쉽게 추측하거나 공격당하지 않도록 하세요.

source: The first step is the configuration of [.filename]#/etc/wpa_supplicant.conf# with the SSID and the pre-shared key of the network:
es: El primer paso es la configuración de [.filename]#/etc/wpa_supplicant.conf# con el SSID y la clave compartida de la red:
ko: 첫 번째 단계는 네트워크의 SSID와 미리 공유한 키를 사용하여 [.filename]#/etc/wpa_supplicant.conf#을 구성하는 것입니다:

source: Then, in [.filename]#/etc/rc.conf#, indicate that the wireless device configuration will be done with WPA and the IP address will be obtained with DHCP:
es: Luego, en [.filename]#/etc/rc.conf#, indica que la configuración del dispositivo inalámbrico se realizará con WPA y que la dirección IP se obtendrá con DHCP:
ko: 그리고 나서 [.filename]#/etc/rc.conf#에서 무선 장치 구성은 WPA로, IP 주소는 DHCP로 가져올 것을 지정합니다:

source: Then, bring up the interface:
es: Después, levanta la interfaz:
ko: 이제 인터페이스를 불러옵니다:
ru: Затем поднимите интерфейс:

source: Or, try to configure the interface manually using the information in [.filename]#/etc/wpa_supplicant.conf#:
es: O, intenta configurar manualmente la interfaz utilizando la información que hay en [.filename]#/etc/wpa_supplicant.conf#:
ko: 또는 [.filename]#/etc/wpa_supplicant.conf#의 정보를 사용하여 인터페이스를 수동으로 구성해 보세요:

source: The next operation is to launch man:dhclient[8] to get the IP address from the DHCP server:
es: La siguiente operación es lanzar man:dhcliente[8] para obtener una dirección IP del servidor DHCP:
ko: 다음 작업은 man:dhclient[8]를 실행하여 DHCP 서버에서 IP 주소를 가져오는 것입니다:

source: If [.filename]#/etc/rc.conf# has an `ifconfig_wlan0="DHCP"` entry, man:dhclient[8] will be launched automatically after man:wpa_supplicant[8] associates with the access point.
es: Si [.filename]#/etc/rc.conf# tiene una entrada `ifconfig_wlan0="DHCP"`, man:dhcliente[8] se arrancará automáticamente después de que man:wpa_supplicant[8] se asocie al punto de acceso.
ko: [.filename]#/etc/rc.conf#에 `ifconfig_wlan0="DHCP"` 항목이 있는 경우, man:wpa_supplicant[8]가 액세스 포인트와 연결되면 man:dhclient[8]가 자동으로 시작됩니다.

source: If DHCP is not possible or desired, set a static IP address after man:wpa_supplicant[8] has authenticated the station:
es: Si no es posible o deseable utilizar DHCP, establece una dirección IP estática después de que man:wpa_supplicant[8] haya autenticado la estación:
ko: DHCP를 사용할 수 없거나 원하지 않는 경우, man:wpa_supplicant[8]가 스테이션을 인증한 후 고정 IP 주소를 설정합니다:

source: When DHCP is not used, the default gateway and the nameserver also have to be manually set:
es: Cuando no se usa DHCP, el gateway por defecto y el servidor de nombres se tienen que establecer manualmente:
ko: DHCP를 사용하지 않는 경우 기본 게이트웨이와 네임서버도 수동으로 설정해야 합니다:

source: ====== WPA with EAP-TLS
es: ====== WPA con EAP-TLS
ko: ====== EAP-TLS를 사용한 WPA

source: The second way to use WPA is with an 802.1X backend authentication server. In this case, WPA is called WPA Enterprise to differentiate it from the less secure WPA Personal. Authentication in WPA Enterprise is based on the Extensible Authentication Protocol (EAP).
es: La segunda forma de utilizar WPA es con un servidor de autenticación 802.1X. En este caso, WPA se llama WPA Enterprise para diferenciarlo del WPA Personal menos seguro. La autenticación en WPA Enterprise se basa en el Extensible Authentication Protocol (EAP).
ko: 두 번째 WPA 사용 방법은 802.1X 백엔드 인증 서버를 사용하는 것입니다. 이 경우 보안 수준이 낮은 WPA 개인과 구분하기 위해 WPA를 WPA 엔터프라이즈라고 합니다. WPA Enterprise의 인증은 확장 가능한 인증 프로토콜(Extensible Authentication Protocol, EAP)을 기반으로 합니다.
ru: Второй способ использования WPA — с сервером аутентификации 802.1X. В этом случае WPA называется WPA Enterprise, чтобы отличать его от менее безопасного WPA Personal. Аутентификация в WPA Enterprise основана на расширяемом протоколе аутентификации (EAP).

source: EAP does not come with an encryption method. Instead, EAP is embedded inside an encrypted tunnel. There are many EAP authentication methods, but EAP-TLS, EAP-TTLS, and EAP-PEAP are the most common.
es: EAP no viene con un método de encriptación. En su lugar, EAP se introduce dentro de un túnel encriptado. Hay muchos métodos de autenticación EAP, pero EAP-TLS, EAP-TTLS, y EAP-PEAP son los más comunes.
ko: EAP에는 암호화 방법이 제공되지 않습니다. 대신 EAP는 암호화된 터널 안에 내장되어 있습니다. EAP 인증 방법에는 여러 가지가 있지만 EAP-TLS, EAP-TTLS 및 EAP-PEAP가 가장 일반적입니다.
ru: EAP не включает в себя метод шифрования. Вместо этого EAP встраивается в зашифрованный туннель. Существует множество методов аутентификации EAP, но наиболее распространены EAP-TLS, EAP-TTLS и EAP-PEAP.

source: EAP with Transport Layer Security (EAP-TLS) is a well-supported wireless authentication protocol since it was the first EAP method to be certified by the http://www.wi-fi.org/[Wi-Fi Alliance]. EAP-TLS requires three certificates to run: the certificate of the Certificate Authority (CA) installed on all machines, the server certificate for the authentication server, and one client certificate for each wireless client. In this EAP method, both the authentication server and wireless client authenticate each other by presenting their respective certificates, and then verify that these certificates were signed by the organization's CA.
es: EAP con Transport Layer Security (EAP-TLS) es un protocolo de autenticación inalámbrica bien soportado ya que fue el primer método EAP certificado por la http://www.wi-fi.org/[Wi-Fi Alliance]. EAP-TLS requiere tres certificados para funcionar: el certificado de Certificate Authority (CA) instalado en todas las máquinas, el certificado de servidor para el servidor de autenticación, y un cliente de certificado para cliente inalámbrico. En este método EAP, tanto el servidor de autenticación como el cliente inalámbrico se autentican entre sí presentando sus respectivos certificados, y luego verificando que estos certificados están firmados por la CA de la organización.
ko: EAP-TLS(전송 계층 보안을 사용한 EAP)는 http://www.wi-fi.org/[Wi-Fi Alliance]에서 인증한 최초의 EAP 방법이기 때문에 널리 지원되는 무선 인증 프로토콜입니다. EAP-TLS를 실행하려면 모든 컴퓨터에 설치된 CA(인증 기관)의 인증서, 인증 서버에 대한 서버 인증서, 각 무선 클라이언트에 대한 클라이언트 인증서 등 세 개의 인증서가 필요합니다. 이 EAP 방식에서는 인증 서버와 무선 클라이언트가 각각의 인증서를 제시하여 서로를 인증한 다음, 이 인증서가 조직의 CA에 의해 서명되었는지 확인합니다.
ru: EAP с защитой на транспортном уровне (EAP-TLS) — это широко поддерживаемый протокол аутентификации беспроводных сетей, так как он был первым методом EAP, сертифицированным http://www.wi-fi.org/[Альянсом Wi-Fi]. Для работы EAP-TLS требуется три сертификата: сертификат центра сертификации (CA), установленный на всех машинах, сертификат сервера для сервера аутентификации и один клиентский сертификат для каждого беспроводного клиента. В этом методе EAP и сервер аутентификации, и беспроводной клиент аутентифицируют друг друга, предоставляя свои соответствующие сертификаты, а затем проверяют, что эти сертификаты были подписаны CA организации.

source: As previously, the configuration is done via [.filename]#/etc/wpa_supplicant.conf#:
es: Como antes, la configuración se hace mediante [.filename]#/etc/wpa_supplicant.conf#:
ko: 이전과 마찬가지로 [.filename]#/etc/wpa_supplicant.conf#를 통해 구성을 수행합니다:
ru: Как и ранее, настройка выполняется через [.filename]#/etc/wpa_supplicant.conf#:

source: This field indicates the network name (SSID).
es: Este campo indica el nombre de la red (SSID).
ko: 이 필드는 네트워크 이름(SSID)을 나타냅니다.
ru: Это поле указывает имя сети (SSID).

source: This example uses the RSN IEEE(R) 802.11i protocol, also known as WPA2.
es: Este ejemplo utiliza el protocolo RSN IEEE(R) 802.11i también conocido como WPA2.
ko: 이 예에서는 WPA2라고도 하는 RSN IEEE(R) 802.11i 프로토콜을 사용합니다.
ru: Этот пример использует протокол RSN IEEE(R) 802.11i, также известный как WPA2.

source: The `key_mgmt` line refers to the key management protocol to use. In this example, it is WPA using EAP authentication.
es: La línea `key_mgmt` hace referencia al protocolo de gestión de claves que se utiliza. En este ejemplo, es WPA con autenticación EAP.
ko: `key_mgmt` 줄은 사용할 키 관리 프로토콜을 나타냅니다. 이 예에서는 EAP 인증을 사용하는 WPA입니다.
ru: Строка `key_mgmt` указывает на используемый протокол управления ключами. В данном примере это WPA с аутентификацией EAP.

source: This field indicates the EAP method for the connection.
es: Este campo indica el método EAP para la conexión.
ko: 이 필드는 EAP 연결방법을 나타냅니다.
ru: Это поле указывает метод EAP для подключения.
