Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: In this example, man:rfcomm_pppd[8] is used to open a connection to a remote device with a `BD_ADDR` of `00:80:37:29:19:a4` on a DUNRFCOMM channel:
es: En este ejemplo, se usa man:rfcomm_pppd[8] para abrir una conexión con un dispositivo remoto con un `BD_ADDR` de `00:80:37:29:19:a4` en un canal DUNRFCOMM:
ko: 이 예제에서는 man:rfcomm_pppd[8]을 사용하여 `BD_ADDR`이 `00:80:37:29:19:a4`인 DUNRFCOMM 채널에서 원격 장치에 대한 연결을 엽니다:
ru: В этом примере man:rfcomm_pppd[8] используется для открытия соединения с удалённым устройством с `BD_ADDR` `00:80:37:29:19:a4` на DUNRFCOMM канале:

source: The actual channel number will be obtained from the remote device using the SDP protocol. It is possible to specify the RFCOMM channel by hand, and in this case man:rfcomm_pppd[8] will not perform the SDP query. Use man:sdpcontrol[8] to find out the RFCOMM channel on the remote device.
es: El número de canal real se obtendrá del dispositivo remoto usando el protocolo SDP. Es posible especificar el canal RFCOMM a mano, y en este caso man:rfcomm_pppd[8] no realizará la consulta SDP. Usa man:sdpcontrol[8] para averiguar el canal RFCOMM en el dispositivo remoto.
ko: 실제 채널 번호는 SDP 프로토콜을 사용하여 원격 장치에서 얻습니다. 수동으로 RFCOMM 채널을 지정할 수 있으며, 이 경우 man:rfcomm_pppd[8]는 SDP 쿼리를 수행하지 않습니다. 원격 장치에서 RFCOMM 채널을 찾으려면 man:sdpcontrol[8]을 사용합니다.
ru: Фактический номер канала будет получен с удаленного устройства с использованием протокола SDP. Можно указать канал RFCOMM вручную, и в этом случае man:rfcomm_pppd[8] не будет выполнять запрос SDP. Используйте man:sdpcontrol[8], чтобы узнать канал RFCOMM на удаленном устройстве.

source: In order to provide network access with the PPPLAN service, man:sdpd[8] must be running and a new entry for LAN clients must be created in [.filename]#/etc/ppp/ppp.conf#. Consult man:rfcomm_pppd[8] for examples. Finally, start the RFCOMMPPP server on a valid RFCOMM channel number. The RFCOMMPPP server will automatically register the Bluetooth LAN service with the local SDP daemon. The example below shows how to start the RFCOMMPPP server.
es: Para proporcionar acceso a la red con el servicio PPPLAN, se debe estar ejecutando man:sdpd[8] y se tienen que crear una nueva entrada para clientes LAN en [.filename]#/etc/ppp/ppp.conf#. Consulta man:rfcomm_pppd[8] para ver ejemplos. Finalmente, arrancar el servidor RFCOMMPPP en un número de canal RFCOMM válido. El servidor RFCOMMPPP registrará automáticamente el servicio LAN Bluetooth con el demonio SDP local. El ejemplo de abajo muestra cómo arrancar el servidor RFCOMMPPP.
ko: PPPLAN 서비스로 네트워크 액세스를 제공하려면 man:sdpd[8]가 실행 중이어야 하고 [.filename]#/etc/ppp/ppp.conf#에 LAN 클라이언트를 위한 새 항목을 만들어야 합니다. 예제는 man:rfcomm_pppd[8]을 참조하세요. 마지막으로, 유효한 RFCOMM 채널 번호에서 RFCOMMPPP 서버를 시작합니다. RFCOMMPPP 서버는 로컬 SDP 데몬에 블루투스 LAN 서비스를 자동으로 등록합니다. 아래 예제는 RFCOMMPPP 서버를 시작하는 방법을 보여줍니다.
ru: Для предоставления сетевого доступа через службу PPPLAN необходимо, чтобы работал man:sdpd[8], и была создана новая запись для клиентов LAN в файле [.filename]#/etc/ppp/ppp.conf#. Примеры можно найти в man:rfcomm_pppd[8]. Наконец, запустите сервер RFCOMMPPP на допустимом номере канала RFCOMM. Сервер RFCOMMPPP автоматически зарегистрирует службу Bluetooth LAN в локальном демоне SDP. В приведенном ниже примере показано, как запустить сервер RFCOMMPPP.

source: Bluetooth Protocols
es: Protocolos Bluetooth
ko: 블루투스 프로토콜
ru: Протоколы Bluetooth

source: This section provides an overview of the various Bluetooth protocols, their function, and associated utilities.
es: Esta sección proporciona un resumen de varios protocolos Bluetooth, sus funciones, y sus utilidades asociadas.
ko: 이 섹션에서는 다양한 Bluetooth 프로토콜, 해당 기능 및 관련 유틸리티에 대한 개요를 제공합니다.
ru: Этот раздел предоставляет обзор различных протоколов Bluetooth, их функций и связанных с ними утилит.

source: The Logical Link Control and Adaptation Protocol (L2CAP) provides connection-oriented and connectionless data services to upper layer protocols. L2CAP permits higher level protocols and applications to transmit and receive L2CAP data packets up to 64 kilobytes in length.
es: El Logical Link Control and Adaptation Protocol (L2CAP) proporciona servicios de datos orientados a conexión así como no orientados a conexión a los protocolos de las capas superiores. L2CAP permite a los protocolos y aplicaciones de niveles más altos transmitir y recibir paquetes de datos L2CAP de hasta 64 kilobytes de longitud.
ko: L2CAP(Logical Link Control and Adaptation Protocol)은 상위 계층 프로토콜에 연결 지향적이고 연결이 필요 없는 데이터 서비스를 제공합니다. L2CAP를 사용하면 상위 계층 프로토콜과 애플리케이션이 최대 64킬로바이트 길이의 L2CAP 데이터 패킷을 송수신할 수 있습니다.
ru: Протокол управления логическим соединением и адаптации (L2CAP) предоставляет сервисы передачи данных с установлением соединения и без него для протоколов верхнего уровня. L2CAP позволяет протоколам более высокого уровня и приложениям передавать и принимать пакеты данных L2CAP размером до 64 килобайт.

source: L2CAP is based around the concept of _channels_. A channel is a logical connection on top of a baseband connection, where each channel is bound to a single protocol in a many-to-one fashion. Multiple channels can be bound to the same protocol, but a channel cannot be bound to multiple protocols. Each L2CAP packet received on a channel is directed to the appropriate higher level protocol. Multiple channels can share the same baseband connection.
es: L2CAP se basa en el concepto de _canales_. Un canal es una conexión lógica construida sobre una conexión de banda base, donde cada canal está asociado a un sólo protocolo en una forma muchos-a-uno. Se pueden asociar múltiples canales al mismo protocolo, pero un canal no se puede asociar a múltiples protocolos. Cada paquete L2CAP recibido en un canal es redirigido al protocolo de nivel superior apropiado. Varios canales pueden compartir la misma conexión de banda base.
ko: L2CAP은 _채널_이라는 개념을 기반으로 합니다. 채널은 베이스밴드 연결 위에 있는 논리적 연결로, 각 채널은 다대일 방식으로 단일 프로토콜에 바인딩됩니다. 여러 채널이 동일한 프로토콜에 바인딩될 수는 있지만, 하나의 채널이 여러 프로토콜에 바인딩될 수는 없습니다. 채널에서 수신되는 각 L2CAP 패킷은 적절한 상위 레벨 프로토콜로 전달됩니다. 여러 채널이 동일한 베이스밴드 연결을 공유할 수 있습니다.
ru: L2CAP основан на концепции _каналов_. Канал — это логическое соединение поверх базового соединения, где каждый канал связан с одним протоколом по принципу "многие к одному". Несколько каналов могут быть связаны с одним и тем же протоколом, но канал не может быть связан с несколькими протоколами. Каждый полученный L2CAP-пакет на канале направляется соответствующему протоколу более высокого уровня. Несколько каналов могут совместно использовать одно и то же базовое соединение.

source: In FreeBSD, a netgraph L2CAP node is created for each Bluetooth device. This node is normally connected to the downstream Bluetooth HCI node and upstream Bluetooth socket nodes. The default name for the L2CAP node is "devicel2cap". For more details refer to man:ng_l2cap[4].
es: En FreeBSD, se crear un nodo L2CAP de netgraph para cada dispositivo Bluetooth. Este nodo normalmente se conecta con el nodo HCI Bluetooth inferior y los nodos socket Bluetooth superiores. El nombre por defecto para el nodo L2CAP es "devicel2cap". Para más detalles consulta man:ng_l2cap[4].
ko: FreeBSD에서는 각 블루투스 장치에 대해 netgraph L2CAP 노드가 생성됩니다. 이 노드는 일반적으로 다운스트림 블루투스 HCI 노드 및 업스트림 블루투스 소켓 노드에 연결됩니다. L2CAP 노드의 기본 이름은 "devicel2cap"입니다. 자세한 내용은 man:ng_l2cap[4]를 참조하세요.
ru: В FreeBSD для каждого устройства Bluetooth создается узел netgraph типа L2CAP. Этот узел обычно соединен с нижестоящим узлом Bluetooth HCI и вышестоящими узлами Bluetooth-сокет. По умолчанию узел L2CAP имеет имя "devicel2cap". Для получения дополнительной информации обратитесь к man:ng_l2cap[4].

source: A useful command is man:l2ping[8], which can be used to ping other devices. Some Bluetooth implementations might not return all of the data sent to them, so `0 bytes` in the following example is normal.
es: Un comando útil es man:l2ping[8], que puede ser usado para hacer ping a otros dispositivos. Algunas implementaciones Bluetooth podrían no devolver todos los datos que se les envía, de forma que los `0 bytes` en el siguiente ejemplo es algo normal.
ko: 유용한 명령은 man:l2ping[8]으로, 다른 장치를 핑하는 데 사용할 수 있습니다. 일부 블루투스 구현은 전송된 모든 데이터를 반환하지 않을 수 있으므로 다음 예제에서 `0 bytes`는 정상입니다.
ru: Полезной командой является man:l2ping[8], которую можно использовать для проверки связи с другими устройствами. Некоторые реализации Bluetooth могут не возвращать все отправленные им данные, поэтому `0 байт` в следующем примере является нормой.

source: The man:l2control[8] utility is used to perform various operations on L2CAP nodes. This example shows how to obtain the list of logical connections (channels) and the list of baseband connections for the local device:
es: La utilidad man:l2control[8] se utiliza para realizar varias operaciones sobre los nodos L2CAP. Este ejemplo muestra cómo obtener la lista de conexiones lógicas (canales) y la lista de conexiones de banda base para el dispositivo local:
ko: man:l2control[8] 유틸리티는 L2CAP 노드에서 다양한 작업을 수행하는 데 사용됩니다. 이 예는 로컬 장치에 대한 논리적 연결(채널) 목록과 베이스밴드 연결 목록을 가져오는 방법을 보여줍니다:
ru: Утилита man:l2control[8] используется для выполнения различных операций с узлами L2CAP. Этот пример показывает, как получить список логических соединений (каналов) и список базовых соединений для локального устройства:

source: Another diagnostic tool is man:btsockstat[1]. It is similar to man:netstat[1], but for Bluetooth network-related data structures. The example below shows the same logical connection as man:l2control[8] above.
es: Otra herramienta de diagnóstico es man:btsockstat[1]. Es similar a man:netstat[1], pero para estructuras de datos de red Bluetooth. El ejemplo de abajo muestra la misma conexión lógica como man:l2control[8] arriba.
ko: 또 다른 진단 도구는 man:btsockstat[1]입니다. man:netstat[1]과 유사하지만 블루투스 네트워크 관련 데이터 구조에 대한 것입니다. 아래 예는 위의 man:l2control[8]과 동일한 논리적 연결을 보여줍니다.
ru: Еще один инструмент диагностики — man:btsockstat[1]. Он похож на man:netstat[1], но предназначен для структур данных, связанных с Bluetooth-сетями. В примере ниже показано то же логическое соединение, что и в man:l2control[8] выше.

source: Radio Frequency Communication (RFCOMM)
es: Comunicación por Radio Frecuencia (RFCOMM)
ko: 무선 주파수 통신(RFCOMM)
ru: Радиочастотная связь (RFCOMM)

source: The RFCOMM protocol provides emulation of serial ports over the L2CAP protocol. RFCOMM is a simple transport protocol, with additional provisions for emulating the 9 circuits of RS-232 (EIATIA-232-E) serial ports. It supports up to 60 simultaneous connections (RFCOMM channels) between two Bluetooth devices.
es: El protocolo RFCOMM proporciona emulación de puertos serie sobre el protocolo L2CAP. RFCOMM es un protocolo de transporte simple, con soporte adicional para emular los 9 circuitos de los puertos serie RS-2332 (EIATIA-232-E). Soporta hasta 60 conexiones simultáneas (canales RFCOMM) entre dos dispositivos Bluetooth.
ko: RFCOMM 프로토콜은 L2CAP 프로토콜을 통해 직렬 포트 에뮬레이션을 제공합니다. RFCOMM은 간단한 전송 프로토콜로, RS-232(EIATIA-232-E) 직렬 포트의 9개 회로를 에뮬레이션하기 위한 추가 조항이 있습니다. 두 개의 Bluetooth 장치 간에 최대 60개의 동시 연결(RFCOMM 채널)을 지원합니다.
ru: Протокол RFCOMM обеспечивает эмуляцию последовательных портов поверх протокола L2CAP. RFCOMM — это простой транспортный протокол с дополнительными возможностями для эмуляции 9 последовательных портов RS-232 (EIATIA-232-E). Он поддерживает до 60 одновременных соединений (каналов RFCOMM) между двумя устройствами Bluetooth.

source: For the purposes of RFCOMM, a complete communication path involves two applications running on the communication endpoints with a communication segment between them. RFCOMM is intended to cover applications that make use of the serial ports of the devices in which they reside. The communication segment is a direct connect Bluetooth link from one device to another.
es: Para los propósitos de RFCOMM, un camino de comunicación completo incluye dos aplicaciones ejecutándose en los extremos de la comunicación con un segmento de comunicación entre ellos. RFCOMM está pensado para cubrir aplicaciones que hace uso de los puertos serie de los dispositivos en los que se encuentra. El segmento de comunicación es una enlace de conexión Bluetooth directa desde un dispositivo a otro.
ko: RFCOMM의 목적상, 완전한 통신 경로에는 통신 엔드포인트에서 실행되는 두 개의 애플리케이션과 그 사이에 통신 세그먼트가 포함됩니다. RFCOMM은 해당 애플리케이션이 상주하는 장치의 직렬 포트를 사용하는 애플리케이션을 다루기 위한 것입니다. 통신 세그먼트는 한 장치에서 다른 장치로 직접 연결되는 Bluetooth 링크입니다.
ru: Для целей RFCOMM полный путь передачи данных включает два приложения, работающие на конечных точках соединения, и сегмент передачи данных между ними. RFCOMM предназначен для приложений, использующих последовательные порты устройств, в которых они работают. Сегмент передачи данных представляет собой прямое Bluetooth-соединение между устройствами.

source: RFCOMM is only concerned with the connection between the devices in the direct connect case, or between the device and a modem in the network case. RFCOMM can support other configurations, such as modules that communicate via Bluetooth wireless technology on one side and provide a wired interface on the other side.
es: RFCOMM sólo se preocupa de la conexión entre los dispositivos en el caso de una conexión directa, o entre un dispositivo y un módem en el caso de red. RFCOMM puede soportar otras configuraciones, como módulos que se comunican vía tecnología inalámbrica Bluetooth en un lado y proporciona un interfaz por cable en el otro lado.
ko: RFCOMM은 직접 연결 케이스의 장치 간 연결 또는 네트워크 케이스의 장치와 모뎀 간 연결에만 관련됩니다. RFCOMM은 한쪽에서는 블루투스 무선 기술을 통해 통신하고 다른 쪽에서는 유선 인터페이스를 제공하는 모듈과 같은 다른 구성을 지원할 수 있습니다.
ru: RFCOMM занимается только соединением между устройствами в случае прямого подключения или между устройством и модемом в случае сетевого подключения. RFCOMM может поддерживать другие конфигурации, такие как модули, которые обмениваются данными через технологию беспроводной связи Bluetooth с одной стороны и предоставляют проводной интерфейс с другой стороны.

source: In FreeBSD, RFCOMM is implemented at the Bluetooth sockets layer.
es: En FreeBSD, RFCOMM está implementado en la capa de sockets Bluetooth.
ko: FreeBSD에서 RFCOMM은 블루투스 소켓 계층에서 구현됩니다.
ru: В FreeBSD RFCOMM реализован на уровне сокетов Bluetooth.

source: Service Discovery Protocol (SDP)
es: Protocolo de Descubrimiento de Servicios (SDP)
ko: 서비스 검색 프로토콜 (Service Discovery Protocol, SDP)
ru: Протокол обнаружения служб (SDP)

source: The Service Discovery Protocol (SDP) provides the means for client applications to discover the existence of services provided by server applications as well as the attributes of those services. The attributes of a service include the type or class of service offered and the mechanism or protocol information needed to utilize the service.
es: El Protocolo de Descubrimiento de Servicios (SDP) proporciona los medios para que las aplicaciones cliente descubran la existencia de servicios proporcionados por aplicaciones servidoras así como los atributos de dichos servicios. Los atributos de un servicio incluyen el tipo o clase del servicio ofrecido y el mecanismo o protocolo de información necesario para utilizarlo.
ko: 서비스 검색 프로토콜(SDP)은 클라이언트 애플리케이션이 서버 애플리케이션이 제공하는 서비스의 존재와 해당 서비스의 속성을 검색할 수 있는 수단을 제공합니다. 서비스의 속성에는 제공되는 서비스의 유형 또는 클래스, 서비스를 활용하는 데 필요한 메커니즘 또는 프로토콜 정보가 포함됩니다.
ru: Протокол обнаружения служб (SDP) предоставляет клиентским приложениям возможность обнаруживать существование служб, предоставляемых серверными приложениями, а также атрибуты этих служб. Атрибуты службы включают тип или класс предоставляемой службы, а также информацию о механизме или протоколе, необходимую для использования службы.

source: SDP involves communication between a SDP server and a SDP client. The server maintains a list of service records that describe the characteristics of services associated with the server. Each service record contains information about a single service. A client may retrieve information from a service record maintained by the SDP server by issuing a SDP request. If the client, or an application associated with the client, decides to use a service, it must open a separate connection to the service provider in order to utilize the service. SDP provides a mechanism for discovering services and their attributes, but it does not provide a mechanism for utilizing those services.
es: SDP incluye comunicación entre un servidor SDP y un cliente SDP. El servidor mantiene una lista de registros de servicio que describe las características de los servicios asociados con el servidor. Cada registro de servicio contiene información acerca de un único servicio. Un cliente puede recuperar información de un registro de servicio mantenido por el servidor SDP realizando una petición SDP. Si el cliente, o una aplicación asociada con el cliente, decide usar un servicio, debe abrir una conexión separada con el proveedor del servicio para poder utilizarlo. SDP proporciona un mecanismo para descubrir servicios y sus atributos, pero no proporciona un mecanismo para utilizar esos servicios.
ko: SDP는 SDP 서버와 SDP 클라이언트 간의 통신을 포함합니다. 서버는 서버와 관련된 서비스의 특성을 설명하는 서비스 레코드 목록을 유지 관리합니다. 각 서비스 레코드에는 단일 서비스에 대한 정보가 포함되어 있습니다. 클라이언트는 SDP 요청을 실행하여 SDP 서버가 유지 관리하는 서비스 레코드에서 정보를 검색할 수 있습니다. 클라이언트 또는 클라이언트와 연결된 애플리케이션이 서비스를 이용하고자 하는 경우, 해당 서비스를 이용하기 위해서는 서비스 제공업체에 별도의 연결을 개설해야 합니다. SDP는 서비스 및 해당 속성을 검색하는 메커니즘을 제공하지만 해당 서비스를 활용하는 메커니즘은 제공하지 않습니다.
ru: SDP включает взаимодействие между сервером SDP и клиентом SDP. Сервер хранит список записей служб, которые описывают характеристики служб, связанных с сервером. Каждая запись службы содержит информацию об отдельной службе. Клиент может получить информацию из записи службы, хранящейся на сервере SDP, отправив запрос SDP. Если клиент или приложение, связанное с клиентом, решает использовать службу, он должен установить отдельное соединение с провайдером службы для её использования. SDP предоставляет механизм для обнаружения служб и их атрибутов, но не предоставляет механизма для использования этих служб.

source: Normally, a SDP client searches for services based on some desired characteristics of the services. However, there are times when it is desirable to discover which types of services are described by an SDP server's service records without any prior information about the services. This process of looking for any offered services is called _browsing_.
es: Normalmente, un cliente SDP busca servicios basándose en alguna característica deseada de los servicios. Sin embargo, a veces es preferible descubrir qué tipos de servicios están descritos por los registros de servicio de un servidor SDP sin ninguna información previa acerca de los servicios. Este proceso de buscar cualquier servicio ofrecido se llama _navegación_ (browsing).
ko: 일반적으로 SDP 클라이언트는 원하는 서비스 특성을 기반으로 서비스를 검색합니다. 그러나 서비스에 대한 사전 정보 없이 SDP 서버의 서비스 레코드에 기술된 서비스 유형을 검색하는 것이 바람직한 경우가 있습니다. 제공되는 서비스를 찾는 이 과정을 _브라우징_이라고 합니다.
ru: Обычно клиент SDP ищет услуги на основе определённых желаемых характеристик. Однако бывают случаи, когда необходимо обнаружить, какие типы услуг описаны в записях сервера SDP без какой-либо предварительной информации об этих услугах. Этот процесс поиска любых предлагаемых услуг называется _обзором (browsing)_.

source: The Bluetooth SDP server, man:sdpd[8], and command line client, man:sdpcontrol[8], are included in the standard FreeBSD installation. The following example shows how to perform a SDP browse query.
es: El servidor SDP Bluetooth, man:sdpd[8], y cliente en línea de comando, man:sdpcontrol[8], están incluidos en la instalación estándar de FreeBSD. El siguiente ejemplo muestra cómo realizar una petición de navegación SDP.
ko: 블루투스 SDP 서버인 man:sdpd[8]와 명령줄 클라이언트인 man:sdpcontrol[8]은 표준 FreeBSD 설치에 포함되어 있습니다. 다음 예제는 SDP 찾아보기 쿼리를 수행하는 방법을 보여줍니다.
ru: Сервер Bluetooth SDP, man:sdpd[8], и клиент командной строки — man:sdpcontrol[8], включены в стандартную установку FreeBSD. В следующем примере показано, как выполнить запрос обзора SDP.

source: Note that each service has a list of attributes, such as the RFCOMM channel. Depending on the service, the user might need to make note of some of the attributes. Some Bluetooth implementations do not support service browsing and may return an empty list. In this case, it is possible to search for the specific service. The example below shows how to search for the OBEX Object Push (OPUSH) service:
es: Ten en cuenta que cada servicio tiene una lista de atributos, como el canal RFCOMM. Dependiendo del servicio, el usuario podría necesitar anotar algunos de los atributos. Algunas implementaciones de Bluetooth no soportan la navegación de servicios y podrían devolver una lista vacía. En este caso, es posible buscar un servicio específico. El ejemplo inferior muestra cómo buscar el servicio OBEX Object Push (OPUSH):
ko: 각 서비스에는 RFCOMM 채널과 같은 속성 목록이 있다는 점에 유의하세요. 서비스에 따라 사용자가 일부 속성을 메모해 두어야 할 수도 있습니다. 일부 블루투스 구현은 서비스 검색을 지원하지 않으며 빈 목록을 반환할 수 있습니다. 이 경우 특정 서비스를 검색할 수 있습니다. 아래 예는 OBEX 객체 푸시(OPUSH) 서비스를 검색하는 방법을 보여줍니다:
ru: Обратите внимание, что каждая служба имеет список атрибутов, таких как канал RFCOMM. В зависимости от службы пользователю может потребоваться запомнить некоторые из атрибутов. Некоторые реализации Bluetooth не поддерживают обзор служб и могут возвращать пустой список. В этом случае можно выполнить поиск конкретной службы. В примере ниже показано, как выполнить поиск службы OBEX Object Push (OPUSH):

source: Offering services on FreeBSD to Bluetooth clients is done with the man:sdpd[8] server. The following line can be added to [.filename]#/etc/rc.conf#:
es: Ofrecer servicios de FreeBSD a clientes Bluetooth se hace con el servidor man:sdpd[8]. Se puede añadir la siguiente línea a [.filename]#/etc/rc.conf#:
ko: FreeBSD에서 블루투스 클라이언트에 서비스를 제공하는 것은 man:sdpd[8] 서버를 사용하여 수행합니다. 다음 줄을 [.filename]#/etc/rc.conf#에 추가할 수 있습니다:
ru: Предоставление услуг на FreeBSD клиентам Bluetooth осуществляется с помощью сервера man:sdpd[8]. Следующую строку можно добавить в [.filename]#/etc/rc.conf#:

source: Then the man:sdpd[8] daemon can be started with:
es: El demonio man:sdpd[8] se puede arrancar con:
ko: 이제 다음 명령으로 man:sdpd[8] 데몬을 시작할 수 있습니다:
ru: Затем демон man:sdpd[8] можно запустить с помощью:

source: The local server application that wants to provide a Bluetooth service to remote clients will register the service with the local SDP daemon. An example of such an application is man:rfcomm_pppd[8]. Once started, it will register the Bluetooth LAN service with the local SDP daemon.
es: La aplicación servidora local que quiera proporcionar un servicio Bluetooth a clientes remotos registrará el servicio en el demonio SDP local. Un ejemplo de dicha aplicación es man:rfcomm_pppd[8]. Una vez iniciado, registrará el servicio LAN Bluetooth con el demonio local SDP.
ko: 원격 클라이언트에 블루투스 서비스를 제공하려는 로컬 서버 애플리케이션은 로컬 SDP 데몬에 서비스를 등록합니다. 이러한 애플리케이션의 예는 man:rfcomm_pppd[8]입니다. 일단 시작되면 로컬 SDP 데몬에 블루투스 LAN 서비스를 등록합니다.
ru: Локальное серверное приложение, которое хочет предоставить сервис Bluetooth удалённым клиентам, зарегистрирует сервис в локальном демоне SDP. Примером такого приложения является man:rfcomm_pppd[8]. После запуска оно зарегистрирует сервис Bluetooth LAN в локальном демоне SDP.

source: The list of services registered with the local SDP server can be obtained by issuing a SDP browse query via the local control channel:
es: Se puede obtener la lista de servicios registrados en el servidor SDP local realizando una petición de navegación SDP mediante el canal de control local:
ko: 로컬 SDP 서버에 등록된 서비스 목록은 로컬 제어 채널을 통해 SDP 찾아보기 쿼리를 실행하여 얻을 수 있습니다:
ru: Список служб, зарегистрированных на локальном сервере SDP, можно получить, выполнив запрос обзора SDP через локальный управляющий канал:
