Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: Object Exchange (OBEX) is a widely used protocol for simple file transfers between mobile devices. Its main use is in infrared communication, where it is used for generic file transfers between notebooks or PDAs, and for sending business cards or calendar entries between cellular phones and other devices with Personal Information Manager (PIM) applications.
es: Object Exchange (OBEX) es un protocolo ampliamente utilizado para transferencias de ficheros sencillas entre dispositivos móviles. Su principal uso está en la comunicación infrarroja, donde se usa para transferencias de ficheros genéricas entre portátiles o PDAs, y para enviar tarjetas de negocios o entradas de calendario entre teléfonos móviles y otros dispositivos con aplicaciones PIM (Personal Information Manager).
ko: OBEX(Object Exchange)는 모바일 장치 간의 간단한 파일 전송을 위해 널리 사용되는 프로토콜입니다. 주로 적외선 통신에 사용되며, 노트북이나 PDA 간의 일반적인 파일 전송과 개인 정보 관리자(PIM) 애플리케이션이 설치된 휴대폰과 기타 장치 간에 명함이나 캘린더 항목을 전송하는 데 사용됩니다.
ru: Обмен объектами (OBEX) — это широко используемый протокол для простой передачи файлов между мобильными устройствами. Основное применение он находит в инфракрасной связи, где используется для передачи файлов общего назначения между ноутбуками или КПК, а также для отправки визитных карточек или записей календаря между сотовыми телефонами и другими устройствами с приложениями для управления персональной информацией (PIM).

source: The OBEX server and client are implemented by obexapp, which can be installed using the package:comms/obexapp[] package or port.
es: El servidor y cliente OBEX están implementados por obexapp, que se pude instalar usando el paquete o port package:comms/obexapp[].
ko: OBEX 서버와 클라이언트는 obexapp에 의해 구현되며, package:comms/obexapp[] 패키지 또는 포트를 사용하여 설치할 수 있습니다.
ru: Сервер и клиент OBEX реализованы в obexapp, который можно установить с помощью package:comms/obexapp[] или порта.

source: The OBEX client is used to push and/or pull objects from the OBEX server. An example object is a business card or an appointment. The OBEX client can obtain the RFCOMM channel number from the remote device via SDP. This can be done by specifying the service name instead of the RFCOMM channel number. Supported service names are: `IrMC`, `FTRN`, and `OPUSH`. It is also possible to specify the RFCOMM channel as a number. Below is an example of an OBEX session where the device information object is pulled from the cellular phone, and a new object, the business card, is pushed into the phone's directory.
es: El cliente OBEX es utilizado para subir y/o bajar objetos del servidor OBEX. Un objeto de ejemplo es una tarjeta de negocio o una cita. El cliente OBEX puede obtener el número de canal RFCOMM del dispositivo remoto vía SDP. Esto se puede hacer especificando el nombre del servicio en lugar del número de canal RFCOMM. Los nombres de servicios soportados son: `IrMC`, `FTRN`, y `OPUSH`. También es posible especificar el canal RFCOMM como un número. Abajo hay un ejemplo de una sesión OBEX donde el objeto de información del dispositivo se descarga desde un teléfono móvil, y un nuevo objeto, la tarjeta de negocio, se sube al directorio del teléfono.
ko: OBEX 클라이언트는 OBEX 서버에서 개체를 푸시 및/또는 풀링하는 데 사용됩니다. 객체의 예로는 명함이나 약속이 있습니다. OBEX 클라이언트는 SDP를 통해 원격 장치에서 RFCOMM 채널 번호를 가져올 수 있습니다. 이 작업은 RFCOMM 채널 번호 대신 서비스 이름을 지정하여 수행할 수 있습니다. 지원되는 서비스 이름은 다음과 같습니다: `IrMC`, `FTRN`, `OPUSH`입니다. RFCOMM 채널을 숫자로 지정할 수도 있습니다. 아래는 휴대폰에서 장치 정보 개체를 가져오고 새 개체인 명함을 휴대폰의 디렉토리에 푸시하는 OBEX 세션의 예시입니다.
ru: Клиент OBEX используется для отправки и/или получения объектов с сервера OBEX. Пример объекта — визитная карточка или встреча. Клиент OBEX может получить номер канала RFCOMM от удалённого устройства через SDP. Это можно сделать, указав имя службы вместо номера канала RFCOMM. Поддерживаемые имена служб: `IrMC`, `FTRN` и `OPUSH`. Также можно указать канал RFCOMM в виде числа. Ниже приведён пример сеанса OBEX, в котором объект информации об устройстве получается с мобильного телефона, а новый объект, визитная карточка, отправляется в директорию телефона.

source: In order to provide the OPUSH service, man:sdpd[8] must be running and a root folder, where all incoming objects will be stored, must be created. The default path to the root folder is [.filename]#/var/spool/obex#. Finally, start the OBEX server on a valid RFCOMM channel number. The OBEX server will automatically register the OPUSH service with the local SDP daemon. The example below shows how to start the OBEX server.
es: Para proporcionar el servicio OPUSH, man:sdpd[8] debe estar en ejecución y se debe crear una carpeta raíz donde se almacenarán todos los objetos recibidos. La ruta por defecto de la carpeta raíz es [.filename]#/var/spool/obex#. Por último, inicia el servidor OBEX en un número de canal RFCOMM válido. El servidor OBEX registrará automáticamente el servicio OPUSH con el demonio SDP local. El ejemplo de abajo muestra cómo iniciar el servidor OBEX.
ko: OPUSH 서비스를 제공하려면 man:sdpd[8]를 실행하고 들어오는 모든 오브젝트가 저장될 루트 폴더를 만들어야 합니다. 루트 폴더의 기본 경로는 [.filename]#/var/spool/obex#입니다. 마지막으로 유효한 RFCOMM 채널 번호에서 OBEX 서버를 시작합니다. OBEX 서버는 로컬 SDP 데몬에 OPUSH 서비스를 자동으로 등록합니다. 아래 예시는 OBEX 서버를 시작하는 방법을 보여줍니다.
ru: Для предоставления службы OPUSH должен быть запущен man:sdpd[8], а также должна быть создана корневая папка, в которой будут храниться все входящие объекты. Путь к корневой папке по умолчанию — [.filename]#/var/spool/obex#. Наконец, запустите сервер OBEX на допустимом номере канала RFCOMM. Сервер OBEX автоматически зарегистрирует службу OPUSH в локальном демоне SDP. В приведённом ниже примере показано, как запустить сервер OBEX.

source: Serial Port Profile (SPP)
es: Perfil de Puerto Serie (SPP)
ru: Профиль последовательного порта (Serial Port Profile — SPP)

source: The Serial Port Profile (SPP) allows Bluetooth devices to perform serial cable emulation. This profile allows legacy applications to use Bluetooth as a cable replacement, through a virtual serial port abstraction.
es: El Perfil de Puerto Serie (SPP) permite a los dispositivos Bluetooth realizar emulación de cable serie. Este perfile permite a aplicaciones heredadas utilizar Bluetooth como un sustituto del cable, a través de una abstracción de puerto serie.
ko: 직렬 포트 프로파일(SPP)을 사용하면 Bluetooth 장치에서 직렬 케이블 에뮬레이션을 수행할 수 있습니다. 이 프로파일을 사용하면 레거시 애플리케이션에서 가상 직렬 포트 추상화를 통해 케이블을 대체하는 방식으로 Bluetooth를 사용할 수 있습니다.
ru: Профиль последовательного порта (SPP) позволяет устройствам Bluetooth эмулировать последовательное соединение. Этот профиль позволяет устаревшим приложениям использовать Bluetooth в качестве замены кабеля через абстракцию виртуального последовательного порта.

source: In FreeBSD, man:rfcomm_sppd[1] implements SPP and a pseudo tty is used as a virtual serial port abstraction. The example below shows how to connect to a remote device's serial port service. A RFCOMM channel does not have to be specified as man:rfcomm_sppd[1] can obtain it from the remote device via SDP. To override this, specify a RFCOMM channel on the command line.
es: En FreeBSD, man:rfcomm_sppd[1] implementa SPP y un pseudo tty es usado como abstracción de puerto serie virtual. El ejemplo de abajo muestra cómo conectarse al servicio de puerto serie de un dispositivo remoto. No se tiene que especificar un canal RFCOMM ya que man:rfcomm_sppd[1] puede obtenerlo del dispositivo remoto vía SDP. Para cambiar esto, especifica un canal RFCOMM en la línea de comando.
ko: FreeBSD에서는 man:rfcomm_sppd[1]가 SPP를 구현하고 가상 직렬 포트 추상화로 의사 tty가 사용됩니다. 아래 예제는 원격 장치의 직렬 포트 서비스에 연결하는 방법을 보여줍니다. man:rfcomm_sppd[1]가 SDP를 통해 원격 장치에서 가져올 수 있으므로 RFCOMM 채널을 지정할 필요가 없습니다. 이를 재정의하려면 명령줄에서 RFCOMM 채널을 지정하세요.
ru: В FreeBSD man:rfcomm_sppd[1] реализует SPP, а псевдо-tty используется как абстракция виртуального последовательного порта. В примере ниже показано, как подключиться к сервису последовательного порта удалённого устройства. RFCOMM-канал не обязательно указывать, так как man:rfcomm_sppd[1] может получить его с удалённого устройства через SDP. Чтобы переопределить это, укажите RFCOMM-канал в командной строке.

source: Once connected, the pseudo tty can be used as serial port:
es: Una vez conectado, el pseudo tty puede ser usado como un puerto serie:
ko: 연결되면 의사 tty를 직렬 포트로 사용할 수 있습니다:
ru: После подключения псевдотерминал можно использовать как последовательный порт:

source: The pseudo tty is printed on stdout and can be read by wrapper scripts:
es: El pseudo tty se imprime en stdout y se puede leer mediante scripts:
ko: 의사 tty는 stdout에 출력되며 래퍼 스크립트에서 읽을 수 있습니다:
ru: Псевдотерминал выводится в stdout и может быть прочитан обёрточными скриптами:

source: By default, when FreeBSD is accepting a new connection, it tries to perform a role switch and become master. Some older Bluetooth devices which do not support role switching will not be able to connect. Since role switching is performed when a new connection is being established, it is not possible to ask the remote device if it supports role switching. However, there is a HCI option to disable role switching on the local side:
es: Por defecto, cuando FreeBSD está aceptando una nueva conexión, intenta realizar un cambio de roles y convertirse en maestro. Algunos dispositivos Bluetooth más antiguos que no soportan el cambio de roles no serán capaces de conectar. Puesto que el cambio de roles se realiza cuando se establece una nueva conexión, no es posible preguntar al dispositivo remoto si soporta el cambio de roles. Sin embargo, hay una opción HCI para deshabilitar el intercambio de roles en el lado local:
ko: 기본적으로 FreeBSD는 새 연결을 수락할 때 역할 전환(role switch)을 수행하여 마스터가 되려고 시도합니다. 역할 전환을 지원하지 않는 일부 구형 Bluetooth 장치는 연결할 수 없습니다. 역할 전환은 새 연결이 설정될 때 수행되므로 원격 장치에 역할 전환을 지원하는지 여부를 물어볼 수 없습니다. 그러나 로컬 측에서 역할 전환을 비활성화하는 HCI 옵션이 있습니다:
ru: По умолчанию, когда хост FreeBSD принимает новое соединение, он пытается выполнить смену роли и стать ведущим. Некоторые старые устройства Bluetooth, которые не поддерживают смену роли, не смогут подключиться. Поскольку смена роли выполняется при установке нового соединения, невозможно запросить у удалённого устройства, поддерживает ли оно смену роли. Однако существует опция HCI для отключения смены роли на локальной стороне:

source: To display Bluetooth packets, use the third-party package hcidump, which can be installed using the package:comms/hcidump[] package or port. This utility is similar to man:tcpdump[1] and can be used to display the contents of Bluetooth packets on the terminal and to dump the Bluetooth packets to a file.
es: Para mostrar paquetes Bluetooht, usa el paquete de terceros hcidump, que se puede instalar mediante el paquete o port package:comms/hcidump[]. Esta utilidad es similar a man:tcpdump[1] y se puede usar para mostrar el contenido de los paquetes Bluetooth en el terminal y para volcarlos a un fichero.
ko: 블루투스 패킷을 표시하려면 package:comms/hcidump[] 패키지 또는 포트를 사용하여 설치할 수 있는 타사 패키지 hcidump를 사용합니다. 이 유틸리티는 man:tcpdump[1]와 유사하며 터미널에 블루투스 패킷의 내용을 표시하고 블루투스 패킷을 파일로 덤프하는 데 사용할 수 있습니다.
ru: Для отображения пакетов Bluetooth используйте сторонний пакет hcidump, который можно установить с помощью package:comms/hcidump[] или порта. Эта утилита аналогична man:tcpdump[1] и может использоваться для вывода содержимого пакетов Bluetooth в терминал и для сохранения этих пакетов в файл.

source: It is sometimes useful to divide a network, such as an Ethernet segment, into network segments without having to create IP subnets and use a router to connect the segments together. A device that connects two networks together in this fashion is called a "bridge".
es: A veces es útil dividir una red, como un segmento Ethernet, en segmentos de red sin tener que crear subredes IP y utilizar un router para conectar los segmentos entre ellos. Un dispositivo que conecta dos redes juntas de esta forma se llama "bridge".
ko: 이더넷 세그먼트와 같은 네트워크를 IP 서브넷을 생성하지 않고도 네트워크 세그먼트로 나누고 라우터를 사용하여 세그먼트를 서로 연결하는 것이 유용할 때가 있습니다. 이러한 방식으로 두 네트워크를 함께 연결하는 장치를 "브리지"라고 합니다.
ru: Иногда полезно разделить сеть, например, сегмент Ethernet, на части без необходимости создания IP-подсетей и использования маршрутизатора для соединения сегментов. Устройство, которое так соединяет две сети, называется "мостом".

source: A bridge works by learning the MAC addresses of the devices on each of its network interfaces. It forwards traffic between networks only when the source and destination MAC addresses are on different networks. In many respects, a bridge is like an Ethernet switch with very few ports. A FreeBSD system with multiple network interfaces can be configured to act as a bridge.
es: Un bridge funciona aprendiendo las direcciones MAC de los dispositivos en cada una de sus interfaces de red. Reenvía tráfico entre las redes sólo cuando las direcciones de origen y destino están en diferentes redes. En muchos aspectos, un bridge es como un switch Ethernet con muy pocos puertos. Un sistema FreeBSD como varias interfaces de red puede ser configurado para funcionar como un bridge.
ko: 브리지는 각 네트워크 인터페이스에 있는 장치의 MAC 주소를 학습하여 작동합니다. 브릿지는 소스 및 대상 MAC 주소가 서로 다른 네트워크에 있는 경우에만 네트워크 간 트래픽을 전달합니다. 여러 측면에서 브리지는 포트 수가 매우 적은 이더넷 스위치와 같습니다. 여러 네트워크 인터페이스가 있는 FreeBSD 시스템은 브리지 역할을 하도록 구성할 수 있습니다.
ru: Мост работает, изучая MAC-адреса устройств на каждом из своих сетевых интерфейсов. Он передает трафик между сетями только в том случае, если исходный и целевой MAC-адреса находятся в разных сетях. Во многих отношениях мост похож на Ethernet-коммутатор с очень малым количеством портов. Система FreeBSD с несколькими сетевыми интерфейсами может быть настроена как мост.

source: Bridging can be useful in the following situations:
es: Un bridge puede ser útil en las siguientes situaciones:
ko: 브리징은 다음과 같은 상황에서 유용할 수 있습니다:
ru: Мост может быть полезен в следующих ситуациях:

source: Connecting Networks
es: Conectar Redes
ko: 네트워크 연결하기
ru: Соединение сетей

source: The basic operation of a bridge is to join two or more network segments. There are many reasons to use a host-based bridge instead of networking equipment, such as cabling constraints or firewalling. A bridge can also connect a wireless interface running in hostap mode to a wired network and act as an access point.
es: La operación básica de un bridge es juntar dos o más segmentos de red. Hay muchas razones para usar un bridge basado en host en lugar de un equipamiento de red, como restricciones en el cableado o los firewalls. Un bridge también puede conectar una interfaz inalámbrica funcionando en modo hostap con una red cableada y actuar como punto de acceso.
ko: 브리지의 기본 작동은 두 개 이상의 네트워크 세그먼트를 연결하는 것입니다. 케이블 연결 제약이나 방화벽과 같이 네트워킹 장비 대신 호스트 기반 브리지를 사용하는 데는 여러 가지 이유가 있습니다. 브리지는 호스트 모드에서 실행되는 무선 인터페이스를 유선 네트워크에 연결하여 액세스 포인트 역할을 할 수도 있습니다.
ru: Основная функция моста — объединить два или более сетевых сегмента. Существует множество причин использовать мост на основе хоста вместо сетевого оборудования, таких как ограничения по кабелям или межсетевой экран. Мост также может соединить беспроводной интерфейс, работающий в режиме hostap, с проводной сетью и выступать в качестве точки доступа.

source: Filtering/Traffic Shaping Firewall
es: Filtrado/Firewall the Modelado de Tráfico
ko: 필터링/트래픽 셰이핑 방화벽
ru: Межсетевой экран с фильтрацией и управлением трафиком

source: A bridge can be used when firewall functionality is needed without routing or Network Address Translation (NAT).
es: Se puede usar un bridge cuando se necesita funcionalidad de firewall sin enrutado o traducciones de direcciones de red (NAT, Network Address Translation).
ko: 라우팅이나 NAT(네트워크 주소 변환) 없이 방화벽 기능이 필요한 경우 브리지를 사용할 수 있습니다.
ru: Мост может использоваться, когда требуется функциональность межсетевого экрана без маршрутизации или преобразования сетевых адресов (NAT).

source: An example is a small company that is connected via DSL or ISDN to an ISP. There are thirteen public IP addresses from the ISP and ten computers on the network. In this situation, using a router-based firewall is difficult because of subnetting issues. A bridge-based firewall can be configured without any IP addressing issues.
es: Un ejemplo es una pequeña compañía que está conectada a un ISP mediante DSL o ISDN. Hay trece direcciones IP públicas del ISP y diez ordenadores en la red. En esta situación, usar un firewall basado en un router es difícil por problemas con las subredes. Un firewall basado en bridge se puede configurar sin ningún problema con las direcciones IP.
ko: 예를 들어 DSL 또는 ISDN을 통해 ISP에 연결된 소규모 회사가 있습니다. 네트워크에는 ISP의 13개의 공용 IP 주소와 10대의 컴퓨터가 있습니다. 이 경우 라우터 기반 방화벽은 서브넷 문제 때문에 사용하기 어렵습니다. 브리지 기반 방화벽은 IP 주소 지정 문제 없이 구성할 수 있습니다.
ru: Пример — небольшая компания, подключённая через DSL или ISDN к провайдеру. У неё есть тринадцать публичных IP-адресов от провайдера и десять компьютеров в сети. В этой ситуации использование маршрутизатора с межсетевым экраном затруднено из-за проблем с подсетями. Межсетевой экран на основе моста можно настроить без каких-либо проблем с IP-адресацией.

source: A bridge can join two network segments in order to inspect all Ethernet frames that pass between them using man:bpf[4] and man:tcpdump[1] on the bridge interface, or by sending a copy of all frames out on an additional interface known as a span port.
es: Un bridge puede unir dos segmentos de red para inspeccionar todas las tramas Ethernet que pasan entre ellos usando man:bpf[4] y man:tcpdump[1] en la interfaz bridge, o enviando una copia de todas las tramas hacia un interfaz adicional conocido como un puerto span.
ko: 브리지는 두 네트워크 세그먼트를 연결하여 브리지 인터페이스에서 man:bpf[4] 및 man:tcpdump[1]를 사용하거나 span port라는 추가 인터페이스로 모든 프레임의 복사본을 전송하여 그 사이를 통과하는 모든 이더넷 프레임을 검사할 수 있습니다.
ru: Мост может объединить два сетевых сегмента для проверки всех Ethernet-кадров, проходящих между ними, с использованием man:bpf[4] и man:tcpdump[1] на интерфейсе моста, или путем отправки копии всех кадров на дополнительный интерфейс, известный как span-порт.

source: Layer 2 VPN
es: VPN en la Capa 2
ru: VPN уровня 2

source: Two Ethernet networks can be joined across an IP link by bridging the networks to an EtherIP tunnel or a man:tap[4] based solution such as OpenVPN.
es: Dos redes Ethernet se pueden unir mediante un enlace IP uniendo las redes a un túnel EtherIP o a una solución basada en man:tap[4] como OpenVPN.
ko: 두 개의 이더넷 네트워크는 EtherIP 터널 또는 OpenVPN과 같은 man:tap[4] 기반 솔루션으로 네트워크를 연결하여 IP 링크를 통해 연결할 수 있습니다.
ru: Две Ethernet-сети могут быть соединены через IP-канал путем моста между сетями через туннель EtherIP или решение на основе man:tap[4], такое как OpenVPN.

source: Layer 2 Redundancy
es: Redundancia en la Capa 2
ru: Избыточность уровня 2

source: A network can be connected together with multiple links and use the Spanning Tree Protocol (STP) to block redundant paths.
es: Una red puede estar conectada con múltiples enlaces y usar el Spanning Tree Protocol (STP) para bloquear caminos redundantes.
ko: 네트워크를 여러 개의 링크로 연결하고 스패닝 트리 프로토콜(Spanning Tree Protocol, STP)을 사용하여 중복 경로를 차단할 수 있습니다.
ru: Сеть может быть соединена несколькими каналами и использовать протокол Spanning Tree Protocol (STP) для блокировки избыточных путей.

source: This section describes how to configure a FreeBSD system as a bridge using man:if_bridge[4]. A netgraph bridging driver is also available, and is described in man:ng_bridge[4].
es: Esta sección describe cómo configurar un sistema FreeBSD como un bridge usando man:if_bridge[4]. También hay disponible un driver bridge de netgraph, y se describe en man:ng_bridge[4].
ko: 이 섹션에서는 man:if_bridge[4]를 사용하여 FreeBSD 시스템을 브리지로 구성하는 방법을 설명합니다. netgraph bridging driver도 사용할 수 있으며, man:ng_bridge[4]에 설명되어 있습니다.
ru: В этом разделе описывается, как настроить систему FreeBSD в качестве моста с использованием man:if_bridge[4]. Также доступен драйвер моста на основе netgraph, который описан в man:ng_bridge[4].

source: Packet filtering can be used with any firewall package that hooks into the man:pfil[9] framework. The bridge can be used as a traffic shaper with man:altq[4] or man:dummynet[4].
es: Se pude usar filtrado de paquetes con cualquier paquete de firewall que se enganche en el framework man:pfil[9]. El bridge se puede usar como un perfilador de tráfico con man:altq[4] o man:dummynet[4].
ko: 패킷 필터링은 man:pfil[9] 프레임워크에 연결되는 모든 방화벽 패키지와 함께 사용할 수 있습니다. 브리지는 man:altq[4] 또는 man:dummynet[4]과 함께 트래픽 셰이퍼로 사용할 수 있습니다.
ru: Фильтрация пакетов может использоваться с любым пакетом межсетевого экрана, который интегрируется в фреймворк man:pfil[9]. Мост может использоваться как шейпер (ограничитель) трафика с man:altq[4] или man:dummynet[4].

source: Enabling the Bridge
es: Habilitando el Bridge
ko: 브리지 활성화하기
ru: Включение моста

source: In FreeBSD, man:if_bridge[4] is a kernel module which is automatically loaded by man:ifconfig[8] when creating a bridge interface. It is also possible to compile bridge support into a custom kernel by adding `device if_bridge` to the custom kernel configuration file.
es: En FreeBSD, man:if_bridge[4] es un módulo del kernel que se carga automáticamente cuando man:ifconfig[8] crea un interfaz bridge. También es posible compilar soporte para bridge en un kernel personalizado añadiendo `device if_bridge` al fichero de configuración del kernel personalizado.
ko: FreeBSD에서, man:if_bridge[4]는 커널 모듈로, 브리지 인터페이스를 만들 때 man:ifconfig[8]에 의해 자동으로 로드됩니다. 커스텀 커널 구성 파일에 `device if_bridge`를 추가하여 커스텀 커널에 브리지 지원을 컴파일할 수도 있습니다.
ru: В FreeBSD man:if_bridge[4] — это модуль ядра, который автоматически загружается с помощью man:ifconfig[8] при создании мостового интерфейса. Также можно включить поддержку моста в собственное ядро, добавив `device if_bridge` в конфигурационный файл собственного ядра.

source: The bridge is created using interface cloning. To create the bridge interface:
es: El bridge se crea clonando una interfaz. Para crear la interfaz bridge:
ko: 브리지는 인터페이스 복제를 사용하여 만들어집니다. 브리지 인터페이스를 만들려면 다음과 같이 하세요:
ru: Мост создается с помощью клонирования интерфейса. Чтобы создать интерфейс моста:

source: When a bridge interface is created, it is automatically assigned a randomly generated Ethernet address. The `maxaddr` and `timeout` parameters control how many MAC addresses the bridge will keep in its forwarding table and how many seconds before each entry is removed after it is last seen. The other parameters control how STP operates.
es: Cuando se crea una interfaz bridge, se le asigna automáticamente una dirección Ethernet generada de forma aleatoria. Los parámetros `maxaddr` y `timeout` controlan cuántas direcciones MAC puede mantener el bridge en su tabla de reenvío y cuántos segundos deben pasar para eliminarla desde la última vez que han sido vistas. Los otros parámetros controlan cómo opera STP.
ko: 브리지 인터페이스가 생성되면 무작위로 생성된 이더넷 주소가 자동으로 할당됩니다. `maxaddr` 및 `timeout`` 매개 변수는 브리지가 포워딩 테이블에 보관할 MAC 주소의 수와 각 항목이 마지막으로 표시된 후 제거되기까지의 시간(초)을 제어합니다. 다른 매개변수는 STP 작동 방식을 제어합니다.
ru: При создании интерфейса моста ему автоматически назначается случайно сгенерированный Ethernet-адрес. Параметры `maxaddr` и `timeout` определяют, сколько MAC-адресов будет хранить межсетевой экран в своей таблице переадресации и через сколько секунд каждая запись будет удалена после последнего обнаружения. Остальные параметры управляют работой STP.

source: Next, specify which network interfaces to add as members of the bridge. For the bridge to forward packets, all member interfaces and the bridge need to be up:
es: Después, especifica qué interfaces de red añadir como miembros del bridge. Para que el bridge sea capaz de reenviar paquetes, todas las interfaces y el bridge necesitan estar levantadas:
ko: 다음으로 브리지의 멤버로 추가할 네트워크 인터페이스를 지정합니다. 브리지가 패킷을 전달하려면 모든 멤버 인터페이스와 브리지가 가동 중이어야 합니다:
ru: Далее укажите, какие сетевые интерфейсы добавить в качестве членов моста. Чтобы мост мог передавать пакеты, все интерфейсы-участники и сам мост должны быть включены:
