Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: Unique local addresses are intended for local communication and are only routable within a set of cooperating sites.
es: Loas direcciones locales únicas están pensadas para comunicación local y sólo son enrutables dentro de un conjunto cooperativo de sitios.
ko: 고유 로컬 주소는 로컬 통신을 위한 것으로, 협력 사이트 집합 내에서만 라우팅할 수 있습니다.

source: All global unicast addresses are assigned from this pool. The first 3 bits are `001`.
es: Todas las direcciones unicast globales se asignan de este lote. Los tres primeros bits son `001`.
ko: 모든 글로벌 유니캐스트 주소는 이 풀에서 할당됩니다. 처음 3비트는 `001`입니다.

source: For further information on the structure of IPv6 addresses, refer to http://www.ietf.org/rfc/rfc3513.txt[RFC3513].
es: Para más información sobre la estructura de direcciones IPv6, consulta http://www.ietf.org/rfc/rfc3513.txt[RFC3513].
ko: IPv6 주소의 구조에 대한 자세한 내용은 http://www.ietf.org/rfc/rfc3513.txt[RFC3513]을 참조하세요.

source: Configuring IPv6
es: Configurando IPv6
ko: IPv6 구성하기

source: To configure a FreeBSD system as an IPv6 client, add these two lines to [.filename]#rc.conf#:
es: Para configurar un sistema FreeBSD como un cliente IPv6, añade estas dos líneas a [.filename]#rc.conf#:
ko: FreeBSD 시스템을 IPv6 클라이언트로 구성하려면 [.filename]#rc.conf#에 다음 두 줄을 추가합니다:

source: The first line enables the specified interface to receive router advertisement messages. The second line enables the router solicitation daemon, man:rtsol[8].
es: La primera línea habilita a la interfaz especificada a recibir mensajes de aviso del router. La segunda línea habilita el demonio de peticiones del router, man:rtsol[8].
ko: 첫 번째 줄은 지정된 인터페이스가 라우터 광고 메시지를 수신할 수 있도록 합니다. 두 번째 줄은 라우터 요청 데몬인 man:rtsol[8]을 활성화합니다.

source: If the interface needs a statically assigned IPv6 address, add an entry to specify the static address and associated prefix length:
es: Si el interfaz necesita una dirección IPv6 asignada estáticamente, añade una entrada para especificar la dirección estática y la longitud de prefijo asociada:
ko: 인터페이스에 정적으로 할당된 IPv6 주소가 필요한 경우 항목을 추가하여 정적 주소 및 관련 접두사 길이를 지정합니다:

source: To assign a default router, specify its address:
es: Para asignar un router por defecto, especifica su dirección:
ko: 기본 라우터를 지정하려면 주소를 지정합니다:

source: Connecting to a Provider
es: Conectando con un Proveedor
ko: 서비스 공급업체에 연결하기

source: In order to connect to other IPv6 networks, one must have a provider or a tunnel that supports IPv6:
es: Para conectar con otras redes IPv6, se debe tener un proveedor o un túnel que soporte IPv6:
ko: 다른 IPv6 네트워크에 연결하려면 IPv6를 지원하는 공급자 또는 터널이 있어야 합니다:

source: Contact an Internet Service Provider to see if they offer IPv6.
es: Contacta con un Proveedor de Servicio de Internet para ver si ofrecen IPv6.
ko: 인터넷 서비스 제공업체에 문의하여 IPv6를 제공하는지 확인하세요.

source: http://www.tunnelbroker.net[Hurricane Electric] offers tunnels with end-points all around the globe.
es: http://www.tunnelbroker.net[Hurricane Electric] ofrece túneles con extremos en todo el mundo.
ko: http://www.tunnelbroker.net[Hurricane Electric]은 전 세계 곳곳에 엔드포인트가 있는 터널을 제공합니다.

source: Install the package:net/freenet6[] package or port for a dial-up connection.
es: Instala el port o paquete package:net/freenet6[] para una conexión tipo "dial-up".
ko: package:net/freenet6[] 패키지 또는 전화 접속 연결을 위한 포트를 설치합니다.

source: This section demonstrates how to take the directions from a tunnel provider and convert them into [.filename]#/etc/rc.conf# settings that will persist through reboots.
es: Esta sección muestra cómo tomar las direcciones desde un proveedor de túnel y convertirlas en configuración apta para [.filename]#/etc/rc.conf# que persistirá a pesar de los reinicios.
ko: 이 섹션에서는 터널 제공업체의 지침을 가져와 재부팅 시에도 유지되는 [.filename]#/etc/rc.conf# 설정으로 변환하는 방법을 설명합니다.

source: The first [.filename]#/etc/rc.conf# entry creates the generic tunneling interface [.filename]#gif0#:
es: La primera entrada en [.filename]#/etc/rc.conf# crear una interfaz de túnel genérica [.filename]#gif0#:
ko: 첫 번째 [.filename]#/etc/rc.conf# 항목은 일반 터널링 인터페이스 [.filename]#gif0#을 생성합니다:

source: Next, configure that interface with the IPv4 addresses of the local and remote endpoints. Replace `_MY_IPv4_ADDR_` and `_REMOTE_IPv4_ADDR_` with the actual IPv4 addresses:
es: Luego, configura la interfaz con la dirección IPv4 de los extremos local y remoto. Reemplaza `_MY_IPv4_ADDR_` y `_REMOTE_IPv4_ADDR_` con las direcciones IPv4 reales:
ko: 다음으로, 로컬 및 원격 엔드포인트의 IPv4 주소로 해당 인터페이스를 구성합니다. `_MY_IPv4_ADDR_` 및 `_REMOTE_IPv4_ADDR_`을 실제 IPv4 주소로 바꿉니다:

source: To apply the IPv6 address that has been assigned for use as the IPv6 tunnel endpoint, add this line, replacing `_MY_ASSIGNED_IPv6_TUNNEL_ENDPOINT_ADDR_` with the assigned address:
es: Para aplicar la dirección IPv6 que ha sido asignada como extremo del túnel IPv6, añade esta línea, reemplazando `_MY_ASSIGNED_IPv6_TUNNEL_ENDPOINT_ADDR_` con la dirección asignada:
ko: IPv6 터널 엔드포인트로 사용하도록 할당된 IPv6 주소를 적용하려면 이 줄을 추가하고 `_MY_ASSIGNED_IPv6_TUNNEL_ENDPOINT_ADDR_`을 할당된 주소로 바꿉니다:

source: Then, set the default route for the other side of the IPv6 tunnel. Replace `_MY_IPv6_REMOTE_TUNNEL_ENDPOINT_ADDR_` with the default gateway address assigned by the provider:
es: Después, establece la ruta por defecto para el otro lado del túnel IPv6. Reemplaza `_MY_IPv6_REMOTE_TUNNEL_ENDPOINT_ADDR_` con la dirección del gateway por defecto asignado por el proveedor:
ko: 그런 다음 IPv6 터널의 반대편에 대한 기본 경로를 설정합니다. `_MY_IPv6_REMOTE_TUNNEL_ENDPOINT_ADDR_`을 공급자가 지정한 기본 게이트웨이 주소로 바꿉니다:

source: If the FreeBSD system will route IPv6 packets between the rest of the network and the world, enable the gateway using this line:
es: Si el sistema FreeBSD va a enruta paquetes IPv6 entre la red y el resto del mundo, activa el gateway usando esta línea:
ko: FreeBSD 시스템이 나머지 네트워크와 전 세계 간에 IPv6 패킷을 라우팅하는 경우, 이 회선을 사용하여 게이트웨이를 활성화합니다:

source: Router Advertisement and Host Auto Configuration
es: Avisos del Router y Auto Configuración del Host
ko: 라우터 광고 및 호스트 자동 구성

source: This section demonstrates how to setup man:rtadvd[8] to advertise the IPv6 default route.
es: Esta sección muestra cómo configurar man:rtadvd[8] para anunciar el router por defecto de IPv6.
ko: 이 섹션에서는 IPv6 기본 경로를 알리기 위해 man:rtadvd[8]를 설정하는 방법을 설명합니다.

source: To enable man:rtadvd[8], add the following to [.filename]#/etc/rc.conf#:
es: Para habilitar man:rtadvd[8], añade lo siguiente a [.filename]#/etc/rc.conf#:
ko: man:rtadvd[8]를 활성화하려면 [.filename]#/etc/rc.conf#에 다음을 추가합니다:

source: It is important to specify the interface on which to do IPv6 router advertisement. For example, to tell man:rtadvd[8] to use [.filename]#rl0#:
es: Es importante especificar la interfaz en la que hacer los anuncios IPv6. Por ejemplo, para decirle a man:rtadvd[8] que use [.filename]#rl0#:
ko: IPv6 라우터 광고를 수행할 인터페이스를 지정하는 것이 중요합니다. 예를 들어, man:rtadvd[8]에 [.filename]#rl0#을 사용하도록 지시합니다:

source: Next, create the configuration file, [.filename]#/etc/rtadvd.conf# as seen in this example:
es: Después, crea el fichero de configuración, [.filename]#/etc/rtadvd.conf#, como se ve en este ejemplo:
ko: 그런 다음, 이 예시와 같이 구성 파일인 [.filename]#/etc/rtadvd.conf#를 만듭니다:

source: Replace [.filename]#rl0# with the interface to be used and `2001:db8:1f11:246::` with the prefix of the allocation.
es: Reemplaza [.filename]#rl0# con la interfaz que se usará y `2001:db8:1f11:246::` con el prefijo de la asignación.
ko: 사용할 인터페이스를 [.filename]#rl0#으로 바꾸고 `2001:db8:1f11:246::`을 할당 접두사로 바꿉니다.

source: For a dedicated `/64` subnet, nothing else needs to be changed. Otherwise, change the `prefixlen#` to the correct value.
es: Para una subred `/64` dedicada, no se necesita cambiar nada. Por el contrario, cambia `prefixlen#` al valor correcto.
ko: 전용 `/64` 서브넷의 경우 다른 것은 변경할 필요가 없습니다. 그렇지 않으면 `prefixlen#`을 올바른 값으로 변경하세요.

source: IPv6 and IPv4 Address Mapping
es: Mapeo de Direcciones IPv6 y IPv4
ko: IPv6 및 IPv4 주소 매핑

source: When IPv6 is enabled on a server, there may be a need to enable IPv4 mapped IPv6 address communication. This compatibility option allows for IPv4 addresses to be represented as IPv6 addresses. Permitting IPv6 applications to communicate with IPv4 and vice versa may be a security issue.
es: Cuando se activa IPv6 en un servidor, podría necesitarse habilitar los mapeos de IPv4 a IPv6. Esta opción de compatibilidad permite a las direcciones IPv4 ser representadas como direcciones IPv6. Permitir a aplicaciones IPv6 comunicarse con IPv4 y viceversa podría ser un problema de seguridad.
ko: 서버에서 IPv6를 사용하도록 설정한 경우, IPv4 매핑된 IPv6 주소 통신을 사용하도록 설정해야 할 수 있습니다. 이 호환성 옵션을 사용하면 IPv4 주소가 IPv6 주소로 표시될 수 있습니다. IPv6 애플리케이션이 IPv4와 통신하거나 그 반대로 통신하도록 허용하면 보안 문제가 발생할 수 있습니다.

source: This option may not be required in most cases and is available only for compatibility. This option will allow IPv6-only applications to work with IPv4 in a dual stack environment. This is most useful for third party applications which may not support an IPv6-only environment. To enable this feature, add the following to [.filename]#/etc/rc.conf#:
es: Esta opción podría no ser necesaria en la mayoría de los casos y sólo está disponible por compatibilidad. Esta opción permitirá a las aplicaciones que sólo funcionan con IPv6 trabajar con IPv4 en un entorno de pila doble. Esto es útil principalmente para aplicaciones de terceros que podrían no soportar entornos sólo IPv6. Para habilitar esta característica, añade los siguiente a [.filename]#/etc/rc.conf#:
ko: 이 옵션은 대부분의 경우 필요하지 않을 수 있으며 호환성을 위해서만 사용할 수 있습니다. 이 옵션을 선택하면 IPv6 전용 애플리케이션이 듀얼 스택 환경에서 IPv4와 함께 작동할 수 있습니다. 이 옵션은 IPv6 전용 환경을 지원하지 않을 수 있는 타사 애플리케이션에 가장 유용합니다. 이 기능을 사용하려면 [.filename]#/etc/rc.conf#에 다음을 추가하세요:

source: Reviewing the information in RFC 3493, section 3.6 and 3.7 as well as RFC 4038 section 4.2 may be useful to some administrators.
es: Revisar la información en el RFC 3493, sección 3.6 y 3.7 así como el RFC 4038 sección 4.2 podría ser de utilidad para algunos administradores.
ko: RFC 3493, 섹션 3.6 및 3.7과 RFC 4038 섹션 4.2의 정보를 검토하는 것이 일부 관리자에게 유용할 수 있습니다.

source: The Common Address Redundancy Protocol (CARP) allows multiple hosts to share the same IP address and Virtual Host ID (VHID) in order to provide _high availability_ for one or more services. This means that one or more hosts can fail, and the other hosts will transparently take over so that users do not see a service failure.
es: El protocolo CARP (Common Address Redundancy Protocol) permite a múltiples hosts compartir la misma dirección IP y VHID (Virtual Host ID) para proporcionar _alta disponibilidad_ para uno o más servicios. Este significa que uno o más hosts pueden fallar, y los otros hosts se harán cargo de forma transparente de forma que los usuarios no verán un fallo de servicio.
ko: Common Address Redundancy Protocol (CARP)을 사용하면 여러 호스트가 동일한 IP 주소와 가상 호스트 ID(VHID)를 공유하여 하나 이상의 서비스에 대해 고가용성을 제공할 수 있습니다. 즉, 하나 이상의 호스트에 장애가 발생해도 다른 호스트가 투명하게 인계하여 사용자에게 서비스 장애가 표시되지 않도록 할 수 있습니다.
ru: Протокол общей избыточности адресов (CARP) позволяет нескольким хостам использовать один и тот же IP-адрес и идентификатор виртуального хоста (VHID) для обеспечения _высокой доступности_ одной или нескольких служб. Это означает, что при отказе одного или нескольких хостов остальные хосты прозрачно возьмут на себя их функции, чтобы пользователи не заметили сбоя в работе службы.

source: In addition to the shared IP address, each host has its own IP address for management and configuration. All of the machines that share an IP address have the same VHID. The VHID for each virtual IP address must be unique across the broadcast domain of the network interface.
es: Además de la dirección IP compartida, cada host tiene su propia dirección IP para gestión y configuración. Todas las máquinas que comparten una dirección IP tienen el mismo VHID. El VHID para cada dirección IP virtual debe ser única en el dominio broadcast del interfaz de red.
ko: 공유 IP 주소 외에도 각 호스트에는 관리 및 구성을 위한 자체 IP 주소가 있습니다. IP 주소를 공유하는 모든 머신은 동일한 VHID를 갖습니다. 각 가상 IP 주소의 VHID는 네트워크 인터페이스의 브로드캐스트 도메인 전체에서 고유해야 합니다.
ru: В дополнение к общему IP-адресу каждый узел имеет собственный IP-адрес для управления и настройки. Все машины, которые используют общий IP-адрес, имеют одинаковый VHID. для каждого виртуального IP-адреса VHID должен быть уникальным в пределах широковещательного домена сетевого интерфейса.

source: High availability using CARP is built into FreeBSD, though the steps to configure it vary slightly depending upon the FreeBSD version. This section provides the same example configuration for versions before and equal to or after FreeBSD 10.
es: La alta disponibilidad con CARP está incluida en FreeBSD, aunque los pasos para configurarla varían ligeramente dependiendo de la versión de FreeBSD. Esta sección proporciona la misma configuración de ejemplo para versiones anteriores, iguales o posteriores a FreeBSD 10.
ko: CARP를 사용하는 고가용성은 FreeBSD에 기본 제공되지만 구성 단계는 FreeBSD 버전에 따라 약간 다릅니다. 이 섹션에서는 FreeBSD 10 이전 버전과 동일하거나 그 이후 버전에 대해 동일한 구성 예제를 제공합니다.
ru: Высокая доступность с использованием CARP встроена в FreeBSD, хотя шаги по её настройке немного различаются в зависимости от версии FreeBSD. В этом разделе приведён одинаковый пример конфигурации для версий до и начиная с FreeBSD 10.

source: This example configures failover support with three hosts, all with unique IP addresses, but providing the same web content. It has two different masters named `hosta.example.org` and `hostb.example.org`, with a shared backup named `hostc.example.org`.
es: Este ejemplo configura soporte para failover con tres hosts, todos con una única dirección IP, pero proporcionando el mismo contenido web. Tiene dos maestros diferentes llamados `hosta.example.org` y `hostb.example.org`, con un respaldo compartido llamado `hostc.example.org`.
ko: 이 예에서는 모두 고유한 IP 주소를 가지고 있지만 동일한 웹 콘텐츠를 제공하는 세 개의 호스트로 장애 조치 지원을 구성합니다. 이 예제에는 `hosta.example.org` 및 `hostb.example.org`라는 두 개의 서로 다른 마스터와 `hostc.example.org`라는 공유 백업이 있습니다.
ru: Этот пример настраивает поддержку отказоустойчивости с тремя хостами, каждый из которых имеет уникальный IP-адрес, но предоставляет одинаковое веб-содержимое. В нем есть два разных основных хоста с именами `hosta.example.org` и `hostb.example.org`, а также общий резервный хост с именем `hostc.example.org`.

source: These machines are load balanced with a Round Robin DNS configuration. The master and backup machines are configured identically except for their hostnames and management IP addresses. These servers must have the same configuration and run the same services. When the failover occurs, requests to the service on the shared IP address can only be answered correctly if the backup server has access to the same content. The backup machine has two additional CARP interfaces, one for each of the master content server's IP addresses. When a failure occurs, the backup server will pick up the failed master machine's IP address.
es: Estas máquinas están balanceadas con un DNS con figurado en Round Robin . Las máquinas maestro y el respaldo están configuradas de forma idéntica excepto por los nombres de host y las direcciones IP de gestión. Estos servidores deben tener la misma configuración y ejecutar los mismos servicios. Cuando se produce un failover, las peticiones al servicio en la dirección IP compartida sólo pueden ser contestadas correctamente si el servidor de respaldo tiene acceso al mismo contenido. La máquina de respaldo tiene dos interfaces CARP adicionales, una para cada dirección IP de los servidores maestros. Cuando ocurre un fallo, el servidor de respaldo pillará la dirección IP de la máquina del maestro que haya fallado.
ko: 이러한 머신은 라운드 로빈 DNS 구성으로 로드 밸런싱됩니다. 마스터 머신과 백업 머신은 호스트 이름과 관리 IP 주소를 제외하고 동일하게 구성됩니다. 이러한 서버는 동일한 구성을 가져야 하며 동일한 서비스를 실행해야 합니다. 장애 조치 발생 시 백업 서버가 동일한 콘텐츠에 액세스할 수 있는 경우에만 공유 IP 주소의 서비스에 대한 요청에 올바르게 응답할 수 있습니다. 백업 머신에는 마스터 콘텐츠 서버의 각 IP 주소에 대해 하나씩 두 개의 추가 CARP 인터페이스가 있습니다. 장애가 발생하면 백업 서버는 장애가 발생한 마스터 머신의 IP 주소를 선택합니다.
ru: Эти машины балансируют нагрузку с помощью конфигурации DNS Round Robin. Основная и резервная машины настроены идентично, за исключением их имён хостов и управляющих IP-адресов. Эти серверы должны иметь одинаковую конфигурацию и запускать одинаковые службы. При возникновении переключения, запросы к службе на общем IP-адресе могут быть корректно обработаны только если резервный сервер имеет доступ к тому же содержимому. Резервная машина имеет два дополнительных интерфейса CARP, по одному для каждого из IP-адресов основного сервера содержимого. При возникновении сбоя, резервный сервер возьмёт IP-адрес вышедшей из строя основной машины.

source: Using CARP on FreeBSD 10 and Later
es: Usando CARP en FreeBSD 10 y Posterior
ko: FreeBSD 10 이상에서 CARP 사용하기

source: Enable boot-time support for CARP by adding an entry for the [.filename]#carp.ko# kernel module in [.filename]#/boot/loader.conf#:
es: Activa el soporte de CARP en el arranque añadiendo una entrada para el módulo del kernel [.filename]#carp.ko# en [.filename]#/boot/loader.conf#:
ko: [.filename]#/boot/loader.conf#에 [.filename]#carp.ko# 커널 모듈 항목을 추가하여 CARP에 대한 부팅 시 지원을 사용하도록 설정합니다:
ru: Включите поддержку CARP при загрузке, добавив запись для модуля ядра [.filename]#carp.ko# в [.filename]#/boot/loader.conf#:

source: To load the module now without rebooting:
es: Para cargar el módulo ahora sin reiniciar:
ko: 재부팅하지 않고 지금 모듈을 로드하려면:
ru: Чтобы сейчас загрузить модуль без перезагрузки:

source: For users who prefer to use a custom kernel, include the following line in the custom kernel configuration file and compile the kernel as described in crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]:
es: Para los usuarios que prefieren usar un kernel personalizado, incluye la siguiente línea en el fichero de configuración del kernel personalizado y compila como se describe en crossref:kernelconfig[kernelconfig,Configurando el Kernel de FreeBSD]:
ko: 커스텀 커널을 사용하려는 사용자의 경우 커스텀 커널 구성 파일에 다음 줄을 포함시키고 crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]에 설명된 대로 커널을 컴파일하세요:
ru: Для пользователей, которые предпочитают использовать собственное ядро, добавьте следующую строку в файл конфигурации ядра и скомпилируйте его, как описано в crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]:

source: The hostname, management IP address and subnet mask, shared IP address, and VHID are all set by adding entries to [.filename]#/etc/rc.conf#. This example is for `hosta.example.org`:
es: El nombre de host, dirección IP de gestión y su máscara de subred, la dirección IP compartida, y el VHID se configuran añadiendo entradas en [.filename]#/etc/rc.conf#. Este ejemplo es para `hosta.example.org`:
ko: 호스트 이름, 관리 IP 주소 및 서브넷 마스크, 공유 IP 주소, VHID는 모두 [.filename]#/etc/rc.conf#에 항목을 추가하여 설정할 수 있습니다. 이 예는 `hosta.example.org`에 대한 것입니다:
ru: Имя хоста, управляющий IP-адрес и маска подсети, общий IP-адрес и VHID задаются путем добавления записей в [.filename]#/etc/rc.conf#. Этот пример для `hosta.example.org`:

source: The next set of entries are for `hostb.example.org`. Since it represents a second master, it uses a different shared IP address and VHID. However, the passwords specified with `pass` must be identical as CARP will only listen to and accept advertisements from machines with the correct password.
es: El siguiente conjunto de entradas es para `hostb.example.org`. Puesto que representa un segundo maestro, utiliza una dirección IP compartida y VHID diferentes. Sin embargo, la contraseña especificada con `pass` debe ser idéntica ya que CARP sólo escuchará y aceptará notificaciones de las máquinas que tengan la contraseña correcta.
ko: 다음 항목 세트는 `hostb.example.org`에 대한 항목입니다. 두 번째 마스터를 나타내므로 다른 공유 IP 주소와 VHID를 사용합니다. 그러나 `pass`로 지정된 비밀번호는 동일해야 하며, CARP는 올바른 비밀번호를 가진 컴퓨터의 광고만 수신하고 수락하기 때문입니다.
ru: Следующий набор записей предназначен для `hostb.example.org`. Поскольку он представляет второй мастер, используется другой общий IP-адрес и VHID. Однако пароли, указанные с помощью `pass`, должны быть идентичными, так как CARP будет принимать и обрабатывать объявления только от машин с правильным паролем.

source: The third machine, `hostc.example.org`, is configured to handle failover from either master. This machine is configured with two CARPVHIDs, one to handle the virtual IP address for each of the master hosts. The CARP advertising skew, `advskew`, is set to ensure that the backup host advertises later than the master, since `advskew` controls the order of precedence when there are multiple backup servers.
es: La tercer máquina, `hostc.example.org`, está configurada para manejar el failover de cualquiera de los maestros. Esta máquina está configurada con dos CARPVHIDS, uno para manejar cada dirección IP virtual de cada host maestro. El desvío de notificaciones CARP, `advskew`, está configurado para asegurar que el host de respaldo notifica más tarde que el maestro, puesto que `advskew` controla el orden de precedencia cuando hay varios servidores de reemplazo.
ko: 세 번째 머신인 `hostc.example.org`는 두 마스터 중 하나에서 장애 조치를 처리하도록 구성됩니다. 이 머신은 각 마스터 호스트의 가상 IP 주소를 처리하기 위해 두 개의 CARPVHID로 구성됩니다. 백업 서버가 여러 대일 때 우선 순위를 제어하는 `advskew`는 백업 호스트가 마스터 호스트보다 늦게 광고를 하도록 설정되어 있습니다.
ru: Третья машина, `hostc.example.org`, настроена для обработки перехода на резервный сервер от любого из основных. Эта машина настроена с двумя CARPVHID, по одному для обработки виртуального IP-адреса каждого из основных хостов. Значение advskew (временной сдвиг анонсов CARP) обеспечивает задержку в отправке анонсов резервным сервером по сравнению с основным, поскольку `advskew` контролирует порядок приоритета при наличии нескольких резервных серверов.

source: Having two CARPVHIDs configured means that `hostc.example.org` will notice if either of the master servers becomes unavailable. If a master fails to advertise before the backup server, the backup server will pick up the shared IP address until the master becomes available again.
es: Tener dos CARPVHIDs configurados significa que `hostc.example.org` se dará cuenta si alguno de los maestros no se encuentra disponible. Si un maestro no es capaz de notificar antes que el servidor de reemplazo, el servidor de reemplazo usará la dirección IP compartida hasta que el maestro esté disponible de nuevo.
ko: 두 개의 CARPVHID를 구성하면 마스터 서버 중 하나를 사용할 수 없게 되면 `hostc.example.org`가 이를 알 수 있습니다. 마스터 서버가 백업 서버보다 먼저 알리는 데 실패하면 마스터 서버가 다시 사용할 수 있게 될 때까지 백업 서버가 공유 IP 주소를 선택합니다.
ru: Наличие двух настроенных CARPVHID означает, что `hostc.example.org` заметит, если один из главных серверов станет недоступен. Если главный сервер не отправит объявление раньше резервного сервера, резервный сервер возьмёт на себя общий IP-адрес до тех пор, пока главный сервер снова не станет доступен.
