Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: The bridge can now forward Ethernet frames between [.filename]#fxp0# and [.filename]#fxp1#. Add the following lines to [.filename]#/etc/rc.conf# so the bridge is created at startup:
es: El puente ahora puede reenviar tramas Ethernet entre [.filename]#fxp0# y [.filename]#fxp1#. Añade las siguientes líneas a [.filename]#/etc/rc.conf# de forma que el bridge se cree al arrancar:
ko: 이제 브리지가 [.filename]#fxp0#와 [.filename]#fxp1# 간에 이더넷 프레임을 전달할 수 있습니다. 부팅 시 브리지가 생성되도록 [.filename]#/etc/rc.conf#에 다음 줄을 추가하세요:
ru: Мост теперь может передавать Ethernet-кадры между [.filename]#fxp0# и [.filename]#fxp1#. Добавьте следующие строки в [.filename]#/etc/rc.conf#, чтобы мост создавался при загрузке:

source: If the bridge host needs an IP address, set it on the bridge interface, not on the member interfaces. The address can be set statically or via DHCP. This example sets a static IP address:
es: Si la máquina bridge necesita una dirección IP, establécela en la interfaz del bridge, no en las interfaces que son miembro. La dirección puede establecerse estáticamente o vía DHCP. Este ejemplo establece una dirección IP estática:
ko: 브리지 호스트에 IP 주소가 필요한 경우 구성원 인터페이스가 아닌 브리지 인터페이스에서 설정하세요. 주소는 정적으로 또는 DHCP를 통해 설정할 수 있습니다. 이 예에서는 고정 IP 주소를 설정합니다:
ru: Если мостовому хосту нужен IP-адрес, установите его на интерфейсе моста, а не на интерфейсах-участниках. Адрес можно задать статически или через DHCP. В этом примере задаётся статический IP-адрес:

source: It is also possible to assign an IPv6 address to a bridge interface. To make the changes permanent, add the addressing information to [.filename]#/etc/rc.conf#.
es: También es posible establecer una dirección IPv6 al interfaz del bridge. Para hacer los cambios permanentes, añade la información de la dirección a [.filename]#/etc/rc.conf#.
ko: 브리지 인터페이스에 IPv6 주소를 할당할 수도 있습니다. 변경 사항을 영구적으로 적용하려면 [.filename]#/etc/rc.conf#에 주소 지정 정보를 추가하세요.
ru: Также возможно назначить IPv6-адрес интерфейсу моста. Чтобы изменения стали постоянными, добавьте информацию об адресации в [.filename]#/etc/rc.conf#.

source: When packet filtering is enabled, bridged packets will pass through the filter inbound on the originating interface on the bridge interface, and outbound on the appropriate interfaces. Either stage can be disabled. When direction of the packet flow is important, it is best to firewall on the member interfaces rather than the bridge itself.
es: Cuando el filtrado de paquetes está habilitado, los paquetes que van por el bridge pasarán a través del filtro de entrada en la interfaz de origen en el interfaz del bridge, y de salida en las interfaces apropiadas. Cualquiera de las dos fases puede deshabilitarse. Cuando la dirección de un paquete es importante, es mejor aplicar el firewall en las interfaces que forman el bridge que en el bridge en sí mismo.
ko: 패킷 필터링이 활성화되면 브리지 패킷은 브리지 인터페이스의 원본 인터페이스에서 인바운드 필터를 통과하고 해당 인터페이스에서 아웃바운드 필터를 통과합니다. 어느 단계든 비활성화할 수 있습니다. 패킷 흐름의 방향이 중요한 경우 브리지 자체보다는 멤버 인터페이스에서 방화벽을 사용하는 것이 가장 좋습니다.
ru: Когда включена фильтрация пакетов, транзитные пакеты будут проходить через фильтр на входящем интерфейсе мостового интерфейса и исходящем на соответствующих интерфейсах. Любой из этапов может быть отключен. Если направление потока пакетов важно, лучше настроить межсетевой экран на интерфейсах-участниках, а не на самом мосте.

source: The bridge has several configurable settings for passing non-IP and IP packets, and layer2 firewalling with man:ipfw[8]. See man:if_bridge[4] for more information.
es: El bridge tiene varios valores configurables para pasar paquetes IP y no IP, y firewall the capa 2 con man:ipfw[8]. Consulta man:if_bridge[4] para más información.
ko: 브리지에는 non-IP 및 IP 패킷을 전달하기 위한 몇 가지 구성 가능한 설정과 man:ipfw[8]로 레이어2 방화벽을 설정할 수 있습니다. 자세한 내용은 man:if_bridge[4]를 참조하세요.
ru: Мост имеет несколько настраиваемых параметров для передачи не-IP и IP пакетов, а также межсетевой экран второго уровня с man:ipfw[8]. Подробнее см. man:if_bridge[4].

source: Enabling Spanning Tree
es: Activando Spanning Tree
ko: Spanning Tree 활성화하기
ru: Включение протокола островного дерева (STP)

source: For an Ethernet network to function properly, only one active path can exist between two devices. The STP protocol detects loops and puts redundant links into a blocked state. Should one of the active links fail, STP calculates a different tree and enables one of the blocked paths to restore connectivity to all points in the network.
es: Para que una red Ethernet funcione adecuadamente, sólo debe existir un camino activo entre dos dispositivos. El protocolo STP detecta bucles y pone enlaces redundantes en un estado bloqueado. Si uno de los enlaces activos fallara, STP calcula un árbol diferente y activa uno de los caminos bloqueados para restaurar la conectividad a todos los puntos de la red.
ko: 이더넷 네트워크가 제대로 작동하려면 두 장치 사이에 활성 경로가 하나만 존재해야 할 수 있습니다. STP 프로토콜은 루프를 감지하고 중복 링크를 차단 상태로 전환합니다. 활성 링크 중 하나에 장애가 발생하면 STP는 다른 트리를 계산하고 차단된 경로 중 하나를 활성화하여 네트워크의 모든 지점에 대한 연결을 복원합니다.
ru: Для правильной работы Ethernet-сети между двумя устройствами может существовать только один активный путь. Протокол STP обнаруживает петли и переводит избыточные соединения в заблокированное состояние. Если одно из активных соединений выйдет из строя, STP вычисляет новое дерево и активирует один из заблокированных путей, чтобы восстановить подключение ко всем точкам сети.

source: The Rapid Spanning Tree Protocol (RSTP or 802.1w) provides backwards compatibility with legacy STP. RSTP provides faster convergence and exchanges information with neighboring switches to quickly transition to forwarding mode without creating loops. FreeBSD supports RSTP and STP as operating modes, with RSTP being the default mode.
es: El protocolo Rapid Spanning Tree (RSTP o 802.1w) proporciona compatibilidad hacia atrás con el STP antiguo. RSTP proporciona una convergencia más rápida e intercambia información con switches vecinos para transicionar rápidamente a modo reenvío sin crear bycles. FreeBSD soporta como modos de operación RSTP y STP, siendo RSTP el modo por defecto.
ko: RSTP(Rapid Spanning Tree Protocol 또는 802.1w)는 레거시 STP와의 역호환성을 제공합니다. RSTP는 더 빠른 컨버전스를 제공하고 인접 스위치와 정보를 교환하여 루프를 만들지 않고 포워딩 모드로 빠르게 전환합니다. FreeBSD는 RSTP와 STP를 작동 모드로 지원하며, 기본 모드는 RSTP입니다.
ru: Протокол Rapid Spanning Tree (RSTP или 802.1w) обеспечивает обратную совместимость с устаревшим STP. RSTP предоставляет более быструю сходимость и обменивается информацией с соседними коммутаторами для быстрого перехода в режим передачи без создания петель. FreeBSD поддерживает RSTP и STP в качестве режимов работы, причем RSTP является режимом по умолчанию.

source: STP can be enabled on member interfaces using man:ifconfig[8]. For a bridge with [.filename]#fxp0# and [.filename]#fxp1# as the current interfaces, enable STP with:
es: Se puede activar STP en las interfaces miembro usando man:ifconfig[8]. Para un bridge con [.filename]#fxp0# y [.filename]#fxp1# como interfaces actuales, activa STP con:
ko: man:ifconfig[8]을 사용하여 멤버 인터페이스에서 STP를 활성화할 수 있습니다. 현재 인터페이스가 [.filename]#fxp0# 및 [.filename]#fxp1#인 브리지의 경우, STP를 다음으로 활성화합니다:
ru: STP может быть включен на интерфейсах участников с помощью man:ifconfig[8]. Для моста с интерфейсами [.filename]#fxp0# и [.filename]#fxp1# включите STP командой:

source: This bridge has a spanning tree ID of `00:01:02:4b:d4:50` and a priority of `32768`. As the `root id` is the same, it indicates that this is the root bridge for the tree.
es: Este bridge tiene un spanning tree con un ID de `00:01:02:4b:d4:50` y una prioridad de `32768`. Como el `root id` es el mismo, eso indica que es el bridge raíz del árbol.
ko: 이 브리지의 스패닝 트리 ID는 `00:01:02:4b:d4:50`이고 우선 순위는 `32768`입니다. `root id`가 동일하므로 이 브리지가 트리의 루트 브리지임을 나타냅니다.
ru: Этот мост имеет идентификатор остовного дерева `00:01:02:4b:d4:50` и приоритет `32768`. Поскольку `root id` совпадает, это указывает на то, что данный мост является корневым для дерева.

source: Another bridge on the network also has STP enabled:
es: Otro bridge en la red tiene STP activado:
ko: 네트워크의 다른 브리지에도 STP가 활성화되어 있습니다:
ru: Еще один мост в сети также имеет включенный STP:

source: The line `root id 00:01:02:4b:d4:50 priority 32768 ifcost 400000 port 4` shows that the root bridge is `00:01:02:4b:d4:50` and has a path cost of `400000` from this bridge. The path to the root bridge is via `port 4` which is [.filename]#fxp0#.
es: La línea `root id 00:01:02:4b:d4:50 priority 32768 ifcost 400000 port 4` muestra que el bridge raíz es `00:01:02:4b:d4:50` y que tiene un camino con coste `400000` desde este bridge. La ruta al brige raíz es vía `port 4` que es [.filename]#fxp0#.
ko: `root id 00:01:02:4b:d4:50 priority 32768 ifcost 400000 port 4` 줄은 루트 브리지가 `00:01:02:4B:D4:50`이고 이 브리지의 경로 비용이 `400000`임을 보여줍니다. 루트 브리지로의 경로는 `port 4`인 [.filename]#fxp0#를 경유합니다.
ru: Строка `root id 00:01:02:4b:d4:50 priority 32768 ifcost 400000 port 4` показывает, что корневым мостом является `00:01:02:4b:d4:50` с стоимостью пути `400000` от данного моста. Путь к корневому мосту проходит через `port 4`, которым является [.filename]#fxp0#.

source: Bridge Interface Parameters
es: Parámetros de la Interfaz del Bridge
ko: 브리지 인터페이스 매개변수
ru: Параметры интерфейса моста

source: Several `ifconfig` parameters are unique to bridge interfaces. This section summarizes some common uses for these parameters. The complete list of available parameters is described in man:ifconfig[8].
es: Varios parámetros de `ifconfig` son únicos de las interfaces del bridge. Esta sección resume algunos casos comunes para estos parámetros. man:ifconfig[8] describe la lista completa de parámetros disponibles.
ko: 브리지 인터페이스에는 몇 가지 `ifconfig` 고유한 매개변수가 있습니다. 이 섹션에서는 이러한 매개 변수의 일반적인 용도를 요약합니다. 사용 가능한 매개변수의 전체 목록은 man:ifconfig[8]에 설명되어 있습니다.
ru: Несколько параметров `ifconfig` уникальны для мостовых интерфейсов. В этом разделе приведены некоторые общие варианты использования этих параметров. Полный список доступных параметров описан в man:ifconfig[8].

source: A private interface does not forward any traffic to any other port that is also designated as a private interface. The traffic is blocked unconditionally so no Ethernet frames will be forwarded, including ARP packets. If traffic needs to be selectively blocked, a firewall should be used instead.
es: Una interfaz privada no reenvía nada de tráfico a otro puerto que no esté designado como una interfaz privada. El tráfico se bloquea incondicionalmente de forma que las tramas Ethernet no serán reenviadas, incluyendo los paquetes ARP. Si se necesita bloquear el tráfico de forma selectiva, se tiene que usar un firewall.
ko: Private 인터페이스는 private 인터페이스로 지정된 다른 포트로 트래픽을 전달하지 않습니다. 트래픽은 무조건 차단되므로 ARP 패킷을 포함한 이더넷 프레임이 전달되지 않습니다. 트래픽을 선택적으로 차단해야 하는 경우 방화벽을 대신 사용해야 합니다.
ru: Приватный интерфейс не передает трафик на другие порты, также обозначенные как приватные. Трафик блокируется безусловно, поэтому Ethernet-кадры, включая ARP-пакеты, не будут передаваться. Если требуется выборочная блокировка трафика, следует использовать межсетевой экран.

source: A span port transmits a copy of every Ethernet frame received by the bridge. The number of span ports configured on a bridge is unlimited, but if an interface is designated as a span port, it cannot also be used as a regular bridge port. This is most useful for snooping a bridged network passively on another host connected to one of the span ports of the bridge. For example, to send a copy of all frames out the interface named [.filename]#fxp4#:
es: Un puerto span transmite una copia de cada trama Ethernet recibida en el bridge. El número de puertos span configurados en el bridge es ilimitado, pero si una interfaz es designada como un puerto span, no puede ser usada también como un puerto regular en el bridge. Esto es muy útil para husmear en una red con bridge de forma pasiva en otro host conectado a uno de los puertos span del bridge. Por ejemplo, para enviar una copia de todas las tramas obtenidas de la interfaz [.filename]#fxp4#:
ko: Span 포트는 브리지에서 수신한 모든 이더넷 프레임의 복사본을 전송합니다. 브리지에 구성된 span 포트의 수는 무제한이지만 인터페이스가 span 포트로 지정되면 일반 브리지 포트로도 사용할 수 없습니다. 이 기능은 브리지의 span 포트 중 하나에 연결된 다른 호스트에서 브리지 네트워크를 수동적으로 스누핑하는 데 가장 유용합니다. 예를 들어 모든 프레임의 복사본을 [.filename]#fxp4#라는 인터페이스로 보내려면:
ru: Порт зеркалирования (SPAN —Switch Port Analyzer) передает копию каждого Ethernet-фрейма, полученного мостом. Количество портов зеркалирования, настроенных на мосту, не ограничено, но если интерфейс назначен как порт зеркалирования, он не может использоваться в качестве обычного порта моста. Это наиболее полезно для пассивного мониторинга сети, подключенной к мосту, на другом хосте, подключенном к одному из портов зеркалирования моста. Например, чтобы отправить копию всех фреймов через интерфейс с именем [.filename]#fxp4#:

source: If a bridge member interface is marked as sticky, dynamically learned address entries are treated as static entries in the forwarding cache. Sticky entries are never aged out of the cache or replaced, even if the address is seen on a different interface. This gives the benefit of static address entries without the need to pre-populate the forwarding table. Clients learned on a particular segment of the bridge cannot roam to another segment.
es: Si una interfaz del bridge es marcada como sticky, las entradas de direcciones aprendidas dinámicamente se tratan como entradas estáticas en la caché de reenvío. Las entradas sticky no envejecen nunca en la caché ni son reemplazadas, incluso si la dirección es vista en otra interfaz. Esto ofrece el beneficio de las entradas de direcciones estáticas sin la necesidad de poblar la tabla de reenvío con antelación. Los clientes que se han aprendido de un segmento del bridge en particular no pueden moverse a otro segmento.
ko: 브리지 멤버 인터페이스가 sticky로 표시된 경우 동적으로 학습된 주소 항목은 전달 캐시에서 정적 항목으로 취급됩니다. 고정 항목은 주소가 다른 인터페이스에 표시되더라도 캐시에서 에이징되거나 교체되지 않습니다. 따라서 전달 테이블을 미리 채울 필요 없이 정적 주소 항목의 이점을 누릴 수 있습니다. 브리지의 특정 세그먼트에서 학습한 클라이언트는 다른 세그먼트로 로밍할 수 없습니다.
ru: Если интерфейс участника моста помечен как фиксированный (sticky), динамически изученные записи адресов обрабатываются как статические записи в кэше пересылки. Фиксированные записи никогда не удаляются из кэша и не заменяются, даже если адрес обнаружен на другом интерфейсе. Это даёт преимущество статических записей адресов без необходимости предварительного заполнения таблицы пересылки. Клиенты, изученные на определённом сегменте моста, не могут перемещаться на другой сегмент.

source: An example of using sticky addresses is to combine the bridge with VLANs in order to isolate customer networks without wasting IP address space. Consider that `CustomerA` is on `vlan100`, `CustomerB` is on `vlan101`, and the bridge has the address `192.168.0.1`:
es: Un ejemplo de uso de direcciones sticky es combinar el bridge con VLANs para aislar redes cliente sin gastar espacio de direcciones IP. Considera que `CustomerA` está en `vlan100`, `CustomerB` está en `vlan101`, y el bridge tiene la dirección `192.168.0.1`:
ko: Sticky 주소를 사용하는 한 가지 예는 IP 주소 공간을 낭비하지 않고 고객 네트워크를 분리하기 위해 브리지를 VLAN과 결합하는 것입니다. `CustomerA`는 `vlan100`에, `CustomerB`는 `vlan101`에 있으며 브리지의 주소는 `192.168.0.1`이라고 가정해 보겠습니다:
ru: Пример использования фиксированных адресов — это объединение моста с VLAN для изоляции сетей клиентов без потерь IP-адресного пространства. Предположим, что `CustomerA` находится в `vlan100`, `CustomerB` — в `vlan101`, а мост имеет адрес `192.168.0.1`:

source: In this example, both clients see `192.168.0.1` as their default gateway. Since the bridge cache is sticky, one host cannot spoof the MAC address of the other customer in order to intercept their traffic.
es: En este ejemplo, ambos clientes ven `192.168.0.1` como su gateway por defecto. Puesto que la caché del bridge es sticky, un host no puede falsear la dirección MAC de otro cliente para interceptar su tráfico.
ko: 이 예제에서는 두 클라이언트 모두 `192.168.0.1`을 기본 게이트웨이로 인식합니다. 브리지 캐시는 고정되어 있으므로 한 호스트가 다른 고객의 트래픽을 가로채기 위해 다른 고객의 MAC 주소를 스푸핑할 수 없습니다.
ru: В этом примере оба клиента видят `192.168.0.1` в качестве своего шлюза по умолчанию. Поскольку кэш моста устойчив, один узел не может подделать MAC-адрес другого клиента, чтобы перехватить его трафик.

source: Any communication between the VLANs can be blocked using a firewall or, as seen in this example, private interfaces:
es: Cualquier comunicación entre las VLANs se puede bloquear utilizando un firewall o, como se ve en este ejemplo, usando interfaces privadas:
ko: 방화벽을 사용하거나 이 예제에서 볼 수 있듯 사설 인터페이스를 사용하여 VLAN 간의 모든 통신을 차단할 수 있습니다:
ru: Любое взаимодействие между VLAN может быть заблокировано с помощью межсетевого экрана или, как показано в этом примере, частных интерфейсов:

source: The customers are completely isolated from each other and the full `/24` address range can be allocated without subnetting.
es: Los clientes están completamente aislados entre sí y el rango de direcciones completo `/24` se puede reservar sin necesidad de crear subredes.
ko: 고객은 서로 완전히 격리되어 있으며 서브넷 없이 전체 `/24` 주소 범위를 할당할 수 있습니다.
ru: Клиенты полностью изолированы друг от друга, и весь диапазон адресов `/24` может быть выделен без разделения на подсети.

source: The number of unique source MAC addresses behind an interface can be limited. Once the limit is reached, packets with unknown source addresses are dropped until an existing host cache entry expires or is removed.
es: Se puede limitar el número direcciones MAC fuente únicas detrás de una interfaz. Una vez que se alcance el límite, los paquetes que tengan una dirección de origen desconocida serán descartados hasta que una entrada existente de caché en el host que expire o que sea eliminada.
ko: 인터페이스 뒤에 있는 고유 소스 MAC 주소의 수는 제한될 수 있습니다. 제한에 도달하면 소스 주소를 알 수 없는 패킷은 기존 호스트 캐시 항목이 만료되거나 제거될 때까지 삭제됩니다.
ru: Количество уникальных исходных MAC-адресов за интерфейсом может быть ограничено. Как только лимит будет достигнут, пакеты с неизвестными исходными адресами будут отбрасываться до тех пор, пока существующая запись в кэше хоста не истечёт или не будет удалена.

source: The following example sets the maximum number of Ethernet devices for `CustomerA` on `vlan100` to 10:
es: El siguiente ejemplo establece el número máximo de dispositivos Ethernet a 10 para `CustomerA` en `vlan100`:
ko: 다음 예에서는 `vlan100`에서 `CustomerA`의 이더넷 장치 최대 수를 10개로 설정합니다:
ru: Следующий пример устанавливает максимальное количество Ethernet-устройств для `CustomerA` на `vlan100` равным 10:

source: Bridge interfaces also support monitor mode, where the packets are discarded after man:bpf[4] processing and are not processed or forwarded further. This can be used to multiplex the input of two or more interfaces into a single man:bpf[4] stream. This is useful for reconstructing the traffic for network taps that transmit the RX/TX signals out through two separate interfaces. For example, to read the input from four network interfaces as one stream:
es: Las interfaces del bridge también soportan modo monitor, donde los paquetes son descartados después de haber sido procesados por man:bpf[4] y no se procesan más ni se reenvían. Esto se puede usar para multiplexar la entrada de dos o más interfaces en un único flujo man:bpf[4]. Esto es útil para reconstruir el tráfico de redes que transmiten las señales RX/TX hacia fuera usando dos interfaces separadas. Por ejemplo, para leer la entrada desde cuatro interfaces de red como un único flujo:
ko: 브리지 인터페이스는 man:bpf[4] 처리 후 패킷이 폐기되고 더 이상 처리되거나 전달되지 않는 모니터 모드도 지원합니다. 이 모드는 두 개 이상의 인터페이스 입력을 단일 man:bpf[4] 스트림으로 멀티플렉싱하는 데 사용할 수 있습니다. 이는 두 개의 개별 인터페이스를 통해 RX/TX 신호를 전송하는 네트워크 탭의 트래픽을 재구성하는 데 유용합니다. 예를 들어, 4개의 네트워크 인터페이스에서 하나의 스트림으로 입력을 읽을 수 있습니다:
ru: Мостовые интерфейсы также поддерживают режим мониторинга, в котором пакеты отбрасываются после обработки man:bpf[4] и не обрабатываются или передаются дальше. Это можно использовать для мультиплексирования входа двух или более интерфейсов в один поток man:bpf[4]. Это полезно для восстановления трафика сетевых кранов, которые передают сигналы RX/TX через два отдельных интерфейса. Например, чтобы читать входные данные с четырёх сетевых интерфейсов как один поток:

source: SNMP Monitoring
es: Monitorización SNMP
ko: SNMP 모니터링
ru: Мониторинг SNMP

source: The bridge interface and STP parameters can be monitored via man:bsnmpd[1] which is included in the FreeBSD base system. The exported bridge MIBs conform to IETF standards so any SNMP client or monitoring package can be used to retrieve the data.
es: El interfaz bridge y los parámetros STP se pueden monitorizar con man:bsnmpd[1] que se incluye con el sistema base FreeBSD. Las MIBs del bridge exportadas siguen el estándar IETF de forma que se puede usar cualquier cliente SNMP o paquete de monitorización para recuperar los datos.
ko: 브리지 인터페이스와 STP 매개변수는 FreeBSD 기본 시스템에 포함된 man:bsnmpd[1]를 통해 모니터링할 수 있습니다. 내보낸 브리지 MIB는 IETF 표준을 준수하므로 모든 SNMP 클라이언트 또는 모니터링 패키지를 사용하여 데이터를 검색할 수 있습니다.
ru: Интерфейс моста и параметры STP можно отслеживать с помощью man:bsnmpd[1], который включён в базовую систему FreeBSD. Экспортируемые MIB моста соответствуют стандартам IETF, поэтому для получения данных можно использовать любой SNMP-клиент или пакет мониторинга.

source: To enable monitoring on the bridge, uncomment this line in [.filename]#/etc/snmpd.config# by removing the beginning `+#+` symbol:
es: Para habilitar la monitorización en el bridge, descomenta esta línea en [.filename]#/etc/snmpd.config# eliminando el símbolo `+#+` al comienzo:
ko: 브리지에서 모니터링을 사용하려면 [.filename]#/etc/snmpd.config#에서 앞부분의 `+#+` 기호를 제거하여 이 줄의 주석을 해제합니다:
ru: Чтобы включить мониторинг на мосту, раскомментируйте эту строку в [.filename]#/etc/snmpd.config#, удалив символ `+#+` в начале:

source: Other configuration settings, such as community names and access lists, may need to be modified in this file. See man:bsnmpd[1] and man:snmp_bridge[3] for more information. Once these edits are saved, add this line to [.filename]#/etc/rc.conf#:
es: Podría ser necesario modificar en este fichero otros valores de configuración, como los nombres de la comunidad y listas de acceso. Consulta man:bsnmpd[1] y man:snmp_bridge[3]. Una vez guardados los cambios, añade esta línea a [.filename]#/etc/rc.conf#:
ko: 커뮤니티 이름 및 액세스 목록과 같은 다른 구성 설정은 이 파일에서 수정해야 할 수 있습니다. 자세한 내용은 man:bsnmpd[1] 및 man:snmp_bridge[3]를 참조하세요. 이러한 편집 내용을 저장한 후 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:
ru: Другие параметры конфигурации, такие как имена сообществ и списки доступа, возможно, потребуется изменить в этом файле. Подробнее см. в man:bsnmpd[1] и man:snmp_bridge[3]. После сохранения изменений добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: Then, start man:bsnmpd[1]:
es: Después, arranca man:bsnmpd[1]:
ko: 그리고 나서, man:bsnmpd[1]를 시작합니다:
ru: Затем, запустите man:bsnmpd[1]:
