Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: A FreeBSD system can be configured as the default gateway, or router, for a network if it is a dual-homed system. A dual-homed system is a host which resides on at least two different networks. Typically, each network is connected to a separate network interface, though IP aliasing can be used to bind multiple addresses, each on a different subnet, to one physical interface.
es: Un sistema FreeBSD se puede configurar como el gateway por defecto, o router, para una red si es un sistema "dual-homed". Un sistema "dual-homed" es una máquina que está en al menos dos redes diferentes. Típicamente cada red se conecta a un interfaz de red separada, aunque se puede usar IP aliasing para enlazar múltiples direcciones, cada una en una subred diferente, a una única interfaz física.
ko: 듀얼 홈 시스템인 경우 FreeBSD 시스템을 네트워크의 기본 게이트웨이 또는 라우터로 구성할 수 있습니다. 듀얼 홈 시스템은 적어도 두 개의 다른 네트워크에 상주하는 호스트입니다. 일반적으로 각 네트워크는 별도의 네트워크 인터페이스에 연결되지만, IP 앨리어싱을 사용하여 각각 다른 서브넷에 있는 여러 주소를 하나의 물리적 인터페이스에 바인딩할 수 있습니다.
ru: Система FreeBSD может быть настроена как шлюз по умолчанию или маршрутизатор для сети, если она является двухдоменной системой. Двухдоменная система — это хост, который находится как минимум в двух разных сетях. Обычно каждая сеть подключена к отдельному сетевому интерфейсу, хотя IP-алиасинг может использоваться для привязки нескольких адресов, каждый в своей подсети, к одному физическому интерфейсу.

source: In order for the system to forward packets between interfaces, FreeBSD must be configured as a router. Internet standards and good engineering practice prevent the FreeBSD Project from enabling this feature by default, but it can be configured to start at boot by adding this line to [.filename]#/etc/rc.conf#:
es: Para que el sistema pueda reenviar paquetes entre interfaces, FreeBSD debe ser configurado como un router. Los estándares de Internet y las buenas prácticas de ingeniería evitan que el Proyecto FreeBSD active esta característica por defecto, pero se puede configurar en el arranque añadiendo esta línea a [.filename]#/etc/rc.conf#:
ko: 시스템이 인터페이스 간 패킷을 전달하기 위해서는 FreeBSD를 라우터로 구성해야 합니다. 인터넷 표준과 좋은 엔지니어링 관행으로 인해 FreeBSD 프로젝트는 이 기능을 기본적으로 활성화하지 않지만, [.filename]#/etc/rc.conf#에 다음 줄을 추가하여 부팅 시 시작되도록 구성할 수 있습니다:
ru: Для того чтобы система могла пересылать пакеты между интерфейсами, FreeBSD должна быть настроена как маршрутизатор. Интернет-стандарты и лучшие инженерные практики не позволяют проекту FreeBSD включать эту функцию по умолчанию, но её можно настроить для запуска при загрузке, добавив следующую строку в [.filename]#/etc/rc.conf#:

source: To enable routing now, set the man:sysctl[8] variable `net.inet.ip.forwarding` to `1`. To stop routing, reset this variable to `0`.
es: Para habilitar el enrutado, establece la variable man:sysctl[8] `net.inet.ip.forwarding` a `1`. Para parar el enrutado, restablece esta variable a `0`.
ko: 지금 라우팅을 활성화하려면 man:sysctl[8] 변수 `net.inet.ip.forwarding`을 `1`로 설정합니다. 라우팅을 중지하려면 이 변수를 `0`으로 재설정합니다.
ru: Чтобы теперь включить маршрутизацию, установите переменную man:sysctl[8] `net.inet.ip.forwarding` в значение `1`. Для отключения маршрутизации сбросьте эту переменную в `0`.

source: The routing table of a router needs additional routes so it knows how to reach other networks. Routes can be either added manually using static routes or routes can be automatically learned using a routing protocol. Static routes are appropriate for small networks and this section describes how to add a static routing entry for a small network.
es: La tabla de enrutamiento de un router necesita rutas adicionales para saber cómo llegar a otras redes. Las rutas se puede añadir manualmente utilizando rutas estáticas o se pueden aprender automáticamente usando un protocolo de enrutamiento. Las rutas estáticas son apropiadas para redes pequeñas y esta sección describe cómo añadir una ruta estática para una red pequeña.
ko: 라우터의 라우팅 테이블에는 다른 네트워크에 연결하는 방법을 알 수 있도록 추가 경로가 필요합니다. 경로는 정적 경로를 사용하여 수동으로 추가하거나 라우팅 프로토콜을 사용하여 경로를 자동으로 학습할 수 있습니다. 정적 경로는 소규모 네트워크에 적합하며, 이 섹션에서는 소규모 네트워크에 정적 라우팅 항목을 추가하는 방법을 설명합니다.
ru: Таблица маршрутизации маршрутизатора требует дополнительных маршрутов, чтобы он знал, как достичь других сетей. Маршруты могут быть добавлены вручную с использованием статических маршрутов или могут быть автоматически созданы обучением с помощью протокола маршрутизации. Статические маршруты подходят для небольших сетей, и в этом разделе описывается, как добавить запись статической маршрутизации для небольшой сети.

source: For large networks, static routes quickly become unscalable. FreeBSD comes with the standard BSD routing daemon man:routed[8], which provides the routing protocols RIP, versions 1 and 2, and IRDP. Support for the BGP and OSPF routing protocols can be installed using the package:net/quagga[] package or port.
es: Para redes grandes, las rutas estáticas pronto se vuelven impracticables. FreeBSD incluye el demonio de enrutamiento BSD estándar man:routed[8], que proporciona los protocolos de enrutamiento RIP, versiones 1 y 2, y IRDP. Se puede instalar soporte para los protocolos de enrutado BGP y OSPFS usando el paquete o port package:net/quagga[].
ko: 대규모 네트워크의 경우, 정적 경로는 빠르게 확장할 수 없게 됩니다. FreeBSD는 라우팅 프로토콜인 RIP, 버전 1과 2, 그리고 IRDP를 제공하는 표준 BSD 라우팅 데몬 man:routed[8]와 함께 제공됩니다. BGP 및 OSPF 라우팅 프로토콜에 대한 지원은 package:net/quagga[] 패키지 또는 포트를 사용하여 설치할 수 있습니다.
ru: Для больших сетей статические маршруты быстро становятся неэффективными. FreeBSD включает стандартный демон маршрутизации man:routed[8], который поддерживает протоколы RIP версий 1 и 2, а также IRDP. Поддержка протоколов маршрутизации BGP и OSPF может быть установлена с помощью пакета package:net/quagga[] или порта.

source: Consider the following network:
es: Considera la siguiente red:
ko: 다음 네트워크를 생각해 보세요:
ru: Рассмотрим следующую сеть:

source: In this scenario, `RouterA` is a FreeBSD machine that is acting as a router to the rest of the Internet. It has a default route set to `10.0.0.1` which allows it to connect with the outside world. `RouterB` is already configured to use `192.168.1.1` as its default gateway.
es: En este escenario, `RouterA` es una máquina FreeBSD que está actuando como un router para el resto de Internet. Tiene una ruta por defecto establecida a `10.0.0.1` que le permite conectarse con el mundo exterior. `RouterB` ya está configurado para utilizar `192.168.1.1` como su gateway por defecto.
ko: 이 시나리오에서 `RouterA`는 나머지 인터넷에 대한 라우터 역할을 하는 FreeBSD 머신입니다. 기본 경로는 외부와 연결할 수 있도록 `10.0.0.1`로 설정되어 있습니다. `RouterB`는 이미 `192.168.1.1`을 기본 게이트웨이로 사용하도록 구성되어 있습니다.
ru: В этом сценарии `RouterA` — это машина FreeBSD, которая выступает в качестве маршрутизатора для остальной части Интернета. У нее установлен маршрут по умолчанию на `10.0.0.1`, что позволяет ей соединяться с внешним миром. `RouterB` уже настроен на использование `192.168.1.1` в качестве шлюза по умолчанию.

source: Before adding any static routes, the routing table on `RouterA` looks like this:
es: Antes de añadir ninguna ruta estática, la tabla de enrutamiento de `RouterA` tiene este aspecto:
ko: 정적 경로를 추가하기 전 `RouterA`의 라우팅 테이블은 다음과 같습니다:
ru: Прежде чем добавлять статические маршруты, таблица маршрутизации на `RouterA` выглядит следующим образом:

source: With the current routing table, `RouterA` does not have a route to the `192.168.2.0/24` network. The following command adds the `Internal Net 2` network to ``RouterA``'s routing table using `192.168.1.2` as the next hop:
es: Con la tabla de enrutamiento actual, `RouterA` no tiene una ruta a la red `192.168.2.0/24`. El siguiente comando añade la red `Internal Net 2` a la tabla de enrutamiento de `RouterA` usando `192.168.1.2` para el siguiente salto:
ko: 현재 라우팅 테이블을 사용하면 `RouterA`에 `192.168.2.0/24` 네트워크에 대한 경로가 없습니다. 다음 명령은 `192.168.1.2`를 다음 홉으로 사용하여 ``RouterA``의 라우팅 테이블에 `Internal Net 2` 네트워크를 추가합니다:
ru: С текущей таблицей маршрутизации `RouterA` не имеет маршрута к сети `192.168.2.0/24`. Следующая команда добавляет сеть `Internal Net 2` в таблицу маршрутизации ``RouterA``, используя `192.168.1.2` в качестве следующего прыжка:

source: Now, `RouterA` can reach any host on the `192.168.2.0/24` network. However, the routing information will not persist if the FreeBSD system reboots. If a static route needs to be persistent, add it to [.filename]#/etc/rc.conf#:
es: Ahora, `RouterA` puede alcanzar cualquier host en la red `192.168.2.0/24`. Sin embargo, la información de enrutamiento no persistirá si el sistema FreeBSD se reinicia. Si una ruta estática necesita ser persistente, añádela a [.filename]#/etc/rc.conf#:
ko: 이제 `RouterA`는 `192.168.2.0/24` 네트워크의 모든 호스트에 연결할 수 있습니다. 그러나, 라우팅 정보는 FreeBSD 시스템이 재부팅되면 지속되지 않습니다. 정적 경로를 영구적으로 유지해야 하는 경우 [.filename]#/etc/rc.conf#에 추가합니다:
ru: Теперь `RouterA` может достигать любого узла в сети `192.168.2.0/24`. Однако информация о маршрутизации не сохранится после перезагрузки системы FreeBSD. Если требуется, чтобы статический маршрут был постоянным, добавьте его в [.filename]#/etc/rc.conf#:

source: The `static_routes` configuration variable is a list of strings separated by a space, where each string references a route name. The variable `route_internalnet2` contains the static route for that route name.
es: La variable de configuración `static_routes` es una lista de cadenas separadas por un espacio, donde cada cadena referencia el nombre de una ruta. La variable `route_internalnet2` contiene la ruta estática para el nombre de esa ruta.
ko: `static_routes` 구성 변수는 공백으로 구분된 문자열 목록으로, 각 문자열은 경로 이름을 참조합니다. `route_internalnet2` 변수는 해당 경로 이름에 대한 정적 경로를 포함합니다.
ru: Переменная конфигурации `static_routes` представляет собой список строк, разделённых пробелом, где каждая строка ссылается на имя маршрута. Переменная `route_internalnet2` содержит статический маршрут для этого имени маршрута.

source: Using more than one string in `static_routes` creates multiple static routes. The following shows an example of adding static routes for the `192.168.0.0/24` and `192.168.1.0/24` networks:
es: Usar más de una cadena en `static_routes` crea múltiples rutas estáticas. Lo siguiente muestra un ejemplo de cómo añadir rutas estáticas para las redes `192.168.0.0/24` y `192.168.1.0/24`:
ko: `static_routes`에 둘 이상의 문자열을 사용하면 여러 개의 고정 경로가 생성됩니다. 다음은 `192.168.0.0/24` 및 `192.168.1.0/24` 네트워크에 대한 정적 경로를 추가하는 예제입니다:
ru: Использование более одной строки в `static_routes` создает несколько статических маршрутов. Ниже приведен пример добавления статических маршрутов для сетей `192.168.0.0/24` и `192.168.1.0/24`:

source: Troubleshooting
es: Resolución de problemas
ko: 문제 해결
ru: Устранение неполадок

source: When an address space is assigned to a network, the service provider configures their routing tables so that all traffic for the network will be sent to the link for the site. But how do external sites know to send their packets to the network's ISP?
es: Cuando se asigna un espacio de direcciones a una red, el proveedor de servicio configura sus propias tablas de enrutamiento de forma que todo el tráfico para la red se enviará a través del enlace para el sitio. Pero ¿cómo saben los sitios externos que tienen que enviar sus paquetes al ISP de la red?
ko: 주소 공간이 네트워크에 할당되면 서비스 제공업체는 네트워크의 모든 트래픽이 해당 사이트의 링크로 전송되도록 라우팅 테이블을 구성합니다. 하지만 외부 사이트는 어떻게 네트워크의 ISP로 패킷을 전송할지 알 수 있을까요?
ru: Когда адресное пространство назначается сети, поставщик услуг настраивает свои таблицы маршрутизации так, чтобы весь трафик для сети отправлялся по каналу связи к сайту. Но как внешние сайты узнают, что их пакеты нужно отправлять к межсетевому экрану провайдера сети?

source: There is a system that keeps track of all assigned address spaces and defines their point of connection to the Internet backbone, or the main trunk lines that carry Internet traffic across the country and around the world. Each backbone machine has a copy of a master set of tables, which direct traffic for a particular network to a specific backbone carrier, and from there down the chain of service providers until it reaches a particular network.
es: Hay un sistema que lleva el control de todos los espacios de direcciones asignados y define sus puntos de conexión a la red principal de Internet, o las líneas troncales que llevan el tráfico por todo el país y alrededor del mundo. Cada máquina troncal tiene una copia de un conjunto maestro de tablas, las cuales dirigen el tráfico para una red particular hacia un portador troncal específico, y de ahí bajando por la cadena de proveedores de servicio hasta que alcanza una red particular.
ko: 할당된 모든 주소 공간을 추적하고 인터넷 백본 또는 전국 및 전 세계로 인터넷 트래픽을 전송하는 주요 간선 회선에 대한 연결 지점을 정의하는 시스템이 있습니다. 각 백본 머신에는 특정 네트워크의 트래픽을 특정 백본 캐리어로, 그리고 특정 네트워크에 도달할 때까지 서비스 제공업체의 체인을 따라 내려가는 마스터 테이블 세트의 사본이 있습니다.
ru: Существует система, которая отслеживает все выделенные адресные пространства и определяет их точку подключения к магистрали Интернета или основным магистральным линиям, передающим интернет-трафик по стране и по всему миру. Каждая машина магистрали имеет копию главного набора таблиц, которые направляют трафик для определённой сети к конкретному магистральному оператору, а оттуда по цепочке поставщиков услуг, пока он не достигнет конкретной сети.

source: It is the task of the service provider to advertise to the backbone sites that they are the point of connection, and thus the path inward, for a site. This is known as route propagation.
es: Es tarea del proveedor de servicio avisar a los sitios troncales de que son el punto de conexión, y por tanto el camino de entrada, para un sitio. Esto se conoce como propagación de ruta.
ko: 서비스 제공업체는 백본 사이트가 사이트의 연결 지점, 즉 내부 경로임을 백본 사이트에 알리는 역할을 합니다. 이를 경로 전파(route propagation)라고 합니다.
ru: Это задача поставщика услуг — сообщить магистральным узлам, что они являются точкой подключения и, следовательно, путем внутрь для сайта. Это известно как распространение маршрутов.

source: Sometimes, there is a problem with route propagation and some sites are unable to connect. Perhaps the most useful command for trying to figure out where routing is breaking down is `traceroute`. It is useful when `ping` fails.
es: A veces, hay algún problema con la propagación de ruta y algunos sitios son incapaces de conectar. Quizás el comando más útil para intentar averiguar dónde se rompe la ruta es `traceroute`. Es útil cuando `ping` falla.
ko: 때때로 경로 전파에 문제가 발생하여 일부 사이트에 연결할 수 없는 경우가 있습니다. 라우팅이 고장난 위치를 파악하는 데 가장 유용한 명령은 아마도 `traceroute`일 것입니다. `ping`이 실패할 때 유용합니다.
ru: Иногда возникают проблемы с распространением маршрутов, и некоторые сайты не могут подключиться. Возможно, наиболее полезная команда для выяснения, где происходит разрыв маршрутизации, — это `traceroute`. Она полезна, когда `ping` не срабатывает.

source: When using `traceroute`, include the address of the remote host to connect to. The output will show the gateway hosts along the path of the attempt, eventually either reaching the target host, or terminating because of a lack of connection. For more information, refer to man:traceroute[8].
es: Cuando uses `traceroute`, incluye la dirección del host remoto al que conectar. La salida mostrará el gateway junto con el camino que sigue el intento, eventualmente alcanzando el destino, o terminando debido a la falta de conexión. Para más información, consulta man:traceroute[8].
ko: `traceroute`를 사용할 때는 연결할 원격 호스트의 주소를 포함시키세요. 출력에는 시도 경로를 따라 게이트웨이 호스트가 표시되며, 결국 대상 호스트에 도달하거나 연결 부족으로 인해 종료됩니다. 자세한 내용은 man:traceroute[8]를 참조하세요.
ru: При использовании `traceroute` укажите адрес удаленного хоста для подключения. В выводе будут показаны шлюзы на пути попытки соединения, в конечном итоге достигая целевого хоста или прерываясь из-за отсутствия соединения. Для получения дополнительной информации обратитесь к man:traceroute[8].

source: Multicast Considerations
es: Consideraciones para Multicast
ko: 멀티캐스트 고려사항
ru: Аспекты многоадресной рассылки (multicast)

source: FreeBSD natively supports both multicast applications and multicast routing. Multicast applications do not require any special configuration in order to run on FreeBSD. Support for multicast routing requires that the following option be compiled into a custom kernel:
es: FreeBSD soporta de forma nativa tanto aplicaciones multicast como enrutamiento multicast. Las aplicaciones multicast no necesitan ninguna configuración especial para ejecutarse en FreeBSD. El soporte para enrutamiento multicast requiere que la siguiente opción esté incluida en un kernel personalizado:
ko: FreeBSD는 기본적으로 멀티캐스트 애플리케이션과 멀티캐스트 라우팅을 모두 지원합니다. 멀티캐스트 애플리케이션은 FreeBSD에서 실행하기 위해 특별한 구성이 필요하지 않습니다. 멀티캐스트 라우팅을 지원하려면 다음 옵션을 커스텀 커널에 컴파일해야 합니다:
ru: FreeBSD изначально поддерживает как приложения с многоадресной рассылкой, так и маршрутизацию многоадресной рассылки. Для работы приложений с многоадресной рассылкой на FreeBSD не требуется специальной настройки. Для поддержки маршрутизации многоадресной рассылки необходимо включить следующую опцию в собственном ядре:

source: The multicast routing daemon, mrouted can be installed using the package:net/mrouted[] package or port. This daemon implements the DVMRP multicast routing protocol and is configured by editing [.filename]#/usr/local/etc/mrouted.conf# in order to set up the tunnels and DVMRP. The installation of mrouted also installs map-mbone and mrinfo, as well as their associated man pages. Refer to these for configuration examples.
es: El demonio de enrutamiento multicast, mrouted se puede instalar usando el paquete o port package:net/mrouted[]. Este demonio implementa el protocolo de enrutamiento multicast DVMRP y se configura editando el fichero [.filename]#/usr/local/etc/mrouted.conf# para configurar los túneles y DVMRP. La instalación de mrouted también instala map-mbone y mrinfo, así como sus páginas de manual. Consúltalas para ver ejemplos de configuración.
ko: 멀티캐스트 라우팅 데몬인 mrouted는 package:net/mrouted[] 패키지 또는 포트를 사용하여 설치할 수 있습니다. 이 데몬은 DVMRP 멀티캐스트 라우팅 프로토콜을 구현하며, 터널과 DVMRP를 설정하기 위해 [.filename]#/usr/local/etc/mrouted.conf#을 편집하여 구성합니다. mrouted를 설치하면 map-mbone 및 mrinfo와 관련 매뉴얼 페이지도 설치됩니다. 구성 예제는 이를 참조하세요.
ru: Демон маршрутизации многоадресной рассылки, mrouted, может быть установлен с помощью пакета package:net/mrouted[] или порта. Этот демон реализует протокол маршрутизации многоадресной рассылки DVMRP и настраивается путём редактирования файла [.filename]#/usr/local/etc/mrouted.conf# для настройки туннелей и DVMRP. Установка mrouted также устанавливает map-mbone и mrinfo, а также связанные с ними man-страницы. Обратитесь к ним за примерами конфигурации.

source: DVMRP has largely been replaced by the PIM protocol in many multicast installations. Refer to man:pim[4] for more information.
es: DVMRP ha sido ampliamente sustituido por el protocolo PIM en muchas instalaciones multicast. Consulta man:pim[4] para más información.
ko: 많은 멀티캐스트 설치에서 DVMRP는 대부분 PIM 프로토콜로 대체되었습니다. 자세한 내용은 man:pim[4]을 참조하세요.
ru: DVMRP во многом заменён протоколом PIM во многих инсталляциях с использованием многоадресной рассылки. Дополнительную информацию можно найти в man:pim[4].

source: Wireless Networking
es: Redes Inalámbricas
ko: 무선 네트워킹

source: Wireless Networking Basics
es: Fundamentos de Redes Inalámbricas
ko: 무선 네트워킹 기초

source: Most wireless networks are based on the IEEE(R) 802.11 standards. A basic wireless network consists of multiple stations communicating with radios that broadcast in either the 2.4GHz or 5GHz band, though this varies according to the locale and is also changing to enable communication in the 2.3GHz and 4.9GHz ranges.
es: La mayoría de las redes inalámbricas se basan en los estándares IEEE(R) 802.11. Una red inalámbrica básica consiste en varias estaciones que se comunican con radios que emiten en las bandas de 2.4GHz o 5GHz, aunque esto varía dependiendo del locale y también está cambiando para habilitar la comunicación en los rangos 2.3GHz y 4.9GHz.
ko: 대부분의 무선 네트워크는 IEEE(R) 802.11 표준을 기반으로 합니다. 기본 무선 네트워크는 2.4GHz 또는 5GHz 대역에서 브로드캐스팅하는 라디오와 통신하는 여러 개의 스테이션으로 구성되지만, 지역에 따라 다르며 2.3GHz 및 4.9GHz 범위에서도 통신할 수 있도록 변경되고 있습니다.

source: 802.11 networks are organized in two ways. In _infrastructure mode_, one station acts as a master with all the other stations associating to it, the network is known as a BSS, and the master station is termed an access point (AP). In a BSS, all communication passes through the AP; even when one station wants to communicate with another wireless station, messages must go through the AP. In the second form of network, there is no master and stations communicate directly. This form of network is termed an IBSS and is commonly known as an _ad-hoc network_.
es: Las redes 802.11 se organizan de dos maneras. En el _modo infraestructura_, una estación actúa como maestro y las demás estaciones se asocian a ella, la red se conoce como un BSS, y la estación maestra se denomina punto de acceso (AP). En un BSS, toda la comunicación pasa a través del AP; incluso cuando una estación se quiere comunicar con otra estación inalámbrica, los mensajes deben ir a través del AP. En el segundo modo de la red, no hay maestro y las estaciones se comunican directamente. Esta forma de red se denomina IBSS y se conoce comúnmente como una _red ad-hoc_.
ko: 802.11 네트워크는 두 가지 방식으로 구성됩니다. _infrastructure mode_에서는 한 스테이션이 다른 모든 스테이션을 연결하는 마스터 역할을 하며, 이 네트워크를 BSS라고 하고, 마스터 스테이션을 액세스 포인트(AP)라고 합니다. BSS에서는 모든 통신이 AP를 통과하며, 한 스테이션이 다른 무선 스테이션과 통신하려는 경우에도 메시지는 AP를 거쳐야 합니다. 두 번째 형태의 네트워크에서는 마스터가 없으며 스테이션이 직접 통신합니다. 이러한 형태의 네트워크를 IBSS라고 하며 일반적으로 _ad-hoc network_라고 합니다.

source: 802.11 networks were first deployed in the 2.4GHz band using protocols defined by the IEEE(R) 802.11 and 802.11b standard. These specifications include the operating frequencies and the MAC layer characteristics, including framing and transmission rates, as communication can occur at various rates. Later, the 802.11a standard defined operation in the 5GHz band, including different signaling mechanisms and higher transmission rates. Still later, the 802.11g standard defined the use of 802.11a signaling and transmission mechanisms in the 2.4GHz band in such a way as to be backwards compatible with 802.11b networks.
es: Las redes 802.11 se desplegaron por primera vez en la banda 2.4GHz usando protocolos definidos por los estándares 802.11 y 802.11b de IEEE(R). Estas especificaciones incluyen las frecuencias de operación y las características de la capa MAC, incluyendo las tasas "framing" y de transmisión, ya que la comunicación puede ocurrir a diferentes velocidades. Posteriormente el estándar 802.11a definió la operación en la banda 5GHz, incluyendo diferentes mecanismos de señalización y tasas de transmisión más elevadas. Algo más tarde, el estándar 802.11g definió el uso de los mecanismos de transmisión y señalización de 802.11a en la banda de 2.4GHz de tal modo que fuera compatible hacia atrás con las redes 802.11b.
ko: 802.11 네트워크는 IEEE(R) 802.11 및 802.11b 표준에 정의된 프로토콜을 사용하여 2.4GHz 대역에 처음 배포되었습니다. 이러한 사양에는 다양한 속도로 통신이 이루어질 수 있으므로 작동 주파수와 프레이밍 및 전송 속도를 포함한 MAC 계층 특성이 포함됩니다. 이후 802.11a 표준은 다양한 신호 메커니즘과 더 높은 전송 속도를 포함하여 5GHz 대역에서의 작동을 정의했습니다. 그 후 802.11g 표준에서는 802.11b 네트워크와 역호환이 가능하도록 2.4GHz 대역에서 802.11a 신호 및 전송 메커니즘을 사용하도록 정의했습니다.
