Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: For laptop users, it is usually desirable to configure the wireless device as a secondary which is only used when the Ethernet connection is not available. With man:lagg[4], it is possible to configure a failover which prefers the Ethernet connection for both performance and security reasons, while maintaining the ability to transfer data over the wireless connection.
es: Para los usuarios de portátiles, normalmente es deseable configurar el dispositivo inalámbrico como un secundario que sólo usa cuando la conexión Ethernet no está disponible. Con man:lagg[4], es posible configurar un failover que prefiera la conexión Ethernet tanto por rendimiento como por razones de seguridad, mientras que se mantiene la posibilidad de transferir datos por la conexión inalámbrica.
ko: 노트북 사용자의 경우 일반적으로 이더넷 연결을 사용할 수 없을 때만 무선 장치를 구성하는 것이 바람직합니다. man:lagg[4]를 사용하면 무선 연결을 통해 데이터를 전송하는 기능을 유지하면서 성능 및 보안상의 이유로 이더넷 연결을 선호하는 장애 조치를 구성할 수 있습니다.
ru: Для пользователей ноутбуков обычно желательно настроить беспроводное устройство как вторичное, которое используется только при отсутствии Ethernet-подключения. С помощью man:lagg[4] можно настроить отказоустойчивость, отдавая предпочтение Ethernet-подключению как по соображениям производительности, так и безопасности, сохраняя при этом возможность передачи данных через беспроводное соединение.

source: This is achieved by overriding the Ethernet interface's MAC address with that of the wireless interface.
es: Esto se consigue sobrescribiendo la dirección MAC del interfaz Ethernet con el de la interfaz inalámbrica.
ko: 이는 이더넷 인터페이스의 MAC 주소를 무선 인터페이스의 MAC 주소로 재정의하면 됩니다.
ru: Это достигается путем замены MAC-адреса Ethernet-интерфейса на MAC-адрес беспроводного интерфейса.

source: In theory, either the Ethernet or wireless MAC address can be changed to match the other. However, some popular wireless interfaces lack support for overriding the MAC address. We therefore recommend overriding the Ethernet MAC address for this purpose.
es: En teoría, cualquiera de las dos direcciones MAC (Ethernet o inalámbrica) se puede cambiar para igualarse a la otra. Sin embargo, algunas interfaces inalámbricas populares carecen del soporte para sobrescribir la dirección MAX. Por lo tanto para este propósito recomendamos sobrescribir la dirección MAC Ethernet.
ko: 이론적으로는 이더넷 또는 무선 MAC 주소를 서로 일치하도록 변경할 수 있습니다. 하지만 일부 인기 있는 무선 인터페이스는 MAC 주소 재정의 기능을 지원하지 않습니다. 따라서 이더넷 MAC 주소를 재정의하는 것이 좋습니다.
ru: Теоретически, либо Ethernet, либо беспроводной MAC-адрес можно изменить, чтобы они были одинаковыми. Однако некоторые популярные беспроводные интерфейсы не поддерживают переопределение MAC-адреса. Поэтому мы рекомендуем переопределить Ethernet MAC-адрес для этой цели.

source: If the driver for the wireless interface is not loaded in the `GENERIC` or custom kernel, and the computer is running FreeBSD {rel121-current}, load the corresponding [.filename]#.ko# in [.filename]#/boot/loader.conf# by adding `*driver_load="YES"*` to that file and rebooting. Another, better way is to load the driver in [.filename]#/etc/rc.conf# by adding it to `kld_list` (see man:rc.conf[5] for details) in that file and rebooting. This is needed because otherwise the driver is not loaded yet at the time the man:lagg[4] interface is set up.
es: Si el controlador para el interfaz inalámbrico no está cargado en el kernel `GENERIC` o en el personalizado, y el ordenador está ejecutando FreeBSD{rel121-current}, carga el [.filename]#.ko# correspondiente en [.filename]#/boot/loader.conf# añadiendo `*driver_load="YES"*` a ese fichero y después reiniciando. Otra forma mejor es cargar el driver en [.filename]#/etc/rc.conf# añadiéndolo a `kld_list` (consulta man:rc.conf[5] para los detalles) en ese fichero y reiniciando. Esto es necesario porque de otra forma el controlador no está todavía cargado en el momento en el que se configura el interfaz man:lagg[4].
ko: 무선 인터페이스용 드라이버가 `GENERIC` 또는 커스텀 커널에 로드되어 있지 않고 컴퓨터가 FreeBSD {rel121-current}를 실행 중인 경우, 해당 파일에 `*driver_load="YES"*`를 추가하고 재부팅하여 [.filename]#/boot/loader.conf#에 해당 [.filename]#.ko#를 로드합니다. 또 다른 더 좋은 방법은 해당 파일의 `kld_list`(자세한 내용은 man:rc.conf[5] 참조)에 드라이버를 추가하고 재부팅하여 [.filename]#/etc/rc.conf#에 드라이버를 로드하는 것입니다. 그렇지 않으면 man:lagg[4] 인터페이스가 설정될 때 드라이버가 아직 로드되지 않기 때문에 이 작업이 필요합니다.
ru: Если драйвер для беспроводного интерфейса не загружен в `GENERIC` или собственном ядре, и компьютер работает под FreeBSD {rel121-current}, загрузите соответствующий [.filename]#.ko# в [.filename]#/boot/loader.conf#, добавив `*driver_load="YES"*` в этот файл и перезагрузив систему. Другой, более предпочтительный способ — загрузить драйвер в [.filename]#/etc/rc.conf#, добавив его в `kld_list` (подробности см. в man:rc.conf[5]) в этом файле и перезагрузив систему. Это необходимо, потому что в противном случае драйвер ещё не загружен к моменту настройки интерфейса man:lagg[4].

source: In this example, the Ethernet interface, _re0_, is the master and the wireless interface, _wlan0_, is the failover. The _wlan0_ interface was created from the _ath0_ physical wireless interface, and the Ethernet interface will be configured with the MAC address of the wireless interface. First, bring the wireless interface up (replacing _FR_ with your own 2-letter country code), but do not set an IP address. Replace _wlan0_ to match the system's wireless interface name:
es: En este ejemplo, el interfaz Ethernet, _re0_, es el maestro y el interfaz inalámbrico, _wlan0_, es el recambio. El interfaz _wlan0_ ha sido creado a partir del interfaz inalámbrico físico _ath0_, y el interfaz Ethernet se configurará con la dirección MAC del interfaz inalámbrico. Primero, levanta el interfaz inalámbrico (reemplaza _FR_ con tu código de país de dos letras), pero no establezcas una dirección IP. Reemplaza _wlan0_ con el nombre del interfaz inalámbrico del sistema:
ko: 이 예제에서는 이더넷 인터페이스 _re0_가 마스터이고 무선 인터페이스 _wlan0_이 페일오버입니다. _wlan0_ 인터페이스는 _ath0_ 물리적 무선 인터페이스로부터 생성되었으며, 이더넷 인터페이스는 무선 인터페이스의 MAC 주소로 구성됩니다. 먼저 무선 인터페이스를 불러오되(_FR_을 자신의 2글자 국가 코드로 바꾸세요), IP 주소는 설정하지 마세요. 시스템의 무선 인터페이스 이름과 일치하도록 _wlan0_을 바꿉니다:
ru: В этом примере Ethernet-интерфейс _re0_ является основным, а беспроводной интерфейс _wlan0_ — резервным. Интерфейс _wlan0_ был создан на основе физического беспроводного интерфейса _ath0_, а Ethernet-интерфейс будет настроен с MAC-адресом беспроводного интерфейса. Сначала включите беспроводной интерфейс (замените _FR_ на код вашей страны из 2 букв), но не задавайте IP-адрес. Замените _wlan0_ на имя беспроводного интерфейса вашей системы:

source: Now you can determine the MAC address of the wireless interface:
es: Ahora puedes saber la dirección MAC del interfaz inalámbrico:
ko: 이제 무선 인터페이스의 MAC 주소를 확인할 수 있습니다:
ru: Теперь вы можете определить MAC-адрес беспроводного интерфейса:

source: The `ether` line will contain the MAC address of the specified interface. Now, change the MAC address of the Ethernet interface to match:
es: La línea `ether` contendrá la dirección MAC del interfaz especificado. Ahora, cambia la dirección MAC del interfaz Ethernet para que concuerde:
ko: `ether` 줄에는 지정된 인터페이스의 MAC 주소가 포함됩니다. 이제 이더넷 인터페이스의 MAC 주소를 일치하도록 변경합니다:
ru: Строка `ether` будет содержать MAC-адрес указанного интерфейса. Теперь измените MAC-адрес интерфейса Ethernet, чтобы он совпадал:

source: Make sure the _re0_ interface is up, then create the man:lagg[4] interface with _re0_ as master with failover to _wlan0_:
es: Asegúrate de que el interfaz _re0_ está levantado, luego crea el interfaz man:lagg[4] con _re0_ como maestro con _wlan0_ como recambio:
ko: _re0_ 인터페이스가 가동 중인지 확인한 다음, _wlan0_로 장애 조치하고 _re0_를 마스터로 하여 man:lagg[4] 인터페이스를 생성합니다:
ru: Убедитесь, что интерфейс _re0_ включен, затем создайте интерфейс man:lagg[4] с _re0_ в качестве основного с переключением на _wlan0_ в случае отказа:

source: Then, start the DHCP client to obtain an IP address:
es: Después, arranca el cliente DHCP para obtener una dirección IP:
ko: 그런 다음 DHCP 클라이언트를 시작하여 IP 주소를 얻습니다:
ru: Затем запустите DHCP-клиент для получения IP-адреса:

source: Diskless Operation with PXE
es: Operación sin Disco con PXE
ko: PXE를 사용한 무 디스크 운영
ru: Запуск системы по сети (PXE) без использования локальных накопителей

source: The Intel(R) Preboot eXecution Environment (PXE) allows an operating system to boot over the network. For example, a FreeBSD system can boot over the network and operate without a local disk, using file systems mounted from an NFS server. PXE support is usually available in the BIOS. To use PXE when the machine starts, select the `Boot from network` option in the BIOS setup or type a function key during system initialization.
es: El Preboot eXecution Environment (PXE) de Intel(R) permite a un sistema operativo arrancar por red. Por ejemplo, un sistema FreeBSD puede arrancar sobre la red y operar sin un disco local, usando sistemas de ficheros montados desde un servidor NFS. El soporte de PXE normalmente está disponible en la BIOS. Para usar PXE cuando arranca la máquina, selecciona la opción `Arrancar desde la red` en la configuración de la BIOS o teclea una tecla de función durante la inicialización del sistema.
ko: 인텔(R) 사전 부팅 실행 환경(Preboot eXecution Environment, PXE)을 사용하면 네트워크를 통해 운영 체제를 부팅할 수 있습니다. 예를 들어, FreeBSD 시스템은 네트워크를 통해 부팅하고 로컬 디스크 없이 NFS 서버에서 마운트된 파일 시스템을 사용하여 작동할 수 있습니다. PXE 지원은 일반적으로 BIOS에서 사용할 수 있습니다. 시스템을 시작할 때 PXE를 사용하려면 BIOS 설정에서 `Boot from network` 옵션을 선택하거나 시스템 초기화 중에 기능 키를 입력합니다.
ru: Встроенная среда исполнения Intel(R) Preboot eXecution Environment (PXE) позволяет операционной системе загружаться по сети. Например, система FreeBSD может загружаться по сети и работать без локального диска, используя файловые системы, смонтированные с NFS-сервера. Поддержка PXE обычно доступна в BIOS. Чтобы использовать PXE при запуске машины, выберите опцию `Загрузка по сети` в настройках BIOS или нажмите функциональную клавишу во время инициализации системы.

source: In order to provide the files needed for an operating system to boot over the network, a PXE setup also requires properly configured DHCP, TFTP, and NFS servers, where:
es: Para proporcionar a un sistema operativo los ficheros necesarios para que arranque sobre la red, la configuración de PXE también necesita configurar apropiadamente DHCP, TFTP y los servidores NFS, donde:
ko: 운영 체제가 네트워크를 통해 부팅하는 데 필요한 파일을 제공하기 위해 PXE 설정에는 DHCP, TFTP 및 NFS 서버가 올바르게 구성되어 있어야 합니다:
ru: Для предоставления файлов, необходимых для загрузки операционной системы по сети, настройка PXE также требует правильно настроенных серверов DHCP, TFTP и NFS, где:

source: Initial parameters, such as an IP address, executable boot filename and location, server name, and root path are obtained from the DHCP server.
es: Parámetros iniciales, como una dirección IP, el nombre del fichero ejecutable de arranque y su localización, el nombre del servidor, y la ruta raíz se obtienen del servidor DHCP.
ko: IP 주소, 실행 가능한 부팅 파일 이름 및 위치, 서버 이름 및 루트 경로와 같은 초기 매개 변수는 DHCP 서버에서 가져옵니다.
ru: Исходные параметры, такие как IP-адрес, имя загружаемого исполняемого файла и его расположение, имя сервера и корневой путь, получаются от сервера DHCP.

source: The operating system loader file is booted using TFTP.
es: El fichero del cargador del sistema operativo se obtiene mediante TFTP.
ko: 운영 체제 로더 파일은 TFTP를 사용하여 부팅됩니다.
ru: Файл загрузчика операционной системы загружается с использованием TFTP.

source: The file systems are loaded using NFS.
es: Los sistemas de ficheros se cargan usando NFS.
ko: 파일 시스템은 NFS를 사용하여 로드됩니다.
ru: Файловые системы загружаются с использованием NFS.

source: When a computer PXE boots, it receives information over DHCP about where to obtain the initial boot loader file. After the host computer receives this information, it downloads the boot loader via TFTP and then executes the boot loader. In FreeBSD, the boot loader file is [.filename]#/boot/pxeboot#. After [.filename]#/boot/pxeboot# executes, the FreeBSD kernel is loaded and the rest of the FreeBSD bootup sequence proceeds, as described in crossref:boot[boot,The FreeBSD Booting Process].
es: Cuando un ordenador arranca mediante PXE, recibe información a través de DHCP sobre dónde obtener el fichero inicial del cargador de arranque. Después de que el ordenador recibe esta información, descarga el cargador de arranque vía TFTP y después ejecuta el cargador de arranque. En FreeBSD, el fichero del cargador de arranque es [.filename]#/boot/pxeboot#. Después de que [.filename]#/boot/pxeboot# se ejecute, se carga el kernel de FreeBSD y el resto de la secuencia de arranque de FreeBSD prosigue su curso como se describe en crossref:boot[boot,El Proceso de Arranque de FreeBSD].
ko: 컴퓨터 PXE가 부팅되면 DHCP를 통해 초기 부트 로더 파일을 얻을 수 있는 위치에 대한 정보를 수신합니다. 호스트 컴퓨터는 이 정보를 수신한 후 TFTP를 통해 부트 로더를 다운로드한 다음 부트 로더를 실행합니다. FreeBSD에서 부트 로더 파일은 [.filename]#/boot/pxeboot#입니다. [.filename]#/boot/pxeboot#이 실행되고 나면 FreeBSD 커널이 로드되고 나머지 FreeBSD 부팅 시퀀스는 crossref:boot[boot,The FreeBSD Booting Process]에 설명된 대로 진행됩니다.
ru: Когда компьютер загружается по PXE, он получает информацию через DHCP о том, где получить начальный загрузочный файл. После того как хост-компьютер получает эту информацию, он загружает загрузчик через TFTP и затем выполняет его. В FreeBSD загрузочный файл называется [.filename]#/boot/pxeboot#. После выполнения [.filename]#/boot/pxeboot# загружается ядро FreeBSD, и продолжается остальная последовательность загрузки FreeBSD, как описано в crossref:boot[boot,Процесс загрузки FreeBSD].

source: This section describes how to configure these services on a FreeBSD system so that other systems can PXE boot into FreeBSD. Refer to man:diskless[8] for more information.
es: Esta sección describe cómo configurar estos servicios en un sistema FreeBSD de forma que otros sistemas puedan arrancar mediante PXE en FreeBSD. Consulta man:diskless[8] para más información.
ko: 이 섹션에서는 다른 시스템이 FreeBSD로 PXE 부팅할 수 있도록 FreeBSD 시스템에서 이러한 서비스를 구성하는 방법을 설명합니다. 자세한 내용은 man:diskless[8]를 참조하십시오.
ru: Этот раздел описывает, как настроить эти службы в системе FreeBSD, чтобы другие системы могли загружаться по PXE в FreeBSD. Дополнительную информацию можно найти в man:diskless[8].

source: As described, the system providing these services is insecure. It should live in a protected area of a network and be untrusted by other hosts.
es: Como se ha descrito, el sistema que proporciona estos servicios no es seguro. Debería vivir en un área protegida de la red y otros hosts no deberían confiar en él.
ko: 설명한 대로 이러한 서비스를 제공하는 시스템은 안전하지 않습니다. 네트워크의 보호된 영역에 있어야 하며 다른 호스트가 신뢰하지 않아야 합니다.
ru: Как уже упоминалось, система, предоставляющая эти службы, является небезопасной. Она должна находиться в защищённой части сети и не доверяться другим хостам.

source: Setting Up the PXE Environment
es: Configurando el Entorno PXE
ko: PXE 환경 설정하기
ru: Настройка окружения PXE

source: The steps shown in this section configure the built-in NFS and TFTP servers. The next section demonstrates how to install and configure the DHCP server. In this example, the directory which will contain the files used by PXE users is [.filename]#/b/tftpboot/FreeBSD/install#. It is important that this directory exists and that the same directory name is set in both [.filename]#/etc/inetd.conf# and [.filename]#/usr/local/etc/dhcpd.conf#.
es: Las pasos que se muestran en esta sección configuran los servidores NFS y TFTP incluidos. La siguiente sección muestra cómo instalar y configurar el servidor DHCP. En este ejemplo, el dirección que contendrá los ficheros usados por los usuarios PXE es [.filename]#/b/tftpboot/FreeBSD/install#. Es importante que este directorio exista y que el nombre del directorio esté configurado tanto en [.filename]#/etc/inetd.conf# como en [.filename]#/usr/local/etc/dhcpd.conf#.
ko: 이 섹션에 표시된 단계는 기본 제공 NFS 및 TFTP 서버를 구성합니다. 다음 섹션에서는 DHCP 서버를 설치하고 구성하는 방법을 설명합니다. 이 예에서 PXE 사용자가 사용하는 파일이 들어 있는 디렉터리는 [.filename]#/b/tftpboot/FreeBSD/install#입니다. 이 디렉터리가 존재해야 하며 [.filename]#/etc/inetd.conf#와 [.filename]#/usr/local/etc/dhcpd.conf#에 동일한 디렉터리 이름이 설정되어 있어야 합니다.
ru: В этом разделе показаны шаги по настройке встроенных серверов NFS и TFTP. В следующем разделе будет продемонстрировано, как установить и настроить сервер DHCP. В данном примере каталог, который будет содержать файлы, используемые пользователями PXE, называется [.filename]#/b/tftpboot/FreeBSD/install#. Важно, чтобы этот каталог существовал и чтобы одно и то же имя каталога было указано как в [.filename]#/etc/inetd.conf#, так и в [.filename]#/usr/local/etc/dhcpd.conf#.

source: The command examples below assume use of the man:sh[1] shell. man:csh[1] and man:tcsh[1] users will need to start a man:sh[1] shell or adapt the commands to man:csh[1] syntax.
es: Los ejemplos de comandos que siguen asumen el uso del shell man:sh[1]. Los usuarios de man:chs[1] y man:tcsh[1] tendrán que iniciar un shell man:sh[1] o adaptar los comandos a la sintaxis de man:csh[1].
ko: 아래 명령 예제는 man:sh[1] 셸을 사용한다고 가정합니다. man:csh[1] 및 man:tcsh[1] 사용자는 man:sh[1] 셸을 시작하거나 명령을 man:csh[1] 구문에 맞게 조정해야 합니다.
ru: Примеры команд ниже предполагают использование оболочки man:sh[1]. Пользователям man:csh[1] и man:tcsh[1] потребуется запустить оболочку man:sh[1] или адаптировать команды к синтаксису man:csh[1].

source: Create the root directory which will contain a FreeBSD installation to be NFS mounted:
es: Crea el directorio raíz que contendrá la instalación de FreeBSD que será montada por NFS:
ko: NFS를 마운트할 FreeBSD 설치가 포함될 루트 디렉터리를 생성합니다:
ru: Создайте корневой каталог, который будет содержать установку FreeBSD для монтирования по NFS:

source: Enable the NFS server by adding this line to [.filename]#/etc/rc.conf#:
es: Activa el servidor NFS añadiendo esta línea a [.filename]#/etc/rc.conf#:
ko: 이 줄을 [.filename]#/etc/rc.conf#에 추가하여 NFS 서버를 활성화합니다:
ru: Включите сервер NFS, добавив следующую строку в [.filename]#/etc/rc.conf#:

source: Export the diskless root directory via NFS by adding the following to [.filename]#/etc/exports#:
es: Exporta el directorio raíz del sistema sin disco vía NFS añadiendo lo siguiente a [.filename]#/etc/exports#:
ko: [.filename]#/etc/exports#에 다음을 추가하여 NFS를 통해 디스크 없는 루트 디렉터리를 내보냅니다:
ru: Экспортируйте корневую директорию бездисковой системы через NFS, добавив следующее в [.filename]#/etc/exports#:

source: Start the NFS server:
es: Arranca el servidor NFS:
ko: NFS server를 시작합니다:
ru: Запустите сервер NFS:

source: Enable man:inetd[8] by adding the following line to [.filename]#/etc/rc.conf#:
es: Activa man:inetd[8] añadiendo la siguiente línea a [.filename]#/etc/rc.conf#:
ko: [.filename]#/etc/rc.conf#에 다음 줄을 추가하여 man:inetd[8]을 활성화합니다:
ru: Включите man:inetd[8], добавив следующую строку в [.filename]#/etc/rc.conf#:

source: Uncomment the following line in [.filename]#/etc/inetd.conf# by making sure it does not start with a `+#+` symbol:
es: Descomenta la siguiente línea en [.filename]#/etc/inetd.conf# asegurándote de que no comienza con un símbolo `+#+`:
ko: [.filename]#/etc/inetd.conf#의 다음 줄이 `+#+` 기호로 시작하지 않는지 확인하여 주석 처리를 해제합니다:
ru: Раскомментируйте следующую строку в [.filename]#/etc/inetd.conf#, убедившись, что она не начинается с символа `+#+`:

source: Some PXE versions require the TCP version of TFTP. In this case, uncomment the second `tftp` line which contains `stream tcp`.
es: Algunas versiones de PXE necesitan la versión TCP de TFTP. En este caso, descomenta la segunda línea `tftp` que contiene `stream tcp`.
ko: 일부 PXE 버전은 TFTP의 TCP 버전이 필요합니다. 이 경우 `stream tcp`가 포함된 두 번째 `tftp` 줄의 주석 처리를 해제합니다.

source: Start man:inetd[8]:
es: Arranca man:inetd[8]:
ko: man:inetd[8]를 시작합니다:
ru: Запустите man:inetd[8]:

source: Install the base system into [.filename]#${NFSROOTDIR}#, either by decompressing the official archives or by rebuilding the FreeBSD kernel and userland (refer to crossref:cutting-edge[makeworld,“Updating FreeBSD from Source”] for more detailed instructions, but do not forget to add `DESTDIR=_${NFSROOTDIR}_` when running the `make installkernel` and `make installworld` commands.
es: Instala el sistema base en [.filename]#${NFSROOTDIR}#, bien descomprimiendo los archivos oficiales o recompilando el kernel de FreeBSD y el espacio de usuario (consulta crossref:cutting-edge[makeworld,“Actualizando FreeBSD desde las Fuentes”] para instrucciones más detalladas, pero no olvides añadir `DESTDIR=_${NFSROOTDIR}_` cuando ejecutes los comands `make installkernel` y `make installworld`.
ko: 공식 아카이브의 압축을 풀거나 FreeBSD 커널과 사용자 공간을 다시 빌드하여 [.filename]#${NFSROOTDIR}#에 기본 시스템을 설치합니다(자세한 지침은 crossref:cutting-edge[makeworld,“Updating FreeBSD from Source”]를 참고하되, `make installkernel` 및 `make installworld` 명령을 실행할 때 `DESTDIR=_${NFSROOTDIR}_`를 추가하는 것을 잊지 마세요).
ru: Установите базовую систему в [.filename]#${NFSROOTDIR}#, либо распаковав официальные архивы, либо пересобрав ядро и пользовательское окружение FreeBSD (подробные инструкции можно найти в crossref:cutting-edge[makeworld,“Обновление FreeBSD из исходного кода”], но не забудьте добавить `DESTDIR=_${NFSROOTDIR}_` при выполнении команд `make installkernel` и `make installworld`).

source: Test that the TFTP server works and can download the boot loader which will be obtained via PXE:
es: Comprueba que el servidor TFTP funciona y que puede descargar el cargador de arranque que se obtendrá vía PXE:
ko: TFTP 서버가 작동하고 PXE를 통해 얻을 수 있는 부트 로더를 다운로드할 수 있는지 테스트합니다:
ru: Проверьте, что TFTP-сервер работает и может загрузить загрузчик, который будет получен через PXE:

source: Edit [.filename]#${NFSROOTDIR}/etc/fstab# and create an entry to mount the root file system over NFS:
es: Edita [.filename]#${NFSROOTDIR}/etc/fstab# y crea una entrada para montar el sistema de ficheros raíz sobre NFS:
ko: [.filename]#${NFSROOTDIR}/etc/fstab#을 편집하고 NFS를 통해 루트 파일 시스템을 마운트하는 항목을 만듭니다:
ru: Отредактируйте файл [.filename]#${NFSROOTDIR}/etc/fstab# и создайте запись для монтирования корневой файловой системы через NFS:

source: Replace _myhost.example.com_ with the hostname or IP address of the NFS server. In this example, the root file system is mounted read-only in order to prevent NFS clients from potentially deleting the contents of the root file system.
es: Reemplaza _myhost.example.com_ con el nombre de la máquina o la dirección IP del servidor NFS. En este ejemplo, el sistema de ficheros raíz está montado como solo lectura para evitar que los clientes NFS puedan borrar los contenidos del sistema de ficheros raíz.
ko: _myhost.example.com_을 NFS 서버의 호스트 이름 또는 IP 주소로 바꿉니다. 이 예제에서는 루트 파일 시스템을 읽기 전용으로 마운트하여 NFS 클라이언트가 루트 파일 시스템의 내용을 삭제할 가능성을 방지합니다.
ru: Замените _myhost.example.com_ на имя хоста или IP-адрес сервера NFS. В этом примере корневая файловая система монтируется в режиме только для чтения, чтобы предотвратить возможное удаление содержимого корневой файловой системы клиентами NFS.

source: Set the root password in the PXE environment for client machines which are PXE booting :
es: Establece la contraseña de root en el entorno PXE para las máquinas cliente que están arrancando mediante PXE:
ko: PXE 부팅 중인 클라이언트 머신의 PXE 환경에서 루트 암호를 설정합니다:
ru: Установите пароль root в среде PXE для клиентских машин, загружающихся через PXE:
