Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: If the original master server becomes available again, `hostc.example.org` will not release the virtual IP address back to it automatically. For this to happen, preemption has to be enabled. The feature is disabled by default, it is controlled via the man:sysctl[8] variable `net.inet.carp.preempt`. The administrator can force the backup server to return the IP address to the master:
es: Si el maestro original vuelve a estar disponible, `hostc.example.org` no liberará la dirección IP virtual automáticamente. Para que esto suceda, se tiene que habilitar la preemptividad. Esto está deshabilitado por defecto, está controlado mediante la variable `net.inet.carp.preempt` de man:sysctl[8]. El administrador puede forzar a que el servidor de reemplazo devuelva la dirección IP al maestro:
ko: 원래 마스터 서버를 다시 사용할 수 있게 되면 `hostc.example.org`는 가상 IP 주소를 자동으로 다시 해제하지 않습니다. 이렇게 하려면 선점 기능을 활성화해야 합니다. 이 기능은 기본적으로 비활성화되어 있으며, man:sysctl[8] 변수 `net.inet.carp.preempt`를 통해 제어됩니다. 관리자는 백업 서버가 마스터에게 IP 주소를 반환하도록 강제할 수 있습니다:
ru: Если исходный главный сервер снова станет доступен, `hostc.example.org` не освободит виртуальный IP-адрес автоматически. Чтобы это произошло, необходимо включить вытеснение. Эта функция отключена по умолчанию и управляется через переменную man:sysctl[8] `net.inet.carp.preempt`. Администратор может принудительно вернуть IP-адрес главному серверу с резервного сервера:

source: Once the configuration is complete, either restart networking or reboot each system. High availability is now enabled.
es: Una vez completada la configuración, reinicia la red o reinicia cada sistema. Ahora la alta disponibilidad está habilitada.
ko: 구성이 완료되면 네트워킹을 다시 시작하거나 각 시스템을 재부팅합니다. 이제 고가용성이 활성화되었습니다.
ru: Как только настройка завершена, перезапустите сеть или перезагрузите каждую систему. Высокая доступность теперь включена.

source: CARP functionality can be controlled via several man:sysctl[8] variables documented in the man:carp[4] manual pages. Other actions can be triggered from CARP events by using man:devd[8].
es: La funcionalidad CARP se puede controlar mediante varias variables de man:sysctl[8] que están documentadas en las páginas de manual man:carp[4]. Se pueden disparar otras acciones a partir de eventos CARP usando man:devd[8].
ko: CARP 기능은 man:carp[4] 매뉴얼 페이지에 설명된 여러 man:sysctl[8] 변수를 통해 제어할 수 있습니다. man:devd[8]를 사용하여 CARP 이벤트에서 다른 작업을 트리거할 수 있습니다.
ru: Функциональность CARP может управляться с помощью нескольких переменных man:sysctl[8], описанных в man:carp[4]. Другие действия могут быть запущены при событиях CARP с использованием man:devd[8].

source: Using CARP on FreeBSD 9 and Earlier
es: Usando CARP en FreeBSD 9 y Anteriores
ko: FreeBSD 9 및 이전 버전에서 CARP 사용하기

source: The configuration for these versions of FreeBSD is similar to the one described in the previous section, except that a CARP device must first be created and referred to in the configuration.
es: La configuración para estas versiones de FreeBSD es similar a la descrita en la sección previa, excepto que se tiene que crear primero un dispositivo CARP y hacer referencia a él en la configuración.
ko: 이러한 버전의 FreeBSD에 대한 구성은 이전 섹션에서 설명한 구성과 유사하지만, 먼저 CARP 장치를 생성하고 구성에서 참조해야 한다는 점이 다릅니다.

source: Enable boot-time support for CARP by loading the [.filename]#if_carp.ko# kernel module in [.filename]#/boot/loader.conf#:
es: Activa el soporte de CARP al arrancar cargando el módulo del kernel [.filename]#if_carp.ko# en [.filename]#/boot/loader.conf#:
ko: [.filename]#/boot/loader.conf#에 [.filename]#if_carp.ko# 커널 모듈을 로드하여 CARP에 대한 부팅 시간 지원을 사용하도록 설정합니다:

source: Next, on each host, create a CARP device:
es: Después, en cada host, crea un dispositivo CARP:
ko: 그런 다음 각 호스트에서 CARP 장치를 생성합니다:

source: Set the hostname, management IP address, the shared IP address, and VHID by adding the required lines to [.filename]#/etc/rc.conf#. Since a virtual CARP device is used instead of an alias, the actual subnet mask of `/24` is used instead of `/32`. Here are the entries for `hosta.example.org`:
es: Establece el nombre de host, dirección IP de gestión, dirección IP compartida, y VHID añadiendo las líneas necesarias a [.filename]#/etc/rc.conf#. Puesto que se usa un dispositivo CARP virtual en lugar de un alias, se usa la máscara de subred `/24` en lugar de `/32`. Aquí están las entradas para `hosta.example.org`:
ko: [.filename]#/etc/rc.conf#에 필요한 줄을 추가하여 호스트 이름, 관리 IP 주소, 공유 IP 주소 및 VHID를 설정합니다. 별칭 대신 가상 CARP 장치가 사용되므로 실제 서브넷 마스크는 `/32` 대신 `/24`가 사용됩니다. 다음은 `hosta.example.org`에 대한 항목입니다:

source: On `hostb.example.org`:
es: En `hostb.example.org`:
ko: `hostb.example.org`에서:

source: The third machine, `hostc.example.org`, is configured to handle failover from either of the master hosts:
es: La tercera máquina, `hostc.example.org`, se configura para manejar el failover de cualquiera de los hosts maestros:
ko: 세 번째 머신인 `hostc.example.org`는 마스터 호스트 중 하나에서 장애 조치를 처리하도록 구성되어 있습니다:

source: Preemption is disabled in the [.filename]#GENERIC# FreeBSD kernel. If preemption has been enabled with a custom kernel, `hostc.example.org` may not release the IP address back to the original content server. The administrator can force the backup server to return the IP address to the master with the command:
es: La preemptividad está deshabilitada en el kernel [.filename]#GENERIC# de FreeBSD. Si la preemptividad se ha habilitado con un kernel personalizado `hostc.example.org` podría no devolver la dirección IP al servidor original. El administrador puede forzar que el servidor de reemplazo devuelve al dirección IP al maestro con el comando:
ko: [.filename]#GENERIC# FreeBSD 커널에서는 선점 기능이 비활성화되어 있습니다. 사용자 정의 커널에서 선점을 사용하도록 설정한 경우 `hostc.example.org`가 IP 주소를 원래 콘텐츠 서버로 다시 릴리스하지 못할 수 있습니다. 관리자는 명령을 사용하여 백업 서버가 IP 주소를 마스터에게 반환하도록 강제할 수 있습니다:

source: This should be done on the [.filename]#carp# interface which corresponds to the correct host.
es: Esto se debería hacer en la interfaz [.filename]#carp# que se corresponda con el host correcto.
ko: 이 작업은 올바른 호스트에 해당하는 [.filename]#carp# 인터페이스에서 수행해야 합니다.

source: VLANs are a way of virtually dividing up a network into many different subnetworks, also referred to as segmenting. Each segment will have its own broadcast domain and be isolated from other VLANs.
es: VLANs son una forma de dividir una red de forma virtual en muchas subredes diferentes, también llamado segmentación. Cada segmento tendrá su dominio broadcast y está aislado de otras VLANs.
ko: VLAN은 네트워크를 가상으로 여러 개의 하위 네트워크로 분할하는 방법으로, 세그멘테이션이라고도 합니다. 각 세그먼트는 자체 브로드캐스트 도메인을 가지며 다른 VLAN으로부터 격리됩니다.
ru: Виртуальные локальные сети (VLAN) — это способ виртуального разделения сети на множество различных подсетей, также называемый сегментированием. Каждый сегмент будет иметь свою собственную широковещательную область и быть изолированным от других VLAN.

source: On FreeBSD, VLANs must be supported by the network card driver. To see which drivers support vlans, refer to the man:vlan[4] manual page.
es: En FreeBSD, las VLANs tienen que estar soportadas por el controlador de la tarjeta de red. Para ver qué controladores soportan vlans, consulta la página de manual man:vlan[4].
ko: FreeBSD에서는 네트워크 카드 드라이버가 VLAN을 지원해야 합니다. 어떤 드라이버가 VLAN을 지원하는지 확인하려면 man:vlan[4] 매뉴얼 페이지를 참조하십시오.
ru: На FreeBSD поддержка VLAN должна быть обеспечена драйвером сетевой карты. Чтобы узнать, какие драйверы поддерживают VLAN, обратитесь к странице руководства man:vlan[4].

source: When configuring a VLAN, a couple pieces of information must be known. First, which network interface? Second, what is the VLAN tag?
es: Cuando se configura una VLAN, se tienen que conocer un par de datos. Primero, ¿qué interfaz de red? Segundo, ¿cuál es la etiqueta de la VLAN?
ko: VLAN을 구성할 때 몇 가지 정보를 알아야 합니다. 첫째, 어떤 네트워크 인터페이스인가요? 둘째, VLAN 태그는 무엇인가요?
ru: При настройке VLAN необходимо знать несколько параметров. Во-первых, какой сетевой интерфейс? Во-вторых, какой тег VLAN?

source: To configure VLANs at run time, with a NIC of `em0` and a VLAN tag of `5` the command would look like this:
es: Para configurar una VLAN en tiempo de ejecución, con un NIC de `em0` y una etiqueta de VLAN de `5` el comando se parecería a este:
ko: 런타임에 NIC가 `em0`이고 VLAN 태그가 `5`인 VLAN을 구성하려면 명령은 다음과 같습니다:
ru: Для настройки VLAN во время выполнения, с сетевой картой `em0` и тегом VLAN `5`, команда будет выглядеть следующим образом:

source: See how the interface name includes the NIC driver name and the VLAN tag, separated by a period? This is a best practice to make maintaining the VLAN configuration easy when many VLANs are present on a machine.
es: ¿Te has fijado en cómo el nombre de la interfaz incluye el nombre del controlador del NIC y la etiqueta VLAN, separados por un punto? Esta es la mejor forma de mantener la configuración de la VLAN sencilla cuando hay muchas VLANs en la máquina.
ko: 인터페이스 이름에 마침표로 구분된 NIC 드라이버 이름과 VLAN 태그가 어떻게 포함되는지 보셨나요? 이는 한 머신에 많은 VLAN이 있을 때 VLAN 구성을 쉽게 유지 관리할 수 있는 모범 사례입니다.
ru: Видите, что имя интерфейса состоит из имени драйвера сетевой карты и тега VLAN, разделенных точкой? Это рекомендуемая практика для упрощения работы с конфигурациями VLAN, когда на машине присутствует множество VLAN.

source: To configure VLANs at boot time, [.filename]#/etc/rc.conf# must be updated. To duplicate the configuration above, the following will need to be added:
es: Para configurar VLANs en el arranque, se tiene que actualizar [.filename]#/etc/rc.conf#. Para duplicar la configuración de arriba, se tiene que añadir lo siguiente:
ko: 부팅 시 VLAN을 구성하려면 [.filename]#/etc/rc.conf#을 업데이트해야 합니다. 위의 구성을 복제하려면 다음을 추가해야 합니다:
ru: Для настройки VLAN при загрузке необходимо обновить файл [.filename]#/etc/rc.conf#. Чтобы повторить приведённую выше конфигурацию, нужно добавить следующее:

source: Additional VLANs may be added, by simply adding the tag to the `vlans_em0` field and adding an additional line configuring the network on that VLAN tag's interface.
es: Se pueden añadir VLANs adicionales, simplemente añadiendo la etiqueta al campo `vlans_em0` y añadiendo una línea adicional configurando la red en la interfaz de esa etiqueta VLAN.
ko: `vlans_em0` 필드에 태그를 추가하고 해당 VLAN 태그의 인터페이스에 네트워크를 구성하는 추가 줄을 추가하면 추가 VLAN을 추가할 수 있습니다.
ru: Дополнительные VLAN могут быть добавлены путём простого дополнения тега в поле `vlans_em0` и добавления дополнительной строки для настройки сети на интерфейсе с этим тегом VLAN.

source: It is useful to assign a symbolic name to an interface so that when the associated hardware is changed, only a few configuration variables need to be updated. For example, security cameras need to be run over VLAN 1 on `em0`. Later, if the `em0` card is replaced with a card that uses the man:ixgb[4] driver, all references to `em0.1` will not have to change to `ixgb0.1`.
es: Es útil asignar un nombre simbólico a una interfaz de forma que cuando el hardware asociado cambie, sólo se necesiten actualizar unas pocas variables de configuración. Por ejemplo, las cámaras de seguridad necesitan ejecutarse sobre VLAN 1 en `em0`. Después, si la tarjeta `em0` es reemplazada con una tarjeta que utiliza el controlador man:ixgb[4], no habrá que cambiar a `ixgb0.1` todas las referencias a `em0.1`.
ko: 인터페이스에 기호 이름을 할당하면 관련 하드웨어가 변경될 때 몇 가지 구성 변수만 업데이트하면 됩니다. 예를 들어, 보안 카메라는 `em0`에서 VLAN 1을 통해 실행되어야 합니다. 나중에 `em0` 카드가 man:ixgb[4] 드라이버를 사용하는 카드로 교체되면 `em0.1`에 대한 모든 참조를 `ixgb0.1`로 변경할 필요가 없습니다.
ru: Полезно присвоить интерфейсу символическое имя, чтобы при изменении связанного оборудования требовалось обновить лишь несколько переменных конфигурации. Например, камеры наблюдения должны работать через VLAN 1 на `em0`. Позже, если карта `em0` будет заменена на карту с драйвером man:ixgb[4], все упоминания `em0.1` не нужно будет изменять на `ixgb0.1`.

source: To configure VLAN `5`, on the NIC `em0`, assign the interface name `cameras`, and assign the interface an IP address of `_192.168.20.20_` with a `24`-bit prefix, use this command:
es: Para configurar la VLAN `5`, en el NIC `em0`, asigna el nombre de interfaz `cameras`, y asignar al interfaz la dirección IP `_192.168.20.20_` con un prefijo de `24` bits, usa este comando:
ko: VLAN `5`를 구성하려면 NIC `em0`에서 인터페이스 이름 `cameras`를 할당하고 인터페이스에 `24`비트 접두사가 있는 `_192.168.20.20_`의 IP 주소를 할당하고 이 명령을 사용합니다:
ru: Для настройки VLAN `5` на сетевой карте `em0`, назначения интерфейсу имени `cameras` и присвоения интерфейсу IP-адреса `_192.168.20.20_` с `24`-битным префиксом используйте следующую команду:

source: For an interface named `video`, use the following:
es: Para un interfaz llamado `video`, usa lo siguiente:
ko: `video`라는 이름의 인터페이스의 경우 다음을 사용합니다:
ru: Для интерфейса с именем `video` используйте следующее:

source: To apply the changes at boot time, add the following lines to [.filename]#/etc/rc.conf#:
es: Para aplicar los cambios en el arranque, añade las siguientes líneas a [.filename]#/etc/rc.conf#:
ko: 부팅 시 변경 사항을 적용하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:
ru: Чтобы применить изменения при загрузке, добавьте следующие строки в [.filename]#/etc/rc.conf#:

source: Flag
ko: 플래그

source: Bluetooth
ko: 블루투스

source: Logical Link Control and Adaptation Protocol (L2CAP)
ko: 논리적 링크 제어 및 적응 프로토콜(Logical Link Control and Adaptation Protocol, L2CAP)

source: Bridging
ko: 브릿징
ru: Создание моста

source: Network Tap
ko: 네트워크 탭
ru: Ответвитель сетевого трафика (Network Tap)

source: Prefixlength (Bits)
ko: 접두사 길이(비트)

source: embedded IPv4
ko: 임베디드 IPv4

source: Common Address Redundancy Protocol (CARP)
ko: 공통 주소 중복 프로토콜(Common Address Redundancy Protocol, CARP)
ru: Протокол общей избыточности адресов (CARP)

source: Chapter 34. Advanced Networking
ru: Глава 34. Сложные вопросы работы в сети

source: Understand basic network configuration on FreeBSD (crossref:network[network,FreeBSD network]).
ru: Понимать базовые настройки сети в FreeBSD (crossref:network[network,Сеть FreeBSD]).

source: Various attributes of each route can be seen in the `Flags` column. crossref:advanced-networking[routeflags,Commonly Seen Routing Table Flags] summarizes some of these flags and their meanings:
ru: Различные атрибуты каждого маршрута можно увидеть в столбце `Flags`. crossref:advanced-networking[routeflags,Часто встречающиеся флаги таблицы маршрутизации] содержит сводку некоторых из этих флагов и их значений:

source: Virtual Hosts
ru: Виртуальные узлы

source: A common use of FreeBSD is virtual site hosting, where one server appears to the network as many servers. This is achieved by assigning multiple network addresses to a single interface.
ru: Распространённое использование FreeBSD — это виртуальный хостинг сайтов, когда один сервер представляется в сети как множество серверов. Это достигается путём назначения нескольких сетевых адресов одному интерфейсу.

source: A given network interface has one "real" address, and may have any number of "alias" addresses. These aliases are normally added by placing alias entries in [.filename]#/etc/rc.conf#, as seen in this example:
ru: Указанный сетевой интерфейс имеет один "реальный" адрес и может иметь любое количество "псевдонимных" адресов. Эти псевдонимы обычно добавляются путём размещения записей alias в [.filename]#/etc/rc.conf#, как показано в этом примере:

source: Alias entries must start with `alias__0__` using a sequential number such as `alias0`, `alias1`, and so on. The configuration process will stop at the first missing number.
ru: Записи псевдонимов должны начинаться с `alias__0__`, используя последовательные числа, такие как `alias0`, `alias1` и так далее. Процесс настройки остановится при первом пропущенном числе.

source: The calculation of alias netmasks is important. For a given interface, there must be one address which correctly represents the network's netmask. Any other addresses which fall within this network must have a netmask of all ``1``s, expressed as either `255.255.255.255` or `0xffffffff`.
ru: Расчёт масок подсети для псевдонимов важен. Для заданного интерфейса должен быть один адрес, который корректно представляет маску подсети сети. Любые другие адреса, попадающие в эту сеть, должны иметь маску подсети, состоящую из всех ``1``, выраженную как `255.255.255.255` или `0xffffffff`.

source: For example, consider the case where the `fxp0` interface is connected to two networks: `10.1.1.0` with a netmask of `255.255.255.0` and `202.0.75.16` with a netmask of `255.255.255.240`. The system is to be configured to appear in the ranges `10.1.1.1` through `10.1.1.5` and `202.0.75.17` through `202.0.75.20`. Only the first address in a given network range should have a real netmask. All the rest (`10.1.1.2` through `10.1.1.5` and `202.0.75.18` through `202.0.75.20`) must be configured with a netmask of `255.255.255.255`.
ru: Например, рассмотрим случай, когда интерфейс `fxp0` подключён к двум сетям: `10.1.1.0` с маской сети `255.255.255.0` и `202.0.75.16` с маской сети `255.255.255.240`. Система должна быть настроена так, чтобы находиться в диапазонах `10.1.1.1`–`10.1.1.5` и `202.0.75.17`–`202.0.75.20`. Только первый адрес в каждом диапазоне должен иметь реальную маску сети. Все остальные (`10.1.1.2`–`10.1.1.5` и `202.0.75.18`–`202.0.75.20`) должны быть настроены с маской `255.255.255.255`.

source: The following [.filename]#/etc/rc.conf# entries configure the adapter correctly for this scenario:
ru: Для данного сценария правильно настраивают адаптер следующие записи в [.filename]#/etc/rc.conf# :

source: A simpler way to express this is with a space-separated list of IP address ranges. The first address will be given the indicated subnet mask and the additional addresses will have a subnet mask of `255.255.255.255`.
ru: Более простой способ выразить это — использовать список диапазонов IP-адресов, разделённых пробелами. Первому адресу будет назначена указанная маска подсети, а дополнительным адресам — маска подсети `255.255.255.255`.

source: Wireless Advanced Authentication
ru: Расширенная аутентификация в беспроводной сети

source: FreeBSD supports different ways of connecting to a wireless network. This section describes how to perform advanced authentication to a Wireless Network.
ru: FreeBSD поддерживает различные способы подключения к беспроводной сети. В этом разделе описано, как выполнить расширенную аутентификацию в беспроводной сети.

source: To make a connection and basic authentication to a wireless network the section crossref:network[wireless-authentication,Connection and Authentication to a Wireless Network] in the Network Chapter describes how to do it.
ru: Для подключения и базовой аутентификации в беспроводной сети раздел crossref:network[wireless-authentication,Подключение и аутентификация в беспроводной сети] в главе "Сеть" описывает, как это сделать.

source: WPA with EAP-TLS
ru: WPA с EAP-TLS

source: WPA with EAP-TTLS
ru: WPA с EAP-TTLS

source: WPA with EAP-PEAP
ru: WPA с EAP-PEAP

source: Wireless Ad-hoc Mode
ru: Беспроводное соединение в режиме Ad-hoc

source: Before configuring a FreeBSD machine as an AP, the kernel must be configured with the appropriate networking support for the wireless card as well as the security protocols being used. For more details, see crossref:advanced-networking[network-wireless-ap-basic, Basic Settings].
ru: Прежде чем настраивать машину FreeBSD в качестве точки доступа, ядро должно быть сконфигурировано с соответствующей поддержкой сети для беспроводной карты, а также используемых протоколов безопасности. Для получения дополнительной информации см. crossref:advanced-networking[network-wireless-ap-basic, Базовые настройки].

source: This section focuses on setting up a FreeBSD access point using the WPA2 security protocol. More details regarding WPA and the configuration of WPA-based wireless clients can be found in crossref:advanced-networking[network-wireless-wpa, WPA with EAP-TLS].
ru: Этот раздел посвящён настройке точки доступа на хосте FreeBSD с использованием протокола безопасности WPA2. Подробнее о WPA и настройке беспроводных клиентов на основе WPA можно узнать в crossref:advanced-networking[network-wireless-wpa, WPA с EAP-TLS].

source: Before trying to configure man:hostapd[8], first configure the basic settings introduced in crossref:advanced-networking[network-wireless-ap-basic, Basic Settings].
ru: Прежде чем пытаться настроить man:hostapd[8], сначала настройте основные параметры, описанные в crossref:advanced-networking[network-wireless-ap-basic, Основные настройки].

source: Once the AP is running, the clients can associate with it. See crossref:advanced-networking[network-wireless-ap-basic, Basic Settings] for more details. It is possible to see the stations associated with the AP using `ifconfig _wlan0_ list sta`.
ru: После запуска точки доступа клиенты могут подключиться к ней. Подробнее см. в разделе crossref:advanced-networking[network-wireless-ap-basic, Основные настройки]. Список станций, подключённых к точке доступа, можно просмотреть с помощью команды `ifconfig _wlan0_ list sta`.

source: OBEX Object Push (OPUSH)
ru: Отправка объектов протоколом OBEX (Object Push — OPUSH)

source: For UEFI PXE based boot, the actual boot loader file to use is [.filename]#/boot/loader.efi#. See the below section crossref:advanced-networking[_debugging_pxe_problems,Debugging PXE Problems] on how to use [.filename]#/boot/loader.efi#.
ru: Для загрузки по PXE на UEFI фактический файл загрузчика, который следует использовать, это [.filename]#/boot/loader.efi#. См. раздел ниже crossref:advanced-networking[_debugging_pxe_problems,Отладка проблем PXE] о том, как использовать [.filename]#/boot/loader.efi#.

source: The specified tftp blocksize, e.g. 1468 bytes, replaces the default size 512 bytes. Some PXE versions require the TCP version of TFTP. In this case, uncomment the second `tftp` line which contains `stream tcp`.
ru: Указанный размер блока tftp, например, 1468 байт, заменяет стандартный размер 512 байт. Некоторые версии PXE требуют TCP-версию TFTP. В этом случае раскомментируйте вторую строку `tftp`, содержащую `stream tcp`.

source: For UEFI PXE based booting, replace the [.filename]#boot/pxeboot# file with the [.filename]#boot/loader.efi# file:
ru: Для загрузки по PXE на UEFI замените файл [.filename]#boot/pxeboot# на файл [.filename]#boot/loader.efi#:

source: Using CARP
ru: Использование CARP

source: VLANs
ru: Виртуальные сети VLAN

source: When defining VLANs, ensure that the parent network interface is also configured and enabled. The minimum configuration for the above example would be:
ru: При определении VLAN убедитесь, что родительский сетевой интерфейс также настроен и включен. Минимальная конфигурация для приведенного выше примера будет следующей:

source: When defining VLANs in [.filename]#/etc/rc.conf#, make sure that the parent network interface is configured and enabled as well. The minimum configuration for the above example would be:
ru: При определении VLAN в [.filename]#/etc/rc.conf# убедитесь, что родительский сетевой интерфейс также настроен и включен. Минимальная конфигурация для приведенного выше примера будет следующей:
