Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: The following examples use the Net-SNMP software (package:net-mgmt/net-snmp[]) to query a bridge from a client system. The package:net-mgmt/bsnmptools[] port can also be used. From the SNMP client which is running Net-SNMP, add the following lines to [.filename]#$HOME/.snmp/snmp.conf# in order to import the bridge MIB definitions:
es: Los siguientes ejemplos usan el software Net-SNMP (package:net-mgmt/net-snmp[]) para consultar un bridge desde un sistema cliente. También se puede usar el port package:net-mgmt/bsnmptools[]. Desde el cliente SNMP que está ejecutando Net-SNMP, añade las siguientes líneas a [.filename]#$HOME/.snmp/snmp.conf# para importar las definiciones MIB del bridge:
ko: 다음 예는 클라이언트 시스템에서 브리지를 쿼리하기 위해 Net-SNMP 소프트웨어(package:net-mgmt/net-snmp[])를 사용합니다. package:net-mgmt/bsnmptools[] 포트도 사용할 수 있습니다. Net-SNMP를 실행하는 SNMP 클라이언트에서 [.filename]#$HOME/.snmp/snmp.conf#에 다음 줄을 추가하여 브리지 MIB 정의를 가져옵니다:
ru: Следующие примеры используют программное обеспечение Net-SNMP (package:net-mgmt/net-snmp[]) для запроса моста с клиентской системы. Также можно использовать порт package:net-mgmt/bsnmptools[]. На SNMP-клиенте, где запущен Net-SNMP, добавьте следующие строки в [.filename]#$HOME/.snmp/snmp.conf#, чтобы импортировать определения MIB для моста:

source: To monitor a single bridge using the IETF BRIDGE-MIB (RFC4188):
es: Para monitorizar un sólo bridge usando IETF BRIDGE-MIB (RFC4188):
ko: IETF BRIDGE-MIB(RFC4188)를 사용하여 단일 브리지를 모니터링 하려면:
ru: Для мониторинга одного моста с использованием IETF BRIDGE-MIB (RFC4188):

source: The `dot1dStpTopChanges.0` value is two, indicating that the STP bridge topology has changed twice. A topology change means that one or more links in the network have changed or failed and a new tree has been calculated. The `dot1dStpTimeSinceTopologyChange.0` value will show when this happened.
es: El valor `dot1dStpTopChanges.0` es dos, lo que indica que la topología STP ha cambiado dos veces. Un cambio de topología significa que uno o más enlaces en la red han cambiado o fallado y se ha tenido que calcular un nuevo árbol. El valor `dot1dStpTimeSinceTopologyChange.0` mostrará cuándo sucede esto.
ko: `dot1dStpTopChanges.0` 값은 2로, STP 브리지 토폴로지가 두 번 변경되었음을 나타냅니다. 토폴로지 변경은 네트워크에서 하나 이상의 링크가 변경되거나 실패하여 새 트리가 계산되었음을 의미합니다. 토폴로지 변경이 발생한 시점은 `dot1dStpTimeSinceTopologyChange.0` 값에 표시됩니다.
ru: Значение `dot1dStpTopChanges.0` равно двум, что указывает на двукратное изменение топологии STP-моста. Изменение топологии означает, что одна или несколько связей в сети изменились или вышли из строя, и было выполнено перерасчёт дерева. Значение `dot1dStpTimeSinceTopologyChange.0` покажет, когда это произошло.

source: To monitor multiple bridge interfaces, the private BEGEMOT-BRIDGE-MIB can be used:
es: Para monitorizar múltiples interfaces del bridge, se puede usar el BEGEMOT-BRIDGE-MIB privado:
ko: 여러 브리지 인터페이스를 모니터링하려면 비공개 BEGEMOT-BRIDGE-MIB를 사용할 수 있습니다:
ru: Для мониторинга нескольких интерфейсов моста можно использовать приватный BEGEMOT-BRIDGE-MIB:

source: To change the bridge interface being monitored via the `mib-2.dot1dBridge` subtree:
es: Para cambiar la interfaz del bridge que está siendo monitorizada mediante el subárbol `mib-2.dot1dBridge`:
ko: `mib-2.dot1dBridge` 서브트리를 통해 모니터링 중인 브리지 인터페이스를 변경하려면:
ru: Для изменения мониторинга интерфейса моста через поддерево `mib-2.dot1dBridge`:

source: Link Aggregation and Failover
es: Agregación de Enlaces y Conmutación
ko: 링크 집계 및 장애 조치
ru: Агрегация каналов и отказоустойчивость

source: FreeBSD provides the man:lagg[4] interface which can be used to aggregate multiple network interfaces into one virtual interface in order to provide failover and link aggregation. Failover allows traffic to continue to flow as long as at least one aggregated network interface has an established link. Link aggregation works best on switches which support LACP, as this protocol distributes traffic bi-directionally while responding to the failure of individual links.
es: FreeBSD proporciona la interfaz man:lagg[4] que se puede usar para agregar múltiples interfaces de red en una interfaz virtual para proporcionar tolerancia a fallos ("failover") y agregación de enlaces. El failover permite que el tráfico continúe fluyendo mientras haya al menos una interfaz de red que tenga establecido un enlace. La agregación de enlaces funciona mejor en switches que soportan LACP, ya que este protocolo distribuye el tráfico de forma bidireccional a la vez que responde al fallo de enlaces individuales.
ko: FreeBSD는 장애 조치 및 링크 집계를 제공하기 위해 여러 네트워크 인터페이스를 하나의 가상 인터페이스로 집계하는 데 사용할 수 있는 man:lagg[4] 인터페이스를 제공합니다. 장애 조치를 통해 하나 이상의 집계된 네트워크 인터페이스에 링크가 설정되어 있는 한 트래픽이 계속 흐르도록 할 수 있습니다. 이 프로토콜은 개별 링크의 장애에 대응하면서 트래픽을 양방향으로 분산하므로 링크 집계는 LACP를 지원하는 스위치에서 가장 잘 작동합니다.
ru: FreeBSD предоставляет интерфейс man:lagg[4], который может использоваться для объединения нескольких сетевых интерфейсов в один виртуальный интерфейс с целью обеспечения отказоустойчивости и агрегации каналов. Отказоустойчивость позволяет трафику продолжать передаваться, пока хотя бы один из объединённых сетевых интерфейсов имеет установленное соединение. Агрегация каналов наиболее эффективна на коммутаторах, поддерживающих LACP, так как этот протокол распределяет трафик в обоих направлениях, реагируя на отказ отдельных каналов.

source: The aggregation protocols supported by the lagg interface determine which ports are used for outgoing traffic and whether or not a specific port accepts incoming traffic. The following protocols are supported by man:lagg[4]:
es: Los protocolos de agregación soportados por el interfaz lagg determinan qué puertos se usan para tráfico saliente y si un puerto específico acepta o no tráfico de entrada. Los siguientes protocolos están soportados por man:lagg[4]:
ko: Lagg 인터페이스에서 지원하는 집계 프로토콜은, 나가는 트래픽에 사용되는 포트와 특정 포트가 들어오는 트래픽을 허용할지 여부를 결정합니다. 다음 프로토콜은 man:lagg[4]에서 지원됩니다:
ru: Протоколы агрегации, поддерживаемые интерфейсом lagg, определяют, какие порты используются для исходящего трафика и принимает ли конкретный порт входящий трафик. В man:lagg[4] поддерживаются следующие протоколы:

source: This mode sends and receives traffic only through the master port. If the master port becomes unavailable, the next active port is used. The first interface added to the virtual interface is the master port and all subsequently added interfaces are used as failover devices. If failover to a non-master port occurs, the original port becomes master once it becomes available again.
es: Este modo envía y recibe tráfico sólo a través del puerto maestro. Si el puerto maestro no está disponible, se usa el siguiente puerto activo. La primera interfaz añadida a la interfaz virtual es el puerto maestro y todas las interfaces añadidas posteriormente se usan como dispositivos redundantes. Si se produce un cambio a un puerto no maestro, el puerto original se convierte en maestro una vez que esté disponible de nuevo.
ko: 이 모드는 마스터 포트를 통해서만 트래픽을 송수신합니다. 마스터 포트를 사용할 수 없게 되면 다음 활성 포트가 사용됩니다. 가상 인터페이스에 추가된 첫 번째 인터페이스가 마스터 포트이며 이후에 추가된 모든 인터페이스가 장애 조치 장치로 사용됩니다. 마스터 포트가 아닌 포트에 대한 장애 조치가 발생하면 원래 포트를 다시 사용할 수 있게 될 때까지 원래 포트가 마스터 포트가 됩니다.
ru: Этот режим отправляет и получает трафик только через основной порт. Если основной порт становится недоступным, используется следующий активный порт. Первый интерфейс, добавленный в виртуальный интерфейс, является основным портом, а все последующие добавленные интерфейсы используются как устройства резервирования. Если происходит переключение на неосновной порт, исходный порт снова становится основным, как только становится доступным.

source: This provides a static setup and does not negotiate aggregation with the peer or exchange frames to monitor the link. If the switch supports LACP, that should be used instead.
es: Esto proporciona una configuración estática y no negocia agregación con los pares o intercambia marcos para monitorizar el enlace. Si el switch soporta LACP, se debería usar en su lugar.
ko: 이 설정은 정적 설정을 제공하며 피어와 집계를 협상하거나 링크를 모니터링하기 위해 프레임을 교환하지 않습니다. 스위치가 LACP를 지원하는 경우 이를 대신 사용해야 합니다.
ru: Это обеспечивает статическую настройку и не выполняет согласование агрегации с узлом или обмен кадрами для мониторинга связи. Если коммутатор поддерживает LACP, следует использовать его.

source: The IEEE(R) 802.3ad Link Aggregation Control Protocol (LACP) negotiates a set of aggregable links with the peer into one or more Link Aggregated Groups (LAGs). Each LAG is composed of ports of the same speed, set to full-duplex operation, and traffic is balanced across the ports in the LAG with the greatest total speed. Typically, there is only one LAG which contains all the ports. In the event of changes in physical connectivity, LACP will quickly converge to a new configuration.
es: El protocolo IEEE(R) 802.3ad Link Aggregation Control Protocol (LACP) negocia un conjunto de enlaces agregables con el par en uno o más grupos "Link Aggregated Groups" (LAGs). Cada LAG se compone de puertos con la misma velocidad, conjunto de operaciones full-duplex, y el tráfico se balancea entre los puertos en el LAG con la velocidad total mayor. Típicamente, sólo hay un LAG que contiene todos los puertos. En el caso de cambios en la conectividad física, LACP convergerá rápido a una nueva configuración.
ko: IEEE(R) 802.3ad 링크 집계 제어 프로토콜(Link Aggregation Control Protocol, LACP)은 피어와 집계 가능한 링크 집합을 하나 이상의 링크 집계 그룹(LAG)으로 협상합니다. 각 LAG는 풀 듀플렉스 작동으로 설정된 동일한 속도의 포트로 구성되며, 트래픽은 총 속도가 가장 빠른 LAG의 포트 간에 균형을 이룹니다. 일반적으로 모든 포트를 포함하는 LAG는 하나뿐입니다. 물리적 연결이 변경되는 경우 LACP는 새로운 구성으로 빠르게 수렴합니다.
ru: Протокол управления агрегацией каналов IEEE(R) 802.3ad (LACP) согласует набор агрегируемых каналов с узлом-партнёром в один или несколько агрегированных групп каналов (LAG). Каждая LAG состоит из портов с одинаковой скоростью, настроенных на полнодуплексный режим работы, а трафик распределяется между портами в LAG с наибольшей общей скоростью. Обычно существует только одна LAG, содержащая все порты. В случае изменений физической связности LACP быстро сходится к новой конфигурации.

source: LACP balances outgoing traffic across the active ports based on hashed protocol header information and accepts incoming traffic from any active port. The hash includes the Ethernet source and destination address and, if available, the VLAN tag, and the IPv4 or IPv6 source and destination address.
es: LACP balancea el tráfico de salida a lo largo de los puestos activos basándose en un hash de la cabecera de información del protocolo y acepta tráfico de entrada de cualquier puerto activo. El hash incluye la fuente Ehternet y la dirección de destino y, si está disponible, la etiqueta VLAN, y las direcciones de fuente y destino IPv4 o IPv6.
ko: LACP는 해시된 프로토콜 헤더 정보를 기반으로 활성 포트에서 나가는 트래픽의 균형을 맞추고 모든 활성 포트에서 들어오는 트래픽을 허용합니다. 해시에는 이더넷 소스 및 대상 주소, 사용 가능한 경우 VLAN 태그, IPv4 또는 IPv6 소스 및 대상 주소가 포함됩니다.
ru: LACP распределяет исходящий трафик по активным портам на основе хешированной информации заголовков протоколов и принимает входящий трафик с любого активного порта. Хеш включает исходный и целевой Ethernet-адреса, а также, если доступно, тег VLAN и исходный и целевой IPv4 или IPv6 адреса.

source: This mode distributes outgoing traffic using a round-robin scheduler through all active ports and accepts incoming traffic from any active port. Since this mode violates Ethernet frame ordering, it should be used with caution.
es: Este modo distribuye el tráfico de salida utilizando un planificador round-robin entre todos los puertos activos y acepta tráfico de entrada desde cualquier puerto activo. Puesto que esto viola el orden de las tramas Ethernet, debería ser usado con precaución.
ko: 이 모드는 모든 활성 포트를 통해 라운드 로빈 스케줄러를 사용하여 나가는 트래픽을 분배하고 모든 활성 포트에서 들어오는 트래픽을 허용합니다. 이 모드는 이더넷 프레임 순서를 위반하므로 주의해서 사용해야 합니다.
ru: Этот режим распределяет исходящий трафик с помощью циклического планировщика через все активные порты и принимает входящий трафик с любого активного порта. Поскольку этот режим нарушает порядок следования Ethernet-кадров, его следует использовать с осторожностью.

source: This mode sends outgoing traffic to all ports configured on the lagg interface, and receives frames on any port.
es: Este modo envía tráfico de salida a todos los puertos configurados en la interfaz lagg, y recibe tramas desde cualquier puerto.
ko: 이 모드는 지연 인터페이스에 구성된 모든 포트에 발신 트래픽을 보내고 모든 포트에서 프레임을 수신합니다.
ru: Этот режим отправляет исходящий трафик на все порты, настроенные на интерфейсе lagg, и принимает кадры на любом порту.

source: Configuration Examples
es: Ejemplos de Configuración
ko: 구성 예시
ru: Примеры конфигурации

source: This section demonstrates how to configure a Cisco(R) switch and a FreeBSD system for LACP load balancing. It then shows how to configure two Ethernet interfaces in failover mode as well as how to configure failover mode between an Ethernet and a wireless interface.
es: Esta sección muestra cómo configurar un switch Cisco(R) y un sistema FreeBSD para hacer balanceado de carga LACP. Después muestra cómo configurar dos interfaces Ethernet en modo failover así como cómo configurar el modo failover entre una interfaz Ethernet y otra inalámbrica.
ko: 이 섹션에서는 LACP 로드 밸런싱을 위해 Cisco(R) 스위치와 FreeBSD 시스템을 구성하는 방법을 설명합니다. 그런 다음 두 개의 이더넷 인터페이스를 페일오버 모드로 구성하는 방법과 이더넷과 무선 인터페이스 간에 페일오버 모드를 구성하는 방법을 보여 줍니다.
ru: В этом разделе показано, как настроить коммутатор Cisco(R) и систему FreeBSD для балансировки нагрузки LACP. Затем демонстрируется настройка двух Ethernet-интерфейсов в режиме отказоустойчивости, а также настройка режима отказоустойчивости между Ethernet и беспроводным интерфейсом.

source: LACP Aggregation with a Cisco(R) Switch
es: Agregación LACP con un Switch Cisco(R)
ko: Cisco(R) 스위치를 사용한 LACP 통합
ru: Агрегация каналов с использованием LACP и коммутатора Cisco(R)

source: This example connects two man:fxp[4] Ethernet interfaces on a FreeBSD machine to the first two Ethernet ports on a Cisco(R) switch as a single load balanced and fault tolerant link. More interfaces can be added to increase throughput and fault tolerance. Replace the names of the Cisco(R) ports, Ethernet devices, channel group number, and IP address shown in the example to match the local configuration.
es: Este ejemplo conecta dos interfaces Ethernet man:fcp[4] en una máquina FreeBSD con los dos primeros puertos Ethernet en un switch Cisco(R) como un enlace único de balanceo de carga y tolerante a fallos. Se pueden añadir más interfaces para incrementar la productividad y la tolerancia a fallos. Reemplaza los nombres de los puertos Cisco(R), dispositivos Ethernet, número de grupo del canal, y dirección IP como se muestra en el ejemplo para adaptarlo a la configuración local.
ko: 이 예는 FreeBSD 머신에 두 개의 man:fxp[4] 이더넷 인터페이스를 Cisco(R) 스위치의 처음 두 이더넷 포트에 단일 로드 밸런싱 및 내결함성 링크로 연결합니다. 처리량과 내결함성을 높이기 위해 더 많은 인터페이스를 추가할 수 있습니다. 예제에 표시된 Cisco(R) 포트, 이더넷 장치, 채널 그룹 번호 및 IP 주소의 이름을 로컬 구성과 일치하도록 바꾸십시오.
ru: В этом примере два Ethernet-интерфейса man:fxp[4] на машине FreeBSD подключены к первым двум Ethernet-портам коммутатора Cisco(R) в виде единого отказоустойчивого канала с балансировкой нагрузки. Дополнительные интерфейсы могут быть добавлены для увеличения пропускной способности и отказоустойчивости. Замените названия портов Cisco(R), Ethernet-устройств, номер группы каналов и IP-адрес, указанные в примере, в соответствии с вашей конфигурацией.

source: Frame ordering is mandatory on Ethernet links and any traffic between two stations always flows over the same physical link, limiting the maximum speed to that of one interface. The transmit algorithm attempts to use as much information as it can to distinguish different traffic flows and balance the flows across the available interfaces.
es: El orden de las tramas es obligatorio en los enlaces Ethernet y cualquier tráfico entre dos estaciones siempre debe fluir por el mismo enlace físico, limitando la velocidad máxima a aquella de un interfaz. El algoritmo de transmisión intenta usar la mayor cantidad de información posible para distinguir entre distintos flujos de tráfico y balancear los flujos entre las interfaces disponibles.
ko: 이더넷 링크에서는 프레임 순서가 필수이며 두 스테이션 간의 모든 트래픽은 항상 동일한 물리적 링크를 통해 흐르기 때문에 최대 속도가 한 인터페이스의 속도로 제한됩니다. 전송 알고리즘은 가능한 한 많은 정보를 사용하여 서로 다른 트래픽 흐름을 구분하고 사용 가능한 인터페이스 간에 흐름의 균형을 맞추려고 시도합니다.
ru: Порядок кадров обязателен на Ethernet-соединениях, и любой трафик между двумя станциями всегда проходит через одно и то же физическое соединение, что ограничивает максимальную скорость пропускной способностью одного интерфейса. Алгоритм передачи пытается использовать как можно больше информации для различения отдельных потоков трафика и балансировки этих потоков между доступными интерфейсами.

source: On the Cisco(R) switch, add the _FastEthernet0/1_ and _FastEthernet0/2_ interfaces to channel group _1_:
es: En el switch Cisco(R), añade las interfaces _FastEthernet0/1_ y _FastEthernet0/2_ al grupo del canal _1_:
ko: Cisco(R) 스위치에서 채널 그룹 _1_에 _FastEthernet0/1_ 및 _FastEthernet0/2_ 인터페이스를 추가합니다:
ru: На коммутаторе Cisco(R) добавьте интерфейсы _FastEthernet0/1_ и _FastEthernet0/2_ в группу каналов _1_:

source: On the FreeBSD system, create the man:lagg[4] interface using the physical interfaces _fxp0_ and _fxp1_ and bring the interfaces up with an IP address of _10.0.0.3/24_:
es: En el sistema FreeBSD, crea el interfaz man:lagg[4] usando las interfaces físicas _fxp0_ y _fxp1_ y levanta las interfaces con la dirección IP _10.0.0.3/24_:
ko: FreeBSD 시스템에서 물리적 인터페이스 _fxp0_ 및 _fxp1_을 사용하여 man:lagg[4] 인터페이스를 생성하고 IP 주소 _10.0.0.3/24_로 인터페이스를 가져옵니다:
ru: На системе FreeBSD создайте интерфейс man:lagg[4], используя физические интерфейсы _fxp0_ и _fxp1_, и поднимите интерфейсы с IP-адресом _10.0.0.3/24_:

source: Next, verify the status of the virtual interface:
es: Después, verifica el estado de la interfaz virtual:
ko: 다음으로 가상 인터페이스의 상태를 확인합니다:
ru: Далее проверьте состояние виртуального интерфейса:

source: Ports marked as `ACTIVE` are part of the LAG that has been negotiated with the remote switch. Traffic will be transmitted and received through these active ports. Add `-v` to the above command to view the LAG identifiers.
es: Los puertos marcados como `ACTIVE` forman parte del LAG que se ha negociado con el switch remoto. El tráfico será transmitido y recibido a través de estos puertos activos. Añade `-v` al comando de arriba para ver los identificadores LAG.
ko: `ACTIVE`으로 표시된 포트는 원격 스위치와 협상된 LAG의 일부입니다. 트래픽은 이러한 활성 포트를 통해 송수신됩니다. 위의 명령에 `-v`를 추가하면 LAG 식별자를 볼 수 있습니다.
ru: Порты, помеченные как `ACTIVE`, являются частью LAG, который был согласован с удаленным коммутатором. Через эти активные порты будет передаваться и приниматься трафик. Добавьте `-v` к приведенной выше команде, чтобы просмотреть идентификаторы LAG.

source: To see the port status on the Cisco(R) switch:
es: Para ver el estado del puerto en el switch Cisco(R):
ko: Cisco(R) 스위치의 포트 상태를 확인하려면:
ru: Чтобы проверить статус порта на коммутаторе Cisco(R):

source: For more detail, type `show lacp neighbor detail`.
es: Para más detalles, teclea `show lacp neighbor detail`.
ko: 자세한 내용을 보려면 `show lacp neighbor detail`를 입력합니다.
ru: Для получения более подробной информации введите `show lacp neighbor detail`.

source: To retain this configuration across reboots, add the following entries to [.filename]#/etc/rc.conf# on the FreeBSD system:
es: Para mantener esta configuración entre reinicios, añade las siguientes entradas en el fichero [.filename]#/etc/rc.conf#del sistema FreeBSD:
ko: 재부팅 시에도 이 구성을 유지하려면 FreeBSD 시스템에서 [.filename]#/etc/rc.conf#에 다음 항목을 추가하세요:
ru: Чтобы сохранить эту конфигурацию после перезагрузки, добавьте следующие записи в [.filename]#/etc/rc.conf# на системе FreeBSD:

source: Failover Mode
es: Modo Failover
ko: 장애 조치 모드 (Failover Mode)
ru: Режим отказоустойчивости

source: Failover mode can be used to switch over to a secondary interface if the link is lost on the master interface. To configure failover, make sure that the underlying physical interfaces are up, then create the man:lagg[4] interface. In this example, _fxp0_ is the master interface, _fxp1_ is the secondary interface, and the virtual interface is assigned an IP address of _10.0.0.15/24_:
es: El modo failover se puede usar para cambiar a un interfaz secundario si se pierde el enlace en el interfaz maestro. Para configurar failover, asegúrate de que las interfaces físicas están levantadas, después crea el interfaz man:lagg[4]. En este ejemplo, _fxp0_ es la interfaz maestra, _fxp1_ es la interfaz secundaria, y el interfaz virtual tiene asignada la dirección IP _10.0.0.15/24_:
ko: 장애 조치 모드는 마스터 인터페이스에서 링크가 끊어진 경우 보조 인터페이스로 전환하는 데 사용할 수 있습니다. 장애 조치를 구성하려면 기본 물리적 인터페이스가 가동 중인지 확인한 다음 man:lagg[4] 인터페이스를 만듭니다. 이 예제에서 _fxp0_은 마스터 인터페이스, _fxp1_은 보조 인터페이스이며 가상 인터페이스에는 _10.0.0.15/24_의 IP 주소가 할당됩니다:
ru: Режим отказоустойчивости может быть использован для переключения на резервный интерфейс, если соединение на основном интерфейсе потеряно. Для настройки отказоустойчивости убедитесь, что физические интерфейсы активны, затем создайте интерфейс man:lagg[4]. В этом примере _fxp0_ — основной интерфейс, _fxp1_ — резервный интерфейс, а виртуальному интерфейсу назначен IP-адрес _10.0.0.15/24_:

source: The virtual interface should look something like this:
es: La interfaz virtual debería tener un aspecto parecido a este:
ko: 가상 인터페이스는 다음과 같이 표시되어야 합니다:
ru: Виртуальный интерфейс должен выглядеть примерно так:

source: Traffic will be transmitted and received on _fxp0_. If the link is lost on _fxp0_, _fxp1_ will become the active link. If the link is restored on the master interface, it will once again become the active link.
es: El tráfico será transmitido y recibido en _fxp0_. Si se pierde el enlace en _fxp0_, _fxp1_ se convertirá en el enlace activo. Si se restaura el enlace en la interfaz maestra, se convertirá de nuevo en el enlace activo.
ko: 트래픽은 _fxp0_에서 송수신됩니다. _fxp0_에서 링크가 끊어지면 _fxp1_이 활성 링크가 됩니다. 마스터 인터페이스에서 링크가 복원되면 다시 한 번 활성 링크가 됩니다.
ru: Трафик будет передаваться и приниматься через интерфейс _fxp0_. Если соединение на _fxp0_ будет потеряно, активным станет интерфейс _fxp1_. Если соединение на основном интерфейсе восстановится, он снова станет активным.

source: To retain this configuration across reboots, add the following entries to [.filename]#/etc/rc.conf#:
es: Para mantener esta configuración entre reinicios, añade las siguientes entradas en [.filename]#/etc/rc.conf#:
ko: 재부팅 시에도 이 구성을 유지하려면 [.filename]#/etc/rc.conf#에 다음 항목을 추가하세요:
ru: Чтобы сохранить эту конфигурацию после перезагрузки, добавьте следующие записи в [.filename]#/etc/rc.conf#:

source: Failover Mode Between Ethernet and Wireless Interfaces
es: Modo Failover Entre Interfaces Ethernet y Wireless
ko: 이더넷과 무선 인터페이스 간 장애 조치 모드
ru: Режим автоматического переключения между Ethernet и беспроводным интерфейсом
