Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/advanced-networking/_index.po
Languages: es, ko, ru

source: If needed, enable man:ssh[1] root logins for client machines which are PXE booting by editing [.filename]#${NFSROOTDIR}/etc/ssh/sshd_config# and enabling `PermitRootLogin`. This option is documented in man:sshd_config[5].
es: Si es necesario, habilita el inicio de sesión de root en man:ssh[1] para las máquinas cliente que arrancan con PXE editando [.filename]#${NFSROOTDIR}/etc/ssh/sshd_config# y habilitando `PermitRootLogin`. Esta opción está documentada en man:sshd_config[5].
ko: 필요한 경우 [.filename]#${NFSROOTDIR}/etc/ssh/sshd_config#를 편집하고 `PermitRootLogin`을 활성화하여 PXE 부팅 중인 클라이언트 시스템에 대해 man:ssh[1] 루트 로그인을 사용하도록 설정합니다. 이 옵션은 man:sshd_config[5]에 문서화되어 있습니다.
ru: При необходимости разрешите вход root по man:ssh[1] для клиентских машин, загружающихся через PXE, отредактировав [.filename]#${NFSROOTDIR}/etc/ssh/sshd_config# и включив `PermitRootLogin`. Эта опция описана в man:sshd_config[5].

source: Perform any other needed customizations of the PXE environment in [.filename]#${NFSROOTDIR}#. These customizations could include things like installing packages or editing the password file with man:vipw[8].
es: Realiza cualquier otra personalización del entorno PXE en [.filename]#${NFSROOTDIR}#. Estas personalizaciones podrían incluir cosas como instalación de paquetes o editar el fichero de contraseñas con man:vipw[8].
ko: [.filename]#${NFSROOTDIR}#에서 필요한 기타 PXE 환경 사용자 지정을 수행합니다. 이러한 사용자 지정에는 패키지 설치 또는 man:vipw[8]를 사용한 비밀번호 파일 편집 등이 포함될 수 있습니다.
ru: Выполните другие необходимые настройки PXE-окружения в [.filename]#${NFSROOTDIR}#. Эти настройки могут включать установку пакетов или редактирование файла паролей с помощью man:vipw[8].

source: When booting from an NFS root volume, [.filename]#/etc/rc# detects the NFS boot and runs [.filename]#/etc/rc.initdiskless#. In this case, [.filename]#/etc# and [.filename]#/var# need to be memory backed file systems so that these directories are writable but the NFS root directory is read-only:
es: Cuando se arranca desde un volumen raíz NFS, [.filename]#/etc/rc# detecta el arranque NFS y ejecuta [.filename]#/etc/rc.initdiskless#. En este caso se necesita que [.filename]#/etc# y [.filename]#/var# estén cargados den memoria de forma que estos directorios sean escribibles pero el directorio raíz NFS sea de sólo escritura:
ko: NFS 루트 볼륨에서 부팅할 때 [.filename]#/etc/rc#는 NFS 부팅을 감지하고 [.filename]#/etc/rc.initdiskless#를 실행합니다. 이 경우 [.filename]#/etc# 및 [.filename]#/var#는 메모리 백업 파일 시스템이어야 하므로 이러한 디렉터리는 쓰기 가능하지만 NFS 루트 디렉터리는 읽기 전용이 됩니다:
ru: При загрузке с корневого тома NFS, [.filename]#/etc/rc# определяет загрузку по NFS и запускает [.filename]#/etc/rc.initdiskless#. В этом случае [.filename]#/etc# и [.filename]#/var# должны быть файловыми системами в памяти, чтобы эти каталоги были доступны для записи, тогда как корневой каталог NFS доступен только для чтения:

source: When the system boots, memory file systems for [.filename]#/etc# and [.filename]#/var# will be created and mounted and the contents of the [.filename]#cpio.gz# files will be copied into them. By default, these file systems have a maximum capacity of 5 megabytes. If your archives do not fit, which is usually the case for [.filename]#/var# when binary packages have been installed, request a larger size by putting the number of 512 byte sectors needed (e.g., 5 megabytes is 10240 sectors) in [.filename]#${NFSROOTDIR}/conf/base/etc/md_size# and [.filename]#${NFSROOTDIR}/conf/base/var/md_size# files for [.filename]#/etc# and [.filename]#/var# file systems respectively.
es: Cuando el sistema arranca, los sistemas de fichero en memoria para [.filename]#/etc# y [.filename]#/var# se crearán y montarán y el contenido de los ficheros [.filename]#cpio.gz# se copiará dentro de ellos. Por defecto, estos sistemas de ficheros tienen una capacidad máxima de 5 megabytes. Si tus archivos no caben, que es habitualmente el caso para [.filename]#/var# cuando se han instalado paquetes binarios, solicita más tamaño poniendo el número de sectores de 512 bytes necesarios (por ejemplo, 5 megabytes es 10240 sectores) en [.filename]#${NFSROOTDIR}/conf/base/etc/md_size# y [.filename]#${NFSROOTDIR}/conf/base/var/md_size# para los sistemas de ficheros [.filename]#/etc# y [.filename]#/var# respectivamente.
ko: 시스템이 부팅되면 [.filename]#/etc# 및 [.filename]#/var#에 대한 메모리 파일 시스템이 생성되어 마운트되고 [.filename]#cpio.gz# 파일의 내용이 여기에 복사됩니다. 기본적으로 이러한 파일 시스템의 최대 용량은 5메가바이트입니다. 바이너리 패키지가 설치된 [.filename]#/var#의 경우처럼 아카이브가 맞지 않는 경우, 필요한 512바이트 섹터 수를 입력하여 더 큰 크기를 요청하세요(예, 5메가바이트는 10240개의 섹터) [.filename]#/etc# 및 [.filename]#/var# 파일 시스템에 대해 각각 [.filename]#${NFSROOTDIR}/conf/base/etc/md_size# 및 [.filename]#${NFSROOTDIR}/conf/base/var/md_size# 파일에 넣어서 요청하세요.
ru: При загрузке системы будут созданы и смонтированы файловые системы в памяти для [.filename]#/etc# и [.filename]#/var#, а содержимое файлов [.filename]#cpio.gz# будет скопировано в них. По умолчанию эти файловые системы имеют максимальный размер 5 мегабайт. Если ваши архивы не помещаются, что обычно происходит с [.filename]#/var# при установке бинарных пакетов, укажите больший размер, записав количество необходимых секторов по 512 байт (например, 5 мегабайт — это 10240 секторов) в файлы [.filename]#${NFSROOTDIR}/conf/base/etc/md_size# и [.filename]#${NFSROOTDIR}/conf/base/var/md_size# для файловых систем [.filename]#/etc# и [.filename]#/var# соответственно.

source: Configuring the DHCP Server
es: Configurando el Servidor DHCP
ko: DHCP 서버 구성하기
ru: Настройка DHCP-сервера

source: The DHCP server does not need to be the same machine as the TFTP and NFS server, but it needs to be accessible in the network.
es: El servidor DHCP no necesita estar en la misma máquina que los servidores de TFTP y NFS, pero necesita estar accesible en la red.
ko: DHCP 서버는 TFTP 및 NFS 서버와 동일한 컴퓨터일 필요는 없지만 네트워크에서 액세스할 수 있어야 합니다.
ru: Сервер DHCP не обязательно должен быть тем же самым компьютером, что и серверы TFTP и NFS, но он должен быть доступен в сети.

source: DHCP is not part of the FreeBSD base system but can be installed using the package:net/isc-dhcp44-server[] port or package.
es: DHCP no es parte del sistema base de FreeBSD pero se puede instalar usando el port o paquete package:net/isc-dhcp44-server[].
ko: DHCP는 FreeBSD 기본 시스템의 일부가 아니지만 package:net/isc-dhcp44-server[] 포트 또는 패키지를 사용하여 설치할 수 있습니다.
ru: DHCP не является частью базовой системы FreeBSD, но может быть установлен с помощью порта package:net/isc-dhcp44-server[] или пакета.

source: Once installed, edit the configuration file, [.filename]#/usr/local/etc/dhcpd.conf#. Configure the `next-server`, `filename`, and `root-path` settings as seen in this example:
es: Una vez instalado, edita el fichero de configuración, [.filename]#/usr/local/etc/dhcpd.conf#. Configura las opciones `next-server`, `filename`, y `root-path` como se ve en este ejemplo:
ko: 설치가 완료되면 구성 파일인 [.filename]#/usr/local/etc/dhcpd.conf#를 편집합니다. 이 예제와 같이 `next-server`, `filename`, `root-path` 설정을 구성합니다:
ru: После установки отредактируйте файл конфигурации [.filename]#/usr/local/etc/dhcpd.conf#. Настройте параметры `next-server`, `filename` и `root-path`, как показано в этом примере:

source: The `next-server` directive is used to specify the IP address of the TFTP server.
es: La directiva `next-server` se usa para especificar la dirección IP del servidor TFTP.
ko: `next-server` 지시어는 TFTP 서버의 IP 주소를 지정하는 데 사용됩니다.
ru: Директива `next-server` используется для указания IP-адреса TFTP-сервера.

source: The `filename` directive defines the path to [.filename]#/boot/pxeboot#. A relative filename is used, meaning that [.filename]#/b/tftpboot# is not included in the path.
es: La directiva `filename` define la ruta a [.filename]#/boot/pxeboot#. Se usa un nombre de fichero relativo, lo que significa que [.filename]#/b/tftpboot# no está incluido en la ruta.
ko: `filename` 지시어는 [.filename]#/boot/pxeboot# 경로를 정의합니다. 상대 파일명이 사용되므로 [.filename]#/b/tftpboot#는 경로에 포함되지 않습니다.
ru: Директива `filename` определяет путь к [.filename]#/boot/pxeboot#. Используется относительное имя файла, что означает, что [.filename]#/b/tftpboot# не включен в путь.

source: The `root-path` option defines the path to the NFS root file system.
es: La opción `root-path` define la ruta al sistema de ficheros raíz NFS.
ko: `root-path` 옵션은 NFS 루트 파일 시스템의 경로를 정의합니다.
ru: Опция `root-path` определяет путь к корневой файловой системе NFS.

source: Once the edits are saved, enable DHCP at boot time by adding the following line to [.filename]#/etc/rc.conf#:
es: Una vez salvados los cambios, activa DHCP durante el arranque añadiendo la siguiente línea a [.filename]#/etc/rc.conf#:
ko: 편집 내용을 저장한 후 [.filename]#/etc/rc.conf#에 다음 줄을 추가하여 부팅 시 DHCP를 사용하도록 설정합니다:
ru: После сохранения изменений включите DHCP при загрузке, добавив следующую строку в [.filename]#/etc/rc.conf#:

source: Then start the DHCP service:
es: Después inicia el servicio DHCP:
ko: 그런 다음 DHCP 서비스를 시작합니다:
ru: Затем запустите службу DHCP:

source: Debugging PXE Problems
es: Depurando problemas en PXE
ko: PXE 문제 디버깅하기
ru: Отладка проблем PXE

source: Once all of the services are configured and started, PXE clients should be able to automatically load FreeBSD over the network. If a particular client is unable to connect, when that client machine boots up, enter the BIOS configuration menu and confirm that it is set to boot from the network.
es: Una vez que todos los servicios están configurados y arrancados, los clientes PXE deberían ser capaces de cargar automáticamente FreeBSD a través de la red. Si un cliente particular no es capaz de conectar, cuando ese cliente arranque, entra en el menú de configuración de la BIO y confirma que está configurado para arrancar desde la red.
ko: 모든 서비스가 구성되고 시작되면, PXE 클라이언트가 네트워크를 통해 자동으로 FreeBSD를 로드할 수 있어야 합니다. 특정 클라이언트가 연결할 수 없는 경우, 해당 클라이언트 머신이 부팅될 때 BIOS 구성 메뉴로 들어가서 네트워크에서 부팅하도록 설정되어 있는지 확인합니다.
ru: После настройки и запуска всех служб клиенты PXE должны автоматически загружать FreeBSD по сети. Если конкретный клиент не может подключиться, при загрузке этой машины войдите в меню конфигурации BIOS и убедитесь, что она настроена на загрузку с сети.

source: This section describes some troubleshooting tips for isolating the source of the configuration problem should no clients be able to PXE boot.
es: Esta sección describe algunos consejos para resolución de problemas para aislar la fuente del problema de configuración si los clientes no fueran capaces de arrancar mediante PXE.
ko: 이 섹션에서는 클라이언트가 PXE 부팅할 수 없는 경우 구성 문제의 원인을 격리하기 위한 몇 가지 문제 해결 팁에 대해 설명합니다.
ru: Этот раздел содержит несколько советов по устранению неполадок для выявления источника проблемы с конфигурацией, если клиенты не могут загрузиться через PXE.

source: Use the package:net/wireshark[] package or port to debug the network traffic involved during the PXE booting process, which is illustrated in the diagram below.
es: Usa el paquete o port package:net/wireshark[] para depurar el tráfico de red involucrado en el proceso de arranque de PXE, el cual se ilustra en el diagrama inferior.
ko: package:net/wireshark[] 패키지 또는 포트를 사용하여 아래 그림과 같이 PXE 부팅 프로세스 중에 관련된 네트워크 트래픽을 디버깅합니다.
ru: Используйте пакет package:net/wireshark[] или порт для отладки сетевого трафика, задействованного в процессе загрузки по PXE, который показан на схеме ниже.

source: PXE Booting Process with NFS Root Mount
es: Proceso de Arranque de PXE con Punto de Montaje Raíz NFS
ko: NFS 루트 마운트를 사용한 PXE 부팅 프로세스
ru: Процесс загрузки PXE с монтированием корневой файловой системы по NFS

source: Client broadcasts a DHCPDISCOVER message.
es: El cliente emite un mensaje DHCPDISCOVER.
ko: 클라이언트가 DHCPDISCOVER 메시지를 브로드캐스트합니다.
ru: Клиент рассылает широковещательное сообщение DHCPDISCOVER.

source: The DHCP server responds with the IP address, next-server, filename, and root-path values.
es: El servidor DHCP responde con los valores para la dirección IP, next-server, filename y root-path.
ko: DHCP 서버는 IP 주소, 다음 서버, 파일 이름 및 루트 경로 값으로 응답합니다.
ru: Сервер DHCP отвечает с указанием IP-адреса, next-server, filename и значений root-path.

source: The client sends a TFTP request to next-server, asking to retrieve filename.
es: El cliente envía una solicitud TFTP a next-server, pidiendo recuperar un nombre de archivo.
ko: 클라이언트는 다음 서버에 파일 이름 검색을 요청하는 TFTP 요청을 보냅니다.
ru: Клиент отправляет запрос TFTP на next-server, запрашивая получение файла filename.

source: The TFTP server responds and sends filename to client.
es: El servidor TFTP responde y envía el fichero al cliente.
ko: TFTP 서버가 응답하여 파일 이름을 클라이언트로 보냅니다.
ru: Сервер TFTP отвечает и отправляет имя файла клиенту.

source: The client executes filename, which is pxeboot(8), which then loads the kernel. When the kernel executes, the root file system specified by root-path is mounted over NFS.
es: El cliente ejecuta el fichero, que es pxeboot(8), que luego carga el kernel. Cuando el kernel se ejecuta, el sistema de ficheros raíz especificado por root-path es montado a través de NFS.
ko: 클라이언트는 파일 이름(pxeboot(8))을 실행한 다음 커널을 로드합니다. 커널이 실행되면 root-path로 지정된 루트 파일 시스템이 NFS를 통해 마운트됩니다.
ru: Клиент выполняет файл `pxeboot(8)`, который затем загружает ядро. При запуске ядра корневая файловая система, указанная в `root-path`, монтируется через NFS.

source: On the TFTP server, read [.filename]#/var/log/xferlog# to ensure that [.filename]#pxeboot# is being retrieved from the correct location. To test this example configuration:
es: En el servidor TFTP, lee [.filename]#/var/log/xferlog# para asegurar que se está recuperando [.filename]#pxeboot# desde el lugar correcto. Prueba con este ejemplo de configuración:
ko: TFTP 서버에서 [.filename]#/var/log/xferlog#를 읽어 [.filename]#pxeboot#가 올바른 위치에서 검색되고 있는지 확인합니다. 이 예제 구성을 테스트하려면:
ru: На TFTP-сервере прочитайте [.filename]#/var/log/xferlog#, чтобы убедиться, что [.filename]#pxeboot# загружается из правильного места. Для проверки конфигурации, сделанной для этого примера:

source: The `BUGS` sections in man:tftpd[8] and man:tftp[1] document some limitations with TFTP.
es: La sección `BUGS` en man:tftpd[8] y man:tftp[1] documentan algunas limitaciones con TFTP.
ko: man:tftpd[8] 및 man:tftp[1]의 `BUGS` 섹션은 TFTP의 몇 가지 제한 사항을 설명합니다.
ru: Разделы `BUGS` в man:tftpd[8] и man:tftp[1] описывают некоторые ограничения TFTP.

source: Make sure that the root file system can be mounted via NFS. To test this example configuration:
es: Asegúrate de que el sistema de ficheros raíz se puede montar vía NFS. Puedes probar con esta configuración de ejemplo:
ko: 루트 파일 시스템을 NFS를 통해 마운트할 수 있는지 확인합니다. 이 예제 구성을 테스트하려면:
ru: Убедитесь, что корневая файловая система может быть смонтирована через NFS. Для проверки конфигурации из этого примера:

source: IPv6 is the new version of the well known IP protocol, also known as IPv4. IPv6 provides several advantages over IPv4 as well as many new features:
es: IPv6 es la nueva versión del conocido protocolo IP, también conocido como IPv4. IPv6 proporciona varias ventajas sobre IPv4 así como muchas características nuevas:
ko: IPv6는 IPv4로 잘 알려진 IP 프로토콜의 새로운 버전입니다. IPv6는 IPv4에 비해 여러 가지 장점과 새로운 기능을 제공합니다:

source: Its 128-bit address space allows for 340,282,366,920,938,463,463,374,607,431,768,211,456 addresses. This addresses the IPv4 address shortage and eventual IPv4 address exhaustion.
es: Su espacio de direcciones de 128 bits permite 340,282,366,920,938,463,463,374,607,431,768,211,456. Esto soluciona el problema de escasez y eventual agotamiento de direcciones IPv4.
ko: 128비트 주소 공간은 340,282,366,920,938,463,463,374,607,431,768,211,456개의 주소를 허용합니다. 이를 통해 IPv4 주소 부족과 궁극적인 IPv4 주소 고갈 문제를 해결할 수 있습니다.

source: Routers only store network aggregation addresses in their routing tables, thus reducing the average space of a routing table to 8192 entries. This addresses the scalability issues associated with IPv4, which required every allocated block of IPv4 addresses to be exchanged between Internet routers, causing their routing tables to become too large to allow efficient routing.
es: Los routers sólo almacenan direcciones de agregación de red en sus tablas de enrutamiento, reduciendo por tanto el espacio medio de una tabla de enrutamiento a 8192 entradas. Esto soluciona los problemas de escalabilidad asociados a IPv4, que requería que cada bloque asignado de direcciones IPv4 fuera intercambiado entre los routers, haciendo que las tablas de enrutamiento fueran demasiado grandes como para realizar un enrutamiento eficiente.
ko: 라우터는 라우팅 테이블에 네트워크 집계 주소만 저장하므로 라우팅 테이블의 평균 공간을 8192개 항목으로 줄일 수 있습니다. 이는 할당된 모든 IPv4 주소 블록을 인터넷 라우터 간에 교환해야 하므로 라우팅 테이블이 너무 커져 효율적인 라우팅이 불가능했던 IPv4와 관련된 확장성 문제를 해결합니다.

source: Address autoconfiguration (http://www.ietf.org/rfc/rfc2462.txt[RFC2462]).
es: Autconfiguración de direcciones (http://www.ietf.org/rfc/rfc2462.txt[RFC2462]).
ko: 주소 자동 구성(http://www.ietf.org/rfc/rfc2462.txt[RFC2462]).

source: Mandatory multicast addresses.
es: Direcciones multicast obligatorias
ko: 필수 멀티캐스트 주소.

source: Built-in IPsec (IP security).
es: IPsec integrada (seguridad IP).
ko: 내장형 IPsec(IP 보안).

source: Simplified header structure.
es: Estructura de cabecera simplificada.
ko: 간소화된 헤더 구조.

source: Support for mobile IP.
es: Soporte para IP móvil.
ko: 모바일 IP 지원.

source: IPv6-to-IPv4 transition mechanisms.
es: Mecanismos de transición IPv6-IPv4.
ko: IPv6에서 IPv4로의 전환 메커니즘.

source: FreeBSD includes the http://www.kame.net/[http://www.kame.net/] IPv6 reference implementation and comes with everything needed to use IPv6. This section focuses on getting IPv6 configured and running.
es: FreeBSD incluye la implementación de referencia IPv6 http://www.kame.net/[http://www.kame.net/] y viene con todo lo necesario para usar IPv6. Esta sección se centra en configurar y hacer funcionar IPv6.
ko: FreeBSD에는 http://www.kame.net/[http://www.kame.net/] IPv6 레퍼런스 구현이 포함되어 있으며, IPv6를 사용하는 데 필요한 모든 것을 함께 제공합니다. 이 섹션에서는 IPv6를 구성하고 실행하는 데 중점을 둡니다.

source: Background on IPv6 Addresses
es: Nociones de Direcciones IPv6
ko: IPv6 주소의 배경

source: There are three different types of IPv6 addresses:
es: Hay tres tipos diferentes de direcciones IPV6:
ko: IPv6 주소에는 세 가지 유형이 있습니다:

source: A packet sent to a unicast address arrives at the interface belonging to the address.
es: Un paquete enviado a una dirección unicast llega a la interfaz a la que pertenece esa dirección.
ko: 유니캐스트 주소로 전송된 패킷은 해당 주소에 속한 인터페이스에 도착합니다.

source: These addresses are syntactically indistinguishable from unicast addresses but they address a group of interfaces. The packet destined for an anycast address will arrive at the nearest router interface. Anycast addresses are only used by routers.
es: Estas direcciones son sintácticamente indistinguibles de las direcciones unicast pero se refieren a un grupo de interfaces. El paquete destinado a una dirección anycast llegara hasta la interfaz del router más cercano. Las direcciones anycast sólo son usadas por los routers.
ko: 이러한 주소는 구문상 유니캐스트 주소와 구별할 수 없지만 인터페이스 그룹을 주소로 지정합니다. 애니캐스트 주소로 향하는 패킷은 가장 가까운 라우터 인터페이스에 도착합니다. 애니캐스트 주소는 라우터에서만 사용됩니다.

source: These addresses identify a group of interfaces. A packet destined for a multicast address will arrive at all interfaces belonging to the multicast group. The IPv4 broadcast address, usually `xxx.xxx.xxx.255`, is expressed by multicast addresses in IPv6.
es: Estas direcciones identifican un grupo de interfaces. Un paquete destinado a una dirección multicast llegará a todas las interfaces que pertenezcan al grupo multicast. Las direcciones broadcast de IPv4, normalmente `xxx.xxx.xxx.255`, se expresan como direcciones multicast en IPv6.
ko: 이러한 주소는 인터페이스 그룹을 식별합니다. 멀티캐스트 주소로 향하는 패킷은 멀티캐스트 그룹에 속한 모든 인터페이스에 도착합니다. IPv4 브로드캐스트 주소(일반적으로 `xxx.xxx.xxx.255`)는 IPv6에서 멀티캐스트 주소로 표현됩니다.

source: When reading an IPv6 address, the canonical form is represented as `x:x:x:x:x:x:x:x`, where each `x` represents a 16 bit hex value. An example is `FEBC:A574:382B:23C1:AA49:4592:4EFE:9982`.
es: Cuando se lee una dirección IPv6, la forma canónica se representa como `x:x:x:x:x:x:x:x`, donde cada `x` representa un valor hexadecimal de 16 bits. Un ejemplo es `FEBC:A574:382B:23C1:AA49:4592:4EFE:9982`.
ko: IPv6 주소를 읽을 때 표준 형식은 `x:x:x:x:x:x:x:x:x`로 표시되며, 여기서 각 `x`는 16비트 16진수 값을 나타냅니다. 예를 들어 `FEBC:A574:382B:23C1:AA49:4592:4EFE:9982`가 있습니다.

source: Often, an address will have long substrings of all zeros. A `::` (double colon) can be used to replace one substring per address. Also, up to three leading ``0``s per hex value can be omitted. For example, `fe80::1` corresponds to the canonical form `fe80:0000:0000:0000:0000:0000:0000:0001`.
es: A menudo, una dirección tendrá largas subcadenas de ceros. Un `::` (dos puntos dobles seguidos) se puede usar para sustituir una subcadena por cada dirección. Además, se pueden omitir hasta tres ``0`` al comienzo. Por ejemplo, `fe80::1` se corresponde con la forma canónica `fe80:0000:0000:0000:0000:0000:0000:0001`.
ko: 주소에 0이 모두 포함된 긴 하위 문자열이 있는 경우가 많습니다. `::`(이중 콜론)을 사용하여 주소당 하나의 하위 문자열을 대체할 수 있습니다. 또한 16진수 값당 선행 ``0``을 최대 3개까지 생략할 수 있습니다. 예를 들어 `fe80::1`은 표준 형식인 `fe80:0000:0000:0000:0000:0000:0000:0000:0001`에 해당합니다.

source: A third form is to write the last 32 bits using the well known IPv4 notation. For example, `2002::10.0.0.1` corresponds to the hexadecimal canonical representation `2002:0000:0000:0000:0000:0000:0a00:0001`, which in turn is equivalent to `2002::a00:1`.
es: Una tercera forma es escribir los últimos 32 bits usando la notación conocida para IPv4. Por ejemplo, `2002::10.0.0.1` se corresponde con la representación canónica hexadecimal `2002:0000:0000:0000:0000:0000:0a00:0001`, que a su vez es equivalente a `2002::a00:1`.
ko: 세 번째 형식은 잘 알려진 IPv4 표기법을 사용하여 마지막 32비트를 작성하는 것입니다. 예를 들어, `2002::10.0.0.1`은 16진수 정식 표현인 `2002:0000:0000:0000:0000:0000:0a00:0001`에 해당하며, 이는 다시 `2002::a00:1`과 동일합니다.

source: To view a FreeBSD system's IPv6 address, use man:ifconfig[8]:
es: Para ver la dirección IPv6 de un sistema FreeBSD, usa man:ifconfig[8]:
ko: FreeBSD 시스템의 IPv6 주소를 보려면, man:ifconfig[8]을 사용합니다:

source: In this example, the [.filename]#rl0# interface is using `fe80::200:21ff:fe03:8e1%rl0`, an auto-configured link-local address which was automatically generated from the MAC address.
es: En este ejemplo, el interfaz [.filename]#rl0# está usando `fe80::200:21ff:fe03:8e1%rl0`, una dirección de enlace local auto configurada que se ha generado automáticamente a partir de una dirección MAC.
ko: 이 예제에서 [.filename]#rl0# 인터페이스는 MAC 주소에서 자동으로 생성된 자동 구성된 링크-로컬 주소인 `fe80::200:21ff:fe03:8e1%rl0`을 사용하고 있습니다.

source: Some IPv6 addresses are reserved. A summary of these reserved addresses is seen in <<reservedip6>>:
es: Algunas direcciones IPv6 están reservadas. Se puede ver un resumen de las direcciones reservadas en <<reservedip6>>:
ko: 일부 IPv6 주소는 예약되어 있습니다. 이러한 예약된 주소의 요약은 <<reservedip6>>에서 확인할 수 있습니다:

source: Reserved IPv6 Addresses
es: Direcciones IPv6 Reservadas
ko: 예약된 IPv6 주소

source: IPv6 address
es: Direcciones IPv6
ko: IPv6 주소

source: Description
es: Descripción
ko: 설명

source: Notes
es: Notas
ko: 참고

source: unspecified
es: sin especificar

source: Equivalent to `0.0.0.0` in IPv4.
es: Equivalente a `0.0.0.0` en IPv4.
ko: IPv4에서 '0.0.0.0'에 해당.

source: loopback address
es: dirección de loopback

source: Equivalent to `127.0.0.1` in IPv4.
es: Equivalente a `127.0.0.1` en IPv4.
ko: IPv4에서 `127.0.0.1`에 해당.

source: The lower 32 bits are the compatible IPv4 address.
es: Los 32 bits menos significativos forma la dirección IPv4 compatible.
ko: 하위 32비트는 호환 가능한 IPv4 주소입니다.

source: IPv4 mapped IPv6 address
es: Direcciones IPv4 mapeadas a IPv6
ko: IPv4 매핑된 IPv6 주소

source: The lower 32 bits are the IPv4 address for hosts which do not support IPv6.
es: Los 32 bits menos significativos son las direcciones IPv4 para hosts que no soportan IPv6.
ko: 아래쪽 32비트는 IPv6를 지원하지 않는 호스트의 IPv4 주소입니다.

source: Equivalent to 169.254.0.0/16 in IPv4.
es: Equivalente a 169.254.0.0/16 en IPv4.
ko: IPv4에서 169.254.0.0/16에 해당.
