<!--
      The FreeBSD Documentation Project
      The FreeBSD German Documentation Project

      $FreeBSD$
      $FreeBSDde: de-docproj/articles/contributing/article.sgml,v 1.2 2005/08/15 16:25:31 jkois Exp $
      basiert auf:  1.505
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % articles.ent PUBLIC "-//FreeBSD//ENTITIES DocBook FreeBSD Articles Entity Set//DE">
%articles.ent;
<!ENTITY % not.published "IGNORE">
]>

<article lang="de">
  <articleinfo>
    <title>&os; unterst&uuml;tzen</title>

    <pubdate>$FreeBSD$</pubdate>

    <abstract>
      <para>Dieser Artikel beschreibt, wie Einzelpersonen oder
        Unternehmen das &os;-Projekt unterst&uuml;tzen
        k&ouml;nnen.</para>

      <para><emphasis>&Uuml;bersetzt von Johann Kois</emphasis>.</para>

    </abstract>

    <authorgroup>
      <author>
	<firstname>Jordan</firstname>
	<surname>Hubbard</surname>
	<contrib>Beigetragen von </contrib>
      </author>
    </authorgroup>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.ieee;
      &tm-attrib.general;
    </legalnotice>
  </articleinfo>

  <indexterm><primary>Unterst&uuml;tzung</primary></indexterm>

  <para>Sie wollen &os; unterst&uuml;tzen?  Das ist gro&szlig;artig!
    &os; ist auf die Unterst&uuml;tzung seiner Anwender
    <emphasis>angewiesen</emphasis>, um zu &uuml;berleben.  Ihre
    Beitr&auml;ge werden nicht nur begr&uuml;&szlig;t, sie sind
    f&uuml;r die Weiterentwicklung von &os; von elementarer
    Bedeutung.</para>

  <para>Im Gegensatz zu dem, was einige Leute Ihnen einreden wollen,
    m&uuml;ssen Sie kein Spitzenprogrammierer oder pers&ouml;nlicher
    Freund eines Mitglieds des FreeBSD-Core-Teams sein, damit Ihre
    Beitr&auml;ge akzeptiert werden.  Ein gro&szlig;e und wachsende
    Anzahl von internationalen Unterst&uuml;tzern verschiedenen
    Alters und mit verschiedenen technischen F&auml;higkeiten
    entwickelt FreeBSD weiter.  Es gibt immer mehr zu tun, als
    von den beteiligten Personen bew&auml;ltigt werden kann, daher
    freuen wir uns &uuml;ber jede Hilfe.</para>

  <para>Das FreeBSD-Projekt ist f&uuml;r ein komplettes Betriebssytem
    verantwortlich, nicht nur f&uuml;r einen Kernel oder ein paar
    verstreute Werkzeuge.  Daher umfasst unsere
    <filename>TODO</filename>-Liste viele verschiedene Aufgabenbereiche:
    Angefangen von der Dokumentation, &uuml;ber Betatests und
    Pr&auml;sentationen bis zu Systeminstallationen und speziellen
    Weiterentwicklungen des Kernels.  Da F&auml;higkeiten in den
    verschiedensten Bereichen ben&ouml;tigt werden, kann fast jeder
    etwas zu diesem Projekt beitragen.</para>

  <para>Personen, die im kommerziellen Umfeld mit FreeBSD zu tun haben,
    sind ebenfalls aufgefordert, sich bei uns zu melden.  Brauchen Sie
    eine spezielle Erweiterung, damit Ihr Produkt funktioniert?  Wir
    kommen Ihren W&uuml;nschen gerne entgegen, vorausgesetzt, sie sind
    nicht zu speziell.  Arbeiten Sie an einem Mehrwertprodukt?  Dann
    informieren Sie uns bitte!  Wir k&ouml;nnten in der Lage sein, an
    einem Teil davon mitzuarbeiten.  Die Welt der freien Software
    fordert viele bestehenden Annahmen &uuml;ber die Entwicklung, den
    Verkauf und die Wartung von Software heraus, und wir bitten Sie,
    ernsthaft dar&uuml;ber nachzudenken.</para>

  <sect1 id="contrib-what">
    <title>Was wird gebraucht?</title>

    <para>Die folgende Liste von Aufgaben und Unterprojekten
      repr&auml;sentiert eine Zusammenfassung von
      verschiedenen <filename>TODO</filename>-Listen und
      Benutzerw&uuml;nschen.</para>

    <sect2 id="non-programmer-tasks">
      <title>Aufgaben f&uuml;r Nicht-Programmierer</title>

      <para>Viele Menschen, die an FreeBSD beteiligt sind, sind keine
	Programmierer.  Es sind Leute, die an der Dokumentation arbeiten,
	Internetseiten erstellen oder einfach Hilfe anbieten.  Alles, was
	diese Leute mitbringen m&uuml;ssen, sind Zeit und die
	Bereitschaft, etwas zu lernen.</para>

      <orderedlist>
	<listitem>
	  <para>Lesen Sie die h&auml;ufig gestellten Fragen (FAQ) und
	    das Handbuch gelegentlich.  Wenn etwas schlecht erkl&auml;rt
	    wird, veraltet oder einfach falsch ist, teilen Sie es uns
	    mit.  Oder noch besser, korrigieren Sie es (SGML ist nicht
	    schwer zu erlernen, wir akzeptieren aber auch Vorschl&auml;ge
	    im ASCII-Format.).</para>
	</listitem>

	<listitem>
	  <para>Helfen Sie dabei, die Dokumentation in Ihre Muttersprache
	    zu &uuml;bersetzen.  Wenn an der &Uuml;bersetzung in Ihre
	    Sprache bereits gearbeitet wird, helfen Sie, indem Sie
	    weitere Dokumente &uuml;bersetzen, oder sorgen Sie daf&uuml;r,
	    dass die &Uuml;bersetzungen aktuell sind.  Lesen Sie zuerst
	    die <ulink url="&url.books.fdp-primer;/translations.html">
	    &Uuml;bersetzungs-FAQ</ulink> der Fibel f&uuml;r neue
	    Mitarbeiter des FreeBSD-Dokumentations-Projekts. Sie
	    verpflichten sich dabei nicht dazu, jede einzelne Seite zu
	    &uuml;bersetzen &mdash; als Freiwilliger &uuml;bersetzen
	    Sie genau so viel, wie Sie wollen.  Wenn jemand mit der
	    &Uuml;bersetzung beginnt, beteiligen sich fast immer auch
	    andere Personen daran.  Wenn Sie nur Zeit und
	    Energie f&uuml;r einen Teil der Dokumentation haben, dann
	    &uuml;bersetzen Sie bitte die Installationsanleitung.</para>
	</listitem>

	<listitem>
	  <para>Lesen Sie &a.questions; sowie die &ng.misc;
	    gelegentlich (oder sogar regelm&auml;&szlig;ig).  Es kann
	    sehr befriedigend sein, wenn Sie Ihr Wissen teilen und
	    anderen Leuten dabei helfen k&ouml;nnen, deren Probleme zu
	    l&ouml;sen; vielleicht lernen Sie sogar noch etwas Neues!
	    Diese Foren k&ouml;nnen auch eine Quelle f&uuml;r Ideen
	    sein, an denen man arbeiten k&ouml;nnte.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2 id="ongoing-programmer-tasks">
      <title>Aufgaben f&uuml;r Programmierer</title>

      <para>Die meisten der hier aufgef&uuml;hrten Aufgaben erfordern
	entweder einen bedeutenden Zeitaufwand oder eine sehr gute
	Kenntnis des FreeBSD-Kernels, oder beides.  Es gibt jedoch
	genug Aufgaben, die auch f&uuml;r
	<quote>Wochenendprogrammierer</quote> geeignet sind.</para>

      <orderedlist>
	<listitem>
	  <para>Wenn Sie FreeBSD-CURRENT installiert haben und &uuml;ber
	    eine schnelle Internetanbindung verf&uuml;gen, k&ouml;nnen
	    Sie von <hostid role="fqdn">current.FreeBSD.org</hostid>
	    ein t&auml;glich neu erzeugtes Release herunterladen &mdash;
	    versuchen Sie dann hin und wieder, das neueste Release zu
	    installieren und melden Sie dabei eventuell auftretende
	    Fehler.</para>
	</listitem>

	<listitem>
	  <para>Lesen Sie &a.bugs;.  Es k&ouml;nnte ein Problem geben,
	    an dem Sie konstruktiv mitarbeiten k&ouml;nnten, oder
	    f&uuml;r das es Patches gibt, die Sie testen k&ouml;nnten.
	    Oder Sie k&ouml;nnten sogar versuchen, eines dieser Probleme
	    selbst zu beheben.</para>
	</listitem>

	<listitem>
	  <para>Wenn Sie von Fehlerbehebungen wissen, die zwar
	    erfolgreich auf -CURRENT angewendet wurden, die aber nach
	    einem bestimmten Zeitraum nicht in -STABLE eingebracht
	    wurden (normalerweise innerhalb einiger Wochen), erinnern
	    Sie den Committer h&ouml;flich daran.</para>
	</listitem>

	<listitem>
	  <para>Verschieben Sie beigetragene Software im Quellcodebaum
	    nach <filename>src/contrib</filename>.</para>
	</listitem>

	<listitem>
	  <para>Stellen Sie sicher, dass der Code in
	    <filename>src/contrib</filename> aktuell ist.</para>
	</listitem>

	<listitem>
	  <para>Bauen Sie den Quellcodebaum (oder einen Teil des
	    Baumes) mit aktivierten Compilerwarnungen und beheben
	    Sie auftretende Fehlermeldungen.</para>
	</listitem>

	<listitem>
	  <para>Beheben Sie Fehlermeldungen bei der Installation
	    von Ports, die auf unsauberen Code hinweisen (etwa die
	    Verwendung von <function>gets()</function> oder die
	    Einbindung von <filename>malloc.h</filename>).</para>
	</listitem>

	<listitem>
	  <para>Wenn Sie einen Port repariert haben, senden Sie Ihre
	    Patches an die urspr&uuml;nglichen Autoren (die dadurch
	    die n&auml;chste Version des Ports verbessern
	    k&ouml;nnen).</para>
	</listitem>

	<listitem>
	  <para>Besorgen Sie sich Kopien von wichtigen Standards wie
	    &posix;.  Als Ausgangspunkt f&uuml;r Ihre Suche k&ouml;nnen
	    Sie die Seite des <ulink
	    url="&url.base;/projects/c99/index.html">FreeBSD
	    C99 & POSIX Standards Conformance Project</ulink> verwenden.
	    Vergleichen Sie das Verhalten von FreeBSD mit dem von dem
	    jeweiligen Standard geforderten Verhalten.  Verh&auml;lt
	    sich FreeBSD in einem Bereich unterschiedlich, sollten Sie
	    einen Problembericht (PR) einsenden.  Wenn Sie dazu in der
	    Lage sind, k&ouml;nnen Sie sich auch eine L&ouml;sung des
	    Problems &uuml;berlegen und Ihrem PR einen Patch
	    anf&uuml;gen.  Wenn Sie der Meinung sind, dass der Standard
	    nicht korrekt ist, k&ouml;nnen Sie auch das jeweilige
	    Standardgremium um weitere Informationen bitten.</para>
	</listitem>

	<listitem>
	  <para>Schlagen Sie weitere Aufgaben f&uuml;r diese Liste
	    vor!</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>Die PR-Datenbank durchsehen</title>

      <indexterm><primary>problem reports database</primary></indexterm>

      <para>Die <ulink
	url="&url.base;/cgi/query-pr-summary.cgi">FreeBSD
	PR-Datenbank</ulink> enth&auml;lt alle derzeit offenen
	Problemberichte und Verbesserungsw&uuml;sche, die von
	Anwendern eingereicht wurden.  Die PR-Datenbank enth&auml;lt
	sowohl Aufgaben f&uuml;r Programmierer als auch f&uuml;r
	Nichtprogrammierer.  Gehen Sie die Liste der offenen PRs durch,
	um festzustellen, ob Sie ein Problem interessiert.  Bei manchen
	Berichten geht es nur darum, zu &uuml;berpr&uuml;fen, ob der
	bereitgestellte Patch korrekt funktioniert.  Andere
	Problemberichte sind hingegen komplexer, oder beinhalten
	&uuml;berhaupt keinen L&ouml;sungsvorschlag.</para>

      <para>Beginnen Sie mit den PRs, die niemandem zugewiesen sind.
	Ist ein PR, f&uuml;r den Sie eine L&ouml;sung h&auml;tten,
	bereits jemandem zugewiesen, nehmen Sie mit dem daf&uuml;r
	Zust&auml;ndigen Kontakt auf und fragen Sie ihn, ob Sie an
	der L&ouml;sung mitarbeiten k&ouml;nnen &mdash; es k&ouml;nnte
	etwa bereits ein Patch existieren, der nur noch getestet werden
	muss, oder Sie k&ouml;nnten weitere Ideen mit ihm
	diskutieren.</para>
    </sect2>
  </sect1>

  <sect1 id="contrib-how">
    <title>Was Sie tun k&ouml;nnen</title>

    <para>M&ouml;gliche Beitr&auml;ge lassen sich in f&uuml;nf
      Kategorien einteilen:</para>

    <sect2 id="contrib-general">
      <title>Fehlerberichte und allgemeine Vorschl&auml;ge</title>

      <para>Eine Idee oder ein Vorschlag von
	<emphasis>allgemeinem</emphasis> technischen Interesse sollte
	an &a.hackers; geschickt werden.  Personen, die an solchen
	Fragen interessiert sind (und kein Problem mit einem
	<emphasis>hohen</emphasis> Mailaufkommen haben!) k&ouml;nnen
	die Mailingliste &a.hackers; auch abonnieren.  Informationen
	zu dieser und anderen Mailinglisten finden Sie im <ulink
	url="&url.books.handbook;/eresources.html#ERESOURCES-MAIL">
	FreeBSD Handbuch</ulink>.</para>

      <para>Wenn Sie einen Fehler gefunden oder eine Verbesserung
	entwickelt haben, vergessen Sie nicht, einen Bericht &uuml;ber
	&man.send-pr.1; oder dessen <ulink
	url="&url.base;/send-pr.html">Internetschnittstelle</ulink>
	zu erstellen.  Versuchen Sie bitte, jedes Feld auszuf&uuml;llen.
	Ist Ihr Patch kleiner als 65&nbsp;KB, sollten Sie ihn direkt in
	den Bericht einbauen.  Kann der Patch direkt auf den Quellcodebaum
	angewendet werden, f&uuml;gen Sie <literal>[PATCH]</literal>
	im Synopsis-Feld ein.  Wenn Sie einen Patch einf&uuml;gen,
	verwenden Sie bitte <emphasis>kein copy-and-paste</emphasis>,
	weil dadurch Tabulatoren in Leerzeichen umgewandelt werden, was
	den Patch unbrauchbar macht.  Sind die Patches gr&ouml;&szlig;er
	als 20&nbsp;KB, sollten Sie sie komprimieren und mit
	&man.uuencode.1; umwandeln.</para>

      <para>Nachdem Sie einen Bericht versandt haben, erhalten Sie eine
	E-Mail, die eine Best&auml;tigung sowie eine
	Identifikationsnummer enth&auml;lt.  Geben Sie diese Nummer im
	Betreff der Nachricht an (<literal>"Re:  kern/3377"</literal>),
	wenn Sie neue Informationen zu diesem Problem an
	&a.bugfollowup; senden.
	Zus&auml;tzliche Informationen zu Problemberichten sollten immer
	auf diese Art und Weise verschickt werden.</para>

      <para>Sollten Sie innerhalb einer Woche keine Best&auml;tigung
	erhalten, oder &man.send-pr.1; nicht verwenden k&ouml;nnen,
	k&ouml;nnen Sie &uuml;ber &a.bugs; jemanden bitten, dies
	f&uuml;r Sie zu erledigen.</para>

      <para>Weitere Informationen zum Verfassen von guten
	Problemberichten finden Sie im entsprechenden <ulink
	url="&url.articles.problem-reports.en;/article.html">
	Artikel</ulink>.</para>
    </sect2>

    <sect2>
      <title>&Auml;nderungen der Dokumentation</title>

      <indexterm><primary>documentation submissions</primary></indexterm>

      <para>&Auml;nderungen der Dokumentation werden vom &a.doc;
	&uuml;berwacht.  Lesen Sie bitte die <ulink
	url="&url.books.fdp-primer;/index.html">Fibel für neue
	Mitarbeiter des FreeBSD-Dokumentationsprojekts</ulink> f&uuml;r
	weitere Informationen.  Korrekturen und Erg&auml;nzungen
	(selbst kleine &Auml;nderungen sind willkommen!) werden mit
	&man.send-pr.1; &uuml;bermittelt.  Lesen Sie dazu den Abschnitt
	<link linkend="contrib-general">Fehlerberichte und allgemeine
	Vorschl&auml;ge</link>.</para>
    </sect2>

    <sect2>
      <title>&Auml;nderungen am vorhandenen Quellcode</title>

      <indexterm><primary>FreeBSD-CURRENT</primary></indexterm>

      <para>&Auml;nderungen des existierenden Quellcodes sind etwas
	komplizierter.  Entscheidend ist hier, wie
	vertraut Sie mit dem aktuellen Entwicklungsstand von
	FreeBSD sind.  Es existiert eine spezielle, st&auml;ndig
	aktualisierte Version von FreeBSD, die als
	<quote>FreeBSD-CURRENT</quote> bekannt ist.  Diese ist auf
	verschiedenen Wegen erh&auml;ltlich und stellt den
	aktuellen Stand der Entwicklung dar.  Lesen Sie den Abschnitt
	<ulink url="&url.books.handbook;/current-stable.html">
	FreeBSD-CURRENT vs. FreeBSD-STABLE</ulink> des Handbuchs
	f&uuml;r weitere Informationen zur Installation und Verwendung
	von FreeBSD-CURRENT.</para>

      <para>Arbeiten Sie mit &auml;lteren Quellcodeversionen, kann
	dies leider bedeuten, das Ihre &Auml;nderungen obsolet sind,
	oder sich nicht mehr in FreeBSD reintegrieren lassen.  Dieses
	Risiko l&auml;sst sich verringern, wenn Sie die Mailinglisten
	&a.announce; und &a.current; abonnieren, auf denen aktuelle
	System&auml;nderungen diskutiert werden.</para>

      <para>Wenn Ihre &Auml;nderungen auf ausreichend aktuellen Quellen
	beruhen, erstellen Sie als N&auml;chstes einen Differenzensatz,
	den Sie an die FreeBSD-Entwickler schicken.  Eine solche
	Differenz erstellen Sie mit &man.diff.1;.</para>

      <para>Das bevorzugte &man.diff.1;-Format f&uuml;r das Versenden
	von Patches ist das sogenannte <foreignphrase>unified
	output</foreignphrase>-Format, das Sie mit
	<command>diff -u</command> erstellen.  F&uuml;r
	gr&ouml;&szlig;ere &Auml;nderungen kann allerdings das
	<foreignphrase>context output</foreignphrase>-Format
	(erzeugt mit <command>diff -c</command>) die bessere Wahl
	sein.</para>

      <indexterm>
	<primary><command>diff</command></primary>
      </indexterm>

      <para>Dazu ein Beispiel:</para>

      <para>
	<screen>&prompt.user; <userinput>diff -c oldfile newfile</userinput></screen>

	oder

	<screen>&prompt.user; <userinput>diff -c -r olddir newdir</userinput></screen>

	w&uuml;rde einen solchen Satz von Differenzen f&uuml;r die angegebene
	Verzeichnishierarchie erzeugen.</para>

      <para>
	<screen>&prompt.user; <userinput>diff -u oldfile newfile</userinput></screen>

	oder

	<screen>&prompt.user; <userinput>diff -u -r olddir newdir</userinput></screen>

	h&auml;tte den gleichen Effekt, allerdings erfolgt die Ausgabe
	im <foreignphrase>unified diff</foreignphrase>-Format.</para>

      <para>Lesen Sie dazu auch &man.diff.1;.</para>

      <para>Nachdem Sie den Differenzensatz erstellt und mit
	&man.patch.1; getestet haben, sollten Sie ihn an das
	FreeBSD-Projekt senden.  Verwenden Sie dazu &man.send-pr.1;
	(wie im Abschnitt <link
	linkend="contrib-general">Fehlerberichte und allgemeine
	Vorschl&auml;ge</link> beschrieben).  Senden Sie die
	Differenzen <emphasis>nicht nur</emphasis> an &a.hackers;, da
	diese sonst verloren gehen.  Wir freuen uns &uuml;ber Ihren
	Beitrag (schlie&szlig;lich ist FreeBSD ein Freiwilligenprojekt);
	wir sind aber manchmal nicht in der Lage, das Problem sofort
	anzugehen.  Es verbleibt aber in der PR-Datenbank, bis wir
	daf&uuml;r Zeit finden.  Verwenden Sie den Begriff
	<literal>[PATCH]</literal> im Synopsis-Feld des Berichts.</para>

      <indexterm>
        <primary><command>uuencode</command></primary>
      </indexterm>

      <para>Sie k&ouml;nnen auch ein <command>tar</command>-Archiv
	erzeugen (was vor allem dann sinnvoll ist, wenn Sie Dateien
	hinzugef&uuml;gt, gel&ouml;scht oder umbenannt haben) und
	&man.uuencode.1; auf das Archiv anwenden.  Mit &man.shar.1;
	erzeugte Archive sind ebenfalls willkommen.</para>

      <para>Wenn Ihre &Auml;nderungen potentielle Probleme aufweisen,
	wie Unklarheiten im Hinblick auf das Copyright, oder Sie
	einfach eine genaue &Uuml;berpr&uuml;fung Ihrer &Auml;nderungen
	m&ouml;chten, sollten Sie die &Auml;nderungen an das &a.core;
	schicken, statt sie mit &man.send-pr.1; zu versenden.  Die
	Mailingliste &a.core; erreicht nur eine kleine Gruppe von
	Leuten, die sich um die t&auml;gliche Arbeit an FreeSD
	k&uuml;mmern.  Beachten Sie aber, dass diese Gruppe
	<emphasis>sehr besch&auml;ftigt</emphasis> ist.  Daher sollten
	Sie nur dann eine E-Mail an sie schicken, wenn es absolut
	notwendig ist.</para>

      <para>&man.intro.9; und &man.style.9; beschreiben den zu
	verwendenden Programmierstil.  Bevor Sie also Code
	versenden, sollten Sie diese Informationen gelesen
	haben.</para>
    </sect2>

    <sect2>
      <title>Neuer Code oder gro&szlig;e Mehrwertpakete</title>

      <para>Handelt es sich um einen bedeutenden Beitrag oder um
	das Hinzuf&uuml;gen von neuen wichtigen F&auml;higkeiten zu
	FreeBSD, ist es fast immer notwendig, die &Auml;nderungen
	als <foreignphrase>uuencoded tar</foreignphrase>-Dateien
	zu versenden, oder diese auf einer Internetseite oder einem
	FTP-Server bereitzustellen.  Haben Sie keinen eigenen
	Speicherplatz im Internet, sollten Sie auf einer
	entsprechenden Mailinglisten nachfragen, ob jemand diese
	Aufgabe f&uuml;r Sie &uuml;bernehmen kann.</para>

      <para>Arbeitet man mit gro&szlig;en Codebest&auml;nden,
	kommt man unweigerlich mit den unterschiedlichen Lizenzen
	in Ber&uuml;hrung.  Code, der in FreeBSD enthalten ist,
	kann unter den folgenden Lizenzen stehen:</para>

      <orderedlist>
  <indexterm><primary>BSD-Lizenz</primary></indexterm>
	<listitem>
	  <para>Der BSD-Lizenz.  Diese Lizenz wird von uns bevorzugt,
	    weil sie an <quote>keine Bedingungen</quote> gekn&uuml;pft
	    ist und daher f&uuml;r kommerzielle Unternehmen sehr
	    attraktiv ist.  Das FreeBSD-Projekt unterst&uuml;tzt diese
	    kommerzielle Verwendung, die manchmal sogar in eine
	    F&ouml;rderung des FreeBSD-Projekts m&uuml;ndet.</para>
	</listitem>

  <indexterm><primary>GPL</primary><see>GNU General Public License</see></indexterm>
  <indexterm><primary>GNU General Public License</primary></indexterm>

	<listitem>
	  <para>Der GNU General Public License, oder <quote>GPL</quote>.
	    Diese Lizenz ist nicht ganz so beliebt bei uns, da sie
	    die kommerzielle Nutzung des Quellcodes einschr&auml;nkt.
	    In Anbetracht der schieren Menge an GPL-Quellcode, den
	    wir derzeit ben&ouml;tigen (wie Compiler, Assembler oder
	    Textformatierer) w&auml;ren wir aber schlecht beraten,
	    Beitr&auml;ge, die unter dieser Lizenz stehen, abzulehnen.
	    Code, der unter der GPL steht, befindet sich in einem
	    gesonderten Bereich des Quellcodebaums, und zwar unter
	    <filename>/sys/gnu</filename> oder
	    <filename>/usr/src/gnu</filename>, und ist daher f&uuml;r
	    jeden, f&uuml;r den die GPL ein Problem darstellt, sofort
	    erkennbar.</para>
	</listitem>
      </orderedlist>

      <para>Beitr&auml;ge, die unter einer dieser Lizenzen stehen,
	m&uuml;ssen sorgf&auml;ltig gepr&uuml;ft werden, bevor ihre
	Aufnahme in FreeBSD in Betracht gezogen wird.  Beitr&auml;ge,
	f&uuml;r die besonders restriktive Lizenzen gelten, werden
	generell abgelehnt, obwohl die Autoren ermutigt werden,
	ihre Ver&auml;nderungen &uuml;ber ihre eigenen Kan&auml;le
	verf&uuml;gbar zu machen.</para>

      <para>Um Ihre Arbeit unter die <quote>BSD-Lizenz</quote> zu
	stellen, f&uuml;gen Sie den folgenden Text am Beginn jeder
	von Ihnen erstellten Quellcodedatei ein, wobei Sie den Text
	zwischen den <literal>%%</literal>-Zeichen durch die
	entsprechenden Informationen ersetzt:</para>

      <programlisting>Copyright (c) %%Jahr der Ver&ouml;ffentlichung%%
        %%Ihr Name%%, %%Ihr Land%%  %%Ihre Postleitzahl%%.
	All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
1. Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer as
   the first lines of this file unmodified.
2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

THIS SOFTWARE IS PROVIDED BY %%Ihr Name%% ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL %%Ihr Name%% BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

        &#36;Id&#36;</programlisting>

      <para>Eine Kopie dieses Textes finden Sie unter
	<filename>/usr/share/examples/etc/bsd-style-copyright</filename>.</para>
    </sect2>

    <sect2>
      <title>Geld, Hardware oder Internetzugang</title>

      <para>Wir freuen uns immer, wenn jemand das FreeBSD-Projekt
	durch Spenden unterst&uuml;tzen will.  Auch kleine Spenden
	k&ouml;nnen eine gro&szlig;e Wirkung haben.  Hardwarespenden
	sind ebenfalls sehr wichtig, um die Liste der von FreeBSD
	unterst&uuml;tzten Hardware erweitern zu k&ouml;nnen, da
	uns die Mittel zum Erwerb dieser Hardware fehlen.</para>

      <sect3>
	<title><anchor id="donations">Geldspenden</title>

	<para>Die FreeBSD Foundation ist eine gemeinn&uuml;tzige
	  Gesellschaft, die zur Unterst&uuml;tzung des FreeBSD-Projekts
	  geschaffen wurde.  Sie ist nach dem Paragraphen 501(c)3
	  sowohl von der amerikanischen Einkommenssteuer als auch von
	  der des Staates Colorado befreit.  Spenden an solche
	  steuerbefreiten Gesellschaften k&ouml;nnen unter gewissen
	  Umst&auml;nden steuermindernd geltend gemacht werden.</para>

	<para>Sie k&ouml;nnen Spenden in Scheckform an folgende Adresse
	  senden:
	  <address>
	    The FreeBSD Foundation
	    <street>7321 Brockway Dr.</street>
	    <city>Boulder</city>, <state>CO</state> <postcode>80303</postcode>
	    <country>USA</country>
	  </address>
	</para>

	<para>Die FreeBSD Foundation ist nun auch in der Lage, Spenden
	  durch das PayPal-System entgegenzunehmen.  Solche Spenden
	  k&ouml;nnen &uuml;ber die <ulink
	  url="http://www.freebsdfoundation.org">Homepage</ulink> der
	  Foundation erfolgen.</para>

	<para>F&uuml;r weitere Informationen zur FreeBSD Foundation
	  sollten Sie den Artikel <ulink
	  url="http://people.FreeBSD.org/~jdp/foundation/announcement.html">
	  The FreeBSD Foundation -- an Introduction</ulink> lesen.  Sie
	  erreichen die FreeBSD Foundation &uuml;ber die
	  E-Mail-Adresse <email>bod@FreeBSDFoundation.org</email>.</para>
      </sect3>

      <sect3>
	<title>Hardwarespenden</title>

	<indexterm><primary>donations</primary></indexterm>

	<para>Das FreeBSD-Projekt freut sich, wenn jemand ben&ouml;tigte
	  Hardware spenden will.  Sind Sie daran interessiert, setzen
	  Sie sich bitte mit dem <ulink
	  url="&url.base;/donations/">Donations Liaison
	  Office</ulink> in Verbindung.</para>
      </sect3>

      <sect3>
	<title>Internetzugang zur Verf&uuml;gung stellen</title>

	<para>Wir sind st&auml;ndig auf der Suche nach neuen FTP-,
	  WWW- oder <command>cvsup</command>-Spiegeln.  Wenn Sie einen
	  solchen Spiegel einrichten wollen, lesen Sie bitte den Artikel
	  <ulink
	  url="&url.articles.hubs.en;/index.html">Mirroring FreeBSD</ulink>,
	  der weitere Informationen enth&auml;lt.</para>
      </sect3>
    </sect2>
  </sect1>

</article>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
