Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/geom/_index.po
Languages: ko, ru

source: Reboot the system to test the new mirror and verify that all data has been copied. The BIOS will see the mirror as two individual drives rather than a mirror. Since the drives are identical, it does not matter which is selected to boot.
ko: 시스템을 재부팅하여 새 미러를 테스트하고 모든 데이터가 복사되었는지 확인합니다. BIOS는 미러를 하나의 드라이브가 아닌 두 개의 개별 드라이브로 인식합니다. 드라이브가 동일하므로 어떤 드라이브를 부팅하도록 선택하든 상관없습니다.
ru: Перезагрузите систему, чтобы проверить новое зеркало и убедиться, что все данные скопированы. BIOS увидит зеркало как два отдельных диска, а не как зеркало. Поскольку диски идентичны, не имеет значения, какой из них выбран для загрузки.

source: See <<gmirror-troubleshooting>> if there are problems booting. Powering down and disconnecting the original [.filename]#ada0# disk will allow it to be kept as an offline backup.
ko: 부팅에 문제가 있는 경우 <<gmirror-troubleshooting>>을 참조하세요. 원본 [.filename]#ada0# 디스크의 전원을 끄고 연결을 해제하면 오프라인 백업으로 보관할 수 있습니다.

source: In use, the mirror will behave just like the original single drive.
ko: 사용 중 미러는 기존의 단일 드라이브와 똑같이 작동합니다.
ru: При использовании зеркало будет вести себя так же, как исходный одиночный диск.

source: Creating a Mirror with an Existing Drive
ko: 기존 드라이브로 미러 만들기
ru: Создание зеркала с существующим диском

source: In this example, FreeBSD has already been installed on a single disk, [.filename]#ada0#. A new disk, [.filename]#ada1#, has been connected to the system. A one-disk mirror will be created on the new disk, the existing system copied onto it, and then the old disk will be inserted into the mirror. This slightly complex procedure is required because `gmirror` needs to put a 512-byte block of metadata at the end of each disk, and the existing [.filename]#ada0# has usually had all of its space already allocated.
ko: 이 예제에서는 FreeBSD가 이미 단일 디스크인 [.filename]#ada0#에 설치되어 있습니다. 새 디스크인 [.filename]#ada1#이 시스템에 연결되었습니다. 새 디스크에 하나의 디스크 미러가 생성되고 기존 시스템이 이 디스크에 복사된 다음 이전 디스크가 미러에 삽입됩니다. 이 약간 복잡한 절차가 필요한 이유는 `gmirror`가 각 디스크 끝에 512바이트의 메타데이터 블록을 넣어야 하고, 기존 [.filename]#ada0#에는 일반적으로 이미 모든 공간이 할당되어 있기 때문입니다.
ru: В этом примере FreeBSD уже установлена на одном диске [.filename]#ada0#. К системе подключён новый диск [.filename]#ada1#. На новом диске будет создано однодисковое зеркало, существующая система скопирована на него, после чего старый диск будет добавлен в зеркало. Эта несколько сложная процедура необходима, потому что `gmirror` требует размещения 512-байтового блока метаданных в конце каждого диска, а на существующем [.filename]#ada0# обычно всё пространство уже занято.

source: Load the [.filename]#geom_mirror.ko# kernel module:
ko: [.filename]#geom_mirror.ko# 커널 모듈을 로드합니다:
ru: Загрузите модуль ядра [.filename]#geom_mirror.ko#:

source: Check the media size of the original disk with `diskinfo`:
ko: `diskinfo`로 원본 디스크의 미디어 크기를 확인합니다:
ru: Проверьте размер носителя исходного диска с помощью `diskinfo`:

source: Create a mirror on the new disk. To make certain that the mirror capacity is not any larger than the original [.filename]#ada0# drive, man:gnop[8] is used to create a fake drive of the exact same size. This drive does not store any data, but is used only to limit the size of the mirror. When man:gmirror[8] creates the mirror, it will restrict the capacity to the size of [.filename]#gzero.nop#, even if the new [.filename]#ada1# drive has more space. Note that the _1000204821504_ in the second line is equal to [.filename]#ada0#'s media size as shown by `diskinfo` above.
ko: 새 디스크에 미러를 만듭니다. 미러 용량이 원래 [.filename]#ada0# 드라이브보다 크지 않도록 하기 위해 man:gnop[8]을 사용하여 정확히 같은 크기의 가짜 드라이브를 만듭니다. 이 드라이브는 데이터를 저장하지 않고 미러의 크기를 한정하는 데만 사용됩니다. man:gmirror[8]가 미러를 생성하면 새 [.filename]#ada1# 드라이브에 더 많은 공간이 있더라도 용량을 [.filename]#gzero.nop#의 크기로 제한합니다. 두 번째 줄의 _1000204821504_는 위의 `diskinfo`에 표시된 대로 [.filename]#ada0#의 미디어 크기와 동일하다는 점에 유의하세요.

source: Since [.filename]#gzero.nop# does not store any data, the mirror does not see it as connected. The mirror is told to "forget" unconnected components, removing references to [.filename]#gzero.nop#. The result is a mirror device containing only a single disk, [.filename]#ada1#.
ko: [.filename]#gzero.nop#는 데이터를 저장하지 않으므로 미러는 연결된 것으로 인식하지 않습니다. 미러는 연결되지 않은 구성 요소를 "잊어버리도록" 지시하여 [.filename]#gzero.nop#에 대한 참조를 제거합니다. 그 결과 미러 장치에는 [.filename]#ada1#이라는 단일 디스크만 포함됩니다.
ru: Поскольку [.filename]#gzero.nop# не хранит никаких данных, зеркало не считает его подключенным. Зеркалу указывается «забыть» неподключенные компоненты, удаляя ссылки на [.filename]#gzero.nop#. В результате получается зеркальное устройство, содержащее только один диск — [.filename]#ada1#.

source: After creating [.filename]#gm0#, view the partition table on [.filename]#ada0#. This output is from a 1 TB drive. If there is some unallocated space at the end of the drive, the contents may be copied directly from [.filename]#ada0# to the new mirror.
ko: [.filename]#gm0#을 만든 후 [.filename]#ada0#에서 파티션 테이블을 확인합니다. 이 출력은 1TB 드라이브에서 가져온 것입니다. 드라이브 끝에 할당되지 않은 공간이 있는 경우 [.filename]#ada0#에서 새 미러로 콘텐츠를 직접 복사할 수 있습니다.
ru: После создания [.filename]#gm0# просмотрите таблицу разделов на [.filename]#ada0#. Этот вывод сделан для диска объемом 1 ТБ. Если в конце диска осталось нераспределенное пространство, содержимое можно скопировать напрямую с [.filename]#ada0# на новое зеркало.

source: However, if the output shows that all of the space on the disk is allocated, as in the following listing, there is no space available for the 512-byte mirror metadata at the end of the disk.
ko: 그러나 다음 목록과 같이 출력에 디스크의 모든 공간이 할당된 것으로 표시되면 디스크 끝에 512바이트의 미러 메타데이터에 사용할 수 있는 공간이 없는 것입니다.
ru: Однако, если вывод показывает, что всё пространство на диске занято, как в следующем примере, то для метаданных зеркала размером 512 байт в конце диска не остаётся места.

source: In this case, the partition table must be edited to reduce the capacity by one sector on [.filename]#mirror/gm0#. The procedure will be explained later.
ko: 이 경우 파티션 테이블을 편집하여 [.filename]#mirror/gm0#의 용량을 한 섹터씩 줄여야 합니다. 절차는 나중에 설명하겠습니다.
ru: В этом случае необходимо отредактировать таблицу разделов, уменьшив ёмкость на один сектор для [.filename]#mirror/gm0#. Процедура будет описана далее.

source: In either case, partition tables on the primary disk should be first copied using `gpart backup` and `gpart restore`.
ko: 두 경우 모두 기본 디스크의 파티션 테이블은 먼저 `gpart backup` 및 `gpart restore`을 사용하여 복사해야 합니다.
ru: В любом случае таблицы разделов на основном диске следует сначала скопировать с помощью `gpart backup` и `gpart restore`.

source: These commands create two files, [.filename]#table.ada0# and [.filename]#table.ada0s1#. This example is from a 1 TB drive:
ko: 이 명령은 [.filename]#table.ada0# 및 [.filename]#table.ada0s1#이라는 두 개의 파일을 생성합니다. 이 예는 1TB 드라이브에서 가져온 것입니다:
ru: Эти команды создают два файла, [.filename]#table.ada0# и [.filename]#table.ada0s1#. Этот пример приведен для диска объемом 1 ТБ:

source: If no free space is shown at the end of the disk, the size of both the slice and the last partition must be reduced by one sector. Edit the two files, reducing the size of both the slice and last partition by one. These are the last numbers in each listing.
ko: 디스크 끝에 여유 공간이 표시되지 않으면 슬라이스와 마지막 파티션의 크기를 모두 한 섹터씩 줄여야 합니다. 두 파일을 편집하여 슬라이스와 마지막 파티션의 크기를 모두 하나씩 줄입니다. 이것이 각 목록의 마지막 숫자입니다.
ru: Если в конце диска не отображается свободное пространство, размер и раздела, и последнего раздела должен быть уменьшен на один сектор. Отредактируйте два файла, уменьшив размер и раздела, и последнего раздела на единицу. Это последние числа в каждом списке.

source: If at least one sector was unallocated at the end of the disk, these two files can be used without modification.
ko: 디스크 끝에 하나 이상의 섹터가 할당되지 않은 경우, 이 두 파일은 수정 없이 사용할 수 있습니다.
ru: Если хотя бы один сектор в конце диска был нераспределен, эти два файла можно использовать без изменений.

source: Now restore the partition table into [.filename]#mirror/gm0#:
ko: 이제 파티션 테이블을 [.filename]#mirror/gm0#로 복원합니다:
ru: Теперь восстановите таблицу разделов в [.filename]#mirror/gm0#:

source: Check the partition table with `gpart show`. This example has [.filename]#gm0s1a# for [.filename]#/#, [.filename]#gm0s1d# for [.filename]#/var#, [.filename]#gm0s1e# for [.filename]#/usr#, [.filename]#gm0s1f# for [.filename]#/data1#, and [.filename]#gm0s1g# for [.filename]#/data2#.
ko: `gpart show`로 파티션 테이블을 확인합니다. 이 예제에서는 [.filename]#/#가 [.filename]#gm0s1a#에, [.filename]#/var#는 [.filename]#gm0s1d#에, [.filename]#/usr#는 [.filename]#gm0s1e#에, [.filename]#/data1#는 [.filename]#gm0s1f#에, [.filename]#/data2#는 [.filename]#gm0s1g#에 위치합니다.
ru: Проверьте таблицу разделов с помощью `gpart show`. В этом примере [.filename]#gm0s1a# для [.filename]#/#, [.filename]#gm0s1d# для [.filename]#/var#, [.filename]#gm0s1e# для [.filename]#/usr#, [.filename]#gm0s1f# для [.filename]#/data1# и [.filename]#gm0s1g# для [.filename]#/data2#.

source: Both the slice and the last partition must have at least one free block at the end of the disk.
ko: 슬라이스와 마지막 파티션 모두 디스크 끝에 하나 이상의 여유블록이 있어야 합니다.
ru: Как срез, так и последний раздел должны иметь как минимум один свободный блок в конце диска.

source: Create file systems on these new partitions. The number of partitions will vary to match the original disk, [.filename]#ada0#.
ko: 이 새 파티션에 파일 시스템을 만듭니다. 파티션 수는 원본 디스크인 [.filename]#ada0#와 일치하도록 변경됩니다.
ru: Создайте файловые системы на этих новых разделах. Количество разделов может варьироваться в соответствии с исходным диском, [.filename]#ada0#.

source: Adjust [.filename]#/etc/fstab# to use the new partitions on the mirror. Back up this file first by copying it to [.filename]#/etc/fstab.orig#.
ko: 미러에서 새 파티션을 사용하도록 [.filename]#/etc/fstab#을 변경합니다. 먼저 이 파일을 [.filename]#/etc/fstab.orig#에 복사하여 백업합니다.
ru: Настройте [.filename]#/etc/fstab# для использования новых разделов на зеркале. Сначала создайте резервную копию этого файла, скопировав его в [.filename]#/etc/fstab.orig#.

source: Edit [.filename]#/etc/fstab#, replacing [.filename]#/dev/ada0# with [.filename]#mirror/gm0#.
ko: [.filename]#/etc/fstab#을 편집하여 [.filename]#/dev/ada0#을 [.filename]#mirror/gm0#로 바꿉니다.
ru: Отредактируйте файл [.filename]#/etc/fstab#, заменив [.filename]#/dev/ada0# на [.filename]#mirror/gm0#.

source: If the [.filename]#geom_mirror.ko# kernel module has not been built into the kernel, edit [.filename]#/boot/loader.conf# to load it at boot:
ko: 커널 모듈이 커널에 빌드되지 않은 경우 [.filename]#geom_mirror.ko# 커널 모듈이 부팅 시 로드되도록 [.filename]#/boot/loader.conf#를 편집합니다:
ru: Если модуль ядра [.filename]#geom_mirror.ko# не встроен в ядро, отредактируйте [.filename]#/boot/loader.conf# для его загрузки при старте системы:

source: File systems from the original disk can now be copied onto the mirror with man:dump[8] and man:restore[8]. Each file system dumped with `dump -L` will create a snapshot first, which can take some time.
ko: 이제 man:dump[8] 및 man:restore[8]를 사용하여 원본 디스크의 파일 시스템을 미러에 복사할 수 있습니다. `dump -L`로 덤프된 각 파일 시스템은 먼저 스냅샷을 생성하므로 시간이 다소 걸릴 수 있습니다.
ru: Файловые системы с исходного диска теперь можно скопировать на зеркало с помощью man:dump[8] и man:restore[8]. Каждая файловая система, сохранённая с помощью `dump -L`, сначала создаст снимок, что может занять некоторое время.

source: Restart the system, booting from [.filename]#ada1#. If everything is working, the system will boot from [.filename]#mirror/gm0#, which now contains the same data as [.filename]#ada0# had previously. See <<gmirror-troubleshooting>> if there are problems booting.
ko: 시스템을 재시작하여 [.filename]#ada1#에서 부팅합니다. 모든 것이 정상적으로 작동하면 시스템이 [.filename]#mirror/gm0#에서 부팅되며, 이제 [.filename]#ada0#에 이전에 있던 것과 동일한 데이터가 포함됩니다. 부팅에 문제가 있는 경우 <<gmirror-troubleshooting>>을 참조하세요.

source: At this point, the mirror still consists of only the single [.filename]#ada1# disk.
ko: 이 시점에 미러는 여전히 단일 [.filename]#ada1# 디스크로만 구성됩니다.
ru: На этом этапе зеркало всё ещё состоит только из одного диска [.filename]#ada1#.

source: After booting from [.filename]#mirror/gm0# successfully, the final step is inserting [.filename]#ada0# into the mirror.
ko: [.filename]#mirror/gm0#에서 성공적으로 부팅된 후 마지막 단계는 [.filename]#ada0#를 미러에 삽입하는 것입니다.
ru: После успешной загрузки с [.filename]#mirror/gm0# последним шагом будет добавление [.filename]#ada0# в зеркало.

source: When [.filename]#ada0# is inserted into the mirror, its former contents will be overwritten by data from the mirror. Make certain that [.filename]#mirror/gm0# has the same contents as [.filename]#ada0# before adding [.filename]#ada0# to the mirror. If the contents previously copied by man:dump[8] and man:restore[8] are not identical to what was on [.filename]#ada0#, revert [.filename]#/etc/fstab# to mount the file systems on [.filename]#ada0#, reboot, and start the whole procedure again.
ko: [.filename]#ada0#를 미러에 삽입하면 이전 내용이 미러의 데이터로 덮어씌워집니다. 미러에 [.filename]#ada0#을 추가하기 전에 [.filename]#mirror/gm0#이 [.filename]#ada0#와 동일한 내용을 가지고 있는지 확인하세요. man:dump[8] 및 man:restore[8]로 이전에 복사한 내용이 [.filename]#ada0#에 있는 내용과 동일하지 않으면 [.filename]#/etc/fstab#을 되돌리고 [.filename]#ada0#에 파일 시스템을 마운트한 후 재부팅하여 전체 절차를 다시 시작하세요.
ru: Когда диск [.filename]#ada0# добавляется в зеркало, его прежнее содержимое будет перезаписано данными из зеркала. Убедитесь, что [.filename]#mirror/gm0# имеет такое же содержимое, как [.filename]#ada0#, перед добавлением [.filename]#ada0# в зеркало. Если данные, ранее скопированные с помощью man:dump[8] и man:restore[8], не идентичны тому, что было на [.filename]#ada0#, верните [.filename]#/etc/fstab# к монтированию файловых систем на [.filename]#ada0#, перезагрузите систему и начните всю процедуру заново.

source: Synchronization between the two disks will start immediately. Use `gmirror status` to view the progress.
ko: 두 디스크 간의 동기화가 즉시 시작됩니다. 진행 상황을 보려면 `gmirror status`를 사용하세요.
ru: Синхронизация между двумя дисками начнется немедленно. Для просмотра прогресса используйте команду `gmirror status`.

source: After a while, synchronization will finish.
ko: 잠시 후 동기화가 완료됩니다.
ru: Через некоторое время синхронизация завершится.

source: [.filename]#mirror/gm0# now consists of the two disks [.filename]#ada0# and [.filename]#ada1#, and the contents are automatically synchronized with each other. In use, [.filename]#mirror/gm0# will behave just like the original single drive.
ko: 이제 [.filename]#mirror/gm0#는 두 개의 디스크 [.filename]#ada0#과 [.filename]#ada1#으로 구성되며, 콘텐츠는 서로 자동으로 동기화됩니다. 사용 시 [.filename]#mirror/gm0#은 기존의 단일 드라이브처럼 작동합니다.
ru: [.filename]#mirror/gm0# теперь состоит из двух дисков [.filename]#ada0# и [.filename]#ada1#, и их содержимое автоматически синхронизируется между собой. При использовании [.filename]#mirror/gm0# будет вести себя так же, как исходный одиночный диск.

source: Troubleshooting
ko: 문제 해결
ru: Устранение неполадок

source: If the system no longer boots, BIOS settings may have to be changed to boot from one of the new mirrored drives. Either mirror drive can be used for booting, as they contain identical data.
ko: 시스템이 더 이상 부팅되지 않으면 새 미러 드라이브 중 하나에서 부팅하도록 BIOS 설정을 변경해야 할 수 있습니다. 두 미러 드라이브 모두 동일한 데이터가 포함되어 있으므로 부팅에 사용할 수 있습니다.
ru: Если система больше не загружается, возможно, потребуется изменить настройки BIOS для загрузки с одного из новых зеркалированных дисков. Для загрузки можно использовать любой из зеркальных дисков, так как они содержат идентичные данные.

source: If the boot stops with this message, something is wrong with the mirror device:
ko: 이 메시지와 함께 부팅이 중지되면 미러 장치에 문제가 있는 것입니다:
ru: Если загрузка останавливается с таким сообщением, значит, что-то не так с зеркальным устройством:

source: Forgetting to load the [.filename]#geom_mirror.ko# module in [.filename]#/boot/loader.conf# can cause this problem. To fix it, boot from a FreeBSD installation media and choose `Shell` at the first prompt. Then load the mirror module and mount the mirror device:
ko: [.filename]#/boot/loader.conf#에 [.filename]#geom_mirror.ko# 모듈을 로드하는 것을 잊어버리면 이런 문제가 발생할 수 있습니다. 이 문제를 해결하려면 FreeBSD 설치 미디어에서 부팅하고 첫 번째 프롬프트에서 `Shell`을 선택합니다. 그런 다음 미러 모듈을 로드하고 미러 장치를 마운트합니다:
ru: Проблема может быть вызвана тем, что забыли загрузить модуль [.filename]#geom_mirror.ko# , не добавив его в [.filename]#/boot/loader.conf#. Чтобы исправить её, загрузитесь с установочного носителя FreeBSD и выберите `Shell` при первом запросе. Затем загрузите модуль mirror и смонтируйте зеркальное устройство:

source: Edit [.filename]#/mnt/boot/loader.conf#, adding a line to load the mirror module:
ko: [.filename]#/mnt/boot/loader.conf#를 편집하여 미러 모듈을 로드하도록 내용을 추가합니다:
ru: Отредактируйте файл [.filename]#/mnt/boot/loader.conf#, добавив строку для загрузки модуля mirror:

source: Save the file and reboot.
ko: 파일을 저장하고 재부팅합니다.
ru: Сохраните файл и перезагрузите систему.

source: Other problems that cause `error 19` require more effort to fix. Although the system should boot from [.filename]#ada0#, another prompt to select a shell will appear if [.filename]#/etc/fstab# is incorrect. Enter `ufs:/dev/ada0s1a` at the boot loader prompt and press kbd:[Enter]. Undo the edits in [.filename]#/etc/fstab# then mount the file systems from the original disk ([.filename]#ada0#) instead of the mirror. Reboot the system and try the procedure again.
ko: `error 19`를 유발하는 다른 문제는 수정하는 데 더 많은 노력이 필요합니다. 시스템이 [.filename]#ada0#에서 부팅되어야 하는데 [.filename]#/etc/fstab#이 올바르지 않은 경우 셸을 선택하라는 다른 프롬프트가 나타납니다. 부트로더 프롬프트에 `ufs:/dev/ada0s1a`를 입력하고 kbd:[Enter]를 누릅니다. [.filename]#/etc/fstab#의 편집한 내용을 취소한 다음, 미러가 아닌 원본 디스크([.filename]#ada0#)에서 파일 시스템을 마운트합니다. 시스템을 재부팅하고 절차를 다시 시도합니다.
ru: Другие проблемы, вызывающие `ошибку 19`, требуют больше усилий для исправления. Хотя система должна загружаться с [.filename]#ada0#, появится ещё один запрос на выбор оболочки, если [.filename]#/etc/fstab# указан неверно. Введите `ufs:/dev/ada0s1a` в строке загрузчика и нажмите kbd:[Enter]. Отмените изменения в [.filename]#/etc/fstab#, затем смонтируйте файловые системы с исходного диска ([.filename]#ada0#) вместо зеркала. Перезагрузите систему и повторите процедуру снова.

source: Recovering from Disk Failure
ko: 디스크 장애에서 복구하기
ru: Восстановление после отказа диска

source: The benefit of disk mirroring is that an individual disk can fail without causing the mirror to lose any data. In the above example, if [.filename]#ada0# fails, the mirror will continue to work, providing data from the remaining working drive, [.filename]#ada1#.
ko: 디스크 미러링의 장점은 개별 디스크에 장애가 발생해도 미러 자체의 데이터는 손실되지 않는다는 것입니다. 위의 예에서 [.filename]#ada0#에 장애가 발생해도 미러는 계속 동작하며 나머지 정상 드라이브인 [.filename]#ada1#에서 데이터를 제공합니다.
ru: Преимущество зеркалирования дисков заключается в том, что при отказе одного диска зеркало не теряет данных. В приведённом примере, если [.filename]#ada0# выйдет из строя, зеркало продолжит работать, предоставляя данные с оставшегося рабочего диска [.filename]#ada1#.

source: To replace the failed drive, shut down the system and physically replace the failed drive with a new drive of equal or greater capacity. Manufacturers use somewhat arbitrary values when rating drives in gigabytes, and the only way to really be sure is to compare the total count of sectors shown by `diskinfo -v`. A drive with larger capacity than the mirror will work, although the extra space on the new drive will not be used.
ko: 고장난 드라이브를 교체하려면 시스템을 종료하고 고장난 드라이브를 동일하거나 더 큰 용량의 새 드라이브로 물리적으로 교체합니다. 제조업체는 드라이브를 기가바이트 단위로 평가할 때 다소 자의적인 기준을 사용하므로 실제로 확인하는 유일한 방법은 `diskinfo -v`에 표시된 총 섹터 수를 비교하는 것입니다. 미러보다 용량이 큰 드라이브는 작동하지만 새 드라이브의 남는 공간은 사용되지 않습니다.
ru: Для замены вышедшего из строя диска завершите работу системы и физически замените неисправный диск новым диском равной или большей ёмкости. Производители используют довольно произвольные значения при указании ёмкости дисков в гигабайтах, и единственный способ точно убедиться в этом — сравнить общее количество секторов, отображаемое командой `diskinfo -v`. Диск с большей ёмкостью, чем у зеркала, будет работать, хотя дополнительное пространство на новом диске использоваться не будет.

source: After the computer is powered back up, the mirror will be running in a "degraded" mode with only one drive. The mirror is told to forget drives that are not currently connected:
ko: 컴퓨터의 전원이 다시 켜지면 미러는 하나의 드라이브만 있는 '성능 저하' 모드로 실행됩니다. 미러는 현재 연결되지 않은 드라이브를 무시하도록 지시받습니다:
ru: После перезагрузки компьютера зеркало будет работать в "деградированном" режиме с одним диском. Необходимо указать зеркалу забыть диски, которые в данный момент не подключены:

source: Any old metadata should be cleared from the replacement disk using the instructions in <<geom-mirror-metadata>>. Then the replacement disk, [.filename]#ada4# for this example, is inserted into the mirror:
ko: <<geom-mirror-metadata>>의 지침에 따라 교체 디스크에서 이전 메타데이터를 모두 지워야 합니다. 그런 다음 대체 디스크(이 예에서는 [.filename]#ada4#)를 미러에 삽입합니다:

source: Resynchronization begins when the new drive is inserted into the mirror. This process of copying mirror data to a new drive can take a while. Performance of the mirror will be greatly reduced during the copy, so inserting new drives is best done when there is low demand on the computer.
ko: 새 드라이브를 미러에 삽입하면 재동기화가 시작됩니다. 미러 데이터를 새 드라이브에 복사하는 이 과정은 시간이 오래 걸릴 수 있습니다. 복사하는 동안 미러의 성능이 크게 저하되므로 새 드라이브를 삽입하는 것은 컴퓨터의 부하가 적을 때 하는 것이 가장 좋습니다.
ru: Синхронизация начинается при установке нового диска в зеркало. Этот процесс копирования данных зеркала на новый диск может занять некоторое время. Производительность зеркала значительно снизится во время копирования, поэтому добавление новых дисков лучше выполнять при низкой нагрузке на компьютер.

source: Progress can be monitored with `gmirror status`, which shows drives that are being synchronized and the percentage of completion. During resynchronization, the status will be `DEGRADED`, changing to `COMPLETE` when the process is finished.
ko: 동기화 중인 드라이브와 완료 비율을 표시하는 `gmirror status`로 진행 상황을 모니터링할 수 있습니다. 재동기화 중에 상태는 `DEGRADED`으로 표시되며, 프로세스가 완료되면 `COMPLETE`로 변경됩니다.
ru: Ход выполнения можно отслеживать с помощью `gmirror status`, который показывает диски, находящиеся в процессе синхронизации, и процент завершения. Во время повторной синхронизации статус будет `DEGRADED`, а по завершении процесса изменится на `COMPLETE`.

source: RAID3 - Byte-level Striping with Dedicated Parity
ko: RAID3 - 전용 패리티를 사용한 바이트 레벨 스트라이핑
ru: RAID3 - чередование на уровне байтов с выделенной четностью
