Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/geom/_index.po
Languages: ko, ru

source: This will load the module and create a [.filename]#/dev/da4.journal# device node on [.filename]#/dev/da4#.
ko: 이렇게 하면 모듈이 로드되고 [.filename]#/dev/da4#에 [.filename]#/dev/da4.journal# 장치 노드가 생성됩니다.
ru: Это загрузит модуль и создаст узел устройства [.filename]#/dev/da4.journal# на [.filename]#/dev/da4#.

source: A UFS file system may now be created on the journaled device, then mounted on an existing mount point:
ko: 이제 저널링된 장치에 UFS 파일 시스템을 생성한 다음 기존 마운트 지점에 마운트할 수 있습니다:
ru: Файловая система UFS теперь может быть создана на журналируемом устройстве, а затем смонтирована в существующей точке монтирования:

source: In the case of several slices, a journal will be created for each individual slice. For instance, if [.filename]#ad4s1# and [.filename]#ad4s2# are both slices, then `gjournal` will create [.filename]#ad4s1.journal# and [.filename]#ad4s2.journal#.
ko: 여러 개의 슬라이스가 있는 경우 각 개별 슬라이스에 대해 저널이 생성됩니다. 예를 들어, [.filename]#ad4s1#과 [.filename]#ad4s2#가 모두 슬라이스인 경우, `gjournal`은 [.filename]#ad4s1.journal#과 [.filename]#ad4s2.journal#을 생성합니다.
ru: В случае нескольких разделов журнал будет создан для каждого отдельного раздела. Например, если [.filename]#ad4s1# и [.filename]#ad4s2# являются разделами, то `gjournal` создаст [.filename]#ad4s1.journal# и [.filename]#ad4s2.journal#.

source: Journaling may also be enabled on current file systems by using `tunefs`. However, _always_ make a backup before attempting to alter an existing file system. In most cases, `gjournal` will fail if it is unable to create the journal, but this does not protect against data loss incurred as a result of misusing `tunefs`. Refer to man:gjournal[8] and man:tunefs[8] for more information about these commands.
ko: `tunefs`를 사용해 현재 파일 시스템에서도 저널링을 활성화할 수 있습니다. 그러나 기존 파일 시스템을 변경하기 전에 항상 백업을 만드세요. 대부분의 경우 `gjournal`은 저널을 만들 수 없으면 실패하지만, `tunefs`를 잘못 사용하여 발생하는 데이터 손실을 방지하지는 못합니다. 이 명령에 대한 자세한 내용은 man:gjournal[8] 및 man:tunefs[8]를 참조하십시오.
ru: Журналирование также можно включить на существующих файловых системах с помощью `tunefs`. Однако _всегда_ делайте резервную копию перед изменением существующей файловой системы. В большинстве случаев `gjournal` завершится с ошибкой, если не сможет создать журнал, но это не защищает от потери данных из-за неправильного использования `tunefs`. Дополнительную информацию об этих командах можно найти в man:gjournal[8] и man:tunefs[8].

source: It is possible to journal the boot disk of a FreeBSD system. Refer to the article extref:{gjournal-desktop}[Implementing UFS Journaling on a Desktop PC] for detailed instructions.
ko: FreeBSD 시스템의 부팅 디스크를 저널링할 수 있습니다. 자세한 지침은 extref:{gjournal-desktop}[데스크톱 PC에서 UFS 저널링 구현하기] 문서를 참조하세요.
ru: Возможно журналирование загрузочного диска в системе FreeBSD. Подробные инструкции приведены в статье extref:{gjournal-desktop}[Реализация журналирования UFS на настольном ПК].

source: Chapter 21. GEOM: Modular Disk Transformation Framework
ru: Глава 21. GEOM: Модульная инфраструктура трансформации дискового пространства

source: See crossref:geom[gmirror-troubleshooting, Troubleshooting] if there are problems booting. Powering down and disconnecting the original [.filename]#ada0# disk will allow it to be kept as an offline backup.
ru: См. crossref:geom[gmirror-troubleshooting, Устранение неполадок], если возникли проблемы с загрузкой. Отключение питания и извлечение исходного диска [.filename]#ada0# позволит сохранить его в качестве автономной резервной копии.

source: Create a mirror on the new disk. To make certain that the mirror capacity is not any larger than the original [.filename]#ada0# drive, man:gnop[8] is used to create a fake drive of the same size. This drive does not store any data, but is used only to limit the size of the mirror. When man:gmirror[8] creates the mirror, it will restrict the capacity to the size of [.filename]#gzero.nop#, even if the new [.filename]#ada1# drive has more space. Note that the _1000204821504_ in the second line is equal to [.filename]#ada0#'s media size as shown by `diskinfo` above.
ru: Создайте зеркало на новом диске. Чтобы убедиться, что объем зеркала не превышает объем исходного диска [.filename]#ada0#, используется man:gnop[8] для создания виртуального диска того же размера. Этот диск не хранит данных, а служит только для ограничения размера зеркала. Когда man:gmirror[8] создает зеркало, он ограничит объем до размера [.filename]#gzero.nop#, даже если новый диск [.filename]#ada1# имеет больше места. Обратите внимание, что число _1000204821504_ во второй строке соответствует размеру носителя [.filename]#ada0#, показанному командой `diskinfo` выше.

source: Restart the system, booting from [.filename]#ada1#. If everything is working, the system will boot from [.filename]#mirror/gm0#, which now contains the same data as [.filename]#ada0# had previously. See crossref:geom[gmirror-troubleshooting, Troubleshooting] if there are problems booting.
ru: Перезагрузите систему, загрузившись с [.filename]#ada1#. Если всё работает правильно, система загрузится с [.filename]#mirror/gm0#, который теперь содержит те же данные, что ранее были на [.filename]#ada0#. Обратитесь к разделу crossref:geom[gmirror-troubleshooting, Устранение неполадок], если возникли проблемы с загрузкой.

source: Any old metadata should be cleared from the replacement disk using the instructions in crossref:geom[geom-mirror-metadata, Metadata Issues]. Then the replacement disk, [.filename]#ada4# for this example, is inserted into the mirror:
ru: Любые старые метаданные должны быть удалены с заменяемого диска, следуя инструкциям в crossref:geom[geom-mirror-metadata, Проблемы с метаданными]. Затем заменяющий диск, [.filename]#ada4# в данном примере, добавляется в зеркало:
