Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/geom/_index.po
Languages: ko, ru

source: In FreeBSD, the GEOM framework permits access and control to classes, such as Master Boot Records and BSD labels, through the use of providers, or the disk devices in /dev.
ko: FreeBSD에서 GEOM 프레임워크는 공급자 또는 /dev의 디스크 장치를 사용하여 마스터 부트 레코드 및 BSD 레이블과 같은 클래스에 대한 액세스 및 제어를 허용합니다.
ru: В FreeBSD инфраструктура GEOM предоставляет доступ и управление классами, такими как главная загрузочная запись (MBR) и метки BSD, через использование провайдеров или устройств дисков в `/dev`.

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 20. GEOM: Modular Disk Transformation Framework
ko: 20장. GEOM: 모듈식 디스크 변환 프레임워크

source: GEOM: Modular Disk Transformation Framework
ko: GEOM: 모듈식 디스크 변환 프레임워크
ru: GEOM: Модульная инфраструктура трансформации дискового пространства

source: Synopsis
ko: 요약
ru: Обзор

source: In FreeBSD, the GEOM framework permits access and control to classes, such as Master Boot Records and BSD labels, through the use of providers, or the disk devices in [.filename]#/dev#. By supporting various software RAID configurations, GEOM transparently provides access to the operating system and operating system utilities.
ko: FreeBSD에서 GEOM 프레임워크는 공급자 또는 [.filename]#/dev#의 디스크 장치를 사용하여 마스터 부트 레코드 및 BSD 레이블과 같은 클래스에 대한 액세스 및 제어를 허용합니다. 다양한 소프트웨어 RAID 구성을 지원함으로써 GEOM은 운영 체제 및 운영 체제 유틸리티에 대한 액세스를 투명하게 제공합니다.
ru: В FreeBSD система GEOM обеспечивает доступ и управление классами, такими как главная загрузочная запись (MBR) и метки BSD, через использование провайдеров или дисковых устройств в [.filename]#/dev#. Поддерживая различные конфигурации программного RAID, GEOM прозрачно предоставляет доступ операционной системе и системным утилитам.

source: This chapter covers the use of disks under the GEOM framework in FreeBSD. This includes the major RAID control utilities which use the framework for configuration. This chapter is not a definitive guide to RAID configurations and only GEOM-supported RAID classifications are discussed.
ko: 이 장에서는 FreeBSD의 GEOM 프레임워크에서 디스크를 사용하는 방법을 다룹니다. 여기에는 구성을 위해 프레임워크를 사용하는 주요 RAID 제어 유틸리티가 포함됩니다. 이 장은 RAID 구성에 대한 결정적인 가이드가 아니며 GEOM 지원 RAID 분류에 대해서만 설명합니다.
ru: В этой главе рассматривается использование дисков в рамках системы GEOM в FreeBSD. Это включает основные утилиты управления RAID, которые используют данную систему для настройки. Данная глава не является исчерпывающим руководством по конфигурациям RAID и рассматривает только поддерживаемые GEOM классификации RAID.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: What type of RAID support is available through GEOM.
ko: GEOM을 통해 사용할 수 있는 RAID 지원 유형.
ru: Какой тип поддержки RAID доступен через GEOM.

source: How to use the base utilities to configure, maintain, and manipulate the various RAID levels.
ko: 기본 유틸리티를 사용하여 다양한 RAID 레벨을 구성, 유지 및 조작하는 방법.
ru: Как использовать базовые утилиты для настройки, обслуживания и управления различными уровнями RAID.

source: How to mirror, stripe, encrypt, and remotely connect disk devices through GEOM.
ko: GEOM을 통해 디스크 장치를 미러링, 스트라이프, 암호화 및 원격으로 연결하는 방법.
ru: Как зеркалировать, чередовать, шифровать и удалённо подключать дисковые устройства с помощью GEOM.

source: How to troubleshoot disks attached to the GEOM framework.
ko: GEOM 프레임워크에 연결된 디스크 문제를 해결하는 방법.
ru: Как устранять неполадки с дисками, подключенными к системе GEOM.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Understand how FreeBSD treats disk devices (crossref:disks[disks,Storage]).
ko: FreeBSD가 디스크 장치를 처리하는 방식을 이해합니다(crossref:disks[disks,Storage]).
ru: Понимание того, как FreeBSD работает с дисковыми устройствами (crossref:disks[disks,Хранение данных]).

source: Know how to configure and install a new kernel (crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]).
ko: 새 커널을 구성하고 설치하는 방법을 알고 있습니다(crossref:kernelconfig[kernelconfig,FreeBSD 커널 구성]).
ru: Знать, как настроить и установить новый ядро (crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]).

source: Striping combines several disk drives into a single volume. Striping can be performed through the use of hardware RAID controllers. The GEOM disk subsystem provides software support for disk striping, also known as RAID0, without the need for a RAID disk controller.
ko: 스트라이핑은 여러 디스크 드라이브를 단일 볼륨으로 결합합니다. 스트라이핑은 하드웨어 RAID 컨트롤러를 사용하여 수행할 수 있습니다. GEOM 디스크 하위 시스템은 RAID 디스크 컨트롤러 없이 RAID0이라고도 하는 디스크 스트라이핑에 대한 소프트웨어 지원을 제공합니다.
ru: Чередование объединяет несколько дисков в один том. Чередование может быть выполнено с использованием аппаратных RAID-контроллеров. Подсистема GEOM предоставляет программную поддержку чередования дисков, также известного как RAID0, без необходимости в RAID-контроллере.

source: In RAID0, data is split into blocks that are written across all the drives in the array. As seen in the following illustration, instead of having to wait on the system to write 256k to one disk, RAID0 can simultaneously write 64k to each of the four disks in the array, offering superior I/O performance. This performance can be enhanced further by using multiple disk controllers.
ko: RAID0에서 데이터는 어레이의 모든 드라이브에 기록되는 블록으로 분할됩니다. 다음 그림에서 볼 수 있듯이 RAID0은 하나의 디스크에 256k를 쓰기 위해 시스템을 기다릴 필요 없이 어레이에 있는 4개의 디스크 각각에 동시에 64k를 쓸 수 있어 뛰어난 I/O 성능을 제공합니다. 이 성능은 여러 디스크 컨트롤러를 사용하여 더욱 향상될 수 있습니다.
ru: В RAID0 данные разбиваются на блоки, которые записываются на все диски массива. Как показано на следующей иллюстрации, вместо ожидания записи 256 КБ на один диск, RAID0 может одновременно записать по 64 КБ на каждый из четырех дисков массива, обеспечивая высокую производительность ввода-вывода. Эту производительность можно дополнительно повысить, используя несколько контроллеров дисков.

source: Disk Striping Illustration
ko: 디스크 스트라이핑 그림
ru: Иллюстрация чередования дисков

source: Each disk in a RAID0 stripe must be of the same size, since I/O requests are interleaved to read or write to multiple disks in parallel.
ko: I/O 요청이 여러 디스크를 병렬로 읽거나 쓰기 위해 인터리브되므로 RAID0 스트라이프의 각 디스크는 크기가 같아야 합니다.
ru: Каждый диск в дисковой последовательности RAID0 должен быть одинакового размера, поскольку запросы ввода-вывода чередуются для чтения или записи на несколько дисков параллельно.

source: RAID0 does _not_ provide any redundancy. This means that if one disk in the array fails, all of the data on the disks is lost. If the data is important, implement a backup strategy that regularly saves backups to a remote system or device.
ko: RAID0은 _중복성을 제공하지 않습니다_. 즉, 어레이의 디스크 하나에 오류가 발생하면 디스크의 모든 데이터가 손실됩니다. 데이터가 중요한 경우 원격 시스템이나 장치에 정기적으로 백업을 저장하는 백업 전략을 구현하십시오.
ru: RAID0 _не_ обеспечивает избыточности. Это означает, что если один диск в массиве выйдет из строя, все данные на дисках будут потеряны. Если данные важны, реализуйте стратегию резервного копирования, которая регулярно сохраняет резервные копии на удалённую систему или устройство.

source: The process for creating a software, GEOM-based RAID0 on a FreeBSD system using commodity disks is as follows. Once the stripe is created, refer to man:gstripe[8] for more information on how to control an existing stripe.
ko: 상용 디스크를 사용하여 FreeBSD 시스템에서 소프트웨어, GEOM 기반 RAID0을 생성하는 프로세스는 다음과 같습니다. 스트라이프가 생성되면 기존 스트라이프를 제어하는 방법에 대한 자세한 내용은 man:gstripe[8]를 참조하십시오.
ru: Процесс создания программного RAID0 на основе GEOM в системе FreeBSD с использованием обычных дисков выглядит следующим образом. После создания дисковой последовательности обратитесь к man:gstripe[8] для получения дополнительной информации о том, как управлять существующей дисковой последовательностью.

source: *Procedure: Creating a Stripe of Unformatted ATA Disks*
ko: *절차: 포맷되지 않은 ATA 디스크 스트라이프 만들기*
ru: *Процедура: Создание последовательности неформатированных ATA-дисков*

source: Load the [.filename]#geom_stripe.ko# module:
ko: [.filename]#geom_stripe.ko# module을 로드합니다:
ru: Загрузите модуль [.filename]#geom_stripe.ko#:

source: Ensure that a suitable mount point exists. If this volume will become a root partition, then temporarily use another mount point such as [.filename]#/mnt#.
ko: 적합한 마운트 지점이 있는지 확인하십시오. 이 볼륨이 루트 파티션이 될 경우 임시로 [.filename]#/mnt#와 같은 다른 마운트 지점을 사용하십시오.
ru: Убедитесь, что существует подходящая точка монтирования. Если этот том будет использоваться как корневой раздел, временно используйте другую точку монтирования, например, [.filename]#/mnt#.

source: Determine the device names for the disks which will be striped, and create the new stripe device. For example, to stripe two unused and unpartitioned ATA disks with device names of [.filename]#/dev/ad2# and [.filename]#/dev/ad3#:
ko: 스트라이핑할 디스크의 장치 이름을 결정하고 새 스트라이프 장치를 만듭니다. 예를 들어, 사용하지 않고 파티션 되지 않은 두 개의 ATA 디스크를 [.filename]#/dev/ad2# 및 [.filename]#/dev/ad3#의 장치 이름으로 스트라이핑합니다:
ru: Определите имена устройств для дисков, которые будут объединены в дисковую последовательность, и создайте новое устройство для последовательности. Например, для объединения в последовательность двух неиспользуемых и неразмеченных ATA-дисков с именами устройств [.filename]#/dev/ad2# и [.filename]#/dev/ad3#:

source: Write a standard label, also known as a partition table, on the new volume and install the default bootstrap code:
ko: 새 볼륨에 표준 레이블(파티션 테이블이라고도 함)을 작성하고 기본 부트스트랩 코드를 설치합니다:
ru: Запишите стандартную метку, также известную как таблица разделов, на новый том и установите код начальной загрузки по умолчанию:

source: This process should create two other devices in [.filename]#/dev/stripe# in addition to [.filename]#st0#. Those include [.filename]#st0a# and [.filename]#st0c#. At this point, a UFS file system can be created on [.filename]#st0a# using `newfs`:
ko: 이 프로세스는 [.filename]#/dev/stripe#에 [.filename]#st0# 외에 두 개의 다른 장치를 생성해야 합니다. 여기에는 [.filename]#st0a# 및 [.filename]#st0c#가 포함됩니다. 이 시점에서 `newfs`를 사용하여 [.filename]#st0a#에 UFS 파일 시스템을 생성할 수 있습니다:
ru: Этот процесс должен создать два дополнительных устройства в [.filename]#/dev/stripe# помимо [.filename]#st0# — [.filename]#st0a# и [.filename]#st0c#. На этом этапе можно создать файловую систему UFS на [.filename]#st0a# с помощью команды `newfs`:

source: Many numbers will glide across the screen, and after a few seconds, the process will be complete. The volume has been created and is ready to be mounted.
ko: 많은 숫자가 화면을 가로지르며 미끄러지듯 지나가고 몇 초 후 프로세스가 완료됩니다. 볼륨이 생성되었으며 마운트할 준비가 되었습니다.
ru: По экрану пройдёт множество чисел, и через несколько секунд процесс завершится. Том создан и готов к монтированию.

source: To manually mount the created disk stripe:
ko: 생성된 디스크 스트라이프를 수동으로 마운트하려면:
ru: Чтобы вручную смонтировать созданную дисковую последовательность:

source: To mount this striped file system automatically during the boot process, place the volume information in [.filename]#/etc/fstab#. In this example, a permanent mount point, named [.filename]#stripe#, is created:
ko: 부팅 프로세스 중에 이 스트라이프 파일 시스템을 자동으로 마운트하려면 볼륨 정보를 [.filename]#/etc/fstab#에 작성합니다. 이 예제에서는 [.filename]#stripe#라는 이름의 영구 마운트 지점이 생성됩니다:
ru: Для автоматического монтирования этой чередующейся файловой системы во время загрузки добавьте информацию о томе в [.filename]#/etc/fstab#. В этом примере создается постоянная точка монтирования с именем [.filename]#stripe#:

source: The [.filename]#geom_stripe.ko# module must also be automatically loaded during system initialization, by adding a line to [.filename]#/boot/loader.conf#:
ko: 또한 시스템 초기화 중에 [.filename]#/boot/loader.conf#에 한 줄을 추가하여 [.filename]#geom_stripe.ko# 모듈을 자동으로 로드해야 합니다:
ru: Модуль [.filename]#geom_stripe.ko# также должен автоматически загружаться при инициализации системы, добавив строку в [.filename]#/boot/loader.conf#:

source: RAID1 - Mirroring
ko: RAID1 - 미러링
ru: RAID1 - Зеркалирование

source: RAID1, or _mirroring_, is the technique of writing the same data to more than one disk drive. Mirrors are usually used to guard against data loss due to drive failure. Each drive in a mirror contains an identical copy of the data. When an individual drive fails, the mirror continues to work, providing data from the drives that are still functioning. The computer keeps running, and the administrator has time to replace the failed drive without user interruption.
ko: RAID1 또는 _미러링_은 둘 이상의 디스크 드라이브에 동일한 데이터를 쓰는 기술입니다. 미러는 일반적으로 드라이브 장애로 인한 데이터 손실을 방지하는 데 사용됩니다. 미러의 각 드라이브에는 동일한 데이터 사본이 들어 있습니다. 개별 드라이브에 장애가 발생해도 미러는 계속 작동하며 정상 작동 중인 드라이브에서 데이터를 제공할 수 있습니다. 컴퓨터는 계속 실행되고 관리자는 시스템의 중단 없이 장애가 발생한 드라이브를 교체할 수 있는 시간을 확보할 수 있습니다.
ru: RAID1, или _зеркалирование_, — это техника записи одних и тех же данных на несколько дисковых накопителей. Зеркала обычно используются для защиты от потери данных из-за выхода диска из строя. Каждый диск в зеркале содержит идентичную копию данных. При отказе одного из дисков зеркало продолжает работать, предоставляя данные с оставшихся исправных дисков. Компьютер продолжает функционировать, а администратор имеет возможность заменить вышедший из строя диск без прерывания работы пользователей.

source: Two common situations are illustrated in these examples. The first creates a mirror out of two new drives and uses it as a replacement for an existing single drive. The second example creates a mirror on a single new drive, copies the old drive's data to it, then inserts the old drive into the mirror. While this procedure is slightly more complicated, it only requires one new drive.
ko: 이 예에서는 두 가지 일반적인 상황을 설명합니다. 첫 번째는 두 개의 새 드라이브에서 미러를 생성하여 기존 단일 드라이브를 대체하는 데 사용합니다. 두 번째 예는 새 드라이브 하나에 미러를 생성하고 이전 드라이브의 데이터를 미러에 복사한 다음 이전 드라이브를 미러에 삽입하는 것입니다. 이 절차는 약간 더 복잡하지만 새 드라이브가 하나만 필요합니다.
ru: В этих примерах показаны две распространённые ситуации. Первый пример создаёт зеркало из двух новых дисков и использует его для замены существующего одиночного диска. Второй пример создаёт зеркало на одном новом диске, копирует на него данные со старого диска, а затем добавляет старый диск в зеркало. Хотя эта процедура немного сложнее, она требует только одного нового диска.

source: Traditionally, the two drives in a mirror are identical in model and capacity, but man:gmirror[8] does not require that. Mirrors created with dissimilar drives will have a capacity equal to that of the smallest drive in the mirror. Extra space on larger drives will be unused. Drives inserted into the mirror later must have at least as much capacity as the smallest drive already in the mirror.
ko: 일반적으로 미러의 두 드라이브는 모델과 용량이 동일해야 하지만, man:gmirror[8]는 그럴 필요가 없습니다. 서로 다른 드라이브로 미러를 만들면 미러에서 가장 작은 드라이브의 용량과 동일한 용량을 갖게 됩니다. 더 큰 드라이브의 추가 공간은 사용되지 않습니다. 나중에 미러에 추가되는 드라이브는 미러에 이미 있는 가장 작은 드라이브만큼의 용량을 가져야 합니다.
ru: Традиционно два диска в зеркале имеют одинаковую модель и объем, но man:gmirror[8] не требует этого. Зеркала, созданные с разными дисками, будут иметь объем, равный объему наименьшего диска в зеркале. Дополнительное место на более крупных дисках останется неиспользуемым. Диски, добавляемые в зеркало позже, должны иметь объем не меньше, чем у наименьшего диска, уже находящегося в зеркале.

source: The mirroring procedures shown here are non-destructive, but as with any major disk operation, make a full backup first.
ko: 여기에 표시된 미러링 절차는 비파괴적이지만 모든 주요 디스크 작업과 마찬가지로 먼저 전체 백업을 만드세요.
ru: Приведённые здесь процедуры зеркалирования являются неразрушающими, но, как и при любых операциях с дисками, сначала создайте полную резервную копию.

source: While man:dump[8] is used in these procedures to copy file systems, it does not work on file systems with soft updates journaling. See man:tunefs[8] for information on detecting and disabling soft updates journaling.
ko: 이 절차에서 man:dump[8]는 파일 시스템을 복사하는 데 사용되지만, 소프트 업데이트 저널링이 있는 파일 시스템에서는 작동하지 않습니다. 소프트 업데이트 저널링을 감지하고 비활성화하는 방법에 대한 자세한 내용은 man:tunefs[8]을 참조하십시오.
ru: В этих процедурах используется man:dump[8] для копирования файловых систем, однако он не работает с файловыми системами, использующими журналирование мягких обновлений. Информацию о том, как обнаружить и отключить журналирование мягких обновлений, смотрите в man:tunefs[8].

source: Metadata Issues
ko: 메타데이터 문제
ru: Проблемы с метаданными

source: Many disk systems store metadata at the end of each disk. Old metadata should be erased before reusing the disk for a mirror. Most problems are caused by two particular types of leftover metadata: GPT partition tables and old metadata from a previous mirror.
ko: 대부분의 디스크 시스템은 각 디스크의 끝에 메타데이터를 저장합니다. 미러용으로 디스크를 재사용하기 전에 오래된 메타데이터를 지워야 합니다. 대부분의 문제는 두 가지 특정 유형의 남은 메타데이터로 인해 발생합니다: GPT 파티션 테이블과 이전 미러의 오래된 메타데이터입니다.
ru: Многие дисковые системы хранят метаданные в конце каждого диска. Старые метаданные следует стереть перед повторным использованием диска для зеркала. Большинство проблем вызвано двумя конкретными типами оставшихся метаданных: таблицами разделов GPT и старыми метаданными от предыдущего зеркала.

source: GPT metadata can be erased with man:gpart[8]. This example erases both primary and backup GPT partition tables from disk [.filename]#ada8#:
ko: GPT 메타데이터는 man:gpart[8]로 지울 수 있습니다. 이 예는 디스크 [.filename]#ada8#에서 기본 및 백업 GPT 파티션 테이블을 모두 지웁니다:
ru: Метаданные GPT можно удалить с помощью man:gpart[8]. В этом примере удаляются как основная, так и резервная таблицы разделов GPT с диска [.filename]#ada8#:

source: A disk can be removed from an active mirror and the metadata erased in one step using man:gmirror[8]. Here, the example disk [.filename]#ada8# is removed from the active mirror [.filename]#gm4#:
ko: man:gmirror[8]를 사용하여 활성 미러에서 디스크를 제거하고 메타데이터를 한 번에 지울 수 있습니다. 여기서는 예제 디스크 [.filename]#ada8#이 활성 미러 [.filename]#gm4#에서 제거됩니다:
ru: Диск может быть удален из активного зеркала, а его метаданные стерты за один шаг с помощью man:gmirror[8]. В этом примере диск [.filename]#ada8# удаляется из активного зеркала [.filename]#gm4#:

source: If the mirror is not running, but old mirror metadata is still on the disk, use `gmirror clear` to remove it:
ko: 미러가 실행되고 있지 않지만 이전 미러 메타데이터가 여전히 디스크에 남아 있는 경우, `gmirror clear`를 사용하여 제거합니다:
ru: Если зеркало не запущено, но старые метаданные зеркала остались на диске, используйте `gmirror clear` для их удаления:

source: man:gmirror[8] stores one block of metadata at the end of the disk. As GPT partition schemes also store metadata at the end of the disk, mirroring entire GPT disks with man:gmirror[8] is not recommended. MBR partitioning is used here because it only stores a partition table at the start of the disk and does not conflict with the mirror metadata.
ko: man:gmirror[8]은 디스크 끝에 하나의 메타데이터 블록을 저장합니다. GPT 파티션 스키마도 디스크 끝에 메타데이터를 저장하므로 man:gmirror[8]로 전체 GPT 디스크를 미러링하는 것은 권장되지 않습니다. MBR 파티션은 디스크 시작 부분에만 파티션 테이블을 저장하고 미러 메타데이터와 충돌하지 않기 때문에 여기에 사용됩니다.
ru: man:gmirror[8] хранит один блок метаданных в конце диска. Поскольку схемы разделов GPT также хранят метаданные в конце диска, зеркалирование целых GPT-дисков с помощью man:gmirror[8] не рекомендуется. Здесь используется разделение MBR, так как оно хранит таблицу разделов только в начале диска и не конфликтует с метаданными зеркала.

source: Creating a Mirror with Two New Disks
ko: 두 개의 새 디스크로 미러 만들기
ru: Создание зеркала с двумя новыми дисками

source: In this example, FreeBSD has already been installed on a single disk, [.filename]#ada0#. Two new disks, [.filename]#ada1# and [.filename]#ada2#, have been connected to the system. A new mirror will be created on these two disks and used to replace the old single disk.
ko: 이 예제에서는 FreeBSD가 이미 단일 디스크인 [.filename]#ada0#에 설치되어 있습니다. 두 개의 새 디스크인 [.filename]#ada1# 및 [.filename]#ada2#가 시스템에 연결되었습니다. 이 두 디스크에 새 미러가 생성되어 이전 단일 디스크를 대체하는 데 사용됩니다.
ru: В этом примере FreeBSD уже установлена на одном диске [.filename]#ada0#. К системе подключены два новых диска — [.filename]#ada1# и [.filename]#ada2#. На этих дисках будет создано новое зеркало, которое заменит старый одиночный диск.

source: The [.filename]#geom_mirror.ko# kernel module must either be built into the kernel or loaded at boot- or run-time. Manually load the kernel module now:
ko: [.filename]#geom_mirror.ko# 커널 모듈은 커널에 빌드되거나 부팅 또는 런타임에 로드되어야 합니다. 지금 커널 모듈을 수동으로 로드하세요:
ru: Модуль ядра [.filename]#geom_mirror.ko# должен быть либо встроен в ядро, либо загружен при загрузке или во время работы. Вручную загрузите модуль ядра сейчас:

source: Create the mirror with the two new drives:
ko: 두 개의 새 드라이브로 미러를 만듭니다:
ru: Создайте зеркало с двумя новыми дисками:

source: [.filename]#gm0# is a user-chosen device name assigned to the new mirror. After the mirror has been started, this device name appears in [.filename]#/dev/mirror/#.
ko: [.filename]#gm0#은 새 미러에 할당된 사용자가 선택한 장치 이름입니다. 미러가 시작되면 이 장치 이름은 [.filename]#/dev/mirror/#에 표시됩니다.
ru: [.filename]#gm0# — это выбранное пользователем имя устройства, назначенное новому зеркалу. После запуска зеркала это имя устройства появляется в [.filename]#/dev/mirror/#.

source: MBR and bsdlabel partition tables can now be created on the mirror with man:gpart[8]. This example uses a traditional file system layout, with partitions for [.filename]#/#, swap, [.filename]#/var#, [.filename]#/tmp#, and [.filename]#/usr#. A single [.filename]#/# and a swap partition will also work.
ko: 이제 man:gpart[8]를 사용하여 미러에 MBR 및 bsdlabel 파티션 테이블을 생성할 수 있습니다. 이 예제에서는 [.filename]#/#, 스왑, [.filename]#/var#, [.filename]#/tmp#, [.filename]#/usr#에 대한 파티션이 있는 기존 파일 시스템 레이아웃을 사용합니다. 단일 [.filename]#/# 및 스왑 파티션도 작동합니다.
ru: Теперь таблицы разделов MBR и bsdlabel можно создавать на зеркале с помощью man:gpart[8]. В этом примере используется традиционная структура файловой системы с разделами для [.filename]#/#, swap, [.filename]#/var#, [.filename]#/tmp# и [.filename]#/usr#. Также подойдёт одиночный раздел [.filename]#/# и раздел подкачки.

source: Partitions on the mirror do not have to be the same size as those on the existing disk, but they must be large enough to hold all the data already present on [.filename]#ada0#.
ko: 미러의 파티션은 기존 디스크의 파티션과 크기가 같을 필요는 없지만 [.filename]#ada0#에 이미 있는 모든 데이터를 저장할 수 있을 만큼 충분히 커야 합니다.
ru: Разделы на зеркале не обязательно должны быть такого же размера, как и на существующем диске, но они должны быть достаточно большими, чтобы вместить все данные, уже находящиеся на [.filename]#ada0#.

source: Make the mirror bootable by installing bootcode in the MBR and bsdlabel and setting the active slice:
ko: 미러를 부팅할 수 있게 하려면 부트코드를 MBR과 bsdlabel에 설치하고 활성 슬라이스를 설정합니다:
ru: Сделайте зеркало загружаемым, установив загрузочный код в MBR и bsdlabel, а также настроив активный раздел:

source: Format the file systems on the new mirror, enabling soft-updates.
ko: 새 미러에서 파일 시스템을 포맷하여 소프트 업데이트를 활성화합니다.
ru: Отформатируйте файловые системы на новом зеркале, включив мягкие обновления.

source: File systems from the original [.filename]#ada0# disk can now be copied onto the mirror with man:dump[8] and man:restore[8].
ko: 이제 man:dump[8] 및 man:restore[8]을 사용하여 원본 [.filename]#ada0# 디스크의 파일 시스템을 미러에 복사할 수 있습니다.
ru: Файловые системы с исходного диска [.filename]#ada0# теперь можно скопировать на зеркало с помощью man:dump[8] и man:restore[8].

source: Edit [.filename]#/mnt/etc/fstab# to point to the new mirror file systems:
ko: 새 미러 파일 시스템을 가리키도록 [.filename]#/mnt/etc/fstab#을 편집합니다:
ru: Отредактируйте файл [.filename]#/mnt/etc/fstab#, чтобы он указывал на файловые системы нового зеркала:

source: If the [.filename]#geom_mirror.ko# kernel module has not been built into the kernel, [.filename]#/mnt/boot/loader.conf# is edited to load the module at boot:
ko: 커널 모듈이 커널에 빌드되지 않은 경우 [.filename]#geom_mirror.ko# 커널 모듈이 부팅 시 모듈을 로드하도록 [.filename]#/mnt/boot/loader.conf#를 편집합니다:
ru: Если модуль ядра [.filename]#geom_mirror.ko# не встроен в ядро, файл [.filename]#/mnt/boot/loader.conf# редактируется для загрузки модуля при старте системы:
