Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/geom/_index.po
Languages: ko, ru

source: Reboot and verify data, restoring from backup if necessary. After the metadata has been removed, the `kern.geom.raid.enable=0` entry in [.filename]#/boot/loader.conf# can also be removed.
ko: 재부팅하고 데이터를 확인하며 필요한 경우 백업에서 복원합니다. 메타데이터를 제거한 후 [.filename]#/boot/loader.conf#의 `kern.geom.raid.enable=0` 항목도 제거할 수 있습니다.
ru: Перезагрузите систему и проверьте данные, восстановив их из резервной копии при необходимости. После удаления метаданных запись `kern.geom.raid.enable=0` в файле [.filename]#/boot/loader.conf# также можно удалить.

source: GEOM Gate Network
ko: GEOM 게이트 네트워크
ru: Сетевые устройства GEOM Gate

source: GEOM provides a simple mechanism for providing remote access to devices such as disks, CDs, and file systems through the use of the GEOM Gate network daemon, ggated. The system with the device runs the server daemon which handles requests made by clients using ggatec. The devices should not contain any sensitive data as the connection between the client and the server is not encrypted.
ko: GEOM은 디스크, CD, 파일 시스템과 같은 장치에 원격 액세스를 제공하기 위한 간단한 메커니즘을 제공하는데, 이 메커니즘은 GEOM 게이트 네트워크 데몬인 ggated를 사용합니다. 장치가 있는 시스템은 서버 데몬을 실행하며, 이 서버 데몬은 ggatec를 사용하여 클라이언트의 요청을 처리합니다. 클라이언트와 서버 간의 연결이 암호화되지 않으므로 장치에 민감한 데이터가 포함되어서는 안 됩니다.
ru: GEOM предоставляет простой механизм для удаленного доступа к устройствам, таким как диски, компакт-диски и файловые системы, с использованием сетевого демона GEOM Gate - ggated. Система с устройством запускает серверный демон, который обрабатывает запросы от клиентов, использующих ggatec. Устройства не должны содержать конфиденциальных данных, так как соединение между клиентом и сервером не шифруется.

source: Similar to NFS, which is discussed in crossref:network-servers[network-nfs,"Network File System (NFS)"], ggated is configured using an exports file. This file specifies which systems are permitted to access the exported resources and what level of access they are offered. For example, to give the client `192.168.1.5` read and write access to the fourth slice on the first SCSI disk, create [.filename]#/etc/gg.exports# with this line:
ko: Crossref:network-servers[network-nfs,"네트워크 파일 시스템(NFS)"]에서 설명하는 NFS와 유사하게, ggated는 내보내기 파일을 사용하여 구성됩니다. 이 파일은 내보낸 리소스에 액세스할 수 있는 시스템과 제공되는 액세스 수준을 지정합니다. 예를 들어 클라이언트 `192.168.1.5`에 첫 번째 SCSI 디스크의 네 번째 슬라이스에 대한 읽기 및 쓰기 액세스 권한을 부여하려면 다음 줄을 사용하여 [.filename]#/etc/gg.exports#를 만듭니다:
ru: Аналогично NFS, который рассматривается в crossref:network-servers[network-nfs,"Network File System (NFS)"], ggated настраивается с использованием файла экспорта. Этот файл определяет, каким системам разрешён доступ к экспортируемым ресурсам и какой уровень доступа им предоставляется. Например, чтобы предоставить клиенту `192.168.1.5` права на чтение и запись для четвёртого раздела первого SCSI-диска, создайте файл [.filename]#/etc/gg.exports# со следующей строкой:

source: Before exporting the device, ensure it is not currently mounted. Then, start ggated:
ko: 장치를 내보내기 전에 장치가 현재 마운트되어 있지 않은지 확인하세요. 그런 다음 ggated를 시작합니다:
ru: Перед экспортом устройства убедитесь, что оно не смонтировано. Затем запустите `ggated`:

source: Several options are available for specifying an alternate listening port or changing the default location of the exports file. Refer to man:ggated[8] for details.
ko: 대체 수신 포트를 지정하거나 내보내기 파일의 기본 위치를 변경하는 데 몇 가지 옵션을 사용할 수 있습니다. 자세한 내용은 man:ggated[8]을 참조하세요.
ru: Для указания альтернативного порта прослушивания или изменения расположения файла экспорта по умолчанию доступно несколько вариантов. Подробности см. в man:ggated[8].

source: To access the exported device on the client machine, first use `ggatec` to specify the IP address of the server and the device name of the exported device. If successful, this command will display a `ggate` device name to mount. Mount that specified device name on a free mount point. This example connects to the [.filename]#/dev/da0s4d# partition on `192.168.1.1`, then mounts [.filename]#/dev/ggate0# on [.filename]#/mnt#:
ko: 클라이언트 시스템에서 내보낸 장치에 액세스하려면 먼저 `ggatec`을 사용하여 서버의 IP 주소와 내보낸 장치의 장치 이름을 지정합니다. 성공하면 이 명령은 마운트할 `ggate` 장치 이름을 표시합니다. 지정한 장치 이름을 사용 가능한 마운트 지점에 마운트합니다. 이 예는 `192.168.1.1`의 [.filename]#/dev/da0s4d# 파티션에 연결한 다음 [.filename]#/mnt#에 [.filename]#/dev/ggate0#을 마운트합니다:
ru: Для доступа к экспортированному устройству на клиентской машине сначала используйте `ggatec`, указав IP-адрес сервера и имя экспортированного устройства. В случае успеха эта команда выведет имя устройства `ggate`, которое нужно смонтировать. Смонтируйте указанное имя устройства на свободную точку монтирования. В этом примере выполняется подключение к разделу [.filename]#/dev/da0s4d# на `192.168.1.1`, затем монтируется [.filename]#/dev/ggate0# в [.filename]#/mnt#:

source: The device on the server may now be accessed through [.filename]#/mnt# on the client. For more details about `ggatec` and a few usage examples, refer to man:ggatec[8].
ko: 이제 클라이언트에서 [.filename]#/mnt#를 통해 서버의 장치에 액세스할 수 있습니다. `ggatec`에 대한 자세한 내용과 몇 가지 사용 예는 man:ggatec[8]를 참조하세요.
ru: Устройство на сервере теперь может быть доступно через [.filename]#/mnt# на клиенте. Для получения дополнительной информации о `ggatec` и нескольких примеров использования обратитесь к man:ggatec[8].

source: The mount will fail if the device is currently mounted on either the server or any other client on the network. If simultaneous access is needed to network resources, use NFS instead.
ko: 장치가 현재 서버 또는 네트워크의 다른 클라이언트에 마운트되어 있으면 마운트가 실패합니다. 네트워크 리소스에 동시에 액세스해야 하는 경우 대신 NFS를 사용하세요.
ru: Монтирование завершится ошибкой, если устройство в данный момент смонтировано на сервере или любом другом клиенте в сети. Если требуется одновременный доступ к сетевым ресурсам, используйте NFS.

source: When the device is no longer needed, unmount it with `umount` so that the resource is available to other clients.
ko: 장치가 더 이상 필요하지 않으면 다른 클라이언트에서 리소스를 사용할 수 있도록 `umount`로 장치를 마운트 해제합니다.
ru: Когда устройство больше не требуется, размонтируйте его с помощью `umount`, чтобы ресурс стал доступен другим клиентам.

source: Labeling Disk Devices
ko: 디스크 장치에 라벨 지정
ru: Маркировка дисковых устройств

source: During system initialization, the FreeBSD kernel creates device nodes as devices are found. This method of probing for devices raises some issues. For instance, what if a new disk device is added via USB? It is likely that a flash device may be handed the device name of [.filename]#da0# and the original [.filename]#da0# shifted to [.filename]#da1#. This will cause issues mounting file systems if they are listed in [.filename]#/etc/fstab# which may also prevent the system from booting.
ko: 시스템 초기화 중에 FreeBSD 커널은 디바이스가 발견되면 디바이스 노드를 생성합니다. 이 장치 검색 방법에는 몇 가지 문제가 있습니다. 예를 들어, USB를 통해 새 디스크 장치가 추가되면 어떻게 될까요? 플래시 장치에 [.filename]#da0#의 장치 이름이 전달되고 원래 [.filename]#da0#이 [.filename]#da1#으로 바뀔 수 있습니다. 이로 인해 파일 시스템이 [.filename]#/etc/fstab#에 나열되어 있는 파일 시스템을 마운트하는 데 문제가 발생하여 시스템이 부팅되지 않을 수도 있습니다.
ru: Во время инициализации системы ядро FreeBSD создает узлы устройств по мере их обнаружения. Такой метод поиска устройств вызывает некоторые проблемы. Например, что если новое дисковое устройство будет добавлено через USB? Вполне вероятно, что флеш-накопитель может получить имя устройства [.filename]#da0#, а исходное устройство [.filename]#da0# сместится на [.filename]#da1#. Это вызовет проблемы с монтированием файловых систем, если они указаны в [.filename]#/etc/fstab#, что также может помешать загрузке системы.

source: One solution is to chain SCSI devices in order so a new device added to the SCSI card will be issued unused device numbers. But what about USB devices which may replace the primary SCSI disk? This happens because USB devices are usually probed before the SCSI card. One solution is to only insert these devices after the system has been booted. Another method is to use only a single ATA drive and never list the SCSI devices in [.filename]#/etc/fstab#.
ko: 한 가지 해결책은 SCSI 장치를 순서대로 연결하여 SCSI 카드에 추가된 새 장치에 사용하지 않는 장치 번호가 발급되도록 하는 것입니다. 하지만 기본 SCSI 디스크를 대체할 수 있는 USB 장치는 어떻게 해야 할까요? USB 장치는 일반적으로 SCSI 카드보다 먼저 프로빙되기 때문에 이런 문제가 발생합니다. 한 가지 해결책은 시스템이 부팅된 후에만 이러한 장치를 삽입하는 것입니다. 또 다른 방법은 단일 ATA 드라이브만 사용하고 [.filename]#/etc/fstab#에 SCSI 장치를 나열하지 않는 것입니다.
ru: Одно из решений — последовательное подключение SCSI-устройств, чтобы новое устройство, добавленное к SCSI-карте, получало неиспользуемые номера. Но что делать с USB-устройствами, которые могут заменить основной SCSI-диск? Это происходит потому, что USB-устройства обычно определяются раньше SCSI-карты. Один из вариантов — подключать такие устройства только после загрузки системы. Другой способ — использовать только один ATA-диск и никогда не указывать SCSI-устройства в [.filename]#/etc/fstab#.

source: A better solution is to use `glabel` to label the disk devices and use the labels in [.filename]#/etc/fstab#. Since `glabel` stores the label in the last sector of a given provider, the label will remain persistent across reboots. By using this label as a device, the file-system may always be mounted regardless of what device node it is accessed through.
ko: 더 나은 해결책은 `glabel`을 사용하여 디스크 장치에 레이블을 지정하고 [.filename]#/etc/fstab#에 레이블을 사용하는 것입니다. `glabel`은 주어진 공급자의 마지막 섹터에 레이블을 저장하므로 재부팅 시에도 레이블이 영구적으로 유지됩니다. 이 레이블을 장치로 사용하면 어떤 장치 노드를 통해 액세스하는지에 관계없이 파일 시스템을 항상 마운트할 수 있습니다.
ru: Лучшим решением будет использование `glabel` для маркировки дисковых устройств и применение меток в [.filename]#/etc/fstab#. Поскольку `glabel` сохраняет метку в последнем секторе заданного провайдера, метка останется неизменной после перезагрузки. Используя эту метку в качестве устройства, файловую систему можно всегда монтировать, независимо от того, через какой узел устройства к ней обращаются.

source: `glabel` can create both transient and permanent labels. Only permanent labels are consistent across reboots. Refer to man:glabel[8] for more information on the differences between labels.
ko: `glabel`은 일시적 레이블과 영구 레이블을 모두 생성할 수 있습니다. 재부팅할 때마다 영구 레이블만 일관되게 유지됩니다. 레이블 간의 차이점에 대한 자세한 내용은 man:glabel[8]을 참조하세요.
ru: `glabel` может создавать как временные, так и постоянные метки. Только постоянные метки сохраняются после перезагрузки. Дополнительную информацию о различиях между метками можно найти в man:glabel[8].

source: Label Types and Examples
ko: 레이블 유형 및 예제
ru: Типы меток и примеры

source: Permanent labels can be a generic or a file system label. Permanent file system labels can be created with man:tunefs[8] or man:newfs[8]. These types of labels are created in a sub-directory of [.filename]#/dev#, and will be named according to the file system type. For example, UFS2 file system labels will be created in [.filename]#/dev/ufs#. Generic permanent labels can be created with `glabel label`. These are not file system specific and will be created in [.filename]#/dev/label#.
ko: 영구 레이블은 일반 또는 파일 시스템 레이블이 될 수 있습니다. 영구 파일 시스템 레이블은 man:tunefs[8] 또는 man:newfs[8]로 만들 수 있습니다. 이러한 유형의 레이블은 [.filename]#/dev#의 하위 디렉터리에 생성되며 파일 시스템 유형에 따라 이름이 지정됩니다. 예를 들어, UFS2 파일 시스템 레이블은 [.filename]#/dev/ufs#에 생성됩니다. 일반 영구 레이블은 `glabel label`로 생성할 수 있습니다. 이러한 레이블은 파일 시스템별로 다르지 않으며 [.filename]#/dev/label#에 생성됩니다.
ru: Постоянные метки могут быть общими или метками файловой системы. Постоянные метки файловой системы можно создать с помощью man:tunefs[8] или man:newfs[8]. Такие метки создаются в подкаталоге [.filename]#/dev# и именуются в соответствии с типом файловой системы. Например, метки файловой системы UFS2 будут созданы в [.filename]#/dev/ufs#. Общие постоянные метки можно создать с помощью `glabel label`. Они не привязаны к конкретной файловой системе и будут размещены в [.filename]#/dev/label#.

source: Temporary labels are destroyed at the next reboot. These labels are created in [.filename]#/dev/label# and are suited to experimentation. A temporary label can be created using `glabel create`.
ko: 임시 레이블은 다음 재부팅 시 삭제됩니다. 이러한 레이블은 [.filename]#/dev/label#에 생성되며 테스트를 할 때 적합합니다. 임시 레이블은 `glabel create`를 사용하여 만들 수 있습니다.
ru: Временные метки удаляются при следующей перезагрузке. Эти метки создаются в [.filename]#/dev/label# и подходят для экспериментов. Временную метку можно создать с помощью `glabel create`.

source: To create a permanent label for a UFS2 file system without destroying any data, issue the following command:
ko: 데이터를 파괴하지 않고 UFS2 파일 시스템에 대한 영구 레이블을 만들려면 다음 명령을 실행합니다:
ru: Чтобы создать постоянную метку для файловой системы UFS2 без уничтожения данных, выполните следующую команду:

source: A label should now exist in [.filename]#/dev/ufs# which may be added to [.filename]#/etc/fstab#:
ko: 이제 레이블이 [.filename]#/dev/ufs#에 존재해야 하며, [.filename]#/etc/fstab#에 추가할 수 있습니다:
ru: Теперь в [.filename]#/dev/ufs# должна существовать метка, которую можно добавить в [.filename]#/etc/fstab#:

source: The file system must not be mounted while attempting to run `tunefs`.
ko: `tunefs`를 실행하는 동안 파일 시스템을 마운트해서는 안됩니다.
ru: Файловая система не должна быть смонтирована при попытке запуска `tunefs`.

source: Now the file system may be mounted:
ko: 이제 파일 시스템을 마운트할 수 있습니다:
ru: Теперь файловую систему можно смонтировать:

source: From this point on, so long as the [.filename]#geom_label.ko# kernel module is loaded at boot with [.filename]#/boot/loader.conf# or the `GEOM_LABEL` kernel option is present, the device node may change without any ill effect on the system.
ko: 이 시점부터는 부팅 시 [.filename]#/boot/loader.conf#로 [.filename]#geom_label.ko# 커널 모듈이 로드되거나 `GEOM_LABEL` 커널 옵션이 있는 한 시스템에 악영향을 미치지 않고 장치 노드를 변경할 수 있습니다.
ru: Начиная с этого момента, при условии, что модуль ядра [.filename]#geom_label.ko# загружается при загрузке через [.filename]#/boot/loader.conf# или присутствует опция ядра `GEOM_LABEL`, изменение узла устройства не окажет негативного влияния на систему.

source: File systems may also be created with a default label by using the `-L` flag with `newfs`. Refer to man:newfs[8] for more information.
ko: 파일 시스템은 `newfs`와 함께 `-L` 플래그를 사용하여 기본 레이블로 만들 수도 있습니다. 자세한 내용은 man:newfs[8]을 참조하십시오.
ru: Файловые системы также могут быть созданы с меткой по умолчанию с использованием флага `-L` в `newfs`. Подробнее см. в man:newfs[8].

source: The following command can be used to destroy the label:
ko: 다음 명령을 사용하여 레이블을 삭제할 수 있습니다:
ru: Следующая команда может быть использована для удаления метки:

source: The following example shows how to label the partitions of a boot disk.
ko: 다음 예는 부팅 디스크의 파티션에 레이블을 지정하는 방법을 보여줍니다.
ru: Следующий пример показывает, как назначить метки разделам загрузочного диска.

source: Labeling Partitions on the Boot Disk
ko: 부팅 디스크의 파티션에 레이블 지정하기
ru: Разметка разделов на загрузочном диске

source: By permanently labeling the partitions on the boot disk, the system should be able to continue to boot normally, even if the disk is moved to another controller or transferred to a different system. For this example, it is assumed that a single ATA disk is used, which is currently recognized by the system as [.filename]#ad0#. It is also assumed that the standard FreeBSD partition scheme is used, with [.filename]#/#, [.filename]#/var#, [.filename]#/usr# and [.filename]#/tmp#, as well as a swap partition.
ko: 부팅 디스크의 파티션에 영구적으로 레이블을 지정하면 디스크가 다른 컨트롤러로 이동하거나 다른 시스템으로 전송되더라도 시스템이 정상적으로 부팅할 수 있습니다. 이 예에서는 현재 시스템에서 [.filename]#ad0#으로 인식되는 단일 ATA 디스크가 사용된다고 가정합니다. 또한 [.filename]#/#, [.filename]#/var#, [.filename]#/usr# 및 [.filename]#/tmp#와 스왑 파티션이 있는 표준 FreeBSD 파티션 체계가 사용된다고 가정합니다.
ru: Постоянная маркировка разделов на загрузочном диске позволяет системе продолжать нормальную загрузку, даже если диск будет перемещен на другой контроллер или перенесен в другую систему. В этом примере предполагается, что используется один ATA-диск, который система в настоящее время распознает как [.filename]#ad0#. Также предполагается, что используется стандартная схема разделов FreeBSD с [.filename]#/#, [.filename]#/var#, [.filename]#/usr#, [.filename]#/tmp#, а также разделом подкачки.

source: Reboot the system, and at the man:loader[8] prompt, press kbd:[4] to boot into single user mode. Then enter the following commands:
ko: 시스템을 재부팅하고 man:loader[8] 프롬프트에서 kbd:[4]를 눌러 단일 사용자 모드로 부팅합니다. 그런 다음, 다음 명령을 입력합니다:
ru: Перезагрузите систему, и на запросе man:loader[8] нажмите kbd:[4], чтобы загрузиться в однопользовательском режиме. Затем введите следующие команды:

source: The system will continue with multi-user boot. After the boot completes, edit [.filename]#/etc/fstab# and replace the conventional device names, with their respective labels. The final [.filename]#/etc/fstab# will look like this:
ko: 시스템이 다중 사용자 부팅을 계속 진행합니다. 부팅이 완료되면 [.filename]#/etc/fstab#을 편집하고 기존 장치 이름을 해당 레이블로 바꿉니다. 최종 [.filename]#/etc/fstab#은 다음과 같이 표시됩니다:
ru: Система продолжит загрузку в многопользовательском режиме. После завершения загрузки отредактируйте файл [.filename]#/etc/fstab# и замените стандартные имена устройств на соответствующие метки. Итоговый файл [.filename]#/etc/fstab# будет выглядеть следующим образом:

source: The system can now be rebooted. If everything went well, it will come up normally and `mount` will show:
ko: 이제 시스템을 재부팅할 수 있습니다. 모든 것이 잘 되었다면 정상적으로 나타나고 `mount` 명령은 다음과 같이 표시됩니다:
ru: Систему теперь можно перезагрузить. Если всё прошло успешно, она загрузится в обычном режиме, и команда `mount` покажет:

source: The man:glabel[8] class supports a label type for UFS file systems, based on the unique file system id, `ufsid`. These labels may be found in [.filename]#/dev/ufsid# and are created automatically during system startup. It is possible to use `ufsid` labels to mount partitions using [.filename]#/etc/fstab#. Use `glabel status` to receive a list of file systems and their corresponding `ufsid` labels:
ko: man:glabel[8] 클래스는 고유한 파일 시스템 ID인 `ufsid`를 기반으로 하는 UFS 파일 시스템용 레이블 유형을 지원합니다. 이러한 레이블은 [.filename]#/dev/ufsid#에서 찾을 수 있으며 시스템 시작 중에 자동으로 생성됩니다. `ufsid` 레이블은 [.filename]#/etc/fstab#을 이용하여 파티션을 마운트할 수 있습니다. `glabel status`를 사용하여 파일 시스템과 해당 `ufsid` 레이블 목록을 받습니다:
ru: Класс man:glabel[8] поддерживает тип метки для файловых систем UFS, основанный на уникальном идентификаторе файловой системы, `ufsid`. Эти метки могут быть найдены в [.filename]#/dev/ufsid# и создаются автоматически во время запуска системы. Можно использовать метки `ufsid` для монтирования разделов с помощью [.filename]#/etc/fstab#. Для получения списка файловых систем и соответствующих им меток `ufsid` используйте команду `glabel status`:

source: In the above example, [.filename]#ad4s1d# represents [.filename]#/var#, while [.filename]#ad4s1f# represents [.filename]#/usr#. Using the `ufsid` values shown, these partitions may now be mounted with the following entries in [.filename]#/etc/fstab#:
ko: 위의 예에서 [.filename]#ad4s1d#는 [.filename]#/var#를 나타내고, [.filename]#ad4s1f#는 [.filename]#/usr#를 나타냅니다. 표시된 `ufsid` 값을 사용하면 이제 이러한 파티션을 [.filename]#/etc/fstab#에 다음 항목으로 마운트할 수 있습니다:
ru: В приведённом выше примере [.filename]#ad4s1d# соответствует [.filename]#/var#, а [.filename]#ad4s1f# — [.filename]#/usr#. Используя указанные значения `ufsid`, эти разделы можно смонтировать, добавив следующие строки в [.filename]#/etc/fstab#:

source: Any partitions with `ufsid` labels can be mounted in this way, eliminating the need to manually create permanent labels, while still enjoying the benefits of device name independent mounting.
ko: 'ufsid' 레이블이 있는 모든 파티션은 이러한 방식으로 마운트할 수 있으므로 수동으로 영구 레이블을 생성할 필요가 없으며, 장치 이름 독립 마운트의 이점을 그대로 누릴 수 있습니다.
ru: Любые разделы с метками `ufsid` могут быть смонтированы таким образом, что устраняет необходимость вручную создавать постоянные метки, сохраняя при этом преимущества монтирования, независимого от имён устройств.

source: UFS Journaling Through GEOM
ko: GEOM을 통한 UFS 저널링
ru: Журналирование UFS через GEOM

source: Support for journals on UFS file systems is available on FreeBSD. The implementation is provided through the GEOM subsystem and is configured using `gjournal`. Unlike other file system journaling implementations, the `gjournal` method is block based and not implemented as part of the file system. It is a GEOM extension.
ko: UFS 파일 시스템에서 저널에 대한 지원은 FreeBSD에서 사용할 수 있습니다. 이 구현은 GEOM 서브시스템을 통해 제공되며 `gjournal`을 사용하여 구성됩니다. 다른 파일 시스템 저널링 구현과 달리, `gjournal` 방법은 블록 기반이며 파일 시스템의 일부로 구현되지 않습니다. 이것은 GEOM 확장입니다.
ru: Поддержка журналирования для файловых систем UFS доступна в FreeBSD. Реализация предоставляется через подсистему GEOM и настраивается с помощью `gjournal`. В отличие от других реализаций журналирования файловых систем, метод `gjournal` работает на уровне блоков и не является частью файловой системы. Это расширение GEOM.

source: Journaling stores a log of file system transactions, such as changes that make up a complete disk write operation, before meta-data and file writes are committed to the disk. This transaction log can later be replayed to redo file system transactions, preventing file system inconsistencies.
ko: 저널링은 메타데이터 및 파일 쓰기가 디스크에 커밋되기 전에, 전체 디스크 쓰기 작업을 구성하는 변경 사항과 같은 파일 시스템 트랜잭션 로그를 저장합니다. 이 트랜잭션 로그를 나중에 재생하여 파일 시스템 트랜잭션을 다시 실행할 수 있으므로 파일 시스템 불일치를 방지할 수 있습니다.
ru: В журналировании хранится журнал транзакций файловой системы, таких как изменения, составляющие полную операцию записи на диск, до того как метаданные и записи файлов будут записаны на диск. Этот журнал транзакций может быть позднее воспроизведен для повторного выполнения операций файловой системы, предотвращая её рассогласование.

source: This method provides another mechanism to protect against data loss and inconsistencies of the file system. Unlike Soft Updates, which tracks and enforces meta-data updates, and snapshots, which create an image of the file system, a log is stored in disk space specifically for this task. For better performance, the journal may be stored on another disk. In this configuration, the journal provider or storage device should be listed after the device to enable journaling on.
ko: 이 방법은 데이터 손실 및 파일 시스템의 불일치로부터 보호하는 또 다른 메커니즘을 제공합니다. 메타데이터 업데이트를 추적하고 적용하는 소프트 업데이트나 파일 시스템의 이미지를 생성하는 스냅샷과는 달리, 이 작업을 위해 특별히 디스크 공간에 로그가 저장됩니다. 성능 향상을 위해 저널을 다른 디스크에 저장할 수 있습니다. 이 구성에서는 저널 제공자 또는 저장 장치를 장치 뒤에 나열하여 저널링을 사용하도록 설정해야 합니다.
ru: Этот метод предоставляет ещё один механизм защиты от потери данных и нарушения целостности файловой системы. В отличие от мягких обновлений, которые отслеживают и контролируют обновления метаданных, и снимков, создающих образ файловой системы, журнал хранится в отдельном месте на диске, специально выделенном для этой задачи. Для повышения производительности журнал может храниться на другом диске. В такой конфигурации провайдер журнала или устройство хранения должны быть указаны после устройства, для которого включается ведение журнала.

source: The [.filename]#GENERIC# kernel provides support for `gjournal`. To automatically load the [.filename]#geom_journal.ko# kernel module at boot time, add the following line to [.filename]#/boot/loader.conf#:
ko: [.filename]#GENERIC# 커널은 `gjournal`을 지원합니다. 부팅 시 [.filename]#geom_journal.ko# 커널 모듈을 자동으로 로드하려면 [.filename]#/boot/loader.conf#에 다음 줄을 추가합니다:
ru: Ядро [.filename]#GENERIC# предоставляет поддержку `gjournal`. Чтобы автоматически загружать модуль ядра [.filename]#geom_journal.ko# при загрузке, добавьте следующую строку в [.filename]#/boot/loader.conf#:

source: If a custom kernel is used, ensure the following line is in the kernel configuration file:
ko: 사용자 정의 커널을 사용하는 경우 커널 구성 파일에 다음 내용이 있는지 확인하세요:
ru: Если используется собственный вариант ядра, убедитесь, что следующая строка присутствует в конфигурационном файле ядра:

source: Once the module is loaded, a journal can be created on a new file system using the following steps. In this example, [.filename]#da4# is a new SCSI disk:
ko: 모듈이 로드되면 다음 단계에 따라 새 파일 시스템에 저널을 만들 수 있습니다. 이 예에서 [.filename]#da4#는 새 SCSI 디스크입니다:
ru: После загрузки модуля журнал можно создать на новой файловой системе, выполнив следующие шаги. В этом примере [.filename]#da4# — это новый SCSI-диск:
