Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/geom/_index.po
Languages: ko, ru

source: RAID3 is a method used to combine several disk drives into a single volume with a dedicated parity disk. In a RAID3 system, data is split up into a number of bytes that are written across all the drives in the array except for one disk which acts as a dedicated parity disk. This means that disk reads from a RAID3 implementation access all disks in the array. Performance can be enhanced by using multiple disk controllers. The RAID3 array provides a fault tolerance of 1 drive, while providing a capacity of 1 - 1/n times the total capacity of all drives in the array, where n is the number of hard drives in the array. Such a configuration is mostly suitable for storing data of larger sizes such as multimedia files.
ko: RAID3는 여러 디스크 드라이브를 전용 패리티 디스크와 함께 단일 볼륨으로 결합하는 데 사용하는 방법입니다. RAID3 시스템에서 데이터는 전용 패리티 디스크 역할을 하는 하나의 디스크를 제외한 어레이의 모든 드라이브에 기록되는 여러 바이트 단위로 분할됩니다. 즉, RAID3 구현에서 디스크를 읽으면 어레이의 모든 디스크에 액세스합니다. 여러 디스크 컨트롤러를 사용하면 성능을 향상시킬 수 있습니다. RAID3 어레이는 1개의 드라이브에 대해 내결함성을 제공하는 동시에 어레이에 있는 모든 드라이브의 총 용량의 1 - 1/n배의 용량을 제공합니다(여기서 n은 어레이에 있는 하드 드라이브의 수입니다). 이러한 구성은 주로 멀티미디어 파일과 같이 크기가 큰 데이터를 저장하는 데 적합합니다.
ru: RAID3 — это метод объединения нескольких дисков в один том с выделенным диском четности. В системе RAID3 данные разбиваются на байты, которые записываются на все диски массива, за исключением одного диска, выполняющего роль выделенного диска четности. Это означает, что операции чтения в RAID3 обращаются ко всем дискам массива. Производительность может быть повышена за счет использования нескольких контроллеров дисков. Массив RAID3 обеспечивает отказоустойчивость на уровне одного диска, а его емкость составляет 1 - 1/n от общей емкости всех дисков массива, где n — количество жестких дисков в массиве. Такая конфигурация в основном подходит для хранения данных большого объема, таких как мультимедийные файлы.

source: At least 3 physical hard drives are required to build a RAID3 array. Each disk must be of the same size, since I/O requests are interleaved to read or write to multiple disks in parallel. Also, due to the nature of RAID3, the number of drives must be equal to 3, 5, 9, 17, and so on, or 2^n + 1.
ko: RAID3 어레이를 구축하려면 최소 3개의 물리적 하드 드라이브가 필요합니다. 여러 디스크를 병렬로 읽거나 쓰기 위해 I/O 요청이 인터리빙되므로 각 디스크의 크기는 동일해야 합니다. 또한 RAID3의 특성상 드라이브의 수는 3, 5, 9, 17 등 또는 2^n + 1과 같아야 합니다.
ru: Для создания массива RAID3 требуется как минимум 3 физических жестких диска. Каждый диск должен быть одинакового размера, так как запросы ввода-вывода чередуются для чтения или записи на несколько дисков параллельно. Кроме того, из-за особенностей RAID3 количество дисков должно быть равно 3, 5, 9, 17 и так далее, то есть соответствовать формуле 2^n + 1.

source: This section demonstrates how to create a software RAID3 on a FreeBSD system.
ko: 이 섹션에서는 FreeBSD 시스템에서 소프트웨어 RAID3를 생성하는 방법을 설명합니다.
ru: Этот раздел демонстрирует, как создать программный RAID3 в системе FreeBSD.

source: While it is theoretically possible to boot from a RAID3 array on FreeBSD, that configuration is uncommon and is not advised.
ko: 이론적으로는 FreeBSD의 RAID3 어레이에서 부팅할 수 있지만, 이 구성은 일반적이지 않으며 권장하지 않습니다.
ru: Хотя теоретически возможно загружаться с массива RAID3 в FreeBSD, такая конфигурация встречается редко и не рекомендуется.

source: Creating a Dedicated RAID3 Array
ko: 전용 RAID3 어레이 만들기
ru: Создание выделенного массива RAID3

source: In FreeBSD, support for RAID3 is implemented by the man:graid3[8] GEOM class. Creating a dedicated RAID3 array on FreeBSD requires the following steps.
ko: FreeBSD에서 RAID3에 대한 지원은 man:graid3[8] GEOM 클래스에 의해 구현됩니다. FreeBSD에서 전용 RAID3 어레이를 만들려면 다음 단계가 필요합니다.
ru: В FreeBSD поддержка RAID3 реализована классом GEOM man:graid3[8]. Создание выделенного массива RAID3 в FreeBSD требует выполнения следующих шагов.

source: First, load the [.filename]#geom_raid3.ko# kernel module by issuing one of the following commands:
ko: 먼저 다음 명령 중 하나를 실행하여 [.filename]#geom_raid3.ko# 커널 모듈을 로드합니다:
ru: Сначала загрузите модуль ядра [.filename]#geom_raid3.ko#, выполнив одну из следующих команд:

source: or:
ko: 또는:
ru: или:

source: Ensure that a suitable mount point exists. This command creates a new directory to use as the mount point:
ko: 적절한 마운트 지점이 있는지 확인합니다. 이 명령은 마운트 지점으로 사용할 새 디렉터리를 만듭니다:
ru: Убедитесь, что существует подходящая точка монтирования. Эта команда создает новый каталог для использования в качестве точки монтирования:

source: Determine the device names for the disks which will be added to the array, and create the new RAID3 device. The final device listed will act as the dedicated parity disk. This example uses three unpartitioned ATA drives: [.filename]#ada1# and [.filename]#ada2# for data, and [.filename]#ada3# for parity.
ko: 어레이에 추가할 디스크의 장치 이름을 결정하고 새 RAID3 장치를 생성합니다. 마지막으로 나열된 장치가 전용 패리티 디스크로 작동합니다. 이 예에서는 파티션되지 않은 ATA 드라이브 3개를 사용합니다: 데이터용은 [.filename]#ada1#과 [.filename]#ada2#, 패리티용은 [.filename]#ada3#입니다.
ru: Определите имена устройств для дисков, которые будут добавлены в массив, и создайте новое устройство RAID3. Последнее указанное устройство будет использоваться в качестве выделенного диска четности. В этом примере используются три неразделенных ATA-диска: [.filename]#ada1# и [.filename]#ada2# для данных, а [.filename]#ada3# для четности.

source: Partition the newly created [.filename]#gr0# device and put a UFS file system on it:
ko: 새로 생성한 [.filename]#gr0# 장치를 파티션하고 그 위에 UFS 파일 시스템을 설치합니다:
ru: Разделите только что созданное устройство [.filename]#gr0# и разместите на нем файловую систему UFS:

source: Many numbers will glide across the screen, and after a bit of time, the process will be complete. The volume has been created and is ready to be mounted:
ko: 많은 숫자가 화면을 가로질러 미끄러지듯 움직이고 잠시 후 프로세스가 완료됩니다. 볼륨이 생성되었으며 마운트할 준비가 되었습니다:
ru: По экрану пройдёт множество чисел, и через некоторое время процесс завершится. Том создан и готов к монтированию:

source: The RAID3 array is now ready to use.
ko: 이제 RAID3 어레이를 사용할 준비가 되었습니다.
ru: Массив RAID3 теперь готов к использованию.

source: Additional configuration is needed to retain this setup across system reboots.
ko: 시스템 재부팅 시에도 이 설정을 유지하려면 추가 구성이 필요합니다.
ru: Для сохранения данной конфигурации после перезагрузки системы требуется дополнительная настройка.

source: The [.filename]#geom_raid3.ko# module must be loaded before the array can be mounted. To automatically load the kernel module during system initialization, add the following line to [.filename]#/boot/loader.conf#:
ko: 어레이를 마운트하기 전에 [.filename]#geom_raid3.ko# 모듈을 로드해야 합니다. 시스템 초기화 중에 커널 모듈을 자동으로 로드하려면 [.filename]#/boot/loader.conf#에 다음 줄을 추가합니다:
ru: Модуль [.filename]#geom_raid3.ko# должен быть загружен перед монтированием массива. Для автоматической загрузки модуля ядра во время инициализации системы добавьте следующую строку в [.filename]#/boot/loader.conf#:

source: The following volume information must be added to [.filename]#/etc/fstab# in order to automatically mount the array's file system during the system boot process:
ko: 시스템 부팅 프로세스 중에 어레이의 파일 시스템을 자동으로 마운트하려면 [.filename]#/etc/fstab#에 다음 볼륨 정보를 추가해야 합니다:
ru: Следующую информацию о разделе необходимо добавить в [.filename]#/etc/fstab#, чтобы автоматически монтировать файловую систему массива во время загрузки системы:

source: Software RAID Devices
ko: 소프트웨어 RAID 장치
ru: Устройства с программным RAID

source: Some motherboards and expansion cards add some simple hardware, usually just a ROM, that allows the computer to boot from a RAID array. After booting, access to the RAID array is handled by software running on the computer's main processor. This "hardware-assisted software RAID" gives RAID arrays that are not dependent on any particular operating system, and which are functional even before an operating system is loaded.
ko: 일부 마더보드와 확장 카드는 컴퓨터가 RAID 어레이에서 부팅할 수 있도록 간단한 하드웨어(일반적으로 ROM 뿐인)를 추가합니다. 부팅 후에는 컴퓨터의 메인 프로세서에서 실행되는 소프트웨어에 의해 RAID 어레이에 대한 액세스가 처리됩니다. 이 "하드웨어 지원 소프트웨어 RAID"는 특정 운영 체제에 종속되지 않고 운영 체제가 로드되기 전에도 동작하는 RAID 어레이를 제공합니다.
ru: Некоторые материнские платы и карты расширения добавляют простые аппаратные компоненты, обычно только ПЗУ, что позволяет компьютеру загружаться с RAID-массива. После загрузки доступ к RAID-массиву обеспечивается программным обеспечением, работающим на основном процессоре компьютера. Такой "аппаратно-ускоренный программный RAID" создаёт массивы, не зависящие от конкретной операционной системы и функционирующие ещё до её загрузки.

source: Several levels of RAID are supported, depending on the hardware in use. See man:graid[8] for a complete list.
ko: 사용 중인 하드웨어에 따라 여러 수준의 RAID가 지원됩니다. 전체 목록은 man:graid[8]를 참조하세요.
ru: Несколько уровней RAID поддерживаются в зависимости от используемого оборудования. Полный список см. в man:graid[8].

source: man:graid[8] requires the [.filename]#geom_raid.ko# kernel module, which is included in the [.filename]#GENERIC# kernel starting with FreeBSD 9.1. If needed, it can be loaded manually with `graid load`.
ko: man:graid[8]를 사용하려면 [.filename]#geom_raid.ko# 커널 모듈이 필요하며, 이 모듈은 FreeBSD 9.1부터 [.filename]#GENERIC# 커널에 포함되어 있습니다. 필요한 경우 `graid load`로 수동 로드할 수 있습니다.
ru: man:graid[8] требует наличия модуля ядра [.filename]#geom_raid.ko#, который включён в ядро [.filename]#GENERIC# начиная с FreeBSD 9.1. При необходимости его можно загрузить вручную командой `graid load`.

source: Creating an Array
ko: 어레이 만들기
ru: Создание массива

source: Software RAID devices often have a menu that can be entered by pressing special keys when the computer is booting. The menu can be used to create and delete RAID arrays. man:graid[8] can also create arrays directly from the command line.
ko: 소프트웨어 RAID 장치에는 컴퓨터가 부팅될 때 특수 키를 눌러 들어갈 수 있는 메뉴가 있는 경우가 많습니다. 이 메뉴는 RAID 어레이를 생성하고 삭제하는 데 사용할 수 있습니다. man:graid[8]는 명령줄에서 직접 어레이를 생성할 수도 있습니다.
ru: В устройствах с программным RAID часто есть меню, которое можно вызвать, нажав специальные клавиши при загрузке компьютера. Это меню позволяет создавать и удалять RAID-массивы. man:graid[8] также может создавать массивы напрямую из командной строки.

source: `graid label` is used to create a new array. The motherboard used for this example has an Intel software RAID chipset, so the Intel metadata format is specified. The new array is given a label of [.filename]#gm0#, it is a mirror (RAID1), and uses drives [.filename]#ada0# and [.filename]#ada1#.
ko: `graid label`은 새 어레이를 생성하는 데 사용됩니다. 이 예제에 사용된 마더보드에는 인텔 소프트웨어 RAID 칩셋이 있으므로 인텔 메타데이터 형식이 지정됩니다. 새 어레이에는 [.filename]#gm0# 레이블이 지정되며, 미러(RAID1)이며 [.filename]#ada0#와 [.filename]#ada1# 드라이브를 사용합니다.
ru: `graid label` используется для создания нового массива. В данном примере используется материнская плата с чипсетом Intel software RAID, поэтому указан формат метаданных Intel. Новый массив получает метку [.filename]#gm0#, это зеркало (RAID1), и использует диски [.filename]#ada0# и [.filename]#ada1#.

source: Some space on the drives will be overwritten when they are made into a new array. Back up existing data first!
ko: 드라이브의 일부 공간은 새 배열로 만들 때 덮어쓰기됩니다. 기존 데이터를 먼저 백업하세요!
ru: Некоторое пространство на дисках будет перезаписано при создании нового массива. Предварительно создайте резервную копию существующих данных!

source: A status check shows the new mirror is ready for use:
ko: 상태 확인을 통해 새 미러를 사용할 준비가 되었음을 알 수 있습니다:
ru: Проверка состояния показывает, что новое зеркало готово к использованию:

source: The array device appears in [.filename]#/dev/raid/#. The first array is called [.filename]#r0#. Additional arrays, if present, will be [.filename]#r1#, [.filename]#r2#, and so on.
ko: 어레이 장치는 [.filename]#/dev/raid/#에 나타납니다. 첫 번째 어레이는 [.filename]#r0#이라고 합니다. 추가 어레이가 있는 경우 [.filename]#r1#, [.filename]#r2# 등의 어레이로 명명됩니다.
ru: Устройство массива отображается в [.filename]#/dev/raid/#. Первый массив называется [.filename]#r0#. Дополнительные массивы, если они есть, будут называться [.filename]#r1#, [.filename]#r2# и так далее.

source: The BIOS menu on some of these devices can create arrays with special characters in their names. To avoid problems with those special characters, arrays are given simple numbered names like [.filename]#r0#. To show the actual labels, like [.filename]#gm0# in the example above, use man:sysctl[8]:
ko: 이러한 장치 중 일부의 BIOS 메뉴에서는 이름에 특수 문자가 포함된 어레이를 만들 수 있습니다. 이러한 특수 문자로 인한 문제를 방지하기 위해 어레이에는 [.filename]#r0#과 같은 간단한 번호가 매겨진 이름이 지정됩니다. 위 예제에서 [.filename]#gm0#과 같은 실제 레이블을 표시하려면 man:sysctl[8]을 사용합니다:
ru: В меню BIOS на некоторых из этих устройств можно создавать массивы со специальными символами в их именах. Чтобы избежать проблем с этими специальными символами, массивам присваиваются простые числовые имена, например, [.filename]#r0#. Для отображения фактических меток, таких как [.filename]#gm0# в примере выше, используйте man:sysctl[8]:

source: Multiple Volumes
ko: 다중 볼륨
ru: Несколько томов

source: Some software RAID devices support more than one _volume_ on an array. Volumes work like partitions, allowing space on the physical drives to be split and used in different ways. For example, Intel software RAID devices support two volumes. This example creates a 40 G mirror for safely storing the operating system, followed by a 20 G RAID0 (stripe) volume for fast temporary storage:
ko: 일부 소프트웨어 RAID 장치는 하나의 어레이에 둘 이상의 _볼륨_을 지원합니다. 볼륨은 파티션처럼 작동하여 물리적 드라이브의 공간을 분할하여 다른 방식으로 사용할 수 있습니다. 예를 들어, 인텔 소프트웨어 RAID 장치는 두 개의 볼륨을 지원합니다. 이 예에서는 운영 체제를 안전하게 저장하기 위해 40G 미러를 생성하고, 빠른 임시 저장공간을 위해 20G RAID0(스트라이프) 볼륨을 생성합니다:
ru: Некоторые устройства программного RAID поддерживают более одного _тома_ в массиве. Тома работают подобно разделам, позволяя разделять пространство на физических дисках и использовать его различными способами. Например, устройства программного RAID от Intel поддерживают два тома. В этом примере создаётся зеркало размером 40 ГБ для безопасного хранения операционной системы, а затем том RAID0 (чередующийся) размером 20 ГБ для быстрого временного хранения:

source: Volumes appear as additional [.filename]#rX# entries in [.filename]#/dev/raid/#. An array with two volumes will show [.filename]#r0# and [.filename]#r1#.
ko: 볼륨은 [.filename]#/dev/raid/#에 추가되어 [.filename]#rX#로 표시됩니다. 볼륨이 2개인 어레이는 [.filename]#r0# 및 [.filename]#r1#으로 표시됩니다.
ru: Тома появляются как дополнительные записи [.filename]#rX# в каталоге [.filename]#/dev/raid/#. Массив с двумя томами будет отображать [.filename]#r0# и [.filename]#r1#.

source: See man:graid[8] for the number of volumes supported by different software RAID devices.
ko: 다른 소프트웨어 RAID 장치에서 지원하는 볼륨 수는 man:graid[8]를 참조하세요.
ru: См. man:graid[8] для информации о количестве томов, поддерживаемых различными устройствами программного RAID.

source: Converting a Single Drive to a Mirror
ko: 단일 드라이브를 미러로 변환하기
ru: Преобразование одиночного диска в зеркало

source: Under certain specific conditions, it is possible to convert an existing single drive to a man:graid[8] array without reformatting. To avoid data loss during the conversion, the existing drive must meet these minimum requirements:
ko: 특정 조건에서는 기존 단일 드라이브를 다시 포맷하지 않고도 man:graid[8] 어레이로 변환할 수 있습니다. 변환하는 동안 데이터 손실을 방지하려면 기존 드라이브가 다음의 최소 요구 사항을 충족해야 합니다:
ru: При определенных условиях возможно преобразовать существующий одиночный диск в массив man:graid[8] без переформатирования. Чтобы избежать потери данных во время преобразования, существующий диск должен соответствовать следующим минимальным требованиям:

source: The drive must be partitioned with the MBR partitioning scheme. GPT or other partitioning schemes with metadata at the end of the drive will be overwritten and corrupted by the man:graid[8] metadata.
ko: 드라이브는 MBR 파티션 체계로 파티셔닝해야 합니다. 드라이브 끝에 메타데이터가 있는 GPT 또는 기타 파티셔닝 체계는 man:graid[8] 메타데이터로 덮어 씌여지며 손상됩니다.
ru: Диск должен быть размечен с использованием схемы разделов MBR. Схемы разделов GPT или другие схемы с метаданными в конце диска будут перезаписаны и повреждены метаданными man:graid[8].

source: There must be enough unpartitioned and unused space at the end of the drive to hold the man:graid[8] metadata. This metadata varies in size, but the largest occupies 64 M, so at least that much free space is recommended.
ko: 드라이브 끝에 man:graid[8] 메타데이터를 저장할 수 있는 파티션되지 않고 사용되지 않은 충분한 공간이 있어야 합니다. 이 메타데이터의 크기는 다양하지만 가장 큰 메타데이터는 64M를 차지하므로 최소한 그 정도의 여유 공간을 확보하는 것이 좋습니다.
ru: Для размещения метаданных man:graid[8] в конце диска должно быть достаточно неразмеченного и неиспользуемого пространства. Размер этих метаданных может варьироваться, но самые большие занимают 64 МБ, поэтому рекомендуется иметь как минимум столько свободного места.

source: If the drive meets these requirements, start by making a full backup. Then create a single-drive mirror with that drive:
ko: 드라이브가 이러한 요구 사항을 충족하는 경우, 먼저 전체 백업을 만드세요. 그런 다음 해당 드라이브로 단일 드라이브 미러를 만듭니다:
ru: Если диск соответствует этим требованиям, начните с создания полной резервной копии. Затем создайте зеркало с одним диском на этом диске:

source: man:graid[8] metadata was written to the end of the drive in the unused space. A second drive can now be inserted into the mirror:
ko: man:graid[8] 메타데이터가 드라이브 끝의 사용되지 않는 공간에 기록됩니다. 이제 미러에 두 번째 드라이브를 삽입할 수 있습니다:
ru: Метаданные `man:graid[8]` были записаны в конец диска в неиспользуемое пространство. Теперь можно вставить второй диск в зеркало:

source: Data from the original drive will immediately begin to be copied to the second drive. The mirror will operate in degraded status until the copy is complete.
ko: 원본 드라이브의 데이터가 즉시 두 번째 드라이브에 복사되기 시작합니다. 미러는 복사가 완료될 때까지 성능이 저하된 상태로 작동합니다.
ru: Данные с исходного диска начнут немедленно копироваться на второй диск. Зеркало будет работать в деградировавшем состоянии до завершения копирования.

source: Inserting New Drives into the Array
ko: 어레이에 새 드라이브 추가하기
ru: Добавление новых дисков к массиву

source: Drives can be inserted into an array as replacements for drives that have failed or are missing. If there are no failed or missing drives, the new drive becomes a spare. For example, inserting a new drive into a working two-drive mirror results in a two-drive mirror with one spare drive, not a three-drive mirror.
ko: 장애가 발생했거나 누락된 드라이브의 대체하기 위해 드라이브를 어레이에 추가할 수 있습니다. 실패하거나 누락된 드라이브가 없는 경우 새 드라이브가 예비 드라이브(스페어 드라이브)가 됩니다. 예를 들어, 작동 중인 2-드라이브 미러에 새 드라이브를 삽입하면 3-드라이브 미러가 아니라 예비 드라이브가 하나 있는 2-드라이브 미러가 됩니다.
ru: Диски могут быть добавлены в массив в качестве замены отказавших или отсутствующих дисков. Если нет отказавших или отсутствующих дисков, новый диск становится запасным. Например, добавление нового диска в рабочее зеркало из двух дисков приведет к зеркалу из двух дисков с одним запасным, а не к зеркалу из трех дисков.

source: In the example mirror array, data immediately begins to be copied to the newly-inserted drive. Any existing information on the new drive will be overwritten.
ko: 예제에선, 미러 어레이에 새로 삽입된 드라이브로 즉시 데이터를 복사하기 시작합니다. 새 드라이브에 있는 기존 정보는 모두 덮어쓰기됩니다.
ru: В примере зеркального массива данные сразу же начинают копироваться на только что вставленный диск. Любая существующая информация на новом диске будет перезаписана.

source: Removing Drives from the Array
ko: 어레이에서 드라이브 제거하기
ru: Удаление дисков из массива

source: Individual drives can be permanently removed from a from an array and their metadata erased:
ko: 개별 드라이브는 어레이에서 영구적으로 제거하고 해당 메타데이터를 삭제할 수 있습니다:
ru: Отдельные диски можно навсегда удалить из массива и стереть их метаданные:

source: Stopping the Array
ko: 어레이 중지하기
ru: Остановка массива

source: An array can be stopped without removing metadata from the drives. The array will be restarted when the system is booted.
ko: 드라이브에서 메타데이터를 제거하지 않고도 어레이를 중지할 수 있습니다. 시스템이 부팅되면 어레이가 다시 시작됩니다.
ru: Массив можно остановить без удаления метаданных с дисков. Массив будет перезапущен при загрузке системы.

source: Checking Array Status
ko: 어레이 상태 확인하기
ru: Проверка состояния массива

source: Array status can be checked at any time. After a drive was added to the mirror in the example above, data is being copied from the original drive to the new drive:
ko: 어레이 상태는 언제든지 확인할 수 있습니다. 위의 예에서 미러에 드라이브를 추가한 후 원본 드라이브에서 새 드라이브로 데이터가 복사되고 있습니다:
ru: Статус массива можно проверить в любое время. После добавления диска в зеркало в приведённом выше примере данные копируются с исходного диска на новый:

source: Some types of arrays, like `RAID0` or `CONCAT`, may not be shown in the status report if disks have failed. To see these partially-failed arrays, add `-ga`:
ko: `RAID0` 또는 `CONCAT`과 같은 일부 유형의 어레이는 디스크가 실패한 경우 상태 보고서에 표시되지 않을 수 있습니다. 이러한 부분적으로 실패한 어레이를 보려면 `-ga`를 추가합니다:
ru: Некоторые типы массивов, такие как `RAID0` или `CONCAT`, могут не отображаться в отчете о состоянии при выходе дисков из строя. Чтобы увидеть эти частично неработоспособные массивы, добавьте `-ga`:

source: Deleting Arrays
ko: 어레이 삭제하기
ru: Удаление массивов

source: Arrays are destroyed by deleting all of the volumes from them. When the last volume present is deleted, the array is stopped and metadata is removed from the drives:
ko: 어레이는 어레이에서 모든 볼륨을 삭제하여 파괴됩니다. 마지막으로 존재하는 볼륨이 삭제되면 어레이가 중지되고 메타데이터가 드라이브에서 제거됩니다:
ru: Массивы уничтожаются путём удаления всех томов из них. Когда удаляется последний оставшийся том, массив останавливается, а метаданные удаляются с дисков:

source: Deleting Unexpected Arrays
ko: 예기치 않은 어레이 삭제하기
ru: Удаление неожиданных массивов

source: Drives may unexpectedly contain man:graid[8] metadata, either from previous use or manufacturer testing. man:graid[8] will detect these drives and create an array, interfering with access to the individual drive. To remove the unwanted metadata:
ko: 드라이브에 이전에 사용했거나 제조업체 테스트에서 사용된 man:graid[8] 메타데이터가 포함되어 있을 수 있습니다. man:graid[8]는 이러한 드라이브를 감지하고 어레이를 생성하여 개별 드라이브에 대한 액세스를 방해합니다. 원치 않는 메타데이터를 제거하려면:
ru: Диски могут неожиданно содержать метаданные man:graid[8], оставшиеся от предыдущего использования или тестирования производителем. man:graid[8] обнаружит эти диски и создаст массив, что помешает доступу к отдельному диску. Для удаления нежелательных метаданных:

source: Boot the system. At the boot menu, select `2` for the loader prompt. Enter:
ko: 시스템을 부팅합니다. 부팅 메뉴에서 로더 프롬프트에서 `2`를 선택합니다. 엔터를 칩니다:
ru: Загрузите систему. В меню загрузки выберите `2` для перехода в приглашение загрузчика. Введите:

source: The system will boot with man:graid[8] disabled.
ko: 시스템이 man:graid[8]를 비활성화한 상태로 부팅됩니다.
ru: Система загрузится с отключенным man:graid[8].

source: Back up all data on the affected drive.
ko: 영향을 받은 드라이브의 모든 데이터를 백업하세요.
ru: Создайте резервную копию всех данных на затронутом диске.

source: As a workaround, man:graid[8] array detection can be disabled by adding
ko: 해결 방법으로 다음을 추가하여 man:graid[8] 어레이 감지를 비활성화할 수 있습니다
ru: В качестве обходного решения обнаружение массива man:graid[8] можно отключить, добавив

source: to [.filename]#/boot/loader.conf#.
ko: [.filename]#/boot/loader.conf#에서.
ru: в файл [.filename]#/boot/loader.conf#.

source: To permanently remove the man:graid[8] metadata from the affected drive, boot a FreeBSD installation CD-ROM or memory stick, and select `Shell`. Use `status` to find the name of the array, typically `raid/r0`:
ko: 영향을 받은 드라이브에서 man:graid[8] 메타데이터를 영구적으로 제거하려면, FreeBSD 설치 CD-ROM 또는 메모리 스틱으로 부팅하고 `Shell`을 선택합니다. `status`를 사용하여 어레이의 이름(일반적으로 `raid/r0`)을 찾습니다:
ru: Для постоянного удаления метаданных man:graid[8] с затронутого диска загрузитесь с установочного CD-ROM или USB-накопителя FreeBSD и выберите `Shell`. Используйте команду `status`, чтобы найти имя массива, обычно это `raid/r0`:

source: Delete the volume by name:
ko: 이름을 이용해 볼륨을 삭제합니다:
ru: Удалите том по имени:

source: If there is more than one volume shown, repeat the process for each volume. After the last array has been deleted, the volume will be destroyed.
ko: 표시된 볼륨이 두 개 이상인 경우 각 볼륨에 대해 이 과정을 반복합니다. 마지막 어레이가 삭제되면 볼륨이 삭제됩니다.
ru: Если отображается более одного тома, повторите процесс для каждого тома. После удаления последнего массива том будет уничтожен.
