Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/nanobsd/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: créditos de traducción
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Mauro Risonho de Paula Assumpção, mauro.risonho@gmail.com, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: Introduction to NanoBSD
es_es: Introducción a NanoBSD
pt_br: Introdução ao NanoBSD

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
es_es: FreeBSD es una marca registrada de FreeBSD Foundation.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
es_es: Muchas de las designaciones usadas por fabricantes y vendedores para vender sus productos son reclamadas como marcas. En aquellos lugares donde dichas designaciones aparecen en este documento y el proyecto FreeBSD estaba al tanto de los reclamos de marcas, dichas designaciones están acompañadas de los símbolos <quote>™</quote> o <quote>®</quote>.

source: This document provides information about the <application>NanoBSD</application> tools, which can be used to create FreeBSD system images for embedded applications, suitable for use on a Compact Flash card (or other mass storage medium).
es_es: Este documento provee información acerca de las herramientas <application>NanoBSD</application>, las cuales pueden ser usadas para crear imágenes del sistema de FreeBSD para aplicaciones embebidas, adecuadas para ser usadas en una tarjeta Compact Flash (o cualquier otro medio de almacenamiento masivo).
pt_br: Este documento fornece informações sobre as ferramentas <application>NanoBSD</application>, que podem ser usadas para criar imagens do sistema FreeBSD para aplicativos embarcados, adequadas para uso em um cartão Compact Flash (ou outro meio de armazenamento em massa).

source: <application>NanoBSD</application> is a tool currently developed by Poul-Henning Kamp <email>phk@FreeBSD.org</email>. It creates a FreeBSD system image for embedded applications, suitable for use on a Compact Flash card (or other mass storage medium).
es_es: <application>NanoBSD</application> es una herramienta actualmente desarrollada por Poul-Henning Kamp <email>phk@FreeBSD.org</email>. Crea una imagen del sistema de FreeBSD para aplicaciones embebidas, adecuada para ser usada en una tarjeta Compact Flash (o cualquier otro medio de almacenamiento masivo).
pt_br: O <application>NanoBSD</application> é uma ferramenta atualmente desenvolvida por Poul-Henning Kamp <email>phk@FreeBSD.org</email>. Ele cria uma imagem do sistema FreeBSD para aplicativos embarcados, adequada para uso em um cartão Compact Flash (ou outro meio de armazenamento em massa).

source: It can be used to build specialized install images, designed for easy installation and maintenance of systems commonly called <quote>computer appliances</quote>. Computer appliances have their hardware and software bundled in the product, which means all applications are pre-installed. The appliance is plugged into an existing network and can begin working (almost) immediately.
es_es: Puede usarse para crear imágenes de instalación especializadas, diseñadas para instalar y mantener sistemas comúnmente llamados <quote>aparatos de computación</quote>. Los aparatos de computación incluyen el hardware y software en el mismo producto, lo cual significa que todas las aplicaciones vienen preinstaladas. El aparato se conecta a una red existente y puede comenzar a funcionar (casi) de inmediato.
pt_br: Ele pode ser usado para construir imagens de instalação especializadas, projetadas para fácil instalação e manutenção de sistemas comumente chamados de <quote>appliances</quote>. Os appliances têm seu hardware e software agrupados no produto, o que significa que todos os aplicativos são pré-instalados. O appliance é conectado a uma rede existente e pode começar a funcionar (quase) imediatamente.

source: The features of <application>NanoBSD</application> include:
es_es: Las características de <application>NanoBSD</application> incluyen:
pt_br: Os recursos do <application>NanoBSD</application> incluem:

source: Ports and packages work as in FreeBSD — Every single application can be installed and used in a <application>NanoBSD</application> image, the same way as in FreeBSD.
es_es: Los ports y packages funcionan de la misma manera que en FreeBSD — Cada aplicación puede ser instalada y usada en una imagen de <application>NanoBSD</application>, de la misma manera que en FreeBSD.
pt_br: Os Ports e os pacotes funcionam como no FreeBSD - Cada aplicativo pode ser instalado e usado em uma imagem do <application>NanoBSD</application>, da mesma forma que no FreeBSD.

source: No missing functionality — If it is possible to do something with FreeBSD, it is possible to do the same thing with <application>NanoBSD</application>, unless the specific feature or features were explicitly removed from the <application>NanoBSD</application> image when it was created.
es_es: No hay perdida de funcionalidad — Si era posible hacer algo con FreeBSD, también será posible hacerlo con <application>NanoBSD</application>, a menos que esa característica específica haya sido removida de la imagen de <application>NanoBSD</application> cuando fue creada.
pt_br: Nenhuma funcionalidade ausente - Se é possível fazer algo com o FreeBSD, é possível fazer a mesma coisa com o <application>NanoBSD</application>, a menos que o recurso ou os recursos específicos sejam explicitamente removidos do <application>NanoBSD</application> quando a imagem foi criada.

source: Everything is read-only at run-time — It is safe to pull the power-plug. There is no necessity to run <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> after a non-graceful shutdown of the system.
es_es: Todo es de solo lectura en tiempo de ejecución — Es seguro desconectar el cable. No hay necesidad de ejecutar <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> después de que el sistema se apague de manera brusca.
pt_br: Todo o sistema opera em modo read-only em tempo de execução - É seguro puxar o plugue de alimentação. Não há necessidade de executar <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> após um desligamento abrupto do sistema.

source: Easy to build and customize — Making use of just one shell script and one configuration file it is possible to build reduced and customized images satisfying any arbitrary set of requirements.
es_es: Es fácil de crear y personalizar — Haciendo uso de un único script y solamente un archivo de configuración, es posible crear imágenes reducidas y personalizadas para satisfacer un conjunto arbitrario de requisitos.
pt_br: É fácil de criar e personalizar - Usando apenas um script de shell e um arquivo de configuração, é possível criar imagens reduzidas e personalizadas, satisfazendo qualquer conjunto arbitrário de requisitos.

source: NanoBSD Howto
es_es: NanoBSD Paso a Paso

source: The Design of NanoBSD
es_es: El diseño de NanoBSD
pt_br: O Design do NanoBSD

source: Once the image is present on the medium, it is possible to boot <application>NanoBSD</application>. The mass storage medium is divided into three parts by default:
es_es: Una vez que la imagen se encuentra presente en el medio es posible arrancar <application>NanoBSD</application>. El medio de almacenamiento masivo está dividido en tres partes por defecto:
pt_br: Quando a imagem estiver presente na midia, é possível inicializar o <application>NanoBSD</application>. O meio de armazenamento em massa é dividido em três partes por padrão:

source: Two image partitions: <literal>code#1</literal> and <literal>code#2</literal>.
es_es: Dos particiones de imagen: <literal>code#1</literal> y <literal>code#2</literal>.
pt_br: Duas partições de imagem: <literal>code#1</literal> e <literal>code#2</literal>.

source: The configuration file partition, which can be mounted under the <filename>/cfg</filename> directory at run time.
es_es: La partición del archivo de configuración, la cual puede ser montada bajo el directorio <filename>/cfg</filename> en tiempo de ejecución.
pt_br: A partição do arquivo de configuração, que pode ser montada no diretório <filename>/cfg</filename> em tempo de execução.

source: These partitions are normally mounted read-only.
es_es: Estas particiones normalmente se montan como de solo lectura.
pt_br: Essas partições são normalmente montadas em modo read-only (somente leitura).

source: The <filename>/etc</filename> and <filename>/var</filename> directories are <citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry> (malloc) disks.
es_es: Los directorios <filename>/etc</filename> y <filename>/var</filename> son discos <citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry> (malloc).
pt_br: Os diretórios <filename>/etc</filename> e <filename>/var</filename> são discos criados em memória (malloc) pelo comando <citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry>.

source: The configuration file partition persists under the <filename>/cfg</filename> directory. It contains files for <filename>/etc</filename> directory and is briefly mounted read-only right after the system boot, therefore it is required to copy modified files from <filename>/etc</filename> back to the <filename>/cfg</filename> directory if changes are expected to persist after the system restarts.
es_es: La partición del archivo de configuración reside en el directorio <filename>/cfg</filename>. Contiene archivos para el directorio <filename>/etc</filename> y es montada brevemente como una partición de solo lectura tras el arranque del sistema; por consiguiente, es necesaria para copiar archivos modificados desde <filename>/etc</filename> de vuelta hacia el directorio <filename>/cfg</filename> si se espera que los cambios persistan después de reiniciar el sistema.
pt_br: A partição do arquivo de configuração persiste no diretório <filename>/cfg</filename>. Ele contém arquivos para o diretório <filename>/etc</filename> e é brevemente montado como read-only logo após a inicialização do sistema, portanto é necessário copiar os arquivos modificados de <filename>/etc</filename> de volta para o <filename>/cfg</filename> se as alterações precisarem ser mantidas após a reinicialização do sistema.

source: Making Persistent Changes to <filename>/etc/resolv.conf</filename>
es_es: Hacer Modificaciones Persistentes de <filename>/etc/resolv.conf</filename>
pt_br: Fazendo Mudanças Persistentes no <filename>/etc/resolv.conf</filename>

source: The partition containing <filename>/cfg</filename> should be mounted only at boot time and while overriding the configuration files.
es_es: La partición que contiene <filename>/cfg</filename> debería ser montada solo en el arranque y cuando se sustituyan las directivas de los archivos de configuración.
pt_br: A partição que contém o <filename>/cfg</filename> deve ser montada somente no momento da inicialização ou quando for preciso sobrescrever os arquivos de configuração.

source: Keeping <filename>/cfg</filename> mounted at all times is not a good idea, especially if the <application>NanoBSD</application> system runs off a mass storage medium that may be adversely affected by a large number of writes to the partition (like when the filesystem syncer flushes data to the system disks).
es_es: Mantener <filename>/cfg</filename> montado todo el tiempo no es una buena idea, especialmente si el sistema <application>NanoBSD</application> se ejecuta en un medio de almacenamiento masivo que puede ser afectado negativamente por un número alto de escrituras a la partición (como cuando el sincronizador del sistema de archivos vuelca los datos hacia los discos del sistema).
pt_br: Manter o <filename>/cfg</filename> montado o tempo todo não é uma boa ideia, especialmente se o sistema <application>NanoBSD</application> for executado em um meio de armazenamento em massa que pode ser afetado negativamente por um grande número de gravações na partição (como quando o sistema de arquivos sincroniza os dados para os discos do sistema).

source: Building a NanoBSD Image
es_es: Compilar una imagen de NanoBSD
pt_br: Construindo uma imagem NanoBSD

source: A <application>NanoBSD</application> image is built using a simple <filename>nanobsd.sh</filename> shell script, which can be found in the <filename><replaceable>/usr</replaceable>/src/tools/tools/nanobsd</filename> directory. This script creates an image, which can be copied on the storage medium using the <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry> utility.
es_es: Una imagen de <application>NanoBSD</application> se compila usando un simple script de shell <filename>nanobsd.sh</filename>, que se encuentra en el directorio <filename><replaceable>/usr</replaceable>/src/tools/tools/nanobsd</filename>. Este script crea una imagen, que puede ser copiada al medio de almacenamiento usando la utilidad <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Uma imagem <application>NanoBSD</application> é construída usando um simples shell script <filename>nanobsd.sh</filename>, que pode ser encontrado no diretório <filename><replaceable>/usr</replaceable>/src/tools/tools/nanobsd</filename>. Este script cria uma imagem, que pode ser copiada no meio de armazenamento usando o utilitário <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: The necessary commands to build a <application>NanoBSD</application> image are:
es_es: Los comandos necesarios para compilar una imagen de <application>NanoBSD</application> son:
pt_br: Os comandos necessários para construir uma imagem <application>NanoBSD</application> são:

source: Change the current directory to the base directory of the <application>NanoBSD</application> build script.
es_es: Cambie el directorio actual al directorio base del script de compilación de <application>NanoBSD</application>.
pt_br: Altere o diretório atual para o diretório base do script de construção do <application>NanoBSD</application>.

source: Start the build process.
es_es: Comienze el proceso de compilación.
pt_br: Comece o processo de construção.

source: Change the current directory to the place where the built images are located.
es_es: Cambie el directorio actual por el lugar en donde se encuentren las imágenes compiladas.
pt_br: Altere o diretório atual para o local onde as imagens construídas estão localizadas.

source: Install <application>NanoBSD</application> onto the storage medium.
es_es: Instale <application>NanoBSD</application> en el medio de almacenamiento.
pt_br: Instale o <application>NanoBSD</application> no meio de armazenamento.

source: Customizing a NanoBSD Image
es_es: Personalizar una imagen de NanoBSD
pt_br: Personalizando uma imagem NanoBSD

source: This is probably the most important and most interesting feature of <application>NanoBSD</application>. This is also where you will be spending most of the time when developing with <application>NanoBSD</application>.
es_es: Esta es probablemente la característica más importante y más interesante de <application>NanoBSD</application>. También es la que le llevará más tiempo cuando se encuentre desarrollando con <application>NanoBSD</application>.
pt_br: Este é provavelmente o recurso mais importante e interessante do <application>NanoBSD</application>. Este também é o lugar onde você passará a maior parte do tempo desenvolvendo com o <application>NanoBSD</application>.

source: Invocation of the following command will force the <filename>nanobsd.sh</filename> to read its configuration from <filename>myconf.nano</filename> located in the current directory:
es_es: Invocar el siguiente comando forzará a <filename>nanobsd.sh</filename> a leer su configuración desde el archivo <filename>myconf.nano</filename> localizado en el directorio actual:
pt_br: A execução do seguinte comando forçará o <filename>nanobsd.sh</filename> a ler sua configuração do <filename>myconf.nano</filename> localizado no diretório atual:

source: Customization is done in two ways:
es_es: La personalización puede hacerse de dos maneras:
pt_br: A personalização é feita de duas maneiras:

source: Configuration options
es_es: Opciones de configuración
pt_br: Opções de configuração

source: Custom functions
es_es: Funciones personalizadas
pt_br: Funções personalizadas

source: Configuration Options
es_es: Opciones de configuración
pt_br: Opções de configuração

source: With configuration settings, it is possible to configure options passed to both the <_:buildtarget-1/> and <_:buildtarget-2/> stages of the <application>NanoBSD</application> build process, as well as internal options passed to the main build process of <application>NanoBSD</application>. Through these options it is possible to cut the system down, so it will fit on as little as 64MB. You can use the configuration options to trim down FreeBSD even more, until it will consists of just the kernel and two or three files in the userland.
es_es: Con las preferencias de configuración, es posible configurar las opciones pasadas a las etapas <_:buildtarget-1/> y <_:buildtarget-2/> del proceso de compilación de <application>NanoBSD</application>, así como también opciones internas pasadas al proceso de compilación principal de <application>NanoBSD</application>. A través de estas opciones es posible achicar el sistema, para que pueda caber en un espacio tan pequeño como 64MB. Pude utilizar estas opciones de configuración para reducir el tamaño de FreeBSD aun más, hasta que consista únicamente del kernel y dos o tres archivos en espacio de usuario.
pt_br: Com as definições de configuração, é possível configurar as opções passadas tanto para o estágio <_:buildtarget-1/> quando para o <_:buildtarget-2/> do processo de construção do <application>NanoBSD</application>, bem como opções internas passadas para o processo principal de construção do <application>NanoBSD</application>. Através destas opções, é possível reduzir o sistema para que ele caiba, por exemplo, em um cartão de memória de 64 MB. Você pode usar as opções de configuração para reduzir ainda mais o FreeBSD, até que ele consista apenas no kernel e em dois ou três arquivos na área de usuário.

source: The configuration file consists of configuration options, which override the default values. The most important directives are:
es_es: El archivo de configuración consiste en opciones de configuración que sobreescriben los valores por defecto. Las directivas más importantes son:
pt_br: O arquivo de configuração consiste em opções de configuração, que substituem os valores padrões. As diretivas mais importantes são:

source: <literal>NANO_NAME</literal> — Name of build (used to construct the workdir names).
es_es: <literal>NANO_NAME</literal> — Nombre de la compilación (utilizada para crear los nombres de los directorios de trabajo).
pt_br: <literal>NANO_NAME</literal> - Nome da compilação (usada para construir os nomes do diretório de trabalho).

source: <literal>NANO_SRC</literal> — Path to the source tree used to build the image.
es_es: <literal>NANO_SRC</literal>. Ruta al archivo fuente utilizada para compilar la imagen.
pt_br: <literal>NANO_SRC</literal> - Caminho para o diretório com o código fonte que será utilizado na construção da imagem.

source: <literal>NANO_KERNEL</literal> — Name of kernel configuration file used to build kernel.
es_es: <literal>NANO_KERNEL</literal> — Nombre del archivo de configuración del kernel utilizado para compilar el kernel.
pt_br: <literal>NANO_KERNEL</literal> - Nome do arquivo de configuração do kernel usado para construir o kernel.

source: <literal>CONF_BUILD</literal> — Options passed to the <_:buildtarget-1/> stage of the build.
es_es: <literal>CONF_BUILD</literal> — Opciones pasadas a la etapa <_:buildtarget-1/> del proceso de compilación.
pt_br: <literal>CONF_BUILD</literal> - Opções passadas para o estágio <_:buildtarget-1/> da compilação.

source: <literal>CONF_INSTALL</literal> — Options passed to the <_:buildtarget-1/> stage of the build.
es_es: <literal>CONF_INSTALL</literal> — Opciones pasadas a la etapa <_:buildtarget-1/> del proceso de compilación.
pt_br: <literal>CONF_INSTALL</literal> - Opções passadas para o estágio <_:buildtarget-1/> da compilação.

source: <literal>CONF_WORLD</literal> — Options passed to both the <_:buildtarget-1/> and the <_:buildtarget-2/> stage of the build.
es_es: <literal>CONF_WORLD</literal> — Opciones pasadas a las etapas <_:buildtarget-1/> y <_:buildtarget-2/> del proceso de compilación.
pt_br: <literal>CONF_WORLD</literal> - Opções passadas para o estágio <_:buildtarget-1/> e o <_:buildtarget-2/> da compilação.

source: <literal>FlashDevice</literal> — Defines what type of media to use. Check <filename>FlashDevice.sub</filename> for more details.
es_es: <literal>FlashDevice</literal> — Define el tipo de medio que se usará. Consulte <filename>FlashDevice.sub</filename> para más detalles.
pt_br: <literal>FlashDevice</literal> - define o tipo de mídia a ser usado. Verifique o <filename>FlashDevice.sub</filename> para mais detalhes.

source: Custom Functions
es_es: Funciones personalizadas
pt_br: Funções Personalizadas

source: It is possible to fine-tune <application>NanoBSD</application> using shell functions in the configuration file. The following example illustrates the basic model of custom functions:
es_es: Es posible configurar cada aspecto de <application>NanoBSD</application> utilizando funciones del shell en el archivo de configuración. El siguiente ejemplo ilustra el modelo básico de funciones personalizadas:
pt_br: É possível ajustar o <application>NanoBSD</application> usando as funções do shell no arquivo de configuração. O exemplo a seguir ilustra o modelo básico de funções personalizadas:

source: A more useful example of a customization function is the following, which changes the default size of the <filename>/etc</filename> directory from 5MB to 30MB:
es_es: Un ejemplo más útil de una función de personalización es el siguiente, el cual cambia el tamaño por defecto del directorio <filename>/etc</filename> de 5MB a 30MB:
pt_br: Um exemplo mais útil de uma função de customização é o seguinte, o qual altera o tamanho padrão do diretório <filename>/etc</filename> de 5MB para 30MB:

source: There are a few default pre-defined customization functions ready for use:
es_es: Estas son algunas funciones de personalización incluidas por defecto y listas para ser usadas:
pt_br: Existem algumas funções de customização pré-definidas por padrão e prontas para uso:

source: <literal>cust_comconsole</literal> — Disables <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> on the VGA devices (the <filename>/dev/ttyv*</filename> device nodes) and enables the use of the COM1 serial port as the system console.
es_es: <literal>cust_comconsole</literal> — Deshabilita <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> en los dispositivos VGA (los nodos de dispositivo <filename>/dev/ttyv*</filename>) y habilita el uso del puerto en serie COM1 como la consola del sistema.
pt_br: <literal>cust_comconsole</literal> — Desabilita o <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> nos dispositivos VGA (os device nodes <filename>/dev/ttyv*</filename>) e habilita o uso do console do sistema na serial COM1.
