Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/nanobsd/*.po
Languages: es_es, pt_br

source: <literal>cust_allow_ssh_root</literal> — Allow <systemitem class="username">root</systemitem> to login via <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: <literal>cust_allow_ssh_root</literal> — Permite que <systemitem class="username">root</systemitem> se autentique mediante <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: <literal>cust_allow_ssh_root</literal> — Permite que o <systemitem class="username">root</systemitem> faça o login via <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: <literal>cust_install_files</literal> — Installs files from the <filename>nanobsd/Files</filename> directory, which contains some useful scripts for system administration.
es_es: <literal>cust_install_files</literal> — Instala archivos desde el directorio <filename>nanobsd/Files</filename>, el cual contiene algunos scripts útiles para la administración del sistema.
pt_br: <literal>cust_install_files</literal> — Instala arquivos do diretório <filename>nanobsd/Files</filename>, que contém alguns scripts úteis para administração do sistema.

source: Adding Packages
es_es: Agregando Packages
pt_br: Adicionando Pacotes

source: Packages can be added to a <application>NanoBSD</application> image using a custom function. The following function will install all the packages located in <filename>/usr/src/tools/tools/nanobsd/packages</filename>:
es_es: Pueden agregarse packages a la imagen de <application>NanoBSD</application> utilizando una funcion personalizada. La siguiente función instalará todos los paquetes situdados en <filename>/usr/src/tools/tools/nanobsd/packages</filename>:
pt_br: Pacotes podem ser adicionados a uma imagem <application>NanoBSD</application> usando uma função customizada. A seguinte função irá instalar todos os pacotes localizados em <filename>/usr/src/files/tools/nanobsd/packages</filename>:

source: Configuration File Example
es_es: EJemplo de archivo de Configuración
pt_br: Exemplo do arquivo de configuração

source: A complete example of a configuration file for building a custom <application>NanoBSD</application> image can be:
es_es: Un ejemplo completo de un archivo de configuración para crear una imagen personalizada de <application>NanoBSD</application> podría ser:
pt_br: Um exemplo completo de um arquivo de configuração para criar uma imagem <application>NanoBSD</application> personalizada pode ser:

source: Updating NanoBSD
es_es: Actualizar NanoBSD
pt_br: Atualizando o NanoBSD

source: The update process of <application>NanoBSD</application> is relatively simple:
es_es: El proceso de actualización de <application>NanoBSD</application> es relativamente simple:
pt_br: O processo de atualização do <application>NanoBSD</application> é relativamente simples:

source: Build a new <application>NanoBSD</application> image, as usual.
es_es: Compile una nueva imagen de <application>NanoBSD</application>, como de costumbre.
pt_br: Crie uma nova imagem <application>NanoBSD</application>, como de costume.

source: Upload the new image into an unused partition of a running <application>NanoBSD</application> appliance.
es_es: Suba la nueva imagen a una partición sin usar de un aparato <application>NanoBSD</application> que se encuentre en ejecución.
pt_br: Carregue a nova imagem em uma partição não usada de um dispositivo <application>NanoBSD</application> em execução.

source: The most important difference of this step from the initial <application>NanoBSD</application> installation is that now instead of using <filename>_.disk.full</filename> (which contains an image of the entire disk), the <filename>_.disk.image</filename> image is installed (which contains an image of a single system partition).
es_es: La diferencia más importante entre este paso y la instalación inicial de <application>NanoBSD</application> es que ahora, en lugar de usar <filename>_.disk.full</filename> (que contiene la imagen completa del disco), se instala la imagen <filename>_.disk.image</filename> (la cual contiene la imagen de una sola partición del sistema).
pt_br: A diferença mais importante deste passo da instalação inicial do <application>NanoBSD</application> é que agora, em vez de usar <filename>_. Disk.full</filename> (que contém uma imagem do disco todo), a imagem <filename>_.disk.image</filename> está instalada (a qual contém uma imagem de uma única partição do sistema).

source: Reboot, and start the system from the newly installed partition.
es_es: Reinicie y arranque el sistema desde la partición recientemente instalada.
pt_br: Reinicie e inicie o sistema a partir da partição recém-instalada.

source: If all goes well, the upgrade is finished.
es_es: Si todo terminó correctamente, la actualización habrá finalizado.
pt_br: Se tudo correr bem, a atualização está concluída.

source: If anything goes wrong, reboot back into the previous partition (which contains the old, working image), to restore system functionality as fast as possible. Fix any problems of the new build, and repeat the process.
es_es: Si algo sale mal, reinicie en la partición anterior (que contiene la antigua imagen que funciona correctamente), para restaurar la funcionalidad del sistema tan rápido como sea posible. Arregle los problemas de la nueva imagen y repita el proceso.
pt_br: Se algo der errado, reinicie a partição anterior (que contém a imagem antiga que estava em funcionamento) para restaurar a funcionalidade do sistema o mais rápido possível. Corrija quaisquer problemas da nova compilação e repita o processo.

source: To install new image onto the running <application>NanoBSD</application> system, it is possible to use either the <filename>updatep1</filename> or <filename>updatep2</filename> script located in the <filename>/root</filename> directory, depending from which partition is running the current system.
es_es: Para instalar la nueva imagen en el sistema <application>NanoBSD</application> actual, es posible usar los scripts <filename>updatep1</filename> o <filename>updatep2</filename> que se encuentran en el directorio <filename>/root</filename>, dependiendo de la partición desde la que esté ejecutando el sistema actual.
pt_br: Para instalar uma nova imagem no sistema <application>NanoBSD</application>, é possível usar o script <filename>updatep1</filename> ou <filename>updatep2</filename> localizado no diretório <filename>/root</filename>, dependendo de qual partição o sistema atual está executando.

source: According to which services are available on host serving new <application>NanoBSD</application> image and what type of transfer is preferred, it is possible to examine one of these three ways:
es_es: Según que servicios que se encuentren disponibles en el huésped sirviendo la nueva imagen <application>NanoBSD</application> y el tipo de transferencia que se prefiera, es posible utilizar uno de estos tres métodos:
pt_br: De acordo com os serviços que estiverem disponíveis no servidor que contem a nova imagem <application>NanoBSD</application> e o tipo de transferência preferido, é possível seguir por uma destas três maneiras:

source: Using <citerefentry><refentrytitle>ftp</refentrytitle><manvolnum>1</manvolnum></citerefentry>
es_es: Usando <citerefentry><refentrytitle>ftp</refentrytitle><manvolnum>1</manvolnum></citerefentry>
pt_br: Usando <citerefentry><refentrytitle>ftp</refentrytitle><manvolnum>1</manvolnum></citerefentry>

source: If the transfer speed is in first place, use this example:
es_es: Si la velocidad de transferencia es una prioridad para usted, utilice este ejemplo:
pt_br: Se a velocidade de transferência estiver em primeiro lugar, use este exemplo:

source: Using <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>
es_es: Usando <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>
pt_br: Usando <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>

source: If a secure transfer is preferred, consider using this example:
es_es: Si prefiere una transferencia segura, considere usar este ejemplo:
pt_br: Se uma transferência segura for preferida, considere usar este exemplo:

source: Using <citerefentry><refentrytitle>nc</refentrytitle><manvolnum>1</manvolnum></citerefentry>
es_es: Usando <citerefentry><refentrytitle>nc</refentrytitle><manvolnum>1</manvolnum></citerefentry>
pt_br: Usando <citerefentry><refentrytitle>nc</refentrytitle><manvolnum>1</manvolnum></citerefentry>

source: Try this example if the remote host is not running neither <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> or <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> service:
es_es: Puede utilizar este ejemplo si el huésped remoto no está ejecutando los servicios <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> o <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>:
pt_br: Tente este exemplo se o host remoto que contem a nova imagem não estiver executando o serviço <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> e nem o serviço <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum> </citerefentry> :

source: At first, open a TCP listener on host serving the image and make it send the image to client:
es_es: En primer lugar, abra un puerto TCP en el huésped que se encuentra sirviendo la imagen y haga que envíe la imagen al cliente:
pt_br: Primeiramente, abra um socket TCP em modo escuta no host que serve a imagem e envie a imagem para o cliente:

source: Make sure that the used port is not blocked to receive incoming connections from <application>NanoBSD</application> host by firewall.
es_es: Asegúrese de que el puerto usado no esté bloqueado para recibir conexiones entrantes del huésped <application>NanoBSD</application> por el firewall.
pt_br: Certifique-se de que a porta usada não esteja bloqueada para receber conexões de entrada do host <application>NanoBSD</application> pelo firewall.

source: Connect to the host serving new image and execute <filename>updatep1</filename> script:
es_es: Conéctese al huésped sirviendo la nueva imagen y ejecute el script <filename>updatep1</filename>:
pt_br: Conecte-se ao host que está servindo a nova imagem e execute o script <filename>updatep1</filename>:

source: <year>2006</year> <holder>The FreeBSD Documentation Project</holder>
pt_br: <year>2006</year> <holder>Projeto de Documentação do FreeBSD</holder>
