freebsd/freebsd-doc/documentation/manual-pages/ja/man8/accton.8
.\" %FreeBSD: src/usr.sbin/accton/accton.8,v 1.13 2004/04/16 09:31:17 brueffer Exp %
.\"
.\" $FreeBSD$
.Dd May 21, 1993
.Dt ACCTON 8
.Os
.Sh 名称
.Nm accton
.Nd システムのアカウンティングの許可/禁止
.Sh 書式
.Nm
.Op Ar acctfile
.Sh 解説
.Nm
ユーティリティはシステムのアカウンティングのオン/オフを切り換えます。
もし
.Ar acctfile
引数を付けて呼び出された場合、
システムのアカウンティングが許可されます。
指定された
.Ar acctfile
は、システムのアカウンティングが開始される前に存在していなければなりません。
存在しない場合には
.Nm
はエラーを返します。
.Xr execve 2
システムコールで開始され、その後終了した
全てのプロセスの記録が
.Ar acctfile
ファイルに格納されます。
.Xr sa 8
コマンドがアカウンティング記録の検査に使われるかもしれません。
もし引数が与えられなかった場合、システムアカウンティングは禁止されます。
.Sh 関連ファイル
.Bl -tag -width /var/account/acct
.It Pa /var/account/acct
デフォルトのアカウンティングファイル
.El
.Sh 関連項目
.Xr lastcomm 1 ,
.Xr acct 2 ,
.Xr acct 5 ,
.Xr sa 8
