freebsd/freebsd-doc/documentation/manual-pages/ja/man8/chown.8
.\" Copyright (c) 1990, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)chown.8	8.3 (Berkeley) 3/31/94
.\" %FreeBSD: src/usr.sbin/chown/chown.8,v 1.23 2004/08/07 04:19:37 imp Exp %
.\"
.\" $FreeBSD$
.\"
.Dd April 25, 2003
.Dt CHOWN 8
.Os
.Sh 名称
.Nm chown
.Nd 指定したファイルの所有者およびグループを変更する
.Sh 書式
.Nm
.Op Fl fhv
.Oo
.Fl R
.Op Fl H | Fl L | Fl P
.Oc
.Ar owner Ns Op : Ns Ar group
.Ar
.Nm
.Op Fl fhv
.Oo
.Fl R
.Op Fl H | Fl L | Fl P
.Oc
.No : Ns Ar group
.Ar
.Sh 解説
.Nm
ユーティリティは、指定したファイルのユーザ ID やグループ ID を変更します。
引数で指定されるシンボリックリンクは、
.Fl h
が指定されない限りは、何も表示せずに無変更のままとなります。
.Pp
オプションは以下のものがあります:
.Bl -tag -width Ds
.It Fl H
.Fl R
オプションが指定されている場合に、コマンドライン上の
シンボリックリンクをたどるようになります。
( ツリー内をたどっている際中に見つけたシンボリックリンクの先は
調べません。)
.It Fl L
.Fl R
オプションが指定された場合に、全てのシンボリックリンクを
たどるようになります。
.It Fl P
.Fl R
オプションが指定された場合に、シンボリックリンクの先を
たどらないようになります。
これがデフォルトです。
.It Fl R
指定したディレクトリツリーのファイルのユーザ ID やグループ ID を
(再帰的に、ディレクトリ内のものを含め)
変更します。
.Dq Li ".*"
のようなワイルドカードを使用するときには、
親ディレクトリへのハードリンク
.Dq Pa ".."
が意図に反してマッチしないように注意してください。
.It Fl f
所有者やグループの変更が失敗しても報告を行ないません。
変更の失敗は戻り値にも影響しません。
.It Fl h
ファイルがシンボリックリンクの場合、
リンク自身のユーザ ID および/またはグループ ID
を変更します。
.It Fl v
.Nm
を冗長にし、所有者が修正されるファイルを表示させます。
.Fl v
フラグが複数回指定されると、
.Nm
は、ファイル名に続けて、
古い数値ユーザ/グループ ID と新しい数値ユーザ/グループ ID を
表示します。
.El
.Pp
.Fl H ,
.Fl L ,
.Fl P
のオプションは
.Fl R
が指定されない限り無視されます。
加えて、これらのオプションはお互いの効果を上書きするため、
コマンドの動作は最後に指定されたもので決まります。
.Pp
.Ar owner
と
.Ar group
のオペランドはどちらも無くてもよいもの (optional) ですが、
少なくともどちらかを指定しなければなりません。
.Ar group
オペランドを指定した場合は
先頭にコロン (``:'') をつけて下さい。
.Pp
.Ar owner
は ユーザ ID の数値かユーザ名のどちらかです。ユーザ名がユーザ ID
の数値でもある場合、このオペランドはユーザ名とみなされます。
.Ar group
は
グループ ID の数値かグループ名のどちらかです。グループ名がグループ ID
の数値でもある場合、このオペランドはグループ名とみなされます。
.Pp
セキュリティの関係上明らかなことですが、ファイルの所有者の変更はスーパユーザ
にしか行なうことができません。
.Sh 診断
.Ex -std
.Sh 互換性
.Nm
の以前のバージョンは、グループ名を指定するのにドット (``.'') を
用いていました。
この文字はコロン (``:'') に変更されたため、
ユーザ名やグループ名にドットを含んでも構いません。
.Pp
以前のバージョンのシステムでは、シンボリックリンクは所有者がありませんでした。
.Pp
.Fl v
オプションは非標準ですので、スクリプト中での使用は勧められません。
.Sh 関連項目
.Xr chgrp 1 ,
.Xr find 1 ,
.Xr chown 2 ,
.Xr fts 3 ,
.Xr symlink 7
.Sh 規格
.Nm
ユーティリティは
.St -p1003.2
互換であると考えられています。
.Sh 歴史
.Nm
ユーティリティは
.At v1
から導入されました。
