freebsd/freebsd-doc/documentation/manual-pages/ja/man8/devinfo.8
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2002 Hiten Pandya
.\" Copyright (c) 2002 Robert N. M. Watson
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/devinfo/devinfo.8,v 1.6 2002/09/20 02:26:58 imp Exp %
.\"
.\" $FreeBSD$
.Dd May 10, 2002
.Os
.Dt DEVINFO 8
.Sh 名称
.Nm devinfo
.Nd システムのデバイス設定に関する情報表示
.Sh 書式
.Nm
.Op Fl ruv
.Sh 解説
.Nm
ユーティリティは、引数を指定しないと、
システム上で使用可能なデバイスの階層を
.Dq nexus
デバイスから開始して表示します。
.Pp
次のオプションが受け付けられます。
.Bl -tag -width indent
.It Fl r
ハードウェア資源情報
(IRQ や、I/O ポートや、I/O メモリアドレスなど) も、
それらを予約したデバイスの下に列挙します。
.It Fl u
.Fl r
で表示されるものと同じ情報を表示しますが、
デバイスではなく資源タイプによってソートし、
システム資源の使用状況や使用可能なものが分かり易くします。
すなわち、IRQ 使用者をまとめて表示します。
.It Fl v
アタッチ済や使用中のデバイスに限らず、
ドライバツリー中のすべてのデバイスを表示します。
このフラグを指定しないと、アタッチ済のデバイスのみが報告されます。
.El
.Sh 関連項目
.Xr systat 1 ,
.Xr devinfo 3 ,
.Xr iostat 8 ,
.Xr pciconf 8 ,
.Xr pnpinfo 8 ,
.Xr vmstat 8
.Sh 作者
.An Mike Smith Aq msmith@FreeBSD.org
