freebsd/freebsd-doc/documentation/manual-pages/ja/man8/extattrctl.8
.\"-
.\" Copyright (c) 2000-2001 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" This software was developed by Robert Watson for the TrustedBSD Project.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"       %FreeBSD: src/usr.sbin/extattrctl/extattrctl.8,v 1.23 2003/05/14 20:31:06 rwatson Exp %
.\"
.\" Developed by the TrustedBSD Project.
.\" Support for file system extended attribute.
.\"
.\" $FreeBSD$
.Dd March 30, 2000
.Dt EXTATTRCTL 8
.Os
.Sh 名称
.Nm extattrctl
.Nd UFS1 拡張属性の管理
.Sh 書式
.Nm
.Cm start
.Ar path
.Nm
.Cm stop
.Ar path
.Nm
.Cm initattr
.Op Fl f
.Op Fl p Ar path
.Ar attrsize
.Ar attrfile
.Nm
.Cm showattr
.Ar attrfile
.Nm
.Cm enable
.Ar path
.Ar attrnamespace
.Ar attrname
.Ar attrfile
.Nm
.Cm disable
.Ar path
.Ar attrnamespace
.Ar attrname
.Sh 解説
.Nm
ユーティリティは、
UFS1 ファイルシステムの拡張属性を管理するためのユーティリティです。
ファイルシステム上の拡張属性機能の開始および停止、
属性保存ファイル (attribute backing file) の初期化、
ファイルシステム上の特定の拡張属性の有効化および無効化が可能です。
.Pp
コマンド行上の最初の引数が、実行すべき操作を指定します。
操作は次のいずれかひとつです:
.Bl -tag -width indent
.It Cm start Ar path
.Ar path
で指定されるファイルシステム上での拡張属性サポートを開始します。
ファイルシステムは UFS1 ファイルシステムであることと、
UFS_EXTATTR カーネルオプションが有効化されていることが必要です。
.It Cm stop Ar path
.Ar path
で指定されるファイルシステム上での拡張属性サポートを停止します。
以前に、拡張属性サポートが開始されていることが必要です。
.It Xo
.Cm initattr
.Op Fl f
.Op Fl p Ar path
.Ar attrsize attrfile
.Xc
属性保存ファイルとして使用するファイルを作成し初期化します。
.Ar attrsize
には、inode ごとの最大属性サイズをバイト単位で指定し、
.Ar attrfile
には、属性を格納すべきファイルを指定します。
.Pp
.Fl f
引数を指定し、既存の属性保存ファイルを上書きしても良いことを指定可能です。
指定しない場合には、対象ファイルが存在すると、エラーが返されます。
.Pp
疎なファイルが空間を節約することを期待する代りに、
.Fl p Ar path
引数を指定することで全属性用の空間を前もって割り当てることができます。
属性が書き込まれる時点でそのための空間が存在することを保証することで、
ディスク空間が足りない状態でも
属性サービスが拒否されてしまうことを避けられることが利点です。
.Pp
.Cm initattr
実行前にこのファイルが存在してはなりません。
.It Cm showattr Ar attrfile
属性ファイル
.Ar attrfile
中の属性ヘッダ値を表示します。
.It Cm enable Ar path attrnamespace attrname attrfile
名前空間
.Ar attrnamespace
中の属性
.Ar attrname
を、ファイルシステム
.Ar path
上で有効化します。
属性は、初期化済の属性保存ファイル
.Ar attrfile
に保存されているものが使用されます。
使用可能な名前空間は "user" と "system" です。
保存ファイルは、最初に使用する前に、
.Cm initattr
で初期化済であることが必要です。
属性を有効化する前には、
指定したファイルシステム上で属性機能が開始されていることが必要です。
.It Cm disable Ar path attrnamespace attrname
名前空間
.Ar attrnamespace
中の属性
.Ar attrname
を、ファイルシステム
.Ar path
上で無効化します。
使用可能な名前空間は "user" と "system" です。
指定したファイルシステム上で属性機能が開始されていることと、
指定した属性が
.Cm enable
で有効化されていることが必要です。
.El
.Sh 使用例
.Dl extattrctl start /
.Pp
ルートファイルシステム上の拡張属性機能を開始します。
.Pp
.Dl extattrctl initattr 17 /.attribute/system/md5
.Pp
属性保存ファイルを
/.attribute/system/md5
に作成し、各属性のサイズを 17 バイトに、
属性の格納に疎なファイルを使用します。
.Pp
.Dl extattrctl enable / system md5 /.attribute/system/md5
.Pp
ルートファイルシステム上の md5 属性を有効にします。
使用する md5 属性は
/.attribute/system/md5
に保存されているものです。
.Pp
.Dl extattrctl disable / md5
.Pp
ルートファイルシステム上の md5 属性を無効化します。
.Pp
.Dl extattrctl stop /
.Pp
ルートファイルシステム上の拡張属性機能を停止します。
.Sh 関連項目
.Xr ffs 7 ,
.Xr getextattr 8 ,
.Xr setextattr 8 ,
.Xr extattr 9
.Sh 歴史
拡張属性サポートは、
TrustedBSD Project
の一部として開発され、
.Fx 5.0
で導入されました。
各ファイルやディレクトリが追加ラベルを持つことを必要とするような
セキュリティ拡張のために、この開発が行われました。
.Sh 作者
Robert N M Watson
