freebsd/freebsd-doc/documentation/manual-pages/ja/man8/iostat.8
.\"
.\" Copyright (c) 1997 Kenneth D. Merry.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/iostat/iostat.8,v 1.24 2002/12/27 12:15:37 schweikh Exp %
.\"
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)iostat.8	8.1 (Berkeley) 6/6/93
.\" $FreeBSD$
.\"
.Dd December 22, 1997
.Dt IOSTAT 8
.Os
.Sh 名称
.Nm iostat
.Nd
.Tn I/O
の統計情報を表示する
.Sh 書式
.Nm
.Op Fl CdhKIoT?\&
.Op Fl c Ar count
.Op Fl M Ar core
.Op Fl n Ar devs
.Op Fl N Ar system
.Oo
.Fl t
.Sm off
.Ar type , if , pass
.Sm on
.Oc
.Op Fl w Ar wait
.Op Ar drives
.Sh 解説
.Nm
ユーティリティは、端末やデバイス、CPU操作のカーネル
.Tn I/O
統計を表示します。
最初に表示される統計値は、システム稼働中の平均値です。
最近の活動情報を得るには、適切な待ち時間を指定すると、
引き続いて表示される統計値が指定された時間の平均値になります。
.Pp
オプションは以下のとおりです:
.Bl -tag -width flag
.It Fl c Ar count
I/O統計情報の表示を
.Ar count
回繰り返します。
間隔
.Ar wait
が指定されていときは、デフォルトの1秒が使われます。
.It Fl C
CPU 統計情報を表示します。
.Fl d
が指定されない限り、デフォルトでオンになっています
.It Fl d
デバイス統計情報のみを表示します。
このフラグをオンにすると、
.Fl C
や
.Fl T
も指定して CPU や TTY の統計情報を有効にしない限り、
デバイス統計情報のみが表示されます。
.It Fl h
.Nm
を
.Sq top
モードにします。
このモードでは、
.Nm
は、
計測サイクル毎の転送バイト数が高いデバイスから低いデバイスへ並べて表示します。
.It Fl I
指定された期間における秒あたりの平均統計情報ではなく、
指定された期間における合計の統計情報を表示します。
.It Fl K
転送ブロック数の表示 (
.Fl o
) において、
デバイスのネイティブブロックサイズではなく、
キロバイトでブロック数を表示します。
.It Fl M Ar core
名前リストから値を取り出す際に、デフォルトの
.Dq Pa /dev/kmem
のかわりに指定した
.Ar core
を使います。
.It Fl n
.Ar devs
までの数のデバイスのみを表示します。
.Ar devs
個よりもデバイス数が少ない場合には、
.Nm
ユーティリティが表示するデバイス数は少なくなります。
.It Fl N
名前のリストを取り出す際に、デフォルトの
.Dq Pa /boot/kernel/kernel
のかわりに
.Ar system
を使います。
.It Fl o
古いスタイルの
.Nm
デバイス統計を表示します。
秒あたりのセクタ数、秒あたりの転送回数、シークあたりのミリ秒が表示されます。
.Fl I
が指定されると、合計のブロック数/セクタ数、合計の転送回数、
シークあたりのミリ秒が表示されます。
.It Fl t
どのタイプのデバイスを表示するのかを指定します。
デバイスには 3 種類のカテゴリがあります。
.Pp
.Bl -tag -width indent -compact
.It デバイスタイプ
.Bl -tag -width 9n -compact
.It da
ダイレクトアクセスデバイス
.It sa
シーケンシャルアクセスデバイス
.It printer
プリンタ
.It proc
プロセッサデバイス
.It worm
ライトワンスリードマルチプルデバイス
.It cd
CD デバイス
.It scanner
スキャナデバイス
.It optical
オプティカルメモリデバイス
.It changer
メディアチェンジャデバイス
.It comm
コミュニケーションデバイス
.It array
ストレージアレイデバイス
.It enclosure
エンクロージャサービスデバイス
.It floppy
フロッピデバイス
.El
.Pp
.It インタフェース:
.Bl -tag -width 9n -compact
.It IDE
Integrated Drive Electronics デバイス
.It SCSI
Small Computer System Interface デバイス
.It other
他のデバイスインタフェース
.El
.Pp
.It パススルー:
.Bl -tag -width 9n -compact
.It pass
パススルーデバイス
.El
.El
.Pp
ユーザは少なくとも 1 つのデバイスタイプを指定する必要があり、
各カテゴリにおいては最大 1 つのデバイスタイプを指定可能です。
1 つのデバイスタイプ文に複数のデバイスタイプを指定するには、
コンマで区切ります。
.Pp
コマンドライン上では、
.Fl t
引数をいくつ指定してもかまいません。
.Fl t
引数はすべて OR がとられ、
システム中の全デバイスが対象となる比較式が形成されます。
いずれかの
.Fl t
引数に完全に合致するデバイスは、
.Nm
の出力に含まれます。
ただし、80 桁もしくはユーザが指定した最大デバイス数の範囲に限られます。
.It Fl T
TTY 統計情報を表示します。
.Fl d
が指定されていない限り、デフォルトでオンになっています。
.It Fl w  Ar wait
各表示の間隔を、
.Ar wait
秒とします。繰り返し回数
.Ar count
が指定
されていなければ、デフォルトでは無限に表示を繰り返します。
.It Fl ?\&
使用方法を表示して終了します。
.El
.Pp
.Nm
ユーティリティの、表示する情報のフォーマットは以下のとおりです:
.Bl -tag -width flag
.It tty
.Bl -tag -width indent -compact
.It tin
端末から読み込んだ文字数
.It tout
端末から書き出した文字数
.El
.It devices
デバイス操作。本フィールドのヘッダはデバイス名とユニット番号です。
.Nm
ユーティリティは、
80 桁の範囲もしくはシステム内の最大デバイス数の小さい方の数だけ、
デバイスを表示します。
.Fl n
がコマンドラインに指定されると、
.Nm
は、要求された数のデバイスもしくはシステム内の最大デバイス数の小さい方の
数だけデバイスを表示します。
特定のドライブを表示するには、コマンドラインでドライブ
の名前を指定します。
.Fl n
引数がコマンドラインに指定されて表示すべき最大デバイス数が指定されない限り、
.Nm
ユーティリティは 80 桁に合致するよりも多くのデバイスを表示しません。
80 桁の画面に合致するよりも少ないデバイス数が指定された場合、
.Nm
は指定された数のデバイスのみ表示します。
.Pp
標準の
.Nm
デバイス表示は、次の統計情報を表示します:
.Pp
.Bl -tag -width indent -compact
.It KB/t
転送あたりのキロバイト数
.It tps
秒あたりの転送回数
.It MB/s
秒あたりのメガバイト数
.El
.Pp
標準の
.Nm
デバイス表示は、
.Fl I
フラグが指定されると、次の統計情報を表示します:
.Pp
.Bl -tag -width indent -compact
.It KB/t
転送あたりのキロバイト数
.It xfrs
合計の転送回数
.It MB
合計の転送メガバイト数
.El
.Pp
古いスタイルの
.Nm
表示 (
.Fl o
を使用) では、次の統計情報を表示します:
.Pp
.Bl -tag -width indent -compact
.It sps
1秒間に転送されたセクタ数
.It tps
1秒間の転送回数
.It msps
トランザクションあたりの平均ミリ秒。
.El
古いスタイルの
.Nm
表示では、
.Fl I
フラグを指定すると、次の統計情報を表示します:
.Pp
.Bl -tag -width indent -compact
.It blk
転送した合計のブロック数/セクタ数。
.It xfr
合計の転送回数。
.It msps
トランザクションあたりの平均ミリ秒数。
.El
.It cpu
.Bl -tag -width indent -compact
.It \&us
ユーザモードのCPU時間の % 表示
.It \&ni
niceで優先順位づけられたプロセスを動作させるユーザモードのCPU時間
の % 表示
.It \&sy
システムモードのCPU時間の % 表示
.It \&in
インタラプトモードのCPU時間の % 表示
.It \&id
アイドルモードのCPU時間の % 表示
.El
.El
.Sh 関連ファイル
.Bl -tag -width /boot/kernel/kernel -compact
.It Pa /boot/kernel/kernel
デフォルトのカーネルの名前リスト
.It Pa /dev/kmem
デフォルトのメモリファイル
.El
.Sh 使用例
.Dl iostat -w 1 da0 da1 cd0
.Pp
最初の 2 つのダイレクトアクセスデバイスと、
最初の CDROM デバイスの統計情報を 1 秒毎に無限に表示します。
.Pp
.Dl iostat -c 2
.Pp
システム内の最初の 4 つのデバイスの統計情報を、
1 秒の表示間隔をおいて 2 度表示します。
.Pp
.Dl iostat -t da -t cd -w 1
.Pp
全 CDROM とダイレクトアクセスデバイスの統計情報を 1 秒毎に無限に表示します。
.Pp
.Dl iostat -t da,scsi,pass -t cd,scsi,pass
.Pp
ダイレクトアクセスデバイスおよび CDROM デバイスへのアクセスを提供する
全 SCSI パススルーデバイスに関して、統計情報を 1 度表示します。
.Pp
.Dl iostat -h -n 8 -w 1
.Pp
より多くの I/O を行う、最大 8 個のデバイスに関して、
統計情報を 1 秒毎に無限に表示します。
.Pp
.Dl iostat -dh -t da -w 1
.Pp
TTY と CPU の表示を省略し、
性能順にデバイスを表示し、ダイレクトアクセスデバイスのみを
1 秒毎に無限に表示します。
.Pp
.Dl iostat -Iw 3
.Pp
合計の統計情報を 3 秒毎に無限に表示します。
.Pp
.Dl iostat -odICTw 2 -c 9
.Pp
合計の統計情報を古いスタイルの出力形式で 9 回表示します。
各計測/表示の間隔は 2 秒です。
.Fl d
フラグは一般に TTY と CPU の表示を抑制しますが、
.Fl T
と
.Fl C
のフラグが指定されているので、TTY と CPU の表示もなされます。
.Sh 関連項目
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr pstat 8 ,
.Xr vmstat 8
.Pp
.%T "Installing and Operating 4.3BSD"
の ``Interpreting system activity'' で始まる章
.Sh 歴史
本バージョンの
.Nm
は最初に
.Fx 3.0
に登場しました。
.Sh バグ
.Nm
は、クラッシュダンプのデバッグツールとしては
おそらく限定的にしか使えないでしょう。
なぜなら、現在のところクラッシュの直前の期間だけをカバーする
統計情報を取得する方法が無いからです。
.Sh 作者
.An Kenneth Merry Aq ken@FreeBSD.org
