freebsd/freebsd-doc/documentation/manual-pages/ja/man8/mksnap_ffs.8
.\"
.\" Copyright (c) 2003 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by Marshall
.\" Kirk McKusick and Network Associates Laboratories, the Security
.\" Research Division of Network Associates, Inc. under DARPA/SPAWAR
.\" contract N66001-01-C-8035 ("CBOSS"), as part of the DARPA CHATS
.\" research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The names of the authors may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/mksnap_ffs/mksnap_ffs.8,v 1.3 2003/09/07 14:11:02 charnier Exp %
.\"
.\" $FreeBSD$
.Dd January 19, 2003
.Dt MKSNAP_FFS 8
.Os
.Sh 名称
.Nm mksnap_ffs
.Nd ファイルシステムのスナップショット取得
.Sh 書式
.Nm
.Ar mountpoint
.Ar snapshot_name
.Sh 解説
.Nm
ユーティリティは、
.Ar snapshot_name
という名前のスナップショットを、
.Ar mountpoint
にマウントされたファイルシステム上に生成します。
.Ar snapshot_name
引数は、
.Ar mountpoint
にマウントされているファイルシステムに含まれることが必要です。
.Pp
ファイルのグループ所有者は
.Dq Li operator
に設定されます。
ファイルの所有者は
.Dq Li root
のままです。
スナップショットのモードは、所有者と
.Dq Li operator
グループのメンバに読み取り可能となるように設定されます。
.Sh 関連項目
.Xr chmod 2 ,
.Xr chown 8 ,
.Xr mount 8
.Sh 歴史
.Nm
ユーティリティが最初に登場したのは
.Fx 5.0
です。
