freebsd/freebsd-doc/documentation/manual-pages/ja/man8/mount_nfs.8
.\" Copyright (c) 1992, 1993, 1994, 1995
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)mount_nfs.8	8.3 (Berkeley) 3/29/95
.\" %FreeBSD: src/sbin/mount_nfs/mount_nfs.8,v 1.41 2004/04/09 19:58:32 markm Exp %
.\"
.\" $FreeBSD$
.\""
.Dd May 11, 2003
.Dt MOUNT_NFS 8
.Os
.Sh 名称
.Nm mount_nfs
.Nd NFS (ネットワークファイルシステム) をマウントする
.Sh 書式
.Nm
.Op Fl 23NPTUbcdiLls
.Op Fl D Ar deadthresh
.Op Fl I Ar readdirsize
.Op Fl R Ar retrycnt
.Op Fl a Ar maxreadahead
.Op Fl g Ar maxgroups
.Op Fl o Ar options
.Op Fl r Ar readsize
.Op Fl t Ar timeout
.Op Fl w Ar writesize
.Op Fl x Ar retrans
.Ar rhost : Ns Ar path node
.Sh 解説
.Nm
ユーティリティは、ファイルシステムツリー上の指定された
.Ar node
にリモートの NFS ファイルシステム
.Pq Ar rhost : Ns Ar path
をマウントするために、
.Xr mount 2
システムコールを呼び出します。このコマンドは通常、
.Xr mount 8
によって実行されます。このプログラムは、RFC 1094 の Appendix. A および
.%T "NFS: Network File System Version 3 Protocol Specification" ,
Appendix I.
に記述されているマウントプロトコルを実装しています。
.Pp
デフォルトでは、マウントが成功するまで、
.Nm
はリトライを続けます。
この動作は、
.Xr fstab 5
に列挙された、ブート処理に必須なファイルシステムでの使用を意図しています。
必須ではないファイルシステムには、
.Fl b
および
.Fl R
のフラグを使用して、
サーバが利用不可の場合でもブート処理がハングしないようにできます。
.Pp
NFS ファイルシステムのマウント中にサーバが応答しなくなった場合、
当該ファイルシステム上の新規または未解決のファイル処理は、
サーバが回復するまで、割り込まれることなくハングします。
このデフォルトの動作を修正するには、
.Fl i
と
.Fl s
のフラグを見てください。
.Pp
オプションを以下に示します:
.Bl -tag -width indent
.It Fl 2
NFS バージョン 2 プロトコルを使用します
(デフォルトはバージョン 3 をまず試した後にバージョン 2 を用います)。
NFS バージョン 2 では、
ファイルサイズは 2 ギガバイトに制限されることに注意してください。
.It Fl 3
NFS バージョン 3 プロトコルを使用します。
.It Fl D
NQNFSにおいて
.Dq "停止サーバ閾 (dead server threshold)"
をタイムアウト (round trip timeout) 回数で指定します。
これを越えると
.Dq "server not responding"
メッセージが表示されます。
.It Fl I
readdir での読み取りサイズを指定した値にします。
値は通常
.Dv DIRBLKSIZ
の倍数であり、マウントの読み取りサイズ以下です。
.It Fl L
.Xr fcntl 2
ロックをネットワーク転送しません。
すべてのロックはローカルとなり、
サーバおよび他の NFS クライアントには見えなくなります。
これにより
.Xr rpcbind 8
サービスを実行する必要がなくなり、
.Xr rpc.statd 8
と
.Xr rpc.lockd 8
のサーバをクライアント上で実行する必要がなくなります。
本オプションは最初のマウント実行時にのみ尊重され、
マウントオプション更新時には黙って無視されます。
.It Fl N
予約されたソケットポート番号を使用し
.Em ません
(後述)。
.It Fl P
予約されたソケットポート番号を使います。
このフラグは廃れたものであり、互換性のためだけにあります。
現在、予約されたソケットポート番号をデフォルトで使用します。
(クライアントの root が信頼でき、ネットワークケーブルも安全な場所にあ
るが、クライアントのユーザは信頼できないという、まれな場合には
役に立つでしょうが、通常のデスクトップクライアントには当てはまりません。)
.It Fl R
マウントのリトライ回数を、指定された値にします。
デフォルトのリトライ数は 0 であり、
これは永遠にリトライを続けることを意味します。
各リトライの間隔は 60 秒です。
.It Fl T
UDP の代わりに TCP を使います。これは、サーバがクライアントと
同じ LAN ケーブル上にない場合に使うことをお勧めします
(注意: この機能は大抵の非
.Bx
サーバではサポートされていません)。
.It Fl U
TCP NFS マウントであっても、マウントプロトコルに UDP を強制します。
(古い BSD サーバにて必要です。)
.It Fl a
先読みブロック数を指定した値に設定します。値は 0 から 4 までの範囲で、
サイズの大きなファイルをシーケンシャルに読む場合、
何ブロック先読みするかを決定します。
.\" ×がうまく表示されないので \[mu] 使用
帯域幅 \[mu] 遅延が大きな状況でマウントする場合に
1 より大きな値をお勧めします。
.It Fl b
最初にサーバの接続に失敗した場合、子プロセスを起動して、
バックグラウンドでマウントを続けようとします。
マルチユーザモードで起動する際、重要でないファイルシステムを
.Xr fstab 5
に書いておく場合に役に立ちます。
.It Fl c
.Tn UDP
マウントポイントに対しては、
.Xr connect 2
を使いません。
これは、標準のポート番号 2049 からのリクエストに答えないサーバや
別の IP アドレスからリクエストに答えるサーバ
(サーバがマルチホームの場合に発生し得ます)
.Va vfs.nfs.nfs_ip_paranoia
sysctl を 0 に設定すると、本オプションがデフォルトになります。
に対しては使う必要があります。
.It Fl d
再送タイムアウト時間を動的に予測しません。これは、
動的に予測される再送タイムアウト時間が非常に短いために、
UDP マウントが高いリトライレートを示しているような場合に有効です。
.It Fl g
認証用のグループリストの最大サイズを、指定した値に設定します。
RFC 1057 ではグループリストのサイズは 16 と記述されていますが、これを
扱えない古いサーバをマウントするときに使うべきです。
多くのグループに属しているユーザに対してマウントポイントから
応答がない場合は、8 を指定してみて下さい。
.It Fl i
マウントを割り込み可能とします。これは、応答しないサーバがあるために
ファイル関連のシステムコールが遅れるような場合、
プロセスに終了シグナルが送られると、EINTR で
システムコールが失敗することを意味します。
.It Fl l
NQNFS と NFSV3 において、\fBReaddir_and_Lookup\fR RPCを使うことを
指定します。
このオプションは
.Dq "ls -l"
するようなときに RPC のトラフィックを減らしますが、
属性と名前のキャッシュをプリフェッチエントリで溢れさせる傾向があります。
このオプションを指定して性能が良くなるのか悪くなるのかを確認して下さい。
バンド幅と遅延の積が大きなネットワークにて最も有用でしょう。
.It Fl o
.Fl o
フラグの後に、オプションをコンマで区切って並べ指定します。
指定可能なオプションとその意味は
.Xr mount 8
を参照してください。
以下の NFS 固有のオプションを使用可能です:
.Bl -tag -width indent
.It Cm port Ns = Ns Aq Ar port_number
指定したポート番号を NFS 要求に使用します。
デフォルトでは portmapper に問い合わせます。
.It Cm acregmin Ns = Ns Aq Ar seconds
.It Cm acregmax Ns = Ns Aq Ar seconds
.It Cm acdirmin Ns = Ns Aq Ar seconds
.It Cm acdirmax Ns = Ns Aq Ar seconds
ファイル属性がキャッシュされたときに、
キャッシュエントリをエクスパイアするためにタイムアウトを計算します。
これらの 4 つの値は、
.Dq ディレクトリ
および
.Dq 通常
(ディレクトリ以外) の
上限および下限を決定します。
デフォルトでは、
通常ファイルは 3 から 60 秒、
ディレクトリは 30 から 60 秒です。
タイムアウトの算出アルゴリズムはファイルの古さを元にするものです。
ファイルが古くなると、キャッシュが有効であると見なす期間も長くなり、
上記限界に近付きます。
.It Cm noinet4 , noinet6
.Dv AF_INET
や
.Dv AF_INET6
の接続を無効化します。
同じ名前で A レコードと AAAA レコードを持つホストにおいて有用です。
.El
.Pp
.Ss 歴史的な Fl o Ss オプション
.Pp
これらのオプションを使用する事は勧められません。
歴史的な
.Nm
との互換性のためにここに記述してあります。
.Bl -tag -width ".Cm dumbtimer"
.It Cm bg
.Fl b
と同じ。
.It Cm conn
.Fl c
を指定しない場合と同じ。
.It Cm dumbtimer
.Fl d
と同じ。
.It Cm intr
.Fl i
と同じ。
.It Cm lockd
.Fl L
を指定しない場合と同じ。
.It Cm nfsv2
.Fl 2
と同じ。
.It Cm nfsv3
.Fl 3
と同じ。
.It Cm rdirplus
.Fl l
と同じ。
.It Cm mntudp
.Fl U
と同じ。
.It Cm resvport
.Fl P
と同じ。
.It Cm soft
.Fl s
と同じ。
.It Cm tcp
.Fl T
と同じ。
.El
.It Fl r
データのリードサイズを指定した値にします。この値は通常 1024
以上の 2 のべき乗でなければなりません。これはマウントポイント
を頻繁に使っている間に、
.Dq タイムアウトで消失したフラグメント数
が大きくなっていくときに、UDP マウントに対して使います
.Pf ( Xr netstat 1
を
.Fl s
オプション付きで使う
ことで、
.Dq タイムアウトで消失したフラグメント数
の値を見ることができます)。
.Fl w
オプションも参照
してください。
.It Fl s
ソフトマウントを行います。これは、
タイムアウトが決められた
.Ar リトライ
回数に達すると、
システムコールが失敗することを意味します。
.It Fl t
指定した値に初期再送タイムアウト時間を設定します。パケット
の消失レートの高いネットワークや負荷の高いサーバで行う UDP マウントを
チューニングするときに役立ちます。
ファイルシステムがアクティブなときに
.Xr nfsstat 1
が高い再送レートを示す場合には、この値を増やしてみて下さい。
一方、再送レートは低いが、応答遅延が長い場合はこの値を減らします。
(通常、
.Fl d
オプションをこのオプションとともに使い、
手動でタイムアウトインターバルを調整します。)
.It Fl w
指定した値にライトデータサイズを設定します。解説は
.Fl r
オプションと同様ですが、
.Dq タイムアウトで消失したフラグメント数
は、クライアントのかわりにサーバの値を使います。
.Fl r
や
.Fl w
のオプションは、マウントするサーバが TCP
マウントをサポートしていない場合にパフォーマンスを向上させる
最後の手段であることに注意してください。
.It Fl x
ソフトマウントの再送タイムアウト回数を設定します。
.El
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr nfsd 8 ,
.Xr nfsiod 8 ,
.Xr showmount 8
.Sh バグ
Sun RPCは UDP (信頼性のないデータグラム) トランスポート層上に
実装されているため、マウントの性能をチューニングしても
限界があります。サーバが同じ LAN ケーブル上にない場合や、
サーバの負荷が高い場合には、
.Tn TCP
トランスポートを使うことを強くすすめますが、
残念なことに、ほぼ
.Bx 4.4
サーバに限られています。
