freebsd/freebsd-doc/documentation/manual-pages/ja/man8/nfsd.8
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)nfsd.8	8.4 (Berkeley) 3/29/95
.\" %FreeBSD: src/usr.sbin/nfsd/nfsd.8,v 1.23 2004/08/07 04:27:52 imp Exp %
.\"
.\" $FreeBSD$
.\"
.Dd March 29, 1995
.Dt NFSD 8
.Os
.Sh 名称
.Nm nfsd
.Nd リモートマシンに対して
.Tn NFS
サービスを行うデーモン
.Sh 書式
.Nm
.Op Fl ardut
.Op Fl n Ar num_servers
.Op Fl h Ar bindip
.Sh 解説
.Nm
ユーティリティは
.Tn NFS
サーバマシン上で実行され、クライアントからの
.Tn NFS
要求に対するサービスを行います。サーバマシンとして動作させるには、
最低でも 1 つの
.Nm
が動作していなければなりません。
.Pp
何も指定されない場合は、
.Tn UDP
トランスポートを用いるサーバが 4 つ起動されます。
.Pp
以下のオプションが利用可能です:
.Bl -tag -width Ds
.It Fl r
新たなサーバを生成せずに、
.Tn NFS
サービスだけを
.Xr rpcbind 8
に登録します。
このオプションは、rpcbind サーバが再起動したときに
.Tn NFS
サービスを再登録するために、
.Fl u
や
.Fl t
オプションといっしょに使われます。
.It Fl d
サーバを生成することなく、
.Tn NFS
サービスを
.Xr rpcbind 8
から登録解除します。
.It Fl n
スタートさせるサーバの数を指定します。
.It Fl h Ar bindip
どの IP アドレスまたはホスト名をローカルホストに結び付けるかを指定します。
ホストが複数インタフェースを持つ場合、本オプションが推奨されます。
複数の
.Fl h
オプションが指定可能です。
.It Fl a
nfsd をワイルドカード IP アドレスに結び付けるべきことを指定します。
.Fl h
オプションを指定しないと、これがデフォルトです。
.Fl h
オプションを指定しても、本オプションを指定可能です。
-a を使用するか -h を使用しないことによって
ワイルドカード IP アドレスが結び付けられた場合、
NFS/UDP は正しく動作しないことに注意してください。
.It Fl t
.Tn TCP NFS
クライアントに対するサービスを行います。
.It Fl u
.Tn UDP NFS
クライアントに対するサービスを行います。
.El
.Pp
例えば、
.Dq Li "nfsd -u -t -n 6"
は、
.Tn UDP
と
.Tn TCP
トランスポートに対するサービスを行う 6 つのデーモンを生成します。
.Pp
クライアントからの要求を最大限並列処理するのに十分な数のデーモンを実行
する必要があります。典型的には 4 個から 6 個です。
.Pp
.Nm
ユーティリティは、
.Tn NFS
サーバの仕様で示されているポートで、サービス要求を待ちます。
この仕様に関しては、
.%T "NFS: Network File System Protocol Specification" ,
RFC1094,
.%T "NFS: Network File System Version 3 Protocol Specification"
を参照してください。
.Pp
動作中のカーネルに
.Tn NFS
がロードされていないことを検出すると、
.Nm
は
.Xr kldload 2
により、
.Tn NFS
をサポートしたロード可能カーネルモジュールを読み込もうとします。
.Nm
は、これに失敗した場合、もしくは
.Tn NFS
KLD が用意されていないときにはエラー終了します。
.Pp
.Nm
が複数インタフェースまたはインタフェースエイリアスがある
ホスト上で実行する場合、
.Fl h
オプションの使用が推奨されます。
本オプションを使用しないと、
送信先と同じ IP アドレスからの UDP パケットに NFS が応答しないかもしれません。
ファイアウォール上の NFS エクスポートを安全にするためにも、
本オプションの使用が推奨されます。
これは NFS ソケットが内部インタフェースからのみアクセス可能とします。
そして
.Nm ipfw
ユーティリティを使用し、外部インタフェースからの nfs 関連パケットを遮断します。
.Pp
.Nm
ユーティリティを終了するには
.Dv SIGUSR1
を使用することが必要であり、
.Dv SIGTERM
または
.Dv SIGQUIT
では殺せません。
.Nm
ユーティリティは、シャットダウン中にできるだけ長く生き残るために、
これらのシグナルを無視することが必要なのです。
そうしなければ、ループバックマウントをアンマウントできなくなってしまいます。
.Nm
を殺す必要がある場合、単に
.Dq Li "kill -USR1 <PID of master nfsd>"
としてください。
.Sh 診断
.Ex -std
.Sh 関連項目
.Xr nfsstat 1 ,
.Xr kldload 2 ,
.Xr nfssvc 2 ,
.Xr exports 5 ,
.Xr ipfw 8 ,
.Xr mountd 8 ,
.Xr nfsiod 8 ,
.Xr rpcbind 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.4
から登場しました。
