freebsd/freebsd-doc/documentation/manual-pages/ja/man8/ntpdate.8
.\"
.\" %FreeBSD: src/usr.sbin/ntp/doc/ntpdate.8,v 1.7.8.1 2004/11/15 21:02:10 simon Exp %
.\"
.\" $FreeBSD$
.\" WORD: key identifier	鍵の識別子
.\" WORD: key file		鍵ファイル
.\" WORD: slew			微調整する (slue の過去・過去分詞形)
.\" WORD: step			合わせる
.\" WORD: clock			時計
.\" WORD: time			時刻
.\" WORD: seconds and fraction	秒数 (小数も可)
.\"
.Dd January 6, 2000
.Dt NTPDATE 8
.Os
.Sh 名称
.Nm ntpdate
.Nd NTP を介して日付と時刻を設定する
.Sh 書式
.Nm
.Op Fl bBdoqsuv
.Op Fl a Ar key
.Op Fl e Ar authdelay
.Op Fl k Ar keyfile
.Op Fl o Ar version
.Op Fl p Ar samples
.Op Fl t Ar timeout
.Ar server ...
.Sh 解説
.Pp
.Em 注意 :
このプログラムの機能は、今では
.Xr ntpd 8
プログラムの中で利用可能となっています。
.Xr ntpd 8
マニュアルページの
.Fl q
コマンドラインオプションの説明を参照して下さい。
適切な期間、喪に服した後で、
.Nm
ユーティリティは本ディストリビューションから引退することになります。
.Pp
.Nm
ユーティリティは、正確な時刻を決めるために
.Ar server
引数で与えられた
ネットワークタイムプロトコル (Network Time Protocol; NTP)
サーバ (複数可) を調べることによって、
ローカルな日付と時刻を設定します。
このコマンドは、ローカルホストの root として起動されなければなりません。
指定された各サーバからたくさんのサンプルを得て、
NTP 時計フィルタのサブセットと選択アルゴリズムを適用し、
その中から最良のものを選択します。
.Nm
の正確さと信頼性は
サーバの数、一実行あたりの調査数、そして実行間隔で決まることに
注意してください。
.Pp
以下のオプションが使用可能です:
.Bl -tag -width indent
.It Fl a Ar key
認証機能を有効にし、認証の鍵識別子を
.Ar key
引数に指定します。
鍵と鍵の識別子はクライアントとサーバ双方の鍵ファイルで
合致する必要があります。
デフォルトでは認証機能は無効になっています。
.It Fl B
.\" ±がうまくつかえないので \[+-] 使用
計測されたオフセットが \[+-]128 ms より大きくても、
時刻を常に
.Xr adjtime 2
システムコールを用いて微調整するよう、強制します。
デフォルトではオフセットが \[+-]128 ms より大きい場合は、
.Xr settimeofday 2
を用いてずらします。
オフセットが \[+-]128 ms より大きい場合は、
時計を正しい値に微調整で合わせるのに長い時間 (数時間) 掛かることがあることに
注意してください。
この間は、クライアントを同期するためにこのホストを使ってはいけません。
.It Fl b
(デフォルトの)
.Xr adjtime 2
システムコールを用いて時刻を微調整するのではなく、
.Xr settimeofday 2
システムコールを用いて時刻を合わせるよう、強制します。
このオプションはブート時に起動ファイルから呼び出すときには使用するべきです。
.It Fl d
デバッグモードを有効にします。
.Nm
は全てのステップを実行しますが、ローカル時計を合わせることはしません。
一般的なデバッグに役立つ情報も表示します。
.It Fl e Ar authdelay
認証機能の処理にかかる遅れを
.Ar authdelay
に値を秒数 (小数も可) で指定します
(詳細は
.Xr ntpd 8
を参照してください)。
この値は通常多くの用途では無視し得るほどわずかですが、
非常に遅い CPU ではこの数を指定することで、
時間の正確さが改善されるかもしれません。
.It Fl k Ar keyfile
認証鍵のファイルへのパスを文字列で
.Ar keyfile
に指定します。
デフォルトは
.Pa /etc/ntp.keys
です。
このファイルは
.Xr ntpd 8
に記述されている形式で書く必要があります。
.It Fl o Ar version
外へ出すパケットの NTP バージョンを
.Ar version
に 1 か 2 の整数で指定します。
デフォルトは 3 です。
このオプションは
.Nm
を古いバージョンの NTP に対して使用できるようにします。
.It Fl p Ar samples
各サーバから得るサンプルの数を
.Ar samples
に 1 から 8 までの整数で指定します。
デフォルトは 4 です。
.It Fl q
問い合わせをするだけで、時計を設定しません。
.It Fl s
(デフォルトの) 標準出力ではなく、
.Xr syslog 3
機能を使用してログ出力を行ないます。
この機能は主に
.Xr cron 8
スクリプトでの利便性を考えて作られました。
.It Fl t Ar timeout
サーバの応答を待つ最大時間を
.Ar timeout
に秒数 (小数も可) で指定します。
値は 0.2 秒の倍数に丸められます。
デフォルトは 1 秒で、これは LAN を通じて調べるのに適当な値です。
.It Fl u
.Nm
が外へ出すパケットを非特権ポートから出すように命令します。
この機能は、外から来た特権ポートへのトラフィックを
ブロックするファイアウォールの内側にいる場合に、
ファイアウォールを越えた向こうのホストと同期する際に最も便利です。
.Fl d
オプションは常に非特権ポートを使用することに注意してください。
.It Fl v
冗長になります。
このオプションは
.Nm
のバージョン識別文字列を記録するようになります。
.El
.Pp
.Nm
ユーティリティは、必要に応じてホストの時計を合わせるために手動で動かしたり、
ブート時に時計を設定するために起動スクリプト
の中から動かすことができます。
このことは NTP デーモン
.Xr ntpd 8
を起動する前に時計を初期設定する場合に便利です。
.Nm
は
.Xr cron 8
スクリプトから起動することも可能です。
しかし、
.Nm
を用いた
.Xr cron 8
スクリプトを工夫しても、
最小限のリソース消費で最大の正確さと信頼性を得る
洗練されたアルゴリズムを用いる NTP デーモンの代わりにはならないことに
注意することが重要です。
最後に、
.Nm
は
.Xr ntpd 8
がするようなホストのクロック周波数の学習をしないので、
.Nm
を用いることによる正確さは限定されます。
.Pp
.Nm
は 2 つの方法のうちの 1 つで時刻の調整を行います。
.Nm
は、時計が 0.5 秒以上ずれていると判断すると、システムの
.Xr settimeofday 2
ルーチンを呼ぶことで単に時刻を合わせ直します。
しかし、
誤差が 0.5 秒以内のときは、システムの
.Xr adjtime 2
ルーチンを呼ぶことで、時刻を微調整します。
後者のテクニックは、誤差が小さいときには、より滑らかな上に正確であり、
.Nm
を
.Xr cron 8
で 1 〜 2 時間に一回動かすときには、かなりうまく働きます。
.Pp
.Nm
ユーティリティは同じホストで NTP サーバデーモン (例えば
.Xr ntpd 8 )
が動いている場合は、日付の設定を拒否します。
デーモンを実行する代わりに
.Xr cron 8
から定期的に
.Nm
を呼び出す場合は、
1 〜 2 時間に一回行なうと時計のずれを抑止するのに十分な
正確な時刻を保持できます。
.Pp
.Nm
が NetInfo サポートを含む形でコンパイルされていた場合、
.Nm
が
.Xr ntpd 8
用の NetInfo の設定から時刻サーバを見つけられる場合は
.Ic server
引数はオプションとなります。
.Sh 関連ファイル
.Bl -tag -width /etc/ntp.keys -compact
.It Pa /etc/ntp.keys
.Nm
で使われる暗号化鍵を含みます。
.El
.Sh 関連項目
.Xr ntpd 8
.Sh バグ
微調整による調整は、実際には、計測されたずれよりも 50% 大きくなります。
これは、ひどくフラフラする時計をより正確に保持するのに役立つからです
(と主張されています)。
このことは良い考えではないかもしれず、カーネル変数
.Va kern.clockrate.tick
と
.Va kern.clockrate.tickadj
の値をおかしくするかもしれません。
