freebsd/freebsd-doc/documentation/manual-pages/ja/man8/pam_opie.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\" Copyright (c) 2002 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" Portions of this software were developed for the FreeBSD Project by
.\" ThinkSec AS and NAI Labs, the Security Research Division of Network
.\" Associates, Inc.  under DARPA/SPAWAR contract N66001-01-C-8035
.\" ("CBOSS"), as part of the DARPA CHATS research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libpam/modules/pam_opie/pam_opie.8,v 1.9 2002/12/27 12:15:31 schweikh Exp %
.\"
.\" $FreeBSD$
.Dd July 7, 2001
.Dt PAM_OPIE 8
.Os
.Sh 名称
.Nm pam_opie
.Nd OPIE PAM モジュール
.Sh 書式
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_opie
.Op Ar options
.Sh 解説
PAM の OPIE 認証サービスモジュールである
.Nm
は、単一の PAM カテゴリに対してのみ機能を提供します。
すなわち、認証に関してのみです。
.Ar module-type
のパラメータ中では、これは
.Dq Li auth
機能となります。
セッション管理機能に関しては、空の機能を提供します。
.Pp
このモジュールは
.Xr opieaccess 5
チェックを強制しないことに注意してください。
この目的のためには、別モジュール
.Xr pam_opieaccess 8
があります。
.Ss OPIE 認証モジュール
OPIE 認証コンポーネントは、ユーザの識別情報が正しいことを確認する機能
.Pq Fn pam_sm_authenticate
を提供します。
この機能は、適切な
.Xr opie 4
資格を獲得します。
この機能は、ユーザに対して OPIE チャレンジを与え、
.Xr opiechallenge 3
を使用してこの正しさを確認します。
.Pp
次のオプションを認証モジュールに渡すことが可能です:
.Bl -tag -width ".Cm auth_as_self"
.It Cm debug
.Dv LOG_DEBUG
レベルでの
.Xr syslog 3
デバッグ情報です。
.It Cm auth_as_self
本オプションは、アクセスしようとしているアカウントのユーザではなく、
.Xr getlogin 2
で得られるユーザとして、ユーザが自己を認証することを求めます。
このオプションの第一義は、
.Xr su 1
のような、ユーザが自己のパスワードを再度入力すれば十分と考えられる
サービスのためのものです。
.It Cm no_fake_prompts
OPIE 鍵を持たないユーザに対して、偽のチャレンジを生成しないようにします。
これは、仮想上の攻撃者に対して、
誰が OPIE を使用しており誰が使用していないのかという情報を漏曳することに
なってしまいますが、ほとんどのユーザは OPIE を使用しないが一部のユーザのみ
使用するシステムでは有用です。
.El
.Pp
.Nm
は標準オプション
.Cm try_first_pass
と
.Cm use_first_pass
を無視することに注意してください。
何故なら、ユーザが正当な応答を提出する前に、
チャレンジが生成されなければならないからです。
.Sh 関連ファイル
.Bl -tag -width ".Pa /etc/opiekeys" -compact
.It Pa /etc/opiekeys
デフォルトの OPIE パスワードファイル。
.El
.Sh 関連項目
.Xr passwd 1 ,
.Xr getlogin 2 ,
.Xr opiechallenge 3 ,
.Xr syslog 3 ,
.Xr opie 4 ,
.Xr pam.conf 5 ,
.Xr pam 8
