freebsd/freebsd-doc/documentation/manual-pages/ja/man8/pwd_mkdb.8
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)pwd_mkdb.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/pwd_mkdb/pwd_mkdb.8,v 1.24 2004/08/07 04:27:52 imp Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 6, 1993
.Dt PWD_MKDB 8
.Os
.Sh 名称
.Nm pwd_mkdb
.Nd パスワードデータベースを構築する
.Sh 書式
.Nm
.Op Fl C
.Op Fl N
.Op Fl p
.Op Fl i
.Op Fl d Ar directory
.Op Fl s Ar cachesize
.Op Fl u Ar username
.Ar file
.Sh 解説
.Nm
ユーティリティは、指定されたファイルから
.Xr db 3
スタイルの、セキュリティのしっかりしたデータベースと
そうでないデータベースの 2 つを構築します。
そして、これらのデータベースは、それぞれ
.Pa /etc/spwd.db
と
.Pa /etc/pwd.db
にインストールされます。
このファイルは、
.Pa /etc/master.passwd
にインストールされます。このファイルは
正しいフォーマットでなければなりません
.Pf ( Xr passwd 5
を参照)。このシステムで使われるフォーマットは、旧来の
バージョン 7 スタイルのフォーマットとは異なるので注意を要します。
.Pp
オプションは以下の通りです。
.Bl -tag -width flag
.It Fl C
パスワードファイルが正しいフォーマットかどうかをチェックします。
どのファイルも変更、追加、削除を行ないません。
.It Fl N
ファイルに対するロックを取得できない場合にはエラー状態で終了するように、
.Nm
に指示します。
デフォルトでは、ソースファイルに対するロックを、ブロックして待ちます。
データベースの再構築中、このロックは保持されます。
.It Fl p
バージョン 7 スタイルのパスワードファイルを作成し、
.Pa /etc/passwd
にインストールします。
.It Fl i
.Pa master.passwd
ファイルのロックの失敗を無視します。
競合が起き得ないような、リリースの過程で NFS 越しにパスワードファイルを
構築する場合に、このオプションは使用されます。
ロックを無視するために
.Fl d
オプションでデフォルトでないディレクトリも指定しなければなりません。
このオプションのその他の利用はできる限り控えて下さい。
.It Fl d Ar directory
.Pa /etc
の代わりに、指定された先のディレクトリにデータベースを保存します。
.It Fl u Ar username
指定したユーザのレコードだけ更新します。
単一ユーザに対してのみ作用するユーティリティは、このオプションを使用し、
データベース全体を再構築するオーバヘッドを避けることが出来ます。
.It Fl s Ar cachesize
ハッシングライブラリが使用するメモリキャッシュの大きさを、
メガバイト単位で指定します。
ユーザ数が多いシステムでキャッシュを小さくすると、
データベースファイルの再構築に耐えがたいほどの長時間を要します、
おおざっぱな目安では、
.Nm
の使用メモリ量はここで指定した大きさの 2 倍をちょっと越えたものになります。
デフォルト値は 2 メガバイトです。
.El
.Pp
2 つのデータベースの違いは、安全なバージョンでは、ユーザのパスワードが
暗号化されて入っており、安全でないバージョンでは、パスワードが ``*'' と
なっていることです。
.Pp
このデータベースは、 C ライブラリパスワードルーチンに使われます
.Pf ( Xr getpwent 3
を参照)。
.Pp
.Nm
ユーティリティは成功したときは 0 を返し、失敗したときは 0 以外を返します。
.Sh 環境変数
.Ev PW_SCAN_BIG_IDS
環境変数が設定されると、
大きなユーザ ID およびグループ ID に対して通常生成される警告メッセージを、
.Nm
は抑制します。
ID 値を仮定するプログラムでこのような ID を使用すると、
深刻な問題の原因となります。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /etc/pwd.db
セキュリティのないパスワードデータベースファイル
.It Pa /etc/pwd.db.tmp
一時ファイル。
.It Pa /etc/spwd.db
セキュリティのあるパスワードデータベースファイル。
.It Pa /etc/spwd.db.tmp
一時ファイル。
.It Pa /etc/master.passwd
現在のパスワードファイル。
.It Pa /etc/passwd
バージョン 7 フォーマットのパスワードファイル。
.El
.Sh バグ
パスワードファイルの不可分な更新が必要なので、
.Nm
は、インストールに
.Xr rename 2
を使います。
しかし、コマンドラインで指定されたファイルが
.Pa /etc
ディレクトリと同じファイルシステム上に存在しなければなりません。
.Pp
複数の人が、
.Nm
を同時に異なるパスワードファイルに対して走らせると、
明らかにレース (race; 競合) になってしまいます。
.Nm
のフロントエンドである
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr vipw 8
では、この問題を避けるために必要なロック操作を行います。
.Sh 互換性
以前のバージョンのシステムは、
.Nm
同様のプログラムである
.Xr mkpasswd 8
を持っており、それはパスワードファイルに対して
.Xr dbm 3
スタイルのデータベースを構築しましたが、
これをインストールするために呼ぶプログラムに依存していました。
このプログラムは、以前のプログラムのユーザが機能の変化で
驚かないように名前が変えられました。
.Sh 関連項目
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr db 3 ,
.Xr getpwent 3 ,
.Xr passwd 5 ,
.Xr vipw 8
