freebsd/freebsd-doc/documentation/manual-pages/ja/man8/rpc.lockd.8
.\"	$NetBSD: rpc.lockd.8,v 1.5 2000/06/09 18:51:47 cgd Exp $
.\"	%FreeBSD: src/usr.sbin/rpc.lockd/rpc.lockd.8,v 1.14 2002/07/14 14:45:36 charnier Exp %
.\"
.\" Copyright (c) 1995 A.R.Gordon, andrew.gordon@net-tel.co.uk
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd September 24, 1995
.Dt RPC.LOCKD 8
.Os
.Sh 名称
.Nm rpc.lockd
.Nd NFS ファイルロックデーモン
.Sh 書式
.Nm
.Op Fl d Ar debug_level
.Op Fl g Ar grace period
.Sh 解説
.Nm
ユーティリティは、NFS 環境において、モニタ付き無し両方の、
ファイルとレコードのロックサービスを提供します。
ロックを要求しているホストの状態をモニタするには、
ロックデーモンは典型的には
.Xr rpc.statd 8
と組み合わせて動作します。
.Pp
.Nm
で使用可能なオプションとオペランドは以下のとおりです:
.Bl -tag -width indent
.It Fl d
.Fl d
オプションは、デバッグ情報を syslog に書き出させ、
デーモンに対する全 RPC トランザクションを記録させます。
これらのメッセージはレベル
.Dv LOG_DEBUG
でファシリティ
.Dv LOG_DAEMON
で記録されます。
.Ar debug_level
に 1 を指定すると、プロトコル処理毎に 1 行のログが出力されるようになります。
.It Fl g
.Fl g
オプションは、
.Ar grace period
を秒単位で指定するためのものです。
グレースピリオドの間、
サーバ再起動前に存在したロックを再初期化しているホストからの要求のみを
.Nm
は受け付けます。
デフォルトは 30 秒です。
.El
.Pp
エラーの状態は、デバッグレベルに関係なく、ログレベルが
.Dv LOG_ERR
で
ファシリティが
.Dv LOG_DAEMON
として syslog を通して記録されます。
.Pp
.Nm
ユーティリティは
.Xr inetd 8
から起動してはいけません。これは、プロトコルが、システムの開始時に
デーモンが起動されていることを仮定しているためです。
デーモンは
.Xr rc.conf 5
で設定して、ネットワークの開始後に起動されるべきです。
.Sh 関連ファイル
.Bl -tag -width /usr/include/rpcsvc/nlm_prot.x -compact
.It Pa /usr/include/rpcsvc/nlm_prot.x
ネットワークロックマネージャプロトコルの RPC プロトコル仕様。
.El
.Sh 関連項目
.Xr syslog 3 ,
.Xr rc.conf 5 ,
.Xr rpc.statd 8
.Sh バグ
現在の実装は、共有可能であっても、ロック要求を直列化してしまいます。
.Sh 規格
実装は、次の仕様を元にしています。
.Rs
.%B "X/Open CAE Specification C218"
.%T "Protocols for X/Open PC Interworking: XNFS, Issue 4"
.%O ISBN 1 872630 66 9
.Re
.Sh 歴史
本バージョンの
.Nm
は
.Tn SunOS
4 に登場しました。
