freebsd/freebsd-doc/documentation/manual-pages/ja/man8/setfmac.8
.\" Copyright (c) 2002, 2004 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by Chris
.\" Costello at Safeport Network Services and NAI Labs, the Security
.\" Research Division of Network Associates, Inc. under DARPA/SPAWAR
.\" contract N66001-01-C-8035 ("CBOSS"), as part of the DARPA CHATS
.\" research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/setfmac/setfmac.8,v 1.10 2004/02/18 05:40:15 rwatson Exp %
.\" $FreeBSD$
.Dd February 17, 2004
.Dt SETFMAC 8
.Os
.Sh 名称
.Nm setfmac
.Nd ファイルシステムオブジェクトへの MAC ラベルの設定
.Sh 書式
.Nm setfmac
.Op Fl hqR
.Ar label
.Ar
.Sh 解説
.Nm setfmac
ユーティリティは、
指定された MAC ラベルを指定されたファイルへ割り当てます。
次のオプションが利用可能です:
.Bl -tag -width indent
.It Fl R
ファイル自身だけではなく、
指定されたファイルを根とするファイル階層に対し、ラベルを設定します。
.It Fl h
ファイルがシンボリックリンクの場合、
リンクで指されるファイルではなくリンクのラベルを変更します。
.It Fl q
実行中、致命的でない警告は表示しません。
.El
.Sh 関連項目
.Xr mac 3 ,
.Xr mac_set_file 3 ,
.Xr mac_set_link 3 ,
.Xr mac 4 ,
.Xr re_format 7 ,
.Xr getfmac 8 ,
.Xr setfsmac 8 ,
.Xr mac 9
