freebsd/freebsd-doc/documentation/manual-pages/ja/man8/tcpdmatch.8
.\" $FreeBSD$
.TH TCPDMATCH 8
.SH 名称
tcpdmatch \- tcp ラッパの預言者
.SH 書式
tcpdmatch [-d] [-i inet_conf] daemon client
.sp
tcpdmatch [-d] [-i inet_conf] daemon[@server] [user@]client
.SH 解説
.PP
\fItcpdmatch\fR は、
サービスに対する固有の要求を tcp ラッパがどのように扱うかを予測します。
使用例は後述します。
.PP
このプログラムは、
\fItcpd\fR のアクセス制御表
(デフォルトでは \fI/etc/hosts.allow\fR と \fI/etc/hosts.deny\fR です)
を検査し、そのまとめを表示します。
精度を最大にするために、
\fIinetd\fR または \fItlid\fR のネットワーク設定ファイルから、
追加の情報を取得します。
.PP
\fItcpdmatch\fR がアクセス制御表の中から一致を見つけると、
一致したルールを示します。
さらに、付随するシェルコマンドもしくは拡張オプションを、
清書して表示します;
これにより、あなたの期待したものとプログラムが解釈したものとの間の食い違いを、
容易に発見できるようにします。
.SH 引数
次に示す 2 つの引数が、常に必要です:
.IP daemon
デーモンのプロセス名。
典型的には、デーモンの実行パス名の最後の部分です。
.IP client
ホスト名かネットワークアドレス、
または `unknown' か `paranoid' のワイルドカードパターンです。
.sp
ここでクライアントのホスト名が指定されると、
そのクライアントホスト名に対して列挙されている各アドレスに対して、
\fItcpdmatch\fR は予測します。
.sp
ここでクライアントのアドレスが指定されると、
クライアント名の検索に失敗した時に \fItcpd\fR がどう判断するのかを、
\fItcpdmatch\fR は予測します。
.PP
オプションの情報を、\fIdaemon@server\fR の形式で指定します:
.IP server
ホスト名かネットワークアドレス、
または `unknown' か `paranoid' のワイルドカードパターンです。
デフォルトのサーバ名は `unknown' です。
.PP
オプションの情報を、\fIuser@client\fR の形式で指定します:
.IP user
クライアントユーザ識別子です。
典型的には、ログイン名か、数値のユーザ id です。
デフォルトのユーザ名は `unknown' です。
.SH オプション
.IP -d
デフォルトのものでなく、
カレントディレクトリのファイル \fIhosts.allow\fR と \fIhosts.deny\fR を
検査します。
.IP "-i inet_conf"
\fIinetd.conf\fR か \fItlid.conf\fR の
ネットワーク設定ファイルを \fItcpdmatch\fR が見付けられないときか、
誤ったものを使っている疑いがあるときに、
このオプションを使用してください。
.SH 使用例
ローカルシステムからの telnet 要求を \fItcpd\fR がどのように扱うかを
予測するには、次のようにします:
.sp
.ti +5
tcpdmatch in.telnetd localhost
.PP
同じ要求を、ホスト名検索の失敗を装って、試します:
.sp
.ti +5
tcpdmatch in.telnetd 127.0.0.1
.PP
クライアント名がクライアントアドレスと一致しないときに
tcpd がどうするかを予測するには、次のようにします:
.sp
.ti +5
tcpdmatch in.telnetd paranoid
.PP
システムによっては、
デーモンの名前に `in.' プレフィックスが付かないものや、
\fItcpdmatch\fR が inetd 設定ファイルの位置を見付けるのに補助が必要なものが
あります。
.SH 関連ファイル
.PP
\fItcpd\fR のアクセス制御表の、デフォルトの置場は次の通りです:
.PP
/etc/hosts.allow
.br
/etc/hosts.deny
.SH 関連項目
.na
.nf
tcpdchk(8), tcpd の設定チェッカ。
hosts_access(5), tcpd のアクセス制御表の書式。
hosts_options(5), 言語拡張の書式。
inetd.conf(5), inetd 制御ファイルの書式。
tlid.conf(5), tlid 制御ファイルの書式。
.SH 作者
.na
.nf
Wietse Venema (wietse@wzv.win.tue.nl),
Department of Mathematics and Computing Science,
Eindhoven University of Technology
Den Dolech 2, P.O. Box 513,
5600 MB Eindhoven, The Netherlands
.\" @(#) tcpdmatch.8 1.5 96/02/11 17:01:35
