freebsd/freebsd-doc/documentation/manual-pages/ja/man8/tunefs.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)tunefs.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/sbin/tunefs/tunefs.8,v 1.34 2004/04/09 19:58:40 markm Exp %
.\"
.\" $FreeBSD$
.\"
.Dd May 18, 2002
.Dt TUNEFS 8
.Os
.Sh 名称
.Nm tunefs
.Nd 既存のファイルシステムをチューンする
.Sh 書式
.Nm
.Op Fl A
.Op Fl a Cm enable | disable
.Op Fl e Ar maxbpg
.Op Fl f Ar avgfilesize
.Op Fl L Ar volname
.Op Fl l Cm enable | disable
.Op Fl m Ar minfree
.Op Fl n Cm enable | disable
.Op Fl o Cm space | time
.Op Fl p
.Op Fl s Ar avgfpdir
.Ar special | filesystem
.Sh 解説
.Nm
ユーティリティは、
ファイルシステムのレイアウト方針に影響する動的なパラメータを
変更するために使います。
.Nm
ユーティリティは、動作中のファイルシステムに対しては使用できません。
動作中のファイルシステムを変更するには、
読み取り専用にダウングレードするか、アンマウントする必要があります。
.Pp
変更するパラメータは以下のフラグで指定します:
.Bl -tag -width indent
.It Fl A
ファイルシステムはスーパブロックのバックアップをいくつか持っています。
このオプションを指定すると、全てのバックアップの内容は
プライマリスーパブロックと同じく変更されます。
これはかなりの危険を秘めています。実行する時は気をつけて下さい。
.It Fl a Cm enable | disable
管理上の ACL 有効化フラグをオン/オフします。
.It Fl d Ar rotdelay
同じディスクに対する転送完了割り込みサービスと
次の転送を開始する時間の期待値をミリ秒単位で指定します。
この値は、回転遅延によるファイル中のブロック間隔を決めるのに使います。
.It Fl e Ar maxbpg
単一のファイルが他のシリンダグループへまたがる前に、1 つのシリンダグループ
から割り当てることのできる最大のブロック数を指定します。
普通は、この値にはシリンダグループのブロック数の約 1/4 が使われます。
この値は、単一のファイルが 1 つのシリンダグループのブロックを使いつくして
しまうことを防ぐために指定します。
なぜなら、これによって、そのシリンダグループに続いて配置される
すべてのファイルのアクセス速度を低下させてしまうからです。
この制限によって、大きなファイルに対しては 1 つのシリンダに配置するよりも、
長いシークをより頻繁に行わせることがあります。
極端に大きなファイルのあるファイルシステムに対しては、
このパラメータは大きな値にすべきです。
.It Fl f Ar avgfilesize
ファイルサイズの期待値を指定します。
.It Fl L Ar volname
オプションのファイルシステムボリュームラベルを追加/修正します。
.It Fl l Cm enable | disable
MAC マルチラベルフラグをオン/オフします。
.It Fl m Ar minfree
一般ユーザが利用することができない領域の割合を指定します。
これは最低限の空き領域のしきい値となります。
デフォルト値は 8% です。
しきい値を下げると、性能に悪影響があり得ます:
.Bl -bullet
.It
5% 以下にすると常に最適化は space 優先になってしまい、
ファイル書き込みのオーバヘッドがかなり増えます。
.It
予約分を含んだトータルの空きスペースが 15% を割り込むと、
ファイルシステムがフラグメントを避ける能力が減少します。
空きスペースが 0 に近付くと、10% のしきい値を設けた場合と比較し、
性能が最大 3 倍まで落ちてしまいます。
.El
.Pp
もしこの値を現在の空き領域より大きな値に引き上げると、
ファイルを削除してその値を満たすだけの空き領域を用意するまで、
ユーザはファイルを作成することができなくなります。
.It Fl n Cm enable | disable
ソフトアップデートをオン/オフします。
.It Fl o Cm space | time
ファイルシステムの最適化において、
ブロック割り当てにかかる時間を最小化するか、
もしくはディスク上のフラグメントサイズを最小にするかの
いずれかを選択できます。
space 優先の場合、
ファイル書き込みのオーバヘッドは大きくなります。
カーネルは通常、
ファイルシステムのフラグメントの割合に応じて自動的に優先を変化させます。
.It Fl p
このオプションは、
指定されたファイルシステムにおいて現在変更可能な設定のまとめを表示します。
詳細は
.Xr dumpfs 8
ユーティリティを参照してください。
.It Fl s Ar avgfpdir
ディレクトリあたりのファイル数の期待値を指定します。
.El
.Pp
前述のフラグのうち 1 個は必須です。
.Sh 関連ファイル
.Bl -tag -width ".Pa /etc/fstab"
.It Pa /etc/fstab
これを読み取ることで、
指定されたマウントポイントに対応するデバイスファイルを決定します。
.El
.Sh 関連項目
.Xr fs 5 ,
.Xr dumpfs 8 ,
.Xr newfs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T "A Fast File System for UNIX"
.%J "ACM Transactions on Computer Systems 2"
.%N 3
.%P pp 181-197
.%D August 1984
.%O "(reprinted in the BSD System Manager's Manual, SMM:5)"
.Re
.Sh バグ
本ユーティリティは、動作中のファイルシステムに対しても動作すべきです。
.\" Take this out and a Unix Daemon will dog your steps from now until
.\" the time_t's wrap around.
.Pp
ファイルシステムをチューンする事はできても、ファイルの中身までは
チューンできません:-)
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.2
から登場しました。
