freebsd/freebsd-doc/documentation/manual-pages/ja/man8/vipw.8
.\"	%NetBSD: vipw.8,v 1.4 1995/01/20 19:19:56 mycroft Exp %
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)vipw.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/vipw/vipw.8,v 1.13 2004/08/07 04:28:56 imp Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 6, 1993
.Dt VIPW 8
.Os
.Sh 名称
.Nm vipw
.Nd パスワードファイルの編集
.Sh 書式
.Nm
.Op Fl d Ar directory
.Sh 解説
.Nm
ユーティリティは、適切なロックをしてパスワードファイルの編集を行い、
ロックを解除した後で必要な処理を行います。すでに他のユーザによって
パスワードファイルが編集中でロックされていた場合には、
.Nm
は後で再度実行するように知らせます。
デフォルトでは、
.Xr vi 1
がエディタとして使用されます。
.Pp
オプションを指定せずに実行すると、
.Nm
は
.Pa /etc
のパスワードファイルに対して動作します。
.Fl d
オプションを使用することにより、別の
.Ar directory
に対して動作させることが可能です。
.Pp
.Nm
ユーティリティはパスワードファイルエントリの多くの整合性をチェックし、
.Dq 間違った
エントリを
含むパスワードファイルがインストールされないようにします。
間違っていた場合にはユーザに再編集を要求します。
.Pp
パスワードファイルの情報が正しいことが確かめられると、
.Nm
は
.Xr pwd_mkdb 8
を使ってデータベースを更新します。
これはバックグラウンドで行われ、
大きなサイトでは数分かかります。
この更新が終了するまで、他でパスワードファイルを更新したり、
新しい情報をプログラムで利用することはできません。
.Sh 環境変数
以下の環境変数が
.Nm
で参照されます。
.Bl -tag -width PW_SCAN_BIG_IDS
.It Ev EDITOR
起動するエディタを指定します。指定がなければ
.Xr vi 1
を使用します。
.It Ev PW_SCAN_BIG_IDS
.Xr pwd_mkdb 8
を参照してください。
.El
.Sh 関連項目
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr passwd 5 ,
.Xr adduser 8 ,
.Xr pwd_mkdb 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.0
から登場しました。
