<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/news/1998/index.sgml,v 1.2 2004/01/06 17:31:42 stephane Exp $">
<!ENTITY title "FreeBSD flash info ! (1998)">
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
<!ENTITY newshome '<a href="../news.html">Accueil nouvelles</a>'>
<!ENTITY % newsincludes SYSTEM "../includes.sgml"> %newsincludes;
]>

<!-- 
   The FreeBSD French Documentation Project
   Original revision: 1.8
   
   Version francaise : Guillain
   Relecture : Thomas Seyrat
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org> 
-->

<html>
    &header;

    <h2>D&eacute;cembre 1998</h2>

    <ul>
      <li><p><b>28-D&eacute;c-98</b>
	A moins que les circonstances n'en d&eacute;cident autrement, FreeBSD 3.0 ouvrira 
   la branche -current tard dans la journ&eacute;e du 15 janvier 1999. La version 3.1 
   suivra 30 jours plus tard, le 15 f&eacute;vrier 1999. Les d&eacute;voloppeurs doivent 
   consid&eacute;rer cela comme une ANNONCE ANTICIPEE de l'&eacute;v&egrave;nement.</p></li>

      <li><p><b>13-D&eacute;c-98</b>
   Walnut Creek CD-ROM ouvre la <a 
   href="http://www.freebsdmall.com/">boutique FreeBSD</a>, un site 
   d&eacute;di&eacute; &agrave; l'aspect commercial de FreeBSD, comprenant des add-ons, 
   du mat&eacute;riel et du support technique commercial. Pour faire connaitre ou vendre vos 
   propres produits ou services, contactez BSDi.</p></li>
    </ul>

    <h2>Novembre 1998</h2>

    <ul>
      <li><p><b>30-Nov-98</b>
   Sortie de <a href="&base;/releases/2.2.8R/announce.html">FreeBSD 2.2.8</a>. 
   Consultez la page d'<a 
   href="&base;/releases/index.html">informations sur les versions</a> pour 
   plus de d&eacute;tails. V&eacute;rifiez aussi la page <a 
   href="&base;/releases/2.2.8R/errata.html">errata</a>, apr&egrave;s 
   installation, pour les erreurs de derni&egrave;re minute avec la 2.2.8 que
   vous devez conna&icirc;tre.</p></li>

      <li><p><b>26-Nov-98</b>
   <a href="http://www.freebsdrocks.com/">FreeBSD Rocks</a> est une 
   initiative qui permet &agrave; la communaut&eacute; FreeBSD de se tenir au courant 
   des derni&egrave;res nouvelles, logiciels et ressources concernant FreeBSD. Le site contient 
   un moteur de recherche qui permet de trouver facilement un mot clef dans l'historique 
   des articles. Les pages sont r&eacute;actualis&eacute;es quotidiennement et chacun est invit&eacute; &agrave; 
   s'inscrire et &agrave; envoyer des articles. Si cela est arriv&eacute; aujourd'hui, vous le verrez 
   sur FreeBSDRocks.</p></li>
    </ul>

    <h2>Octobre 1998</h2>

    <ul>
      <li><p><b>15-Oct-98</b>
   Sortie de <a href="&base;/releases/3.0R/announce.html">FreeBSD 3.0</a>. 
   Consultez la page d'<a 
   href="&base;/releases/index.html">informations sur les versions</a> pour 
   plus de d&eacute;tails. V&eacute;rifiez aussi la page <a 
   href="&base;/releases/3.0R/errata.html">errata</a>, apr&egrave;s 
   installation, pour les erreurs de derni&egrave;re minute avec la 3.0 que 
   vous devez conna&icirc;tre.</p></li>
    </ul>

    <h2>Septembre 1998</h2>

    <ul>
      <li><p><b>15-Sep-98</b>
   Le 15 septembre est la date pr&eacute;vue pour les versions BETA de 
   l'arborescence 3.0-CURRENT. Comme tout le monde le sait 
   (devrait le savoir), la sortie de la 3.0 est pr&eacute;vue 
   pour le 15 octobre, ce qui nous laisse 30 bons jours 
   pour la p&eacute;riode BETA. Entretemps, personne n'a int&eacute;r&ecirc;t &agrave; introduire 
   de travail important ou bien &agrave; perturber l'arborescence 3.0-CURRENT
   pour &eacute;viter de violer l'id&eacute;e g&eacute;n&eacute;rale d'une version BETA (vous &ecirc;tes 
   suppos&eacute; tester ce que vous avez et non changer de point de vue tous 
   les deux jours :) ).</p></li>

      <li><p><b>13-Sep-98</b>
   Apr&egrave;s plus d'un an de d&eacute;veloppement, la couche M&eacute;thode d'Acc&egrave;s Commun 
   SCSI (CAM : Common Access Method) pour FreeBSD sera int&eacute;gr&eacute;e &agrave; la 3.0-CURRENT 
   le dimanche 13 septembre. L'&eacute;quipe de d&eacute;veloppement de CAM est en train de 
   s'assurer que le processus d'int&eacute;gration sera aussi doux que 
   possible, donc comprenez que, ces jours-ci, nous ne puissions r&eacute;pondre 
   rapidement aux questions au sujet de CAM.</p></li>

      <li><p><b>09-Sep-98</b>
	Perl5 est d&eacute;somais int&eacute;gr&eacute; &agrave; l'arborescence des sources 
   de la 3.0-CURRENT.</p></li>

      <li><p><b>05-Sep-98</b>
   <a name="giveaway" href="http://visar.csustan.edu/">La liste 
   de distribution de c&eacute;d&eacute;roms BSD</a>. Si quelqu'un a un c&eacute;d&eacute;rom 
   qu'il veut donner (le destinataire paie les frais de port) ou 
   pr&ecirc;ter, il peut inscrire son adresse &eacute;lectronique sur la liste. 
   Du mat&eacute;riel et des livres peuvent aussi &ecirc;tre donn&eacute;s. Nous 
   encourageons les gens &agrave; donner leurs c&eacute;d&eacute;roms aux biblioth&egrave;ques 
   locales et &agrave; les mettre aussi sur la liste.</p></li>

      <li><p><b>01-Sep-98</b>
   Le premier num&eacute;ro de Daemon News arrive un jour plus t&ocirc;t. Ce magazine &eacute;lectronique est 
   fait par la communaut&eacute; BSD pour la communaut&eacute; BSD. Allez voir <a 
   href="http://www.daemonnews.org/">http://www.daemonnews.org</a></p></li>
    </ul>

    <h2>Ao&ucirc;t 1998</h2>

    <ul>
      <li><p><b>31-Ao&ucirc;-98</b>
   La branche FreeBSD -CURRENT (la future 3.0-RELEASE) est pass&eacute;e du 
   format a.out &agrave; ELF. Les personnes concern&eacute;es ont fait du bon travail; 
   la transition s'est faite sans accroc. Consultez les archives de la liste <a
   href="http://www.FreeBSD.org/search/search.html">freebsd-current@FreeBSD.org</a> 
   pour plus d'informations sur la transition vers ELF.</p></li>

      <li><p><b>23-Ao&ucirc;-98</b>
   Sortie de l'utilitaire Suidcontrol-0.1. Il s'agit d'un utilitaire 
   exp&eacute;rimental pour la gestion des suid/sgid sous FreeBSD. 
   Vous pouvez obtenir plus d'informations sur <a 
   href="http://www.watson.org/fbsd-hardening/suidcontrol.html">http://www.watson.org/fbsd-hardening/suidcontrol.html</a></p></li>

      <li><p><b>09-Ao&ucirc;-98</b>
   Publication du guide de s&eacute;curit&eacute; de FreeBSD. Cet ouvrage est 
   actuellement en b&eacute;ta et se trouve sur <a 
   href="http://www.best.com/~jkb/howto.txt">http://www.best.com/~jkb/howto.txt</a></p></li>
    </ul>

    <h2>Juillet 1998</h2>

    <ul>
      <li><p><b>22-Jul-98</b>
   Sortie de FreeBSD 2.2.7. Consultez la page d'<a 
   href="&base;/releases/index.html">informations sur les versions</a> pour 
   plus de d&eacute;tails. V&eacute;rifiez aussi la page <a 
   href="ftp://ftp.FreeBSD.org/pub/FreeBSD/2.2.7-RELEASE/ERRATA.TXT">errata</a>, 
   apr&egrave;s installation, pour les erreurs de derni&egrave;re minute avec la 2.2.7 que vous
   devez conna&icirc;tre.</p></li>

      <li><p><b>16-Jul-98</b>
   Un effort de documentation "FreeBSD pour les utilisateurs Linux" a 
   commenc&eacute;. Veuillez consulter la <a href="&base;/docproj/current.html">liste des 
   projets de documentations actuels</a> pour plus 
   d'informations.</p></li>

      <li><p><b>13-Jul-98</b>
   <a href="mailto:jkh@FreeBSD.org">Jordan Hubbard</a> a &eacute;crit un <a 
   href="http://editorials.freshmeat.net/jordan980713/">&eacute;ditorial</a> 
   sur le pass&eacute; et le futur de la communaut&eacute; Unix.</p></li>

      <li><p><b>09-Jul-98</b>
   La <a href="http://www.es.FreeBSD.org/es/FAQ/FAQ.html">traduction 
   espagnole</a> de la <a href="&enbase;/doc/en_US.ISO8859-1/books/faq/index.html">FAQ</a> a &eacute;t&eacute; 
   achev&eacute;e par le <a href="http://www.es.FreeBSD.org/es/">Projet de 
   Documentation Espagnole</a>. Pour plus d'informations, voyez la <a 
   href="&base;/docproj/translations.html">page des 
   traductions</a>.</p></li>
    </ul>

    <h2>Mai 1998</h2>

    <ul>
      <li><p><b>30-Mai-98</b>
   FreeBSD et Apache sont utilis&eacute;s dans <a 
   href="http://www.WebTechniques.com/features/1998/05/engelschall/engelschall.shtml">ce 
   tr&egrave;s int&eacute;ressant article</a> pour impl&eacute;menter un site web utilisant le DNS round-robin 
   dans <a 
   href="http://www.WebTechniques.com/">WEBTechniques.com</a>.</p></li>

      <li><p><b>23-Mai-98</b>
   Le second num&eacute;ro de la lettre d'information FreeBSD est disponible au <a 
   href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/newsletter/issue2.pdf">format 
   Adobe PDF</a> (aussi par <a 
   href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/newsletter/issue2.pdf">FTP</a>). 
   Un <a href="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/newsletter/README.TXT">fichier 
   d'aide</a> est disponible pour vous assister dans le choix et l'utilisation d'un 
   lecteur PDF. Propositions d'articles, publicit&eacute;s et lettres peuvent &ecirc;tre 
   envoy&eacute;es &agrave; <a href="mailto:newsletter@FreeBSD.org">newsletter@FreeBSD.org</a>.</p></li>
	
      <li><p><b>01-Mai-98</b>
   Le projet FreeBSD a mis en place un <a name="anoncvs" 
   href="&enbase;/doc/en_US.ISO8859-1/books/handbook/synching.html#ANONCVS">CVS anonyme</a> pour 
   l'<a href="http://cvsweb.FreeBSD.org/">arborescence CVS 
   de FreeBSD</a>. Entre autres choses, cela permet aux utilisateurs de FreeBSD 
   d'effectuer, sans privil&egrave;ges particuliers, des op&eacute;rations CVS en lecture seule 
   sur un des serveurs anonCVS officiels du Projet FreeBSD.</p></li>
    </ul>

    <h2>Avril 1998</h2>

    <ul>
      <li><p><b>16-Avr-98</b>
   Les quatre nouveaux c&eacute;d&eacute;roms de FreeBSD 2.2.6 sont disponibles et vont commencer, 
   d&egrave;s demain, &agrave; &ecirc;tre exp&eacute;di&eacute;s aux abonn&eacute;s et &agrave; ceux qui les ont pr&eacute;-command&eacute;s. Pour 
   plus d'informations sur le contenu des c&eacute;d&eacute;roms : <a 
   href="http://www.wccdrom.com/">http://www.wccdrom.com</a>.</p></li>

      <li><p><b>11-Avr-98</b>
   Le nouveau projet FreeBSD, Groupe 
   Mozilla FreeBSD, vient de voir le jour. Il supporte et 
   am&eacute;liore le navigateur web libre de Netscape, aussi connu 
   sous le nom de <a href="http://www.mozilla.org/">Mozilla</a>.</p></li>
    </ul>

    <h2>Mars 1998</h2>

    <ul>
      <li><p><b>25-Mar-98</b>
   Sortie de FreeBSD 2.2.6. Consultez la page d'<a 
   href="&base;/releases/index.html">informations sur les versions</a> pour 
   plus de d&eacute;tails. V&eacute;rifiez aussi la page <a 
   href="ftp://ftp.FreeBSD.org/pub/FreeBSD/2.2.6-RELEASE/ERRATA.TXT">errata</a>, 
   apr&egrave;s installation, pour les erreurs de derni&egrave;re minute avec la 
   2.2.6 que vous devez conna&icirc;tre.</p></li>
    </ul>

    <h2>F&eacute;vrier 1998</h2>

    <ul>
      <li><p><b>08-F&eacute;v-98</b>
   Une page d&eacute;taillant la <a href="&base;/y2kbug.html">conformit&eacute; de FreeBSD 
   &agrave; l'an 2000</a> est disponible &agrave; partir de la page <a 
   href="&base;/docs.html">Documentation</a>.</p></li>
    </ul>

    <h2>Janvier 1998</h2>

    <ul>
      <li><p><b>08-Jan-98</b>
   Le support am&eacute;lior&eacute; des cartes Plug-and-Play est d&eacute;sormais int&eacute;gr&eacute; 
   dans les branches 3.0-CURRENT et 2.2-STABLE. Les sources sont 
   disponibles depuis l'utilitaire <a 
   href="&enbase;/doc/en_US.ISO8859-1/books/handbook/synching.html#CVSUP">CVSup</a> et les 
   versions binaires depuis <a 
   href="ftp://current.FreeBSD.org/pub/FreeBSD">current.FreeBSD.org</a></p></li>
    </ul>
    
      &newshome;
      &footer;
  </body>
</html>
