<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY dedate "$FreeBSDde: de-www/docproj/sgml.sgml,v 1.2 2008/02/24 11:23:07 jkois Exp $">
<!ENTITY reference "basiert auf: 1.28">
<!ENTITY title "FreeBSD Documentation Project: SGML">
<!ENTITY % navinclude.docs "INCLUDE">
]>

<html>
  &header;

    <p>Das Documentation Project verwendet SGML zur Erstellung der
      Dokumentation.</p>

    <p>SGML steht f&uuml;r <b>S</b>tandard <b>G</b>eneralized <b>M</b>arkup
      <b>L</b>anguage.</p>

    <p>Kurz gesagt (SGML-Puristen m&ouml;gen dies verzeihen) handelt
      es sich bei SGML um eine Sprache zum Schreiben anderer
      Sprachen.</p>

    <p>Wahrscheinlich haben Sie SGML bereits verwendet, ohne dass Sie
      sich dessen bewusst sind.  So verf&uuml;gt beispielsweise HTML
      (die Sprache, in der zahlreiche Internetseiten geschrieben sind)
      &uuml;ber eine formale Beschreibung, die in SGML verfasst wurde.
      Wenn Sie HTML verwenden, verwenden Sie aber trotzdem <b>kein</b>
      SGML, sondern eine Sprache, die in SGML definiert wurde.</p>

    <p>Es gibt zahlreiche, in SGML definierte Sprachen.  HTML ist
      dabei lediglich eine unter vielen Sprachen.  Eine weitere
      bekannte Sprache ist "DocBook".  Diese Sprache wurde speziell
      daf&uuml;r entwickelt, technische Dokumentationen zu schreiben.
      Dazu verf&uuml;gt sie &uuml;ber zahlreiche Tags (also Markierungen
      der Form <tt>&lt;Tag&nbsp;Inhalt&gt;</tt>), um diese
      Dokumentationen f&uuml;r deren anschlie&szlig;ende
      Formatierung zu beschreiben.
      Das FreeBSD Documentation Project hat DocBook an seine
      Bed&uuml;rfnisse angepasst und unter anderem einige neue
      Elemente definiert, um die Sprache pr&auml;ziser zu machen.</p>

    <p>Sehen Sie sich dazu den folgenden (in HTML geschriebenen)
      Absatz an. Der Inhalt ist Nebensache, konzentrieren Sie sich
      auf die verwendeten Tags:</p>

    <pre><![ CDATA [
    <p>The system's passwords are stored in <tt>/etc/passwd</tt>. To edit
      this file you should use <b><tt>vipw</tt></b>. However, if you just
      want to add a new user you can use <b><tt>adduser</tt></b>.</p>
]]></pre>

    <p>Der gleiche (diesmal in DocBook geschriebene) Absatz sieht
     folgenderma&szlig;en aus:</p>

    <pre><![ CDATA [
    <para>The system's passwords are stored in
      <filename>/etc/passwd</filename>. To edit this file you should use
      <command>vipw</command>. However, if you just want to add a new user
      you can use <command>adduser</command>.</para>
]]></pre>

    <p>Wie Sie sehen, ist DocBook "ausdrucksst&auml;rker" als HTML.
      In HTML wird der Dateiname als "in Schreibenmaschinenschrift
      darzustellen" markiert.  In DocBook wird der Dateiname hingegen
      als "filename" markiert.  Es wird allerdings nicht angegeben,
      wie "filename" dargestellt werden soll.</p>

    <p>Diese Vorgehensweise hat mehrere Vorteile:</p>

    <ul>
      <li><p>Sie ist eindeutig und konsistent.</p>

	  <p>Sie verlieren keine Zeit mit &Uuml;berlegungen wie
	    "Hm, ich muss einen Dateinamen darstellen, nehme ich
	    daf&uuml;r 'tt', 'b', oder besser doch 'em'?"</p>

	  <p>Stattdessen verwenden Sie einfach das der jeweiligen
	    Situation angepasste Tag.</p>

	  <p>Die Konvertierung von DocBook in andere Formate wie
	    HTML oder PostScript&reg; stellt sicher, dass alle
	    Dateinamen innerhalb des Dokuments gleich dargestellt
	    werden.</p>
      </li>

      <li><p>Sie m&uuml;ssen sich keine Gedanken mehr &uuml;ber die
	    Darstellung Ihres Dokuments machen, sondern k&ouml;nnen
	    sich auf den Inhalt konzentrieren.</p>
      </li>

      <li><p>Da die Dokumentation nicht an ein bestimmtes Format
	    gebunden ist, kann die gleiche Dokumentation in viele
	    verschiedene Formate (wie normalen Text, HTML, PostScript,
	    RTF, PDF und andere mehr) konvertiert werden.</p></li>

      <li><p>Die Dokumentation ist 'intelligenter' und erlaubt dadurch
	    auch anspruchsvollere Dinge, wie die automatische
	    Erstellung eines Index mit allen innerhalb des Dokuments
	    verwendeten Befehlen.</p></li>
    </ul>

    <p>Mit DocBook erstellte Dokumente haben eine gewisse
      &Auml;hnlichkeit mit den von Microsoft&reg; Word bekannten
      Dokumentvorlagen, sind aber sehr viel m&auml;chtiger.</p>

    <p>Diese besonderen F&auml;higkeiten haben aber ihren Preis:</p>

    <ul>
      <li><p>Da es sehr viele Tags gibt, dauert es l&auml;nger, bis
	    Sie alle kennen werden und optimal einsetzen k&ouml;nnen.</p>

	  <p>Um die Lernkurve zu verflachen, ist es sehr hilfreich,
	    sich Dokumentationen anderer Autoren anzusehen, um zu sehen,
	    wie diese &auml;hnliche Informationen beschreiben.</p>
      </li>

      <li><p>Der Konvertierungsprozess ist relativ komplex.</p></li>
    </ul>

    <h2>Sie k&ouml;nnen kein DocBook.  K&ouml;nnen Sie das Documentation
      Project trotzdem unterst&uuml;tzen?</h2>

    <p>Nat&uuml;rlich.  Jede Dokumentation ist besser als keine
      Dokumentation.  Es ist kein gro&szlig;es Problem, wenn Ihr Beitrag
      nicht als DocBook formatiert ist.</p>

    <p><a href="submitting.html">Reichen</a> Sie Ihren Beitrag einfach
      ein.  Jemand aus dem Documentation Project wird Ihren Beitrag
      &uuml;bernehmen, ihn in DocBook formatieren und committen.
      Vielleicht erhalten Sie den formatierten Text sogar zur&uuml;ck.
      Dann k&ouml;nnen Sie einen &quot;Vorher-/Nachher-Vergleich&quot;
      durchf&uuml;hren und so etwas mehr &uuml;ber DocBook lernen.</p>

    <p>Da Ihr Beitrag in diesem Fall aber zuerst in DocBook formatiert
      werden muss, verlangsamt sich der Konvertierungsprozess etwas,
      es kann daher bis zu einigen Tagen dauern, bis Ihr Beitrag
      committet wird.</p>

    <h2>Gibt es weitere Informationen zu SGML und DocBook?</h2>

    <p>Lesen Sie zuerst den <a
      href="&enbase;/doc/de_DE.ISO8859-1/books/fdp-primer/index.html">
      <b>Documentation Project Primer</b></a>.  Dieser enth&auml;lt eine
      ausf&uuml;hrliche Beschreibung aller Dinge, die Sie zur Arbeit
      an der FreeBSD Dokumentation ben&ouml;tigen.  Er ist in mehrere
      Abschnitte unterteilt, kann aber auch als <a
      href="&enbase;/doc/de_DE.ISO8859-1/books/fdp-primer/book.html">
      <b>eine einzelne gro&szlig;e Seite</b></a> aufgerufen werden.</p>

    <dl>
      <dt><a
	  href="http://www.oasis-open.org/cover/sgml-xml.html"><b>http://www.oasis-open.org/cover/sgml-xml.html</b></a></dt>

      <dd><p>Die offiziellen SGML/XML-Internetseiten mit zahlreichen
	  Links zu SGML-Ressourcen.</p></dd>

      <dt><a
	  href="http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html"><b>http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html</b></a></dt>

      <dd><p>"The Gentle Introduction to SGML" ist f&uuml;r alle
	  empfehlenswert, die mehr &uuml;ber SGML (insbesondere aus der
	  Sicht eines Einsteigers) wissen wollen.</p></dd>

      <dt><a
	  href="http://www.oasis-open.org/docbook/"><b>http://www.oasis-open.org/docbook/</b></a></dt>

      <dd><p>Die offizielle DocBook DTD wird von OASIS gewartet.  Diese Seiten
	  richten sich besonders an Personen, die mit SGML bereits vertraut sind
	  und nun DocBook lernen wollen.</p>
	</dd>
    </dl>

      <p></p><a href="docproj.html">Startseite des FreeBSD Documentation Projects</a>
  &footer;
  </body>
</html>
