<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY url.articles "&enbase;/doc/en_US.ISO8859-1/articles">
<!ENTITY date "$FreeBSD$">
<!ENTITY dedate "$FreeBSDde: de-www/docproj/submitting.sgml,v 1.2 2008/12/09 09:50:54 jkois Exp $">
<!ENTITY reference "basiert auf: 1.18">
<!ENTITY title "FreeBSD Documentation Project: Beitr&auml;ge einreichen">
<!ENTITY % navinclude.docs "INCLUDE">
]>

<html>
  &header;

    <h2>Ich habe eine neue Anleitung geschrieben.  Wie kann ich diese
      einreichen?</h2>

    <p>Danke, dass Sie unsere Dokumentation erweitern wollen.</p>

    <p>Sie m&uuml;ssen Ihre Dokumentation dem Documentation Project zur
      Verf&uuml;gung stellen, damit Ihr Beitrag gepr&uuml;ft werden kann.
      Dazu hinterlegen Sie das Dokument beispielsweise auf einem FTP-
      oder Webserver.</p>

    <p>Danach schicken Sie eine E-Mail an die Mailingliste
      <tt>FreeBSD-doc</tt>, in der Sie Ihren Beitrag kurz beschreiben
      und vor allem mitteilen, wo Sie ihn hinterlegt habt.
      Au&szlig;erdem sollten Sie die Mitglieder des FreeBSD Documentation
      Projects um die Pr&uuml;fung Ihres Beitrags bitten.</p>

    <p>Ist es Ihnen nicht m&ouml;glich, Ihren Beitrag auf einem Server
      zu hinterlegen, k&ouml;nnen Sie ihn auch direkt an die
      Mailingliste <tt>FreeBSD-doc</tt> schicken.  Denken Sie aber daran,
      dass Ihre E-Mail in diesem Fall nur "normalen" Text enthalten
      darf.</p>

    <p>Falls Ihr Beitrag auch f&uuml;r andere Mailinglisten interessant
      ist, sollte Sie Ihre E-Mail als Kopie auch an andere Mailinglisten
      schicken und um Kommentare bitten.  Handelt es sich bei Ihrem
      Beitrag etwa um eine Anleitung zur Aktualisierung des Quellcodes
      mit CVSup, so ist dies auch f&uuml;r die Leser der Mailinglisten
      <tt>FreeBSD-current</tt> und <tt>FreeBSD-stable</tt>
      interessant.</p>

    <p>Nachdem Ihr Beitrag gepr&uuml;ft wurde und Sie eventuelle
      Verbesserungsvorschl&auml;ge in Ihr Dokument aufgenommen haben,
      k&ouml;nnen Sie Ihren Beitrag einreichen.</p>

    <p>Dazu verpacken Sie Ihr Dokument in ein tar-Archiv.  Besteht Ihr
      Dokument beispielsweise aus den drei Dateien <tt>eins</tt>,
      <tt>zwei</tt>, und <tt>drei</tt>, die alle in das gemeinsame
      tar-Archiv <tt>doc.tar</tt> aufgenommen werden sollen, verwenden
      Sie folgenden Befehl:</p>

    <pre>
    % <b>tar cf doc.tar eins zwei drei</b>
    </pre>

    <p>Danach komprimieren Sie das tar-Archiv:</p>

    <pre>
    % <b>gzip -9 doc.tar</b>
    </pre>

    <p>Als Ergebnis erhalten Sie die komprimierte Datei
      <tt>doc.tar.gz</tt>.</p>

    <p>Als letzten Schritt der Vorbereitung kodieren Sie diese Datei
      noch, damit sie von allen E-Mail-Programmen korrekt erkannt und
      verarbeitet wird:</p>

    <pre>
    % <b>uuencode doc.tar.gz doc.tar.gz > doc.uue</b>
    </pre>

    <p>Nun k&ouml;nnen Sie das FreeBSD Documentation Project &uuml;ber
      Ihren Beitrag informieren.  Der korrekte Weg daf&uuml;r ist der
      Einsatz von <b>send-pr</b>, das auf Ihrem System bereits
      installiert sein sollte.  Alternativ k&ouml;nnen Sie auch das <a
      href="&base;/send-pr.html">Internetformular zum Einreichen von
      Problemberichten</a> verwenden.</p>

    <p>Nur so kann sichergestellt werden, dass Ihr Beitrag auch korrekt
      erfasst wird.  Wenn Sie einen Problembericht (PR) einreichen,
      erh&auml;lt dieser eine eindeutige Nummer.  Ein Committer wird
      diesen PR &uuml;bernehmen und Ihrem Beitrag
      weiterbearbeiten.  Weitere Informationen zu diesem Thema finden
      Sie im Artikel <a
      href="&url.articles;/problem-reports/">Writing FreeBSD Problem
      Reports</a>.</p>

    <p>Die Bedienung von <b>send-pr</b> ist relativ einfach.  Die
      Aufgabe des Programms ist es, eine speziell formatierte E-Mail
      an eine bestimmte E-Mail-Adresse zu schicken.  Wenn Sie
      <b>send-pr</b> aufrufen, wird automatisch Ihr Standardeditor
      (beispielsweise <b>vi</b> oder <b>emacs</b>) mit einer
      von Ihnen auszuf&uuml;llenden Vorlage geladen, die auch einige
      zus&auml;tzliche Anweisungen enth&auml;lt.</p>

    <p>Achten Sie beim Ausf&uuml;llen des Formulars darauf, dass Sie
      im Feld "Category" den Wert "docs" eintragen und dass im Feld
      Class" der Eintrag "change-request" steht.  Im "Body"-Bereich
      f&uuml;gen Sie die vorhin erstellte <tt>.uue</tt>-Datei ein.</p>

    <p>Wenn Sie den Editor beenden, wird der PR als E-Mail an die
      korrekte Adresse geschickt.  Kurz darauf erhalten Sie (wiederum
      als E-Mail) eine Best&auml;tigung, die insbesondere die Ihrem
      PR zugewiesene eindeutige Nummer enth&auml;lt.  Diese PR-Nummer
      k&ouml;nnen Sie dazu verwenden, den aktuellen Status Ihres
      Beitrags zu pr&uuml;fen.</p>

    <h2>Ich habe ein bereits vorhandenes Dokument verbessert.  Wie
      kann ich meine Korrekturen einreichen?</h2>

    <p>Danke, dass Sie unsere Dokumentation verbessern wollen.</p>

    <p>In diesem Fall m&uuml;ssen Sie eine spezielle Datei, eine
      sogenannte Differenz (<i>diff</i>) erstellen.  Diese Differenz
      enth&auml;lt alle von Ihnen durchgef&uuml;hrten &Auml;nderungen.
      Dadurch wird es den Committern erleichtert, Ihre &Auml;nderungen
      zu finden und zu pr&uuml;fen.  Sie haben den Vorteil,
      dass Sie nicht umst&auml;ndlich erkl&auml;ren m&uuml;ssen, was
      Sie ge&auml;ndert haben.  Nichtsdestotrotz sollten Sie
      nat&uuml;rlich begr&uuml;nden k&ouml;nnen, warum Sie diese
      &Auml;nderung f&uuml;r n&ouml;tig halten.</p>

    <p>Um eine Differenz (einen "Diff") zu erstellen, gehen Sie wie
      folgt vor:</p>

    <ol>
      <li><p>Erstellen Sie eine Kopie der zu &auml;ndernden Datei
        (in diesem Fall <tt>foo.sgml</tt>): do</p>

	<pre>
    % <b>cp foo.sgml foo.sgml.old</b>
	</pre></li>

      <li><p>Nun f&uuml;hren Sie Ihre &Auml;nderungen in
         foo.sgml durch.</p>

	<pre>
    % <b>vi foo.sgml</b>
    ... tipp tipp tipp ...

    ... &Auml;nderungen testen, Tippfehler suchen und korrigieren ...
	</pre></li>

      <li><p>Danach erzeugen Sie die Differenz:</p>

	<pre>
    % <b>diff -u foo.sgml.old foo.sgml > foo.diff</b>
	</pre>

	<p>Mit diesem Befehl werden die beiden Dateien verglichen und
	  die Unterschiede in die Datei <tt>foo.diff</tt>
	  geschrieben.</p></li>
    </ol>

    <p>Als letzten Schritt senden Sie die erstellte Differenz
      <tt>foo.diff</tt> an das Documentation Project.  Dazu erstellen
      Sie wiederum einen PR.  Im Unterschied zur Erstellung einer
      neuen Anleitung, enth&auml;lt der "Body"-Bereich nun aber die
      von Ihnen erstellte Differenz <tt>foo.diff</tt>.</p>

    <p></p><a href="docproj.html">Startseite des FreeBSD Documentation Projects</a>
  &footer;
  </body>
</html>
