Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/filesystems/_index.po
Languages: ko, ru

source: This chapter shows the other filesystems supported by FreeBSD
ko: 이 장에서는 FreeBSD에서 지원하는 다른 파일 시스템을 설명합니다
ru: Эта глава описывает другие файловые системы, поддерживаемые FreeBSD

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 23. Other File Systems
ru: Глава 23. Поддержка файловых систем

source: Other File Systems
ko: 기타 파일 시스템
ru: Поддержка файловых систем

source: Synopsis
ko: 요약
ru: Обзор

source: File systems are a fundamental component of any operating system. They enable users to store, manage, and access data, making storage devices like hard drives, flash drives, and USB storage devices practical for everyday use. Different operating systems use different file systems natively.
ru: Файловые системы являются фундаментальным компонентом любой операционной системы. Они позволяют пользователям сохранять, управлять и получать доступ к данным, делая устройства хранения, такие как жесткие диски, флеш-накопители и USB-устройства, практичными для повседневного использования. Разные операционные системы используют разные файловые системы в своей основе.

source: FreeBSD has traditionally used the Unix File System (UFS), with the modernized UFS2 as its primary native file system. FreeBSD also uses the Z File System (ZFS), known for its advanced features, robustness, and reliability. See crossref:zfs[zfs,The Z File System (ZFS)] for more details.
ru: Традиционно FreeBSD использует Unix File System (UFS), а её современную версию UFS2 — в качестве основной родной файловой системы. FreeBSD также поддерживает Файловую Систему Z (Z File System — ZFS), известную благодаря своим расширенным возможностям, надёжности и отказоустойчивости. Подробнее см. crossref:zfs[zfs,The Z File System (ZFS)].

source: In addition to its native file systems, FreeBSD supports a broad range of file systems from other operating systems. Support for these file systems varies, some require loading kernel modules, while others need additional userland tools.
ru: Помимо собственных файловых систем, FreeBSD поддерживает широкий спектр файловых систем из других операционных систем. Поддержка этих файловых систем варьируется: для некоторых требуется загрузка модулей ядра, в то время как для других необходимы дополнительные пользовательские утилиты.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Be familiar with UNIX(R) concepts and crossref:basics[basics,FreeBSD basics].
ru: Знать концепции UNIX(R) и crossref:basics[basics,основы FreeBSD].

source: Feel comfortable crossref:ports[ports,installing software] in FreeBSD.
ko: FreeBSD의 crossref:ports[ports,installing software]에 익숙해야 합니다.
ru: Свободно устанавливать программное обеспечение через crossref:ports[ports,установку программ] в FreeBSD.

source: Have some understanding of crossref:disks[disks,disks], storage devices, and FreeBSD's naming conventions for devices.
ru: Иметь некоторое представление о crossref:disks[disks, дисках], устройствах хранения данных и соглашениях FreeBSD по именованию устройств.

source: After reading this chapter, you will:
ru: Прочитав эту главу, вы:

source: Understand the differences between native and supported file systems.
ru: Будете понимать различия между родными и поддерживаемыми файловыми системами.

source: Know which file systems are supported by FreeBSD and the level of support available.
ru: Будете знать, какие файловые системы поддерживаются FreeBSD и уровень доступной поддержки.

source: Learn how to enable, configure, access, and work with non-native file systems.
ru: Узнаете, как включить, настроить, получить доступ и работать с файловыми системами, не входящими в стандартную поставку.

source: Linux(R) File Systems
ko: Linux(R) 파일 시스템
ru: Файловые системы Linux(R)

source: FreeBSD provides built-in support for several Linux(R) file systems. This section demonstrates how to load support for and how to mount the supported Linux(R) file systems.
ko: FreeBSD는 여러 Linux(R) 파일 시스템에 대한 기본 지원을 제공합니다. 이 섹션에서는 지원되는 Linux(R) 파일 시스템에 대한 지원을 로드하는 방법과 마운트하는 방법을 설명합니다.
ru: FreeBSD предоставляет встроенную поддержку нескольких файловых систем Linux(R). В этом разделе показано, как загрузить поддержку и подключить поддерживаемые файловые системы Linux(R).

source: Extended File System (EXT)
ru: Расширенная Файловая Система (EXT)

source: Kernel support for Extended File System (EXT) file systems has been available since FreeBSD 2.2. The man:ext2fs[5] driver allows the FreeBSD kernel to both read and write to ext2, ext3, and ext4 file systems.
ru: Поддержка файловых систем Extended File System (EXT) на уровне ядра доступна в FreeBSD начиная с версии 2.2. Драйвер man:ext2fs[5] позволяет ядру FreeBSD читать и записывать данные в файловые системы ext2, ext3 и ext4.

source: Journalling and encryption are not supported yet.
ko: 아직 저널링과 암호화는 지원되지 않습니다.
ru: Журналирование и шифрование пока не поддерживаются.

source: To access an ext file system, mount the ext volume by specifying its FreeBSD partition name and an existing mount point. This example mounts [.filename]#/dev/ada1s1# on [.filename]#/mnt#:
ru: Для доступа к файловой системе ext смонтируйте раздел ext, указав его имя раздела в FreeBSD и существующую точку монтирования. В этом примере монтируется [.filename]#/dev/ada1s1# в [.filename]#/mnt#:

source: Windows(R) File Systems
ru: Файловые системы Windows(R)

source: FreeBSD supports FAT, exFAT, and NTFS file systems, enabling access to Windows-formatted storage.
ru: FreeBSD поддерживает файловые системы FAT, exFAT и NTFS, обеспечивая доступ к хранилищам, отформатированным в Windows.

source: FAT File System
ru: Файловая система FAT

source: The FAT file system is a simple and robust file system. Although it lacks the performance, reliability, and scalability of modern alternatives, its availability on many different operating systems makes it a common choice for data exchange between devices.
ru: Файловая система FAT — это простая и надежная файловая система. Хотя она уступает современным аналогам в производительности, надежности и масштабируемости, ее доступность во многих операционных системах делает ее распространенным выбором для обмена данными между устройствами.

source: To access a FAT file system, mount the FAT volume by specifying its FreeBSD partition name and an existing mount point. This example mounts [.filename]#/dev/ada0s1# on [.filename]#/mnt#:
ru: Для доступа к файловой системе FAT необходимо подключить том FAT, указав имя раздела FreeBSD и существующую точку монтирования. В этом примере подключается [.filename]#/dev/ada0s1# в [.filename]#/mnt#:

source: exFAT File System
ru: Файловая система exFAT

source: exFAT (Extended File Allocation Table) is a lightweight file system optimized for flash storage devices, such as USB drives and SD cards. It supports large file sizes and is widely used across various platforms, making it ideal for external storage.
ru: exFAT (Extended File Allocation Table) — это облегчённая файловая система, оптимизированная для флеш-накопителей, таких как USB-диски и SD-карты. Она поддерживает файлы большого размера и широко используется на различных платформах, что делает её идеальной для внешних накопителей.

source: To use exFAT on FreeBSD, install the package:filesystems/exfat[] package, load the FUSE kernel module, and mount the file system as shown below:
ru: Для использования exFAT в FreeBSD установите пакет package:filesystems/exfat[], загрузите модуль ядра FUSE и смонтируйте файловую систему, как показано ниже:

source: Install the exFAT package:
ru: Установите пакет exFAT:

source: Before using a FUSE file system, load the man:fusefs[5] kernel module:
ru: Прежде чем использовать файловую систему FUSE, загрузите модуль ядра man:fusefs[5]:

source: Use man:sysrc[8] to load the module at startup:
ru: Используйте man:sysrc[8] для загрузки модуля при запуске:

source: Mount the exFAT volumne by specifying its FreeBSD partition name and an existing mount point. This example mounts [.filename]#/dev/ada0s1# on [.filename]#/mnt#:
ru: Смонтируйте том exFAT, указав его имя раздела FreeBSD и существующую точку монтирования. В этом примере монтируется [.filename]#/dev/ada0s1# в [.filename]#/mnt#:

source: NTFS File System
ru: Файловая система NTFS

source: NTFS is a robust file system developed by Microsoft(R) and commonly used in Windows operating systems. FreeBSD provides full read and write support for NTFS through the package:filesystems/ntfs[] package, making it easy to access and modify NTFS-formatted storage devices.
ru: NTFS — это надежная файловая система, разработанная Microsoft(R) и широко используемая в операционных системах Windows. FreeBSD обеспечивает полную поддержку чтения и записи NTFS через пакет package:filesystems/ntfs[], что упрощает доступ и изменение хранилищ данных с форматированием NTFS.

source: To use NTFS on FreeBSD, install the package:filesystems/ntfs[] package, load the FUSE kernel module, and mount the file system as shown below:
ru: Для использования NTFS в FreeBSD установите пакет package:filesystems/ntfs[], загрузите модуль ядра FUSE и смонтируйте файловую систему, как показано ниже:

source: Install the NTFS package:
ru: Установите пакет NTFS:

source: Mount the NTFS volumne by specifying its FreeBSD partition name and an existing mount point. This example mounts [.filename]#/dev/ada0s1# on [.filename]#/mnt#:
ru: Смонтируйте том NTFS, указав его имя раздела в FreeBSD и существующую точку монтирования. В этом примере монтируется [.filename]#/dev/ada0s1# в [.filename]#/mnt#:

source: MacOS(R) File Systems
ru: Файловые системы MacOS(R)

source: FreeBSD provides support for MacOS(R) file systems, including HFS/HFS+, allowing access to storage devices formatted for Apple(R) systems.
ru: FreeBSD обеспечивает поддержку файловых систем MacOS(R), включая HFS/HFS+, что позволяет получать доступ к устройствам хранения, отформатированным для систем Apple(R).

source: HFS/HFS+ File System
ru: Файловая система HFS/HFS+

source: HFS/HFS+ was the primary file system for MacOS prior to APFS, commonly used on older Mac devices and external drives. FreeBSD provides read-only support for HFS/HFS+ through the package:filesystems/hfsfuse[] package.
ru: HFS/HFS+ была основной файловой системой для MacOS до APFS, часто использовалась на старых устройствах Mac и внешних накопителях. FreeBSD предоставляет поддержку только для чтения HFS/HFS+ через пакет package:filesystems/hfsfuse[].

source: To use HFS/HFS+ on FreeBSD, install the package:filesystems/hfsfuse[] package, load the FUSE kernel module, and mount the file system as shown below:
ru: Для использования HFS/HFS+ в FreeBSD установите пакет package:filesystems/hfsfuse[], загрузите модуль ядра FUSE и смонтируйте файловую систему, как показано ниже:

source: Install the HFS/HFS+ package:
ru: Установите пакет HFS/HFS+:

source: Mount the HFS/HFS+ volumne by specifying its FreeBSD partition name and an existing mount point. This example mounts [.filename]#/dev/ada0s1# on [.filename]#/mnt#:
ru: Смонтируйте том HFS/HFS+, указав его имя раздела FreeBSD и существующую точку монтирования. В этом примере монтируется [.filename]#/dev/ada0s1# в [.filename]#/mnt#:

source: Chapter 22. Other File Systems
ko: 22장. 기타 파일 시스템

source: File systems are an integral part of any operating system. They allow users to upload and store files, provide access to data, and make hard drives useful. Different operating systems differ in their native file system. Traditionally, the native FreeBSD file system has been the Unix File System UFS which has been modernized as UFS2. Since FreeBSD 7.0, the Z File System (ZFS) is also available as a native file system. See crossref:zfs[zfs,The Z File System (ZFS)] for more information.
ko: 파일 시스템은 모든 운영 체제의 필수적인 부분입니다. 파일 시스템을 통해 사용자는 파일을 업로드 및 저장하고, 데이터에 액세스할 수 있으며, 하드 드라이브를 유용하게 사용할 수 있습니다. 운영 체제마다 기본 파일 시스템이 다릅니다. 전통적으로 기본 FreeBSD 파일 시스템은 UFS2로 현대화된 유닉스 파일 시스템 UFS였습니다. FreeBSD 7.0부터는 Z 파일 시스템(ZFS)도 기본 파일 시스템으로 사용할 수 있습니다. 자세한 내용은 crossref:zfs[zfs,Z 파일 시스템(ZFS)]을 참조하세요.

source: In addition to its native file systems, FreeBSD supports a multitude of other file systems so that data from other operating systems can be accessed locally, such as data stored on locally attached USB storage devices, flash drives, and hard disks. This includes support for the Linux(R) Extended File System (EXT).
ko: 기본 파일 시스템 외에도 FreeBSD는 로컬에 연결된 USB 저장 장치, 플래시 드라이브 및 하드 디스크에 저장된 데이터와 같은 다른 운영 체제의 데이터에 로컬로 액세스할 수 있도록 다양한 다른 파일 시스템을 지원합니다. 여기에는 Linux(R) EXT(확장 파일 시스템)에 대한 지원이 포함됩니다.

source: There are different levels of FreeBSD support for the various file systems. Some require a kernel module to be loaded and others may require a toolset to be installed. Some non-native file system support is full read-write while others are read-only.
ko: 다양한 파일 시스템에 대한 FreeBSD 지원 수준은 여러 가지가 있습니다. 일부는 커널 모듈을 로드해야 하고 다른 일부는 도구 세트를 설치해야 할 수 있습니다. 일부 비-기본 파일 시스템(non-native file system) 지원은 전체 읽기-쓰기가 가능한 반면, 일부 파일 시스템은 읽기 전용입니다.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:

source: The difference between native and supported file systems.
ko: 기본 파일 시스템과 지원되는 파일 시스템의 차이점.

source: Which file systems are supported by FreeBSD.
ko: FreeBSD에서 지원되는 파일 시스템 종류.

source: How to enable, configure, access, and make use of non-native file systems.
ko: 기본이 아닌 파일 시스템을 활성화, 구성, 액세스 및 사용하는 방법.

source: Understand UNIX(R) and crossref:basics[basics,FreeBSD basics].
ko: UNIX(R)와 crossref:basics[basics,FreeBSD basics]의 이해.

source: Be familiar with the basics of crossref:kernelconfig[kernelconfig,kernel configuration and compilation].
ko: crossref:kernelconfig[kernelconfig,kernel configuration and compilation]에 친숙해야 합니다.

source: Have some familiarity with crossref:disks[disks,disks], storage, and device names in FreeBSD.
ko: FreeBSD의 crossref:disks[disks,disks], 스토리지 및 장치 이름에 익숙해져 있어야 합니다.

source: Kernel support for ext2 file systems has been available since FreeBSD 2.2. The man:ext2fs[5] driver allows the FreeBSD kernel to both read and write to ext2, ext3, and ext4 file systems.
ko: ext2 파일 시스템에 대한 커널 지원은 FreeBSD 2.2부터 제공되었습니다. man:ext2fs[5] 드라이버를 사용하면 FreeBSD 커널에서 ext2, ext3 및 ext4 파일 시스템을 읽고 쓸 수 있습니다.

source: To access an ext file system, mount the ext volume by specifying its FreeBSD partition name and an existing mount point. This example mounts [.filename]#/dev/ad1s1# on [.filename]#/mnt#:
ko: 확장 파일 시스템에 액세스하려면, 확장 볼륨의 FreeBSD 파티션 이름과 기존 마운트 지점을 지정하여 해당 볼륨을 마운트합니다. 이 예에서는 [.filename]#/dev/ad1s1#을 [.filename]#/mnt#에 마운트합니다:
