Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/usb-device-mode/_index.po
Languages: ko, ru

source: This chapter covers the use of USB Device Mode and USB On The Go (USB OTG) in FreeBSD
ko: 이 장에서는 FreeBSD에서 USB 장치 모드와 USB OTG(USB On The Go)의 사용법을 다룹니다
ru: Эта глава посвящена использованию режима USB Device Mode и USB On The Go (USB OTG) в FreeBSD

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 27. USB Device Mode / USB OTG
ko: 27장. USB 장치 모드 / USB OTG

source: USB Device Mode / USB OTG
ko: USB 장치 모드 / USB OTG
ru: Режим устройства USB / USB OTG

source: Synopsis
ko: 요약
ru: Обзор

source: This chapter covers the use of USB Device Mode and USB On The Go (USB OTG) in FreeBSD. This includes virtual serial consoles, virtual network interfaces, and virtual USB drives.
ko: 이 장에서는 FreeBSD에서 USB 장치 모드와 USB On The Go (USB OTG)의 사용법을 다룹니다. 여기에는 가상 시리얼 콘솔, 가상 네트워크 인터페이스, 가상 USB 드라이브가 포함됩니다.
ru: Эта глава посвящена использованию USB Device Mode и USB On The Go (USB OTG) в FreeBSD. В неё входят виртуальные последовательные консоли, виртуальные сетевые интерфейсы и виртуальные USB-накопители.

source: When running on hardware that supports USB device mode or USB OTG, like that built into many embedded boards, the FreeBSD USB stack can run in _device mode_. Device mode makes it possible for the computer to present itself as different kinds of USB device classes, including serial ports, network adapters, and mass storage, or a combination thereof. A USB host like a laptop or desktop computer is able to access them just like physical USB devices. Device mode is sometimes called the "USB gadget mode".
ko: 많은 임베디드 보드에 내장된 것과 같이 USB 장치 모드 또는 USB OTG를 지원하는 하드웨어에서 실행할 때, FreeBSD USB 스택은 _장치 모드_에서 실행될 수 있습니다. 장치 모드에서는 컴퓨터가 직렬 포트, 네트워크 어댑터, 대용량 스토리지 등 다양한 종류의 USB 장치 클래스 또는 이들의 조합으로 표시될 수 있습니다. 노트북이나 데스크톱 컴퓨터와 같은 USB 호스트는 실제 USB 장치처럼 액세스할 수 있습니다. 장치 모드는 "USB 가젯 모드"라고도 합니다.
ru: При работе на оборудовании, поддерживающем режим USB-устройства или USB OTG, который встроен во многие материнские платы, стек USB FreeBSD может работать в _режиме устройства_. Режим устройства позволяет компьютеру представлять себя как различные классы USB-устройств, включая последовательные порты, сетевые адаптеры и устройства хранения данных, или их комбинацию. USB-хост, такой как ноутбук или настольный компьютер, может обращаться к ним так же, как к физическим USB-устройствам. Режим устройства иногда называют «режимом USB-гаджета».

source: There are two basic ways the hardware can provide the device mode functionality: with a separate "client port", which only supports the device mode, and with a USB OTG port, which can provide both device and host mode. For USB OTG ports, the USB stack switches between host-side and device-side automatically, depending on what is connected to the port. Connecting a USB device like a memory stick to the port causes FreeBSD to switch to host mode. Connecting a USB host like a computer causes FreeBSD to switch to device mode. Single purpose "client ports" always work in device mode.
ko: 하드웨어가 장치 모드 기능을 제공하는 기본적인 방법에는 장치 모드만 지원하는 별도의 "client port"와 장치 모드와 호스트 모드를 모두 제공할 수 있는 USB OTG 포트의 두 가지가 있습니다. USB OTG 포트의 경우, USB 스택은 포트에 연결된 장치에 따라 호스트 측과 장치 측 간에 자동으로 전환됩니다. 메모리 스틱과 같은 USB 장치를 포트에 연결하면 FreeBSD가 호스트 모드로 전환됩니다. 컴퓨터와 같은 USB 호스트를 연결하면 FreeBSD가 장치 모드로 전환됩니다. 단일 목적의 "클라이언트 포트"는 항상 장치 모드에서 작동합니다.
ru: Существует два основных способа, которыми оборудование может обеспечивать функциональность режима устройства: с отдельным "клиентским портом", который поддерживает только режим устройства, и с портом USB OTG, который может обеспечивать как режим устройства, так и режим хоста. Для портов USB OTG стек USB автоматически переключается между режимом хоста и режимом устройства в зависимости от того, что подключено к порту. Подключение USB-устройства, такого как флеш-накопитель, приводит к переключению FreeBSD в режим хоста. Подключение USB-хоста, например компьютера, приводит к переключению FreeBSD в режим устройства. Однонаправленные "клиентские порты" всегда работают в режиме устройства.

source: What FreeBSD presents to the USB host depends on the `hw.usb.template` sysctl. Some templates provide a single device, such as a serial terminal; others provide multiple ones, which can all be used at the same time. An example is the template 10, which provides a mass storage device, a serial console, and a network interface. See man:usb_template[4] for the list of available values.
ko: FreeBSD가 USB 호스트에 제공하는 것은 `hw.usb.template` sysctl에 따라 다릅니다. 일부 템플릿은 직렬 터미널과 같은 단일 장치를 제공하지만, 다른 템플릿은 동시에 사용할 수 있는 여러 장치를 제공합니다. 예를 들어 대용량 저장 장치, 직렬 콘솔 및 네트워크 인터페이스를 제공하는 템플릿 10이 있습니다. 사용 가능한 값 목록은 man:usb_template[4]를 참조하세요.
ru: То, что FreeBSD предоставляет USB-хосту, зависит от параметра `hw.usb.template` в sysctl. Некоторые шаблоны предоставляют одно устройство, например, последовательный терминал; другие предоставляют несколько устройств, которые можно использовать одновременно. Примером является шаблон 10, который предоставляет устройство хранения данных, последовательную консоль и сетевой интерфейс. Список доступных значений смотрите в man:usb_template[4].

source: Note that in some cases, depending on the hardware and the hosts operating system, for the host to notice the configuration change, it must be either physically disconnected and reconnected, or forced to rescan the USB bus in a system-specific way. When FreeBSD is running on the host, man:usbconfig[8] `reset` can be used. This also must be done after loading [.filename]#usb_template.ko# if the USB host was already connected to the USBOTG socket.
ko: 하드웨어와 호스트 운영 체제에 따라 호스트가 구성 변경을 인식하려면 물리적으로 연결을 끊었다가 다시 연결하거나 시스템별 방식으로 USB 버스를 강제로 다시 스캔해야 하는 경우도 있습니다. 호스트에서 FreeBSD가 실행 중일 때, man:usbconfig[8] `reset`을 사용할 수 있습니다. 이 작업은 USB 호스트가 이미 USBOTG 소켓에 연결되어 있는 경우 [.filename]#usb_template.ko#를 로드한 후에도 수행해야 합니다.
ru: Обратите внимание, что в некоторых случаях, в зависимости от оборудования и операционной системы хоста, для того чтобы хост заметил изменение конфигурации, может потребоваться либо физическое отключение и повторное подключение, либо принудительное повторное сканирование шины USB способом, зависящим от системы. Если на хосте запущена FreeBSD, можно использовать man:usbconfig[8] `reset`. Это также необходимо сделать после загрузки [.filename]#usb_template.ko#, если USB-хост уже был подключен к разъему USBOTG.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: How to set up USB Device Mode functionality on FreeBSD.
ko: FreeBSD에서 USB 장치 모드 기능을 설정하는 방법.
ru: Как настроить функциональность USB Device Mode в FreeBSD.

source: How to configure the virtual serial port on FreeBSD.
ko: FreeBSD에서 가상 직렬 포트를 구성하는 방법.
ru: Как настроить виртуальный последовательный порт на FreeBSD.

source: How to connect to the virtual serial port from various operating systems.
ko: 다양한 운영 체제에서 가상 직렬 포트에 연결하는 방법.
ru: Как подключиться к виртуальному последовательному порту из различных операционных систем.

source: How to configure FreeBSD to provide a virtual USB network interface.
ko: 가상 USB 네트워크 인터페이스를 제공하도록 FreeBSD를 구성하는 방법.
ru: Как настроить FreeBSD для предоставления виртуального USB-сетевого интерфейса.

source: How to configure FreeBSD to provide a virtual USB storage device.
ko: 가상 USB 저장 장치를 제공하도록 FreeBSD를 구성하는 방법.
ru: Как настроить FreeBSD для предоставления виртуального USB-накопителя.

source: USB Virtual Serial Ports
ko: USB 가상 직렬 포트
ru: Виртуальные последовательные порты USB

source: Configuring USB Device Mode Serial Ports
ko: USB 장치 모드 직렬 포트 구성하기
ru: Настройка последовательных портов в режиме USB-устройства

source: Virtual serial port support is provided by templates number 3, 8, and 10. Note that template 3 works with Microsoft Windows 10 without the need for special drivers and INF files. Other host operating systems work with all three templates. Both man:usb_template[4] and man:umodem[4] kernel modules must be loaded.
ko: 가상 직렬 포트 지원은 템플릿 번호 3, 8, 10에서 제공됩니다. 템플릿 3은 특별한 드라이버나 INF 파일 없이도 Microsoft Windows 10에서 작동합니다. 다른 호스트 운영 체제는 세 가지 템플릿 모두에서 작동합니다. man:usb_template[4] 및 man:umodem[4] 커널 모듈이 모두 로드되어 있어야 합니다.
ru: Поддержка виртуальных последовательных портов предоставляется шаблонами 3, 8 и 10. Обратите внимание, что шаблон 3 работает с Microsoft Windows 10 без необходимости в специальных драйверах и INF-файлах. Другие операционные системы хоста работают со всеми тремя шаблонами. Необходимо загрузить оба модуля ядра man:usb_template[4] и man:umodem[4].

source: To enable USB device mode serial ports, add those lines to [.filename]#/etc/ttys#:
ko: USB 장치 모드 직렬 포트를 활성화하려면 [.filename]#/etc/ttys#에 해당 줄을 추가하세요:
ru: Чтобы включить последовательные порты в режиме устройства USB, добавьте следующие строки в [.filename]#/etc/ttys#:

source: Then add these lines to [.filename]#/etc/devd.conf#:
ko: 그런 다음 [.filename]#/etc/devd.conf#에 이 줄을 추가합니다:
ru: Затем добавьте следующие строки в [.filename]#/etc/devd.conf#:

source: Reload the configuration if man:devd[8] is already running:
ko: man:devd[8]가 이미 실행 중이면 구성을 다시 로드합니다:
ru: Перезагрузите конфигурацию, если man:devd[8] уже запущен:

source: Make sure the necessary modules are loaded and the correct template is set at boot by adding those lines to [.filename]#/boot/loader.conf#, creating it if it does not already exist:
ko: 필요한 모듈이 로드되고 부팅 시 올바른 템플릿이 설정되었는지 확인하려면 [.filename]#/boot/loader.conf#에 해당 줄을 추가하며 템플릿이 아직 없는 경우 생성합니다:
ru: Убедитесь, что необходимые модули загружены, и правильный шаблон установлен при загрузке, добавив следующие строки в [.filename]#/boot/loader.conf#, создав его, если он ещё не существует:

source: To load the module and set the template without rebooting use:
ko: 재부팅하지 않고 모듈을 로드하고 템플릿을 설정하려면 다음을 사용하세요:
ru: Для загрузки модуля и установки шаблона без перезагрузки используйте:

source: Connecting to USB Device Mode Serial Ports from FreeBSD
ko: FreeBSD에서 USB 장치 모드 직렬 포트에 연결하기
ru: Подключение к последовательным портам в режиме USB-устройств из FreeBSD

source: To connect to a board configured to provide USB device mode serial ports, connect the USB host, such as a laptop, to the boards USB OTG or USB client port. Use `pstat -t` on the host to list the terminal lines. Near the end of the list you should see a USB serial port, e.g. "ttyU0". To open the connection, use:
ko: USB 장치 모드 직렬 포트를 제공하도록 구성된 보드에 연결하려면 노트북과 같은 USB 호스트를 보드의 USB OTG 또는 USB 클라이언트 포트에 연결합니다. 호스트에서 `pstat -t`를 사용하여 터미널 라인을 나열합니다. 목록의 맨 끝에 USB 직렬 포트(예: "ttyU0")가 표시되어야 합니다. 연결을 열려면:
ru: Для подключения к плате, настроенной для предоставления последовательных портов в режиме USB-устройства, подключите USB-хост, например ноутбук, к USB OTG или клиентскому USB-порту платы. Используйте команду `pstat -t` на хосте для вывода списка терминальных линий. В конце списка должен отобразиться USB-последовательный порт, например "ttyU0". Для установки соединения используйте:

source: After pressing the kbd:[Enter] key a few times you will see a login prompt.
ko: kbd:[Enter] 키를 몇 번 누르면 로그인 프롬프트가 표시됩니다.
ru: После нажатия клавиши kbd:[Enter] несколько раз вы увидите приглашение для входа в систему.

source: Connecting to USB Device Mode Serial Ports from macOS
ko: macOS에서 USB 장치 모드 직렬 포트에 연결하기
ru: Подключение к последовательным портам в режиме USB-устройства из macOS

source: To connect to a board configured to provide USB device mode serial ports, connect the USB host, such as a laptop, to the boards USB OTG or USB client port. To open the connection, use:
ko: USB 장치 모드 직렬 포트를 제공하도록 구성된 보드에 연결하려면 노트북과 같은 USB 호스트를 보드의 USB OTG 또는 USB 클라이언트 포트에 연결합니다. 연결을 열려면:
ru: Для подключения к плате, настроенной для предоставления последовательных портов в режиме USB-устройства, подключите USB-хост, например ноутбук, к USB OTG или клиентскому USB-порту платы. Чтобы открыть соединение, используйте:

source: Connecting to USB Device Mode Serial Ports from Linux
ko: Linux에서 USB 장치 모드 직렬 포트에 연결하기
ru: Подключение к последовательным портам в режиме USB-устройства из Linux

source: Connecting to USB Device Mode Serial Ports from Microsoft Windows 10
ko: Microsoft Windows 10에서 USB 장치 모드 직렬 포트에 연결하기
ru: Подключение к последовательным портам в режиме USB-устройства из Microsoft Windows 10

source: To connect to a board configured to provide USB device mode serial ports, connect the USB host, such as a laptop, to the boards USB OTG or USB client port. To open a connection you will need a serial terminal program, such as PuTTY. To check the COM port name used by Windows, run Device Manager, expand "Ports (COM & LPT)". You will see a name similar to "USB Serial Device (COM4)". Run serial terminal program of your choice, for example PuTTY. In the PuTTY dialog set "Connection type" to "Serial", type the COMx obtained from Device Manager in the "Serial line" dialog box and click Open.
ko: USB 장치 모드 직렬 포트를 제공하도록 구성된 보드에 연결하려면 노트북과 같은 USB 호스트를 보드의 USB OTG 또는 USB 클라이언트 포트에 연결합니다. 연결을 열려면 PuTTY와 같은 직렬 터미널 프로그램이 필요합니다. Windows에서 사용하는 COM 포트 이름을 확인하려면 장치 관리자를 실행하고 "포트(COM 및 LPT)"를 확장합니다. "USB 직렬 장치(COM4)"와 유사한 이름이 표시됩니다. 원하는 직렬 터미널 프로그램(예: PuTTY)을 실행합니다. PuTTY 대화 상자에서 "Connection type"을 "Serial"로 설정하고 "Serial line" 대화 상자에 장치 관리자에서 가져온 COMx를 입력한 후 열기를 클릭합니다.
ru: Для подключения к плате, настроенной для предоставления последовательных портов в режиме USB-устройства, подключите USB-хост, например ноутбук, к USB OTG или клиентскому USB-порту платы. Чтобы открыть соединение, вам понадобится программа для работы с последовательным портом, например PuTTY. Для проверки имени COM-порта, используемого Windows, запустите Диспетчер устройств, раскройте раздел "Порты (COM и LPT)". Вы увидите имя, похожее на "USB Serial Device (COM4)". Запустите выбранную программу для работы с последовательным портом, например PuTTY. В диалоговом окне PuTTY установите "Connection type" в значение "Serial", введите COMx (полученный из Диспетчера устройств) в поле "Serial line" и нажмите "Open".

source: USB Device Mode Network Interfaces
ko: USB 장치 모드 네트워크 인터페이스
ru: Сетевые интерфейсы в режиме USB-устройства

source: Virtual network interfaces support is provided by templates number 1, 8, and 10. Note that none of them works with Microsoft Windows. Other host operating systems work with all three templates. Both man:usb_template[4] and man:if_cdce[4] kernel modules must be loaded.
ko: 가상 네트워크 인터페이스 지원은 템플릿 번호 1, 8 및 10에서 제공됩니다. 이 중 어느 것도 Microsoft Windows에서는 작동하지 않습니다. 다른 호스트 운영 체제는 세 가지 템플릿 모두에서 작동합니다. man:usb_template[4] 및 man:if_cdce[4] 커널 모듈을 모두 로드해야 합니다.
ru: Поддержка виртуальных сетевых интерфейсов обеспечивается шаблонами 1, 8 и 10. Обратите внимание, что ни один из них не работает с Microsoft Windows. Другие операционные системы хоста работают со всеми тремя шаблонами. Необходимо загрузить оба модуля ядра: man:usb_template[4] и man:if_cdce[4].

source: USB Virtual Storage Device
ko: USB 가상 스토리지 장치
ru: Виртуальное устройство хранения данных USB

source: The man:cfumass[4] driver is a USB device mode driver first available in FreeBSD 12.0.
ko: man:cfumass[4] 드라이버는 FreeBSD 12.0부터 처음 사용할 수 있게 된 USB 장치 모드 드라이버입니다.
ru: Драйвер man:cfumass[4] — это драйвер режима USB-устройства, впервые появившийся в FreeBSD 12.0.

source: Mass Storage target is provided by templates 0 and 10. Both man:usb_template[4] and man:cfumass[4] kernel modules must be loaded. man:cfumass[4] interfaces to the CTL subsystem, the same one that is used for iSCSI or Fibre Channel targets. On the host side, USB Mass Storage initiators can only access a single LUN, LUN 0.
ko: 대용량 저장소 타깃은 템플릿 0과 10에서 제공됩니다. man:usb_template[4] 및 man:cfumass[4] 커널 모듈을 모두 로드해야 합니다. man:cfumass[4]는 iSCSI 또는 파이버 채널 타깃에 사용되는 것과 동일한 CTL 서브시스템에 인터페이스합니다. 호스트 측에서 USB 대용량 스토리지 초기자는 단일 LUN인 LUN 0에만 액세스할 수 있습니다.
ru: Целевое устройство хранения данных (Mass Storage) предоставляется шаблонами 0 и 10. Необходимо загрузить оба модуля ядра: man:usb_template[4] и man:cfumass[4]. Модуль man:cfumass[4] взаимодействует с подсистемой CTL, той же самой, что используется для целевых устройств iSCSI или Fibre Channel. Со стороны хоста инициаторы USB Mass Storage могут обращаться только к одному LUN — LUN 0.

source: Configuring USB Mass Storage Target Using the cfumass Startup Script
ko: cfumass 시작 스크립트를 사용하여 USB 대용량 스토리지 타깃 구성하기
ru: Настройка USB-накопителя с использованием стартового скрипта cfumass

source: The simplest way to set up a read-only USB storage target is to use the [.filename]#cfumass# rc script. To configure it this way, copy the files to be presented to the USB host machine into the `/var/cfumass` directory, and add this line to [.filename]#/etc/rc.conf#:
ko: 읽기 전용 USB 스토리지 대상을 설정하는 가장 간단한 방법은 [.filename]#cfumass# rc 스크립트를 사용하는 것입니다. 이 방법으로 구성하려면 USB 호스트 머신에 제공할 파일을 `/var/cfumass` 디렉터리에 복사하고 [.filename]#/etc/rc.conf#에 이 줄을 추가합니다:
ru: Самый простой способ настроить USB-накопитель только для чтения — использовать скрипт [.filename]#cfumass#. Для этого скопируйте файлы, которые должны быть доступны на USB-хосте, в директорию `/var/cfumass` и добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: To configure the target without restarting, run this command:
ko: 다시 시작하지 않고 대상을 구성하려면 다음 명령을 실행합니다:
ru: Для настройки цели без перезагрузки выполните следующую команду:

source: Differently from serial and network functionality, the template should not be set to 0 or 10 in [.filename]#/boot/loader.conf#. This is because the LUN must be set up before setting the template. The cfumass startup script sets the correct template number automatically when started.
ko: 직렬 및 네트워크 기능과는 달리 [.filename]#/boot/loader.conf#에서 템플릿을 0 또는 10으로 설정해서는 안 됩니다. 템플릿을 설정하기 전에 LUN을 설정해야 하기 때문입니다. cfumass 시작 스크립트는 시작할 때 올바른 템플릿 번호를 자동으로 설정합니다.
ru: В отличие от последовательных и сетевых функций, шаблон не следует устанавливать в 0 или 10 в [.filename]#/boot/loader.conf#. Это связано с тем, что LUN должен быть настроен до установки шаблона. Скрипт запуска cfumass автоматически устанавливает правильный номер шаблона при запуске.

source: Configuring USB Mass Storage Using Other Means
ko: 다른 방법을 사용하여 USB 대용량 스토리지 구성하기
ru: Настройка USB-накопителей с использованием других методов

source: The rest of this chapter provides detailed description of setting the target without using the cfumass rc file. This is necessary if e.g. one wants to provide a writeable LUN.
ko: 이 장의 나머지 부분에서는 cfumass rc 파일을 사용하지 않고 타깃을 설정하는 방법에 대해 자세히 설명합니다. 예를 들어 쓰기 가능한 LUN을 제공하려는 경우 이 작업이 필요합니다.
ru: Оставшаяся часть этой главы содержит подробное описание настройки цели без использования файла `cfumass rc`. Это необходимо, например, если требуется предоставить доступную для записи LUN.

source: USB Mass Storage does not require the man:ctld[8] daemon to be running, although it can be used if desired. This is different from iSCSI. Thus, there are two ways to configure the target: man:ctladm[8], or man:ctld[8]. Both require the [.filename]#cfumass.ko# kernel module to be loaded. The module can be loaded manually:
ko: USB 대용량 스토리지는 man:ctld[8] 데몬을 실행할 필요가 없지만 원하는 경우 사용할 수 있습니다. 이것은 iSCSI와 다릅니다. 따라서 대상을 구성하는 방법에는 man:ctladm[8] 또는 man:ctld[8]의 두 가지가 있습니다. 둘 다 [.filename]#cfumass.ko# 커널 모듈을 로드해야 합니다. 모듈은 수동으로 로드할 수 있습니다:
ru: USB-накопитель не требует работы демона man:ctld[8], хотя его можно использовать при необходимости. Это отличается от iSCSI. Таким образом, есть два способа настройки цели: man:ctladm[8] или man:ctld[8]. Оба способа требуют загрузки модуля ядра [.filename]#cfumass.ko#. Модуль можно загрузить вручную:

source: If [.filename]#cfumass.ko# has not been built into the kernel, [.filename]#/boot/loader.conf# can be set to load the module at boot:
ko: 커널에 [.filename]#cfumass.ko#가 빌드되어 있지 않은 경우 [.filename]#/boot/loader.conf#를 설정하여 부팅 시 모듈을 로드할 수 있습니다:
ru: Если модуль [.filename]#cfumass.ko# не встроен в ядро, можно настроить [.filename]#/boot/loader.conf# для его загрузки при старте системы:

source: A LUN can be created without the man:ctld[8] daemon:
ko: man:ctld[8] 데몬 없이도 LUN을 만들 수 있습니다:
ru: LUN может быть создан без использования демона man:ctld[8]:

source: This presents the contents of the image file [.filename]#/data/target0# as a LUN to the USB host. The file must exist before executing the command. To configure the LUN at system startup, add the command to [.filename]#/etc/rc.local#.
ko: 이 명령은 이미지 파일 [.filename]#/data/target0#의 내용을 USB 호스트에 LUN으로 표시합니다. 명령을 실행하기 전에 파일이 존재해야 합니다. 시스템 시작 시 LUN을 구성하려면 [.filename]#/etc/rc.local#에 명령을 추가합니다.
ru: Это предоставляет содержимое файла образа [.filename]#/data/target0# как LUN для USB-хоста. Файл должен существовать до выполнения команды. Чтобы настроить LUN при загрузке системы, добавьте команду в [.filename]#/etc/rc.local#.

source: man:ctld[8] can also be used to manage LUNs. Create [.filename]#/etc/ctl.conf#, add a line to [.filename]#/etc/rc.conf# to make sure man:ctld[8] is automatically started at boot, and then start the daemon.
ko: man:ctld[8]을 사용하여 LUN을 관리할 수도 있습니다. man:ctld[8]이 부팅 시 자동으로 시작되도록 [.filename]#/etc/ctl.conf#을 생성하고 [.filename]#/etc/rc.conf#에 한 줄을 추가한 다음 데몬을 시작하세요.
ru: man:ctld[8] также может использоваться для управления LUN. Создайте файл [.filename]#/etc/ctl.conf#, добавьте строку в [.filename]#/etc/rc.conf#, чтобы убедиться, что man:ctld[8] автоматически запускается при загрузке, а затем запустите демон.

source: This is an example of a simple [.filename]#/etc/ctl.conf# configuration file. Refer to man:ctl.conf[5] for a more complete description of the options.
ko: 다음은 간단한 [.filename]#/etc/ctl.conf# 구성 파일의 예입니다. 옵션에 대한 자세한 설명은 man:ctl.conf[5]를 참조하세요.

source: The example creates a single target with a single LUN. The `naa.50015178f369f092` is a device identifier composed of 32 random hexadecimal digits. The `path` line defines the full path to a file or zvol backing the LUN. That file must exist before starting man:ctld[8]. The second line is optional and specifies the size of the LUN.
ko: 이 예제는 단일 LUN으로 단일 타깃을 생성합니다. `naa.50015178f369f092`는 32개의 임의의 16진수로 구성된 장치 식별자입니다. `path` 줄은 LUN을 백업하는 파일 또는 zvol의 전체 경로를 정의합니다. 해당 파일은 man:ctld[8]을 시작하기 전에 존재해야 합니다. 두 번째 줄은 선택 사항이며 LUN의 크기를 지정합니다.
ru: Пример создает одну цель с одним LUN. `naa.50015178f369f092` — это идентификатор устройства, состоящий из 32 случайных шестнадцатеричных цифр. Строка `path` определяет полный путь к файлу или zvol, который используется для LUN. Этот файл должен существовать до запуска man:ctld[8]. Вторая строка необязательна и указывает размер LUN.

source: To make sure the man:ctld[8] daemon is started at boot, add this line to [.filename]#/etc/rc.conf#:
ko: 부팅 시 man:ctld[8] 데몬이 시작되도록 하려면 [.filename]#/etc/rc.conf#에 이 줄을 추가합니다:
ru: Чтобы убедиться, что демон man:ctld[8] запускается при загрузке, добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: To start man:ctld[8] now, run this command:
ko: 바로 man:ctld[8]을 시작하려면 다음 명령을 실행하세요:
ru: Чтобы запустить man:ctld[8] сейчас, выполните следующую команду:

source: As the man:ctld[8] daemon is started, it reads [.filename]#/etc/ctl.conf#. If this file is edited after the daemon starts, reload the changes so they take effect immediately:
ko: man:ctld[8] 데몬이 시작되면 [.filename]#/etc/ctl.conf#를 읽습니다. 데몬이 시작된 후 이 파일을 편집한 경우 변경 사항이 즉시 적용되도록 다시 로드하세요:
ru: При запуске демона man:ctld[8] он читает файл [.filename]#/etc/ctl.conf#. Если этот файл отредактирован после запуска демона, перезагрузите изменения, чтобы они вступили в силу немедленно:

source: Chapter 28. USB Device Mode / USB OTG
ru: Глава 28. Режим USB-устройства / USB OTG

source: This is an example of a simple [.filename]#/etc/ctl.conf# configuration file. Refer to man:ctl.conf[5] for a complete description of the options.
ru: Вот пример простого файла конфигурации [.filename]#/etc/ctl.conf#. Полное описание параметров можно найти в man:ctl.conf[5].
