Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/pr-guidelines/_index.po
Languages: pt_br, ru

source: These guidelines describe recommended handling practices for FreeBSD Problem Reports (PRs).
pt_br: Essas diretrizes descrevem as práticas recomendadas de tratamento para Relatórios de Problemas (PRs) do FreeBSD.
ru: Эти рекомендации описывают рекомендуемые методы обработки отчётов о проблемах FreeBSD (PR — Problem Reports).

source: Problem Report Handling Guidelines
pt_br: Diretrizes de Tratamento de Relatórios de Problemas
ru: Руководство по обработке отчетов о проблемах

source: Abstract
pt_br: Resumo
ru: Аннотация

source: These guidelines describe recommended handling practices for FreeBSD Problem Reports (PRs). Whilst developed for the FreeBSD PR Database Maintenance Team mailto:freebsd-bugbusters@FreeBSD.org[freebsd-bugbusters@FreeBSD.org], these guidelines should be followed by anyone working with FreeBSD PRs.
pt_br: Essas diretrizes descrevem práticas recomendadas de tratamento para Relatórios de Problemas (PRs) do FreeBSD. Embora desenvolvidas para a equipe de manutenção do Banco de Dados de PRs do FreeBSD (mailto:freebsd-bugbusters@FreeBSD.org[freebsd-bugbusters@FreeBSD.org]), essas diretrizes devem ser seguidas por qualquer pessoa que trabalhe com PRs do FreeBSD.
ru: Эти рекомендации описывают рекомендуемые методы работы с отчетами о проблемах FreeBSD (PR). Хотя они разработаны для команды сопровождения базы данных PR FreeBSD mailto:freebsd-bugbusters@FreeBSD.org[freebsd-bugbusters@FreeBSD.org], эти рекомендации следует соблюдать всем, кто работает с PR FreeBSD.

source: Introduction
pt_br: Introdução
ru: Введение

source: Bugzilla is an issue management system used by the FreeBSD Project. As accurate tracking of outstanding software defects is important to FreeBSD's quality, the correct use of the software is essential to the forward progress of the Project.
pt_br: O Bugzilla é um sistema de gerenciamento de problemas usado pelo Projeto FreeBSD. Como o rastreamento preciso de defeitos de software pendentes é importante para a qualidade do FreeBSD, o uso correto do software é essencial para o progresso contínuo do Projeto.
ru: Bugzilla — это система управления задачами, используемая проектом FreeBSD. Поскольку точный учёт неисправленных программных ошибок важен для качества FreeBSD, правильное использование данного ПО критически необходимо для развития проекта.

source: Access to Bugzilla is available to the entire FreeBSD community. In order to maintain consistency within the database and provide a consistent user experience, guidelines have been established covering common aspects of bug management such as presenting followup, handling close requests, and so forth.
pt_br: O acesso ao Bugzilla está disponível para toda a comunidade FreeBSD. Para manter a consistência no banco de dados e fornecer uma experiência de usuário consistente, foram estabelecidas diretrizes que abrangem aspectos comuns de gerenciamento de bugs, como apresentação de acompanhamentos, tratamento de solicitações de encerramento, entre outros.
ru: Доступ к Bugzilla предоставлен всему сообществу FreeBSD. Для поддержания согласованности в базе данных и обеспечения единообразного взаимодействия с пользователями были установлены руководящие принципы, охватывающие общие аспекты управления ошибками, такие как предоставление последующих действий, обработка запросов на закрытие и так далее.

source: Problem Report Life-cycle
pt_br: Ciclo de vida do Relatório de Problemas
ru: Жизненный цикл отчета о проблеме

source: The Reporter submits a bug report on the website. The bug is in the `Needs Triage` state.
pt_br: O autor do relatório envia um relatório de bug no site. O bug está no estado `Precisa ser Triado` (Needs Triage).
ru: Репортер отправляет отчет об ошибке на веб-сайте. Ошибка находится в состоянии `Needs Triage`.

source: Jane Random BugBuster confirms that the bug report has sufficient information to be reproducible. If not, she goes back and forth with the reporter to obtain the needed information. At this point the bug is set to the `Open` state.
pt_br: Jane Random BugBuster confirma que o relatório de bug possui informações suficientes para ser reproduzido. Caso contrário, ela vai e volta com o autor do relatório para obter as informações necessárias. Neste ponto, o bug é definido como estado `Aberto` (Open).
ru: Джейн Рэндом БагБастер подтверждает, что отчёт об ошибке содержит достаточно информации для её воспроизведения. Если нет, она взаимодействует с отправителем, чтобы получить необходимые данные. На этом этапе ошибке присваивается статус `Open`.

source: Joe Random Committer takes interest in the PR and assigns it to himself, or Jane Random BugBuster decides that Joe is best suited to handle it and assigns it to him. The bug should be set to the `In Discussion` state.
pt_br: Joe Random Committer se interessa pelo PR e o atribui a si mesmo, ou Jane Random BugBuster decide que Joe é o mais adequado para lidar com ele e o atribui a ele. O bug deve ser definido para o estado `Em Discussão` (In Discussion).
ru: Джо Рандом Коммиттер проявляет интерес к PR и назначает его себе, или Джейн Рандом БагБастер решает, что Джо лучше всего подходит для его решения и назначает PR Джону. Ошибка должна быть переведена в состояние `In Discussion`.

source: Joe has a brief exchange with the originator (making sure it all goes into the audit trail) and determines the cause of the problem.
pt_br: Joe tem uma breve troca com o autor do relatório (certificando-se de que tudo é registrado no histórico de auditoria) e determina a causa do problema.
ru: Джо кратко общается с инициатором (убедившись, что всё заносится в журнал аудита) и определяет причину проблемы.

source: Joe pulls an all-nighter and whips up a patch that he thinks fixes the problem, and submits it in a follow-up, asking the originator to test it. He then sets the PRs state to `Patch Ready`.
pt_br: Joe trabalha a noite toda e desenvolve um patch que ele acha que corrige o problema e o envia em um acompanhamento, pedindo ao autor do relatório que o teste. Em seguida, ele define o estado do PR como `Patch Pronto` (Patch Ready).
ru: Джо засиживается всю ночь и создает патч, который, как он считает, исправляет проблему, и отправляет его в ответном сообщении, прося автора PR проверить его. Затем он устанавливает состояние PR в `Patch Ready`.

source: A couple of iterations later, both Joe and the originator are satisfied with the patch, and Joe commits it to `-CURRENT` (or directly to `-STABLE` if the problem does not exist in `-CURRENT`), making sure to reference the Problem Report in his commit log (and credit the originator if they submitted all or part of the patch) and, if appropriate, start an MFC countdown. The bug is set to the `Needs MFC` state.
pt_br: Algumas iterações depois, tanto Joe quanto o autor do relatório estão satisfeitos com o patch e Joe o faz commit no `-CURRENT` (ou diretamente no `-STABLE` se o problema não existir no `-CURRENT`), certificando-se de fazer referência ao Relatório de Problemas em seu log de commit (e de creditar o autores se eles enviaram todo ou parte do patch) e, se apropriado, iniciar uma contagem regressiva de MFC. O bug é definido como estado `Precisa de MFC` (Needs MFC).
ru: После нескольких итераций и Джо, и автор патча остаются довольны результатом, и Джо фиксирует его в `-CURRENT` (или напрямую в `-STABLE`, если проблема отсутствует в `-CURRENT`), обязательно указывая в логе коммита ссылку на отчёт о проблеме (а также упоминая автора, если он предоставил патч целиком или частично) и, если необходимо, запускает отсчёт для MFC. Ошибка переводится в состояние `Needs MFC`.

source: If the patch does not need MFCing, Joe then closes the PR as `Issue Resolved`.
pt_br: Se o patch não precisar de MFCing, Joe então encerra o PR como `Problema Resolvido` (Issue Resolved).
ru: Если исправление не требует переноса в стабильную ветку (MFC), Джо закрывает PR с пометкой `Issue Resolved`.

source: Many PRs are submitted with very little information about the problem, and some are either very complex to solve, or just scratch the surface of a larger problem; in these cases, it is very important to obtain all the necessary information needed to solve the problem. If the problem contained within cannot be solved, or has occurred again, it is necessary to re-open the PR.
pt_br: Muitos PRs são enviados com muito pouca informação sobre o problema e alguns são muito complexos para resolver ou apenas arranham a superfície de um problema maior; nesses casos, é muito importante obter todas as informações necessárias para resolver o problema. Se o problema não puder ser resolvido ou ocorrer novamente, é necessário reabrir o PR.
ru: Многие PR отправляются с очень небольшим количеством информации о проблеме, а некоторые либо очень сложны для решения, либо лишь поверхностно затрагивают более крупную проблему; в таких случаях крайне важно получить всю необходимую информацию для решения проблемы. Если проблему внутри нельзя решить или она возникла снова, необходимо переоткрыть PR.

source: Problem Report State
pt_br: Estado do Relatório de Problemas
ru: Состояние отчета о проблеме

source: It is important to update the state of a PR when certain actions are taken. The state should accurately reflect the current state of work on the PR.
pt_br: É importante atualizar o estado de um PR quando certas ações são tomadas. O estado deve refletir com precisão o estado atual do trabalho no PR.
ru: Важно обновлять состояние PR при выполнении определённых действий. Состояние должно точно отражать текущий статус работы над PR.

source: A small example on when to change PR state
pt_br: Um pequeno exemplo de quando mudar o estado do PR
ru: Небольшой пример, когда следует изменить состояние PR

source: When a PR has been worked on and the developer(s) responsible feel comfortable about the fix, they will submit a followup to the PR and change its state to "feedback". At this point, the originator should evaluate the fix in their context and respond indicating whether the defect has indeed been remedied.
pt_br: Quando um PR foi trabalhado e o(s) desenvolvedor(es) responsáveis se sentem confortáveis com a correção, eles enviarão um acompanhamento para o PR e alterarão seu estado para "feedback". Neste ponto, o originador deve avaliar a correção em seu contexto e responder indicando se o defeito foi realmente corrigido.
ru: Когда работа над PR завершена и ответственные разработчики уверены в исправлении, они отправят обновление в PR и изменят его состояние на «feedback». На этом этапе автор должен оценить исправление в своём контексте и ответить, была ли действительно устранена проблема.

source: A Problem Report may be in one of the following states:
pt_br: Um Relatório de Problema pode estar em um dos seguintes estados:
ru: Отчет о проблеме может находиться в одном из следующих состояний:

source: open
pt_br: open (aberto)
ru: open (открыто)

source: Initial state; the problem has been pointed out and it needs reviewing.
pt_br: Estado inicial; o problema foi relatado, mas ainda não foi avaliado.
ru: Начальное состояние; проблема была указана и требует рассмотрения.

source: analyzed
pt_br: analyzed (analisado)
ru: analyzed (проанализировано)

source: The problem has been reviewed and a solution is being sought.
pt_br: O problema foi avaliado, mas ainda não foi corrigido.
ru: Проблема была рассмотрена, и решение находится в разработке.

source: feedback
pt_br: feedback (retroalimentação)
ru: feedback (обратная связь)

source: Further work requires additional information from the originator or the community; possibly information regarding the proposed solution.
pt_br: Trabalhos adicionais requerem informações adicionais do originador ou da comunidade; possivelmente informações sobre a solução proposta.
ru: Дальнейшая работа требует дополнительной информации от инициатора или сообщества; возможно, информации относительно предлагаемого решения.

source: patched
pt_br: patched (corrigido)
ru: patched (исправленно)

source: A patch has been committed, but something (MFC, or maybe confirmation from originator) is still pending.
pt_br: Foi realizado o commit de um patch, mas algo (MFC, ou talvez confirmação do originador) ainda está pendente.
ru: Патч был закоммичен, но что-то (MFC или, возможно, подтверждение от автора) ещё ожидается.

source: suspended
pt_br: suspended (suspenso)
ru: suspended (приостановлено)

source: The problem is not being worked on, due to lack of information or resources. This is a prime candidate for somebody who is looking for a project to take on. If the problem cannot be solved at all, it will be closed, rather than suspended. The documentation project uses suspended for wish-list items that entail a significant amount of work which no one currently has time for.
pt_br: O problema não está sendo trabalhado, devido à falta de informações ou recursos. Este é um candidato ideal para alguém que procura um projeto para assumir. Se o problema não puder ser resolvido de forma alguma, ele será fechado, em vez de suspenso. O projeto de documentação usa "suspenso" para itens de lista de desejos que exigem uma quantidade significativa de trabalho para o qual ninguém tem tempo no momento.
ru: Проблема не решается из-за недостатка информации или ресурсов. Это отличный вариант для тех, кто ищет проект для реализации. Если проблему не удастся решить вовсе, она будет закрыта, а не приостановлена. Документационный проект использует статус «приостановлено» для пунктов списка пожеланий, требующих значительного объема работы, на который у участников сейчас нет времени.

source: closed
pt_br: closed (fechado)
ru: closed (закрыто)

source: A problem report is closed when any changes have been integrated, documented, and tested, or when fixing the problem is abandoned.
pt_br: Um relatório de problemas é fechado quando as alterações referentes a ele tiverem sido integradas, documentadas e testadas ou, quando a correção do problema tiver sido abandonada.
ru: Проблемный отчет закрывается, когда все изменения внедрены, задокументированы и протестированы, или когда исправление проблемы прекращено.

source: The "patched" state is directly related to feedback, so you may go directly to "closed" state if the originator cannot test the patch, and it works in your own testing.
pt_br: O estado "corrigido" (patched) está diretamente relacionado ao estado "retroalimentação" (feedback), então você pode ir diretamente para o estado "fechado" (closed) se o originador não puder testar o patch e ele funcionar em seus próprios testes.
ru: Состояние "исправлено" (patched) напрямую связано с обратной связью, поэтому вы можете перейти сразу в состояние "закрыто", если автор не может протестировать исправление, и оно работает в ваших собственных тестах.

source: Types of Problem Reports
pt_br: Tipos de Relatórios de Problema
ru: Типы отчетов о проблемах

source: While handling problem reports, either as a developer who has direct access to the Problem Reports database or as a contributor who browses the database and submits followups with patches, comments, suggestions or change requests, you will come across several different types of PRs.
pt_br: Ao lidar com relatórios de problemas, seja como um desenvolvedor que tem acesso direto ao banco de dados de relatórios de problemas ou como um colaborador que navega no banco de dados e envia feedbacks com patches, comentários, sugestões ou solicitações de mudança, você se deparará com vários tipos diferentes de PRs.
ru: При обработке отчетов о проблемах, будь вы разработчиком с прямым доступом к базе данных отчетов или участником, который просматривает базу данных и отправляет ответы с исправлениями, комментариями, предложениями или запросами на изменения, вы столкнетесь с несколькими различными типами PR.

source: crossref:pr-guidelines[pr-unassigned, Unassigned PRs]
ru: crossref:pr-guidelines[pr-unassigned, Неназначенные PR]

source: crossref:pr-guidelines[pr-assigned, Assigned PRs]
ru: crossref:pr-guidelines[pr-assigned, Назначенные PR]

source: crossref:pr-guidelines[pr-dups, Duplicate PRs]
ru: crossref:pr-guidelines[pr-dups, Дублирующие PR]

source: crossref:pr-guidelines[pr-stale, Stale PRs]
ru: crossref:pr-guidelines[pr-stale, Устаревшие PR]

source: crossref:pr-guidelines[pr-misfiled-notpr, Non-Bug PRs]
ru: crossref:pr-guidelines[pr-misfiled-notpr, Несвязанные с ошибками PR]

source: The following sections describe what each different type of PRs is used for, when a PR belongs to one of these types, and what treatment each different type receives.
pt_br: As seções a seguir descrevem para que cada tipo diferente de PRs é usado, quando um PR pertence a um desses tipos e qual tratamento cada tipo diferente recebe.
ru: Следующие разделы описывают, для чего используется каждый из различных типов PR, когда PR относится к одному из этих типов и как обрабатывается каждый из различных типов.

source: Unassigned PRs
pt_br: PRs Não Atribuídos
ru: Неназначенные PR

source: When PRs arrive, they are initially assigned to a generic (placeholder) assignee. These are always prepended with `freebsd-`. The exact value for this default depends on the category; in most cases, it corresponds to a specific FreeBSD mailing list. Here is the current list, with the most common ones listed first:
pt_br: Quando os Relatórios de Problemas chegam, eles são inicialmente atribuídos a um responsável genérico (placeholder). Esses responsáveis sempre começam com `freebsd-`. O valor exato desse responsável padrão depende da categoria do PR; na maioria dos casos, corresponde a uma lista de discussão específica do FreeBSD. Aqui está a lista atual, com os mais comuns listados primeiro:
ru: Когда поступают PR, они изначально назначаются на обобщённого исполнителя. Такие исполнители всегда начинаются с префикса `freebsd-`. Точное значение по умолчанию зависит от категории; в большинстве случаев оно соответствует определённому списку рассылки FreeBSD. Вот текущий список, с наиболее распространёнными значениями в начале:

source: Default Assignees - most common
pt_br: Atribuidores Padrões - os mais comuns
ru: Назначенные по умолчанию исполнители — наиболее распространенные

source: Type
pt_br: Tipo
ru: Тип

source: Categories
pt_br: Categorias
ru: Категории

source: Default Assignee
pt_br: Responsável padrão (Default Assignee)
ru: Назначенный по умолчанию

source: base system
pt_br: Sistema base (Base System)
ru: базовая система

source: architecture-specific
ru: специфичные от архитектуры

source: ports collection
pt_br: coleção de ports
ru: коллекция портов

source: documentation shipped with the system
pt_br: Documentação incluída no sistema
ru: документация, поставляемая с системой

source: FreeBSD web pages (not including docs)
pt_br: páginas web do FreeBSD (excluindo a documentação)
ru: веб-страницы FreeBSD (за исключением документации)

source: Default Assignees - other
pt_br: Atribuidores Padrão - outros
ru: Назначенные по умолчанию - другие

source: advocacy efforts
pt_br: esforços de advocacia
ru: усилия по продвижению

source: Java Virtual Machine(TM) problems
pt_br: problema com a Java Virtual Machine(TM)
ru: проблемы с Java Virtual Machine(TM)

source: standards compliance
pt_br: conformidade com padrões
ru: соответствие стандартам

source: threading libraries
pt_br: bibliotecas de threading
ru: библиотеки потоков

source: man:usb[4] subsystem
pt_br: subsistema man:usb[4]
ru: подсистема man:usb[4]

source: Do not be surprised to find that the submitter of the PR has assigned it to the wrong category. If you fix the category, do not forget to fix the assignment as well. (In particular, our submitters seem to have a hard time understanding that just because their problem manifested on an i386 system, that it might be generic to all of FreeBSD, and thus be more appropriate for `kern`. The converse is also true, of course.)
pt_br: Não se surpreenda ao descobrir que o autor do PR atribuiu-o à categoria errada. Se você corrigir a categoria, não se esqueça de corrigir também a atribuição. (Em particular, nossos autores têm dificuldade em entender que só porque seu problema se manifestou em um sistema i386, ele pode ser genérico para todo o FreeBSD e, portanto, ser mais apropriado para `kern`. O inverso também é verdadeiro, é claro.)
ru: Не удивляйтесь, если обнаружите, что автор PR назначил ему неверную категорию. Если вы исправите категорию, не забудьте также исправить назначение. (В частности, наши авторы, похоже, с трудом понимают, что даже если их проблема проявилась на системе i386, она может быть общей для всей FreeBSD и, следовательно, более уместна в `kern`. Обратное, конечно, тоже верно.)

source: Certain PRs may be reassigned away from these generic assignees by anyone. There are several types of assignees: specialized mailing lists; mail aliases (used for certain limited-interest items); and individuals.
pt_br: Alguns PRs podem ser reatribuídos para longe desses atribuidores genéricos por qualquer pessoa. Existem vários tipos de atribuidores: listas de discussão especializadas; aliases de e-mail (usados para determinados itens de interesse limitado); e indivíduos.
ru: Некоторые PR могут быть переназначены с этих общих ответственных любым человеком. Существует несколько типов ответственных: специализированные почтовые рассылки, почтовые алиасы (используются для определённых элементов с ограниченным интересом) и отдельные лица.

source: For assignees which are mailing lists, please use the long form when making the assignment (e.g., `freebsd-foo` instead of `foo`); this will avoid duplicate emails sent to the mailing list.
pt_br: Para atribuidores que são listas de discussão, por favor, use a forma longa ao fazer a atribuição (por exemplo, `freebsd-foo` em vez de `foo`); isso evitará o envio de e-mails duplicados para a lista de discussão.
ru: Для назначений, которые являются списками рассылки, используйте полную форму при назначении (например, `freebsd-foo` вместо `foo`); это позволит избежать дублирования писем, отправляемых в список рассылки.

source: Since the list of individuals who have volunteered to be the default assignee for certain types of PRs changes so often, it is much more suitable for https://wiki.freebsd.org/AssigningPRs[the FreeBSD wiki].
pt_br: Uma vez que a lista de pessoas que se ofereceram para ser o atribuidor padrão para determinados tipos de PRs muda com tanta frequência, é muito mais apropriado consultar https://wiki.freebsd.org/AssigningPRs[a wiki do FreeBSD].
ru: Поскольку список людей, которые добровольно согласились быть ответственными по умолчанию за определённые типы PR, меняется так часто, эта информация гораздо лучше подходит для https://wiki.freebsd.org/AssigningPRs[вики FreeBSD].

source: Here is a sample list of such entities; it is probably not complete.
pt_br: Aqui está uma lista de exemplo dessas entidades; ela provavelmente não está completa.
ru: Вот примерный список таких объектов; возможно, он не полный.

source: Common Assignees - base system
pt_br: Atribuidores Comuns - Sistema Base
ru: Общие ответственные исполнители — базовая система

source: Suggested Category
pt_br: Categoria Sugerida
ru: Предполагаемая категория

source: Suggested Assignee
pt_br: Atribuidor sugerido
ru: Предполагаемый исполнитель

source: Assignee Type
pt_br: Tipo de Atribuidor
ru: Тип Назначенного

source: problem specific to the ARM(R) architecture
pt_br: problema específico para a arquitetura ARM(R)
ru: проблема, специфичная для архитектуры ARM(R)

source: mailing list
pt_br: lista de discussão
ru: список рассылки

source: problem specific to the MIPS(R) architecture
pt_br: problema específico para a arquitetura MIPS(R)
ru: проблема, специфичная для архитектуры MIPS(R)

source: problem specific to the PowerPC(R) architecture
pt_br: problema específico para a arquitetura PowerPC(R)
ru: проблема, специфичная для архитектуры PowerPC(R)
