Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/pr-guidelines/_index.po
Languages: pt_br, ru

source: problem with Advanced Configuration and Power Management (man:acpi[4])
pt_br: problema com o Gerenciamento Avançado de Energia e Configuração (man:acpi[4])
ru: проблема с Advanced Configuration and Power Management (man:acpi[4])

source: problem with Asynchronous Transfer Mode (ATM) drivers
pt_br: problema com os drivers de Modo de Transferência Assíncrona (ATM)
ru: проблема с драйверами Asynchronous Transfer Mode (ATM)

source: problem with embedded or small-footprint FreeBSD systems (e.g., NanoBSD/PicoBSD/FreeBSD-arm)
pt_br: problema com sistemas FreeBSD incorporados ou small-footprint (por exemplo, NanoBSD/PicoBSD/FreeBSD-arm)
ru: проблема со встроенными или компактными системами FreeBSD (например, NanoBSD/PicoBSD/FreeBSD-arm)

source: problem with FireWire(R) drivers
pt_br: problema com os drivers FireWire(R)
ru: проблема с драйверами FireWire(R)

source: problem with the filesystem code
pt_br: problema com o código do sistema de arquivos
ru: проблема с кодом файловой системы

source: problem with the man:geom[4] subsystem
pt_br: problema com o subsistema man:geom[4]
ru: проблема с подсистемой man:geom[4]

source: problem with the man:ipfw[4] subsystem
pt_br: problema com o subsistema man:ipfw[4]
ru: проблема с подсистемой man:ipfw[4]

source: problem with Integrated Services Digital Network (ISDN) drivers
pt_br: problema com drivers de Rede Digital de Serviços Integrados (ISDN)
ru: проблема с драйверами Integrated Services Digital Network (ISDN)

source: man:jail[8] subsystem
pt_br: problema com o subsistema man:jail[8]
ru: подсистема man:jail[8]

source: problem with Linux(R) or SVR4 emulation
pt_br: problema com emulação do Linux(R) ou do SVR4
ru: проблема с эмуляцией Linux(R) или SVR4

source: problem with the networking stack
pt_br: problema com a pilha de rede
ru: проблема со стеком сетевых протоколов

source: problem with the man:pf[4] subsystem
pt_br: problema com o subsistema man:pf[4]
ru: проблема с подсистемой man:pf[4]

source: problem with the man:scsi[4] subsystem
pt_br: problema com o subsistema man:scsi[4]
ru: проблема с подсистемой man:scsi[4]

source: problem with the man:sound[4] subsystem
pt_br: problema com o subsistema man:sound[4]
ru: проблема с подсистемой man:sound[4]

source: problems with the man:wlan[4] subsystem and wireless drivers
pt_br: problema com o subsistema man:wlan[4] e drivers wireless
ru: проблемы с подсистемой man:wlan[4] и беспроводными драйверами

source: problem with man:sysinstall[8] or man:bsdinstall[8]
pt_br: problema com o man:sysinstall[8] ou o man:bsdinstall[8]
ru: проблема с man:sysinstall[8] или man:bsdinstall[8]

source: problem with the system startup scripts (man:rc[8])
pt_br: problema com os scripts de inicialização do sistema (man:rc[8])
ru: проблема со скриптами запуска системы (man:rc[8])

source: problem with VIMAGE or VNET functionality and related code
pt_br: problema com a funcionalidade VIMAGE ou VNET e código relacionado
ru: проблема с функциональностью VIMAGE или VNET и связанным кодом

source: problem with Xen emulation
pt_br: problema com a emulação do Xen
ru: проблема с эмуляцией Xen

source: Common Assignees - Ports Collection
pt_br: Atribuidores Comuns - Coleção de Ports
ru: Общие ответственные исполнители — Коллекция портов

source: problem with the ports framework (__not__ with an individual port!)
pt_br: problema com o framework de ports (__não__ com um port individual!)
ru: проблема с фреймворком портов (__не__ с отдельным портом!)

source: port which is maintained by apache@FreeBSD.org
pt_br: port mantido por apache@FreeBSD.org
ru: порт, который поддерживается apache@FreeBSD.org

source: port which is maintained by autotools@FreeBSD.org
pt_br: port mantido por autotools@FreeBSD.org
ru: порт, который поддерживается autotools@FreeBSD.org

source: port which is maintained by doceng@FreeBSD.org
pt_br: port mantido por doceng@FreeBSD.org
ru: порт, который поддерживается doceng@FreeBSD.org

source: port which is maintained by eclipse@FreeBSD.org
pt_br: port mantido por eclipse@FreeBSD.org
ru: порт, который поддерживается eclipse@FreeBSD.org

source: port which is maintained by gecko@FreeBSD.org
pt_br: port mantido por gecko@FreeBSD.org
ru: порт, который поддерживается gecko@FreeBSD.org

source: port which is maintained by gnome@FreeBSD.org
pt_br: port mantido por gnome@FreeBSD.org
ru: порт, который поддерживается gnome@FreeBSD.org

source: port which is maintained by hamradio@FreeBSD.org
pt_br: port mantido por hamradio@FreeBSD.org
ru: порт, который поддерживается hamradio@FreeBSD.org

source: port which is maintained by haskell@FreeBSD.org
pt_br: port mantido por haskell@FreeBSD.org
ru: порт, который поддерживается haskell@FreeBSD.org

source: port which is maintained by java@FreeBSD.org
pt_br: port mantido por java@FreeBSD.org
ru: порт, который поддерживается java@FreeBSD.org

source: port which is maintained by kde@FreeBSD.org
pt_br: port mantido por kde@FreeBSD.org
ru: порт, который поддерживается kde@FreeBSD.org

source: port which is maintained by mono@FreeBSD.org
pt_br: port mantido por mono@FreeBSD.org
ru: порт, который поддерживается mono@FreeBSD.org

source: port which is maintained by office@FreeBSD.org
pt_br: port mantido por office@FreeBSD.org
ru: порт, который поддерживается office@FreeBSD.org

source: port which is maintained by perl@FreeBSD.org
pt_br: por mantido por perl@FreeBSD.org
ru: порт, который поддерживается perl@FreeBSD.org

source: port which is maintained by python@FreeBSD.org
pt_br: port mantido por python@FreeBSD.org
ru: порт, который поддерживается python@FreeBSD.org

source: port which is maintained by ruby@FreeBSD.org
pt_br: port mantido por ruby@FreeBSD.org
ru: порт, который поддерживается ruby@FreeBSD.org

source: port which is maintained by secteam@FreeBSD.org
pt_br: port mantido por secteam@FreeBSD.org
ru: порт, который поддерживается secteam@FreeBSD.org

source: port which is maintained by vbox@FreeBSD.org
pt_br: port mantido por vbox@FreeBSD.org
ru: порт, который поддерживается vbox@FreeBSD.org

source: port which is maintained by x11@FreeBSD.org
pt_br: por mantido por x11@FreeBSD.org
ru: порт, который поддерживается x11@FreeBSD.org

source: Ports PRs which have a maintainer who is a ports committer may be reassigned by anyone (but note that not every FreeBSD committer is necessarily a ports committer, so you cannot simply go by the email address alone.)
pt_br: Os relatórios de problemas dos ports que têm um mantenedor que é um colaborador do ports podem ser reatribuídos por qualquer pessoa (mas observe que nem todo committer do FreeBSD é necessariamente um committer do ports, então você não pode simplesmente ir apenas pelo endereço de e-mail.)
ru: PR портов, у которых есть сопровождающий, являющийся коммиттером портов, могут быть переназначены кем угодно (но обратите внимание, что не каждый коммиттер FreeBSD обязательно является коммиттером портов, поэтому нельзя ориентироваться только на адрес электронной почты.)

source: For other PRs, please do not reassign them to individuals (other than yourself) unless you are certain that the assignee really wants to track the PR. This will help to avoid the case where no one looks at fixing a particular problem because everyone assumes that the assignee is already working on it.
pt_br: Para outros PRs, por favor, não reatribua-os para indivíduos (além de si mesmo) a menos que você esteja certo de que o assignee realmente queira acompanhar o PR. Isso ajudará a evitar situações nas quais em que ninguém olha para corrigir um problema específico porque todo mundo assume que o assignee já está trabalhando no mesmo.
ru: Для других PR (запросов на включение изменений) не перераспределяйте их между участниками (кроме себя), если вы не уверены, что назначенный участник действительно хочет отслеживать PR. Это поможет избежать ситуации, когда никто не занимается исправлением конкретной проблемы, потому что все предполагают, что назначенный участник уже работает над ней.

source: Common Assignees - Other
pt_br: Atribuidores Comuns - Outros
ru: Общие ответственные исполнители — Прочие

source: problem with PR database
pt_br: problema com o banco de dados de PRs
ru: проблема с базой данных PR

source: problem with Bugzilla https://bugs.freebsd.org/submit/[web form].
pt_br: problema com o https://bugs.freebsd.org/submit/[formulario web] do Bugzilla.
ru: проблема с https://bugs.freebsd.org/submit/[веб-формой] Bugzilla.

source: Assigned PRs
pt_br: PRs Atribuídos
ru: Назначенные PR

source: If a PR has the `responsible` field set to the username of a FreeBSD developer, it means that the PR has been handed over to that particular person for further work.
pt_br: Se um PR tem o campo `responsável` configurado com o nome de usuário de um desenvolvedor do FreeBSD, isso significa que o PR foi entregue para aquela pessoa específica para trabalhos posteriores.
ru: Если в PR поле `responsible` содержит имя пользователя разработчика FreeBSD, это означает, что PR передан этому конкретному человеку для дальнейшей работы.

source: Assigned PRs should not be touched by anyone but the assignee or bugmeister. If you have comments, submit a followup. If for some reason you think the PR should change state or be reassigned, send a message to the assignee. If the assignee does not respond within two weeks, unassign the PR and do as you please.
pt_br: Os PRs atribuídos não devem ser alterados por ninguém além do assignee ou do bugmeister. Se você tiver comentários, envie um acompanhamento. Se, por algum motivo, você achar que o PR deve mudar de estado ou ser reatribuído, envie uma mensagem para o assignee. Se o assignee não responder dentro de duas semanas, desfaça a atribuição do PR e faça o que desejar.
ru: Назначенные PR не должны изменяться никем, кроме назначенного исполнителя или bugmeister. Если у вас есть комментарии, отправьте последующее сообщение. Если по какой-либо причине вы считаете, что PR должен изменить состояние или быть переназначен, отправьте сообщение назначенному исполнителю. Если назначенный исполнитель не ответит в течение двух недель, снимите назначение с PR и действуйте по своему усмотрению.

source: Duplicate PRs
pt_br: PRs Duplicados
ru: Дублирующие PR

source: If you find more than one PR that describe the same issue, choose the one that contains the largest amount of useful information and close the others, stating clearly the number of the superseding PR. If several PRs contain non-overlapping useful information, submit all the missing information to one in a followup, including references to the others; then close the other PRs (which are now completely superseded).
pt_br: Se você encontrar mais de um PR que descreva o mesmo problema, escolha aquele que contém a maior quantidade de informações úteis e feche os outros, declarando claramente o número do PR substituto. Se vários PRs contêm informações úteis que não se sobrepõem, envie todas as informações ausentes em um acompanhamento para um PR, incluindo referências aos outros; em seguida, feche os outros PRs (que agora foram completamente substituídos).
ru: Если вы обнаружили несколько PR, описывающих одну и ту же проблему, выберите тот, который содержит наибольшее количество полезной информации, и закройте остальные, явно указав номер заменяющего PR. Если в нескольких PR содержится неперекрывающаяся полезная информация, добавьте всю недостающую информацию в один из них в виде последующего сообщения, включая ссылки на остальные PR; затем закройте другие PR (которые теперь полностью заменены).

source: Stale PRs
pt_br: PRs Obsoletos
ru: Устаревшие PR

source: A PR is considered stale if it has not been modified in more than six months. Apply the following procedure to deal with stale PRs:
pt_br: Um PR é considerado obsoleto se não foi modificado há mais de seis meses. Aplique o seguinte procedimento para lidar com PRs obsoletos:
ru: PR считается устаревшим, если он не изменялся более шести месяцев. Для обработки устаревших PR примените следующую процедуру:

source: If the PR contains sufficient detail, try to reproduce the problem in `-CURRENT` and `-STABLE`. If you succeed, submit a followup detailing your findings and try to find someone to assign it to. Set the state to "analyzed" if appropriate.
pt_br: Se o PR contém detalhes suficientes, tente reproduzir o problema em `-CURRENT` e `-STABLE`. Se você conseguir reproduzir o problema, envie um acompanhamento detalhando suas descobertas e tente encontrar alguém para atribuí-lo. Defina o estado como "analisado" se for apropriado.
ru: Если PR содержит достаточно деталей, попробуйте воспроизвести проблему в `-CURRENT` и `-STABLE`. Если удастся, отправьте уточнение с вашими находками и попытайтесь найти, кому можно назначить задачу. Установите состояние "analyzed" (проанализировано), если это уместно.

source: If the PR describes an issue which you know is the result of a usage error (incorrect configuration or otherwise), submit a followup explaining what the originator did wrong, then close the PR with the reason "User error" or "Configuration error".
pt_br: Se o PR descreve um problema que você sabe que é o resultado de um erro de uso (configuração incorreta ou de outra forma), envie um acompanhamento explicando o que o originador fez de errado e, em seguida, feche o PR com a razão "Erro do usuário" ou "Erro de configuração".
ru: Если PR описывает проблему, которая, как вам известно, является результатом ошибки использования (неправильной конфигурации или иной), отправьте комментарий с объяснением, что сделал не так автор, затем закройте PR с причиной "Ошибка пользователя" или "Ошибка конфигурации".

source: If the PR describes an error which you know has been corrected in both `-CURRENT` and `-STABLE`, close it with a message stating when it was fixed in each branch.
pt_br: Se o PR descreve um erro que você sabe que foi corrigido tanto em `-CURRENT` quanto em `-STABLE`, feche-o com uma mensagem indicando quando foi corrigido em cada branch.
ru: Если PR описывает ошибку, которая, как вам известно, была исправлена в обеих ветках `-CURRENT` и `-STABLE`, закройте его с сообщением, указывающим, когда она была исправлена в каждой из веток.

source: If the PR describes an error which you know has been corrected in `-CURRENT`, but not in `-STABLE`, try to find out when the person who corrected it is planning to MFC it, or try to find someone else (maybe yourself?) to do it. Set the state to "patched" and assign it to whomever will do the MFC.
pt_br: Se o PR descreve um erro que você sabe que foi corrigido em `-CURRENT`, mas não em `-STABLE`, tente descobrir quando a pessoa que corrigiu planeja fazer o MFC (merge from current) para o `-STABLE`, ou tente encontrar outra pessoa (talvez você mesmo?) para fazer isso. Defina o estado como "corrigido" e atribua-o à pessoa que fará o MFC.
ru: Если PR описывает ошибку, которая, как вам известно, исправлена в `-CURRENT`, но не в `-STABLE`, попытайтесь выяснить, когда планируется перенос исправления (MFC), или найдите кого-то (возможно, себя?), кто сможет это сделать. Установите статус "patched" и назначьте задачу тому, кто займётся переносом исправления (MFC).

source: In other cases, ask the originator to confirm if the problem still exists in newer versions. If the originator does not reply within a month, close the PR with the notation "Feedback timeout".
pt_br: Em outros casos, peça ao originador para confirmar se o problema ainda existe em versões mais recentes. Se o originador não responder dentro de um mês, feche o PR com a anotação "Tempo limite de feedback".
ru: В других случаях попросите автора подтвердить, сохраняется ли проблема в более новых версиях. Если автор не ответит в течение месяца, закройте PR с пометкой "Истекло время ожидания ответа".

source: Non-Bug PRs
pt_br: PRs não relacionados a bugs
ru: Не связанные с ошибками PR

source: Developers that come across PRs that look like they should have been posted to {freebsd-bugs} or some other list should close the PR, informing the submitter in a comment why this is not really a PR and where the message should be posted.
pt_br: Desenvolvedores que encontram PRs que parecem ter sido postados em {freebsd-bugs} ou em outra lista devem fechar o PR, informando ao remetente em um comentário por que isso não é realmente um PR e onde a mensagem deve ser postada.
ru: Разработчики, которые сталкиваются с PR, которые, по их мнению, должны были быть отправлены в {freebsd-bugs} или какой-либо другой список, должны закрыть PR, сообщив отправителю в комментарии, почему это не является PR и куда следует отправить сообщение.

source: The email addresses that Bugzilla listens to for incoming PRs have been published as part of the FreeBSD documentation, have been announced and listed on the web-site. This means that spammers found them.
pt_br: Os endereços de e-mail que o Bugzilla utiliza para receber PRs foram publicados como parte da documentação do FreeBSD, foram anunciados e listados no site. Isso significa que spammers os encontraram.
ru: Адреса электронной почты, которые Bugzilla использует для входящих PR, были опубликованы как часть документации FreeBSD, объявлены и перечислены на веб-сайте. Это означает, что спамеры их обнаружили.

source: Whenever you close one of these PRs, please do the following:
pt_br: Sempre que você fechar um desses PRs, por favor, faça o seguinte:
ru: Всякий раз, когда вы закрываете один из этих PR, пожалуйста, выполните следующее:

source: Set the component to `junk` (under `Supporting Services`.
pt_br: Defina o componente como `junk` (em `Supporting Services`).
ru: Установите компонент в значение `junk` (в разделе `Поддерживающие сервисы`).

source: Set Responsible to `nobody@FreeBSD.org`.
pt_br: Defina o responsável como `nobody@FreeBSD.org`.
ru: Установить Responsible в `nobody@FreeBSD.org`.

source: Set State to `Issue Resolved`.
pt_br: Defina o estado como `Problema Resolvido` (ou "Issue Resolved" em inglês).
ru: Установите состояние `Issue Resolved`.

source: Setting the category to `junk` makes it obvious that there is no useful content within the PR, and helps to reduce the clutter within the main categories.
pt_br: Definir a categoria como `junk` torna óbvio que não há conteúdo útil dentro do PR e ajuda a reduzir a desordem nas categorias principais.
ru: Установка категории в `junk` делает очевидным отсутствие полезного содержимого в PR и помогает уменьшить беспорядок в основных категориях.

source: Further Reading
pt_br: Leitura Adicional
ru: Для дальнейшего ознакомления

source: This is a list of resources relevant to the proper writing and processing of problem reports. It is by no means complete.
pt_br: Esta é uma lista de recursos relevantes para a escrita adequada e o processamento dos relatórios de problemas. De forma alguma é uma lista completa.
ru: Это список информационных ресурсов, относящихся к правильному написанию и обработке сообщений о проблемах. Он, без сомнения, не полон.

source: extref:{problem-reports}[How to Write FreeBSD Problem Reports]-guidelines for PR originators.
pt_br: extref:{problem-reports}[Como Escrever Relatórios de Problemas do FreeBSD] - diretrizes para os autores de PRs.
ru: extref:{problem-reports}[Как писать отчёты о проблемах в FreeBSD]-рекомендации для авторов отчётов.
