<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: 1.278
-->

<chapter id="install">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Restructur&eacute;, r&eacute;organis&eacute;, et en partie
	  r&eacute;&eacute;crit par </contrib>
      </author>
    </authorgroup>

    <authorgroup>
      <author>
	<firstname>Randy</firstname>
	<surname>Pratt</surname>
	<contrib>Le guide de sysinstall, les copies d'&eacute;crans, et la
	  plupart du texte sont de </contrib>
      </author>
    </authorgroup>
    <!-- January 2000 -->
  </chapterinfo>

  <title>Installer FreeBSD</title>
  &trans.a.fonvieille;

  <sect1 id="install-synopsis">
    <title>Synopsis</title>

    <indexterm><primary>installation</primary></indexterm>

    <para>FreeBSD est fournit avec un programme texte d'installation,
      facile d'emploi, appel&eacute; <application>sysinstall</application>.
      C'est le programme d'installation par d&eacute;faut de FreeBSD, bien que
      les vendeurs soient libres de fournir leur propre suite
      d'installation s'ils le d&eacute;sirent.  Ce chapitre d&eacute;crit
      comment
      utiliser <application>sysinstall</application> pour installer
      FreeBSD.</para>

    <para>Apr&egrave;s la lecture de ce chapitre, vous saurez:</para>

    <itemizedlist>
      <listitem>
	<para>Comment cr&eacute;er les disquettes d'installation de
	  FreeBSD.</para>
      </listitem>

      <listitem>
	<para>Comment FreeBSD attribue, et subdivise votre disque
	  dur.</para>
      </listitem>

      <listitem>
	<para>Comment lancer <application>sysinstall</application>.</para>
      </listitem>

      <listitem>
	<para>Les questions que <application>sysinstall</application>
	  vous posera, ce qu'elles signifient, et comment y
	  r&eacute;pondre.</para>
      </listitem>
    </itemizedlist>

    <para>Avant de lire ce chapitre, vous devrez:</para>

    <itemizedlist>
      <listitem>
	<para>Lire la liste du mat&eacute;riel support&eacute; fournie avec la
	  version de FreeBSD que vous allez installer, et v&eacute;rifier que
	  votre mat&eacute;riel est support&eacute;.</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>En g&eacute;n&eacute;ral, ces instructions d'installation sont
	&eacute;crites pour l'architecture &i386; (&ldquo;compatible PC&rdquo;).
	O&ugrave; elles seront applicables, les instructions sp&eacute;cifiques
	&agrave; d'autres plateformes (par exemple Alpha) seront
	indiqu&eacute;es.  Bien que ce guide soit maintenu &agrave; jour
	autant que possible, vous pourrez constater des
	diff&eacute;rences mineures entre le programme d'installation
	et ce qui est montr&eacute; ici.  Il est aussi
	sugg&eacute;r&eacute; d'utiliser ce chapitre comme un guide
	g&eacute;n&eacute;ral plut&ocirc;t comme un manuel
	d'installation &agrave; suivre &agrave; la ligne
	pr&egrave;s.</para>
    </note>

  </sect1>

  <sect1 id="install-pre">
    <title>T&acirc;ches de Pr&eacute;-installation</title>

    <sect2 id="install-inventory">
      <title>Inventoriez votre ordinateur</title>

      <para>Avant d'installer FreeBSD vous devriez faire l'inventaire des
        composants de votre ordinateur.  Les routines d'installation de
	FreeBSD afficheront ces composants (disques durs, cartes
	r&eacute;seaux, lecteurs de CDROM et ainsi de suite) avec leur type et
	leur constructeur.  FreeBSD essaiera &eacute;galement de
	d&eacute;terminer la configuration correcte pour ces
	p&eacute;riph&eacute;riques, ce qui inclut les
	informations sur les IRQs et l'utilisation des ports d'E/S.  En
	raison des caprices du mat&eacute;riel PC ce processus n'est pas
	toujours compl&egrave;tement r&eacute;ussi, et vous pourrez avoir
	besoin de corriger
	FreeBSD dans sa d&eacute;tection de votre configuration.</para>

      <para>Si vous avez d&eacute;j&agrave; un autre syst&egrave;me
	d'exploitation install&eacute;,
        tel que &windows; ou Linux, c'est une bonne id&eacute;e d'utiliser les
	moyens que proposent ces syst&egrave;mes d'exploitation pour voir
	comment votre mat&eacute;riel est actuellement configur&eacute;.
	Si vous n'&ecirc;tes pas s&ucirc;r des r&eacute;glages
	utilis&eacute;s par une carte
	d'extension, vous pouvez les trouver imprim&eacute;s sur la carte
	elle-m&ecirc;me.  Des valeurs d'IRQ courantes sont 3, 5 et 7, et les
	ports d'E/S sont normalement inscrits en hexad&eacute;cimal, comme par
	exemple 0x330.</para>

      <para>Nous vous recommandons de prendre note de ces informations
        avant d'installer FreeBSD.  Il pourra &ecirc;tre utile d'utiliser une
	table comme celle-ci:</para>

      <table pgwide="1" frame="none">
	<title>Exemple d'Inventaire de P&eacute;riph&eacute;riques</title>

	<tgroup cols="4">
	  <colspec colwidth="2*">
	  <colspec colwidth="1*">
	  <colspec colwidth="1*">
	  <colspec colwidth="4*">
	  <thead>
	    <row>
	      <entry>Nom du P&eacute;riph&eacute;rique</entry>

	      <entry>IRQ</entry>

	      <entry>Port(s) d'E/S</entry>

	      <entry>Notes</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry>Premier disque dur</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>40&nbsp;GO, fabriqu&eacute; par Seagate, premier disque IDE
		ma&icirc;tre</entry>
	    </row>

	    <row>
	      <entry>CDROM</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>Premier disque IDE esclave</entry>
	    </row>

	    <row>
	      <entry>Second disque dur</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>20&nbsp;GO, fabriqu&eacute; par IBM, second disque IDE
		ma&icirc;tre</entry>
	    </row>

	    <row>
	      <entry>Premier contr&ocirc;leur IDE</entry>

	      <entry>14</entry>

	      <entry>0x1f0</entry>

	      <entry></entry>
	    </row>

	    <row>
	      <entry>Carte r&eacute;seau</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&intel; 10/100</entry>
	    </row>

	    <row>
	      <entry>Modem</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&tm.3com; 56K faxmodem, sur COM1</entry>
	    </row>

	    <row>
	      <entry>&hellip;</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>
    </sect2>

    <sect2>
      <title>Sauvegardez vos donn&eacute;es</title>

      <para>Si l'ordinateur sur lequel vous allez installer FreeBSD
	contient des donn&eacute;es importantes alors assurez vous que vous les
	avez sauvegard&eacute;es, et que vous avez test&eacute; ces sauvegardes
	avant d'installer FreeBSD.  Le programme d'installation de FreeBSD
	vous sollicitera avant d'&eacute;crire sur votre disque,
	mais une fois que ce processus aura &eacute;t&eacute; lanc&eacute;,
	il ne pourra &ecirc;tre annul&eacute;.</para>
    </sect2>

    <sect2 id="install-where">
      <title>O&ugrave; installer FreeBSD?</title>

      <para>Si vous voulez que FreeBSD utilise tout votre disque, alors
	il n'y rien de particulier &agrave; ajouter &agrave; ce niveau
	l&agrave; &mdash; vous pouvez passer cette section.</para>

      <para>Cependant, si FreeBSD doit coexister avec d'autres syst&egrave;mes
	d'exploitation alors vous avez besoin de comprendre
	approximativement comment les donn&eacute;es sont dispos&eacute;es
	sur le disque, et comment cela vous affecte.</para>

      <sect3 id="install-where-i386">
	<title>Organisation des disques pour l'architecture &i386;</title>

      <para>Le disque d'un PC peut &ecirc;tre divis&eacute; en parties
	ind&eacute;pendantes.
	Ces parties sont appel&eacute;es <firstterm>partitions</firstterm>.
	De par sa conception le PC ne supporte que quatre partitions par
	disque.  Ces partitions sont appel&eacute;es
	<firstterm>partitions primaires</firstterm>.  Pour contourner cette
	limitation et autoriser plus de quatre partitions, un nouveau type de
	partition a &eacute;t&eacute; cr&eacute;&eacute;, la
	<firstterm>partition &eacute;tendue</firstterm>.
	Un disque ne pourra contenir qu'une seule partition &eacute;tendue.
	Des partitions sp&eacute;ciales, appel&eacute;es
	<firstterm>partitions logiques</firstterm>, peuvent &ecirc;tre
	cr&eacute;&eacute;es
	&agrave; l'int&eacute;rieur de la partition &eacute;tendue.</para>

      <para>Chaque partition a un <firstterm>identifiant de
	partition</firstterm>, qui est un nombre utilis&eacute; pour identifier
	le type de donn&eacute;e pr&eacute;sent sur la partition.
	Les partitions de
	FreeBSD ont l'identifiant <literal>165</literal>.</para>

      <para>En g&eacute;n&eacute;ral, chaque syst&egrave;me d'exploitation
	que vous utilisez identifiera les partitions d'une mani&egrave;re
	particuli&egrave;re.  Par
	exemple, DOS, et ses descendants, comme &windows;, associe &agrave;
	chaque partition primaire et logique <firstterm>une lettre
	appel&eacute;e lecteur</firstterm>, en commen&ccedil;ant avec
	<devicename>C:</devicename>.</para>

      <para>FreeBSD doit &ecirc;tre install&eacute; sur une partition primaire.
	FreeBSD peut conserver toutes ses donn&eacute;es, y compris tous les
	fichiers que vous cr&eacute;ez, sur cette partition.  Cependant, si
	vous avez de multiples disques, alors vous pouvez cr&eacute;er une
	partition FreeBSD sur tous ou certains d'entre eux.  Quand vous
	installez FreeBSD, vous devez avoir une partition disponible.
	Cela pourrait &ecirc;tre une partition vierge que vous avez
	pr&eacute;par&eacute;, ou une partition existante qui contient
	des donn&eacute;es dont vous n'avez plus besoin.</para>

      <para>Si vous utilisez d&eacute;j&agrave; toutes les partitions sur
	tous vos disques, alors vous devrez lib&eacute;rer l'une d'elle pour
	FreeBSD &agrave;
	l'aide des outils fournis par les autre syst&egrave;mes d'exploitation
	(e.g. <command>fdisk</command> sous DOS ou &windows;).</para>

      <para>Si vous avez une partition disponible alors vous pouvez
	l'utiliser.  Cependant, vous aurez peut &ecirc;tre besoin de diminuer
	une ou plusieurs de vos partitions existantes en premier
	lieu.</para>

      <para>Une installation minimale de FreeBSD prend aussi peu que
	100&nbsp;MO d'espace disque.  Cependant c'est vraiment une installation
	<emphasis>minimale</emphasis>, ne laissant presqu'aucun espace
	pour vos propres fichiers.  Un minimum plus r&eacute;aliste est 250&nbsp;MO
	sans environnement graphique, et 350&nbsp;MO ou plus si vous d&eacute;sirez
	une interface graphique.  Si vous avez l'intention d'installer
	beaucoup d'applications alors vous aurez besoin de plus
	d'espace.</para>

      <para>Vous pouvez utiliser un outil commercial comme
	<application>&partitionmagic;</application> pour redimensionner
	vos partitions pour faire de la place &agrave; FreeBSD.
	Le r&eacute;pertoire
	<filename>tools</filename> sur le CDROM contient deux logiciels
	libres qui peuvent effectuer cette t&acirc;che,
	<application>FIPS</application>, <application>PResizer</application>,
	et <application>&partitionmagic;</application> peuvent
	redimensionner les partitions <acronym>FAT16</acronym> et
	<acronym>FAT32</acronym>&mdash; utilis&eacute;es sous &ms-dos;
	jusqu'&agrave; &windows; ME.
	<application>&partitionmagic;</application> est la seule
	application connue pour &ecirc;tre en mesure de redimensionner
	des partitions <acronym>NTFS</acronym>.
	La documentation pour deux de ces programmes se trouve dans le m&ecirc;me
	r&eacute;pertoire.</para>

      <warning>
	<para>Une utilisation incorrecte de ces outils peut d&eacute;truire les
	  donn&eacute;es sur votre disque.  Soyez s&ucirc;r d'avoir des
	  sauvegardes r&eacute;centes et qui fonctionnent avant d'utiliser ces
	  outils.</para>
      </warning>

      <example>
	<title>Utilisation d'une partition existante</title>

	<para>Supposez que vous avez un ordinateur avec un seul disque
	  de 4&nbsp;GO qui a d&eacute;j&agrave; une version de &windows;
	  install&eacute;e, et que
	  vous avez divis&eacute; ce disque en deux lecteurs
	  <devicename>C:</devicename> et <devicename>D:</devicename>,
	  chacun de 2&nbsp;GO.  Vous avez 1GO de donn&eacute;e sur
	  <devicename>C:</devicename> et 0.5&nbsp;GO sur
	  <devicename>D:</devicename>.</para>

	<para>Cela signifie que vous avez deux partitions sur ce disque,
	  une par lecteur.  Vous pouvez transf&eacute;rer toutes les
	  donn&eacute;es de
	  <devicename>D:</devicename> vers <devicename>C:</devicename>,
	  ce qui lib&eacute;rera la partition pour FreeBSD.</para>
      </example>

      <example>
	<title>Redimensionner une partition existante</title>

	<para>Supposez que vous avez un ordinateur avec un seul disque
	  de 4&nbsp;GO qui a d&eacute;j&agrave; une version de &windows;
	  install&eacute;e.  Quand vous avez install&eacute; &windows; vous
	  avez cr&eacute;&eacute; une seule grande
	  partition, vous donnant un lecteur <devicename>C:</devicename>
	  de 4&nbsp;GO.  Vous utilisez actuellement un espace de 1.5&nbsp;GB, et
	  vous d&eacute;sirez 2&nbsp;GO pour FreeBSD.</para>

	<para>Afin d'installer FreeBSD vous devrez soit:</para>

	<orderedlist>
	  <listitem>
	    <para>Sauvegarder vos donn&eacute;es &windows;, et ensuite
	      r&eacute;installer &windows;, en utilisant qu'une partition de 2&nbsp;GO
	      &agrave; l'installation.</para>
	  </listitem>

	  <listitem>
	    <para>Soit utiliser un des outils comme
	      <application>&partitionmagic;</application>, d&eacute;crits plus
	      haut, pour redimensionner votre partition &windows;</para>
	  </listitem>
	</orderedlist>
      </example>

      </sect3>

      <sect3>
	<title>Organisation des disques pour l'architecture Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

	<para>Vous aurez besoin d'un disque d&eacute;di&eacute; pour FreeBSD
	  sur un Alpha.  Il n'est pas possible de partager un disque avec un
	  autre syst&egrave;me d'exploitation pour le moment.  Selon le type de
	  machine Alpha dont vous disposez, ce disque peut soit &ecirc;tre un
	  disque SCSI ou un disque IDE, d&egrave;s l'instant que votre machine
	  est capable de d&eacute;marrer depuis ce disque.</para>

	<para>Suivant les conventions des manuels de Digital / Compaq,
	  toute entr&eacute;e SRM sera donn&eacute;e en majuscule.  SRM n'est
	  pas sensible &agrave; la casse des caract&egrave;res.</para>

	<para>Pour d&eacute;terminer les noms et les types de disques
	  pr&eacute;sent dans votre machine, utilisez la commande <literal>SHOW
	  DEVICE</literal> &agrave; l'invite de la console SRM:</para>

	<screen>&gt;&gt;&gt;<userinput>SHOW DEVICE</userinput>
dka0.0.0.4.0               DKA0           TOSHIBA CD-ROM XM-57  3476
dkc0.0.0.1009.0            DKC0                       RZ1BB-BS  0658
dkc100.1.0.1009.0          DKC100             SEAGATE ST34501W  0015
dva0.0.0.0.1               DVA0
ewa0.0.0.3.0               EWA0              00-00-F8-75-6D-01
pkc0.7.0.1009.0            PKC0                  SCSI Bus ID 7  5.27
pqa0.0.0.4.0               PQA0                       PCI EIDE
pqb0.0.1.4.0               PQB0                       PCI EIDE</screen>

	<para>Cet exemple provient d'une machine &ldquo;Digital Personal
	  Workstation 433au&rdquo; et fait appara&icirc;tre trois disques
	  attach&eacute;s &agrave; la machine.  Le premier est un lecteur de
	  CDROM appel&eacute; <devicename>DKA0</devicename> et les deux
	  autres sont des disques dur nomm&eacute;s respectivement
	  <devicename>DKC0</devicename> et
	  <devicename>DKC100</devicename>.</para>

	<para>Les disques avec des noms de la forme
	  <devicename>DKx</devicename> sont des disques SCSI.  Par
	  exemple <devicename>DKA100</devicename> correspond &agrave; un
	  disque SCSI situ&eacute; sur le premier bus SCSI (A) et avec pour
	  identifiant 1, tandis que <devicename>DKC300</devicename>
	  correspond &agrave; un disque SCSI situ&eacute; sur le
	  troisi&egrave;me bus (C) et
	  ayant l'identifiant 3.  Le nom de p&eacute;riph&eacute;rique
	  <devicename>PKx</devicename> correspond au contr&ocirc;leur SCSI.
	  Comme le montre le r&eacute;sultat de la commande <literal>SHOW
	  DEVICE</literal>, les lecteurs de CDROM SCSI sont trait&eacute;s
	  comme n'importe quel disque dur SCSI.</para>

	<para>Les disque IDE ont des noms du type
	  <devicename>DQx</devicename> et
	  <devicename>PQx</devicename> correspond au contr&ocirc;leur IDE
	  associ&eacute;.</para>

      </sect3>
    </sect2>

    <sect2>
      <title>Conna&icirc;tre la configuration de votre r&eacute;seau</title>

      <para>Si vous avez l'intention d'utiliser un r&eacute;seau pour
	votre installation de FreeBSD (par exemple, si vous allez
	installer &agrave; partir d'un site FTP, ou d'un serveur NFS), alors
	vous devez conna&icirc;tre votre configuration r&eacute;seau.  On vous
	demandera ces informations durant l'installation afin que
	FreeBSD puisse se connecter au r&eacute;seau pour terminer
	l'installation.</para>

      <sect3>
	<title>Connexion par r&eacute;seau Ethernet, ou modem Cable/DSL</title>

	<para>Si vous vous connectez &agrave; un r&eacute;seau Ethernet, ou que
	  vous avez une connexion Internet par c&acirc;ble ou DSL utilisant une carte Ethernet, alors vous
	  aurez besoin des informations suivantes:</para>

	<orderedlist>
	  <listitem>
	    <para>Adresse IP</para>
	  </listitem>

	  <listitem>
	    <para>Adresse IP de la passerelle par d&eacute;faut</para>
	  </listitem>

	  <listitem>
	    <para>Nom de l'h&ocirc;te</para>
	  </listitem>

	  <listitem>
	    <para>Adresses IP du serveur DNS</para>
	  </listitem>

	  <listitem>
	    <para>Masque de sous-r&eacute;seau</para>
	  </listitem>
	</orderedlist>

	<para>Si vous ne connaissez pas ces informations, alors
	  adressez-vous &agrave; votre administrateur syst&egrave;me ou votre
	  fournisseur d'acc&egrave;s.  Ils peuvent vous dire que ces
	  informations sont assign&eacute;es automatiquement par
	  l'interm&eacute;diaire
	  de <firstterm>DHCP</firstterm>.  Si c'est le cas prenez en
	  note.</para>
      </sect3>

      <sect3>
	<title>Connexion par modem</title>

	<para>Si vous vous connectez &agrave; un fournisseur d'acc&egrave;s
	  en utilisant un
	  modem classique alors vous pouvez toujours installer FreeBSD en
	  utilisant Internet, cela prendra juste beaucoup de temps.</para>

	<para>Vous devrez conna&icirc;tre:</para>

	<orderedlist>
	  <listitem>
	    <para>Le num&eacute;ro de t&eacute;l&eacute;phone de connexion
	      &agrave; votre fournisseur d'acc&egrave;s</para>
	  </listitem>

	  <listitem>
	    <para>Le port COM: le port auquel votre modem est connect&eacute;</para>
	  </listitem>

	  <listitem>
	    <para>Le nom d'utilisateur et le mot de passe de votre
	      compte Internet</para>
	  </listitem>
	</orderedlist>
      </sect3>
    </sect2>
    <sect2>
      <title>V&eacute;rifier l'Errata</title>

      <para>Bien que le projet FreeBSD s'efforce de s'assurer que chaque
	version de FreeBSD soit aussi stable que possible, des bogues
	peuvent parfois exister.  Il est tr&egrave;s rare que ces bogues
	affectent le processus d'installation.  D&egrave;s que ces
	probl&egrave;mes sont d&eacute;couverts et corrig&eacute;s, ils
	sont not&eacute;s dans l'<ulink url="http://www.freebsd.org/releases/5.1-R/errata.html">Errata de FreeBSD</ulink>, pr&eacute;sent sur le
	site web de FreeBSD.  Vous devriez v&eacute;rifier l'errata avant
	l'installation afin d'&ecirc;tre s&ucirc;r qu'il n'y a pas de
	probl&egrave;me de derni&egrave;re minute &agrave; prendre
	en compte.</para>

      <para>Les informations sur chaque version, y compris les errata,
	peuvent &ecirc;tre trouv&eacute; dans la section <ulink
	url="../../../../releases/index.html">d'information sur les
	diff&eacute;rentes
	versions</ulink> situ&eacute;e sur le <ulink
	url="../../../../index.html">site web de FreeBSD</ulink>.</para>
    </sect2>

    <sect2>
      <title>Obtenir les fichiers d'installation de FreeBSD</title>

      <para>Le processus d'installation de FreeBSD peut installer
	FreeBSD &agrave; partir de fichiers plac&eacute;s dans
	les endroits suivants:</para>

      <itemizedlist>
	<title>Un m&eacute;dia local</title>
	
	<listitem>
	  <para>Un CDROM ou un DVD</para>
	</listitem>

	<listitem>
	  <para>Une partition DOS sur le m&ecirc;me ordinateur</para>
	</listitem>

	<listitem>
	  <para>Une bande SCSI ou QIC</para>
	</listitem>

	<listitem>
	  <para>Des disquettes</para>
	</listitem>
      </itemizedlist>

      <itemizedlist>
	<title>Le r&eacute;seau</title>

	<listitem>
	  <para>Un site FTP, en passant par un coupe-feu, ou en
	    utilisant un proxy HTTP si n&eacute;cessaire</para>
	</listitem>

	<listitem>
	  <para>Un serveur NFS</para>
	</listitem>

	<listitem>
	  <para>Une connexion d&eacute;di&eacute;e parall&egrave;le
	    ou s&eacute;rie</para>
	</listitem>
      </itemizedlist>

      <para>Si vous avez achet&eacute; FreeBSD sur CD ou DVD alors vous
	disposez d&eacute;j&agrave; de ce que vous avez besoin,
	et vous devriez passer &agrave; la section suivante 
	(<xref linkend="install-floppies">).</para>

      <para>Si vous n'avez pas r&eacute;cup&eacute;r&eacute; les fichiers
	d'installation de FreeBSD vous devriez aller directement &agrave; la
	<xref linkend="install-diff-media"> qui explique comment se
	pr&eacute;parer &agrave; installer FreeBSD &agrave; partir d'une des
	solutions donn&eacute;es ci-dessus.  Apr&egrave;s avoir lu cette
	section, vous devrez revenir ici, et continuer la lecture avec la
	<xref linkend="install-floppies">.</para>
    </sect2>

    <sect2 id="install-floppies">
      <title>Pr&eacute;parer les supports de d&eacute;marrage</title>

      <para>Le processus d'installation de FreeBSD est lanc&eacute; en
	d&eacute;marrant votre ordinateur dans l'installateur de
	FreeBSD&mdash;ce n'est pas un programme que vous ex&eacute;cutez
	&agrave; partir d'un autre syst&egrave;me d'exploitation.  Votre
	ordinateur d&eacute;marre normalement en utilisant le syst&egrave;me
	d'exploitation install&eacute; sur votre disque dur, mais il peut
	&eacute;galement &ecirc;tre configur&eacute; pour
	utiliser une disquette &ldquo;bootable&rdquo;.
	La plupart des ordinateurs modernes peuvent
	&eacute;galement d&eacute;marrer &agrave; partir d'un CDROM
	pr&eacute;sent dans le lecteur de CDROM.</para>

      <tip>
	<para>Si vous avez FreeBSD sur CDROM ou DVD (soit un que vous
	  avez achet&eacute;, soit pr&eacute;parez vous-m&ecirc;me),
	  et que votre ordinateur vous permet de d&eacute;marrer sur le lecteur
	  de CDROM ou DVD (typiquement une option du BIOS appel&eacute;e
	  &ldquo;Boot Order&rdquo; ou &eacute;quivalent) alors vous pouvez
	  passer cette section.
	  Les CDROMs ou DVDs de FreeBSD sont bootable et peuvent
	  &ecirc;tre utilis&eacute;s pour installer FreeBSD sans autre
	  pr&eacute;paration.</para>
      </tip>

      <para>Pour cr&eacute;er les images des disquettes de d&eacute;marrage,
	suivez les &eacute;tapes suivantes:</para>

      <procedure>
	<step>
	  <title>Obtenir les images des disquettes de d&eacute;marrage</title>

	  <para>Les images des disquettes de d&eacute;marrage sont disponibles
	    sur votre m&eacute;dia d'installation dans le r&eacute;pertoire
	    <filename>floppies/</filename> et peuvent &eacute;galement &ecirc;tre
	    t&eacute;l&eacute;charg&eacute;es sur le site FTP depuis le <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/floppies/">
	    r&eacute;pertoire floppies</ulink> pour l'architecture &i386; et depuis ce <ulink url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/alpha/&rel.current;-RELEASE/floppies/">r&eacute;pertoire floppies</ulink> pour l'architecture Alpha.</para>

	  <para>Les images de disquettes ont l'extension
	    <filename>.flp</filename>.  Le r&eacute;pertoire
	    <filename>floppies/</filename> contient un certain nombre
	    d'images diff&eacute;rentes, et celles que vous devrez utiliser
	    d&eacute;pendent de la version de FreeBSD que vous allez
	    installer, et
	    dans certains cas, du mat&eacute;riel sur lequel vous effectuez
	    l'installation.  Dans la plupart des cas vous aurez juste besoin
	    de deux fichiers, <filename>kern.flp</filename> et
	    <filename>mfsroot.flp</filename>.  Des pilotes
	    de p&eacute;riph&eacute;riques suppl&eacute;mentaires
	    peuvent &ecirc;tre n&eacute;cessaires pour certains
	    syst&egrave;mes.  Ces pilotes sont fournis sur l'image
	    <filename>drivers.flp</filename>.  Consultez
	    <filename>README.TXT</filename> dans le m&ecirc;me
	    r&eacute;pertoire pour une information actualis&eacute;e
	    sur ces images de disquette.</para>

	  <important>
	    <para>Votre programme FTP doit utiliser le <emphasis>mode
	      binaire</emphasis> pour t&eacute;l&eacute;charger ces images.
	      Quelques navigateurs sont connus pour employer le mode
	      <emphasis>texte</emphasis> (ou
	      <emphasis>ASCII</emphasis>), ce qui sera manifeste si vous
	      ne pouvez d&eacute;marrer depuis ces images.</para>
	  </important>
	</step>

	<step>
	  <title>Pr&eacute;parer les disquettes</title>

	  <para>Vous devez pr&eacute;parer une disquette par fichier que vous
	    avez d&ucirc; t&eacute;l&eacute;charger.  Il est imp&eacute;ratif
	    que ces disquettes soient exemptes de d&eacute;fauts.
	    La mani&egrave;re la plus simple de
	    tester cela est de les formater soi-m&ecirc;me.  Ne faites pas
	    confiance aux disquettes pr&eacute;format&eacute;es.
	    L'utilitaire de formatage &windows; n'indiquera pas la
	    pr&eacute;sence de blocs d&eacute;fectueux, il les
	    marquera simplement comme &eacute;tant
	    &ldquo;d&eacute;fectueux&rdquo; et les ignorera.  Il est
	    recommand&eacute; d'utiliser des disquettes neuves si l'on
	    choisit cette m&eacute;thode d'installation.</para>

	  <important>
	    <para>Si vous essayez d'installer FreeBSD et que le
	      programme d'installation &ldquo;plante&rdquo;, se bloque,
	      ou pr&eacute;sente d'autres disfonctionnements,
	      les premi&egrave;res choses
	      &agrave; suspecter sont les disquettes.  Essayez de copier les
	      images sur des disquettes neuves et essayez encore.</para>
	  </important>
	</step>

	<step>
	  <title>Ecrire les fichiers image sur les disquettes</title>

	  <para>Les fichiers <filename>.flp</filename> ne sont
	    <emphasis>pas</emphasis> des fichiers que vous pouvez copier
	    directement sur une disquette.  Ce sont des
	    images du contenu complet de disquettes.  Cela signifie que
	    vous <emphasis>ne pouvez pas</emphasis> simplement copier
	    les fichiers d'un disque vers un autre.
	    Vous devez utilisez des outils
	    sp&eacute;cifiques pour &eacute;crire directement les images sur
	    les disquettes.</para>

	  <indexterm><primary>DOS</primary></indexterm>
	  <para>Si vous cr&eacute;ez ces disquettes depuis un ordinateur
	    fonctionnant sous &ms-dos;/&windows;, alors nous fournissons pour
	    faire cela un outil appel&eacute; <command>fdimage</command>.</para>

	  <para>Si vous utilisez les images pr&eacute;sentes sur le CDROM, et
	    que votre lecteur CDROM est <devicename>E:</devicename>,
	    alors vous devez proc&eacute;der comme suit:</para>

	  <screen><prompt>E:\&gt;</prompt> <userinput>tools\fdimage floppies\kern.flp A:</userinput></screen>

	  <para>R&eacute;p&eacute;tez cette commande pour chaque fichier
	    <filename>.flp</filename>, en rempla&ccedil;ant la disquette
	    &agrave; chaque fois, en &eacute;tant s&ucirc;r de noter sur
	    les disquettes le nom du fichier copi&eacute;.
	    Ajuster la ligne de commande selon
	    l'endroit o&ugrave; vous avez plac&eacute; les fichiers
	    <filename>.flp</filename>.  Si vous n'avez pas de CDROM,
	    alors <command>fdimage</command> peut &ecirc;tre
	    t&eacute;l&eacute;charg&eacute; de
	    puis le <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/tools/">r&eacute;pertoire
	    <filename class="directory">tools</filename></ulink> sur le site FTP de
	    FreeBSD.<para>

	  <para>Si vous cr&eacute;ez les disquettes depuis un syst&egrave;me
	    &unix; (comme par exemple un autre syst&egrave;me FreeBSD) vous
	    pouvez
	    utiliser la commande &man.dd.1; pour &eacute;crire les fichiers
	    image directement sur les disquettes.  Sur FreeBSD, vous
	    lanceriez:</para>

	  <screen>&prompt.root; <userinput>dd if=kern.flp of=/dev/fd0</userinput></screen>

	  <para>Sur FreeBSD, <filename>/dev/fd0</filename> correspond au
	    premier lecteur de disquettes ( le lecteur
	    <devicename>A:</devicename>).  <filename>/dev/fd1</filename> serait
	    le lecteur <devicename>B:</devicename>, et ainsi de suite.
	    D'autres variantes d'&unix; peuvent avoir des noms diff&eacute;rents
	    pour les lecteurs de disquettes, et vous devrez consulter la
	    documentation du syst&egrave;me si besoin est.</para>
	</step>
      </procedure>

      <para>Vous &ecirc;tes maintenant pr&ecirc;t &agrave; commencer
	l'installation de FreeBSD.</para>
    </sect2>
  </sect1>

  <sect1 id="install-start">
    <title>D&eacute;buter l'installation</title>

    <important>
      <para>Par d&eacute;faut, le processus d'installation ne modifiera rien
	sur le(s) disque(s) dur(s) jusqu'&agrave; ce que vous voyiez le message
	suivant.</para>

      <literallayout class="monospaced">Last Chance: Are you SURE you want continue the installation?

If you're running this on a disk with data you wish to save then WE
STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding!

We can take no responsibility for lost disk contents!</literallayout>

      <para>L'installation peut &ecirc;tre quitt&eacute;e &agrave; tout
	moment avant
	l'avertissement final sans changer le contenu du disque dur.  Si
	vous avez mal configur&eacute; quelque chose, vous pouvez
	juste &eacute;teindre
	l'ordinateur avant l'&eacute;tape finale sans aucun risque.</para>
    </important>

    <sect2 id="install-starting">
      <title>D&eacute;marrage</title>

      <sect3 id="install-starting-i386">
        <title>D&eacute;marrage pour l'architecture &i386;</title>

      <procedure>
	<step>
	  <para>Commencez avec votre ordinateur &eacute;teint.</para>
	</step>

	<step>
	  <para>Allumez l'ordinateur.  En d&eacute;marrant il devrait afficher
	    une option pour entrer dans le menu de configuration du
	    syst&egrave;me, ou BIOS, g&eacute;n&eacute;ralement &agrave;
	    l'aide des touches
	    <keycap>F2</keycap>, <keycap>F10</keycap>, <keycap>Suppr, </keycap>
	    ou
	    <keycombo action="simul">
	      <keycap>Alt</keycap>
	      <keycap>S</keycap>
	    </keycombo>.  Employez ce qui est indiqu&eacute; &agrave;
	    l'&eacute;cran.  Dans
	    certains cas votre ordinateur peut afficher une image pendant
	    son d&eacute;marrage.  Typiquement, l'appui sur
	    <keycap>Esc</keycap> effacera l'image et vous permettra de
	    voir les messages de d&eacute;marrage.</para>
	</step>

	<step>
	  <para>Trouvez le param&egrave;tre qui contr&ocirc;le &agrave;
	    partir de quel
	    p&eacute;riph&eacute;rique le syst&egrave;me d&eacute;marre.
	    Cela est g&eacute;n&eacute;ralement nomm&eacute; &ldquo;Boot
	    Order&ldquo; (ordre de d&eacute;marrage) et habituellement sous
	    la forme d'une liste de p&eacute;riph&eacute;riques, comme
	    <literal>Floppy</literal>, <literal>CDROM</literal>,
	    <literal>First Hard Disk</literal>, et ainsi de suite.</para>

	  <para>Si vous avez d&ucirc; pr&eacute;parer des disquettes
	    de d&eacute;marrage, assurez-vous alors que le lecteur de
	    disquettes est s&eacute;lectionn&eacute;.  Si vous
	    d&eacute;marrez depuis le CDROM alors v&eacute;rifiez que c'est
	    celui-ci qui est s&eacute;lectionn&eacute; &agrave; la place.
	    En cas de doute, vous devriez consulter le manuel fourni
	    avec votre ordinateur, et/ou sa carte m&egrave;re.</para>

	  <para>Effectuez les changements, ensuite sauvez et quittez.
	    L'ordinateur devrait maintenant red&eacute;marrer.</para>
	</step>

	<step>
	  <para>Si vous avez d&ucirc; pr&eacute;parer des disquettes de
	    d&eacute;marrage, comme d&eacute;crit dans la
	    <xref linkend="install-floppies"> alors l'une d'elles sera la
	    premi&egrave;re disquette de d&eacute;marrage,
	    probablement celle contenant <filename>kern.flp</filename>.
	    Introduisez cette disquette dans votre lecteur.</para>

	  <para>Si vous d&eacute;marrez depuis le CDROM, alors vous devrez
	    allumer votre ordinateur, et ins&eacute;rer le CDROM &agrave;
	    la premi&egrave;re occasion.</para>

	  <para>Si votre ordinateur d&eacute;marre comme &agrave;
	    l'accoutum&eacute;, et charge le syst&egrave;me d'exploitation
	    existant, alors soit:</para>

	  <orderedlist>
	    <listitem>
	      <para>Les disques (CDROM ou disquette) n'ont pas
		&eacute;t&eacute; ins&eacute;r&eacute;s assez t&ocirc;t
		dans le processus de d&eacute;marrage.
		Laissez-les, et essayez de red&eacute;marrer votre
		ordinateur.</para>
	    </listitem>

	    <listitem>
	      <para>Soit les changements du BIOS, plus t&ocirc;t, n'ont pas
	        fonctionn&eacute; correctement.  Vous devriez refaire cette
		&eacute;tape jusqu'&agrave; obtenir la bonne option.</para>
	    </listitem>

	    <listitem>
	      <para>Soit votre BIOS ne supporte pas le
	      d&eacute;marrage &agrave; partir du support
	      d&eacute;sir&eacute;.</para>
	    </listitem>
	</orderedlist>
	</step>

	<step>
	  <para>FreeBSD d&eacute;marrera.  Si vous d&eacute;marrez depuis
	    le CDROM vous verrez un affichage similaire &agrave; ceci (information sur la version omise):</para>

	  <screen>Verifying DMI Pool Data ........
Boot from ATAPI CD-ROM :
 1. FD 2.88MB  System Type-(00)
Uncompressing ... done

BTX loader 1.00 BTX version is 1.01
Console: internal video/keyboard
BIOS drive A: is disk0
BIOS drive B: is disk1
BIOS drive C: is disk2
BIOS drive D: is disk3
BIOS 639kB/261120kB available memory

FreeBSD/i386 bootstrap loader, Revision 0.8

/kernel text=0x277391 data=0x3268c+0x332a8 |

|
Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>

	  <para>Si vous d&eacute;marrez depuis une disquette, vous verrez un
	    affichage similaire &agrave; ceci (information sur la version omise):</para>

	  <screen>Verifying DMI Pool Data ........

BTX loader 1.00  BTX version is 1.01
Console: internal video/keyboard
BIOS drive A: is disk0
BIOS drive C: is disk1
BIOS 639kB/261120kB available memory

FreeBSD/i386 bootstrap loader, Revision 0.8

/kernel text=0x277391 data=0x3268c+0x332a8 |

Please insert MFS root floppy and press enter:</screen>

	  <para>Suivez ces instructions en retirant la disquette
	  <filename>kern.flp</filename>, puis ins&eacute;rez la disquette
	  <filename>mfsroot.flp</filename> et enfin appuyez sur
	  <keycap>Entr&eacute;e</keycap>.</para>
	</step>

	<step>
	  <para>Que vous d&eacute;marriez &agrave; partir
	    de disquettes ou de CDROM, le processus de d&eacute;marrage
	    vous am&egrave;nera au point suivant:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>

	  <para>Attendez dix secondes, ou appuyez sur
	  <keycap>Entr&eacute;e</keycap>.  Cela lancera le menu de
	  configuration du noyau.</para>
	</step>
      </procedure>

      </sect3>
      <sect3>
        <title>D&eacute;marrage pour l'architecture Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

      <procedure>
	<step>
	  <para>Commencez avec votre ordinateur &eacute;teint.</para>
	</step>

	<step>
	  <para>Allumez votre ordinateur et attendez l'invite de
	    commande du moniteur de d&eacute;marrage.</para>
        </step>

	<step>
	  <para>Si vous avez d&ucirc; pr&eacute;parer des disquettes de
	    d&eacute;marrage, comme d&eacute;crit dans la
	    <xref linkend="install-floppies"> alors l'une d'elles sera la
	    premi&egrave;re disquette de d&eacute;marrage,
	    probablement celle contenant <filename>kern.flp</filename>.
	    Introduisez cette disquette dans votre lecteur et tapez les
	    commandes suivantes pour d&eacute;marrer la disquette (en
	    rempla&ccedil;ant le nom de votre lecteur de disquette si
	    n&eacute;cessaire):</para>

	  <screen>&gt;&gt;&gt;<userinput>BOOT DVA0 -FLAGS '' -FILE ''</userinput></screen>

	  <para>Si vous d&eacute;marrez depuis le CDROM, ins&eacute;rez
	    le CDROM dans
	    son lecteur et tapez la commande suivante pour d&eacute;marrer
	    l'installation (en rempla&ccedil;ant le nom du lecteur de CDROM si
	    n&eacute;cessaire par celui appropri&eacute;):</para>

          <screen>&gt;&gt;&gt;<userinput>BOOT DKA0 -FLAGS '' -FILE ''</userinput></screen>
	</step>

	<step>
	  <para>FreeBSD d&eacute;marrera.  Si vous d&eacute;marrez depuis une
	  disquette, au bout d'un moment vous verrez le message:</para>

	  <screen>Please insert MFS root floppy and press enter:</screen>

	  <para>Suivez ces instructions en retirant la disquette
	    <filename>kern.flp</filename>, puis ins&eacute;rez la disquette
	    <filename>mfsroot.flp</filename> et enfin appuyez sur
	    <keycap>Entr&eacute;e</keycap>.</para>
	</step>

	<step>
	  <para>Que vous d&eacute;marriez &agrave; partir
	    de disquettes ou du CDROM, le processus de d&eacute;marrage
	    vous am&egrave;nera au point suivant:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>

	  <para>Attendez dix secondes, ou appuyez sur
	  <keycap>Entr&eacute;e</keycap>.  Cela lancera le menu de
	  configuration du noyau.</para>
	</step>
      </procedure>

      </sect3>

    </sect2>

    <sect2 id="start-userconfig">
      <title>Configuration du noyau</title>

      <note><para>Sur les versions de FreeBSD&nbsp;5.X et suivantes la
	configuration du noyau &agrave; l'installation est tomb&eacute;e en
	d&eacute;su&eacute;tude en faveur de la nouvelle m&eacute;thode
	utilisant les &man.device.hints.5;.  Pour plus d'information
	sur les &man.device.hints.5; veuillez lire <xref
	linkend="device-hints"></para></note>

      <para>Le <firstterm>noyau</firstterm> est le coeur du syst&egrave;me
	d'exploitation. Il est responsable de nombreuses choses, y
	compris l'acc&egrave;s &agrave; tous les p&eacute;riph&eacute;riques
	que vous pouvez avoir sur votre syst&egrave;me, comme les disques durs,
	les cartes r&eacute;seaux, les cartes son, etc...
	Chaque &eacute;l&eacute;ment mat&eacute;riel support&eacute; par le
	noyau de FreeBSD a un pilote de p&eacute;riph&eacute;rique
	associ&eacute;.  Chaque pilote de p&eacute;riph&eacute;rique a un
	nom en deux ou trois lettres, comme
	<devicename>sa</devicename> pour le pilote d'acc&egrave;s
	s&eacute;quentiel SCSI, ou <devicename>sio</devicename> pour le
	pilote d'E/S s&eacute;rie
	(qui contr&ocirc;le les ports COMs).</para>

      <para>Quand le noyau d&eacute;marre, chaque pilote contr&ocirc;le
	le syst&egrave;me pour voir si le mat&eacute;riel qu'il supporte
	existe sur votre syst&egrave;me.  Si c'est la cas, alors le pilote
	configure le mat&eacute;riel
	et le rend disponible au reste du noyau.</para>

      <para>Ce contr&ocirc;le est souvent d&eacute;sign&eacute; sous le nom de
        <firstterm>device probing</firstterm>.  Malheureusement, il n'est pas
	toujours possible de faire cela d'une mani&egrave;re s&ucirc;re.
	Certains pilotes de p&eacute;riph&eacute;riques ne coexistent pas bien
	ensemble, et sonder un p&eacute;riph&eacute;rique peut parfois en
	laisser un autre dans un &eacute;tat incorrect.  C'est une limitation
	de base de l'architecture <acronym>PC</acronym>.</para>

      <para>Beaucoup de p&eacute;riph&eacute;riques anciens sont appel&eacute;s
	p&eacute;riph&eacute;riques ISA&mdash;&agrave; l'oppos&eacute; des
	p&eacute;riph&eacute;riques PCI.  La sp&eacute;cification ISA exige que
	chaque p&eacute;riph&eacute;rique ait des informations cod&eacute;es
	&ldquo;en dur&rdquo; sur le p&eacute;riph&eacute;rique,
	g&eacute;n&eacute;ralement le num&eacute;ro
	de la ligne de requ&ecirc;te d'interruption (IRQ) et l'adresse du port
	d'E/S que le pilote utilise.  Cette information est
	g&eacute;n&eacute;ralement configur&eacute;e en utilisant
	des <firstterm>cavaliers</firstterm> sur la
	carte, ou en utilisant un utilitaire DOS.</para>

      <para>C'&eacute;tait souvent une source de probl&egrave;mes, parce
	qu'il n'&eacute;tait pas possible que deux
	p&eacute;riph&eacute;riques partagent la m&ecirc;me IRQ ou
	adresse de port.</para>

      <para>Les nouveaux p&eacute;riph&eacute;riques suivent la
	sp&eacute;cification PCI, qui ne requiert pas cela, car les
	p&eacute;riph&eacute;riques sont cens&eacute;s
	coop&eacute;rer avec le BIOS, et se voir pr&eacute;ciser quel IRQ
	et port d'E/S &agrave; employer.</para>

      <para>Si vous avez des p&eacute;riph&eacute;riques ISA dans votre
	ordinateur alors le pilote FreeBSD pour ce p&eacute;riph&eacute;rique
	devra &ecirc;tre configur&eacute; avec l'IRQ et l'adresse de port
	de la carte.  C'est pourquoi l'&eacute;tablissement d'un inventaire
	de votre mat&eacute;riel (voir <xref
	linkend="install-inventory">) peut &ecirc;tre utile.</para>

      <para>Malheureusement, les valeurs par d&eacute;faut des IRQs et des ports
        m&eacute;moire utilis&eacute;s par certains pilotes entrent en conflit.
	C'est parce que certains p&eacute;riph&eacute;riques ISA sont
	livr&eacute;s avec des IRQs ou des ports m&eacute;moires incompatibles.
	Les valeurs par d&eacute;faut des pilotes de FreeBSD sont
	d&eacute;lib&eacute;r&eacute;ment fix&eacute;es de fa&ccedil;on
	&agrave; refl&eacute;ter
	les valeurs par d&eacute;faut des constructeurs, de sorte que le plus
	grand nombre de p&eacute;riph&eacute;riques fonctionne sans
	intervention.</para>

      <para>Ce n'est presque jamais un probl&egrave;me quand on utilise FreeBSD
	quotidiennement.  Votre ordinateur ne contiendra pas normalement
	deux p&eacute;riph&eacute;riques incompatibles, parce que l'un d'eux ne
	fonctionnerait pas (ind&eacute;pendamment du syst&egrave;me
	d'exploitation que vous utilisez).</para>

      <para>Cela devient un probl&egrave;me quand vous installez FreeBSD pour
	la premi&egrave;re fois parce que le noyau utilis&eacute; pour effectuer
	l'installation doit contenir autant de pilotes que possible, de
	sorte que de nombreuses configurations mat&eacute;rielles
	diff&eacute;rentes puissent &ecirc;tre support&eacute;es.
	Cela signifie que certains de ces
	pilotes peuvent avoir des configurations incompatibles.  Les
	p&eacute;riph&eacute;riques sont scrut&eacute;s dans un ordre strict,
	et si vous poss&eacute;dez un p&eacute;riph&eacute;rique qui est
	sond&eacute; plus tard dans le processus, mais entrant en conflit
	avec avec un pr&eacute;c&eacute;demment d&eacute;tect&eacute; alors
	votre mat&eacute;riel pourrait ne pas fonctionner ou &ecirc;tre
	d&eacute;tect&eacute; correctement quand vous installez FreeBSD.</para>

      <para>Pour cette raison, la premi&egrave;re chose que vous avez
	l'occasion de faire en installant FreeBSD est de consulter la
	liste des pilotes configur&eacute;s dans le noyau, et soit en
	d&eacute;sactiver certains, si vous ne poss&eacute;dez pas le
	p&eacute;riph&eacute;rique, soit
	confirmer (et modifier) la configuration du pilote si vous
	poss&eacute;dez le p&eacute;riph&eacute;rique mais que les valeurs
	par d&eacute;faut sont incorrectes.</para>

      <para>Cela semble probablement bien plus compliqu&eacute; que cela ne
	l'est en r&eacute;alit&eacute;.<para>

      <para>La <xref linkend="kernel-config"> pr&eacute;sente le premier menu de
	configuration du noyau.  Nous recommandons de choisir l'option
	<guimenuitem>Start kernel configuration in full-screen visual
	mode</guimenuitem> &eacute;tant donn&eacute; qu'elle pr&eacute;sente
	l'interface la plus simple pour le nouvel utilisateur.</para>

      <figure id="kernel-config">
	<title>Menu de configuration du noyau</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/userconfig" format="PNG">
	  </imageobject>

	  <textobject>
	    <screen>&txt.install.userconfig;</screen>
	  </textobject>
	</mediaobject>
      </figure>

      <para>L'&eacute;cran de configuration du noyau
	(<xref linkend="fig-userconfig">)
	est alors divis&eacute; en quatre parties:</para>

      <orderedlist>
	<listitem>
	  <para>Une liste d&eacute;roulante de tous les pilotes de
	    p&eacute;riph&eacute;riques qui sont actuellement actifs,
	    divis&eacute;e en
	    groupe comme <literal>Storage</literal>, et
	    <literal>Network</literal>.  Chaque pilote est affich&eacute;
	    avec une description, son nom en deux ou trois lettres, et
	    l'IRQ et le port m&eacute;moire utilis&eacute;s par ce pilote.
	    De plus, si un pilote actif est en conflit avec un autre pilote
	    actif alors le terme <literal>CONF</literal> est affich&eacute;
	    &agrave; c&ocirc;t&eacute; du
	    nom du pilote.  Cette partie donne &eacute;galement le nombre total
	    de pilotes en conflit qui sont actuellement activ&eacute;s.</para>
	</listitem>

	<listitem>
	  <para>Les pilotes qui ont &eacute;t&eacute; d&eacute;sactiv&eacute;s.
	    Ils restent dans le noyau, mais leurs p&eacute;riph&eacute;riques
	    correspondant ne seront pas sond&eacute;s quand le noyau sera
	    lanc&eacute;.  Ils sont divis&eacute;s en
	    groupes de la m&ecirc;me mani&egrave;re que la liste des pilotes
	    actifs.</para>
	</listitem>

	<listitem>
	  <para>Plus de d&eacute;tails sur le pilote actuellement
	    s&eacute;lectionn&eacute;,
	    dont son IRQ et son adresse de port m&eacute;moire.</para>
	</listitem>

	<listitem>
	  <para>Des informations sur les combinaisons de touches
	    valides &agrave; ce moment.</para>
	</listitem>
      </orderedlist>

      <figure id="fig-userconfig">
	<title>L'interface de configuration des pilotes de
	  p&eacute;riph&eacute;riques du noyau</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/userconfig2" format="PNG">
	  </imageobject>

	  <textobject>
	    <screen>&txt.install.userconfig2;</screen>
	  </textobject>
	</mediaobject>
      </figure>

      <para>Ne vous inqui&eacute;tez pas si des conflits sont list&eacute;s
	c'&eacute;tait pr&eacute;visible; tous
	les pilotes de p&eacute;riph&eacute;riques sont activ&eacute;s, et
	comme cela a d&eacute;j&agrave; &eacute;t&eacute; expliqu&eacute;,
	certains seront en conflit avec d'autres.</para>

      <para>Vous devez maintenant parcourir cette liste de pilotes et
	r&eacute;soudre les conflits.</para>

      <procedure>
	<title>R&eacute;soudre les conflits de pilotes de
	  p&eacute;riph&eacute;riques</title>

	<step>
	  <para>Appuyez sur <keycap>X</keycap>.  Cela d&eacute;roulera
	    compl&egrave;tement la liste de pilotes, vous permettant ainsi
	    de tous les visualiser.  Vous devrez utiliser les touches
	    fl&eacute;ch&eacute;es pour monter et descendre dans la liste
	    des pilotes actifs.</para>

	  <para>La <xref linkend="hardware-conflicts"> montre le
	    r&eacute;sultat de l'appui sur <keycap>X</keycap>.</para>

	  <figure id="hardware-conflicts">
	    <title>Liste compl&egrave;te des pilotes actifs</title>

	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/hdwrconf" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>
	</step>

	<step>
	  <para>D&eacute;sactivez tous les pilotes de
	    p&eacute;riph&eacute;riques que vous ne poss&eacute;dez pas.
	    Pour d&eacute;sactiver un pilote, s&eacute;lectionnez-le &agrave;
	    l'aide des touches fl&eacute;ch&eacute;es et appuyez sur
	    <keycap>Del</keycap>.  Le pilote sera transf&eacute;r&eacute; dans la
	    liste des pilotes inactifs (<literal>Inactive
	    Drivers</literal>).</para>

	  <para>Si vous d&eacute;sactivez par m&eacute;garde un
	    p&eacute;riph&eacute;rique dont vous avez
	    besoin alors appuyez sur <keycap>Tab</keycap> pour passez &agrave;
	    la liste <literal>Inactive Drivers</literal>, s&eacute;lectionnez
	    le pilote que vous avez d&eacute;sactiv&eacute;, et appuyez sur
	    <keycap>Entr&eacute;e</keycap> pour le ramener dans la liste des
	    pilotes actifs.</para>

	  <warning>
	    <para>Ne pas d&eacute;sactiver <devicename>sc0</devicename>.  Ce
	      dernier contr&ocirc;le l'&eacute;cran, et vous en aurez besoin
	      &agrave; moins
	      que vous n'installiez pas l'interm&eacute;diaire d'un c&acirc;ble
	      s&eacute;rie.</para>
	  </warning>

	  <warning>
	    <para>Ne d&eacute;sactiver <devicename>atkbd0</devicename> que si
	      vous utilisez un clavier USB.  Si vous avez un clavier
	      standard alors vous devez conserver
	      <devicename>atkbd0</devicename>.</para>
	  </warning>
	</step>

	<step>
	  <para>S'il n'y a aucun conflit d'affich&eacute; alors vous pouvez
	    passer cette &eacute;tape.  Sinon, les conflits restant doivent
	    &ecirc;tre examin&eacute;s.  S'ils n'ont pas l'indication de
	    conflits autoris&eacute;s (&ldquo;allowed conflict&rdquo;) dans
	    la zone de message, alors soit l'IRQ/adresse de d&eacute;tection
	    du p&eacute;riph&eacute;rique devra &ecirc;tre modifi&eacute;e,
	    <emphasis>soit</emphasis> l'IRQ/adresse
	    sur le mat&eacute;riel devra &ecirc;tre modifi&eacute;e.</para>

	  <para>Pour modifier la configuration du pilote pour l'IRQ ou
	    l'adresse du port d'E/S, s&eacute;lectionnez le
	    p&eacute;riph&eacute;rique et
	    appuyez sur <keycap>Entr&eacute;e</keycap>.  Le curseur
	    passera &agrave; la troisi&egrave;me partie de l'&eacute;cran,
	    et vous pourrez changer les
	    valeurs.  Vous devriez entrer les valeurs d'IRQ et d'adresse
	    de port que vous avez trouv&eacute;es lors de l'inventaire de votre
	    mat&eacute;riel.  Appuyez sur <keycap>Q</keycap> pour terminer
	    l'&eacute;dition de la configuration du p&eacute;riph&eacute;rique
	    et retourner dans la liste des pilotes actifs.</para>

	  <para>Si vous n'&ecirc;tes pas s&ucirc;r de ce que devraient
	    &ecirc;tre ces valeurs, vous pouvez essayez d'utiliser
	    <literal>-1</literal>.  Certains pilotes FreeBSD peuvent sans
	    risques sonder le mat&eacute;riel pour d&eacute;terminer les valeurs
	    correctes, et la valeur <literal>-1</literal> les configure
	    &agrave; faire cela.</para>

	  <para>La proc&eacute;dure pour changer les adresses sur le
	    mat&eacute;riel varie d'un p&eacute;riph&eacute;rique &agrave;
	    l'autre.  Pour certains
	    p&eacute;riph&eacute;riques vous devrez retirer la carte de votre
	    ordinateur et ajuster les cavaliers ou les commutateurs DIP.
	    D'autres cartes peuvent &ecirc;tre fournies avec une disquette DOS
	    qui contient les programmes utilis&eacute;s pour reconfigurer la
	    carte.  Dans tous les cas, vous devriez consulter la
	    documentation fournie avec le p&eacute;riph&eacute;rique.  Cela
	    n&eacute;cessitera &eacute;videmment de remettre en marche votre
	    ordinateur, et vous devrez relancer la routine
	    d'installation de FreeBSD quand vous aurez reconfigur&eacute; la
	    carte.</para>
	</step>

	<step>
	  <para>Quand tous les conflits seront r&eacute;solus, l'&eacute;cran
	    devrait ressembler &agrave; la
	    <xref linkend="userconfig-done">.</para>

	  <figure id="userconfig-done">
	    <title>Configuration des pilotes de p&eacute;riph&eacute;riques
	      sans conflits</title>

	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/probstart" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>

	  <para>Comme vous pouvez le voir la liste des pilotes est plus
	    petite, avec uniquement les pilotes pour le mat&eacute;riel
	    existant list&eacute;s.</para>

	  <para>Vous pouvez maintenant sauver ces changements, et passer
	    &agrave; l'&eacute;tape suivante de l'installation.  Appuyez sur
	    <keycap>Q</keycap> pour quitter l'interface de configuration
	    des p&eacute;riph&eacute;riques.  Ce message
	    appara&icirc;tra.</para>

	  <screen>Save these parameters before exiting? ([Y]es/[N]o/[C]ancel)</screen>

	  <para>R&eacute;pondez <keycap>Y</keycap> pour sauver les
	    param&egrave;tres en m&eacute;moire (ils seront sauvegard&eacute;s sur le disque si vous terminez l'installation) et la d&eacute;tection du mat&eacute;riel
	    commencera.  Apr&egrave;s l'affichage des r&eacute;sultats de
	    la d&eacute;tection en texte blanc sur fond noir,
	    <application>sysinstall</application> d&eacute;marrera et affichera
	    son menu principal (<xref linkend="sysinstall-main">).</para>

	  <figure id="sysinstall-main">
	    <title>Menu principal de sysinstall</title>

	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/main1" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>
	</step>
      </procedure>
    </sect2>

    <sect2 id="view-probe">
      <title>Examen des r&eacute;sultats de la d&eacute;tection du
	mat&eacute;riel</title>

      <para>La derni&egrave;re centaine de lignes qui a &eacute;t&eacute;
	affich&eacute;e &agrave; l'&eacute;cran
        est stock&eacute;e et peut &ecirc;tre relue.</para>

      <para>Pour relire le tampon, appuyez sur
	<keycap>Arr&ecirc;t D&eacute;fil</keycap>.
	Cela activera le d&eacute;filement de l'affichage.  Vous pouvez alors
	utiliser les touches fl&eacute;ch&eacute;es, ou
	<keycap>PageUp</keycap> et
	<keycap>PageDown</keycap> pour visualiser les r&eacute;sultats.
	Appuyer &agrave; nouveau sur <keycap>Arr&ecirc;t D&eacute;fil</keycap>
	pour revenir dans le mode normal.</para>

      <para>Faites cela maintenant, pour relire le texte qui a
	d&eacute;fil&eacute; en dehors de l'&eacute;cran quand le noyau
	effectuait la d&eacute;tection du mat&eacute;riel.  Vous verrez
	quelque chose de semblable &agrave; la <xref
	linkend="install-dev-probe">, bien que le texte sera diff&eacute;rent
	en fonction des p&eacute;riph&eacute;riques que vous avez dans votre
	ordinateur.</para>

      <figure id="install-dev-probe">
	<title>R&eacute;sultats typiques de la d&eacute;tection du
	  mat&eacute;riel</title>

        <screen>avail memory = 253050880 (247120K bytes)
Preloaded elf kernel "kernel" at 0xc0817000.
Preloaded mfs_root "/mfsroot" at 0xc0817084.
md0: Preloaded image &lt;/mfsroot&gt; 4423680 bytes at 0xc03ddcd4

md1: Malloc disk
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard
npx0: INT 16 interface
pcib0: &lt;Host to PCI bridge&gt; on motherboard
pci0: &lt;PCI bus&gt; on pcib0
pcib1:&lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0
pci1: &lt;PCI bus&gt; on pcib1
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0
isa0: &lt;iSA bus&gt; on isab0
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0
ata0: at 0x1f0 irq 14 on atapci0
ata1: at 0x170 irq 15 on atapci0
uhci0: &lt;VIA 83C572 USB controller> port 0xe400-0xe41f irq 10 at device 7.2 on pci0
usb0: &lt;VIA 83C572 USB controller> on uhci0
usb0: USB revision 1.0
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr 1
uhub0: 2 ports with 2 removable, self powered
pci0: &lt;unknown card&gt; (vendor=0x1106, dev=0x3040) at 7.3
dc0: &lt;ADMtek AN985 10/100BaseTX&gt; port 0xe800-0xe8ff mem 0xdb000000-0xeb0003ff ir
q 11 at device 8.0 on pci0
dc0: Ethernet address: 00:04:5a:74:6b:b5
miibus0: &lt;MII bus&gt; on dc0
ukphy0: &lt;Generic IEEE 802.3u media interface&gt; on miibus0
ukphy0: 10baseT, 10baseT-FDX, 100baseTX, 100baseTX-FDX, auto
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xec00-0xec1f irq 9 at device 10.
0 on pci0
ed0 address 52:54:05:de:73:1b, type NE2000 (16 bit)
isa0: too many dependant configs (8)
isa0: unexpected small tag 14
orm0; &lt;Option ROM&gt; at iomem 0xc0000-0xc7fff on isa0
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq6 drq2 on isa0
fdc0: FIFO enabled, 8 bytes threshold
fd0: &lt;1440-KB 3.5" drive&gt; on fdc0 drive 0
atkbdc0: &lt;keyboard controller (i8042)&gt; at port 0x60-0x64 on isa0
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq 1 on atkbdc0
kbd0 at atkbd0
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0
psm0: model Generic PS/2 mouse, device ID 0
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0c3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x100 on isa0
sc0: VGA &lt;16 virtual consoles, flags-0x300&gt;
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0
sio0: type 16550A
sio1: at port 0x2f8-0x2ff irq3 on isa0
sio1: type 16550A
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0
ppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode
ppc0: FIFO with 16/16/15 bytes threshold
plip0: &lt;PLIP network interface&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451> [16383/16/63] at ata0-master using UDMA33
acd0: CD-RW &lt;LITE-ON LTR-1210B&gt; at ata1-slave PIO4
Mounting root from ufs:/dev/md0c
/stand/sysinstall running as init on vty0</screen>
      </figure>

      <para>V&eacute;rifiez les r&eacute;sultats de la d&eacute;tection
	soigneusement pour s'assurer que FreeBSD a trouv&eacute; tous les
	p&eacute;riph&eacute;riques que vous
	attendiez.  Si un p&eacute;riph&eacute;rique n'a pas &eacute;t&eacute;
	trouv&eacute;, il ne sera alors pas affich&eacute;.
	Si le pilote de p&eacute;riph&eacute;rique exigeait une
	configuration d'IRQ et d'adresse de port alors vous devriez
	v&eacute;rifier que vous les avez entr&eacute;es correctement.</para>

      <para>Si vous devez effectuer des changements &agrave; la configuration de
	la d&eacute;tection du mat&eacute;riel, il est facile de quitter
	le programme <application>sysinstall</application> et recommencer
	&agrave; nouveau.  C'est
	une bonne mani&egrave;re de se familiariser un peu plus avec le
	processus.</para>

      <figure id="sysinstall-exit">
	<title>Quitter sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/sysinstall-exit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilisez les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guimenuitem>Exit Install</guimenuitem> dans le menu principal
	d'installation.  Le message suivant appara&icirc;tra:</para>


      <screen>                      User Confirmation Requested
         Are you sure you wish to exit? The system will reboot
           (be sure to remove any floppies from the drives).

                            [ Yes ]    No</screen>

      <para>Le programme d'installation red&eacute;marrera &agrave; nouveau si le
	CDROM est rest&eacute; dans le lecteur et que
	<guibutton>[Yes]</guibutton> est s&eacute;lectionn&eacute;.</para>

      <para>Si vous d&eacute;marrez &agrave; partir de disquettes, il sera
	n&eacute;cessaire
	de retirer la disquette <filename>mfsroot.flp</filename> et la
	remplacer par <filename>kern.flp</filename> avant de
	red&eacute;marrer.</para>
    </sect2>
  </sect1>

  <sect1 id="using-sysinstall">
    <title>Pr&eacute;sentation de sysinstall</title>

    <para>L'utilitaire <application>sysinstall</application> est l'application
      d'installation fournie par le projet FreeBSD.  C'est une
      application pour la console et qui est divis&eacute;e en un certain nombre
      de menus et d'&eacute;crans que vous pouvez utiliser pour configurer et
      contr&ocirc;ler le processus d'installation.</para>

    <para>Le syst&egrave;me de menu de <application>sysinstall</application>
      est contr&ocirc;l&eacute; &agrave; l'aide des touches
      fl&eacute;ch&eacute;es, <keycap>Entr&eacute;e</keycap>,
      <keycap>Espace</keycap> et d'autres touches.  Une description
      d&eacute;taill&eacute;e de ces touches, et de ce qu'elles font,
      se trouve dans les informations d'utilisation de
      <application>sysinstall</application>.</para>

    <para>Pour voir ces informations, assurez-vous que l'entr&eacute;e
      <guimenuitem>Usage</guimenuitem> est surlign&eacute;e et que le bouton
      <guibutton>[Select]</guibutton> est s&eacute;lectionn&eacute;, comme
      montr&eacute; dans
      la <xref linkend="sysinstall-main3">, ensuite appuyez sur
      <keycap>Entr&eacute;e</keycap>.</para>

    <para>Les instructions sur l'utilisation du syst&egrave;me de menu seront
      affich&eacute;es. Apr&egrave;s les avoir lues, appuyez sur
      <keycap>Entr&eacute;e</keycap> pour revenir au menu principal.</para>

    <figure id="sysinstall-main3">
      <title>S&eacute;lection de l'entr&eacute;e Usage dans le menu
	principal de sysinstall</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/main1" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <sect2 id="select-doc">
      <title>S&eacute;lectionner le menu de documentation</title>

      <para>Depuis le menu principal, s&eacute;lectionnez
	<guimenuitem>Doc</guimenuitem> avec les touches fl&eacute;ch&eacute;es
	  et appuyez sur <keycap>Entr&eacute;e</keycap>.</para>

      <figure id="main-doc">
	<title>S&eacute;lectionner le menu de documentation</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-doc" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Cela affichera le menu de documentation.</para>

      <figure id="docmenu1">
	<title>Menu de documentation de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/docmenu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Il est important de lire la documentation fournie.</para>

      <para>Pour voir un document, s&eacute;lectionnez-le avec les touches
	fl&eacute;ch&eacute;es et appuyez sur <keycap>Entr&eacute;e</keycap>.
	Quand vous
	avez termin&eacute; la lecture d'un document, l'appui sur
	<keycap>Entr&eacute;e</keycap> vous ram&egrave;nera au menu de
	documentation.</para>

      <para>Pour revenir au menu principal d'installation, s&eacute;lectionnez
	<guimenuitem>Exit</guimenuitem> avec les touches fl&eacute;ch&eacute;es
	et appuyez sur <keycap>Entr&eacute;e</keycap>.</para>
    </sect2>

    <sect2 id="keymap">
      <title>S&eacute;lectionner le menu des tables de clavier</title>

      <para>Pour changer le type de clavier, utilisez les touches
	fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guimenuitem>Keymap</guimenuitem>
	depuis le menu et appuyez sur <keycap>Entr&eacute;e</keycap>.
	Ceci est n&eacute;cessaire seulement si vous utilisez un
	clavier non-standard ou non-am&eacute;ricain.</para>

      <figure id="sysinstall-keymap">
	<title>Menu principal de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Une table de clavier diff&eacute;rente peut &ecirc;tre choisie en
	s&eacute;lectionnant l'&eacute;l&eacute;ment du menu en utilisant
	les touches fl&eacute;ch&eacute;es et en appuyant sur
	<keycap>Espace</keycap>. Appuyer &agrave; nouveau sur
	<keycap>Espace</keycap> d&eacute;s&eacute;lectionnera
	l'&eacute;l&eacute;ment.
	Une fois termin&eacute;, choisissez &gui.ok; en utilisant les touches
	fl&eacute;ch&eacute;es et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <para>Seule une liste partielle est montr&eacute;e dans cet exemple.
	Utiliser &gui.cancel; en appuyant sur <keycap>Tab</keycap> s&eacute;lectionnera la table de clavier par
	d&eacute;faut et ram&egrave;nera au menu principal
	d'installation.</para>

      <figure id="sysinstall-keymap-menu">
	<title>Menu des tables de clavier de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

    </sect2>

    <sect2 id="viewsetoptions">
      <title>Ecran des options d'installation</title>

    <para>S&eacute;lectionner <guimenuitem>Options</guimenuitem> et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

    <figure id="sysinstall-options">
      <title>Menu principal de sysinstall</title>

      <mediaobject>
        <imageobject>
	  <imagedata fileref="install/main-options" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

      <figure id="options">
	<title>Options de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/options" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Les valeurs par d&eacute;faut sont g&eacute;n&eacute;ralement
	parfaites pour la
	plupart des utilisateurs et ne n&eacute;cessitent pas d'&ecirc;tre
	modifi&eacute;es.  Le nom de la version variera en fonction de
	la version que l'on installe.</para>

      <para>La description de l'&eacute;l&eacute;ment
	s&eacute;lectionn&eacute; appara&icirc;tra en bas de
	l'&eacute;cran surlign&eacute;e en bleu.  Notez qu'une des options est
	<guimenuitem>Use Defaults</guimenuitem> pour r&eacute;initialiser
	toutes les options &agrave; leur valeur de d&eacute;part.</para>

      <para>Appuyez sur <keycap>F1</keycap> pour lire l'&eacute;cran d'aide
	&agrave; propos des diverses options.</para>

      <para>L'appui sur <keycap>Q</keycap> ram&egrave;nera au menu principal
	d'installation.</para>
    </sect2>

    <sect2 id="start-install">
      <title>Commencer une installation standard</title>

      <para>L'installation <guimenuitem>Standard</guimenuitem> est
	l'option recommand&eacute;e pour ceux qui sont nouveaux &agrave;
	&unix; ou FreeBSD.
	Utilisez les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guimenuitem>Standard</guimenuitem> et ensuite appuyez sur
	<keycap>Entr&eacute;e</keycap> pour d&eacute;buter
	l'installation.</para>

      <figure id="sysinstall-standard">
	<title>Commencer une installation standard</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-std" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-steps">
    <title>Allouer l'espace disque</title>

    <para>Votre premi&egrave;re t&acirc;che est d'allouer de l'espace disque
      &agrave; FreeBSD, et lab&eacute;liser cet espace de sorte que
      <application>sysinstall</application> puisse le pr&eacute;parer.  Afin de
      faire cela vous devez savoir comment FreeBSD s'attend &agrave; trouver
      l'information sur le disque.</para>

    <sect2 id="install-drive-bios-numbering">
      <title>La num&eacute;rotation des disques par le BIOS</title>

      <para>Avant que vous installiez et configuriez FreeBSD sur votre
	syst&egrave;me, il y a un sujet important dont vous devriez &ecirc;tre
	conscient, particuli&egrave;rement si vous avez plusieurs disques
	durs.</para>

      <indexterm><primary>DOS</primary></indexterm>
      <indexterm><primary>Microsoft Windows</primary></indexterm>
      <para>Dans un PC utilisant un syst&egrave;me d'exploitation
	d&eacute;pendant du
	BIOS comme &ms-dos; ou &microsoft.windows;, le BIOS est capable de
	modifier l'ordre normal des disques, et le syst&egrave;me
	d'exploitation suivra le changement.  Ceci permet &agrave;
	l'utilisateur de d&eacute;marrer depuis un disque autre que le
	pr&eacute;tendu &ldquo;premier disque ma&icirc;tre&rdquo;.  C'est
	particuli&egrave;rement commode pour les utilisateurs qui ont
	trouv&eacute;
	que la mani&egrave;re la plus simple et la moins on&eacute;reuse de
	sauvegarder un syst&egrave;me est d'acheter un second disque dur
	identique, et d'ex&eacute;cuter des copies r&eacute;guli&egrave;res
	du premier disque
	vers le second en utilisant <application><trademark class="registered">Ghost</trademark></application> ou
	<application>XCOPY</application>.  Alors, si le premier disque
	tombe en panne, ou est attaqu&eacute; par un virus, ou corrompu par un
	d&eacute;faut du syst&egrave;me d'exploitation, on peut facilement
	y faire
	face en demandant au BIOS de permuter logiquement les disques.
	C'est comme si l'on &eacute;changeait les c&acirc;bles sur les disques,
	mais sans avoir &agrave; ouvrir le bo&icirc;tier.</para>

      <indexterm><primary>SCSI</primary></indexterm>
      <indexterm><primary>BIOS</primary></indexterm>
      <para>Des syst&egrave;mes plus on&eacute;reux avec des contr&ocirc;leurs
	SCSI incluent
	souvent des extensions de BIOS permettant aux disques SCSI
	d'&ecirc;tre r&eacute;organis&eacute;s dans un mode semblable et cela
	jusqu'&agrave; sept disques.</para>

      <para>Un utilisateur qui est accoutum&eacute; &agrave; tirer profit de ces
	caract&eacute;ristiques pourra s'&eacute;tonner quant aux
	r&eacute;sultats inattendus
	obtenus sous FreeBSD.  FreeBSD n'utilise pas le BIOS, et ne
	conna&icirc;t pas &ldquo;la table logique des disques du BIOS&rdquo;.
	Cela peut mener &agrave; des situations relativement
	d&eacute;concertantes,
	particuli&egrave;rement quand les disques sont physiquement identiques,
	et que ce sont &eacute;galement des clones au niveau des
	donn&eacute;es.</para>

      <para>Quand vous utilisez FreeBSD, veillez &agrave; r&eacute;tablir la
	num&eacute;rotation naturelle des disques dans le BIOS, et
	laissez-l&agrave; telle quelle.  Si vous devez inverser les
	disques, alors faites-le mais au niveau mat&eacute;riel en ouvrant
	votre bo&icirc;tier et en
	d&eacute;pla&ccedil;ant les cavaliers et les c&acirc;bles.</para>

      <sidebar>
	<title>Une illustration d'apr&egrave;s les extraordinaires aventures
	  des fichiers de Bill et Fred:</title>

	<para>Bill transforme une vieille machine Wintel en une nouvelle
	  machine FreeBSD pour Fred.  Bill installe un disque SCSI comme
	  unit&eacute; de disque SCSI z&eacute;ro et install
	  FreeBSD dessus.</para>

	<para>Fred commence &agrave; utiliser le syst&egrave;me, mais
	  apr&egrave;s plusieurs
	  jours remarque que le vieux disque SCSI signale de nombreuses
	  erreurs logiciels et en fait part &agrave; Bill.</para>

	<para>Quelques jours apr&egrave;s, Bill d&eacute;cide qu'il est
	  temps de s'occuper de ce probl&egrave;me, il va donc chercher un
	  disque SCSI identique dans la &ldquo;r&eacute;serve &agrave;
	  disques&rdquo;.  Un contr&ocirc;le de la surface indique que le
	  disque fonctionne correctement, aussi Bill installe ce disque comme
	  unit&eacute; SCSI num&eacute;ro quatre et effectue une copie
	  &agrave; l'identique du disque z&eacute;ro sur le
	  disque quatre.  Maintenant que le nouveau disque est install&eacute;
	  et fonctionne parfaitement, Bill d&eacute;cide que ce serait une
	  bonne id&eacute;e de commencer &agrave; l'utiliser, aussi
	  utilise-t-il une fonction dans le BIOS SCSI pour r&eacute;ordonner
	  les disques durs pour faire d&eacute;marrer le syst&egrave;me
	  &agrave; partir de l'unit&eacute; SCSI
	  quatre.  FreeBSD d&eacute;marre et fonctionne correctement.</para>

	<para>Fred continue son travail pendant quelques jours, et
	  bient&ocirc;t Bill et Fred d&eacute;cident qu'il est temps pour une
	  nouvelle aventure -- temps pour mettre &agrave; jour vers une version
	  plus r&eacute;cente de FreeBSD.  Bill retire le disque SCSI
	  z&eacute;ro parce qu'il &eacute;tait un peu capricieux et le
	  remplace par un autre identique provenant de la
	  &ldquo;r&eacute;serve &agrave; disques&rdquo;.
	  Bill installe alors la nouvelle version de FreeBSD sur le
	  nouveau disque SCSI en utilisant les magiques disquettes
	  d'installation par FTP de Fred.  L'installation se passe
	  bien.</para>

	<para>Fred utilise la nouvelle version de FreeBSD pendant
	  quelques jours, et certifie qu'elle est suffisamment stable pour
	  &ecirc;tre utilis&eacute;e dans le d&eacute;partement
	  d'ing&eacute;nierie.  Il est temps
	  de transf&eacute;rer tout son travail depuis l'ancienne version.
	  Alors Fred monte l'unit&eacute; SCSI quatre (la derni&egrave;re
	  copie de l'ancienne version de FreeBSD).  Fred est accabl&eacute;
	  de constater que rien de son pr&eacute;cieux travail n'est
	  pr&eacute;sent sur l'unit&eacute; SCSI quatre.</para>

	<para>Ou sont pass&eacute;es les donn&eacute;es?</para>

	<para>Quand Bill &agrave; fait une copie parfaite du disque
	  SCSI z&eacute;ro originel sur l'unit&eacute; SCSI quatre,
	  l'unit&eacute; quatre est devenue le &ldquo;nouveau clone&rdquo;.
	  Quand Bill a r&eacute;ordonn&eacute; le
	  BIOS SCSI pour qu'il puisse d&eacute;marrer sur l'unit&eacute;
	  SCSI quatre, il &eacute;tait juste en train de se tromper.
	  FreeBSD tournait toujours sur l'unit&eacute; SCSI z&eacute;ro.
	  Faire de tels changements dans le BIOS fera qu'une partie ou tout
	  le code de d&eacute;marrage et de chargement sera
	  lue sur le disque s&eacute;lectionn&eacute; par le
	  BIOS, mais quand les pilotes du noyau de FreeBSD prendrons le
	  contr&ocirc;le, la num&eacute;rotation des disques par le BIOS sera
	  ignor&eacute;e, et FreeBSD reprendra la num&eacute;rotation
	  normale des disques.
	  Dans l'illustration actuelle, le syst&egrave;me a continu&eacute;
	  d'op&eacute;rer sur l'unit&eacute; SCSI z&eacute;ro d'origine,
	  et toutes les donn&eacute;es de Fred se trouvaient l&agrave;
	  et non pas sur l'unit&eacute; SCSI
	  quatre.  Le fait que le syst&egrave;me semblait fonctionner sur
	  l'unit&eacute; quatre n'&eacute;tait juste qu'une impression due aux
	  attentes de nos utilisateurs.</para>

	<para>Nous sommes heureux d'annoncer qu'aucun octet n'a
	  &eacute;t&eacute; d&eacute;truit ou endommag&eacute;
	  durant la d&eacute;couverte de ce ph&eacute;nom&egrave;ne.
	  L'ancienne unit&eacute; SCSI z&eacute;ro a &eacute;t&eacute;
	  r&eacute;cup&eacute;r&eacute;e sur une pile de
	  disques au rebut, et tout le travail de Fred lui a
	  &eacute;t&eacute; rendu
	  (et Bill sait d&eacute;sormais qu'il peut compter jusqu'&agrave;
	  z&eacute;ro).</para>

	<para>Bien que cela soit des disques SCSI qui furent utilis&eacute;s
	  dans cet exemple, le concept s'applique de la m&ecirc;me
	  mani&egrave;re aux disques IDE.</para>
      </sidebar>
    </sect2>

    <sect2 id="main-fdisk">
      <title>Cr&eacute;ation des tranches - &ldquo;slices&rdquo; en utilisant
	FDisk</title>

      <note>
	<para>Aucun changement que vous faites &agrave; ce niveau de
	  l'installation ne sera &eacute;crit sur le disque.  Si vous pensez
	  que vous avez fait une erreur et que vous voulez recommencer,
	  vous pouvez utiliser les menus pour quitter
	  <application>sysinstall</application> et essayer encore ou
	  appuyez sur <keycap>U</keycap> pour utiliser l'option
	  <guimenuitem>Undo</guimenuitem>.  Si
	  vous &ecirc;tes perdu et ne voyez pas comment quitter, vous pouvez
	  toujours &eacute;teindre votre ordinateur.</para>
      </note>

      <para>Apr&egrave;s avoir choisi de commencer une installation standard
      <application>sysinstall</application> affichera ce message:</para>

      <screen>                                 Message
 In the next menu, you will need to set up a DOS-style ("fdisk")
 partitioning scheme for your hard disk. If you simply wish to devote
 all disk space to FreeBSD (overwriting anything else that might be on
 the disk(s) selected) then use the (A)ll command to select the default
 partitioning scheme followed by a (Q)uit. If you wish to allocate only
 free space to FreeBSD, move to a partition marked "unused" and use the
 (C)reate command.
                                [  OK  ]

                      [ Press enter or space ]</screen>

      <para>Appuyez sur <keycap>Entr&eacute;e</keycap> comme demand&eacute;.
	On vous affichera alors une liste de tous les disques durs que le noyau
	a trouv&eacute;s durant la d&eacute;tection des
	p&eacute;riph&eacute;riques.  La <xref
	linkend="sysinstall-fdisk-drive1"> pr&eacute;sente l'exemple d'un
	syst&egrave;me avec deux disques IDE.  Ils ont &eacute;t&eacute;
	appel&eacute;s <devicename>ad0</devicename> et
	<devicename>ad2</devicename>.</para>

      <figure id="sysinstall-fdisk-drive1">
	<title>S&eacute;lection du disque pour FDisk</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Vous pourriez vous demander pourquoi
	<devicename>ad1</devicename> n'est pas list&eacute; ici.
	Pourquoi est-il manquant?</para>

      <para>Consid&eacute;rez ce qu'il se produirait si vous aviez deux disques
	durs IDE, un en tant que ma&icirc;tre sur le premier contr&ocirc;leur
	IDE, et un autre en tant que ma&icirc;tre sur le second
	contr&ocirc;leur IDE.  Si FreeBSD num&eacute;rotait ces derniers
	comme il les a trouv&eacute;s, en tant
	que <devicename>ad0</devicename> et <devicename>ad1</devicename>
	alors tout devrait fonctionner.</para>

      <para>Mais si vous ajoutiez un troisi&egrave;me disque, en tant que
	disque esclave sur le premier contr&ocirc;leur IDE, ce serait
	maintenant <devicename>ad1</devicename>, et
	l'<devicename>ad1</devicename> pr&eacute;c&eacute;dent deviendrait
	<devicename>ad2</devicename>.
	Puisque les noms de p&eacute;riph&eacute;riques
	(comme <devicename>ad1s1a</devicename>) sont utilis&eacute;s pour
	trouver les syst&egrave;mes de fichiers, vous pouvez soudainement
	d&eacute;couvrir que certains de vos syst&egrave;mes de fichiers
	n'apparaissent plus correctement, et vous devrez modifier votre
	configuration de FreeBSD.</para>

      <para>Pour s'affranchir de cela, le noyau peut &ecirc;tre
	configur&eacute; pour nommer les p&eacute;riph&eacute;riques IDE en
	fonction de l'endroit o&ugrave; ils
	sont plac&eacute;s, et non pas en fonction de l'ordre dans lequel ils
	ont &eacute;t&eacute; trouv&eacute;s.  Avec cet arrangement le
	disque ma&icirc;tre sur le
	second contr&ocirc;leur IDE sera <emphasis>toujours</emphasis>
	<devicename>ad2</devicename>, m&ecirc;me s'il n'y a aucun disque
	<devicename>ad0</devicename> ou
	<devicename>ad1</devicename>.</para>

      <para>Cette configuration est celle par d&eacute;faut du noyau de
	FreeBSD, c'est pourquoi notre exemple montre
	<devicename>ad0</devicename> et <devicename>ad2</devicename>.
	La machine sur laquelle furent prises les captures d'&eacute;cran avait
	des disques IDE sur les canaux ma&icirc;tres de chaque
	contr&ocirc;leur IDE, et aucun disque esclave.</para>

      <para>Vous devrez choisir le disque sur lequel vous d&eacute;sirez
	installer FreeBSD, et ensuite appuyer sur &gui.ok;.
	<application>FDisk</application> d&eacute;marrera, avec un &eacute;cran
	semblable &agrave; celui montr&eacute; sur la <xref
	linkend="sysinstall-fdisk1">.</para>

      <para>L'affichage de <application>FDisk</application> est
	s&eacute;par&eacute; en trois parties.</para>

      <para>La premi&egrave;re partie, occupant les deux premi&egrave;res
	lignes de l'&eacute;cran, montre les d&eacute;tails au sujet du
	disque actuellement s&eacute;lectionn&eacute;, dont son nom sous
	FreeBSD, sa g&eacute;om&eacute;trie, et la
	taille du disque.</para>

      <para>La deuxi&egrave;me partie montre les tranches qui sont actuellement
	pr&eacute;sentes sur le disque, o&ugrave; elles d&eacute;butent et
	se terminent, leur
	taille, le nom que leur donne FreeBSD, et leur description et
	sous-type.  Cette exemple montre deux petites tranches
	inutilis&eacute;es, qui sont les cons&eacute;quences de l'arrangement du
	disque sous PC.  Il montre &eacute;galement une grande tranche de type
	<acronym>FAT</acronym>, qui est presque certainement le lecteur
	<devicename>C:</devicename> sous &ms-dos; / &windows;, et une tranche
	&eacute;tendue, qui doit contenir d'autres lecteurs pour &ms-dos; /
	&windows;.</para>

      <para>La troisi&egrave;me partie affiche les commandes disponibles dans
	<application>FDisk</application>.</para>

      <figure id="sysinstall-fdisk1">
	<title>Partitions Fdisk typiques avant &eacute;dition</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Ce que vous allez faire maintenant d&eacute;pend de comment vous
	voulez diviser votre disque.</para>

      <para>Si vous voulez utiliser tout le disque pour FreeBSD (ce qui
	effacera toutes les autres donn&eacute;es sur votre disque quand vous
	confirmerez, plus tard dans le processus d'installation, que vous
	voulez que <application>sysinstall</application> continue) alors
	vous pouvez appuyer sur <keycap>A</keycap>, ce qui correspond &agrave;
	l'option <guimenuitem>Use Entire Disk</guimenuitem> (utiliser
	l'int&eacute;gralit&eacute; du disque).  Les tranches existantes seront
	supprim&eacute;es, et remplac&eacute;es par une petite zone
	&eacute;tiquet&eacute;e
	<literal>unused</literal> (encore une fois, une particularit&eacute; de
	l'organisation des disques sous PC), et ensuite une grande
	tranche pour FreeBSD.  Si vous faites cela vous devriez
	s&eacute;lectionner la tranche FreeBSD nouvellement
	cr&eacute;&eacute;e en utilisant
	les touches fl&eacute;ch&eacute;es, et appuyer sur
	<keycap>S</keycap> pour
	marquer la tranche comme pouvant &ecirc;tre d&eacute;marrable.
	L'&eacute;cran sera
	alors semblable &agrave; la <xref linkend="sysinstall-fdisk2">.  Notez
	le <literal>A</literal> dans la colonne
	<literal>Flags</literal>, qui indique que cette tranche est
	<emphasis>active</emphasis>, et sera d&eacute;marrable.</para>

      <para>Si vous supprimez une tranche existante pour faire de la
	place pour FreeBSD alors vous devriez s&eacute;lectionner la tranche en
	utilisant les touches fl&eacute;ch&eacute;es, et ensuite appuyer sur
	<keycap>D</keycap>.  Vous pouvez alors appuyer sur
	<keycap>C</keycap>, on vous demandera la taille de la tranche
	que vous d&eacute;sirez cr&eacute;er.  Entrez la taille requise et
	appuyez sur <keycap>Entr&eacute;e</keycap>.  La valeur par
	d&eacute;faut dans cette bo&icirc;te de dialogue
	repr&eacute;sente la tranche la plus grande possible que vous
	pouvez cr&eacute;er, qui peut &ecirc;tre le plus grand bloc
	d'espace contig&uuml;e non allou&eacute; ou la taille de
	l'int&eacute;gralit&eacute; du disque dur.</para>

      <para>Si vous avez d&eacute;j&agrave; fait de la place pour FreeBSD
	(peut-&ecirc;tre
	en utilisant un outil comme <application>&partitionmagic;</application>&reg;) alors vous pouvez appuyer sur
	<keycap>C</keycap> pour cr&eacute;er une nouvelle tranche.  Encore une
	fois, vous serez sollicit&eacute; pour entrer la taille de la tranche
	que vous d&eacute;sirez cr&eacute;er.</para>

      <figure id="sysinstall-fdisk2">
	<title>Partionnement Fdisk utilisant l'int&eacute;gralit&eacute; du
	  disque</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Une fois termin&eacute;, appuyez sur <keycap>Q</keycap>.  Vos
	modifications seront sauvegard&eacute;es dans
	<application>sysinstall</application>, mais ne seront pas
	encore inscrites sur le disque.</para>
    </sect2>

    <sect2 id="bootmgr">
      <title>Installer un gestionnaire de d&eacute;marrage</title>

      <para>Vous avez maintenant la possibilit&eacute; d'installer un
	gestionnaire de d&eacute;marrage.  En g&eacute;n&eacute;ral, vous
	devriez installer
	le gestionnaire de d&eacute;marrage de FreeBSD si:</para>

      <itemizedlist>
	<listitem>
	  <para>Vous avez plus d'un disque, et vous avez install&eacute;
	    FreeBSD sur un disque autre que le premier.</para>
	</listitem>

	<listitem>
	  <para>Vous avez install&eacute; FreeBSD &agrave; c&ocirc;t&eacute;
	    d'un autre syst&egrave;me
	    d'exploitation sur le m&ecirc;me disque, et vous voulez pouvoir
	    choisir de lancer soit FreeBSD soit l'autre syst&egrave;me
	    d'exploitation au d&eacute;marrage de votre ordinateur.</para>
	</listitem>
      </itemizedlist>

      <para>Si &os; sera le seul syst&egrave;me d'exploitation sur
	cette machine, install&eacute; sur le premier disque dur,
	alors le gestionnaire de d&eacute;marrage
	<guimenuitem>Standard</guimenuitem> suffira.
	S&eacute;lectionnez <guimenuitem>None</guimenuitem> si vous
	utilisez un gestionnaire de d&eacute;marrage tiers capable de
	d&eacute;marrer &os;.</para>

      <para>Faites votre choix, et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="sysinstall-bootmgr">
	<title>Menu du gestionnaire de d&eacute;marrage de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/boot-mgr" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>L'&eacute;cran d'aide, obtenu par l'appui sur <keycap>F1</keycap>,
	discute des probl&egrave;mes qui peuvent &ecirc;tre
	rencontr&eacute;s quand on
	essaye de partager un disque entre plusieurs syst&egrave;mes
	d'exploitation.</para>
    </sect2>

    <sect2>
      <title>Cr&eacute;ation de tranches - &ldquo;slices&rdquo; sur un
	autre disque</title>

      <para>S'il y a plus d'un disque, on reviendra &agrave; l'&eacute;cran de
	s&eacute;lection des disques apr&egrave;s la s&eacute;lection du
	gestionnaire de
	d&eacute;marrage.  Si vous souhaitez installer FreeBSD sur plus d'un
	disque, alors vous pouvez choisir un autre disque ici et
	r&eacute;p&eacute;ter le processus en utilisant
	<application>FDisk</application>.</para>

      <important>
	<para>Si vous installez &os; sur un disque diff&eacute;rent de
	  votre premier disque, alors le gestionnaire de d&eacute;marrage
	  de &os; doit &ecirc;tre install&eacute; sur les deux disques.</para>
      </important>

      <figure id="sysinstall-fdisk-drive2">
	<title>Quitter la s&eacute;lection de disque</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La touche <keycap>Tab</keycap> permet de basculer entre le
	dernier disque s&eacute;lectionn&eacute;, &gui.ok;, et
	&gui.cancel;.</para>

      <para>Appuyez sur <keycap>Tab</keycap> une fois pour basculer sur
	&gui.ok;, ensuite appuyez sur <keycap>Entr&eacute;e</keycap> pour
	continuer l'installation.</para>
    </sect2>

    <sect2 id="disklabeleditor">
      <title>Cr&eacute;er des partitions en utilisant
	<application>Disklabel</application></title>

      <para>Vous devez maintenant cr&eacute;er des partitions &agrave;
	l'int&eacute;rieur de
	chaque tranche que vous venez de cr&eacute;er.  Rappelez-vous que
	chaque partition est repr&eacute;sent&eacute;e par une lettre, depuis
	<literal>a</literal> jusqu'&agrave; <literal>h</literal>, et que les
	partitions <literal>b</literal>, <literal>c</literal>, et
	<literal>d</literal> ont par convention des significations
	particuli&egrave;res que vous devriez respecter.</para>

      <para>Certaines applications peuvent tirer avantage d'un
	partionnement particulier, tout sp&eacute;cialement si vous organisez
	vos partitions sur plus d'un disque.  Cependant, pour votre
	premi&egrave;re installation de FreeBSD, vous ne devriez ne pas trop
	attacher d'importance &agrave; la fa&ccedil;on dont vous divisez
	votre disque.
	Il est plus important que vous installiez FreeBSD et commenciez
	&agrave; apprendre &agrave; l'utiliser.  Vous pouvez toujours
	r&eacute;installer
	FreeBSD pour modifier votre partionnement quand vous serez plus
	familier avec le syst&egrave;me d'exploitation.</para>

      <para>Cette organisation pr&eacute;sente quatre partitions&mdash;une pour
	l'espace de pagination, et trois pour les syst&egrave;mes de
	fichiers.</para>

      <table frame="none" pgwide="1">
	<title>Partitionnement du premier disque</title>

	<tgroup cols="4">
	  <colspec colwidth="1*">
	  <colspec colwidth="1*">
	  <colspec colwidth="1*">
	  <colspec colwidth="4*">

	  <thead>
	    <row>
	      <entry>Partition</entry>

	      <entry>Syst&egrave;me de fichiers</entry>

	      <entry>Taille</entry>

	      <entry>Description</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>a</literal></entry>

	      <entry><filename>/</filename></entry>

	      <entry>100&nbsp;MO</entry>

	      <entry>C'est le syst&egrave;me de fichiers racine.  Tous les
		autres syst&egrave;mes de fichiers seront mont&eacute;s sous ce
		dernier.  100&nbsp;MO est une taille raisonnable pour ce
		syst&egrave;me de fichiers.  Vous ne devrez pas stocker trop de
		donn&eacute;es dessus, comme une installation habituelle de
		FreeBSD prendra environ 4O&nbsp;MO.  La place restante est pour les
		donn&eacute;es temporaires, et laisse &eacute;galement de
		l'espace si les futures version de FreeBSD n&eacute;cessitent
		plus de place dans <filename>/</filename></entry>
	    </row>

	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/A</entry>

	      <entry>2-3 x RAM</entry>

	      <entry><para>L'espace de pagination du syst&egrave;me
		  est plac&eacute;
		  sur cette partition.  Choisir la bonne quantit&eacute;
		  d'espace de pagination peut s'av&eacute;rer &ecirc;tre tout un
		  art.  Un bon principe est de prendre un espace de
		  pagination &eacute;gal &agrave; deux ou trois fois la
		  m&eacute;moire
		  physique disponible sur le syst&egrave;me (RAM).  Vous devrez
		  &eacute;galement avoir au moins 64&nbsp;MO d'espace de pagination,
		  donc si vous avez moins de 32&nbsp;MO de RAM dans votre
		  ordinateur fixez la taille de l'espace de pagination &agrave;
		  64&nbsp;MO.</para><para>

		  Si vous avez plus d'un disque alors vous pouvez
		  mettre de l'espace de pagination sur chaque disque.
		  FreeBSD utilisera alors chaque disque pour la
		  pagination, ce qui acc&eacute;l&eacute;rera le processus de
		  pagination.  Dans ce cas calculez la quantit&eacute; d'espace
		  dont vous avez besoin (e.g., 128&nbsp;MO), et divisez-la par
		  le nombre de disques que vous avez (e.g., deux disques)
		  pour obtenir la quantit&eacute; &agrave; mettre sur chaque
		  disque,
		  dans cet exemple, 64&nbsp;MO d'espace de pagination par
		  disque.</para></entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry><filename>/var</filename></entry>

	      <entry>50&nbsp;MO</entry>

	      <entry>Le r&eacute;pertoire <filename>/var</filename> contient
		des fichiers variant constamment; fichiers de traces, et
		autre fichiers d'administration.  Beaucoup de ces
		fichiers sont lus et &eacute;crits de fa&ccedil;on intensive
		durant le
		fonctionnement de FreeBSD.  Mettre ces fichiers sur un
		autre syst&egrave;me de fichiers permet &agrave; FreeBSD
		d'optimiser l'acc&egrave;s &agrave; ces fichiers sans affecter
		les autres fichiers d'autres r&eacute;pertoires n'ayant pas
		les m&ecirc;me conditions d'acc&egrave;s.</entry>
	    </row>

	    <row>
	      <entry><literal>f</literal></entry>

	      <entry><filename>/usr</filename></entry>

	      <entry>Le reste du disque</entry>

	      <entry>Tous vos autres fichiers seront normalement stock&eacute;s
		dans <filename>/usr</filename>, et ses
		sous-r&eacute;pertoires.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <para>Si vous installez FreeBSD sur plus d'un disque alors vous
	devez &eacute;galement cr&eacute;er des partitions sur les autres
	tranches que vous avez configur&eacute;es.
	La mani&egrave;re la plus simple est de cr&eacute;er
	deux partitions sur chaque disque, une pour l'espace de
	pagination, et une autre pour le syst&egrave;me de fichiers.</para>

      <table frame="none" pgwide="1">
	<title>Partitionnement pour les disques suivants</title>

	<tgroup cols="4">
	  <colspec colwidth="1*">
	  <colspec colwidth="1*">
	  <colspec colwidth="2*">
	  <colspec colwidth="3*">

	  <thead>
	    <row>
	      <entry>Partition</entry>

	      <entry>Syst&egrave;me de fichiers</entry>

	      <entry>Taille</entry>

	      <entry>Description</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/A</entry>

	      <entry>Voir description</entry>

	      <entry>Comme d&eacute;j&agrave; discut&eacute;,
		vous pouvez r&eacute;partir l'espace de
		pagination sur chaque disque.  M&ecirc;me si la partition
		<literal>a</literal> est libre, les conventions nous dictent
		que l'espace de pagination doit rester sur la partition
		<literal>b</literal>.</entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry>/disque<replaceable>n</replaceable></entry>

	      <entry>le reste du disque</entry>

	      <entry>Le reste du disque est utilis&eacute; en une seule grande
		partition.  Cela pourrait facilement &ecirc;tre la partition
		<literal>a</literal>, au lieu de la partition
		<literal>e</literal>.  Cependant, conventionnellement la
		partition <literal>a</literal> sur une tranche est
		r&eacute;serv&eacute;e au syst&egrave;me de fichiers racine
		(<filename>/</filename>).  Vous n'&ecirc;tes pas oblig&eacute;
		de suivre cette convention mais
		<application>sysinstall</application> le fait, et donc
		la suivre rendra l'installation plus claire.  Vous
		pouvez choisir de monter ce syst&egrave;me de fichiers
		n'importe o&ugrave;; cet exemple sugg&egrave;re que vous les
		montiez en tant que r&eacute;pertoires
		<filename>/disque<replaceable>n</replaceable></filename>,
		o&ugrave;
		<replaceable>n</replaceable> est un nombre qui change
		pour chaque disque.  Mais vous pouvez choisir une autre
		organisation si vous le pr&eacute;ferrez.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <para>Apr&egrave;s avoir choisi votre partitionnement vous pouvez
	maintenant le cr&eacute;er en utilisant
	<application>sysinstall</application>.
	Vous verrez ce message:</para>

      <screen>                                 Message
 Now, you need to create BSD partitions inside of the fdisk
 partition(s) just created. If you have a reasonable amount of disk
 space (200MB or more) and don't have any special requirements, simply
 use the (A)uto command to allocate space automatically. If you have
 more specific needs or just don't care for the layout chosen by
 (A)uto, press F1 for more information on manual layout.

                                [  OK  ]
                          [ Press enter or space ]</screen>

      <para>Appuyez sur <keycap>Entr&eacute;e</keycap> pour lancer
	l'&eacute;diteur de
	partition de FreeBSD, appel&eacute;
	<application>Disklabel</application>.</para>

      <para>La <xref linkend="sysinstall-label"> pr&eacute;sente l'affichage
	que l'on obtient quand on lance pour la premi&egrave;re fois
	<application>Disklabel</application>.  L'&eacute;cran est
	divis&eacute; en trois parties.</para>

      <para>Les premi&egrave;res lignes affichent le nom du disque sur lequel
	vous &ecirc;tes en train de travailler, et la tranche qui contient les
	partitions que vous &ecirc;tes en train de cr&eacute;er (&agrave; cet
	endroit <application>Disklabel</application> nomme cela
	<literal>Partition name</literal>, nom de partition, plut&ocirc;t que
	le nom slice).  Cet &eacute;cran montre &eacute;galement la
	quantit&eacute; d'espace libre dans la tranche; c'est &agrave;
	dire l'espace qui a &eacute;t&eacute;
	mis de c&ocirc;t&eacute; dans la tranche, et qui n'a pas
	&eacute;t&eacute; encore attribu&eacute;
	&agrave; une partition.</para>

      <para>Le centre de l'&eacute;cran pr&eacute;sente les partitions qui
	ont &eacute;t&eacute; cr&eacute;&eacute;es, le nom du syst&egrave;me
	de fichiers que chaque partition
	contient, leur taille, et des options concernant la cr&eacute;ation du
	syst&egrave;me de fichiers.</para>

      <para>Le bas de l'&eacute;cran donne les combinaisons de touches valides
	dans <application>Disklabel</application>.</para>

      <figure id="sysinstall-label">
	<title>L'&eacute;diteur Disklabel de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para><application>Disklabel</application> peut automatiquement
	cr&eacute;er des partitions pour vous et leur assigner des tailles par
	d&eacute;faut.  Essayez cela maintenant, en appuyant sur
	<keycap>A</keycap>.  Vous verrez un affichage semblable &agrave; celui
	donn&eacute; par la <xref linkend="sysinstall-label2">.  En fonction de
	la taille de votre disque, les valeurs par d&eacute;faut peuvent
	&ecirc;tre ou non appropri&eacute;es.
	Cela n'a pas d'importance, car vous n'&ecirc;tes
	pas oblig&eacute; d'accepter ces valeurs.</para>

	<note>
	  <para>Depuis FreeBSD&nbsp;4.5, le partionnement par d&eacute;faut assigne
	    au r&eacute;pertoire <filename>/tmp</filename> sa propre partition
	    plut&ocirc;t que d'appartenir &agrave; la partition
	    <filename>/</filename>.  Cela permet d'&eacute;viter de remplir la
	    partition <filename>/</filename> avec des fichiers
	    temporaires.</para>
	</note>

      <figure id="sysinstall-label2">
	<title>L'&eacute;diteur Disklabel de sysinstall en mode
	  automatique</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-auto" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Si vous d&eacute;cidez de ne pas utiliser les partitions
	par d&eacute;faut
	et vous d&eacute;sirez les remplacer par les votres, utilisez les touches
	fl&eacute;ch&eacute;es pour s&eacute;lectionner la
	premi&egrave;re partition, et appuyez sur <keycap>D</keycap> pour
	l'effacer.  R&eacute;p&eacute;tez cela pour effacer toutes les
	partitions sugg&eacute;r&eacute;es.</para>

      <para>Pour cr&eacute;er la premi&egrave;re partition
	(<literal>a</literal>, mont&eacute;e en
	<filename>/</filename> &mdash; racine), assurez-vous que la tranche du
	disque correcte en haut de l'&eacute;cran est s&eacute;lectionn&eacute;e,
	et appuyez sur
	<keycap>C</keycap>.  Une bo&icirc;te de dialogue s'affichera et vous
	demandera la taille de la nouvelle partition (comme montr&eacute; sur
	la <xref linkend="sysinstall-label-add">).  Vous pouvez entrer
	la taille sous la forme du nombre de blocs disque que vous
	voulez utiliser, ou sous forme d'un nombre suivi
	soit par <literal>M</literal> pour m&eacute;gaoctets,
	<literal>G</literal> pour gigaoctets, ou soit par
	<literal>C</literal> pour cylindres.</para>

      <note><para>A partir de FreeBSD&nbsp;5.X, les utilisateurs
	peuvent s&eacute;lectionner: <acronym>UFS2</acronym> en utilisant
	l'option <literal>Custom Newfs</literal> (<keycap>Z</keycap>),
	cr&eacute;er les labels avec <literal>Auto
	Defaults</literal> et les modifier avec l'option
	<literal>Custom Newfs</literal>, soit ajouter <option>-O
	2</option> pendant la cr&eacute;ation classique.  N'oubliez pas
	d'ajouter <option>-U</option> pour les SoftUpdates si vous
	utilisez l'option <literal>Custom
	Newfs</literal>!</para></note>

      <figure id="sysinstall-label-add">
	<title>Espace libre pour la partition racine</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La taille par defaut propos&eacute;e cr&eacute;era une partition qui
	occupera le reste de la tranche.  Si vous utilisez les tailles
	de partitions comme d&eacute;crit dans l'exemple pr&eacute;c&eacute;dent, alors effacez la
	valeur propos&eacute;e en utilisant <keycap>Backspace</keycap>,
	et ensuite tapez <userinput>64M</userinput>,
	comme pr&eacute;sent&eacute; sur la <xref
	linkend="sysinstall-label-add2">.  Puis appuyez sur &gui.ok;.</para>

      <figure id="sysinstall-label-add2">
	<title>Edition de la taille de la partition racine</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Apr&egrave;s avoir choisi la taille de la partition on vous
	demandera si cette partition contiendra un syst&egrave;me de fichiers
	ou de l'espace de pagination.
	La bo&icirc;te de dialogue est pr&eacute;sent&eacute;e dans
	la <xref linkend="sysinstall-label-type">.  Cette premi&egrave;re
	partition contiendra un syst&egrave;me de fichiers, v&eacute;rifiez
	donc que <guimenuitem>FS</guimenuitem>
	est s&eacute;lectionn&eacute; et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="sysinstall-label-type">
	<title>Choisir le type de la partition racine</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-fs" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Finalement, comme vous cr&eacute;ez un syst&egrave;me de
	fichiers, vous devez indiquer &agrave;
	<application>Disklabel</application> o&ugrave; le
	syst&egrave;me de fichiers sera mont&eacute;.
	La bo&icirc;te de dialogue est
	montr&eacute;e sur la <xref linkend="sysinstall-label-mount">.  Le
	point de montage du syst&egrave;me de fichiers racine est
	<filename>/</filename>, tapez donc <userinput>/</userinput>, et
	appuyez sur <keycap>Entr&eacute;e</keycap>.</para>

      <figure id="sysinstall-label-mount">
	<title>Choisir le point de montage de la partition racine</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>L'affichage sera mis &agrave; jour pour montrer la partition
	nouvellement cr&eacute;&eacute;e.  Vous devrez r&eacute;p&eacute;ter
	cette proc&eacute;dure pour les
	autres partitions.  Quand vous cr&eacute;erez la partition de l'espace
	de pagination, on ne vous demandera pas de point de montage pour
	le syst&egrave;me de fichiers, &eacute;tant donn&eacute; que les
	partitions de pagination ne sont jamais mont&eacute;es.
	Quand vous cr&eacute;ez la derni&egrave;re
	partition <filename>/usr</filename>, vous pouvez laisser la
	taille sugg&eacute;r&eacute;e telle qu'elle, pour utiliser le
	reste de la tranche.</para>

      <para>Votre dernier &eacute;cran de l'&eacute;diteur DiskLabel de FreeBSD
	appara&icirc;tra semblable &agrave; la
	<xref linkend="sysinstall-label4">, bien que vos valeurs puissent
	&ecirc;tre diff&eacute;rentes.  Appuyez sur
	<keycap>Q</keycap> pour terminer.</para>

      <figure id="sysinstall-label4">
	<title>Editeur Disklabel de sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-choosing">
    <title>Choisir ce que l'on va installer</title>

    <sect2 id="distset">
      <title>S&eacute;lectionner l'ensemble de distribution</title>

      <para>D&eacute;cider quel ensemble de distribution installer
	d&eacute;pendra en
	grande partie de l'utilisation pr&eacute;vue du syst&egrave;me et de la
	quantit&eacute; d'espace disque disponible.
	Les options pr&eacute;d&eacute;finies
	vont de l'installation la plus petite possible &agrave; l'installation
	de la totalit&eacute; des &eacute;l&eacute;ments disponibles.
	Ceux qui sont nouveaux
	&agrave; &unix; et/ou FreeBSD devraient presque certainement choisir une
	de ces options pr&eacute;d&eacute;finies.  Personnaliser un ensemble de
	distribution est normalement r&eacute;serv&eacute; &agrave;
	l'utilisateur plus exp&eacute;riment&eacute;.</para>

      <para>Appuyez sur <keycap>F1</keycap> pour plus d'informations
	sur les options des ensembles de distribution et sur ce qu'ils
	contiennent.  Une fois la lecture de l'aide termin&eacute;e, l'appui
	sur <keycap>Entr&eacute;e</keycap> ram&egrave;nera au menu de
	s&eacute;lection des distributions.</para>

      <para>Si une interface graphique utilisateur est
	d&eacute;sir&eacute;e alors un
	ensemble de distribution qui est pr&eacute;c&eacute;d&eacute; par un
	<literal>X</literal> devra &ecirc;tre choisi.  La configuration
	d'<application>&xfree86;</application> et la s&eacute;lection d'un environnement de travail font
	partie des &eacute;tapes de post-installation.</para>

      <para>La version d'<application>&xfree86;</application> install&eacute;e par d&eacute;faut
	d&eacute;pend de la version de FreeBSD que vous &ecirc;tre en
	train d'installer.  Pour les versions de FreeBSD ant&eacute;rieures
	&agrave; la version 4.6, <application>&xfree86; 3.X</application> est install&eacute;.
	Pour FreeBSD&nbsp;4.6 et suivantes, <application>&xfree86; 4.X</application> est la version par
	d&eacute;faut.</para>

      <para>Vous devriez v&eacute;rifier sur le site d'<ulink
	url="http://www.xfree86.org/">&xfree86;</ulink> que votre carte
	vid&eacute;o est support&eacute;e.  Si elle n'est pas
	support&eacute;e par la version par d&eacute;faut que FreeBSD
	installera, vous devrez choisir une distribution sans X pour
	l'installation.  Apr&egrave;s l'installation, installez et configurez
	la version appropri&eacute;e d'<application>&xfree86;</application>
	en utilisant le catalogue des logiciels
	port&eacute;s.</para>

      <para>Si la compilation d'un noyau personnalis&eacute; est pr&eacute;vue,
	s&eacute;lectionnez une option qui inclut le code source.  Pour plus
	d'information sur l'int&eacute;r&ecirc;t d'un noyau personnalis&eacute;
	ou comment compiler un noyau personnalis&eacute; voir le <xref
	linkend="kernelconfig">.</para>

      <para>A l'&eacute;vidence, le syst&egrave;me le plus versatile est celui
	qui inclut tout.  S'il y a l'espace disque ad&eacute;quat, choisissez
	<guimenuitem>All</guimenuitem> comme montr&eacute; sur la <xref
	linkend="distribution-set1"> en utilisant les touches
	fl&eacute;ch&eacute;es et appuyez sur <keycap>Entr&eacute;e</keycap>.
	S'il y a un probl&egrave;me quant &agrave; l'espace disque
	consid&eacute;rez l'utilisation d'une option plus appropri&eacute;e
	&agrave; la situation.  Ne vous tracassez pas au sujet des choix d'ensembles, comme les autres ensembles de distribution peuvent
	&ecirc;tre ajout&eacute;s apr&egrave;s l'installation.</para>

      <figure id="distribution-set1">
	<title>Choix de l'ensemble de distribution</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>

    <sect2 id="portscol">
      <title>Installer le catalogue des logiciels port&eacute;s - &ldquo;Ports
      collection&rdquo;</title>

      <para>Apr&egrave;s le choix de l'ensemble de distribution
	d&eacute;sir&eacute;, l'opportunit&eacute; d'installer le catalogue
	des logiciels port&eacute;s pour FreeBSD se pr&eacute;sente.
	Le catalogue des logiciels port&eacute;s est une
	m&eacute;thode simple et commode pour installer des logiciels.  Le
	catalogue des logiciels port&eacute;s ne contient pas le code source
	n&eacute;cessaire pour compiler le logiciel.  A la place, c'est un ensemble de
	fichiers qui automatise le t&eacute;l&eacute;chargement, la
	compilation et l'installation de logiciels tierce-partie.  Le <xref linkend="ports"> discute de
	l'utilisation du catalogue des logiciels port&eacute;s.<para>

      <para>Le programme d'installation ne v&eacute;rifie pas si vous avez
	l'espace requis.  S&eacute;lectionnez cette option uniquement si vous
	disposez de l'espace disque ad&eacute;quat.  Sous
	&os;&nbsp;&rel.current;, le catalogue des logiciels port&eacute;s
	occupe environ &ports.size; d'espace disque.  Vous pouvez
	sans risque envisager une plus grande valeur pour les versions
	de &os; plus r&eacute;centes.</para>

<screen>                         User Confirmation Requested
 Would you like to install the FreeBSD ports collection?

 This will give you ready access to over &os.numports; ported software packages,
 at a cost of around &ports.size; of disk space when "clean" and possibly much
 more than that if a lot of the distribution tarballs are loaded
 (unless you have the extra CDs from a FreeBSD CD/DVD distribution
 available and can mount it on /cdrom, in which case this is far less
 of a problem).

 The ports collection is a very valuable resource and well worth having
 on your /usr partition, so it is advisable to say Yes to this option.

 For more information on the ports collection & the latest ports,
 visit:
     http://www.FreeBSD.org/ports

                              [ Yes ]     No</screen>

      <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton> avec les touches
	fl&eacute;ch&eacute;es pour installer le catalogue des logiciels
	port&eacute;s ou <guibutton>[ No ]</guibutton> pour passer cette
	option.  Appuyez sur <keycap>Entr&eacute;e</keycap> pour continuer.
	Le menu de s&eacute;lection de l'ensemble de distribution
	r&eacute;appara&icirc;tra.</para>

      <figure id="distribution-set2">
	<title>Confirmer le choix de la distribution</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Si vous &ecirc;tes satisfait avec les options, s&eacute;lectionnez
	<guimenuitem>Exit</guimenuitem> avec les touches fl&eacute;ch&eacute;es,
	v&eacute;rifiez que &gui.ok; est surlign&eacute;, et appuyez sur
	<keycap>Entr&eacute;e</keycap> pour continuer.</para>

    </sect2>
  </sect1>

  <sect1 id="install-media">
    <title>Choisir votre support d'installation</title>

    <para>Si vous installez &agrave; partir d'un CDROM ou DVD, utilisez les touches
      fl&eacute;ch&eacute;es pour s&eacute;lectionner <guimenuitem>Install from
      a FreeBSD CD/DVD</guimenuitem>.
      V&eacute;rifiez que &gui.ok; est surlign&eacute;, puis
      appuyez sur <keycap>Entr&eacute;e</keycap> pour proc&eacute;der &agrave;
      l'installation.</para>

    <para>Pour les autre m&eacute;thodes d'installation, s&eacute;lectionnez
      l'option appropri&eacute;e et suivez les instructions.</para>

    <para>Appuyez sur <keycap>F1</keycap> pour afficher l'aide en ligne
      pour le support d'installation.  Appuyez sur
      <keycap>Entr&eacute;e</keycap> pour revenir au menu de
      s&eacute;lection du support.</para>

    <figure id="choose-media">
      <title>Choisir le support d'installation</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/media" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <note>
      <title>Modes d'installation par FTP</title>

      <indexterm>
	<primary>installation</primary>
	<secondary>r&eacute;seau</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>

      <para>Il y a trois modes d'installation par FTP, vous pouvez
	choisir parmi: FTP actif, FTP passif, ou par l'interm&eacute;diaire d'un
	proxy HTTP.</para>

      <variablelist>
	<varlistentry>
	  <term>FTP actif: <guimenuitem>Install from an FTP
	      server</guimenuitem></term>

	  <listitem>
	    <para>Cette option fera que tous les transferts FTP
	      utiliseront le mode &ldquo;actif&rdquo;.  Cela ne
	      fonctionnera pas &agrave; travers un coupe-feu, mais fonctionnera
	      souvent avec de vieux serveurs FTP ne supportant pas le
	      mode passif.  Si votre connexion se bloque avec le mode
	      passif (mode par d&eacute;faut), essayez le mode actif!</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>FTP passif: <guimenuitem>Install from an FTP server through a
	      firewall</guimenuitem></term>

	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>mode passif</secondary>
	    </indexterm>

	    <para>Cette option demande &agrave; <application>sysinstall</application> d'utiliser le mode
	      &ldquo;passif&rdquo; pour toutes les op&eacute;rations FTP.  Cela
	      permet &agrave; l'utilisateur de traverser les coupes-feu qui
	      n'acceptent pas les connexions entrantes sur des ports
	      TCP al&eacute;atoires.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>FTP par l'interm&eacute;diaire d'un proxy HTTP:
	    <guimenuitem>Install from an FTP server through a http
	    proxy</guimenuitem></term>

	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>via proxy HTTP</secondary>
	    </indexterm>

	    <para>Cette option demande &agrave; <application>sysinstall</application> d'utiliser le protocole
	      HTTP (comme pour un navigateur web) pour se connecter &agrave; un
	      proxy pour toutes les op&eacute;rations FTP.  Le proxy traduira
	      toutes les requ&ecirc;tes et les transmettra au serveur FTP.
	      Cela permet aux utilisateurs de traverser les coupes-feu
	      qui n'autorisent pas les connexions FTP, mais offrent un
	      proxy HTTP.  Dans ce cas, vous devez pr&eacute;ciser le proxy en
	      plus du serveur FTP.</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <para>Pour un serveur proxy FTP, vous devriez normalement donner
	le nom du serveur que vous d&eacute;sirez comme partie du nom
	d'utilisateur, apr&egrave;s le signe &ldquo;@&rdquo;.  Le serveur proxy
	&ldquo;simulera&rdquo; le serveur r&eacute;el.  Par exemple, en
	supposant que vous voulez installer &agrave; partir de <hostid
	role="fqdn">ftp.FreeBSD.org</hostid>, en utilisant le serveur proxy
	FTP <hostid role="fqdn">foo.example.com</hostid>, &eacute;coutant sur
	le port 1024.</para>

      <para>Dans ce cas, rendez-vous dans le menu d'options, et fixez le
	nom d'utilisateur FTP (&ldquo;username&rdquo;) &agrave;
	<literal>ftp@ftp.FreeBSD.org</literal>, et le mot de passe
	(&ldquo;password&rdquo;) &agrave; votre adresse &eacute;mail.
	Comme support
	d'installation, vous sp&eacute;cifiez FTP (ou FTP passif, si le proxy
	le supporte), et l'URL
	<literal>ftp://foo.example.com:1234/pub/FreeBSD</literal>.</para>

      <para>Puisque le r&eacute;pertoire <filename>/pub/FreeBSD</filename> de
	<hostid role="fqdn">ftp.FreeBSD.org</hostid> est traduit par le
	proxy en <hostid role="fqdn">foo.example.com</hostid>, vous &ecirc;tes
	en mesure d'installer depuis <emphasis>cette</emphasis> machine
	(qui ira chercher les fichiers sur <hostid
	role="fqdn">ftp.FreeBSD.org</hostid> quand l'installation
	r&eacute;clamera des fichiers).</para>
    </note>
  </sect1>

  <sect1 id="install-final-warning">
    <title>Proc&eacute;der &agrave; l'installation</title>

    <para>L'installation peut &ecirc;tre maintenant effectu&eacute;e si
      d&eacute;sir&eacute;e.  C'est &eacute;galement la derni&egrave;re
      chance pour annuler l'installation et
      emp&ecirc;cher l'&eacute;criture sur le disque dur.</para>

    <screen>                       User Confirmation Requested
 Last Chance! Are you SURE you want to continue the installation?

 If you're running this on a disk with data you wish to save then WE
 STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding!

 We can take no responsibility for lost disk contents!

                             [ Yes ]    No</screen>

    <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et appuyez sur
      <keycap>Entr&eacute;e</keycap> pour poursuivre.</para>

    <para>La dur&eacute;e de l'installation variera en fonction de la
      distribution choisie, du support d'installation, et de
      la vitesse de l'ordinateur.  Une s&eacute;rie de messages sera
      affich&eacute;e
      pour indiquer la progression de l'installation.</para>

    <para>L'installation est achev&eacute;e quand le message suivant est
      affich&eacute;:</para>

    <screen>                               Message

Congratulations! You now have FreeBSD installed on your system.

We will now move on to the final configuration questions.
For any option you do not wish to configure, simply select No.

If you wish to re-enter this utility after the system is up, you may
do so by typing: /stand/sysinstall .

                                 [ OK ]

                      [  Press enter to continue  ]</screen>

    <para>Appuyez sur <keycap>Entr&eacute;e</keycap> pour poursuivre avec les
      configurations de post-installation.</para>

    <para>S&eacute;lectionner <guibutton>[ No ]</guibutton> et appuyer sur
      <keycap>Entr&eacute;e</keycap> annulera l'installation et aucun
      changement ne sera fait &agrave; votre syst&egrave;me.  Le message suivant
      appara&icirc;tra:</para>

    <screen>                                Message
Installation complete with some errors.  You may wish to scroll
through the debugging messages on VTY1 with the scroll-lock feature.
You can also choose "No" at the next prompt and go back into the
installation menus to retry whichever operations have failed.

                                 [ OK ]</screen>

    <para>Ce message est g&eacute;n&eacute;r&eacute; parce que
      rien n'a &eacute;t&eacute; install&eacute;.
      L'appui sur <keycap>Entr&eacute;e</keycap> ram&egrave;nera au menu
      principal d'installation pour quitter l'installation.</para>
  </sect1>

  <sect1 id="install-post">
    <title>Post-installation</title>

    <para>La configuration de diverses options suit l'installation.  Une
      option peut &ecirc;tre configur&eacute;e en acc&eacute;dant aux options de
      configuration avant de red&eacute;marrer le nouveau syst&egrave;me
      FreeBSD ou apr&egrave;s l'installation en utilisant la commande
      <command>/stand/sysinstall</command> et en s&eacute;lectionnant
      <guimenuitem>Configure</guimenuitem>.</para>

    <sect2 id="inst-network-dev">
      <title>Configuration r&eacute;seau</title>

      <para>Si vous avez pr&eacute;c&eacute;demment configur&eacute;
	PPP pour une installation par FTP, cet &eacute;cran n'appara&icirc;tra
	pas et peut &ecirc;tre
	configur&eacute; plus tard comme d&eacute;crit ci-dessus.</para>

      <para>Pour une information d&eacute;taill&eacute;e sur les
	r&eacute;seaux locaux et la configuration de FreeBSD en
	passerelle/routeur r&eacute;f&eacute;rez-vous au
	chapitre <link linkend="advanced-networking">Administration
	r&eacute;seau avanc&eacute;e</link>.</para>

      <screen>                      User Confirmation Requested
   Would you like to configure any Ethernet or SLIP/PPP network devices?

                             [ Yes ]   No</screen>

      <para>Pour configurer un p&eacute;riph&eacute;rique r&eacute;seau,
	s&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et appuyez 
	sur <keycap>Entr&eacute;e</keycap>.
	Sinon, s&eacute;lectionnez <guibutton>[ No ]</guibutton> pour
	continuer.</para>

      <figure id="ed-config1">
	<title>S&eacute;lection d'un p&eacute;riph&eacute;rique Ethernet</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>S&eacute;lectionnez l'interface &agrave; configurer avec les touches
	fl&eacute;ch&eacute;es et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <screen>                      User Confirmation Requested
       Do you want to try IPv6 configuration of the interface?

                              Yes   [ No ]</screen>

      <para>Dans ce r&eacute;seau local priv&eacute; l'actuel protocole
	Internet (<acronym>IPv4</acronym>) &eacute;tait suffisant et <guibutton>[ No ]</guibutton>
	a &eacute;t&eacute; s&eacute;lectionn&eacute;
	avec les touches fl&eacute;ch&eacute;es et suivie
	d'<keycap>Entr&eacute;e</keycap>.</para>

      <para>Si vous &ecirc;tes connect&eacute; &agrave; une
	r&eacute;seau (<acronym>IPv6</acronym>), existant avec un
	serveur <acronym>RA</acronym>, alors
	choisissez <guibutton>[ Yes ]</guibutton> et appuyez sur
	<keycap>Entr&eacute;e</keycap>.  Cela prendra plusieurs secondes pour
	rechercher des serveurs RA.</para>

      <screen>                             User Confirmation Requested
        Do you want to try DHCP configuration of the interface?

                              Yes   [ No ]</screen>

      <para>Si DHCP (&ldquo;Dynamic Host Configuration Protocol&rdquo;)
	n'est pas requis s&eacute;lectionnez <guibutton>[ No ]</guibutton>
	&agrave; l'aide des touches fl&eacute;ch&eacute;es et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <para>S&eacute;lectionner <guibutton>[ Yes ]</guibutton> ex&eacute;cutera
	<application>dhclient</application>, et en cas de succ&egrave;s,
	compl&eacute;tera l'information de configuration du r&eacute;seau
	automatiquement.
	R&eacute;f&eacute;rez-vous &agrave; la <xref linkend="network-dhcp"> pour
	plus d'information.</para>

      <para>L'&eacute;cran de configuration r&eacute;seau suivant montre la
	configuration du p&eacute;riph&eacute;rique Ethernet pour un
	syst&egrave;me qui sera
	passerelle pour un r&eacute;seau local.</para>

      <figure id="ed-config2">
	<title>Configuration r&eacute;seau pour ed0</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilisez <keycap>Tab</keycap> pour choisir les champs
	d'information et compl&eacute;ter avec l'information
	appropri&eacute;e:</para>

      <variablelist>
	<varlistentry>
	  <term>Host - &ldquo;H&ocirc;te&rdquo;</term>

	  <listitem>
	    <para>Le nom complet de la machine, e.g. <hostid role="fqdn">k6-2.exemple.com</hostid>
	      dans ce cas.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Domain - &ldquo;Domaine&rdquo;</term>

	  <listitem>
	    <para>Le nom du domaine auquel appartient votre machine, e.g.
	      <hostid role="domainname">exemple.com</hostid> dans le cas pr&eacute;sent.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>IPv4 Gateway - &ldquo;Passerelle IPv4&rdquo;</term>

	  <listitem>
	    <para>L'adresse IP de l'h&ocirc;te transmettant les paquets aux
	      destinations non-locales.  Vous devez compl&eacute;tez cela seulement si la
	      machine est un noeud sur le r&eacute;seau.  <emphasis>Laissez ce
	      champ vide</emphasis> si la machine est destin&eacute;e &agrave;
	      &ecirc;tre la passerelle vers l'Internet pour le
	      r&eacute;seau.  La passerelle (&ldquo;gateway&rdquo;)
	      IPv4 est &eacute;galement connue sous le nom de
	      passerelle par d&eacute;faut ou route par
	      d&eacute;faut.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Name server - &ldquo;Serveur de Noms&rdquo;</term>

	  <listitem>
	    <para>L'adresse IP de votre serveur DNS local.  Il n'y a pas
	      de serveur DNS local sur ce r&eacute;seau local priv&eacute; aussi
	      l'adresse IP du serveur DNS du fournisseur d'acc&egrave;s
	      (<hostid role="ipaddr">208.163.10.2</hostid>) fut utilis&eacute;e.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>IPv4 address - &ldquo;Adresse IPv4&rdquo;</term>

	  <listitem>
	    <para>L'adresse IP employ&eacute;e pour cette interface fut
	      <hostid role="ipaddr">192.168.0.1</hostid></para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Netmask - &ldquo;Masque de sous-r&eacute;seau&rdquo;</term>

	  <listitem>
	    <para>Le bloc d'adresse utilis&eacute; pour ce r&eacute;seau local
	    est un bloc de la Classe C (<hostid role="ipaddr">192.168.0.0</hostid> - <hostid role="ipaddr">192.168.255.255</hostid>).  Le
	      masque de sous-r&eacute;seau par d&eacute;faut est pour un
	      r&eacute;seau de Classe C (<hostid role="netmask">255.255.255.0</hostid>).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Extra options to ifconfig - &ldquo;Options
	    suppl&eacute;mentaires pour ifconfig&rdquo;</term>

	  <listitem>
	    <para>Toutes options d'<command>ifconfig</command>
	      sp&eacute;cifiques aux
	      interfaces que vous voudriez ajouter.  Il n'y en avait
	      aucune dans ce cas-ci.</para>
	  </listitem>
	</varlistentry>

      </variablelist>

      <para>Utilisez <keycap>Tab</keycap> pour s&eacute;lectionner &gui.ok;
	une fois termin&eacute; et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>


      <screen>                      User Confirmation Requested
        Would you like to Bring Up the ed0 interface right now?

                             [ Yes ]   No</screen>

      <para>La s&eacute;lection de <guibutton>[ Yes ]</guibutton> suivie
	d'<keycap>Entr&eacute;e</keycap> rendra l'acc&egrave;s r&eacute;seau
	de la machine op&eacute;rationnel.  Cependant, cela
	ne n'accomplit pas grand chose durant l'installation puisque
	la machine a encore besoin d'&ecirc;tre
	red&eacute;marr&eacute;e.</para>
    </sect2>

    <sect2 id="gateway">
      <title>Configurer la passerelle</title>

      <screen>                       User Confirmation Requested
       Do you want this machine to function as a network gateway?

                              [ Yes ]    No</screen>

      <para>Si la machine jouera le r&ocirc;le de passerelle pour le
	r&eacute;seau local et transmettra les paquets entre machines alors
	s&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et appuyez sur
	<keycap>Entr&eacute;e</keycap>.  Si la machine est un noeud sur le
	r&eacute;seau alors s&eacute;lectionnez <guibutton>[ No ]</guibutton> et
	appuyez sur <keycap>Entr&eacute;e</keycap> pour continuer.</para>
    </sect2>

    <sect2 id="inetd-services">
      <title>Configurer les services Internet</title>

      <screen>                      User Confirmation Requested
Do you want to configure inetd and the network services that is provides?

                               Yes   [ No ]</screen>

      <para>Si <guibutton>[ No ]</guibutton> est s&eacute;lectionn&eacute;,
	divers services tel que <application>telnetd</application> ne seront
	pas activ&eacute;s.  Cela signifie que des utilisateurs &agrave;
	distance ne pourront pas se connecter par l'interm&eacute;diaire de
	<application>telnet</application> &agrave; cette machine.  Les
	utilisateurs locaux seront toujours en mesure d'acc&eacute;der
	&agrave; des machines distantes avec
	<application>telnet</application>.</para>

      <para>Ces services peuvent &ecirc;tre activ&eacute;s apr&egrave;s
	l'installation en &eacute;ditant <filename>/etc/inetd.conf</filename>
	avec votre &eacute;diteur
	de texte favori.  Voir la <xref linkend="network-inetd-overview"> pour
	plus d'information.</para>

      <para>Choisissez <guibutton>[ Yes ]</guibutton> si vous souhaitez
	configurer ces services pendant l'installation.  Une
	confirmation suppl&eacute;mentaire s'affichera:</para>

      <screen>                      User Confirmation Requested
The Internet Super Server (inetd) allows a number of simple Internet
services to be enabled, including finger, ftp and telnetd.  Enabling
these services may increase risk of security problems by increasing
the exposure of your system.

With this in mind, do you wish to enable inetd?

                             [ Yes ]   No</screen>

      <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton> pour
	continuer.</para>

      <screen>                      User Confirmation Requested
inetd(8) relies on its configuration file, /etc/inetd.conf, to determine
which of its Internet services will be available.  The default FreeBSD
inetd.conf(5) leaves all services disabled by default, so they must be
specifically enabled in the configuration file before they will
function, even once inetd(8) is enabled.  Note that services for
IPv6 must be seperately enabled from IPv4 services.

Select [Yes] now to invoke an editor on /etc/inetd.conf, or [No] to
use the current settings.

                             [ Yes ]   No</screen>

      <para>Le choix <guibutton>[ Yes ]</guibutton> permettra d'ajouter
	des services en supprimant le <literal>#</literal> au d&eacute;but
	d'une ligne.</para>

      <figure id="inetd-edit">
	<title>Edition d'<filename>inetd.conf</filename></title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/edit-inetd-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Apr&egrave;s avoir ajout&eacute; les services
	d&eacute;sir&eacute;s, l'appui sur
	<keycap>Echap</keycap> affichera un menu qui permettra de
	quitter et sauver les changements.</para>

    </sect2>

    <sect2 id="ftpanon">
      <title>FTP anonyme</title>

      <screen>                      User Confirmation Requested
 Do you want to have anonymous FTP access to this machine?

                              Yes    [ No ]</screen>

      <sect3 id="deny-anon">
	<title>Interdire l'acc&egrave;s FTP anonyme</title>

	<para>Choisir le <guibutton>[ No ]</guibutton> par d&eacute;faut et
	  appuyer sur <keycap>Entr&eacute;e</keycap> permettra toujours aux
	  utilisateurs ayant des comptes avec mot de passe d'utiliser
	  FTP pour acc&eacute;der &agrave; la machine.</para>
      </sect3>

      <sect3 id="ftpallow">
	<title>Autoriser l'acc&egrave;s FTP anonyme</title>

	<para>N'importe qui peut acc&eacute;der &agrave; votre machine si vous
	  choisissez d'autoriser les connexions par FTP anonyme.  Les
	  implications au niveau de la s&eacute;curit&eacute; devraient
	  &ecirc;tre
	  consid&eacute;r&eacute;es avant d'activer cette option.  Pour plus
	  d'information sur la s&eacute;curit&eacute; voir le <xref
	  linkend="security">.</para>

	<para>Pour autoriser le FTP anonyme, utilisez les touches
	  fl&eacute;ch&eacute;es pour s&eacute;lectionner
	  <guibutton>[ Yes ]</guibutton> et appuyez sur
	  <keycap>Entr&eacute;e</keycap>.  L'&eacute;cran suivant (ou
	  semblable) appara&icirc;tra:</para>

	<figure id="anon-ftp2">
	  <title>Configuration par d&eacute;faut du FTP anonyme</title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/ftp-anon1" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>L'appui sur la touche <keycap>F1</keycap> affichera
	  l'aide:</para>

	<screen>This screen allows you to configure the anonymous FTP user.

The following configuration values are editable:

UID:     The user ID you wish to assign to the anonymous FTP user.
         All files uploaded will be owned by this ID.

Group:   Which group you wish the anonymous FTP user to be in.

Comment: String describing this user in /etc/passwd


FTP Root Directory:

        Where files available for anonymous FTP will be kept.

Upload subdirectory:

        Where files uploaded by anonymous FTP users will go.</screen>

	<para>Le r&eacute;pertoire racine du ftp sera plac&eacute; dans
	  <filename>/var</filename> par d&eacute;faut.  Si vous n'avez pas de
	  place &agrave; cet endroit pour les besoins pr&eacute;vus du FTP, le
	  r&eacute;pertoire <filename>/usr</filename> pourra &ecirc;tre
	  utilis&eacute; en
	  configurant &ldquo;FTP Root Directory&rdquo; &agrave;
	  <filename>/usr/ftp</filename>.</para>

	<para>Quand vous &ecirc;tes satisfait de ces valeurs, appuyez sur
	  <keycap>Entr&eacute;e</keycap> pour continuer.</para>

	<screen>                          User Confirmation Requested
         Create a welcome message file for anonymous FTP users?

                              [ Yes ]    No</screen>

	<para>Si vous s&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et
	  appuyez sur <keycap>Entr&eacute;e</keycap>, un &eacute;diteur sera
	  automatiquement lanc&eacute; vous permettant d'&eacute;diter le
	  message.</para>

	<figure id="anon-ftp4">
	  <title>Edition du message de bienvenue du FTP</title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/ftp-anon2" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>C'est un &eacute;diteur de texte appel&eacute;
	  <command>ee</command>.
	  Utilisez les instructions pour modifier le message ou
	  faites-le plus tard en utilisant l'&eacute;diteur de texte de votre
	  choix.  Notez l'emplacement/le nom du fichier au bas de
	  l'&eacute;cran.</para>

	<para>Appuyez sur <keycap>Echap</keycap> et une bo&icirc;te de
	  dialogue appara&icirc;tra avec l'option <guimenuitem>a) leave
	  editor</guimenuitem> s&eacute;lectionn&eacute;e.  Appuyez sur
	  <keycap>Entr&eacute;e</keycap> pour quitter et continuer.
	  Appuyez &agrave; nouveau sur <keycap>Entr&eacute;e</keycap>
	  pour sauvegarder les modifications si vous en avez
	  fait.</para>
      </sect3>
    </sect2>

    <sect2 id="nfsconf">
      <title>Configurer le syst&egrave;me de fichiers r&eacute;seau -
	NFS</title>

      <para>Le syst&egrave;me de fichiers r&eacute;seau (NFS) permet le
	partage de fichiers &agrave; travers un r&eacute;seau.  Une machine
	peut &ecirc;tre configur&eacute;e en serveur, client, ou les deux.
	R&eacute;f&eacute;rez-vous &agrave; la <xref
	linkend="network-nfs"> pour plus d'information.</para>

      <sect3 id="nsf-server-options">
	<title>Serveur NFS</title>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS server?

                              Yes    [ No ]</screen>

	<para>S'il n'y a aucun de besoin de serveur NFS,
	  s&eacute;lectionnez <guibutton>[ No ]</guibutton> et appuyez sur
	  <keycap>Entr&eacute;e</keycap>.</para>

	<para>Si <guibutton>[ Yes ]</guibutton> est choisi, un message
	  appara&icirc;tra indiquant que le fichier
	  <filename>exports</filename> doit &ecirc;tre
	  cr&eacute;&eacute;.</para>

	<screen>                               Message
Operating as an NFS server means that you must first configure an
/etc/exports file to indicate which hosts are allowed certain kinds of
access to your local file systems.
Press [Enter] now to invoke an editor on /etc/exports
                               [ OK ]</screen>

	<para>Appuyez sur <keycap>Entr&eacute;e</keycap> pour continuer.  Un
	  &eacute;diteur de texte sera lanc&eacute; pour permettre la
	  cr&eacute;ation et
	  l'edition du fichier <filename>exports</filename>.</para>

	<figure id="nfs-server-edit">
	  <title>Edition du fichier <filename>exports</filename></title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/nfs-server-edit" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Suivez les instructions pour ajouter les syst&egrave;mes de
	  fichiers &agrave; exporter maintenant ou plus tard en utilisant
	  l'&eacute;diteur de texte de votre choix.  Notez le nom/l'emplacement
	  au bas de l'&eacute;cran de l'&eacute;diteur.</para>

	<para>Appuyez sur <keycap>Echap</keycap> et une bo&icirc;te de
	  dialogue appara&icirc;tra avec l'option <guimenuitem>a) leave
	  editor</guimenuitem> s&eacute;lectionn&eacute;e.  Appuyez sur
	  <keycap>Entr&eacute;e</keycap> pour quitter et continuer.</para>
      </sect3>

      <sect3 id="nfs-client-options">
	<title>Client NFS</title>

	<para>Le client NFS permet &agrave; votre machine
	  d'acc&eacute;der &agrave; des serveurs NFS.</para>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS client?

                              Yes   [ No ]</screen>

	<para>Avec les touches fl&eacute;ch&eacute;es, s&eacute;lectionnez
	  <guibutton>[ Yes ]</guibutton> ou
	  <guibutton>[ No ]</guibutton> selon vos besoins et appuyez
	  sur <keycap>Entr&eacute;e</keycap>.</para>
      </sect3>
    </sect2>

    <sect2 id="securityprofile">
      <title>Profil de s&eacute;curit&eacute;</title>

      <para>Un &ldquo;profil de s&eacute;curit&eacute;&rdquo; est un ensemble
	d'options qui essaye de fournir un niveau de s&eacute;curit&eacute;
	&agrave; la
	demande en activant et d&eacute;sactivant certains programmes et
	param&egrave;tres.  Plus le profil de s&eacute;curit&eacute; est
	s&eacute;v&egrave;re, moins de
	programmes seront activ&eacute;s par d&eacute;faut.  C'est l'un
	des principe de base de la s&eacute;curit&eacute;: ne rien faire
	fonctionner except&eacute; ce dont
	vous avez r&eacute;ellement besoin.</para>

      <para>Veuillez noter que le profil de s&eacute;curit&eacute; n'est qu'une
	configuration de d&eacute;faut.  Tous les programmes peuvent &ecirc;tre
	activ&eacute;s ou d&eacute;sactiv&eacute;s une fois que vous avez
	install&eacute; FreeBSD en
	&eacute;ditant la(es) ligne(s) appropri&eacute;e(s) dans
	<filename>/etc/rc.conf</filename>.  Pour plus d'information,
	veuillez consulter la page de manuel &man.rc.conf.5;.</para>

      <para>Le tableau suivant d&eacute;crit ce que fait chaque profil de
	s&eacute;curit&eacute;.  Les colonnes repr&eacute;sentent les choix
	que vous avez pour un profil de s&eacute;curit&eacute;, et les
	rang&eacute;es le programme ou la
	caract&eacute;ristique que le profil active ou d&eacute;sactive.</para>

      <table>
	<title>Profils de s&eacute;curit&eacute; possibles</title>

	<tgroup cols=3>
	  <thead>
	    <row>
	      <entry></entry>

	      <entry>Extr&ecirc;me</entry>

	      <entry>Mod&eacute;r&eacute;</entry>
	    </row>
	  </thead>

	  <tbody>

	    <row>
	      <entry>&man.sendmail.8;</entry>

	      <entry>NON</entry>

	      <entry>OUI</entry>
	    </row>

	    <row>
	      <entry>&man.sshd.8;</entry>

	      <entry>NON</entry>

	      <entry>OUI</entry>
	    </row>

	    <row>
	      <entry>&man.portmap.8;</entry>

	      <entry>NON</entry>

	      <entry>PEUT-ETRE
		<footnote>
		  <para>Le portmapper est activ&eacute; si la machine a
		    &eacute;t&eacute; configur&eacute;e comme client ou serveur
		    NFS plus t&ocirc;t dans l'installation.</para>
		</footnote>
	      </entry>
	    </row>

	    <row>
	      <entry>Serveur NFS</entry>

	      <entry>NON</entry>

	      <entry>OUI</entry>
	    </row>

	    <row>
	      <entry>&man.securelevel.8;</entry>

	      <entry>OUI
		<footnote>
		  <para>Si vous choisissez un profil de s&eacute;curit&eacute;
		    qui fixe le niveau de s&eacute;curit&eacute; &agrave;
		    &ldquo;Extreme&rdquo;
		    ou &ldquo;High&rdquo; (Extr&ecirc;me ou Haut), vous devez
		    &ecirc;tre conscient des implications.  Veuillez lire la
		    page de manuel &man.init.8; et faire tout
		    particuli&egrave;rement attention aux significations des
		    niveaux de s&eacute;curit&eacute;, ou sinon vous risquez
		    d'avoir des ennuis plus tard!</para>
		</footnote>
	      </entry>

	      <entry>NON</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <screen>                       User Confirmation Requested
 Do you want to select a default security profile for this host (select
 No for "medium" security)?

                            [ Yes ]    No</screen>

      <para>Choisir <guibutton>[ No ]</guibutton> et appuyer sur
	<keycap>Entr&eacute;e</keycap> activera le niveau de
	s&eacute;curit&eacute; moyen (medium).</para>

      <para>Choisir <guibutton>[ Yes ]</guibutton> et appuyer sur
	<keycap>Entr&eacute;e</keycap> permettra la s&eacute;lection d'un
	profil de s&eacute;curit&eacute; diff&eacute;rent.</para>

      <figure id="security-profile">
	<title>Choix du profil de s&eacute;curit&eacute;</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/security" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Appuyez sur <keycap>F1</keycap> pour afficher l'aide.
	Appuyez sur <keycap>Entr&eacute;e</keycap> pour retourner au menu de
	s&eacute;lection.</para>

      <para>Utilisez les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guimenuitem>Medium</guimenuitem> &agrave; moins que vous ne soyez
	s&ucirc;r qu'un autre niveau est n&eacute;cessaire pour vos besoins.
	Avec &gui.ok; surlign&eacute;, appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <para>Un message appropri&eacute; de confirmation s'affichera en fonction
	du r&eacute;glage de s&eacute;curit&eacute; qui a &eacute;t&eacute;
	choisi.</para>

      <screen>                                 Message

Moderate security settings have been selected.

Sendmail and SSHd have been enabled, securelevels are
disabled, and NFS server setting have been left intact.
PLEASE NOTE that this still does not save you from having
to properly secure your system in other ways or exercise
due diligence in your administration, this simply picks
a standard set of out-of-box defaults to start with.

To change any of these settings later, edit /etc/rc.conf

                                  [OK]</screen>

      <screen>                                 Message

Extreme security settings have been selected.

Sendmail, SSHd, and NFS services have been disabled, and
securelevels have been enabled.
PLEASE NOTE that this still does not save you from having
to properly secure your system in other ways or exercise
due diligence in your administration, this simply picks
a more secure set of out-of-box defaults to start with.

To change any of these settings later, edit /etc/rc.conf

                                  [OK]</screen>

      <para>Appuyez sur <keycap>Entr&eacute;e</keycap> pour continuer avec la
	configuration de post-installation.</para>

      <warning>
	<para>Le profil de s&eacute;curit&eacute; n'est pas une assurance tous
	  risques!  M&ecirc;me si vous utilisez le r&eacute;glage
	  Extr&ecirc;me, vous devez rester au courant des probl&egrave;mes
	  de s&eacute;curit&eacute; en lisant la
	  <ulink url="../handbook/eresources.html#ERESOURCES-MAIL">liste
	  de diffusion</ulink> appropri&eacute;e, en utilisant de bons mots de
	  passe et bonnes phrases cl&eacute; (passphrases), et
	  g&eacute;n&eacute;ralement avoir de bonnes pratiques
	  s&eacute;curitaires.  Il fixe simplement un niveau de
	  s&eacute;curit&eacute; d&eacute;sir&eacute;, bien pr&eacute;cis,
	  directement sans modifications du syst&egrave;me.</para>
      </warning>

    </sect2>

    <sect2 id="console">
      <title>Configuration de la console syst&egrave;me</title>

      <para>Ils y a plusieurs options disponibles pour personnaliser la
	console syst&egrave;me.</para>

      <screen>                      User Confirmation Requested
       Would you like to customize your system console settings?

                              [ Yes ]  No</screen>

      <para>Pour visualiser et configurer ces options, s&eacute;lectionnez
	<guibutton>[ Yes ]</guibutton> et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="saver-options">
	<title>Options de configuration de la console syst&egrave;me</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Une option g&eacute;n&eacute;ralement utilis&eacute;e est
	l'&eacute;conomiseur d'&eacute;cran.
	Utilisez les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guimenuitem>Saver</guimenuitem> et appuyez ensuite sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="saver-select">
	<title>Options de l'&eacute;conomiseur d'&eacute;cran</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>S&eacute;lectionnez l'&eacute;conomiseur d'&eacute;cran
	d&eacute;sir&eacute; en utilisant les
	touches fl&eacute;ch&eacute;es et puis appuyez sur
	<keycap>Entr&eacute;e</keycap>.
	Le menu de configuration de la console syst&egrave;me
	r&eacute;appara&icirc;tra.</para>

      <para>L'intervalle de temps par d&eacute;faut est de 300 secondes.  Pour
	changer cet intervalle de temps, s&eacute;lectionnez
	<guimenuitem>Saver</guimenuitem> &agrave; nouveau.  Au menu de
	configuration de l'&eacute;conomiseur d'&eacute;cran,
	s&eacute;lectionnez
	<guimenuitem>Timeout</guimenuitem> en utilisant les touches
	fl&eacute;ch&eacute;es et appuyez sur <keycap>Entr&eacute;e</keycap>.
	Une bo&icirc;te de dialogue appara&icirc;tra:</para>

      <figure id="saver-timeout">
	<title>D&eacute;lai de l'&eacute;conomiseur d'&eacute;cran</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La valeur peut &ecirc;tre chang&eacute;e, ensuite
	s&eacute;lectionnez &gui.ok;
	et appuyez sur <keycap>Entr&eacute;e</keycap> pour retourner au menu de
	configuration de la console syst&egrave;me.</para>

      <figure id="saver-exit">
	<title>Sortie de la configuration de la console syst&egrave;me</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>En s&eacute;lectionnant <guimenuitem>Exit</guimenuitem> et en
	appuyant sur <keycap>Entr&eacute;e</keycap> on poursuivra avec les
	options de post-installation.</para>
    </sect2>

    <sect2 id="timezone">
      <title>R&eacute;glage du fuseau horaire</title>

      <para>R&eacute;gler le fuseau horaire sur votre machine lui permettra de
	corriger automatiquement tout changement horaire r&eacute;gional et
	d'ex&eacute;cuter d'autres fonctions li&eacute;es au fuseau horaire
	correctement.</para>

      <para>L'exemple pr&eacute;sent&eacute; est pour une machine
	situ&eacute;e dans le
	fuseau horaire oriental des Etats-Unis.  Vos choix changeront en
	fonction de votre position g&eacute;ographique.</para>

      <screen>                      User Confirmation Requested
          Would you like to set this machine's time zone now?

                            [ Yes ]   No</screen>

      <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et appuyez sur
	<keycap>Entr&eacute;e</keycap> pour r&eacute;gler le fuseau
	horaire.</para>

      <screen>                       User Confirmation Requested
 Is this machine's CMOS clock set to UTC? If it is set to local time
 or you don't know, please choose NO here!

                              Yes   [ No ]</screen>

      <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton>
	ou <guibutton>[ No ]</guibutton> en fonction de la configuration
	de l'horloge de la machine et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="set-timezone-region">
	<title>Choisissez votre r&eacute;gion</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La r&eacute;gion appropri&eacute;e est s&eacute;lectionn&eacute;e
	en utilisant les touches fl&eacute;ch&eacute;es, puis en appuyant sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="set-timezone-country">
	<title>S&eacute;lectionnez votre pays</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>S&eacute;lectionnez le pays appropri&eacute; en utilisant les
	touches fl&eacute;ch&eacute;es et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="set-timezone-locality">
	<title>S&eacute;lectionnez votre fuseau horaire</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Le fuseau horaire appropri&eacute; est s&eacute;lectionn&eacute;
	en utilisant les touches fl&eacute;ch&eacute;es et en appuyant sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <screen>                            Confirmation
            Does the abbreviation 'EDT' look reasonable?

                            [ Yes ]   No</screen>

      <para>Confirmez que l'abbr&eacute;viation pour le fuseau horaire est
	correcte.  Si cela semble bon, appuyez sur <keycap>Enter</keycap>
	pour continuer avec la configuration de post-installation.</para>
    </sect2>

    <sect2 id="linuxcomp">
      <title>Compatibilit&eacute; Linux</title>

      <screen>                      User Confirmation Requested
          Would you like to enable Linux binary compatibility?

                            [ Yes ]   No</screen>

      <para>La s&eacute;lection de <guibutton>[ Yes ]</guibutton> et l'appui
	sur <keycap>Entr&eacute;e</keycap> permettra d'ex&eacute;cuter des
	logiciels Linux sous FreeBSD.  L'installation ajoutera les logiciels
	pr&eacute;-compil&eacute;s appropri&eacute;s pour la
	compatibilit&eacute; Linux.</para>

      <para>Si l'on installe par FTP, la machine devra &ecirc;tre
	connect&eacute;e &agrave; l'Internet.  Parfois un site FTP distant
	n'aura pas tous les ensembles de distributions comme la
	compatibilit&eacute; binaire Linux.  Cela peut &ecirc;tre
	install&eacute; plus tard si n&eacute;cessaire.</para>
    </sect2>

    <sect2 id="mouse">
      <title>Configuration de la souris</title>

      <para>Cette option vous permettra de copier-coller du texte dans
	la console et les programmes utilisateur avec une souris 3
	boutons.  Si vous utilisez une souris 2 boutons,
	r&eacute;f&eacute;rez-vous &agrave;
	la page de manuel &man.moused.8;, apr&egrave;s l'installation pour des
	d&eacute;tails sur l'&eacute;mulation du troisi&egrave;me bouton.
	Cet exemple d&eacute;crit
	la configuration d'une souris non-USB (comme une souris PS/2
	ou sur port COM):</para>

      <screen>                      User Confirmation Requested
         Does this system have a non-USB mouse attached to it?

                            [ Yes ]   No</screen>

      <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton> pour une souris
	non-USB ou <guibutton>[ No ]</guibutton> pour une souris USB et
	appuyez sur <keycap>Entr&eacute;e</keycap>.</para>

      <figure id="mouse-protocol">
	<title>S&eacute;lectionner la configuration du protocole de la souris</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilisez les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guimenuitem>Type</guimenuitem> et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="set-mouse-protocol">
	<title>Configurer le protocole de la souris</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La souris utilis&eacute;e dans cet exemple est de type PS/2, aussi
	la valeur par d&eacute;faut <guimenuitem>Auto</guimenuitem> &eacute;tait
	appropri&eacute;e.  Pour changer le protocole, utilisez les touches
	fl&eacute;ch&eacute;es pour s&eacute;lectionner une autre option.
	V&eacute;rifiez que &gui.ok; est surlign&eacute; puis appuyez sur
	<keycap>Entr&eacute;e</keycap> pour quitter ce menu.</para>

      <figure id="config-mouse-port">
	<title>Configuration du port de la souris</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilisez les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guimenuitem>Port</guimenuitem> et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="set-mouse-port">
	<title>Choisir le port de la souris</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Ce syst&egrave;me avait une souris PS/2, aussi la valeur par
	d&eacute;faut <guimenuitem>PS/2</guimenuitem> &eacute;tait
	appropri&eacute;e.  Pour changer le port, utilisez les touches
	fl&eacute;ch&eacute;es et puis appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="test-daemon">
	<title>Activer le &ldquo;daemon&rdquo; - gestionnaire de la
	  souris</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse5" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Finalement, utilisez les touches fl&eacute;ch&eacute;es
	pour s&eacute;lectionner <guimenuitem>Enable</guimenuitem>, et
	appuyez sur <keycap>Entr&eacute;e</keycap> pour activer et
	tester le gestionnaire de la souris.</para>

      <figure id="test-mouse-daemon">
	<title>Tester le gestionnaire de la souris</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse6" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>D&eacute;placez la souris sur l'&eacute;cran et v&eacute;rifiez
	que le curseur r&eacute;pond correctement.  Si c'est le
	cas, s&eacute;lectionnez <guibutton>[ Yes ]</guibutton>
	et appuyez sur <keycap>Enter</keycap>.  Si ce n'est pas
	le cas, la souris n'a pas &eacute;t&eacute; configur&eacute;e
	correctement &mdash; s&eacute;lectionnez <guibutton>[ No ]</guibutton>
	et essayez d'utiliser des options de configuration
	diff&eacute;rentes.</para>

      <para>S&eacute;lectionnez
	<guimenuitem>Exit</guimenuitem> avec les touches fl&eacute;ch&eacute;es
	et appuyez sur <keycap>Entr&eacute;e</keycap> pour continuer la
	configuration de post-installation.</para>
    </sect2>

    <sect2 id="network-services">
      <title>Configuration des services r&eacute;seaux
	suppl&eacute;mentaires</title>

      <para>La configuration des services r&eacute;seaux peut
	&ecirc;tre une t&acirc;che intimidante pour les nouveaux
	utilisateurs s'ils ne poss&egrave;dent pas de connaissances
	dans ce domaine.  L'acc&egrave;s r&eacute;seau, y compris
	l'Internet, est un &eacute;l&eacute;ment essentiel de tout
	syst&egrave;me d'exploitation moderne, c'est le cas de &os;;
	il en r&eacute;sulte, qu'il est tr&egrave;s utile de
	comprendre un peu les capacit&eacute;s r&eacute;seau
	&eacute;tendues de &os;.  Effectuer cette configuration lors
	de l'installation garantira que les utilisateurs ont une
	compr&eacute;hension des divers services qui leur sont
	disponibles.</para>

      <para>Les services r&eacute;seaux sont des programmes qui
	acceptent des entr&eacute;es depuis n'importe quel endroit du
	r&eacute;seau.  De nombreux efforts sont fait pour s'assurer
	que ces programmes ne feront rien de &ldquo;nocif&rdquo;.
	Malheureusement, les programmeurs ne sont pas parfait et par
	le pass&eacute; il y a eu des cas o&ugrave; des bogues dans
	les services r&eacute;seaux ont &eacute;t&eacute;
	exploit&eacute;s par des personnes malveillantes pour faire de
	mauvaises choses.  Il est donc important que vous n'activiez
	que les services dont vous avez besoin.  Dans le doute, il
	vaut mieux que vous n'activiez pas un service r&eacute;seau
	avant que vous ne vous rendiez compte que vous en avez
	r&eacute;ellement besoin.  Vous pouvez toujours l'activer plus
	tard en relan&ccedil;ant <application>sysinstall</application>
	ou en utilisant les options fournies par le fichier
	<filename>/etc/rc.conf</filename>.</para>

      <para>S&eacute;lectionner <guimenu>Networking</guimenu> fera
	appara&icirc;tre un menu similaire au suivant:</para>

      <figure id="network-configuration">
	<title>Configuration r&eacute;seau</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>La premi&egrave;re option,
	<guimenuitem>Interfaces</guimenuitem>, a &eacute;t&eacute;
	pr&eacute;c&eacute;demment abord&eacute;e dans la <xref
	linkend="inst-network-dev">, aussi cette option peut
	&ecirc;tre ignor&eacute;e sans risque.</para>

      <para>La s&eacute;lection de l'option
	<guimenuitem>AMD</guimenuitem> ajoute le support de
	l'utilitaire de montage automatique <acronym>BSD</acronym>.
	Il est g&eacute;n&eacute;ralement employ&eacute; en
	conjonction avec le protocole <acronym>NFS</acronym> (voir
	plus bas) pour monter automatiquement les syst&egrave;mes de
	fichiers distants.  Aucune configuration particuli&egrave;re
	n'est ici n&eacute;cessaire.</para>

      <para>La ligne suivante est l'option <guimenuitem>AMD
	Flags</guimenuitem>.  Quand elle est
	s&eacute;lectionn&eacute;e, un menu s'affichera pour que vous
	puissiez saisir les param&egrave;tres sp&eacute;cifiques
	&agrave; <acronym>AMD</acronym>.  Le menu affiche
	d&eacute;j&agrave; un ensemble d'options par
	d&eacute;faut:</para>

      <screen>-a /.amd_mnt -l syslog /host /etc/amd.map /net /etc/amd.map</screen>

      <para>L'option <literal>-a</literal> fixe l'emplacement de
	montage par d&eacute;faut qui est ici
	<filename>/.amd_mnt</filename>.  L'option
	<literal>-l</literal> sp&eacute;cifie le fichier journal par
	d&eacute;faut, cependant quand <literal>syslogd</literal> est
	utilis&eacute; toutes les traces seront envoy&eacute;es au
	&ldquo;daemon&rdquo; g&eacute;rant les journaux
	syst&egrave;mes.  Le r&eacute;pertoire <filename
	role="directory">/host</filename> est employ&eacute; pour
	monter un syst&egrave;me de fichiers export&eacute; par une
	machine distante, tandis que le r&eacute;pertoire <filename
	role="directory">/net</filename> est utilis&eacute; pour
	monter un syst&egrave;me de fichiers export&eacute; &agrave;
	partir d'une adresse <acronym>IP</acronym>.  Le fichier
	<filename>/etc/amd.map</filename> d&eacute;finit les options
	par d&eacute;faut pour les exportations
	<acronym>AMD</acronym>.</para>

      <para>L'option <guimenuitem>Anon FTP</guimenuitem> autorise les
	connexions <acronym>FTP</acronym> anonymes.
	S&eacute;lectionnez cette option pour faire de la machine un
	serveur <acronym>FTP</acronym> anonyme.  Soyez cependant
	conscient des risques de s&eacute;curit&eacute;
	impliqu&eacute;s avec cette option.  Un autre menu sera
	affich&eacute; pour expliquer les risques au niveau de la
	s&eacute;curit&eacute; et la configuration en
	d&eacute;tail.</para>

      <para>Le menu de configuration
	<guimenuitem>Gateway</guimenuitem> param&eacute;trera la
	machine pour agir en passerelle comme expliqu&eacute;
	pr&eacute;c&eacute;demment.  Cela peut &ecirc;tre
	utilis&eacute; pour d&eacute;sactiver l'option
	<guimenuitem>Gateway</guimenuitem> si vous l'avez
	s&eacute;lectionn&eacute; accidentellement durant le processus
	d'installation.</para>

      <para>L'option <guimenuitem>Inetd</guimenuitem> peut &ecirc;tre
	utilis&eacute;e pour configurer ou compl&egrave;tement
	d&eacute;sactiver le &ldquo;daemon&rdquo; &man.inetd.8; comme
	expos&eacute; plus haut.</para>

      <para>L'option <guimenuitem>Mail</guimenuitem> est
	employ&eacute;e pour configurer l'agent de transfert du
	courrier &eacute;lectronique (&ldquo;MTA&rdquo;) par
	d&eacute;faut du syst&egrave;me.  Choisir cette option fera
	afficher le menu suivant:</para>

      <figure id="mta-selection">
	<title>S&eacute;lection du MTA par d&eacute;faut</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mta-main" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>On vous propose ici un choix de <acronym>MTA</acronym>
	&agrave; installer et &agrave; utiliser par d&eacute;faut.  Un
	<acronym>MTA</acronym> n'est ni plus ni moins qu'un serveur de
	courrier &eacute;lectronique qui d&eacute;livre le courrier
	&eacute;lectronique aux utilisateurs sur le syst&egrave;me ou
	sur l'Internet.</para>

      <para>S&eacute;lectionner <guimenuitem>Sendmail</guimenuitem>
	installera le serveur <application>sendmail</application> qui
	est celui par d&eacute;faut sous &os;. L'option
	<guimenuitem>Sendmail local</guimenuitem> fera en sorte que
	<application>sendmail</application> soit le
	<acronym>MTA</acronym> par d&eacute;faut, mais
	d&eacute;sactivera sa capacit&eacute; &agrave; recevoir du
	courrier &eacute;lectronique en provenance de l'Internet.  Les
	autres options, <guimenuitem>Postfix</guimenuitem> et
	<guimenuitem>Exim</guimenuitem> agissent de fa&ccedil;on
	similaire &agrave; <guimenuitem>Sendmail</guimenuitem>.  Dans
	les deux cas le courrier &eacute;lectronique sera
	&eacute;galement distribu&eacute;; cependant, certains
	utilisateurs, pr&eacute;f&egrave;rent ces alternatives au
	<acronym>MTA</acronym>
	<application>sendmail</application>.</para>

      <para>Apr&egrave;s la s&eacute;lection d'un
	<acronym>MTA</acronym>, ou avoir choisi de ne pas
	s&eacute;lectionner de MTA, le menu de configuration du
	r&eacute;seau appara&icirc;tra avec l'option suivante qui est
	<guimenuitem>NFS client</guimenuitem>.</para>

      <para>L'option <guimenuitem>NFS client</guimenuitem> configurera
	le syst&egrave;me pour communiquer avec un serveur via
	<acronym>NFS</acronym>.  Un serveur <acronym>NFS</acronym>
	rend disponible &agrave; d'autres serveurs des syst&egrave;mes
	de fichiers par l'interm&eacute;diaire du protocole
	<acronym>NFS</acronym>.  Si c'est une machine
	ind&eacute;pendante, cette option peut rester
	d&eacute;sactiv&eacute;e.  Ce syst&egrave;me peut demander
	plus de configuration ult&eacute;rieurement, consultez la
	<xref linkend="network-nfs"> pour plus d'informations sur la
	configuration du client et du serveur.</para>

      <para>Sous cette option se trouve l'option <guimenuitem>NFS
	server</guimenuitem>, vous permettant de configurer le
	syst&egrave;me comme serveur <acronym>NFS</acronym>.  Ceci
	ajoute l'information n&eacute;cessaire pour d&eacute;marrer
	les services d'appel de proc&eacute;dures distantes
	(<acronym>RPC</acronym>).  Les RPC sont utilis&eacute;es pour
	coordonner les connexions entre machines et programmes.</para>

      <para>L'option suivante est <guimenuitem>Ntpdate</guimenuitem>,
	qui traite de la synchronisation de l'horloge.  Quand cette
	option est s&eacute;lectionn&eacute;e, un menu semblable au
	suivant appara&icirc;t:</para>

      <figure id="Ntpdate-config">
	<title>Configuration de ntpdate</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ntp-config" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A partir de ce menu, s&eacute;lectionnez le serveur le
	plus proche de chez vous.  En choisir un proche rendra la
	synchronisation plus pr&eacute;cise qu'avec un serveur
	&eacute;loign&eacute; qui pourra pr&eacute;senter plus de
	d&eacute;lais dans la connexion.</para>

      <para>L'option suivante est la s&eacute;lection de
	<acronym>PCNFSD</acronym>.  Cette option installera le
	paquetage <filename role="package">net/pcnfsd</filename>.
	C'est un programme tr&egrave;s utile qui fournit des services
	d'authentification pour les syst&egrave;mes qui sont dans
	l'incapacit&eacute; de fournir leur propre service
	d'authentification, comme le syst&egrave;me d'exploitation
	&ms-dos; de Microsoft.</para>

      <para>Maintenant vous devez faire d&eacute;filer l'&eacute;cran
	vers le bas pour voir les autres option:</para>

      <figure id="Network-configuration-cont">
	<title>Configuration r&eacute;seau suite</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Les utilitaires &man.rpcbind.8;, &man.rpc.statd.8;, et
	&man.rpc.lockd.8; sont utilis&eacute;s pour les appels de
	proc&eacute;dures distantes (<acronym>RPC</acronym>).
	L'utilitaire <command>rpcbind</command> g&egrave;re la
	communication entre serveurs et clients
	<acronym>NFS</acronym>, et est n&eacute;cessaire aux serveurs
	<acronym>NFS</acronym> pour fonctionner correctement.  Le
	&ldquo;daemon&rdquo; <application>rpc.statd</application>
	interagit avec le &ldquo;daemon&rdquo;
	<application>rpc.statd</application> d'autres machines pour
	fournir une possibilit&eacute; de surveiller l'&eacute;tat des
	communications.  Le rapport est g&eacute;n&eacute;ralement
	conserv&eacute; dans le fichier
	<filename>/var/db/statd.status</filename>.  La derni&egrave;re
	option propos&eacute;e ici est l'option
	<guimenuitem>rpc.lockd</guimenuitem>, qui, quand elle est
	s&eacute;lectionn&eacute;e, fournira des services de
	verrouillage des fichiers.  Cela est habituellement
	utilis&eacute; avec <application>rpc.statd</application> pour
	surveiller quelles machines demandent des verrous et la
	fr&eacute;quence de ces demandes.  Alors que ces options sont
	parfaites pour le d&eacute;boguage, elles ne sont pas
	n&eacute;cessaires pour le bon fonctionnement des seveurs et
	clients <acronym>NFS</acronym>.</para>

      <para>En parcourant la liste, l'option suivante est
	<guimenuitem>Routed</guimenuitem>, qui est le
	&ldquo;daemon&rdquo; de routage.  L'utilitaire &man.routed.8;
	g&egrave;re les tables de routage r&eacute;seau, rep&egrave;re
	les routeurs multicast, et fournit sur demande une copie des
	tables de routage &agrave; toute machine connect&eacute;e sur
	le r&eacute;seau.  Ceci est principalement utilis&eacute; pour
	les machines jouant le r&ocirc;le de passerelle pour le
	r&eacute;seau local (consultez les pages de manuel
	&man.icmp.4; et &man.udp.4;).  Quand cette option est
	s&eacute;lectionn&eacute;e, un menu appara&icirc;tra demandant
	l'emplacement par d&eacute;faut de l'utilitaire.  Cet
	emplacement par d&eacute;faut est d&eacute;j&agrave;
	d&eacute;fini pour vous, et peut &ecirc;tre acquitt&eacute;
	avec la touche <keycap>Entr&eacute;e</keycap>.  Vous sera
	alors pr&eacute;sent&eacute; un nouveau menu, demandant cette
	fois les param&egrave;tres &agrave; passer &agrave;
	<application>routed</application>.  Par d&eacute;faut:
	<literal>-q</literal> qui devrait appara&icirc;tre sur
	l'&eacute;cran.</para>

      <para>La ligne suivante est l'option
	<guimenuitem>Rwhod</guimenuitem>, qui quand elle est
	s&eacute;lectionn&eacute;e, lancera le &ldquo;daemon&rdquo;
	&man.rwhod.8; &agrave; l'initialisation du syst&egrave;me.
	L'utilitaire <command>rwhod</command> diffuse les messages
	syst&egrave;me sur le r&eacute;seau
	r&eacute;guli&egrave;rement, ou les collecte quand il est dans
	le mode &ldquo;consumer&rdquo;.  Plus d'informations peuvent
	&ecirc;tre obtenues dans les pages de manuel &man.ruptime.1;
	et &man.rwho.1;.</para>

      <para>L'option suivante dans la liste est le
	&ldquo;daemon&rdquo; &man.sshd.8;.  C'est le serveur de
	connexions s&eacute;curis&eacute;es pour
	<application>OpenSSH</application> et est hautement
	recommand&eacute; &agrave; la place de
	<application>telnet</application> et des serveurs
	<acronym>FTP</acronym>.  Le serveur
	<application>sshd</application> est employ&eacute; pour
	cr&eacute;er une connexion s&eacute;curis&eacute;e d'une
	machine vers une autre en utilisant des connexions
	crypt&eacute;es.</para>

      <para>Enfin, il y a l'option <guimenuitem>TCP
	Extensions</guimenuitem>.  Celle-ci active les extensions
	<acronym>TCP</acronym> comme d&eacute;finies dans les
	<acronym>RFC</acronym>&nbsp;1323 et
	<acronym>RFC</acronym>&nbsp;1644.  Alors que cela peut sur
	certaines machines rendre les connexions plus rapides, cela
	peut &eacute;galement &ecirc;tre &agrave; l'origine de pertes
	de connexion.  Cette option n'est pas recommand&eacute;e pour
	les serveurs, mais peut &ecirc;tre b&eacute;n&eacute;fique
	pour les machines individuelles.</para>

      <para>Une fois que vous avez configur&eacute; les services
	r&eacute;seaux, vous pouvez remonter l'&eacute;cran
	jusqu'&agrave; la toute premi&egrave;re option qui est
	<guimenuitem>Exit</guimenuitem> et poursuivre avec la section
	de configuration suivante.</para>
    </sect2>

    <sect2 id="x-server">
      <title>Configurer le serveur X</title>

      <para>En vue d'utiliser une interface graphique utilisateur comme
	<application>KDE</application>, <application>GNOME</application>,
	ou d'autres, le serveur X devra &ecirc;tre configur&eacute;.</para>

      <note>
	<para>Afin d'utiliser <application>&xfree86;</application> en tant qu'utilisateur autre que
	  <username>root</username> vous devrez avoir le programme <filename role="package">x11/wrapper</filename> install&eacute;.
	  Ce dernier est install&eacute; par d&eacute;faut depuis FreeBSD 4.7.
	  Pour les versions pr&eacute;c&eacute;dentes il peut &ecirc;tre
	  ajout&eacute; &agrave; partir du menu de
	  s&eacute;lection des
	  logiciels pr&eacute;-compil&eacute;s.</para>
      </note>

      <para>Pour savoir si votre carte vid&eacute;o est support&eacute;e,
	v&eacute;rifiez-le sur le site web
	<ulink url="http://www.xfree86.org/">&xfree86;</ulink>.</para>

      <screen>                      User Confirmation Requested
        Would you like to configure your X server at this time?

                            [ Yes ]   No</screen>

      <warning>
	<para>Il est n&eacute;cessaire de conna&icirc;tre les
	  sp&eacute;cifications de votre
	  moniteur et les informations sur votre carte vid&eacute;o.  Les
	  &eacute;quipements peuvent &ecirc;tre endommag&eacute;s si les
	  r&eacute;glages sont
	  incorrects.  Si vous n'avez pas ces informations, s&eacute;lectionnez
	  <guibutton>[ No ]</guibutton> et effectuez la configuration
	  apr&egrave;s l'installation quand vous aurez l'information en
	  utilisant <command>/stand/sysinstall</command>, puis en
	  s&eacute;lectionnant <guimenuitem>Configure</guimenuitem> et enfin
	  <guimenuitem>XFree86</guimenuitem>.  Une mauvaise
	  configuration du serveur X &agrave; cet instant peut laisser
	  la machine dans un &eacute;tat fig&eacute;.  Il est souvent
	  conseill&eacute; de de param&eacute;trer le serveur X une
	  fois que l'installation est achev&eacute;e.
	</para>
      </warning>

      <para>Si vous avez les informations sur la carte graphique et le
	moniteur, s&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et appuyez
	sur <keycap>Entr&eacute;e</keycap> pour continuer la configuration du
	serveur X.</para>

      <figure id="xserver2">
	<title>S&eacute;lectionnez la m&eacute;thode de configuration</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/xf86setup" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Il y a plusieurs fa&ccedil;ons de configurer le serveur X.
	Utilisez les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	une des m&eacute;thodes et appuyez sur <keycap>Entr&eacute;e</keycap>.
	Veillez &agrave; lire toutes les instructions avec soin.</para>

      <para>Les m&eacute;thodes <application>xf86cfg</application> et
	<application>xf86cfg -textmode</application> peuvent donner un
	&eacute;cran noir et prendre quelques secondes pour d&eacute;marrer.
	Soyez patient.</para>


      <para>Ce qui suit d&eacute;crira l'utilisation de l'outil de
	configuration <application>xf86config</application>.  Les choix
	de configuration que vous ferez d&eacute;pendront du mat&eacute;riel
	pr&eacute;sent dans le syst&egrave;me aussi vos choix seront
	probablement diff&eacute;rents
	de ceux pr&eacute;sent&eacute;s.</para>

      <screen>                                Message
 You have configured and been running the mouse daemon.
 Choose "/dev/sysmouse" as the mouse port and "SysMouse" or
 "MouseSystems" as the mouse protocol in the X configuration utility.

                                 [ OK ]

                      [ Press enter to continue ]</screen>

      <para>Ceci indique que le gestionnaire de souris
	pr&eacute;c&eacute;demment configur&eacute; a &eacute;t&eacute;
	d&eacute;tect&eacute;.  Appuyez sur <keycap>Entr&eacute;e</keycap>
	pour continuer.</para>

      <para>Le lancement de <application>xf86config</application> fera
	appara&icirc;tre une br&egrave;ve introduction:</para>

      <screen>This program will create a basic XF86Config file, based on menu selections you
make.

The XF86Config file usually resides in /usr/X11R6/etc/X11 or /etc/X11. A sample
XF86Config file is supplied with XFree86; it is configured for a standard
VGA card and monitor with 640x480 resolution. This program will ask for a
pathname when it is ready to write the file.

You can either take the sample XF86Config as a base and edit it for your
configuration, or let this program produce a base XF86Config file for your
configuration and fine-tune it.

Before continuing with this program, make sure you know what video card
you have, and preferably also the chipset it uses and the amount of video
memory on your video card. SuperProbe may be able to help with this.

Press enter to continue, or ctrl-c to abort.</screen>

      <para>L'appui sur <keycap>Entr&eacute;e</keycap> lancera la
	configuration de la souris.  Assurez-vous de suivre les
	instructions et d'utiliser &ldquo;Mouse Systems&rdquo; comme
	protocol de souris et <devicename>/dev/sysmouse</devicename>
	comme port de la souris m&ecirc;me si l'utilisation d'une souris PS/2
	est pr&eacute;sent&eacute;e comme illustration.</para>

      <screen>First specify a mouse protocol type. Choose one from the following list:

 1.  Microsoft compatible (2-button protocol)
 2.  Mouse Systems (3-button protocol) & FreeBSD moused protocol
 3.  Bus Mouse
 4.  PS/2 Mouse
 5.  Logitech Mouse (serial, old type, Logitech protocol)
 6.  Logitech MouseMan (Microsoft compatible)
 7.  MM Series
 8.  MM HitTablet
 9.  Microsoft IntelliMouse

If you have a two-button mouse, it is most likely of type 1, and if you have
a three-button mouse, it can probably support both protocol 1 and 2. There are
two main varieties of the latter type: mice with a switch to select the
protocol, and mice that default to 1 and require a button to be held at
boot-time to select protocol 2. Some mice can be convinced to do 2 by sending
a special sequence to the serial port (see the ClearDTR/ClearRTS options).

Enter a protocol number: 2

You have selected a Mouse Systems protocol mouse. If your mouse is normally
in Microsoft-compatible mode, enabling the ClearDTR and ClearRTS options
may cause it to switch to Mouse Systems mode when the server starts.

Please answer the following question with either 'y' or 'n'.
Do you want to enable ClearDTR and ClearRTS? n

You have selected a three-button mouse protocol. It is recommended that you
do not enable Emulate3Buttons, unless the third button doesn't work.

Please answer the following question with either 'y' or 'n'.
Do you want to enable Emulate3Buttons? y

Now give the full device name that the mouse is connected to, for example
/dev/tty00. Just pressing enter will use the default, /dev/mouse.
On FreeBSD, the default is /dev/sysmouse.

Mouse device: /dev/sysmouse</screen>

      <para>Le clavier est l'&eacute;l&eacute;ment suivant &agrave; configurer.
	Un mod&egrave;le g&eacute;n&eacute;rique de 101 touches est
	pr&eacute;sent&eacute; comme exemple.  N'importe quel mod&egrave;le
	peut &ecirc;tre utilis&eacute; comme variante ou appuyez simplement
	sur <keycap>Entr&eacute;e</keycap> pour accepter la valeur par
	d&eacute;faut.</para>

      <screen>Please select one of the following keyboard types that is the better
description of your keyboard. If nothing really matches,
choose 1 (Generic 101-key PC)

  1  Generic 101-key PC
  2  Generic 102-key (Intl) PC
  3  Generic 104-key PC
  4  Generic 105-key (Intl) PC
  5  Dell 101-key PC
  6  Everex STEPnote
  7  Keytronic FlexPro
  8  Microsoft Natural
  9  Northgate OmniKey 101
 10  Winbook Model XP5
 11  Japanese 106-key
 12  PC-98xx Series
 13  Brazilian ABNT2
 14  HP Internet
 15  Logitech iTouch
 16  Logitech Cordless Desktop Pro
 17  Logitech Internet Keyboard
 18  Logitech Internet Navigator Keyboard
 19  Compaq Internet
 20  Microsoft Natural Pro
 21  Genius Comfy KB-16M
 22  IBM Rapid Access
 23  IBM Rapid Access II
 24  Chicony Internet Keyboard
 25  Dell Internet Keyboard

Enter a number to choose the keyboard.

1


Please select the layout corresponding to your keyboard


  1  U.S. English
  2  U.S. English w/ ISO9995-3
  3  U.S. English w/ deadkeys
  4  Albanian
  5  Arabic
  6  Armenian
  7  Azerbaidjani
  8  Belarusian
  9  Belgian
 10  Bengali
 11  Brazilian
 12  Bulgarian
 13  Burmese
 14  Canadian
 15  Croatian
 16  Czech
 17  Czech (qwerty)
 18  Danish

Enter a number to choose the country.
Press enter for the next page

1


Please enter a variant name for 'us' layout. Or just press enter
for default variant

us


Please answer the following question with either 'y' or 'n'.
Do you want to select additional XKB options (group switcher,
group indicator, etc.)? n</screen>

      <para>Ensuite, nous passons &agrave; la configuration du moniteur.  Ne
	pas d&eacute;passer les limites de votre moniteur.  Des dommages
	peuvent subvenir.  Si vous avez un quelconque doute, effectuez
	la configuration apr&egrave;s avoir obtenu l'information.</para>

      <screen>Now we want to set the specifications of the monitor. The two critical
parameters are the vertical refresh rate, which is the rate at which the
whole screen is refreshed, and most importantly the horizontal sync rate,
which is the rate at which scanlines are displayed.

The valid range for horizontal sync and vertical sync should be documented
in the manual of your monitor. If in doubt, check the monitor database
/usr/X11R6/lib/X11/doc/Monitors to see if your monitor is there.

Press enter to continue, or ctrl-c to abort.



You must indicate the horizontal sync range of your monitor. You can either
select one of the predefined ranges below that correspond to industry-
standard monitor types, or give a specific range.

It is VERY IMPORTANT that you do not specify a monitor type with a horizontal
sync range that is beyond the capabilities of your monitor. If in doubt,
choose a conservative setting.

    hsync in kHz; monitor type with characteristic modes
 1  31.5; Standard VGA, 640x480 @ 60 Hz
 2  31.5 - 35.1; Super VGA, 800x600 @ 56 Hz
 3  31.5, 35.5; 8514 Compatible, 1024x768 @ 87 Hz interlaced (no 800x600)
 4  31.5, 35.15, 35.5; Super VGA, 1024x768 @ 87 Hz interlaced, 800x600 @ 56 Hz
 5  31.5 - 37.9; Extended Super VGA, 800x600 @ 60 Hz, 640x480 @ 72 Hz
 6  31.5 - 48.5; Non-Interlaced SVGA, 1024x768 @ 60 Hz, 800x600 @ 72 Hz
 7  31.5 - 57.0; High Frequency SVGA, 1024x768 @ 70 Hz
 8  31.5 - 64.3; Monitor that can do 1280x1024 @ 60 Hz
 9  31.5 - 79.0; Monitor that can do 1280x1024 @ 74 Hz
10  31.5 - 82.0; Monitor that can do 1280x1024 @ 76 Hz
11  Enter your own horizontal sync range

Enter your choice (1-11): 6

You must indicate the vertical sync range of your monitor. You can either
select one of the predefined ranges below that correspond to industry-
standard monitor types, or give a specific range. For interlaced modes,
the number that counts is the high one (e.g. 87 Hz rather than 43 Hz).

 1  50-70
 2  50-90
 3  50-100
 4  40-150
 5  Enter your own vertical sync range

Enter your choice: 2

You must now enter a few identification/description strings, namely an
identifier, a vendor name, and a model name. Just pressing enter will fill
in default names.

The strings are free-form, spaces are allowed.
Enter an identifier for your monitor definition: Hitachi</screen>

      <para>Ensuite, il a la s&eacute;lection d'un pilote de
	p&eacute;riph&eacute;rique pour
	la carte vid&eacute;o.  Si vous passez votre carte sur la liste,
	continuez d'appuyer sur <keycap>Entr&eacute;e</keycap> et la liste se
	r&eacute;p&eacute;tera.  Seul un extrait de la liste est
	pr&eacute;sent&eacute;.</para>

      <screen>Now we must configure video card specific settings. At this point you can
choose to make a selection out of a database of video card definitions.
Because there can be variation in Ramdacs and clock generators even
between cards of the same model, it is not sensible to blindly copy
the settings (e.g. a Device section). For this reason, after you make a
selection, you will still be asked about the components of the card, with
the settings from the chosen database entry presented as a strong hint.

The database entries include information about the chipset, what driver to
run, the Ramdac and ClockChip, and comments that will be included in the
Device section. However, a lot of definitions only hint about what driver
to run (based on the chipset the card uses) and are untested.

If you can't find your card in the database, there's nothing to worry about.
You should only choose a database entry that is exactly the same model as
your card; choosing one that looks similar is just a bad idea (e.g. a
GemStone Snail 64 may be as different from a GemStone Snail 64+ in terms of
hardware as can be).

Do you want to look at the card database? y



288  Matrox Millennium G200 8MB                        mgag200
289  Matrox Millennium G200 SD 16MB                    mgag200
290  Matrox Millennium G200 SD 4MB                     mgag200
291  Matrox Millennium G200 SD 8MB                     mgag200
292  Matrox Millennium G400                            mgag400
293  Matrox Millennium II 16MB                         mga2164w
294  Matrox Millennium II 4MB                          mga2164w
295  Matrox Millennium II 8MB                          mga2164w
296  Matrox Mystique                                   mga1064sg
297  Matrox Mystique G200 16MB                         mgag200
298  Matrox Mystique G200 4MB                          mgag200
299  Matrox Mystique G200 8MB                          mgag200
300  Matrox Productiva G100 4MB                        mgag100
301  Matrox Productiva G100 8MB                        mgag100
302  MediaGX                                           mediagx
303  MediaVision Proaxcel 128                          ET6000
304  Mirage Z-128                                      ET6000
305  Miro CRYSTAL VRX                                  Verite 1000

Enter a number to choose the corresponding card definition.
Press enter for the next page, q to continue configuration.

288

Your selected card definition:

Identifier: Matrox Millennium G200 8MB
Chipset:    mgag200
Driver:     mga
Do NOT probe clocks or use any Clocks line.

Press enter to continue, or ctrl-c to abort.



Now you must give information about your video card. This will be used for
the "Device" section of your video card in XF86Config.

You must indicate how much video memory you have. It is probably a good
idea to use the same approximate amount as that detected by the server you
intend to use. If you encounter problems that are due to the used server
not supporting the amount memory you have (e.g. ATI Mach64 is limited to
1024K with the SVGA server), specify the maximum amount supported by the
server.

How much video memory do you have on your video card:

 1  256K
 2  512K
 3  1024K
 4  2048K
 5  4096K
 6  Other

Enter your choice: 6

Amount of video memory in Kbytes: 8192

You must now enter a few identification/description strings, namely an
identifier, a vendor name, and a model name. Just pressing enter will fill
in default names (possibly from a card definition).

Your card definition is Matrox Millennium G200 8MB.

The strings are free-form, spaces are allowed.
Enter an identifier for your video card definition:</screen>

      <para>Ensuite les modes vid&eacute;o sont param&eacute;tr&eacute;s pour
	les r&eacute;solutions d&eacute;sir&eacute;es.
	Habituellement, les gammes utiles sont 640x480,
	800x600, et 1024x768 mais ces derni&egrave;res sont en fonction des
	capacit&eacute;s de la carte vid&eacute;o, de la taille du moniteur,
	et du confort visuel.  Quand vous s&eacute;lectionnez une profondeur de
	couleur, choisissez la valeur la plus grande que supportera
	votre carte.</para>

      <screen>For each depth, a list of modes (resolutions) is defined. The default
resolution that the server will start-up with will be the first listed
mode that can be supported by the monitor and card.
Currently it is set to:

"640x480" "800x600" "1024x768" "1280x1024" for 8-bit
"640x480" "800x600" "1024x768" "1280x1024" for 16-bit
"640x480" "800x600" "1024x768" "1280x1024" for 24-bit

Modes that cannot be supported due to monitor or clock constraints will
be automatically skipped by the server.

 1  Change the modes for 8-bit (256 colors)
 2  Change the modes for 16-bit (32K/64K colors)
 3  Change the modes for 24-bit (24-bit color)
 4  The modes are OK, continue.

Enter your choice: 2

Select modes from the following list:

 1  "640x400"
 2  "640x480"
 3  "800x600"
 4  "1024x768"
 5  "1280x1024"
 6  "320x200"
 7  "320x240"
 8  "400x300"
 9  "1152x864"
 a  "1600x1200"
 b  "1800x1400"
 c  "512x384"

Please type the digits corresponding to the modes that you want to select.
For example, 432 selects "1024x768" "800x600" "640x480", with a
default mode of 1024x768.

Which modes? 432

You can have a virtual screen (desktop), which is screen area that is larger
than the physical screen and which is panned by moving the mouse to the edge
of the screen. If you don't want virtual desktop at a certain resolution,
you cannot have modes listed that are larger. Each color depth can have a
differently-sized virtual screen

Please answer the following question with either 'y' or 'n'.
Do you want a virtual screen that is larger than the physical screen? n



For each depth, a list of modes (resolutions) is defined. The default
resolution that the server will start-up with will be the first listed
mode that can be supported by the monitor and card.
Currently it is set to:

"640x480" "800x600" "1024x768" "1280x1024" for 8-bit
"1024x768" "800x600" "640x480" for 16-bit
"640x480" "800x600" "1024x768" "1280x1024" for 24-bit

Modes that cannot be supported due to monitor or clock constraints will
be automatically skipped by the server.

 1  Change the modes for 8-bit (256 colors)
 2  Change the modes for 16-bit (32K/64K colors)
 3  Change the modes for 24-bit (24-bit color)
 4  The modes are OK, continue.

Enter your choice: 4



Please specify which color depth you want to use by default:

  1  1 bit (monochrome)
  2  4 bits (16 colors)
  3  8 bits (256 colors)
  4  16 bits (65536 colors)
  5  24 bits (16 million colors)

Enter a number to choose the default depth.

4</screen>

      <para>Finalement, la configuration doit &ecirc;tre sauvegard&eacute;e.
	Soyez s&ucirc;r d'entrer <filename>/etc/XF86Config</filename> comme
	emplacement pour sauvegarder la configuration.</para>

      <screen>I am going to write the XF86Config file now. Make sure you don't accidently
overwrite a previously configured one.

Shall I write it to /etc/X11/XF86Config? n</screen>

      <para>Si la configuration &eacute;choue, vous pouvez recommencer &agrave;
	nouveau en s&eacute;lectionnant <guimenuitem>[ Yes ]</guimenuitem>
	quand le message suivant appara&icirc;t:</para>

      <screen>          User Confirmation Requested
The XFree86 configuration process seems to have
failed.  Would you like to try again?

             [ Yes ]         No</screen>

      <para>Si vous avez des probl&egrave;mes en configurant <application>&xfree86;</application>,
	s&eacute;lectionnez <guimenuitem>[ No ]</guimenuitem> et appuyez sur
	<keycap>Entr&eacute;e</keycap> et continuez avec le processus
	d'installation.  Apr&egrave;s l'installation vous pouvez utiliser
	<command>xf86cfg -textmode</command> ou
	<command>xf86config</command> pour acc&eacute;der aux utilitaires de
	configuration en ligne de commande en tant que
	<username>root</username>.  Il existe une m&eacute;thode
	suppl&eacute;mentaire
	pour configurer <application>&xfree86;</application> d&eacute;crite dans le <xref linkend="x11">.
	Si vous choisissez de ne pas configurer <application>&xfree86;</application> &agrave; cet instant,
	le menu suivant sera pour la s&eacute;lection des logiciels
	pr&eacute;-compil&eacute;s.</para>

      <para>Le param&eacute;trage par d&eacute;faut autorise de tuer le serveur
	gr&acirc;ce
	&agrave; la s&eacute;quence de touches <keycombo action='simul'>
	<keycap>Ctrl</keycap><keycap>Alt</keycap>
	<keycap>Backspace</keycap></keycombo>.
	Cela peut &ecirc;tre effectu&eacute;
	si quelque chose ne va pas avec les param&egrave;tres du serveur et
	pour pr&eacute;venir les dommages mat&eacute;riels.</para>

      <para>Le param&eacute;trage par d&eacute;faut qui autorise le basculement
	entre modes vid&eacute;os permettra le changement de mode durant le
	fonctionnement d'X &agrave; l'aide de la s&eacute;quence de touches
	<keycombo action='simul'>
	  <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>+</keycap>
	</keycombo> ou
	<keycombo action='simul'>
	  <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>-</keycap>
	</keycombo>.
      </para>

      <para>Apr&egrave;s l'installation, l'affichage peut &ecirc;tre
	ajust&eacute; en hauteur, largeur, ou centrage en utilisant
	<application>xvidtune</application> durant le fonctionnement
	d'<application>&xfree86;</application>.</para>

      <para>Il y aura des avertissements sur le fait qu'un param&eacute;trage
	incorrect peut endommager votre &eacute;quipement.  Tenez-en compte.
	En cas de doute, ne faites rien.  Au lieu de cela, utilisez les
        contr&ocirc;les du moniteur pour ajuster l'affichage pour X Window.
	Il peut y avoir des diff&eacute;rences d'affichage quand on revient au
	mode texte, mais c'est mieux que d'endommager votre
	&eacute;quipement.</para>

      <para>Lire la page de manuel d'&man.xvidtune.1; avant d'effectuer
	un quelconque ajustement.</para>

      <para>Suite &agrave; une installation r&eacute;ussie d'Xfree86, on
	passera &agrave; la s&eacute;lection de l'environnement de travail
	par d&eacute;faut.</para>
    </sect2>

    <sect2 id="default-desktop">
      <title>S&eacute;lectionner l'environnement X par d&eacute;faut</title>

      <para>Il y a une grande vari&eacute;t&eacute; de gestionnaires de
	fen&ecirc;tre
	disponible.  Cela va de l'environnement tr&egrave;s basique aux
	environnements de travail complets avec une large suite de
	logiciels.  Certains exigent seulement un espace disque minimal
	et peu de m&eacute;moire tandis que d'autres avec plus
	d'&eacute;l&eacute;ments exigent beaucoup plus.
	La meilleure fa&ccedil;on de d&eacute;terminer celui
	qui est le plus appropri&eacute; &agrave; vos besoins et d'en essayer
	plusieurs.  Ils sont disponibles dans le catalogue de logiciels
	port&eacute;s ou comme logiciel pr&eacute;-compil&eacute; et peuvent
	&ecirc;tre ajout&eacute;s
	apr&egrave;s l'installation.</para>

      <para>Vous pouvez choisir un des environnements de travail
	populaires pour &ecirc;tre install&eacute; et configur&eacute; comme
	environnement par d&eacute;faut.
	Cela vous permettra de le lancer juste apr&egrave;s
	l'installation.</para>

      <figure id="x-desktop">
	<title>S&eacute;lectionner l'environnement par d&eacute;faut</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/desktop" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilisez les touches fl&eacute;ch&eacute;es pour
	s&eacute;lectionner un
	environnement et appuyez sur <keycap>Enter</keycap>.
	L'installation de l'environnement choisi s'effectuera.</para>
    </sect2>

    <sect2 id="packages">
    <title>Installer des logiciels pr&eacute;-compil&eacute;s -
      &ldquo;packages&rdquo;</title>

      <para>Les &ldquo;packages&rdquo; sont des logiciels
	pr&eacute;-compil&eacute;s
	et sont une mani&egrave;re commode d'installer des programmes.</para>

      <para>L'installation d'un logiciel pr&eacute;-compil&eacute; est
	pr&eacute;sent&eacute; comme illustration.
	Des logiciels pr&eacute;-compil&eacute;s suppl&eacute;mentaires
	peuvent &ecirc;tre &eacute;galement ajout&eacute;s &agrave; ce
	moment-l&agrave; si d&eacute;sir&eacute;.  Apr&egrave;s
	l'installation <command>/stand/sysinstall</command> peut &ecirc;tre
	utilis&eacute; pour ajouter des logiciels pr&eacute;-compil&eacute;s
	suppl&eacute;mentaires.</para>

      <screen>                     User Confirmation Requested
 The FreeBSD package collection is a collection of hundreds of
 ready-to-run applications, from text editors to games to WEB servers
 and more. Would you like to browse the collection now?

                            [ Yes ]   No</screen>

      <para>La s&eacute;lection de <guimenuitem>[ Yes ]</guimenuitem> et
	l'appui sur <keycap>Entr&eacute;e</keycap> seront suivis par les
	&eacute;crans de s&eacute;lection des logiciels
	pr&eacute;-compil&eacute;s:</para>

      <figure id="package-category">
	<title>S&eacute;lection d'une cat&eacute;gorie de logiciels
	  pr&eacute;-compil&eacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-cat" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Seuls les logiciels du support d'installation sont
	disponibles pour &ecirc;tre install&eacute;s &agrave;
	n'importe quel moment.</para>

      <para>Tous les logiciels disponibles seront affich&eacute;s si
	<guimenuitem>All</guimenuitem> est s&eacute;lectionn&eacute; ou
	vous pouvez choisir une cat&eacute;gorie particuli&egrave;re.
	Faites votre s&eacute;lection en
	utilisant les touches fl&eacute;ch&eacute;es puis appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <para>Un menu s'affichera en montrant tous les logiciels
	pr&eacute;-compil&eacute;s disponibles pour la cat&eacute;gorie
	s&eacute;lectionn&eacute;e:</para>

      <figure id="package-select">
	<title>S&eacute;lection des logiciels pr&eacute;-compil&eacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-sel" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>L'interpr&eacute;teur de commande <application>bash</application>
	appara&icirc;t s&eacute;lectionn&eacute;.  Choisissez autant de
	logiciels que d&eacute;sir&eacute;
	en les surlignant et en appuyant sur la touche
	<keycap>Espace</keycap>.  Une courte description de chaque
	logiciel appara&icirc;tra dans le coin inf&eacute;rieur gauche de
	l'&eacute;cran.</para>

      <para>En appuyant sur la touche <keycap>Tab</keycap> on basculera
	entre le dernier logiciel pr&eacute;-compil&eacute;, &gui.ok;, et
	&gui.cancel;.</para>

      <para>Quand vous avez fini de marquer les logiciels
	pr&eacute;-compil&eacute;s
	pour l'installation, appuyez sur <keycap>Tab</keycap> une
	nouvelle fois pour basculer sur &gui.ok; et appuyez sur
	<keycap>Entr&eacute;e</keycap> pour revenir au menu de s&eacute;lection
	des logiciels pr&eacute;-compil&eacute;s.</para>

      <para>Les touches fl&eacute;ch&eacute;es gauche et droite basculeront
	&eacute;galement entre &gui.ok; et &gui.cancel;.
	Cette m&eacute;thode peut &ecirc;tre utilis&eacute;e pour
	s&eacute;lectionner &gui.ok; et ensuite appuyer sur
	<keycap>Entr&eacute;e</keycap> pour retourner au menu de
	s&eacute;lection des
	logiciels pr&eacute;-compil&eacute;s.</para>

      <figure id="package-install">
	<title>Installation des logiciels pr&eacute;-compil&eacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-install" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilisez la touche <keycap>Tab</keycap> et les touches fl&eacute;ch&eacute;es pour s&eacute;lectionner
	<guibutton>[ Install ]</guibutton> et appuyez sur
	<keycap>Entr&eacute;e</keycap>.  Vous devrez alors confirmer que vous
	voulez installer les logiciels pr&eacute;-compil&eacute;s:</para>

      <figure id="package-install-confirm">
	<title>Confirmation de l'installation de logiciels pr&eacute;-compil&eacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-confirm" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>S&eacute;lectionner &gui.ok; et l'appui sur
	<keycap>Entr&eacute;e</keycap> lancera l'installation des logiciels.
	Des messages d'installation appara&icirc;tront jusqu'&agrave; la fin de
	l'installation.  Prenez note des &eacute;ventuels messages
	d'erreur.</para>

      <para>La configuration se poursuit apr&egrave;s que les logiciels
	pr&eacute;-compil&eacute;s soient install&eacute;s.  Si vous
	ne choisissez aucun logiciel, et souhaitez retourner &agrave; la
	configuration finale, s&eacute;lectionnez
	<guibutton>Install</guibutton>.</para>
    </sect2>

    <sect2 id="addusers">
      <title>Ajouter des Utilisateurs/Groupes</title>

      <para>Vous devriez ajouter au moins un utilisateur pendant
	l'installation de sorte que vous puissiez utiliser le syst&egrave;me
	sans &ecirc;tre attach&eacute; en tant que <username>root</username>.
	La partition racine est g&eacute;n&eacute;ralement petite et utiliser
	des applications en tant que <username>root</username> peut
	rapidement la remplir.  Un plus grand danger est signal&eacute;
	ci-dessous:</para>

      <screen>                     User Confirmation Requested
 Would you like to add any initial user accounts to the system? Adding
 at least one account for yourself at this stage is suggested since
 working as the "root" user is dangerous (it is easy to do things which
 adversely affect the entire system).

                            [ Yes ]   No</screen>

      <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et appuyez sur
	<keycap>Entr&eacute;e</keycap> pour continuer avec l'ajout d'un
	utilisateur.</para>

      <figure id="add-user2">
	<title>S&eacute;lectionner l'ajout d'utilisateur</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>S&eacute;lectionnez <guimenuitem>User</guimenuitem> avec les touches
	fl&eacute;ch&eacute;es et appuyez sur
	<keycap>Entr&eacute;e</keycap>.</para>

      <figure id="add-user3">
	<title>Ajout de l'information utilisateur</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Les descriptions suivantes appara&icirc;tront dans la partie
	inf&eacute;rieure de l'&eacute;cran au fur et &agrave; mesure que les
	&eacute;l&eacute;ments seront s&eacute;lectionn&eacute;s avec
	<keycap>Tab</keycap> pour aider dans l'entr&eacute;e
	des informations n&eacute;cessaires:</para>

      <variablelist>
	<varlistentry>
	  <term>Login ID - &ldquo;Indentifiant&rdquo;</term>

	  <listitem>
	    <para>L'identifiant du nouvel utilisateur (obligatoire).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>UID</term>

	  <listitem>
	    <para>L'identifiant num&eacute;rique pour cet utilisateur (laisser
	      tel quel pour le choix automatique).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Group - &ldquo;Groupe&rdquo;</term>

	  <listitem>
	    <para>Le nom du groupe pour cet utilisateur (laisser
	      tel quel pour le choix automatique).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Password - &ldquo;Mot de passe&rdquo;</term>

	  <listitem>
	    <para>Le mot de passe pour cet utilisateur (compl&eacute;ter ce
	      champ avec pr&eacute;caution!).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Full name - &ldquo;Nom complet&rdquo;</term>

	  <listitem>
	    <para>Le nom complet de l'utilisateur (commentaire).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Member groups - &ldquo;Membre des groupes&rdquo;</term>

	  <listitem>
	    <para>Les groupes auxquels appartient l'utilisateur (i.e.
	      dont il a les droits acc&egrave;s).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Home directory - &ldquo;R&eacute;pertoire
	    d'utilisateur&rdquo;</term>

	  <listitem>
	    <para>Le r&eacute;pertoire de l'utilisateur (laisser
	      tel quel pour le choix automatique).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Login shell - &ldquo;L'interpr&eacute;teur de
	    commande&rdquo;</term>
	  <listitem>
	    <para>L'interpr&eacute;teur de commande de l'utilisateur (laisser
	      tel quel pour le choix automatique, i.e.
	      <filename>/bin/sh</filename>).</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <para>On a chang&eacute; l'interpr&eacute;teur de commande
	<filename>/bin/sh</filename> pour
	<filename>/usr/local/bin/bash</filename> afin d'utiliser
	<application>bash</application> qui a &eacute;t&eacute; install&eacute;
	pr&eacute;c&eacute;demment sous forme de logiciel
	pr&eacute;-compil&eacute;.  N'essayez pas d'utiliser un
	interpr&eacute;teur de commande qui n'existe pas ou vous ne serez pas
	en mesure d'ouvrir de session.  L'interpr&eacute;teur de
	commande le plus commun dans le monde BSD est
	l'interpr&eacute;teur C shell, qui peut &ecirc;tre
	sp&eacute;cifi&eacute; &agrave; l'aide de
	<filename>/bin/tcsh</filename>.</para>

      <para>L'utilisateur a aussi &eacute;t&eacute; ajout&eacute; au groupe
	<groupname>wheel</groupname> pour qu'il puisse devenir
	super-utilisateur avec les privil&egrave;ges de
	<username>root</username>.</para>

      <para>Quand vous &ecirc;tes satisfait, appuyez sur &gui.ok; et le menu
	de gestion des utilisateurs et des groupes
	r&eacute;appara&icirc;tra:</para>

      <figure id="add-user4">
	<title>Quitter la gestion des utilisateurs et des groupes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Des groupes peuvent &eacute;galement &ecirc;tre ajout&eacute;s
	&agrave; ce moment si des besoins sp&eacute;cifiques sont connus.
	Sinon, cela pourra &ecirc;tre
	fait en utilisant <filename>/stand/sysinstall</filename> quand
	l'installation sera achev&eacute;e.</para>

      <para>Quand vous en avez termin&eacute; avec l'ajout d'utilisateurs,
	s&eacute;lectionnez <guimenuitem>Exit</guimenuitem> avec les touches
	fl&eacute;ch&eacute;es et appuyez sur <keycap>Entr&eacute;e</keycap>
	pour continuer l'installation.</para>
    </sect2>

    <sect2 id="rootpass">
      <title>D&eacute;finir le mot de passe de <username>root</username></title>

      <screen>                        Message
 Now you must set the system manager's password.
 This is the password you'll use to log in as "root".

                         [ OK ]

               [ Press enter to continue ]</screen>

      <para>Appuyez sur <keycap>Entr&eacute;e</keycap> pour d&eacute;finir le
	mot de passe de <username>root</username>.</para>

      <para>Le mot de passe devra &ecirc;tre saisi deux fois correctement.
	Inutile de dire, que vous devez vous assurer d'avoir un moyen de
	retrouver le mot de passe si vous l'oubliez.</para>

      <screen>Changing local password for root.
New password :
Retype new password :</screen>

      <para>L'installation continuera apr&egrave;s que le mot de passe ait
	&eacute;t&eacute; entr&eacute; avec succ&egrave;s.</para>
    </sect2>

    <sect2 id="exit-inst">
      <title>Quitter l'installation</title>

      <para>Si vous devez configurer des p&eacute;riph&eacute;riques
	r&eacute;seau suppl&eacute;mentaires ou toute autre
	configuration, vous pouvez le faire &agrave; ce moment-l&agrave;
	ou apr&egrave;s l'installation en
	utilisant <filename>/stand/sysinstall</filename>.</para>

      <screen>                     User Confirmation Requested
 Visit the general configuration menu for a chance to set any last
 options?

                              Yes   [ No ]</screen>

      <para>S&eacute;lectionnez <guibutton>[ No ]</guibutton> avec les touches
	fl&eacute;ch&eacute;es et appuyez sur <keycap>Entr&eacute;e</keycap>
	pour retourner au menu principal d'installation.</para>

      <figure id="final-main">
	<title>Quitter l'installation</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mainexit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>S&eacute;lectionnez <guibutton>[X Exit Install]</guibutton> avec les
	touches fl&eacute;ch&eacute;es et appuyez sur
	<keycap>Entr&eacute;e</keycap>.  On vous demandera de confirmer
	votre d&eacute;sir de quitter l'installation:</para>

      <screen>                     User Confirmation Requested
 Are you sure you wish to exit? The system will reboot (be sure to
 remove any floppies from the drives).

                            [ Yes ]   No</screen>

      <para>S&eacute;lectionnez <guibutton>[ Yes ]</guibutton> et retirez la
	disquette si vous avez d&eacute;marr&eacute; depuis le lecteur de
	disquette.
	Le lecteur de CDROM est verrouill&eacute; jusqu'au red&eacute;marrage
	de la machine.  Le lecteur de CDROM est alors
	d&eacute;verrouill&eacute; et le CDROM
	peut &ecirc;tre retir&eacute; du lecteur (rapidement).</para>

      <para>Le syst&egrave;me red&eacute;marrera aussi faites attention
	&agrave; tout message d'erreur qui pourrait appara&icirc;tre.</para>
    </sect2>

    <sect2 id="freebsdboot">
      <title>D&eacute;marrage de FreeBSD</title>

      <sect3 id="freebsdboot-i386">
        <title>D&eacute;marrage de FreeBSD sur &i386;</title>

      <para>Si tout s'est bien pass&eacute;, vous verrez des messages
	d&eacute;filer &agrave; l'&eacute;cran et vous arriverez &agrave;
	l'invite de session.  Vous pouvez
	visualiser ces messages en appuyant sur
	<keycap>Arr&ecirc;t-d&eacute;fil</keycap> et en utilisant les touches
	<keycap>PgUp</keycap> et <keycap>PgDn</keycap>.  En appuyant &agrave;
	nouveau sur <keycap>Arr&ecirc;t-d&eacute;fil</keycap> on retournera
	&agrave; l'invite.</para>

      <para>L'int&eacute;gralit&eacute; des messages peut de pas &ecirc;tre
	affich&eacute;e (limitation du tampon) mais peut &ecirc;tre
	visualis&eacute;e depuis la ligne
	de commande apr&egrave;s l'ouverture d'une session en tapant
	<command>dmesg</command> &agrave; l'invite.</para>

      <para>Attachez-vous au syst&egrave;me en utilisant le nom d'utilisateur
	et le mot de passe d&eacute;finis durant l'installation (<username>rpratt</username>, dans
	cet exemple).  Evitez d'ouvrir des sessions en tant que
	<username>root</username> except&eacute; quand cela est
	n&eacute;cessaire.</para>

      <para>Messages de d&eacute;marrage typiques (information sur la version omise):</para>

<screen>Copyright (c) 1992-2002 The FreeBSD Project.
Copyright (c) 1979, 1980, 1983, 1986, 1988, 1989, 1991, 1992, 1993, 1994
        The Regents of the University of California. All rights reserved.

Timecounter "i8254"  frequency 1193182 Hz
CPU: AMD-K6(tm) 3D processor (300.68-MHz 586-class CPU)
  Origin = "AuthenticAMD"  Id = 0x580  Stepping = 0
  Features=0x8001bf&lt;FPU,VME,DE,PSE,TSC,MSR,MCE,CX8,MMX&gt;
  AMD Features=0x80000800&lt;SYSCALL,3DNow!&gt;
real memory  = 268435456 (262144K bytes)
config&gt; di sn0
config&gt; di lnc0
config&gt; di le0
config&gt; di ie0
config&gt; di fe0
config&gt; di cs0
config&gt; di bt0
config&gt; di aic0
config&gt; di aha0
config&gt; di adv0
config&gt; q
avail memory = 256311296 (250304K bytes)
Preloaded elf kernel "kernel" at 0xc0491000.
Preloaded userconfig_script "/boot/kernel.conf" at 0xc049109c.
md0: Malloc disk
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard
npx0: INT 16 interface
pcib0: &lt;Host to PCI bridge&gt; on motherboard
pci0: &lt;PCI bus&gt; on pcib0
pcib1: &lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0
pci1: &lt;PCI bus&gt; on pcib1
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0
isa0: &lt;ISA bus&gt; on isab0
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0
ata0: at 0x1f0 irq 14 on atapci0
ata1: at 0x170 irq 15 on atapci0
uhci0: &lt;VIA 83C572 USB controller&gt; port 0xe400-0xe41f irq 10 at device 7.2 on pci0
usb0: &lt;VIA 83C572 USB controller&gt; on uhci0
usb0: USB revision 1.0
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr 1
uhub0: 2 ports with 2 removable, self powered
chip1: &lt;VIA 82C586B ACPI interface&gt; at device 7.3 on pci0
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xe800-0xe81f irq 9 at
device 10.0 on pci0
ed0: address 52:54:05:de:73:1b, type NE2000 (16 bit)
isa0: too many dependant configs (8)
isa0: unexpected small tag 14
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq 6 drq 2 on isa0
fdc0: FIFO enabled, 8 bytes threshold
fd0: &lt;1440-KB 3.5" drive&gt; on fdc0 drive 0
atkbdc0: &lt;keyboard controller (i8042)&gt; at port 0x60-0x64 on isa0
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq 1 on atkbdc0
kbd0 at atkbd0
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0
psm0: model Generic PS/2 mouse, device ID 0
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0x3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x1 on isa0
sc0: VGA &lt;16 virtual consoles, flags=0x300&gt;
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0
sio0: type 16550A
sio1 at port 0x2f8-0x2ff irq 3 on isa0
sio1: type 16550A
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0
ppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode
ppc0: FIFO with 16/16/15 bytes threshold
ppbus0: IEEE1284 device found /NIBBLE
Probing for PnP devices on ppbus0:
plip0: &lt;PLIP network interface&gt; on ppbus0
lpt0: &lt;Printer&gt; on ppbus0
lpt0: Interrupt-driven port
ppi0: &lt;Parallel I/O&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata0-master using UDMA33
ad2: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata1-master using UDMA33
acd0: CDROM &lt;DELTA OTC-H101/ST3 F/W by OIPD&gt; at ata0-slave using PIO4
Mounting root from ufs:/dev/ad0s1a
swapon: adding /dev/ad0s1b as swap device
Automatic boot in progress...
/dev/ad0s1a: FILESYSTEM CLEAN; SKIPPING CHECKS
/dev/ad0s1a: clean, 48752 free (552 frags, 6025 blocks, 0.9% fragmentation)
/dev/ad0s1f: FILESYSTEM CLEAN; SKIPPING CHECKS
/dev/ad0s1f: clean, 128997 free (21 frags, 16122 blocks, 0.0% fragmentation)
/dev/ad0s1g: FILESYSTEM CLEAN; SKIPPING CHECKS
/dev/ad0s1g: clean, 3036299 free (43175 frags, 374073 blocks, 1.3% fragmentation)
/dev/ad0s1e: filesystem CLEAN; SKIPPING CHECKS
/dev/ad0s1e: clean, 128193 free (17 frags, 16022 blocks, 0.0% fragmentation)
Doing initial network setup: hostname.
ed0: flags=8843&lt;UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST> mtu 1500
        inet 192.168.0.1 netmask 0xffffff00 broadcast 192.168.0.255
        inet6 fe80::5054::5ff::fede:731b%ed0 prefixlen 64 tentative scopeid 0x1
        ether 52:54:05:de:73:1b
lo0: flags=8049&lt;UP,LOOPBACK,RUNNING,MULTICAST&gt; mtu 16384
        inet6 fe80::1%lo0 prefixlen 64 scopeid 0x8
        inet6 ::1 prefixlen 128
        inet 127.0.0.1 netmask 0xff000000
Additional routing options: IP gateway=YES TCP keepalive=YES
routing daemons:.
additional daemons: syslogd.
Doing additional network setup:.
Starting final network daemons: creating ssh RSA host key
Generating public/private rsa1 key pair.
Your identification has been saved in /etc/ssh/ssh_host_key.
Your public key has been saved in /etc/ssh/ssh_host_key.pub.
The key fingerprint is:
cd:76:89:16:69:0e:d0:6e:f8:66:d0:07:26:3c:7e:2d root@k6-2.example.com
 creating ssh DSA host key
Generating public/private dsa key pair.
Your identification has been saved in /etc/ssh/ssh_host_dsa_key.
Your public key has been saved in /etc/ssh/ssh_host_dsa_key.pub.
The key fingerprint is:
f9:a1:a9:47:c4:ad:f9:8d:52:b8:b8:ff:8c:ad:2d:e6 root@k6-2.example.com.
setting ELF ldconfig path: /usr/lib /usr/lib/compat /usr/X11R6/lib
/usr/local/lib
a.out ldconfig path: /usr/lib/aout /usr/lib/compat/aout /usr/X11R6/lib/aout
starting standard daemons: inetd cron sshd usbd sendmail.
Initial rc.i386 initialization:.
rc.i386 configuring syscons: blank_time screensaver moused.
Additional ABI support: linux.
Local package initilization:.
Additional TCP options:.

FreeBSD/i386 (k6-2.example.com) (ttyv0)

login: rpratt
Password:</screen>

      <para>La g&eacute;n&eacute;ration des cl&eacute;s RSA et DSA peut
	prendre du temps sur les machines lentes.
	Cela ne se produit qu'au premier d&eacute;marrage
	d'une nouvelle installation.  Les d&eacute;marrages suivants seront
	plus rapides.</para>

      <para>Si le serveur X a &eacute;t&eacute; configur&eacute; et
	l'environnement de travail par d&eacute;faut choisi, il peut
	&ecirc;tre lanc&eacute; en tapant
	<command>startx</command> sur la ligne de commande.</para>

      </sect3>

      <sect3>
        <title>D&eacute;marrage de FreeBSD sur Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

        <para>Une fois la proc&eacute;dure d'installation termin&eacute;e,
	  vous serez en mesure de d&eacute;marrer FreeBSD en tapant quelque
	  chose comme ceci &agrave; l'invite SRM:</para>

	<screen>&gt;&gt;&gt;<userinput>BOOT DKC0</userinput></screen>

	<para>Cela demande au firmware de d&eacute;marrer sur le disque
	  indiqu&eacute;.  Pour faire d&eacute;marrer FreeBSD automatiquement
	  dans le futur, utilisez ces commandes:</para>

	<screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_OSFLAGS A</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_FILE ''</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOTDEF_DEV DKC0</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET AUTO_ACTION BOOT</userinput></screen>

	<para>Les messages de d&eacute;marrage seront semblables (mais pas
	identiques) &agrave; ceux produits par le d&eacute;marrage de FreeBSD
	sur &i386;.</para>
      </sect3>
    </sect2>

    <sect2 id="shutdown">
      <title>Arr&ecirc;t de FreeBSD</title>

      <para>Il est important d'arr&ecirc;ter proprement le syst&egrave;me
	d'exploitation.  N'appuyez pas directement sur votre bouton de
	marche-arr&ecirc;t.  Tout d'abord, devenez super-utilisateur en tapant
	<command>su</command> sur la ligne de commande et en entrant le
	mot de passe de <username>root</username>.  Cela ne fonctionnera
	que si l'utilisateur est membre du groupe
	<groupname>wheel</groupname>.  Sinon, ouvrez une session en tant
	que <username>root</username> et utilisez <command>shutdown -h
	now</command>.</para>

      <screen>The operating system has halted.
Please press any key to reboot.</screen>

      <para>On peut arr&ecirc;ter la machine sans risques apr&egrave;s la que
	commande d'arr&ecirc;t ait &eacute;t&eacute; effectu&eacute;e et que le
	message &ldquo;Please press any key to reboot&rdquo; (Veuillez appuyez
	sur une touche pour red&eacute;marrer) appara&icirc;t.  Si une touche
	est enfonc&eacute;e plut&ocirc;t que d'arr&ecirc;ter l'ordinateur, le
	syst&egrave;me red&eacute;marrera.</para>

      <para>Vous pouvez &eacute;galement utiliser la combinaison de touches
	<keycombo action='simul'><keycap>Ctrl</keycap><keycap>Alt</keycap>
	<keycap>Suppr</keycap></keycombo>, cependant cela n'est pas
	recommand&eacute; pour une utilisation normale.</para>

    </sect2>
  </sect1>

  <sect1 id="install-supported-hardware">
    <title>Mat&eacute;riel support&eacute;</title>

    <indexterm><primary>mat&eacute;riel</primary></indexterm>
    <para>FreeBSD fonctionne actuellement sur une grande vari&eacute;t&eacute;
      de PCs &agrave; bus ISA, VLB, EISA et PCI avec processeurs
      &ldquo;x86&rdquo; d'Intel, AMD, Cyrix, ou NexGen, aussi bien que sur de
      nombreuses machines bas&eacute;es sur le processeur Compaq Alpha.
      Le support pour les disques IDE g&eacute;n&eacute;riques ou ESDI, de
      nombreux contr&ocirc;leurs SCSI, les cartes PCMCIA, les
      p&eacute;riph&eacute;riques USB, et les cartes r&eacute;seaux et
      s&eacute;ries est aussi fournit.  FreeBSD supporte &eacute;galement
      le bus microchannel d'IBM (MCA).</para>

    <para>Une liste du mat&eacute;riel support&eacute; est disponible avec
      chaque version de FreeBSD dans la liste de compatibilit&eacute;
      mat&eacute;rielle.  Ce document peut &ecirc;tre
      g&eacute;n&eacute;ralement trouv&eacute; sous la forme
      d'un fichier nomm&eacute;
      <filename>HARDWARE.TXT</filename>, sur la racine d'un CDROM ou le
      r&eacute;pertoire d'un FTP de distribution ou dans le menu de
      documentation de <application>sysinstall</application>.  Ce fichier
      &eacute;num&egrave;re, pour une architecture donn&eacute;e, quels sont
      les p&eacute;riph&eacute;riques
      support&eacute;s par chaque version de FreeBSD.  La liste du
      mat&eacute;riel support&eacute; par chaque version et architecture
      peut &eacute;galement &ecirc;tre trouv&eacute;e sur la page
      d'<ulink
      url="http://www.FreeBSD.org/releases/index.html">Information sur
      les versions</ulink> du site Web de FreeBSD.</para>
  </sect1>

  <sect1 id="install-trouble">
    <title>D&eacute;pannage</title>

    <indexterm>
      <primary>installation</primary>
      <secondary>d&eacute;pannage</secondary>
    </indexterm>
    <para>La section suivante couvre le d&eacute;pannage de base de
      l'installation, les probl&egrave;mes courants qui ont &eacute;t&eacute;
      rapport&eacute;s.  Il y a aussi un ensemble de questions-r&eacute;ponses
      pour les personnes d&eacute;sirant
      un double d&eacute;marrage FreeBSD et &ms-dos;.</para>

    <sect2>
      <title>Que faire si quelque chose se passe mal</title>

      <para>En raison des nombreuses limitations de l'architecture PC,
	il est impossible que la d&eacute;tection du mat&eacute;riel soit
	&agrave; 100% fiable, cependant, il y a quelques petites choses que
	vous pouvez faire si cela &eacute;choue.</para>

      <para>V&eacute;rifiez la liste du mat&eacute;riel support&eacute; pour
	votre version de FreeBSD pour &ecirc;tre s&ucirc;r que votre
	mat&eacute;riel est bien support&eacute;.</para>

      <para>Si votre mat&eacute;riel est support&eacute; et que vous
	exp&eacute;rimentez
	toujours des blocages ou autres probl&egrave;mes, appuyez sur le bouton
	de reset de votre ordinateur, et quand l'option de configuration
	visuelle du noyau appara&icirc;t, choisissez-l&agrave;.
	Cela vous permettra de naviguer &agrave; travers votre mat&eacute;riel
	et de fournir l'information au syst&egrave;me &agrave; son sujet.
	Le noyau pr&eacute;sent sur les disques de d&eacute;marrage est
	configur&eacute; de telle fa&ccedil;on qu'il supposera que la
	plupart des p&eacute;riph&eacute;riques seront dans leur configuration
	d'usine en termes d'IRQs, d'adresses d'E/S, et canaux de DMA.  Si votre
	mat&eacute;riel a &eacute;t&eacute; reconfigur&eacute; vous devrez
	tr&egrave;s probablement employer l'&eacute;diteur de configuration
	pour dire &agrave; FreeBSD o&ugrave;
	trouver les choses.</para>

      <para>Il est &eacute;galement possible que la d&eacute;tection d'un
	p&eacute;riph&eacute;rique absent provoque plus tard l'&eacute;chec
	de la d&eacute;tection d'un p&eacute;riph&eacute;rique pr&eacute;sent.
	Dans ce cas, les pilotes de p&eacute;riph&eacute;riques
	conflictuels devraient &ecirc;tre d&eacute;sactiv&eacute;s.</para>

      <note>
        <para>Quelques probl&egrave;mes d'installation peuvent &ecirc;tre
	  &eacute;vit&eacute;s ou all&eacute;g&eacute;s en mettant &agrave;
	  jour le firmware de divers composants mat&eacute;riels, en
	  particulier la carte m&egrave;re.  Le firmware de la
	  carte m&egrave;re peut &eacute;galement &ecirc;tre
	  d&eacute;sign&eacute; par le terme
	  <acronym>BIOS</acronym> et la plupart des constructeurs de
	  cartes m&egrave;res ou d'ordinateur ont un site web o&ugrave; peuvent
	  &ecirc;tre trouv&eacute;es les mises &agrave; jour et les
	  informations de mises &agrave; jour.</para>

        <para>La plupart des fabricants d&eacute;conseillent fortement de
	  mettre &agrave; jour le <acronym>BIOS</acronym> de la carte
	  m&egrave;re &agrave; moins d'avoir une bonne raison de le faire,
	  ce qui pourrait probablement &ecirc;tre une mise &agrave; jour
	  critique si l'on peut dire.
	  Le processus de mise &agrave; jour <emphasis>peut</emphasis> mal se
	  passer, causant des dommages permanents au circuit contenant
	  le <acronym>BIOS</acronym>.</para>
        </note>

      <warning>
        <para>Ne d&eacute;sactivez aucun pilote de p&eacute;riph&eacute;rique
	  dont vous aurez besoin durant l'installation, comme celui de votre
	  &eacute;cran
	  (<devicename>sc0</devicename>).  Si l'installation se bloque
	  ou &eacute;choue myst&eacute;rieusement apr&egrave;s avoir
	  quitt&eacute; l'&eacute;diteur de
	  configuration, c'est que vous avez probablement retir&eacute; ou
	  modifi&eacute; quelque chose qui ne devrait pas l'&ecirc;tre.
	  Red&eacute;marrez et essayez encore.</para>
      </warning>

      <para>Dans le mode de configuration, vous pouvez:</para>

      <itemizedlist>
        <listitem>
          <para>Lister les pilotes de p&eacute;riph&eacute;riques
	    pr&eacute;sents dans le noyau.</para>
        </listitem>

        <listitem>
          <para>D&eacute;sactiver les pilotes de p&eacute;riph&eacute;riques
	    pour le mat&eacute;riel
	    qui n'est pas pr&eacute;sent dans votre syst&egrave;me.</para>
        </listitem>

        <listitem>
          <para>Modifier les IRQs, les DRQs, et les adresses des ports
	    d'E/S utilis&eacute;s par un pilote de
	    p&eacute;riph&eacute;rique.</para>
        </listitem>
      </itemizedlist>

      <para>Apr&egrave;s l'ajustement du noyau &agrave; votre configuration
	mat&eacute;rielle, tapez <command>Q</command> pour d&eacute;marrer
	avec les nouveaux r&eacute;glages.  Une fois l'installation
	achev&eacute;e, tous les changements que vous avez faits en mode
	configuration seront permanents aussi vous ne devrez pas reconfigurer
	votre syst&egrave;me &agrave;
	chaque d&eacute;marrage.  Il est fortement probable que vous vouliez
	par la suite compiler un <link linkend="kernelconfig">noyau
	personnalis&eacute;</link>.</para>
    </sect2>

    <sect2>
      <title>Traiter les partitions &ms-dos; existantes</title>

      <indexterm><primary>DOS</primary></indexterm>
      <para>De nombreux utilisateurs veulent installer FreeBSD sur des
	<acronym>PC</acronym>s qui fonctionnent sous un syst&egrave;me d'exploitation de &microsoft;.
	Dans ce cas, &os; dispose d'un utilitaire connu sous le nom de
	<application>FIPS</application>.  Cette utilitaire peut
	&ecirc;tre trouv&eacute; dans le r&eacute;pertoire
	<filename>tools</filename> du CD-ROM d'installation, ou
	t&eacute;l&eacute;charg&eacute; &agrave; partir des diff&eacute;rents miroirs
	&os;.</para>

      <para>L'utilitaire <application>FIPS</application> vous permet de
	scinder en deux une partition &ms-dos; existante, tout en
	pr&eacute;servant le contenu de la partition originale et vous
	permettant d'installer FreeBSD sur la partition ainsi
	cr&eacute;&eacute;e.
	Vous devez d&eacute;fragmenter tout d'abord votre partition
	&ms-dos; en utilisant l'utilitaire &windows;
	<application>D&eacute;fragmenteur de disque</application> (allez
	dans l'Explorateur, clic-droit sur le disque dur, et choisissez
	de d&eacute;fragmenter votre disque dur) ou les
	<application>Norton Disk Tools</application>.  Vous pouvez
	ensuite lancer le programme
	<application>FIPS</application>.  Il vous demandera le
	reste des informations dont il a besoin, suivez juste les
	instructions &agrave; l'&eacute;cran.  Ensuite, vous
	pouvez red&eacute;marrer et installer FreeBSD sur la tranche
	libre.  Voyez le menu <guimenuitem>Distributions</guimenuitem>
	pour avoir une estimation de l'espace libre dont vous
	aurez besoin pour le type d'installation que vous
	d&eacute;sirez.</para>

      <para>Il existe &eacute;galement un produit
	tr&egrave;s utile de chez <ulink
	url="http://www.powerquest.com/">PowerQuest</ulink> appel&eacute;
	<application>&partitionmagic;</application>.  Cette
	application a bien plus de fonctionnalit&eacute;s que
	<application>FIPS</application>, et est fortement
	recommand&eacute;e si vous projetez d'ajouter/retirer
	r&eacute;guli&egrave;rement des syst&egrave;mes d'exploitation.
	Cependant ce programme n'est pas gratuit, et si vous projetez
	d'installer FreeBSD et ensuite le laisser
	install&eacute;, <application>FIPS</application> sera
	probablement parfait pour vous.</para>
    </sect2>

    <sect2>
      <title>Utilisation des syst&egrave;mes de fichiers &ms-dos; et &windows;</title>

      <para>Pour le moment, &os;, ne supporte pas les syst&egrave;mes
	de fichiers compress&eacute;s avec l'application
	<application>Double Space&trade;</application>.  Par
	cons&eacute;quent, le syst&egrave;me de fichiers doit
	&ecirc;tre d&eacute;compress&eacute; avant que &os; ne puisse
	acc&eacute;der aux donn&eacute;es.  Cela peut &ecirc;tre
	fait en lan&ccedil;ant l'<application>Agent de
	compression</application> situ&eacute; dans le menu
	<guimenuitem>D&eacute;marrer</guimenuitem>&gt;
	<guimenuitem>Programmes</guimenuitem> &gt;
	<guimenuitem>Outils Syst&egrave;me</guimenuitem>.</para>

      <para>&os; supporte les syst&egrave;mes de fichiers &ms-dos;.
	Cela demande d'utiliser la commande &man.mount.msdos.8;
	(sous &os; 5.X, la commande est &man.mount.msdosfs.8;) avec
	les param&egrave;tres requis.  Une utilisation classique
	est:</para>

      <screen>&prompt.root; <userinput>mount_msdos /dev/ad0s1 /mnt</userinput></screen>

      <para>Dans cet exemple, le syst&egrave;me de fichiers &ms-dos;
	est situ&eacute; sur la premi&egrave;re partition du premier
	disque dur.  Votre situation peut &ecirc;tre
	diff&eacute;rente, contr&ocirc;lez les sorties des commandes
	<command>dmesg</command> et <command>mount</command>.
	Elles doivent fournir suffisament d'information pour donner
	une id&eacute;e de l'organisation des partitions.<para>

      <note><para>Les partitions &ms-dos; &eacute;tendues sont
	  r&eacute;f&eacute;renc&eacute;es
	  apr&egrave;s les &ldquo;tranches&rdquo; &os;.
	  En d'autres termes, le nombre de &ldquo;tranches&rdquo;
	  peut &ecirc;tre sup&eacute;rieur &agrave; celui de celles
	  utilis&eacute;es par &os;.  Par exemple, la premi&egrave;re partition
	  &ms-dos; peut &ecirc;tre <filename>/dev/ad0s1</filename>, la
	  partition &os; peut &ecirc;tre
	  <filename>/dev/ad0s2</filename>, avec la partition &ms-dos;
	  &eacute;tendue situ&eacute;e en <filename>/dev/ad0s3</filename>.
	  Pour certains cela peut &ecirc;tre troublant &agrave;
	  premi&egrave;re vue.</para></note>

	<para>Les partitions NTFS peuvent &eacute;galement &ecirc;tre
	  mont&eacute;es d'une mani&egrave;re similaire en employant
	  la commande &man.mount.ntfs.8;.</para>
    </sect2>

    <sect2>
      <title>Questions et R&eacute;ponses pour les utilisateurs
	de syst&egrave;mes Alpha</title>

      <indexterm><primary>Alpha</primary></indexterm>

      <para>Cette section r&eacute;pond &agrave; quelques questions
	fr&eacute;quemment pos&eacute;es
	sur l'installation de FreeBSD sur les syst&egrave;mes Alpha.</para>

      <qandaset>
	<qandaentry>
	  <question>
	    <para>Puis-je d&eacute;marrer &agrave; partir de l'ARC ou de la
	      console Alpha BIOS?</para>
	  </question>

	  <indexterm><primary>ARC</primary></indexterm>
	  <indexterm><primary>Alpha BIOS</primary></indexterm>
	  <indexterm><primary>SRM</primary></indexterm>

	  <answer>
	    <para>Non.  &os;, comme Compaq True64 et VMS, ne d&eacute;marrera
	      qu'&agrave; partir de la console SRM.</para>
	  </answer>
	</qandaentry>

	<qandaentry>
	  <question>
	    <para>A l'aide, je n'ai plus de place!  Faut-il que je
	      commence par tout effacer?</para>
	  </question>

	  <answer>
	    <para>Malheureusement, oui.</para>
	  </answer>
	</qandaentry>

	<qandaentry>
	  <question>
	    <para>Puis-je monter mes syst&egrave;mes de fichiers Compaq Tru64
	      ou VMS?</para>
	  </question>

	  <answer>
	    <para>Non, pas pour le moment.</para>
	  </answer>
	</qandaentry>
      </qandaset>
    </sect2>
  </sect1>

  <sect1 id="install-advanced">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Valentino</firstname>
	  <surname>Vaschetto</surname>
	  <contrib>Contribution de </contrib>
	</author>
	<!-- May 2001 -->
      </authorgroup>
    </sect1info>

    <title>Guide avanc&eacute; d'installation</title>

    <para>Cette section d&eacute;crit comment installer FreeBSD dans des cas
      exceptionnels.</para>

    <sect2 id="headless-install">
      <title>Installer FreeBSD sur un syst&egrave;me sans moniteur ou sans
	clavier</title>

      <indexterm>
        <primary>installation</primary>
        <secondary>headless (console s&eacute;rie)</secondary>
      </indexterm>
      <indexterm><primary>console s&eacute;rie</primary></indexterm>
      <para>Ce type d'installation est appel&eacute; &ldquo;headless
	install&rdquo; (installation sans &eacute;cran), parce que la machine
	sur laquelle vous &ecirc;tes en train d'installer FreeBSD soit n'a pas
	de moniteur, soit n'a m&ecirc;me pas de sortie VGA.  Comment est-ce
	possible, allez-vous demander? En utilisant une console s&eacute;rie.
	Une console s&eacute;rie est en quelques mots l'utilisation d'une autre
	machine comme &eacute;cran et clavier pour un autre syst&egrave;me.
	Pour cela, suivez juste les &eacute;tapes de cr&eacute;ation des
	disquettes d'installation, expliqu&eacute;es dans <xref
	linkend="install-floppies">.</para>

      <para>Pour modifier ces disquettes afin de d&eacute;marrer
	&agrave; travers une console s&eacute;rie, suivez les
	&eacute;tapes suivantes:</para>

      <procedure>
	<step>
	  <title>Configurer les disquettes de d&eacute;marrage pour
	    d&eacute;marrer &agrave; travers la console
	    s&eacute;rie</title>
	    <indexterm>
          <primary><command>mount</command></primary>
        </indexterm>
	    <para>Si vous deviez d&eacute;marrer avec les disquettes que vous
	      venez de faire, FreeBSD d&eacute;marrerait dans son mode
	      d'installation normal.  Nous voulons que FreeBSD d&eacute;marre
	      sur la console s&eacute;rie pour notre installation.  Pour faire
	      cela, vous devez monter la disquette
	      <filename>kern.flp</filename> sur votre syst&egrave;me FreeBSD en
	      utilisant la commande &man.mount.8;.</para>

            <screen>&prompt.root; <userinput>mount /dev/fd0 /floppy</userinput></screen>

	    <para>Maintenant que vous avez la disquette mont&eacute;e, vous
	      devez vous rendre dans le r&eacute;pertoire de la disquette:</para>

	    <screen>&prompt.root; <userinput>cd /floppy</userinput></screen>

	    <para>C'est &agrave; cet endroit que vous devez configurer la
	      disquette pour d&eacute;marrer sur la console s&eacute;rie.
	      Vous devez cr&eacute;er un fichier appel&eacute;
	      <filename>boot.config</filename>
	      contenant la ligne <literal>/boot/loader -h</literal>.
	      Tout ceci provoque le passage d'une option au chargeur
	      pour d&eacute;marrer sur la console s&eacute;rie.</para>

	    <screen>&prompt.root; <userinput>echo "/boot/loader -h" > boot.config</userinput></screen>

	    <para>Maintenant que vous avez votre disquette correctement
	      configur&eacute;e, vous devez d&eacute;monter la disquette en
	      utilisant la commande &man.umount.8;:</para>

            <screen>&prompt.root; <userinput>cd /</userinput>
&prompt.root; <userinput>umount /mnt</userinput></screen>

	    <para>Maintenant vous pouvez retirer la disquette de son
	      lecteur.</para>
	  </step>

	  <step>
	    <title>Connecter votre c&acirc;ble null modem</title>

  	    <indexterm><primary>c&acirc;ble null modem</primary></indexterm>
	    <para>Vous devez maintenant connecter un c&acirc;ble null modem
	      entre les deux machines.  Connectez juste le c&acirc;ble sur le
	      port s&eacute;rie des deux machines.  <emphasis>Un c&acirc;ble
	      s&eacute;rie normal ne conviendra pas ici</emphasis>, vous avez
	      besoin d'un c&acirc;ble null modem parce certains fils sont
	      crois&eacute;s &agrave; l'int&eacute;rieur.</para>
	  </step>

	  <step>
	    <title>D&eacute;marrer l'installation</title>

	    <para>Il est maintenant temps de lancer l'installation.
	      Mettez la disquette <filename>kern.flp</filename> dans le
	      lecteur de la machine que vous allez installer sans
	      moniteur et clavier, et allumez la machine.</para>
	  </step>

	  <step>
	    <title>Connexion &agrave; la machine sans moniteur ni
	      clavier</title>
	    <indexterm>
        <primary><command>cu</command></primary>
      </indexterm>
	    <para>Maintenant vous devez vous connecter &agrave; cette machine
	      &agrave; l'aide de &man.cu.1;:</para>

	    <screen>&prompt.root; <userinput>cu -l /dev/cuaa0</userinput></screen>
	  </step>
      </procedure>

      <para>Voil&agrave;!  Vous devriez maintenant pouvoir contr&ocirc;ler la machine sans
	moniteur et sans clavier &agrave; travers votre session
	<command>cu</command>.  On vous demandera d'ins&eacute;rer la disquette
	<filename>mfsroot.flp</filename>, et ensuite on vous proposera
	de choisir le type de terminal &agrave; utiliser.
	S&eacute;lectionnez la
	console couleur FreeBSD et effectuez votre installation!</para>

    </sect2>
  </sect1>

  <sect1 id="install-diff-media">
    <title>Pr&eacute;parer votre propre support d'installation</title>

    <note>
      <para>Pour &eacute;viter les r&eacute;p&eacute;titions, &ldquo;disque
	FreeBSD&rdquo;
	dans ce contexte signifie un CDROM ou DVD FreeBSD que vous avez
	achet&eacute;, ou produit vous-m&ecirc;me.</para>
    </note>

    <para>Il peut y avoir quelques situations dans lesquelles vous devez
      cr&eacute;er votre propre support et/ou source d'installation de FreeBSD.
      Cela pourrait &ecirc;tre un support physique, comme une bande, ou une
      source que <application>sysinstall</application> pourrait employer
      pour r&eacute;cup&eacute;rer les fichiers, comme un site FTP local, ou une
      partition &ms-dos;.</para>

    <para>Par exemple:</para>

    <itemizedlist>
      <listitem>
	<para>Vous avez beaucoup de machines connect&eacute;es sur votre
	  r&eacute;seau
	  local, et un seul disque FreeBSD.  Vous voulez cr&eacute;er un site
	  FTP local utilisant le contenu du disque FreeBSD, et ensuite
	  faire utiliser ce site FTP local par vos machines plut&ocirc;t que
	  de se connecter &agrave; l'Internet.</para>
      </listitem>

      <listitem>
	<para>Vous avez un disque FreeBSD, et FreeBSD ne reconna&icirc;t pas
	  votre lecteur de CD/DVD, mais &ms-dos;/&windows; oui.  Vous voulez
	  copier les fichiers d'installation de FreeBSD sur une
	  partition DOS sur le m&ecirc;me ordinateur, et ensuite installer
	  FreeBSD en utilisant ces fichiers.</para>
      </listitem>

      <listitem>
	<para>L'ordinateur sur lequel vous voulez installer n'a pas de
	  lecteur de CD/DVD, ou de carte r&eacute;seau, mais vous pouvez
	  connecter un c&acirc;ble s&eacute;rie ou parall&egrave;le de
	  &ldquo;type
	  Laplink&rdquo; sur un ordinateur qui lui dispose d'un lecteur
	  de CD/DVD ou d'une carte r&eacute;seau.</para>
      </listitem>

      <listitem>
	<para>Vous voulez cr&eacute;er une bande qui peut &ecirc;tre
	  utilis&eacute;e pour installer FreeBSD.</para>
      </listitem>
    </itemizedlist>

    <sect2 id="install-cdrom">
      <title>Cr&eacute;er un CDROM d'installation</title>

      <para>Comme &eacute;l&eacute;ment de chaque nouvelle version, le
	projet FreeBSD met &agrave; disposition deux images de CDROM
	(&ldquo;images ISO&rdquo;).  Ces images peuvent inscrites
	(&ldquo;grav&eacute;es&rdquo;)	sur CDs si vous disposez d'un
	graveur de CD, et puis &ecirc;tre utilis&eacute;es pour installer
	FreeBSD.  Si vous avez un graveur de CD, et comme la bande
	passante est bon march&eacute;, alors c'est la m&eacute;thode
	la plus simple pour installer FreeBSD.</para>

      <procedure>
	<step>
	  <title>T&eacute;l&eacute;charger les bonnes images ISO</title>

	  <para>Les images ISO de chaque version peuvent &ecirc;tre
	    t&eacute;l&eacute;charg&eacute;es &agrave; partir de
	    <filename>ftp://ftp.FreeBSD.org/pub/FreeBSD/ISO-IMAGES-<replaceable>arch</replaceable>/<replaceable>version</replaceable></filename>
	    ou du miroir le plus proche.  Remplacez
	    <replaceable>arch</replaceable> et
	    <replaceable>version</replaceable> par les valeurs
	    appropri&eacute;es.</para>

	  <para>Ce r&eacute;pertoire contiendra normalement les images
	    suivantes:</para>

	  <table frame="none">
	    <title>Noms des images ISO de FreeBSD et leurs
	      significations</title>

	    <tgroup cols="2">
	      <thead>
		<row>
		  <entry>Nom du fichier</entry>

		  <entry>Contenu</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry><filename><replaceable>version</replaceable>-mini.iso</filename></entry>
		  
		  <entry>Tout ce dont vous avez besoin pour installer
		    FreeBSD.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>version</replaceable>-disc1.iso</filename></entry>

		  <entry>Tout ce dont vous avez besoin pour installer
		    FreeBSD, et autant de logiciels tiers
		    pr&eacute;-compil&eacute;s que l'espace sur le disque le
		    permet.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>version</replaceable>-disc2.iso</filename></entry>

		  <entry>Un syst&egrave;me de fichiers &ldquo;live&rdquo;,
		    qui est utilis&eacute; avec la fonction
		    &ldquo;Repair&rdquo; de
		    <application>sysinstall</application>.  Une copie de
		    l'arborescence CVS de FreeBSD. Et autant de
		    logiciels tiers pr&eacute;-compil&eacute;s que
		    l'espace sur le disque le permet.</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </table>

<!-- XXX we don't need to mention things prior to 4.4 anymore
	  <note>
	    <para>L'image ISO dite &ldquo;mini&rdquo; fut produite pour
	      FreeBSD&nbsp;4.4 et les version suivantes.  Les images pour les
	      disques deux, trois, et quatre furent produites seulement
	      pour FreeBSD&nbsp;4.5 et versions suivantes.</para>
	  </note>
-->

	  <para>Vous <emphasis>devez</emphasis> t&eacute;l&eacute;charger soit
	    l'image ISO mini, soit l'image du disque num&eacute;ro un.  Ne
	    t&eacute;l&eacute;charger pas les deux, &eacute;tant donn&eacute;
	    que le disque num&eacute;ro un contient tout le contenu de
	    l'image ISO mini.</para>

	  <para>Utilisez l'ISO mini si votre acc&egrave;s Internet est bon
	    march&eacute;.  Elle vous laissera installer FreeBSD, et vous
	    pourrez ensuite installer des logiciels tiers en les
	    t&eacute;l&eacute;chargeant en employant le syst&egrave;me de
	    logiciels pr&eacute;-compil&eacute;s/logiciels port&eacute;s
	    (voir le <xref linkend="ports">) si n&eacute;cessaire.</para>

	  <para>Utilisez l'image du disque num&eacute;ro un si vous voulez une
	    bonne s&eacute;lection de logiciels tiers &eacute;galement sur
	    le disque.</para>

	  <para>Les images des autres disques sont utiles, mais pas
	    indispensables, tout particuli&egrave;rement si vous disposez
	    d'un acc&egrave;s Internet &agrave; haut d&eacute;bit.</para>
	</step>

	<step>
	  <title>Graver les CDs</title>

	  <para>Vous devez ensuite graver les images de CD.  Si vous
	    faites cela &agrave; partir d'un autre syst&egrave;me FreeBSD
	    consultez alors la <xref linkend="creating-cds"> pour plus
	    d'informations (en particulier les <xref linkend="burncd">
	    et <xref linkend="cdrecord">).</para>

	  <para>Si vous le faites &agrave; partir d'une autre plate-forme alors
	    vous devrez utiliser les utilitaires existants pour
	    commander votre graveur de CD sur cette plate-forme.  Les
	    images fournies le sont dans le standard ISO qui est
	    support&eacute; par de nombreuses applications de gravure
	    de CD.</para>
	</step>
      </procedure>
    </sect2>

    <sect2 id="install-ftp">
      <title>Cr&eacute;ation d'un site FTP local avec le disque FreeBSD</title>

      <indexterm>
	<primary>installation</primary>
	<secondary>r&eacute;seau</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>

      <para>Les disques FreeBSD sont pr&eacute;sent&eacute;s comme le site FTP.
	Cela rend tr&egrave;s facile la cr&eacute;ation d'un site FTP local qui
	peut &ecirc;tre utilis&eacute; par d'autres machines de votre
	r&eacute;seau lors de l'installation de FreeBSD.</para>

      <procedure>
	<step>
	  <para>Sur l'ordinateur FreeBSD qui h&eacute;bergera le site FTP,
	    soyez s&ucirc;r que le CDROM est dans la lecteur, et mont&eacute; en
	    <filename>/cdrom</filename>.</para>

	  <screen>&prompt.root; <userinput>mount /cdrom</userinput></screen>
	</step>

	<step>
	  <para>Cr&eacute;ez un compte pour le FTP anonyme dans
	    <filename>/etc/passwd</filename>.  Faites cela en &eacute;ditant
	    <filename>/etc/passwd</filename> avec &man.vipw.8; et en
	    ajoutant cette ligne:</para>

	  <programlisting>ftp:*:99:99::0:0:FTP:/cdrom:/nonexistent</programlisting>
	</step>

	<step>
	  <para>V&eacute;rifiez que le service FTP est activ&eacute; dans
	    <filename>/etc/inetd.conf</filename>.</para>
	</step>
      </procedure>

      <para>N'importe qui avec un acc&egrave;s r&eacute;seau &agrave; votre
	machine peut d&eacute;sormais choisir un support de type FTP et taper
	<userinput>ftp://<replaceable>votre machine</replaceable></userinput>
	apr&egrave;s avoir s&eacute;lectionn&eacute;
	&ldquo;Other&rdquo; dans le menu des sites FTP durant
	l'installation.</para>

      <warning>
	<para>Cette approche est correcte pour une machine qui est sur votre
	  r&eacute;seau local, et qui est prot&eacute;g&eacute;e par votre
	  coupe-feu.  Offrir un acc&egrave;s FTP &agrave; d'autres machines sur
	  Internet (et non sur votre r&eacute;seau local) expose votre
	  ordinateur &agrave; l'attention de crackers et autres
	  ind&eacute;sirables.  Nous recommandons fortement de suivre de bonnes
	  pratiques de s&eacute;curit&eacute; si vous
	  faites cela.</para>
      </warning>
    </sect2>

      <sect2>
        <title>Cr&eacute;ation de disquettes d'installation</title>

      <indexterm>
	<primary>installation</primary>
	<secondary>disquettes</secondary>
      </indexterm>

      <para>Si vous devez installer &agrave; partir de disquettes (ce que nous
	sugg&eacute;rons de ne <emphasis>pas</emphasis> faire), soit en raison
	d'un mat&eacute;riel non support&eacute;, soit que vous aimez vous
	compliquer la vie, vous devez d'abord pr&eacute;parer des disquettes
	pour l'installation.</para>

	<para>Il vous faudra au minimum autant de disquettes 1.44&nbsp;MO ou
	  1.2&nbsp;MO que n&eacute;cessaire pour y mettre tous les fichiers du
	  r&eacute;pertoire <filename>bin</filename> (distribution binaire).
	  Si vous pr&eacute;parez ces disquettes sous DOS, alors elles
	  <emphasis>DOIVENT</emphasis> &ecirc;tre format&eacute;es en utilisant
	  la commande &ms-dos; <command>format</command>.  Si vous utilisez
	  &windows;, utilisez l'Explorateur pour formater les disquettes
	  (clic-droit sur le lecteur <devicename>A:</devicename> , et
	  s&eacute;lectionnez &ldquo;Formater&rdquo;).</para>

	<para>Ne faites <emphasis>pas</emphasis> confiance aux
	  disquettes pr&eacute;format&eacute;es en usine.  Reformatez-les
	  vous-m&ecirc;me, de fa&ccedil;on &agrave; &ecirc;tre s&ucirc;r.
	  Nos utilisateurs nous ont, dans le pass&eacute;, signal&eacute; de
	  nombreux probl&egrave;mes dus &agrave; des disquettes
	  incorrectement format&eacute;es, ce qui explique pourquoi nous
	  insistons autant maintenant.</para>

	<para>Si vous cr&eacute;ez les disquettes sur une autre machine
	  FreeBSD, ce n'est toujours pas une mauvaise id&eacute;e de les
	  formatter, bien que vous n'ayez pas besoin de mettre un
	  syst&egrave;me de fichiers &ms-dos; sur chaque disquette.  Vous pouvez
	  utiliser les commandes <command>disklabel</command> et
	  <command>newfs</command> pour y mettre un syst&egrave;me de fichier
	  UFS &agrave; la place, comme le montre la s&eacute;quence de commandes
	  suivantes (pour une disquette 3.5" de 1.44&nbsp;MO):</para>

	<screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440</userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/fd0</userinput></screen>

	<note>
	  <para>Utilisez <literal>fd0.1200</literal> et
	    <literal>floppy5</literal> pour les disquettes 5.25" 1.2&nbsp;MO.</para>
	</note>

	<para>Vous pouvez alors les monter et y &eacute;crire comme sur
	  n'importe quel autre syst&egrave;me de fichiers.</para>

	<para>Apr&egrave;s avoir formatter les disquettes, vous devrez y copier
	  les fichiers.  Les fichiers de la distribution sont scind&eacute;s en
	  morceaux de taille telle que cinq d'entre eux tiendront sur une
	  disquette 1.44&nbsp;MO ordinaire.  Pr&eacute;parez les disquettes les unes
	  apr&egrave;s les autres, en y mettant sur chacune autant de fichiers
	  que vous pouvez, jusqu'&agrave; ce que vous ayez recopi&eacute;
	  toutes les
	  distributions que vous voulez installer.  Chaque distribution
	  doit avoir son propre sous-r&eacute;pertoire sur la disquette, e.g.:
	  <filename>a:\bin\bin.aa</filename>,
	  <filename>a:\bin\bin.ab</filename>, et ainsi de suite.</para>

	<para>Une fois que vous &ecirc;tes &agrave; l'&eacute;cran de
	  s&eacute;lection du support
	  d'installation, s&eacute;lectionnez &ldquo;Floppy&rdquo; (disquette)
	  et vous aurez ensuite des indications sur la marche &agrave;
	  suivre.</para>
      </sect2>

      <sect2 id="install-msdos">
        <title>Installation depuis une partition &ms-dos;</title>

	<indexterm>
    <primary>installation</primary>
    <secondary>depuis MS-DOS</secondary>
  </indexterm>
	<para>Pour pr&eacute;parer l'installation depuis une partition &ms-dos;,
	  copiez les fichiers de la distribution dans un r&eacute;pertoire
	  appel&eacute; <filename>freebsd</filename> dans le r&eacute;pertoire
	  racine de cette partition.  Par exemple,
	  <filename>c:\freebsd</filename>.  L'arborescence des
	  r&eacute;pertoires du CDROM ou du site FTP doit &ecirc;tre
	  partiellement reproduite dans ce r&eacute;pertoire, aussi nous
	  sugg&eacute;rons
	  l'utilisation de la commande DOS <command>xcopy</command> si
	  vous copiez &agrave; partir d'un CDROM.  Par exemple, pour
	  pr&eacute;parer une installation minimale de FreeBSD:</para>

	<screen><prompt>C:\&gt;</prompt> <userinput>md c:\freebsd</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\bin c:\freebsd\bin\ /s</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\manpages c:\freebsd\manpages\ /s</userinput></screen>

	<para>En supposant que <devicename>C:</devicename> est l'endroit
	  o&ugrave; vous avez de l'espace libre et que votre CDROM soit
	  mont&eacute; sur <devicename>E:</devicename>.</para>

	<para>Si vous n'avez pas de lecteur de CDROM, vous pouvez
	  t&eacute;l&eacute;charger la distribution depuis <ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/">ftp.FreeBSD.org</ulink>.
	  Chaque distribution est dans son propre r&eacute;pertoire; par
	  exemple la distribution <emphasis>base</emphasis>
	  peut &ecirc;tre trouv&eacute;e dans le r&eacute;pertoire <ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/base/">&rel.current;/base/</ulink>.</para>

	<para>Copiez chaque distribution que vous voulez installer
	  depuis la partition &ms-dos; (et pour laquelle vous avez de
	  l'espace libre) dans <filename>c:\freebsd</filename> &mdash;
	  la distribution <literal>BIN</literal> n'est que le minimum
	  obligatoire.</para>
      </sect2>

      <sect2>
        <title>Cr&eacute;ation d'une bande d'installation</title>

	<indexterm>
    <primary>installation</primary>
    <secondary>&agrave; partir de bandes QIC/SCSI</secondary>
  </indexterm>
	<para>Installer &agrave; partir de bandes est probablement la
	  m&eacute;thode
	  la plus simple, mis &agrave; part l'installation en ligne avec FTP ou
	  depuis le CDROM.  Le programme d'installation s'attend &agrave; ce
	  que les fichiers soient simplement archiv&eacute;s sur la bande.
	  Apr&egrave;s avoir r&eacute;cup&eacute;r&eacute; tous les fichiers
	  des distributions qui vous int&eacute;ressent, archivez-les avec
	  <command>tar</command> sur la bande:</para>

	<screen>&prompt.root; <userinput>cd /freebsd/distdir</userinput>
&prompt.root; <userinput>tar cvf /dev/rwt0 dist1 ... dist2</userinput></screen>

	<para>Quand vous installez, vous devez vous assurer qu'il y a
	  assez de place dans un r&eacute;pertoire temporaire (que vous pourrez
	  choisir) pour y mettre le contenu <emphasis>entier</emphasis>
	  de la bande que vous avez cr&eacute;&eacute;e.  En raison de
	  l'acc&egrave;s non-al&eacute;atoire des bandes, cette m&eacute;thode
	  exige un espace de
	  stockage temporaire important.  Vous devez donc vous attendre
	  &agrave; avoir autant d'espace de stockage temporaire que vous avez
	  mis de donn&eacute;es sur la bande.</para>

	<note>
	  <para>Au moment d'installer, la bande doit &ecirc;tre dans le lecteur
	    <emphasis>avant</emphasis> de d&eacute;marrer avec la disquette.
	    Sinon les tests risquent de ne pas la trouver.</para>
	</note>
      </sect2>

      <sect2>
        <title>Avant d'installer via le r&eacute;seau</title>

	<indexterm>
    <primary>installation</primary>
    <secondary>r&eacute;seau</secondary>
    <tertiary>s&eacute;rie (SLIP ou PPP)</tertiary>
  </indexterm>
	<indexterm>
    <primary>installation</primary>
    <secondary>r&eacute;seau</secondary>
    <tertiary>parall&egrave;le (PLIP)</tertiary>
  </indexterm>
	<indexterm>
    <primary>installation</primary>
    <secondary>r&eacute;seau</secondary>
    <tertiary>Ethernet</tertiary>
  </indexterm>
	<para>Il y a trois types d'installation r&eacute;seau disponibles. Par
	  port s&eacute;rie (SLIP ou PPP), par port parall&egrave;le (PLIP
	  (c&acirc;ble
	  laplink)), ou par Ethernet (un contr&ocirc;leur Ethernet standard (y
	  compris certains contr&ocirc;leurs PCMCIA)).</para>

	<para>Le support SLIP est assez rudimentaire, et essentiellement
	  limit&eacute; aux lignes directes, comme un c&acirc;ble s&eacute;rie
	  entre un
	  ordinateur portable et un autre ordinateur.  La liaison devra
	  &ecirc;tre directe car l'installation par SLIP n'offre pas la
	  possibilit&eacute; de se connecter par t&eacute;l&eacute;phone; cette
	  fonctionnalit&eacute; est fournie par l'utilitaire PPP, qu'il faut
	  utiliser de pr&eacute;f&eacute;rence &agrave; SLIP chaque fois que
	  c'est possible.</para>

	<para>Si vous utilisez un modem, PPP est presque certainement
	  votre seul choix.  Veillez &agrave; avoir sous la main les
	  informations concernant votre fournisseur d'acc&egrave;s car vous en
	  aurez besoin assez t&ocirc;t dans la proc&eacute;dure
	  d'installation.</para>

	<para>Si vous utilisez PAP ou CHAP pour vous connecter &agrave; votre
	  fournisseur d'acc&egrave;s (en d'autres termes, si vous pouvez vous
	  connecter au fournisseur d'acc&egrave;s sous &windows; sans utiliser de
	  script), alors tout ce que vous aurez &agrave; faire est de taper
	  <command>dial</command> &agrave; l'invite de
	  <application>ppp</application>.  Sinon, vous devrez savoir comment se
	  connecter &agrave; votre fournisseur d'acc&egrave;s en utilisant
	  les &ldquo;commandes AT&rdquo; propres &agrave; votre modem, car le
	  programme d'appel PPP ne fournit qu'un &eacute;mulateur de terminal
	  tr&egrave;s simplifi&eacute;.  Veuillez vous reporter aux sections
	  concernant ppp utilisateur du <link
	  linkend="userppp">Manuel</link> et de la <ulink
	  url="../faq/ppp.html">FAQ</ulink> pour plus d'informations.
	  Si vous avez des probl&egrave;mes, connectez-vous directement &agrave;
	  l'&eacute;cran avec la commande <command>set log local
	  ...</command>.</para>

	<para>Si vous disposez d'une liaison directe &agrave; une autre machine
	  FreeBSD (2.0-R ou ult&eacute;rieure), vous pourrez envisager
	  d'installer avec un c&acirc;ble &ldquo;laplink&rdquo; sur le port
	  parall&egrave;le.  La vitesse de transmission sur le port
	  parall&egrave;le
	  est plus importante que celle que l'on obtient habituellement
	  avec une liaison s&eacute;rie (jusqu'&agrave; 50&nbsp;Koctets/sec), ce qui
	  acc&eacute;l&egrave;re l'installation.</para>

	<para>Finalement, pour une installation r&eacute;seau la plus rapide
	  possible, une carte Ethernet est toujours un bon choix!
	  FreeBSD supporte la plupart des cartes Ethernet PC courantes;
	  une liste des cartes support&eacute;es (et leur param&eacute;trage
	  requis)
	  est fournie dans la liste de compatibilit&eacute; mat&eacute;rielle de
	  chaque version de FreeBSD.  Si vous utilisez une des cartes
	  Ethernet PCMCIA support&eacute;e, assurez-vous qu'elle soit en place
	  <emphasis>avant</emphasis> d'allumer le portable!  FreeBSD ne
	  supporte pas, malheureusement, actuellement l'insertion &agrave;
	  chaud des cartes PCMCIA pendant l'installation.</para>

	<para>Vous devrez aussi conna&icirc;tre votre adresse IP sur le
	  r&eacute;seau, le masque de r&eacute;seau pour votre classe
	  d'adresses, et le nom de votre machine.  Si vous installez par
	  l'interm&eacute;diaire d'une connexion PPP et que vous n'avez pas
	  d'IP fixe, ne prenez pas peur, l'adresse IP peut &ecirc;tre
	  dynamiquement assign&eacute;e par votre fournisseur d'acc&egrave;s.
	  Votre administrateur syst&egrave;me peut vous dire quelles valeurs
	  utiliser pour votre configuration r&eacute;seau particuli&egrave;re.
	  Si vous devez r&eacute;f&eacute;rencer d'autres machines par leur nom
	  plut&ocirc;t que par leurs adresses IP, vous devrez aussi
	  conna&icirc;tre un serveur de noms et peut-&ecirc;tre l'adresse d'une
	  passerelle (si vous utilisez PPP, c'est l'adresse IP de votre
	  fournisseur d'acc&egrave;s) pour acc&eacute;der
	  &agrave; ce serveur.  Si vous voulez installer par FTP via un proxy
	  HTTP, vous aurez &eacute;galement besoin de l'adresse
	  du proxy.  Si vous n'avez pas les r&eacute;ponses &agrave; toutes
	  ou la plupart de ces questions, alors vous devriez vraiment en
	  discuter avec votre administrateur syst&egrave;me ou votre
	  fournisseur d'acc&egrave;s <emphasis>avant</emphasis> d'essayer ce
	  type d'installation.</para>

	<sect3>
	  <title>Avant d'installer par NFS</title>

    <indexterm>
      <primary>installation</primary>
      <secondary>r&eacute;seau</secondary>
      <tertiary>NFS</tertiary>
    </indexterm>
	  <para>L'installation NFS est assez directe.  Copiez simplement
	    les fichiers de la distribution FreeBSD que vous voulez
	    quelque part sur un serveur NFS et ensuite mentionnez-le
	    au moment de s&eacute;lectionner le support
	    NFS.</para>

	  <para>Si le serveur n'accepte que les acc&egrave;s sur les
	    &ldquo;ports privil&eacute;gi&eacute;s&rdquo; (ce qui est
	    g&eacute;n&eacute;ralement le
	    cas par d&eacute;faut sur les stations de travail Sun), vous devrez
	    le pr&eacute;ciser dans le menus des &ldquo;Options&rdquo; avant de
	    proc&eacute;der &agrave; l'installation.</para>

	  <para>Si vous avez une carte Ethernet de mauvaise qualit&eacute; qui
	    souffre de vitesses de transfert tr&egrave;s faibles, vous devrez
	    peut-&ecirc;tre aussi positionner l'indicateur appropri&eacute;
	    dans ce menu.</para>

	  <para>Pour que l'installation NFS fonctionne, le serveur doit
	    pouvoir monter des sous-r&eacute;pertoires, par exemple, si le
	    r&eacute;pertoire
	    pour votre distribution de FreeBSD&nbsp;&rel.current; est:
	    <filename>ziggy:/usr/archive/stuff/FreeBSD</filename>, alors
	    <hostid>ziggy</hostid> devra autoriser le montage de
	    <filename>/usr/archive/stuff/FreeBSD</filename>, et non
	    seulement de <filename>/usr</filename> ou
	    <filename>/usr/archive/stuff</filename>.</para>

	  <para>Dans le fichier <filename>/etc/exports</filename> de
	    FreeBSD, on contr&ocirc;le cela avec l'option
	    <option>-alldirs</option>.  D'autres serveurs NFS peuvent
	    avoir d'autres conventions.  Si le serveur vous envoie des
	    messages &ldquo;permission denied&rdquo;, alors il est
	    probable que vous n'avez pas activ&eacute; correctement cette
	    fonctionnalit&eacute;.</para>
	</sect3>

      </sect2>
  </sect1>
</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
