<!--
        The FreeBSD Documentation Project
        The FreeBSD French Documentation Project
         
        $FreeBSD$
        Original revision: n.nn
--> 

  <chapter id="install">
      <title>Installer FreeBSD</title>
      &trans.a.haby;
      
      <para>Donc, vous voulez tester FreeBSD sur votre nouvelle machine?
        Cette section vous donne rapidement toutes les indications pour le
        faire. FreeBSD peut &ecirc;tre install&eacute; &agrave; partir de diff&eacute;rents supports
        dont CD-ROM, disquettes, bande magn&eacute;tique, partition MS-DOS, et si vous
        avez une connexion r&eacute;seau, par ftp anonyme ou via NFS.</para>
      
      <para>Quelle que soit la fa&ccedil;on dons vous proc&eacute;derez, vous pouvez commencer
        par cr&eacute;er la <emphasis>disquette d'installation</emphasis>, comme 
        d&eacute;crit plus bas. D&eacute;marrez votre ordinateur avec cette disquette, m&ecirc;me 
        si vous ne voulez pas installer FreeBSD tout de suite, pour avoir des
        informations importantes sur la compatibilit&eacute; de votre mat&eacute;riel avec 
        FreeBSD, ce qui dictera quelles options d'installation vous pouvez 
        envisager. Cela peut aussi vous donner des indications quant aux 
        incompatibilit&eacute;s mat&eacute;rielles qui vous emp&ecirc;cheraient d'utiliser FreeBSD
        sur votre machine.</para>

    <para>Si vous envisagez une installation par ftp anonyme, alors cette
        disquette d'installation est tout ce que vous aurez besoin de
        t&eacute;l&eacute;charger et cr&eacute;er&nbsp;-&nbsp;le programme d'installation se
        chargera lui-m&ecirc;me de r&eacute;cup&eacute;rer tout ce qu'il faudra par la suite (via 
        une connexion Ethernet, un modem et une liaison ppp, etc.).</para>
      
      <para>Pour plus d'informations sur la mani&egrave;re de vous procurer la version
        la plus r&eacute;cente de FreeBSD, voyez s'il vous pla&icirc;t l'annexe
	<link linkend="mirrors">Se procurer FreeBSD</link>.</para>
      
      <para>Donc, pour pouvoir commencer &agrave; installer, suivez les &eacute;tapes
         ci-dessous:</para>
      
	<procedure>
	  
	  <step>
	    <para>Passez en revue la section <link 
              linkend="install-hw">Configurations support&eacute;es</link> de ce
              guide d'installation pour &ecirc;tre s&ucirc;r que votre mat&eacute;riel soit
              compatible avec FreeBSD. Il peut &ecirc;tre utile de faire une liste des
              cartes particuli&egrave;res que vous avez install&eacute;es, contr&ocirc;leurs SCSI,
              adaptateurs Ethernet ou cartes sons. Cette liste devra inclure
              les param&egrave;tres de configuration n&eacute;cessaires, tels que les 
              interruptions (IRQ) et les adresses des ports 
              d'Entr&eacute;e/Sortie.</para>
	  </step>
	  
	  <step>
	    <para>Si vous installez FreeBSD depuis le CD-ROM, vous avez 
              plusieurs options d'installation:</para>

	      <itemizedlist>
		
		<listitem>
		  <para>Si c'est un CD-ROM qui a &eacute;t&eacute; grav&eacute; avec le support de
                    d&eacute;marrage El Torrito et que votre syst&egrave;me peut d&eacute;marrer
                    &agrave; partir du CD-ROM (de nombreux syst&egrave;mes anciens ne savent
                    <emphasis>pas</emphasis> le faire), mettez simplement le 
                    CD dans le lecteur et d&eacute;marrez directement avec 
                    celui-ci.</para>
		</listitem>
		
		<listitem>
		  <para>Si vous &ecirc;tes sous DOS et avez le pilote n&eacute;cessaire pour
                    acc&eacute;der &agrave; votre CD-ROM, ex&eacute;cutez la proc&eacute;dure 
                    <command>install.bat</command>
                    qui se trouve sur le CD. Cela lancera l'installation de
                    FreeBSD &agrave; partir de DOS.</para>

		  <note>
		    <para>Vous devez faire cela r&eacute;ellement sous DOS et non dans
                      une fen&ecirc;tre DOS sous Windows.</para>
		  </note>

		  <para> Si vous voulez installer FreeBSD depuis une partition
                    DOS (peut-&ecirc;tre parce que FreeBSD ne supporte pas votre 
                    lecteur de CD-ROMs), lancez alors d'abord le programme
                    <command>setup</command> qui copiera les fichiers 
                    n&eacute;cessaires du CD sur la partition DOS, puis lancez ensuite
                    <command>install</command>.</para>
		</listitem>
		
		<listitem>
		  <para>Si l'une des deux m&eacute;thodes pr&eacute;c&eacute;dentes fonctionne, vous
                    pouvez sauter la suite de cette section, sinon, il vous
                    reste la possibilit&eacute; de cr&eacute;er une disquette de d&eacute;marrage
                    &agrave; partir du fichier image 
                    <filename>floppies\boot.flp</filename>&nbsp;-&nbsp;passez &agrave;
                    l'&eacute;tape 4 pour avoir des indications sur la fa&ccedil;on de
                    faire.</para>
		</listitem>
		
	      </itemizedlist>

	  </step>
	  
	  <step>
	    <para>Si vous n'avez pas la distribution sur CD-ROM, t&eacute;l&eacute;chargez
              simplement le fichier d'<ulink
		url="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/&rel.current;-RELEASE/floppies/boot.flp">image 
              de la disquette d&eacute;marrable d'installation</ulink> sur votre disque
              dur, en veillant &agrave; donner &agrave; votre navigateur l'option 
              <emphasis>enregistrer</emphasis> et non 
              <emphasis>ouvrir</emphasis> le fichier.</para>

	    <note>
	      <para>Cette image disquette ne fonctionne qu'avec des lecteurs de
                disquette 3.5" 1.44 Mo.</para>
	    </note>
	  </step>
	  
	  <step>
	    <para>Cr&eacute;ez une disquette de d&eacute;marrage de l'installation &agrave; partir
              du fichier image:</para>
	      <itemizedlist>
		
		<listitem>
		  <para>Si vous utilisez MS-DOS, t&eacute;l&eacute;chargez  <ulink
		      url="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/tools/fdimage.exe">fdimage.exe</ulink> 
                    ou r&eacute;cup&eacute;rez-le de <filename>tools\fdimage.exe</filename>
                    sur le CD-ROM et utilisez-le comme suit:</para>

		    <informalexample>
		      <screen><prompt>E:\&gt;</prompt> <userinput>tools\fdimage floppies\boot.flp a:</userinput></screen>
		    </informalexample>
	      <para>Le programme <emphasis>fdimage</emphasis>
		formatera la disquette dans le lecteur 
                <devicename>A:</devicename> et y copiera
                <filename>boot.flp</filename> (en supposant que vous &ecirc;tes dans
                le r&eacute;pertoire racine de la distribution de FreeBSD et que 
                l'image de la disquette se trouve dans le r&eacute;pertoire pour les 
                disquettes, ce qui est normalement le cas).</para>
		</listitem>
		
		<listitem>
		  <para>Si vous utilisez un syst&egrave;me UNIX pour cr&eacute;er la
		    disquette:</para>

		    <informalexample>
		      <screen>&prompt.root; <userinput>dd if=boot.flp of=<replaceable>p&eacute;riph&eacute;rique_disquette</replaceable></userinput></screen>
		    </informalexample>
	      <para><replaceable>p&eacute;riph&eacute;rique_disquette</replaceable> est
		    l'entr&eacute;e <filename>/dev</filename> pour le lecteur de
                    disquette. Sur les syst&egrave;mes FreeBSD, c'est
		    <filename>/dev/rfd0</filename> pour le lecteur
		    <devicename>A:</devicename> et
                    <filename>/dev/rfd1</filename> pour le lecteur
		    <devicename>B:</devicename>.</para>
		</listitem>
		
	      </itemizedlist>
	  </step>
	  
	  <step>
	    <para>Red&eacute;marrez l'ordinateur avec la disquette d'installation
              dans le lecteur <devicename>A:</devicename>. Vous devriez
              obtenir une invite de d&eacute;marrage du genre:</para>
	      <informalexample>
		<screen>
&gt;&gt; FreeBSD BOOT ...
Usage: [[[0:][wd](0,a)]/kernel][-abcCdhrsv]
Use 1:sd(0,a)kernel to boot sd0 if it is BIOS drive 1
Use ? for file list or press Enter for defaults
Boot:
		</screen>
	      </informalexample>
	  <para>Si vous ne tapez <emphasis>rien</emphasis>, FreeBSD d&eacute;marrera
            automatiquement avec la configuration par d&eacute;faut apr&egrave;s un d&eacute;lai
            d'environ 5 secondes. Au d&eacute;marrage, FreeBSD effectue des tests
            pour savoir quels mat&eacute;riels sont install&eacute;s. Les r&eacute;sultats de ces
            tests sont affich&eacute;s &agrave; l'&eacute;cran.</para>
	  </step>
	  
	  <step>
	    <para>Apr&egrave;s le d&eacute;marrage, le menu principal d'installation de
              FreeBSD s'affiche.</para>
	  </step>
	  
	</procedure>
      
      <para><emphasis>Si quelque chose se passe mal ...</emphasis></para>
      
      <para>Du fait des limitations de l'architecture PC, il n'est pas possible
        d'avoir des tests fiables &agrave; 100%. Si votre mat&eacute;riel n'est pas d&eacute;tect&eacute;
        correctement, ou si les tests plantent votre machine, consultez d'abord
        la section <link linkend="install-hw">Configurations
        support&eacute;es</link> de ce guide d'installation pour v&eacute;rifiez que votre
        mat&eacute;riel est effectivement compatible avec FreeBSD.</para>
      
      <para>Si votre mat&eacute;riel est support&eacute;, r&eacute;initialisez l'ordinateur et tapez
	<literal>-c</literal> quand l'invite <prompt>Boot:</prompt> s'affiche.
        FreeBSD passe alors en mode configuration, gr&acirc;ce auquel vous pouvez 
        donner des indications sur votre mat&eacute;riel. Le noyau FreeBSD de la
        disquette d'installation fait l'hypoth&egrave;se que la plupart des dispositifs
        mat&eacute;riels utilisent la configuration par d&eacute;faut du fabricant en termes 
        d'IRQ, adresses d'E/S et canaux DMA. Si vous avez reconfigur&eacute; votre
        mat&eacute;riel, il y a de fortes chances que vous devrez utiliser l'option
	<option>-c</option> au d&eacute;marrage pour dire &agrave; FreeBSD &agrave; quelle adresse se trouvent
	vos cartes.</para>
      
      <para>Il peut arriver que le test d'un mat&eacute;riel qui n'est pas install&eacute;
        entra&icirc;ne l'&eacute;chec du test ult&eacute;rieur d'un mat&eacute;riel qui lui est bien l&agrave;.
        Dans ce cas, le test du(des) pilote(s) en conflit doit &ecirc;tre 
        d&eacute;sactiv&eacute;.</para> 

    <warning>
      <para>Ne d&eacute;sactivez aucun des p&eacute;riph&eacute;riques dont vous aurez besoin 
        pendant l'installation, votre &eacute;cran (<devicename>sc0</devicename>)
        par exemple.</para>
    </warning>
      
      <para>En mode configuration, vous pouvez:</para>
      
	<itemizedlist>
	  
	  <listitem>
	    <para>Avoir la liste des pilotes de p&eacute;riph&eacute;riques inclus dans
              le noyau.</para>
	  </listitem>
	  
	  <listitem>
	    <para>D&eacute;sactiver les pilotes de p&eacute;riph&eacute;riques pour les mat&eacute;riels
              que vous n'avez pas.</para>
	  </listitem>
	  
	  <listitem>
	    <para>Changer les IRQs, DRQs, adresses des ports d'E/S utilis&eacute;es par
              un pilote de p&eacute;riph&eacute;rique.</para>
	  </listitem>
	  
	</itemizedlist>
      
      <para>Sous l'invite <prompt>config&gt;</prompt>, tapez
	<command>help</command> pour plus d'informations sur les commandes
        disponibles. Une fois que vous avez ajust&eacute; votre noyau pour qu'il
        configure correctement votre mat&eacute;riel, tapez <command>quit</command> &agrave;
        l'invite <prompt>config&gt;</prompt> pour continuer le processus de
        d&eacute;marrage avec la nouvelle configuration.</para>
      
      <para>Une fois FreeBSD install&eacute;, les modifications que vous avez fait en
        mode configuration seront d&eacute;finitives, vous n'aurez pas &agrave; reconfigurer
        le noyau &agrave; chaque red&eacute;marrage. Cependant, m&ecirc;me dans ce cas, il y a des
        chances que vous vouliez recompiler un noyau sur-mesure pour optimiser
        les performances de votre syst&egrave;me. Reportez-vous &agrave; la section 
	<link linkend="kernelconfig" >Configurer le noyau de FreeBSD</link> 
        pour plus d'informations sur la g&eacute;n&eacute;ration de noyaux sur-mesure.</para>
      
      <sect1 id="install-hw">
	<title>Configurations support&eacute;es</title>
	
	<para>FreeBSD fonctionne avec sur une grande vari&eacute;t&eacute; de PC &agrave; bus ISA, 
          VLB, EISA et PCI, en commen&ccedil;ant aux machines de classe 386sx (bien
          que le 386sx ne soit pas conseill&eacute;). Il y a un support g&eacute;n&eacute;rique pour
          les disques IDE et ESDI, et le support de divers contr&ocirc;leurs SCSI,
          cartes r&eacute;seau et s&eacute;rie, est aussi inclus.</para> 
	
	<para>Il faut un minimum de 4Mo de RAM pour faire tourner FreeBSD. Pour
          utiliser le gestionnaire graphique X Window System, un minimum de 8Mo 
          de RAM est recommand&eacute;.</para>
	
	<para>Voici une liste de contr&ocirc;leurs de disques et de cartes Ethernet
          qui fonctionnent actuellement avec FreeBSD. D'autres configurations
          peuvent parfaitement marcher, je n'ai simplement pas eu d'indications
          &agrave; leur sujet.</para>
	
	<sect2>
	  <title>Contr&ocirc;leurs de disque</title>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>WD1003 (n'importe quel MFM/RLL g&eacute;n&eacute;rique),</para>
	      </listitem>
	      
	      <listitem>
		<para>WD1007 (n'importe quel IDE/ESDI g&eacute;n&eacute;rique),</para>
	      </listitem>
	      
	      <listitem>
		<para>IDE,</para>
	      </listitem>
	      
	      <listitem>
		<para>ATA,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leur SCSI Adaptec 1505 ISA,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Adaptec ISA s&eacute;rie 152x,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Adaptec 1535 ISA,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Adaptec ISA s&eacute;rie 154x,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Adaptec EISA s&eacute;rie 174x en mode
                   standard et &eacute;tendu.</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Adaptec s&eacute;ries 274x/284x/2940/2940U/3940                   (Narrow/Wide/Twin) EISA/VLB/PCI,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs Adaptec SCSI AIC7850 sur la carte m&egrave;re,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cartes &agrave; base d'Adaptec, dont les cartes SCSI
		  AHA-152x et SoundBlaster,</para>

		<note>
		  <para>Vous ne pouvez pas d&eacute;marrer le syst&egrave;me avec les cartes
                    SoundBlaster car elles n'ont pas de BIOS int&eacute;gr&eacute;, qui est
                    indispensable pour affecter au p&eacute;riph&eacute;rique de d&eacute;marrage
                    les vecteurs d'E/S du BIOS syst&egrave;me. Elles sont cependant
                    parfaitement utilisables avec les lecteurs de bandes et de
                    CD-ROMs externes, etc. C'est aussi vrai des autres cartes &agrave;
                    base d'AIC-6x60 sans ROM de d&eacute;marrage. Certains syst&egrave;mes 
                    ont une ROM de d&eacute;marrage, ce qui est g&eacute;n&eacute;ralement signal&eacute;
                    par un message &agrave; la mise sous tension ou &agrave; la 
                    r&eacute;initialisation du syst&egrave;me. Consultez la documentation de
                    votre syst&egrave;me ou de votre carte pour plus de 
                    d&eacute;tails.</para>
		</note>
	      </listitem>
	      
	      <listitem>
		<para>Buslogic 545S &amp; 545c,</para>

		<note>
		  <para>Buslogic s'appelait autrefois 
                     &ldquo;Bustek&rdquo;,</para>
		</note>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Buslogic 445S/445c VLB,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Buslogic 742A/747S/747c EISA,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leur SCSI Buslogic 946c PCI,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leur SCSI Buslogic 956c PCI,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI NCR 
                  53C810/53C815/53C825/53C860/53C875 PCI,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI NCR5380/NCR53400 
                  (&ldquo;ProAudio Spectrum&rdquo;),</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leur SCSI DTC 3290 EISA en mode &eacute;mulation 
                  1542,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI UltraStor 14F/24F/34F,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Seagate ST01/02,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs SCSI Future Domain s&eacute;ries 8xx/950,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leur SCSI WD7000.</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  <para>Le support int&eacute;gral des p&eacute;riph&eacute;riques 
	    SCSI-I &amp; SCSI-II, y compris disques, lecteurs de bandes
	    (dont DAT) et lecteurs de CD-ROMs, est inclus pour tous les
            contr&ocirc;leurs SCSI support&eacute;s.</para>
	  
	  <para>Les lecteurs de CD-ROMs suivants sont actuellement 
	    support&eacute;s:</para>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>SoundBlaster SCSI et ProAudio Spectrum SCSI (<literal>cd</literal>),</para>
	      </listitem>
	      
	      <listitem>
		<para>Interface propri&eacute;taire Mitsumi (tous mod&egrave;les) (<literal>mcd</literal>),</para>
	      </listitem>
	      
	      <listitem>
		<para>Interface propri&eacute;taire Matsushita/Panasonic (Creative)
                  CR-562/CR-563 (<literal>matcd</literal>),</para>
	      </listitem>
	      
	      <listitem>
		<para>Interface propri&eacute;taire 
                  Sony(<literal>scd</literal>),</para>
	      </listitem>
	      
	      <listitem>
		<para>Interface ATAPI IDE (exp&eacute;rimentale et doit &ecirc;tre consid&eacute;r&eacute;e
		  de niveau ALPHA!) (<literal>wcd</literal>).</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	</sect2>
	
	<sect2 id="install-nics">
	  <title>Cartes Ethernet</title>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>Cartes Allied-Telesis AT1700 et RE2000,</para>
	      </listitem>
	      
	      <listitem>
		<para>Interface Ethernet SMC Elite 16 WD8013, et la plupart des
		  clones &agrave; base de WD8003E, WD8003EBT, WD8003W, WD8013W,
                  WD8003S, WD8003SBT et WD8013EBT. Les cartes &agrave; base de SMC 
                  Elite Ultra et 9432TX sont aussi support&eacute;es,</para>
	      </listitem>
	      
	      <listitem>
		<para>DEC EtherWORKS III NICs (&ldquo;<foreignphrase>Network 
                  Interface Card</foreignphrase>&rdquo;&nbsp;-&nbsp;carte 
                  d'interface r&eacute;seau) (DE203, DE204, et DE205),</para>
	      </listitem>
	      
	      <listitem>
		<para>DEC EtherWORKS II NICs (DE200, DE201, DE202, et
		  DE422),</para>
	      </listitem>
	      
	      <listitem>
		<para>NICs &agrave; base de DEC DC21040/DC21041/DC21140:</para>
		  <itemizedlist>
		    
		    <listitem>
		      <para>ASUS PCI-L101-TB,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Accton ENI1203,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Cogent EM960PCI,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Compex CPXPCI/32C,</para>
		    </listitem>
		    
		    <listitem>
		      <para>D-Link DE-530,</para>
		    </listitem>
		    
		    <listitem>
		      <para>DEC DE435,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Danpex EN-9400P3,</para>
		    </listitem>
		    
		    <listitem>
		      <para>JCIS Condor JC1260,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Kingston KNE100TX,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Linksys EtherPCI,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Mylex LNP101,</para>
		    </listitem>
		    
		    <listitem>
		      <para>SMC EtherPower 10/100 (Mod&egrave;le 9332),</para>
		    </listitem>
		    
		    <listitem>
		      <para>SMC EtherPower (Mod&egrave;le 8432),</para>
		    </listitem>
		    
		    <listitem>
		      <para>SMC EtherPower (2),</para>
		    </listitem>
		    
		    <listitem>
		      <para>Zynx ZX314,</para>
		    </listitem>
		    
		    <listitem>
		      <para>Zynx ZX342.</para>
		    </listitem>
		    
		  </itemizedlist>

	      </listitem>
	      
	      <listitem>
		<para>NICs DEC FDDI (DEFPA/DEFEA),</para>
	      </listitem>
	      
	      <listitem>
		<para>Fujitsu FMV-181 et FMV-182,</para>
	      </listitem>
	      
	      <listitem>
		<para>Fujitsu MB86960A/MB86965A,</para>
	      </listitem>
	      
	      <listitem>
		<para>Intel EtherExpress,</para>
	      </listitem>
	      
	      <listitem>
		<para>Intel EtherExpress Pro/100B 100Mbit,</para>
	      </listitem>
	      
	      <listitem>
		<para>Isolan AT 4141-0 (16 bit),</para>
	      </listitem>
	      
	      <listitem>
		<para>Isolink 4110 (8 bit),</para>
	      </listitem>
	      
	      <listitem>
		<para>Interface r&eacute;seau sans fil Lucent WaveLAN,</para>
	      </listitem>
	      
	      <listitem>
		<para>Interface Ethernet Novell NE1000, NE2000, et NE2100,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cartes 3Com 3C501,</para>
	      </listitem>
	      
	      <listitem>
		<para>3Com 3C503 Etherlink II,</para>
	      </listitem>
	      
	      <listitem>
		<para>3Com 3c505 Etherlink/+,</para>
	      </listitem>
	      
	      <listitem>
		<para>3Com 3C507 Etherlink 16/TP,</para>
	      </listitem>
	      
	      <listitem>
		<para>3Com 3C509, 3C579, 3C589 (PCMCIA) Etherlink III,</para>
	      </listitem>
	      
	      <listitem>
		<para>3Com 3C590, 3C595 Etherlink III,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cartes 3Com 3C90x,</para>
	      </listitem>
	      
	      <listitem>
		<para>HP PC Lan Plus (27247B et 27252A),</para>
	      </listitem>
	      
	      <listitem>
		<para>Cartes Ethernet Toshiba,</para>
	      </listitem>
	      
	      <listitem>
		<para>Les cartes Ethernet PCMCIA d'IBM et National
		  Semiconductor sont aussi support&eacute;es.</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  <note>
	    <para>FreeBSD ne supporte pas actuellement les fonctionnalit&eacute;s
	      PnP (<foreignphrase>plug-n-play</foreignphrase>) de
              certaines cartes Ethernet. Si votre carte est PnP et vous pose des
              probl&egrave;mes, essayez de d&eacute;sactiver ses fonctionnalit&eacute;s PnP.</para>
	  </note>
	</sect2>
	
	<sect2 id="install-misc">
	  <title>P&eacute;riph&eacute;riques divers</title>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>Carte AST 4 ports s&eacute;rie avec IRQ partag&eacute;e,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte ARNET 8 ports s&eacute;rie avec IRQ partag&eacute;e,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte BOCA IOAT66 6 ports s&eacute;rie avec IRQ partag&eacute;e,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte BOCA 2016 16 ports s&eacute;rie avec IRQ partag&eacute;e,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte s&eacute;rie Cyclades Cyclom-y,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte s&eacute;rie STB 4 ports avec IRQ partag&eacute;e,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte s&eacute;rie SDL Communications Riscom/8,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte s&eacute;rie synchrone SDL Communications RISCom/N2 et 
                  N2pci,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte s&eacute;rie synchrone grande vitesse Digiboard 
                  Sync/570i,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte Decision-Computer Intl. &ldquo;Eight-Serial&rdquo;
                  8 ports s&eacute;rie avec IRQ partag&eacute;e,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cartes sons Adlib, SoundBlaster, SoundBlaster Pro,
                  ProAudioSpectrum, Gravis UltraSound, Gravis UltraSound MAX 
                  et Roland MPU-401,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte d'acquisition vid&eacute;o Matrox Meteor,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte d'incrustation vid&eacute;o Creative Labs Video,</para>
	      </listitem>
	      
	      <listitem>
		<para>Carte d'acquisition vid&eacute;o Omnimedia Talisman,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cartes d'acquisition vid&eacute;o &agrave; base de puce Brooktree 
                  BT848,</para>
	      </listitem>
	      
	      <listitem>
		<para>Contr&ocirc;leurs d'alimentation X-10,</para>
	      </listitem>
	      
	      <listitem>
		<para>Manette de jeu et haut-parleur PC.</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  
	  <para>FreeBSD n'est pas actuellement compatible avec le bus
            IBM microchannel (MCA).</para>
	  
	</sect2>
      </sect1>
      
      <sect1>
	<title>Pr&eacute;parer l'installation</title>
	
	<para>Il y a un certain nombre de m&eacute;thodes pour installer FreeBSD. Les
          paragraphes qui suivent d&eacute;crivent ce qui doit &ecirc;tre fait dans chaque 
          cas.</para>
	
	<sect2>
	  <title>Avant d'installer &agrave; partir du CD-ROM</title>
	  
	  <para>Si votre lecteur de CD-ROMs n'est pas support&eacute;, passez s'il vous
            pla&icirc;t &agrave; la section <link linkend="install-msdos">Avant d'installer
            depuis une partition MS-DOS</link>.</para>
	  
	  <para>Il n'y a pratiquement rien &agrave; faire avant d'installer avec
            succ&eacute;s &agrave; partir des CD-ROMs FreeBSD de Walnut Creek (les CD-ROMs
            d'autres distributions marcheront sans doute aussi, bien que nous
            ne puissions l'affirmer, car nous n'intervenons en rien dans la
            fa&ccedil;on dont ils sont faits). Vous pouvez d&eacute;marrez l'installation
            par CD soit depuis DOS avec la proc&eacute;dure
	    <filename>install.bat</filename> de Walnut Creek ou vous pouvez
            cr&eacute;ez une disquette de d&eacute;marrage avec la commande
	    <filename>makeflp.bat</filename>.</para>

	  <note>
	    <para>Si vous utilisez FreeBSD 2.1-RELEASE et avez un CD-ROM IDE,
              servez-vous des proc&eacute;dures <filename>inst_ide.bat</filename> ou
              <filename>atapiflp.bat</filename> &agrave; la place.</para>
	  </note>
	  
	  <para>Pour avoir l'interface la plus facile &agrave; utiliser (sous DOS), 
            tapez <command>view</command>. Cela vous affichera un menu DOS
            qui vous guidera &agrave; travers toutes les options disponibles.</para>
	  
	  <para>Si vous cr&eacute;ez la disquette de d&eacute;marrage sur une machine UNIX, 
            voyez <link linkend="install">le d&eacute;but de ce guide</link> pour
            avoir des exemples sur la fa&ccedil;on de cr&eacute;er une disquette de
            d&eacute;marrage.</para>
	  
	  <para>Une fois que vous avez d&eacute;marr&eacute; sous DOS ou avec la disquette,
            vous devriez pouvoir s&eacute;lectionner le CD-ROM comme support 
            d'installation depuis le menu de s&eacute;lection du support. Vous n'aurez
            besoin de rien d'autre que du CD-ROM.</para>
	  
	  <para>Une fois que vous aurez termin&eacute; l'installation et red&eacute;marr&eacute;
            &agrave; partir du disque dur, vous pourrez monter quand vous voudrez le
            CD-ROM en tapant: <command>mount /cdrom</command></para>
	  
	  <para>Avant de sortir de nouveau le CD-ROM, notez qu'il faut d'abord
            taper: <command>umount /cdrom</command>. Ne le retirez pas 
	    simplement du lecteur!</para>
	  
	  <note>
	    <para>Avant de commencer l'installation, v&eacute;rifiez que le CD-ROM est
              bien dans le lecteur, sans quoi le test avant installation ne le
              trouvera pas. C'est aussi vrai si vous voulez, d&egrave;s l'installation,
              ajouter automatiquement le CD-ROM &agrave; la 
              configuration du syst&egrave;me (que vous vous en serviez comme support
              d'installation ou non).</para>
	  </note>
	  
	  <para>Finalement, si vous voulez que les gens puissent installer 
            FreeBSD par FTP directement depuis le CD-ROM de votre machine,
            c'est assez facile &agrave; mettre en oeuvre. Il vous suffit d'ajouter
            la ligne suivante au fichier de mots de passe (avec la commande
	    <command>vipw</command>):</para>
	  
	  <programlisting>
ftp:*:99:99::0:0:FTP:/cdrom:/nonexistent</programlisting>
	  
	  <para>Quiconque peut se connecter par le r&eacute;seau &agrave; votre machine (et
            est autoris&eacute; &agrave; y ouvrir une session) peut maintenant s&eacute;lectionner
            FTP comme support d'installation et taper:
	    <userinput>ftp://<replaceable>votre
		machine</replaceable></userinput> apr&egrave;s avoir s&eacute;lectionn&eacute;
            &ldquo;Other&rdquo;&nbsp;-&nbsp;autres&nbsp;-&nbsp; dans le menu
	    des sites ftp.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Avant d'installer &agrave; partir de disquettes</title>
	  
	  <para>Si vous devez installer &agrave; partir de disquettes, soit parce que
            vous avez du mat&eacute;riel non support&eacute;, soit que vous aimiez vous compliquer
	    la vie, vous devez d'abord pr&eacute;parer les disquettes 
            n&eacute;cessaires.</para>
	  
	  <para>Il vous faudra, au minimum, autant de disquettes 1.2MB ou 1.44MB
            que n&eacute;cessaires pour y mettre tous les fichiers du r&eacute;pertoire
	    <filename>bin</filename> (distribution binaire). Si vous pr&eacute;parez
            ces disquettes sous DOS, alors CES disquettes doit &ecirc;tre format&eacute;es
            avec la commande FORMAT de MS-DOS. Si vous utilisez Windows, 
            servez-vous de la commande de formatage du gestionnaire de fichiers
            de Windows.</para>
	  
	  <para>Ne faites <emphasis>pas</emphasis> confiance aux disquettes
            pr&eacute;format&eacute;es en usine. Reformattez-les vous-m&ecirc;me, de fa&ccedil;on &agrave; &ecirc;tre
            s&ucirc;r. Nos utilisateurs nous ont, dans le pass&eacute;, signal&eacute; de nombreux
            probl&egrave;mes dus &agrave; des disquettes incorrectement format&eacute;es, ce qui 
            explique pourquoi j'y insiste autant ici!</para>
	  
	  <para>Si vous cr&eacute;ez les disquettes sur une autre machine FreeBSD,
            ce n'est malgr&eacute; tout pas une mauvaise id&eacute;e de les formater bien
            que vous n'ayez pas besoin d'y mettre un syst&egrave;me de fichiers MS-DOS.
            Vous pouvez employer les commandes <command>disklabel</command> et 
            <command>newfs</command> pour y mettre un syst&egrave;me de fichiers UFS &agrave;
            la place, comme le montre la s&eacute;quence de commandes suivantes (pour 
            une disquette 3.5" 1.44MB):</para>
	  
	    <informalexample>
	      <screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440</userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/rfd0</userinput>
	      </screen>
	    </informalexample>
	  

	  <note>
	    <para>Utilisez <literal>fd0.1200</literal> et
	      <literal>floppy5</literal> pour les disquettes 5.25" 1.2MB.</para>
	  </note>
		  
	  <para>Vous pouvez alors les monter et y &eacute;crire comme sur n'importe
            quel autre syst&egrave;me de fichiers.</para>
	  
	  <para>Apr&egrave;s avoir format&eacute; les disquettes, il vous faudra y copier les
            fichiers. Les fichiers de la distribution sont scind&eacute;s en morceaux
            de taille telle que 5 d'entre eux tiennent sur une disquette 1.44MB
            ordinaire. Pr&eacute;parez les disquettes les unes apr&egrave;s les autres, y
            mettant sur chaque autant de fichiers que vous pouvez, jusqu'&agrave; ce
            que vous ayez recopi&eacute; toutes les distributions que vous voulez 
            installer. Chaque distribution doit avoir son propre sous-r&eacute;pertoire
            sur la disquette, e.g.: <filename>a:\bin\bin.aa</filename>,
	    <filename>a:\bin\bin.ab</filename>, et ainsi de suite.</para>
	  
	  <para>Une fois que vous en &ecirc;tes &agrave; l'&eacute;cran de s&eacute;lection du support
            d'installation, choisissez 
            &ldquo;Floppy&rdquo;&nbsp;-&nbsp;disquette&nbsp;-&nbsp;et vous 
            aurez ensuite des indications sur la marche &agrave; suivre.</para>
	  
	</sect2>
	
	<sect2 id="install-msdos">
	  <title>Avant d'installer depuis une partition MS-DOS</title>
	  
	  <para>Pour pr&eacute;parer l'installation depuis une partition MS-DOS, copiez
            les fichiers de la distribution dans un r&eacute;pertoire nomm&eacute;
	    <filename>C:\FREEBSD</filename>. L'arborescence des r&eacute;pertoires du
	    CD-ROM doit &ecirc;tre partiellement reproduite dans ce r&eacute;pertoire, je 
            vous sugg&egrave;re donc d'utiliser la commande DOS 
            <command>xcopy</command>.
	    Par exemple, pour pr&eacute;parer une installation minimale de
            FreeBSD:</para>

	    <informalexample>
	      <screen><prompt>C:\&gt;</prompt> <userinput>MD C:\FREEBSD</userinput>
<prompt>C:\&gt;</prompt> <userinput>XCOPY /S E:\BIN C:\FREEBSD\BIN\</userinput>
<prompt>C:\&gt;</prompt> <userinput>XCOPY /S E:\MANPAGES C:\FREEBSD\MANPAGES\</userinput></screen>
	    </informalexample>

	  <para>En supposant que vous ayez de la place sur 
            <devicename>C:</devicename> et que votre CD-ROM soit mont&eacute; sur
	    <devicename>E:</devicename>.</para>
	  
	  <para>Copiez chaque distribution que vous voulez installer depuis
            MS-DOS (et pour laquelle vous avez de la place libre) dans
	    <filename>C:\FREEBSD</filename>&nbsp;-&nbsp;la distribution
            <abbrev>BIN</abbrev> n'est que le minimum obligatoire.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Avant d'installer &agrave; partir de bandes QIC/SCSI</title>
	  
	  <para>Installer &agrave; partir de bandes est probablement la m&eacute;thode la plus
            simple, mis &agrave; part l'installation en ligne avec FTP ou depuis le 
            CD-ROM. Le programme d'installation s'attend &agrave; ce que les fichiers
            soient simplement archiv&eacute;s avec <command>tar</command> sur la bande,
            donc, apr&egrave;s avoir r&eacute;cup&eacute;r&eacute; tous les fichiers des distributions qui
            vous int&eacute;ressent, recopiez-les par <command>tar</command> avec une
            commande comme:</para>

	    <informalexample>
	      <screen>&prompt.root; <userinput>cd /freebsd/distdir</userinput>
&prompt.root; <userinput>tar cvf /dev/rwt0 dist1 ... dist2</userinput></screen>
	    </informalexample>

	  
	  <para>Quand vous installez, vous devez aussi vous assurer qu'il y a
            assez de place dans un r&eacute;pertoire temporaire (que vous pourrez
            choisir) pour y mettre le contenu <emphasis>entier</emphasis> de la
            bande que vous avez cr&eacute;&eacute;e. Vous devez donc vous attendre &agrave; avoir
            besoin d'autant d'espace de stockage temporaire que vous avez mis 
            de donn&eacute;es sur la bande.</para>
	  
	  <note>
	      <para>Au moment d'installer, la bande doit &ecirc;tre dans le lecteur
	      <emphasis>avant</emphasis> de d&eacute;marrer avec la disquette. Sinon,
              les tests risquent de ne pas la trouver.</para>
          </note>
	</sect2>
	
	<sect2>
	  <title>Avant d'installer via le r&eacute;seau</title>
	  
	  <para>Vous pouvez installer en r&eacute;seau avec trois sortes de 
	    communications:</para>
	  
	    <variablelist>
	      <varlistentry><term>Port s&eacute;rie:</term>
		<listitem>
		  <para>SLIP ou PPP,</para>
		  
		</listitem>
	      </varlistentry>
	      
	      <varlistentry><term>Port parall&egrave;le:</term>
		
		<listitem>
		  <para>PLIP (c&acirc;ble &ldquo;laplink&rdquo;),</para>
		  
		</listitem>
	      </varlistentry>
	      
	      <varlistentry><term>Ethernet:</term>
		
		<listitem>
		  <para>Contr&ocirc;leur Ethernet standard (y compris certains
		    contr&ocirc;leurs PCMCIA).</para>
		  
		</listitem>
	      </varlistentry>
	    </variablelist>
	  
	  <para>Le support SLIP est assez rudimentaire et essentiellement
            limit&eacute; aux lignes directes. Les liaisons doivent &ecirc;tre directes car
            la proc&eacute;dure d'installation SLIP n'offre pas actuellement de
            possibilit&eacute; de connexion t&eacute;l&eacute;phonique; cette fonctionnalit&eacute; existe 
            avec l'utilitaire PPP, qu'il faut utiliser de pr&eacute;f&eacute;rence &agrave; SLIP
            chaque fois que c'est possible.</para>
	  
	  <para>Si vous utilisez un modem, PPP est certainement votre seul 
            choix. Veillez &agrave; avoir sous la main les informations concernant
            votre fournisseur d'acc&egrave;s car vous en aurez besoin assez t&ocirc;t dans
            la proc&eacute;dure d'installation. Vous devrez savoir comment appeler
            votre fournisseur d'acc&egrave;s Internet en utilisant les &ldquo;commandes
            AT&rdquo; propres &agrave; votre modem, car le programme d'appel PPP ne
            fournit qu'un &eacute;mulateur de terminal tr&eacute;s simplifi&eacute;. Si vous utilisez
            PAP ou CHAP, vous devrez taper les commandes <command>set
	    authname</command> et <command>set authkey</command> avant de taper
            <command>term</command>. Reportez-vous aux sections concernant PPP
            int&eacute;gr&eacute; au noyau du <link linkend="userppp">manuel</link> ou de la
	    <ulink url="&url.faq;index.html">FAQ</ulink> 
            pour plus d'informations. Si vous avez des probl&egrave;mes, connectez-vous
            directement &agrave; l'&eacute;cran avec la commande <command>set log local 
            ...</command>.</para>
	  
	  <para>Si vous disposez d'une liaison directe &agrave; une autre machine 
            FreeBSD (2.0R ou ult&eacute;rieur), vous pouvez aussi envisager 
            l'installation avec un c&acirc;ble &ldquo;laplink&rdquo; sur le port
            parall&egrave;le, la vitesse de transmission est sup&eacute;rieure &agrave; celle que
            l'on obtient habituellement avec une liaison s&eacute;rie, ce qui acc&eacute;l&egrave;re
	    l'installation.</para>
	  
	  <para>Finalement, pour une installation en r&eacute;seau la plus rapide 
            possible, une carte Ethernet est toujours un bon choix! FreeBSD
            supporte la plupart des cartes Ethernet PC courantes. Il y a une
            liste des cartes Ethernet support&eacute;es (et du param&egrave;trage requis)
            &agrave; la section <link linkend="install-hw">Configurations 
            support&eacute;es</link>.
            Si vous utilisez l'une des cartes Ethernet PCMCIA suport&eacute;es, ayez
            soin de la mettre en place <emphasis>avant</emphasis> de mettre le 
            portable sous tension! FreeBSD ne supporte malheureusement pas 
            encore le branchement &agrave; chaud des cartes PCMCIA pendant 
            l'installation.</para> 
	  
	  <para>Vous devrez aussi conna&icirc;tre votre adresse IP sur le r&eacute;seau, le
            masque de r&eacute;seau pour votre classe d'adresses et le nom de votre
            machine. Votre administrateur syst&egrave;me peut vous dire quelles
            valeurs vous devez utiliser pour votre configuration r&eacute;seau
            particuli&egrave;re. Si vous devez r&eacute;f&eacute;rencer d'autres machines par leur
            nom plut&ocirc;t que par leurs adresses IP, vous devrez aussi conna&icirc;tre
            un serveur de noms et peut-&ecirc;tre l'adresse d'une passerelle (si vous
            utilisez PPP, c'est l'adresse IP de votre fournisseur d'acc&egrave;s) pour
            acc&egrave;der &agrave; ce serveur. Si vous n'avez pas les r&eacute;ponses &agrave; toutes ces
            questions, vous devriez vraiment en discuter 
            <emphasis>d'abord</emphasis> avec votre administrateur syst&egrave;me,
            avant de vous lancer dans ce type d'installation.</para>
	  
	  <para>Une fois que vous avez une liaison d'un type ou l'autre qui
            fonctionne, l'installation peut continuer avec NFS ou FTP.</para>
	  
	  <sect3>
	    <title>Pr&eacute;parer l'installation par NFS</title>
	    
	    <para>L'installation par NFS est assez directe: copiez simplement  
              les fichiers de la distribution de FreeBSD que vous voulez quelque
              part sur le serveur et mentionnez ce r&eacute;pertoire au moment de
              s&eacute;lectionner le support NFS.</para>
	    
	    <para>Si le serveur n'accepte que les acc&egrave;s sur les &ldquo;ports 
              privil&eacute;gi&eacute;s&rdquo; (ce qui est g&eacute;n&eacute;ralement par d&eacute;faut le cas sur
              les stations de travail Sun), vous devrez le pr&eacute;ciser dans le
              menus des &ldquo;Options&rdquo; pour que l'installation puisse 
              continuer.</para>
	    
	    <para>Si vous avez une carte Ethernet de mauvaise qualit&eacute; et des 
              vitesses de transfert tr&egrave;s faibles, vous devrez peut-&ecirc;tre aussi
              positionner l'indicateur appropri&eacute; dans ce menu.</para>
	    
	    <para>Pour que l'installation par NFS fonctionne, le serveur doit
              pouvoir monter des sous-r&eacute;pertoires, e.g., si le r&eacute;pertoire pour
              votre distribution de FreeBSD &rel.current; est
	      <filename>ziggy:/usr/archive/stuff/FreeBSD</filename>, alors 
              <hostid>ziggy</hostid> doit autoriser le montage de
	      <filename>/usr/archive/stuff/FreeBSD</filename>, et non simplement
	      de <filename>/usr</filename> ou
	      <filename>/usr/archive/stuff</filename>.</para>
	    
	    <para>Dans le fichier <filename>/etc/exports</filename> de FreeBSD,
              on l'autorise avec l'option <option>-alldirs</option>. Il peut y
              avoir d'autres conventions avec d'autres serveurs NFS. Si le 
              serveur vous envoie des messages 
	      <errortype>Permission Denied</errortype>, il est probable que 
              c'est parce que vous n'avez pas activ&eacute; correctemment cette
              fonctionnalit&eacute;.</para>
	    
	  </sect3>
	  
	  <sect3>
	    <title>Pr&eacute;parer l'Installation par FTP</title>
	    
	    <para>L'installation par FTP peut se faire &agrave; partir de n'importe 
              quel site miroir sur lequel il y a une version suffisamment
              &agrave; jour de FreeBSD &rel.current;. Le menu des sites FTP propose
              un choix raisonnable de sites pour &agrave; peu pr&egrave;s n'importe quel
              endroit du globe.</para>
	    
	    <para>Si vous voulez installer depuis une autre site FTP qui n'est 
              pas list&eacute; dans le menu, ou avez des difficult&eacute;s &agrave; configurer 
              correctement votre serveur de noms, vous pouvez aussi pr&eacute;ciser
              l'URL de votre choix en s&eacute;lectionnant l'option 
              &ldquo;Other&rdquo;&nbsp;-&nbsp;autre&nbsp;-&nbsp;de 
              ce menu. Vous pouvez aussi donner  
              directement l'adresse IP. Ceci par exemple fonctionnerait en 
              l'absence d'un serveur de noms:</para>
	    
	      <informalexample>
		<screen>ftp://165.113.121.81/pub/FreeBSD/&rel.current;-RELEASE</screen>
	      </informalexample>
	    
	    <para>Il y a deux m&eacute;thodes d'installation par FTP:</para>
	    
	      <variablelist>
		<varlistentry><term>FTP actif</term>
		  <listitem>
		    <para>Utilise le mode &ldquo;Actif&rdquo; pour tous les
                      transferts FTP. Cela ne 
                      marchera pas derri&egrave;re un coupe-feu, mais fonctionnera
                      avec les serveurs ftp anciens qui ne supportent pas
                      encore le mode passif. Si votre connexion se bloque
                      en mode passif (qui est le mode par d&eacute;faut), essayez cette
                      m&eacute;thode!</para>
		  </listitem>
		</varlistentry>
		
		<varlistentry><term>FTP passif</term>
		  
		  <listitem>
		    <para>Utilise le mode &ldquo;Passif&rdquo; pour tous les
                      transferts FTP. Cela permet de passer les coupe-feux qui
                      n'autorisent pas les connexions entrantes sur des ports
                      non privil&eacute;gi&eacute;s.</para>
		  </listitem>
		</varlistentry>
	      </variablelist>
	    
	    <note>
	      <para>Ne confondez pas mode actif et passif et connexion mandat&eacute;e,
                quand un serveur mandataire &eacute;coute et transmet les requ&ecirc;tes
                FTP!</para>
	    </note>
	    
	    <para>Avec un serveur FTP mandataire, vous devez habituellement
              donner le nom du serveur r&eacute;el accol&eacute; au nom d'utilisateur, apr&egrave;s
              une @. Le serveur mandataire passe alors pour le serveur r&eacute;el.
              Imaginons que vous vouliez installer depuis
	      <hostid role="fqdn">ftp.freebsd.org</hostid>, via le serveur FTP
	      mandataire <hostid role="fqdn">foo.bar.com</hostid>, qui &eacute;coute
              sur le port 1234.</para>
	    
	    <para>Dans ce cas, vous allez dans le menu des options, donnez comme
              nom d'utilisateur <username>ftp@ftp.freebsd.org</username>, et
              comme mot de passe votre adresse de courrier &eacute;lectronique. Comme
              support d'installation, vous pr&eacute;cisez FTP (ou FTP passif, si le
              serveur mandataire l'accepte) et comme URL 
              <literal>ftp://foo.bar.com:1234/pub/FreeBSD</literal>.</para>

	    <para><filename>/pub/FreeBSD</filename> sur
	      <hostid role="fqdn">ftp.freebsd.org</hostid> 
              est alors mandat&eacute; par
	      <hostid role="fqdn">foo.bar.com</hostid>, ce qui vous
              permet d'installer depuis <emphasis>cette</emphasis>
              machine (qui va elle chercher les fichiers sur
              <hostid role="fqdn">ftp.freebsd.org</hostid> au fur et &agrave; mesure
              des besoins de votre installation).</para>
	    
	  </sect3>
	</sect2>
      </sect1>
      
      <sect1>
	<title>Installer FreeBSD</title>
	
	<para>Une fois que vous avez &eacute;tabli quelles sont les &eacute;tapes 
          pr&eacute;liminaires appropri&eacute;es &agrave; votre m&eacute;thode
          d'installation, vous devriez arriver &agrave; installer FreeBSD sans autre probl&egrave;me.</para>
	
	<para>Dans le cas contraire, revenez sur vos pas et relisez les
          sections
          ci-dessus qui s'applique &agrave; la m&eacute;thode que vous essayer d'utiliser, il
          y a peut-&ecirc;tre une indication utile qui vous a &eacute;chapp&eacute; &agrave; la premi&egrave;re
          lecture. Si vous avez des probl&egrave;mes avec votre mat&eacute;riel ou si FreeBSD
          refuse de d&eacute;marrer, lisez le Guide du Mat&eacute;riel fourni sur la
          disquette de d&eacute;marrage pour avoir une liste de solutions 
          &eacute;ventuelles.</para>
	
	<para>La disquette de d&eacute;marrage de FreeBSD contient toute la
          documentation en ligne dont vous devriez avoir besoin pour 
          naviguer dans la proc&eacute;dure d'installation, et si tel n'est
          pas le cas, nous aimerions savoir ce que vous avez trouv&eacute; le
          moins clair. Adressez vos remarques &agrave; &a.doc;. Nous souhaitons
          que le programme d'installation de FreeBSD 
          (<command>sysinstall</command>) soit suffisamment auto-document&eacute;
          pour que les fastidieux guides d'installation &ldquo;pas-&agrave;-pas&rdquo;
          deviennent inutiles. Cela nous prendra peut-&ecirc;tre un peu de temps pour
          y arriver, mais c'est notre objectif!</para> 
	
	<para>En attendant, la &ldquo;s&eacute;quence typique d'installation 
          suivante&rdquo; vous sera peut-&ecirc;tre utile:</para>
	
	  <orderedlist>
	    
	    <listitem>
	      <para>D&eacute;marrez avec la disquette d'installation. Apr&egrave;s une 
               s&eacute;quence d'initialisation qui peut prendre de 30 secondes &agrave;
               3 minutes, selon votre mat&eacute;riel, vous devriez obtenir le 
               menu des choix initiaux. Si votre machine ne d&eacute;marre pas ou
               se bloque, lisez la section Questions &amp; R&eacute;ponses du Guide
               du Mat&eacute;riel pour en conna&icirc;tre les causes possibles.</para>
	    </listitem>
	    
	    <listitem>
	      <para>Appuyez sur F1. Vous devriez obtenir quelques indications de
                base sur l'utilisation du syst&egrave;me de menus et la fa&ccedil;on d'y
                naviguer. Si vous ne vous &ecirc;tes pas encore servi de ces menus,
                lisez <emphasis>s'il vous pla&icirc;t</emphasis> ces indications en 
                d&eacute;tail!</para>
	    </listitem>
	    
	    <listitem>
	      <para>S&eacute;lectionnez &ldquo;Options&rdquo; et d&eacute;finissez vos 
                pr&eacute;f&eacute;rences.</para>
	    </listitem>
	    
	    <listitem>
	      <para>Choisissez l'installation &ldquo;Novice&rdquo;, 
                &ldquo;Custom&rdquo;&nbsp;-&nbsp;personnalis&eacute;e&nbsp;-&nbsp;ou 
                &ldquo;Express&rdquo;, selon que vous pr&eacute;f&eacute;rez que la
                proc&eacute;dure d'installation vous guide au long des &eacute;tapes d'une
                installation typique, vous donne une grande latitude dans le 
                choix des &eacute;tapes successives, ou aille au plus rapide (en 
                utilisant des options par d&eacute;faut &agrave; chaque fois que c'est 
                possible). Si vous n'avez encore jamais utilis&eacute; FreeBSD,
                la m&eacute;thode d'installation &ldquo;Novice&rdquo; est vivement
                recommand&eacute;e.</para>
	    </listitem>
	    
	    <listitem>
	      <para>Le menu final vous permet de configurer encore un peu plus
                votre installation en vous donnant acc&egrave;s par menus &agrave; diverses
                options syst&egrave;me. Certains choix, comme ceux qui concernent le 
                r&eacute;seau, peuvent &ecirc;tre
                particuli&egrave;rement utiles si vous avez install&eacute; depuis le CD-ROM,
                une bande ou des disquettes et n'avez pas encore configur&eacute; vos
                interfaces r&eacute;seau (si vous en avez). Si vous les configurez
                maintenant correctement, votre machine FreeBSD sera sur le
                r&eacute;seau d&egrave;s le prochain red&eacute;marrage depuis le disque 
                dur.</para>
	    </listitem>
	    
	  </orderedlist>
	
      </sect1>
      
      <sect1>
	<title>Questions et R&eacute;ponses pour les utilisateurs MS-DOS</title>
	
	<para>De nombreux utilisateurs veulent installer FreeBSD sur des PCs
          qui fonctionnent sous MS-DOS. Voici quelques questions fr&eacute;quentes 
          concernant l'installation de FreeBSD sur de tels syst&egrave;mes.</para>
	
	<para><emphasis>A l'aide! Je n'ai plus de place! Faut-il que je 
          commence par tout effacer?</emphasis></para>
	
	<para>Si votre machine tourne d&eacute;j&agrave; sous MS-DOS et qu'il ne vous reste 
          que peu ou pas de place pour installer FreeBSD, tout n'est pas perdu! 
          L'utilitaire FIPS qui se trouve dans le r&eacute;pertoire 
	  <filename>tools</filename> du CDROM FreeBSD ou sur les diff&eacute;rents
          sites ftp vous sera probablement tr&egrave;s utile.</para>
	
	<para>FIPS vous permet de scinder en deux une partition MS-DOS 
          existante, sans alt&eacute;rer le contenu de la partition originale, pour
          installer ensuite FreeBSD sur la seconde partition ainsi cr&eacute;&eacute;e; Vous
          d&eacute;fragmentez d'abord votre partition MS-DOS, avec l'utilitaire DEFRAG
          de DOS 6.xx ou les utilitaires Disque de Norton, puis utilisez FIPS.
          Il vous demandera les autres informations dont il a besoin. Vous 
          pouvez ensuite red&eacute;marrer et installer sur la nouvelle 
          &ldquo;tranche&rdquo; libre.
          Voyez le menu <emphasis>Distributions</emphasis> pour avoir une 
          estimation de la place dont vous aurez besoin selon ce que vous 
          voulez installer.</para>
	
	<para><emphasis>Puis-je utiliser des syst&egrave;mes de fichiers MS-DOS 
          compress&eacute;s depuis FreeBSD?</emphasis></para>
	
	<para>Non. Si vous employez des utilitaires tels que Stacker(tm) ou
	  DoubleSpace(tm), FreeBSD ne pourra utiliser que la partie du syst&egrave;me 
          de fichiers que vous n'avez pas compress&eacute;e. Le reste appara&icirc;tra comme
          un seul gros fichier (le fichier empil&eacute;/r&eacute;duit). <emphasis>N'effacez
          pas ce fichier!</emphasis> Vous le regretteriez tr&egrave;s 
          certainement!</para>
	
	<para>Il est probablement mieux de cr&eacute;er une autre partition MS-DOS non
          compress&eacute;e et de l'utiliser pour les &eacute;changes entre MS-DOS et
	  FreeBSD.</para>
	
	<para><emphasis>Puis-je monter mes partitions MS-DOS
	  &eacute;tendues?</emphasis></para>
	
	<para>Oui. Les partitions DOS &eacute;tendues sont r&eacute;f&eacute;renc&eacute;es apr&egrave;s les autres
          &ldquo;tranches&rdquo; par FreeBSD, exemple: votre disque
          <devicename>D:</devicename> peut &ecirc;tre appel&eacute;
          <filename>/dev/sd0s5</filename>, et votre disque
	  <devicename>E:</devicename> <filename>/dev/sd0s6</filename>, et ainsi
          de suite. Nous supposons bien s&ucirc;r dans cet exemple que votre partition
          &eacute;tendue est sur le disque SCSI 0. Dans le cas des disques IDE,
          remplacez <filename>sd</filename> par la r&eacute;f&eacute;rence au disque
          <filename>wd</filename> appropri&eacute;e. A part cela, les partitions 
          &eacute;tendues se montent exactement comme toutes les autres partitions DOS,
	  e.g.:</para>
	
	<informalexample>
	  <screen>&prompt.root; <userinput>mount -t msdos /dev/sd0s5 /dos_d</userinput></screen>
	</informalexample>
	
	<para><emphasis>Puis-je utiliser des binaires MS-DOS sous
	    FreeBSD?</emphasis></para>
	
	<para>BSDI a l&eacute;gu&eacute; au monde BSD son &eacute;mulateur DOS, qui a &eacute;t&eacute; port&eacute; sous
	  FreeBSD.</para>
	
	<para>Il y a aussi une belle application (du point de vue technique)
          disponible au
	  <link linkend="ports">Catalogue des logiciels port&eacute;s</link>,
          qui s'appelle <command>pcemu</command> et qui vous permet d'utiliser
          nombre de programmes MS-DOS simples en mode texte en &eacute;mulant un
	  processeur 8088.</para>
	
      </sect1>
    </chapter>
    
<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-shorttag: nil
     sgml-always-quote-attributes: t
     sgml-minimize-attributes: max
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End:
-->

