Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/pr-guidelines/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: Problem Report Handling Guidelines
es_es: Guía para el manejo de informes de problemas
pt_br: Diretrizes para manuseio de relatórios de problemas

source: These guidelines describe recommended handling practices for FreeBSD Problem Reports (PRs). Whilst developed for the FreeBSD PR Database Maintenance Team <email>freebsd-bugbusters@FreeBSD.org</email>, these guidelines should be followed by anyone working with FreeBSD PRs.
es_es: Esta guía describe las prácticas recomendadas para manejar los informes de problemas (PRs) de FreeBSD. Aunque se desarrolló para el FreeBSD PR database maintenance team <email>freebsd-bugbusters@FreeBSD.org</email>, cualquiera que trabaje con PRs de FreeBSD debe seguir estas pautas.
pt_br: Estas diretrizes descrevem as práticas de manuseio recomendadas para os Relatórios de Problemas do FreeBSD (PRs). Embora desenvolvido para a equipe de manutenção de banco de dados do FreeBSD PR <email> freebsd-bugbusters@FreeBSD.org </email>, essas diretrizes devem ser seguidas por qualquer pessoa que trabalhe com os Relatórios de Problemas do FreeBSD.

source: Introduction
es_es: Introducción
pt_br: Introdução

source: Bugzilla is an issue management system used by the FreeBSD Project. As accurate tracking of outstanding software defects is important to FreeBSD's quality, the correct use of the software is essential to the forward progress of the Project.
es_es: Bugzilla es un sistema de gestión de errores que utiliza el proyecto FreeBSD. El seguimiento preciso de los defectos de software pendientes es importante para la calidad de FreeBSD. Del mismo modo, el uso correcto del software es esencial para el progreso del proyecto.
pt_br: O Bugzilla é um sistema de gerenciamento de problemas usado pelo Projeto FreeBSD. Como o rastreamento preciso de defeitos de software pendentes é importante para a qualidade do FreeBSD, o uso correto do software é essencial para o avanço do projeto.

source: Access to Bugzilla is available to the entire FreeBSD community. In order to maintain consistency within the database and provide a consistent user experience, guidelines have been established covering common aspects of bug management such as presenting followup, handling close requests, and so forth.
es_es: El acceso a Bugzilla está abierto a toda la comunidad de FreeBSD. Se han establecido ciertas pautas para cubrir aspectos comunes de la gestión de errores como la presentación del seguimiento, la gestión de solicitudes de cierre, etc con el fin de mantener la coherencia dentro de la base de datos y proporcionar una experiencia de usuario consistente.
pt_br: O acesso ao Bugzilla está disponível para toda a comunidade do FreeBSD. Para manter a consistência dentro do banco de dados e fornecer uma experiência de usuário consistente, diretrizes foram estabelecidas cobrindo aspectos comuns do gerenciamento de erros, como apresentação de acompanhamento, tratamento de solicitações de fechamento e assim por diante.

source: Problem Report Life-cycle
es_es: Ciclo de vida de un informe de problemas
pt_br: Ciclo de vida de um relatório de problemas

source: The Reporter submits a bug report on the website. The bug is in the <literal>Needs Triage</literal> state.
es_es: El usuario envía un informe de error al sitio web. El error está en el estado <literal>Needs Triage</literal>.
pt_br: O usuário envia um relatório de bug no site. O bug está no estado <literal> Needs Triage </literal>.

source: Jane Random BugBuster confirms that the bug report has sufficient information to be reproducible. If not, she goes back and forth with the reporter to obtain the needed information. At this point the bug is set to the <literal>Open</literal> state.
es_es: Jane Random BugBuster confirma que el error reportado contiene la suficiente información para ser reproducido. Si no, se interactuará repetidamente con el usuario hasta obtener la información necesaria. En este punto el error se establece en el estado <literal>Open</literal>.
pt_br: Jane Random BugBuster confirma que o relatório de erros tem informação suficiente para ser reproduzível. Se não, ela irá interagir repetidamente com o usuário para obter as informações necessárias. Neste ponto, o bug é definido para o estado <literal> Open </literal>.

source: Joe Random Committer takes interest in the PR and assigns it to himself, or Jane Random BugBuster decides that Joe is best suited to handle it and assigns it to him. The bug should be set to the <literal>In Discussion</literal> state.
es_es: Joe Random Committer se interesa por el PR y se lo asigna a si mismo, o Jane Random BugBuster decide que Joe es la persona más adecuada para resolver el problema y le asigna el error. El error se debe poner en el estado <literal>In Discussion</literal>.
pt_br: Joe Random Committer se interessa pelo PR e o atribui a si mesmo, ou Jane Random BugBuster decide que Joe é a pessoa mais adequada para lidar com o problema e atribui o bug a ele. O bug deve ser definido para o estado <literal> In Discussion </literal>.

source: Joe has a brief exchange with the originator (making sure it all goes into the audit trail) and determines the cause of the problem.
es_es: Joe tiene una breve conversación con el usuario que ha enviado el informe del problema (asegurándose de que todo queda registrado) y determina la causa.
pt_br: Joe tem uma breve troca com o usuário que originou o relatório de problema (certificando-se de que toda a comunicação ficou registrada na trilha de auditoria) e determina a causa do problema.

source: Joe pulls an all-nighter and whips up a patch that he thinks fixes the problem, and submits it in a follow-up, asking the originator to test it. He then sets the PRs state to <literal>Patch Ready</literal>.
es_es: Joe está toda la noche trabajando y elabora un parche que cree que soluciona el problema y lo envía en un follow-up, pidiéndole al usuario que lo ha reportado que lo pruebe. A continuación fija el estado del PR en <literal>Patch Ready</literal>.
pt_br: Joe vira a noite trabalhando e produz um patch que ele acha que corrige o problema, e o envia em um follow-up para o originador, pedindo que ele teste a solução. Em seguida, ele configura o estado do PR para <literal>Patch Ready</literal>.

source: A couple of iterations later, both Joe and the originator are satisfied with the patch, and Joe commits it to <literal>-CURRENT</literal> (or directly to <literal>-STABLE</literal> if the problem does not exist in <literal>-CURRENT</literal>), making sure to reference the Problem Report in his commit log (and credit the originator if they submitted all or part of the patch) and, if appropriate, start an MFC countdown. The bug is set to the <literal>Needs MFC</literal> state.
es_es: Un par de interaciones más tarde tanto Joe como el usuario que lo ha creado están satisfechos con el parche y Joe realiza el commit a <literal>-CURRENT</literal> (o directamente a <literal>-STABLE</literal> si el problema no existe en <literal>-CURRENT</literal>), asegurándose de hacer referencia al informe de problemas en su log del commit (y dando el crédito al usuario si envió todo o parte del parche) y, si corresponde, iniciará una cuenta atrás de MFC. El error se fija en el estado <literal>Needs MFC</literal>.
pt_br: Algumas iterações depois, Joe e o originador estão satisfeitos com o patch, e Joe faz o commit para o branch <literal>-CURRENT</literal> (ou diretamente para o branch <literal>-STABLE</literal> se o problema não existir no <literal>-CURRENT</literal>), certificando-se de fazer referencia ao Relatório de Problemas no seu log de commit (e dando o crédito ao originador caso ele tenha enviado o patch todo ou parte dele) e, se apropriado, iniciará uma contagem regressiva de MFC. O bug é então alterado para o estado <literal> Needs MFC </literal>.

source: If the patch does not need MFCing, Joe then closes the PR as <literal>Issue Resolved</literal>.
es_es: Si el parche no necesita pasar por un MFC Joe cierra el PR con el estado <literal>Issue Resolved</literal>.
pt_br: Se o patch não precisar de passar por um MFC, Joe então fecha o PR com o status <literal>Issue Resolved</literal>.

source: Many PRs are submitted with very little information about the problem, and some are either very complex to solve, or just scratch the surface of a larger problem; in these cases, it is very important to obtain all the necessary information needed to solve the problem. If the problem contained within cannot be solved, or has occurred again, it is necessary to re-open the PR.
es_es: Muchos PRs se envían con muy poca información sobre el problema y algunos son muy complejos de resolver, o simplemente arañan la superficie de un problema mayor; en estos casos es muy importante conseguir toda la información necesaria para resolver el problema. Si el problema no se puede resolver o si el problema se repite, es necesario volver a abrir el PR.
pt_br: Muitos PRs são submetidos contendo muito pouca informação sobre o problema, e alguns são muito complexos para resolver, ou apenas arranham a superfície de um problema maior; Nestes casos, é muito importante obter todas as informações necessárias para resolver o problema. Se o problema reportado não puder ser resolvido ou caso ele ocorra novamente, é necessário reabrir o PR.

source: Problem Report State
es_es: Estados de los informes de problemas
pt_br: Estado do relatório de problemas

source: It is important to update the state of a PR when certain actions are taken. The state should accurately reflect the current state of work on the PR.
es_es: Es importante actualizar el estado de un PR cuando se llevan a cabo ciertas acciones.
pt_br: É importante atualizar o status de um PR quando determinadas ações são tomadas. O status deve refletir com precisão o estado atual do trabalho no PR.

source: A small example on when to change PR state
es_es: Un ejemplo simple de cuándo cambiar el estado de un PR.
pt_br: Um pequeno exemplo sobre quando alterar o estado de PR

source: When a PR has been worked on and the developer(s) responsible feel comfortable about the fix, they will submit a followup to the PR and change its state to <quote>feedback</quote>. At this point, the originator should evaluate the fix in their context and respond indicating whether the defect has indeed been remedied.
es_es: Cuando un PR se haya gestionado y el/los desarrollador/es estén satisfechos con la solución se envia un follow-up al PR y su estado cambiará a <quote>feedback</quote>. En este punto el usuario que lo ha creado debe evaluar la solución en su contexto y responder indicando si el defecto ha sido solucionado.
pt_br: Quando um PR tiver sido tratado e o desenvolvedor responsável se sente confortável com a correção, ele enviará um follow up para o PR e mudará o seu estado para <quote>feedback</quote>. Neste ponto, o originador deve avaliar a correção em seu contexto e responder indicando se o defeito foi de fato remediado.

source: A Problem Report may be in one of the following states:
es_es: Un informe de problemas puede estar en uno de los siguientes estados:
pt_br: Um Relatório de Problemas pode estar em um dos seguintes estados:

source: Initial state; the problem has been pointed out and it needs reviewing.
es_es: Estado inicial: el problema ha sido reportado y necesita ser revisado.
pt_br: Estado inicial; o problema foi apontado e precisa ser revisto.

source: The problem has been reviewed and a solution is being sought.
es_es: El problema consta como revisado y se está buscando una solución.
pt_br: O problema foi revisto e uma solução está sendo procurada.

source: Further work requires additional information from the originator or the community; possibly information regarding the proposed solution.
es_es: Hay que realizar trabajos adicionales que requieren más información del usuario o de la comunidad; es posible que haga falta también más información sobre la solución propuesta.
pt_br: Trabalhos adicionais requerem informações adicionais do originador ou da comunidade; possivelmente informações sobre a solução proposta.

source: A patch has been committed, but something (MFC, or maybe confirmation from originator) is still pending.
es_es: Se ha realizado un commit con el parche, pero aún hay algo pendiente (MFC o tal vez confirmación del usuario que lo creó).
pt_br: Foi realizado o commit de um patch, mas algo (MFC, ou talvez confirmação do originador) ainda está pendente.

source: The problem is not being worked on, due to lack of information or resources. This is a prime candidate for somebody who is looking for a project to take on. If the problem cannot be solved at all, it will be closed, rather than suspended. The documentation project uses <quote>suspended</quote> for <quote>wish-list</quote> items that entail a significant amount of work which no one currently has time for.
es_es: No se está trabajando en el problema debido a la falta de información o recursos. Este es un candidato excelente para alguien que esté buscando un proyecto. Si el problema no se puede resolver se cerrará en lugar de suspenderse. El proyecto de documentación utiliza <quote>suspended</quote> para los elementos de la <quote>wish-list</quote> que implican una cantidad significativa de trabajo para el cual nadie dispone de tiempo.
pt_br: O problema não está sendo trabalhado, devido à falta de informações ou recursos. Este é um excelente candidato para alguém que está procurando um projeto para assumir. Se o problema não puder ser resolvido, ele será fechado, e não suspenso. O projeto de documentação usa <quote>suspended</quote> para itens da <quote>lista de desejos</quote> que envolvem uma quantidade significativa de trabalho para a qual ninguém tem tempo no momento.

source: A problem report is closed when any changes have been integrated, documented, and tested, or when fixing the problem is abandoned.
es_es: Un informe de problemas se cierra cuando se han integrado, documentado y probado los cambios o cuando se abandona la solución del problema.
pt_br: Um relatório de problemas é fechado quando as alterações referentes a ele tiverem sido integradas, documentadas e testadas ou, quando a correção do problema tiver sido abandonada.

source: The <quote>patched</quote> state is directly related to feedback, so you may go directly to <quote>closed</quote> state if the originator cannot test the patch, and it works in your own testing.
es_es: El estado <quote>patched</quote> está directamente relacionado con el feedback, por lo que puede ir directamente al estado <quote>closed</quote> si el usuario que lo creó no puede probar el parche y funciona en sus propias pruebas.
pt_br: O estado <quote>patched</quote> está diretamente relacionado ao feedback, então você pode passar direto para o estado de <quote>closed</quote> se o originador não puder testar o patch, e ele tiver funcionado no seu próprio teste.

source: Types of Problem Reports
es_es: Tipos de informes de problemas
pt_br: Tipos de relatórios de problemas

source: While handling problem reports, either as a developer who has direct access to the Problem Reports database or as a contributor who browses the database and submits followups with patches, comments, suggestions or change requests, you will come across several different types of PRs.
es_es: Al tratar con informes de problemas, ya sea como desarrollador que tiene acceso directo a la base de datos de informes de problemas o como colaborador que navega por la base de datos y envía follow-ups con parches, comentarios, sugerencias o solicitudes de cambio, va a encontrarse usted con distintos tipos de PRs.
pt_br: Ao lidar com relatórios de problemas, seja como um desenvolvedor que tenha acesso direto ao banco de dados de relatórios de problemas ou como colaborador que navega no banco de dados e envia followups com patches, comentários, sugestões ou solicitações de alteração, você vai encontrar vários tipos diferentes de PRs.

source: <link linkend="pr-unassigned">PRs not yet assigned to anyone.</link>
es_es: <link linkend="pr-unassigned">PRs que todavía no están asignados a nadie</link>
pt_br: <link linkend="pr-unassigned"> PRs que ainda não estão atribuídos para ninguém.</link>

source: <link linkend="pr-assigned">PRs already assigned to someone.</link>
es_es: <link linkend="pr-assigned">PRs asignados a alguien</link>
pt_br: <link linkend="pr-assigned"> PRs já atribuídos para alguém. </link>

source: <link linkend="pr-dups">Duplicates of existing PRs.</link>
es_es: <link linkend="pr-dups">Duplicados de PRs existentes</link>
pt_br: <link linkend="pr-dups">Duplicatas de PRs existentes.</link>

source: <link linkend="pr-stale">Stale PRs</link>
es_es: <link linkend="pr-stale">PRs obsoletos</link>
pt_br: <link linkend="pr-stale">PRs Obsoletos</link>

source: <link linkend="pr-misfiled-notpr">Non-Bug PRs</link>
es_es: <link linkend="pr-misfiled-notpr">PRs que no están relacionados con errores</link>
pt_br: <link linkend="pr-misfiled-notpr">PRs que não estão relacionados a bugs</link>

source: The following sections describe what each different type of PRs is used for, when a PR belongs to one of these types, and what treatment each different type receives.
es_es: Las siguientes secciones describen para qué se usa cada tipo de PRs, cuándo un PR pertenece a uno de estos tipos y qué tratamiento recibe cada tipo.
pt_br: As seções a seguir descrevem para que cada tipo diferente de PRs é usado, quando um PR pertence a um desses tipos e qual tratamento cada tipo diferente recebe.

source: Unassigned PRs
es_es: PRs sin asignar
pt_br: PRs não atribuídos

source: When PRs arrive, they are initially assigned to a generic (placeholder) assignee. These are always prepended with <literal>freebsd-</literal>. The exact value for this default depends on the category; in most cases, it corresponds to a specific FreeBSD mailing list. Here is the current list, with the most common ones listed first:
es_es: Cuando los PRs llegan se asignan en primer lugar a un responsable genérico (placeholder). Estos siempre tienen el prefijo <literal>freebsd-</literal>. El valor exacto para este patrón depende de la categoría. En la mayoría de los casos corresponde a una lista de correo específica de FreeBSD. Esta es una lista actualizada con los más comunes en primer lugar:
pt_br: Quando os PRs chegam, eles são inicialmente atribuídos a um responsável genérico (placeholder). Estes são sempre prefixados com <literal>freebsd-</literal>. O valor exato para esse padrão depende da categoria; na maioria dos casos, corresponde a uma lista de discussão específica do FreeBSD. Aqui está a lista atual, com os mais comuns listados primeiro:

source: Default Assignees — most common
es_es: Asignaciones predeterminadas — más comunes
pt_br: Responsáveis ​​Padrões - mais comuns

source: Type
es_es: Tipo
pt_br: Tipo

source: Categories
es_es: Categorías
pt_br: Categorias

source: Default Assignee
es_es: Asignación predeterminada
pt_br: Responsável Padrão

source: base system
es_es: sistema base
pt_br: sistema base

source: architecture-specific
es_es: arquitectura específica
pt_br: arquitetura específica

source: ports collection
es_es: colección de ports
pt_br: Coleção de Ports

source: documentation shipped with the system
es_es: documentación enviada junto con el sistema
pt_br: documentação enviada com o sistema

source: FreeBSD web pages (not including docs)
es_es: páginas web de FreeBSD (sin incluir docs)
pt_br: Páginas web do FreeBSD (não incluindo docs)

source: Website
es_es: sitio web

source: Default Assignees — other
es_es: Asignaciones predeterminadas — otros
pt_br: Responsável Padrão - outros

source: advocacy efforts
es_es: labores de promoción
pt_br: esforços de advocacia

source: advocacy
es_es: promoción
pt_br: advocacia

source: <trademark>Java Virtual Machine</trademark> problems
es_es: problemas con la <trademark>Java Virtual Machine</trademark>
pt_br: Problemas com <trademark>Java Virtual Machine</trademark>

source: standards compliance
es_es: cumplimiento de estándares
pt_br: conformidade com padrões

source: standards
es_es: estándares
pt_br: padrões

source: threading libraries
es_es: bibliotecas de threading
pt_br: bibliotecas de threading

source: <citerefentry><refentrytitle>usb</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem
es_es: subsistema <citerefentry><refentrytitle>usb</refentrytitle><manvolnum>4</manvolnum></citerefentry>
pt_br: Subsistema <citerefentry><refentrytitle>usb</refentrytitle><manvolnum>4</manvolnum></citerefentry>

source: Do not be surprised to find that the submitter of the PR has assigned it to the wrong category. If you fix the category, do not forget to fix the assignment as well. (In particular, our submitters seem to have a hard time understanding that just because their problem manifested on an i386 system, that it might be generic to all of FreeBSD, and thus be more appropriate for <literal>kern</literal>. The converse is also true, of course.)
es_es: Es bastante habitual que el usuario responsable del PR lo asigne a la categoría incorrecta. Si usted corrige la categoría recuerde por favor que hay que corregir también la asignación. Nuestros usuarios parecen tener dificultades en particular con el hecho de que aunque su problema ocurra en un sistema i386 podría afectar a todas las plataformas de FreeBSD y por lo tanto ser más adecuado para <literal>kern</literal>. Lo contrario también sucede, por supuesto.
pt_br: Não se surpreenda ao descobrir que o usuário responsável pelo PR atribuiu a categoria errada. Se você corrigir a categoria, não se esqueça de corrigir a atribuição também. (Em particular, nossos usuários parecem ter dificuldade em entender que apenas porque seu problema se manifesta em um sistema i386, que ele pode ser genérico para todo o FreeBSD, e assim ser mais apropriado para o <literal>kern</literal>. O oposto também é verdade, claro.)

source: Certain PRs may be reassigned away from these generic assignees by anyone. There are several types of assignees: specialized mailing lists; mail aliases (used for certain limited-interest items); and individuals.
es_es: Cualquiera puede reasignar estos PR de sus responsables genéricos a otra persona en grupo. Hay varios tipos de responsables: listas de correo especializadas, alias de correo (utilizados para asuntos muy específicos) de interés limitado) e individuos.
pt_br: Certos PRs podem ser reatribuídos para longe destes responsáveis genéricos por qualquer pessoa. Existem vários tipos de responsáveis: listas de discussão especializadas; aliases de correio (usados ​​para determinados itens de interesse limitado); e indivíduos.

source: For assignees which are mailing lists, please use the long form when making the assignment (e.g., <literal>freebsd-foo</literal> instead of <literal>foo</literal>); this will avoid duplicate emails sent to the mailing list.
es_es: Para los responsables que son listas de correo utilice la designación larga al realizar la asignación: por ejemplo, <literal>freebsd-foo</literal> en lugar de <literal>foo</literal>. Así evitará los correos electrónicos duplicados enviados a las listas de distribución.
pt_br: Para os responsáveis ​​que são listas de discussão, use o formulário longo ao fazer a atribuição (por exemplo, <literal>freebsd-foo</literal> em vez de <literal>foo</literal>); isso evitará emails duplicados enviados para a lista de discussão.
