Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/pr-guidelines/*.po
Languages: es_es, pt_br

source: Set the component to <literal>junk</literal> (under <literal>Supporting Services</literal>.
es_es: Establezca el componente en <literal>junk</literal> (en <literal>Supporting Services</literal>).
pt_br: Defina o componente como <literal>junk</literal> (em <literal>Supporting Services</literal>).

source: Set Responsible to <literal>nobody@FreeBSD.org</literal>.
es_es: Establezca como responsable a <literal>nobody@FreeBSD.org</literal>.
pt_br: Defina o responsável para <literal>nobody@FreeBSD.org</literal>.

source: Set State to <literal>Issue Resolved</literal>.
es_es: Establezca el estado en <literal>Issue Resolved</literal>.
pt_br: Defina o estado como <literal>Issue Resolved</literal>.

source: Setting the category to <literal>junk</literal> makes it obvious that there is no useful content within the PR, and helps to reduce the clutter within the main categories.
es_es: Establecer la categoría en <literal>junk</literal> indica que no hay contenido útil dentro del PR y ayuda a reducir el desorden en las categorías principales.
pt_br: Definir a categoria como <literal>junk</literal> torna óbvio que não há conteúdo útil dentro do PR e ajuda a reduzir a desordem nas categorias principais.

source: Further Reading
es_es: Lecturas adicionales
pt_br: Leitura Adicional

source: This is a list of resources relevant to the proper writing and processing of problem reports. It is by no means complete.
es_es: Esta es una lista de recursos relevantes para la correcta escritura y procesamiento de informes de problemas. De ninguna manera debe considerarse completa.
pt_br: Esta é uma lista de recursos relevantes para a escrita e processamento adequado de um relatório de problema. De forma alguma deve ser considerada completa.

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">How to Write FreeBSD Problem Reports</link>—guidelines for PR originators.
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/problem-reports/article.html">Cómo escribir informes de problemas para FreeBSD</link> — directrices para los usuarios que envían un PR.
pt_br: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">Como escrever relatórios de problemas para o FreeBSD</link> - diretrizes para usuários que enviam um PR.

source: $FreeBSD: head/en_US.ISO8859-1/articles/pr-guidelines/article.xml 51348 2017-12-30 22:56:56Z eadler $
pt_br: $FreeBSD$
