Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/pr-guidelines/*.po
Languages: es_es, pt_br

source: Since the list of individuals who have volunteered to be the default assignee for certain types of PRs changes so often, it is much more suitable for <link xlink:href="https://wiki.freebsd.org/AssigningPRs">the FreeBSD wiki</link>.
es_es: Como la lista de personas que se han ofrecido voluntarias para ser los responsables predeterminados para ciertos tipos de PRs cambia con bastante frecuencia es mucho más adecuado recurrir a la <link xlink:href="https://wiki.freebsd.org/AssigningPRs">wiki de FreeBSD</link>.
pt_br: Como a lista de indivíduos que se voluntariaram para ser o responsável padrão para certos tipos de PRs muda com bastante frequência, ela é muito mais adequada para o <link xlink:href="https://wiki.freebsd.org/AssigningPRs">the FreeBSD wiki</link>.

source: Here is a sample list of such entities; it is probably not complete.
es_es: A continuación hay un listado con ejemplos de dichas entidades. Es probable que el listado no sea exhaustivo.
pt_br: Aqui está uma lista de exemplo de tais entidades; provavelmente não está completa.

source: Common Assignees — base system
es_es: Responsables comunes — sistema base
pt_br: Responsáveis ​​Comuns - sistema base

source: Suggested Category
es_es: Categoría sugerida
pt_br: Categoria Sugerida

source: Suggested Assignee
es_es: Responsable sugerido
pt_br: Responsável Sugerido

source: Assignee Type
es_es: Tipo de responsable
pt_br: Tipo de Responsável

source: problem specific to the <trademark class="registered">ARM</trademark> architecture
es_es: problema específico de la arquitectura <trademark class="registered">ARM</trademark>.
pt_br: problema específico da arquitetura <trademark class="registered">ARM</trademark>

source: mailing list
es_es: lista de correo
pt_br: lista de discussão

source: problem specific to the <trademark class="registered">MIPS</trademark> architecture
es_es: problema específico de la arquitectura <trademark class="registered">MIPS</trademark>
pt_br: problema específico da arquitetura <trademark class="registered">MIPS</trademark>

source: problem specific to the <trademark class="registered">PowerPC</trademark> architecture
es_es: problema específico de la arquitectura <trademark class="registered">PowerPC</trademark>
pt_br: problema específico da arquitetura <trademark class="registered">PowerPC</trademark>

source: problem with Advanced Configuration and Power Management (<citerefentry><refentrytitle>acpi</refentrytitle><manvolnum>4</manvolnum></citerefentry>)
es_es: problema con la interfaz avanzada de configuración y energía (<citerefentry><refentrytitle>acpi</refentrytitle><manvolnum>4</manvolnum></citerefentry>)
pt_br: problema com Configuração Avançada e Gerenciamento de Energia (<citerefentry><refentrytitle>acpi</refentrytitle><manvolnum>4</manvolnum></citerefentry>)

source: problem with Asynchronous Transfer Mode (ATM) drivers
es_es: problema con los controladores del modo de transferencia asíncrono (ATM)
pt_br: problema com os drivers de modo de transferência assíncrona (ATM)

source: problem with embedded or small-footprint FreeBSD systems (e.g., NanoBSD/PicoBSD/FreeBSD-arm)
es_es: problemas con sistemas FreeBSD embebidos o de small-footprint (por ejemplo, NanoBSD/PicoBSD/FreeBSD-arm)
pt_br: problema com sistemas FreeBSD embarcados ou de small-footprint (por exemplo, NanoBSD/PicoBSD/FreeBSD-arm)

source: problem with <trademark class="registered">FireWire</trademark> drivers
es_es: problema con los controladores de <trademark class="registered">FireWire</trademark>
pt_br: problema com os drivers <trademark class="registered">FireWire</trademark>

source: problem with the filesystem code
es_es: problema con el código fuente del sistema de archivos
pt_br: problema com o código do sistema de arquivos

source: problem with the <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem
es_es: problema con el subsistema <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry>
pt_br: problema com o subsistema <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry>

source: problem with the <citerefentry><refentrytitle>ipfw</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem
es_es: problema con el subsistema <citerefentry><refentrytitle>ipfw</refentrytitle><manvolnum>4</manvolnum></citerefentry>
pt_br: problema com o subsistema <citerefentry><refentrytitle>ipfw</refentrytitle><manvolnum>4</manvolnum></citerefentry>

source: problem with Integrated Services Digital Network (ISDN) drivers
es_es: problema con los controladores de la red digital de servicios integrados (ISDN)
pt_br: problema com os drivers de rede digital de serviços integrados (ISDN)

source: <citerefentry><refentrytitle>jail</refentrytitle><manvolnum>8</manvolnum></citerefentry> subsystem
es_es: subsistema <citerefentry><refentrytitle>jail</refentrytitle><manvolnum>8</manvolnum></citerefentry>
pt_br: subsistema <citerefentry><refentrytitle>jail</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: problem with <trademark class="registered">Linux</trademark> or SVR4 emulation
es_es: problema con la emulación <trademark class="registered">Linux</trademark> o SVR4
pt_br: problema com a emulação <trademark class="registered">Linux</trademark> ou SVR4

source: problem with the networking stack
es_es: problema con el stack de red
pt_br: problema com a pilha de rede

source: problem with the <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem
es_es: problema con el subsistema <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>
pt_br: problema com o subsistema <citerefentry><refentrytitle>pf</refentrytitle><manvolnum>4</manvolnum></citerefentry>

source: problem with the <citerefentry><refentrytitle>scsi</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem
es_es: problema con el subsistema <citerefentry><refentrytitle>scsi</refentrytitle><manvolnum>4</manvolnum></citerefentry>
pt_br: problema com o subsistema <citerefentry> <refentrytitle>scsi</refentrytitle> <manvolnum> 4 </manvolnum> </citerefentry>

source: problem with the <citerefentry><refentrytitle>sound</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem
es_es: problema con el subsistema <citerefentry><refentrytitle>sound</refentrytitle><manvolnum>4</manvolnum></citerefentry>
pt_br: problema com o subsistema <citerefentry><refentrytitle>sound</refentrytitle> <manvolnum> 4 </manvolnum> </citerefentry>

source: problems with the <citerefentry><refentrytitle>wlan</refentrytitle><manvolnum>4</manvolnum></citerefentry> subsystem and wireless drivers
es_es: problema con el subsistema y controladores wireless <citerefentry><refentrytitle>wlan</refentrytitle><manvolnum>4</manvolnum></citerefentry>
pt_br: problemas com o subsistema <citerefentry> <refentrytitle>wlan</refentrytitle> <manvolnum> 4 </manvolnum> </citerefentry> e drivers sem fio

source: problem with <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> or <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>
es_es: problema con <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> o <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>
pt_br: problema com o <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> ou <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: problem with the system startup scripts (<citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>)
es_es: problema con los scripts de inicio del sistema (<citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>)
pt_br: problema com os scripts de inicialização do sistema (<citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>)

source: problem with VIMAGE or VNET functionality and related code
es_es: problema con la funcionalidad VIMAGE o VNET y el código relacionado
pt_br: problema com funcionalidade VIMAGE ou VNET e código relacionado

source: problem with Xen emulation
es_es: problema con la emulación de Xen
pt_br: problema com a emulação de Xen

source: Common Assignees — Ports Collection
es_es: Responsables comunes — coleción de ports
pt_br: Responsáveis Comuns - Ports Collection

source: problem with the ports framework (<emphasis>not</emphasis> with an individual port!)
es_es: problema con el framework de ports (¡<emphasis>no</emphasis> con un port en concreto!)
pt_br: problema com o framework da coleção de ports (<emphasis>não</emphasis> com um port individual!)

source: port which is maintained by apache@FreeBSD.org
es_es: port mantenido por apache@FreeBSD.org
pt_br: port que é mantido por apache@FreeBSD.org

source: port which is maintained by autotools@FreeBSD.org
es_es: port mantenido por autotools@FreeBSD.org
pt_br: port que é mantido por autotools@FreeBSD.org

source: port which is maintained by doceng@FreeBSD.org
es_es: port mantenido por doceng@FreeBSD.org
pt_br: port que é mantido por doceng@FreeBSD.org

source: port which is maintained by eclipse@FreeBSD.org
es_es: port mantenido por eclipse@FreeBSD.org
pt_br: port que é mantido por eclipse@FreeBSD.org

source: port which is maintained by gecko@FreeBSD.org
es_es: port mantenido por gecko@FreeBSD.org
pt_br: port que é mantido por gecko@FreeBSD.org

source: port which is maintained by gnome@FreeBSD.org
es_es: port mantenido por gnome@FreeBSD.org
pt_br: port que é mantido por gnome@FreeBSD.org

source: port which is maintained by hamradio@FreeBSD.org
es_es: port mantenido por hamradio@FreeBSD.org
pt_br: port que é mantido por hamradio@FreeBSD.org

source: port which is maintained by haskell@FreeBSD.org
es_es: port mantenido por haskell@FreeBSD.org
pt_br: port que é mantido por haskell@FreeBSD.org

source: port which is maintained by java@FreeBSD.org
es_es: port mantenido por java@FreeBSD.org
pt_br: port que é mantido por java@FreeBSD.org

source: port which is maintained by kde@FreeBSD.org
es_es: port mantenido por kde@FreeBSD.org
pt_br: port que é mantido por kde@FreeBSD.org

source: port which is maintained by mono@FreeBSD.org
es_es: port mantenido por mono@FreeBSD.org
pt_br: port que é mantido por mono@FreeBSD.org

source: port which is maintained by office@FreeBSD.org
es_es: port mantenido por office@FreeBSD.org
pt_br: port que é mantido por office@FreeBSD.org

source: port which is maintained by perl@FreeBSD.org
es_es: port mantenido por perl@FreeBSD.org
pt_br: port que é mantido por perl@FreeBSD.org

source: port which is maintained by python@FreeBSD.org
es_es: port mantenido por python@FreeBSD.org
pt_br: port que é mantido por python@FreeBSD.org

source: port which is maintained by ruby@FreeBSD.org
es_es: port mantenido por ruby@FreeBSD.org
pt_br: port que é mantido por ruby@FreeBSD.org

source: port which is maintained by secteam@FreeBSD.org
es_es: port mantenido por secteam@FreeBSD.org
pt_br: port que é mantido por secteam@FreeBSD.org

source: port which is maintained by vbox@FreeBSD.org
es_es: port mantenido por vbox@FreeBSD.org
pt_br: port que é mantido por vbox@FreeBSD.org

source: port which is maintained by x11@FreeBSD.org
es_es: port mantenido por x11@FreeBSD.org
pt_br: port que é mantido por x11@FreeBSD.org

source: Ports PRs which have a maintainer who is a ports committer may be reassigned by anyone (but note that not every FreeBSD committer is necessarily a ports committer, so you cannot simply go by the email address alone.)
es_es: Los PRs relacionados con los ports que tienen un maintainer que es a la vez un committer de ports pueden ser reasignados por cualquiera, pero es importante recordar que no todos los committers de FreeBSD tienen un commit bit de ports, por lo que no puede guiarse únicamente por la dirección de correo electrónico.
pt_br: Os PRs relacionados aos ports que têm um mantenedor que é um committer de ports podem ser reatribuídas por qualquer um (mas note que nem todo committer do FreeBSD é necessariamente um committer de ports, então você não pode simplesmente ir sozinho pelo endereço de email).

source: For other PRs, please do not reassign them to individuals (other than yourself) unless you are certain that the assignee really wants to track the PR. This will help to avoid the case where no one looks at fixing a particular problem because everyone assumes that the assignee is already working on it.
es_es: En el caso de otros PRs por favor no los reasigne a otros individuos (que no sean usted) a menos que esté seguro de que el responsable realmente quiere estar al tanto del PR. Esto ayudará a evitar situaciones en las que nadie se dedica a solucionar un problema en particular porque todo el mundo implicado asume que el responsable ya está en ello.
pt_br: Para outros PRs, por favor, não os reatribua para outros indivíduos (outros que não sejam você), a menos que tenha certeza de que o responsável realmente deseja acompanhar o PR. Isso ajudará a evitar situações em que ninguém se dedica para consertar um problema em particular, porque todos assumem que o responsável já está trabalhando nele.

source: Common Assignees — Other
es_es: Responsables comunes — otros
pt_br: Responsáveis ​​Comuns - Outros

source: problem with PR database
es_es: problema con la base de datos de PR
pt_br: problema com o banco de dados de PR

source: problem with Bugzilla <link xlink:href="https://bugs.freebsd.org/submit/">web form</link>.
es_es: problema con el <link xlink:href="https://bugs.freebsd.org/submit/">formulario web</link> de Bugzilla.
pt_br: problema com o <link xlink:href="https://bugs.freebsd.org/submit/">formulário web</link> do Bugzilla.

source: Assigned PRs
es_es: PRs asignados
pt_br: PRs Atribuídos

source: If a PR has the <literal>responsible</literal> field set to the username of a FreeBSD developer, it means that the PR has been handed over to that particular person for further work.
es_es: Si un PR tiene el campo <literal>responsible</literal> establecido con el nombre de usuario de un desarrollador de FreeBSD significa que el PR se ha entregado a esa persona en particular para que desarrolle sobre él trabajo adicional.
pt_br: Se um PR tiver o campo <literal>responsible</literal> configurado para o nome de usuário de um desenvolvedor do FreeBSD, isso significa que o PR foi entregue a essa pessoa em particular para trabalho adicional.

source: Assigned PRs should not be touched by anyone but the assignee or bugmeister. If you have comments, submit a followup. If for some reason you think the PR should change state or be reassigned, send a message to the assignee. If the assignee does not respond within two weeks, unassign the PR and do as you please.
es_es: Los PRs asignados no deben ser modificados por nadie más que el responsable o el bugmeister. Si tiene algún comentario que hacer al respecto envíe un follow-up. Si por algún motivo cree que el PR debe cambiar de estado o reasignarse envíe un mensaje al responsable. Si el responsable no responde en dos semanas anule la asignación del PR y haga lo que estime conveniente.
pt_br: PRs designados não devem ser tocados por ninguém além do responsável ou do bugmeister. Se você tiver comentários, envie um followup. Se, por algum motivo, você achar que o PR deve mudar de estado ou ser reatribuído, envie uma mensagem ao responsável. Se o responsável não responder dentro de duas semanas, cancele a atribuição do PR e faça o que quiser.

source: Duplicate PRs
es_es: PRs duplicados
pt_br: PRs Duplicados

source: If you find more than one PR that describe the same issue, choose the one that contains the largest amount of useful information and close the others, stating clearly the number of the superseding PR. If several PRs contain non-overlapping useful information, submit all the missing information to one in a followup, including references to the others; then close the other PRs (which are now completely superseded).
es_es: Si encuentra más de un PR que describe el mismo problema elija el que contiene la mayor cantidad de información útil y cierre los demás indicando claramente el número de PR sustituidos. Si varios PRs contienen información útil que no está repetida envíe toda la información restante en un follow-up, incluidas las referencias a los demás. Cierre después los otros PRs una vez hayan sido completamente reemplazados.
pt_br: Se você encontrar mais de um PR que descreva o mesmo problema, escolha aquele que contém a maior quantidade de informações úteis e feche os outros, indicando claramente o número do PR substituto. Se vários PRs contiverem informações úteis que não se sobrepõem, envie todas as informações ausentes para um para um deles por meio de um followup, incluindo referências aos outros; em seguida, feche os outros PRs (que agora estão completamente substituídos).

source: Stale PRs
es_es: PRs obsoletos
pt_br: PRs Obsoletos

source: A PR is considered stale if it has not been modified in more than six months. Apply the following procedure to deal with stale PRs:
es_es: Un PR se considera obsoleto si no ha sido modificado en más de seis meses. Siga el siguiente procedimiento para gestionar PRs obsoletos:
pt_br: Um PR é considerado obsoleto se não tiver sido modificado em mais de seis meses. Aplique o seguinte procedimento para lidar com PRs obsoletos:

source: If the PR contains sufficient detail, try to reproduce the problem in <literal>-CURRENT</literal> and <literal>-STABLE</literal>. If you succeed, submit a followup detailing your findings and try to find someone to assign it to. Set the state to <quote>analyzed</quote> if appropriate.
es_es: Si el PR contiene suficientes detalles intente reproducir el problema en <literal>-CURRENT</literal> y en <literal>-STABLE</literal>. Si logra reproducir el problema envíe un follow-up detallando sus hallazgos e intente encontrar a alguien a quien asignárselo. Establezca el estado en <quote>analyzed</quote> si ese es el caso.
pt_br: Se o PR contiver detalhes suficientes, tente reproduzir o problema no <literal>-CURRENT</literal> e no <literal>-STABLE</literal>. Se você tiver sucesso, envie um followup detalhando suas descobertas e tente encontrar alguém para atribuí-lo. Defina o estado para <quote>analyzed</quote>, se apropriado.

source: If the PR describes an issue which you know is the result of a usage error (incorrect configuration or otherwise), submit a followup explaining what the originator did wrong, then close the PR with the reason <quote>User error</quote> or <quote>Configuration error</quote>.
es_es: Si el PR describe un problema que sabe que es el resultado de un error de uso (configuración incorrecta o de otro tipo) envíe un follow-up que explique qué hizo mal el usuario. Más tarde cierre el PR con el motivo <quote>User error</quote> o <quote>Configuration error</quote>.
pt_br: Se o PR descrever um problema que você sabe ser o resultado de um erro de uso (configuração incorreta ou outra coisa do tipo), envie um followup explicando o que o originador fez de errado e feche o PR com o motivo <quote>User error</quote> ou <quote>Configuration error</quote>.

source: If the PR describes an error which you know has been corrected in both <literal>-CURRENT</literal> and <literal>-STABLE</literal>, close it with a message stating when it was fixed in each branch.
es_es: Si el PR describe un error que sabe que ha sido corregido tanto en <literal>-CURRENT</literal> como en <literal>-STABLE</literal> ciérrelo con un mensaje que indique cuándo se solucionó en cada rama.
pt_br: Se o PR descreve um erro que você sabe ter sido corrigido no <literal>-CURRENT</literal> e <literal>-STABLE</literal>, feche-o com uma mensagem informando quando ele foi corrigido em cada branch.

source: If the PR describes an error which you know has been corrected in <literal>-CURRENT</literal>, but not in <literal>-STABLE</literal>, try to find out when the person who corrected it is planning to MFC it, or try to find someone else (maybe yourself?) to do it. Set the state to <quote>patched</quote> and assign it to whomever will do the MFC.
es_es: Si el PR trata de un error que sabe que ha sido corregido en <literal>-CURRENT</literal> pero no en <literal>-STABLE</literal> intente averiguar cuándo espera la persona que lo corrigió ejecutar el MFC, o intente encontrar a alguien más (quizás usted mismo) que pueda hacerlo. Establezca el estado en <quote>patched</quote> y asígnelo a quien quiera que se haya encargado de hacer el MFC.
pt_br: Se o PR descreve um erro que você sabe ter sido corrigido no <literal>-CURRENT</literal>, mas não no <literal>-STABLE</literal>, tente descobrir quando a pessoa que o corrigiu está planejando o MFC ou tente encontrar alguém (talvez você?) para fazê-lo. Defina o estado para <quote>patched</quote> e atribua-o a quem quer que tenha ficado responsável por fazer o MFC.

source: In other cases, ask the originator to confirm if the problem still exists in newer versions. If the originator does not reply within a month, close the PR with the notation <quote>Feedback timeout</quote>.
es_es: En cualquier otro caso solicite al usuario que confirme si el problema persiste en las versiones más recientes. Si el usuario no responde en un mes cierre el PR con la anotación <quote>Feedback timeout</quote>.
pt_br: Em outros casos, peça ao originador para confirmar se o problema ainda existe em versões mais recentes. Se o originador não responder dentro de um mês, feche o PR com a notação <quote>Feedback timeout</quote>.

source: Non-Bug PRs
es_es: PRs sin errores
pt_br: PRs Sem Erros

source: Developers that come across PRs that look like they should have been posted to <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-bugs">freebsd-bugs</link> or some other list should close the PR, informing the submitter in a comment why this is not really a PR and where the message should be posted.
es_es: Los desarrolladores que encuentren PRs que han aparecido ya en <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-bugs">freebsd-bugs</link> o alguna otra lista deberían cerrar el PR informando al usuario en un comentario por qué el problema reportado no es realmente un PR y dónde debe publicarse el mensaje.
pt_br: Desenvolvedores que se deparem com PRs que na verdade deveriam ter sido postados na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-bugs">freebsd-bugs</link> ou em alguma outra lista deve fechar o PR, e informar o originador em um comentário do porque o problema reportado não é realmente um PR e orientá-lo sobre onde a mensagem deve ser postada.

source: The email addresses that Bugzilla listens to for incoming PRs have been published as part of the FreeBSD documentation, have been announced and listed on the web-site. This means that spammers found them.
es_es: Las direcciones de correo electrónico que utiliza Bugzilla para recibir los PR se publican en la documentación de FreeBSD y se anuncian y publican en el sitio web. Esto significa que los spammers ya las tienen.
pt_br: Os endereços de e-mail que o Bugzilla utiliza para receber os PRs foram publicados como parte da documentação do FreeBSD, e também foram anunciados e listados no website. Isso significa que os spammers os encontraram.

source: Whenever you close one of these PRs, please do the following:
es_es: Cuando cierre uno de estos PRs, haga lo siguiente:
pt_br: Sempre que você fechar um desses PRs, faça o seguinte:
