Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: There are several ways to connect a virtual machine guest to a host's network; one straightforward way to accomplish this is to create a [.filename]#tap# interface for the network device in the virtual machine to attach to. For the network device to participate in the network, also create a bridge interface containing the [.filename]#tap# interface and the physical interface as members. In this example, the physical interface is _igb0_:
ru: Существует несколько способов подключения гостевой виртуальной машины к сети хоста; один из простых способов — создать интерфейс [.filename]#tap#, к которому подключится сетевое устройство виртуальной машины. Чтобы сетевое устройство могло участвовать в сети, также необходимо создать мостовой интерфейс, включающий интерфейс [.filename]#tap# и физический интерфейс в качестве членов. В данном примере физический интерфейс — это _igb0_:

source: Creating a FreeBSD Guest
ko: FreeBSD 게스트 생성하기
ru: Создание гостевой системы FreeBSD

source: Create a file to use as the virtual disk for the guest machine. Specify the size and name of the virtual disk:
ko: 게스트 머신의 가상 디스크로 사용할 파일을 생성합니다. 가상 디스크의 크기와 이름을 지정합니다:
ru: Создайте файл, который будет использоваться как виртуальный диск для гостевой машины. Укажите размер и имя виртуального диска:

source: Download an installation image of FreeBSD to install:
ko: 설치할 FreeBSD의 설치 이미지를 다운로드합니다:
ru: Скачать образ установки FreeBSD для установки:

source: FreeBSD comes with an example script `vmrun.sh` for running a virtual machine in bhyve. It will start the virtual machine and run it in a loop, so it will automatically restart if it crashes. `vmrun.sh` takes several options to control the configuration of the machine, including:
ru: FreeBSD включает пример скрипта `vmrun.sh` для запуска виртуальной машины в bhyve. Он запускает виртуальную машину и выполняет её в цикле, поэтому она автоматически перезапустится в случае сбоя. `vmrun.sh` принимает несколько опций для управления конфигурацией машины, включая:

source: `-c` controls the number of virtual CPUs,
ru: `-c` управляет количеством виртуальных процессоров,

source: `-m` limits the amount of memory available to the guest,
ru: `-m` ограничивает объем памяти, доступной гостевой системе,

source: `-t` defines which [.filename]#tap# device to use,
ru: `-t` указывает, какой [.filename]#tap#-устройство использовать,

source: `-d` indicates which disk image to use,
ru: `-d` указывает, какой образ диска использовать,

source: `-i` tells bhyve to boot from the CD image instead of the disk, and
ru: `-i` указывает bhyve загружаться с образа CD вместо диска, и

source: `-I` defines which CD image to use.
ru: `-I` определяет, какой образ CD использовать.

source: The last parameter is the name of the virtual machine and is used to track the running machines. The following command lists all available program argument options:
ru: Последний параметр — это имя виртуальной машины, которое используется для отслеживания работающих машин. Следующая команда выводит список всех доступных аргументов программы:

source: This example starts the virtual machine in installation mode:
ru: Этот пример запускает виртуальную машину в режиме установки:

source: The virtual machine will boot and start the installer. After installing a system in the virtual machine, when the system asks about dropping into a shell at the end of the installation, choose btn:[Yes].
ru: Виртуальная машина загрузится и запустит установщик. После установки системы в виртуальной машине, когда система предложит перейти в оболочку в конце установки, выберите btn:[Да].

source: Reboot the virtual machine. While rebooting the virtual machine causes bhyve to exit, the [.filename]#vmrun.sh# script runs `bhyve` in a loop and will automatically restart it. When this happens, choose the reboot option from the boot loader menu to escape the loop. Now the guest can be started from the virtual disk:
ru: Перезагрузите виртуальную машину. Хотя перезагрузка виртуальной машины приводит к выходу из bhyve, скрипт [.filename]#vmrun.sh# запускает `bhyve` в цикле и автоматически перезапустит его. Когда это произойдет, выберите опцию перезагрузки в меню загрузчика, чтобы выйти из цикла. Теперь гостевую систему можно запустить с виртуального диска:

source: Creating a Linux(R) Guest
ko: Linux(R) 게스트 생성하기
ru: Создание гостевой системы Linux(R)

source: Linux guests can be booted either like any other regular crossref:virtualization[virtualization-bhyve-uefi,"UEFI-based guest"] virtual machine, or alternatively, you can make use of the package:sysutils/grub2-bhyve[] port.
ru: Гостевые системы Linux можно загружать как любую другую обычную виртуальную машину на основе crossref:virtualization[virtualization-bhyve-uefi,"UEFI"], либо, в качестве альтернативы, можно использовать порт package:sysutils/grub2-bhyve[].

source: To do this, first ensure that the port is installed, then create a file to use as the virtual disk for the guest machine:
ru: Для этого сначала убедитесь, что порт установлен, затем создайте файл, который будет использоваться как виртуальный диск для гостевой машины:

source: Starting a Linux virtual machine with `grub2-bhyve` is a two-step process.
ru: Запуск виртуальной машины Linux с `grub2-bhyve` — это двухэтапный процесс.

source: First a kernel must be loaded, then the guest can be started.
ru: Сначала необходимо загрузить ядро, затем можно запустить гостевую систему.

source: The Linux(R) kernel is loaded with package:sysutils/grub2-bhyve[].
ru: Ядро Linux(R) загружается с помощью пакета package:sysutils/grub2-bhyve[].

source: Create a [.filename]#device.map# that grub will use to map the virtual devices to the files on the host system:
ru: Создайте файл [.filename]#device.map#, который grub будет использовать для сопоставления виртуальных устройств с файлами в хостовой системе:

source: Use package:sysutils/grub2-bhyve[] to load the Linux(R) kernel from the ISO image:
ko: package:sysutils/grub2-bhyve[]를 사용하여 ISO 이미지에서 Linux(R) 커널을 로드합니다:
ru: Используйте package:sysutils/grub2-bhyve[] для загрузки ядра Linux(R) из образа ISO:

source: This will start grub. If the installation CD contains a [.filename]#grub.cfg#, a menu will be displayed. If not, the `vmlinuz` and `initrd` files must be located and loaded manually:
ko: 그러면 grub이 시작됩니다. 설치 CD에 [.filename]#grub.cfg#가 포함되어 있으면 메뉴가 표시됩니다. 그렇지 않은 경우 `vmlinuz` 및 `initrd` 파일을 찾아서 수동으로 로드해야 합니다:
ru: Это запустит grub. Если на установочном CD содержится файл [.filename]#grub.cfg#, будет отображено меню. Если нет, файлы `vmlinuz` и `initrd` необходимо найти и загрузить вручную:

source: Now that the Linux(R) kernel is loaded, the guest can be started:
ko: 이제 Linux(R) 커널이 로드되었으므로 게스트를 시작할 수 있습니다:
ru: Теперь, когда ядро Linux(R) загружено, можно запустить гостевую систему:

source: The system will boot and start the installer. After installing a system in the virtual machine, reboot the virtual machine. This will cause bhyve to exit. The instance of the virtual machine needs to be destroyed before it can be started again:
ko: 시스템이 부팅되고 설치 관리자가 시작됩니다. 가상 머신에 시스템을 설치한 후 가상 머신을 재부팅합니다. 그러면 bhyve가 종료됩니다. 가상 머신을 다시 시작하려면 가상 머신의 인스턴스를 파괴해야 합니다:
ru: Система загрузится и запустит установщик. После установки системы в виртуальной машине перезагрузите виртуальную машину. Это приведёт к завершению работы bhyve. Экземпляр виртуальной машины необходимо уничтожить перед тем, как его можно будет запустить снова:

source: Now the guest can be started directly from the virtual disk. Load the kernel:
ko: 이제 가상 디스크에서 바로 게스트를 시작할 수 있습니다. 커널을 로드합니다:
ru: Теперь гостевую систему можно запустить напрямую с виртуального диска. Загрузите ядро:

source: Boot the virtual machine:
ko: 가상 머신을 부팅합니다:
ru: Запустите виртуальную машину:

source: Linux(R) will now boot in the virtual machine and eventually present you with the login prompt. Login and use the virtual machine. When you are finished, reboot the virtual machine to exit bhyve. Destroy the virtual machine instance:
ko: 이제 Linux(R)가 가상 머신에서 부팅되고 로그인 프롬프트가 표시됩니다. 로그인하여 가상 머신을 사용합니다. 완료되면 가상 머신을 재부팅하여 bhyve를 종료합니다. 가상 머신 인스턴스를 삭제합니다:
ru: Linux(R) теперь загрузится в виртуальной машине и в конечном итоге покажет приглашение для входа. Войдите в систему и используйте виртуальную машину. Когда вы закончите, перезагрузите виртуальную машину для выхода из bhyve. Уничтожьте экземпляр виртуальной машины:

source: Booting bhyve Virtual Machines with UEFI Firmware
ko: UEFI 펌웨어로 bhyve 가상 머신 부팅하기
ru: Загрузка виртуальных машин bhyve с прошивкой UEFI

source: In addition to `bhyveload` and `grub-bhyve`, the bhyve hypervisor can also boot virtual machines using the UEFI firmware. This option may support guest operating systems that are not supported by the other loaders.
ru: В дополнение к `bhyveload` и `grub-bhyve`, гипервизор bhyve также может загружать виртуальные машины с использованием прошивки UEFI. Этот вариант может поддерживать гостевые операционные системы, которые не поддерживаются другими загрузчиками.

source: To make use of the UEFI support in bhyve, first obtain the UEFI firmware images. This can be done by installing package:sysutils/bhyve-firmware[] port or package.
ru: Чтобы использовать поддержку UEFI в bhyve, сначала получите образы прошивки UEFI. Это можно сделать, установив порт package:sysutils/bhyve-firmware[] или пакет.

source: With the firmware in place, add the flags `-l bootrom,_/path/to/firmware_` to your bhyve command line. The actual bhyve command may look like this:
ko: 펌웨어를 설치한 후, bhyve 명령줄에 `-l bootrom,_/path/to/firmware_` 플래그를 추가합니다. 실제 bhyve 명령은 다음과 같을 수 있습니다:
ru: Имея микропрограмму, добавьте флаги `-l bootrom,_/путь/к/микропрограмме_` в командную строку bhyve. Фактическая команда bhyve может выглядеть так:

source: To allow a guest to store UEFI variables, you can use a variables file appended to the `-l` flag. Note that bhyve will write guest modifications to the given variables file. Therefore, be sure to first create a per-guest-copy of the variables template file:
ru: Чтобы разрешить гостевой системе сохранять переменные UEFI, вы можете использовать файл переменных, указанный с флагом `-l`. Обратите внимание, что bhyve будет записывать изменения, внесённые гостевой системой, в указанный файл переменных. Поэтому убедитесь, что вы предварительно создали отдельную копию шаблонного файла переменных для каждой гостевой системы:

source: Then, add that variables file into your bhyve arguments:
ru: Затем добавьте этот файл переменных в аргументы bhyve:

source: Some Linux distributions require the use of UEFI variables to store the path for their UEFI boot file (using `linux64.efi` or `grubx64.efi` instead of `bootx64.efi`, for example). It is therefore recommended to use a variables file for Linux virtual machines to avoid having to manually alter the boot partition files.
ru: Некоторые дистрибутивы Linux требуют использования переменных UEFI для хранения пути к их загрузочному файлу UEFI (например, используют `linux64.efi` или `grubx64.efi` вместо `bootx64.efi`). Поэтому рекомендуется использовать файл переменных для виртуальных машин Linux, чтобы избежать необходимости вручную изменять файлы загрузочного раздела.

source: To view or modify the variables file contents, use man:efivar[8] from the host.
ru: Для просмотра или изменения содержимого файла переменных используйте man:efivar[8] с хоста.

source: package:sysutils/bhyve-firmware[] also contains a CSM-enabled firmware, to boot guests with no UEFI support in legacy BIOS mode:
ko: package:sysutils/bhyve-firmware[]에는 레거시 BIOS 모드에서 UEFI를 지원하지 않는 게스트를 부팅할 수 있는 CSM 지원 펌웨어도 포함되어 있습니다:
ru: package:sysutils/bhyve-firmware[] также содержит прошивку с поддержкой CSM для загрузки гостевых систем без поддержки UEFI в режиме устаревшего BIOS:

source: Graphical UEFI Framebuffer for bhyve Guests
ko: bhyve 게스트용 그래픽 UEFI 프레임 버퍼
ru: Графический UEFI фреймбуфер для гостевых систем bhyve

source: The UEFI firmware support is particularly useful with predominantly graphical guest operating systems such as Microsoft Windows(R).
ko: UEFI 펌웨어 지원은 Microsoft Windows(R)와 같은 그래픽 게스트 운영 체제를 주로 사용하는 경우에 특히 유용합니다.
ru: Поддержка микропрограммы UEFI особенно полезна для преимущественно графических гостевых операционных систем, таких как Microsoft Windows(R).

source: Support for the UEFI-GOP framebuffer may also be enabled with the `-s 29,fbuf,tcp=_0.0.0.0:5900_` flags. The framebuffer resolution may be configured with `w=_800_` and `h=_600_`, and bhyve can be instructed to wait for a VNC connection before booting the guest by adding `wait`. The framebuffer may be accessed from the host or over the network via the VNC protocol. Additionally, `-s 30,xhci,tablet` can be added to achieve precise mouse cursor synchronization with the host.
ko: 또한 `-s 29,fbuf,tcp=_0.0.0.0:5900_` 플래그를 사용하여 UEFI-GOP 프레임버퍼 지원을 활성화할 수도 있습니다. 프레임버퍼 해상도는 `w=_800_` 및 `h=_600_`으로 구성할 수 있으며, `wait`을 추가하여 게스트 부팅 전에 VNC 연결을 기다리도록 bhyve에 지시할 수 있습니다. 프레임버퍼는 호스트에서 또는 네트워크를 통해 VNC 프로토콜을 통해 액세스할 수 있습니다. 또한 `-s 30,xhci,tablet`을 추가하여 호스트와 정확한 마우스 커서 동기화를 달성할 수 있습니다.
ru: Поддержка фреймбуфера UEFI-GOP также может быть включена с помощью флагов `-s 29,fbuf,tcp=_0.0.0.0:5900_`. Разрешение фреймбуфера можно настроить с помощью параметров `w=_800_` и `h=_600_`, а также можно указать bhyve ожидать подключения VNC перед загрузкой гостевой системы, добавив `wait`. Доступ к фреймбуферу возможен с хоста или по сети через протокол VNC. Дополнительно можно добавить `-s 30,xhci,tablet` для точной синхронизации курсора мыши с хостом.

source: The resulting bhyve command would look like this:
ko: bhyve 명령의 결과는 다음과 같이 표시됩니다:
ru: Результирующая команда bhyve будет выглядеть так:

source: Note, in BIOS emulation mode, the framebuffer will cease receiving updates once control is passed from firmware to guest operating system.
ko: BIOS 에뮬레이션 모드에서는 제어권이 펌웨어에서 게스트 운영 체제로 넘어가면 프레임버퍼의 업데이트 수신이 중단됩니다.
ru: Заметим, что в режиме эмуляции BIOS обновление кадрового буфера прекращается после передачи управления от микропрограммы гостевой операционной системе.

source: Creating a Microsoft Windows(R) Guest
ru: Создание гостевой системы Microsoft Windows(R)

source: Setting up a guest for Windows versions 10 or earlier can be done directly from the original installation media and is a relatively straightforward process. Aside from minimum resource requirements, running Windows as guest requires
ru: Настройка гостевой системы для Windows версий 10 или более ранних может быть выполнена непосредственно с оригинального установочного носителя и является относительно простым процессом. Помимо минимальных требований к ресурсам, для работы Windows в качестве гостевой системы требуется

source: wiring virtual machine memory (flag `-w`) and
ru: привязка памяти виртуальной машины (флаг `-w`) и

source: booting with an UEFI bootrom.
ru: загрузка с загрузочной памяти (bootrom) UEFI.

source: An example for booting a virtual machine guest with a Windows installation ISO:
ru: Пример загрузки гостевой виртуальной машины с установочным ISO-образом Windows:

source: Only one or two VCPUs should be used during installation but this number can be increased once Windows is installed.
ru: Только один или два виртуальных процессора (VCPU) следует использовать во время установки, но их количество можно увеличить после установки Windows.

source: link:https://github.com/virtio-win/virtio-win-pkg-scripts/blob/master/README.md[VirtIO drivers] must be installed to use the defined `virtio-net` network interface. An alternative is to switch to E1000 (Intel E82545) emulation by changing `virtio-net` to `e1000` in the above command line. However, performance will be impacted.
ru: Для использования определенного сетевого интерфейса `virtio-net` необходимо установить link:https://github.com/virtio-win/virtio-win-pkg-scripts/blob/master/README.md[драйверы VirtIO]. Альтернативой является переключение на эмуляцию E1000 (Intel E82545) путем замены `virtio-net` на `e1000` в приведенной выше командной строке. Однако это повлияет на производительность.

source: Creating a Windows 11 Guest
ru: Создание гостевой системы Windows 11

source: Beginning with Windows 11, Microsoft introduced a hardware requirement for a TPM 2 module. bhyve supports passing a hardware TPM through to a guest. The installation media can be modified to disable the relevant hardware checks. A detailed description for this process can be found on the link:https://wiki.freebsd.org/bhyve/Windows#iso-remaster[FreeBSD Wiki].
ru: Начиная с Windows 11, Microsoft ввела требование к оборудованию в виде модуля TPM 2. bhyve поддерживает передачу аппаратного TPM гостевой системе. Установочный носитель можно модифицировать для отключения соответствующих проверок оборудования. Подробное описание этого процесса доступно по ссылке link:https://wiki.freebsd.org/bhyve/Windows#iso-remaster[FreeBSD Wiki].

source: Modifying Windows installation media and running Windows guests without a TPM module are unsupported by the manufacturer. Consider your application and use case before implementing such approaches.
ru: Изменение установочных носителей Windows и запуск гостевых систем Windows без модуля TPM не поддерживаются производителем. Учитывайте свои задачи и сценарии использования перед применением подобных методов.

source: Using ZFS with bhyve Guests
ko: bhyve 게스트에서 ZFS 사용하기
ru: Использование ZFS с гостевыми ВМ в bhyve

source: If ZFS is available on the host machine, using ZFS volumes instead of disk image files can provide significant performance benefits for the guest VMs. A ZFS volume can be created by:
ko: 호스트 머신에서 ZFS를 사용할 수 있는 경우 디스크 이미지 파일 대신 ZFS 볼륨을 사용하면 게스트 VM에 상당한 성능 이점을 제공할 수 있습니다. ZFS 볼륨은 다음과 같이 생성할 수 있습니다:
ru: Если на хост-машине доступен ZFS, использование томов ZFS вместо файлов образов дисков может обеспечить значительное повышение производительности для гостевых ВМ. Том ZFS можно создать следующим образом:

source: When starting the VM, specify the ZFS volume as the disk drive:
ko: VM을 시작할 때 ZFS 볼륨을 디스크 드라이브로 지정합니다:
ru: При запуске ВМ укажите том ZFS в качестве диска:

source: If you are using ZFS for the host as well as inside a guest, keep in mind the competing memory pressure of both systems caching the virtual machine's contents. To alleviate this, consider setting the host's ZFS filesystems to use metadata-only cache. To do this, apply the following settings to ZFS filesystems on the host, replacing `<name>` with the name of the specific zvol dataset name of the virtual machine.
ru: Если вы используете ZFS как на хосте, так и внутри гостевой системы, учитывайте конкуренцию за память из-за кэширования содержимого виртуальной машины обеими системами. Чтобы уменьшить эту нагрузку, рассмотрите возможность настройки файловых систем ZFS на хосте для использования кэширования только метаданных. Для этого примените следующие параметры к файловым системам ZFS на хосте, заменив `<name>` на имя конкретного zvol-набора данных виртуальной машины.

source: Creating a Virtual Machine Snapshot
ru: Создание снимка виртуальной машины

source: Modern hypervisors allow their users to create "snapshots" of their state; such a snapshot includes a guest's disk, CPU, and memory contents. A snapshot can usually be taken independent of whether the guest is running or shut down. One can then reset and return the virtual machine to the precise state when the snapshot was taken.
ru: Современные гипервизоры позволяют своим пользователям создавать "снимки" состояния; такой снимок включает в себя диск гостевой системы, содержимое процессора и памяти. Снимок обычно можно сделать независимо от того, работает гостевая система или выключена. Затем можно сбросить и вернуть виртуальную машину в точное состояние на момент создания снимка.

source: ZFS Snapshots
ru: ZFS Снимки

source: Using ZFS volumes as the backing storage for a virtual machine enables the snapshotting of the guest's disk. For example:
ru: Использование томов ZFS в качестве основного хранилища для виртуальной машины позволяет создавать снимки диска гостевой системы. Например:

source: Though it is possible to snapshot a ZFS volume this way while the guest is running, keep in mind that the contents of the virtual disk may be in an inconsistent state while the guest is active. It is therefore recommended to first shutdown or pause the guest before executing this command. Pausing a guest is not supported by default and needs to be enabled first (see crossref:virtualization[virtualization-bhyve-snapshot-builtin,Memory and CPU Snapshots])
ru: Хотя можно создать снимок ZFS тома таким образом, пока гостевая система работает, следует учитывать, что содержимое виртуального диска может находиться в несогласованном состоянии, пока гость активен. Поэтому рекомендуется сначала завершить работу или приостановить гостевую систему перед выполнением этой команды. Функция приостановки гостевой системы не поддерживается по умолчанию и должна быть сначала включена (см. crossref:virtualization[virtualization-bhyve-snapshot-builtin,Снимки памяти и процессора])

source: Rolling back a ZFS zvol to a snapshot while a virtual machine is using it may corrupt the file system contents and crash the guest. All unsaved data in the guest will be lost and modifications since the last snapshot may get destroyed.
ru: Откат ZFS zvol к снимку во время использования виртуальной машиной может повредить содержимое файловой системы и вызвать сбой гостевой ОС. Все несохранённые данные в гостевой системе будут потеряны, а изменения, сделанные после последнего снимка, могут быть уничтожены.

source: A second rollback may be required once the virtual machine is shut down to restore the file system to a useable state. This in turn will ultimately destroy any changes made after the snapshot.
ru: Повторный откат может потребоваться после выключения виртуальной машины, чтобы вернуть файловую систему в работоспособное состояние. Это, в свою очередь, окончательно уничтожит все изменения, сделанные после создания снимка.

source: Memory and CPU Snapshots (Experimental Feature)
ru: Снимки памяти и процессора (экспериментальная функция)

source: As of FreeBSD 13, bhyve has an experimental "snapshot" feature for dumping a guest's memory and CPU state to a file and then halting the virtual machine. The guest can be resumed from the snapshot file contents later.
ru: Начиная с FreeBSD 13, bhyve имеет экспериментальную функцию "snapshot" для сохранения состояния памяти и процессора гостевой системы в файл с последующей остановкой виртуальной машины. Гостевая система может быть возобновлена из содержимого файла снимка позже.

source: However, this feature is not enabled by default and requires the system to be rebuilt from source. See crossref:cutting-edge[updating-src-building, Building from Source] for an in-depth description on the process of compiling the kernel with custom options.
ru: Однако эта функция не включена по умолчанию и требует пересборки системы из исходного кода. Подробное описание процесса компиляции ядра с пользовательскими настройками приведено в crossref:cutting-edge[updating-src-building, Сборка из исходного кода].

source: The functionality is not ready for production use and limited to work for specific virtual machine configurations. There are multiple limitations:
ru: Функциональность не готова для промышленного использования и ограничена работой с определёнными конфигурациями виртуальных машин. Существует несколько ограничений:

source: `nvme` and `virtio-blk` storage backends do not work yet
ru: `nvme` и `virtio-blk` бэкенды хранения пока не работают
