Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: If the system is halted at the OpenBios console prompt `0 >`, enter `power-off` to exit the system.
ru: Если система остановлена на приглашении консоли OpenBios `0 >`, введите `power-off`, чтобы завершить работу системы.

source: crossref:virtualization[qemu-sparc64-login-to-installed-system,Figure {counter:figure}] shows a root login to the installed system and running man:uname[1].
ru: На crossref:virtualization[qemu-sparc64-login-to-installed-system,рисунке {counter:figure}] показан вход в систему от имени root в установленной системе и выполнение man:uname[1].

source: QEMU Booting from CDROM During User Mode Emulation
ru: QEMU Загрузка с CDROM с эмуляцией пользовательского режима

source: Using the QEMU Monitor
ru: Использование монитора QEMU

source: The link:https://www.qemu.org/docs/master/system/monitor.html[QEMU monitor] controls a running QEMU emulator (guest VM).
ru: link:https://www.qemu.org/docs/master/system/monitor.html[Монитор QEMU] управляет работающим эмулятором QEMU (гостевой виртуальной машиной).

source: Using the monitor, it is possible to:
ru: Используя монитор, можно:

source: Dynamically remove or insert devices, including disks, network interfaces, CD-ROMs, or floppies
ru: Динамически удалять или добавлять устройства, включая диски, сетевые интерфейсы, CD-ROM или дисководы гибких дисков

source: Freeze/unfreeze the guest VM, and save or restore its state from a disk file
ru: Заморозить/разморозить гостевую ВМ и сохранить или восстановить её состояние из файла на диске

source: Gather information about the state of the VM and devices
ru: Собрать информацию о состоянии ВМ и устройств

source: Change device settings on the fly
ru: Изменить настройки устройств на лету

source: As well as many other operations.
ru: А также сделать множество других операций.

source: The most common uses of the monitor are to examine the state of the VM, and to add, delete, or change devices. Some operations such as migrations are only available under hypervisor accelerators such as KVM, Xen, etc. and are not supported on FreeBSD hosts.
ru: Наиболее распространённые способы использования монитора — это проверка состояния виртуальной машины, а также добавление, удаление или изменение устройств. Некоторые операции, такие как миграция, доступны только при использовании гипервизоров с ускорением, например KVM, Xen и т.д., и не поддерживаются на хостах FreeBSD.

source: When using a graphical desktop environment, the simplest way to use the QEMU monitor is the `-monitor stdio` option when launching QEMU from a terminal session.
ru: При использовании графической среды рабочего стола самый простой способ доступа к монитору QEMU — это опция `-monitor stdio` при запуске QEMU из терминала.

source: This results in a new prompt `(qemu)` in the terminal window as shown in crossref:virtualization[qemu-monitor-operation,Figure {counter:figure}].
ru: Это приводит к появлению новой строки приглашения `(qemu)` в окне терминала, как показано на crossref:virtualization[qemu-monitor-operation,рисунке {counter:figure}].

source: QEMU Monitor Prompt and "stop" Command
ru: Приглашение монитора QEMU и команда "stop"

source: The image also shows the `stop` command freezing the system during the FreeBSD boot sequence. The system will remain frozen until the `cont` command is entered in the monitor.
ru: На изображении также показано, что команда `stop` замораживает систему во время последовательности загрузки FreeBSD. Система останется замороженной до тех пор, пока в мониторе не будет введена команда `cont`.

source: Adding a New Disk to the VM
ru: Добавление нового диска в виртуальную машину

source: To add a new disk to a running VM, the disk needs to be prepared as above:
ru: Чтобы добавить новый диск к работающей виртуальной машине, его необходимо подготовить, как описано выше:

source: crossref:virtualization[qemu-add-new-disk-figure,Figure {counter:figure}] shows the monitor command sequence needed to add a new disk in the VM. Once the device has been added with the `device_add` command in the monitor it shows up on the FreeBSD system console shown in the lower part of the figure. The disk can be configured as needed.
ru: crossref:virtualization[qemu-add-new-disk-figure,Рисунок {counter:figure}] показывает последовательность команд в мониторе, необходимую для добавления нового диска в виртуальную машину. После добавления устройства с помощью команды `device_add` в мониторе оно появляется на консоли системы FreeBSD, как показано в нижней части рисунка. Диск можно настроить по необходимости.

source: Note that the new disk must be added to the startup script if it is to be used after a VM reboot.
ru: Обратите внимание, что новый диск должен быть добавлен в стартовый скрипт, если он будет использоваться после перезагрузки виртуальной машины.

source: QEMU Monitor Commands to Add a New Disk
ru: Команды монитора QEMU для добавления нового диска

source: Using the QEMU Monitor to Manage Snapshots
ru: Использование монитора QEMU для управления снимками

source: QEMU's documentation describes several similar concepts when using the term *snapshot*. There is the `-snapshot` option on the command line which refers to using a drive or portion of a drive to contain a copy of a device. Then there are the monitor commands `snapshot_blkdev` and `snapshot_blkdev_internal` which describe the actual act of copying the blockdev device. Finally, there are the monitor commands `savevm`, `loadvm`, and `delvm` commands which refer to creating and saving, loading, or deleting a copy of an entire virtual machine. Along with the latter, the monitor `info snapshots` command lists out details of recent snapshots.
ru: Документация QEMU описывает несколько схожих концепций, используя термин *снимок (snapshot)*. Существует опция `-snapshot` в командной строке, которая означает использование диска или его части для хранения копии устройства. Также есть команды монитора `snapshot_blkdev` и `snapshot_blkdev_internal`, описывающие сам процесс копирования блочного устройства. Наконец, команды монитора `savevm`, `loadvm` и `delvm` относятся к созданию, сохранению, загрузке или удалению копии всей виртуальной машины. Вместе с последними, команда монитора `info snapshots` выводит детали недавних снимков состояния.

source: This section will focus on creating, saving, and loading a complete VM image and will use the term *snapshot* for this purpose.
ru: Этот раздел посвящён созданию, сохранению и загрузке полного образа ВМ и использует термин *снимок* для этой цели.

source: To start, recreate the "left" VM from scratch, this time using the `qcow2` format.
ru: Для начала заново создайте виртуальную машину "left", на этот раз используя формат `qcow2`.

source: Once the installation is complete, reboot, this time using the `-monitor stdio` option to allow use of the monitor.
ru: После завершения установки перезагрузите систему, на этот раз с использованием опции `-monitor stdio`, чтобы обеспечить доступ к монитору.

source: To demonstrate snapshots, the following procedure can be used:
ru: Для демонстрации работы снимков можно использовать следующую процедуру:

source: Install FreeBSD from scratch
ru: Установите FreeBSD с нуля

source: Prepare the environment and take a snapshot with the `savevm` monitor command
ru: Подготовьте окружение и создайте снимок состояния с помощью команды монитора `savevm`

source: Install several packages
ru: Установите несколько пакетов

source: Shut down the system
ru: Выключите систему

source: Restart a bare QEMU instance and utilize the monitor command `loadvm` to restore the VM
ru: Перезапустите экземпляр QEMU без оболочки и используйте команду монитора `loadvm` для восстановления ВМ

source: Observe that the restored VM does not have any packages
ru: Обратите внимание, что восстановленная ВМ не имеет установленных пакетов

source: During the "Prepare the environment" step, in a separate virtual console (ttyv1), an editing session with man:vi[1] is initiated simulating user activity. Additional programs may be started if desired. The snapshot should account for the state of all applications running at the time the snapshot is taken.
ru: На этапе «Подготовка окружения» в отдельной виртуальной консоли (ttyv1) запускается сеанс редактирования в man:vi[1], имитирующий активность пользователя. При желании можно запустить дополнительные программы. Снимок должен учитывать состояние всех приложений, работающих на момент его создания.

source: crossref:virtualization[qemu-using-monitor-snapshots,Figure {counter:figure}] shows the newly installed FreeBSD system with no packages, and separately, the editing session on ttyv1. The man:vi[1] editor is currently in `insert` mode with the typist typing the word "broadcast".
ru: crossref:virtualization[qemu-using-monitor-snapshots,Рисунок {counter:figure}] показывает новую установленную систему FreeBSD без пакетов, а также отдельно сеанс редактирования на ttyv1. Редактор man:vi[1] в данный момент находится в режиме `insert`, и пользователь набирает слово "broadcast".

source: QEMU VM Before First Snapshot
ru: Виртуальная машина QEMU перед первым снимком состояния

source: To generate the snapshot, enter `savevm` in the monitor. Be sure to give it a tag (such as `original_install`).
ru: Чтобы создать снимок состояния, введите `savevm` в мониторе. Убедитесь, что указали метку (например, `original_install`).

source: Next, in the main console window, install a package, such as man:zip[1] which has no dependencies. Once that completes, renter the monitor and create another snapshot (`snap1_pkg+zip`).
ru: Далее, в главном окне консоли, установите пакет, например man:zip[1], который не имеет зависимостей. После завершения установки вернитесь в монитор и создайте ещё один снимок состояния (`snap1_pkg+zip`).

source: crossref:virtualization[qemu-after-monitor-snapshots,Figure {counter:figure}] shows the results of the above commands and the output of the `info shapshots` command.
ru: crossref:virtualization[qemu-after-monitor-snapshots,Рисунок {counter:figure}] показывает результаты выполненных выше команд и вывод команды `info shapshots`.

source: QEMU Using Monitor Commands for Snapshots
ru: QEMU — Использование команд монитора для создания снимков состояния

source: Reboot the system, and before FreeBSD starts up, switch to the monitor and enter `stop`. The VM will stop.
ru: Перезагрузите систему, и до запуска FreeBSD переключитесь на монитор и введите `stop`. Виртуальная машина остановится.

source: Enter `loadvm` with the tag you used above (here `original_install`).
ru: Введите `loadvm` с тегом, который вы использовали ранее (здесь `original_install`).

source: Immediately, the VM screen will switch to the exact moment the `savevm` command was entered above. Note that the VM is still stopped.
ru: Сразу же экран виртуальной машины переключится на тот момент, когда была введена команда `savevm`, как указано выше. Обратите внимание, что виртуальная машина всё ещё остановлена.

source: Enter `cont` to start the VM, switch to the editing session on `ttyv1`, and type one letter on the keyboard. The editor, still in insert mode, should respond accordingly. Any other programs running at the time the snapshot was taken should be unaffected.
ru: Введите `cont`, чтобы запустить ВМ, переключитесь на сеанс редактирования на `ttyv1` и наберите одну букву на клавиатуре. Редактор, всё ещё находящийся в режиме вставки, должен отреагировать соответствующим образом. Любые другие программы, работавшие в момент создания снимка, не должны быть затронуты.

source: The above steps show how a snapshot can be taken, the system modified, and then "rolled back" by restoring the previous snapshot.
ru: Приведенные выше шаги показывают, как можно создать снимок состояния, изменить систему, а затем «откатить» изменения, восстановив предыдущий снимок.

source: By default QEMU stores snapshot data in the same file as the image. View the list of snapshots with man:qemu-img[1] as shown below in crossref:virtualization[qemu-examine-monitor-snapshots,Figure {counter:figure}].
ru: По умолчанию QEMU хранит данные снимков в том же файле, что и образ. Просмотреть список снимков можно с помощью man:qemu-img[1], как показано ниже в crossref:virtualization[qemu-examine-monitor-snapshots,Рисунок {counter:figure}].

source: QEMU Using man:qemu-img[1] to Examine Snapshots
ru: QEMU Использование man:qemu-img[1] для проверки снимков

source: Using QEMU USB Devices
ru: Использование USB-устройств в QEMU

source: QEMU supports the creation of virtual USB devices that are backed by an image file. These are virtual USB devices that can be partitioned, formatted, mounted, and used just like a real USB device.
ru: QEMU поддерживает создание виртуальных USB-устройств, которые используют файл образа. Это виртуальные USB-устройства, которые можно разбивать на разделы, форматировать, монтировать и использовать, как реальное USB-устройство.

source: This configuration includes a `-drive` specification with the `id=usbstick`, raw format, and an image file (must be created by man:qemu-img[1]). The next line contains the `-device usb-ehci` specification for a USB EHCI controller, with `id=ehci`. Finally, a `-device usb-storage` specification ties the above drive to the EHCI USB bus.
ru: Эта конфигурация включает спецификацию `-drive` с `id=usbstick`, формат raw и файл образ (который должен быть создан с помощью man:qemu-img[1]). Следующая строка содержит спецификацию `-device usb-ehci` для контроллера USB EHCI с `id=ehci`. Наконец, спецификация `-device usb-storage` связывает указанный накопитель с шиной USB EHCI.

source: When the system is booted, FreeBSD will recognize a USB hub, add the attached USB device, and assign it to `da0` as shown in crossref:virtualization[qemu-usb-internal-storage,Figure {counter:figure}].
ru: При загрузке системы FreeBSD распознает USB-концентратор, добавит подключенное USB-устройство и назначит его на `da0`, как показано на crossref:virtualization[qemu-usb-internal-storage,рисунке {counter:figure}].

source: QEMU Created USB Hub and Mass Storage Device
ru: QEMU Созданные USB-концентратор и устройство хранения данных

source: The device is ready to be partitioned with man:gpart[8], and formatted with man:newfs[8]. Because the USB device is backed by a man:qemu-img[1] created file, data written to the device will persist across reboots.
ru: Устройство готово к разделению с помощью man:gpart[8] и форматированию с помощью man:newfs[8]. Поскольку USB-устройство использует файл, созданный man:qemu-img[1], записанные на него данные сохранятся после перезагрузки.

source: Using Host USB Devices via Passthrough
ru: Использование USB-устройств хоста через проброс (passthrough)

source: QEMU USB passthrough support is listed as experimental in version 9.0.1 (Summer, 2024). However, the following steps show how a USB stick mounted on the host can be used by the guest VM.
ru: Поддержка проброса USB в QEMU указана как экспериментальная в версии 9.0.1 (лето 2024 года). Тем не менее, следующие шаги показывают, как USB-накопитель, подключённый к хосту, может быть использован в гостевой ВМ.

source: For more information and examples, see:
ru: Для получения дополнительной информации и примеров см.:

source: The upper part of crossref:virtualization[qemu-usb-passthrough,Figure {counter:figure}] shows the QEMU monitor commands:
ru: Верхняя часть crossref:virtualization[qemu-usb-passthrough,рисунка {counter:figure}] показывает команды монитора QEMU:

source: `info usbhost` shows information about all USB devices on the host system. Find the desired USB device on the host system and note the two hexadecimal values on that line. (In the example below the host USB device is a Memorex Mini, with vendorid 0718, and productid 0619.) Use the two values shown by the `info usbhost` command in the `device_add` step below.
ru: `info usbhost` отображает информацию обо всех USB-устройствах в хост-системе. Найдите нужное USB-устройство в хост-системе и запишите два шестнадцатеричных значения в соответствующей строке. (В примере ниже хост-устройство — это Memorex Mini с vendorid 0718 и productid 0619.) Используйте эти два значения, показанные командой `info usbhost`, на этапе `device_add` ниже.

source: `device_add` adds a USB device to the guest VM.
ru: `device_add` добавляет USB-устройство в гостевую ВМ.

source: QEMU Monitor Commands to Access a USB Device on the Host
ru: Команды монитора QEMU для доступа к USB-устройству на хосте

source: As before, once `device_add` completes, the FreeBSD kernel recognizes a new USB device, as shown in the lower half of the .
ru: Как и ранее, после завершения `device_add` ядро FreeBSD распознает новое USB-устройство, как показано в нижней части экрана.

source: Using the new device is shown in crossref:virtualization[qemu-usb-passthrough2,Figure {counter:figure}].
ru: Использование нового устройства показано на crossref:virtualization[qemu-usb-passthrough2,рисунке {counter:figure}].

source: Using the Host USB Device via Passthrough
ru: Использование USB-устройства хоста через проброс (passthrough)

source: If the USB device is formatted as a FAT16 or FAT32 filesystem it can be mounted as an MS-DOS(TM) filesystem with man:mount_msdosfs[8] as in the example shown. The `/etc/hosts` file is copied to the newly mounted drive and checksums are taken to verify the integrity of the file on the USB device. The device is then unmounted with man:umount[8].
ru: Если USB-устройство отформатировано как файловая система FAT16 или FAT32, его можно подключить как файловую систему MS-DOS(TM) с помощью man:mount_msdosfs[8], как показано в примере. Файл `/etc/hosts` копируется на только что подключённый диск, и для проверки целостности файла на USB-устройстве вычисляются контрольные суммы. Затем устройство отключается с помощью man:umount[8].

source: If the USB device is formatted with NTFS it is necessary to install the `fusefs-ntfs` package and use man:ntfs-3g[8] to access the device:
ru: Если USB-устройство отформатировано в NTFS, необходимо установить пакет `fusefs-ntfs` и использовать man:ntfs-3g[8] для доступа к устройству:

source: Change the above device identifiers to match the installed hardware. Consult man:ntfs-3g[8] for additional information on working with NTFS filesystems.
ru: Замените приведенные выше идентификаторы устройств в соответствии с установленным оборудованием. Дополнительную информацию о работе с файловыми системами NTFS см. в man:ntfs-3g[8].

source: QEMU on FreeBSD Summary
ru: QEMU на FreeBSD Краткое описание

source: As noted above, QEMU works with several different hypervisor accelerators.
ru: Как упоминалось выше, QEMU работает с несколькими различными гипервизорными ускорителями.

source: The list of link:https://www.qemu.org/docs/master/system/introduction.html#virtualisation-accelerators[Virtualization Accelerators] supported by QEMU includes:
ru: Список поддерживаемых QEMU link:https://www.qemu.org/docs/master/system/introduction.html#virtualisation-accelerators[ускорителей виртуализации] включает:

source: `KVM` on Linux supporting 64 bit Arm, MIPS, PPC, RISC-V, s390x, and x86
ru: `KVM` в Linux с поддержкой 64-битных архитектур Arm, MIPS, PPC, RISC-V, s390x и x86

source: `Xen` on Linux as dom0 supporting Arm, x86
ru: `Xen` на Linux в качестве dom0 с поддержкой Arm и x86

source: `Hypervisor Framework (hvf)` on MacOS supporting x86 and Arm (both 64 bit only)
ru: `Hypervisor Framework (hvf)` в macOS с поддержкой x86 и Arm (только 64-битные)

source: `Windows Hypervisor Platform (whpx)` on Windows supporting x86
ru: `Windows Hypervisor Platform (whpx)` в Windows с поддержкой x86

source: `NetBSD Virtual Machine Monitor (nvmm)` on NetBSD supporting x86
ru: `Диспетчер виртуальных машин NetBSD (nvmm)` на NetBSD с поддержкой x86

source: `Tiny Code Generator (tcg)` on Linux and other POSIX, Windows, MacOS supporting Arm, x86, Loongarch64, MIPS, PPC, s390x, and Sparc64.
ru: `Tiny Code Generator (tcg)` на Linux и других POSIX-совместимых системах, Windows, macOS с поддержкой Arm, x86, Loongarch64, MIPS, PPC, s390x и Sparc64.

source: All the examples in this section used the `Tiny Code Generator (tcg)` accelerator as that is the only supported accelerator on FreeBSD at present.
ru: Все примеры в этом разделе использовали ускоритель `Tiny Code Generator (tcg)`, так как это единственный поддерживаемый ускоритель в FreeBSD на данный момент.

source: FreeBSD as a Host with bhyve
ko: bhyve를 사용하는 호스트로서의 FreeBSD
ru: FreeBSD в качестве хоста с bhyve

source: The bhyve BSD-licensed hypervisor became part of the base system with FreeBSD 10.0-RELEASE. This hypervisor supports several guests, including FreeBSD, OpenBSD, many Linux(R) distributions, and Microsoft Windows(R). By default, bhyve provides access to a serial console and does not emulate a graphical console. Virtualization offload features of newer CPUs are used to avoid the legacy methods of translating instructions and manually managing memory mappings.
ru: Гипервизор bhyve с лицензией BSD стал частью базовой системы начиная с FreeBSD 10.0-RELEASE. Этот гипервизор поддерживает несколько гостевых систем, включая FreeBSD, OpenBSD, многие дистрибутивы Linux(R) и Microsoft Windows(R). По умолчанию bhyve предоставляет доступ к последовательной консоли и не эмулирует графическую консоль. Функции оффлоадинга виртуализации современных процессоров используются для избежания устаревших методов трансляции инструкций и ручного управления отображением памяти.

source: The bhyve design requires
ru: Дизайн bhyve требует

source: an Intel(R) processor that supports Intel Extended Page Tables (EPT),
ru: процессор Intel(R), поддерживающий Intel Extended Page Tables (EPT),

source: or an AMD(R) processor that supports AMD Rapid Virtualization Indexing (RVI), or Nested Page Tables (NPT),
ru: или процессор AMD(R), поддерживающий AMD Rapid Virtualization Indexing (RVI) или Nested Page Tables (NPT),

source: or an ARM(R) aarch64 CPU.
ru: или процессор ARM(R) aarch64.

source: Only pure ARMv8.0 virtualization is supported on ARM, the Virtualization Host Extensions are not currently used. Hosting Linux(R) guests or FreeBSD guests with more than one vCPU requires VMX unrestricted mode support (UG).
ru: На ARM поддерживается только чистая виртуализация ARMv8.0, расширения Virtualization Host Extensions в настоящее время не используются. Для запуска гостевых систем Linux(R) или FreeBSD с более чем одним vCPU требуется поддержка неограниченного режима VMX (UG).

source: The easiest way to tell if an Intel or AMD processor supports bhyve is to run `dmesg` or look in [.filename]#/var/run/dmesg.boot# for the `POPCNT` processor feature flag on the `Features2` line for AMD(R) processors or `EPT` and `UG` on the `VT-x` line for Intel(R) processors.
ru: Самый простой способ проверить, поддерживает ли процессор Intel или AMD технологию bhyve, — выполнить команду `dmesg` или посмотреть в файле [.filename]#/var/run/dmesg.boot# флаг `POPCNT` в строке `Features2` для процессоров AMD(R) или флаги `EPT` и `UG` в строке `VT-x` для процессоров Intel(R).

source: Preparing the Host
ko: 호스트 준비하기
ru: Подготовка хоста

source: The first step to creating a virtual machine in bhyve is configuring the host system. First, load the bhyve kernel module:
ko: bhyve에서 가상 머신을 생성하는 첫 번째 단계는 호스트 시스템을 구성하는 것입니다. 먼저 bhyve 커널 모듈을 로드합니다:
ru: Первым шагом к созданию виртуальной машины в bhyve является настройка хостовой системы. Сначала загрузите модуль ядра bhyve:
