Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: Set up networking for both virtual machines with the following commands. In this example the host network interface is `em0`. If necessary, change it to fit the interface for the host system. This must be done after every host machine restart to enable the QEMU guest VMs to communicate.
ru: Настройте сеть для обеих виртуальных машин с помощью следующих команд. В этом примере сетевой интерфейс хоста — `em0`. При необходимости измените его в соответствии с интерфейсом вашей системы. Это необходимо выполнять после каждой перезагрузки хоста, чтобы обеспечить возможность обмена данными для гостевых QEMU ВМ.

source: The above commands create two man:tap[4] devices (`tap0`, `tap1`) and one man:if_bridge[4] device (`bridge0`). Then, they add the `tap` devices and the local host interface (`em0`) to the `bridge`, and set two man:sysctl[8] entries to allow for normal users to open the tap device. These commands will allow the virtual machines to talk to the network stack on the host.
ru: Приведенные выше команды создают два устройства man:tap[4] (`tap0`, `tap1`) и одно устройство man:if_bridge[4] (`bridge0`). Затем они добавляют устройства `tap` и интерфейс локального хоста (`em0`) в `bridge`, а также устанавливают две записи man:sysctl[8], чтобы разрешить обычным пользователям открывать устройство tap. Эти команды позволят виртуальным машинам взаимодействовать с сетевым стеком на хосте.

source: Change to [.filename]#~/QEMU/SCRIPTS#, use the following script to start the first virtual machine, "left". This script uses the QEMU raw disk format.
ru: Перейдите в [.filename]#~/QEMU/SCRIPTS# и используйте следующий скрипт для запуска первой виртуальной машины — "left". Этот скрипт использует диск QEMU в формате raw.

source: Save the above into a file (for example `left.sh`) and simply run: % `/bin/sh left.sh`
ru: Сохраните приведённый выше код в файл (например, `left.sh`) и просто выполните: `/bin/sh left.sh`

source: QEMU will start up a virtual machine in a separate window and boot the FreeBSD iso as shown in crossref:virtualization[qemu-newboot-loader-menu,Figure {counter:figure}]. All command options such as `-cpu` and `-boot` are fully described in the QEMU man page man:qemu[1].
ru: QEMU запустит виртуальную машину в отдельном окне и загрузит FreeBSD iso, как показано на crossref:virtualization[qemu-newboot-loader-menu,рисунке {counter:figure}]. Все параметры команд, такие как `-cpu` и `-boot`, полностью описаны в man-странице QEMU man:qemu[1].

source: FreeBSD Boot Loader Menu
ru: Меню загрузчика FreeBSD

source: The FreeBSD loader menu.
ru: Меню загрузчика FreeBSD.

source: If the mouse is clicked in the QEMU console window, QEMU will “grab” the mouse as shown in crossref:virtualization[qemu-grab,Figure {counter:figure}]. Type kbd:[Ctl]+kbd:[Alt]+kbd:[G]” to release the mouse.
ru: Если в окне консоли QEMU кликнуть мышкой , QEMU «захватит» мышь, как показано в crossref:virtualization[qemu-grab,Рисунок {counter:figure}]. Нажмите kbd:[Ctrl]+kbd:[Alt]+kbd:[G], чтобы освободить мышь.

source: When QEMU Has Grabbed the Mouse
ru: Когда QEMU захватил мышь

source: When QEMU has grabbed the mouse
ru: Когда QEMU захватит мышь

source: On FreeBSD, an initial QEMU installation can be somewhat slow. This is because the emulator writes filesystem formatting and metadata during the disk first use. Subsequent operations are generally much faster.
ru: На FreeBSD первоначальная установка QEMU может быть несколько медленной. Это происходит потому, что эмулятор записывает форматирование файловой системы и метаданные при первом использовании диска. Последующие операции, как правило, выполняются значительно быстрее.

source: During the installation there are several points to note:
ru: Во время установки следует обратить внимание на несколько моментов:

source: Select to use UFS as the filesystem. ZFS does not perform well with small memory sizes.
ru: Выберите использование UFS в качестве файловой системы. ZFS работает неэффективно при небольшом объеме памяти.

source: For networking use DHCP. If desired, configure IPv6 if supported by the local LAN.
ru: Для использования сети настройте DHCP. При необходимости настройте IPv6, если он поддерживается локальной сетью.

source: When adding the default user, ensure they are a member of the *wheel* group.
ru: При добавлении пользователя по умолчанию убедитесь, что он является членом группы *wheel*.

source: Once the installation completes, the virtual machine reboots into the newly installed FreeBSD image.
ru: После завершения установки виртуальная машина перезагружается в только что установленный образ FreeBSD.

source: Login as `root` and update the system as follows:
ru: Войдите как `root` и обновите систему следующим образом:

source: After a successful installation, QEMU will boot the operating system installed on the disk, and not the installation program.
ru: После успешной установки QEMU загрузит операционную систему, установленную на диске, а не программу установки.

source: QEMU supports a ```-runas``` option. For added security, include the option "-runas your_user_name" in the script listing above. See man:qemu[1] for details.
ru: QEMU поддерживает параметр ```-runas```. Для повышения безопасности добавьте параметр "-runas your_user_name" в приведённый выше скрипт. Подробности см. в man:qemu[1].

source: Login as `root` again and add any packages desired. To utilize the X Window system in the guest, see the section "Using the X Window System" below.
ru: Войдите снова как `root` и добавьте любые необходимые пакеты. Чтобы использовать систему X Window в гостевой системе, см. раздел «Использование системы X Window» ниже.

source: This completes the setup of the "left" VM.
ru: Завершена настройка виртуальной машины "left".

source: To install the "right" VM, run the following script. This script has the modifications needed for tap1, format=qcow2, the image filename, the MAC address, and the terminal window name. If desired, include the "-runas" parameter as described in the above note.
ru: Для установки виртуальной машины "right" выполните следующий скрипт. Этот скрипт содержит необходимые изменения для tap1, format=qcow2, имени файла образа, MAC-адреса и названия окна терминала. При желании можно добавить параметр "-runas", как описано в примечании выше.

source: Once the installation is complete, the "left" and "right" machines can communicate with each other and with the host. If there are strict firewall rules on the host, consider adding or modifying rules to allow the bridge and tap devices to communicate with each other.
ru: После завершения установки обе машины "left" и "right" могут взаимодействовать друг с другом и с хостом. Если на хосте действуют строгие правила брендмауэра, рассмотрите возможность добавления или изменения правил для разрешения взаимодействия между мостом (bridge) и устройствами tap.

source: Usage Tips
ru: Советы по использованию

source: Using the X Window System
ru: Использование системы X Window

source: crossref:x11[x-install,Installing Xorg] describes how to set up the `X Window` system. Refer to that guide for initial `X Window` setup then consult crossref:desktop[desktop,Desktop Environments] on how to set up a complete desktop.
ru: crossref:x11[x-install,Установка Xorg] описывает, как настроить систему `X Window`. Обратитесь к этому руководству для первоначальной настройки `X Window`, затем ознакомьтесь с crossref:desktop[desktop,Среды рабочего стола], чтобы настроить полноценную рабочую среду.

source: This section demonstrates use of the XFCE desktop.
ru: Этот раздел демонстрирует использование рабочего стола XFCE.

source: Once the installation is complete, login as a regular user, then type:
ru: После завершения установки войдите в систему как обычный пользователь, затем введите:

source: The XFCE4 window manager should start up and present a functioning graphical desktop as in crossref:virtualization[qemu-two-qemu,Figure {counter:figure}]. On initial startup, it may take up to a minute to display the desktop. See the documentation at the link:https://www.xfce.org[XFCE website] for usage details.
ru: Менеджер окон XFCE4 должен запуститься и предоставить рабочий графический рабочий стол, как на crossref:virtualization[qemu-two-qemu,рисунке {counter:figure}]. При первом запуске отображение рабочего стола может занять до минуты. Подробности использования см. в документации на link:https://www.xfce.org[сайте XFCE].

source: Both QEMU VMs
ru: Обе виртуальные машины QEMU

source: Adding more memory to the guest system may speed up the graphical user interface.
ru: Добавление дополнительной памяти в гостевую систему может ускорить работу графического интерфейса пользователя.

source: Here, the "left" VM has had the `X Window` system installed, while the "right" VM is still in text mode.
ru: Здесь на виртуальной машине "left" установлена система `X Window`, а виртуальная машина "right" всё ещё находится в текстовом режиме.

source: Using the QEMU Window
ru: Использование окна QEMU

source: The QEMU window functions as a full FreeBSD console, and is capable of running multiple virtual terminals, just like a bare-metal system.
ru: Окно QEMU функционирует как полноценная консоль FreeBSD и способно работать с несколькими виртуальными терминалами, как и система на реальном оборудовании.

source: To switch to another virtual console, click into the QEMU window and type kbd:[Alt+F2] or kbd:[Alt+F3]. FreeBSD should switch to another virtual console. crossref:virtualization[qemu-console-ttyv3,Figure {counter:figure}] shows the "left" VM displaying the virtual console on `ttyv3`.
ru: Для переключения на другую виртуальную консоль кликните в окно QEMU и нажмите kbd:[Alt+F2] или kbd:[Alt+F3]. FreeBSD должна переключиться на другую виртуальную консоль. crossref:virtualization[qemu-console-ttyv3,Рисунок {counter:figure}] показывает ВМ "left" с виртуальной консолью на `ttyv3`.

source: Switching to Another Virtual Console in the QEMU Window
ru: Переключение на другую виртуальную консоль в окне QEMU

source: The host current desktop manager or window manager may be already setup for another function with the kbd:[Alt+F1], kbd:[Alt+F2] key sequences. If so, try typing kbd:[Ctl+Alt+F1], kbd:[Ctl+Alt+F2], or some other similar key combination. Check the window manager or desktop manager documentation for details.
ru: Текущий менеджер рабочего стола или оконный менеджер на хосте может быть уже настроен на другое действие для комбинаций клавиш kbd:[Alt+F1], kbd:[Alt+F2]. В таком случае попробуйте нажать kbd:[Ctrl+Alt+F1], kbd:[Ctrl+Alt+F2] или другую подобную комбинацию. Подробности смотрите в документации вашего оконного менеджера или менеджера рабочего стола.

source: Using the QEMU Window Menus
ru: Использование меню окна QEMU

source: Another feature of the QEMU window is the `View` menu and the Zoom controls. The most useful is `Zoom to Fit`. When this menu selection is clicked, it is then possible to resize the QEMU window by clicking the window corner controls and resizing the window. crossref:virtualization[qemu-zoom-to-fit,Figure {counter:figure}] shows the effect of resizing the "left" window while in graphics mode.
ru: Еще одна особенность окна QEMU — это меню `View` и элементы управления масштабом. Наиболее полезным является пункт `Zoom to Fit`. При выборе этого пункта меню появляется возможность изменить размер окна QEMU, перетаскивая его углы. На crossref:virtualization[qemu-zoom-to-fit,рисунке {counter:figure}] показан эффект изменения размера окна "left" в графическом режиме.

source: Using the View Menu `Zoom to Fit` Option
ru: Использование опции `Zoom to Fit` в меню View

source: Other QEMU Window Menu Options
ru: Другие пункты меню окна QEMU

source: Also shown in the `View` menu are
ru: Также в меню `View` отображаются

source: `cirrus-vga`, `serial0`, and `parallel0` options. These allow for switching input/output to the selected device.
ru: Опции `cirrus-vga`, `serial0` и `parallel0`. Они позволяют переключать ввод/вывод на выбранное устройство.

source: The QEMU window `Machine` menu allows for four types of control over the guest VM:
ru: Окно QEMU в меню `Machine` предоставляет четыре типа управления гостевой виртуальной машиной:

source: `Pause` allows for pausing the QEMU virtual machine. This may be helpful in freezing a fast scrolling window.
ru: `Pause` позволяет приостановить виртуальную машину QEMU. Это может быть полезно для остановки быстро прокручивающегося окна.

source: `Reset` immediately resets the virtual machine back at cold "power on" state. As with a real machine, it is not recommended unless absolutely necessary.
ru: `Reset` немедленно возвращает виртуальную машину в исходное состояние, как "при включении питания". Как и с реальной машиной, это не рекомендуется, если в этом нет крайней необходимости.

source: `Power Down` simulates an ACPI shutdown signal and the operating system goes through a graceful shutdown.
ru: `Power Down` имитирует сигнал отключения ACPI, и операционная система выполняет аккуратное завершение работы.

source: `Quit` powers off the virtual machine immediately - also not recommended unless necessary.
ru: `Quit` немедленно выключает виртуальную машину — также не рекомендуется, если в этом нет необходимости.

source: Adding a Serial Port Interface to a Guest VM
ru: Добавление интерфейса последовательного порта к гостевой ВМ

source: To implement a serial console, a guest VM running FreeBSD needs to insert
ru: Для использования последовательной консоли гостевая ВМ под управлением FreeBSD должна добавить

source: in [.filename]#/boot/loader.conf# to allow the use of the FreeBSD serial console.
ru: в [.filename]#/boot/loader.conf# для разрешения использования последовательной консоли FreeBSD.

source: The updated configuration below shows how to implement the serial console on the guest VM. Run the script to start the VM.
ru: Обновлённая конфигурация ниже показывает, как реализовать последовательную консоль на гостевой ВМ. Запустите скрипт для старта ВМ.

source: Enabling a Serial Port over TCP
ru: Включение последовательного порта через TCP

source: In crossref:virtualization[qemu-notes-on-serial-console,Figure {counter:figure}], the serial port is redirected to a TCP port on the host system at VM startup and the QEMU monitor waits (`wait=on`) to activate the guest VM until a man:telnet[1] connection occurs on the indicated localhost port. After receiving a connection from a separate session, the FreeBSD system starts booting and looks for a console directive in [.filename]#/boot/loader.conf#. With the directive "console=comconsole", FreeBSD starts up a console session on a serial port. The QEMU monitor detects this and directs the necessary character I/O on that serial port to the telnet session on the host. The system boots and once finished, login prompts are enabled on the serial port (`ttyu0`) and on the console (`ttyv0`).
ru: На crossref:virtualization[qemu-notes-on-serial-console,рисунке {counter:figure}] последовательный порт перенаправляется на TCP-порт хост-системы при запуске ВМ, а монитор QEMU ожидает (`wait=on`), активируя гостевую ВМ только после установления соединения man:telnet[1] с указанным портом localhost. После получения соединения из отдельного сеанса система FreeBSD начинает загрузку и ищет директиву консоли в [.filename]#/boot/loader.conf#. С директивой "console=comconsole" FreeBSD запускает консольный сеанс на последовательном порту. Монитор QEMU обнаруживает это и направляет необходимый символьный ввод-вывод с этого последовательного порта в telnet-сеанс на хосте. Система загружается, и после завершения загрузки приглашения для входа в систему становятся доступными на последовательном порту (`ttyu0`) и на консоли (`ttyv0`).

source: It is important to note that the this serial redirect over TCP takes place outside the virtual machine. There is no interaction with any network on the virtual machine and therefore it is not subject to any firewall rules. Think of it like a dumb terminal sitting on an RS-232 or USB port on a real machine.
ru: Важно отметить, что этот последовательный перенаправление через TCP происходит вне виртуальной машины. Нет взаимодействия с какой-либо сетью внутри виртуальной машины, и поэтому оно не подчиняется никаким правилам брандмауэра. Представьте это как простой терминал, подключенный к RS-232 или USB-порту на реальном компьютере.

source: Notes on Using the Serial Console
ru: Заметки об использовании последовательной консоли

source: On the serial console, if the window is resized, execute man:resizewin[1] to update the terminal size.
ru: На последовательной консоли, если размер окна изменен, выполните man:resizewin[1], чтобы обновить размер терминала.

source: It may be desirable (even necessary) to stop syslog message from being sent to the console (both the QEMU console and the serial port). Consult man:syslog.conf[5] for details on redirecting console messages.
ru: Может быть желательно (или даже необходимо) остановить отправку сообщений syslog на консоль (как консоль QEMU, так и последовательный порт). Подробности о перенаправлении сообщений консоли можно найти в man:syslog.conf[5].

source: Once the [.filename]#/boot.loader.conf# has been updated to permit a serial console, the guest VM will attempt to boot from the serial port every time. Ensure that the serial port is enabled as shown in the listing above, or update the [.filename]#/boot/loader.conf# file to not require a serial console.
ru: После обновления файла [.filename]#/boot/loader.conf# для разрешения использования последовательной консоли гостевая ВМ будет пытаться загружаться с последовательного порта при каждом запуске. Убедитесь, что последовательный порт включен, как показано в приведённом выше листинге, или измените файл [.filename]#/boot/loader.conf#, чтобы не требовать использования последовательной консоли.

source: QEMU User Mode Emulation
ru: Эмуляция пользовательского режима QEMU

source: QEMU also supports running applications that are precompiled on an architecture different from the host CPU. For example, it is possible to run a Sparc64 architecture operating system on an x86_64 host. This is demonstrated in the next section.
ru: QEMU также поддерживает выполнение приложений, скомпилированных для архитектуры, отличной от архитектуры основного процессора. Например, можно запустить операционную систему архитектуры Sparc64 на хосте с архитектурой x86_64. Это демонстрируется в следующем разделе.

source: Setting up a SPARC64 Guest VM on an x86_64 Host
ru: Настройка гостевой ВМ SPARC64 на хосте x86_64

source: Setting up a new VM with an architecture different from the host involves several steps:
ru: Настройка новой виртуальной машины с архитектурой, отличной от архитектуры хоста, включает несколько шагов:

source: Getting the software that will run on the guest VM
ru: Получение программного обеспечения, которое будет работать на гостевой ВМ

source: Creating a new disk image for the guest VM
ru: Создание нового образа диска для гостевой ВМ

source: Setting up a new QEMU script with the new architecture
ru: Настройка нового скрипта QEMU с новой архитектурой

source: Performing the install
ru: Выполнение установки

source: In the following procedure a copy of OpenBSD 6.8 SPARC64 software is used for this QEMU User Mode Emulation exercise.
ru: В следующей процедуре используется копия программного обеспечения OpenBSD 6.8 SPARC64 для этого упражнения по эмуляции пользовательского режима QEMU.

source: Not all versions of OpenBSD Sparc64 work on QEMU. OpenBSD version 6.8 is known to work and was selected as the example for this section.
ru: Не все версии OpenBSD Sparc64 работают в QEMU. Известно, что OpenBSD версии 6.8 работает, и она была выбрана в качестве примера для этого раздела.

source: Download OpenBSD 6.8 Sparc64 from an OpenBSD archive.
ru: Скачать OpenBSD 6.8 Sparc64 из архива OpenBSD.

source: On the OpenBSD download sites, only the most current versions are maintained. It is necessary to search an archive to obtain past releases.
ru: На сайтах загрузки OpenBSD поддерживаются только самые последние версии. Для получения предыдущих выпусков необходимо искать в архиве.

source: Creating a new disk image for the Sparc64 VM is similar to the "right" VM above. This case uses the QEMU qcow2 format for the disk:
ru: Создание нового образа диска для виртуальной машины Sparc64 аналогично описанному выше для "правильной" виртуальной машины. В данном случае используется формат диска QEMU qcow2:

source: Use the script below for the new Sparc64 architecture. As with the above example, run the script, then start a new session and `telnet` to localhost on the port indicated:
ru: Используйте приведенный ниже скрипт для новой архитектуры Sparc64. Как и в предыдущем примере, запустите скрипт, затем начните новую сессию и подключитесь через `telnet` к localhost на указанном порту:

source: Note the following:
ru: Обратите внимание на следующее:

source: The `-boot d` option boots from the QEMU CDROM device which is set as `-cdrom ../ISO/install68.iso`.
ru: Опция `-boot d` загружает систему с устройства CDROM QEMU, которое указано как `-cdrom ../ISO/install68.iso`.

source: As before, the `telnet` server option is set to wait for a separate connection on port 4410. Start up another session and use man:telnet[1] to connect to localhost on port 4410.
ru: Как и ранее, параметр сервера `telnet` настроен на ожидание отдельного подключения на порту 4410. Запустите еще один сеанс и используйте man:telnet[1] для подключения к localhost на порту 4410.

source: The script sets the `-nographic` option meaning there is only serial port I/O. There is no graphical interface.
ru: Скрипт устанавливает опцию `-nographic`, что означает использование только ввода/вывода через последовательный порт. Графический интерфейс отсутствует.

source: Networking is not set up through the man:tap[4] / man:if_bridge[4] combination. This example uses a separate method of QEMU networking known as "Serial Line Internet Protocol" (SLIRP), sometimes referred to as "User Mode Networking". Documentation on this and other QEMU networking methods is here: link:https://wiki.qemu.org/Documentation/Networking[QEMU Networking Documentation]
ru: Сетевое взаимодействие не настраивается через комбинацию man:tap[4] / man:if_bridge[4]. В этом примере используется отдельный метод сетевого взаимодействия QEMU, известный как "Serial Line Internet Protocol" (SLIRP), иногда называемый "User Mode Networking". Документация по этому и другим методам сетевого взаимодействия QEMU находится здесь: link:https://wiki.qemu.org/Documentation/Networking[Документация по сетевому взаимодействию QEMU]

source: If everything is set correctly, the system will boot as shown in crossref:virtualization[qemu-sparc64-boot-cdrom-installation,Figure {counter:figure}].
ru: Если все настроено правильно, система загрузится, как показано на crossref:virtualization[qemu-sparc64-boot-cdrom-installation,рисунке {counter:figure}].

source: QEMU Booting OpenBSD 6.8 Sparc64 from CDROM During User Mode Emulation
ru: QEMU Загрузка OpenBSD 6.8 Sparc64 с CDROM с эмуляцией пользовательского режима

source: Once the system is installed, modify the script and change the boot parameter to `-boot c`. This will indicate to QEMU to boot from the supplied hard disk, not the CDROM.
ru: После установки системы измените скрипт и замените параметр загрузки на `-boot c`. Это укажет QEMU загружаться с предоставленного жесткого диска, а не с CDROM.

source: The installed system can be used just like any other guest virtual machine. However, the underlying architecture of the guest is Sparc64, not x86_64.
ru: Установленная система может использоваться как любая другая гостевая виртуальная машина. Однако, базовая архитектура гостевой системы — Sparc64, а не x86_64.
