Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: snapshots are only supported when the guest uses a single kind of each device, i.e. if there is more than one `ahci-hd` disk attached, snapshot creation will fail
ru: Снимки поддерживаются только в случае, если гостевая система использует один тип каждого устройства. То есть, если подключено более одного диска `ahci-hd`, создание снимка завершится ошибкой

source: additionally, the feature may be reasonably stable on Intel, but it probably won't work on AMD CPUs.
ru: дополнительно, функция может быть достаточно стабильной на процессорах Intel, но, скорее всего, не будет работать на процессорах AMD.

source: Make sure the [.filename]#/usr/src# directory is up-to date before taking the following steps. See crossref:cutting-edge[updating-src-obtaining-src, Updating the Source] for the detailed procedure how to do this.
ru: Убедитесь, что каталог [.filename]#/usr/src# актуален, прежде чем выполнять следующие шаги. Подробная процедура обновления описана в разделе crossref:cutting-edge[updating-src-obtaining-src, Updating the Source].

source: First, add the following to [.filename]#/etc/src.conf#:
ru: Добавьте следующее в [.filename]#/etc/src.conf#:

source: If the system was partially or wholly rebuilt, it is recommended to run
ru: Если система была частично или полностью пересобрана, рекомендуется выполнить

source: before proceeding.
ru: прежде чем продолжить.

source: Then follow the steps outlined in the crossref:cutting-edge[updating-src-quick-start,"Quick Start section of the Updating FreeBSD from Source"] chapter to build and install world and kernel.
ru: Затем выполните шаги, описанные в разделе crossref:cutting-edge[updating-src-quick-start,"Быстрый старт обновления FreeBSD из исходного кода"], чтобы собрать и установить систему и ядро.

source: To verify successful activation of the snapshot feature, enter
ru: Чтобы проверить успешную активацию функции снимков, введите

source: and check if the output lists a `--suspend` flag. If the flag is missing, the feature did not activate correctly.
ru: и проверить, есть ли в выводе флаг `--suspend`. Если флаг отсутствует, значит функция не активировалась корректно.

source: Then, you can snapshot and suspend a running virtual machine of your choice:
ru: Затем вы можете создать снимок состояния и приостановить работающую виртуальную машину по вашему выбору:

source: Provide an absolute path and filename to `--suspend`. Otherwise, bhyve will write snapshot data to whichever directory bhyve was started from.
ru: Укажите абсолютный путь и имя файла для `--suspend`. В противном случае bhyve запишет данные снимка в тот каталог, из которого был запущен bhyve.

source: Make sure to write the snapshot data to a secure directory. The generated output contains a full memory dump of the guest and may thus contain sensitive data (i.e. passwords)!
ru: Убедитесь, что записываете данные снимка в защищённый каталог. Сформированный вывод содержит полный дамп памяти гостевой системы и, следовательно, может включать конфиденциальные данные (например, пароли)!

source: This creates three files:
ru: Это создает три файла:

source: memory snapshot - named like the input to `--suspend`
ru: моментальный снимок памяти - назван аналогично параметру `--suspend`

source: kernel file - name like the input to `--suspend` with the suffix [.filename]#.kern#
ru: файл ядра - имя, аналогичное входному параметру `--suspend`, с суффиксом [.filename]#.kern#

source: metadata - contains meta data about the system state, named with the suffix [.filename]#.meta#
ru: metadata - содержит метаданные о состоянии системы, с именем, оканчивающимся на суффикс [.filename]#.meta#

source: To restore a guest from a snapshot, use the `-r` flag with `bhyve`:
ru: Для восстановления гостевой системы из снимка используйте флаг `-r` с `bhyve`:

source: Restoring a guest snapshot on a different CPU architecture will not work. Generally, attempting to restore on a system not identical to the snapshot creator will likely fail.
ru: Восстановление снимка гостевой системы на архитектуре процессора, отличной от исходной, невозможно. Как правило, попытка восстановления на системе, не идентичной той, на которой был создан снимок, скорее всего, завершится неудачей.

source: Jailing bhyve
ru: bhyve в клетке

source: For improved security and separation of virtual machines from the host operating system, it is possible to run bhyve in a jail. See crossref:jails[,Jails] for an in-depth description of jails and their security benefits.
ru: Для повышения безопасности и изоляции виртуальных машин от основной операционной системы можно запускать bhyve в клетке. См. crossref:jails[,Клетки] для подробного описания клеток и их преимуществ в плане безопасности.

source: Creating a Jail for bhyve
ru: Создание клетки для bhyve

source: First, create a jail environment. If using a UFS file system, simply run:
ru: Сначала создайте окружение клетки. Если используется файловая система UFS, просто выполните:

source: If using a crossref:zfs[,ZFS filesystem], use the following commands:
ru: Если используется crossref:zfs[,файловая система ZFS], выполните следующие команды:

source: Then create a ZFS zvol for the virtual machine `bhyvevm0`:
ru: Затем создайте ZFS zvol для виртуальной машины `bhyvevm0`:

source: If not using ZFS, use the following commands to create a disk image file directly in the jail directory structure:
ru: Если ZFS не используется, для создания файла образа диска непосредственно в структуре каталогов клетки применяйте следующие команды:

source: Download a FreeBSD image, preferably a version equal to or older than the host and extract it into the jail directory:
ru: Загрузите образ FreeBSD, предпочтительно версии, равной или более старой, чем на хосте, и извлеките его в каталог клетки:

source: Running a higher FreeBSD version in a jail than the host is unsupported (i.e. running 14.0-RELEASE in a jail, embedded in a 13.2-RELEASE host).
ru: Запуск более высокой версии FreeBSD в клетке, чем на хосте, не поддерживается (например, запуск 14.0-RELEASE в jail на хосте с 13.2-RELEASE).

source: Next, add a devfs ruleset to [.filename]#/etc/devfs.rules#:
ru: Далее добавьте набор правил devfs в [.filename]#/etc/devfs.rules#:

source: If there's another devfs rule with the numeric ID 100 in your [.filename]#/etc/devfs.rules# file, replace the one in the listing with another yet unused ID number.
ru: Если в вашем файле [.filename]#/etc/devfs.rules# уже есть другое правило devfs с числовым идентификатором 100, замените указанный в примере идентификатор на другой, еще не использованный.

source: If not using a ZFS filesystem, skip the related zvol rules in [.filename]#/etc/devfs.rules#:
ru: Если не используется файловая система ZFS, пропустите связанные с zvol правила в [.filename]#/etc/devfs.rules#:

source: These rules will cause bhyve to
ru: Эти правила приведут к тому, что bhyve

source: create a virtual machine with disk volumes called `bhyvevm0` and `bhyvevm1`,
ru: создаст виртуальную машину с дисковыми томами `bhyvevm0` и `bhyvevm1`,

source: use [.filename]#tap# network interfaces with the name prefix `tap10`. That means, valid interface names will be `tap10`, `tap100`, `tap101`, ... `tap109`, `tap1000` and so on.
ru: будет использовать сетевые интерфейсы [.filename]#tap# с префиксом имени `tap10`. Это означает, что допустимыми именами интерфейсов будут `tap10`, `tap100`, `tap101`, ... `tap109`, `tap1000` и так далее.

source: Limiting the access to a subset of possible [.filename]#tap# interface names will prevent the jail (and thus bhyve) from seeing [.filename]#tap# interfaces of the host and other jails.
ru: Ограничение доступа к подмножеству возможных имён интерфейсов [.filename]#tap# предотвратит доступ клетки (и, следовательно, bhyve) к интерфейсам [.filename]#tap# хоста и других клеток.

source: use [.filename]#nmdm# devices prefixed with "bhyve", i.e. [.filename]#/dev/nmdmbhyve0#.
ru: используйте устройства [.filename]#nmdm# с префиксом "bhyve", например [.filename]#/dev/nmdmbhyve0#.

source: Those rules can be expanded and varied with different guest and interface names as desired.
ru: Эти правила можно расширять и изменять, используя различные имена гостевых систем и интерфейсов по необходимости.

source: If you intend to use bhyve on the host as well as in a one or more jails, remember that [.filename]#tap# and [.filename]#nmdm# interface names will operate in a shared environment. For example, you can use [.filename]#/dev/nmdmbhyve0# only either for bhyve on the host or in a jail.
ru: Если вы планируете использовать bhyve как на хосте, так и в одной или нескольких клеток, помните, что имена интерфейсов [.filename]#tap# и [.filename]#nmdm# будут работать в общей среде. Например, [.filename]#/dev/nmdmbhyve0# можно использовать либо для bhyve на хосте, либо в клетке.

source: Restart devfs for the changes to be loaded:
ru: Перезапустите devfs для применения изменений:

source: Then add a definition for your new jail into [.filename]#/etc/jail.conf# or [.filename]#/etc/jail.conf.d#. Replace the interface number [.filename]#$if# and IP address with your personal variations.
ru: Затем добавьте определение для вашей новой клетке в [.filename]#/etc/jail.conf# или [.filename]#/etc/jail.conf.d#. Замените номер интерфейса [.filename]#$if# и IP-адрес на свои значения.

source: Using NAT or routed traffic with a firewall
ru: Использование NAT или маршрутизируемого трафика с межсетевым экраном

source: This example assumes use of a firewall like `pf` or `ipfw` to NAT your jail traffic. See the crossref:firewalls[,Firewalls] chapter for more details on the available options to implement this.
ru: Этот пример предполагает использование межсетевого экрана, такого как `pf` или `ipfw`, для трансляции сетевых адресов (NAT) трафика вашей jail. Подробнее о доступных вариантах реализации этого смотрите в главе crossref:firewalls[,Межсетевые экраны].

source: Using a bridged network connection
ru: Использование мостового сетевого подключения

source: If you previously replaced the devfs ruleset ID 100 in [.filename]#/etc/devfs.rules# with your own unique number, remember to replace the numeric ID also in your [.filename]#jails.conf# too.
ru: Если вы ранее заменили идентификатор набора правил devfs 100 в [.filename]#/etc/devfs.rules# на свой уникальный номер, не забудьте также заменить числовой идентификатор в вашем [.filename]#jails.conf#.

source: Configuring the Jail
ru: Настройка клетки

source: To start the jail for the first time and do some additional configuration work, enter:
ru: Для первого запуска клетки и выполнения дополнительных настроек введите:

source: Restart and enable the jail:
ru: Перезапустите и включите клетку:

source: Afterwards, you can create a virtual machine within the jail. For a FreeBSD guest, download an installation ISO first:
ru: После этого вы можете создать виртуальную машину внутри клетки. Для гостевой системы FreeBSD сначала загрузите установочный ISO-образ:

source: Creating a Virtual Machine Inside the Jail
ru: Создание виртуальной машины внутри клетки

source: To create a virtual machine, use `bhyvectl` to initialize it first:
ru: Чтобы создать виртуальную машину, сначала инициализируйте её с помощью `bhyvectl`:

source: Creating the guest with `bhyvectl` may be required when initiating the virtual machine from a jail. Skipping this step may cause the following error message when starting `bhyve`:
ru: Создание гостевой системы с помощью `bhyvectl` может потребоваться при запуске виртуальной машины из клетки. Пропуск этого шага может привести к следующему сообщению об ошибке при запуске `bhyve`:

source: Finally, use your preferred way of starting the guest.
ru: Наконец, используйте предпочитаемый способ запуска гостевой системы.

source: Starting with `vmrun.sh` and ZFS
ru: Запуск с `vmrun.sh` и ZFS

source: Using `vmrun.sh` on a ZFS filesystems:
ru: Используя `vmrun.sh` на файловых системах ZFS:

source: Starting with `vmrun.sh` and UFS
ru: Запуск с `vmrun.sh` и UFS

source: Using `vmrun.sh` on a UFS filesystem:
ru: Используя `vmrun.sh` на файловой системе UFS:

source: Starting bhyve for an UEFI guest with ZFS
ru: Запуск bhyve для гостевой системы UEFI с ZFS

source: If instead you want to use an UEFI guest, remember to first install the required firmware package package:sysutils/bhyve-firmware[] in the jail:
ru: Если же вы хотите использовать гостевую систему с UEFI, не забудьте сначала установить необходимый пакет с микропрограммой package:sysutils/bhyve-firmware[] в клетку:

source: Then use `bhyve` directly:
ru: Затем используйте `bhyve` напрямую:

source: This will allow you to connect to your virtual machine `bhyvevm0` through VNC as well as a serial console at [.filename]#/dev/nmdbbhyve0B#.
ru: Это позволит вам подключиться к вашей виртуальной машине `bhyvevm0` через VNC, а также через последовательную консоль по адресу [.filename]#/dev/nmdbbhyve0B#.

source: Virtual Machine Consoles
ko: 가상 머신 콘솔
ru: Консоли виртуальной машины

source: It is advantageous to wrap the bhyve console in a session management tool such as package:sysutils/tmux[] or package:sysutils/screen[] in order to detach and reattach to the console. It is also possible to have the console of bhyve be a null modem device that can be accessed with `cu`. To do this, load the [.filename]#nmdm# kernel module and replace `-l com1,stdio` with `-l com1,/dev/nmdm0A`. The [.filename]#/dev/nmdm# devices are created automatically as needed, where each is a pair, corresponding to the two ends of the null modem cable ([.filename]#/dev/nmdm0A# and [.filename]#/dev/nmdm0B#). See man:nmdm[4] for more information.
ko: 콘솔을 분리했다가 다시 연결하기 위해 package:sysutils/tmux[] 또는 package:sysutils/screen[]과 같은 세션 관리 도구로 bhyve 콘솔을 감싸는 것이 유리합니다. bhyve의 콘솔을 `cu`로 액세스할 수 있는 널 모뎀 장치로 만들 수도 있습니다. 이렇게 하려면 [.filename]#nmdm# 커널 모듈을 로드하고 `-l com1,stdio`를 `-l com1,/dev/nmdm0A`로 대체합니다. 필요에 따라 [.filename]#/dev/nmdm# 장치가 자동으로 생성되며, 각 장치는 널 모뎀 케이블의 양쪽 끝에 해당하는 한 쌍입니다([.filename]#/dev/nmdm0A# 및 [.filename]#/dev/nmdm0B#). 자세한 내용은 man:nmdm[4]을 참조하세요.
ru: Преимуществом является обёртывание консоли bhyve в инструмент управления сеансами, например package:sysutils/tmux[] или package:sysutils/screen[], чтобы иметь возможность отключаться и подключаться к консоли. Также можно сделать консоль bhyve нуль-модемным устройством, доступным через `cu`. Для этого загрузите модуль ядра [.filename]#nmdm# и замените `-l com1,stdio` на `-l com1,/dev/nmdm0A`. Устройства [.filename]#/dev/nmdm# создаются автоматически по мере необходимости, где каждое представляет собой пару, соответствующую двум концам нуль-модемного кабеля ([.filename]#/dev/nmdm0A# и [.filename]#/dev/nmdm0B#). Подробнее см. в man:nmdm[4].

source: To disconnect from a console, enter a newline (i.e. press `RETURN`) followed by tilde (`~`), and finally dot (`.`). Keep in mind that only the connection is dropped while the login session remains active. Another user connecting to the same console could therefore make use of any active sessions without having to first authenticate. For security reasons, it's therefore recommended to logout before disconnecting.
ru: Чтобы отключиться от консоли, введите перевод строки (т.е. нажмите `RETURN`), затем тильду (`~`) и точку (`.`). Учтите, что разрывается только соединение, а сеанс входа в систему остаётся активным. Таким образом, другой пользователь, подключившись к той же консоли, может воспользоваться активными сеансами без необходимости аутентификации. По соображениям безопасности рекомендуется выйти из системы перед отключением.

source: The number in the [.filename]#nmdm# device path must be unique for each virtual machine and must not be used by any other processes before bhyve starts. The number can be chosen arbitrarily and does not need to be taken from a consecutive sequence of numbers. The device node pair (i.e. [.filename]#/dev/nmdm0a# and [.filename]#/dev/nmdm0b#) are created dynamically when bhyve connects its console and destroyed when it shuts down. Keep this in mind when creating scripts to start your virtual machines: you need to make sure that all virtual machines are assigned unique [.filename]#nmdm# devices.
ru: Число в пути устройства [.filename]#nmdm# должно быть уникальным для каждой виртуальной машины и не должно использоваться другими процессами до запуска bhyve. Это число можно выбирать произвольно, оно не обязательно должно быть взято из последовательного ряда чисел. Пара узлов устройств (например, [.filename]#/dev/nmdm0a# и [.filename]#/dev/nmdm0b#) создаётся динамически при подключении консоли bhyve и уничтожается при её завершении. Учитывайте это при создании скриптов для запуска виртуальных машин: необходимо убедиться, что всем виртуальным машинам назначены уникальные устройства [.filename]#nmdm#.

source: Managing Virtual Machines
ko: 가상 머신 관리하기
ru: Управление виртуальными машинами

source: A device node is created in [.filename]#/dev/vmm# for each virtual machine. This allows the administrator to easily see a list of the running virtual machines:
ko: 장치 노드는 각 가상 머신에 대해 [.filename]#/dev/vmm#를 생성합니다. 이를 통해 관리자는 실행 중인 가상 머신의 목록을 쉽게 확인할 수 있습니다:
ru: Для каждой виртуальной машины создается узел устройства в [.filename]#/dev/vmm#. Это позволяет администратору легко просматривать список работающих виртуальных машин:

source: A specified virtual machine can be destroyed using `bhyvectl`:
ko: 지정된 가상 머신은 `bhyvectl`을 사용하여 파괴할 수 있습니다:
ru: Указанную виртуальную машину можно уничтожить с помощью `bhyvectl`:

source: Destroying a virtual machine this way means killing it immediately. Any unsaved data will be lost, open files and filesystems may get corrupted. To gracefully shut down a virtual machine, send a `TERM` signal to its bhyve process instead. This triggers an ACPI shutdown event for the guest:
ru: Уничтожение виртуальной машины таким способом означает её немедленное завершение. Все несохранённые данные будут потеряны, открытые файлы и файловые системы могут быть повреждены. Для корректного завершения работы виртуальной машины отправьте сигнал `TERM` её процессу bhyve. Это инициирует событие ACPI завершения работы для гостевой системы:

source: Tools and Utilities
ru: Инструменты и утилиты

source: There are numerous utilities and applications available in ports to help simplify setting up and managing bhyve virtual machines:
ru: В портах доступно множество утилит и приложений, которые помогают упростить настройку и управление виртуальными машинами bhyve:

source: bhyve Managers
ru: Менеджеры bhyve

source: Name
ru: Имя

source: License
ru: Лицензия

source: Package
ru: Пакет

source: link:https://github.com/churchers/vm-bhyve[Documentation]
ru: link:https://github.com/churchers/vm-bhyve[Документация]

source: link:https://github.com/cbsd/cbsd/tree/develop/share/docs[Documentation]
ru: link:https://github.com/cbsd/cbsd/tree/develop/share/docs[Документация]

source: link:https://virt-manager.org/[Documentation]
ru: link:https://virt-manager.org/[Документация]

source: Unknown
ru: Неизвестно

source: link:https://www.freshports.org/sysutils/bhyve-rc/[Documentation]
ru: link:https://www.freshports.org/sysutils/bhyve-rc/[Документация]

source: link:https://github.com/yuichiro-naito/bmd[Documentation]
ru: link:https://github.com/yuichiro-naito/bmd[Документация]

source: link:https://github.com/christian-moerz/vmstated[Documentation]
ru: link:https://github.com/christian-moerz/vmstated[Документация]

source: Persistent Configuration
ko: 영구적 구성
ru: Постоянная конфигурация

source: In order to configure the system to start bhyve guests at boot time, some configuration file changes are required.
ru: Для настройки системы на автоматический запуск гостевых систем bhyve при загрузке необходимо внести изменения в некоторые конфигурационные файлы.

source: When using [.filename]#tap# interfaces as network backend, you either need to manually set each used [.filename]#tap# interface to UP or simply set the following sysctl:
ru: При использовании интерфейсов [.filename]#tap# в качестве сетевого бэкенда необходимо либо вручную переводить каждый используемый интерфейс [.filename]#tap# в состояние UP, либо просто установить следующий параметр sysctl:

source: To connect your virtual machine's [.filename]#tap# device to the network via a [.filename]#bridge#, you need to persist the device settings in [.filename]#/etc/rc.conf#. Additionally, you can load the necessary kernel modules `vmm` for bhyve and `nmdm` for [.filename]#nmdm# devices through the `kld_list` configuration variable. When configuring `ifconfig_bridge0`, make sure to replace `<ipaddr>/<netmask>` with the actual IP address of your physical interface ([.filename]#igb0# in this example) and remove IP settings from your physical device.
ru: Чтобы подключить устройство [.filename]#tap# вашей виртуальной машины к сети через [.filename]#bridge#, необходимо сохранить настройки устройства в [.filename]#/etc/rc.conf#. Дополнительно можно загрузить необходимые модули ядра `vmm` для bhyve и `nmdm` для устройств [.filename]#nmdm# через переменную конфигурации `kld_list`. При настройке `ifconfig_bridge0` убедитесь, что заменили `<ipaddr>/<netmask>` на реальный IP-адрес вашего физического интерфейса ([.filename]#igb0# в данном примере) и удалите IP-настройки с вашего физического устройства.

source: Setting the IP for a bridge device
ru: Установка IP для устройства bridge

source: For a host with an _igb0_ interface connected to the network with IP `10.10.10.1` and netmask `255.255.255.0`, you would use the following commands:
ru: Для хоста с интерфейсом _igb0_, подключенным к сети с IP `10.10.10.1` и маской подсети `255.255.255.0`, следует использовать следующие команды:

source: Modifying the IP address configuration of a system may lock you out if you are executing these commands while you are connected remotely (i.e. via SSH)! Take precautions to maintain system access or make those modifications while logged in on a local terminal session.
ru: Изменение конфигурации IP-адреса системы может заблокировать ваш доступ, если вы выполняете эти команды, подключившись удаленно (например, через SSH)! Примите меры предосторожности, чтобы сохранить доступ к системе, или вносите эти изменения, работая в локальной терминальной сессии.

source: FreeBSD as a Xen(TM)-Host
ko: Xen(TM) 호스트로서의 FreeBSD
ru: FreeBSD в качестве хоста Xen(TM)
