Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: If man:ntpd[8] or man:ntpdate[8] is used, disable host time synchronization:
ko: man:ntpd[8] 또는 man:ntpdate[8]을 사용하는 경우, 호스트 시간 동기화를 비활성화합니다:
ru: Если используется man:ntpd[8] или man:ntpdate[8], отключите синхронизацию времени хоста:

source: Xorg will automatically recognize the `vboxvideo` driver. It can also be manually entered in [.filename]#/etc/X11/xorg.conf#:
ko: Xorg는 `vboxvideo` 드라이버를 자동으로 인식합니다. 또한 [.filename]#/etc/X11/xorg.conf#에 수동으로 입력할 수도 있습니다:
ru: Xorg автоматически распознает драйвер `vboxvideo`. Его также можно вручную добавить в [.filename]#/etc/X11/xorg.conf#:

source: To use the `vboxmouse` driver, adjust the mouse section in [.filename]#/etc/X11/xorg.conf#:
ko: `vboxmouse` 드라이버를 사용하려면 [.filename]#/etc/X11/xorg.conf#에서 마우스 섹션을 조정합니다:
ru: Чтобы использовать драйвер `vboxmouse`, измените раздел мыши в [.filename]#/etc/X11/xorg.conf#:

source: Shared folders for file transfers between host and VM are accessible by mounting them using `mount_vboxvfs`. A shared folder can be created on the host using the VirtualBox GUI or via `vboxmanage`. For example, to create a shared folder called _myshare_ under [.filename]#/mnt/bsdboxshare# for the VM named _BSDBox_, run:
ko: 호스트와 VM 간의 파일 전송을 위한 공유 폴더는 `mount_vboxvfs`를 사용하여 마운트 후 액세스할 수 있습니다. 공유 폴더는 VirtualBox GUI를 사용하거나 `vboxmanage`를 통해 호스트에서 생성할 수 있습니다. 예를 들어, _BSDBox_라는 VM에 대해 [.filename]#/mnt/bsdboxshare# 아래에 _myshare_라는 공유 폴더를 생성하려면 다음을 실행합니다:
ru: Общие папки для передачи файлов между хостом и виртуальной машиной доступны путем их монтирования с помощью `mount_vboxvfs`. Общую папку можно создать на хосте через графический интерфейс VirtualBox или с помощью `vboxmanage`. Например, чтобы создать общую папку с именем _myshare_ в [.filename]#/mnt/bsdboxshare# для виртуальной машины с именем _BSDBox_, выполните:

source: Note that the shared folder name must not contain spaces. Mount the shared folder from within the guest system like this:
ko: 공유 폴더 이름에 공백이 없어야 한다는 점에 유의하세요. 게스트 시스템 내에서 공유 폴더를 다음과 같이 마운트합니다:
ru: Обратите внимание, что имя общей папки не должно содержать пробелов. Подключите общую папку из гостевой системы следующим образом:

source: FreeBSD as a Host with VirtualBox(TM)
ko: VirtualBox(TM)를 사용하는 호스트로서의 FreeBSD
ru: FreeBSD в качестве хоста с VirtualBox(TM)

source: VirtualBox(TM) is an actively developed, complete virtualization package, that is available for most operating systems including Windows(R), macOS(R), Linux(R) and FreeBSD. It is equally capable of running Windows(R) or UNIX(R)-like guests. It is released as open source software, but with closed-source components available in a separate extension pack. These components include support for USB 2.0 devices. More information may be found on the http://www.virtualbox.org/wiki/Downloads[Downloads page of the VirtualBox(TM) wiki]. Currently, these extensions are not available for FreeBSD.
ko: VirtualBox(TM)는 활발하게 개발되고 있는 완벽한 가상화 패키지로, Windows(R), macOS(R), Linux(R) 및 FreeBSD를 포함한 대부분의 운영 체제에서 사용할 수 있습니다. Windows(R) 또는 UNIX(R)와 유사한 게스트도 동일하게 실행할 수 있습니다. 오픈 소스 소프트웨어로 출시되지만 별도의 확장 팩으로 제공되는 폐쇄 소스 구성 요소를 사용할도 수 있습니다. 이러한 구성 요소에는 USB 2.0 장치에 대한 지원이 포함됩니다. 자세한 내용은 http://www.virtualbox.org/wiki/Downloads[VirtualBox(TM) 위키의 다운로드 페이지]에서 확인할 수 있습니다. 현재 이러한 확장 기능은 FreeBSD에서 사용할 수 없습니다.
ru: VirtualBox(TM) — это активно развивающийся комплексный пакет виртуализации, доступный для большинства операционных систем, включая Windows(R), macOS(R), Linux(R) и FreeBSD. Он одинаково хорошо подходит для запуска гостевых систем Windows(R) или UNIX(R)-подобных ОС. Программа распространяется как открытое программное обеспечение, но с проприетарными компонентами, доступными в отдельном пакете расширений. Эти компоненты включают поддержку устройств USB 2.0. Дополнительную информацию можно найти на http://www.virtualbox.org/wiki/Downloads[странице загрузок вики VirtualBox(TM)]. В настоящее время эти расширения недоступны для FreeBSD.

source: Installing VirtualBox(TM)
ko: VirtualBox(TM) 설치하기
ru: Установка VirtualBox(TM)

source: VirtualBox(TM) is available as a FreeBSD package or port in package:emulators/virtualbox-ose[]. The port can be installed using these commands:
ko: VirtualBox(TM)는 FreeBSD 패키지 또는 package:emulators/virtualbox-ose[]의 포트로 제공됩니다. 포트는 다음 명령을 사용하여 설치할 수 있습니다:
ru: VirtualBox(TM) доступен в FreeBSD как пакет или порт в package:emulators/virtualbox-ose[]. Порт можно установить с помощью следующих команд:

source: One useful option in the port's configuration menu is the `GuestAdditions` suite of programs. These provide a number of useful features in guest operating systems, like mouse pointer integration (allowing the mouse to be shared between host and guest without the need to press a special keyboard shortcut to switch) and faster video rendering, especially in Windows(R) guests. The guest additions are available in the menu:Devices[] menu, after the installation of the guest is finished.
ko: 포트의 구성 메뉴에서 유용한 옵션 중 하나는 `GuestAdditions` 프로그램 모음입니다. 이 프로그램은 마우스 포인터 통합(특별한 키보드 단축키를 눌러 전환할 필요 없이 호스트와 게스트 간에 마우스를 공유할 수 있음), 빠른 비디오 렌더링 등 게스트 운영 체제에서 유용한 여러 기능을 제공하며, 특히 Windows(R) 게스트에서 유용합니다. 게스트 추가는 게스트 설치가 완료된 후 메뉴:장치[] 메뉴에서 사용할 수 있습니다.
ru: Одна полезная опция в меню настройки порта — набор программ `GuestAdditions`. Они предоставляют ряд полезных функций в гостевых операционных системах, таких как интеграция указателя мыши (позволяя использовать мышь совместно между хостом и гостем без необходимости нажатия специальной комбинации клавиш для переключения) и ускоренный рендеринг видео, особенно в гостевых системах Windows(R). Гостевые дополнения доступны в меню menu:Devices[] после завершения установки гостевой системы.

source: A few configuration changes are needed before VirtualBox(TM) is started for the first time. The port installs a kernel module in [.filename]#/boot/modules# which must be loaded into the running kernel:
ko: VirtualBox(TM)를 처음 시작하기 전에 몇 가지 구성 변경이 필요합니다. 이 포트는 실행 중인 커널에 로드해야 하는 커널 모듈을 [.filename]#/boot/modules#에 설치합니다:
ru: Для начала работы с VirtualBox(TM) необходимо внести несколько изменений в конфигурацию. Порт устанавливает модуль ядра в [.filename]#/boot/modules#, который должен быть загружен в работающее ядро:

source: To ensure the module is always loaded after a reboot, add this line to [.filename]#/boot/loader.conf#:
ko: 재부팅 후 모듈이 항상 로드되도록 하려면 [.filename]#/boot/loader.conf#에 이 줄을 추가하세요:
ru: Чтобы модуль всегда загружался после перезагрузки, добавьте эту строку в [.filename]#/boot/loader.conf#:

source: To use the kernel modules that allow bridged or host-only networking, add this line to [.filename]#/etc/rc.conf# and reboot the computer:
ko: 브리지 또는 호스트 전용 네트워킹을 허용하는 커널 모듈을 사용하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가하고 컴퓨터를 재부팅하세요:
ru: Для использования модулей ядра, которые позволяют организовать мостовую или гостевую сеть, добавьте следующую строку в [.filename]#/etc/rc.conf# и перезагрузите компьютер:

source: The `vboxusers` group is created during installation of VirtualBox(TM). All users that need access to VirtualBox(TM) will have to be added as members of this group. `pw` can be used to add new members:
ko: VirtualBox(TM)를 설치하는 동안 `vboxusers` 그룹이 생성됩니다. VirtualBox(TM)에 액세스해야 하는 모든 사용자는 이 그룹의 구성원으로 추가해야 합니다. `pw`를 사용하여 새 구성원을 추가할 수 있습니다:
ru: Группа `vboxusers` создается во время установки VirtualBox(TM). Все пользователи, которым необходим доступ к VirtualBox(TM), должны быть добавлены в эту группу. Для добавления новых участников можно использовать `pw`:

source: The default permissions for [.filename]#/dev/vboxnetctl# are restrictive and need to be changed for bridged networking:
ko: [.filename]#/dev/vboxnetctl#에 대한 기본 권한은 제한적이며, 브리지 네트워킹을 위해서는 변경해야 합니다:
ru: Настройки прав доступа по умолчанию для [.filename]#/dev/vboxnetctl# являются ограничительными и требуют изменения для работы мостового соединения:

source: To make this permissions change permanent, add these lines to [.filename]#/etc/devfs.conf#:
ko: 이 권한 변경을 영구적으로 적용하려면 [.filename]#/etc/devfs.conf#에 다음 줄을 추가하세요:
ru: Чтобы сделать это изменение прав постоянным, добавьте следующие строки в [.filename]#/etc/devfs.conf#:

source: To launch VirtualBox(TM), type from an Xorg session:
ko: VirtualBox(TM)를 시작하려면 Xorg 세션에서:
ru: Для запуска VirtualBox(TM) введите в сеансе Xorg:

source: For more information on configuring and using VirtualBox(TM), refer to the http://www.virtualbox.org[official website]. For FreeBSD-specific information and troubleshooting instructions, refer to the http://wiki.FreeBSD.org/VirtualBox[relevant page in the FreeBSD wiki].
ko: VirtualBox(TM)의 구성 및 사용에 대한 자세한 내용은 http://www.virtualbox.org[공식 웹사이트]를 참조하세요. FreeBSD 관련 정보 및 문제 해결 지침은 http://wiki.FreeBSD.org/VirtualBox[FreeBSD 위키의 관련 페이지]를 참조하세요.
ru: Для получения дополнительной информации о настройке и использовании VirtualBox(TM) обратитесь к http://www.virtualbox.org[официальному сайту]. Информация, относящаяся к FreeBSD, и инструкции по устранению проблем доступны на http://wiki.FreeBSD.org/VirtualBox[соответствующей странице wiki FreeBSD].

source: VirtualBox(TM) USB Support
ko: VirtualBox(TM) USB 지원
ru: Поддержка USB в VirtualBox(TM)

source: VirtualBox(TM) can be configured to pass USB devices through to the guest operating system. The host controller of the OSE version is limited to emulating USB 1.1 devices until the extension pack supporting USB 2.0 and 3.0 devices becomes available on FreeBSD.
ko: USB 장치를 게스트 운영 체제로 전달하도록 VirtualBox(TM)를 구성할 수 있습니다. OSE 버전의 호스트 컨트롤러는 USB 2.0 및 3.0 장치를 지원하는 확장 팩이 FreeBSD에서 제공될 때까지 USB 1.1 장치 에뮬레이션으로 제한됩니다.
ru: В VirtualBox(TM) можно настроить передачу USB-устройств в гостевую операционную систему. Хост-контроллер версии OSE ограничен эмуляцией USB 1.1 устройств до тех пор, пока расширение, поддерживающее USB 2.0 и 3.0 устройства, не станет доступным в FreeBSD.

source: For VirtualBox(TM) to be aware of USB devices attached to the machine, the user needs to be a member of the `operator` group.
ko: VirtualBox(TM)가 컴퓨터에 연결된 USB 장치를 인식하려면 사용자가 `operator 그룹의 구성원이어야 합니다.
ru: Чтобы VirtualBox(TM) мог обнаруживать USB-устройства, подключённые к машине, пользователь должен быть членом группы `operator`.

source: Then, add the following to [.filename]#/etc/devfs.rules#, or create this file if it does not exist yet:
ko: 그런 다음 [.filename]#/etc/devfs.rules#에 다음을 추가하거나 이 파일이 아직 없는 경우 파일을 만듭니다:
ru: Затем добавьте следующее в [.filename]#/etc/devfs.rules# или создайте этот файл, если он ещё не существует:

source: To load these new rules, add the following to [.filename]#/etc/rc.conf#:
ko: 이러한 새 규칙을 로드하려면 [.filename]#/etc/rc.conf#에 다음을 추가하세요:
ru: Чтобы загрузить эти новые правила, добавьте следующее в [.filename]#/etc/rc.conf#:

source: Then, restart devfs:
ko: 그런 다음 devfs를 다시 시작합니다:
ru: Затем перезапустите devfs:

source: Restart the login session and VirtualBox(TM) for these changes to take effect, and create USB filters as necessary.
ko: 변경 사항을 적용하려면 로그인 세션과 VirtualBox(TM)를 다시 시작하고 필요에 따라 USB 필터를 만드세요.
ru: Перезапустите сеанс входа и VirtualBox(TM), чтобы изменения вступили в силу, и при необходимости создайте фильтры USB.

source: VirtualBox(TM) Host DVD/CD Access
ko: VirtualBox(TM) 호스트 DVD/CD 액세스
ru: Виртуальный DVD/CD-доступ хоста VirtualBox(TM)

source: Access to the host DVD/CD drives from guests is achieved through the sharing of the physical drives. Within VirtualBox(TM), this is set up from the Storage window in the Settings of the virtual machine. If needed, create an empty IDECD/DVD device first. Then choose the Host Drive from the popup menu for the virtual CD/DVD drive selection. A checkbox labeled `Passthrough` will appear. This allows the virtual machine to use the hardware directly. For example, audio CDs or the burner will only function if this option is selected.
ko: 게스트가 호스트 DVD/CD 드라이브에 액세스하는 것은 물리적 드라이브 공유를 통해 이루어집니다. 가상 머신의 설정에 있는 스토리지 창에서 이 기능을 설정할 수 있습니다. 필요한 경우 먼저 빈 IDECD/DVD 장치를 생성합니다. 그런 다음 가상 CD/DVD 드라이브 선택 팝업 메뉴에서 호스트 드라이브를 선택합니다. `Passthrough`라고 표시된 확인란이 나타납니다. 이렇게 하면 가상 머신이 하드웨어를 직접 사용할 수 있습니다. 예를 들어, 오디오 CD나 버너는 이 옵션을 선택한 경우에만 작동합니다.
ru: Доступ к DVD/CD-приводам хоста из гостевых систем обеспечивается путем совместного использования физических приводов. В VirtualBox(TM) это настраивается в окне `Хранилище` (Storage) в настройках (Settings) виртуальной машины. При необходимости сначала создайте пустое устройство IDECD/DVD. Затем выберите `Привод хоста` (Host drive) из всплывающего меню для выбора виртуального привода CD/DVD. Появится флажок с меткой `Сквозной доступ` (Passthrough). Это позволяет виртуальной машине использовать оборудование напрямую. Например, аудио-CD или записывающее устройство будут работать только при выборе этой опции.

source: In order for users to be able to use VirtualBox(TM)DVD/CD functions, they need access to [.filename]#/dev/xpt0#, [.filename]#/dev/cdN#, and [.filename]#/dev/passN#. This is usually achieved by making the user a member of `operator`. Permissions to these devices have to be corrected by adding these lines to [.filename]#/etc/devfs.conf#:
ko: 사용자가 VirtualBox(TM)의 DVD/CD 기능을 사용하려면 [.filename]#/dev/xpt0#, [.filename]#/dev/cdN# 및 [.filename]#/dev/passN#에 액세스할 수 있어야 합니다. 이는 일반적으로 사용자를 `operator`의 멤버로 설정하면 됩니다. 이러한 장치에 대한 권한은 [.filename]#/etc/devfs.conf#에 다음을 추가하여 수정해야 합니다:
ru: Для того чтобы пользователи могли использовать функции VirtualBox(TM) для работы с DVD/CD, им необходим доступ к [.filename]#/dev/xpt0#, [.filename]#/dev/cdN# и [.filename]#/dev/passN#. Обычно это достигается путем добавления пользователя в группу `operator`. Права доступа к этим устройствам можно настроить, добавив следующие строки в [.filename]#/etc/devfs.conf#:

source: Virtualization with QEMU on FreeBSD
ru: Виртуализация с QEMU на FreeBSD

source: link:https://www.qemu.org[QEMU] is a generic machine emulator and virtualizer that is completely open source software. It is developed by a large, active community and provides support for FreeBSD, OpenBSD, and NetBSD as well as other operating systems.
ru: link:https://www.qemu.org[QEMU] — это универсальный эмулятор и виртуализатор машин, представляющий собой полностью открытое программное обеспечение. Он разрабатывается большим активным сообществом и поддерживает FreeBSD, OpenBSD, NetBSD, а также другие операционные системы.

source: From the link:https://www.qemu.org/docs/master/[QEMU documentation]:
ru: link:https://www.qemu.org/docs/master/[Документация QEMU]:

source: QEMU can be used in several different ways. The most common is for System Emulation, where it provides a virtual model of an entire machine (CPU, memory, and emulated devices) to run a guest OS. In this mode the CPU may be fully emulated, or it may work with a hypervisor such as `KVM`, `Xen` or `Hypervisor.Framework` to allow the guest to run directly on the host CPU.
ru: QEMU можно использовать несколькими способами. Наиболее распространённый — это эмуляция системы, при которой предоставляется виртуальная модель всей машины (процессор, память и эмулируемые устройства) для запуска гостевой ОС. В этом режиме процессор может быть полностью эмулирован или работать с гипервизором, таким как `KVM`, `Xen` или `Hypervisor.Framework`, что позволяет гостевой системе выполняться непосредственно на процессоре хоста.

source: The second supported way to use QEMU is User Mode Emulation, where QEMU can launch processes compiled for one CPU on another CPU. In this mode the CPU is always emulated.
ru: Второй поддерживаемый способ использования QEMU — это эмуляция пользовательского режима, при которой QEMU может запускать процессы, скомпилированные для одного ЦП, на другом ЦП. В этом режиме ЦП всегда эмулируется.

source: QEMU also provides a number of standalone command line utilities, such as the man:qemu-img[1] disk image utility that allows one to create, convert, and modify disk images.
ru: QEMU также предоставляет ряд автономных утилит командной строки, таких как утилита для работы с образами дисков man:qemu-img[1], которая позволяет создавать, преобразовывать и изменять образы дисков.

source: QEMU can emulate a wide number of architectures including `Arm(TM)`, `i386`, `x86_64`, `MIPS(TM)`, `s390X`, `SPARC(TM)` (Sparc(TM) and Sparc64(TM)), and others. The list of link:https://www.qemu.org/docs/master/system/targets.html#system-targets-ref[QEMU System Emulator Targets] is regularly kept up to date.
ru: QEMU может эмулировать широкий спектр архитектур, включая `Arm(TM)`, `i386`, `x86_64`, `MIPS(TM)`, `s390X`, `SPARC(TM)` (Sparc(TM) и Sparc64(TM)), и другие. Список link:https://www.qemu.org/docs/master/system/targets.html#system-targets-ref[целевых систем QEMU System Emulator] регулярно обновляется.

source: This section describes how to use QEMU for both System Emulation and User Mode Emulation on FreeBSD, and provides examples of using QMEU commands and command line utilities.
ru: Этот раздел описывает, как использовать QEMU для системной эмуляции и эмуляции пользовательского режима в FreeBSD, а также содержит примеры использования команд QEMU и утилит командной строки.

source: Installing QEMU Software
ru: Установка программы QEMU

source: QEMU is available as a FreeBSD package or as a port in package:emulators/qemu[]. The package build includes sane options and defaults for most users and is the recommended method of installation.
ru: QEMU доступен в виде пакета FreeBSD или порта в package:emulators/qemu[]. Сборка пакета включает разумные опции и настройки по умолчанию для большинства пользователей и является рекомендуемым способом установки.

source: The package installation includes several dependencies. Once the installation is complete, create a link to the host version of QEMU that will be used most often. If the host is an Intel(TM) or AMD(TM) 64 bit system that will be:
ru: Установка пакета включает несколько зависимостей. После завершения установки создайте ссылку на основную версию QEMU для хоста, которая будет использоваться чаще всего. Если хост — 64-битная система Intel(TM) или AMD(TM), это будет:

source: Test the installation by running the following command as a non-root user:
ru: Протестируйте установку, выполнив следующую команду от имени непривилегированного пользователя:

source: This brings up a window with QEMU actively trying to boot from hard disk, floppy disk, DVD/CD, and PXE. Nothing has been set up yet, so the command will produce several errors and end with "No bootable device" as shown in crossref:virtualization[qemu-nullboot,Figure {counter:figure}]. However, it does show that the QEMU software has been installed correctly.
ru: Открывается окно, в котором QEMU активно пытается загрузиться с жёсткого диска, дискеты, DVD/CD и PXE. Пока ничего не настроено, поэтому команда выдаст несколько ошибок и завершится сообщением «No bootable device» (Нет загрузочного устройства), как показано на crossref:virtualization[qemu-nullboot,рисунке {counter:figure}]. Тем не менее, это подтверждает, что ПО QEMU установлено корректно.

source: QEMU with no bootable image
ru: QEMU без загрузочного образа

source: Virtual Machine Install
ru: Установка виртуальной машины

source: QEMU is under very active development. Features and command options can change from one version to the next. This section provides examples developed with QEMU version 9.0.1 (Summer, 2024). When in doubt, always consult the link:https://www.qemu.org/docs/master/[QEMU Documentation] particularly the link:https://www.qemu.org/docs/master/about/index.html[About QEMU] page which has links to supported build platforms, emulation, deprecated features, and removed features.
ru: QEMU находится в стадии активной разработки. Возможности и параметры команд могут меняться от одной версии к другой. В этом разделе приведены примеры, разработанные с использованием QEMU версии 9.0.1 (лето 2024 года). В случае сомнений всегда обращайтесь к link:https://www.qemu.org/docs/master/[документации QEMU], особенно к странице link:https://www.qemu.org/docs/master/about/index.html[О QEMU], где содержатся ссылки на поддерживаемые платформы сборки, эмуляцию, устаревшие и удалённые возможности.

source: Follow the steps below to create two virtual machines named "*left*", and "*right*". Most commands can be performed without root privileges.
ru: Выполните следующие шаги, чтобы создать две виртуальные машины с именами `*left*` и `*right*`. Большинство команд можно выполнять без привилегий root.

source: Create a test environment to work with QEMU:
ru: Создайте тестовую среду для работы с QEMU:

source: The [.filename]#SCRIPTS# directory is for startup scripts and utilities. The [.filename]#ISO# directory is for the guest ISO boot images. The [.filename]#VM# directory is where the virtual machine images (`VMs`) will reside.
ru: Каталог [.filename]#SCRIPTS# предназначен для стартовых скриптов и утилит. Каталог [.filename]#ISO# содержит загрузочные ISO-образы для гостевых систем. В каталоге [.filename]#VM# хранятся образы виртуальных машин (`ВМ`).

source: Download a recent copy of FreeBSD into [.filename]#~/QEMU/ISO#:
ru: Скачайте свежую копию FreeBSD в [.filename]#~/QEMU/ISO#:

source: Once the download is complete create a shorthand link. This shorthand link is used in the startup scripts below.
ru: После завершения загрузки создайте сокращенную ссылку. Эта сокращенная ссылка используется в скриптах запуска ниже.

source: Change directory to the location for virtual machines ([.filename]#~/QEMU/VM#). Run man:qemu-img[1] to create the disk images for the “left” VM:
ru: Перейдите в каталог для виртуальных машин ([.filename]#~/QEMU/VM#). Запустите man:qemu-img[1] для создания образов дисков виртуальной машины "left":

source: The QEMU `raw` format is designed for performance. The format is straightforward and has no overhead which makes it faster, especially for high performance or high throughput scenarios. The use case is for maximum performance where no additional features, such as snapshots, are needed. This format is used in the script for the "left" VM below.
ru: Формат `raw` в QEMU предназначен для обеспечения высокой производительности. Этот формат прост и не имеет накладных расходов, что делает его быстрее, особенно в сценариях с высокой производительностью или высокой пропускной способностью. Он используется в случаях, когда требуется максимальная производительность, а дополнительные функции, такие как снимки состояния, не нужны. Этот формат используется в скрипте для виртуальной машины "left", приведённой ниже.

source: A separate format is `qcow2` which uses QEMU's "copy on write" technique for managing disk space. This technique does not require a complete 15G disk, just a stub version that is managed directly by the VM. The disk grows dynamically as the VM writes to it. This format supports snapshots, compression, and encryption. The use case for this format is for development, testing, and scenarios with the need of these advanced features. This format is used in the script for the "right" VM below.
ru: Отдельным форматом является `qcow2`, который использует технологию QEMU "копирования при записи" для управления дисковым пространством. Эта технология не требует полного диска размером 15G, а лишь заготовку, которой напрямую управляет виртуальная машина. Диск растёт динамически по мере записи данных виртуальной машиной. Этот формат поддерживает снимки состояния, сжатие и шифрование. Его применение целесообразно в разработке, тестировании и сценариях, требующих этих расширенных возможностей. Данный формат используется в скрипте для виртуальной машины "right" ниже.

source: Run man:qemu-img[1] again to create the disk image for the "right" VM using `qcow2`:
ru: Снова выполните man:qemu-img[1], чтобы создать образ диска для ВМ "right", используя `qcow2`:

source: To see the actual size of the file use:
ru: Чтобы увидеть фактический размер файла, используйте:
