Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: Virtualization software allows multiple operating systems to run simultaneously on the same computer
ko: 가상화 소프트웨어를 사용하면 동일한 컴퓨터에서 여러 운영 체제를 동시에 실행할 수 있습니다
ru: Программное обеспечение виртуализации позволяет нескольким операционным системам работать одновременно на одном компьютере

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 24. Virtualization
ru: Глава 24. Виртуализация

source: Virtualization
ko: 가상화
ru: Виртуализация

source: Synopsis
ko: 요약
ru: Обзор

source: Virtualization software allows multiple operating systems to run simultaneously on the same computer. Such software systems for PCs often involve a host operating system which runs the virtualization software and supports any number of guest operating systems.
ko: 가상화 소프트웨어를 사용하면 동일한 컴퓨터에서 여러 운영 체제를 동시에 실행할 수 있습니다. 이러한 PC용 소프트웨어 시스템에는 가상화 소프트웨어를 실행하고 여러 개의 게스트 운영 체제를 지원하는 호스트 운영 체제가 포함되는 경우가 많습니다.
ru: Программное обеспечение виртуализации позволяет нескольким операционным системам работать одновременно на одном компьютере. Такие программные системы для ПК часто включают основную операционную систему, которая запускает ПО виртуализации и поддерживает произвольное количество гостевых операционных систем.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: The difference between a host operating system and a guest operating system.
ko: 호스트 운영 체제와 게스트 운영 체제의 차이점.
ru: Разница между основной операционной системой и гостевой операционной системой.

source: How to install FreeBSD on the following virtualization platforms:
ko: 다음 가상화 플랫폼에 FreeBSD를 설치하는 방법:
ru: Как установить FreeBSD на следующие платформы виртуализации:

source: VirtualBox(TM)(Microsoft(R) Windows(R), Intel(R)-based Apple(R) macOS(R), Linux)
ru: VirtualBox(TM)(Microsoft(R) Windows(R), Apple(R) macOS(R) на базе Intel(R), Linux)

source: How to tune a FreeBSD system for best performance under virtualization.
ko: 가상화에서 최상의 성능을 발휘하도록 FreeBSD 시스템을 튜닝하는 방법.
ru: Как настроить систему FreeBSD для достижения наилучшей производительности при виртуализации.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Understand the crossref:basics[basics,basics of UNIX(R) and FreeBSD].
ko: crossref:basics[basics,basics of UNIX(R) and FreeBSD]를 이해합니다.
ru: Понимайте crossref:basics[basics,основы UNIX(R) и FreeBSD].

source: Know how to crossref:bsdinstall[bsdinstall,install FreeBSD].
ko: crossref:bsdinstall[bsdinstall,install FreeBSD]방법.
ru: Знать, как crossref:bsdinstall[bsdinstall,установить FreeBSD].

source: Know how to crossref:advanced-networking[advanced-networking,set up a network connection].
ko: crossref:advanced-networking[advanced-networking,set up a network connection] 방법.
ru: Уметь настраивать сетевое соединение, как описано в crossref:advanced-networking[advanced-networking,разделе по расширенной настройке сети].

source: Know how to crossref:ports[ports,install additional third-party software].
ko: crossref:ports[ports,install additional third-party software] 방법.
ru: Знать, как crossref:ports[ports,установить дополнительное стороннее программное обеспечение].

source: FreeBSD as a Guest on Parallels Desktop for macOS(R)
ko: macOS(R)용 Parallels Desktop에서 게스트로서의 FreeBSD
ru: FreeBSD в качестве гостевой системы в Parallels Desktop для macOS(R)

source: Parallels Desktop for Mac(R) is a commercial software product available for Apple(R) Mac(R) computers running macOS(R) 10.14.6 or higher. FreeBSD is a fully supported guest operating system. Once Parallels has been installed on macOS(R), the user must configure a virtual machine and then install the desired guest operating system.
ko: Mac(R)용 Parallels Desktop은 macOS(R) 10.14.6 이상을 실행하는 Apple(R) Mac(R) 컴퓨터에서 사용할 수 있는 상용 소프트웨어 제품입니다. FreeBSD를 완전히 지원하는 게스트 운영 체제입니다. Parallels가 macOS(R)에 설치되면 사용자는 가상 머신을 구성한 다음 원하는 게스트 운영 체제를 설치할 수 있습니다.
ru: Parallels Desktop for Mac(R) - это коммерческий программный продукт, доступный для компьютеров Apple(R) Mac(R) под управлением macOS(R) 10.14.6 или новее. FreeBSD является полностью поддерживаемой гостевой операционной системой. После установки Parallels на macOS(R) пользователь должен настроить виртуальную машину и затем установить желаемую гостевую операционную систему.

source: Installing FreeBSD on Parallels Desktop on Mac(R)
ko: Mac(R)의 Parallels Desktop에 FreeBSD 설치하기
ru: Установка FreeBSD на Parallels Desktop на Mac(R)

source: The first step in installing FreeBSD on Parallels is to create a new virtual machine for installing FreeBSD.
ko: Parallels에 FreeBSD를 설치하는 첫 번째 단계는 FreeBSD 설치를 위한 새로운 가상 머신을 생성하는 것입니다.
ru: Первым шагом при установке FreeBSD на Parallels является создание новой виртуальной машины для установки FreeBSD.

source: Choose menu:Install Windows or another OS from a DVD or image file[] and proceed.
ko: 메뉴: DVD 또는 image file[]에서 Windows 또는 다른 OS 설치를 선택하고 계속 진행합니다.
ru: Выберите menu:Установка Windows или другой ОС с DVD или файла образа[] и продолжите.

source: Parallels setup wizard showing Install Windows or another OS from a DVD or image file chosen
ko: 선택한 DVD 또는 이미지 파일에서 Windows 또는 다른 OS 설치를 표시하는 Parallels 설치 마법사
ru: Мастер настройки Parallels с выбранным пунктом "Установить Windows или другую ОС с DVD или из файла образа"

source: Select the FreeBSD image file.
ko: FreeBSD 이미지 파일을 선택합니다.
ru: Выберите файл образа FreeBSD.

source: Parallels setup wizard showing FreeBSD image file selected
ko: 선택한 FreeBSD 이미지 파일을 표시하는 Parallels 설치 마법사
ru: Мастер настройки Parallels с выбранным образом FreeBSD

source: Choose menu:Other as operating system[].
ko: 메뉴: 기타를 운영 체제[]를 선택합니다.
ru: Выберите menu:Другое в качестве операционной системы[].

source: Choosing FreeBSD will cause boot error on startup.
ko: FreeBSD를 선택하면 시작 시 부팅 오류가 발생합니다.
ru: Выбор FreeBSD приведет к ошибке загрузки при запуске.

source: Parallels setup wizard showing Other selected as operating system
ko: 기타를 운영 체제로 선택한 Parallels 설정 마법사
ru: Мастер настройки Parallels, показывающий "Другое как операционной система"

source: Name the virtual machine and check menu:Customize settings before installation[]
ko: 가상 머신 이름을 짓고 및 메뉴 확인: 설치 전 설정 사용자 설정[]
ru: Назовите виртуальную машину и отметьте пункт menu:Настроить параметры перед установкой (Customize settings before installation)[]

source: Parallels setup wizard showing the checkbox checked for customizing settings before installation
ko: 설치 전 설정 사용자 지정 확인란이 선택되어 있는 Parallels 설치 마법사 화면
ru: Мастер настройки Parallels с отмеченным флажком для настройки параметров перед установкой

source: When the configuration window pops up, go to menu:Hardware[] tab, choose menu:Boot order[], and click menu:Advanced[]. Then, choose *EFI 64-bit* as menu:BIOS[].
ko: 구성 창이 나타나면 메뉴:하드웨어[] 탭으로 이동하여 메뉴:부팅 순서[]를 선택한 후 메뉴:고급[]을 클릭합니다. 그런 다음 메뉴:BIOS[]에서 *EFI 64비트*를 선택합니다.
ru: Когда появится окно конфигурации, перейдите на вкладку menu:Hardware[], выберите menu:Boot order[] и нажмите menu:Advanced[]. Затем выберите *EFI 64-bit* в качестве menu:BIOS[].

source: Parallels setup wizard showing EFI 64-bit chosen as BIOS
ko: BIOS로 선택된 EFI 64비트를 보여주는 Parallels 설치 마법사
ru: Мастер настройки Parallels с выбранным EFI 64-bit в качестве BIOS

source: Click menu:OK[], close the configuration window, and click menu:Continue[].
ko: 메뉴:확인[]을 클릭하고 구성 창을 닫은 다음 메뉴:계속[]을 클릭합니다.
ru: Нажмите menu:OK[], закройте окно конфигурации и нажмите menu:Continue[].

source: Parallels setup wizard showing the summary of the new virtual machine
ko: 새 가상 머신의 요약을 보여주는 Parallels 설치 마법사
ru: Мастер настройки Parallels, отображающий сводную информацию о новой виртуальной машине

source: The virtual machine will automatically boot. Install FreeBSD following the general steps.
ko: 가상 머신이 자동으로 부팅됩니다. 일반적인 단계에 따라 FreeBSD를 설치합니다.
ru: Виртуальная машина автоматически загрузится. Установите FreeBSD, следуя общим шагам.

source: FreeBSD booted on Parallels
ko: Parallels에서 부팅된 FreeBSD
ru: FreeBSD загружена в Parallels

source: Configuring FreeBSD on Parallels
ko: Parallels에서 FreeBSD 구성하기
ru: Настройка FreeBSD на Parallels

source: After FreeBSD has been successfully installed on macOS(R) X with Parallels, there are a number of configuration steps that can be taken to optimize the system for virtualized operation.
ko: macOS(R) X 의 Parallels에 FreeBSD를 성공적으로 설치한 후, 시스템을 최적화하기 위해 수행할 수 있는 여러 가지 구성 단계가 있습니다.
ru: После успешной установки FreeBSD на macOS(R) X с использованием Parallels, можно выполнить ряд шагов по настройке для оптимизации системы в виртуальной среде.

source: Set Boot Loader Variables
ko: 부트 로더 변수 설정
ru: Установка переменных загрузчика

source: The most important step is to reduce the `kern.hz` tunable to reduce the CPU utilization of FreeBSD under the Parallels environment. This is accomplished by adding the following line to [.filename]#/boot/loader.conf#:
ko: 가장 중요한 단계는 Parallels 환경에서 FreeBSD의 CPU 사용률을 낮추기 위해 `kern.hz` 튜너블을 낮추는 것입니다. 이는 [.filename]#/boot/loader.conf#에 다음 줄을 추가하여 수행합니다:
ru: Самый важный шаг — уменьшить параметр `kern.hz`, чтобы снизить использование CPU FreeBSD в среде Parallels. Это достигается добавлением следующей строки в [.filename]#/boot/loader.conf#:

source: Without this setting, an idle FreeBSD Parallels guest will use roughly 15% of the CPU of a single processor iMac(R). After this change the usage will be closer to 5%.
ko: 이 설정이 없으면 유휴 상태의 FreeBSD Parallels 게스트는 단일 프로세서 iMac(R) CPU의 약 15%를 사용하게 됩니다. 이 변경 후에는 사용량이 5%에 가까워집니다.
ru: Без этой настройки бездействующая гостевая система FreeBSD в Parallels будет использовать около 15% процессора однопроцессорного iMac(R). После внесения изменений использование снизится до примерно 5%.

source: If installing FreeBSD 14.0 or later, and CPU utilization is still high, add the following additional line to [.filename]#/boot/loader.conf#:
ru: Если установлена FreeBSD 14.0 или более поздняя версия, а использование ЦП по-прежнему высокое, добавьте следующую строку в [.filename]#/boot/loader.conf#:

source: Create a New Kernel Configuration File
ko: 새 커널 구성 파일 생성
ru: Создание нового файла конфигурации ядра

source: All SCSI, FireWire, and USB device drivers can be removed from a custom kernel configuration file. Parallels provides a virtual network adapter used by the man:ed[4] driver, so all network devices except for man:ed[4] and man:miibus[4] can be removed from the kernel.
ru: Все драйверы SCSI, FireWire и USB могут быть удалены из конфигурационного файла собственного ядра. Parallels предоставляет виртуальный сетевой адаптер, используемый драйвером man:ed[4], поэтому все сетевые устройства, кроме man:ed[4] и man:miibus[4], могут быть удалены из ядра.

source: Configure Networking
ko: 네트워킹 구성하기
ru: Настройка сети

source: The most basic networking setup uses DHCP to connect the virtual machine to the same local area network as the host Mac(R). This can be accomplished by adding `ifconfig_ed0="DHCP"` to [.filename]#/etc/rc.conf#. More advanced networking setups are described in crossref:advanced-networking[advanced-networking,Advanced Networking].
ko: 가장 기본적인 네트워킹 설정은 DHCP를 사용하여 가상 머신을 호스트 Mac(R)과 동일한 로컬 영역 네트워크에 연결하는 것입니다. 이 설정은 [.filename]#/etc/rc.conf#에 `ifconfig_ed0="DHCP"`를 추가하여 수행할 수 있습니다. 보다 고급 네트워킹 설정은 crossref:advanced-networking[advanced-networking,Advanced Networking]에 설명되어 있습니다.
ru: Самая базовая настройка сети использует DHCP для подключения виртуальной машины к той же локальной сети, что и хост-компьютер Mac(R). Это можно сделать, добавив `ifconfig_ed0="DHCP"` в [.filename]#/etc/rc.conf#. Более сложные настройки сети описаны в crossref:advanced-networking[advanced-networking,Расширенная настройка сети].

source: FreeBSD as a Guest on VMware Fusion for macOS(R)
ko: macOS(R)용 VMware Fusion에서 게스트로서의 FreeBSD
ru: FreeBSD в качестве гостевой системы на VMware Fusion для macOS(R)

source: VMware Fusion for Mac(R) is a commercial software product available for Apple(R) Mac(R) computers running macOS(R) 12 or higher. FreeBSD is a fully supported guest operating system. Once VMware Fusion has been installed on macOS(R), the user can configure a virtual machine and then install the desired guest operating system.
ko: Mac(R)용 VMware Fusion은 macOS(R) 12 이상을 실행하는 Apple(R) Mac(R) 컴퓨터에서 사용할 수 있는 상용 소프트웨어 제품입니다. FreeBSD는 완벽하게 지원되는 게스트 운영 체제입니다. macOS(R)에 VMware Fusion을 설치한 후 사용자는 가상 머신을 구성한 다음 원하는 게스트 운영 체제를 설치할 수 있습니다.
ru: VMware Fusion для Mac(R) — это коммерческий программный продукт, доступный для компьютеров Apple(R) Mac(R) под управлением macOS(R) 12 или новее. FreeBSD является полностью поддерживаемой гостевой операционной системой. После установки VMware Fusion на macOS(R) пользователь может настроить виртуальную машину и установить желаемую гостевую операционную систему.

source: Installing FreeBSD on VMware Fusion
ko: VMware Fusion에 FreeBSD 설치하기
ru: Установка FreeBSD на VMware Fusion

source: The first step is to start VMware Fusion which will load the Virtual Machine Library. Click [.guimenuitem]#+->New# to create the virtual machine:
ko: 첫 번째 단계는 가상 머신 라이브러리를 로드하는 VMware Fusion을 시작하는 것입니다. [.guimenuitem]#+->New#를 클릭하여 가상 머신을 생성합니다:
ru: Первым шагом является запуск VMware Fusion, который загрузит библиотеку виртуальных машин. Нажмите [.guimenuitem]#+->Создать#, чтобы создать виртуальную машину:

source: This will load the New Virtual Machine Assistant. Choose [.guimenuitem]#Create a custom virtual machine# and click [.guimenuitem]#Continue# to proceed:
ko: 그러면 새 가상 머신 도우미가 로드됩니다. [.guimenuitem]#사용자 지정 가상 머신 만들기#를 선택하고 [.guimenuitem]#계속#을 클릭하여 계속 진행합니다:
ru: Это запустит Мастер создания новой виртуальной машины. Выберите [.guimenuitem]#Создать пользовательскую виртуальную машину# и нажмите [.guimenuitem]#Продолжить#, чтобы продолжить:

source: Select [.guimenuitem]#Other# as the [.guimenuitem]#Operating System# and either [.guimenuitem]#FreeBSD X# or [.guimenuitem]#FreeBSD X 64-bit#, as the menu:Version[] when prompted:
ko: 메시지가 표시되면 [.guimenuem]#Other#를 [.guimenuem]#Operating System#로 선택하고 메뉴:버전[]에서 [.guimenuem]#FreeBSD X# 또는 [.guimenuem]#FreeBSD X 64-bit# 중 하나를 선택합니다:
ru: Выберите [.guimenuitem]#Другое# в качестве [.guimenuitem]#Операционной системы# и либо [.guimenuitem]#FreeBSD X#, либо [.guimenuitem]#FreeBSD X 64-bit# в качестве menu:Версия[] при запросе:

source: Choose the firmware(UEFI is recommended):
ko: 펌웨어를 선택합니다(UEFI 권장):
ru: Выберите прошивку (рекомендуется UEFI):

source: Choose [.guimenuitem]#Create a new virtual disk# and click [.guimenuitem]#Continue#:
ko: [.guimenuitem]#Create a new virtual disk# 를 선택하고 [.guimenuitem]#Continue#를 클릭합니다:
ru: Выберите [.guimenuitem]#Создать новый виртуальный диск# и нажмите [.guimenuitem]#Продолжить#:

source: Check the configuration and click [.guimenuitem]#Finish#:
ko: 구성을 확인하고 [.guimenuitem]#Finish#를 클릭합니다:
ru: Проверьте конфигурацию и нажмите [.guimenuitem]#Завершить#:

source: Choose the name of the virtual machine and the directory where it should be saved:
ko: 가상 머신의 이름과 가상 머신을 저장할 디렉터리를 선택합니다:
ru: Выберите имя виртуальной машины и каталог, в котором она будет сохранена:

source: Press command+E to open virtual machine settings and click [.guimenuitem]#CD/DVD#:
ko: Command+E를 눌러 가상 머신 설정을 열고 [.guimenuitem]#CD/DVD#를 클릭합니다:
ru: Нажмите command+E, чтобы открыть настройки виртуальной машины, и выберите [.guimenuitem]#CD/DVD#:

source: Choose FreeBSD ISO image or from a CD/DVD:
ko: FreeBSD ISO 이미지 또는 CD/DVD를 선택합니다:
ru: Выберите образ FreeBSD в формате ISO или с CD/DVD:

source: Start the virtual machine:
ko: 가상 머신을 시작합니다:
ru: Запустите виртуальную машину:

source: Install FreeBSD as usual:
ko: 평소와 같이 FreeBSD를 설치합니다:
ru: Установите FreeBSD как обычно:

source: Once the install is complete, the settings of the virtual machine can be modified, such as memory usage and the number of CPUs the virtual machine will have access to:
ko: 설치가 완료되면 메모리 사용량, 가상 머신이 액세스할 수 있는 CPU 수 등 가상 머신의 설정을 수정할 수 있습니다:
ru: После завершения установки можно изменить параметры виртуальной машины, такие как использование памяти и количество процессоров, доступных виртуальной машине:

source: The System Hardware settings of the virtual machine cannot be modified while the virtual machine is running.
ko: 가상 머신이 실행 중인 동안에는 가상 머신의 시스템 하드웨어 설정을 수정할 수 없습니다.
ru: Настройки аппаратного обеспечения системы виртуальной машины нельзя изменить во время её работы.

source: The status of the CD-ROM device. Normally the CD/DVD/ISO is disconnected from the virtual machine when it is no longer needed.
ko: CD-ROM 장치의 상태입. 일반적으로 CD/DVD/ISO는 더 이상 필요하지 않을 때 가상 머신에서 연결이 끊어집니다.
ru: Состояние устройства CD-ROM. Обычно CD/DVD/ISO отключается от виртуальной машины, когда в нём больше нет необходимости.

source: The last thing to change is how the virtual machine will connect to the network. To allow connections to the virtual machine from other machines besides the host, choose [.guimenuitem]#Connect directly to the physical network (Bridged)#. Otherwise, [.guimenuitem]#Share the host's internet connection (NAT)# is preferred so that the virtual machine can have access to the Internet, but the network cannot access the virtual machine.
ko: 마지막으로 변경할 사항은 가상 머신이 네트워크에 연결하는 방식입니다. 호스트 이외의 다른 머신에서 가상 머신에 연결할 수 있도록 하려면 [.guimenuitem]#Connect directly to the physical network (Bridged)#을 선택합니다. 그렇지 않으면 가상 머신이 인터넷에 액세스할 수 있지만 네트워크가 가상 머신에 액세스할 수 없도록 [.guimenuitem]#Share the host's internet connection (NAT)#를 선택하는 것이 좋습니다.
ru: Последнее, что нужно изменить, — это способ подключения виртуальной машины к сети. Чтобы разрешить подключения к виртуальной машине с других машин, кроме хоста, выберите [.guimenuitem]#Подключиться напрямую к физической сети (Bridged)#. В противном случае предпочтительнее выбрать [.guimenuitem]#Использовать интернет-подключение хоста (NAT)#, чтобы виртуальная машина имела доступ в Интернет, но сеть не могла получить доступ к виртуальной машине.

source: After modifying the settings, boot the newly installed FreeBSD virtual machine.
ko: 설정을 수정한 후 새로 설치된 FreeBSD 가상 머신을 부팅합니다.
ru: После изменения настроек загрузите новую виртуальную машину с установленной FreeBSD.

source: Configuring FreeBSD on VMware Fusion
ko: VMware Fusion에서 FreeBSD 구성하기
ru: Настройка FreeBSD на VMware Fusion

source: After FreeBSD has been successfully installed on macOS(R) X with VMware Fusion, there are a number of configuration steps that can be taken to optimize the system for virtualized operation.
ko: FreeBSD가 VMware Fusion을 통해 macOS(R) X에 성공적으로 설치한 후에는 가상화된 운영을 위해 시스템을 최적화하기 위해 수행할 수 있는 여러 구성 단계가 있습니다.
ru: После успешной установки FreeBSD на macOS(R) X с использованием VMware Fusion можно выполнить ряд шагов по настройке для оптимизации системы в виртуальной среде.

source: The most important step is to reduce the `kern.hz` tunable to reduce the CPU utilization of FreeBSD under the VMware Fusion environment. This is accomplished by adding the following line to [.filename]#/boot/loader.conf#:
ko: 가장 중요한 단계는 VMware Fusion 환경에서 FreeBSD의 CPU 사용률을 낮추기 위해 `kern.hz` 튜너블을 낮추는 것입니다. 이는 [.filename]#/boot/loader.conf#에 다음 줄을 추가하여 수행됩니다:
ru: Самый важный шаг — уменьшить параметр `kern.hz`, чтобы снизить использование CPU FreeBSD в среде VMware Fusion. Это достигается добавлением следующей строки в [.filename]#/boot/loader.conf#:

source: Without this setting, an idle FreeBSD VMware Fusion guest will use roughly 15% of the CPU of a single processor iMac(R). After this change, the usage will be closer to 5%.
ko: 이 설정을 사용하지 않으면 유휴 FreeBSD VMware Fusion 게스트가 단일 프로세서 iMac(R) CPU의 약 15%를 사용하게 됩니다. 이 변경 후에는 사용량이 5%에 가까워집니다.
ru: Без этой настройки бездействующая гостевая система FreeBSD в VMware Fusion будет использовать около 15% процессора однопроцессорного iMac(R). После внесения изменений использование снизится до примерно 5%.

source: All FireWire, and USB device drivers can be removed from a custom kernel configuration file. VMware Fusion provides a virtual network adapter used by the man:em[4] driver, so all network devices except for man:em[4] can be removed from the kernel.
ru: Все драйверы устройств FireWire и USB могут быть удалены из файла конфигурации собственного ядра. VMware Fusion предоставляет виртуальный сетевой адаптер, используемый драйвером man:em[4], поэтому все сетевые устройства, кроме man:em[4], могут быть удалены из ядра.

source: The most basic networking setup uses DHCP to connect the virtual machine to the same local area network as the host Mac(R). This can be accomplished by adding `ifconfig_em0="DHCP"` to [.filename]#/etc/rc.conf#. More advanced networking setups are described in crossref:advanced-networking[advanced-networking,Advanced Networking].
ko: 가장 기본적인 네트워킹 설정은 DHCP를 사용하여 가상 머신을 호스트 Mac(R)과 동일한 로컬 영역 네트워크에 연결하는 것입니다. 이 설정은 [.filename]#/etc/rc.conf#에 `ifconfig_em0="DHCP"`를 추가하여 수행할 수 있습니다. 보다 고급 네트워킹 설정은 crossref:advanced-networking[advanced-networking,Advanced Networking]에 설명되어 있습니다.
ru: Самая базовая настройка сети использует DHCP для подключения виртуальной машины к той же локальной сети, что и хост-компьютер Mac(R). Это можно сделать, добавив `ifconfig_em0="DHCP"` в [.filename]#/etc/rc.conf#. Более сложные настройки сети описаны в crossref:advanced-networking[advanced-networking,Сложные вопросы работы в сети].

source: Install drivers and open-vm-tools
ko: 드라이버 및 open-vm-tools 설치
ru: Установите драйверы и open-vm-tools

source: To run FreeBSD smoothly on VMWare, drivers should be installed:
ko: VMWare에서 FreeBSD를 원활하게 실행하려면 드라이버를 설치해야 합니다:
ru: Для бесперебойной работы FreeBSD на VMWare необходимо установить драйверы:

source: The xf86 packages are only available for x86 FreeBSD guests.
ru: Пакеты xf86 доступны только для гостевых систем FreeBSD на архитектуре x86.

source: Enabling the mouse
ru: Включение мыши

source: Some users have reported issues using the mouse in the virtual machine. The mouse may be enabled by appending the following to [.filename]#/boot/loader.conf#:
ru: Некоторые пользователи сообщали о проблемах с использованием мыши в виртуальной машине. Мышь можно включить, добавив следующее в [.filename]#/boot/loader.conf#:

source: FreeBSD as a Guest on VirtualBox(TM)
ko: VirtualBox(TM)의 게스트로서의 FreeBSD
ru: FreeBSD в качестве гостевой системы в VirtualBox(TM)

source: FreeBSD works well as a guest in VirtualBox(TM). The virtualization software is available for most common operating systems, including FreeBSD itself.
ko: FreeBSD는 VirtualBox(TM)에서 게스트로서 잘 작동합니다. 이 가상화 소프트웨어는 FreeBSD 자체를 포함하여 대부분의 일반적인 운영 체제에서 사용할 수 있습니다.
ru: FreeBSD хорошо работает в качестве гостевой системы в VirtualBox(TM). Это программное обеспечение виртуализации доступно для большинства распространённых операционных систем, включая саму FreeBSD.

source: The VirtualBox(TM) guest additions provide support for:
ko: VirtualBox(TM) 게스트 추가 기능은 다음을 지원합니다:
ru: Дополнения гостевой ОС VirtualBox(TM) обеспечивают поддержку:

source: Clipboard sharing.
ko: 클립보드 공유.
ru: Общий буфер обмена.

source: Mouse pointer integration.
ko: 마우스 포인터 통합.
ru: Интеграция указателя мыши.

source: Host time synchronization.
ko: 호스트 시간 동기화.
ru: Синхронизация времени хоста.

source: Window scaling.
ko: 창 크기 조정.
ru: Масштабирование окна.

source: Seamless mode.
ko: 심리스 모드.
ru: Бесшовный режим.

source: These commands are run in the FreeBSD guest.
ko: 이러한 명령은 FreeBSD 게스트에서 실행됩니다.
ru: Эти команды выполняются в гостевой системе FreeBSD.

source: First, install the package:emulators/virtualbox-ose-additions[] package or port in the FreeBSD guest. This will install the port:
ko: 먼저, FreeBSD 게스트에 package:emulators/virtualbox-ose-additions[] 패키지 또는 포트를 설치합니다. 그러면 포트가 설치됩니다:
ru: Сначала установите пакет или порт package:emulators/virtualbox-ose-additions[]` в гостевой системе FreeBSD. Это установит порт:

source: Add these lines to [.filename]#/etc/rc.conf#:
ko: 다음을 [.filename]#/etc/rc.conf#에 추가합니다:
ru: Добавьте следующие строки в файл [.filename]#/etc/rc.conf#:
