Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: To begin the installation of the base operating system, start the VNC client, directing it to the main network address of the host or to the IP address defined on the `vnclisten` line of [.filename]#freebsd.cfg#. After the operating system has been installed, shut down the DomU and disconnect the VNC viewer. Edit [.filename]#freebsd.cfg#, removing the line with the `cdrom` definition or commenting it out by inserting a `+#+` character at the beginning of the line. To load this new configuration, it is necessary to remove the old DomU with `xl destroy`, passing either the name or the id as the parameter. Afterwards, recreate it using the modified [.filename]*freebsd.cfg*.
ko: 기본 운영 체제 설치를 시작하려면 VNC 클라이언트를 시작하여 호스트의 기본 네트워크 주소 또는 [.filename]#freebsd.cfg#의 `vnclisten` 줄에 정의된 IP 주소로 안내합니다. 운영 체제를 설치한 후 DomU를 종료하고 VNC 뷰어의 연결을 끊습니다. [.filename]#freebsd.cfg#를 편집하여 `cdrom` 정의가 있는 줄을 제거하거나 줄의 시작 부분에 `+#+` 문자를 삽입하여 주석을 달면 됩니다. 이 새 구성을 로드하려면 이름 또는 아이디를 매개변수로 전달하여 `xl destroy`를 사용하여 이전 DomU를 제거해야 합니다. 그런 다음 수정된 [.filename]*freebsd.cfg*를 사용하여 다시 생성합니다.
ru: Для начала установки базовой операционной системы запустите клиент VNC, указав основной сетевой адрес хоста или IP-адрес, определённый в строке `vnclisten` файла [.filename]#freebsd.cfg#. После установки операционной системы завершите работу DomU и отключите VNC-клиент. Отредактируйте файл [.filename]#freebsd.cfg#, удалив строку с определением `cdrom` или закомментировав её, поставив символ `+#+` в начале строки. Чтобы загрузить новую конфигурацию, необходимо удалить старый DomU командой `xl destroy`, передав в качестве параметра имя или идентификатор. После этого воссоздайте его, используя изменённый файл [.filename]*freebsd.cfg*.

source: The machine can then be accessed again using the VNC viewer. This time, it will boot from the virtual disk where the operating system has been installed and can be used as a virtual machine.
ko: 그런 다음 VNC 뷰어를 사용하여 머신에 다시 액세스할 수 있습니다. 이번에는 운영 체제가 설치된 가상 디스크에서 부팅되어 가상 머신으로 사용할 수 있습니다.
ru: Затем к машине можно снова получить доступ с помощью VNC-клиента. На этот раз она загрузится с виртуального диска, на который была установлена операционная система, и её можно будет использовать как виртуальную машину.

source: Troubleshooting
ko: 문제 해결
ru: Устранение неполадок

source: This section contains basic information in order to help troubleshoot issues found when using FreeBSD as a Xen(TM) host or guest.
ko: 이 섹션에는 FreeBSD를 Xen(TM) 호스트 또는 게스트로 사용할 때 발생하는 문제를 해결하는 데 도움이 되는 기본 정보가 포함되어 있습니다.
ru: Этот раздел содержит основную информацию, которая поможет в устранении проблем, возникающих при использовании FreeBSD в качестве хоста или гостевой системы Xen™.

source: Host Boot Troubleshooting
ko: 호스트 부팅 문제 해결
ru: Устранение неполадок при загрузке хоста

source: Please note that the following troubleshooting tips are intended for Xen(TM) 4.11 or newer. If you are still using Xen(TM) 4.7 and having issues, consider migrating to a newer version of Xen(TM).
ru: Обратите внимание, что следующие советы по устранению неполадок предназначены для Xen(TM) 4.11 или новее. Если вы всё ещё используете Xen(TM) 4.7 и сталкиваетесь с проблемами, рассмотрите возможность перехода на более новую версию Xen(TM).

source: In order to troubleshoot host boot issues, you will likely need a serial cable, or a debug USB cable. Verbose Xen(TM) boot output can be obtained by adding options to the `xen_cmdline` option found in [.filename]#loader.conf#. A couple of relevant debug options are:
ru: Для устранения проблем с загрузкой хоста вам, скорее всего, понадобится последовательный кабель или отладочный USB-кабель. Подробный вывод загрузки Xen(TM) можно получить, добавив параметры к опции `xen_cmdline` в файле [.filename]#loader.conf#. Несколько соответствующих отладочных параметров:

source: `iommu=debug`: can be used to print additional diagnostic information about the iommu.
ko: `iommu=debug`: iommu에 대한 추가 진단 정보를 인쇄하는 데 사용할 수 있습니다.
ru: `iommu=debug`: может использоваться для вывода дополнительной диагностической информации о iommu.

source: `dom0=verbose`: can be used to print additional diagnostic information about the dom0 build process.
ko: `dom0=verbose`: dom0 빌드 프로세스에 대한 추가 진단 정보를 인쇄하는 데 사용할 수 있습니다.
ru: `dom0=verbose`: может использоваться для вывода дополнительной диагностической информации о процессе сборки dom0.

source: `sync_console`: flag to force synchronous console output. Useful for debugging to avoid losing messages due to rate limiting. Never use this option in production environments since it can allow malicious guests to perform DoS attacks against Xen(TM) using the console.
ko: `sync_console`: 콘솔 출력을 강제하는 플래그. 속도 제한으로 인한 메시지 손실을 방지하기 위한 디버깅에 유용합니다. 이 옵션을 사용하면 악의적인 게스트가 콘솔을 사용하여 Xen(TM)에 대한 DoS 공격을 수행할 수 있으므로 프로덕션 환경에서는 이 옵션을 사용하지 마십시오.
ru: `sync_console`: флаг для принудительного синхронного вывода на консоль. Полезен при отладке, чтобы избежать потери сообщений из-за ограничения скорости. Никогда не используйте эту опцию в рабочих средах, так как она может позволить злоумышленникам выполнять DoS-атаки на Xen(TM) через консоль.

source: FreeBSD should also be booted in verbose mode in order to identify any issues. To activate verbose booting, run this command:
ko: 또한 문제를 식별하기 위해 FreeBSD를 자세한 정보 모드(verbose mode)로 부팅해야 합니다. 자세한 정보 부팅을 활성화하려면 다음 명령을 실행하세요:
ru: FreeBSD также следует загружать в подробном режиме для выявления возможных проблем. Чтобы активировать подробную загрузку, выполните следующую команду:

source: If none of these options help solving the problem, please send the serial boot log to mailto:freebsd-xen@FreeBSD.org[freebsd-xen@FreeBSD.org] and mailto:xen-devel@lists.xenproject.org[xen-devel@lists.xenproject.org] for further analysis.
ko: 이러한 옵션 중 어느 것도 문제 해결에 도움이 되지 않는다면 mailto:freebsd-xen@FreeBSD.org[freebsd-xen@FreeBSD.org] 및 mailto:xen-devel@lists.xenproject.org[xen-devel@lists.xenproject.org]으로 시리얼 부팅 로그를 보내 자세한 분석을 요청하세요.
ru: Если ни один из этих вариантов не помог решить проблему, отправьте журнал загрузки по последовательному соединению по адресам mailto:freebsd-xen@FreeBSD.org[freebsd-xen@FreeBSD.org] и mailto:xen-devel@lists.xenproject.org[xen-devel@lists.xenproject.org] для дальнейшего анализа.

source: Guest Creation Troubleshooting
ko: 게스트 생성 문제 해결
ru: Устранение неполадок при создании гостевой системы

source: Issues can also arise when creating guests, the following attempts to provide some help for those trying to diagnose guest creation issues.
ko: 게스트 생성 시에도 문제가 발생할 수 있으며, 다음은 게스트 생성 문제를 진단하는 데 도움이 될 수 있는 몇 가지 방법입니다.
ru: Проблемы также могут возникать при создании гостевых систем. В следующем разделе представлены рекомендации для диагностики подобных проблем.

source: The most common cause of guest creation failures is the `xl` command spitting some error and exiting with a return code different than 0. If the error provided is not enough to help identify the issue, more verbose output can also be obtained from `xl` by using the `v` option repeatedly.
ko: 게스트 생성 실패의 가장 일반적인 원인은 `xl` 명령이 일부 오류를 뱉어내고 반환 코드가 0과 다른 상태로 종료되는 것입니다. 제공된 오류가 문제를 식별하는 데 충분하지 않은 경우 `v` 옵션을 반복해서 사용하여 `xl`에서 더 자세한 출력을 얻을 수도 있습니다.
ru: Наиболее распространённой причиной сбоев при создании гостевой системы является команда `xl`, которая выдаёт ошибку и завершается с кодом возврата, отличным от 0. Если предоставленного сообщения об ошибке недостаточно для определения проблемы, можно получить более подробный вывод от `xl`, многократно используя опцию `v`.

source: If the verbose output does not help diagnose the issue, there are also QEMU and Xen(TM) toolstack logs in [.filename]#/var/log/xen#. Note that the name of the domain is appended to the log name, so if the domain is named `freebsd` you should find a [.filename]#/var/log/xen/xl-freebsd.log# and likely a [.filename]#/var/log/xen/qemu-dm-freebsd.log#. Both log files can contain useful information for debugging. If none of this helps solve the issue, please send the description of the issue you are facing and as much information as possible to mailto:freebsd-xen@FreeBSD.org[freebsd-xen@FreeBSD.org] and mailto:xen-devel@lists.xenproject.org[xen-devel@lists.xenproject.org] in order to get help.
ru: Если подробный вывод не помог диагностировать проблему, также существуют журналы QEMU и инструментов Xen(TM) в [.filename]#/var/log/xen#. Обратите внимание, что имя домена добавляется к имени журнала, поэтому если домен называется `freebsd`, вы найдете файлы [.filename]#/var/log/xen/xl-freebsd.log# и, вероятно, [.filename]#/var/log/xen/qemu-dm-freebsd.log#. Оба файла журналов могут содержать полезную информацию для отладки. Если ничто из этого не помогло решить проблему, пожалуйста, отправьте описание возникшей проблемы и как можно больше информации на адреса mailto:freebsd-xen@FreeBSD.org[freebsd-xen@FreeBSD.org] и mailto:xen-devel@lists.xenproject.org[xen-devel@lists.xenproject.org], чтобы получить помощь.

source: Chapter 23. Virtualization
ko: 23장. 가상화

source: All of the SCSI, FireWire, and USB device drivers can be removed from a custom kernel configuration file. Parallels provides a virtual network adapter used by the man:ed[4] driver, so all network devices except for man:ed[4] and man:miibus[4] can be removed from the kernel.
ko: 사용자 정의 커널 구성 파일에서 모든 SCSI, FireWire 및 USB 장치 드라이버를 제거할 수 있습니다. Parallels는 man:ed[4] 드라이버에서 사용하는 가상 네트워크 어댑터를 제공하므로 man:ed[4] 및 man:miibus[4]를 제외한 모든 네트워크 장치를 커널에서 제거할 수 있습니다.

source: All of the FireWire, and USB device drivers can be removed from a custom kernel configuration file. VMware Fusion provides a virtual network adapter used by the man:em[4] driver, so all network devices except for man:em[4] can be removed from the kernel.
ko: 사용자 지정 커널 구성 파일에서 모든 FireWire 및 USB 장치 드라이버를 제거할 수 있습니다. VMware Fusion은 man:em[4] 드라이버에서 사용하는 가상 네트워크 어댑터를 제공하므로 man:em[4]를 제외한 모든 네트워크 디바이스를 커널에서 제거할 수 있습니다.

source: HAL users should create the following [.filename]#/usr/local/etc/hal/fdi/policy/90-vboxguest.fdi# or copy it from [.filename]#/usr/local/share/hal/fdi/policy/10osvendor/90-vboxguest.fdi#:
ko: HAL 사용자는 다음 [.filename]#/usr/local/etc/hal/fdi/picy/90-vboxguest.fdi#를 만들거나 [.filename]#/usr/local/share/hal/fdi/picy/10osvendor/90-vboxguest.fdi#에서 복사해야 합니다:

source: HAL needs to run for VirtualBox(TM)DVD/CD functions to work, so enable it in [.filename]#/etc/rc.conf# and start it if it is not already running:
ko: VirtualBox(TM) DVD/CD 기능이 작동하려면 HAL이 실행되어야 하므로 [.filename]#/etc/rc.conf#에서 활성화하고 아직 실행 중이 아니라면 시작하세요:

source: The bhyve BSD-licensed hypervisor became part of the base system with FreeBSD 10.0-RELEASE. This hypervisor supports a number of guests, including FreeBSD, OpenBSD, and many Linux(R) distributions. By default, bhyve provides access to serial console and does not emulate a graphical console. Virtualization offload features of newer CPUs are used to avoid the legacy methods of translating instructions and manually managing memory mappings.
ko: bhyve BSD 라이선스 하이퍼바이저는 FreeBSD 10.0-RELEASE와 함께 기본 시스템의 일부가 되었습니다. 이 하이퍼바이저는 FreeBSD, OpenBSD 및 많은 Linux(R) 배포판을 포함한 여러 게스트를 지원합니다. 기본적으로 bhyve는 직렬 콘솔에 대한 액세스를 제공하며 그래픽 콘솔을 에뮬레이트하지 않습니다. 최신 CPU의 가상화 오프로드 기능은 명령어를 번역하고 메모리 매핑을 수동으로 관리하는 기존 방법을 피하기 위해 사용됩니다.

source: The bhyve design requires a processor that supports Intel(R) Extended Page Tables (EPT) or AMD(R) Rapid Virtualization Indexing (RVI) or Nested Page Tables (NPT). Hosting Linux(R) guests or FreeBSD guests with more than one vCPU requires VMX unrestricted mode support (UG). Most newer processors, specifically the Intel(R) Core(TM) i3/i5/i7 and Intel(R) Xeon(TM) E3/E5/E7, support these features. UG support was introduced with Intel's Westmere micro-architecture. For a complete list of Intel(R) processors that support EPT, refer to https://ark.intel.com/content/www/us/en/ark/search/featurefilter.html?productType=873&0_ExtendedPageTables=True[]. RVI is found on the third generation and later of the AMD Opteron(TM) (Barcelona) processors. The easiest way to tell if a processor supports bhyve is to run `dmesg` or look in [.filename]#/var/run/dmesg.boot# for the `POPCNT` processor feature flag on the `Features2` line for AMD(R) processors or `EPT` and `UG` on the `VT-x` line for Intel(R) processors.
ko: bhyve 설계를 사용하려면 인텔(R) 확장 페이지 테이블(Extended Page Tables, EPT) 또는 AMD(R) 빠른 가상화 인덱싱(Rapid Virtualization Indexing, RVI) 또는 네스티드 페이지 테이블(Nested Page Tables, NPT)를 지원하는 프로세서가 필요합니다. 둘 이상의 vCPU가 있는 Linux(R) 게스트 또는 FreeBSD 게스트를 호스팅하려면 VMX 무제한 모드 지원(UG)이 필요합니다. 대부분의 최신 프로세서, 특히 인텔(R) 코어(TM) i3/i5/i7 및 인텔(R) 제온(TM) E3/E5/E7은 이러한 기능을 지원합니다. UG 지원은 인텔의 웨스트미어 마이크로 아키텍처에서 도입되었습니다. EPT를 지원하는 인텔(R) 프로세서의 전체 목록은 https://ark.intel.com/content/www/us/en/ark/search/featurefilter.html?productType=873&0_ExtendedPageTables=True[]를 참조하세요. RVI는 3세대 이상의 AMD 옵테론(TM)(바르셀로나) 프로세서에 탑재되어 있습니다. 프로세서가 bhyve를 지원하는지 확인하는 가장 쉬운 방법은 `dmesg`를 실행하거나 [.filename]#/var/run/dmesg.boot#에서 AMD(R) 프로세서의 경우 `Features2` 줄에 있는 `POPCNT` 프로세서 기능 플래그, Intel(R) 프로세서의 경우 `VT-x` 줄에 있는 `EPT` 및 `UG`를 찾는 것입니다.

source: Then, create a [.filename]#tap# interface for the network device in the virtual machine to attach to. In order for the network device to participate in the network, also create a bridge interface containing the [.filename]#tap# interface and the physical interface as members. In this example, the physical interface is _igb0_:
ko: 그런 다음 가상 머신의 네트워크 장치가 연결할 [.filename]#tap# 인터페이스를 만듭니다. 네트워크 장치가 네트워크에 참여하려면 [.filename]#tap# 인터페이스와 물리적 인터페이스를 멤버로 포함하는 브리지 인터페이스도 만듭니다. 이 예에서 물리적 인터페이스는 _igb0_입니다:

source: FreeBSD comes with an example script for running a virtual machine in bhyve. The script will start the virtual machine and run it in a loop, so it will automatically restart if it crashes. The script takes a number of options to control the configuration of the machine: `-c` controls the number of virtual CPUs, `-m` limits the amount of memory available to the guest, `-t` defines which [.filename]#tap# device to use, `-d` indicates which disk image to use, `-i` tells bhyve to boot from the CD image instead of the disk, and `-I` defines which CD image to use. The last parameter is the name of the virtual machine, used to track the running machines. This example starts the virtual machine in installation mode:
ko: FreeBSD는 bhyve에서 가상 머신을 실행하기 위한 예제 스크립트와 함께 제공됩니다. 이 스크립트는 가상 머신을 시작하고 루프로 동작하므로 충돌이 발생하면 자동으로 다시 시작됩니다. 이 스크립트에는 머신 구성을 제어하기 위한 여러 옵션이 있습니다: `-c`는 가상 CPU 수를 제어하고, `-m`은 게스트가 사용할 수 있는 메모리 양을 제한하며, `-t`는 사용할 [.filename]#tap# 장치를 정의하고, `-d`는 사용할 디스크 이미지를 나타내며, `-i`는 디스크 대신 CD 이미지에서 부팅하도록 bhyve에 지시하고, `-I`는 사용할 CD 이미지를 정의합니다. 마지막 매개변수는 실행 중인 머신을 추적하는 데 사용되는 가상 머신의 이름입니다. 이 예는 가상 머신을 설치 모드로 시작합니다:

source: The virtual machine will boot and start the installer. After installing a system in the virtual machine, when the system asks about dropping in to a shell at the end of the installation, choose btn:[Yes].
ko: 가상 머신이 부팅되고 인스톨러가 시작됩니다. 가상 머신에 시스템을 설치한 후 설치가 끝날 때 시스템에서 셸에 드롭인할지 묻는 메시지가 표시되면 btn:[Yes]를 선택합니다.

source: Reboot the virtual machine. While rebooting the virtual machine causes bhyve to exit, the [.filename]#vmrun.sh# script runs `bhyve` in a loop and will automatically restart it. When this happens, choose the reboot option from the boot loader menu in order to escape the loop. Now the guest can be started from the virtual disk:
ko: 가상 머신을 재부팅합니다. 가상 머신을 재부팅하면 bhyve가 종료되지만, [.filename]#vmrun.sh# 스크립트는 `bhyve`를 루프로 실행하고 자동으로 재시작합니다. 이 경우 부트 로더 메뉴에서 재부팅 옵션을 선택하여 루프를 벗어나십시오. 이제 가상 디스크에서 게스트를 시작할 수 있습니다:

source: In order to boot operating systems other than FreeBSD, the package:sysutils/grub2-bhyve[] port must be first installed.
ko: FreeBSD 이외의 운영 체제를 부팅하려면 package:sysutils/grub2-bhyve[] 포트를 먼저 설치해야 합니다.

source: Next, create a file to use as the virtual disk for the guest machine:
ko: 다음으로 게스트 머신의 가상 디스크로 사용할 파일을 만듭니다:

source: Starting a virtual machine with bhyve is a two step process. First a kernel must be loaded, then the guest can be started. The Linux(R) kernel is loaded with package:sysutils/grub2-bhyve[]. Create a [.filename]#device.map# that grub will use to map the virtual devices to the files on the host system:
ko: bhyve로 가상 머신을 시작하는 것은 2단계 과정이 필요합니다. 먼저 커널을 로드한 다음 게스트를 시작할 수 있습니다. Linux(R) 커널은 package:sysutils/grub2-bhyve[]로 로드됩니다. grub이 가상 디바이스를 호스트 시스템의 파일에 매핑하는 데 사용할 [.filename]#device.map#을 만듭니다:

source: In addition to bhyveload and grub-bhyve, the bhyve hypervisor can also boot virtual machines using the UEFI userspace firmware. This option may support guest operating systems that are not supported by the other loaders.
ko: bhyveload 및 grub-bhyve 외에도 bhyve 하이퍼바이저는 UEFI 사용자 공간 펌웨어를 사용하여 가상 머신을 부팅할 수도 있습니다. 이 옵션은 다른 로더에서 지원하지 않는 게스트 운영 체제를 지원할 수 있습니다.

source: In order to make use of the UEFI support in bhyve, first obtain the UEFI firmware images. This can be done by installing package:sysutils/bhyve-firmware[] port or package.
ko: bhyve에서 UEFI 지원을 사용하려면 먼저 UEFI 펌웨어 이미지를 얻어야 합니다. package:sysutils/bhyve-firmware[] 포트 또는 패키지를 설치하여 이 작업을 수행할 수 있습니다.

source: In order to configure the system to start bhyve guests at boot time, the following configurations must be made in the specified files:
ko: 부팅 시 bhyve 게스트가 시작되도록 시스템을 구성하려면 지정된 파일에서 다음 구성을 수행해야 합니다:

source: To run the Xen(TM) hypervisor on a host, certain hardware functionality is required. Hardware virtualized domains require Extended Page Table (http://en.wikipedia.org/wiki/Extended_Page_Table[EPT]) and Input/Output Memory Management Unit (http://en.wikipedia.org/wiki/List_of_IOMMU-supporting_hardware[IOMMU]) support in the host processor.
ko: 호스트에서 Xen(TM) 하이퍼바이저를 실행하려면 특정 하드웨어 기능이 필요합니다. 하드웨어 가상화된 도메인을 사용하려면 호스트 프로세서에서 EPT(http://en.wikipedia.org/wiki/Extended_Page_Table[http://en.wikipedia.org/wiki/Extended_Page_Table][확장 페이지 테이블]) 및 IOMMU(http://en.wikipedia.org/wiki/List_of_IOMMU-supporting_hardware[입/출력 메모리 관리 장치])를 지원해야 합니다.

source: In order to run a FreeBSD Xen(TM) Dom0 the box must be booted using legacy boot (BIOS).
ko: FreeBSD Xen(TM) Dom0을 실행하려면 반드시 레거시 부팅(BIOS)을 사용하여 부팅해야 합니다.

source: Users of FreeBSD 11 should install the package:emulators/xen-kernel47[] and package:sysutils/xen-tools47[] packages that are based on Xen version 4.7. Systems running on FreeBSD-12.0 or newer can use Xen 4.11 provided by package:emulators/xen-kernel411[] and package:sysutils/xen-tools411[], respectively.
ko: FreeBSD 11 사용자는 Xen 버전 4.7을 기반으로 하는 package:emulators/xen-kernel47[] 및 package:sysutils/xen-tools47[] 패키지를 설치해야 합니다. FreeBSD-12.0 이상에서 실행되는 시스템은 각각 package:emulators/xen-kernel411[] 및 package:sysutils/xen-tools411[]에서 제공하는 Xen 4.11을 사용할 수 있습니다.

source: Selecting a Xen(TM) kernel in [.filename]#/boot/loader.conf# activates the Dom0. Xen(TM) also requires resources like CPU and memory from the host machine for itself and other DomU domains. How much CPU and memory depends on the individual requirements and hardware capabilities. In this example, 8 GB of memory and 4 virtual CPUs are made available for the Dom0. The serial console is also activated and logging options are defined.
ko: [.filename]#/boot/loader.conf#에서 Xen(TM) 커널을 선택하면 Dom0가 활성화됩니다. 또한 Xen(TM)은 자체 및 다른 DomU 도메인을 위해 호스트 컴퓨터의 CPU 및 메모리와 같은 리소스를 필요로 합니다. CPU 및 메모리의 양은 개별 요구 사항 및 하드웨어 기능에 따라 다릅니다. 이 예에서는 Dom0에 8GB의 메모리와 4개의 가상 CPU를 사용할 수 있습니다. 직렬 콘솔도 활성화되고 로깅 옵션이 정의됩니다.

source: Please note that the following troubleshooting tips are intended for Xen(TM) 4.11 or newer. If you are still using Xen(TM) 4.7 and having issues consider migrating to a newer version of Xen(TM).
ko: 다음 문제 해결 팁은 Xen(TM) 4.11 이상을 위한 것입니다. Xen(TM) 4.7을 계속 사용 중인데 문제가 발생하는 경우 최신 버전의 Xen(TM)으로 마이그레이션하는 것을 고려하십시오.

source: In order to troubleshoot host boot issues you will likely need a serial cable, or a debug USB cable. Verbose Xen(TM) boot output can be obtained by adding options to the `xen_cmdline` option found in [.filename]#loader.conf#. A couple of relevant debug options are:
ko: 호스트 부팅 문제를 해결하려면 직렬 케이블 또는 디버그 USB 케이블이 필요할 수 있습니다. 자세한 Xen(TM) 부팅 출력은 [.filename]#loader.conf#에 있는 `xen_cmdline` 옵션에 옵션을 추가하여 얻을 수 있습니다. 몇 가지 관련 디버그 옵션은 다음과 같습니다:

source: If the verbose output does not help diagnose the issue there are also QEMU and Xen(TM) toolstack logs in [.filename]#/var/log/xen#. Note that the name of the domain is appended to the log name, so if the domain is named `freebsd` you should find a [.filename]#/var/log/xen/xl-freebsd.log# and likely a [.filename]#/var/log/xen/qemu-dm-freebsd.log#. Both log files can contain useful information for debugging. If none of this helps solve the issue, please send the description of the issue you are facing and as much information as possible to mailto:freebsd-xen@FreeBSD.org[freebsd-xen@FreeBSD.org] and mailto:xen-devel@lists.xenproject.org[xen-devel@lists.xenproject.org] in order to get help.
ko: 자세한 정보 출력으로 문제를 진단하는 데 도움이 되지 않는 경우 [.filename]#/var/log/xen#에 있는 QEMU 및 Xen(TM) 도구 스택 로그도 있습니다. 도메인 이름이 로그 이름에 추가되므로 도메인 이름이 `freebsd`인 경우 [.filename]#/var/log/xen/xl-freebsd.log#, [.filename]#/var/log/xen/qemu-dm-freebsd.log#를 찾을 수 있습니다. 두 로그 파일 모두 디버깅에 유용한 정보를 포함할 수 있습니다. 이 방법으로 문제를 해결하는 데 도움이 되지 않는 경우 mailto:freebsd-xen@FreeBSD.org[freebsd-xen@FreeBSD.org] 및 mailto:xen-devel@lists.xenproject.org[xen-devel@lists.xenproject.org]으로 발생한 문제에 대한 설명과 가능한 한 많은 정보를 보내 도움을 받으시기 바랍니다.
