Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/virtualization/_index.po
Languages: ko, ru

source: Xen is a GPLv2-licensed https://en.wikipedia.org/wiki/Hypervisor#Classification[type 1 hypervisor] for Intel(R) and ARM(R) architectures. FreeBSD has included i386(TM) and AMD(R) 64-Bit https://wiki.xenproject.org/wiki/DomU[DomU] and https://en.wikipedia.org/wiki/Amazon_Elastic_Compute_Cloud[Amazon EC2] unprivileged domain (virtual machine) support since FreeBSD 8.0 and includes Dom0 control domain (host) support in FreeBSD 11.0. Support for para-virtualized (PV) domains has been removed from FreeBSD 11 in favor of hardware virtualized (HVM) domains, which provides better performance.
ko: Xen은 Intel(R) 및 ARM(R) 아키텍처용 GPLv2 라이선스 https://en.wikipedia.org/wiki/Hypervisor#Classification[유형 1 하이퍼바이저]입니다. FreeBSD는 FreeBSD 8.0부터 i386(TM) 및 AMD(R) 64비트 https://wiki.xenproject.org/wiki/DomU[DomU] 및 https://en.wikipedia.org/wiki/Amazon_Elastic_Compute_Cloud[Amazon EC2]의 권한 없는 도메인(가상 머신) 지원을 포함했으며, FreeBSD 11.0에는 Dom0 제어 도메인(호스트) 지원이 포함되어 있습니다. 더 나은 성능을 제공하는 하드웨어 가상화(HVM) 도메인을 위해 FreeBSD 11에서는 준가상화(PV) 도메인에 대한 지원이 제거되었습니다.
ru: Xen — это гипервизор класса 1 с лицензией GPLv2 для архитектур Intel(R) и ARM(R). Начиная с FreeBSD 8.0, система включает поддержку непривилегированных доменов (виртуальных машин) https://wiki.xenproject.org/wiki/DomU[DomU] и https://en.wikipedia.org/wiki/Amazon_Elastic_Compute_Cloud[Amazon EC2] для i386(TM) и AMD(R) 64-битных процессоров, а также поддержку управляющего домена (хоста) Dom0 в FreeBSD 11.0. Поддержка паравиртуализованных (PV) доменов была удалена в FreeBSD 11 в пользу аппаратно-виртуализованных (HVM) доменов, которые обеспечивают лучшую производительность.

source: Xen(TM) is a bare-metal hypervisor, which means that it is the first program loaded after the BIOS. A special privileged guest called the Domain-0 (`Dom0` for short) is then started. The Dom0 uses its special privileges to directly access the underlying physical hardware, making it a high-performance solution. It is able to access the disk controllers and network adapters directly. The Xen(TM) management tools to manage and control the Xen(TM) hypervisor are also used by the Dom0 to create, list, and destroy VMs. Dom0 provides virtual disks and networking for unprivileged domains, often called `DomU`. Xen(TM) Dom0 can be compared to the service console of other hypervisor solutions, while the DomU is where individual guest VMs are run.
ko: Xen(TM)은 베어메탈 하이퍼바이저이므로 BIOS 이후에 가장 먼저 로드되는 프로그램입니다. 그런 다음 Domain-0(줄여서 `Dom0`)이라는 특수 권한 게스트가 시작됩니다. Dom0는 특수 권한을 사용하여 기본 물리적 하드웨어에 직접 액세스하는 고성능 솔루션입니다. 디스크 컨트롤러 및 네트워크 어댑터에 직접 액세스할 수 있습니다. Dom0는 Xen(TM) 하이퍼바이저를 관리하고 제어하는 Xen(TM) 관리 도구도 사용하여 VM을 생성, 나열 및 삭제합니다. Dom0는 권한이 없는 도메인을 위한 가상 디스크 및 네트워킹을 제공하며, 종종 `DomU`라고도 합니다. Xen(TM) Dom0는 다른 하이퍼바이저 솔루션의 서비스 콘솔과 비교할 수 있으며, DomU는 개별 게스트 VM이 실행되는 곳입니다.
ru: Xen(TM) — это гипервизор первого типа (bare-metal), что означает, что он загружается первым после BIOS. Затем запускается специальная привилегированная гостевая система, называемая Domain-0 (сокращенно `Dom0`). Dom0 использует свои особые привилегии для прямого доступа к физическому оборудованию, что делает его высокопроизводительным решением. Она может напрямую обращаться к контроллерам дисков и сетевым адаптерам. Инструменты управления Xen(TM) для управления гипервизором Xen(TM) также используются Dom0 для создания, перечисления и удаления виртуальных машин. Dom0 предоставляет виртуальные диски и сетевые ресурсы для непривилегированных доменов, часто называемых `DomU`. Xen(TM) Dom0 можно сравнить с сервисной консолью других гипервизоров, в то время как DomU — это среда, в которой запускаются отдельные гостевые виртуальные машины.

source: Xen(TM) can migrate VMs between different Xen(TM) servers. When the two xen hosts share the same underlying storage, the migration can be done without having to shut the VM down first. Instead, the migration is performed live while the DomU is running and there is no need to restart it or plan a downtime. This is useful in maintenance scenarios or upgrade windows to ensure that the services provided by the DomU are still provided. Many more features of Xen(TM) are listed on the https://wiki.xenproject.org/wiki/Category:Overview[Xen Wiki Overview page]. Note that not all features are supported on FreeBSD yet.
ko: Xen(TM)은 서로 다른 Xen(TM) 서버 간에 VM을 마이그레이션할 수 있습니다. 두 Xen 호스트가 동일한 기본 스토리지를 공유하는 경우 VM을 먼저 종료할 필요 없이 마이그레이션을 수행할 수 있습니다. 그리고, 마이그레이션은 DomU가 실행되는 동안 실시간으로 수행되므로 다시 시작하거나 다운타임을 계획할 필요가 없습니다. 이 기능은 유지 관리 시나리오 또는 업그레이드 기간에 DomU에서 제공하는 서비스가 계속 제공되도록 하는 데 유용합니다. Xen(TM)의 더 많은 기능은 https://wiki.xenproject.org/wiki/Category:Overview[Xen Wiki 개요 페이지]에 나열되어 있습니다. 아직 FreeBSD에서 모든 기능이 지원되는 것은 아닙니다.
ru: Xen(TM) может переносить виртуальные машины между разными серверами Xen(TM). Если два хоста Xen используют общее хранилище данных, миграцию можно выполнить без предварительного выключения виртуальной машины. Вместо этого миграция выполняется в реальном времени, пока DomU работает, и нет необходимости перезапускать его или планировать простой. Это полезно в сценариях обслуживания или обновления, чтобы гарантировать непрерывность предоставления услуг DomU. Множество других возможностей Xen(TM) перечислены на https://wiki.xenproject.org/wiki/Category:Overview[странице обзора Xen Wiki]. Обратите внимание, что не все функции пока поддерживаются в FreeBSD.

source: Hardware Requirements for Xen(TM) Dom0
ko: Xen(TM) Dom0의 하드웨어 요구 사항
ru: Требования к оборудованию для Xen(TM) Dom0

source: To run the Xen(TM) hypervisor on a host, certain hardware functionality is required. Running FreeBSD as a Xen host (Dom0) require Intel Extended Page Tables (https://en.wikipedia.org/wiki/Extended_Page_Table[EPT]) or AMD Nested Page Tables (https://en.wikipedia.org/wiki/Rapid_Virtualization_Indexing[NPT]) and Input/Output Memory Management Unit (https://en.wikipedia.org/wiki/List_of_IOMMU-supporting_hardware[IOMMU]) support in the host processor.
ru: Для запуска гипервизора Xen(TM) на хосте требуется определенная аппаратная функциональность. Для работы FreeBSD в качестве хоста Xen (Dom0) необходимы поддержка Intel Extended Page Tables (https://en.wikipedia.org/wiki/Extended_Page_Table[EPT]) или AMD Nested Page Tables (https://en.wikipedia.org/wiki/Rapid_Virtualization_Indexing[NPT]), а также поддержка Input/Output Memory Management Unit (https://en.wikipedia.org/wiki/List_of_IOMMU-supporting_hardware[IOMMU]) в процессоре хоста.

source: In order to run a FreeBSD 13 Xen(TM) Dom0 the box must be booted using legacy boot (BIOS). FreeBSD 14 and newer supports booting as a Xen(TM) Dom0 in both BIOS and UEFI modes.
ru: Для запуска FreeBSD 13 в качестве Xen(TM) Dom0 система должна быть загружена в режиме legacy boot (BIOS). FreeBSD 14 и новее поддерживают загрузку в качестве Xen(TM) Dom0 как в режиме BIOS, так и в режиме UEFI.

source: Xen(TM) Dom0 Control Domain Setup
ko: Xen(TM) Dom0 제어 도메인 설정
ru: Настройка управляющего домена Xen(TM) Dom0

source: Users should install the package:emulators/xen-kernel[] and package:sysutils/xen-tools[] packages, based on Xen(TM) 4.18.
ru: Пользователям следует установить пакеты package:emulators/xen-kernel[] и package:sysutils/xen-tools[], основанные на Xen(TM) 4.18.

source: Configuration files must be edited to prepare the host for the Dom0 integration after the Xen packages are installed. An entry to [.filename]#/etc/sysctl.conf# disables the limit on how many pages of memory are allowed to be wired. Otherwise, DomU VMs with higher memory requirements will not run.
ko: Xen 패키지를 설치한 후 Dom0 통합을 위해 호스트를 준비하려면 구성 파일을 편집해야 합니다. [.filename]#/etc/sysctl.conf#에 항목을 추가하면 연결할 수 있는 메모리 페이지 수에 대한 제한을 해제할 수 있습니다. 그렇지 않으면 더 높은 메모리 요구 사항을 가진 DomU VM이 실행되지 않습니다.
ru: После установки пакетов Xen необходимо отредактировать конфигурационные файлы, чтобы подготовить хост для интеграции с Dom0. В файл [.filename]#/etc/sysctl.conf# следует добавить запись, отключающую ограничение на количество страниц памяти, которые могут быть закреплены. В противном случае виртуальные машины DomU с повышенными требованиями к памяти не смогут запуститься.

source: Another memory-related setting involves changing [.filename]#/etc/login.conf#, setting the `memorylocked` option to `unlimited`. Otherwise, creating DomU domains may fail with `Cannot allocate memory` errors. After making the change to [.filename]#/etc/login.conf#, run `cap_mkdb` to update the capability database. See crossref:security[security-resourcelimits,"Resource Limits"] for details.
ko: 또 다른 메모리 관련 설정은 [.filename]#/etc/login.conf#를 변경하고 `memorylocked` 옵션을 `unlimited`으로 설정하는 것입니다. 그렇지 않으면 `Cannot allocate memory` 오류와 함께 DomU 도메인 생성이 실패할 수 있습니다. [.filename]#/etc/login.conf#를 변경한 후 `cap_mkdb`를 실행하여 기능 데이터베이스를 업데이트합니다. 자세한 내용은 crossref:security[security-resourcelimits,"Resource Limits"]을 참조하세요.
ru: Ещё одна настройка, связанная с памятью, включает изменение файла [.filename]#/etc/login.conf#, где необходимо установить параметр `memorylocked` в значение `unlimited`. В противном случае создание доменов DomU может завершиться ошибкой `Cannot allocate memory`. После внесения изменений в [.filename]#/etc/login.conf# выполните команду `cap_mkdb` для обновления базы данных capability. Подробности см. в разделе crossref:security[security-resourcelimits,"Ограничения ресурсов"].

source: Add an entry for the Xen(TM) console to [.filename]#/etc/ttys#:
ko: Xen(TM) 콘솔에 대한 항목을 [.filename]#/etc/ttys#에 추가합니다:
ru: Добавьте запись для консоли Xen(TM) в [.filename]#/etc/ttys#:

source: Selecting a Xen(TM) kernel in [.filename]#/boot/loader.conf# activates the Dom0. Xen(TM) also requires resources like CPU and memory from the host machine for itself and other DomU domains. How much CPU and memory depends on the individual requirements and hardware capabilities. In this example, 8 GB of memory and 4 virtual CPUs are made available for the Dom0. The serial console is also activated, and logging options are defined.
ru: Выбор ядра Xen(TM) в [.filename]#/boot/loader.conf# активирует Dom0. Xen(TM) также требует ресурсы, такие как процессор и память, от основной машины для себя и других доменов DomU. Количество процессоров и памяти зависит от индивидуальных требований и возможностей оборудования. В этом примере для Dom0 доступно 8 ГБ памяти и 4 виртуальных процессора. Также активирована последовательная консоль и определены параметры журналирования.

source: The following command is used for Xen 4.7 packages:
ko: 다음 명령은 Xen 4.7 패키지에 사용됩니다:
ru: Следующая команда используется для пакетов Xen 4.7:

source: For Xen versions 4.11 and higher, the following command should be used instead:
ko: Xen 버전 4.11 이상에서는 다음 명령을 대신 사용해야 합니다:
ru: Для версий Xen 4.11 и выше вместо этого следует использовать следующую команду:

source: Log files that Xen(TM) creates for the DomU VMs are stored in [.filename]#/var/log/xen#. Please be sure to check the contents of that directory if experiencing issues.
ko: Xen(TM)이 DomU VM에 대해 생성하는 로그 파일은 [.filename]#/var/log/xen#에 저장됩니다. 문제가 발생하면 해당 디렉터리의 내용을 확인하십시오.
ru: Файлы журналов, создаваемые Xen(TM) для DomU ВМ, хранятся в [.filename]#/var/log/xen#. В случае возникновения проблем обязательно проверьте содержимое этого каталога.

source: Activate the xencommons service during system startup:
ko: 시스템 시작 시 xencommons 서비스를 활성화합니다:
ru: Активируйте сервис xencommons при загрузке системы:

source: These settings are enough to start a Dom0-enabled system. However, it lacks network functionality for the DomU machines. To fix that, define a bridged interface with the main NIC of the system which the DomU VMs can use to connect to the network. Replace _em0_ with the host network interface name.
ko: 이 설정은 Dom0 지원 시스템을 시작하기에 충분합니다. 그러나 DomU 머신을 위한 네트워크 기능이 부족합니다. 이 문제를 해결하려면 DomU VM이 네트워크에 연결하는 데 사용할 수 있는 시스템의 기본 NIC와 브리지 인터페이스를 정의합니다. _em0_을 호스트 네트워크 인터페이스 이름으로 바꿉니다.
ru: Этих настроек достаточно для запуска системы с поддержкой Dom0. Однако в ней отсутствует сетевая функциональность для машин DomU. Чтобы это исправить, определите мостовой интерфейс с основной сетевой картой системы, который DomU-виртуальные машины смогут использовать для подключения к сети. Замените _em0_ на имя сетевого интерфейса хоста.

source: Restart the host to load the Xen(TM) kernel and start the Dom0.
ko: 호스트를 다시 시작하여 Xen(TM) 커널을 로드하고 Dom0를 시작합니다.
ru: Перезагрузите хост для загрузки ядра Xen(TM) и запуска Dom0.

source: After successfully booting the Xen(TM) kernel and logging into the system again, the Xen(TM) management tool `xl` is used to show information about the domains.
ko: Xen(TM) 커널을 성공적으로 부팅하고 시스템에 다시 로그인하면 Xen(TM) 관리 도구 `xl`으로 도메인에 대한 정보를 확인할 수 있습니다.
ru: После успешной загрузки ядра Xen(TM) и повторного входа в систему, инструмент управления Xen(TM) `xl` используется для отображения информации о доменах.

source: The output confirms that the Dom0 (called `Domain-0`) has the ID `0` and is running. It also has the memory and virtual CPUs that were defined in [.filename]#/boot/loader.conf# earlier. More information can be found in the https://www.xenproject.org/help/documentation.html[Xen(TM) Documentation]. DomU guest VMs can now be created.
ko: 출력은 Dom0(`Domain-0`이라고 함)의 ID가 `0`이고 실행 중임을 확인합니다. 또한 앞서 [.filename]#/boot/loader.conf#에 정의된 메모리 및 가상 CPU가 있습니다. 자세한 내용은 https://www.xenproject.org/help/documentation.html[Xen(TM) 설명서]에서 확인할 수 있습니다. 이제 DomU 게스트 VM을 만들 수 있습니다.
ru: Вывод подтверждает, что Dom0 (называемый `Domain-0`) имеет идентификатор `0` и работает. Также у него есть память и виртуальные CPU, которые были определены ранее в [.filename]#/boot/loader.conf#. Дополнительную информацию можно найти в https://www.xenproject.org/help/documentation.html[документации Xen(TM)]. Теперь можно создавать гостевые ВМ DomU.

source: Xen(TM) DomU Guest VM Configuration
ko: Xen(TM) DomU 게스트 VM 구성
ru: Конфигурация гостевой виртуальной машины Xen(TM) DomU

source: Unprivileged domains consist of a configuration file and virtual or physical hard disks. Virtual disk storage for the DomU can be files created by man:truncate[1] or ZFS volumes as described in crossref:zfs[zfs-zfs-volume,“Creating and Destroying Volumes”]. In this example, a 20 GB volume is used. A VM is created with the ZFS volume, a FreeBSD ISO image, 1 GB of RAM and two virtual CPUs. The ISO installation file is retrieved with man:fetch[1] and saved locally in a file called [.filename]#freebsd.iso#.
ko: 권한이 없는 도메인은 구성 파일과 가상 또는 물리적 하드 디스크로 구성됩니다. DomU의 가상 디스크 저장소는 man:truncate[1]로 만든 파일 또는 crossref:zfs[zfs-zfs-volume,“Creating and Destroying Volumes”]에 설명된 대로 ZFS 볼륨을 사용할 수 있습니다. 이 예에서는 20GB 볼륨이 사용됩니다. ZFS 볼륨, FreeBSD ISO 이미지, 1GB RAM 및 2개의 가상 CPU로 VM이 생성됩니다. ISO 설치 파일은 man:fetch[1]로 검색하여 [.filename]#freebsd.iso#라는 파일에 로컬로 저장됩니다.
ru: Непривилегированные домены состоят из конфигурационного файла и виртуальных или физических жестких дисков. Виртуальное дисковое хранилище для DomU может быть файлами, созданными с помощью man:truncate[1], или томами ZFS, как описано в crossref:zfs[zfs-zfs-volume,“Создание и уничтожение томов”]. В этом примере используется том объемом 20 ГБ. Виртуальная машина создается с томом ZFS, образом ISO FreeBSD, 1 ГБ оперативной памяти и двумя виртуальными процессорами. Файл установки ISO извлекается с помощью man:fetch[1] и сохраняется локально в файле с именем [.filename]#freebsd.iso#.

source: A ZFS volume of 20 GB called [.filename]#xendisk0# is created to serve as the disk space for the VM.
ko: [.filename]#xendisk0#이라는 20GB의 ZFS 볼륨이 생성되어 VM의 디스크 공간으로 사용됩니다.
ru: Создается том ZFS объемом 20 ГБ с именем [.filename]#xendisk0#, который будет использоваться в качестве дискового пространства для виртуальной машины.

source: The new DomU guest VM is defined in a file. Some specific definitions like name, keymap, and VNC connection details are also defined. The following [.filename]#freebsd.cfg# contains a minimum DomU configuration for this example:
ko: 새 DomU 게스트 VM은 파일로 정의합니다. 이름, 키맵 및 VNC 연결 세부 정보와 같은 일부 특성도 정의합니다. 다음 [.filename]#freebsd.cfg#에는 이 예제에 대한 최소 DomU 구성이 포함되어 있습니다:
ru: Новый гостевая ВМ DomU определяется в файле. Некоторые конкретные определения, такие как имя, раскладка клавиатуры и детали подключения VNC, также задаются. Следующий файл [.filename]#freebsd.cfg# содержит минимальную конфигурацию DomU для этого примера:

source: These lines are explained in more detail:
ko: 이 명령줄에 대한 자세한 설명입니다:
ru: Эти строки объясняются более подробно:

source: This defines what kind of virtualization to use. `hvm` refers to hardware-assisted virtualization or hardware virtual machine. Guest operating systems can run unmodified on CPUs with virtualization extensions, providing nearly the same performance as running on physical hardware. `generic` is the default value and creates a PV domain.
ko: 사용할 가상화 종류를 정의합니다. `hvm`은 하드웨어 지원 가상화 또는 하드웨어 가상 머신을 의미합니다. 게스트 운영 체제는 가상화 확장이 있는 CPU에서 수정하지 않고 실행할 수 있으며, 물리적 하드웨어에서 실행하는 것과 거의 동일한 성능을 제공합니다. 기본값은 `generic`이며 PV 도메인을 생성합니다.
ru: Это определяет, какой тип виртуализации использовать. `hvm` означает аппаратную виртуализацию или аппаратную виртуальную машину. Гостевые операционные системы могут работать без изменений на процессорах с расширениями виртуализации, обеспечивая производительность, почти такую же, как и на физическом оборудовании. `generic` — значение по умолчанию, которое создает PV-домен.

source: Name of this virtual machine to distinguish it from others running on the same Dom0. Required.
ko: 동일한 Dom0에서 실행되는 다른 가상 머신과 구별하기 위한 이 가상 머신의 이름입니다. 필수입니다.
ru: Имя этой виртуальной машины для отличия от других, работающих на том же Dom0. Обязательно.

source: Quantity of RAM in megabytes to make available to the VM. This amount is subtracted from the hypervisor's total available memory, not the memory of the Dom0.
ko: VM에서 사용할 수 있는 RAM의 양(MB)입니다. 이 양은 Dom0의 메모리가 아닌 하이퍼바이저의 총 사용 가능한 메모리에서 차감됩니다.
ru: Количество оперативной памяти в мегабайтах, которое будет доступно виртуальной машине. Этот объем вычитается из общего объема доступной памяти гипервизора, а не из памяти Dom0.

source: Number of virtual CPUs available to the guest VM. For best performance, do not create guests with more virtual CPUs than the number of physical CPUs on the host.
ko: 게스트 VM에서 사용할 수 있는 가상 CPU 수입니다. 최상의 성능을 위해 호스트의 물리적 CPU 수보다 많은 가상 CPU를 가진 게스트를 만들지 마십시오.
ru: Количество виртуальных CPU, доступных гостевой ВМ. Для наилучшей производительности не следует создавать гостевые системы с количеством виртуальных CPU, превышающим число физических CPU на хосте.

source: Virtual network adapter. This is the bridge connected to the network interface of the host. The `mac` parameter is the MAC address set on the virtual network interface. This parameter is optional, if no MAC is provided Xen(TM) will generate a random one.
ko: 가상 네트워크 어댑터. 호스트의 네트워크 인터페이스에 연결된 브리지입니다. `mac` 매개 변수는 가상 네트워크 인터페이스에 설정된 MAC 주소입니다. 이 매개 변수는 선택 사항이며, MAC이 제공되지 않으면 Xen(TM)에서 임의의 MAC을 생성합니다.
ru: Виртуальный сетевой адаптер. Это мост, подключенный к сетевому интерфейсу хоста. Параметр `mac` — это MAC-адрес, установленный на виртуальном сетевом интерфейсе. Этот параметр необязателен: если MAC-адрес не указан, Xen(TM) сгенерирует случайный.

source: Full path to the disk, file, or ZFS volume of the disk storage for this VM. Options and multiple disk definitions are separated by commas.
ko: 이 VM에 대한 디스크 스토리지의 디스크, 파일 또는 ZFS 볼륨에 대한 전체 경로입니다. 옵션 및 여러 디스크 정의는 쉼표로 구분됩니다.
ru: Полный путь к диску, файлу или тому ZFS для дискового хранилища этой ВМ. Параметры и определения нескольких дисков разделяются запятыми.

source: Defines the Boot medium from which the initial operating system is installed. In this example, it is the ISO image downloaded earlier. Consult the Xen(TM) documentation for other kinds of devices and options to set.
ko: 초기 운영 체제가 설치되는 부팅 매체를 정의합니다. 이 예에서는 이전에 다운로드한 ISO 이미지입니다. 설정할 다른 종류의 장치 및 옵션에 대해서는 Xen(TM) 설명서를 참조하십시오.
ru: Определяет загрузочный носитель, с которого устанавливается исходная операционная система. В данном примере это загруженный ранее образ ISO. О других типах устройств и настраиваемых параметрах см. документацию Xen(TM).

source: Options controlling VNC connectivity to the serial console of the DomU. In order, these are: active VNC support, define IP address on which to listen, device node for the serial console, and the input method for precise positioning of the mouse and other input methods. `keymap` defines which keymap to use, and is `english` by default.
ko: DomU의 시리얼 콘솔에 대한 VNC 연결을 제어하는 옵션입니다. 순서대로 VNC 지원 활성화, 수신할 IP 주소 정의, 시리얼 콘솔의 장치 노드, 마우스 및 기타 입력 방법의 정확한 위치를 위한 입력 방법 등이 있습니다. `keymap`은 사용할 키맵을 정의하며, 기본값은 `english`입니다.
ru: Параметры, управляющие подключением VNC к последовательной консоли DomU. В порядке перечисления: поддержка VNC, определение IP-адреса для прослушивания, файл устройства последовательной консоли и метод ввода для точного позиционирования мыши и других методов ввода. `keymap` определяет, какую раскладку клавиатуры использовать, по умолчанию установлено значение `english`.

source: After the file has been created with all the necessary options, the DomU is created by passing it to `xl create` as a parameter.
ko: 필요한 모든 옵션이 포함된 파일을 생성한 후 이를 `xl create`에 매개변수로 전달하여 DomU를 생성합니다.
ru: После создания файла со всеми необходимыми параметрами DomU создаётся путём передачи его в `xl create` в качестве аргумента.

source: Each time the Dom0 is restarted, the configuration file must be passed to `xl create` again to re-create the DomU. By default, only the Dom0 is created after a reboot, not the individual VMs. The VMs can continue where they left off as they stored the operating system on the virtual disk. The virtual machine configuration can change over time (for example, when adding more memory). The virtual machine configuration files must be properly backed up and kept available to be able to re-create the guest VM when needed.
ko: Dom0을 재시작할 때마다 구성 파일을 `xl create`에 다시 전달하여 DomU를 다시 생성해야 합니다. 기본적으로 재부팅 후에는 개별 VM이 아닌 Dom0만 생성됩니다. VM은 가상 디스크에 운영 체제를 저장한 상태에서 중단한 부분을 계속 진행할 수 있습니다. 가상 머신 구성은 시간이 지남에 따라 변경될 수 있습니다(예: 메모리를 더 추가할 때). 필요할 때 게스트 VM을 다시 생성할 수 있도록 가상 머신 구성 파일을 적절히 백업하고 사용 가능한 상태로 유지해야 합니다.
ru: Каждый раз при перезапуске Dom0 конфигурационный файл необходимо снова передавать в `xl create`, чтобы воссоздать DomU. По умолчанию после перезагрузки создается только Dom0, но не отдельные виртуальные машины. Виртуальные машины могут продолжить работу с момента остановки, так как операционная система сохраняется на виртуальном диске. Конфигурация виртуальной машины может со временем меняться (например, при добавлении памяти). Конфигурационные файлы виртуальных машин необходимо надлежащим образом резервировать и хранить в доступном месте, чтобы иметь возможность воссоздать гостевую виртуальную машину при необходимости.

source: The output of `xl list` confirms that the DomU has been created.
ko: 'xl list`의 출력은 DomU가 생성되었음을 보여줍니다.
ru: Вывод команды `xl list` подтверждает, что DomU был создан.
