<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/gnome/docs/bugging.sgml,v 1.3 2004/01/06 17:31:40 stephane Exp $">
<!ENTITY title "Projet GNOME pour FreeBSD : rapporter un bug">
<!ENTITY % gnomeincludes SYSTEM "../includes.sgml"> %gnomeincludes;
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
]>

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.11

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@FreeBSD-FR.org>
-->

<html>
  &header;

          <h2>1. Quoi rapporter ?</h2>

          <p>La premi&egrave;re r&egrave;gle est : rapportez autant d'informations que vous
            pouvez. M&ecirc;me s'il y a des informations inutiles les
	    d&eacute;veloppeurs pourront facilement les &eacute;liminer. Au contraire, la
	    situation est bien pire lorsqu'il n'y a pas assez d'informations
	    pour d&eacute;couvrir ou reproduire le probl&egrave;me - dans ce cas, les d&eacute;veloppeurs
	    devront perdre du temps &agrave; deviner et/ou demander des pr&eacute;cisions &agrave;
	    l'auteur du rapport de bug.</p>

          <p>Il y a plein d'exemples de rapports de bugs totalement inutiles, du
            genre <i>"H&eacute;, le port de gnomebidule est cass&eacute;. J'utilise FreeBSD-X.Y.
	    Corrigez svp."</i> Inutile de dire que de tels rapports sont juste un gaspillage
	    de votre temps, du temps du d&eacute;veloppeur concern&eacute; et de bande passante.
	    Au strict minimum, le rapport doit inclure les informations
	    suivantes :</p>

          <ul>
	    <li><p>La version exacte du syst&egrave;me d'exploitation (habituellement le r&eacute;sultat de
	      <tt>uname -a</tt>).</p></li>
	    <li><p>La liste de tous les paquetages install&eacute;s sur votre syst&egrave;me.</p></li>
	    <li><p>Votre environnement (le r&eacute;sultat de <tt>/usr/bin/env</tt>).
	    <li><p>Si vous faites une compilation &agrave; partir des ports, la date approximative o&ugrave; vous avez
	      mis &agrave; jour les ports.</p></li>
	    <li><p>Des informations sp&eacute;cifiques &agrave; chaque type d'erreur : le log complet de
	      la compilation dans le cas o&ugrave; la compilation d'un port est cass&eacute;,
	      le contenu de la pile dans le cas d'un core dump, une description d&eacute;taill&eacute;e
	      du probl&egrave;me lorsque cela concerne une application, etc. Essayez de vous
	      mettre &agrave; la place du d&eacute;veloppeur et, pour chaque cas particulier,
	      &eacute;valuez quelles informations peuvent &ecirc;tre n&eacute;cessaires pour qu'il puisse trouver
	      la source du probl&egrave;me. Ne pensez pas que les d&eacute;veloppeurs connaissent d&eacute;j&agrave; tout du
	      probl&egrave;me et qu'ils sont juste trop paresseux pour le corriger.</p></li>
          </ul>

	  <p>Par ailleurs, essayez de r&eacute;pondre aux questions
	    suivantes :</p>

	  <ul>
	    <li><b>Quel est exactement le probl&egrave;me ?</b> :
	      Expliquez le probl&egrave;me aussi clairement et
	      pr&eacute;cis&eacute;ment que possible. Essayez de
	      limiter la description du probl&egrave;me &agrave; une
	      ou deux phrases cl&eacute;s.</li>
	    <li><b>O&ugrave; survient le probl&egrave;me ?</b> : Dites
	      si le probl&egrave;me intervient lors de la compilation,
	      de l'installation, ou de l'ex&eacute;cution.
	      D&eacute;crivez &eacute;galement la machine sur laquelle
	      survient le probl&egrave;me (peut-&ecirc;tre en
	      avez-vous plusieurs) et avec quelle locale (i.e. quelle
	      valeur de la valeur d'environnement <b>LANG</b>).</li>
	    <li><b>Quand le probl&egrave;me est-il survenu pour la
	      premi&egrave;re fois ?</b> : Essayez de
	      d&eacute;terminer quand le probl&egrave;me a
	      commenc&eacute; &agrave; appara&icirc;tre. Si &ccedil;a
	      n'a jamais march&eacute; ou que vous avez toujours eu un
	      probl&egrave;me, dites le &eacute;galement. Dites aussi
	      quand le probl&egrave;me a &eacute;t&eacute;
	      observ&eacute; pour la derni&egrave;re fois, et, le cas
	      &eacute;ch&eacute;ant, quand les choses ont bien
	      march&eacute; pour la derni&egrave;re fois.</li>
	    <li><b>Quelle est l'importance du probl&egrave;me ?</b> :
	      Expliquez si les choses empirent, si elles
	      s'am&eacute;liorent, ou si elles restent les
	      m&ecirc;mes. Nous avons conscience que beaucoup de
	      probl&egrave;mes ne sont que des probl&egrave;mes, mais
	      ce genre d'information peut s'av&eacute;rer utile dans
	      certains cas.</li>
	  </ul>

	  <p>Tenez vous pr&ecirc;t &agrave; r&eacute;pondre &agrave;
	    des questions suppl&eacute;mentaires. Bien souvent, les
	    d&eacute;veloppeurs ne peuvent r&eacute;soudre un
	    probl&egrave;me ou m&ecirc;me en faire le diagnostique
	    tout de suite. Donc, montrez vous compr&eacute;hensif
	    lorsqu'on vous demandera de fournir d'autres
	    informations.</p>

          <p>Si vous avez une solution ou un moyen de contourner le probl&egrave;me, mettez le
            &eacute;galement dans votre rapport, m&ecirc;me si vous n'&ecirc;tes pas certain que cette
	    solution est correcte. Si elle ne l'est pas, elle peut tout de m&ecirc;me
	    donner au d&eacute;veloppeur des id&eacute;es et lui faire gagner du temps.</p>

          <h2>2. O&ugrave; envoyer le rapport ?</h2>

          <p>Avant de rapporter un bug, ou m&ecirc;me d'envoyer un message sur la liste,
	    <a href="http://www.freebsd.org/search/search.html">faites une recherche</a>
	    dans les archives de la liste de diffusion GNOME pour FreeBSD pour voir s'il n'a pas
	    d&eacute;j&agrave; &eacute;t&eacute; rapport&eacute;. La plupart des probl&egrave;mes rapport&eacute;s sur
	    les listes de diffusion sont d&eacute;j&agrave; connus et, en faisant une recherche, vous pouvez trouver
	    la solution &agrave; votre probl&egrave;me beaucoup plus rapidement.
	  </p>

          <p>Une fois que vous &ecirc;tes certain qu'il s'agit d'un probl&egrave;me nouveau, il y a plusieurs mani&egrave;res 
          de rapporter un bug concernant GNOME sous FreeBSD : vous pouvez 
          envoyer un rapport sur la
	    <a href="mailto:&email;@FreeBSD.org">liste de diffusion 
            freebsd-gnome</a>, remplir un rapport de probl&egrave;me avec
	    <a href="http://www.freebsd.org/support.html#gnats">le syst&egrave;me de rapport 
            de bug FreeBSD</a>, envoyer votre rapport aux d&eacute;veloppeurs GNOME
	    concern&eacute;s via leur
	    <a href="http://bugzilla.gnome.org/">syst&egrave;me de gestion de bug</a> ou utiliser
            une combinaison de ces diff&eacute;rentes m&eacute;thodes.<p>

          <p>Il est impossible de d&eacute;finir des r&egrave;gles qui vous indiqueront clairement 
            dans tous les cas o&ugrave; envoyer votre rapport - utilisez votre bon
	    sens. Voici cependant quelques principes g&eacute;n&eacute;raux :</p>

          <ul>
            <li><p>Si le probl&egrave;me est sp&eacute;cifique &agrave; FreeBSD et temporaire (e.g. un checksum
	      incorrect, un patch qui &eacute;choue, une erreur de syntaxe dans le Makefile du port, etc.) alors
	      envoyez le rapport &agrave; la <a href="mailto:&email;@FreeBSD.org">
         liste de diffusion freebsd-gnome</a>.</p></li>
	    <li><p>Si le probl&egrave;me est clairement non sp&eacute;cifique &agrave; FreeBSD et que vous n'avez pas
	      de solution disponible alors envoyez le rapport directement aux d&eacute;veloppeurs
	      du logiciel (pour la plupart des composants du noyau de GNOME cela signifie que
	      vous devrez utiliser leur syst&egrave;me de gestion de bug "Bugzilla").</p></li>
	    <li><p>Si le probl&egrave;me n'est pas sp&eacute;cifique &agrave; FreeBSD mais assez s&eacute;rieux et que
	      vous avez une solution disponible alors envoyez le rapport &agrave; la fois &agrave; FreeBSD et au
	      syst&egrave;me de gestion de bug des auteurs, de fa&ccedil;on &agrave; ce que le port concern&eacute;
              soit corrig&eacute; et que les autres utilisateurs FreeBSD puissent b&eacute;neficier de
              votre solution sans avoir &agrave; attendre la sortie d'une nouvelle version du
              logiciel.</p></li>
          </ul>

    &footer;
  </body>
</html>
