<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/gnome/docs/faq.sgml,v 1.2 2004/01/06 17:31:40 stephane Exp $">
<!ENTITY title "Projet GNOME pour FreeBSD : FAQ GNOME 1.4">
<!ENTITY % navincludes SYSTEM "../../includes.navdevelopers.sgml"> %navincludes;
<!ENTITY % gnomeincludes SYSTEM "../includes.sgml"> %gnomeincludes;
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.38

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
  &header;

  <table border="0">
    <tr>
      <td>
        <h2>Sommaire</h2>
          <ol>
            <li> <a href="#q1">Comment obtenir GNOME pour FreeBSD ?</a>
            <li> <a href="#q2">Le port de GNOME ne compile pas. Que
              faire ?</a>
            <li> <a href="#q3">J'ai install&eacute; GNOME, mais il me manque l'application
	      "bidule". Pourquoi ?</a>
            <li> <a href="#q4">Comment garder &agrave; jour mes composants et applications GNOME ?</a>
	    <li> <a href="#q5">Quel est la diff&eacute;rence entre GNOME et KDE ?
	      Lequel est le meilleur ?</a>
	    <li> <a href="#q6">O&ugrave; puis-je trouver d'autres th&egrave;mes pour GNOME ?</a>
	    <li> <a href="#q7">Quels sont les gestionnaires de fen&ecirc;tres qui
              fonctionnent avec GNOME ?</a>
	    <li> <a href="#q8">Pourquoi je ne peux pas lancer d'applications
              Linux &agrave; partir du tableau de bord GNOME ?</a>
	    <li> <a href="#q9">Pourquoi GNOME est si &eacute;norme, lent et au fond
	      inutile ?</a>
	    <li> <a href="#q10">Est-ce que GNOME supporte l'anti-aliasing pour
              les polices de caract&egrave;res ?</a>
	    <li> <a href="#q11">Comment activer le support Java dans les navigateurs
              web Mozilla ou Galeon ?</a>
          </ol>
        <h2>Texte complet</h2>
        <table border="0" cellspacing="0" cellpadding="2">

<!-- Q1 -->
          <tr>
	    <td width="10">
	      <b><a name="q1"> 1.</a></b>
	    </td>
	    <td align="left" valign="top" colspan="3">
	      <b>Comment obtenir GNOME pour FreeBSD ?</b>
	    </td>
          </tr>
          <tr>
<!-- A1 -->
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Il y a 2 mani&egrave;res d'installer GNOME sur FreeBSD. L'une est d'utiliser
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/packages-using.html">
	        les paquetages</a>, l'autre est d'utiliser
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/ports-using.html">
	        les ports</a>.</p>

	    <p>Pour installer GNOME &agrave; partir des paquetages, utilisez la commande :</p>

	    <tt># pkg_add -r gnome</tt>

	    <p>Les derniers paquetages GNOME seront t&eacute;l&eacute;charg&eacute;s depuis le site FTP
              FreeBSD et seront install&eacute;s sur votre syst&egrave;me.

	    <p>Pour compiler et installer GNOME &agrave; partir des ports, utilisez tout d'abord
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/cvsup.html">
	        cvsup</a> pour avoir la toute derni&egrave;re version des ports. Puis :</p>

	    <pre>
# cd /usr/ports/x11/gnome
# make clean
# make install clean
	    </pre>

		<p>Apr&egrave;s l'installation de GNOME, vous pouvez ajouter la ligne suivante
		  dans le fichier <tt>/etc/make.conf</tt>:</p>

		<pre>
WITH_GTK=yes
        </pre>

		<p>Ce n'est pas obligatoire, mais cela permettra &agrave; certains ports, comme
		  Vim, d'utiliser la biblioth&egrave;que Gtk+.</p>

	    <p>La m&eacute;thode recommand&eacute;e pour l'installation de GNOME
          est celle des ports.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q2 -->
        <tr>
	  <td width="10">
	    <b><a name="q2"> 2.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Le port de GNOME ne compile pas. Que faire ?</b>
	  </td>
        </tr>
<!-- A2 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>La majorit&eacute; des probl&egrave;mes de compilation de GNOME peut se r&eacute;soudre en s'assurant
	      que tous les composants n&eacute;cessaires &agrave; GNOME sont <a href="#q4">&agrave; jour</a>.
         Toutes les applications GNOME ont besoin des composants suivants pour
         la compilation :</p>

	    <pre>
pkg-config
glib
gettext
gtk+
ORBit
Imlib
esound
gnomelibs
gnomecore
            </pre>

	    <p>V&eacute;rifier que tous ces composants sont &agrave; jour, et essayer &agrave; nouveau la
              compilation de GNOME ou de l'application GNOME. Vous pouvez
              &eacute;ventuellement voir des erreurs du compilateur en rapport avec les
              pthreads (threads POSIX), comme par exemple :</p>

	    <pre>
undefined reference to 'strerror_r'
            </pre>

	    <p>Pour corriger ces erreurs li&eacute;es aux threads, assurez-vous que les
              options suivantes sont dans le fichier de configuration de votre
              noyau :</p>

	    <pre>
options     _KPOSIX_PRIORITY_SCHEDULING
            </pre>

	    <p>Et assurez-vous, si vous suivez la branche -stable ou -current, que vous
	      <b>n'avez pas</b> l'option <tt>NOLIBC_R</tt> dans le fichier <tt>/etc/make.conf</tt>.
	      Si c'est le cas, supprimez la, puis recompilez et r&eacute;installez le syst&egrave;me ("make world").
	    </p>

		<p>Les ports tels que <tt>devel/pth</tt> et <tt>devel/ngpt</tt> peuvent
		  &eacute;galement causer des probl&egrave;mes li&eacute;s aux pthreads lors de la compilation de GNOME.
		  Si vous n'avez pas besoin de ces ports, il est recommand&eacute; de les supprimer.
		</p>

      <p>Si malgr&eacute; tout vous avez encore des probl&egrave;mes, envoyez un
	      courrier &eacute;lectronique &agrave; <a href="mailto:&email;@FreeBSD.org">
	      &email;@FreeBSD.org</a> avec le d&eacute;tail des erreurs de compilation.
      </p>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q3 -->
        <tr>
	  <td width="10">
	    <b><a name="q3"> 3.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>J'ai install&eacute; GNOME, mais il me manque l'application "bidule". Pourquoi ?</b>
	  </td>
        </tr>
<!-- A3 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Seuls les composants principaux, et quelques extras, sont inclus dans
	      paquetage <tt>gnome</tt>. Il existe un autre meta-port appel&eacute;
	      <tt>gnome-fifth-toe</tt> qui inclue des applications GNOME plus populaires
              (et plus grosses). <tt>gnome-fifth-toe</tt> inclue
	      Galeon, Pan, Gnumeric, AbiWord, GNUCash, Evolution, Gimp, Dia et plus
	      encore.</p>

	    <p>Pour installer <tt>gnome-fifth-toe</tt> &agrave; partir des paquetages.

	    <pre>
# pkg_add -r gnome-fifth-toe
	    </pre>

	    <p>Pour compiler <tt>gnome-fifth-toe</tt> &agrave; partir des ports :</p>

	    <pre>
# cd /usr/ports/x11/gnome-fifth-toe
# make clean
# make install clean
	    </pre>

	    <p>Une liste compl&egrave;te des applications GNOME port&eacute;es sur
	      est disponible <a href="../../ports/gnome.html">ici</a>.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q4 -->
        <tr>
	  <td width="10">
	    <b><a name="q4"> 4.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Comment garder &agrave; jour mes composants et applications GNOME ?</b>
	  </td>
        </tr>
<!-- A4 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>J'ai d&eacute;couvert que <tt>/usr/ports/sysutils/portupgrade</tt> fonctionne tr&egrave;s
	      bien. Par exemple :</p>

	    <tt># portupgrade -r pkgconfig</tt>

	    <p>Cela mettra &agrave; jour pkgconfig et tous les autres ports qui en d&eacute;pendent
	      (s'ils ont besoin d'&ecirc;tre mis &agrave; jour).</p>

	    <p>Cependant, il y a parfois de tels changements, qu'il devient
	      n&eacute;cessaire de faire d'abord un peu de nettoyage. Dans ce cas, la
	      proc&eacute;dure suivante fonctionne dans la plupart des cas :</p>

	    <pre>
# pkg_delete -rf pkgconfig\*
# cd /usr/ports/x11/gnome
# make clean
# make install clean
	    </pre>

       <p>Ces commandes supprimeront <b>tous</b> les composants et applications
         de GNOME 1 et 2 sur votre machine, et seul le bureau de GNOME 1
         sera r&eacute;install&eacute;. Attention, si vous suivez cette
	      proc&eacute;dure, vous devrez r&eacute;installer vos applications apr&egrave;s avoir
	      r&eacute;install&eacute; le bureau. Heureusement, cette m&eacute;thode extr&ecirc;me
	      est rarement n&eacute;cessaire.
	    </p>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q5 -->
        <tr>
	  <td width="10">
	    <b><a name="q5"> 5.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Quelle est la diff&eacute;rence entre GNOME et KDE ? Lequel est le
	      meilleur ?</b>
	  </td>
        </tr>
<!-- A5 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>GNOME et KDE sont tous les deux des environnements de bureau. GNOME est bas&eacute; sur
	      la librairie GTK+ et est principalement &eacute;crit en C. Par contre, KDE
	      est bas&eacute; sur la librairie QT et est principalement &eacute;crit
	      en C++.</p>

	    <p>Les deux environnements offrent une large vari&eacute;t&eacute; d'applications depuis des gadgets
	      et des jeux jusqu'&agrave; des suites compl&egrave;tes d'outils bureautiques. Les deux sont d&eacute;velopp&eacute;s activement et
	      disponibles sous FreeBSD. Si vous voulez d&eacute;cider lequel utiliser,
              essayez les deux, et choisissez celui que <b>vous</b> pr&eacute;f&eacute;rez.
	    </p>

	    <p>Pour en savoir plus sur KDE sous FreeBSD, vous pouvez consulter
	      <a href="http://freebsd.kde.org">http://freebsd.kde.org</a>.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q6 -->
        <tr>
	  <td width="10">
	    <b><a name="q6"> 6.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>O&ugrave; puis-je trouver d'autres th&egrave;mes pour GNOME ?</b>
	  </td>
        </tr>
<!-- A6 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Si vous &ecirc;tes fatigu&eacute; des th&egrave;mes par d&eacute;faut fournis avec GNOME, vous
	      avez plusieurs options. Tout d'abord, la collection des ports FreeBSD contient une
	      large collection de th&egrave;mes GTK pour GNOME. Pour les installer
	      &agrave; partir des paquetages, utilisez la commande :</p>

	    <tt># pkg_add -r gtk-engines-collection</tt>

	    <p>Pour installer les th&egrave;mes &agrave; partir des ports, utilisez les commandes :</p>

	    <pre>
# cd /usr/ports/x11-toolkits/gtk-engines-collection
# make clean
# make install clean
	    </pre>

	    <p>Si vous voulez encore plus de th&egrave;mes, consultez le site
	      <a href="http://art.gnome.org/">http://art.gnome.org/</a>. Notez
	      que vous devrez probablement installer <tt>gtk-engines-collection</tt>
	      avant de pouvoir utiliser les th&egrave;mes.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q7 -->
        <tr>
	  <td width="10">
	    <b><a name="q7"> 7.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Quels sont les gestionnaires de fen&ecirc;tres qui fonctionnent avec GNOME ?</b>
	  </td>
        </tr>
<!-- A7 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Le meta-port <tt>gnome</tt> installe par d&eacute;faut
              le gestionnaire de fen&ecirc;tres
	      <a href="http://sawmill.sourceforge.net/">Sawfish</a>.
		  Cependant, d'autres gestionnaires de fen&ecirc;tres peuvent s'utiliser
		  avec GNOME. Comme par exemple :</p>

	    <ul>
	      <li><a href="http://www.enlightenment.org/pages/main.html">Enlightenment</a></li>
	      <li><a href="http://www.fvwm.org/">FVWM2</a></li>
	      <li><a href="http://www.windowmaker.org/">WindowMaker</a></li>
	      <li><a href="http://www.afterstep.org/">Afterstep</a></li>
	      <li><a href="http://www.icewm.org/">IceWM</a></li>
	      <li><a href="http://www.xfce.org/">XFce</a></li>
	    </ul>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q8 -->
        <tr>
	  <td width="10">
	    <b><a name="q8"> 8.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Pourquoi je ne peux pas lancer d'applications Linux &agrave; partir
               du tableau de bord GNOME ?</b>
	  </td>
        </tr>
<!-- A8 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
	    <p>La r&eacute;ponse courte est que vous le pouvez. Le probl&egrave;me est li&eacute; au fait
              que vous avez sans doute activ&eacute; le "Launch Feedback" (xalf).  xalf est un objet partag&eacute;
              FreeBSD et, en tant que tel, il ne peut &ecirc;tre charg&eacute; par des applications Linux.
	      Lorsque vous essayez de charger une application Linux, rien ne se passe,
	      et des lignes comme ci-dessous apparaissent dans le fichier
	      <tt>~/.gnomerc-errors</tt> ou sur la sortie standard :</p>

	    <pre>
/usr/local/Acrobat4/Reader/intellinux/bin/acroread: error in loading shared
libraries: /usr/X11R6/lib/libxalflaunch.so.0: ELF file OS ABI invalid.
	    </pre>

	    <p>Pour corriger ce probl&egrave;me, vous devez installer le
		  port <tt>linux-xalf</tt>. Ce port (ou ce paquetage) installe
		  la version Linux de <tt>libxalflaunch.so.0</tt> dans
		  <tt>/compat/linux/usr/X11R6/lib</tt>, et sera utilis&eacute;
		  &agrave; la place du binaire FreeBSD lors du lancement d'applications
                  Linux. Vous pouvez &eacute;ventuellement voir l'erreur suivante apr&egrave;s avoir
		  install&eacute; <tt>linux-xalf</tt> :</p>

		<pre>
/usr/libexec/ld-elf.so.1: Shared object "libkrb.so.3" not found
        </pre>

		<p>Cette erreur est sans danger et peut &ecirc;tre ignor&eacute;e.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q9 -->
        <tr>
	  <td width="10">
	    <b><a name="q9"> 9.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Pourquoi GNOME est si &eacute;norme, lent et au fond inutile ?</b>
	  </td>
        </tr>
<!-- A9 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
	    <p>Cela d&eacute;pend du point de vue. Bien s&ucirc;r, GNOME
	      et KDE sont encore loin d'&ecirc;tre parfaits ou m&ecirc;me d'&ecirc;tre totalement achev&eacute;s et
	      ils peuvent difficilement &ecirc;tre compar&eacute;s aux logiciels commerciaux en terme de
	      facilit&eacute; d'utilisation. Mais, dans le m&ecirc;me temps, c'est un grand pas vers
	      la bonne direction. Il faut aussi not&eacute; que GNOME et
	      KDE sont encore tr&egrave;s jeunes et la situation ne peut que s'am&eacute;liorer
	      dans le futur (quelqu'un se rappelle-t'il quelle sorte de me..e &eacute;tait
	      Windows 3.11 ?).</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q10 -->
        <tr>
	  <td width="10">
	    <b><a name="q10"> 10.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Est-ce que GNOME supporte l'anti-aliasing pour
              les polices de caract&egrave;res ?</b>
	  </td>
        </tr>
<!-- A10 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
	  	<p>Oui ! Cependant, il y a 2 choses &agrave; faire.
        Tout d'abord, vous avez besoin de XFree86 4.0 ou
        sup&eacute;rieur (la version 4.1 ou sup&eacute;rieure est recommand&eacute;e). Puis, vous avez
        besoin du port <tt>x11/gdkxft</tt>. C'est tout ! Vous n'avez pas besoin
        de recompiler vos applications GNOME.</p>

		<p>Si vous rencontrez des probl&egrave;mes, consultez le
		  <a href="http://gdkxft.sourceforge.net/">site web gdkxft</a>
		  ou envoyez un courrier &eacute;lectronique &agrave; <a href="mailto:&email;@FreeBSD.org">
		  &email;@FreeBSD.org</a>.</p>

		<p>Si vous avez des questions, vous pouvez les envoyer &agrave;
		  <a href="mailto:&email;@FreeBSD.org">&email;@FreeBSD.org</a>.
		</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q11 -->
        <tr>
	  <td width="10">
	    <b><a name="q11"> 11.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Comment activer le support Java dans les navigateurs
              web Mozilla ou Galeon ?</b>
	  </td>
        </tr>
<!-- A11 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
	    <p>Pour activer le support Java dans le navigateur web Mozilla vous devez
	      installer le kit de d&eacute;veloppement Java &agrave; partir du port <tt>java/jdk13
	      </tt> (version 1.3.1p6 ou sup&eacute;rieure n&eacute;cessaire) et red&eacute;marrer le
	      navigateur. Notez que si la version du paquetage Mozilla
	      install&eacute; sur votre ordinateur est inf&eacute;rieure &agrave; la 0.9.8_2,1 vous avez &eacute;galement besoin
	      d'utiliser la commande suivante afin de cr&eacute;er le lien symbolique n&eacute;cessaire
	      au fonctionnement du plugin Java :</p>
	    <pre>
# ln -sf /usr/local/jdk1.3.1/jre/plugin/i386/ns600/libjavaplugin_oji.so \
	/usr/X11R6/lib/mozilla/plugins/libjavaplugin_oji.so
	    </pre>

	    <p>Vous pouvez v&eacute;rifier que Mozilla a bien pris en compte le plugin Java
	      en s&eacute;lectionnant <i>A propos des Plug-ins</i> du menu <i>Aide</i> apr&egrave;s
	      avoir red&eacute;marrer Mozilla. Vous devez voir
	      /usr/local/jdk1.3.1/jre/plugin/i386/ns600/libjavaplugin_oji.so
	      dans la liste des plugins disponibles, ce qui indique que le support
	      Java est activ&eacute;.</p>

	    <p>Si vous compilez Galeon avec la version compl&egrave;te de Mozilla, le
	      plugin Java fonctionnera &eacute;galement pour ce navigateur. Assurez-vous simplement de cocher l'option
	      <i>Activer Java</i> dans le menu <i>Pr&eacute;f&eacute;rence</i>.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

        </table>
      </td>
    </tr>
  </table>
  &footer;
</body>
</html>
