<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/gnome/docs/faq2.sgml,v 1.2 2004/01/06 17:31:40 stephane Exp $">
<!ENTITY title "Projet GNOME pour FreeBSD : FAQ GNOME 2.2">
<!ENTITY % gnomeincludes SYSTEM "../includes.sgml"> %gnomeincludes;
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.27

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
  &header;

  <table border="0">
    <tr>
      <td>
        <h2>Contenus</h2>
          <ol>
            <li> <a href="#q1">Comment installer GNOME 2.2 sur FreeBSD ?</a>
            <li> <a href="#q2">Le port de GNOME 2.2 ne compile pas. Que dois-je
	      faire ?</a>
            <li> <a href="#q3">J'ai install&eacute; GNOME 2.2 mais il me manque
	      l'application "truc". Que faire ?</a>
            <li> <a href="#q4">Quel est le meilleur moyen de mettre &agrave; jour GNOME
	      1.4 vers GNOME 2 ?</a>
	    <li> <a href="#q5">Comment garder &agrave; jour les applications et
	      les composants de GNOME 2.2 ?</a>
	    <li> <a href="#q6">Puis-je installer des applications GNOME 1.4 sous
	      GNOME 2.2 et vice-versa ?</a>
	    <li> <a href="#q7">O&ugrave; puis-je trouver plus de th&egrave;mes pour GNOME 2.2 ?</a>
	    <li> <a href="#q8">Quels gestionnaires de fen&ecirc;tre fonctionnent correctement avec GNOME 2.2 ?
	      </a>
	    <li> <a href="#q9">Est-ce que GNOME 2.2 supporte l'anti-aliasing pour les fontes ?</a>
            <li> <a href="#q10">Comment contr&ocirc;ler quelles fontes utilisent l'anti-aliasing ?
              </a>
	    <li> <a href="#q11">Comment &eacute;diter mes menus GNOME 2 ?</a>
	    <li> <a href="#q12">Comment utiliser les param&egrave;tres de ressource GTK+ 2 pour
	      les applications GTK+ 2 sans &ecirc;tre dans l'environnement GNOME ?</a>
	    <li> <a href="#q13">Comment configurer les param&egrave;tres des applications
         GNOME 1.4 sous GNOME 2.2 ?</a>
          </ol>
        <h2>Textes complets</h2>
        <table border="0" cellspacing="0" cellpadding="2">

<!-- Q1 -->
          <tr>
	    <td width="10">
	      <b><a name="q1"> 1.</a></b>
	    </td>
	    <td align="left" valign="top" colspan="3">
	      <b>Comment installer GNOME 2.2 sur FreeBSD ?</b>
	    </td>
          </tr>
          <tr>
<!-- A1 -->
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Il existe deux fa&ccedil;ons d'installer GNOME 2.2 sur FreeBSD. L'une d'elle est d'utiliser
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/packages-using.html">
	        les paquetages</a>, et l'autre est d'utiliser
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/ports-using.html">
	        les ports</a>. Avant d'utiliser l'une ou l'autre de ces installations, vous devriez
		tout d'abord consulter les
		<a href="http://www.gnome.org/start/2.2/notes/">
		notes de version</a> de GNOME 2.2.</p>

	    <p>Pour installer GNOME 2.2 &agrave; partir des paquetages, utilisez la commande :</p>

	    <tt># pkg_add -r gnome2</tt>

	    <p>Cela t&eacute;l&eacute;chargera les derni&egrave;res versions des paquetages GNOME 2.2 depuis le
	      site FTP FreeBSD et proc&egrave;dera &agrave; leur installation sur votre syst&egrave;me.
	    </p>

	    <p>Pour compiler et installer GNOME 2.2 &agrave; partir des ports, vous devez d'abord mettre &agrave; jour via
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/cvsup.html">
	        cvsup</a> l'arbre des ports. Puis :</p>

	    <pre>
# cd /usr/ports/x11/gnome2
# make clean
# make install clean
	    </pre>

       <p>Pour profiter au mieux de GNOME 2, vous devriez l'installer &agrave; partir
	      des ports et ajouter les lignes suivantes &agrave; votre fichier
	      <tt>/etc/make.conf</tt> :</p>

	    <pre>
WITH_FAM=	yes
WITH_LAME=	yes
	    </pre>

	    <p><tt>WITH_FAM</tt> autorise le support du gestionnaire de modification de fichier
	      ce qui permet &agrave; Nautilus de mettre &agrave; jour ses listes de fichiers en temps r&eacute;el
	      ainsi qu'aux composants GNOME de d&eacute;tecter les changements dans les fichiers
	      de configuration sans avoir besoin de red&eacute;marrer GNOME.
	      <tt>WITH_LAME</tt> ajoute le support du MP3, ce qui permet d'&eacute;couter
	      des MP3s directement depuis Nautilus.</p>

	    <p>Ces options peuvent provoquer des erreurs de compilation sur certaines plates-formes, c'est
	      pourquoi elles ne sont pas activ&eacute;es par d&eacute;faut.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q2 -->
        <tr>
	  <td width="10">
	    <b><a name="q2"> 2.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Le port de GNOME 2.2 ne compile pas. Que dois-je faire ?</b>
	  </td>
        </tr>
<!-- A2 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>La majorit&eacute; des probl&egrave;mes de compilation avec GNOME 2.2 peuvent &ecirc;tre r&eacute;solus
	      en s'assurant que tous les composants n&eacute;cessaires &agrave; GNOME 2.2 sont
	      <a href="#q5">&agrave; jour</a>. Vous pouvez avoir des erreurs de compilation li&eacute;es aux pthreads
	      (les threads POSIX) comme :</p>

	    <pre>
undefined reference to 'strerror_r'
            </pre>

	    <p>Pour corriger ces erreurs li&eacute;es aux threads, assurez vous d'avoir ces options
	      dans le fichier de configuration de votre noyau :</p>

	    <pre>
options     _KPOSIX_PRIORITY_SCHEDULING
            </pre>

	    <p>Et assurez-vous, si vous suivez la branche -stable ou -current, que vous
	      n'avez <b>pas</b> l'option <tt>NOLIBC_R</tt> dans le fichier
	      <tt>/etc/make.conf</tt>. Si vous l'avez, supprimez la et remettez &agrave; jour le syst&egrave;me avec un "make world".
	      Si vous avez toujours des probl&egrave;mes, merci d'envoyer un courrier &eacute;lectronique &agrave;
	      <a href="mailto:&email;@FreeBSD.org">
	      &email;@FreeBSD.org</a> en indiquant les erreurs de compilation.
	      Il est aussi utile d'inclure le fichier config.log du r&eacute;pertoire
	      "work" du port.</p>

	    <p>Les ports tels que <tt>devel/pth</tt> et <tt>devel/ngpt</tt> peuvent
	      aussi causer des probl&egrave;mes li&eacute;s aux pthreads lors de la compilation de GNOME 2.2.
	      Si vous n'avez pas besoin d'avoir ces ports install&eacute;s, il est recommand&eacute;
	      de les supprimer.
	    </p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q3 -->
        <tr>
	  <td width="10">
	    <b><a name="q3"> 3.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>J'ai install&eacute; GNOME 2.2 mais il me manque l'application "truc".
	      Que faire ?</b>
	  </td>
        </tr>
<!-- A3 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Seuls les composants principaux, et quelques extras, sont inclus dans le
	      paquetage <tt>gnome2</tt>. Comme GNOME 2 est relativement r&eacute;cent, il n'y a
	      pas encore beaucoup d'applications port&eacute;es pour cette version.
	      Au fur et &agrave; mesure que les applications seront disponibles, elles seront port&eacute;es
	      pour cette version. En attendant, vous pouvez toutefois faire fonctionner
	      <a href="#q6">les applications GNOME 1.4</a> sous GNOME 2.2.</p>

       <p>De nombreuses applications qui ont d&eacute;j&agrave; &eacute;t&eacute; port&eacute;es sont inclues
	      dans le m&eacute;ta-port <tt>gnome2-fifth-toe</tt>.
	      <tt>gnome2-fifth-toe</tt> inclu les versions GNOME 2.2
	      de certaines applications GNOME 1.4. Attention, certaines de ces
	      applications sont encore en cours de d&eacute;veloppement et
	      peuvent &ecirc;tre encore instables.</p>

	    <p>Pour installer <tt>gnome2-fifth-toe</tt> &agrave; partir des paquetages :</p>

            <pre>
# pkg_add -r gnome2-fifth-toe
            </pre>

	    <p>Pour installer <tt>gnome2-fifth-toe</tt> &agrave; partir des ports :</p>

	    <pre>
# cd /usr/ports/x11/gnome2-fifth-toe
# make clean
# make install clean
	    </pre>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q4 -->
        <tr>
	  <td width="10">
	    <b><a name="q4"> 4.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Quel est le meilleur moyen de mettre &agrave; jour GNOME 1.4 vers GNOME 2 ?
	    </b>
	  </td>
        </tr>
<!-- A4 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>A l'heure actuelle, le projet GNOME est encore tr&egrave;s changeant.
	      Beaucoup de travail reste &agrave; faire sur l'infrastructure des ports GNOME pour
	      faire fonctionner correctement les choses. Cependant, si vous avez
	      GNOME 1.4 et que vous voulez le mettre &agrave; jour avec GNOME 2.2, familiarisez-vous
	      tout d'abord avec les <a href="http://www.gnome.org/start/2.0/installation.html#upgrading">official</a> instructions de mise &agrave; jour du
	      site GNOME. Puis, assurez-vous que vos ports GNOME 1.4 sont
	      bien &agrave; jour et supprimez les paquetages GNOME 1.4 suivants du
	      syst&egrave;me :</p>

	    <pre>
gnomecore
sawfish
gnomeapplets
gnomemedia
gtop
libgtop
nautilus
gedit
xalf
bugbuddy
gnomegames
gnomeutils
gdm
eog
ggv
	   </pre>

	   <p>Une fois que ces paquetages ont &eacute;t&eacute; supprim&eacute;s, vous pouvez installer GNOME 2.2 en suivant les
	     instructions donn&eacute;es ci-dessus.</p>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q5 -->
        <tr>
	  <td width="10">
	    <b><a name="q5"> 5.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Comment garder &agrave; jour les applications et
	      les composants de GNOME 2.2 ?</b>
	  </td>
        </tr>
<!-- A5 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>J'ai trouv&eacute; que <tt>/usr/ports/sysutils/portupgrade</tt> fonctionne tr&egrave;s
	      bien. Par exemple :</p>

	    <tt># portupgrade -r pkgconfig</tt>

	    <p>Cela mettra &agrave; jour pkgconfig et tous les autres ports qui en d&eacute;pendent
	      (ceux qui ont besoin d'&ecirc;tre mis &agrave; jour).</p>

	    <p>Toutefois, il y a parfois tellement de changements qu'il devient
	      n&eacute;cessaire de d'abord faire un peu de m&eacute;nage. Dans ce cas, cela
	      fonctionne la plupart du temps :</p>

	    <pre>
# pkg_delete -rf pkgconfig\*
# cd /usr/ports/x11/gnome2
# make clean
# make install clean
	    </pre>

	    <p>Ces commandes supprimeront <b>tous</b> les composants et applications
	      de GNOME 1 et 2 de votre machine mais r&eacute;installeront uniquement le
	      bureau GNOME 2. Vous devez cependant savoir que, si vous suivez
	      cette m&eacute;thode, vous devrez r&eacute;installer vos applications apr&egrave;s la
	      r&eacute;installation du bureau. Heureusement, cette m&eacute;thode "extr&ecirc;me"
	      est rarement n&eacute;cessaire.
	    </p>
	  </td>
        </tr>

        <tr><td><br></td></tr>

<!-- Q6 -->
        <tr>
	  <td width="10">
	    <b><a name="q6"> 6.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Puis-je installer des applications GNOME 1.4 sous GNOME 2.2 et
	      vice-versa ?</b>
	  </td>
        </tr>
<!-- A6 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Bien s&ucirc;r ! Actuellement, l'&eacute;quipe de GNOME pour FreeBSD travaille sur la
	      migration de tous les ports GNOME 1.4 vers la nouvelle infrastructure de compilation.
	      Cette nouvelle infrastructure, appel&eacute;e <b>GNOMENG</b>, permettra
	      aux utilisateurs de GNOME 2 d'installer les ports GNOME 1.4 sans &eacute;craser
	      leur bureau GNOME 2.</p>

	    <p>Avant d'installer un port GNOME 1.4 sous GNOME 2, consultez le fichier
	      Makefile du port et v&eacute;rifiez qu'il contient :</p>

	    <pre>
USE_GNOMENG=	yes
	    </pre>

	    <p>Si c'est bien le cas, vous pouvez sans probl&egrave;me installer ce port sous GNOME 2.
	      Si le Makefile contient la ligne suivante, ne l'installez pas
	      car il &eacute;craserait votre bureau GNOME 2 :</p>

	    <pre>
USE_GNOME=	yes
	    </pre>

	    <p>Dans ce cas, envoyez un courrier &eacute;lectronique &agrave;
	      <a href="mailto:&email;@FreeBSD.org">&email;@FreeBSD.org</a>
	      en mentionnant le nom du port et nous le convertirons pour qu'il utilise
	      la nouvelle infrastructure. Vous pouvez aussi convertir vous-m&ecirc;me le port
	      et soumettre un PR.</p>

	    <p><b>NOTE !</b> Vous <b>devez</b> avoir un r&eacute;pertoire
	      <tt>/usr/ports/Mk</tt> &agrave; jour pour pouvoir utiliser
	      le nouveau GNOMENG. Si vous n'avez pas un r&eacute;pertoire
	      Mk &agrave; jour, vous &eacute;craserez votre bureau GNOME 2
	      m&ecirc;me si USE_GNOMENG est d&eacute;fini. Pour mettre &agrave; jour votre r&eacute;pertoire Mk,
	      assurez-vous que votre fichier de configuration cvsup pour les ports permet de r&eacute;cup&eacute;rer le
	      tag <b>ports-base</b>. C'est automatique si votre
	      fichier contient le tag <b>ports-all</b>.
	    </p>

	    <p>Pour faire fonctionner les applications GNOME 2.2 sous GNOME 1.4, vous devez
	      vous assurez que vos composants GNOME 1.4 sont &agrave; jour puis
	      installer le port <tt>gnome2-devel</tt>. Pour installer ce port,
	      suivez la proc&eacute;dure suivante :</p>

	    <pre>
# cd /usr/ports/devel/gnome2-devel
# make clean
# make install
	    </pre>

	    <p>Apr&egrave;s l'installtion du port <tt>gnome2-devel</tt>, vous pourrez
	      installer les applications GNOME 2.2 <b>ind&eacute;pendantes du bureau</b>
	      (par exemple <tt>math/gcalctool</tt>).</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q7 -->
        <tr>
	  <td width="10">
	    <b><a name="q7"> 7.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>O&ugrave; puis-je trouver plus de th&egrave;mes pour GNOME 2.2 ?</b>
	  </td>
        </tr>
<!-- A7 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Le site web <a href="http://art.gnome.org">
	      art.gnome.org</a> propose plusieurs th&egrave;mes GNOME.
	      Cela inclue des th&egrave;mes gtk+-2.0, metacity, sawfish,
	      nautilus, icon et gdm ainsi que quelques fonds d'&eacute;crans.</p>

	    <p>Un nouveau site de th&egrave;mes appel&eacute; <a href="http://www.themedepot.org">
	      The Theme Depot</a> vient d'ouvrir. Ce site contient
	      des th&egrave;mes pour GNOME 2 ainsi que pour KDE et quelques gestionnaires
	      de fen&ecirc;tres.
	    </p>

	    <p>Un bon site pour trouver plusieurs ic&ocirc;nes GNOME (certains classiques, d'autres nouveaux)
	      est le site <a href="http://jimmac.musichall.cz/ikony.php3">
	      Icons</a> de jimmac.</p>

	    <p>Consultez les instructions pr&eacute;sentes sur les sites web pour savoir comment installer ces th&egrave;mes.
	      Si vous avez envie de cr&eacute;er un port pour certains d'entre eux, vous &ecirc;tes &eacute;galement plus
	      que bienvenu ;-).</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q8 -->
        <tr>
	  <td width="10">
	    <b><a name="q8"> 8.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Quels gestionnaires de fen&ecirc;tre fonctionnent correctement avec GNOME 2.2 ?</b>
	  </td>
        </tr>
<!-- A8 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3">
	    <p>Le m&eacute;ta-port <tt>gnome2</tt> installe les gestionnaires de
	      fen&ecirc;tres metacity par d&eacute;faut. Un autre gestionnaire de fen&ecirc;tres tr&egrave;s
         populaire et qui fonctionne tr&egrave;s bien avec GNOME 2.2 est
	      <a href="http://sawmill.sourceforge.net/">sawfish</a>. Sawfish
	      est inclus dans le m&eacute;ta-port <tt>x11/gnome2-fifth-toe</tt>.

	    <p>Pour passer de metacity &agrave; sawfish et inversement avec GNOME 2, vous devez
	      utiliser les commandes suivantes :</p>

<pre>
killall metacity; sawfish &
gnome-session-save --gui
</pre>
	    <p>Le <tt>gnome-session-save</tt> est important. Sans cette commande, le
	      gestionnaire de fen&ecirc;tres retournera &agrave; celui configur&eacute; pr&eacute;c&eacute;demment
	      lors de la prochaine connexion. Pour faire le passage inverse, inversez simplement sawfish et
	      metacity.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q9 -->
        <tr>
	  <td width="10">
	    <b><a name="q9"> 9.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Est-ce que GNOME 2.2 supporte l'anti-aliasing pour les fontes ?</b>
	  </td>
        </tr>
<!-- A9 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
		<p>Oui ! L'anti-aliasing n&eacute;cessite XFree86 4.x avec
		  le support freetype2. Pour ajouter le support freetype2 &agrave; X, assurez-vous
		  de charger les modules suivants dans votre
		  fichier de configuration XF86Config (section Modules) :</p>

		<pre>
Load	"freetype"
Load	"type1"
		</pre>

		<p>Puis, utilisez tout simplement l'applet de configuration "Fontes" dans
		  Applications->Pr&eacute;f&eacute;rences Bureau. Si vous voulez un bon ensemble de
		  fontes TrueType pour commencer, installez le port
		  <tt>x11-fonts/webfonts</tt>.</p>

		<p>Il arrive parfois qu'apr&egrave;s avoir ajouter de nouvelles fontes au syst&egrave;me, il soit
		  n&eacute;cessaire de les indiquer explicitement &agrave; fontconfig. Si vous constatez que
		  les nouvelles fontes ne sont pas disponibles m&ecirc;me apr&egrave;s avoir
		  red&eacute;marr&eacute; GNOME 2, utilisez la commande suivante en tant que root.</p>

		<pre>
# fc-cache -f -v
		</pre>

		<p>Si vous avez des questions, vous pouvez les envoyer &agrave;
		  <a href="mailto:&email;@FreeBSD.org">&email;@FreeBSD.org</a>.
		</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q10 -->
        <tr>
	  <td width="10">
	    <b><a name="q10"> 10.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Comment contr&ocirc;ler quelles fontes utilisent l'anti-aliasing ?</b>
	  </td>
        </tr>
<!-- A10 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
		<p>GNOME 2.2 utilise Xft2 et fontconfig pour g&eacute;rer
		  l'anti-aliasing. Fontconfig est un tr&egrave;s puissant gestionnaire de configuration de fontes
        bas&eacute; sur XML-based. Vous pouvez cr&eacute;er un fichier
		  <tt>~/.fonts.conf</tt> qui contr&ocirc;le virtuellement
		  chaque aspect de fontconfig. Par exemple, si vous ne voulez
		  pas l'anti-aliasing pour les fontes inf&eacute;rieures &agrave; 16 points, cr&eacute;ez le fichier
		  a <tt>~/.fonts.conf</tt> avec le contenu suivant :</p>

		<pre>
&lt;?xml version="1.0"?&gt;
&lt;!DOCTYPE fontconfig SYSTEM "fonts.dtd"&gt;
&lt;fontconfig&gt;

&lt;match target="font"&gt;
        &lt;test name="size" compare="less_eq"&gt;
                &lt;double&gt;16&lt;/double&gt;
        &lt;/test&gt;
        &lt;edit name="antialias" mode="assign"&gt;
                &lt;bool&gt;false&lt;/bool&gt;
        &lt;/edit&gt;
&lt;/match&gt;
&lt;/fontconfig&gt;
                </pre>

                <p>Consultez fontconfig(3) pour plus d'informations.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q11 -->
        <tr>
	  <td width="10">
	    <b><a name="q11"> 11.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Comment &eacute;diter mes menus GNOME 2 ?</b>
	  </td>
        </tr>
<!-- A11 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
	    <p>Vous devez utiliser Nautilus pour &eacute;diter vos menus GNOME 2. Si vous
	      voulez &eacute;diter n'importe quel autre menu que "Favoris", vous devez &ecirc;tre
	      root. Cette fonction n&eacute;cessite GNOME 2.0.2 ou plus.</p>

	    <p>Pour &eacute;diter les menus, lancez Nautilus et entrez l'URL
	      <b>applications:///</b>. A partir de l&agrave;, vous devriez pouvoir &eacute;diter
	      tout le menu.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q12 -->
        <tr>
	  <td width="10">
	    <b><a name="q12"> 12.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Comment utiliser les param&egrave;tres de ressource GTK+ 2 pour
	      les applications GTK+ 2 sans &ecirc;tre dans l'environnement GNOME ?</b>
	  </td>
        </tr>
<!-- A12 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
	    <p>Les applications GNOME 2 obtiennent leurs ressources GTK+ 2 &agrave; partir des th&egrave;mes et
	      du moteur de th&egrave;me correspondant. Si vous souhaitez plut&ocirc;t utiliser vos
	      applications GTK+ 2 dans un environnement non-GNOME, vous devez alors
	      cr&eacute;er un fichier <tt>~/.gtkrc-2.0</tt>. Pour la plus grande
         part, vous pouvez transf&eacute;rer vos param&egrave;tres &agrave; partir de votre fichier
	      <tt>~/.gtkrc</tt> (utilis&eacute; pour GTK+ 1.2) avec seulement quelques
         difficult&eacute;s mineures.</p>

	      <ol>
	        <li>Si vous avez des r&eacute;f&eacute;rences &agrave; un moteur de th&egrave;me, vous devrez vous
		  assurer qu'il existe un moteur de th&egrave;me GTK+ 2 correspondant.
		  Sinon, supprimez les entr&eacute;es concernant ce moteur.</li>
		<li>L'indication de la fonte par d&eacute;faut doit se situ&eacute;e en dehors des
		  bloques <tt>style</tt> et doit &ecirc;tre sp&eacute;cifi&eacute;e avec le
		  mot clef <tt>gtk-font-name</tt>. Par exemple :

		  <pre>gtk-font-name = "Verdana 11"</pre>
		</li>
              </ol>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q13 -->
        <tr>
	  <td width="10">
	    <b><a name="q13"> 13.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>Comment configurer les param&egrave;tres des applications
         GNOME 1.4 sous GNOME 2.2 ?</b>
	  </td>
        </tr>
<!-- A13 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3">
	    <p>Installez <tt>sysutils/gnomecontrolcenter</tt>, puis lancez
	      <tt>gnomecc</tt> &agrave; partir de la ligne de commande pour d&eacute;marrer le
	      centre de contr&ocirc;le de GNOME 1.4. A noter que, depuis Evolution-1.2.0_3 et
	      gnomepilot-0.1.69_1, <tt>gnomecontrolcenter</tt> est automatiquement
         install&eacute; car il est n&eacute;cessaire pour la configuration des communications
         avec Palm Pilot.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
        </table>
      </td>
    </tr>
  </table>
  &footer;
</body>
</html>

