Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/leap-seconds/_index.po
Languages: es, ko, ru

source: A short description of how leap seconds are handled on FreeBSD
es: Una breve descripción sobre cómo se maneja el segundo bisiesto en FreeBSD
ko: 윤초(leap second)를 FreeBSD에서 조절하는 방법에 대한 간단한 설명
ru: Краткое описание обработки високосных секунд (секунд координации) в FreeBSD

source: FreeBSD Support for Leap Seconds
es: Soporte Para Segundos Bisiestos en FreeBSD
ko: 윤초에 대한 FreeBSD의 지원
ru: Поддержка високосных секунд в FreeBSD

source: Introduction
es: Introducción
ko: 소개
ru: Введение

source: A _leap second_ is an one second adjustment made at specific times of year to UTC to synchronize atomic time scales with variations in the rotation of the Earth. This article describes how FreeBSD interacts with leap seconds.
es: Un _segundo bisiesto_ (también llamado segundo intercalar o segundo adicional) es un ajuste de un segundo realizado a UTC en momentos específicos del año para sincronizar escalas de tiempo atómicas con variaciones en la rotación de la Tierra. Este artículo describe cómo interactúa FreeBSD con segundos bisiestos.
ko: 윤초는 실제 지구의 공전(1년)과 원자시계에 의해 동기화된 UTC간에 발생하는 특징적인 초 단위 오차입니다. 이 문서는 윤초에 대해 FreeBSD가 어떻게 대응하는지에 대해 설명하고 있습니다.
ru: _Секунда координации_ (високосная секунда) — это односекундная корректировка, вносимая в определённые моменты года в UTC для синхронизации атомных шкал времени с вариациями вращения Земли. В этой статье описано, как FreeBSD взаимодействует с секундами координации.

source: As of this writing, the next leap second will occur at 2015-Jun-30 23:59:60 UTC. This leap second will occur during a business day for North and South America and the Asia/Pacific region.
es: En el momento de escribir estas líneas, el próximo segundo bisiesto ocurrirá el 30 de junio del 2015 a las 23:59:60 UTC. Este segundo bisiesto ocurrirá durante un dí­a laboral para América del Norte y del Sur y la región Asia/Pací­fico.
ko: 기록에 따르면, 다음 윤초는 2015년 1월 30일 23:59:60 UTC에 있을 예정입니다. 이 윤초는 전체 아메리카 대륙과 아시아 태평양 지역의 업무일 중에 발생할 것입니다.
ru: На момент написания следующая високосная секунда будет добавлена 2015-Jun-30 23:59:60 UTC. Эта високосная секунда выпадет на рабочий день для Северной и Южной Америки, а также для региона Азии/Тихоокеанского региона.

source: Leap seconds are announced by https://www.iers.org/IERS/EN/Home/home_node.html[IERS] on https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Bulletin C].
es: Los segundos bisiestos son anunciados por https://www.iers.org/IERS/EN/Home/home_node.html[IERS] en https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Bulletin C].
ko: 윤초는 https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Bulletin C]의 https://www.iers.org/IERS/EN/Home/home_node.html[IERS]에서 발표하고 있습니다.
ru: Секунды координации объявляются https://www.iers.org/IERS/EN/Home/home_node.html[IERS] в https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Бюллетене C].

source: Standard leap second behavior is described in https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]. Also see man:time2posix[3].
es: El comportamiento estándar del segundo bisiesto se describe en https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]. Lee también man:time2posix[3].
ko: 표준적인 윤초에 대한 처리는 https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]에서 설명하고 있습니다. man:time2posix[3]를 확인해주세요.
ru: Стандартное поведение високосной секунды описано в https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]. Также см. man:time2posix[3].

source: Default Leap Second Handling on FreeBSD
es: Manejo por Defecto de los Segundos Bisiestos en FreeBSD
ko: FreeBSD에서 윤초의 디폴트 관리
ru: Обработка високосных секунд по умолчанию в FreeBSD

source: The easiest way to handle leap seconds is with the POSIX time rules FreeBSD uses by default, combined with extref:{handbook}[NTP, network-ntp]. When man:ntpd[8] is running and the time is synchronized with upstream NTP servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
es: La forma más fácil de manejar los segundos bisiestos es con las reglas de tiempo POSIX que FreeBSD usa por defecto, combinadas con extref:{handbook}[NTP, network-ntp]. Cuando man:ntpd[8] se está ejecutando y la hora se sincroniza con los servidores NTP que gestionan los segundos bisiestos correctamente, el segundo bisiesto hará que el tiempo del sistema repita automáticamente el último segundo del día. No se necesita ningún otro ajuste adicional.
ko: 윤초를 처리하는 가장 쉬운 방법은 extref:{handbook}[NTP, network-ntp]와 FreeBSD에서 디폴트로 사용하는 POSIX time rules FreeBSD을 병합하는 것입니다. man:ntpd[8]가 동작하고 있고 윤초를 수정하고 있는 업스트림 NTP 서버와 동기화 되어 있다면 시스템은 자동으로 하루의 마지막 날에 1초를 추가할 것입니다. 추가적으로 어떤 수정도 필요하지 않습니다.

source: If the upstream NTP servers do not handle leap seconds correctly, man:ntpd[8] will step the time by one second after the errant upstream server has noticed and stepped itself.
es: Si los servidores de NTP no gestionan los segundos bisiestos correctamente, man:ntpd[8] avanzará la hora en un segundo después de que el servidor errante se haya dado cuenta y lo haya avanzado él mismo.
ko: 만약 업스트림 NTP서버가 윤초를 제대로 처리하지 못한다면 man:ntpd[8]는 오류가 발생한 업스트림 서버가 인식하고 자체 단계를 밟는 것을 따라 시간을 1초씩 단축합니다.
ru: Если вышестоящие серверы NTP не обрабатывают високосные секунды корректно, man:ntpd[8] изменит время на одну секунду после того, как ошибочный вышестоящий сервер заметит это и изменит своё время.

source: If NTP is not being used, manual adjustment of the system clock will be required after the leap second has passed.
es: Si no se usa NTP, se necesitará un ajuste manual del reloj del sistema después de que haya pasado el segundo bisiesto.
ko: NTP를 사용하지 않는 경우 윤초가 경과한 후 시스템 시계를 수동으로 조정해야 합니다.
ru: Если NTP не используется, после високосной секунды потребуется ручная корректировка системных часов.

source: Cautions
es: Precauciones
ko: 주의
ru: Предупреждения

source: Leap seconds are inserted at the same instant all over the world: UTC midnight. In Japan that is mid-morning, in the Pacific mid-day, in the Americas late afternoon, and in Europe at night.
es: Los segundos bisiestos se insertan en todo el mundo en el mismo instante: La medianoche UTC. En Japón es media mañana, en el Pacífico mitad del día, en el continente americano pasado el mediodía, y en Europa por la noche.
ko: 윤초는 전 세계적으로 UTC 자정에 동시에 삽입됩니다. 시기로는 일본은 아침, 태평양은 낮, 아메리카는 오후 늦게, 유럽은 밤에 추가됩니다.
ru: Високосные секунды добавляются одновременно по всему миру: в полночь по UTC. В Японии это середина утра, в Тихоокеанском регионе — середина дня, в Америке — поздний вечер, а в Европе — ночь.

source: We believe and expect that FreeBSD, if provided correct and stable NTP service, will work as designed during this leap second, as it did during the previous ones.
es: Creemos y esperamos que FreeBSD, si se le proporciona un servicio de NTP correcto y estable, funcionará como se ha diseñado durante este segundo bisiesto, del mismo modo que hizo con los anteriores.
ko: 우리는 NTP 서비스가 정확하고 안정적으로 유지되고 있다면 이전 윤초가 있었던 시기와 마찬가지로 FreeBSD 역시 윤초 동안 설계된 대로 작동할 것이라고 믿고 있습니다.
ru: Мы полагаем и ожидаем, что FreeBSD, при условии предоставления корректного и стабильного сервиса NTP, будет работать как задумано во время этой секунды координации, как это происходило во время предыдущих.

source: However, we caution that practically no applications have ever asked the kernel about leap seconds. Our experience is that, as designed, leap seconds are essentially a replay of the second before the leap second, and this is a surprise to most application programmers.
es: De todas formas, asumimos que prácticamente ninguna aplicación ha requerido información del kernel acerca del segundo bisiesto. Nuestra experiencia es que, tal como está diseñado, el segundo bisiesto es esencialmente una repetición del segundo antes del segundo bisiesto, y esto es una sorpresa para la mayoría de los programadores.
ko: 그러나 현실적으로는 어떤 응용프로그램도 커널에 윤초에 대해 요청한 적이 없다는 것을 주의해야 합니다. 우리의 경험에 따르면, 윤초는 본질적으로 윤초 전의 초를 한번 더 재생하는 것이며, 이것은 대부분 응용프로그램 개발자들에게 놀라운 일입니다.
ru: Однако мы предупреждаем, что практически ни одно приложение никогда не запрашивало у ядра информацию о високосных секундах. Наш опыт показывает, что, как и задумано, високосные секунды по сути являются повторением секунды, предшествующей високосной, и это становится неожиданностью для большинства программистов.

source: Other operating systems and other computers may or may not handle the leap-second the same way as FreeBSD, and systems without correct and stable NTP service will not know anything about leap seconds at all.
es: Otros sistemas operativos y otras máquinas podrían o no manejar el segundo bisiesto del mismo modo en que lo hace FreeBSD y sistemas sin un servicio correcto y estable de NTP no sabrán nada en absoluto acerca de segundos bisiestos.
ko: 다른 운영 체제와 컴퓨터는 FreeBSD와 동일한 방식으로 윤초를 처리할 수도 있고 그렇지 않을 수도 있으며, 정확하고 안정적인 NTP 서비스가 없는 시스템은 윤초에 대해 전혀 모를 것입니다.
ru: Другие операционные системы и компьютеры могут обрабатывать високосную секунду иначе, чем FreeBSD, а системы без корректной и стабильной службы NTP вообще не будут знать о високосных секундах.

source: It is not unheard of for computers to crash because of leap seconds, and experience has shown that a large fraction of all public NTP servers might handle and announce the leap second incorrectly.
es: No es extraño que las máquinas fallen a causa del segundo bisiesto, y la experiencia ha demostrado que una gran parte de los servidores públicos de NTP pueden manejar y anunciar incorrectamente el segundo bisiesto.
ko: 윤초 때문에 컴퓨터가 충돌하는 것은 전례가 없는 일이 아니며, 경험에 따르면 모든 공용 NTP 서버 중 상당수가 윤초를 잘못 처리하고 전달할 수 있습니다.
ru: Нередко компьютеры выходят из строя из-за високосных секунд, и опыт показал, что значительная часть всех публичных NTP-серверов может обрабатывать и объявлять високосную секунду неправильно.

source: Please try to make sure nothing horrible happens because of the leap second.
es: Por favor, intenta asegurarte de que nada horrible suceda debido al segundo bisiesto.
ko: 윤초 때문에 끔찍한 일이 일어나지 않도록 주의해주세요.
ru: Пожалуйста, постарайтесь убедиться, что из-за секунды координации не произойдет ничего ужасного.

source: Testing
es: Pruebas
ko: 테스트
ru: Тестирование

source: It is possible to test whether a leap second will be used. Due to the nature of NTP, the test might work up to 24 hours before the leap second. Some major reference clock sources only announce leap seconds one hour ahead of the event. Query the NTP daemon:
es: Es posible probar si un segundo bisiesto será usado. Debido a la naturaleza de NTP, la prueba puede funcionar hasta 24 horas antes del segundo bisiesto. Algunas fuentes importantes de referencia de tiempo solo anuncian el segundo bisiesto una hora antes del acontecimiento. Realiza una consulta al demonio de NTP:
ko: 윤초가 사용되는지에 대한 여부는 테스트를 통해 알 수 있습니다. 이 테스트는 NTP의 특성으로 인해 윤초의 발생까지 24시간이 걸릴 수 있습니다. 몇몇 주요 기준시계의 소스는 윤초 발생 1시간 전에만 윤초를 알립니다. NTP 데몬에 다음을 질의해보세요:
ru: Возможно проверить, будет ли использована секунда координации. Из-за особенностей NTP, проверка может работать до 24 часов до введения секунды координации. Некоторые крупные источники эталонных часов объявляют о секундах координации всего за час до события. Запрос к демону NTP:

source: Output that includes `leap_add_sec` indicates proper support of the leap second. Before the 24 hours leading up to the leap second, or after the leap second has passed, `leap_none` will be shown.
es: Una salida que incluya `leap_add_sec` indica soporte adecuado para el segundo bisiesto. Cuando falten más de 24 horas para el segundo bisiesto, o cuando este haya pasado, se mostrará `leap_none`.
ko: `leap_add_sec`를 포함하는 출력은 윤초를 적절하게 지원하고 있다는 것을 나타냅니다. 윤초까지 24시간 전이거나 윤초가 지났다면 `leap_none`가 표시됩니다.
ru: Вывод, включающий `leap_add_sec`, указывает на корректную поддержку секунды координации. До 24 часов перед наступлением секунды координации или после её прохождения будет отображаться `leap_none`.

source: Conclusion
es: Conclusión
ko: 결론
ru: Заключение

source: In practice, leap seconds are usually not a problem on FreeBSD. We hope that this overview helps clarify what to expect and how to make the leap second event proceed more smoothly.
es: En la práctica, los segundos bisiestos no suelen ser un problema en FreeBSD. Esperamos que esta breve reseña ayude a clarificar qué esperar y cómo hacer que el segundo bisiesto pase sin contratiempos.
ko: 일반적으로 FreeBSD에서는 윤초가 문제가 되지는 않습니다. 우리는 이 개요가 윤초 발생시 어떤 일이 있을지 예상하고 어떻게 해야 보다 부드럽게 처리할 수 있는지에 대해 도움이 되기를 바랍니다.
ru: На практике секунды координации обычно не представляют проблемы в FreeBSD. Мы надеемся, что этот обзор поможет прояснить, чего ожидать и как сделать обработку секунды координации более гладкой.

source: The easiest way to handle leap seconds is with the POSIX time rules FreeBSD uses by default, combined with extref:{handbook}network-servers[NTP, network-ntp]. When man:ntpd[8] is running and the time is synchronized with upstream NTP servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
ru: Самый простой способ обработки високосных секунд — использование правил времени POSIX, которые FreeBSD использует по умолчанию, в сочетании с extref:{handbook}network-servers[NTP, network-ntp]. Когда man:ntpd[8] работает и время синхронизировано с вышестоящими серверами NTP, которые корректно обрабатывают високосные секунды, високосная секунда приведёт к автоматическому повтору последней секунды дня в системном времени. Другие корректировки не требуются.
