Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/preface/_index.po
Languages: ru

source: _crossref:bsdinstall[bsdinstall,Installing FreeBSD]_
ru: _crossref:bsdinstall[bsdinstall,Установка FreeBSD]_

source: Walks a user through the entire installation process of FreeBSD 9._x_ and later using bsdinstall.
ru: Проводит пользователя через весь процесс установки FreeBSD 9._x_ и более поздних версий с использованием bsdinstall.

source: _crossref:basics[basics,FreeBSD Basics]_
ru: _crossref:basics[basics,Основы FreeBSD]_

source: Covers the basic commands and functionality of the FreeBSD operating system. If you are familiar with Linux(R) or another flavor of UNIX(R) then you can probably skip this chapter.
ru: Охватывает основные команды и функциональность операционной системы FreeBSD. Если вы знакомы с Linux(R) или другой разновидностью UNIX(R), то, вероятно, можете пропустить эту главу.

source: _crossref:ports[ports,Installing Applications: Packages and Ports]_
ru: _crossref:ports[ports,Установка приложений: Пакеты и порты]_

source: Covers the installation of third-party software with both FreeBSD's innovative "Ports Collection" and standard binary packages.
ru: Охватывает установку стороннего программного обеспечения с использованием инновационной "Коллекции портов" FreeBSD и стандартных бинарных пакетов.

source: _crossref:x11[x11,The X Window System]_
ru: _crossref:x11[x11,Система X Window]_

source: Describes the X Window System in general and using X11 on FreeBSD in particular. Also describes common desktop environments such as KDE and GNOME.
ru: Описывает X Window System в общем и использование X11 в FreeBSD в частности. Также рассматриваются популярные окружения рабочего стола, такие как KDE и GNOME.

source: Describes the Wayland display server in general and using Wayland on FreeBSD in particular. Also describes common compositors such as Wayfire, Hikari and Sway.
ru: Описывает Wayland, сервер отображения в целом, и использование Wayland в FreeBSD в частности. Также рассматриваются популярные композиторы, такие как Wayfire, Hikari и Sway.

source: _crossref:desktop[desktop,Desktop Applications]_
ru: _crossref:desktop[desktop,Приложения для рабочего стола]_

source: Lists some common desktop applications, such as web browsers and productivity suites, and describes how to install them on FreeBSD.
ru: Перечисляет некоторые распространённые настольные приложения, такие как веб-браузеры и офисные пакеты, и описывает, как их установить в FreeBSD.

source: _crossref:multimedia[multimedia,Multimedia]_
ru: _crossref:multimedia[multimedia,Мультимедиа]_

source: Shows how to set up sound and video playback support for your system. Also describes some sample audio and video applications.
ru: Показывает, как настроить поддержку воспроизведения звука и видео в системе. Также описываются некоторые примеры аудио- и видеоприложений.

source: _crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]_
ru: _crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]_

source: Explains why you might need to configure a new kernel and provides detailed instructions for configuring, building, and installing a custom kernel.
ru: Объясняет, зачем может потребоваться настройка нового ядра, и предоставляет подробные инструкции по настройке, сборке и установке кастомного ядра.

source: _crossref:printing[printing,Printing]_
ru: _crossref:printing[printing,Печать]_

source: Describes managing printers on FreeBSD, including information about banner pages, printer accounting, and initial setup.
ru: Описывает управление принтерами в FreeBSD, включая информацию о титульных страницах, учёте печати и первоначальной настройке.

source: _crossref:linuxemu[linuxemu,Linux® Binary Compatibility]_
ru: _crossref:linuxemu[linuxemu,Совместимость с бинарными файлами Linux®]_

source: Describes the Linux(R) compatibility features of FreeBSD. Also provides detailed installation instructions for many popular Linux(R) applications such as Oracle(R) and Mathematica(R).
ru: Описывает возможности совместимости FreeBSD с Linux(R). Также содержит подробные инструкции по установке многих популярных приложений Linux(R), таких как Oracle(R) и Mathematica(R).

source: Describes WINE and provides detailed installation instructions. Also describes how WINE operates, how to install a GUI helper, how to run Windows(R) applications on FreeBSD, and offers other tips and solutions.
ru: Описывает WINE и предоставляет подробные инструкции по установке. Также описывает, как работает WINE, как установить графический помощник, как запускать приложения Windows(R) на FreeBSD, а также предлагает другие советы и решения.

source: _crossref:config[config-tuning,Configuration and Tuning]_
ru: _crossref:config[config-tuning,Настройка и Тонкая Настройка]_

source: Describes the parameters available for system administrators to tune a FreeBSD system for optimum performance. Also describes the various configuration files used in FreeBSD and where to find them.
ru: Описывает параметры, доступные системным администраторам для настройки системы FreeBSD с целью достижения оптимальной производительности. Также описываются различные конфигурационные файлы, используемые в FreeBSD, и их расположение.

source: _crossref:boot[boot,The FreeBSD Booting Process]_
ru: _crossref:boot[boot,Процесс загрузки FreeBSD]_

source: Describes the FreeBSD boot process and explains how to control this process with configuration options.
ru: Описывает процесс загрузки FreeBSD и объясняет, как управлять этим процессом с помощью параметров конфигурации.

source: _crossref:security[security,Security]_
ru: _crossref:security[security,Безопасность]_

source: Describes many different tools available to help keep your FreeBSD system secure, including Kerberos, IPsec and OpenSSH.
ru: Описывает множество различных инструментов, доступных для обеспечения безопасности системы FreeBSD, включая Kerberos, IPsec и OpenSSH.

source: _crossref:jails[jails,Jails]_
ru: _crossref:jails[jails,Клетки]_

source: Describes the jails framework, and the improvements of jails over the traditional chroot support of FreeBSD.
ru: Описывает фреймворк клеток и улучшения по сравнению с традиционной поддержкой chroot в FreeBSD.

source: _crossref:mac[mac,Mandatory Access Control]_
ru: _crossref:mac[mac,Принудительный контроль доступа]_

source: Explains what Mandatory Access Control (MAC) is and how this mechanism can be used to secure a FreeBSD system.
ru: Объясняет, что такое Принудительный Контроль Доступа (Mandatory Access Control, MAC) и как этот механизм может быть использован для защиты системы FreeBSD.

source: _crossref:audit[audit,Security Event Auditing]_
ru: _crossref:audit[audit,Аудит событий безопасности]_

source: Describes what FreeBSD Event Auditing is, how it can be installed, configured, and how audit trails can be inspected or monitored.
ru: Описывает, что такое аудит событий в FreeBSD, как его можно установить, настроить, а также как проверять или отслеживать журналы аудита.

source: _crossref:disks[disks,Storage]_
ru: _crossref:disks[disks,Устройства хранения]_

source: Describes how to manage storage media and filesystems with FreeBSD. This includes physical disks, RAID arrays, optical and tape media, memory-backed disks, and network filesystems.
ru: Описывает, как управлять носителями данных и файловыми системами в FreeBSD. Это включает физические диски, RAID-массивы, оптические и ленточные носители, диски в памяти и сетевые файловые системы.

source: _crossref:geom[geom,GEOM: Modular Disk Transformation Framework]_
ru: _crossref:geom[geom,GEOM: Модульная инфраструктура преобразования дисковых запросов]_

source: Describes what the GEOM framework in FreeBSD is and how to configure various supported RAID levels.
ru: Описывает, что такое фреймворк GEOM в FreeBSD и как настроить различные поддерживаемые уровни RAID.

source: _crossref:zfs[zfs,The OpenZFS storage platform]_
ru: _crossref:zfs[zfs,Платформа хранения данных OpenZFS]_

source: Describes the OpenZFS storage platform and provides a quick-start guide and information about advanced topics running OpenZFS under FreeBSD.
ru: Описывает платформу хранения данных OpenZFS и предоставляет краткое руководство по началу работы, а также информацию о продвинутых темах, связанных с использованием OpenZFS в FreeBSD.

source: _crossref:filesystems[filesystems,Other File Systems]_
ru: _crossref:filesystems[filesystems,Другие файловые системы]_

source: Examines support for non-native file systems under FreeBSD like ext2, ext3 and ext4.
ru: Изучает поддержку неродных файловых систем в FreeBSD, таких как ext2, ext3 и ext4.

source: _crossref:virtualization[virtualization,Virtualization]_
ru: _crossref:virtualization[virtualization,Виртуализация]_

source: Describes what virtualization systems offer, and how they can be used with FreeBSD.
ru: Описывает, какие системы виртуализации доступны и как их можно использовать с FreeBSD.

source: _crossref:l10n[l10n,Localization - i18n/L10n Usage and Setup]_
ru: _crossref:l10n[l10n, Локализация - использование и настройка i18n/L10n]_

source: Describes how to use FreeBSD in languages other than English. Covers both system and application level localization.
ru: Описывает, как использовать FreeBSD на языках, отличных от английского. Рассматривает локализацию как на уровне системы, так и на уровне приложений.

source: _crossref:cutting-edge[updating-upgrading,Updating and Upgrading FreeBSD]_
ru: _crossref:cutting-edge[updating-upgrading,Обновление и модернизация FreeBSD]_

source: Explains the differences between FreeBSD-STABLE, FreeBSD-CURRENT, and FreeBSD releases. Describes which users would benefit from tracking a development system and outlines that process. Covers the methods users may take to update their system to the latest security release.
ru: Объясняет различия между FreeBSD-STABLE, FreeBSD-CURRENT и выпусками FreeBSD. Описывает, какие пользователи могут извлечь выгоду из отслеживания разработки системы, и излагает этот процесс. Рассматривает методы, которые пользователи могут использовать для обновления своей системы до последнего безопасного выпуска.

source: Describes how to configure and use the DTrace tool from Sun(TM) on FreeBSD. Dynamic tracing can help locate performance issues, by performing real time system analysis.
ru: Описывает, как настроить и использовать инструмент DTrace от Sun(TM) в FreeBSD. Динамическая трассировка помогает выявлять проблемы с производительностью, выполняя анализ системы в реальном времени.

source: _crossref:usb-device-mode[usb-device-mode,USB Device Mode / USB OTG]_
ru: _crossref:usb-device-mode[usb-device-mode,Режим USB-устройства / USB OTG]_

source: Explains the use of USB Device Mode and USB On The Go (USB OTG) on FreeBSD.
ru: Объясняет использование режима USB0-устройства и USB On The Go (USB OTG) в FreeBSD.

source: Describes how to use PPP to connect to remote systems in FreeBSD.
ru: Описывает, как использовать PPP для подключения к удалённым системам в FreeBSD.

source: _crossref:mail[mail,Electronic Mail]_
ru: _crossref:mail[mail,Электронная Почта]_

source: Explains the different components of an email server and dives into simple configuration topics for the most popular mail server software: sendmail.
ru: Объясняет различные компоненты почтового сервера и рассматривает простые вопросы настройки для наиболее популярного почтового сервера: sendmail.

source: _crossref:network-servers[network-servers,Network Servers]_
ru: _crossref:network-servers[network-servers,Сетевые серверы]_

source: Provides detailed instructions and example configuration files to set up your FreeBSD machine as a network filesystem server, domain name server, network information system server, or time synchronization server.
ru: Предоставляет подробные инструкции и примеры конфигурационных файлов для настройки вашей FreeBSD-машины в качестве сервера сетевых файловых систем, сервера доменных имен, сервера сетевой информационной системы или сервера синхронизации времени.

source: _crossref:firewalls[firewalls,Firewalls]_
ru: _crossref:firewalls[firewalls,Межсетевые экраны]_

source: Explains the philosophy behind software-based firewalls and provides detailed information about the configuration of the different firewalls available for FreeBSD.
ru: Объясняет философию программных межсетевых экранов и предоставляет подробную информацию о настройке различных межсетевых экранов, доступных для FreeBSD.

source: _crossref:advanced-networking[advanced-networking,Advanced Networking]_
ru: _crossref:advanced-networking[advanced-networking,Расширенные сетевые технологии]_

source: Describes many networking topics, including sharing an Internet connection with other computers on your LAN, advanced routing topics, wireless networking, Bluetooth(R), ATM, IPv6, and much more.
ru: Описывает множество тем, связанных с сетями, включая совместное использование интернет-подключения с другими компьютерами в локальной сети, расширенные темы маршрутизации, беспроводные сети, Bluetooth(R), ATM, IPv6 и многое другое.

source: _crossref:mirrors[mirrors,Obtaining FreeBSD]_
ru: _crossref:mirrors[mirrors,Получение FreeBSD]_

source: Lists different sources for obtaining FreeBSD media on CDROM or DVD as well as different sites on the Internet that allow you to download and install FreeBSD.
ru: Перечисляет различные источники для получения FreeBSD на CDROM или DVD, а также различные сайты в Интернете, которые позволяют загрузить и установить FreeBSD.

source: _crossref:bibliography[bibliography,Bibliography]_
ru: _crossref: bibliography[bibliography,Библиография]_

source: This book touches on many different subjects that may leave you hungry for a more detailed explanation. The bibliography lists many excellent books that are referenced in the text.
ru: Эта книга затрагивает множество различных тем, которые могут пробудить в вас желание узнать больше. В библиографии приведён список отличных книг, на которые есть ссылки в тексте.

source: _crossref:eresources[eresources,Resources on the Internet]_
ru: _crossref:eresources[eresources,Ресурсы в Интернете]_

source: Describes the many forums available for FreeBSD users to post questions and engage in technical conversations about FreeBSD.
ru: Описывает множество форумов, доступных для пользователей FreeBSD, где можно задавать вопросы и участвовать в технических обсуждениях, связанных с FreeBSD.

source: _crossref:pgpkeys[pgpkeys,OpenPGP Keys]_
ru: _crossref:pgpkeys[pgpkeys,OpenPGP Ключи]_

source: Lists the PGP fingerprints of several FreeBSD Developers.
ru: Перечисляет PGP-отпечатки нескольких разработчиков FreeBSD.

source: Conventions used in this book
ru: Условные обозначения, используемые в этой книге

source: To provide a consistent and easy to read text, several conventions are followed throughout the book.
ru: Для обеспечения единообразия и удобочитаемости текста в книге соблюдаются определённые соглашения.

source: Typographic Conventions
ru: Типографические соглашения

source: _Italic_
ru: _Курсив_

source: An _italic_ font is used for filenames, URLs, emphasized text, and the first usage of technical terms.
ru: _Курсивный_ шрифт используется для имен файлов, URL-адресов, выделенного текста и первого упоминания технических терминов.

source: `Monospace`
ru: `Моноширинный`

source: A `monospaced` font is used for error messages, commands, environment variables, names of ports, hostnames, user names, group names, device names, variables, and code fragments.
ru: Моноширинный шрифт используется для сообщений об ошибках, команд, переменных окружения, названий портов, имён хостов, имён пользователей, имён групп, имён устройств, переменных и фрагментов кода.

source: *Bold*
ru: *Жирный*

source: A *bold* font is used for applications, commands, and keys.
ru: *Жирный* шрифт используется для приложений, команд и клавиш.

source: User Input
ru: Ввод пользователя

source: Keys are shown in *bold* to stand out from other text. Key combinations that are meant to be typed simultaneously are shown with `+` between the keys, such as:
ru: Ключи выделены *жирным шрифтом*, чтобы отличаться от остального текста. Комбинации клавиш, которые нужно нажимать одновременно, обозначаются символом `+` между клавишами, например:

source: Meaning the user should type the kbd:[Ctrl], kbd:[Alt], and kbd:[Del] keys at the same time.
ru: Пользователь должен одновременно нажать клавиши kbd:[Ctrl], kbd:[Alt] и kbd:[Del].

source: Keys that are meant to be typed in sequence will be separated with commas, for example:
ru: Клавиши, которые нужно нажимать последовательно, разделяются запятыми, например:

source: Would mean that the user is expected to type the kbd:[Ctrl] and kbd:[X] keys simultaneously and then to type the kbd:[Ctrl] and kbd:[S] keys simultaneously.
ru: Это означает, что пользователь должен одновременно нажать клавиши kbd:[Ctrl] и kbd:[X], а затем одновременно нажать клавиши kbd:[Ctrl] и kbd:[S].

source: Examples
ru: Примеры

source: Examples starting with [.filename]#C:\># indicate a MS-DOS(R) command. Unless otherwise noted, these commands may be executed from a "Command Prompt" window in a modern Microsoft(R) Windows(R) environment.
ru: Примеры, начинающиеся с [.filename]#C:\>#, обозначают команду MS-DOS(R). Если не указано иное, эти команды могут быть выполнены в окне "Командная строка" в современной среде Microsoft(R) Windows(R).

source: Examples starting with # indicate a command that must be invoked as the superuser in FreeBSD. You can login as `root` to type the command, or login as your normal account and use man:su[1] to gain superuser privileges.
ru: Примеры, начинающиеся с символа `#`, обозначают команды, которые должны выполняться с правами суперпользователя в FreeBSD. Вы можете войти в систему как `root` для выполнения команды или использовать обычную учётную запись и применить man:su[1] для получения прав суперпользователя.

source: Examples starting with % indicate a command that should be invoked from a normal user account. Unless otherwise noted, C-shell syntax is used for setting environment variables and other shell commands.
ru: Примеры, начинающиеся с символа %, обозначают команды, которые должны выполняться от имени обычной учётной записи. Если не указано иное, для установки переменных окружения и других команд оболочки используется синтаксис C-shell.

source: Acknowledgments
ru: Благодарности

source: The book you are holding represents the efforts of many hundreds of people around the world. Whether they sent in fixes for typos, or submitted complete chapters, all the contributions have been useful.
ru: Книга, которую вы держите в руках, — это результат труда многих сотен людей по всему миру. Будь то исправления опечаток или целые главы, все их вклады оказались полезными.

source: Several companies have supported the development of this document by paying authors to work on it full-time, paying for publication, etc. In particular, BSDi (subsequently acquired by http://www.windriver.com[Wind River Systems]) paid members of the FreeBSD Documentation Project to work on improving this book full time leading up to the publication of the first printed edition in March 2000 (ISBN 1-57176-241-8). Wind River Systems then paid several additional authors to make a number of improvements to the print-output infrastructure and to add additional chapters to the text. This work culminated in the publication of the second printed edition in November 2001 (ISBN 1-57176-303-1). In 2003-2004, http://www.freebsdmall.com[FreeBSD Mall, Inc], paid several contributors to improve the Handbook in preparation for the third printed edition. The third printed edition has been split into two volumes. Both volumes have been published as The FreeBSD Handbook 3rd Edition Volume 1: User Guide (ISBN 1-57176-327-9) and The FreeBSD Handbook 3rd Edition Volume 2: Administrators Guide (ISBN 1-57176-328-7).
ru: Несколько компаний поддержали разработку этого документа, оплачивая работу авторов на полную ставку, финансируя публикацию и т.д. В частности, BSDi (позже приобретенная http://www.windriver.com[Wind River Systems]) оплачивала членам FreeBSD Documentation Project работу над улучшением этой книги на полной ставке вплоть до публикации первого печатного издания в марте 2000 года (ISBN 1-57176-241-8). Затем Wind River Systems оплатила работу нескольких дополнительных авторов для внесения ряда улучшений в инфраструктуру печатного вывода и добавления новых глав к тексту. Эта работа завершилась публикацией второго печатного издания в ноябре 2001 года (ISBN 1-57176-303-1). В 2003-2004 годах http://www.freebsdmall.com[FreeBSD Mall, Inc] оплатила работу нескольких участников над улучшением Руководства в рамках подготовки к третьему печатному изданию. Третье печатное издание было разделено на два тома. Оба тома были опубликованы как *The FreeBSD Handbook 3rd Edition Volume 1: User Guide* (ISBN 1-57176-327-9) и *The FreeBSD Handbook 3rd Edition Volume 2: Administrators Guide* (ISBN 1-57176-328-7).
