Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/preface/_index.po
Languages: ru

source: The FreeBSD newcomer will find that the first section of this book guides the user through the FreeBSD installation process and gently introduces the concepts and conventions that underpin UNIX
ru: Новичок в FreeBSD обнаружит, что первая часть этой книги проведёт его через процесс установки FreeBSD и мягко познакомит с концепциями и соглашениями, лежащими в основе UNIX

source: Preface
ru: Предисловие

source: Intended Audience
ru: Целевая аудитория

source: The FreeBSD newcomer will find that the first section of this book guides the user through the FreeBSD installation process and gently introduces the concepts and conventions that underpin UNIX(R). Working through this section requires little more than the desire to explore, and the ability to take on board new concepts as they are introduced.
ru: Новичок в FreeBSD обнаружит, что первая часть этой книги проведёт пользователя через процесс установки FreeBSD и мягко познакомит с концепциями и соглашениями, лежащими в основе UNIX(R). Для работы с этой частью требуется лишь желание исследовать и способность усваивать новые концепции по мере их появления.

source: Once you have traveled this far, the second, far larger, section of the Handbook is a comprehensive reference to all manner of topics of interest to FreeBSD system administrators. Some of these chapters may recommend that you do some prior reading, and this is noted in the synopsis at the beginning of each chapter.
ru: После прохождения этого этапа вторая, значительно более обширная часть Руководства представляет собой всеобъемлющий справочник по различным темам, представляющим интерес для администраторов систем FreeBSD. Некоторые из этих глав могут рекомендовать предварительное ознакомление с другими материалами, что отмечается в кратком обзоре в начале каждой главы.

source: For a list of additional sources of information, please see crossref:bibliography[bibliography,Bibliography].
ru: Для получения дополнительных источников информации см. crossref:bibliography[bibliography,Библиография].

source: Fourth Edition
ru: Четвертое издание

source: The current version of the Handbook represents the cumulative effort of a working group that has been reviewing and updating all Handbook content. These are the major updates since the fourth edition of the Handbook.
ru: Текущая версия Руководства представляет собой совокупный результат рабочей группы, которая занимается проверкой и обновлением всего содержимого Руководства. Ниже приведены основные изменения по сравнению с четвёртым изданием Руководства.

source: The Handbook has been converted from link:https://docbook.org/[Docbook] to link:https://gohugo.io/[Hugo] and link:https://asciidoctor.org/[AsciiDoctor]
ru: Справочник был преобразован из link:https://docbook.org/[Docbook] в link:https://gohugo.io/[Hugo] и link:https://asciidoctor.org/[AsciiDoctor]

source: The link:https://docs.FreeBSD.org[FreeBSD Documentation Portal] has been created.
ru: link:https://docs.FreeBSD.org[Портал документации FreeBSD] был создан.

source: The crossref:introduction[introduction, Introduction] chapter has been updated to improve the FreeBSD history and fix minor typos.
ru: Глава crossref:introduction[introduction, Введение] была обновлена для улучшения описания истории FreeBSD и исправления незначительных опечаток.

source: The crossref:bsdinstall[bsdinstall, Install] chapter has been updated with an upgraded synopsis, the latest changes to the installer, refreshed images, added alt text to images, and the removal of references to specific versions.
ru: Глава crossref:bsdinstall[bsdinstall, Установка] была обновлена с улучшенной аннотацией, последними изменениями в установщике, обновленными изображениями, добавленным альтернативным текстом для изображений и удалением упоминаний конкретных версий.

source: The crossref:basics[basics, Basics] chapter has updated tables, command outputs, and directory structure per man:hier.
ru: Глава crossref:basics[basics, Основы] содержит обновлённые таблицы, выводы команд и структуру каталогов в соответствии с man:hier.

source: The crossref:ports[ports, Ports] chapter has been updated and now simplifies package searches, updates software examples (Nginx replaces Apache), improves the man:pkg[8] bootstrap process, and adds new instructions for configuring and managing packages, including blocking and unblocking.
ru: Глава crossref:ports[ports, Порты] была обновлена и теперь упрощает поиск пакетов, обновляет примеры программного обеспечения (Nginx заменяет Apache), улучшает процесс начальной загрузки man:pkg[8] и добавляет новые инструкции по настройке и управлению пакетами, включая их блокировку и разблокировку.

source: The crossref:x11[x11, X11] chapter has been updated to reflect the current state of graphics in FreeBSD, remove outdated references to old Intel drivers, configurations, and compiz, and relocate desktop environment instructions (such as KDE Plasma and GNOME) to the Desktop Environments chapter, as these environments now also support Wayland in addition to X11.
ru: Глава crossref:x11[x11, X11] была обновлена, чтобы отразить текущее состояние графики в FreeBSD: удалены устаревшие ссылки на старые драйверы Intel, конфигурации и compiz, а инструкции по настройке окружений рабочего стола (таких как KDE Plasma и GNOME) перенесены в главу «Окружения рабочего стола», так как эти окружения теперь поддерживают не только X11, но и Wayland.

source: The crossref:wayland[wayland,Wayland] chapter has been added with information about installing and configuring Wayland under FreeBSD.
ru: Добавлена глава crossref:wayland[wayland,Wayland] с информацией об установке и настройке Wayland в FreeBSD.

source: The crossref:network[network, Network] chapter has been created to cover basic wired and wireless network configuration, including hostname, DNS, and troubleshooting. Sections on wired networks, wireless, and IPv6 have been moved and updated with improved command outputs, use of sysrc, and better AsciiDoc syntax.
ru: Глава crossref:network[network, Сеть] была создана для описания базовой настройки проводных и беспроводных сетей, включая имя хоста, DNS и устранение неполадок. Разделы о проводных сетях, беспроводных сетях и IPv6 были перемещены и обновлены с улучшенными выводами команд, использованием sysrc и улучшенным синтаксисом AsciiDoc.

source: The crossref:desktop[desktop, Desktop] chapter has been updated with upgraded installation instructions for KDE Plasma, GNOME, XFCE, MATE, Cinnamon, and LXQT, expanded browser options, a new development tools section, and updates to office productivity, document viewers, and finance sections.
ru: Глава crossref:desktop[desktop,Рабочий стол] была обновлена: добавлены улучшенные инструкции по установке KDE Plasma, GNOME, XFCE, MATE, Cinnamon и LXQT, расширены варианты браузеров, добавлен новый раздел о инструментах разработки, а также обновлены разделы о офисных приложениях, программах для просмотра документов и финансовых инструментах.

source: The crossref:multimedia[multimedia, Multimedia] chapter has been reworked with updates to the sound section, new tables for sound mixers, audio players, and video players, guidance on automatic headphone switching, a new conferencing and meetings section, and a revised image scanners section.
ru: Глава crossref:multimedia[multimedia,Мультимедиа] была переработана с обновлениями в разделе о звуке, новыми таблицами для микшеров звука, аудиоплееров и видеоплееров, рекомендациями по автоматическому переключению на наушники, новым разделом о конференциях и встречах, а также пересмотренным разделом о сканерах изображений.

source: The crossref:linuxemu[linuxemu, Linuxemu] chapter has been improved with updated instructions for setting up a Debian/Ubuntu base system using debootstrap.
ru: Раздел crossref:linuxemu[linuxemu, Linuxemu] был улучшен за счет обновленных инструкций по настройке базовой системы Debian/Ubuntu с использованием debootstrap.

source: The crossref:config[config, Config] chapter has been renamed for accuracy, with updates to service management, cron and periodic, syslog, power management, and swap sections. A new entry on config files was added, and the outdated tuning section was removed.
ru: Глава crossref:config[config, Config] была переименована для точности, с обновлениями в разделах управления службами, cron и periodic, syslog, управления питанием и подкачки. Добавлена новая запись о конфигурационных файлах, а устаревший раздел по настройке удалён.

source: The crossref:security[security, Security] chapter has been updated with enhancements to VPN over IPSec, securing accounts, password hashes, sudo/doas, and OpenSSH/OpenSSL. New sections have been added covering IDS, secure levels, file flags, Capsicum, NFSv4 ACLs, and resource limits.
ru: Глава crossref:security[security, Безопасность] была обновлена с улучшениями для VPN через IPSec, защиты учетных записей, хешей паролей, sudo/doas и OpenSSH/OpenSSL. Добавлены новые разделы, посвященные IDS, уровням безопасности, флагам файлов, Capsicum, ACL NFSv4 и ограничениям ресурсов.

source: The crossref:jails[jails, Jails] chapter has been updated to include details on jail types (Thick, Thin, VNET, and Linux Jails), host system configuration, networking options, the jail configuration file, setup procedures, upgrade methods, resource limits, and different jail managers and container solutions.
ru: Глава crossref:jails[jails, Клетки] была обновлена и теперь включает подробности о типах клеток (толстых, тонких, VNET клеток и клеток Linux), настройке хостовой системы, вариантах сетевого взаимодействия, файле конфигурации клетки, процедурах настройки, методах обновления, ограничениях ресурсов, а также различных менеджерах клеток и решениях для контейнеров.

source: The crossref:mail[mail, Mail] chapter has been updated to include information on DMA, upgrades to Sendmail, instructions for changing DMA and Sendmail to use different MTAs, and the removal of Dialup and Fetchmail sections, along with a reorganization of the chapter.
ru: Глава crossref:mail[mail,Почта] была обновлена и теперь включает информацию о DMA, обновлениях Sendmail, инструкции по замене DMA и Sendmail на другие MTA, а также удаление разделов Dialup и Fetchmail с последующей реорганизацией главы.

source: The crossref:bibliography[bibliography,Bibliography] has been extensively updated.
ru: crossref:bibliography[bibliography,Библиография] была значительно обновлена.

source: Third Edition
ru: Третье издание

source: The current online version of the Handbook represents the cumulative effort of many hundreds of contributors over the past 10 years. The following are some of the significant changes since the two volume third edition was published in 2004:
ru: Текущая онлайн-версия Handbook представляет собой результат совместных усилий сотен участников за последние 10 лет. Ниже перечислены некоторые значительные изменения, внесённые с момента публикации третьего издания в двух томах в 2004 году:

source: crossref:wine[wine,WINE] has been added with information about how to run Windows(R) applications on FreeBSD.
ru: В документацию FreeBSD добавлен раздел crossref:wine[wine,WINE] с информацией о запуске приложений Windows(R) в FreeBSD.

source: crossref:dtrace[dtrace,DTrace] has been added with information about the powerful DTrace performance analysis tool.
ru: В документацию FreeBSD добавлен раздел crossref:dtrace[dtrace,DTrace] с информацией о мощном инструменте анализа производительности DTrace.

source: crossref:filesystems[filesystems,Other File Systems] have been added with information about non-native file systems in FreeBSD, such as ZFS from Sun(TM).
ru: В файле crossref:filesystems[filesystems,Другие файловые системы] добавлена информация о не родных файловых системах в FreeBSD, таких как ZFS от Sun(TM).

source: crossref:audit[audit,Security Event Auditing] has been added to cover the new auditing capabilities in FreeBSD and explain its use.
ru: В документе crossref:audit[audit,Аудит событий безопасности] добавлен раздел, посвящённый новым возможностям аудита в FreeBSD, с объяснением их использования.

source: crossref:virtualization[virtualization,Virtualization] has been added with information about installing FreeBSD on virtualization software.
ru: В документе FreeBSD добавлен раздел crossref:virtualization[виртуализация,Виртуализация] с информацией об установке FreeBSD на программное обеспечение для виртуализации.

source: crossref:bsdinstall[bsdinstall,Installing FreeBSD] has been added to cover installation of FreeBSD using the new installation utility, bsdinstall.
ru: Добавлен раздел crossref:bsdinstall[bsdinstall,Установка FreeBSD], посвящённый установке FreeBSD с помощью новой утилиты bsdinstall.

source: Second Edition (2004)
ru: Второе издание (2004)

source: The third edition was the culmination of over two years of work by the dedicated members of the FreeBSD Documentation Project. The printed edition grew to such a size that it was necessary to publish as two separate volumes. The following are the major changes in this new edition:
ru: Третье издание стало результатом более чем двухлетней работы преданных участников проекта FreeBSD Documentation Project. Печатное издание увеличилось до такого объёма, что потребовалось выпустить его в виде двух отдельных томов. Ниже приведены основные изменения в этом новом издании:

source: crossref:config[config-tuning,Configuration and Tuning] has been expanded with new information about the ACPI power and resource management, the `cron` system utility, and more kernel tuning options.
ru: crossref:config[config-tuning,Настройка и оптимизация системы] была дополнена новой информацией об управлении питанием и ресурсами ACPI, системной утилите `cron`, а также дополнительными параметрами настройки ядра.

source: crossref:security[security,Security] has been expanded with new information about virtual private networks (VPNs), file system access control lists (ACLs), and security advisories.
ru: crossref:security[security,Безопасность] дополнена новой информацией о виртуальных частных сетях (VPN), списках контроля доступа (ACL) файловых систем и рекомендациях по безопасности.

source: crossref:mac[mac,Mandatory Access Control] is a new chapter with this edition. It explains what MAC is and how this mechanism can be used to secure a FreeBSD system.
ru: crossref:mac[mac,Принудительный контроль доступа] — это новая глава в данном издании. В ней объясняется, что такое MAC и как этот механизм может быть использован для защиты системы FreeBSD.

source: crossref:disks[disks,Storage] has been expanded with new information about USB storage devices, file system snapshots, file system quotas, file and network backed filesystems, and encrypted disk partitions.
ru: crossref:disks[disks,Хранение данных] была дополнена новой информацией о USB-накопителях, снимках файловых систем, квотах файловых систем, файловых и сетевых файловых системах, а также о зашифрованных разделах диска.

source: A troubleshooting section has been added to crossref:ppp-and-slip[ppp-and-slip,PPP].
ru: В раздел crossref:ppp-and-slip[ppp-and-slip,PPP] добавлен подраздел по устранению неполадок.

source: crossref:mail[mail,Electronic Mail] has been expanded with new information about using alternative transport agents, SMTP authentication, UUCP, fetchmail, procmail, and other advanced topics.
ru: crossref:mail[mail,Электронная почта] была дополнена новой информацией об использовании альтернативных транспортных агентов, SMTP-аутентификации, UUCP, fetchmail, procmail и других расширенных темах.

source: crossref:network-servers[network-servers,Network Servers] is all new with this edition. This chapter includes information about setting up the Apache HTTP Server, ftpd, and setting up a server for Microsoft(R) Windows(R) clients with Samba. Some sections from crossref:advanced-networking[advanced-networking,Advanced Networking] were moved here to improve the presentation.
ru: crossref:network-servers[network-servers,Сетевые серверы] полностью обновлена в этом издании. Эта глава включает информацию о настройке Apache HTTP Server, ftpd, а также о настройке сервера для клиентов Microsoft(R) Windows(R) с помощью Samba. Некоторые разделы из crossref:advanced-networking[advanced-networking,Расширенные сетевые технологии] были перемещены сюда для улучшения изложения.

source: crossref:advanced-networking[advanced-networking,Advanced Networking] has been expanded with new information about using Bluetooth(R) devices with FreeBSD, setting up wireless networks, and Asynchronous Transfer Mode (ATM) networking.
ru: crossref:advanced-networking[advanced-networking,Расширенные сетевые технологии] дополнены новой информацией об использовании устройств Bluetooth(R) с FreeBSD, настройке беспроводных сетей и работе с сетями Asynchronous Transfer Mode (ATM).

source: A glossary has been added to provide a central location for the definitions of technical terms used throughout the book.
ru: В книгу добавлен глоссарий, который служит центральным местом для определений технических терминов, используемых в тексте.

source: A number of aesthetic improvements have been made to the tables and figures throughout the book.
ru: В книгу внесен ряд визуальных улучшений в таблицы и иллюстрации.

source: First Edition (2001)
ru: Первое издание (2001)

source: The second edition was the culmination of over two years of work by the dedicated members of the FreeBSD Documentation Project. The following were the major changes in this edition:
ru: Второе издание стало результатом более двух лет работы преданных членов Проекта документации FreeBSD. Основные изменения в этом издании включали:

source: A complete Index has been added.
ru: Добавлен полный указатель.

source: All ASCII figures have been replaced by graphical diagrams.
ru: Все ASCII-рисунки заменены графическими диаграммами.

source: A standard synopsis has been added to each chapter to give a quick summary of what information the chapter contains, and what the reader is expected to know.
ru: В начало каждой главы добавлено стандартное краткое содержание, которое даёт общее представление о том, какую информацию содержит глава и какие знания ожидаются от читателя.

source: The content has been logically reorganized into three parts: "Getting Started", "System Administration", and "Appendices".
ru: Содержание было логически реорганизовано в три части: «Начало работы», «Администрирование системы» и «Приложения».

source: crossref:basics[basics,FreeBSD Basics] has been expanded to contain additional information about processes, daemons, and signals.
ru: Раздел crossref:basics[basics,Основы FreeBSD] был расширен, и теперь включает дополнительную информацию о процессах, демонах и сигналах.

source: crossref:ports[ports,Installing Applications: Packages and Ports] has been expanded to contain additional information about binary package management.
ru: Раздел crossref:ports[ports,Установка приложений: Пакеты и порты] был дополнен дополнительной информацией об управлении бинарными пакетами.

source: crossref:x11[x11,The X Window System] has been completely rewritten with an emphasis on using modern desktop technologies such as KDE and GNOME on XFree86(TM) 4.X.
ru: Раздел crossref:x11[x11,Система X Window] был полностью переписан с акцентом на использование современных технологий для рабочих столов, таких как KDE и GNOME на XFree86(TM) 4.X.

source: crossref:boot[boot,The FreeBSD Booting Process] has been expanded.
ru: Раздел crossref:boot[boot,Процесс загрузки FreeBSD] был расширен.

source: crossref:disks[disks,Storage] has been written from what used to be two separate chapters on "Disks" and "Backups". We feel that the topics are easier to comprehend when presented as a single chapter. A section on RAID (both hardware and software) has also been added.
ru: Раздел crossref:disks[disks,Хранение данных] был написан на основе двух глав: «Диски» и «Резервное копирование», которые ранее были отдельными. Мы считаем, что объединение этих тем в одну главу облегчает их понимание. Также добавлен раздел о RAID (как аппаратном, так и программном).

source: crossref:serialcomms[serialcomms,Serial Communications] has been completely reorganized and updated for FreeBSD 4.X/5.X.
ru: Раздел crossref:serialcomms[serialcomms,Последовательные коммуникации] был полностью переработан и обновлен для FreeBSD 4.X/5.X.

source: crossref:ppp-and-slip[ppp-and-slip,PPP] has been substantially updated.
ru: Раздел crossref:ppp-and-slip[ppp-and-slip,PPP] был значительно обновлен.

source: Many new sections have been added to crossref:advanced-networking[advanced-networking,Advanced Networking].
ru: В новую секцию crossref:advanced-networking[advanced-networking,Сложные вопросы работы в сети] добавлено множество новых разделов.

source: crossref:mail[mail,Electronic Mail] has been expanded to include more information about configuring sendmail.
ru: Раздел crossref:mail[mail,Электронная почта] был дополнен дополнительной информацией о настройке sendmail.

source: crossref:linuxemu[linuxemu,Linux® Binary Compatibility] has been expanded to include information about installing Oracle(R) and SAP(R) R/3(R).
ru: Раздел crossref:linuxemu[linuxemu,Совместимость с бинарными файлами Linux®] был расширен и включает информацию об установке Oracle(R) и SAP(R) R/3(R).

source: The following new topics are covered in this second edition:
ru: В этом втором издании рассматриваются следующие новые темы:

source: crossref:config[config-tuning,Configuration and Tuning].
ru: crossref:config[config-tuning,Настройка и конфигурирование].

source: crossref:multimedia[multimedia,Multimedia].
ru: crossref:multimedia[multimedia,Мультимедиа].

source: Organization of This Book
ru: Организация книги

source: This book is split into five logically distinct sections. The first section, _Getting Started_, covers the installation and basic usage of FreeBSD. It is expected that the reader will follow these chapters in sequence, possibly skipping chapters covering familiar topics. The second section, _Common Tasks_, covers some frequently used features of FreeBSD. This section, and all subsequent sections, can be read out of order. Each chapter begins with a succinct synopsis that describes what the chapter covers and what the reader is expected to already know. This is meant to allow the casual reader to skip around to find chapters of interest. The third section, _System Administration_, covers administration topics. The fourth section, _Network Communication_, covers networking and server topics. The fifth section contains appendices of reference information.
ru: Эта книга разделена на пять логически обособленных частей. Первая часть, _Начало работы_, посвящена установке и основам использования FreeBSD. Предполагается, что читатель будет изучать эти главы последовательно, возможно, пропуская главы на знакомые темы. Вторая часть, _Повседневные задачи_, охватывает часто используемые возможности FreeBSD. Эту часть, как и все последующие, можно читать в любом порядке. Каждая глава начинается с краткого описания, в котором указано, что рассматривается в главе и какие знания уже должны быть у читателя. Это позволяет бегло просматривать содержание и находить интересующие главы. Третья часть, _Администрирование системы_, посвящена вопросам администрирования. Четвёртая часть, _Сетевое взаимодействие_, охватывает темы, связанные с сетями и серверами. Пятая часть содержит справочные приложения.

source: _crossref:introduction[introduction,Introduction]_
ru: _crossref:introduction[introduction,Введение]_

source: Introduces FreeBSD to a new user. It describes the history of the FreeBSD Project, its goals and development model.
ru: Представляет FreeBSD новому пользователю. Описывает историю проекта FreeBSD, его цели и модель разработки.
