Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/vinum/_index.po
Languages: es, ru

source: A Striped [.filename]#vinum# Volume
es: Un Volumen [.filename]#vinum# Segmentado
ru: Том [.filename]#vinum# с чередованием

source: This volume is represented in crossref:vinum[vinum-striped-vol, A Striped [.filename]#vinum# Volume]. The darkness of the stripes indicates the position within the plex address space, where the lightest stripes come first and the darkest last.
ru: Этот том представлен на схеме crossref:vinum[vinum-striped-vol, Том [.filename]#vinum# с чередованием]. Темнота полос указывает на позицию в адресном пространстве плекса, где самые светлые полосы идут первыми, а самые темные — последними.

source: Resilience and Performance
es: Resiliencia y Rendimiento
ru: Устойчивость и производительность

source: [[vinum-resilience]]With sufficient hardware, it is possible to build volumes which show both increased resilience and increased performance compared to standard UNIX(R) partitions. A typical configuration file might be:
es: [[vinum-resilience]] Con suficiente hardware, es posible construir volúmenes que muestren resiliencia aumentada y rendimiento aumentado comparado con particiones UNIX(R) estándar. Una configuración típica podría ser:
ru: [[vinum-resilience]]При достаточном аппаратном обеспечении можно создать тома, которые демонстрируют как повышенную отказоустойчивость, так и увеличенную производительность по сравнению со стандартными разделами UNIX(R). Типичный конфигурационный файл может выглядеть так:

source: The subdisks of the second plex are offset by two drives from those of the first plex. This helps to ensure that writes do not go to the same subdisks even if a transfer goes over two drives.
es: Los subdiscos del segundo plex están desplazados en dos unidades respecto a aquellos en el primer flex. Esto ayuda a garantizar que las escrituras no van al mismo subdisco incluso si la transferencia se realiza sobre dos unidades.
ru: Поддиски второго плекса смещены на два диска относительно поддисков первого плекса. Это помогает гарантировать, что записи не будут направляться на одни и те же поддиски, даже если передача затронет два диска.

source: crossref:vinum[vinum-raid10-vol, A Mirrored, Striped [.filename]#vinum# Volume] represents the structure of this volume.
ru: crossref:vinum[vinum-raid10-vol, Том [.filename]#vinum# c зеркалированием и чередованием] представляет структуру этого тома.

source: A Mirrored, Striped [.filename]#vinum# Volume
es: Un Volumen [.filename]#vinum# Segmentado en Espejo
ru: Том [.filename]#vinum# c зеркалированием и чередованием

source: Object Naming
es: Nombrado de Objetos
ru: Именование объектов

source: [.filename]#vinum# assigns default names to plexes and subdisks, although they may be overridden. Overriding the default names is not recommended as it does not bring a significant advantage and it can cause confusion.
es: [.filename]#vinum# asigna nombres por defecto a los plexes y los subdiscos, aunque pueden ser modificados. Modificar los nombres por defecto no está recomendado ya que no proporciona una ventaja significativa y puede provocar confusión.
ru: [.filename]#vinum# назначает стандартные имена для плексов и поддисков, хотя их можно изменить. Не рекомендуется изменять стандартные имена, так как это не дает значительных преимуществ и может вызвать путаницу.

source: Names may contain any non-blank character, but it is recommended to restrict them to letters, digits and the underscore characters. The names of volumes, plexes, and subdisks may be up to 64 characters long, and the names of drives may be up to 32 characters long.
es: Los nombres pueden contener cualquier carácter que no sea blanco, pero se recomienda restringirlos a letras, dígitos y al carácter subrayado. Los nombres de los volúmenes, plexes y subdiscos pueden tener hasta 64 caracteres de longitud, y los nombres de unidades pueden ser de hasta 32 caracteres de longitud.
ru: Имена могут содержать любые непустые символы, но рекомендуется ограничиваться буквами, цифрами и символами подчёркивания. Имена томов, плексов и поддисков могут быть длиной до 64 символов, а имена дисков — до 32 символов.

source: [.filename]#vinum# objects are assigned device nodes in the hierarchy [.filename]#/dev/gvinum#. The configuration shown above would cause [.filename]#vinum# to create the following device nodes:
es: A los objetos [.filename]#vinum# se les asignan nodos de dispositivo en la jerarquía [.filename]#/dev/gvinum#. La configuración que se muestra arriba haría que [.filename]#vinum# creara los siguientes nodos de dispositivo:
ru: Объектам [.filename]#vinum# назначаются узлы устройств в иерархии [.filename]#/dev/gvinum#. Приведённая выше конфигурация приведёт к тому, что [.filename]#vinum# создаст следующие узлы устройств:

source: Device entries for each volume. These are the main devices used by [.filename]#vinum#. The configuration above would include the devices [.filename]#/dev/gvinum/myvol#, [.filename]#/dev/gvinum/mirror#, [.filename]#/dev/gvinum/striped#, [.filename]#/dev/gvinum/raid5# and [.filename]#/dev/gvinum/raid10#.
es: Entradas de dispositivo para cada volumen. Estos son los dispositivos principales utilizados por [.filename]#vinum#. La configuración anterior incluiría los dispositivos [.filename]#/dev/gvinum/myvol#, [.filename]#/dev/gvinum/mirror#, [.filename]#/dev/gvinum/striped#, [.filename]#/dev/gvinum/raid5# y [.filename]#/dev/gvinum/raid10#.
ru: Записи устройств для каждого тома. Это основные устройства, используемые [.filename]#vinum#. Приведённая конфигурация включает устройства [.filename]#/dev/gvinum/myvol#, [.filename]#/dev/gvinum/mirror#, [.filename]#/dev/gvinum/striped#, [.filename]#/dev/gvinum/raid5# и [.filename]#/dev/gvinum/raid10#.

source: All volumes get direct entries under [.filename]#/dev/gvinum/#.
es: Todos los volúmenes tienen entradas directas bajo [.filename]#/dev/gvinum/#.
ru: Все тома получают собственные записи в [.filename]#/dev/gvinum/#.

source: The directories [.filename]#/dev/gvinum/plex#, and [.filename]#/dev/gvinum/sd#, which contain device nodes for each plex and for each subdisk, respectively.
es: Los directorios [.filename]#/dev/gvinum/plex#, y [.filename]#/dev/gvinum/sd#, los cuales contienen nodos de dispositivo para cada plex y para cada subdisco, respectivamente.
ru: Каталоги [.filename]#/dev/gvinum/plex# и [.filename]#/dev/gvinum/sd#, которые содержат узлы устройств для каждого плекса и каждого субдиска соответственно.

source: For example, consider the following configuration file:
es: Por ejemplo, considera el siguiente fichero de configuración:
ru: Например, рассмотрим следующий конфигурационный файл:

source: After processing this file, man:gvinum[8] creates the following structure in [.filename]#/dev/gvinum#:
es: Después de procesar este fichero, man:gvinum[8] crea la siguiente estructura en [.filename]#/dev/gvinum#:
ru: После обработки этого файла man:gvinum[8] создает следующую структуру в [.filename]#/dev/gvinum#:

source: Although it is recommended that plexes and subdisks should not be allocated specific names, [.filename]#vinum# drives must be named. This makes it possible to move a drive to a different location and still recognize it automatically. Drive names may be up to 32 characters long.
es: Aunque se recomienda que los plexes y subdiscos no tengan asignados nombres específicos, las unidades de [.filename]#vinum# deben tener nombre. Esto hace posible mover una unidad a una localización diferente y que sea reconocida automáticamente. Los nombres de unidad pueden tener una longitud de hasta 32 caracteres.
ru: Хотя рекомендуется не назначать конкретные имена плексам и поддискам, диски [.filename]#vinum# должны быть именованными. Это позволяет переместить диск в другое место и по-прежнему автоматически его распознавать. Имена дисков могут быть длиной до 32 символов.

source: Creating File Systems
es: Creando Sistemas de Ficheros
ru: Создание файловых систем

source: Volumes appear to the system to be identical to disks, with one exception. Unlike UNIX(R) drives, [.filename]#vinum# does not partition volumes, which thus do not contain a partition table. This has required modification to some disk utilities, notably man:newfs[8], so that it does not try to interpret the last letter of a [.filename]#vinum# volume name as a partition identifier. For example, a disk drive may have a name like [.filename]#/dev/ad0a# or [.filename]#/dev/da2h#. These names represent the first partition ([.filename]#a#) on the first (0) IDE disk ([.filename]#ad#) and the eighth partition ([.filename]#h#) on the third (2) SCSI disk ([.filename]#da#) respectively. By contrast, a [.filename]#vinum# volume might be called [.filename]#/dev/gvinum/concat#, which has no relationship with a partition name.
es: En el sistema los volúmenes parecen idénticos a los discos, con una excepción. A diferencia de las unidades UNIX(R), [.filename]#vinum# no particiona los volúmenes, por lo que estos no tienen tabla de particiones. Esto ha requerido modificaciones en algunas utilidades de disco, notablemente de man:newfs[8], de forma que no intente interpretar la última letra de un nombre de volumen [.filename]#vinum#. Por ejemplo, una unidad de disco podría tener un nombre como /dev/ad0a# o /dev/da2h#. Estos nombres representan la primera partición ([.filename]#a#) en el primer (0) disco IDE ([.filename]#ad#) y la octava partición ([.filename]#h#) en el tercer (2) disco SCSI ([.filename]#da#) respectivamente. Por el contrario, un volumen [.filename]#vinum# podría llamarse /dev/gvinum/concat#, que no guarda relación con un nombre de partición.
ru: Тома для системы выглядят идентично дискам, за одним исключением. В отличие от дисков UNIX(R), [.filename]#vinum# не разбивает тома на разделы, поэтому они не содержат таблицы разделов. Это потребовало внесения изменений в некоторые утилиты для работы с дисками, в частности, в man:newfs[8], чтобы они не пытались интерпретировать последнюю букву имени тома [.filename]#vinum# как идентификатор раздела. Например, имя диска может выглядеть как [.filename]#/dev/ad0a# или [.filename]#/dev/da2h#. Эти имена обозначают первый раздел ([.filename]#a#) на первом (0) IDE-диске ([.filename]#ad#) и восьмой раздел ([.filename]#h#) на третьем (2) SCSI-диске ([.filename]#da#) соответственно. В отличие от этого, том [.filename]#vinum# может называться [.filename]#/dev/gvinum/concat#, что не имеет отношения к имени раздела.

source: To create a file system on this volume, use man:newfs[8]:
ru: Чтобы создать файловую систему на этом томе, используйте man:newfs[8]:

source: Configuring [.filename]#vinum#
es: Configurando [.filename]#vinum#
ru: Настройка [.filename]#vinum#

source: The [.filename]#GENERIC# kernel does not contain [.filename]#vinum#. It is possible to build a custom kernel which includes [.filename]#vinum#, but this is not recommended. The standard way to start [.filename]#vinum# is as a kernel module. man:kldload[8] is not needed because when man:gvinum[8] starts, it checks whether the module has been loaded, and if it is not, it loads it automatically.
es: El kernel [.filename]#GENERIC# no contiene [.filename]#vinum#. Es posible construir un kernel a medida que incluya [.filename]#vinum#, pero no se recomienda. La forma estándar de arrancar [.filename]#vinum# es como un módulo del kernel. man:kldload[8] no es necesario porque cuando man:gvinum[8] arranca, comprueba si el módulo ha sido cargado, y si no es así, lo carga automáticamente.
ru: Ядро [.filename]#GENERIC# не содержит [.filename]#vinum#. Можно собрать пользовательское ядро с включённым [.filename]#vinum#, но это не рекомендуется. Стандартный способ запуска [.filename]#vinum# — в качестве модуля ядра. Команда man:kldload[8] не требуется, так как при запуске man:gvinum[8] проверяет, загружен ли модуль, и если нет, загружает его автоматически.

source: Startup
es: Arranque
ru: Запуск

source: [.filename]#vinum# stores configuration information on the disk slices in essentially the same form as in the configuration files. When reading from the configuration database, [.filename]#vinum# recognizes a number of keywords which are not allowed in the configuration files. For example, a disk configuration might contain the following text:
es: [.filename]#vinum# almacena información de configuración en las porciones de disco de forma esencialmente igual a como guarda los ficheros de configuración. Cuando lee de la base de datos de configuración, [.filename]#vinum# reconoce un número de palabras clave que no están permitidas en los ficheros de configuración. Por ejemplo, una configuración de disco podría contener el siguiente texto:
ru: [.filename]#vinum# хранит конфигурационную информацию на дисковых слайсах практически в той же форме, что и в конфигурационных файлах. При чтении из базы данных конфигурации [.filename]#vinum# распознаёт ряд ключевых слов, которые не допускаются в конфигурационных файлах. Например, конфигурация диска может содержать следующий текст:

source: The obvious differences here are the presence of explicit location information and naming, both of which are allowed but discouraged, and the information on the states. [.filename]#vinum# does not store information about drives in the configuration information. It finds the drives by scanning the configured disk drives for partitions with a [.filename]#vinum# label. This enables [.filename]#vinum# to identify drives correctly even if they have been assigned different UNIX(R) drive IDs.
es: Aquí las diferencias obvias son la presencia de información explícita de localización y nombrado, ambas permitidas pero no recomendadas, y la información de los estados. [.filename]#vinum# no almacena información sobre las unidades en la información de configuración. Encuentra las unidades escaneando las unidades de disco configuradas en busca de particiones con una etiqueta [.filename]#vinum#. Esto posibilita que [.filename]#vinum# identifique las unidades correctamente incluso si se les han asignado identificadores de unidad UNIX(R) diferentes.
ru: Очевидные различия здесь — наличие явной информации о местоположении и именования, что разрешено, но не рекомендуется, а также информация о состояниях. [.filename]#vinum# не хранит сведения о дисках в конфигурационной информации. Он находит диски, сканируя настроенные дисковые накопители на наличие разделов с меткой [.filename]#vinum#. Это позволяет [.filename]#vinum# корректно идентифицировать диски, даже если им были присвоены разные идентификаторы дисков UNIX(R).

source: Automatic Startup
es: Arranque Automático
ru: Автоматический запуск

source: _Gvinum_ always features an automatic startup once the kernel module is loaded, via man:loader.conf[5]. To load the _Gvinum_ module at boot time, add `geom_vinum_load="YES"` to [.filename]#/boot/loader.conf#.
es: _Gvinum_ siempre realiza un arranque automático una vez que el módulo del kernel ha sido cargado, via man:loader.conf[5]. Para cargar el módulo de _Gvinum_ en el arranque, añade `geom_vinum_load="YES"` a [.filename]#/boot/loader.conf#.
ru: _Gvinum_ всегда запускается автоматически после загрузки модуля ядра через man:loader.conf[5]. Чтобы загрузить модуль _Gvinum_ при загрузке системы, добавьте `geom_vinum_load="YES"` в [.filename]#/boot/loader.conf#.

source: When [.filename]#vinum# is started with `gvinum start`, [.filename]#vinum# reads the configuration database from one of the [.filename]#vinum# drives. Under normal circumstances, each drive contains an identical copy of the configuration database, so it does not matter which drive is read. After a crash, however, [.filename]#vinum# must determine which drive was updated most recently and read the configuration from this drive. It then updates the configuration, if necessary, from progressively older drives.
es: Cuando [.filename]#vinum# es arrancado con `gvinum start`, [.filename]#vinum# lee la base de datos de configuración de una de las unidades [.filename]#vinum#. En condiciones normales, cada unidad contiene una copia idéntica de la base de datos de configuración, de forma que no importa de qué unidad se lea. Después de una caída, sin embargo, [.filename]#vinum# debe determinar qué unidad fue actualizada más recientemente y leer la configuración de esta unidad. Después actualiza la configuración progresivamente, si es necesario, de unidades más antiguas.
ru: Когда [.filename]#vinum# запускается командой `gvinum start`, [.filename]#vinum# читает конфигурационную базу данных с одного из дисков [.filename]#vinum#. В нормальных условиях каждый диск содержит идентичную копию конфигурационной базы данных, поэтому не имеет значения, с какого диска читать. Однако после сбоя [.filename]#vinum# должен определить, какой диск был обновлён последним, и прочитать конфигурацию с этого диска. Затем, если необходимо, он обновляет конфигурацию последовательно с более старых дисков.

source: Using [.filename]#vinum# for the Root File System
es: Usando [.filename]#vinum# para el Sistema de Ficheros Raíz
ru: Использование [.filename]#vinum# для корневой файловой системы

source: For a machine that has fully-mirrored file systems using [.filename]#vinum#, it is desirable to also mirror the root file system. Setting up such a configuration is less trivial than mirroring an arbitrary file system because:
es: Para una máquina que tiene sistemas de ficheros completamente en espejo usando [.filename]#vinum#, es deseable también configurar en espejo el sistema de ficheros raíz. Establecer dicha configuración es menos trivial que configurar en espejo un sistema de ficheros arbitrario porque:
ru: Для машины с полностью зеркалированными файловыми системами с использованием [.filename]#vinum#, желательно также зеркалировать корневую файловую систему. Настройка такой конфигурации менее тривиальна, чем зеркалирование произвольной файловой системы, потому что:

source: The root file system must be available very early during the boot process, so the [.filename]#vinum# infrastructure must already be available at this time.
es: El sistema de ficheros raíz debe estar disponible muy temprano durante el proceso de arranque, por lo que la infraestructura [.filename]#vinum# debe estar disponible en ese momento.
ru: Корневая файловая система должна быть доступна очень рано в процессе загрузки, поэтому инфраструктура [.filename]#vinum# должна быть уже доступна на этом этапе.

source: The volume containing the root file system also contains the system bootstrap and the kernel. These must be read using the host system's native utilities, such as the BIOS, which often cannot be taught about the details of [.filename]#vinum#.
es: El volumen que contiene el sistema de ficheros raíz, también contiene el sistema de arranque y el kernel. Estos deben ser leídos usando las utilidades nativas del sistema hospedador, como la BIOS, que frecuentemente no puede ser informada de los detalles de [.filename]#vinum#.
ru: Том, содержащий корневую файловую систему, также включает системный загрузчик и ядро. Они должны быть прочитаны с использованием родных утилит хостовой системы, таких как BIOS, который зачастую нельзя обучить работе с деталями [.filename]#vinum#.

source: In the following sections, the term "root volume" is generally used to describe the [.filename]#vinum# volume that contains the root file system.
es: En las secciones siguientes, el término "volumen raíz" se utiliza para describir el volumen [.filename]#vinum# que contiene el sistema de ficheros raíz.
ru: В следующих разделах термин "корневой том" обычно используется для описания тома [.filename]#vinum#, который содержит корневую файловую систему.

source: Starting up [.filename]#vinum# Early Enough for the Root File System
es: Arrancando [.filename]#vinum# Suficientemente Pronto para el Sistema de Ficheros Raíz
ru: Запуск [.filename]#vinum# на раннем этапе для обеспечения доступа к корневой файловой системе

source: [.filename]#vinum# must be available early in the system boot as man:loader[8] must be able to load the vinum kernel module before starting the kernel. This can be accomplished by putting this line in [.filename]#/boot/loader.conf#:
es: [.filename]#vinum# debe estar disponible pronto en el arranque del sistema puesto que man:loader[8] debe ser capaz de cargar el módulo del kernel de vinum antes de arrancar el kernel. Esto se puede conseguir poniendo la siguiente línea en [.filename]#/boot/loader.conf#:
ru: Файл `[.filename]#vinum#` должен быть доступен на раннем этапе загрузки системы, так как `man:loader[8]` должен загрузить модуль ядра `vinum` перед запуском ядра. Это можно сделать, добавив следующую строку в `[.filename]#/boot/loader.conf#`:

source: Making a [.filename]#vinum#-based Root Volume Accessible to the Bootstrap
es: Haciendo Accesible un Volumen Raíz basado en [.filename]#vinum# en el Código de Arranque
ru: Создание корневого тома на основе [.filename]#vinum#, доступного для загрузчика

source: The current FreeBSD bootstrap is only 7.5 KB of code and does not understand the internal [.filename]#vinum# structures. This means that it cannot parse the [.filename]#vinum# configuration data or figure out the elements of a boot volume. Thus, some workarounds are necessary to provide the bootstrap code with the illusion of a standard `a` partition that contains the root file system.
es: El código de arranque de FreeBSD ocupa sólo 7.5 KB y no entiende las estructuras internas de [.filename]#vinum#. Esto significa que no puede parsear los datos de configuración de [.filename]#vinum# o resolver los elementos de un volumen de arranque. Por lo tanto, se necesitan algunas soluciones alternativas para proporcionar al código de arranque con el espejismo de una partición estándar `a` que contiene el sistema de ficheros raíz.
ru: Текущая загрузочная запись FreeBSD занимает всего 7,5 КБ кода и не понимает внутренние структуры [.filename]#vinum#. Это означает, что она не может разобрать конфигурационные данные [.filename]#vinum# или определить элементы загрузочного тома. Таким образом, необходимы некоторые обходные решения, чтобы предоставить загрузочному коду иллюзию стандартного раздела `a`, содержащего корневую файловую систему.

source: For this to be possible, the following requirements must be met for the root volume:
es: Para que esto sea posible, el volumen raíz debe cumplir los siguientes requisitos:
ru: Для этого должны быть выполнены следующие требования к корневому тому:

source: The root volume must not be a stripe or `RAID`-5.
es: El volumen raíz no debe ser un segmento o `RAID`-5.
ru: Корневой том не должен быть чередующимся или `RAID`-5.

source: The root volume must not contain more than one concatenated subdisk per plex.
es: El volumen raíz no debe contener más de un subdisco concatenado por plex.
ru: Корневой том не должен содержать более одного объединённого поддиска на плекс.
