Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/ports/_index.po
Languages: ko, ru

source: FreeBSD provides two complementary technologies for installing third-party software: the FreeBSD Ports Collection, for installing from source, and packages, for installing from pre-built binaries
ko: FreeBSD는 타사 소프트웨어 설치를 위한 두 가지 상호 보완적인 기술을 제공합니다: 소스에서 설치하는 FreeBSD 포트 컬렉션과 미리 빌드된 바이너리에서 설치하는 패키지입니다
ru: FreeBSD предоставляет две взаимодополняющие технологии для установки стороннего программного обеспечения: коллекцию портов FreeBSD для установки из исходного кода и пакеты для установки из предварительно собранных бинарных файлов

source: Part I. Getting Started
ko: 파트 I. 시작하기
ru: В начале

source: Chapter 4. Installing Applications: Packages and Ports
ko: 4장. 애플리케이션 설치하기: 패키지 및 포트
ru: Глава 4. Установка приложений: Пакеты и Порты

source: Installing Applications: Packages and Ports
ko: 애플리케이션 설치하기: 패키지 및 포트
ru: Установка приложений: пакеты и порты

source: Synopsis
ko: 요약
ru: Обзор

source: FreeBSD is bundled with a rich collection of system tools as part of the base system. In addition, FreeBSD provides two complementary technologies for installing third-party software: the FreeBSD Ports Collection, for installing from source, and packages, for installing from pre-built binaries. Either method may be used to install software from local media or from the network.
ko: FreeBSD는 기본 시스템의 일부로 다양한 시스템 도구 모음과 함께 번들로 제공됩니다. 또한 FreeBSD는 타사 소프트웨어를 설치하기 위한 두 가지 보완 기술, 즉 소스에서 설치하는 FreeBSD 포트 컬렉션과 미리 빌드된 바이너리에서 설치하는 패키지를 제공합니다. 두 가지 방법 모두 로컬 미디어 또는 네트워크에서 소프트웨어를 설치하는 데 사용할 수 있습니다.
ru: FreeBSD поставляется с богатым набором системных инструментов в составе базовой системы. Кроме того, FreeBSD предоставляет две дополнительные технологии для установки стороннего программного обеспечения: коллекцию портов FreeBSD для установки из исходных кодов и пакеты для установки из предварительно собранных бинарных файлов. Оба метода могут быть использованы для установки программного обеспечения как с локальных носителей, так и из сети.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: The difference between binary packages and ports.
ko: 바이너리 패키지와 포트의 차이점.
ru: Разница между бинарными пакетами и портами.

source: How to find third-party software that has been ported to FreeBSD.
ko: FreeBSD로 포팅된 타사 소프트웨어를 찾는 방법.
ru: Как найти стороннее программное обеспечение, портированное на FreeBSD.

source: How to manage binary packages using pkg.
ko: pkg를 사용하여 바이너리 패키지를 관리하는 방법.
ru: Как управлять бинарными пакетами с помощью pkg.

source: How to build third-party software from source using the Ports Collection.
ko: 포트 컬렉션을 사용하여 소스에서 타사 소프트웨어를 빌드하는 방법.
ru: Как собрать стороннее программное обеспечение из исходных кодов с использованием Коллекции портов.

source: How to find the files installed with the application for post-installation configuration.
ko: 설치 후 구성을 위해 애플리케이션과 함께 설치된 파일을 찾는 방법.
ru: Как найти файлы, установленные с приложением, для пост-установочной настройки.

source: What to do if a software installation fails.
ko: 소프트웨어 설치에 실패한 경우 어떻게 해야 하나요?
ru: Что делать, если установка программного обеспечения не удалась.

source: Overview of Software Installation
ko: 소프트웨어 설치 개요
ru: Обзор установки программного обеспечения

source: A FreeBSD _port_ is a collection of files designed to automate the process of compiling an application from source code. The files that comprise a port contain all the necessary information to automatically download, extract, patch, compile, and install the application.
ko: FreeBSD _port_는 소스 코드에서 애플리케이션을 컴파일하는 과정을 자동화하기 위해 설계된 파일 모음입니다. 포트를 구성하는 파일에는 애플리케이션을 자동으로 다운로드, 추출, 패치, 컴파일 및 설치하는 데 필요한 모든 정보가 포함되어 있습니다.
ru: Порт FreeBSD — это набор файлов, предназначенных для автоматизации процесса компиляции приложения из исходного кода. Файлы, из которых состоит порт, содержат всю необходимую информацию для автоматической загрузки, распаковки, наложения исправлений, компиляции и установки приложения.

source: If the software has not already been adapted and tested on FreeBSD, the source code might need editing in order for it to install and run properly.
ko: 소프트웨어가 아직 FreeBSD에 맞게 조정되고 테스트되지 않은 경우, 제대로 설치 및 실행되려면 소스 코드를 편집해야 할 수 있습니다.
ru: Если программное обеспечение ещё не адаптировано и не протестировано на FreeBSD, может потребоваться редактирование исходного кода для его правильной установки и работы.

source: However, over link:https://ports.FreeBSD.org[{numports}] third-party applications have already been ported to FreeBSD. When feasible, these applications are made available for download as pre-compiled _packages_.
ru: Однако более link:https://ports.FreeBSD.org[{numports}] сторонних приложений уже портированы на FreeBSD. По возможности эти приложения доступны для загрузки в виде предварительно скомпилированных _пакетов_.

source: Packages can be manipulated with the FreeBSD package management commands.
ko: 패키지는 FreeBSD 패키지 관리 명령으로 조작할 수 있습니다.
ru: Пакетами можно управлять с помощью команд управления пакетами FreeBSD.

source: Both packages and ports understand dependencies. If a package or port is used to install an application and a dependent library is not already installed, the library will automatically be installed first.
ko: 패키지와 포트는 모두 종속성을 이해합니다. 패키지 또는 포트를 사용하여 애플리케이션을 설치하는 데 종속 라이브러리가 아직 설치되어 있지 않은 경우 먼저 라이브러리가 자동으로 설치됩니다.
ru: Как пакеты, так и порты учитывают зависимости. Если приложение устанавливается с помощью пакета или порта, а необходимая библиотека ещё не установлена, эта библиотека будет автоматически установлена первой.

source: A FreeBSD package contains pre-compiled copies of all the commands for an application, as well as any configuration files and documentation. A package can be manipulated with the man:pkg[8] commands, such as `pkg install`.
ko: FreeBSD 패키지에는 응용 프로그램에 대한 모든 명령의 미리 컴파일된 사본과 모든 구성 파일 및 설명서가 포함되어 있습니다. 패키지는 `pkg install`과 같은 man:pkg[8] 명령으로 조작할 수 있습니다.
ru: Пакет FreeBSD содержит предварительно скомпилированные версии всех команд приложения, а также любые конфигурационные файлы и документацию. Пакетом можно управлять с помощью команд man:pkg[8], таких как `pkg install`.

source: While the two technologies are similar, packages and ports each have their own strengths. Select the technology that meets your requirements for installing a particular application.
ko: 두 기술은 비슷하지만 패키지와 포트는 각각 고유한 강점이 있습니다. 특정 애플리케이션을 설치하는 데 필요한 요구 사항을 충족하는 기술을 선택하세요.
ru: Хотя эти две технологии схожи, пакеты и порты имеют свои сильные стороны. Выберите технологию, которая соответствует вашим требованиям для установки конкретного приложения.

source: Package Benefits
ko: 패키지의 장점
ru: Преимущества пакетов

source: A compressed package tarball is typically smaller than the compressed tarball containing the source code for the application.
ko: 압축된 패키지 tarball은 일반적으로 애플리케이션의 소스 코드가 포함된 압축된 tarball보다 작습니다.
ru: Сжатый tar-архив пакета обычно меньше, чем сжатый tar-архив с исходным кодом приложения.

source: Packages do not require compilation time. For large applications, such as Firefox, KDE Plasma, or GNOME, this can be important on a slow system.
ko: 패키지는 컴파일 시간이 필요하지 않습니다. Firefox, KDE Plasma 또는 GNOME과 같은 대규모 애플리케이션의 경우 느린 시스템에서 이 점이 중요할 수 있습니다.
ru: Пакеты не требуют времени на компиляцию. Для больших приложений, таких как Firefox, KDE Plasma или GNOME, это может быть важно на медленной системе.

source: Packages do not require any understanding of the process involved in compiling software on FreeBSD.
ko: 패키지를 사용하기 위해서는 FreeBSD에서 소프트웨어를 컴파일하는 과정에 대한 이해가 필요하지 않습니다.
ru: Пакеты не требуют понимания процесса компиляции программного обеспечения в FreeBSD.

source: Port Benefits
ko: 포트의 장점
ru: Преимущества портов

source: Packages are normally compiled with conservative options because they have to run on the maximum number of systems. By compiling from the port, one can change the compilation options.
ko: 패키지는 최대한 많은 시스템에서 실행되어야 하므로 일반적으로 보수적인 옵션으로 컴파일됩니다. 포트에서 컴파일하면 컴파일 옵션을 변경할 수 있습니다.
ru: Пакеты обычно компилируются с консервативными параметрами, так как они должны работать на максимальном количестве систем. При компиляции из портов можно изменить параметры компиляции.

source: Some applications have compile-time options relating to which features are installed. For example, NGINX(R) can be configured with a wide variety of different built-in options.
ko: 일부 애플리케이션에는 어떤 기능이 설치되는지와 관련된 컴파일 타임 옵션이 있습니다. 예를 들어, NGINX(R)는 다양한 기본 제공 옵션으로 구성할 수 있습니다.
ru: Некоторые приложения имеют параметры на этапе компиляции, определяющие, какие функции будут установлены. Например, NGINX(R) можно настроить с широким набором различных встроенных опций.

source: In some cases, multiple packages will exist for the same application with different settings. For example, NGINX(R) is available as a `nginx` package and a `nginx-lite` package, the former has many more options enabled, but this in turn requires many things to be installed as dependencies for it to work, thus increasing space consumption and attack surface.
ru: В некоторых случаях для одного приложения могут существовать несколько пакетов с разными настройками. Например, NGINX(R) доступен в виде пакетов `nginx` и `nginx-lite`. Первый имеет гораздо больше включенных опций, но это, в свою очередь, требует установки множества зависимостей для его работы, что увеличивает занимаемое место и поверхность для атак.

source: The transitive dependencies can grow quite large, for example the full `nginx` package will pull in several X libraries which can be quite surprising, so building from ports allow you to choose only the options you need without a "kitchen sink" approach. In some cases, multiple packages will exist for the same application to specify certain settings.
ru: Транзитивные зависимости могут стать довольно большими, например, полный пакет `nginx` потянет за собой несколько X-библиотек, что может оказаться неожиданным. Сборка из портов позволяет выбрать только нужные опции, избегая подхода «всё включено». В некоторых случаях для одного приложения могут существовать несколько пакетов с разными настройками.

source: The licensing conditions of some software forbid binary distribution. Such software must be distributed as source code which must be compiled by the end-user.
ko: 일부 소프트웨어의 라이선스 조건에 따라 바이너리 배포가 금지되어 있습니다. 이러한 소프트웨어는 최종 사용자가 스스로 컴파일해야 하는 소스 코드로 배포할 수밖에 없습니다.
ru: Условия лицензирования некоторых программных продуктов запрещают распространение в бинарном виде. Такое программное обеспечение должно распространяться в виде исходного кода, который конечный пользователь должен самостоятельно скомпилировать.

source: Some people do not trust binary distributions or prefer to read through source code in order to look for potential problems.
ko: 어떤 사람들은 바이너리 배포를 신뢰하지 않거나 잠재적인 문제를 찾기 위해 소스 코드를 읽는 것을 선호합니다.
ru: Некоторые люди не доверяют бинарным дистрибутивам или предпочитают изучать исходный код, чтобы выявить потенциальные проблемы.

source: Source code is needed in order to apply custom patches.
ko: 사용자 지정 패치를 적용하려면 소스 코드가 필요합니다.
ru: Исходный код необходим для применения пользовательских исправлений.

source: To keep track of updated ports, subscribe to the {freebsd-ports} and the {freebsd-ports-bugs}.
ko: 업데이트된 포트를 추적하려면 {freebsd-ports} 및 {freebsd-ports-bugs}을 구독하세요.
ru: Для отслеживания обновлений портов подпишитесь на рассылки {freebsd-ports} и {freebsd-ports-bugs}.

source: Before installing an application, check https://vuxml.freebsd.org/[] for related security issues.
ru: Перед установкой приложения проверьте https://vuxml.freebsd.org/[] на наличие связанных проблем с безопасностью.

source: To audit installed packages against known vulnerabilities, run `pkg audit -F`.
ru: Для проверки установленных пакетов на наличие известных уязвимостей выполните команду `pkg audit -F`.

source: The remainder of this chapter explains how to use packages and ports to install and manage third-party software on FreeBSD.
ko: 이 장의 나머지 부분에서는 패키지와 포트를 사용하여 FreeBSD에 타사 소프트웨어를 설치하고 관리하는 방법을 설명합니다.
ru: Оставшаяся часть этой главы объясняет, как использовать пакеты и порты для установки и управления сторонним программным обеспечением в FreeBSD.

source: Finding Software
ko: 소프트웨어 찾기
ru: Поиск программного обеспечения

source: FreeBSD's list of available applications is growing all the time. There are a number of ways to find software to install:
ko: FreeBSD의 사용 가능한 애플리케이션 목록은 계속 늘어나고 있습니다. 설치할 소프트웨어를 찾는 방법에는 여러 가지가 있습니다:
ru: Список доступных приложений для FreeBSD постоянно растет. Существует несколько способов найти программное обеспечение для установки:

source: The FreeBSD web site maintains an up-to-date searchable list of all the available applications, at link:https://ports.FreeBSD.org[Ports Portal]. The ports can be searched by application name or by software category.
ru: Веб-сайт FreeBSD содержит актуальный поисковый список всех доступных приложений на странице link:https://ports.FreeBSD.org[Портала портов]. Порты можно искать по названию приложения или по категории программного обеспечения.

source: Dan Langille maintains https://www.freshports.org/[FreshPorts] which provides a comprehensive search utility and also tracks changes to the applications in the Ports Collection. Registered users can create a customized watch list in order to receive an automated email when their watched ports are updated.
ko: Dan Langille은 종합적인 검색 유틸리티를 제공하고 포트 컬렉션에 있는 애플리케이션의 변경 사항을 추적하는 https://www.freshports.org/[FreshPorts]를 관리합니다. 등록된 사용자는 관심 포트가 업데이트될 때 자동 이메일을 받을 수 있도록 사용자 지정 관심 목록을 만들 수 있습니다.
ru: Дэн Лангилл поддерживает https://www.freshports.org/[FreshPorts], который предоставляет удобный поиск и отслеживает изменения в приложениях из коллекции портов. Зарегистрированные пользователи могут создать индивидуальный список наблюдения, чтобы получать автоматические уведомления по электронной почте при обновлении отслеживаемых портов.

source: If finding a particular application becomes challenging, try searching a site like https://sourceforge.net/[SourceForge] or https://github.com/[GitHub] then check back at the link:https://ports.FreeBSD.org[Ports Portal] to see if the application has been ported.
ru: Если найти конкретное приложение становится сложно, попробуйте поискать на таких сайтах, как https://sourceforge.net/[SourceForge] или https://github.com/[GitHub], а затем проверьте ссылку link:https://ports.FreeBSD.org[Ports Portal], чтобы узнать, было ли это приложение портировано.

source: Search the binary package repository for an application using the man:pkg[8] command
ko: Man:pkg[8] 명령을 사용하여 애플리케이션의 바이너리 패키지 리포지토리를 검색합니다
ru: Поиск репозитория бинарных пакетов для приложения с помощью команды man:pkg[8]

source: Using pkg for Binary Package Management
ko: 바이너리 패키지 관리를 위한 pkg 사용
ru: Использование pkg для управления бинарными пакетами

source: man:pkg[8] provides an interface for manipulating packages: registering, adding, removing and upgrading packages.
ko: man:pkg[8]은 패키지를 등록, 추가, 제거, 업그레이드하는 등 패키지를 조작하기 위한 인터페이스를 제공합니다.
ru: man:pkg[8] предоставляет интерфейс для управления пакетами: регистрации, добавления, удаления и обновления пакетов.

source: For sites wishing to only use prebuilt binary packages from the FreeBSD mirrors, managing packages with man:pkg[8] can be sufficient.
ko: FreeBSD 미러에서 미리 빌드된 바이너리 패키지만 사용하려는 경우, man:pkg[8]로 패키지를 관리하는 것으로 충분할 수 있습니다.
ru: Для сайтов, которые хотят использовать только предварительно собранные бинарные пакеты из зеркал FreeBSD, управления пакетами с помощью man:pkg[8] может быть достаточно.

source: However, for those sites building from source a separate crossref:ports[ports-upgrading-tools, port management tool] will be needed.
ru: Однако для сайтов, собирающих из исходного кода, потребуется отдельный crossref:ports[ports-upgrading-tools,инструмент управления портами].

source: Since man:pkg[8] only works with binary packages, it is not a replacement for such tools. Those tools can be used to install software from both binary packages and the Ports Collection, while man:pkg[8] installs only binary packages.
ko: man:pkg[8]은 바이너리 패키지에서만 작동하므로, 이러한 도구를 대체할 수 없습니다. 이러한 도구는 바이너리 패키지와 포트 컬렉션 모두에서 소프트웨어를 설치하는 데 사용할 수 있지만, man:pkg[8]은 바이너리 패키지만 설치합니다.
ru: Поскольку man:pkg[8] работает только с бинарными пакетами, он не является заменой таким инструментам. Эти инструменты можно использовать для установки программного обеспечения как из бинарных пакетов, так и из коллекции портов, тогда как man:pkg[8] устанавливает только бинарные пакеты.

source: Getting Started with pkg
ko: pkg 시작하기
ru: Начало работы с pkg

source: All supported versions of FreeBSD now contain `/usr/sbin/pkg` a.k.a man:pkg[7]. This is a small placeholder that has just the minimum functionality required to install the real man:pkg[8].
ko: 이제 지원되는 모든 FreeBSD 버전에는 `/usr/sbin/pkg`, 일명 man:pkg[7]이 포함됩니다. 이것은 실제 man:pkg[8]을 설치하는 데 필요한 최소한의 기능만 있는 작은 이름표 같은 것 입니다.
ru: Все поддерживаемые версии FreeBSD теперь содержат `/usr/sbin/pkg`, также известный как man:pkg[7]. Это небольшая заглушка, которая обладает лишь минимальной функциональностью, необходимой для установки настоящего man:pkg[8].

source: An Internet working connection is required for the bootstrap process to succeed.
ko: 부트스트랩 프로세스가 성공하려면 인터넷 연결이 필요합니다.
ru: Для успешного завершения процесса начальной загрузки требуется рабочее подключение к Интернету.

source: Run man:pkg[8] command line:
ko: Man:pkg[8] 명령줄을 실행합니다:
ru: Выполните команду man:pkg[8] из командной строки:

source: The output should be similar to the following:
ko: 출력은 다음과 비슷해야 합니다:
ru: Вывод должен быть похож на следующий:

source: man:pkg[7] will intercept the command, and if you confirm that is your intention, download the man:pkg[8] tarball, install man:pkg[8] from it, bootstrap the local package database and then proceed to run the command you originally requested.
ko: man:pkg[7]이 명령을 가로채고, 그 의도를 확인했다면 man:pkg[8] tarball을 다운로드하여 man:pkg[8]을 설치하고 로컬 패키지 데이터베이스를 부트스트랩한 다음 원래 요청했던 명령을 실행합니다.
ru: man:pkg[7] перехватит команду, и если вы подтвердите своё намерение, загрузит tarball man:pkg[8], установит man:pkg[8] из него, инициализирует локальную базу данных пакетов, а затем выполнит изначально запрошенную команду.

source: More recent versions of man:pkg[7] understand `pkg -N` as a test to see if man:pkg[8] is installed without triggering the installation, and conversely, pkg bootstrap[-f] to install man:pkg[8] (or force it to be reinstalled) without performing any other actions.
ko: 최신 버전의 man:pkg[7]는 `pkg -N`을 설치를 트리거하지 않고 man:pkg[8]이 설치되었는지 테스트하는 것으로 이해하고, 반대로 pkg 부트스트랩[-f]를 사용하여 다른 작업을 수행하지 않고 man:pkg[8]을 설치(또는 강제로 재설치)합니다.
ru: Более новые версии man:pkg[7] поддерживают `pkg -N` для проверки, установлен ли man:pkg[8], без запуска процесса установки, и, наоборот, `pkg bootstrap[-f]` для установки man:pkg[8] (или принудительной переустановки) без выполнения других действий.

source: Usage information for pkg is available in the man:pkg[8] manual page or by running `pkg` without additional arguments. Additional pkg configuration options are described in man:pkg.conf[5].
ko: pkg에 대한 사용 정보는 man:pkg[8] 매뉴얼 페이지에서 확인하거나 추가 인자 없이 `pkg`를 실행하여 확인할 수 있습니다. 추가 pkg 구성 옵션은 man:pkg.conf[5]에 설명되어 있습니다.
ru: Информация по использованию pkg доступна на man:pkg[8] или при запуске `pkg` без дополнительных аргументов. Дополнительные параметры настройки pkg описаны в man:pkg.conf[5].

source: Each pkg command argument is documented in a command-specific manual page.
ko: 각 pkg 명령 인수는 명령별 매뉴얼 페이지에 문서화되어 있습니다.
ru: Каждый аргумент команды pkg документирован в соответствующем руководстве, специфичном для команды.

source: To read the manual page for `pkg install`, for example, run this command:
ko: 예를 들어 'pkg install'에 대한 설명서 페이지를 읽으려면 다음 명령을 실행합니다:
ru: Чтобы прочитать справочную страницу для `pkg install`, например, выполните следующую команду:

source: The rest of this section demonstrates common binary package management tasks which can be performed using man:pkg[8]. Each demonstrated command provides many switches to customize its use. Refer to a command's help or man page for details and more examples.
ko: 이 섹션의 나머지 부분에서는 man:pkg[8]을 사용하여 수행할 수 있는 일반적인 바이너리 패키지 관리 작업을 설명합니다. 각 데모 명령은 사용자 정의할 수 있는 다양한 스위치를 제공합니다. 자세한 내용과 더 많은 예제는 명령의 도움말 또는 매뉴얼 페이지를 참조하세요.
ru: Оставшаяся часть этого раздела демонстрирует распространённые задачи управления бинарными пакетами, которые можно выполнять с помощью man:pkg[8]. Каждая из представленных команд предоставляет множество ключей для настройки их использования. Подробности и дополнительные примеры смотрите в справке (help) или man-странице соответствующей команды.

source: Quarterly and Latest Ports Branches
ko: 분기별 및 최신 포트 지점
ru: Квартальные и Последние Ветви Портов

source: The `Quarterly` branch provides users with a more predictable and stable experience for port and package installation and upgrades. This is done essentially by only allowing non-feature updates. Quarterly branches aim to receive security fixes (that may be version updates, or backports of commits), bug fixes and ports compliance or framework changes. The Quarterly branch is cut from HEAD at the beginning of every (yearly) quarter in January, April, July, and October. Branches are named according to the year (YYYY) and quarter (Q1-4) they are created in. For example, the quarterly branch created in January 2023, is named 2023Q1. And the `Latest` branch provides the latest versions of the packages to the users.
ko: `Quarterly(분기별)` 브랜치는 사용자에게 포트 및 패키지 설치와 업그레이드에 대해 보다 예측 가능하고 안정적인 환경을 제공합니다. 이는 기본적으로 비 특성 업데이트(역자 주: 안정성 업데이트로 생각됨)만 허용하는 방식으로 이루어집니다. 분기별 브랜치는 보안 수정(버전 업데이트 또는 커밋의 백포트일 수 있음), 버그 수정, 포트 규정 준수 또는 프레임워크 변경을 목표로 합니다. 분기별 브랜치는 1월, 4월, 7월, 10월의 매(연간) 분기 초를 기준으로 합니다. 브랜치는 브랜치가 생성된 연도(YYYY)와 분기(Q1-4)에 따라 이름이 지정됩니다. 예를 들어 2023년 1월에 생성된 분기 브랜치의 이름은 2023Q1입니다. 이에반해 `Latest` 브랜치는 사용자에게 최신 버전의 패키지를 제공합니다.
ru: Ветка `Quarterly` предоставляет пользователям более предсказуемый и стабильный опыт установки и обновления портов и пакетов. Это достигается за счёт того, что в неё вносятся только обновления, не связанные с добавлением новых функций. Ветки Quarterly получают исправления безопасности (которые могут включать обновления версий или обратные порты коммитов), исправления ошибок, а также изменения, связанные с соответствием портов или изменения в их инфраструктуре. Ветка Quarterly создаётся из HEAD в начале каждого квартала (года) в январе, апреле, июле и октябре. Ветки именуются в соответствии с годом (YYYY) и кварталом (Q1-4), в котором они созданы. Например, ветка quarterly, созданная в январе 2023 года, называется 2023Q1. А ветка `Latest` предоставляет пользователям самые последние версии пакетов.

source: To switch man:pkg[8] from Quarterly to Latest run the following commands:
ru: Чтобы переключить man:pkg[8] с Quarterly на Latest, выполните следующие команды:

source: Then run this command to update the local package repositories catalogues for the Latest branch:
ru: Затем выполните эту команду, чтобы обновить каталоги локальных репозиториев пакетов для ветки Latest:

source: Kernel modules repositories
ru: Репозитории модулей ядра

source: The kernel module repositories allow users to install ready to use kernel modules like the ones used for graphic drivers and specific hardware. Starting with FreeBSD 14.3, the FreeBSD Project provides kernel modules built for every supported version. To create such a repository configuration if it does not exist, add the following to [.filename]#/usr/local/etc/pkg/repos/kmods.conf#:
ru: Репозитории модулей ядра позволяют пользователям устанавливать готовые к использованию модули, такие как драйверы графики и поддержка специфичного оборудования. Начиная с FreeBSD 14.3, проект FreeBSD предоставляет собранные модули ядра для каждой поддерживаемой версии. Чтобы создать конфигурацию такого репозитория (если она отсутствует), добавьте следующее в [.filename]#/usr/local/etc/pkg/repos/kmods.conf#:
