Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/ports/_index.po
Languages: ko, ru

source: Before performing an upgrade using this utility, it is recommended to scan the list of installed ports using `pkgdb -F` and to fix all the inconsistencies it reports.
ko: 이 유틸리티를 사용하여 업그레이드를 수행하기 전에 `pkgdb -F`를 사용하여 설치된 포트 목록을 검사하고 보고된 모든 불일치를 수정하는 것이 좋습니다.
ru: Прежде чем выполнять обновление с помощью этой утилиты, рекомендуется проверить список установленных портов с помощью `pkgdb -F` и исправить все обнаруженные несоответствия.

source: To upgrade all the outdated ports installed on the system, use `portupgrade -a`. Alternately, include `-i` to be asked for confirmation of every individual upgrade:
ko: 시스템에 설치된 모든 오래된 포트를 업그레이드하려면 `portupgrade -a`를 사용합니다. 또는 모든 개별 업그레이드에 대한 확인을 요청하려면 `-i`를 포함하세요:
ru: Для обновления всех устаревших портов, установленных в системе, используйте `portupgrade -a`. Или добавьте `-i` для запроса подтверждения каждого обновления:

source: To upgrade only a specified application instead of all available ports, use `portupgrade _pkgname_`. It is very important to include `-R` to first upgrade all the ports required by the given application:
ko: 사용 가능한 모든 포트 대신 지정된 애플리케이션만 업그레이드하려면 `portupgrade _pkgname_`을 사용합니다. 지정된 애플리케이션에 필요한 모든 포트를 먼저 업그레이드하려면 `-R`을 포함시키는 것이 매우 중요합니다:
ru: Для обновления только указанного приложения вместо всех доступных портов используйте `portupgrade _pkgname_`. Очень важно включить опцию `-R`, чтобы сначала обновить все порты, необходимые для данного приложения:

source: If `-P` is included, Portupgrade searches for available packages in the local directories listed in `PKG_PATH`. If none are available locally, it then fetches packages from a remote site. If packages can not be found locally or fetched remotely, Portupgrade will use ports. To avoid using ports entirely, specify `-PP`. This last set of options tells Portupgrade to abort if no packages are available:
ko: 만약 `-P`가 포함되어 있다면, 포트업그레이드는 `PKG_PATH`에 나열된 로컬 디렉터리에서 사용 가능한 패키지를 검색합니다. 로컬에서 사용할 수 있는 패키지가 없으면 원격 사이트에서 패키지를 가져옵니다. 로컬에서 패키지를 찾을 수 없거나 원격에서 패키지를 가져올 수 없는 경우 Portupgrade는 포트를 사용합니다. 포트를 완전히 사용하지 않으려면 `-PP`를 지정합니다. 이 마지막 옵션 세트는 사용 가능한 패키지가 없는 경우 Portupgrade가 중단하도록 지시합니다:
ru: Если указан `-P`, Portupgrade ищет доступные пакеты в локальных каталогах, перечисленных в `PKG_PATH`. Если локально пакеты не найдены, он загружает их с удалённого сайта. Если пакеты не могут быть найдены локально или загружены удалённо, Portupgrade использует порты. Чтобы полностью избежать использования портов, укажите `-PP`. Последний набор опций предписывает Portupgrade прервать работу, если пакеты недоступны:

source: To just fetch the port distfiles, or packages, if `-P` is specified, without building or installing anything, use `-F`. For further information on all of the available switches, refer to the manual page for `portupgrade`.
ko: 아무것도 빌드하거나 설치하지 않고 포트 배포 파일 또는 패키지만 가져오려면 `-P`가 지정된 경우 `-F`를 사용합니다. 사용 가능한 모든 스위치에 대한 자세한 내용은 `portupgrade` 매뉴얼 페이지를 참조하세요.
ru: Чтобы только загрузить distfiles портов или пакеты (если указан `-P`), без сборки или установки, используйте `-F`. Для получения дополнительной информации о всех доступных опциях обратитесь к руководству `portupgrade`.

source: More information about package:ports-mgmt/portupgrade[] may be found in its `pkg-descr`.
ko: package:ports-mgmt/portupgrade[]에 대한 자세한 내용은 `pkg-descr`에서 확인할 수 있습니다.
ru: Дополнительную информацию о package:ports-mgmt/portupgrade[] можно найти в его `pkg-descr`.

source: Ports and Disk Space
ko: 포트와 디스크 공간
ru: Порты и дисковое пространство

source: Using the Ports Collection will use up disk space over time. After building and installing a port, running `make clean` within the ports skeleton will clean up the temporary `work` directory. If Portmaster is used to install a port, it will automatically remove this directory unless `-K` is specified. If Portupgrade is installed, this command will remove all `work` directories found within the local copy of the Ports Collection:
ko: 포트 컬렉션을 사용하면 시간이 지남에 따라 디스크 공간이 소모됩니다. 포트를 빌드하고 설치한 후, 포트 스켈레톤 내에서 `make clean`을 실행하면 임시 `work` 디렉터리가 정리됩니다. 포트 마스터를 사용하여 포트를 설치하는 경우 `-K`를 지정하지 않으면 이 디렉터리가 자동으로 제거됩니다. 포트업그레이드가 설치된 경우, 이 명령은 포트 컬렉션의 로컬 복사본에 있는 모든 `work` 디렉터리를 제거합니다:
ru: Использование коллекции портов со временем приводит к расходу дискового пространства. После сборки и установки порта выполнение команды `make clean` в скелете порта очистит временный каталог `work`. При использовании Portmaster для установки порта этот каталог будет удалён автоматически, если не указан параметр `-K`. Если установлен Portupgrade, следующая команда удалит все каталоги `work` в локальной копии коллекции портов:

source: In addition, outdated source distribution files accumulate in `/usr/ports/distfiles` over time. To use Portupgrade to delete all the distfiles that are no longer referenced by any ports:
ko: 또한 오래된 소스 배포 파일은 시간이 지남에 따라 `/usr/ports/distfiles`에 누적됩니다. 포트업그레이드를 사용하여 더 이상 포트에서 참조하지 않는 모든 dist파일을 삭제할 수 있습니다:
ru: Кроме того, устаревшие файлы исходных дистрибутивов со временем накапливаются в `/usr/ports/distfiles`. Чтобы использовать Portupgrade для удаления всех distfiles, на которые больше нет ссылок из портов:

source: Portupgrade can remove all distfiles not referenced by any port currently installed on the system:
ko: 포트 업그레이드는 현재 시스템에 설치된 포트에서 참조하지 않는 모든 dist파일을 제거할 수 있습니다:
ru: Portupgrade может удалить все distfiles, на которые нет ссылок из портов, установленных в системе:

source: If Portmaster is installed, use:
ko: 포트마스터가 설치되어 있는 경우 사용하세요:
ru: Если установлен Portmaster, используйте:

source: By default, this command is interactive and prompts the user to confirm if a distfile should be deleted.
ko: 기본적으로 이 명령은 대화형이며 사용자에게 distfile을 삭제할지 확인하라는 메시지를 표시합니다.
ru: По умолчанию эта команда интерактивна и запрашивает подтверждение пользователя на удаление distfile.

source: In addition to these commands, package:ports-mgmt/pkg_cutleaves[] automates the task of removing installed ports that are no longer needed.
ko: 이러한 명령 외에도 package:ports-mgmt/pkg_cutleaves[]는 더 이상 필요하지 않은 설치된 포트를 제거하는 작업을 자동화합니다.
ru: В дополнение к этим командам, package:ports-mgmt/pkg_cutleaves[] автоматизирует задачу удаления установленных портов, которые больше не нужны.

source: Building Packages with poudriere
ru: Сборка пакетов с poudriere

source: poudriere is a `BSD`-licensed utility for creating and testing FreeBSD packages. It uses FreeBSD jails to set up isolated compilation environments. These jails can be used to build packages for versions of FreeBSD that are different from the system on which it is installed, and also to build packages for i386 if the host is an amd64 system. Once the packages are built, they are in a layout identical to the official mirrors. These packages are usable by man:pkg[8] and other package management tools.
ru: poudriere — это утилита с лицензией `BSD` для создания и тестирования пакетов FreeBSD. Она использует механизм jail в FreeBSD для настройки изолированных сред сборки. Эти jail могут использоваться для сборки пакетов для версий FreeBSD, отличных от версии системы, на которой установлена poudriere, а также для сборки пакетов под i386 на хосте с архитектурой amd64. После сборки пакеты располагаются в структуре, идентичной официальным зеркалам. Эти пакеты могут использоваться man:pkg[8] и другими инструментами управления пакетами.

source: poudriere is installed using the package:ports-mgmt/poudriere[] package or port. The installation includes a sample configuration file `/usr/local/etc/poudriere.conf.sample`. Copy this file to `/usr/local/etc/poudriere.conf`. Edit the copied file to suit the local configuration.
ru: poudriere устанавливается с помощью пакета package:ports-mgmt/poudriere[] или порта. Установка включает пример файла конфигурации `/usr/local/etc/poudriere.conf.sample`. Скопируйте этот файл в `/usr/local/etc/poudriere.conf`. Отредактируйте скопированный файл в соответствии с локальной конфигурацией.

source: While `ZFS` is not required on the system running poudriere, it is beneficial. When `ZFS` is used, `ZPOOL` must be specified in `/usr/local/etc/poudriere.conf` and `FREEBSD_HOST` should be set to a nearby mirror. Defining `CCACHE_DIR` enables the use of package:devel/ccache[] to cache compilation and reduce build times for frequently-compiled code. It may be convenient to put poudriere datasets in an isolated tree mounted at `/poudriere`. Defaults for the other configuration values are adequate.
ko: Poudriere를 실행하는 시스템에서 `ZFS`가 반드시 필요한 것은 아니지만, 도움이 됩니다. `ZFS`를 사용하는 경우 `/usr/local/etc/poudriere.conf`에 `ZPOOL`을 지정하고 `FREEBSD_HOST`를 가까운 미러로 설정해야 합니다. `CCACHE_DIR`을 정의하면 package:dev/ccache[]를 사용하여 컴파일을 캐시하고 자주 컴파일하는 코드의 빌드 시간을 단축할 수 있습니다. Poudriere 데이터세트를 `/poudriere`에 마운트된 격리 트리에 넣는 것이 편리할 수 있습니다. 다른 구성 값은 기본값으로 충분합니다.
ru: Хотя `ZFS` не является обязательным для системы, на которой запущен poudriere, его использование дает преимущества. При использовании `ZFS` необходимо указать `ZPOOL` в `/usr/local/etc/poudriere.conf`, а `FREEBSD_HOST` следует установить на ближайшее зеркало. Определение `CCACHE_DIR` позволяет использовать package:devel/ccache[] для кэширования компиляции и сокращения времени сборки часто компилируемого кода. Может быть удобно разместить наборы данных poudriere в изолированном дереве, смонтированном в `/poudriere`. Значения по умолчанию для остальных параметров конфигурации являются приемлемыми.

source: The number of processor cores detected is used to define how many builds will run in parallel. Supply enough virtual memory, either with `RAM` or swap space. If virtual memory runs out, the compilation jails will stop and be torn down, resulting in weird error messages.
ko: 감지된 프로세서 코어 수는 병렬로 실행할 빌드 수를 정의하는 데 사용됩니다. `RAM` 또는 스왑 공간으로 충분한 가상 메모리를 제공하세요. 가상 메모리가 부족하면 컴파일 자일이 중지되고 해체되어 이상한 오류 메시지가 표시됩니다.
ru: Количество обнаруженных ядер процессора определяет, сколько сборок будет выполняться параллельно. Обеспечьте достаточный объем виртуальной памяти, используя `RAM` или файл подкачки. Если виртуальная память закончится, компиляционные окружения остановятся и будут уничтожены, что приведёт к странным сообщениям об ошибках.

source: Initialize Jails and Port Trees
ko: Jail과 포트 트리 초기화
ru: Инициализация Jail и дерева портов

source: After configuration, initialize poudriere so that it installs a jail with the required FreeBSD tree and a ports tree. Specify a name for the jail using `-j` and the FreeBSD version with `-v`. On systems running FreeBSD/amd64, the architecture can be set with `-a` to either `i386` or `amd64`. The default is the architecture shown by `uname`.
ko: 구성이 끝나면, 필요한 FreeBSD 트리와 포트 트리가 있는 Jail을 설치하도록 poudriere를 초기화합니다. `-j`를 사용하여 jail의 이름을 지정하고 `-v`로 FreeBSD 버전을 지정합니다. FreeBSD/amd64를 실행하는 시스템에서는 `-a`를 사용하여 아키텍처를 `i386` 또는 `amd64`로 설정할 수 있습니다. 기본값은 `uname`으로 표시된 아키텍처입니다.
ru: После настройки инициализируйте poudriere, чтобы он установил jail с требуемым деревом FreeBSD и деревом портов. Укажите имя для jail с помощью `-j`, а версию FreeBSD — с помощью `-v`. На системах под управлением FreeBSD/amd64 архитектуру можно задать с помощью `-a`, указав `i386` или `amd64`. По умолчанию используется архитектура, отображаемая командой `uname`.

source: On a single computer, poudriere can build ports with multiple configurations, in multiple jails, and from different port trees. Custom configurations for these combinations are called _sets_. See the CUSTOMIZATION section of man:poudriere[8] for details after package:ports-mgmt/poudriere[] or package:ports-mgmt/poudriere-devel[] is installed.
ko: 한 대의 컴퓨터에서 poudriere는 여러 구성, 여러 Jail, 여러 포트 트리로 포트를 빌드할 수 있습니다. 이러한 조합에 대한 사용자 지정 구성을 _sets_라고 합니다. package:ports-mgmt/poudriere[]또는 package:ports-mgmt/poudriere-devel[]을 설치한 후 자세한 내용은 man:poudriere[8]의 CUSTOMIZATION 섹션을 참조하세요.
ru: На одном компьютере poudriere может собирать порты с различными конфигурациями, в нескольких jail и из разных деревьев портов. Пользовательские конфигурации для таких комбинаций называются _наборами_. Подробности смотрите в разделе CUSTOMIZATION руководства man:poudriere[8] после установки package:ports-mgmt/poudriere[] или package:ports-mgmt/poudriere-devel[].

source: The basic configuration shown here puts a single jail-, port-, and set-specific `make.conf` in `/usr/local/etc/poudriere.d`. The filename in this example is created by combining the jail name, port name, and set name: `13amd64-local-workstation-make.conf`. The system `make.conf` and this new file are combined at build time to create the `make.conf` used by the build jail.
ko: 여기에 표시된 기본 구성은 `/usr/local/etc/poudriere.d`에 단일 jail, 포트 및 세트별 `make.conf`를 넣습니다. 이 예제에서 파일 이름은 jail 이름, 포트 이름 및 세트 이름을 결합하여 `13amd64-local-workstation-make.conf`로 생성됩니다. 빌드시 시스템 `make.conf`와 이 새 파일을 결합하여 Jail을 빌드 할 때 사용할 `make.conf`를 생성합니다.
ru: Базовая конфигурация, представленная здесь, размещает отдельные файлы `make.conf` для каждого jail, порта и набора в `/usr/local/etc/poudriere.d`. Имя файла в этом примере формируется путем объединения имени jail, имени порта и имени набора: `13amd64-local-workstation-make.conf`. Системный `make.conf` и этот новый файл объединяются во время сборки, чтобы создать `make.conf`, используемый build jail.

source: Packages to be built are entered in `13amd64-local-workstation-pkglist` (ports with extref:{porters-handbook}flavors[FLAVORS] can be defined with @FLAVOR):
ru: Пакеты для сборки указываются в файле `13amd64-local-workstation-pkglist` (для портов с extref:{porters-handbook}flavors[FLAVORS] можно указать @FLAVOR):

source: Options and dependencies for the specified ports are configured:
ko: 지정된 포트에 대한 옵션 및 종속성이 구성됩니다:
ru: Настраиваются параметры и зависимости для указанных портов:

source: Finally, packages are built and a package repository is created:
ko: 마지막으로 패키지가 빌드되고 패키지 리포지토리가 생성됩니다:
ru: Наконец, пакеты собираются и создается репозиторий пакетов:

source: While running, pressing kbd:[Ctrl+t] displays the current state of the build. poudriere also builds files in `/poudriere/logs/bulk/jailname` that can be used with a web server to display build information.
ru: Во время работы нажатие kbd:[Ctrl+t] отображает текущее состояние сборки. poudriere также создает файлы в `/poudriere/logs/bulk/jailname`, которые можно использовать с веб-сервером для отображения информации о сборке.

source: After completion, the new packages are now available for installation from the poudriere repository.
ko: 완료 후 새 패키지는 이제 poudriere 리포지토리에서 설치할 수 있습니다.
ru: По завершении новые пакеты становятся доступными для установки из репозитория poudriere.

source: For more information on using poudriere, see man:poudriere[8] and the main web site, https://github.com/freebsd/poudriere/wiki[].
ko: Poudriere 사용에 대한 자세한 내용은 man:poudriere[8] 및 기본 웹 사이트 https://github.com/freebsd/poudriere/wiki[]를 참조하세요.
ru: Для получения дополнительной информации об использовании poudriere см. man:poudriere[8] и основной веб-сайт: https://github.com/freebsd/poudriere/wiki[].

source: Configuring pkg Clients to Use a poudriere Repository
ru: Настройка клиентов pkg для использования репозитория poudriere

source: While it is possible to use both a custom repository along side of the official repository, sometimes it is useful to disable the official repository. This is done by creating a configuration file that overrides and disables the official configuration file. Create `/usr/local/etc/pkg/repos/FreeBSD.conf` that contains the following:
ko: 공식 리포지토리와 사용자 지정 리포지토리를 함께 사용할 수 있지만, 때로는 공식 리포지토리를 비활성화하는 것이 유용할 수 있습니다. 이 경우 공식 구성 파일을 재정의하고 비활성화하는 구성 파일을 생성하면 됩니다. 다음 내용이 포함된 `/usr/local/etc/pkg/repos/FreeBSD.conf`를 생성합니다:
ru: Хотя можно использовать как пользовательский репозиторий вместе с официальным, иногда полезно отключить официальный репозиторий. Это делается путём создания конфигурационного файла, который переопределяет и отключает официальный конфигурационный файл. Создайте `/usr/local/etc/pkg/repos/FreeBSD.conf` со следующим содержимым:

source: Usually it is easiest to serve a poudriere repository to the client machines via HTTP. Set up a webserver to serve up the package directory, for instance: `/usr/local/poudriere/data/packages/13amd64`, where `13amd64` is the name of the build.
ko: 일반적으로 HTTP를 통해 클라이언트 머신에 Poudriere 리포지토리를 제공하는 것이 가장 쉽습니다. 패키지 디렉터리를 제공하도록 웹서버를 설정합니다(예: `/usr/local/poudriere/data/packages/13amd64`, 여기서 `13amd64`는 빌드 이름입니다).
ru: Обычно проще всего предоставлять доступ к репозиторию poudriere клиентским машинам через HTTP. Настройте веб-сервер для обслуживания каталога пакетов, например: `/usr/local/poudriere/data/packages/13amd64`, где `13amd64` — это название сборки.

source: If the URL to the package repository is: `http://pkg.example.com/13amd64`, then the repository configuration file in `/usr/local/etc/pkg/repos/custom.conf` would look like:
ko: 패키지 리포지토리의 URL이 `http://pkg.example.com/13amd64`인 경우 `/usr/local/etc/pkg/repos/custom.conf`에 있는 리포지토리 구성 파일은 다음과 같을 것입니다:
ru: Если URL репозитория пакетов: `http://pkg.example.com/13amd64`, то файл конфигурации репозитория в `/usr/local/etc/pkg/repos/custom.conf` будет выглядеть так:

source: If exposing the package repository to the internet is not desired, the `file://` protocol can be used to point to the repository directly:
ru: Если нежелательно предоставлять доступ к репозиторию пакетов через интернет, можно использовать протокол `file://` для прямого указания на репозиторий:

source: Post-Installation Considerations
ko: 설치 후 고려 사항
ru: Пост-установочные вопросы

source: Regardless of whether the software was installed from a binary package or port, most third-party applications require some level of configuration after installation. The following commands and locations can be used to help determine what was installed with the application.
ko: 소프트웨어가 바이너리 패키지 또는 포트에서 설치되었는지 여부에 관계없이 대부분의 타사 애플리케이션은 설치 후 어느 정도 수준의 구성이 필요합니다. 다음 명령어와 파일 위치를 사용하여 애플리케이션과 함께 설치된 항목을 확인할 수 있습니다.
ru: Независимо от того, было ли программное обеспечение установлено из бинарного пакета или порта, большинство сторонних приложений требуют некоторой настройки после установки. Следующие команды и расположения могут помочь определить, что было установлено вместе с приложением.

source: Most applications install at least one default configuration file in `/usr/local/etc`. In cases where an application has a large number of configuration files, a subdirectory will be created to hold them. Often, sample configuration files are installed which end with a suffix such as `.sample`. The configuration files should be reviewed and possibly edited to meet the system's needs. To edit a sample file, first copy it without the `.sample` extension.
ko: 대부분의 애플리케이션은 `/usr/local/etc`에 하나 이상의 기본 구성 파일을 설치합니다. 애플리케이션에 많은 수의 구성 파일이 있는 경우 하위 디렉터리가 생성되어 해당 파일을 보관합니다. 종종 `.sample`과 같은 접미사로 끝나는 샘플 구성 파일이 설치됩니다. 구성 파일을 검토하고 시스템의 요구 사항을 충족하도록 편집해야 할 수도 있습니다. 샘플 파일을 편집하려면 먼저 `.sample` 확장자 없이 복사하세요.
ru: Большинство приложений устанавливают как минимум один конфигурационный файл по умолчанию в `/usr/local/etc`. В случаях, когда приложение имеет большое количество конфигурационных файлов, создаётся подкаталог для их хранения. Часто устанавливаются примеры конфигурационных файлов, которые имеют окончание, например, `.sample`. Конфигурационные файлы следует просмотреть и, возможно, отредактировать в соответствии с потребностями системы. Для редактирования файла-примера сначала скопируйте его без расширения `.sample`.

source: Applications which provide documentation will install it into `/usr/local/share/doc` and many applications also install manual pages. This documentation should be consulted before continuing.
ko: 설명서를 제공하는 애플리케이션은 `/usr/local/share/doc`에 설치하며, 많은 애플리케이션이 설명서 페이지도 동시에 설치합니다. 계속하기 전에 이 설명서도 참조하세요.
ru: Приложения, которые предоставляют документацию, устанавливают её в `/usr/local/share/doc`, а многие приложения также устанавливают страницы руководств. Перед продолжением следует ознакомиться с этой документацией.

source: Some applications run services which must be added to `/etc/rc.conf` before starting the application. These applications usually install a startup script in `/usr/local/etc/rc.d`. See crossref:config[configtuning-starting-services,Starting Services] for more information.
ko: 일부 애플리케이션은 애플리케이션을 시작하기 전에 `/etc/rc.conf`에 서비스를 반드시 추가해야 합니다. 이러한 애플리케이션은 일반적으로 `/usr/local/etc/rc.d`에 시작 스크립트를 설치합니다. 자세한 내용은 crossref:config[configtuning-starting-services,Starting Services]을 참조하세요.
ru: Некоторые приложения запускают службы, которые необходимо добавить в `/etc/rc.conf` перед запуском приложения. Обычно такие приложения устанавливают скрипт запуска в `/usr/local/etc/rc.d`. Дополнительную информацию можно найти в crossref:config[configtuning-starting-services,Запуск служб].

source: By design, applications do not run their startup script upon installation, nor do they run their stop script upon deinstallation or upgrade. This decision is left to the individual system administrator.
ko: 설계상 애플리케이션은 설치 시 시작 스크립트를 실행하지 않으며, 제거 또는 업그레이드 시에도 중지 스크립트를 실행하지 않습니다. 이 결정은 개별 시스템 관리자에게 맡겨져 있습니다.
ru: По замыслу, приложения не запускают свои стартовые скрипты при установке, а также не выполняют скрипты остановки при удалении или обновлении. Это решение остается на усмотрение системного администратора.

source: Users of man:csh[1] should run `rehash` to rebuild the known binary list in the shells `PATH`.
ko: man:csh[1]의 사용자는 `rehash`를 실행하여 `PATH` 셸에서 알려진 바이너리 목록을 다시 빌드해야 합니다.
ru: Пользователи man:csh[1] должны выполнить `rehash`, чтобы перестроить список известных двоичных файлов в `PATH` оболочки.

source: Use `pkg info` to determine which files, man pages, and binaries were installed with the application.
ko: `pkg info`를 사용하여 애플리케이션과 함께 설치된 파일, 매뉴얼 페이지 및 바이너리를 확인합니다.
ru: Используйте `pkg info`, чтобы определить, какие файлы, man-страницы и бинарные файлы были установлены вместе с приложением.

source: Dealing with Broken Ports
ko: 손상된 포트 처리하기
ru: Работа с неработающими портами

source: When a port does not build or install, try the following:
ko: 포트가 빌드 또는 설치되지 않으면 다음을 시도해 보세요:
ru: Когда порт не собирается или не устанавливается, попробуйте следующее:

source: Search to see if there is a fix pending for the port in the link:https://www.FreeBSD.org/support/[Problem Report database]. If so, implementing the proposed fix may fix the issue.
ko: link:https://www.FreeBSD.org/support/[Problem Report database]에서 해당 포트에 대해 보류 중인 수정 사항이 있는지 검색합니다. 그렇다면 제안된 수정 사항을 적용하면 문제가 해결될 수 있습니다.
ru: Поищите, есть ли исправление для порта в базе данных link:https://www.FreeBSD.org/support/[отчётов о проблемах]. Если оно есть, применение предложенного исправления может решить проблему.

source: Ask the maintainer of the port for help. Type `make maintainer` in the ports skeleton or read the port's `Makefile` to find the maintainer's email address. Remember to include the output leading up to the error in the email to the maintainer.
ko: 포트의 관리자에게 도움을 요청하세요. 포트 스켈레톤에 `make maintainer`를 입력하거나 포트의 `Makefile`을 읽어 관리자의 이메일 주소를 찾습니다. 관리자에게 보내는 이메일에 오류의 원인이 되는 출력을 포함해야 한다는 것을 잊지 마세요.
ru: Обратитесь к сопровождающему порта за помощью. Введите `make maintainer` в скелете портов или прочитайте `Makefile` порта, чтобы найти адрес электронной почты сопровождающего. Не забудьте включить вывод, предшествующий ошибке, в письмо сопровождающему.
