Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/ports/_index.po
Languages: ko, ru

source: `KMODSFLAVOR` respects the following pattern: `kmods_PORTBRANCH_MINORRELEASE`.
ru: Переменная `KMODSFLAVOR` использует следующий шаблон именования: `kmods_PORTBRANCH_MINORRELEASE`.

source: For instance:
ru: Например:

source: FreeBSD Release
ru: Релиз FreeBSD

source: ports main
ru: главные порты

source: ports quarterly
ru: квартальные порты

source: Configure pkg
ko: 패키지 구성하기
ru: Настройка pkg

source: man:pkg.conf[5] is the system-wide configuration file used by the man:pkg[8] tools. The default location of this file is `/usr/local/etc/pkg.conf`.
ru: man:pkg.conf[5] — это общесистемный конфигурационный файл, используемый утилитами man:pkg[8]. Стандартное расположение этого файла — `/usr/local/etc/pkg.conf`.

source: FreeBSD does not need to have a `pkg.conf` file. Many installations will work well with no `pkg.conf` at all or with an empty `pkg.conf` (other than comment lines).
ko: FreeBSD에는 `pkg.conf` 파일이 필요하지 않습니다. 대부분의 설치는 `pkg.conf`가 전혀 없거나 (주석 줄을 제외한) 빈 `pkg.conf`로도 잘 작동합니다.
ru: FreeBSD не требует наличия файла `pkg.conf`. Многие установки будут работать без `pkg.conf` вообще или с пустым `pkg.conf` (за исключением строк с комментариями).

source: Lines in the file beginning with a "#" are comments and are ignored.
ko: 파일에서 "#"으로 시작하는 줄은 주석이며 무시됩니다.
ru: Строки в файле, начинающиеся с символа "#", являются комментариями и игнорируются.

source: The file is in UCL format. For more information on the syntax of man:libucl[3], please visit the link:https://github.com/vstakhov/libucl[official UCL website].
ko: 파일은 UCL 형식입니다. man:libucl[3]의 구문에 대한 자세한 내용은 link:https://github.com/vstakhov/libucl[official UCL website]를 참조하세요.
ru: Файл имеет формат UCL. Для получения дополнительной информации о синтаксисе man:libucl[3] посетите link:https://github.com/vstakhov/libucl[официальный сайт UCL].

source: The following types of options are recognized - boolean, string and list options.
ko: 부울, 문자열 및 목록 옵션이 인식되는 옵션 유형은 다음과 같습니다.
ru: Распознаются следующие типы опций - логические, строковые и списковые.

source: A boolean option is marked as enabled if one of the following values is specified in the configuration file - YES, TRUE and ON.
ko: 부울 옵션은 구성 파일에 YES, TRUE, ON 중 하나의 값이 지정되면 활성화된 것으로 표시됩니다.
ru: Логическая опция считается включённой, если в файле конфигурации указано одно из следующих значений: YES, TRUE или ON.

source: Searching Packages
ko: 패키지 검색하기
ru: Поиск пакетов

source: To search a package man:pkg-search[8] can be used:
ko: 패키지를 검색하려면 man:pkg-search[8]를 사용합니다:
ru: Для поиска пакета можно использовать man:pkg-search[8]:

source: Installing and Fetching Packages
ko: 패키지 가져오기 및 설치하기
ru: Установка и загрузка пакетов

source: To install a binary package man:pkg-install[8] can be used. This command uses repository data to determine which version of the software to install and if it has any uninstalled dependencies. For example, to install curl:
ko: 바이너리 패키지를 설치하려면 man:pkg-install[8]을 사용합니다. 이 명령은 리포지토리 데이터를 사용하여 설치할 소프트웨어의 버전과 제거된 종속성이 있는지 확인합니다. 예를 들어 curl을 설치하려면:
ru: Для установки бинарного пакета можно использовать man:pkg-install[8]. Эта команда использует данные репозитория для определения версии программного обеспечения, которую нужно установить, а также наличия неустановленных зависимостей. Например, для установки curl:

source: The new package and any additional packages that were installed as dependencies can be seen in the installed packages list:
ko: 새 패키지와 종속성으로 설치된 모든 추가 패키지는 설치된 패키지 목록에서 확인할 수 있습니다:
ru: Новый пакет и любые дополнительные пакеты, установленные в качестве зависимостей, можно увидеть в списке установленных пакетов:

source: To fetch a package and install it later or in another place use man:pkg-fetch[8]. For example, to download `nginx-lite`:
ko: 패키지를 가져와 나중에 또는 다른 위치에 설치하려면 man:pkg-fetch[8]을 사용합니다. 예를 들어, `nginx-lite`를 다운로드하려면:
ru: Для загрузки пакета с последующей установкой позже или в другом месте используйте man:pkg-fetch[8]. Например, чтобы скачать `nginx-lite`:

source: `-d`: used to fetch all the dependencies
ko: `-d`: 모든 종속성을 가져오는 데 사용됩니다
ru: `-d`: используется для получения всех зависимостей

source: `-o`: used to specify the download directory
ko: `-o`: 다운로드 디렉터리를 지정하는 데 사용됩니다
ru: `-o`: используется для указания каталога загрузки

source: To install the downloaded packages man:pkg-install[8] can be used as follows:
ko: 다운로드한 패키지를 설치하려면 다음과 같이 man:pkg-install[8]을 사용합니다:
ru: Для установки загруженных пакетов можно использовать man:pkg-install[8] следующим образом:

source: Obtaining Information About Installed Packages
ko: 설치된 패키지에 대한 정보 얻기
ru: Получение информации об установленных пакетах

source: Information about the packages installed on a system can be viewed by running man:pkg-info[8] which, when run without any switches, will list the package version for either all installed packages or the specified package.
ko: 시스템에 설치된 패키지에 대한 정보는 man:pkg-info[8]를 실행하여 확인할 수 있으며, 스위치 없이 실행하면 설치된 모든 패키지 또는 지정된 패키지에 대한 패키지 버전이 나열됩니다.
ru: Информацию об установленных в системе пакетах можно просмотреть с помощью команды man:pkg-info[8], которая при запуске без каких-либо параметров выводит версию пакета для всех установленных пакетов или указанного пакета.

source: For example, to see which version of pkg is installed, run:
ko: 예를 들어 설치된 pkg 버전을 확인하려면 다음을 실행합니다:
ru: Например, чтобы узнать, какая версия pkg установлена, выполните:

source: Upgrading Installed Packages
ko: 설치된 패키지 업그레이드 하기
ru: Обновление установленных пакетов

source: Installed packages can be upgraded to their latest versions using man:pkg-upgrade[8]:
ko: 설치된 패키지는 man:pkg-upgrade[8]를 사용하여 최신 버전으로 업그레이드할 수 있습니다:
ru: Установленные пакеты можно обновить до их последних версий с помощью man:pkg-upgrade[8]:

source: This command will compare the installed versions with those available in the repository catalogue and upgrade them from the repository.
ko: 이 명령은 설치된 버전을 리포지토리 카탈로그에서 사용 가능한 버전과 비교하여 리포지토리에서 업그레이드합니다.
ru: Эта команда сравнит установленные версии с доступными в каталоге репозитория и обновит их из репозитория.

source: Auditing Installed Packages
ko: 설치된 패키지 감사하기
ru: Проверка установленных пакетов

source: Software vulnerabilities are regularly discovered in third-party applications. To address this, pkg includes a built-in auditing mechanism. To determine if there are any known vulnerabilities for the software installed on the system, use man:pkg-audit[8]:
ko: 소프트웨어 취약점은 타사 애플리케이션에서 정기적으로 발견됩니다. 이 문제를 해결하기 위해 pkg에는 감사 메커니즘이 내장되어 있습니다. 시스템에 설치된 소프트웨어에 알려진 취약점이 있는지 확인하려면 man:pkg-audit[8]을 사용하세요:
ru: Уязвимости в программном обеспечении регулярно обнаруживаются в сторонних приложениях. Для решения этой проблемы pkg включает встроенный механизм аудита. Чтобы определить, есть ли известные уязвимости для программного обеспечения, установленного в системе, используйте man:pkg-audit[8]:

source: Removing Packages
ko: 패키지 제거하기
ru: Удаление пакетов

source: Packages that are no longer needed can be removed with man:pkg-delete[8].
ko: 더 이상 필요하지 않은 패키지는 man:pkg-delete[8]로 제거할 수 있습니다.
ru: Пакеты, которые больше не нужны, можно удалить с помощью man:pkg-delete[8].

source: For example:
ko: 예를 들면:
ru: Например:

source: Automatically Removing Unused Packages
ko: 사용하지 않는 패키지 자동 제거하기
ru: Автоматическое удаление неиспользуемых пакетов

source: Removing a package may leave behind dependencies which are no longer required. Unneeded packages that were installed as dependencies (leaf packages) can be automatically detected and removed using man:pkg-autoremove[8]:
ko: 패키지를 제거하면 더 이상 필요하지 않은 의존성이 남을 수 있습니다. 종속성(leaf packages)으로 설치된 불필요한 패키지는 man:pkg-autoremove[8]를 사용하여 자동으로 감지하고 제거할 수 있습니다:
ru: Удаление пакета может оставить зависимости, которые больше не требуются. Ненужные пакеты, установленные как зависимости (листовые пакеты), могут быть автоматически обнаружены и удалены с помощью man:pkg-autoremove[8]:

source: Packages installed as dependencies are called _automatic_ packages. Non-automatic packages, i.e the packages that were explicitly installed not as a dependency to another package, can be listed using:
ru: Установленные в качестве зависимостей пакеты называются _автоматическими_ пакетами. Неавтоматические пакеты, то есть пакеты, которые были явно установлены не в качестве зависимости для другого пакета, можно вывести с помощью:

source: `pkg prime-list` is an alias command declared in `/usr/local/etc/pkg.conf`. There are many others that can be used to query the package database of the system. For instance, command `pkg prime-origins` can be used to get the origin port directory of the list mentioned above:
ko: `pkg prime-list`는 `/usr/local/etc/pkg.conf`에 선언된 별칭 명령어(alias command)입니다. 시스템의 패키지 데이터베이스를 쿼리하는 데 사용할 수 있는 다른 많은 명령이 있습니다. 예를 들어, `pkg prime-origins` 명령은 위에서 언급한 목록의 오리진 포트 디렉터리를 가져오는 데 사용할 수 있습니다:
ru: `pkg prime-list` — это псевдоним команды, объявленный в `/usr/local/etc/pkg.conf`. Существует множество других команд, которые можно использовать для запросов к базе данных пакетов системы. Например, команда `pkg prime-origins` позволяет получить каталог портов происхождения для упомянутого выше списка:

source: This list can be used to rebuild all packages installed on a system using build tools such as package:ports-mgmt/poudriere[] or package:ports-mgmt/synth[].
ko: 이 목록은 package:ports-mgmt/poudriere[] 또는 package:ports-mgmt/synth[] 등의 빌드 툴을 사용하여 시스템에 설치된 모든 패키지를 다시 빌드하는 데 사용할 수 있습니다.
ru: Этот список можно использовать для пересборки всех пакетов, установленных в системе, с помощью инструментов сборки, таких как package:ports-mgmt/poudriere[] или package:ports-mgmt/synth[].

source: Marking an installed package as automatic can be done using:
ko: 설치된 패키지를 자동으로 표시하는 것은 다음을 사용하여 수행할 수 있습니다:
ru: Пометить установленный пакет как автоматический можно с помощью:

source: Once a package is a leaf package and is marked as automatic, it gets selected by `pkg autoremove`.
ko: 패키지가 리프 패키지이고 자동으로 표시되면 `pkg autoremove`에 의해 선택됩니다.
ru: Как только пакет становится листовым и помечается как автоматический, он выбирается командой `pkg autoremove`.

source: Marking an installed package as _not_ automatic can be done using:
ko: 설치된 패키지를 _비 자동_ 패키지로 표시하는 방법은 다음과 같습니다:
ru: Пометить установленный пакет как _не_ автоматический можно с помощью:

source: Removing Stale Packages
ko: 오래된 패키지 제거하기
ru: Удаление устаревших пакетов

source: By default, pkg stores binary packages in a cache directory defined by `PKG_CACHEDIR` in man:pkg.conf[5]. Only copies of the latest installed packages are kept. Older versions of pkg kept all previous packages. To remove these outdated binary packages, run:
ko: 기본적으로 pkg는 바이너리 패키지를 man:pkg.conf[5]의 `PKG_CACHEDIR`에 정의된 캐시 디렉터리에 저장합니다. 설치된 최신 패키지의 사본만 보관됩니다. 이전 버전의 pkg는 모든 이전 패키지를 유지합니다. 이러한 오래된 바이너리 패키지를 제거하려면 다음을 실행합니다:
ru: По умолчанию pkg хранит бинарные пакеты в кэш-каталоге, определённом параметром `PKG_CACHEDIR` в man:pkg.conf[5]. Сохраняются только копии последних установленных пакетов. В более старых версиях pkg сохранялись все предыдущие пакеты. Чтобы удалить устаревшие бинарные пакеты, выполните:

source: The entire cache may be cleared by running:
ko: 다음을 실행하면 전체 캐시가 지워질 수 있습니다:
ru: Весь кэш может быть очищен выполнением команды:

source: Locking and Unlocking Packages
ko: 패키지 잠금 및 잠금 해제
ru: Блокировка и разблокировка пакетов

source: man:pkg-lock[8] is used to lock packages against reinstallation, modification or deletion. man:pkg-unlock[8] unlocks the named packages. Either variant only has an effect on currently installed packages. Consequently it is impossible to block installation of a new package by using this mechanism, unless such an installation implies updating a locked package.
ko: man:pkg-lock[8]은 패키지를 재설치, 수정 또는 삭제하지 못하도록 잠그는 데 사용됩니다. man:pkg-unlock[8]은 명명된 패키지의 잠금을 해제합니다. 두 형태 모두 현재 설치된 패키지에만 영향을 미칩니다. 따라서 잠긴 패키지를 업데이트하는 것이 아니라면 이 메커니즘을 사용하여 새 패키지의 설치를 차단하는 것은 불가능합니다.
ru: man:pkg-lock[8] используется для блокировки пакетов от переустановки, изменения или удаления. man:pkg-unlock[8] разблокирует указанные пакеты. Оба варианта влияют только на уже установленные пакеты. Следовательно, невозможно предотвратить установку нового пакета с помощью этого механизма, за исключением случаев, когда такая установка подразумевает обновление заблокированного пакета.

source: For example, to lock `nginx-lite`:
ko: 예를 들어, `nginx-lite`를 잠급니다:
ru: Например, чтобы заблокировать `nginx-lite`:

source: And to unlock `nginx-lite`:
ko: 그리고 `nginx-lite`를 잠금 해제합니다:
ru: И чтобы разблокировать `nginx-lite`:

source: Modifying Package Metadata
ko: 패키지 메타데이터 수정하기
ru: Изменение метаданных пакета

source: Software within the FreeBSD Ports Collection can undergo major version number changes. To address this, pkg has a built-in command to update package origins. This can be useful, for example, if package:lang/python3[] is renamed to package:lang/python311[] so that package:lang/python3[] can now represent version `3.11`.
ko: FreeBSD 포트 컬렉션 내의 소프트웨어는 주요 버전 번호가 변경될 수 있습니다. 이 문제를 해결하기 위해, pkg에는 패키지 오리진을 업데이트하는 명령이 내장되어 있습니다. 예를 들어, package:lang/python3[]가 package:lang/python311[]로 이름이 변경되어 package:lang/python3[]이 이제 버전 `3.11`을 나타낼 수 있는 경우 유용할 수 있습니다.
ru: Программное обеспечение в коллекции портов FreeBSD может подвергаться изменениям основных номеров версий. Для решения этой проблемы в pkg есть встроенная команда для обновления происхождения пакетов. Это может быть полезно, например, если package:lang/python3[] переименован в package:lang/python311[], чтобы package:lang/python3[] теперь мог представлять версию `3.11`.

source: To change the package origin for the above example, run:
ko: 위 예제의 패키지 오리진을 변경하려면 다음을 실행합니다:
ru: Чтобы изменить источник пакета для приведенного выше примера, выполните:

source: As another example, to update package:lang/ruby31[] to package:lang/ruby32[], run:
ko: 다른 예로, package:lang/ruby31[]을 package:lang/ruby32[]로 업데이트하려면 다음을 실행합니다:
ru: В качестве другого примера, чтобы обновить package:lang/ruby31[] до package:lang/ruby32[], выполните:

source: When changing package origins, it is important to reinstall packages that are dependent on the package with the modified origin. To force a reinstallation of dependent packages, run:
ko: 패키지 오리진을 변경할 때는 변경된 오리진의 패키지에 종속된 패키지를 다시 설치하는 것이 중요합니다. 종속 패키지를 강제로 재설치하려면 다음을 실행하세요:
ru: При изменении происхождения пакетов важно переустановить пакеты, зависящие от пакета с изменённым происхождением. Для принудительной переустановки зависимых пакетов выполните:

source: Using the Ports Collection
ko: 포트 컬렉션 사용하기
ru: Использование коллекции портов

source: The Ports Collection is a set of `Makefiles`, patches, and description files. Each set of these files is used to compile and install an individual application on FreeBSD, and is called a _port_.
ko: 포트 컬렉션은 `Makefiles`, 패치 및 설명 파일의 집합입니다. 이 파일들의 각 세트는 FreeBSD에서 개별 애플리케이션을 컴파일하고 설치하는 데 사용되며, _port_라고 불립니다.
ru: Коллекция портов — это набор `Makefile`-файлов, патчей и описаний. Каждый такой набор файлов используется для сборки и установки отдельного приложения в FreeBSD и называется _портом_.

source: By default, the Ports Collection itself is stored as a subdirectory of `/usr/ports`.
ko: 기본적으로 포트 컬렉션 자체는 `/usr/ports`의 하위 디렉터리에 저장됩니다.
ru: По умолчанию Коллекция портов хранится в подкаталоге `/usr/ports`.

source: Before installing and using the Ports Collection, please be aware that it is generally ill-advised to use the Ports Collection in conjunction with the binary packages provided via pkg to install software. pkg, by default, tracks quarterly branch-releases of the ports tree and not HEAD. Dependencies could be different for a port in HEAD compared to its counterpart in a quarterly branch release and this could result in conflicts between dependencies installed by pkg and those from the Ports Collection. If the Ports Collection and pkg must be used in conjunction, then be sure that your Ports Collection and pkg are on the same branch release of the ports tree.
ko: 포트 컬렉션을 설치하고 사용하기 전에, 일반적으로 소프트웨어를 설치하기 위해 pkg를 통해 제공되는 바이너리 패키지와 함께 포트 컬렉션을 사용하는 것은 바람직하지 않다는 점에 유의하세요. pkg는 기본적으로 HEAD가 아닌 포트 트리의 분기별 브랜치 릴리스를 추적합니다. HEAD의 포트와 분기별 브랜치 릴리스의 포트에 대한 종속성이 다를 수 있으며, 이로 인해 pkg에 의해 설치된 종속성과 포트 컬렉션의 종속성 간에 충돌이 발생할 수 있습니다. 포트 컬렉션과 pkg를 함께 사용해야 하는 경우 포트 컬렉션과 pkg가 포트 트리의 동일한 브랜치 릴리스에 있는지 확인해야 합니다.
ru: Прежде чем устанавливать и использовать Коллекцию портов, учтите, что обычно не рекомендуется использовать Коллекцию портов вместе с бинарными пакетами, предоставляемыми через pkg, для установки программного обеспечения. По умолчанию pkg отслеживает квартальные ветки-релизы дерева портов, а не HEAD. Зависимости для порта в HEAD могут отличаться от его аналога в квартальном релизе ветки, что может привести к конфликтам между зависимостями, установленными pkg, и теми, что из Коллекции портов. Если необходимо использовать Коллекцию портов и pkg вместе, убедитесь, что ваша Коллекция портов и pkg находятся на одной ветке релиза дерева портов.

source: The Ports Collection contains directories for software categories. Inside each category are subdirectories for individual applications. Each application subdirectory contains a set of files that tells FreeBSD how to compile and install that program, called a _ports skeleton_. Each port skeleton includes these files and directories:
ko: 포트 컬렉션에는 소프트웨어 카테고리에 대한 디렉토리가 포함되어 있습니다. 각 카테고리 안에는 개별 애플리케이션을 위한 하위 디렉터리가 있습니다. 각 애플리케이션의 하위 디렉터리에는 _ports skeleton_이라고 하는 프로그램을 컴파일하고 설치하는 방법을 FreeBSD에 알려주는 파일 집합이 포함되어 있습니다. 각 포트 스켈레톤에는 이러한 파일과 디렉토리가 포함되어 있습니다:
ru: Коллекция портов содержит каталоги для категорий программного обеспечения. В каждой категории находятся подкаталоги для отдельных приложений. Каждый подкаталог приложения содержит набор файлов, которые сообщают FreeBSD, как компилировать и устанавливать эту программу, называемый _каркасом порта_ (ports skeleton). Каждый каркас порта включает следующие файлы и каталоги:

source: *Makefile*: contains statements that specify how the application should be compiled and where its components should be installed.
ko: *Makefile*: 애플리케이션을 컴파일하는 방법과 해당 컴포넌트를 설치하는 위치를 지정하는 명령문이 포함되어 있습니다.
ru: *Makefile*: содержит инструкции, определяющие порядок компиляции приложения и расположение его компонентов при установке.

source: *distinfo*: contains the names and checksums of the files that must be downloaded to build the port.
ko: *distinfo*: 포트를 빌드하기 위해 다운로드해야 하는 파일의 이름과 체크섬이 포함되어 있습니다.
ru: *distinfo*: содержит имена и контрольные суммы файлов, которые необходимо загрузить для сборки порта.

source: *files/*: this directory contains any patches needed for the program to compile and install on FreeBSD. This directory may also contain other files used to build the port.
ko: *files/*: 이 디렉터리에는 프로그램이 FreeBSD에서 컴파일하고 설치하는 데 필요한 모든 패치가 포함되어 있습니다. 이 디렉터리에는 포트를 빌드하는 데 사용되는 다른 파일도 포함될 수 있습니다.
ru: *files/*: в этом каталоге содержатся все необходимые патчи для компиляции и установки программы в FreeBSD. Также в этом каталоге могут находиться другие файлы, используемые для сборки порта.

source: *pkg-descr*: provides a more detailed description of the program.
ko: *pkg-descr*: 프로그램에 대한 자세한 설명을 제공합니다.
ru: *pkg-descr*: содержит более подробное описание программы.

source: *pkg-plist*: a list of all the files that will be installed by the port. It also tells the ports system which files to remove upon deinstallation.
ko: *pkg-plist*: 포트에 의해 설치될 모든 파일 목록입니다. 또한 제거 시 제거할 파일을 포트 시스템에 알려줍니다.
ru: *pkg-plist*: список всех файлов, которые будут установлены портом. Также он указывает системе портов, какие файлы следует удалить при деинсталляции.

source: Some ports include `pkg-message` or other files to handle special situations. For more details on these files, and on ports in general, refer to the extref:{porters-handbook}[FreeBSD Porter's Handbook].
ko: 일부 포트에는 특수한 상황을 처리하기 위한 `pkg-message` 또는 기타 파일이 포함되어 있습니다. 이러한 파일과 일반적인 포트에 대한 자세한 내용은 extref:{porters-handbook}[FreeBSD Porter’s Handbook]을 참고하세요.
ru: Некоторые порты включают файлы `pkg-message` или другие для обработки особых ситуаций. Для получения более подробной информации об этих файлах и о портах в целом обратитесь к extref:{porters-handbook}[Руководству по созданию портов FreeBSD].

source: The port does not include the actual source code, also known as a `distfile`. The extract portion of building a port will automatically save the downloaded source to `/usr/ports/distfiles`.
ko: 포트에는 실제 소스 코드가 포함되어 있지 않으며, `distfile`이라는 파일이 포함되어 있습니다. 포트 빌드의 추출 부분은 다운로드한 소스를 `/usr/ports/distfiles`에 자동으로 저장합니다.
ru: Порт не включает в себя исходный код, также известный как `distfile`. Этап извлечения при сборке порта автоматически сохраняет загруженные исходные файлы в `/usr/ports/distfiles`.

source: Installing the Ports Collection
ko: 포트 컬렉션 설치하기
ru: Установка коллекции портов

source: Before an application can be compiled using a port, the Ports Collection must first be installed. If it was not installed during the installation of FreeBSD, use the following method to install it:
ru: Прежде чем приложение можно будет скомпилировать с использованием порта, необходимо установить Коллекцию портов. Если она не была установлена во время установки FreeBSD, используйте следующий метод для её установки:

source: *Procedure: Git Method*
ko: *절차: Git 방법*
ru: *Процедура: Метод Git*

source: If more control over the ports tree is needed or if local changes need to be maintained, or if running FreeBSD-CURRENT, Git can be used to obtain the Ports Collection. Refer to extref:{committers-guide}[the Git Primer, git-primer] for a detailed description of Git.
ko: 포트 트리에 대한 더 많은 제어가 필요하거나 로컬 변경 사항을 유지 관리해야 하는 경우 또는 FreeBSD-CURRENT를 실행하는 경우, Git을 사용하여 포트 컬렉션을 얻을 수 있습니다. Git에 대한 자세한 설명은 extref:{committers-guide}[the Git Primer, git-primer]를 참조하세요.
ru: Если требуется больше контроля над деревом портов или необходимо поддерживать локальные изменения, либо если используется FreeBSD-CURRENT, для получения коллекции портов можно использовать Git. Подробное описание Git см. в extref:{committers-guide}[руководстве по Git, git-primer].

source: We add --depth 1 to the git command line to clone the tree without obtaining the commit history, which saves time and is acceptable for most users. If you have your own changes to the ports tree, or need the history for any reason, omit the --depth 1 argument below.
ru: Добавляем `--depth 1` в командную строку `git`, чтобы клонировать дерево без получения истории коммитов, что экономит время и приемлемо для большинства пользователей. Если у вас есть собственные изменения в дереве портов или вам нужна история по какой-либо причине, опустите аргумент `--depth 1` ниже.

source: Git must be installed before it can be used to check out the ports tree. If a copy of the ports tree is already present, install Git like this:
ko: 포트 트리를 체크아웃하는 데 사용하려면 먼저 Git을 설치해야 합니다. 포트 트리의 복사본이 이미 있는 경우 다음과 같이 Git을 설치합니다:
ru: Git должен быть установлен перед тем, как его можно будет использовать для получения дерева портов. Если копия дерева портов уже существует, установите Git следующим образом:

source: If the ports tree is not available, or pkg is being used to manage packages, Git can be installed as a package:
ko: 포트 트리를 사용할 수 없거나 패키지를 관리하기 위해 pkg를 사용 중인 경우 git을 패키지 형태로 설치할 수 있습니다:
ru: Если дерево портов недоступно или для управления пакетами используется pkg, Git можно установить как пакет:

source: Check out a copy of the HEAD branch of the ports tree:
ko: 포트 트리의 HEAD 브랜치 사본을 확인하세요:
ru: Извлеките копию ветки HEAD дерева портов:

source: Or, check out a copy of a quarterly branch:
ko: 또는 분기별 브랜치 사본을 확인하세요:
ru: Или склонируйте копию квартальной ветки:

source: As needed, update `/usr/ports` after the initial Git checkout:
ko: 필요에 따라 초기 git 체크아웃 후 `/usr/ports`를 업데이트합니다:
ru: По мере необходимости обновите `/usr/ports` после первоначального получения из Git:

source: As needed, switch `/usr/ports` to a different quarterly branch:
ko: 필요에 따라 `/usr/ports`를 다른 분기별 브랜치로 전환합니다:
ru: По мере необходимости переключите `/usr/ports` на другую квартальную ветку:
