Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/ports/_index.po
Languages: ko, ru

source: Installing Ports
ko: 포트 설치하기
ru: Установка портов

source: This section provides basic instructions on using the Ports Collection to install or remove software. The detailed description of available `make` targets and environment variables is available in man:ports[7].
ko: 이 섹션에서는 포트 컬렉션을 사용하여 소프트웨어를 설치하거나 제거하는 방법에 대한 기본 지침을 제공합니다. 사용 가능한 `make` 대상과 환경 변수에 대한 자세한 설명은 man:ports[7]에서 확인할 수 있습니다.
ru: Этот раздел содержит основные инструкции по использованию коллекции портов для установки или удаления программного обеспечения. Подробное описание доступных целей `make` и переменных окружения доступно в man:ports[7].

source: Before compiling any port, be sure to update the Ports Collection as described in the previous section. Since the installation of any third-party software can introduce security vulnerabilities, it is recommended to first check https://vuxml.freebsd.org/[] for known security issues related to the port. Alternatively, run `pkg audit -F` before installing a new port. This command can be configured to automatically perform a security audit and an update of the vulnerability database during the daily security system check. For more information, refer to man:pkg-audit[8] and man:periodic[8].
ko: 포트를 컴파일하기 전에 이전 섹션에서 설명한 대로 포트 컬렉션을 업데이트해야 합니다. 타사 소프트웨어를 설치하면 보안 취약점이 발생할 수 있으므로 먼저 https://vuxml.freebsd.org/[]에서 해당 포트와 관련된 알려진 보안 문제를 확인하는 것이 좋습니다. 또는 새 포트를 설치하기 전에 `pkg audit -F`를 실행하세요. 이 명령은 매일 보안 시스템을 점검하는 동안 보안 감사 및 취약성 데이터베이스 업데이트를 자동으로 수행하도록 구성할 수 있습니다. 자세한 내용은 man:pkg-audit[8] 및 man:periodic[8]을 참조하세요.
ru: Прежде чем компилировать любой порт, обязательно обновите коллекцию портов, как описано в предыдущем разделе. Поскольку установка любого стороннего программного обеспечения может привести к уязвимостям в безопасности, рекомендуется сначала проверить https://vuxml.freebsd.org/[] на наличие известных проблем безопасности, связанных с портом. Альтернативно, выполните `pkg audit -F` перед установкой нового порта. Эта команда может быть настроена для автоматической проверки безопасности и обновления базы данных уязвимостей в ходе ежедневной проверки безопасности системы. Для получения дополнительной информации обратитесь к man:pkg-audit[8] и man:periodic[8].

source: Using the Ports Collection assumes a working Internet connection. It also requires superuser privilege.
ko: 포트 컬렉션을 사용하려면 인터넷 연결이 정상적으로 작동한다고 가정합니다. 또한 수퍼유저 권한이 필요합니다.
ru: Использование коллекции портов предполагает наличие работающего подключения к Интернету. Также требуются права суперпользователя.

source: To compile and install the port, change to the directory of the port to be installed, then type `make install` at the prompt. Messages will indicate the progress:
ko: 포트를 컴파일하고 설치하려면 설치할 포트의 디렉터리로 변경한 다음 프롬프트에서 `make install`을 입력합니다. 메시지가 진행 상황을 알려줍니다:
ru: Для компиляции и установки порта перейдите в каталог порта, который нужно установить, затем введите `make install` в командной строке. Сообщения будут отображать прогресс:

source: Since `lsof` is a program that runs with increased privileges, a security warning is displayed as it is installed. Once the installation is complete, the prompt will be returned.
ko: `lsof`는 증가된 권한으로 실행되는 프로그램이므로 설치 시 보안 경고가 표시됩니다. 설치가 완료되면 프롬프트가 반환됩니다.
ru: Поскольку `lsof` — это программа, работающая с повышенными привилегиями, при её установке отображается предупреждение системы безопасности. После завершения установки будет возвращена командная строка.

source: Some shells keep a cache of the commands that are available in the directories listed in the `PATH` environment variable, to speed up lookup operations for the executable file of these commands. Users of the `tcsh` shell should type `rehash` so that a newly installed command can be used without specifying its full path. Use `hash -r` instead for the `sh` shell. Refer to the documentation for the shell for more information.
ko: 일부 셸은 이러한 명령의 실행 파일에 대한 조회 작업 속도를 높이기 위해 `PATH` 환경 변수에 나열된 디렉터리에서 사용할 수 있는 명령의 캐시를 유지합니다. `tcsh` 셸 사용자는 전체 경로를 지정하지 않고 새로 설치된 명령을 사용할 수 있도록 `rehash`를 입력해야 합니다. 대신 `sh` 셸의 경우 `hash -r`을 사용하세요. 자세한 내용은 해당 셸의 설명서를 참조하세요.
ru: Некоторые оболочки сохраняют кэш команд, доступных в каталогах, перечисленных в переменной окружения `PATH`, чтобы ускорить поиск исполняемых файлов этих команд. Пользователи оболочки `tcsh` должны ввести `rehash`, чтобы новоустановленная команда могла использоваться без указания полного пути. Для оболочки `sh` используйте `hash -r`. Дополнительную информацию можно найти в документации по используемой оболочке.

source: During installation, a working subdirectory is created which contains all the temporary files used during compilation. Removing this directory saves disk space and minimizes the chance of problems later when upgrading to the newer version of the port:
ko: 설치하는 동안 컴파일 중에 사용된 모든 임시 파일이 포함된 작업 하위 디렉터리가 생성됩니다. 이 디렉터리를 제거하면 디스크 공간을 절약하고 나중에 최신 버전의 포트로 업그레이드할 때 문제가 발생할 가능성을 최소화할 수 있습니다:
ru: Во время установки создается рабочий подкаталог, содержащий все временные файлы, используемые при компиляции. Удаление этого каталога позволяет сэкономить место на диске и снижает вероятность возникновения проблем в дальнейшем при обновлении до более новой версии порта:

source: To save this extra step, instead use `make install clean` when compiling the port.
ko: 이 추가 단계를 줄이려면 대신 포트를 컴파일할 때 'make install clean'을 사용하세요.
ru: Чтобы избежать этого дополнительного шага, используйте `make install clean` при компиляции порта.

source: Customizing Ports Installation
ko: 포트 설치시 사용자 지정하기
ru: Настройка установки портов

source: Some ports provide build options which can be used to enable or disable application components, provide security options, or allow for other customizations. Examples include package:www/firefox[] and package:security/gpgme[]. If the port depends upon other ports which have configurable options, it may pause several times for user interaction as the default behavior is to prompt the user to select options from a menu. To avoid this and do all of the configuration in one batch, run `make config-recursive` within the port skeleton. Then, run `make install [clean]` to compile and install the port.
ko: 일부 포트는 애플리케이션 구성 요소를 활성화 또는 비활성화하고, 보안 옵션을 제공하거나, 기타 사용자 정의를 허용하는 데 사용할 수 있는 빌드 옵션을 제공합니다. 예를 들면 package:www/firefox[] 및 package:security/gpgme[] 등이 있습니다. 포트가 구성 가능한 옵션이 있는 다른 포트에 의존하는 경우 기본 동작은 사용자에게 메뉴에서 옵션을 선택하라는 메시지를 표시하는 것이므로 사용자 상호 작용을 위해 여러 번 일시 중지될 수 있습니다. 이를 방지하고 모든 구성을 한 번에 수행하려면 포트 스켈레톤 내에서 `make config-recursive`를 실행하세요. 그런 다음 `make install [clean]`을 실행하여 포트를 컴파일하고 설치합니다.
ru: Некоторые порты предоставляют опции сборки, которые можно использовать для включения или отключения компонентов приложения, обеспечения параметров безопасности или других настроек. Примеры включают package:www/firefox[] и package:security/gpgme[]. Если порт зависит от других портов с настраиваемыми опциями, процесс может несколько раз приостанавливаться для взаимодействия с пользователем, так как по умолчанию предлагается выбрать опции из меню. Чтобы избежать этого и выполнить всю настройку одной командой, выполните `make config-recursive` в каталоге порта. Затем выполните `make install [clean]` для компиляции и установки порта.

source: When using `config-recursive`, the list of ports to configure are gathered by the `all-depends-list` target. It is recommended to run `make config-recursive` until all dependent ports options have been defined, and ports options screens no longer appear, to be certain that all dependency options have been configured.
ko: `config-recursive`를 사용할 때 구성할 포트 목록은 `all-depends-list` 대상에 의해 수집됩니다. 모든 종속 포트 옵션이 정의되고 포트 옵션 화면이 더 이상 나타나지 않을 때까지 모든 종속성 옵션이 구성되었는지 확인하기 위해 `make config-recursive`를 실행하는 것이 좋습니다.
ru: При использовании `config-recursive` список портов для настройки собирается с помощью цели `all-depends-list`. Рекомендуется выполнять `make config-recursive` до тех пор, пока не будут определены все параметры зависимых портов и экраны выбора опций портов больше не появляются, чтобы убедиться, что все параметры зависимостей настроены.

source: There are several ways to revisit a port's build options menu in order to add, remove, or change these options after a port has been built. One method is to `cd` into the directory containing the port and type `make config`. Another option is to use `make showconfig`. Another option is to execute `make rmconfig` which will remove all selected options and allow you to start over. All of these options, and others, are explained in great detail in man:ports[7].
ko: 포트가 빌드된 후 이러한 옵션을 추가, 제거 또는 변경하기 위해 포트의 빌드 옵션 메뉴를 다시 방문하는 방법에는 여러 가지가 있습니다. 한 가지 방법은 포트가 포함된 디렉터리에 `cd`를 입력하고 `make config`를 입력하는 것입니다. 또 다른 옵션은 `make showconfig`를 사용하는 것입니다. 또 다른 옵션은 `make rmconfig`를 실행하여 선택한 모든 옵션을 제거하고 다시 시작할 수 있도록 하는 것입니다. 이 모든 옵션과 다른 옵션은 man:ports[7]에 자세히 설명되어 있습니다.
ru: Существует несколько способов вернуться к меню настроек сборки порта, чтобы добавить, удалить или изменить параметры после того, как порт уже был собран. Один из методов — перейти в каталог с портом с помощью `cd` и ввести `make config`. Другой вариант — использовать `make showconfig`. Также можно выполнить `make rmconfig`, что удалит все выбранные параметры и позволит начать заново. Все эти и другие варианты подробно описаны в man:ports[7].

source: The ports system uses man:fetch[1] to download the source files, which supports various environment variables. The `FTP_PASSIVE_MODE`, `FTP_PROXY`, and `FTP_PASSWORD` variables may need to be set if the FreeBSD system is behind a firewall or FTP/HTTP proxy. See man:fetch[3] for the complete list of supported variables.
ko: 포트 시스템은 다양한 환경 변수를 지원하는 man:fetch[1]를 사용하여 소스 파일을 다운로드합니다. FreeBSD 시스템이 방화벽이나 FTP/HTTP 프록시 뒤에 있는 경우 `FTP_PASSIVE_MODE`, `FTP_PROXY`, `FTP_PASSWORD` 변수를 설정해야 할 수 있습니다. 지원되는 변수의 전체 목록은 man:fetch[3]를 참조하십시오.
ru: Система портов использует man:fetch[1] для загрузки исходных файлов, которая поддерживает различные переменные окружения. Переменные `FTP_PASSIVE_MODE`, `FTP_PROXY` и `FTP_PASSWORD` может потребоваться установить, если система FreeBSD находится за межсетевым экраном или FTP/HTTP прокси. Полный список поддерживаемых переменных смотрите в man:fetch[3].

source: For users who cannot be connected to the Internet all the time, `make fetch` can be run within `/usr/ports`, to fetch all distfiles, or within a category, such as `/usr/ports/net`, or within the specific port skeleton. Note that if a port has any dependencies, running this command in a category or ports skeleton will _not_ fetch the distfiles of ports from another category. Instead, use `make fetch-recursive` to also fetch the distfiles for all the dependencies of a port.
ko: 인터넷에 항상 연결할 수 없는 사용자의 경우 `make fetch`를 `/usr/ports` 내에서 실행하여 모든 배포파일을 가져오거나, `/usr/ports/net`과 같은 카테고리 내에서 또는 특정 포트 스켈레톤 내에서 실행할 수 있습니다. 포트에 종속성이 있는 경우, 포트 스켈레톤에서 이 명령을 실행하면 해당 카테고리의 배포파일은 가져오지만 다른 카테고리에 속한 포트의 배포파일은 _가지고 오지 않는다_는 것을 기억하세요. 포트의 모든 종속성에 대한 배포파일도 가져오려면 `make fetch-recursive`를 사용하세요.
ru: Для пользователей, которые не могут быть постоянно подключены к интернету, команда `make fetch` может быть выполнена в `/usr/ports`, чтобы загрузить все distfiles, или в категории, например `/usr/ports/net`, или в конкретном скелете порта. Обратите внимание, что если порт имеет зависимости, выполнение этой команды в категории или скелете порта _не_ загрузит distfiles портов из другой категории. Вместо этого используйте `make fetch-recursive`, чтобы также загрузить distfiles для всех зависимостей порта.

source: In rare cases, such as when an organization has a local distfiles repository, the `MASTER_SITES` variable can be used to override the download locations specified in the `Makefile`. When using, specify the alternate location:
ko: 드물지만, 조직에 로컬 distfiles(배포파일) 리포지토리가 있는 경우와 같이 `MASTER_SITES` 변수를 사용하여 `Makefile`에 지정된 다운로드 위치를 재정의할 수 있습니다. 사용할 때는 대체 위치를 지정하세요:
ru: В редких случаях, например, когда у организации есть локальный репозиторий distfiles, переменная `MASTER_SITES` может быть использована для переопределения мест загрузки, указанных в `Makefile`. При использовании укажите альтернативное расположение:

source: The `WRKDIRPREFIX` and `PREFIX` variables can override the default working and target directories. For example:
ko: 작업 디렉터리와 대상 디렉터리의 기본값을 `WRKDIRPREFIX` 및 `PREFIX` 변수로 재정의할 수 있습니다. 예를 들어:
ru: Переменные `WRKDIRPREFIX` и `PREFIX` позволяют переопределить рабочий и целевой каталоги по умолчанию. Например:

source: will compile the port in `/usr/home/example/ports` and install everything under `/usr/local`.
ko: 는 `/usr/home/example/ports`에 포트를 컴파일하고 `/usr/local` 아래에 모든 것을 설치합니다.
ru: соберет порт в `/usr/home/example/ports` и установит все в `/usr/local`.

source: will compile the port in `/usr/ports` and install it in `/usr/home/example/local`. And:
ko: 는 `/usr/ports`에서 포트를 컴파일하고 `/usr/home/example/local`에 설치합니다. 그리고:
ru: скомпилирует порт в `/usr/ports` и установит его в `/usr/home/example/local`. И:

source: will combine the two.
ko: 위 명령은 이 두 가지를 결합합니다.
ru: объединит эти два.

source: These can also be set as environmental variables. Refer to the manual page for your shell for instructions on how to set an environmental variable.
ko: 이런 방식은 환경 변수로 설정할 수도 있습니다. 환경 변수를 설정하는 방법에 대한 지침은 셸의 매뉴얼 페이지를 참조하세요.
ru: Эти параметры также могут быть установлены как переменные среды. Обратитесь к руководству вашей оболочки для получения инструкций по установке переменных среды.

source: Removing Installed Ports
ko: 설치된 포트 제거하기
ru: Удаление установленных портов

source: Installed ports can be uninstalled using `pkg delete`. Examples for using this command can be found in the man:pkg-delete[8] manual page.
ko: 설치된 포트는 `pkg delete`를 사용하여 제거할 수 있습니다. 이 명령의 사용 예는 man:pkg-delete[8] 매뉴얼 페이지에서 확인할 수 있습니다.
ru: Установленные порты можно удалить с помощью `pkg delete`. Примеры использования этой команды приведены на man:pkg-delete[8].

source: Alternately, `make deinstall` can be run in the port\'s directory:
ko: 또는 포트의 디렉터리에서 `make deinstall`을 실행할 수 있습니다:
ru: Или в каталоге порта можно выполнить `make deinstall`:

source: It is recommended to read the messages as the port is uninstalled. If the port has any applications that depend upon it, this information will be displayed but the uninstallation will proceed. In such cases, it may be better to reinstall the application in order to prevent broken dependencies.
ko: 포트가 제거될 때 표시되는 메시지를 읽어보는 것이 좋습니다. 포트에 종속된 애플리케이션이 있는 경우 이 정보가 표시되지만 제거는 계속 진행됩니다. 이러한 경우 종속성이 깨지는 것을 방지하기 위해 애플리케이션을 다시 설치하는 것이 더 나을 수 있습니다.
ru: Рекомендуется прочитать сообщения во время удаления порта. Если у порта есть приложения, которые от него зависят, эта информация будет отображена, но удаление продолжится. В таких случаях может быть лучше переустановить приложение, чтобы избежать нарушенных зависимостей.

source: Upgrading Ports
ko: 포트 업그레이드하기
ru: Обновление портов

source: Over time, newer versions of software become available in the Ports Collection. This section describes how to determine which software can be upgraded and how to perform the upgrade.
ko: 시간이 지남에 따라 포트 컬렉션에서 최신 버전의 소프트웨어를 사용할 수 있게 됩니다. 이 섹션에서는 업그레이드할 수 있는 소프트웨어를 결정하는 방법과 업그레이드를 수행하는 방법에 대해 설명합니다.
ru: Со временем в Коллекции портов становятся доступны новые версии программного обеспечения. В этом разделе описано, как определить, какие программы можно обновить, и как выполнить обновление.

source: To determine if newer versions of installed ports are available, ensure that the latest version of the ports tree is installed, using the updating command described in crossref:ports[ports-using-git-method, "Git Method"]. The following command will list the installed ports which are out of date:
ru: Чтобы определить, доступны ли более новые версии установленных портов, убедитесь, что у вас установлена последняя версия дерева портов, используя команду обновления, описанную в crossref:ports[ports-using-git-method, "Git Method"]. Следующая команда выведет список устаревших установленных портов:

source: Before attempting an upgrade, read `/usr/ports/UPDATING` from the top of the file to the date closest to the last time ports were upgraded or the system was installed. This file describes various issues and additional steps users may encounter and need to perform when updating a port, including such things as file format changes, changes in locations of configuration files, or any incompatibilities with previous versions. Make note of any instructions which match any of the ports that need upgrading and follow these instructions when performing the upgrade.
ko: 업그레이드를 시도하기 전에 파일 상단에서 `/usr/ports/UPDATING`을 읽어 포트를 마지막으로 업그레이드하거나 시스템을 설치한 날짜와 가장 가까운 날짜로 이동하세요. 이 파일에는 파일 형식 변경, 구성 파일 위치 변경, 이전 버전과의 비호환성 등 포트를 업데이트할 때 사용자가 직면할 수 있고 수행해야 하는 다양한 문제와 추가 단계에 대한 설명이 나와 있습니다. 업그레이드가 필요한 포트에 해당하는 지침을 메모해 두었다가 업그레이드를 수행할 때 이 지침을 따르세요.
ru: Перед попыткой обновления прочитайте файл `/usr/ports/UPDATING` с начала до даты, наиболее близкой к последнему обновлению портов или установке системы. Этот файл описывает различные проблемы и дополнительные шаги, с которыми могут столкнуться пользователи при обновлении портов, включая такие вещи, как изменения форматов файлов, перемещение конфигурационных файлов или несовместимость с предыдущими версиями. Отметьте все инструкции, относящиеся к портам, которые требуют обновления, и следуйте этим инструкциям при выполнении обновления.

source: Tools to Upgrade and Manage Ports
ko: 포트 업그레이드 및 관리를 위한 도구
ru: Инструменты для обновления и управления портами

source: The Ports Collection contains several utilities to perform the actual upgrade. Each has its strengths and weaknesses.
ko: 포트 컬렉션에는 실제 업그레이드를 수행할 수 있는 여러 유틸리티가 포함되어 있습니다. 각각 장단점이 있습니다.
ru: Коллекция портов содержит несколько утилит для выполнения обновления. У каждой есть свои сильные и слабые стороны.

source: Historically, most installations used either Portmaster or Portupgrade. Synth is a newer alternative.
ko: 이전에는 대부분의 설치에서 Portmaster 또는 Portupgrade를 사용했습니다. Synth는 새로운 대안입니다.
ru: Исторически большинство установок использовали либо Portmaster, либо Portupgrade. Synth — это более современная альтернатива.

source: The choice of which tool is best for a particular system is up to the system administrator. It is recommended practice to back up your data before using any of these tools.
ko: 특정 시스템에 가장 적합한 도구를 선택하는 것은 시스템 관리자의 몫입니다. 이러한 도구를 사용하기 전에 데이터를 백업하는 것이 좋습니다.
ru: Выбор наилучшего инструмента для конкретной системы остается за системным администратором. Рекомендуется создать резервную копию данных перед использованием любого из этих инструментов.

source: Upgrading Ports Using Portmaster
ko: 포트마스터를 사용하여 포트 업그레이드
ru: Обновление портов с помощью Portmaster

source: package:ports-mgmt/portmaster[] is a very small utility for upgrading installed ports. It is designed to use the tools installed with the FreeBSD base system without depending on other ports or databases. To install this utility as a port:
ko: package:ports-mgmt/portmaster[]는 설치된 포트를 업그레이드하기 위한 아주 작은 유틸리티입니다. 이 유틸리티는 다른 포트나 데이터베이스에 의존하지 않고 FreeBSD 기본 시스템과 함께 설치된 도구를 사용하도록 설계되었습니다. 이 유틸리티를 포트로 설치하려면:
ru: package:ports-mgmt/portmaster[] — это очень небольшая утилита для обновления установленных портов. Она предназначена для использования инструментов, установленных в базовой системе FreeBSD, без зависимости от других портов или баз данных. Чтобы установить эту утилиту как порт:

source: Portmaster defines four categories of ports:
ko: 포트마스터는 포트의 네 가지 범주를 정의합니다:
ru: Portmaster определяет четыре категории портов:

source: Root port: has no dependencies and is not a dependency of any other ports.
ko: Root port: 종속성이 없으며 다른 포트의 종속적이지 않습니다.
ru: Корневой порт (root port): не имеет зависимостей и сам не является зависимостью для других портов.

source: Trunk port: has no dependencies, but other ports depend upon it.
ko: Trunk port: 종속성은 없지만 다른 포트는 트렁크 포트에 종속됩니다.
ru: Ствольный порт (trunk port): не имеет зависимостей, но другие порты зависят от него.

source: Branch port: has dependencies and other ports depend upon it.
ko: Branch port: 종속성이 있으며 다른 포트가 이 포트에 종속됩니다.
ru: Веточный порт (branch port): имеет зависимости и другие порты зависят от него.

source: Leaf port: has dependencies but no other ports depend upon it.
ko: Leaf port: 종속성은 있지만 다른 포트에 종속되지 않습니다.
ru: Листовой порт (leaf port): имеет зависимости, но другие порты от него не зависят.

source: To list these categories and search for updates:
ko: 이러한 카테고리를 나열하고 업데이트를 검색하려면 다음과 같이 합니다:
ru: Чтобы перечислить эти категории и найти обновления:

source: This command is used to upgrade all outdated ports:
ko: 이 명령은 오래된 포트를 모두 업그레이드하는 데 사용됩니다:
ru: Эта команда используется для обновления всех устаревших портов:

source: By default, Portmaster makes a backup package before deleting the existing port. If the installation of the new version is successful, Portmaster deletes the backup. Using `-b` instructs Portmaster not to automatically delete the backup. Adding `-i` starts Portmaster in interactive mode, prompting for confirmation before upgrading each port. Many other options are available. Read through the manual page for man:portmaster[8] for details regarding their usage.
ko: 기본적으로 포트마스터는 기존 포트를 삭제하기 전에 백업 패키지를 만듭니다. 새 버전 설치가 성공하면 Portmaster는 백업을 삭제합니다. `-b`를 사용하면 포트마스터가 백업을 자동으로 삭제하지 않도록 지시합니다. `-i`를 추가하면 각 포트를 업그레이드하기 전에 확인 메시지를 표시하는 대화형 모드에서 Portmaster가 시작됩니다. 다른 많은 옵션을 사용할 수 있습니다. 사용법에 대한 자세한 내용은 man:portmaster[8] 매뉴얼 페이지를 참조하십시오.
ru: По умолчанию Portmaster создаёт резервную копию пакета перед удалением существующего порта. Если установка новой версии проходит успешно, Portmaster удаляет резервную копию. Использование опции `-b` указывает Portmaster не удалять резервную копию автоматически. Добавление опции `-i` запускает Portmaster в интерактивном режиме, запрашивая подтверждение перед обновлением каждого порта. Доступно множество других опций. Подробности об их использовании можно узнать на man-странице man:portmaster[8].

source: If errors are encountered during the upgrade process, add `-f` to upgrade and rebuild all ports:
ko: 업그레이드 과정에서 오류가 발생하면 `-f`를 추가하여 모든 포트를 업그레이드하고 다시 빌드하세요:
ru: Если в процессе обновления возникают ошибки, добавьте `-f` для обновления и пересборки всех портов:

source: Portmaster can also be used to install new ports on the system, upgrading all dependencies before building and installing the new port. To use this function, specify the location of the port in the Ports Collection:
ko: 포트마스터를 사용하여 시스템에 새 포트를 설치할 수도 있으며, 새 포트를 빌드하고 설치하기 전에 모든 종속성을 업그레이드할 수 있습니다. 이 기능을 사용하려면 포트 컬렉션에서 포트의 위치를 지정합니다:
ru: Portmaster также может использоваться для установки новых портов в системе, обновляя все зависимости перед сборкой и установкой нового порта. Чтобы использовать эту функцию, укажите расположение порта в коллекции портов:

source: More information about package:ports-mgmt/portmaster[] may be found in its `pkg-descr`.
ko: package:ports-mgmt/portmaster[]에 대한 자세한 정보는 `pkg-descr`에서 확인할 수 있습니다.
ru: Дополнительную информацию о package:ports-mgmt/portmaster[] можно найти в его `pkg-descr`.

source: Upgrading Ports Using Portupgrade
ko: 포트 업그레이드를 사용하여 포트 업그레이드하기
ru: Обновление портов с помощью Portupgrade

source: Portupgrade is deprecated and will be removed in the near future.
ru: Portupgrade устарел и будет удален в ближайшем будущем.

source: package:ports-mgmt/portupgrade[] is another utility that can be used to upgrade ports. It installs a suite of applications which can be used to manage ports. However, it is dependent upon Ruby. To install the port:
ko: package:ports-mgmt/portupgrade[]는 포트를 업그레이드하는 데 사용할 수 있는 또 다른 유틸리티입니다. 이 유틸리티는 포트를 관리하는 데 사용할 수 있는 애플리케이션 모음을 설치합니다. 그러나 이 유틸리티는 Ruby에 종속됩니다. 포트를 설치하려면 다음과 같이 하세요:
ru: package:ports-mgmt/portupgrade[] — это ещё одна утилита, которую можно использовать для обновления портов. Она устанавливает набор приложений для управления портами. Однако она зависит от Ruby. Для установки порта выполните:
