Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/ports/_index.po
Languages: ko, ru

source: Some ports are not maintained by an individual but instead by a group maintainer represented by a extref:{mailing-list-faq}[mailing list]. Many, but not all, of these addresses look like mailto:freebsd-listname@FreeBSD.org[freebsd-listname@FreeBSD.org]. Please take this into account when sending an email.
ko: 일부 포트는 개인이 관리하지 않고 extref:{mailing-list-faq}[mailing list]로 표시되는 그룹 관리자가 관리합니다. 이러한 주소의 대부분은 mailto:freebsd-listname@FreeBSD.org[freebsd-listname@FreeBSD.org]와 비슷하지만 전부는 아닙니다. 이메일을 보낼 때 이 점을 고려하시기 바랍니다.
ru: Некоторые порты поддерживаются не отдельными людьми, а группой сопровождающих, представленной extref:{mailing-list-faq}[рассылкой]. Многие, но не все, такие адреса выглядят как mailto:freebsd-listname@FreeBSD.org[freebsd-listname@FreeBSD.org]. Учтите это при отправке письма.

source: In particular, ports maintained by mailto:ports@FreeBSD.org[ports@FreeBSD.org] are not maintained by a specific individual. Instead, any fixes and support come from the general community who subscribe to that mailing list. More volunteers are always needed!
ko: mailto:ports@FreeBSD.org[ports@FreeBSD.org]에서 유지 관리하는 포트는 특정 개인이 유지 관리하는 것이 아닙니다. 대신, 모든 수정 및 지원은 해당 메일링 리스트에 가입한 일반 커뮤니티에서 이루어집니다. 더 많은 자원 봉사자가 항상 필요합니다!
ru: В частности, порты, поддерживаемые mailto:ports@FreeBSD.org[ports@FreeBSD.org], не курируются конкретным человеком. Вместо этого исправления и поддержка поступают от сообщества в целом, участники которого подписаны на этот список рассылки. Добровольцы всегда нужны!

source: If there is no response to the email, use Bugzilla to submit a bug report using the instructions in extref:{problem-reports}[Writing FreeBSD Problem Reports].
ko: 이메일에 응답이 없는 경우, Bugzilla를 사용하여 extref:{problem-reports}[Writing FreeBSD Problem Reports]의 지침에 따라 버그 보고서를 제출하세요.
ru: Если на письмо не получен ответ, используйте Bugzilla для отправки отчета об ошибке, следуя инструкциям в extref:{problem-reports}[Составление отчетов о проблемах в FreeBSD].

source: Fix it! The extref:{porters-handbook}[Porter's Handbook] includes detailed information on the ports infrastructure so that you can fix the occasional broken port or even submit your own!
ko: 고치세요! extref:{porters-handbook}[Porter’s Handbook]에는 포트 인프라에 대한 자세한 정보가 포함되어 있으므로 가끔 손상된 포트를 고치거나 직접 제출할 수도 있습니다!
ru: Исправьте это! В extref:{porters-handbook}[Руководстве портировщика] содержится подробная информация об инфраструктуре портов, так что вы можете исправить случайно сломанный порт или даже предложить свой собственный!

source: Install the package instead of the port using the instructions in crossref:ports[pkgng-intro, Using pkg for Binary Package Management].
ru: Установите пакет вместо порта, следуя инструкциям в crossref:ports[pkgng-intro, Использование pkg для управления бинарными пакетами].

source: However, over link:https://www.FreeBSD.org/ports/[{numports}] third-party applications have already been ported to FreeBSD. When feasible, these applications are made available for download as pre-compiled _packages_.
ko: 그러나 link:https://www.FreeBSD.org/ports/[{numports}] 타사 애플리케이션은 이미 FreeBSD로 포팅되어 있습니다. 가능한 경우, 이러한 애플리케이션은 미리 컴파일된 _packages_로 다운로드할 수 있도록 제공됩니다.

source: In some cases, multiple packages will exist for the same application to specify certain settings. For example, NGINX(R) is available as a `nginx` package and a `nginx-lite` package, depending on whether or not Xorg is installed. Creating multiple packages rapidly becomes impossible if an application has more than one or two different compile-time options.
ko: 경우에 따라 특정 설정을 지정하기 위해 동일한 애플리케이션에 대해 여러 패키지가 존재할 수 있습니다. 예를 들어, NGINX(R)는 Xorg 설치 여부에 따라 `nginx` 패키지와 `nginx-lite` 패키지로 사용할 수 있습니다. 애플리케이션에 컴파일 시기 옵션이 두 가지 이상이면 여러 패키지를 빠르게 생성하는 것이 불가능해집니다.

source: Before installing any application, check https://vuxml.freebsd.org/[] for security issues related to the application or type `pkg audit -F` to check all installed applications for known vulnerabilities.
ko: 애플리케이션을 설치하기 전에 https://vuxml.freebsd.org/[]에서 애플리케이션과 관련된 보안 문제를 확인하거나 `pkg audit -F`를 입력하여 설치된 모든 애플리케이션에 알려진 취약점이 있는지 확인합니다.

source: The FreeBSD web site maintains an up-to-date searchable list of all the available applications, at link:https://www.FreeBSD.org/ports/[Ports Portal]. The ports can be searched by application name or by software category.
ko: FreeBSD 웹 사이트는 link:https://www.FreeBSD.org/ports/[Ports Portal]에서 사용 가능한 모든 애플리케이션의 최신 검색 목록을 유지합니다. 포트는 애플리케이션 이름이나 소프트웨어 카테고리로 검색할 수 있습니다.

source: If finding a particular application becomes challenging, try searching a site like https://sourceforge.net/[SourceForge] or https://github.com/[GitHub] then check back at the link:https://www.FreeBSD.org/ports/[Ports Portal] to see if the application has been ported.
ko: 특정 애플리케이션을 찾기 어려운 경우 https://sourceforge.net/[SourceForge] 또는 https://github.com/[GitHub]와 같은 사이트를 검색한 다음 link:https://www.FreeBSD.org/ports/[Ports Portal]에서 애플리케이션이 포팅되었는지 다시 확인하세요.

source: However, for those sites building from source a separate <<ports-upgrading-tools, port management tool>> will be needed.
ko: 단, 소스로 구축하는 사이트의 경우 별도의 <<ports-upgrading-tools, port management tool>>가 필요합니다.

source: To switch from quarterly to latest run the following commands:
ko: 분기별에서 최신 브랜치로 전환하려면 다음 명령을 실행합니다:

source: Edit the file `/usr/local/etc/pkg/repos/FreeBSD.conf` and change the string _quarterly_ to _latest_ in the `url:` line.
ko: 파일 `/usr/local/etc/pkg/repos/FreeBSD.conf`를 편집하고 `url:` 줄에서 _quarterly_ 문자열을 _latest_로 변경합니다.

source: The result should be similar to the following:
ko: 결과는 다음과 비슷해야 합니다:

source: And finally run this command to update from the new (latest) repository metadata.
ko: 마지막으로 이 명령을 실행하여 새(최신) 리포지토리 메타데이터에서 업데이트를 진행합니다.

source: man:pkg.conf[5] is the system-wide configuration file used by the man:pkg[8] tools. The default location of this file is `/usr/local/etc/pkg.conf`.
ko: man:pkg.conf[5]는 man:pkg[8] 도구에서 사용하는 시스템 전체 구성 파일입니다. 이 파일의 기본 위치는 `/usr/local/etc/pkg.conf`입니다.

source: Packages installed as dependencies are called _automatic_ packages. Non-automatic packages, i.e the packages that were explicity installed not as a dependency to another package, can be listed using:
ko: 종속성으로 설치된 패키지를 _automatic_ 패키지라고 합니다. 비 자동 패키지, 즉 다른 패키지의 종속성이 아닌 명시적으로 설치된 패키지는 다음을 사용하여 나열할 수 있습니다:

source: Restoring the Package Database
ko: 패키지 데이터베이스 복원하기

source: Unlike the traditional package management system, pkg includes its own package database backup mechanism. This functionality is enabled by default.
ko: 기존 패키지 관리 시스템과 달리 pkg에는 자체 패키지 데이터베이스 백업 메커니즘이 포함되어 있습니다. 이 기능은 기본적으로 활성화되어 있습니다.

source: To disable the periodic script from backing up the package database, set `daily_backup_pkgdb_enable="NO"` in man:periodic.conf[5].
ko: 정기 스크립트가 패키지 데이터베이스를 백업하지 않도록 하려면 man:periodic.conf[5]에서 `daily_backup_pkgdb_enable="NO"`를 설정합니다.

source: To restore the contents of a previous package database backup, run the following command replacing _/path/to/pkg.sql_ with the location of the backup:
ko: 이전 패키지 데이터베이스 백업의 내용을 복원하려면 _/path/to/pkg.sql_를 백업 위치로 바꾸어 다음 명령을 실행합니다:

source: If restoring a backup taken by the periodic script, it must be decompressed prior to being restored.
ko: 정기 스크립트에 의해 수행된 백업을 복원하는 경우 복원하기 전에 압축을 풀어야 합니다.

source: To run a manual backup of the pkg database, run the following command, replacing _/path/to/pkg.sql_ with a suitable file name and location:
ko: pkg 데이터베이스의 수동 백업을 실행하려면 다음 명령을 실행하여 _/path/to/pkg.sql_를 적절한 파일 이름과 위치로 바꿉니다:

source: Before an application can be compiled using a port, the Ports Collection must first be installed. If it was not installed during the installation of FreeBSD, use one of the following methods to install it:
ko: 포트를 사용하여 애플리케이션을 컴파일하기 전에 먼저 포트 컬렉션을 설치해야 합니다. FreeBSD를 설치할 때 설치되지 않은 경우 다음 방법 중 하나를 사용하여 설치합니다:

source: To determine if newer versions of installed ports are available, ensure that the latest version of the ports tree is installed, using the updating command described in <<ports-using-git-method, "Git Method">>. The following command will list the installed ports which are out of date:
ko: 설치된 포트의 최신 버전을 사용할 수 있는지 확인하려면 <<ports-using-git-method, “Git Method”>>에 설명된 업데이트 명령을 사용하여 포트 트리의 최신 버전이 설치되어 있는지 확인합니다. 다음 명령은 설치된 포트 중 오래된 포트를 나열합니다:

source: Building Packages with Poudriere
ko: Poudriere(푸드리에)를 사용한 패키지 구축

source: Poudriere is a `BSD`-licensed utility for creating and testing FreeBSD packages. It uses FreeBSD jails to set up isolated compilation environments. These jails can be used to build packages for versions of FreeBSD that are different from the system on which it is installed, and also to build packages for i386 if the host is an amd64 system. Once the packages are built, they are in a layout identical to the official mirrors. These packages are usable by man:pkg[8] and other package management tools.
ko: Poudriere는 FreeBSD 패키지를 생성하고 테스트하기 위한 `BSD` 라이선스 유틸리티입니다. 이 유틸리티는 독립된 컴파일 환경을 설정하기 위해 FreeBSD jail을 사용합니다. 이 jail은 설치된 시스템과 다른 버전의 FreeBSD용 패키지를 빌드하는 데 사용할 수 있으며, 호스트가 amd64 시스템인 경우 i386용 패키지를 빌드하는 데에도 사용할 수 있습니다. 패키지가 빌드되면 공식 미러와 동일한 레이아웃에 배치됩니다. 이 패키지는 man:pkg[8] 및 기타 패키지 관리 도구에서 사용할 수 있습니다.

source: Poudriere is installed using the package:ports-mgmt/poudriere[] package or port. The installation includes a sample configuration file `/usr/local/etc/poudriere.conf.sample`. Copy this file to `/usr/local/etc/poudriere.conf`. Edit the copied file to suit the local configuration.
ko: Poudriere는 package:ports-mgmt/poudriere[] 패키지 또는 포트를 사용하여 설치됩니다. 설치에는 샘플 구성 파일 `/usr/local/etc/poudriere.conf.sample`이 포함되어 있습니다. 이 파일을 `/usr/local/etc/poudriere.conf`에 복사합니다. 복사한 파일을 로컬 구성에 맞게 편집합니다.

source: Packages to be built are entered in `13amd64-local-workstation-pkglist`:
ko: 빌드할 패키지는 `13amd64-local-workstation-pkglist`에 입력합니다:

source: While running, pressing kbd:[Ctrl+t] displays the current state of the build. Poudriere also builds files in `/poudriere/logs/bulk/jailname` that can be used with a web server to display build information.
ko: 실행 중 kbd:[Ctrl+t]를 누르면 빌드의 현재 상태가 표시됩니다. Poudriere는 `/poudriere/logs/bulk/jailname`에, 웹 서버에서 빌드 정보를 표시하기 위한 파일도 생성합니다.

source: Configuring pkg Clients to Use a Poudriere Repository
ko: Poudriere 리포지토리를 사용하도록 pkg 클라이언트 구성하기

source: Install the package instead of the port using the instructions in <<pkgng-intro>>.
ko: <<pkgng-intro>>의 지침에 따라 포트 대신 패키지를 설치합니다.
