freebsd/freebsd-doc/ja_JP.eucJP/man/man1/catman.1
.\" Copyright (c) March 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" /usr/bin/catman - preformat man pages
.\"
.\" %FreeBSD: src/gnu/usr.bin/man/catman/catman.1,v 1.17.2.1 2000/09/17 20:32:46 ache Exp %
.\" jpman %Id: catman.1,v 1.3 1997/04/01 14:14:59 horikawa Stab %
.Dd Mar 12, 1995
.Dt CATMAN 1
.Os
.Sh 名称
.Nm catman
.Nd オンラインマニュアルを事前にフォーマットする
.Sh 書式
.Nm catman
.Op Fl f | Fl force
.Op Fl h | Fl help
.Op Fl L | Fl locale
.Op Fl p | Fl print
.Op Fl r | Fl remove
.Op Fl v | Fl verbose
.Op Ar directories...
.Sh 解説
.Nm catman
はマニュアルを ASCII 形式にフォーマットします。これは
.Ar directories
で全てのマニュアルについて
.Sq man program
とタイプするのと似ています。
.Ar directories
はマニュアルの格納されているディレクトリやサブディレクトリを
スペースかコロンで区切ったものです。
.Ar directories
が指定されなかった場合、デフォルトとして
.Ar /usr/share/man
が使われます。
.Sh オプション
.Bl -tag -width Ds
.It Fl f , Fl force
既にある cat 形式のマニュアルへの上書きを強制します。
普通は、マニュアルが古くなったときだけ、
フォーマットしなおされるべきものです。
このオプションは時間と CPU と RAM の無駄使いです。
.It Fl h , Fl help
オプションを表示して終了します。
.It Fl L , Fl locale
ロケール環境変数を調査し、
ローカライズされたマニュアルサブディレクトリと
本エントリのみに使用する処理を調べます。
.It Fl p , Fl print
実際にはマニュアルのフォーマットを行わず、何を行うかのみを表示します。
.It Fl r , Fl remove
不要ファイルを削除します。例えば、
man 形式の無い cat 形式、
圧縮された cat 形式がある非圧縮の cat 形式、
英数字で構成されていないファイル名を持つファイル、
圧縮された man 形式がある非圧縮の man 形式です。
.It Fl v , Fl verbose
より多くの警告を表示します。
.Sh 使用例
.Pp
.Dl $ catman
.Pp
.Ar /usr/share/man
以下のマニュアルを、必要な分だけフォーマットします。
.Pp
.Dl $ catman $MANPATH
.Pp
ユーザの全てのマニュアルパス以下の
マニュアルを、必要な分だけフォーマットします。
.Pp
.Dl $ catman -f /usr/local/man/man1 /usr/local/man/manl
.Pp
.Pa /usr/local/man/man1
と
.Pa /usr/local/man/manl
以下のマニュアルを強制的にフォーマットしなおします。
.Pp
.Dl $ catman -p /usr/X11/man
.Pp
何が行われるかを表示するだけです。
.Sh 関連ファイル
.Pa /etc/periodic/weekly/330.catman
このプログラムを起動します
.Sh 特徴
既に全てのマニュアルがフォーマットされている場合、
動作が非常に速くなります。
いくつかのシステムで採用されている
.Fl w
はサポートされていません。
.Ql whatis
データベースを再構築するには
.Xr makewhatis 1
を使って下さい。
.Sh バグ
.Xr man 1
は setuid プログラムです。ユーザ
.Sq man
が cat 形式のマニュアルを格納するディレクトリに
対して書き込み権限を持つように注意して下さい。
.Nm catman
は
.Sq .so
というマニュアルをチェックしません。
マニュアルの必要以上のフォーマットを避けるには
ハードリンク、シンボリックリンクを使って下さい。
.Sh 関連項目
.Xr makewhatis 1 ,
.Xr man 1 ,
.Xr manpath 1
.Sh 歴史
このバージョンの
.Nm catman
は
.Fx 2.1
から付属されました。
.Sh 作者
Wolfram Schneider
.Aq wosch@FreeBSD.org ,
Berlin.
