freebsd/freebsd-doc/ja_JP.eucJP/man/man1/fdformat.1
.\" Copyright (C) 1993, 1994, 1995, 2001 by Joerg Wunsch, Dresden
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/fdformat/fdformat.1,v 1.17.2.6 2002/06/21 16:40:26 charnier Exp %
.\"
.\" $FreeBSD$
.Dd July 2, 2001
.Os
.Dt FDFORMAT 1
.Sh 名称
.Nm fdformat
.Nd フロッピディスクのフォーマット
.Sh 書式
.Nm fdformat
.Op Fl q
.Op Fl y
.Op Fl v | Fl n
.Op Fl f Ar capacity
.Op Fl c Ar cyls
.Op Fl s Ar secs
.Op Fl h Ar heads
.Nm fdformat
.Op Fl r Ar rate
.Op Fl g Ar gap3len
.Op Fl i Ar intleave
.Op Fl S Ar secshft
.Op Fl F Ar fillbyte
.Op Fl t Ar steps_per_track
.Ar device_name
.Sh 解説
.Nm
ユーティリティは、
.Ar device_name
デバイスのフロッピディスクをフォーマットします。
.Ar device_name
は、フロッピディスクドライブのデバイスノードのフルパス名
(例えば
.Pa /dev/fd0 )
か、省略形式のデフォルト名
(例えば
.Em fd0 )
です。
後者の場合、
.Ar device_name
は、与えられた名前に
.Pa /dev/
を付け加え、後に
.Em .capacity
をつけくわえることで作成されます。
.Nm
は、ジオメトリ情報を書き換えるため、
デバイスノード
(マイナデバイス番号)
に割り当てられたどんなジオメトリ情報も意味を持ちません。
.Pp
次のようなオプションがあります。
.Bl -tag -width 10n -offset indent
.It Fl q
コマンドからの出力を抑制し、
.Ar device_name
のフロッピディスクをフォーマットしても良いかどうかの確認も行いません。
.It Fl y
自動的に "yes" と応答することにより確認要求を抑制します。
フォーマット状態の報告はまだ行います。
.It Fl f Ar capacity
望ましいフォーマットパラメータの設定をする普通の方法です。
360, 720, 800, 820, 1200, 1440, 1480, 1720 のいずれかが有効です。
.Ar capacity
は、フォーマットするバイト数です。
.It Fl n
フォーマットした後で、ベリファイしません。
.It Fl v
ベリファイだけを行い、フォーマットしません。
.It Fl c Ar cyls
シリンダ数: 40 または 80。
.It Fl s Ar secs
トラックあたりのセクタ数: 9, 10, 15, 18 のいずれか。
.It Fl h Ar heads
フロッピのヘッド数: 1 か 2。
.It Fl r Ar rate
データレート: 250, 300, 500 のいずれか (単位は kbps)。
.It Fl g Ar gap3len
ギャップ長。
.It Fl i Ar intleave
インタリーブファクタ。
.It Fl S Ar secshft
セクタサイズ: 0=128, 1=256, 2=512 (単位は バイト)。
.It Fl F Ar fillbyte
フィルバイト。
.It Fl t Ar steps_per_track
トラックあたりのステップ数。
フロッピディスクに書き込む、ジオメトリ情報を指定する別の方法です。
.El
.Pp
.Fl q
フラグが指定されていない時、フォーマットを行う時に確認が行われます。
フォーマットを続行するためには、
.Dq y
を必ず入力して、答える必要があります。
.Pp
.Nm
は、低レベルのフォーマットだけを行うことに注意してください。
ファイルシステムを作りたい時には、
.Em ufs
ファイルシステム( UNIX ファイルシステム)を作りたい場合は、
.Xr newfs 8
コマンドを、
.Em MS-DOS (FAT)
ファイルシステムを作りたい時には、
.Xr newfs_msdos 8
コマンドを、参照してください。
.Sh 診断
.Fl q
が指定されていないと、ユーザにプログラムの進度を知らせるために、
標準出力に特定の 1 文字が表示されます。
最初に、
(複数の)トラックがフォーマットされている時には
.Sq Em F
が表示され、
ベリファイを行っている時には
.Sq Em V
が表示されます。
エラーが見付かった場合には、最後に
.Sq Em E
に変化します。
詳細な情報 (シリンダ・ヘッダ・セクタの番号と厳密なエラー原因) は、
最大 10 個のエラーに対して表示されます。
.Pp
終了ステータスは、操作が成功した時 0 を返します。
フロッピをフォーマットしている時にエラーが起こった時は 1 を返し、
間違ったコマンドライン引数が与えられた時に 2 を返します
(診断出力に詳しい情報がでるので従ってください)。
.Sh 関連項目
.Xr fdc 4 ,
.Xr newfs 8 ,
.Xr newfs_msdos 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 386 0.1
のために開発され、
新しい
.Xr fdc 4
フロッピディスクドライバにアップグレードされました。
これは、後に
.Fx 1.1
システムの一部となりました。
.Sh 作者
.An -nosplit
このプログラムは、
Dresden の
.An J\(:org Wunsch
のコントリビューションです。
変更は、モスクワの
.An Serge Vakulenko
と
.An Andrey A. Chernov
が行いました。
