freebsd/freebsd-doc/ja_JP.eucJP/man/man1/fdformat.1
.\" Copyright (C) 1993, 1994, 1995, 2001 by Joerg Wunsch, Dresden
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/fdformat/fdformat.1,v 1.28 2002/01/10 17:04:10 ru Exp %
.\"
.\" $FreeBSD$
.Dd December 25, 2001
.Os
.Dt FDFORMAT 1
.Sh 名称
.Nm fdformat
.Nd フロッピディスクのフォーマット
.Sh 書式
.Nm
.Op Fl F Ar fill
.Op Fl f Ar fmt
.Op Fl s Ar fmtstr
.Op Fl nqvy
.Ar device
.Sh 解説
.Nm
ユーティリティは、
.Ar device
のフロッピディスクをフォーマットします。
.Ar device
は、フロッピディスクドライブのデバイスノードのフルパス名
(例えば
.Pa /dev/fd0 )
か、
.Pa /dev
下で検索される省略名
(例えば
.Dq Li fd0 )
です。
.Pp
次のようなオプションがあります。
.Bl -tag -width ".Fl s Ar fmtstr"
.It Fl F Ar fill
.Ar fill
を新規フォーマットセクタを埋めるバイトとして使用します。
.Ar fill
は、一般の C 言語表現における 0 から 255 の範囲の値であることが必要です。
デフォルト値は
.Dq Li 0xf5
です。
.It Fl f Ar fmt
.Xr fdcontrol 8
に記述されるように、
.Ar fmt
キロバイトフォーマット用の密度設定を指定します。
.It Fl s Ar fmtstr
.Xr fdcontrol 8
に記述されるように、密度設定を明示的なパラメータを使用して指定します。
.It Fl n
フォーマットした後で、ベリファイしません。
.It Fl q
コマンドからの出力を抑制し、
.Ar device
のフロッピディスクをフォーマットしても良いかどうかの確認も行いません。
.It Fl v
ベリファイだけを行い、フォーマットしません。
.It Fl y
フロッピディスクのフォーマット実行の確認要求を抑制します。
フォーマット状態の報告はまだ行います。
.El
.Pp
非自動選択サブデバイスでは、
.Fl f Ar fmt
も
.Fl s Ar fmtstr
も指定してはなりません。
カーネルドライバによって設定済のメディア密度が常に使用されるからです。
一方、
.Ar device
が自動メディア密度選択のデバイスの場合 (
.Xr ( fdc 4
参照)、どちらの方法を使用することでも、
新規フォーマット済メディアに使用された密度設定を変えることができます
(これは
.Ar device
の密度設定を永続的に変えることなく可能です)。
.Pp
.Fl q
フラグが指定されていない時、フォーマットを行う時に確認が行われます。
フォーマットを続行するためには、
.Ql y
を必ず入力して、答える必要があります。
.Pp
.Nm
は、低レベルのフォーマットだけを行うことに注意してください。
ファイルシステムを作りたい時には、
.Tn UFS
ファイルシステム( UNIX ファイルシステム)を作りたい場合は、
.Xr newfs 8
コマンドを、
.Tn MS-DOS
(FAT)
ファイルシステムを作りたい時には、
.Xr newfs_msdos 8
コマンドを、参照してください。
.Sh 診断
.Fl q
が指定されていないと、ユーザにプログラムの進度を知らせるために、
標準出力に特定の 1 文字が表示されます。
最初に、
(複数の)トラックがフォーマットされている時には
.Ql F
が表示され、
ベリファイを行っている時には
.Ql V
が表示されます。
エラーが見付かった場合には、最後に
.Ql E
に変化します。
詳細な情報 (シリンダ・ヘッダ・セクタの番号と厳密なエラー原因) は、
フォーマット処理の完了後に、
最大 10 個のエラーに対して表示されます。
.Sh 診断
終了ステータスは、操作が成功した時 0 を返します。
フロッピをフォーマットしている時にエラーが起こった時は 1 を返し、
間違ったコマンドライン引数が与えられた時に 2 を返します
(診断出力に詳しい情報がでるので従ってください)。
.Sh 関連項目
.Xr fdc 4 ,
.Xr fdcontrol 8 ,
.Xr newfs 8 ,
.Xr newfs_msdos 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 386 0.1
のために開発され、
新しい
.Xr fdc 4
フロッピディスクドライバにアップグレードされました。
これは、後に
.Fx 1.1
システムの一部となりました。
.Fx 5.0
からは、
.Xr fdcontrol 8
に記載された、統合密度指定を使用します。
.Sh 作者
.An -nosplit
このプログラムは、
Dresden の
.An J\(:org Wunsch
のコントリビューションです。
変更は、モスクワの
.An Serge Vakulenko
と
.An Andrey A. Chernov
が行いました。
