freebsd/freebsd-doc/ja_JP.eucJP/man/man1/hostname.1
.\" Copyright (c) 1983, 1988, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hostname.1	8.2 (Berkeley) 4/28/95
.\" %FreeBSD: src/bin/hostname/hostname.1,v 1.16 2004/07/02 21:04:18 ru Exp %
.\" $FreeBSD$
.\"
.Dd April 28, 1995
.Dt HOSTNAME 1
.Os
.Sh 名称
.Nm hostname
.Nd 現在のホスト名の表示、設定
.Sh 書式
.Nm
.Op Fl s
.Op Ar name-of-host
.Sh 解説
.Nm
ユーティリティは、現在のホストの名前を表示します。
スーパユーザは、引数を与えることでホスト名の設定をすることもできます。
これは通常、ブート時にネットワークの初期化スクリプトである
.Pa /etc/rc.network
の中で行なわれます。
このスクリプトは、
.Pa /etc/rc.conf
中の
.Va hostname
変数を使用します。
.Pp
オプションとしては、以下のものがあります。
.Bl -tag -width flag
.It Fl s
名前からドメイン情報を取り除いて表示します。
.El
.Sh 関連項目
.Xr gethostname 3 ,
.Xr rc.conf 5
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.2
から登場しています。
