freebsd/freebsd-doc/ja_JP.eucJP/man/man1/install-info.1
.\"
.\" Copyright (c) 1997 David E. O'Brien (obrien@FreeBSD.org)
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/gnu/usr.bin/texinfo/install-info/install-info.1,v 1.2.2.2 1999/09/23 13:43:31 phantom Exp %
.\"
.\" .TH install-info 1
.Dd August 29, 1997
.Dt INSTALL-INFO 1
.Os BSD
.Sh 名称
.Nm install-info
.Nd GNU info ハイパーテキストシステム用の info/dir ファイルを編集する
.Sh 書式
.Nm install-info
.Ar program.info info/dir
.Sh 解説
.Nm
は FreeBSD ports コレクションでよく利用されます。
.Sh 関連ファイル
.Bl -tag -width "/usr/share/info/dir" -compact
.It Pa "/usr/share/info/dir"
.It Pa "/usr/local/info/dir"
.El
.I F
.Sh 関連項目
.Xr info 1
.\" .Sh 診断
.\" なし。
.\" .Sh バグ
.\" 知られているものはありません。
.Sh 作者
このマニュアルページは
.An David O'Brien Aq obrien@NUXI.com
によって
書かれました。
.\" .Sh HISTORY
.\" .Nm 
.\" appeared in FreeBSD 2.1.
