freebsd/freebsd-doc/ja_JP.eucJP/man/man1/kbdcontrol.1
.\"
.\" kbdcontrol - a utility for manipulating the syscons keyboard driver section
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)kbdcontrol.1
.\" %FreeBSD: src/usr.sbin/kbdcontrol/kbdcontrol.1,v 1.18.2.4 2000/12/08 15:28:19 ru Exp %
.\"
.\" jpman %Id: kbdcontrol.1,v 1.3 1997/07/26 21:37:54 horikawa Stab %
.\"
.Dd June 30, 1999
.Dt KBDCONTROL 1
.Os FreeBSD
.Sh 名称
.Nm kbdcontrol
.Nd syscons コンソールドライバを操作するユーティリティ
.Sh 書式
.Nm
.Op Fl dFKix
.Op Fl b Ar duration.pitch | Ar belltype
.Op Fl r Ar delay.repeat | Ar speed
.Op Fl l Ar keymap_file
.Op Fl f Ar # Ar string
.Op Fl h Ar size
.Op Fl k Ar keyboard_device
.Op Fl L Ar keymap_file
.Sh 解説
.Nm
コマンドは、
キーマップ、リピート速度/ディレイ時間、ベル
といった様々なキーボード関連オプションを、
.Xr syscons 4
コンソールドライバとキーボードドライバに対して設定するのに用いられます。
.Pp
キーボードオプションは、
.Pa /etc/rc.conf
中の変数を設定することにより、
システムブート時に自動設定可能です。
後述の
.Sx ブート時の設定
を参照してください。
.Pp
以下のコマンドラインオプションを使用可能です:
.Bl -tag -width indent
.It Fl b Ar duration.pitch | Ar belltype
ベルの持続時間 (duration) をミリ秒で、ピッチ (pitch) をヘルツで設定します。
代わりに
.Ar belltype
引数が指定された場合、この引数は
.Cm normal
(サウンドパラメータを標準値に戻します) か
.Cm off
(完全にベルをオフにします) か
.Cm visual
(ベルをビジュアルモードにします、
すなわち音を鳴らす代わりに画面をフラッシュさせます)
のいずれかであることが必要です。
.Ar belltype
の前に語
.Cm quiet.
.\" quiet. と、「.」が付くのが正しい
が付いた場合、
ベルを鳴らすプロセスがバックグラウンドの vty にいるときにはベルを鳴らしません。
.It Fl r Ar delay.repeat | Ar speed
キーボードの
.Ar delay
(250, 500, 750, 1000)
と
.Ar repeat
(34, 38, 42, 46, 50, 55, 59, 63, 68, 76, 84, 92, 100, 110, 118, 126, 
136, 152, 168, 184, 200, 220, 236, 252, 272, 304, 336, 368, 400, 440,
472, 504)
レートを設定します。
代わりに
.Ar speed
引数が指定された場合、この引数は
.Cm slow
(1000.504),
.Cm fast
(250.34),
.Cm normal
(500.126)
であることが必要です。
.It Fl l Ar keymap_file
キーボードマップをファイル
.Ar keymap_file
から読み取って設定します。
キーボードマップファイルのロードは、
メニューによるコマンド
.Xw kbdmap 1
により実行可能です。
.It Fl d
現在のキーボードマップを標準出力にダンプします。
出力はファイルにリダイレクト可能であり、前述の
.Fl l
オプションを使用して後でカーネルにロードできます。
.It Fl f Ar # Ar string
.Ar #
番のファンクションキーで文字列
.Ar string
が送られるように設定します。
使用可能なファンクションキーとその番号については、
キーボードドライバのマニュアルページ
.Pq 例えば Xr atkbd 4
を参照してください。
.It Fl F
ファンクションキー設定を標準状態に戻します。
.It Fl x
キーボードマップのダンプを 16 進数表示で行います。
.It Fl h Ar size
ヒストリバッファの大きさを
.Ar size
行に設定します。
.It Fl i
キーボードに関する短かい情報を表示します。
.It Fl K
コンソールからキーボードを切り離します。
キーボードとコンソールを再接続するためには、後述の
.Fl k
オプションを使用する必要があります。
.It Fl k Ar keyboard_device
指定したデバイスをコンソールキーボードとして使用します。
本オプション使用時にシステムコンソール上で作業していない場合には、
.Nm
プロセスの標準入力を
.Pa /dev/console
からリダイレクトする必要があります (
.Sx EXAMPLES
節を参照してください)。
.It Fl L Ar keymap_file
キーボードマップをファイル
.Ar keymap_file
から読み取り、これをコンパイルした結果の
.Ft "struct keymap"
を標準出力に書き出します。
このオプションは第一にプログラマ向けであり、
おそらく通常の状況下ではほとんど使用しないでしょう。
.El
.Sh キーボードの設定
.Ss ブート時の設定
.Pa /etc/rc.conf
または
.Pa /etc/rc.conf.local
の変数を設定することにより、ブート時にキーボードを設定可能です。
関連する変数を列挙します。
.Pp
.Bl -tag -width foo_bar_var -compact
.It Ar keymap
.Fl l
オプション用のキーボードマップファイルを指定します。
.It Ar keyrate
.Fl r
オプション用のキーボードリピートレートを指定します。
.It Ar keychange
.Fl f
オプション用のファンクションキー文字列を列挙します。
.El
.Pp
詳細は
.Xr rc.conf 5 
を参照してください。
.Ss ドライバの設定
キーボードマップなどのデフォルト設定オプションの変更を、
キーボードドライバが許す場合があります。
その場合、ブート時のオプション設定の必要はなくなります。
詳細はキーボードドライバマニュアル
.Pq 例えば Xr atkbd 4 , Xr ukbd 4
を参照してください。
.Sh 関連ファイル
.Bl -tag -width /usr/share/syscons/keymaps/foo_bar -compact
.It Pa /usr/share/syscons/keymaps/*
キーボードマップファイル。
.Sh 使用例
次のコマンドでキーボードマップファイル
.Pa /usr/share/syscons/keymaps/ru.koi8-r.kbd
をロードします。
.Pp
.Dl kbdcontrol -l /usr/share/syscons/keymaps/ru.koi8-r.kbd
.Pp
キーボードマップファイルが
.Pa /usr/share/syscons/keymaps
にある場合、ファイル名を
.Pa ru.koi8-r
のように短縮可能です。
.Pp
.Dl kbdcontrol -l ru.koi8-r
.Pp
次のコマンドはファンクションキー 10 が "telnet myhost" を出力するようにします。
.Pp
.Dl kbdcontrol -f 10 \&"telnet myhost\&"
.Pp
ベルをビジュアルにするものの、
バックグラウンド画面でベルが鳴るときには画面がフラッシュするのを避けるには、
次のコマンドを実行します。
.Pp
.Dl kbdcontrol -b quiet.visual
.Pp
.Pp
デフォルトコンソールキーボードを別のキーボード、
例えば最初の USB キーボード (
.Xr ukbd 4
を参照してください) に切り替えるには、次のコマンドを使用します。
.Pp
.Dl kbdcontrol -k /dev/kbd1 < /dev/console
.Pp
デフォルトキーボードに戻すには、次のコマンドを使用します。
.Pp
.Dl kbdcontrol -k /dev/kbd0
.Sh バグ
もし見つかったら報告してください。
.Sh 関連項目
.Xr kbdmap 1 ,
.Xr vidcontrol 1 ,
.Xr atkbd 4 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr ukbd 4 ,
.Xr kbdmap 5 ,
.Xr rc.conf 5
.Sh 作者
.An S\(/oren Schmidt Aq sos@FreeBSD.org
.Sh 日本語訳
酒井 淳嗣 (sakai@csl.cl.nec.co.jp): FreeBSD 向けに翻訳
