freebsd/freebsd-doc/ja_JP.eucJP/man/man1/kbdmap.1
.\" Copyright (c) March 1995 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/kbdmap/kbdmap.1,v 1.29 2002/07/03 14:56:08 markm Exp %
.\" $FreeBSD$
.Dd March 25, 1995
.Dt KBDMAP 1
.Os
.Sh 名称
.Nm kbdmap ,
.Nm vidfont
.Nd syscons 用フロントエンド
.Sh 書式
.Nm
.Op Fl K
.Op Fl V
.Op Fl d | Fl default
.Op Fl h | Fl help
.Op Fl l | Fl lang Ar language
.Op Fl p | Fl print
.Op Fl r | Fl restore
.Op Fl s | Fl show
.Op Fl v | Fl verbose
.Sh 解説
.Nm
ユーティリティは有効なキーマップを容易に設定するコマンドです。
同様に
.Nm vidfont
はフォントを設定します。
いずれもデータベース中の記述 (description) を探します。
この記述は英語 (デフォルト) あるいは他の言語で書かれています。
両コマンドともキーマップおよびフォントのデータベースを検査します。
デフォルトでは英語で記述されていますが、他の言語でなされても構いません。
これらのプログラムは対話的であり、
ユーザからの必要な入力 (例えばキーマップ選択)
を得るために端末出動作するものと期待します。
.Pp
.Tn MSDOS
コードページのキーマップやフォントを使用しないよう強く勧めます。
可能であれば
.Tn ISO
標準バージョンを使ってください!
.Tn X11
は
.Tn MSDOS
コードページをサポートしません。
.Pp
次のオプションが利用可能です:
.Bl -tag -width Ds
.It Fl K
.Nm
としてコマンドを実行します。
.It Fl V
.Nm vidfont
としてコマンドを実行します。
.It Fl d , Fl default
デフォルト言語を使用します。
.Ev LANG
環境変数は無視されます。
.It Fl h , Fl help
オプション一覧を表示して終了します。
.It Fl l , Fl lang Ar language
記述およびメニューの表示に言語
.Ar language
を用います。
.It Fl p , Fl print
標準出力に使用可能なキーマップもしくはフォントを表示し、終了します。
.It Fl r , Fl restore
.Pa /etc/rc.conf
からデフォルトフォントをロードします。
.It Fl s , Fl show
現在サポートしている言語を表示して終了します。
.It Fl v , Fl verbose
通常よりきめ細かく警告メッセージを出力します。
.El
.Sh 環境変数
.Bl -tag -width LANG -compact
.It Ev LANG
希望する言語。
.El
.Sh 関連ファイル
.Bl -tag -width /usr/share/syscons/keymaps/INDEX.keymaps -compact
.It Pa /usr/share/syscons/keymaps/INDEX.keymaps
キーマップのデータベース
.It Pa /usr/share/syscons/fonts/INDEX.fonts
フォントのデータベース
.It Pa /etc/rc.conf
デフォルトのフォント
.It Pa /usr/X11/lib/X11/locale/locale.alias
共通な
.Ev LANG
に関する記述
.El
.Sh バグ
.\" .Nm kbdmap/vidfont
.\" does not know which font is in use. E.g. if the current font
.\" is iso-8859-1 and you chose lang 'ru' (for Russian)
.\" you get funny latin1 characters and not russkij shrift.
.\"
.Nm
および
.Nm vidcontrol
のユーティリティは (仮想) コンソールでのみ機能します。
.Tn X11
上では動作しません。
.Sh 関連項目
.Xr dialog 1 ,
.Xr kbdcontrol 1 ,
.Xr vidcontrol 1 ,
.Xr kbdmap 5 ,
.Xr rc.conf 5
.Sh 歴史
.Nm
および
.Nm vidfont
コマンドは
.Fx 2.1
から登場しました。
.Sh 作者
.An Wolfram Schneider
がオリジナルの Perl バージョンを書きました。
元バージョンは、
.Fx 5.0
向きに
.An Jonathan Belson
.Aq jon@witchspace.com
が C で書き直したものです。
.Sh 日本語訳
酒井 淳嗣(sakai@csl.cl.nec.co.jp): FreeBSD向けに翻訳
