freebsd/freebsd-doc/ja_JP.eucJP/man/man1/login.1
.\"	%NetBSD: login.1,v 1.5 1994/12/23 06:53:00 jtc Exp %
.\"
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)login.1	8.2 (Berkeley) 5/5/94
.\" %FreeBSD: src/usr.bin/login/login.1,v 1.13.2.3 2000/01/14 11:15:25 sheldonh Exp %
.\"
.\" jpman %Id: login.1,v 1.3 1997/05/19 16:39:53 horikawa Stab %
.Dd May 5, 1994
.Dt LOGIN 1
.Os BSD 4
.Sh 名称
.Nm login
.Nd 指定したユーザでログインする
.Sh 書式
.Nm
.Op Fl fp
.Op Fl h Ar hostname
.Op Ar user
.Sh 解説
.Nm
は、指定したユーザでログインするものです。
.Pp
user を指定しなかった場合、もしくは指定した user でのログインに失敗した
ときには、
.Nm
は、再度ユーザ名の入力を求めるプロンプトを表示します。
ユーザの確認は入力されたパスワードにより行われます。
.Pp
オプションとしては以下のものがあります:
.Bl -tag -width Ds
.It Fl f
パスワードによるユーザの確認を省略します。このオプションは、スーパーユーザ
か、すでにログインしているユーザが同じユーザ名で login を実行す
るときのみ指定可能です。
.It Fl h
コネクションを受信可能なホスト名を指定します。この機能は
.Xr telnetd 8
などのデーモンによって使われています。このオプションはスーパーユーザ
しか指定することができません。
.It Fl p
.Nm
は、デフォルトでは実行時の環境 (環境変数など) を引き継ぎ
ませんが、このオプションを指定すると、実行時の環境を引き継ぎます。
.El
.Pp
もし
.Pa /var/run/nologin
ファイルが存在した場合、
.Nm
はそのファイル内容
を表示してログイン処理をせずに終了します。この機能は
.Xr shutdown 8
で使用されており、システムの終了処理実行中にユーザがログインしないよう
にしています。
.Pp
もし
.Pa /etc/login.access
ファイルが存在した場合、
.Nm
はそのファイルから、ユーザとホストの組が特別に許可されている、もしくは
拒否されているかどうかをチェックします。
.Pp
もし
.Pa /etc/fbtab
ファイルが存在した場合、
.Nm
はそのファイルに記述された幾つかのデバイスのプロテクトと所有者を変えます。
.Pp
ファイル
.Pa /etc/skeykeys
が存在する場合、このファイル中にユーザのエントリが存在する時には、
.Nm
は S/key パスワード認証を行います。
.Pa /etc/skey.access
により、
接続元のホストやネットワークに応じて S/key パスワード使用の義務を制御します。
.Pp
通常、ユーザがログインすると、
.Nm
はシステムのコピーライト表示、
ユーザが最後にログインした日付と時間、その日のメッセージなどの
情報を表示します。ただし、ユーザのホームディレクトリに
.Dq Pa .hushlogin
というファイルが存在した場合は、これらのメッセージを表示
しないようにします (これは
.Xr uucp 1
のようなプログラムがユーザとしてログインするためにあります)。
このあと、
.Nm
は
.Xr wtmp 5
と
.Xr utmp 5
ファイルに記録し、ユーザのコマンドインタプリタ (シェル) を起動します。
.Pp
なお、環境変数 (
.Xr environ 7 )
HOME, SHELL, PATH, TERM, LOGNAME, USER は
.Nm
によりセットされます。
他の環境変数はログインクラスケーパビリティデータベースの
エントリにより設定されるかも知れません。
ログインクラスはユーザのシステムパスワードレコードに割り当てられています。
ログインクラスは、当該ログインに許された最大および現在の資源制約、
プロセス優先度や他の多くのユーザログイン環境を制御します。
.Pp
シェルによっては、本ユーティリティと似たまたは同じ、組み込みの
.Nm
コマンドを提供するものがあります。
.Xr builtin 1
マニュアルページを参照してください。
.Sh 関連ファイル
.Bl -tag -width /var/mail/userXXX -compact
.It Pa /etc/fbtab
デバイスのプロテクトの変更
.It Pa /etc/login.access
ログインアクセス制御表
.It Pa /etc/login.conf
ログインクラスケーパビリティデータベース
.It Pa /etc/motd
ログイン時に最初に表示するメッセージ
.It Pa /var/run/nologin
ログインを拒否する時に表示するメッセージ
.It Pa /etc/skey.access
skey パスワード制御表
.It Pa /etc/skeykeys
skey パスワードデータベース
.It Pa /var/run/utmp
現在のログイン状況
.It Pa /var/log/lastlog
最後にログインした記録
last login account records
.It Pa /var/log/wtmp
ログイン・ログアウト状況
.It Pa /var/mail/user
ユーザごとのメイルボックス
.It Pa \&.hushlogin
ログインメッセージを抑止するファイル
.It Pa /etc/auth.conf
認証サービスの設定
.El
.Sh 関連項目
.Xr builtin 1 ,
.Xr chpass 1 ,
.Xr csh 1 ,
.Xr passwd 1 ,
.Xr rlogin 1 ,
.Xr skey 1 ,
.Xr getpass 3 ,
.Xr fbtab 5 ,
.Xr login.access 5 ,
.Xr login.conf 5 ,
.Xr nologin 5 ,
.Xr skey.access 5 ,
.Xr utmp 5 ,
.Xr environ 7 ,
.Xr nologin 8 ,
.Xr pam 8
.Sh 歴史
.Nm login
ユーティリティは
.At v6
から登場しました。
