freebsd/freebsd-doc/ja_JP.eucJP/man/man1/makewhatis.1
.\" Copyright (c) 1994-1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/gnu/usr.bin/man/makewhatis/makewhatis.1,v 1.14.2.6 2001/08/16 10:14:57 ru Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man1/makewhatis.1,v 1.10 2001/07/29 05:14:51 horikawa Exp $
.Dd January 12, 1995
.Dt MAKEWHATIS 1
.Os
.Sh 名称
.Nm makewhatis
.Nd whatis databaseを作る
.Sh 書式
.Nm makewhatis
.Op Fl a | Fl append
.Op Fl h | Fl help
.Op Fl i | Fl indent Ar column
.Op Fl L | Fl locale
.Op Fl n | Fl name Ar name
.Op Fl o | Fl outfile Ar file
.Op Fl v | Fl verbose
.Op Ar directories ...
.Sh 解説
.Nm
コマンドはフォーマットされていないマニュアルページから名称と短い記述を抽出し、
.Xr whatis 1
データベースを作成します。
.Nm
コマンドは gzip されたマニュアルページを読むことができます。
.Ar directory
は (
.Pa man.+
という名の)
マニュアルページサブディレクトリを持つディレクトリの名前です。
コロンは空白として扱われますので、
.Ic makewhatis $MANPATH
や
.Ic makewhatis `manpath`
も許されます。
.Sh オプション
.Bl -tag -width Ds
.It Fl a , Fl append
追加モード。
whatis データベースに既にあるエントリは削除しません。
注: 新しくできるデータベースはソートされ、同じ項目の行は削除されますが、
.Nm
は古いエントリが有効かどうかは判定しません。
.It Fl h , Fl help
使用可能なオプションを表示し、終了します。
.It Fl i , Fl indent Ar column
解説の文字列の長さを
.Ar column にします
(デフォルトは 24 です)。
.It Fl L , Fl locale
ロケール環境変数を調査し、
ローカライズされたマニュアルサブディレクトリと
本エントリのみに使用する処理を調べます。
.It Fl n , Fl name Ar name
.Pa whatis
の代わりに
.Ar name
を使用します。
.It Fl o , Fl outfile Ar file
.Pa dirname/whatis
の代わりに全ての出力を
.Ar file
に書き込みます。
.It Fl v , Fl verbose
多くの警告を
(標準エラー出力に対して)
出力します。
パースした全てのマニュアルに対して次の 1 文字を表示します:
.Ql .\&
は圧縮されていないページ、
.Ql *
は圧縮されているページ、
.Ql +
はリンクをそれぞれ表します。
.Sh 使用例
.Ic makewhatis $MANPATH
.Pp
ユーザの
.Pa $MANPATH
にある全てのディレクトリに対して whatis データベースを作成します。
.Pp
.Ic makewhatis -outfile /tmp/mywhatis /usr/local/man $HOME/man
.Pp
whatis データベース
.Pa /tmp/mywhatis
を作成します。
ディレクトリは
.Pa /usr/local/man
と
.Pa $HOME/man
を見ます。
.Pa /usr/local/man/whatis
および
.Pa $HOME/man/whatis
は作成しません。
.Pp
.Ic makewhatis -name windex $HOME/man
.Pp
.Pa whatis
の代わりに
whatis データベース
.Pa windex
を作成します。
おそらく Solaris で有効です。
.Sh 関連ファイル
.Bl -tag -width /etc/master.passwdxx -compact
.It Pa */man/whatis
whatis データベース。
.It Pa /etc/periodic/weekly/320.whatis
毎週
.Nm makewhatis.local
を実行します。
.El
.Sh 関連項目
.Xr apropos 1 ,
.Xr catman 1 ,
.Xr getNAME 1 ,
.Xr man 1 ,
.Xr manpath 1 ,
.Xr sort 1 ,
.Xr uniq 1 ,
.Xr whatis 1 ,
.Xr makewhatis.local 8
.Sh 歴史
この
.Nm
コマンドは
.Fx 2.1
から登場しました。
.Sh 作者
.An Wolfram Schneider ,
Berlin.
