freebsd/freebsd-doc/ja_JP.eucJP/man/man1/msgs.1
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)msgs.1	8.2 (Berkeley) 4/28/95
.\" %FreeBSD: src/usr.bin/msgs/msgs.1,v 1.9.2.1 2000/08/27 17:31:43 gshapiro Exp %
.\" jpman %Id: msgs.1,v 1.2 1997/03/29 06:23:20 horikawa Stab %
.\"
.Dd April 28, 1995
.Dt MSGS 1
.Os BSD 4
.Sh 名称
.Nm msgs
.Nd システムからのメッセージを読むための簡単なメールプログラム
.Sh 書式
.Nm
.Op Fl fhlpq
.Op Ar number
.Op Ar \-number
.Nm msgs
.Op Fl s
.Nm msgs
.Op Fl c
.Op \-days
.Sh 解説
.Nm
は、システムからのメッセージを読むためのプログラムです。
これらのメッセージはユーザ `msgs' あてにメールを送ることで送信されます。
これらのメッセージは、ユーザがシステムにログインした時に、
システムからの簡単なメッセージを一度だけ表示するのに便利です。
.Pp
.Nm
を
.Pa .login
ファイル 
(
.Xr sh 1
を使っているならば、
.Pa .profile
) に書いておくことによって、
ログインするたびに
.Nm
が実行されます。
もし、新しいメッセージがあれば、誰からのメッセージかという情報と、
Subject とを表示します。
もし Subject 行が無ければ、先頭の空行でない数行を表示します。
もし、より多くのメッセージがあれば、残りのメッセージ量を示し、
残りのメッセージを見るかどうかを尋ねます。
返事としては、以下のものを使うことができます:
.Bl -tag -width Fl
.It Ic y
メッセージを表示します。
.It Ic RETURN
y と同じです。
.It Ic n
このメッセージをスキップして、次のメッセージに行きます。
.It Fl
最後に表示したメッセージを再表示します。
.It Ic q
.Nm
を終了します。次回には読まなかったメッセージを読むことができます。
.It Ic s
メッセージをセーブします。現在のメッセージをカレントディレクトリの 
``Messages'' というファイルに追加します。
`s\-' は表示する前にセーブします。
`s' や `s\-' はその後ろに空白をはさんでセーブするファイル名を指定できます。
.It Ic m
指定されたメッセージを、一時的な mailbox としてファイルに記録し、
.Xr mail  1
を起動して、記録したファイルをメールとして扱うことができるようにします。
`m' , `s' コマンドは、`-' の代わりに数字の引数を受け付けます。
.El
.Pp
.Nm
は、各ユーザのホームディレクトリの
.Pa \&.msgsrc
に記録されている番号を読み込んで、新たに読むべきメッセージを決定します。
.Pa /var/msgs
というディレクトリには、(シーケンシャルな)メッセージ番号を
ファイル名として格納しています。
.Pa /var/msgs/bounds
というファイルには、
このディレクトリにあるメッセージの一番小さな番号と大きな番号を記録しています。
これにより、
.Nm
はメッセージがあるかどうか、ただちに判定できます。
.Pa bounds
の内容が壊れている場合は、このファイルを削除することで、次回
.Fl s
オプション付きで起動されたときに、新しく
.Pa bounds
を作成します。
.Nm
が
.Fl s
以外のオプションを指定されて実行された場合、
.Pa /var/msgs/bounds
が存在しないとエラーが表示されます。
.Pp
.Fl s
オプションは、メッセージの配送を設定する時に使います。
.Pp
.Dl msgs: \&"\&| /usr/bin/msgs \-s\&"
.Pp
という行を
.Pa /etc/mail/aliases
に挿入して (
.Xr newaliases 1 
参照)、メッセージを投函できるようにします。
.Pp
.Fl c
オプションは
.Pa /var/msgs
をクリアするために使います。
.Nm
を
.Fl c
つきで実行するシェルスクリプトのエントリを、
.Pa /etc/periodic/daily
(
.Xr periodic 8
参照)
に記述して、毎晩実行するようにするといいでしょう。
これで、21 日より古いメッセージを消すことができます。
デフォルトの日付を変更するにはコマンドラインで設定する必要があります。
.Pp
メッセージを読む時のオプションとしては以下のものがあります:
.Bl -tag -width Fl
.It Fl f
``No new messages.'' を表示しません。これは、
.Pa .login
ファイルなどに
.Nm
を書いておく場合に便利です。
.It Fl q
メッセージがある場合に、``There are new messages.'' と表示するようにし
ます。
.Pa .login
ファイルなどに ``msgs \-q'' と書いておくと便利です。
.It Fl h
メッセージの最初の部分だけを表示します。
.It Fl l
ローカルに作られたメッセージだけを報告します。
.It Ar num
コマンドラインから番号を与えると、
.Pa \&.msgsrc
に記録されている番号を使わずに、指定した番号以降のメッセージを表示します。
つまり、
.Pp
.Dl msgs \-h 1
.Pp
は、すべてのメッセージのはじめの部分を表示します。
.It Ar \-number
.Pa \&.msgsrc
に記録されている番号より
.Ar number
分だけ戻ったメッセージから表示します。最近のメッセージを見るのに便利です。
.It Fl p
長いメッセージは、
.Xr more  1  
を使います。
.El
.Pp
.Nm
のコマンド対話モードの時に、コマンドの代わりに番号を入力することで、
指定した番号のメッセージに移動することができます。
.Sh 環境変数
.Nm
は、デフォルトのホームディレクトリと端末タイプを知るために、
.Ev HOME
と
.Ev TERM
を参照します。
.Sh 関連ファイル
.Bl -tag -width /var/msgs/* -compact
.It Pa /var/msgs/*
メッセージデータベース
.It ~/.msgsrc
次のメッセージ番号を記録しているファイル
.El
.Sh 関連項目
.Xr mail 1 ,
.Xr more 1 ,
.Xr aliases 5 ,
.Xr periodic 8
.Sh 歴史
.Nm
コマンドは、
.Bx 3.0 
から登場しました。
