freebsd/freebsd-doc/ja_JP.eucJP/man/man1/netstat.1
.\" Copyright (c) 1983, 1990, 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)netstat.1	8.8 (Berkeley) 4/18/94
.\" %FreeBSD: src/usr.bin/netstat/netstat.1,v 1.22.2.1 2000/12/08 15:13:57 ru Exp %
.\"
.\" jpman %Id: netstat.1,v 1.4 1997/10/11 07:45:56 horikawa Stab %
.\"
.Dd April 18, 1994
.Dt NETSTAT 1
.Os BSD 4.2
.Sh 名称
.Nm netstat
.Nd ネットワークの状態を表示する
.Sh 書式
.Nm
.Op Fl AaLln
.Op Fl f Ar address_family
.Op Fl M Ar core
.Op Fl N Ar system
.Nm
.Op Fl bdghilmnrs
.Op Fl f Ar address_family
.Op Fl M Ar core
.Op Fl N Ar system
.Nm
.Op Fl bdn
.Op Fl I Ar interface
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
.Nm
.Op Fl p Ar protocol
.Op Fl M Ar core
.Op Fl N Ar system
.Nm
.Op Fl p Ar protocol
.Op Fl i
.Op Fl I Ar Interface
.Nm
.Op Fl s
.Op Fl f Ar address_family
.Op Fl i
.Op Fl I Ar Interface
.Sh 解説
.Nm
コマンドは、ネットワークに関連したさまざまな情報を、シンボル表示を
交えてわかりやすく表示します。
出力の形式は指定オプションによって何種類かにわかれます。
第 1 の形式は、プロトコルごとのアクティブソケットの一覧です。
第 2 の形式は、選択したオプションによる、他のネットワークのデータ構造です。
第 3 の形式は、コンフィギュレーションされているネットワークインタフェースの
パケットトラフィックを
.Ar wait
で指定したインターバル毎に継続して表示します。
第 4 の形式は、指定したプロトコルに関する統計情報を表示します。
第 5 と第 6 の形式は、指定したプロトコルまたはアドレスファミリに関し、
インタフェース毎の統計情報を表示します。
.Pp
本コマンドでは、以下のオプションを指定可能です。
.Bl -tag -width flag
.It Fl A
デフォルトの表示では、ソケットと関係したすべてのプロトコル制御ブロックの
アドレスが表示されます。通常これらはデバッグに用いられます。
.It Fl a
デフォルトの表示では、すべてのソケットの状態が表示されます。通常
は、サーバプロセスで利用されているソケットは表示されません。
ルーティングテーブル表示時には (後述のオプション
.Fl r )
プロトコルが複製した経路 (親経路を RTF_PRCLONING して生成した経路) 
を表示します。
通常これらの経路は表示されません。
.It Fl b
本オプションをネットワークインタフェース表示
(後述の
.Fl i
オプション) と併用した場合には、入力、出力したバイト数を表示します。
.It Fl d
本オプションをネットワークインタフェース表示 (
.Fl i
オプション、もしくは後述のインターバルオプション)
と併用した場合には、欠落したパケット数を併せて表示します。
.It Fl f Ar address_family 
表示する統計情報あるいはアドレス制御ブロック情報を
.Ar address family
の指定に合致するアドレスファミリのものに限定します。
アドレスファミリについては、
.Ar inet
が
.Dv AF_INET
(インターネットプロトコルファミリ) として、
.Ar inet6
が
.Dv AF_INET6
として、
.Ar ipx 
が
.Dv AF_IPX  
として、
.Ar atalk 
が
.Dv AF_APPLETALK (ddp)  
(アップルトークプロトコル) として、
.Ar netgraph
または
.Ar ng
が
.Dv AF_NETGRAPH
として、
.\".Ar ns
.\"が
.\".Dv AF_NS
.\"(XEROX NS プロトコルファミリ) として、
.\".Ar iso
.\"が
.\".Dv AF_ISO
.\"(ISO プロトコルファミリ) として、そして
.Ar unix
が
.Dv AF_UNIX
(UNIX ドメインプロトコルファミリ) として解釈されます。
.It Fl g
マルチキャスト (グループアドレス) ルーティングに関連した情報を表示します。
デフォルトでは、IPマルチキャスト仮想インタフェースおよびルーティング
テーブルについて表示します。
.Fl s
オプションが同時に指定された場合、マルチキャストルーティングについての
統計情報も表示します。
.It Fl h
.Tn IMP
ホストテーブルの状態を表示します (時代遅れ)。
.It Fl I Ar interface 
指定したインタフェースについての情報を表示します。本オプションは、
インターバルオプション
.Ar wait
と同時に指定し
て使われます。このインターバルオプションについての詳細は後述します。
.Fl f Ar address_family
オプションが (
.Fl s
オプションと共に) 使用された場合か、
.Fl p Ar protocol
が指定された場合、
.Ar interface
に関するインタフェース毎の統計情報を、指定した
.Ar address_family
または
.Ar protocol,
に対し、それぞれ表示します。
.It Fl i
自動コンフィギュレーションされているネットワークインタフェースの状態
を表示します (静的にシステムにコンフィギュレーションされている
インタフェースについて表示しますが、ブート時にコンフィギュレーションされて
いないものについては表示しません)。
.Fl a
オプションが同時に指定されている場合には、各イーサネットインタフェース
および各 IP インタフェースアドレス
について、現在使用されているマルチキャストアドレスが表示
されます。マルチキャストアドレスは、
各々対応するインタフェースアドレスに続いて表示
されます。
.Fl f Ar address_family
オプションが (
.Fl s
オプションと共に) 使用された場合か、
.Fl p Ar protocol
が指定された場合、全インタフェース
に関するインタフェース毎の統計情報を、指定した
.Ar address_family
または
.Ar protocol,
に対し、それぞれ表示します。
.It Fl L
様々な listen 待ち行列の大きさを表示します。
1 番目の数は、受け付けられなかった接続数です。
2 番目の数は、受け付けられなかった不完全な接続数の合計です。
3 番目の数は、待ち行列に繋がれた接続の最大数です。
.It Fl l
完全な IPv6 アドレスを表示します。
.It Fl M
デフォルトで使用される
.Pa /dev/kmem
の代わりに指定した core から、ネームリストに関連する各値を
取り出します。
.It Fl m
メモリ管理ルーチンによって記録されているメモリ使用の統計情報を表
示します。
(ネットワーク管理システムは、独自にメモリバッファを確保しています)。
.It Fl N
.Pa /kernel
のかわりに、指定したカーネルモジュールからネームリストを取り出します。
.It Fl n
ネットワークアドレスを数字で表示します (通常、
.Nm
コマンドは、IPアドレスを可能な限りホスト名などのシンボリックなものに置
き換えようとします)。
本オプションは、どのような表示形式の場合にも使用できます。
.It Fl p Ar protocol 
.Ar protocol
で指定したプロトコルについての統計情報を表示します。
プロトコルとしては、よく知られている名称、もしくは別名定義されている名称
を指定します。プロトコルのいくつかは
.Pa /etc/protocols
の中で定義されています。
特別なプロトコル名
.Dq bdg
は、ブリッジの状態を表示するために使用します。
プロトコルについて情報が表示されない場合は、通常、
報告すべき有意な数値がないことを意味します。
.Ar protocol
で指定したプロトコルが未知のものである場合、もしくはそのプロトコルの統
計情報記録ルーチンがない場合には、プログラムはその旨メッセージを出しま
す。
.It Fl s
プロトコルごとの統計情報を表示します。
このオプションが複数指定された場合、カウンタの値が 0 のものは
表示が抑制されます。
.It Fl r
ルーティングテーブルを表示します。
プロトコルが複製した経路を表示するには、
.Fl a
を使用してください。
.Fl s
オプションが同時に指定された場合には、ルーティングの統計情報について
表示します。
.Fl l
も指定されると、
.Nm
はより多くの桁数があると仮定します。
.It Fl w Ar wait
ネットワークインタフェースの統計情報について、
.Ar wait
で指定した秒ごとに定期的に表示します。
.El
.Pp
デフォルトのアクティブソケット表示では、ローカルおよびリモートアドレス、
送受信キューのサイズ(バイト単位)、プロトコル、そしてプロトコルの内部状態が
それぞれ表示されます。
アドレス形式については、
.Dq host.port
もしくは、ソケットのアドレスが
ネットワーク単位でしか特定できない場合には
.Dq network.port
という形式が採用されます。
ホストもしくはネットワークアドレスがデータベース
.Pa /etc/hosts
や
.Pa /etc/networks
の内容にしたがって変換可能である場合、各アドレスは名前で
表示されます。このような変換が不可能な場合、もしくは
.Fl n
オプションが指定された場合には、アドレスはアドレスファミリに従って
数値で表示されます。
インターネットアドレスの
.Dq ドット形式
についてさらに知りたい場合には、
.Xr inet 3
を参照して下さい。
特にアドレスが指定されてない場合や、アドレスが
.Dq ワイルドカード
指定されている場合には、その部分のアドレスやポート番号のところには 
.Dq *
が表示されます。
.Pp
インタフェース表示では、パケット転送、エラー、コリジョンに関する
累積情報を見ることができます。また、インタフェースの
ネットワークアドレスおよび最大転送可能ユニットサイズ
.Pq Dq mtu
も見ることができます。
.Pp
ルーティングテーブル表示では、利用可能な経路とその状態が表示
されます。各経路は、到達先ホストもしくはネットワークと、
パケットの転送 (forward) に使用されるゲートウェイから成ります。
フラグフィールドは、
ルーティングに関する状態の集合が表示されます。フラグフィールドの
各フラグについては、
.Xr route 8
および
.Xr route 4
を参照して下さい。
表示される文字とフラグの間の対応は以下の通りです。
.Bl -column XXXX RTF_BLACKHOLE
1	RTF_PROTO1	ルーティングフラグ #1 にて特定されるプロトコル
2	RTF_PROTO2	ルーティングフラグ #2 にて特定されるプロトコル
3	RTF_PROTO3	ルーティングフラグ #3 にて特定されるプロトコル
B	RTF_BLACKHOLE	破棄されるパケット
b	RTF_BROADCAST	ブロードキャストアドレスを表現する経路
C	RTF_CLONING	新しい経路を生成する
c	RTF_PRCLONING	使用時に、プロトコル専用の新しい経路を生成する
D	RTF_DYNAMIC	(リダイレクトによって) 動的に生成される
G	RTF_GATEWAY	ゲートウェイ等による中継を必要としている到達先
H	RTF_HOST	ホストエントリ (これ以外はネットワーク)
L	RTF_LLINFO	アドレス変換を連動させられる正当なアドレス
M	RTF_MODIFIED	(リダイレクトによって) 動的に変更される
R	RTF_REJECT	到達不可能なホストもしくはネットワーク
S	RTF_STATIC	手動で追加された
U	RTF_UP		使用可能経路
W	RTF_WASCLONED	クローンした結果として作成された経路
X	RTF_XRESOLVE	外部の daemon がプロトコルからリンクアドレス変換を行なう
.El
.Pp
直接到達可能な経路は、ローカルホストにアタッチされた各インタフェースごとに
生成されます。このようなエントリのゲートウェイフィールドは、
対外インタフェースのアドレスを表します。
refcnt フィールドは、使用されている経路の現在数を示します。
コネクション指向のプロトコルは、通常、コネクションの間じゅう
単一の経路を保持します。
他方で、コネクションレス型のプロトコルは、同じ到達先に対して
パケットを送る場合にも、新たに経路を確保します。
use フィールドは、その経路を通って送られたパケット数を表示します。
インタフェースエントリは、その経路用に用いられる
ネットワークインタフェースを表示します。
.Pp
.Nm
が
.Fl w
オプションと
.Ar wait
インターバル引数を与えられて起動された場合、ネットワークインタフェースに
関連した統計情報を定期的に表示します。
ほとんど使われませんが、オプション指定なしで数字だけを netstat の引数と
して指定することもでき、本オプションと同様の動作をさせることができます。
しかし、この使い方は過去との互換性のためにのみ存在します。
デフォルトでは、本表示は
すべてのインタフェースについてのサマリ情報からなります。
.Fl I
オプションを用いることで、特定の
インタフェースの情報を表示させることが可能です。
.Sh 関連項目
.Xr fstat 1 ,
.Xr nfsstat 1 ,
.Xr sockstat 1 ,
.Xr ps 1 ,
.Xr inet 4 ,
.Xr unix 4 ,
.Xr hosts 5 ,
.Xr networks 5 ,
.Xr protocols 5 ,
.Xr services 5 ,
.Xr iostat 8 ,
.Xr trpt 8 ,
.Xr vmstat 8
.Sh 歴史
.Nm
コマンドは、
.Bx 4.2
にはじめて登場しました。
.Pp
IPv6 サポートは WIDE/KAME プロジェクトが追加しました。
.Sh 関連ファイル
.Bl -tag -width /dev/kmem -compact
.It Pa /kernel
デフォルトのカーネルの名前リスト
.It Pa /dev/kmem
デフォルトのメモリファイル
.El
.Sh バグ
エラーの概念については、定義が間違っています。
