freebsd/freebsd-doc/ja_JP.eucJP/man/man1/passwd.1
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)passwd.1	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.bin/passwd/passwd.1,v 1.18 2000/03/01 12:20:07 sheldonh Exp %
.\"
.\" jpman %Id: passwd.1,v 1.4 1997/07/21 09:41:51 konuma Stab %
.Dd June 6, 1993
.Dt PASSWD 1
.Os BSD 4
.Sh 名称
.Nm passwd, yppasswd
.Nd ユーザのパスワードを変更する
.Sh 書式
.Nm passwd
.Op Fl l
.Op Ar user
.Nm yppasswd
.Op Fl l
.Op Fl y
.Op Fl d Ar domain
.Op Fl h Ar host
.Op Fl o
.Sh 解説
.Nm passwd
は、ユーザの local, Kerberos, NIS パスワードを変更します。
ユーザがスーパユーザでない場合、
.Nm passwd
は最初に現在のパスワードを求め、
正しいパスワードが入力されない場合には処理を停止します。
.Pp
新規パスワード入力時、パスワードは表示されません。
通りがかりの人にパスワードを見られることを避けるためです。
.Nm passwd
は、タイプミスを検出するため、2 度新規パスワード入力を求めます。
.Pp
新しいパスワードは、少なくとも 6 文字以上 (ユーザのログインクラスに対する
.Xr login.conf 5
の
.if t ``minpasswordlen''
.if n "minpasswordlen"
設定が優先します) で、アルファベットだけにならな
いようにすべきです。パスワードの最大文字数は、
.Dv _PASSWORD_LEN
(現在は 128 文字) より短いことが必要です。
.Pp
新規パスワードは大文字と小文字を混合して含む必要があります
(ユーザのログインクラスに対して
.Xr login.conf 5
の
.if t ``mixpasswordcase''
.if n "mixpasswordcase"
の設定を使用することで、上書き可能です)。
小文字だけのワスワードのみ許可可能な場合に、
小文字パスワードを許すと有用でしょう。
例えば Windows クライアントを認証するために Samba を使用する場合が、
該当します。
他のすべての場合、数字、大文字、メタ文字が推奨されます。
.Pp
新しいパスワードが確認されたら
.Nm passwd
は新しいパスワードを Kerberos 認証ホストに伝えます。
.Bl -tag -width flag
.It Fl l
Kerberosデータベースではなく、
ローカルマシンのパスワードだけを変更します。
ローカルマシンのパスワードだけを変更する場合は、
.Xr pwd_mkdb  8
がパスワードデータベースの更新に使われます。
.Pp
.El
ローカルまたは NIS パスワードを変更する場合、
ユーザのログインクラスの 
.if t ``passwordtime''
.if n "passwordtime"
ケーパビリティに基づき、
次にパスワードを変更すべき日付が設定されます。
.Pp
別のユーザの Kerberos パスワードを変更するには、
.Xr kinit 1
を実行してから、
.Xr passwd 1
を実行する必要があります。
スーパユーザがローカルマシンのパスワードを修正するときにかぎり、現在の
パスワードの入力は不要です。
.Sh NIS との相互作用
.Nm passwd
は NIS のサポートが組み込まれています。
もしユーザ名が NIS のパスワードデータベースの中にあり、
ローカルにはない場合、
.Nm passwd
は自動的に
.if t ``yppasswd''
.if n "yppasswd"
に切り替わります。
指定されたユーザ名がローカルのパスワードデータベースにも、
NIS のパスワードマップにも存在しない場合、
.Nm passwd
はエラーを返します。
.Pp
NIS のパスワードを変更するとき、非特権ユーザは
確認のために現在のパスワードの入力を求められます (
.Xr rpc.yppasswdd 8
デーモンはいかなる変更でも NIS パスワードマップに加える前に
現在のパスワードの入力を求めます)。
この制限はスーパユーザにも適用されますが、大きな例外があります。
NIS マスタサーバのスーパユーザはパスワードの確認が省略されるの
です。
したがって、NIS マスタサーバのスーパユーザは、すべてのユーザの 
NIS パスワードを無制限に変更できます。
しかし、NIS クライアントや NIS スレーブサーバのスーパユーザは
変更にパスワードが必要です。
.Pp
以下のオプションは NIS のためのものです:
.Bl -tag -width flag
.It Fl y
.Nm passwd
は強制的に NIS 用になります。
.It Fl l
NIS が有効な場合に
.Nm passwd
を強制的にローカル用にします。
このフラグは同じログイン名で NIS のユーザと
ローカルなユーザが存在するときに、
.if t ``ローカルユーザの''
.if n "ローカルユーザの"
パスワードエントリを変更するために使われます。
例えば、システム用の
.Pa bin
や
.Pa daemon
といった
.if t ``場所取り''
.if n "場所取り"
エントリは NIS パスワードマップとローカルユーザデータベース
の両方に存在することが、よくあります。
この場合デフォルトでは
.Nm passwd
は NIS のパスワードを変更しようとします。
NIS ではなくローカルのパスワードを変更するとき
.Fl l
を使います。
.It Fl d Ar domain
NIS パスワードを変更するとき、ドメイン名を指定します。デフォルトで
.Nm passwd
は、システムのデフォルトドメイン名を使います。このフラグは主に
NIS マスタサーバのスーパユーザが使用するものです。一つの NIS 
マスタサーバが複数のドメインを扱っている場合や、NIS マスタサーバでは
ドメイン名が設定されていない (NIS サーバは必ずしもクライアントになる
必要はありません) 場合に、
.Nm passwd
コマンドがどのドメインを扱うのかを指定する必要があります。
.It Fl s Ar host
NIS サーバの名前を指定します。このオプションを
.Fl d
オプションと共に用いることで、非ローカルな NIS サーバ上の NIS
パスワードを変えることが出来ます。
.Fl d
オプションでドメイン名を指定し、 NIS マスタサーバの名前が決定できな
い (おそらく、ローカルのドメイン名が設定されていないため) ときには、
NIS マスタサーバは、
.if t ``localhost''.
.if n "localhost".
であると仮定されます。
このサーバ名を
.Fl s
で指定することが出来ます。指定するホスト名は NIS マスタサーバ
でなくても構いません。 NIS マスターサーバー名はドメイン内の
NIS (マスタもしくはスレーブ) サーバに問い合わせることで決定される
ので、スレーブサーバを指定しても構いません。
.Pp
.It Fl o
NIS マスタサーバにおいて、スーパユーザの確認を省略しません。
\'old' モードにします。このフラグはあまり実用的ではありませんが、
パスワードのテストに使うことが出来ます。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/master.passwd
パスワードのマスタファイル
.It Pa /etc/passwd 
Version 7 形式のパスワードファイル
.It Pa /etc/passwd.XXXXXX
パスワード変更時に作られるテンポラリファイル
.It Pa /etc/login.conf
ログインクラスケーパビリティデータベース
.It Pa /etc/auth.conf
認証サービスの設定
.El
.Sh 関連項目
.Xr chpass 1 ,
.Xr kerberos 1 ,
.Xr kinit 1 ,
.Xr login 1 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr kpasswdd 8 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Rs
.%A Robert Morris
.%A Ken Thompson
.%T "UNIX password security"
.Re
.Sh 注
.Xr yppasswd 1
は実際には
.Nm passwd
へのリンクです。
.Sh 歴史
.Nm passwd
コマンドは
.At v6
から登場しました。
