freebsd/freebsd-doc/ja_JP.eucJP/man/man1/pkg_version.1
.\"
.\" Copyright 1998 Bruce A. Mah
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/pkg_install/version/pkg_version.1,v 1.2.2.2 1999/12/03 06:18:04 billf Exp %
.\" jpman %Id: pkg_version.1,v 1.3 1999/12/05 08:25:39 horikawa Stab %
.Dd July 17, 1998
.Dt PKG_VERSION 1
.Os FreeBSD
.Sh 名称
.Nm pkg_version
.Nd インストールされたパッケージのバージョンを要約表示
.Sh 書式
.Nm pkg_version
.Op Fl cdhv
.Op Fl l Ar limchar
.Op Ar index
.Sh 解説
.Nm
コマンドは、
.Xr pkg_add 1 
コマンドを使ってインストールされた、基本ソフトウェア以外の
ソフトウェアパッケージに関するレポートを作成するために使います。
どのパッケージについて更新処理が必要となるのかを調べるために、
バージョン番号をインデックスファイルに対して比較します。
.Pp
各パッケージ名が、次に示す 1 文字のステータスフラグと一緒に表示されます:
.Bl -tag -width indent
.It Li =
インストールされているパッケージのバージョンは、インデックスと一致します。
.It Li <
インストールされているパッケージのバージョンは、
インデックスに記載されるバージョンより古いものです。
.It Li >
インストールされているパッケージのバージョンは、
インデックスで記載されるものよりも新しいものです。
.It Li ?
インストールされているパッケージのバージョンと、
インデックスファイルとの関係を、特定することができませんでした。
このメッセージが表示される共通の理由は、
ある特定のソフトウェアパッケージで、
複数バージョンがインストールされているものがあるからです。
あるいは、複数のバージョンが
インデックスファイルに記載されていることが原因です。
.Fx
port コレクションを例に取ると、
Tcl ツールキットや 
.Tn EMACS
が該当します。
.Sh オプション
.Nm 
は、いくつかのコマンドライン引数をサポートしています:
.Bl -tag -width indent
.It Fl c
コマンド出力を可能にします。
コマンド出力は、
インストール済みパッケージを port システムにおいて
最新バージョンのものに更新するために、
あなたが打込む必要があるコマンドを含んでいます。
.It Fl d
デバッグ出力を有効にします。
.It Fl h
ヘルプメッセージを表示します。
.It Fl l
出力するパッケージを、ステータスフラグが
.Ar limchar
にマッチするものに制限します。
マッチに使用する文字を、複数個
.Ar limchar
に指定可能です。
ステータスフラグの文字にはシェルの特殊文字でもあるものが存在するため、
.Ar limchar
をシングルクォートで括るのが最善手です。
.It Fl v
冗長出力を有効にします。
冗長出力は
英文による、バージョン番号比較に関する若干の説明と、
各パッケージの比較に使われたバージョン番号の説明が含まれています。
スクリプトやプログラムで処理するには、
おそらく冗長でない出力の方が簡単でしょう。
.It Ar index
比較の基準として利用するインデックスを指定します。
インデックスとして、ファイル名 (ローカルなファイルシステム内)
または URL を指定することができます。
.Xr fetch 1
が解釈可能な URL であれば、どのようなものでも指定することができます。
コマンドラインで
.Ar index
ファイルが指定されていない場合は
.Pa /usr/ports/INDEX
が利用されます。
.El
.Sh 関連項目
.Xr fetch 1 ,
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 .
.Sh 関連ファイル
.Bl -tag -width /usr/ports/INDEX -compact
.It Pa /usr/ports/INDEX
デフォルトのインデックスファイル。
.El
.Sh 使用例
以下は
.Nm
コマンドの典型的な起動方法です。
インストール済みパッケージを
ローカルの port インデックスファイルと照合します:
.Pp
.Dl % pkg_version -v
.Pp
下のコマンドは、
オンラインの port コレクションにおける
バージョン番号に対してレポートを生成します:
.Pp
.Dl % pkg_version ftp://ftp.FreeBSD.org/pub/FreeBSD/ports-current/INDEX
.Pp
下のコマンドは、
インストールされたファイルの更新を行うために実行するコマンド群の
ファイルを生成します。
このコマンドを自動的に実行させることは推奨
.Bf Em
できません。
.Ef
必ず報告を再検討してから、あなたが実行したいコマンドを、
カットアンドペースト (あるいは再入力) で入力してください。
.Pp
.Dl % pkg_version -c > do_update
.Sh 作者
.An Bruce A. Mah Aq bmah@ca.sandia.gov
.Sh 寄贈者
.An Nik Clayton Aq nik@freebsd.org ,
.An Dominic Mitchell Aq dom@palmerharvey.co.uk
.Sh バグ
複数のバージョンでインストールされたパッケージについて、
うまく処理できる方法が必要です。
.Pp
パッチレベルに関しては、うまく取り扱うことができません (すなわち
1.2p3 あるいは 1.2pl3 といった形式のバージョン番号) 。
.Pp
バージョン番号が変更されない (例えば、 パッケージ / port 自身の
ちょっとしたバグフィックス) ようなパッケージに関しては
更新できません。
.Pp
コマンド出力は、パッケージ間における依存関係については関知していません。
例えば、2 つのパッケージが異なるバージョンを必要とするために、
2 バージョンの Tcl をインストールする必要があるかもしれません。
.Nm
は、古いバージョンの消去を提案します。
.Pp
コマンド出力は、
.Xr pkg_add 1
を使うのではなく、
port システムを使って新しいソフトウェアをインストールすると
仮定しています。
