freebsd/freebsd-doc/ja_JP.eucJP/man/man1/pkg_version.1
.\"
.\" Copyright 1998 Bruce A. Mah
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/pkg_install/version/pkg_version.1,v 1.27.2.1 2005/02/27 15:40:17 brueffer Exp %
.\"
.\" $FreeBSD$
.Dd June 29, 2004
.Dt PKG_VERSION 1
.Os
.Sh 名称
.Nm pkg_version
.Nd インストールされた package のバージョンを要約表示
.Sh 書式
.Nm
.Op Fl hv
.Op Fl l Ar limchar
.Op Fl L Ar limchar
.Oo
.Op Fl X
.Fl s Ar string
.Oc
.Op Ar index
.Nm
.Fl t Ar version1 version2
.Nm
.Fl T Ar pkgname pattern
.Sh 解説
.Nm
コマンドは、
.Xr pkg_add 1
コマンドを使ってインストールされた、基本ソフトウェア以外の
ソフトウェア package
(訳注: FreeBSD の package system におけるパッケージを指す場合にこう表記します)
に関するレポートを作成するために使います。
.Pp
各 package のバージョン番号は、2 個の情報源のうちの 1 つと照会され、
この package の更新が必要が否かが判断されます。
package 中に
.Fx
ports ツリーにおける起源情報を含み、port の
.Pa Makefile
からバージョン番号を判定可能な場合、
.Pa Makefile
のバージョン番号を使用して、
インストール済の package が最新であるか更新要かを判定します。
.Pp
package の起源が無い場合か、port の
.Pa Makefile
が見付からない場合、
.Nm
は ports collection インデックスファイル (典型的には
.Pa /usr/ports/INDEX-5 )
から package を探します。
マッチするバージョン番号 (複数可) を使用して、
インストール済の package が最新であるか更新要かを判定します。
.Pp
一般的に、port の
.Pa Makefile
のバージョン番号を使用することにより、より正確な結果となります。
これは、インデックスファイルとは異なり、
現在のバージョン番号を厳密に提供するためであり、
これは複数のバージョンの port が ports collection 中にある場合でも成立します。
更に、ports collection インデックスファイルの更新は間隔が開きますので、
ports collection に含まれるソフトウェアのバージョン番号を
完全に反映している訳ではありません。
.Pp
各 package 名が、次に示す 1 文字のステータスフラグと一緒に表示されます:
.Bl -tag -width indent
.It Li =
インストールされている package のバージョンは、最新です。
.It Li \&<
インストールされている package のバージョンは、
最新バージョンより古いものです。
.It Li \&>
インストールされている package のバージョンは、
最新バージョンよりも新しいものです。
この状況は、インデックスが古い場合か、新規 port をテスト中に発生します。
.It Li \&?
インストールされた package がインデックス中に見付かりませんでした。
原因としては、インデックスが古いことか、
コミットされていない package を PR から取得したことがあり得ます。
.It Li *
ある特定のソフトウェア package で
複数バージョンがインデックスに列挙されているものがあります。
.Fx
port コレクションを例に取ると、
Tcl ツールキットや
.Tn EMACS
が該当します。
.It Li \&!
インストールされた package がインデックス中にありますが、
なんらかの理由で、
インストールされた package のバージョン番号と
インデックス中の対応するエントリとを
.Nm
が比較できませんでした。
.El
.Sh オプション
.Nm
ユーティリティは、いくつかのコマンドライン引数をサポートしています:
.Bl -tag -width indent
.It Fl h
ヘルプメッセージを表示します。
.It Fl l
出力する package を、ステータスフラグが文字
.Ar limchar
にマッチするものに制限します。
マッチに使用する文字を、複数個
.Ar limchar
に指定可能です。
ステータスフラグの文字にはシェルの特殊文字でもあるものが存在するため、
.Ar limchar
をシングルクォートで括るのが最善手です。
.It Fl L
出力する package を、ステータスフラグが
.Ar limchar
にマッチしないものに制限します。
複数のマッチ対象の文字を
.Ar limchar
に指定可能です。
ステータスフラグの文字にはシェルの特殊文字でもあるものが存在するため、
.Ar limchar
をシングルクォートで括るのが最善手です。
.It Fl s
出力する package を、指定された文字列
.Ar string
に名前がマッチするものに制限します。
.It Fl X
.Ar string
を拡張正規表現として解釈します。
.It Fl t
バージョン番号文字列の組をテストし、終了します。
次の単一文字のいずれかを標準出力へ出力します:
.Li =
(等しい),
.Li \&<
(右側の番号が大きい),
.Li \&>
(左側の番号が大きい)。
本フラグは、スクリプトやテストに有用です。
.It Fl T
.Ar pkgname
が
.Ar pattern
にマッチするか検査し、それに従って終了コードを設定します。
.Fl T
は、「フィルタモード」でも使用可能です。
引数の 1 つが `-' である場合標準入力が使用され、
マッチした package の名前/パターンの行が標準出力へ出力されます。
.It Fl v
冗長出力を有効にします。
冗長出力は
英文による、バージョン番号比較に関する若干の説明と、
各 package の比較に使われたバージョン番号の説明が含まれています。
スクリプトやプログラムで処理するには、
おそらく冗長でない出力の方が簡単でしょう。
.It Ar index
比較の基準として利用するインデックスを指定します。
インデックスとして、ファイル名 (ローカルなファイルシステム内)
または URL を指定することができます。
.Xr fetch 1
が解釈可能な URL であれば、どのようなものでも指定することができます。
コマンドラインで
.Ar index
ファイルが指定されていない場合は
.Pa /usr/ports/INDEX-5
が利用されます。
.El
.Sh 互換性
.Fl c
オプションは価値が低下しており、もはやサポートされません。
.Sh 関連項目
.Xr fetch 1 ,
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_info 1
.Sh 関連ファイル
.Bl -tag -width /usr/ports/INDEX-5 -compact
.It Pa /usr/ports/INDEX-5
デフォルトのインデックスファイル。
.El
.Sh 使用例
以下は
.Nm
コマンドの典型的な起動方法です。
インストール済み package を
ローカルの port インデックスファイルと照合します:
.Pp
.Dl % pkg_version -v
.Pp
下のコマンドは、
オンラインの port コレクションにおける
バージョン番号に対してレポートを生成します:
.Pp
.Dl % pkg_version http://www.FreeBSD.org/ports/INDEX-5
.Pp
次のコマンドは、2 個の package バージョン文字列を比較します:
.Pp
.Dl % pkg_version -t 1.5 1.5.1
.Sh 作者
.Nm
ユーティリティは、
.An Bruce A. Mah Aq bmah@FreeBSD.org
が記述した Perl スクリプトを一部基にして、
.An Jeremy D. Lea Aq reg@FreeBSD.org
が記述しました。
.Sh 寄贈者
.An Nik Clayton Aq nik@FreeBSD.org ,
.An Dominic Mitchell Aq dom@palmerharvey.co.uk ,
.An Mark Ovens Aq marko@FreeBSD.org ,
.An Doug Barton Aq DougB@gorean.org ,
.An Akinori MUSHA Aq knu@FreeBSD.org ,
.An Oliver Eikemeier Aq eik@FreeBSD.org
