freebsd/freebsd-doc/ja_JP.eucJP/man/man1/pkg_version.1
.\"
.\" Copyright 1998 Bruce A. Mah
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/pkg_install/version/pkg_version.1,v 1.5.2.8 2001/02/20 23:32:50 jkh Exp %
.\" jpman %Id: pkg_version.1,v 1.3 1999/12/05 08:25:39 horikawa Stab %
.Dd July 17, 1998
.Dt PKG_VERSION 1
.Os FreeBSD
.Sh 名称
.Nm pkg_version
.Nd インストールされた package のバージョンを要約表示
.Sh 書式
.Nm
.Op Fl cdhv
.Op Fl l Ar limchar
.Op Fl L Ar limchar
.Op Ar index
.Sh 解説
.Nm
コマンドは、
.Xr pkg_add 1 
コマンドを使ってインストールされた、基本ソフトウェア以外の
ソフトウェア package
(訳注: FreeBSD の package system におけるパッケージを指す場合にこう表記します)
に関するレポートを作成するために使います。
.Pp
各 package のバージョン番号は、2 個の情報源のうちの 1 つと照会され、
この package の更新が必要が否かが判断されます。
package 中に
.Fx
ports ツリーにおける起源情報を含み、port の
.Pa Makefile
からバージョン番号を判定可能な場合、
.Pa Makefile
のバージョン番号を使用して、
インストール済の package が最新であるか更新要かを判定します。
.Pp
package の起源が無い場合か、port の
.Pa Makefile
が見付からない場合、
.Nm
は ports collection インデックスファイル (典型的には
.Pa /usr/ports/INDEX
) から package を探します。
マッチするバージョン番号 (複数可) を使用して、
インストール済の package が最新であるか更新要かを判定します。
.Pp
一般的に、port の
.Pa Makefile
のバージョン番号を使用することにより、より正確な結果となります。
これは、インデックスファイルとは異なり、
現在のバージョン番号を厳密に提供するためであり、
これは複数のバージョンの port が ports collection 中にある場合でも成立します。
更に、ports collection インデックスファイルの更新は間隔が開きますので、
ports collection に含まれるソフトウェアのバージョン番号を
完全に反映している訳ではありません。
.Pp
各 package 名が、次に示す 1 文字のステータスフラグと一緒に表示されます:
.Bl -tag -width indent
.It Li =
インストールされている package のバージョンは、最新です。
.It Li \&<
インストールされている package のバージョンは、
最新バージョンより古いものです。
.It Li \&>
インストールされている package のバージョンは、
最新バージョンよりも新しいものです。
この状況は、インデックスが古い場合か、新規 port をテスト中に発生します。
.It Li \&?
インストールされた package がインデックス中に見付かりませんでした。
原因としては、インデックスが古いことか、
コミットされていない package を PR から取得したことがあり得ます。
.It Li *
ある特定のソフトウェア package で
複数バージョンがインデックスに列挙されているものがあります。
.Fx
port コレクションを例に取ると、
Tcl ツールキットや 
.Tn EMACS
が該当します。
.It Li \&!
インストールされた package がインデックス中にありますが、
なんらかの理由で、
インストールされた package のバージョン番号と
インデックス中の対応するエントリとを
.Nm
が比較できませんでした。
.El
.Sh オプション
.Nm 
は、いくつかのコマンドライン引数をサポートしています:
.Bl -tag -width indent
.It Fl c
コマンド出力を可能にします。
コマンド出力は、
インストール済み package を port システムにおいて
最新バージョンのものに更新するために、
あなたが打込む必要があるコマンドを含んでいます。
この機能は、package を自動的に更新するシステムを構成するわけではありま
.Bf Em
せん
.Ef
。
本コマンドの出力は、インストール済の package 間の依存関係を壊さないために、
編集する
.Bf Em
必要
.Ef
があります。
.It Fl d
デバッグ出力を有効にします。
.It Fl h
ヘルプメッセージを表示します。
.It Fl l
出力する package を、ステータスフラグが文字
.Ar limchar
にマッチするものに制限します。
マッチに使用する文字を、複数個
.Ar limchar
に指定可能です。
ステータスフラグの文字にはシェルの特殊文字でもあるものが存在するため、
.Ar limchar
をシングルクォートで括るのが最善手です。
.It Fl L
出力する package を、ステータスフラグが
.Ar limchar
にマッチしないものに制限します。
複数のマッチ対象の文字を
.Ar limchar
に指定可能です。
ステータスフラグの文字にはシェルの特殊文字でもあるものが存在するため、
.Ar limchar
をシングルクォートで括るのが最善手です。
.It Fl v
冗長出力を有効にします。
冗長出力は
英文による、バージョン番号比較に関する若干の説明と、
各 package の比較に使われたバージョン番号の説明が含まれています。
スクリプトやプログラムで処理するには、
おそらく冗長でない出力の方が簡単でしょう。
.It Ar index
比較の基準として利用するインデックスを指定します。
インデックスとして、ファイル名 (ローカルなファイルシステム内)
または URL を指定することができます。
.Xr fetch 1
が解釈可能な URL であれば、どのようなものでも指定することができます。
コマンドラインで
.Ar index
ファイルが指定されていない場合は
.Pa /usr/ports/INDEX
が利用されます。
.El
.Sh 関連項目
.Xr fetch 1 ,
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_info 1
.Sh 関連ファイル
.Bl -tag -width /usr/ports/INDEX -compact
.It Pa /usr/ports/INDEX
デフォルトのインデックスファイル。
.El
.Sh 使用例
以下は
.Nm
コマンドの典型的な起動方法です。
インストール済み package を
ローカルの port インデックスファイルと照合します:
.Pp
.Dl % pkg_version -v
.Pp
下のコマンドは、
オンラインの port コレクションにおける
バージョン番号に対してレポートを生成します:
.Pp
.Dl % pkg_version ftp://ftp.FreeBSD.org/pub/FreeBSD/ports-current/INDEX
.Pp
下のコマンドは、
インストールされたファイルの更新を行うために実行するコマンド群の
ファイルを生成します。
コマンドは、適切に編集することなく実行
.Bf Em
しないでください
.Ef
。
提案として扱うべきであり、
インストール済 package 間の依存関係を考慮に入れるために
順序を入れ換える必要があるかもしれませんし、
複数のインストール済 package を共存させるために
無視する必要があるかもしれません。
本コマンドの出力を内容を確認せずに使用すると、
システムが使えなくなることがあります。
.Pp
.Dl % pkg_version -c > do_update
.Sh 作者
.An Bruce A. Mah Aq bmah@FreeBSD.org
.Sh 寄贈者
.An Nik Clayton Aq nik@freebsd.org ,
.An Dominic Mitchell Aq dom@palmerharvey.co.uk ,
.An Mark Ovens Aq marko@FreeBSD.org ,
.An Doug Barton Aq DougB@gorean.org
.Sh バグ
.Pp
パッチレベルに関しては、うまく取り扱うことができません (すなわち
1.2p3 あるいは 1.2pl3 といった形式のバージョン番号) 。
.Pp
コマンド出力機能は、ports/packages の自動更新システムでは
.Bf Em 
ありません
.Ef
。
インストール済の packages 間の依存関係を正しく扱おうとすらしませんし、
システム上に複数のバージョンの package が共存する場合には
正しくない結果を出力します。
.Pp
コマンド出力は、
.Xr pkg_add 1
を使うのではなく、
port システムを使って新しいソフトウェアをインストールすると
仮定しています。
