freebsd/freebsd-doc/ja_JP.eucJP/man/man1/pkg_info.1
.\"
.\" FreeBSD install - a package for the installation and maintainance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" Jordan K. Hubbard
.\"
.\"
.\"     @(#)pkg_info.1
.\" %FreeBSD: src/usr.sbin/pkg_install/info/pkg_info.1,v 1.24.2.5 2000/12/08 15:28:42 ru Exp %
.\"
.\" jpman %Id: pkg_info.1,v 1.3 1997/06/08 14:11:48 jsakai Stab %
.\"
.Dd November 25, 1994
.Dt pkg_info 1
.Os FreeBSD
.Sh 名称
.Nm pkg_info
.Nd ソフトウェア配布 package の情報を表示するプログラム
.Sh 書式
.Nm
.Op Fl cdDfiIkLmopqrRsv
.Op Fl e Ar package
.Op Fl l Ar prefix
.Op Fl t Ar template
.Ar pkg-name [pkg-name ...]
.Nm
.Fl a
.Op Ar flags
.Sh 解説
.Nm
コマンドは、
.Xr pkg_create 1
によりファイルにパックされた package 
(訳注: FreeBSD の package system におけるパッケージを指す場合にこう表記します)
か、
.Xr pkg_add 1
によりすでにシステムにインストールされた package に関し、
情報を表示するために用いられます。
.Sh オプション
以下のコマンドラインオプションが提供されています。
.Bl -tag -width indent
.It Ar pkg-name ...
指定された package が表示されます。指定されるのはイントール済みの
package の名前か、package 配布ファイルへのパス、ftp 可能な
package への URL のいずれかになります。
.It Fl a
現在インストールされているすべての package を表示します。
.It Fl v
饒舌な出力に切り替えます。
.It Fl p
各 package のインストール用 prefix を表示します。
.It Fl q
レポートヘッダのような情報を出力する際に余分な出力を
.Dq 省略
し、
生の情報のみ出力します (基本的に人が読みやすいものではありません)。
.It Fl c
各 package の (一行) コメントフィールドを表示します。
.It Fl d
各 package の長い説明フィールドを表示します。
.It Fl D
各 package のインストールメッセージファイルを表示します。
.It Fl f
各 package の packing list instructions を表示します。
.It Fl i
もしあれば、各 package のインストールスクリプトを表示します。
.It Fl I
各 package のインデックス行を表示します。このオプションは他の package
書式整形オプションの全てに優先します。
.It Fl k
もしあれば、各 package のアンインストールスクリプト
を表示します。
.It Fl r
もしあれば、各 package の requirements スクリプトを表示します。
.It Fl R
(指定した) 各 package を必要とする package のうちで、インストールされて
いるもののリストを表示します。
.It Fl m
もしあれば、各 package の mtree ファイルを表示します。
.It Fl L
各 package に含まれるファイルを表示します。
これは packing list をただ見るのとは異なり、
生成されるすべてのフルパス名が表示されます。
.It Fl s
各 package 中のインストールされたファイルの総容量を表示します。
.It Fl o
package 生成時に記録された
.Dq 起源
パスを表示します。
このパスは、
生成された package から、
.Fx
.Em "Ports Collection"
における元の port の場所を与えることを意図しています。
.It Fl e Ar pkg-name
.Ar pkg-name 
で示される package が現在インストールされている場合には 0 を
返し、そうでなければ 1 を返します。
このオプションにより、スクリプトから (おそらく必要不可欠な) 
他の package の存在を簡単に確認することが可能になります。
.It Fl l Ar str
各 information category header (
.Fl q
を参照) の前に
.Ar str
を付加します。
これは本来、package に関する多くの information fields を一度に
得たいが、そのごっちゃになった出力で混乱したくない、という 
フロントエンドプログラムのためにあります。
このオプションで各 field の先頭に特別な文字列を付け加えることが
できます。
.It Fl t Ar template
.Dq 作業場所
を作成する際に、
.Xr mktemp 3
への入力として
.Ar template
を用います。
これはデフォルトでは
.Pa /tmp/instmp.XXXXXX
という文字列ですが、
.Pa /tmp
ディレクトリの容量が制限されているような状況では
変更する必要があるかもしれません。
.Xr mktemp 3
が一意の ID を用いるために必要な `X' の文字をいくつか残しておく
ことを忘れないでください。
.Bd -filled -offset indent -compact
Note: pkg_info は各 package からとても小さな情報しか
抽出しないので、実際にはこのオプションは必要ありません。
溢れさせるには非常に小さな
.Pa /tmp
でなければならないでしょう。
.Ed
.Sh 技術詳細
package の情報は、コマンドラインから指定された package のファイル名か、
.Pa /var/db/pkg/<pkg-name>
にあるすでにインストールされた package の情報から抽出されます。
.Sh 環境変数
.Ev PKG_TMPDIR
で、
.Nm
が作業用ファイルを生成するディレクトリを指定します。
この変数が設定されていない場合、
.Ev TMPDIR
が用いられます。両方とも設定されていない場合、
組み込みのデフォルトディレクトリが用いられます。
.Pp
.Ev PKG_DBDIR
で、
インストールされた package についての代替的なデータベースの位置を指定します。
.Sh ファイル
.Bl -tag -width /var/db/pkg -compact
.It Pa /var/tmp
環境変数
.Ev PKG_TMPDIR ,
.Ev TMPDIR
がともに設定されていない場合、もしくはこれらのディレクトリの空き領域が
十分でない場合に用いられます。
.It Pa /tmp
.Pa /var/tmp
が存在しないか、十分な空き領域を持たない場合に、次の選択肢として
用いられます。
.It Pa /usr/tmp
.Pa /tmp
が適切でない場合の最後の選択肢です。
.It Pa /var/db/pkg
インストールされた package についてのデータベースのデフォルトの
位置です。
.El
.Sh 関連項目
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_version 1 ,
.Xr mktemp 3 ,
.Xr mtree 8
.Sh 作者
.An Jordan Hubbard
ほとんどの仕事
.An John Kohl
NetBSD 向け修正
.El
.Sh バグ
まだあるはずです。
