freebsd/freebsd-doc/ja_JP.eucJP/man/man1/pkg_update.1
.\"
.\" Copyright 2000 Paul Richards
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/pkg_install/update/pkg_update.1,v 1.3.2.1 2001/08/16 15:56:16 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man1/pkg_update.1,v 1.3 2001/07/29 05:14:52 horikawa Exp $
.\"
.Dd December 27, 2000
.Dt PKG_UPDATE 1
.Os
.Sh 名称
.Nm pkg_update
.Nd インストールされている package を更新する
.Sh 書式
.Nm
.Op Fl nv
.Op Fl r Ar oldpkg
.Ar newpkg.tgz
.Sh 解説
.Nm
コマンドは既にインストールされている package
(訳注: FreeBSD の package system におけるパッケージを指す場合にこう表記します)
を更新するために用います。
.Nm
は、置きかえ前のバージョンが持っていた依存関係を、
新しくインストールされるバージョンに渡す処理も行います。
通常
.Nm
は、現在インストールされているすべての package のバージョンを、
より新しいバージョンで置き換えるために用います。
あるいは
.Fl r
オプションでバージョンを指定すれば、
特定の package を古いバージョンに戻すこともできます。
.Pp
以下のオプションが利用できます:
.Bl -tag -width indent
.It Fl n
動作を表示しますが、実際には実行しません。
.It Fl r Ar oldpkg
package を指定したバージョンのものに置き換えます。
通常
.Nm
はインストールされている package をすべて新しいバージョンに
置き換えようとします。これは常に望ましい動作であるとは限りません。
なぜなら package によっては、
複数のバージョンが同時にインストールされていることもありうるからです。
このオプションを指定すると、
特定のバージョンに置き換えることができるようになります。
.It Fl v
詳細な出力を行います。
.El
.Sh 関連項目
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_info 1 ,
.Xr pkg_version 1
.Sh 作者
.An Paul Richards Aq paul@FreeBSD.org
.Sh バグ
今のところ既知のものはありません。

