freebsd/freebsd-doc/ja_JP.eucJP/man/man1/rdist.1
.\" Copyright (c) 1985, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)rdist.1	8.3 (Berkeley) 3/17/94
.\" %FreeBSD: src/usr.bin/rdist/rdist.1,v 1.13.2.1 2000/12/08 15:14:01 ru Exp %
.\"
.\" jpman %Id: rdist.1,v 1.2 1997/06/05 02:50:01 yugawa Stab %
.\"
.Dd March 17, 1994
.Dt RDIST 1
.Os BSD 4.3
.Sh 名称
.Nm rdist
.Nd リモートファイル配布プログラム
.Sh 書式
.Nm
.Op Fl nqbRhivwyD
.Op Fl P Ar rshcmd
.Op Fl f Ar distfile
.Op Fl d Ar var=value
.Op Fl m Ar host
.Op Ar name ...
.Nm
.Op Fl nqbRhivwyD
.Op Fl P Ar rshcmd
.Fl c
.Ar name ...
.Oo login@ Oc Ns Ar host Ns Op :dest
.Sh 解説
.Nm
は、複数のホストに対し、ファイルの内容を同一に維持するためのプログラムです。
本プログラムによるファイルコピーでは、可能な限り所有者、グループ、
アクセスモード、そして更新時刻を保存しようとします。
そして、現在実行中のプログラムの更新も可能です。
.Nm
は、コマンドを
.Ar distfile
から読み出し、その内容に従ってファイルやディレクトリの更新を制御します。
.Pp
第 1 の書式特有のオプション:
.Pp
.Bl -tag -width indent
.It Fl
.Ar distfile
に
.Sq Fl
を指定した場合、標準入力からデータを入力します。
.It Fl f Ar distfile
指定した
.Ar distfile
を使用します。
.El
.Pp
.Fl f
オプションも
.Sq Fl
オプションも指定されない場合には、本プログラムは最初に
.Dq Pa distfile
を、次に
.Dq Pa Distfile
を探し、入力として使用します。
コマンド行にて何の指定も与えられない場合には、
.Nm
は、
.Ar distfile
に記述されたすべてのファイルとディレクトリを更新します。
それ以外の場合では、引数は、更新対象となるファイル名あるいは
実行されるコマンドのラベルと解釈されます。
ラベルやファイル名が衝突する場合には、すべてラベルとして取り扱います。
これらの名前は、指定したコマンドを用いて指定したファイルを更新するのに
用いられます。
.Pp
第 2 の書式特有のオプション:
.Pp
.Bl -tag -width Fl c
.It Fl c
.Nm
に、残りの引数を小規模の
.Ar distfile
として解釈するように指示します。
.Pp
このオプションを使用した場合と等価な distfile は、以下のようになります。
.Pp
.Bd -filled -offset indent -compact
.Pq Ar name ...
.Li ->
.Op Ar login@
.Ar host
.Bd -filled -offset indent -compact
.Li install
.Op Ar dest ;
.Ed
.Ed
.El
.Pp
両方の書式に共通のオプション:
.Pp
.Bl -tag -width Ic
.It Fl P Ar rshcmd
.Xr rsh 1
と同様な機能を持つ他のプログラムをリモートサーバへの転送に使用します。
指定したプログラムはリモートサーバへバイナリ透過な経路を使用できる必要が
あり、コマンド引数の書式が
.Xr rsh 1
と互換でなければなりません。
.It Fl d Ar var=value
.Ar var
に対して
.Ar value
を代入することを定義します。
.Fl d
オプションは、変数を定義したり、
.Ar distfile
中の変数を変更したりするのに用いられます。
.Ar value
には、空白文字列、名前、もしくは括弧で囲まれて、タブやスペースで区切ら
れた名前の列挙が指定可能です。
.It Fl h
シンボリックリンクを追いかけます。リンクしてあるファイルの場合、リンクファ
イルそのものでなく、リンク先にある実体をコピーします。
.It Fl i
解決できないリンクを無視します。
.Nm
は、通常はリンクファイルについてもコピーを行ない、リンクが解決出来ない場合
には、その旨をユーザに通知します。
.It Fl m Ar host
ファイルを更新するホストを制限します。
複数の
.Fl m
引数を指定する事で、
.Ar distfile
に記述のあるホスト名の中から複数のホスト名を選択して与えることが可能です。
.It Fl n
実行しないで、コマンド自身を表示します。本オプションは
.Ar distfile
のデバッグに有効です。
.It Fl q
QUIETモードに入ります。更新されるファイルについては、通常は標準出力に
表示されますが、
.Fl q
オプションはこの出力を抑制します。
.It Fl R
無関係なファイルを削除します。ディレクトリを更新する場合に、
リモートホスト上に存在するファイルが、配布元のディレクトリ中に存在しないなら、
該当するファイルを削除します。本オプションは、配布元と配布先で完全にディ
レクトリ配下の内容を一致させたい場合に有効です。
.It Fl v
すべてのホストのファイルが最新の物であるかの確認を行ないます。すべての
古いファイルについては一覧が表示されますが、そのファイルが変更されたり、
そのファイルに関してシステムからメールが届いたりすることはありません。
.It Fl w
WHOLE モードを有効にします。指定されたファイル名全体が、配布先ディレクトリ名の
後に付加されます。通常は、ファイル名からディレクトリ名を取り除いた
最後の部分のみがファイル名を変更する時に使われます。
本オプションは、ディレクトリ構造をフラットにせず、配布元のディレクトリ
構造をそのまま配布先に持っていきたい場合に用いられます。例えば、
( dir1/f1 dir2/f2 )のように表されるファイルを、dir3 というディレクトリに
配布した場合、配布先では dir3/f1 や dir3/f2 ではなく、
dir3/dir1/f1 や dir3/dir2/f2 が作成されます。
.It Fl y
YOUNGERモードを有効にします。通常、ファイルの更新は、
.Ar mtime
と
.Ar size
(
.Xr stat  2
参照)
が一致しない場合に行なわれます。しかし、
.Fl y
オプションが有効になっている場合には、
.Nm
は、配布元のファイルより新しいファイルは更新しません。
通常本オプションは、他のホストに存在する、より新しいファイルを置き換えない
目的で用いられます。
配布元より新しいファイルが配布先にあった場合には、その旨を通知する
メッセージが表示されます。
.It Fl D
デバッグモード。
.El
.Pp
.Ar distfile
は、コピーされるファイル、配布先ホスト、そして更新のための手順を指定
するエントリを含みます。各エントリは、以下の形式のいずれかに分類され
ます。
.Pp
.Bd -literal -offset indent -compact
<variable name> `=' <name list>
[label:]<source list> `\->' <destination list> <command list>
[label:]<source list> `::' <time_stamp file> <command list>
.Ed
.Pp
一番目の形式は、値を定義するのに用いられます。
二番目の形式は、他のホストへファイルを配布するのに用いられます。
三番目の形式は、指定した日付以降に更新されたファイルの一覧を作成するのに
用いられます。
.Ar source list
は、配布元のファイルやディレクトリの一覧を指定します。
.Ar destination list
は、ファイルの配布先のホスト一覧です。配布元ファイルリスト (source
list) 中の各ファイルが、更新を行なおうとしているホストにおいて古いもの
である(二番目の形式)か、または、指定のファイルのタイムスタンプより新し
い場合(三番目の形式)には、変更対象リストに追加されます。
.Pp
ラベルの使用は、任意です。ラベルについては、部分的な変更を行う場合
に、コマンドを識別するために用いられます。
.Pp
改行、タブ、そして空白は、セパレータとしてのみ用いられ、それ以外の場で
用いられた場合には無視されます。コメントは、`#' で始まり改行で終ります。
.Pp
`$' で始まり、1文字もしくは `{''}' でくくられた名前の変数については、処理中に
その値に置き換えられます(最後に出てくる例を参照して下さい)。
.Pp
配布元ファイルリストと配布先ホストリストの一覧は、以下の形式を取ります。
.Bd -literal -offset indent
<名前>
.Ed
または
.Bd -literal -offset indent -compact
`(' <空白で区切られた 0 個以上の名前> `)'
.Ed
.Pp
シェルのメタ文字であるところの `[', `]', `{', `}', `*', そして `?'
は、(配布元のホスト上でのみ)
.Xr csh  1
同様に解釈され、展開されます。
これは、バックスラッシュを用いて回避する事が出来ます。
`~' 文字もまた、
.Xr csh 1
同様に展開されますが、配布元と配布先のホストで別々に展開されます。
.Fl w
オプションが `~' ではじまるファイル名とともに用いられた場合、ホームディ
レクトリを除くすべてのファイル／ディレクトリ名が配布先の名前に加えられます。
`/' や `~' 以外の文字ではじまるファイル名は、配布先のユーザのホームディ
レクトリをルートディレクトリとみなして、指定されたファイルの名前を
追加して配布先でのファイル名を作成します。
.Pp
コマンドリストは、以下の形式に従った、0 個以上のコマンドからなります。
.Bd -ragged -offset indent -compact
.Bl -column except_patx pattern\ listx
.It `install'	<options>	opt_dest_name `;'
.It `notify'	<name list>	`;'
.It `except'	<name list>	`;'
.It `except_pat'	<pattern list>	`;'
.It `special'	<name list>	string `;'
.El
.Ed
.Pp
.Ic install
コマンドは、古いファイルやディレクトリをコピーするのに用いられます。
各配布元のファイルは、配布先ホストリスト中の各ホストへコピーさ
れます。ディレクトリも同様にして、再帰的にコピーされます。
.Ar Opt_dest_name
は、ファイル名を変更するための任意的なパラメータです。
.Ic install
コマンドがコマンドリストに存在しない場合や、配布先での
ファイル名が指定されていない場合、配布元のファイル名がそ
のまま配布先でのファイル名として採用されます。
パス名に含まれるディレクトリが配布先のホスト上に存在しない
場合には、そのディレクトリを作成します。
不慮の事故を回避するために、配布先のホスト上に空でないディレクトリがあっ
ても、通常のファイルやシンボリックリンクに置き換えたりはしません。
しかし、`\-R'オプションを付加して実行した場合には、配布元のディレクト
リに当該ファイルが存在しなければ、空でないディレクトリでも削除されます。
.Ar option
には、`\-R', `\-h', `\-i', `\-v', `\-w', `\-y', `\-b'
があり、それらが配布元ファイルリストに記述されたファイルに対
してのみ適用される事を除いて、コマンドライン中に指定した事と同じ意味と
なります。
配布先ホストにおけるログイン名は、配布元でのログイン名と同じですが、配
布先のログイン名が ``login@host" という形式で指定されている場合にはこの
限りではありません。
.Pp
.Ic notify
コマンドは、更新されたファイル一覧(および、発生した何らかのエラー)をメール
によって通知する場合に用いられます。
指定のメールアドレス中に `@' がない場合には、配布先のホスト名がメールア
ドレスに付加されます(例: name1@host, name2@host, ...)。
.Pp
.Ic except
コマンドは、
.Ar name list
に列挙されているファイルを除き、配布元ファイルリストに記述されているすべての
ファイルを更新するのに用いられます。
本コマンドは、特定ファイルを除くすべてのファイルをコピーするのに用い
られます。
.Pp
.Ic except_pat
コマンドは、
.Ic except
コマンドと似ていますが、
.Ar pattern list
として正規表現を用いたリストを指定できるところが異なります
(詳細については、
.Xr re_format 7
を参照して下さい)。
ファイル名に含まれる文字列が、正規表現のパターンに一致すると、そのファ
イルは無視されます。
`\e' が文字をクオートする事に注意して下さい。正規表現に含めるためには、
2 個続ける必要があります。
.Ar pattern list
の中の変数は展開されますが、シェルのファイルパターンマッチ方法とは異なります。
`$' を含めるためには、`\e' を用いてエスケープする必要があります。
.Pp
.Ic special
コマンドは、
.Ar name list
にて指定されたファイルを更新、または、コピーした後に、配布先の
ホスト上で実行される
.Xr sh  1
コマンドを指定するのに用いられます。
.Ar name list
が省略された場合には、シェルコマンドは各ファイルの更新が終了する度に
実行されます。シェル変数 `FILE' には、
文字列
.Ar string
で指定したコマンドを実行する前に、直前に処理したファイル名が格納されます。
文字列
.Ar string
を、`"'で囲む事で、
.Ar distfile
において複数行にわたって記述する事が出来ます。
シェルに対する複数の実行コマンドは、`;'で区切られる必要があります。
指定されたコマンドは、ファイルの更新を行なおうとしている配布先ホストの
当該ユーザのホームディレクトリで実行されます。
.Ar special
コマンドは、プログラムがファイルを更新した後にプライベートデータベース
を再構築する用途をはじめとして、いろいろな場面で用いる事が出来ます。
.Pp
以下に示す例は簡単な一例です。
.Bd -literal -offset indent
HOSTS = ( matisse root@arpa )

FILES = ( /bin /lib /usr/bin /usr/games
\t/usr/include/{*.h,{stand,sys,vax*,pascal,machine}/*.h}
\t/usr/lib /usr/man/man? /usr/ucb /usr/local/rdist )

EXLIB = ( Mail.rc aliases aliases.dir aliases.pag crontab dshrc
\tsendmail.cf sendmail.fc sendmail.hf sendmail.st uucp vfont )

${FILES} -> ${HOSTS}
\tinstall -R ;
\texcept /usr/lib/${EXLIB} ;
\texcept /usr/games/lib ;
\tspecial /usr/lib/sendmail "/usr/lib/sendmail -bz" ;

srcs:
/usr/src/bin -> arpa
\texcept_pat ( \e\e.o\e$ /SCCS\e$ ) ;

IMAGEN = (ips dviimp catdvi)

imagen:
/usr/local/${IMAGEN} -> arpa
\tinstall /usr/local/lib ;
\tnotify ralph ;

${FILES} :: stamp.cory
\tnotify root@cory ;
.Ed
.Sh 関連ファイル
.Bl -tag -width /tmp/rdist* -compact
.It Pa distfile
入力コマンドファイル
.It Pa /tmp/rdist*
更新リストのために用いられる一時ファイル
.El
.Sh 関連項目
.Xr csh 1 ,
.Xr sh 1 ,
.Xr stat 2 ,
.Xr re_format 7
.Sh 歴史
.Nm
コマンドは、
.Bx 4.3
から登場しました。
.Sh 診断
.Nm
のバージョン不一致についての通知は、実際にはシェルを起動する際の
何らかの問題に起因して発生します。例えば、ユーザの所属グループがあまり
多すぎるなどが挙げられます。
.Pp
.Nm
は、
.Xr rcmd 3
タイプのリモートサービス実行が、静かに成功することに依存します。
よくある誤りとしては、非対話の初期化スクリプト、例えば
.Pa .cshrc
が出力を行なってしまうことがあります
(出力を行う他のプログラムを実行するものの、
そのプログラムが端末に接続されていないということもあります --
よくある原因が
.Xr stty 1
です)。
このような余計な出力のために、
.Nm
が失敗して次のようなエラーメッセージが表示されます:
.Pp
.Dl rdist: connection failed: version numbers don't match
.Sh バグ
配布元ファイルは、
.Nm
コマンドが起動される配布元ホストに存在しなければなりません。
.Pp
ディレクトリ配下のすべてのファイルが更新された後に
.Ic special
コマンドを実行
するのは困難です。
.Pp
変数の置換は、name list に対してのみ働きます。より一般的なマクロ
の機能があるべきでしょう。
.Pp
.Nm
は、負 (1970 年 1 月 1 日以前の日付)の mtime を持つファイルに対してのアクセスを
行うと異常終了します。
.Pp
空でないディレクトリを通常ファイルやシンボリックリンクで置換できる、
`force' オプションがあるべきでしょう。内容自体は一致しているファイルのモード
や所有者を更新する方法も必要でしょう。
