freebsd/freebsd-doc/ja_JP.eucJP/man/man1/sockstat.1
.\"-
.\" Copyright (c) 1999 Dag-Erling Co��an Smgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer
.\"    in this position and unchanged.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.bin/sockstat/sockstat.1,v 1.6.2.4 2000/12/14 14:10:38 ru Exp %
.\"
.\" jpman %Id: sockstat.1,v 1.3 1999/05/07 16:58:23 kuma Stab %
.\"
.Dd April 13, 1999
.Dt SOCKSTAT 1
.Os FreeBSD
.Sh 名称
.Nm sockstat
.Nd 開いているソケットを列挙する
.Sh 書式
.Nm
.Op Fl 46u
.Sh 解説
.Nm
コマンドは、インターネットドメインおよび Unix ドメインの
開いているソケットを列挙します。
.Pp
次のオプションを使用可能です:
.Bl -tag -width Fl
.It Fl 4
AF_INET (IPv4) ソケットを表示します。
.It Fl 6
AF_INET6 (IPv6) ソケットを表示します。
.It Fl u
AF_LOCAL (Unix) ソケットを表示します。
.El
.Pp
オプションを指定しないと、
.Nm
は 3 種類すべてのソケットを表示します。
.Pp
各ソケットに関して列挙される情報は次の通りです:
.Bl -tag -width "FOREIGN_ADDRESS"
.It Li USER
ソケットを所有するユーザです。
.It Li COMMAND
ソケットを保持するコマンドです。
.It Li PID
ソケットを保持するコマンドの、プロセス ID です。
.It Li FD
ソケットのファイル記述子番号です。
.It Li PROTO
インターネットソケットに対しては、関連付けられている、転送プロトコルです。
Unix ソケットに対しては、ソケットタイプ (ストリームまたはデータグラム) です。
.It Li ADDRESS
(Unix ソケットのみ)
listen しているソケットに対しては、これはソケットのファイル名です。
他のソケットに対しては、名前と PID と相手のファイル記述子番号であるか、
ソケットが bind されていないか connect されていない場合には "(none)" です。
.It Li LOCAL ADDRESS
(インターネットソケットのみ)
ソケットのローカル側の終点が結合されているアドレスです (
.Xr getsockname 2
参照)。
.It Li FOREIGN ADDRESS
(インターネットソケットのみ)
ソケットの外界側の終点が結合されているアドレスです (
.Xr getpeername 2
参照)。
.El
.Sh 関連項目
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr inet 4 ,
.Xr inet6 4
.Sh 歴史
.Nm
コマンドは
.Fx 3.1
に登場しました。
.Sh 作者
.Nm
コマンドと本マニュアルページは
.ie t .An Dag-Erling Sm\(/ograv Aq des@freebsd.org
.el .An Dag-Erling Smograv Aq des@freebsd.org
が記述しました。
