freebsd/freebsd-doc/ja_JP.eucJP/man/man1/sockstat.1
.\"-
.\" Copyright (c) 1999 Dag-Erling Co��an Smgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer
.\"    in this position and unchanged.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.bin/sockstat/sockstat.1,v 1.6.2.1 2000/06/30 09:51:57 ps Exp %
.\"
.\" jpman %Id: sockstat.1,v 1.3 1999/05/07 16:58:23 kuma Stab %
.\"
.Dd April 13, 1999
.Dt SOCKSTAT 1
.Sh 名称
.Nm sockstat
.Nd 開いているインターネットソケットを列挙する
.Sh 書式
.Nm
.Sh 解説
.Nm
コマンドは、開いているインターネットソケットを列挙します。
各ソケットに関して列挙される情報は次の通りです:
.Bl -tag -width "FOREIGN_ADDRESS"
.It Li USER
ソケットを所有するユーザです。
.It Li COMMAND
ソケットを保持するコマンドです。
.It Li PID
ソケットを保持するコマンドの、プロセス ID です。
.It Li FD
ソケットのファイル記述子番号です。
.It Li PROTO
ソケットに関連付けられている、転送プロトコルです。
.It Li LOCAL ADDRESS
ソケットのローカル側の終点が結合されているアドレスです (
.Xr getsockname 2
参照)。
.It Li FOREIGN ADDRESS
ソケットの外界側の終点が結合されているアドレスです (
.Xr getpeername 2
参照)。
.El
.Sh 関連項目
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr inet 4 ,
.Xr inet6 4
.Sh 歴史
.Nm
コマンドは
.Fx 3.1
に登場しました。
.Sh 作者
.Nm
コマンドと本マニュアルページは
.ie t .An Dag-Erling Sm\(/ograv Aq des@freebsd.org
.el .An Dag-Erling Smograv Aq des@freebsd.org
が記述しました。
