freebsd/freebsd-doc/ja_JP.eucJP/man/man1/sockstat.1
.\"-
.\" Copyright (c) 1999 Dag-Erling Coidan Smorgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer
.\"    in this position and unchanged.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.bin/sockstat/sockstat.1,v 1.18.8.2 2005/02/26 13:44:05 brueffer Exp %
.\"
.\" $FreeBSD$
.\"
.Dd September 7, 2004
.Dt SOCKSTAT 1
.Os
.Sh 名称
.Nm sockstat
.Nd 開いているソケットを列挙する
.Sh 書式
.Nm
.Op Fl 46clu
.Op Fl p Ar ports
.Sh 解説
.Nm
コマンドは、インターネットドメインおよび
.Ux
ドメインの
開いているソケットを列挙します。
.Pp
次のオプションを使用可能です:
.Bl -tag -width Fl
.It Fl 4
.Dv AF_INET
(IPv4) ソケットを表示します。
.It Fl 6
.Dv AF_INET6
(IPv6) ソケットを表示します。
.It Fl c
connect しているソケット数を表示します。
.It Fl l
listen しているソケット数を表示します。
.It Fl p Ar ports
ローカルまたは外部のポート番号がリストで指定された場合、
インターネットソケットのみを表示します。
.Ar ports
引数はコンマで区切られたポート番号と範囲のリストであり、
範囲は開始と終了をダッシュで区切ったものです。
.It Fl u
.Dv AF_LOCAL
.Pq Ux
ソケットを表示します。
.El
.Pp
.Fl 4 , 6 , u
のいずれも指定しない場合、
.Nm
は 3 ドメインすべてのソケットを表示します。
.Pp
.Fl c ,
.Fl l
のいずれも指定しない場合、
.Nm
は、listen 中および connect 中の両方のソケットを列挙します。
.Pp
各ソケットに関して列挙される情報は次の通りです:
.Bl -tag -width "FOREIGN ADDRESS"
.It Li USER
ソケットを所有するユーザです。
.It Li COMMAND
ソケットを保持するコマンドです。
.It Li PID
ソケットを保持するコマンドの、プロセス ID です。
.It Li FD
ソケットのファイル記述子番号です。
.It Li PROTO
インターネットソケットに対しては、関連付けられている、転送プロトコルです。
.Ux
ソケットに対しては、ソケットタイプ (ストリームまたはデータグラム) です。
.It Li LOCAL ADDRESS
インターネットソケットに対しては、
ソケットのローカル側の終点が結合されているアドレスです (
.Xr getsockname 2
参照)。
bind された
.Ux
ソケットに対しては、これはソケットのファイル名です。
他の
.Ux
ソケットに対しては、右矢印に続く終端のファイル名か、
終端が分からない場合には
.Dq Li ??
です。
.It Li FOREIGN ADDRESS
(インターネットソケットのみ)
ソケットの外界側の終点が結合されているアドレスです (
.Xr getpeername 2
参照)。
.El
.Pp
.Dv LISTEN , SYN_SENT
や
.Dv ESTABLISHED
状態ではない
.Dv AF_INET
もしくは
.Dv AF_INET6
ドメインの TCP ソケットは、
.Nm
では表示されないことがあります。
代わりに
.Xr netstat 1
を使用して調査してください。
.Sh 関連項目
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr inet 4 ,
.Xr inet6 4
.Sh 歴史
.Nm
コマンドは
.Fx 3.1
に登場しました。
.Sh 作者
.Nm
コマンドと本マニュアルページは
.An Dag-Erling Sm\(/orgrav Aq des@FreeBSD.org
が記述しました。
