freebsd/freebsd-doc/ja_JP.eucJP/man/man1/ul.1
.\"	%NetBSD: ul.1,v 1.3 1994/12/07 00:28:23 jtc Exp %
.\"
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)ul.1	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.bin/ul/ul.1,v 1.11 2003/06/08 13:54:56 charnier Exp %
.\" $FreeBSD$
.\"
.Dd June 6, 1993
.Dt UL 1
.Os
.Sh 名称
.Nm ul
.Nd 入力中のアンダライン生成コードを端末のシーケンスに変換する
.Sh 書式
.Nm
.Op Fl i
.Op Fl t Ar terminal
.Op Ar name Ar ...
.Sh 解説
.Nm
ユーティリティは、
.Ar file
が指定されていればそのファイルを、指定されていなければ標準入力を読み
込み、アンダラインを表示すべき部分を、環境変数
.Ev TERM
で定義されている
端末にあわせてアンダラインを表示するシーケンスに変換します。
アンダラインのシーケンスを決定するために、
.Pa /etc/termcap
が読み込まれます。
端末がアンダライン機能を持たず、強調表示機能を持っている場合に
は、強調表示をかわりに使用します。もし端末が二重印字できる場合、
すなわち端末自体にアンダラインを扱う機能がある場合には、
.Nm
は
.Xr cat 1
と同じになります。
端末がアンダラインを扱えない場合は、アンダラインを無視します。
.Pp
オプションとしては以下のものがあります。
.Bl -tag -width Ds
.It Fl i
アンダラインのかわりに、次の行の当該位置にダッシュ `\-' を表示し
ます。画面上で
.Xr nroff 1
出力でアンダラインを見たいときには有効です。
.It Fl t Ar terminal
.Ar terminal
で端末を指定します。デフォルトでは環境変数
.Ev TERM
の値が使用されます。
.El
.Sh 環境変数
.Bl -tag -width TERM
.It Ev TERM
tty デバイスの能力を表します (
.Xr termcap 5
参照)。
通常、環境変数
.Ev TERM
は、ログイン時に、
.Pa /etc/ttys
に指定されたデフォルト端末タイプか、ユーザのログインプロセ
スのなかで
.Pa login
ファイル (
.Xr environ 7
参照) によって設定されます。
.El
.Sh 関連項目
.Xr colcrt 1 ,
.Xr man 1 ,
.Xr nroff 1
.Sh バグ
.Xr nroff 1
は、通常、
バックスペースとアンダライン文字の組とテキストとを交互に出力し、
アンダラインを表します。
.Nm
は、このカーソルの逆方向への移動の最適化までは行ないません。
.Sh 歴史
.Nm
コマンドは
.Bx 3.0
から登場しました。
