freebsd/freebsd-doc/ja_JP.eucJP/man/man1/vidcontrol.1
.\" t
.\"
.\" vidcontrol - a utility for manipulating the syscons video driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)vidcontrol.1
.\"	%Id: vidcontrol.1,v 1.14.2.2 1999/06/03 12:44:49 yokota Exp %
.\"
.\" jpman %Id: vidcontrol.1,v 1.3 1997/08/04 01:31:25 mitchy Stab %
.Dd May 22, 1994
.Dt VIDCONTROL 1
.Os
.Sh 名称
.Nm vidcontrol
.Nd syscons 画面ドライバの操作ユーティリティ
.Sh 書式
.Nm
.Op Fl r Ar fg Ar bg
.Op Fl b Ar color
.Op Fl c Ar appearance
.Op Fl d
.Op Fl i Ar adapter|mode
.Op Fl l Ar scrmap
.Op Fl L
.Op Fl m Ar on|off
.Op Fl f Ar size Ar file
.Op Fl s Ar number
.Op Fl t Ar N|off
.Op Fl x
.Op mode
.Op fgcol Op bgcol
.Op show
.Sh 解説
.Nm
コマンドを用いて syscons 画面ドライバの様々なオプション、例えば、
画面モード、色、カーソル、画面マップ (scrnmap)、
フォント、スクリーンセーバタイムアウトを設定することができます。
.Pp
以下のコマンドラインオプションをサポートしています:
.Bl -tag -width indent
.It mode
新しいビデオモードを選択します。
現在サポートしているモードは次の通りです:
.Ar 40x25 ,
.Ar 80x25 ,
.Ar 80x30 ,
.Ar 80x43 ,
.Ar 80x50 ,
.Ar 80x60 ,
.Ar 132x25 ,
.Ar 132x30 ,
.Ar 132x43 ,
.Ar 132x50 ,
.Ar 132x60 ,
.Ar VGA_40x25 ,
.Ar VGA_80x25 ,
.Ar VGA_80x50 ,
.Ar EGA_80x25 ,
.Ar EGA_80x43 ,
.Ar VESA_132x25 ,
.Ar VESA_132x30 ,
.Ar VESA_132x43 ,
.Ar VESA_132x50 ,
.Ar VESA_132x60
。
.\" また、グラフィックモード
.\" .Ar VGA_320x200 ,
ラスタテキストモード
.Ar VGA_800x600
も選択できます。
後述の
.Sx ビデオモードサポート
を参照してください。
.It fgcol Op bgcol
テキストを表示する際の色を変更します。
前景色 (例: "vidcontrol white")、あるいは
前景色および背景色 (例: "vidcontrol yellow blue") を指定することにより
変更できます。
.It show
指定したプラットフォームでサポートされている色を表示します。
.It Fl r Ar foreground Ar background
反転表示モードで用いる色を前景色
.Ar foreground 
および背景色
.Ar background
に変更します。
.It Fl b Ar color
ボーダ色を
.Ar color
に設定します (VGA ハードウェアでのみサポートされています)。
.It Fl c Ar normal|blink|destructive
カーソルの外観を変更します。
カーソルは、反転ブロック (normal)、反転ブロックの点滅 (blink)、
あるいは古いハードウェアカーソル様のもの (destructive) のいずれかです。
後者は実際にはシミュレートしています。
.It Fl d
現在の画面出力マップを表示します。
.It Fl l Ar scrmap
画面出力マップをファイル
.Ar scrmap
から読み込んで設定します。
.It Fl L
画面出力マップをデフォルトに設定します。
.It Fl i Ar adapter
現在のビデオアダプタに関する情報を表示します。
.It Fl i Ar mode
現在のビデオハードウェアにて使用可能なビデオモードを表示します。
.It Fl m Ar on|off
マウスポインタを
.Ar on
または
.Ar off
します。
テキストモードでのカット & ペースト機能を利用するために moused デーモンと共に
使用します。
.It Fl f Ar size Ar file
サイズ
.Ar size
用のフォントをファイル
.Ar file
から読み込みます。
現在のところ
.Ar size
には 8x8, 8x14, 8x16 のみが指定できます。
フォントファイルは uuencode された形式でも
生のバイナリフォーマットでも構いません。
.It Fl s Ar number
現在の vty を
.Ar number
に設定します。
.It Fl t Ar N|off
スクリーンセーバのタイムアウト値を
.Ar N
秒に設定、あるいはスクリーンセーバを無効 (
.Ar off
)にします。
.It Fl x
出力に 16 進数を用います。
.El
.Ss ビデオモードサポート
前記の全モードを
ビデオカードがサポートしているとは限らないことに注意してください。
.Fl i Ar mode
オプションを使用することにより、
ビデオカードがサポートしているモードを調べることが可能です。
.Pp
VESA ビデオモードもしくは 132 桁モードを使用する場合には、
VESA BIOS サポートをカーネルにリンクするか KLD にてロードする必要があることにも
注意してください (
.Xr vga 4
を参照してください)。
.Pp
25 または 30 行モード以外のビデオモードは、
特定の大きさのフォントが必要となるかもしれません。
前述の
.Fl f
オプションを使用し、フォントファイルをカーネルにロードしてください。
必要な大きさのフォントがカーネルにロードされていないと、
ユーザが新規ビデオモードを設定しようとした場合に
.Nm
は失敗します。
.Pp
.TS
c s
c c
l c.
ビデオモードとフォントの大きさ
モード	フォントの大きさ
25 行モード	8x16 (VGA), 8x14 (EGA)
30 行モード	8x16
43 行モード	8x8
50 行モード	8x8
60 行モード	8x8
.TE
.Pp
同じフォントの 3 つの大きさすべて (8x8, 8x14, 8x16) を
常にロードすることが望ましいです。
.Pp
.Pa /etc/rc.conf.local
中の変数
.Ar font8x8 ,
.Ar font8x14 ,
.Ar font8x16
を希望のフォントファイルに設定できます。
これにより、システム起動時にこれらのフォントが自動的にロードされます。
.Sh 関連ファイル
.Bl -tag -width /usr/share/syscons/scrnmaps -compact
.It Pa /usr/share/syscons/fonts
.It Pa /usr/share/syscons/scrnmaps
.El
.Sh 関連項目
.Xr kbdcontrol 1 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr rc.conf 5 ,
.Xr moused 8
.Sh 作者
.An Soren Schmidt Aq sos@FreeBSD.org
