freebsd/freebsd-doc/ja_JP.eucJP/man/man1/vidcontrol.1
.\" t
.\"
.\" vidcontrol - a utility for manipulating the syscons video driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)vidcontrol.1
.\" %FreeBSD: src/usr.sbin/vidcontrol/vidcontrol.1,v 1.24 2000/03/01 14:07:45 sheldonh Exp %
.\"
.\" jpman %Id: vidcontrol.1,v 1.3 1997/08/04 01:31:25 mitchy Stab %
.Dd June 30, 1999
.Dt VIDCONTROL 1
.Os
.Sh 名称
.Nm vidcontrol
.Nd syscons コンソールドライバの操作ユーティリティ
.Sh 書式
.Nm
.Op Fl b Ar color
.Op Fl c Ar appearance
.Op Fl d
.Op Fl f Ar size Ar file
.Op Fl i Cm adapter | mode
.Op Fl l Ar screen_map
.Op Fl L
.Op Fl M Ar char
.Op Fl m Cm on | off
.Op Fl r Ar foreground Ar background
.Op Fl s Ar number
.Op Fl t Ar N | Cm off
.Op Fl x
.Op Ar mode
.Op Ar foreground Op Ar background
.Op Cm show
.Sh 解説
.Nm
コマンドを用いて
.Xr syscons 4
コンソールドライバの様々なオプション、例えば、
画面モード、色、カーソル形状、画面出力マップ、
フォント、スクリーンセーバタイムアウトを設定できます。
.Pp
以下のコマンドラインオプションをサポートしています:
.Bl -tag -width indent
.It Ar mode
新しいビデオモードを選択します。
現在サポートしているモードは次の通りです:
.Ar 80x25 ,
.Ar 80x30 ,
.Ar 80x43 ,
.Ar 80x50 ,
.Ar 80x60 ,
.Ar 132x25 ,
.Ar 132x30 ,
.Ar 132x43 ,
.Ar 132x50 ,
.Ar 132x60 ,
.Ar VGA_40x25 ,
.Ar VGA_80x25 ,
.Ar VGA_80x50 ,
.Ar EGA_80x25 ,
.Ar EGA_80x43 ,
.Ar VESA_132x25 ,
.Ar VESA_132x43 ,
.Ar VESA_132x50 ,
.Ar VESA_132x60
。
.\" また、グラフィックモード
.\" .Ar VGA_320x200 ,
ラスタテキストモード
.Ar VGA_800x600
も選択できます。
後述の
.Sx ビデオモードサポート
を参照してください。
.It Ar foreground Op Ar background
テキストを表示する際の色を変更します。
前景色 (例: 
.Dq vidcontrol white )
、あるいは
前景色および背景色 (例: 
.Dq vidcontrol yellow blue )
を指定することにより変更できます。
後述の
.Cm show
コマンドを使用して、使用可能な色を見られます。
.It Cm show
指定したプラットフォームでサポートされている色を表示します。
.It Fl r Ar foreground background
反転表示モードで用いる色を前景色
.Ar foreground 
および背景色
.Ar background
に変更します。
.It Fl b Ar color
ボーダ色を
.Ar color
に設定します。
本オプションをビデオドライバが常にサポートしているのではないかもしれません。
.It Fl c Cm normal | blink | destructive
カーソルの外観を変更します。
カーソルは、反転ブロック
.Pq Cm normal
、反転ブロックの点滅
.Pq Cm blink
、あるいは古いハードウェアカーソル様のもの
.Pq Cm destructive
のいずれかです。
後者は実際にはシミュレートしています。
.It Fl d
現在の画面出力マップを表示します。
.It Fl l Ar screen_map
画面出力マップをファイル
.Ar screen_map
から読み込んで設定します。
.Xr syscons 4
も参照してください。
.It Fl L
出力画面マップをデフォルトに設定します。
.It Fl i Cm adapter
現在のビデオアダプタに関する情報を表示します。
.It Fl i Cm mode
現在のビデオハードウェアにて使用可能なビデオモードを表示します。
.It Fl M Ar char
マウスポインタを描く基本となる文字を
.Ar char
にします。
.It Fl m Cm on | off
マウスポインタを
.Cm on
または
.Cm off
します。
テキストモードでのカット & ペースト機能を利用するために
.Xr moused 8
デーモンと共に使用します。
.It Fl f Ar size Ar file
サイズ
.Ar size
用のフォントをファイル
.Ar file
から読み込みます。
(現在のところ
.Ar size
には
.Cm 8x8 ,
.Cm 8x14 ,
.Cm 8x16
のみが指定できます)。
フォントファイルは uuencode された形式でも
生のバイナリフォーマットでも構いません。
メニューによる
.Xr vidfont 1
コマンドを使用して、好きなフォントをロード可能です。
.Pp
MDA や CGA のような古いビデオカードは
ソフトウェアフォントをサポートしないことに注意してください。
後述の
.Sx ビデオモードサポート
と
.Sx 使用例
と
.Xr syscons 4
のマニュアルページも参照してください。
.It Fl s Ar number
現在の vty を
.Ar number
に設定します。
.It Fl t Ar N | Cm off
スクリーンセーバのタイムアウト値を
.Ar N
秒に設定、あるいはスクリーンセーバを無効 (
.Cm off
)にします。
.It Fl x
出力に 16 進数を用います。
.El
.Ss ビデオモードサポート
前記の全モードを
ビデオカードがサポートしているとは限らないことに注意してください。
.Fl i Cm mode
オプションを使用することにより、
ビデオカードがサポートしているモードを調べることが可能です。
.Pp
VESA ビデオモードもしくは 132 桁モードを使用する場合には、
VESA BIOS サポートをカーネルにリンクするか KLD にてロードする必要があることにも
注意してください (
.Xr vga 4
を参照してください)。
.Pp
25 または 30 行モード以外のビデオモードは、
特定の大きさのフォントが必要となるかもしれません。
前述の
.Fl f
オプションを使用し、フォントファイルをカーネルにロードしてください。
必要な大きさのフォントがカーネルにロードされていないと、
ユーザが新規ビデオモードを設定しようとした場合に
.Nm
は失敗します。
.Pp
.TS
c s
c c
l c.
ビデオモードとフォントの大きさ
モード	フォントの大きさ
25 行モード	8x16 (VGA), 8x14 (EGA)
30 行モード	8x16
43 行モード	8x8
50 行モード	8x8
60 行モード	8x8
.TE
.Pp
同じフォントの 3 つの大きさすべて (8x8, 8x14, 8x16) を
常にロードすることが望ましいです。
.Pp
.Pa /etc/rc.conf
または
.Pa /etc/rc.conf.local
中の変数を希望のフォントファイルに設定できます。
これにより、システム起動時にこれらのフォントが自動的にロードされます。
後述を参照してください。
.Pp
ラスタテキストモード
.Ar VESA_800x600
を使用したい場合、
.Em SC_PIXEL_MODE
オプション付きでカーネルを再コンパイルする必要があります。
このカーネルオプションについての詳細は、
.Xr syscons 4
を参照してください。
.Sh ビデオ出力設定
.Ss ブート時の設定
次の変数を
.Pa /etc/rc.conf
または
.Pa /etc/rc.conf.local
に設定することにより、ブート時にビデオ出力を設定可能です。
.Pp
.Bl -tag -width foo_bar_var -compact 
.It Ar blanktime
.Fl t
オプション用のタイムアウトを設定します。
.It Ar font8x16 , font8x14 , font8x8
.Fl f
オプション用のフォントファイルを指定します。
.It Ar scrnmap
.Fl l
オプション用の画面出力マップファイルを指定します。
.El 
.Pp 
更なる詳細は
.Xr rc.conf 5
を参照してください。
.Ss ドライバの設定
デフォルトフォントなどのデフォルト設定オプションの変更を、
ビデオカードドライバが許す場合があります。
その場合、ブート時のオプション設定の必要はなくなります。
詳細はビデオカードドライバマニュアル
.Pq 例えば Xr vga 4
を参照してください。
.Sh 関連ファイル
.Bl -tag -width /usr/share/syscons/scrnmaps/foo-bar -compact
.It Pa /usr/share/syscons/fonts/*
フォントファイル。
.It Pa /usr/share/syscons/scrnmaps/*
画面出力マップファイル。
.El
.Sh 使用例
カーネルに
.Pa /usr/share/syscons/fonts/iso-8x16.fnt
をロードしたい場合、
.Nm
を次のように実行します。
.Pp
.Dl vidcontrol -f 8x16 /usr/share/syscons/fonts/iso-8x16.fnt
.Pp
フォントファイルが
.Pa /usr/share/syscons/fonts
にある場合、ファイル名を
.Pa iso-8x16
のように短縮可能です。
.Pp
.Dl vidcontrol -f 8x16 iso-8x16
.Pp
同様に、画面出力マップファイルが
.Pa /usr/share/syscons/scrnmaps .
にある場合、
.Fl l
オプション用のファイル名を短縮可能です。
.Pp
.Dl vidcontrol -l iso-8859-1_to_cp437
.Pp
このコマンドは
.Pa /usr/share/syscons/scrnmaps/iso-8859-1_to_cp437.scm
をロードします。
.Sh 関連項目
.Xr kbdcontrol 1 ,
.Xr vidfont 1 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr rc.conf 5 ,
.Xr kldload 8 ,
.Xr moused 8
.Sh 作者
.An Soren Schmidt Aq sos@FreeBSD.org
