freebsd/freebsd-doc/ja_JP.eucJP/man/man1/vidcontrol.1
.\"
.\" vidcontrol - a utility for manipulating the syscons video driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)vidcontrol.1
.\" %FreeBSD: src/usr.sbin/vidcontrol/vidcontrol.1,v 1.24.2.13 2002/06/21 16:42:38 charnier Exp %
.\"
.\" $FreeBSD$
.Dd May 27, 2001
.Dt VIDCONTROL 1
.Os
.Sh 名称
.Nm vidcontrol
.Nd システムコンソールの制御と設定のユーティリティ
.Sh 書式
.Nm
.Op Fl CdLPpx
.Op Fl b Ar color
.Op Fl c Ar appearance
.Oo
.Fl f
.Op Ar size
.Ar file
.Oc
.Op Fl g Ar geometry
.Op Fl h Ar size
.Op Fl i Cm adapter | mode
.Op Fl l Ar screen_map
.Op Fl M Ar char
.Op Fl m Cm on | off
.Op Fl r Ar foreground Ar background
.Op Fl s Ar number
.Op Fl t Ar N | Cm off
.Op Ar mode
.Op Ar foreground Op Ar background
.Op Cm show
.Sh 解説
.Nm
コマンドを用いて
.Xr syscons 4
コンソールドライバの様々なオプション、例えば、
画面モード、色、カーソル形状、画面出力マップ、
フォント、スクリーンセーバタイムアウトを設定できます。
.Pp
以下のコマンドラインオプションをサポートしています:
.Bl -tag -width indent
.It Ar mode
新しいビデオモードを選択します。
現在サポートしているモードは次の通りです:
.Ar 80x25 ,
.Ar 80x30 ,
.Ar 80x43 ,
.Ar 80x50 ,
.Ar 80x60 ,
.Ar 132x25 ,
.Ar 132x30 ,
.Ar 132x43 ,
.Ar 132x50 ,
.Ar 132x60 ,
.Ar VGA_40x25 ,
.Ar VGA_80x25 ,
.Ar VGA_80x50 ,
.Ar VGA_90x25 ,
.Ar VGA_90x30 ,
.Ar VGA_90x43 ,
.Ar VGA_90x50 ,
.Ar VGA_90x60 ,
.Ar EGA_80x25 ,
.Ar EGA_80x43 ,
.Ar VESA_132x25 ,
.Ar VESA_132x43 ,
.Ar VESA_132x50 ,
.Ar VESA_132x60
。
.\" また、グラフィックモード
.\" .Ar VGA_320x200 ,
ラスタテキストモード
.Ar VGA_800x600
も選択できます。
後述の
.Sx ビデオモードサポート
を参照してください。
.It Ar foreground Op Ar background
テキストを表示する際の色を変更します。
前景色 (例:
.Dq vidcontrol white )
、あるいは
前景色および背景色 (例:
.Dq vidcontrol yellow blue )
を指定することにより変更できます。
後述の
.Cm show
コマンドを使用して、使用可能な色を見られます。
.It Cm show
指定したプラットフォームでサポートされている色を表示します。
.It Fl b Ar color
ボーダ色を
.Ar color
に設定します。
本オプションをビデオドライバが常にサポートしているのではないかもしれません。
.It Fl C
ヒストリバッファをクリアします。
.It Fl c Cm normal | blink | destructive
カーソルの外観を変更します。
カーソルは、反転ブロック
.Pq Cm normal
あるいは古いハードウェアカーソル様のもの
.Pq Cm destructive
のいずれかです。
前者は、オプションで
.Cm blink
にできます。
後者は実際にはシミュレートしています。
.It Fl d
現在の画面出力マップを表示します。
.It Xo
.Fl f
.Op Ar size
.Ar file
.Xc
サイズ
.Ar size
用のフォントをファイル
.Ar file
から読み込みます。
(現在のところ
.Ar size
には
.Cm 8x8 ,
.Cm 8x14 ,
.Cm 8x16
のみが指定できます)。
フォントファイルは uuencode された形式でも
生のバイナリフォーマットでも構いません。
メニューによる
.Xr vidfont 1
コマンドを使用して、好きなフォントをロード可能です。
.Pp
.Ar size
は省略可能です。
この場合、
.Nm
はフォントファイルの大きさから、推測します。
.Pp
MDA や CGA のような古いビデオカードは
ソフトウェアフォントをサポートしないことに注意してください。
後述の
.Sx ビデオモードサポート
と
.Sx 使用例
と
.Xr syscons 4
のマニュアルページも参照してください。
.It Fl g Ar geometry
テキストモードの
.Ar geometry
を、選択可能なジオメトリに設定します。
現在、
.Ar VESA_800x600
等のラスタモードのみが、本オプションをサポートします。
後述の、
.Sx ビデオモードサポート
と
.Sx 使用例を
参照してください。
.It Fl h Ar size
ヒストリ (スクロールバック) バッファを
.Ar size
行に設定します。
.It Fl i Cm adapter
現在のビデオアダプタに関する情報を表示します。
.It Fl i Cm mode
現在のビデオハードウェアにて使用可能なビデオモードを表示します。
.It Fl l Ar screen_map
画面出力マップをファイル
.Ar screen_map
から読み込んで設定します。
.Xr syscons 4
も参照してください。
.It Fl L
出力画面マップをデフォルトに設定します。
.It Fl M Ar char
マウスポインタを描く基本となる文字を
.Ar char
にします。
.It Fl m Cm on | off
マウスポインタを
.Cm on
または
.Cm off
します。
テキストモードでのカット & ペースト機能を利用するために
.Xr moused 8
デーモンと共に使用します。
.It Fl p
標準入力として参照される端末デバイスに対応する、
ビデオバッファの現在の内容をキャプチャします。
.Nm
ユーティリティは、ビデオバッファの内容を標準出力に対し、
生のバイナリフォーマットで出力します。
このフォーマットに関する詳細は、後述の
.Sx ビデオバッファダンプのフォーマット
を参照してください。
.It Fl P
.Fl p
と同じですが、ビデオバッファの内容をプレインテキストでダンプし、
印字不可の文字とテキスト属性情報を無視します。
.It Fl r Ar foreground background
反転表示モードで用いる色を前景色
.Ar foreground
および背景色
.Ar background
に変更します。
.It Fl s Ar number
現在の vty を
.Ar number
に設定します。
.It Fl t Ar N | Cm off
スクリーンセーバのタイムアウト値を
.Ar N
秒に設定、あるいはスクリーンセーバを無効 (
.Cm off
)にします。
.It Fl x
出力に 16 進数を用います。
.El
.Ss ビデオモードサポート
前記の全モードを
ビデオカードがサポートしているとは限らないことに注意してください。
.Fl i Cm mode
オプションを使用することにより、
ビデオカードがサポートしているモードを調べることが可能です。
.Pp
VESA ビデオモードもしくは 132 桁モードを使用する場合には、
VESA BIOS サポートをカーネルにリンクするか KLD にてロードする必要があることにも
注意してください (
.Xr vga 4
を参照してください)。
.Pp
VGA 90 桁モードを使用する場合には、カーネルを
.Ar VGA_WIDTH90
オプション付きでコンパイルする必要があります (
.Xr vga 4
を参照してください)。
.Pp
25 または 30 行モード以外のビデオモードは、
特定の大きさのフォントが必要となるかもしれません。
前述の
.Fl f
オプションを使用し、フォントファイルをカーネルにロードしてください。
必要な大きさのフォントがカーネルにロードされていないと、
ユーザが新規ビデオモードを設定しようとした場合に
.Nm
は失敗します。
.Pp
.Bl -column "25 line modes" "8x16 (VGA), 8x14 (EGA)" -compact
.Sy モード Ta Sy フォントの大きさ
.Li 25 行モード Ta 8x16 (VGA), 8x14 (EGA)
.Li 30 行モード Ta 8x16
.Li 43 行モード Ta 8x8
.Li 50 行モード Ta 8x8
.Li 60 行モード Ta 8x8
.El
.Pp
同じフォントの 3 つの大きさすべて (8x8, 8x14, 8x16) を
常にロードすることが望ましいです。
.Pp
.Pa /etc/rc.conf
または
.Pa /etc/rc.conf.local
中の変数を希望のフォントファイルに設定できます。
これにより、システム起動時にこれらのフォントが自動的にロードされます。
後述を参照してください。
.Pp
ラスタテキストモード
.Ar VESA_800x600
を使用したい場合、
.Dv SC_PIXEL_MODE
オプション付きでカーネルを再コンパイルする必要があります。
このカーネルオプションについての詳細は、
.Xr syscons 4
を参照してください。
.Ss ビデオバッファダンプのフォーマット
.Nm
ユーティリティは、
.Xr syscons 4
.Dv CONS_SCRSHOT
.Xr ioctl 2
を使用し、ビデオバッファの現在の内容をキャプチャします。
.Nm
ユーティリティは、バージョンと追加情報を標準出力に書き出し、
その後に端末デバイスの内容を続けて書き出します。
.Pp
PC ビデオメモリは、典型的には 2 バイトタプルの並びであり、
1 タプルが各文字位置に対応します。
各タプルでは、最初のバイトが文字コードであり、
2 番目のバイトが文字の色属性です。
.Pp
色属性バイトは、更に、どの前景色が有効かを指定する下位ニブルと、
どの背景色が有効かを指定する上位ニブルとに分解されます。
.Pp
.Bl -hang -offset indent -compact
.It 0
黒
.It 1
青
.It 2
緑
.It 3
シアン
.It 4
赤
.It 5
マゼンタ
.It 6
茶
.It 7
白
.It 8
灰
.It 9
明い青
.It 10
明い緑
.It 11
明いシアン
.It 12
明い赤
.It 13
明いマゼンタ
.It 14
黄
.It 15
白
.El
.Pp
最後の 8 色は、最初の 8 色を明るく見えるようにしたものです。
.Pp
例えば、2 バイト
.Pp
.Dl "65 158"
.Pp
は、大文字 A (文字コード 65) を、
明い青の背景 (高位ニブル 9) に黄色 (下位ニブル 15) という指定です。
.Pp
.Nm
の出力には小さなヘッダがあり、
そこには、出力を処理するユーティリティに有用な追加情報が含まれます。
.Pp
最初の 10 バイトは、常に次の並びです。
.Bl -column "Byte range" "Contents" -offset indent
.It Sy "バイト範囲	内容"
.It "1 から 8	リテラルテキスト" Dq Li SCRSHOT_
.It "9	ファイルフォーマットバージョン番号"
.It "10	ヘッダの残りバイト数"
.El
.Pp
これに続くバイトは、バージョン番号依存です。
.Bl -column "Version" "13 and up" -offset indent
.It Sy "バージョン	バイト	意味"
.It "1	11	文字数単位の端末幅"
.It "	12	文字数単位の端末の深さ"
.It "	13 以降	スナップショットデータ"
.El
.Pp
80x25 画面のダンプは (16 進数で) 次のように開始します。
.Bd -literal -offset indent
53 43 52 53 48 4f 54 5f 01 02 50 19
----------------------- -- -- -- --
          |              |  |  |  ` 10 進数の 25
          |              |  |  `--- 10 進数の 80
          |              |  `------ 残りのヘッダデータのバイト数 2
          |              `--------- ファイルフォーマットバージョン 1
          `------------------------ リテラル "SCRSHOT_"
.Ed
.Sh ビデオ出力設定
.Ss ブート時の設定
次の変数を
.Pa /etc/rc.conf
または
.Pa /etc/rc.conf.local
に設定することにより、ブート時にビデオ出力を設定可能です。
.Pp
.Bl -tag -width foo_bar_var -compact
.It Ar blanktime
.Fl t
オプション用のタイムアウトを設定します。
.It Ar font8x16 , font8x14 , font8x8
.Fl f
オプション用のフォントファイルを指定します。
.It Ar scrnmap
.Fl l
オプション用の画面出力マップファイルを指定します。
.El
.Pp
更なる詳細は
.Xr rc.conf 5
を参照してください。
.Ss ドライバの設定
デフォルトフォントなどのデフォルト設定オプションの変更を、
ビデオカードドライバが許す場合があります。
その場合、ブート時のオプション設定の必要はなくなります。
詳細はビデオカードドライバマニュアル
(例えば
.Xr vga 4 )
を参照してください。
.Sh 関連ファイル
.Bl -tag -width /usr/share/syscons/scrnmaps/foo-bar -compact
.It Pa /usr/share/syscons/fonts/*
フォントファイル。
.It Pa /usr/share/syscons/scrnmaps/*
画面出力マップファイル。
.El
.Sh 使用例
カーネルに
.Pa /usr/share/syscons/fonts/iso-8x16.fnt
をロードしたい場合、
.Nm
を次のように実行します。
.Pp
.Dl vidcontrol -f 8x16 /usr/share/syscons/fonts/iso-8x16.fnt
.Pp
フォントファイルが
.Pa /usr/share/syscons/fonts
にある場合、ファイル名を
.Pa iso-8x16
のように短縮可能です。
.Pp
.Dl vidcontrol -f 8x16 iso-8x16
.Pp
更に、フォントの大きさ
.Dq Li 8x16
を省略可能です。
.Pp
.Dl vidcontrol -f iso-8x16
.Pp
更に、フォントの大きさを指定するサフィックスも省略可能です。
この場合、
.Nm
は、現在表示されているフォントの大きさを使用してサフィックスを作成します。
.Pp
.Dl vidcontrol -f iso
.Pp
同様に、画面出力マップファイルが
.Pa /usr/share/syscons/scrnmaps
にある場合、
.Fl l
オプション用のファイル名を短縮可能です。
.Pp
.Dl vidcontrol -l iso-8859-1_to_cp437
.Pp
このコマンドは
.Pa /usr/share/syscons/scrnmaps/iso-8859-1_to_cp437.scm
をロードします。
.Pp
次のコマンドは、100x37 のラスタテキストモードを設定します
(LCD モデルによっては有用です):
.Pp
.Dl vidcontrol -g 100x37 VESA_800x600
.Pp
次のコマンドは、最初の仮想端末の内容をキャプチャし、出力を
.Pa shot.scr
ファイルへ向けます。
.Pp
.Dl vidcontrol -p < /dev/ttyv0 > shot.scr
.Pp
次のコマンドは、4 番目の仮想端末の内容を、
人間が読めるフォーマットで標準出力へダンプします。
.Pp
.Dl vidcontrol -P < /dev/ttyv3
.Sh 関連項目
.Xr kbdcontrol 1 ,
.Xr vidfont 1 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr rc.conf 5 ,
.Xr kldload 8 ,
.Xr moused 8 ,
.Xr watch 8
.Pp
様々な
.Li scr2*
ユーティリティが、
.Em "Ports Collection"
の
.Li graphics
と
.Li textproc
のカテゴリにあります。
.Sh 作者
.An S\(/oren Schmidt Aq sos@FreeBSD.org
