freebsd/freebsd-doc/ja_JP.eucJP/man/man1/whereis.1
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)whereis.1	8.2 (Berkeley) 12/30/93
.\" jpman %Id: whereis.1,v 1.3 1997/06/14 16:06:45 kubo Stab %
.\" %Id: whereis.1,v 1.2.2.1 1998/05/22 11:03:38 jkoshy Exp %
.\"
.Dd June 15, 1996
.Dt WHEREIS 1
.Os FreeBSD
.Sh 名称
.Nm whereis
.Nd プログラムのパスを表示します
.Sh 書式
.Nm whereis
.Op Fl bms
.Op Fl u
.Op Fl BMS dir ... Fl f
.Ar program ...
.Sh 解説
.Nm whereis
は標準のバイナリディレクトリやマニュアルページそして、特定のプログラム
のソースファイルディレクトリを検索し、指定されたプログラムのパスが
見つかれば表示します。与えられた名前は、はじめに
.Ql .ext 
形式のプレフィックスをひとつはずし、
ソースコード制御システムのためのファイル名のはじめの
.Ql s.
や最後の
.Ql ,v
を外し、パス名にされます。
.Pp
検索されるディレクトリは
.Xr sysctl 8
に文字列
.Dq user.cs_path
を与えた時に返される文字列と
.Pa /usr/libexec
および現在のユーザの
.Ev $PATH
です。マニュアルは、デフォルトでは
.Ev $MANPATH 
にしたがって検索されます。プログラムソースは、
.Pa /usr/src
や
.Pa /usr/ports 
の全てのサブディレクトリを含む、標準の場所のリストにあるものとされます。
.Pp
以下のようなオプションが利用可能です。
.Bl -tag -width indent
.It Fl B
バイナリを検索するためのディレクトリを指定します。
.Fl f
オプションが必要です。
.It Fl M
マニュアルページを検索するためのディレクトリを指定します。
.Fl f
オプションが必要です。
.It Fl S
プログラムソースを検索するためのディレクトリを指定します。
.Fl f
オプションが必要です。
.It Fl b
バイナリを検索します。
.It Fl f
.Fl B ,
.Fl M ,
.Fl S
オプションが指定された後で、ディレクトリのリストの境界を設定し、
.Ar name
リストのはじめを指定します。
.It Fl m
マニュアルページを検索します。
.It Fl s
ソースディレクトリを検索します。
.It Fl u
.Dq unusual
エントリを検索します。ファイルは、要求されたそれぞれのタイプのエントリがない場合に
普通でない (unusual) といわれます。
.El
.Sh 実行例
以下では、
.Pa /usr/bin
以下のドキュメントがない全てのユーティリティを見つけます。
.Dl whereis -m -u /usr/bin/*
.Sh 関連項目
.Xr find ,
.Xr locate 1 ,
.Xr which 1 ,
.Xr man 1 ,
.Xr sysctl 8
.Sh バグ
ソースの検索は、ソースディレクトリのリストの各要素の第一レベルの
サブディレクトリを検索するクイック検索で実装されています。
これが成功しない場合、
.Xr locate 1
ユーティリティがサブディレクトリのより深いところまで検索するために
呼び出されます。これは、時間がかかりますし、ロケートデーターベースが
更新されている時にだけ成功します。
.Sh 歴史
.Nm whereis
コマンドは、
.Bx 3.0 
で導入されました。この版は
.Bx 4.4 
で失われた歴史的な機能を再実装しました。
