Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/committers-guide/_index.po
Languages: es, ru

source: This section documents how to land a GitHub pull request that's submitted against the FreeBSD Git mirrors at GitHub. While this is not an official way to submit patches at this time, sometimes good fixes come in this way and it is easiest just to bring them into a committer's tree and have them pushed into the FreeBSD's tree from there. Similar steps can be used to pull branches from other repositories and land those. When committing pull requests from others, one should take extra care to examine all the changes to ensure they are exactly as represented.
es: Esta sección documenta cómo traerse una pull request de GitHub que se ha hecho contra los mirros de Git de FreeBSD en GitHub. Aunque en este momento esta no es una forma oficial de enviar parches, a veces buenos arreglos vienen de esta forma y es más fácil cogerlos del árbol de un committer que hacerles que lo empujen al árbol de FreeBSD desde ahí. Se pueden usar pasos similares para traerse ramas de otros repositorios. Cuando se hace commit de pull requests de otros, se debe tener especial cuidado en examinar todos los cambios para asegurar que son exactamente lo que representan.
ru: В этом разделе описано, как интегрировать запрос на принятие изменений (pull request) из GitHub, отправленный на зеркала FreeBSD в Git на GitHub. Хотя на данный момент это не официальный способ отправки исправлений, иногда таким образом приходят хорошие правки, и проще всего просто перенести их в дерево коммиттера и оттуда отправить (push) в дерево FreeBSD. Аналогичные шаги можно использовать для получать и сливать (pull) ветки из других репозиториев и их использовать их. При коммите запросов на принятие изменений от других следует проявлять особую осторожность, чтобы проверить все изменения и убедиться, что они в точности соответствуют заявленным.

source: Before beginning, make sure that the local Git repo is up to date and has the correct origins set crossref:committers-guide[keeping_current,as shown above]. In addition, make sure to have the following origins:
ru: Прежде чем начать, убедитесь, что локальный репозиторий Git актуален и имеет правильно настроенные источники, как показано в разделе crossref:committers-guide[keeping_current,выше]. Кроме того, убедитесь, что у вас есть следующие источники:

source: Often pull requests are simple: requests that contain only a single commit. In this case, a streamlined approach may be used, though the approach in the prior section will also work. Here, a branch is created, the change is cherry picked, the commit message adjusted, and sanity-checked before being pushed. The branch `staging` is used in this example but it can be any name. This technique works for any number of commits in the pull request, especially when the changes apply cleanly to the FreeBSD tree. However, when there's multiple commits, especially when minor adjustments are needed, `git rebase -i` works better than `git cherry-pick`. Briefly, these commands create a branch; cherry-picks the changes from the pull request; tests it; adjusts the commit messages; and fast forward merges it back to `main`. The PR number is `$PR` below. When adjusting the message, add `Pull Request: https://github.com/freebsd-src/pull/$PR`. All pull requests committed to the FreeBSD repository should be reviewed by at least one person. This need not be the person committing it, but in that case the person committing it should trust the other reviewers competence to review the commit. Committers that do a code review of pull requests before pushing them into the repo should add a `Reviewed by:` line to the commit, because in this case it is not implicit. Add anybody that reviews and approves the commit on github to `Reviewed by:` as well. As always, care should be taken to ensure the change does what it is supposed to, and that no malicious code is present.
ru: Часто запросы на принятие изменений просты: это запросы, содержащие всего один коммит. В этом случае можно использовать упрощённый подход, хотя подход из предыдущего раздела также будет работать. Здесь создаётся ветка, изменения выборочно применяются, сообщение коммита корректируется и проверяется на адекватность перед отправкой. В этом примере используется ветка `staging`, но она может иметь любое имя. Эта техника работает для любого количества коммитов в запросе на принятие изменений, особенно когда изменения чисто применяются к дереву FreeBSD. Однако, когда коммитов несколько, особенно когда требуются незначительные корректировки, `git rebase -i` работает лучше, чем `git cherry-pick`. Вкратце, эти команды создают ветку; выборочно применяют изменения из запроса на принятие изменений; тестируют их; корректируют сообщения коммитов; и выполняют слияние перемоткой (fast-forward) обратно в `main`. Номер PR ниже обозначен как `$PR`. При корректировке сообщения добавьте `Pull Request: https://github.com/freebsd-src/pull/$PR`. Все запросы на принятие изменений, зафиксированные в репозитории FreeBSD, должны быть проверены как минимум одним человеком. Это не обязательно должен быть тот, кто их фиксирует, но в этом случае тот, кто фиксирует, должен доверять компетентности других рецензентов в проверке коммита. Коммиттеры, которые проводят рецензирование кода у запросов на принятие изменений перед их отправкой в репозиторий, должны добавить строку `Reviewed by:` к коммиту, потому что в этом случае это не подразумевается. Добавьте всех, кто просматривает и одобряет коммит на github, также в `Reviewed by:`. Как всегда, следует позаботиться о том, чтобы изменение делало то, что предполагается, и чтобы в нём не было вредоносного кода.

source: In addition, please check to make sure that the pull request author name is not anonymous. Github's web editing interface generates names like:
ru: Кроме того, пожалуйста, убедитесь, что имя автора запроса на принятие изменений не является анонимным. Веб-интерфейс редактирования Github генерирует имена вида:

source: A polite request to the author for a better name and/or email should be made. Extra care should be taken to ensure no style issue or malicious code is introduced.
ru: Автору следует отправить вежливую просьбу предоставить более подходящее имя и/или адрес электронной почты. Следует проявлять особую осторожность, чтобы не допустить ошибок стиля или внедрения вредоносного кода.

source: For complicated pull requests that have multiple commits with conflicts, follow the following outline.
ru: Для сложных запросов на принятие изменений с несколькими коммитами, содержащими конфликты, следуйте приведённой ниже схеме.

source: checkout the pull request `git checkout github/pull/XXX`
ru: извлеките запрос на принятие изменений `git checkout github/pull/XXX`

source: create a branch to rebase `git checkout -b staging`
ru: создайте ветку для перебазирования `git checkout -b staging`

source: rebase the `staging` branch to the latest `main` with `git rebase -i main staging`
ru: перебазируйте ветку `staging` на последнюю версию `main` с помощью `git rebase -i main staging`

source: resolve conflicts and do whatever testing is needed
ru: разрешите конфликты и проведите все необходимые тестирования

source: fast forward the `staging` branch into `main` as above
ru: перемотайте (fast-forward) ветку `staging` в `main`, как описано выше

source: final sanity check of changes to make sure all is well
ru: сделайте финальную проверку изменений, чтобы убедиться, что всё в порядке

source: push to FreeBSD's Git repository.
ru: отправьте в репозиторий Git FreeBSD.

source: This will also work when bringing branches developed elsewhere into the local tree for committing.
ru: Это также будет работать при внесении веток, разработанных в другом месте, в локальное дерево для коммита.

source: Once finished with the pull request, close it using GitHub's web interface. It is worth noting that if your `github` origin uses `https://`, the only step you'll need a GitHub account for is closing the pull request.
ru: После завершения работы с запросом на принятие изменений (pull request), закройте его с помощью веб-интерфейса GitHub. Стоит отметить, что если ваш источник `github` использует `https://`, единственным шагом, для которого потребуется учетная запись GitHub, будет закрытие запроса на принятие изменений.

source: Version Control History
es: Histórico del Control de Versiones
ru: История системы контроля версий

source: The project has moved to crossref:committers-guide[git-primer,git].
ru: Проект перешёл на crossref:committers-guide[git-primer,git].

source: The FreeBSD source repository switched from CVS to Subversion on May 31st, 2008. The first real SVN commit is __r179447__. The source repository switched from Subversion to Git on December 23rd, 2020. The last real svn commit is __r368820__. The first real git commit hash is __5ef5f51d2bef80b0ede9b10ad5b0e9440b60518c__.
es: El repositorio fuente de FreeBSD pasó de CVS a Subversion el 31 de Mayo de 2008. El primer commit real de SVN es __r179447__. El repositorio fuente cambió de Subversion a Git el 23 de Diciembre de 2020. El último commit real de svn es __r368820__. El hash del primer commit real en git es __5ef5f51d2bef80b0ede9b10ad5b0e9440b60518c__.
ru: Репозиторий исходных кодов FreeBSD перешёл с CVS на Subversion 31 мая 2008 года. Первый настоящий коммит SVN — __r179447__. Репозиторий исходных кодов перешёл с Subversion на Git 23 декабря 2020 года. Последний настоящий коммит svn — __r368820__. Хеш первого настоящего коммита git — __5ef5f51d2bef80b0ede9b10ad5b0e9440b60518c__.

source: The FreeBSD `doc/www` repository switched from CVS to Subversion on May 19th, 2012. The first real SVN commit is __r38821__. The documentation repository switched from Subversion to Git on December 8th, 2020. The last SVN commit is __r54737__. The first real git commit hash is __3be01a475855e7511ad755b2defd2e0da5d58bbe__.
es: El repositorio `doc/www` de FreeBSD cambió de CVS a Subversion el 19 de Mayo de 2012. El primer commit real de SVN es __r38821__. El repositorio de documentación cambió de Subversion a Git el 8 de Diciembre de 2020. El último commit de SVN es __r54737__. El has del primer commit real de git es __3be01a475855e7511ad755b2defd2e0da5d58bbe__.
ru: Репозиторий `doc/www` FreeBSD перешёл с CVS на Subversion 19 мая 2012 года. Первый настоящий коммит SVN — __r38821__. Репозиторий документации перешёл с Subversion на Git 8 декабря 2020 года. Последний коммит SVN — __r54737__. Первый настоящий хэш коммита git — __3be01a475855e7511ad755b2defd2e0da5d58bbe__.

source: The FreeBSD `ports` repository switched from CVS to Subversion on July 14th, 2012. The first real SVN commit is __r300894__. The ports repository switched from Subversion to Git on April 6, 2021. The last SVN commit is __r569609__ The first real git commit hash is __ed8d3eda309dd863fb66e04bccaa513eee255cbf__.
es: El repositorio de `ports` de FreeBSD cambió de CVS a Subversion el 14 de Julio de 2012. El primer commit real de SVN es __r300894__. El repositorio de ports cambió de Subversion a Git el 6 de Abril de 2021. El último commit de SVN es __r569609__. El hash del primer commit de git es __ed8d3eda309dd863fb66e04bccaa513eee255cbf__.
ru: Репозиторий `ports` FreeBSD перешел с CVS на Subversion 14 июля 2012 года. Первый настоящий коммит SVN — __r300894__. Репозиторий ports перешел с Subversion на Git 6 апреля 2021 года. Последний коммит SVN — __r569609__. Первый настоящий хэш коммита git — __ed8d3eda309dd863fb66e04bccaa513eee255cbf__.

source: Setup, Conventions, and Traditions
es: Configuración, Convenciones y Tradiciones
ru: Настройка, соглашения и традиции

source: There are a number of things to do as a new developer. The first set of steps is specific to committers only. These steps must be done by a mentor for those who are not committers.
es: Hay una serie de cosas que hacer como nuevo desarrollador. La primera serie de pasos es específica solamente para los committers. Estos pasos deben ser realizados por un mentor para aquellos que no son committers.
ru: В качестве нового разработчика необходимо выполнить ряд действий. Первый набор шагов относится исключительно к коммиттерам. Эти шаги должны быть выполнены наставником для тех, кто не является коммиттером.

source: For New Committers
es: Para los Nuevos Committers
ru: Для новых коммиттеров

source: Those who have been given commit rights to the FreeBSD repositories must follow these steps.
es: Aquellos a los que se les han concedido derechos de envío a los repositorios de FreeBSD deben seguir estos pasos.
ru: Те, кому предоставлены права на коммит в репозитории FreeBSD, должны выполнить следующие шаги.

source: Get mentor approval before committing each of these changes!
ru: Получите одобрение наставника перед внесением каждого из этих изменений!

source: All [.filename]#src# commits go to FreeBSD-CURRENT first before being merged to FreeBSD-STABLE. The FreeBSD-STABLE branch must maintain ABI and API compatibility with earlier versions of that branch. Do not merge changes that break this compatibility.
ru: Все коммиты в [.filename]#src# сначала попадают в FreeBSD-CURRENT, прежде чем быть слитыми в FreeBSD-STABLE. Ветка FreeBSD-STABLE должна сохранять совместимость ABI и API с предыдущими версиями этой ветки. Не делайте слияние изменений, нарушающих эту совместимость.

source: *Steps for New Committers*
ru: *Шаги для новых коммиттеров*

source: Add an Author Entity
ru: Добавить автора

source: [.filename]#doc/shared/authors.adoc# - Add an author entity. Later steps depend on this entity, and missing this step will cause the [.filename]#doc/# build to fail. This is a relatively easy task, but remains a good first test of version control skills.
ru: [.filename]#doc/shared/authors.adoc# - Добавить информацию об авторе. Последующие шаги зависят от этой информации, и пропуск этого шага приведёт к сбою сборки [.filename]#doc/#. Это относительно простая задача, но она остаётся хорошим первым испытанием навыков работы с системой контроля версий.

source: Update the List of Developers and Contributors
ru: Обновить список разработчиков и участников

source: [.filename]#doc/shared/contrib-committers.adoc# - Add an entry, which will then appear in the "Developers" section of the extref:{contributors}[Contributors List, staff-committers]. Entries are sorted by last name.
ru: [.filename]#doc/shared/contrib-committers.adoc# - Добавьте запись, которая затем появится в разделе "Разработчики" extref:{contributors}[Списка контрибьюторов, staff-committers]. Записи сортируются по фамилии.

source: [.filename]#doc/shared/contrib-additional.adoc# - _Remove_ the entry. Entries are sorted by first name.
ru: [.filename]#doc/shared/contrib-additional.adoc# - _Удалить_ запись. Записи отсортированы по имени.

source: Add a News Item
ru: Добавить статью в Новости

source: [.filename]#doc/website/data/en/news/news.toml# - Add an entry. Look for the other entries that announce new committers and follow the format. Use the date from the commit bit approval email.
ru: [.filename]#doc/website/data/en/news/news.toml# - Добавьте запись. Найдите другие записи, объявляющие о новых коммиттерах, и следуйте формату. Используйте дату из письма об утверждении коммиттерских прав.

source: Add a PGP Key
ru: Добавить PGP-ключ

source: `{des}` has written a shell script ([.filename]#doc/documentation/tools/addkey.sh#) to make this easier. See the https://cgit.freebsd.org/doc/plain/documentation/static/pgpkeys/README[README] file for more information.
ru: `{des}` написал сценарий оболочки ([.filename]#doc/documentation/tools/addkey.sh#) для упрощения этого процесса. Для получения дополнительной информации обратитесь к файлу https://cgit.freebsd.org/doc/plain/documentation/static/pgpkeys/README[README].

source: Use [.filename]#doc/documentation/tools/checkkey.sh# to verify that keys meet minimal best-practices standards.
ru: Используйте [.filename]#doc/documentation/tools/checkkey.sh# для проверки, что ключи соответствуют как минимум минимальным стандартам лучших практик.

source: After adding and checking a key, add both updated files to source control and then commit them. Entries in this file are sorted by last name.
ru: После добавления и проверки ключа добавьте оба обновленных файла в систему контроля версий и затем зафиксируйте (commit) их. Записи в этом файле отсортированы по фамилии.

source: It is very important to have a current PGP/GnuPG key in the repository. The key may be required for positive identification of a committer. For example, the `{admins}` might need it for account recovery. A complete keyring of `FreeBSD.org` users is available for download from link:https://docs.FreeBSD.org/pgpkeys/pgpkeys.txt[https://docs.FreeBSD.org/pgpkeys/pgpkeys.txt].
ru: Очень важно иметь актуальный PGP/GnuPG ключ в репозитории. Ключ может потребоваться для подтверждения личности коммиттера. Например, `{admins}` используют его для восстановления учетной записи. Полный набор ключей пользователей `FreeBSD.org` доступен для скачивания по ссылке link:https://docs.FreeBSD.org/pgpkeys/pgpkeys.txt[https://docs.FreeBSD.org/pgpkeys/pgpkeys.txt].

source: Update Mentor and Mentee Information
ru: Обновить информацию о наставнике и подопечном

source: [.filename]#src/share/misc/committers-<repository>.dot# - Add an entry to the current committers section, where _repository_ is `doc`, `ports`, or `src`, depending on the commit privileges granted.
ru: [.filename]#src/share/misc/committers-<repository>.dot# - Добавить запись в раздел текущих коммиттеров, где _repository_ - это `doc`, `ports` или `src`, в зависимости от предоставленных прав коммита.

source: Add an entry for each additional mentor/mentee relationship in the bottom section.
ru: Добавьте запись для каждого дополнительного отношения наставник/подопечный в нижнем разделе.

source: Update git mailmap file
ru: Обновить файл mailmap в git

source: [.filename]#src/.mailmap#, [.filename]#doc/.mailmap#, and [.filename]#ports/.mailmap# - Add an entry for commits you created prior to becoming a FreeBSD committer.
ru: [.filename]#src/.mailmap#, [.filename]#doc/.mailmap# и [.filename]#ports/.mailmap# - Добавьте запись для коммитов, созданных вами до получения статуса коммиттера FreeBSD.

source: Mapping to your FreeBSD address allows us to track external committers who may be ready for a commit bit more easily. You can also use this to correct old names, mispelled names, etc in the default `git log` output.
ru: Привязка к вашему адресу FreeBSD позволяет нам проще отслеживать внешних коммиттеров, которые могут быть готовы получить права коммиттера. Вы также можете использовать это для исправления старых имен, опечаток в именах и т.д. в стандартном выводе `git log`.

source: Generate a Kerberos Password
ru: Сгенерировать пароль Kerberos

source: See crossref:committers-guide[kerberos-ldap, Kerberos and LDAP web Password for FreeBSD Cluster] to generate or set a Kerberos account for use with other FreeBSD services like the link:https://bugs.freebsd.org/bugzilla/[bug-tracking database] (you get a bug-tracking account as part of that step).
ru: См. crossref:committers-guide[kerberos-ldap, Kerberos и LDAP веб-пароль для кластера FreeBSD] для генерации или настройки учётной записи Kerberos для использования с другими сервисами FreeBSD, такими как link:https://bugs.freebsd.org/bugzilla/[база данных отслеживания ошибок] (вы получаете учётную запись для отслеживания ошибок как часть этого шага).

source: Optional: Enable Wiki Account
ru: Необязательно: Включить учётную запись Вики

source: link:https://wiki.freebsd.org[FreeBSD Wiki] Account - A wiki account allows sharing projects and ideas. Those who do not yet have an account can follow instructions on the link:https://wiki.freebsd.org/Wiki/About[Wiki/About page] to obtain one. Contact mailto:wiki-admin@FreeBSD.org[wiki-admin@FreeBSD.org] if you need help with your Wiki account.
ru: Учётная запись link:https://wiki.freebsd.org[FreeBSD Wiki] — учётная запись на вики позволяет делиться проектами и идеями. Те, у кого ещё нет учётной записи, могут следовать инструкциям на странице link:https://wiki.freebsd.org/Wiki/About[Wiki/About], чтобы её получить. Свяжитесь с mailto:wiki-admin@FreeBSD.org[wiki-admin@FreeBSD.org], если вам нужна помощь с вашей учётной записью на Вики.

source: Optional: Update Wiki Information
ru: Необязательно: Обновить информацию в Вики

source: Wiki Information - After gaining access to the wiki, some people add entries to the https://wiki.freebsd.org/HowWeGotHere[How We Got Here], https://wiki.freebsd.org/IRC/Nicknames[IRC Nicks], https://wiki.freebsd.org/Community/Dogs[Dogs of FreeBSD], and or https://wiki.freebsd.org/Community/Cats[Cats of FreeBSD] pages.
ru: Информация в вики — получив доступ к вики, некоторые добавляют записи на страницы https://wiki.freebsd.org/HowWeGotHere[Как мы сюда попали], https://wiki.freebsd.org/IRC/Nicknames[IRC-псевдонимы], https://wiki.freebsd.org/Community/Dogs[Собаки FreeBSD] и/или https://wiki.freebsd.org/Community/Cats[Кошки FreeBSD].

source: Optional: Update Ports with Personal Information
ru: Необязательно: Обновить порты с личной информацией

source: [.filename]#ports/astro/xearth/files/freebsd.committers.markers# and [.filename]#src/usr.bin/calendar/calendars/calendar.freebsd# - Some people add entries for themselves to these files to show where they are located or the date of their birthday.
ru: [.filename]#ports/astro/xearth/files/freebsd.committers.markers# и [.filename]#src/usr.bin/calendar/calendars/calendar.freebsd# — Некоторые люди добавляют в эти файлы записи о себе, чтобы указать своё местоположение или дату своего дня рождения.

source: Optional: Prevent Duplicate Mailings
ru: Необязательно: Предотвращение повторных рассылок

source: Subscribers to {dev-commits-doc-all}, {dev-commits-ports-all} or {dev-commits-src-all} might wish to unsubscribe to avoid receiving duplicate copies of commit messages and followups.
ru: Подписчики {dev-commits-doc-all}, {dev-commits-ports-all} или {dev-commits-src-all}, возможно, захотят отписаться, чтобы избежать получения дубликатов сообщений о коммитах и ответов на них.

source: For Everyone
es: Para Todos
ru: Для всех

source: Introduce yourself to the other developers, otherwise no one will have any idea who you are or what you are working on. The introduction need not be a comprehensive biography, just write a paragraph or two about who you are, what you plan to be working on as a developer in FreeBSD, and who will be your mentor. Email this to the {developers-name} and you will be on your way!
ru: Представьтесь другим разработчикам, иначе никто не будет иметь представления, кто вы и над чем работаете. Представление не должно быть исчерпывающей биографией — просто напишите абзац или два о том, кто вы, чем планируете заниматься как разработчик в FreeBSD, и кто будет вашим наставником. Отправьте это по электронной почте на {developers-name}, и вы начнёте свой путь!
