Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/committers-guide/_index.po
Languages: es, ru

source: If you are used to `git pull`, we strongly recommend using the `--ff-only` option, and further setting it as the default option. Alternatively, `git pull --rebase` is useful if you have changes staged in the `main` branch.
es: Si estás acostumbrado a `git pull` recomendamos encarecidamente el uso de la opción `--ff-only` y además establecerla como la opción por defecto. De forma alternativ, `git pull --rebase` es útil si tienes cambios guardados en la rama `main`.
ru: Если вы привыкли к `git pull`, мы настоятельно рекомендуем использовать опцию `--ff-only` и дополнительно установить её в качестве опции по умолчанию. В качестве альтернативы, `git pull --rebase` полезен, если у вас есть изменения, проиндексированные (stage) в ветке `main`.

source: You may need to omit the --global if you want this setting to apply to only this repository.
ru: Возможно, вам потребуется опустить --global, если вы хотите, чтобы эта настройка применялась только к этому репозиторию.

source: There is a common trap, that the combination command `git pull` will try to perform a merge, which would sometimes creates a merge commit that didn't exist before. This can be harder to recover from.
ru: Существует распространённая ловушка: команда `git pull` попытается выполнить слияние, что иногда создаёт коммит слияния, которого ранее не существовало. Восстановление после этого может быть затруднительно.

source: The longer form is also recommended.
ru: Рекомендуется также использовать расширенную форму.

source: These commands reset your tree to the `main` branch, and then update it from where you pulled the tree from originally. It's important to switch to `main` before doing this so it moves forward. Now, it's time to move the changes forward:
ru: Эти команды сбрасывают ваше дерево к ветке `main`, а затем обновляют его из исходного источника, откуда дерево было первоначально получено (pull). Важно переключиться на `main` перед выполнением этого, чтобы обеспечить продвижение вперёд. Теперь пришло время продвинуть изменения вперёд:

source: This will bring up an interactive screen to change the defaults. For now, just exit the editor. Everything should just apply. If not, then you'll need to resolve the diffs. https://docs.github.com/en/free-pro-team@latest/github/using-git/resolving-merge-conflicts-after-a-git-rebase[This github document] can help you navigate this process.
ru: Это вызовет интерактивный экран для изменения настроек по умолчанию. Пока просто выйдите из редактора. Всё должно примениться автоматически. Если нет, то вам потребуется разрешить различия. https://docs.github.com/en/free-pro-team@latest/github/using-git/resolving-merge-conflicts-after-a-git-rebase[Документация GitHub] может помочь вам в этом процессе.

source: Time to push changes upstream
es: Momento de empujar los cambios
ru: Время отправить (push) изменения вверх (upstream)

source: First, ensure that the push URL is properly configured for the upstream repository.
es: Primero, asegúrate de que la URL de push está correctamente configurada para el repositorio remoto.
ru: Сначала убедитесь, что URL для отправки (push) правильно настроен для вышестоящего репозитория.

source: Then, verify that user name and email are configured right. We require that they exactly match the passwd entry in FreeBSD cluster.
ru: Затем убедитесь, что имя пользователя и адрес электронной почты настроены правильно. Требуется, чтобы они точно соответствовали записи passwd в кластере FreeBSD.

source: Use
ru: Используйте

source: on freefall.freebsd.org to get a recipe that you can use directly, assuming /usr/local/bin is in the PATH.
ru: на freefall.freebsd.org (при условии, что /usr/local/bin находится в PATH), чтобы получить готовый шаблон конфигурации, который можно использовать напрямую.

source: The below command merges the `working` branch into the upstream `main` branch. It's important that you curate your changes to be just like you want them in the FreeBSD source repo before doing this. This syntax pushes the `working` branch to `main`, moving the `main` branch forward. You will only be able to do this if this results in a linear change to `main` (e.g. no merges).
ru: Следующая команда делает слияние ветки `working` в основную ветку `main` вышестоящего репозитория. Важно, чтобы вы подготовили свои изменения именно так, как хотите видеть их в исходном репозитории FreeBSD, перед выполнением этой операции. Данный синтаксис отправляет (push) ветку `working` в `main`, перемещая ветку `main` вперед. Вы сможете сделать это только в том случае, если результатом будет линейное изменение для `main` (т.е. без слияний).

source: If your push is rejected due to losing a commit race, rebase your branch before trying again:
ru: Если ваша отправка (push) отклонена из-за проигрыша в гонке коммитов, перебазируйте вашу ветку перед повторной попыткой:

source: Time to push changes upstream (alternative)
es: Momento de empujar los cambios (alternativa)
ru: Время отправить (push) изменения вверх (альтернативный вариант)

source: Some people find it easier to merge their changes to their local `main` before pushing to the remote repository. Also, `git arc stage` moves changes from a branch to the local `main` when you need to do a subset of a branch. The instructions are similar to the prior section:
ru: Некоторым удобнее делать слияние своих изменений в локальную ветку `main` перед отправкой в удалённый репозиторий. Кроме того, `git arc stage` перемещает изменения из ветки в локальную `main`, когда требуется выполнить только часть изменений из ветки. Инструкции схожи с предыдущим разделом:

source: If you lose the race, then try again with
ru: Если вы проиграли гонку, попробуйте снова с

source: These commands will fetch the most recent `freebsd/main` and then rebase the local `main` changes on top of that, which is what you want when you lose the commit race. Note: merging vendor branch commits will not work with this technique.
ru: Эти команды получат (fetch) последние изменения из `freebsd/main`, а затем перебазируют (rebase) локальные изменения `main` поверх них, что и требуется, когда вы проиграли гонку коммитов. Примечание: коммиты слияния ветки вендоров не будет работать с этой техникой.

source: Finding the Subversion Revision
es: Encontrar la Revisión de Subversion
ru: Поиск ревизии Subversion

source: You'll need to make sure that you've fetched the notes (see the crossref:committers-guide[git-mini-daily-use, Daily use]for details). Once you have these, notes will show up in the git log command like so:
ru: Вам нужно убедиться, что вы получили (fetch) примечания (подробности смотрите в разделе crossref:committers-guide[git-mini-daily-use, Ежедневное использование]). Как только вы это сделаете, примечания будут отображаться в команде git log следующим образом:

source: If you have a specific version in mind, you can use this construct:
ru: Если у вас есть конкретная версия, вы можете использовать эту конструкцию:

source: to find the specific revision. The hex number after 'commit' is the hash you can use to refer to this commit.
ru: чтобы найти конкретную ревизию. Шестнадцатеричное число после 'commit' — это хэш, который можно использовать для ссылки на этот коммит.

source: Git FAQ
ru: Часто задаваемые вопросы о Git

source: This section provides a number of targeted answers to questions that are likely to come up often for users and developers.
es: Esta sección proporciona un número de respuestas para usuarios y desarrolladores a preguntas que suelen surgir a menudo.
ru: В этом разделе представлены конкретные ответы на вопросы, которые часто возникают у пользователей и разработчиков.

source: We use the common convention of having the origin for the FreeBSD repository being 'freebsd' rather than the default 'origin' to allow people to use that for their own development and to minimize "whoops" pushes to the wrong repository.
ru: Мы используем общепринятое соглашение, согласно которому источником для репозитория FreeBSD является 'freebsd', а не стандартный 'origin', чтобы позволить людям использовать его для собственной разработки и минимизировать случайные отправки (push) в неправильный репозиторий.

source: Users
es: Usuarios
ru: Пользователи

source: How do I track -current and -stable with only one copy of the repository?
es: Cómo puedo monitorizar -current y -stable con una sola copia del repositorio?
ru: Как отслеживать -current и -stable, имея только одну копию репозитория?

source: **Q:** Although disk space is not a huge issue, it's more efficient to use only one copy of the repository. With SVN mirroring, I could checkout multiple trees from the same repository. How do I do this with Git?
es: **Q:** Aunque el espacio en disco no es un asunto importante, es más eficiente usar sólo una copia del repositorio. Con SVN podía tener varios árboles del mismo repositorio. ¿Cómo hago esto con Git?
ru: **В:** Хотя место на диске не является большой проблемой, эффективнее использовать только одну копию репозитория. При зеркалировании SVN я мог извлекать несколько деревьев из одного и того же репозитория. Как мне сделать это с помощью Git?

source: **A:** You can use Git worktrees. There's a number of ways to do this, but the simplest way is to use a clone to track -current, and a worktree to track stable releases. While using a 'bare repository' has been put forward as a way to cope, it's more complicated and will not be documented here.
es: **A:** Puedes usar worktrees. Hay varias formas de hacer esto, pero la más sencilla es utilizar un clone para monitorizar -current, y un worktree para hacer lo mismo con las releases stables. Aunque usar un 'repositorio desnudo' se ha propuesto como una forma de lidiar con esto, es más complicado y no se documentará aquí.
ru: **О:** Вы можете использовать рабочие деревья Git. Существует несколько способов сделать это, но самый простой — использовать клон для отслеживания -current и рабочее дерево для отслеживания стабильных выпусков. Хотя использование «голого (bare) репозитория» предлагалось как способ справиться с этим, это более сложно и здесь документироваться не будет.

source: First, you need to clone the FreeBSD repository, shown here cloning into `freebsd-current` to reduce confusion. $URL is whatever mirror works best for you:
ru: Сначала необходимо клонировать репозиторий FreeBSD, здесь показано клонирование в `freebsd-current` для избежания путаницы. `$URL` — это любой зеркальный сервер, который работает для вас наилучшим образом:

source: then once that's cloned, you can simply create a worktree from it:
ru: после того, как он будет клонирован, вы можете просто создать рабочее дерево из него:

source: this will checkout `stable/12` into a directory named `freebsd-stable-12` that's a peer to the `freebsd-current` directory. Once created, it's updated very similarly to how you might expect:
ru: это извлечёт `stable/12` в каталог с именем `freebsd-stable-12`, который находится на одном уровне с каталогом `freebsd-current`. После создания он обновляется очень похожим образом, как вы могли бы ожидать:

source: I recommend using `--ff-only` because it's safer and you avoid accidentally getting into a 'merge nightmare' where you have an extra change in your tree, forcing a complicated merge rather than a simple one.
ru: Я рекомендую использовать `--ff-only`, так как это безопаснее и позволяет избежать случайного попадания в 'кошмар слияния', когда в вашем дереве появляются дополнительные изменения, вынуждающие выполнять сложное слияние вместо простого.

source: Here's https://adventurist.me/posts/00296[a good writeup] that goes into more detail.
ru: Вот https://adventurist.me/posts/00296[хорошая статья], в которой рассматривается этот вопрос более подробно.

source: Developers
es: Desarrolladores
ru: Разработчики

source: Ooops! I committed to `main`, instead of another branch.
es: ¡Ooops! He hecho commit en `main` en lugar de en otra rama.
ru: Ой! Я закоммитил в `main` вместо другой ветки.

source: **Q:** From time to time, I goof up and mistakenly commit to the `main` branch. What do I do?
es: **Q:** De vez en cuando meto la pata y hago un commit en `main` en lugar de una rama. ¿Qué hago?
ru: **В:** Время от времени я ошибаюсь и по ошибке делаю коммит в ветку `main`. Что мне делать?

source: **A:** First, don't panic.
es: **A:** Primero, que no te entre el pánico.
ru: **О:** Во-первых, не паникуйте.

source: Second, don't push. In fact, you can fix almost anything if you haven't pushed. All the answers in this section assume no push has happened.
ru: Во-вторых, не отправляйте (push) изменения. На самом деле, можно исправить почти всё, если изменения не были отправлены. Все ответы в этом разделе предполагают, что отправки не произошло.

source: The following answer assumes you committed to `main` and want to create a branch called `issue`:
ru: Следующий ответ предполагает, что вы закоммитили в `main` и хотите создать ветку с названием `issue`:

source: Ooops! I committed something to the wrong branch!
es: ¡Ooops! ¡He hecho commit de algo en la rama equivocada!
ru: Ой! Я закоммитил что-то не в ту ветку!

source: **Q:** I was working on feature on the `wilma` branch, but accidentally committed a change relevant to the `fred` branch in 'wilma'. What do I do?
es: **Q:** Estaba trabajando en una característica en la rama `wilma`, pero accidentalmente he hecho commit de un cambio relacionado con la rama `fred` en la rama `wilma`. ¿Qué hago?
ru: **В:** Я работал над функцией в ветке `wilma`, но случайно сделал коммит изменению, относящемуся к ветке `fred`, в 'wilma'. Что мне делать?

source: **A:** The answer is similar to the previous one, but with cherry picking. This assumes there's only one commit on wilma, but will generalize to more complicated situations. It also assumes that it's the last commit on wilma (hence using wilma in the `git cherry-pick` command), but that too can be generalized.
es: **A:** La respuesta es similar a la anterior pero escogiendo cambios (cherry picking). Se asume que sólo hay un commit en wilma, pero lo generalizaremos a situaciones más complicadas. También se asume que es el último commit en wilma (por lo tanto se usa wilma en el comando `git cherry-pick`), pero también se puede generalizar.
ru: **О:** Ответ аналогичен предыдущему, но с использованием выборочного применением коммитов (cherry-pick). Предполагается, что в ветке wilma имеется всего один коммит, однако подход можно обобщить и для более сложных ситуаций. Также предполагается, что это последний коммит в ветке wilma (отсюда использование wilma в команде `git cherry-pick`), но и это можно обобщить.

source: If it is not the last commit, you can cherry-pick that one change from wilma onto fred, then use `git rebase -i` to remove the change from wilma.
ru: Если это не последний коммит, вы можете выборочно применить (cherry-pick) это одно изменение из wilma к fred, затем использовать `git rebase -i`, чтобы удалить изменение из wilma.

source: # We're on branch wilma % git checkout fred # move to fred branch % git cherry-pick HASH_OF_CHANGE # copy the misplaced commit % git rebase -i main wilma # drop the cherry-picked change
ru: # Мы находимся на ветке wilma % git checkout fred # перейти на ветку fred % git cherry-pick HASH_OF_CHANGE # скопировать ошибочно размещённый коммит % git rebase -i main wilma # удалить скопированное изменение

source: **Q:** But what if I want to commit a few changes to `main`, but keep the rest in `wilma` for some reason?
es: **Q:** Pero ¿Y si quiero hacer commit de unos cuantos cambios a `main`, pero dejar el resto en `wilma` por algún motivo?
ru: **В:** Но что, если я хочу сделать коммит нескольким изменениям в `main`, но оставить остальные в `wilma` по какой-то причине?

source: **A:** The same technique above also works if you are wanting to 'land' parts of the branch you are working on into `main` before the rest of the branch is ready (say you noticed an unrelated typo, or fixed an incidental bug). You can cherry pick those changes into `main`, then push to the parent repository. Once you've done that, cleanup couldn't be simpler: just `git rebase -i`. Git will notice you've done this and skip the common changes automatically (even if you had to change the commit message or tweak the commit slightly). There's no need to switch back to wilma to adjust it: just rebase!
es: **A:** La misma técnica de arriba funciona si quieres llevar partes de la rama en la que estás trabajando a `main` antes de que el resto de la rama está listo (digamos que has visto un error ortográfico no relacionado, o has arreglado un bug puntual). Puedes usar seleccionar esos cambios y llevarlos a `main`, luego empuja al repositorio padre. Una vez hecho esto, limpiar no podría ser más fácil: simplemente `git rebase -i`. Git se dará cuenta de que has hecho esto y omitirá los cambios comunes automáticamente (incluso si tienes que cambiar el mensaje de commit o modificar el commit ligeramente). No hay necesidad de cambiar de nuevo a wilma para ajustarlo: ¡simplemente rebásalo!
ru: **О:** Тот же метод, описанный выше, также работает, если вы хотите «приземлить» части ветки, над которой работаете, в `main` до того, как вся ветка будет готова (скажем, вы заметили несвязанную опечатку или исправили случайную ошибку). Вы можете выборочно применить (cherry-pick) эти изменения в `main`, а затем отправить их в родительский репозиторий. После того, как вы это сделаете, очистка не может быть проще: просто выполните `git rebase -i`. Git заметит, что вы это сделали, и автоматически пропустит общие изменения (даже если вам пришлось изменить сообщение коммита или слегка подкорректировать коммит). Нет необходимости переключаться обратно на wilma, чтобы её поправить: просто делайте rebase!

source: **Q:** I want to split off some changes from branch `wilma` into branch `fred`
es: **Q:** Quiero separar algunos cambios de la rama `wilma` y llevarlos a una rama `fred`
ru: **В:** Я хочу выделить некоторые изменения из ветки `wilma` в ветку `fred`

source: **A:** The more general answer would be the same as the previous. You'd checkout/create the `fred` branch, cherry pick the changes you want from `wilma` one at a time, then rebase `wilma` to remove those changes you cherry picked. `git rebase -i main wilma` will toss you into an editor, and remove the `pick` lines that correspond to the commits you copied to `fred`. If all goes well, and there are no conflicts, you're done. If not, you'll need to resolve the conflicts as you go.
es: **A:** La respuesta más general sería la misma que previamente. Crearías la rama `fred`, escogerías los cambios que quieres de `wilma` uno a uno, luego rebasa `wilma` para eliminar esos cambios que has seleccionado. `git rebase -i main wilma` te llevará a un editor, luego elimina las líneas `pick` que se corresponden con los cambios que has llevado a `fred`. Si todo va bien y no hay conflictos, has terminado. Si no, necesitarás resolver los conflictos sobre la marcha.
ru: **О:** Более общий ответ будет таким же, как и предыдущий. Вы должны выгрузить(checkout)/создать ветку `fred`, выборочно применить (cherry-pick) нужные изменения из ветки `wilma` по одному, а затем перебазировать (rebase) `wilma`, чтобы удалить те изменения, которые вы выборочно применили. `git rebase -i main wilma` перенесёт вас в редактор, где нужно удалить строки `pick`, соответствующие коммитам, которые вы скопировали в `fred`. Если всё пройдёт хорошо и не будет конфликтов, вы закончили. Если нет, вам нужно будет разрешать конфликты по мере их появления.

source: The other way to do this would be to checkout `wilma` and then create the branch `fred` to point to the same point in the tree. You can then `git rebase -i` both these branches, selecting the changes you want in `fred` or `wilma` by retaining the pick likes, and deleting the rest from the editor. Some people would create a tag/branch called `pre-split` before starting in case something goes wrong in the split. You can undo it with the following sequence:
ru: Другой способ сделать это — выгрузить `wilma`, а затем создать ветку `fred`, указывающую на ту же точку в дереве. Затем вы можете выполнить `git rebase -i` для обеих этих веток, выбирая изменения, которые вы хотите видеть в `fred` или `wilma`, оставляя строки с `pick` и удаляя остальные в редакторе. Некоторые предпочитают создать тег/ветку с названием `pre-split` перед началом, на случай если что-то пойдет не так при разделении. Вы можете отменить это следующей последовательностью:

source: The last step is optional. If you are going to try again to split, you'd omit it.
ru: Последний шаг необязателен. Если вы собираетесь повторить попытку разделения, его можно пропустить.

source: **Q:** But I did things as I read along and didn't see your advice at the end to create a branch, and now `fred` and `wilma` are all screwed up. How do I find what `wilma` was before I started. I don't know how many times I moved things around.
es: **Q:** Pero lo he hecho todo como he leído que se hacía y no he visto tu consejo al final para crear una rama y ahora `fred` y `wilma` están hechas un lío. ¿Cómo sé cuál era el estado de `wilma` antes de que empezara? No sé cuántas veces he movido las cosas de sitio.
ru: **В:** Но я делал всё по мере прочтения и не увидел ваш совет в конце создать ветку, и теперь `fred` и `wilma` полностью испорчены. Как мне найти, чем `wilma` была до того, как я начал. Я не знаю, сколько раз я всё переставлял.

source: **A:** All is not lost. You can figure out it, so long as it hasn't been too long, or too many commits (hundreds).
es: **A:** No todo está perdido. Puedes averiguarlo, siempre que no haya pasado mucho tiempo o haya habido muchos commits (cientos).
ru: **О:** Не всё потеряно. Вы можете разобраться с этим, если прошло не слишком много времени или не было сделано слишком много коммитов (сотни).

source: So I created a wilma branch and committed a couple of things to it, then decided I wanted to split it into fred and wilma. Nothing weird happened when I did that, but let's say it did. The way to look at what you've done is with the `git reflog`:
ru: Итак, я создал ветку wilma и закоммитил в неё пару изменений, затем решил разделить её на fred и wilma. Ничего странного при этом не произошло, но предположим, что произошло. Способ посмотреть, что вы сделали, — это использовать `git reflog`:

source: Here we see the changes I've made. You can use it to figure out where things went wrong. I'll just point out a few things here. The first one is that HEAD@{X} is a 'commitish' thing, so you can use that as an argument to a command. Although if that command commits anything to the repository, the X numbers change. You can also use the hash (first column).
ru: Здесь мы видим изменения, которые я внес. Вы можете использовать это, чтобы понять, где что-то пошло не так. Я лишь укажу на несколько моментов. Первый из них — HEAD@{X} является 'коммитоподобной' сущностью, поэтому вы можете использовать это в качестве аргумента команды. Хотя если эта команда вносит что-либо в репозиторий, номера X изменяются. Вы также можете использовать хэш (первый столбец).
