Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/committers-guide/_index.po
Languages: es, ru

source: Introductory information for FreeBSD committers
es: Información de introducción para los committers de FreeBSD
ru: Вводная информация для коммиттеров FreeBSD

source: Committer's Guide
es: Guía para los Committers
ru: Руководство коммиттера

source: Abstract
es: Resumen
ru: Аннотация

source: This document provides information for the FreeBSD committer community. All new committers should read this document before they start, and existing committers are strongly encouraged to review it from time to time.
es: Este documento proporciona información para la comunidad de committers de FreeBSD. Todos los committers nuevos deben leer este documento antes de empezar, y se recomienda encarecidamente a los committers actuales que lo revisen de vez en cuando.
ru: В этом документе представлена информация для сообщества коммиттеров FreeBSD. Все новые коммиттеры должны прочитать этот документ перед началом работы, а существующим коммиттерам настоятельно рекомендуется периодически его пересматривать.

source: Almost all FreeBSD developers have commit rights to one or more repositories. However, a few developers do not, and some of the information here applies to them as well. (For instance, some people only have rights to work with the Problem Report database.) Please see crossref:committers-guide[non-committers, Issues Specific to Developers Who Are Not Committers] for more information.
ru: Почти все разработчики FreeBSD имеют права на коммит в один или несколько репозиториев. Однако некоторые разработчики не имеют таких прав, и часть информации здесь применима и к ним. (Например, некоторые люди имеют права только для работы с базой данных отчетов о проблемах.) Дополнительную информацию можно найти в crossref:committers-guide[non-committers, Вопросы, специфичные для разработчиков без прав на коммит].

source: This document may also be of interest to members of the FreeBSD community who want to learn more about how the project works.
es: Este documento también puede ser de interés para los miembros de la comunidad de FreeBSD que quieran saber más sobre el funcionamiento del proyecto.
ru: Этот документ также может быть интересен участникам сообщества FreeBSD, которые хотят узнать больше о том, как работает проект.

source: Administrative Details
es: Detalles administrativos
ru: Административные детали

source: _Login Methods_
es: _Métodos de inicio de sesión_
ru: _Способ логина_

source: man:ssh[1], protocol 2 only
es: man:ssh[1], sólo protocolo 2
ru: man:ssh[1], только протокол версии 2

source: _Main Shell Host_
es: _Host Shell Principal_
ru: _Главный хост для входа в оболочку_

source: _Reference Machines_
es: _Máquinas de Referencia_
ru: _Референсные машины_

source: `ref*.FreeBSD.org`, `universe*.freeBSD.org` (see also link:https://www.FreeBSD.org/internal/machines/[FreeBSD Project Hosts])
es: `ref*.FreeBSD.org`, `universe*.freeBSD.org` (consulta también link:https://www.FreeBSD.org/internal/machines/[Máquinas del Proyecto FreeBSD])
ru: `ref*.FreeBSD.org`, `universe*.freeBSD.org` (см. также ссылку link:https://www.FreeBSD.org/internal/machines/[Хосты проекта FreeBSD])

source: _SMTP Host_
ru: _Узел SMTP_

source: `smtp.FreeBSD.org:587` (see also crossref:committers-guide[smtp-setup, SMTP Access Setup]).
ru: `smtp.FreeBSD.org:587` (см. также crossref:committers-guide[smtp-setup, Настройка доступа SMTP]).

source: `_src/_` Git Repository
es: `_src/_` Repositorio Git
ru: `_src/_` Git-репозиторий

source: `_doc/_` Git Repository
es: `_doc/_` Repositorio Git
ru: `_doc/_` Git-репозиторий

source: `_ports/_` Git Repository
es: `_ports/_` Repositorio Git
ru: `_ports/_` Git-репозиторий

source: _Internal Mailing Lists_
es: _Listas de Correo Internas_
ru: _Внутренние списки рассылки_

source: developers (technically called all-developers), doc-developers, doc-committers, ports-developers, ports-committers, src-developers, src-committers. (Each project repository has its own -developers and -committers mailing lists. Archives for these lists can be found in the files [.filename]#/local/mail/repository-name-developers-archive# and [.filename]#/local/mail/repository-name-committers-archive# on `freefall.FreeBSD.org`.)
es: developers (técnicamente llamada all-developers) doc-developers, doc-committers, ports-developers, ports-committers, src-developers, src-committers. (Cada repositorio del proyecto tiene su propia lista de correo terminada en -developers y -committers. Se pueden encontrar archivos para estas listas en los ficheros [.filename]#/local/mail/repository-name-developers-archive# y [.filename]#/local/mail/repository-name-committers-archive# en `freefall.FreeBSD.org`.)
ru: developers (технически называемый all-developers), doc-developers, doc-committers, ports-developers, ports-committers, src-developers, src-committers. (Каждый репозиторий проекта имеет свои собственные списки рассылки -developers и -committers. Архивы этих списков можно найти в файлах [.filename]#/local/mail/repository-name-developers-archive# и [.filename]#/local/mail/repository-name-committers-archive# на `freefall.FreeBSD.org`.)

source: _Core Team monthly reports_
es: _Informes mensuales del Core Team_
ru: _Ежемесячные отчеты основной команды (Core Team)_

source: [.filename]#/home/core/public/reports# on the `FreeBSD.org` cluster.
es: [.filename]#/home/core/public/reports# en el clúster `FreeBSD.org`.
ru: [.filename]#/home/core/public/reports# на кластере `FreeBSD.org`.

source: _Ports Management Team monthly reports_
es: _Informes mensuales del Ports Management Team_
ru: _Ежемесячные отчеты команды управления портами_

source: [.filename]#/home/portmgr/public/monthly-reports# on the `FreeBSD.org` cluster.
es: [.filename]#/home/portmgr/public/monthly-reports# en el clúster `FreeBSD.org`.
ru: [.filename]#/home/portmgr/public/monthly-reports# в кластере `FreeBSD.org`.

source: _Noteworthy `src/` Git Branches:_
es: _Notablemente Ramas de Git de `src/`:_
ru: _Важные ветки Git в `src/`:_

source: man:ssh[1] is required to connect to the project hosts. For more information, see crossref:committers-guide[ssh.guide, SSH Quick-Start Guide].
ru: Для подключения к хостам проекта требуется man:ssh[1]. Дополнительную информацию можно найти в crossref:committers-guide[ssh.guide, Руководстве по быстрому началу работы с SSH].

source: Useful links:
es: Enlaces de interés:
ru: Полезные ссылки:

source: link:https://www.FreeBSD.org/internal/[FreeBSD Project Internal Pages]
es: link:https://www.FreeBSD.org/internal/[Páginas Internas del Proyecto FreeBSD]
ru: link:https://www.FreeBSD.org/internal/[Внутренние страницы проекта FreeBSD]

source: link:https://www.FreeBSD.org/internal/machines/[FreeBSD Project Hosts]
es: link:https://www.FreeBSD.org/internal/machines/[Servidores del Proyecto FreeBSD]
ru: link:https://www.FreeBSD.org/internal/machines/[Узлы проекта FreeBSD]

source: link:https://www.FreeBSD.org/administration/[FreeBSD Project Administrative Groups]
es: link:https://www.FreeBSD.org/administration/[Grupos Administrativos del Proyecto FreeBSD]
ru: link:https://www.FreeBSD.org/administration/[Административные группы проекта FreeBSD]

source: OpenPGP Keys for FreeBSD
es: Claves OpenPGP de FreeBSD
ru: Ключи OpenPGP для FreeBSD

source: Cryptographic keys conforming to the OpenPGP (__Pretty Good Privacy__) standard are used by the FreeBSD project to authenticate committers. Messages carrying important information like public SSH keys can be signed with the OpenPGP key to prove that they are really from the committer. See https://nostarch.com/releases/pgp_release.pdf[PGP & GPG: Email for the Practical Paranoid by Michael Lucas] and https://en.wikipedia.org/wiki/Pretty_Good_Privacy[] for more information.
ru: Криптографические ключи, соответствующие стандарту OpenPGP (__Pretty Good Privacy__), используются проектом FreeBSD для аутентификации коммиттеров. Сообщения, содержащие важную информацию, такие как публичные SSH-ключи, могут быть подписаны с помощью OpenPGP-ключа, чтобы доказать, что они действительно отправлены коммиттером. Дополнительную информацию можно найти в https://nostarch.com/releases/pgp_release.pdf[PGP & GPG: Email for the Practical Paranoid от Michael Lucas] и https://en.wikipedia.org/wiki/Pretty_Good_Privacy[].

source: Creating a Key
es: Creando una clave
ru: Создание ключа

source: Existing keys can be used, but should be checked with [.filename]#documentation/tools/checkkey.sh# first. In this case, make sure the key has a FreeBSD user ID.
es: Se pueden utilizar claves ya existentes, pero primero deberían ser comprobadas primero con [.filename]#documentation/tools/checkkey.sh#. En este caso, comprueba que la clave tiene un identificador de usuario de FreeBSD.
ru: Существующие ключи можно использовать, но сначала их следует проверить с помощью [.filename]#documentation/tools/checkkey.sh#. В этом случае убедитесь, что у ключа есть FreeBSD user ID.

source: For those who do not yet have an OpenPGP key, or need a new key to meet FreeBSD security requirements, here we show how to generate one.
es: Para aquellos que todavía no tengan una clave OpenPGP, o necesiten una nueva para reunir los requerimientos de seguridad de FreeBSD, se mostrará a continuación como generarla.
ru: Для тех, у кого ещё нет ключа OpenPGP или требуется новый ключ, соответствующий требованиям безопасности FreeBSD, здесь показано, как его сгенерировать.

source: Install [.filename]#security/gnupg#. Enter these lines in [.filename]#~/.gnupg/gpg.conf# to set minimum acceptable defaults for signing and new key preferences (see the link:https://www.gnupg.org/documentation/manuals/gnupg/GPG-Options.html[GnuPG options documentation] for more details):
ru: Установите [.filename]#security/gnupg#. Добавьте следующие строки в [.filename]#~/.gnupg/gpg.conf#, чтобы задать минимально приемлемые настройки для подписи и предпочтений новых ключей (подробнее см. в link:https://www.gnupg.org/documentation/manuals/gnupg/GPG-Options.html[документации по опциям GnuPG]):

source: Generate a key:
es: Genera una clave:
ru: Сгенерировать ключ:

source: 2048-bit keys with a three-year expiration provide adequate protection at present (2022-10).
es: Claves de 2048 bits con una expiración de tres años proporcionan una protección adecuada actualmente (202-10).
ru: 2048-битные ключи с трехлетним сроком действия обеспечивают достаточную защиту на данный момент (2022-10).

source: A three year key lifespan is short enough to obsolete keys weakened by advancing computer power, but long enough to reduce key management problems.
es: Tres años de vida útil para una clave hacen que sea lo suficientemente corta como para hacer que quede obsoleta por el avance de la potencia de los ordenadores, pero lo suficientemente larga como para reducir los problemas de administración de claves.
ru: Срок действия ключа в три года достаточно мал, чтобы устаревшие ключи, ослабленные растущей мощностью компьютеров, перестали использоваться, но достаточно велик, чтобы уменьшить проблемы управления ключами.

source: Use your real name here, preferably matching that shown on government-issued ID to make it easier for others to verify your identity. Text that may help others identify you can be entered in the `Comment` section.
es: Utiliza tu nombre real aquí, preferiblemente coincidente con el nombre de tu documento de identificación oficial para ayudar a otros a verificar tu identidad. En la sección `Comment` se puede introducir texto que ayude a otros a identificarte.
ru: Используйте здесь своё настоящее имя, предпочтительно совпадающее с указанным в удостоверении личности, выданном государством, чтобы другим было проще подтвердить вашу личность. Текст, который может помочь другим идентифицировать вас, можно ввести в раздел `Комментарий`.

source: After the email address is entered, a passphrase is requested. Methods of creating a secure passphrase are contentious. Rather than suggest a single way, here are some links to sites that describe various methods: https://world.std.com/~reinhold/diceware.html[], https://www.iusmentis.com/security/passphrasefaq/[], https://xkcd.com/936/[], https://en.wikipedia.org/wiki/Passphrase[].
es: Después de introducir la dirección de correo electrónico, se solicita una contraseña. Los métodos para crear una contraseña segura son bastante polémicos. En lugar de sugerir una única forma, aquí hay algunos enlaces a sitios que describen varios métodos: https://world.std.com/~reinhold/diceware.html[], https://www.iusmentis.com/security/passphrasefaq/[], https://xkcd.com/936/[], https://en.wikipedia.org/wiki/Passphrase[].
ru: После ввода адреса электронной почты запрашивается парольная фраза. Методы создания безопасной парольной фразы вызывают споры. Вместо того чтобы предлагать один способ, вот несколько ссылок на сайты, описывающие различные методы: https://world.std.com/~reinhold/diceware.html[], https://www.iusmentis.com/security/passphrasefaq/[], https://xkcd.com/936/[], https://en.wikipedia.org/wiki/Passphrase[].

source: Protect the private key and passphrase. If either the private key or passphrase may have been compromised or disclosed, immediately notify mailto:accounts@FreeBSD.org[accounts@FreeBSD.org] and revoke the key.
es: Protege la clave privada y la contraseña. Si la clave privada o la contraseña fueran comprometidas o reveladas, notifícalo de forma inmediata a mailto:accounts@FreeBSD.org[accounts@FreeBSD.org] y revoca la clave.
ru: Защитите закрытый ключ и парольную фразу. Если закрытый ключ или парольная фраза могли быть скомпрометированы или раскрыты, немедленно уведомите mailto:accounts@FreeBSD.org[accounts@FreeBSD.org] и отзовите ключ.

source: Committing the new key is shown in crossref:committers-guide[commit-steps, Steps for New Committers].
ru: Фиксация нового ключа показана в crossref:committers-guide[commit-steps, Шаги для новых коммиттеров].

source: Kerberos and LDAP web Password for FreeBSD Cluster
es: Kerberos y contraseña web LDAP para el clúster de FreeBSD
ru: Kerberos и LDAP веб-пароль для кластера FreeBSD

source: The FreeBSD cluster requires a Kerberos password to access certain services. The Kerberos password also serves as the LDAP web password, since LDAP is proxying to Kerberos in the cluster. Some of the services which require this include:
es: El clúster de FreeBSD requiere una contraseña de Kerberos para acceder a ciertos servicios. La contraseña de Kerberos también sirve como contraseña web LDAP, ya que LDAP hace de proxy a Kerberos en el clúster. Algunos de los servicios que requieren esto incluyen:
ru: Кластер FreeBSD требует пароль Kerberos для доступа к определенным сервисам. Пароль Kerberos также служит веб-паролем LDAP, поскольку LDAP проксирует запросы к Kerberos в кластере. Некоторые из сервисов, требующих его, включают:

source: To create a new Kerberos account in the FreeBSD cluster, or to reset a Kerberos password for an existing account using a random password generator:
es: Para crear una nueva cuenta de Kerberos en el clúster de FreeBSD, o para restablecer una contraseña de Kerberos para una cuenta existente utilizando un generador de contraseñas aleatorias:
ru: Для создания новой учетной записи Kerberos в кластере FreeBSD или сброса пароля Kerberos для существующей учетной записи с использованием генератора случайных паролей:

source: This must be done from a machine outside of the FreeBSD.org cluster.
es: Esto debe hacerse desde una máquina fuera del clúster de FreeBSD.org.
ru: Это должно быть выполнено с компьютера за пределами кластера FreeBSD.org.

source: A Kerberos password can also be set manually by logging into `freefall.FreeBSD.org` and running:
es: Una contraseña de Kerberos también puede ser establecida manualmente iniciando sesión en `freefall.FreeBSD.org` y ejecutando:
ru: Пароль Kerberos также можно установить вручную, войдя в `freefall.FreeBSD.org` и выполнив:

source: Unless the Kerberos-authenticated services of the FreeBSD.org cluster have been used previously, `Client unknown` will be shown. This error means that the `ssh kpasswd.freebsd.org` method shown above must be used first to initialize the Kerberos account.
es: A menos que los servicios autentificados con Kerberos del clúster de FreeBSD.org hayan sido usados previamente, se mostrará `Client unknown`. Este error significa que el método de `ssh kpasswd.freebsd.org` mostrado previamente tendrá que ser usado para inicializar la cuenta de Kerberos.
ru: Если ранее не использовались аутентифицированные через Kerberos службы кластера FreeBSD.org, будет отображено сообщение `Client unknown`. Эта ошибка означает, что сначала необходимо использовать метод `ssh kpasswd.freebsd.org`, показанный выше, для инициализации учётной записи Kerberos.

source: Commit Bit Types
es: Tipos de Commit Bits
ru: Типы битов коммита (прав на коммит)

source: The FreeBSD repository has a number of components which, when combined, support the basic operating system source, documentation, third party application ports infrastructure, and various maintained utilities. When FreeBSD commit bits are allocated, the areas of the tree where the bit may be used are specified. Generally, the areas associated with a bit reflect who authorized the allocation of the commit bit. Additional areas of authority may be added at a later date: when this occurs, the committer should follow normal commit bit allocation procedures for that area of the tree, seeking approval from the appropriate entity and possibly getting a mentor for that area for some period of time.
es: El repositorio de FreeBSD tiene una serie de componentes que, cuando se combinan, integran el código fuente del sistema base del sistema operativo, la documentación, la infraestructura de ports de las aplicaciones de terceros y varias utilidades mantenidas. Cuando se asignan los commit bits, se especifican las áreas del árbol donde se tiene permiso. Generalmente, las áreas asociadas con un commit bit reflejan quién autorizó la asignación del commit bit. Se pueden agregar más áreas de autoridad posteriormente: cuando esto ocurre, el committer debe seguir los procedimientos normales de asignación de commit bit para esa área del árbol, buscar la aprobación de la entidad apropiada y posiblemente obtener un mentor para esa área durante un cierto periodo de tiempo.
ru: Репозиторий FreeBSD содержит ряд компонентов, которые в совокупности поддерживают исходный код базовой операционной системы, документацию, инфраструктуру портов сторонних приложений и различные поддерживаемые утилиты. При выделении прав на коммит (commit bits) в FreeBSD указываются области дерева, где эти права могут быть использованы. Как правило, области, связанные с правами, отражают, кто авторизовал их выделение. Дополнительные области полномочий могут быть добавлены позже: в этом случае коммиттер должен следовать стандартной процедуре выделения прав на коммит для соответствующей области дерева, получив одобрение от соответствующей инстанции и, возможно, наставника для этой области на некоторый период времени.

source: __Committer Type__
es: Tipos de Commiters
ru: __Тип коммиттера__

source: __Responsible__
es: __Responsable__
ru: __Ответственный__

source: __Tree Components__
es: __Componentes del Árbol__
ru: __Компоненты дерева исходного кода__

source: doc/, ports/, src/ documentation
es: doc/, ports/, src/ documentación
ru: документация doc/, ports/, src/

source: Commit bits allocated prior to the development of the notion of areas of authority may be appropriate for use in many parts of the tree. However, common sense dictates that a committer who has not previously worked in an area of the tree seek review prior to committing, seek approval from the appropriate responsible party, and/or work with a mentor. Since the rules regarding code maintenance differ by area of the tree, this is as much for the benefit of the committer working in an area of less familiarity as it is for others working on the tree.
es: Los commit bits asignados antes de que se desarrollara la idea de áreas de autoridad, pueden ser apropiados para su uso en muchas partes del árbol. Sin embargo, el sentido común dicta que un committer que no haya trabajado previamente en esa área del árbol busque una revisión antes de realizar el commit, busque la aprobación del equipo responsable, y/o trabaje con un mentor. Dado que las reglas con respecto al mantenimiento del código difieren según el área del árbol, esto beneficiará tanto a quién trabaja en un área del árbol con la que no está muy familiarizado como a quienes trabajan en el árbol.
ru: Биты коммитов, выделенные до разработки концепции областей ответственности, могут быть подходящими для использования во многих частях дерева. Однако здравый смысл подсказывает, что коммиттер, ранее не работавший в определённой области дерева, должен перед коммитом получить рецензирование (review), согласование от соответствующего ответственного лица и/или работать с наставником. Поскольку правила поддержки кода различаются в зависимости от области дерева, это важно как для самого коммиттера, работающего в менее знакомой области, так и для других участников, работающих с деревом.

source: Committers are encouraged to seek review for their work as part of the normal development process, regardless of the area of the tree where the work is occurring.
es: Se anima a los committers a buscar la revisión de su trabajo como parte del proceso natural del desarrollo, independientemente del área del árbol en la cual se esté realizando el trabajo.
ru: Коммиттерам рекомендуется запрашивать рецензирование своей работы в рамках обычного процесса разработки, независимо от области дерева, в которой происходит работа.

source: Policy for Committer Activity in Other Trees
es: Política para la actividad de los Committers en otros árboles
ru: Политика активности коммиттеров в других деревьях

source: All committers may modify [.filename]#src/share/misc/committers-*.dot#, [.filename]#src/usr.bin/calendar/calendars/calendar.freebsd#, and [.filename]#ports/astro/xearth/files#.
es: Todos los committers pueden modificar [.filename]#src/share/misc/committers-*.dot#, [.filename]#src/usr.bin/calendar/calendars/calendar.freebsd#, y [.filename]#ports/astro/xearth/files#.
ru: Все коммиттеры могут изменять файлы [.filename]#src/share/misc/committers-*.dot#, [.filename]#src/usr.bin/calendar/calendars/calendar.freebsd# и [.filename]#ports/astro/xearth/files#.

source: doc committers may commit documentation changes to [.filename]#src# files, such as manual pages, READMEs, fortune databases, calendar files, and comment fixes without approval from a src committer, subject to the normal care and tending of commits.
es: Los committers de documentación pueden realizar commits en la documentación de [.filename]#src#, como las páginas del manual, READMEs, bases de datos de fortune, archivos de calendario y correcciones de comentarios sin la aprobación de un src committer, teniendo en cuenta las normas requeridas para la correcta realización de los commits.
ru: Документационные коммиттеры могут вносить изменения в документацию в файлы [.filename]#src#, такие как руководства, README, базы данных fortune, календарные файлы и исправления комментариев, без одобрения коммиттера src, при условии соблюдения обычных правил и внимания к коммитам.
