Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/committers-guide/_index.po
Languages: es, ru

source: Log into `freefall.FreeBSD.org` and create a [.filename]#/var/forward/user# (where _user_ is your username) file containing the e-mail address where you want mail addressed to _yourusername_@FreeBSD.org to be forwarded. This includes all of the commit messages as well as any other mail addressed to the {committers-name} and the {developers-name}. Really large mailboxes which have taken up permanent residence on `freefall` may get truncated without warning if space needs to be freed, so forward it or save it elsewhere.
ru: Войдите на `freefall.FreeBSD.org` и создайте файл [.filename]#/var/forward/пользователь# (где _пользователь_ — это ваше имя пользователя), содержащий адрес электронной почты, на который должны перенаправляться письма, адресованные на _вашеимяпользователя_@FreeBSD.org. Это включает все сообщения о коммитах, а также любую другую почту, адресованную {committers-name} и {developers-name}. Очень большие почтовые ящики, которые заняли постоянное место на `freefall`, могут быть усечены без предупреждения, если потребуется освободить место, поэтому перенаправляйте или сохраняйте их в другом месте.

source: If your e-mail system uses SPF with strict rules, you should exclude `mx2.FreeBSD.org` from SPF checks.
ru: Если ваша система электронной почты использует SPF со строгими правилами, вам следует исключить `mx2.FreeBSD.org` из проверок SPF.

source: Due to the severe load dealing with SPAM places on the central mail servers that do the mailing list processing, the front-end server does do some basic checks and will drop some messages based on these checks. At the moment proper DNS information for the connecting host is the only check in place but that may change. Some people blame these checks for bouncing valid email. To have these checks turned off for your email, create a file named [.filename]#~/.spam_lover# on `freefall.FreeBSD.org`.
ru: Из-за высокой нагрузки, которую обработка спама создает на центральных почтовых серверах, обрабатывающих почтовые рассылки, фронтенд-сервер выполняет базовые проверки и может отбрасывать некоторые сообщения на их основе. В настоящее время единственной активной проверкой является наличие корректной DNS-информации для подключающегося хоста, но это может измениться. Некоторые пользователи связывают эти проверки с ложным отбрасыванием легитимной почты. Для отключения данных проверок для вашей почты создайте файл с именем [.filename]#~/.spam_lover# на `freefall.FreeBSD.org`.

source: Those who are developers but not committers will not be subscribed to the committers or developers mailing lists. The subscriptions are derived from the access rights.
ru: Те, кто являются разработчиками, но не коммиттерами, не будут подписаны на рассылки коммиттеров или разработчиков. Подписки определяются правами доступа.

source: SMTP Access Setup
es: Configuración de acceso SMTP
ru: Настройка доступа SMTP

source: For those willing to send e-mail messages through the FreeBSD.org infrastructure, follow the instructions below:
es: Para aquellos que deseen enviar mensajes de correo electrónico a través de la infraestructura de FreeBSD.org, sigan las siguientes instrucciones:
ru: Для тех, кто желает отправлять электронные письма через инфраструктуру FreeBSD.org, следуйте приведенным ниже инструкциям:

source: Point your mail client at `smtp.FreeBSD.org:587`.
ru: Направьте ваш почтовый клиент на `smtp.FreeBSD.org:587`.

source: Enable STARTTLS.
ru: Включить STARTTLS.

source: Ensure your `From:` address is set to `_yourusername_@FreeBSD.org`.
ru: Убедитесь, что ваш адрес `From:` установлен как `_вашеимяпользователя_@FreeBSD.org`.

source: For authentication, you can use your FreeBSD Kerberos username and password (see crossref:committers-guide[kerberos-ldap, Kerberos and LDAP web Password for FreeBSD Cluster]). The `_yourusername_/mail` principal is preferred, as it is only valid for authenticating to mail resources.
ru: Для аутентификации можно использовать ваше имя пользователя и пароль FreeBSD Kerberos (см. crossref:committers-guide[kerberos-ldap, Kerberos и LDAP веб-пароль для кластера FreeBSD]). Предпочтительнее использовать принципал `_вашеимяпользователя_/mail`, так как он действителен только для аутентификации к почтовым ресурсам.

source: Do not include `@FreeBSD.org` when entering in your username.
ru: При вводе имени пользователя не включайте `@FreeBSD.org`.

source: Additional Notes
ru: Дополнительные заметки

source: Will only accept mail from `_yourusername_@FreeBSD.org`. If you are authenticated as one user, you are not permitted to send mail from another.
ru: Будет принимать почту только от `_вашеимяпользователя_@FreeBSD.org`. Если вы аутентифицированы как один пользователь, вам не разрешено отправлять почту от другого.

source: A header will be appended with the SASL username: (`Authenticated sender: _username_`).
ru: Будет добавлен заголовок сообщения с именем пользователя SASL: (`Authenticated sender: _имя_пользователя_`).

source: Host has various rate limits in place to cut down on brute force attempts.
ru: На хосте действуют различные ограничения по скорости для сокращения попыток взлома перебором паролей.

source: Using a Local MTA to Forward Emails to the FreeBSD.org SMTP Service
es: Uso de un MTA local para reenviar correos electrónicos al servicio SMTP de FreeBSD.org
ru: Использование локального MTA для пересылки электронной почты в SMTP-сервис FreeBSD.org

source: It is also possible to use a local MTA to forward locally sent emails to the FreeBSD.org SMTP servers.
es: También es posible utilizar un MTA local para reenviar emails enviados localmente a los servidores SMTP de FreeBSD.org.
ru: Также возможно использовать локальный MTA для пересылки локально отправленных писем на SMTP-серверы FreeBSD.org.

source: Using Postfix
ru: Использование Postfix

source: To tell a local Postfix instance that anything from `_yourusername_@FreeBSD.org` should be forwarded to the FreeBSD.org servers, add this to your [.filename]#main.cf#:
es: Para decirle a una instancia local de Postfix que se debería reenviar a los servidores FreeBSD.org cualquier cosa que venga de `_tunombredeusuario_@FreeBSD.org`, añade esto a tu [.filename]#main.cf#:
ru: Чтобы сообщить локальному экземпляру Postfix, что любое письмо от `_вашеимяпользователя_@FreeBSD.org` должно быть перенаправлено на серверы FreeBSD.org, добавьте это в ваш [.filename]#main.cf#:

source: Create [.filename]#/usr/local/etc/postfix/relayhost_maps# with the following content:
ru: Создайте файл [.filename]#/usr/local/etc/postfix/relayhost_maps# со следующим содержимым:

source: yourusername@FreeBSD.org [smtp.freebsd.org]:587
ru: вашеимяпользователя@FreeBSD.org [smtp.freebsd.org]:587

source: Create [.filename]#/usr/local/etc/postfix/sasl_passwd# with the following content:
ru: Создайте [.filename]#/usr/local/etc/postfix/sasl_passwd# со следующим содержимым:

source: [smtp.freebsd.org]:587 yourusername:yourpassword
es: [smtp.freebsd.org]:587 tunombredeusuario:tucontraseña
ru: [smtp.freebsd.org]:587 вашеимяпользователя:вашпароль

source: If the email server is used by other people, you may want to prevent them from sending e-mails from your address. To achieve this, add this to your [.filename]#main.cf#:
ru: Если почтовый сервер используется другими людьми, вы можете захотеть предотвратить отправку ими писем с вашего адреса. Для достижения этой цели добавьте это в ваш [.filename]#main.cf#:

source: Create [.filename]#/usr/local/etc/postfix/sender_login_maps# with the following content:
ru: Создайте файл [.filename]#/usr/local/etc/postfix/sender_login_maps# со следующим содержимым:

source: yourusername@FreeBSD.org yourlocalusername
ru: вашеимяпользователя@FreeBSD.org вашеимялокальногопользователя

source: Where _yourlocalusername_ is the SASL username used to connect to the local instance of Postfix.
ru: Где _вашеимялокальногопользователя_ — это имя пользователя SASL, используемое для подключения к локальному экземпляру Postfix.

source: Using OpenSMTPD
ru: Использование OpenSMTPD

source: To tell a local OpenSMTPD instance that anything from `_yourusername_@FreeBSD.org` should be forwarded to the FreeBSD.org servers, add this to your [.filename]#smtpd.conf#:
ru: Чтобы указать локальному экземпляру OpenSMTPD, что все письма от `_вашеимяпользователя_@FreeBSD.org` должны быть перенаправлены на серверы FreeBSD.org, добавьте это в ваш [.filename]#smtpd.conf#:

source: action "freebsd" relay host smtp+tls://freebsd@smtp.freebsd.org:587 auth <secrets> match from any auth yourlocalusername mail-from "_yourusername_@freebsd.org" for any action "freebsd"
ru: action "freebsd" relay host smtp+tls://freebsd@smtp.freebsd.org:587 auth <secrets> match from any auth вашеимялокальногопользователя mail-from "_вашеимяпользователя_@freebsd.org" for any action "freebsd"

source: Where _yourlocalusername_ is the SASL username used to connect to the local instance of OpenSMTPD.
ru: Где _вашеимялокальногопользователя_ — это имя пользователя SASL, используемое для подключения к локальному экземпляру OpenSMTPD.

source: Create [.filename]#/usr/local/etc/mail/secrets# with the following content:
ru: Создайте файл [.filename]#/usr/local/etc/mail/secrets# со следующим содержимым:

source: freebsd yourusername:yourpassword
ru: freebsd вашеимяпользователя:вашпароль

source: Using Exim
ru: Использование Exim

source: To direct a local Exim instance to forward all mail from `_example_@FreeBSD.org` to FreeBSD.org servers, add this to Exim [.filename]#configuration#:
es: Para decirle a una instancia local de Exim que se debería reenviar a los sevidores FreeBSD.ORG cualquier cosa que venga de `_example_@FreeBSD.org` añade esto a tu [.filename]#configuration# de Exim:
ru: Чтобы направить локальный экземпляр Exim для пересылки всей почты от `_example_@FreeBSD.org` на серверы FreeBSD.org, добавьте это в [.filename]#конфигурацию# Exim:

source: Create [.filename]#/usr/local/etc/exim/freebsd_send# with the following content:
ru: Создайте файл [.filename]#/usr/local/etc/exim/freebsd_send# со следующим содержимым:

source: Mentors
es: Mentores
ru: Наставники

source: All new developers have a mentor assigned to them for the first few months. A mentor is responsible for teaching the mentee the rules and conventions of the project and guiding their first steps in the developer community. The mentor is also personally responsible for the mentee's actions during this initial period.
es: Todos los nuevos desarrolladores tienen un mentor asignado durante los primeros meses. Un mentor es responsable de enseñar a los aprendices las reglas y convenciones del proyecto y de guiar sus primeros pasos en la comunidad de desarrolladores. El mentor también es personalmente responsable de las acciones de los aprendices durante este período inicial.
ru: Все новые разработчики получают наставника на первые несколько месяцев. Наставник отвечает за обучение подопечного правилам и соглашениям проекта и направляет его первые шаги в сообществе разработчиков. Наставник также несёт личную ответственность за действия подопечного в течение этого начального периода.

source: For committers: do not commit anything without first getting mentor approval. Document that approval with an `Approved by:` line in the commit message.
es: Para los committers: no envíes nada sin obtener primero la aprobación del mentor. Documenta esa aprobación con una línea `Approved by:` en el mensaje de commit.
ru: Для коммиттеров: не коммитьте ничего без предварительного одобрения ментора. Задокументируйте это одобрение строкой `Approved by:` в сообщении коммита.

source: When the mentor decides that a mentee has learned the ropes and is ready to commit on their own, the mentor announces it with a commit to [.filename]#mentors#. This file is in the [.filename]#admin# orphan branch of each repository. Detailed information on how to access these branches can be found in crossref:committers-guide[admin-branch, "admin" branch].
ru: Когда наставник решает, что подопечный освоил основы и готов к самостоятельной фиксации изменений, наставник объявляет об этом, выполняя коммит в [.filename]#mentors#. Этот файл находится в сиротской ветке [.filename]#admin# каждого репозитория. Подробная информация о том, как получить доступ к этим веткам, доступна в crossref:committers-guide[admin-branch, ветке "admin"].

source: Pre-Commit Review
es: Revisión previa al commit
ru: Предварительная проверка перед коммитом

source: Code review is one way to increase the quality of software. The following guidelines apply to commits to the `main` (-CURRENT) branch of the `src` repository. Other branches and the `ports` and `docs` trees have their own review policies, but these guidelines generally apply to commits requiring review:
es: La revisión de código es una forma de incrementar la calidad del software. Las siguientes guías aplican a los commits a la rama `main`(-CURREN) del repositorio `src`. Otras ramas y los árboles `ports` y `docs` tienen sus propias políticas, pero estas directrices aplican generalmente a commits que necesitan revisión:
ru: Рецензирование кода — один из способов повышения качества программного обеспечения. Следующие рекомендации применимы к коммитам в ветку `main` (-CURRENT) репозитория `src`. Другие ветки, а также деревья `ports` и `docs` имеют собственные политики проверки и рецензирования, но данные рекомендации в целом применимы к коммитам, требующим рецензии:

source: All non-trivial changes should be reviewed before they are committed to the repository.
ru: Все нетривиальные изменения должны быть проверены перед их фиксацией в репозитории.

source: Reviews may be conducted by email, in Bugzilla, in Phabricator, or by another mechanism. Where possible, reviews should be public.
ru: Рецензирование может проводиться по электронной почте, в Bugzilla, в Phabricator или с помощью другого механизма. По возможности рецензирование должно быть публичным.

source: The developer responsible for a code change is also responsible for making all necessary review-related changes.
ru: Разработчик, ответственный за изменение кода, также обязан вносить все необходимые изменения, связанные с проверкой.

source: Code review can be an iterative process, which continues until the patch is ready to be committed. Specifically, once a patch is sent out for review, it should receive an explicit "looks good" before it is committed. So long as it is explicit, this can take whatever form makes sense for the review method.
ru: Рецензирование кода может быть итеративным процессом, который продолжается до тех пор, пока патч не будет готов к коммиту. В частности, после отправки патча на рецензирование, он должен получить явное подтверждение "выглядит хорошо" перед коммитом. Оно должно быть явным, и это может принимать любую форму, которая имеет смысл для метода рецензирования.

source: Timeouts are not a substitute for review.
ru: Тайм-ауты не являются заменой проверке.

source: Sometimes code reviews will take longer than you would hope for, especially for larger features. Accepted ways to speed up review times for your patches are:
ru: Иногда проверка кода занимает больше времени, чем хотелось бы, особенно для большого по объему функционала. Принятые способы ускорить проверку ваших патчей:

source: Review other people's patches. If you help out, everybody will be more willing to do the same for you; goodwill is our currency.
ru: Проверяйте патчи других людей. Если вы помогаете, все будут более охотно делать то же самое для вас; доброжелательность — наша валюта.

source: Ping the patch. If it is urgent, provide reasons why it is important to you to get this patch landed and ping it every couple of days. If it is not urgent, the common courtesy ping rate is one week. Remember that you are asking for valuable time from other professional developers.
ru: Пингуйте патч. Если он срочный, укажите причины, почему для вас важно, чтобы этот патч был принят, и пингуйте каждые пару дней. Если он не срочный, общепринятая вежливая частота пинга — одна неделя. Помните, что вы просите у других профессиональных разработчиков их ценное время.

source: Ask for help on mailing lists, IRC, etc. Others may be able to either help you directly, or suggest a reviewer.
ru: Обратитесь за помощью в списки рассылки, IRC и т.д. Другие могут либо помочь вам напрямую, либо предложить рецензента.

source: Split your patch into multiple smaller patches that build on each other. The smaller your patch, the higher the probability that somebody will take a quick look at it.
ru: Разделите ваш патч на несколько меньших патчей, которые основываются друг на друге. Чем меньше ваш патч, тем выше вероятность, что кто-то бегло его просмотрит.

source: When making large changes, it is helpful to keep this in mind from the beginning of the effort as breaking large changes into smaller ones is often difficult after the fact.
ru: При внесении крупных изменений полезно держать это в уме с самого начала работы, поскольку разбиение крупных изменений на более мелкие часто бывает затруднительно постфактум.

source: Developers should participate in code reviews as both reviewers and reviewees. If someone is kind enough to review your code, you should return the favor for someone else. Note that while anyone is welcome to review and give feedback on a patch, only an appropriate subject-matter expert can approve a change. This will usually be a committer who works with the code in question on a regular basis.
ru: Разработчикам следует участвовать в проверках кода как в роли авторов, так и в роли рецензентов. Если кто-то любезно проверил ваш код, вы должны ответить тем же для кого-то другого. Обратите внимание, что хотя любой может проверить и дать обратную связь по патчу, только соответствующий эксперт по теме может одобрить изменение. Обычно это коммиттер, который регулярно работает с рассматриваемым кодом.

source: In some cases, no subject-matter expert may be available. In those cases, a review by an experienced developer is sufficient when coupled with appropriate testing.
ru: В некоторых случаях может не оказаться эксперта по предметной области. В таких случаях достаточно проверки опытным разработчиком в сочетании с соответствующим тестированием.

source: Commit Log Messages
es: Mensajes de Commit
ru: Журнал сообщений о коммитах

source: This section contains some suggestions and traditions for how commit logs are formatted.
es: Esta sección contiene algunas sugerencias y tradiciones sobre cómo se formatean los mensajes de commit.
ru: В этом разделе содержатся некоторые предложения и традиции по форматированию журналов коммитов.

source: Why are commit messages important?
es: ¿Por qué son importantes los mensajes de commit?
ru: Почему важны сообщения коммитов?

source: When you commit a change in Git, Subversion, or another version control system (VCS), you're prompted to write some text describing the commit -- a commit message. How important is this commit message? Should you spend some significant effort writing it? Does it really matter if you write simply `fixed a bug`?
ru: При фиксации изменения в Git, Subversion или другой системе контроля версий (СКВ) вам предлагается написать текст с описанием коммита — сообщение о коммите. Насколько важно это сообщение о коммите? Стоит ли прилагать значительные усилия для его написания? Имеет ли значение, если вы просто напишете `исправлена ошибка`?

source: Most projects have more than one developer and last for some length of time. Commit messages are a very important method of communicating with other developers, in the present and for the future.
es: La mayoría de los proyectos tienen más de un desarrollador y duran un tiempo determinado. Los mensajes de commit son un método muy importante de comunicación con otros desarrolladores, en el presente y para el futuro.
ru: У большинства проектов более одного разработчика, и они длятся в течение некоторого времени. Сообщения коммитов — это очень важный способ общения с другими разработчиками, как в настоящем, так и в будущем.

source: FreeBSD has hundreds of active developers and hundreds of thousands of commits spanning decades of history. Over that time the developer community has learned how valuable good commit messages are; sometimes these are hard-learned lessons.
es: FreeBSD tiene cientos de desarrolladores activos y cientos de miles de commits a lo largo de décadas de historia. Durante ese tiempo la comunidad de desarrolladores ha aprendido cómo de valiosos son los buenos mensajes de commit; a veces se ha tenido que aprender a la fuerza.
ru: В FreeBSD сотни активных разработчиков и сотни тысяч коммитов, охватывающих десятилетия истории. За это время сообщество разработчиков осознало, насколько ценны хорошие сообщения к коммитам; иногда эти уроки давались тяжело.

source: Commit messages serve at least three purposes:
es: Los mensajes de commit sirven al menos tres propósitos:
ru: Сообщения коммитов служат как минимум трем целям:

source: Communicating with other developers
ru: Сотрудничество с другими

source: FreeBSD commits generate email to various mailing lists. These include the commit message along with a copy of the patch itself. Commit messages are also viewed through commands like git log. These serve to make other developers aware of changes that are ongoing; that other developer may want to test the change, may have an interest in the topic and will want to review in more detail, or may have their own projects underway that would benefit from interaction.
ru: Коммиты FreeBSD генерируют письма для различных списков рассылки. Они включают сообщение коммита вместе с копией самого патча. Сообщения коммитов также просматриваются с помощью команд, таких как `git log`. Это служит для информирования других разработчиков об изменениях, которые происходят; другой разработчик может захотеть протестировать изменение, может быть заинтересован в теме и захочет просмотреть более подробно, или может иметь свои собственные проекты, которые выиграют от взаимодействия.

source: Making Changes Discoverable
ru: Обеспечение возможности обнаружения изменений

source: In a large project with a long history it may be difficult to find changes of interest when investigating an issue or change in behaviour. Verbose, detailed commit messages allow searches for changes that might be relevant. For example, `git log --since 1year --grep 'USB timeout'`.
ru: В большом проекте с долгой историей может быть сложно найти интересующие изменения при расследовании проблемы или изменения в поведении. Подробные, детальные сообщения о коммитах позволяют искать изменения, которые могут быть релевантны. Например, `git log --since 1year --grep 'USB timeout'`.

source: Providing historical documentation
ru: Предоставление исторической документации

source: Commit messages serve to document changes for future developers, perhaps years or decades later. This future developer may even be you, the original author. A change that seems obvious today may be decidedly not so much later on.
ru: Сообщения о фиксации служат для документирования изменений для будущих разработчиков, возможно, спустя годы или десятилетия. Этот будущий разработчик может оказаться даже вами, первоначальным автором. Изменение, которое кажется очевидным сегодня, может оказаться совсем не таким в будущем.

source: The `git blame` command annotates each line of a source file with the change (hash and subject line) that brought it in.
ru: Команда `git blame` аннотирует каждую строку исходного файла информацией о изменении (хэш и тема коммита), которое её добавило.

source: Having established the importance, here are elements of a good FreeBSD commit message:
ru: Теперь, когда важность хорошего сообщения о коммите в FreeBSD несомненна, вот его элементы:

source: Start with a subject line
es: Comienza con una línea para el título
ru: Начните со строки темы
