Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/committers-guide/_index.po
Languages: es, ru

source: Any committer may make changes to any other tree with an "Approved by" from a non-mentored committer with the appropriate bit. Mentored committers can provide a "Reviewed by" but not an "Approved by".
es: Cualquier committer puede realizar cambios en cualquier otro árbol con un "Approved by" de un committer que no esté tutelado y dispone del commit bit apropiado. Los committers con mentor pueden proporcionar un comentario "Reviewed by" pero no un "Approved by".
ru: Любой коммиттер может вносить изменения в любое другое дерево с пометкой "Approved by" от некурируемого коммиттера с соответствующими правами. Курируемые коммиттеры (имеющие наставника) могут предоставлять пометку "Reviewed by", но не "Approved by".

source: Committers can acquire an additional bit by the usual process of finding a mentor who will propose them to srcmgr, doceng, or portmgr, as appropriate. When approved, they will be added to 'access' and the normal mentoring period will ensue, which will involve a continuing of "Approved by" for some period.
ru: Коммиттеры могут получить дополнительный бит по обычному процессу: найти наставника, который предложит их srcmgr, doceng или portmgr, в зависимости от ситуации. После одобрения их добавят в 'access', и начнётся стандартный период наставничества, который будет включать продолжение отметки "Approved by" в течение некоторого времени.

source: Documentation Implicit (Blanket) Approval
es: Aprobación Implícita (Blanket) de Documentación
ru: Неявное (по умолчанию) одобрение для документации

source: Some types of fixes have "blanket approval" from the {doceng}, allowing any committer to fix those categories of problems on any part of the doc tree. These fixes do not need approval or review from a doc committer if the author doesn't have a doc commit bit.
es: Algunos arreglos tienen "blanket approval" por parte de {doceng}, permitiendo a cualquier committer arreglar ese tipo de problemas en cualquier parte del árbol de documentación. Estos arreglos no necesitan aprobación o revisión por parte de un committer de documentación si el autor no tiene un commit bit de documentación.
ru: Некоторые типы исправлений имеют "одобрение по умолчанию" от {doceng}, что позволяет любому коммиттеру исправлять эти категории проблем в любой части дерева документации. Эти исправления не требуют одобрения или проверки от коммиттера документации, если у автора нет прав на коммит в документацию.

source: Blanket approval applies to these types of fixes:
es: El blanket approval aplica en estos tipos de arreglos:
ru: Общее одобрение применяется к следующим типам исправлений:

source: Typos
es: Faltas de ortografía
ru: Опечатки

source: Trivial fixes
es: Arreglos triviales
ru: Тривиальные исправления

source: Punctuation, URLs, dates, paths and file names with outdated or incorrect information, and other common mistakes that may confound the readers.
es: Puntuación, URLs, fechas, rutas y nombres de fichero con información desactualizada o incorrecta, y otros errores comunes que puedan confundir a los lectores.
ru: Пунктуация, URL-адреса, даты, пути и имена файлов с устаревшей или некорректной информацией, а также другие распространённые ошибки, которые могут ввести читателей в заблуждение.

source: Over the years, some implicit approvals were granted in the doc tree. This list shows the most common cases:
es: A lo largo de los años, se han concedido algunas aprobaciones implícitas en el árbol de documentación. Esta lista muestra los casos más comunes:
ru: За годы в дереве документации были неявно одобрены некоторые случаи. Этот список показывает наиболее распространённые из них:

source: Changes in [.filename]#documentation/content/en/books/porters-handbook/versions/_index.adoc#
es: Cambios en [.filename]#documentation/content/en/books/porters-handbook/versions/_index.adoc#
ru: Изменения в [.filename]#documentation/content/ru/books/porters-handbook/versions/_index.adoc#

source: extref:{porters-handbook}versions/[__FreeBSD_version Values (Porter's Handbook)], mainly used for src committers.
es: extref:{porters-handbook}versions/[__FreeBSD_version Values (Porter's Handbook)], utilizado principalmente por committers de src.
ru: extref:{porters-handbook}versions[Значения __FreeBSD_version (Руководство по созданию портов)], в основном используется коммиттерами src.

source: Changes in [.filename]#doc/shared/contrib-additional.adoc#
es: Cambios en [.filename]#doc/shared/contrib-additional.adoc#
ru: Изменения в [.filename]#doc/shared/contrib-additional.adoc#

source: extref:{contributors}[Additional FreeBSD Contributors, contrib-additional] maintenance.
es: Mantenimiento de extref:{contributors}[Colaboradores Adicionales de FreeBSD, contrib-additional].
ru: Сопровождение раздела extref:{contributors}[Дополнительные участники FreeBSD, contrib-additional].

source: All link:#commit-steps[Steps for New Committers], doc related
es: Todo link:#commit-steps[Pasos para los Nuevos Committers], relacionado con documentación
ru: Все link:#commit-steps[Шаги для новых коммиттеров], связанные с документацией

source: Security advisories; Errata Notices; Releases;
es: Avisos de seguridad; Notas de Errata; Releases;
ru: Рекомендации по безопасности; Уведомления об ошибках; Релизы;

source: Used by {security-officer} and {re}.
es: Utilizado por {security-officer} y {re}.
ru: {security-officer} и {re} используют эти разделы.

source: Changes in [.filename]#website/content/en/donations/donors.adoc#
es: Cambios en [.filename]#website/content/en/donations/donors.adoc#
ru: Изменения в [.filename]#website/content/ru/donations/donors.adoc#

source: Used by {donations}.
es: Utilizado por el {donations}.
ru: {donations} использует этот документ.

source: Before any commit, a build test is necessary; see the 'Overview' and 'The FreeBSD Documentation Build Process' sections of the extref:{fdp-primer}[FreeBSD Documentation Project Primer for New Contributors] for more details.
es: Antes de un commit, es necesario comprobar la compilación; consulta las secciones de 'Overview' y 'The FreeBSD Documentation Build Process' de extref:{fdp-primer}[Introducción al Proyecto de Documentación de FreeBSD para Nuevos Voluntarios] para más detalles.
ru: Перед любым коммитом необходимо выполнить тестовую сборку; подробности см. в разделах «Обзор» и «Процесс сборки документации FreeBSD» extref:{fdp-primer}[Руководства для новых участников проекта документации FreeBSD].

source: Git Primer
es: Introducción a Git
ru: Руководство по Git

source: Git basics
es: Git básico
ru: Основы Git

source: When one searches for "Git Primer" a number of good ones come up. Daniel Miessler's link:https://danielmiessler.com/study/git/[A git primer] and Willie Willus' link:https://gist.github.com/williewillus/068e9a8543de3a7ef80adb2938657b6b[Git - Quick Primer] are both good overviews. The Git book is also complete, but much longer https://git-scm.com/book/en/v2. There is also this website https://dangitgit.com/ for common traps and pitfalls of Git, in case you need guidance to fix things up. Finally, an introduction link:https://eagain.net/articles/git-for-computer-scientists/[targeted at computer scientists] has proven helpful to some at explaining the Git world view.
es: Cuando uno busca "Introducción a Git" aparecen unos cuantos buenos las introducciones de Daniel Miessler link:https://danielmiessler.com/study/git/[A git primer] y de Willie Willus link:https://gist.github.com/williewillus/068e9a8543de3a7ef80adb2938657b6b[Git - Quick Primer] son ambas buenas. El libro de Git también es completo, pero mucho más largo https://git-scm.com/book/en/v2. También hay un sitio web https://dangitgit.com/ para errores comunes y problemas de Git, en caso de que necesites ayuda para arreglar algo. Por último una introducción link:https://eagain.net/articles/git-for-computer-scientists/[dirigida a científicos computacionales] ha demostrado ser útil para algunos a la hora de explicar cómo Git ve el mundo.
ru: При поиске по ключевым словам "Git Primer" можно найти множество хороших материалов. Страницы Дэниела Милера link:https://danielmiessler.com/study/git/[Введение в Git] и Вилли Виллуса link:https://gist.github.com/williewillus/068e9a8543de3a7ef80adb2938657b6b[Git - Краткое введение] являются хорошими обзорами. Книга по Git также полная, но гораздо длиннее: https://git-scm.com/book/en/v2. Также обратите внимание на сайт https://dangitgit.com/, посвящённый распространённым ловушкам и подводным камням Git, на случай, если вам нужно исправить ошибки. Наконец, введение, link:https://eagain.net/articles/git-for-computer-scientists/[ориентированное на компьютерных учёных], оказалось полезным для некоторых в объяснении мировоззрения Git.

source: This document will assume that you've read through it and will try not to belabor the basics (though it will cover them briefly).
es: Este documento asumirá que lo has leído y tratará de no insistir en lo básico (aunque lo cubrirá brevemente).
ru: Этот документ предполагает, что вы уже читали про это, и постарается не повторять основы (хотя кратко их рассмотрит).

source: Git Mini Primer
es: Mini Introducción a Git
ru: Мини-руководство по Git

source: This primer is less ambitiously scoped than the old Subversion Primer, but should cover the basics.
es: Esta introducción tiene un ámbito menos ambicioso que la antigua Introducción a Subversion, pero debería cubrir lo básico.
ru: Это руководство имеет менее амбициозные цели, чем старое руководство по Subversion, но должно охватить основы.

source: Scope
es: Ámbito
ru: Область применения

source: If you want to download FreeBSD, compile it from sources, and generally keep up to date that way, this primer is for you. It covers getting the sources, updating the sources, bisecting and touches briefly on how to cope with a few local changes. It covers the basics, and tries to give good pointers to more in-depth treatment for when the reader finds the basics insufficient. Other sections of this guide cover more advanced topics related to contributing to the project.
es: Si quieres descargar FreeBSD, compilarlo desde las fuentes, y en general mantenerte actualizado de ese modo, esta introducción es para ti. Cubre cómo obtener las fuentes, actualizarlas, hacer bisección y trata brevemente cómo lidiar con unos pocos cambios locales. Cubre lo básico y trata de dar buenos consejos para un tratamiento más en profundidad para cuando el lector encuentre lo básico insuficiente. Otras secciones de esta guía cubren temas más avanzados relacionados con cómo contribuir al proyecto.
ru: Если вы хотите загрузить FreeBSD, собрать его из исходных кодов и в целом поддерживать актуальность таким способом, это руководство для вас. Оно охватывает получение исходных кодов, их обновление, бинарный поиск (bisect) и кратко затрагивает способы работы с локальными изменениями. В нём изложены основы, а также даны полезные ссылки на более глубокие материалы для случаев, когда читателю будет недостаточно базовой информации. Другие разделы этого руководства посвящены более сложным темам, связанным с участием в проекте.

source: The goal of this section is to highlight those bits of Git needed to track sources. They assume a basic understanding of Git. There are many primers for Git on the web, but the https://git-scm.com/book/en/v2[Git Book] provides one of the better treatments.
es: El objetivo de esta sección es resaltar aquellas partes de Git que se necesitan para seguir la pista a las fuentes. Asumen un conocimiento básico de Git. Hay muchas introducciones de Git en la web, pero el https://git-scm.com/book/en/v2[Git Book] proporciona una de las mejores.
ru: Цель этого раздела — выделить те аспекты Git, которые необходимы для отслеживания исходных кодов. Предполагается базовое понимание Git. В интернете есть множество вводных руководств по Git, но https://git-scm.com/book/en/v2[Книга по Git] предлагает одно из лучших изложений.

source: Getting Started For Developers
es: Primeros Pasos Para Desarrolladores
ru: Начало работы для разработчиков

source: This section describes the read-write access for committers to push the commits from developers or contributors.
es: Esta sección describe el acceso de lectura-escritura para que los committers hagan push de los commits de los desarrolladores o colaboradores.
ru: Этот раздел описывает доступ на чтение и запись для коммиттеров, чтобы отправлять коммиты от разработчиков или контрибьюторов.

source: Daily use
es: Uso diario
ru: Повседневное использование

source: In the examples below, replace `${repo}` with the name of the desired FreeBSD repository: `doc`, `ports`, or `src`.
ru: В приведенных ниже примерах замените `${repo}` на имя нужного репозитория FreeBSD: `doc`, `ports` или `src`.

source: Clone the repository:
es: Clona el repositorio:
ru: Клонировать репозиторий:

source: Then you should have the official mirrors as your remote:
es: Después deberías tener tu remote apuntando a los mirrors oficiales:
ru: В результате у вас в качестве удалённых (remote) должны быть официальные зеркала:

source: Configure the FreeBSD committer data:
es: Configura los datos del committer de FreeBSD:
ru: Настройка данных коммиттера FreeBSD:

source: The commit hook in repo.freebsd.org checks the "Commit" field matches the committer's information in FreeBSD.org. The easiest way to get the suggested config is by executing `/usr/local/bin/gen-gitconfig.sh` script on freefall:
es: El commit hook en repo.freebsd.org comprueba que el campo "Commit" coincide con la información del committer en FreeBSD.org. La forma más fácil de conseguir la configuración sugerida es ejecutar el script `/usr/local/bin/gen-gitconfig.sh` en freefall:
ru: Хук для коммита в repo.freebsd.org проверяет, что поле "Commit" соответствует информации о коммиттере в FreeBSD.org. Самый простой способ получить предлагаемую конфигурацию — выполнить скрипт `/usr/local/bin/gen-gitconfig.sh` на freefall:

source: Set the push URL:
es: Establece la URL para hacer push:
ru: Установите URL для отправки (push URL):

source: Then you should have separated fetch and push URLs as the most efficient setup:
es: Después deberías tener URLs separadas para fetch y push que es la configuración más eficiente:
ru: В таком случае у вас должны быть раздельные URL для извлечения (fetch) и отправки (push) как наиболее эффективная настройка:

source: Again, note that `gitrepo.freebsd.org` has been canonicalized to `repo.freebsd.org`.
es: De nuevo, date cuenta de que `gitrepo.freebsd.org` ha sido convertido a su forma canónica `repo.freebsd.org`.
ru: Еще раз обратите внимание, что `gitrepo.freebsd.org` является псевдонимом для `repo.freebsd.org`.

source: Install commit message template hook:
es: Instala el hook para la plantilla del mensaje de commit:
ru: Установка хука для шаблона сообщения коммита:

source: For doc repository:
ru: Для репозитория документации:

source: For ports repository:
ru: Для репозитория портов:

source: For src repository:
ru: Для репозитория src:

source: "admin" branch
es: rama "admin"
ru: Ветка "admin"

source: The `access` and `mentors` files are stored in an orphan branch, `internal/admin`, in each repository.
es: Los ficheros `access` y `metors` se almacenan en una rama huérfana, `internal/admin`, en cada repositorio.
ru: Файлы `access` и `mentors` хранятся в отдельной (orphan) ветке `internal/admin` в каждом репозитории.

source: Following example is how to check out the `internal/admin` branch to a local branch named `admin`:
es: El siguiente ejemplo muestra cómo obtener la rama `internal/admin` en una rama local `admin`:
ru: Следующий пример показывает, как переключиться (check out) на ветку `internal/admin` в локальной ветке с именем `admin`:

source: Alternatively, you can add a worktree for the `admin` branch:
es: De forma alternativa, puedes añadir un árbol de trabajo (worktree) para la rama `admin`:
ru: В качестве альтернативы вы можете добавить рабочее дерево для ветки `admin`:

source: For browsing `internal/admin` branch on web: `https://cgit.freebsd.org/${repo}/log/?h=internal/admin`
es: Para visualizar la rama `internal/admin` en la web: `https://cgit.freebsd.org/${repo}/log/?h=internal/admin`
ru: Для просмотра ветки `internal/admin` в веб-интерфейсе: `https://cgit.freebsd.org/${repo}/log/?h=internal/admin`

source: For pushing, specify the full refspec:
ru: Для отправки (push) укажите полную спецификацию ссылки:

source: Keeping Current With The FreeBSD src Tree
es: Mantenerse Actualizado Con el Árbol src de FreeBSD
ru: Как поддерживать актуальную копию дерева исходных кодов FreeBSD src

source: First step: cloning a tree. This downloads the entire tree. There are two ways to download. Most people will want to do a deep clone of the repository. However, there are times when you may wish to do a shallow clone.
es: Primer paso: clonar un árbol. Esto descarga el árbol completo. Hay dos formas de hacerlo. La mayoría de la gente quiere hacer un clonado profundo del repositorio. Sin embargo, hay momentos en los que quieres hacer un clonado superficial.
ru: Первый шаг: клонирование дерева. Это загружает всё дерево целиком. Существует два способа загрузки. Большинству пользователей потребуется глубокое клонирование репозитория. Однако бывают случаи, когда может потребоваться поверхностное клонирование.

source: Branch Names
es: Nombres de las Ramas
ru: Названия веток

source: FreeBSD-CURRENT uses the `main` branch.
es: FreeBSD-CURRENT utiliza la rama `main`.
ru: FreeBSD-CURRENT использует ветку `main`.

source: `main` is the default branch.
es: `main` es la rama por defecto.
ru: `main` — это ветка по умолчанию.

source: For FreeBSD-STABLE, branch names include `stable/12` and `stable/13`.
es: Para FreeBSD-STABLE, los nombres de las ramas incluyen `stable/12` y `stable/13`.
ru: Для FreeBSD-STABLE названия веток включают `stable/12` и `stable/13`.

source: For FreeBSD-RELEASE, release engineering branch names include `releng/12.4` and `releng/13.2`.
es: Para FreeBSD-RELEASE, los nombres de las ramas de ingeniería de versiones incluyen `releng/12.4` y `releng/13.2`.
ru: Для FreeBSD-RELEASE, названия веток разработки выпусков включают `releng/12.4` и `releng/13.2`.

source: https://www.freebsd.org/releng/[] shows:
es: https://www.freebsd.org/releng/[] muestra:
ru: https://www.freebsd.org/releng/[] отображает:

source: `main` and `stable/⋯` branches open
es: ramas `main` y `stable/⋯` abiertas
ru: ветки `main` и `stable/⋯` открыты

source: `releng/⋯` branches, each of which is frozen when a release is tagged.
es: ramas `releng/⋯` , cada una de las cuales es congelada cuando se etiqueta una versión.
ru: ветки `releng/⋯`, каждая из которых замораживается при создании тега релиза.

source: Examples:
es: Ejemplos:
ru: Примеры:

source: tag https://cgit.freebsd.org/src/tag/?h=release/13.1.0[release/13.1.0] on the https://cgit.freebsd.org/src/log/?h=releng/13.1[releng/13.1] branch
es: etiqueta https://cgit.freebsd.org/src/tag/?h=release/13.1.0[release/13.1.0] en la rama https://cgit.freebsd.org/src/log/?h=releng/13.1[releng/13.1]
ru: тег https://cgit.freebsd.org/src/tag/?h=release/13.1.0[release/13.1.0] на ветке https://cgit.freebsd.org/src/log/?h=releng/13.1[releng/13.1]

source: tag https://cgit.freebsd.org/src/tag/?h=release/13.2.0[release/13.2.0] on the https://cgit.freebsd.org/src/log/?h=releng/13.2[releng/13.2] branch.
es: etiqueta https://cgit.freebsd.org/src/tag/?h=release/13.2.0[release/13.2.0] en la rama https://cgit.freebsd.org/src/log/?h=releng/13.2[releng/13.2].
ru: тег https://cgit.freebsd.org/src/tag/?h=release/13.2.0[release/13.2.0] на ветке https://cgit.freebsd.org/src/log/?h=releng/13.2[releng/13.2].

source: Repositories
es: Repositorios
ru: Репозитории

source: Please see the crossref:committers-guide[admin,Administrative Details] for the latest information on where to get FreeBSD sources. $URL below can be obtained from that page.
ru: Пожалуйста, обратитесь к разделу crossref:committers-guide[admin,Административные детали] для получения актуальной информации о том, где взять исходные коды FreeBSD. Значение $URL ниже можно получить с этой страницы.

source: Note: The project doesn't use submodules as they are a poor fit for our workflows and development model. How we track changes in third-party applications is discussed elsewhere and generally of little concern to the casual user.
es: Nota: El proyecto no utiliza submódulos ya que no encajan en nuestro flujo de trabajo y modelo de desarrollo. Cómo seguimos la pista a los cambios en las aplicaciones de terceros se discute en otro sitio y en general no es de interés para un usuario casual.
ru: Примечание: Проект не использует подмодули, так как они плохо подходят для наших рабочих процессов и модели разработки. То, как мы отслеживаем изменения в сторонних приложениях, обсуждается в другом месте и, как правило, мало интересует обычного пользователя.

source: Deep Clone
es: Clonado Profundo
ru: Полный клон

source: A deep clone pulls in the entire tree, as well as all the history and branches. It is the easiest to do. It also allows you to use Git's worktree feature to have all your active branches checked out into separate directories but with only one copy of the repository.
es: Un clonado profundo se trae el árbol entero, así como las ramas y toda la historia. Es lo más fácil de hacer. También te permite usar la característica de los árboles de trabajo para tener todas tus ramas activas en directorios separados pero con una sola copia del repositorio.
ru: Полный клон загружает всё дерево целиком, включая всю историю и ветки. Это самый простой способ. Он также позволяет использовать функцию Git `worktree`, чтобы все активные ветки были извлечены в отдельные каталоги, но с единственной копией репозитория.

source: will create a deep clone. `branch` should be one of the branches listed in the previous section. If no `branch` is given: the default (`main`) will be used. If no `<directory>` is given: the name of the new directory will match the name of the repo ([.filename]#doc#, [.filename]#ports# or [.filename]#src#).
es: creará un clonado profundo. `branch` debería ser una de las ramas listadas en la sección anterior. Si no se proporciona `branch` se usará la rama por defecto (`main`). Si no se proporciona `<directory>` se usará como nombre del nuevo directorio el que coincida con el nombre del repositorio ([.filename]#doc#, [.filename]#ports# o [.filename]#src#).
ru: создаст полную копию. `branch` должна быть одной из веток, перечисленных в предыдущем разделе. Если параметр `branch` не указан: будет использоваться ветка по умолчанию (`main`). Если параметр `<directory>` не указан: имя нового каталога будет соответствовать имени репозитория ([.filename]#doc#, [.filename]#ports# или [.filename]#src#).
