Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/committers-guide/_index.po
Languages: es, ru

source: At this point you can push the import to `vendor` into our repo.
es: En este momento puedes empujar la importación a `vendor` en nuestro propio repo.
ru: На этом этапе вы можете отправить импорт в `vendor` в наш репозиторий.

source: `--follow-tags` tells `git push` to also push tags associated with the locally committed revision.
ru: `--follow-tags` указывает `git push` также отправлять теги, связанные с локально зафиксированной ревизией.

source: Updating the FreeBSD source tree
es: Actualizando el árbol de fuentes de FreeBSD
ru: Обновление дерева исходных кодов FreeBSD

source: Now you need to update the mtree in FreeBSD. The sources live in `contrib/mtree` since it is upstream software.
es: Ahora necesitas actualizar el mtree en FreeBSD. Las fuentes están en `contrib/mtree` ya que es software de terceros.
ru: Теперь вам нужно обновить mtree в FreeBSD. Исходные коды находятся в `contrib/mtree`, так как это программное обеспечение из внешних источников.

source: From time to time, we may have to make changes to the contributed code to better satisfy FreeBSD's needs. Whenever possible, please try to contribute the local changes back to the upstream projects, this helps them to better support FreeBSD, and also saves your time for future conflict resolutions when importing updates.
ru: Время от времени нам может потребоваться вносить изменения в предоставленный (contrib) код, чтобы лучше соответствовать потребностям FreeBSD. По возможности, пожалуйста, старайтесь передавать локальные изменения обратно в вышестоящие проекты — это помогает им лучше поддерживать FreeBSD, а также экономит ваше время при разрешении конфликтов в будущем при импорте обновлений.

source: This would generate a subtree merge commit of `contrib/mtree` against the local `vendor/NetBSD/mtree` branch. Examine the diff from the merge result and the contents of the upstream branch. If the merge reduced our local changes to more trivial difference like blank line or indenting changes, try amending the local changes to reduce diff against upstream, or try to contribute the remaining changes back to the upstream project. If there were conflicts, you would need to fix them before committing. Include details about the changes being merged in the merge commit message.
ru: Это создаст коммит слияния поддерева `contrib/mtree` с локальной веткой `vendor/NetBSD/mtree`. Изучите разницу (diff) между результатом слияния и содержимым вышестоящей ветки. Если слияние сократило наши локальные изменения до более тривиальных различий, таких как изменения пустых строк или отступов, попробуйте исправить локальные изменения, чтобы уменьшить разницу с вышестоящей версией, или попытайтесь внести оставшиеся изменения обратно в вышестоящий проект. Если возникли конфликты, вам потребуется устранить их перед коммитом. Включите подробности об объединяемых изменениях в сообщение коммита слияния.

source: Some open-source software includes a `configure` script that generates files used to define how the code is built; usually, these generated files like `config.h` should be updated as part of the import process. When doing this, always keep in mind that these scripts are executable code running under the current user's credentials. This process should always be run in an isolated environment, ideally inside a jail that does not have network access, and with an unprivileged account; or, at minimum, a dedicated account that is different from the user account you normally use for everyday purposes or for pushing to the FreeBSD source code repository. This minimizes the risk of encountering bugs that can cause data loss or, in worse cases, maliciously planted code. Using an isolated jail also prevents the configure scripts from detecting locally installed software packages, which may lead to unexpected results.
ru: Некоторое открытое программное обеспечение включает скрипт `configure`, который генерирует файлы, используемые для определения процесса сборки кода; обычно эти сгенерированные файлы, такие как `config.h`, должны обновляться как часть процесса импорта. При выполнении этого всегда помните, что эти скрипты являются исполняемым кодом, работающим под учётными данными текущего пользователя. Этот процесс всегда должен запускаться в изолированной среде, в идеале внутри клетки, не имеющей сетевого доступа, и с непривилегированной учётной записью; или, как минимум, с выделенной учётной записью, отличной от той, которую вы обычно используете для повседневных задач или для отправки изменений в репозиторий исходного кода FreeBSD. Это минимизирует риск столкновения с ошибками, которые могут привести к потере данных или, в худших случаях, к выполнению злонамеренно внедрённого кода. Использование изолированной клетки также предотвращает обнаружение скриптами configure локально установленных пакетов программного обеспечения, что может привести к неожиданным результатам.

source: When testing your changes, run them in a chroot or jailed environment, or even within a virtual machine first, especially for kernel or library modifications. This approach helps prevent adverse interactions with your working environment. It can be particularly beneficial for changes to libraries that many base system components use, among others.
ru: При тестировании ваших изменений запускайте их сначала в chroot или в клетке, или даже внутри виртуальной машины, особенно для модификаций ядра или библиотек. Этот подход помогает предотвратить неблагоприятное взаимодействие с вашей рабочей средой. Это может быть особенно полезно для изменений в библиотеках, которые используют многие компоненты базовой системы среди прочего.

source: Rebasing your change against latest FreeBSD source tree
es: Rebasando to cambio contra lo último del árbol de fuentes de FreeBSD
ru: Перебазирование ваших изменений относительно последней версии исходного дерева FreeBSD

source: Because the current policy recommends against using merges, if the upstream FreeBSD `main` moved forward before you get a chance to push, you would have to redo the merge.
es: Puesto que la política actual no recomienda utilizar meges, si el `main` de FreeBSD remoto avanzó antes de que tuvieras oportunidad de hacer el push, tendrías que rehacer el merge.
ru: Поскольку текущая политика рекомендует избегать слияний (merge), то, если вышестоящая ветка FreeBSD `main` продвинулась вперёд до того, как у вас появится возможность отправить изменения, вам придётся переделывать слияние.

source: Regular `git rebase` or `git pull --rebase` doesn't know how to rebase a merge commit **as a merge commit**, so instead of that you would have to recreate the commit.
es: Los `git rebase` o `git pull --rebase` habituales no saben cómo rebasar un commit tipo merge **como un commit merge**, así que tendrías que recrear el commit.
ru: Обычный `git rebase` или `git pull --rebase` не умеет перемещать коммит слияния **как коммит слияния**, поэтому вместо этого вам придётся воссоздать коммит.

source: The following steps should be taken to easily recreate the merge commit as if `git rebase --merge-commits` worked properly:
es: Se deberían seguir los siguientes pasos para facilitar recrear el commit tipo merge como si `git rebase --merge-commits` hubiese funcionado adecuadamente:
ru: Следующие шаги следует выполнить, чтобы легко воссоздать коммит слияния, как если бы `git rebase --merge-commits` сработал правильно:

source: cd to the top of the repo
ru: Перейдите в корень репозитория

source: Create a side branch `XXX` with the **contents** of the merged tree.
ru: Создайте побочную ветвь `XXX` с **содержимым** дерева со слиянием.

source: Update this side branch `XXX` to be merged and up-to-date with FreeBSD's `main` branch.
ru: Обновите эту побочную ветку `XXX` для слияния и актуализации с основной веткой FreeBSD `main`.

source: In the worst case scenario, you would still have to resolve merge conflicts, if there was any, but this should be really rare.
ru: В худшем случае вам всё равно придётся разрешать конфликты слияния, если они были, но это должно быть крайне редко.

source: Resolve conflicts, and collapse multiple commits down to 1 if need be (without conflicts, there's no collapse needed)
ru: Разрешите конфликты и, если необходимо, объедините (collapse) несколько коммитов в один (без конфликтов объединение не требуется)

source: checkout `main`
ru: извлеките (checkout) ветку `main`

source: create a branch `YYY` (allows for easier unwinding if things go wrong)
ru: создайте ветку `YYY` (позволяет проще откатиться, если что-то пойдет не так)

source: Re-do the subtree merge
ru: Повторите слияние поддерева

source: Instead of resolving any conflicts from the subtree merge, checkout the contents of XXX on top of it.
ru: Вместо разрешения конфликтов от слияния поддерева, извлеките (checkout) содержимое XXX поверх него.

source: The trailing `.` is important, as is being at the top level of the repo.
ru: Завершающая `.` важна, как и нахождение на верхнем уровне репозитория.

source: Rather than switching branches to XXX, it splats the contents of XXX on top of the repo
ru: Вместо переключения веток на XXX, он накладывает содержимое XXX поверх репозитория

source: Commit the results with the prior commit message (the example assumes there's only one merge on the XXX branch).
ru: Сделайте коммит полученному результату с предыдущим сообщением коммита (пример предполагает, что в ветке XXX была только одна операция слияния).

source: Make sure the branches are the same.
ru: Убедитесь, что ветки одинаковые.

source: Do whatever review you need, including having others check it out if you think that's needed.
ru: Сделайте любые необходимые проверки, включая привлечение других людей для проверки, если вы считаете, что это необходимо.

source: Push the commit, if you 'lost the race' again, just redo these steps again (see below for a recipe)
ru: Запишите (push) этот коммит. Если вы «снова проиграли в гонке», просто повторите эти шаги (см. рецепт ниже)

source: Delete the branches once the commit is upstream. They are throw-a-way.
ru: Удалите ветки после того, как коммит попадёт в вышестоящий репозиторий. Они одноразовые.

source: The commands one would use, following the above example of mtree, would be like so (the `#` starts a comment to help link commands to descriptions above):
ru: Команды, которые можно использовать, следуя приведённому выше примеру с mtree, будут выглядеть следующим образом (символ `#` начинает комментарий, помогающий связать команды с описаниями выше):

source: Note: if things go wrong with the commit, you can reset the `YYY` branch by reissuing the checkout command that created it with -B to start over:
ru: Примечание: если что-то пойдет не так с коммитом, вы можете сбросить ветку `YYY`, повторно выполнив команду checkout, которая создала её, с флагом -B, чтобы начать заново:

source: % git checkout -B YYY freebsd/main # Create new throw-away YYY branch if starting over is just going to be easier
ru: % git checkout -B YYY freebsd/main # Создать новую временную ветку YYY, если начать заново будет проще

source: Pushing the changes
es: Empujando los cambios
ru: Отправка (push) изменений

source: Once you think you have a set of changes that are good, you can push it to a fork off GitHub or GitLab for others to review. One nice thing about Git is that it allows you to publish rough drafts of your work for others to review. While Phabricator is good for content review, publishing the updated vendor branch and merge commits lets others check the details as they will eventually appear in the repository.
es: Una vez que crees que tienes un conjunto de diferencias que es bueno, puedes empujarlo a un fork de GitHub o Gitlab para que otros lo revisen. Una cosa buena de Git es que te permite publicar borradores de tu trabajo para que otros lo revisen. Mientras que Phabricator es bueno para revisión de contenido, publicar una rama externa actualizada y los commits tipo merge permite a otros comprobar los detalles tal y como aparecerán eventualmente en el repositorio.
ru: Когда вы считаете, что у вас есть набор изменений, и они хорошие, вы можете отправить их в форк на GitHub или GitLab для просмотра и рецензирования другими. Одна из хороших особенностей Git заключается в том, что он позволяет публиковать черновые версии вашей работы для проверки другими. Хотя Phabricator хорош для проверки содержания, публикация обновленной ветки вендора и коммитов слияния позволяет другим проверить детали, которые в конечном итоге появятся в репозитории.

source: After review, when you are sure it is a good change, you can push it to the FreeBSD repo:
es: Después de la revisión, cuando estás seguro de que es un buen cambio, puedes empujarlo al repo de FreeBSD:
ru: После проверки, когда вы уверены, что это хорошее изменение, вы можете отправить (push) его в репозиторий FreeBSD:

source: Note: I used `XXX` and `YYY` to make it obvious they are terrible names and should not leave your machine. If you use such names for other work, then you'll need to pick different names, or risk losing the other work. There is nothing magic about these names. Upstream will not allow you to push them, but never the less, please pay attention to the exact commands above. Some commands use syntax that differs only slightly from typical uses and that different behavior is critical to this recipe working.
ru: Примечание: Я использовал `XXX` и `YYY`, чтобы было очевидно, что это ужасные имена, и они не должны покидать вашу машину. Если вы используете такие имена для другой работы, вам нужно будет выбрать другие имена или рискнуть потерять другую работу. В этих именах нет ничего волшебного. В вышестоящий репозиторий вам не разрешат их отправить, но, тем не менее, обратите внимание на точные команды выше. Некоторые команды используют синтаксис, который лишь незначительно отличается от типичного использования, и это различие в поведении критически важно для работы данного рецепта.

source: How to redo things if need be
es: Como rehacer cosas si es necesario
ru: Как переделать вещи, если это необходимо

source: If you've tried to do the push in the previous section and it fails, then you should do the following to 'redo' things. This sequence keeps the commit with the commit message always at XXX~1 to make committing easier.
es: Si has intentado empujar los cambios de la sección anterior y ha fallado, entonces deberías hacer lo siguiente para 'rehacer' las cosas. Esta secuencia mantiene el commit cno el mensaje de commit simpre en XXX~1 para que sea más fácil.
ru: Если вы попытались выполнить отправку из предыдущего раздела и она завершилась неудачей, то вам следует выполнить следующие действия для «повторного выполнения» операций. Эта последовательность сохраняет коммит с сообщением о коммите всегда на позиции XXX~1 для упрощения коммита.

source: Then go check it out as above and push as above when ready.
ru: Затем проверьте, как описано выше, и отправьте (push), как описано выше, когда будет готово.

source: Creating a new vendor branch
es: Crear una nueva rama externa
ru: Создание новой ветки вендора

source: There are a number of ways to create a new vendor branch. The recommended way is to create a new repository and then merge that with FreeBSD. If one is importing `glorbnitz` into the FreeBSD tree, release 3.1415. For the sake of simplicity, we will not trim this release. It is a simple user command that puts the nitz device into different magical glorb states and is small enough trimming will not save much.
es: Hay varias formas de crear una nueva rama externa. La forma recomendada es crear un nuevo repositorio y después mergearlo con FreeBSD. Supongamos que se importa `glorbnitz` en el árbol de FreeBSD, release 3.1415. Por simplicidad, no recortaremos esta release. Es un simple comando de usuario que pone el dispositivo nitz en diferentes estados mágicos glorb y es suficientemente pequeño como para que recortarlo no ahorre demasiado.
ru: Существует несколько способов создания новой ветки вендора. Рекомендуемый способ — создать новый репозиторий и затем сделать его слияние с FreeBSD. Например, производится импорт `glorbnitz` версии 3.1415 в дерево FreeBSD. Для простоты мы не будем обрезать этот релиз. Это простая пользовательская команда, которая переводит устройство nitz в различные магические состояния glorb, и она достаточно мала, так что обрезка не сэкономит много.

source: Create the repo
es: Crear el repo
ru: Создайте репозиторий

source: At this point, you have a new repo, where all new commits will go on the `vendor/glorbnitz` branch.
ru: На этом этапе у вас есть новый репозиторий, в котором все новые коммиты будут направляться в ветку `vendor/glorbnitz`.

source: Git experts can also do this right in their FreeBSD clone, using `git checkout --orphan vendor/glorbnitz` if they are more comfortable with that.
ru: Опытные пользователи Git также могут сделать это непосредственно в своей копии FreeBSD, используя `git checkout --orphan vendor/glorbnitz`, если им так удобнее.

source: Copy the sources in
es: Copia las fuentes
ru: Скопируйте себе исходники

source: Since this is a new import, you can just cp the sources in, or use tar or even rsync as shown above. And we will add everything, assuming no dot files.
es: Puesto que es una nueva importación, puedes simplemente usar cp, o tar o incluso rsync como se muestra arriba. Y añadiremos todo, asumiendo que no hay ficheros dot.
ru: Поскольку это новая импортированная копия, вы можете просто скопировать файлы исходного кода командой cp, либо использовать tar или даже rsync, как показано выше. И мы добавим всё, предполагая отсутствие файлов с точкой в начале имени.

source: At this point, you should have a pristine copy of glorbnitz ready to commit.
ru: На этом этапе у вас должна быть чистая копия glorbnitz, готовая к коммиту.

source: As above, I used `-m` for simplicity, but you should likely create a commit message that explains what a Glorb is and why you'd use a Nitz to get it. Not everybody will know so, for your actual commit, you should follow the crossref:committers-guide[commit-log-message,commit log message] section instead of emulating the brief style used here.
ru: Как и выше, я использовал `-m` для простоты, но вам, вероятно, следует создать сообщение коммита, которое объясняет, что такое Glorb и почему для его получения используется Nitz. Не все это знают, поэтому для вашего реального коммита вам следует руководствоваться разделом crossref:committers-guide[commit-log-message,сообщение коммита], а не имитировать краткий стиль, использованный здесь.

source: Now import it into our repository
es: Ahora importa en nuestro repositorio
ru: Теперь импортируйте его в наш репозиторий

source: Now you need to import the branch into our repository.
es: Ahora necesitas importar la rama en nuestro repositorio.
ru: Теперь необходимо импортировать ветку в наш репозиторий.

source: Note the vendor/glorbnitz branch is in the repo. At this point the `/some/where/glorbnitz` can be deleted, if you like. It was only a means to an end.
ru: Обратите внимание, что ветка vendor/glorbnitz находится в репозитории. На этом этапе `/some/where/glorbnitz` можно удалить, если хотите. Это было лишь промежуточным шагом для достижения цели.

source: Tag and push
es: Etiquetas y push
ru: Сделайте тег и отправьте (push)

source: Steps from here on out are much the same as they are in the case of updating a vendor branch, though without the updating the vendor branch step.
es: Los pasos desde aquí en adelante son básicamente los mismos que en el caso de la actualización de una rama externa, aunque sin el paso de actualizar la rama externa.
ru: Дальнейшие шаги во многом аналогичны процессу обновления ветки вендора, за исключением самого шага обновления ветки вендора.

source: % git worktree add ../glorbnitz vendor/glorbnitz % cd ../glorbnitz % git tag --annotate vendor/glorbnitz/3.1415 # Make sure the commit is good with "git show" % git push --follow-tags freebsd vendor/glorbnitz
ru: % git worktree add ../glorbnitz vendor/glorbnitz % cd ../glorbnitz % git tag --annotate vendor/glorbnitz/3.1415 # Убедитесь, что коммит хороший, с помощью "git show" % git push --follow-tags freebsd vendor/glorbnitz

source: By 'good' we mean:
ru: Под «хорошим» мы подразумеваем:

source: All the right files are present
ru: Все необходимые файлы присутствуют

source: None of the wrong files are present
ru: Ни один из неправильных файлов не присутствует

source: The vendor branch points at something sensible
ru: Ветка вендора указывает на что-то разумное

source: The tag looks good, and is annotated
ru: Тег выглядит хорошо и имеет аннотацию

source: The commit message for the tag has a quick summary of what's new since the last tag
ru: Сообщение коммита для тега содержит краткую сводку о нововведениях с момента предыдущего тега

source: Time to finally merge it into the base tree
es: Momento de mergear finalmente en el árbol base
ru: Время наконец сделать слияние этого в базовое дерево

source: % cd ../src % git subtree add -P contrib/glorbnitz vendor/glorbnitz # Make sure the commit is good with "git show" % git commit --amend # one last sanity check on commit message % git push freebsd
ru: % cd ../src % git subtree add -P contrib/glorbnitz vendor/glorbnitz # Убедитесь, что коммит хороший, с помощью "git show" % git commit --amend # one last sanity check on commit message % git push freebsd

source: Here 'good' means:
ru: Здесь «хороший» означает:

source: All the right files, and none of the wrong ones, were merged into contrib/glorbnitz.
ru: Все правильные файлы и ни одного неправильного были объединены слиянием в contrib/glorbnitz.

source: No other changes are in the tree.
ru: В дереве нет других изменений.

source: The commit messages look crossref:committers-guide[commit-log-message,good]. It should contain a summary of what's changed since the last merge to the FreeBSD `main` branch and any caveats.
ru: Сообщения коммитов должны выглядеть crossref:committers-guide[commit-log-message,хорошо]. Они должны содержать сводку изменений с момента последнего слияния с основной веткой FreeBSD `main` и любые предостережения.

source: `RELNOTES` and `UPDATING` should be updated if there is anything of note, such as user visible changes, important upgrade concerns, etc.
ru: `RELNOTES` и `UPDATING` должны быть обновлены, если есть что-то важное, например, заметные пользователям изменения, важные аспекты обновления и т.д.

source: This hasn't connected `glorbnitz` to the build yet. How so do that is specific to the software being imported and is beyond the scope of this tutorial.
ru: Это еще не подключило `glorbnitz` к сборке. Способ сделать это зависит от конкретного импортируемого программного обеспечения и выходит за рамки данного руководства.

source: Keeping current
es: Mantenerse actualizado
ru: Сохраняя актуальность

source: So, time passes. It's time now to update the tree for the latest changes upstream. When you checkout `main` make sure that you have no diffs. It's a lot easier to commit those to a branch (or use `git stash`) before doing the following.
es: El tiempo pasa. Es momento de actualizar el árbol con los últimos cambios. Cuando haces un checkout de `main` asegúrate de que no tienes diferencias. Es mucho más fácil hacer commit de esos cambios en una rama (o utilizar `git stash`) antes de hacer lo siguiente.
ru: Итак, время идёт. Пришло время обновить дерево до последних изменений из вышестоящего репозитория. При переходе на ветку `main` (при checkout) убедитесь, что у вас нет незакоммиченных изменений. Намного проще закоммитить их в отдельную ветку (или использовать `git stash`) перед выполнением следующих действий.
