Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/committers-guide/_index.po
Languages: es, ru

source: Next, 'Encourage contributions' was the last commit I made to `wilma` before I decided to split things up. You can also see the same hash is there when I created the `fred` branch to do that. I started by rebasing `fred` and you see the 'start', each step, and the 'finish' for that process. While we don't need it here, you can figure out exactly what happened. Fortunately, to fix this, you can follow the prior answer's steps, but with the hash `869cbd3` instead of `pre-split`. While that seems a bit verbose, it's easy to remember since you're doing one thing at a time. You can also stack:
ru: Далее, 'Encourage contributions' был последним коммитом, который я сделал в `wilma` перед тем, как решил разделить всё. Вы также можете видеть, что тот же хэш присутствует, когда я создал ветку `fred` для этого. Я начал с перебазирования `fred`, и вы видите 'начало', каждый шаг и 'завершение' этого процесса. Хотя нам это здесь не нужно, вы можете точно понять, что произошло. К счастью, чтобы исправить это, вы можете выполнить шаги из предыдущего ответа, но с хэшем `869cbd3` вместо `pre-split`. Хотя это кажется немного многословным, это легко запомнить, поскольку вы делаете одно действие за раз. Вы также можете последовательно применить команды одну за другой:

source: and you are ready to try again. The `checkout -B` with the hash combines checking out and creating a branch for it. The `-B` instead of `-b` forces the movement of a pre-existing branch. Either way works, which is what's great (and awful) about Git. One reason I tend to use `git checkout -B xxxx hash` instead of checking out the hash, and then creating / moving the branch is purely to avoid the slightly distressing message about detached heads:
ru: и вы готовы попробовать снова. Команда `checkout -B` с хэшем объединяет извлечение (checkout) и создание ветки для него. Использование `-B` вместо `-b` принудительно перемещает уже существующую ветку. В любом случае это работает, что и прекрасно (и ужасно) в Git. Одна из причин, по которой я склонен использовать `git checkout -B xxxx хэш` вместо извлечения (checkout) хэша, а затем создания / перемещения ветки, — это чисто чтобы избежать слегка тревожного сообщения об отделённом HEAD:

source: this produces the same effect, but I have to read a lot more and severed heads aren't an image I like to contemplate.
ru: это производит тот же эффект, но мне приходится читать гораздо больше, а отрубленные головы (прим перев.: detached HEAD — отрубленная голова) — не тот образ, который мне нравится созерцать.

source: Ooops! I did a `git pull` and it created a merge commit, what do I do?
es: ¡Ooops! He hecho un `git pull` y he creado un commit tipo merge, ¿qué hago?
ru: Ой! Я выполнил `git pull`, и это создало коммит слияния, что мне делать?

source: **Q:** I was on autopilot and did a `git pull` for my development tree and that created a merge commit on `main`. How do I recover?
es: **Q:** Estaba con el piloto automático y he hecho `git pull` desde mi árbol de desarrollo y eso ha creado un commit tipo merge en la rama `main`. ¿Cómo lo recupero?
ru: **В:** Я действовал на автопилоте и сделал `git pull` для своего дерева разработки, что создало коммит слияния в `main`. Как мне восстановиться?

source: **A:** This can happen when you invoke the pull with your development branch checked out.
es: **A:** Esto puede pasar cuando invocas el pull con un checkout de tu rama de desarrollo.
ru: **О:** Это может произойти, когда вы выполняете извлечение (checkout) с выбранной веткой разработки.

source: Many developers use `git pull --rebase` to avoid this situation.
ru: Многие разработчики используют `git pull --rebase`, чтобы избежать этой ситуации.

source: Right after the pull, you will have the new merge commit checked out. Git supports a `HEAD^#` syntax to examine the parents of a merge commit:
ru: Сразу после получения и слияния (pull) у вас в рабочую копию будет извлечен новый коммит слияния. Git поддерживает синтаксис `HEAD^#` для определения родителей коммита слияния:

source: From those logs, you can easily identify which commit is your development work. Then you simply reset your branch to the corresponding `HEAD^#`:
ru: Из этих журналов вы можете легко определить, какой коммит является вашей разработкой. Затем вы просто сбрасываете свою ветку к соответствующему `HEAD^#`:

source: In addition, a `git pull --rebase` at this stage will rebase your changes to 'main' to the latest 'freebsd/main'.
ru: Кроме того, команда `git pull --rebase` на этом этапе перебазирует ваши изменения из ветки 'main' на последнюю версию 'freebsd/main'.

source: **Q:** But I also need to fix my `main` branch. How do I do that?
es: **Q:** Pero también necesito arreglar mi rama `main`. ¿Cómo lo hago?
ru: **В:** Но мне также нужно исправить мою ветку `main`. Как мне это сделать?

source: **A:** Git keeps track of the remote repository branches in a `freebsd/` namespace. To fix your `main` branch, just make it point to the remote's `main`:
es: **A:** Git controla las ramas del repositorio remoto en el espacio de nombres `freebsd/`. Para arreglar tu rama `main`, simplemente ponla apuntando al `main` de tu remoto:
ru: **О:** Git отслеживает ветки удалённого репозитория в пространстве имён `freebsd/`. Чтобы исправить вашу ветку `main`, просто заставьте её указывать на удалённую ветку `main`:

source: There's nothing magical about branches in Git: they are just labels on a graph that are automatically moved forward by making commits. So the above works because you're just moving a label. There's no metadata about the branch that needs to be preserved due to this.
ru: Ветви в Git не имеют ничего магического: они всего лишь метки на графе, которые автоматически перемещаются вперед при создании коммитов. Так что вышеописанное работает, потому что вы просто перемещаете метку. Из-за этого нет никаких метаданных о ветке, которые нужно было бы сохранять.

source: Mixing and matching branches
es: Mezclando y combinando ramas
ru: Смешивание и сопоставление веток

source: **Q:** So I have two branches `worker` and `async` that I'd like to combine into one branch called `feature` while maintaining the commits in both.
es: **Q:** Digamos que tengo dos ramas `worker` y `async` que me gustaría combinar en una rama llamada `feature` a la vez que mantengo los commits de ambas.
ru: **В:** Итак, у меня есть две ветки `worker` и `async`, которые я хочу объединить в одну ветку под названием `feature` с сохранением коммитов в обеих.

source: **A:** This is a job for cherry pick.
es: **A:** Esto es trabajo para cherry pick.
ru: **О:** Это задача для выборочного применения (cherry-pick).

source: You now have a new branch called `feature`. This branch combines commits from both branches. You can further curate it with `git rebase`.
ru: Теперь у вас есть новая ветка под названием `feature`. Эта ветка объединяет коммиты из обеих веток. Вы можете далее работать с ней с помощью `git rebase`.

source: **Q:** I have a branch called `driver` and I'd like to break it up into `kernel` and `userland` so I can evolve them separately and commit each branch as it becomes ready.
es: **Q:** Tengo una rama llamada `driver` y me gustaría partirla en `kernel` y `userland` de forma que pueda hacerlas evolucionar por separado y hacer commit en cada rama cuando estén listas.
ru: **В:** У меня есть ветка под названием `driver`, и я хочу разделить её на `kernel` и `userland`, чтобы развивать их отдельно и коммитить каждую ветку по мере её готовности.

source: **A:** This takes a little bit of prep work, but `git rebase` will do the heavy lifting here.
es: **A:** Esto necesita un poco de trabajo preparatorio, pero `git rebase` hará todo el trabajo duro.
ru: **О:** Это требует небольшой подготовительной работы, но `git rebase` выполнит здесь основную часть работы.

source: Now you have two identical branches. So, it's time to separate out the commits. We'll assume first that all the commits in `driver` go into either the `kernel` or the `userland` branch, but not both.
ru: Теперь у вас есть две идентичные ветки. Значит, пришло время разделить коммиты. Мы предположим, что сначала все коммиты в ветке `driver` попадут либо в ветку `kernel`, либо в ветку `userland`, но не в обе одновременно.

source: and just include the changes you want (with a 'p' or 'pick' line) and just delete the commits you don't (this sounds scary, but if worse comes to worse, you can throw this all away and start over with the `driver` branch since you've not yet moved it).
ru: и просто включите изменения, которые вы хотите (строкой 'p' или 'pick'), и удалите коммиты, которые не нужны (это звучит пугающе, но в худшем случае вы всегда можете всё отбросить и начать заново с ветки `driver`, если вы только её не переместили).

source: and do the same thing you did with the `kernel` branch.
ru: и сделайте то же самое, что вы сделали с веткой `kernel `.

source: **Q:** Oh great! I followed the above and forgot a commit in the `kernel` branch. How do I recover?
es: **Q:** ¡Oh, genial! Seguí las instrucciones de arriba y me olvidé de hacer commit en la rama `kernel`. ¿Cómo lo arreglo?
ru: **В:** Отлично! Я выполнил указанные выше шаги и забыл сделать коммит в ветке `kernel`. Как мне восстановиться?

source: **A:** You can use the `driver` branch to find the hash of the commit is missing and cherry pick it.
es: **A:** Puedes usar la rama `driver` para encontrar el hash del commit que falta y seleccionarlo con cherry pick.
ru: **О:** Вы можете использовать ветку `driver`, чтобы найти хэш коммита, который отсутствует, и выборочно применить его (cherry-pick).

source: **Q:** OK. I have the same situation as the above, but my commits are all mixed up. I need parts of one commit to go to one branch and the rest to go to the other. In fact, I have several. Your rebase method to select sounds tricky.
es: **Q:** OK. Tengo la misma situación que arriba, pero mis commits están todos mezclados. Necesito que partes de un commit vayan a una rama y el resto a otra. De hecho, tengo varias. Tu método basado en rebase suena complicado.
ru: **В:** Хорошо. У меня такая же ситуация, как и выше, но мои коммиты все перемешаны. Мне нужно, чтобы части одного коммита попали в одну ветку, а остальные — в другую. На самом деле, у меня их несколько. Ваш метод перебазирования с выбором кажется сложным.

source: **A:** In this situation, you'd be better off to curate the original branch to separate out the commits, and then use the above method to split the branch.
es: **A:** En esta situación, lo mejor sería filtrar la rama original para separar los commits y luego usar el método descrito arriba para separar las ramas.
ru: **О:** В этой ситуации вам лучше обработать исходную ветку, чтобы отделить коммиты, а затем использовать вышеуказанный метод для разделения ветки.

source: So let's assume that there's just one commit with a clean tree. You can either use `git rebase` with an `edit` line, or you can use this with the commit on the tip. The steps are the same either way. The first thing we need to do is to back up one commit while leaving the changes uncommitted in the tree:
ru: Итак, предположим, что есть всего один коммит с чистым деревом. Вы можете использовать либо `git rebase` со строкой `edit`, либо это с коммитом на острие. В любом случае шаги одинаковы. Первое, что нам нужно сделать, — это откатиться на один коммит назад, оставив изменения незакоммиченными в дереве:

source: Note: Do not, repeat do not, add `--hard` here since that also removes the changes from your tree.
ru: Примечание: НЕ, повторяю, НЕ добавляйте здесь `--hard`, так как это также удалит изменения из вашего дерева.

source: Now, if you are lucky, the change needing to be split up falls entirely along file lines. In that case you can just do the usual `git add` for the files in each group than do a `git commit`. Note: when you do this, you'll lose the commit message when you do the reset, so if you need it for some reason, you should save a copy (though `git log $HASH` can recover it).
ru: Теперь, если вам повезёт, изменения, которые нужно разделить, полностью укладываются по границам файлов. В этом случае вы можете просто выполнить обычный `git add` для файлов в каждой группе, а затем сделать `git commit`. Примечание: при этом вы потеряете сообщение коммита при выполнении сброса, поэтому если оно вам по какой-то причине нужно, следует сохранить копию (хотя `git log $HASH` может его восстановить).

source: If you are not lucky, you'll need to split apart files. There's another tool to do that which you can apply one file at a time.
ru: Если вам не повезло, вам придётся разделять файлы. Для этого существует ещё один инструмент, который можно применять по одному файлу за раз.

source: will step through the diffs, prompting you, one at time, whether to include or exclude the hunk. Once you're done, `git commit` and you'll have the remainder in your tree. You can run it multiple times as well, and even over multiple files (though I find it easier to do one file at a time and use the `git rebase -i` to fold the related commits together).
ru: будет последовательно проходить через различия, предлагая вам включить или исключить каждый фрагмент. После завершения, выполните `git commit`, и оставшиеся изменения окажутся в вашем дереве. Вы также можете запускать эту команду несколько раз, даже для нескольких файлов (хотя я считаю удобнее работать с одним файлом за раз и использовать `git rebase -i` для объединения связанных коммитов).

source: Joining the FreeBSD GitHub oranization.
ru: Присоединение к организации FreeBSD на GitHub.

source: **Q:** How do I join the FreeBSD GitHub organization?
ru: **В:** Как присоединиться к организации FreeBSD на GitHub?

source: **A:** Please see https://wiki.freebsd.org/GitHub#Joining_the_Organisation[our GitHub Wiki Info] page for details. Briefly, all FreeBSD committers may join. Those who are not committers who request joining will be considered on a case by case basis.
ru: **О:** Подробности смотрите на странице https://wiki.freebsd.org/GitHub#Joining_the_Organisation[нашей вики GitHub]. Вкратце, присоединиться могут все коммиттеры FreeBSD. Лица, не являющиеся коммиттерами, которые запрашивают присоединение, будут рассматриваться в индивидуальном порядке.

source: Cloning and Mirroring
es: Clonar y Duplicar (crear un mirror)
ru: Клонирование и зеркалирование

source: **Q:** I'd like to mirror the entire Git repository, how do I do that?
es: **Q:** Me gustaría crear un mirror de todo el repositorio Git, ¿cómo lo hago?
ru: **В:** Я хочу создать полную зеркальную копию репозитория Git, как мне это сделать?

source: **A:** If all you want to do is mirror, then
es: **A:** Si todo lo que quieres es un mirror, entonces
ru: **О:** Если вам нужно только зеркалирование, то

source: will do the trick. However, there are two disadvantages to this if you want to use it for anything other than a mirror you'll reclone.
ru: сработает. Однако, у этого есть два недостатка, если вы хотите использовать это для чего-то кроме зеркала, которое вы будете переклонировать.

source: First, this is a 'bare repository' which has the repository database, but no checked out worktree. This is great for mirroring, but terrible for day to day work. There's a number of ways around this with `git worktree`:
ru: Во-первых, это 'голый репозиторий', который содержит базу данных репозитория, но не имеет извлеченного рабочего дерева. Это отлично подходит для зеркалирования, но ужасно для повседневной работы. Существует несколько способов обойти это с помощью `git worktree`:

source: But if you aren't using your mirror for further local clones, then it's a poor match.
ru: Но если вы не используете свой зеркальный репозиторий для дальнейшего локального клонирования, то это неподходящий выбор.

source: The second disadvantage is that Git normally rewrites the refs (branch name, tags, etc) from upstream so that your local refs can evolve independently of upstream. This means that you'll lose changes if you are committing to this repository on anything other than private project branches.
ru: Второй недостаток заключается в том, что Git обычно перезаписывает ссылки из вышестоящего репозитория (названия веток, теги и т.д.) , чтобы ваши локальные ссылки могли изменяться независимо от вышестоящего репозитория. Это означает, что вы потеряете изменения, если будете коммитить в свой репозиторий куда-либо, кроме веток приватных проектов.

source: **Q:** So what can I do instead?
es: **Q:** ¿Qué puedo hacer entonces?
ru: **В:** Так что же я могу сделать вместо этого?

source: **A:** Well, you can stuff all of the upstream repository's refs into a private namespace in your local repository. Git clones everything via a 'refspec' and the default refspec is:
es: **A:** Puedes agrupar todas las refs del repositorio remoto en un espacio de nombres privado en tu repositorio local. Git clona todo mediante un 'refspec' y el refspec por defecto es:
ru: **О:** Ну, вы можете поместить все ссылки (refs) вышестоящего репозитория в приватное пространство имён вашего локального репозитория. Git клонирует всё через 'refspec', и refspec по умолчанию выглядит так:

source: which says just fetch the branch refs.
ru: что говорит просто получить (fetch) ссылки веток.

source: However, the FreeBSD repository has a number of other things in it. To see those, you can add explicit refspecs for each ref namespace, or you can fetch everything. To setup your repository to do that:
ru: Однако в репозитории FreeBSD есть и ряд других элементов. Чтобы увидеть их, вы можете добавить явные спецификации ссылок для каждого пространства имен ссылок или получить всё. Чтобы настроить ваш репозиторий для этого:

source: which will put everything in the upstream repository into your local repository's `refs/freebsd/` namespace. Please note, that this also grabs all the unconverted vendor branches and the number of refs associated with them is quite large.
ru: что поместит всё из вышестоящего репозитория в пространство имён `refs/freebsd/` вашего локального репозитория. Обратите внимание, что это также захватывает все несконвертированные ветки вендоров, а количество связанных с ними ссылок довольно велико.

source: You'll need to refer to these 'refs' with their full name because they aren't in and of Git's regular namespaces.
ru: Вам потребуется ссылаться на эти ссылки с их полными именами, поскольку они не входят в обычные пространства имён Git.

source: would look at the log for the vendor branch for zlib starting at 1.2.10.
ru: будет просматривать журнал ветки вендора для zlib, начиная с версии 1.2.10.

source: Collaborating with others
es: Colaborando con otros
ru: Сотрудничество с другими

source: One of the keys to good software development on a project as large as FreeBSD is the ability to collaborate with others before you push your changes to the tree. The FreeBSD project's Git repositories do not, yet, allow user-created branches to be pushed to the repository, and therefore if you wish to share your changes with others you must use another mechanism, such as a hosted GitLab or GitHub, to share changes in a user-generated branch.
es: Una de las claves para un buen desarrollo de software en un proyecto tan grande como FreeBSD es la habilidad para colaborar con otros antes de que empujes tus cambios al árbol. Los repositorios Git del proyecto FreeBSD todavía no permiten la creación de ramas de usuario que puedan ser empujadas al repositorio y por lo tanto si quieres compartir tus cambios con otros debes usar otro mecanismo como GitLab o GitHub, para compartir los cambios en una rama generada por el usuario.
ru: Одним из ключевых моментов качественной разработки программного обеспечения в таком крупном проекте, как FreeBSD, является возможность сотрудничать с другими участниками до отправки своих изменений в дерево исходного кода. Репозитории Git проекта FreeBSD пока не позволяют отправлять пользовательские ветки в репозиторий, поэтому если вы хотите поделиться своими изменениями с другими, вам необходимо использовать другой механизм, например, репозиторий, размещённый в GitLab или GitHub, для обмена изменениями в ветке, созданной пользователем.

source: The following instructions show how to set up a user-generated branch, based on the FreeBSD `main` branch, and push it to GitHub.
es: Las siguientes instrucciones muestran cómo preparar una rama de usuario, basada en la rama `main` de FreeBSD y cómo empujarla a GitHub.
ru: Следующие инструкции показывают, как создать пользовательскую ветку на основе ветки FreeBSD `main` и отправить её в GitHub.

source: Before you begin, make sure that your local Git repo is up to date and has the correct origins set crossref:committers-guide[keeping_current,as shown above].
ru: Прежде чем начать, убедитесь, что ваш локальный репозиторий Git актуален и имеет правильно настроенные источники, как показано в разделе crossref:committers-guide[keeping_current,выше].

source: The first step is to create a fork of https://github.com/freebsd/freebsd-src[FreeBSD] on GitHub following these https://docs.github.com/en/github/getting-started-with-github/fork-a-repo[guidelines]. The destination of the fork should be your own, personal, GitHub account (gvnn3 in my case).
es: El primer paso es crear un fork de https://github.com/freebsd/freebsd-src[FreeBSD] en GitHub siguiendo estas https://docs.github.com/en/github/getting-started-with-github/fork-a-repo[instrucciones]. El destino del fork debería ser tu propia cuenta personal de GitHub (en mi caso gvnn3).
ru: Первым шагом является создание форка https://github.com/freebsd/freebsd-src[FreeBSD] на GitHub, следуя этим https://docs.github.com/en/github/getting-started-with-github/fork-a-repo[инструкциям]. Назначением форка должен быть ваш собственный, личный аккаунт на GitHub (в моём случае gvnn3).

source: Now add a remote on your local system that points to your fork:
ru: Теперь добавьте удаленный репозиторий в вашей локальной системе, который указывает на ваш форк:

source: With this in place you can create a branch crossref:committers-guide[keeping_a_local_branch,as shown above].
ru: В этом репозитории вы можете создать ветку crossref:committers-guide[keeping_a_local_branch,как показано выше].

source: Make whatever modifications you wish in your branch. Build, test, and once you're ready to collaborate with others it's time to push your changes into your hosted branch. Before you can push you'll have to set the appropriate upstream, as Git will tell you the first time you try to push to your +github+ remote:
ru: Вносите любые изменения в своей ветке. Собирайте, тестируйте, и как только будете готовы к совместной работе с другими, настанет время отправить свои изменения в ветку, размещённую в GitHub. Прежде чем отправить изменения, вам нужно будет установить соответствующую вышестоящую ветку (upstream), о чём Git сообщит при первой попытке отправки в ваш удалённый репозиторий +github+:

source: Setting the push as +git+ advises allows it to succeed:
ru: Если установить параметры отправки (push) так, как советует +git+, то это позволяет ему успешно выполниться:

source: Subsequent changes to the same branch will push correctly by default:
ru: Последующие изменения в той же ветке будут по умолчанию отправляться корректно:

source: At this point your work is now in your branch on +GitHub+ and you can share the link with other collaborators.
ru: На этом этапе ваша работа находится в вашей ветке на +GitHub+, и вы можете поделиться ссылкой с другими участниками.

source: Landing a github pull request
es: Traer al proyecto una pull request de github
ru: Обработка запросов на принятие изменений (pull request) на github
