<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: 1.136
-->

<chapter id="x11">
  <title>Le syst&egrave;me X Window</title>
  &trans.a.fonvieille;

  <sect1 id="x11-synopsis">
    <title>Synopsis</title>

    <para>FreeBSD utilise <application>&xfree86;</application> pour fournir aux
      utilisateurs une interface graphique puissante.
      <application>&xfree86;</application> est une impl&eacute;mentation
      &ldquo;open-source&rdquo; du syst&egrave;me X Window.  Ce chapitre
      couvrira l'installation et la configuration
      d'<application>&xfree86;</application> sur un syst&egrave;me FreeBSD.
      Pour plus d'informations sur <application>&xfree86;</application> et le
      mat&eacute;riel vid&eacute;o qu'il supporte, visitez le site d'<ulink
      url="http://www.XFree86.org/">&xfree86;</ulink>.</para>

    <para>Apr&egrave;s la lecture de ce chapitre, vous conna&icirc;trez:</para>
    <itemizedlist>
      <listitem>
	<para>Les divers composants du syst&egrave;me X Window et comment ils
	  fonctionnent ensemble.</para>
      </listitem>
      <listitem><para>Comment installer et configurer
	<application>&xfree86;</application>.</para></listitem>
      <listitem><para>Comment installer et utiliser diff&eacute;rents
	gestionnaires de fen&ecirc;tres.</para></listitem>
      <listitem><para>Comment utiliser les polices de caract&egrave;res
	&truetype; sous <application>&xfree86;</application>.</para></listitem>
      <listitem><para>Comment configurer votre syst&egrave;me pour
	l'utilisation de proc&eacute;dures de connexions graphiques
	(<application>XDM</application>).</para></listitem>
    </itemizedlist>

    <para>Avant de lire ce chapitre, vous devrez:</para>

    <itemizedlist>
      <listitem><para>Savoir comment installer des logiciels tiers
	(<xref linkend="ports">).</para></listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="x-understanding">
    <title>Comprendre X</title>

    <para>Utiliser X pour la premi&egrave;re fois peut &ecirc;tre en
      quelque sorte un choc pour quelqu'un de familier avec d'autres
      environnements graphiques, tels que &microsoft.windows; ou
      &macos;.</para>

    <para>Il n'est pas n&eacute;cessaire de comprendre tout le d&eacute;tail
      des divers composants de X ni comment ils interagissent entre eux;
      cependant, une certaine connaissance des bases permet de tirer
      profit des points forts d'X.</para>

    <sect2>
      <title>Pourquoi X?</title>

      <para>X n'est pas le premier syst&egrave;me de fen&ecirc;trage
	&eacute;crit pour &unix;, mais c'est le plus populaire.  L'&eacute;quipe
	originelle de d&eacute;veloppement d'X avait travaill&eacute;
	sur un autre syst&egrave;me de fen&ecirc;trage avant d'&eacute;crire X.
	Le nom de ce syst&egrave;me &eacute;tait
	&ldquo;W&rdquo; (pour &ldquo;Window&rdquo; - fen&ecirc;tre).  X est
	juste la lettre suivante dans l'alphabet romain.</para>

      <para>X peut &ecirc;tre appel&eacute; &ldquo;X&rdquo;,
	&ldquo;Syst&egrave;me X Window&rdquo;, &ldquo;X11&rdquo;, et autres
	noms.  Nommer X11 &ldquo;X Windows&rdquo; peut offenser
	certaines personnes; voir &man.X.7; pour un peu plus
	d'&eacute;clairements sur la question.</para>
    </sect2>

    <sect2>
      <title>Le mod&egrave;le client/serveur d'X</title>

      <para>X a &eacute;t&eacute; con&ccedil;u d&egrave;s le d&eacute;part
	autour de la notion de r&eacute;seau, et adopte un mod&egrave;le
	&ldquo;client-serveur&rdquo;.
	Dans le mod&egrave;le X, le &ldquo;serveur X&rdquo; tourne sur
	l'ordinateur sur lequel sont branch&eacute;s le clavier, le moniteur,
	et la souris.  Le serveur est responsable de la gestion de
	l'affichage, des entr&eacute;es en provenance du clavier et de la
	souris, etc...
	Chaque application X (comme <application>XTerm</application>, ou
	<application>&netscape;</application>) est un
	&ldquo;client&rdquo;.  Un client envoie des messages au serveur
	comme &ldquo;Dessines une fen&ecirc;tre aux coordonn&eacute;es
	suivantes&rdquo;, et le serveur envoie au client des messages du
	type &ldquo;L'utilisateur vient de cliquer sur le bouton
	OK&rdquo;.</para>

      <para>S'il n'y a qu'un seul ordinateur impliqu&eacute;, comme chez soi
	ou dans un petit bureau, le serveur X et les clients X
	tourneront sur le m&ecirc;me ordinateur.  Cependant, il est
	parfaitement possible de faire tourner le serveur X sur un
	ordinateur de bureau moins puissant, et les applications X (les
	clients) sur, par exemple, la machine puissante et ch&egrave;re du
	service.  Dans ce sc&eacute;nario la communication entre le client X et
	le serveur se fera par l'interm&eacute;diaire du r&eacute;seau.</para>

      <para>Cela jette le trouble chez certaines personnes, parce que la
	technologie X est exactement le contraire de ce &agrave; quoi ils
	s'attendent.  Ils s'attendent &agrave; ce que le
	&ldquo;serveur X&rdquo; soit la grosse machine puissante au fond
	du couloir, et le &ldquo;client X&rdquo; la machine sur leur
	bureau.</para>

      <para>Souvenez-vous que le serveur X est la machine avec le
	moniteur et le clavier, et les clients X sont les programmes qui
	affichent les fen&ecirc;tres.</para>

      <para>Il n'y a rien dans le protocole qui force les machines
	clientes et serveurs d'utiliser le m&ecirc;me syst&egrave;me
	d'exploitation, ou m&ecirc;me de tourner sur le m&ecirc;me type
	d'ordinateur.  Il est certainement possible de faire fonctionner
	un serveur X sur &microsoft.windows; ou &macos; d'Apple, et il
	existe diverses applications gratuites et commerciales qui font
	exactement cela.</para>

      <para>Le serveur X livr&eacute; avec FreeBSD est appel&eacute;
	<application>&xfree86;</application>, et est disponible
	gratuitement, sous une licence tr&egrave;s proche de la licence
	FreeBSD.  Des serveurs X commerciaux pour FreeBSD sont &eacute;galement
	disponibles.</para>
    </sect2>

    <sect2>
      <title>Le gestionnaire de fen&ecirc;tres</title>

      <para>La philosophie de conception d'X est comme celle d'&unix;,
	&ldquo;des outils, pas de contraintes&rdquo;.  Cela signifie
	qu'X n'essaye pas de dicter comment une t&acirc;che doit &ecirc;tre
	accomplie.  A la place, les outils sont fournis &agrave;
	l'utilisateur, et c'est &agrave; lui de d&eacute;cider comment
	utiliser ces outils.</para>

      <para>Cette philosophie va jusqu'&agrave; pousser X &agrave; ne pas
	contr&ocirc;ler l'aspect des fen&ecirc;tres &agrave; l'&eacute;cran,
	comment les d&eacute;placer avec la souris, quelles combinaisons
	de touches devraient &ecirc;tre utilis&eacute;es pour passer
	de l'une &agrave; l'autre (i.e.,
	<keycombo action="simul">
	  <keycap>Alt</keycap>
	  <keycap>Tab</keycap>
	</keycombo>, dans le cas de &microsoft.windows;), comment
	devraient &ecirc;tre les barres de titre de chaque fen&ecirc;tres,
	qu'elles aient ou pas des boutons de fermetures, etc...</para>

      <para>Au lieu de cela, X d&eacute;l&egrave;gue cette
	responsabilit&eacute; &agrave; une application appel&eacute;e
	un &ldquo;Window Manager&rdquo; - gestionnaire de fen&ecirc;tres.
	Il existe des douzaines de gestionnaires de fen&ecirc;tres
	disponibles pour X: <application>AfterStep</application>,
	<application>Blackbox</application>, <application>ctwm</application>,
	<application>Enlightenment</application>,
	<application>fvwm</application>, <application>Sawfish</application>,
	<application>twm</application>,
	<application>Window Maker</application>, et bien plus.  Chacun
	de ces gestionnaires de fen&ecirc;tres fournit une apparence et une
	prise en main diff&eacute;rente; certains d'entre eux supportent les
	&ldquo;bureaux virtuels&rdquo;; d'autres permettent de
	personnaliser les combinaisons de touches de gestion du bureau;
	certains ont un bouton &ldquo;D&eacute;marrer&rdquo; ou quelque chose
	d'identique; certains poss&egrave;dent un syst&egrave;me de
	&ldquo;th&egrave;mes&rdquo;, permettant un changement complet
	d'apparence et de prise en main en s&eacute;lectionnant un nouveau
	th&egrave;me.  Ces gestionnaires de fen&ecirc;tres, et bien plus, sont
	disponibles dans la cat&eacute;gorie <filename>x11-wm</filename> du
	catalogue des logiciels port&eacute;s.</para>

      <para>De plus, les environnements de travail
	<application>KDE</application> et <application>GNOME</application>
	ont leur propre gestionnaire de fen&ecirc;tres qui s'int&egrave;gre
	avec l'environnement.</para>

      <para>Chaque gestionnaire de fen&ecirc;tres poss&egrave;de
	&eacute;galement
	un m&eacute;canisme de configuration propre; certains demandent un
	fichier de configuration &eacute;crit &agrave; la main, d'autres
	disposent d'outils graphiques pour la plupart des t&acirc;ches
	de configuration; et au moins un
	(<application>sawfish</application>) utilise un fichier de
	configuration &eacute;crit dans un dialecte du langage LISP.</para>

      <note>
	<title>Politique de focus</title>

	<para>Une autre fonction dont est responsable le gestionnaire de
	  fen&ecirc;tre est la &ldquo;politique de focus&rdquo; de la
	  souris.  Chaque syst&egrave;me de fen&ecirc;trage a besoin de
	  m&eacute;thodes de choix de la fen&ecirc;tre qui doit recevoir
	  les frappes au clavier, et devrait &eacute;galement indiquer
	  visiblement quelle fen&ecirc;tre est active.</para>

	<para>Une politique de focus commune est appel&eacute;e
	  &ldquo;click-to-focus&rdquo; (cliquer pour obtenir le focus).
	  C'est le mode utilis&eacute; sous &microsoft.windows;, dans lequel une
	  fen&ecirc;tre devient active quand elle re&ccedil;oit un clic de la
	  souris.</para>

	<para>X ne supporte aucune politique de focus particuli&egrave;re.
	  Au lieu de cela, le gestionnaire de fen&ecirc;tres contr&ocirc;le
	  quelle fen&ecirc;tre a le focus &agrave; n'importe quel moment.
	  Diff&eacute;rents gestionnaires de fen&ecirc;tres supporteront
	  diff&eacute;rentes m&eacute;thodes de focus.  Tous supportent le
	  clic pour obtenir le focus, une grande majorit&eacute; supporte
	  d'autres m&eacute;thodes.</para>

	<para>Les politiques de focus les plus populaires sont:</para>

	<variablelist>
	  <varlistentry>
	    <term>&ldquo;focus-follows-mouse&rdquo; - le focus suit la
	      souris</term>

	    <listitem>
	      <para>La fen&ecirc;tre qui est sous le pointeur de la souris
		est la fen&ecirc;tre qui a le focus.  Ce n'est pas
		n&eacute;cessairement la fen&ecirc;tre qui est au-dessus des
		autres.  Le focus est modifi&eacute; en pointant une autre
		fen&ecirc;tre, l&agrave; il n'y pas besoin de cliquer sur
		la fen&ecirc;tre.</para>
	    </listitem>
	  </varlistentry>

	  <varlistentry>
	    <term>&ldquo;sloppy-focus&rdquo; - focus relach&eacute;</term>

	    <listitem>
	      <para>Cette politique est version d&eacute;riv&eacute;e du
		&ldquo;focus-follows-mouse&rdquo;.  Avec
		&ldquo;focus-follows-mouse&rdquo;, si la souris est
		d&eacute;plac&eacute;e sur la fen&ecirc;tre racine
		(ou fond de l'&eacute;cran) alors aucune fen&ecirc;tre
		n'a le focus, et les frappes au clavier sont tout simplement
		perdues.  Avec le focus relach&eacute;, le focus n'est
		modifi&eacute; que si le pointeur passe sur une nouvelle
		fen&ecirc;tre, et non pas quand il quitte la
		fen&ecirc;tre actuelle.</para>
	    </listitem>
	  </varlistentry>

	  <varlistentry>
	    <term>&ldquo;click-to-focus&rdquo; - cliquer pour obtenir le
	      focus</term>

	    <listitem>
	      <para>La fen&ecirc;tre active est s&eacute;lectionn&eacute;e
		par clic de la souris.  La fen&ecirc;tre peut &ecirc;tre
		ramen&eacute;e au premier plan.  Toutes les frappes au
		clavier seront d&eacute;sormais dirig&eacute;es vers cette
		fen&ecirc;tre, m&ecirc;me si le curseur est
		d&eacute;plac&eacute; vers une autre fen&ecirc;tre.</para>
	    </listitem>
	  </varlistentry>
	</variablelist>

	<para>De nombreux gestionnaires de fen&ecirc;tres supportent d'autres
	  politiques, comme des variations de celles-ci.  Assurez-vous
	  de consulter la documentation du gestionnaire de
	  fen&ecirc;tres.</para>
      </note>
    </sect2>

    <sect2>
      <title>&ldquo;Widgets&rdquo; - El&eacute;ments graphiques</title>

      <para>L'approche d'X d'offir uniquement des outils s'&eacute;tend aux
	&eacute;l&eacute;ments graphiques que l'on voit &agrave; l'&eacute;cran
	dans chaque application.</para>

      <para>&ldquo;Widget&rdquo; est un terme pour d&eacute;signer tous les
	&eacute;l&eacute;ments de l'interface utilisateur qui peuvent
	&ecirc;tre cliqu&eacute;s ou manipul&eacute;s d'une fa&ccedil;on
	ou d'une autre; boutons, bo&icirc;tes &agrave; cocher, boutons radio,
	ic&ocirc;nes, listes, etc...  &microsoft.windows; appelle ces derniers des
	&ldquo;contr&ocirc;les&rdquo;.</para>

      <para>&microsoft.windows; et &macos; d'Apple ont tous deux une
	politique tr&egrave;s rigide au niveaux des
	&eacute;l&eacute;ments graphiques.  Les d&eacute;veloppeurs
	d'applications sont suppos&eacute;s s'assurer que leurs applications
	partagent une apparence et une prise en main commune.  Avec X,
	on n'a pas consid&eacute;r&eacute; comme sensible d'exiger un style
	graphique particulier, ou ensemble d'&eacute;l&eacute;ments
	graphiques &agrave; respecter.</para>

      <para>En cons&eacute;quence, ne vous attendez pas &agrave; ce que les
	applications X aient une apparence et une prise en main
	communes.  Il a plusieurs ensembles populaires d'&eacute;l&eacute;ments
	graphiques et leurs variations, dont l'ensemble d'&eacute;l&eacute;ments
	original Athena du MIT, <application>&motif;</application>
	(d'apr&egrave;s lequel f&ucirc;t model&eacute; l'ensemble
	d'&eacute;l&eacute;ments graphiques de &microsoft.windows;, tous les
	bords biseaut&eacute;s et trois nuances de gris),
	<application>OpenLook</application>, et d'autres.</para>

      <para>La plupart des nouvelles applications X, aujourd'hui
	utiliseront un ensemble d'&eacute;l&eacute;ments graphiques &agrave;
	l'apparence
	moderne, soit Qt, utilis&eacute; par <application>KDE</application>,
	soit <application>GTK</application>, utilis&eacute; par le projet
	<application>GNOME</application>.  A cet &eacute;gard, il y a une
	certaine convergence dans l'apparence et la prise en main de
	l'environnement de travail &unix;, qui facilite certainement les
	choses pour l'utilisateur d&eacute;butant.</para>
    </sect2>
  </sect1>

  <sect1 id="x-install">
    <title>Installer &xfree86;</title>

    <para>Avant d'installer <application>&xfree86;</application>, d&eacute;cidez
      quelle version utiliser.
      <application>&xfree86; 3.X</application> est une branche de
      maintenance du d&eacute;veloppement d'<application>&xfree86;</application>.
      Cette version est
      tr&egrave;s stable, et supporte un grand nombre de cartes graphiques.
      Cependant, aucun nouveau d&eacute;veloppement n'est fait sur le logiciel.
      <application>&xfree86; 4.X</application> est une compl&egrave;te
      reconception du syst&egrave;me avec de nombreuses nouvelles
      caract&eacute;ristiques comme un meilleur support des polices de
      caract&egrave;res et de l'anticr&eacute;nelage.  Malheureusement cette
      nouvelle architecture demande &agrave; ce que les pilotes des
      p&eacute;riph&eacute;riques
      vid&eacute;os soient r&eacute;&eacute;crits, et certaines des plus
      anciennes cartes qui &eacute;taient support&eacute;es sous la
      version 3.X ne le sont pas encore par la version 4.X.  Comme tous
      les nouveaux d&eacute;veloppements et supports pour les nouvelles cartes
      graphiques sont faits sur cette branche, <application>&xfree86;
      4.X</application> est d&eacute;sormais la version par d&eacute;faut
      du syst&egrave;me X Window sous FreeBSD.</para>

    <para>Le programme d'installation de FreeBSD offre aux utilisateurs
      l'opportunit&eacute; d'installer et de configurer
      <application>&xfree86; 4.X</application> durant
      l'installation (couvert dans la <xref linkend="x-server">).
      Pour installer et utiliser <application>&xfree86; 3.X</application>,
      attendez que la base du syst&egrave;me FreeBSD soit install&eacute;e, puis
      ensuite installez <application>&xfree86;</application>.
      Par exemple, pour compiler et
      installer <application>&xfree86; 3.X</application> &agrave; partir du
      catalogue des logiciels port&eacute;s:</para>

    <screen>&prompt.root; <userinput>cd /usr/ports/x11/XFree86</userinput>
&prompt.root; <userinput>make all install clean</userinput></screen>

    <para>D'autre part, chaque version d'<application>&xfree86;</application>
      peut &ecirc;tre directement install&eacute;e &agrave; partir
      des binaires FreeBSD fournis sur le <ulink
      url="http://www.XFree86.org/">site d'&xfree86;</ulink>.  Une version
      pr&eacute;-compil&eacute;e &agrave; utiliser avec l'outil &man.pkg.add.1;
      est &eacute;galement
      disponible pour <application>&xfree86; 4.X</application>.  Quand la
      fonction de r&eacute;cup&eacute;ration &agrave; distance
      est utilis&eacute;e, le num&eacute;ro de version doit
      &ecirc;tre retir&eacute;.  &man.pkg.add.1; t&eacute;l&eacute;chargera
      automatiquement la toute derni&egrave;re version de l'application.
      Donc pour r&eacute;cup&eacute;rer et installer la version
      pr&eacute;-compil&eacute;e d'<application>&xfree86; 4.X</application>,
      tapez simplement:</para>

<screen>&prompt.root; <userinput>pkg_add -r XFree86</userinput></screen>

    <para>Vous pouvez &eacute;galement utiliser le catalogue des logiciels
      port&eacute;s pour installer <application>&xfree86; 4.X</application>,
      pour cela vous avez simplement &agrave; taper les commandes
      suivantes:</para>

<screen>&prompt.root; <userinput>cd /usr/ports/x11/XFree86-4</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

    <note>
      <para>Les exemples ci-dessus installeront la distribution
	compl&egrave;te d'<application>&xfree86;</application> comprenant
	les serveurs, les clients, les polices de caract&egrave;res,
	etc.  Des paquetages et des logiciels port&eacute;s
	s&eacute;par&eacute;s pour les diff&eacute;rentes parties
	d'<application>&xfree86; 4.X</application> sont &eacute;galement
	disponibles.</para>
    </note>

    <para>Le reste de ce chapitre expliquera comment configurer
      <application>&xfree86;</application>, et comment installer un environnement
      de travail productif.</para>

<!-- Easiest way is from sysinstall for XFree86 4.X -->

  </sect1>

  <sect1 id="x-config">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Christopher</firstname>
          <surname>Shumway</surname>
          <contrib>Contribution de </contrib>
          <!-- July 2001 -->
        </author>
      </authorgroup>
    </sect1info>
    <title>Configuration d'&xfree86;</title>


    <indexterm><primary>XFree86 4.X</primary></indexterm>
    <indexterm><primary>XFree86</primary></indexterm>

    <sect2>
      <title>Avant de commencer</title>

      <para>Avant de configurer <application>&xfree86; 4.X</application>,
	les informations sur le syst&egrave;me cible sont
	n&eacute;cessaires:</para>

      <itemizedlist>
	<listitem><para>Caract&eacute;ristiques du moniteur</para></listitem>
	<listitem><para>Circuit graphique pr&eacute;sent sur la carte
	  vid&eacute;o</para></listitem>
	<listitem><para>Quantit&eacute; de m&eacute;moire pr&eacute;sente
	  sur la carte vid&eacute;o</para></listitem>
      </itemizedlist>

      <indexterm><primary>fr&eacute;quence de balayage
	horizontale</primary></indexterm>
      <indexterm><primary>fr&eacute;quence de synchronisation
	verticale</primary></indexterm>

      <para>Les caract&eacute;ristiques du moniteur sont utilis&eacute;es par
	<application>&xfree86;</application> pour d&eacute;terminer la
	r&eacute;solution
	et le taux de rafra&icirc;chissement &agrave; utiliser.  Ces
	caract&eacute;ristiques sont g&eacute;n&eacute;ralement obtenues sur la
	documentation fournie avec le moniteur ou sur le site web du
	constructeur.  Il y a deux intervalles de nombres n&eacute;cessaires,
	les fr&eacute;quences de balayage horizontale et les fr&eacute;quences
	de synchronisation verticale.</para>

      <para>La circuit graphique pr&eacute;sent sur la carte vid&eacute;o
	d&eacute;finit quel pilote de p&eacute;riph&eacute;rique
	<application>&xfree86;</application> utilise pour communiquer avec
	le mat&eacute;riel graphique.  Avec la plupart des circuits, cela peut
	&ecirc;tre d&eacute;tect&eacute; automatiquement, mais il
	est toujours utile de conna&icirc;tre le type dans le cas o&ugrave;
	la d&eacute;tection automatique ne fonctionnerait pas
	correctement.</para>

      <para>La quantit&eacute; de m&eacute;moire graphique sur la carte
	vid&eacute;o d&eacute;termine la r&eacute;solution et la profondeur de
	couleurs qui pourront &ecirc;tre utilis&eacute;es.  C'est important
	de le savoir afin que l'utilisateur soit au courant des limitations du
	syst&egrave;me.</para>

    </sect2>

    <sect2>
      <title>Configurer &xfree86; 4.X</title>

      <para>La configuration d'<application>&xfree86; 4.X</application>
	est un processus en plusieurs &eacute;tapes.  La premi&egrave;re
	&eacute;tape est de g&eacute;n&eacute;rer un fichier de configuration
	initial avec l'option <option>-configure</option>
	d'<application>&xfree86;</application>.  En tant que super
	utilisateur, lancez simplement:</para>

      <screen>&prompt.root; <userinput>XFree86 -configure</userinput></screen>

      <para>Cela g&eacute;n&eacute;rera un squelette de fichier de
	configuration pour <application>&xfree86;</application> dans le
	r&eacute;pertoire <filename>/root</filename> appel&eacute;
	<filename>XF86Config.new</filename> (en fait le r&eacute;pertoire
	utilis&eacute; est celui couvert par la variable d'environement
	<envar>$HOME</envar>, et sa valeur d&eacute;pendra de la
	fa&ccedil;on dont vous avez abotenu les droits de super-utilisateur).
	Le programme <application>&xfree86;</application> tentera de
	sonder le mat&eacute;riel graphique pr&eacute;sent sur le
	syst&egrave;me et &eacute;crira un fichier de configuration pour
	charger les pilotes de p&eacute;riph&eacute;riques corrects pour
	le mat&eacute;riel d&eacute;tect&eacute; sur le syst&egrave;me
	cible.</para>

      <para>L'&eacute;tape suivante est de tester la configuration existante
	pour v&eacute;rifier que <application>&xfree86;</application> peut
	fonctionner avec le mat&eacute;riel graphique pr&eacute;sent sur
	le syst&egrave;me cible.  Pour effectuer ce test, l'utilisateur doit
	lancer:</para>

      <screen>&prompt.root; <userinput>XFree86 -xf86config XF86Config.new</userinput></screen>

      <para>Si une grille grise et noire et un curseur de souris en
	forme de X apparaissent, la configuration fonctionne
	correctement.  Pour quitter le test,  appuyez simplement sur les
	touches
	<keycombo action="simul">
	  <keycap>Ctrl</keycap>
	  <keycap>Alt</keycap>
	  <keycap>Backspace</keycap>
	</keycombo> simultan&eacute;ment.</para>

      <note>
	<para>Si la souris ne fonctionne pas, assurez-vous que le
	  p&eacute;riph&eacute;rique a &eacute;t&eacute; configur&eacute;.
	  Consultez la <xref linkend="mouse">
	  dans le chapitre sur l'installation de
	  &os;.</para>
      </note>

      <indexterm><primary>optimisation de la configuration
	d'&xfree86; 4</primary></indexterm>

      <para>Ensuite, optimisez le fichier de configuration
	<filename>XF86Config.new</filename> selon vos go&ucirc;ts.  Ouvrez le
	fichier dans un &eacute;diteur de texte comme &man.emacs.1; ou
	&man.ee.1;.  Tout d'abord, ajoutez les fr&eacute;quences pour le
	moniteur du syst&egrave;me cible.  Celles-ci sont
	g&eacute;n&eacute;ralement exprim&eacute;es sous la forme de
	fr&eacute;quences de
	synchronisation horizontale et verticale.  Ces valeurs sont
	ajout&eacute;es dans le fichier <filename>XF86Config.new</filename>
	dans la section <literal>"Monitor"</literal>:</para>

      <programlisting>Section "Monitor"
        Identifier   "Monitor0"
        VendorName   "Monitor Vendor"
        ModelName    "Monitor Model"
        HorizSync    30-107
        VertRefresh  48-120
EndSection</programlisting>

      <para>Les termes <varname>HorizSync</varname> et
	<varname>VertRefresh</varname> peuvent ne pas &ecirc;tre
	pr&eacute;sents dans le fichier de configuration.  Si c'est le cas,
	ils doivent &ecirc;tre ajout&eacute;s, avec les fr&eacute;quences
	horizontales correctes plac&eacute;es apr&egrave;s le terme
	<varname>HorizSync</varname> et les fr&eacute;quences verticales
	apr&egrave;s le terme <varname>VertRefresh</varname>.  Dans l'exemple
	ci-dessus les fr&eacute;quences du moniteur ont &eacute;t&eacute;
	entr&eacute;es.</para>

      <para>X autorise l'utilisation des caract&eacute;ristiques DMPS (Energy
	Star) avec les moniteurs qui en sont capables.  Le programme
	&man.xset.1; contr&ocirc;le les d&eacute;lais et peut forcer
	la mise en
	veille, l'arr&ecirc;t, ou les modes d'extinction.  Si vous souhaitez
	activer les fonctions DMPS de votre moniteur, vous devez ajouter
	la ligne suivante dans la section concernant le moniteur:</para>

      <programlisting>
        Option       "DPMS"</programlisting>

      <indexterm>
        <primary><command>XF86Config</command></primary>
      </indexterm>

      <para>Pendant que le fichier de configuration
	<filename>XF86Config.new</filename> est toujours ouvert dans un
	&eacute;diteur, s&eacute;lectionnez la r&eacute;solution par
	d&eacute;faut et la profondeur de couleurs d&eacute;sir&eacute;e.
	Cela est d&eacute;fini dans la section
	<literal>"Screen"</literal>:</para>

      <programlisting>Section "Screen"
        Identifier "Screen0"
        Device     "Card0"
        Monitor    "Monitor0"
        DefaultDepth 24
        SubSection "Display"
                Depth     24
                Modes     "1024x768"
        EndSubSection
EndSection</programlisting>

      <para>Le terme <varname>DefaultDepth</varname> indique la
	profondeur de couleurs utilis&eacute;e par d&eacute;faut.  Cette
	valeur peut &ecirc;tre outrepass&eacute;e avec l'option
	<command>-bpp</command> en ligne de la commande &man.XFree86.1;.
	Le terme
	<varname>Modes</varname> indique la r&eacute;solution &agrave; utiliser
	pour la profondeur de couleurs donn&eacute;e.
	Notez que seuls les modes standard VESA sont support&eacute;s
	comme d&eacute;finis par le mat&eacute;riel graphique du
	syst&egrave;me cible.  Dans l'exemple
	ci-dessus, la profondeur de couleurs par d&eacute;faut est de vingt
	quatre bits par pixel.  A cette profondeur de couleurs, la
	r&eacute;solution accept&eacute;e est de mille vingt quatre pixels
	par sept cent soixante huit pixels.</para>

      <para>Pour fonctionner &agrave; une r&eacute;solution de mille
	vingt quatre pixels par sept cent soixante huit pixels &agrave; vingt
	quatre bits par pixel, ajoutez le terme
	<varname>DefaultDepth</varname> avec la valeur vingt quatre, et
	ajoutez &agrave; la sous-section <literal>"Display"</literal> avec la
	valeur <varname>Depth</varname> d&eacute;sir&eacute;e le terme
	<varname>Modes</varname> avec la r&eacute;solution souhait&eacute;e par
	l'utilisateur.  Notez que seuls les modes standard VESA sont
	support&eacute;s comme d&eacute;finis par le mat&eacute;riel
	graphique du syst&egrave;me cible.</para>

      <para>Enfin, sauvez le fichier de configuration et testez-le en
	utilisant la proc&eacute;dure de test donn&eacute;e ci-dessus.
	Si tout se passe bien, le fichier de configuration doit &ecirc;tre
	install&eacute; &agrave; un emplacement commun o&ugrave;
	&man.XFree86.1; pourra le trouver.  C'est typiquement soit
	<filename>/etc/X11/XF86Config</filename> soit
	<filename>/usr/X11R6/etc/X11/XF86Config</filename>.</para>

      <screen>&prompt.root; <userinput>cp XF86Config.new /etc/X11/XF86Config</userinput></screen>

      <para>Une fois que le fichier de configuration a &eacute;t&eacute;
	plac&eacute; au bon endroit, la configuration est achev&eacute;e.
	Afin de pouvoir lancer <application>&xfree86; 4.X</application>
	avec &man.startx.1;, installez le logiciel port&eacute; <filename
	role="package">x11/wrapper</filename>.  <application>&xfree86;
	4.X</application> peut &eacute;galement &ecirc;tre lanc&eacute;
	&agrave; l'aide de &man.xdm.1;.</para>

      <note>
	<para>Il existe &eacute;galement un outil de configuration
	  graphique, &man.xf86cfg.1; qui est fourni avec
	  <application>&xfree86; 4.X</application>.  Il permet de
	  d&eacute;finir int&eacute;ractivement votre configuration en
	  s&eacute;lectionnant les pilotes de
	  p&eacute;riph&eacute;riques et les param&egrave;tres
	  ad&eacute;quats.  Ce programme peut &ecirc;tre utilis&eacute;
	  &eacute;galement &agrave; partir de la console, utilisez
	  juste la commande <command>xf86cfg -textmode</command>.
	  Pour plus de d&eacute;tails, consultez la
	  page de manuel d'&man.xf86cfg.1;.</para>
      </note>

    </sect2>

    <sect2>
      <title>Sujets avanc&eacute;s de configuration</title>

      <sect3>
	<title>Configuration avec les circuits graphiques &intel;
	  i810</title>

        <indexterm><primary>circuits graphiques Intel i810</primary></indexterm>

	<para>La configuration avec les circuits int&eacute;gr&eacute;s
	  graphiques &intel; i810 n&eacute;cessite
	  <devicename>agpgart</devicename> l'interface de programmation AGP
	  pour <application>&xfree86;</application> afin de piloter la carte.
	  Le pilote &man.agp.4; est pr&eacute;sent dans le noyau
	  <filename>GENERIC</filename> depuis les versions 4.8-RELEASE
	  et 5.0-RELEASE.  Sous les versions pr&eacute;c&eacute;dentes, vous
	  devrez ajouter la ligne suivante:</para>

	<programlisting>device agp</programlisting>

	<para>dans votre fichier de configuration du noyau et
	  recompilez un nouveau noyau.  Au lieu de cela, vous
	  pourrez vouloir charger le module noyau
	  <filename>agp.ko</filename> automatiquement au
	  d&eacute;marrage avec &man.loader.8;.  Pour cela, ajoutez simplement cette ligne
	  au fichier <filename>/boot/loader.conf</filename>:</para>

	<programlisting>agp_load="YES"</programlisting>

	<para>Ensuite, si vous utilisez FreeBSD version 4.X ou pr&eacute;c&eacute;dente, un fichier sp&eacute;cial de
	  p&eacute;riph&eacute;rique doit &ecirc;tre cr&eacute;&eacute; pour
	  l'interface de programmation.  Pour cr&eacute;er le fichier
	  sp&eacute;cial de p&eacute;riph&eacute;rique AGP, lancez
	  &man.MAKEDEV.8; dans le r&eacute;pertoire
	  <filename>/dev</filename>:</para>

	<screen>&prompt.root; <userinput>cd /dev
&prompt.root; sh MAKEDEV agpgart</userinput></screen>

	<note>
	  <para>FreeBSD&nbsp;5.X et suivantes, utiliseront &man.devfs.5;
	    pour allouer les fichiers sp&eacute;ciaux de
	    p&eacute;riph&eacute;rique de fa&ccedil;on transparente pour
	    l'utilisateur, par cons&eacute;quent l'&eacute;tape
	    &man.MAKEDEV.8; n'est pas requise.</para>
	</note>
	<para>Cela permettra la configuration de ce mat&eacute;riel comme
	  n'importe quelle autre carte graphique.  Notez que sur les
	  syst&egrave;mes sans le pilote &man.agp.4; compil&eacute; dans
	  le noyau, tenter de charger le module &agrave; l'aide
	  de &man.kldload.8; ne fonctionnera pas.  Ce pilote doit
	  &ecirc;tre dans le noyau au d&eacute;marrage soit compil&eacute; dans le
	  noyau soit en utilisant
	  <filename>/boot/loader.conf</filename>.</para>

	<para>Si vous utilisez <application>&xfree86; 4.1.0</application>
	  (ou sup&eacute;rieur) et que des
	  messages au sujet de symboles inexistants comme
	  <literal>fbPictureInit</literal> apparaissent, essayez
	  d'ajouter la ligne suivante apr&egrave;s <literal>Driver
	  "i810"</literal> dans le fichier de configuration
	  d'<application>&xfree86;</application>:</para>
	<programlisting>Option "NoDDC"</programlisting>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="x-fonts">
    <sect1info>
      <authorgroup>
        <author>
          <firstname>Murray</firstname>
          <surname>Stokely</surname>
          <contrib>Contribution de </contrib>
        </author>
      </authorgroup>
    </sect1info>
    <title>Utilisation des polices de caract&egrave;res sous &xfree86;</title>

    <sect2 id="type1">
    <title>Polices de caract&egrave;res Type1</title>
    <para>Les polices de caract&egrave;res livr&eacute;es par
      d&eacute;faut avec <application>&xfree86;</application> sont loin
      d'&ecirc;tre id&eacute;ales pour des applications de type publication.
      Les grandes polices utilis&eacute;es pour les pr&eacute;sentations
      pr&eacute;sentent un aspect en escalier et peu professionnel, et
      les petites polices sous <application>&netscape;</application> sont
      presque compl&egrave;tement
      illisibles.  Cependant, il existe de nombreuses polices
      Type1 (&postscript;) gratuites, de hautes qualit&eacute;s qui peuvent
      &ecirc;tre ais&eacute;ment utilis&eacute;es avec
      <application>&xfree86;</application>, soit la version 3.X soit la
      version 4.X.  Par exemple, la collection de polices de caract&egrave;res
      URW  (<filename role="package">x11-fonts/urwfonts</filename>)
      comprend une version haute qualit&eacute; des polices de
      caract&egrave;res standards type1 (<trademark class="registered">Times Roman</trademark>, <trademark class="registered">Helvetica</trademark>, <trademark class="registered">Palatino</trademark>
      et autres).  La collection Freefonts (<filename
      role="package">x11-fonts/freefonts</filename>) comprend beaucoup
      plus de polices de caract&egrave;res, mais la plupart d'entre elles sont
      destin&eacute;es &agrave; &ecirc;tre utilis&eacute;es avec des logiciels
      graphiques comme <application>The Gimp</application>, et ne sont pas
      suffisamment compl&egrave;tes pour servir de polices
      de caract&egrave;res d'affichage.  De plus
      <application>&xfree86;</application> peut &ecirc;tre configur&eacute;
      pour utiliser les polices de caract&egrave;res &truetype; avec un minimum
      d'effort: voir la <link linkend="truetype">section sur les polices
      de caract&egrave;res &truetype;</link>.</para>

    <para>Pour installer les collections de polices de caract&egrave;res
      Type1 pr&eacute;c&eacute;dentes &agrave; partir du catalogue
      des logiciels port&eacute;s, lancez les commandes suivantes:</para>

      <screen>&prompt.root; <userinput>cd /usr/ports/x11-fonts/urwfonts</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

    <para>Et de m&ecirc;me pour la collection Freefont ou d'autres.  Pour
      indiquer au serveur X l'existence de ces polices, ajoutez la
      ligne ad&eacute;quate au fichier <filename>XF86Config</filename> (dans
      <filename>/etc/</filename> pour <application>&xfree86;</application>
      version 3, ou dans <filename>/etc/X11/</filename> pour la version
      4), du type:</para>

<programlisting>FontPath "/usr/X11R6/lib/X11/fonts/URW/"</programlisting>

      <para>Autre possibilit&eacute;, en ligne de commande dans une session X
	lancez:</para>

<screen>&prompt.user; <userinput>xset fp+ /usr/X11R6/lib/X11/fonts/URW</userinput>
&prompt.user; <userinput>xset fp rehash</userinput></screen>

      <para>Cela fonctionnera mais les effets seront perdus quand la
	session X sera ferm&eacute;e, &agrave; moins de l'ajouter dans le
	fichier de
	d&eacute;marrage (<filename>~/.xinitrc</filename> pour une session
	<command>startx</command> classique, ou dans
	<filename>~/.xsession</filename> quand on s'attache au syst&egrave;me
	par l'interm&eacute;diaire d'un gestionnaire de session graphique comme
	<application>XDM</application>).  Une troisi&egrave;me m&eacute;thode
	est d'utiliser le nouveau fichier <filename>XftConfig</filename>:
	voir la section sur l'<link
	linkend="antialias">anticr&eacute;nelage</link>.</para>
    </sect2>

    <sect2 id="truetype">
    <title>Polices de caract&egrave;res &truetype;</title>

    <indexterm><primary>TrueType Fonts</primary></indexterm>
    <indexterm><primary>fonts</primary>
      <secondary>TrueType</secondary>
    </indexterm>

    <para><application>&xfree86; 4.X</application> dispose d'un support
      int&eacute;gr&eacute; pour le rendu des polices &truetype;.
      Il y a deux diff&eacute;rents modules qui peuvent activer cette
      fonctionnalit&eacute;.  Le module freetype est
      utilis&eacute; dans cet exemple parce qu'il est plus compatible avec les
      autres moteurs de rendu des polices de caract&egrave;res.  Pour activer
      le module freetype ajoutez juste la ligne suivante dans la section
      <literal>"Module"</literal> du fichier
      <filename>/etc/X11/XF86Config</filename>.</para>

    <programlisting>Load  "freetype"</programlisting>

    <para>Pour <application>&xfree86; 3.3.X</application>, un serveur
      s&eacute;par&eacute; de polices de caract&egrave;res &truetype;
      est n&eacute;cessaire.
      <application>Xfstt</application> est g&eacute;n&eacute;ralement
      utilis&eacute; dans ce but.  Pour installer
      <application>Xfstt</application> installez simplement le logiciel
      port&eacute; <filename
      role="package">x11-servers/Xfstt</filename>.</para>

    <para>Maintenant cr&eacute;ez un r&eacute;pertoire pour les polices
      &truetype; (par exemple
      <filename>/usr/X11R6/lib/X11/fonts/TrueType</filename>) et copiez
      toutes les polices &truetype; dans ce r&eacute;pertoire.  Gardez &agrave;
      l'esprit
      que les polices &truetype; ne peuvent &ecirc;tre directement prises d'un
      Macintosh; elles doivent &ecirc;tre dans un format &unix;/DOS/Windows pour
      &ecirc;tre utilis&eacute;es sous <application>&xfree86;</application>.
      Une fois les fichiers copi&eacute;s dans ce r&eacute;pertoire, utilisez
      <application>ttmkfdir</application> pour cr&eacute;er un fichier
      <filename>fonts.dir</filename>, de fa&ccedil;on &agrave; ce que le moteur
      d'affichage des polices d'X sache que de nouveaux fichiers ont
      &eacute;t&eacute;
      install&eacute;s.  <application>ttmkfdir</application> est disponible
      dans le catalogue des logiciels port&eacute;s de FreeBSD sous <filename
      role="package">x11-fonts/ttmkfdir</filename>.</para>

<screen>&prompt.root; <userinput>cd /usr/X11R6/lib/X11/fonts/TrueType</userinput>
&prompt.root; <userinput>ttmkfdir > fonts.dir</userinput></screen>

    <para>Maintenant ajoutez le r&eacute;pertoire des polices &truetype; au
      chemin des polices de caract&egrave;res.  Cela est identique &agrave;
      ce qui est d&eacute;crit ci-dessus pour les polices <link
      linkend="type1">Type1</link>, c'est &agrave; dire, utiliser</para>
      
    <screen>&prompt.user; <userinput>xset fp+ /usr/X11R6/lib/X11/fonts/TrueType</userinput>
&prompt.user; <userinput>xset fp rehash</userinput></screen>

      <para>ou ajouter une ligne <option>FontPath</option> au fichier
      <filename>XF86Config</filename>.</para>

      <para>Voil&agrave;.  D&eacute;sormais <application>&netscape;</application>,
	<application>Gimp</application>,
	<application>&staroffice;</application>, et toutes les autres
	applications X devraient maintenant reconna&icirc;tre les polices de
	caract&egrave;res &truetype;.  Les polices tr&egrave;s petites (comme
	le texte de page web visualis&eacute; sur un &eacute;cran haute
	r&eacute;solution) et les tr&egrave;s
	grandes polices (dans <application>&staroffice;</application>)
	auront un rendu bien meilleur maintenant.</para>
    </sect2>

    <sect2 id="antialias">
    <sect2info>
      <authorgroup>
	<author>
	  <firstname>Joe Marcus</firstname>
	  <surname>Clarke</surname>
	  <contrib>Mis &agrave; jour pour &xfree86; 4.3 par </contrib>
	  <!-- May 2003 -->
	</author>
      </authorgroup>
    </sect2info>
      <title>Polices de caract&egrave;res anticr&eacute;nelage</title>

      <indexterm><primary>polices de caract&egrave;res
	anticr&eacute;nelage</primary></indexterm>
      <indexterm><primary>polices de caract&egrave;res</primary>
	<secondary>anticr&eacute;nelage</secondary></indexterm>

      <para>L'anticr&eacute;nelage est disponible sous
	<application>&xfree86;</application> depuis la version 4.0.2.
	Cependant, la configuration des polices de caract&egrave;res
	&eacute;tait relativement lourde avant l'arriv&eacute;e
	d'<application>&xfree86;</application> 4.3.0.  Depuis la version
	4.3.0 toutes les polices des r&eacute;pertoires <filename
	role="directory">/usr/X11R6/lib/X11/fonts/</filename> et
	<filename role="directory">~/.fonts/</filename> sont
	automatiquement disponibles pour l'anticr&eacute;nelage avec
	les applications compatibles Xft.  Toutes les applications ne
	sont pas encore compatibles Xft, mais de nombreuses ont
	&eacute;t&eacute; dot&eacute;es du support Xft.  Par exemple,
	les applications utilisant Qt 2.3 et versions suivantes (la
	bo&icirc;te &agrave; outils pour l'environnement de travail
	<application>KDE</application>), Gtk+ 2.0 et suivantes (la
	bo&icirc;te &agrave; outils de l'environnement de travail
	<application>GNOME</application>), et
	<application>Mozilla</application> 1.2 et versions
	suivantes.</para>

      <para>Afin de contr&ocirc;ler quelles polices de
	caract&egrave;res sont anticr&eacute;nel&eacute;es, ou pour
	configurer les propri&eacute;t&eacute;s de
	l'anticr&eacute;nelage, cr&eacute;ez (ou &eacute;ditez, s'il
	existe d&eacute;j&agrave;) le fichier
	<filename>/usr/X11R6/etc/fonts/local.conf</filename>.
	Plusieurs caract&eacute;ristiques avanc&eacute;es du
	syst&egrave;me de fontes Xft peuvent &ecirc;tre
	ajust&eacute;es par l'interm&eacute;diaire de ce fichier;
	cette section ne d&eacute;crit ques des possibilit&eacute;s
	simples.  Pour plus de d&eacute;tails, consultez la page de
	manuel &man.fonts-conf.5;.</para>

      <indexterm><primary>XML</primary></indexterm>

      <para>Ce fichier doit &ecirc;tre dans le format XML.  Faites
	attention &agrave; la casse des caract&egrave;res, et
	assurez-vous que toutes les balises sont correctement
	ferm&eacute;es.  Le fichier d&eacute;bute avec l'ent&ecirc;te
	XML classique suivie par une d&eacute;finition DOCTYPE, puis
	de la balise <literal>&lt;fontconfig&gt;</literal>:</para>

      <programlisting>
	&lt;?xml version="1.0"?&gt;
	&lt;!DOCTYPE fontconfig SYSTEM "fonts.dtd"&gt;
	&lt;fontconfig&gt;
      </programlisting>

      <para>Comme pr&eacute;cis&eacute; pr&eacute;c&eacute;demment,
	l'ensemble des polices de caract&egrave;res du
	r&eacute;pertoire <filename
	role="directory">/usr/X11R6/lib/X11/fonts/</filename> comme du
	r&eacute;pertoire <filename
	role="directory">~/.fonts/</filename> sont disponibles pour
	les applications compatibles Xft.  Si vous d&eacute;sirez
	ajouter un autre r&eacute;pertoire en dehors des ces deux
	l&agrave;, ajoutez une ligne similaire &agrave; la suivante au
	fichier
	<filename>/usr/X11R6/etc/fonts/local.conf</filename>:</para>

      <programlisting>&lt;dir&gt;/chemin/vers/mes/fontes&lt;/dir&gt;</programlisting>

      <para>Apr&egrave;s l'ajout de nouvelles fontes, et tout
	particuli&egrave;rement de nouveaux r&eacute;pertoires de polices, vous
	devrez ex&eacute;cuter la commande suivante pour reconstituer le
	cache des polices de caract&egrave;res:</para>

      <screen>&prompt.root; <userinput>fc-cache -f</userinput></screen>

      <para>L'anticr&eacute;nelage rend les bords
	l&eacute;g&egrave;rement flous, ce qui rend le texte tr&egrave;s
	petit plus lisible et enl&egrave;ve l'effet
	&ldquo;d'escalier&rdquo; des grands textes, mais peut provoquer
	une fatigue visuelle si c'est appliqu&eacute; au texte normal.
	Pour exclure les tailles inf&eacute;rieures &agrave; 14 points de
	l'anticr&eacute;nelage, ajoutez ces lignes:</para>

      <programlisting>	 &lt;match target="font"&gt;
	  &lt;test name="size" compare="less"&gt;
		&lt;double&gt;14&lt;/double&gt;
	  &lt;/test&gt;
	  &lt;edit name="antialias" mode="assign"&gt;
		&lt;bool&gt;false&lt;/bool&gt;
	  &lt;/edit&gt;
	&lt;/match&gt;</programlisting>

      <indexterm><primary>polices de caract&egrave;res</primary>
	<secondary>espacement</secondary></indexterm>

      <para>L'espacement pour certaines polices de caract&egrave;res
	&agrave; chasse fixe peut &eacute;galement &ecirc;tre
	inappropri&eacute; avec l'anticr&eacute;nelage.  Cela semble
	&ecirc;tre un probl&egrave;me avec <application>KDE</application>, en
	particulier.  Une solution possible pour cela est de forcer
	l'espacement pour de telles polices de caract&egrave;res &agrave; 100.
	Ajoutez les lignes suivantes:</para>

      <programlisting>	 &lt;match target="pattern" name="family"&gt;
	  &lt;test qual="any" name="family"&gt;
	    &lt;string&gt;fixed&lt;/string&gt;
	  &lt;/test&gt;
	  &lt;edit name="family" mode="assign"&gt;
	    &lt;string&gt;mono&lt;/string&gt;
	  &lt;/edit&gt;
	&lt;/match&gt;
	&lt;match target="pattern" name="family"&gt;
	  &lt;test qual="any" name="family"&gt;
	    &lt;string&gt;console&lt;/string&gt;
	  &lt;/test&gt;
	  &lt;edit name="family" mode="assign"&gt;
	    &lt;string&gt;mono&lt;/string&gt;
	  &lt;/edit&gt;
	&lt;/match&gt;</programlisting>

      <para>(ceci ajoute un alias <literal>"mono"</literal> pour les autres
	noms communs des polices de caract&egrave;res fixes), puis
	ajoutez:</para>

      <programlisting>	 &lt;match target="pattern" name="family"&gt;
	  &lt;test qual="any" name="family"&gt;
	    &lt;string&gt;mono&lt;/string&gt;
	  &lt;/test&gt;
	  &lt;edit name="spacing" mode="assign"&gt;
	    &lt;int&gt;100&lt;/int&gt;
	  &lt;/edit&gt;
	&lt;/match&gt;</programlisting>

      <para>Certaines polices de caract&egrave;res, comme Helvetica,
	peuvent pr&eacute;senter des probl&egrave;mes lors de
	l'anticr&eacute;nelage.  G&eacute;n&eacute;ralement cela se
	manifeste par l'impression que la fonte semble coup&eacute;e
	en deux verticalement.  Au pire cela peut provoquer des crashs
	avec certaines application comme
	<application>Mozilla</application>.  Pour &eacute;viter cela,
	pensez &agrave; ajouter ce qui suit au fichier
	<filename>local.conf</filename>:</para>

      <programlisting>	 &lt;match target="pattern" name="family"&gt;
	  &lt;test qual="any" name="family"&gt;
	    &lt;string&gt;Helvetica&lt;/string&gt;
	  &lt;/test&gt;
	  &lt;edit name="family" mode="assign"&gt;
	    &lt;string&gt;sans-serif&lt;/string&gt;
	  &lt;/edit&gt;
	&lt;/match&gt;</programlisting>

      <para>Une fois l'&eacute;dition de
	<filename>local.conf</filename> achev&eacute;e, assurez-vous
	que le fichier se termine par la balise
	<literal>&lt;/fontconfig&gt;</literal>.  Si ce n'est pas le
	cas, tous vos changements seront ignor&eacute;s.</para>

      <para>L'ensemble de polices de caract&egrave;res fourni par
	d&eacute;faut avec <application>&xfree86;</application> n'est
	pas tr&egrave;s adapt&eacute; pour l'anticr&eacute;nelage.  Un
	bien meilleur ensemble de fontes peut &ecirc;tre trouv&eacute;
	dans le catalogue des logiciels port&eacute;s: <filename
	role="package">x11-fonts/bitstream-vera</filename>.  Ce
	logiciel installera un fichier
	<filename>/usr/X11R6/etc/fonts/local.conf</filename> si ce
	dernier n'existe pas d&eacute;j&agrave;.  Si le fichier
	existe, le logiciel port&eacute; cr&eacute;era un fichier
	nomm&eacute;
	<filename>/usr/X11R6/etc/fonts/local.conf-vera</filename>.  Il
	fusionnera le contenu de ce fichier dans
	<filename>/usr/X11R6/etc/fonts/local.conf</filename>, et les
	polices de caract&egrave;res Bitstream remplaceront
	automatiquement les polices avec empattement (serif), sans
	empattement (sans-serif) et &agrave; chasse fixe
	d'<application>&xfree86;</application>.</para>

      <para>Et enfin, les utilisateurs peuvent ajouter leurs propres
	param&egrave;tres par l'interm&eacute;diaire de leur fichier
	<filename>.fonts.conf</filename>.  Pour cela, chaque
	utilisateur devrait cr&eacute;er un fichier
	<filename>~/.fonts.conf</filename>.  Ce fichier doit
	&eacute;galement &ecirc;tre &eacute;crit en XML.</para>

      <indexterm><primary>LCD screen</primary></indexterm>
      <indexterm><primary>Fonts</primary>
	<secondary>LCD screen</secondary></indexterm>

      <para>Un dernier point: avec un &eacute;cran LCD, un
	&eacute;chantillonage &ldquo;sub-pixel&rdquo; peut &ecirc;tre
	d&eacute;sir&eacute;.  Fondamentalement, ceci traite les composantes
	rouge,
	verte et bleu s&eacute;par&eacute;ments (horizontalement
	s&eacute;par&eacute;es) pour am&eacute;liorer la r&eacute;solution
	horizontale; les r&eacute;sultats peuvent &ecirc;tre dramatiques.
	Pour activer cela, ajoutez quelque part dans le fichier
	<filename>local.conf</filename> les lignes:</para>

      <programlisting>
	 &lt;match target="font"&gt;
	  &lt;test qual="all" name="rgba"&gt;
	    &lt;const&gt;unknown&lt;/const&gt;
	  &lt;/test&gt;
	  &lt;edit name="rgba" mode="assign"&gt;
	    &lt;const&gt;rgb&lt;/const&gt;
	  &lt;/edit&gt;
	&lt;/match&gt;
      </programlisting>

      <note>
	<para>En fonction de type d'&eacute;cran, le terme
	  &ldquo;rgb&rdquo; pourra devoir &ecirc;tre chang&eacute; pour
	  &ldquo;bgr&rdquo;, &ldquo;vrgb&rdquo; ou
	  &ldquo;vbgr&rdquo;: exp&eacute;rimentez
	  pour d&eacute;finir lequel fonctionne le mieux.</para>
      </note>

      <indexterm><primary>Mozilla</primary></indexterm>
      <indexterm><primary>navigateurs web</primary>
	<secondary>Mozilla</secondary>
	<see>Mozilla</see></indexterm>

      <para>L'anticr&eacute;nelage devrait &ecirc;tre activ&eacute; au
	prochain lancement du serveur X.  Cependant, notez que les
	applications doivent savoir comment l'utiliser.  A l'heure
	actuelle, le &ldquo;toolkit&rdquo; Qt le supporte, donc
	l'int&eacute;gralit&eacute; de l'environnement
	<application>KDE</application> peut utiliser des polices
	anticr&eacute;nel&eacute;es (voir la <xref
	linkend="x11-wm-kde-antialias"> sur
	<application>KDE</application> pour plus de d&eacute;tails).
	Par d&eacute;faut <application>Mozilla</application> 1.2 et
	versions suivantes utiliseront automatiquement
	l'anticr&eacute;nelage.  Pour d&eacute;sactiver cette
	caract&eacute;ristique, recompilez
	<application>Mozilla</application> avec le param&egrave;tre
	<makevar>-DWITHOUT_XFT</makevar>.</para>
    </sect2>
  </sect1>

  <sect1 id="x-xdm">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Seth</firstname>
	  <surname>Kingsley</surname>
	  <contrib>Contribution de </contrib>
	</author>
      </authorgroup>
    </sect1info>
    <title>Le gestionnaire de proc&eacute;dures de connexions graphiques
      - &ldquo;X Display Manager&rdquo;</title>
    <sect2>
      <title>G&eacute;n&eacute;ralit&eacute;s</title>

      <indexterm><primary>X Display Manager</primary></indexterm>
      <para>Le gestionnaire de proc&eacute;dures de connexions graphiques
	- &ldquo;X Display Manager&rdquo;
	(<application>XDM</application>) est une partie optionnelle du
	syst&egrave;me X Window qui est utilis&eacute;e pour la
	gestion des proc&eacute;dures de connexion au syst&egrave;me.
	C'est utile dans plusieurs types de situations, dont les
	&ldquo;Terminaux X&rdquo; minimaux, et les serveurs X
	d'affichage de grands r&eacute;seaux.  Comme le syst&egrave;me
	X Window est ind&eacute;pendant du type de r&eacute;seau et de
	protocole, il existe une large vari&eacute;t&eacute; de
	configurations possibles pour faire fonctionner des
	clients et des serveurs X sur diff&eacute;rentes machines
	connect&eacute;es entre elles par un r&eacute;seau.
	<application>XDM</application> fournit une interface graphique
	pour s&eacute;lectionner &agrave; quel serveur d'affichage se
	connecter, et entrer des informations d'autorisation comme
	l'ensemble identifiant et mot de passe.</para>

      <para>Il faut voir <application>XDM</application> comme
	fournissant les m&ecirc;mes fonctionnalit&eacute;s &agrave;
	l'utilisateur que l'utilitaire &man.getty.8; (voir la <xref
	linkend="term-config"> pour plus de d&eacute;tails).
	C'est &agrave; dire, qu'il ex&eacute;cute les ouvertures de session sur
	le syst&egrave;me sur lequel on se connecte et lance alors une session
	au nom de l'utilisateur (g&eacute;n&eacute;ralement un gestionnaire de
	fen&ecirc;tres pour X).  <application>XDM</application> attend alors
	que le programme se termine, signalant que l'utilisateur en a
	termin&eacute; et devrait &ecirc;tre d&eacute;connect&eacute;
	du syst&egrave;me.  A ce moment, <application>XDM</application> peut
	afficher les &eacute;crans d'invite d'ouverture de session et de
	s&eacute;lection de serveur pour le prochain utilisateur.</para>
    </sect2>

    <sect2>
      <title>Utiliser XDM</title>

      <para>Le &ldquo;daemon&rdquo; d'<application>XDM</application> est
	<filename>/usr/X11R6/bin/xdm</filename>.  Ce programme peut &ecirc;tre
	lanc&eacute; &agrave; n'importe quel moment en tant que
	<username>root</username> et il s'occupera de la gestion d'X sur
	la machine locale.  Si <application>XDM</application> doit &ecirc;tre
	ex&eacute;cut&eacute; &agrave; chaque d&eacute;marrage de la machine,
	une mani&egrave;re pratique
	de le faire est d'ajouter une entr&eacute;e dans
	<filename>/etc/ttys</filename>.  Pour plus d'informations sur le
	format et l'utilisation de ce fichier, consultez la <xref
	linkend="term-etcttys">.  Il existe une ligne dans le fichier
	<filename>/etc/ttys</filename> de d&eacute;faut pour ex&eacute;cuter le
	&ldquo;daemon&rdquo; <application>XDM</application> sur un
	terminal virtuel:</para>

<screen>ttyv8	"/usr/X11R6/bin/xdm -nodaemon"	xterm	off secure</screen>

	<para>Par d&eacute;faut cette entr&eacute;e est d&eacute;sactiv&eacute;e;
	afin de la r&eacute;activer modifiez le cinqui&egrave;me champ de
	<literal>off</literal> &agrave; <literal>on</literal> et relancez
	&man.init.8; en utilisant les indications de la <xref
	linkend="term-hup">.  Le premier champ, le nom du terminal que
	ce programme g&eacute;rera, est <literal>ttyv8</literal>.  Cela
	signifie que <application>XDM</application> d&eacute;marrera sur le
	neuvi&egrave;me terminal virtuel.</para>
    </sect2>

    <sect2>
      <title>Configurer XDM</title>

      <para>Le r&eacute;pertoire de configuration
	d'<application>XDM</application> est situ&eacute; dans
	<filename>/usr/X11R6/lib/X11/xdm</filename>.  Dans ce
	r&eacute;pertoire il y a de nombreux fichiers utilis&eacute;s pour
	modifier le comportement et l'apparence
	d'<application>XDM</application>.  G&eacute;n&eacute;ralement les
	fichiers suivants seront pr&eacute;sents:</para>

	<informaltable frame="none">
	  <tgroup cols="2">
	    <thead>
	      <row>
		<entry>Fichier</entry>
		<entry>Description</entry>
	      </row>
	    </thead>

	    <tbody>
	      <row>
		<entry><filename>Xaccess</filename></entry>
		<entry>Ensemble de r&egrave;gles d'autorisation du
		  client.</entry>
	      </row>

	      <row>
		<entry><filename>Xresources</filename></entry>
		<entry>Fichier des ressources X par d&eacute;faut.</entry>
	      </row>

	      <row>
		<entry><filename>Xservers</filename></entry>
		<entry>Liste des &eacute;crans distants et locaux &agrave;
		  g&eacute;rer.</entry>
	      </row>

	      <row>
		<entry><filename>Xsession</filename></entry>
		<entry>Proc&eacute;dure d'ouverture de session par
		  d&eacute;faut.</entry>
	      </row>

	      <row>
		<entry><filename>Xsetup_</filename>*</entry>
		<entry>Proc&eacute;dures utilis&eacute;es pour ex&eacute;cuter
		  des applications avant l'interface d'ouverture de
		  session.</entry>
	      </row>

	      <row>
		<entry><filename>xdm-config</filename></entry>
		<entry>Configuration globale pour tous les affichages
		  utilisants cette machine.</entry>
	      </row>

	      <row>
		<entry><filename>xdm-errors</filename></entry>
		<entry>Erreurs g&eacute;n&eacute;r&eacute;es par le programme
		  serveur.</entry>
	      </row>

	      <row>
		<entry><filename>xdm-pid</filename></entry>
		<entry>L'identifiant du processus ex&eacute;cutant actuellement
		  XDM.</entry>
	      </row>
	    </tbody>
	  </tgroup>
	</informaltable>

      <para>Dans ce r&eacute;pertoire se trouvent &eacute;galement quelques
	proc&eacute;dures et programmes utilis&eacute;s pour configurer
	l'environnement quand <application>XDM</application> fonctionne.
	L'objet de chacun de ces fichiers sera bri&egrave;vement d&eacute;crit.
	La syntaxe exacte et l'utilisation de tous ces fichiers sont
	d&eacute;crites dans la page de manuel &man.xdm.1;.</para>

      <para>La configuration par d&eacute;faut est une simple
	fen&ecirc;tre rectangulaire d'ouverture de session avec le nom de
	la machine h&ocirc;te affich&eacute; en haut dans une grande police de
	caract&egrave;res et avec des invites &ldquo;Login:&rdquo; et
	&ldquo;Password:&rdquo; en-dessous.  C'est un bon point de
	d&eacute;part pour modifier l'apparence et la prise en main des
	&eacute;crans <application>XDM</application>.</para>

      <sect3>
	<title>Xaccess</title>

	<para>Le protocole utilis&eacute; pour se connecter &agrave;
	  des &eacute;crans contr&ocirc;l&eacute;s par
	  <application>XDM</application> est
	  appel&eacute; le &ldquo;X Display Manager Connection Protocol&rdquo;
	  (XDMCP).  Ce fichier est un ensemble de r&egrave;gles pour
	  contr&ocirc;ler les connexions XDMCP &agrave; partir de machines
	  distantes.  Par d&eacute;faut, il autorise tous les clients &agrave;
	  se connecter, mais cela n'a d'importance que si le fichier
	  <filename>xdm-config</filename> est modifi&eacute; pour accepter des
	  connexions distantes.</para>
      </sect3>

      <sect3>
	<title>Xresources</title>
	<para>C'est un fichier de param&egrave;tres par d&eacute;faut
	  pour la s&eacute;lection du serveur et des &eacute;crans d'ouverture
	  de sessions.  C'est l'endroit o&ugrave; l'apparence du programme
	  d'ouverture de session peut &ecirc;tre modifi&eacute;.  Le format est
	  identique au fichier de param&egrave;tres par d&eacute;faut des
	  applications d&eacute;crit dans la documentation
	  d'<application>&xfree86;</application>.</para>
      </sect3>

      <sect3>
	<title>Xservers</title>
	<para>C'est une liste de choix des serveurs distants que
	  l'&eacute;cran de s&eacute;lection devrait fournir.</para>
      </sect3>

      <sect3>
	<title>Xsession</title>
	<para>C'est la proc&eacute;dure par d&eacute;faut &agrave;
	  ex&eacute;cuter par <application>XDM</application>
	  apr&egrave;s qu'un utilisateur ait ouvert une session.  Normalement
	  chaque utilisateur disposera d'une proc&eacute;dure de session dans
	  <filename>~/.xsession</filename> qui sera utilis&eacute;e en lieu
	  et place du fichier par d&eacute;faut.</para>
      </sect3>

      <sect3>
	<title>Xsetup_*</title>
	<para>Cela sera ex&eacute;cut&eacute; automatiquement
	  avant d'afficher les interfaces de s&eacute;lection et d'ouverture de
	  session.  Il existe une proc&eacute;dure pour chaque &eacute;cran
	  utilis&eacute;,
	  nomm&eacute;e <filename>Xsetup_</filename> suivie par le
	  num&eacute;ro de l'&eacute;cran local (par exemple
	  <filename>Xsetup_0</filename>).  G&eacute;n&eacute;ralement
	  ces proc&eacute;dures ex&eacute;cutent un ou deux programmes
	  en t&acirc;che de fond comme <command>xconsole</command>.</para>
      </sect3>

      <sect3>
	<title>xdm-config</title>
	<para>Ce dernier contient les param&egrave;tres sous la forme de
	  param&egrave;tres par d&eacute;faut qui sont applicables &agrave;
	  chaque &eacute;cran que l'installation g&egrave;re.</para>
      </sect3>

      <sect3>
	<title>xdm-errors</title>
	<para>Ce dernier contient les messages de sortie du serveur X
	  qu'<application>XDM</application> essaye d'ex&eacute;cuter.
	  Si un terminal qu'<application>XDM</application> essaye de
	  d&eacute;marrer se bloque pour quelque raison, c'est le bon endroit
	  pour chercher les messages d'erreur.  Ces messages sont
	  &eacute;galement &eacute;crits dans le fichier
	  <filename>~/.xsession-errors</filename> de l'utilisateur &agrave;
	  chaque session.</para>
      </sect3>
    </sect2>

    <sect2>
      <title>Ex&eacute;cuter un serveur d'affichage en r&eacute;seau</title>
      <para>Afin de permettre aux autres clients de se connecter au
	serveur g&eacute;rant l'affichage, &eacute;ditez les
	r&egrave;gles de contr&ocirc;le d'acc&egrave;s, et activez l'auditeur
	de demandes
	de connexion.  Par d&eacute;faut ces r&egrave;gles sont sur des valeurs
	conservatrices.  Pour faire &eacute;couter &agrave;
	<application>XDM</application> les demandes de connexion, tout
	d'abord commentez une ligne du fichier
	<filename>xdm-config</filename>:</para>

<screen>! SECURITY: do not listen for XDMCP or Chooser requests
! Comment out this line if you want to manage X terminals with xdm
DisplayManager.requestPort:     0</screen>

	<para>et ensuite relancez <application>XDM</application>.  Rappelez
	vous que les commentaires dans des fichiers de param&egrave;tres
	par d&eacute;faut d'applications d&eacute;butent avec
	un caract&egrave;re &ldquo;!&rdquo;, et non pas par l'habituel
	&ldquo;#&rdquo;.  Un contr&ocirc;le d'acc&egrave;s plus
	strict peut &ecirc;tre d&eacute;sir&eacute;.
	Regardez les lignes d'exemple dans <filename>Xaccess</filename>,
	et r&eacute;f&eacute;rez-vous &agrave; la page de manuel
	&man.xdm.1;.</para>
    </sect2>

     <sect2>
        <title>Remplacements pour XDM</title>

        <para>Plusieurs remplacements pour le programme
	  <application>XDM</application> de d&eacute;faut existent.  L'un
	  d'eux, <application>KDM</application> (fourni avec
	  <application>KDE</application>) est d&eacute;crit plus loin dans son
	  propre chapitre.  <application>KDM</application> offre de
	  nombreuses am&eacute;liorations visuelles, ainsi que la fonction
	  permettant aux utilisateurs de s&eacute;lectionner leur gestionnaire
	  de fen&ecirc;tres au moment d'ouvrir la session.</para>
     </sect2>
  </sect1>

  <sect1 id="x11-wm">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Valentino</firstname>
	  <surname>Vaschetto</surname>
	  <contrib>Contribution de </contrib>
	</author>
	<!-- June 2001 -->
      </authorgroup>
    </sect1info>

    <title>Environnements de travail</title>

    <para>Cette section d&eacute;crit les diff&eacute;rents
      environnements de travail disponibles pour X sous FreeBSD.  Le
      terme d'&ldquo;environnement de travail&rdquo; regroupe tout
      depuis le simple gestionnaire de fen&ecirc;tres &agrave; la suite
      compl&egrave;te d'applications de bureau, comme
      <application>KDE</application> ou
      <application>GNOME</application>.</para>

    <sect2 id="x11-wm-gnome">
      <title>GNOME</title>

      <sect3 id="x11-wm-gnome-about">
        <title>A propos de GNOME</title>

	<indexterm><primary>GNOME</primary></indexterm>
        <para><application>GNOME</application> est un environnement de
	  travail convivial qui permet aux utilisateurs d'utiliser et de
	  configurer facilement leur ordinateur.
	  <application>GNOME</application> comprend un panneau -
	  &ldquo;panel&rdquo; (pour lancer des applications et afficher
	  des &eacute;tats), un bureau (o&ugrave; les donn&eacute;es et les
	  applications
	  peuvent prendre place), un ensemble d'outils standards de
	  bureau et d'applications, et un ensemble de conventions qui
	  rendent ais&eacute;e la coop&eacute;ration entre application et
	  leur coh&eacute;rence.  Les utilisateurs d'autres syst&egrave;mes
	  d'exploitation ou environnement devraient se sentir en terrain
	  de connaissance en utilisant le puissant environnement
	  graphique que fournit <application>GNOME</application>.
	  Plus d'information concernant
	  <application>GNOME</application> sous FreeBSD peut &ecirc;tre
	  trouv&eacute; sur le site du <ulink
	  url="http://www.FreeBSD.org/gnome">Projet FreeBSD
	  GNOME</ulink>.</para>
      </sect3>

      <sect3 id="x11-wm-gnome-install">
        <title>Installer GNOME</title>

	<para>La m&eacute;thode la plus simple pour installer
	  <application>GNOME</application> est d'utiliser le menu
	  &ldquo;Desktop Configuration&rdquo; durant le processus
	  d'installation de FreeBSD comme d&eacute;crit dans la <xref linkend="default-desktop"> du Chapitre&nbsp;2.
	  Il peut &eacute;galement &ecirc;tre facilement install&eacute;
	  &agrave; partir d'un
	  logiciel pr&eacute;-compil&eacute; ou du catalogue des logiciels
	  port&eacute;s:</para>

        <para>Pour installer l'ensemble de logiciels
	  pr&eacute;-compil&eacute;s <application>GNOME</application>
	  &agrave; partir du r&eacute;seau, tapez simplement:</para>

        <screen>&prompt.root; <userinput>pkg_add -r gnome2</userinput></screen>

        <para>Pour compiler <application>GNOME</application> &agrave; partir
	  des sources, utilisez le logiciel port&eacute;:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11/gnome2</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Une fois que <application>GNOME</application> est
	  install&eacute;, on doit signaler au serveur X d'ex&eacute;cuter
	  <application>GNOME</application> &agrave; la place du gestionnaire
	  de fen&ecirc;tre par d&eacute;faut.  Si un fichier
	  <filename>.xinitrc</filename> personnalis&eacute; est
	  d&eacute;j&agrave; en place, remplacez simplement la ligne qui lance
	  le gestionnaire de fen&ecirc;tres avec une qui ex&eacute;cute
	  <application>/usr/X11R6/bin/gnome-session</application> &agrave; la
	  place.  S'il n'y a rien de sp&eacute;cial &agrave; faire dans ce
	  fichier de configuration, alors il est suffisant de
	  taper:</para>

        <screen>&prompt.user; <userinput>echo "/usr/X11R6/bin/gnome-session" &gt; ~/.xinitrc</userinput></screen>

        <para>Ensuite, tapez <command>startx</command>, et
	  l'environnement de travail <application>GNOME</application>
	  sera lanc&eacute;.</para>

        <note><para>Si un gestionnaire d'affichage, comme
	  <application>XDM</application>, est utilis&eacute;, cela ne
	  fonctionnera pas.  A la place, cr&eacute;ez un fichier
	  ex&eacute;cutable <filename>.xsession</filename> contenant la
	  m&ecirc;me commande.  Pour cela, &eacute;ditez le fichier
	  et remplacez la commande correspondant au gestionnaire de
	  fen&ecirc;tres actuel avec
	  <application>/usr/X11R6/bin/gnome-session</application>:
	  </para></note>

        <screen>&prompt.user; <userinput>echo "#!/bin/sh" > ~/.xsession</userinput>
&prompt.user; <userinput>echo "/usr/X11R6/bin/gnome-session" >> ~/.xsession</userinput>
&prompt.user; <userinput>chmod +x ~/.xsession</userinput></screen>

        <para>Une autre option est de configurer le gestionnaire
	  d'affichage pour permettre la s&eacute;lection du gestionnaire de
	  fen&ecirc;tres au moment de l'ouverture de session; la section de
	  <link linkend="x11-wm-kde-details">compl&eacute;ments sur KDE</link>
	  explique comment le faire pour <application>kdm</application>, le
	  gestionnaire d'affichage de
	  <application>KDE</application>.</para>
      </sect3>

      <sect3 id="x11-wm-gnome-antialias">
	<title>Polices de caract&egrave;res anticr&eacute;nelage avec
	  GNOME</title>

	<indexterm><primary>GNOME</primary>
	  <secondary>polices de caract&egrave;res
	    anticr&eacute;nelage</secondary></indexterm>
	<para>Depuis la version 4.0.2,
	  <application>&xfree86;</application> supporte
	  l'anticr&eacute;nelage par l'interm&eacute;diaire de son extension
	  &ldquo;RENDER&ldquo;.  Gtk+ 2.0 et suivant (la bo&icirc;te &agrave;
	  outils utilis&eacute; par <application>GNOME</application>) peuvent
	  utiliser cette fonctionnalit&eacute;.  La configuration
	  de l'anticr&eacute;nelage est d&eacute;crite dans la <xref
	  linkend="antialias">.  Aussi, avec des logiciels &agrave;
	  jour, l'anticr&eacute;nelage est possible dans l'environnement
	  de travail <application>GNOME</application>.  Aller dans le
	  menu
	  <menuchoice>
	    <guimenu>Applications</guimenu>
	    <guisubmenu>Desktop Preferences</guisubmenu>
	    <guimenuitem>Font</guimenuitem>
	  </menuchoice>, et s&eacute;lectionnez soit
	  <guibutton>Best shapes</guibutton>, soit
	  <guibutton>Best contrast</guibutton>, ou
	  <guibutton>Subpixel smoothing (LCDs)</guibutton>.  Pour une
	  application Gtk+ qui ne fait pas partie de l'environnement
	  de travail <application>GNOME</application>, fixez la
	  variable d'environement <varname>GDK_USE_XFT</varname> &agrave;
	  <literal>1</literal> avant de lancer le programme.</para>
      </sect3>
    </sect2>

    <sect2 id="x11-wm-kde">
      <title>KDE</title>

      <indexterm><primary>KDE</primary></indexterm>
      <sect3 id="x11-wm-kde-about">
        <title>A propos de KDE</title>

        <para><application>KDE</application> est un environnement de
	  travail moderne facile d'emploi.  Quelques unes des choses
	  qu'apporte <application>KDE</application> aux utilisateurs
	  sont:</para>

        <itemizedlist>
          <listitem><para>Un magnifique bureau moderne</para></listitem>
          <listitem><para>Une utilisation r&eacute;seau compl&egrave;tement
	    transparente</para></listitem>
          <listitem><para>Un syst&egrave;me d'aide int&eacute;gr&eacute;
	    utile, pour un acc&egrave;s coh&eacute;rent &agrave; l'aide sur
	    l'utilisation de l'environnement
	    <application>KDE</application> et ses
	    applications</para></listitem>
          <listitem><para>Une apparence et une prise en main commune
	    pour toutes les applications
	    <application>KDE</application></para></listitem>
          <listitem><para>Des menus, barres d'outils, combinaisons de
	    touches, couleurs, etc... standardis&eacute;es</para></listitem>
          <listitem><para>Internationalisation: <application>KDE</application>
	    est disponible dans plus de 40 langues</para></listitem>
          <listitem><para>Un syst&egrave;me centralis&eacute; de configuration
	    de l'environnement</para></listitem>
          <listitem><para>Un grand nombre d'applications
	    <application>KDE</application> utiles</para></listitem>
        </itemizedlist>

        <para><application>KDE</application> dispose d'une suite
	  bureautique bas&eacute;e sur la technologie &ldquo;KParts&rdquo;
	  comprenant un tableur, un logiciel de pr&eacute;sentation, un
	  organiseur, un client pour forums de discussions et plus.
	  <application>KDE</application> est fourni &eacute;galement avec un
	  navigateur web appel&eacute; <application>Konqueror</application>,
	  qui repr&eacute;sente un solide concurrent aux autres navigateurs web
	  sous &unix;.  Plus d'information sur
	  <application>KDE</application> peut &ecirc;tre trouv&eacute; sur le
	  <ulink url="http://www.kde.org/">site de KDE</ulink>.  Pour
	  des informations et des ressources sp&eacute;cifiques &agrave;
	  l'utilisation de <application>KDE</application> sous
	  FreeBSD, consultez le site de l'<ulink
	  url="http://freebsd.kde.org/">&eacute;quipe
	  FreeBSD-/KDE</ulink>.</para>
      </sect3>

      <sect3 id="x11-wm-kde-install">
        <title>Installer KDE</title>

	<para>Juste comme avec <application>GNOME</application> ou tout
	  autre environnement de travail, la m&eacute;thode la plus
	  ais&eacute;e pour
	  installer <application>KDE</application> est d'utiliser le
	  menu &ldquo;Desktop Configuration&rdquo; durant le processus
	  d'installation de FreeBSD comme d&eacute;crit dans la
	  <xref linkend="default-desktop"> du  Chapitre 2.
	  Encore une fois, le logiciel peut &ecirc;tre ais&eacute;ment
	  install&eacute; &agrave;
	  partir des logiciels pr&eacute;-compil&eacute;s ou du catalogue des
	  logiciels port&eacute;s:</para>

        <para>Pour installer la version pr&eacute;-compil&eacute;e de
	  <application>KDE</application> &agrave; partir du r&eacute;seau,
	  tapez simplement:</para>

        <screen>&prompt.root; <userinput>pkg_add -r kde</userinput></screen>

	<para>&man.pkg.add.1; r&eacute;cup&eacute;rera automatiquement la
	  derni&egrave;re version de l'application.</para>

        <para>Pour compiler <application>KDE</application> &agrave; partir
	  des sources, utilisez le logiciel port&eacute;:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11/kde3</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Apr&egrave;s que <application>KDE</application> ait
	  &eacute;t&eacute; install&eacute;, on doit indiquer au serveur X de
	  lancer cette application &agrave; la place du gestionnaire de
	  fen&ecirc;tres par d&eacute;faut.
	  Ceci est effectu&eacute; en &eacute;ditant le fichier
	  <filename>.xinitrc</filename>:</para>

        <screen>&prompt.user; <userinput>echo "exec startkde" &gt; ~/.xinitrc</userinput></screen>

        <para>Maintenant, quand le syst&egrave;me X Window est invoqu&eacute;
	  avec la commande <command>startx</command>,
	  <application>KDE</application> sera l'environnement de
	  travail utilis&eacute;.</para>

	<para>Si un gestionnaire d'affichage comme
	  <application>XDM</application> est utilis&eacute;,
	  la configuration sera l&eacute;g&egrave;rement
	  diff&eacute;rente.  Editez le fichier <filename>.xsession</filename>
	  &agrave; la place.  Les instructions concernant
	  <application>kdm</application> seront donn&eacute;es plus
	  loin dans ce chapitre.</para>
      </sect3>
    </sect2>

    <sect2 id="x11-wm-kde-details">
        <title>Plus de d&eacute;tails sur KDE</title>

        <para>Maintenant que <application>KDE</application> est
	  install&eacute; sur le syst&egrave;me, la plupart des choses peuvent
	  &ecirc;tre d&eacute;couvertes &agrave; travers les pages d'aide, ou
	  juste en pointant
	  et cliquant sur les diff&eacute;rents menus.  Les utilisateurs de
	  &windows; ou de &mac; se sentiront presque en terrain de
	  connaissance.</para>

        <para>La meilleure r&eacute;f&eacute;rence pour
	  <application>KDE</application> est la documentation en ligne.
	  <application>KDE</application> est livr&eacute; avec son propre
	  navigateur internet <application>Konqueror</application>, et
	  des douzaines d'applications utiles, et une large
	  documentation.  Le reste de cette section traite
	  d'&eacute;l&eacute;ments
	  techniques qui sont difficiles &agrave; apprendre par une exploration
	  au hasard.</para>

      <sect3 id="x11-wm-kde-kdm">
        <title>Le gestionnaire d'affichage de KDE</title>

	<indexterm><primary>KDE</primary>
	  <secondary>gestionnaire d'affichage</secondary></indexterm>
        <para>L'administrateur d'un syst&egrave;me multi-utilisateurs peut
	  d&eacute;sirer avoir un &eacute;cran graphique d'ouverture de
	  session pour accueillir les utilisateurs.
	  <link linkend="x-xdm"><filename>xdm</filename></link> peut
	  &ecirc;tre utilis&eacute; comme d&eacute;crit plus t&ocirc;t.
	  Cependant, <application>KDE</application> inclus une alternative,
	  <application>kdm</application>, qui est con&ccedil;ue pour
	  para&icirc;tre
	  plus attractive et inclure plus d'options d'ouverture de
	  session.  En particulier, les utilisateurs peuvent facilement
	  (par l'interm&eacute;diaire d'un menu) s&eacute;lectionner quel
	  environnement de travail (<application>KDE</application>,
	  <application>GNOME</application>, ou quelque chose d'autre)
	  ex&eacute;cuter apr&egrave;s l'ouverture de session.</para>

	<para>Pour commencer, ex&eacute;cutez le panneau de
	  contr&ocirc;le de <application>KDE</application>,
	  <command>kcontrol</command>, en tant que
	  <username>root</username>.  Il est g&eacute;n&eacute;ralement
	  consid&eacute;r&eacute; comme imprudent d'ex&eacute;cuter
	  l'int&eacute;gralit&eacute; de l'environnement X avec les
	  privil&egrave;ges de <username>root</username>.  A la place,
	  ex&eacute;cutez
	  le gestionnaire de fen&ecirc;tres en tant qu'utilisateur ordinaire,
	  ouvrez une fen&ecirc;tre de terminal (comme
	  <filename>xterm</filename> ou <filename>konsole</filename> de
	  <application>KDE</application>), devenez <username>root</username>
	  avec <userinput>su</userinput> (l'utilisateur doit &ecirc;tre dans
	  le groupe <groupname>wheel</groupname> dans le fichier
	  <filename>/etc/group</filename> pour cela), puis ensuite
	  tapez <userinput>kcontrol</userinput>.</para>

	<para>Cliquez sur l'icone sur la gauche marqu&eacute;e
	  <guibutton>System</guibutton>, puis sur <guibutton>Login
	  manager</guibutton>.  Sur la droite il y a diverses options
	  configurables, que le manuel de <application>KDE</application>
	  expliquera plus en d&eacute;tail.  Cliquez sur
	  <guibutton>sessions</guibutton> sur la droite.  Cliquez
	  <guibutton>New type</guibutton> pour ajouter divers
	  gestionnaires de fen&ecirc;tres et environnements de travail.  Ce
	  sont juste des &eacute;tiquettes, donc il peuvent afficher
	  <application>KDE</application> et <application>GNOME</application>
	  plut&ocirc;t que <application>startkde</application> ou
	  <application>gnome-session</application>.  Ajoutez une
	  &eacute;tiquette <literal>failsafe</literal>.</para>

	<para>Essayez les autres menus &eacute;galement, ils sont
	  principalement cosm&eacute;tique et explicites.  Quand vous
	  avez termin&eacute;, cliquez sur <guibutton>Apply</guibutton> en bas,
	  et quittez le centre de contr&ocirc;le.</para>

        <para>Pour &ecirc;tre s&ucirc;r que
	  <application>kdm</application> comprenne ce que les
	  &eacute;tiquettes (<application>KDE</application>,
	  <application>GNOME</application> etc...) signifient, &eacute;ditez
	  les fichiers utilis&eacute;s par <link linkend="x-xdm">xdm</link>.
	  <note><para>Dans <application>KDE 2.2</application> ceci a
	    &eacute;t&eacute; modifi&eacute;: <application>kdm</application>
	    utilise d&eacute;sormais ses propres fichiers de configuration.
	    Veuillez consulter la documentation de <application>KDE
	    2.2</application> pour plus de d&eacute;tails.</para>
	  </note>
	  Dans une fen&ecirc;tre de terminal, en tant que
	  <username>root</username>, &eacute;ditez le fichier
	  <filename>/usr/X11R6/lib/X11/xdm/Xsession</filename>.  Il y a
	  une section au milieu comme celle-ci:</para>

<screen>case $# in
1)
        case $1 in
        failsafe)
                exec xterm -geometry 80x24-0-0
                ;;
        esac
esac</screen>
        <para>Quelques lignes doivent &ecirc;tre ajout&eacute;es
	  &agrave; cette section.  En supposant que les &eacute;tiquettes
	  utilis&eacute;es &eacute;taient &ldquo;KDE&rdquo; et
	  &ldquo;GNOME&ldquo;, utilisez ce qui suit:</para>
<screen>case $# in
1)
        case $1 in
        kde)
                exec /usr/local/bin/startkde
                ;;
        GNOME)
                exec /usr/X11R6/bin/gnome-session
                ;;
        failsafe)
                exec xterm -geometry 80x24-0-0
                ;;
        esac
esac</screen>

        <para>Pour avoir le fond d'&eacute;cran de l'environnement
	  <application>KDE</application> durant la proc&eacute;dure
	  de connexion, la ligne suivante doit &ecirc;tre
	  ajout&eacute;e au fichier
	  <filename>/usr/X11R6/lib/X11/xdm/Xsetup_0</filename>:</para>
        <screen>/usr/local/bin/kdmdesktop</screen>

        <para>Maintenant, v&eacute;rifiez que <application>kdm</application>
	  est list&eacute; dans <filename>/etc/ttys</filename> pour
	  &ecirc;tre ex&eacute;cut&eacute; au prochain
	  d&eacute;marrage.  Pour cela, suivez simplement les instructions
	  de la section pr&eacute;cedente sur
	  <link linkend="x-xdm">xdm</link> et remplacez les
	  r&eacute;f&eacute;rences au programme
	  <command>/usr/X11R6/bin/xdm</command> par
	  <command>/usr/local/bin/kdm</command>.</para>
      </sect3>

      <sect3 id="x11-wm-kde-antialias">
        <title>Polices de caract&egrave;res anticr&eacute;nelage</title>

	<indexterm><primary>KDE</primary>
	  <secondary>polices de caract&egrave;res
	    anticr&eacute;nelage</secondary></indexterm>
        <para>Introduit avec la version 4.0.2,
	  <application>&xfree86;</application> supporte
	  l'anticr&eacute;nelage par l'interm&eacute;diaire de son extension
	  &ldquo;RENDER&rdquo;, et introduit avec la version 2.3, Qt
	  (le &ldquo;toolkit&rdquo; utilis&eacute; par
	  <application>KDE</application>) supporte cette extension.  La
	  configuration de ceci est d&eacute;crite dans la <xref
	  linkend="antialias"> sur les polices X11 anticr&eacute;nelage.
	  Donc avec des logiciels &agrave; jour, l'anticr&eacute;nelage est
	  possible sous un environnement <application>KDE</application>.
	  Rendez vous dans le menu de KDE2, aller dans
	  <menuchoice>
	    <guimenuitem>Preferences</guimenuitem>
	    <guimenuitem>Look and Feel</guimenuitem>
	    <guimenuitem>Fonts</guimenuitem>
	  </menuchoice>, et cliquez sur la bo&icirc;te
	  &agrave; cocher
	  <guibutton>Use Anti-Aliasing for Fonts and Icons</guibutton>.
	  Pour une application Qt qui ne fait pas partie de
	  <application>KDE</application>, la variable d'environnement
	  <varname>QT_XFT</varname> doit &ecirc;tre fix&eacute;e &agrave; la
	  valeur true avant de lancer le programme.</para>

       </sect3>
     </sect2>

     <sect2 id="x11-wm-xfce">
         <title>XFce</title>
       <sect3 id="x11-wm-xfce-about">
         <title>A propos d'XFce</title>

	<para><application>XFce</application> est un environnement de
	  travail bas&eacute; sur le &ldquo;toolkit&rdquo; GTK
	  utilis&eacute; par <application>GNOME</application>, mais est
	  plus l&eacute;ger et est destin&eacute; &agrave; ceux qui veulent
	  un bureau simple, et efficace qui est n&eacute;anmoins facile
	  d'utilisation et de configuration.  Visuellement, il ressemble
	  &eacute;norm&eacute;ment &agrave; <application>CDE</application>,
	  que l'on trouve sur les syst&egrave;mes &unix; commerciaux.
	  Quelques unes des caract&eacute;ristiques
	  d'<application>XFce</application> sont:</para>

         <itemizedlist>
           <listitem><para>Un bureau de prise en main ais&eacute;e et
	     simple</para></listitem>
           <listitem><para>Compl&egrave;tement configurable &agrave; la
	     souris, avec glisser-d&eacute;poser, etc...</para></listitem>
           <listitem><para>Une barre principale similaire &agrave;
	     <application>CDE</application>, avec des menus, des petites
	     applications et des lanceurs d'applications</para></listitem>
           <listitem><para>Un gestionnaire de fen&ecirc;tre
	     int&eacute;gr&eacute;, un gestionnaire de fichiers, un
	     gestionnaire du son, un module de compatibilit&eacute;
	     <application>GNOME</application>, et d'autres
	     choses</para></listitem>
           <listitem><para>Personnalisable avec des th&egrave;mes (comme il
	     utilise GTK)</para></listitem>
           <listitem><para>Rapide, l&eacute;ger et efficace: id&eacute;al
	     pour les machines vieilles/lentes ou avec des limitations en
	     m&eacute;moire</para></listitem>
         </itemizedlist>

         <para>Plus d'information sur <application>XFce</application>
	   peut &ecirc;tre trouv&eacute; sur le <ulink
	   url="http://www.xfce.org/">site d'XFce</ulink>.</para>
       </sect3>
       <sect3 id="x11-wm-xfce-install">
         <title>Installer XFce</title>

	<para>Une version pr&eacute;-compil&eacute;e
	  d'<application>XFce</application> existe (au moment
	  o&ugrave; ces lignes sont &eacute;crites).  Pour
	  installer, tapez simplement:</para>

        <screen>&prompt.root; <userinput>pkg_add -r xfce4</userinput></screen>

        <para>Alternativement, pour compiler &agrave; partir des sources,
	  utilisez le catalogue des logiciels port&eacute;s:</para>

        <screen>&prompt.root; <userinput>cd /usr/ports/x11-wm/xfce4</userinput>
&prompt.root; <userinput>make install clean</userinput></screen>

        <para>Maintenant, il faut indiquer au serveur X d'ex&eacute;cuter
	  <application>XFce</application> au prochain d&eacute;marrage d'X.
	  Tapez ceci:</para>

        <screen>&prompt.user; <userinput>echo "/usr/X11R6/bin/startxfce4" &gt; ~/.xinitrc</userinput></screen>

        <para>Au prochain d&eacute;marrage d'X,
	  <application>XFce</application> sera l'environnement de
	  travail.  Comme pr&eacute;c&eacute;demment, si un gestionnaire
	  d'affichage comme <filename>xdm</filename> est utilis&eacute;,
	  cr&eacute;ez un fichier <filename>.xsession</filename>, comme
	  d&eacute;crit dans la section sur <link
	  linkend="x11-wm-gnome">GNOME</link>, mais avec la commande
	  <filename>/usr/X11R6/bin/startxfce4</filename>; ou configurez
	  le gestionnaire d'affichage pour permettre la s&eacute;lection d'un
	  environnement de travail au moment de la connexion, comme
	  expliqu&eacute; dans la section sur <link
	  linkend="x11-wm-kde-kdm">kdm</link>.</para>

      </sect3>
    </sect2>
  </sect1>

</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
