Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/audit/_index.po
Languages: ko, ru

source: FreeBSD security event auditing supports reliable, fine-grained, and configurable logging of a variety of security-relevant system events, including logins, configuration changes, and file and network access
ko: FreeBSD 보안 이벤트 감사는 로그인, 구성 변경, 파일 및 네트워크 액세스 등 다양한 보안 관련 시스템 이벤트에 대한 안정적이고 세밀하며 구성 가능한 로깅을 지원합니다
ru: В FreeBSD поддерживается аудит событий безопасности, обеспечивающий надежное, детализированное и настраиваемое журналирование различных системных событий, связанных с безопасностью, включая входы в систему, изменения конфигурации, а также доступ к файлам и сети

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 18. Security Event Auditing
ko: 18장. 보안 이벤트 감사

source: Security Event Auditing
ko: 보안 이벤트 감사
ru: Аудит событий безопасности

source: Synopsis
ko: 요약
ru: Обзор

source: The FreeBSD operating system includes support for security event auditing. Event auditing supports reliable, fine-grained, and configurable logging of a variety of security-relevant system events, including logins, configuration changes, and file and network access. These log records can be invaluable for live system monitoring, intrusion detection, and postmortem analysis. FreeBSD implements Sun(TM)'s published Basic Security Module (BSM) Application Programming Interface (API) and file format, and is interoperable with the Solaris(TM) and Mac OS(R) X audit implementations.
ko: FreeBSD 운영 체제는 보안 이벤트 감사를 지원합니다. 이벤트 감사는 로그인, 구성 변경, 파일 및 네트워크 액세스 등 다양한 보안 관련 시스템 이벤트에 대한 안정적이고 세밀하며 구성 가능한 로깅을 지원합니다. 이러한 로그 기록은 실시간 시스템 모니터링, 침입 탐지 및 사후 분석에 매우 유용할 수 있습니다. FreeBSD는 Sun(TM)의 공개된 기본 보안 모듈(BSM) 애플리케이션 프로그래밍 인터페이스(API) 및 파일 형식을 구현하며 Solaris(TM) 및 Mac OS(R) X 감사 구현과 상호 운용이 가능합니다.
ru: Операционная система FreeBSD включает поддержку аудита событий безопасности. Аудит событий обеспечивает надежное, детализированное и настраиваемое журналирование различных системных событий, связанных с безопасностью, включая входы в систему, изменения конфигурации, доступ к файлам и сети. Эти записи журнала могут быть неоценимыми для мониторинга системы в реальном времени, обнаружения вторжений и "посмертного" анализа после краха системы. FreeBSD реализует опубликованный Sun(TM) программный интерфейс Basic Security Module (BSM) и формат файлов, и также совместима с реализациями аудита Solaris(TM) и Mac OS(R) X.

source: This chapter focuses on the installation and configuration of event auditing. It explains audit policies and provides an example audit configuration.
ko: 이 장에서는 이벤트 감사 설치 및 구성에 중점을 둡니다. 감사 정책을 설명하고 감사 구성 예제를 제공합니다.
ru: Эта глава посвящена установке и настройке аудита событий. В ней объясняются политики аудита и приводится пример конфигурации аудита.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: What event auditing is and how it works.
ko: 이벤트 감사란 무엇이며 어떻게 작동하는지.
ru: Что такое аудит событий и как он работает.

source: How to configure event auditing on FreeBSD for users and processes.
ko: 사용자 및 프로세스에 대해 FreeBSD에서 이벤트 감사를 구성하는 방법.
ru: Как настроить аудит событий в FreeBSD для пользователей и процессов.

source: How to review the audit trail using the audit reduction and review tools.
ko: 감사 축소 및 검토 도구를 사용하여 감사 추적을 검토하는 방법.
ru: Как просмотреть журнал аудита с использованием инструментов сокращения и просмотра аудита.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Understand UNIX(R) and FreeBSD basics (crossref:basics[basics,FreeBSD Basics]).
ko: UNIX(R) 및 FreeBSD 기본 사항을 이해합니다(crossref:basics[basics,FreeBSD Basics]).
ru: Понимать основы UNIX(R) и FreeBSD (crossref:basics[basics,Основы FreeBSD]).

source: Be familiar with the basics of kernel configuration/compilation (crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]).
ko: 커널 구성/컴파일의 기본 사항에 익숙해야 합니다 (crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]).
ru: Быть знакомым с основами настройки и компиляции ядра (crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]).

source: Have some familiarity with security and how it pertains to FreeBSD (crossref:security[security,Security]).
ko: 보안과 그것이 FreeBSD와 어떻게 관련되어 있는지 어느 정도 알고 있어야 합니다(crossref:security[security,Security]).
ru: Иметь некоторое представление о безопасности и о том, как она относится к FreeBSD (crossref:security[security,Безопасность]).

source: The audit facility has some known limitations. Not all security-relevant system events are auditable and some login mechanisms, such as Xorg-based display managers and third-party daemons, do not properly configure auditing for user login sessions.
ko: 감사 기능에는 몇 가지 알려진 제한 사항이 있습니다. 모든 보안 관련 시스템 이벤트를 감사할 수 있는 것은 아니며, Xorg 기반 디스플레이 관리자 및 타사 데몬과 같은 일부 로그인 메커니즘은 사용자 로그인 세션에 대한 감사를 제대로 구성하지 못합니다.
ru: У системы аудита есть несколько известных ограничений. Не все связанные с безопасностью системные события подлежат аудиту, а некоторые механизмы входа, такие как дисплейные менеджеры на основе Xorg и сторонние демоны, не настраивают аудит для сеансов пользовательского входа должным образом.

source: The security event auditing facility is able to generate very detailed logs of system activity. On a busy system, trail file data can be very large when configured for high detail, exceeding gigabytes a week in some configurations. Administrators should take into account the disk space requirements associated with high volume audit configurations. For example, it may be desirable to dedicate a file system to [.filename]#/var/audit# so that other file systems are not affected if the audit file system becomes full.
ko: 보안 이벤트 감사 기능은 시스템 활동에 대한 매우 상세한 로그를 생성할 수 있습니다. 사용량이 많은 시스템에서 세밀하게 구성하면 추적 파일 데이터가 매우 커질 수 있으며, 일부 구성에서는 일주일에 기가바이트를 초과할 수도 있습니다. 관리자는 대용량 감사 구성과 관련된 디스크 공간 요구 사항을 고려해야 합니다. 예를 들어, 감사 파일 시스템이 꽉 차더라도 다른 파일 시스템이 영향을 받지 않도록 [.filename]#/var/audit#에 파일 시스템을 전용으로 지정하는 것이 바람직할 수 있습니다.
ru: Система аудита событий безопасности способна создавать очень подробные журналы активности системы. На загруженной системе данные файлов журналов могут быть очень большими при настройке высокой детализации, в некоторых конфигурациях превышая гигабайты в неделю. Администраторы должны учитывать требования к дисковому пространству, связанные с конфигурациями аудита с высоким объемом данных. Например, может быть целесообразно выделить отдельную файловую систему для [.filename]#/var/audit#, чтобы другие файловые системы не пострадали, если файловая система аудита переполнится.

source: Key Terms
ko: 핵심 용어
ru: Ключевые термины

source: The following terms are related to security event auditing:
ko: 다음 용어는 보안 이벤트 감사와 관련된 용어입니다:
ru: Следующие термины связаны с аудитом событий безопасности:

source: _event_: an auditable event is any event that can be logged using the audit subsystem. Examples of security-relevant events include the creation of a file, the building of a network connection, or a user logging in. Events are either "attributable", meaning that they can be traced to an authenticated user, or "non-attributable". Examples of non-attributable events are any events that occur before authentication in the login process, such as bad password attempts.
ko: _event_: 감사 가능한 이벤트는 감사 하위 시스템을 사용하여 기록할 수 있는 모든 이벤트입니다. 보안 관련 이벤트의 예로는 파일 생성, 네트워크 연결 구축, 사용자 로그인 등이 있습니다. 이벤트는 인증된 사용자로 추적할 수 있는 "attributable" 이벤트이거나 "non-attributable"이벤트입니다. Non-attributable의 예로는 잘못된 비밀번호 시도와 같이 로그인 프로세스에서 인증 전에 발생하는 모든 이벤트가 있습니다.
ru: _событие (event)_: аудируемое событие — это любое событие, которое может быть зарегистрировано с помощью подсистемы аудита. Примерами событий, связанных с безопасностью, являются создание файла, установка сетевого соединения или вход пользователя в систему. События могут быть "приписываемые", то есть их можно отследить до аутентифицированного пользователя, или "неприписываемые". Примерами неприписываемых событий являются любые события, происходящие до аутентификации в процессе входа в систему, например, неудачные попытки ввода пароля.

source: _class_: a named set of related events which are used in selection expressions. Commonly used classes of events include "file creation" (fc), "exec" (ex), and "login_logout" (lo).
ko: _class_: 선택 표현식에 사용되는 관련 이벤트의 명명된 집합입니다. 일반적으로 사용되는 이벤트 클래스로는 "file creation" (fc), "exec" (ex), "login_logout" (lo) 등이 있습니다.
ru: _класс (class)_: именованный набор связанных событий, используемых в выражениях выбора. Распространённые классы событий включают "создание файла" (fc), "выполнение" (ex) и "вход/выход" (lo).

source: _record_: an audit log entry describing a security event. Records contain a record event type, information on the subject (user) performing the action, date and time information, information on any objects or arguments, and a success or failure condition.
ko: _record_: 보안 이벤트를 설명하는 감사 로그 항목. 레코드에는 레코드 이벤트 유형, 작업을 수행하는 주체(사용자)에 대한 정보, 날짜 및 시간 정보, 모든 개체 또는 인수에 대한 정보, 성공 또는 실패 조건이 포함됩니다.
ru: _запись (record)_: запись в журнале аудита, описывающая событие безопасности. Записи содержат тип события, информацию о субъекте (пользователе), выполняющем действие, данные о дате и времени, информацию об объектах или аргументах, а также указание на успешность или неудачу выполнения.

source: _trail_: a log file consisting of a series of audit records describing security events. Trails are in roughly chronological order with respect to the time events completed. Only authorized processes are allowed to commit records to the audit trail.
ko: _trail_: 보안 이벤트를 설명하는 일련의 감사 레코드로 구성된 로그 파일입니다. 트레일은 이벤트가 완료된 시간을 기준으로 대략 시간순으로 정렬됩니다. 권한이 있는 프로세스만 감사 추적에 레코드를 커밋할 수 있습니다.
ru: _журнал (trail)_: файл журнала, состоящий из серии записей аудита, описывающих события безопасности. Записи в журнале расположены в приблизительном хронологическом порядке относительно времени завершения событий. Только авторизованные процессы имеют право добавлять записи в журнал аудита.

source: _selection expression_: a string containing a list of prefixes and audit event class names used to match events.
ko: _selection expression_: 이벤트를 일치시키는 데 사용되는 접두사 및 감사 이벤트 클래스 이름 목록이 포함된 문자열입니다.
ru: _выражение выбора (selection expression)_: строка, содержащая список префиксов и имен классов событий аудита, используемых для сопоставления событий.

source: _preselection_: the process by which the system identifies which events are of interest to the administrator. The preselection configuration uses a series of selection expressions to identify which classes of events to audit for which users, as well as global settings that apply to both authenticated and unauthenticated processes.
ko: _preselection_: 시스템이 관리자가 관심을 가질 만한 이벤트를 식별하는 프로세스입니다. 사전 선택 구성은 일련의 선택 표현식을 사용하여 인증된 프로세스와 인증되지 않은 프로세스 모두에 적용되는 전역 설정뿐만 아니라 어떤 이벤트 클래스를 어떤 사용자에 대해 감사할지 식별합니다.
ru: _предварительный выбор (preselection)_: процесс, в ходе которого система определяет, какие события представляют интерес для администратора. Конфигурация предварительного отбора использует ряд выражений выбора для определения классов событий, подлежащих аудиту для конкретных пользователей, а также глобальные настройки, применяемые как к авторизованным, так и к неавторизованным процессам.

source: _reduction_: the process by which records from existing audit trails are selected for preservation, printing, or analysis. Likewise, the process by which undesired audit records are removed from the audit trail. Using reduction, administrators can implement policies for the preservation of audit data. For example, detailed audit trails might be kept for one month, but after that, trails might be reduced in order to preserve only login information for archival purposes.
ko: _reduction_: 기존 감사 추적에서 보존, 인쇄 또는 분석을 위해 레코드가 선택되는 프로세스입니다. 마찬가지로, 원치 않는 감사 레코드가 감사 추적에서 제거되는 프로세스입니다. 관리자는 축소를 사용하여 감사 데이터 보존을 위한 정책을 구현할 수 있습니다. 예를 들어, 자세한 감사 추적은 한 달 동안 보관하지만 그 이후에는 보관 목적으로 로그인 정보만 보존하기 위해 추적을 축소할 수 있습니다.
ru: _фильтрация (reduction)_: процесс выбора записей из существующих журналов аудита для сохранения, печати или анализа. Аналогично, процесс удаления нежелательных записей аудита из журнала. Используя сокращение, администраторы могут реализовать политики сохранения данных аудита. Например, детальные журналы аудита могут храниться в течение одного месяца, но после этого они могут быть сокращены, чтобы сохранить только информацию о входах в систему для архивных целей.

source: Audit Configuration
ko: 감사 구성
ru: Настройка аудита

source: User space support for event auditing is installed as part of the base FreeBSD operating system. Kernel support is available in the [.filename]#GENERIC# kernel by default, and man:auditd[8] can be enabled by adding the following line to [.filename]#/etc/rc.conf#:
ko: 이벤트 감사를 위한 사용자 공간 지원은 기본 FreeBSD 운영 체제의 일부로 설치됩니다. 커널 지원은 기본적으로 [.filename]#GENERIC# 커널에서 사용할 수 있으며, [.filename]#/etc/rc.conf#에 다음 줄을 추가하여 man:auditd[8]를 사용하도록 설정할 수 있습니다:
ru: Поддержка аудита событий в пользовательском пространстве устанавливается как часть базовой операционной системы FreeBSD. Поддержка на уровне ядра доступна в ядре [.filename]#GENERIC# по умолчанию, и man:auditd[8] может быть включен добавлением следующей строки в [.filename]#/etc/rc.conf#:

source: Then, start the audit daemon:
ko: 그런 다음 감사 데몬을 시작합니다:
ru: Затем запустите демон аудита:

source: Users who prefer to compile a custom kernel must include the following line in their custom kernel configuration file:
ko: 사용자 정의 커널을 컴파일하려는 사용자는 사용자 정의 커널 구성 파일에 다음 줄을 포함해야 합니다:
ru: Пользователи, предпочитающие компилировать собственное ядро, должны включить следующую строку в файл конфигурации своего ядра:

source: Event Selection Expressions
ko: 이벤트 선택 표현식
ru: Выражения выбора событий

source: Selection expressions are used in a number of places in the audit configuration to determine which events should be audited. Expressions contain a list of event classes to match. Selection expressions are evaluated from left to right, and two expressions are combined by appending one onto the other.
ko: 선택 표현식은 감사 구성의 여러 위치에서 감사할 이벤트를 결정하기 위해 사용됩니다. 표현식에는 일치시킬 이벤트 클래스 목록이 포함되어 있습니다. 선택 표현식은 왼쪽에서 오른쪽으로 평가되며, 두 표현식은 다른 표현식에 하나를 추가하여 결합됩니다.
ru: Выражения выбора используются в нескольких местах конфигурации аудита для определения, какие события должны аудироваться. Выражения содержат список классов событий для сопоставления. Выражения выбора вычисляются слева направо, а два выражения объединяются путем добавления одного к другому.

source: <<event-selection>> summarizes the default audit event classes:
ko: <<event-selection>>에는 기본 감사 이벤트 클래스가 요약되어 있습니다:

source: Default Audit Event Classes
ko: 기본 감사 이벤트 클래스
ru: Классы событий аудита по умолчанию

source: Class Name
ko: Class 이름
ru: Имя класса

source: Description
ko: 설명
ru: Описание

source: Action
ko: 동작
ru: Действие

source: Match all event classes.
ko: 모든 이벤트 클래스를 매치합니다.
ru: Совпадает со всеми классами событий.

source: authentication and authorization
ko: 인증 및 승인

source: administrative
ko: 관리

source: Administrative actions performed on the system as a whole.
ko: 시스템 전체에서 수행된 관리 작업입니다.
ru: Административные действия, выполняемые с системой в целом.

source: application
ko: 애플리케이션

source: Application defined action.
ko: 애플리케이션이 정의한 작업.
ru: Определенное приложением действие.

source: Audit calls to the `close` system call.
ko: `close`시스템 호출에 대한 호출을 감사합니다.
ru: Аудит вызовов системного вызова `close`.

source: Audit program execution. Auditing of command line arguments and environmental variables is controlled via man:audit_control[5] using the `argv` and `envv` parameters to the `policy` setting.
ko: 프로그램 실행을 감사합니다. 명령줄 인수와 환경 변수에 대한 감사는 `policy` 설정에 `argv` 및 `envv` 매개변수를 사용하는 man:audit_control[5]을 통해 제어할 수 있습니다.
ru: Аудит выполнения программ. Аудит аргументов командной строки и переменных окружения контролируется через man:audit_control[5] с использованием параметров `argv` и `envv` в настройке `policy`.

source: file attribute access
ko: 파일 속성 접근

source: Audit the access of object attributes such as man:stat[1] and man:pathconf[2].
ko: man:stat[1] 및 man:pathconf[2]와 같은 객체 속성의 접근을 감사합니다.
ru: Аудит доступа к атрибутам объектов, таким как man:stat[1] и man:pathconf[2].

source: file create
ko: 파일 생성

source: Audit events where a file is created as a result.
ko: 결과적으로 파일이 생성된 이벤트를 감사합니다.
ru: События аудита, в результате которых создается файл.

source: file delete
ko: 파일 삭제

source: Audit events where file deletion occurs.
ko: 파일 삭제가 발생한 이벤트를 감사합니다.
ru: Аудит событий, в которых происходит удаление файлов.

source: file attribute modify
ko: 파일 속성 변경

source: Audit events where file attribute modification occurs, such as by man:chown[8], man:chflags[1], and man:flock[2].
ko: man:chown[8], man:chflags[1], man:flock[2]과 같이 파일 속성 수정이 발생하는 이벤트를 감사합니다.
ru: События аудита, связанные с изменением атрибутов файлов, например, с помощью man:chown[8], man:chflags[1] и man:flock[2].

source: file read
ko: 파일 읽기

source: Audit events in which data is read or files are opened for reading.
ko: 데이터를 읽거나 읽기 위해 파일을 연 이벤트를 감사합니다.
ru: События аудита, в которых данные читаются или файлы открываются для чтения.

source: file write
ko: 파일 쓰기

source: Audit events in which data is written or files are written or modified.
ko: 데이터가 기록되거나 파일이 작성 또는 수정되는 이벤트를 감사합니다.
ru: События аудита, в которых данные записываются или файлы создаются либо изменяются.

source: Audit use of the `ioctl` system call.
ko: `ioctl` 시스템 호출을 사용한 이벤트를 감사합니다.
ru: Контроль использования системного вызова `ioctl`.

source: Audit various forms of Inter-Process Communication, including POSIX pipes and System V IPC operations.
ko: POSIX 파이프 및 System V IPC 작업을 포함한 다양한 형태의 프로세스 간 통신을 감사합니다.
ru: Аудит различных форм межпроцессного взаимодействия, включая POSIX-каналы и операции System V IPC.

source: Audit man:login[1] and man:logout[1] events.
ko: man:login[1] 및 man:logout[1] 이벤트를 감사합니다.
ru: Audit man:login[1] и man:logout[1] события.

source: Audit non-attributable events.
ko: Non-attributable 이벤트를 감사합니다.
ru: Аудит неприписываемых событий.

source: invalid class
ko: 잘못된 클래스
ru: ошибочный класс

source: Match no audit events.
ko: 감사 이벤트와 일치하는 항목이 없습니다.
ru: Не соответствует ни одному событию аудита.

source: network
ko: 네트워크

source: Audit events related to network actions such as man:connect[2] and man:accept[2].
ko: man:connect[2] 및 man:accept[2]와 같은 네트워크 작업과 관련된 이벤트를 감사합니다.
ru: События аудита, связанные с сетевыми действиями, такими как man:connect[2] и man:accept[2].

source: Audit miscellaneous events.
ko: 기타 이벤트를 감사합니다.
ru: Аудит различных событий.

source: process
ko: 프로세스

source: Audit process operations such as man:exec[3] and man:exit[3].
ko: man:exec[3] 및 man:exit[3]와 같은 프로세스 작업을 감사합니다.
ru: Аудит операций процессов, таких как man:exec[3] и man:exit[3].

source: These audit event classes may be customized by modifying the [.filename]#audit_class# and [.filename]#audit_event# configuration files.
ko: 이러한 감사 이벤트 클래스는 [.filename]#audit_class# 및 [.filename]#audit_event# 구성 파일을 수정하여 사용자 지정할 수 있습니다.
ru: Эти классы событий аудита могут быть настроены путем изменения конфигурационных файлов [.filename]#audit_class# и [.filename]#audit_event#.

source: Each audit event class may be combined with a prefix indicating whether successful/failed operations are matched, and whether the entry is adding or removing matching for the class and type. <<event-prefixes>> summarizes the available prefixes:
ko: 각 감사 이벤트 클래스는 성공/실패한 작업의 일치 여부와 항목이 클래스 및 유형에 대한 일치를 추가 또는 제거하는지를 나타내는 접두사와 결합할 수 있습니다. <<event-prefixes>>에는 사용 가능한 접두사가 요약되어 있습니다:

source: Prefixes for Audit Event Classes
ko: 감사 이벤트 클래스의 접두사
ru: Префиксы для классов событий аудита

source: Prefix
ko: 접두사
ru: Префикс

source: Audit successful events in this class.
ko: 이 클래스의 성공한 이벤트를 감사합니다.
ru: Аудит успешных событий в этом классе.

source: Audit failed events in this class.
ko: 이 클래스에서 실패한 이벤트를 감사합니다.
ru: Аудит неудачных событий в этом классе.

source: Audit neither successful nor failed events in this class.
ko: 이 클래스에서 성공하거나 실패한 이벤트 모두를 감사합니다.
ru: Не аудировать ни успешные, ни неудачные события в этом классе.

source: Do not audit successful events in this class.
ko: 이 클래스에서 성공한 이벤트를 감사하지 마시오.
ru: Не аудировать успешные события в данном классе.

source: Do not audit failed events in this class.
ko: 이 클래스에서 실패한 이벤트를 감사하지 마시오.
ru: Не аудировать неудачные события в этом классе.

source: If no prefix is present, both successful and failed instances of the event will be audited.
ko: 접두사가 없는 경우 이벤트의 성공 및 실패 인스턴스 모두 감사합니다.
ru: Если префикс отсутствует, будут аудироваться как успешные, так и неудачные экземпляры события.

source: The following example selection string selects both successful and failed login/logout events, but only successful execution events:
ko: 다음 예제 선택 문자열은 성공 및 실패 로그인/로그아웃 이벤트를 모두 선택하지만 실행 성공 이벤트만 감사합니다:
ru: Следующая строка выбора выбирает как успешные, так и неудачные события входа/выхода, но только успешные события выполнения:

source: Configuration Files
ko: 구성 파일
ru: Файлы конфигурации

source: The following configuration files for security event auditing are found in [.filename]#/etc/security#:
ko: 보안 이벤트 감사를 위한 다음 구성 파일은 [.filename]#/etc/security#에 있습니다:
ru: В каталоге [.filename]#/etc/security# находятся следующие файлы конфигурации для аудита событий безопасности:

source: [.filename]#audit_class#: contains the definitions of the audit classes.
ko: [.filename]#audit_class#: 감사 클래스의 정의가 포함되어 있습니다.
ru: [.filename]#audit_class#: содержит определения классов аудита.

source: [.filename]#audit_control#: controls aspects of the audit subsystem, such as default audit classes, minimum disk space to leave on the audit log volume, and maximum audit trail size.
ko: [.filename]#audit_control#: 기본 감사 클래스, 감사 로그 볼륨에 남겨둘 최소 디스크 공간, 최대 감사 추적 크기 등 감사 서브시스템의 측면을 제어합니다.
ru: [.filename]#audit_control#: управляет аспектами подсистемы аудита, такими как классы аудита по умолчанию, минимальное свободное место на томе с журналом аудита и максимальный размер журнала аудита.

source: [.filename]#audit_event#: textual names and descriptions of system audit events and a list of which classes each event is in.
ko: [.filename]#audit_event#: 시스템 감사 이벤트의 텍스트 이름 및 설명과 각 이벤트가 속한 클래스 목록입니다.
ru: [.filename]#audit_event#: текстовые названия и описания системных событий аудита, а также список классов, к которым относится каждое событие.

source: [.filename]#audit_user#: user-specific audit requirements to be combined with the global defaults at login.
ko: [.filename]#audit_user#: 로그인 시 글로벌 기본값과 결합할 사용자별 감사 요구 사항입니다.
ru: [.filename]#audit_user#: пользовательские требования аудита, которые объединяются с глобальными настройками по умолчанию при входе в систему.

source: [.filename]#audit_warn#: a customizable shell script used by man:auditd[8] to generate warning messages in exceptional situations, such as when space for audit records is running low or when the audit trail file has been rotated.
ko: [.filename]#audit_warn#: 감사 기록 공간이 부족하거나 감사 추적 파일이 회전된 경우와 같은 예외적인 상황에서 경고 메시지를 생성하기 위해 man:auditd[8]가 사용하는 사용자 지정 가능한 셸 스크립트입니다.
ru: [.filename]#audit_warn#: настраиваемый сценарий оболочки, используемый man:auditd[8] для генерации предупреждающих сообщений в исключительных ситуациях, например, когда заканчивается место для записей аудита или когда файл журнала аудита был перезаписан.

source: Audit configuration files should be edited and maintained carefully, as errors in configuration may result in improper logging of events.
ko: 구성 오류로 인해 이벤트가 제대로 기록되지 않을 수 있으므로 감사 구성 파일을 신중하게 편집하고 유지 관리해야 합니다.
ru: Файлы конфигурации аудита следует редактировать и поддерживать тщательно, так как ошибки в конфигурации могут привести к некорректной записи событий.
