Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/audit/_index.po
Languages: ko, ru

source: In most cases, administrators will only need to modify [.filename]#audit_control# and [.filename]#audit_user#. The first file controls system-wide audit properties and policies and the second file may be used to fine-tune auditing by user.
ko: 대부분의 경우 관리자는 [.filename]#audit_control# 및 [.filename]#audit_user#만 수정하면 됩니다. 첫 번째 파일은 시스템 전체 감사 속성 및 정책을 제어하고 두 번째 파일은 사용자별로 감사를 세부 조정하는 데 사용할 수 있습니다.
ru: В большинстве случаев администраторам потребуется изменить только файлы [.filename]#audit_control# и [.filename]#audit_user#. Первый файл управляет системными настройками и политиками аудита, а второй может использоваться для тонкой настройки аудита по пользователям.

source: The [.filename]#audit_control# File
ko: [.filename]#audit_control# 파일
ru: Файл [.filename]#audit_control#

source: A number of defaults for the audit subsystem are specified in [.filename]#audit_control#:
ko: 감사 하위 시스템에 대한 여러 가지 기본값은 [.filename]#audit_control#에 지정되어 있습니다:
ru: Некоторые параметры подсистемы аудита по умолчанию указаны в файле [.filename]#audit_control#:

source: The `dir` entry is used to set one or more directories where audit logs will be stored. If more than one directory entry appears, they will be used in order as they fill. It is common to configure audit so that audit logs are stored on a dedicated file system, in order to prevent interference between the audit subsystem and other subsystems if the file system fills.
ko: `dir` 항목은 감사 로그를 저장할 디렉터리를 하나 이상 설정하는 데 사용됩니다. 디렉터리 항목이 두 개 이상 나타나면 채워지는 순서대로 사용됩니다. 파일 시스템이 가득 차면 감사 하위 시스템과 다른 하위 시스템 간의 간섭을 방지하기 위해 감사 로그가 전용 파일 시스템에 저장되도록 감사를 구성하는 것이 일반적입니다.
ru: Запись `dir` используется для указания одного или нескольких каталогов, в которых будут храниться журналы аудита. Если указано несколько каталогов, они будут использоваться по очереди по мере заполнения. Обычно настраивают аудит так, чтобы журналы хранились на выделенной файловой системе — это предотвращает конфликты между подсистемой аудита и другими подсистемами при заполнении файловой системы.

source: If the `dist` field is set to `on` or `yes`, hard links will be created to all trail files in [.filename]#/var/audit/dist#.
ko: `dist` 필드가 `on` 또는 `yes`로 설정되어 있으면 [.filename]#/var/audit/dist#에 있는 모든 트레일 파일에 대한 하드 링크가 만들어집니다.
ru: Если поле `dist` установлено в `on` или `yes`, жесткие ссылки будут созданы для всех файлов журнала в [.filename]#/var/audit/dist#.

source: The `flags` field sets the system-wide default preselection mask for attributable events. In the example above, successful and failed login/logout events as well as authentication and authorization are audited for all users.
ko: `flags` 필드는 어트리뷰션 이벤트에 대한 시스템 전반의 기본 사전 선택 마스크를 설정합니다. 위의 예에서는 모든 사용자에 대해 인증 및 권한 부여뿐만 아니라 로그인/로그아웃 이벤트의 성공 및 실패를 감사합니다.
ru: Поле `flags` устанавливает системную маску предварительного выбора по умолчанию для учитываемых событий. В приведённом примере аудиту подлежат успешные и неудачные события входа/выхода, а также аутентификация и авторизация для всех пользователей.

source: The `minfree` entry defines the minimum percentage of free space for the file system where the audit trail is stored.
ko: `minfree` 항목은 감사 추적이 저장되는 파일 시스템의 최소 여유 공간 비율을 정의합니다.
ru: Запись `minfree` определяет минимальный процент свободного места в файловой системе, где хранится журнал аудита.

source: The `naflags` entry specifies audit classes to be audited for non-attributed events, such as the login/logout process and authentication and authorization.
ko: `naflags` 항목은 로그인/로그아웃 프로세스, 인증 및 권한 부여와 같이 어트리뷰션되지 않은 이벤트에 대해 감사할 감사 클래스를 지정합니다.
ru: Запись `naflags` определяет классы аудита для событий без атрибутов, таких как процесс входа/выхода, аутентификация и авторизация.

source: The `policy` entry specifies a comma-separated list of policy flags controlling various aspects of audit behavior. The `cnt` indicates that the system should continue running despite an auditing failure (this flag is highly recommended). The other flag, `argv`, causes command line arguments to the man:execve[2] system call to be audited as part of command execution.
ko: `policy` 항목은 감사 동작의 다양한 측면을 제어하는 정책 플래그의 쉼표로 구분된 목록을 지정합니다. `cnt`는 감사 실패에도 불구하고 시스템이 계속 실행되어야 함을 나타냅니다(이 플래그를 적극 권장합니다). 다른 플래그인 `argv`는 명령 실행의 일부로 man:execve[2] 시스템 호출에 대한 명령줄 인수를 감사하도록 합니다.
ru: Запись `policy` определяет список флагов политики, разделённых запятыми, которые контролируют различные аспекты поведения аудита. Флаг `cnt` указывает, что система должна продолжать работу, несмотря на сбой аудита (этот флаг настоятельно рекомендуется). Другой флаг, `argv`, приводит к аудиту аргументов командной строки системного вызова man:execve[2] как части выполнения команды.

source: The `filesz` entry specifies the maximum size for an audit trail before automatically terminating and rotating the trail file. A value of `0` disables automatic log rotation. If the requested file size is below the minimum of 512k, it will be ignored and a log message will be generated.
ko: `filesz` 항목은 추적 파일을 자동으로 종료하고 회전하기 전에 감사 추적의 최대 크기를 지정합니다. 값이 `0`이면 자동 로그 로테이션이 비활성화됩니다. 요청된 파일 크기가 최소 512k보다 작으면 무시되고 로그 메시지가 생성됩니다.
ru: `filesz` указывает максимальный размер файла аудита перед автоматическим завершением и ротацией файла. Значение `0` отключает автоматическую ротацию логов. Если запрашиваемый размер файла меньше минимального значения в 512k, он будет проигнорирован, и будет сгенерировано сообщение в логе.

source: The `expire-after` field specifies when audit log files will expire and be removed.
ko: `expire-after` 필드는 감사 로그 파일이 만료되어 제거되는 시기를 지정합니다.
ru: Поле `expire-after` указывает, когда файлы журналов аудита устареют и будут удалены.

source: The [.filename]#audit_user# File
ko: [.filename]#audit_user# 파일
ru: Файл [.filename]#audit_user#

source: The administrator can specify further audit requirements for specific users in [.filename]#audit_user#. Each line configures auditing for a user via two fields: the `alwaysaudit` field specifies a set of events that should always be audited for the user, and the `neveraudit` field specifies a set of events that should never be audited for the user.
ko: 관리자는 [.filename]#audit_user#에서 특정 사용자에 대한 추가 감사 요구 사항을 지정할 수 있습니다. 각 줄은 두 개의 필드를 통해 사용자에 대한 감사를 구성합니다. `alwaysaudit` 필드는 사용자에 대해 항상 감사해야 하는 이벤트 집합을 지정하고 `neveraudit` 필드는 사용자에 대해 절대 감사하지 말아야 하는 이벤트 집합을 지정합니다.
ru: Администратор может указать дополнительные требования аудита для конкретных пользователей в файле [.filename]#audit_user#. Каждая строка настраивает аудит для пользователя с помощью двух полей: поле `alwaysaudit` определяет набор событий, которые всегда должны аудироваться для пользователя, а поле `neveraudit` определяет набор событий, которые никогда не должны аудироваться для пользователя.

source: The following example entries audit login/logout events and successful command execution for `root` and file creation and successful command execution for `www`. If used with the default [.filename]#audit_control#, the `lo` entry for `root` is redundant, and login/logout events will also be audited for `www`.
ko: 다음 예는 `root`에 대한 로그인/로그아웃 이벤트와 성공적인 명령 실행을 감사하고 `www`에 대한 파일 생성 및 성공적인 명령 실행을 감사하는 항목입니다. 기본값인 [.filename]#audit_control#와 함께 사용하면 `root`에 대한 `lo` 항목이 중복되며, `www`에 대한 로그인/로그아웃 이벤트도 감사됩니다.
ru: Следующие примеры записей аудита фиксируют события входа/выхода и успешного выполнения команд для пользователя `root`, а также создание файлов и успешное выполнение команд для пользователя `www`. Если используется файл [.filename]#audit_control# по умолчанию, запись `lo` для `root` избыточна, и события входа/выхода также будут фиксироваться для `www`.

source: Working with Audit Trails
ko: 감사 추적 작업하기
ru: Работа с журналами аудита

source: Since audit trails are stored in the BSM binary format, several built-in tools are available to modify or convert these trails to text. To convert trail files to a simple text format, use `praudit`. To reduce the audit trail file for analysis, archiving, or printing purposes, use `auditreduce`. This utility supports a variety of selection parameters, including event type, event class, user, date or time of the event, and the file path or object acted on.
ko: 감사 추적은 BSM 바이너리 형식으로 저장되므로 이러한 추적을 수정하거나 텍스트로 변환할 수 있는 몇 가지 기본 제공 도구를 사용합니다. 추적 파일을 간단한 텍스트 형식으로 변환하려면 `praudit`을 사용합니다. 분석, 보관 또는 인쇄 목적으로 감사 추적 파일을 축소하려면 `auditreduce`를 사용합니다. 이 유틸리티는 이벤트 유형, 이벤트 클래스, 사용자, 이벤트 날짜 또는 시간, 작업한 파일 경로 또는 개체 등 다양한 선택 매개변수를 지원합니다.
ru: Поскольку записи аудита хранятся в двоичном формате BSM, для их изменения или преобразования в текстовый формат доступны встроенные инструменты. Для преобразования файлов записей в простой текстовый формат используйте `praudit`. Для сокращения файла записей аудита с целью анализа, архивирования или печати используйте `auditreduce`. Эта утилита поддерживает различные параметры выбора, включая тип события, класс события, пользователя, дату или время события, а также путь к файлу или объект, над которым выполнялось действие.

source: For example, to dump the entire contents of a specified audit log in plain text:
ko: 예를 들어, 지정된 감사 로그의 전체 내용을 일반 텍스트로 덤프할 수 있습니다:
ru: Например, чтобы вывести всё содержимое указанного журнала аудита в виде обычного текста:

source: Where _AUDITFILE_ is the audit log to dump.
ko: 여기서 _AUDITFILE_은 덤프할 감사 로그입니다.
ru: Где _AUDITFILE_ — файл журнала аудита для дампа.

source: Audit trails consist of a series of audit records made up of tokens, which `praudit` prints sequentially, one per line. Each token is of a specific type, such as `header` (an audit record header) or `path` (a file path from a name lookup). The following is an example of an `execve` event:
ko: 감사 추적은 토큰으로 구성된 일련의 감사 레코드로 구성되며, `praudit`은 한 줄당 하나씩 순차적으로 인쇄합니다. 각 토큰은 `header`(감사 레코드 헤더) 또는 `path`(이름 조회의 파일 경로)와 같은 특정 유형입니다. 다음은 `execve` 이벤트의 예입니다:
ru: Журналы аудита состоят из последовательности записей аудита, сформированных из токенов, которые `praudit` выводит последовательно, по одному на строку. Каждый токен имеет определённый тип, например, `header` (заголовок записи аудита) или `path` (путь к файлу из поиска по имени). Ниже приведён пример события `execve`:

source: This audit represents a successful `execve` call, in which the command `finger doug` has been run. The `exec arg` token contains the processed command line presented by the shell to the kernel. The `path` token holds the path to the executable as looked up by the kernel. The `attribute` token describes the binary and includes the file mode. The `subject` token stores the audit user ID, effective user ID and group ID, real user ID and group ID, process ID, session ID, port ID, and login address. Notice that the audit user ID and real user ID differ as the user `robert` switched to the `root` account before running this command, but it is audited using the original authenticated user. The `return` token indicates the successful execution and the `trailer` concludes the record.
ko: 이 감사는 `finger doug` 명령이 실행된 성공적인 `execve` 호출을 나타냅니다. `exec arg` 토큰에는 셸이 커널에 제공한 처리된 명령줄이 포함되어 있습니다. `path` 토큰은 커널이 조회한 실행 파일의 경로를 보유합니다. `attribute` 토큰은 바이너리를 설명하며 파일 모드를 포함합니다. `subject` 토큰은 감사 사용자 ID, 유효 사용자 ID 및 그룹 ID, 실제 사용자 ID 및 그룹 ID, 프로세스 ID, 세션 ID, 포트 ID 및 로그인 주소를 저장합니다. 이 명령을 실행하기 전에 사용자 `robert`가 `root` 계정으로 전환되었기 때문에 감사 사용자 ID와 실제 사용자 ID가 다르지만 원래 인증된 사용자를 사용하여 감사됩니다. `return` 토큰은 성공적인 실행을 나타내며 `trailer`는 기록을 종료합니다.
ru: Этот аудит представляет успешный вызов `execve`, в котором была выполнена команда `finger doug`. Токен `exec arg` содержит обработанную командную строку, переданную оболочкой ядру. Токен `path` содержит путь к исполняемому файлу, найденный ядром. Токен `attribute` описывает бинарный файл и включает режим файла. Токен `subject` хранит идентификатор пользователя для аудита, эффективные идентификаторы пользователя и группы, реальные идентификаторы пользователя и группы, идентификатор процесса, идентификатор сессии, идентификатор порта и адрес входа. Обратите внимание, что аудитный идентификатор пользователя и реальный идентификатор пользователя различаются, так как пользователь `robert` переключился на учетную запись `root` перед выполнением этой команды, но аудит ведется с использованием исходного аутентифицированного пользователя. Токен `return` указывает на успешное выполнение, а `trailer` завершает запись.

source: XML output format is also supported and can be selected by including `-x`.
ko: XML 출력 형식도 지원되며 `-x`를 포함하여 선택할 수 있습니다.
ru: Также поддерживается формат вывода XML, и он может быть выбран добавлением опции `-x`.

source: Since audit logs may be very large, a subset of records can be selected using `auditreduce`. This example selects all audit records produced for the user `trhodes` stored in [.filename]#AUDITFILE#:
ko: 감사 로그는 매우 클 수 있으므로 `auditreduce`를 사용하여 레코드의 하위 집합을 선택할 수 있습니다. 이 예에서는 [.filename]#AUDITFILE#에 저장된 사용자 `trhodes`에 대해 생성된 모든 감사 기록을 선택합니다:
ru: Поскольку журналы аудита могут быть очень большими, можно выбрать подмножество записей с помощью `auditreduce`. В этом примере выбираются все записи аудита, созданные для пользователя `trhodes`, хранящиеся в [.filename]#AUDITFILE#:

source: Members of the `audit` group have permission to read audit trails in [.filename]#/var/audit#. By default, this group is empty, so only the `root` user can read audit trails. Users may be added to the `audit` group in order to delegate audit review rights. As the ability to track audit log contents provides significant insight into the behavior of users and processes, it is recommended that the delegation of audit review rights be performed with caution.
ko: `audit` 그룹의 구성원은 [.filename]#/var/audit#에서 감사 추적을 읽을 수 있는 권한을 가집니다. 기본적으로 이 그룹은 비어 있으므로 `root` 사용자만 감사 추적을 읽을 수 있습니다. 감사 검토 권한을 위임하기 위해 `audit` 그룹에 사용자를 추가할 수 있습니다. 감사 로그 내용을 추적하는 기능은 사용자와 프로세스의 행동에 대한 중요한 인사이트를 제공하므로 감사 검토 권한 위임은 신중하게 수행하는 것이 좋습니다.
ru: Участники группы `audit` имеют право читать журналы аудита в [.filename]#/var/audit#. По умолчанию эта группа пуста, поэтому только пользователь `root` может читать журналы аудита. Пользователи могут быть добавлены в группу `audit` для делегирования прав просмотра аудита. Поскольку возможность отслеживать содержимое журналов аудита дает значительное представление о поведении пользователей и процессов, рекомендуется делегировать права просмотра аудита с осторожностью.

source: Live Monitoring Using Audit Pipes
ko: 감사 파이프를 사용한 실시간 모니터링
ru: Мониторинг в реальном времени с использованием потоков аудита

source: Audit pipes are cloning pseudo-devices which allow applications to tap the live audit record stream. This is primarily of interest to authors of intrusion detection and system monitoring applications. However, the audit pipe device is a convenient way for the administrator to allow live monitoring without running into problems with audit trail file ownership or log rotation interrupting the event stream. To track the live audit event stream:
ko: 감사 파이프는 애플리케이션이 실시간 감사 레코드 스트림을 탭할 수 있도록 하는 의사 장치를 복제하는 것입니다. 이는 주로 침입 탐지 및 시스템 모니터링 애플리케이션 작성자가 관심을 가질 만한 기능입니다. 그러나 감사 파이프 장치는 관리자가 이벤트 스트림을 방해하는 감사 추적 파일 소유권이나 로그 로테이션 문제 없이 실시간 모니터링을 허용할 수 있는 편리한 방법입니다. 실시간 감사 이벤트 스트림을 추적하려면 다음과 같이 하세요:
ru: Каналы аудита (audit pipe) являются клонируемыми псевдоустройствами, которые позволяют приложениям получать доступ к потоку записей аудита в реальном времени. В первую очередь это интересно разработчикам систем обнаружения вторжений и мониторинга. Однако устройство канала аудита — это удобный способ для администратора организовать мониторинг в реальном времени без проблем с правами владения файлами аудита или прерывания потока событий из-за ротации логов. Для отслеживания живого потока событий аудита:

source: By default, audit pipe device nodes are accessible only to the `root` user. To make them accessible to the members of the `audit` group, add a `devfs` rule to [.filename]#/etc/devfs.rules#:
ko: 기본적으로 감사 파이프 장치 노드는 `root` 사용자만 액세스할 수 있습니다. `audit` 그룹의 구성원도 액세스할 수 있도록 하려면 [.filename]#/etc/devfs.rules#에 `devfs` 규칙을 추가하세요:
ru: По умолчанию узлы устройств каналов аудита доступны только пользователю `root`. Чтобы сделать их доступными для членов группы `audit`, добавьте правило `devfs` в [.filename]#/etc/devfs.rules#:

source: See man:devfs.rules[5] for more information on configuring the devfs file system.
ko: devfs 파일 시스템 구성에 대한 자세한 내용은 man:devfs.rules[5]를 참조하세요.
ru: За дополнительной информацией о настройке файловой системы devfs см. man:devfs.rules[5].

source: It is easy to produce audit event feedback cycles, in which the viewing of each audit event results in the generation of more audit events. For example, if all network I/O is audited, and `praudit` is run from an SSH session, a continuous stream of audit events will be generated at a high rate, as each event being printed will generate another event. For this reason, it is advisable to run `praudit` on an audit pipe device from sessions without fine-grained I/O auditing.
ko: 각 감사 이벤트를 보면 더 많은 감사 이벤트가 생성되는 감사 이벤트 피드백 주기를 쉽게 생성할 수 있습니다. 예를 들어, 모든 네트워크 I/O를 감사하고 SSH 세션에서 `praudit`을 실행하면, 인쇄되는 각 이벤트가 다른 이벤트를 생성하기 때문에 감사 이벤트의 연속 스트림이 빠른 속도로 생성됩니다. 따라서 세분화된 I/O 감사가 없는 세션에서 감사 파이프 장치에서 `praudit`을 실행하는 것이 좋습니다.
ru: Легко создать циклы обратной связи с событиями аудита, когда просмотр каждого события аудита приводит к генерации новых событий аудита. Например, если аудируется весь сетевой ввод-вывод, и `praudit` запускается из сессии SSH, будет создаваться непрерывный поток событий аудита с высокой скоростью, так как каждое выводимое событие будет генерировать новое событие. По этой причине рекомендуется запускать `praudit` на устройстве аудит-канала из сеансов без детального аудита ввода-вывода.

source: Rotating and Compressing Audit Trail Files
ko: 감사 추적 파일 회전 및 압축하기
ru: Ротация и сжатие файлов журнала аудита

source: Audit trails are written to by the kernel and managed by the audit daemon, man:auditd[8]. Administrators should not attempt to use man:newsyslog.conf[5] or other tools to directly rotate audit logs. Instead, `audit` should be used to shut down auditing, reconfigure the audit system, and perform log rotation. The following command causes the audit daemon to create a new audit log and signal the kernel to switch to using the new log. The old log will be terminated and renamed, at which point it may then be manipulated by the administrator:
ko: 감사 추적은 커널에 의해 쓰여지고 감사 데몬인 man:auditd[8]에 의해 관리됩니다. 관리자는 man:newsyslog.conf[5] 또는 다른 도구를 사용하여 감사 로그를 직접 회전하려고 시도해서는 안 됩니다. 대신 `audit`를 사용하여 감사를 종료하고, 감사 시스템을 재구성하고, 로그 로테이션을 수행해야 합니다. 다음 명령은 감사 데몬이 새 감사 로그를 생성하고 커널이 새 로그를 사용하도록 전환하도록 신호를 보냅니다. 이전 로그는 종료되고 이름이 변경되며, 이 시점에서 관리자가 로그를 조작할 수 있습니다:
ru: Журналы аудита создаются ядром и управляются демоном аудита man:auditd[8]. Администраторам не следует пытаться использовать man:newsyslog.conf[5] или другие инструменты для непосредственной ротации журналов аудита. Вместо этого следует использовать `audit` для остановки аудита, переконфигурации системы аудита и выполнения ротации журналов. Следующая команда заставляет демон аудита создать новый журнал аудита и передать ядру сигнал о переходе на использование нового журнала. Старый журнал будет завершен и переименован, после чего администратор может выполнить с ним необходимые действия:

source: If man:auditd[8] is not currently running, this command will fail and an error message will be produced.
ko: man:auditd[8]가 현재 실행되고 있지 않으면 이 명령은 실패하고 오류 메시지가 생성됩니다.
ru: Если man:auditd[8] в данный момент не запущен, эта команда завершится ошибкой и будет выведено сообщение об ошибке.

source: Adding the following line to [.filename]#/etc/crontab# will schedule this rotation every twelve hours:
ko: [.filename]#/etc/crontab#에 다음 줄을 추가하면 12시간마다 이 로테이션을 예약할 수 있습니다:
ru: Добавление следующей строки в [.filename]#/etc/crontab# позволит выполнять эту ротацию каждые двенадцать часов:

source: The change will take effect once [.filename]#/etc/crontab# is saved.
ko: 변경 사항은 [.filename]#/etc/crontab#을 저장하면 적용됩니다.
ru: Изменение вступит в силу после сохранения файла [.filename]#/etc/crontab#.

source: Automatic rotation of the audit trail file based on file size is possible using `filesz` in [.filename]#audit_control# as described in <<audit-auditcontrol>>.
ko: <<audit-auditcontrol>>에 설명된 대로 [.filename]#audit_control#의 `filesz`를 사용하여 파일 크기에 따라 감사 추적 파일을 자동으로 회전할 수 있습니다.

source: As audit trail files can become very large, it is often desirable to compress or otherwise archive trails once they have been closed by the audit daemon. The [.filename]#audit_warn# script can be used to perform customized operations for a variety of audit-related events, including the clean termination of audit trails when they are rotated. For example, the following may be added to [.filename]#/etc/security/audit_warn# to compress audit trails on close:
ko: 감사 추적 파일은 매우 커질 수 있으므로 감사 데몬에 의해 종료된 후에는 추적 파일을 압축하거나 다른 방법으로 보관하는 것이 바람직할 때가 많습니다. [.filename]#audit_warn# 스크립트를 사용하여 감사 추적이 회전될 때 깨끗하게 종료하는 등 다양한 감사 관련 이벤트에 대해 사용자 지정 작업을 수행할 수 있습니다. 예를 들어, [.filename]#/etc/security/audit_warn#에 다음을 추가하여 닫을 때 감사 추적을 압축할 수 있습니다:
ru: Поскольку файлы журналов аудита могут становиться очень большими, часто возникает необходимость сжимать или архивировать их после закрытия демоном аудита. Скрипт [.filename]#audit_warn# можно использовать для выполнения пользовательских операций при различных событиях, связанных с аудитом, включая корректное завершение журналов при их ротации. Например, следующее можно добавить в [.filename]#/etc/security/audit_warn# для сжатия журналов аудита после закрытия:

source: Other archiving activities might include copying trail files to a centralized server, deleting old trail files, or reducing the audit trail to remove unneeded records. This script will be run only when audit trail files are cleanly terminated. It will not be run on trails left unterminated following an improper shutdown.
ko: 다른 아카이빙 활동에는 중앙 서버에 추적 파일 복사, 오래된 추적 파일 삭제, 불필요한 레코드를 제거하기 위한 감사 추적 축소 등이 포함될 수 있습니다. 이 스크립트는 감사 추적 파일이 깨끗하게 종료된 경우에만 실행됩니다. 부적절한 종료 후 종료되지 않은 상태로 남겨진 트레일에서는 실행되지 않습니다.
ru: Другие действия по архивированию могут включать копирование файлов журналов на централизованный сервер, удаление старых файлов журналов или сокращение журнала аудита для удаления ненужных записей. Этот скрипт будет выполняться только тогда, когда файлы журналов аудита корректно завершены. Он не будет выполняться для журналов, оставшихся незавершёнными после некорректного завершения работы.

source: Chapter 19. Security Event Auditing
ru: Глава 19. Аудит событий безопасности

source: crossref:audit[event-selection,Default Audit Event Classes] summarizes the default audit event classes:
ru: crossref:audit[event-selection,Классы событий аудита по умолчанию] содержит сводку классов событий аудита по умолчанию:

source: Each audit event class may be combined with a prefix indicating whether successful/failed operations are matched, and whether the entry is adding or removing matching for the class and type. crossref:audit[event-prefixes,Prefixes for Audit Event Classes] summarizes the available prefixes:
ru: Каждый класс событий аудита может быть объединен с префиксом, указывающим, соответствуют ли успешные/неудачные операции, и добавляется или удаляется запись для соответствия классу и типу. В crossref:audit[event-prefixes,Префиксы для классов событий аудита] приведены доступные префиксы:

source: Automatic rotation of the audit trail file based on file size is possible using `filesz` in [.filename]#audit_control# as described in crossref:audit[audit-auditcontrol, The audit_control File].
ru: Автоматическая ротация файла журнала аудита на основе размера файла возможна с использованием `filesz` в [.filename]#audit_control#, как описано в crossref:audit[audit-auditcontrol,Файл audit_control].
