<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Sobre las Aplicaciones para FreeBSD">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!-- The FreeBSD Spanish Documentation Project
     Original Revision: r1.34			-->

<html>
&header;

<h2>Experimenta las posibilidades con FreeBSD</h2>

<p>FreeBSD puede manejar cualquier tarea que pueda esperar de una estaci&oacute;n de trabajo &unix;, incluyendo algunas que no esperar&iacute;a:</p>

<h2>FreeBSD
es un verdadero sistema abierto con todo el c&oacute;digo fuente.</h2>

<p>No hay duda que los llamados sistemas abiertos son <i>el</i> requerimiento
para las aplicaciones inform&aacute;ticas de hoy en d&iacute;a. Pero
ning&uacute;n soluci&oacute;n comercial es m&aacute;s abierta que una que
incluya el c&oacute;digo fuente de todo el sistema, incluyendo el kernel
adem&aacute;s de todos los daemons del sistema, programas y utilidades. Puede
modificar cualquier parte de FreeBSD para acomodarlo a sus necesidades
personales, de organizaci&oacute;n o corporativas.</p>

<p>Con su generosa <a href="&base/copyright/license.html"> pol&iacute;tica de
licencias</a>, puede usar FreeBSD como base para cualquier tipo de <i>aplicaci&oacute;n</i> tanto comercial como libre.</p>

<h2>FreeBSD&nbsp;ejecuta
miles de aplicaciones.</h2>

<p>Por que FreeBSD est&aacute; basado en 4.4BSD, una versi&oacute;n est&aacute;ndar
de &unix; en la industria, es f&aacute;cil compilar y ejecutar programas.
FreeBSD tambi&eacute;n incluye una extensa <a href="&base/where.html">
colecci&oacute;n de packages</a> y <a href="&base/ports/index.html">
colecci&oacute;n de ports</a> que ofrecen software precompilado y f&aacute;cil
de instalar. Existe tambi&eacute;n un gr&aacute;n n&uacute;mero de
<a href="&base/commercial/commercial.html">aplicaciones comerciales</a>
escritas para FreeBSD</p>

<p>Aqu&iacute; tiene algunos ejemplos de los entornos en los que FreeBSD
es usado:</p>

<ul>
<li><b>Servicios Internet.</b> Muchos proveedores de Internet (ISPs) encuentran
en FreeBSD la plataforma ideal para ofrecer servicios WWW, News, FTP, Email y otros. Software "Ready-to-run" como el servidor web <a href="http://www.apache.org/">Apache</a> o el servidor FTP <a href="http://proftpd.org/">ProFTPD</a> hacen realmente sencillo poner en
marcha un servidor de servicios Internet. Por supuesto, con la potencia de
<A HREF="&base/internet.html">networking</a> de FreeBSD, sus usuarios
disfrutar&aacute;n de alta velocidad y servicios fiables.</li>

<li><b>Estaci&oacute;n de trabajo X Window. </b>Desde un barato terminal X
  hasta un avanzado monitor X, FreeBSD responde.  Un software X est&aacute;
  incluso (<a href="http://x.org/">X.Org</a>&trade;).  <a
    href="http://www.nvidia.com/">nVidia</a> ofrece controladores nativos
  para su hardware gr&aacute;fico de alta potencia, y hay soporte de
  las librer&iacute;as <a href="http://www.opengroup.org/motif/">Motif</a>&reg;
  y <a href="http://www.opengl.org/">OpenGL</a>&reg; que son las
  est&aacute;ndares indistriales.  Ambos entornos de escritorio,
  <a href="http://www.kde.org">KDE</a> y <a
    href="http://www.gnome.org">GNOME</a> tienen soporte entero y
  estos ofrecen la funcionalided de un bulto de oficina con otras
  buenas funcionalidades accessibles en los productos <a
    href="http://www.openoffice.org/">OpenOffice.Org</a> y
  <a href="http://www.softmaker.de/tml_en.htm">TextMaker</a>.</li>

<li><b>Networking. </b>Desde filtrado de paquetes hasta rutas o servicios de
resoluci&oacute;n de nombres, FreeBSD puede convertir cualquier PC en un
excelente Firewall de Internet, servidor de correo, servidor de impresi&oacute;n, servidor PC/NFS y mucho m&aacute;s.</li>

<li><b>Desarrollo de software.</b> Cuenta con una suite de herramientas de
  desarrollo, incluyendo el compilador y debugger de GNU C/C++. Los
  desarrollos en p.ej. &java; y Tcl/Tk tambi&eacute;n son
  posibles, pero lenguas m&aacute;s espec&iacute;ficas como Icon
  funcionan tambi&eacute;n.  Y las librer&iacute;as compartidas siempre
  han sido f&aacute;ciles de hacer y usar.  Adem&aacute;s, hay un
  surtido abundante de avanzados editores comuneros, como
  XEmacs y Vim.</li>

<li><b>Navegaci&oacute;n por la red.</b> Una verdadera estaci&oacute;n de
  trabajo &unix; es una gr&aacute;n "embarcaci&oacute;n" para la red, y la
  versi&oacute;n BSD de <a
    href="http://www.mozilla.org/products/firefox/">Firefox</a> y <a
    href="http://www.opera.com/">Opera</a> funciona bien en FreeBSD.  Navegue,
   publique sus propias p&aacute;ginas, lea las News y env&iacute;e y reciba
   correo con un sistema FreeBSD en su m&aacute;quina.</li>

<li><b>Educaci&oacute;n e investigaci&oacute;n</b>. &nbsp;FreeBSD es una excelente plataforma de investigaci&oacute;n por que incluye el c&oacute;digo fuente
completo. Estudiantes e investigadores de sistemas operativos pueden beneficiarse enormemente de este sistema abierto y bi&eacute;n documentado.</li>

<li><b>Y mucho m&aacute;s.</b> Accounting, juegos de acci&oacute;n, bases
   de datos, visualizaci&oacute;n cient&iacute;fica, v&iacute;deo conferencia,
   Internet Relay Chat (IRC), automatizaci&oacute;n del hogar, bbs's, escaneo de
   im&aacute;genes y m&aacute;s son todos usos reales de FreeBSD hoy.</li>
</ul>

<h2>Un
sistema operativo que colmar&aacute; todas tus necesidades.</h2>

<p>Aunque FreeBSD es un software libre, es un software <i>soportado por usuarios</i>. Cualquier pregunta que tenga puede ser enviada a cientos de desarrolladores de FreeBSD y usuarios a la lista de distribuci&oacute;n <a href="mailto:freebsd-questions@FreeBSD.org">freebsd-questions@FreeBSD.org</a>.</p>

<p>FreeBSD tiene un completo grupo a nivel mundial de programadores y
   desarrolladores que se encargan de fijar los posibles bugs, a&ntilde;adir
   nuevas caracter&iacute;sticas y documentar el sistema.  Soporte de nuevos
   dispositivos y opciones especiales se incluyen en el proceso de desarrollo
   constante, manteniendo una atenci&oacute;n especial a los problemas que
   afectan a la estabilidad del sistema.  Los usuarios de FreeBSD est&aacute;n
   soberbios del hecho, que su sistema no es s&oacute;lo r&aacute;pido, sino
   confiable tambi&eacute;n.</p>

<h2>Lo que dicen los expertos . . .</h2>

<p><i>"FreeBSD handles [our] heavy load quite well and it is nothing short
of amazing. Salutations to the FreeBSD team."</i></p>

<div align="right"><p>---Mark Hittinger, administrator of WinNet Communications,
Inc.</p></div>

&footer;
</body>
</html>
