<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY date "$FreeBSD: www/es/internet.sgml,v 1.12 2008/02/17 19:52:28 gabor Exp $">
<!ENTITY title "Gesti&oacute;n de red de FreeBSD">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!-- The FreeBSD Spanish Documentation Project
     Original Revision: r1.39			-->

<html>
    &header;

    <h2>&os; se dise&ntilde;&oacute; para Internet</h2>

      <p>FreeBSD incluye lo que muchos consideran la
	<i>implementac&oacute;n de referencia</i> de TCP/IP,
	la pila 4.4BSD del protocolo TCP/IP, haciendolo ideal para
	aplicaciones de red e Internet.  &os;&nbsp;7.0 tambi&eacute;n
	incluye la implementac&oacute;n de referencia del protocolo
	SCTP siendo as&iacute; una plataforma ideal para servicios
	telef&oacute;nicos y otras aplicaciones de flujo de datos.</p>

      <h2>FreeBSD soporta los protocolos
	est&aacute;ndar de TCP/IP.</h2>

      <p>Como muchos sistemas &unix;, el sistema operativo FreeBSD
	permite</p>

      <ul>
	<li>Servir contenido est&aacute;tico y din&aacute;mico por HTTP</li>

	<li>Compartir ficheros mediante NFS</li>

	<li>Distribuci&oacute;n de informaci&oacute;n de red por NIS</li>

	<li>Gestionar servicio de correo por SMTP, IMAP y POP3</li>

	<li>Soporte de accesos remotos por SSH y rsh</li>

	<li>Gesti&oacute;n y configuraci&oacute;n remota via SNMP</li>

	<li>Servidor de ficheros FTP</li>

	<li>Resoluci&oacute;n de nombres de m&aacute;quina por DNS/BIND</li>

	<li>Encaminamiento de paquetes entre m&uacute;ltiples interfaces,
	  incluyendo l&iacute;neas PPP y SLIP</li>

	<li>Servicios IP Multicast (MBONE)</li>

	<li>Gestionar servicios de IPv6</li>
      </ul>

      <p>FreeBSD permite convertir un PC en un servidor www, servidor de
	correo o servidor de noticias, gracias al software que incluye.  Mediante
	SAMBA (que est&aacute; incluido en el sistema) puede compartir discos e
	impresoras con m&aacute;quinas Microsoft&reg; Windows&reg;,
	adem&aacute;s de soportar m&aacute;quinas por PC/NFS gracias al
	d&aelig;mon de autentificaci&oacute;n PCNFS.  FreeBSD tambi&eacute;n
	soporta los protocolos de red Appletalk y Novell en modo
	cliente/servidor (mediante un paquete comercial opcional), todo lo
	cual hace de este sistema una verdadera soluci&oacute;n de servicios
	Intranet.</p>

      <p>FreeBSD tambi&eacute;n gestiona extensiones TCP como la
	extensi&oacute;n de alto rendimiento
	<a href="http://www.ietf.org/rfc/rfc1323.txt">RFC-1323</a>,
	adem&aacute;s de SLIP y PPP bajo demanda.  Es un sistema que responde a
	las expectativas tanto del usuario dom&eacute;stico como del
	administrador de sistemas empresariales.</p>

	<h2>El sistema de red de FreeBSD es
	r&aacute;pido y estable.</h2>

	<p>Si necesita una plataforma para servicios de Internet que ofrezca el
	  mejor rendimiento bajo fuertes cargas de trabajo, considere FreeBSD.
	  &Eacute;stas son solamente algunas de las compa&ntilde;&iacute;as
	  que usan FreeBSD diariamente:</p>

	<ul>
	  <li>Walnut Creek CDROM mantuvo en funcionamiento uno de los
	    servidores FTP m&aacute;s populares de Internet, ftp.cdrom.com,
	    soportando 6000 conexiones simult&aacute;neas.  Su servidor es una
	    &uacute;nica m&aacute;quina con FreeBSD transfiriendo m&aacute;s
	    de 30 terabytes (en Junio de 1999).  S&iacute;, son <i>terabytes</i>,
	    cada mes a m&aacute;s de 10 millones de personas.</li>

	  <li><a href="http://www.yahoo.com/">Yahoo Inc.</a> gestiona el
	    &iacute;ndice de Internet m&aacute;s usado, sirviendo enormes
	    cantidades de informaci&oacute;n diariamente a los usuarios de
	    Internet.  Yahoo, y las compa&ntilde;&iacute;as que anuncian en
	    Yahoo, utilizan FreeBSD para mantener servidores web estables y
	    r&aacute;pidos.</li>

	  <li><a href="http://www.netcraft.com/">Netcraft</a> es el
	    investigador principal del uso de software para servidores web en
	    Internet.   Utilizan FreeBSD y Apache para accionar su sitio Web,
	    y FreeBSD/Perl para toda su colecci&oacute;n de datos sobre
	    Internet.</li>
	</ul>

	<p>FreeBSD es la plataforma ideal para estos y otros servicios de
	  Internet:</p>

	<ul>
	  <li>Servicio empresarial o mundial de WWW</li>

	  <li>Servicio de Proxy WWW</li>

	  <li>Servicio de FTP an&oacute;nimo</li>

	  <li>Servicios de ficheros, impresi&oacute;n y correo</li>

	  <li>Router, cortafuegos y sistemas de detecci&oacute; de
	    intrusos</li>
	</ul>

	<p>La <a href="&enbase;/ports/index.html">Colecci&oacute;n de Ports</a>
	  contiene software listo para funcionar que hace m&aacute;s
	  f&aacute;cil la puesta en marcha de los servidores de Internet.</p>
      
      <h2>Alto rendimiento <em>y</em> seguridad.</h2>

	<p>El equipo de desarrollo de FreeBSD est&aacute; tan comprometido
	  con la seguridad como con el rendimiento.  FreeBSD incluye en su
	  kernel el soporte de firewall IP, adem&aacute;s de otros servicios
	  como gateways e IP proxy.  Si se conectan los servidores corporativos
	  en Internet, cualquier computadora funcionando con FreeBSD puede
	  actuar como firewall de red para protegerlos de ataques externos.</p>

	<p>Tambi&eacute;n hay disponible software criptogr&aacute;fico,
	  shells seguras, Kerberos, cifrado punto a punto y RPC
	  seguro.</p>

	<p>Adem&aacute;s, el equipo de FreeBSD est&aacute; continuamente
	  investigando y comunicando informes de seguridad con un
	  <a href="mailto:security-officer@FreeBSD.org">responsable de seguridad</a>
	  y el Computer Emergency Response Team
	  (<a href="http://www.cert.org/">CERT</a>).</p>

      <h2>Qu&eacute; dicen los expertos sobre &os; </h2>
      
	<p><i>"FreeBSD ... provides what is probably the most robust and
	capable TCP/IP stack in existence ..."</i></p>

	<div align="right"><p>---Michael O'Brien, <i>SunExpert </i> August 1996
	    volume 7 number 8.</p></div>

	&footer;
  </body>
</html>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
