<!--
    The FreeBSD Documentation Project
    The FreeBSD French Documentation Project

    $FreeBSD$
    Original revision: 1.24
-->
<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//FR">
%trademarks;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;
<!ENTITY % urls PUBLIC "-//FreeBSD//ENTITIES Common Document URL Entities//FR"> %urls;
]>

<article lang="fr">
  <articleinfo>
    <title>Expliquer BSD</title>

    <author>
      <firstname>Greg</firstname>
      <surname>Lehey</surname>

      <affiliation>
	<address><email>grog@FreeBSD.org</email></address>
      </affiliation>
    </author>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.amd;
      &tm-attrib.apple;
      &tm-attrib.intel;
      &tm-attrib.linux;
      &tm-attrib.opengroup;
      &tm-attrib.sparc;
      &tm-attrib.sun;
      &tm-attrib.unix;
      &tm-attrib.xfree86;
      &tm-attrib.general;
    </legalnotice>

    <abstract>
      <para>Dans le monde du logiciel libre <quote>Linux</quote> est
	quasiment synonyme de <quote>Syst&egrave;me
	d'Exploitation</quote>, mais il n'est pas le seul
	syst&egrave;me d'exploitation de type &unix; Open Source.
	Selon l'<ulink
	url="http://www.leb.net/hzo/ioscount/data/r.9904.txt">Internet
	Operating System Counter</ulink>, en avril 1999, 31.3% des
	ordinateurs connect&eacute;s &agrave; l'Internet utilisaient
	&linux; alors que 14.6% utilisaient un &unix; BSD.
	Quelques-unes des plus grandes soci&eacute;t&eacute;s du Web,
	telles que <ulink url="http://www.yahoo.com/">Yahoo!</ulink>,
	utilisent un syst&egrave;me d'exploitation BSD.  En 1999, le
	serveur FTP le plus utilis&eacute; <ulink
	url="ftp://ftp.cdrom.com/">ftp.cdrom.com</ulink> (aujourd'hui
	disparu), utilisait BSD pour transf&eacute;rer 1.4&nbsp;TB de
	donn&eacute;es par jour.  Il ne s'agit clairement pas d'un
	march&eacute; de niche: BSD est un secret bien
	gard&eacute;.</para>

      <para>Mais quel est ce secret?  Pourquoi BSD n'est il pas mieux
	connu?  Ce document traite de cette question et de bien
	d'autres.</para>

      <para>Dans ce texte, les diff&eacute;rences entre BSD et Linux
	seront indiqu&eacute;es <emphasis>comme
	ceci</emphasis>.</para>

      <para><emphasis>Version fran&ccedil;aise de &a.fr.osorio;,
	&a.fr.derche; et &a.fr.thomas;</emphasis></para>
    </abstract>
  </articleinfo>

  <sect1 id="what-is-bsd">
    <title>Qu'est-ce que BSD?</title>

    <para>BSD signifie <quote>Berkeley Software Distribution</quote>
      (ou <quote>Distribution logicielle de Berkeley</quote>).  C'est
      le nom donn&eacute; aux  distributions de code source provenant
      de l'Universit&eacute; de Californie, situ&eacute;e &agrave;
      Berkeley; ces distributions &eacute;tait &agrave; l'origine, une
      extension du syst&egrave;me d'exploitation &unix; AT&amp;T.
      Plusieurs projets de syst&egrave;mes d'exploitation Open Source
      sont bas&eacute;s sur une version de ce code connue sous le nom
      de 4.4BSD-Lite.  De plus, elle est compos&eacute;e
      d'&eacute;l&eacute;ments issus d'autres projets Open Source, y
      compris ceux du projet GNU.  Le syst&egrave;me d'exploitation
      complet comprend:</para>

    <itemizedlist>
      <listitem>
	<para>Le noyau BSD, qui prends en charge l'ordonnancement des
	  processus, la gestion de la m&eacute;moire, la gestion des
	  multi-processeurs (SMP), les pilotes de
	  p&eacute;riph&eacute;riques, etc.</para>

	<para><emphasis>A la diff&eacute;rence du noyau Linux, il
	  existe plusieurs noyaux BSD avec des possibilit&eacute;s
	  diff&eacute;rentes.</emphasis></para>
      </listitem>

      <listitem><para>La biblioth&egrave;que C, c'est &agrave; dire
	l'interface de programmation de base du syst&egrave;me.</para>

	<para><emphasis>La biblioth&egrave;que C BSD est bas&eacute;e
	  sur du code provenant de Berkeley, et non sur celui du
	  projet GNU.</emphasis></para>
      </listitem>

      <listitem>
	<para>Des utilitaires tels que l'interpr&eacute;teur de
	  commandes, des applications de gestion de fichiers, des
	  compilateurs et des &eacute;diteurs de liens.</para>

	<para><emphasis>Certains utilitaires sont
	  d&eacute;riv&eacute;s du projet GNU, d'autres
	  pas.</emphasis></para>
      </listitem>

      <listitem>
	<para>Le syst&egrave;me X Window, qui prend en charge
	  l'affichage graphique.</para>

	<para>Le syst&egrave;me X Window utilis&eacute; dans la
	  plupart des BSD est maintenu par l'un de ces deux projets
	  ind&eacute;pendants: le <ulink
	  url="http://www.XFree86.org/">projet &xfree86;</ulink> ou le
	  <ulink url="http://www.X.org/">projet X.Org</ulink>.  C'est
	  le m&ecirc;me code utilis&eacute; par Linux.
	  G&eacute;n&eacute;ralement, BSD ne d&eacute;finit pas un
	  <quote>bureau graphique</quote> sp&eacute;cifique tels que
	  <application>GNOME</application> ou
	  <application>KDE</application>, bien que ces derniers soient
	  disponibles.</para>
      </listitem>

      <listitem>
	<para>D'autres programmes et utilitaires.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="what-a-real-unix">
    <title>Quoi, un vrai syst&egrave;me &unix;?</title>

    <para>Les syst&egrave;mes d'exploitation BSD ne sont pas des
      clones, mais des d&eacute;riv&eacute;s Open Source du
      syst&egrave;me d'exploitation &unix; issus des laboratoires de
      recherche de AT&amp;T, qui est lui-m&ecirc;me un anc&ecirc;tre
      de l'actuel &unix; System V.  Ceci peut vous surprendre.
      Comment cela a t-il pu se produire alors qu'AT&amp;T n'a jamais
      fourni son code en Open Source?</para>

    <para>Il est vrai que le syst&egrave;me &unix; d'AT&amp;T n'est
      pas Open Source, et si l'on s'en tient strictement au point de
      vue de la propri&eacute;t&eacute; intellectuelle alors BSD n'est
      <emphasis>pas</emphasis> un &unix; mais, d'un autre cot&eacute;,
      AT&amp;T a int&eacute;gr&eacute; des sources provenant d'autres
      projets, et plus particuli&egrave;rement ceux du <quote>Computer
      Sciences Research Group</quote> (CSRG) de l'Universit&eacute; de
      Californie, &agrave; Berkeley.  A partir de 1976, le CSRG
      &agrave; commenc&eacute; &agrave; distribuer les bandes de son
      logiciel sous le nom de <emphasis>Berkeley Software
      Distribution</emphasis> ou <emphasis>BSD</emphasis>.</para>

    <para>Les premi&egrave;res versions se composaient essentiellement
      d'applications utilisateur, mais cela changea radicalement
      lorsque le CSRG obtins un contrat avec le <quote>Defense
      Advanced Projects Research Agency</quote> (DARPA) pour faire
      &eacute;voluer les protocoles de communication sur leur
      r&eacute;seau, ARPANET.  Les nouveaux protocoles se firent
      conna&icirc;tre sous le nom de <emphasis>Protocoles
      Internet</emphasis>, puis, <emphasis>TCP/IP</emphasis>
      d'apr&egrave;s plus importants protocoles de l'ensemble.  La
      premi&egrave;re impl&eacute;mentation ayant fait l'objet d'une
      large distribution fut celle de 4.2BSD, en 1982.</para>

    <para>Au cours des ann&eacute;es 1980, un grand nombre de
      fabricants de stations de travail sont apparus.  La plupart
      pr&eacute;f&eacute;raient acheter des licences &unix;
      plut&ocirc;t que de d&eacute;velopper leur propre syst&egrave;me
      d'exploitation.  En particulier, Sun Microsystems acheta une
      licence &unix; et impl&eacute;menta une version de 4.2BSD,
      appel&eacute;e &sunos;.  Lorsque AT&amp;T fut autoris&eacute;e
      &agrave; exploiter commercialement &unix;, elle commen&ccedil;a
      avec une impl&eacute;mentation r&eacute;duite &agrave;
      l'essentiel appel&eacute;e System III, rapidement suivie par la
      version System V.  Le code de System V ne comprenait pas de
      gestion r&eacute;seau, de sorte que toutes les
      impl&eacute;mentations incluaient des logiciels additionnels
      issus de BSD, y compris les applications g&eacute;rant TCP/IP,
      mais &eacute;galement des utilitaires tels que
      l'interpr&eacute;teur de commandes <emphasis>csh</emphasis> et
      l'&eacute;diteur <emphasis>vi</emphasis>.  Ensemble, ces
      am&eacute;liorations, &eacute;taient connues comme &eacute;tant
      les <emphasis>Extensions Berkeley</emphasis>.</para>

    <para>Les bandes BSD contenaient du code source d'AT&amp;T et, par
      cons&eacute;quent, n&eacute;cessitaient une licence source
      &unix;.  Vers 1990, les finances du CSRG
      s'&eacute;puis&egrave;rent et le groupe fut dissout.  Quelques
      membres d&eacute;cid&egrave;rent alors de fournir le code BSD,
      qui &eacute;tait Open Source, sans le code propri&eacute;taire
      d'AT&amp;T.  Ceci donna la <emphasis>Networking Tape
      2</emphasis>, aussi connue sous le nom
      <emphasis>Net/2</emphasis>.  Net/2 n'&eacute;tait pas un
      syst&egrave;me d'exploitation complet: environs 20% du code du
      noyau manquait.  L'un des membres du CSRG, William F. Jolitz,
      &eacute;crivit le code manquant et le publia au d&eacute;but de
      l'ann&eacute;e 1992 sous le nom <emphasis>386BSD</emphasis>.  Au
      m&ecirc;me moment, un groupe d'anciens membres du CSRG,
      cr&eacute;a une entreprise nomm&eacute;e <ulink
      url="http://www.bsdi.com/">Berkeley Software Design Inc.</ulink>
      qui publia une version b&ecirc;ta d'un syst&egrave;me
      d'exploitation nomm&eacute; <ulink
      url="http://www.bsdi.com/">BSD/386</ulink>, bas&eacute; sur le
      m&ecirc;me code source.  Le nom du syst&egrave;me d'exploitation
      sera chang&eacute; plus tard en BSD/OS.</para>

    <para>386BSD ne devint jamais un syst&egrave;me d'exploitation
      stable.  Mais deux autres projets d&eacute;riv&eacute;s
      apparurent d&egrave;s 1993: <ulink
      url="http://www.NetBSD.org/">NetBSD</ulink> et <ulink
      url="&url.base;/index.html">FreeBSD</ulink>. La divergence
      originelle entre ces deux projets s'explique par le fait que
      certains furent plus patients que d'autres dans l'attente
      d'am&eacute;liorations de 386BSD: le groupe NetBSD
      commen&ccedil;a d&egrave;s le debut de l'ann&eacute;e, alors que
      la premi&egrave;re version de FreeBSD ne fut pas disponible
      avant la fin de l'ann&eacute;e.  Entre temps, les codes avaient
      suffisamment diverg&eacute;s qu'une fusion paraissait difficile.
      De plus, les projets avaient des objectifs diff&eacute;rents,
      comme nous le verrons par la suite.  En 1996, <ulink
      url="http://www.OpenBSD.org/">OpenBSD</ulink> d&eacute;riva de
      NetBSD et, en 2003, <ulink
      url="http://www.dragonflybsd.org/">DragonFlyBSD</ulink>
      d&eacute;riva de FreeBSD.</para>
  </sect1>

  <sect1 id="why-is-bsd-not-better-known">
    <title>Pourquoi BSD n'est-il pas mieux connu?</title>

    <para>Un certain nombre de raisons font que BSD reste relativement
      inconnu:</para>

    <orderedlist>
      <listitem>
	<para>Les d&eacute;veloppeurs BSD portent souvent plus
	  d'int&eacute;r&ecirc;t &agrave; l'am&eacute;lioration de
	  leur code qu'&agrave; sa promotion.</para>
      </listitem>

      <listitem>
	<para>Une grande partie de la popularit&eacute; de Linux est
	  due &agrave; des facteurs ext&eacute;rieurs au projet, tels
	  que la presse, ou les soci&eacute;t&eacute;s
	  cr&eacute;&eacute;es pour vendre des services li&eacute;s
	  &agrave; Linux.  Jusqu'&agrave; r&eacute;cemment, les
	  syst&egrave;mes BSD Open Source n'avaient pas de tels
	  partisans.</para>
      </listitem>

      <listitem>
	<para>Les d&eacute;veloppeurs BSD ont tendance &agrave;
	  &ecirc;tre plus exp&eacute;riment&eacute;s que les
	  d&eacute;veloppeurs Linux et ressentent moins le besoin de
	  r&eacute;aliser un syst&egrave;me simple &agrave; utiliser.
	  Les nouveaux venus on donc tendance &agrave; se sentir plus
	  &agrave; l'aise avec Linux.</para>
      </listitem>

      <listitem>
	<para>En 1992, AT&amp;T poursuivit en justice <ulink
	  url="http://www.bsdi.com/">BSDI</ulink>, la
	  soci&eacute;t&eacute; qui commercialisait BSD/386, en
	  pr&eacute;tendant que son produit utilisait du code source
	  dont la propri&eacute;t&eacute; intellectuelle revenait
	  &agrave; AT&amp;T.  L'affaire a &eacute;t&eacute;
	  r&eacute;gl&eacute;e &agrave; l'amiable en 1994, mais le
	  spectre de ce litige &agrave; continu&eacute; &agrave;
	  hanter les esprits.  Pas plus tard qu'en mars 2000, un
	  article publi&eacute; sur le Web pr&eacute;tendait que cette
	  affaire n'avait &eacute;t&eacute; que
	  <quote>r&eacute;cemment r&eacute;gl&eacute;e</quote>.</para>

	<para>Un des points que ce proc&egrave;s a bien
	  clarifi&eacute; est la question du nom: dans les
	  ann&eacute;es 1980, BSD &eacute;tait connu comme <quote>BSD
	  &unix;</quote>.  Avec la suppression des derniers vestiges
	  de son code AT&amp;T, BSD a &eacute;galement perdu le droit
	  de s'appeler &unix;.  Ainsi, vous pourrez voir des livres
	  dont le titre fait r&eacute;f&eacute;rence au
	  <quote>syst&egrave;me d'exploitation &unix; 4.3BSD</quote>
	  et au <quote>syst&egrave;me d'exploitation
	  4.4BSD</quote>.</para>
      </listitem>

      <listitem>
	<para>Il existe une id&eacute;e selon laquelle les projets BSD
	  seraient fragment&eacute;s et concurrents.  Le <ulink
	  url="http://interactive.wsj.com/bin/login?Tag=/&amp;URI=/archive/retrieve.cgi%253Fid%253DSB952470579348918651.djm&">Wall
	  Street Journal</ulink> a m&ecirc;me parl&eacute; d'une
	  <quote>balkanisation</quote> des projets BSD.  Tout comme
	  les poursuites judiciaires, cette perception se base sur de
	  vieilles histoires.</para>
      </listitem>
    </orderedlist>
  </sect1>

  <sect1 id="comparing-bsd-and-linux">
    <title>Comparer BSD et Linux</title>

    <para>Mais quelle est la vraie diff&eacute;rence entre, disons,
      Debian Linux et FreeBSD?  Pour l'utilisateur moyen, la
      diff&eacute;rence est &eacute;tonnamment faible: tous les deux
      sont des syst&egrave;mes d'exploitation &unix;.  Tous deux sont
      d&eacute;velopp&eacute;s par des projets non commerciaux (ceci
      ne s'applique pas &agrave; de nombreuses autres distributions
      Linux).  Dans la section qui suit, nous &eacute;tudierons les
      syst&egrave;mes BSD et les comparerons &agrave; Linux.  La
      description s'applique plus particuli&egrave;rement &agrave;
      FreeBSD, qui repr&eacute;sente environs 80% des syst&egrave;mes
      BSD install&eacute;s, mais les diff&eacute;rences avec NetBSD,
      OpenBSD et DragonFlyBSD sont minces.</para>

    <sect2>
      <title>A qui appartient BSD?</title>

      <para>Aucune personne ou soci&eacute;t&eacute; n'est
	propri&eacute;taire de BSD.  BSD est cr&eacute;&eacute; et
	distribu&eacute; par une communaut&eacute; de contributeurs
	impliqu&eacute;s et d'une grande expertise technique,
	situ&eacute;s partout dans le monde.  Quelques composants de
	BSD sont issus d'autres projets Open Source,
	g&eacute;r&eacute;s par d'autres personnes.</para>
    </sect2>

    <sect2>
      <title>Comment BSD est-il d&eacute;velopp&eacute; et mis
	&agrave; jour?</title>

      <para>Les noyaux BSD sont d&eacute;velopp&eacute;s et mis
	&agrave; jour suivant les mod&egrave;le de
	d&eacute;veloppement de l'Open Source.  Chaque projet
	maintient un <emphasis>arbre des sources</emphasis> publique
	et accessible au moyen de <ulink
	url="http://www.cvshome.org/">Concurrent Versions System
	</ulink> (CVS), un syst&egrave;me de gestion de version, qui
	maintient l'ensemble des fichiers du projet, y compris la
	documentation ainsi que d'autres fichiers.  CVS permet aux
	utilisateurs de faire un <quote>check out</quote> (extraire
	une copie) de n'importe quelle version du
	syst&egrave;me.</para>

      <para>Un grand nombre de d&eacute;veloppeurs &agrave; travers le
	monde contribuent &agrave; l'am&eacute;lioration de BSD.  Ils
	sont divis&eacute;s en trois cat&eacute;gories:</para>

      <itemizedlist>
	<listitem>
	  <para>Les <firstterm>contributeurs</firstterm>
	    &eacute;crivent le code ou la documentation.  Ils ne sont
	    pas autoris&eacute;s &agrave; <quote>commiter</quote>
	    (ajouter du code) directement dans l'arbre des sources.
	    Pour que leur code soit int&eacute;gr&eacute; au
	    syst&egrave;me, il doit &ecirc;tre examin&eacute; et
	    contr&ocirc;l&eacute; par un d&eacute;veloppeur
	    enregistr&eacute;, connu en tant que
	    <emphasis>committer</emphasis>.</para>
	</listitem>

	<listitem>
	  <para>Les <firstterm>committers</firstterm> sont des
	    d&eacute;veloppeurs qui ont un droit d'&eacute;criture
	    dans l'arbre des sources.  Pour devenir committer, une
	    personne doit d&eacute;montrer ses comp&eacute;tences dans
	    le domaine o&ugrave; elle travaille.</para>

	  <para>Il est &agrave; la discr&eacute;tion du committer de
	    d&eacute;terminer si il doit obtenir l'autorisation avant
	    d'int&eacute;grer des changements dans l'arbre des
	    sources.  En g&eacute;n&eacute;ral, un committer
	    exp&eacute;riment&eacute; a la possibilit&eacute; de faire
	    des changements qui sont manifestement corrects sans qu'un
	    consensus soit n&eacute;cessaire.  Par exemple, un
	    committer du projet de documentation peut corriger des
	    erreurs typographiques ou grammaticales sans relecture.
	    D'un autre c&ocirc;t&eacute;, les d&eacute;veloppeurs
	    effectuant des changements complexes d'une grande
	    port&eacute;e sont suppos&eacute;s soumettre leur code
	    pour relecture avant de l'int&eacute;grer.  Dans des cas
	    extr&ecirc;mes, un membre de la <quote>core team</quote>
	    (&eacute;quipe de base) avec le titre d'architecte
	    principal peut exiger que les changements soient
	    retir&eacute;s de l'arbre des sources, un processus connu
	    sous le nom de <firstterm>backing out</firstterm>.  Tous
	    les committers re&ccedil;oivent des courriers
	    &eacute;lectroniques d&eacute;crivant chaque modification,
	    il est donc impossible de d'effectuer des changements de
	    mani&egrave;re secr&egrave;te.</para>
	</listitem>

	<listitem>
	  <para>La <firstterm>Core team</firstterm> (&eacute;quipe de
	    base).  Les projets FreeBSD et NetBSD ont chacun une
	    &eacute;quipe de base qui g&egrave;re le projet.  Ces
	    &eacute;quipes ont &eacute;t&eacute; constitu&eacute;es
	    dans le cadre des projets, et leur r&ocirc;le n'est pas
	    toujours bien d&eacute;fini.  Il n'est pas
	    n&eacute;cessaire d'&ecirc;tre un d&eacute;veloppeur pour
	    &ecirc;tre membre de la core team, bien que cela semble
	    normal.  Les r&egrave;gles de cette &eacute;quipe varient
	    d'un projet &agrave; l'autre, mais ses membres ont une
	    parole plus forte dans la direction du projet que les
	    autres d&eacute;veloppeurs ne faisant pas partie de cette
	    &eacute;quipe.</para>
	</listitem>
      </itemizedlist>

      <para>Cette organisation diff&egrave;re de celle de Linux sur de
	nombreux points:</para>

      <orderedlist>
	<listitem>
	  <para>Aucune personne ne contr&ocirc;le &agrave; elle seule
	    le contenu du syst&egrave;me.  En pratique, cette
	    diff&eacute;rence est sur&eacute;valu&eacute;e, puisque
	    l'architecte en chef peut exiger que du code soit
	    retir&eacute;, de m&ecirc;me que sur le projet Linux
	    plusieurs personnes sont autoris&eacute;es &agrave;
	    effectuer des changements.</para>
	</listitem>

	<listitem>
	  <para>D'un autre c&ocirc;t&eacute;, il y a
	    <emphasis>un</emphasis> d&eacute;p&ocirc;t central, un
	    emplacement unique ou vous pouvez trouver l'ensemble des
	    sources du syst&egrave;me, y compris toutes les anciennes
	    versions.</para>
	</listitem>

	<listitem>
	  <para>Les projets BSD maintiennent l'ensemble du
	    <quote>Syst&egrave;me d'Exploitation</quote>, pas
	    seulement le noyau.  Cette distinction est peu utile: ni
	    BSD ni Linux ne sont utiles sans applications.  Les
	    applications utilis&eacute;es avec BSD sont bien souvent
	    les m&ecirc;mes que celles utilis&eacute;es avec
	    Linux.</para>
	</listitem>

	<listitem>
	  <para>En raison de la maintenance structur&eacute;e d'un
	    seul arbre des sources sous CVS, le d&eacute;veloppement
	    de BSD est clair, et il est possible d'acc&eacute;der
	    &agrave; n'importe quelle version du syst&egrave;me au
	    travers de son num&eacute;ro de version de publication, ou
	    par date.  CVS permets &eacute;galement une mise &agrave;
	    jour incr&eacute;mentale du syst&egrave;me: par exemple,
	    le d&eacute;p&ocirc;t des sources est mis &agrave; jour
	    pr&egrave;s de 100 fois par jour.  La plupart de ces
	    changements sont mineurs.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>La publication des versions (<quote>releases</quote>) de
	BSD</title>

      <para>FreeBSD, NetBSD et OpenBSD fournissent le syst&egrave;me
	en trois diff&eacute;rentes <quote>versions</quote>
	(<quote>releases</quote>).  Tout comme Linux, chaque version
	se voit assigner un num&eacute;ro tel que 1.4.1 ou 3.5.  De
	plus, le num&eacute;ro de version poss&egrave;de un suffixe
	indiquant son objectif:</para>

      <orderedlist>
	<listitem>
	  <para>La version de d&eacute;veloppement du syst&egrave;me
	    est appel&eacute;e <firstterm>CURRENT</firstterm>.
	    FreeBSD assigne un num&eacute;ro &agrave; la version
	    CURRENT, par exemple FreeBSD 5.0-CURRENT.  NetBSD emploie
	    une m&eacute;thode de nommage l&eacute;g&egrave;rement
	    diff&eacute;rente et appose un suffixe d'une seule lettre
	    qui indique des changements dans l'interface interne, par
	    exemple NetBSD 1.4.3G.  OpenBSD n'assigne pas de
	    num&eacute;ro (<quote>OpenBSD-current</quote>).  Tous les
	    nouveaux d&eacute;veloppements du syst&egrave;me vont dans
	    cette branche.</para>
	</listitem>

	<listitem>
	  <para>A intervalles r&eacute;guliers, environs deux &agrave;
	    quatre fois par an, les projets sortent une version
	    <firstterm>RELEASE</firstterm> du syst&egrave;me, qui est
	    disponible sur CD-ROM et gratuitement
	    t&eacute;l&eacute;chargeable sur les sites FTP, par
	    exemple OpenBSD 2.6-RELEASE ou NetBSD 1.4-RELEASE.  La
	    version RELEASE est destin&eacute;e aux utilisateurs
	    finaux et est la version normale du syst&egrave;me.
	    NetBSD fournit &eacute;galement des <emphasis>correctifs
	    de release</emphasis> avec un troisi&egrave;me chiffre,
	    par exemple NetBSD 1.4.2.</para>
	</listitem>

	<listitem>
	  <para>Si des bogues sont d&eacute;couverts dans une version
	    RELEASE, ils sont corrig&eacute;s, et les correctifs sont
	    incorpor&eacute;s &agrave; l'arbre des sources CVS.  Sous
	    FreeBSD, la version r&eacute;sultante est appel&eacute;e
	    version <firstterm>STABLE</firstterm>, alors que NetBSD et
	    OpenBSD continuent &agrave; l'appeler version RELEASE.
	    Des fonctions mineures peuvent aussi &ecirc;tre
	    ajout&eacute;es &agrave; la branche apr&egrave;s une
	    p&eacute;riode de test dans la branche CURRENT.</para>
	</listitem>
      </orderedlist>

      <para><emphasis>Par contraste, Linux maintient deux
	  arborescences de code s&eacute;par&eacute;es: la version
	  stable et la version de d&eacute;veloppement.  La version
	  stable est nomm&eacute;e avec un num&eacute;ro de version
	  mineur pair, tel que 2.0, 2.2 or 2.4.  La version de
	  d&eacute;veloppement est quant &agrave; elle nomm&eacute;e
	  avec un num&eacute;ro de version mineur impair, tel que 2.1,
	  2.3 ou 2.5.  Dans chaque cas, ce num&eacute;ro est suivi par
	  un num&eacute;ro suppl&eacute;mentaire d&eacute;terminant la
	  version exacte.  Chaque distributeur ajoute en outre ses
	  propres utilitaires et applications utilisateur, ce qui fait
	  que le nom de la distribution est tout aussi important.
	  Chaque fournisseur de distribution assigne des
	  num&eacute;ros de version &agrave; sa distribution; ainsi,
	  une description compl&egrave;te ressemble &agrave; quelque
	  chose comme <quote>TurboLinux 6.0 avec le noyau
	  2.2.14</quote></emphasis>.</para>
    </sect2>

    <sect2>
      <title>Quelles sont les version de BSD disponibles?</title>

      <para>En contraste avec le grand nombre de distributions Linux,
	il n'y a que quatre BSD Open Source.  Chaque projet BSD
	maintient sa propre arborescence des sources et son propre
	noyau.  En pratique, cependant, il y a moins de divergences
	dans le code de base de ces diff&eacute;rents projets que dans
	Linux.</para>

      <para>Il est difficile de classer les objectifs de chaque
	projet: les diff&eacute;rences sont tr&egrave;s subjectives.
	Fondamentalement,</para>

      <itemizedlist>
	<listitem>
	  <para>FreeBSD vise les hautes performances et la
	    simplicit&eacute; d'utilisation pour l'utilisateur final;
	    il est l'un des syst&egrave;me d'exploitation favoris des
	    fournisseurs de contenu sur le Web.  Il fonctionne sur de
	    nombreuses plate-formes, incluant les syst&egrave;mes
	    bas&eacute;s sur les processeurs &i386;
	    (<quote>PC</quote>), AMD 64-bit, &ultrasparc;, Compaq
	    Alpha et les syst&egrave;mes de type NEC PC-98.  Le projet
	    FreeBSD a beaucoup plus d'utilisateurs que les autres
	    projets.</para>
	</listitem>

	<listitem>
	  <para>NetBSD vise la portabilit&eacute; maximale: son slogan
	    est <quote>of course it runs NetBSD</quote> (<quote>bien
	    sur &ccedil;a tourne sous NetBSD</quote>).  Il fonctionne
	    aussi bien sur des ordinateurs de poche que sur des gros
	    serveurs, et a &eacute;t&eacute; utilis&eacute; par la
	    NASA dans le cadre de missions spatiales.  C'est un
	    tr&egrave;s bon choix pour fonctionner sur du vieux
	    mat&eacute;riel non-&intel;.</para>
	</listitem>

	<listitem>
	  <para>OpenBSD vise la s&eacute;curit&eacute; et la
	    puret&eacute; du code: il emploie une combinaison de
	    concepts Open Source et une relecture rigoureuse du code
	    pour cr&eacute;er un syst&egrave;me qui est manifestement
	    bon, et qui, de fait, est le choix
	    privil&eacute;gi&eacute; des organismes conscients des
	    aspects de s&eacute;curit&eacute;, tels que les banques,
	    les bourses de valeurs et les minist&egrave;res du
	    gouvernement des Etats-Unis d'Am&eacute;rique.  Tout comme
	    NetBSD, il fonctionne sur de nombreuses
	    plate-formes.</para>
	</listitem>

	<listitem>
	  <para>DragonFlyBSD vise les hautes performances et la
	    mont&eacute;e en charge sur n'importe quel syst&egrave;me
	    depuis le syst&egrave;me mono-processeur jusqu'au
	    syst&egrave;me massivement parall&eacute;lis&eacute;.
	    DragonFlyBSD a plusieurs objectifs techniques &agrave;
	    long terme, mais est essentiellement ax&eacute; sur la
	    fourniture d'un syst&egrave;me pour les architectures
	    sym&eacute;triques (SMP) qui soit facile &agrave;
	    comprendre, &agrave; maintenir, et pour lequel il serait
	    simple de d&eacute;velopper.</para>
	</listitem>
      </itemizedlist>

      <para>Il existe deux autres syst&egrave;mes d'exploitation
	 &unix; BSD qui ne sont pas Open Source: BSD/OS et &macos; X
	 d'Apple:</para>

      <itemizedlist>
	<listitem>
	  <para>BSD/OS est le plus ancien des d&eacute;riv&eacute;s de
	    4.4 BSD.  Il n'est pas Open Source, bien que le code source
	    soit disponible &agrave; un co&ucirc;t relativement
	    faible.  Il ressemble &agrave; FreeBSD sur plusieurs
	    aspects.  Deux ans apr&egrave;s l'acquisition de BSDi par
	    Wind River Systems, BSD/OS &eacute;choua dans sa tentative
	    d'exister en tant que produit ind&eacute;pendant.  Le
	    support et le code sont encore disponibles chez Wind
	    River, mais tous les nouveaux d&eacute;veloppements se
	    concentrent sur le syst&egrave;me d'exploitation
	    embarqu&eacute; VxWorks.</para>
	</listitem>

	<listitem>
	  <para><ulink url="http://www.apple.com/macosx/server/">&macos;
	    X</ulink> est la derni&egrave;re version du syst&egrave;me
	    d'exploitation pour les ordinateurs de la lign&eacute;e
	    &macintosh; d'<ulink url="http://www.apple.com/">Apple
	    Computer Inc.</ulink>.  Le c&oelig;ur BSD de ce
	    syst&egrave;me d'exploitation, <ulink
	    url="http://developer.apple.com/darwin/">Darwin</ulink>,
	    est disponible sous la forme d'un syst&egrave;me
	    d'exploitation totalement fonctionnel pour les ordinateurs
	    x86 et PPC.  Le syst&egrave;me graphique Aqua/Quartz et
	    plusieurs autres &eacute;l&eacute;ments
	    propri&eacute;taires de &macos; X restent cependant
	    &agrave; sources ferm&eacute;es.  Plusieurs
	    d&eacute;veloppeurs de Darwin sont aussi des committers de
	    FreeBSD, et vice-versa.</para>
	</listitem>
      </itemizedlist>
    </sect2>

    <sect2>
      <title>En quoi la licence BSD diff&egrave;re-t-elle de la
	licence publique GNU?</title>

      <para>Linux est disponible sous licence <ulink
	url="http://www.fsf.org/copyleft/gpl.html">GNU General Public
	License</ulink> (GPL), qui a &eacute;t&eacute; con&ccedil;ue
	pour &eacute;liminer les logiciels &agrave; code source
	ferm&eacute;.  En particulier, tout travail
	d&eacute;riv&eacute; d'un produit fourni sous licence GPL doit
	&eacute;galement &ecirc;tre fourni avec son code source si ce
	dernier est demand&eacute;.  A contrario, la <ulink
	url="http://www.opensource.org/licenses/bsd-license.html">licence
	BSD</ulink> est moins restrictive: la distribution des
	binaires seuls est autoris&eacute;e.  Ceci est
	particuli&egrave;rement attrayant pour des applications
	embarqu&eacute;es.</para>
    </sect2>

    <sect2>
      <title>Que dois-je savoir d'autre?</title>

      <para>Dans la mesure o&ugrave; moins d'applications sont
	disponibles pour BSD que pour Linux, les d&eacute;veloppeurs
	BSD ont cr&eacute;&eacute; un syst&egrave;me de
	compatibilit&eacute; avec Linux, qui permet aux programmes
	Linux de fonctionner sous BSD.  Le syst&egrave;me inclut
	&agrave; la fois des modifications au niveau du noyau, afin
	que les appels syst&egrave;mes Linux se fassent correctement,
	et les fichiers de compatibilit&eacute; Linux, tels que la
	biblioth&egrave;que C.  Il n'y a pas de diff&eacute;rence
	notable au niveau de la vitesse entre une application Linux
	ex&eacute;cut&eacute;e sur une machine Linux et une
	application Linux ex&eacute;cut&eacute;e sur une machine BSD
	de puissance &eacute;quivalente.</para>

      <para>De part sa nature <quote>tout provient d'un m&ecirc;me
	fournisseur</quote>, BSD jouit du fait que les mises &agrave;
	jour sont plus faciles &agrave; r&eacute;aliser que dans bien
	des cas avec Linux.  BSD g&egrave;re la mise &agrave; jour des
	versions des biblioth&egrave;ques en fournissant de modules de
	compatibilit&eacute; pour des versions de biblioth&egrave;ques
	plus anciennes; il est donc possible d'ex&eacute;cuter des
	binaires vieux de plusieurs ann&eacute;es sans aucun
	probl&egrave;me.</para>
    </sect2>

    <sect2>
      <title>Lequel dois-je utiliser, BSD ou Linux?</title>

      <para>Qu'est-ce que cela signifie en pratique?  Qui devrait
	utiliser BSD et qui devrait utiliser Linux?</para>

      <para>Il est tr&egrave;s difficile de r&eacute;pondre &agrave;
	cette question.  Voici quelques &eacute;l&eacute;ments de
	r&eacute;ponse:</para>

      <itemizedlist>
	<listitem>
	  <para><quote>Si ce n'est pas cass&eacute;, ne le
	    r&eacute;parez pas</quote>: Si vous utilisez
	    d&eacute;j&agrave; un syst&egrave;me d'exploitation Open
	    Source, et que vous en &ecirc;tes content, alors il n'y a
	    probablement aucune bonne raison d'en changer.</para>
	</listitem>

	<listitem>
	  <para>Les syst&egrave;mes BSD, et plus
	    particuli&egrave;rement FreeBSD, peuvent avoir de
	    performances notablement sup&eacute;rieures &agrave;
	    Linux.  Mais pas sur tous les points.  Dans la plupart des
	    cas, il y a peu ou pas de diff&eacute;rences.  Dans
	    certains cas, Linux peut avoir de meilleures performances
	    que FreeBSD.</para>
	</listitem>

	<listitem>
	  <para>En g&eacute;n&eacute;ral, les syst&egrave;mes BSD sont
	    r&eacute;put&eacute;s plus fiables, en grande partie en
	    raison d'un code de base plus mature.</para>
	</listitem>

	<listitem>
	  <para>Les projets BSD ont une meilleure r&eacute;putation en
	    raison de la qualit&eacute; et l'exhaustivit&eacute; de
	    leur documentation.  Les divers projets de documentation
	    tentent de fournir une documentation constamment mise
	    &agrave; jour, en diff&eacute;rentes langues, et traitant
	    de tous les aspects du syst&egrave;me.</para>
	</listitem>

	<listitem>
	  <para>La licence BSD peut &ecirc;tre plus attractive que la
	    GPL.</para>
	</listitem>

	<listitem>
	  <para>BSD peut ex&eacute;cuter la plupart des binaires
	    Linux, alors que Linux ne peut pas executer les binaires
	    BSD.  Plusieurs impl&eacute;mentations de BSD peuvent
	    ex&eacute;cuter les binaires issus d'autres
	    syst&egrave;mes &unix;.  BSD peut donc repr&eacute;senter
	    une voie de migration plus simple depuis les autres
	    syst&egrave;mes que ne pourrait l'&ecirc;tre Linux.</para>
	</listitem>
      </itemizedlist>
    </sect2>

    <sect2>
      <title>Qui fournit du support, des services, et de la formation
	pour BSD?</title>

      <para>BSDi / <ulink url="http://www.freebsdmall.com">FreeBSD
	Mall, Inc.</ulink> fournit du support pour FreeBSD depuis
	pr&egrave;s de 10 ans.</para>

      <para>En plus, chacun des projets dispose d'une liste de
	consultants &agrave; embaucher: <ulink
	url="&url.base;/commercial/consult_bycat.html">FreeBSD</ulink>,
	<ulink
	url="http://www.netbsd.org/gallery/consultants.html">NetBSD</ulink>,
	et <ulink
	url="http://www.openbsd.org/support.html">OpenBSD</ulink>.</para>
    </sect2>
  </sect1>
</article>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
