Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: Maintaining a Project Branch
pt_br: Mantendo um branch de projeto

source: A project branch is one that is synced to head (or another branch) is used to develop a project then commit it back to head. In <acronym>SVN</acronym>, <quote>dolphin</quote> branching is used for this. A <quote>dolphin</quote> branch is one that diverges for a while and is finally committed back to the original branch. During development code migration in one direction (from head to the branch only). No code is committed back to head until the end. After the branch is committed back at the end, it is dead (although a new branch with the same name can be created after the dead one is deleted).
pt_br: Uma branch de projeto é aquela que está sincronizada com o head (ou outra branch) e é usada para desenvolver um projeto e, em seguida, fazer o seu commit de volta para o head. No <acronym>SVN</acronym>, o branch <quote>dolphin</quote> é usado para isso. Uma branch <quote>dolphin</quote> é aquela que diverge por um tempo e é finalmente enviada de volta ao branch original. Durante a migração do código de desenvolvimento em uma direção (do head para o branch apenas). Não é feito o commit de nenhum código de volta ao head até o final. Depois que é feito o commit da branch no final, ela estará morta (embora uma nova branch com o mesmo nome possa ser criada depois que a que está morta é excluída).

source: As per <link xlink:href="https://people.FreeBSD.org/~peter/svn_notes.txt">https://people.FreeBSD.org/~peter/svn_notes.txt</link>, work that is intended to be merged back into HEAD should be in <filename>base/projects/</filename>. If the work is beneficial to the FreeBSD community in some way but not intended to be merged directly back into HEAD then the proper location is <filename>base/user/<replaceable>username</replaceable>/</filename>. <link xlink:href="https://svnweb.freebsd.org/base/projects/GUIDELINES.txt">This page</link> contains further details.
pt_br: Como explicado em <link xlink:href="https://people.FreeBSD.org/~peter/svn_notes.txt">https://people.FreeBSD.org/~peter/svn_notes.txt</link>, o trabalho que destina-se a ser mesclado de volta para o HEAD deve estar em <filename>base/projects/</filename>. Se o trabalho é benéfico para a comunidade do FreeBSD de alguma forma, mas não se destina a ser mesclado diretamente no HEAD, então o local apropriado é <filename>base/user/<replaceable>username</replaceable>/</filename>. <link xlink:href="https://svnweb.freebsd.org/base/projects/GUIDELINES.txt">Esta página</link> contém mais detalhes.

source: To create a project branch:
pt_br: Para criar um branch de projeto:

source: To merge changes from HEAD back into the project branch:
pt_br: Para mesclar as alterações do HEAD de volta ao branch de projeto:

source: It is important to resolve any merge conflicts before committing.
pt_br: É importante resolver quaisquer conflitos de mesclagem antes de fazer o commit.

source: Some Tips
pt_br: Algumas dicas

source: In commit logs etc., <quote>rev 179872</quote> is spelled <quote>r179872</quote> as per convention.
pt_br: Nos logs de commit, etc., <quote>rev 179872</quote> é soletrado <quote>r179872</quote> conforme a convenção.

source: Speeding up svn is possible by adding these entries to <filename>~/.ssh/config</filename>:
pt_br: É possível acelerar o svn adicionando estas entradas ao <filename>~/.ssh/config</filename>:

source: and then typing
pt_br: e depois digitando

source: Checking out a working copy with a stock Subversion client without FreeBSD-specific patches (<varname>OPTIONS_SET=FREEBSD_TEMPLATE</varname>) will mean that <literal>$FreeBSD$</literal> tags will not be expanded. Once the correct version has been installed, trick Subversion into expanding them like so:
pt_br: Fazer o check-out de uma cópia de trabalho com um cliente Subversion padrão sem patches específicos do FreeBSD (<varname>OPTIONS_SET=FREEBSD_TEMPLATE</varname>) significará que as tags <literal>$FreeBSD$</literal> não serão expandidas. Uma vez que a versão correta foi instalada, engane o Subversion para expandi-las da seguinte forma:

source: This will wipe out uncommitted patches.
pt_br: Isso eliminará os patches para os quais ainda não foi feito o commit.

source: It is possible to automatically fill the "Sponsored by" and "MFC after" commit log fields by setting "freebsd-sponsored-by" and "freebsd-mfc-after" fields in the "[miscellany]" section of the <filename>~/.subversion/config</filename> configuration file. For example:
pt_br: É possível preencher automaticamente os campos de log de commit "Sponsored by" e "MFC after" configurando os campos "freebsd-sponsored-by" e "freebsd-mfc-after" na seção "[miscellany]" do arquivo de configuração <filename>~/.subversion/config</filename>. Por exemplo:

source: Setup, Conventions, and Traditions
pt_br: Configuração, Convenções e Tradições

source: There are a number of things to do as a new developer. The first set of steps is specific to committers only. These steps must be done by a mentor for those who are not committers.
pt_br: Existe uma série de coisas para fazer como um novo desenvolvedor. O primeiro conjunto de etapas é específico apenas para os committers. Essas etapas devem ser feitas por um mentor para aqueles que não são committers.

source: For New Committers
pt_br: Para novos committers

source: Those who have been given commit rights to the FreeBSD repositories must follow these steps.
pt_br: Aqueles que receberam direitos de commit para os repositórios do FreeBSD devem seguir estes passos.

source: Get mentor approval before committing each of these changes!
pt_br: Obtenha a aprovação do seu mentor antes de fazer o commit de cada uma dessas mudanças!

source: The <filename>.ent</filename> and <filename>.xml</filename> files mentioned below exist in the FreeBSD Documentation Project SVN repository at <literal>svn+ssh://repo.FreeBSD.org/doc/</literal>.
pt_br: Os arquivos <filename>.ent</filename> e <filename>.xml</filename> mencionados abaixo existem no repositório SVN do Projeto de Documentation do FreeBSD em <literal>svn+ssh://repo.FreeBSD.org/doc/</literal>.

source: New files that do not have the <literal>FreeBSD=%H</literal> <command>svn:keywords</command> property will be rejected when attempting to commit them to the repository. Be sure to read <xref linkend="svn-daily-use-adding-and-removing"/> regarding adding and removing files. Verify that <filename>~/.subversion/config</filename> contains the necessary <quote>auto-props</quote> entries from <filename>auto-props.txt</filename> mentioned there.
pt_br: Novos arquivos que não possuem a propriedade <literal>FreeBSD=%H</literal> <command>svn:keywords</command> serão rejeitados quando você tentar fazer o commit dos mesmos para o repositório. Certifique-se de ler <xref linkend="svn-daily-use-adding-and-removing"/> sobre como adicionar e remover arquivos. Verifique se o <filename>~/.subversion/config</filename> contém as entradas necessárias de <quote>auto-props</quote> do <filename>auto-props.txt</filename> mencionado lá.

source: All <filename>src</filename> commits go to FreeBSD-CURRENT first before being merged to FreeBSD-STABLE. The FreeBSD-STABLE branch must maintain <acronym>ABI</acronym> and <acronym>API</acronym> compatibility with earlier versions of that branch. Do not merge changes that break this compatibility.
pt_br: Todos os commits do <filename>src</filename> vão para o FreeBSD-CURRENT antes de serem mesclados para o FreeBSD-STABLE. A branch do FreeBSD-STABLE deve manter a compatibilidade de <acronym>ABI</acronym> e de <acronym>API</acronym> com as versões anteriores dessa branch. Não mescle as alterações que quebram essa compatibilidade.

source: Steps for New Committers
pt_br: Etapas para os novos committers

source: Add an Author Entity
pt_br: Adicione uma entidade de autor

source: <filename>doc/head/share/xml/authors.ent</filename> — Add an author entity. Later steps depend on this entity, and missing this step will cause the <filename>doc/</filename> build to fail. This is a relatively easy task, but remains a good first test of version control skills.
pt_br: <filename>doc/head/share/xml/authors.ent</filename> - Adicione uma entidade de autor. Etapas posteriores dependem dessa entidade, e a falta dessa etapa fará com que a compilação do <filename>doc/</filename> falhe. Essa é uma tarefa relativamente fácil, mas continua sendo um bom primeiro teste de habilidades no controle de versão.

source: Update the List of Developers and Contributors
pt_br: Atualize a lista de desenvolvedores e colaboradores

source: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.committers.xml</filename> — Add an entry to the <quote>Developers</quote> section of the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/staff-committers.html">Contributors List</link>. Entries are sorted by last name.
pt_br: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.committers.xml</filename> - Adicione uma entrada à seção <quote>Desenvolvedores</quote> da <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/staff-committers.html">Lista de Contribuidores</link>. As entradas são classificadas pelo sobrenome.

source: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename> — <emphasis>Remove</emphasis> the entry from the <quote>Additional Contributors</quote> section. Entries are sorted by first name.
pt_br: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename> - <emphasis>Remova</emphasis> a entrada da seção <quote>Contribuidores Adicionais</quote>. As entradas são classificadas pelo primeiro nome.

source: Add a News Item
pt_br: Adicione um item de notícias

source: <filename>doc/head/share/xml/news.xml</filename> — Add an entry. Look for the other entries that announce new committers and follow the format. Use the date from the commit bit approval email from <email>core@FreeBSD.org</email>.
pt_br: <filename>doc/head/share/xml/news.xml</filename> - Adicione uma entrada. Procure por outras entradas que anunciam novos committers e siga o formato. Use a data do email de aprovação do <email>core@FreeBSD.org</email> para o commit bit.

source: Add a <acronym>PGP</acronym> Key
pt_br: Adicione uma chave <acronym>PGP</acronym>

source: <filename>doc/head/share/pgpkeys/pgpkeys.ent</filename> and <filename>doc/head/share/pgpkeys/pgpkeys-developers.xml</filename> - Add your <acronym>PGP</acronym> or Gnu<acronym>PG</acronym> key. Those who do not yet have a key should see <xref linkend="pgpkeys-creating"/>.
pt_br: <filename>doc/head/share/pgpkeys/pgpkeys.ent</filename> e <filename>doc/head/share/pgpkeys/pgpkeys-developers.xml</filename> - Adicione a sua chave <acronym>PGP</acronym> ou Gnu<acronym>PG</acronym>. Aqueles que ainda não têm uma chave devem ver <xref linkend="pgpkeys-creating"/>.

source: Dag-Erling Smørgrav <email>des@FreeBSD.org</email> has written a shell script (<filename>doc/head/share/pgpkeys/addkey.sh</filename>) to make this easier. See the <link xlink:href="http://svnweb.FreeBSD.org/doc/head/share/pgpkeys/README">README</link> file for more information.
pt_br: O Dag-Erling Smørgrav <email>des@FreeBSD.org</email> escreveu um script de shell (<filename>doc/head/share/pgpkeys/addkey.sh</filename>) para tornar isto mais fácil. Consulte o arquivo <link xlink:href="http://svnweb.FreeBSD.org/doc/head/share/pgpkeys/README">README</link> para obter mais informações.

source: Use <filename>doc/head/share/pgpkeys/checkkey.sh</filename> to verify that keys meet minimal best-practices standards.
pt_br: Use o <filename>doc/head/share/pgpkeys/checkkey.sh</filename> para verificar se as chaves atendem aos padrões mínimos das boas práticas recomendadas.

source: After adding and checking a key, add both updated files to source control and then commit them. Entries in this file are sorted by last name.
pt_br: Depois de adicionar e verificar uma chave, adicione os dois arquivos atualizados ao controle de versão do código fonte, e em seguida faça o commit. As entradas neste arquivo são classificadas pelo sobrenome.

source: It is very important to have a current <acronym>PGP</acronym>/Gnu<acronym>PG</acronym> key in the repository. The key may be required for positive identification of a committer. For example, the FreeBSD Administrators <email>admins@FreeBSD.org</email> might need it for account recovery. A complete keyring of <systemitem class="fqdomainname">FreeBSD.org</systemitem> users is available for download from <link xlink:href="@@URL_RELPREFIX@@/doc/pgpkeyring.txt">https://www.FreeBSD.org/doc/pgpkeyring.txt</link>.
pt_br: É muito importante ter uma chave <acronym>PGP</acronym>/Gnu<acronym>PG</acronym> atualizada no repositório. A chave pode ser necessária para a identificação positiva de um committer. Por exemplo, os Administradores do FreeBSD <email>admins@FreeBSD.org </email>podem precisar dela para a recuperação da conta. Um chaveiro completo dos usuários do <systemitem class="fqdomainname">FreeBSD.org</systemitem> está disponível para download em <link xlink:href="@@URL_RELPREFIX@@/doc/pgpkeyring.txt">https://www.FreeBSD.org/doc/pgpkeyring.txt</link>.

source: Update Mentor and Mentee Information
pt_br: Atualize as informações do Mentor e do Mentee

source: <filename>base/head/share/misc/committers-<replaceable>repository</replaceable>.dot</filename> — Add an entry to the current committers section, where <replaceable>repository</replaceable> is <literal>doc</literal>, <literal>ports</literal>, or <literal>src</literal>, depending on the commit privileges granted.
pt_br: <filename>base/head/share/misc/committers-<replaceable>repository</replaceable>.dot</filename> - Adicione uma entrada à seção committers atuais, onde <replaceable>repository</replaceable> é <literal>doc</literal>, <literal>ports</literal>, ou <literal>src</literal>, dependendo dos privilégios de commit concedidos.

source: Add an entry for each additional mentor/mentee relationship in the bottom section.
pt_br: Adicione uma entrada para cada relacionamento adicional de mentor/mentee na seção inferior.

source: Generate a <application>Kerberos</application> Password
pt_br: Gere uma senha do <application>Kerberos</application>

source: See <xref linkend="kerberos-ldap"/> to generate or set a <application>Kerberos</application> for use with other FreeBSD services like the bug tracking database.
pt_br: Veja <xref linkend="kerberos-ldap"/> para gerar ou definir um <application>Kerberos</application> para uso com outros serviços do FreeBSD, como o banco de dados de rastreamento de bugs.

source: Optional: Enable Wiki Account
pt_br: Opcional: Ative a sua conta na Wiki

source: <link xlink:href="https://wiki.freebsd.org">FreeBSD Wiki</link> Account — A wiki account allows sharing projects and ideas. Those who do not yet have an account can follow instructions on the <link xlink:href="https://wiki.freebsd.org/AboutWiki">AboutWiki Page</link> to obtain one. Contact <email>wiki-admin@FreeBSD.org</email> if you need help with your Wiki account.
pt_br: <link xlink:href="https://wiki.freebsd.org">Conta no Wiki do FreeBSD</link> - Uma conta no wiki permite que compartilhe projetos e ideias. Aqueles que ainda não têm uma conta podem seguir as instruções da <link xlink:href="https://wiki.freebsd.org/AboutWiki">Página Sobre a Wiki</link> para obter uma. Entre em contato com <email>wikiadmin@FreeBSD.org</email> se precisar de ajuda com sua conta no Wiki.

source: Optional: Update Wiki Information
pt_br: Opcional: Atualize informações do Wiki

source: Wiki Information - After gaining access to the wiki, some people add entries to the <link xlink:href="https://wiki.freebsd.org/HowWeGotHere">How We Got Here</link>, <link xlink:href="https://wiki.freebsd.org/IRC/Nicknames">IRC Nicks</link>, and <link xlink:href="https://wiki.freebsd.org/Community/Dogs"> Dogs of FreeBSD</link> pages.
pt_br: Informações do Wiki - Depois de obter acesso ao wiki, algumas pessoas adicionam entradas nas páginas <link xlink:href="https://wiki.freebsd.org/HowWeGotHere">How We Got Here</link>, <link xlink:href="https://wiki.freebsd.org/IRC/Nicknames">IRC Nicks</link> e <link xlink:href="https://wiki.freebsd.org/Community/Dogs">Dogs of FreeBSD</link> páginas.

source: Optional: Update Ports with Personal Information
pt_br: Opcional: Atualize o Ports com as suas Informações Pessoais

source: <filename>ports/astro/xearth/files/freebsd.committers.markers</filename> and <filename>src/usr.bin/calendar/calendars/calendar.freebsd</filename> - Some people add entries for themselves to these files to show where they are located or the date of their birthday.
pt_br: <filename>ports/astro/xearth/files/freebsd.committers.markers</filename> e <filename>src/usr.bin/calendar/calendars/calendar.freebsd</filename> - Algumas pessoas adicionam entradas para elas nestes arquivos para mostrar onde estão localizadas ou a data de seu aniversário.

source: Optional: Prevent Duplicate Mailings
pt_br: Opcional: Evite Correspondências Duplicadas

source: Subscribers to <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> or <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> might wish to unsubscribe to avoid receiving duplicate copies of commit messages and followups.
pt_br: Assinantes das listas <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> ou da <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> podem desejar cancelar a assinatura para evitar receber cópias duplicadas de mensagens de commit e de followups.

source: For Everyone
pt_br: Para todos

source: Introduce yourself to the other developers, otherwise no one will have any idea who you are or what you are working on. The introduction need not be a comprehensive biography, just write a paragraph or two about who you are, what you plan to be working on as a developer in FreeBSD, and who will be your mentor. Email this to the FreeBSD developers mailing list and you will be on your way!
pt_br: Apresente-se aos outros desenvolvedores, caso contrário, ninguém fará a menor ideia de quem você é ou no que você está trabalhando. A introdução não precisa ser uma biografia abrangente, basta escrever um parágrafo ou dois sobre quem você é, em que você planeja trabalhar como desenvolvedor no FreeBSD e quem será seu mentor. Envie os parágrafos por e-mail para a lista de discussão dos desenvolvedores do FreeBSD e você estará a caminho!

source: Log into <systemitem>freefall.FreeBSD.org</systemitem> and create a <filename>/var/forward/<replaceable>user</replaceable></filename> (where <replaceable>user</replaceable> is your username) file containing the e-mail address where you want mail addressed to <replaceable>yourusername</replaceable>@FreeBSD.org to be forwarded. This includes all of the commit messages as well as any other mail addressed to the FreeBSD committer's mailing list and the FreeBSD developers mailing list. Really large mailboxes which have taken up permanent residence on <systemitem>freefall</systemitem> may get truncated without warning if space needs to be freed, so forward it or save it elsewhere.
pt_br: Entre na <systemitem>freefall.FreeBSD.org</systemitem> e crie um arquivo <filename>/var/forward/<replaceable>user</replaceable></filename> (no qual <replaceable>user</replaceable> é seu nome de usuário) contendo o endereço de e-mail para o qual você deseja que o correio endereçado para <replaceable>yourusername</replaceable>@FreeBSD.org seja encaminhado. Isto inclui todas as mensagens de commit assim como qualquer outro email endereçado à lista de discussão dos committers do FreeBSD e à lista de discussão dos desenvolvedores do FreeBSD. Caixas de correio realmente grandes que tenham residência permanente na <systemitem>freefall</systemitem> podem ser truncadas sem aviso se o espaço precisar ser liberado, então encaminhe suas mensagens ou salve-as em outro lugar.

source: If your e-mail system uses SPF with strict rules, you should whitelist <systemitem class="fqdomainname">mx2.FreeBSD.org</systemitem> from SPF checks.
pt_br: Se o seu sistema de e-mail usa SPF com regras estritas, você deve colocar o host <systemitem class="fqdomainname">mx2.FreeBSD.org</systemitem> na whitelist de verificações do SPF.

source: Due to the severe load dealing with SPAM places on the central mail servers that do the mailing list processing, the front-end server does do some basic checks and will drop some messages based on these checks. At the moment proper DNS information for the connecting host is the only check in place but that may change. Some people blame these checks for bouncing valid email. To have these checks turned off for your email, create a file named <filename>~/.spam_lover</filename> on <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.
pt_br: Devido ao load severo imposto aos servidores centrais que fazem o processamento da lista de discussão devido ao grande volume de SPAMs, o servidor de front-end faz algumas verificações básicas e descarta algumas mensagens com base nessas verificações. No momento, as informações de DNS adequadas para o host de conexão são a única verificação ativa, mas isso pode mudar. Algumas pessoas culpam estas verificações por rejeitar e-mails válidos. Para que essas verificações sejam desativadas no seu email, crie um arquivo chamado <filename>~/.spam_lover</filename> no servidor <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.

source: Those who are developers but not committers will not be subscribed to the committers or developers mailing lists. The subscriptions are derived from the access rights.
pt_br: Aqueles que são desenvolvedores, mas não são committers, não serão inscritos nas listas de discussão de desenvolvedores ou de committers. As assinaturas são derivadas dos direitos de acesso.

source: SMTP Access Setup
pt_br: Configuração de acesso SMTP

source: For those willing to send e-mail messages through the FreeBSD.org infrastructure, follow the instructions below:
pt_br: Para aqueles dispostos a enviar mensagens de e-mail através da infraestrutura do FreeBSD.org, siga as instruções abaixo:

source: Point your mail client at <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal>.
pt_br: Aponte seu cliente de e-mail para <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal>.

source: Enable STARTTLS.
pt_br: Habilite o STARTTLS.

source: Ensure your <literal>From:</literal> address is set to <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>.
pt_br: Assegure-se de que seu endereço <literal>From:</literal> esteja configurado para <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>.

source: For authentication, you can use your FreeBSD Kerberos username and password (see <xref linkend="kerberos-ldap"/>). The <literal><replaceable>yourusername</replaceable>/mail</literal> principal is preferred, as it is only valid for authenticating to mail resources.
pt_br: Para autenticação, você pode usar o seu nome de usuário e a sua senha do Kerberos no cluster do FreeBSD (veja <xref linkend="kerberos-ldap"/>). O principal <literal><replaceable>yourusername</replaceable>/mail</literal> é o preferido, pois é válido apenas para autenticação dos recursos de correio.
