Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: The script is also able to merge more than one revision at a time. If there have been other updates to the port since the branch was created that have not been merged because they were not security related. Add the different revisions <emphasis>in the order they were committed</emphasis> on the <command>mfh</command> line. The new commit log message will contain the combined log messages from all the original commits. These messages <emphasis>must</emphasis> be edited to show what is actually being done with the new commit.
pt_br: O script também pode aplicar mais de uma revisão por vez. Se houver outras atualizações no port desde que a branch foi criada e que não foram aplicadas porque não estavam relacionadas à segurança. Adicione as diferentes revisões <emphasis>na ordem em que foram feitos seus commits</emphasis> na linha de comando <command>mfh</command>. A nova mensagem de log de commit conterá as mensagens de log combinadas de todos os commits originais. Estas mensagens <emphasis>devem</emphasis> ser editadas para mostrar o que realmente está sendo feito com o novo commit.

source: The mfh script can also take an optional first argument, the branch where the merge is being done. Only the latest quarterly branch is supported, so specifying the branch is discouraged. To be safe, the script will give a warning if the quarterly branch is not the latest:
pt_br: O script mfh também pode ter um primeiro argumento opcional, a branch onde a aplicação está sendo feita. Apenas a última branch trimestral é suportada, portanto, especificar a branch é desencorajado. Por segurança, o script emitirá um aviso se a branch trimestral não for a mais recente:

source: Creating a New Category
pt_br: Criando uma Nova Categoria

source: What is the procedure for creating a new category?
pt_br: Qual é o procedimento para criar uma nova categoria?

source: Please see <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#proposing-categories"> Proposing a New Category</link> in the Porter's Handbook. Once that procedure has been followed and the PR has been assigned to the Ports Management Team <email>portmgr@FreeBSD.org</email>, it is their decision whether or not to approve it. If they do, it is their responsibility to:
pt_br: Por favor, veja <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#proposing-categories">Propondo uma nova categoria</link> no FreeBSD Porter's Handbook. Uma vez que o procedimento tenha sido seguido e o PR tenha sido atribuído à Equipe de Gerenciamento de Ports <email>portmgr@FreeBSD.org</email>, é decisão deles aprová-lo ou não. Se eles fizerem isso, é sua responsabilidade:

source: Perform any needed moves. (This only applies to physical categories.)
pt_br: Executar todos os passos necessários. (Isso só se aplica a categorias físicas.)

source: Update the <varname>VALID_CATEGORIES</varname> definition in <filename>ports/Mk/bsd.port.mk</filename>.
pt_br: Atualizar a definição de <varname>VALID_CATEGORIES</varname> em <filename>ports/Mk/bsd.port.mk</filename>.

source: Assign the PR back to you.
pt_br: Atribua o PR de volta para você.

source: What do I need to do to implement a new physical category?
pt_br: O que preciso fazer para implementar uma nova categoria física?

source: Upgrade each moved port's <filename>Makefile</filename>. Do not connect the new category to the build yet.
pt_br: Atualize o <filename>Makefile</filename> de cada port movido. Não conecte a nova categoria ao build ainda.

source: To do this, you will need to:
pt_br: Para fazer isso, você precisará:

source: Change the port's <varname>CATEGORIES</varname> (this was the point of the exercise, remember?) The new category is listed <emphasis>first</emphasis>. This will help to ensure that the <varname>PKGORIGIN</varname> is correct.
pt_br: Altere as <varname>CATEGORIES</varname> do port (esse foi o ponto do exercício, lembra?) A nova categoria está listada <emphasis>primeiro</emphasis>. Isso ajudará a garantir que o <varname>PKGORIGIN</varname> esteja correto.

source: Run a <command>make describe</command>. Since the top-level <command>make index</command> that you will be running in a few steps is an iteration of <command>make describe</command> over the entire ports hierarchy, catching any errors here will save you having to re-run that step later on.
pt_br: Execute um <command>make describe</command>. Como o <command>make index</command> de nível superior que você executará em poucas etapas é uma iteração do <command>make describe</command> sobre a hierarquia de ports inteira, detectar erros aqui irá salvar você de ter que voltar a executar esse passo mais tarde.

source: If you want to be really thorough, now might be a good time to run <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Se você quiser ser realmente meticuloso, agora pode ser um bom momento para executar o <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Check that the <varname>PKGORIGIN</varname>s are correct. The ports system uses each port's <varname>CATEGORIES</varname> entry to create its <varname>PKGORIGIN</varname>, which is used to connect installed packages to the port directory they were built from. If this entry is wrong, common port tools like <citerefentry><refentrytitle>pkg_version</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry vendor="ports"><refentrytitle>portupgrade</refentrytitle><manvolnum>1</manvolnum></citerefentry> fail.
pt_br: Verifique se os <varname>PKGORIGIN</varname>s estão corretos. O sistema de ports usa a entrada <varname>CATEGORIES</varname> de cada port para criar seu <varname>PKGORIGIN</varname>, que é usado para conectar pacotes instalados ao diretório de port do qual eles foram compilados. Se esta entrada estiver errada, ferramentas de port comuns como <citerefentry><refentrytitle>pkg_version</refentrytitle><manvolnum>1</manvolnum></citerefentry> e o <citerefentry vendor="ports"><refentrytitle>portupgrade</refentrytitle><manvolnum>1</manvolnum></citerefentry> irão falhar.

source: To do this, use the <filename>chkorigin.sh</filename> tool: <command>env PORTSDIR=<replaceable>/path/to/ports</replaceable> sh -e <replaceable>/path/to/ports</replaceable>/Tools/scripts/chkorigin.sh</command>. This will check <emphasis>every</emphasis> port in the ports tree, even those not connected to the build, so you can run it directly after the move operation. Hint: do not forget to look at the <varname>PKGORIGIN</varname>s of any slave ports of the ports you just moved!
pt_br: Para fazer isso, use a ferramenta <filename>chkorigin.sh</filename>: <command>env PORTSDIR=<replaceable>/path/to/ports</replaceable> sh -e <replaceable>/path/to/ports</replaceable>/Tools/scripts/chkorigin.sh</command>. Isso irá verificar <emphasis>todos</emphasis> os ports na árvore de ports, mesmo aqueles que não estão conectados à compilação, para que você possa executá-las diretamente após a operação de mudança. Dica: não esqueça de olhar para o <varname>PKGORIGIN</varname>s de qualquer port slave dos ports que você acabou de mudar!

source: On your own local system, test the proposed changes: first, comment out the <varname>SUBDIR</varname> entries in the old ports' categories' <filename>Makefile</filename>s; then enable building the new category in <filename>ports/Makefile</filename>. Run <command>make checksubdirs</command> in the affected category directories to check the <varname>SUBDIR</varname> entries. Next, in the <filename>ports/</filename> directory, run <command>make index</command>. This can take over 40 minutes on even modern systems; however, it is a necessary step to prevent problems for other people.
pt_br: Em seu próprio sistema local, teste as alterações propostas: primeiro, comente as entradas <varname>SUBDIR</varname> nos <filename>Makefile</filename>s das 'categorias' antigas do port; em seguida, habilite a compilação da nova categoria em <filename>ports/Makefile</filename>. Execute <command>make checksubdirs</command> nos diretórios de categoria afetados para verificar as entradas <varname>SUBDIR</varname>. Em seguida, no diretório <filename>ports/</filename>, execute <command>make index</command>. Isso pode levar mais de 40 minutos em sistemas modernos; no entanto, é um passo necessário para evitar problemas para outras pessoas.

source: Once this is done, you can commit the updated <filename>ports/Makefile</filename> to connect the new category to the build and also commit the <filename>Makefile</filename> changes for the old category or categories.
pt_br: Uma vez feito isso, você pode fazer o commit do <filename>ports/Makefile</filename> atualizado para conectar a nova categoria à compilação e também fazer o commit das alterações do <filename>Makefile</filename> para a categoria ou categorias antigas.

source: Add appropriate entries to <filename>ports/MOVED</filename>.
pt_br: Adicione as entradas apropriadas no <filename>ports/MOVED</filename>.

source: Update the documentation by modifying:
pt_br: Atualize a documentação modificando:

source: the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#PORTING-CATEGORIES">list of categories</link> in the Porter's Handbook
pt_br: a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#PORTING-CATEGORIES">lista de categorias</link> no FreeBSD Porter's Handbook

source: <filename>doc/en_US.ISO8859-1/htdocs/ports</filename>. Note that these are now displayed by sub-groups, as specified in <filename>doc/en_US.ISO8859-1/htdocs/ports/categories.descriptions</filename>.
pt_br: <filename>doc/en_US.ISO8859-1/htdocs/ports</filename>. Observe que agora eles são exibidos por subgrupos, conforme especificado em <filename>doc/en_US.ISO8859-1/htdocs/ports/categories.descriptions</filename>.

source: (Note: these are in the docs, not the ports, repository). If you are not a docs committer, you will need to submit a PR for this.
pt_br: (Nota: estes estão nos docs, não nos ports, repositório). Se você não é um doc committer, você precisará enviar um PR para isso.

source: Only once all the above have been done, and no one is any longer reporting problems with the new ports, should the old ports be deleted from their previous locations in the repository.
pt_br: Apenas quando todas as opções acima tiverem sido concluídas, e ninguém mais estiver relatando problemas com os novos ports, os ports antigos devem ser excluídos de seus locais anteriores no repositório.

source: It is not necessary to manually update the <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">ports web pages</link> to reflect the new category. This is done automatically via the change to <filename>en_US.ISO8859-1/htdocs/ports/categories</filename> and the automated rebuild of <filename>INDEX</filename>.
pt_br: Não é necessário atualizar manualmente as <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">páginas web dos ports</link> para refletir a nova categoria. Isso será feito automaticamente através da alteração em <filename>en_US.ISO8859-1/htdocs/ports/categories</filename> e o rebuild automático do <filename>INDEX</filename>.

source: What do I need to do to implement a new virtual category?
pt_br: O que preciso fazer para implementar uma nova categoria virtual?

source: This is much simpler than a physical category. Only a few modifications are needed:
pt_br: Isso é muito mais simples que uma categoria física. Apenas algumas modificações são necessárias:

source: Miscellaneous Questions
pt_br: Perguntas Diversas

source: Are there changes that can be committed without asking the maintainer for approval?
pt_br: Existe alguma alteração para a qual possa ser feito o commit sem a aprovação do mantenedor?

source: Blanket approval for most ports applies to these types of fixes:
pt_br: A aprovação implícita para a maioria dos ports se aplica a estes tipos de correções:

source: Most infrastructure changes to a port (that is, modernizing, but not changing the functionality). For example, the blanket covers converting to new <varname>USES</varname> macros, enabling verbose builds, and switching to new ports system syntaxes.
pt_br: A maioria das alterações de infraestrutura para um port (isso é, modernizar, sem alterar funcionalidades). Por exemplo, a aprovação implícita inclui a conversão de novas macros <varname>USES</varname>, ativar verbosidade de compilação e alterações para novas sintaxes de sistema do ports.

source: Trivial and <emphasis>tested</emphasis> build and runtime fixes.
pt_br: Trivialidades e correções <emphasis>testadas</emphasis> de compilação e execução.

source: Exceptions to this are anything maintained by the Ports Management Team <email>portmgr@FreeBSD.org</email>, or the Security Officer Team <email>security-officer@FreeBSD.org</email>. No unauthorized commits may ever be made to ports maintained by those groups.
pt_br: Exceções para isso são qualquer coisa que seja mantido pela Equipe de Gerenciamento do Ports <email>portmgr@FreeBSD.org</email> ou pelo Time de Oficiais de Segurança <email>security-officer@FreeBSD.org</email>. Nenhum commit não autorizado pode ser feito em ports mantidos por esses grupos.

source: How do I know if my port is building correctly or not?
pt_br: Como sei se meu port está sendo compilado corretamente ou não?

source: The packages are built multiple times each week. If a port fails, the maintainer will receive an email from <literal>pkg-fallout@FreeBSD.org</literal>.
pt_br: Os pacotes são criados várias vezes por semana. Se um port falhar, o mantenedor receberá um email de <literal>pkg-fallout@FreeBSD.org</literal>.

source: Reports for all the package builds (official, experimental, and non-regression) are aggregated at <link xlink:href="https://pkg-status.freebsd.org/">pkg-status.FreeBSD.org</link>.
pt_br: Relatórios para todas as compilações de pacotes (oficiais, experimentais e não regressivos) são agregados em <link xlink:href="https://pkg-status.freebsd.org/">pkg-status.FreeBSD.org</link>.

source: I added a new port. Do I need to add it to the <filename>INDEX</filename>?
pt_br: Eu adicionei um novo port. Preciso adicioná-lo ao <filename>INDEX</filename>?

source: No. The file can either be generated by running <command>make index</command>, or a pre-generated version can be downloaded with <command>make fetchindex</command>.
pt_br: Não. O arquivo pode ser gerado executando <command>make index</command>, ou uma versão pré-gerada pode ser baixada com o comando <command>make fetchindex</command>.

source: Are there any other files I am not allowed to touch?
pt_br: Existem outros arquivos que não tenho permissão para tocar?

source: Any file directly under <filename>ports/</filename>, or any file under a subdirectory that starts with an uppercase letter (<filename>Mk/</filename>, <filename>Tools/</filename>, etc.). In particular, the Ports Management Team <email>portmgr@FreeBSD.org</email> is very protective of <filename>ports/Mk/bsd.port*.mk</filename> so do not commit changes to those files unless you want to face their wrath.
pt_br: Qualquer arquivo diretamente sob <filename>ports/</filename>, ou qualquer arquivo sob um subdiretório que comece com uma letra maiúscula (<filename>Mk/</filename>, <filename>Tools/</filename>, etc.) . Em particular, a Equipe de Gerenciamento de Ports <email>portmgr@FreeBSD.org</email> protege muito o <filename>ports/Mk/bsd.port*.mk </filename>, portanto, não faça alterações nesses arquivos, a menos que você queira enfrentar a sua ira.

source: What is the proper procedure for updating the checksum for a port distfile when the file changes without a version change?
pt_br: Qual é o procedimento adequado para atualizar o checksum de um distfile de um port quando o arquivo é alterado sem uma alteração de versão?

source: When the checksum for a distribution file is updated due to the author updating the file without changing the port revision, the commit message includes a summary of the relevant diffs between the original and new distfile to ensure that the distfile has not been corrupted or maliciously altered. If the current version of the port has been in the ports tree for a while, a copy of the old distfile will usually be available on the ftp servers; otherwise the author or maintainer should be contacted to find out why the distfile has changed.
pt_br: Quando o checksum de um arquivo de distribuição é atualizado devido ao autor atualizar o arquivo sem alterar a revisão do port, a mensagem de commit inclui um resumo dos diffs relevantes entre o distfile original e novo para garantir que o distfile não tenha sido corrompido ou alterado de maneira mal-intencionada . Se a versão atual do port estiver na árvore de ports por um tempo, uma cópia do antigo distfile estará normalmente disponível nos servidores ftp; caso contrário, o autor ou mantenedor deve ser contatado para descobrir por que o distfile foi alterado.

source: How can an experimental test build of the ports tree (<emphasis>exp-run</emphasis>) be requested?
pt_br: Como uma build de teste experimental da árvore de ports (<emphasis>exp-run</emphasis>) pode ser solicitada?

source: An exp-run must be completed before patches with a significant ports impact are committed. The patch can be against the ports tree or the base system.
pt_br: Um exp-run deve ser realizado antes que seja feito o commit de patches com um impacto significativo nos ports. O patch pode ser contra a árvore de ports ou o sistema base.

source: Full package builds will be done with the patches provided by the submitter, and the submitter is required to fix detected problems (<emphasis>fallout</emphasis>) before commit.
pt_br: A build completa do pacote será feita com as correções fornecidas pelo remetente, e o remetente deverá corrigir os problemas detectados (<emphasis>fallout</emphasis>) antes de fazer o commit.

source: Go to the <link xlink:href="https://bugs.freebsd.org/submit">Bugzilla new <acronym>PR</acronym> page</link>.
pt_br: Vá para a <link xlink:href="https://bugs.freebsd.org/submit">nova página de <acronym>PR</acronym> do Bugzilla</link>.

source: Select the product your patch is about.
pt_br: Selecione o produto ao qual seu patch se aplica.

source: Fill in the bug report as normal. Remember to attach the patch.
pt_br: Preencha o relatório de erros normalmente. Lembre-se de anexar o patch.

source: If at the top it says <quote>Show Advanced Fields</quote> click on it. It will now say <quote>Hide Advanced Fields</quote>. Many new fields will be available. If it already says <quote>Hide Advanced Fields</quote>, no need to do anything.
pt_br: Se no topo existir <quote>Show Advanced Fields</quote> clique sobre ele. Agora, ele dirá <quote>Hide Advanced Fields</quote>. Muitos novos campos estarão disponíveis. Se a pagina já diz <quote>Hide Advanced Fields</quote>, não precisa fazer nada.

source: In the <quote>Flags</quote> section, set the <quote>exp-run</quote> one to <literal>?</literal>. As for all other fields, hovering the mouse over any field shows more details.
pt_br: Na seção <quote>Flags</quote>, defina o <quote>exp-run</quote> para <literal>?</literal>. Quanto a todos os outros campos, passar o mouse sobre qualquer campo mostrará mais detalhes.

source: Submit. Wait for the build to run.
pt_br: Envie. Aguarde a build ser executada.

source: Ports Management Team <email>portmgr@FreeBSD.org</email> will reply with a possible fallout.
pt_br: A Equipe de Gerenciamento do Ports <email>portmgr@FreeBSD.org</email> responderá com uma possível fallout.

source: Depending on the fallout:
pt_br: Dependendo do fallout:

source: If there is no fallout, the procedure stops here, and the change can be committed, pending any other approval required.
pt_br: Se não houver nenhuma falha, o procedimento será interrompido e você poderá fazer o commit da alteração, pendente de qualquer outra aprovação que seja necessária.

source: If there is fallout, it <emphasis>must</emphasis> be fixed, either by fixing the ports directly in the ports tree, or adding to the submitted patch.
pt_br: Se houver uma falha, ela <emphasis>deve</emphasis> ser corrigida, seja consertando os ports diretamente na árvore de ports, ou adicionando ao patch enviado.

source: When this is done, go back to step 6 saying the fallout was fixed and wait for the exp-run to be run again. Repeat as long as there are broken ports.
pt_br: Quando isso estiver pronto, volte para a etapa 6, informando que a falha foi corrigida e aguarde a exp-run ser executada novamente. Repita quantas vezes necessário enquanto houver ports quebrados.

source: Issues Specific to Developers Who Are Not Committers
pt_br: Problemas Específicos para Desenvolvedores Que Não São Committers

source: A few people who have access to the FreeBSD machines do not have commit bits. Almost all of this document will apply to these developers as well (except things specific to commits and the mailing list memberships that go with them). In particular, we recommend that you read:
pt_br: Algumas pessoas que têm acesso às máquinas do FreeBSD não possuem commit bits. Quase todo este documento também será aplicado a esses desenvolvedores (exceto itens específicos de commits e associações de listas de discussão que os acompanham). Em particular, recomendamos que você leia:

source: <link linkend="admin">Administrative Details</link>
pt_br: <link linkend="admin">Detalhes Administrativos</link>

source: <link linkend="conventions-everyone">Conventions</link>
pt_br: <link linkend="conventions-everyone">Convenções</link>

source: Get your mentor to add you to the <quote>Additional Contributors</quote> (<filename>doc/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename>), if you are not already listed there.
pt_br: Peça ao seu mentor para adicioná-lo em <quote>Colaboradores Adicionais</quote> (<filename>doc/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename>), se você ainda não estiver listado há.

source: <link linkend="developer.relations">Developer Relations</link>
pt_br: <link linkend="developer.relations">Relações entre os Desenvolvedores</link>

source: <link linkend="ssh.guide">SSH Quick-Start Guide</link>
pt_br: <link linkend="ssh.guide">Guia de início rápido do SSH</link>

source: <link linkend="rules">The FreeBSD Committers' Big List of Rules</link>
pt_br: <link linkend="rules">A Grande Lista de Regras dos Committers do FreeBSD</link>

source: Information About Google Analytics
pt_br: Informações sobre o Google Analytics

source: As of December 12, 2012, Google Analytics was enabled on the FreeBSD Project website to collect anonymized usage statistics regarding usage of the site. The information collected is valuable to the FreeBSD Documentation Project, to identify various problems on the FreeBSD website.
pt_br: A partir de 12 de dezembro de 2012, o Google Analytics foi habilitado no site do Projeto FreeBSD para coletar estatísticas anônimas sobre o uso do site. As informações coletadas são valiosas para o Projeto de Documentação do FreeBSD, para identificar vários problemas no site do FreeBSD.

source: Google Analytics General Policy
pt_br: Política Geral do Google Analytics
