Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: André Franciosi, andre@franciosi.org, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018 Silvio Ap Silva, contato@kanazuchi.com, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018-2020

source: Committer's Guide
pt_br: Guia dos Committers

source: <orgname>The FreeBSD Documentation Project</orgname>
pt_br: <orgname>Projeto de Documentação do FreeBSD</orgname>

source: <year>1999</year> <year>2000</year> <year>2001</year> <year>2002</year> <year>2003</year> <year>2004</year> <year>2005</year> <year>2006</year> <year>2007</year> <year>2008</year> <year>2009</year> <year>2010</year> <year>2011</year> <year>2012</year> <year>2013</year> <year>2014</year> <year>2015</year> <year>2016</year> <year>2017</year> <year>2018</year> <year>2019</year> <year>2020</year> <holder>The FreeBSD Documentation Project</holder>
pt_br: <year>1999</year> <year>2000</year> <year>2001</year> <year>2002</year> <year>2003</year> <year>2004</year> <year>2005</year> <year>2006</year> <year>2007</year> <year>2008</year> <year>2009</year> <year>2010</year> <year>2011</year> <year>2012</year> <year>2013</year> <year>2014</year> <year>2015</year> <year>2016</year> <year>2017</year> <year>2018</year> <year>2019</year> <year>2020</year> <holder>Projeto de Documentação do FreeBSD</holder>

source: This document provides information for the FreeBSD committer community. All new committers should read this document before they start, and existing committers are strongly encouraged to review it from time to time.
pt_br: Este documento fornece informações para a comunidade de committers do FreeBSD. Todos os novos committers devem ler este documento antes de começar, e os committers existentes são fortemente encorajados a revisá-lo de tempos em tempos.

source: Almost all FreeBSD developers have commit rights to one or more repositories. However, a few developers do not, and some of the information here applies to them as well. (For instance, some people only have rights to work with the Problem Report database). Please see <xref linkend="non-committers"/> for more information.
pt_br: Quase todos os desenvolvedores do FreeBSD possuem direitos de commit para um ou mais repositórios. No entanto, alguns desenvolvedores não tem, e algumas das informações aqui se aplicam a eles também. (Por exemplo, algumas pessoas só têm direitos para trabalhar com o banco de dados do Relatório de Problemas). Por favor, veja <xref linkend="non-committers"/> para mais informações.

source: This document may also be of interest to members of the FreeBSD community who want to learn more about how the project works.
pt_br: Este documento também pode ser de interesse para os membros da comunidade FreeBSD que querem aprender mais sobre como o projeto funciona.

source: Administrative Details
pt_br: Detalhes Administrativos

source: <emphasis>Login Methods</emphasis>
pt_br: <emphasis>Métodos de login</emphasis>

source: <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, protocol 2 only
pt_br: <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum> </citerefentry>,_apenas no protocolo 2

source: <emphasis>Main Shell Host</emphasis>
pt_br: <emphasis>Servidor Principal de Shell</emphasis>

source: <emphasis>SMTP Host</emphasis>
pt_br: <emphasis>Servidor SMTP</emphasis>

source: <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal> (see also <xref linkend="smtp-setup"/>).
pt_br: <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal> (veja também <xref linkend="smtp-setup"/>).

source: <emphasis><literal>src/</literal> Subversion Root</emphasis>
pt_br: <emphasis>Raiz do Subversion para o <literal>src/</literal></emphasis>

source: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/base</filename> (see also <xref linkend="svn-getting-started-base-layout"/>).
pt_br: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/base</filename> (veja também <xref linkend="svn-getting-started-base-layout"/>).

source: <emphasis><literal>doc/</literal> Subversion Root</emphasis>
pt_br: <emphasis>Raiz do Subversion para o <literal>doc/</literal></emphasis>

source: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/doc</filename> (see also <xref linkend="svn-getting-started-doc-layout"/>).
pt_br: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/doc</filename> (veja também <xref linkend="svn-getting-started-doc-layout"/>).

source: <emphasis><literal>ports/</literal> Subversion Root</emphasis>
pt_br: <emphasis>Raiz do Subversion para o <literal>ports/</literal></emphasis>

source: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/ports</filename> (see also <xref linkend="svn-getting-started-ports-layout"/>).
pt_br: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/ports</filename> (veja também <xref linkend="svn-getting-started-ports-layout"/>).

source: <emphasis>Internal Mailing Lists</emphasis>
pt_br: <emphasis>Listas de Discussão Internas</emphasis>

source: developers (technically called all-developers), doc-developers, doc-committers, ports-developers, ports-committers, src-developers, src-committers. (Each project repository has its own -developers and -committers mailing lists. Archives for these lists can be found in the files <filename>/local/mail/<replaceable>repository-name</replaceable>-developers-archive</filename> and <filename>/local/mail/<replaceable>repository-name</replaceable>-committers-archive</filename> on the <systemitem class="fqdomainname">FreeBSD.org</systemitem> cluster.)
pt_br: developers (tecnicamente chamada de all-developers), doc-developers, doc-committers, ports-developers, ports-committers, src-developers, src-committers. (cada repositório do projeto tem as suas próprias listas de discussão -developers e -committers. Os arquivos destas listas podem ser encontrados nos arquivos <filename>/local/mail/<replaceable>repository-name</replaceable>-developers-archive</filename> e <filename>/local/mail/<replaceable>repository-name</replaceable>-committers-archive</filename> no cluster <systemitem class="fqdomainname">FreeBSD.org</systemitem>.)

source: <emphasis>Core Team monthly reports</emphasis>
pt_br: <emphasis>Relatórios mensais do Core Team</emphasis>

source: <filename>/home/core/public/monthly-reports</filename> on the <systemitem class="fqdomainname">FreeBSD.org</systemitem> cluster.
pt_br: Disponíveis no diretório <filename>/home/core/public/monthly-reports</filename> do cluster <systemitem class="fqdomainname">FreeBSD.org</systemitem>.

source: <emphasis>Ports Management Team monthly reports</emphasis>
pt_br: <emphasis>Relatórios mensais da Equipe de Gestão do Ports</emphasis>

source: <filename>/home/portmgr/public/monthly-reports</filename> on the <systemitem class="fqdomainname">FreeBSD.org</systemitem> cluster.
pt_br: Disponíveis no diretório <filename>/home/portmgr/public/monthly-reports</filename> do cluster <systemitem class="fqdomainname">FreeBSD.org</systemitem>.

source: <emphasis>Noteworthy <literal>src/</literal> SVN Branches</emphasis>
pt_br: <emphasis>Branchs SVN do <literal>src/</literal> dignas de atenção</emphasis>

source: <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> is required to connect to the project hosts. For more information, see <xref linkend="ssh.guide"/>.
pt_br: O <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> é necessário para se conectar aos servidores do projeto. Para mais informações, veja <xref linkend="ssh.guide"/>.

source: Useful links:
pt_br: Links Úteis:

source: <link xlink:href="@@URL_RELPREFIX@@/internal/">FreeBSD Project Internal Pages</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/internal/">Páginas Internas do Projeto FreeBSD</link>

source: <link xlink:href="@@URL_RELPREFIX@@/internal/machines.html">FreeBSD Project Hosts</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/internal/machines.html">Servidores do Projeto FreeBSD</link>

source: <link xlink:href="@@URL_RELPREFIX@@/administration.html">FreeBSD Project Administrative Groups</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/administration.html">Grupos Administrativos do Projeto FreeBSD</link>

source: Open<acronym>PGP</acronym> Keys for FreeBSD
pt_br: Chaves Open<acronym>PGP</acronym> para o FreeBSD

source: Cryptographic keys conforming to the Open<acronym>PGP</acronym> (<emphasis>Pretty Good Privacy</emphasis>) standard are used by the FreeBSD project to authenticate committers. Messages carrying important information like public <acronym>SSH</acronym> keys can be signed with the Open<acronym>PGP</acronym> key to prove that they are really from the committer. See <link xlink:href="http://www.nostarch.com/pgp_ml.htm">PGP &amp; GPG: Email for the Practical Paranoid by Michael Lucas</link> and <link xlink:href="http://en.wikipedia.org/wiki/Pretty_Good_Privacy"/> for more information.
pt_br: O projeto FreeBSD utiliza chaves criptográficas em conformidade com o padrão Open<acronym>PGP</acronym> (<emphasis>Pretty Good Privacy</emphasis>) para autenticar os committers. Mensagens contendo informações importantes como chaves públicas <acronym>SSH</acronym> podem ser assinadas com uma chave Open<acronym>PGP</acronym> para provar que elas vieram realmente do committer. Veja <link xlink:href="http://www.nostarch.com/pgp_ml.htm">PGP &amp; GPG: Email for the Practical Paranoid by Michael Lucas</link> e <link xlink:href="http://en.wikipedia.org/wiki/Pretty_Good_Privacy"/> para maiores informações.

source: Creating a Key
pt_br: Criando uma chave

source: Existing keys can be used, but should be checked with <filename>doc/head/share/pgpkeys/checkkey.sh</filename> first. In this case, make sure the key has a FreeBSD user ID.
pt_br: As chaves existentes podem ser usadas, mas elas devem ser obtidas com o <filename>doc/head/share/pgpkeys/checkkey.sh</filename> primeiro. Neste caso, certifique-se que a chave contenha um ID de usuário FreeBSD.

source: For those who do not yet have an Open<acronym>PGP</acronym> key, or need a new key to meet FreeBSD security requirements, here we show how to generate one.
pt_br: Para quem ainda não tem uma chave Open<acronym>PGP</acronym>, ou precisa de uma nova chave para atender aos requisitos de segurança do FreeBSD, nesta seção iremos mostrar como gerar uma.

source: Install <filename role="package">security/gnupg</filename>. Enter these lines in <filename>~/.gnupg/gpg.conf</filename> to set minimum acceptable defaults:
pt_br: Instale o <filename role="package">security/gnupg</filename>. Digite estas linhas no <filename>~/.gnupg/gpg.conf</filename> para definir padrões mínimos aceitáveis:

source: Generate a key:
pt_br: Gere uma chave:

source: 2048-bit keys with a three-year expiration provide adequate protection at present (2013-12). <link xlink:href="http://danielpocock.com/rsa-key-sizes-2048-or-4096-bits"/> describes the situation in more detail.
pt_br: Chaves de 2048-bit com uma expiração de 3 anos proveem uma proteção adequada nos dias de hoje (2013-12). O artigo <link xlink:href="http://danielpocock.com/rsa-key-sizes-2048-or-4096-bits"/> descreve a situação em mais detalhes.

source: A three year key lifespan is short enough to obsolete keys weakened by advancing computer power, but long enough to reduce key management problems.
pt_br: Três anos é um tempo de vida para a chave que é curto o suficiente para tornar obsoletas as chaves enfraquecidas pelo avanço do poder computacional, mas é tempo suficiente para reduzir os principais problemas de gerenciamento.

source: Use your real name here, preferably matching that shown on government-issued <acronym>ID</acronym> to make it easier for others to verify your identity. Text that may help others identify you can be entered in the <literal>Comment</literal> section.
pt_br: Use o seu nome real, preferencialmente o mesmo que consta do seu documento de identificação (<acronym>ID</acronym>) emitido pelo seu governo para tornar mais fácil para as outras pessoas confirmarem sua identidade. Você pode inserir um texto adicional para ajudar outras pessoas a identificar você na seção <literal>Comment</literal>.

source: After the email address is entered, a passphrase is requested. Methods of creating a secure passphrase are contentious. Rather than suggest a single way, here are some links to sites that describe various methods: <link xlink:href="http://world.std.com/~reinhold/diceware.html"/>, <link xlink:href="http://www.iusmentis.com/security/passphrasefaq/"/>, <link xlink:href="http://xkcd.com/936/"/>, <link xlink:href="http://en.wikipedia.org/wiki/Passphrase"/>.
pt_br: Depois que o endereço de e-mail é inserido, uma senha é solicitada. Os métodos de criação de uma frase secreta segura são controversos. Em vez de sugerir um único caminho, aqui estão alguns links para sites que descrevem vários métodos:<link xlink:href="http://world.std.com/~reinhold/diceware.html"/>, <link xlink:href="http://www.iusmentis.com/security/passphrasefaq/"/>, <link xlink:href="http://xkcd.com/936/"/> e <link xlink:href="http://en.wikipedia.org/wiki/Passphrase"/>.

source: Protect the private key and passphrase. If either the private key or passphrase may have been compromised or disclosed, immediately notify <email>accounts@FreeBSD.org</email> and revoke the key.
pt_br: Proteja a chave privada e a frase secreta. Se a chave privada ou a frase secreta pode ter sido comprometida ou exposta, notifique imediatamente <email>accounts@FreeBSD.org</email> e revogue a chave.

source: Committing the new key is shown in <xref linkend="commit-steps"/>.
pt_br: O processo para commit da nova chave é mostrado em <xref linkend="commit-steps"/>.

source: Kerberos and LDAP web Password for FreeBSD Cluster
pt_br: Kerberos e LDAP Web Password para o cluster do FreeBSD

source: The FreeBSD cluster requires a Kerberos password to access certain services. The Kerberos password also serves as the LDAP web password, since LDAP is proxying to Kerberos in the cluster. Some of the services which require this include:
pt_br: O cluster do FreeBSD requer uma senha do Kerberos para acessar certos serviços. A senha do Kerberos também serve como a senha LDAP para a web, já que o LDAP faz um proxy para o Kerberos no cluster. Alguns dos serviços que exigem isso incluem:

source: To create a new Kerberos account in the FreeBSD cluster, or to reset a Kerberos password for an existing account using a random password generator:
pt_br: Para criar uma nova conta do Kerberos no cluster do FreeBSD, ou para redefinir uma senha do Kerberos para uma conta existente usando um gerador de senha aleatória:

source: This must be done from a machine outside of the FreeBSD.org cluster.
pt_br: Isto deve ser feito a partir de uma máquina fora do cluster do FreeBSD.org.

source: A Kerberos password can also be set manually by logging into <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem> and running:
pt_br: Uma senha do Kerberos também pode ser definida manualmente, para isto logue no servidor <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem> e execute:

source: Unless the Kerberos-authenticated services of the FreeBSD.org cluster have been used previously, <errorname>Client unknown</errorname> will be shown. This error means that the <command>ssh kpasswd.freebsd.org</command> method shown above must be used first to initialize the Kerberos account.
pt_br: A menos que os serviços autenticados por Kerberos do cluster do FreeBSD.org tenham sido usados anteriormente, o erro <errorname>Client unknown</errorname>será exibido. Este erro significa que o método <command>ssh kpasswd.freebsd.org</command> mostrado acima deve ser usado primeiro para inicializar a conta Kerberos.

source: Commit Bit Types
pt_br: Tipos de Commit Bits

source: The FreeBSD repository has a number of components which, when combined, support the basic operating system source, documentation, third party application ports infrastructure, and various maintained utilities. When FreeBSD commit bits are allocated, the areas of the tree where the bit may be used are specified. Generally, the areas associated with a bit reflect who authorized the allocation of the commit bit. Additional areas of authority may be added at a later date: when this occurs, the committer should follow normal commit bit allocation procedures for that area of the tree, seeking approval from the appropriate entity and possibly getting a mentor for that area for some period of time.
pt_br: O repositório do FreeBSD possui um número de componentes que, quando combinados, suportam os fontes básicos do sistema operacional, a documentação, a infraestrutura de ports de aplicativos de terceiros e vários utilitários mantidos. Quando os commit bits do FreeBSD são alocados, as áreas da árvore onde o bit pode ser usado são especificadas. Geralmente, as áreas associadas a um bit refletem quem autorizou a alocação do bit de commit. Áreas adicionais de autoridade podem ser adicionadas em uma data posterior: quando isso ocorre, o committer deve seguir procedimentos normais de atribuição de bits de confirmação para essa área da árvore, buscando a aprovação da entidade apropriada e possivelmente obtendo um mentor para essa área por algum período de tempo.

source: <emphasis>Committer Type</emphasis>
pt_br: <emphasis>Tipo de Committer</emphasis>

source: <emphasis>Responsible</emphasis>
pt_br: <emphasis>Responsável</emphasis>

source: <emphasis>Tree Components</emphasis>
pt_br: <emphasis>Componentes da Árvore</emphasis>

source: src/, doc/ subject to appropriate review
pt_br: src/, doc/ sujeito a revisão apropriada

source: doc/, ports/, src/ documentation
pt_br: doc/, ports/, src/ documentação

source: Commit bits allocated prior to the development of the notion of areas of authority may be appropriate for use in many parts of the tree. However, common sense dictates that a committer who has not previously worked in an area of the tree seek review prior to committing, seek approval from the appropriate responsible party, and/or work with a mentor. Since the rules regarding code maintenance differ by area of the tree, this is as much for the benefit of the committer working in an area of less familiarity as it is for others working on the tree.
pt_br: Os commit bits alocados antes do desenvolvimento da noção de áreas de autoridade podem ser apropriados para uso em muitas partes da árvore. No entanto, o senso comum determina que um committer que não tenha trabalhado anteriormente em uma área da árvore busque alguém para realizar uma revisão antes de realizar o commit, busque a aprovação da parte responsável apropriada e/ou trabalhe com um mentor. Uma vez que as regras relativas à manutenção de código diferem por área da árvore, isso é tanto para o benefício do committer trabalhando em uma área de menos familiar quanto para as outras pessoas trabalhando na árvore.

source: Committers are encouraged to seek review for their work as part of the normal development process, regardless of the area of the tree where the work is occurring.
pt_br: Committers são encorajados a buscar revisão do seu trabalho como parte do processo normal de desenvolvimento, independentemente da área da árvore onde o trabalho está ocorrendo.

source: Policy for Committer Activity in Other Trees
pt_br: Política para atividade de Committers em outras árvores

source: All committers may modify <filename>base/head/share/misc/committers-*.dot</filename>, <filename>base/head/usr.bin/calendar/calendars/calendar.freebsd</filename>, and <filename>ports/head/astro/xearth/files</filename>.
pt_br: Todos os committers podem modificar <filename>base/head/share/misc/committers-*.dot</filename>, <filename>base/head/usr.bin/calendar/calendars/calendar.freebsd</filename>, e <filename>ports/head/astro/xearth/files</filename>.

source: doc committers may commit documentation changes to <filename>src</filename> files, such as man pages, READMEs, fortune databases, calendar files, and comment fixes without approval from a src committer, subject to the normal care and tending of commits.
pt_br: os doc committers podem efetuar commits de alterações na documentação sob <filename>src</filename>, tal como man pages, READMEs, banco de dados do fortune, arquivos de calendários, e comentar correções sem aprovação de um src committer, sujeito aos cuidados normais necessários para um commit seguro.

source: Any committer may make changes to any other tree with an "Approved by" from a non-mentored committer with the appropriate bit.
pt_br: Qualquer committer pode fazer alterações em qualquer outra árvore com um "Approved by" de um committer que não esteja sob mentoria e que tenha o bit apropriado.

source: Committers can acquire an additional bit by the usual process of finding a mentor who will propose them to core, doceng, or portmgr, as appropriate. When approved, they will be added to 'access' and the normal mentoring period will ensue, which will involve a continuing of <quote>Approved by</quote> for some period.
pt_br: Os committers podem adquirir um bit adicional pelo processo usual de encontrar um mentor que os proporá ao core, doceng ou portmgr, conforme apropriado. Quando aprovados, eles serão adicionados ao 'access' e o período normal de mentoria irá ocorrer, o que envolverá a continuidade do uso do <quote>Approved by</quote> por um período.

source: "Approved by" is only acceptable from non-mentored src committers -- mentored committers can provide a "Reviewed by" but not an "Approved by".
pt_br: O "Approved by" só é aceitável vindo de src committers que não estejam sob mentoria - os committers mentorados podem fornecer um "Reviewed by" mas não um "Approved by".

source: New committers are assumed to already be familiar with the basic operation of Subversion. If not, start by reading the <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link>.
pt_br: Supõe-se que novos committers já estejam familiarizados com a operação básica do Subversion. Se não, comece lendo o <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link>.

source: Introduction
pt_br: Introdução

source: The FreeBSD source repository switched from <acronym>CVS</acronym> to Subversion on May 31st, 2008. The first real <acronym>SVN</acronym> commit is <emphasis>r179447</emphasis>.
pt_br: O repositório de código fonte do FreeBSD mudou do <acronym>CVS</acronym> para o Subversion em 31 de maio de 2008. O primeiro commit real no <acronym>SVN</acronym> é o <emphasis>r179447</emphasis>.

source: The FreeBSD <literal>doc/www</literal> repository switched from <acronym>CVS</acronym> to Subversion on May 19th, 2012. The first real <acronym>SVN</acronym> commit is <emphasis>r38821</emphasis>.
pt_br: O repositório do FreeBSD <literal>doc/www</literal> foi migrado do <acronym>CVS</acronym> para o Subversion em 19 de Maio de 2012. O primeiro commit real no <acronym>SVN</acronym> foi o <emphasis>r38821</emphasis>.

source: The FreeBSD <literal>ports</literal> repository switched from <acronym>CVS</acronym> to Subversion on July 14th, 2012. The first real <acronym>SVN</acronym> commit is <emphasis>r300894</emphasis>.
pt_br: O repositório da coleção de <literal>ports</literal> do FreeBSD foi migrado do <acronym>CVS</acronym> para o Subversion em 14 de Julho 2012. O primeiro commit real no <acronym>SVN</acronym> foi o <emphasis>r300894</emphasis>.
