Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: Do not include <literal>@FreeBSD.org</literal> when entering in your username.
pt_br: Não inclua <literal>@FreeBSD.org</literal> ao digitar seu nome de usuário.

source: Additional Notes
pt_br: Notas Adicionais

source: Will only accept mail from <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>. If you are authenticated as one user, you are not permitted to send mail from another.
pt_br: Aceitará apenas mensagens de <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>. Se você for autenticado como um usuário, não terá permissão para enviar e-mails como outro.

source: A header will be appended with the SASL username: (<literal>Authenticated sender: <replaceable>username</replaceable></literal>).
pt_br: Um cabeçalho será anexado com o nome de usuário do SASL: (<literal>Authenticated sender: <replaceable>username</replaceable></literal>).

source: Host has various rate limits in place to cut down on brute force attempts.
pt_br: O host possui vários limites de taxa para reduzir as tentativas de força bruta.

source: Using a Local MTA to Forward Emails to the FreeBSD.org SMTP Service
pt_br: Usando um MTA Local para Encaminhar Emails para o Serviço SMTP do FreeBSD.org

source: It is also possible to use a local <acronym>MTA</acronym> to forward locally sent emails to the FreeBSD.org SMTP servers.
pt_br: Também é possível usar um <acronym>MTA</acronym> local para encaminhar emails enviados localmente para os servidores SMTP do FreeBSD.org.

source: Using <application>Postfix</application>
pt_br: Usando o <application>Postfix</application>

source: To tell a local Postfix instance that anything from <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal> should be forwarded to the FreeBSD.org servers, add this to your <filename>main.cf</filename>:
pt_br: Para dizer a uma instância local do Postfix que qualquer email de <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal> deve ser encaminhado para os servidores do FreeBSD.org, adicione isto ao seu <filename>main.cf</filename>:

source: Create <filename>/usr/local/etc/postfix/relayhost_maps</filename> with the following content:
pt_br: Crie <filename>/usr/local/etc/postfix/relayhost_maps</filename> com o seguinte conteúdo:

source: Create <filename>/usr/local/etc/postfix/sasl_passwd</filename> with the following content:
pt_br: Crie <filename>/usr/local/etc/postfix/sasl_passwd</filename> com o seguinte conteúdo:

source: If the email server is used by other people, you may want to prevent them from sending e-mails from your address. To achieve this, add this to your <filename>main.cf</filename>:
pt_br: Se o servidor de email for usado por outras pessoas, talvez você queira impedir que elas enviem emails do seu endereço. Para configurar isso, adicione estas entradas ao seu <filename>main.cf</filename>:

source: Create <filename>/usr/local/etc/postfix/sender_login_maps</filename> with the following content:
pt_br: Crie <filename>/usr/local/etc/postfix/sender_login_maps</filename> com o seguinte conteúdo:

source: Where <replaceable>yourlocalusername</replaceable> is the <acronym>SASL</acronym> username used to connect to the local instance of <application>Postfix</application>.
pt_br: Onde <replaceable>yourlocalusername</replaceable> é o usuário <acronym>SASL</acronym> utilizado para conectar na instância local do <application>Postfix</application>.

source: Mentors
pt_br: Mentores

source: All new developers have a mentor assigned to them for the first few months. A mentor is responsible for teaching the mentee the rules and conventions of the project and guiding their first steps in the developer community. The mentor is also personally responsible for the mentee's actions during this initial period.
pt_br: Todos os novos desenvolvedores têm um mentor atribuído a eles nos primeiros meses. Um mentor é responsável por ensinar ao aprendiz as regras e convenções do projeto e orientar seus primeiros passos na comunidade de desenvolvedores. O mentor também é pessoalmente responsável pelas ações do aprendiz durante este período inicial.

source: For committers: do not commit anything without first getting mentor approval. Document that approval with an <literal>Approved by:</literal> line in the commit message.
pt_br: Para committers: não faça nenhum commit sem antes obter a aprovação do seu mentor. Documente essa aprovação com uma linha <literal>Approved by:</literal> na mensagem de commit.

source: When the mentor decides that a mentee has learned the ropes and is ready to commit on their own, the mentor announces it with a commit to <filename>conf/mentors</filename>. This file is in the <filename>svnadmin</filename> branch of each repository:
pt_br: Quando o mentor decide que um aprendiz já aprendeu o necessário e está pronto para fazer commits por conta própria, o mentor anuncia o fato com um commit no <filename>conf/mentors</filename>. Este arquivo está na branch <filename>svnadmin</filename> de cada repositório:

source: New committers should aim to complete enough commits that their mentor is comfortable releasing them from mentorship within the first year. If they are still under mentorship, the appropriate management body (core, doceng, or portmgr) should attempt to ensure that there are no barriers preventing completion. If the committer is unable to satisfy their mentor of readiness by a year and a half their commit bit may be converted to project membership.
pt_br: Os novos committers devem ter como objetivo realizar commits o suficiente para que seu mentor se sinta confortável em liberá-los da mentoria no primeiro ano. Se eles ainda estiverem sob orientação, o corpo gerencial apropriado (core, doceng ou portmgr) deve tentar garantir que não haja barreiras que impeçam a conclusão. Se o committer não for capaz de satisfazer seu mentor de prontidão por um ano e meio, seu commit bit pode ser convertido para membro do projeto.

source: Pre-Commit Review
pt_br: Revisão pré-commit

source: Code review is one way to increase the quality of software. The following guidelines apply to commits to the <literal>head</literal> (-CURRENT) branch of the <literal>src</literal> repository. Other branches and the <literal>ports</literal> and <literal>docs</literal> trees have their own review policies, but these guidelines generally apply to commits requiring review:
pt_br: A revisão de código é uma maneira de aumentar a qualidade do software. As seguintes diretrizes se aplicam a commits na ramificação <literal>head</literal> (-CURRENT) do repositório <literal>src</literal>. Outras ramificações e as árvores do <literal>ports</literal> e do <literal>docs</literal> têm suas próprias políticas de revisão, mas essas diretrizes geralmente se aplicam a commits que exigem revisão:

source: All non-trivial changes should be reviewed before they are committed to the repository.
pt_br: Todas as alterações não triviais devem ser revisadas antes de serem cometidas no repositório.

source: Reviews may be conducted by email, in <application>Bugzilla</application>, in <application>Phabricator</application>, or by another mechanism. Where possible, reviews should be public.
pt_br: As revisões podem ser conduzidas por e-mail, pelo <application>Bugzilla</application>, pelo <application>Phabricator</application> ou por outro mecanismo. Sempre que possível, as revisões devem ser públicas.

source: The developer responsible for a code change is also responsible for making all necessary review-related changes.
pt_br: O desenvolvedor responsável por uma mudança de código também é responsável por fazer todas as alterações necessárias relacionadas à revisão.

source: Code review can be an iterative process, which continues until the patch is ready to be committed. Specifically, once a patch is sent out for review, it should receive an explicit <quote>looks good</quote> before it is committed. So long as it is explicit, this can take whatever form makes sense for the review method.
pt_br: A revisão de código pode ser um processo iterativo, que continua até que o patch esteja pronto para o commit. Especificamente, uma vez que um patch é enviado para revisão, ele deve receber um explícito <quote>looks good</quote> antes que o commit possa ser feito. Desde que a aprovação seja explícita, ela pode ser formalizada de qualquer forma que faça sentido para o método de revisão.

source: Timeouts are not a substitute for review.
pt_br: Timeouts não são um substituto para revisão.

source: Sometimes code reviews will take longer than you would hope for, especially for larger features. Accepted ways to speed up review times for your patches are:
pt_br: Às vezes, as revisões de código demoram mais tempo do que você esperaria, especialmente para recursos maiores. As formas aceitas de acelerar os tempos de revisão dos seus patches são:

source: Review other people's patches. If you help out, everybody will be more willing to do the same for you; goodwill is our currency.
pt_br: Revise os patches de outras pessoas. Se você ajudar, todos estarão mais dispostos a fazer o mesmo por você; A boa vontade é a nossa moeda.

source: Ping the patch. If it is urgent, provide reasons why it is important to you to get this patch landed and ping it every couple of days. If it is not urgent, the common courtesy ping rate is one week. Remember that you are asking for valuable time from other professional developers.
pt_br: Ping o patch. Se for urgente, forneça as razões pelas quais é importante para você finalizá-lo e faça o ping a cada dois dias. Se não for urgente, a frequência adequada de ping é de uma vez por semana. Lembre-se de que você está pedindo um tempo valioso de outros desenvolvedores profissionais.

source: Ask for help on mailing lists, IRC, etc. Others may be able to either help you directly, or suggest a reviewer.
pt_br: Peça ajuda em listas de discussão, IRC, etc. Outros podem ajudá-lo diretamente ou sugerir um revisor.

source: Split your patch into multiple smaller patches that build on each other. The smaller your patch, the higher the probability that somebody will take a quick look at it.
pt_br: Dividir seu patch em vários patches pequenos os quais se aplicam uns sobre os outros. Quanto menor o seu patch, maior a probabilidade de alguém dar uma rápida olhada nele.

source: When making large changes, it is helpful to keep this in mind from the beginning of the effort as breaking large changes into smaller ones is often difficult after the fact.
pt_br: Ao fazer grandes mudanças, é útil ter isso em mente desde o início do esforço, pois quebrar grandes alterações em pequenas é geralmente difícil depois que estão prontas.

source: Developers should participate in code reviews as both reviewers and reviewees. If someone is kind enough to review your code, you should return the favor for someone else. Note that while anyone is welcome to review and give feedback on a patch, only an appropriate subject-matter expert can approve a change. This will usually be a committer who works with the code in question on a regular basis.
pt_br: Os desenvolvedores devem participar de revisões de código fazendo revisões e recebendo revisões. Se alguém tiver a gentileza de revisar seu código, você deve devolver o favor a outra pessoa. Observe que, embora qualquer pessoa seja bem-vinda para revisar e dar feedback sobre um patch, apenas um especialista no assunto apropriado pode aprovar uma alteração. Geralmente, este especialista será um committer que trabalha com o código em questão regularmente.

source: In some cases, no subject-matter expert may be available. In those cases, a review by an experienced developer is sufficient when coupled with appropriate testing.
pt_br: Em alguns casos, nenhum especialista no assunto pode estar disponível. Nesses casos, uma revisão por um desenvolvedor experiente é suficiente quando associada a testes apropriados.

source: Commit Log Messages
pt_br: Mensagens de Log de Commit

source: This section contains some suggestions and traditions for how commit logs are formatted.
pt_br: Esta seção contém algumas sugestões e tradições de como os logs de commit são formatados.

source: As well as including an informative message with each commit, some additional information may be needed.
pt_br: Além de incluir uma mensagem informativa com cada commit, algumas informações adicionais podem ser necessárias.

source: This information consists of one or more lines containing the key word or phrase, a colon, tabs for formatting, and then the additional information.
pt_br: Essas informações consistem em uma ou mais linhas contendo a palavra-chave ou frase, dois-pontos, guias para formatação e, em seguida, as informações adicionais.

source: The key words or phrases are:
pt_br: As palavras ou frases-chave são:

source: The problem report (if any) which is affected (typically, by being closed) by this commit. Multiple PRs may be specified on one line, separated by commas or spaces.
pt_br: O relatório do problema (se houver) que é afetado (normalmente, por estar fechado) por este commit. Vários PRs podem ser especificados em uma linha, separados por vírgulas ou espaços.

source: The name and e-mail address of the person that submitted the fix; for developers, just the username on the FreeBSD cluster.
pt_br: O nome e o endereço de e-mail da pessoa que enviou a correção; para desenvolvedores, apenas o nome de usuário no cluster do FreeBSD.

source: If the submitter is the maintainer of the port being committed, include "(maintainer)" after the email address.
pt_br: Se o requisitante for o mantenedor do port que está sendo atualizado pelo commit, inclua "(maintainer)" após o endereço de e-mail.

source: Avoid obfuscating the email address of the submitter as this adds additional work when searching logs.
pt_br: Evite ofuscar o endereço de e-mail do remetente, pois isso adiciona trabalho adicional ao pesquisar os registros.

source: The name and e-mail address of the person or people that reviewed the change; for developers, just the username on the FreeBSD cluster. If a patch was submitted to a mailing list for review, and the review was favorable, then just include the list name.
pt_br: O nome e o endereço de e-mail da pessoa ou pessoas que revisaram a alteração; para desenvolvedores, apenas o nome de usuário no cluster do FreeBSD. Se um patch foi submetido a uma lista de discussão para revisão e a revisão foi favorável, basta incluir o nome da lista.

source: The name and e-mail address of the person or people that approved the change; for developers, just the username on the FreeBSD cluster. It is customary to get prior approval for a commit if it is to an area of the tree to which you do not usually commit. In addition, during the run up to a new release all commits <emphasis>must</emphasis> be approved by the release engineering team.
pt_br: O nome e endereço de e-mail da pessoa ou pessoas que aprovaram a alteração; para desenvolvedores, apenas o nome de usuário no cluster do FreeBSD. É costume obter aprovação prévia para um commit se for para uma área da árvore na qual você normalmente não faz commit. Além disso, durante a preparação para uma nova versão, todos os commits <emphasis>devem</emphasis> ser aprovados pela equipe de engenharia de release.

source: While under mentorship, get mentor approval before the commit. Enter the mentor's username in this field, and note that they are a mentor:
pt_br: Enquanto estiver sob orientação, obtenha aprovação do mentor antes do commit. Digite o nome de usuário do mentor neste campo e adicione uma nota de que ele é um mentor:

source: If a team approved these commits then include the team name followed by the username of the approver in parentheses. For example:
pt_br: Se uma equipe aprovou esses commits, inclua o nome da equipe seguido do nome de usuário do aprovador entre parênteses. Por exemplo:

source: The name of the project (if any) from which the code was obtained. Do not use this line for the name of an individual person.
pt_br: O nome do projeto (se houver) do qual o código foi obtido. Não use esta linha para o nome de uma pessoa individual.

source: Sponsoring organizations for this change, if any. Separate multiple organizations with commas. If only a portion of the work was sponsored, or different amounts of sponsorship were provided to different authors, please give appropriate credit in parentheses after each sponsor name. For example, <literal>Example.com (alice, code refactoring), Wormulon (bob), Momcorp (cindy)</literal> shows that Alice was sponsored by Example.com to do code refactoring, while Wormulon sponsored Bob's work and Momcorp sponsored Cindy's work. Other authors were either not sponsored or chose not to list sponsorship.
pt_br: Organizações patrocinadoras dessa mudança, se houver. Separe várias organizações com vírgulas. Se apenas uma parte do trabalho foi patrocinada, ou diferentes montantes de patrocínio foram fornecidos a diferentes autores, por favor, forneça os devidos créditos entre parênteses após cada nome de patrocinador. Por exemplo, <literal>Example.com (alice, refatoração de código), Wormulon (bob), Momcorp (cindy)</literal> mostra que Alice foi patrocinada pela Example.com para refatoração de código, enquanto Wormulon patrocinou o trabalho de Bob e a Momcorp patrocinou o trabalho de Cindy. Outros autores não foram patrocinados ou optaram por não listar o patrocínio.

source: To receive an e-mail reminder to <acronym>MFC</acronym> at a later date, specify the number of days, weeks, or months after which an <acronym>MFC</acronym> is planned.
pt_br: Para receber um lembrete por e-mail para o <acronym>MFC</acronym> em uma data posterior, especifique o número de dias, semanas ou meses após os quais um <acronym>MFC</acronym> está planejado.

source: If the commit should be merged to a subset of stable branches, specify the branch names.
pt_br: Se o commit deve ser mesclado em um subconjunto de branches estáveis, especifique os nomes das branchs.

source: If the commit should be merged together with a previous one in a single <acronym>MFC</acronym> commit (for example, where this commit corrects a bug in the previous change), specify the corresponding revision number.
pt_br: Se o commit deve ser mesclado junto com um commit anterior em um único <acronym>MFC</acronym> (por exemplo, onde o commit corrige um bug da alteração anterior), especifique o número de revisão correspondente.

source: If the change is a candidate for inclusion in the release notes for the next release from the branch, set to <literal>yes</literal>.
pt_br: Se a alteração for candidata a inclusão nas notas de lançamento da próxima versão da branch, defina como <literal>yes</literal>.

source: If the change is related to a security vulnerability or security exposure, include one or more references or a description of the issue. If possible, include a VuXML URL or a CVE ID.
pt_br: Se a alteração estiver relacionada a uma vulnerabilidade de segurança ou exposição de segurança, inclua uma ou mais referências ou uma descrição do problema. Se possível, inclua um URL VuXML ou um ID CVE.

source: <literal>Event:</literal>
pt_br: <literal>Evento:</literal>

source: The description for the event where this commit was made. If this is a recurring event, add the year or even the month to it. For example, this could be <literal>FooBSDcon 2019</literal>. The idea behind this line is to put recognition to conferences, gatherings, and other types of meetups and to show that these are useful to have. Please do not use the <literal>Sponsored by:</literal> line for this as that is meant for organizations sponsoring certain features or developers working on them.
pt_br: Descrição para o evento em que essa confirmação foi feita. Se este for um evento recorrente, adicione o ano ou até mesmo o mês. Por exemplo, isso pode ser <literal> FooBSDcon 2019 </literal>. A idéia por trás dessa linha é dar reconhecimento a conferências, reuniões e outros tipos de reuniões e mostrar que elas são úteis. Por favor, não use a linha <literal> Patrocinado por: </literal> para isso, pois isso significa que as organizações patrocinam determinados recursos ou desenvolvedores que trabalham neles.

source: The full URL of the Phabricator review. This line <emphasis>must be the last line</emphasis>. For example: <literal>https://reviews.freebsd.org/D1708</literal>.
pt_br: A URL completa da revisão do Phabricator. Esta linha <emphasis> deve ser a última linha </emphasis>. Por exemplo: <literal>https://reviews.freebsd.org/D1708</literal>.

source: Commit Log for a Commit Based on a PR
pt_br: Commit Log para um commit baseado em um PR

source: The commit is based on a patch from a PR submitted by John Smith. The commit message <quote>PR</quote> and <quote>Submitted by</quote> fields are filled..
pt_br: O commit é baseado em um patch de um PR enviado por John Smith. Os campos da mensagem de commit <quote>PR</quote> e <quote>Submitted by</quote> são preenchidos.

source: Commit Log for a Commit Needing Review
pt_br: Commit log de um commit que precisa de revisão

source: The virtual memory system is being changed. After posting patches to the appropriate mailing list (in this case, <literal>freebsd-arch</literal>) and the changes have been approved.
pt_br: O sistema de memória virtual está sendo alterado. Depois de enviar os patches para a lista de discussão apropriada (neste caso, <literal>freebsd-arch</literal>) e as mudanças foram aprovadas.

source: Commit Log for a Commit Needing Approval
pt_br: Commit log de um commit que precisa de aprovação

source: Commit a port, after working with the listed MAINTAINER, who said to go ahead and commit.
pt_br: Commit um port, depois de trabalhar com o MAINTAINER, que disse para ir em frente e executar o commit.

source: Where <replaceable>abc</replaceable> is the account name of the person who approved.
pt_br: No qual o <replaceable>abc</replaceable> é o nome da conta da pessoa que aprovou.

source: Commit Log for a Commit Bringing in Code from OpenBSD
pt_br: Commit log de um commit que importa código do OpenBSD

source: Committing some code based on work done in the OpenBSD project.
pt_br: Efetuando o commit de códigos baseados no trabalho feito no projeto OpenBSD.

source: Commit Log for a Change to FreeBSD-CURRENT with a Planned Commit to FreeBSD-STABLE to Follow at a Later Date.
pt_br: Commit Log para uma mudança no FreeBSD-CURRENT com um commit planejado para o FreeBSD-STABLE para seguir em uma data posterior.

source: Committing some code which will be merged from FreeBSD-CURRENT into the FreeBSD-STABLE branch after two weeks.
pt_br: Efetuando o commit de códigos que serão mesclados do FreeBSD-CURRENT na branch do FreeBSD-STABLE após duas semanas.

source: Where <replaceable>2</replaceable> is the number of days, weeks, or months after which an <acronym>MFC</acronym> is planned. The <replaceable>weeks</replaceable> option may be <literal>day</literal>, <literal>days</literal>, <literal>week</literal>, <literal>weeks</literal>, <literal>month</literal>, <literal>months</literal>.
pt_br: Onde <replaceable>2</replaceable> é o número de dias, semanas ou meses após o qual um <acronym>MFC</acronym> é planejado. A opção <replaceable>weeks</replaceable> pode ser <literal>day</literal>, <literal>dias</literal>, <literal>semana</literal>, <literal>semanas</literal>, <literal>mês</literal>, <literal>meses</literal>.

source: It is often necessary to combine these.
pt_br: Muitas vezes é necessário combinar isso.
