Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: During the conversion from <acronym>CVS</acronym> to Subversion, vendor branches were imported with the same layout as the main tree. This means that the <literal>pf</literal> vendor sources ended up in <filename>vendor/pf/dist/contrib/pf</filename>. The vendor source is best directly in <filename>vendor/pf/dist</filename>.
pt_br: Durante a conversão do <acronym>CVS</acronym> para o Subversion, as branches do fornecedor foram importadas com o mesmo layout da árvore principal. Isso significa que as fontes do fornecedor <literal>pf</literal> foram armazenadas originalmente em <filename>vendor/pf/dist/contrib/pf</filename>. O código fonte do fornecedor fica melhor se armazenado diretamente em <filename>vendor/pf/dist</filename>.

source: To flatten the <literal>pf</literal> tree:
pt_br: Para achatar a árvore do <literal>pf</literal>:

source: The <literal>propdel</literal> bit is necessary because starting with 1.5, Subversion will automatically add <literal>svn:mergeinfo</literal> to any directory that is copied or moved. In this case, as nothing is being merged from the deleted tree, they just get in the way.
pt_br: O bit <literal>propdel</literal> é necessário porque, começando com 1.5, o Subversion adicionará <literal>svn:mergeinfo</literal> em qualquer diretório que seja copiado ou movido. Nesse caso, como nada está sendo mesclado da árvore excluída, eles apenas atrapalham.

source: Tags may be flattened as well (3, 4, 3.5 etc.); the procedure is exactly the same, only changing <literal>dist</literal> to <literal>3.5</literal> or similar, and putting the <command>svn commit</command> off until the end of the process.
pt_br: As tags também podem ser achatadas (3, 4, 3.5 etc.); o procedimento é exatamente o mesmo, mudando apenas <literal>dist</literal> para <literal>3.5</literal> ou similar, e aguardando para executar o <command>svn commit </command> apenas no final do processo.

source: Cleaning Up
pt_br: Limpando

source: The <literal>dist</literal> tree can be cleaned up as necessary. Disabling keyword expansion is recommended, as it makes no sense on unmodified vendor code and in some cases it can even be harmful. <application>OpenSSH</application>, for example, includes two files that originated with FreeBSD and still contain the original version tags. To do this:
pt_br: A árvore <literal>dist</literal> pode ser limpa conforme necessário. A desativação da expansão de palavras-chave é recomendada, pois não faz sentido no código do fornecedor não modificado e, em alguns casos, pode até mesmo ser prejudicial. O <application>OpenSSH</application>, por exemplo, inclui dois arquivos que se originaram do FreeBSD e ainda contêm as tags da versão original. Para fazer isso:

source: Bootstrapping Merge History
pt_br: Bootstrapping o historico de mesclagem

source: If importing for the first time after the switch to Subversion, bootstrap <literal>svn:mergeinfo</literal> on the target directory in the main tree to the revision that corresponds to the last related change to the vendor tree, prior to importing new sources:
pt_br: Se estiver importando pela primeira vez após a mudança para o Subversion, faça o bootstrap do <literal>svn:mergeinfo</literal> no diretório de destino da árvore principal para a revisão que corresponde à última alteração relacionada à árvore do fornecedor, antes de importar novos fontes:

source: Importing New Sources
pt_br: Importando Novas Fontes

source: With two commits—one for the import itself and one for the tag—this step can optionally be repeated for every upstream release between the last import and the current import.
pt_br: Com dois commits - um para a importação em si e outro para a tag - essa etapa pode ser opcionalmente repetida para cada release upstream entre a última importação e a importação atual.

source: Preparing the Vendor Sources
pt_br: Preparando os fontes do fornecedor

source: Subversion is able to store a full distribution in the vendor tree. So, import everything, but merge only what is required.
pt_br: O Subversion é capaz de armazenar uma distribuição completa na árvore do fornecedor. Portanto, importe tudo, mas mescle apenas o que é necessário.

source: A <command>svn add</command> is required to add any files that were added since the last vendor import, and <command>svn rm</command> is required to remove any that were removed since. Preparing sorted lists of the contents of the vendor tree and of the sources that are about to be imported is recommended, to facilitate the process.
pt_br: Um <command>svn add</command> é necessário para adicionar quaisquer arquivos que foram adicionados desde a última importação do fornecedor, e o <command>svn rm</command> é necessário para remover todos os que foram removidos desde então. Recomenda-se a preparação de listas ordenadas do conteúdo da árvore do fornecedor e das fontes que serão importadas, para facilitar o processo.

source: With these two files, <command>comm -23 ../old ../new</command> will list removed files (files only in <filename>old</filename>), while <command>comm -13 ../old ../new</command> will list added files only in <filename>new</filename>.
pt_br: Com esses dois arquivos, o <command>comm -23 ../old ../new</command> listará os arquivos removidos (arquivos somente em <filename>old</filename>), enquanto <command> comm -13 .. /old ../new</command> listará os arquivos adicionados somente no <filename>new</filename>.

source: Importing into the Vendor Tree
pt_br: Importando para a Árvore do Fornecedor

source: Now, the sources must be copied into <filename><replaceable>dist</replaceable></filename> and the <command>svn add</command> and <command>svn rm</command> commands are used as needed:
pt_br: Agora, os fontes devem ser copiados para <filename><replaceable>dist</replaceable></filename> e os comandos <command>svn add</command> e <command>svn rm</command> são usados conforme necessário:

source: If any directories were removed, they will have to be <command>svn rm</command>ed manually. Nothing will break if they are not, but they will remain in the tree.
pt_br: Se algum diretório foi removido, ele terá que ser removido manualmente com o <command>svn rm</command>. Nada vai quebrar se eles não forem, mas eles permanecerão na árvore.

source: Check properties on any new files. All text files should have <literal>svn:eol-style</literal> set to <literal>native</literal>. All binary files should have <literal>svn:mime-type</literal> set to <literal>application/octet-stream</literal> unless there is a more appropriate media type. Executable files should have <literal>svn:executable</literal> set to <literal>*</literal>. No other properties should exist on any file in the tree.
pt_br: Verifique as propriedades em qualquer novo arquivo. Todos os arquivos de texto devem ter o <literal>svn:eol-style</literal> definido como <literal>native</literal>. Todos os arquivos binários devem ter o <literal>svn:mime-type</literal> configurado para <literal>application/octet-stream </literal>, a menos que haja um tipo de mídia mais apropriado. Arquivos executáveis devem ter <literal>svn:executable</literal> definido como <literal>*</literal>. Nenhuma outra propriedade deve existir em qualquer arquivo da árvore.

source: Committing is now possible. However, it is good practice to make sure that everything is okay by using the <command>svn stat</command> and <command>svn diff</command> commands.
pt_br: Agora é possível fazer o commit. No entanto, é uma boa prática certificar-se de que tudo está correto, usando os comandos <command>svn stat</command> e <command>svn diff</command>.

source: Tagging
pt_br: Marcação (Tagging)

source: Once committed, vendor releases are tagged for future reference. The best and quickest way to do this is directly in the repository:
pt_br: Depois de realizado o commit, as versões do fornecedor são marcadas para referência futura. A melhor e mais rápida maneira de fazer isso é diretamente no repositório:

source: Once that is complete, <command>svn up</command> the working copy of <filename><replaceable>vendor/pf</replaceable></filename> to get the new tag, although this is rarely needed.
pt_br: Quando isso estiver concluído, execute o <command>svn up</command> para a cópia de trabalho do <filename><replaceable>vendor/pf</replaceable></filename> para obter a nova tag, embora isso raramente seja necessário.

source: If creating the tag in the working copy of the tree, <command>svn:mergeinfo</command> results must be removed:
pt_br: Se você criar a tag na cópia de trabalho da árvore, os resultados do <command>svn:mergeinfo</command> deverão ser removidos:

source: Merging to Head
pt_br: Mesclagem para o Head

source: The <literal>--accept=postpone</literal> tells Subversion not to complain about merge conflicts as they will be handled manually.
pt_br: O <literal>--accept=postpone</literal> diz ao Subversion para não reclamar sobre conflitos de mesclagem, pois eles serão manipulados manualmente.

source: The <command>cvs2svn</command> changeover occurred on June 3, 2008. When performing vendor merges for packages which were already present and converted by the <command>cvs2svn</command> process, the command used to merge <filename>/vendor/<replaceable>package_name</replaceable>/dist</filename> to <filename>/head/<replaceable>package_location</replaceable></filename> (for example, <filename>head/contrib/sendmail</filename>) must use <option>-c <replaceable>REV</replaceable></option> to indicate the revision to merge from the <filename>/vendor</filename> tree. For example:
pt_br: A mudança do <command>cvs2svn</command> ocorreu em 3 de junho de 2008. Ao realizar mesclagens de fornecedores para pacotes que já estavam presentes e convertidos pelo processo <command>cvs2svn</command>, o comando usado para mesclar <filename>/vendor/<replaceable>package_name</replaceable>/dist</filename> para <filename>/head/<replaceable>package_location</replaceable></filename> (por exemplo, <filename>head/contrib/sendmail</filename>) deve usar <option>-c <replaceable>REV</replaceable></option> para indicar a revisão a ser mesclada a partir da árvore <filename>/vendor</filename>. Por exemplo:

source: <literal>^</literal> is an alias for the repository path.
pt_br: <literal>^</literal> é um alias para o caminho do repositório.

source: If using the <application>Zsh</application> shell, the <literal>^</literal> must be escaped with <literal>\</literal> or quoted.
pt_br: Se estiver usando o shell <application>Zsh</application>, o <literal>^</literal> deve ser escapado com <literal>\</literal> ou entre aspas.

source: It is necessary to resolve any merge conflicts.
pt_br: É necessário resolver quaisquer conflitos de mesclagem.

source: Make sure that any files that were added or removed in the vendor tree have been properly added or removed in the main tree. To check diffs against the vendor branch:
pt_br: Certifique-se de que todos os arquivos adicionados ou removidos na árvore do fornecedor tenham sido adicionados ou removidos corretamente na árvore principal. Para verificar os diffs com relação ao branch do fornecedor:

source: The <literal>--no-diff-deleted</literal> tells Subversion not to complain about files that are in the vendor tree but not in the main tree. Things that would have previously been removed before the vendor import, like the vendor's makefiles and configure scripts.
pt_br: O <literal>--no-diff-deleted</literal> diz ao Subversion para não reclamar sobre os arquivos que estão na árvore do fornecedor, mas que não estão na árvore principal. Coisas que teriam sido removidas antes da importação do fornecedor, como os makefiles do fornecedor e os scripts de configuração.

source: Using <acronym>CVS</acronym>, once a file was off the vendor branch, it was not able to be put back. With Subversion, there is no concept of on or off the vendor branch. If a file that previously had local modifications, to make it not show up in diffs in the vendor tree, all that has to be done is remove any left-over cruft like FreeBSD version tags, which is much easier.
pt_br: Usando o <acronym>CVS</acronym>, uma vez que um arquivo estava fora do branch do fornecedor, ele não podia ser colocado de volta. Com o Subversion, não há nenhum conceito dentro ou fora do branch do fornecedor. Se um arquivo que anteriormente tinha modificações locais, para fazer com que ele não apareça em diffs na árvore do fornecedor, tudo o que tem que ser feito é remover qualquer sobra como as tags de versões do FreeBSD, o que é muito mais fácil.

source: If any changes are required for the world to build with the new sources, make them now, and keep testing until everything builds and runs perfectly.
pt_br: Se alguma mudança for necessária para o "world" compilar com os novos fontes, faça-as agora e continue testando até que tudo seja compilado e executado perfeitamente.

source: Committing the Vendor Import
pt_br: Fazendo o commit da Importação de Fornecedores

source: Committing is now possible! Everything must be committed in one go. If done properly, the tree will move from a consistent state with old code, to a consistent state with new code.
pt_br: Agora é possível fazer o commit! O commit deve ser feito de tudo de uma só vez. Se feito corretamente, a árvore passará de um estado consistente com o código antigo para um estado consistente com o novo código.

source: From Scratch
pt_br: A partir do zero

source: This section is an example of importing and tagging <application>byacc</application> into <filename>head</filename>.
pt_br: Esta seção é um exemplo de importação e marcação do <application>byacc</application> no <filename>head</filename>.

source: First, prepare the directory in <filename>vendor</filename>:
pt_br: Primeiro, prepare o diretório em <filename>vendor</filename>:

source: Now, import the sources into the <filename>dist</filename> directory. Once the files are in place, <command>svn add</command> the new ones, then <command>svn commit</command> and tag the imported version. To save time and bandwidth, direct remote committing and tagging is possible:
pt_br: Agora, importe os fontes para o diretório <filename>dist</filename>. Uma vez que os arquivos estiverem no lugar, faça o <command>svn add</command> dos novos, e então faça o <command>svn commit</command> e aplique a tag na versão importada. Para poupar tempo e largura de banda, é possível efetuar diretamente o commit e as marcações de forma remota:

source: Merging to <literal>head</literal>
pt_br: Mesclando para o <literal>head</literal>

source: Due to this being a new file, copy it for the merge:
pt_br: Devido a este ser um novo arquivo, copie-o para a mesclagem:

source: Working normally on newly imported sources is still possible.
pt_br: Ainda é possível trabalhar normalmente nos fontes recém importados.

source: Reverting a Commit
pt_br: Revertendo um Commit

source: Reverting a commit to a previous version is fairly easy:
pt_br: A reversão de um commit para uma versão anterior é bem fácil:

source: Change number syntax, with negative meaning a reverse change, can also be used:
pt_br: Alterar a sintaxe do número, com o negativo significando a reversão de uma mudança, também pode ser usado:

source: This can also be done directly in the repository:
pt_br: Isso também pode ser feito diretamente no repositório:

source: It is important to ensure that the mergeinfo is correct when reverting a file to permit <command>svn mergeinfo --eligible</command> to work as expected.
pt_br: É importante assegurar que o mergeinfo esteja correto ao reverter um arquivo para permitir que o <command>svn mergeinfo --eligible</command> funcione como esperado.

source: Reverting the deletion of a file is slightly different. Copying the version of the file that predates the deletion is required. For example, to restore a file that was deleted in revision N, restore version N-1:
pt_br: A reversão da exclusão de um arquivo é um pouco diferente. É necessário copiar a versão do arquivo que antecede a exclusão. Por exemplo, para restaurar um arquivo que foi excluído na revisão N, restaure a versão N-1:

source: or, equally:
pt_br: ou, igualmente:

source: Do <emphasis>not</emphasis> simply recreate the file manually and <command>svn add</command> it—this will cause history to be lost.
pt_br: Simplesmente <emphasis>não</emphasis> recrie o arquivo manualmente e o adicione com o <command>svn add</command> - isso fará com que o histórico seja perdido.

source: Fixing Mistakes
pt_br: Corrigindo Erros

source: While we can do surgery in an emergency, do not plan on having mistakes fixed behind the scenes. Plan on mistakes remaining in the logs forever. Be sure to check the output of <command>svn status</command> and <command>svn diff</command> before committing.
pt_br: Por mais que possamos realizar uma cirurgia em uma emergência, não planeje ou corrija erros por baixo dos panos. Planos para erros permanecem nos registros para sempre. Certifique-se de verificar a saída do <command>svn status</command> e do <command>svn diff</command> antes de enviar o commit.

source: Mistakes will happen but, they can generally be fixed without disruption.
pt_br: Erros acontecerão, mas eles geralmente podem ser corrigidos sem perturbar.

source: Take a case of adding a file in the wrong location. The right thing to do is to <command>svn move</command> the file to the correct location and commit. This causes just a couple of lines of metadata in the repository journal, and the logs are all linked up correctly.
pt_br: No caso de adicionar um arquivo no local errado. A coisa certa a fazer é usar o <command>svn move</command> e mover o arquivo para o local correto e fazer o commit. Isso altera apenas algumas linhas de metadados no journal do repositório, e os logs serão todos conectados corretamente.

source: The wrong thing to do is to delete the file and then <command>svn add</command> an independent copy in the correct location. Instead of a couple of lines of text, the repository journal grows an entire new copy of the file. This is a waste.
pt_br: A coisa errada a fazer é apagar o arquivo e, em seguida, usar <command>svn add</command> para adicionar uma cópia independente no local correto. Em vez de algumas linhas de texto, o repositório journal cria uma nova cópia inteira do arquivo. Isso é um desperdício.

source: Using a Subversion Mirror
pt_br: Usando um Espelho do Subversion

source: There is a serious disadvantage to this method: every time something is to be committed, a <command>svn relocate</command> to the main repository has to be done, remembering to <command>svn relocate</command> back to the mirror after the commit. Also, since <command>svn relocate</command> only works between repositories that have the same UUID, some hacking of the local repository's UUID has to occur before it is possible to start using it.
pt_br: Há uma séria desvantagem neste método: toda vez que for feito o commit de algo, terá que executar um <command>svn relocate</command> no repositório principal, não esquecendo de executar o <command>svn relocate</command> de volta para o mirror após o commit. Além disso, como o <command>svn relocate</command> só funciona entre os repositórios que possuem o mesmo UUID, algum hacking do UUID do repositório local deve ocorrer antes que seja possível começar a usá-lo.

source: Checkout from a Mirror
pt_br: Checkout a partir de um Mirror

source: Check out a working copy from a mirror by substituting the mirror's <acronym>URL</acronym> for <literal>svn+ssh://repo.freebsd.org/base</literal>. This can be an official mirror or a mirror maintained by using <command>svnsync</command>.
pt_br: Faça o checkout de uma cópia de trabalho a partir de um mirror substituindo a <acronym>URL</acronym> do mirror por <literal>svn+ssh://repo.freebsd.org/base</literal>. Este pode ser um mirror oficial ou um mirror mantido usando o <command>svnsync</command>.

source: Setting up a <application>svnsync</application> Mirror
pt_br: Configurando um Mirror <application>svnsync</application>

source: Avoid setting up a <application>svnsync</application> mirror unless there is a very good reason for it. Most of the time a <command>git</command> mirror is a better alternative. Starting a fresh mirror from scratch takes a long time. Expect a minimum of 10 hours for high speed connectivity. If international links are involved, expect this to take four to ten times longer.
pt_br: Evite configurar um mirror <application>svnsync</application> a menos que haja uma boa razão para isso. Na maioria das vezes, um mirror <command>git</command> é uma alternativa melhor. Começar um novo mirror do zero leva muito tempo. Espere um mínimo de 10 horas para conectividade de alta velocidade. Se o trafego for passar por links internacionais, espere que isso leve de quatro a dez vezes mais.

source: One way to limit the time required is to grab a <link xlink:href="https://download.freebsd.org/ftp/development/subversion/">seed file</link>. It is large (~1GB) but will consume less network traffic and take less time to fetch than svnsync will.
pt_br: Uma maneira de limitar o tempo necessário é pegar um arquivo de <link xlink:href="https://download.freebsd.org/ftp/development/subversion/">seed</link>. Ele é grande (~1GB), mas consome menos tráfego de rede e leva menos tempo para baixar do que o svnsync.

source: Extract the file and update it:
pt_br: Extraia o arquivo e o atualize:

source: Now, set that up to run from <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, do checkouts locally, set up a svnserve server for local machines to talk to, etc.
pt_br: Agora, configure isso para executar a partir do <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, faça checkouts localmente, configure um servidor svnserve para as máquinas locais com as quais conversar, etc.

source: The seed mirror is set to fetch from <literal>svn://svn.freebsd.org/base</literal>. The configuration for the mirror is stored in <literal>revprop 0</literal> on the local mirror. To see the configuration, try:
pt_br: O mirror seed está definido para buscar o conteúdo a partir de <literal>svn://svn.freebsd.org/base</literal>. A configuração para o mirror é armazenada em <literal>revprop 0</literal> no mirror local. Para ver a configuração, tente:

source: Use <literal>svn propset</literal> to change things.
pt_br: Use <literal>svn propset</literal> para mudar as coisas.

source: Committing High-<acronym>ASCII</acronym> Data
pt_br: Fazendo commit de dados High<acronym>ASCII</acronym>

source: Files that have high-<acronym>ASCII</acronym> bits are considered binary files in <acronym>SVN</acronym>, so the pre-commit checks fail and indicate that the <literal>mime-type</literal> property should be set to <literal>application/octet-stream</literal>. However, the use of this is discouraged, so please do not set it. The best way is always avoiding high-<acronym>ASCII</acronym> data, so that it can be read everywhere with any text editor but if it is not avoidable, instead of changing the mime-type, set the <literal>fbsd:notbinary</literal> property with <literal>propset</literal>:
pt_br: Os arquivos que possuem bits high-<acronym>ASCII</acronym> são considerados arquivos binários no <acronym>SVN</acronym>, portanto, as verificações de pré-commit falham e indicam que a propriedade <literal>mime-type</literal> deve ser definida como <literal>application/octet-stream</literal>. No entanto, o uso deste é desencorajado, por isso, não o defina. A melhor maneira é sempre evitar dados high-<acronym>ASCII</acronym>, para que possam ser lidos em qualquer lugar com qualquer editor de texto, mas se não for possivel evitar, em vez de alterar o mime-type, defina a propriedade <literal>fbsd:notbinary</literal> com o <literal>propset</literal>:
