Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: Support for a hardware platform consists of two components: kernel support and userland Application Binary Interfaces (ABIs). Kernel platform support includes things needed to run a FreeBSD kernel on a hardware platform such as machine-dependent virtual memory management and device drivers. A userland ABI specifies an interface for user processes to interact with a FreeBSD kernel and base system libraries. A userland ABI includes system call interfaces, the layout and semantics of public data structures, and the layout and semantics of arguments passed to subroutines. Some components of an ABI may be defined by specifications such as the layout of C++ exception objects or calling conventions for C functions.
pt_br: O suporte para uma plataforma de hardware consiste em dois componentes: suporte ao kernel e interfaces binárias de aplicativos (ABIs) do usuário. O suporte do kernel à plataforma inclui os itens necessários para executar um kernel do FreeBSD em uma plataforma de hardware, como gerenciamento de memória virtual dependente de máquina e drivers de dispositivo. Uma ABI especifica uma interface para os processos do usuário interagirem com o kernel do FreeBSD e as bibliotecas do sistema base. Uma ABI inclui interfaces de chamada do sistema, o layout e a semântica de estruturas de dados públicos e o layout e a semântica de argumentos transmitidos às sub-rotinas. Alguns componentes de uma ABI podem ser definidos por especificações tais como o layout dos objetos de exceção C ++ ou as convenções de chamada para funções C.

source: A FreeBSD kernel also uses an ABI (sometimes referred to as the Kernel Binary Interface (KBI)) which includes the semantics and layouts of public data structures and the layout and semantics of arguments to public functions within the kernel itself.
pt_br: Um kernel do FreeBSD também usa uma ABI (às vezes chamada de Interface Binária do Kernel (KBI)) que inclui a semântica e layouts de estruturas de dados públicos e o layout e semântica de argumentos para funções públicas dentro do próprio kernel.

source: A FreeBSD kernel may support multiple userland ABIs. For example, FreeBSD's amd64 kernel supports FreeBSD amd64 and i386 userland ABIs as well as Linux x86_64 and i386 userland ABIs. A FreeBSD kernel should support a <quote>native</quote> ABI as the default ABI. The native <quote>ABI</quote> generally shares certain properties with the kernel ABI such as the C calling convention, sizes of basic types, etc.
pt_br: Um kernel do FreeBSD pode suportar múltiplas ABIs de usuário. Por exemplo, o kernel amd64 do FreeBSD suporta as ABIs de usuário do FreeBSD amd64 e i386, bem como as ABIs de usuário do Linux x86_64 e i386. Um kernel do FreeBSD deve suportar uma ABI <quote>nativa</quote> como a ABI padrão. A <quote>ABI</quote> nativa geralmente compartilha certas propriedades com a ABI do kernel, como a convenção de chamada C, tamanhos dos tipos básicos, etc.

source: Tiers are defined for both kernels and userland ABIs. In the common case, a platform's kernel and FreeBSD ABIs are assigned to the same tier.
pt_br: Os Tiers são definidos tanto para os kernels quanto para as ABIs do usuário. Normalmente, o kernel de uma plataforma e as ABIs do FreeBSD são atribuídas à mesma Tier.

source: Tier 1: Fully-Supported Architectures
pt_br: Tier 1: Arquiteturas Completamente Suportadas

source: Tier 1 platforms are the most mature FreeBSD platforms. They are supported by the security officer, release engineering, and port management teams. Tier 1 architectures are expected to be Production Quality with respect to all aspects of the FreeBSD operating system, including installation and development environments.
pt_br: As plataformas Tier 1 são as plataformas mais maduras do FreeBSD. Elas são suportadas pelas equipes de segurança, engenharia de release e gerenciamento de ports. Espera-se que as arquiteturas Tier 1 estejam com Qualidade de Produção em relação a todos os aspectos do sistema operacional FreeBSD, incluindo ambientes de instalação e desenvolvimento.

source: The FreeBSD Project provides the following guarantees to consumers of Tier 1 platforms:
pt_br: O Projeto FreeBSD fornece as seguintes garantias aos consumidores das plataformas de Tier 1:

source: Official FreeBSD release images will be provided by the release engineering team.
pt_br: Imagens oficiais de Release do FreeBSD serão fornecidas pela equipe de engenharia de release.

source: Binary updates and source patches for Security Advisories and Errata Notices will be provided for supported releases.
pt_br: Serão fornecidas atualizações binárias e patches no formato de código fonte para os Avisos de Segurança e Avisos de Erro das versões suportadas.

source: Source patches for Security Advisories will be provided for supported branches.
pt_br: Serão fornecidos patches de código fonte para os avisos de segurança das branches suportadas.

source: Binary updates and source patches for cross-platform Security Advisories will typically be provided at the time of the announcement.
pt_br: Atualizações binárias e patches de código fonte geralmente são fornecidos para os avisos de segurança multiplataforma no momento do anúncio.

source: Changes to userland ABIs will generally include compatibility shims to ensure correct operation of binaries compiled against any stable branch where the platform is Tier 1. These shims might not be enabled in the default install. If compatibility shims are not provided for an ABI change, the lack of shims will be clearly documented in the release notes.
pt_br: As alterações nas ABIs do usuário geralmente incluirão bibliotecas de compatibilidade para garantir a operação correta dos binários compilados a partir de qualquer branch estável de uma plataforma Tier 1. Estas bibliotecas podem não ser ativadas na instalação padrão. Se as bibliotecas de compatibilidade não forem fornecidas para uma alteração de ABI, a falta da mesma estará claramente documentada nas notas de versão.

source: Changes to certain portions of the kernel ABI will include compatibility shims to ensure correct operation of kernel modules compiled against the oldest supported release on the branch. Note that not all parts of the kernel ABI are protected.
pt_br: Alterações em certas partes da ABI do kernel incluirão bibliotecas de compatibilidade para garantir a operação correta dos módulos do kernel compilados contra a versão suportada mais antiga da branch. Observe que nem todas as partes da ABI do kernel estão protegidas.

source: Official binary packages for third party software will be provided by the ports team. For embedded architectures, these packages may be cross-built from a different architecture.
pt_br: Pacotes binários oficiais para softwares de terceiros serão fornecidos pela equipe de ports. Para arquiteturas embarcadas, esses pacotes podem ser compilados de forma cruzada a partir de uma arquitetura diferente.

source: Most relevant ports should either build or have the appropriate filters to prevent inappropriate ones from building.
pt_br: Os ports mais relevantes devem ou compilar ou ter filtros apropriados para prevenir a compilação dos inadequados.

source: New features which are not inherently platform-specific will be fully functional on all Tier 1 architectures.
pt_br: Novos recursos que não são inerentemente específicos da plataforma serão totalmente funcionais em todas as arquiteturas de Tier 1.

source: Features and compatibility shims used by binaries compiled against older stable branches may be removed in newer major versions. Such removals will be clearly documented in the release notes.
pt_br: Os recursos e bibliotecas de compatibilidade usados pelos binários compilados a partir das branchs estáveis mais antigas podem ser removidos nas versões principais mais recentes. Essas remoções serão claramente documentadas nas notas de versão.

source: Tier 1 platforms should be fully documented. Basic operations will be documented in the FreeBSD Handbook.
pt_br: As plataformas Tier 1 devem ser totalmente documentadas. As operações básicas serão documentadas no Handbook do FreeBSD.

source: Tier 1 platforms will be included in the source tree.
pt_br: As plataformas de Tier 1 serão incluídas na árvore de código fonte.

source: Tier 1 platforms should be self-hosting either via the in-tree toolchain or an external toolchain. If an external toolchain is required, official binary packages for an external toolchain will be provided.
pt_br: As plataformas de Tier 1 devem ser auto-hospedadas ou por meio de um toolchain disponível na árvore de código fonte ou por meio de um toolchain externo. Se um toolchain externo for necessário, serão fornecidos pacotes binários oficiais para o toolchain externo.

source: To maintain maturity of Tier 1 platforms, the FreeBSD Project will maintain the following resources to support development:
pt_br: Para manter a maturidade das plataformas de Tier 1, o Projeto FreeBSD manterá os seguintes recursos para apoiar o desenvolvimento:

source: Build and test automation support either in the FreeBSD.org cluster or some other location easily available for all developers. Embedded platforms may substitute an emulator available in the FreeBSD.org cluster for actual hardware.
pt_br: Suporte à automação do processo de compilação e de testes no cluster FreeBSD.org ou em algum outro local facilmente disponível para todos os desenvolvedores. Plataformas embarcadas podem substituir um emulador disponível no cluster FreeBSD.org por hardware real.

source: Inclusion in the <userinput>make universe</userinput> and <userinput>make tinderbox</userinput> targets.
pt_br: A inclusão nos targets do <userinput>make universe</userinput> e <userinput>make tinderbox</userinput>.

source: Dedicated hardware in one of the FreeBSD clusters for package building (either natively or via qemu-user).
pt_br: Hardware dedicado em um dos clusters do FreeBSD para compilação de pacotes (nativamente ou via qemu-user).

source: Collectively, developers are required to provide the following to maintain the Tier 1 status of a platform:
pt_br: Coletivamente, os desenvolvedores devem fornecer o seguinte para manter o status de Tier 1 de uma plataforma:

source: Changes to the source tree should not knowingly break the build of a Tier 1 platform.
pt_br: Alterações na árvore de código fonte não devem quebrar conscientemente a compilação de uma plataforma de Tier 1.

source: Tier 1 architectures must have a mature, healthy ecosystem of users and active developers.
pt_br: As arquiteturas de Tier 1 devem ter um ecossistema maduro e saudável de usuários e desenvolvedores ativos.

source: Developers should be able to build packages on commonly available, non-embedded Tier 1 systems. This can mean either native builds if non-embedded systems are commonly available for the platform in question, or it can mean cross-builds hosted on some other Tier 1 architecture.
pt_br: Os desenvolvedores devem ser capazes de compilar pacotes em sistemas Tier 1 não-embarcados comumente disponíveis. Isso pode significar compilações nativas se sistemas não-embarcados estiverem normalmente disponíveis para a plataforma em questão, ou significar compilações cruzadas hospedadas em alguma outra arquitetura de Tier 1.

source: Changes cannot break the userland ABI. If an ABI change is required, ABI compatibility for existing binaries should be provided via use of symbol versioning or shared library version bumps.
pt_br: As alterações não podem quebrar a ABI do usuário. Se for necessária uma alteração da ABI, a compatibilidade da ABI com os binários existentes deve ser provida através do versionamento de símbolos ou do versionamento de bibliotecas compartilhadas.

source: Changes merged to stable branches cannot break the protected portions of the kernel ABI. If a kernel ABI change is required, the change should be modified to preserve functionality of existing kernel modules.
pt_br: Alterações mescladas em branchs estáveis não podem quebrar as partes protegidas da ABI do kernel. Se for necessária uma alteração da ABI do kernel, ela deverá ser modificada para preservar a funcionalidade dos módulos existentes do kernel.

source: Tier 2: Developmental and Niche Architectures
pt_br: Tier 2: Arquiteturas de Desenvolvimento e Nicho

source: Tier 2 platforms are functional, but less mature FreeBSD platforms. They are not supported by the security officer, release engineering, and port management teams.
pt_br: As plataformas de Tier 2 são funcionais, mas são plataformas FreeBSD menos maduras. Elas não são suportadas pelas equipes de segurança, engenharia de release e gerenciamento de ports.

source: Tier 2 platforms may be Tier 1 platform candidates that are still under active development. Architectures reaching end of life may also be moved from Tier 1 status to Tier 2 status as the availability of resources to continue to maintain the system in a Production Quality state diminishes. Well-supported niche architectures may also be Tier 2.
pt_br: As plataformas Tier 2 podem ser candidatas à plataforma Tier 1 que ainda estão em desenvolvimento ativo. As arquiteturas que atingem o fim da vida útil também podem ser movidas do status de Tier 1 para o status de Tier 2 à medida que a disponibilidade de recursos para continuar a manter o sistema em um estado de Qualidade de Produção diminui. Arquiteturas de nicho bem suportadas também podem ser de Tier 2.

source: The FreeBSD Project provides the following guarantees to consumers of Tier 2 platforms:
pt_br: O Projeto FreeBSD fornece as seguintes garantias aos consumidores das plataformas de Tier 2:

source: The ports infrastructure should include basic support for Tier 2 architectures sufficient to support building ports and packages. This includes support for basic packages such as ports-mgmt/pkg, but there is no guarantee that arbitrary ports will be buildable or functional.
pt_br: A infraestrutura de ports deve incluir suporte básico para as arquiteturas de Tier 2 suficiente para suportar a compilação de ports e pacotes. Isso inclui suporte para pacotes básicos, tais como o ports-mgmt/pkg, mas não há garantia de que ports arbitrários serão compiláveis ou funcionais.

source: New features which are not inherently platform-specific should be feasible on all Tier 2 architectures if not implemented.
pt_br: Novos recursos que não são inerentemente específicos da plataforma devem ser viáveis em todas as arquiteturas de Tier 2 se não implementados.

source: Tier 2 platforms will be included in the source tree.
pt_br: As plataformas de Tier 2 serão incluídas na árvore de código fonte.

source: Tier 2 platforms should be self-hosting either via the in-tree toolchain or an external toolchain. If an external toolchain is required, official binary packages for an external toolchain will be provided.
pt_br: As plataformas de Tier 2 devem ser auto-hospedadas ou por meio de um toolchain disponível na árvore de código fonte ou por meio de um toolchain externo. Se um toolchain externo for necessário, serão fornecidos pacotes binários oficiais para o toolchain externo.

source: Tier 2 platforms should provide functional kernels and userlands even if an official release distribution is not provided.
pt_br: As plataformas de Tier 2 devem fornecer kernels e espaço de usuário funcionais, mesmo que uma release oficial não seja provida.

source: To maintain maturity of Tier 2 platforms, the FreeBSD Project will maintain the following resources to support development:
pt_br: Para manter a maturidade das plataformas de Tier 2, o Projeto FreeBSD manterá os seguintes recursos para apoiar o desenvolvimento:

source: Collectively, developers are required to provide the following to maintain the Tier 2 status of a platform:
pt_br: Coletivamente, os desenvolvedores devem fornecer o seguinte para manter o status de Tier 2 de uma plataforma:

source: Changes to the source tree should not knowingly break the build of a Tier 2 platform.
pt_br: Alterações na árvore de código fonte não devem quebrar conscientemente a compilação de uma plataforma de Tier 2.

source: Tier 2 architectures must have an active ecosystem of users and developers.
pt_br: As arquiteturas de Tier 2 devem ter um ecossistema ativo de usuários e desenvolvedores.

source: While changes are permitted to break the userland ABI, the ABI should not be broken gratuitously. Significant userland ABI changes should be restricted to major versions.
pt_br: Embora sejam permitidas alterações que quebrem a ABI do usuário, a ABI não deve ser quebrada gratuitamente. Alterações significativas da ABI do usuário devem ser restritas às versões principais.

source: New features that are not yet implemented on Tier 2 architectures should provide a means of disabling them on those architectures.
pt_br: Novos recursos que ainda não foram implementados nas arquiteturas de Tier 2 devem fornecer um meio de desativá-los nessas arquiteturas.

source: Tier 3: Experimental Architectures
pt_br: Tier 3: Arquiteturas Experimentais

source: Tier 3 platforms have at least partial FreeBSD support. They are <emphasis>not</emphasis> supported by the security officer, release engineering, and port management teams.
pt_br: As plataformas de Tier 3 têm pelo menos suporte parcial ao FreeBSD. Elas <emphasis>não</emphasis> são suportadas pelas equipes de segurança, engenharia de release e de gerenciamento de ports.

source: Tier 3 platforms are architectures in the early stages of development, for non-mainstream hardware platforms, or which are considered legacy systems unlikely to see broad future use. Initial support for Tier 3 platforms may exist in a separate repository rather than the main source repository.
pt_br: As plataformas de Tier 3 são arquiteturas nos estágios iniciais de desenvolvimento, para plataformas de hardware não convencionais, ou que são considerados sistemas legados improváveis de serem amplamente utilizados no futuro. O suporte inicial para plataformas de Tier 3 pode existir em um repositório separado em vez do repositório de código fonte principal.

source: The FreeBSD Project provides no guarantees to consumers of Tier 3 platforms and is not committed to maintaining resources to support development. Tier 3 platforms may not always be buildable, nor are any kernel or userland ABIs considered stable.
pt_br: O Projeto FreeBSD não oferece garantias aos consumidores das plataformas de Tier 3 e não está comprometido em manter recursos para apoiar o seu desenvolvimento. As plataformas de Tier 3 nem sempre podem ser compiláveis, nem quaisquer ABIs do kernel ou de usuário são consideradas estáveis.

source: Tier 4: Unsupported Architectures
pt_br: Tier 4: Arquiteturas Não Suportadas

source: Tier 4 platforms are not supported in any form by the project.
pt_br: As plataformas Tier 4 não são suportadas de nenhuma forma pelo projeto.

source: All systems not otherwise classified are Tier 4 systems. When a platform transitions to Tier 4, all support for the platform is removed from the source and ports trees. Note that ports support should remain as long as the platform is supported in a branch supported by ports.
pt_br: Todos os sistemas não classificados de outra forma são sistemas de Tier 4. Quando uma plataforma faz a transição para o Tier 4, todo o suporte para a plataforma é removido das árvores de código fonte e de ports. Observe que o suporte aos ports deve ser mantido enquanto a plataforma for suportada em uma branch suportada pelo ports.

source: Policy on Changing the Tier of an Architecture
pt_br: Política para Alteração do Tier de uma Arquitetura

source: Systems may only be moved from one tier to another by approval of the FreeBSD Core Team, which shall make that decision in collaboration with the Security Officer, Release Engineering, and ports management teams. For a platform to be promoted to a higher tier, any missing support guarantees must be satisfied before the promotion is completed.
pt_br: Os sistemas só podem ser movidos de um Tier para outro por meio da aprovação do Core Team do FreeBSD, que deve tomar essa decisão em colaboração com as equipes de segurança, engenharia de release e gerenciamento dos ports. Para que uma plataforma seja promovida para um Tier superior, todas as garantias de suporte ausentes devem ser atendidas antes que a promoção seja concluída.

source: Ports Specific FAQ
pt_br: FAQ específico dos Ports

source: Adding a New Port
pt_br: Adicionando um Novo Port

source: How do I add a new port?
pt_br: Como eu adiciono um novo port?

source: First, please read the section about repository copies.
pt_br: Primeiro, por favor leia a seção sobre cópias do repositório.

source: The easiest way to add a new port is the <command>addport</command> script located in the <filename>ports/Tools/scripts</filename> directory. It adds a port from the directory specified, determining the category automatically from the port <filename>Makefile</filename>. It also adds an entry to the port's category <filename>Makefile</filename>. It was written by Michael Haro <email>mharo@FreeBSD.org</email>, Will Andrews <email>will@FreeBSD.org</email>, and Renato Botelho <email>garga@FreeBSD.org</email>. When sending questions about this script to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link>, please also CC Chris Rees <email>crees@FreeBSD.org</email>, the current maintainer.
pt_br: A maneira mais fácil de adicionar um novo port é o script <command>addport</command> localizado no diretório <filename>ports/Tools/scripts</filename>. Ele adiciona um port do diretório especificado, determinando a categoria automaticamente a partir do <filename>Makefile</filename> do port. Também adiciona uma entrada à categoria do <filename>Makefile</filename> do port. Foi escrito por Michael Haro <email>mharo@FreeBSD.org</email>, Will Andrews <email>will@FreeBSD.org</email> e Renato Botelho <email>garga@FreeBSD.org</email>. Ao enviar perguntas sobre este script para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">lista de discussão dos ports do FreeBSD</link>, por favor também copie Chris Rees <email>crees@FreeBSD.org</email>, o mantenedor atual.

source: Any other things I need to know when I add a new port?
pt_br: Existe qualquer outra coisa que preciso saber quando adiciono um novo port?

source: Check the port, preferably to make sure it compiles and packages correctly. This is the recommended sequence:
pt_br: Verifique o port, de preferência para garantir que ele seja compilado e empacotado corretamente. Essa é a seqüência recomendada:

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/index.html">Porters Handbook</link> contains more detailed instructions.
pt_br: O <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/index.html">Manual de Porters</link> contém instruções mais detalhadas.

source: Use <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> to check the syntax of the port. You do not necessarily have to eliminate all warnings but make sure you have fixed the simple ones.
pt_br: Use o <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> para verificar a sintaxe do port. Você não precisa necessariamente eliminar todos os avisos, mas certifique-se de ter corrigido os mais simples.
