Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: The FreeBSD Project takes visitor privacy very seriously. As such, the FreeBSD Project website honors the <quote>Do Not Track</quote> header <emphasis>before</emphasis> fetching the tracking code from Google. For more information, please see the <link xlink:href="https://www.FreeBSD.org/privacy.html">FreeBSD Privacy Policy</link>.
pt_br: O projeto FreeBSD leva a privacidade do visitante muito a sério. Como tal, o site do Projeto FreeBSD honra o cabeçalho <quote>Do Not Track</quote> <emphasis>antes</emphasis> de buscar o código de monitoramento do Google. Para mais informações, consulte a <link xlink:href="https://www.FreeBSD.org/privacy.html">Política de Privacidade do FreeBSD</link>.

source: Google Analytics access is <emphasis>not</emphasis> arbitrarily allowed — access must be requested, voted on by the Documentation Engineering Team <email>doceng@FreeBSD.org</email>, and explicitly granted.
pt_br: O acesso do Google Analytics <emphasis>não</emphasis> é arbitrariamente permitido - o acesso deve ser solicitado, votado pela Equipe de Engenharia de Documentação <email>doceng@FreeBSD.org</email> e explicitamente concedido.

source: Requests for Google Analytics data must include a specific purpose. For example, a valid reason for requesting access would be <quote>to see the most frequently used web browsers when viewing FreeBSD web pages to ensure page rendering speeds are acceptable.</quote>
pt_br: Solicitações de acesso aos dados do Google Analytics devem incluir uma finalidade específica. Por exemplo, uma razão válida para solicitar acesso seria <quote>para ver os navegadores web usados com mais freqüência pelos visitantes do website do FreeBSD para garantir que as velocidades de renderização da página sejam aceitáveis.</quote>

source: Conversely, <quote>to see what web browsers are most frequently used</quote> (without stating <emphasis>why</emphasis>) would be rejected.
pt_br: Por outro lado, <quote>ver quais navegadores são usados com mais freqüência</quote> (sem declarar <emphasis>por que</emphasis>) seria rejeitado.

source: All requests must include the timeframe for which the data would be required. For example, it must be explicitly stated if the requested data would be needed for a timeframe covering a span of 3 weeks, or if the request would be one-time only.
pt_br: Todas as solicitações devem incluir o período de tempo para o qual os dados seriam requisitados. Por exemplo, deve ser explicitamente declarado se os dados solicitados seriam requisitados em um período de tempo que abranja um período de 3 semanas, ou se o pedido seria para acessar apenas uma vez.

source: Any request for Google Analytics data without a clear, reasonable reason beneficial to the FreeBSD Project will be rejected.
pt_br: Qualquer pedido de dados do Google Analytics sem uma razão clara e razoável que beneficie o Projeto FreeBSD será rejeitado.

source: Data Available Through Google Analytics
pt_br: Dados disponíveis por meio do Google Analytics

source: A few examples of the types of Google Analytics data available include:
pt_br: Alguns exemplos dos tipos de dados do Google Analytics disponíveis incluem:

source: Commonly used web browsers
pt_br: Navegadores Web comumente usados

source: Page load times
pt_br: Tempos de carregamento de páginas

source: Site access by language
pt_br: Acesso ao site por idioma

source: How do I add a new file to a branch?
pt_br: Como adiciono um novo arquivo a uma branch?

source: To add a file onto a branch, simply checkout or update to the branch you want to add to and then add the file using the add operation as you normally would. This works fine for the <literal>doc</literal> and <literal>ports</literal> trees. The <literal>src</literal> tree uses SVN and requires more care because of the <literal>mergeinfo</literal> properties. See the <link linkend="subversion-primer">Subversion Primer</link> for details on how to perform an MFC.
pt_br: Para adicionar um arquivo a uma branch, simplesmente faça o check-out ou atualize-o na branch que você deseja adicionar e, em seguida, adicione o arquivo usando a operação add como faria normalmente. Isso funciona bem para as árvores <literal>doc</literal> e <literal>ports</literal>. A árvore <literal>src</literal> usa o SVN e requer mais cuidado por causa das propriedades <literal>mergeinfo</literal>. Veja o <link linkend="subversion-primer"> Subversion Primer</link> para detalhes sobre como executar um MFC.

source: How do I access <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> to put up personal or project information?
pt_br: Como eu acesso <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> para colocar informações pessoais ou de projeto?

source: <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> is the same as <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>. Just create a <filename>public_html</filename> directory. Anything you place in that directory will automatically be visible under <uri xlink:href="https://people.FreeBSD.org/">https://people.FreeBSD.org/</uri>.
pt_br: O servidor <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> é o mesmo que <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>. Basta criar um diretório <filename>public_html</filename>. Qualquer coisa que você colocar nesse diretório será automaticamente visível em <uri xlink:href="https://people.FreeBSD.org/">https://people.FreeBSD.org/</uri>.

source: Where are the mailing list archives stored?
pt_br: Onde estão armazenados os arquivos da lista de discussão?

source: The mailing lists are archived under <filename>/local/mail</filename> on <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.
pt_br: As listas de discussão são arquivadas em <filename>/local/mail</filename> na <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.

source: I would like to mentor a new committer. What process do I need to follow?
pt_br: Eu gostaria de ser mentor de um novo committer. Qual processo eu preciso seguir?

source: See the <link xlink:href="https://www.freebsd.org/internal/new-account.html">New Account Creation Procedure</link> document on the internal pages.
pt_br: Consulte o documento <link xlink:href="https://www.freebsd.org/internal/new-account.html">Novo Procedimento para Criação de Conta</link> nas páginas internas.

source: Benefits and Perks for FreeBSD Committers
pt_br: Benefícios e vantagens para os Commiters do FreeBSD

source: Recognition
pt_br: Reconhecimento

source: Recognition as a competent software engineer is the longest lasting value. In addition, getting a chance to work with some of the best people that every engineer would dream of meeting is a great perk!
pt_br: O reconhecimento como engenheiro de software competente é o valor mais duradouro. Além disso, ter a chance de trabalhar com algumas das melhores pessoas que todos os engenheiros sonham em conhecer é um grande privilégio!

source: FreeBSD committers can get a free 4-CD or DVD set at conferences from <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall, Inc.</link>.
pt_br: Os committers do FreeBSD podem obter um conjunto gratuito de 4-CDs ou DVDs da <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall, Inc.</link> em conferências.

source: In addition, developers may request a cloaked hostmask for their account on the Freenode IRC network in the form of <literal>freebsd/developer/</literal><replaceable>freefall name</replaceable> or <literal>freebsd/developer/</literal><replaceable>NickServ name</replaceable>. To request a cloak, send an email to <email>irc@FreeBSD.org</email> with your requested hostmask and NickServ account name.
pt_br: Além disso, os desenvolvedores podem solicitar um "cloaked hostmask" para sua conta na rede Freenode de IRC na forma de <literal>freebsd/developer/</literal><replaceable>nome_na_freefall</replaceable> ou <literal>freebsd/developer/</literal><replaceable>nome_no_NickServ</replaceable>. Para solicitar uma máscara, envie um e-mail para <email>irc@FreeBSD.org</email> com o nome da sua hostmask solicitada e nome da conta no NickServ.

source: Gandi provides website hosting, cloud computing, domain registration, and X.509 certificate services.
pt_br: A Gandi fornece hospedagem de sites, computação em nuvem, registro de domínio e serviços de certificados X.509.

source: Gandi offers an E-rate discount to all FreeBSD developers. Send mail to <email>non-profit@gandi.net</email> using your <literal>@freebsd.org</literal> mail address, and indicate your Gandi handle.
pt_br: A Gandi oferece um desconto E-rate para todos os desenvolvedores do FreeBSD. Envie e-mail para <email>non-profit@gandi.net</email> usando o seu endereço de e-mail <literal>@freebsd.org</literal> e indique o seu identificador no Gandi.
