Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: Subversion can be installed from the FreeBSD Ports Collection by issuing these commands:
pt_br: O Subversion pode ser instalado a partir da Coleção de Ports do FreeBSD, executando o comando:

source: Getting Started
pt_br: Primeiros Passos

source: There are a few ways to obtain a working copy of the tree from Subversion. This section will explain them.
pt_br: Existem algumas maneiras de obter uma cópia de trabalho da árvore do Subversion. Esta seção irá explicá-las.

source: Direct Checkout
pt_br: Checkout direto

source: The first is to check out directly from the main repository. For the <literal>src</literal> tree, use:
pt_br: O primeiro é fazer check-out diretamente do repositório principal. Para a árvore <literal>src</literal>, use:

source: For the <literal>doc</literal> tree, use:
pt_br: Para a árvore <literal>doc</literal>, use:

source: For the <literal>ports</literal> tree, use:
pt_br: Para a árvore da coleção de <literal>ports</literal>, use:

source: Though the remaining examples in this document are written with the workflow of working with the <literal>src</literal> tree in mind, the underlying concepts are the same for working with the <literal>doc</literal> and the <literal>ports</literal> tree. Ports related Subversion operations are listed in <xref linkend="ports"/>.
pt_br: Embora os exemplos restantes neste documento tenham sido escritos tendo o workflow de trabalho com a árvore <literal>src</literal> em mente, os conceitos básicos são os mesmos para se trabalhar com o <literal>doc</literal> e com a árvore dos <literal>ports</literal>. Os ports relacionados às operações do Subversion estão listados em <xref linkend="ports"/>.

source: The above command will check out a <literal>CURRENT</literal> source tree as <filename><replaceable>/usr/src/</replaceable></filename>, which can be any target directory on the local filesystem. Omitting the final argument of that command causes the working copy, in this case, to be named <quote>head</quote>, but that can be renamed safely.
pt_br: O comando acima irá fazer o checkout da árvore de código-fonte <literal>CURRENT</literal> como <filename><replaceable>/usr/src/</replaceable></filename>, o qual pode ser qualquer diretório de destino no sistema de arquivos local. Omitir o argumento final desse comando faz com que a cópia de trabalho, neste caso, seja nominada como <quote>head</quote>, mas ela poderá ser renomeada com segurança.

source: <literal>svn+ssh</literal> means the <acronym>SVN</acronym> protocol tunnelled over <acronym>SSH</acronym>. The name of the server is <literal>repo.freebsd.org</literal>, <literal>base</literal> is the path to the repository, and <literal>head</literal> is the subdirectory within the repository.
pt_br: O <literal>svn+ssh</literal> significa que o protocolo <acronym>SVN</acronym> será tunelado sobre o <acronym>SSH</acronym>. O nome do servidor é <literal>repo.freebsd.org</literal>, e <literal>base</literal> é o caminho para o repositório, e <literal>head</literal> é o subdiretório dentro do repositório.

source: If your FreeBSD login name is different from the login name used on the local machine, either include it in the <acronym>URL</acronym> (for example <literal>svn+ssh://jarjar@repo.freebsd.org/base/head</literal>), or add an entry to <filename>~/.ssh/config</filename> in the form:
pt_br: Se seu nome de login no projeto FreeBSD for diferente do nome de login usado na sua máquina local, inclua-o na <acronym>URL</acronym> (por exemplo <literal>svn+ssh://jarjar@repo.freebsd.org/base/head</literal>) ou adicione uma entrada no arquivo <filename>~/.ssh/config</filename> no formato:

source: This is the simplest method, but it is hard to tell just yet how much load it will place on the repository.
pt_br: Este é o método mais simples, mas é difícil dizer quanta carga ele irá colocar no repositório.

source: The <command>svn diff</command> does not require access to the server as <acronym>SVN</acronym> stores a reference copy of every file in the working copy. This, however, means that Subversion working copies are very large in size.
pt_br: O <command>svn diff</command> não requer acesso ao servidor pois o <acronym>SVN</acronym> armazena uma cópia de referência de todos os arquivos na cópia de trabalho. Isto, no entanto, significa que as cópias de trabalho do Subversion são muito grandes em tamanho.

source: <literal>RELENG_*</literal> Branches and General Layout
pt_br: Branches <literal>RELENG_*</literal> e Layout Geral

source: In <literal>svn+ssh://repo.freebsd.org/base</literal>, <emphasis>base</emphasis> refers to the source tree. Similarly, <emphasis>ports</emphasis> refers to the ports tree, and so on. These are separate repositories with their own change number sequences, access controls and commit mail.
pt_br: No <literal>svn+ssh://repo.freebsd.org/base</literal>, <emphasis>base</emphasis> refere-se à árvore de código fonte. Similarmente, <emphasis>ports</emphasis> refere-se à árvore de ports e assim por diante. Estes são repositórios separados com suas próprias seqüências de números de mudança, controles de acesso e email de commit.

source: For the base repository, HEAD refers to the -CURRENT tree. For example, <filename>head/bin/ls</filename> is what would go into <filename>/usr/src/bin/ls</filename> in a release. Some key locations are:
pt_br: Para o repositório base, HEAD refere-se a árvore -CURRENT. Por exemplo, <filename>head/bin/ls</filename> é o que entraria como <filename>/usr/src/bin/ls</filename> em uma release. Alguns locais importantes são:

source: <emphasis>/head/</emphasis> which corresponds to <literal>HEAD</literal>, also known as <literal>-CURRENT</literal>.
pt_br: <emphasis>/head/</emphasis> que corresponde a <literal>HEAD</literal>, também conhecido como <literal>-CURRENT</literal>.

source: <emphasis>/stable/<replaceable>n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n</replaceable></literal>.
pt_br: <emphasis>/stable/<replaceable>n</replaceable></emphasis> que corresponde a <literal>RELENG_<replaceable>n</replaceable></literal>.

source: <emphasis>/releng/<replaceable>n.n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n_n</replaceable></literal>.
pt_br: <emphasis>/releng/<replaceable>n.n</replaceable></emphasis> que corresponde a <literal>RELENG_<replaceable>n_n</replaceable></literal>.

source: <emphasis>/release/<replaceable>n.n.n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n_n_n</replaceable>_RELEASE</literal>.
pt_br: <emphasis>/release/<replaceable>n.n.n</replaceable></emphasis> que corresponde a <literal>RELENG_<replaceable>n_n_n</replaceable>_RELEASE</literal>.

source: <emphasis>/vendor*</emphasis> is the vendor branch import work area. This directory itself does not contain branches, however its subdirectories do. This contrasts with the <emphasis>stable</emphasis>, <emphasis>releng</emphasis> and <emphasis>release</emphasis> directories.
pt_br: <emphasis>/vendor*</emphasis> é uma área de trabalho para importar branches de vendors. Este diretório em si não contém branches, no entanto, os seus subdiretórios contém. Isso contrasta com os diretórios <emphasis>stable</emphasis>, <emphasis>releng</emphasis> e <emphasis>release</emphasis>.

source: <emphasis>/projects</emphasis> and <emphasis>/user</emphasis> feature a branch work area. As above, the <emphasis>/user</emphasis> directory does not contain branches itself.
pt_br: <emphasis>/projects</emphasis> e <emphasis>/user</emphasis> são áreas de trabalho de branch. Como acima, o diretório <emphasis>/user</emphasis> não contém branches em si.

source: FreeBSD Documentation Project Branches and Layout
pt_br: Branches e Layout do Projeto de Documentação do FreeBSD

source: In <literal>svn+ssh://repo.freebsd.org/doc</literal>, <emphasis>doc</emphasis> refers to the repository root of the source tree.
pt_br: no <literal>svn+ssh://repo.freebsd.org/doc</literal>, <emphasis>doc</emphasis> refere-se à raiz do repositório da árvore de código fonte.

source: In general, most FreeBSD Documentation Project work will be done within the <filename>head/</filename> branch of the documentation source tree.
pt_br: Em geral, a maior parte do trabalho do Projeto de Documentação do FreeBSD será feito dentro do branch <filename>head/</filename> da árvore com os arquivos fontes da documentação.

source: FreeBSD documentation is written and/or translated to various languages, each in a separate directory in the <filename>head/</filename> branch.
pt_br: A documentação do FreeBSD é escrita e/ou traduzida para vários idiomas, cada um em um diretório separado no branch <filename>head/</filename>.

source: Each translation set contains several subdirectories for the various parts of the FreeBSD Documentation Project. A few noteworthy directories are:
pt_br: Cada conjunto de tradução contém vários subdiretórios para as várias partes do Projeto de Documentação do FreeBSD. Alguns diretórios notáveis são:

source: <emphasis>/articles/</emphasis> contains the source code for articles written by various FreeBSD contributors.
pt_br: <emphasis>/articles/</emphasis> contém o código fonte para artigos escritos por vários colaboradores do FreeBSD.

source: <emphasis>/books/</emphasis> contains the source code for the different books, such as the FreeBSD Handbook.
pt_br: <emphasis>/books/</emphasis> contém o código fonte para os diferentes livros, como o Handbook do FreeBSD.

source: <emphasis>/htdocs/</emphasis> contains the source code for the FreeBSD website.
pt_br: <emphasis>/htdocs/</emphasis> contém o código-fonte do website do FreeBSD.

source: FreeBSD Ports Tree Branches and Layout
pt_br: Branches e Layout da Árvore de Ports do FreeBSD

source: In <literal>svn+ssh://repo.freebsd.org/ports</literal>, <emphasis>ports</emphasis> refers to the repository root of the ports tree.
pt_br: No <literal>svn+ssh: //repo.freebsd.org/ports</literal>, <emphasis>ports</emphasis> refere-se à raiz do repositório da árvore de ports.

source: In general, most FreeBSD port work will be done within the <filename>head/</filename> branch of the ports tree which is the actual ports tree used to install software. Some other key locations are:
pt_br: Em geral, a maior parte do trabalho na coleção de ports do FreeBSD será feito dentro da branch <filename>head/</filename> da árvore de ports, que é a árvore de ports real usada para instalar software. Alguns outros locais importantes são:

source: <emphasis>/branches/RELENG_<replaceable>n_n_n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n_n_n</replaceable></literal> is used to merge back security updates in preparation for a release.
pt_br: <emphasis>/branches/RELENG_<replaceable>n_n_n</replaceable></emphasis> que corresponde a <literal>RELENG_<replaceable>n_n_n</replaceable></literal> e é usado para mesclar atualizações de segurança em preparação para uma release.

source: <emphasis>/tags/RELEASE_<replaceable>n_n_n</replaceable></emphasis> which corresponds to <literal>RELEASE_<replaceable>n_n_n</replaceable></literal> represents a release tag of the ports tree.
pt_br: <emphasis>/tags/RELEASE_<replaceable>n_n_n</replaceable></emphasis> que corresponde a <literal>RELEASE_<replaceable>n_n_n</replaceable></literal> e representa uma tag de release da árvore de ports.

source: <emphasis>/tags/RELEASE_<replaceable>n</replaceable>_EOL</emphasis> represents the end of life tag of a specific FreeBSD branch.
pt_br: <emphasis>/tags/RELEASE_<replaceable>n</replaceable>_EOL</emphasis> representa o tag de end of life de um branch específico do FreeBSD.

source: Daily Use
pt_br: Uso diário

source: This section will explain how to perform common day-to-day operations with Subversion.
pt_br: Esta seção explicará como realizar operações comuns do dia-a-dia com o Subversion.

source: Help
pt_br: Ajuda

source: <acronym>SVN</acronym> has built in help documentation. It can be accessed by typing:
pt_br: O <acronym>SVN</acronym> traz em si uma documentação interna de ajuda. Ela pode ser acessada digitando:

source: Additional information can be found in the <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link>.
pt_br: Informações adicionais podem ser encontradas no <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link>.

source: As seen earlier, to check out the FreeBSD head branch:
pt_br: Como visto anteriormente, para fazer o checkout da branch principal (head) do FreeBSD:

source: At some point, more than just <literal>HEAD</literal> will probably be useful, for instance when merging changes to stable/7. Therefore, it may be useful to have a partial checkout of the complete tree (a full checkout would be very painful).
pt_br: Em algum momento, provavelmente será útil ter uma copia de trabalho mais do que apenas do <literal>HEAD</literal>, por exemplo, ao mesclar as alterações para stable/7. Portanto, pode ser útil ter uma verificação parcial da árvore completa (um check-out completo seria muito doloroso).

source: To do this, first check out the root of the repository:
pt_br: Para fazer isso, primeiro confira a raiz do repositório:

source: This will give <literal>base</literal> with all the files it contains (at the time of writing, just <filename>ROADMAP.txt</filename>) and empty subdirectories for <literal>head</literal>, <literal>stable</literal>, <literal>vendor</literal> and so on.
pt_br: Isso vai obter o <literal>base</literal> com todos os arquivos que ele contém (no momento da escrita, apenas o <filename>ROADMAP.txt</filename>) e subdiretórios vazios para <literal>head</literal>, <literal>stable</literal>, <literal>vendor</literal> e assim por diante.

source: Expanding the working copy is possible. Just change the depth of the various subdirectories:
pt_br: É possível expandir a cópia de trabalho. Basta alterar a profundidade dos vários subdiretórios:

source: The above command will pull down a full copy of <literal>head</literal>, plus empty copies of every <literal>release</literal> tag, every <literal>releng</literal> branch, and every <literal>stable</literal> branch.
pt_br: O comando acima irá baixar uma cópia completa do <literal>head</literal>, além de cópias vazias de cada tag de <literal>release</literal>, de cada branch de <literal>releng</literal>, e de cada branch <literal>stable</literal>.

source: If at a later date merging to <literal>7-STABLE</literal> is required, expand the working copy:
pt_br: Se numa data posterior você tiver necessidade de mesclar algo, por exemplo, com a <literal>7-STABLE</literal>, expanda a cópia de trabalho:

source: Subtrees do not have to be expanded completely. For instance, expanding only <literal>stable/7/sys</literal> and then later expand the rest of <literal>stable/7</literal>:
pt_br: As subárvores não precisam ser expandidas completamente. Por exemplo, para expandir apenas o <literal>stable/7/sys</literal> e depois expandir o resto do <literal>stable/7</literal>:

source: Updating the tree with <command>svn update</command> will only update what was previously asked for (in this case, <literal>head</literal> and <literal>stable/7</literal>; it will not pull down the whole tree.
pt_br: Atualizar a árvore com <command>svn update</command> irá apenas atualizar o que foi pedido anteriormente (neste caso, <literal>head</literal> e <literal>stable/7</literal>), ele não irá puxar a árvore inteira.

source: Anonymous Checkout
pt_br: Checkout Anonimo

source: It is possible to anonymously check out the FreeBSD repository with Subversion. This will give access to a read-only tree that can be updated, but not committed back to the main repository. To do this, use:
pt_br: É possível efetuar o checkout anonimo o repositório Subversion do FreeBSD. Isso dará acesso a uma árvore somente leitura que pode ser atualizada, mas que não poderá ser enviada de volta para o repositório principal por meio de um commit. Para fazer isso, use:

source: More details on using Subversion this way can be found in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Using Subversion</link>.
pt_br: Mais detalhes sobre o uso do Subversion podem ser encontrados em<link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Usando o Subversion</link>.

source: Updating the Tree
pt_br: Atualizando a Árvore

source: To update a working copy to either the latest revision, or a specific revision:
pt_br: Para atualizar uma cópia de trabalho para a revisão mais recente ou uma revisão específica:

source: To view the local changes that have been made to the working copy:
pt_br: Para ver as alterações locais que foram feitas na cópia de trabalho:

source: To show local changes and files that are out-of-date do:
pt_br: Para mostrar alterações locais e arquivos que estão desatualizados, execute:

source: Editing and Committing
pt_br: Editando e efetuando o commit

source: <acronym>SVN</acronym> does not need to be told in advance about file editing.
pt_br: O <acronym>SVN</acronym> não precisa ser avisado com antecedência sobre a edição de arquivos.

source: To commit all changes in the current directory and all subdirectories:
pt_br: Para efetuar o commit de todas as alterações no diretório atual e em todos os seus subdiretórios:

source: To commit all changes in, for example, <filename><replaceable>lib/libfetch/</replaceable></filename> and <filename><replaceable>usr/bin/fetch/</replaceable></filename> in a single operation:
pt_br: Para efetuar o commit de todas as alterações, por exemplo, nos arquivos <filename><replaceable>lib/libfetch/</replaceable></filename> e <filename><replaceable>usr/bin/fetch/</replaceable></filename> em uma única operação, execute:

source: There is also a commit wrapper for the ports tree to handle the properties and sanity checking the changes:
pt_br: Também existe um wrapper de commit para a árvore de ports para manipular as propriedades e para verificar a sanidade das mudanças:

source: Adding and Removing Files
pt_br: Adicionando e Removendo Arquivos

source: Before adding files, get a copy of <link xlink:href="https://people.FreeBSD.org/~peter/auto-props.txt">auto-props.txt</link> (there is also a <link xlink:href="https://people.FreeBSD.org/~beat/cvs2svn/auto-props.txt"> ports tree specific version</link>) and add it to <filename>~/.subversion/config</filename> according to the instructions in the file. If you added something before reading this, use <command>svn rm --keep-local</command> for just added files, fix your config file and re-add them again. The initial config file is created when you first run a svn command, even something as simple as <command>svn help</command>.
pt_br: Antes de adicionar arquivos, obtenha uma cópia do <link xlink:href="https://people.FreeBSD.org/~peter/auto-props.txt">auto-props.txt</link> (há também um <link xlink:href="https://people.FreeBSD.org/~beat/cvs2svn/auto-props.txt"> versão específica da árvore de ports</link>) e adicione-o ao <filename>~/.subversion/config</filename> seguindo as instruções contidas no arquivo. Se você adicionou algo antes de ler isto, use o comando <command>svn rm --keep-local</command> para apenas os arquivos adicionados, corrija seu arquivo de configuração e adicione-os novamente. O arquivo de configuração inicial é criado quando você executa um comando svn pela primeira vez, até mesmo algo tão simples quanto <command>svn help</command>.

source: Files are added to a <acronym>SVN</acronym> repository with <command>svn add</command>. To add a file named <emphasis>foo</emphasis>, edit it, then:
pt_br: Os arquivos são adicionados a um <acronym>SVN</acronym> repositório com <command>svn add</command>. Para adicionar um arquivo chamado <emphasis>foo</emphasis>, edite-o e depois execute:

source: Most new source files should include a <literal>$FreeBSD$</literal> string near the start of the file. On commit, <command>svn</command> will expand the <literal>$FreeBSD$</literal> string, adding the file path, revision number, date and time of commit, and the username of the committer. Files which cannot be modified may be committed without the <literal>$FreeBSD$</literal> string.
pt_br: A maioria dos novos arquivos fonte deve incluir uma string <literal>$FreeBSD$</literal> próxima ao início do arquivo. Ao efetuar o commit, o <command>svn</command> expandirá a string <literal>$FreeBSD$</literal>, adicionando o caminho do arquivo, o número da revisão, a data e a hora da confirmação e o nome de usuário do committer. Arquivos que não podem ser modificados podem ser enviados sem a string <literal>$FreeBSD$</literal>.

source: Files can be removed with <command>svn remove</command>:
pt_br: Os arquivos podem ser removidos com <command>svn remove</command>:

source: Subversion does not require deleting the file before using <command>svn rm</command>, and indeed complains if that happens.
pt_br: O subversion não requer a exclusão do arquivo antes de usaramos o comando <command>svn rm</command> e, de fato, ele reclama se isso acontecer.

source: It is possible to add directories with <command>svn add</command>:
pt_br: É possível adicionar diretórios com <command>svn add</command>:

source: Although <command>svn mkdir</command> makes this easier by combining the creation of the directory and the adding of it:
pt_br: Apesar que o <command>svn mkdir</command> torna isso mais fácil, combinando a criação do diretório e a adição dele:

source: Like files, directories are removed with <command>svn rm</command>. There is no separate command specifically for removing directories.
pt_br: Como arquivos, os diretórios são removidos com <command>svn rm</command>. Não existe um comando separado especificamente para remover diretórios.

source: Copying and Moving Files
pt_br: Copiando e Movendo Arquivos

source: This command creates a copy of <filename>foo.c</filename> named <filename>bar.c</filename>, with the new file also under version control and with the full history of <filename>foo.c</filename>:
pt_br: Este comando cria uma cópia do arquivo <filename>foo.c</filename> nomeado <filename>bar.c</filename>, com o novo arquivo também sob controle de versão e com o histórico completo de <filename>foo.c</filename>:

source: This is usually preferred to copying the file with <command>cp</command> and adding it to the repository with <command>svn add</command> because this way the new file does not inherit the original one's history.
pt_br: Geralmente é preferível copiar desta forma ao invés de copiar o arquivo com comando <command>cp</command> e adicionando-o ao repositório com <command>svn add</command> porque desta forma o novo arquivo não herda a história do original.

source: To move and rename a file:
pt_br: Para mover e renomear um arquivo:

source: Log and Annotate
pt_br: Logs e Anotações

source: <command>svn log</command> shows revisions and commit messages, most recent first, for files or directories. When used on a directory, all revisions that affected the directory and files within that directory are shown.
pt_br: O <command>svn log</command> mostra revisões e mensagens de commit, as mais recentes são exibidas primeiro, para arquivos ou diretórios. Quando usado em um diretório, todas as revisões que afetaram o diretório e os arquivos nesse diretório são mostradas.

source: <command>svn annotate</command>, or equally <command>svn praise</command> or <command>svn blame</command>, shows the most recent revision number and who committed that revision for each line of a file.
pt_br: O <command>svn annotate</command> , ou igualmente o <command>svn praise</command> ou <command>svn blame</command>, mostra o número de revisão mais recente e quem fez o commit dessa revisão para cada linha de um arquivo.
