Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: doceng is the group responsible for the documentation build infrastructure, approving new documentation committers, and ensuring that the FreeBSD website and documentation on the FTP site is up to date with respect to the <application>subversion</application> tree. It is not a conflict resolution body. The vast majority of documentation related discussion takes place on the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>. More details regarding the doceng team can be found in its <link xlink:href="https://www.FreeBSD.org/internal/doceng.html">charter</link>. Committers interested in contributing to the documentation should familiarize themselves with the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/index.html">Documentation Project Primer</link>.
pt_br: O doceng é o grupo responsável pela infraestrutura de criação de documentação, aprovando de novos committers de documentação e garantindo que o website do FreeBSD e a documentação no site FTP estão atualizados em relação à árvore <application>subversion</application>. Não é um corpo de resolução de conflitos. A grande maioria das discussões relacionadas à documentação ocorre na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto de documentação do FreeBSD</link>. Mais detalhes sobre a equipe doceng podem ser encontrados em seu <link xlink:href="https://www.FreeBSD.org/internal/doceng.html">charter</link>. Os committers interessados em contribuir com a documentação devem se familiarizar com o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/index.html">Primer do Projeto de Documentação</link>.

source: These are the members of the Release Engineering Team <email>re@FreeBSD.org</email>. This team is responsible for setting release deadlines and controlling the release process. During code freezes, the release engineers have final authority on all changes to the system for whichever branch is pending release status. If there is something you want merged from FreeBSD-CURRENT to FreeBSD-STABLE (whatever values those may have at any given time), these are the people to talk to about it.
pt_br: Estes são os membros da Equipe de Engenharia de Release <email>re@FreeBSD.org</email>. Essa equipe é responsável por definir os prazos de lançamento e por controlar o processo de release. Durante o congelamento de código, os engenheiros de release têm autoridade final sobre todas as alterações no sistema para qualquer branch que esteja com status de release pendente. Se há algo que você deseja mesclar do FreeBSD-CURRENT para o FreeBSD-STABLE (quaisquer valores que eles possam ter em um dado momento), estas são as pessoas com quem conversar sobre isso.

source: Gordon Tetlow is the <link xlink:href="@@URL_RELPREFIX@@/security/">FreeBSD Security Officer</link> and oversees the Security Officer Team <email>security-officer@FreeBSD.org</email>.
pt_br: Gordon Tetlow é o <link xlink:href="@@URL_RELPREFIX@@/security/">Oficial de Segurança do FreeBSD</link> e supervisiona a Equipe Oficial de Segurança <email>security-officer@FreeBSD.org</email>.

source: If you need advice on obscure network internals or are not sure of some potential change to the networking subsystem you have in mind, Garrett is someone to talk to. Garrett is also very knowledgeable on the various standards applicable to FreeBSD.
pt_br: Se você precisar de conselhos sobre aspectos internos obscuros da rede ou não tiver certeza de alguma mudança potencial no subsistema de rede que você tem em mente, Garrett é alguém com quem conversar. Garrett também é muito conhecedor dos vários padrões aplicáveis ao FreeBSD.

source: FreeBSD committer's mailing list
pt_br: Lista de discussão dos committers do FreeBSD

source: <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> and <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> are the mailing lists that the version control system uses to send commit messages to. <emphasis>Never</emphasis> send email directly to these lists. Only send replies to this list when they are short and are directly related to a commit.
pt_br: <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> e <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> são as listas de discussão que o sistema de controle de versão usa para enviar mensagens de commit. <emphasis>Nunca</emphasis> envie e-mail diretamente para essas listas. Apenas envie respostas para esta lista quando elas forem curtas e estiverem diretamente relacionadas a um commit.

source: FreeBSD developers mailing list
pt_br: Lista de discussão dos desenvolvedores do FreeBSD

source: All committers are subscribed to -developers. This list was created to be a forum for the committers <quote>community</quote> issues. Examples are Core voting, announcements, etc.
pt_br: Todos os committers estão inscritos na -developers. Esta lista foi criada para ser um fórum para os problemas da <quote>comunidade</quote> dos committers. Exemplos são a eleição do Core Team, anúncios, etc.

source: The FreeBSD developers mailing list is for the exclusive use of FreeBSD committers. To develop FreeBSD, committers must have the ability to openly discuss matters that will be resolved before they are publicly announced. Frank discussions of work in progress are not suitable for open publication and may harm FreeBSD.
pt_br: A lista de discussão dos desenvolvedores do FreeBSD é para uso exclusivo dos committers do FreeBSD. Para desenvolver o FreeBSD, os committers devem ter a capacidade de discutir abertamente assuntos que serão resolvidos antes de serem anunciados publicamente. As discussões francas sobre o trabalho em andamento não são adequadas para publicação aberta e podem prejudicar o FreeBSD.

source: All FreeBSD committers are expected not to not publish or forward messages from the FreeBSD developers mailing list outside the list membership without permission of all of the authors. Violators will be removed from the FreeBSD developers mailing list, resulting in a suspension of commit privileges. Repeated or flagrant violations may result in permanent revocation of commit privileges.
pt_br: Espera-se que todos os committers do FreeBSD não publiquem ou encaminhem mensagens da lista de discussão dos desenvolvedores do FreeBSD fora da lista de membros sem a permissão de todos os autores. Violadores serão removidos da lista de discussão dos desenvolvedores do FreeBSD, resultando em uma suspensão dos privilégios de commit. Violações repetidas ou flagrantes podem resultar na revogação permanente dos privilégios de commit.

source: This list is <emphasis>not</emphasis> intended as a place for code reviews or for any technical discussion. In fact using it as such hurts the FreeBSD Project as it gives a sense of a closed list where general decisions affecting all of the FreeBSD using community are made without being <quote>open</quote>. Last, but not least <emphasis>never, never ever, email the FreeBSD developers mailing list and CC:/BCC: another FreeBSD list</emphasis>. Never, ever email another FreeBSD email list and CC:/BCC: the FreeBSD developers mailing list. Doing so can greatly diminish the benefits of this list.
pt_br: <emphasis>Não</emphasis> é a intenção desta lista ser um local para revisões de código ou para realizar qualquer discussão técnica. Na verdade, usá-lo como tal prejudica o Projeto FreeBSD, pois dá uma sensação de uma lista fechada, onde as decisões gerais que afetam toda a comunidade usando o FreeBSD são feitas sem serem <quote>abertas</quote>. Por último, mas não menos importante, <emphasis>nunca, nunca, envie por e-mail a lista de discussão dos desenvolvedores do FreeBSD e faça CC:/BCC: para outra lista do FreeBSD</emphasis>. Nunca, jamais envie email para outra lista de emails do FreeBSD e faça CC:/BCC: para a lista de discussão dos desenvolvedores do FreeBSD. Fazer isso pode diminuir muito os benefícios dessa lista.

source: SSH Quick-Start Guide
pt_br: Guia de início rápido do SSH

source: If you do not wish to type your password in every time you use <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and you use keys to authenticate, <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> is there for your convenience. If you want to use <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, make sure that you run it before running other applications. X users, for example, usually do this from their <filename>.xsession</filename> or <filename>.xinitrc</filename>. See <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> for details.
pt_br: Se você não quiser digitar sua senha toda vez que usar o <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum> 1</manvolnum></citerefentry>, e você usa chaves para autenticar, o <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> está lá para sua conveniência. Se você quiser usar o <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, certifique-se de executá-lo antes de executar os outros aplicativos. Os usuários de X, por exemplo, geralmente fazem isso a partir do <filename>.xsession</filename> ou do <filename>.xinitrc</filename>. Veja <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> para detalhes.

source: Generate a key pair using <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>. The key pair will wind up in your <filename>$HOME/.ssh/</filename> directory.
pt_br: Gere um par de chaves usando <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>. O par de chaves será colocado no diretório <filename>$HOME/.ssh/</filename>.

source: Only <acronym>ECDSA</acronym>, <acronym>Ed25519</acronym> or <acronym>RSA</acronym> keys are supported.
pt_br: Somente as chaves <acronym>ECDSA</acronym>, <acronym>Ed25519</acronym> ou <acronym>RSA</acronym> são suportadas.

source: Send your public key (<filename>$HOME/.ssh/id_ecdsa.pub</filename>, <filename>$HOME/.ssh/id_ed25519.pub</filename>, or <filename>$HOME/.ssh/id_rsa.pub</filename>) to the person setting you up as a committer so it can be put into <filename><replaceable>yourlogin</replaceable></filename> in <filename>/etc/ssh-keys/</filename> on <systemitem>freefall</systemitem>.
pt_br: Envie sua chave pública (<filename>$HOME/.ssh/id_ecdsa.pub</filename>, <filename>$HOME/.ssh/id_ed25519.pub</filename>, ou <filename>$HOME/.ssh/id_rsa.pub</filename>) para a pessoa que está configurando você como um committer para que ela possa ser colocada em <filename><replaceable>yourlogin</replaceable></filename> in <filename>/etc/ssh-keys/</filename> na <systemitem>freefall</systemitem>.

source: Now <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry> can be used for authentication once per session. It prompts for the private key's pass phrase, and then stores it in the authentication agent (<citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>). Use <command>ssh-add -d</command> to remove keys stored in the agent.
pt_br: Agora <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry> pode ser usado para autenticação uma vez por sessão. Ele solicita a frase secreta da chave privada e a armazena no agente de autenticação (<citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>). Use o <command>ssh-add -d</command> para remover as chaves armazenadas no agente.

source: Test with a simple remote command: <command>ssh freefall.FreeBSD.org ls /usr</command>.
pt_br: Teste com um simples comando remoto: <command>ssh freefall.FreeBSD.org ls /usr</command>.

source: For more information, see <package>security/openssh-portable</package>, <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and <citerefentry><refentrytitle>scp</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Para obter mais informações, consulte <package>security/openssh-portable</package>, <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>, e <citerefentry><refentrytitle>scp</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: For information on adding, changing, or removing <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> keys, see <uri xlink:href="https://wiki.freebsd.org/clusteradm/ssh-keys">this article</uri>.
pt_br: Para obter informações sobre como adicionar, alterar ou remover chaves <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, consulte <uri xlink:href="https://wiki.freebsd.org/clusteradm/ssh-keys">este artigo</uri>.

source: <trademark class="registered">Coverity</trademark> Availability for FreeBSD Committers
pt_br: Disponibilidade do <trademark class="registered">Coverity</trademark> para os Committers do FreeBSD

source: All FreeBSD developers can obtain access to <application>Coverity</application> analysis results of all FreeBSD Project software. All who are interested in obtaining access to the analysis results of the automated <application>Coverity</application> runs, can sign up at <uri xlink:href="http://scan.coverity.com/">Coverity Scan</uri>.
pt_br: Todos os desenvolvedores do FreeBSD podem obter acesso aos resultados da análise do <application>Coverity</application> de todo o software do Projeto FreeBSD. Todos os interessados em obter acesso aos resultados de análise das execuções automatizadas do <application>Coverity</application> podem se inscrever em <uri xlink:href="http://scan.coverity.com/">Coverity Scan</uri>.

source: The FreeBSD wiki includes a mini-guide for developers who are interested in working with the <trademark class="registered">Coverity</trademark> analysis reports: <uri xlink:href="https://wiki.freebsd.org/CoverityPrevent">https://wiki.freebsd.org/CoverityPrevent</uri>. Please note that this mini-guide is only readable by FreeBSD developers, so if you cannot access this page, you will have to ask someone to add you to the appropriate Wiki access list.
pt_br: O wiki do FreeBSD inclui um mini-guia para desenvolvedores interessados em trabalhar com os relatórios de análise do <trademark class="registered">Coverity</trademark>: <uri xlink:href="https://wiki.freebsd.org/CoverityPrevent">https://wiki.freebsd.org/CoverityPrevent</uri>. Por favor observe que este mini-guia só pode ser lido por desenvolvedores do FreeBSD, então se você não puder acessar esta página, você terá que pedir a alguém para adicioná-lo à lista de acesso apropriada do Wiki.

source: Finally, all FreeBSD developers who are going to use <trademark class="registered">Coverity</trademark> are always encouraged to ask for more details and usage information, by posting any questions to the mailing list of the FreeBSD developers.
pt_br: Finalmente, todos os desenvolvedores do FreeBSD que usarão o <trademark class="registered">Coverity</trademark> são sempre encorajados a pedir mais detalhes e informações sobre o uso, publicando quaisquer perguntas na lista de discussão dos desenvolvedores do FreeBSD.

source: The FreeBSD Committers' Big List of Rules
pt_br: A Grande Lista de Regras dos Committers do FreeBSD

source: Everyone involved with the FreeBSD project is expected to abide by the <emphasis>Code of Conduct</emphasis> available from <link xlink:href="@@URL_RELPREFIX@@/internal/code-of-conduct.html">https://www.FreeBSD.org/internal/code-of-conduct.html</link>. As committers, you form the public face of the project, and how you behave has a vital impact on the public perception of it. This guide expands on the parts of the <emphasis>Code of Conduct</emphasis> specific to committers.
pt_br: Todos os envolvidos com o projeto FreeBSD devem obedecer ao <emphasis>Código de Conduta</emphasis> disponível em <link xlink:href="@@URL_RELPREFIX@@/internal/code-of-conduct.html">https: //www.FreeBSD.org/internal/code-of-conduct.html</link>. Como committers, vocês formam a face pública do projeto, e como você se comporta tem um impacto vital na percepção pública disso. Este guia expande as partes do <emphasis>Código de Conduta</emphasis> específico para os committers.

source: Respect other committers.
pt_br: Respeite outros committers.

source: Respect other contributors.
pt_br: Respeite os outros colaboradores.

source: Discuss any significant change <emphasis>before</emphasis> committing.
pt_br: Discuta qualquer mudança significativa <emphasis>antes de</emphasis> fazer o commit.

source: Respect existing maintainers (if listed in the <varname>MAINTAINER</varname> field in <filename>Makefile</filename> or in <filename>MAINTAINER</filename> in the top-level directory).
pt_br: Respeite os mantenedores existentes (se listado no campo <varname>MAINTAINER</varname> no <filename>Makefile</filename> ou no <filename>MAINTAINER</filename> no diretório de nível superior).

source: Any disputed change must be backed out pending resolution of the dispute if requested by a maintainer. Security related changes may override a maintainer's wishes at the Security Officer's discretion.
pt_br: Deve ser feito o rollback de qualquer alteração contestada enquanto estiver pendente a resolução da disputa, se solicitado por um mantenedor. Alterações relacionadas à segurança podem anular os desejos de um mantenedor, a critério do Oficial de Segurança.

source: Changes go to FreeBSD-CURRENT before FreeBSD-STABLE unless specifically permitted by the release engineer or unless they are not applicable to FreeBSD-CURRENT. Any non-trivial or non-urgent change which is applicable should also be allowed to sit in FreeBSD-CURRENT for at least 3 days before merging so that it can be given sufficient testing. The release engineer has the same authority over the FreeBSD-STABLE branch as outlined for the maintainer in rule #5.
pt_br: As alterações vão para o FreeBSD-CURRENT antes do FreeBSD-STABLE, a menos que especificamente permitido pelo engenheiro de release ou a menos que elas não sejam aplicáveis ao FreeBSD-CURRENT. Qualquer alteração não trivial ou não urgente que seja aplicável também deve ser permitida no FreeBSD-CURRENT por pelo menos 3 dias antes da fusão, para que tenha tempo suficiente de teste. O engenheiro de release tem a mesma autoridade sobre o branch FreeBSD-STABLE, conforme descrito para o mantenedor na regra #5.

source: Do not fight in public with other committers; it looks bad.
pt_br: Não brigue em público com outros committers; parece ruim.

source: Respect all code freezes and read the <literal>committers</literal> and <literal>developers</literal> mailing lists in a timely manner so you know when a code freeze is in effect.
pt_br: Respeite todos os congelamentos de código e leia as listas de discussão <literal>committers</literal> e <literal>developers</literal> em tempo hábil para que você saiba quando um congelamento de código está em vigor.

source: When in doubt on any procedure, ask first!
pt_br: Em caso de dúvida em qualquer procedimento, pergunte primeiro!

source: Test your changes before committing them.
pt_br: Teste suas alterações antes de fazer o commit.

source: Do not commit to contributed software without <emphasis>explicit</emphasis> approval from the respective maintainers.
pt_br: Não commit em software contribuído sem a aprovação <emphasis>explicita</emphasis> dos respectivos mantenedores.
