Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: Consider the situation where a user has submitted a PR containing code from the NetBSD project. Looking at the PR, the developer sees it is not an area of the tree they normally work in, so they have the change reviewed by the <literal>arch</literal> mailing list. Since the change is complex, the developer opts to <acronym>MFC</acronym> after one month to allow adequate testing.
pt_br: Considere a situação em que um usuário enviou um código contendo o PR do projeto NetBSD. Olhando para o PR, o desenvolvedor vê que não é uma área da árvore na qual eles normalmente trabalham, então eles têm a mudança revisada pela lista de discussão <literal>arch</literal>. Como a mudança é complexa, o desenvolvedor opta pelo <acronym>MFC</acronym> após um mês para permitir testes adequados.

source: The extra information to include in the commit would look something like
pt_br: A informação extra para incluir no commit seria algo como

source: Example Combined Commit Log
pt_br: Exemplo de log de commit combinado

source: Preferred License for New Files
pt_br: Licença preferida para novos arquivos

source: The FreeBSD Project's full license policy can be found at <link xlink:href="@@URL_RELPREFIX@@/internal/software-license.html">https://www.FreeBSD.org/internal/software-license.html</link>. The rest of this section is intended to help you get started. As a rule, when in doubt, ask. It is much easier to give advice than to fix the source tree.
pt_br: A política de licença completa do Projeto FreeBSD pode ser encontrada em <link xlink:href="@@URL_RELPREFIX@@/internal/software-license.html">https://www.FreeBSD.org/internal/software-license.html</link>. O restante desta seção destina-se a ajudá-lo a começar. Por via de regra, quando em dúvida, pergunte. É muito mais fácil dar conselhos do que consertar a árvore de código fonte.

source: The FreeBSD Project suggests and uses this text as the preferred license scheme:
pt_br: O Projeto FreeBSD sugere e usa este texto como o esquema de licença preferencial:

source: The FreeBSD project strongly discourages the so-called "advertising clause" in new code. Due to the large number of contributors to the FreeBSD project, complying with this clause for many commercial vendors has become difficult. If you have code in the tree with the advertising clause, please consider removing it. In fact, please consider using the above license for your code.
pt_br: O projeto FreeBSD desencoraja fortemente a chamada "cláusula publicitária" no novo código. Devido ao grande número de contribuidores para o projeto FreeBSD, o cumprimento desta cláusula para muitos fornecedores comerciais se tornou difícil. Se você tiver um código na árvore com a cláusula de publicidade, considere removê-lo. Na verdade, considere usar a licença acima para o seu código.

source: The FreeBSD project discourages completely new licenses and variations on the standard licenses. New licenses require the approval of the Core Team <email>core@FreeBSD.org</email> to reside in the main repository. The more different licenses that are used in the tree, the more problems that this causes to those wishing to utilize this code, typically from unintended consequences from a poorly worded license.
pt_br: O projeto FreeBSD desencoraja completamente novas licenças e variações nas licenças padrões. Novas licenças requerem a aprovação do Core Team <email>core@FreeBSD.org</email> para residir no repositório principal. Quanto mais licenças diferentes forem usadas na árvore, mais problemas isso causará para aqueles que desejarem utilizar esse código, geralmente de consequências não intencionais de uma licença mal formulada.

source: Project policy dictates that code under some non-BSD licenses must be placed only in specific sections of the repository, and in some cases, compilation must be conditional or even disabled by default. For example, the GENERIC kernel must be compiled under only licenses identical to or substantially similar to the BSD license. GPL, APSL, CDDL, etc, licensed software must not be compiled into GENERIC.
pt_br: A política do projeto determina que o código sob algumas licenças não-BSD deve ser colocado apenas em seções específicas do repositório e, em alguns casos, a compilação deve ser condicional ou até mesmo desativada por padrão. Por exemplo, o kernel GENERIC deve ser compilado apenas sob licenças idênticas ou substancialmente semelhantes à licença BSD. O software licenciado GPL, APSL, CDDL, etc, não deve ser compilado no GENERIC.

source: Developers are reminded that in open source, getting "open" right is just as important as getting "source" right, as improper handling of intellectual property has serious consequences. Any questions or concerns should immediately be brought to the attention of the core team.
pt_br: Os desenvolvedores são lembrados de que, em código aberto, ficar "aberto" corretamente é tão importante quanto obter o "fonte" correto, já que o manuseio inadequado da propriedade intelectual tem sérias consequências. Quaisquer dúvidas ou preocupações devem imediatamente ser levadas à atenção do Core Team.

source: Keeping Track of Licenses Granted to the FreeBSD Project
pt_br: Acompanhando as Licenças Concedidas ao Projeto FreeBSD

source: Various software or data exist in the repositories where the FreeBSD project has been granted a special licence to be able to use them. A case in point are the Terminus fonts for use with <citerefentry><refentrytitle>vt</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Here the author Dimitar Zhekov has allowed us to use the "Terminus BSD Console" font under a 2-clause BSD license rather than the regular Open Font License he normally uses.
pt_br: Vários softwares ou dados existem nos repositórios onde o projeto FreeBSD recebeu uma licença especial para poder usá-los. Um caso em questão são as fontes do Terminus para uso com o <citerefentry><refentrytitle>vt</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Aqui, o autor Dimitar Zhekov nos permitiu usar a fonte "Terminus BSD Console" sob uma licença BSD de 2 cláusulas, em vez da licença Open Font License que ele normalmente usa.

source: It is clearly sensible to keep a record of any such license grants. To that end, the Core Team <email>core@FreeBSD.org</email> has decided to keep an archive of them. Whenever the FreeBSD project is granted a special license we require the Core Team <email>core@FreeBSD.org</email> to be notified. Any developers involved in arranging such a license grant, please send details to the Core Team <email>core@FreeBSD.org</email> including:
pt_br: É claramente sensível manter um registro de tais concessões de licença. Para esse fim, o Core Team <email>core@FreeBSD.org</email> decidiu manter um arquivo delas. Sempre que o projeto FreeBSD receber uma licença especial, nós exigimos que o Core Team <email>core@FreeBSD.org</email> seja notificado. Qualquer desenvolvedor envolvido na obtenção de tal concessão de licença, por favor envie os detalhes para o Core Team <email>core@FreeBSD.org</email> incluindo:

source: Contact details for people or organizations granting the special license.
pt_br: Detalhes de contato para as pessoas ou organizações que concederam a licença especial.

source: What files, directories etc. in the repositories are covered by the license grant including the revision numbers where any specially licensed material was committed.
pt_br: Quais arquivos, diretórios etc. nos repositórios são cobertos pela concessão da licença, incluindo os números de revisão dos commits nos quais qualquer material especialmente licenciado tenha sido incorporado.

source: The date the license comes into effect from. Unless otherwise agreed, this will be the date the license was issued by the authors of the software in question.
pt_br: A data em que a licença entra em vigor. Salvo acordo em contrário, esta será a data em que a licença foi emitida pelos autores do software em questão.

source: The license text.
pt_br: O texto da licença.

source: A note of any restrictions, limitations or exceptions that apply specifically to FreeBSD's usage of the licensed material.
pt_br: Uma nota de quaisquer restrições, limitações ou exceções que se aplicam especificamente ao uso do material licenciado pelo FreeBSD.

source: Any other relevant information.
pt_br: Qualquer outra informação relevante.

source: Once the Core Team <email>core@FreeBSD.org</email> is satisfied that all the necessary details have been gathered and are correct, the secretary will send a PGP-signed acknowledgement of receipt including the license details. This receipt will be persistently archived and serve as our permanent record of the license grant.
pt_br: Uma vez que o Core Team <email>core@FreeBSD.org</email> esteja satisfeito de que todos os detalhes necessários foram reunidos e estão corretos, o secretário enviará um aviso de recebimento assinado com o PGP, incluindo os detalhes da licença. Esse recibo será persistentemente arquivado e servirá como nosso registro permanente da concessão da licença.

source: The license archive should contain only details of license grants; this is not the place for any discussions around licensing or other subjects. Access to data within the license archive will be available on request to the Core Team <email>core@FreeBSD.org</email>.
pt_br: O arquivo de licença deve conter apenas detalhes das concessões de licença; este não é o lugar para qualquer discussão em torno de licenciamento ou outros assuntos. O acesso aos dados dentro do arquivo de licença estará disponível mediante solicitação para o Core Team <email>core@FreeBSD.org</email>.

source: Developer Relations
pt_br: Relações entre os Desenvolvedores

source: When working directly on your own code or on code which is already well established as your responsibility, then there is probably little need to check with other committers before jumping in with a commit. Working on a bug in an area of the system which is clearly orphaned (and there are a few such areas, to our shame), the same applies. When modifying parts of the system which are maintained, formally, or informally, consider asking for review just as a developer would have before becoming a committer. For ports, contact the listed <varname>MAINTAINER</varname> in the <filename>Makefile</filename>.
pt_br: Ao trabalhar diretamente em seu próprio código ou em um código que já esteja bem estabelecido como sua responsabilidade, provavelmente haverá pouca necessidade de verificar com outros committers antes de entrar com um commit. Ao trabalhar em um bug em uma área do sistema que é claramente órfã (e existem algumas dessas áreas, para nossa vergonha), o mesmo se aplica. Ao modificar partes do sistema que são mantidas, formalmente ou informalmente, considere solicitar uma revisão exatamente como um desenvolvedor teria de fazer antes de se tornar um committer. Para os ports, entre em contato com o <varname>MAINTAINER</varname> listado no <filename>Makefile</filename>.

source: To determine if an area of the tree is maintained, check the MAINTAINERS file at the root of the tree. If nobody is listed, scan the revision history to see who has committed changes in the past. An example script that lists each person who has committed to a given file along with the number of commits each person has made can be found at on <systemitem>freefall</systemitem> at <filename>~eadler/bin/whodid</filename>. If queries go unanswered or the committer otherwise indicates a lack of interest in the area affected, go ahead and commit it.
pt_br: Para determinar se uma área da árvore é mantida, verifique o arquivo MAINTAINERS na raiz da árvore. Se ninguém estiver listado, analise o histórico de revisões para ver quem fez o commit de alterações no passado. Um script de exemplo que lista cada pessoa que já fez commit de um determinado arquivo junto com o número de commits que cada pessoa fez pode ser encontrado na <systemitem>freefall</systemitem> em <filename>~eadler/bin/whodid</filename>. Se as consultas não forem atendidas ou se o committer indicar uma falta de interesse na área afetada, vá em frente e faça o commit.

source: Avoid sending private emails to maintainers. Other people might be interested in the conversation, not just the final output.
pt_br: Evite enviar e-mails privados para os mantenedores. Outras pessoas podem estar interessadas na conversa, não apenas no resultado final.

source: If there is any doubt about a commit for any reason at all, have it reviewed before committing. Better to have it flamed then and there rather than when it is part of the repository. If a commit does results in controversy erupting, it may be advisable to consider backing the change out again until the matter is settled. Remember, with a version control system we can always change it back.
pt_br: Se houver qualquer dúvida sobre um commit por qualquer razão, submeta-o ao processo de revisão antes de faze-lo. É melhor fazer com que ele seja criticado lá e não quando ele já fizer parte do repositório. Se um commit resulta em controvérsia, pode ser aconselhável considerar a possibilidade de fazer o rollback do commit até que o assunto seja resolvido. Lembre-se, com um sistema de controle de versão, podemos sempre alterá-lo de volta.

source: Do not impugn the intentions of others. If they see a different solution to a problem, or even a different problem, it is probably not because they are stupid, because they have questionable parentage, or because they are trying to destroy hard work, personal image, or FreeBSD, but basically because they have a different outlook on the world. Different is good.
pt_br: Não impugne as intenções dos outros. Se eles vêem uma solução diferente para um problema, ou até um problema diferente, provavelmente não é porque eles são estúpidos, porque eles têm parentesco questionável, ou porque eles estão tentando destruir o trabalho duro, a imagem pessoal ou o FreeBSD, mas basicamente porque eles têm uma visão diferente do mundo. Diferente é bom.

source: Disagree honestly. Argue your position from its merits, be honest about any shortcomings it may have, and be open to seeing their solution, or even their vision of the problem, with an open mind.
pt_br: Discorde honestamente. Argumente sua posição com base em seus méritos, seja honesto quanto a quaisquer deficiências que possa ter, e esteja aberto para ver a solução deles, ou mesmo a visão deles do problema, com uma mente aberta.

source: Accept correction. We are all fallible. When you have made a mistake, apologize and get on with life. Do not beat up yourself, and certainly do not beat up others for your mistake. Do not waste time on embarrassment or recrimination, just fix the problem and move on.
pt_br: Aceite a correção. Somos todos falíveis. Quando você cometer um erro, peça desculpas e continue com a vida. Não se bata, e certamente não espanque os outros por seu erro. Não perca tempo com constrangimentos ou recriminações, apenas conserte o problema e siga em frente.

source: Ask for help. Seek out (and give) peer reviews. One of the ways open source software is supposed to excel is in the number of eyeballs applied to it; this does not apply if nobody will review code.
pt_br: Peça por ajuda. Procure (e dê) revisões dos seus pares. Uma das maneiras pelas quais o software de código aberto deve se sobressair é no número de globos oculares aplicados a ele; isso não se aplica se ninguém revisar o código.

source: If in Doubt...
pt_br: Se em dúvida...

source: When unsure about something, whether it be a technical issue or a project convention be sure to ask. If you stay silent you will never make progress.
pt_br: Quando não tiver certeza sobre algo, seja um problema técnico ou uma convenção do projeto, não se esqueça de perguntar. Se você ficar em silêncio, nunca fará progressos.

source: If it relates to a technical issue ask on the public mailing lists. Avoid the temptation to email the individual person that knows the answer. This way everyone will be able to learn from the question and the answer.
pt_br: Se estiver relacionado a um problema técnico, pergunte nas listas públicas de discussão. Evite a tentação de enviar e-mail para a pessoa que conhece a resposta. Dessa forma, todos poderão aprender com a pergunta e a resposta.

source: For project specific or administrative questions ask, in order:
pt_br: Para perguntas específicas ou administrativas do projeto, pergunte na seguinte ordem:

source: Your mentor or former mentor.
pt_br: Seu mentor ou ex-mentor.

source: An experienced committer on IRC, email, etc.
pt_br: Um committer experiente no IRC, email, etc.

source: Any team with a "hat", as they can give you a definitive answer.
pt_br: Qualquer equipe com um "hat" (chapéu), uma vez que eles podem lhe dar uma resposta definitiva.

source: If still not sure, ask on FreeBSD developers mailing list.
pt_br: Se ainda não tiver certeza, pergunte na lista de discussão dos desenvolvedores do FreeBSD.

source: Once your question is answered, if no one pointed you to documentation that spelled out the answer to your question, document it, as others will have the same question.
pt_br: Uma vez que sua pergunta seja respondida, se ninguém lhe indicou a documentação que soletra a resposta para sua pergunta, documente-a, pois outros terão a mesma pergunta no futuro.

source: The FreeBSD Project utilizes <application>Bugzilla</application> for tracking bugs and change requests. Be sure that if you commit a fix or suggestion found in the PR database to close it. It is also considered nice if you take time to close any PRs associated with your commits, if appropriate.
pt_br: O Projeto FreeBSD utiliza o <application>Bugzilla</application> para rastrear bugs e requisições de alteração. Certifique-se de fechar o PR caso você faça o commit de uma correção ou sugestão encontrada no banco de dados de PR. Também é considerada uma boa prática você reservar um tempo para fechar qualquer PR associado aos seus commits, se apropriado.

source: Committers with non-<systemitem class="domainname">FreeBSD.org</systemitem> Bugzilla accounts can have the old account merged with the <systemitem class="domainname">FreeBSD.org</systemitem> account by following these steps:
pt_br: Committers com contas não-<systemitem class="domainname">FreeBSD.org</systemitem> no Bugzilla podem ter a conta antiga mesclada com a conta <systemitem class="domainname">FreeBSD.org</systemitem> seguindo estes passos:

source: Log in using your old account.
pt_br: Faça o login usando sua conta antiga.

source: Open new bug. Choose <literal>Services</literal> as the Product, and <literal>Bug Tracker</literal> as the Component. In bug description list accounts you wish to be merged.
pt_br: Abra um novo bug. Escolha <literal>Services</literal> como o Produto e <literal>Bug Tracker</literal> como o Componente. Na descrição de erros liste as contas que você deseja mesclar.

source: Log in using <systemitem class="domainname">FreeBSD.org</systemitem> account and post comment to newly opened bug to confirm ownership. See <xref linkend="kerberos-ldap"/> for more details on how to generate or set a password for your <systemitem class="domainname">FreeBSD.org</systemitem> account.
pt_br: Faça o login usando a conta do <systemitem class="domainname">FreeBSD.org</systemitem> e poste um comentário no bug recém-aberto para confirmar a propriedade. Veja <xref linkend="kerberos-ldap"/> para mais detalhes sobre como gerar ou definir uma senha para sua conta <systemitem class="domainname">FreeBSD.org</systemitem>.

source: If there are more than two accounts to merge, post comments from each of them.
pt_br: Se houver mais de duas contas para mesclar, poste comentários de cada uma delas.

source: You can find out more about <application>Bugzilla</application> at:
pt_br: Você pode descobrir mais sobre o <application>Bugzilla</application> em:

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines/index.html">FreeBSD Problem Report Handling Guidelines</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines/index.html">Diretrizes para manuseio de relatórios de problemas</link>

source: The FreeBSD Project utilizes <link xlink:href="https://reviews.freebsd.org">Phabricator</link> for code review requests. See the <link xlink:href="https://wiki.freebsd.org/CodeReview">CodeReview</link> wiki page for details.
pt_br: O projeto FreeBSD utiliza o <link xlink:href="https://reviews.freebsd.org">Phabricator</link> para solicitações de revisão de código. Veja a página <link xlink:href="https://wiki.freebsd.org/CodeReview">CodeReview</link> no wiki para detalhes.

source: Committers with non-<systemitem class="domainname">FreeBSD.org</systemitem> Phabricator accounts can have the old account renamed to the <systemitem class="domainname">FreeBSD.org</systemitem> account by following these steps:
pt_br: Committers com contas não-<systemitem class="domainname">FreeBSD.org</systemitem> no Phabricator podem ter a conta antiga renomeada para a conta <systemitem class="domainname">FreeBSD.org</systemitem> seguindo estes passos:

source: Change your <application>Phabricator</application> account email to your <systemitem class="domainname">FreeBSD.org</systemitem> email.
pt_br: Altere o email da conta do <application>Phabricator</application> para o seu email <systemitem class="domainname">FreeBSD.org</systemitem>.

source: Open new bug on our bug tracker using your <systemitem class="domainname">FreeBSD.org</systemitem> account, see <xref linkend="bugzilla"/> for more information. Choose <literal>Services</literal> as the Product, and <literal>Code Review</literal> as the Component. In bug description request that your <application>Phabricator</application> account be renamed, and provide a link to your <application>Phabricator</application> user. For example, <literal>https://reviews.freebsd.org/p/<replaceable>bob_example.com</replaceable>/</literal>
pt_br: Abra um novo bug em nosso bug tracker usando sua conta <systemitem class="domainname">FreeBSD.org</systemitem>, veja <xref linkend="bugzilla"/> para mais informações. Escolha <literal>Services</literal> como o Produto e <literal>Code Review</literal> como o Componente. Na descrição de bugs, solicite que a sua conta do <application>Phabricator</application> seja renomeada e forneça um link para o usuário do <application>Phabricator</application>. Por exemplo, <literal> https://reviews.freebsd.org/p/<replaceable>bob_example.com</replaceable>/</literal>

source: <application>Phabricator</application> accounts cannot be merged, please do not open a new account.
pt_br: As contas do <application>Phabricator</application> não podem ser mescladas, por favor, não abra uma nova conta.

source: Who's Who
pt_br: Quem é quem

source: Besides the repository meisters, there are other FreeBSD project members and teams whom you will probably get to know in your role as a committer. Briefly, and by no means all-inclusively, these are:
pt_br: Além dos repositórios meisters, existem outros membros e equipes do projeto FreeBSD que você provavelmente conhecerá no exercício da sua função como committer. Resumidamente, e de forma alguma inclusivamente, estes são:

source: Documentation Engineering Team <email>doceng@FreeBSD.org</email>
pt_br: Equipe de Engenharia de Documentação <email>doceng@FreeBSD.org</email>
