Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: If the port came from a submitter who has not contributed to the Project before, add that person's name to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/contrib-additional.html">Additional Contributors</link> section of the FreeBSD Contributors List.
pt_br: Se o port veio de um remetente que não contribuiu para o projeto antes, adicione o nome dessa pessoa a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/contrib-additional.html">Colaboradores Adicionais</link> da Lista de Colaboradores do FreeBSD.

source: Close the PR if the port came in as a PR. To close a PR, change the state to <literal>Issue Resolved</literal> and the resolution as <literal>Fixed</literal>.
pt_br: Feche o PR se o port entrou como um PR. Para fechar um PR, mude o estado para <literal>Issue Resolved</literal> e a resolução como <literal>Fixed</literal>.

source: Removing an Existing Port
pt_br: Removendo um port existente

source: How do I remove an existing port?
pt_br: Como faço para remover um port existente?

source: First, please read the section about repository copies. Before you remove the port, you have to verify there are no other ports depending on it.
pt_br: Primeiro, por favor leia a seção sobre cópias do repositório. Antes de remover o port, você deve verificar se não há outros ports dependendo dele.

source: Make sure there is no dependency on the port in the ports collection:
pt_br: Certifique-se de que não haja dependência do port na coleção de ports:

source: The port's PKGNAME appears in exactly one line in a recent INDEX file.
pt_br: O PKGNAME do port aparece exatamente em uma linha em um arquivo INDEX recente.

source: No other ports contains any reference to the port's directory or PKGNAME in their Makefiles
pt_br: Nenhum outro port contém qualquer referência ao diretório do port ou ao seu PKGNAME em seus Makefiles

source: When using <application>Git</application>, consider using <command>git grep</command>, it is much faster than <command>grep -r</command>.
pt_br: Ao usar o <application>Git</application>, considere o uso do <command>git grep</command>, ele é muito mais rápido que o <command>grep -r</command>.

source: Then, remove the port:
pt_br: Em seguida, remova o port:

source: Remove the port's files and directory with <command>svn remove</command>.
pt_br: Remova os arquivos e o diretório do port com <command>svn remove</command>.

source: Remove the <varname>SUBDIR</varname> listing of the port in the parent directory <filename>Makefile</filename>.
pt_br: Remova a entrada <varname>SUBDIR</varname> do port listado no diretório pai do <filename>Makefile</filename>.

source: Add an entry to <filename>ports/MOVED</filename>.
pt_br: Adicione uma entrada em <filename>ports/MOVED</filename>.

source: Search for entries in <filename>ports/security/vuxml/vuln.xml</filename> and adjust them accordingly. In particular, check for previous packages with the new name which version could include the new port.
pt_br: Procure entradas em <filename>ports/security/vuxml/vuln.xml</filename> e ajuste-as de acordo. Em particular, verifique os pacotes anteriores com o novo nome e qual versão poderia incluir o novo port.

source: Remove the port from <filename>ports/LEGAL</filename> if it is there.
pt_br: Remova o port de <filename>ports/LEGAL</filename> se ele estiver lá.

source: Alternatively, you can use the <command>rmport</command> script, from <filename>ports/Tools/scripts</filename>. This script was written by Vasil Dimov <email>vd@FreeBSD.org</email>. When sending questions about this script to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link>, please also CC Chris Rees <email>crees@FreeBSD.org</email>, the current maintainer.
pt_br: Alternativamente, você pode usar o script <command>rmport</command>, a partir de <filename>ports/Tools/scripts</filename>. Este roteiro foi escrito por Vasil Dimov <email>vd@FreeBSD.org</email>. Ao enviar perguntas sobre este script para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">lista de discussão dos ports do FreeBSD</link>, por favor também copie Chris Rees <email>crees@FreeBSD.org</email>, o mantenedor atual.

source: Re-adding a Deleted Port
pt_br: Adicionando Novamente um Port que foi Removido

source: How do I re-add a deleted port?
pt_br: Como faço para adicionar novamente um port que foi removido?

source: This is essentially the reverse of deleting a port.
pt_br: Isto é essencialmente o contrário de deletar um port.

source: Do not use <command>svn add</command> to add the port. Follow these steps. If they are unclear, or are not working, ask for help, do not just <command>svn add</command> the port.
pt_br: Não use <command>svn add</command> para adicionar o port. Siga esses passos. Se eles não estiverem claros, ou não estiverem funcionando, peça ajuda, não execute apenas o <command>svn add</command> para o port.

source: Figure out when the port was removed. Use this <link xlink:href="https://people.FreeBSD.org/~crees/removed_ports/index.xml">list</link>, or look for the port on <link xlink:href="http://www.freshports.org/">freshports</link>, and then copy the last living revision of the port:
pt_br: Descubra quando o port foi removido. Use esta <link xlink:href="https://people.FreeBSD.org/~crees/removed_ports/index.xml">lista</link>, ou procure o port em <link xlink:href="http://www.freshports.org/">freshports</link> e copie a última revisão viva do porto:

source: Pick the revision that is just before the removal. For example, if the revision where it was removed is <literal>269874</literal>, use <literal>269873</literal>.
pt_br: Escolha a revisão que é justamente antes da remoção. Por exemplo, se a revisão em que foi removida for <literal>269874</literal>, use <literal>269873</literal>.

source: It is also possible to specify a date. In that case, pick a date that is before the removal but after the last commit to the port.
pt_br: Também é possível especificar uma data. Nesse caso, escolha uma data antes da remoção, mas depois do último commit para o port.

source: Make the changes necessary to get the port working again. If it was deleted because the distfiles are no longer available, either volunteer to host the distfiles, or find someone else to do so.
pt_br: Faça as alterações necessárias para que o port funcione novamente. Se ele foi excluído porque os distfiles não estão mais disponíveis, seja voluntário para hospedar os distfiles ou encontre outra pessoa para fazê-lo.

source: If some files have been added, or were removed during the resurrection process, use <command>svn add</command> or <command>svn remove</command> to make sure all the files in the port will be committed.
pt_br: Se alguns arquivos foram adicionados, ou foram removidos durante o processo de ressurreição, use o <command>svn add</command> ou <command>svn remove</command> para certificar-se de que todos os arquivos no port serão aplicados no commit.

source: Restore the <varname>SUBDIR</varname> listing of the port in the parent directory <filename>Makefile</filename>, keeping the entries sorted.
pt_br: Restaure o <varname>SUBDIR</varname> do port listado no diretório pai do <filename>Makefile</filename>, mantendo as entradas ordenadas.

source: Delete the port entry from <filename>ports/MOVED</filename>.
pt_br: Exclua a entrada do port de <filename>ports/MOVED</filename>.

source: If the port had an entry in <filename>ports/LEGAL</filename>, restore it.
pt_br: Se o port tiver uma entrada em <filename>ports/LEGAL</filename>, a restaure.

source: <command>svn commit</command> these changes, preferably in one step.
pt_br: Execute o <command>svn commit</command> para estas mudanças, de preferência no primeiro passo.

source: The <command>addport</command> script mentioned in <xref linkend="ports-qa-adding"/> now detects when the port to add has previously existed, and attempts to handle all except the <filename>ports/LEGAL</filename> step automatically.
pt_br: O script <command>addport</command> mencionado em <xref linkend="ports-qa-adding"/> agora detecta quando o port a ser adicionado existia anteriormente e tenta manipular todos automaticamente, exceto o <filename>ports/LEGAL</filename>.

source: Repository Copies
pt_br: Cópias de Repositório

source: When do we need a repository copy?
pt_br: Quando precisamos de uma cópia do repositório?

source: When you want to add a port that is related to any port that is already in the tree in a separate directory, you have to do a repository copy. Here <wordasword>related</wordasword> means it is a different version or a slightly modified version. Examples are <filename>print/ghostscript*</filename> (different versions) and <filename>x11-wm/windowmaker*</filename> (English-only and internationalized version).
pt_br: Quando você deseja adicionar um port relacionado a qualquer port que já esteja na árvore em um diretório separado, é necessário fazer uma cópia do repositório. Aqui <wordasword>relacionado</wordasword> significa que é uma versão diferente ou uma versão ligeiramente modificada. Exemplos são <filename>print/ghostscript*</filename> (versões diferentes) e <filename>x11-m/windowmaker*</filename> (versão somente inglesa e internacionalizada).

source: Another example is when a port is moved from one subdirectory to another, or when the name of a directory must be changed because the authors renamed their software even though it is a descendant of a port already in a tree.
pt_br: Outro exemplo é quando um port é movido de um subdiretório para outro, ou quando o nome de um diretório deve ser alterado porque os autores renomearam seu software mesmo sendo um descendente de um port que já esta em uma árvore.

source: What do I need to do?
pt_br: O que eu preciso fazer?

source: With Subversion, a repo copy can be done by any committer:
pt_br: Com o Subversion, uma cópia do repo pode ser feita por qualquer committer:

source: Doing a repo copy:
pt_br: Fazendo uma cópia do repo:

source: Verify that the target directory does not exist.
pt_br: Verifique se o diretório de destino não existe.

source: Use <command>svn up</command> to make certain the original files, directories, and checkout information is current.
pt_br: Use o <command>svn up</command> para garantir que os arquivos originais, diretórios e informações de checkout sejam atuais.

source: Use <command>svn move</command> or <command>svn copy</command> to do the repo copy.
pt_br: Use o <command>svn move</command> ou o <command>svn copy</command> para fazer a cópia do repo.

source: Upgrade the copied port to the new version. Remember to add or change the <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname> so there are no duplicate ports with the same name. In some rare cases it may be necessary to change the <varname>PORTNAME</varname> instead of adding <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname>, but this is only done when it is really needed — for example, using an existing port as the base for a very similar program with a different name, or upgrading a port to a new upstream version which actually changes the distribution name, like the transition from <filename>textproc/libxml</filename> to <filename>textproc/libxml2</filename>. In most cases, adding or changing <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname> suffices.
pt_br: Atualize o port copiado para a nova versão. Lembre-se de incluir ou alterar o <varname>PKGNAMEPREFIX</varname> ou <varname>PKGNAMESUFFIX</varname> para que não haja ports duplicados com o mesmo nome. Em alguns casos raros, pode ser necessário alterar o <varname>PORTNAME</varname> em vez de adicionar o <varname>PKGNAMEPREFIX</varname> ou o <varname>PKGNAMESUFFIX</varname>, mas isso só é feito quando é realmente necessário - por exemplo, usando um port existente como base para um programa muito semelhante com um nome diferente ou atualizando um port para uma nova versão upstream que realmente altera o nome da distribuição, como a transição de <filename>textproc/libxml</filename> para <filename>textproc/libxml2</filename>. Na maioria dos casos, adicionar ou alterar o <varname>PKGNAMEPREFIX</varname> ou o <varname>PKGNAMESUFFIX</varname> é suficiente.

source: Add the new subdirectory to the <varname>SUBDIR</varname> listing in the parent directory <filename>Makefile</filename>. You can run <command>make checksubdirs</command> in the parent directory to check this.
pt_br: Adicione o novo subdiretório ao <varname>SUBDIR</varname> listado no diretório pai do <filename>Makefile</filename>. Você pode executar <command>make checksubdirs</command> no diretório pai para verificar isso.

source: If the port changed categories, modify the <varname>CATEGORIES</varname> line of the port's <filename>Makefile</filename> accordingly
pt_br: Se o port mudou de categoria, modifique a linha <varname>CATEGORIES</varname> do <filename>Makefile</filename> do port adequadamente

source: Add an entry to <filename>ports/MOVED</filename>, if you remove the original port.
pt_br: Adicione uma entrada em <filename>ports/MOVED</filename>, se você remover o port original.

source: Commit all changes on one commit.
pt_br: Faça o commit de todas as alterações de uma única vez.

source: When removing a port:
pt_br: Ao remover um port:

source: Perform a thorough check of the ports collection for any dependencies on the old port location/name, and update them. Running <command>grep</command> on <filename>INDEX</filename> is not enough because some ports have dependencies enabled by compile-time options. A full <command>grep -r</command> of the ports collection is recommended.
pt_br: Execute uma verificação completa da coleção de ports para quaisquer dependências no local/nome do port antigo e os atualize. A execução do <command>grep</command> no <filename>INDEX</filename> não é suficiente porque alguns ports possuem dependências ativadas pelas opções em tempo de compilação. Um <command>grep -r</command> completo da coleção de ports é recomendado.

source: Remove the old port and the old <varname>SUBDIR</varname> entry.
pt_br: Remova o port antigo e a entrada <varname>SUBDIR</varname> antiga.

source: After repo moves (<quote>rename</quote> operations where a port is copied and the old location is removed):
pt_br: Após o repo ser movido (operação para <quote>renomear</quote> na qual um port é copiado e o local antigo é removido):

source: Follow the same steps that are outlined in the previous two entries, to activate the new location of the port and remove the old one.
pt_br: Siga as mesmas etapas descritas nas duas entradas anteriores para ativar o novo local do port e remover o antigo.

source: Ports Freeze
pt_br: Freeze do Ports

source: What is a <quote>ports freeze</quote>?
pt_br: O que é um <quote>ports freeze</quote>?

source: A <quote>ports freeze</quote> was a restricted state the ports tree was put in before a release. It was used to ensure a higher quality for the packages shipped with a release. It usually lasted a couple of weeks. During that time, build problems were fixed, and the release packages were built. This practice is no longer used, as the packages for the releases are built from the current stable, quarterly branch.
pt_br: Um <quote>ports freeze</quote> é um estado restrito em que a árvore de ports é colocada antes de uma release. Ele é usado para garantir uma qualidade superior para os pacotes enviados com um release. Geralmente dura algumas semanas. Durante esse tempo, problemas de build foram corrigidos e os pacotes de release foram criados. Esta prática não é mais usada, já que os pacotes para os releases são compilados a partir da branch trimestral stable.

source: For more information on how to merge commits to the quarterly branch, see <xref linkend="ports-qa-misc-request-mfh"/>.
pt_br: Para obter mais informações sobre como aplicar commits na branch trimestral, consulte <xref linkend="ports-qa-misc-request-mfh"/>.

source: Quarterly Branches
pt_br: Branches Trimestrais

source: What is the procedure to request authorization for merging a commit to the quarterly branch?
pt_br: Qual é o procedimento para solicitar autorização para aplicar um commit à branch trimestral?

source: When doing the commit, add the branch name to the <literal>MFH:</literal> line, for example:
pt_br: Ao fazer o commit, inclua o nome da branch na linha <literal>MFH:</literal>, por exemplo:

source: It will automatically notify the Ports Security Team <email>ports-secteam@FreeBSD.org</email> and the Ports Management Team <email>portmgr@FreeBSD.org</email>. They will then decide if the commit can be merged and answer with the procedure.
pt_br: Ele notificará automaticamente a Equipe de Segurança do Ports <email>ports-secteam@FreeBSD.org</email> e a Equipe de Gerenciamento de Ports <email>portmgr@FreeBSD.org</email>. Eles então decidirão se o commit pode ser aplicado e responder com o procedimento.

source: If the commit has already been made, send an email to the Ports Security Team <email>ports-secteam@FreeBSD.org</email> and the Ports Management Team <email>portmgr@FreeBSD.org</email> with the revision number and a small description of why the commit needs to be merged.
pt_br: Se o commit já foi feito, envie um email para a Equipe de Segurança do Ports <email>ports-secteam@FreeBSD.org</email> e a Equipe de Gerenciamento de Ports <email>portmgr@FreeBSD.org</email> com o numero de revisão e uma pequena descrição de por que o commit precisa ser aplicado.

source: If the MFH is covered by a blanket approval, please explain why with a couple of words on the <literal>MFH</literal> line, so that the reviewing team can skip this commit and save time. For example:
pt_br: Se o MFH está coberto por uma aprovação geral, explique o porque com algumas palavras na linha <literal>MFH</literal>, para que a equipe de revisão possa ignorar esse commit e economizar tempo. Por exemplo:

source: The list of blanket approvals is available in <xref linkend="ports-qa-blanket"/>.
pt_br: A lista de aprovações gerais está disponível em <xref linkend="ports-qa-blanket"/>.

source: Are there any changes that can be merged without asking for approval?
pt_br: Existe alguma alteração para a qual possa ser feito o commit sem aprovação?

source: The following blanket approvals for merging to the quarterly branches are in effect:
pt_br: As seguintes aprovações implícitas para merge nas branches trimestrais estão em vigor:

source: This blanket approval also applies to direct commits for ports that have been removed from <literal>head</literal>.
pt_br: Essa aprovação geral também se aplica aos commits diretos para ports que foram removidos do <literal>head</literal>.

source: These fixes <emphasis>must</emphasis> be tested on the quarterly branch.
pt_br: Estas correções <emphasis>devem</emphasis> ser testadas na branch trimestral.

source: Fixes that do not result in a change in contents of the resulting package. For example:
pt_br: Correções que não resultam em uma alteração no conteúdo do pacote resultante. Por exemplo:

source: Build, runtime or packaging fixes, if the quarterly branch version is currently broken.
pt_br: Correções de build, tempo de execução ou empacotamento, se a versão da branch trimestral estiver atualmente quebrada.

source: Missing dependencies (detected, linked against but not registered via <varname><replaceable>*</replaceable>_DEPENDS</varname>).
pt_br: Dependências ausentes (detectadas, vinculadas, mas não registradas, por meio de <varname><replaceable>*</replaceable>_DEPENDS</varname>).

source: Fixing <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/uses-shebangfix.html">shebangs</link>, stripping installed libraries and binaries, and plist fixes.
pt_br: Correções de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/uses-shebangfix.html">shebangs</link>, remoção de bibliotecas e binários instalados e correções de plst.

source: Backport of security and reliability fixes which only result in <varname>PORTREVISION</varname> bumps and no changes to enabled features. for example, adding a patch fixing a buffer overflow.
pt_br: Backport de segurança e correções de confiabilidade que resultam apenas em um incremento no <varname>PORTREVISION</varname> e nenhuma alteração nos recursos habilitados. Por exemplo, adição de um patch que corrige um estouro de buffer.

source: Minor version changes that do nothing but fix security or crash-related issues.
pt_br: Alterações de versões secundárias que não fazem nada além de corrigir problemas de segurança ou relacionados a falhas.

source: Adding/fixing <varname>CONFLICTS</varname>.
pt_br: Adição/Conserto de <varname>CONFLICTS</varname>.

source: Web Browsers, browser plugins, and their required dependencies.
pt_br: Navegadores Web, plug-ins do navegador e suas dependências necessárias.

source: Commits that are not covered by these blanket approvals always require explicit approval of either Ports Security Team <email>ports-secteam@FreeBSD.org</email> or Ports Management Team <email>portmgr@FreeBSD.org</email>.
pt_br: Commits que não são cobertos por essas aprovações implícitas sempre exigem aprovação explícita da Equipe de Segurança do Ports <email>ports-secteam@FreeBSD.org</email> ou da Equipe de Gerenciamento do Ports <email>portmgr@FreeBSD.org</email>.

source: What is the procedure for merging commits to the quarterly branch?
pt_br: Qual é o procedimento para aplicar os commits à branch trimestral?

source: A script is provided to automate merging a specific commit: <filename>ports/Tools/scripts/mfh</filename>. It is used as follows:
pt_br: Um script é fornecido para automatizar a mesclagem de um commit específico: <filename>ports/Tools/scripts/mfh</filename>. É usado da seguinte forma:

source: At that point, the script will either open a shell for you to fix things, or open your text editor with the commit message all prepared and then commit the merge.
pt_br: Nesse ponto, o script abrirá um shell para você consertar as coisas ou abrirá o editor de texto com a mensagem de commit preparada e, em seguida, irá aplicar o commit.

source: The script assumes that you can connect to <literal>repo.FreeBSD.org</literal> with <application>SSH</application> directly, so if your local login name is different than your FreeBSD cluster account, you need a few lines in your <filename>~/.ssh/config</filename>:
pt_br: O script assume que você pode se conectar ao <literal>repo.FreeBSD.org</literal> com o <application>SSH</application> diretamente, então se o seu nome de login local for diferente da sua conta no cluster do FreeBSD, você precisa de algumas linhas em seu <filename>~/.ssh/config</filename>:
