Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/committers-guide/*.po
Languages: pt_br

source: <command>svn diff</command> displays changes to the working copy. Diffs generated by <acronym>SVN</acronym> are unified and include new files by default in the diff output.
pt_br: O <command>svn diff</command> exibe alterações na cópia de trabalho. Diffs gerado por <acronym>SVN</acronym> são unificados e incluem novos arquivos por padrão na saída do diff.

source: <command>svn diff</command> can show the changes between two revisions of the same file:
pt_br: O <command>svn diff</command> pode mostrar as mudanças entre duas revisões do mesmo arquivo:

source: It can also show all changes for a specific changeset. This command shows what changes were made to the current directory and all subdirectories in changeset 179454:
pt_br: Ele também pode mostrar todas as alterações para um changeset específico. Este comando mostra quais alterações foram feitas no diretório atual e em todos os subdiretórios do changeset 179454:

source: Reverting
pt_br: Revertendo

source: Local changes (including additions and deletions) can be reverted using <command>svn revert</command>. It does not update out-of-date files, but just replaces them with pristine copies of the original version.
pt_br: Mudanças locais (incluindo adições e deleções) podem ser revertidas usando <command>svn revert</command>. Ele não atualiza arquivos desatualizados, apenas os substitui por cópias originais da versão original.

source: Conflicts
pt_br: Conflitos

source: If an <command>svn update</command> resulted in a merge conflict, Subversion will remember which files have conflicts and refuse to commit any changes to those files until explicitly told that the conflicts have been resolved. The simple, not yet deprecated procedure is:
pt_br: Se um <command>svn update</command> resultou em um conflito de mesclagem, o Subversion irá lembrar quais arquivos têm conflitos e se recusará a fazer o commit de quaisquer alterações nesses arquivos até que seja explicitamente informado que os conflitos foram resolvidos. O procedimento simples, ainda não obsoleto, é:

source: However, the preferred procedure is:
pt_br: No entanto, o procedimento preferido é:

source: The two examples are equivalent. Possible values for <literal>--accept</literal> are:
pt_br: Os dois exemplos são equivalentes. Os valores possíveis para <literal>--accept</literal> são:

source: <literal>working</literal>: use the version in your working directory (which one presumes has been edited to resolve the conflicts).
pt_br: <literal>working</literal>: use a versão em seu diretório de trabalho (a qual se presume que foi editada para resolver os conflitos).

source: <literal>base</literal>: use a pristine copy of the version you had before <command>svn update</command>, discarding your own changes, the conflicting changes, and possibly other intervening changes as well.
pt_br: <literal>base</literal>: usar uma cópia original da versão que você tinha antes do <command>svn update</command>, descartando suas próprias alterações, as mudanças conflitantes e possivelmente outras mudanças intervenientes também.

source: <literal>mine-full</literal>: use what you had before <command>svn update</command>, including your own changes, but discarding the conflicting changes, and possibly other intervening changes as well.
pt_br: <literal>mine-full</literal>: use o que você tinha antes do <command>svn update</command>, incluindo suas próprias mudanças, mas descartando as mudanças conflitantes, e possivelmente outras mudanças intervenientes também.

source: <literal>theirs-full</literal>: use the version that was retrieved when you did <command>svn update</command>, discarding your own changes.
pt_br: <literal>theirs-full</literal>: use a versão que foi recuperada quando você fez o <command>svn update</command>, descartando as suas próprias mudanças.

source: Advanced Use
pt_br: Uso Avançado

source: Sparse Checkouts
pt_br: Checkouts dispersos

source: <acronym>SVN</acronym> allows <emphasis>sparse</emphasis>, or partial checkouts of a directory by adding <option>--depth</option> to a <command>svn checkout</command>.
pt_br: O <acronym>SVN</acronym> permite <emphasis>sparse</emphasis>, ou checkouts parciais de um diretório adicionando <option>--depth</option> a um <command>svn checkout</command>.

source: Valid arguments to <option>--depth</option> are:
pt_br: Os argumentos válidos para <option>--depth</option> são:

source: <literal>empty</literal>: the directory itself without any of its contents.
pt_br: <literal>empty</literal>: o próprio diretório sem qualquer conteúdo.

source: <literal>files</literal>: the directory and any files it contains.
pt_br: <literal>files</literal>: o diretório e quaisquer arquivos nele contidos.

source: <literal>immediates</literal>: the directory and any files and directories it contains, but none of the subdirectories' contents.
pt_br: <literal>immediates</literal>: o diretório e quaisquer arquivos e diretórios contidos nele, mas nenhum dos conteúdos dos subdiretórios.

source: <literal>infinity</literal>: anything.
pt_br: <literal>infinity</literal>: qualquer coisa.

source: The <literal>--depth</literal> option applies to many other commands, including <command>svn commit</command>, <command>svn revert</command>, and <command>svn diff</command>.
pt_br: A opção <literal>--depth</literal> se aplica a muitos outros comandos, incluindo <command>svn commit</command>, <command>svn revert</command> e o <command>svn diff</command>.

source: Since <literal>--depth</literal> is sticky, there is a <literal>--set-depth</literal> option for <command>svn update</command> that will change the selected depth. Thus, given the working copy produced by the previous example:
pt_br: Como o parâmetro <literal>--depth </literal> utilizado é persistente, existe uma opção <literal>--set-depth</literal> para o <command>svn update</command> que irá mudar a profundidade selecionada. Assim, dada a cópia de trabalho produzida pelo exemplo anterior:

source: The above command will populate the working copy in <replaceable>~/freebsd</replaceable> with <filename>ROADMAP.txt</filename> and empty subdirectories, and nothing will happen when <command>svn update</command> is executed on the subdirectories. However, this command will set the depth for <replaceable>head</replaceable> (in this case) to infinity, and fully populate it:
pt_br: O comando acima irá popular a cópia de trabalho em <replaceable>~/freebsd</replaceable> com <filename>ROADMAP.txt</filename> e subdiretórios vazios, e nada acontecerá quando <command>svn update</command> for executado nos subdiretórios. No entanto, esse comando definirá a profundidade para <replaceable>head</replaceable> (nesse caso) como infinito e o populará totalmente:

source: Direct Operation
pt_br: Operação Direta

source: Certain operations can be performed directly on the repository without touching the working copy. Specifically, this applies to any operation that does not require editing a file, including:
pt_br: Certas operações podem ser realizadas diretamente no repositório sem tocar na cópia de trabalho. Especificamente, isso se aplica a qualquer operação que não exija a edição de um arquivo, incluindo:

source: Branching is very fast. This command would be used to branch <literal>RELENG_8</literal>:
pt_br: A criação de uma branch é muito rápida. Este comando seria usado para criar a branch <literal>RELENG_8</literal>:

source: This is equivalent to these commands which take minutes and hours as opposed to seconds, depending on your network connection:
pt_br: Isso equivale a esses comandos, que levam minutos e horas, em vez de segundos, dependendo da sua conexão de rede:

source: Merging with <acronym>SVN</acronym>
pt_br: Mesclando com <acronym>SVN</acronym>

source: This section deals with merging code from one branch to another (typically, from head to a stable branch).
pt_br: Esta seção lida com o merge de código de um branch para outro (normalmente, do head para um brach stable).

source: In all examples below, <literal>$FSVN</literal> refers to the location of the FreeBSD Subversion repository, <literal>svn+ssh://repo.freebsd.org/base/</literal>.
pt_br: Em todos os exemplos abaixo, <literal>$FSVN</literal> refere-se à localização do repositório Subversion do FreeBSD, <literal>svn+ssh://repo.freebsd.org/base </literal>.

source: About Merge Tracking
pt_br: Sobre o acompanhamento de mesclagem

source: From the user's perspective, merge tracking information (or mergeinfo) is stored in a property called <literal>svn:mergeinfo</literal>, which is a comma-separated list of revisions and ranges of revisions that have been merged. When set on a file, it applies only to that file. When set on a directory, it applies to that directory and its descendants (files and directories) except for those that have their own <literal>svn:mergeinfo</literal>.
pt_br: Do ponto de vista do usuário, informações de acompanhamento de mesclagem (ou mergeinfo) são armazenadas em uma propriedade chamada <literal>svn:mergeinfo</literal>, que é uma lista separada por vírgulas de revisões e intervalos de revisões que foram mescladas. Quando definido em um arquivo, ele se aplica somente a esse arquivo. Quando definido em um diretório, ele se aplica a esse diretório e seus descendentes (arquivos e diretórios), exceto aqueles que possuem o seu próprio <literal>svn:mergeinfo</literal>.

source: It is <emphasis>not</emphasis> inherited. For instance, <filename>stable/6/contrib/openpam/</filename> does not implicitly inherit mergeinfo from <filename>stable/6/</filename>, or <filename>stable/6/contrib/</filename>. Doing so would make partial checkouts very hard to manage. Instead, mergeinfo is explicitly propagated down the tree. For merging something into <filename>branch/foo/bar/</filename>, these rules apply:
pt_br: Ele <emphasis>não</emphasis> é herdado. Por exemplo, <filename>stable/6/contrib/openpam/</filename> não herda implicitamente o mergeinfo de <filename>stable/6/</filename>, ou do <filename>stable/6/contrib/</filename>. Isso faria com que os checkouts parciais fossem difíceis de gerenciar. Em vez disso, o mergeinfo é explicitamente propagado pela árvore. Para mesclar algo em <filename>branch/foo/bar/</filename>, estas regras se aplicam:

source: If <filename>branch/foo/bar/</filename> does not already have a mergeinfo record, but a direct ancestor (for instance, <filename>branch/foo/</filename>) does, then that record will be propagated down to <filename>branch/foo/bar/</filename> before information about the current merge is recorded.
pt_br: Se <filename>branch/foo/bar/</filename> ainda não tiver um registro mergeinfo, mas um ancestral direto (por exemplo, <filename>branch/foo/</filename>) tem, então esse registro será propagado para abaixo até <filename>branch/foo/bar/</filename> antes que as informações sobre a mesclagem atual sejam registradas.

source: Information about the current merge will <emphasis>not</emphasis> be propagated back up that ancestor.
pt_br: As informações sobre a mesclagem atual <emphasis>não</emphasis> serão propagadas para o ancestral.

source: If a direct descendant of <filename>branch/foo/bar/</filename> (for instance, <filename>branch/foo/bar/baz/</filename>) already has a mergeinfo record, information about the current merge will be propagated down to it.
pt_br: Se um descendente direto de <filename>branch/foo/bar/</filename> (por exemplo, <filename>branch/foo/bar/baz/</filename>) já tiver um registro mergeinfo, as informações sobre a mesclagem atual serão propagadas para ele.

source: If you consider the case where a revision changes several separate parts of the tree (for example, <filename>branch/foo/bar/</filename> and <filename>branch/foo/quux/</filename>), but you only want to merge some of it (for example, <filename>branch/foo/bar/</filename>), you will see that these rules make sense. If mergeinfo was propagated up, it would seem like that revision had also been merged to <filename>branch/foo/quux/</filename>, when in fact it had not been.
pt_br: Se você considerar o caso em que uma revisão altera várias partes separadas da árvore (por exemplo, <filename>branch/foo/bar/</filename> e <filename>branch/foo/quux/</filename>), mas você só deseja mesclar alguns deles (por exemplo, <filename>branch/foo/bar/</filename>), você verá que essas regras fazem sentido. Se mergeinfo fosse propagado, pareceria que a revisão também foi mesclada com <filename>branch/foo/quux/</filename>, quando na verdade não foi.

source: Selecting the Source and Target Branch When Merging
pt_br: Selecionando a branch de origem e de destino ao mesclar

source: Merging to <literal>stable/</literal> branches should originate from <literal>head/</literal>. For example:
pt_br: Mesclagens para as branches <literal>stable/</literal> devem originar-se da <literal>head/</literal>. Por exemplo:

source: Merges to <literal>releng/</literal> branches should always originate from the corresponding <literal>stable/</literal> branch. For example:
pt_br: Mesclagens para as branches <literal>releng/</literal> devem sempre se originar da branch <literal>stable/</literal> correspondente. Por exemplo:

source: Committers are only permitted to commit to the <literal>releng/</literal> branches during a release cycle after receiving approval from the Release Engineering Team, after which only the Security Officer may commit to a <literal>releng/</literal> branch for a Security Advisory or Errata Notice.
pt_br: Os committers só podem se efetuar um commit para as branches <literal>releng/</literal> durante um ciclo de release após receber aprovação da Equipe de Engenharia de Release, após o qual somente o Security Officer pode efetuar commits para o branch <literal>releng/</literal> para um Aviso de Segurança ou Aviso de Errata.

source: All merges are merged to and committed from the root of the branch. All merges look like:
pt_br: Todas as mesclagens são mescladas e enviadas por commit a partir da raiz da branch. Todas as mesclagens se parecem com:

source: Note that <replaceable>checkout</replaceable> must be a complete checkout of the branch to which the merge occurs.
pt_br: Observe que <replaceable>checkout</replaceable> deve ser uma verificação completa da branch na qual a mesclagem ocorre.

source: Preparing the Merge Target
pt_br: Preparando o Alvo de Mesclagem (Merge Target)

source: Because of the mergeinfo propagation issues described earlier, it is very important to never merge changes into a sparse working copy. Always use a full checkout of the branch being merged into. For instance, when merging from HEAD to 7, use a full checkout of stable/7:
pt_br: Devido aos problemas de propagação do mergeinfo descritos anteriormente, é muito importante nunca mesclar as alterações em uma cópia de trabalho esparsa. Sempre use um checkout completo do branch que está sendo mesclado. Por exemplo, ao mesclar de HEAD para 7, use um checkout completo de stable/7:

source: The target directory must also be up-to-date and must not contain any uncommitted changes or stray files.
pt_br: O diretório de destino também deve estar atualizado e não deve conter alterações que ainda não foram enviadas por commit ou arquivos perdidos.

source: Identifying Revisions
pt_br: Identificando Revisões

source: Identifying revisions to be merged is a must. If the target already has complete mergeinfo, ask <acronym>SVN</acronym> for a list:
pt_br: Identificar revisões a serem mescladas é uma obrigação. Se o alvo já tiver mergeinfo completo, solicite uma lista para o <acronym>SVN</acronym>:

source: If the target does not have complete mergeinfo, check the log for the merge source.
pt_br: Se o destino não tiver mergeinfo completo, verifique o log da origem de mesclagem.

source: Merging
pt_br: Mesclando

source: Now, let us start merging!
pt_br: Agora vamos começar a mesclar!

source: The Principles
pt_br: Os princípios

source: For example, To merge:
pt_br: Por exemplo, para mesclar:

source: revision <literal>$R</literal>
pt_br: revisão <literal>$R</literal>

source: in directory $target in stable branch $B
pt_br: no diretório $target na branch stable $B

source: from directory $source in head
pt_br: a partir do diretório $source no head

source: $FSVN is <literal>svn+ssh://repo.freebsd.org/base</literal>
pt_br: $FSVN é o <literal>svn+ssh://repo.freebsd.org/base</literal>

source: Assuming that revisions $P and $Q have already been merged, and that the current directory is an up-to-date working copy of stable/$B, the existing mergeinfo looks like this:
pt_br: Supondo que as revisões $P e $Q já tenham sido mescladas e que o diretório atual seja uma cópia de trabalho atualizada de stable/$B, a mergeinfo existente será semelhante a:

source: Merging is done like so:
pt_br: A mesclagem é feita assim:

source: Checking the results of this is possible with <command>svn diff</command>.
pt_br: É possível verificar os resultados disso com um <command>svn diff</command>.

source: The svn:mergeinfo now looks like:
pt_br: O svn:mergeinfo agora se parece com:

source: If the results are not exactly as shown, assistance may be required before committing as mistakes may have been made, or there may be something wrong with the existing mergeinfo, or there may be a bug in Subversion.
pt_br: Se os resultados não forem exatamente como os mostrados, você pode precisar de assistência antes de efetuar o commit pois erros podem ter sido cometidos, ou pode haver algo errado com o mergeinfo existente, ou pode haver um bug no Subversion.

source: Practical Example
pt_br: Exemplo Prático

source: As a practical example, consider this scenario. The changes to <filename>netmap.4</filename> in r238987 are to be merged from CURRENT to 9-STABLE. The file resides in <filename>head/share/man/man4</filename>. According to <xref linkend="svn-advanced-use-merging"/>, this is also where to do the merge. Note that in this example all paths are relative to the top of the svn repository. For more information on the directory layout, see <xref linkend="svn-getting-started-base-layout"/>.
pt_br: Como um exemplo prático, considere este cenário. As alterações no <filename>netmap.4</filename> no r238987 devem ser mescladas do CURRENT para o 9-STABLE. O arquivo reside em <filename>head/share/man/man4</filename>. De acordo com o <xref linkend="svn-advanced-use-merging"/>, também é onde devemos fazer a mesclagem. Note que neste exemplo todos os caminhos são relativos ao topo do repositório svn. Para obter mais informações sobre o layout do diretório, consulte <xref linkend="svn-getting-started-base-layout"/>.

source: The first step is to inspect the existing mergeinfo.
pt_br: O primeiro passo é inspecionar o mergeinfo existente.

source: Take a quick note of how it looks before moving on to the next step; doing the actual merge:
pt_br: Tome uma nota rápida de como ele se parece antes de avançar para o próximo passo; fazendo a mesclagem real:

source: Check that the revision number of the merged revision has been added. Once this is verified, the only thing left is the actual commit.
pt_br: Verifique se o número de revisão da revisão mesclada foi adicionado. Quando isso for verificado, a única coisa que resta é o commit em si.

source: Precautions Before Committing
pt_br: Precauções antes de efetuar o commit

source: As always, build world (or appropriate parts of it).
pt_br: Como sempre, faça um build world (ou as partes apropriadas dele).

source: Check the changes with <command>svn diff</command> and <command>svn stat</command>. Make sure all the files that should have been added or deleted were in fact added or deleted.
pt_br: Verifique as mudanças com o <command>svn diff</command> e <command>svn stat</command>. Certifique-se de que todos os arquivos que deveriam ter sido adicionados ou excluídos foram de fato adicionados ou excluídos.

source: Take a closer look at any property change (marked by a <literal>M</literal> in the second column of <command>svn stat</command>). Normally, no svn:mergeinfo properties should be anywhere except the target directory (or directories).
pt_br: Dê uma olhada mais de perto em qualquer mudança de propriedade (marcada por um <literal>M</literal> na segunda coluna do <command>svn stat</command>). Normalmente, nenhuma propriedade svn:mergeinfo deve estar em qualquer lugar, exceto o diretório (ou diretórios) de destino.

source: If something looks fishy, ask for help.
pt_br: Se algo parecer suspeito, peça ajuda.

source: Committing
pt_br: Fazendo o commit

source: Make sure to commit a top level directory to have the mergeinfo included as well. Do not specify individual files on the command line. For more information about committing files in general, see the relevant section of this primer.
pt_br: Certifique-se de efetuar o commit de um diretório de nível superior para incluir também o mergeinfo. Não especifique arquivos individuais na linha de comando. Para mais informações sobre como submeter arquivos em geral, veja a seção relevante deste manual.

source: Vendor Imports with <acronym>SVN</acronym>
pt_br: Importações de fornecedores com <acronym>SVN</acronym>

source: Please read this entire section before starting a vendor import.
pt_br: Por favor, leia toda esta seção antes de iniciar uma importação de fornecedores.

source: Patches to vendor code fall into two categories:
pt_br: Os patches para o código do fornecedor se enquadram em duas categorias:

source: Vendor patches: these are patches that have been issued by the vendor, or that have been extracted from the vendor's version control system, which address issues which cannot wait until the next vendor release.
pt_br: Patches do fornecedor: são patches que foram emitidos pelo fornecedor ou que foram extraídos do sistema de controle de versão do fornecedor, que abordam problemas que não podem esperar até a próxima versão do fornecedor.

source: FreeBSD patches: these are patches that modify the vendor code to address FreeBSD-specific issues.
pt_br: Patches do FreeBSD: são patches que modificam o código do fornecedor para resolver problemas específicos do FreeBSD.

source: The nature of a patch dictates where it should be committed:
pt_br: A natureza de um patch determina para onde ele deve ser enviado por commit:

source: Vendor patches must be committed to the vendor branch, and merged from there to head. If the patch addresses an issue in a new release that is currently being imported, it <emphasis>must not</emphasis> be committed along with the new release: the release must be imported and tagged first, then the patch can be applied and committed. There is no need to re-tag the vendor sources after committing the patch.
pt_br: Os patches do fornecedor devem ser enviados por commit para o branch do fornecedor e mesclados a partir dele. Se o patch resolver um problema em uma nova versão que está sendo importada atualmente, ele <emphasis>não deve</emphasis> ser enviado por commit junto com a nova versão: a versão deve ser importada e marcada primeiro, então a correção pode ser aplicada e o commit efetuado. Não há necessidade de marcar novamente as fontes do fornecedor depois de confirmar o patch.

source: FreeBSD patches are committed directly to head.
pt_br: Patches do FreeBSD são enviados diretamente para o head.

source: Preparing the Tree
pt_br: Preparando a Árvore

source: If importing for the first time after the switch to Subversion, flattening and cleaning up the vendor tree is necessary, as well as bootstrapping the merge history in the main tree.
pt_br: Se estiver importando pela primeira vez após a mudança para o Subversion, é necessário achatar e limpar a árvore do fornecedor, bem como inicializar o histórico de mesclagem na árvore principal.

source: Flattening
pt_br: Achatamento
