<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy, see www.w3.org" />
<title>FreeBSD/alpha 5.2-RELEASE Hardware Information</title>
<meta name="GENERATOR" content="Modular DocBook HTML Stylesheet Version 1.7" />
<link rel="STYLESHEET" type="text/css" href="docbook.css" />
</head>
<body class="ARTICLE" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#840084"
alink="#0000FF">
<div class="ARTICLE">
<div class="TITLEPAGE">
<h1 class="TITLE"><a id="AEN2" name="AEN2">FreeBSD/alpha 5.2-RELEASE Hardware
Information</a></h1>

<h3 class="CORPAUTHOR">The FreeBSD German Documentation Project</h3>

<p class="COPYRIGHT">Copyright &copy; 2000, 2001, 2002, 2003 The FreeBSD Documentation
Project</p>

<p class="COPYRIGHT">Copyright &copy; 2002, 2003 The FreeBSD German Documentation
Project</p>

<hr />
</div>

<div class="TOC">
<dl>
<dt><b>Inhaltsverzeichnis</b></dt>

<dt>1. <a href="#INTRO">Einf&uuml;hrung</a></dt>

<dt>2. <a href="#SUPPORT-PROC">Unterst&uuml;tzte Prozessoren und Mainboards</a></dt>

<dd>
<dl>
<dt>2.1. <a href="#AEN31">&Uuml;bersicht</a></dt>

<dt>2.2. <a href="#AEN49">Was braucht man im Allgemeinen um FreeBSD auf einer Alpha zu
nutzen?</a></dt>

<dt>2.3. <a href="#AEN111">Spezifische Informationen f&uuml;r einzelne Systeme</a></dt>

<dd>
<dl>
<dt>2.3.1. <a href="#AEN116">AXPpci33 (``NoName'')</a></dt>

<dt>2.3.2. <a href="#AEN191">Universal Desktop Box (UDB oder ``Multia'')</a></dt>

<dt>2.3.3. <a href="#AEN281">Personal Workstation (``Miata'')</a></dt>

<dt>2.3.4. <a href="#AEN390">Evaluation Board 64 Systeme</a></dt>

<dt>2.3.5. <a href="#AEN445">Evaluation Board 164 (``EB164, PC164, PC164LX, PC164SX'')
Familien</a></dt>

<dt>2.3.6. <a href="#AEN509">AlphaStation 200 (``Mustang'') und 400 (``Avanti'')
Familien</a></dt>

<dt>2.3.7. <a href="#AEN577">AlphaStation 500 und 600 (``Alcor'' und ``Maverick''
f&uuml;r EV5, ``Bret'' f&uuml;r EV56)</a></dt>

<dt>2.3.8. <a href="#AEN687">AlphaServer 1000 (``Mikasa''), 1000A (``Noritake'') und 800
(``Corelle'')</a></dt>

<dt>2.3.9. <a href="#AEN746">DS10/VS10/XP900 (``Webbrick'') / XP1000 (``Monet'') / DS10L
(``Slate'')</a></dt>

<dt>2.3.10. <a href="#AEN899">DS20/DS20E (``Goldrush'')</a></dt>

<dt>2.3.11. <a href="#AEN969">AlphaPC 264DP / UP2000</a></dt>

<dt>2.3.12. <a href="#AEN1015">AlphaServer 2000 (``DemiSable''), 2100 (``Sable''), 2100A
(``Lynx'')</a></dt>

<dt>2.3.13. <a href="#AEN1088">AlphaServer 4x00 (``Rawhide'')</a></dt>

<dt>2.3.14. <a href="#AEN1121">AlphaServer 1200 (``Tincup'') und AlphaStation 1200
(``DaVinci'')</a></dt>

<dt>2.3.15. <a href="#AEN1151">AlphaServer 8200 und 8400 (``TurboLaser'')</a></dt>

<dt>2.3.16. <a href="#AEN1195">Alpha Processor Inc. UP1000</a></dt>

<dt>2.3.17. <a href="#AEN1245">Alpha Processor Inc. UP1100</a></dt>

<dt>2.3.18. <a href="#AEN1293">Alpha Processor Inc. CS20, Compaq DS20L</a></dt>

<dt>2.3.19. <a href="#AEN1340">Compaq AlphaServer ES40 (``Clipper'')</a></dt>
</dl>
</dd>

<dt>2.4. <a href="#AEN1377">&Uuml;bersicht &uuml;ber die unterst&uuml;tzte
Hardware</a></dt>

<dt>2.5. <a href="#AEN1409">Danksagung</a></dt>
</dl>
</dd>

<dt>3. <a href="#SUPPORT">Unterst&uuml;tzte Ger&auml;te</a></dt>

<dd>
<dl>
<dt>3.1. <a href="#AEN1458">Festplatten-Controller</a></dt>

<dt>3.2. <a href="#ETHERNET">Netzwerkkarten</a></dt>

<dt>3.3. <a href="#AEN2177">FDDI Karten</a></dt>

<dt>3.4. <a href="#AEN2187">ATM Karten</a></dt>

<dt>3.5. <a href="#AEN2206">Karten f&uuml;r drahtlose Netzwerke</a></dt>

<dt>3.6. <a href="#AEN2232">Diverse Netzwerkkarten</a></dt>

<dt>3.7. <a href="#AEN2255">ISDN Karten</a></dt>

<dt>3.8. <a href="#AEN2319">Serielle Schnittstellen</a></dt>

<dt>3.9. <a href="#AEN2492">Audio Hardware</a></dt>

<dt>3.10. <a href="#AEN2614">Kameras, TV-Karten, etc</a></dt>

<dt>3.11. <a href="#USB">USB Ger&auml;te</a></dt>

<dt>3.12. <a href="#FIREWIRE">IEEE 1394 (Firewire) Ger&auml;te</a></dt>

<dt>3.13. <a href="#BLUETOOTH">Bluetooth Ger&auml;te</a></dt>

<dt>3.14. <a href="#AEN2840">Verschl&uuml;sselungs-Hardware</a></dt>

<dt>3.15. <a href="#AEN2858">Diverses</a></dt>
</dl>
</dd>
</dl>
</div>

<div class="SECT1">
<h2 class="SECT1"><a id="INTRO" name="INTRO">1. Einf&uuml;hrung</a></h2>

<p>Dieses Dokument enth&auml;lt die Liste der unterst&uuml;tzen Ger&auml;te f&uuml;r
FreeBSD 5.2-RELEASE auf Alpha/AXP Systemen (meistens einfach FreeBSD/alpha 5.2-RELEASE
genannt). Hier finden Sie zum einen alle die Ger&auml;te, von denen wir wissen, da&szlig;
Sie funktionieren; zum anderen finden Sie hier Hinweise, wie Sie den Kernel anpassen
k&ouml;nnen, wenn Sie ein bisher noch nicht unterst&uuml;tztes Ger&auml;t verwenden
wollen.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Dieses Dokument enth&auml;lt Informationen f&uuml;r Alpha/AXP
Systeme. Andere Versionen dieses Dokumentes, die f&uuml;r andere Plattformen gedacht
sind, werden in vielen Punkten von diesem Dokument abweichen.</p>
</blockquote>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="SUPPORT-PROC" name="SUPPORT-PROC">2. Unterst&uuml;tzte
Prozessoren und Mainboards</a></h2>

<i class="AUTHORGROUP"><span class="CONTRIB">Gepflegt von</span> Wilko Bulte.</i> 

<p>Wir freuen uns &uuml;ber Erg&auml;nzungen, Korrekturen und konstruktive Kritik.
Informationen &uuml;ber Fehlverhalten von Systemen sind willkommen.</p>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN31" name="AEN31">2.1. &Uuml;bersicht</a></h3>

<p>Dieses Dokument soll die erste Anlaufstelle f&uuml;r alle Anwender sein, die FreeBSD
auf einer Maschine mit Alpha-Prozessor benutzen wollen. Ziel ist,
Hintergrundinformationen &uuml;ber die diversen Varianten der Hardware zu geben. Es ist
nicht als Ersatz f&uuml;r die Handb&uuml;cher der jeweiligen Systeme gedacht. Die
Informationen gliedern sich wie folgt:</p>

<ul>
<li>
<p>Mindestanforderungen an die Hardware f&uuml;r den Betrieb von FreeBSD auf einem Alpha
System;</p>
</li>

<li>
<p>n&auml;here Informationen zu den von FreeBSD unterst&uuml;tzten
Modellen/Mainboards;</p>
</li>

<li>
<p>Hinweise zur Verwendung von Erweiterungskarten mit FreeBSD inklusive Informationen zu
plattformabh&auml;ngiger Hardware.</p>
</li>
</ul>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Im Text wird je nach Lust und Laune auf DEC, Digital Equipment
Corporation und Compaq verwiesen. Nachdem Compaq die Firma Digital Equipment aufgekauft
hatte, w&auml;re es richtiger gewesen, nur noch auf Compaq zu verweisen. Nachdem Compaq
jetzt von HP aufgekauft wurde, m&uuml;&szlig;te Compaq &uuml;berall durch HP ersetzt
werden. Allerdings findet man diesen Namens-Mix &uuml;berall, darum haben wir uns die
Arbeit erspart.</p>
</blockquote>
</div>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> SRM Befehle werden in <kbd class="USERINPUT">GROSSBUCHSTABEN</kbd>
dargestellt. SRM akzeptiert auch Kleinbuchstaben, die Verwendung von Gro&szlig;buchstaben
dient dazu, Befehle f&uuml;r den Leser hervorzuheben.</p>
</blockquote>
</div>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Compaq stellt auf seinen Webseiten Informationen f&uuml;r
Linux-Entwickler bereit. Auch f&uuml;r FreeBSD Anwender sind diese durchaus
n&uuml;tzlich. Werfen Sie einmal einen Blick auf <a
href="http://www.support.compaq.com/alpha-tools/" target="_top">Linux Alpha Power
tools</a>.</p>
</blockquote>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN49" name="AEN49">2.2. Was braucht man im Allgemeinen um
FreeBSD auf einer Alpha zu nutzen?</a></h3>

<p>Logischerweise eine Alpha, die von FreeBSD unterst&uuml;tzt wird. Alpha Maschinen sind
KEINE PCs. Es gibt erhebliche Unterschiede zwischen den einzelnen Chips&auml;tzen und
Mainboards. Der Kernel mu&szlig; also die genauen Details einer Maschine kennen, damit er
auf ihr laufen kann. Wenn Sie einfach irgendeinen <tt class="FILENAME">GENERIC</tt>
Kernel auf Ihre Hardware loslassen, wird das in der Regel b&ouml;se in die Hose
gehen.</p>

<p>Wenn Sie planen, eine Maschine mit FreeBSD zu nutzen, sollten Sie darauf achten,
da&szlig; die SRM Firmware Konsole installiert ist, bzw. das diese Firmware f&uuml;r Ihre
Maschine verf&uuml;gbar ist. Wenn Ihr System noch nicht von FreeBSD unterst&uuml;tzt
wird, kann sich das durchaus irgendwann einmal &auml;ndern; allerdings nur, wenn SRM
f&uuml;r dieses System verf&uuml;gbar ist.</p>

<p>Wenn auf Ihrer Maschine die Firmware f&uuml;r die ARC oder AlphaBIOS Konsole
installiert ist, handelt es sich um ein System, welches auf den Betrieb mit WindowsNT
ausgelegt ist. Bei einigen Systemen ist die Firmware f&uuml;r die SRM Konsole im
System-ROM verf&uuml;gbar und Sie m&uuml;ssen diese nur aktivieren (&uuml;ber das ARC
oder AlphaBIOS Men&uuml;). Bei anderen System werden Sie die ROMs mit der SRM Firmware
neu flashen m&uuml;ssen. Bei http://ftp.digital.com/pub/DEC/Alpha/firmware k&ouml;nnen
Sie erfahren, welche Optionen f&uuml;r Ihr System verf&uuml;gbar sind. Grundregel: Kein
SRM bedeutet <span class="emphasis"><i class="EMPHASIS">kein</i></span> FreeBSD (und auch
kein NetBSD, OpenBSD, Tru64 Unix oder OpenVMS). Nach dem Ende von WindowsNT/Alpha werden
viele alte NT-Systeme auf dem Gebrauchtmarkt verkauft. Diese sind mehr oder weniger
wertlos, wenn die Firmware lediglich NT unterst&uuml;tzt. Seien Sie also vorsichtig, wenn
der Preis zu verlockend scheint.</p>

<p>F&uuml;r diese Maschinen ist kein SRM verf&uuml;gbar:</p>

<ul>
<li>
<p>Digital XL series</p>
</li>

<li>
<p>Digital XLT series</p>
</li>

<li>
<p>Samsung PC164UX (``Ruffian'')</p>
</li>

<li>
<p>Samsung 164B</p>
</li>
</ul>

<p>F&uuml;r diese Systeme ist zwar eine SRM Firmware verf&uuml;gbar, sie werden aber
nicht von FreeBSD unterst&uuml;tzt:</p>

<ul>
<li>
<p>DECpc 150 (``Jensen'')</p>
</li>

<li>
<p>DEC 2000/300 (``Jensen'')</p>
</li>

<li>
<p>DEC 2000/500 (``Culzean'')</p>
</li>

<li>
<p>AXPvme Familie (``Medulla'')</p>
</li>
</ul>

<p>Um die Dinge noch weiter zu verkomplizieren, hat Digital zwei verschiedene Typen von
Alpha-Maschinen verkauft: Die ``wei&szlig;en'' Alphas waren reine NT-Maschinen,
w&auml;hrend auf den ``blauen'' Alphas OpenVMS und Digital Unix laufen. Die Namen stammen
von den Farben der Geh&auml;use: ``FrostWhite'' bzw. ``TopGunBlue''. Sie k&ouml;nnen zwar
die Firmware f&uuml;r die SRM Konsole auf einer wei&szlig;en Alpha installieren,
allerdings werden sich OpenVMS und Digital Unix weigern, auf einer solchen Maschine zu
booten. FreeBSD kann seit 4.0-RELEASE sowohl auf wei&szlig;en als auch auf blauen Alphas
genutzt werden. Um Fragen vorzubeugen: Digital verkaufte die wei&szlig;en Alphas zu einem
anderen (lies: geringeren) Preis.</p>

<p>Zusammen mit der SRM Firmware erhalten Sie den sogenannten OSF/1 PAL Code (OSF/1 war
der urspr&uuml;ngliche Name f&uuml;r die von Digital angebotene Variante f&uuml;r die
Alpha). Der PAL Code ist eine Art Vermittler zwischen der Hardware und dem
Betriebssystem. Er benutzt die normalen CPU Befehle und einige besondere Anweisungen, die
nur f&uuml;r die Nutzung durch den PAL gedacht sind. PAL ist kein Microcode. Die Firmware
f&uuml;r die ARC Konsole enth&auml;lt einen anderen PAL Code der auf die Nutzung durch
WinNT optimiert ist. Er kann nicht von FreeBSD (oder generell Unix bzw. OpenVMS) genutzt
werden. Um die &uuml;blichen Frage vorwegzunehmen: Linux verf&uuml;gt &uuml;ber einen
eigenen PAL Code und kann daher auch von ARC und AlphaBIOS booten. Dieser Ansatz wird aus
diversen Gr&uuml;nden von den *BSD-Machern abgelehnt. Details w&uuml;rden an dieser
Stelle zu weit f&uuml;hren, sind aber auf den Webseiten von FreeBSD und NetBSD
verf&uuml;gbar.</p>

<p>Es gibt noch einen weiteren Fallstrick: Sie brauchen einen Festplatten-Controller, der
von der SRM Firmware erkannt wird, damit Sie davon booten k&ouml;nnen. Welche Controller
akzeptabel sind, h&auml;ngt leider stark vom jeweiligen System und der SRM Version ab.
F&uuml;r &auml;ltere PCI-basierte Systeme brauchen Sie entweder einen Kontroller mit
einem NCR/Symbios 53C810 oder einem Qlogic 1020/1040. Einige Maschinen verf&uuml;gen
&uuml;ber einen integrierten On-Board Controller. Neuere Maschinen und SRM Versionen
unterst&uuml;tzen auch aktuellere SCSI-Chips bzw. Kontroller. Details finden Sie in den
System-spezifischen Informationen. Hinweis: Wenn in diesem Dokument Symbios Chips
erw&auml;hnt werden, sind damit auch &auml;ltere Chips gemeint, die noch die Aufschrift
NCR tragen. NCR wurde vor einiger Zeit von Symbios aufgekauft.</p>

<p>Diese Einschr&auml;nkung k&ouml;nnte Ihnen Probleme machen, wenn Sie ein ehemaliges
WindowsNT-System haben. ARC und AlphaBIOS kennen (und booten von) <span
class="emphasis"><i class="EMPHASIS">anderen</i></span> Controllern als SRM. Zum Beispiel
k&ouml;nnen Sie mit ARC/AlphaBIOS von einem Adaptec 2940UW booten, w&auml;hrend das mit
SRM (normalerweise) nicht geht. Nur bei einigen neueren Maschinen ist es m&ouml;glich,
von einem Adaptec zu booten. Details finden Sie in den System-spezifischen
Informationen.</p>

<p>Wenn Sie von einem Controller nicht booten k&ouml;nnen, k&ouml;nnen Sie ihn aber in
der Regel f&uuml;r Festplatten nutzen, von denen nicht gebootet werden soll. Die
Unterschiede zwischen SRM und ARC k&ouml;nnen auch dazu f&uuml;hren, da&szlig; in Ihrem
System IDE CDROMs oder Festplatten stecken (speziell bei ehemaligen WindowsNT-Systemen).
Es gibt einige SRM Versionen, die von IDE-Festplatten und -CDROMs booten k&ouml;nnen,
Details dazu finden Sie wiederum in den System-spezifischen Informationen.</p>

<p>Seit FreeBSD 4.0 k&ouml;nnen Sie von der Original-CD booten, bei &auml;lteren
Versionen brauchen Sie hingegen die zwei Bootdisketten.</p>

<p>Wenn Sie von einer Festplatte booten wollen, mu&szlig; die Root-Partition (Partition
a) am Anfang (Offset 0) der Festplatte liegen. Daher m&uuml;ssen Sie das
Partitions-Men&uuml; des Installationsprogramms benutzen und als erstes Partition a mit
Offset 0 als Root-Partition anlegen. Danach k&ouml;nnen Sie den Rest der Festplatten frei
aufteilen. Wenn Sie sich nicht an diese Regel halten, werden Sie das System zwar
problemlos installieren k&ouml;nnen, aber nicht von der gerade installieren Festplatte
booten k&ouml;nnen.</p>

<p>Wenn Sie keine Festplatte haben (oder wollen), k&ouml;nnen Sie das System auch
&uuml;ber Ethernet booten. Dazu brauchen Sie eine Netzwerkkarte bzw. Chips, der von der
SRM Konsole unterst&uuml;tzt wird. Das bedeutet in der Regel, da&szlig; Sie eine
Netzwerkkarte mit einem 21040, 21142 oder 21143 Chip ben&ouml;tigen. Wenn Sie eine
&auml;ltere Maschine oder SRM Versionen haben, werden die 21142 / 21143 Fast Ethernet
Chips m&ouml;glicherweise nicht erkannt. In diesem Fall k&ouml;nnen Sie nur 10MBit
Ethernet nutzen, wenn Sie &uuml;ber Ethernet booten wollen. Wenn Ihre Karte nicht von DEC
stammt, wird sie meistens auch funktionieren (aber nicht immer). Intel hat vor einiger
Zeit Digital Semiconductor aufgekauft und damit auch die Rechte an den 21x4x Chips
erworben. Wundern Sie sich also nicht, wenn Sie einen 21x4x mit Intel-Logo sehen. Der SRM
auf einigen neuen Modellen unterst&uuml;tzt &uuml;brigens auch die Intel 8255x Chips.</p>

<p>Alphas mit SRM k&ouml;nnen sowohl eine graphische als auch eine serielle Konsole
nutzen. ARC kann zur Not auch eine serielle Konsole bedienen. Wenn Sie ein
Terminalprogramm mit einer 8Bit-f&auml;higen VT100-Emulation besitzen, sollten Sie in der
Lage sein, von ARC/AlphaBIOS auf SRM umzuschalten, ohne erst eine Graphikkarte
installieren zu m&uuml;ssen.</p>

<p>Wenn Sie Ihre Alpha ohne Monitor und Grafikkarte betreiben wollen, m&uuml;ssen Sie
lediglich Tastatur und Maus abziehen. Als Ersatz schlie&szlig;en Sie ein Terminal (bzw.
einen PC mit Terminalprogramm) an den Anschlu&szlig; "serial port #1" an. Der SRM spricht
9600N81. Diese Variante ist auch sehr praktisch f&uuml;r die Fehlerdiagnose. Vorsicht:
Einige/alle SRM geben auch am zweiten seriellen Anschlu&szlig; eine Eingabeaufforderung
aus. Der Kernel wird allerdings nur den ersten Anschlu&szlig; f&uuml;r seine Ausgaben und
seine Konsole nutzen. <span class="emphasis"><i class="EMPHASIS">Dieses Verhalten kann zu
massiver Verwirrung f&uuml;hren.</i></span></p>

<p>Die meisten PCI-basierten Alphas k&ouml;nnen normale VGA-Karten f&uuml;r PCs nutzen.
Der SRM ist intelligent genug, um diese Karten anzusprechen. Allerdings bedeutet dies
nicht, da&szlig; jede beliebige PCI VGA-Karte in einer Alpha funktioniert. Die S3 Trio64,
Mach64, und Matrox Millennium funktionieren in der Regel, auch alte ET4000 funktionieren.
Fragen Sie lieber nach, bevor Sie Geld ausgeben.</p>

<p>Die meisten anderen PCI-Karten aus der PC-Welt werden auch von FreeBSD auf
PCI-basierten Alpha-Maschinen unterst&uuml;tzt. Die aktuellsten Informationen zu diesem
Thema finden Sie in der Datei <tt class="FILENAME">/sys/alpha/conf/GENERIC</tt>. Wenn auf
der von Ihnen genutzten PCI-Karte eine PCI-Bridge ist, sollten Sie die spezifischen
Informationen zum jeweiligen System beachten. In einigen F&auml;llen k&ouml;nnen
PCI-Karten Probleme verursachen, wenn sie die PCI-Parity nicht richtig implementieren.
Dies kann zu Abst&uuml;rzen des Systems f&uuml;hren. Sie k&ouml;nnen die
&Uuml;berpr&uuml;fung der PCI-Parity mit dem folgenden SRM Kommando abschalten:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">SET PCI_PARITY OFF</kbd>
</pre>

<p>Dies ist kein Fehler in FreeBSD, alle auf der Alpha genutzten Betriebssysteme
ben&ouml;tigen diesen ``Trick''.</p>

<p>Wenn Ihr System (auch) EISA-Steckpl&auml;tze enth&auml;lt, m&uuml;ssen Sie, nachdem
Sie eine EISA-Karte eingebaut oder die Firmware der Konsole aktualisiert haben, das EISA
Configuration Utility (ECU) starten.</p>

<p>Es gibt verschiedene Version der Alpha CPU. Die erste Version war der 21064. Er wurde
in einem MOS4 genannten Verfahren hergestellt, die Chips haben den Spitznamen EV4. Neuere
CPUs hei&szlig;en 21164, 21264, usw. Sie werden auch als EV4S, EV45, EV5, EV56, EV6,
EV67, EV68 bezeichnet. Die EVs mit zwei Ziffern kennzeichnen verbesserte Versionen. Zum
Beispiel verf&uuml;gt der EV45 im Vergleich zu seinem Vorg&auml;nger, der EV4 &uuml;ber
eine verbesserte FPU sowie &uuml;ber einen 16 KByte I&amp;D Cache on-chip. Faustregel: Je
gr&ouml;&szlig;er die erste Ziffer nach dem ``EV'' ist, desto besser ist der Chip (lies:
schneller / moderner).</p>

<p>In Punkto Speicher sollten Sie auf jeden Fall mindestens 32 MByte einsetzen. Es ist
zwar m&ouml;glich, FreeBSD auch auf einem System mit nur 16 MByte zu nutzen, aber dabei
kommt keine Freude auf. Die zur Compilierung des Kernels ben&ouml;tigte Zeit halbierte
sich nach dem Ausbau auf 32 MByte. Bitte beachten Sie, da&szlig; die SRM Konsole 2 MByte
des Systemspeichers nutzt (und auch beh&auml;lt). Wenn Sie ernsthaft mit Ihrem System
arbeiten wollen, sollte es mindestens 64 MByte Speicher besitzen.</p>

<p>Wo wir gerade beim Thema sind: Achten Sie sehr genau darauf, welche Art von Speicher
Ihr System benutzt. Es gibt viele verschiedene Konfigurationen und Einschr&auml;nkungen
f&uuml;r die unterschiedlichen Systeme.</p>

<p>Zum Abschlu&szlig;: Der oben stehende Text d&uuml;rfte auf einen Einsteiger etwas
abschreckend wirken. Lassen Sie sich aber nicht abhalten. Wenn Sie noch Fragen haben,
stellen Sie diese ruhig.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN111" name="AEN111">2.3. Spezifische Informationen f&uuml;r
einzelne Systeme</a></h3>

<p>Im Rest dieses Kapitels finden Sie eine &Uuml;bersicht &uuml;ber alle Systeme, auf
denen FreeBSD genutzt werden kann. Diese Liste wird l&auml;nger werden, ein Blick in <tt
class="FILENAME">/sys/alpha/conf/GENERIC</tt> lohnt sich.</p>

<p>Bei Alpha-Systemen wird oft nur der Codename aus dem Entwicklungsprojekt benutzt, um
eine Maschine zu identifizieren. Soweit bekannt, stehen die Namen in Klammern hinter dem
offiziellen Namen.</p>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN116" name="AEN116">2.3.1. AXPpci33 (``NoName'')</a></h4>

<p>Bei der NoName handelt es sich um ein Mainboard im Baby-AT Format mit einem 21066 LCA
(Low Cost Alpha) Prozessor. Die NoName war urspr&uuml;nglich f&uuml;r die Verwendung
durch OEMs gedacht. Der LCA Chip enth&auml;lt fast die gesamte Ansteuerung f&uuml;r den
PCI-Bus und den Speicher, was ein sehr preiswertes System m&ouml;glich macht.</p>

<p>Das eingeschr&auml;nkte Interface zum Hauptspeicher bremst das System bei einem
Cache-Miss stark aus. Solange Sie innerhalb des On-Chip Caches bleiben, ist die
Performance der CPU vergleichbar mit der einer 21064 (erste Generation der Alpha). Diese
Mainboards sollten heute sehr g&uuml;nstig zu haben sein. Sie erhalten eine vollwertige
64-Bit CPU, allerdings sollten Sie keine Geschwindigkeitswunder erwarten.</p>

<p>Features:</p>

<ul>
<li>
<p>21066 Alpha CPU mit 166 MHz oder 21066A CPU mit 233 MHz. 21068 CPUs existieren auch,
sind aber noch langsamer.</p>
</li>

<li>
<p>on-board Bcache / L2 cache: 0, 256k oder 1 MByte (nutzt DIL Chips)</p>
</li>

<li>
<p>PS/2 Maus &#38; Tastatur ODER 5pin DIN Tastatur (2 verschiedene Mainboards)</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>Busbreite: 64 Bits</p>
</li>

<li>
<p>PS/2 72 Pin 36 Bit Fast Page Mode SIMMs</p>
</li>

<li>
<p>70ns oder schneller</p>
</li>

<li>
<p>m&uuml;ssen paarweise installiert werden</p>
</li>

<li>
<p>4 SIMM Steckpl&auml;tze</p>
</li>

<li>
<p>benutzt ECC</p>
</li>
</ul>
</li>

<li>
<p>512 KByte Flash ROM f&uuml;r die Konsole</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>Floppy-Anschlu&szlig;</p>
</li>

<li>
<p>1 IDE Anschlu&szlig; on-board</p>
</li>

<li>
<p>Steckpl&auml;tze:</p>

<ul>
<li>
<p>3 32 Bit PCI Steckpl&auml;tze (einer mit ISA geteilt)</p>
</li>

<li>
<p>5 ISA Steckpl&auml;tze (einer mit PCI geteilt)</p>
</li>
</ul>
</li>

<li>
<p>on-board Fast SCSI mit Symbios 53C810 Chip</p>
</li>
</ul>

<p>Die NoName kann in ihrem Flash ROM die Firmware f&uuml;r den SRM <span
class="emphasis"><i class="EMPHASIS">oder</i></span> ARC Konsole enthalten. Das Flash ROM
ist nicht gro&szlig; genug, um beide Varianten gleichzeitig zur Verf&uuml;gung zu stellen
und die Auswahl per Software m&ouml;glich zu machen. Sie ben&ouml;tigen jedoch nur
SRM.</p>

<p>Der Cache der NoNames nutzt 15 oder 20 ns DIL Chips. Wenn Sie nur 256 KByte Cache
brauchen, sollten Sie ihr altes 486er Mainboard ausschlachten. Die f&uuml;r 1 MByte Cache
ben&ouml;tigten Chips sind leider deutlich seltener zu finden. Sie sollten zur Steigerung
der Performance mindestens 256 KByte Cache nutzen. Ohne Cache sind diese Maschinen sehr
langsam.</p>

<p>Das NoName Mainboard hat den normalen PC/AT-Stromanschlu&szlig;. Au&szlig;erdem
verf&uuml;gt es &uuml;ber einen zus&auml;tzlichen Anschlu&szlig; f&uuml;r 3.3 Volt. Es
ist allerdings nicht notwendig, ein neues Netzteil zu kaufen. Die 3.3 Volt werden nur
ben&ouml;tigt, wenn Sie auf 3.3 Volt ausgelegt PCI-Karten nutzen wollen. Diese sind
extrem selten.</p>

<p>Der IDE-Anschlu&szlig; wird von FreeBSD unterst&uuml;tzt, wenn die folgende Zeile in
der Konfigurationsdatei des Kernels steht:</p>

<pre class="PROGRAMLISTING">
device ata
</pre>

<p>Der IDE-Anschlu&szlig; nutzt IRQ 14</p>

<p>Leider kann die SRM Konsole von der IDE-Festplatte <span class="emphasis"><i
class="EMPHASIS">nicht booten</i></span>. Sie brauchen daher eine SCSI-Platte als
Bootdevice.</p>

<p>Die NoName verh&auml;lt sich im Bereich der seriellen Konsole etwas st&ouml;rrisch.
Sie m&uuml;ssen</p>

<pre class="SCREEN">
&gt;&gt;&gt; <kbd class="USERINPUT">SET CONSOLE SERIAL</kbd>
</pre>

<p>eingeben, damit sie eine serielle Konsole benutzt. Im Gegensatz zu den meisten anderen
Modellen reicht es nicht aus, die Tastatur abzuziehen. Um wieder zur graphischen Konsole
zu wechseln, m&uuml;ssen Sie</p>

<pre class="SCREEN">
&gt;&gt;&gt; <kbd class="USERINPUT">SET CONSOLE GRAPHICS</kbd>
</pre>

<p>auf der seriellen Konsole eingeben.</p>

<p>Einige Anwender mu&szlig;ten manchmal <b class="KEYCAP">Control</b>-<b
class="KEYCAP">Alt</b>-<b class="KEYCAP">Del</b> dr&uuml;cken, um den SRM aufzuwecken.
Ich habe diese Situation noch nie erlebt; aber wenn Sie nach dem Einschalten von einem
schwarzen Bildschirm begr&uuml;&szlig;t werden, ist es einen Versuch wert.</p>

<p>Verwenden Sie nur echte 36 Bit SIMMs, und nur FPM (Fast Page Mode) DRAM. EDO DRAM oder
SIMMs mit simulierter Parity <span class="emphasis"><i class="EMPHASIS">funktionieren
nicht</i></span>. Das System nutzt die zus&auml;tzlichen 4 Bit f&uuml;r ECC. Das ist auch
der Grund weshalb 33 Bit FPM SIMMs nicht funktionieren.</p>

<p>Wenn Sie die Wahl haben, sollten Sie zur PS/2-Variante des Mainboards greifen. Zum
einen erhalten Sie einen Bonus-Anschlu&szlig; f&uuml;r die Maus, zum anderen wird diese
Variante von Tru64 Unix unterst&uuml;tzt (falls Sie das irgendwann einmal benutzen wollen
oder m&uuml;ssen). Die ``DIN''-Variante sollte aber f&uuml;r FreeBSD ausreichend
sein.</p>

<p>Lesen Sie nach M&ouml;glichkeit das <a
href="ftp://ftp.digital.com/pub/DEC/axppci/design_guide.ps" target="_top">OEM
manual</a>.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel einer NoName mu&szlig; die folgenden
Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_AXPPCI_33
cpu     EV4
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN191" name="AEN191">2.3.2. Universal Desktop Box (UDB oder
``Multia'')</a></h4>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Die Multia enth&auml;lt entweder eine Intel- oder Alpha-CPU. Hier
wird aus offensichtlichen Gr&uuml;nden nur die Alpha-Variante betrachtet.</p>
</blockquote>
</div>

<p>Die Multia ist ein kleiner Desktop-Rechner, der als eine Art Personal Workstation
gedacht war. Es gibt viele verschiedene Varianten, Sie sollten also genau auf die Details
achten.</p>

<p>Features:</p>

<ul>
<li>
<p>21066 Alpha CPU mit 166 MHz oder 21066A CPU mit 233 MHz</p>
</li>

<li>
<p>on-board Bcache / L2 cache: COAST-&auml;hnliches 256 KByte Cache Modul; die Variante
mit 233 MHz hat 512 KByte Cache; die Variante mit 166 MHz besitzt 256 KByte Cache, der
fest eingebaut ist.</p>
</li>

<li>
<p>Anschl&uuml;sse f&uuml;r PS/2 Maus &#38; Tastatur</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>Busbreite: 64 Bit</p>
</li>

<li>
<p>PS/2 72 Pin 36 Bit Fast Page Mode SIMMs</p>
</li>

<li>
<p>70ns oder schneller</p>
</li>

<li>
<p>m&uuml;ssen paarweise installiert werden</p>
</li>

<li>
<p>4 SIMM Steckpl&auml;tze</p>
</li>

<li>
<p>benutzt ECC</p>
</li>
</ul>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>Floppy-Anschlu&szlig;</p>
</li>

<li>
<p>Intel 82378ZB PCI-ISA-Bridge</p>
</li>

<li>
<p>1 on-Board 21040 f&uuml;r 10MBit Ethernet mit AUI und 10Base2 Anschl&uuml;ssen</p>
</li>

<li>
<p>Steckpl&auml;tze:</p>

<ul>
<li>
<p>1 32 Bit PCI Steckplatz</p>
</li>

<li>
<p>2 PCMCIA Steckpl&auml;tze</p>
</li>
</ul>
</li>

<li>
<p>on-board Crystal CS4231 oder AD1848 Soundchip</p>
</li>

<li>
<p>on-board Fast SCSI, nutzt einen Symbios 53C810[A] Chip auf der PCI Riser Card</p>
</li>
</ul>

<p>Das Flash ROM der Multia ist gro&szlig; genug, um SRM und ARC aufzunehmen und die
Umschaltung der Software zu erm&ouml;glichen.</p>

<p>Die in die Multia eingebaute TGA-Grafikkarte kann von FreeBSD <span
class="emphasis"><i class="EMPHASIS">nicht</i></span> als Konsole genutzt werden. Sie
m&uuml;ssen eine serielle Konsole verwenden.</p>

<p>Die Multia hat nur einen 32 Bit PCI Steckplatz, der nur f&uuml;r eine kleine PCI-Karte
genutzt werden kann. Wenn Sie darauf verzichten, k&ouml;nnen Sie eine 3.5&quot;
Festplatte einbauen. Das Montagematerial k&ouml;nnte Ihrer Multia beiliegen. Allerdings
sollten Sie auf den Einbau der Festplatte <span class="emphasis"><i
class="EMPHASIS">verzichten</i></span>, da das Netzteil und die K&uuml;hlung
unterdimensioniert sind.</p>

<p>Die beiden PCMCIA Steckpl&auml;tze der Multia werden momentan nicht von FreeBSD
unterst&uuml;tzt.</p>

<p>Wenn Sie planen, eine schnellere CPU einzubauen, sollen Sie pr&uuml;fen, ob die CPU
gesockelt ist. Bei den kleineren Multias ist sie normalerweise eingel&ouml;tet.</p>

<p>Die Multia besitzt zwei serielle Schnittstellen, allerdings sind diese auf einem
25-poligen sub-D Anschlu&szlig; zusammengefa&szlig;t. In der Multia-FAQ finden Sie eine
Anleitung zum Bau eines Y-Kabels, mit dem Sie beide Anschl&uuml;sse nutzen
k&ouml;nnen.</p>

<p>Sie k&ouml;nnen die Multia von Diskette booten, allerdings k&ouml;nnen Sie dabei auf
Probleme sto&szlig;en. Der typische Fehler ist:</p>

<pre class="SCREEN">
*** Soft Error - Error #10 - FDC: Data overrun or underrun
</pre>

<p>Dies ist kein Problem von FreeBSD, es ist ein Fehler im SRM. Die einfachste
M&ouml;glichkeit bei der Installation von FreeBSD ist, von einem SCSI CDROM zu
booten.</p>

<p>Einige Anwender mu&szlig;ten manchmal <b class="KEYCAP">Control</b>-<b
class="KEYCAP">Alt</b>-<b class="KEYCAP">Del</b> dr&uuml;cken, um den SRM aufzuwecken.
Ich habe diese Situation noch nie erlebt; aber es kommt auf einen Versuch an, wenn Sie
nach dem Einschalten von einem schwarzen Bildschirm begr&uuml;&szlig;t werden.</p>

<p>Audio funktioniert beim Crystal CS4231 Chip einwandfrei, wenn Sie den <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=pcm&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">pcm</span>(4)</span></a>-Treiber
benutzen und die folgende Zeile in der Konfigurationsdatei f&uuml;r Ihren Kernel
haben:</p>

<pre class="PROGRAMLISTING">
device pcm
</pre>

<p>Die Audio-Hardware nutzt Port 0x530, IRQ 9 und DRQ 3. Sie m&uuml;ssen in <tt
class="FILENAME">device.hints</tt> zus&auml;tzlich noch <var class="LITERAL">flags
0x15</var> angeben.</p>

<p>Bis jetzt hat es noch niemand geschafft, einer Multia mit einem AD1848 einen Ton zu
entlocken.</p>

<p>Beim Test der Audio-Wiedergabe wird man daran erinnert, da&szlig; die 166 MHz CPU
nicht schnell ist. MP3s k&ouml;nnen nur mit 22 kHz fehlerfrei wiedergegeben werden.</p>

<p>Multis sind daf&uuml;r bekannt, da&szlig; sie gerne den Hitzetod sterben. Das extrem
kompakte Geh&auml;use erlaubt kaum Luftzufuhr. Sie sollten Sie Multia senkrecht in ihrem
St&auml;nder stellen, nicht waagerecht (``Pizzaschachtel''). Es ist eine sehr gute Idee,
den L&uuml;fter durch ein leistungsst&auml;rkeres Modell zu ersetzen. Weiterhin
k&ouml;nnen Sie eines der Kabel zum Temperatursensor durchschneiden. Danach wird der
L&uuml;fter mit voller Drehzahl (und Lautst&auml;rke) betrieben. H&uuml;ten Sie sich vor
PCI-Karten, die sehr viel Strom brauchen. Falls Ihr System trotzdem sterben sollten,
k&ouml;nnten Ihnen die Multia-Heat-Death Seiten auf der <a href="http://www.netbsd.org/"
target="_top">Website von NetBSD</a> bei der Reparatur weiterhelfen.</p>

<p>Die Intel 82378ZB PCI to ISA Bridge erm&ouml;glicht es, eine IDE-Festplatte zu
benutzen. Sie ben&ouml;tigen die folgende Zeile in der Konfigurationsdatei Ihres
angepa&szlig;ten Kernels:</p>

<pre class="PROGRAMLISTING">
device ata
</pre>

<p>Der IDE-Anschlu&szlig; nutzt IRQ 14</p>

<p>Der IDE-Anschlu&szlig; ist f&uuml;r die 2.5&quot; Laptop-Festplatten ausgelegt. Eine
3.5&quot; IDE-Festplatte pa&szlig;t nicht in das Geh&auml;use, solange Sie nicht den
PCI-Steckplatz opfern. Leider kann die SRM Konsole nicht von einer IDE-Platte booten. Sie
ben&ouml;tigen also eine SCSI-Platte als Bootdevice.</p>

<p>Falls Sie die interne Festplatte auswechseln m&uuml;ssen: Das interne Kabel vom PCI
Riser Board zur <span class="emphasis"><i class="EMPHASIS">2.5&quot;</i></span>
Festplatte ist schmaler als ein normales SCSI-Flachbandkabel. Andernfalls w&uuml;rde es
nicht auf die 2.5&quot; Festplatte passen. Allerdings gibt es auch riser cards mit einem
Anschlu&szlig; f&uuml;r ein normales SCSI-Kabel, das auf eine normale SCSI-Platte
pa&szlig;t.</p>

<p>Allerdings sollten Sie vor dem Einbau einer weiteren Festplatte absehen. Benutzen Sie
den externen SCSI-Anschlu&szlig; und bauen Sie die Festplatte in ein externes
Geh&auml;use ein. Die Temperatur in der Multia ist schon hoch genug. In den meisten
F&auml;llen hat Ihre Multia einen 50 poligen High-Density Anschlu&szlig;, allerdings gab
es auch Varianten der Multia, die keine Festplatte hatten und evtl. auch &uuml;ber keinen
externen SCSI-Anschlu&szlig; verf&uuml;gen. Achten Sie beim Kauf darauf.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel einer Multia mu&szlig; die folgenden
Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_AXPPCI_33
cpu     EV4
</pre>

<p>Wichtige Informationen zur Multia finden Sie unter <a
href="http://www.netbsd.org/Ports/alpha/multiafaq.html"
target="_top">http://www.netbsd.org/Ports/alpha/multiafaq.html</a> und <a
href="http://www.brouhaha.com/~eric/computers/udb.html"
target="_top">http://www.brouhaha.com/~eric/computers/udb.html</a>.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN281" name="AEN281">2.3.3. Personal Workstation
(``Miata'')</a></h4>

<p>Die Miata ist einem kleinen Towergeh&auml;use untergebracht, da&szlig; unter dem
Schreibtisch verschwinden kann. Es gibt diverse Varianten der Miata. Die erste Miata war
das Modell MX5. Da die Hardware dieser Maschinen eine Reihe von Designschw&auml;chen
zeigte, wurde die Maschine &uuml;berarbeitet, das Ergebnis war die MiataGL. Leider kann
man die beiden Varianten nicht durch einen einfachen Blick auf das Geh&auml;use
unterscheiden. Die einfachste Methode ist ein Blick auf die R&uuml;ckseite des
Geh&auml;uses. Wenn sich dort zwei USB-Anschl&uuml;sse befinden, handelt es sich um eine
MiataGL. Auf dem Markt ist jedoch &uuml;berwiegend die MX5 zu finden.</p>

<p>Der offizielle Systemname lautet ``Personal Workstation 433a''. Der Begriff Personal
Workstation ist etwas unhandlich und wird daher meist als PWS abgek&uuml;rzt. Der Name
besagt, da&szlig; die Maschine eine 433 MHz-CPU hat und f&uuml;r den Betrieb unter WinNT
Workstation vorgesehen war (erkenntlich am anschlie&szlig;enden a). Die f&uuml;r den
Betrieb mit Tru64 Unix oder OpenVMS gedachten Systeme tragen Bezeichnungen wie ``433au''.
WinNT-Miatas enthalten in der Regel ab Werk ein IDE CDROM-Laufwerk. Verallgemeinert
gesehen, folgen die Systemnamen dem Schema PWS[433,500,600]a[u].</p>

<p>Au&szlig;erdem gab es auch eine Variante, bei der die CPU mit einem speziellen System
von Kyrotech gek&uuml;hlt wurde; diese Maschinen besitzen ein etwas anderes
Geh&auml;use.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21164A EV56 Alpha CPU mit 433, 500 oder 600 MHz</p>
</li>

<li>
<p>21174 Core Logic (``Pyxis'') Chipsatz</p>
</li>

<li>
<p>on-board Bcache / L3 cache: 0, 2 oder 4 MByte (benutzt ein Cache Modul)</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>Busbreite: 128 Bits, ECC</p>
</li>

<li>
<p>ungepufferte 72 Bit breite SDRAM DIMMs, m&uuml;ssen paarweise installiert werden</p>
</li>

<li>
<p>6 DIMM Sockel</p>
</li>

<li>
<p>Maximaler Speicherausbau: 1.5 GBytes</p>
</li>
</ul>
</li>

<li>
<p>on-board Fast Ethernet:</p>

<ul>
<li>
<p>Die MX5 benutzt je nach Version der PCI Riser Card einen 21142 oder 21143 Ethernet
Chip</p>
</li>

<li>
<p>Die MiataGL benutzt den 21143 Chip</p>
</li>

<li>
<p>der Anschlu&szlig; ist entweder 10/100 MBit UTP, oder 10 MBit UTP/BNC</p>
</li>
</ul>
</li>

<li>
<p>2 on-board [E]IDE Kan&auml;le, basierend auf dem CMD646 (MX5) oder dem Cypress 82C693
(MiataGL)</p>
</li>

<li>
<p>1 Ultra-Wide SCSI Qlogic 1040 [nur MiataGL]</p>
</li>

<li>
<p>2 64-Bit PCI Steckpl&auml;tze</p>
</li>

<li>
<p>3 32-Bit PCI Steckpl&auml;tze (hinter einer DEC PCI-PCI Bridge)</p>
</li>

<li>
<p>3 ISA Steckpl&auml;tze (teilen sich den Platz mit den 32 Bit PCI Steckpl&auml;tzen,
angeschlossen &uuml;ber eine Intel 82378IB PCI to ISA Bridge)</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse mit 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>PS/2 Anschlu&szlig; f&uuml;r Tastatur und Maus</p>
</li>

<li>
<p>USB Anschlu&szlig; [nur MiataGL]</p>
</li>

<li>
<p>eingebauter ESS1888 Soundchip</p>
</li>
</ul>

<p>Die Elektronik der Miata ist auf zwei Platinen untergebracht. Das untere Board
befindet sich auf dem Geh&auml;useboden und tr&auml;gt die PCI- und ISA-Steckpl&auml;tze,
den Soundchip, und &auml;hnliches. Die obere Platine tr&auml;gt die CPU, den Pyxis Chip,
den Speicher, usw. Beachten Sie, da&szlig; die MX5 und die MiataGL zwei verschiedene PCI
Riser Boards verwenden. Sie k&ouml;nnen also nicht einfach eine Platine mit einer MiataGL
CPU einsetzen, sondern Sie ben&ouml;tigen das passende riser board. Angeblich kann man
den Riser aus einer MX5 mit der CPU-Platine der MiataGL benutzen, diese Konfiguration ist
aber ungetestet und wird nicht unterst&uuml;tzt. Alle anderen Teile der Systeme
(Geh&auml;use, Kabel, etc.) sind bei der MX5 und der MiataGL identisch.</p>

<p>Die MX5 hat Probleme mit DMA-Transfers von und zu den beiden 64-Bit PCI
Steckpl&auml;tzen, wenn dieser DMA die Grenze einer Speicherseite &uuml;berschreitet. Da
der PCI-PCI Bridge Chip diese Transfers nicht erlaubt, sind die 32 Bit Steckpl&auml;tze
davon nicht betroffen. Befindet sich in einem der 64 Bit Steckpl&auml;tzen eine dem SRM
unbekannte Karte, startet das System nicht. Nur Karten, von denen der SRM wei&szlig;,
da&szlig; sie funktionieren (``known good''), k&ouml;nnen in den 64 Bit Steckpl&auml;tzen
genutzt werden.</p>

<p>Wenn Sie den SRM &uuml;berlisten wollen, k&ouml;nnen Sie an der Eingabeaufforderung
<kbd class="USERINPUT">set pci_device_override</kbd> eingeben. Wenn Ihre Daten danach
mysteri&ouml;se Fehler aufweisen, d&uuml;rfen Sie sich allerdings nicht beschweren.</p>

<p>Der vollst&auml;ndige Befehl lautet:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET PCI_DEVICE_OVERRIDE <var
class="REPLACEABLE">&lt;vendor_id&gt;</var><var
class="REPLACEABLE">&lt;device_id&gt;</var></kbd>
</pre>

<p>Zum Beispiel:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET PCI_DEVICE_OVERRIDE 88c15333</kbd>
</pre>

<p>Der radikalste Ansatz ist:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET PCI_DEVICE_OVERRIDE -1</kbd>
</pre>

<p>Damit wird die &Uuml;berpr&uuml;fung der PCI ID komplett abgeschaltet und Sie
k&ouml;nnen jede beliebige PCI-Karte installieren, ohne da&szlig; deren PCI ID
gepr&uuml;ft wird. Damit dies funktioniert, brauchen Sie allerdings eine halbwegs
aktuelle Version des SRM.</p>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Sie handeln auf eigenes Risiko..</p>
</blockquote>
</div>

<p>Der Kernel von FreeBSD meldet Ihnen, wenn er den fehlerhaften Chip von Pyxis
findet:</p>

<pre class="SCREEN">
Sep 16 18:39:43 miata /kernel: cia0: Pyxis, pass 1
Sep 16 18:39:43 miata /kernel: cia0: extended capabilities: 1&lt;BWEN&gt;
Sep 16 18:39:43 miata /kernel: cia0: WARNING: Pyxis pass 1 DMA bug; no bets...
</pre>

<p>Bei einer MiataGL erscheint:</p>

<pre class="SCREEN">
Jan  3 12:22:32 miata /kernel: cia0: Pyxis, pass 1
Jan  3 12:22:32 miata /kernel: cia0: extended capabilities: 1&lt;BWEN&gt;
Jan  3 12:22:32 miata /kernel: pcib0: &lt;2117x PCI host bus adapter&gt; on cia0
</pre>

<p>Die MiataGL hat die DMA Probleme der MX5 nicht. PCI Karten, die der SRM der XM5
moniert, wenn Sie im 64 Bit Steckplatz installiert werden, werden kommentarlos vom SRM
der MiataGL akzeptiert.</p>

<p>Die neueren Versionen des Mainboards f&uuml;r die MX5 enthalten eine
Hardware-Korrektur f&uuml;r den Fehler. Der SRM hat keine Informationen &uuml;ber das ECO
und wird sich auch weiterhin &uuml;ber unbekannte Karten beschweren. Der FreeBSD Kernel
hat &uuml;brigens das gleiche Problem.</p>

<p>Der Miata SRM kann vom IDE CDROM booten. Sowohl die Miata GL als auch die MX5
k&ouml;nnen von der IDE Festplatte booten, Sie k&ouml;nnen also das gesamte
FreeBSD-Dateisystem dort ablegen. Die Geschwindigkeit der Festplatte in einer MX5 liegt
bei ungef&auml;hr 14 MByte/sec (wenn die Festplatte schnell genug ist). Der CMD646 Chip
der Miata unterst&uuml;tzt maximal WDMA2, der UDMA-Modus ist zu fehlerhaft.</p>

<p>Die Miata MX5 verwendet im Allgemeinen einen auf dem Qlogic 1040 basierenden SCSI
Kontroller. Der SRM kann davon booten. Bitte beachten Sie, da&szlig; Sie von einem
Adaptec-Kontroller <span class="emphasis"><i class="EMPHASIS">nicht</i></span> booten
k&ouml;nnen.</p>

<p>Der PCI-PCI Bridge Chip auf der Riser Card der MiataGL ist schneller als der Chip auf
der Riser Card der MX5. Einige Riser Cards f&uuml;r die MX5 haben sogar den <span
class="emphasis"><i class="EMPHASIS">gleichen</i></span> Chip wie die MiataGL. Es gibt
also jede Menge Abwechslung.</p>

<p>Nicht alle VGA-Karten funktionieren hinter der PCI-PCI Bridge. Das typische Symptom
ist ein fehlendes Bild. Um dieses Problem zu beheben, sollten Sie die Karten einfach
``vor'' die Bridge setzen, also in einen der 64 Bit PCI Steckpl&auml;tze. Werden
Grafikkarten in einem 64 Bit Steckplatz betrieben, zeigen sie normalerweise auch eine
deutlich bessere Performance.</p>

<p>Sowohl die MX5 als auch die MiataGL haben einen Soundchip vom Typ ESS1888 on-board. Er
emuliert einen SoundBlaster und wird unterst&uuml;tzt, wenn Sie die folgende Zeile in der
Konfigurationsdatei Ihres angepa&szlig;ten Kernels haben:</p>

<pre class="PROGRAMLISTING">
device    pcm
device  sbc
</pre>

<p>Falls in Ihrer Miata eines der optionalen Cache Module steckt, sollten Sie
sicherstellen, da&szlig; es fest eingesteckt ist. Ein lockeres Modul f&uuml;hrt zu
seltsam erscheinenden Abst&uuml;rzen (nicht verwunderlich, aber kommen Sie erst einmal
darauf, wenn Sie einen mysteri&ouml;sen Fehler suchen). Die Cache Module der MX5 und
MiataGL sind identisch.</p>

<p>Wenn Sie das 2 MByte Cache Modul installieren, wird Ihr System zwar rund 10-15%
schneller (wenn man die Zeit f&uuml;r ein buildworld mi&szlig;t). Gleichzeitig <span
class="emphasis"><i class="EMPHASIS">sinkt</i></span> aber die Bandbreite bei
Lesezugriffen auf die 64 Bit PCI Karten via PCI DMA. Bei einem Test mit einer 64 Bit
Karte von Myrinet sank die Geschwindigkeit von 149 MByte/sec auf 115 MByte/sec. Sie
sollten diese Tatsache im Hinterkopf behalten, wenn Sie f&uuml;r Ihr Einsatzgebiet extrem
schnelle 64 Bit PCI Karten ben&ouml;tigen.</p>

<p>Obwohl es m&ouml;glich ist, bis zu 1.5 GByte Speicher einzubauen, kann FreeBSD nur 1
GByte nutzen, da die DMA-Routinen den Speicher oberhalb 1 GByte nicht korrekt
ansprechen.</p>

<p>Der Wechsel zu einer schnelleren CPU ist einfach, wechseln Sie die CPU, und stellen an
dem DIP-Schalter f&uuml;r den Takt-Multiplikator die Geschwindigkeit der neuen CPU
ein.</p>

<p>Wenn Sie FreeBSD beenden und danach die folgende Fehlermeldung erhalten</p>

<pre class="SCREEN">
ERROR: scancode 0xa3 not supported on PCXAL
</pre>

<p>sollten Sie die SRM Firmware auf V7.2-1 (oder neuer) aktualisieren. Diese Version
erschien zuerst auf der ``Firmware Update CD V5.7'', ist aber auch auf <a
href="http://www.compaq.com/" target="_top">http://www.compaq.com/</a> erh&auml;ltlich.
Damit wird dieser Fehler des SRM sowohl bei der Miata MX5 als auch bei der Miata GL
behoben.</p>

<p>USB wird ab FreeBSD 4.1 unterst&uuml;tzt.</p>

<p>Bevor Sie das Geh&auml;use &ouml;ffnen, m&uuml;ssen Sie auf jeden Fall den Netzstecker
ziehen. Einige Komponenten werden mit Strom versorgt, <span class="emphasis"><i
class="EMPHASIS">obwohl</i></span> der Netzschalter auf aus steht.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel einer Miata mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_ST550
cpu     EV5
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN390" name="AEN390">2.3.4. Evaluation Board 64
Systeme</a></h4>

<p>Im Rahmen der Bem&uuml;hungen, die Alpha CPU popul&auml;rer zu machen, wurden von DEC
eine ganze Reihe sogenannter Evaluation Boards herausgegeben. Zu diesen Systemen
geh&ouml;ren EB64, EB64+, und das AlphaPC64 (``Cabriolet''). Ein weiteres Mitglied dieser
Familie ist das nicht von DEC stammende Aspen Alpine. Die zur EB64 Familie
geh&ouml;renden Evaluation Boards weisen folgende Eigenschaften auf:</p>

<ul>
<li>
<p>21064 oder 21064A CPU, 150 bis 275 MHz</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>Busbreite: 128 Bit</p>
</li>

<li>
<p>PS/2 Fast Page Mode SIMM, 72polig, 33 Bit</p>
</li>

<li>
<p>70ns oder schneller</p>
</li>

<li>
<p>Mu&szlig; in Vierergruppen installiert werden</p>
</li>

<li>
<p>8 Steckpl&auml;tze f&uuml;r SIMMs</p>
</li>

<li>
<p>benutzt Parit&auml;t</p>
</li>
</ul>
</li>

<li>
<p>Bcache / L2 cache: 0 KByte, 512 KByte, 1 MByte oder 2 MByte</p>
</li>

<li>
<p>21072 (``APECS'') Chipsatz</p>
</li>

<li>
<p>Intel 82378ZB PCI to ISA Bridge Chip (``Saturn'')</p>
</li>

<li>
<p>zwei serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>ein paralleler Anschlu&szlig;</p>
</li>

<li>
<p>Symbios 53C810 Fast-SCSI (nicht beim Alpha PC64)</p>
</li>

<li>
<p>IDE Anschlu&szlig; (nur Alpha PC64)</p>
</li>

<li>
<p>10 MBit Ethernet eingebaut (nicht beim Alpha PC64)</p>
</li>

<li>
<p>2 PCI Steckpl&auml;tze (vier beim Alpha PC64)</p>
</li>

<li>
<p>3 ISA Steckpl&auml;tze</p>
</li>
</ul>

<p>Das Aspen Alpine unterscheidet sich zwar geringf&uuml;gig vom EB64+, ist aber
&auml;hnlich genug, um mit dem SRM EPROM eines EB64+ betrieben werden zu k&ouml;nnen. Das
Aspen Alpine hat keinen Ethernet-Anschlu&szlig;, daf&uuml;r aber 3 statt 2 PCI
Steckpl&auml;tzen. Weiterhin verf&uuml;gt es &uuml;ber 2 MByte Cache Speicher, der fest
eingel&ouml;tet ist sowie Jumper zur Auswahl der SIMM-Geschwindigkeit (60 ns, 70 ns, 80
ns).</p>

<p>Sie k&ouml;nnen auch SIMMs mit 36 Bit einsetzen, in diesem Fall bleiben 3 Bit
ungenutzt. Beachten Sie, da&szlig; die Systeme Fast Page Mode Speicher ben&ouml;tigen,
und nicht EDO Speicher.</p>

<p>Das Programm f&uuml;r die SRM Konsole des EB64+ steckt in einem mit UV-Licht
l&ouml;schbaren EPROM, einfache Updates via Flash sind bei der EB64+ also nicht
m&ouml;glich. Aber die aktuellste Version des SRM f&uuml;r die EB64+ ist ohnehin stark
veraltet.</p>

<p>Der SRM der EB64+ kann sowohl vom 53C810 als auch vom Qlogic1040 SCSI Kontroller
booten. Leider gibt es hinsichtlich der Verwendung von Ultra SCSI Ger&auml;ten ein
Probleme mit dem Qlogic. Die Firmware, welche von der SRM auf den Qlogic geladen wird,
ist sehr alt. Da es keine Updates f&uuml;r den SRM des EB64+ gibt, l&auml;&szlig;t sich
dies auch nicht &auml;ndern. Man kann zwar eine neuere Version der Qlogic Firmware in den
FreeBSD Kernel einbinden, da es den Kernel aber um mehrere hundert KByte aufbl&auml;ht,
ist dies un&uuml;blich. Erst ab FreeBSD 4.1 ist die Firmware in einem nachladbaren Modul
enthalten. Das alles kann dazu f&uuml;hren, da&szlig; Sie einen anderen Kontroller als
den Qlogic f&uuml;r ihr Bootdevice benutzen m&uuml;ssen.</p>

<p>Die AlphaPC64 Systeme werden normalerweise mit der Firmware f&uuml;r die ARC Konsole
ausgeliefert. Die Software f&uuml;r die SRM Konsole kann von Diskette in das Flash ROM
geladen werden.</p>

<p>Die SRM Konsole kann nicht vom IDE Anschlu&szlig; des AlphaPC64 booten. Wenn Sie den
IDE-Anschlu&szlig; verwenden wollen, mu&szlig; in der Konfigurationsdatei f&uuml;r den
angepa&szlig;ten Kernel die folgende Zeile stehen:</p>

<pre class="PROGRAMLISTING">
device ata
</pre>

<p>Der IDE-Anschlu&szlig; nutzt IRQ 14.</p>

<p>Denken Sie daran, da&szlig; Sie ein Netzteil brauchen, das 3.3 Volts bereitstellt
(f&uuml;r die CPU).</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; f&uuml;r Maschinen mit EB64+ die
folgenden Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_EB64PLUS
cpu     EV4
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN445" name="AEN445">2.3.5. Evaluation Board 164 (``EB164,
PC164, PC164LX, PC164SX'') Familien</a></h4>

<p>Das EB164 ist eine neuere Version des evaluation board und verwendet eine 21164A CPU.
Diese Version dient als Grundlage diverser Varianten, die zum Teil von OEM Herstellern
genutzt werden. Samsung entwickelte eine eigene Variante mit dem Namen PC164LX, die nur
&uuml;ber 32 Bit PCI Steckpl&auml;tze verf&uuml;gt, w&auml;hrend das Original von Digital
64 Bit PCI bietet.</p>

<ul>
<li>
<p>21164A, verschiedene Geschwindigkeiten [EB164, PC164, PC164LX]</p>
</li>

<li>
<p>21164PC [nur auf dem PC164SX]</p>
</li>

<li>
<p>21171 (Alcor) Chipsatz [EB164]</p>

<p>21172 (Alcor2) Chipsatz [PC164]</p>

<p>21174 (Pyxis) Chipsatz [164LX, 164SX]</p>
</li>

<li>
<p>Bcache / L3 cache: das EB164 benutzt spezielle cache-SIMMs</p>
</li>

<li>
<p>Speicherbandbreite: 128 Bit / 256 Bit</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>PS/2 SIMMs, in Gruppen zu 4 oder 8 Modulen</p>
</li>

<li>
<p>36 Bit, Fast Page Mode, ECC, [EB164 / PC164]</p>
</li>

<li>
<p>Paare aus SDRAM DIMMs, ECC [PC164SX / PC164LX]</p>
</li>
</ul>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>

<li>
<p>Kontroller f&uuml;r Diskettenlaufwerk</p>
</li>

<li>
<p>paralleler Anschlu&szlig;</p>
</li>

<li>
<p>32 Bit PCI</p>
</li>

<li>
<p>64 Bit PCI [nur in einigen Modellen]</p>
</li>

<li>
<p>ISA slots hinter einem Intel 82378ZB PCI to ISA Bridge Chip</p>
</li>
</ul>

<p>Die Benutzung von 8 SIMMs, um einen 256 Bit breiten Speicher zu erhalten, resultiert
in interessanten Geschwindigkeitsvorteilen gegen&uuml;ber einem 4 SIMM/128 Bit breiten
Speicher. Nat&uuml;rlich m&uuml;ssen alle 8 SIMMs vom gleichen Typ sein, damit dies
funktioniert; au&szlig;erdem mu&szlig; das System explizit auf die Nutzung des 8 SIMM
Modus konfiguriert werden. Sie m&uuml;ssen 8 SIMMs benutzen, 4 SIMMs auf 2 B&auml;nke
verteilt funktioniert nicht. Bei der PC164 kann mit 8 128 MByte SIMMs ein maximaler
Speicherausbau von 1 GByte erreicht werden. Das Handbuch behauptet, der maximale
Speicherausbau betrage 512 MByte.</p>

<p>Der SRM kann von Qlogic 10xx Karten oder dem Symbios 53C810[A] booten. Neuere
Versionen des Symbios 810 wie der Symbios 810AE werden vom SRM des PC164 nicht erkannt.
Der SRM der PC164 unterst&uuml;tzt Hostadapter auf Basis des Symbios 53C895 scheinbar
auch nicht (getestet mit einem Tekram DC-390U2W). Allerdings gibt es Berichte, wonach
No-Name Symbios 53C985 Karten funktionieren sollen. Karten wie der Tekram DC-390F
(basiert auf dem Symbios875) funktionieren offenbar auf der PC164, allerdings scheint es
hier leider subtile Abh&auml;ngigkeiten von der jeweiligen Revision des Chips und des
Mainboards zu geben.</p>

<p>Von mit dem Symbios 53C825[a] best&uuml;ckten Karten kann ebenfalls gebootet werden.
Der Diamond FirePort baut zwar ebenfalls auf Chips von Symbios auf, hingegen kann der SRM
des PC164SX davon nicht booten. Es gibt Berichte, da&szlig; die PC164SX problemlos von
Karten mit Symbios825, Symbios875, Symbios895 und Symbios876 booten kann. Es gibt
ebenfalls Erfolgsmeldungen f&uuml;r Adaptec 2940U und 2940UW (verifiziert mit SRM
V5.7-1). Adaptec 2930U2 und 2940U2[W] funktionieren nicht.</p>

<p>Der SRM der 164LX und 164SX kann ab der Firmware Version 5.8 von Hostadaptern der
Adaptec 2940-Familie booten.</p>

<p>Kurz zusammengefa&szlig;t: Die Maschinen dieser Modellreihe sind in Punkto
Kompatibilit&auml;t der SCSI-Kontroller eine echte Herausforderung.</p>

<p>Die 164SX unterst&uuml;tzt maximal 1 GByte RAM. Es gibt Berichte, da&szlig; eine
Best&uuml;ckung mit vier normalen 256MB PC133 ECC DIMMs problemlos funktioniert. Zur Zeit
ist nicht bekannt, ob auch 512MB DIMMs genutzt werden k&ouml;nnen.</p>

<p>Die 164SX hat Probleme mit einigen PCI Bridge Chips, was zu SRM Fehlern und Kernel
Panics f&uuml;hren kann. Dies scheint davon abzuh&auml;ngen, ob die SRM Konsole den Chip
unterst&uuml;tzt und korrekt initialisieren kann. Das eingebaute IDE Interface der 164SX
ist sehr langsam, durch die Verwendung einer Karte von Promise kann man die
Geschwindigkeit um den Faktor 3-4 erh&ouml;hen.</p>

<p>Der SRM der PC164 scheint ab und zu seine Einstellungen zu vergessen. Um ohne den
Verlust von Einstellungen auszukommen, soll man, aktuellen Annahmen nach, erst auf SRM
4.x downgraden und dann auf 5.x upgraden. Ein Fehler welcher z.B. auffiel war:</p>

<pre class="SCREEN">
ERROR: ISA table corrupt!
</pre>

<p>Nach einem Downgrade auf SRM4.9, einem</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">ISACFG -INIT</kbd>
</pre>

<p>gefolgt von einem</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">INIT</kbd>
</pre>

<p>war das Problem gel&ouml;st. Einige der Besitzer der PC164 berichteten, da&szlig;
dieses Problem noch nie auftrat.</p>

<p>Beim PC164SX gibt es im AlphaBIOS eine Einstellung, da&szlig; beim n&auml;chsten
Einschalten des Systems die SRM Konsole genutzt werden soll. Leider scheint diese
Einstellung ohne Wirkung zu bleiben. Mit anderen Worten, es wird immer das AlphaBIOS
gebootet. Unabh&auml;ngig von dem was Sie einstellen. Des Problems L&ouml;sung ist, das
ROM der Konsole mit dem SRM Code f&uuml;r die PC164SX zu &uuml;berschreiben. Dadurch wird
das AlphaBIOS &uuml;berschrieben und Sie erhalten die gew&uuml;nschte SRM Konsole. Der
SRM Code ist auf der Webseite von Compaq verf&uuml;gbar.</p>

<p>Bei der 164LX kann nur die SRM Konsole oder das AlphaBIOS verwendet werden, da das
Flash ROM zu klein ist, um beide zur gleichen Zeit aufzunehmen.</p>

<p>Die PC164 kann von einer IDE Festplatte booten, wenn der SRM aktuell genug ist.</p>

<p>Das EB164 ben&ouml;tigt ein Netzteil, da&szlig; 3.3 Volt zur Verf&uuml;gung stellt.
Bei der PC164 fehlt allerdings das von ATX Netzteilen zum Einschalten ben&ouml;tigte
PS_ON Signal. Ein kleiner Schalter, der dieses Signal mit Masse verbindet, erlaubt Ihnen
die Benutzung eines normalen ATX Netzteils.</p>

<p>Die Konfigurationsdatei eines angepa&szlig;ten Kernels f&uuml;r Maschinen auf
Grundlage des EB164 mu&szlig; die folgenden Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options         DEC_EB164
cpu             EV5
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN509" name="AEN509">2.3.6. AlphaStation 200 (``Mustang'') und
400 (``Avanti'') Familien</a></h4>

<p>Die Digital AlphaStation 200 und 400 Systeme sind fr&uuml;he, leistungsschwache,
PCI-basierte Workstations. Die Modellreihen 200 und 250 sind Desktops, die 400er sind
Mini-Tower.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21064 oder 21064A CPU, Geschwindigkeit 166 bis 333 MHz</p>
</li>

<li>
<p>DECchip 21071-AA core logic Chipsatz</p>
</li>

<li>
<p>Bcache / L2 cache: 512 Kbytes (Modelle 200 und 400) oder 2048 KByte (Modell 250)</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>Busbreite 64 Bit</p>
</li>

<li>
<p>8 bis 384 MByte RAM</p>
</li>

<li>
<p>Fast Page DRAM, Zugriffszeit maximal 70 ns</p>
</li>

<li>
<p>in drei Paaren (Modelle 200 und 400)</p>
</li>

<li>
<p>in zwei Vierergruppen (Modell 250)</p>
</li>

<li>
<p>das Speichersystem verwendet Parit&auml;t</p>
</li>
</ul>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>

<li>
<p>zwei serielle Anschl&uuml;sse, 16550</p>
</li>

<li>
<p>ein paralleler Anschlu&szlig;</p>
</li>

<li>
<p>Anschlu&szlig; f&uuml;r ein Diskettenlaufwerk</p>
</li>

<li>
<p>32 Bit PCI Steckpl&auml;tze (3 beim Modell AS400, 2 bei den Modellen AS200 und
250)</p>
</li>

<li>
<p>ISA Steckpl&auml;tze (4 beim Modell AS400-series, 2 bei den Modellen AS200 und 250,
einige der ISA und PCI Steckpl&auml;tze &uuml;berlappen physikalisch)</p>
</li>

<li>
<p>eingebauter Ethernet-Anschlu&szlig; auf Grundlage eines 21040 (Modelle 200 und
250)</p>
</li>

<li>
<p>eingebauter Symbios 53c810 Fast SCSI-2 Chip</p>
</li>

<li>
<p>Intel 82378IB (``Saturn'') PCI-ISA Bridge Chip</p>
</li>

<li>
<p>entweder eingebaute TGA oder PCI VGA Grafik (Modellabh&auml;ngig)</p>
</li>

<li>
<p>16 Bit Audio (Modelle 200 und 250)</p>
</li>
</ul>

<p>Die Systeme benutzen SIMMs mit Parit&auml;t, es brauchen allerdings keine 36 Bit
breiten SIMMs zu sein. 33 Bit breite SIMMs reichen aus, 36 Bit breite werden aber auch
akzeptiert. EDO oder 32 Bit breite SIMMs funktionieren nicht. Die Systeme
unterst&uuml;tzen Speichermodule mit 4, 8, 16, 32 und 64 MByte.</p>

<p>Die Audio-Hardware der AS200 und AS250 soll funktionieren, wenn man die folgende Zeile
in die Konfigurationsdatei f&uuml;r den angepa&szlig;ten Kernel einf&uuml;gt:</p>

<pre class="PROGRAMLISTING">
device pcm
</pre>

<p>Die Audio-Hardware nutzt Port 0x530, IRQ 10 und DRQ 3. Sie m&uuml;ssen in <tt
class="FILENAME">device.hints</tt> zus&auml;tzlich noch <var class="LITERAL">flags
0x10011</var> angeben.</p>

<p>Die Modelle AlphaStation 200 und 250 verf&uuml;gen &uuml;ber einen automatischen
SCSI-Terminator. Sobald Sie Kabel an den externen SCSI-Anschlu&szlig; anstecken, wird der
interne Terminator deaktiviert. Das bedeutet nat&uuml;rlich, da&szlig; Sie keine nicht
terminierten Kabel an die Maschine anschlie&szlig;en d&uuml;rfen.</p>

<p>Bei der AlphaStation 400 wird der Terminator &uuml;ber den SRM gesteuert. Falls Sie
externe SCSI-Ger&auml;te verwenden, m&uuml;ssen Sie den folgenden Befehl eingeben:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET CONTROL_SCSI_TERM EXTERNAL</kbd>.
</pre>

<p>Falls nur interne Ger&auml;te vorhanden sind:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET CONTROL_SCSI_TERM INTERNAL</kbd>
</pre>

<p>Die Konfigurationsdatei des Kernels einer AlphaStation-[24][05]00 mu&szlig; die
folgenden Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_2100_A50
cpu     EV4
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN577" name="AEN577">2.3.7. AlphaStation 500 und 600 (``Alcor''
und ``Maverick'' f&uuml;r EV5, ``Bret'' f&uuml;r EV56)</a></h4>

<p>Die AS500 und 600 waren Hochleistungs-Workstations mit einer EV5 CPU, und PCI
Steckpl&auml;tzen. Inzwischen haben die EV6 Maschinen diesen Platz eingenommen. Die AS500
ist ein Desktop mit dunkelblauen Geh&auml;use (TopGun blau), die AS600 ein stabiler
Tower. Die AS600 verf&uuml;gt &uuml;ber ein LCD, mit dessen Hilfe Sie die ersten Phasen
des SRM Starts verfolgen k&ouml;nnen.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21164 EV5 CPU mit 266, 300, 333, 366, 400, 433, 466, oder 500 MHz (AS500) bzw. 266,
300 oder 333 MHz (AS600)</p>
</li>

<li>
<p>21171 oder 21172 (Alcor) core logic Chipsatz</p>
</li>

<li>
<p>Cache:</p>

<ul>
<li>
<p>2 oder 4 Mb L3 / Bcache (AS600, 266 MHz)</p>
</li>

<li>
<p>4 Mb L3 / Bcache (AS600, 300 MHz)</p>
</li>

<li>
<p>2 oder 8 Mb L3 / Bcache (8 Mb nur in der 500 MHz Version)</p>
</li>

<li>
<p>2 to 16 Mb L3 / Bcache (AS600; 3 Steckpl&auml;tze f&uuml;r cache-SIMM)</p>
</li>
</ul>
</li>

<li>
<p>Bandbreite des Speichers: 256 Bit</p>
</li>

<li>
<p>Speicher der AS500:</p>

<ul>
<li>
<p>gepufferte Standard Fast Page Mode DIMMs, 72 Bit</p>
</li>

<li>
<p>8 DIMM Steckpl&auml;tze</p>
</li>

<li>
<p>werden in Vierergruppen installiert</p>
</li>

<li>
<p>maximaler Speicherausbau 1 GB (512 Mb bei der 333 MHz CPU)</p>
</li>

<li>
<p>nutzt ECC</p>
</li>
</ul>
</li>

<li>
<p>Speicher der AS600:</p>

<ul>
<li>
<p>Standard 36 Bit Fast Page Mode SIMMs</p>
</li>

<li>
<p>32 SIMM Steckpl&auml;tze</p>
</li>

<li>
<p>werden in Achtergruppen installiert</p>
</li>

<li>
<p>maximaler Speicherausbau 1 GB</p>
</li>

<li>
<p>nutzt ECC</p>
</li>
</ul>
</li>

<li>
<p>Wide SCSI auf Basis des Qlogic 1020 (1 Bus/Chip bei der AS500, 2 Busse/Chip bei der
AS600)</p>
</li>

<li>
<p>Ethernet auf Basis des 21040, Anschl&uuml;sse f&uuml;r Thinwire und UTP</p>
</li>

<li>
<p>Erweiterungen:</p>

<ul>
<li>
<p>AS500</p>

<ul>
<li>
<p>3 32-Bit PCI Steckpl&auml;tze</p>
</li>

<li>
<p>1 64-Bit PCI Steckpl&auml;tze</p>
</li>
</ul>
</li>

<li>
<p>AS600:</p>

<ul>
<li>
<p>2 32-Bit PCI Steckpl&auml;tze</p>
</li>

<li>
<p>3 64-Bit PCI Steckpl&auml;tze</p>
</li>

<li>
<p>1 PCI/EISA physisch geteilter Steckplatz</p>
</li>

<li>
<p>3 EISA Steckpl&auml;tze</p>
</li>

<li>
<p>1 PCI und 1 EISA Steckplatz sind standardm&auml;&szlig;ig belegt</p>
</li>
</ul>
</li>
</ul>
</li>

<li>
<p>21050 PCI-to-PCI Bridge</p>
</li>

<li>
<p>Intel 82375EB PCI-EISA Bridge (nur AS600)</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>16 Bit Audio, Windows Sound System, in einem speziellen Steckplatz (AS500) bzw. in
einem EISA Steckplatz (AS600, dies ist eine ISA Karte)</p>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>
</ul>

<p>Die ersten Maschinen waren mit Fast SCSI Kontrollern ausger&uuml;stet, sp&auml;tere
Maschinen unterst&uuml;tzen Ultra SCSI. Bei der AS500 wird der eine zur Verf&uuml;gung
stehende SCSI-Bus sowohl f&uuml;r die internen als auch f&uuml;r die externen Ger&auml;te
benutzt. Bei einem Fast SCSI Bus darf der externe Teil des Busses maximal 1.8 Meter lang
sein. Man kann den AS500 Qlogic ISP1020A Chip auch im Ultra Modus betreiben, wenn man
eine SRM Variable setzt. Allerdings h&auml;lt sich FreeBSD an die Empfehlung aus den
Errata zum Qlogic Chip und beschr&auml;nkt die Busgeschwindigkeit auf Fast.</p>

<p>H&uuml;ten Sie sich bei der A500 vor uralten Versionen des SRM. Wenn Ihnen solche
unm&ouml;gliche SCSI-Geschwindigkeiten gemeldet werden, ist es Zeit f&uuml;r ein
Update:</p>

<pre class="PROGRAMLISTING">
cd0 at isp0 bus 0 target 4 lun 0
cd0: &lt;DEC RRD45   DEC 0436&gt; Removable CD-ROM SCSI-2 device
cd0: 250.000MB/s transfers (250.000 MHz, offset 12)
</pre>

<p>Bei der AS600 versorgt einer der Qlogic SCSI Chips die internen Ger&auml;te, der
andere ist f&uuml;r die externen SCSI Ger&auml;te zust&auml;ndig.</p>

<p>Die DIMMs werden bei der AS500 in Vierergruppen installiert, allerdings sind die
B&auml;nke ineinander verzahnt (``physically interleaved layout''). Eine Gruppe von 4
DIMMs besteht also <span class="emphasis"><i class="EMPHASIS">nicht</i></span> aus vier
nebeneinanderliegenden DIMMs. Denken Sie daran, da&szlig; Sie SDRAM DIMMs <span
class="emphasis"><i class="EMPHASIS">nicht</i></span> verwenden k&ouml;nnen.</p>

<p>Bei der AS600 sind die SIMMs auf zwei speziellen Speicherkarten untergebracht. Die
SIMM m&uuml;ssen in Achtergruppen installiert werden und beide Speicherkarten m&uuml;ssen
identisch best&uuml;ckt werden.</p>

<p>Bitte beachten Sie, da&szlig; die AS500 und AS600 EISA Maschinen sind. Sie m&uuml;ssen
also das EISA Configuration Utility (ECU) von Diskette starten, wenn Sie eine EISA-Karte
in das System eingebaut haben oder wenn Sie die Konfiguration der eingebauten I/O
&auml;ndern wollen. Die AS500 hat zwar keinen EISA Steckplatz, trotzdem wird das ECU
verwendet, um die eingebaute Audio-Hardware und &auml;hnliches zu konfigurieren.</p>

<p>Sie k&ouml;nnen die eingebaute Audio-Hardware der AS500 nutzen, wenn Sie die folgende
Zeile in die Konfigurationsdatei f&uuml;r Ihren angepa&szlig;ten Kernel schreiben:</p>

<pre class="PROGRAMLISTING">
device pcm
</pre>

<p>Benutzen Sie danach das ECU, um die Audio-Hardware auf IRQ 10, Port 0x530 und DRQ 0
einzustellen. Sie m&uuml;ssen diese Werte ebenfalls in <tt
class="FILENAME">device.hints</tt> angeben, dazu kommt noch die Angabe flags 0x10011.</p>

<p>Die PCI Steckpl&auml;tze der AS600 zeigen eine Besonderheit. Die AS600 (um genau zu
sein, die PCI Erweiterungskarte mit den SCSI Kontrollern) erlaubt die Einblendung von I/O
Ports nicht, alle Ger&auml;te hinter dieser Karte m&uuml;ssen memory mapping verwenden.
Wenn Sie Probleme haben, die Qlogic SCSI Adapter zum laufen zu bringen, m&uuml;ssen Sie
die folgende Zeile in die Datei <tt class="FILENAME">/boot/loader.rc</tt>
einf&uuml;gen:</p>

<pre class="PROGRAMLISTING">
set isp_mem_map=0xff
</pre>

<p>Eventuell m&uuml;ssen Sie diese Zeile schon im Boot Loader eingeben, bevor Sie den
Kernel f&uuml;r die Installation laden.</p>

<p>Die Konfigurationsdatei f&uuml;r einen angepa&szlig;ten Kernel f&uuml;r die
AlphaStation-[56]00 mu&szlig; die folgenden Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_KN20AA
cpu     EV5
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN687" name="AEN687">2.3.8. AlphaServer 1000 (``Mikasa''),
1000A (``Noritake'') und 800 (``Corelle'')</a></h4>

<p>Die Systeme der Modellreihen AlphaServer 1000 und 800 sind als Server f&uuml;r
Abteilungen konzipiert. Es gibt sie mit einer Reihe verschiedener Geh&auml;use und CPUs.
Ganz allgemein gibt es Maschinen mit der 21064 (EV4) CPU und Maschinen mit der 21164
(EV5) CPU. Die CPU sitzt auf einer eigenen Karte, und der m&ouml;gliche CPU-Typ (EV4 und
EV5) h&auml;ngt vom verwendetem Mainboard ab.</p>

<p>Beim AlphaServer 800 wurde ein deutlich kleineres Mini-Tower Geh&auml;use verwendet,
ihm fehlt auch das StorageWorks SCSI hot-plug System. Der Hauptunterschied zwischen der
AS1000 und der AS1000A liegt darin, da&szlig; die AS1000A 7 PCI Steckpl&auml;tze hat,
w&auml;hrend bei der AS1000 nur 3 PCI Steckpl&auml;tze zur Verf&uuml;gung stehen, und der
Rest EISA Steckpl&auml;tze sind.</p>

<p>Die AS800 mit einer EV5/400 MHz CPU wurde sp&auml;ter unter der Bezeichnung ``DIGITAL
Server 3300[R]'' verkauft, aus der AS800 mit einer EV5/500 MHz CPU wurde der ``DIGITAL
Server 3305[R]''.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21064 EV4[5] CPU mit 200, 233 oder 266 MHz 21164 EV5[6] CPU mit 300, 333 oder 400 MHz
(nur AS800: 500 MHz)</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>Bandbreite: 128 Bit, ECC</p>
</li>

<li>
<p>AS1000[A]:</p>

<ul>
<li>
<p>72polige, 36 Bit breite Fast Page Mode SIMMs, 70ns oder schneller</p>
</li>

<li>
<p>16 (EV5 Systeme) oder 20 (EV4 Systeme) SIMM Steckpl&auml;tze</p>
</li>

<li>
<p>Maximaler Speicherausbau 1 GB</p>
</li>

<li>
<p>nutzt ECC</p>
</li>
</ul>
</li>

<li>
<p>AS800: Benutzt EDO DIMMs, 60 ns, 3.3 Volt</p>
</li>
</ul>
</li>

<li>
<p>VGA eingebaut (nur bei einigen Mainboards)</p>
</li>

<li>
<p>3 PCI, 2 EISA, 1 64-Bit PCI/EISA kombiniert (AS800)</p>
</li>

<li>
<p>7 PCI, 2 EISA (AS1000A)</p>
</li>

<li>
<p>2 PCI, 1 EISA/PCI, 7 EISA (AS1000)</p>
</li>

<li>
<p>SCSI eingebaut, basiert auf einem Symbios 810 [AS1000] oder Qlogic 1020 [AS1000A]</p>
</li>
</ul>

<p>Die AS1000 Systeme gibt in vielen verschiedenen Geh&auml;usevarianten. Frei stehend,
Rack-Einbau, mit oder ohne StorageWorks SCSI System, usw. Die ``Elektronik'' ist bei
allen gleich.</p>

<p>AS1000 Maschinen: Alle Maschinen mit der EV4 verwenden normale PS/2 SIMMs (36 Bit, 72
Pin) in F&uuml;nfergruppen. Das f&uuml;nfte wird f&uuml;r ECC benutzt. Alle Maschinen mit
der EV5 verwenden normale PS/2 SIMM (36 Bit, 72 Pin) in Vierergruppen. Der ECC nutzt die
4 &uuml;berz&auml;hligen Bits der SIMMs (4 Bit von 36 Bit). Die EV5 Mainboards haben 16
Steckpl&auml;tze f&uuml;r SIMMs, die EV4 Mainboards haben 20 Steckpl&auml;tze f&uuml;r
SIMMs.</p>

<p>Die AS800 Systeme verwenden DIMMs in Vierergruppen, dabei mu&szlig; in den mit ``Bank
0'' gekennzeichneten Steckpl&auml;tzen begonnen werden. Eine Speicherbank besteht aus
vier nebeneinanderliegenden Steckpl&auml;tzen. Wenn verschieden gro&szlig;e DIMMs
installiert werden, m&uuml;ssen die gr&ouml;&szlig;eren in Bank 0 installiert werden. Der
maximale Speicherausbau betr&auml;gt 2 GByte. Beachten Sie, da&szlig; EDO DIMMs verwendet
werden m&uuml;ssen.</p>

<p>Die AS1000/800 verh&auml;lt sich etwas st&ouml;rrisch, wenn man an Ihr eine serielle
Konsole verwenden will. Sie m&uuml;ssen auf jeden Fall folgendes im SRM eingeben:</p>

<pre class="SCREEN">
&gt;&gt;&gt; <kbd class="USERINPUT">SET CONSOLE SERIAL</kbd>
</pre>

<p>um die serielle Konsole verwenden zu k&ouml;nnen. Wie bei den meisten anderen Alphas
reicht es nicht aus, wenn man nur die Tastatur abzieht. Um wieder auf die graphische
Konsole umzuschalten, m&uuml;ssen Sie an den Befehl</p>

<pre class="SCREEN">
&gt;&gt;&gt; <kbd class="USERINPUT">SET CONSOLE GRAPHICS</kbd>
</pre>

<p>an der seriellen Konsole eingeben.</p>

<p>Wenn Sie eine AS800 besitzen, sollten Sie auf jeden Fall pr&uuml;fen, ob Ihr
Ultra-Wide SCSI Bus auch wirklich den Ultra Modus nutzt. Dazu ben&ouml;tigen Sie das
Programm <tt class="FILENAME">EEROMCFG.EXE</tt>, das Sie auf der ``Konsole Firmware
Upgrade CDROM'' finden.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel eines AlphaServer1000/1000A/800 mu&szlig;
die folgenden Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_1000A
cpu     EV4  # je nach installierter CPU
cpu     EV5  # je nach installierter CPU
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN746" name="AEN746">2.3.9. DS10/VS10/XP900 (``Webbrick'') /
XP1000 (``Monet'') / DS10L (``Slate'')</a></h4>

<p>Die Modelle Webbrick und Monet sind leistungsstarke Workstations und Server, auf der
Basis der EV6 und des Tsunami Chipsatzes. Der Tsunami Chipsatz wird auch in den
leistungsst&auml;rksten Systemen genutzt und bietet daher mehr als genug Leistung.
Eigentlich handelt es sich bei der DS10, VS10 und XP900 trotz der unterschiedlichen Namen
nur um ein System. Die Unterschiede liegen in der Software und den angebotenen
Erweiterungen. Die DS10L basiert auf der DS10, das Geh&auml;use ist jedoch f&uuml;r den
Einbau in ein Rack vorgesehen und nur 1HE hoch. Diese Maschine ist f&uuml;r ISPs und HPTC
Cluster (wie zum Beispiel Beowulf) gedacht.</p>

<div class="SECT4">
<hr />
<h5 class="SECT4"><a id="AEN752" name="AEN752">2.3.9.1. ``Webbrick / Slate''</a></h5>

<ul>
<li>
<p>21264 EV6 CPU, 466 MHz</p>
</li>

<li>
<p>L2 / Bcache: 2MB, ECC</p>
</li>

<li>
<p>Speicherzugriff: 128 Bit via crossbar, Transferrate 1.3GB/sec</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>Standard SDRAM DIMM, gepuffert, ECC, 200 Pin, 83 MHz</p>
</li>

<li>
<p>4 DIMM Steckpl&auml;tze in der DS10; maximaler Speicherausbau 2GByte</p>
</li>

<li>
<p>2 DIMM Steckpl&auml;tze in der DS10L; maximaler Speicherausbau 1 GByte</p>
</li>

<li>
<p>DIMMs m&uuml;ssen paarweise installiert werden</p>
</li>
</ul>
</li>

<li>
<p>21271 Core Logic Chipsatz (``Tsunami'')</p>
</li>

<li>
<p>2 eingebaute 21143 Fast Ethernet Kontroller</p>
</li>

<li>
<p>AcerLabs M5237 (Aladdin-V) USB Kontroller (deaktiviert)</p>
</li>

<li>
<p>AcerLabs M1533 PCI-ISA bridge</p>
</li>

<li>
<p>AcerLabs Aladdin ATA-33 Kontroller</p>
</li>

<li>
<p>zwei eingebaute EIDE-Kan&auml;le</p>
</li>

<li>
<p>Erweiterungen: 3 64-Bit PCI Steckpl&auml;tze und 1 32-Bit PCI Steckplatz; die DS10L
hat einen 64-Bit PCI Steckplatz</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>2 USB Anschl&uuml;sse</p>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>
</ul>

<p>Die Systeme verf&uuml;gen &uuml;ber eine ``intelligente'' Spannungsversorgung. Mit
anderen Worten, selbst wenn Sie das System ausschalten, stehen Teile des Systems immer
noch unter Strom (wie bei einem PC mit ATX-Netzteil). Wenn Sie Arbeiten an der Hardware
durchf&uuml;hren wollen, m&uuml;ssen Sie also den Netzstecker ziehen.</p>

<p>Diese Spannungsversorgung wird RMC genannt. Wenn sie aktiviert ist, gelangen Sie durch
die Eingabe von <b class="KEYCAP">Escape</b><b class="KEYCAP">Escape</b> RMC auf dem
seriellen Anschlu&szlig; 1 zur Eingabeaufforderung der RMC. Mit der RMC k&ouml;nnen Sie
das System ausschalten, einschalten, neu starten, die Temperatur &uuml;berwachen, die
Grenzwerte f&uuml;r die Temperatur einstellen und vieles mehr. Die RMC hat eine eigene
Onlinehilfe.</p>

<p>Die Webbrick befindet sich in einem Desktop-&auml;hnlichem Geh&auml;use, das dem der
&auml;lteren 21164 ``Maverick'' Workstations gleicht, aber deutlich besseren Zugang zu
den Komponenten gew&auml;hrt. Wenn Sie eine Server-Farm aufbauen wollen, k&ouml;nnen Sie
die Webbrick auch in ein Rack einbauen, sie belegt 3 H&ouml;heneinheiten. Die Slate ist
nur eine H&ouml;heneinheit hoch, hat aber auch nur einen PCI Steckplatz.</p>

<p>Die DS10 besitzt 4 Steckpl&auml;tze f&uuml;r DIMMs. DIMMs m&uuml;ssen paarweise
installiert werden; dabei m&uuml;ssen Sie darauf achten, da&szlig; die Paare verzahnt
sind und daher die beiden DIMMs eines Paares nicht nebeneinander liegen. Sie k&ouml;nnen
32, 64, 128, 256 und 512 MByte gro&szlig;e DIMMs verwenden.</p>

<p>Wenn in einer DS10 zwei Paare aus gleich gro&szlig;en DIMMs installieren, greift das
System abwechselnd auf die beiden Speicherb&auml;nke zu, um die Leistung zu steigern
(memory interleaving). Diese Option steht bei der DS10L nicht zur Verf&uuml;gung, da Sie
nur zwei Steckpl&auml;tze f&uuml;r DIMMs hat.</p>

<p>Seit der Version 5.9 der SRM Firmware k&ouml;nnen Sie auch von Hostadaptern aus der
Adaptec 2940-Familie booten und sind nicht mehr auf die normalerweise verwendeten Qlogic
und Symbios/NCR Hostadapter eingeschr&auml;nkt. Wenn Sie den KZPEA alias Adaptec 39160
einsetzen, erhalten Sie zwei LVD U160 SCSI Kan&auml;le, von denen Sie via SRM booten
k&ouml;nnen.</p>

<p>Im Basismodell ist eine FUJITSU 9.5GB ATA Festplatte eingebaut, von der das System
auch bootet. Auf der Webbrick k&ouml;nnen Sie FreeBSD mit EIDE Festplatten einsetzen. Auf
dem Mainboard der DS10 stehen zwei IDE Anschl&uuml;sse zur Verf&uuml;gung. Die f&uuml;r
den Betrieb mit Tru64 Unix oder VMS vorgesehenen Systeme wurden standardm&auml;&szlig;ig
mit Ultra-SCSI Festplatten an Qlogic Hostadaptern ausger&uuml;stet.</p>

<p>Die PCI-Steckpl&auml;tze unterst&uuml;tzen 32 Bit und 64 Bit Karten, sowohl die 3.3V
als auch die 5V Variante.</p>

<p>Die USB Anschl&uuml;sse werden nicht unterst&uuml;tzt und von allen aktuellen
Versionen der SRM Konsole deaktiviert.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_ST6600
cpu     EV5
</pre>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig,
<var class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist
nur notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</blockquote>
</div>
</div>

<div class="SECT4">
<hr />
<h5 class="SECT4"><a id="AEN818" name="AEN818">2.3.9.2. ``Monet''</a></h5>

<ul>
<li>
<p>21264 EV6, 500 MHz; 21264 EV67, 500 oder 667 MHz (XP1000G, Code-Name Brisbane); die
CPU steckt auf einer eigenen Karte, die vor Ort ausgewechselt werden kann</p>
</li>

<li>
<p>L2 / Bcache: 4MB, ECC</p>
</li>

<li>
<p>Speicherzugriff: 256 Bit</p>
</li>

<li>
<p>Speicher: 128 oder 256 MByte 100 MHz (PC100) 168 Pin JEDEC standard, registered ECC
SDRAM DIMMs</p>
</li>

<li>
<p>21271 Core Logic Chipsatz (``Tsunami'')</p>
</li>

<li>
<p>eingebauter Ethernet-Kontroller auf Basis des 21143</p>
</li>

<li>
<p>Cypress 82C693 USB Controller</p>
</li>

<li>
<p>Cypress 82C693 PCI-ISA Bridge</p>
</li>

<li>
<p>Cypress 82C693 Controller</p>
</li>

<li>
<p>Erweiterungsm&ouml;glichkeiten: 2 getrennte PCI Busse, die von schnell I/O
Kan&auml;len (``Hoses'') angesteuert werden:</p>

<ul>
<li>
<p>Hose 0: (die oberen 3 Steckpl&auml;tze) 2 64-Bit PCI Steckpl&auml;tze 1 32-Bit PCI
Steckpl&auml;tze</p>
</li>

<li>
<p>Hose 1: (die unteren 2 Steckpl&auml;tze) 2 32-Bit PCI Steckpl&auml;tze (hinter einer
21154 PCI-PCI Bridge)</p>
</li>

<li>
<p>2 der 64-Bit PCI Steckpl&auml;tze sind f&uuml;r Karten mit voller Baul&auml;nge
gedacht</p>
</li>

<li>
<p>alle 32-Bit PCI Steckpl&auml;tze sind nur f&uuml;r kurze Karten geeignet</p>
</li>

<li>
<p>einer der 32-Bit PCI Steckpl&auml;tze &uuml;berlappt mit einem der ISA
Steckpl&auml;tze</p>
</li>

<li>
<p>alle PCI Steckpl&auml;tze werden mit 33 MHz angesteuert</p>
</li>
</ul>
</li>

<li>
<p>1 Ultra-Wide SCSI Anschlu&szlig; an einem Qlogic 1040</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>

<li>
<p>eingebautes 16-Bit ESS ES1888 Audiosystem</p>
</li>

<li>
<p>2 USB Anschl&uuml;sse</p>
</li>

<li>
<p>Grafik: ELSA Gloria Synergy oder DEC/Compaq PowerStorm 3D Beschleuniger Karten
(wahlweise)</p>
</li>
</ul>

<p>Das Geh&auml;use der Monet ist &auml;hnlich einem Mini-Tower, fast so wie bei der
Miata.</p>

<p>Der eingebaute Qlogic UW-SCSI Kontroller erlaubt bis zu 4 interne Ger&auml;te. Ein
externer Anschlu&szlig; ist nicht vorhanden.</p>

<p>Wenn Sie eine 500 MHz CPU verwenden, k&ouml;nnen Sie auch 83 MHz DIMMs verwenden,
obwohl laut Compaq f&uuml;r alle CPUs PC100 DIMMs verlangt. DIMMs m&uuml;ssen in
Vierergruppen installiert werden, dabei mu&szlig; mit den mit ``0'' markierten
Steckpl&auml;tzen begonnen werden. Der maximale Speicherausbau betr&auml;gt 4 GByte. Die
DIMMs m&uuml;ssen ``physically interleaved'' installiert werden, beachten Sie die
Markierungen neben den Steckpl&auml;tzen. Die Breite des Speichers bei der Monet ist
doppelt so gro&szlig; wie bei der Webbrick. Die DIMMs sind auf derselben Karte wie die
CPU untergebracht. Bitte beachten Sie, da&szlig; ECC RAM verwendet wird, Sie
ben&ouml;tigen also 72 Bit DIMMs (und nicht die normalen 64 Bit PC DIMMs).</p>

<p>Die EIDE Ger&auml;te k&ouml;nnen sowohl vom SRM als Bootdevice als auch von FreeBSD
genutzt werden. Obwohl der eingesetzt Cypress Chip 2 EIDE Kan&auml;le bereitstellt, wird
in der Monet nur einer davon unterst&uuml;tzt.</p>

<p>Die USB Anschl&uuml;sse werden von FreeBSD unterst&uuml;tzt. Sollten Sie Probleme mit
der Nutzung der USB Anschl&uuml;sse haben, sollten Sie nachsehen, ob die SRM Variable
<var class="VARNAME">usb_enable</var> auf <var class="LITERAL">on</var> steht. Sie
k&ouml;nnen die Einstellung mit dem folgenden Befehl &auml;ndern:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">SET USB_ENABLE ON</kbd>
</pre>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Versuchen Sie nicht, einen SCSI-Kontroller mit Symbios-Chipsatz in
einem der PCI-Steckpl&auml;tze an Hose 1 zu benutzen. Ein noch nicht genau lokalisiertes
Problem von FreeBSD sorgt in dieser Konstellation f&uuml;r Probleme.</p>
</blockquote>
</div>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Einige VGA Karten funktionieren hinter der PCI-PCI Bridge (in den
Steckpl&auml;tzen 4 und 5) nicht. Hier k&ouml;nnen Sie nur Karten verwenden, die das
``VGA-legacy addressing'' richtig implementiert haben. Benutzen Sie im Notfall einfach
einen der PCI-Steckpl&auml;tze ``vor'' der Bridge.</p>
</blockquote>
</div>

<p>Die Audio-Hardware wird zur Zeit nicht von FreeBSD unterst&uuml;tzt.</p>

<p>Die folgenden Zeilen m&uuml;ssen in der Konfigurationsdatei f&uuml;r den
angepa&szlig;ten Kernel enthalten sein:</p>

<pre class="PROGRAMLISTING">
options   DEC_ST6600
cpu     EV5
</pre>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig,
<var class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist
nur notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</blockquote>
</div>
</div>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN899" name="AEN899">2.3.10. DS20/DS20E (``Goldrush'')</a></h4>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21264 EV6 CPU, 500 oder 670 MHz</p>
</li>

<li>
<p>maximal zwei CPUs pro System</p>
</li>

<li>
<p>L2 / Bcache: 4 MByte pro CPU</p>
</li>

<li>
<p>Speicherzugriff: Dual 256 Bit wide with crossbar switch</p>
</li>

<li>
<p>Speicher:</p>

<ul>
<li>
<p>SDRAM DIMMs</p>
</li>

<li>
<p>werden in Vierergruppen installiert</p>
</li>

<li>
<p>16 DIMM Steckpl&auml;tze, maximal 4 GByte</p>
</li>

<li>
<p>ECC</p>
</li>
</ul>
</li>

<li>
<p>21271 Core Logic Chipsatz (``Tsunami'')</p>
</li>

<li>
<p>eingebauter Adaptec ? Wide Ultra SCSI Hostadapter</p>
</li>

<li>
<p>Erweiterungen:</p>

<ul>
<li>
<p>2 getrennte PCI Busse, die von schnellen I/O Kan&auml;len (``Hoses'') angesteuert
werden:</p>
</li>

<li>
<p>6 64-Bit PCI Steckpl&auml;tze, 3 pro Hose</p>
</li>

<li>
<p>1 ISA Steckplatz</p>
</li>
</ul>
</li>
</ul>

<p>Bei der DS20 m&uuml;ssen Sie</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">SET CONSOLE SERIAL</kbd>
</pre>

<p>eingeben, damit die serielle Konsole aktiv wird; es reicht nicht aus, die Tastatur
abzuziehen. Um wieder zur graphischen Konsole umzuschalten, m&uuml;ssen Sie</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET CONSOLE GRAPHICS</kbd>
</pre>

<p>an der seriellen Konsole. Lassen Sie sich bitte nicht davon verwirren, da&szlig; die
Meldungen der SRM Konsole auf der graphischen Konsole erscheinen, obwohl Sie auf die
serielle Konsole umgeschaltet haben. Sobald Sie FreeBSD starten, beachtet es die
Einstellung f&uuml;r <var class="LITERAL">CONSOLE</var> und alle Meldungen beim
Systemstart und das Login erscheinen auf der seriellen Konsole.</p>

<p>Das Geh&auml;use der DS20 ist gro&szlig; und wie ein W&uuml;rfel geformt. Im
Geh&auml;use ist unter anderem ein StorageWorks SCSI hot-swap System eingebaut, da&szlig;
maximal sieben 3.5&quot; SCSI Festplatten aufnehmen kann. Das Geh&auml;use der DS20E ist
kleiner, da das StorageWorks System fehlt.</p>

<p>Die Systeme verf&uuml;gen &uuml;ber eine ``intelligente'' Spannungsversorgung. Mit
anderen Worten, selbst wenn Sie das System ausschalten, stehen Teile des Systems immer
noch unter Strom (wie bei einem PC mit ATX-Netzteil). Wenn Sie Arbeiten an der Hardware
durchf&uuml;hren wollen, m&uuml;ssen Sie also den Netzstecker ziehen.</p>

<p>Diese Spannungsversorgung wird RMC genannt. Wenn sie aktiviert ist, gelangen Sie durch
die Eingabe von <b class="KEYCAP">Escape</b><b class="KEYCAP">Escape</b> RMC auf dem
seriellen Anschlu&szlig; 1 zur Eingabeaufforderung der RMC. Mit der RMC k&ouml;nnen Sie
das System ausschalten, einschalten, neu starten, die Temperatur &uuml;berwachen, die
Grenzwerte f&uuml;r die Temperatur einstellen und vieles mehr. Die RMC hat eine eigene
Onlinehilfe.</p>

<p>Der eingebaute Adaptec SCSI Hostadapter ist bei der DS20 abgeschaltet und kann daher
nicht mit FreeBSD genutzt werden.</p>

<p>Seit der Version 5.9 der SRM Firmware k&ouml;nnen Sie auch von Hostadaptern aus der
Adaptec 2940-Familie booten und sind nicht mehr auf die normalerweise verwendeten Qlogic
und Symbios/NCR Hostadapter eingeschr&auml;nkt. Sie k&ouml;nnen auch einen KZPEA alias
Adaptec 39160 benutzen, um zwei LVD U160 SCSI Kan&auml;le zu erhalten, von denen Sie via
SRM booten k&ouml;nnen.</p>

<p>Wenn Sie verschieden gro&szlig;e DIMMs benutzen, m&uuml;ssen Sie die
gr&ouml;&szlig;ten Module in die mit <var class="LITERAL">0</var> gekennzeichneten
Steckpl&auml;tze einsetzen. Au&szlig;erdem m&uuml;ssen Sie die Steckpl&auml;tze ``der
Reihe nach'' benutzen, also erst Bank 0, dann Bank 1, und so weiter.</p>

<p>Versuchen Sie nicht, einen SCSI-Kontroller mit Symbios-Chipsatz in einem der
PCI-Steckpl&auml;tze an Hose 1 zu benutzen. Ein noch nicht genau lokalisiertes Problem
von FreeBSD sorgt in dieser Konstellation f&uuml;r Probleme.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_ST6600
cpu     EV5
</pre>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig,
<var class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist
nur notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</blockquote>
</div>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN969" name="AEN969">2.3.11. AlphaPC 264DP / UP2000</a></h4>

<p>Die UP2000 wurde von der Firma Alpha Processor Inc. gebaut</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21264 EV6 CPU, 670 MHz oder 750 MHz</p>
</li>

<li>
<p>maximal zwei CPUs pro System</p>
</li>

<li>
<p>L2 / Bcache: 4 MByte pro CPU</p>
</li>

<li>
<p>Speicherzugriff: 256 Bit</p>
</li>

<li>
<p>Speicher: SDRAM DIMMs, Vierergruppen, ECC, 16 DIMM Steckpl&auml;tze, maximal 4GB</p>
</li>

<li>
<p>21272 Core Logic Chipsatz (``Tsunami'')</p>
</li>

<li>
<p>zwei eingebaute Adaptec AIC7890/91 Wide Ultra SCSI Hostadapter</p>
</li>

<li>
<p>2 eingebauten IDE-Kontroller auf Basis des Cypress 82C693 Chipsatzes</p>
</li>

<li>
<p>USB mit Cypress 82C693</p>
</li>

<li>
<p>Erweiterungen:</p>

<ul>
<li>
<p>2 getrennte PCI Busse, die von schnellen I/O Kan&auml;len (``Hoses'') angesteuert
werden</p>
</li>

<li>
<p>6 64-Bit PCI Steckpl&auml;tze, 3 pro Hose</p>
</li>

<li>
<p>1 ISA Steckplatz</p>
</li>
</ul>
</li>
</ul>

<p>Zur Zeit unterst&uuml;tzt FreeBSD nur maximal 2 GByte Speicher.</p>

<p>Die eingebauten Adaptec Hostadapter k&ouml;nnen bei der UP2000 zum Booten des Systems
verwendet werden.</p>

<p>Busmaster DMA wird nur auf dem ersten IDE-Anschlu&szlig; unterst&uuml;tzt. Das System
kann von seinen IDE-Platten und von CD booten.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_ST6600
cpu     EV5
</pre>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig,
<var class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist
nur notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</blockquote>
</div>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1015" name="AEN1015">2.3.12. AlphaServer 2000
(``DemiSable''), 2100 (``Sable''), 2100A (``Lynx'')</a></h4>

<p>Die AlphaServer 2[01]00 sind als Server f&uuml;r ganze Abteilungen gedacht, ``medium
iron'' halt. Alle Maschinen unterst&uuml;tzen mehrere CPUs, Sie k&ouml;nnen bis zu zwei
(AS2000) oder vier (AS2100[A]) CPU installieren. Es gibt sowohl frei stehende als auch
f&uuml;r den Einbau in ein 19&quot;-Rack vorgesehene Varianten. Die Unterschiede zwischen
beiden Versionen erstrecken sich auf die Anzahl der Steckpl&auml;tze, die maximale Anzahl
an CPU, und den maximalen Speicherausbau. Bei einigen Systemen ist ein StorageWorks
System integriert, das den Austausch der SCSI-Festplatten im laufenden Betrieb erlaubt.
Zwischenzeitlich wurde der Aufstieg von der Sable zur Lynx durch Austausch der
I/O-Backplane angeboten (die C-Bus Backplane verblieb im System). Schnellere CPUs wurden
ebenfalls angeboten.</p>

<ul>
<li>
<p>21064 EV4[5] CPU[s], 200, 233, 275 MHz oder 21164 EV5[6] CPU[s]s, 250, 300, 375, 400
MHz</p>
</li>

<li>
<p>Cache: Je nach CPU 1, 4 oder 8 MByte pro CPU</p>
</li>

<li>
<p>eingebauter Kontroller f&uuml;r ein 2.88 MByte Diskettenlaufwerk</p>
</li>

<li>
<p>10MBit 21040 Ethernet eingebaut [nur AS2100]</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>
</ul>

<p>Die 200 MHz CPUs werden in Wirklichkeit nur mit 190 MHz betrieben. Es k&ouml;nnen
maximal 4 CPUs eingebaut werden, die allerdings identisch sein m&uuml;ssen
(Typ/Geschwindigkeit).</p>

<p>Wenn einer der Prozessoren einmal einen Fehler verursacht hat und als defekt markiert
ist, bleibt dieser Status bestehen, auch wenn man die CPU austauscht (oder neu einsetzt),
bis Sie das folgende Kommando eingeben</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">CLEAR_ERROR ALL</kbd>
</pre>

<p>und die Maschine aus- und wieder einschalten. Dies gilt wahrscheinlich auch f&uuml;r
die anderen Subsysteme (IO und Speicher), allerdings konnte dies ungetestet.</p>

<p>Bei den Systemen werden spezialisierte Speicherkarten verwendet, die sich einen 128
Bit breiten C-Bus mit den CPU-Karten teilen. Der maximale Speicherausbau betr&auml;gt 1
GByte (DemiSable) bzw. 2 GByte (Sable). Einer der Steckpl&auml;tze auf dem Speicher-Bus
kann entweder eine CPU- oder eine Speicher-Karte aufnehmen. Bei einem Maschine mit 4 CPUs
k&ouml;nnen maximal zwei Speicherkarten verwendet werden.</p>

<p>Einige Versionen der Speicherkarten sind f&uuml;r die Aufnahme von SIMMs vorgesehen
und werden als ``SIMM carriers'' bezeichnet. Bei anderen Speicherkarten wurden die
Speicherbausteine direkt auf die Platine gel&ouml;tet, was die Bezeichnung ``flat memory
modules'' erkl&auml;rt.</p>

<p>SIMM werden in Gruppen von acht 72-Pin, 36 Bit, 70 ns FPM Modulen verwendet. Die
unterst&uuml;tzten SIMM-Typen sind 1 M x 36 Bit (4 MByte), 2 M x 36 Bit (8 MByte) und 4M
x 36 Bit (16 MByte). Jede Speicherkarte kann bis zu vier SIMM-B&auml;nke aufnehmen. Die
Verwendung verschieden gro&szlig;er SIMMs auf einer Speicherkarte ist nicht erlaubt. Sie
m&uuml;ssen eine Speicherkarte erst komplett best&uuml;cken, bevor Sie die n&auml;chste
Karte einbauen. Da zwischen den Steckpl&auml;tzen f&uuml;r die Karten nicht sehr viel
Platz, sollten Sie auf die physische Gr&ouml;&szlig;e der SIMMs achten (bevor Sie sie
kaufen...)</p>

<p>Sowohl die Lynx als auch die Sable sind etwas st&ouml;rrisch, wenn es um die serielle
Konsole geht. Sie m&uuml;ssen den folgenden Befehl eingeben, um eine serielle Konsole
benutzen zu k&ouml;nnen:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">SET CONSOLE SERIAL</kbd>
</pre>

<p>Wie bei vielen anderen Alphas reicht es nicht aus, einfach nur die Tastatur zu ziehen.
Um wieder auf die graphische Konsole umzuschalten, m&uuml;ssen Sie den folgenden Befehl
eingeben:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET CONSOLE GRAPHICS</kbd>
</pre>

<p>Bei der Lynx sollte sich die VGA Karte in einem der prim&auml;ren PCI-Steckpl&auml;tze
befinden, EISA VGA Karten haben diese Einschr&auml;nkung nicht.</p>

<p>Die Maschinen verf&uuml;gen &uuml;ber ein kleines LCD, das OCP (Operator Control
Panel) genannt wird. Beim Start des Systems werden hier die Meldungen der Testprogramme
angezeigt. Sie k&ouml;nnen den auf dem OCP angezeigten Text &uuml;ber das SRM
beeinflussen:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd
class="USERINPUT">SET OCP_TEXT "FreeBSD"</kbd>
</pre>

<p>Das SRM Kommando</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">SHOW FRU</kbd>
</pre>

<p>zeigt Ihnen eine &Uuml;bersicht &uuml;ber die Konfiguration des Systems, inkl. der
Seriennummern, Versionsnummer und Fehlerzahlen der einzelnen Module.</p>

<p>Sable, DemiSable und Lynx verf&uuml;gen &uuml;ber einen eingebauten Fast
SCSI-Controller vom Typ Symbios 810. Wenn Sie pr&uuml;fen wollen, ob der Controller auf
Fast SCSI eingestellt ist, sollten Sie das folgende Kommando benutzen:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">SHOW PKA0_FAST</kbd>
</pre>

<p>Wenn hier der Wert 1 angezeigt wird, wird Fast SCSI unterst&uuml;tzt.</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">SET PKA0_FAST 1</kbd>
</pre>

<p>aktiviert diesen Modus</p>

<p>Zusammen mit der AS2100[A] wird StorageWorks SCSI Modul mit 7 SCSI Steckpl&auml;tzen
geliefert. Ein zweites Modul kann in das Geh&auml;use eingebaut werden. Bei der AS2000
gibt es nur ein Modul mit 7 Steckpl&auml;tzen, Erweiterungen sind nicht m&ouml;glich.
Bitte beachten Sie, da&szlig; die Zuordnung zwischen Steckpl&auml;tzen und SCSI ID in
diesen Modulen anders ist als bei den normalen StorageWorks Modulen. Wenn Sie nur einen
SCSI Bus konfiguriert haben, lautet die Reihenfolge von oben nach unten 0, 4, 1, 5, 2, 6,
3.</p>

<p>Das Modul kann auch so konfiguriert werden, da&szlig; zwei unabh&auml;ngige SCSI Busse
zur Verf&uuml;gung stehen. Dieser Modus wird f&uuml;r RAID-Controller wie den KZPSC
(Mylex DAC960) genutzt. In diesem Modus sind die Slot IDs wie folgt belegt: 0A, 0B, 1A,
1B, 2A, 2B, 3A, 3B (von oben nach unten), wobei A und B den SCSI-Bus angeben. Bei einer
Konfiguration mit nur einem SCSI-Bus geh&ouml;rt das Modul mit dem Terminator auf der
R&uuml;ckseite nach OBEN, das Modul mit den Jumpern nach UNTEN. Wenn Sie zwei SCSI-Busse
verwenden, ist die Anordnung vertauscht. Die Unterscheidung zwischen den beiden Modulen
ist relativ einfach: Auf dem Terminator-Modul befinden sich mehrere elektronische
Bauteile, auf dem Jumper-Modul keine.</p>

<p>Die DemiSable stellt 7 EISA und 3 PCI Steckpl&auml;tze zur Verf&uuml;gung, bei der
Sable sind es 8 EISA und 3 PCI Steckpl&auml;tze. Die Lynx hat, weil Sie neuer ist, 8 PCI
und 3 EISA Steckpl&auml;tze. Die PCI Steckpl&auml;tze der Lynx sind in Vierergruppen
zusammengefa&szlig;t. Die vier PCI Steckpl&auml;tze, die n&auml;her an der CPU liegen,
sind die prim&auml;ren Steckpl&auml;tze, liegen also logisch vor der PCI Bridge. Diese
Steckpl&auml;tze tragen entgegen der Erwartung die h&ouml;heren Nummern (PCI4 bis
PCI7).</p>

<p>Sie m&uuml;ssen auf jeden Fall das EISA Configuration Utility (auf Diskette) benutzen,
wenn Sie in den EISA Steckpl&auml;tzen Karten hinzugef&uuml;gt oder getauscht haben. Dazu
m&uuml;ssen Sie nur die Diskette mit dem ECU einlegen und den folgenden Befehl
eingeben:</p>

<pre class="SCREEN">
<samp class="PROMPT">&gt;&gt;&gt;</samp> <kbd class="USERINPUT">RUNECU</kbd>
</pre>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Die EISA Steckpl&auml;tze werden zwar zur Zeit nicht
unterst&uuml;tzt, aber die Compaq Qvision EISA VGA Karte wird als ISA Ger&auml;t
behandelt werden und kann daher f&uuml;r die Konsole verwendet werden.</p>
</blockquote>
</div>

<p>Es gab Entw&uuml;rfe f&uuml;r ein spezielles Extended I/O Modul, welches auf dem C-Bus
eingesetzt werden sollte. Es ist nicht bekannt, ob diese Module jemals gebaut wurden. Auf
jeden Fall gibt es keine Daten, ob FreeBSD sie unterst&uuml;tzt.</p>

<p>Die Systeme k&ouml;nnen mit redundanten Netzteilen ausgestattet werden. Beachten Sie,
da&szlig; das Geh&auml;use mit einem Sicherheitsschalter versehen ist, der die Maschine
abschaltet, sobald Sie das Geh&auml;use &ouml;ffnen. Die L&uuml;fter der Maschinen sind
geregelt. Sobald ein System mit mehr als zwei CPUs und mehr als einer Speicherkarte
ausgestattet ist, m&uuml;ssen Sie zwei Netzteile verwenden.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_2100_A500
cpu     EV4     #je nach verwendeter CPU
cpu     EV5     #je nach verwendeter CPU
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1088" name="AEN1088">2.3.13. AlphaServer 4x00
(``Rawhide'')</a></h4>

<p>Die AlphaServer 4x00 Systeme sind Server f&uuml;r kleinere Unternehmen, die entweder
in einem 30&quot; (76 cm) hohen Schrank oder in einem 19&quot; Rack stecken. Die Rawhides
sind f&uuml;r den Einsatz von mehr als einer CPU vorgesehen, jedes System kann bis zu
vier CPUs aufnehmen. Die Grundversorgung mit Festplatten &uuml;bernehmen ein oder zwei
StorageWorks Module im unteren Teil des Schrankes. Die f&uuml;r den NT-Markt vorgesehenen
Rawhides hei&szlig;en DIGITAL Server 7300 (5/400 CPU) und DIGITAL Server 7305 (5/533
CPU). Ein R am Ende der Typenbezeichnung deutet auf ein System hin, das in ein Rack
eingebaut werden kann.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21164 EV5 CPUs, 266/300/333 MHz oder 21164A EV56 CPUs, 400/466/533/600/666 MHz</p>
</li>

<li>
<p>Cache: 4 MByte pro CPU. Bei der EV5 300 MHz gab es auch eine Variante ohne Cache. 8
MByte bei der EV56 600 MHz</p>
</li>

<li>
<p>Speicherzugriff: 128 Bit, ECC</p>
</li>

<li>
<p>eingebauter Kontroller f&uuml;r ein Diskettenlaufwerk</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>
</ul>

<p>F&uuml;r die Rawhide k&ouml;nnen viele verschiedene CPU-Module genutzt werden. Es gibt
CPU-Module mit und ohne externen Cache. Die einzige Einschr&auml;nkung ist, da&szlig;
alle installierten CPU-Module gleich schnell sein m&uuml;ssen. Es ist probemlos
m&ouml;glich, NT- und Tru64/VMS CPU-Module zu mischen. Allerdings wird sich das System
dann als Digital Server 730x (die NT-Variante) melden. FreeBSD st&ouml;rt das nicht,
allerdings laufen Tru64 und VMS auf einem solchen System nicht.</p>

<p>Bei der Rawhide k&ouml;nnen bis zu 8 Speichermodule eingesetzt werden. Die Module
werden in Paaren eingesetzt und stellen dem Bus jeweils 72 Bit zur Verf&uuml;gung
(inklusive der Bits f&uuml;r ECC). Die Module k&ouml;nnen EDO RAM oder SDRAM sein. Eine
voll best&uuml;ckte AS4100 verf&uuml;gt &uuml;ber vier Paar Speichermodule, die As4000
kann nur zwei Paar verwenden. Um die maximale Leistung zu erhalten, sollten Sie nach
M&ouml;glichkeit SDRAM verwenden. Das Speichermodul mit der gr&ouml;&szlig;ten
Kapazit&auml;t m&uuml;ssen in den Steckpl&auml;tzen mit den Bezeichnungen MEM0L und MEM0H
plaziert werden. Eine Mischung aus EDO und SDRAM Speicher funktioniert auch (solange Sie
nicht versuchen, innerhalb eines Paares EDO und SDRAM zu mischen). Allerdings f&uuml;hrt
die gleichzeitige Verwendung von EDO und SDRAM dazu, da&szlig; der <span
class="emphasis"><i class="EMPHASIS">gesamte</i></span> Speicher im langsameren EDO-Modus
angesteuert wird.</p>

<p>Die Rawhide verf&uuml;gt &uuml;ber einen eingebauten Symbios 810 SCSI-Controller, der
einen 8 Bit (narrow) fast-SCSI Bus bereitstellt und der im allgemeinen nur f&uuml;r das
CDROM genutzt wird.</p>

<p>F&uuml;r die Rawhides gibt es Erweiterungsmodule mit 8 64-Bit PCI und 3 EISA
Steckpl&auml;tzen (die sogenannten ``Saddle'' Module). Sie verf&uuml;gen &uuml;ber zwei
getrennte PCI-Busse, PCI0 und PCI1. PCI0 stellt einen reinen PCI Steckplatz und drei
PCI/EISA Steckpl&auml;tze zur Verf&uuml;gung. PCI0 enth&auml;lt auch eine PCI/EISA
bridge, die die seriellen und parallelen Schnittstellen, Tastatur, Maus, etc. ansteuert.
PCI1 stellt 4 PCI Steckpl&auml;tze und einen Symbios 810 SCSI Kontroller zur
Verf&uuml;gung. VGA Karten f&uuml;r die Konsole m&uuml;ssen an PCI0 angeschlossen
werden.</p>

<p>Die aktuellen Versionen von FreeBSD haben Probleme mit den PCI Bridges. Zur Zeit steht
nur eine Notl&ouml;sung zur Verf&uuml;gung, die eine Bridge mit nur einem Ger&auml;t
unterst&uuml;tzt. Dadurch ist es m&ouml;glich, den von Digital eingebauten Qlogic SCSI
Hostadapter zu benutzen, der hinter einer 21054 PCI Bridge sitzt.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Die EISA Steckpl&auml;tze werden zur Zeit nicht unterst&uuml;tzt,
aber die Compaq Qvision EISA VGA Karte wird als ISA Ger&auml;t behandelt und kann daher
f&uuml;r die Konsole benutzt werden. Wenn Sie die EISA-Steckpl&auml;tze benutzen,
m&uuml;ssen Sie das EISA Configuration Utility (ECU) von Diskette starten. Tun Sie sich
selbst einen Gefallen und verwenden Sie das Tru64/OpenVMS ECU, und nicht das WindowsNT
ECU.</p>
</blockquote>
</div>

<p>Die Stromversorgung der Rawhide wird &uuml;ber einen I2C-Kontroller gesteuert. Wenn
Sie sicher sein wollen, da&szlig; kein Teil des Systems mehr unter Spannung steht,
m&uuml;ssen Sie den Netzstecker ziehen.</p>

<p>Die Rawhide unterst&uuml;tzt RCM, Sie k&ouml;nnen das System also &uuml;ber das
Netzwerk ein- und ausschalten. Weitere Informationen &uuml;ber RMC finden Sie im Kapitel
&uuml;ber die DS10 in dieser Datei. Die Verwendung von RCM und RMC ist &uuml;brigens kein
Tippfehler, die diversen Dokumentationen nutzen beide Abk&uuml;rzungen. Bitte beachten
Sie, da&szlig; das An- und Abschalten nur funktioniert, wenn die RCM-Platine &uuml;ber
ein kleines Netzteil separat mit Strom versorgt. Das Netzteil sollte 9-12 V Gleichstrom
liefern und mu&szlig; an der kleinen Buchse neben dem Tastaturanschlu&szlig;
angeschlossen werden.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_KN300
cpu     EV5
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1121" name="AEN1121">2.3.14. AlphaServer 1200 (``Tincup'')
und AlphaStation 1200 (``DaVinci'')</a></h4>

<p>Der AlphaServer 1200 ist der Nachfolger AlphaServer 1000A. Das Geh&auml;use ist mit
dem des 1000A identisch, die Elektronik basiert allerdings auf der des AlphaServer 4000.
Diese Systeme sind f&uuml;r den Einbau von bis zu zwei CPUs vorgesehen. Die
Grundversorgung mit Festplatten &uuml;bernimmt ein StorageWorks Modul. Die f&uuml;r den
NT-Markt vorgesehenen Varianten der AS1200 hei&szlig;en DIGITAL Server 5300 (5/400 CPU)
und DIGITAL Server 5305 (5/533 CPU).</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21164A EV56 CPUs, 400 oder 533 MHz</p>
</li>

<li>
<p>Cache: 4 MByte pro CPU</p>
</li>

<li>
<p>Speicherzugriff: 128 Bit, ECC, DIMM Speicher auf zwei Speicherkarten</p>
</li>

<li>
<p>eingebauter Kontroller f&uuml;r ein Diskettenlaufwerk</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;</p>
</li>

<li>
<p>PS/2 Tastatur und Maus</p>
</li>
</ul>

<p>Die AS1200 nutzt 2 Speicherkarten mit je 8 Steckpl&auml;tzen f&uuml;r DIMMs. DIMMs
m&uuml;ssen paarweise installiert werden. Die Steckpl&auml;tze m&uuml;ssen der Reihe nach
gef&uuml;llt werden. Wenn DIMMs mit verschiedenen Gr&ouml;&szlig;en verwendet werden,
mu&szlig; Steckplatz 0 den gr&ouml;&szlig;ten DIMM enthalten. Die AS1200 benutzt eine
statische Anfangsadresse f&uuml;r die DIMMs, jedes DIMM beginnt bei einem vielfachen von
512 MByte. Wenn Sie DIMMs verwenden, die kleiner als 256 MByte sind, wird der
physikalische Speicher des Systems ``L&ouml;cher'' enthalten. Das System unterst&uuml;tzt
64 MByte und 256 MByte gro&szlig;e DIMMs. Dabei handelt es sich um die 72 Bit SDRAM
Variante, da das System ECC nutzt.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Unter FreeBSD werden zur Zeit nur maximal 2 GByte
unterst&uuml;tzt.</p>
</blockquote>
</div>

<p>Bei der AS1200 ist ein Symbios 810 SCSI-Kontroller eingebaut, der einen Fast SCSI Bus
zur Verf&uuml;gung stellt.</p>

<p>Bei der Tincup stehen 5 64-Bit PCI Steckpl&auml;tze, ein 32-Bit PCI Steckplatz und ein
EISA Steckplatz (der mit einem der 64 Bit PCI Steckpl&auml;tze &uuml;berlappt) zur
Verf&uuml;gung. Zwei separate PCI-Busse stehen zur Verf&uuml;gung, PCI0 und PCI1. Der 32
Bit PCI Steckplatz und die beiden oberen 64 PCI Steckpl&auml;tze geh&ouml;ren zu PCI0. An
PCI0 h&auml;ngt auch eine Intel 82375EB PCI/EISA Bridge, &uuml;ber die die seriellen und
parallelen Anschl&uuml;sse, Tastatur, Maus, etc. angesteuert werden. Zu PCI1 geh&ouml;ren
vier 64 Bit PCI-Steckpl&auml;tze und ein Symbios 810 SCSI Kontroller. VGA-Karten f&uuml;r
die Konsole m&uuml;ssen in einem zu PCI0 geh&ouml;renden Steckplatz installiert
werden.</p>

<p>Die Stromversorgung des Systems wird &uuml;ber einen I2C-Kontroller gesteuert. Wenn
Sie wirklich sein wollen, da&szlig; kein Teil des Systems mehr unter Spannung steht,
m&uuml;ssen Sie den Netzstecker ziehen. Die Tincup benutzt zwei Netzteile; allerdings nur
zur Lastverteilung und nicht als redundante Stromversorgung.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_KN300
cpu     EV5
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1151" name="AEN1151">2.3.15. AlphaServer 8200 und 8400
(``TurboLaser'')</a></h4>

<p>Die AlphaServer 8200 und 8400 sind als Server f&uuml;r ein Firmennetzwerk gedacht, die
entweder in einem hohen 19&quot; Schrank (9200) oder einem breiten 19&quot; Rack
eingebaut sind. Diese Maschinen sind das ber&uuml;hmte ``big iron'', keine Systeme
f&uuml;r den Privatmann. Die TurboLaser k&ouml;nnen bis zu 12 CPUs pro Maschine
aufnehmen. Der TurboLaser System Bus (TLSB) erlaubt neun (AS8400) bzw. f&uuml;nf Knoten
(AS8200). Der TSLB besteht aus 256 Datenleitungen und 40 Adre&szlig;leitungen, der
maximale Durchsatz liegt bei 2.1 GByte/sec. Ein Knoten am TSLB kann eine CPU, Speicher,
oder I/O sein. An jeden TSLB werden maximal 3 I/O Knoten unterst&uuml;tzt.</p>

<p>Die Grundversorgung mit Festplatten &uuml;bernimmt ein StorageWorks Modul. Die AS8400
ben&ouml;tigt einen 3-Phasen-Wechselstrom (Drehstrom) Anschlu&szlig;, die AS8200 kommt
mit einem normalen Stromanschlu&szlig; aus.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21164 EV5/EV56 CPUs, max. 467 MHz oder 21264 EV67 CPUs max. 625 MHz</p>
</li>

<li>
<p>ein oder zwei CPUs pro CPU-Modul</p>
</li>

<li>
<p>Cache: 4 MByte B-Cache pro CPU</p>
</li>

<li>
<p>Speicherzugriff: 256 Bit, ECC</p>
</li>

<li>
<p>Speicher: gro&szlig; Speicherkarten, die an den TLSB angeschlossen werden und auf
denen spezielle SIMMs stecken. Die Speicherkarten sind in verschiedenen Gr&ouml;&szlig;en
erh&auml;ltlich, bis zu 4 GByte pro Karte. Die Karten nutzen ECC (8 Bit ECC pro 64 Bit
Daten). Die AS8400 kann maximale 7, die AS8200 maximal 3 Speicherkarte aufnehmen.
Maximaler Speicherausbau: 28 GByte.</p>
</li>

<li>
<p>Expansion: 3 System ``I/O Ports'', die jeweils bis zu 12 I/O Kan&auml;le erlauben. An
jeden I/O-Kanal kann eine XMI-, Futurebus+- oder PCI-Box angeschlossen werden.</p>
</li>
</ul>

<p>FreeBSD unterst&uuml;tzt (dies wurde auch getestet) bis zu 2 GByte Speicher in einem
TurboLaser. Sie sollten sorgf&auml;ltig abw&auml;gen, ob Sie die TSLB Steckpl&auml;tze
mit Speicherkarten oder CPU-Karten f&uuml;llen. Wenn Sie sich zum Beispiel f&uuml;r 28
GByte Speicher entscheiden, k&ouml;nnen Sie zur gleichen Zeit nur zwei CPUs (eine Karte)
verwenden.</p>

<p>FreeBSD unterst&uuml;tzt nur die PCI Steckpl&auml;tze. XMI und Futurebus+ (die es nur
beim AS8400 gibt) werden beide nicht unterst&uuml;tzt.</p>

<p>Die Karten f&uuml;r die I/O Port haben die Bezeichnungen KFTIA oder KFTHA. Diese
Karten stellen die sogenannten ``Hoses'' bereit, an die bis zu vier (KFTHA) bzw. ein
(KFTIA) PCI Bus angeschlossen werden kann. KFTIA stellt zwei 10baseT
Ethernet-Anschl&uuml;sse, einen FDDI-Anschlu&szlig;, drei Fast Wide Differential SCSI
Busse und einen Fast Wide Single Ended SCSI Bus zur Verf&uuml;gung. Der FWSE SCSI Bus ist
f&uuml;r das CDROM gedacht.</p>

<p>Die KFTHA unterst&uuml;tzt an jedem Ihrer vier Hoses eine DWLPA oder DWLPB Box. Diese
beherbergen jeweils 12 32 Bit PCI Steckpl&auml;tze. Physikalisch handelt es sich dabei
zwar 3 Busse mit je vier Steckpl&auml;tze, aber f&uuml;r die Software scheint es sich um
einen PCI-Bus mit 12 Steckpl&auml;tzen zu handeln. Eine voll ausgebaute AS8x00 kann 3
(I/O Ports) mal 4 (Hoses) mal 12 (PCI Steckpl&auml;tze/DWLPx), also 144 PCI
Steckpl&auml;tze zur Verf&uuml;gung stellen. Die maximale Bandbreite pro KFTHA
betr&auml;gt 500 MByte/sec. Die DWLPA kann auch 8 EISA Karten aufnehmen, 2
Steckpl&auml;tze sind reine PCI-Steckpl&auml;tze, 2 Steckpl&auml;tze sind reine EISA
Steckpl&auml;tze. Zwei der zw&ouml;lf Steckpl&auml;tze werden immer von I/O- und
Verbinder-Karten belegt. Die bevorzugte I/O Box ist die DWLPB.</p>

<p>Um die h&ouml;chste Leistung zu erhalten, sollten Sie Anwendungen mit hoher Bandbreite
(FibreChannel, Gigabit Ethernet) &uuml;ber mehrere Hoses und/oder mehrere multiple
KFTHA/KFTIA verteilen.</p>

<p>Momentan sind PCI Karten, welche PCI Bridges verwenden, mit FreeBSD nicht nutzbar.
Verzichten Sie also momentan auf diese Karten.</p>

<p>Der single ended narrow SCSI Bus auf der KFTIA wird vom System als <span
class="emphasis"><i class="EMPHASIS">vierter</i></span> SCSI Bus angezeigt, da die drei
Fast Wide Differential SCI Busse auf KFTIA Vorrang haben.</p>

<p>Die AS8x00 werden normalerweise mit einer seriellen Konsole benutzt. Einige neuere
Maschinen haben eventuell irgendeine Art von graphischer Konsole, aber FreeBSD wurde nur
mit einer seriellen Konsole gestestet.</p>

<p>Um die serielle Konsole benutzen zu k&ouml;nnen, m&uuml;ssen Sie in der <tt
class="FILENAME">/etc/ttys</tt> den Eintrag f&uuml;r die Konsole wie folgt
&auml;ndern:</p>

<pre class="PROGRAMLISTING">
console "/usr/libexec/getty std.9600"   unknown   on secure
</pre>

<p>Alternativ k&ouml;nnen Sie auch die folgende Zeile hinzuf&uuml;gen:</p>

<pre class="PROGRAMLISTING">
zs0     "/usr/libexec/getty std.9600"   unknown   on secure
</pre>

<p>Die Konfigurationsdatei f&uuml;r den Kernel f&uuml;r einen AlphaServer 8x00 mu&szlig;
die folgenden Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_KN8AE    # Alpha 8200/8400 (Turbolaser)
cpu     EV5
</pre>

<p>Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig, <var
class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist nur
notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1195" name="AEN1195">2.3.16. Alpha Processor Inc.
UP1000</a></h4>

<p>Das UP1000 ist ein ATX Mainboard mit einer 21264a CPU, die auf einer Slot B Karte
steckt. Es wird normalerweise in einen ATX Tower eingebaut.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21264a Alpha CPU, 600 oder 700 MHz, auf einer Slot B Karte (inklusive der
L&uuml;fter)</p>
</li>

<li>
<p>Speicherzugriff: 128 Bits bis zum L2 Cache, 64 Bits vom Slot B bis zum AMD-751</p>
</li>

<li>
<p>on-board Bcache / L2 cache: 2MB (600 MHz) oder 4MB (700 MHz)</p>
</li>

<li>
<p>AMD AMD-751 (``Irongate'') system controller chip</p>
</li>

<li>
<p>Acer Labs M1543C PCI-ISA Bridge / super-IO chip</p>
</li>

<li>
<p>PS/2 Maus und Tastatur</p>
</li>

<li>
<p>Speicher: ungepufferte 168-pin PC100 SDRAM DIMMS, 3 DIMM Steckpl&auml;tze, nur DIMMs
mit 64, 128 oder 256 MByte werden unterst&uuml;tzt</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;, ECP/EPP</p>
</li>

<li>
<p>Anschlu&szlig; f&uuml;r Diskettenlaufwerk</p>
</li>

<li>
<p>2 Ultra DMA33 IDE Kan&auml;le</p>
</li>

<li>
<p>2 USB Anschl&uuml;sse</p>
</li>

<li>
<p>Erweiterungen:</p>

<ul>
<li>
<p>4 32 Bit PCI Steckpl&auml;tze</p>
</li>

<li>
<p>2 ISA Steckpl&auml;tze</p>
</li>

<li>
<p>1 AGP Steckplatz</p>
</li>
</ul>
</li>
</ul>

<p>Bei Slot B handelt es sich um eine kleine Box, die eine Karte mit CPU und Cache
enth&auml;lt. Weiterhin sind zwei kleine L&uuml;fter angebracht. Laute L&uuml;fter...</p>

<p>Das System ben&ouml;tigt ECC-f&auml;hige DIMMs, also die 72 Bit Variante. Diese
Information wird in den Unterlagen zur UP1000 nicht erw&auml;hnt. Das System liest das
serielle EEPROM auf DIMMs &uuml;ber den SM Bus aus. Wenn nur ein DIMM vorhanden ist,
mu&szlig; es in Steckplatz <span class="emphasis"><i class="EMPHASIS">2</i></span>
eingebaut werden. Dies ist etwas seltsam.</p>

<p>Laut Hersteller ben&ouml;tigt man f&uuml;r ein UP1000 ein 400Watt ATX Netzteil. Wenn
man den Stromverbrauch von CPU und Mainboard betrachtet, scheint dies etwas
&uuml;bertrieben. Allerdings sollten Sie wie immer an Ihre Steckkarten und
Peripherieger&auml;te denken. Ein M1543C Baustein stellt Stromspar- und
Temperatur&uuml;berwachungsfunktionen bereit (via I2C/SM Bus).</p>

<p>Das UP1000 wird standardm&auml;&szlig;ig nur mit dem AlphaBIOS geliefert. Die Firmware
f&uuml;r die SRM Konsole ist auf der Webseite von Alpha Processor Inc. erh&auml;ltlich.
Zur Zeit ist nur eine Beta-Version verf&uuml;gbar, die f&uuml;r die auch f&uuml;r die
Portierung von FreeBSD auf das UP1000 genutzt wurde.</p>

<p>Die SRM Konsole kann von den eingebauten Ultra DMA EIDE Kan&auml;le booten.</p>

<p>Der SRM der UP1000 kann auch von einem Adaptec 294x Hostapdater booten, allerdings
traten mit einem Adaptec 294x unter hoher Last ``Aussetzer'' auf. Ein Hostadapter mit
einem Symbios 875 funktionierte mit sym Treiber problemlos. H&ouml;chstwahrscheinlich
funktionieren auch alle anderen Hostadapter mit Symbios-Chipsatz, wenn sie vom sym
Treiber unterst&uuml;tzt werden.</p>

<p>Die USB Anschl&uuml;sse werden von der SRM Konsole deaktiviert und wurden (noch) nicht
mit FreeBSD getestet.</p>

<p>Die Konfigurationsdatei f&uuml;r einen Kernel f&uuml;r das UP1000 mu&szlig; die
folgenden Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   API_UP1000   # UP1000, UP1100 (Nautilus)
cpu     EV5
</pre>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1245" name="AEN1245">2.3.17. Alpha Processor Inc.
UP1100</a></h4>

<p>Das UP1100 ist ein ATX Mainboard mit einer 21264a CPU, die mit 600 MHz betrieben wird.
Es wird normalerweise in einen ATX Tower eingebaut.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21264a Alpha EV6 CPU, 600 oder 700 MHz</p>
</li>

<li>
<p>Speicherzugriff: 100 MHz 64-Bit (PC-100 SDRAM), Bandbreite 800 MB/s</p>
</li>

<li>
<p>on-board Bcache / L2 cache: 2 MByte</p>
</li>

<li>
<p>AMD AMD-751 (``Irongate'') system controller chip</p>
</li>

<li>
<p>Acer Labs M1535D PCI-ISA Bridge / super-IO chip</p>
</li>

<li>
<p>PS/2 Maus und Tastatur</p>
</li>

<li>
<p>Speicher: ungepufferte 168-pin PC100 SDRAM DIMMS, 3 DIMM Steckpl&auml;tze, nur DIMMs
mit 64, 128 oder 256 MByte werden unterst&uuml;tzt</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;, ECP/EPP</p>
</li>

<li>
<p>Anschlu&szlig; f&uuml;r Diskettenlaufwerk</p>
</li>

<li>
<p>2 Ultra DMA66 IDE Kan&auml;le</p>
</li>

<li>
<p>2 USB Anschl&uuml;sse</p>
</li>

<li>
<p>Erweiterungen: 3 32 Bit PCI Steckpl&auml;tze und ein AGP2x Steckplatz</p>
</li>
</ul>

<p>Das UP1100 wird standardm&auml;&szlig;ig mit SRM Konsole geliefert. Die SRM Konsole
ist einem 2 MByte gro&szlig;en Flash ROM untergebracht.</p>

<p>Das System ben&ouml;tigt ECC-f&auml;hige DIMMs, also die 72 Bit Variante. Diese
Information wird in den Unterlagen zur UP1000 nicht erw&auml;hnt. Das System liest das
serielle EEPROM auf DIMMs &uuml;ber den SM Bus aus. Wenn nur ein DIMM vorhanden ist,
mu&szlig; es in Steckplatz <span class="emphasis"><i class="EMPHASIS">2</i></span>
eingebaut werden. Dies ist etwas seltsam.</p>

<p>Laut Hersteller ben&ouml;tigt man f&uuml;r ein UP1000 ein 400Watt ATX Netzteil. Wenn
man den Stromverbrauch von CPU und Mainboard betrachtet, scheint dies etwas
&uuml;bertrieben. Allerdings sollten Sie wie immer an Ihre Steckkarten und
Peripherieger&auml;te denken Ein M1535D Baustein stellt Stromspar- und
Temperatur&uuml;berwachungsfunktionen bereit (via I2C/SM Bus, mit einem LM75
Thermof&uuml;hler).</p>

<p>Auf dem Mainboard ist ein 21143 10/100MBit Ethernet Anschlu&szlig; untergebracht.</p>

<p>Das UP1100 enth&auml;lt au&szlig;erdem ein SoundBlaster kompatibles Audiosystem. Ob es
von FreeBSD unterst&uuml;tzt wird, ist noch unbekannt.</p>

<p>Die SRM Konsole kann von den eingebauten Ultra DMA EIDE Kan&auml;le booten.</p>

<p>Das UP1100 besitzt 3 USB Anschl&uuml;sse, zwei stehen extern zur Verf&uuml;gung, einer
ist mit dem AGP Steckplatz verbunden.</p>

<p>Die Konfigurationsdatei des Kernels f&uuml;r ein UP1100 mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   API_UP1000   # UP1000, UP1100 (Nautilus)
cpu     EV5
</pre>

<p>Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig, <var
class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist nur
notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1293" name="AEN1293">2.3.18. Alpha Processor Inc. CS20,
Compaq DS20L</a></h4>

<p>Der CS20 ist ein 19&quot; breiter, 1HE hoher Server mit einer oder zwei 21264[ab]
CPUs. Dieser Rechner wird von Compaq unter dem Namen Alphaserver DS20L verkauft. Der
DS20L enth&auml;lt zwei 833 MHz CPUs.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21264a Alpha CPU, 667 MHz oder 21264b, 833 MHz (max. 2 CPUs)</p>
</li>

<li>
<p>Speicherzugriff: 100 MHz 256-Bit breit</p>
</li>

<li>
<p>21271 Core Logic chipset (``Tsunami'')</p>
</li>

<li>
<p>Acer Labs M1533 PCI-ISA Bridge controller / super-IO chip</p>
</li>

<li>
<p>PS/2 Maus und Tastatur</p>
</li>

<li>
<p>Speicher: gepufferte/registrierte 168-Pin PC100 PLL SDRAM DIMMS, 8 DIMM
Steckpl&auml;tze, ECC, minimal 256 MByte, maximal 2 GByte Speicher</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paralleler Anschlu&szlig;, ECP/EPP</p>
</li>

<li>
<p>ALI M1543C Ultra DMA66 IDE Anschlu&szlig;</p>
</li>

<li>
<p>zwei Intel 82559 10/100MBit Anschl&uuml;sse</p>
</li>

<li>
<p>Symbios 53C1000 Ultra160 SCSI Hostadapter</p>
</li>

<li>
<p>Erweiterungen: 2 64 Bit PCI Steckpl&auml;tze (2/3 L&auml;nge)</p>
</li>
</ul>

<p>Das CS20 wird standardm&auml;&szlig;ig mit SRM Konsole geliefert. Die SRM Konsole ist
einem 2 MByte gro&szlig;en Flash ROM untergebracht.</p>

<p>Das CS20 ben&ouml;tigt ECC-f&auml;hige DIMMs. Beachten Sie, da&szlig; es <span
class="emphasis"><i class="EMPHASIS">gepufferte</i></span> DIMMs verwendet.</p>

<p>Das CS20 verf&uuml;gt &uuml;ber ein internes &Uuml;berwachungssystem auf I2C-Basis,
mit dem Temperatur, L&uuml;fter, Spannungen, etc. &uuml;berwacht werden. Das I2C
unterst&uuml;tzt auch ``wake on LAN''.</p>

<p>Jeder PCI Steckplatz ist mit einem eigenem PCI Bus auf dem Tsunami verbunden.</p>

<p>Die SRM Konsole kann von den eingebauten Ultra DMA EIDE Kan&auml;le booten.</p>

<p>Das CS20 verf&uuml;gt &uuml;ber ein eingebautes slim-line IDE CDROM. Weiterhin steht
ein von vorne zug&auml;nglicher Schacht f&uuml;r eine 1&quot; hohe 3.5&quot; SCSI
Festplatte mit SCA Anschlu&szlig; zur Verf&uuml;gung.</p>

<p>Bitte beachten Sie, da&szlig; es kein Diskettenlaufwerk (und auch keinen
Anschlu&szlig; daf&uuml;r) gibt.</p>

<p>Die Konfigurationsdatei f&uuml;r den Kernel mu&szlig; die folgenden Zeilen
enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_ST6600
cpu     EV5
</pre>

<p>Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig, <var
class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist nur
notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN1340" name="AEN1340">2.3.19. Compaq AlphaServer ES40
(``Clipper'')</a></h4>

<p>Die ES40 ist ein SMP System f&uuml;r 1 bis 4 CPUs vom Typ 21264. Diese Server werden
in der Maximalkonfiguration mit 32 GByte Speicher h&auml;ufig f&uuml;r gro&szlig;e
Datenbanken eingesetzt, ein weiteres ha&uuml;figes Einsatzgebiet sind HPTC
Server-Farmen.</p>

<p>Eigenschaften:</p>

<ul>
<li>
<p>21264 Alpha CPU mit 500 (EV6), 667 (EV67) oder 833 MHz (EV68) (max. 4 CPUs)</p>
</li>

<li>
<p>Speicherbus: 256 Bit breit</p>
</li>

<li>
<p>21272 Core Logic Chipsatz</p>
</li>

<li>
<p>PS/2 Maus und Tastatur</p>
</li>

<li>
<p>Speicher: 200-pin JEDEC Standard SDRAM DIMMS, maximal 32 GBytes Speicher</p>
</li>

<li>
<p>2 serielle Anschl&uuml;sse, 16550A</p>
</li>

<li>
<p>1 paraller Anschlu&szlig;, ECP/EPP</p>
</li>

<li>
<p>ALI M1543C Ultra DMA66 IDE Anschlu&szlig;</p>
</li>

<li>
<p>Eweiterung: 2 64 Bit PCI Busse</p>
</li>
</ul>

<p>Die SRM Konsole ist bei der ES40 Standard.</p>

<p>Die ES40 wird mit einem ATA CD-ROM Laufwerk geliefert, nutzt aber SCSI Festplatten.
Sie k&ouml;nnen von den &uuml;blichen Symbios und Qlogic Festplattencontrollern booten,
das gleiche gilt auch f&uuml;r den KZPEA alias Adaptec 39160 Adapter, der zwei LVD U160
SCSI-Kan&auml;le zur Verf&uuml;gung stellt.</p>

<p>Der Speicher ist auf 4 Speicher-Arrays verteilt, die jeweils 4 SDRAM DIMMs entahlten.
Jedes DIMM ist 72 Bit breit und wird mit 100 MHz angesprochen. Jedes Array kann zwei
S&auml;tze DIMMs aufnehmen, also maximal 8 DIMMs pro Array. Die DIMMs werden in Memory
Mother Boards (MMBs) eingebaut. Es gibt zwei MMB-Versionen, mit 4 bzw. 8 DIMM
Steckpl&auml;tzen. Jedes MMB stellt die H&auml;lfte des 256 Bit breiten Speicherbusses
zur CPU bereit. Aufgrund der Vielzahl der m&ouml;glichen Speicherkonfigurationen ist ein
Blick in die Systemdokumentation sinnvoll, um die optimale Speicherkonfiguration zu
bestimmen.</p>

<p>Die ES40 verf&uuml;gt je nach Modell &uuml;ber 6 oder 10 PCI Slots (64 bit). Die
eigentliche Platine ist identisch, in der 6-Slot-Version stehen lediglich weniger
Steckpl&auml;tze zur Verf&uuml;gung.</p>

<p>Die ES40 hat die aus der DS10 und DS20 bekannte RMC Steuerung f&uuml;r die
Spannungsversorgung, Details finden Sie in diesem Dokument im Abschnitt &uuml;ber die
DS10. Die meisten Modelle der ES40 k&ouml;nen mehrere Netzteile nutzen, was eine N+1
Redundanz m&ouml;glich macht. Bei der Installation von CPU Karten m&uuml;ssen Sie alle
Netzkabel abziehen, da die CPU Karten st&auml;ndig von den Netzteilen mit Spannung
versorgt werden. In Systemen mit maximalen Speicherausbau brauchen Sie mehr Netzteile als
in der Standardkonfiguration.</p>

<p>Die Konfigurationsdatei f&uuml;r den angepa&szlig;ten Kernel mu&szlig; die folgenden
Zeilen enthalten:</p>

<pre class="PROGRAMLISTING">
options   DEC_ST6600
cpu     EV5
</pre>

<p>Obwohl Sie es vielleicht erwartet haben, ist es nicht notwendig, <var
class="LITERAL">cpu EV6</var> anzugeben. Das <var class="LITERAL">cpu EV5</var> ist nur
notwendig, damit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a> nicht
meckert.</p>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN1377" name="AEN1377">2.4. &Uuml;bersicht &uuml;ber die
unterst&uuml;tzte Hardware</a></h3>

<p>Ein Hinweis vorab: Es sind l&auml;ngst nicht so viele FreeBSD/Alpha Systeme in Betrieb
wie FreeBSD/Intel. Mit anderen Worten, es ist sehr viel unwahrscheinlicher, da&szlig;
eine der vielen verschiedenen PCI/ISA Karten auf einer Alpha getestet wurde, als das bei
Intel der Fall ist. Das bedeutet nicht unbedingt, da&szlig; es Probleme geben mu&szlig;,
allerdings ist es deutlich wahrscheinlicher, da&szlig; Sie sich auf unbekanntes Gebiet
wagen. <tt class="FILENAME">GENERIC</tt> enth&auml;lt nur Ger&auml;te, von denen wir
wissen, da&szlig; Sie in einer Alpha funktionieren.</p>

<p>PCI und ISA werden komplett unterst&uuml;tzt. Turbo Channel ist nicht im
Standardkernel (<tt class="FILENAME">GENERIC</tt>) enthalten und wird nur bedingt
unterst&uuml;tzt (n&auml;here Informationen finden Sie bei den einzelnen Systemen). MCA
wird nicht unterst&uuml;tzt. Bei EISA werden EISA-Karten nicht unterst&uuml;tzt, weil die
notwendigen Treiber fehlen. ISA Karten in EISA Steckpl&auml;tzen sollten funktionieren.
Die Compaq Qvision EISA VGA Karte wird im ISA-Modus betrieben und ist als Konsole
verwendbar.</p>

<p>Diskettenlaufwerke mit 1.44 MByte und 1.2 MByte werden unterst&uuml;tzt. Die in
einigen Alpha Systemen vorhandenen 2.88 MByte Diskettenlaufwerke werden nur als 1.44
MByte Laufwerke unterst&uuml;tzt.</p>

<p>ATA und ATAPI (IDE) Ger&auml;te werden von der <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ata&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ata</span>(4)</span></a>
Treiberfamilie unterst&uuml;tzt. Da die meisten Anwender in Ihren Alphas SCSI Festplatten
nutzen, werden diese Treiber nicht so intensiv getestet wie die SCSI-Treiber. Achten Sie
auf die Einschr&auml;nkungen beim Booten von IDE Festplatten, diese Angaben finden Sie
bei den Informationen zu den einzelnen Systemen.</p>

<p>In Punkto SCSI werden &uuml;ber die CAM Schicht die folgenden Hostadapter
vollst&auml;ndig unterst&uuml;tzt: Adaptec 2940x (auf Basis der AIC7xxx chips), Qlogic
Familie und Symbios. Wenn Sie U160 SCSI verwenden wollen, k&ouml;nnte der Adaptec 39160
Hostadapter mit seinen beiden LVD U160 SCSI-Kan&auml;len f&uuml;r sie interessant sein.
Compaq verkauft ihn unter der Bezeichnung KZPEA. Die neueren Versionen des SRM in
aktuellen Alpha-Modellen k&ouml;nnen von diesem Hostadapter booten. Denken Sie daran,
da&szlig; es system-spezifische Einschr&auml;nkungen gibt, wenn Sie von den verschiedenen
Hostadaptern booten wollen. Wenn uns die entsprechenden Einschr&auml;nkungen bekannt
waren, haben wir sie bei der Beschreibung der jeweiligen Systeme aufgef&uuml;hrt.</p>

<p>Die Qlogic QL2x00 FibreChannel Hostadapter werden vollst&auml;ndig
unterst&uuml;tzt.</p>

<p>Wenn Sie Ihre Alpha &uuml;ber Netzwerk booten wollen, brauchen Sie eine Netzwerkkarte,
die von der SRM Konsole unterst&uuml;tzt wird. Mit anderen Worten, eine Karte mit einem
21x4x Chip. Genau diese Karten wurden auch von Digital eingesetzt. Diese Chips werden bei
FreeBSD von <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=de&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">de</span>(4)</span></a> (alter Treiber)
oder <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=dc&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">dc</span>(4)</span></a> (neuer Treiber)
unterst&uuml;tzt. Einige neueren Versionen des SRM sollen auch die Intel 8255x Ethernet
Chips unterst&uuml;tzen, die vom FreeBSD <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=fxp&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">fxp</span>(4)</span></a>
unterst&uuml;tzt werden. Aber hier ist Vorsicht geboten: Es gibt Berichte, da&szlig; der
<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=fxp&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">fxp</span>(4)</span></a> nicht
sauber mit FreeBSD l&auml;uft (obwohl er bei FreeBSD/x86 ausgezeichnet funktioniert).</p>

<p>DEC DEFPA PCI FDDI Netzwerkkarten werden auf der Alpha unterst&uuml;tzt.</p>

<p>Die SRM Konsole emuliert normalerweise einen VGA kompatiblen Modus bei PCI VGA Karten.
Allerdings garantiert Compaq/DEC nicht daf&uuml;r, da&szlig; das bei jeder m&ouml;glichen
Karte funktioniert. Wenn der SRM der Meinung ist, da&szlig; das VGA in Ordnung ist, kann
FreeBSD die Karte benutzen. Der Treiber f&uuml;r die Konsole funktioniert genau wie auf
einem FreeBSD/intel System. Bitte denken Sie daran, da&szlig; die VESA Modi auf der Alpha
nicht unterst&uuml;tzt werden, Ihnen bleibt also nur die 80x25 Konsole.</p>

<p>In einigen Alphas finden Sie Grafikkarte mit einem TGA-Baustein. Diese einfache
Grafikkarte unterst&uuml;tzt die VGA-Emulation nicht und kann daher nicht als
FreeBSD-Konsole verwendet werden. Die TGA2 Grafikkarten unterst&uuml;tzen dagegen eine
VGA-Emulation und k&ouml;nnen als FreeBSD-Konsole genutzt werden.</p>

<p>Die in den meisten Alphas vorhandenen seriellen Schnittstellen nach dem ``PC
Standard'', werden unterst&uuml;tzt.</p>

<p>ISDN (i4b) wird von FreeBSD/alpha nicht unterst&uuml;tzt.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN1409" name="AEN1409">2.5. Danksagung</a></h3>

<p>Um dieses Dokument zusammenzustellen, wurden viele Quellen genutzt; aber die
wichtigste und wertvollste Quelle waren die <a href="http://www.netbsd.org/"
target="_top">NetBSD Webseiten</a>. Ohne NetBSD/alpha g&auml;be es kein
FreeBSD/alpha.</p>

<p>Die folgenden Personen haben mich bei der Arbeit an diesem Kapitel
unterst&uuml;tzt:</p>

<ul>
<li>
<p>Andrew Gallatin <code class="EMAIL">&#60;<a
href="mailto:gallatin@FreeBSD.org">gallatin@FreeBSD.org</a>&#62;</code></p>
</li>

<li>
<p>Chuck Robey <code class="EMAIL">&#60;<a
href="mailto:chuckr@FreeBSD.org">chuckr@FreeBSD.org</a>&#62;</code></p>
</li>

<li>
<p>Matthew Jacob <code class="EMAIL">&#60;<a
href="mailto:mjacob@FreeBSD.org">mjacob@FreeBSD.org</a>&#62;</code></p>
</li>

<li>
<p>Michael Smith <code class="EMAIL">&#60;<a
href="mailto:msmith@FreeBSD.org">msmith@FreeBSD.org</a>&#62;</code></p>
</li>

<li>
<p>David O'Brien <code class="EMAIL">&#60;<a
href="mailto:obrien@FreeBSD.org">obrien@FreeBSD.org</a>&#62;</code></p>
</li>

<li>
<p>Christian Weisgerber</p>
</li>

<li>
<p>Kazutaka YOKOTA</p>
</li>

<li>
<p>Nick Maniscalco</p>
</li>

<li>
<p>Eric Schnoebelen</p>
</li>

<li>
<p>Peter van Dijk</p>
</li>

<li>
<p>Peter Jeremy</p>
</li>

<li>
<p>Dolf de Waal</p>
</li>

<li>
<p>Wim Lemmers, ex-Compaq</p>
</li>

<li>
<p>Wouter Brackman, Compaq</p>
</li>

<li>
<p>Lodewijk van den Berg, Compaq</p>
</li>
</ul>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="SUPPORT" name="SUPPORT">3. Unterst&uuml;tzte
Ger&auml;te</a></h2>

$FreeBSD$

<p>Dieses Kapitel enth&auml;lt alle Ger&auml;te, die auf jeden Fall von FreeBSD auf alpha
Systemen unterst&uuml;tzt werden. Andere Konfigurationen k&ouml;nnen auch funktionieren,
allerdings wurden sie noch nicht getestet. R&uuml;ckmeldungen, Erg&auml;nzungen und
Korrekturen werden dankend angenommen.</p>

<p>Wenn m&ouml;glich, wird der zum jeweiligen Ger&auml;t bzw. zur jeweiligen
Ger&auml;teklasse passende Treiber aufgef&uuml;hrt. Wenn es unter FreeBSD eine
Online-Hilfe f&uuml;r den betreffenden Treiber gibt (das ist der Normalfall), wird sie
ebenfalls aufgef&uuml;hrt. In dieser Online-Hilfe finden Sie genauere Informationen
&uuml;ber vom jeweiligen Treiber unterst&uuml;tzen Ger&auml;te und Controller finden.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Die Listen der von den jeweiligen Treiber unterst&uuml;tzen
Ger&auml;te werden nach und nach aus diesem Dokument entfernt, damit es nur noch eine,
zuverl&auml;ssige Quelle f&uuml;r diese Informationen gibt. Wenn diese
Aufr&auml;umarbeiten abgeschlossen sind, finden Sie die Liste der von einem Treiber
unterst&uuml;tzten Ger&auml;te in der Onlinehilfe zum jeweiligen Treiber.</p>
</blockquote>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN1458" name="AEN1458">3.1. Festplatten-Controller</a></h3>

<p>IDE/ATA Controller (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ata&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ata</span>(4)</span></a>
Treiber)</p>

<ul>
<li>
<p>Acard ATP850 UDMA2, ATP860 UDMA4, ATP865 UDMA6</p>
</li>

<li>
<p>AMD 756 ATA66, 766 ATA100, 768 ATA100</p>
</li>

<li>
<p>CMD 646, 648 ATA66, und 649 ATA100</p>
</li>

<li>
<p>Cypress 82C693</p>
</li>

<li>
<p>Cyrix 5530 ATA33</p>
</li>

<li>
<p>HighPoint HPT366 ATA66, HPT370 ATA100, HPT372 ATA133, HPT374 ATA133</p>
</li>

<li>
<p>Intel PIIX, PIIX3, PIIX4</p>
</li>

<li>
<p>Intel ICH ATA66, ICH2 ATA100, ICH3 ATA100, ICH4 ATA100</p>
</li>

<li>
<p>nVidia nForce ATA100, nForce2 ATA133</p>
</li>

<li>
<p>Promise ATA100 OEM Baustein (pdc20265)</p>
</li>

<li>
<p>Promise ATA133 OEM Baustein (pdc20269)</p>
</li>

<li>
<p>Promise Fasttrak-33, -66, -100, -100 TX2/TX4, -133 TX2/TX2000</p>
</li>

<li>
<p>Promise SATA150 TX2/TX4 Serial ATA/150</p>
</li>

<li>
<p>Promise Ultra-33, -66, -100, -133 TX2/TX2000/TX4000</p>
</li>

<li>
<p>ServerWorks ROSB4 ATA33</p>
</li>

<li>
<p>ServerWorks CSB5 und CSB6 ATA66/ATA100</p>
</li>

<li>
<p>Sil 0680 UDMA6</p>
</li>

<li>
<p>SiS 530, 540, 550, 620</p>
</li>

<li>
<p>SiS 630, 630S, 633, 635, 640, 645, 645DX, 648, 650, 651, 652, 655, 658, 730, 733, 735,
740, 745, 746, 748, 750, 751,752, 755</p>
</li>

<li>
<p>SiS 5591 ATA100</p>
</li>

<li>
<p>VIA 82C586 ATA33, 82C596 ATA66, 82C686a ATA66, 82C686b ATA100</p>
</li>

<li>
<p>VIA 8233, 8235 ATA133</p>
</li>
</ul>

<br />
<br />
<p>Adaptec AIC7770, AIC7850, AIC7860, AIC7870, AIC7880, und AIC789x SCSI Controller (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ahc&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ahc</span>(4)</span></a>
Treiber)</p>

<p>AMI MegaRAID RAID Controller, Modellreihen Express und Enterprise (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=amr&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">amr</span>(4)</span></a>
Treiber)</p>

<div class="NOTE">
<blockquote class="NOTE">
<p>Aufgrund von Einschr&auml;nkungen im SRM k&ouml;nnen Sie von diesen Hostadaptern nicht
booten.</p>
</blockquote>
</div>

<br />
<br />
<p>Mylex DAC RAID Controller, Firmware-Version 2.x, 3.x, 4.x und 5.x (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=mlx&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">mlx</span>(4)</span></a>
Treiber)</p>

<div class="NOTE">
<blockquote class="NOTE">
<p>Aufgrund von Einschr&auml;nkungen im SRM k&ouml;nnen Sie von diesen Hostadaptern nicht
booten. Von DAC960 Controller f&uuml;r Alpha-Systeme, die von Digital/Compaq als Teil der
StorageWorks Familie verkauft wurden (wie z.B. der KZPSC oder KZPAC), k&ouml;nnen sie via
SRM booten. Allerdings benutzten diese Karten die Firmware-Version 2.x. Es ist nicht
bekannt, ob es auch mit einer neueren Firmware, via SRM von diesen Karten zu booten.</p>
</blockquote>
</div>

<br />
<br />
<p>LSI/SymBios (ehemals NCR) 53C8<var class="REPLACEABLE">XX</var> und 53C10<var
class="REPLACEABLE">XX</var> PCI SCSI Controller, sowohl auf Hostadaptern als auch
on-board (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ncr&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ncr</span>(4)</span></a> und <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sym&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sym</span>(4)</span></a>
Treiber)</p>

<p>Qlogic Controller und kompatible Ger&auml;te (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=isp&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">isp</span>(4)</span></a>
Treiber)</p>

<p>LSI Logic Fusion/MP architecture Fiber Channel Controller (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=mpt&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">mpt</span>(4)</span></a>
Treiber)</p>

<p>Mit allen unterst&uuml;tzten SCSI Controllern ist die uneingeschr&auml;nkte Nutzung
von SCSI-I, SCSI-II und SCSI-III Ger&auml;ten m&ouml;glich. Dazu geh&ouml;ren
Festplatten, optische Platten, Bandlaufwerke (u.a. DAT, 8mm Exabyte, Mammoth, DLT),
Wechselplatten, Ger&auml;te mit eigenem Prozessor und CDROM. Sie k&ouml;nnen mit den
CD-Treibern (wie <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=cd&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">cd</span>(4)</span></a>) lesend auf
WORMs zugreifen, wenn diese die entsprechenden Kommandos f&uuml;r CDROM
unterst&uuml;tzen. F&uuml;r schreibenden Zugriff steht das Programm <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=cdrecord&sektion=1&manpath=FreeBSD+Ports"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">cdrecord</span>(1)</span></a> aus der
Ports Collection zur Verf&uuml;gung.</p>

<p>Zur Zeit unterst&uuml;tzte CDROM-Arten:</p>

<ul>
<li>
<p>SCSI Ger&auml;te (dazu geh&ouml;ren auch ProAudio Spectrum und SoundBlaster SCSI) (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=cd&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">cd</span>(4)</span></a>)</p>
</li>

<li>
<p>ATAPI IDE Ger&auml;te (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=acd&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">acd</span>(4)</span></a>)</p>
</li>
</ul>

<br />
<br />
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="ETHERNET" name="ETHERNET">3.2. Netzwerkkarten</a></h3>

<p>Adaptec Duralink PCI Fast Ethernet Netzwerkkarten, die auf dem Adaptec AIC-6915 Fast
Ethernet Controller basieren (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sf&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">sf</span>(4)</span></a> Treiber)</p>

<p>AMD PCnet Netzwerkkarten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=lnc&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">lnc</span>(4)</span></a> und <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=pcn&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">pcn</span>(4)</span></a>
Treiber)</p>

<ul>
<li>
<p>AMD PCnet/PCI (79c970 &#38; 53c974 oder 79c974)</p>
</li>

<li>
<p>AMD PCnet/FAST</p>
</li>

<li>
<p>Isolan AT 4141-0 (16 Bit)</p>
</li>

<li>
<p>Isolink 4110 (8 Bit)</p>
</li>

<li>
<p>PCnet/FAST+</p>
</li>

<li>
<p>PCnet/FAST III</p>
</li>

<li>
<p>PCnet/PRO</p>
</li>

<li>
<p>PCnet/Home</p>
</li>

<li>
<p>HomePNA</p>
</li>
</ul>

<br />
<br />
<p>RealTek 8129/8139 Fast Ethernet Netzwerkkarten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=rl&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">rl</span>(4)</span></a> Treiber)</p>

<p>Winbond W89C840F Fast Ethernet Karten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=wb&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">wb</span>(4)</span></a> Treiber)</p>

<p>VIA Technologies VT3043 ``Rhine I'', VT86C100A ``Rhine II'' und VT6105/VT6105M ``Rhine
III'' Fast Ethernet Karten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=vr&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">vr</span>(4)</span></a> Treiber)</p>

<p>Silicon Integrated Systems SiS 900 und SiS 7016 PCI Fast Ethernet Karten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sis&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sis</span>(4)</span></a>
Treiber)</p>

<p>National Semiconductor DP83815 Fast Ethernet Karten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sis&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sis</span>(4)</span></a>
Treiber)</p>

<p>Sundance Technologies ST201 PCI Fast Ethernet Karten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ste&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ste</span>(4)</span></a>
Treiber)</p>

<p>SysKonnect SK-984x PCI Gigabit Ethernet Karten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sk&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">sk</span>(4)</span></a> Treiber)</p>

<p>Texas Instruments ThunderLAN PCI Netzwerkkarten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=tl&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">tl</span>(4)</span></a> Treiber)</p>

<p>DEC/Intel 21143 Fast Ethernet Karten und Nachbauten f&uuml;r PCI, MiniPCI, und CardBus
(<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=dc&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">dc</span>(4)</span></a> Treiber)</p>

<p>Netzwerkkarten mit DEC DC21040, DC21041, DC21140, DC21141, DC21142 oder DC21143 (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=de&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">de</span>(4)</span></a> Treiber)</p>

<p>Fast Ethernet Karten mit Intel 82557, 82558, 82559, 82550 und 82562 (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=fxp&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">fxp</span>(4)</span></a>
Treiber)</p>

<ul>
<li>
<p>Intel EtherExpress Pro/100B PCI Fast Ethernet</p>
</li>

<li>
<p>Intel InBusiness 10/100 PCI Netzwerkkarten</p>
</li>

<li>
<p>Intel PRO/100+ Management Adapter</p>
</li>

<li>
<p>Intel Pro/100 VE Desktop Adapter</p>
</li>

<li>
<p>Intel Pro/100 M Desktop Adapter</p>
</li>

<li>
<p>Intel Pro/100 S Desktop, Server und Dual-Port Server Adapters</p>
</li>
</ul>

<br />
<br />
<p>Netzwerkkarten mit 3Com Etherlink XL Chipsatz (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=xl&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">xl</span>(4)</span></a> Treiber)</p>

<p>Ethernet und Fast Ethernet Karten mit 3Com 3XP Typhoon/Sidewinder (3CR990) Chipsatz
(<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=txp&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">txp</span>(4)</span></a>
Treiber)</p>

<p>Gigabit Ethernet Karten mit Intel 82542 und 82543 Controllern (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=gx&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">gx</span>(4)</span></a> und <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=em&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">em</span>(4)</span></a> Treiber), sowie
Karten auf Basis der 82540EM, 82544, 82545EM und 82546EB Chips&auml;tze (nur <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=em&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">em</span>(4)</span></a> Treiber)</p>

<p>Fast Ethernet und Gigabit Ethernet Karten mit RealTek RTL8139C+, RTL8169, RTL8169S
oder RTL8110S Chipsatz (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=re&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">re</span>(4)</span></a> Treiber)</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2177" name="AEN2177">3.3. FDDI Karten</a></h3>

<p>DEC DEFPA PCI (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=fpa&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">fpa</span>(4)</span></a>
Treiber)</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2187" name="AEN2187">3.4. ATM Karten</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2206" name="AEN2206">3.5. Karten f&uuml;r drahtlose
Netzwerke</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2232" name="AEN2232">3.6. Diverse Netzwerkkarten</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2255" name="AEN2255">3.7. ISDN Karten</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2319" name="AEN2319">3.8. Serielle Schnittstellen</a></h3>

<p>Serielle Schnittstellen nach ``PC standard'' auf Basis der 8250, 16450 und 16550 Chips
(<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sio&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sio</span>(4)</span></a>
Treiber)</p>

<p>AST 4 Port Karte (bei Benutzung eines gemeinsamen IRQs)</p>

<p>Comtrol Rocketport Karte (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=rp&sektion=4&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">rp</span>(4)</span></a> Treiber)</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2492" name="AEN2492">3.9. Audio Hardware</a></h3>

<p>ESS</p>

<ul>
<li>
<p>ES1868, ES1869, ES1879 und ES1888 (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sbc&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sbc</span>(4)</span></a>
Treiber)</p>
</li>

<li>
<p>Maestro-1, Maestro-2, und Maestro-2E</p>
</li>

<li>
<p>Maestro-3/Allegro</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Der Treiber f&uuml;r die Maestro-3/Allegro darf (und kann) aus
rechtlichen Gr&uuml;nden nicht fest in den Kernel eingebunden werden. Wenn Sie diesen
Treiber ben&ouml;tigen, m&uuml;ssen Sie die folgende Zeile in die Datei <tt
class="FILENAME">/boot/loader.conf</tt> eintragen:</p>

<pre class="SCREEN">
<kbd class="USERINPUT">snd_maestro3_load="YES"</kbd>
</pre>
</blockquote>
</div>
</li>
</ul>

<br />
<br />
<p>MSS/WSS kompatible DSPs (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=pcm&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">pcm</span>(4)</span></a>
Treiber)</p>

<p>Creative Technologies SoundBlaster Familie (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sbc&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sbc</span>(4)</span></a>
Treiber)</p>

<ul>
<li>
<p>SoundBlaster</p>
</li>

<li>
<p>SoundBlaster Pro</p>
</li>

<li>
<p>SoundBlaster AWE-32</p>
</li>

<li>
<p>SoundBlaster AWE-64</p>
</li>

<li>
<p>SoundBlaster AWE-64 GOLD</p>
</li>

<li>
<p>SoundBlaster ViBRA-16</p>
</li>
</ul>

<br />
<br />
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2614" name="AEN2614">3.10. Kameras, TV-Karten, etc</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="USB" name="USB">3.11. USB Ger&auml;te</a></h3>

<p>FreeBSD unterst&uuml;tzt viele verschiedene Arten von USB-Ger&auml;ten; in den
nachfolgenden Listen sind nur die Ger&auml;te aufgef&uuml;hrt, f&uuml;r die wir
Erfolgsmeldungen erhalten haben. Da sich die meisten USB-Ger&auml;te sehr &auml;hnlich
sind, werden &uuml;blicherweise alle Ger&auml;te einer Klasse funktionieren, auch wenn
Sie hier nicht explizit aufgef&uuml;hrt sind. Ausnahmen best&auml;tigen allerdings immer
die Regel.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> USB Netzwerkkarten finden Sie in einem eigenen Abschnitt im Kapitel
<a href="#ETHERNET">Netzwerkkarten</a>.</p>
</blockquote>
</div>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Bluetooth-Adapter f&uuml;r USB finden Sie in im Abschnitt <a
href="#BLUETOOTH">Bluetooth</a>.</p>
</blockquote>
</div>

<p>Host Controllers, die dem OHCI 1.0 Standard entsprechen (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ohci&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ohci</span>(4)</span></a>
Treiber)</p>

<p>Host Controllers, die dem UHCI 1.1 Standard entsprechen (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=uhci&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">uhci</span>(4)</span></a>
Treiber)</p>

<p>Hubs</p>

<p>Tastaturen (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ukbd&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ukbd</span>(4)</span></a>
Treiber)</p>

<p>M&auml;use (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ums&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ums</span>(4)</span></a>
Treiber)</p>

<p>Drucker und Adapterkabel f&uuml;r konventionelle Drucker (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ulpt&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ulpt</span>(4)</span></a>
Treiber)</p>

<ul>
<li>
<p>ATen parallel printer Adapter</p>
</li>

<li>
<p>Belkin F5U002 parallel printer Adapter</p>
</li>

<li>
<p>Canon BJ F850, S600</p>
</li>

<li>
<p>Canon LBP-1310, 350</p>
</li>

<li>
<p>Entrega USB-to-parallel printer Adapter</p>
</li>

<li>
<p>Hewlett-Packard HP Deskjet 3420 (P/N: C8947A #ABJ)</p>
</li>

<li>
<p>Oki Data MICROLINE ML660PS</p>
</li>

<li>
<p>Seiko Epson PM-900C, 880C, 820C, 730C</p>
</li>
</ul>

<br />
<br />
<p>Serielle Schnittstellen (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ubsa&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ubsa</span>(4)</span></a>, <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=uftdi&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">uftdi</span>(4)</span></a> und <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=uplcom&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">uplcom</span>(4)</span></a>
Treiber)</p>

<p>Massenspeicher (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=umass&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">umass</span>(4)</span></a>
Treiber)</p>

<ul>
<li>
<p>ADTEC Stick Drive AD-UST32M, 64M, 128M, 256M</p>
</li>

<li>
<p>Denno FireWire/USB2 Removable 2.5-inch HDD Case MIFU-25CB20</p>
</li>

<li>
<p>FujiFilm Zip USB Drive ZDR100 USB A</p>
</li>

<li>
<p>GREEN HOUSE USB Flash Memory ``PicoDrive'' GH-UFD32M, 64M, 128M</p>
</li>

<li>
<p>IBM 32MB USB Memory Key (P/N 22P5296)</p>
</li>

<li>
<p>IBM ThinkPad USB Portable CD-ROM Drive (P/N 33L5151)</p>
</li>

<li>
<p>I-O DATA USB x6 CD-RW Drive CDRW-i64/USB (nur CDROM</p>
</li>

<li>
<p>I-O DATA USB CD/CD-R/CD-RW/DVD-R/DVD-RW/DVD-RAM/DVD-ROM Laufwerk DV R-iUH2 (nur CDROM
und DVD-RAM)</p>
</li>

<li>
<p>Iomega Zip750 USB2.0 Drive</p>
</li>

<li>
<p>Keian USB1.1/2.0 3.5-inch HDD Case KU350A</p>
</li>

<li>
<p>Kurouto Shikou USB 2.5-inch HDD Case GAWAP2.5PS-USB2.0</p>
</li>

<li>
<p>Logitec USB1.1/2.0 HDD Unit SHD-E60U2</p>
</li>

<li>
<p>Logitec Mobile USB Memory LMC-256UD</p>
</li>

<li>
<p>Logitec USB Double-Speed Diskettenlaufwerk LFD-31U2</p>
</li>

<li>
<p>Logitec USB/IEEE1394 DVD-RAM/R/RW Unit LDR-N21FU2 (nur CDROM)</p>
</li>

<li>
<p>Matshita CF-VFDU03 Diskettenlaufwerk</p>
</li>

<li>
<p>MELCO USB2.0 MO Drive MO-CH640U2</p>
</li>

<li>
<p>MELCO USB/IEEE1394 Portable HD Drive HDP-i30P/CI, HDP-i40P/CI</p>
</li>

<li>
<p>MELCO USB Flash Disk ``PetitDrive'', RUF-32M, -64M, -128M, -256M</p>
</li>

<li>
<p>MELCO USB2.0 Flash Disk ``PetitDrive2'', RUF-256M/U2, -512M/U2</p>
</li>

<li>
<p>MELCO USB Flash Disk ``ClipDrive'', RUF-C32M, -C64M, -C128M, -C256M, -C512M</p>
</li>

<li>
<p>Microtech USB-SCSI-HD 50 USB-auf-SCSI Kabel</p>
</li>

<li>
<p>Panasonic Diskettenlaufwerk</p>
</li>

<li>
<p>Panasonic USB2.0 Portable CD-RW Drive KXL-RW40AN (nur CDROM)</p>
</li>

<li>
<p>RATOC Systems USB2.0 Removable HDD Case U2-MDK1, U2-MDK1B</p>
</li>

<li>
<p>Sony Portable CD-R/RW Drive CRX10U (CDROM only)</p>
</li>

<li>
<p>TEAC Portable USB CD-ROM Unit CD-110PU/210PU</p>
</li>

<li>
<p>Y-E Data Diskettenlaufwerk (720/1.44/2.88Mb)</p>
</li>
</ul>

<br />
<br />
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="FIREWIRE" name="FIREWIRE">3.12. IEEE 1394 (Firewire)
Ger&auml;te</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="BLUETOOTH" name="BLUETOOTH">3.13. Bluetooth Ger&auml;te</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2840" name="AEN2840">3.14.
Verschl&uuml;sselungs-Hardware</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN2858" name="AEN2858">3.15. Diverses</a></h3>

<p>Diskettenlaufwerk (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=fdc&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">fdc</span>(4)</span></a>
Treiber)</p>

<p>VGA-Kompatible Grafikkarten (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=vga&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">vga</span>(4)</span></a>
Treiber)</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Informationen &uuml;ber spezielle Grafikkarten und ihre
Kompatibilit&auml;t mit <b class="APPLICATION">XFree86</b> k&ouml;nnen Sie bei <a
href="http://www.xfree86.org/" target="_top">http://www.xfree86.org/</a> finden.</p>
</blockquote>
</div>

<br />
<br />
<p>Tastaturen:</p>

<ul>
<li>
<p>AT-Tastaturen (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=atkbd&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">atkbd</span>(4)</span></a>
Treiber)</p>
</li>

<li>
<p>PS/2-Tastaturen (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=atkbd&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">atkbd</span>(4)</span></a>
Treiber)</p>
</li>

<li>
<p>USB-Tastaturen (genaue Modellbezeichnungen finden Sie im Kapitel <a href="#USB">USB
Ger&auml;te</a>)</p>
</li>
</ul>

<br />
<br />
<p>M&auml;use:</p>

<ul>
<li>
<p>PS/2 M&auml;use und kompatible Ger&auml;te, unter anderem viele der bei Laptops
verwendeten Touchpads und Glidepoints (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=psm&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">psm</span>(4)</span></a>
Treiber)</p>
</li>

<li>
<p>serielle M&auml;se und kompatible Ger&auml;te</p>
</li>

<li>
<p>USB M&auml;use (genaue Modellbezeichnungen finden im Kapitel <a href="#USB">USB
Ger&auml;te</a>)</p>
</li>
</ul>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> In <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=moused&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">moused</span>(8)</span></a> finden
Sie weitere Informationen zur Nutzung von M&auml;usen in FreeBSD. Informationen &uuml;ber
die Nutzung von M&auml;usen in <b class="APPLICATION">XFree86</b> erhalten Sie bei <a
href="http://www.xfree86.org/" target="_top">http://www.xfree86.org/</a>.</p>
</blockquote>
</div>

<br />
<br />
<p>Parallele Schnittstellen nach ``PC-Standard'' (<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ppc&sektion=4&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ppc</span>(4)</span></a>
Treiber)</p>
</div>
</div>
</div>

<hr />
<p align="center"><small>Diese Datei und andere Dokumente zu dieser Version sind bei <a
href="ftp://ftp.FreeBSD.org/">ftp://ftp.FreeBSD.org/</a>verfuegbar.</small></p>

<p align="center"><small>Wenn Sie Fragen zu FreeBSD haben, lesen Sie erst die <a
href="http://www.FreeBSD.org/docs.html">Dokumentation,</a> bevor Sie sich an &#60;<a
href="mailto:de-bsd-questions@de.FreeBSD.org">de-bsd-questions@de.FreeBSD.org</a>&#62;
wenden.</small></p>

<p align="center"><small>Wenn Sie Fragen zu dieser Dokumentation haben, wenden Sie sich
an &#60;<a
href="mailto:de-bsd-translators@de.FreeBSD.org">de-bsd-translators@de.FreeBSD.org</a>&#62;.</small></p>

<br />
<br />
</body>
</html>

