<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy, see www.w3.org" />
<title>FreeBSD 5.2-RELEASE README</title>
<meta name="GENERATOR" content="Modular DocBook HTML Stylesheet Version 1.7" />
<link rel="STYLESHEET" type="text/css" href="docbook.css" />
</head>
<body class="ARTICLE" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#840084"
alink="#0000FF">
<div class="ARTICLE">
<div class="TITLEPAGE">
<h1 class="TITLE"><a id="AEN2" name="AEN2">FreeBSD 5.2-RELEASE README</a></h1>

<h3 class="CORPAUTHOR">Das FreeBSD Projekt</h3>

<p class="COPYRIGHT">Copyright &copy; 2000, 2001, 2002, 2003 The FreeBSD Documentation
Project</p>

<p class="COPYRIGHT">Copyright &copy; 2002, 2003 The FreeBSD German Documentation
Project</p>

<p class="PUBDATE">$FreeBSD$<br />
</p>

<div class="LEGALNOTICE"><a id="TRADEMARKS" name="TRADEMARKS"></a>
<p>FreeBSD ist ein eingetragenes Warenzeichen von Wind River Systems, Inc. Dies soll sich
bald &auml;ndern.</p>

<p>Intel, Celeron, EtherExpress, i386, i486, Itanium, Pentium und Xeon sind Warenzeichen
oder eingetragene Warenzeichen der Intel Corporation oder ihrer Gesellschaften in den
Vereinigten Staaten und in anderen L&auml;ndern.</p>

<p>Motif, OSF/1 und UNIX sind eingetragene Warenzeichen und IT DialTone und The Open
Group sind Warenzeichen der The Open Group in den Vereinigten Staaten und in anderen
L&auml;ndern.</p>

<p>Sparc, Sparc64, SPARCEngine und UltraSPARC sind Warenzeichen von SPARC International,
Inc in den Vereinigten Staaten und in anderen L&auml;ndern. Produkte, die das
Warenzeichen SPARC tragen, basieren auf einer von Sun Microsystems, Inc. entwickelten
Architektur.</p>

<p>Viele Produktbezeichnungen von Herstellern und Verk&auml;ufern sind Warenzeichen.
Soweit dem FreeBSD Project das Warenzeichen bekannt ist, werden die in diesem Dokument
vorkommenden Bezeichnungen mit dem Symbol ``&trade;'' oder dem Symbol ``&reg;''
gekennzeichnet.</p>
</div>

<hr />
</div>

<blockquote class="ABSTRACT">
<div class="ABSTRACT"><a id="AEN24" name="AEN24"></a>
<p>Dieses Dokument enth&auml;lt eine kurze Einf&uuml;hrung zu FreeBSD 5.2-RELEASE. Es
enth&auml;lt einige Hinweise, wie Sie FreeBSD beziehen k&ouml;nnen; wie Sie Kontakt zum
FreeBSD Project aufnehmen k&ouml;nnen, sowie Verweise auf zus&auml;tzliche
Informationsquellen.</p>
</div>
</blockquote>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="INTRO" name="INTRO">1. Einf&uuml;hrung</a></h2>

<p>Diese Ausgabe von FreeBSD ist eine release-Version von FreeBSD 5.2-RELEASE und
repr&auml;sentiert den aktuellen Zustand im Entwicklungszweig 5-CURRENT.</p>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN29" name="AEN29">1.1. &Uuml;ber FreeBSD</a></h3>

<p>FreeBSD ist ein auf 4.4 BSD Lite basierendes Betriebssystem f&uuml;r Intel, AMD, Cyrix
oder NexGen ``x86''-basierte PCs (<span class="TRADEMARK">i386</span>&#8482;), NEC
PC-9801/9821 und kompatible Systeme (pc98), DEC/Compaq/HP Alpha Systeme (alpha) und
UltraSPARC Systeme (<span class="TRADEMARK">Sparc64</span>&reg;). Versionen f&uuml;r die
Plattformen IA64 (ia64), <span class="TRADEMARK">PowerPC</span>&reg; (<span
class="TRADEMARK">PowerPC</span>) und AMD ``Hammer'' (amd64) sind ebenfalls in der
Entwicklung. FreeBSD unterst&uuml;tzt viele verschiedene Ger&auml;te und Umgebungen und
kann f&uuml;r alle Anwendungen von der Software-Entwicklung &uuml;ber Spiele bis zur
Anbietung von Diensten im Internet genutzt werden.</p>

<p>Diese Version von FreeBSD stellt Ihnen alles zur Verf&uuml;gung, was Sie zum Betrieb
eines derartigen Systems brauchen. Dazu geh&ouml;rt der Quellcode f&uuml;r den Kernel und
alle Programme des Basissystems. Wenn Sie die ``source'' Distribution installieren,
k&ouml;nnen Sie das gesamte System mit einem einzigen Befehl neu kompilieren. Diese
Eigenschaft macht es ideal f&uuml;r Studenten, Forscher, und interessierte Benutzer, die
einfach wissen wollen, wie das System funktioniert.</p>

<p>Die gro&szlig;e Sammlung von angepa&szlig;ter Software anderer Anbieter (die ``Ports
Collection'') macht es Ihnen leicht, ihre Lieblingtools f&uuml;r <span
class="TRADEMARK">UNIX</span>&reg; auch f&uuml;r FreeBSD zu finden und zu installieren.
Jeder ``port'' besteht aus einer Reihe von Skripten, um eine gegebene Anwendung mit einem
einzigen Kommando herunterladen, konfigurieren, kompilieren, und installieren zu
k&ouml;nnen. Die &uuml;ber 10,000 Ports (vom Editor &uuml;ber Programmiersprachen bis zu
graphischen Anwendungen) machen FreeBSD zu einer leistungsstarken und umfassenden
Arbeitsumgebung, die viele kommerzielle <span class="TRADEMARK">UNIX</span>-Varianten
weit hinter sich l&auml;&szlig;t. Die meisten Ports sind auch als vorkompilierte Packages
erh&auml;ltlich, die mit dem Installationsprogramm einfach und schnell installiert werden
k&ouml;nnen.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN45" name="AEN45">1.2. Zielgruppe</a></h3>

<p>Diese release von FreeBSD ist f&uuml;r alle Arten von Benutzern gedacht. Sie wurde
ausf&uuml;hrlich gepr&uuml;ft und getestet, um die gr&ouml;&szlig;tm&ouml;gliche
Zuverl&auml;ssigkeit und Betriebssicherheit garantieren zu k&ouml;&ouml;nnen.</p>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="OBTAIN" name="OBTAIN">2. Bezugsquellen f&uuml;r FreeBSD</a></h2>

<p>FreeBSD kann auf vielen verschiedenen Wegen bezogen werden. Dieses Kapitel
konzentriert sich auf die Varianten, die f&uuml;r den Bezug auf einer komplett neuen
Version von FreeBSD gedacht sind und weniger auf die M&ouml;glichkeit zur Aktualisierung
eines bereits bestehenden Systems.</p>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN51" name="AEN51">2.1. CDROM und DVD</a></h3>

<p>FreeBSD-RELEASE Distributionen k&ouml;nnen auf CDROM oder DVD von diversen Firmen
bezogen werden. Dies ist normalerweise der bequemste Weg, wenn Sie FreeBSD zum ersten Mal
installieren, da Sie das System einfach neu installieren k&ouml;nnen, falls das notwendig
ist. Einige Distributionen enthalten einige der optionalen ``Packages'' aus der FreeBSD
Ports Collection.</p>

<p>Eine &Uuml;bersicht &uuml;ber die Firmen, die FreeBSD auf CDROM oder DVD vertreiben,
finden Sie im Anhang <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/mirrors.html"
target="_top">``Bezugsquellen f&uuml;r FreeBSD''</a> des Handbuches.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN58" name="AEN58">2.2. FTP</a></h3>

<p>Sie k&ouml;nnen FreeBSD und/oder die optionalen Packages mit FTP vom prim&auml;ren
FreeBSD-Server <a href="ftp://ftp.FreeBSD.org/" target="_top">ftp://ftp.FreeBSD.org/</a>
und allen seinen ``mirrors'' beziehen.</p>

<p>Eine Liste von alternativen Bezugsquellen f&uuml;r FreeBSD finden Sie im Kapitel <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/mirrors-ftp.html"
target="_top">FTP Server</a> des Handbuchs und auf unseren <a
href="http://www.freebsdmirrors.org/" target="_top">http://www.freebsdmirrors.org/</a>
Webseiten. Wir raten Ihnen dringend, einen Mirror in der n&auml;heren Umgebung (aus
Netzwerksicht) zu verwenden.</p>

<p>Zus&auml;tzliche Mirrors sind immer willkommen. Wenden Sie sich bitte an <code
class="EMAIL">&#60;<a
href="mailto:freebsd-admin@FreeBSD.org">freebsd-admin@FreeBSD.org</a>&#62;</code>, wenn
Sie an weiteren Informationen zu diesem Thema interessiert sind. Zus&auml;tzliche
Informationen zu diesem Thema finden Sie im Artikel <a
href="http://www.FreeBSD.org/doc/en_US.ISO8859-1/articles/hubs/" target="_top">Mirroring
FreeBSD</a>.</p>

<p>Sie finden die f&uuml;r den Start der Installation notwendigen Images der
Bootdisketten und die Dateien der eigentlichen Distribution auf allen Servern. Einige
Server stellen auch die ISO-Images bereit, die Sie zur Erzeugung einer (bootf&auml;higen)
CDROM der FreeBSD-Release ben&ouml;tigen.</p>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="CONTACTING" name="CONTACTING">3. Kontaktinformation f&uuml;r das
FreeBSD Projekt</a></h2>

<div class="SECT2">
<h3 class="SECT2"><a id="AEN72" name="AEN72">3.1. Email und Mailinglisten</a></h3>

<p>Wenn Sie Fragen haben oder Hilfe ben&ouml;tigen, wenden Sie sich bitte an die
Mailingliste <a href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions"
target="_top">FreeBSD general questions</a>.</p>

<p>Wenn Sie die Entwicklung von 5-CURRENT mitverfolgen, <span class="emphasis"><i
class="EMPHASIS">m&uuml;ssen</i></span> Sie die Mailingliste <a
href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current"
target="_top">FreeBSD-CURRENT</a> lesen. Nur so k&ouml;nnen Sie die teilweise
lebensnotwendigen Informationen &uuml;ber die aktuellen Entwicklungen und &Auml;nderungen
erhalten, die Sie f&uuml;r den Betrieb des Systems ben&ouml;tigen.</p>

<p>Da FreeBSD zum gr&ouml;&szlig;ten Teil von Freiwilligen und Idealisten entwickelt
wird, freuen wir uns &uuml;ber jeden, der mit anpacken m&ouml;chte -- schon jetzt gibt es
mehr W&uuml;nsche als Zeit, um diese umzusetzen. Wenn Sie Kontakt zu den Entwicklern
suchen, um technische Angelegenheiten zu besprechen oder um Ihre Hilfe anzubieten, wenden
Sie sich bitte an Mailingliste <a
href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers" target="_top">FreeBSD
technical discussions</a>.</p>

<p>Bitte beachten Sie, auf diesen Mailinglisten teilweise <span class="emphasis"><i
class="EMPHASIS">extrem viele</i></span> Mails erscheinen. Wenn Ihre Mailversorgung nur
sehr langsam oder sehr teuer ist, oder Sie nur an den Schlagzeilen der
FreeBSD-Entwicklung interessiert sind, d&uuml;rfte es besser sein, wenn Sie sich auf die
Mailingliste <a href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce"
target="_top">FreeBSD announcements</a> konzentrieren.</p>

<p>Alle Mailinglisten stehen f&uuml;r jeden offen, der sich f&uuml;r das jeweilige Thema
interessiert. Besuchen Sie einfach mal auf der <a
href="http://www.FreeBSD.org/mailman/listinfo" target="_top">FreeBSD Mailman Info
Page</a>. Dort erhalten Sie weitergehende Informationen, wie Sie die diversen
Mailinglisten abonnieren k&ouml;nnen, wie Sie auf die Archive zugreifen k&ouml;nnen, usw.
Es gibt viele Mailinglisten, die nur mit einem ganz bestimmten Thema befassen und hier
nicht aufgef&uuml;hrt sind. Weitergehende Informationen finden Sie auf den Mailman Seiten
und im Bereich <a href="http://www.FreeBSD.org/support.html#mailing-list"
target="_top">Mailinglisten</a> der FreeBSD Webseite.</p>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Senden Sie <span class="emphasis"><i class="EMPHASIS">auf gar keinen
Fall</i></span> eine Mail an die Mailinglisten, um diese zu abonnieren. Benutzen Sie
f&uuml;r diesen Zweck das Mailman Interface.</p>
</blockquote>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN90" name="AEN90">3.2. Meldungen &uuml;ber Fehler und
Probleme</a></h3>

<p>Vorschl&auml;ge, Fehlermeldungen und zus&auml;tzlicher Sourcecode sind immer
willkommen -- bitte informieren Sie uns &uuml;ber jedes Problem, das sie finden.
Fehlermeldungen, die sofort auch die entsprechende Korrektur enthalten, sind
nat&uuml;rlich noch willkommener.</p>

<p>Wenn Ihr System an das Internet angeschlossen ist, sollten Sie <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=send-pr&sektion=1&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">send-pr</span>(1)</span></a>
benutzen. Wenn Sie Ihren ``Problem Report'' (PRs) auf dieser Art und Weise absetzen, wird
er automatisch archiviert und weiterverfolgt. Die Entwickler von FreeBSD bem&uuml;hen
sich, so schnell wie m&ouml;glich auf alle gemeldeten Fehler zu reagieren. <a
href="http://www.FreeBSD.org/cgi/query-pr-summary.cgi" target="_top">Eine &Uuml;bersicht
&uuml;ber alle offenen PRs</a> ist auf dem Webserver von FreeBSD verf&uuml;gbar. Diese
Liste ist sehr n&uuml;tzlich, wenn Sie wissen wollen, welche m&ouml;glichen Probleme
schon von anderen Benutzern gefunden wurden.</p>

<p>Bitte beachten Sie, da&szlig; <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=send-pr&sektion=1&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">send-pr</span>(1)</span></a> nur
ein Shell-Skript ist, da&szlig; man relativ einfach auch auf anderen Systemen als FreeBSD
verwenden kann. Wir empfehlen Ihnen dringend, diese Variante zu verwenden. Wenn Sie
allerdings aus irgendeinem Grund <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=send-pr&sektion=1&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">send-pr</span>(1)</span></a> nicht
benutzen k&ouml;nnen, k&ouml;nnen Sie versuchen, Ihren Problem Report an die Mailingliste
<a href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-bugs" target="_top">FreeBSD
problem reports</a> zu senden.</p>

<p>Weitere Informationen finden Sie im Dokument <a
href="http://www.FreeBSD.org/doc/en_US.ISO8859-1/articles/problem-reports/"
target="_top">``Writing FreeBSD Problem Reports''</a> auf der Webseite von FreeBSD. Es
enth&auml;lt viele n&uuml;tzliche Tips zum Verfassen und Versenden effektiver
Fehlermeldungen.</p>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="SEEALSO" name="SEEALSO">4. Weiterf&uuml;hrende
Dokumente</a></h2>

<p>Es gibt viele verschiedene Quellen f&uuml;r Informationen &uuml;ber FreeBSD, einige
sind Bestandteil dieser Distribution, w&auml;hrend andere &uuml;ber das Internet oder in
gedruckter Form verf&uuml;gbar sind.</p>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="RELEASE-DOCS" name="RELEASE-DOCS">4.1. Dokumentation zur
Release</a></h3>

<p>Sie finden weitergehende &uuml;ber diese release Distribution in anderen Dokumenten.
Diese Dokumente stehen in verschiedenen Formaten zur Verf&uuml;gung. Die Varianten Text
(<tt class="FILENAME">.TXT</tt>) und HTML (<tt class="FILENAME">.HTM</tt>) stehen fast
immer zur Verf&uuml;gung. Einige Distributionen stellen weitere Formate wie PostScript
(<tt class="FILENAME">.PS</tt>) oder das Portable Document Format (<tt
class="FILENAME">.PDF</tt>) zur Verf&uuml;gung.</p>

<ul>
<li>
<p><tt class="FILENAME">README.TXT</tt>: Sie lesen es gerade. Hier finden Sie allgemeine
Informationen &uuml;ber FreeBSD und ein paar allgemeine Hinweise zum Bezug einer
Distribution.</p>
</li>

<li>
<p><tt class="FILENAME">EARLY.TXT</tt>: Spezielle Hinweise f&uuml;r die ersten Anwender
von FreeBSD 5.2-RELEASE. Wenn dies Ihre erste Begegnung mit FreeBSD 5-CURRENT ist
und/oder Sie noch eine 5.<var class="REPLACEABLE">X</var> Version benutzt haben, sollten
Sie diesen Artikel auf jeden Fall lesen.</p>
</li>

<li>
<p><tt class="FILENAME">RELNOTES.TXT</tt>: Die begleitenden Informationen zu dieser
Release enthalten die Neuerungen in dieser Version von FreeBSD (5.2-RELEASE) und die
&Auml;nderungen seit der letzten Version (FreeBSD 5.1-RELEASE).</p>
</li>

<li>
<p><tt class="FILENAME">HARDWARE.TXT</tt>: Die Liste der unterst&uuml;tzten Hardware
enth&auml;lt eine &Uuml;bersicht &uuml;ber die Ger&auml;te, auf den FreeBSD erfolgreich
getestet wurde.</p>
</li>

<li>
<p><tt class="FILENAME">INSTALL.TXT</tt>: Die Anleitung zur Installation von FreeBSD von
dem Distributions-Medium.</p>
</li>

<li>
<p><tt class="FILENAME">ERRATA.TXT</tt>: Die Errata. Brandaktuelle Informationen, die
erst nach dem Erscheinen dieser Version bekannt wurden, finden Sie hier. Diese Datei ist
speziell f&uuml;r die Anwender einer Release (und nicht der Snapshots) von Interesse. Sie
sollten diesen Text auf jeden Fall lesen, bevor Sie FreeBSD installieren, da er die
aktuellsten Informationen &uuml;ber die seit der Ver&ouml;ffentlichung gefundenen und
behobenen Probleme enth&auml;lt.</p>
</li>
</ul>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Einige dieser Dokumente (speziell <tt
class="FILENAME">RELNOTES.TXT</tt>, <tt class="FILENAME">HARDWARE.TXT</tt>, und <tt
class="FILENAME">INSTALL.TXT</tt>) enthalten Informationen, die nur f&uuml;r eine
bestimmte Architektur gellten. Zum Beispiel enthalten die Release Notes f&uuml;r die
Alpha keine Informationen &uuml;ber <span class="TRADEMARK">i386</span> Systeme, und
umgekehrt. Die Information, zu welcher Architektur ein Dokument geh&ouml;rt, steht immer
am Anfang des Textes.</p>
</blockquote>
</div>

<p>Auf den Plattformen, auf denen <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sysinstall</span>(8)</span></a>
zur Verf&uuml;gung steht (zur Zeit alpha, <span class="TRADEMARK">i386</span>, ia64, pc98
und <span class="TRADEMARK">Sparc64</span>) finden Sie diese Dokumente w&auml;hrend der
Installation normalerweise unter dem Men&uuml;punkt Dokumentation. Um nach der
Installation des Systems dieses Men&uuml; zugreifen zu k&ouml;nnen, m&uuml;ssen Sie das
Programm <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sysinstall</span>(8)</span></a>
erneut aufrufen.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Sie sollten auf jeden Fall die Errata zur jeweiligen Version lesen,
bevor Sie die Installation beginnen. Dies ist der einzige Weg, die aktuellsten
Informationen zu erhalten und sich &uuml;ber eventuell nach der Installation auftretende
Probleme zu informieren. Die zusammen mit der Ver&ouml;ffentlichung erschienene Version
ist per Definition veraltet. Allerdings sind im Internet aktualisierte Versionen
verf&uuml;gbar, die die ``aktuellen Errata'' f&uuml;r diese Version sind. Diese Versionen
sind bei <a href="http://www.FreeBSD.org/releases/"
target="_top">http://www.FreeBSD.org/releases/</a> und allen aktuellen Mirrors dieser
Webseite verf&uuml;gbar.</p>
</blockquote>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN159" name="AEN159">4.2. Onlinehilfe (Manual Pages)</a></h3>

<p>Wie bei fast jedem anderen <span class="TRADEMARK">UNIX</span> &auml;hnlichen System
steht Ihnen auch bei FreeBSD eine Onlinehilfe zur Verf&uuml;gung, die Sie &uuml;ber das
Kommando <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=man&sektion=1&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">man</span>(1)</span></a> oder
&uuml;ber das <a href="http://www.FreeBSD.org/cgi/man.cgi" target="_top">hypertext manual
pages gateway</a> auf dem Webserver von FreeBSD ansprechen k&ouml;nnen. Die Onlinehilfe
stellt den Benutzern von FreeBSD Informationen zu einzelnen Befehlen und Interfaces zur
Programmierung zur Verf&uuml;gung.</p>

<p>In einige F&auml;llen behandelt die Online-Hilfe spezielle Themen. Interessante
Beispiele daf&uuml;r sind <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=tuning&sektion=7&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">tuning</span>(7)</span></a>
(Hinweise, wie sie die Performance Ihres Systems verbessern k&ouml;nnen), <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=security&sektion=7&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">security</span>(7)</span></a>
(eine Einf&uuml;hrung in das Thema Sicherheit unter FreeBSD), und <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=style&sektion=9&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">style</span>(9)</span></a> (die
Spielregeln f&uuml;r die Kernel-Programmierung).</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN177" name="AEN177">4.3. B&uuml;cher und Artikel</a></h3>

<p>Zwei extrem n&uuml;tzliche Sammlungen von Informationen &uuml;ber FreeBSD, die vom
FreeBSD Project verwaltet werden, sind das FreeBSD Handbuch und der FreeBSD FAQ. Die
aktuellen Versionen des <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/"
target="_top">Handbuches</a> und der <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/faq/" target="_top">FAQ</a> sind
immer auf der Webseite <a href="http://www.FreeBSD.org/docs.html" target="_top">FreeBSD
Dokumentation</a> und allen Ihren Mirror-Sites verf&uuml;gbar. Wenn Sie die Distribution
<tt class="FILENAME">doc</tt> installiert haben, k&ouml;nnen Sie den FAQ und Handbuch mit
einem Web-Browser direkt auf Ihrem System lesen.</p>

<p>Es gibt eine ganze Reihe von Online verf&uuml;gbaren B&uuml;chern und Artikeln, die
vom FreeBSD Project herausgegeben werden und auf einzelne FreeBSD-bezogene Themen genauer
eingehen. Dabei wird ein sehr breites Spektrum abgedeckt, es gibt Informationen zur
effektiven Nutzung der Mailinglisten, den parallelen Betrieb von FreeBSD und anderen
Betriebssystem, und Hinweise f&uuml;r neue Entwickler. Wie das Handbuch und die FAQ sind
auch diese Dokumente auf Webseite FreeBSD Dokumentation und in der Distribution <tt
class="FILENAME">doc</tt> verf&uuml;gbar.</p>

<p>Eine Liste zus&auml;tzlicher B&uuml;cher und Dokumentationen zu FreeBSD finden Sie im
Kapitel <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/bibliography.html"
target="_top">Bibliographie</a> des Handbuchs. Da FreeBSD ganz klar aus der <span
class="TRADEMARK">UNIX</span>-Welt stammt, enthalten auch andere Artikel und B&uuml;cher
&uuml;ber <span class="TRADEMARK">UNIX</span>-Systeme n&uuml;tzliche Informationen. Eine
Auswahl dieser Dokumente finden Sie ebenfalls in der Bibliographie.</p>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="ACKNOWLEDGEMENTS" name="ACKNOWLEDGEMENTS">5. Danksagung</a></h2>

<p>FreeBSD ist das Ergebnis der Arbeit vieler hundert, wenn nicht Tausender Personen aus
der ganzen Welt, die ungez&auml;hlte Stunden investiert haben, um diese Version
m&ouml;glich zu machen. Die vollst&auml;ndige Liste aller Entwickler und Helfer finden
Sie auf der FreeBSD-Webseite <a
href="http://www.FreeBSD.org/doc/en_US.ISO8859-1/articles/contributors/"
target="_top">``Beteiligte''</a> und allen aktuellen Mirrors dieser Webseite.</p>

<p>Wir m&ouml;chten uns speziell bei den vielen tausend Anwendern und Testern aus der
ganzen Welt bedanken, ohne die diese release niemals m&ouml;glich gewesen w&auml;re.</p>
</div>
</div>

<hr />
<p align="center"><small>Diese Datei und andere Dokumente zu dieser Version sind bei <a
href="ftp://ftp.FreeBSD.org/">ftp://ftp.FreeBSD.org/</a>verfuegbar.</small></p>

<p align="center"><small>Wenn Sie Fragen zu FreeBSD haben, lesen Sie erst die <a
href="http://www.FreeBSD.org/docs.html">Dokumentation,</a> bevor Sie sich an &#60;<a
href="mailto:de-bsd-questions@de.FreeBSD.org">de-bsd-questions@de.FreeBSD.org</a>&#62;
wenden.</small></p>

<p align="center"><small>Wenn Sie Fragen zu dieser Dokumentation haben, wenden Sie sich
an &#60;<a
href="mailto:de-bsd-translators@de.FreeBSD.org">de-bsd-translators@de.FreeBSD.org</a>&#62;.</small></p>

<br />
<br />
</body>
</html>

