Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/dtrace/_index.po
Languages: ko, ru

source: Finally, install the current DTrace Toolkit, a collection of ready-made scripts for collecting system information. There are scripts to check open files, memory, `CPU` usage, and a lot more. FreeBSD 10 installs a few of these scripts into [.filename]#/usr/share/dtrace#. On other FreeBSD versions, or to install the full DTrace Toolkit, use the package:sysutils/dtrace-toolkit[] package or port.
ko: 마지막으로, 시스템 정보 수집을 위한 기성 스크립트 모음인 현재 DTrace 툴킷을 설치합니다. 여기에는 열린 파일, 메모리, `CPU` 사용량 등을 확인하는 스크립트가 있습니다. FreeBSD 10은 이러한 스크립트 중 몇 가지를 [.filename]#/usr/share/dtrace#에 설치합니다. 다른 FreeBSD 버전에서 또는 전체 DTrace 툴킷을 설치하려면 package:sysutils/dtrace-toolkit[] 패키지 또는 포트를 사용하세요.

source: The DTrace Toolkit includes many scripts in the special language of DTrace. This language is called the D language and it is very similar to C++. An in depth discussion of the language is beyond the scope of this document. It is covered extensively in the http://www.dtrace.org/guide[Illumos Dynamic Tracing Guide].
ko: DTrace 툴킷에는 DTrace의 특수 언어로 된 많은 스크립트가 포함되어 있습니다. 이 언어를 D 언어라고 하며 C++와 매우 유사합니다. 이 언어에 대한 자세한 설명은 이 문서의 범위를 벗어납니다. 자세한 내용은 http://www.dtrace.org/guide[Illumos Dynamic Tracing Guide]에서 확인할 수 있습니다.

source: Each probe has an `ID`, a `PROVIDER` (dtrace or fbt), a `MODULE`, and a `FUNCTION NAME`. Refer to man:dtrace[1] for more information about this command.
ko: 각 프로브에는 `ID`, `PROVIDER`(dtrace 또는 fbt), `MODULE` 그리고 `FUNCTION NAME`이 있습니다. 이 명령에 대한 자세한 내용은 man:dtrace[1]을 참조하세요.

source: As shown, the `read()` system call used the most time in nanoseconds while the `getpid()` system call used the least amount of time.
ko: 표시된 바와 같이 `read()` 시스템 호출이 나노초 단위로 가장 많은 시간을 사용한 반면 `getpid()` 시스템 호출은 가장 적은 시간을 사용했습니다.
