Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/dtrace/_index.po
Languages: ko, ru

source: This chapter explains how to use DTrace in FreeBSD
ko: 이 장에서는 FreeBSD에서 DTrace를 사용하는 방법을 설명합니다
ru: Эта глава объясняет, как использовать DTrace в FreeBSD

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 27. DTrace
ru: Глава 27. DTrace

source: Synopsis
ko: 요약
ru: Обзор

source: DTrace, also known as Dynamic Tracing, was developed by Sun(TM) as a tool for locating performance bottlenecks in production and pre-production systems. In addition to diagnosing performance problems, DTrace can be used to help investigate and debug unexpected behavior in both the FreeBSD kernel and in userland programs.
ko: 동적 추적(Dynamic Tracing)이라고도 하는 DTrace는 프로덕션 및 프리 프로덕션 시스템에서 성능 병목 현상을 찾기 위한 도구로 Sun(TM)에서 개발했습니다. 성능 문제를 진단하는 것 외에도 DTrace는 FreeBSD 커널과 사용자 프로그램 모두에서 예기치 않은 동작을 조사하고 디버깅하는 데 사용할 수 있습니다.
ru: DTrace, также известный как Dynamic Tracing, был разработан Sun(TM) в качестве инструмента для выявления узких мест в производительности рабочих и предпроизводственных систем. Помимо диагностики проблем с производительностью, DTrace можно использовать для исследования и отладки неожиданного поведения как в ядре FreeBSD, так и в пользовательских программах.

source: DTrace is a remarkable profiling tool, with an impressive array of features for diagnosing system issues. It may also be used to run pre-written scripts to take advantage of its capabilities. Users can author their own utilities using the DTrace D Language, allowing them to customize their profiling based on specific needs.
ko: DTrace는 시스템 문제 진단을 위한 인상적인 기능을 갖춘 뛰어난 프로파일링 도구입니다. 또한 미리 작성된 스크립트를 실행하여 기능을 활용하는 데 사용할 수도 있습니다. 사용자는 DTrace D 언어를 사용하여 자체 유틸리티를 작성할 수 있으므로 특정 요구 사항에 따라 프로파일링을 사용자 지정할 수 있습니다.
ru: DTrace — это выдающийся инструмент для профилирования, обладающий впечатляющим набором возможностей для диагностики проблем в системе. Его также можно использовать для запуска предварительно написанных скриптов, чтобы воспользоваться его функциональностью. Пользователи могут создавать собственные утилиты, используя язык DTrace D, что позволяет настраивать профилирование в соответствии с конкретными потребностями.

source: The FreeBSD implementation provides full support for kernel DTrace and experimental support for userland DTrace. Userland DTrace allows users to perform function boundary tracing for userland programs using the `pid` provider, and to insert static probes into userland programs for later tracing. Some ports, such as package:databases/postgresql12-server[] and package:lang/php74[] have a DTrace option to enable static probes.
ko: FreeBSD 구현은 커널 DTrace에 대한 완전한 지원과 사용자공간 DTrace에 대한 실험적 지원을 제공합니다. 사용자공간 DTrace를 사용하면 `pid` 제공자를 사용하여 사용자공간 프로그램에 대한 함수 경계 추적(function boundary tracing)을 수행하고, 나중에 추적하기 위해 사용자공간 프로그램에 정적 프로브를 삽입할 수 있습니다. package:databases/postgresql12-server[] 및 package:lang/php74[]와 같은 일부 포트에는 정적 프로브를 활성화하는 DTrace 옵션이 있습니다.
ru: Реализация FreeBSD обеспечивает полную поддержку DTrace в ядре и экспериментальную поддержку DTrace в пользовательском пространстве. DTrace в пользовательском пространстве позволяет пользователям выполнять трассировку границ функций для программ пользовательского пространства с использованием провайдера `pid`, а также вставлять статические зонды в программы пользовательского пространства для последующей трассировки. Некоторые порты, такие как package:databases/postgresql12-server[] и package:lang/php74[], имеют опцию DTrace для включения статических зондов.

source: The official guide to DTrace is maintained by the illumos project at https://illumos.org/books/dtrace/bookinfo.html[illumos Dynamic Tracing Guide].
ru: Официальное руководство по DTrace поддерживается проектом illumos по адресу https://illumos.org/books/dtrace/bookinfo.html[illumos Dynamic Tracing Guide].

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: What DTrace is and what features it provides.
ko: DTrace란 무엇이며 어떤 기능을 제공하는지.
ru: Что такое DTrace и какие возможности он предоставляет.

source: Differences between the Solaris(TM) DTrace implementation and the one provided by FreeBSD.
ko: Solaris(TM) DTrace 구현과 FreeBSD에서 제공하는 구현의 차이점.
ru: Различия между реализацией DTrace в Solaris(TM) и реализацией, предоставляемой FreeBSD.

source: How to enable and use DTrace on FreeBSD.
ko: FreeBSD에서 DTrace를 활성화하고 사용하는 방법.
ru: Как включить и использовать DTrace в FreeBSD.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Understand UNIX(R) and FreeBSD basics (crossref:basics[basics,FreeBSD Basics]).
ko: UNIX(R) 및 FreeBSD 기본 사항을 이해합니다(crossref:basics[basics,FreeBSD Basics]).
ru: Понимать основы UNIX(R) и FreeBSD (crossref:basics[basics,Основы FreeBSD]).

source: Have some familiarity with security and how it pertains to FreeBSD (crossref:security[security,Security]).
ko: 보안과 그것이 FreeBSD와 어떻게 관련되어 있는지 어느 정도 알고 있어야 합니다(crossref:security[security,Security]).
ru: Иметь некоторое представление о безопасности и о том, как она относится к FreeBSD (crossref:security[security,Безопасность]).

source: Implementation Differences
ko: 구현의 차이점
ru: Различия в реализациях

source: While the DTrace in FreeBSD is similar to that found in Solaris(TM), differences do exist. The primary difference is that in FreeBSD, DTrace is implemented as a set of kernel modules and DTrace can not be used until the modules are loaded. To load all of the necessary modules:
ko: FreeBSD의 DTrace는 Solaris(TM)에서 볼 수 있는 것과 유사하지만 차이점이 존재합니다. 가장 큰 차이점은 FreeBSD의 DTrace는 커널 모듈 집합으로 구현되며 모듈이 로드될 때까지 DTrace를 사용할 수 없다는 점입니다. 필요한 모든 모듈을 로드하려면:
ru: В то время как DTrace в FreeBSD схож с тем, что представлен в Solaris(TM), различия существуют. Основное различие заключается в том, что в FreeBSD DTrace реализован в виде набора модулей ядра, и DTrace нельзя использовать до загрузки этих модулей. Чтобы загрузить все необходимые модули:

source: Beginning with FreeBSD 10.0-RELEASE, the modules are automatically loaded when man:dtrace[1] is run.
ru: Начиная с FreeBSD 10.0-RELEASE, модули автоматически загружаются при запуске man:dtrace[1].

source: FreeBSD uses the `DDB_CTF` kernel option to enable support for loading man:ctf[5] data from kernel modules and the kernel itself. `CTF` is the Solaris(TM) Compact C Type Format which encapsulates a reduced form of debugging information similar to `DWARF` and the venerable stabs. `CTF` data is added to binaries by the man:ctfconvert[1] and man:ctfmerge[1] build tools. The `ctfconvert` utility parses `DWARF` `ELF` debug sections created by the compiler and `ctfmerge` merges `CTF` `ELF` sections from objects into either executables or shared libraries.
ru: FreeBSD использует параметр ядра `DDB_CTF` для включения поддержки загрузки данных man:ctf[5] из модулей ядра и самого ядра. `CTF` — это Compact C Type Format от Solaris(TM), который инкапсулирует упрощённую форму отладочной информации, аналогичную `DWARF` и устаревшему stabs. Данные `CTF` добавляются в бинарные файлы с помощью инструментов сборки man:ctfconvert[1] и man:ctfmerge[1]. Утилита `ctfconvert` обрабатывает отладочные секции `DWARF``ELF`, созданные компилятором, а `ctfmerge` объединяет секции `CTF``ELF` из объектных файлов в исполняемые файлы или разделяемые библиотеки.

source: Some different providers exist for FreeBSD than for Solaris(TM). Most notable is the `dtmalloc` provider, which allows tracing man:malloc[9] by type in the FreeBSD kernel. Some of the providers found in Solaris(TM), such as `cpc`, are not present in FreeBSD. These may appear in future versions of FreeBSD. Moreover, some of the providers available in both operating systems are not compatible, in the sense that their probes have different argument types. Thus, `D` scripts written on Solaris(TM) may or may not work unmodified on FreeBSD, and vice versa.
ru: В FreeBSD есть некоторые провайдеры, которых нет в Solaris(TM). Наиболее примечательным является провайдер `dtmalloc`, который позволяет трассировать man:malloc[9] по типам в ядре FreeBSD. Некоторые провайдеры, присутствующие в Solaris(TM), такой как `cpc`, отсутствуют в FreeBSD. Они могут появиться в будущих версиях FreeBSD. Кроме того, некоторые провайдеры, доступные в обеих операционных системах, несовместимы в том смысле, что их пробы имеют разные типы аргументов. Таким образом, скрипты `D`, написанные для Solaris(TM), могут работать или не работать без изменений в FreeBSD, и наоборот.

source: Due to security differences, only `root` may use DTrace on FreeBSD. Solaris(TM) has a few low level security checks which do not yet exist in FreeBSD. As such, the [.filename]#/dev/dtrace/dtrace# is strictly limited to `root`.
ko: 보안상의 차이로 인해, FreeBSD에서는 `root`만 DTrace를 사용할 수 있습니다. Solaris(TM)에는 FreeBSD에는 아직 존재하지 않는 몇 가지 낮은 수준의 보안 검사가 있습니다. 따라서 [.filename]#/dev/dtrace/dtrace#는 `root`로 엄격하게 제한됩니다.
ru: Из-за различий в безопасности, только пользователь `root` может использовать DTrace в FreeBSD. В Solaris(TM) есть несколько проверок безопасности низкого уровня, которые пока отсутствуют в FreeBSD. Поэтому доступ к [.filename]#/dev/dtrace/dtrace# строго ограничился только пользователем `root`.

source: DTrace falls under the Common Development and Distribution License (`CDDL`) license. To view this license on FreeBSD, see [.filename]#/usr/src/cddl/contrib/opensolaris/OPENSOLARIS.LICENSE# or view it online at http://opensource.org/licenses/CDDL-1.0[http://opensource.org/licenses/CDDL-1.0]. While a FreeBSD kernel with DTrace support is `BSD` licensed, the `CDDL` is used when the modules are distributed in binary form or the binaries are loaded.
ko: DTrace는 일반 개발 및 배포 허가서(`CDDL`) 라이선스에 속합니다. FreeBSD에서 이 라이선스를 보려면 [.filename]#/usr/src/cddl/contrib/opensolaris/OPENSOLARIS.LICENSE#를 참조하거나 http://opensource.org/licenses/CDDL-1.0[http://opensource.org/licenses/CDDL-1.0]에서 온라인으로 확인하세요. DTrace를 지원하는 FreeBSD 커널은 `BSD` 라이선스를 사용하지만, 모듈을 바이너리 형태로 배포하거나 바이너리를 로드할 때는 `CDDL`을 사용합니다.
ru: DTrace распространяется под лицензией Common Development and Distribution License (`CDDL`). Чтобы ознакомиться с текстом этой лицензии в FreeBSD, см. [.filename]#/usr/src/cddl/contrib/opensolaris/OPENSOLARIS.LICENSE# или просмотрите её онлайн по адресу http://opensource.org/licenses/CDDL-1.0[http://opensource.org/licenses/CDDL-1.0]. Хотя ядро FreeBSD с поддержкой DTrace лицензировано под `BSD`, лицензия `CDDL` применяется при распространении модулей в бинарной форме или при загрузке бинарных файлов.

source: Enabling DTrace Support
ko: DTrace 지원 활성화하기
ru: Включение поддержки DTrace

source: In FreeBSD 9.2 and 10.0, DTrace support is built into the [.filename]#GENERIC# kernel. Users of earlier versions of FreeBSD or who prefer to statically compile in DTrace support should add the following lines to a custom kernel configuration file and recompile the kernel using the instructions in crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]:
ko: FreeBSD 9.2와 10.0에서, DTrace 지원은 [.filename]#GENERIC# 커널에 내장되어 있습니다. 이전 버전의 FreeBSD 사용자 또는 DTrace 지원에서 정적으로 컴파일하는 것을 선호하는 사용자는 커스텀 커널 구성 파일에 다음 줄을 추가하고 crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]의 지침을 사용하여 커널을 다시 컴파일해야 합니다:
ru: В FreeBSD 9.2 и 10.0 поддержка DTrace встроена в ядро [.filename]#GENERIC#. Пользователям более ранних версий FreeBSD или тем, кто предпочитает статически компилировать поддержку DTrace, следует добавить следующие строки в пользовательский конфигурационный файл ядра и перекомпилировать ядро, следуя инструкциям в crossref:kernelconfig[kernelconfig,Настройка ядра FreeBSD]:

source: Users of the AMD64 architecture should also add this line:
ko: AMD64 아키텍처 사용자도 이 줄을 추가해야 합니다:
ru: Пользователи архитектуры AMD64 также должны добавить эту строку:

source: This option provides support for man:dtrace_fbt[4]. While DTrace will work without this option, there will be limited support for function boundary tracing.
ru: Эта опция обеспечивает поддержку man:dtrace_fbt[4]. Хотя DTrace будет работать без этой опции, поддержка трассировки входов и выходов функций будет ограничена.

source: Once the FreeBSD system has rebooted into the new kernel, or the DTrace kernel modules have been loaded using `kldload dtraceall`, install the current DTrace Toolkit (package:sysutils/dtrace-toolkit[]), a collection of ready-made scripts for collecting system information. There are scripts to check open files, memory, CPU usage, and a lot more. FreeBSD includes some scripts in the base system as well; see [.filename]#/usr/share/dtrace#.
ru: После перезагрузки системы FreeBSD с новым ядром или загрузки модулей DTrace с помощью `kldload dtraceall`, установите текущий DTrace Toolkit (package:sysutils/dtrace-toolkit[]) — набор готовых скриптов для сбора системной информации. Включает скрипты для проверки открытых файлов, использования памяти, загрузки CPU и многое другое. Некоторые скрипты также присутствуют в базовой системе FreeBSD — см. [.filename]#/usr/share/dtrace#.

source: The scripts found in [.filename]#/usr/share/dtrace# have been specifically ported to FreeBSD. Not all of the scripts found in the DTrace Toolkit will work as-is on FreeBSD and some scripts may require some effort in order for them to work on FreeBSD.
ko: [.filename]#/usr/share/dtrace#에 있는 스크립트들은 특별히 FreeBSD로 포팅되었습니다. DTrace 툴킷에 있는 모든 스크립트가 FreeBSD에서 그대로 작동하는 것은 아니며, 일부 스크립트는 FreeBSD에서 작동하기 위해 약간의 노력이 필요할 수 있습니다.
ru: Скрипты в каталоге [.filename]#/usr/share/dtrace# были специально портированы для FreeBSD. Не все скрипты из DTrace Toolkit будут работать на FreeBSD без изменений, и для некоторых может потребоваться доработка.

source: The DTrace Toolkit includes many scripts in the special language of DTrace. This language is called the D language and it is very similar to C++. An in depth discussion of the language is beyond the scope of this document. Refer to the FreeBSD man:d[7] manual page for an overview of the D language on FreeBSD. The D language is also covered extensively in the https://www.illumos.org/books/dtrace/bookinfo.html[illumos Dynamic Tracing Guide].
ru: Набор инструментов DTrace включает множество скриптов на специальном языке DTrace. Этот язык называется D и очень похож на C++. Подробное обсуждение языка выходит за рамки данного документа. Обратитесь к странице man:d[7] для обзора языка D в FreeBSD. Язык D также подробно рассмотрен в https://www.illumos.org/books/dtrace/bookinfo.html[illumos Dynamic Tracing Guide].

source: Enabling DTrace in Out-of-Kernel Modules
ru: Включение DTrace во внешних модулях ядра

source: To add DTrace support to an out-of-kernel module, which is useful for development and debugging, include the following line in the module's Makefile:
ru: Чтобы добавить поддержку DTrace во внешний модуль ядра, что полезно для разработки и отладки, включите следующую строку в Makefile модуля:

source: This flag enables DTrace hooks during compilation, allowing for advanced debugging and monitoring of the module. Ensure to recompile the module after this modification to activate DTrace functionality.
ru: Этот флаг включает DTrace-хуки во время компиляции, позволяя проводить расширенную отладку и мониторинг модуля. Убедитесь, что модуль перекомпилирован после этого изменения, чтобы активировать функциональность DTrace.

source: Using DTrace
ko: DTrace 사용하기
ru: Использование DTrace

source: DTrace scripts consist of a list of one or more _probes_, or instrumentation points, where each probe is associated with an action. Whenever the condition for a probe is met, the associated action is executed. For example, an action may occur when a file is opened, a process is started, or a line of code is executed. The action might be to log some information or to modify context variables. The reading and writing of context variables allows probes to share information and to cooperatively analyze the correlation of different events.
ko: DTrace 스크립트는 하나 이상의 _프로브_ 또는 계측 포인트 목록으로 구성되며, 각 프로브는 액션과 연관되어 있습니다. 프로브의 조건이 충족될 때마다 연결된 액션이 실행됩니다. 예를 들어, 파일이 열리거나 프로세스가 시작되거나 코드 줄이 실행될 때 액션이 발생할 수 있습니다. 액션은 일부 정보를 기록하거나 컨텍스트 변수를 수정하는 것일 수 있습니다. 컨텍스트 변수의 읽기 및 쓰기를 통해 프로브는 정보를 공유하고 서로 다른 이벤트의 상관 관계를 협력적으로 분석할 수 있습니다.
ru: Скрипты DTrace состоят из списка одного или нескольких _проб_ (точек инструментирования), где каждая проба связана с действием. Когда условие для пробы выполняется, запускается соответствующее действие. Например, действие может происходить при открытии файла, запуске процесса или выполнении строки кода. Действие может заключаться в записи некоторой информации или изменении контекстных переменных. Чтение и запись контекстных переменных позволяют пробам обмениваться информацией и совместно анализировать взаимосвязь различных событий.

source: To view all probes, the administrator can execute the following command:
ko: 모든 프로브를 보려면 관리자가 다음 명령을 실행하면 됩니다:
ru: Для просмотра всех проб администратор может выполнить следующую команду:

source: Each probe has an `ID`, a `PROVIDER` (e.g., `dtrace` or `fbt`), a `MODULE`, and a `FUNCTION NAME`. Refer to man:dtrace[1] for more information about this command.
ru: У каждого зонда есть `ID`, `PROVIDER` (например, `dtrace` или `fbt`), `MODULE` и `FUNCTION NAME`. Дополнительную информацию об этой команде можно найти в man:dtrace[1].

source: The examples in this section provide an overview of how to use two of the fully supported scripts from the DTrace Toolkit: the [.filename]#hotkernel# and [.filename]#procsystime# scripts.
ko: 이 섹션의 예제에서는 DTrace 툴킷에서 완전히 지원되는 두 가지 스크립트, 즉 [.filename]#hotkernel# 및 [.filename]#procsystime# 스크립트를 사용하는 방법에 대한 개요를 제공합니다.
ru: Примеры в этом разделе дают общее представление о том, как использовать два полностью поддерживаемых скрипта из DTrace Toolkit: [.filename]#hotkernel# и [.filename]#procsystime#.

source: The [.filename]#hotkernel# script is designed to identify which function is using the most kernel time. It will produce output similar to the following:
ko: [.filename]#hotkernel# 스크립트는 커널 시간을 가장 많이 사용하는 함수를 식별하도록 설계되었습니다. 다음과 유사한 출력을 생성합니다:
ru: Скрипт [.filename]#hotkernel# предназначен для определения функции, которая использует наибольшее время ядра. Он выводит информацию, похожую на следующую:

source: As instructed, use the kbd:[Ctrl+C] key combination to stop the process. Upon termination, the script will display a list of kernel functions and timing information, sorting the output in increasing order of time:
ko: 지시에 따라 kbd:[Ctrl+C] 키 조합을 사용하여 프로세스를 중지합니다. 종료되면 스크립트에 커널 함수 목록과 타이밍 정보가 표시되고 출력이 시간이 지남에 따라 정렬됩니다:
ru: Как указано, используйте комбинацию клавиш kbd:[Ctrl+C], чтобы остановить процесс. После завершения скрипт отобразит список функций ядра и информацию о времени, сортируя вывод в порядке возрастания времени:

source: This script will also work with kernel modules. To use this feature, run the script with `-m`:
ko: 이 스크립트는 커널 모듈에서도 작동합니다. 이 기능을 사용하려면 `-m`과 함께 스크립트를 실행하세요:
ru: Этот скрипт также работает с модулями ядра. Чтобы использовать эту возможность, запустите скрипт с ключом `-m`:

source: The [.filename]#procsystime# script captures and prints the system call time usage for a given process `ID` (`PID`) or process name. In the following example, a new instance of [.filename]#/bin/csh# was spawned. Then, [.filename]#procsystime# was executed and remained waiting while a few commands were typed on the other incarnation of `csh`. These are the results of this test:
ko: [.filename]#procsystime# 스크립트는 지정된 프로세스 `ID`(`PID`) 또는 프로세스 이름에 대한 시스템 호출 시간 사용량을 캡처하여 인쇄합니다. 다음 예제에서는 [.filename]#/bin/csh#의 새 인스턴스가 생성되었습니다. 그런 다음 [.filename]#procsystime#이 실행되고 대기 상태로 유지되는 동안 다른 `csh` 인스턴스에 몇 가지 명령이 입력되었습니다. 이것이 이 테스트의 결과입니다:
ru: Скрипт [.filename]#procsystime# захватывает и выводит время использования системных вызовов для заданного идентификатора процесса (`PID`) или имени процесса. В следующем примере был создан новый экземпляр [.filename]#/bin/csh#. Затем был запущен [.filename]#procsystime#, который оставался в ожидании, пока в другом экземпляре `csh` было набрано несколько команд. Вот результаты этого теста:

source: As shown, the man:read[2] system call used the most time in nanoseconds while the man:getpid[2] system call used the least amount of time.
ru: Как показано, системный вызов man:read[2] использовал наибольшее время в наносекундах, тогда как системный вызов man:getpid[2] использовал наименьшее количество времени.

source: Chapter 26. DTrace
ko: 26장. DTrace

source: The official guide to DTrace is maintained by the Illumos project at http://dtrace.org/guide[DTrace Guide].
ko: DTrace에 대한 공식 가이드는 Illumos 프로젝트의 http://dtrace.org/guide[DTrace 가이드]에서 확인할 수 있습니다.

source: Beginning with FreeBSD 10.0-RELEASE, the modules are automatically loaded when `dtrace` is run.
ko: FreeBSD 10.0-RELEASE부터, `dtrace`를 실행하면 모듈이 자동으로 로드됩니다.

source: FreeBSD uses the `DDB_CTF` kernel option to enable support for loading `CTF` data from kernel modules and the kernel itself. `CTF` is the Solaris(TM) Compact C Type Format which encapsulates a reduced form of debugging information similar to `DWARF` and the venerable stabs. `CTF` data is added to binaries by the `ctfconvert` and `ctfmerge` build tools. The `ctfconvert` utility parses `DWARF``ELF` debug sections created by the compiler and `ctfmerge` merges `CTF``ELF` sections from objects into either executables or shared libraries.
ko: FreeBSD는 커널 모듈과 커널 자체에서 `CTF` 데이터를 로드하는 것을 지원하기 위해 `DDB_CTF` 커널 옵션을 사용합니다. `CTF`는 Solaris(TM)의 컴팩트 C 타입 포맷으로, `DWARF` 및 유서 깊은 stabs와 유사한 디버깅 정보의 축소된 형태로 캡슐화합니다. `CTF` 데이터는 `ctfconvert` 및 `ctfmerge` 빌드 도구에 의해 바이너리에 추가됩니다. `ctfconvert` 유틸리티는 컴파일러가 생성한 `DWARF` `ELF` 디버그 섹션을 구문 분석하고 `ctfmerge`는 객체에서 `CTF` `ELF` 섹션을 실행 파일 또는 공유 라이브러리로 병합합니다.

source: Some different providers exist for FreeBSD than for Solaris(TM). Most notable is the `dtmalloc` provider, which allows tracing `malloc()` by type in the FreeBSD kernel. Some of the providers found in Solaris(TM), such as `cpc` and `mib`, are not present in FreeBSD. These may appear in future versions of FreeBSD. Moreover, some of the providers available in both operating systems are not compatible, in the sense that their probes have different argument types. Thus, `D` scripts written on Solaris(TM) may or may not work unmodified on FreeBSD, and vice versa.
ko: FreeBSD에는 Solaris(TM)와는 다른 몇 가지 프로바이더가 존재합니다. 가장 주목할 만한 것은 `dtmalloc` 제공자로, FreeBSD 커널에서 유형별로 `malloc()`을 추적할 수 있습니다. Solaris(TM)에 있는 `cpc`와 `mib`와 같은 일부 제공자는 FreeBSD에는 없습니다. 이 제공자들은 향후 FreeBSD 버전에 나타날 수 있습니다. 또한, 두 운영 체제에서 사용할 수 있는 일부 프로바이더는 프로브의 인자 유형이 다르다는 점에서 호환되지 않습니다. 따라서 Solaris(TM)에서 작성된 `D` 스크립트는 FreeBSD에서 수정되지 않은 채로 작동할 수도 있고, 그 반대의 경우도 마찬가지입니다.

source: This option provides support for `FBT`. While DTrace will work without this option, there will be limited support for function boundary tracing.
ko: 이 옵션은 'FBT'를 지원합니다. 이 옵션이 없어도 DTrace는 작동하지만 함수 경계 추적에 대한 지원이 제한됩니다.

source: Once the FreeBSD system has rebooted into the new kernel, or the DTrace kernel modules have been loaded using `kldload dtraceall`, the system will need support for the Korn shell as the DTrace Toolkit has several utilities written in `ksh`. Make sure that the package:shells/ksh93[] package or port is installed. It is also possible to run these tools under package:shells/pdksh[] or package:shells/mksh[].
ko: FreeBSD 시스템을 새 커널로 재부팅하거나 `kldload dtraceall`을 사용하여 DTrace 커널 모듈을 로드한 후에는, DTrace 툴킷에 `ksh`로 작성된 여러 유틸리티가 있으므로 시스템이 Korn 셸을 지원해야 합니다. package:shells/ksh93[] 패키지 또는 포트가 설치되어 있는지 확인합니다. 이러한 도구는 package:shells/pdksh[] 또는 package:shells/mksh[] 아래에서 실행할 수도 있습니다.
