freebsd/freebsd-doc/ja_JP.eucJP/man/man9/acl.9
.\"-
.\" Copyright (c) 1999, 2000 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"       $FreeBSD: src/share/man/man9/acl.9,v 1.2 2000/01/28 15:22:49 rwatson Exp $
.\"
.Dd December 23, 1999
.Os
.Dt ACL 9
.Sh 名称
.Nm acl
.Nd 仮想ファイルシステムアクセス制御リスト
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Fd #include <sys/acl.h>
.Pp
.Bd -literal
typedef int     acl_type_t;
typedef int     acl_tag_t;
typedef mode_t  acl_perm_t;

struct acl_entry {
        acl_tag_t       ae_tag;
        uid_t           ae_id;
        acl_perm_t      ae_perm;
};
typedef struct acl_entry        *acl_entry_t;

struct acl {
        int                     acl_cnt;
        struct acl_entry        acl_entry[ACL_MAX_ENTRIES];
};
typedef struct acl      *acl_t;

/*
 * acl_entry_t の a_tag に有効な値
 */
#define ACL_USER_OBJ    0x00000001
#define ACL_USER        0x00000002
#define ACL_GROUP_OBJ   0x00000004
#define ACL_GROUP       0x00000008
#define ACL_MASK        0x00000010
#define ACL_OTHER       0x00000020
#define ACL_OTHER_OBJ   ACL_OTHER

/*
 * a_type_t 引数に有効な値
 */
#define ACL_TYPE_ACCESS    0x00000000
#define ACL_TYPE_DEFAULT   0x00000001
#define ACL_TYPE_AFS       0x00000002
#define ACL_TYPE_CODA      0x00000003
#define ACL_TYPE_NTFS      0x00000004
#define ACL_TYPE_NWFS      0x00000005

/*
 * a_perm フィールドに可能なフラグ
 */
#define ACL_PERM_EXEC      0x0001
#define ACL_PERM_WRITE     0x0002
#define ACL_PERM_READ      0x0004
#define ACL_PERM_NONE      0x0000
#define ACL_PERM_BITS      (ACL_PERM_EXEC | ACL_PERM_WRITE | ACL_PERM_READ)
#define ACL_POSIX1E_BITS   (ACL_PERM_EXEC | ACL_PERM_WRITE | ACL_PERM_READ)
.Ed
.Sh 解説
アクセス制御リスト、すなわち ACL は、
ファイルおよびディレクトリを表現する vnode に対する権限を、
きめ細かく指定可能とします。
しかしながら、
異なる ACL のセマンティクスを持つファイルシステムが過多にあるため、
vnode インタフェースは ACL の文法のみを理解し、基礎をなすファイルシステムが
細部を実装することを当てにしています。
基礎をなすファイルシステムに依存して、個々のファイルまたはディレクトリは、
関連付けられる 0 個以上の ACL を持つことが可能です。
それぞれ ACL の名前は、適切な vnode ACL 呼び出し
.Xr VOP_ACLCHECK 9 ,
.Xr VOP_GETACL 9 ,
.Xr VOP_SETACL 9
の
.Fa type
フィールドを使用して指定されます。
.Pp
現在は、個々の ACL はカーネル内で固定サイズの ACL 構造体によって表現されます。
ACL は、ACL エントリの固定サイズ配列で構成されます。
各 ACL エントリは、
パーミッションの組、主要な名前空間、主要な識別子から構成されます。
結びつけられた acl_cnt フィールドの値に依存して、
これらの 0 個以上のエントリが "定義" されることが出来ます。
.Sh 関連項目
.Xr VFS 9 ,
.Xr VOP_ACLCHECK 9 ,
.Xr VOP_GETACL 9 ,
.Xr VOP_SETACL 9
.Sh 作者
このマニュアルページは
.An Robert Watson
が書きました。
