freebsd/freebsd-doc/ja_JP.eucJP/man/man9/boot.9
.\"	%NetBSD: boot.9,v 1.2 1996/09/24 07:01:26 ghudson Exp %
.\"
.\" Copyright (c) 1997
.\" 	Mike Pritchard.  All rights reserved.
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/boot.9,v 1.10 2004/07/03 18:29:23 ru Exp %
.\"
.\" $FreeBSD$
.Dd February 14, 1997
.Dt BOOT 9
.Os
.Sh 名称
.Nm boot
.Nd システムの停止または再起動
.Sh 書式
.In sys/types.h
.In sys/systm.h
.In sys/reboot.h
.Ft void
.Fn boot "int howto"
.Sh 解説
.Fn boot
関数は、システムの最終的なシステムシャットダウンと、
停止または再起動を取り扱います。
行なわれる正確な動作は、
.Fa howto
で渡されるフラグと、
システムが自動コンフィギュレーションを既に終えているかどうか、
によって決定されます。
.Pp
システムが自動コンフィギュレーションを既に終えている場合には、
.Fn boot
は次の動作をします。
.Bl -enum -offset indent
.It
これが最初の
.Fn boot
の実施の場合で、
.Fa howto
に
.Dv RB_NOSYNC
フラグがセットされていなければ、
.Xr vfs_unmountall 9
を呼び出すことにより、ディスクの同期とアンマウントを行ないます。
.It
割り込みを無効にします。
.It
クラッシュの後の再起動の場合 (すなわち
.Fa howto
に
.Dv RB_DUMP
がセットされているが
.Dv RB_HALT
がセットされていない) は、
システムクラッシュダンプを保存します。
.It
以前に登録されたあらゆるシャットダウンフックを実行します。
.It
システムが停止させられているのか、
再起動させられているのかを示すメッセージを表示します。
.It
.Fa howto
に
.Dv RB_HALT
がセットされている場合には、システムを停止します。
そうでなければ、システムを再起動します。
.El
.Pp
システムが自動コンフィギュレーションをまだ終えていない場合には、
.Fn boot
は
以前に登録されたあらゆるシャットダウンフックを実行し、
メッセージを表示し、システムを停止します。
.Sh 関連項目
.Xr vfs_unmountall 9
