freebsd/freebsd-doc/ja_JP.eucJP/man/man9/BUS_PRINT_CHILD.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/BUS_PRINT_CHILD.9,v 1.14.4.1 2005/01/10 23:06:34 keramida Exp %
.\"
.\" $FreeBSD$
.Dd January 6, 2005
.Dt BUS_PRINT_CHILD 9
.Os
.Sh 名称
.Nm BUS_PRINT_CHILD
.Nd デバイスについての情報の表示
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft int
.Fn BUS_PRINT_CHILD "device_t dev" "device_t child"
.Sh 解説
.Fn BUS_PRINT_CHILD
メソッドはデバイスの説明をプリントアウトするシステムのコードから呼び出されます。
それは子デバイスが持っている親とのアタッチメントを記述するべきです。
例えば、TurboLaser のバスはどのノードにアタッチされたかをプリントします。
.Fn BUS_PRINT_CHILD
によって出力されるメッセージの適切なフォーマット
に関しての更なる情報は
.Xr bus_generic_print_child 9
を見てください。
.Sh 関連項目
.Xr device 9 ,
.Xr driver 9
.Sh 戻り値
出力の文字数です。
.Sh 作者
このマニュアルページは
.An Doug Rabson
によって書かれました。
