freebsd/freebsd-doc/ja_JP.eucJP/man/man9/bus_set_resource.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2003 M. Warner Losh
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/bus_set_resource.9,v 1.2 2003/05/30 21:13:32 ru Exp %
.\"
.\" $FreeBSD$
.Dd March 29, 2003
.Dt BUS_SET_RESOURCE 9
.Os
.Sh 名称
.Nm bus_set_resource
.Nd "確定したリソースと与えられたリソース ID との関連付け"
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Pp
.In machine/bus.h
.In sys/rman.h
.In machine/resource.h
.Ft int
.Fo bus_set_resource
.Fa "device_t dev" "int type" "int rid" "u_long start" "u_long count"
.Fc
.Sh 解説
.Fn bus_set_resource
関数は、
.Fa type , rid
ペアで指定されるリソースのうち、指定された開始アドレスのものを長さ
.Fa count
に設定します。
通常は、クライアントドライバはこのインタフェースを使用しません。
しかしながら、バスドライバはクライアントドライバが使用するリソースを
設定するためにしばしば使用します。
.Pp
引数は以下の通りです。
.Bl -tag -width indent
.It Fa dev
リソースを設定するデバイスです。
.It Fa type
割り当てたいリソースの型です。
これは下記の中の 1 つです。
.Pp
.Bl -tag -width ".Dv SYS_RES_MEMORY" -compact
.It Dv SYS_RES_IRQ
IRQ のリソースです。
.It Dv SYS_RES_DRQ
ISA DMA ラインのリソースです。
.It Dv SYS_RES_IOPORT
I/O ポートのリソースです。
.It Dv SYS_RES_MEMORY
I/O メモリのリソースです。
.El
.It Fa rid
割り当てられているリソースを識別するバス特有のハンドルへのポインタです。
.It Fa start
このリソースの開始アドレスです。
.It Fa count
このリソースの長さです。
.El
.Sh 戻り値
成功時には 0 が返され、そうでなければエラーが返されます。
.Sh 関連項目
.Xr bus_alloc_resource 9 ,
.Xr bus_get_resource 9 ,
.Xr device 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Warner Losh Aq imp@FreeBSD.org
が書きました。
