freebsd/freebsd-doc/ja_JP.eucJP/man/man9/BUS_ADD_CHILD.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2004 M. Warner Losh.
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/BUS_ADD_CHILD.9,v 1.3 2004/07/07 07:56:58 ru Exp %
.\" $FreeBSD$
.\"
.Dd May 13, 2004
.Dt BUS_ADD_CHILD 9
.Os
.Sh 名称
.Nm BUS_ADD_CHILD
.Nd "与えられた優先度でデバイスノードをツリーに追加"
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft int
.Fn BUS_ADD_CHILD "device_t dev" "int order" "const char *name" "int unit"
.Sh 解説
.Fn BUS_ADD_CHILD
メソッドはドライバの認識ルーチンによってツリーにデバイスを追加するために
使用されます。
詳細については
.Xr device_add_child 9
を参照して下さい。
このインタフェースは
.Xr device_add_child 9
と同じですが、バスの
.Fn BUS_ADD_CHILD
が呼び出されます。
.Pp
固有の内部値およびリソースリストのようなものをそのデバイスに追加する前に、
バスの
.Fn BUS_ADD_CHILD
の実装は
.Xr device_add_child 9
を使用してツリーの中にそのデバイスを挿入するべきです。
.Sh 関連項目
.Xr device 9 ,
.Xr device_add_child 9 ,
.Xr driver 9
.Sh 戻り値
.Fn BUS_ADD_CHILD
メソッドはツリーに追加された
.Vt device_t
または
.Dv NULL
を返します。
.Sh 作者
このマニュアルページは
.An M. Warner Losh
が書きました。
