freebsd/freebsd-doc/ja_JP.eucJP/man/man9/BUS_CONFIG_INTR.9
.\" Copyright (c) 2003 Marcel Moolenaar
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/BUS_CONFIG_INTR.9,v 1.4.2.1 2005/01/10 23:01:44 keramida Exp %
.\"
.\" $FreeBSD$
.Dd January 6, 2005
.Dt BUS_CONFIG_INTR 9
.Os
.\"
.Sh 名称
.Nm BUS_CONFIG_INTR
.Nd "割り込みの極性およびトリガモードの設定"
.\"
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft int
.Fo BUS_CONFIG_INTR
.Fa "device_t dev" "int irq" "enum intr_trigger trig" "enum intr_polarity pol"
.Fc
.\"
.Sh 解説
.Fn BUS_CONFIG_INTR
メソッドは、バスまたはデバイスのドライバが、親のバスに割り込み極性および
トリガモードを提供することを可能にします。
これは通常は、ルートバス (例えば nexus) までの全ての経路を上がって行きます。
その全ての経路において、
実際にハードウェアをプログラムするために必要な動作がなされます。
.Fn BUS_CONFIG_INTR
メソッドは割り込み番号をとるため、
.Xr BUS_SETUP_INTR 9
より先に呼び出されることが必ずしも要求されませんが、当然だと仮定されます。
.Pp
.Fa trig
引数は以下のいずれかです。
.Bl -tag -width ".Dv INTR_TRIGGER_CONFORM"
.It Dv INTR_TRIGGER_CONFORM
割り込みトリガモードは、デバイスがアタッチされているバスにとっての標準です。
.It Dv INTR_TRIGGER_EDGE
割り込みは、エッジトリガされます。
これは、割り込み線の信号の立上りエッジによって、
割り込みが立ち上げられることを意味します。
その信号は通常、スパイクを発生させるように元の状態に戻ります。
.It Dv INTR_TRIGGER_LEVEL
割り込みは、レベルトリガされます。
これは、割り込み線の信号が変化して、その割り込みのサービス完了までの間
変化せずに維持される時に、割り込みが立ち上げられることを意味します。
サービス完了後、信号は戻ります。
.El
.Pp
.Fa pol
引数は以下のいずれかです。
.Bl -tag -width ".Dv INTR_POLARITY_CONFORM"
.It Dv INTR_POLARITY_CONFORM
割り込みの極性は、デバイスがアタッチされているバスにとっての標準です。
.It Dv INTR_POLARITY_HIGH
割り込み線の電圧がハイになることによって、割り込みが活性化されます。
.It Dv INTR_POLARITY_LOW
割り込み線の電圧がローになることによって、割り込みが活性化されます。
.El
.\"
.Sh 戻り値
成功時には 0 が返され、そうでなければ適切なエラーが返されます。
.\"
.Sh 関連項目
.Xr BUS_SETUP_INTR 9 ,
.Xr BUS_TEARDOWN_INTR 9 ,
.Xr device 9 ,
.Xr driver 9
.\"
.Sh 歴史
.Fn BUS_CONFIG_INTR
メソッドは
.Fx 5.2
ではじめて登場しました。
.\"
.Sh 作者
このマニュアルページは
.An Marcel Moolenaar
.Aq marcel@xcllnt.net
によって書かれました。
