freebsd/freebsd-doc/ja_JP.eucJP/man/man9/BUS_READ_IVAR.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/BUS_READ_IVAR.9,v 1.3.2.1 2000/12/14 12:43:55 ru Exp %
.\"
.\" $FreeBSD$
.Dd June 16, 1998
.Dt BUS_READ_IVAR 9
.Os FreeBSD
.Sh 名称
.Nm BUS_READ_IVAR ,
.Nm BUS_WRITE_IVAR
.Nd バス特有のデバイスインスタンス変数の操作
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn BUS_READ_IVAR "device_t dev" "device_t child" "int index" "uintptr_t *result"
.Ft int
.Fn BUS_WRITE_IVAR "device_t dev" "device_t child" "int index" "uintptr_t value"
.Sh 解説
.Pp
これらの 2 つのメソッドは子デバイスのバス特有のインスタンス変数の組
を管理します。
その意図は、異なった型のバスはそれぞれが適当なインスタンス変数
の組(ISA バスにおける port や irq という具合に)を定義するということです。
.Pp
この情報は構造体として子デバイスに与えられることも出来ましたが、
そうすると、全てのドライバを編集し再コンパイルするという作業なしには、
バスが変数を追加したり削除したりすることは困難になります。
この作業はベンダが供給するバイナリのドライバでは不可能かもしれません。
.Sh 戻り値
成功時には 0 が返され、それ以外の場合は適切なエラーが返されます。
.Sh 関連項目
.Xr device 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
