freebsd/freebsd-doc/ja_JP.eucJP/man/man9/bus_generic_attach.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/bus_generic_attach.9,v 1.3.2.1 2001/07/22 11:02:05 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/bus_generic_attach.9,v 1.3 2001/05/14 01:10:22 horikawa Exp $
.Dd June 16, 1998
.Dt BUS_GENERIC_ATTACH 9
.Os FreeBSD
.Sh 名称
.Nm bus_generic_attach
.Nd バスのための
.Dv DEVICE_ATTACH
の一般的な実装
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn bus_generic_attach "device_t dev"
.Sh 解説
この関数はほとんどのバスのコードで使用されることができる
.Xr DEVICE_ATTACH 9
メソッドの 1 つの実装を提供します。
単純に、バスに接続されているそれぞれの子デバイスに対して
.Xr device_probe_and_attach 9
を呼びます。
.Sh 戻り値
成功時は 0 を、そうでない場合は適切なエラーが返されます。
.Sh 関連項目
.Xr device 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
