freebsd/freebsd-doc/ja_JP.eucJP/man/man9/BUS_CREATE_INTR.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/BUS_CREATE_INTR.9,v 1.3 1999/08/28 00:21:05 peter Exp %
.\"
.Dd June 16, 1998
.Os
.Dt BUS_CREATE_INTR 9
.Os FreeBSD
.Sh 名称
.Nm BUS_CREATE_INTR
.Nd 割り込みハンドラの生成
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft void *
.Fn BUS_CREATE_INTR "device_t dev" "device_t child" "int irq" "driver_intr_t *intr" "void *arg"
.Sh 解説
.Pp
.Xr BUS_CREATE_INTR 9
メソッドは子デバイスのための割り込みハンドラを生成します。
このハンドラ
.Fa intr
は唯一の引数
.Fa arg
を伴って呼び出されるでしょう。
割り込みハンドラを活性化するための
.Xr BUS_CONNECT_INTR 9
の呼び出しで使用されることのできるハンドルが返されます。
.Sh 戻り値
呼び出し成功時には
割り込みを活性化することができる不明瞭なハンドルが返され、
そうでない場合には NULL が返されます。
.Sh 関連項目
.Xr BUS_CONNECT_INTR 9 ,
.Xr device 9 ,
.Xr driver 9
.Sh バグ
このインターフェイスは恐らく不十分で、変えるべき課題があります。
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
