freebsd/freebsd-doc/ja_JP.eucJP/man/man9/BUS_SETUP_INTR.9
.\" Copyright (c) 2000 Jeroen Ruigrok van der Werven
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/BUS_SETUP_INTR.9,v 1.1.2.3 2000/12/14 12:43:55 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/BUS_SETUP_INTR.9,v 1.2 2001/05/14 01:10:21 horikawa Exp $
.Dd April 2, 2000
.Dt BUS_SETUP_INTR 9
.Os FreeBSD
.Sh 名称
.Nm BUS_SETUP_INTR
.Nd 割り込みハンドラの作成と接続
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn BUS_SETUP_INTR "device_t dev" "device_t child" "struct resource *irq" "int flags" "driver_intr_t *intr" "void *arg" "void **cookiep"
.Sh 解説
.Pp
メソッド
.Nm
は、資源マネージャの
.Xr BUS_ALLOC_RESOURCE 9
メソッドによって以前に割り当てられた割り込みに対し、
割り込みハンドラを生成してアタッチします。
ハンドラ
.Fa intr
は唯一の引数
.Fa arg
の値を伴なって呼び出されます。
.Pp
割り込みハンドラは、
.Fn BUS_TEARDOWN_INTR
によってデタッチされます。
正しい割り込みハンドラを破棄するために、クッキーが
.Fn BUS_TEARDOWN_INTR
に渡される必要があります。
.Sh 戻り値
成功時には 0 が返され、それ以外の場合は適切なエラーが返されます。
.Sh 関連項目
.Xr BUS_TEARDOWN_INTR 9 ,
.Xr device 9 ,
.Xr driver 9
.Sh 作者
.An -nosplit
このマニュアルページは、
.An Doug Rabson
.Aq dfr@FreeBSD.org
が書いた BUS_CREATE_INTR および BUS_CONNECT_INTR のマニュアルページを基に、
.An Jeroen Ruigrok van der Werven
.Aq asmodai@FreeBSD.org
が書きました。
