freebsd/freebsd-doc/ja_JP.eucJP/man/man9/bus_generic_print_child.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/bus_generic_print_child.9,v 1.5 1999/08/28 00:21:19 peter Exp %
.\"
.\" $FreeBSD$
.Dd June 16, 1998
.Dt BUS_GENERIC_PRINT_CHILD 9
.Os FreeBSD
.Sh 名称
.Nm bus_generic_print_child
.Nd バスのための
.Dv DEVICE_PRINT_CHILD
の一般的な実装
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn bus_generic_print_child "device_t dev" "device_t child"
.Sh 解説
.Pp
この実装はデフォルトのデバイスアナウンスメッセージを出力します。
与えられた 'bar0' バス上の 'foo0' デバイスが、
 "FooCard 1234" という名前であるならば、 
下記のように出力されるでしょう。
.Pp
foo0: <FooCard 1234> on bar0
.Pp
bus_generic_print_child 自身は
.Fn bus_print_child_header
と
.Fn bus_print_child_footer
の 2 つの関数を呼び出します。
これらはそれぞれ "foo0: <FooCard 1234>" と "on bar0" の文字を出力します。
もし
.Fn bus_generic_print_child
があなたの要求に完全には合わない場合でも、
可能であればあなたの独自のコードでこれらのルーチンを使用するべきです
.Sh 関連項目
.Xr device 9
.Sh 戻り値
出力した文字数。
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
