freebsd/freebsd-doc/ja_JP.eucJP/man/man9/cd.9
.\" Copyright (c) 1997
.\"	John-Mark Gurney.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY John-Mark Gurney AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/cd.9,v 1.18 2003/09/03 04:46:28 ken Exp %
.\"
.\" $FreeBSD$
.Dd September 2, 2003
.Dt CD 9
.Os
.Sh 名称
.Nm cd
.Nd CAM SCSI サブシステムのための CD-ROM ドライバ
.Sh 解説
.Nm
デバイスドライバは CD-ROM ドライブ
.Tn ( SCSI
type 5)
および CD-ROM タイプのコマンドをサポートしている WORM ドライブ
.Tn ( SCSI
type 4)
のための読み込み専用インタフェースを提供します。
幾つかのドライブは、ドライバが期待したようには振舞いません。
使用可能なフラグの情報は、癖の章を参照してください。
.Sh 癖
それぞれの
.Tn CD-ROM
デバイスは、
.Tn SCSI
仕様を異なったように解釈し得ます。
これにより、ドライバ中でドライブを特別扱いする必要性が発生します。
下記はドライバが認識する癖のリストです。
.Bl -tag -width CD_Q_BCD_TRACKS
.It Dv CD_Q_NO_TOUCH
このフラグは、
ディスクがドライブの中にあるかとサイズを調査するために、
アタッチ時にプローブしないようドライバに通知します。
現在このフラグは、CAM の
.Nm
ドライバでは実装されていません。
.It Dv CD_Q_BCD_TRACKS
このフラグは、正しい 10 進数ではなくパックされた BCD でトラック番号を返す、
壊れたドライブ用です。
ドライブがトラックを飛ばしている
(トラック 10-15 が飛ばされる)
ような場合には、
あなたはこのフラグが必要なドライブを所有しています。
.It Dv CD_Q_NO_CHANGER
このフラグは、当該ドライブがチェンジャではないことを、ドライバに通知します。
これはチェンジャの一部ではないが複数の LUN を持つ CD-ROM デバイス
にだけ必要です。
.It Dv CD_Q_CHANGER
このフラグは、与えられたデバイスが複数の LUN を持つチェンジャであることを、
ドライバに通知します。
一般的には、LUN が 0 よりも大きい時には、ドライバはこれを自動的に理解します。
このフラグを設定する唯一の効果は、チェンジャのスケジューリングコードを通して、
チェンジャの LUN 0 に対して初期の容量読み取りコマンドを実行することを、
ドライバに通知することです。
.It Dv CD_Q_10_BYTE_ONLY
このフラグは、与えられたデバイスが 10 バイトの MODE SENSE/MODE SELECT コマンド
のみを受け付けることを、ドライバに通知します。
一般的にこういった癖は
.Xr cd 4
ドライバに追加されるべきではありません。
その理由は、ドライバは問題のドライブが 10 バイトコマンドを必要としているか
どうかを幾つかの方法で決定しようとするためです。
最初にドライバは、ドライブが一般的に話すプロトコルが 10 バイトコマンドを
認めるかどうかを決定するために CAM Path Inquiry (CAM パス照会) コマンドを
発行します。
(ATAPI および USB は一般的に 10 バイトコマンドのみを送りたい
プロトコルの 2 つの顕著な例です。)
それから、6 バイトの MODE SENSE または MODE REQUEST コマンド
から ILLEGAL REQUEST エラーが返された場合には、代わりに
そのコマンドの 10 バイトバージョンを送ろうとします。
癖が必要になるだろう唯一の理由は、ドライブが一般的に 6 バイトコマンドに問題を
持っていないプロトコル (例えば
.Tn SCSI )
の場合です。
.El
.Sh 関連ファイル
.Bl -tag -width /sys/cam/scsi/scsi_cd.c -compact
.It Pa /sys/cam/scsi/scsi_cd.c
ドライバのソースファイルです。
.El
.Sh 関連項目
.Xr cd 4 ,
.Xr scsi 4
.Sh 歴史
.Nm
のマニュアルページは
.Fx 2.2
で初めて登場しました。
.Sh 作者
.An -nosplit
このマニュアルページは
.An John-Mark Gurney Aq gurney_j@efn.org
が書きました。
CAM と
.Fx 3.0
のために
.An Kenneth Merry Aq ken@FreeBSD.org
が更新しました。
