freebsd/freebsd-doc/ja_JP.eucJP/man/man9/cdevsw_remove.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/cdevsw_remove.9,v 1.5 2001/07/13 09:09:52 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 9, 2001
.Dt CDEVSW_REMOVE 9
.Os
.Sh 名称
.Nm cdevsw_remove
.Nd
.Vt cdevsw
エントリの削除
.Sh 書式
.In sys/param.h
.In sys/conf.h
.Ft int
.Fn cdevsw_remove "struct cdevsw *oldentry"
.Sh 解説
.Fn cdevsw_remove
関数は、そのメジャー番号が 0 以上でかつ
.Dv NUMCDEVSW
より小さい場合に、
.Fa oldentry
エントリを
.Va cdevsw
テーブルから削除します。
.Pp
引数は以下の通りです。
.Bl -tag -width ".Fa oldentry"
.It Fa oldentry
テーブルから削除されるべきデバイスです。
.El
.Sh 戻り値
成功時には 0 の値が返され、そうでない場合には
メジャー番号が有効な範囲にはないことを示す
.Er EINVAL
が返されます。
.Sh 作者
このマニュアルページは
.An Chad David Aq davidc@acns.ab.ca
が書きました。
