freebsd/freebsd-doc/ja_JP.eucJP/man/man9/copy.9
.\"	%NetBSD: copy.9,v 1.2 1996/01/09 03:23:04 thorpej Exp %
.\"
.\" Copyright (c) 1996 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed by Kenneth Stailey.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason R. Thorpe.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/copy.9,v 1.14 2004/03/29 19:42:21 hmp Exp %
.\"
.\" $FreeBSD$
.Dd January 7, 1996
.Dt COPY 9
.Os
.Sh 名称
.Nm copy ,
.Nm copyin ,
.Nm copyout ,
.Nm copystr ,
.Nm copyinstr
.\" .Nm copyinstr ,
.\" .Nm copyoutstr
.Nd カーネルコピー関数
.Sh 書式
.In sys/types.h
.In sys/systm.h
.Ft int
.Fn copyin "const void *uaddr" "void *kaddr" "size_t len"
.Ft int
.Fn copyout "const void *kaddr" "void *uaddr" "size_t len"
.Ft int
.Fn copystr "const void *kfaddr" "void *kdaddr" "size_t len" "size_t *done"
.Ft int
.Fn copyinstr "const void *uaddr" "void *kaddr" "size_t len" "size_t *done"
.\" .Ft int
.\" .Fn copyoutstr "const void *kaddr" "void *uaddr" "size_t len" "size_t *done"
.Sh 解説
.Nm
関数群は連続したデータをあるアドレスから
別のアドレスへコピーするようデザインされています。
.Fn copystr
以外の関数は、ユーザ空間からカーネル空間へ、
あるいは反対向きにデータをコピーします。
.Pp
.Nm
関数群は以下の機能を提供します。
.Bl -tag -width "copyoutstr()"
.It Fn copyin
ユーザ空間のアドレス
.Fa uaddr
からカーネル空間のアドレス
.Fa kaddr
へ
.Fa len
バイトのデータをコピーします。
.It Fn copyout
カーネル空間のアドレス
.Fa kaddr
からユーザ空間のアドレス
.Fa uaddr
へ
.Fa len
バイトのデータをコピーします。
.It Fn copystr
カーネル空間のアドレス
.Fa kfaddr
からカーネル空間のアドレス
.Fa kdaddr
へヌル文字で終端された最大
.Fa len
文字の文字列をコピーします。
末尾のヌル文字を含む実際にコピーされた文字数が
.Fa *done
に返されます
.Po
.Fa done
が
.Dv NULL
ではない場合
.Pc Ns 。
.It Fn copyinstr
ユーザ空間のアドレス
.Fa uaddr
からカーネル空間のアドレス
.Fa kaddr
へヌル文字で終端された最大
.Fa len
文字の文字列をコピーします。
末尾のヌル文字を含む実際にコピーされた文字数が
.Fa *done
に返されます
.Po
.Fa done
が
.Dv NULL
ではない場合
.Pc Ns 。
.\" .It Fn copyoutstr
.\" カーネル空間のアドレス
.\" .Fa kaddr
.\" からユーザ空間のアドレス
.\" .Fa uaddr
.\" へヌル文字で終端された最大
.\" .Fa len
.\" 文字の文字列をコピーします。
.\" 末尾のヌル文字を含む実際にコピーされた文字数が
.\" .Fa *done
.\" に返されます。
.El
.Sh 戻り値
それぞれの
.Nm
関数は成功した時に 0 を、不正なアドレスに遭遇した時に
.Er EFAULT
を返します。
さらに、
.Fn copystr
および
.Fn copyinstr
.\"、
.\" .Fn copyoutstr
関数は文字列が
.Fa len
バイトよりも長い時に
.Er ENAMETOOLONG
を返します。
.Sh 関連項目
.Xr fetch 9 ,
.Xr store 9
