freebsd/freebsd-doc/ja_JP.eucJP/man/man9/CTASSERT.9
.\" Copyright (c) 2003 Hiten M. Pandya
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/CTASSERT.9,v 1.2 2003/05/30 21:13:32 ru Exp %
.\"
.\" $FreeBSD$
.Dd May 15, 2003
.Os
.Dt CTASSERT 9
.Sh 名称
.Nm CTASSERT
.Nd コンパイル時のアサーションマクロ
.Sh 書式
.In sys/param.h
.In sys/systm.h
.Fn CTASSERT expression
.Sh 解説
.Fn CTASSERT
マクロは
.Fa expression
をコンパイル時に評価し、それが偽の場合にはコンパイラエラーを発生させます。
.Pp
.Fn CTASSERT
マクロは重要なデータ構造体または変数のサイズまたはアライメントを
コンパイル時にアサートするのに便利です。
これは実行時にコードを失敗させる事とは異なります。
.Sh 使用例
.Vt uuid
構造体の大きさが 16 バイトであることをアサートします。
.Pp
.Dl "CTASSERT(sizeof(struct uuid) == 16);"
.Sh 関連項目
.Xr KASSERT 9
.Sh 作者
このマニュアルページは
.An Hiten M. Pandya
.Aq hmp@FreeBSD.org
が書きました。
