freebsd/freebsd-doc/ja_JP.eucJP/man/man9/devclass.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/devclass.9,v 1.8 2001/07/10 15:30:56 ru Exp %
.\"
.\" $FreeBSD$
.Dd June 16, 1998
.Dt DEVCLASS 9
.Os
.Sh 名称
.Nm devclass
.Nd デバイスのクラスを表現するオブジェクト
.Sh 書式
.Vt typedef struct devclass *devclass_t ;
.Sh 解説
.Dv devclass
オブジェクトはシステムに 2 つの主な関数を持っています。
1 つ目はデバイスインスタンスのユニット番号割り当てを管理するためのもので、
2 つ目は各々のバスタイプのためのデバイスドライバのリストを
保持するためのものです。
それぞれの
.Dv devclass
は名前を持っていて、同じ名前を持つ 2 つの devclass は存在できません。
これは一意なユニット番号が
デバイスインスタンスに割り当てられることを保証します。
.Pp
これは、異なるバスに同じデバイスドライバを接続するために、
.Dv devclass
が同じでなければならないということを意味することに、気を付けてください。
.Sh 関連項目
.Xr devclass_add_driver 9 ,
.Xr devclass_delete_driver 9 ,
.Xr devclass_find 9 ,
.Xr devclass_find_driver 9 ,
.Xr devclass_get_device 9 ,
.Xr devclass_get_devices 9 ,
.Xr devclass_get_maxunit 9 ,
.Xr devclass_get_name 9 ,
.Xr devclass_get_softc 9 ,
.Xr device 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
