freebsd/freebsd-doc/ja_JP.eucJP/man/man9/devclass_add_driver.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/devclass_add_driver.9,v 1.3.2.1 2001/07/21 09:16:57 schweikh Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/devclass_add_driver.9,v 1.2 2001/05/14 01:10:23 horikawa Exp $
.Dd June 16, 1998
.Dt DEVCLASS_ADD_DRIVER 9
.Os FreeBSD
.Sh 名称
.Nm devclass_add_driver ,
.Nm devclass_delete_driver ,
.Nm devclass_find_driver
.Nd devclass の中のドライバの操作
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn devclass_add_driver "devclass_t dc" "driver_t *driver"
.Ft int
.Fn devclass_delete_driver "devclass_t dc" "driver_t *driver"
.Ft driver_t *
.Fn devclass_find_driver "devclass_t dc" "const char *name"
.Sh 解説
.Pp
これらの関数は、システムに新しいドライバを追加するため、
古いドライバを削除するため、
および存在しているドライバを探すため、使用可能です。
通常、ドライバはシステム初期化時に自動的に追加されます。
.Sh 関連項目
.Xr devclass 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
