freebsd/freebsd-doc/ja_JP.eucJP/man/man9/devfs_add_devswf.9
.\"
.\" Copyright (c) 1995 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/devfs_add_devswf.9,v 1.9.2.3 2000/12/29 10:18:07 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/devfs_add_devswf.9,v 1.2 2001/05/14 01:10:23 horikawa Exp $
.Dd December 31, 1995
.Os FreeBSD
.Dt DEVFS_ADD_DEVSWF 9
.Sh 名称
.Nm devfs_add_devswf
.Nd デバイスをデバイススイッチテーブルに結合
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <sys/devfsext.h>
.Ft void *
.Fn devfs_add_devswf "void *devsw" "int minor" "int chrblk" "uid_t uid" "gid_t gid" "int perms" "char *fmt" ...
.Sh 解説
devfs にエントリを追加する呼び出しは
.Nm
です。
.Pp
引数は以下の通りです。
.Bl -tag -width 8n
.It Ar devsw
アクセスするべき devsw エントリの名前のアドレス。
.It Ar minor
マイナ番号。
.It Ar chrblk
デバイスが CHAR 型か BLK 型か。
.It Ar uid
所有者 UID。
.It Ar gid
所有者 GID。
.It Ar perms
パーミッション (例えば rwxr--r-- = 0744)。
.It Ar fmt
名前を含む整形された文字列で、
もし当てはまるならば DEVFS の中のデバイスへのパス名。
.El
.Sh 戻り値
トークンを返します。
このトークンは、同じデバイスに対して他の名前をリンクするため
.Pq Xr devfs_link 9 を参照
または、そのデバイスを破棄するため
.Pq Xr devfs_remove_dev 9 を参照
に使用可能です。
.Sh 関連項目
.Xr devfs_link 9 ,
.Xr devfs_remove_dev 9
.Sh 歴史
関数
.Nm
は
.Fx 2.2
で登場しました。
.Sh 作者
.An -nosplit
このマニュアルページは
.An Julian Elischer
の解説の後に
.An J\(:org Wunsch
が書きました。
