freebsd/freebsd-doc/ja_JP.eucJP/man/man9/devfs_link.9
.\"
.\" Copyright (c) 1995 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/devfs_link.9,v 1.12 1999/08/28 00:21:22 peter Exp $
.\"
.Dd December 31, 1995
.Os FreeBSD
.Dt DEVFS_LINK 9
.Sh 名称
.Nm devfs_makelink
.Nd devfs エントリのハードリンクの作成
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <sys/devfsext.h>
.Ft void *
.Fn devfs_makelink "void *original" "char *fmt" ...
.Sh 解説
関数
.Nm
は以前の
.Fn devfs_add_devswf
または
.Fn devfs_makelink
の呼び出しでのトークンを引数としてとり、それを
.Ar fmt
文字列で示された別の場所にリンクします。
.Sh 戻り値
新しくリンクされた devfs エントリのトークンを返します。
.Sh 関連項目
.Xr devfs_add_devswf 9 ,
.Xr devfs_remove_dev 9
.Sh 歴史
関数
.Nm
は
.Fx 2.2
で登場しました。
.Sh 作者
このマニュアルページは
.if t J\(:org Wunsch
.if n Joerg Wunsch
が書きました。
