freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_get_state.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/device_get_state.9,v 1.3 1999/08/28 00:21:26 peter Exp $
.\"
.Dd June 16, 1998
.Dt DEVICE_GET_STATE 9
.Os FreeBSD
.Sh 名称
.Nm device_get_state ,
.Nm device_busy ,
.Nm device_unbusy ,
.Nm device_is_alive
.Nd デバイス状態の操作
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft device_state_t
.Fn device_get_state "device_t dev"
.Ft void
.Fn device_busy "device_t dev"
.Ft void
.Fn device_unbusy "device_t dev"
.Ft int
.Fn device_is_alive "device_t dev"
.Sh 解説
.Pp
デバイスの現在の状態は、
.Dv DS_NOTPRESENT ,
.Dv DS_ALIVE ,
.Dv DS_ATTACHED ,
.Dv DS_BUSY
(
.Xr device 9
で説明されています) を返す
.Xr device_get_state 9
の呼び出しによってアクセスされます。
デバイスがうまくプローブされたことを確認するには、単純に状態が
.Dv DS_ALIVE
以上であるかどうかを返す
.Xr device_is_alive 9
を呼び出します。
.Pp
個々のデバイスは、
.Xr device_busy 9
が呼び出された時にインクリメントされ、
.Xr device_unbusy 9
が呼び出された時にデクリメントされるビジーカウントを持っています。
どちらのルーチンもデバイスの状態が
.Dv DS_ATTACHED
より小さい場合にはエラーを返します。
.Pp
デバイスが
.Dv DS_ATTACHED
状態で
.Xr device_busy 9
が呼び出された時には、デバイスは
.Dv DS_BUSY
状態に遷移します。
.Xr device_unbusy 9
が呼び出されでデクリメントされた後にデバイスのビジーカウントが 0 ならば、
デバイスは
.Dv DS_ATTACHED
状態に遷移します。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
