freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_quiet.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_quiet.9,v 1.11 2003/10/23 06:19:45 hmp Exp %
.\"
.\" $FreeBSD$
.Dd June 21, 1999
.Dt DEVICE_QUIET 9
.Os
.Sh 名称
.Nm device_quiet ,
.Nm device_verbose ,
.Nm device_is_quiet
.Nd デバイスの沈黙フラグの操作
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft void
.Fn device_quiet "device_t dev"
.Ft void
.Fn device_verbose "device_t dev"
.Ft int
.Fn device_is_quiet "device_t dev"
.Sh 解説
個々のデバイスは結びつけられた沈黙フラグを持っています。
デバイスは生成時のデフォルトでは冗長ですが、プローブ中に
デバイス識別文字列の出力を妨げるために、沈黙させられます。
デバイスを沈黙させるには
.Fn device_quiet
を呼び出し、プローブメッセージを再度有効 (例えば
.Xr device_detach 9
の後に、メッセージが再び現れるようにします) にするには
.Fn device_verbose
を呼び出します。
デバイスが沈黙状態かどうかを確認するためには
.Fn device_is_quiet
を呼び出します。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
