freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_get_name.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2003 M. Warner Losh
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_get_name.9,v 1.3 2003/10/23 06:19:45 hmp Exp %
.\"
.\" $FreeBSD$
.Dd April 21, 2003
.Dt DEVICE_GET_NAME 9
.Os
.Sh 名称
.Nm device_get_name , device_get_nameunit
.Nd デバイスのデバイスクラスまたは実体の名前へのアクセス
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft int
.Fn device_get_name "device_t dev"
.Ft int
.Fn device_get_nameunit "device_t dev"
.Sh 解説
.Fn device_get_name
関数はデバイスのデバイスクラスの名前を返します。
.Pp
.Fn device_get_nameunit
関数はデバイスの実体の名前を返します。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An Warner Losh
が書きました。
