freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_printf.9
.\"
.\" Copyright (c) 2003 M. Warner Losh
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_printf.9,v 1.2 2003/05/30 21:13:32 ru Exp %
.\"
.\" $FreeBSD$
.Dd April 21, 2003
.Dt DEVICE_PRINTF 9
.Os
.Sh 名称
.Nm device_printf
.Nd フォーマット出力の変換
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft int
.Fn device_printf "device_t dev" "const char *fmt" ...
.Sh 解説
.Fn device_printf
関数は
.Xr printf 9
関数への便利なインタフェースです。
コロンおよびスペースが後に続く
.Fa dev
デバイスの名前を出力します。
それから、
.Fa fmt
およびそれへの残りの引数が渡された場合には
.Xr printf 9
が印字するものを出力します。
.Sh 戻り値
.Fn device_printf
関数は表示された文字数を返します。
.Sh 関連項目
.Xr printf 3 ,
.Xr printf 9
