freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_enable.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_enable.9,v 1.3.2.2 2001/08/17 13:08:54 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/device_enable.9,v 1.3 2001/07/29 05:15:42 horikawa Exp $
.Dd June 16, 1998
.Dt DEVICE_ENABLE 9
.Os
.Sh 名称
.Nm device_enable ,
.Nm device_disable ,
.Nm device_is_enabled
.Nd デバイスの有効フラグの操作
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft void
.Fn device_enable "device_t dev"
.Ft void
.Fn device_disable "device_t dev"
.Ft int
.Fn device_is_enabled "device_t dev"
.Sh 解説
個々のデバイスは、結びつけられた有効フラグを持っています。
デバイスは生成時にはデフォルトで有効になっていますが、(例えば、破壊的または
時間を消費するプローブの試みを防ぐために) 無効にできます。
デバイスを無効にするには
.Xr device_disable 9
を呼び出し、再度有効にするには
.Xr device_enable 9
を呼び出し、デバイスが有効かどうか確認するには
.Xr device_is_enabled 9
を呼び出します。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
