freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_set_desc.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/device_set_desc.9,v 1.5 2000/03/03 14:05:06 sheldonh Exp $
.\"
.Dd June 16, 1998
.Dt DEVICE_SET_DESC 9
.Os FreeBSD
.Sh 名称
.Nm device_set_desc ,
.Nm device_set_desc_copy ,
.Nm device_get_desc
.Nd デバイスの記述にアクセス
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft void
.Fn device_set_desc "device_t dev" "const char *desc"
.Ft void
.Fn device_set_desc_copy "device_t dev" "const char *desc"
.Ft const char *
.Fn device_get_desc "device_t dev"
.Sh DESCRIPTION
.Pp
デバイスの冗長な記述を操作します。
(存在するならば) この記述は、
自動コンフィギュレーションの間のアタッチ時に、
メッセージの一部として表示されます。
変種の
.Xr device_set_desc_copy 9
は、渡される文字列が上書きされるかも知れない一時的なバッファである場合に、
使用されます。
この場合にはシステムはその文字列をコピーしますが、
そうでない場合には渡されたポインタが直接使用されます。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
