freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_find_child.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_find_child.9,v 1.8.4.1 2005/02/25 20:25:35 njl Exp %
.\"
.\" $FreeBSD$
.Dd February 8, 2005
.Dt DEVICE_FIND_CHILD 9
.Os
.Sh 名称
.Nm device_find_child
.Nd デバイスの子の検索
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft device_t
.Fn device_find_child "device_t dev" "const char *classname" "int unit"
.Sh 解説
この関数は、
.Dv dev
の子で、
.Fa classname
および
.Fa unit
を持つものを検索します。
.Fa unit
が -1 であるなら、一致する
.Fa classname
で
.Dv dev
の最初の子を返します。
(すなわち、最も低い unit です。)
.Sh 戻り値
存在している場合には子デバイスが返され、そうでない場合には NULL が返されます。
.Sh 関連項目
.Xr device_add_child 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
によって書かれました。
