freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_set_driver.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2003 M. Warner Losh
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_set_driver.9,v 1.2 2003/05/30 21:13:32 ru Exp %
.\"
.\" $FreeBSD$
.Dd April 21, 2003
.Dt DEVICE_SET_DRIVER 9
.Os
.Sh 名称
.Nm device_set_driver
.Nd "指定したドライバとツリーの中のデバイスノードとの関連付け"
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft void
.Fn device_set_driver "device_t dev" "driver_t *driver"
.Sh 解説
この関数は指定したドライバとツリーの中の与えられたデバイスノードを
関連付けます。
これは一般的には
.Xr isa 4
バスのような、関連付けを自動的に行なうことをサポートしていないバスへ
デバイスを追加するために、
.Xr DEVICE_IDENTIFY 9
関数の中で使用されます。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An M. Warner Losh
が書きました。
