freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_get_ivars.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_get_ivars.9,v 1.7 2003/04/22 03:25:14 imp Exp %
.\"
.\" $FreeBSD$
.Dd June 16, 1998
.Dt DEVICE_GET_IVARS 9
.Os
.Sh 名称
.Nm device_get_ivars ,
.Nm device_set_ivars
.Nd バスの私的変数へのアクセス
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft void *
.Fn device_get_ivars "device_t dev"
.Ft void
.Fn device_set_ivars "device_t dev" "void *ivar"
.Sh 解説
.Pp
.Nm device_get_ivars
関数はデバイスのバス固有のインスタンス変数を返します。
.Pp
.Nm device_set_ivars
関数はデバイスのバス固有のインスタンス変数を設定します。
.Pp
一般に、バスドライバのみがこれらの関数を使用します。
カーネルは、バスドライバはこのメモリを管理し、自動でのメモリの
割り当てと開放が発生しないということを、決めてかかります。
代わりに、クライアントのドライバは
.Xr BUS_READ_IVAR 9
インタフェースを通して ivars にアクセスするべきです。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
