freebsd/freebsd-doc/ja_JP.eucJP/man/man9/DEVICE_ATTACH.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/DEVICE_ATTACH.9,v 1.3.2.2 2001/07/24 09:49:39 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/DEVICE_ATTACH.9,v 1.5 2001/07/29 05:15:41 horikawa Exp $
.Dd June 16, 1998
.Dt DEVICE_ATTACH 9
.Os FreeBSD
.Sh 名称
.Nm DEVICE_ATTACH
.Nd デバイスのアタッチ
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn DEVICE_ATTACH "device_t dev"
.Sh 解説
デバイスをシステムにアタッチします。
プローブメソッドは既に呼び出されているでしょうし、
デバイスが存在していると示されているでしょう。
このルーチンはハードウェアの初期化と
その他のシステムリソース (
.Pa dev
エントリなど) の割り当てを行なうべきです。
.Sh 戻り値
成功時には 0 が返され、それ以外の場合は適切なエラーが返されます。
.Sh 関連項目
.Xr device 9 ,
.Xr DEVICE_DETACH 9 ,
.Xr DEVICE_PROBE 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
