freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_probe_and_attach.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_probe_and_attach.9,v 1.3.2.2 2001/08/17 13:08:54 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/device_probe_and_attach.9,v 1.3 2001/07/29 05:15:42 horikawa Exp $
.Dd June 16, 1998
.Dt DEVICE_PROBE_AND_ATTACH 9
.Os
.Sh 名称
.Nm device_probe_and_attach
.Nd デバイスの初期化
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn device_probe_and_attach "device_t dev"
.Sh 解説
この関数は、自動コンフィギュレーションの間に呼び出され、
システムのデバイスを初期化します。
個々のデバイスに対して、適切なドライバの
.Xr DEVICE_PROBE 9
メソッドが呼び出され、プローブに成功した場合には、デバイスの記述が表示され、
.Xr DEVICE_ATTACH 9
メソッドが呼び出されます。
.Xr device_disable 9
を使用してデバイスが無効にされている場合には、プローブされません。
.Sh 戻り値
成功時には 0 が返され、そうでない場合には適切なエラーが返されます。
.Sh 関連項目
.Xr device 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
