freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_get_devclass.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_get_devclass.9,v 1.8 2003/10/23 06:19:45 hmp Exp %
.\"
.\" $FreeBSD$
.Dd June 16, 1998
.Dt DEVICE_GET_DEVCLASS 9
.Os
.Sh 名称
.Nm device_get_devclass
.Nd デバイスのデバイスクラスへのアクセス
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft devclass_t
.Fn device_get_devclass "device_t dev"
.Sh 解説
デバイスに関連づけられている現在のデバイスクラスが返されます。
デバイスがデバイスクラスを持っていない場合には、
.Dv NULL
が返されます。
.Sh 関連項目
.Xr devclass 9 ,
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
