freebsd/freebsd-doc/ja_JP.eucJP/man/man9/DEVICE_PROBE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/DEVICE_PROBE.9,v 1.4.2.4 2001/07/22 11:02:04 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/DEVICE_PROBE.9,v 1.4 2001/05/14 01:10:21 horikawa Exp $
.Dd June 16, 1998
.Os
.Dt DEVICE_PROBE 9
.Os FreeBSD
.Sh 名称
.Nm DEVICE_PROBE
.Nd デバイスの存在のプローブ
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn DEVICE_PROBE "device_t dev"
.Sh 解説
このデバイスメソッドはデバイスがあるかどうかを知るためにプローブするべきです。
デバイスが存在すれば 0 を、デバイスが見つからなければ
.Er ENXIO
を返すべきです。
プローブの間にその他のエラー(メモリ割当の失敗など)が起こった場合は、
適切なエラーコードが返されるべきです。
1 つのデバイスに 1 つ以上のドライバが当てはまるような場合のために、
優先順位を返すことができます。
この場合、成功の値は 0 以下の値で、
最も大きな値が最も適切であることを意味します。
失敗の値は正の値で表現され、
通常の UNIX エラーコードが目的に応じて使用されるべきです。
.Pp
ドライバが 0 より小さい成功値を返す場合、
ドライバはそのデバイスにアタッチされるのが
同じドライバであると想定してはいけません。
特に、softc 構造体に格納されたすべての値が
アタッチメソッドで利用可能であると想定してはいけませんし、
また、アタッチメソッドが呼ばれた場合、
プローブの間に割り当てられたあらゆるリソースは開放して
再割り当てしなければなりません。
成功値 0 を返す場合には、
ドライバはそのドライバがアタッチされると想定することができます。
.Pp
バスを実装するデバイスは、
バスに接続されたデバイスの存在をプローブし
それらを子デバイスとして追加するために、
このメソッドを使用するべきです。
このメソッドが
.Xr bus_generic_attach 9
の使用と結合していれば、
子デバイスは自動的にプローブされ、アタッチされるでしょう。
.Sh 戻り値
0 以下の値は成功を表し、0 より大きな値はエラー(errno)を表します。
0 以下の値の時、0 は最高の優先順位を表し、それ以上のプローブは行ないません。
0 未満の値は、低い値程、低い優先順位を表します。
たとえば、-100 は -50 よりも低い優先順位を表します。
.Sh 関連項目
.Xr device 9 ,
.Xr DEVICE_ATTACH 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
