freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_ids.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_ids.9,v 1.2 2003/10/23 06:19:45 hmp Exp %
.\"
.\" $FreeBSD$
.Dd July 9, 2001
.Dt DEVICE_IDS 9
.Os
.Sh 名称
.Nm device_ids ,
.Nm major ,
.Nm minor ,
.Nm umajor ,
.Nm uminor
.Nd デバイス ID の計算
.Sh 書式
.In sys/types.h
.In sys/systm.h
.Ft int
.Fn major "dev_t dev"
.Ft int
.Fn minor "dev_t dev"
.Ft int
.Fn umajor "udev_t id"
.Ft int
.Fn uminor "udev_t id"
.Sh 解説
.Nm
ファミリの関数は、ローデバイスの ID である
.Fa id
またはデバイス構造体へのポインタである
.Fa dev
をとり、要求されたメジャーまたはマイナデバイス ID の整数値を返します。
.Pp
実際のメジャーおよびマイナデバイス ID はローデバイス ID から
マスクされた値です。
実際のメジャーおよびマイナ ID を決定するために使用される計算上の詳細は、
.Pa kern_conf.c
の実際のソースを参照して下さい。
.Sh 戻り値
0 より大きくかつ
.Dv NUMCDEVSW
より小さい整数値です。
そのデバイスが無効である場合には、
.Fn major
および
.Fn minor
は
.Dv NOUDEV
を返します。
.Sh AUTHORS
このマニュアルページは
.An Chad David Aq davidc@acns.ab.ca
が書きました。
