freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_get_softc.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_get_softc.9,v 1.8 2003/03/28 07:28:31 imp Exp %
.\"
.\" $FreeBSD$
.Dd June 16, 1998
.Dt DEVICE_GET_SOFTC 9
.Os
.Sh 名称
.Nm device_get_softc
.Nd ドライバの私的なインスタンス変数へのアクセス
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft void *
.Fn device_get_softc "device_t dev"
.Sh 解説
デバイス
.Fa dev
のドライバ固有の状態を返します。　
この softc は最初に要求された時に自動的に割り当てられます。
割り当ての大きさは、ドライバを定義するために使用されるデバイスの
.Ft driver_t
情報によって決定されます。
softc は一般的に、デバイスの実体の状態をカプセル化します。
.Pp
ドライバ設計者が、独自の softc 管理メカニズムを使用することは推奨されません。
ドライバ設計者は、この関数より以前のツリーの中のドライバで見つけた、
このようなメカニズムをコピーするべきではありません。
.Sh 戻り値
デバイス固有のインスタンス変数へのポインタが返されます。
.Sh 関連項目
.Xr driver 9 ,
.Xr device 9 ,
.Xr device_set_softc 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
