freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_delete_child.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_delete_child.9,v 1.3.2.1 2001/01/16 10:41:23 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/device_delete_child.9,v 1.2 2001/05/14 01:10:23 horikawa Exp $
.Dd June 16, 1998
.Dt DEVICE_DELETE_CHILD 9
.Os FreeBSD
.Sh 名称
.Nm device_delete_child
.Nd デバイスから子を削除
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/bus.h>
.Ft int
.Fn device_delete_child "device_t dev" "device_t child"
.Sh 解説
.Pp
指定されたデバイスを
.Fa dev
から取り除き削除します。
そのデバイスが現在アタッチされている場合には、先にデタッチ (
.Xr DEVICE_ATTACH 9
および
.Xr DEVICE_DETACH 9
を参照してください)
されます。
.Sh 戻り値
成功時には 0 が返され、そうでない場合にはエラーが返されます。
.Sh 関連項目
.Xr device_add_child 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
