freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_set_flags.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1999 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_set_flags.9,v 1.6 2001/10/01 16:09:24 ru Exp %
.\"
.\" $FreeBSD$
.Dd September 6, 1999
.Dt DEVICE_GET_FLAGS 9
.Os
.Sh 名称
.Nm device_set_flags ,
.Nm device_get_flags
.Nd ドライバフラグの操作
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft void
.Fn device_set_flags "device_t dev" "u_int32_t flags"
.Ft u_int32_t
.Fn device_get_flags "device_t dev"
.Sh 解説
個々のデバイスは、デバイスの振舞いを制御するために使用される
ドライバ依存のフラグの組を、しばしばサポートしています。
これらのフラグは
.Xr device_get_flags 9
の呼び出しによって読み込まれ、
.Xr device_set_flags 9
の呼び出しによって書き込まれます。
.Sh 関連項目
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
