freebsd/freebsd-doc/ja_JP.eucJP/man/man9/device_get_children.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1998 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/device_get_children.9,v 1.1.2.3 2001/12/17 11:30:18 ru Exp %
.\"
.\" $FreeBSD$
.Dd December 1, 1999
.Dt DEVICE_GET_CHILDREN 9
.Os
.Sh 名称
.Nm device_get_children
.Nd デバイスに接続されているデバイスのリストの取得
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Ft int
.Fn device_get_children "device_t dev" "device_t **devlistp" "int *devcountp"
.Sh 解説
現在
.Pa dev
に接続されている全てのデバイスインスタンスのリストを取り出し、そのリストを
.Fa *devlistp
に、その個数を
.Fa *devcountp
に入れて返します。
リストのために割り当てられたメモリは
.Fn free "*devlistp" "M_TEMP"
を使用して開放されるべきです。
.Sh 戻り値
成功時には 0 が返され、そうでない場合には適切なエラーが返されます。
.Sh 関連項目
.Xr devclass 9 ,
.Xr device 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
