freebsd/freebsd-doc/ja_JP.eucJP/man/man9/devtoname.9
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/devtoname.9,v 1.2.2.4 2001/12/17 11:30:18 ru Exp %
.\"
.\" $FreeBSD$
.Dd September 25, 1999
.Os
.Dt DEVTONAME 9
.Sh 名称
.Nm devtoname
.Nd dev_t データをデバイス名を示す文字列に変換
.Sh 書式
.In sys/types.h
.In sys/conf.h
.Ft const char *
.Fn devtoname "dev_t dev"
.Sh 解説
.Fn devtoname
関数は、渡されたデバイスの名前へのポインタを返します。
名前は
.Fn make_dev
で設定されたものです。
.Va dev
に関連付けられた名前が無い場合には、
.Dq #
とそれに続く
.Va dev
に割り当てられている
.Dq Va メジャー Ns / Ns Va マイナ番号
で構成される文字列へのポインタが返されます。
.Sh 歴史
.Fn devtoname
インタフェースは
.Fx 4.0
で初めて登場しました。
