freebsd/freebsd-doc/ja_JP.eucJP/man/man9/fetch.9
.\"	%NetBSD: fetch.9,v 1.2 1996/01/09 21:59:24 perry Exp %
.\"
.\" Copyright (c) 1996 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed by Kenneth Stailey.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason R. Thorpe.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/fetch.9,v 1.6 1999/08/28 00:21:28 peter Exp %
.\"
.Dd Jan 7, 1996
.Dt FETCH 9
.Os FreeBSD
.Sh 名称
.Nm fetch ,
.Nm fubyte ,
.Nm fusword ,
.Nm fuswintr ,
.Nm fuword
.Nd ユーザー空間からのデータの取り出し
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <sys/time.h>
.Fd #include <sys/systm.h>
.Fd #include <sys/resourcevar.h>
.Ft int
.Fn fubyte "const void *base"
.Ft int
.Fn fusword "void *base"
.Ft int
.Fn fuswintr "void *base"
.Ft long
.Fn fuword "const void *base"
.Sh 解説
.Nm
関数群はユーザー空間から小さなデータをコピーするようにデザインされています。
.Pp
.Nm
ルーチンは以下の機能を提供します。
.Bl -tag -width "fuswintr()"
.It Fn fubyte
ユーザー空間のアドレス
.Pa base
から 1 バイトのデータを取り出します。
.It Fn fusword
ユーザー空間のアドレス
.Pa base
から 1 ショートワードのデータを取り出します。
.It Fn fuswintr
ユーザー空間のアドレス
.Pa base
から 1 ショートワードデータを取り出します。
この関数は割り込みコンテキスト中でも安全に呼び出せます。
.It Fn fuword
ユーザー空間のアドレス
.Pa base
から 1 ワードのデータを取り出します。
.El
.Sh 戻り値
.Nm
関数は取り出したデータを返しますが、失敗した場合は -1 を返します。
.Sh 関連項目
.Xr copy 9 ,
.Xr store 9 .
