freebsd/freebsd-doc/ja_JP.eucJP/man/man9/groupmember.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/groupmember.9,v 1.1 2001/07/13 18:35:48 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 9, 2001
.Dt GROUPMEMBER 9
.Os
.Sh 名称
.Nm groupmember
.Nd グループ ID のためのグループセットのチェック
.Sh 書式
.In sys/param.h
.In sys/ucred.h
.Ft int
.Fn groupmember "gid_t gid" "struct ucred *cred"
.Sh 解説
.Fn groupmember
関数は与えられた
.Fa gid
が証明のグループセット内にあるかどうかを、見るためにチェックします。
.Pp
引数は以下の通りです。
.Bl -tag -width ".Fa cred"
.It Fa gid
チェックするべきグループ ID です。
.It Fa cred
これらの証明を検索して、グループをみつけようとします。
.El
.Sh 戻り値
.Fa gid
が見つかった場合には 1 が返され、そうでない場合には 0 が返されます。
.Sh 作者
このマニュアルページは
.An Chad David Aq davidc@acns.ab.ca
が書きました。
