freebsd/freebsd-doc/ja_JP.eucJP/man/man9/kernacc.9
.\"	%NetBSD: access.9,v 1.1 1996/06/16 10:38:35 pk Exp %
.\"
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Kranenburg.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/kernacc.9,v 1.7 2000/03/03 14:05:06 sheldonh Exp %
.\"
.Dd June 16, 1996
.Dt KERNACC 9
.Os FreeBSD
.Sh 名称
.Nm kernacc ,
.Nm useracc
.Nd メモリ領域がアクセス可能か否かの調査
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <vm/vm.h>
.Fd #include <vm/vm_extern.h>
.Ft int
.Fn kernacc "caddr_t addr" "int len" "int rw"
.Ft int
.Fn useracc "caddr_t addr" "int len" "int rw"
.Sh 解説
.Fn kernacc
および
.Fn useracc
関数は、
.Fa addr
および
.Fa len
によって与えられる仮想アドレス範囲で、
.Fa rw
で指定された操作のタイプが許可されるかどうかを調査します。
.Fa rw
の指定可能な値は、
.Dv VM_PROT_READ ,
.Dv VM_PROT_WRITE 
および
.Dv VM_PROT_EXECUTE
の論理合成値です。
.Fn kernacc
はカーネルアドレス空間の中のアドレスを調べ、一方
.Fn useracc
は
.Fa addr
をユーザ空間のアドレス表現とみなします。
この操作に使用されるプロセスコンテキストは大域変数
.Va curproc
から得られます。
.Pp
.Sh 戻り値
どちらの関数も、
.Fa rw
によって指定されるタイプのアクセスが許可されている場合には、
ブール値 true を返します。
そうでない場合には、ブール値 false が返されます。
.Pp
.Sh バグ
.Fn useracc
への引数として、プロセスへのポインタが渡されるべきです。
