freebsd/freebsd-doc/ja_JP.eucJP/man/man9/MD5.9
.\"	$OpenBSD: md5.9,v 1.1 1996/04/17 21:40:14 mickey Exp $
.\"
.\" Copyright (c) 1996	Michael Shalayeff
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Michael Shalayeff
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/MD5.9,v 1.10 2004/07/03 18:29:23 ru Exp %
.\"
.\" $FreeBSD$
.Dd April 17, 1996
.Dt MD5 9
.Os
.Sh 名称
.Nm MD5 ,
.Nm MD5Init ,
.Nm MD5Transform
.Nd メッセージダイジェストルーチン
.Sh 書式
.In sys/types.h
.In sys/md5.h
.Ft void
.Fn MD5Init "MD5_CTX *buf"
.Ft void
.Fn MD5Transform "u_int32_t buf[4]" "const unsigned char block[64]"
.Sh 解説
.Nm
モジュールは、RSA Data Security, Inc.\& の MD5 メッセージダイジェスト
アルゴリズム(MD5)を実装しています。
これはデータの 128 ビットの MD5 ダイジェストを生成します。
.Pp
.Bl -hang -width MD5Transformxx
.It Pa MD5Init
ダイジェストを生成するために
.Fn MD5Transform
を使用する直前に呼び出さなくてはなりません。
引数
.Fa buf
は次に続いて呼ばれる
.Fn MD5Transform
ルーチンが生成するダイジェストの格納領域です。
.It Pa MD5Transform
MD5 アルゴリズムの中核で、
引数
.Fa block
で渡される 64 文字の新しいデータの追加を反映するように、
.Fa buf
に格納してある MD5 ハッシュを変更します。
.El
.Sh 著作権
MD5 変換のコードはパブリックドメインに置かれていた Colin Plumb の
実装から得ています。
MD5 暗号化チェックサムは Ronald Rivest が考案し、
RFC 1321 "The MD5 Message Digest Algorithm" に記述されています。
