freebsd/freebsd-doc/ja_JP.eucJP/man/man9/microtime.9
.\" Copyright (c) 2000 Kelly Yancey
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"    %FreeBSD: src/share/man/man9/microtime.9,v 1.2.2.2 2001/08/17 13:08:54 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/microtime.9,v 1.2 2001/05/14 01:10:24 horikawa Exp $
.Dd January 3, 2000
.Dt MICROTIME 9
.Os
.Sh 名称
.Nm microtime ,
.Nm getmicrotime ,
.Nm nanotime ,
.Nm getnanotime
.Nd 現在時刻の取得
.Sh 書式
.Fd #include <sys/time.h>
.Ft void
.Fn microtime "struct timeval *tv"
.Ft void
.Fn getmicrotime "struct timeval *tv"
.Ft void
.Fn nanotime "struct timespec *ts"
.Ft void
.Fn getnanotime "struct timespec *tsp"
.Sh 解説
.Fn microtime
および
.Fn getmicrotime
関数は、
.Fa tv
によって指定されたアドレスに、
.Ft timeval
構造体として、システム時刻を保存します。
.Fn nanotime
および
.Fn getnanotime
関数は、同じ作用を実行しますが、代りに
.Ft timespec
構造体として時刻を記録します。
.Pp
.Fn microtime
および
.Fn nanotime
は、可能な限り正確な現在時刻を返す時刻カウンタを、常に請求します。
それに反して、
.Fn getmicrotime
および
.Fn getnanotime
関数は、正確ではないが高速に得られる時刻を代りに返し得る抽象化です。
この振舞いは、kern.timecounter.method sysctl 変数により、
切り替えることができます。
.Bl -tag -width ABC
.It Dv 0
高速なコード実行を選択して、正確さを犠牲にします。
.It Dv 1
(
.Fn microtime
または
.Fn nanotime
の呼び出しと同等の) より正確な時刻を返します。
.El
.Pp
.Fn getmicrotime
および
.Fn getnanotime
関数の意図は、タイマの正確さ対実行時間のユーザの好みを強化することです。
.Sh 関連項目
.Xr getmicrouptime 9 ,
.Xr getnanouptime 9 ,
.Xr microuptime 9 ,
.Xr nanouptime 9 ,
.Xr tvtohz 9
.Sh 診断
バグのあるハードウェアは kern.timecounter.method が 0 に設定されている時に、
"calcru negative..." を起こすことがあります。
.Sh 歴史
.Nm
および
.Nm nanotime
関数は
.Fx 3.0
で初めて登場しましたが、別の形で
.Bx 4.4
から存在していました。
.Sh 作者
このマニュアルページは
.An Kelly Yancey Aq kbyanc@posi.net
が書きました。
