freebsd/freebsd-doc/ja_JP.eucJP/man/man9/MODULE_DEPEND.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2001 Alexander Langer
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/MODULE_DEPEND.9,v 1.1.2.3 2001/12/17 11:30:18 ru Exp %
.\"
.\" $FreeBSD$
.Dd March 11, 2001
.Dt MODULE_DEPEND 9
.Os
.Sh 名称
.Nm MODULE_DEPEND
.Nd カーネルモジュール依存性の設定
.Sh 書式
.In sys/module.h
.Fn MODULE_DEPEND "name" "moddepend" "int minversion" "int prefversion" "int maxversion"
.Sh 解説
.Fn MODULE_DEPEND
マクロは、
.Fn MODULE_VERSION
でそのバージョンを既に登録している
.Fa moddepend
という名前の別のカーネルモジュールとの依存性を設定します。
どのモジュールが依存できるのか、3 つのバージョンが明示されなければなりません。
それはこのモジュールが依存することができる、望ましいバージョンはもちろん、
最小と最大のバージョンです。
.Sh 使用例
.Bd -literal
MODULE_DEPEND(foo, bar, 1, 3, 4);
.Ed
.Sh 関連項目
.Xr DECLARE_MODULE 9 ,
.Xr module 9 ,
.Xr MODULE_VERSION 9
.Sh 作者
このマニュアルページは
.An -nosplit
.An Alexander Langer Aq alex@FreeBSD.org
が書きました。
