freebsd/freebsd-doc/ja_JP.eucJP/man/man9/panic.9
.\"     $NetBSD: panic.9,v 1.2 1996/10/09 17:20:04 explorer Exp $
.\"
.\" Copyright (c) 1996 Michael Graff.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Michael Graff
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/panic.9,v 1.4 1999/12/23 17:42:10 bde Exp $
.\"
.Dd August 11, 1995
.Dt PANIC 9
.Os
.Sh 名称
.Nm panic
.Nd 致命的なエラーによるシステムダウン
.Sh 書式
.Fd #include <sys/param.h>
.Ft void
.Fn panic "const char *fmt, ..."
.Sh 解説
.Fn panic
関数は動作中のシステムを終了させます。
.Fa fmt
メッセージは
.Xr printf 3
スタイルのフォーマット文字列です。
このメッセージはコンソールに出力され、
後でオペレーティングシステムのコアダンプから取り出すために
.Fa panicstr 
がこのメッセージのアドレスに設定されます。
.Pp
もしカーネルデバッガが搭載されていれば、デバッガに制御を渡します。
さもなければ、オペレーティングシステムのコアダンプを
設定されているダンプデバイスに保存するように試みます。
.Pp
もし
.Fn panic
が 2 度呼ばれた場合(たとえばディスク同期ルーチンから)には、
ディスクの同期無しでシステムはリブートされます。
.Sh 戻り値
.Fn panic
関数は戻りません。
