freebsd/freebsd-doc/ja_JP.eucJP/man/man9/posix4.9
.\" Copyright (c) 1998 HD Associates, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/posix4.9,v 1.5.2.5 2001/08/17 13:08:54 ru Exp %
.\" $FreeBSD$
.Dd March 1, 1998
.Dt POSIX.1B 9
.Os
.Sh 名称
.Nm posix1b
.Nd POSIX P1003-1B 拡張
.Sh 解説
POSIX.1B はリアルタイム拡張および POSIX.1 に対する幾つかの
共通な Berkeley 拡張を追加します。
このセクションは、矛盾を避けることおよびインタフェースのバージョンを
明示するために要求された能力のためのサポートを追加することについての、
予備的な情報を含んでいます。
.Sh ステータス
1998 年 3 月 28 日: _POSIX_PRIORITY_SCHEDULING は、次のカーネルオプションを
コンフィギュレーションに付けることで動作します。
.Bd -literal -offset 0i
options		"P1003_1B"
options		"_KPOSIX_PRIORITY_SCHEDULING"
.Ed
.Sh バージョンの明示
POSIX.1B のバージョンおよびプログラミングインタフェースを
設定する、3 つの目録定数があります。
.Bd -literal -offset 0i
_POSIX_VERSION
.Ed
はそのシステムがどのシステムのためにビルドされたかを明示します。
デフォルトは POSIX.1 および 199009L です。
POSIX.1B は 199309L です。
これはオペレーティングシステムの基本の特徴を定義します。
.Bd -literal -offset 0i
_POSIX_SOURCE
.Ed
は、名前空間において POSIX および ANSI の機能のみ発生することを明示するために
定義することが可能な、POSIX.1 からのマクロです。
.Bd -literal -offset 0i
_POSIX_C_SOURCE
.Ed
は、名前空間において明示された POSIX バージョン以降の POSIX および ANSI の
機能のみ発生することを明示するために定義することが可能な、POSIX.1B からの
マクロです。
例えば、_POSIX_VERSION が 199309L (POSIX.1B) だが _POSIX_C_SOURCE が
199009L (POSIX.1) である場合には、POSIX.1 の機能のみが出現するべきです。
.Sh 適切な拡張の隠蔽
以下のテストマクロが <sys/_posix.h> でセットアップされます。
これらをシステムヘッダファイルで使用することで、
<sys/_posix.h> でみられる種類のテストを避けられます。
ソースプログラムはこれらの
.Fx
特有の実装の詳細を使用するべきではありません。
_POSIX_VERSION, _POSIX_SOURCE
および _POSIX_C_SOURCE をテストするべきです。
しかしながら、これらのマクロはカーネルの中では使用されるべきではありません。
なぜなら、
カーネルはユーザ領域の _POSIX_VERSION の設定の影響を
受けるべきではないからです。
P1003_1B オプションをカーネル内で使用することで、
新しいコードを含めることを制限できます。
でも、P1003_1B オプションのないカーネル上で
POSIX.1B プログラムが実行されたときに物事が正確に働くことを、確認してください。
.Bd -literal -offset 0i
_P1003_1B_VISIBLE
.Ed
は拡張が可視であるべきときに解決するテストマクロです。
これは <sys/_posix.h> で定義されています。
.Pp
通常の C プログラム開発では、_POSIX_VERSION のみが設定され、プログラムに
.Bx
拡張が可視であるようにします。
しかしながら、POSIX.1B が必須とする新機能を追加するときには、
新しい _POSIX_C_SOURCE マクロによって追加された要求を満足させることが重要です。
_POSIX_VERSION, _POSIX_SOURCE, および _POSIX_C_SOURCE の組み合わせが
その拡張がスコープ内であることを示しているときには、_P1003_1B_VISIBLE
(標準機能テストマクロではない) は sys/unistd.h で定義されます。
.Bd -literal -offset 0i
_P1003_1B_VISIBLE_HISTORICALLY
.Ed
は歴史的にシステム内にある POSIX.1B 拡張を条件付けするために存在します。
_POSIX_SOURCE および _POSIX_C_SOURCE が全く設定されていないとき、または
_POSIX_C_SOURCE が POSIX.1B の機能を有効にしているとき、これらは可視です。
この機能テストの意図は、
.Bx
拡張を可視としつつ新しい拡張を不可視とすることで、
_POSIX_C_SOURCE の "big hammar" ("大金鎚") の
使用を試みることなく、現存のプログラムを壊さないようにすることです。
.Pp
幾つかの最近のヘッダファイルへの追加は十分新しいので、
_HISTORICALLY の代わりに
_P1003_1B_VISIBLE に依存するように変更するべきでしょう。
.Pp
現在では POSIX.1B で明示されている伝統的な
.Bx
ヘッダファイル (例えば、mmap.h) は、<sys/_posix.h> をインクルードすること
および _P1003_1B_VISIBLE_HISTORICALLY で条件付けすることが可能です。
.Sh 非標準テストマクロ
.Bd -literal -offset 0i
_P1003_1B_INCLUDE_MAYBES
.Ed
が他の全てのヘッダファイルのインクルードの前に設定されたときには、
標準ヘッダがインクルードして良いと POSIX.1B 仕様が定めた
全てのヘッダファイルがインクルードされるよう、要求します。
通常は、不要なヘッダはインクルードされないのです。
このプリプロセッサ定義を設定することにより、仕様に従ったプログラムを、
ヘッダファイルのインクルードの問題無しにコンパイルできるようにします。
.Bd -literal -offset 0i
P1003_1B
.Ed
はカーネル内に POSIX.1B サポートを付けてビルドするための
コンフィグオプションです。
.\" .Sh 関連項目
.Sh 歴史
.Nm
セクションのマニュアルページは
.Fx 3.0
で登場しました。
