freebsd/freebsd-doc/ja_JP.eucJP/man/man9/resettodr.9
.\"	%NetBSD: resettodr.9,v 1.1 1995/11/25 21:24:51 perry Exp %
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/resettodr.9,v 1.7 2003/10/23 02:33:03 hmp Exp %
.\" $FreeBSD$
.\"
.Dd November 13, 1995
.Dt RESETTODR 9
.Os
.Sh 名称
.Nm resettodr
.Nd バッテリーバックアップの時計をシステムの時間に合わせる
.Sh 書式
.In sys/types.h
.In sys/systm.h
.Ft void
.Fn resettodr "void"
.Sh 解説
.Fn resettodr
関数はシステムのバッテリーバックアップの時計をシステムが保有している
.Va time
変数の時間に合わせます。
.Sh 関連項目
.Xr inittodr 9 ,
.Xr time 9
.Sh バグ
多くのシステムで
.Fn resettodr
は内部表現の
.Va time
から年、月、日、時、分、秒で表現される時刻に変換しなければなりません。
多くのインプリメンテーションではコードの共有が可能ですが、共有していません。
