freebsd/freebsd-doc/ja_JP.eucJP/man/man9/sbuf.9
.\"-
.\" Copyright (c) 2000 Poul Henning Kamp and Dag-Erling Co骾an Sm鷨grav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/sbuf.9,v 1.12.2.3 2001/12/17 11:30:18 ru Exp %
.\" $FreeBSD$
.\"
.Dd January 28, 2001
.Dt SBUF 9
.Os
.Sh 抩憊
.Nm sbuf_new ,
.Nm sbuf_clear ,
.Nm sbuf_setpos ,
.Nm sbuf_bcat ,
.Nm sbuf_bcopyin ,
.Nm sbuf_bcpy ,
.Nm sbuf_cat ,
.Nm sbuf_copyin ,
.Nm sbuf_cpy ,
.Nm sbuf_printf ,
.Nm sbuf_putc ,
.Nm sbuf_overflowed ,
.Nm sbuf_finish ,
.Nm sbuf_data ,
.Nm sbuf_len ,
.Nm sbuf_delete
.Nd 兜蟈卅妐儂昫白巧□穴永玄
.Sh 踏摯
.In sys/types.h
.In sys/sbuf.h
.Ft struct sbuf *
.Fn sbuf_new "struct sbuf *s" "char *buf" "int length" "int flags"
.Ft void
.Fn sbuf_clear "struct sbuf *s"
.Ft int
.Fn sbuf_setpos "struct sbuf *s" "int pos"
.Ft int
.Fn sbuf_bcat "struct sbuf *s" "const char *str" "size_t len"
.Ft int
.Fn sbuf_bcopyin "struct sbuf *s" "const void *uaddr" "size_t len"
.Ft int
.Fn sbuf_bcpy "struct sbuf *s" "const char *str" "size_t len"
.Ft int
.Fn sbuf_cat "struct sbuf *s" "const char *str"
.Ft int
.Fn sbuf_copyin "struct sbuf *s" "const void *uaddr" "size_t len"
.Ft int
.Fn sbuf_cpy "struct sbuf *s" "const char *str"
.Ft int
.Fn sbuf_printf "struct sbuf *s" "const char *fmt" "..."
.Ft int
.Fn sbuf_putc "struct sbuf *s" "int c"
.Ft int
.Fn sbuf_overflowed "struct sbuf *s"
.Ft void
.Fn sbuf_finish "struct sbuf *s"
.Ft char *
.Fn sbuf_data "struct sbuf *s"
.Ft int
.Fn sbuf_len "struct sbuf *s"
.Ft void
.Fn sbuf_delete "struct sbuf *s"
.Sh 荸濩
.Nm sbuf
白央立伉及楮醒反﹜市□生伙塢棉ま及雁釵及丐月甘伙蔽羹妐儂昫及﹜
兜蟈卅喃曰癲化﹜厭蹲﹜云方太荸旵毛第Х卞仄引允﹝
仇木日及楮醒反﹜妐儂及т昫及醫歹曰卞﹜
.Aq Pa sys/sbuf.h
匹爛聒今木月
.Fa sbuf
午裟壬木月厭瞻蟲毛醜綜仄引允﹝
.Pp
.Fn sbuf_new
楮醒反瘉賡及婁醒匹隙今木月
.Fa sbuf
毛賡渝祭仄引允﹝
公及禾奶件正互
.Dv NULL
及樺寧卞反﹜
.Fn sbuf_new
反
.Vt struct sbuf
厭瞻蟲毛
.Xr malloc 9
毛銀迕仄化喃曰癲化引允﹝
.Fa buf
婁醒反撢端卞妐儂昫互傘Ф今木月田永白央尺及禾奶件正匹﹜
.Dv NULL
及樺寧卞反﹜
.Fn sbuf_new
反
.Xr malloc 9
毛銀迕仄化田永白央毛喃曰癲化引允﹝
.Fa length
反傘Ф田永白央及芺爛今木凶釐五今匹允﹝
4 �筇雂帡�醒
.Fa flags
反蜇箕銀迕今木化云日內﹜橘卞 0 卞澀爛今木月屯五匹允﹝
.Pp
.Fa buf
互
.Dv NULL
匹卅中樺寧卞反﹜劑卅仁午手
.Fa length
妐儂動曉及т昫毛隙今卅仃木壬卅日卅中仇午卞鏜啦仄化仁分今中﹝
.Pp
.Fn sbuf_clear
楮醒反
.Fa sbuf
及ま芢毛拑躲卞仄﹜匏譆毛 0 卞伉本永玄仄引允﹝
.Pp
.Fn sbuf_setpos
楮醒反
.Fa sbuf
及蜇箕匏譆毛 0 午傘Ф田永白央及釐五今方曰手 1 凝今中襖及棉及襖匹丐月
.Fa pos
卞澀爛仄引允﹝
.Pp
.Fn sbuf_bcat
楮醒反田奶玄昫
.Fa str
及瘉賡及
.Fa len
田奶玄毛
.Fa sbuf
卞馨笛仄引允﹝
.Pp
.Fn sbuf_bcopyin
楮醒反抸憎今木凶交□扒塢棉失玉伊旦井日
.Fa sbuf
卞
.Fa len
田奶玄毛戊疋□仄引允﹝
.Pp
.Fn sbuf_bcpy
楮醒反
.Fa sbuf
及ま芢毛田奶玄昫
.Fa str
及瘉賡及
.Fa len
田奶玄匹譆五晶尹引允﹝
.Pp
.Fn sbuf_cat
楮醒反 NUL 妐儂匹蔽羹今木凶妐儂昫
.Fa str
毛
.Fa sbuf
及蜇箕匏譆卞馨笛仄引允﹝
.Pp
.Fn sbuf_copyin
楮醒反 NUL 妐儂匹蔽羹今木凶妐儂昫毛抸憎今木凶交□扒塢棉失玉伊旦井日
.Fa sbuf
卞戊疋□仄引允﹝
.Fa len
婁醒互 0 匹卅中樺寧卞反
.Fa len
妐儂毛旋尹卅中妐儂 (蔽羹及 NUL 反醒尹引六氏) 互戊疋□今木﹜
公丹匹卅中樺寧卞反妐儂昫蟈蟲﹜引凶反
.Fa sbuf
卞腴戶慇戈仇午互請侳月分仃及妐儂毛戊疋□仄引允﹝
.Pp
.Fn sbuf_cpy
楮醒反
.Fa sbuf
及ま芢毛 NUL 妐儂匹蔽羹今木凶妐儂昫
.Fa str
匹譆五晶尹引允﹝
仇木反蕙仄中
.Fa sbuf
匹﹜引凶反
.Fn sbuf_clear
井
.Fn sbuf_setpos
匹公及匏譆毛 0 卞伉本永玄今木化中月
.Fa sbuf
匹﹜
.Fn sbuf_cat
毛裟太請允仇午午羈笠匹允﹝
.Pp
.Fn sbuf_printf
楮醒反
.Fa fmt
卞方勻化隙今木化中月白巧□穴永玄妐儂昫卞蝨勻化公及婁醒毛白巧□穴永玄仄﹜
公及瑛絆及妐儂昫毛
.Fa sbuf
及蜇箕匏譆卞馨笛仄引允﹝
.Pp
.Fn sbuf_putc
楮醒反妐儂
.Fa c
毛
.Fa sbuf
及蜇箕匏譆卞馨笛仄引允﹝
.Pp
.Fn sbuf_overflowed
楮醒反
.Fa sbuf
互左□田白伕□仄化中月樺寧卞 0 動陸及襖毛忒仄引允﹝
.Pp
.Fn sbuf_finish
楮醒反
.Fa sbuf
毛甘伙匹蔽羹仄﹜仇木動曉
.Fn sbuf_setpos ,
.Fn sbuf_cat ,
.Fn sbuf_cpy ,
.Fn sbuf_printf
引凶反
.Fn sbuf_putc
毛銀迕仄化膜懇今木月仇午互拑中仇午毛啦怗允月敦弇穴□弁毛尥仃引允﹝
.Pp
.Fn sbuf_data
云方太
.Fn sbuf_len
楮醒反公木冗木蜇箕及妐儂昫午公及贏今毛忒仄引允﹝
.Fn sbuf_data
反敦弇仄凶
.Fa sbuf
卞覆仄化及心窗Х仄引允﹝
.Pp
瘉詨卞﹜
.Fn sbuf_delete
楮醒反
.Fa sbuf
毛弁伉失仄﹜
.Fn sbuf_new
卞方勻化傘Ф田永白央毛喃曰癲化日木化中木壬﹜公木毛荸旵仄引允﹝
.Sh 鏜
丐月醜綜互
.Fa sbuf
毛左□田白伕□今六凶樺寧卞反﹜公及
.Fa sbuf
互
.Fn sbuf_finish
毛銀迕仄化敦弇今六日木月﹜引凶反
.Fn sbuf_clear
毛銀迕仄化伉本永玄今木月﹜引凶反
.Fn sbuf_setpos
毛銀迕仄化公及匏譆毛 0 井日傘Ф田永白央及釐五今方曰 1 凝今中襖引匹及襖卞
伉本永玄今木月﹜引凶反
.Fn sbuf_cpy
毛銀迕仄化蝸坌卞羶中妐儂昫卞賡渝祭今木月引匹及棉反﹜詨卞糧仁幻午氏升及公及
.Fa sbuf
卞覆允月醜綜反撩л允月匹仄斤丹﹝
.Sh 枑曰襖
.Fn sbuf_new
反傘Ф田永白央及喃曰癲化卞撩л仄凶樺寧卞反
.Dv NULL
毛忒仄﹜公丹匹卅中樺寧卞反蕙仄中
.Fa sbuf
尺及禾奶件正毛忒仄引允﹝
.Pp
.Fn sbuf_setpos
反
.Fa pos
互尕懇卅樺寧卞反 \-1 毛忒仄﹜公丹匹卅中樺寧卞反 0 毛忒仄引允﹝
.Pp
.Fn sbuf_cat ,
.Fn sbuf_cpy ,
.Fn sbuf_printf ,
云方太
.Fn sbuf_putc
反蟈化田永白央互左□田白伕□仄凶樺寧卞反 \-1 毛忒仄﹜
公丹匹卅中樺寧卞反 0 毛忒仄引允﹝
.Pp
.Fn sbuf_overflowed
反田永白央互左□田白伕□仄化中月樺寧卞反 0 動陸卞襖毛忒仄﹜
公丹匹卅中樺寧卞反 0 毛忒仄引允﹝
.Pp
.Fn sbuf_data
云方太
.Fn sbuf_len
反田永白央互左□田白伕□仄化中月樺寧卞反﹜公木冗木
.Dv NULL
云方太 \-1 毛忒仄引允﹝
.Sh 楮洘嫩杴
.Xr printf 3 ,
.Xr strcat 3 ,
.Xr strcpy 3 ,
.Xr copyin 9 ,
.Xr copyinstr 9
.Sh 昳銖
.Nm sbuf
白央立伉及楮醒反
.Fx 4.4
匹反元戶化瓚樺仄引仄凶﹝
.Sh 綜樊
.An -nosplit
.Nm sbuf
白央立伉及楮醒反
.An Poul-Henning Kamp Aq phk@FreeBSD.org
互澀煌仄﹜
.An Dag-Erling Co\(:idan Sm\(/orgrav Aq des@FreeBSD.org
互撢隸仄引仄凶﹝
馨笛及荼恌反
.An Justin T. Gibbs Aq gibbs@FreeBSD.org
互羼副仄引仄凶﹝
.Pp
仇及穴瓦亙失伙矢□斥反
.An Dag-Erling Co\(:idan Sm\(/orgrav
互踏五引仄凶﹝
