freebsd/freebsd-doc/ja_JP.eucJP/man/man9/SPLASSERT.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2000 Jonathan M. Bresler
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/SPLASSERT.9,v 1.1.2.3 2001/03/06 19:08:21 ru Exp %
.\" $FreeBSD$
 .\"
.\"
.Dd January 14, 2000
.Os
.Dt SPLASSERT 9
.Sh 名称
.Nm SPLASSERT
.Nd カーネル spl レベル検証マクロ
.Sh 書式
.Cd options INVARIANTS
.Cd options INVARIANT_SUPPORT
.Fn SPLASSERT "char *level" "char *msg"
.Sh 解説
"options INVARIANTS" および "options INVARIANT_SUPPORT" の両方の
オプション付きでコンパイルされたカーネル内では、
.Fn SPLASSERT
マクロはカーネルの現在の spl レベルと
.Fn SPLASSERT
マクロの中で指定された spl レベル
.Fa level
とを比較します。
指定された
.Fa level
がアクティブでない場合には、
.Fn SPLASSERT
は
.Fa msg
を引数として
.Fn KASSERT
マクロを呼び出し、稼働中のシステムを停止させます。
.Pp
"options INVARIANTS" および "options INVARIANT_SUPPORT" の両方の
オプションが無いカーネル内では、
.Fn SPLASSERT
マクロは何もしない様に定義されます。
.Sh 使用例
カーネル関数
.Fn rtalloc
は
.Fn splnet
時に呼び出されなければなりません。
.Bd -literal -offset indent
void
rtalloc(ro)
	register struct route *ro;
{
	SPLASSERT(net, "rtalloc()");
	rtalloc_ign(ro, 0UL);
}
.Pp
.Sh 関連項目
.Xr config 8 ,
.Xr KASSERT 9 ,
.Xr panic 9 
.Sh 作者
このマニュアルページは
.An Jonathan M. Bresler
.Aq jmb@FreeBSD.org
が書きました。
