freebsd/freebsd-doc/ja_JP.eucJP/man/man9/store.9
.\"	%NetBSD: store.9,v 1.2 1996/01/09 21:59:27 perry Exp %
.\"
.\" Copyright (c) 1996 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed by Kenneth Stailey.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason R. Thorpe.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/store.9,v 1.7.2.2 2000/12/12 10:00:57 ru Exp %
.\"
.Dd January 7, 1996
.Dt STORE 9
.Os FreeBSD
.Sh 名称
.Nm store ,
.Nm subyte ,
.Nm susword ,
.Nm suswintr ,
.Nm suword
.Nd ユーザー空間へのデータの格納
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <sys/time.h>
.Fd #include <sys/systm.h>
.Fd #include <sys/resourcevar.h>
.Ft int
.Fn subyte "void *base" "int byte"
.Ft int
.Fn susword "void *base" "int word"
.Ft int
.Fn suswintr "void *base" "int word"
.Ft int
.Fn suword "void *base" "int word"
.Sh 解説
.Nm
関数群はユーザー空間へ小さなデータをコピーするようにデザインされています。
.Pp
.Nm
ルーチンは以下の機能を提供します。
.Bl -tag -width "suswintr()"
.It Fn subyte
1 バイトのデータをユーザー空間のアドレス
.Pa base
へ格納します。
.It Fn susword
1 ショートワードのデータをユーザー空間のアドレス
.Pa base
へ格納します。
.It Fn suswintr
1 ショートワードのデータをユーザー空間のアドレス
.Pa base
へ格納します。
この関数は割り込みコンテキスト中でも安全に呼び出せます。
.It Fn suword
1 ワードのデータをユーザー空間のアドレス
.Pa base
へ格納します。
.El
.Sh 戻り値
.Nm
関数は 0 を返しますが、失敗した場合は -1 を返します。
.Sh 関連項目
.Xr copy 9 ,
.Xr fetch 9
