freebsd/freebsd-doc/ja_JP.eucJP/man/man9/SYSCALL_MODULE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2001 Alexander Langer
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/SYSCALL_MODULE.9,v 1.5 2003/09/08 19:57:21 ru Exp %
.\"
.\" $FreeBSD$
.Dd April 27, 2001
.Dt SYSCALL_MODULE 9
.Os
.Sh 名称
.Nm SYSCALL_MODULE
.Nd syscall カーネルモジュール宣言マクロ
.Sh 書式
.In sys/param.h
.In sys/kernel.h
.In sys/proc.h
.In sys/module.h
.In sys/sysent.h
.Fn SYSCALL_MODULE name "int *offset" "struct sysent new_sysent" "modeventhand_t evh" "void *arg"
.Sh 解説
.Fn SYSCALL_MODULE
マクロは新しい syscall を宣言します。
.Fn SYSCALL_MODULE
は
.Fa name
という名前のカーネルモジュールの宣言に展開されます。
.Pp
.Fa offset
は
.Vt int
型へのポインタであり、
そこにはその syscall が割り当てられた
.Vt "struct sysent"
構造体の中のオフセット位置が保存されます。
.Pp
.Fa new_sysent
は syscall を実装する関数およびこの関数が必要とする引数の個数
.In ( sys/sysent.h
参照) を明示します。
.Pp
.Fa evh
は、カーネルモジュールのイベントハンドラ関数へのポインタであり、
この関数は引数
.Fa arg
を取ります。
詳細については
.Xr module 9
を参照してください。
.Sh 使用例
syscall モジュールのための最低限の例が、
.Pa /usr/share/examples/kld/syscall/module/syscall.c
の中に見つけられます。
.Sh 関連項目
.Xr module 9
.Pp
.Pa /usr/share/examples/kld/syscall/module/syscall.c
.Sh 作者
このマニュアルページは
.An Alexander Langer Aq alex@FreeBSD.org
が書きました。
