freebsd/freebsd-doc/ja_JP.eucJP/man/man9/time.9
.\"	$NetBSD: time.9,v 1.1 1995/11/25 21:24:53 perry Exp $
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/time.9,v 1.10 2003/10/23 02:33:03 hmp Exp %
.\"
.\" $FreeBSD$
.Dd March 22, 1997
.Dt TIME 9
.Os
.Sh 名称
.Nm boottime ,
.Nm mono_time ,
.Nm runtime ,
.Nm time
.Nd システム時刻変数
.Sh 書式
.Bl -item -compact
.It
.Va extern struct timeval boottime ;
.It
.Va extern volatile struct timeval mono_time ;
.It
.Va extern struct timeval runtime ;
.It
.Va extern struct timeval time ;
.El
.Sh 解説
.Va time
変数はシステムの
.Dq 柱時刻
クロックです。
これはブート時に
.Xr inittodr 9
によって設定され、
.Xr settimeofday 2
システムコールと周期的なクロック割り込みによって更新されます。
.Pp
.Va boottime
変数はシステムのブート時刻を保持します。
これはシステムブート時に
.Va time
から設定され、システム時刻が
.Xr settimeofday 2
を使用して調整されたときに更新されます。
.Pp
.Va runtime
変数はシステムが現在のプロセスにスイッチした時刻を保持します。
これは個々のコンテキストスイッチの後に設定され、システム時刻が
.Xr settimeofday 2
を使用して調整されたときに更新されます。
.Va runtime
はシステムのアカウンティングのために使用されているので、
.Va time
からコピーされるのではなく、高分解能な
.Xr microtime 9
関数を使用して設定されます。
.Pp
.Va mono_time
変数は単調に増加するシステムクロックです。
これはブート時に
.Va time
から設定され、周期的なタイマ割り込みによって更新されます。
.Xr ( settimeofday 2
によって更新されません。)
.Pp
これらの変数の全ては、1970 年 1 月 1 日の深夜 (0 時) から経過した時間を、
秒およびマイクロ秒で表現しています。
.Pp
.Va time
または
.Va mono_time
の読込みまたは書込み時には、クロック割り込みはブロックされるべきです。
何故ならば、これらの変数は
.Fn hardclock
によって更新されるからです。
.Xr gettime 9
関数は不可分な方法で
.Va time
変数を読み取るために使用することができます。
.Va mono_time
にアクセスするための同等の関数はありません。
.Va boottime
および
.Va runtime
変数は特別な警戒なしに読み書きすることができます。
.Pp
.Xr gettime 9
および
.Xr microtime 9
によって返される時刻値は更新方法が違いますので、この 2 つの
ルーチンの結果を比較すると、
時間が逆戻りするような結果となるかもしれないことに注意してください。
この問題は、一方の関数またはもう一方の関数を
コンテキスト中で首尾一貫して使用することにより、避けることができます。
.Sh 関連項目
.Xr settimeofday 2 ,
.Xr gettime 9 ,
.\" .Xr hardclock 9 ,
.\" .Xr hz 9 ,
.Xr inittodr 9 ,
.Xr microtime 9
.Sh バグ
マルチプロセッサシステムにおいて単一の
.Va runtime
変数を持つという考えは明らかに適切ではありません。
