freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VFS_VGET.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_VGET.9,v 1.14.4.1 2005/01/10 23:51:38 keramida Exp %
.\"
.\" $FreeBSD$
.Dd January 7, 2004
.Os
.Dt VFS_VGET 9
.Sh 名称
.Nm VFS_VGET
.Nd inode 番号から vnode への変換
.Sh 書式
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_VGET "struct mount *mp" "ino_t ino" "int flags" "struct vnode **vpp"
.Sh 解説
.Fn VFS_VGET
マクロは inode 番号を、ロックされた vnode へ変換します。
.Pp
引数は以下の通りです。
.Bl -tag -width ".Fa flags"
.It Fa mp
ファイルシステム。
.It Fa ino
そのファイルを表現する inode。
.It Fa flags
パススルーのための追加のロックフラグ。
.It Fa vpp
vnode の戻り値。
.El
.Pp
これは、ファイルシステム中の各ファイルに対して
一意の識別番号を持つファイルシステムのための、
オプションのファイルシステムエントリポイントです。
UFS ファイルシステムはこれを内部的に使用していますし、
また NFSv3 サーバは
.Dv READDIRPLUS
NFS 呼び出しを実装するために使用しています。
.Pp
ファイルシステムがこの呼び出しをサポートしていない場合には、
.Er EOPNOTSUPP
を返すべきです。
.Sh 関連項目
.Xr VFS 9 ,
.Xr vget 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
によって書かれました。
