freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VFS_SYNC.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_SYNC.9,v 1.10 2002/12/12 17:25:58 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VFS_SYNC 9
.Sh 名称
.Nm VFS_SYNC
.Nd 未書き込みデータの吐き出し
.Sh 書式
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_SYNC "struct mount *mp" "int waitfor" "struct ucred *cred" "struct thread *td"
.Sh 解説
これはファイルシステムの全ての未書き込みのデータを書き出します。
.Pp
引数は以下の通りです。
.Bl -tag -width waitfor
.It Ar mp
ファイルシステム。
.It Ar waitfor
関数が入出力の完了まで待つべきかどうか。
指定可能な値は以下のとおりです。
.Bl -tag -width MNT_NOWAIT
.It Dv MNT_WAIT
入出力の完了を同期的に待ちます。
.It Dv MNT_NOWAIT
全ての入出力を開始しますが、それを待ちません。
.It Dv MNT_LAZY
ファイルシステムの syncer によって書込まれていないデータを出力します。
.El
.It Ar cred
呼び出し元の証明。
.It Ar td
呼び出しているスレッド。
.El
.Pp
これは、通常、ファイルシステム中の全ての vnode のために
.Xr VOP_FSYNC 9
を呼び出します。
.Sh 関連項目
.Xr fsync 2 ,
.Xr sync 2 ,
.Xr VFS 9 ,
.Xr vnode 9 ,
.Xr VOP_FSYNC 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
