freebsd/freebsd-doc/ja_JP.eucJP/man/man9/vfs_unmountall.9
.\" Copyright (c) 2001 Chris Costello <chris@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" 	%FreeBSD: src/share/man/man9/vfs_unmountall.9,v 1.6 2002/12/12 17:25:58 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 26, 2001
.Dt VFS_UNMOUNTALL 9
.Os
.Sh 名称
.Nm vfs_unmountall
.Nd 全てのファイルシステムのアンマウント
.Sh 書式
.In sys/param.h
.In sys/mount.h
.Ft void
.Fn vfs_unmountall "void"
.Sh 解説
.Nm
関数は、システムシャットダウン時にのみ実行され、操作の依存性を避けるため、
最新のものから古いものの順で、
マウントした全てのファイルシステムをアンマウントします。
.Sh 関連項目
.Xr boot 9
