freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VFS_FHTOVP.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_FHTOVP.9,v 1.6.2.1 2001/03/06 19:08:21 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/VFS_FHTOVP.9,v 1.3 2001/05/14 04:06:10 horikawa Exp $
.Dd July 24, 1996
.Os
.Dt VFS_FHTOVP 9
.Sh 名称
.Nm VFS_FHTOVP
.Nd NFS ファイルハンドルから vnode への変換
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/mount.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fn VFS_FHTOVP "struct mount *mp" "struct fid *fhp" "struct vnode **vpp"
.Sh 解説
これは NFS ファイルハンドルから vnode へ
変換するために NFS サーバによって使用されます。
.Pp
引数は以下の通りです。
.Bl -tag -width vpp
.It Ar mp
ファイルシステム。
.It Ar fhp
変換されるファイルハンドル。
.It Ar vpp
新しい、ロックされた vnode の戻り値。
.El
.Pp
ファイルハンドルの内容は、ファイルシステムによって定義されていて、
システムの他の部分によって検査されません。
ファイルが削除された時や新しいファイルのためにファイルシステムの資源が
再利用された時の通知と同じ程度に、ファイルシステムの中のファイルを
独自に識別するための十分な情報を含んでいるべきです。
例えば、UFS ファイルシステムは、ファイルハンドルの中に inode 番号
および inode 世代カウンタを格納します。
.Pp
一般的にはこの関数への呼び出し前は、そのファイルがクライアントにとって
アクセス可能であるかどうかを検査するために
.Xr VFS_CHECKEXP 9
呼び出しが行われます。
.Pp
.Sh 戻り値
そのファイルのロックされた vnode が
.Fa *vpp
に返されます。
.Sh 関連項目
.Xr VFS 9 ,
.Xr VFS_VPTOFH 9 ,
.Xr VFS_CHECKEXP 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
