freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VFS_UNMOUNT.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_UNMOUNT.9,v 1.10.4.1 2005/01/10 23:08:56 keramida Exp %
.\"
.\" $FreeBSD$
.Dd January 7, 2005
.Os
.Dt VFS_UNMOUNT 9
.Sh 名称
.Nm VFS_UNMOUNT
.Nd ファイルシステムのアンマウント
.Sh 書式
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_UNMOUNT "struct mount *mp" "int mntflags" "struct thread *td"
.Sh 解説
.Fn VFS_UNMOUNT
マクロは、ファイルシステムをアンマウントします。
.Pp
引数は以下の通りです。
.Bl -tag -width mntflags
.It Fa mp
ファイルシステム。
.It Fa mntflags
アンマウント操作のためのフラグのビットマスクです。
現在
.Fn VFS_UNMOUNT
によってサポートされているフラグは以下の通りです。
.Bl -tag -width ".Dv MNT_FORCE"
.It Dv MNT_FORCE
ファイルシステムがアンマウントされる前に
オープンしているファイルは強制的に閉じられます。
.El
.It Fa td
ファイルシステムをアンマウントしているスレッド。
.El
.Sh 関連項目
.Xr vflush 9 ,
.Xr VFS 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
によって書かれました。
