freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VFS_VPTOFH.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_VPTOFH.9,v 1.7 2001/10/01 16:09:24 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VFS_VPTOFH 9
.Sh 名称
.Nm VFS_VPTOFH
.Nd vnode から NFS ファイルハンドルへの変換
.Sh 書式
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_VPTOFH "struct vnode *vp" "struct fid *fhp"
.Sh 解説
これは NFS サーバが使用し、
一意にファイルを識別する不透明なファイルハンドルを作成します。
このファイルハンドルを使用することにより、
将来 NFS クライアントがそのファイルをアクセス可能となります。
.Pp
引数は以下の通りです。
.Bl -tag -width fhp
.It Ar vp
ファイルハンドルを生成する対象の vnode。
.It Ar fhp
ファイルハンドルの戻り値。
.El
.Sh 関連項目
.Xr VFS 9 ,
.Xr VFS_FHTOVP 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
