freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VFS_MOUNT.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_MOUNT.9,v 1.10 2002/12/12 17:25:58 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VFS_MOUNT 9
.Sh 名称
.Nm VFS_MOUNT
.Nd ファイルシステムのマウント
.Sh 書式
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_MOUNT "struct mount *mp" "char *path" "caddr_t data" "struct nameidata *ndp" "struct thread *td"
.Sh 解説
システムの名前空間にファイルシステムをマウントします。
.Pp
引数は以下の通りです。
.Bl -tag -width data
.It Ar mp
ファイルシステムを表現する構造体。
.It Ar path
そのファイルシステムがマウントされるパス名。
.It Ar data
ファイルシステム固有データ。これはカーネルに
.Xr copyin 9
を使用して読み込まれるべきです。
.It Ar ndp
マウントポイントのパス名での
.Xr namei 9
の呼び出しの結果。
.It Ar td
ファイルシステムをマウントしようとしているスレッド。
.El
.Pp
これは、新しいファイルシステムをマウントする目的と、
既存のファイルシステムの属性変更の目的の、両方の用途で呼び出されます。
.Fa mp->mnt_flag
に
.Dv MNT_UPDATE
フラグが設定されている場合には、ファイルシステムは
.Fa mp->mnt_flag
の値により内部状態を更新するべきです。
例えば、読み取り専用ファイルシステムから読み書き可能への変換に
使用されることが可能です。
また、
.Xr mountd 8
によってファイルシステムの NFS エクスポート情報の更新にも使用されています。
.Pp
.Dv MNT_UPDATE
フラグが設定されていない場合には、
これは新規にマウントされたファイルシステムです。
ファイルシステムのコードは、ファイルシステムの表現に必要な私的データの
割り当てと初期化を行なうべきです (この情報を格納するために
.Fa mp->mnt_data
フィールドを使用可能です)。
.Sh 関連項目
.Xr VFS 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
