freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VFS_STATFS.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_STATFS.9,v 1.10.4.2 2005/01/13 13:45:52 keramida Exp %
.\"
.\" $FreeBSD$
.Dd January 7, 2005
.Os
.Dt VFS_STATFS 9
.Sh 名称
.Nm VFS_STATFS
.Nd ファイルシステムの状態の取得
.Sh 書式
.In sys/param.h
.In sys/mount.h
.In sys/vnode.h
.Ft int
.Fn VFS_STATFS "struct mount *mp" "struct statfs *sbp" "struct thread *td"
.Sh 解説
.Fn VFS_STATFS
マクロは、ファイルシステムについての様々な情報を返します。
この情報には、推奨されている入出力サイズ、空き領域、空き inode 等があります。
.Pp
引数は以下の通りです。
.Bl -tag -width sbp
.It Fa mp
ファイルシステム。
.It Fa sbp
ファイルシステムに関する情報が置かれる、
.In sys/mount.h
で定義される
.Vt statfs
構造体です。
.It Fa td
ファイルシステムに問い合わせているスレッド。
.El
.Pp
ファイルシステムに関連する
.Vt "struct statfs"
フイールドは以下の通りです。
.Bl -tag -width ".Va f_mntfromname"
.It Va f_type
ファイルシステムのタイプ。
.It Va f_flags
エクスポートされたマウントフラグのコピー。
.It Va f_bsize
フラグメントサイズ。
.It Va f_iosize
最適化された転送ブロックサイズ。
.It Va f_blocks
ファイルシステム中のデータブロックの総数。
.It Va f_bfree
ファイルシステム中のフリーブロックの数。
.It Va f_bavail
スーパユーザでないプロセスで利用可能なフリーブロックの数。
.It Va f_files
ファイルシステム中のファイルノードの総数。
.It Va f_ffree
スーパユーザでないプロセスで利用可能なフリーのノードの数。
.It Va f_syncwrites
ファイルシステムがマウントされたときからの同期書き込みの数。
.It Va f_asyncwrites
ファイルシステムがマウントされたときからの非同期書き込みの数。
.It Va f_syncreads
ファイルシステムがマウントされたときからの同期読み込みの数。
.It Va f_asyncreads
ファイルシステムがマウントされたときからの非同期読み込みの数。
.It Va f_namemax
このファイルシステムでの最大のファイル名の長さ。
.It Va f_owner
ファイルシステムをマウントしたユーザのユーザ ID。
.It Va f_fsid
ユニークなファイルシステム ID。
.It Va f_fstypename
ファイルシステムタイプ名。
最大
.Dv MFSNAMELEN
バイトの文字列。
.It Va f_mntfromname
マウントされたファイルシステムのデバイス名。
最大
.Dv MNAMELEN
バイトの文字列。
.It Va f_mntonname
ファイルシステムがマウントされたディレクトリの名前。
最大
.Dv MNAMELEN
バイトの文字列。
.El
.Sh 関連項目
.Xr VFS 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
によって書かれました。
