freebsd/freebsd-doc/ja_JP.eucJP/man/man9/vget.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/vget.9,v 1.8 2002/12/24 13:41:46 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VGET 9
.Sh 名称
.Nm vget
.Nd フリーリストから vnode を取得
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn vget "struct vnode *vp" "int lockflag" "struct thread *td"
.Sh 解説
フリーリストから vnode を取得し、その参照カウントをインクリメントします。
.Bl -tag -width lockflag
.It Ar vp
フリーリストから取り除く vnode。
.It Ar lockflag
0 でない場合は、その vnode はロックもされるでしょう。
.El
.Pp
使用されなくなった時、vnode はフリーリストに保持されます。
これらの vnode は有効なファイルを参照していますが、
いつでも新しいファイルを参照するために再利用され得ます。
vnode は、名前キャッシュ等の
システム中のキャッシュの中にも、しばしば保持されます。
.Pp
フリーリスト上にある vnode が再利用される時、例えば
.Xr VOP_LOOKUP 9
を呼び出した結果名前キャッシュにその vnode が見つかった場合、
参照カウントのインクリメントとフリーリストからの削除のために、
新しい使用者は
.Fn vget
を呼び出すことが必要です。
.Sh 関連項目
.Xr vnode 9 ,
.Xr vput 9 ,
.Xr vref 9 ,
.Xr vrele 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
