freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_READLINK.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_READLINK.9,v 1.7.2.2 2001/12/17 11:30:18 ru Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VOP_READLINK 9
.Sh 名称
.Nm VOP_READLINK
.Nd シンボリックリンクのターゲットの読み込み
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.In sys/uio.h
.Ft int
.Fn VOP_READLINK "struct vnode *vp" "struct uio *uio" "struct ucred *cred"
.Sh 解説
これは、シンボリックリンクのターゲットのパス名を読み込みます。
.Bl -tag -width uio
.It Ar vp
シンボリックリンクの vnode。
.It Ar uio
読み込みまたは書き込みのためのデータの位置。
.It Ar cred
呼び出し側の証明。
.El
.Sh ロック
入る時に、vnode はロックされているべきで、終了時にもロックされ続けます。
.Sh 戻り値
成功時には 0 が返され、そうでない場合にはエラーコードが返されます。
.Sh 疑似コード
.Bd -literal
int
vop_readlink(struct vnode *vp, struct uio *uio, struct ucred *cred)
{
    int error = 0;

    /*
     * シンボリックリンクのターゲットを読み込みます。
     */
    ...;

    return error;
}
.Ed
.Sh エラー
.Bl -tag -width Er
.It Bq Er EIO
シンボリックリンクの内容の読み込みの間に、読み込みエラーが発生しました。
.El
.Sh 関連項目
.Xr uiomove 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
