freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_ACLCHECK.9
.\"-
.\" Copyright (c) 1999 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"       %FreeBSD: src/share/man/man9/VOP_ACLCHECK.9,v 1.1.2.1 2001/03/06 19:08:22 ru Exp %
.\"
.Dd December 23, 1999
.Os
.Dt VOP_ACLCHECK 9
.Sh 名称
.Nm VOP_ACLCHECK
.Nd vnode のアクセス制御リストの調査
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Fd #include <sys/acl.h>
.Ft int
.Fn VOP_ACLCHECK "struct vnode *vp" "acl_type_t type" "struct acl *aclp" "struct ucred *cred" "struct proc *p"
.Sh 解説
この vnode 呼び出しは、特定のファイルまたはディレクトリに対する
特定のアクセス制御リスト (ACL) の妥当性を決定するために、使用可能です。
.Pp
引数は以下の通りです。
.Bl -tag -width type
.It Ar vp
ファイルまたはディレクトリの vnode。
.It Ar type
調査対象の ACL の型。
.It Ar aclp
ACL データの取り出し元の ACL 構造体を指しているポインタ。
.It Ar cred
要求の認証のために使用されるユーザ証明。
.It Ar p
ACL を調査しているプロセス。
.El
.Pp
.Fa cred
ポインタは、NULL を渡すことができ、
可能であるならばアクセス制御チェックが実行されないことを指示します。
この cred の設定は、アクティブプロセスに許されていない ACL 証明を、
カーネルが正当化することを認めるために使用可能です。
.Pp
vnode ACL インタフェースは、ファイルまたはディレクトリの ACL インタフェースの
セマンティクスではなく文法を定義します。
カーネル内の ACL 管理についての詳細な情報は
.Xr acl 9
を参照してください。
.Sh ロック
この vnode メソッドの呼び出しのためにロックは不要で、
入る時に保持していた全てのロックは戻る時まで保持されます。
.Sh 戻り値
.Fa vp
オブジェクトのための
.Fa type
型の有効な ACL を
.Fa aclp
ポインタが指している場合には 0 が返されます。
そうでない場合には適切なエラーコードが返されます。
.Sh エラー
.Bl -tag -width Er
.It Bq Er EINVAL
渡された vnode の ACL 型が無効または ACL データが無効です。
.It Bq Er EACCES
許可されませんでした。
.It Bq Er ENOMEM
要求を実行するためのメモリが十分ではありません。
.It Bq Er EOPNOTSUPP
ファイルシステムが VOP_ACLCHECK をサポートしていません。
.El
.Sh 関連項目
.Xr acl 9 ,
.Xr vnode 9 ,
.Xr VOP_GETACL 9 ,
.Xr VOP_SETACL 9
.Sh 作者
このマニュアルページは
.An Robert Watson
が書きました。
