freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_OPENCLOSE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_OPENCLOSE.9,v 1.15 2004/05/11 14:13:52 hmp Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VOP_OPEN 9
.Sh 名称
.Nm VOP_OPEN ,
.Nm VOP_CLOSE
.Nd ファイルのオープンまたはクローズ
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn VOP_OPEN "struct vnode *vp" "int mode" "struct ucred *cred" "struct thread *td" "int fdidx"
.Ft int
.Fn VOP_CLOSE "struct vnode *vp" "int mode" "struct ucred *cred" "struct thread *td"
.Sh 解説
.Fn VOP_OPEN
エントリポイントは、
ファイルがプロセスによってアクセスされる前に呼び出され、
.Fn VOP_CLOSE
エントリポイントは、
ファイルに対するプロセスの仕事の完了後に呼び出されます。
.Pp
引数は以下の通りです。
.Bl -tag -width mode
.It Fa vp
ファイルの vnode。
.It Fa mode
呼び出しプロセスによって要求されたアクセスモード。
.It Fa td
ファイルにアクセスしているスレッド。
.El
.Pp
加えて、
.Fn VOP_OPEN
は
.Fa fdidx
の中のファイル記述子番号を受け入れることが可能です。
これは例えば
.Xr fdesc 5
のような情報を要求するファイルシステムで有用です。
.Pp
アクセスモードは、
.Dv FREAD ,
.Dv FWRITE ,
.Dv O_NONBLOCK ,
.Dv O_APPEND
を含むフラグの組です。
.Sh ロック
.Fn VOP_OPEN
は、入る時に
.Fa vp
がロックされていることを期待し、戻り時までロックされたままにします。
.Pp
.Fn VOP_CLOSE
は、vnode に結びつけられた参照が少なくとも 1 個は存在することを期待し、
vnode がロックされているかどうかは気にしません。
ロックおよび参照状態は、戻る時に変更されずにそのままになります。
.Fa vn_close
は、ロックされていない参照された vnode を期待し、
戻る前に参照を手繰ることに注意してください。
.Sh 実装に関する注
.Fn VOP_OPEN
への
.Fa fdidx
引数は現在使用されておらず、当面は
.Ql \-1
を使用します。
しかしながら、これは将来変更されます。
.Sh 戻り値
成功時には 0 が返され、そうでない場合にはエラーコードが返されます。
.Sh 疑似コード
.Bd -literal
int
vop_open(struct vnode *vp, int mode, struct ucred *cred, struct thread *td)
{
    /*
     * ほとんどのファイルシステムは、ここでは大したことはしません。
     */
    return 0;
}
.Ed
.Sh 関連項目
.Xr vnode 9 ,
.Xr VOP_LOOKUP 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
