freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_REMOVE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_REMOVE.9,v 1.11 2002/09/18 22:12:43 truckman Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VOP_REMOVE 9
.Sh 名称
.Nm VOP_REMOVE ,
.Nm VOP_RMDIR
.Nd ファイルまたはディレクトリの削除
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn VOP_REMOVE "struct vnode *dvp" "struct vnode *vp" "struct componentname *cnp"
.Ft int
.Fn VOP_RMDIR "struct vnode *dvp" "struct vnode *vp" "struct componentname *cnp"
.Sh 解説
これらのエントリポイントは、それぞれファイルとディレクトリを削除します。
.Pp
引数は以下の通りです。
.Bl -tag -width dvp
.It Ar dvp
ディレクトリの vnode。
.It Ar vp
削除対象ファイルの vnode。
.It Ar cnp
ファイルのパス名情報。
.El
.Sh ロック
.Fa dvp
および
.Fa vp
共に、入る時にロックされているべきで、戻り時もロックされ続けています。
.Sh 戻り値
成功時には 0 が返され、そうでない場合にはエラーコードが返されます。
.Sh 疑似コード
.Bd -literal
int
vop_remove(struct vnode *dvp, struct vnode *vp, struct componentname *cnp)
{
    int error = 0;

    if (vp is immutable) {
	error = EPERM;
	goto out;
    }

    /*
     * ディレクトリから cnp->cn_nameptr の名前を削除し、vp のリンク
     * カウントを更新します。
     */
    ...;

    /*
     * "." の削除を試みる場合は注意してください。XXX これはより
     * 上層で取り扱われるべきです。
     */
    if (dvp == vp)
	vrele(vp);
    else
	vput(vp);
    vput(dvp);

    return error;
}
.Ed
.Sh エラー
.Bl -tag -width Er
.It Bq Er EPERM
ファイルは変更不可能です。
.It Bq Er ENOTEMPTY
空ではないディレクトリを削除しようとしました。
.El
.Sh 関連項目
.Xr vnode 9 ,
.Xr VOP_LOOKUP 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
