freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_LINK.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_LINK.9,v 1.17 2002/09/19 13:34:50 truckman Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VOP_LINK 9
.Sh 名称
.Nm VOP_LINK
.Nd ファイルの新しい名前の作成
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn VOP_LINK "struct vnode *dvp" "struct vnode *vp" "struct componentname *cnp"
.Sh 解説
これは、既存のファイルに対し、
指定したディレクトリ中の新しい名前をリンクします。
.Pp
引数は以下の通りです。
.Bl -tag -width 8n
.It Ar dvp
ディレクトリの vnode。
.It Ar vp
リンクされるファイルの vnode。
.It Ar cnp
ファイルについてのパス名情報。
.El
.Pp
パス名情報は戻り時に開放されるべきではありません。
なぜならば、それは呼び出し側によって行なわれるからです。
ディレクトリとファイルの vnode は戻り時に解放されるべきではありません。
.Sh ロック
.Xr VOP_LINK 9
はディレクトリおよびファイルの vnode は入る時にロックされ、戻る時まで
ロックされ続けていることを期待します。
.Sh 戻り値
ファイルが成功裏にリンクされた場合には 0 が返され、
そうでない場合にはエラーが返されます。
.Sh 疑似コード
.Bd -literal
int
vop_link(struct vnode *dvp, struct vnode *vp, struct componentname *cnp)
{
    int error = 0;

    if (vp->v_mount != dvp->v_mount)
	return (EXDEV);

    if (vp would have too many links)
	return (EMLINK);

    if (vp is immutable)
	return (EPERM);

    /*
     * vp のリンクカウントをインクリメントし、ディスクに書き戻します。
     */
    ...;

    if (!error) {
	/*
	 * ディレクトリの新しい名前を追加します。
	 */
	...;
    }

    return error;
}
.Ed
.Sh エラー
.Bl -tag -width Er
.It Bq Er EMLINK
ファイルのリンクの数が多すぎます。
.El
.Bl -tag -width Er
.It Bq Er EPERM
ファィルが変更不可能です。
.El
.Bl -tag -width Er
.It Bq Er EXDEV
異なるファイルシステム間ではハードリンクは利用できません。
.El
.Sh 関連項目
.Xr vnode 9 ,
.Xr vn_lock 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が初めて書きました。
