freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_LEASE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_LEASE.9,v 1.2.2.5 2001/12/17 11:30:18 ru Exp %
.\"
.\" $FreeBSD$
.Dd September 24, 1999
.Os
.Dt VOP_LEASE 9
.Sh 名称
.Nm VOP_LEASE
.Nd ユーザ証明と操作のタイプの特有の組に対する vnode の正当性の確認
.Sh 書式
.In sys/param.h
.In sys/mount.h
.Ft int
.Fn VOP_LEASE "struct vnode *vp" "struct proc *p" "struct ucred *cred" "int type"
.Sh 解説
このエントリポイントは、現在実装されていません。
この着想は、ユーザ証明と操作の型の特有の組のための vnode を確認するための
ものだと信じています。
サポートされている、2 つの操作の型は LEASE_READ および LEASE_WRITE です。
現在、関数は常に 0 を返します。
.Sh ロック
入る時、vnode は排他的にロックされていなければならず、
戻り時まで排他的にロックされ続けているべきです。
.Sh 戻り値
成功時には、0 が返されます。そうでない場合にも、うーん... 0 が返されます。
.\" .Sh エラー
.Sh 関連項目
.Xr VOP_READ 9 ,
.Xr VOP_WRITE 9
.Sh 作者
このマニュアルページは
.An Matt Dillon
が書きました。
