freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_MMAP.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_MMAP.9,v 1.4 1999/08/28 00:21:14 peter Exp %
.\"
.Dd July 24, 1996
.Os
.Dt VOP_MMAP 9
.Sh 名称
.Nm VOP_MMAP
.Nd ファイルをメモリにマップする
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Ft int
.Fn VOP_MMAP "struct vnode *vp" "int fflags" "struct ucred *cred" "struct proc *p"
.Sh 解説
VM システムを使用してファイルの内容をメモリにマップします。
.Pp
引数は以下の通りです。
.Bl -tag -width fflags
.It Ar vp
ファイルの vnode。
.It Ar fflags
幾つかのフラグ ???
.It Ar cred
呼び出し側の証明。
.It Ar p
呼び出したプロセス。
.El
.Pp
ほとんどのファイルシステムは、このエントリポイントを実装していません。
.Sh 疑似コード
.Bd -literal
int
vop_mmap(struct vnode *vp, int fflags,
	   struct ucred *cred, struct proc *p)
{
    return EINVAL;
}
.Ed
.Sh 関連項目
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
