freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_SETEXTATTR.9
.\"-
.\" Copyright (c) 1999 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_SETEXTATTR.9,v 1.1.2.3 2001/12/17 11:30:18 ru Exp %
.\"
.\" $FreeBSD$
.Dd December 23, 1999
.Os
.Dt VOP_SETEXTATTR 9
.Sh 名称
.Nm VOP_SETEXTATTR
.Nd vnode への名前つき拡張属性の設定
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.In sys/extattr.h
.Ft int
.Fn VOP_SETEXTATTR "struct vnode *vp" "char *name" "struct uio *uio" "struct ucred *cred" "struct proc *p"
.Sh 解説
この vnode 呼び出しは、ファイルまたはディレクトリに対し、
特定の名前付き拡張属性を設定するために使用可能です。
.Pp
引数は以下の通りです。
.Bl -tag -width type
.It Fa vp
ファイルまたはディレクトリの vnode。
.It Fa name
属性の名前が入った、ヌル文字で終端された文字列へのポインタ。
.It Fa uio
読み込みまたは書き込みされるデータの位置。
.It Fa cred
要求の認証で使用するユーザ証明。
.It Fa p
拡張属性を設定しているプロセス。
.El
.Pp
uio 構造体は、
.Xr VOP_WRITE
での同じ名前の引数と同様に使用されます。しかしながら、
拡張属性が厳密な "name=value" のセマンティクスを規定しているので、
0 でないオフセットは却下されるでしょう。
.Pp
.Fa uio
ポインタは、
.Dv NULL
であることが可能であり、
指定された拡張属性が削除されるべきであることを指示します。
.Pp
.Fa cred
ポインタは、
.Dv NULL
を渡すことができ、
可能であるならばアクセス制御チェックが実行されないことを指示します。
この
.Fa cred
の設定は、アクティブプロセスに許されていない拡張属性の変更を、
カーネルが正当化することを認めるために使用可能です。
.Pp
拡張属性のセマンティクスは、
呼び出しを実装しているファイルシステムに依存して異なり得ます。
拡張属性についてのより多くの情報は
.Xr extattr 9
を参照してください。
.Sh ロック
vnode は、入る時にロックされ、戻り時にもロックされ続けているべきです。
.Sh 戻り値
拡張属性が成功裏に設定された場合には 0 が返されます。
そうでない場合には適切なエラーコードが返されます。
.Sh エラー
.Bl -tag -width Er
.It Bq Er EACCES
許可されませんでした。
.It Bq Er ENXIO
指定された vnode および属性名に対する要求は、このファイルシステムでは無効です。
.It Bq Er ENOMEM
要求を実行するための十分なメモリがありません。
.It Bq Er EFAULT
uio 構造体が無効なユーザ空間アドレスを参照しています。
.It Bq Er EINVAL
名前または uio 引数が無効です。
.It Bq Er EOPNOTSUPP
ファイルシステムが
.Fn VOP_GETEXTATTR
をサポートしていません。
.It Bq Er ENOSPC
ファイルシステムに空き領域がありません。
.It Bq Er EROFS
ファイルシステムが読み取り専用です。
.El
.Sh 関連項目
.Xr extattr 9 ,
.Xr vnode 9 ,
.Xr VOP_GETEXTATTR 9
.Sh 作者
このマニュアルページは
.An Robert Watson
が書きました。
