freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_PATHCONF.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_PATHCONF.9,v 1.6.2.2 2001/07/22 11:02:04 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/VOP_PATHCONF.9,v 1.3 2001/05/14 04:06:10 horikawa Exp $
.Dd July 24, 1996
.Os
.Dt VOP_PATHCONF 9
.Sh 名称
.Nm VOP_PATHCONF
.Nd POSIX パス構成情報の取得
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Fd #include <sys/unistd.h>
.Ft int
.Fn VOP_PATHCONF "struct vnode *vp" "int name" "int *retval"
.Sh 解説
引数は以下の通りです。
.Bl -tag -width retval
.It Ar vp
情報を得る対象の vnode。
.It Ar name
返す情報の型。
.It Ar retval
情報を返す場所。
.El
.Pp
.Fa name
の値は以下の何が返されるかを指定します。
.Bl -tag -width _PC_CHOWN_RESTRICTED
.It Dv _PC_LINK_MAX
ファイルへのリンクの最大値。
.It Dv _PC_NAME_MAX
ファイル名の最大バイト数。
.It Dv _PC_PATH_MAX
パス名の最大バイト数。
.It Dv _PC_PIPE_BUF
不可分にパイプに書き出される最大バイト数。
.It Dv _PC_CHOWN_RESTRICTED
.Xr chown 2
システムコールのために適切な特権が必要な場合には 1、
そうでない場合には 0。
.It Dv _PC_NO_TRUNC
.Dv KERN_NAME_MAX
よりも長いファイル名が切り詰められる場合には 1。
.El
.Sh 戻り値
.Fa name
が認識される場合、
.Fa *retval
に指定された値が設定されて 0 が返され、そうでない場合には
.Er EINVAL
が返されます。
.Sh 関連項目
.Xr pathconf 2 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
