freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_CREATE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_CREATE.9,v 1.15 2004/07/08 00:08:18 alfred Exp %
.\"
.\" $FreeBSD$
.Dd July 24, 1996
.Os
.Dt VOP_CREATE 9
.Sh 名称
.Nm VOP_CREATE ,
.Nm VOP_MKNOD ,
.Nm VOP_MKDIR ,
.Nm VOP_SYMLINK
.Nd ファイル、ソケット、FIFO、デバイス、ディレクトリまたはシンボリックリンクの作成
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.In sys/namei.h
.Ft int
.Fn VOP_CREATE "struct vnode *dvp" "struct vnode **vpp" "struct componentname *cnp" "struct vattr *vap"
.Ft int
.Fn VOP_MKNOD "struct vnode *dvp" "struct vnode **vpp" "struct componentname *cnp" "struct vattr *vap"
.Ft int
.Fn VOP_MKDIR "struct vnode *dvp" "struct vnode **vpp" "struct componentname *cnp" "struct vattr *vap"
.Ft int
.Fn VOP_SYMLINK "struct vnode *dvp" "struct vnode **vpp" "struct componentname *cnp" "struct vattr *vap" "char *target"
.Sh 解説
これらのエントリポイントは、新しいファイル、ソケット、FIFO、デバイス、
ディレクトリまたはシンボリックリンクを、
指定されたディレクトリの中に作成します。
.Pp
引数は以下の通りです。
.Bl -tag -width target
.It Fa dvp
ディレクトリのロックされた vnode。
.It Fa vpp
作成結果のロックされた vnode が格納されるべき、変数のアドレス。
.It Fa cnp
生成された要素のパス名。
.It Fa vap
新しいオブジェクトの作成時に使用されるべき属性。
.It Fa target
シンボリックリンクの対象のパス名。
.El
.Pp
これらのエントリポイントは、オブジェクトの生成中に
.Xr VOP_LOOKUP 9
の後に呼び出されます。
.Sh ロック
ディレクトリ
.Fa dvp
は入る時にロックされ、戻る時にもロックされ続けてなければなりません。
呼び出しが成功の場合には、新しいオブジェクトがロックされて返されます。
.Sh 戻り値
成功時には、新しいオブジェクトの vnode が
.Fa *vpp
に置かれ、0 が返されます。
そうでない場合には、適切なエラーが返されます。
.Sh 疑似コード
.Bd -literal
int
vop_create(struct vnode *dvp,
	   struct vnode **vpp,
	   struct componentname *cnp
	   struct vattr *vap)
{
    int mode = MAKEIMODE(vap->va_type, vap->va_mode);
    struct vnode *vp;
    int error;

    *vpp = NULL;
    if ((mode & IFMT) == 0)
	mode |= IFREG;

    error = SOMEFS_VALLOC(dvp, mode, cnp->cn_cred, &vp);
    if (error)
	return error;

    /*
     * 新しい vnode のパーミッションを更新します。
     * これには、ディレクトリからのグループのコピーを含みます。
     */
    ...;

#ifdef QUOTA
    /*
     * できる限りクォータ情報をチェックします。
     */
    ...;
#endif

    /*
     * ディレクトリに新しい vnode を入れ、ディレクトリ内容が変更される
     * 前に vnode がディスクをアクセスしない様に注意します。
     */
    error = ...;

    if (error)
	goto bad;

    *vpp = vp;

    return 0;

bad:
    /*
     * inode またはディレクトリの更新の試みで書き込みエラーが
     * 発生したため inode の割り当てを解放しなければなりません。
     */
    vput(vp);

    /*
     * vp のためのファイルシステム資源を解放。
     */
    ...;

    return error;
}
.Ed
.Sh エラー
.Bl -tag -width Er
.It Bq Er ENOSPC
ファイルシステムが一杯です。
.It Bq Er EDQUOT
そのユーザのファイルシステム空間または inode のクォータを超過しました。
.El
.Sh 関連項目
.Xr VOP_LOOKUP 9,
.Xr vnode 9
.Sh 歴史
関数
.Nm
は
.Bx 4.3
で登場しました。
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
