freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_REVOKE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2002 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by NAI Labs, the
.\" Security Research Division of Network Associates, Inc. under
.\" DARPA/SPAWAR contract N66001-01-C-8035 ("CBOSS"), as part of the DARPA
.\" CHATS research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The names of the authors may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_REVOKE.9,v 1.5 2002/03/18 16:40:07 ru Exp %
.\"
.\" $FreeBSD$
.Dd February 5, 2002
.Os
.Dt VOP_REVOKE 9
.Sh 名称
.Nm VOP_REVOKE
.Nd "デバイスとその別名へのアクセスの取り消し"
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn VOP_REVOKE "struct vnode *vp" "int flags"
.Sh 解説
.Fn VOP_REVOKE
は管理上、
.Fa vp
によって指定されたデバイスと
.Xr make_dev_alias 9
によって作成されたあらゆる別名へのアクセスを取り消します。
既にオープンしているプロセスによるこれら全てのデバイス上のファイル操作は、
普通は失敗します。
全てのアクセスが取り消されることを示すために、
.Fa flags
は
.Dv REVOKEALL
に設定されなければなりません。他の全ての値は無効です。
.Sh ロック
.Fa vp
は入る時にロック解除されていなければならず、戻る時までロック解除され続けます。
.Sh 関連項目
.Xr make_dev_alias 9 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Brian Fundakowski Feldman
が書きました。
