freebsd/freebsd-doc/ja_JP.eucJP/man/man9/VOP_ADVLOCK.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_ADVLOCK.9,v 1.6.2.2 2001/08/17 13:08:53 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man9/VOP_ADVLOCK.9,v 1.3 2001/07/29 05:15:41 horikawa Exp $
.Dd June 30, 1999
.Os
.Dt VOP_ADVLOCK 9
.Sh 名称
.Nm VOP_ADVLOCK
.Nd 問合せ型レコードロック
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/vnode.h>
.Fd #include <sys/fcntl.h>
.Fd #include <sys/lockf.h>
.Ft int
.Fn VOP_ADVLOCK "struct vnode *vp" "caddr_t id" "int op" "struct flock *fl" "int flags"
.Sh 解説
引数は以下の通りです。
.Bl -tag -width flags
.It Ar vp
操作されている vnode。
.It Ar id
ロックを変更している識別トークン。
.It Ar op
実行するべき操作 (
.Xr fcntl 2
を参照してください)。
.It Ar fl
ロックの記述。
.It Ar flags
以下の値のひとつ以上。
.Bl -column F_UNLCK -offset indent
.It Dv F_RDLCK Ta 共有または読み込みロック
.It Dv F_UNLCK Ta ロック解除
.It Dv F_WRLCK Ta 排他的または書き込みロック
.It Dv F_WAIT Ta ロックが承認されるまで待機
.It Dv F_FLOCK Ta ロックのために
.Xr flock 2
のセマンティクス使用
.It Dv F_POSIX Ta ロックのために POSIX のセマンティクスを使用
.El
.El
.Pp
このエントリポイントは、ファイルの問合せ型レコードロックを操作します。
ほとんどのファイルシステムは、この呼び出しのための作業を
.Fn lf_advlock
に委任します。
.Sh 戻り値
成功時には 0 が返され、そうでない場合にはエラーが返されます。
.Sh 関連項目
.Xr fcntl 2 ,
.Xr flock 2 ,
.Xr vnode 9
.Sh 作者
このマニュアルページは
.An Doug Rabson
が書きました。
