freebsd/freebsd-doc/ja_JP.eucJP/man/man9/vslock.9
.\"	%NetBSD: vslock.9,v 1.1 1996/06/15 20:47:29 pk Exp %
.\"
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Kranenburg.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/vslock.9,v 1.4.2.1 2000/12/12 10:00:57 ru Exp %
.\"
.\" $FreeBSD$
.Dd June 15, 1996
.Dt VSLOCK 9
.Os FreeBSD
.Sh 名称
.Nm vslock ,
.Nm vsunlock
.Nd ユーザー空間のアドレスのメモリへのロックとアンロック
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <vm/vm.h>
.Fd #include <vm/vm_extern.h>
.Ft void
.Fn vslock "caddr_t addr" "u_int len"
.Ft void
.Fn vsunlock "caddr_t addr" "u_int len" "int dirtied"
.Sh 解説
.Fn vslock
および
.Fn vsunlock
関数は現在実行中のプロセスに属するアドレスの範囲を
メモリ中にそれぞれロックしたりアンロックしたりします。
ロックされる実際のメモリ量はマシンのページサイズの倍数になります。
開始ページナンバーは
.Fa addr
をすぐ前のページ境界に切りつめられ、終了ページは
.Fa addr +
.Fa len
の次のページ境界に切り上げられて計算されます。
この操作に使用されるプロセスのコンテキストはグローバル変数
.Va curproc
を参照します。
.Pp
.Sh 関連項目
.Xr physio 9
.Sh バグ
引数としてプロセスのポインタを渡すべきです。
