freebsd/freebsd-doc/ja_JP.eucJP/man/man9/vslock.9
.\"	%NetBSD: vslock.9,v 1.1 1996/06/15 20:47:29 pk Exp %
.\"
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Kranenburg.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/vslock.9,v 1.15 2004/08/16 03:12:10 green Exp %
.\"
.\" $FreeBSD$
.Dd August 10, 2004
.Dt VSLOCK 9
.Os
.Sh 名称
.Nm vslock ,
.Nm vsunlock
.Nd ユーザ空間のアドレスのメモリへのロックとアンロック
.Sh 書式
.In sys/param.h
.In sys/proc.h
.In vm/vm.h
.In vm/vm_extern.h
.Ft int
.Fn vslock "void *addr" "size_t len"
.Ft void
.Fn vsunlock "void *addr" "size_t len"
.Sh 解説
.Fn vslock
および
.Fn vsunlock
関数は現在実行中のプロセスに属するアドレスの範囲を
メモリ中にそれぞれロックしたりアンロックしたりします。
ロックされる実際のメモリ量はマシンのページサイズの倍数になります。
開始ページナンバは
.Fa addr
をすぐ前のページ境界に切りつめられ、終了ページは
.Fa addr +
.Fa len
の次のページ境界に切り上げられて計算されます。
この操作に使用されるプロセスのコンテキストはグローバル変数
.Va curproc
を参照します。
.Sh 戻り値
.Fn vslock
関数は成功すると 0 を返し、そうでないと以下に示すエラーの中の 1 つを
返します。
.Sh エラー
.Fn vslock
関数は以下の場合に失敗します。
.Bl -tag -width Er
.It Bq Er EINVAL
.Fa addr
および
.Fa len
パラメータがマシンのアドレス空間の最後をラップアラウンドする
メモリ領域を指定しています。
.It Bq Er ENOMEM
指定されたアドレス範囲の大きさがロックされたメモリのシステム制限を
超過しています。
.It Bq Er ENOMEM
要求されたアドレス範囲をロックすることが、そのプロセスのプロセス毎の
ロックされたメモリの制限を超過させます。
.It Bq Er EFAULT
示されたアドレス範囲の中の幾つかの部分が割り当てられていません。
ページのマッピングにエラー/失敗があります。
.El
