freebsd/freebsd-doc/ja_JP.eucJP/man/man2/kldfind.2
.\"
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/kldfind.2,v 1.6.2.4 2000/12/29 14:44:52 ru Exp %
.\"
.\" $FreeBSD$
.Dd March 3, 1999
.Dt KLDFIND 2
.Os FreeBSD
.Sh 名称
.Nm kldfind
.Nd kld ファイルのファイル ID を返す
.Sh ライブラリ
.Lb libc
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/linker.h>
.Ft int
.Fn kldfind "const char *file"
.Sh 解説
関数
.Fn kldfind
は、
.Fa file
によって参照される kld ファイルのファイル ID を返します。
.Sh 戻り値
.Fn kldfind
は、
.Fa file
によって参照される kld ファイルのファイル ID を返します。
エラーがある場合、
.Fn kldfind
は -1 を返し、エラーを示すために
.Va errno
が設定されます。
.Sh エラー
.Fn kldfind
は処理を失敗すると、
.Va errno
を以下のように設定します。
.Bl -tag -width Er
.It Bq Er EFAULT
この操作に必要なデータがカーネル空間から読取れませんでした。
.It Bq Er ENOENT
指定されたファイルはカーネルにロードされていません。
.El
.Sh 関連項目
.Xr kldfirstmod 2 ,
.Xr kldload 2 ,
.Xr kldnext 2 ,
.Xr kldstat 2 ,
.Xr kldunload 2 ,
.Xr modfind 2 ,
.Xr modnext 2 ,
.Xr modstat 2 ,
.Xr kld 4
.Sh 歴史
.Nm kld
インタフェースは
.Fx 3.0
ではじめて登場しました。
