freebsd/freebsd-doc/ja_JP.eucJP/man/man2/kldnext.2
.\"
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/kldnext.2,v 1.3.2.3 1999/09/18 16:18:59 phantom Exp %	
.\"
.Dd March 3, 1999
.Dt KLDNEXT 2
.Os FreeBSD
.Sh 名称
.Nm kldnext
.Nd 次の kld ファイルのファイル ID を返す
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/linker.h>
.Ft int
.Fn kldnext "int fileid"
.Sh 解説
関数
.Fn kldnext
は、次の kld ファイル (すなわち、
.Va fileid
の後のファイル) のファイル ID を返します。
または
.Va fileid
がロードされた最後のファイルの場合は 0 を返します。
.Sh 戻り値
.Fn kldnext
は、次の kld ファイルのファイル ID または 0 を返します (解説を参照)。
エラーが発生した場合は、エラーを示すために
.Va errno
が設定されます。
.Sh エラー
.Fn kldnext
によって設定されるエラーは ENOENT だけです。これが設定されるときは、
.Va fileid
が存在しない (ロードされていない) kld ファイルを参照しているときです。
.Sh 関連項目
.Xr kldfind 2 ,
.Xr kldfirstmod 2 ,
.Xr kldload 2 ,
.Xr kldstat 2 ,
.Xr kldunload 2 ,
.Xr kld 4
.Sh 歴史
.Nm kld
インタフェースは
.Fx 3.0
ではじめて登場しました。
