freebsd/freebsd-doc/ja_JP.eucJP/man/man2/kldstat.2
.\"
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/kldstat.2,v 1.5.2.7 2001/08/17 15:42:45 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man2/kldstat.2,v 1.6 2001/08/19 06:53:25 horikawa Exp $
.Dd March 3, 1999
.Dt KLDSTAT 2
.Os
.Sh 名称
.Nm kldstat
.Nd kld ファイルの状態を得る
.Sh ライブラリ
.Lb libc
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/linker.h>
.Ft int
.Fn kldstat "int fileid" "struct kld_file_stat *stat"
.Sh 解説
.Fn kldstat
関数は、
.Fa fileid
によって参照されたファイルに関する情報を
.Fa stat
に書込みます。
.Bd -literal
struct kld_file_stat {
	int         version;        /* sizeof(linker_file_stat) に設定 */
	char        name[MAXPATHLEN];
	int         refs;
	int         id;
	caddr_t     address;        /* ロードアドレス */
	size_t      size;           /* バイト単位のサイズ */
};
.Ed
.Pp
.Bl -tag -width XXXaddress
.It version
このフィールドは、
.Fn kldstat
自体ではなく、
.Fn kldstat
を呼び出すコードで前述した
構造体のサイズに設定します。
.It name
.Fa fileid
によって参照されるファイルの名前
.It refs
.Fa fileid
によって参照されるモジュールの数
.It id
.Fa fileid
で指定されたファイルの ID
.It address
kld ファイルのロードアドレス
.It size
ファイルのサイズ
.El
.Sh 戻り値
.Rv -std kldstat
.Sh エラー
次の場合を除いて、
.Fa fileid
が参照するファイルに関する情報は
.Fa stat
が指す構造体に記入されます。
.Bl -tag -width Er
.It Bq Er ENOENT
ファイルが見つかりませんでした (おそらくロードされていないのでしょう)。
.It Bq Er EINVAL
stat
の
.Fa version
フィールドで指定されたバージョンが適切ではありません。
.Fa version
フィールドに適切に記入しているのにこのエラーが起きた場合は、
ワールド、カーネル、
またはアプリケーションを再構築する必要があります。
.It Bq Er EFAULT
.Fn copyout
関数で、フィールドを
.Fa stat
にコピーする際に問題がありました。
.El
.Sh 関連項目
.Xr kldfind 2 ,
.Xr kldfirstmod 2 ,
.Xr kldload 2 ,
.Xr kldnext 2 ,
.Xr kldsym 2 ,
.Xr kldunload 2 ,
.Xr modfind 2 ,
.Xr modfnext 2 ,
.Xr modnext 2 ,
.Xr modstat 2 ,
.Xr kld 4 ,
.Xr kldstat 8
.Sh 歴史
.Nm kld
インタフェースは
.Fx 3.0
ではじめて登場しました。
