freebsd/freebsd-doc/ja_JP.eucJP/man/man2/kldunload.2
.\"
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/kldunload.2,v 1.17 2002/12/18 09:22:30 ru Exp %
.\"
.\" $FreeBSD$
.Dd March 3, 1999
.Dt KLDUNLOAD 2
.Os
.Sh 名称
.Nm kldunload
.Nd kld ファイルをアンロードする
.Sh ライブラリ
.Lb libc
.Sh 書式
.In sys/param.h
.In sys/linker.h
.Ft int
.Fn kldunload "int fileid"
.Sh 解説
.Fn kldunload
システムコールは、
.Xr kldload 2
によってリンクされていた kld ファイルをカーネルからアンロードします。
.Sh 戻り値
.Rv -std
.Sh エラー
.Fa fileid
によって参照されるファイルは、次の場合を除いてアンロードされます:
.Bl -tag -width Er
.It Bq Er EPERM
ファイルをカーネルからアンリンク出来ません。
.It Bq Er ENOENT
ファイルが見つかりませんでした。
.It Bq Er EBUSY
カーネルによってリンクされたファイルをアンロードしようとしました。
.El
.Sh 関連項目
.Xr kldfind 2 ,
.Xr kldfirstmod 2 ,
.Xr kldload 2 ,
.Xr kldnext 2 ,
.Xr kldstat 2 ,
.Xr kldsym 2 ,
.Xr modfind 2 ,
.Xr modfnext 2 ,
.Xr modnext 2 ,
.Xr modstat 2 ,
.Xr kld 4 ,
.Xr kldunload 8
.Sh 歴史
.Nm kld
インタフェースは
.Fx 3.0
ではじめて登場しました。
