freebsd/freebsd-doc/ja_JP.eucJP/man/man2/listen.2
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	From: @(#)listen.2	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/lib/libc/sys/listen.2,v 1.12.2.3 2000/08/23 00:45:19 jhb Exp %
.\"
.Dd November 3, 1995
.Dt LISTEN 2
.Os BSD 4.2
.Sh 名称
.Nm listen
.Nd ソケット上の接続をリスンする
.Sh ライブラリ
.Lb libc
.Sh 書式
.Fd #include <sys/types.h>
.Fd #include <sys/socket.h>
.Ft int
.Fn listen "int s" "int backlog"
.Sh 解説
.Xr socket 2
で最初にソケットが作成され、
着信接続を受け入れる意思および着信接続用の待ち行列限界が
.Fn listen
で指定された後、接続が
.Xr accept 2
で受け入れられます。
.Fn listen
呼び出しは、タイプが
.Dv SOCK_STREAM
または
.Dv SOCK_SEQPACKET
のソケットにだけ適用されます。
.Pp
.Fa backlog
パラメータは、延期中の接続の待ち行列を伸ばす際の最大長を定義します。
待ち行列が一杯のときに接続要求が到着すると、クライアントは
.Er ECONNREFUSED
を示すエラーを受信する可能性があります。
または下層のプロトコルが再送信をサポートする場合は、
再試行によって成功する可能性に期待して要求は無視されるかもしれません。
.Pp
.Xr sysctl 3
MIB 変数
.Dq Li kern.ipc.somaxconn
は
.Fa backlog
のハードリミットを指定します。
.Li kern.ipc.somaxconn
より大きい値、または 0 より小さい値が指定されている場合、
.Fa backlog
の指定は無視されて
.Li kern.ipc.somaxconn
の値にされます。
.Sh システムの注意事項
.Pp
非スレッドライブラリ
.Fn listen
は
.Va listen
システムコールとして実装されています。
.Pp
スレッドライブラリでは、
.Va listen
システムコールは
.Fn _thread_sys_listen
にアセンブルされ、
.Fn listen
は読み書きについて
.Fa s
をロックしてから、
.Fn _thread_sys_listen
を呼び出す関数として実装されています。戻る前に
.Fn listen
は
.Fa s
をアンロックします。
.Sh 戻り値
戻り値 0 は処理の成功を示し、-1 はエラーを示します。
.Sh エラー
.Fn listen
は次の場合に処理を失敗します。
.Bl -tag -width Er
.It Bq Er EBADF
引数
.Fa s
が有効な記述子ではありません。
.It Bq Er ENOTSOCK
引数
.Fa s
がソケットではありません。
.It Bq Er EOPNOTSUPP
ソケットが、
.Fn listen
をサポートするタイプではありません。
.El
.Sh 関連項目
.Xr accept 2 ,
.Xr connect 2 ,
.Xr socket 2 ,
.Xr sysctl 3 ,
.Xr sysctl 8
.Sh 歴史
.Fn listen
関数は
.Bx 4.2
で登場しました。
実行時に最大
.Fa backlog
を設定できる機能、および許容できる最大値を指定する場合に負の
.Fa backlog
を使用する機能は
.Fx 2.2
で登場しました。
