freebsd/freebsd-doc/ja_JP.eucJP/man/man2/modnext.2
.\"
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/modnext.2,v 1.1.2.2 2000/12/08 13:49:32 ru Exp %
.\"
.\" $FreeBSD$
.Dd September 28, 2000
.Dt MODNEXT 2
.Os FreeBSD
.Sh 名称
.Nm modnext
.Nd 次のカーネルモジュールの modid を返す
.Sh ライブラリ
.Lb libc
.Sh 書式
.Fd #include <sys/param.h>
.Fd #include <sys/module.h>
.Ft int
.Fn modnext "int modid"
.Ft int
.Fn modfnext "int modid"
.Sh 解説
.Fn modnext
は次のカーネルモジュール (つまり、
.Va modid
のひとつ後ろ) の modid を返します。
.Va modid
がリスト内の最後のモジュールだったときは 0 を返します。
.Pp
.Va modid
の値が 0 の場合、
.Fn modnext
は最初のモジュールの modid を返します。
常に有効な modid を
.Fn modfnext
に渡す必要があります。
.Sh 戻り値
.Fn modnext
は次のモジュール (解説参照) の modid または 0 を返します。
エラーが起きたときは、そのエラーを示すために
.Va errno
が設定されます。
.Sh エラー
.Fn modnext
によるエラーは
.Er ENOENT
のみです。
これは
.Va modid
が、存在しない (読込まれていない) カーネルモジュールを指していることを
示します。
.Sh 参照
.Xr kldfind 2 ,
.Xr kldfirstmod 2 ,
.Xr kldload 2 ,
.Xr kldstat 2 ,
.Xr kldunload 2 ,
.Xr modfind 2 ,
.Xr modstat 2 ,
.Xr kld 4
.Sh 歴史
.Nm kld
インタフェースは
.Fx 3.0
ではじめて登場しました。
