freebsd/freebsd-doc/ja_JP.eucJP/man/man2/sendfile.2
.\" Copyright (c) 1998, David Greenman
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice unmodified, this list of conditions, and the following
.\"    disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/sendfile.2,v 1.17 2003/03/12 09:28:44 seanc Exp %
.\"
.\" $FreeBSD$
.Dd November 5, 1998
.Dt SENDFILE 2
.Os
.Sh 名称
.Nm sendfile
.Nd ファイルをソケットに送信
.Sh ライブラリ
.Lb libc
.Sh 書式
.In sys/types.h
.In sys/socket.h
.In sys/uio.h
.Ft int
.Fn sendfile "int fd" "int s" "off_t offset" "size_t nbytes" "struct sf_hdtr *hdtr" "off_t *sbytes" "int flags"
.Sh 解説
.Fn sendfile
システムコールは、記述子
.Fa fd
によって指定された通常のファイルを、記述子
.Fa s
によって指定されたストリームソケットから送信します。
.Pp
.Fa offset
引数はファイルのどこから開始すべきかを指定します。
.Fa nbytes
引数は、ファイルの何バイトを送信する必要があるかを指定します。
0 は、ファイルの終わりまで送信するという特殊な意味を持ちます。
.Pp
オプションのヘッダまたはトレーラ、またはその両方は、構造体 sf_hdtr を
指すポインタを指定することによってファイルの前と後で送信できます。
構造体 sf_hdtr の構造は次のとおりです:
.Pp
.Bd -literal -offset indent -compact
struct sf_hdtr {
	struct iovec *headers;  /* ヘッダ iovecs を指すポインタ */
	int hdr_cnt;            /* ヘッダ iovecs の数 */
	struct iovec *trailers; /* トレーラ iovecs を指すポインタ */
	int  trl_cnt;           /* トレーラ iovecs の数 */
};
.Ed
.Pp
.Fa headers
ポインタと
.Fa trailers
ポインタは、NULL でない場合に構造体 iovec 構造の配列を指します。
iovec 構造体の詳細については、
.Fn writev
システムコールを参照してください。
これらの配列内の iovecs の数は、
.Fa hdr_cnt
と
.Fa trl_cnt
によって指定されます。
.Pp
NULL でない場合に、システムは、ソケット上に送信された合計バイト数を、
.Fa sbytes
によって指された変数に書き込みます。
.Pp
.Fa flags
引数は現時点では未定義であり、0 に指定する必要があります。
.Pp
非ブロッキング入出力用に指定されたソケットを使用するときに、
.Fn sendfile
は要求されたよりも少ないバイトを送信することがあります。
この場合、正常に書き込まれたバイト数が
.Fa *sbytes
(指定されている場合) に返され、エラー
.Er EAGAIN
が返されます。
.Sh 実装に関する注
.Fn sendfile
の
.Fx
での実装は「0 コピー」です。
すなわち、ファイルデータのコピーが回避されるように最適化されています。
.Sh チューニング
内部ではこのシステムコールは、クライアントへの送信ファイルデータを
取り扱うために、特別な
.Xr sendfile 2
バッファ
.Pq Fa "struct sf_buf"
を使用しています。
送信ソケットがブロックされていて、
利用可能な送信ファイルバッファが十分でない場合には、
.Xr sendfile 2
はブロックされ、
.Dq sfbufa
の状態を報告します。
送信ソケットがブロックされておらず、
利用可能な送信ファイルバッファが十分でない場合には、
この呼び出しはブロックされ、呼び出しを終了する前に必要なバッファが
利用可能になるのを待ちます。
.Pp
.Fa sf_buf
の割り当てられた数は、
.Xr sendfile 2
を介してクライアントにデータを送信するために使用される nmbclusters の数に、
比例しているべきです。
ブロッキングを避けるために適宜にチューンしましょう!
.Xr sendfile 2
を広範囲に使用する忙しい装置が、
.Ar kern.ipc.nmbclusters
に展開されるこれらの値を増加させたくなるかもしれません
.Po
詳細は
.Xr tuning 7
を参照してください
.Pc
。
.Pp
使用中の
.Xr sendfile 2
バッファの数は、
.Xr loader.conf 5
の中の
.Em kern.ipc.nsfbufs
変数または
.Em NSFBUFS
カーネルコンフィギュレーション調整のどちらかによって、ブート時に決定されます。
sendfile バッファの数は
.Em kern.maxusers
に合わせて調整されます。
.Sh 戻り値
.Rv -std sendfile
.Sh エラー
.Bl -tag -width Er
.It Bq Er EBADF
.Fa fd
引数が有効なファイル記述子ではありません。
.It Bq Er EBADF
.Fa s
引数が有効なソケット記述子ではありません。
.It Bq Er ENOTSOCK
.Fa s
引数がソケットではありません。
.It Bq Er EINVAL
.Fa fd
引数が通常のファイルではありません。
.It Bq Er EINVAL
.Fa s
引数が SOCK_STREAM 型のソケットではありません。
.It Bq Er EINVAL
.Fa offset
引数が負であるか、または範囲外です。
.It Bq Er ENOTCONN
.Fa s
引数が、未接続のソケットを指しています。
.It Bq Er EPIPE
通信相手が接続を閉じてしまいました。
.It Bq Er EIO
.Fa fd
から読取り中に入出力エラーが発生しました。
.It Bq Er EFAULT
引数について無効なアドレスが指定されました。
.It Bq Er EAGAIN
ソケットは非ブロッキング入出力と指定されており、ソケットバッファが
満杯であるためにすべてのデータが送信されませんでした。
sbytes が指定された場合、送信が正常に完了したバイト数が
.Fa *sbytes
内に返されます。
.El
.Sh 関連項目
.Xr open 2 ,
.Xr send 2 ,
.Xr socket 2 ,
.Xr tuning 7 ,
.Xr writev 2
.Sh 歴史
.Fn sendfile
システムコールは、
.Fx 3.0
ではじめて登場しました。
このマニュアルページは
.Fx 3.1
ではじめて登場しました。
.Sh 作者
.Fn sendfile
システムコールとこのマニュアルページは
.An David Greenman Aq dg@root.com
が作成しました。
