Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributors/_index.po
Languages: es, pt_br

source: {mbarkah} and his employer, http://www.hemi.com/[ Hemisphere Online], donated a _Pentium Pro (P6) 200MHz CPU_
es: {mbarkah} y su empleador, http://www.hemi.com/[ Hemisphere Online], donaron un _Pentium Pro (P6) 200MHz CPU_

source: Joe McGuckin <mailto:joe@via.net[joe@via.net]> of http://www.via.net/[ViaNet Communications] donated a _Kingston ethernet controller._
es: Joe McGuckin <mailto:joe@via.net[joe@via.net]> de http://www.via.net/[ViaNet Communications] donó una _controladora ethernet a Kingston._

source: Ulf Zimmermann <mailto:ulf@Alameda.net[ulf@Alameda.net]> of http://www.Alameda.net/[Alameda Networks] donated _128MB of memory_, a _4 Gb disk drive and the case._
es: Ulf Zimmermann <mailto:ulf@Alameda.net[ulf@Alameda.net]> de http://www.Alameda.net/[Alameda Networks] donó _128MB de memoria_, una _unidad de disco de 4 Gb y la carcasa._

source: _Direct funding:_
es: _Financiación directa:_

source: Kenneth P. Stox <mailto:ken@stox.sa.enteract.com[ken@stox.sa.enteract.com]> of http://www.imagescape.com/[Imaginary Landscape, LLC.]
es: Kenneth P. Stox <mailto:ken@stox.sa.enteract.com[ken@stox.sa.enteract.com]> de http://www.imagescape.com/[Imaginary Landscape, LLC.]

source: http://www.siemens.de/[Siemens AG] via Andre Albsmeier <mailto:andre.albsmeier@mchp.siemens.de[andre.albsmeier@mchp.siemens.de]>
es: http://www.siemens.de/[Siemens AG] vía Andre Albsmeier <mailto:andre.albsmeier@mchp.siemens.de[andre.albsmeier@mchp.siemens.de]>

source: _Hardware contributors:_
es: _Colaboradores hardware:_

source: TRW Financial Systems, Inc. provided 130 PCs, three 68 GB file servers, twelve Ethernets, two routers and an ATM switch for debugging the diskless code.
es: TRW Financial Systems, Inc. proporcionó 130 PC, tres servidores de archivos de 68 GB, doce Ethernets, dos enrutadores y un conmutador ATM para depurar el código sin disco.

source: Dermot McDonnell donated the Toshiba XM3401B CDROM drive currently used in freefall.
es: Dermot McDonnell donó la unidad de CDROM Toshiba XM3401B que se usa actualmente en caída libre.

source: Larry Altneu <mailto:larry@ALR.COM[larry@ALR.COM],> and {wilko}, provided Wangtek and Archive QIC-02 tape drives in order to improve the [.filename]#wt# driver.
es: Larry Altneu <mailto:larry@ALR.COM[larry@ALR.COM],> and {wilko}, proporcionó unidades de cinta Wangtek y Archive QIC-02 para mejorar el driver [.filename]#wt#.

source: _Special contributors:_
es: _Colaboradores especiales:_

source: The http://www.interface-business.de/[interface business GmbH, Dresden] has been patiently supporting {joerg} who has often preferred FreeBSD work over paid work, and used to fall back to their (quite expensive) EUnet Internet connection whenever his private connection became too slow or flaky to work with it...
es: El http://www.interface-business.de/[interface business GmbH, Dresden] ha apoyado pacientemente a {joerg} que a menudo ha preferido trabajar en FreeBSD antes que trabajar cobrando, y solía utilizar su conexión a Internet EUnet (bastante cara) cuando su conexión privada se volvía muy lenta o fallona como para trabajar con ella...

source: http://www.bsdi.com/[Berkeley Software Design, Inc.] has contributed their DOS emulator code to the remaining BSD world, which is used in the _doscmd_ command.
es: http://www.bsdi.com/[Berkeley Software Design, Inc.] ha proporcionado su código de emulación DOS al resto del mundo BSD, el cual es usado en el comando _doscmd_.
