Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributors/_index.po
Languages: es, pt_br

source: A list of organizations and individuals who have contributed to FreeBSD
es: Una lista de las personas y organizaciones que han contribuido a FreeBSD
pt_br: Este artigo lista pessoas e organizações que fizeram alguma contribuição para o FreeBSD

source: Contributors to FreeBSD
es: Colaboradores de FreeBSD
pt_br: Contribuidores do FreeBSD

source: Abstract
es: Resumen
pt_br: Resumo

source: This article lists individuals and organizations who have made a contribution to FreeBSD. To see the current list of FreeBSD Committers you can take a look at the following <<staff-committers, list>>.
es: Este artículo enumera las personas y organizaciones que han contribuido a FreeBSD. Para ver la lista de Committers de FreeBSD puedes echar un vistazo a la siguiente <<staff-committers, lista>>.
pt_br: Este artigo lista pessoas e organizações que fizeram alguma contribuição para o FreeBSD. Para ver a lista atual de Committers do FreeBSD você pode dar uma olhada na seguinte <<staff-committers, lista>>.

source: The FreeBSD Developers
es: Los desarrolladores de FreeBSD
pt_br: Os Desenvolvedores do FreeBSD

source: This list, which includes all members of the Core Team, names everyone who has commit privileges for one or more of the three source trees (doc, ports and src). To see the current Core Team members you can take a look at the link:https://www.freebsd.org/administration/#t-core[administration page].
es: Esta lista, que incluye a los miembros del Core Team, menciona a todos los que tienen privilegios de escritura en al menos uno de los tres árboles de fuentes (doc, ports y src). Para ver los miembros actuales del Core Team puedes echar un vistazo a la link:https://www.freebsd.org/administration/#t-core[página de administración].
pt_br: Esta lista, que inclui todos os membros do Core Team, nomeia todos que têm privilégios de commit para uma ou mais das três árvores de código (doc, ports e src). Para ver os membros atuais do Core Team, você pode dar uma olhada na link:https://www.freebsd.org/administration/#t-core[página de administração].

source: (in alphabetical order by last name):
es: (en orden alfabético por apellido):
pt_br: (em ordem alfabética pelo sobrenome):

source: Core Team Alumni
es: Antiguos miembros del core team
pt_br: Ex Membros do Core Team

source: The following people were members of the FreeBSD core team during the periods indicated. We thank them for their past efforts in the service of the FreeBSD project.
es: Las siguientes personas fueron miembros del core team de FreeBSD durante los períodos indicados. Les agradecemos sus esfuerzos pasados al servicio del proyecto FreeBSD.
pt_br: As seguintes pessoas eram membros do Core Team do FreeBSD durante os períodos indicados. Agradecemos por seus esforços anteriores a serviço do projeto FreeBSD.

source: _In rough reverse chronological order:_
es: _En orden cronológico inverso aproximado:_
pt_br: _Em ordem cronológica reversa:_

source: Development Team Alumni
es: Antiguos miembros del equipo de desarrollo
pt_br: Ex Membros do Time de Desenvolvimento

source: The following people were members of the FreeBSD development team during the periods indicated. We thank them for their past efforts in the service of the FreeBSD project.
es: Las siguientes personas fueron miembros del equipo de desarrollo de FreeBSD durante los períodos indicados. Les agradecemos sus esfuerzos pasados al servicio del proyecto FreeBSD.
pt_br: As seguintes pessoas eram membros do time de desenvolvimento do FreeBSD durante os períodos indicados. Agradecemos por seus esforços anteriores a serviço do projeto FreeBSD.

source: Ports Management Team Alumni
es: Antiguos miembros del equipo de gestión de Ports
pt_br: Ex Membros do Ports Management

source: The following people were members of the FreeBSD portmgr team during the periods indicated. We thank them for their past efforts in the service of the FreeBSD project.
es: Las siguientes personas fueron miembros del equipo portmgr de FreeBSD durante los períodos indicados. Les agradecemos sus esfuerzos pasados al servicio del proyecto FreeBSD.
pt_br: As seguintes pessoas eram membros do time portmgr do FreeBSD durante os períodos indicados. Agradecemos por seus esforços anteriores a serviço do projeto FreeBSD.

source: Development Team: In Memoriam
es: Equipo de desarrollo: en homenaje
pt_br: Time de Desenvolvimento: Em memória

source: During the many years that the FreeBSD Project has been in existence, sadly, some of our developers have passed away. Here are some remembrances.
es: Durante los muchos años que ha existido el proyecto FreeBSD, lamentablemente, algunos de nuestros desarrolladores han fallecido. Aquí hay algunas conmemoraciones.
pt_br: Durante os muitos anos de existência do Projeto FreeBSD, infelizmente, alguns de nossos desenvolvedores faleceram. Aqui estão algumas lembranças.

source: _In rough reverse chronological order of their passing:_
es: _En orden cronológico inverso aproximado de fallecimiento:_
pt_br: _Em ordem cronológica reversa da data aproximada de seus falecimentos:_

source: Derived Software Contributors
es: Colaboradores de software derivado
pt_br: Contribuidores de Software Derivados

source: This software was originally derived from William F. Jolitz's 386BSD release 0.1, though almost none of the original 386BSD specific code remains. This software has been essentially re-implemented from the 4.4BSD-Lite release provided by the Computer Science Research Group (CSRG) at the University of California, Berkeley and associated academic contributors.
es: Este software se deriva originalmente de la versión 0.1 de 386BSD de William F. Jolitz, aunque casi no queda nada del código original de 386BSD. Este software se volvió a implementar a partir de la versión 4.4BSD-Lite proporcionada por el Computer Science Research Group (CSRG) de la University of California, Berkeley y colaboradores académicos asociados.
pt_br: Este software foi originalmente derivado do release 0.1 de William F. Jolitz, embora quase nenhum código específico original do 386BSD permaneça. Este software foi essencialmente reimplementado a partir da versão 4.4BSD-Lite fornecida pelo Computer Science Research Group (CSRG) na Universidade da Califórnia, Berkeley e colaboradores acadêmicos associados.

source: There are also portions of NetBSD and OpenBSD that have been integrated into FreeBSD as well, and we would therefore like to thank all the contributors to NetBSD and OpenBSD for their work.
es: Hay partes de NetBSD y OpenBSD que también se han integrado en FreeBSD, y nos gustaría agradecer a todos los colaboradores de NetBSD y OpenBSD por su trabajo.
pt_br: Há partes do NetBSD e do OpenBSD que foram integradas no FreeBSD também, e gostaríamos de agradecer a todos os contribuidores do NetBSD e do OpenBSD pelo seus trabalhos.

source: Additional FreeBSD Contributors
es: Colaboradores adicionales de FreeBSD
pt_br: Contribuidores Adicionais do FreeBSD

source: (in alphabetical order by first name):
es: (en orden alfabético por nombre):
pt_br: (em ordem alfabética pelo primeiro nome):

source: 386BSD Patch Kit Patch Contributors
es: Colaboradores del 386BSD Patch Kit
pt_br: Contribuidores do Kit Patch 386BSD

source: Donors Gallery
es: Galería de donantes
pt_br: Galeria de Doadores

source: The FreeBSD Foundation thanks https://freebsdfoundation.org/our-donors/donors/[financial and in-kind donors].
pt_br: A FreeBSD Foundation agradece aos https://freebsdfoundation.org/our-donors/donors/[doadores financeiros e em espécie].

source: The https://www.freebsd.org/donations/[FreeBSD Donations Liaison] area includes a https://www.freebsd.org/donations/donors/[list of donated hardware].
pt_br: A área https://www.freebsd.org/donations/[de contato para doações ao FreeBSD] inclui uma https://www.freebsd.org/donations/donors/[lista de hardwares doados].

source: The FreeBSD Project thanks all donors!
pt_br: O Projeto FreeBSD agradece a todos os doadores!

source: As of 2010, the section below was several years out-of-date.
pt_br: Desde de 2010, a seção abaixo estava desatualizada há vários anos.

source: Contributors to the central server project
pt_br: Contribuidores para o projeto do servidor central

source: The following individuals and businesses made it possible for the FreeBSD Project to build a new central server machine, which has replaced `freefall.FreeBSD.org` at one point, by donating the following items:
es: Las siguientes personas y negocios hicieron posible que el Proyecto FreeBSD construyera un nuevo servidor central, el cual ha reemplazado `freefall.FreeBSD.org` en un momento dado, donando los siguientes elementos:
pt_br: As pessoas e as organizações a seguir possibilitaram ao Projeto FreeBSD construir um novo servidor central, que substituiu a `freefal.FreeBSD.org` em algum momento, doando os seguintes itens:

source: {mbarkah} and his employer, http://www.hemi.com/[Hemisphere Online], donated a _Pentium Pro (P6) 200MHz CPU_.
pt_br: {mbarkah} e seu empregador, http://www.hemi.com/[Hemisphere Online], doaram uma _CPU Pentium Pro (P6) de 200MHz_.

source: http://www.asacomputers.com/[ASA Computers] donated a _Tyan 1662 motherboard_.
es: http://www.asacomputers.com/[ASA Computers] donó una placa base _Tyan 1662_.
pt_br: http://www.asacomputers.com/[ASA Computers] doou uma _placa mãe Tyan 1662_.

source: Joe McGuckin <mailto:joe@via.net[joe@via.net]> of http://www.via.net/[ViaNet Communications] donated a _Kingston ethernet controller_.
pt_br: Joe McGuckin <mailto:joe@via.net[joe@via.net]> da http://www.via.net/[ViaNet Communications] doou um _controlador de ethernet Kingston_.

source: Jack O'Neill <mailto:jack@diamond.xtalwind.net[jack@diamond.xtalwind.net]> donated an _NCR 53C875 SCSI controller card_.
es: Jack O'Neill <mailto:jack@diamond.xtalwind.net[jack@diamond.xtalwind.net]> donó una _tarjeta controladora SCSI NCR 53C875_.
pt_br: Jack O'Neill <mailto:jack@diamond.xtalwind.net[jack@diamond.xtalwind.net]> doou uma _controladora SCSI NCR 53C875_.

source: Ulf Zimmermann <mailto:ulf@Alameda.net[ulf@Alameda.net]> of http://www.Alameda.net/[Alameda Networks] donated _128MB of memory_, a _4 Gb disk drive and the case_.
pt_br: Ulf Zimmermann <mailto:ulf@Alameda.net[ulf@Alameda.net]> da http://www.Alameda.net/[Alameda Networks] doou _128 MB de memória_, um _disco rígido de 4 GB e o case_.

source: Direct funding
pt_br: Financiamento direto

source: The following individuals and businesses have generously contributed direct funding to the project:
es: Las siguientes personas y empresas han contribuido generosamente con fondos directos al proyecto:
pt_br: As seguintes pessoas e organizações generosamente contribuíram com financiamento direto ao projeto:

source: Kenneth P. Stox <mailto:ken@stox.sa.enteract.com[ken@stox.sa.enteract.com]> of http://www.imagescape.com/[Imaginary Landscape, LLC.].
pt_br: Kenneth P. Stox <mailto:ken@stox.sa.enteract.com[ken@stox.sa.enteract.com]> da http://www.imagescape.com/[Imaginary Landscape, LLC.].

source: http://www.cdrom.co.jp/[Laser5] of Japan (a portion of the profits from sales of their various FreeBSD CDROMs).
es: http://www.cdrom.co.jp/[Laser5] de Japón (una parte de los beneficios de ventas de varios de sus CDROMs de FreeBSD).
pt_br: http://www.cdrom.co.jp/[Laser5] do Japão (uma parte dos lucros das vendas de vários CD-ROMs com FreeBSD).

source: http://www.mmjp.or.jp/fuki/[Fuki Shuppan Publishing Co.] donated a portion of their profits from _Hajimete no FreeBSD_ (FreeBSD, Getting started) to the FreeBSD and XFree86 projects.
es: http://www.mmjp.or.jp/fuki/[Fuki Shuppan Publishing Co.] donó una parte de sus beneficios de _Hajimete no FreeBSD_ (Empezando con FreeBSD) a los proyectos FreeBSD y XFree86.
pt_br: http://www.mmjp.or.jp/fuki/[Fuki Shuppan Publishing Co.] doou uma parte dos seus lucros de _Hajimete no FreeBSD_ (FreeBSD, Getting started) para os projetos FreeBSD e XFree86.

source: http://www.ascii.co.jp/[ASCII Corp.] donated a portion of their profits from several FreeBSD-related books to the FreeBSD project.
es: http://www.ascii.co.jp/[ASCII Corp.] donó una parte de sus beneficios provenientes de libros relacionados con FreeBSD al proyecto FreeBSD.
pt_br: http://www.ascii.co.jp/[ASCII Corp.] doou uma parte dos seus lucros com a venda de vários livros relacionados ao FreeBSD para o projeto FreeBSD.

source: http://www.yokogawa.co.jp/[Yokogawa Electric Corp] has generously donated significant funding to the FreeBSD project.
es: http://www.yokogawa.co.jp/[Yokogawa Electric Corp] ha realizado una significativa y generosa financiación al proyecto FreeBSD.
pt_br: http://www.yokogawa.co.jp/[Yokogawa Electric Corp] generosamente doou recursos significativos ao projeto FreeBSD.

source: Hardware contributors
pt_br: Doadores de Hardware

source: The following individuals and businesses have generously contributed hardware for testing and device driver development/support:
es: Las siguientes personas y empresas han contribuido generosamente con hardware para pruebas y desarrollo / soporte de controladores de dispositivos:
pt_br: As seguintes pessoas e empresas generosamente contribuíram com hardware para testes e desenvolvimento/suporte de drivers de dispositivos:

source: BSDi for providing the Pentium P5-90 and 486/DX2-66 EISA/VL systems that are being used for our development work, to say nothing of the network access and other donations of hardware resources.
es: BSDi por proporcionar los sistemas Pentium P5-90 y 486 / DX2-66 EISA / VL que se están utilizando para nuestro trabajo de desarrollo, por no hablar del acceso a la red y otras donaciones de recursos de hardware.
pt_br: BSDi por fornecer os computadores Pentium P5-90 e 486/DX2-66 EISA/VL que são utilizados para o nosso trabalho de desenvolvimento, para não falar do acesso a rede e outras doações de recursos de hardware.

source: http://www.compaq.com[Compaq] has donated a variety of Alpha systems to the FreeBSD Project. Among the many generous donations are 4 AlphaStation DS10s, an AlphaServer DS20, AlphaServer 2100s, an AlphaServer 4100, 8 500Mhz Personal Workstations, 4 433Mhz Personal Workstations, and more! These machines are used for release engineering, package building, SMP development, and general development on the Alpha architecture.
es: http://www.compaq.com[Compaq] donó diversos ordenadores de sistemas Alpha al proyecto FreeBSD. Las generosas donaciones incluyen 4 AlphaStation DS10, un AlphaServer DS20, AlphaServer 2100, un AlphaServer 4100, 8 estaciones de trabajo personales de 500Mhz, 4 estaciones de trabajo personales de 433Mhz, ¡y más! Estos ordenadores se utilizan para la generación de versiones, el empaquetado, el desarrollo SMP y el desarrollo general de la arquitectura Alpha.
pt_br: A http://www.compaq.com[Compaq] doou uma variedade de sistemas Alpha para o Projeto FreeBSD. Entre as muitas doações generosas estão 4 AlphaStation DS10s, um AlphaServer DS20, AlphaServer 2100s, um AlphaServer 4100, 8 estações de trabalho pessoais de 500 MHz, 4 estações de trabalho pessoais de 433 MHz e mais! Essas máquinas são usadas para engenharia de releases, compilação de pacotes, desenvolvimento SMP e desenvolvimento geral na arquitetura Alpha.

source: TRW Financial Systems, Inc. provided 130 PCs, three 68 GB file servers, twelve Ethernets, two routers and an ATM switch for debugging the diskless code
pt_br: A TRW Financial Systems, Inc. forneceu 130 PCs, três servidores de arquivos de 68 GB, doze Ethernets, dois roteadores e um switch ATM para depuração do código "diskless"

source: Dermot McDonnell donated the Toshiba XM3401B CDROM drive currently used in _freefall_.
pt_br: Dermot McDonnell doou o drive de CDROM Toshiba XM3401B atualmente usado na _freefall_.

source: Chuck Robey <mailto:chuckr@glue.umd.edu[chuckr@glue.umd.edu]> contributed his floppy tape streamer for experimental work.
es: Chuck Robey <mailto:chuckr@glue.umd.edu[chuckr@glue.umd.edu]> contribuyó con su unidad de transferencia de disco a cinta para trabajo experimental.
pt_br: Chuck Robey <mailto:chuckr@glue.umd.edu[chuckr@glue.umd.edu]> doou seu drive de fita para trabalho experimental.

source: Larry Altneu <mailto:larry@alr.com[larry@alr.com],> and {wilko}, provided Wangtek and Archive QIC-02 tape drives in order to improve the [.filename]#wt# driver.
pt_br: Larry Altneu <mailto:larry@alr.com[larry@alr.com],> e {wilko} forneceram drives de fita Wangtek e Archive QIC-02 para melhorar o driver [.filename]#wt#.

source: Ernst Winter (http://berklix.org/ewinter/[Deceased]) contributed a 2.88 MB floppy drive to the project. This will hopefully increase the pressure for rewriting the floppy disk driver.
es: Ernst Winter (http://berklix.org/ewinter/[Fallecido]) contribuyó al proyecto con una unidad de disco de 2.88 MB. Con suerte esto incrementará la presión para reescribir el driver de diskettes.
pt_br: Ernst Winter (http://berklix.org/ewinter/[Falecido]) contribuiu com um drive de disquete 2.88 MB para o projeto. Esperamos que isto aumente a pressão para reescrever o driver para disquetes.

source: http://www.tekram.com/[Tekram Technologies] sent one each of their DC-390, DC-390U and DC-390F FAST and ULTRA SCSI host adapter cards for regression testing of the NCR and AMD drivers with their cards. They are also to be applauded for making driver sources for free operating systems available from their FTP server link:ftp://ftp.tekram.com/scsi/FreeBSD/[ftp://ftp.tekram.com/scsi/FreeBSD/].
es: http://www.tekram.com/[Tekram Technologies] envió una unidad de cada uno de sus adaptadores DC-390, DC-390U, DC-390F FAST y ULTRA SCSI para pruebas de regresión de los drivers NCR y AMD con sus tarjetas. También hay que agradecerles por hacer que sus drivers estén disponibles para los sistemas operativos libres a través de su FTP en link:ftp://ftp.tekram.com/scsi/FreeBSD/[ftp://ftp.tekram.com/scsi/FreeBSD/].
pt_br: A http://www.tekram.com/[Tekram Technologies] enviou um de seus cartões adaptadores de host FAST e ULTRA SCSI DC-390, DC-390U e DC-390F para testes de regressão dos drivers NCR e AMD com seus cartões. Eles também devem ser aplaudidos por disponibilizar fontes de driver para sistemas operacionais gratuitos em seu servidor FTP link:ftp://ftp.tekram.com/scsi/FreeBSD/[ftp://ftp.tekram.com/scsi/FreeBSD/].

source: Larry M. Augustin contributed not only a Symbios Sym8751S SCSI card, but also a set of data books, including one about the forthcoming Sym53c895 chip with Ultra-2 and LVD support, and the latest programming manual with information on how to safely use the advanced features of the latest Symbios SCSI chips. Thanks a lot!
es: Larry M. Augustin contribuyó no solo con una tarjeta Symbios Sym8751S SCSI, sino también con un conjunto de libros de datos, incluido uno sobre el próximo chip Sym53c895 con soporte para Ultra-2 y LVD, y el último manual de programación con información sobre cómo utilizar de forma segura el avanzado características de los últimos chips SCSI de Symbios. ¡Muchas gracias!
pt_br: Larry M. Augustin contribuiu não apenas com uma placa SCSI Symbios Sym8751S, mas também com um conjunto de manuais, incluindo um para o próximo chip Sym53c895 com suporte Ultra-2 e LVD, e o último manual de programação com informações sobre como utilizar com segurança as funcionalidades avançadas dos últimos chips SCSI Symbios. Muito obrigado!

source: {kuku} donated an FX120 12 speed Mitsumi CDROM drive for IDE CDROM driver development.
es: {kuku} donó una unidad de CDROM FX120 velocidad 12x Mitsumi para el desarrollo del driver IDE CDROM.
pt_br: {kuku} doou um drive de CD-ROM Mitsumi com 12x de velocidade FX120 para o desenvolvimento do driver IDE CDROM.

source: Mike Tancsa <mailto:mike@sentex.ca[mike@sentex.ca]> donated four various ATM PCI cards in order to help increase support of these cards as well as help support the development effort of the netatm ATM stack.
es: Mike Tancsa <mailto:mike@sentex.ca[mike@sentex.ca]> donó cuatro tarjetas PCI variadas para cajeros automáticos para ayudar a aumentar el soporte de estas tarjetas, así como para apoyar el esfuerzo de desarrollo de la pila de cajeros automáticos netatm.
pt_br: Mike Tancsa <mailto:mike@sentex.ca[mike@sentex.ca]> doou quatro diversas placas ATM PCI cards com o objetivo de aumentar o suporte a estas placas bem como suportar o desenvolvimento da stack ATM netatm.

source: Special contributors
pt_br: Contribuidores Especiais

source: http://www.osd.bsdi.com/[BSDi] (formerly Walnut Creek CDROM) has donated almost more than we can say (see the 'About the FreeBSD Project' section of the extref:{handbook}[FreeBSD Handbook] for more details). In particular, we would like to thank them for the original hardware used for `freefall.FreeBSD.org`, our primary development machine, and for `thud.FreeBSD.org`, a testing and build box. We are also indebted to them for funding various contributors over the years and providing us with unrestricted use of their T1 connection to the Internet.
es: http://www.osd.bsdi.com/[BSDi] (anteriormente Walnut Creek CDROM) ha donado más de lo que podemos decir (vea la sección 'Acerca del Proyecto FreeBSD' del extref:{handbook}[FreeBSD Handbook] para más detalles). En concreto, nos gustaría agradecerles por el hardware original usado para `freefall.FreeBSD.org`, nuestra principal máquina d desarrollo, y por `thud.FreeBSD.org`, una máquina de testeo y construcción. También estamos en deuda con ellos por financiar a varios colaboradores durante años y por proporcionarnos acceso sin restricciones a su conexión T1 de acceso a Internet.
pt_br: http://www.osd.bsdi.com/[BSDi] (antigo Walnut Creek CDROM) doou mais do que podemos dizer (veja a seção 'Sobre o Projeto FreeBSD' no extref:{handbook}[FreeBSD Handbook] para mais detalhes). Em particular, nós gostaríamos de agradecê-los pelo hardware original utilizado na `freefall.FreeBSD.org`, nossa máquina de desenvolvimento primária, e pela `thud.FreeBSD.org`, uma máquina para compilações e testes. Nós também estamos em débito com eles pelo financiamento de vários contribuidores ao longo dos anos e por prover acesso irrestrito a nós em sua conexão com a Internet T1.

source: The http://www.interface-business.de/[interface business GmbH, Dresden] has been patiently supporting {joerg} who has often preferred FreeBSD work over paid work, and used to fall back to their (quite expensive) EUnet Internet connection whenever his private connection became too slow or flaky to work with it.
pt_br: A http://www.interface-business.de/[interface business GmbH, Dresden] tem apoiado pacientemente {joerg} que muitas vezes preferiu trabalhar no FreeBSD em vez de trabalhos remunerados, e costumava recorrer à conexão com a Internet da EUnet (bastante cara) sempre que sua conexão privada ficava muito lenta ou instável para trabalhar com ela.

source: http://www.bsdi.com/[Berkeley Software Design, Inc.] has contributed their DOS emulator code to the remaining BSD world, which is used in the `doscmd` command.
pt_br: http://www.bsdi.com/[Berkeley Software Design, Inc.] contribuiu com seu código de emulador do DOS para o restante do mundo BSD, o qual é usado no comando `doscmd`.

source: As of 2010, the following section is several years out-of-date. Donations from the past several years appear https://www.FreeBSD.org/donations/donors/[here].
es: A fecha de 2010, la siguiente sección lleva varios años desactualizada. Las donaciones de los últimos años aparecen https://www.FreeBSD.org/donations/donors/[aquí].

source: The FreeBSD Project is indebted to the following donors and would like to publicly thank them here!
es: ¡El Proyecto FreeBSD está en deuda con los siguientes donantes y me gustaría agradecerles públicamente aquí!

source: _Contributors to the central server project:_
es: _Colaboradores al proyecto del servidor central:_
