Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/porters-handbook/security/_index.po
Languages: ru

source: Check if the port has `PORTEPOCH`. The above script snippet helps with that. If the port uses `PORTEPOCH` it is mandatory to add it to the `<range>` tag.
ru: Проверить, имеет ли порт `PORTEPOCH`. Приведённый выше фрагмент скрипта помогает в этом. Если порт использует `PORTEPOCH`, обязательно добавить его в тег `<range>`.

source: Double check ranges. In the case of ranges limited on both sides, make sure that the `<ge>` and `<lt>` elements are inside the same `<range>` tag. Otherwise the entry might end up defining an overlapping range.
ru: Перепроверьте диапазоны. В случае диапазонов, ограниченных с обеих сторон, убедитесь, что элементы `<ge>` и `<lt>` находятся внутри одного тега `<range>`. В противном случае запись может определить перекрывающийся диапазон.

source: Cross-check derivatives. Check whether derivatives or forks of the project included in the ports tree are also affected. For example, if a vulnerability is discovered in package:www/firefox[], assess whether derivatives like package:www/librewolf[], package:www/waterfox[] or other similar projects share the same vulnerability. Include all affected derivatives in the VuXML entry, ensuring that users of these ports are informed. Also check if there are Linux versions of the same port in the tree. For instance, package:databases/sqlite3[] vulnerabilities most likely affect packages like package:databases/linux-c7-sqlite3[] too.
ru: Проверка производных версий. Если в вышестоящем проекте обнаружена уязвимость, проверьте, затронуты ли также производные или форки проекта, включённые в дерево портов. Например, если уязвимость обнаружена в package:www/firefox[], оцените, есть ли такая же уязвимость в производных, таких как package:www/librewolf[], package:www/waterfox[] или других подобных проектах. Включите все затронутые производные в запись VuXML, чтобы пользователи этих портов были проинформированы. Также проверьте наличие Linux-версий этого порта в дереве. Например, уязвимости в package:databases/sqlite3[] скорее всего затрагивают и пакеты вроде package:databases/linux-c7-sqlite3[].

source: Do not commit an entry without running `make validate` first.
ru: Не делайте коммит записи, не запустив сначала `make validate`.
