<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY date "$FreeBSD: www/fr/releases/4.3R/errata.sgml,v 1.4 2005/10/06 12:56:08 blackend Exp $">
<!ENTITY title "Errata pour FreeBSD 4.3">
<!ENTITY % navinclude.download "INCLUDE">
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.18

  Version francaise : Guillaume Pauchet <gpauchet@greengroom.com>
-->

<html>
&header;

<pre>
Si vous ne lisez aucune autre documentation avant l'installation de
cette version de FreeBSD, nous vous conseillons n&eacute;anmoins de
*LIRE CET ERRATA* afin de vous &eacute;viter de bloquer sur certains
probl&egrave;mes d&eacute;j&agrave; rencontr&eacute;s et corrig&eacute;s. Ce fichier ERRATA.TXT
est par d&eacute;finition obsol&egrave;te, c'est pourquoi d'autres copies mises
&agrave; jour sont disponibles sur le net et peuvent &ecirc;tre consult&eacute;es
dans la rubrique "current errata" pour votre version de FreeBSD.
Ces copies sont disponibles via les liens ci-dessous :

  1. <a href="http://www.FreeBSD.org/releases/">http://www.FreeBSD.org/releases/</a>

  2. ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/&lt;your-release&gt;/ERRATA.TXT
     (ainsi que sur les sites miroirs mis &agrave; jour).

Toute modification de ce fichier est &eacute;galement automatiquement envoy&eacute;e
par courrier &eacute;lectronique &agrave; :

	<a href="mailto:freebsd-current@FreeBSD.org">freebsd-current@FreeBSD.org</a>

Pour les conseils sur la s&eacute;curit&eacute;, consultez :

	<a href="http://www.FreeBSD.org/security/">http://www.FreeBSD.org/security/</a>

pour les derni&egrave;res informations sur les incidents de s&eacute;curit&eacute;.

---- Bulletins sur la S&eacute;curit&eacute; :

La vuln&eacute;rabilit&eacute; document&eacute;e dans l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:39 a &eacute;t&eacute;
fix&eacute;e dans la version 4.3. La note de version mentionnait ce correctif
mais ne faisait pas &eacute;tat de son descriptif.

Une vuln&eacute;rabilit&eacute; dans les routines fts(3) (utilis&eacute;es par les applications pour
parcourir de fa&ccedil;on r&eacute;cursive un syst&egrave;me de fichiers) pouvait permettre &agrave; un programme d'agir
sur des fichiers en dehors de l'arborescence sp&eacute;cifi&eacute;e. Ce bug, ainsi que le
correctif, sont d&eacute;crits dans l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:40.

Un d&eacute;faut permettait &agrave; certains signaux de rester actifs au sein d'un processus
enfant apr&egrave;s avoir &eacute;t&eacute; lanc&eacute; (par "exec") par son parent. Un hacker pouvait
executer du code dans le contexte d'un binaire setuid. Plus de
d&eacute;tails, ainsi qu'un correctif, sont d&eacute;crits dans l'avis de s&eacute;curit&eacute;
FreeBSD-SA-01:42.

Un d&eacute;bordement de la m&eacute;moire tampon dans tcpdump(1) pouvait &ecirc;tre d&eacute;clench&eacute; &agrave;
distance par l'envoi de certains paquets &agrave; une machine cible. Plus de d&eacute;tails,
ainsi qu'un correctif, sont d&eacute;crits dans l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:48.

Un d&eacute;bordement de la m&eacute;moire tampon dans telnetd(8) pouvait permettre l'ex&eacute;cution de code
sur une machine cible. Plus de d&eacute;tails, ainsi qu'un correctif, sont d&eacute;crits
dans l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:49.

Une vuln&eacute;rabilit&eacute; par laquelle un hacker pouvait &eacute;puiser &agrave; distance les buffers
r&eacute;seaux d'une machine cible &agrave; &eacute;t&eacute; corrig&eacute;e. Plus de d&eacute;tails, ainsi qu'un
correctif, sont d&eacute;crits dans l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:52.

Un d&eacute;faut existait dans ipfw(8), les r&egrave;gles de filtre "me" correspondaient
&agrave; l'adresse IP distante d'une interface point &agrave; point en plus de
l'adresse IP locale voulue. Plus de d&eacute;tails, ainsi qu'un correctif, sont
d&eacute;crits dans l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:53.

Une faille dans procfs(5) permettait &agrave; un processus de lire des informations
sensibles dans l'espace m&eacute;moire d'un autre processus. Pour plus de d&eacute;tails, ainsi
que des informations sur les correctifs, consultez l'avis de s&eacute;curit&eacute;
FreeBSD-SA-01:55.

La v&eacute;rification PARANOID des noms d'h&ocirc;tes dans tcp_wrappers ne fonctionnait pas
correctement. Pour plus de d&eacute;tails ainsi que des informations sur les correctifs,
consultez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:56.

sendmail(8) a une vuln&eacute;rabilit&eacute; "root" locale. Pour plus de d&eacute;tails, ainsi
que des informations sur le correctif, consultez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:57.

lpd(8) contient une faille de d&eacute;bordement m&eacute;moire exploitable &agrave; distance. Pour plus
de d&eacute;tails, ainsi qu'un correctif pour ce probl&egrave;me, consultez l'avis de s&eacute;curit&eacute;
FreeBSD-SA-01:58.

rmuser(8) poss&eacute;de un bug qui rend, de fa&ccedil;on br&egrave;ve, le fichier
/etc/master.passwd lisible par tout le monde. Pour plus de d&eacute;tails, ainsi que les
moyens de contourner ce probl&egrave;me, consultez l'avis de s&eacute;curit&eacute; FreeBSD-SA-01:59.

---- Informations sur la mise &agrave; jour du Syst&egrave;me :

La note de version contient une erreur sur la commande &agrave; executer pour charger
le driver de la carte son ESS Maestro-3/Allegro via le fichier /boot/loader.conf.
La commande correcte est :

	snd_maestro3_load="YES"

ssh(1) n'est plus en SUID root. La premi&egrave;re implication de ce changement
est que l'authentification par le fichier .shosts peut ne plus fonctionner.
Les correctifs temporaires et permanents sont d&eacute;crits dans la FAQ suivante :

	<a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/faq/admin.html#SSH-SHOSTS">http://www.freebsd.org/doc/en_US.ISO8859-1/books/faq/admin.html#SSH-SHOSTS</a>

</pre>
<p></p><a href="../index.html">Accueil Versions</a>
&footer;
</body>
</html>
