Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/see-also/_index.po
Languages: pt_br, ru

source: More information about the FreeBSD Documentation Project
pt_br: Mais informações sobre o Projeto de Documentação do FreeBSD
ru: Дополнительная информация о проекте документации FreeBSD

source: Chapter 14. See Also
pt_br: Capítulo 14. Veja também

source: See Also
pt_br: Veja também
ru: Смотрите также

source: This document is deliberately not an exhaustive discussion of AsciiDoc and the FreeBSD Documentation Project. For more information about these, you are encouraged to see the following web sites.
pt_br: Este documento não é deliberadamente uma discussão exaustiva de AsciiDoc e o Projeto de Documentação do FreeBSD. Para mais informações sobre estes, você é encorajado a consultar os seguintes sites.
ru: Этот документ намеренно не является исчерпывающим обсуждением AsciiDoc и проекта документации FreeBSD. Для получения дополнительной информации о них рекомендуется посетить следующие веб-сайты.

source: The FreeBSD Documentation Project
pt_br: O projeto de documentação do FreeBSD
ru: Проект документации FreeBSD

source: link:https://www.FreeBSD.org/docproj/[The FreeBSD Documentation Project web pages]
pt_br: link:https://www.FreeBSD.org/docproj/[As Páginas Web do Projeto de Documentação do FreeBSD]
ru: link:https://www.FreeBSD.org/docproj/[Веб-страницы проекта документации FreeBSD]

source: extref:{handbook}[The FreeBSD Handbook]
pt_br: extref:{handbook}[O Handbook do FreeBSD]
ru: extref:{handbook}[Руководство по FreeBSD]

source: link:https://gohugo.io/documentation/[Hugo documentation]
pt_br: link:https://gohugo.io/documentation/[Documentação Hugo]
ru: link:https://gohugo.io/documentation/[Документация Hugo]

source: link:https://docs.asciidoctor.org/[AsciiDoctor Documentation Portal]
pt_br: link:https://docs.asciidoctor.org/[Portal de Documentação do AsciiDoctor]
ru: link:https://docs.asciidoctor.org/[Документационный портал AsciiDoctor]

source: link:http://www.w3.org/[The World Wide Web Consortium]
pt_br: link:http://www.w3.org/[O Consórcio World Wide Web]
ru: link:http://www.w3.org/[Консорциум Всемирной паутины]

source: link:https://dev.w3.org/html5/spec-LC/[The HTML 5 specification]
pt_br: link:https://dev.w3.org/html5/spec-LC/[A especificação HTML 5]
ru: link:https://dev.w3.org/html5/spec-LC/[Спецификация HTML 5]

source: link:https://www.w3.org/Style/CSS/specs.en.html[CSS specification]
pt_br: link:https://www.w3.org/Style/CSS/specs.en.html[A especificação CSS]
ru: link:https://www.w3.org/Style/CSS/specs.en.html[Спецификация CSS]

source: Chapter 15. See Also
ru: Глава 15. Смотрите также
