Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-releng/_index.po
Languages: ru

source: For the first `ALPHA` build, the `BRANCH` value in [.filename]#sys/conf/newvers.sh# needs to be changed from `CURRENT` to `ALPHA1`. For subsequent `ALPHA` builds, increment each `ALPHA__N__` value by one.
ru: Для первой сборки `ALPHA` значение `BRANCH` в [.filename]#sys/conf/newvers.sh# необходимо изменить с `CURRENT` на `ALPHA1`. Для последующих сборок `ALPHA` увеличивайте каждое значение `ALPHA__N__` на единицу.

source: See crossref:freebsd-releng[releng-building, Building FreeBSD Installation Media] for information on building the `ALPHA` images.
ru: См. crossref:freebsd-releng[releng-building, Сборка установочных носителей FreeBSD] для получения информации о сборке образов `ALPHA`.

source: Creating the {branchStablex} Branch
ru: Создание ветки {branchStablex}

source: When creating the {branchStable} branch, several changes are required in both the new {branchStable} branch and the {branchHead} branch. The files listed are relative to the repository root. To create the new {branchStablex} branch in Git:
ru: При создании ветки {branchStable} необходимо внести несколько изменений как в новой ветке {branchStable}, так и в ветке {branchHead}. Указанные файлы относятся к корню репозитория. Чтобы создать новую ветку {branchStablex} в Git:

source: Make sure that you are in the {branchHead} branch
ru: Убедитесь, что вы находитесь в ветке {branchHead}

source: Once the {branchStablex} branch has been created, make the following edits:
ru: После создания ветки {branchStablex} внесите следующие изменения:

source: Update the FreeBSD version, and remove the notice about `WITNESS`
ru: Обновите версию FreeBSD и удалите уведомление о `WITNESS`

source: Uncomment `-DNDEBUG`
ru: Раскомментируйте `-DNDEBUG`

source: Remove debugging support
ru: Удалите поддержку отладки

source: Update `SRCBRANCH`
ru: Обновите `SRCBRANCH`

source: Remove these kernel configurations
ru: Удалите следующие параметры конфигурации ядра

source: Remove debugging options
ru: Удалите отладочные опции

source: Update the `BRANCH` value to reflect `BETA1`
ru: Обновите значение `BRANCH`, чтобы оно соответствовало `BETA1`

source: Move `REPRODUCIBLE_BUILD` from `\__DEFAULT_NO_OPTIONS` to `__DEFAULT_YES_OPTIONS`
ru: Переместите `REPRODUCIBLE_BUILD` из `\__DEFAULT_NO_OPTIONS` в `__DEFAULT_YES_OPTIONS`

source: Move `LLVM_ASSERTIONS` from `\__DEFAULT_YES_OPTIONS` to `__DEFAULT_NO_OPTIONS`
ru: Переместите `LLVM_ASSERTIONS` из `\__DEFAULT_YES_OPTIONS` в `__DEFAULT_NO_OPTIONS`

source: Set `dumpdev` from `AUTO` to `NO` (it is configurable via for those that want it enabled by default)
ru: Установите `dumpdev` с `AUTO` на `NO` (это настраивается для тех, кто хочет включить его по умолчанию)

source: Remove the `debug.witness.trace` entries
ru: Удалите записи `debug.witness.trace`

source: Then in the {branchHead} branch, which will now become a new major version:
ru: Затем в ветке {branchHead}, которая теперь станет новой основной версией:

source: Update the FreeBSD version
ru: Обновите версию FreeBSD

source: Update the `BRANCH` value to reflect `CURRENT`, and increment `REVISION`
ru: Обновите значение `BRANCH`, чтобы оно соответствовало `CURRENT`, и увеличьте `REVISION`

source: Update `TARGET_TRIPLE` and `MACHINE_TRIPLE`
ru: Обновите `TARGET_TRIPLE` и `MACHINE_TRIPLE`

source: Update `__FreeBSD_version`
ru: Обновите `__FreeBSD_version`

source: Update `FBSD_MAJOR` and `FBSD_CC_VER`
ru: Обновите `FBSD_MAJOR` и `FBSD_CC_VER`

source: Append the `freebsdversion.h` section
ru: Добавьте раздел `freebsdversion.h`

source: Update the value of `OS_VERSION`
ru: Обновите значение `OS_VERSION`

source: Update `FREEBSD_CC_VERSION`
ru: Обновите `FREEBSD_CC_VERSION`

source: Update `LLD_REVISION_STRING`
ru: Обновите `LLD_REVISION_STRING`

source: Update `LIB32CPUFLAGS`
ru: Обновите `LIB32CPUFLAGS`

source: Release from {branchStable}
ru: Выпуск релиза от {branchStable}

source: This section describes the general procedures of the FreeBSD release cycle from an extablished {branchStable} branch.
ru: Этот раздел описывает общие процедуры цикла выпуска FreeBSD из установленной ветки {branchStable}.

source: FreeBSD `stable` Branch Code Slush
ru: Мягкая заморозка кода ветки `stable` FreeBSD

source: In preparation for the code freeze on a `stable` branch, several files need to be updated to reflect the release cycle is officially in progress. These files are all relative to the top-most level of the stable branch:
ru: В рамках подготовки к заморозке кода в ветке `stable` необходимо обновить несколько файлов, чтобы отразить официальное начало цикла выпуска. Эти файлы находятся в корневом каталоге ветки stable:

source: Update the `BRANCH` value to reflect `PRERELEASE`
ru: Обновите значение `BRANCH`, чтобы отразить `PRERELEASE`

source: Update `TARGET_TRIPLE`
ru: Обновите `TARGET_TRIPLE`

source: Update `OS_VERSION`
ru: Обновите `OS_VERSION`

source: FreeBSD `BETA` Builds
ru: Сборки FreeBSD `BETA`

source: Following the code slush, the next phase of the release cycle is the code freeze. This is the point at which all commits to the stable branch require explicit approval from the {teamRe}. This is enforced by {git-admin-email} who handles the repository.
ru: После периода мягкой заморозки следующая фаза цикла выпуска — это заморозка кода. На этом этапе все коммиты в стабильную ветку требуют явного одобрения от {teamRe}. Это контролируется {git-admin-email}, который управляет репозиторием.

source: There are two general exceptions to requiring commit approval during the release cycle. The first is any change that needs to be committed by the Release Engineer to proceed with the day-to-day workflow of the release cycle, the other is security fixes that may occur during the release cycle.
ru: Существует два общих исключения, когда не требуется подтверждение коммита во время цикла выпуска. Первое — любые изменения, которые необходимо закоммитить инженеру выпуска для продолжения ежедневной работы цикла выпуска. Второе — исправления безопасности, которые могут возникнуть во время цикла выпуска.

source: Once the code freeze is in effect, the next build from the branch is labeled `BETA1`. This is done by updating the `BRANCH` value in [.filename]#sys/conf/newvers.sh# from `PRERELEASE` to `BETA1`.
ru: После вступления в силу заморозки кода следующая сборка из ветки помечается как `BETA1`. Это делается путём изменения значения `BRANCH` в файле [.filename]#sys/conf/newvers.sh# с `PRERELEASE` на `BETA1`.

source: Once this is done, the first set of `BETA` builds are started. Subsequent `BETA` builds do not require updates to any files other than [.filename]#sys/conf/newvers.sh#, incrementing the `BETA` build number.
ru: После этого начинается первая сборка `BETA`. Последующие сборки `BETA` не требуют обновления каких-либо файлов, кроме [.filename]#sys/conf/newvers.sh#, с увеличением номера сборки `BETA`.

source: Creating the {branchRelengx} Branch
ru: Создание ветки {branchRelengx}

source: When the first `RC` (Release Candidate) build is ready to begin, the {branchReleng} branch is created. This is a multi-step process that must be done in a specific order, to avoid anomalies such as overlaps with `__FreeBSD_version` values, for example. The paths listed below are relative to the repository root. The order of commits and what to change are:
ru: Когда первая сборка `RC` (Release Candidate) готова к началу, создается ветка {branchReleng}. Это многоэтапный процесс, который должен выполняться в определенном порядке, чтобы избежать аномалий, таких как пересечения значений `__FreeBSD_version`, например. Указанные ниже пути относятся к корню репозитория. Порядок коммитов и что нужно изменить:

source: Make sure that you are in the {branchStablex} branch
ru: Убедитесь, что вы находитесь в ветке {branchStablex}

source: Change `BETA__X__` to `RC1`
ru: Измените `BETA__X__` на `RC1`

source: Move `REPRODUCIBLE_BUILD` from `__DEFAULT_NO_OPTIONS` to `__DEFAULT_YES_OPTIONS`
ru: Переместите `REPRODUCIBLE_BUILD` из `__DEFAULT_NO_OPTIONS` в `__DEFAULT_YES_OPTIONS`

source: Replace `latest` with `quarterly` as the default package repository location
ru: Замените `latest` на `quarterly` в качестве расположения репозитория пакетов по умолчанию

source: Update `BETA__X__` with `PRERELEASE`
ru: Обновите `BETA__X__` на `PRERELEASE`

source: Then, {git-admin-email} adds new approvers for the releng branch as did for the stable branch.
ru: Затем {git-admin-email} добавляет новых утверждающих для ветки releng, как это было сделано для ветки stable.

source: Now that two new `__FreeBSD_version` values exist, also update [.filename]#~/documentation/content/en/books/porters-handbook/versions/chapter.adoc# in the Documentation Project repository.
ru: Теперь, когда существуют два новых значения `__FreeBSD_version`, также обновите файл [.filename]#~/documentation/content/en/books/porters-handbook/versions/chapter.adoc# в репозитории проекта документации.

source: After the first `RC` build has completed and tested, the {branchStable} branch can be "thawed" by {git-admin-email}.
ru: После завершения первой сборки `RC` и её тестирования ветку {branchStable} можно «разморозить» с помощью {git-admin-email}.

source: Following the availability of the first `RC`, {teamBugmeister} should be emailed to add the new FreeBSD `-RELEASE` to the `versions` available in the drop-down menu shown in the bug tracker.
ru: После появления первой версии `RC` необходимо отправить письмо команде {teamBugmeister}, чтобы добавить новую версию FreeBSD `-RELEASE` в список `versions`, доступный в выпадающем меню трекера ошибок.

source: Building FreeBSD Installation Media
ru: Создание установочных носителей FreeBSD

source: This section describes the general procedures producing FreeBSD development snapshots and releases.
ru: Этот раздел описывает общие процедуры создания снимков разработки и выпусков FreeBSD.

source: Release Build Scripts
ru: Скрипты сборки релизов

source: Prior to FreeBSD 9.0-RELEASE, [.filename]#src/release/Makefile# was updated to support , and the [.filename]#src/release/generate-release.sh# script was introduced as a wrapper to automate invoking the targets.
ru: До выхода FreeBSD 9.0-RELEASE файл [.filename]#src/release/Makefile# был обновлен для поддержки , а скрипт [.filename]#src/release/generate-release.sh# был добавлен в качестве обертки для автоматизации вызова целей.

source: Prior to FreeBSD 9.2-RELEASE, [.filename]#src/release/release.sh# was introduced, which heavily based on [.filename]#src/release/generate-release.sh# included support to specify configuration files to override various options and environment variables. Support for configuration files provided support for cross building each architecture for a release by specifying a separate configuration file for each invocation.
ru: До выхода FreeBSD 9.2-RELEASE был представлен [.filename]#src/release/release.sh#, который, основываясь на [.filename]#src/release/generate-release.sh#, включал поддержку указания конфигурационных файлов для переопределения различных опций и переменных окружения. Поддержка конфигурационных файлов обеспечила возможность кросс-сборки каждого архитектурного варианта для релиза путем указания отдельного конфигурационного файла для каждого вызова.

source: As a brief example of using [.filename]#src/release/release.sh# to build a single release in [.filename]#/scratch#:
ru: В качестве краткого примера использования [.filename]#src/release/release.sh# для сборки одного релиза в [.filename]#/scratch#:

source: As a brief example of using [.filename]#src/release/release.sh# to build a single, cross-built release using a different target directory, create a custom [.filename]#release.conf# containing:
ru: В качестве краткого примера использования [.filename]#src/release/release.sh# для сборки единого кросс-собранного выпуска с использованием другого целевого каталога, создайте пользовательский [.filename]#release.conf#, содержащий:

source: Then invoke [.filename]#src/release/release.sh# as:
ru: Затем выполните [.filename]#src/release/release.sh# следующим образом:

source: See and [.filename]#src/release/release.conf.sample# for more details and example usage.
ru: См. [.filename]#src/release/release.conf.sample# для получения дополнительных сведений и примеров использования.

source: Building FreeBSD Releases
ru: Сборка релизов FreeBSD

source: During the release cycle, a copy of [.filename]#CHECKSUM.SHA512# and [.filename]#CHECKSUM.SHA256# for each architecture are stored in the {teamRe} internal repository in addition to being included in the various announcement emails. Each [.filename]#MANIFEST# containing the hashes of [.filename]#base.txz#, [.filename]#kernel.txz#, etc. are added to package:misc/freebsd-release-manifests[] in the Ports Collection, as well.
ru: В течение цикла выпуска копии файлов [.filename]#CHECKSUM.SHA512# и [.filename]#CHECKSUM.SHA256# для каждой архитектуры сохраняются во внутреннем репозитории {teamRe}, а также включаются в различные рассылки с объявлениями. Каждый файл [.filename]#MANIFEST#, содержащий хеши [.filename]#base.txz#, [.filename]#kernel.txz# и других, также добавляется в пакет package:misc/freebsd-release-manifests[] в Коллекции портов.

source: In preparation for the release build, several files need to be updated:
ru: В подготовке к сборке выпуска необходимо обновить несколько файлов:

source: Update the `BRANCH` value to `RELEASE`
ru: Обновите значение `BRANCH` на `RELEASE`

source: Add the anticipated announcement date
ru: Добавьте предполагаемую дату объявления

source: Replace `__FreeBSD_version` with the value in [.filename]#sys/sys/param.h#
ru: Замените `__FreeBSD_version` на значение из [.filename]#sys/sys/param.h#

source: After building the final `RELEASE`, the {branchRelengx} branch is tagged as {tagReleasex} using the revision from which the `RELEASE` was built. Similar to creating the {branchStablex} and {branchRelengx} branches, this is done with `git tag`. From the repository root:
ru: После сборки окончательного `RELEASE`, ветка {branchRelengx} помечается как {tagReleasex}, используя ревизию, из которой был собран `RELEASE`. Аналогично созданию веток {branchStablex} и {branchRelengx}, это делается с помощью `git tag`. Из корня репозитория:

source: Make sure that you are in the {branchRelengx} branch
ru: Убедитесь, что вы находитесь в ветке {branchRelengx}

source: Publishing FreeBSD Installation Media to Project Mirrors
ru: Публикация установочных носителей FreeBSD на зеркалах проекта

source: This section describes the procedure to publish FreeBSD development snapshots and releases to the Project mirrors.
ru: Этот раздел описывает процедуру публикации снимков разработки FreeBSD и выпусков на зеркала Проекта.

source: Staging FreeBSD Installation Media Images
ru: Подготовка образов установочных носителей FreeBSD

source: Staging FreeBSD snapshots and releases is a two part process:
ru: Этап подготовки (staging) снимков и выпусков FreeBSD — это двухэтапный процесс:

source: Creating the directory structure to match the hierarchy on `ftp-master`
ru: Создание структуры каталогов, соответствующей иерархии на `ftp-master`

source: If `EVERYTHINGISFINE` is defined in the build configuration files, [.filename]#main.conf# in the case of the build scripts referenced above, this happens automatically in the after the build is complete, creating the directory structure in [.filename]#${DESTDIR}/R/ftp-stage# with a path structure matching what is expected on `ftp-master`. This is equivalent to running the following in the directly:
ru: Если `EVERYTHINGISFINE` определено в конфигурационных файлах сборки, [.filename]#main.conf# в случае скриптов сборки, упомянутых выше, это происходит автоматически после завершения сборки, создавая структуру каталогов в [.filename]#${DESTDIR}/R/ftp-stage# с путями, соответствующими ожидаемым на `ftp-master`. Это эквивалентно выполнению следующего в директории:

source: After each architecture is built, [.filename]#thermite.sh# will rsync the [.filename]#${DESTDIR}/R/ftp-stage# from the build to [.filename]#/snap/ftp/snapshots# or [.filename]#/snap/ftp/releases# on the build host, respectively.
ru: После сборки каждой архитектуры скрипт [.filename]#thermite.sh# выполнит синхронизацию [.filename]#${DESTDIR}/R/ftp-stage# с билда в директории [.filename]#/snap/ftp/snapshots# или [.filename]#/snap/ftp/releases# на хосте сборки, соответственно.

source: Copying the files to a staging directory on `ftp-master` before moving the files into [.filename]#pub/# to begin propagation to the Project mirrors
ru: Копирование файлов в промежуточный каталог на `ftp-master` перед перемещением файлов в [.filename]#pub/# для начала распространения на зеркала Проекта

source: Once all builds have finished, [.filename]#/snap/ftp/snapshots#, or [.filename]#/snap/ftp/releases# for a release, is polled by `ftp-master` using rsync to [.filename]#/archive/tmp/snapshots# or [.filename]#/archive/tmp/releases#, respectively.
ru: После завершения всех сборок каталог [.filename]#/snap/ftp/snapshots# (или [.filename]#/snap/ftp/releases# для релиза) опрашивается `ftp-master`-ом с использованием rsync для передачи в [.filename]#/archive/tmp/snapshots# или [.filename]#/archive/tmp/releases#, соответственно.

source: On `ftp-master` in the FreeBSD Project infrastructure, this step requires `root` level access, as this step must be executed as the `archive` user.
ru: На `ftp-master` в инфраструктуре проекта FreeBSD этот шаг требует доступа уровня `root`, так как он должен выполняться от имени пользователя `archive`.

source: Publishing FreeBSD Installation Media
ru: Публикация установочных носителей FreeBSD

source: Once the images are staged in [.filename]#/archive/tmp/#, they are ready to be made public by putting them in [.filename]#/archive/pub/FreeBSD#. To reduce propagation time, is used to create hard links from [.filename]#/archive/tmp# to [.filename]#/archive/pub/FreeBSD#.
ru: Как только образы размещены в [.filename]#/archive/tmp/#, они готовы к публикации путем размещения в [.filename]#/archive/pub/FreeBSD#. Для уменьшения времени распространения используются жесткие ссылки из [.filename]#/archive/tmp# в [.filename]#/archive/pub/FreeBSD#.

source: For this to be effective, both [.filename]#/archive/tmp# and [.filename]#/archive/pub# must reside on the same logical filesystem.
ru: Для эффективной работы и [.filename]#/archive/tmp#, и [.filename]#/archive/pub# должны находиться в одной логической файловой системе.

source: There is a caveat, however, where rsync must be used after to correct the symbolic links in [.filename]#pub/FreeBSD/snapshots/ISO-IMAGES# which will replace with a hard link, increasing the propagation time.
ru: Однако есть оговорка: после этого необходимо использовать rsync для исправления символических ссылок в [.filename]#pub/FreeBSD/snapshots/ISO-IMAGES#, которые будут заменены на жёсткие ссылки, что увеличит время распространения.

source: As with the staging steps, this requires `root` level access, as this step must be executed as the `archive` user.
ru: Как и на этапе подготовки, это требует доступа уровня `root`, так как данный шаг должен быть выполнен от имени пользователя `archive`.

source: As the `archive` user:
ru: Как пользователь `archive`:

source: Replace _snapshots_ with _releases_ as appropriate.
ru: Замените _снимки_ на _релизы_ там, где это уместно.

source: Wrapping up the Release Cycle
ru: Завершение цикла выпуска

source: This section describes general post-release tasks.
ru: Этот раздел описывает общие задачи после выпуска.

source: Post-Release Errata Notices
ru: Уведомления об исправлениях после выпуска

source: As the release cycle approaches conclusion, it is common to have several EN (Errata Notice) candidates to address issues that were discovered late in the cycle. Following the release, the {teamRe} and the {teamSecteam} revisit changes that were not approved prior to the final release, and depending on the scope of the change in question, may issue an EN.
ru: По мере приближения цикла выпуска к завершению часто появляются несколько кандидатов в EN (Errata Notice — уведомления об ошибках) для устранения проблем, обнаруженных на поздних этапах цикла. После выпуска {teamRe} и {teamSecteam} пересматривают изменения, которые не были одобрены до финального выпуска, и, в зависимости от масштаба рассматриваемого изменения, могут выпустить EN.

source: The actual process of issuing ENs is handled by the {teamSecteam}.
ru: Фактический процесс выпуска EN обрабатывается командой {teamSecteam}.

source: To request an Errata Notice after a release cycle has completed, a developer should fill out the https://www.freebsd.org/security/errata-template.txt[Errata Notice template], in particular the `Background`, `Problem Description`, `Impact`, and if applicable, `Workaround` sections.
ru: Для запроса уведомления об ошибке после завершения цикла выпуска разработчик должен заполнить https://www.freebsd.org/security/errata-template.txt[шаблон уведомления об ошибке], в частности разделы `Предыстория`, `Описание проблемы`, `Последствия` и, если применимо, `Обходное решение`.

source: The completed Errata Notice template should be emailed together with either a patch against the {branchReleng} branch or a list of revisions from the {branchStable} branch.
ru: Заполненный шаблон уведомления об ошибке следует отправить по электронной почте вместе с патчем для ветки {branchReleng} или списком ревизий из ветки {branchStable}.

source: For Errata Notice requests immediately following the release, the request should be emailed to both the {teamRe} and the {teamSecteam}. Once the {branchReleng} branch has been handed over to the {teamSecteam} as described in crossref:freebsd-releng[releng-wrapup-handoff, Handoff to the {teamSecteam}], Errata Notice requests should be sent to the {teamSecteam}.
ru: Для запросов на уведомления об ошибках (Errata Notice), поступающих сразу после выпуска, запрос следует отправлять по электронной почте как в {teamRe}, так и в {teamSecteam}. После того как ветка {branchReleng} передана {teamSecteam}, как описано в crossref:freebsd-releng[releng-wrapup-handoff, Передача {teamSecteam}], запросы на уведомления об ошибках следует направлять в {teamSecteam}.

source: Handoff to the {teamSecteam}
ru: Передача в {teamSecteam}

source: Roughly two weeks following the release, the Release Engineer updates the Git repository changing the approver from the Release engineering team to the security officer for the {branchRelengx} branch.
ru: Примерно через две недели после выпуска релиза инженер по релизам обновляет репозиторий Git, изменяя утверждающего с команды инженеров по релизам на офицера безопасности для ветки `{branchRelengx}`.

source: Release End-of-Life
ru: Конец срока поддержки выпуска

source: This section describes the website-related files to update when a release reaches EoL (End-of-Life).
ru: Этот раздел описывает файлы, связанные с веб-сайтом, которые необходимо обновить, когда выпуск достигает EoL (End-of-Life).

source: Website Updates for End-of-Life
ru: Обновления веб-сайта для прекращения поддержки

source: When a release reaches End-of-Life, references to that release should be removed and/or updated on the website:
ru: Когда выпуск достигает конца жизненного цикла, ссылки на этот выпуск должны быть удалены и/или обновлены на веб-сайте:

source: File
ru: Файл

source: Remove `u-relXXX-announce` and `u-relXXX-announce` references.
ru: Удалите ссылки на `u-relXXX-announce` и `u-relXXX-announce`.

source: Move the `u-relXXX-*` variables from the supported release list to the Legacy Releases list.
ru: Переместите переменные `u-relXXX-*` из списка поддерживаемых выпусков в список Устаревших выпусков.
