Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-releng/_index.po
Languages: ru

source: Describes the approach used by the FreeBSD release engineering team to make production quality releases of the FreeBSD Operating System. It describes the tools available for those interested in producing customized FreeBSD releases for corporate rollouts or commercial productization
ru: Описывает подход, используемый командой разработки релизов FreeBSD для создания релизов операционной системы FreeBSD производственного качества. В нем описаны инструменты, доступные тем, кто заинтересован в создании настраиваемых релизов FreeBSD для корпоративного внедрения или коммерческой продуктивизации

source: FreeBSD Release Engineering
ru: Подготовка релизов FreeBSD

source: Abstract
ru: Аннотация

source: This article describes the release engineering process of the FreeBSD Project.
ru: В этой статье описывается процесс разработки релизов проекта FreeBSD.

source: Introduction to the FreeBSD Release Engineering Process
ru: Введение в процесс разработки релизов FreeBSD

source: Development of FreeBSD has a very specific workflow. In general, all changes to the FreeBSD base system are committed to the {branchHead} branch, which reflects the top of the source tree.
ru: Разработка FreeBSD следует очень специфичному рабочему процессу. В общем случае все изменения в базовой системе FreeBSD вносятся в ветку {branchHead}, которая отражает вершину дерева исходного кода.

source: After a reasonable testing period, changes can then be merged to the {branchStable} branches. The default minimum timeframe before merging to {branchStable} branches is three (3) days.
ru: После достаточного периода тестирования изменения могут быть объединены в ветки {branchStable}. Минимальный срок по умолчанию перед объединением в ветки {branchStable} составляет три (3) дня.

source: Although a general rule to wait a minimum of three days before merging from {branchHead}, there are a few special circumstances where an immediate merge may be necessary, such as a critical security fix, or a bug fix that directly inhibits the release build process.
ru: Хотя общее правило предписывает выждать минимум три дня перед слиянием из {branchHead}, существуют особые обстоятельства, при которых может потребоваться немедленное слияние, например, критическое исправление безопасности или исправление ошибки, напрямую блокирующей процесс сборки выпуска.

source: After several months, and the number of changes in the {branchStable} branch have grown significantly, it is time to release the next version of FreeBSD. These releases have been historically referred to as "point" releases.
ru: Через несколько месяцев, когда количество изменений в ветке {branchStable} значительно увеличилось, наступает время выпуска следующей версии FreeBSD. Исторически такие выпуски называются релизами "с точкой".

source: In between releases from the {branchStable} branches, approximately every two (2) years, a release will be cut directly from {branchHead}. These releases have been historically referred to as "dot-zero" releases.
ru: Между выпусками из ветвей {branchStable}, примерно каждые два (2) года, выпуск будет создаваться напрямую из {branchHead}. Исторически такие выпуски назывались выпуском «точка-ноль (dot-zero)».

source: This article will highlight the workflow and responsibilities of the {teamRe} for both "dot-zero" and "point"' releases.
ru: Эта статья освещает рабочий процесс и обязанности команды {teamRe} как для выпуска "точка-ноль", так и для "промежуточных" выпусков.

source: The following sections of this article describe:
ru: Следующие разделы этой статьи описывают:

source: crossref:freebsd-releng[releng-prep, General Information and Preparation]
ru: crossref:freebsd-releng[releng-prep, Общая информация и подготовка]

source: General information and preparation before starting the release cycle.
ru: Общая информация и подготовка перед началом цикла выпуска.

source: crossref:freebsd-releng[releng-website, Website Changes During the Release Cycle]
ru: crossref:freebsd-releng[releng-website, Изменения на веб-сайте в течение цикла выпуска]

source: Website Changes During the Release Cycle
ru: Изменения на веб-сайте в течение цикла выпуска

source: crossref:freebsd-releng[releng-terms, Release Engineering Terminology]
ru: crossref:freebsd-releng[releng-terms, Терминология выпуска релизов]

source: Terminology and general information, such as the "code slush" and "code freeze", used throughout this document.
ru: Терминология и общая информация, такие как "мягкая заморозка кода (code slush)" и "заморозка кода (code freeze)", используемые в этом документе.

source: crossref:freebsd-releng[releng-head, Release from {branchHead}]
ru: crossref:freebsd-releng[releng-head, Выпуск релиза от {branchHead}]

source: The Release Engineering process for a "dot-zero" release.
ru: Процесс Release Engineering для релиза "точка-ноль".

source: crossref:freebsd-releng[releng-stable, Release from {branchStable}]
ru: crossref:freebsd-releng[releng-stable, Выпуск релиза от {branchStable}]

source: The Release Engineering process for a "point" release.
ru: Процесс Release Engineering для "точечного" выпуска.

source: crossref:freebsd-releng[releng-building, Building FreeBSD Installation Media]
ru: crossref:freebsd-releng[releng-building, Создание установочных носителей FreeBSD]

source: Information related to the specific procedures to build installation medium.
ru: Информация, относящаяся к конкретным процедурам создания установочного носителя.

source: crossref:freebsd-releng[releng-mirrors, Publishing FreeBSD Installation Media to Project Mirrors]
ru: crossref:freebsd-releng[releng-mirrors, Публикация установочных носителей FreeBSD на зеркалах проекта]

source: Procedures to publish installation medium.
ru: Процедуры публикации установочного носителя.

source: crossref:freebsd-releng[releng-wrapup, Wrapping up the Release Cycle]
ru: crossref:freebsd-releng[releng-wrapup, Завершение цикла выпуска]

source: Wrapping up the release cycle.
ru: Завершение цикла выпуска.

source: General Information and Preparation
ru: Общая информация и подготовка

source: Approximately two months before the start of the release cycle, the {teamRe} decides on a schedule for the release. The schedule includes the various milestone points of the release cycle, such as freeze dates, branch dates, and build dates. For example:
ru: Примерно за два месяца до начала цикла выпуска команда {teamRe} определяет график выпуска. График включает в себя различные этапы цикла выпуска, такие как даты заморозки, даты ветвления и даты сборки. Например:

source: Milestone
ru: Веха

source: Anticipated Date
ru: Предполагаемая дата

source: {branchHead} slush:
ru: мягкая заморозка {branchHead}:

source: {branchHead} freeze:
ru: заморозка {branchHead}:

source: {branchHead} KBI freeze:
ru: заморозка {branchHead} KBI:

source: `doc/` tree slush [1]:
ru: мягкая заморозка дерева `doc/` [1]:

source: Ports quarterly branch [2]:
ru: Ежеквартальная ветка Ports [2]:

source: {branchStablex} branch:
ru: Ветка {branchStablex}:

source: BETA1 build starts:
ru: Начало сборки BETA1:

source: {branchHead} thaw:
ru: Разморозка {branchHead}:

source: BETA2 build starts:
ru: Сборка BETA2 начинается:

source: BETA3 build starts [*]:
ru: Сборка BETA3 начинается [*]:

source: {branchRelengx} branch:
ru: Ветка `{branchRelengx}`:

source: RC1 build starts:
ru: Сборка RC1 начинается:

source: {branchStablex} thaw:
ru: Разморозка {branchStablex}:

source: RC2 build starts:
ru: Сборка RC2 начинается:

source: Final Ports package builds [4]:
ru: Окончательные сборки пакетов Ports [4]:

source: Ports release tag:
ru: Метка релиза портов:

source: August 12, 2016
ru: 12 августа 2016

source: RC3 build starts [*]:
ru: Сборка RC3 начинается [*]:

source: RELEASE build starts:
ru: Сборка RELEASE начинается:

source: RELEASE announcement:
ru: Объявление о ВЫПУСКЕ:

source: Items marked with "[*]" are "as needed".
ru: Отметка "[*]" у элементов означает "по мере необходимости".

source: The `doc/` tree slush is coordinated by the {teamDoceng}.
ru: Мягкая заморозка дерева `doc/` координируется командой {teamDoceng}.

source: The Ports quarterly branch used is determined by when the final `RC` build is planned. A new quarterly branch is created on the first day of the quarter, so this metric should be used when taking the release cycle milestones into account. The quarterly branch is created by the {teamPortmgr}.
ru: Используемая квартальная ветка Ports определяется по дате запланированной окончательной сборки `RC`. Новая квартальная ветка создаётся в первый день квартала, поэтому этот показатель следует учитывать, принимая во внимание этапы цикла выпуска. Квартальная ветка создаётся командой {teamPortmgr}.

source: The `doc/` tree is tagged by the {teamDoceng}.
ru: Для дерева исходного кода `doc/` tag делается командой {teamDoceng}.

source: The final Ports package build is done by the {teamPortmgr} after the final (or what is expected to be final) `RC` build.
ru: Окончательная сборка пакета Ports выполняется командой {teamPortmgr} после финальной (или ожидаемой финальной) сборки `RC`.

source: If the release is being created from an existing {branchStable} branch, the KBI freeze date can be excluded, since the KBI is already considered frozen on established {branchStable} branches.
ru: Если выпуск создаётся из существующей ветки {branchStable}, дату заморозки KBI можно исключить, так как KBI уже считается замороженным в устоявшихся ветках {branchStable}.

source: When writing the release cycle schedule, a number of things need to be taken into consideration, in particular milestones where the target date depends on predefined milestones upon which there is a dependency. For example, the Ports Collection release tag originates from the active quarterly branch at the time of the last `RC`. This in part defines which quarterly branch is used, when the release tag can happen, and what revision of the ports tree is used for the final `RELEASE` build.
ru: При написании графика цикла выпуска необходимо учитывать ряд факторов, особенно этапы, на которые целевая дата зависит от предопределенных этапов, от которых существует зависимость. Например, тег выпуска коллекции портов берется из активной квартальной ветки на момент последнего `RC`. Это частично определяет, какая квартальная ветка используется, когда может быть создан тег выпуска и какая версия дерева портов используется для финальной сборки `RELEASE`.

source: After general agreement on the schedule, the {teamRe} emails the schedule to the FreeBSD Developers.
ru: После общего согласования расписания команда {teamRe} отправляет расписание разработчикам FreeBSD по электронной почте.

source: It is somewhat typical that many developers will inform the {teamRe} about various works-in-progress. In some cases, an extension for the in-progress work will be requested, and in other cases, a request for "blanket approval" to a particular subset of the tree will be made.
ru: Вполне типично, что многие разработчики сообщают команде {teamRe} о различных работах в процессе выполнения. В некоторых случаях может быть запрошено продление для работы в процессе, а в других случаях может быть сделан запрос на "общее одобрение" для определенного подмножества дерева.

source: When such requests are made, it is important to make sure timelines (even if estimated) are discussed. For blanket approvals, the length of time for the blanket approval should be made clear. For example, a FreeBSD developer may request blanket approvals from the start of the code slush until the start of the `RC` builds.
ru: При таких запросах важно убедиться, что обсуждаются сроки (даже если они приблизительные). Для общих одобрений следует четко указать продолжительность действия такого одобрения. Например, разработчик FreeBSD может запросить общее одобрение с начала периода мягкой заморозки кода до начала сборок `RC`.

source: To keep track of blanket approvals, the {teamRe} uses an internal repository to keep a running log of such requests, which defines the area upon which a blanket approval was granted, the author(s), when the blanket approval expires, and the reason the approval was granted. One example of this is granting blanket approval to [.filename]#release/doc/# to all {teamRe} members until the final `RC` to update the release notes and other release-related documentation.
ru: Для отслеживания общих одобрений команда {teamRe} использует внутренний репозиторий, в котором ведется журнал таких запросов. В нем указывается область, на которую распространяется общее одобрение, автор(ы), срок действия одобрения и причина его выдачи. Например, может быть предоставлено общее одобрение для [.filename]#release/doc/# всем членам {teamRe} до финального `RC` для обновления примечаний к выпуску и другой связанной с выпуском документации.

source: The {teamRe} also uses this repository to track pending approval requests that are received just prior to starting various builds during the release cycle, which the Release Engineer specifies the cutoff period with an email to the FreeBSD developers.
ru: Команда {teamRe} также использует этот репозиторий для отслеживания ожидающих одобрения запросов, полученных непосредственно перед началом различных сборок во время цикла выпуска, при этом Инженер по выпускам указывает срок отсечки с помощью электронного письма разработчикам FreeBSD.

source: Depending on the underlying set of code in question, and the overall impact the set of code has on FreeBSD as a whole, such requests may be approved or denied by the {teamRe}.
ru: В зависимости от рассматриваемого набора кода и общего влияния этого набора кода на FreeBSD в целом, такие запросы могут быть одобрены или отклонены командой {teamRe}.

source: The same applies to work-in-progress extensions. For example, in-progress work for a new device driver that is otherwise isolated from the rest of the tree may be granted an extension. A new scheduler, however, may not be feasible, especially if such dramatic changes do not exist in another branch.
ru: То же самое относится к расширениям для незавершённых работ. Например, незавершённая работа над новым драйвером устройства, который в остальном изолирован от остального дерева, может получить расширение. Однако новый планировщик может оказаться неосуществимым, особенно если такие значительные изменения отсутствуют в другой ветке.

source: The schedule is also added to the Project website, in the `doc/` repository, in [.filename]#~/website/content/en/releases/{branchRevision}R/schedule.adoc#. This file is continuously updated as the release cycle progresses.
ru: Расписание также добавляется на сайт проекта в репозитории `doc/`, в файле [.filename]#~/website/content/en/releases/{branchRevision}R/schedule.adoc#. Этот файл постоянно обновляется по мере прохождения цикла выпуска.

source: In most cases, the [.filename]#schedule.adoc# can be copied from a prior release and updated accordingly.
ru: В большинстве случаев файл [.filename]#schedule.adoc# можно скопировать из предыдущего релиза и обновить соответствующим образом.

source: In addition to adding [.filename]#schedule.adoc# to the website, [.filename]#~/shared/releases.adoc# is also updated to add the link to the schedule to various subpages, as well as enabling the link to the schedule on the Project website index page.
ru: В дополнение к добавлению [.filename]#schedule.adoc# на веб-сайт, файл [.filename]#~/shared/releases.adoc# также обновляется, чтобы добавить ссылку на расписание на различные подстраницы, а также включить ссылку на расписание на главной странице веб-сайта проекта.

source: The schedule is also linked from [.filename]#~/website/content/en/releng/_index.adoc#.
ru: Расписание также доступно по ссылке из файла [.filename]#~/website/content/en/releng/_index.adoc#.

source: Approximately one month prior to the scheduled "code slush", the {teamRe} sends a reminder email to the FreeBSD Developers.
ru: Примерно за месяц до запланированной "мягкой заморозки кода" команда {teamRe} отправляет напоминание разработчикам FreeBSD.

source: Release Engineering Terminology
ru: Терминология выпуска релизов

source: This section describes some of the terminology used throughout the rest of this document.
ru: В этом разделе описана часть терминологии, используемой в остальной части данного документа.

source: The Code Slush
ru: Мягкая заморозка кода

source: Although the code slush is not a hard freeze on the tree, the {teamRe} requests that bugs in the existing code base take priority over new features.
ru: Хотя мягкая заморозка кода не является полной заморозкой дерева, команда {teamRe} просит отдавать приоритет исправлению ошибок в существующей кодовой базе перед добавлением новых функций.

source: The code slush does not enforce commit approvals to the branch.
ru: Мягкая заморозка кода не требует подтверждений коммитов в ветку.

source: The Code Freeze
ru: Заморозка кода

source: The code freeze marks the point in time where all commits to the branch require explicit approval from the {teamRe}.
ru: Замораживание кода означает момент времени, когда все коммиты в ветку требуют явного одобрения от {teamRe}.

source: The FreeBSD Git repository contains several hooks to perform sanity checks before any commit is actually committed to the tree. One of these hooks will evaluate if committing to a particular branch requires specific approval.
ru: Репозиторий FreeBSD Git содержит несколько хуков для выполнения проверок перед тем, как изменения будут зафиксированы в дереве. Один из этих хуков проверяет, требуются ли специальные разрешения для фиксации изменений в определённой ветке.

source: To enforce commit approvals by the {teamRe}, the Release Engineering Team must approve any changes to the branch, in which case the commit log must include an `Approved by: re (login)` line, where "login" is the login ID of the approver.
ru: Для обеспечения утверждения коммитов командой {teamRe}, команда Release Engineering должна утверждать любые изменения в ветке. В этом случае журнал коммитов должен содержать строку `Approved by: re (логин)`, где "логин" — это идентификатор утверждающего.

source: During the code freeze, FreeBSD committers are urged to follow the link:https://wiki.freebsd.org/Releng/ChangeRequestGuidelines[Change Request Guidelines].
ru: Во время заморозки кода участники проекта FreeBSD должны следовать link:https://wiki.freebsd.org/Releng/ChangeRequestGuidelines[Рекомендациям по запросам изменений].

source: The KBI/KPI Freeze
ru: Замораживание KBI/KPI

source: KBI/KPI stability implies that the caller of a function across two different releases of software that implement the function results in the same end state. The caller, whether it is a process, thread, or function, expects the function to operate in a certain way, otherwise the KBI/KPI stability on the branch is broken.
ru: KBI/KPI стабильность подразумевает, что вызов функции в двух разных релизах программного обеспечения, реализующего эту функцию, приводит к одинаковому конечному состоянию. Вызывающая сторона, будь то процесс, поток или функция, ожидает, что функция будет работать определённым образом, в противном случае стабильность KBI/KPI на ветке нарушается.

source: This section describes the changes to the website that should occur as the release cycle progresses.
ru: Этот раздел описывает изменения на веб-сайте, которые должны происходить по мере развития цикла выпуска.

source: The files specified throughout this section are relative to the `{branchHead}` branch of the `doc` repository.
ru: Файлы, указанные в этом разделе, относятся к ветке `{branchHead}` репозитория `doc`.

source: Website Changes Before the Release Cycle Begins
ru: Изменения на веб-сайте перед началом цикла выпуска

source: When the release cycle schedule is available, these files need to be updated to enable different functionalities on the FreeBSD Project website:
ru: Когда график цикла выпуска становится доступным, эти файлы необходимо обновить, чтобы включить различные функции на веб-сайте проекта FreeBSD:

source: File to Edit
ru: Файл для редактирования

source: What to Change
ru: Что изменить

source: Change `beta-upcoming` from `IGNORE` to `INCLUDE`
ru: Изменить `beta-upcoming` с `IGNORE` на `INCLUDE`

source: Change `beta-testing` from `IGNORE` to `INCLUDE`
ru: Изменить `beta-testing` с `IGNORE` на `INCLUDE`

source: Website Changes During `BETA` or `RC`
ru: Изменения на веб-сайте в период `BETA` или `RC`

source: When transitioning from `PRERELEASE` to `BETA`, these files need to be updated to enable the "Help Test" block on the download page. All files are relative to [.filename]#head/# in the `doc` repository:
ru: При переходе от `PRERELEASE` к `BETA` эти файлы необходимо обновить, чтобы включить блок "Help Test (Помогите протестировать)" на странице загрузки. Все файлы указаны относительно [.filename]#head/# в репозитории `doc`:

source: Update `betarel-vers` to `BETA__1__`
ru: Обновите `betarel-vers` до `BETA__1__`

source: Add an entry announcing the `BETA`
ru: Добавьте запись, объявляющую о `BETA`

source: Add the new `BETA`, `RC`, or final `RELEASE` to the template
ru: Добавьте новую `BETA`, `RC` или финальную `RELEASE` в шаблон

source: Once the {branchRelengx} branch is created, the various release-related documents need to be added to the `doc/` repository.
ru: После создания ветки {branchRelengx} необходимо добавить различные документы, связанные с выпуском, в репозиторий `doc/`.

source: The relevant release-related documents exist in the [.filename]#doc# repository for FreeBSD 12.x and later.
ru: Соответствующие документы, связанные с выпусками, находятся в репозитории [.filename]#doc# для FreeBSD 12.x и более поздних версий.

source: Ports Changes During `BETA`, `RC`, and the Final `RELEASE`
ru: Изменения в портах во время `BETA`, `RC` и финального `RELEASE`

source: For each build during the release cycle, the `MANIFEST` files containing the `SHA256` of the various distribution sets, such as `base.txz`, `kernel.txz`, and so on, are added to the package:misc/freebsd-release-manifests[] port. This allows utilities other than , such as package:ports-mgmt/poudriere[], to safely use these distribution sets by providing a mechanism through which the checksums can be verified.
ru: Для каждой сборки в течение цикла выпуска файлы `MANIFEST`, содержащие `SHA256` для различных наборов дистрибутива, таких как `base.txz`, `kernel.txz` и других, добавляются в порт package:misc/freebsd-release-manifests[]. Это позволяет другим утилитам, кроме , таким как package:ports-mgmt/poudriere[], безопасно использовать эти наборы дистрибутива, предоставляя механизм для проверки контрольных сумм.

source: Release from {branchHead}
ru: Выпуск релиза от {branchHead}

source: This section describes the general procedures of the FreeBSD release cycle from the {branchHead} branch.
ru: Этот раздел описывает общие процедуры цикла выпуска FreeBSD из ветки {branchHead}.

source: FreeBSD "`ALPHA`" Builds
ru: FreeBSD "`ALPHA`" сборки

source: Starting with the FreeBSD 10.0-RELEASE cycle, the notion of "`ALPHA`" builds was introduced. Unlike the `BETA` and `RC` builds, `ALPHA` builds are not included in the FreeBSD Release schedule.
ru: Начиная с цикла выпуска FreeBSD 10.0-RELEASE, было введено понятие сборок "`ALPHA`". В отличие от сборок `BETA` и `RC`, сборки `ALPHA` не включены в график выпуска FreeBSD.

source: The idea behind `ALPHA` builds is to provide regular FreeBSD-provided builds before the creation of the {branchStable} branch.
ru: Идея сборок `ALPHA` заключается в предоставлении регулярных сборок FreeBSD до создания ветки {branchStable}.

source: FreeBSD `ALPHA` snapshots should be built approximately once a week.
ru: Снимки состояния `ALPHA` FreeBSD должны собираться примерно раз в неделю.
