Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-releng/_index.po
Languages: ru

source: Update the appropriate releng branch to reflect the branch is no longer supported.
ru: Обновите соответствующую ветку releng, чтобы отразить, что ветка больше не поддерживается.

source: Remove the branch from the supported branch list.
ru: Удалить ветку из списка поддерживаемых веток.

source: Add the branch to the unsupported branch list.
ru: Добавить ветку в список неподдерживаемых веток.

source: Remove the URLs for the release.
ru: Удалите URL-адреса для выпуска.

source: Remove references to the release and releng branch.
ru: Удалите ссылки на ветку release и releng.
