<!--
      The FreeBSD Documentation Project
      The FreeBSD French Documentation Project

      $FreeBSD$
      $Id: article.sgml,v 1.7 2004-05-09 15:17:48 gioria Exp $
      Original revision: 1.497
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN">
%freebsd;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR">
%abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR">
%artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR">
%translators;
<!ENTITY % newsgroups PUBLIC "-//FreeBSD//ENTITIES DocBook Newsgroup Entities//FR">
%newsgroups;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//FR">
%mailing-lists;
<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//FR"> %trademarks;
<!ENTITY % not.published "IGNORE">
]>

<article lang="fr">
  <articleinfo>
    <title>Collaborer &agrave; FreeBSD</title>

    <pubdate>$FreeBSD$</pubdate>

    <abstract>
      <para>Cet article d&eacute;crit les diff&eacute;rentes mani&egrave;res
	pour une personne individuelle ou une organisation de collaborer au
	projet FreeBSD.</para>
      &abstract.license;
      &abstract.disclaimer;
      &trans.a.fonvieille;
      <para><emphasis>Premi&egrave;re version de &a.fr.dntt;</emphasis>
    </abstract>

    <authorgroup>
      <author>
	<firstname>Jordan</firstname>
	<surname>Hubbard</surname>
	<contrib>Contribution de </contrib>
      </author>
    </authorgroup>
	<legalnotice id="trademarks" role="trademarks">
	&tm-attrib.freebsd;
	&tm-attrib.ieee;
	&tm-attrib.general;
	</legalnotice>
  </articleinfo>

  <indexterm><primary>collaborer</primary></indexterm>

  <para>Alors, comme &ccedil;a vous voulez collaborer &agrave; FreeBSD?
    C'est g&eacute;nial!  FreeBSD <emphasis>s'appuie</emphasis> sur les
    contributions de sa base d'utilisateurs pour survivre.  Vos
    contributions ne sont pas seulement appr&eacute;ci&eacute;es, elles
    sont vitales pour la constante progression de FreeBSD.</para>

  <para>Contrairement &agrave; ce que certains pourraient vous faire croire,
    vous n'avez pas besoin d'&ecirc;tre un expert programmeur ou un ami proche
    de l'&eacute;quipe principale de FreeBSD pour avoir vos contributions
    accept&eacute;es.  Un grand nombre, toujours en augmentation, de
    collaborateurs &agrave; travers le monde, dont les &acirc;ges et l'expertise
    technique sont tr&egrave;s variables, d&eacute;veloppent FreeBSD.  Il y a
    toujours plus de travail &agrave; faire que de personnes disponibles pour
    s'en occuper, et davantage d'aide est toujours
    appr&eacute;ci&eacute;e.</para>

  <para>Le projet FreeBSD est responsable de tout l'environnement du
    syst&egrave;me d'exploitation, et pas seulement d'un noyau ou de quelques
    utilitaires &eacute;parpill&eacute;s.  Ainsi, nos listes
    <filename>TODO</filename> (&agrave; faire) s'&eacute;tendent sur une
    large gamme de t&acirc;ches: depuis la documentation, les
    b&eacute;ta-tests et la pr&eacute;sentation, jusqu'&agrave;
    l'installateur syst&egrave;me et des types de d&eacute;veloppement du noyau
    hautement sp&eacute;cialis&eacute;s.  Des personnes de n'importe quel
    niveau de comp&eacute;tence, dans presque tous les domaines, pourront
    s&ucirc;rement aider le projet.</para>

  <para>Les entit&eacute;s commerciales engag&eacute;es dans des entreprises
    relatives &agrave; FreeBSD sont &eacute;galement encourag&eacute;es
    &agrave; nous contacter.  Vous avez besoin d'une extension
    sp&eacute;ciale pour faire fonctionner votre produit?  Vous nous
    trouverez r&eacute;ceptif &agrave; vos requ&ecirc;tes, du
    moment quelles ne sont pas trop exotiques.  Vous travaillez sur un
    produit &agrave; valeur ajout&eacute;e?  Faites-le nous savoir!
    Nous serons peut &ecirc;tre en mesure de coop&eacute;rer sur certains
    aspects.  Le monde du logiciel libre va &agrave; l'encontre de
    nombreuses id&eacute;es re&ccedil;ues sur la mani&egrave;re dont les
    logiciels sont d&eacute;velopp&eacute;s, vendus, et maintenus, et
    nous vous invitons &agrave; lui donner au moins un second regard.</para>

  <sect1 id="contrib-what">
    <title>Les besoins</title>
    
    <para>La liste suivante de t&acirc;ches et de sous-projets
      repr&eacute;sente une sorte d'amalgame des diff&eacute;rentes listes
      <filename>TODO</filename> et des demandes d'utilisateurs.</para>

    <sect2 id="non-programmer-tasks">
      <title>T&acirc;ches de non-programmeur</title>

      <para>De nombreuses personnes impliqu&eacute;es dans FreeBSD ne sont pas
	des programmeurs.  Le projet comprend des r&eacute;dacteurs de
	documentation, des concepteurs de site web, et des personnes
	assurant le support.  La contribution de ces personnes se
	mat&eacute;rialise sous la forme d'un investissement en temps et
	une volont&eacute; d'apprendre.</para>

      <orderedlist>
	<listitem>
	  <para>Lisez la FAQ et le Manuel r&eacute;guli&egrave;rement.
	    Si quelque chose est mal expliqu&eacute;e, pas &agrave; jour ou tout
	    simplement compl&egrave;tement faux, signalez-le nous.  Mieux,
	    envoyez nous un correctif (le SGML n'est pas difficile &agrave;
	    apprendre, mais il n'y aucune objection &agrave; des soumissions en
	    format ASCII).</para>
	</listitem>

	<listitem>
	  <para>Aidez &agrave; traduire la documentation FreeBSD dans
	    votre langue.  Si la documentation existe d&eacute;j&agrave;
	    dans votre langue, vous pouvez aider &agrave; traduire des
	    documents suppl&eacute;mentaires ou contr&ocirc;ler que les
	    traductions sont &agrave; jour.  Consultez tout d'abord la <ulink
	    url="../../books/fdp-primer/translations.html">FAQ sur les
	    traductions</ulink> dans l'Introduction au Projet de
	    Documentation de FreeBSD.  Notez que vous ne vous engagez
	    pas &agrave; traduire chacun des documents FreeBSD ce faisant
	    &mdash; en tant que volontaire, vous pouvez faire autant que
	    vous le d&eacute;sirez.  Une fois que quelqu'un commence &agrave;
	    traduire, presque toujours d'autres personnes rejoindront
	    l'effort.  Si vous n'avez le temps et l'&eacute;nergie pour ne
	    traduire qu'une partie de la documentation, traduisez les
	    instructions d'installation.</para>
	</listitem>

	<listitem>
	  <para>Lisez la &a.questions; et le
	    &ng.misc; de temps en temps (ou m&ecirc;me
	    r&eacute;guli&egrave;rement).  Il peut &ecirc;tre tr&egrave;s
	    gratifiant de partager son exp&eacute;rience et d'aider les
	    gens &agrave; r&eacute;soudre leurs probl&egrave;mes; parfois
	    vous pourrez m&ecirc;me apprendre quelque chose
	    de nouveau!  Ces forums peuvent &ecirc;tre &eacute;galement
	    une source d'id&eacute;es sur ce qu'il faut am&eacute;liorer.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2 id="ongoing-programmer-tasks">
      <title>T&acirc;ches de programmeur</title>
        <para>La plupart des t&acirc;ches list&eacute;es ici n&eacute;cessitent
	  soit un investissement consid&eacute;rable en temps, soit une
	  connaissance en profondeur du noyau, ou les deux.  Cependant,
	  il y a &eacute;galement de nombreuses t&acirc;ches utiles pour les
	  &ldquo;programmeurs occasionnels&rdquo;.</para>

      <orderedlist>
	<listitem>
	  <para>Si vous utilisez FreeBSD-CURRENT et que vous avez une
	    bonne connexion Internet, il existe une machine <hostid
	    role="fqdn">current.FreeBSD.org</hostid> qui compile une
	    version compl&egrave;te une fois par jour&mdash;&agrave;
	    chaque fois, essayez d'installer la derni&egrave;re version
	    et rapportez toutes les erreurs durant le processus.</para>
	</listitem>

	<listitem>
	  <para>Lisez la &a.bugs;.  Il peut y
	    avoir un probl&egrave;me que vous pouvez commenter de mani&egrave;re
	    constructive ou avec des correctifs que vous pouvez tester.
	    Ou vous pourrez m&ecirc;me tenter de corriger un de ces
	    probl&egrave;mes vous-m&ecirc;me.</para>
	</listitem>

	<listitem>
	  <para>Si vous connaissez un correctif qui a &eacute;t&eacute;
	    appliqu&eacute; avec succ&egrave;s sur la branche -CURRENT
	    mais qui n'a pas &eacute;t&eacute; int&eacute;gr&eacute;
	    dans la branche -STABLE apr&egrave;s un intervalle de temps
	    raisonnable (normalement quelques semaines), envoyez au
	    responsable un rappel poli.</para>
	</listitem>

	<listitem>
	  <para>D&eacute;placer des contributions logiciels vers
	    <filename>src/contrib</filename> dans l'arborescence des
	    sources.</para>
	</listitem>

	<listitem>
	  <para>Assurez vous que le code dans
	    <filename>src/contrib</filename> est &agrave; jour.</para>
	</listitem>

	<listitem>
	  <para>Compiler l'arbre des sources (ou une partie) avec tous
	    les messages d'avertissements activ&eacute;s et corriger les
	    avertissements.</para>
	</listitem>

	<listitem>
	  <para>Corriger les avertissements pour les logiciels port&eacute;s
	    qui font des choses obsol&egrave;tes comme utiliser
	    <function>gets()</function> ou inclure
	    <filename>malloc.h</filename>.</para>
	</listitem>

	<listitem>
	  <para>Si vous avez collabor&eacute; &agrave; un des logiciels
	    port&eacute;s, envoyez vos correctifs &agrave; leur auteur
	    original (cela vous rendra la vie plus facile lors de la sortie
	    de la prochaine version).</para>
	</listitem>

	<listitem>
	  <para>R&eacute;cup&eacute;rer des copies de normes pr&eacute;cises
	    comme &posix;.  Vous pouvez trouver des liens sur ces normes sur
	    le site du <ulink
	    url="http://www.FreeBSD.org/projects/c99/index.html">Projet
	    FreeBSD de conformit&eacute; aux normes C99 et POSIX</ulink>.
	    Comparer le comportement de FreeBSD avec celui requis par la
	    norme.  Si le comportement diff&egrave;re, en particulier pour des
	    &eacute;l&eacute;ments subtiles et obscures de la
	    sp&eacute;cification, envoyez un rapport de bogue &agrave; ce
	    sujet.  Si vous en &ecirc;tes capable, d&eacute;terminez comment
	    le corriger et joignez un correctif &agrave;
	    votre rapport de bogue.  Si vous pensez que la norme est
	    erron&eacute;e, demandez &agrave; l'organisme de normalisation de
	    consid&eacute;rer la question.</para>
	</listitem>

	<listitem>
	  <para>Sugg&eacute;rer d'autres t&acirc;ches pour cette liste!</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>Travailler avec la base de donn&eacute;es des rapports de
	bogue (PR)</title>

      <indexterm><primary>base de donn&eacute;es des rapports de
	bogue</primary></indexterm>

      <para>La <ulink
	url="http://www.FreeBSD.org/cgi/query-pr-summary.cgi">liste des
	PRs de FreeBSD</ulink> donne tous les rapports de probl&egrave;me
	actuellement actifs et les demandes d'am&eacute;lioration qui ont
	&eacute;t&eacute; soumis par les utilisateurs de FreeBSD.  La base
	de donn&eacute;es des PRs comprend des t&acirc;ches de programmeurs
	et de non-programmeurs.
	Consultez les PRs ouverts, et voyez s'il y a quelque chose qui
	peut vous int&eacute;resser.  Certaines de ces t&acirc;ches peuvent
	&ecirc;tre des t&acirc;ches tr&egrave;s simples qui ne
	n&eacute;cessitent qu'une paire d'yeux suppl&eacute;mentaire pour
	v&eacute;rifier et confirmer que le correctif dans
	le PR est correct.  D'autres peuvent &ecirc;tre bien plus complexes,
	ou pourront m&ecirc;me ne pas inclure de correctif du tout.</para>

      <para>Commencez avec des PRs qui n'ont pas &eacute;t&eacute;
	assign&eacute;s &agrave; quelqu'un d'autre.  Si le PR est
	assign&eacute; &agrave; quelqu'un d'autre, mais qu'il
	semble que c'est quelque chose dont vous pouvez vous charger,
	envoyez un courrier &eacute;lectronique &agrave; la personne en
	question et demandez si vous pouvez travailler dessus&mdash;elle
	pourra d&eacute;j&agrave; avoir un correctif pr&ecirc;t &agrave;
	&ecirc;tre test&eacute;, ou des id&eacute;es
	suppl&eacute;mentaires sur lesquelles vous pourrez discuter.</para>
    </sect2>
  </sect1>

  <sect1 id="contrib-how">
    <title>Comment participer</title>

    <para>Les contributions au syst&egrave;me tombent g&eacute;n&eacute;ralement
      dans une ou plusieurs des 5 cat&eacute;gories suivantes:</para>

    <sect2 id="contrib-general">
      <title>Rapport de bogue et commentaires g&eacute;n&eacute;raux</title>

      <para>Une id&eacute;e ou une suggestion d'int&eacute;r&ecirc;t technique
	<emphasis>g&eacute;n&eacute;ral</emphasis> devrait &ecirc;tre
	envoy&eacute;e &agrave; la &a.hackers;.  De m&ecirc;me, les
	personnes int&eacute;ress&eacute;es par de
	telles choses (et qu'un <emphasis>grand</emphasis> volume de
	courrier &eacute;lectronique ne d&eacute;range pas) devraient
	s'abonner &agrave; la &a.hackers; en envoyant un
	courrier &eacute;lectronique &agrave; &a.majordomo;.  Voir le <ulink
	url="../../books/handbook/eresources.html#ERESOURCES-MAIL">Manuel
	FreeBSD</ulink> pour plus d'information &agrave; ce propos et sur
	les autres listes de diffusion.</para>

      <para>Si vous trouvez un bogue ou que vous soumettez une
	modification sp&eacute;cifique, rapportez-le en utilisant le programme
	&man.send-pr.1; ou son <ulink
	url="../../../../send-pr.html">&eacute;quivalent web</ulink>.  Essayez
	de remplir chaque champ du rapport de bogue.  A moins qu'ils ne
	d&eacute;passent 65KO, inclure tous les correctifs directement dans le
	rapport.  Si le correctif peut &ecirc;tre appliqu&eacute; directement
	sur l'arbre des sources ajoutez <literal>[PATCH]</literal> dans le
	synopsis du rapport.  Quand vous ajoutez des correctifs,
	<emphasis>ne pas</emphasis> utiliser le copier-coller car ce
	dernier transforme les tabulations en espaces et rend les
	correctifs inutilisables.  Pensez &agrave; compresser les correctifs et
	&agrave; utiliser  &man.uuencode.1; s'ils d&eacute;passent 20KO.</para>

      <para>Apr&egrave;s avoir rempli un rapport, vous devriez recevoir une
	confirmation accompagn&eacute;e d'un num&eacute;ro de suivi.
	Conservez ce num&eacute;ro de suivi afin que vous puissiez nous
	soumettre plus de d&eacute;tails au sujet du probl&egrave;me en
	envoyant un courrier &eacute;lectronique &agrave;
	<email>FreeBSD-gnats-submit@FreeBSD.ORG</email>.
	Utilisez le num&eacute;ro comme sujet du message, e.g. <literal>"Re:
	kern/3377"</literal>.  Toute information suppl&eacute;mentaire sur un
	rapport de bogue devrait &ecirc;tre soumise de cette
	mani&egrave;re.</para>

      <para>Si vous ne recevez aucune confirmation dans un temps
	raisonnable (de 3 jours &agrave; une semaine, en fonction de votre
	connexion pour le courrier &eacute;lectronique) ou qu'il vous est,
	pour quelque raison que ce soit, impossible d'utiliser la
	commande &man.send-pr.1;, vous pouvez demander &agrave; quelqu'un de le
	faire pour vous en envoyant un courrier &eacute;lectronique &agrave; la
	&a.bugs;.</para>

      <para>Voir aussi <ulink
  	URL="../../articles/problem-reports/article.html">cet
  	article</ulink> sur comment &eacute;crire de bon rapports de
	bogue.</para>
    </sect2>

    <sect2>
      <title>Modifications de la documentation</title>

      <indexterm><primary>soumissions concernant la
	documentation</primary></indexterm>

      <para>Les modifications de la documentation sont supervis&eacute;es par
	la &a.doc;.  Veuillez consulter l'<ulink
	url="../../books/fdp-primer/index.html">Introduction au Projet
	de Documentation de FreeBSD</ulink> pour des instructions
	compl&egrave;tes.  Envoyez les soumissions et les modifications
	(m&ecirc;me les plus petites sont les bienvenues!) en utilisant la
	commande <command>send-pr</command> comme d&eacute;crit dans <link
	linkend="contrib-general">Rapport de bogue et commentaires
	g&eacute;n&eacute;raux</link>.</para>
    </sect2>

    <sect2>
      <title>Modifications dans le code source existant</title>

      <indexterm><primary>FreeBSD-CURRENT</primary></indexterm>

      <para>Un ajout ou une modification du code source existant est une
	toute autre affaire et d&eacute;pend beaucoup de comment est &agrave;
	jour votre version par rapport &agrave; l'&eacute;tat courant du
	d&eacute;veloppement de FreeBSD. Il y a une version sp&eacute;ciale
	de FreeBSD, connue sous le nom de &ldquo;FreeBSD-CURRENT&rdquo; qui
	est disponible de diverses mani&egrave;res pour le confort des
	d&eacute;veloppeurs qui travaillent activement sur le syst&egrave;me.
	Voir le <ulink url="../../books/handbook/current-stable.html">Manuel
	FreeBSD</ulink> pour plus d'informations sur la mani&egrave;re
	d'obtenir et d'utiliser FreeBSD-CURRENT.</para>

      <para>Travailler sur des sources plus anciennes signifie que
	malheureusement parfois vos modifications pourront &ecirc;tre trop
	obsol&egrave;tes ou trop divergentes pour permettre une
	r&eacute;int&eacute;gration ais&eacute;e dans FreeBSD.  On peut
	limiter ce type de changements en souscrivant &agrave; la
	&a.announce; et la  &a.current;, o&ugrave; des
	discussions sur l'&eacute;tat courant du syst&egrave;me ont lieu.</para>

      <para>En supposant que vous pouvez vous arranger pour avoir de
	mani&egrave;re sure des sources &agrave; jour comme base pour vos
	modifications, l'&eacute;tape suivante est de produire un ensemble de
	diffs &agrave; envoyer &agrave; ceux qui sont charg&eacute;s de
	maintenir FreeBSD.
	Cela est fait &agrave; l'aide de la commande &man.diff.1;.</para>

      <para>Le format &man.diff.1; pr&eacute;ferr&eacute; pour
	soumettre des correctifs est le format unifi&eacute;
	g&eacute;n&eacute;r&eacute; par la commande
	<command>diff -u</command>.  Cependant, pour des correctifs qui
	modifient sensiblement une partie du code, le format de contexte
	g&eacute;n&eacute;r&eacute; par <command>diff -c</command>
	peut s'av&eacute;rer plus lisible et donc
	pr&eacute;f&eacute;rable.</para>

      <indexterm>
        <primary><command>diff</command></primary>
      </indexterm>

      <para>Par exemple:</para>

      <para>
	<screen>&prompt.user; <userinput>diff -c oldfile newfile</userinput></screen>

	ou

	<screen>&prompt.user; <userinput>diff -c -r olddir newdir</userinput></screen>

	g&eacute;n&eacute;rera un ensemble de &ldquo;context diffs&rdquo;
	pour un fichier source ou une hi&eacute;rarchie de r&eacute;pertoires
	donn&eacute;s.</para>

      <para>De m&ecirc;me,
        <screen>&prompt.user; <userinput>diff -u oldfile newfile</userinput></screen>
        ou
        <screen>&prompt.user; <userinput>diff -u -r olddir newdir</userinput></screen>

        effectuera la m&ecirc;me chose, mais dans le format unifi&eacute;.</para>

      <para>Voir la page de manuel de &man.diff.1; pour plus de
	d&eacute;tails.</para>

      <para>Une fois que vous avez un ensemble de diffs (que vous pouvez
	tester avec la commande &man.patch.1;), vous devrez les
	soumettre pour qu'ils puissent &ecirc;tre inclus dans FreeBSD.
	Utiliser le programme &man.send-pr.1; comme d&eacute;crit dans
	<link linkend="contrib-general">Rapport de bogue et commentaires
	g&eacute;n&eacute;raux</link>.  <emphasis>Ne pas</emphasis> simplement
	envoyez les diffs &agrave; la &a.hackers; ou ils seront perdus!
	Nous appr&eacute;cions &eacute;norm&eacute;ment votre soumission
	(c'est un projet fait par des volontaires!), mais parce que nous sommes
	tr&egrave;s occup&eacute;s, nous ne pourrons pas les &eacute;tudier
	imm&eacute;diatement, mais cela restera dans la base de donn&eacute;es
	des PRs jusqu'&agrave; ce que nous le fassions.  Identifiez
	votre soumission en ajoutant <literal>[PATCH]</literal>
	dans le synopsis du rapport.</para>

      <indexterm>
        <primary><command>uuencode</command></primary>
      </indexterm>

      <para>Si cela vous semble appropri&eacute; (e.g. vous avez
	ajout&eacute;, effac&eacute; ou renomm&eacute; des fichiers),
	archivez vos modifications dans un
	fichier <command>tar</command> et lancez le programme
	&man.uuencode.1; dessus.  Les archives &man.shar.1;
	sont aussi les bienvenues.</para>

      <para>Si votre modification est de nature potentiellement
	sensible, e.g. si vous n'&ecirc;tes pas s&ucirc;r des
	probl&egrave;mes de copyright concernant sa distribution ou que
	vous n'&ecirc;tes tout simplement pas pr&ecirc;t &agrave; le
	distribuer sans relecture attentive, alors vous
	devriez l'envoyer directement &agrave; la &a.core; plut&ocirc;t
	que de le soumettre avec &man.send-pr.1;.  La liste de diffusion de
	l'&eacute;quipe de base atteint un plus petit groupe de personnes qui
	r&eacute;alise la plupart du travail quotidien de FreeBSD.  Notez que
	ce groupe est aussi <emphasis>tr&egrave;s occup&eacute;</emphasis>
	et donc que vous ne devriez leur envoyez de courrier
	&eacute;lectronique que lorsque cela est vraiment
	n&eacute;cessaire.</para>

      <para>Veuillez vous r&eacute;f&eacute;rer &agrave; &man.intro.9; et
	&man.style.9; pour plus d'informations sur la mani&egrave;re de coder.
	Nous appr&eacute;cierons le fait que vous soyez au moins conscient de
	ces probl&egrave;mes avant de soumettre du code.</para>
    </sect2>

    <sect2>
      <title>Nouveau code source ou logiciel &agrave; valeur ajout&eacute;e
	importante</title>

      <para>Dans le cas d'une contribution importante, ou l'addition
	d'une importante fonctionnalit&eacute; &agrave; FreeBSD, il devient
	presque n&eacute;cessaire d'envoyer les modifications soit sous la forme
	d'archives tar uuencod&eacute;es soit en les chargeant sur un site web
	ou FTP.  Si vous n'avez pas acc&egrave;s &agrave; un site web ou FTP,
	demandez sur la liste de diffusion appropri&eacute;e &agrave; ce que
	quelqu'un h&eacute;berge ces modifications pour vous.</para>

      <para>Lorsque l'on travaille avec un grand volume de code, le
	sujet sensible des copyrights revient invariablement.  Les
	copyrights acceptables pour le code inclus dans FreeBSD
	sont:</para>

      <orderedlist>
  <indexterm><primary>copyright BSD</primary></indexterm>
	<listitem>
	  <para>Le copyright BSD.  Ce copyright est le plus
	    appr&eacute;ci&eacute; de par son c&ocirc;t&eacute;
	    &ldquo;sans attaches&rdquo; et tr&egrave;s
	    attractif pour les entreprises commerciales.  Loin de
	    d&eacute;courager un usage commercial, le projet FreeBSD
	    encourage activement une telle participation avec
	    int&eacute;r&ecirc;ts commerciaux pour ceux qui pourraient
	    &ecirc;tre tent&eacute;s par la suite
	    d'investir quelque chose dans FreeBSD.</para>
	</listitem>

  <indexterm><primary>GPL</primary><see>Licence Publique G&eacute;n&eacute;rale GNU</see></indexterm>
  <indexterm><primary>Licence Publique G&eacute;n&eacute;rale GNU</primary></indexterm>
	<listitem>
	  <para>La Licence Publique G&eacute;n&eacute;rale GNU, ou
	    &ldquo;GPL&rdquo;.  Cette licence n'est pas aussi populaire
	    chez nous &agrave; cause du volume d'efforts
	    suppl&eacute;mentaires demand&eacute;s &agrave; celui qui
	    voudrait utiliser le code dans un but commercial, mais
	    &eacute;tant donn&eacute; la quantit&eacute; de code GPL dont nous
	    avons actuellement besoin (compilateur, assembleur,
	    formateur de texte, etc...) il serait absurde de refuser
	    des contributions sous cette licence.  Le code sous GPL va
	    &eacute;galement dans une partie diff&eacute;rente de
	    l'arborescence, soit <filename>/sys/gnu</filename>
	    soit<filename>/usr/src/gnu</filename>, et est de ce fait
	    ais&eacute;ment identifiable par toute personne pour laquelle la
	    licence GPL poserait un probl&egrave;me.</para>
	</listitem>
      </orderedlist>

      <para>Les contributions venant avec un autre type de copyright
	doivent &ecirc;tre soigneusement v&eacute;rifi&eacute;es avant que leur
	int&eacute;gration &agrave; FreeBSD ne soit prise en
	consid&eacute;ration.  Les contributions pour lesquelles des
	restrictions commerciales particuli&egrave;res s'appliquent sont
	g&eacute;n&eacute;ralement rejet&eacute;es, bien que
	les auteurs sont toujours encourag&eacute;s &agrave; rendre disponible
	de telles modifications par leurs propres moyens.</para>

      <para>Pour mettre un copyright de &ldquo;style BSD&rdquo; sur
	votre travail, inclure le texte suivant au tout d&eacute;but de chaque
	fichier de code source que vous voulez prot&eacute;ger, en
	rempla&ccedil;ant le texte entre les <literal>%%</literal> par
	l'information appropri&eacute;e.</para>

      <programlisting>Copyright (c) %%proper_years_here%%
        %%your_name_here%%, %%your_state%%  %%your_zip%%.
	All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
1. Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer as
   the first lines of this file unmodified.
2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

THIS SOFTWARE IS PROVIDED BY %%your_name_here%% ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL %%your_name_here%% BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

        &#36;Id&#36;</programlisting>

      <para>Pour votre convenance, une copie de ce texte peut &ecirc;tre
	trouv&eacute;e dans
	<filename>/usr/share/examples/etc/bsd-style-copyright</filename>.</para>
    </sect2>

    <sect2>
      <title>Contribution financi&egrave;re, mat&eacute;rielle ou acc&egrave;s
	Internet</title>

      <para>Nous sommes toujours tr&egrave;s heureux d'accepter des donations
	pour poursuivre la cause du projet FreeBSD, et dans un effort
	volontaire comme le notre, un rien peut faire du chemin!  Les
	donations de mat&eacute;riel sont &eacute;galement tr&egrave;s
	importantes pour augmenter notre liste de p&eacute;riph&eacute;riques
	support&eacute;s puisque nous manquons g&eacute;n&eacute;ralement de
	fonds pour acheter de tels &eacute;l&eacute;ments
	nous-m&ecirc;mes.</para>

      <sect3>
	<title><anchor id="donations">Donation de fonds</title>

	<para>La Fondation FreeBSD est une fondation &agrave; but non lucratif
	  et exempte d'imp&ocirc;ts fond&eacute;e pour servir les objectifs
	  du projet FreeBSD.  En tant qu'entit&eacute;e 501(c)3, la Fondation
	  est g&eacute;n&eacute;ralement exempte  de l'imp&ocirc;t
	  f&eacute;d&eacute;ral des Etats Unis comme de l'imp&ocirc;t de
	  l'&eacute;tat du Colorado.  Les dons &agrave; une entit&eacute;e
	  exempte d'imp&ocirc;ts sont souvent d&eacute;ductibles de
	  l'imp&ocirc;t f&eacute;d&eacute;ral.</para>

	<para>Les dons sous forme de ch&egrave;ques peuvent &ecirc;tre
	  adress&eacute;s &agrave;:
	  <address>
	    The FreeBSD Foundation
	    <street>7321 Brockway Dr.</street>
	    <city>Boulder</city>, <state>CO</state> <postcode>80303</postcode>
	    <country>USA</country>
	  </address>
	</para>

	<para>La Fondation FreeBSD est d&eacute;sormais en mesure d'accepter
	  les donations par l'interm&eacute;diaire du service web PayPal.  Pour
	  faire un don, veuillez visiter le <ulink
	  url="http://www.freebsdfoundation.org">site web</ulink> de la
	  Fondation.</para>

	<para>Plus d'informations au sujet de la Fondation FreeBSD
	  peuvent &ecirc;tre trouv&eacute;s dans <ulink
	  url="http://people.FreeBSD.org/~jdp/foundation/announcement.html">La
	  Fondation FreeBSD -- une introduction</ulink>.  Pour contacter
	  la Fondation par courrier &eacute;lectronique, &eacute;crire &agrave;
	  <email>bod@FreeBSDFoundation.org</email>.</para>
      </sect3>

      <sect3>
	<title>Contribution en mat&eacute;riel</title>
  <indexterm><primary>dons</primary></indexterm>
  
  <para>Le projet FreeBSD accepte avec joie les donations de
  matériel. Si vous êtes interessés pour nous faire un don de
  matériel, contactez le <ulink
  url="http://www.FreeBSD.org/donations/">Bureau de liaison des donations</ulink>.</para>

      </sect3>

      <sect3>
	<title>Contribution d'acc&egrave;s Internet</title>

	<para>Nous pouvons toujours utiliser de nouveau sites miroirs
	  pour les site FTP, WWW ou <command>cvsup</command>.  Si vous
	  voulez devenir un tel miroir, voyez le document <ulink
	  url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/hubs/index.html">devenir un site mirroir FreeBSD</ulink>
	  pour plus d'informations.</para>
      </sect3>
    </sect2>
  </sect1>

</article>

<!-- 
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
