<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/docproj/docproj.sgml,v 1.3 2004/01/06 17:31:40 stephane Exp $">
<!ENTITY title "Projet de Documentation FreeBSD">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.17
  
  Version francaise : Guillain
  Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
&header;

    <h2>Vue d'ensemble</h2>

    <p>S'attaquer &agrave; un syst&egrave;me d'exploitation nouveau et complexe est toujours 
    une t&acirc;che difficile, quelque soit sa convivialit&eacute;. FreeBSD n'est pas diff&eacute;rent 
    &agrave; cet &eacute;gard.</p>

    <p>Il existe de nombreux livres sur les Unix BSD (et les &unix; en g&eacute;n&eacute;ral) 
    mais FreeBSD poss&egrave;de ses propres caract&eacute;ristiques, proc&eacute;dures et 
    bizarreries.</p>

    <p>De plus, FreeBSD est amen&eacute; &agrave; &ecirc;tre le premier contact avec un syst&egrave;me 
    d'exploitation d&eacute;riv&eacute; d'Unix pour beacoup d'utilisateurs donc la disponiblit&eacute; 
    d'une documentation pr&eacute;cise et de haute qualit&eacute; est indispensable.</p>

    <p>Le Projet de Documentation FreeBSD est l&agrave; pour combler ce vide. Il 
    s'y prend de deux fa&ccedil;ons :</p>

    <ol>
      <li><p>Les membres du Projet de Documentation &eacute;crivent un document et 
      le soumettent afin qu'il soit inclu dans le <em>Jeu de 
      Documentation FreeBSD</em>.</p></li>

      <li><p>Les membres du Projet de Documentation d&eacute;batent de la 
      forme et de l'organisation du <em>Jeu de Documentation 
      FreeBSD</em>.</p></li>
    </ol>

    <table bgcolor="#ffffcc" border="1" cellpadding="4" width="100%">
      <tbody>
      <tr>
	<td><h2 align="center"><a href="current.html">Projets en cours</a></h2>
	  
	  <p>Plusieurs projets sont actuellement <em>en cours de r&eacute;alisation</em> dans 
	  le cadre de l'effort de documentation. Prenez le temps de consulter 
	  cette liste afin de savoir s'il y en a un pour lequel <b>vous</b> 
	  pouvez apporter de l'aide.</p></td>
      </tr>
      </tbody>
    </table>
    
    <h2><a href="who.html">Qui sommes-nous, comment nous rejoindre</a></h2>

    <p>Cette page explique qui compose le Projet de Documentation et comment 
    s'y joindre.</p>

    <h2><a href="doc-set.html">Le Jeu de Documentation FreeBSD</a></h2>

    <p>Cette page esquisse la composition du Jeu de Documentation FreeBSD 
    ainsi que le travail que le Projet de Documentation r&eacute;alise.</p>

    <h2><a href="sgml.html">SGML et le Projet de Documentation</a></h2>

    <p>Le projet essaie d'utiliser le SGML pour la documentation. Cette page 
    survole la m&eacute;thode utilis&eacute;e et dirige les lecteurs int&eacute;ress&eacute;s 
    vers davantage de ressources SGML.</p>

    <h2><a href="submitting.html">Proposer une documentation</a></h2>

    <p>Les propositions de documentation sont le meilleur moyen de faire partie du 
    projet et de rendre FreeBSD plus facile &agrave; utiliser. Cette page d&eacute;crit 
    la meilleure fa&ccedil;on de soumettre un document afin qu'il soit examin&eacute; 
    le plus rapidement possible.</p>

    <h2><a href="translations.html">Traduction</a></h2>  
    <p>Traductions de la documentation FreeBSD : pages web, 
    manuel de r&eacute;f&eacute;rence, pages de manuel et FAQ.</p>  

      &footer;
  </body>
</html>
