<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/docproj/sgml.sgml,v 1.3 2004/01/06 17:31:40 stephane Exp $">
<!ENTITY title "Projet de documentation FreeBSD : SGML">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.22
  
  Version francaise : Thomas Seyrat
  Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
    &header;

    <p>Le Projet de Documentation FreeBSD tente d'imposer SGML comme format
       standard pour cr&eacute;er des documents.</p>

    <p>SGML est le <b>S</b>tandard <b>G</b>eneralised <b>M</b>arkup
      <b>L</b>anguage (Langage de Balisage Standard G&eacute;n&eacute;ralis&eacute;).</p>

    <p>En un mot, avec toutes nos excuses pour oser choquer ainsi les puristes dans
       l'assistance, SGML est un langage con&ccedil;u pour en &eacute;crire d'autres.</p>

    <p>Vous avez probablement d&eacute;j&agrave; utilis&eacute; sans le savoir du SGML. HTML, le
       langage qui sert &agrave; la r&eacute;daction des pages web, est d&eacute;fini formellement.
       Sa d&eacute;finition est justement r&eacute;dig&eacute;e en SGML. Lorsque vous &eacute;crivez du
       HTML, vous n'&eacute;crivez <b>pas</b> du SGML tel quel, mais vous utilisez
       un langage qui est d&eacute;fini &agrave; partir de SGML.</p>

    <p>Il existe de tr&egrave;s, tr&egrave;s nombreux langages de balisage d&eacute;finis &agrave; partir de
       SGML. HTML en est un. "LinuxDoc" en est un autre. Comme vous vous en doutez,
       il fut con&ccedil;u &agrave; l'origine par le groupe de documentation Linux pour &eacute;crire
       leurs textes, et le Projet de Documentation FreeBSD l'a &eacute;galement adopt&eacute;.</p>

    <p>Un autre langage de balisage d&eacute;fini &agrave; partir de SGML est "DocBook". C'est un
       langage sp&eacute;cifiquement con&ccedil;u pour la mise en forme de documentation technique
       et, en tant que tel, dispose de nombreux tags (les choses entre &lt;...&gt)
       pour d&eacute;crire les particularit&eacute;s des documents techniques.</p>

    <p>Voici un exemple de ce &agrave; quoi peut ressembler un bref paragraphe &eacute;crit en
       HTML (ne vous souciez pas du contenu, mais seulement des tags) :</p>
 
    <pre><![ CDATA [
    <p>Les mots de passe du syst&egrave;me sont stock&eacute;s dans <tt>/etc/passwd</tt>.
       Pour modifier ce fichier, vous devez utiliser <b><tt>vipw</tt></b>.
       Toutefois, si vous souhaitez simplement ajouter un nouvel utilisateur
       vous pouvez utiliser <b><tt>adduser</tt></b>.</p>
]]></pre>
    
    <p>Le m&ecirc;me extrait, &eacute;crit en DocBook, ressemblerait &agrave; ceci :</p>

    <pre><![ CDATA [
    <para>Les mots de passe du syst&egrave;me sont stock&eacute;s dans
      <filename>/etc/passwd</filename>. Pour modifier ce fichier, vous devez utiliser
      <command>vipw</command>. Toutefois, si vous souhaitez simplement ajouter un nouvel utilisateur
       vous pouvez utiliser <command>adduser</command>.
    </para>
]]></pre>
    
    <p>Comme vous le voyez, DocBook est beaucoup plus "significatif" que HTML. Dans l'exemple
       HTML, le nom du fichier est marqu&eacute; comme devant &ecirc;tre affich&eacute; en une police
       "machine &agrave; &eacute;crire". En DocBook, le nom du fichier est justement d&eacute;sign&eacute;
       par la balise "filename", son apparence finale n'&eacute;tant pas d&eacute;crite.</p>

    <p>Il y a de nombreux avantages &agrave; cette forme plus significative de balisage :</p>

    <ul>
      <li><p>Elle n'est ni ambigu&euml; ni inconsistante.</p> <p>Vous n'avez plus de
             temps &agrave; perdre &agrave; vous demander : "Mmh, c'est un nom de fichier, est-ce
	     que j'utilise 'tt', 'b' ou 'em' ?"</p> <p>Au lieu de cela, vous utilisez le bon tag
	     au bon moment.</p>

	  <p>Le processus de conversion de DocBook en d'autres formats (HTML,
	     Postscript&reg;, etc.) s'assure que tous les &lt;filename&gt; ont bien
	     la m&ecirc;me apparence.</p>
      </li>

      <li><p>Vous n'avez plus &agrave; vous soucier de l'apparence de votre document,
             et vous pouvez vous concentrer plut&ocirc;t sur le contenu.</p>
      </li>

      <li><p>Parce que la documentation ne doit pas &ecirc;tre li&eacute;e &agrave; un quelconque
             format de sortie, une seule et m&ecirc;me source peut servir &agrave; produire
	     de nombreux fichiers de types diff&eacute;rents - texte pur, HTML, PostScript,
	     RTF, PDF, etc.</p></li>

      <li><p>La documentation est plus "intelligente", afin que plus de choses
             "intelligentes" puissent &ecirc;tre faites avec. Par exemple, il devient possible
	     de g&eacute;n&eacute;rer automatiquement un index qui r&eacute;pertorie toutes les commandes
	     cit&eacute;es dans une documentation.</p></li>
    </ul>

    <p>C'est un peu comme les feuilles de style de Microsoft&reg; Word, que vous
       &ecirc;tes peut-&ecirc;tre habitu&eacute; &agrave; utiliser. C'est simplement beaucoup plus puissant.</p>

    <p>Bien s&ucirc;r, cette performance a un prix :</p>

    <ul>
      <li><p>Parce que le nombre de tags que vous utilisez est beaucoup plus important,
             cela prend plus de temps pour les apprendre tous, et pour savoir les utiliser
	     &agrave; bon escient.</p>
	
	  <p>Je me suis rendu compte que la meilleure mani&egrave;re d'apprendre est de lire la
	     source de nombreux textes, en &eacute;tudiant la mani&egrave;re dont d'autres auteurs
	     ont r&eacute;dig&eacute; des documents similaires.</p></li>

      <li><p>Le processus de reconversion n'est pas ais&eacute;.</p></li>
    </ul>

    <p>Actuellement, le Projet utilise toujours LinuxDoc pour le Manuel et la FAQ.
       Ceci est en train de changer, et il y a notamment un projet en cours pour
       convertir la documentation en DocBook.</p>
  
    <h2>Et si je ne connais ni LinuxDoc, ni DocBook ? Puis-je quand m&ecirc;me
        participer ?</h2>
    
    <p>Bien s&ucirc;r ! N'importe quelle documentation vaut mieux que rien du tout.
       Si vous avez &agrave; fournir quelque chose, m&ecirc;me non format&eacute; en
       LinuxDoc ou en DocBook, ne vous faites pas de souci.</p>

    <p><a href="submitting.html">Soumettez</a> la documentation comme d'habitude.
       Quelqu'un d'autre du Projet marquera votre documentation pour vous
       et la soumettra &agrave; son tour. Avec un peu de chance, ils vous renverront
       le texte format&eacute;. C'est commode, puisque vous pouvez ainsi avoir un aper&ccedil;u
       "avant" et "apr&egrave;s" du texte format&eacute;, et peut-&ecirc;tre en apprendrez-vous encore un peu
       plus sur l'&eacute;tape de marquage.</p>

    <p>De toute &eacute;vidence, ceci ralentit le processus de participation au Projet,
       puisque votre documentation doit &ecirc;tre marqu&eacute;e, ce qui peut prendre un soir
       ou deux. Mais elle rejoindra les autres.</p>

    <h2>Plus d'informations sur SGML et DocBook ?</h2>

    <p>Vous devriez tout d'abord lire le <a 
        href="&enbase;/doc/en_US.ISO8859-1/books/fdp-primer/index.html"><b>Documentation Project 
      Primer</b></a>.  Il se veut &ecirc;tre une explication p&eacute;dagogique de tout ce que
      vous avez besoin de conna&icirc;tre pour travailler avec la Documentation FreeBSD.</p>

    <p>C'est un long document, divis&eacute; en de nombreux petits fichiers. Vous pouvez &eacute;galement
       le trouver sous la forme d'<a 
       href="&enbase;/doc/en_US.ISO8859-1/books/fdp-primer/book.html"><b>un
       seul gros fichier</b></a>.</p>

    <dl>
      <dt><a
	  href="http://www.oasis-open.org/cover/sgml-xml.html"><b>http://www.oasis-open.org/cover/sgml-xml.html</b></a></dt>

      <dd><p>LA page web SGML/XML. Contient d'innombrables liens vers de l'information
          sur SGML.</p></dd>

      <dt><a
	  href="http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html"><b>http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html</b></a></dt>

      <dd><p>L'"Introduction progressive &agrave; SGML". Recommand&eacute;e pour toute personne
          d&eacute;sirant aborder SGML avec une approche de d&eacute;butant.</p></dd>
      
      <dt><a
	  href="http://www.oasis-open.org/docbook/"><b>http://www.oasis-open.org/docbook/</b></a></dt>

      <dd><p>La DTD DocBook est suivie par OASIS. Ces pages sont destin&eacute;es aux utilisateurs
          d&eacute;j&agrave; &agrave; l'aise en SGML, et qui d&eacute;sirent apprendre DocBook.</p>
	</dd>
    </dl>
      
      <p></p><a href="docproj.html">Projet de Documentation FreeBSD&nbsp;: Accueil</a>
&footer;
  </body>
</html>
