<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/docproj/submitting.sgml,v 1.4 2004/01/06 17:31:40 stephane Exp $">
<!ENTITY title "Projet de documentation FreeBSD : Proposer de la documentation">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.14

  Version francaise : Thomas Seyrat
  Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
    &header;

    <h2>Je viens d'&eacute;crire de la documentation. Comment puis-je la soumettre ?</h2>

    <p>Avant tout, merci d'avoir pris le temps de le faire.</p>

    <p>Vous devez rendre votre documentation accessible aux relecteurs. Si vous le pouvez,
      mettez votre travail sur un site FTP ou web.</p>

    <p>Enfin, postez un message dans la liste de diffusion -doc, accompagn&eacute; d'un
      bref descriptif de la documentation et d'un lien vers elle, tout en sollicitant
      des r&eacute;actions.</p>
       
    <p>Si, pour une raison ou pour une autre, vous ne pouvez pas mettre votre documentation sur un site FTP ou sur 
      un site web, vous pouvez l'envoyer directement sur la liste de diffusion -doc.
      Si vous le faites, merci d'envoyer uniquement des documents au format texte simple.</p>
    
    <p>Vous devriez probablement envoyer une copie du message aux autres listes de diffusion
      concern&eacute;es. Par exemple, une documentation traitant de l'utilisation de CVSup pour
      garder votre hi&eacute;rarchie de code source &agrave; jour int&eacute;ressera les
      abonn&eacute;s aux listes de diffusion <tt>FreeBSD-current</tt> et
      <tt>FreeBSD-stable</tt></p>
      
    <p>Une fois votre documentation examin&eacute;e par les abonn&eacute;s, et que vous aurez
      le cas &eacute;ch&eacute;ant incorpor&eacute; les suggestions que vous jugerez bonnes,
      vous pouvez la soumettre &agrave; examen.</p>
  
    <p>Pour ceci, faites-en un fichier tar. Si votre documentation est compos&eacute;e de
      trois fichiers <tt>un</tt>, <tt>deux</tt>, et <tt>trois</tt>, et que vous voulez tout
      regrouper dans <tt>doc.tar</tt>, tapez :</p>

    <pre>
    % <b>tar cf doc.tar un deux trois</b>
    </pre>

    <p>dont c'est pr&eacute;cis&eacute;ment le r&ocirc;le. Puis compressez le fichier tar,</p>

    <pre>
    % <b>gzip -9 doc.tar</b>
    </pre>

    <p>qui produira <tt>doc.tar.gz</tt>.</p>

    <p>Enfin, encodez le fichier de fa&ccedil;on &agrave; ce qu'il ne soit pas modifi&eacute;
      par les logiciels de courrier &eacute;lectronique.</p>

    <pre>
    % <b>uuencode doc.tar.gz doc.tar.gz > doc.uue</b>
    </pre>

    <p>Vous devez ensuite en informer le Projet de Documentation. La mani&egrave;re correcte
      de le faire est d'utiliser la commande <b>send-pr</b>, qui devrait &ecirc;tre install&eacute;e
      sur votre machine.</p>

    <p>Proc&eacute;dez ainsi afin que votre requ&ecirc;te puisse &ecirc;tre enregistr&eacute;e. Lorsque vous
      soumettez un PR (Problem Report), un num&eacute;ro unique lui est attribu&eacute;. L'un des
      responsables peut ainsi s'attribuer la requ&ecirc;te PR, et assurer la liaison avec
      vous dans l'optique d'int&eacute;grer la nouvelle documentation.</p>

    <p><b>send-pr</b> en lui-m&ecirc;me est plut&ocirc;t simple. Tout ce qu'il fait est d'envoyer
      un message &eacute;lectronique dans un formatage adapt&eacute; &agrave; une adresse
      particuli&egrave;re. Lorsque vous lancez <b>send-pr</b>, vous serez amen&eacute; &agrave;
      r&eacute;diger un message &agrave; partir de votre &eacute;diteur (vraisemblalement <b>vi</b> ou
      <b>emacs</b>) avec quelques instructions sur cette &eacute;tape.</p> 

    <p>Assurez-vous que "Category" est bien sur "docs" et que "Class" est sur
      l'un des "change-request". Et n'oubliez pas d'inclure le fichier <tt>.uue</tt>
      que vous avez cr&eacute;&eacute; pr&eacute;c&eacute;demment dans le PR.</p>

    <p>Lorsque vous sortirez de l'&eacute;diteur, le PR sera exp&eacute;di&eacute;
      &eacute;lectroniquement au bon endroit. Vous recevrez peu apr&egrave;s un accus&eacute; de
      r&eacute;ception accompagn&eacute; du num&eacute;ro attribu&eacute; &agrave; votre PR,
      permettant de suivre l'&eacute;volution du travail. </p>

    <h2>J'ai proc&eacute;d&eacute; &agrave; quelques changements sur une documentation existante, comment puis-je
      les soumettre ?</h2>

    <p>Encore une fois, nous vous remercions d'avoir pris le temps de faire ceci.</p>

    <p>Premi&egrave;rement, vous devez produire un fichier sp&eacute;cifique, appel&eacute; <i>diff</i>.
      Ce fichier diff montre simplement les changements que vous avez faits. Ceci rend
      le travail du responsable plus ais&eacute;, afin de voir pr&eacute;cis&eacute;ment ce que vous avez
      chang&eacute;, et permet de vous &eacute;viter de perdre beaucoup de temps &agrave; l'expliquer (bien
      que vous devriez tout de m&ecirc;me expliquer pourquoi vous avez jug&eacute; que les changements
      devaient &ecirc;tre faits).</p>

    <p>Pour faire un "diff", vous devez :</p>

    <ol>
      <li><p>Faire une copie du fichier que vous allez modifier. Si vous
      modifiez <tt>foo.sgml</tt>, tapez</p>

	<pre>
    % <b>cp foo.sgml foo.sgml.old</b>
	</pre></li>
      
      <li><p>Puis, proc&eacute;dez &agrave; vos modifications sur foo.sgml.</p>

	<pre>
    % <b>vi foo.sgml</b>
    ... tap tap tap ...

    ... testez les changements, relisez pour corriger les coquilles, etc...
	</pre></li>

      <li><p>Faites le diff. La commande est la suivante&nbsp;:</p>

	<pre>
    % <b>diff -ru foo.sgml.old foo.sgml > foo.diff</b>
	</pre>

	<p>Ceci rep&egrave;re les diff&eacute;rences entre les deux fichiers, et les &eacute;crit dans le
	   fichier <tt>foo.diff</tt>.</p></li>
    </ol>
	
    <p>Vous pouvez maintenant envoyer <tt>foo.diff</tt> au projet. Envoyez un PR comme
      d&eacute;crit plus haut et n'oubliez pas d'inclure le fichier <tt>foo.diff</tt> dans le corps 
      du PR.</p>

    <p></p><a href="docproj.html">Projet de Documentation FreeBSD : Accueil</a>
&footer;
  </body>
</html>
