Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/cups/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@mailbox.org, 2019
pt_br: Wendell Borges, perlporter@gmail.com, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: CUPS on FreeBSD
es_es: CUPS en FreeBSD
pt_br: CUPS no FreeBSD

source: $FreeBSD: head/en_US.ISO8859-1/articles/cups/article.xml 46469 2015-04-04 23:31:59Z eadler $
es_es: $FreeBSD$

source: An article about configuring CUPS on FreeBSD.
es_es: Un artículo sobre la configuración de CUPS en FreeBSD.
pt_br: Um artigo sobre como configurar o CUPS no FreeBSD.

source: An Introduction to the Common Unix Printing System (CUPS)
es_es: Una introducción al sistema de impresión común de Unix (CUPS)
pt_br: Uma introdução ao Common Unix Printing System (CUPS)

source: <application>CUPS</application>, the Common UNIX Printing System, provides a portable printing layer for <trademark class="registered">UNIX</trademark>-based operating systems. It has been developed by Easy Software Products to promote a standard printing solution for all <trademark class="registered">UNIX</trademark> vendors and users.
es_es: <application>CUPS</application>, el sistema de impresión común de UNIX, proporciona una capa portable de impresión para sistemas operativos tipo <trademark class="registered">UNIX</trademark>. Ha sido desarrollado por Easy Software Products para promover una solución de impresión estándar para todos los proveedores y usuarios de <trademark class="registered">UNIX</trademark>.
pt_br: O <application>CUPS</application>, o Common UNIX Printing System, fornece uma camada de impressão portátil para sistemas operacionais baseados no <trademark class="registered">UNIX</trademark>. Ele foi desenvolvido pela Easy Software Products para prover uma solução de impressão padrão para todos os fornecedores e usuários do <trademark class="registered">UNIX</trademark>.

source: <application>CUPS</application> uses the Internet Printing Protocol (<acronym>IPP</acronym>) as the basis for managing print jobs and queues. The Line Printer Daemon (<acronym>LPD</acronym>), Server Message Block (<acronym>SMB</acronym>), and AppSocket (aka JetDirect) protocols are also supported with reduced functionality. <application>CUPS</application> adds network printer browsing and PostScript Printer Description (<acronym>PPD</acronym>) based printing options to support real-world printing under <trademark class="registered">UNIX</trademark>. As a result, <application>CUPS</application> is ideally-suited for sharing and accessing printers in mixed environments of FreeBSD, <trademark class="registered">Linux</trademark>, <trademark class="registered">Mac OS</trademark> X, or <trademark class="registered">Windows</trademark>.
es_es: <application>CUPS</application> usa el Protocolo de Impresión de Internet (<acronym>IPP</acronym>) como base para administrar los trabajos de impresión y las colas. Los protocolos Line Printer Daemon (<acronym>LPD</acronym>), Server Message Block (<acronym>SMB</acronym>) y AppSocket (aka JetDirect) también son compatibles pero con funcionalidad reducida. <application>CUPS</application> añade la búsqueda de impresoras en red y PostScript Printer Description (<acronym>PPD</acronym>) como opciones de impresión para dar un soporte de impresión real bajo <trademark class="registered">UNIX</trademark>. Como resultado, <application>CUPS</application> es ideal para compartir y acceder a impresoras en entornos mixtos con FreeBSD, <trademark class="registered">Linux</trademark>, <trademark class="registered">Mac OS</trademark> X, o <trademark class="registered">Windows</trademark>.
pt_br: O <application>CUPS</application> usa o Internet Printing Protocol (<acronym>IPP</acronym>) como base para gerenciar trabalhos de impressão e filas. O Line Printer Daemon (<acronym>LPD</acronym>), os protocolos Server Message Block (<acronym>SMB</acronym>) e AppSocket (também conhecido como JetDirect) também são suportados com funcionalidade reduzida. O <application>CUPS</application> adiciona opções de impressão com base em impressoras de rede e de impressão PostScript (<acronym>PPD</acronym>) para oferecer suporte à impressão no mundo <trademark class="registered">UNIX</trademark>. Como resultado, o <application>CUPS</application> é ideal para compartilhar e acessar impressoras em ambientes heterogêneos nos quais coexistem equipamentos rodando FreeBSD, <trademark class="registered">Linux</trademark>, <trademark class="registered">Mac OS</trademark> X, e <trademark class="registered">Windows</trademark>.

source: The main site for <application>CUPS</application> is <uri xlink:href="http://www.cups.org/">http://www.cups.org/</uri>.
es_es: El sitio principal de <application>CUPS</application> es <uri xlink:href="http://www.cups.org/">http://www.cups.org/</uri>.
pt_br: O site do <application>CUPS</application> é <uri xlink:href="http://www.cups.org/">http://www.cups.org/</uri>.

source: Installing the CUPS Print Server
es_es: Instalación del servidor de impresión CUPS
pt_br: Instalando o CUPS Print Server

source: To install <application>CUPS</application> using a precompiled binary, issue the following command from a root terminal:
es_es: Para instalar <application>CUPS</application> utilizando un binario precompilado, utilice el siguiente comando desde un terminal con el usuario root:
pt_br: Para instalar o <application>CUPS</application> utilizando binários pré compilados, execute o seguinte comando como root a partir de um terminal:

source: Other optional, but recommended, packages are <package>print/gutenprint-cups</package> and <package>print/hplip</package>, both of which add drivers and utilities for a variety of printers. Once installed, the <application>CUPS</application> configuration files can be found in the directory <filename>/usr/local/etc/cups</filename>.
es_es: Otros paquetes opcionales, pero recomendados, son <package>print/gutenprint-cups</package> y <package>print/hplip</package>, que agregan controladores y utilidades para varias impresoras. Una vez instalados, los archivos de configuración de <application>CUPS</application> se pueden encontrar en el directorio <filename>/usr/local/etc/cups</filename>.

source: Configuring the CUPS Print Server
es_es: Configurando el servidor de impresión CUPS
pt_br: Configurando o CUPS Print Server

source: After installation, a few files must be edited in order to configure the <application>CUPS</application> server. First, create or modify, as the case may be, the file <filename>/etc/devfs.rules</filename> and add the following information to set the proper permissions on all potential printer devices and to associate printers with the <systemitem class="groupname">cups</systemitem> user group:
es_es: Después de la instalación, se deben editar algunos archivos para configurar el servidor de <application>CUPS</application>. Primero, cree o modifique, según sea el caso, el archivo <filename>/etc/devfs.rules</filename> y agregue la siguiente información para establecer los permisos adecuados en todas las impresoras y para asociar las impresoras con el grupo de usuarios <systemitem class="groupname">cups</systemitem>:
pt_br: Após a instalação, alguns arquivos devem ser editados para configurar o servidor <application>CUPS</application>. Primeiro, crie ou modifique, conforme o caso, o arquivo <filename>/etc/devfs.rules</filename> e adicione as seguintes informações para definir as permissões adequadas em todos os dispositivos de impressora e para associar impressoras ao grupo de usuários do <systemitem class="groupname">cups</systemitem>:

source: Note that <replaceable>X</replaceable>, <replaceable>Y</replaceable>, and <replaceable>Z</replaceable> should be replaced with the target USB device listed in the <filename>/dev/usb</filename> directory that corresponds to the printer. To find the correct device, examine the output of <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, where <filename>ugen<replaceable>X</replaceable>.<replaceable>Y</replaceable></filename> lists the printer device, which is a symbolic link to a USB device in <filename>/dev/usb</filename>.
es_es: Tenga en cuenta que <replaceable>X</replaceable>, <replaceable>Y</replaceable> y <replaceable>Z</replaceable> deben reemplazarse con el dispositivo USB de destino listado en el directorio <filename>/dev/usb</filename> que corresponda a la impresora. Para encontrar el dispositivo correcto, examine la salida de <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, donde <filename>ugen<replaceable>X</replaceable>. <replaceable>Y</replaceable></filename> muestra el dispositivo de la impresora, que es un enlace simbólico a un dispositivo USB en <filename>/dev/usb</filename>.
pt_br: Observe que <replaceable>X</replaceable>, <replaceable>Y</replaceable> e <replaceable>Z</replaceable> devem ser substituídos pelo dispositivo USB de destino listado no diretório <filename>/dev/usb</filename> que corresponde à sua impressora. Para encontrar o dispositivo correto, examine a saída do comando <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, onde <filename>ugen<replaceable>X</replaceable>.<replaceable>Y</replaceable></filename> lista o dispositivo de impressora, que é um link simbólico para um dispositivo USB em <filename>/dev/usb</filename>.

source: Next, add two lines to <filename>/etc/rc.conf</filename> as follows:
es_es: A continuación, agregue las siguientes dos líneas a <filename>/etc/rc.conf</filename>:
pt_br: Em seguida, adicione as linhas abaixo no <filename>/etc/rc.conf</filename> conforme abaixo:

source: These two entries will start the <application>CUPS</application> print server on boot and invoke the local devfs rule created above, respectively.
es_es: Estas dos líneas iniciarán el servidor de impresión <application>CUPS</application> al inicio e invocarán la regla local devfs, respectivamente.
pt_br: Essas duas entradas iniciarão o servidor de impressão do <application>CUPS</application> após o boot do sistema e carregará a regra do devfs local acima, respectivamente.

source: In order to enable <application>CUPS</application> printing under certain <trademark class="registered">Microsoft</trademark> <trademark class="registered">Windows</trademark> clients, the line below should be uncommented in <filename>/usr/local/etc/cups/mime.types</filename> and <filename>/usr/local/etc/cups/mime.convs</filename>:
es_es: Para habilitar la impresión de <application>CUPS</application> en ciertos clientes de <trademark class="registered">Microsoft</trademark> <trademark class="registered">Windows</trademark>, la siguiente línea debe descomentarse en <filename>/usr/local/etc/cups/mime.types</filename> y <filename>/usr/local/etc/cups/mime.convs</filename>:
pt_br: Para habilitar a impressão via <application>CUPS</application> em alguns clientes <trademark class="registered">Microsoft</trademark> <trademark class="registered">Windows</trademark> você deverá remover o comentário da linha abaixo nos arquivos <filename>/usr/local/etc/cups/mime.types</filename> e <filename>/usr/local/etc/cups/mime.convs</filename>:

source: Once these changes have been made, the <citerefentry><refentrytitle>devfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> and <application>CUPS</application> systems must both be restarted, either by rebooting the computer or issuing the following two commands in a root terminal:
es_es: Una vez que se han realizado estos cambios, los sistemas <citerefentry><refentrytitle>devfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> y <application>CUPS</application> deben reiniciarse, ya sea reiniciando el ordenador o ejecutando los siguientes dos comandos en un terminal con el usuario root:
pt_br: Uma vez que estas alterações tenham sido feitas, os sistemas <citerefentry><refentrytitle>devfs</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> e <application>CUPS</application> deverão ser reiniciados, seja reiniciando o computador ou executando os dois comandos a seguir como root em um terminal:

source: Configuring Printers on the CUPS Print Server
es_es: Configuración de impresoras en el servidor de impresión CUPS
pt_br: Configurando Impressoras no CUPS Print Server

source: After the <application>CUPS</application> system has been installed and configured, the administrator can begin configuring the local printers attached to the <application>CUPS</application> print server. This part of the process is very similar, if not identical, to configuring <application>CUPS</application> printers on other <trademark class="registered">UNIX</trademark>-based operating systems, such as a <trademark class="registered">Linux</trademark> distribution.
es_es: Una vez <application>CUPS</application> haya sido instalado y configurado, el administrador puede empezar a configurar las impresoras locales conectadas al servidor de impresión <application>CUPS</application>. Esta parte del proceso es muy similar, si no idéntica, a la configuración de impresoras <application>CUPS</application> en otros sistemas operativos basados en <trademark class="registered">UNIX</trademark>, como una distribución de <trademark class="registered">Linux</trademark>.
pt_br: Depois que o sistema <application>CUPS</application> tiver sido instalado e configurado, o administrador poderá começar a configurar as impressoras locais conectadas ao servidor de impressão <application>CUPS</application>. Essa parte do processo é muito semelhante, se não idêntica, à configuração de impressoras <application>CUPS</application> em outros sistemas operacionais baseados em <trademark class="registered">UNIX</trademark>, como o <trademark class="registered">Linux</trademark>.

source: The primary means for managing and administering the <application>CUPS</application> server is through the web-based interface, which can be found by launching a web browser and entering <uri xlink:href="http://localhost:631">http://localhost:631</uri> in the browser's URL bar. If the <application>CUPS</application> server is on another machine on the network, substitute the server's local <acronym>IP</acronym> address for <systemitem>localhost</systemitem>. The <application>CUPS</application> web interface is fairly self-explanatory, as there are sections for managing printers and print jobs, authorizing users, and more. Additionally, on the right-hand side of the Administration screen are several check-boxes allowing easy access to commonly-changed settings, such as whether to share published printers connected to the system, whether to allow remote administration of the <application>CUPS</application> server, and whether to allow users additional access and privileges to the printers and print jobs.
es_es: El medio principal para gestionar y administrar el servidor <application>CUPS</application> es a través de la interfaz web, se puede acceder introduciendo en la URL de un navegador web <uri xlink:href="http://localhost:631">http://localhost:631</uri>. Si el servidor <application>CUPS</application> está en otra máquina en la red, sustituya la dirección <acronym>IP</acronym> local del servidor por <systemitem>localhost</systemitem>. La interfaz web de <application>CUPS</application> se explica por sí misma, ya que hay secciones para administrar impresoras y trabajos de impresión, autorizar usuarios y más. Además, en el lado derecho de la pantalla de Administración hay varias casillas que permiten un acceso fácil a las configuraciones más comunes, por ejemplo, compartir impresoras conectadas al sistema, permitir la administración remota del servidor <application>CUPS</application> y dar permisos adicionales a los usuarios sobre las impresoras y los trabajos de impresión.
pt_br: O principal meio para gerenciar e administrar o servidor <application>CUPS</application> é através da sua interface web, que pode ser acessada por meio de um navegador web, para isto execute o navegador e digite a URL <uri xlink:href="http://localhost:631">http://localhost:631</uri> na barra de endereços do navegador. Se o servidor <application>CUPS</application> estiver em outra máquina na rede, substitua o endereço <acronym>IP</acronym> local do servidor por <systemitem>localhost</systemitem>. A interface Web do <application>CUPS </application> é bastante autoexplicativa, pois há seções para gerenciar impressoras e trabalhos de impressão, autorizar usuários e muito mais. Além disso, no lado direito da tela de administração, existem várias caixas de seleção que permitem acesso fácil a configurações comumente alteradas, como compartilhar impressoras conectadas ao sistema, permitir a administração remota do servidor <application>CUPS</application>, e se deseja permitir aos usuários acesso adicional e privilégios para as impressoras e trabalhos de impressão.

source: Adding a printer is generally as easy as clicking <quote>Add Printer</quote> at the Administration screen of the <application>CUPS</application> web interface, or clicking one of the <quote>New Printers Found</quote> buttons also at the Administration screen. When presented with the <quote>Device</quote> drop-down box, simply select the desired locally-attached printer, and then continue through the process. If one has added the <package>print/gutenprint-cups</package> or <package>print/hplip</package> ports or packages as referenced above, then additional print drivers will be available in the subsequent screens that might provide more stability or features.
es_es: Por lo general, añadir una impresora es tan fácil como hacer clic en <quote>Add Printer</quote> en la pantalla de Administración de la interfaz web de <application>CUPS</application>, o haciendo clic en uno de los botones <quote>New Printers Found</quote> también en la pantalla de Administración. Cuando se muestre el cuadro desplegable <quote>Device</quote>, simplemente seleccione la impresora local deseada y continúe con el proceso. Si usted ha agregado los ports o paquetes mencionados anteriormente <package>print/gutenprint-cups</package> o <package>print/hplip</package>, entonces, los controladores de impresión adicionales estarán disponibles en las siguientes pantallas pudiendo proporcionar más estabilidad o características.
pt_br: Adicionar uma impressora geralmente é tão fácil quanto clicar em <quote>Adicionar impressora</quote> na tela Administração da interface Web do <application>CUPS</application> ou clicar em um dos botões <quote>Novas impressoras encontradas</quote> também na tela Administração. Quando for apresentada a caixa suspensa <quote>Device</quote>, basta selecionar a impressora conectada localmente a qual você deseja utilizar e continuar o processo. Se você adicionou os aplicativos <package>print/gutenprint-cups</package> e/ou <package>print/hplip</package> via ports ou pacotes conforme mencionado acima, os drivers de impressão adicionais estarão disponíveis nas telas subsequentes, eles lhe fornecer mais estabilidade ou mais recursos.

source: Configuring CUPS Clients
es_es: Configurando clientes de CUPS
pt_br: Configurando clientes CUPS

source: Once the <application>CUPS</application> server has been configured and printers have been added and published to the network, the next step is to configure the clients, or the machines that are going to access the <application>CUPS</application> server. If one has a single desktop machine that is acting as both server and client, then much of this information may not be needed.
es_es: Una vez haya sido configurado el servidor <application>CUPS</application> y se hayan agregado y publicado impresoras en la red, el siguiente paso es configurar los clientes o las máquinas que van a acceder al servidor <application>CUPS</application>. Si uno tiene una sola máquina de escritorio que actúa como servidor y como cliente, es posible que gran parte de esta información no sea necesaria.
pt_br: Depois que o servidor <application>CUPS</application> tiver sido configurado e as impressoras tiverem sido adicionadas e publicadas na rede, a próxima etapa será configurar os clientes ou as máquinas que acessarão o servidor <application>CUPS</application>. Se alguém tiver uma única máquina desktop atuando como servidor e cliente, muitas dessas informações podem não ser necessárias.

source: <trademark class="registered">UNIX</trademark> Clients
es_es: Clientes <trademark class="registered">UNIX</trademark>
pt_br: Clientes <trademark class="registered">UNIX</trademark>
