Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/cups/*.po
Languages: es_es, pt_br

source: <application>CUPS</application> will also need to be installed on your <trademark class="registered">UNIX</trademark> clients. Once <application>CUPS</application> is installed on the clients, then <application>CUPS</application> printers that are shared across the network are often automatically discovered by the printer managers for various desktop environments such as <application>GNOME</application> or <application>KDE</application>. Alternatively, one can access the local <application>CUPS</application> interface on the client machine at <uri xlink:href="http://localhost:631">http://localhost:631</uri> and click on <quote>Add Printer</quote> in the Administration section. When presented with the <quote>Device</quote> drop-down box, simply select the networked <application>CUPS</application> printer, if it was automatically discovered, or select <literal>ipp</literal> or <literal>http</literal> and enter the <acronym>IPP</acronym> or <acronym>HTTP</acronym> <acronym>URI</acronym> of the networked <application>CUPS</application> printer, usually in one of the two following syntaxes:
es_es: <application>CUPS</application> también tendrá que estar instalado en sus clientes <trademark class="registered">UNIX</trademark>. Una vez que <application>CUPS</application> ha sido instalado en los clientes, las impresoras <application>CUPS</application> que se encuentren compartidas en la red, a menudo son descubiertas de forma automática por los administradores de impresión de algunos escritorios como <application>GNOME</application> o <application>KDE</application>. Como alternativa, puede acceder a la interfaz local de <application>CUPS</application> en la máquina cliente en <uri xlink:href="http://localhost:631">http://localhost:631</uri> y hacer clic en <quote>Add Printer</quote> en la sección de Administración. Cuando se muestre el cuadro desplegable <quote>Device</quote>, simplemente seleccione la impresora <application>CUPS</application> en red si esta fue descubierta automáticamente, o seleccione <literal>ipp</literal> o <literal>http</literal> e introduzca el <acronym>IPP</acronym> o <acronym>HTTP</acronym> <acronym>URI</acronym> de la impresora <application>CUPS</application> en red, generalmente con la siguiente sintaxis:
pt_br: O <application>CUPS</application> também precisará ser instalado em seus clientes <trademark class="registered">UNIX</trademark>. Depois que o <application>CUPS</application> é instalado nos clientes, as impressoras <application> CUPS</application> compartilhadas na rede geralmente são descobertas automaticamente pelos gerenciadores de impressoras de vários ambientes de desktop, como <application>GNOME</application> ou <application>KDE</application>. Como alternativa, pode-se acessar a interface local do <application>CUPS</application> na máquina cliente em <uri xlink:href="http://localhost:631">http://localhost:631</uri> e clicar em em <quote>Adicionar impressora</quote> na seção Administração. Quando visualizar a caixa suspensa <quote>Device</quote>, simplesmente selecione a impressora <application>CUPS</application> em rede, se ela foi descoberta automaticamente, ou selecione <literal>ipp</literal> ou <literal>http</literal> e digite o <acronym>IPP</acronym> ou <acronym>HTTP</acronym><acronym>URI</acronym> da impressora <application>CUPS</application> em rede, geralmente em um das duas seguintes sintaxes:

source: If the <application>CUPS</application> clients have difficulty finding other <application>CUPS</application> printers shared across the network, sometimes it is helpful to add or create a file <filename>/usr/local/etc/cups/client.conf</filename> with a single entry as follows:
es_es: Si los clientes de <application>CUPS</application> tienen dificultades para encontrar otras impresoras de <application>CUPS</application> compartidas en la red, a veces es útil agregar o crear un archivo <filename>/usr/local/etc/cups/client.conf</filename> con una sola línea como la que se muestra a continuación:
pt_br: Se os clientes <application>CUPS</application> tiverem dificuldade para localizar outras impressoras <application>CUPS</application> compartilhadas na rede, às vezes é útil adicionar ou criar um arquivo <filename>/usr/local/etc/cups/client.conf</filename> com uma única entrada da seguinte forma:

source: In this case, <replaceable>server-ip</replaceable> would be replaced by the local <acronym>IP</acronym> address of the <application>CUPS</application> server on the network.
es_es: En este caso, <replaceable>server-ip</replaceable> sería reemplazado por la dirección <acronym>IP</acronym> local del servidor <application>CUPS</application>.
pt_br: Nesse caso, <replaceable>server-ip</replaceable> seria substituído pelo endereço <acronym>IP</acronym> local do servidor <application>CUPS</application> na rede.

source: <trademark class="registered">Windows</trademark> Clients
es_es: Clientes <trademark class="registered">Windows</trademark>
pt_br: Clientes <trademark class="registered">Windows</trademark>

source: Versions of <trademark class="registered">Windows</trademark> prior to XP did not have the capability to natively network with <acronym>IPP</acronym>-based printers. However, <trademark class="registered">Windows</trademark> XP and later versions do have this capability. Therefore, to add a <application>CUPS</application> printer in these versions of <trademark class="registered">Windows</trademark> is quite easy. Generally, the <trademark class="registered">Windows</trademark> administrator will run the <trademark class="registered">Windows</trademark> <literal>Add Printer</literal> wizard, select <literal>Network Printer</literal> and then enter the <acronym>URI</acronym> in the following syntax:
es_es: Las versiones de <trademark class="registered">Windows</trademark> anteriores a XP no tienen la capacidad de conectarse por red de forma nativa con impresoras <acronym>IPP</acronym>. Sin embargo, <trademark class="registered">Windows</trademark> XP y posteriores si tienen esa capacidad. Por lo tanto, añadir impresoras <application>CUPS</application> en esas versiones de <trademark class="registered">Windows</trademark> es bastante fácil. Generalmente, el administrador de <trademark class="registered">Windows</trademark> ejecutará el Asistente para <literal>Agregar Impresoras</literal> de <trademark class="registered">Windows</trademark>, seleccione <literal>Impresora de Red</literal> y luego inserte la <acronym>URI</acronym> siguiendo la siguiente sintaxis:
pt_br: As versões do <trademark class="registered">Windows</trademark> anteriores ao XP não tinham a capacidade utilizar impressoras em rede baseadas no protocolo <acronym>IPP</acronym>. No entanto, o <trademark class="registered">Windows</trademark> XP e as versões posteriores têm essa capacidade. Portanto, adicionar uma impressora no <application>CUPS</application> nessas versões do <trademark class="registered">Windows</trademark> é muito fácil. Geralmente, o administrador <trademark class="registered">Windows</trademark> deverá executar o assistente do <trademark class="registered">Windows</trademark> <literal>Adicionar impressora </literal>, e selecionar <literal>Impressora de rede</literal> e, em seguida, inserir o <acronym>URI</acronym> na seguinte sintaxe:

source: If one has an older version of <trademark class="registered">Windows</trademark> without native <acronym>IPP</acronym> printing support, then the general means of connecting to a <application>CUPS</application> printer is to use <package>net/samba3</package> and <application>CUPS</application> together, which is a topic outside the scope of this chapter.
es_es: Si dispone de una versión antigua de <trademark class="registered">Windows</trademark> sin soporte nativo de impresión <acronym>IPP</acronym>, entonces la forma habitual de conectar una impresora a <application>CUPS</application> es usar <package>net/samba3</package> y <application>CUPS</application> juntos, pero eso es un tema fuera del alcance de este capítulo.

source: CUPS Troubleshooting
es_es: Solución de problemas en CUPS
pt_br: Solução de problemas do CUPS

source: Difficulties with <application>CUPS</application> often lies in permissions. First, double check the <citerefentry><refentrytitle>devfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> permissions as outlined above. Next, check the actual permissions of the devices created in the file system. It is also helpful to make sure your user is a member of the <systemitem class="groupname">cups</systemitem> group. If the permissions check boxes in the Administration section of the <application>CUPS</application> web interface do not seem to be working, another fix might be to manually backup the main <application>CUPS</application> configuration file located at <filename>/usr/local/etc/cups/cupsd.conf</filename> and edit the various configuration options and try different combinations of configuration options. One sample <filename>/usr/local/etc/cups/cupsd.conf</filename> to test is listed below. Please note that this sample <filename>cupsd.conf</filename> file sacrifices security for easier configuration; once the administrator successfully connects to the <application>CUPS</application> server and configures the clients, it is advisable to revisit this configuration file and begin locking down access.
es_es: A menudo, las dificultades con <application>CUPS</application> radican en los permisos. Primero, verifique dos veces los permisos de <citerefentry><refentrytitle>devfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> como se ha descrito anteriormente. A continuación, verifique los permisos actuales de los dispositivos creados en el sistema de archivos. También es útil asegurarse de que su usuario sea miembro del grupo <systemitem class="groupname">cups</systemitem>. Si las casillas de verificación de los permisos en la sección de Administración de la interfaz web de <application>CUPS</application> parecen no funcionar, otra solución sería realizar una backup manual del archivo de configuración principal de <application>CUPS</application> ubicado en <filename>/usr/local/etc/cups/cupsd.conf</filename>, editar las opciones y probar diferentes combinaciones de configuración. Un ejemplo de <filename>/usr/local/etc/cups/cupsd.conf</filename> para probar se muestra a continuación. Tenga en cuenta que el archivo de ejemplo <filename>cupsd.conf</filename> sacrifica la seguridad para facilitar la configuración; una vez que el administrador se conecte con éxito al servidor de <application>CUPS</application> y configure los clientes, es recomendable volver a editar este archivo de configuración y empezar a bloquear el acceso.

source: # Log general information in error_log - change "info" to "debug" for # troubleshooting... LogLevel info # Administrator user group... SystemGroup wheel # Listen for connections on Port 631. Port 631 #Listen localhost:631 Listen /var/run/cups.sock # Show shared printers on the local network. Browsing On BrowseOrder allow,deny #BrowseAllow @LOCAL BrowseAllow 192.168.1.* # change to local LAN settings BrowseAddress 192.168.1.* # change to local LAN settings # Default authentication type, when authentication is required... DefaultAuthType Basic DefaultEncryption Never # comment this line to allow encryption # Allow access to the server from any machine on the LAN &lt;Location /&gt; Order allow,deny #Allow localhost Allow 192.168.1.* # change to local LAN settings &lt;/Location&gt; # Allow access to the admin pages from any machine on the LAN &lt;Location /admin&gt; #Encryption Required Order allow,deny #Allow localhost Allow 192.168.1.* # change to local LAN settings &lt;/Location&gt; # Allow access to configuration files from any machine on the LAN &lt;Location /admin/conf&gt; AuthType Basic Require user @SYSTEM Order allow,deny #Allow localhost Allow 192.168.1.* # change to local LAN settings &lt;/Location&gt; # Set the default printer/job policies... &lt;Policy default&gt; # Job-related operations must be done by the owner or an administrator... &lt;Limit Send-Document Send-URI Hold-Job Release-Job Restart-Job Purge-Jobs \ Set-Job-Attributes Create-Job-Subscription Renew-Subscription Cancel-Subscription \ Get-Notifications Reprocess-Job Cancel-Current-Job Suspend-Current-Job Resume-Job \ CUPS-Move-Job&gt; Require user @OWNER @SYSTEM Order deny,allow &lt;/Limit&gt; # All administration operations require an administrator to authenticate... &lt;Limit Pause-Printer Resume-Printer Set-Printer-Attributes Enable-Printer \ Disable-Printer Pause-Printer-After-Current-Job Hold-New-Jobs Release-Held-New-Jobs \ Deactivate-Printer Activate-Printer Restart-Printer Shutdown-Printer Startup-Printer \ Promote-Job Schedule-Job-After CUPS-Add-Printer CUPS-Delete-Printer CUPS-Add-Class \ CUPS-Delete-Class CUPS-Accept-Jobs CUPS-Reject-Jobs CUPS-Set-Default&gt; AuthType Basic Require user @SYSTEM Order deny,allow &lt;/Limit&gt; # Only the owner or an administrator can cancel or authenticate a job... &lt;Limit Cancel-Job CUPS-Authenticate-Job&gt; Require user @OWNER @SYSTEM Order deny,allow &lt;/Limit&gt; &lt;Limit All&gt; Order deny,allow &lt;/Limit&gt; &lt;/Policy&gt;
es_es: # Registrar la información general en error_log - cambie "info" a "debug" para #la resolución de problemas... LogLevel info # Administrador del grupo de usuarios... SystemGroup wheel # Escuchar las conexiones en el puerto 631. Port 631 #Escuchar localhost:631 Listen /var/run/cups.sock # Mostrar impresoras compartidas en la red local. Browsing On BrowseOrder allow,deny #BrowseAllow @LOCAL BrowseAllow 192.168.1.* # change to local LAN settings BrowseAddress 192.168.1.* # change to local LAN settings # Tipo de autenticación predeterminado, cuando se requiere autenticación... DefaultAuthType Basic DefaultEncryption Never # comenta esta línea para permitir el cifrado # Permitir el acceso al servidor desde cualquier máquina en la LAN &lt;Location /&gt; Order allow,deny #Permitir localhost Allow 192.168.1.* # cambiar a la configuración de LAN local &lt;/Location&gt; # Permitir el acceso a las páginas de administración desde cualquier máquina en la LAN &lt;Location /admin&gt; #Cifrado requerido Order allow,deny #Permitir localhost Allow 192.168.1.* # cambiar a la configuración de LAN local &lt;/Location&gt; # Permitir el acceso a los archivos de configuración desde cualquier máquina en la LAN &lt;Location /admin/conf&gt; AuthType Basic Require user @SYSTEM Order allow,deny #Permitir localhost Allow 192.168.1.* # cambiar a la configuración de LAN local &lt;/Location&gt; # Establece las políticas predeterminadas de impresora/trabajo... &lt;Policy default&gt; # Las operaciones relacionadas con un job deben ser realizadas por el propietario o un administrador... &lt;Limit Send-Document Send-URI Hold-Job Release-Job Restart-Job Purge-Jobs \ Set-Job-Attributes Create-Job-Subscription Renew-Subscription Cancel-Subscription \ Get-Notifications Reprocess-Job Cancel-Current-Job Suspend-Current-Job Resume-Job \ CUPS-Move-Job&gt; Require user @OWNER @SYSTEM Order deny,allow &lt;/Limit&gt; # Todas las operaciones de administración requieren de un administrador para autenticarse... &lt;Limit Pause-Printer Resume-Printer Set-Printer-Attributes Enable-Printer \ Disable-Printer Pause-Printer-After-Current-Job Hold-New-Jobs Release-Held-New-Jobs \ Deactivate-Printer Activate-Printer Restart-Printer Shutdown-Printer Startup-Printer \ Promote-Job Schedule-Job-After CUPS-Add-Printer CUPS-Delete-Printer CUPS-Add-Class \ CUPS-Delete-Class CUPS-Accept-Jobs CUPS-Reject-Jobs CUPS-Set-Default&gt; AuthType Basic Require user @SYSTEM Order deny,allow &lt;/Limit&gt; # Solo el propietario o un administrador puede cancelar o autenticar un job... &lt;Limit Cancel-Job CUPS-Authenticate-Job&gt; Require user @OWNER @SYSTEM Order deny,allow &lt;/Limit&gt; &lt;Limit All&gt; Order deny,allow &lt;/Limit&gt; &lt;/Policy&gt;

source: Other optional, but recommended, packages are <package>print/gutenprint</package> and <package>print/hplip</package>, both of which add drivers and utilities for a variety of printers. Once installed, the <application>CUPS</application> configuration files can be found in the directory <filename>/usr/local/etc/cups</filename>.
pt_br: Outros pacotes opcionais, mas recomendados, são o <package>print/gutenprint</package> e o <package>print/hplip</package>, ambos adicionam drivers e utilitários para uma variedade de impressoras. Uma vez instalados, os arquivos de configuração do <application>CUPS</application> podem ser encontrados no diretório <filename>/usr/local/etc/cups</filename>.

source: If one has an older version of <trademark class="registered">Windows</trademark> without native <acronym>IPP</acronym> printing support, then the general means of connecting to a <application>CUPS</application> printer is to use <package>net/samba410</package> and <application>CUPS</application> together, which is a topic outside the scope of this chapter.
pt_br: Se alguém tiver uma versão mais antiga do <trademark class="registered">Windows</trademark> sem suporte a impressão nativa <acronym>IPP</acronym>, o meio geral de se conectar a uma impressora no <application>CUPS</application> é usar o software <package>net/samba410 </package> e o <application>CUPS</application> juntos, o que é um tópico fora do escopo deste artigo.

source: Difficulties with <application>CUPS</application> often lies in permissions. First, double check the <citerefentry><refentrytitle>devfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> permissions as outlined above. Next, check the actual permissions of the devices created in the file system. It is also helpful to make sure your user is a member of the <systemitem class="groupname">cups</systemitem> group. If the permissions check boxes in the Administration section of the <application>CUPS</application> web interface do not seem to be working, another fix might be to manually backup the main <application>CUPS</application> configuration file located at <filename>/usr/local/etc/cups/cupsd.conf</filename> and edit the various configuration options and try different combinations of configuration options. One sample <filename>/usr/local/etc/cups/cupsd.conf</filename> to test is listed below. Please note that this sample <filename>cupsd.conf</filename> sacrifices security for easier configuration; once the administrator successfully connects to the <application>CUPS</application> server and configures the clients, it is advisable to revisit this configuration file and begin locking down access.
pt_br: A maior parte dos problemas que ocorrem com o <application>CUPS</application> estão geralmente associados a problemas de permissão. Primeiro, verifique novamente as permissões do <citerefentry><refentrytitle>devfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> conforme descrito acima. Em seguida, verifique as permissões reais dos dispositivos criados no sistema de arquivos. Também é útil certificar-se de que seu usuário é membro do grupo <systemitem class="groupname">cups</systemitem>. Se as caixas de seleção de permissões na seção Administração da interface Web do <application>CUPS</application> não estiverem funcionando, outra correção poderá ser o backup manual do arquivo de configuração principal do <application>CUPS</application> localizado em <filename>/usr/local/etc/cups/cupsd.conf</filename> e edite as várias opções de configuração e experimente diferentes combinações de opções de configuração. Um exemplo do <filename>/usr/local/etc/cups/cupsd.conf</filename> para testar está listado abaixo. Por favor note que este exemplo de arquivo <filename>cupsd.conf</filename> sacrifica a segurança para facilitar a configuração; Depois que o administrador se conectar com êxito ao servidor do <application>CUPS</application> e configurar os clientes, é aconselhável revisitar esse arquivo de configuração para começar a fechar o acesso.
