<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/releases/4.1R/errata.sgml,v 1.2 2004/01/06 17:31:45 stephane Exp $">
<!ENTITY title "Errata pour FreeBSD 4.1">
<!ENTITY % navincludes SYSTEM "../../includes.navdownload.sgml"> %navincludes;
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.3

  Version francaise : Guillaume Pauchet <gpauchet@greengroom.com>
-->

<html>
&header;

<pre>
Si vous ne lisez aucune autre documentation avant l'installation de
cette version de FreeBSD, nous vous conseillons n&eacute;anmoins de
*LIRE CET ERRATA* afin de vous &eacute;viter de bloquer sur certains
probl&egrave;mes d&eacute;j&agrave; rencontr&eacute;s et corrig&eacute;s. Ce fichier ERRATA.TXT
est par d&eacute;finition obsol&egrave;te, c'est pourquoi d'autres copies mises
&agrave; jour sont disponibles sur le net et peuvent &ecirc;tre consult&eacute;es
dans la rubrique "current errata" pour votre version de FreeBSD.
Ces copies sont disponibles via les liens ci-dessous :

  1. <a href="http://www.FreeBSD.org/releases/">http://www.FreeBSD.org/releases/</a>

  2. ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/&lt;your-release&gt;/ERRATA.TXT
     (ainsi que sur les sites miroirs mis &agrave; jour).

Toute modification de ce fichier est &eacute;galement automatiquement envoy&eacute;e
par courrier &eacute;lectronique &agrave; :

	<a href="mailto:freebsd-current@FreeBSD.org">freebsd-current@FreeBSD.org</a>

Pour les conseils sur la s&eacute;curit&eacute;, consultez :

	<a href="http://www.FreeBSD.org/security/">http://www.FreeBSD.org/security/</a>

pour les derni&egrave;res informations sur les incidents de s&eacute;curit&eacute;.

---- Bulletins sur la S&eacute;curit&eacute; :

Conseils de s&eacute;curit&eacute; : Aucun

---- Informations sur la mise &agrave; jour du Syst&egrave;me :

Le gestionnaire de Boot FreeBSD (boot0) poss&egrave;de un bug qui suspend le processus de
d&eacute;marrage de la machine sans fournir de sortie &eacute;cran.

Solution : D&eacute;marrez votre machine gr&agrave;ce &agrave; une disquette de boot ou un CD-ROM, puis
t&eacute;l&eacute;chargez un nouveau binaire boot0 &agrave; l'adresse suivante :

	<a href="http://people.FreeBSD.org/~jhb/4.1R/i386/boot0">http://people.FreeBSD.org/~jhb/4.1R/i386/boot0</a>

D&egrave;s que vous avez r&eacute;cup&eacute;r&eacute; ce nouveau binaire, installez le gr&agrave;ce &agrave; la commande
boot0cfg sur votre disque dur. Par exemple, si boot0 est sur votre disque ad0,
lancez la commande suivante :

	/usr/sbin/boot0cfg -B -b /r&eacute;pertoire/ou/vous/avez/t&eacute;l&eacute;charg&eacute;/boot0 ad0

Vous pouvez &eacute;galement utiliser la commande cvsup afin de mettre &agrave; jour l'arborescence
de vos fichiers source et compiler votre nouveau binaire boot0 &agrave; partir de ces
fichiers. La version 1.14.2.3 ou suivante de src/sys/boot/i386/boot0/boot0.s est
requise.

Le checksum MD5 de ce fichier est :

	MD5 (boot0) = 8770a386dba44f0aa06b15db72c1f624

Pour v&eacute;rifier le checksum du fichier que vous avez t&eacute;l&eacute;charg&eacute;, ex&eacute;cutez
la commande suivante :

	/sbin/md5 /r&eacute;pertoire/ou/vous/avez/t&eacute;l&eacute;charg&eacute;/boot0

et comparez avec la valeur ci-dessus.

</pre>
<p></p><a href="../index.html">Accueil Versions</a>
&footer;
</body>
</html>
