<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY title "Observations sur la liste FreeBSD-advocacy, semaine se terminant le 5 Novembre 2000">
<!ENTITY date "$FreeBSD$">
<!ENTITY base "../../../..">
<!ENTITY % includes SYSTEM "../../../../includes.sgml"> %includes;
]>

<!-- 
   The FreeBSD French Documentation Project
   Original revision: 1.4
   
   Version francaise : Olivier Cherrier <Olivier.Cherrier@cediti.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
   &header;

    <table cellpadding="0" cellspacing="0">
      <tbody>
	<tr>
	  <th align="left">Dates</th>

	  <th align="center">Nb. messages</th>

	  <th align="left">Sujet</th>
	</tr>
	
	<tr>
	  <td valign="top">01 Nov - 03 Nov</td>
	  
	  <td valign="top" align="center">21</td>
	  
	  <td valign="top"><a href="#1">L'initiation &agrave; 
	    FreeBSD pour les d&eacute;butants</a></td>
 	</tr>
	
	<tr>
	  <td valign="top">03 Nov- 04 Nov</td>
	  
	  <td valign="top" align="center">8</td>
	  
	  <td valign="top"><a href="#2">Y-a-t'il des artistes 
	    int&eacute;ress&eacute;s par la r&eacute;alisation de banni&egrave;res FreeBSD 
	    au format GIF anim&eacute; ?</a></td>
        </tr>
	
	<tr>
	  <td valign="top">02 Nov - 05 Nov</td>
	  
	  <td valign="top" align="center">10</td>
	  
	  <td valign="top"><a href="#3">CounterStrike</a></td>
   	</tr>

	<tr>
	  <td valign="top">03 Nov - 05 Nov</td>
	  
	  <td valign="top" align="center">10</td>
	  
	  <td valign="top"><a href="#4">Installation : Que faut-il faire
	    et ne pas faire ?</a></td>
  	</tr>	
      </tbody>
    </table>

    <!-- 1 -->

    <hr noshade>

    <h3><a name="1"></a>01 Nov - 03 Nov (21 messages): <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=3453+0+archive/2000/freebsd-advocacy/20001105.freebsd-advocacy">L'initiation &agrave; FreeBSD pour les d&eacute;butants</a></h3>
    
    <p>Suite &agrave; la grande discussion sur la liste freebsd-questions au sujet 
      de l'utilisation de /stand/sysintall pour les d&eacute;butants, 
      <a href="mailto:mj@isy.liu.se">[Micke Josefsson]</a> a lanc&eacute; un appel 
      aux commentaires et suggestions sur la liste dans l'optique d'une 
      nouvelle interface graphique pour les installations ordinaires.</p>

    <p>Voici quelques &eacute;minentes id&eacute;es :</p>

    <blockquote>
      <p><i>Je pense qu'il devrait y avoir dans sysinstall (ou dans ce 
        qui le remplacerait) des explications sur ce qui se passe &agrave; 
        chaque &eacute;tape et sur les termes importants... 
        Les termes dont je parle sont ceux sp&eacute;cifiques &agrave; FreeBSD 
        (par oppositions aux termes UNIX g&eacute;n&eacute;riques comme "utilisateurs"
        et "groupes") sur lesquels tous les d&eacute;butants s'interrogent, 
        comme par exemple le partitionnement des disques, la notion de 
        distribution, les ports, les packages. Le contexte de chaque 
        &eacute;tape n'est pas expliqu&eacute;.</i> - <a href="mailto:sjt@cisco.com">[Steve 
        Tremblett]</a></p>
    </blockquote>

    <blockquote>
      <p><i>Compte tenu du fait que nos nouveaux utilisateurs viennent 
      	soit de Windows soit de Linux, nous avons besoin d'un programme 
      	d'installation qui serait plus comme ceux qu'ils ont l'habitude 
      	d'utiliser. Je suis souvent &eacute;tonn&eacute; de voir combien d'utilisateurs 
      	potentiels nous perdons lorsqu'ils essaient d'installer le 
      	syst&egrave;me d'exploitation. Ce que j'aimerais vraiment voir c'est un 
      	programme d'installation de FreeBSD ressemblant &agrave; celui d'UnixWare 
      	7 ou de Tru64 5.0 (une copie de SCO Admin serait 
      	agr&eacute;able aussi !). A d&eacute;faut de ceci, nous avons plut&ocirc;t besoin 
      	de quelque chose similaire &agrave; un programme d'installation Linux ou 
      	bien une pierre de rosette.</i>
	- <a href="mailto:bob@inu.net">[Bob Martin]</a></p>
    </blockquote>

    <blockquote>
      <p><i>A vrai dire, un des inconv&eacute;nients de sysinstall, bien que 
        n'&eacute;tant pas un aspect technique, est son image. Chaque fois que 
        je discute avec des gens qui installent linux, ils disent "Ouais, 
        regarde toutes ces belles couleurs, hoooo l'installation avec 
        interface graphique ... est-ce que FreeBSD a &ccedil;a ???"
        Bien s&ucirc;r, &eacute;tant l'&ecirc;tre civilis&eacute; que je suis, au lieu de leurs 
        donner une fess&eacute;e, je les laisse finir d'installer, et me 
        moque de linuxconf qui plante pour la 20 i&egrave;me fois ...
        En conclusion, afin de rendre la premi&egrave;re installation plus 
        facile pour un novice/un d&eacute;butant sous Unix/ma grand-m&egrave;re, oui, 
        sysinstall a besoin d'&ecirc;tre attirant.</i> - 
        <a href="mailto:wyldephyre2@yahoo.com">[Haikal Saadh]</a></p>
    </blockquote>

    <blockquote>
      <p><i>Ce qui est absolument exasp&eacute;rant est la fa&ccedil;on dont le 
      	programme accepte des donn&eacute;es de l'utilisateur. Parfois, vous 
      	pressez (ou on attend que vous pressiez) &lt;ENTREE&gt; et 
      	d'autres fois on attend que vous pressiez &lt;ESPACE&gt;. 
      	Mais, le pire est lorsque vous avez fini d'installer le 
      	syst&egrave;me d'exploitation et que vous vous retrouvez dans un menu 
      	vous disant de faire les r&eacute;glages finaux. Si vous d&eacute;cidez de faire
         ces r&eacute;glages, ce p***in de programme d'installation r&eacute;installe tout 
         le syst&egrave;me d'exploitation ! C'est outrageant !</i> - 
         <a href="mailto:ignacioc@avantel.net">[Ignacio Cristerna]</a></p>
    </blockquote>

    <p>Manifestement, nous sommes tous d'accord &ndash; nous avons 
      besoin d'une sorte de "programme d'installation initial" pour 
      les d&eacute;butants venant de Windows, Linux etc ... et selon 
      <a href="mailto:jkh@winston.osd.bsdi.com">[Jordan Hubbard]</a>, 
      cette discussion durera encore tr&egrave;s tr&egrave;s tr&egrave;s longtemps...</p>

    <blockquote>
      <p><i>Ce n'est pas que je veux &ecirc;tre rabat-joie ici, mais nous 
        tenons cette discussion (et ce, dans les m&ecirc;mes propos) depuis 
	7 ans maintenant. Elaborer un programme d'installation ne 
	contenant qu'un gros bouton qui pourrait &ecirc;tre press&eacute; par 
	votre grand-m&egrave;re est un travail difficile; la question 
	r&eacute;currente  est "Qui va donc bien pouvoir &eacute;crire un tel 
	programme ?"</i></p>

      <p><i>C'est g&eacute;n&eacute;ralement ici que s'arr&ecirc;te la discussion. Tout le 
        monde peut d&eacute;crire un programme d'installation qui suive les 
	traces de ceux de Windows, Solaris ou m&ecirc;me Mac-OS X maintenant que 
	nous pouvons l'examiner puisque l'imitation est un puissant 
	d&eacute;fi d'impl&eacute;mentation. Comme je l'ai dit en premier en 1993, 
	"Qui r&eacute;alisera cet important travail et cr&eacute;era ce programme 
	d'installation alternatif de fa&ccedil;on &agrave; ce que nous puissions l'&eacute;valuer 
	en toute objectivit&eacute; et en faire m&ecirc;me peut-&ecirc;tre le programme 
	d'installation par d&eacute;faut ?" J'attends maintenant depuis 7 ans 
	la r&eacute;ponse &agrave; cette question :-)"</i></p>
    </blockquote>

    <!-- 2 -->

    <hr noshade>

    <h3><a name="2"></a>03 Nov - 04 Nov (10 messages): <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=94417+0+archive/2000/freebsd-advocacy/20001105.freebsd-advocacy">Y a-t-il des artistes int&eacute;ress&eacute;s par la r&eacute;alisation 
de banni&egrave;res FreeBSD au format GIF anim&eacute; ?</a></h3>

    <p><a href="mailto:jkh@winston.osd.bsdi.com">[Jordan Hubbard]</a> 
      demande si des graphistes talentueux sont int&eacute;ress&eacute;s par la r&eacute;alisation 
      d'une banni&egrave;re publicitaire pour divers sites dont <a
      href="http://www.daemonnews.org">D&aelig;monNews</a>. 
      L'image doit &ecirc;tre de 468x60 pixels et ne doit pas exc&eacute;der 20ko. Ceci 
      est pour promouvoir le projet FreeBSD, alors, lancez votre Gimp ou ce 
      que vous voulez et envoyer un email &agrave; Jordan en joignant ce que vous avez 
      r&eacute;alis&eacute;. Rappelez-vous, vous ne serez pas r&eacute;mun&eacute;r&eacute;, les 
      sensations fortes ressenties en travaillant pour le projet FreeBSD doivent 
      vous suffire :-)</p>

    <!-- 3 -->

    <hr noshade>

    <h3><a name="3"></a>02 Nov - 05 Nov (10 messages): <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=77785+0+archive/2000/freebsd-advocacy/20001105.freebsd-advocacy">CounterStrike</a></h3>

    <p>Cette discussion a commenc&eacute; avec l'email de <a
      href="mailto:mbendiks@eunet.no">[Marius Bendiksen]</a> qui nous 
      conseillait de demander le port d'un serveur CounterStrike (similaire 
      &agrave; HalfLife). La premi&egrave;re &eacute;tape aurait &eacute;t&eacute; de r&eacute;aliser un port du serveur
      Linux, puis de demander &agrave; Sierra Games un port natif.
      <a href="mailto:dchance@valuedata.net">[Daryl Chance]</a>
      r&eacute;pondit 'make search key=halflife', ce qui signifiait en fait que le 
      serveur avait d&eacute;j&agrave; &eacute;t&eacute; port&eacute;. Marius pense que le jeux en lui m&ecirc;me 
      devrait &ecirc;tre port&eacute;...</p>

    <p>Une sous-discussion au sujet du syst&egrave;me Open Sound compar&eacute; au 
      support audio natif de FreeBSD pour l'utilisation des jeux les plus r&eacute;pandus
      s'en est suivie, et, <a href="mailto:">[Terry Lambert]</a> dit :</p>

    <blockquote>
      <p><i>La plupart des jeux n&eacute;cessitent une API sp&eacute;cifique pour la carte 
        audio. Cette API est support&eacute;e nativement par Linux, mais ce n'est 
	pas le cas sous FreeBSD. Pour utiliser cette API, vous devez avoir 
	des drivers tiers (OSS) pour votre carte audio ou modifier l'API 
	de FreeBSD. Lorsque vous sugg&eacute;rez ceci aux personnes g&eacute;rant 
	les drivers audio, ils ont tendance &agrave; se f&acirc;cher et avancent 
	que leur API est meilleure que celle de Linux."</i></p>

      <p><i>Les drivers OSS ne sont pas libres, ils co&ucirc;tent de l'argent, mais 
        vous pouvez les utiliser en mode &eacute;valuation pendant 30 jours; 
	ainsi, si vous souhaitez jouer &agrave; un jeu et ne pas payer les 
	drivers, vous devez les r&eacute;-installer tous les 30 jours 
	(personnellement, j'appelle cela "payer ch&egrave;rement les 
	drivers").</i></p>
    </blockquote>

    <p>Ce &agrave; quoi <a href="mailto:des@ofug.org">[Dag-Erling Smorgrav]</a> 
      a r&eacute;pondu :</p>

    <blockquote>
      <p><i>Conneries. FreeBSD impl&eacute;mente l'API OSS ou, tout du moins, essaie.
        Si quelque chose ne fonctionne pas, soumettez un PR ou m&ecirc;me mieux, des 
   patchs au lieu de r&acirc;ler et de propager de la d&eacute;sinformation.</i></p>
    </blockquote>

    <p><a href="mailto:jkh@winston.osd.bsdi.com">[Jordan]</a> et <a
      href="mailto:jameso@elwood.net">[Jim]</a> nous assurent que les jeux 
      Loki se trouvant dans les ports sont en mesure de jouer des sons 
      &agrave; l'aide du driver audio classique et ceci, sans qu'il soit n&eacute;cessaire
      de modifier les jeux ou le syst&egrave;me.</p>

    <!-- 4 -->

    <hr noshade>

    <h3><a name="4"></a>03 Nov - 05 Nov (10 messages):  <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=96164+0+archive/2000/freebsd-advocacy/20001105.freebsd-advocacy">Installation: Que faut-il faire et ne pas faire ?</a></h3>

    <p>Ici nous avons Terry Lambert et Jordan Hubbard qui discutent 
      du fil de discussion pr&eacute;c&eacute;dent au sujet du programme 
      d'installation de FreeBSD. Nous passerons la longue conversation entre 
      eux deux, mais pour r&eacute;sumer, il en est ressorti : </p>

    <blockquote>
      <p><i>Je fais simplement remarquer que voil&agrave; maintenant plus 
        d'un an que FreeBSD n'a pas b&eacute;n&eacute;fici&eacute; d'un nouveau programme 
        d'installation et si leurs conditions avaient &eacute;t&eacute; accept&eacute;es
        il y a un an, FreeBSD aurait maintenant son nouveau code source
        pour le programme d'installation, et avec les conditions sur 
        lesquels vous insistez.</i></p>

      <p><i>Alors maintenant, c'est &agrave; votre tour d'avancer ou de vous taire; 
      je ne PEUX PAS consacrer les efforts n&eacute;cessaires 
	&agrave; la r&eacute;alisation de ce travail sans avoir la garantie qu'ils 
	ne seront pas vains, comme cela l'a pourtant &eacute;t&eacute; la derni&egrave;re 
	fois que j'ai travaill&eacute; sur ce projet et sur des projets 
	similaires pour le compte de FreeBSD. Je n'en AI PAS les 
	moyens.</i> - <a href="mailto:tlambert@primenet.com">
	[Terry Lambert]</a></p>
    </blockquote>

    <blockquote>
      <p><i>Ceci est une sp&eacute;culation d&eacute;guis&eacute;e en fait. Vous n'avez 
        aucun moyen s&ucirc;r de savoir si cela, en fait, serait arriv&eacute; ou
        si "deux FreeBSDs" auraient &eacute;t&eacute; largement accept&eacute;s par les 
        participants au projet ou par les utilisateurs. Je le crois 
        d'autant plus que vos myst&eacute;rieux bienfaiteurs commerciaux 
        auraient &eacute;t&eacute; assaillis par les demandes visant &agrave; ce qu'ils 
        rendent imm&eacute;diatement leur produit en open-source afin que 
        les gens puissent l'adapter &agrave; leurs besoins et ceci aurait 
        conduit &agrave; un sentiment d'harc&egrave;lement pour vos bienfaiteurs 
        et &agrave; de maigres r&eacute;sultats. Vous n'avez simplement aucun moyen
        d'&ecirc;tre s&ucirc;r de ce que vous avancez.</i></p>

      <p><i>Comme je vous l'ai d&eacute;j&agrave; dit plusieurs fois, Terry, 
      	personne au sein de ce projet ne peut obtenir une garantie
      	sur quoi que ce soit puisqu'il ne s'agit en aucun cas d'un
         concessionnaire d'&eacute;quipements de cuisine qui distribue des garanties 
      	commerciales limit&eacute;es avec chaque r&eacute;frig&eacute;rateur qu'il 
      	vend. Ce que vous obtenez est la chance de communiquer
      	avec un important groupe de personnes et d'essayer, au 
      	travers de beaucoup d'efforts et de pers&eacute;v&eacute;rance, de 
      	faire accepter vos id&eacute;es et (plus important) le code 
      	source de votre travail. M&ecirc;me si je souhaitais changer 
      	cela pour que &ccedil;a vous plaise, je ne le pourrais pas puisque 
      	que je n'ai pas les pouvoirs d'hypnotiser les cerveaux de 
      	plusieurs centaines de personnes pour les rendre d&eacute;sireux
      	de vous acheter une voiture d'occasion.
      	C'est quelque chose que vous seul pouvez faire. Et c'est la 
         m&ecirc;me chose pour tout le monde. Pour &ecirc;tre 
      	concis, c'est la vie alors, faites avec.</i> - 
      	<a href="mailto:jkh@winston.osd.bsdi.com">[Jordan
	Hubbard]</a></p>
    </blockquote>

    <hr noshade>

    <p>Ces observations t&eacute;moignent de ma compr&eacute;hension des 
      discussions qui se d&eacute;roulent sur la liste de distribution 
      FreeBSD-advocacy durant la semaine indiqu&eacute;e.</p>

    <p>Hol&agrave;, je suis humaine... J'ai pu commettre une erreur ou deux ... 
      Si vous pensez que c'est le cas ou si vous trouvez que j'ai 
      oubli&eacute; des messages significatifs alors, libre &agrave; vous de me 
      contacter via email.</p>

    <p align="right">- <a href="mailto:bean@internal.org">Rebecca "Bean"
      Visger</a></p>

    <hr noshade>
     
    &footer;
  </body> 
</html>
