<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY title "FreeBSD-advocacy Conspectus, semaine se terminant le 12 Novembre 2000">
<!ENTITY date "$FreeBSD$">
<!ENTITY base "../../../..">
<!ENTITY % includes SYSTEM "../../../../includes.sgml"> %includes;
]>

<!-- 
   The FreeBSD French Documentation Project
   Original revision: 1.3

   Version francaise : Stephane Legrand <stephane@freebsd-fr.org> 
-->

<html>
   &header;

    <table cellpadding="0" cellspacing="0">
      <tbody>
	<tr>
	  <th align="left">Dates</th>

	  <th align="center">Nb de messages</th>

	  <th align="left">Sujet</th>
	</tr>
	
	<tr>
	  <td valign="top">08 Nov</td>
	  
	  <td valign="top" align="center">3</td>
	  
	  <td valign="top"><a href="#1">acc&egrave;s &agrave; un site
	    portail</a></td>
 	</tr>
	
	<tr>
	  <td valign="top">06 Nov - 12 Nov</td>
	  
	  <td valign="top" align="center">17</td>
	  
	  <td valign="top"><a href="#2">Y-a-t'il un artiste int&eacute;ress&eacute;
	    pour faire une banni&egrave;re FreeBSD en GIF anim&eacute; ?</a></td>
        </tr>
	
	<tr>
	  <td valign="top">06 Nov - 08 Nov</td>
	  
	  <td valign="top" align="center">9</td>
	  
	  <td valign="top"><a href="#3">CounterStrike</a></td>
   	</tr>

	<tr>
	  <td valign="top">10 Nov</td>
	  
	  <td valign="top" align="center">2</td>
	  
	  <td valign="top"><a href="#4">Fondation FreeBSD : exemples de
	    FreeBSD utilis&eacute; comme plate-forme de recherche/aide &agrave; l'enseignement</a></td>
  	</tr>

	<tr>
	  <td valign="top">07 Nov</td>

	  <td valign="top" align="center">2</td>

	  <td valign="top"><a href="#5">Un bon exemple de promotion de FreeBSD</a></td>
	</tr>

	<tr>
	  <td valign="top">06 Nov - 12 Nov</td>

	  <td valign="top" align="center">7</td>

	  <td valign="top"><a href="#6">Installation : que faire (et ne pas faire) &agrave; ce
	    propos</a></td>
	</tr>
      </tbody>
    </table>

    <!-- 1 -->

    <hr noshade>

    <h3><a name="1"></a>08 Nov (3 messages) :  <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=77068+0+archive/2000/freebsd-advocacy/20001112.freebsd-advocacy">acc&egrave;s &agrave; un site portail</a></h3>

    <p>Tout a commenc&eacute; avec une lettre de r&eacute;clamation plut&ocirc;t mal &eacute;crite, envoy&eacute;e en
      copie par un repr&eacute;sentant de "Freedom Technologies Corporation", une
      soci&eacute;t&eacute; qui propose des syst&egrave;mes FreeBSD pr&eacute;-install&eacute;s. Il semblait &eacute;nerv&eacute;
      au sujet d'une URL sur le site web Intel qui ne fonctionnait que sous
      IE et utilisait cela pour vendre ses services. Quelques r&eacute;ponses
      lui ont fait rapidement comprendre que nous n'aimions pas ce genre de pratique.</p>

    <!-- 2 -->

    <hr noshade>

    <h3><a name="2"></a>6 Nov - 12 Nov (17 messages) :  <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=25663+0+archive/2000/freebsd-advocacy/20001112.freebsd-advocacy">Y-a-t'il un artiste int&eacute;ress&eacute; pour faire une banni&egrave;re FreeBSD en GIF anim&eacute; ?</a></h3>

    <p>Une suite au <a href="05.html#2">fil de discussion de la semaine derni&egrave;re</a>, voici
      quelques exemples de propositions :</p>

    <ul>
      <li><a
	href="http://www.lpt.ens.fr/~rsidd/freebsd.gif">http://www.lpt.ens.fr/~rsidd/freebsd.gif</a> 
	- <a href="mailto:rsidd@physics.iisc.ernet.in">Rahul
	Siddharthan</a></li>

      <li><a
	href="http://bean.internal.org/freebsd_banner2.gif">http://bean.internal.org/freebsd_banner2.gif</a> 
	- <a href="mailto:bean@internal.org">Bean</a></li>
    </ul>

    <!-- 3 -->

    <hr noshade>

    <h3><a name="3"></a>06 Nov - 08 Nov (9 messages) : <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=2406+0+archive/2000/freebsd-advocacy/20001112.freebsd-advocacy">CounterStrike</a></h3>

    <p>Cette discussion avait &eacute;galement commenc&eacute; <a href="05.html#3">la semaine
      derni&egrave;re</a>. Le point suivant a &eacute;t&eacute; soulev&eacute; :</p>

    <blockquote>
      <p><i>Quelques jeux ont des bugs qui se manifestent uniquement sur
	FreeBSD mais pas sur Linux, probablement parce que FreeBSD respecte les 
	sp&eacute;cifications au lieu d'&eacute;muler chaque bug de OSS ou de Linux</i> - <a
	href="mailto:des@ofug.org">[Dag-Erling Smorgrav]</a></p>
    </blockquote>

    <!-- 4 -->

    <hr noshade>

    <h3><a name="4"></a>10 Nov (2 messages) : <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=92969+0+archive/2000/freebsd-advocacy/20001112.freebsd-advocacy">Fondation FreeBSD : exemples de FreeBSD utilis&eacute; comme plate-forme de recherche/aide &agrave; l'enseignement</a></h3>

    <p><a href="mailto:keichii@iteration.net">[Michael Wu]</a> nous a envoy&eacute;s
      quelques exemples sp&eacute;cifiques d'utilisations de FreeBSD en tant que plate-forme 
      de recherche/d'aide &agrave; l'enseignement dans des &eacute;tablissements de formation.</p>

    <ul>
      <li><a href="http://www.csie.nctu.edu.tw/os">National Chiao Tung
	University</A> - Le D&eacute;partement d'Informatique et de Traitement
	de l'Information de cette universit&eacute; de Ta&iuml;wan utilise FreeBSD
	pour l'enseignement en Architecture des Syst&egrave;mes d'Exploitation. Environ 10 &agrave; 15 % des stations en *.edu.tw
	fonctionnent sous FreeBSD, ainsi qu'une grande partie des stations pr&eacute;sentes dans les dortoirs des &eacute;tudiants.</li>

      <li><a href="http://ece.utexas.edu">Universit&eacute; du Texas &agrave; Austin</a> 
	- en tant qu'assistant d'enseignement, Michael utilise FreeBSD comme
	suppl&eacute;ment &agrave; ses cours. Le Professeur utilise C++, Codewarrior/x86,
	et il a d&eacute;cid&eacute; de ne pas avoir d'opinion &agrave; ce sujet.</li>

      <li><a href="http://physics.purdue.edu">Purdue</a> - utilise FreeBSD
	dans leurs laboratoires d'informatique d'apr&egrave;s <a
	href="mailto:will@FreeBSD.org">[Will Andrews]</a>.</li>

      <li><a href="http://www.usc.edu/dept/engineering/infotech/ITP%20499%20Unix%20System%20Administration.htm">University
	de Californie du Sud</a> - propose un cours sur l'Administration Syst&egrave;me
        sous FreeBSD mais <a href="mailto:kris@FreeBSD.org">[Kris
	Kennaway]</a> ne sait pas s'il est propos&eacute; souvent. Le livre "The Complete
	FreeBSD" par Greg Lehey est demand&eacute; pour ce cours.</li>
    </ul>

    <!-- 5 -->

    <hr noshade>

    <h3><a name="5"></a>7 Nov (2 messages) : <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=50179+0+archive/2000/freebsd-advocacy/20001112.freebsd-advocacy">Un bon exemple de promotion de FreeBSD</a></h3>

    <p><a href="mailto:asmodai@wxs.nl">[Jeroen Ruigrok van der Werven]</a>
      a voulu nous parl&eacute; d'un livre qu'il a r&eacute;cemment achet&eacute;. Il semble
      que Warren W. Gay a &eacute;crit un livre intitul&eacute; "Advanced UNIX
      Programming" qui utilise FreeBSD 3.4-RELEASE pour tous les
      exemples. Warren soutient &eacute;galement FreeBSD et le mentionne tr&egrave;s
      souvent. Si vous voulez d&eacute;couvrir ce livre, je l'ai trouv&eacute; sur <a
      href="http://www.amazon.com/exec/obidos/ASIN/067231990X/o/qid=974177545/sr=8-2/ref=aps_sr_b_1_2/105-8987692-0849559">Amazon</a>.
      Le num&eacute;ro ISBN est 0-672-31990-X.</p>.

    <!-- 6 -->

    <hr noshade>

    <h3><a name="6"></a>6 Nov - 12 Nov (7 messages) : <a href="http://docs.FreeBSD.org/cgi/getmsg.cgi?fetch=4779+0+archive/2000/freebsd-advocacy/20001112.freebsd-advocacy">Installation : que faire (et ne pas faire) &agrave; ce propos</a></h3>

    <p>Une autre discussion qui entre dans sa deuxi&egrave;me semaine, Terry & Jordan discutent toujours
      d'une alternative au programme /stand/sysinstall. Plusieurs choses
      int&eacute;ressantes :</p>

    <blockquote>
      <p><i>Il serait b&eacute;n&eacute;fique que le projet publie un plan 
	qui indiquerait aux d&eacute;veloppeurs ce qu'il serait souhaitable de faire de mani&egrave;re &agrave; leur &eacute;viter
	de passer un temps incroyable sur un projet, tout cela pour &ecirc;tre arr&ecirc;ter net
	plus tard. Si seulement le projet voulait au moins publier un plan
	g&eacute;n&eacute;ral pour simplement les six mois &agrave; venir, je pense que cela 
	aiderait &agrave; rassembler davantage de gens pr&ecirc;ts &agrave; faire les efforts n&eacute;cessaires 
	pour atteindre ces objectifs.</i></p>

      <p><i>Clairement, le projet SMPng est tr&egrave;s largement connu
 	gr&acirc;ce &agrave; Jason Evans et d'autres qui publient leurs progr&egrave;s et leurs
	directions. Si le projet pouvait faire de m&ecirc;me dans d'autres domaines, 
   il y aurait une "garantie" que, m&ecirc;me si votre travail est finalement
	rejet&eacute;, au moins vous saviez que vous alliez dans
	la bonne direction, au lieu de se fixer son propre 
	objectif, pour qu'au bout du compte le projet vous dise "c'est tr&egrave;s bien, mais ce n'est 
	pas ce dont nous avons besoin". Mettez au moins quelques panneaux de signalisation".</i>
	- <a href="mailto:terry@lambert.org">[Terry Lambert]</a></p>
    </blockquote>

    <blockquote>
      <p><i>Ces directions g&eacute;n&eacute;rales sont &eacute;crites par des gens qui ont le temps et 
   l'&eacute;nergie d'en &eacute;crire. Une des raisons pour laquelle le projet SMPng se d&eacute;roule aussi bien est
	que nous avons pay&eacute; pour organiser une r&eacute;union entre une poign&eacute;e de gens de fa&ccedil;on
	&agrave; ce qu'ils travaillent ensemble de mani&egrave;re plus coh&eacute;rente et qu'ensuite nous avons continu&eacute; 
	&agrave; payer le responsable du projet pour qu'il puisse s'en occuper &agrave; plein temps.
	La direction de projet est tr&egrave;s importante d&egrave;s que cela concerne la production et 
	l'impl&eacute;mentation des documents de directions g&eacute;n&eacute;rales et il est aussi difficile 
	de le faire faire sur une base uniquement volontaire qu'il est difficile 
	pour une entreprise de payer pour cela dans tous les domaines o&ugrave; c'est n&eacute;cessaire.</i></p>

      <p><i>J'adorerais voir davantage de direction de projet et davantage de directions g&eacute;n&eacute;rales mais
	j'ai aussi appris &agrave; vivre avec le fait qu'il n'y en aura jamais autant que 
	moi ou la plupart des autres souhaiterait qu'il n'y en ai.</i> - <a
	href="mailto:jkh@winston.osd.bsdi.com">[Jordan Hubbard]</a></p>
    </blockquote>

    <hr noshade>

    <p>Ces observations t&eacute;moignent de ma compr&eacute;hension des 
      discussions qui se d&eacute;roulent sur la liste de distribution 
      FreeBSD-advocacy durant la semaine indiqu&eacute;e.</p>

    <p>Hol&agrave;, je suis humaine... J'ai pu commettre une erreur ou deux ... 
      Si vous pensez que c'est le cas ou si vous trouvez que j'ai 
      oubli&eacute; des messages significatifs alors, libre &agrave; vous de me 
      contacter via email.</p>

    <p align="right">- <a href="mailto:bean@internal.org">Rebecca "Bean"
      Visger</a></p>

    <hr noshade>

    &footer;
  </body> 
</html>
