<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD: doc/fr_FR.ISO8859-1/articles/ppp/article.sgml,v 1.1 1999/11/10 21:28:27 nik Exp $
     Original revision: n.nn
-->   

<!DOCTYPE ARTICLE PUBLIC "-//FreeBSD//DTD DocBook V3.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN"> %man;
<!ENTITY % urls PUBLIC "-//FreeBSD//ENTITIES Common Document URL Entities//FR"> %urls;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR"> %abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR"> %artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;

<!ENTITY % authors SYSTEM "../../../en_US.ISO8859-1/books/handbook/authors.ent"> %authors;
<!ENTITY % mailing-lists SYSTEM "../../books/handbook/mailing-lists.ent"> %mailing-lists;
 <!ENTITY rel.current CDATA "3.2">
]>

<article lang="fr">
<artheader>
<title>P&eacute;dants Principes PPP</title>
&artheader.copyright;
<abstract>
&abstract.license;
&abstract.disclaimer;
&trans.a.haby;
</abstract>
</artheader>
<sect1>
<title>Introduction</title>
<para>Le protocole de connexion PPP en mode utilisateur de la version 2.2 de
FreeBSD (appel&eacute; aussi &ldquo;IIJ-PPP&rdquo;) supporte maintenant
la r&eacute;&eacute;criture de paquets pour les connexions &agrave; l'Internet. Cette possibilit&eacute;,
connue aussi sous le nom de &ldquo;Mascarade (Masquerading)&rdquo;, 
&ldquo;Alias IP (IP Aliasing)&rdquo;, ou &ldquo;Traduction d'Adresse
R&eacute;seau (Network Adresse Translation)&rdquo;, permet &agrave; un syst&egrave;me FreeBSD
d'interagir comme routeur de connexion &agrave; la demande entre un r&eacute;seau local
et un fournisseur d'acc&egrave;s &agrave; Internet. Les machines du r&eacute;seau local peuvent
utiliser l'unique connexion de la machine FreeBSD &agrave; l'Internet pour &eacute;changer
des informations avec ce dernier.</para>
<sect2>
<title>But de ce document</title>
<para>Ce document<footnote><para>N.d.T: Si vous souhaitez consulter le document
original en langue anglaise, il se trouve sur 
<ulink url="http://www.FreeBSD.org/tutorials/ppp/ppp.html">http://www.FreeBSD.org/ppp/ppp.html</ulink>.</para></footnote>
vous explique comment:</para>
<itemizedlist>
<listitem><para>Configurer le syst&egrave;me FreeBSD pour permettre les connexions 
vers l'ext&eacute;rieur,</para></listitem>
<listitem><para>Partager une seule connexion vers l'ext&eacute;rieur avec les autres 
machines du r&eacute;seau,</para></listitem>
<listitem><para>Configurer les machines Windows pour utiliser la machine 
FreeBSD comme passerelle vers l'Internet.</para></listitem>
</itemizedlist>
<para>Bien que l'objectif de ce document soit avant tout d'expliquer comment
configurer la traduction d'adresses IP, il fournit aussi des exemples 
d'installation et de configuration des autres composants. Chaque section
est ind&eacute;pendante et peut &ecirc;tre utilis&eacute;e pour configurer divers aspects d'une
passerelle FreeBSD entre plusieurs r&eacute;seaux.</para>
</sect2>
</sect1>
<sect1 id="sect2">
<title>Mise en oeuvre du r&eacute;seau local</title>
<para>Bien que le programme <command>ppp</command> puisse, et soit g&eacute;n&eacute;ralement
utilis&eacute; pour fournir des services &agrave; la <emphasis>seule</emphasis> machine
FreeBSD, il peut aussi servir &agrave; en faire une &ldquo;passerelle&rdquo; ou
&ldquo;routeur&rdquo; entre les autres dispositifs reli&eacute;s au r&eacute;seau local
et l'Internet ou tout autre service connect&eacute;.</para> 
<sect2>
<title>Topologie classique du r&eacute;seau</title>
<para>Ce document s'applique &agrave; un r&eacute;seau local dont la 
topologie est&nbsp;-&nbsp;classiquement&nbsp;-&nbsp;la suivante:</para>
<programlisting>

+=========+      =======> Connexion &agrave; Internet ( Wanadoo, AOL, etc. )
|         |      \
| FreeBSD |=======
| "Curly" |
|         |
+====+====+
     |
|=================+============+====|  <== R&eacute;seau Local Ethernet
     |            |            |
+====+====+  +====+====+  +====+====+
|         |  |         |  |         |
|  Win95  |  |   WFW   |  |  WinNT  |
| "Larry" |  |  "Moe"  |  | "Shemp" |
|         |  |         |  |         |
+=========+  +=========+  +=========+

</programlisting>
</sect2>
<sect2>
<title>Hypoth&egrave;ses sur le r&eacute;seau local</title>
<para>Pour les besoins de notre exemple, nous supposerons que :</para>
<para>Il y a trois stations et un serveur reli&eacute;s par le r&eacute;seau Ethernet 
local:</para>
<itemizedlist>
<listitem><para>un serveur FreeBSD (&ldquo;Curly&rdquo;) avec un contr&ocirc;leur 
Ethernet NE-2000 configur&eacute; sur &ldquo;ed0&rdquo;,</para></listitem>
<listitem><para>une station de travail Windows 95 (&ldquo;Larry&rdquo;) avec 
les pilotes TCP/IP 32-bits natifs de Microsoft,</para></listitem>
<listitem><para>une station de travail Windows for Workgroups 
(&ldquo;Larry&rdquo;) avec les extension TCP/IP 16-bits de
Microsoft,</para></listitem>
<listitem><para>une station de travail Windows NT (&ldquo;Larry&rdquo;) avec 
les pilotes TCP/IP 32-bits natifs de Microsoft.</para></listitem>
</itemizedlist>
<para>Les adresses IP du r&eacute;seau Ethernet sur lequel se base notre exemple
ont &eacute;t&eacute; attribu&eacute;es dans l'espace d'adresses priv&eacute;es d&eacute;fini par la RFC-1597, 
comme suit:</para>
<programlisting>
Nom       Adresse IP
"Curly"   192.168.1.1   # La machine FreeBSD
"Larry"   192.168.1.2   # La machine Windows 95
"Moe"     192.168.1.3   # La machine Windows for Workgroups
"Shemp"   192.168.1.4   # La machine Windows NT
</programlisting>
<para>Nous supposerons aussi que le modem est connect&eacute; sur le premier port s&eacute;rie
(<filename>/dev/cuaa0</filename> ou <filename>COM1:</filename> selon la
terminologie DOS) de la machine FreeBSD.</para> 
<para>Enfin, nous supposerons que notre fournisseur d'acc&egrave;s Internet nous
fournit automatiquement les adresses IP des deux extr&eacute;mit&eacute;s de la liaison PPP
(point &agrave; point) : celle de notre machine FreeBSD et celle de la machine du c&ocirc;t&eacute;
du fournisseur (adressage dynamique). Les d&eacute;tails de configuration de la 
connexion de la machine FreeBSD &agrave; l'ext&eacute;rieur sont donn&eacute;s au chapitre
<link linkend="chap3">Configuration du syst&egrave;me FreeBSD</link>.</para>
</sect2>
</sect1>
<sect1 id="chap3">
<title>Configuration du syst&egrave;me FreeBSD</title>
<para>Il y a trois informations &agrave; fournir au syst&egrave;me FreeBSD avant de le relier
au r&eacute;seau local de notre exemple:</para>
<itemizedlist>
<listitem><para>Son nom de machine (<filename>hostname</filename>), 
&ldquo;Curly&rdquo; dans notre exemple,</para></listitem>
<listitem><para>La configuration de son interface r&eacute;seau,</para></listitem>
<listitem><para>Le fichier <filename>/etc/hosts</filename> (qui liste les noms
et les adresses IP des autres machines du r&eacute;seau).</para></listitem>
</itemizedlist> 
<para>Si vous avez install&eacute; FreeBSD via une connexion r&eacute;seau, il
est possible que certaines de ces informations soient d&eacute;j&agrave; d&eacute;finies.</para>
<para>M&ecirc;me si vous pensez que votre syst&egrave;me FreeBSD a d&eacute;j&agrave; &eacute;t&eacute; correctement
configur&eacute; au moment de l'installation, il vous mieux vous assurer de la
validit&eacute; de chacune de ces informations pour vous &eacute;viter des ennuis par la
suite.</para>
<sect2 id="sect31">
<title>Contr&ocirc;ler le nom de la machine FreeBSD</title>
<para>Il est possible que le nom de la machine FreeBSD ait &eacute;t&eacute; d&eacute;fini et
enregistr&eacute; lors de l'installation du syst&egrave;me. Pour le v&eacute;rifier, entrez,
&agrave; l'invite du syst&egrave;me, la commande suivante:</para>
<para>
<userinput>
<prompt>#</prompt> hostname
</userinput>
</para>
<para>Le nom de la machine FreeBSD sera affich&eacute; sur une seule ligne. Si ce nom
para&icirc;t correct (c'est tr&egrave;s subjectif :-), vous pouvez passer au paragraphe
<link linkend="sect32">Contr&ocirc;ler la configuration de l'interface Ethernet</link>.</para>
<para>Dans notre exemple, le r&eacute;sultat de la commande <command>hostname</command>
devrait &ecirc;tre &ldquo;curly.my.domain&rdquo; si le nom de la machine a &eacute;t&eacute;
correctement d&eacute;fini &agrave; l'installation, ou ensuite. (A ce stade, ne vous 
pr&eacute;occupez pas du suffixe &ldquo;.my.domain&rdquo;, nous verrons cela par la
suite. Ce qui compte maintenant est le nom qui pr&eacute;c&egrave;de le premier 
&ldquo;.&rdquo;)</para>
<para>Si le nom de machine n'a pas &eacute;t&eacute; d&eacute;fini &agrave; l'installation, la r&eacute;ponse de
<command>hostname</command> sera probablement &ldquo;myname.my.domain&rdquo;.
Vous devez alors &eacute;diter le fichier <filename>/etc/rc.conf</filename> pour
d&eacute;finir le nom du syst&egrave;me.</para>
<sect3>
<title>D&eacute;finir le nom de la machine FreeBSD</title>
<note>
<para>Vous devez &ecirc;tre en session sous &ldquo;root&rdquo; pour &eacute;diter les
fichiers de configuration du syst&egrave;me.</para>
</note>
<note>
<para>Si vous introduisez des erreurs dans les fichiers de configuration, il y
a de fortes chances que votre syst&egrave;me <emphasis>ne red&eacute;marre</emphasis> pas
correctement! Soyez prudents !</para>
</note>
<para>Le nom de machine du syst&egrave;me FreeBSD est d&eacute;fini au d&eacute;marrage par le
fichier <filename>/etc/rc.conf</filename>. Utilisez l'&eacute;diteur par d&eacute;faut 
(&ldquo;ee&rdquo;) pour &eacute;diter ce fichier.</para>
<para>Sous une session &ldquo;root&rdquo;, visualisez le fichier dans l'&eacute;diteur
avec la commande:</para>
<para>
<userinput>
<prompt>#</prompt> ee /etc/rc.conf
</userinput>
</para>
<para>Avec les touches fl&egrave;ches, allez jusqu'&agrave; la ligne qui d&eacute;finit le nom de
machine du syst&egrave;me FreeBSD. Par d&eacute;faut, vous y trouvez:</para>
<literallayout>
---
### Basic network options: ###
hostname="myname.my.domain"     # Set this !
---
</literallayout>
<para>Remplacez ces lignes, par exemple, par:</para>
<literallayout>
---
### Basic network options: ###
hostname="curly.my.domain"     # Set this !
---
</literallayout>
<para>Une fois la modification faite, appuyez sur la touche 
<keycap>Echap</keycap> pour aller dans le menu de commandes de 
l'&eacute;diteur. Choisissez 
&ldquo;leave editor&rdquo; (quitter l'&eacute;diteur) et s&eacute;lectionnez bien l'option
&ldquo;save changes&rdquo; (enregistrer les modifications) quand la question 
vous est pos&eacute;e.</para>
</sect3>
</sect2>
<sect2 id="sect32">
<title>Contr&ocirc;ler la configuration de l'interface Ethernet</title>
<para>Rappelons nos hypoth&egrave;ses : l'interface Ethernet de la machine s'appelle
&ldquo;ed0&rdquo;. C'est la valeur par d&eacute;faut pour les contr&ocirc;leurs NE-1000,
NE-2000, WD/SMC mod&egrave;les 8003, 8013 et Elite Ultra (8216).</para>
<para>Les fichiers d'interface d'autres mod&egrave;les de contr&ocirc;leurs peuvent 
avoir d'autres noms sous FreeBSD. Si vous n'&ecirc;tes pas certain du nom 
correspondant &agrave; votre contr&ocirc;leur, consultez les Questions Fr&eacute;quemment Pos&eacute;es 
&agrave; propos de
FreeBSD (&ldquo;FAQ&rdquo;) et substituez la bonne valeur dans les exemples
qui suivent.</para>
<para>De la m&ecirc;me fa&ccedil;on que pour le nom de la machine, l'interface Ethernet du
syst&egrave;me FreeBSD a peut-&ecirc;tre &eacute;t&eacute; configur&eacute;e &agrave; l'installation.</para>
<para>Pour consulter la configuration des interfaces (Ethernet et autres) de
votre syst&egrave;me FreeBSD), utilisez la commande suivante:</para>
<screen>
<prompt>#</prompt> <userinput>ifconfig -a</userinput>
</screen>
<para>Soit en clair: "Donnes-moi la CONFIGuration des InterFaces de mes 
p&eacute;riph&eacute;riques r&eacute;seau."</para>
<para>Par exemple:</para>
<screen>
<prompt>#</prompt> <userinput>ifconfig -a</userinput>
ed0: flags=8843&lt;UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST> mtu 1500
inet 192.168.1.1 netmask 0xffffff00 broadcast 192.168.1.255
ether 01:02:03:04:05:06
lp0: flags=8810&lt;POINTOPOINT,SIMPLEX,MULTICAST> mtu 1500
tun0: flags=8050&lt;POINTOPOINT,RUNNING, MULTICAST> mtu 1500
l0: flags=c010&lt;OINTOPOINT,LINK2,MULTICAST> mtu 552
ppp0: flags=8010&lt;POINTOPOINT,MULTICAST> mtu 1500
lo0: flags=8049&lt;UP,LOOPBACK,RUNNING,MULTICAST> mtu 16384
inet 127.0.0.1 netmask 0xff000000
<prompt>#</prompt>
</screen>
<para>Sur cet exemple, les p&eacute;riph&eacute;riques suivants sont reconnus :</para>
<itemizedlist>
<listitem><para><filename>ed0</filename>: l'interface 
Ethernet,</para></listitem>
<listitem><para><filename>lp0</filename>: l'interface parall&egrave;le 
(que nous n'utiliserons pas ici),</para></listitem>
<listitem><para><filename>tun0</filename>: l'interface SLIP (IP sur ligne s&eacute;rie,
que nous n'utiliserons pas ici),</para></listitem>
<listitem><para><filename>ppp0</filename>: un autre interface PPP 
(pour le module <command>ppp</command> int&eacute;gr&eacute; au noyau, que n'utiliserons pas 
ici),</para></listitem>
<listitem><para><filename>lp0</filename>: l'interface 
"en boucle"&nbsp;-&nbsp;"loopback"&nbsp;-&nbsp;que
nous n'utiliserons pas non plus).</para></listitem>
</itemizedlist>
<para>Dans l'exemple, l'interface &ldquo;ed0&rdquo; est active 
(&ldquo;UP&rdquo;) et fonctionne (&ldquo;RUNNING&rdquo;). Les indications
importantes sont:</para>
<orderedlist>
<listitem><para>L'interface est active (&ldquo;UP&rdquo;),</para></listitem>
<listitem><para>Elle a une adresse Ethernet (&ldquo;inet&rdquo;), dans notre
cas: 192.168.1.1,</para></listitem>
<listitem><para>Elle a un masque de sous-r&eacute;seau (&ldquo;netmask&rdquo;; 
0xffffff00 qui &eacute;quivaut &agrave; 255.255.255.0) correct,</para></listitem>
<listitem><para>Elle a une adresse de diffusion (&ldquo;broadcast&rdquo;; 
ici, 192.168.1.255) valide.</para></listitem>
</orderedlist>
<para>Si la ligne d&eacute;crivant l'interface Ethernet mentionne quelque chose
comme:</para>
<programlisting>
ed0: flags=8802&lt;BROADCAST,SIMPLEX,MULTICAST> mtu 1500
ether 01:02:03:04:05:06
</programlisting>
<para>c'est que cette interface n'est pas encore configur&eacute;e.</para>
<para>Si l'interface Ethernet est d&eacute;j&agrave; configur&eacute;e, vous pouvez passer 
directement au paragraphe <link linkend="sect34">Renseigner la liste des 
autres machines du r&eacute;seau</link>.
Sinon, continuez en s&eacute;quence.</para>
<sect3>
<title>Configurer votre interface Ethernet</title>
<note>
<para>Vous devez &ecirc;tre en session sous &ldquo;root&rdquo; pour &eacute;diter les
fichiers de configuration du syst&egrave;me.</para>
</note>
<note>
<para>Si vous introduisez des erreurs dans les fichiers de configuration, il y
a de fortes chances que votre syst&egrave;me <emphasis>ne red&eacute;marre</emphasis> pas
correctement! Soyez prudents !</para>
</note>
<para>Les param&egrave;tres de configuration des interfaces r&eacute;seau sont d&eacute;finis au 
d&eacute;marrage par le fichier <filename>/etc/rc.conf</filename>. Utilisez l'&eacute;diteur 
par d&eacute;faut (&ldquo;ee&rdquo;) pour &eacute;diter ce fichier.</para>
<para>Sous une session &ldquo;root&rdquo;, visualisez le fichier dans l'&eacute;diteur
avec la commande:</para>
<para>
<userinput>
<prompt>#</prompt> ee /etc/rc.conf
</userinput>
</para>
<para>Vers la vingti&egrave;me ligne environ du fichier, se trouve la section qui 
d&eacute;finit quelles interfaces r&eacute;seau doivent &ecirc;tre mises en service au 
d&eacute;marrage. Le fichier de configuration par d&eacute;faut contient la ligne :</para>
<programlisting>
network_interfaces="lo0"        # List of network interfaces (lo0 is loopback)
</programlisting>
<para>que vous devrez modifier pour dire &agrave; FreeBSD que vous voulez ajouter un
autre p&eacute;riph&eacute;rique, en l'occurence l'interface &ldquo;ed0&rdquo;, en:</para>
<programlisting>
network_interfaces="lo0 ed0"    # List of network interfaces (lo0 is loopback)
</programlisting>
<para>(Faites attention &agrave; l'espace entre la d&eacute;finition de l'interface en boucle
&ldquo;lo0&rdquo; et l'interface Ethernet &ldquo;ed0&rdquo;.)</para>
<note>
<para>Si le nom correspondant &agrave; votre interface n'est pas &ldquo;ed0&rdquo;,n'oubliez pas de mettre la valeur ad&eacute;quate &agrave; la place.</para>
</note>
<para>Si vous avez install&eacute; FreeBSD via une connexion r&eacute;seau, la ligne
&ldquo;<filename>network_interfaces</filename>&rdquo; comporte peut-&ecirc;tre
d&eacute;j&agrave; un r&eacute;f&eacute;rence &agrave; votre carte Ethernet. Dans ce cas, assurez vous que son nom
soit correct.</para>
<para>Les lignes qui suivent celles o&ugrave; sont list&eacute;es les interfaces &agrave; mettre en 
service d&eacute;crivent les param&egrave;tres de chacune de ces interfaces. Dans le fichier
<filename>/etc/rc.conf</filename> par d&eacute;faut, il n'y a qu'un seule ligne qui
dit:</para>
<programlisting>
ifconfig_lo0="inet 127.0.0.1"   # default loopback device configuration
</programlisting>
<para>Vous devrez ajouter une ligne qui d&eacute;finisse les caract&eacute;ristiques de
votre interface &ldquo;ed0&rdquo;.</para>
<para>Si vous avez install&eacute; FreeBSD via une connexion r&eacute;seau, la ligne
&ldquo;<filename>ifconfig_ed0=</filename>&rdquo; existe peut-&ecirc;tre
d&eacute;j&agrave;. V&eacute;rifiez alors qu'elle contienne bien les bonnes valeurs.</para>
<para>En nous r&eacute;f&eacute;rant &agrave; notre exemple, nous ins&eacute;rerons la ligne suivante, 
imm&eacute;diatement apr&egrave;s la d&eacute;finition de l'interface 
&ldquo;en boucle&rdquo;:</para>
<programlisting>
ifconfig_ed0="inet 192.168.1.1 netmask 255.255.255.0"
</programlisting>
<para>Apr&egrave;s modification, cette section du fichier 
<filename>/etc/rc.conf</filename> doit ressembler &agrave;:</para>
<programlisting>
---
network_interfaces="lo0 ed0"    # List of network interfaces (lo0 is loopback)
ifconfig_lo0="inet 127.0.0.1"   # default loopback device configuration
ifconfig_ed0="inet 192.168.1.1 netmask 255.255.255.0"
---
</programlisting>
<para>Un fois que vous avez fait toutes les modifications n&eacute;cessaires,
appuyez sur la touche 
<keycap>Echap</keycap> pour aller dans le menu de commandes de 
l'&eacute;diteur. Choisissez 
&ldquo;leave editor&rdquo; (quitter l'&eacute;diteur) et s&eacute;lectionnez bien l'option
&ldquo;save changes&rdquo; (enregistrer les modifications) quand la question 
vous est pos&eacute;e.</para>
</sect3>
</sect2>
<sect2 id="sect33">
<title>Autoriser la transmission de paquets</title>
<para>Par d&eacute;faut, FreeBSD n'active pas le transmission de paquets 
entre les diff&eacute;rentes interfaces r&eacute;seau d'une machine. En d'autres
termes, les fonctions de routage (aussi appel&eacute;es de passerelle)
ne sont pas disponibles.</para>
<para>Si vous voulez utiliser le programme <command>ppp</command>
comme poste Internet autonome et non comme passerelle entre le
r&eacute;seau local et votre fournisseur d'acc&egrave;s &agrave; Internet, vous pouvez
passer directement au paragraphe 
<link linkend="sect34">Renseigner la liste des autres machines du r&eacute;seau</link>.</para>
<para>Si vous voulez utiliser le programme <command>ppp</command>
pour connecter &agrave; la fois votre machine FreeBSD (pour servir de
routeur) et les autres postes du r&eacute;seau local, vous devez autoriser
la transmission de paquets IP.</para>
<para>Pour cela, vous devez &eacute;diter le fichier 
<filename>/etc/rc.conf</filename>. Visualisez le fichier dans l'&eacute;diteur
avec la commande:</para>
<para>
<userinput>
<prompt>#</prompt> ee /etc/rc.conf
</userinput>
</para>
<para>Vers la quatre-vingt-cinqui&egrave;me ligne environ, vous trouverez la section
qui contr&ocirc;le la transmission de paquets. Elle ressemblera a ceci:</para>
<literallayout>
---
gateway_enable="NO"		# Set to YES if the host will be a gateway
---
</literallayout>
<para>Modifiez-la en:</para>
<para>
<literallayout>
---
gateway_enable="YES"		# Set to YES if the host will be a gateway
---
</literallayout>
</para>
<para>et quittez l'&eacute;diteur (en enregistrant vos modifications!).</para>
<note>
<para>Cette ligne contient peut-&ecirc;tre d&eacute;j&agrave; 
<command>gateway_enable="YES"</command>
si la transmission de paquets IP a &eacute;t&eacute; autoris&eacute;e au moment de l'installation
du syst&egrave;me FreeBSD.</para>
</note>
</sect2>
<sect2 id="sect34">
<title>Renseigner la liste des autres machines du r&eacute;seau 
(<filename>/etc/hosts</filename>)</title>
<para>La derni&egrave;re &eacute;tape de la configuration du r&eacute;seau local vu de la machine
FreeBSD consiste &agrave; cr&eacute;er la liste des noms et des adresses TCP/IP des
diff&eacute;rentes machines raccord&eacute;es au r&eacute;seau local. Cette liste est d&eacute;finie dans le
fichier <filename>/etc/hosts</filename>.</para>
<para>Par d&eacute;faut, ce fichier ne contient qu'une ligne: le nom et l'adresse 
de l'interface &ldquo;en boucle&rdquo;. Par convention, ce nom est toujours
&ldquo;localhost&rdquo; et son adresse 127.0.0.1. (Reportez-vous &agrave; l'exemple
de configuration des interfaces au paragraphe 
<link linkend="sect32">Contr&ocirc;ler la configuration de l'interface Ethernet</link>.)</para>
<para>Pour &eacute;diter le fichier <filename>/etc/hosts</filename>, tapez la
commande:</para>
<para>
<userinput>
<prompt>#</prompt> ee /etc/hosts
</userinput>
</para>
<para>Allez jusqu'&agrave; la fin du fichier (en lisant au passage les commentaires,
ce sont des informations utiles!) et ajoutez (toujours dans le cas du
r&eacute;seau de notre exemple) les noms et les adresses IP suivantes:</para>
<programlisting>
192.168.1.1   curly   curly.my.domain # machine FreeBSD
192.168.1.2   larry   larry.my.domain # machine Windows 95
192.168.1.3   moe     moe.my.domain   # machine Windows for Workgroups
192.168.1.4   shemp   shemp.my.domain # machine Windows NT
</programlisting>
<para>(Vous ne devez pas modifier la ligne 
&ldquo;<command>127.0.0.1 localhost</command>&rdquo;.)</para>
<para>Une fois que vous avez ajout&eacute; ces lignes, appuyez sur la touche
<keycap>Echap</keycap> pour aller dans le menu de commandes de
l'&eacute;diteur. Choisissez
&ldquo;leave editor&rdquo; (quitter l'&eacute;diteur) et s&eacute;lectionnez bien l'option
&ldquo;save changes&rdquo; (enregistrer les modifications) quand la question
vous est pos&eacute;e.</para>
</sect2>
<sect2 id="sect35">
<title>Tester le syst&egrave;me FreeBSD</title>
<para>F&eacute;licitations! Une fois que vous en &ecirc;tes arriv&eacute; l&agrave;, votre machine
FreeBSD est maintenant une machine UNIX connect&eacute;e au r&eacute;seau! Si vous avez
d&ucirc; modifier votre fichier <filename>/etc/rc.conf</filename>, il faut
red&eacute;marrer votre machine FreeBSD. Cela va faire deux choses importantes:</para>
<itemizedlist>
<listitem><para>Appliquer les modifications de configuration des interfaces, 
et:</para></listitem>
<listitem><para>V&eacute;rifier que le syst&egrave;me red&eacute;marre sans erreur de configuration
flagrante.</para></listitem>
</itemizedlist>
<sect3>
<title>V&eacute;rifier le bon fonctionnement de l'interface 
&ldquo;en boucle&rdquo;</title>
<para>Pour v&eacute;rifier que l'interface &ldquo;en boucle&rdquo; est correctement
configur&eacute;e, ouvrez une session sous &ldquo;root&rdquo; et tapez:</para>
<para>
<userinput><prompt>#</prompt> ping localhost</userinput>
</para>
<para>Vous devriez voir d&eacute;filer des messages du type:</para>
<para>
<userinput><prompt>#</prompt> ping localhost</userinput>
<programlisting>
PING localhost.my.domain. (127.0.0.1): 56 bytes
64 bytes from 127.0.0.1: icmp_seq=0 ttl=255 time=0.219 ms
64 bytes from 127.0.0.1: icmp_seq=1 ttl=255 time=0.200 ms
64 bytes from 127.0.0.1: icmp_seq=2 ttl=255 time=0.187 ms
[...]
</programlisting>
</para>
<para>jusqu'&agrave; ce que vous tapiez 
<keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo>
pour arr&ecirc;ter ce d&eacute;lire.</para>
</sect3>
<sect3>
<title>V&eacute;rifier le bon fonctionnement de l'interface Ethernet</title>
<para>Pour v&eacute;rifier que l'interface Ethernet est correctement
configur&eacute;e, tapez:</para>
<para>
<userinput><prompt>#</prompt> ping curly</userinput>
</para>
<para>Vous devriez voir:</para>
<para>
<userinput><prompt>#</prompt> ping curly</userinput>
<programlisting>
PING curly.my.domain. (192.168.1.1): 56 bytes
64 bytes from 192.168.1.1: icmp_seq=0 ttl=255 time=0.219 ms
64 bytes from 192.168.1.1: icmp_seq=1 ttl=255 time=0.200 ms
64 bytes from 192.168.1.1: icmp_seq=2 ttl=255 time=0.187 ms
[...]
</programlisting>
</para>
<para>L'information importante dans ces deux exemples est que les noms
(&ldquo;localhost&rdquo; et &ldquo;curly&rdquo;) correspondent bien
&agrave; leurs adresses IP (127.0.0.1 et 192.168.1.1). Cela confirme que le fichier
<filename>/etc/hosts</filename> est correct.</para>
<para>Si les noms et les adresses appara&icirc;ssent correctement dans les r&eacute;sultats
de la commande <command>ping</command> mais que des messages d'erreur sont
affich&eacute;s, quelque chose ne va pas dans la configuration des interfaces. 
Retournez au paragraphe <link linkend="sect31">Contr&ocirc;ler le nom de la machine FreeBSD</link> et 
v&eacute;rifiez de nouveau votre configuration.</para>
<para>Si maintenant, tout va bien, passez &agrave; la section suivante.</para>
</sect3>
</sect2>
</sect1>
<sect1>
<title>Configurer la liaison PPP vers l'ext&eacute;rieur</title>
<para>Il y a deux fa&ccedil;ons d'utiliser le programme <command>ppp</command>: en
mode &ldquo;Interactif&rdquo; et en mode &ldquo;Automatique&rdquo;.</para>
<para>En mode Interactif, vous:</para>
<itemizedlist>
<listitem>
<para>Etablissez manuellement la connexion avec votre fournisseur d'acc&egrave;s 
Internet,</para>
</listitem>
<listitem>
<para>Surfez, transf&eacute;rez des fichiers et envoyez du courrier
&eacute;lectronique, etc.</para>
</listitem>
<listitem>
<para>Coupez manuellement la connexion avec votre fournisseur d'acc&egrave;s 
Internet.</para>
</listitem>
</itemizedlist>
<para>En mode Automatique, le programme <command>ppp</command> surveille
silencieusement les op&eacute;rations du syst&egrave;me FreeBSD et se connecte et se 
d&eacute;connecte automagiquement &agrave; votre fournisseur d'acc&egrave;s selon le besoin,
int&eacute;grant de fa&ccedil;on transparente l'Internet &agrave; votre r&eacute;seau.</para>
<sect2>
<title>Sauvegarder vos fichiers de configuration <command>ppp</command>
d'origine</title>
<para>Avant de modifier les fichiers qu'utilise <command>ppp</command>, il
est bon de sauvegarder les fichiers par d&eacute;faut cr&eacute;&eacute;s &agrave; l'installation de
FreeBSD.</para>
<para>Ouvrez une session sous le compte &ldquo;root&rdquo;, et suivez la
proc&eacute;dure ci-dessous:</para>
<para>Allez dans le r&eacute;pertoire <filename>/etc</filename>:</para>
<para>
<userinput>
<prompt>#</prompt> cd etc
</userinput>
</para>
<para>Faites un copie des fichiers d'origine du r&eacute;pertoire 
<filename>ppp</filename>:</para>
<para>
<userinput>
<prompt>#</prompt> cp -R ppp ppp.ORIGINAL
</userinput>
</para>
<para>Vous devriez maintenant avoir un r&eacute;pertoire <filename>ppp</filename>
et un r&eacute;pertoire <filename>ppp.ORIGINAL</filename> dans le r&eacute;pertoire
<filename>etc</filename>.</para>
</sect2>
<sect2>
<title>Cr&eacute;er vos propres fichiers de configuration de 
<command>ppp</command></title>
<para>Par d&eacute;faut, la proc&eacute;dure d'installation de FreeBSD cr&eacute;e un certain
nombre de fichiers d'exemple dans le r&eacute;pertoire <filename>/etc/ppp</filename>.
Prenez un peu de temps pour parcourir ces fichiers. Ce sont des exemples
emprunt&eacute;s &agrave; des syst&egrave;mes qui fonctionnent et ils illustrent les diff&eacute;rentes
possibilit&eacute;s du programme <command>ppp</command>.</para>
<para>Je vous encourage <emphasis>fortement</emphasis> &agrave; &eacute;tudier ces exemples
et &agrave; les adapter &agrave; votre configuration.</para>
<para>Pour plus d'informations sur le programme <command>ppp</command>, lisez
les pages de manuel:</para>
<para>
<userinput>
<prompt>#</prompt> man ppp
</userinput>
</para>
<para>Pour plus d'informations sur le langage <command>chat</command>, utilis&eacute;
par <command>ppp</command> pour &eacute;tablir la connexion, lisez les pages de 
manuel:</para>
<para>
<userinput>
<prompt>#</prompt> man chat
</userinput>
</para>
<para>La suite de ce chapitre d&eacute;crit le contenu recommand&eacute; des fichiers 
de configurations de <command>ppp</command>.</para>
<sect3>
<title>Le fichier <filename>/etc/ppp/ppp.conf</filename></title>
<para>Le fichier <filename>/etc/ppp/ppp.conf</filename> contient les 
informations et les param&egrave;tres n&eacute;cessaires pour &eacute;tablir une connexion
vers l'ext&eacute;rieur. Le 
<ulink url="&url.handbook;index.html">Manuel
FreeBSD</ulink> d&eacute;crit en d&eacute;tail le contenu et la syntaxe de ce fichier.</para>
<para>N'est d&eacute;crite ici que la configuration minimale n&eacute;cessaire pour arriver
&agrave; &eacute;tablir une connexion.</para>
<para>Voici le fichier <filename>/etc/ppp/ppp.conf</filename> que nous 
utiliserons sur notre passerelle entre le r&eacute;seau local et l'Internet:</para>
<para>
<programlisting>
####################################################################
# Fichier de Configuration de PPP ('/etc/ppp/ppp.conf')
#
# Param&egrave;tres par d&eacute;faut: Ces commandes sont toujours ex&eacute;cut&eacute;es
# quand PPP est appel&eacute; et s'appliquent &agrave; toutes les configurations
####################################################################
default:
set device /dev/cuaa0
set speed 57600
disable pred1
deny pred1
disable lqr
deny lqr
set dial "ABORT BUSY ABORT NO\\sCARRIER TIMEOUT 5 \"\" ATE1Q0M0
OK-AT-OK\\dATDT\\T TIMEOUT 40 CONNECT"
set redial 3 10
#
#
####################################################################
#
# Configuration utilis&eacute;e en mode interactif :
#
# appel&eacute;e par: `ppp -alias interactive`
#
####################################################################
interactive:
set authname Your_User_ID_On_Remote_System
set authkey Your_Password_On_Remote_System
set phone 1-800-123-4567
set timeout 300
set openmode active
accept chap
#
####################################################################
#
# Configuration utilis&eacute;e en mode &agrave; la demande ( automatique)
#
# appel&eacute;e par: 'ppp -auto -alias demand'
#
####################################################################
demand:
set authname Your_User_ID_On_Remote_System
set authkey Your_Password_On_Remote_System
set phone 1-800-123-4567
set timeout 300
set openmode active
accept chap
set ifaddr 127.1.1.1/0 127.2.2.2/0 255.255.255.0
add 0 0 127.2.2.2
################################################################
# Fin de /etc/ppp/ppp.conf
</programlisting>
</para>
<para>Ce fichier, recopi&eacute; tel quel d'un syst&egrave;me op&eacute;rationnel, comporte trois
parties:</para>
<sect4>
<title>La section &ldquo;default&rdquo;</title>
<para> La section &ldquo;default:&rdquo; contient les informations et 
param&egrave;tres utilis&eacute;s par toutes les autres sections du fichier. Cette section
est donc implicitement ajout&eacute;e &agrave; toutes les autres.</para>
<para>C'est l'endroit id&eacute;al pour d&eacute;finir les valeurs par d&eacute;faut qui s'appliquent
&agrave; toutes les connexions vers l'ext&eacute;rieur; en particulier, la configuration
du modem et le dialogue d'initialisation de la connexion, qui ne changent
pas, quel que soit le syst&egrave;me distant auquel vous vous connectez.</para>
<para>Voici le d&eacute;tail de chacune des lignes de la section 
&ldquo;default:&rdquo; du fichier 
<filename>/etc/ppp/ppp.conf</filename>:</para>
<para>
<programlisting>
set device /dev/cuaa0
</programlisting>
</para>
<para>Cette instruction dit au programme <command>ppp</command> d'utiliser le
premier port s&eacute;rie. Sous FreeBSD, le p&eacute;riph&eacute;rique &ldquo;/dev/cuaa0&rdquo;
correspond au port appel&eacute; &ldquo;COM1:&rdquo; de DOS, Windows, Windows 95, 
etc.</para>
<para>Si votre modem est sur le port &ldquo;COM2&rdquo;: vous devrez mettre
&ldquo;/dev/cuaa1&rdquo;. &ldquo;/dev/cuaa2&rdquo; serait le port
&ldquo;COM3:&rdquo;.</para>
<para>
<programlisting>
set speed 57600
</programlisting>
</para>
<para>Cette ligne indique au programme <command>ppp</command> la vitesse
en &eacute;mission et en r&eacute;ception entre le port s&eacute;rie et le modem. Bien que le modem
de notre configuration fonctionne &agrave; 28.8 Kbps, donner la valeur 56000 permet
&agrave; la liaison s&eacute;rie de fonctionner suffisamment vite pour g&eacute;rer la compression de
donn&eacute;es int&eacute;gr&eacute;e aux modems les plus r&eacute;cents.</para>
<para>Si vous avez des probl&egrave;mes pour dialoguer avec votre modem &agrave; cette 
vitesse, descendez &agrave; une valeur inf&eacute;rieure: 38400, voir aussi faible que 
19200.</para>
<para>
<programlisting>
disable pred1
deny pred1
</programlisting>
</para>
<para>Ces deux lignes d&eacute;sactivent la compression &ldquo;CCP/Predictor 1&rdquo;
dont est capable le programme <command>ppp</command>. La version actuelle
de <command>ppp</command> supporte la compression de donn&eacute;es selon la
d&eacute;finition provisoire des standards Internet. Malheureusement, de nombreux
fournisseurs d'acc&egrave;s ont des &eacute;quipements qui n'offrent pas cette possibilit&eacute;.
Comme la plupart des modems r&eacute;cents sont capables de compression &agrave; la vol&eacute;e,
vous ne perdrez probablement pas grand-chose en termes de performances en
d&eacute;sactivant cette possibilit&eacute; sur votre machine FreeBSD et en interdisant
au site distant de vous la r&eacute;clamer.</para>
<para>
<programlisting>
disable lqr
deny lqr
</programlisting>
</para>
<para>Ces deux lignes contr&ocirc;lent l'&ldquo;audit de la qualit&eacute; de la 
liaison (Link Quality Reporting)&rdquo; qui est partie int&eacute;grante des
sp&eacute;cifications du protocole PPP. 
(Voyez la RFC-1989 pour plus de d&eacute;tails.)</para>
<para>La premi&egrave;re ligne, &ldquo;disable lqr&rdquo; instruit le programme
<command>ppp</command> de ne pas &eacute;mettre de demandes de contr&ocirc;le de la
qualit&eacute; de la liaison &agrave; la machine distante.</para>
<para>La seconde ligne, &ldquo;deny lqr&rdquo; instruit le progamme
<command>ppp</command> de ne pas accepter de demandes de contr&ocirc;le de la
qualit&eacute; de la liaison de la machine distante.</para>
<para>Comme la plupart des modems ont des proc&eacute;dures int&eacute;gr&eacute;es de d&eacute;tection et
de correction d'erreur et que l'audit LQR est rarement int&eacute;gralement
impl&eacute;ment&eacute;e par les constructeurs, il vaut en g&eacute;n&eacute;ral mieux ne pas utiliser 
cette possibilit&eacute;.</para>
<para>
<programlisting>
set dial "ABORT BUSY ABORT NO\\sCARRIER TIMEOUT 5 \"\" ATE1Q0M0 OK-AT-OK\\dATADT\\T TIMEOUT 40 CONNECT"
</programlisting>
</para>
<note>
<para>(Cette instruction doit &ecirc;tre &eacute;crite sur une seule ligne; ne tenez 
pas compte du formatage sur deux lignes, si elle se pr&eacute;sente ainsi dans ce
document.)</para>
</note>
<para>Cette ligne d&eacute;crit le dialogue entre le programme <command>ppp</command>
et le modem qui doit permettre d'&eacute;tablir la connexion et fournit des
instructions rudimentaires sur la marche &agrave; suivre:</para>
<itemizedlist>
<listitem>
<para>Une tentative d'appel &eacute;choue si le modem renvoie le code d'erreur
&ldquo;BUSY (occup&eacute;)&rdquo;,</para>
<para>Une tentative d'appel &eacute;choue aussi si le modem renvoie le code d'erreur
&ldquo;NO CARRIER (pas de porteuse),&rdquo;,</para>
<para>Le programme <command>ppp</command> doit constater, avec
un d&eacute;lai maximum de cinq secondes entre chaque &eacute;v&eacute;nement, la s&eacute;quence 
d'&eacute;v&eacute;nements suivants:</para>
</listitem>
<listitem>
<itemizedlist>
<listitem>
<para>Initialement, le programme <command>ppp</command> n'attend pas de
r&eacute;ponse du modem (c'est le sens de la cha&icirc;ne <literal>\"\"</literal> dans 
l'instruction),</para>
</listitem>
<listitem>
<para>Le programme enverra au modem la cha&icirc;ne &ldquo;ATE1Q0M0&rdquo; et 
attendra la r&eacute;ponse &ldquo;OK&rdquo;. Si cette r&eacute;ponse n'arrive pas, il enverra
la commande d'interrogation &ldquo;AT&rdquo; et attendra &agrave; nouveau une r&eacute;ponse
&ldquo;OK&rdquo;,</para>
</listitem>
<listitem>
<para>Le programme devra attendre une seconde (c'est le sens de la cha&icirc;ne 
&ldquo;\\d&rdquo; dans l'instruction), et envoyer la s&eacute;quence d'appel au
modem. Le pr&eacute;fixe &ldquo;ATDT&rdquo; est la commande d'appel standard pour
les lignes t&eacute;l&eacute;phoniques &agrave; fr&eacute;quences vocales. Si vous n'avez pas de ligne
&agrave; fr&eacute;quence vocale, remplacez &ldquo;ATDT&rdquo; par &ldquo;ATDP&rdquo;.
La cha&icirc;ne &ldquo;\\T&rdquo; sera remplac&eacute;e par le num&eacute;ro
de t&eacute;l&eacute;phone r&eacute;el (qui sera d&eacute;fini plus loin par la ligne 
&ldquo;set dial&rdquo;).</para>
</listitem>
</itemizedlist>
</listitem>
<listitem>
<para>Pour finir, avec un d&eacute;lai d'attente de quarante secondes au maximum,
le programme <command>ppp</command> doit recevoir un code d'acquittement
&ldquo;CONNECT&rdquo; du modem.</para>
</listitem>
</itemizedlist>
<para>Un &eacute;chec &agrave; une phase quelconque de ce dialogue sera interpret&eacute; comme
un &eacute;chec d'appel et la connexion ne sera pas &eacute;tablie.</para>
<para>(Pour avoir une description d&eacute;taill&eacute;e du mini-langage de commande
utilis&eacute; par <command>ppp</command>, reportez-vous aux pages de manuel de
<command>chat</command>.)</para>
<para>
<programlisting>
set redial 3 10
</programlisting>
</para>
<para>Cette ligne indique au programme <command>ppp</command> qu'en cas d'&eacute;chec,
il peut faire jusqu'&agrave; trois nouvelles tentatives avec un temps d'attente de dix
secondes entre chaque nouvel appel.</para>
</sect4>
<sect4 id="sect4122">
<title>La section &ldquo;interactive&rdquo;</title>
<para>La section &ldquo;interactive:&rdquo; contient les valeurs et les
param&egrave;tres utilis&eacute;s par les connexions PPP interactives avec un syst&egrave;me
distant particulier. Les lignes de la section &ldquo;default:&rdquo; sont
automatiquement incluses dans cette section.</para>
<para>L'exemple donn&eacute; ci-dessous suppose que vous vous connectiez &agrave; un syst&egrave;me 
qui sait identifier un utilisateur sans avoir &agrave; utiliser une s&eacute;rie de commandes
baroques. Nous supposerons que le protocole CHAP est utilis&eacute; pour initialiser
la session.</para>
<para>A priori, si un syst&egrave;me Windows 95 peut &eacute;tablir la connexion d'un simple
clic sur le bouton &ldquo;Connecter&rdquo;, la configuration donn&eacute;e en exemple
devrait fonctionner.</para>
<para>Si, &agrave; l'inverse, quand vous vous connectez chez votre fournisseur d'acc&egrave;s
avec les utilitaires de Microsoft Windows 95, vous devez utiliser l'option
&ldquo;Utiliser des proc&eacute;dures de connexion&rdquo;<footnote><para>N.d.T: ne 
disposant du mat&eacute;riel n&eacute;cessaire au contr&ocirc;le de certains de ces libell&eacute;s dans
les versions fran&ccedil;is&eacute;es de Windows, ils ont &eacute;t&eacute; traduits du document en langue 
anglaise. En cas d'inexactitude, le lecteur voudra bien rectifier de 
lui-m&ecirc;me.</para></footnote>. il vous faudra alors 
lire les pages de manuel de <command>ppp</command> pour trouver des exemples
de fichiers de configuration de PPP comportant des proc&eacute;dures
&ldquo;expect / reponse&rdquo; pour &eacute;tablir votre connexion et vous devrez
utiliser la commande &ldquo;set login&rdquo; &agrave; cet effet.</para>
<para>Ou mieux, trouvez-vous un fournisseur d'acc&egrave;s qui offre l'authentification
par PAP ou CHAP!</para>
<para>La configuration donn&eacute;e en exemple a &eacute;t&eacute; utilis&eacute;e avec succ&egrave;s pour se 
connecter:</para>
<itemizedlist>
<listitem>
<para>&agrave; Divers Shiva LanRovers,</para>
</listitem>
<listitem>
<para>au r&eacute;seau IBM 
(<ulink url="http://www.ibm.net">http://www.ibm.net</ulink>),</para>
</listitem>
<listitem>
<para>&agrave; AT&amp;T WorlNet 
(<ulink url="http://www.att.com/worldnet">http://www.att.com/worldnet</ulink>),</para>
</listitem>
<listitem>
<para>&agrave; Erol's 
(<ulink url="http://www.erols.com">http://www.erols.com</ulink>).</para>
</listitem>
</itemizedlist>
<para>Voici la description de chacune des lignes de la section
&ldquo;interactive:&rdquo; du fichier <filename>/etc/ppp/ppp.conf</filename>
de l'exemple:</para>
<para>
<programlisting>
set authname Votre_Nom_d_Utilisateur_du_Syst&egrave;me_Distant
</programlisting>
</para>
<para>Cette ligne d&eacute;finit avec quel nom d'utilisateur vous vous connectez au 
syst&egrave;me distant.</para>
<para>
<programlisting>
set authkey Votre_Mot_de_Passe_Utilisateur_du_Syst&egrave;me_Distant
</programlisting>
</para>
<para>Cette ligne d&eacute;finit le mot de passe que vous utilisez pour vous connecter
au syst&egrave;me distant.</para>
<para>
<programlisting>
set phone 012345678789
</programlisting>
</para>
<para>C'est le num&eacute;ro de t&eacute;l&eacute;phone avec lequel vous joignez le syst&egrave;me 
distant.</para>
<para>
<programlisting>
set timeout 300
</programlisting>
</para>
<para>Cette ligne indique au programme <command>ppp</command> de couper la ligne
s'il n'y a aucun &eacute;change pendant cinq minutes (300 secondes). Vous pouvez
adapter cette ligne &agrave; votre besoin particulier.</para>
<para>
<programlisting>
set openmode active
</programlisting>
</para>
<para>Cette ligne dit au programme <command>ppp</command> de n&eacute;gocier la
connexion d&egrave;s que la liaison entre les modems est &eacute;tablie. Certains sites
distants le font automatiquement, d'autres non. Cette instruction permet
&agrave; votre site d'initialiser la n&eacute;gociation.</para>
<para>
<programlisting>
accept chap
</programlisting>
</para>
<para>Cette ligne dit au programme <command>ppp</command> d'utiliser le
protocole CHAP &ldquo;Challenge Handsake Autentification Protocole
(protocole d'authentification par poign&eacute;e de main avec d&eacute;fi de 
d&eacute;cryptage)&rdquo; pour vous authentifier. Les valeurs &eacute;chang&eacute;es entre le 
syst&egrave;me local et le syst&egrave;me distant pour transmettre le nom d'utilisateur 
et le mot de passe sont d&eacute;finies par les lignes &ldquo;authname&rdquo; et 
&ldquo;authkey&rdquo;.</para> 
</sect4>
<sect4>
<title>La section &ldquo;demand&rdquo;</title>
<para>La section &ldquo;demand:&rdquo; contient les valeurs et les
param&egrave;tres utilis&eacute;s par les connexions PPP automatiques avec un syst&egrave;me
distant particulier. Les lignes de la section &ldquo;default:&rdquo; sont
automatiquement incluses dans cette section.</para>
<para>A l'exception des deux derni&egrave;res lignes, cette section est identique &agrave;
la section qui d&eacute;finit la configuration &ldquo;interactive&rdquo;.</para>
<para>Comme indiqu&eacute; au paragraphe 
<link linkend="sect4122">La section &ldquo;interactive&rdquo;</link>, l'exemple donn&eacute;
ci-dessous suppose que vous vous connectiez &agrave; un syst&egrave;me 
qui comprenne le protocole CHAP pour initialiser
la session.</para>
<para>Voici la description de chacune des lignes de la section
&ldquo;demand:&rdquo; du fichier <filename>/etc/ppp/ppp.conf</filename>
de l'exemple:</para>
<para>
<programlisting>
set authname Votre_Nom_d_Utilisateur_du_Syst&egrave;me_Distant
</programlisting>
</para>
<para>Cette ligne d&eacute;finit avec quel nom d'utilisateur vous vous connectez au 
syst&egrave;me distant.</para>
<para>
<programlisting>
set authkey Votre_Mot_de_Passe_Utilisateur_du_Syst&egrave;me_Distant
</programlisting>
</para>
<para>Cette ligne d&eacute;finit le mot de passe que vous utilisez pour vous connecter
au syst&egrave;me distant.</para>
<para>
<programlisting>
set phone 012345678789
</programlisting>
</para>
<para>C'est le num&eacute;ro de t&eacute;l&eacute;phone avec lequel vous joignez le syst&egrave;me 
distant.</para>
<para>
<programlisting>
set timeout 300
</programlisting>
</para>
<para>Cette ligne indique au programme <command>ppp</command> de couper la ligne
s'il n'y a aucun &eacute;change pendant cinq minutes (300 secondes). Vous pouvez
adapter cette ligne &agrave; votre besoin particulier.</para>
<para>
<programlisting>
set openmode active
</programlisting>
</para>
<para>Cette ligne dit au programme <command>ppp</command> de n&eacute;gocier la
connexion d&egrave;s que la liaison entre les modems est &eacute;tablie. Certains sites
distants le font automatiquement, d'autres non. Cette instruction permet
&agrave; votre site d'initialiser la n&eacute;gociation.</para>
<para>
<programlisting>
accept chap
</programlisting>
</para>
<para>Cette ligne dit au programme <command>ppp</command> d'utiliser le
protocole CHAP &ldquo;Challenge Handsake Autentification Protocole
(protocole d'authentification par poign&eacute;e de 
main avec d&eacute;fi de d&eacute;cryptage)&rdquo;
pour vous authentifier. Les valeurs &eacute;chang&eacute;es entre le syst&egrave;me local et le 
syst&egrave;me distant pour transmettre le nom d'utilisateur et le mot de passe
sont d&eacute;finies par les lignes &ldquo;authname&rdquo; et 
&ldquo;authkey&rdquo;</para> 
<para>
<programlisting>
set ifaddr 127.1.1.1/0 127.2.2.2/0 255.255.255.0
</programlisting>
</para>
<para>Cette commande d&eacute;finit une paire d'adresses IP fictives pour les deux
extr&eacute;mit&eacute;s de la liaison point-&agrave;-point. Elle dit au programme 
<command>ppp</command> d'utiliser l'adresse 127.1.1.1 pour l'extr&eacute;mit&eacute; locale
de la liaison g&eacute;r&eacute;e par le pilote de p&eacute;riph&eacute;rique 
&ldquo;tun0 (tunnel)&rdquo;(Reportez-vous au <ulink url="&url.handbook;index.html">manuel FreeBSD</ulink> pour une 
description de ce pilote) et l'adresse 127.2.2.2 pour l'extr&eacute;mit&eacute; distante.
Le &ldquo;/0&rdquo; qui les suit pr&eacute;cise le nombre de digits significatifs de
ces adresses, qui peuvent, (et doivent en fait) &ecirc;tre n&eacute;goci&eacute;es entre les
deux syst&egrave;mes une fois la liaison &eacute;tablie. 255.255.255.0 est le masque de
sous-r&eacute;seau qui s'applique &agrave; ces deux pseudo-interfaces.</para>
<para>Rappelez-vous, nous avons suppos&eacute; que votre fournisseur d'acc&egrave;s vous
assigne les adresses des deux extr&eacute;mit&eacute;s de la ligne! Si votre fournisseur
vous a donn&eacute; une adresse particuli&egrave;re, vous pouvez la mentionner sur cette 
ligne <emphasis>&agrave; la place</emphasis> de l'adresse 127.1.1.1.</para> 
<para>Inversement, si votre fournisseur vous a donn&eacute; une adresse particuli&egrave;re
pour son c&ocirc;t&eacute; de la liaison, vous pouvez la mentionner sur cette 
ligne <emphasis>&agrave; la place</emphasis> de l'adresse 127.2.2.2.</para>
<para>Dans les deux cas, il vaut mieux conserver le &ldquo;/0&rdquo; apr&egrave;s les
deux adresses. Cela laisse la possibilit&eacute; au programme <command>ppp</command>
de changer d'adresse(s) <emphasis>s'il en a besoin</emphasis>.</para>
<para>
<programlisting>
add 0 0 127.2.2.2
</programlisting>
</para>
<para>Cette derni&egrave;re ligne dit au programme <command>ppp</command> d'ajouter une
route par d&eacute;faut pour le trafic vers l'adresse (fictive) 127.2.2.2 du 
fournisseur d'acc&egrave;s.</para>
<note>
<para>Si vous avez donn&eacute;e l'adresse que vous a indiqu&eacute; votre fournisseur d'acc&egrave;s
&agrave; la place de l'adresse 127.2.2.2 &agrave; la ligne &ldquo;set ifaddr&rdquo;, vous
devez utiliser la m&ecirc;me adresse ici, &agrave; la place de 127.2.2.2.</para>
</note>
<para>En ajoutant cette route &ldquo;fictive&rdquo; pour le trafic IP, le
programme <command>ppp</command> peut, successivement, avant et au moment 
d'&eacute;tablir la liaison:</para>
<itemizedlist>
<listitem>
<para>Accepter des paquets que FreeBSD ne sait pas encore comment 
rediriger,</para>
</listitem>
<listitem>
<para>Etablir la connexion avec votre fournisseur d'acc&egrave;s,</para>
</listitem>
<listitem>
<para>Reconfigurer les adresses IP des deux c&ocirc;t&eacute;s de la ligne,</para>
</listitem>
<listitem>
<para>Transmettre les paquets entre votre syt&egrave;me local et votre fournisseur
d'acc&egrave;s,</para>
</listitem>
</itemizedlist>
<para>automatiquement!</para>
<para>Une fois le nombre de secondes d&eacute;fini par l'instruction 
&ldquo;timeout&rdquo; de la section &ldquo;default&rdquo; &eacute;coul&eacute; sans
trafic TCP/IP, le programme <command>ppp</command> coupe automatiquement la
connexion, et le processus peut recommencer.</para>
</sect4>
</sect3>
<sect3>
<title>Le fichier <filename>/etc/ppp/ppp.linkup</filename></title>
<para>L'autre fichier n&eacute;cessaire &agrave; la configuration de <command>ppp</command>
est <filename>/etc/ppp/ppp.linkup</filename>. Ce fichier contient les 
instructions qui d&eacute;finissent ce que <command>ppp</command> doit faire une
fois que la connexion est &eacute;tablie.</para>
<para>Dans le cas d'une connexion &agrave; la demande, le programme 
<command>ppp</command> doit supprimer la route par d&eacute;faut vers l'adresse IP
fictive du syst&egrave;me distant (127.2.2.2 dans notre exemple plus haut) et 
d&eacute;finir une nouvelle route vers l'adresse IP r&eacute;elle de ce syst&egrave;me (obtenue
&agrave; l'&eacute;tablissement de la connexion).</para>
<para>Voici un bon exemple de fichier 
<filename>/etc/ppp/ppp.linkup</filename>:</para>
<para>
<programlisting>
#########################################################################=
#
# Fichier PPP Link Up ('/etc/ppp/ppp.linkup')
#
#  Ce fichier est consult&eacute; une fois que PPP a &eacute;tabli une connexion
# 
#  Ce fichier est lu dans l'ordre suivant :
#
#  1) En premier, l'adresse IP qui nous a &eacute;t&eacute; assign&eacute;e est recherch&eacute;e
#     et la/les commande(s) associ&eacute;e(s) ex&eacute;cut&eacute;e(s)
#
#  2) Si l'adresse IP n'est pas trouv&eacute;e, alors l'&eacute;tiquette donn&eacute;e au
#     d&eacute;marrage de PPP est recherch&eacute;e, et la/les commande(s) associ&eacute;e(s) 
#     ex&eacute;cut&eacute;e(s)
#
#  3) Si ni l'une ni l'autre n'ont &eacute;t&eacute; trouv&eacute;es, les commandes associ&eacute;es
#     &agrave; l'&eacute;tiquette 'MYADDR:' sont ex&eacute;cut&eacute;es.
#
#########################################################################=

#
# Cette section correspond &agrave; la configuration "demand" de
#    /etc/ppp/ppp.conf:
demand:
delete ALL
add 0 0 HISADDR
#
# Toutes les autres configurations de /etc/ppp/ppp.conf utilisent 
#    ce qui suit:
#
MYADDR:
add 0 0 HISADDR
########################################################################
# Fin de /etc/ppp/ppp.linkup
</programlisting>
</para>
<para>Remarquez qu'une section de ce fichier s'appelle &ldquo;demand:&rdquo;,
tout comme dans le fichier <filename>/etc/ppp/ppp.conf</filename>. Cette section
dit au programme <command>ppp</command> ce qu'il doit faire, une fois la
connexion &agrave; la demande &eacute;tablie:</para>
<orderedlist>
<listitem>
<para>Supprimer toutes les informations de routage qu'il a d&eacute;j&agrave; cr&eacute;&eacute;es,</para>
</listitem>
<listitem>
<para>Ajouter une route par d&eacute;faut vers l'adresse r&eacute;elle de la machine 
distante.</para>
</listitem>
</orderedlist>
<para>Il est capital que les configurations d&eacute;finies dans le fichier
<filename>/etc/ppp/ppp.conf</filename> et qui comportent les lignes
&ldquo;set ifaddr&rdquo; et &ldquo;add 0 0&rdquo; (i.e.: les configurations
de connexion &agrave; la demande) ex&eacute;cutent les instructions &ldquo;delete ALL&rdquo;
et &ldquo;add 0 0 HISADDR&rdquo; du fichier 
<filename>/etc/ppp/ppp.linkup.</filename></para>
<para><emphasis>C'est le m&eacute;canisme qui contr&ocirc;le la configuration de la liaison
dans le cas d'une connexion &agrave; la demande.</emphasis></para>
<para>Toutes les configurations qui ne sont pas explicitement d&eacute;finies dans
le fichier <filename>/etc/ppp/ppp.linkup</filename> utiliseront les commandes
list&eacute;es dans la section &ldquo;MYADDR:&rdquo; de ce fichier. C'est ce que 
feront les connexions manuelles (comme dans notre exemple 
&ldquo;interactive:&rdquo;). Cette section ajoute simplement une route par 
d&eacute;faut vers l'adresse IP du fournisseur d'acc&egrave;s (&agrave; l'autre extr&eacute;mit&eacute; de la
ligne).</para>
</sect3>
</sect2>
<sect2>
<title>Alias IP</title>
<para>Toutes les &eacute;tapes pr&eacute;c&eacute;dentes s'appliquent &agrave; un systeme FreeBSD utilis&eacute;
pour se connecter &agrave; la demande &agrave; un fournisseur d'acc&egrave;s Internet.</para>
<para>Si vous cherchez simplement, en lisant ce guide, &agrave; connecter votre 
systeme FreeBSD &agrave; l'Internet, vous pouvez passer directement au chapitre
<link linkend="sect6">Tester le r&eacute;seau</link>.</para>
<para>Une possibilit&eacute; tr&egrave;s int&eacute;ressante du programme <command>ppp</command>
en mode &ldquo;connexion &agrave; la demande&rdquo; est sa capacit&eacute; &agrave; aiguiller
automatiquement le trafic vers les autres syst&egrave;mes du r&eacute;seau local. On donne
&agrave; cela des noms divers &ldquo;alias IP (IP Aliasing)&rdquo;, 
&ldquo;traduction d'adresse r&eacute;seau (Network Adress Translation)&rdquo;,
&ldquo;mascarade d'adresse (Adress Masquerading)&rdquo; ou
&ldquo;mandatement transparent (Transparent Proxying)&rdquo;.</para>
<para>Quelle que soit la terminologie employ&eacute;e, ce fonctionnement n'est
cependant pas automatique. Si le programme <command>ppp</command> est d&eacute;marr&eacute;
de fa&ccedil;on habituelle, il ne fera pas transiter de paquets entre l'interface avec
le r&eacute;seau local et la liaison vers l'ext&eacute;rieur. En effet, seul le syst&egrave;me
FreeBSD est connect&eacute; &agrave; l'Internet; les autres syst&egrave;mes ne peuvent pas partager
la m&ecirc;me connexion.</para> 
<para>Par exemple, si le programme <command>ppp</command> est lanc&eacute; par:</para>
<para>
<userinput>
<prompt>#</prompt> ppp interactive
</userinput>
</para>
<para>ou:</para>
<para>
<userinput>
<prompt>#</prompt> ppp -auto demand
</userinput>
</para>
<para>correspondant respectivement aux modes manuel et automatique, alors
il &eacute;tablira une connexion &agrave; l'Internet pour la <emphasis>seule</emphasis>
machine FreeBSD.</para>
<para>Pour d&eacute;marrer le programme <command>ppp</command> pour l'utiliser comme
passerelle entre le r&eacute;seau local et l'Internet, il faut utiliser l'une des
commandes suivantes:</para>
<para>
<userinput>
<prompt>#</prompt> ppp -alias interactive
</userinput>
</para>
<para>ou:</para>
<para>
<userinput>
<prompt>#</prompt> ppp -auto -alias demand
</userinput>
</para>
<para>Alternativement, vous pouvez utiliser l'instruction &ldquo;alias enable
yes&rdquo; dans votre fichier de configuration de <command>ppp</command>
(Reportez-vous aux pages de manuel pour plus de  d&eacute;tails).</para> 
<para>Gardez cela pr&eacute;sent &agrave; l'esprit si vous passez maintenant au chapitre
<link linkend="sect5">Configurer les syst&egrave;mes Windows</link>.</para>
</sect2>
</sect1>
<sect1 id="sect5">
<title>Configurer les Syst&egrave;mes Windows</title>
<para>Comme indiqu&eacute; au Chapitre <link linkend="sect2">Mise en oeuvre du r&eacute;seau local</link>, 
le r&eacute;seau de notre exemple
comporte un syst&egrave;me FreeBSD (&ldquo;Curly&rdquo;) qui sert de passerelle
(ou routeur) pour un r&eacute;seau local compos&eacute; de trois moutures diff&eacute;rentes
de syst&egrave;mes Windows. Pour que ces stations puissent utiliser Curly comme
routeur, elles doivent &ecirc;tre correctement configur&eacute;es. Notez bien que l'on
ne vous explique pas ici comment configurer les postes Windows pour qu'ils
puissent se connecter eux-m&ecirc;mes. Si vous cherchez de bonnes explications sur
le sujet, voyez 
<ulink url="http://www.aladdin.co.uk/techweb">http://www.aladdin.co.uk/techweb</ulink>.</para>
<sect2>
<title>Configurer Windows 95</title>
<para>Il est relativement simple de configurer Windows 95 pour relier un poste
&agrave; votre r&eacute;seau local. Le configuration r&eacute;seau Windows 95 doit &ecirc;tre l&eacute;g&eacute;rement
modifi&eacute;e pour pouvoir utiliser le syst&egrave;me FreeBSD comme passerelle par d&eacute;faut
vers votre fournisseur d'acc&egrave;s. Effectuez les &eacute;tapes suivantes:</para>
<sect3>
<title>Cr&eacute;er le fichier Windows 95 <filename>hosts</filename></title>
<para>Pour vous connecter aux autres postes TCP/IP du r&eacute;seau local, vous devrez
installer une copie du fichier <filename>hosts</filename> que vous avez cr&eacute;&eacute;
sur votre syst&egrave;me FreeBSD au paragraphe 
<link linkend="sect34">Renseigner la liste des autres machines du r&eacute;seau</link>.</para>
<itemizedlist>
<listitem><para>Cliquez sur le bouton &ldquo;D&eacute;marrer&rdquo;, choisissez
&ldquo;Ex&eacute;cuter ...&rdquo;, lancez 
<userinput>notepad \WINDOWS\HOSTS</userinput>
et cliquez sur &ldquo;OK&rdquo;,</para></listitem>
<listitem><para>Sous l'&eacute;diteur, entrez les noms et les adresses des machines
recopi&eacute;s du fichier <filename>hosts</filename> du paragraphe 
<link linkend="sect34">Renseigner la liste des autres machines du r&eacute;seau</link>,</para></listitem>
<listitem><para>Une fois que c'est fait, quittez <command>notepad</command>
(assurez-vous d'avoir enregistr&eacute; le fichier!).</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>D&eacute;finir le configuration r&eacute;seau TCP/IP Windows 95</title>
<itemizedlist>
<listitem><para>Cliquez sur le bouton &ldquo;D&eacute;marrer&rdquo; de la barre de
t&acirc;ches, Choisissez &ldquo;Param&egrave;tres&rdquo; et 
&ldquo;Panneau de Configuration&rdquo;,</para></listitem>
<listitem><para>Double-cliquez sur l'ic&ocirc;ne r&eacute;seau pour 
l'ouvrir.</para>
<para>Les param&egrave;tres des &eacute;l&eacute;ments du r&eacute;seau sont tous 
affich&eacute;s.</para></listitem>
<listitem><para>S&eacute;lectionnez l'option &ldquo;Configuration&rdquo; et faites 
d&eacute;filer la liste des composants install&eacute;s pour choisir la ligne 
&ldquo;TCP/IP -><replaceable>votre interface</replaceable>&rdquo; (o&ugrave;
<replaceable>votre interface</replaceable> est le nom ou le mod&egrave;le de
votre contr&ocirc;leur Ethernet),</para>
<para>Si &ldquo;TCP/IP&rdquo; ne figure pas dans la liste des composants
r&eacute;seau install&eacute;s, cliquez sur le bouton &ldquo;Ajouter&rdquo; pour
l'installer avant de continuer</para>
<tip><para>Ajouter | Protocoles | Microsoft | TCP/IP | OK.</para></tip>
</listitem>
<listitem><para>Cliquez sur le bouton &ldquo;Propri&eacute;t&eacute;s&rdquo; pour afficher
la liste des param&egrave;tres associ&eacute;s au composant TCP.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives &agrave; l'adresse IP</title>
<itemizedlist>
<listitem><para>Choisissez l'onglet &ldquo;Adresse IP&rdquo;</para></listitem>
<listitem><para>Enfoncez le bouton &ldquo;Sp&eacute;cifier une adresse 
IP&rdquo;.</para>
<para>(Dans notre exemple, le syst&egrave;me Windows 95 est celui que nous avons 
appel&eacute; &ldquo;Larry&rdquo;.)</para></listitem>
<listitem><para>Dans la zone &ldquo;Adresse IP&rdquo;, entrez 
&ldquo;192.168.1.2&rdquo;,</para></listitem>
<listitem><para>Entrez &ldquo;255.255.255.0&rdquo; dans le zone
&ldquo;Masque de Sous-r&eacute;seau&rdquo;.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives &agrave; la passerelle</title>
<itemizedlist>
<listitem><para>Cliquez sur l'onglet &ldquo;Passerelle&rdquo;.</para>
<para>Dans le r&eacute;seau de notre exemple, c'est le syst&egrave;me FreeBSD qui sera notre
passerelle vers l'Internet (routant les paquets entre le r&eacute;seau local Ethernet
et la connexion PPP). Entrez l'adresse IP de l'interface Ethernet de la
machine FreeBSD, &ldquo;192.168.1.1&rdquo;, dans la zone 
&ldquo;Nouvelle Passerelle&rdquo; et cliquez sur le bouton 
&ldquo;Ajouter&rdquo;. S'il y a d'autres passerelles d&eacute;finies dans les
&ldquo;Passerelles Install&eacute;es&rdquo;, peut-&ecirc;tre devrez-vous les 
supprimer.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives au DNS</title>
<para>Nous supposons que votre fournisseur d'acc&egrave;s Internet vous a donn&eacute; une
liste de serveurs de noms de domaines (Domain Name Servers)&nbsp;-&nbsp;ou
&ldquo;Serveurs DNS&rdquo;&nbsp;-&nbsp;que vous devez utiliser. Si vous voulez
mettre en service un serveur DNS sur votre machine FreeBSD, reportez-vous au
chapitre
<link linkend="sect7">Exercices pour l'&eacute;tudiant int&eacute;ress&eacute;</link> pour avoir des indications sur 
l'installation d'un serveur DNS sur une machine FreeBSD.</para>
<itemizedlist>
<listitem><para>Cliquez sur l'onglet &ldquo;Configuration DNS&rdquo;,</para>
</listitem>
<listitem><para>Assurez-vous que l'option &ldquo;Activer DNS&rdquo; est 
bien s&eacute;lectionn&eacute;e,</para>
<para>(Si cette option n'est pas s&eacute;lectionn&eacute;e, seules les machines d&eacute;finies dans
votre fichier <filename>hosts</filename> seront accessibles et vous ne pourrez
pas &ldquo;surfer&rdquo; comme vous le souhaitez!)</para></listitem>
<listitem><para>Dans la zone &ldquo;H&ocirc;te&rdquo;, entrez le nom du poste
Windows 95, dans notre cas : &ldquo;Larry&rdquo;,</para></listitem>
<listitem><para>Dans la zone &ldquo;Domaine&rdquo;, entrez le nom du r&eacute;seau
local, dans notre cas : &ldquo;my.domain&rdquo;,</para></listitem>
<listitem><para>Dans la zone &ldquo;Ordre de recherche DNS&rdquo;, 
entrez les adresses
IP des serveurs DNS que votre fournisseur vous a donn&eacute;es, cliquez sur 
&ldquo;Ajouter&rdquo; &agrave; chaque adresse que vous d&eacute;finissez. R&eacute;p&eacute;tez l'op&eacute;ration
autant de fois que n&eacute;cessaire pour entrer toutes les adresses que votre 
fournisseur vous a indiqu&eacute;es.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Autres options TCP/IP Windows 95</title>
<para>Pour nos besoins, les param&egrave;tres des sections &ldquo;Avanc&eacute;es&rdquo;,
&ldquo;Configuration WINS&rdquo; et &ldquo;Liens&rdquo; sont inutiles.</para>
<para>Si vous souhaitez utiliser le service de noms Internet de Windows 
(Windows Internet Naming Service&nbsp;-&nbsp;&ldquo;WINS&rdquo;), vous trouverez
plus d'informations sur 
<ulink url="http://www.localnet.org">http://www.localnet.org</ulink>,
en particulier en ce qui concerne le partage de fichiers de fa&ccedil;on transparente
&agrave; travers l'Internet.</para>
</sect3>
<sect3>
<title>Pour finir</title>
<itemizedlist>
<listitem><para>Cliquez sur &ldquo;OK&rdquo; pour fermer la fen&ecirc;tre
&ldquo;Propri&eacute;t&eacute;s TCP/IP&rdquo;,</para></listitem>
<listitem><para>Cliquez sur &ldquo;OK&rdquo; pour fermer la fen&ecirc;tre
&ldquo;Panneau de Contr&ocirc;le R&eacute;seau&rdquo;,</para></listitem>
<listitem><para>Red&eacute;marrez votre ordinateur si on vous le demande.</para>
</listitem>
</itemizedlist>
<para>C'est tout!</para>
</sect3>
</sect2>
<sect2>
<title>Configurer Windows NT</title>
<para>Il est relativement simple de configurer Windows NT pour relier un poste
&agrave; votre r&eacute;seau local. Les proc&eacute;dures sont semblables &agrave; celles suivies pour
Windows 95 &agrave; quelques diff&eacute;rences pr&egrave;s quant &agrave; l'interface utilisateur.</para>
<para>Les &eacute;tapes d&eacute;crites ci-dessous s'appliquent &agrave; Windows NT 4.0 Workstation,
mais les principes sont les m&ecirc;mes pour Windows NT 3.5x. Si vous installez un 
poste Windows NT 3.5x, vous pouvez vous r&eacute;f&eacute;rer 
au paragraphe <link linkend="sect53">Configurer Windows for Workgroups</link>, en
effet, l'interface utilisateur est la m&ecirc;me pour NT 3.5x et WfW.</para>
<para>Effectuez les op&eacute;rations suivantes:</para>
<sect3>
<title>Cr&eacute;er le fichier Windows NT <filename>hosts</filename></title>
<para>Pour vous connecter aux autres postes TCP/IP du r&eacute;seau local, vous devrez
installer une copie du fichier <filename>hosts</filename> que vous avez cr&eacute;&eacute;
sur votre syst&egrave;me FreeBSD au paragraphe 
<link linkend="sect34">Configurer Windows for Workgroups</link>.</para>
<itemizedlist>
<listitem><para>Cliquez sur le bouton &ldquo;D&eacute;marrer&rdquo;, choisissez
&ldquo;Ex&eacute;cuter ...&rdquo;, lancez 
<userinput>notepad \WINDOWS\SYSTEM\DRIVERS\ETC\HOSTS</userinput>
et cliquez sur &ldquo;OK&rdquo;,</para></listitem>
<listitem><para>Sous l'&eacute;diteur, entrez les noms et les adresses des machines
recopi&eacute;s du fichier <filename>hosts</filename> du paragraphe 
<link linkend="sect34">Renseigner la liste des autres machines du r&eacute;seau</link>,</para></listitem>
<listitem><para>Une fois que c'est fait, quittez <command>notepad</command>
(assurez-vous d'avoir enregistr&eacute; le fichier!).</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>D&eacute;finir le configuration r&eacute;seau TCP/IP Windows NT</title>
<itemizedlist>
<listitem><para>Cliquez sur le bouton &ldquo;D&eacute;marrer&rdquo; de la barre de
t&acirc;ches, Choisissez &ldquo;Param&egrave;tres&rdquo; et 
&ldquo;Panneau de Configuration&rdquo;,</para></listitem>
<listitem><para>Double-cliquez sur l'ic&ocirc;ne r&eacute;seau pour 
l'ouvrir,</para></listitem>
<listitem><para>Dans l'onglet &ldquo;Identification&rdquo;, 
v&eacute;rifiez les informations des zones &ldquo;Nom d'Ordinateur&rdquo; et
&ldquo;Workgroup&rdquo;. Dans notre exemple, &ldquo;Shemp&rdquo; sera
le nom de la machine, et &ldquo;Stooges&rdquo; celui du groupe de travail.
Choisissez &ldquo;Modifier&rdquo; pour corriger ces valeurs au 
besoin,</para></listitem>
<listitem><para>Choisissez l'onglet &ldquo;Protocoles&rdquo;.</para>
<para>Les Protocoles R&eacute;seau install&eacute;s seront affich&eacute;s. Il peut y en avoir un
certain nombre, mais le seul qui nous int&eacute;resse ici est le 
&ldquo;Protocole TCP/IP&rdquo;. Si le &ldquo;Protocole TCP/IP&rdquo; 
n'appara&icirc;t pas dans la liste, cliquez sur le bouton &ldquo;Ajouter&rdquo; 
pour l'installer.</para>
<tip><para>Ajouter | Protocole TCP/IP | OK.</para></tip>
</listitem>
<listitem><para>S&eacute;lectionnez &ldquo;Protocole TCP/IP&rdquo; et cliquez sur le
bouton &ldquo;Propri&eacute;t&eacute;s&rdquo;.</para>
<para>Les diff&eacute;rentes propri&eacute;t&eacute;s associ&eacute;es &agrave; TCP/IP appara&icirc;tront.</para>
</listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives &agrave; l'adresse IP</title>
<para>V&eacute;rifiez que l'interface Ethernet est bien d&eacute;finie dans la zone 
&ldquo;Carte R&eacute;seau&rdquo;; si ce n'est pas le cas, parcourez la
liste des contr&ocirc;leurs jusqu'&agrave; ce que l'interface ad&eacute;quate soit affich&eacute;e.</para>
<itemizedlist>
<listitem><para>Choisissez l'option &ldquo;Sp&eacute;cifier une Adresse IP&rdquo;
pour activer les trois zones de texte,</para>
<para>Dans notre exemple, le poste Windows NT est celui qui s'appele
&ldquo;Shemp&rdquo;.</para></listitem>
<listitem><para>Dans la zone &ldquo;Adresse IP&rdquo;, entrez 
&ldquo;192.168.1.4&rdquo;,</para></listitem>
<listitem><para>Entrez &ldquo;255.255.255.0&rdquo; dans le zone
&ldquo;Masque de Sous-r&eacute;seau.&rdquo;.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives &agrave; la passerelle</title>
<para>Dans le r&eacute;seau de notre exemple, c'est le syst&egrave;me FreeBSD qui sera notre
passerelle vers l'Internet (routant les paquets entre le r&eacute;seau local Ethernet
et la connexion PPP).</para>
<itemizedlist>
<listitem><para>S'il n'y a rien encore dans la zone &ldquo;Nouvelle
Passerelle&rdquo;, entrez l'adresse IP de l'interface Ethernet de la
machine FreeBSD, &ldquo;192.168.1.1&rdquo;, dans cette zone 
et cliquez sur le bouton &ldquo;Ajouter&rdquo;. Sinon, utilisez le bouton
"Avanc&eacute;es" et la fonction &ldquo;Ajouter&rdquo; pour ajouter cette nouvelle
passerelle.</para>
<para>S'il y a d'autres passerelles d&eacute;finies dans les
&ldquo;Passerelles Install&eacute;es&rdquo;, peut-&ecirc;tre devrez-vous les 
supprimer.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives au DNS</title>
<para>Nous supposons que votre fournisseur d'acc&egrave;s Internet vous a donn&eacute; une
liste de serveurs de noms de domaines (Domain Name Servers)&nbsp;-&nbsp;ou
&ldquo;Serveurs DNS&rdquo;&nbsp;-&nbsp;que vous devez utiliser.</para>
<para>Si vous voulez
mettre en service un serveur DNS sur votre machine FreeBSD, reportez-vous 
au chapitre
<link linkend="sect7">Exercices pour l'&eacute;tudiant int&eacute;ress&eacute;</link> pour avoir des indications sur 
l'installation d'un serveur DNS sur une machine FreeBSD.</para>
<itemizedlist>
<listitem><para>Cliquez sur le bouton &ldquo;DNS&rdquo;,</para>
</listitem>
<listitem><para>Dans la zone &ldquo;Nom d'H&ocirc;te&rdquo;, entrez le nom du poste
Windows NT, dans notre cas : &ldquo;Shemp&rdquo;,</para></listitem>
<listitem><para>Dans la zone &ldquo;Domaine&rdquo;, entrez le nom du r&eacute;seau
local, dans notre cas : &ldquo;my.domain&rdquo;,</para></listitem>
<listitem><para>Dans la zone &ldquo;Ordre de recherche du service DNS&rdquo;,
entrez les adresses
IP des serveurs DNS que votre fournisseur vous a donn&eacute;es, cliquez sur 
&ldquo;Ajouter&rdquo; &agrave; chaque adresse que vous d&eacute;finissez. R&eacute;p&eacute;tez l'op&eacute;ration
autant de fois que n&eacute;cessaire pour entrer toutes les adresses que votre 
fournisseur vous a indiqu&eacute;es.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Autres options TCP/IP Windows NT</title>
<para>Pour nos besoins, les param&egrave;tres des sections
&ldquo;Adresses WINS&rdquo; et &ldquo;Routage&rdquo; sont inutiles.</para>
<para>Si vous souhaitez utiliser le service de noms Internet de Windows 
(Windows Internet Naming Service&nbsp;-&nbsp;&ldquo;WINS&rdquo;), vous trouverez
plus d'informations sur 
<ulink url="http://www.localnet.org">http://www.localnet.org</ulink>,
en particulier en ce qui concerne le partage de fichiers de fa&ccedil;on transparente
&agrave; travers l'Internet.</para>
</sect3>
<sect3>
<title>Pour finir</title>
<itemizedlist>
<listitem><para>Cliquez sur &ldquo;OK&rdquo; pour fermer la fen&ecirc;tre
&ldquo;Propri&eacute;t&eacute;s TCP/IP&rdquo;,</para></listitem>
<listitem><para>Cliquez sur &ldquo;OK&rdquo; pour fermer la fen&ecirc;tre
&ldquo;Panneau de Contr&ocirc;le R&eacute;seau&rdquo;,</para></listitem>
<listitem><para>Red&eacute;marrez votre ordinateur si on vous le demande.</para>
</listitem>
</itemizedlist>
<para>C'est tout!</para>
</sect3>
</sect2>
<sect2 id="sect53">
<title>Configurer Windows for Workgroups</title>
<para>Pour qu'un poste Windows for Workgroups puisse &ecirc;tre utilis&eacute; en r&eacute;seau, il
faut avoir install&eacute; les pilotes qui sont sur la disquette Microsoft TCP/IP. Ces
pilotes ne sont pas inclus avec WfW et les disquettes qui vont avec. S'il vous
en faut une copie, ils sont disponibles sur
<ulink url="ftp://ftp.microsoft.com/peropsys/windows/public/tcpip">ftp://ftp.microsoft.com/peropsys/windows/public/tcpip.</ulink></para> 
<para>Une fois que les pilotes TCP/IP ont &eacute;t&eacute; install&eacute;s, effectuez les 
op&eacute;rations suivantes:</para>
<sect3>
<title>Cr&eacute;er le fichier Windows for Workgroups 
<filename>hosts</filename></title>
<para>Pour vous connecter aux autres postes TCP/IP du r&eacute;seau local, vous devrez
installer une copie du fichier <filename>hosts</filename> que vous avez cr&eacute;&eacute;
sur votre syst&egrave;me FreeBSD au paragraphe 
<link linkend="sect34">Renseigner la liste des autres machines du r&eacute;seau</link>.</para>
<itemizedlist>
<listitem><para>Dans le Gestionnaire de Programmes, cliquez sur le bouton 
&ldquo;Fichier&rdquo;, choisissez &ldquo;Ex&eacute;cuter ...&rdquo;, lancez 
<userinput>notepad \WINDOWS\HOSTS</userinput>
et cliquez sur &ldquo;OK&rdquo;,</para></listitem>
<listitem><para>Sous l'&eacute;diteur, entrez les noms et les adresses des machines
recopi&eacute;s du fichier <filename>hosts</filename> de 
<link linkend="sect34">Renseigner la liste des autres machines du r&eacute;seau</link>,</para></listitem>
<listitem><para>Une fois que c'est fait, quittez <command>notepad</command>
(assurez-vous d'avoir enregistr&eacute; le fichier!).</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>D&eacute;finir le configuration r&eacute;seau TCP/IP Windows for Workgroups</title>
<itemizedlist>
<listitem><para>Dans le Gestionnaire de Programmes, ouvrez le groupe
&ldquo;R&eacute;seau&rdquo; en double-cliquant sur l'ic&ocirc;ne,</para></listitem>
<listitem><para>Double-cliquez sur l'ic&ocirc;ne &ldquo;Param&egrave;tres 
R&eacute;seau&rdquo;,</para></listitem>
<listitem><para>Dans la bo&icirc;te de dialogue &ldquo;Pilotes R&eacute;seau&rdquo;, 
double-cliquez sur l'option &ldquo;Microsoft TCP/IP-32&rdquo;.</para>
</listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives &agrave; l'adresse IP</title>
<para>V&eacute;rifiez que l'interface Ethernet est bien d&eacute;finie dans la liste
&ldquo;Carte R&eacute;seau&rdquo;; si ce n'est pas le cas, parcourez la
liste des contr&ocirc;leurs jusqu'&agrave; ce que l'interface ad&eacute;quate soit affich&eacute;e
et s&eacute;lectionnez-la en cliquant dessus.</para>
<itemizedlist>
<listitem><para>V&eacute;rifiez que l'option &ldquo;Activer la Configuration DHCP
Automatique&rdquo; n'est pas s&eacute;lectionn&eacute;e. Si c'est le cas, cliquez dessus
pour effacer le &ldquo;X&rdquo;.</para></listitem>
<listitem><para>Dans notre exemple, le poste Windows for Workgroups est celui 
qui s'appelle &ldquo;Moe&rdquo;; dans la zone &ldquo;Adresse IP&rdquo;, entrez 
&ldquo;192.168.1.3&rdquo;,</para></listitem>
<listitem><para>Entrez &ldquo;255.255.255.0&rdquo; dans le zone
&ldquo;Masque de Sous-r&eacute;seau&rdquo;.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives &agrave; la passerelle</title>
<para>Dans le r&eacute;seau de notre exemple, c'est le syst&egrave;me FreeBSD qui sera notre
passerelle vers l'Internet (routant les paquets entre le r&eacute;seau local Ethernet
et la connexion PPP).</para>
<itemizedlist>
<listitem><para>Entrez l'adresse IP de l'interface Ethernet de la
machine FreeBSD, &ldquo;192.168.1.1&rdquo;, dans la zone 
&ldquo;Passerelle par D&eacute;faut&rdquo;.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Configurer les informations relatives au DNS</title>
<para>Nous supposons toujours que votre fournisseur d'acc&egrave;s Internet vous a 
donn&eacute; une liste de serveurs de noms de domaines (Domain Name Servers)&nbsp;-&nbsp;ou
&ldquo;Serveurs DNS&rdquo;&nbsp;-&nbsp;que vous devez utiliser.</para>
<para>Si vous voulez
mettre en service un serveur DNS sur votre machine FreeBSD, reportez-vous 
au chapitre
<link linkend="sect7">Exercices pour l'&eacute;tudiant int&eacute;ress&eacute;</link> pour avoir des indications sur 
l'installation d'un serveur DNS sur une machine FreeBSD.</para>
<itemizedlist>
<listitem><para>Cliquez sur l'onglet &ldquo;Configuration DNS&rdquo;,</para>
</listitem>
<listitem><para>Dans la zone &ldquo;H&ocirc;te&rdquo;, entrez le nom du poste
Windows for Workgroups, dans notre cas : &ldquo;Moe&rdquo;,</para></listitem>
<listitem><para>Dans la zone &ldquo;Domaine&rdquo;, entrez le nom du r&eacute;seau
local, dans notre cas : &ldquo;my.domain&rdquo;,</para></listitem>
<listitem><para>Dans la zone &ldquo;Ordre de recherche DNS&rdquo;, 
entrez les adresses
IP des serveurs DNS que votre fournisseur vous a donn&eacute;es, cliquez sur 
&ldquo;Ajouter&rdquo; &agrave; chaque adresse que vous d&eacute;finissez. R&eacute;p&eacute;tez l'op&eacute;ration
autant de fois que n&eacute;cessaire pour entrer toutes les adresses que votre 
fournisseur vous a indiqu&eacute;es,</para></listitem>
<listitem><para>Cliquez sur &ldquo;OK&rdquo; pour fermer la fen&ecirc;tre
&ldquo;Configuration DNS&rdquo;.</para></listitem>
</itemizedlist>
</sect3>
<sect3>
<title>Pour finir</title>
<itemizedlist>
<listitem><para>Cliquez sur &ldquo;OK&rdquo; pour fermer la fen&ecirc;tre
&ldquo;Propri&eacute;t&eacute;s TCP/IP&rdquo;,</para></listitem>
<listitem><para>Cliquez sur &ldquo;OK&rdquo; pour fermer la fen&ecirc;tre
&ldquo;Panneau de Contr&ocirc;le R&eacute;seau&rdquo;,</para></listitem>
<listitem><para>Red&eacute;marrez votre ordinateur si on vous le demande.</para>
</listitem>
</itemizedlist>
<para>C'est tout!</para>
</sect3>
</sect2>
</sect1>
<sect1 id="sect6">
<title>Tester le r&eacute;seau</title>
<para>Une fois que vous aurez termin&eacute; les op&eacute;rations n&eacute;cessaires d&eacute;crites plus
haut, votre passerelle PPP vers l'Internet devrait &ecirc;tre op&eacute;rationnelle.</para>
<sect2>
<title>Tester la connexion vers l'ext&eacute;rieur</title>
<para>La premi&egrave;re chose &agrave; v&eacute;rifier est que la connexion s'&eacute;tablisse entre votre
modem et votre fournisseur d'acc&egrave;s.</para>
</sect2>
<sect2>
<title>Tester le r&eacute;seau local</title>
<para>*** &agrave; faire ***</para>
</sect2>
</sect1>
<sect1 id="sect7">
<title>Exercices pour l'&eacute;tudiant int&eacute;ress&eacute;</title>
<sect2>
<title>G&eacute;rer un mini-DNS</title>
<para>Bien que g&eacute;rer une hi&eacute;rarchie du service de noms de domaines 
(&ldquo;Domain Name Service&rdquo;&nbsp;-&nbsp;DNS) puisse &ecirc;tre une t&acirc;che
diabolique, il est tout &agrave; fait faisable d'installer un mini-serveur
DNS sur le syt&egrave;me FreeBSD qui vous sert aussi de passerelle vers votre
fournisseur d'acc&egrave;s.</para>
<para>A partir des fichiers existants dans <filename>/etc/namedb</filename>
apr&egrave;s installation de FreeBSD, il est possible de d&eacute;finir un serveur DNS qui
ait autorit&eacute; sur le r&eacute;seau de notre exemple et serve d'interface avec 
l'architecture DNS de l'Internet.</para>
<para>Pour cette configuration minimale, il suffit de trois fichiers:</para>
<itemizedlist>
<listitem><para><filename>/etc/namedb/named.boot</filename></para></listitem>
<listitem><para><filename>/etc/namedb/named.root</filename></para></listitem>
<listitem><para><filename>/etc/namedb/mydomain.db</filename></para></listitem>
</itemizedlist>
<para>Le fichier <filename>/etc/namedb/named.root</filename> est automatiquement
initialis&eacute; &agrave; l'installation de FreeBSD, les deux autres fichiers doivent &ecirc;tre
renseign&eacute;s manuellement.</para>
<sect3>
<title>Le fichier <filename>/etc/namedb/named.boot</filename></title>
<para>Le fichier <filename>/etc/namedb/named.boot</filename> d&eacute;crit la
configuration initiale du serveur DNS. Essentiellement, il indique au
serveur de noms:</para>
<orderedlist>
<listitem><para>O&ugrave; sont les fichiers de configuration,</para></listitem>
<listitem><para>De quels &ldquo;noms de domaines&rdquo; il a la
responsabilit&eacute;,</para></listitem>
<listitem><para>O&ugrave; trouver les autres serveurs DNS.</para></listitem>
</orderedlist>
<para>Avec l'&eacute;diteur <command>ee</command>, cr&eacute;ez un fichier 
<filename>/etc/namedb/named.boot</filename> comme suit:</para>
<para>
<programlisting>

; fichier de d&eacute;marrage pour un mini-serveur de noms de domaines

directory       /etc/namedb

; type    domain             source machine/fichier   fichier de sauvegarde

cache     .                  named.root
primary   my.domain.         mydomain.db
</programlisting>
</para>
<para>Les lignes qui commencent par un point-virgule sont des commentaires. 
Voici la signification des autres lignes:</para>
<itemizedlist>
<listitem>
<para>
<programlisting>
directory /etc/namedb
</programlisting>
</para>
<para>Dit au serveur de noms o&ugrave; trouver les fichiers de configuration r&eacute;f&eacute;renc&eacute;s
dans la suite du fichier <filename>/etc/namedb/named.boot</filename>.</para>
</listitem>
<listitem>
<para>
<programlisting>
cache . named.root
</programlisting>
</para>
<para>Dit au serveur de noms que la liste des serveurs de la racine (&ldquo;Root
Servers&rdquo;) se trouve dans le fichier <filename>named.root</filename>. (Ce
fichier est inclus dans l'installation standard et n'est pas d&eacute;crit ici.)</para>
</listitem>
<listitem>
<para>
<programlisting>
primary my.domain mydomain.db
</programlisting>
</para>
<para>Dit au serveur de noms qu'il a &ldquo;autorit&eacute;&rdquo; sur un domaine DNS
appel&eacute; &ldquo;my.domain&rdquo; et que la liste des adresses IP des machines 
du domaine &ldquo;my.domain&rdquo; (le r&eacute;seau local) se trouve dans le fichier
<filename>/etc/namedb/mydomain.db</filename>.
</para>
</listitem>
</itemizedlist>
<para>Une fois cr&eacute;&eacute; et sauvegard&eacute; le fichier
<filename>/etc/namedb/named.boot</filename>, passez &agrave; l'&eacute;tape suivante pour 
cr&eacute;er le fichier <filename>/etc/namedb/named.db</filename>.</para>
</sect3>
<sect3>
<title>Le fichier <filename>/etc/namedb/named.db</filename></title>
<para>Le fichier <filename>/etc/namedb/named.boot</filename> liste les noms
et les adresses IP de <emphasis>toutes</emphasis> les machines du r&eacute;seau
local.</para>
<para><emphasis>Pour une description d&eacute;taill&eacute;e des instructions de ce fichier,
reportez-vous aux pages de manuel de <command>named</command></emphasis>.</para>
<para>Le fichier <filename>/etc/namedb/named.boot</filename> de notre serveur
DNS minimum contient les lignes suivantes:</para>
<para>
<programlisting>
@       IN SOA  my.domain. root.my.domain.  (
			       961230  ; Serial
			       3600    ; Refresh
			       300     ; Retry
			       3600000 ; Expire
			       3600 )  ; Minimum
       IN NS   curly.my.domain.

curly.my.domain.        IN A    192.168.1.1     # The FreeBSD box
larry.my.domain.        IN A    192.168.1.2     # The Win'95 box
moe.my.domain.          IN A    192.168.1.3     # The WfW box
shemp.my.domain.        IN A    192.168.1.4     # The Windows NT box

$ORIGIN 1.168.192.IN-ADDR.ARPA
  	        IN NS   curly.my.domain.
1               IN PTR  curly.my.domain.
2               IN PTR  larry.my.domain.
3               IN PTR  moe.my.domain.
4               IN PTR  shemp.my.domain.

$ORIGIN 0.0.127.IN-ADDR.ARPA
	        IN NS   curly.my.domain.
1               IN PTR  localhost.my.domain.
</programlisting>
</para>
<para>Bri&egrave;vement, ce fichier d&eacute;clare que le serveur DNS local est:</para>
<itemizedlist>
<listitem><para>Le &ldquo;D&eacute;but d'Autorit&eacute;&rdquo; (Start Of Authority) pour
le domaine appel&eacute; &ldquo;my.domain&rdquo;,</para></listitem>
<listitem><para>Le serveur de noms (Name Server&nbsp;-&nbsp;&ldquo;NS&rdquo;) pour
&ldquo;my.domain&rdquo;,</para></listitem>
<listitem><para>Responsable de la r&eacute;solution inverse des adresses IP qui 
commencent par &ldquo;192.168.1&rdquo; et &ldquo;127.0.0&rdquo; 
(&ldquo;$ORIGIN ...&rdquo;).</para></listitem>
</itemizedlist>
<para>Pour ajouter de nouvelles machines, vous devez ajouter deux lignes pour
chaque syst&egrave;me; une dans la section du haut o&ugrave; les noms des syst&egrave;mes sont
associ&eacute;s aux adresses Internet (&ldquo;IN A&rdquo;), et une autre ligne qui
associe inversement l'adresse au nom de la machine (&ldquo;IN PTR&rdquo;),
dans la section
&ldquo;$ORIGIN 1.168.192.IN-ADDR.ARPA&rdquo;.</para>
</sect3>
<sect3>
<title>D&eacute;marrer le serveur DNS</title>
<para>Par d&eacute;faut, le serveur DNS (<filename>/etc/sbin/named</filename>) n'est
pas lanc&eacute; au d&eacute;marrage du syst&egrave;me. Vous pouvez modifier ce comportement en
rectifiant une seule ligne dans le fichier <filename>/etc/rc.conf</filename>,
comme suit:</para>
<para>Avec l'&eacute;diteur <command>ee</command>, visualisez le fichier 
<filename>/etc/rc.conf</filename>. Descendez d'une quarantaine de lignes jusqu'&agrave;
ce que vous trouviez la section qui dit:</para>
<para>
<programlisting>
---
named_enable="NO"                       # Run named, the DNS server (or NO).
named_flags="-b /etc/namedb/named.boot" # Flags to named (if enabled).
---
</programlisting>
</para>
<para>et modifiez-la en:</para>
<para>
<programlisting>
---
named_enable="YES"                      # Run named, the DNS server (or NO).
named_flags="-b /etc/namedb/named.boot" # Flags to named (if enabled).
---
</programlisting>
</para>
<para>Sauvegardez le fichier et red&eacute;marrez le syst&egrave;me.</para>
<para>Vous pouvez aussi d&eacute;marrer le serveur DNS avec la commande 
suivante:</para>
<para>
<userinput>
<prompt>#</prompt> named -b /etc/namedb/named.boot
</userinput>
</para>
<para>Chaque fois que vous modifiez les fichiers du r&eacute;pertoire
<filename>/etc/namedb/named.boot</filename>, vous devez faire relire ces 
modifications par le serveur DNS avec la commande suivante:</para>
<para>
<userinput>
<prompt>#</prompt> kill -HUP `cat /var/run/named.pid`
</userinput>
</para>
</sect3>
</sect2>
<sect2>
<title>Essayer les filtres PPP</title>
<para>Le programme <command>ppp</command> a la capacit&eacute; d'appliquer des r&egrave;gles
de filtrage au trafic qu'il route. Bien que cela ne soit pas aussi s&eacute;curis&eacute;
qu'un v&eacute;ritable coupe-feu, cela autorise quelques contr&ocirc;les d'acc&egrave;s &agrave; la
liaison.</para>
<para>(&ldquo;<filename>man ipfw</filename>&rdquo; pour plus 
d'informations sur la configuration d'un syst&egrave;me FreeBSD plus s&eacute;curis&eacute;.)</para>
<para>La documentation compl&egrave;te des diff&eacute;rents filtres et r&egrave;gles utilisables
avec le programme <command>ppp</command> se trouve dans les pages de manuel
de <command>ppp</command>.</para>
<para>Il y a quatre classes de filtres qui s'appliquent au programme
<command>ppp</command>:</para>
<itemizedlist>
<listitem>
<para><filename>afilter</filename>&nbsp;-&nbsp;filtre compteur d'acc&egrave;s 
(ou &ldquo;Keep Alive&rdquo;&nbsp;-&nbsp;garder en vie)</para>
<para>Ils d&eacute;finissent quels &eacute;v&eacute;nements sont ignor&eacute;s par l'instruction
<filename>set timeout=</filename>.</para>
</listitem>
<listitem>
<para><filename>dfilter</filename>&nbsp;-&nbsp;filtre d'appel</para> 
<para>Ils d&eacute;finissent quels &eacute;v&eacute;nements sont ignor&eacute;s par <command>ppp</command>
en mode connexion &agrave; la demande.</para>
</listitem>
<listitem>
<para><filename>ifilter</filename>&nbsp;-&nbsp;filtre d'entr&eacute;e</para> 
<para>Ils d&eacute;finissent quels paquets entrants sont accept&eacute;s ou 
refus&eacute;s par le programme <command>ppp</command>.</para>
</listitem>
<listitem>
<para><filename>ofilter</filename>&nbsp;-&nbsp;filtre de sortie</para>
<para>Ils d&eacute;finissent quels paquets sortants sont accept&eacute;s ou 
refus&eacute;s par le programme <command>ppp</command>.</para>
</listitem>
</itemizedlist>
<para>L'exemple qui suit est un extrait de la configuration d'un syst&egrave;me
op&eacute;rationnel qui donne une bonne base pour un fonctionnement Internet
&ldquo;normal&rdquo;, tout en emp&ecirc;chant que <command>ppp</command> accepte
n'importe quoi sur la liaison. Les commentaires d&eacute;crivent la logique de
chaque jeu de r&egrave;gles.:</para>
<para>
<programlisting>
       #
       # filtres KeepAlive 
       # ne pa prendre en compte les paquets ICMP,DNS et RIP
       #
        set afilter 0 deny icmp
        set afilter 1 deny udp src eq 53
        set afilter 2 deny udp dst eq 53
        set afilter 3 deny udp src eq 520
        set afilter 4 deny udp dst eq 520
        set afilter 5 permit 0/0 0/0
       #
       # filtre d'appel:
       #  Note:  ICMP &eacute;tablira la connexion dans cette configuration!
       #
        set dfilter 0 permit 0/0 0/0
       #
       # autoriser les paquets ident
       #
        set ifilter 0 permit tcp dst eq 113
        set ofilter 0 permit tcp src eq 113
       #
       # autoriser les connexions telnet &agrave; l'Internet
       #
        set ifilter 1 permit tcp src eq 23 estab
        set ofilter 1 permit tcp dst eq 23
       #
       # autoriser l'acc&egrave;s ftp &agrave; l'Internet
       #
        set ifilter 2 permit tcp src eq 21 estab
        set ofilter 2 permit tcp dst eq 21
        set ifilter 3 permit tcp src eq 20 dst gt 1023
        set ofilter 3 permit tcp dst eq 20
       #
       # autoriser les requ&ecirc;tes DNS
       #
        set ifilter 4 permit udp src eq 53
        set ofilter 4 permit udp dst eq 53
       #
       # autoriser les transferts de zone DNS
       #
        set ifilter 5 permit tcp src eq 53
        set ofilter 5 permit tcp dst eq 53
       #
       # autoriser l'acc&egrave;s depuis/vers le r&eacute;seau local
       #
        set ifilter 6 permit 0/0 192.168.1.0/24
        set ofilter 6 permit 192.168.1.0/24 0/0
       #
       # autoriser les r&eacute;ponses au ping et traceroute
       #
        set ifilter 7 permit icmp
        set ofilter 7 permit icmp
        set ifilter 8 permit udp dst gt 33433
        set ofilter 9 permit udp dst gt 33433
       #
       # autoriser cvsup
       #
        set ifilter 9 permit tcp src eq 5998
        set ofilter 9 permit tcp dst eq 5998
        set ifilter 10 permit tcp src eq 5999
        set ofilter 10 permit tcp dst eq 5999
       #
       # autoriser NTP pour la synchronization des horloges
       #
        set ifilter 11 permit tcp src eq 123 dst eq 123
        set ofilter 11 permit tcp src eq 123 dst eq 123
        set ifilter 12 permit udp src eq 123 dst eq 123
        set ofilter 12 permit udp src eq 123 dst eq 123
       #
       # SMTP serait une bonne id&eacute;e!
       #
        set ifilter 13 permit tcp src eq 25
        set ofilter 13 permit tcp dst eq 25
       #
       #
       # nous utilisons beaucoup whois, donc nous le laissons passer
       #
        set ifilter 14 permit tcp src eq 43
        set ofilter 14 permit tcp dst eq 43
        set ifilter 15 permit udp src eq 43
        set ofilter 15 permit udp dst eq 43
       #
       # si aucune des conditions ci-dessus n'est remplie, le paquet est refus&eacute;
       #-------
</programlisting>
</para>
<para>Il peut y avoir jusqu'&agrave; vingt r&egrave;gles dans chaque classe de filtres. Dans
chaque classe, les r&egrave;gles sont num&eacute;rot&eacute;es s&eacute;quentiellement de 0 &agrave; 20, 
<emphasis>mais aucune r&egrave;gle dans une classe particuli&egrave;re n'est appliqu&eacute;e tant 
que la r&egrave;gle &ldquo;0&rdquo; n'est pas d&eacute;finie!</emphasis></para>
<para>Si vous d&eacute;cidez de <emphasis>ne pas</emphasis> utiliser de r&egrave;gles de
filtrage dans votre configuration du programme <command>ppp</command>, alors
<emphasis>TOUT</emphasis> le trafic de/vers votre syst&egrave;me sera accept&eacute; lorsqu'il
est connect&eacute; &agrave; votre fournisseur d'acc&egrave;s.</para>
<para>Si vous d&eacute;cidez d'appliquer des r&egrave;gles de filtrages, ajoutez les lignes
pr&eacute;c&eacute;dentes &agrave; votre fichier <filename>/etc/ppp/ppp.conf</filename> dans l'une
des sections &ldquo;default&rdquo;, &ldquo;demand&rdquo; ou 
&ldquo;interactive&rdquo; (ou &agrave; toutes&nbsp;-&nbsp;c'est &agrave; vous de voir).</para>
</sect2>
</sect1>
</article>
