Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/contributing/*.po
Languages: es_es, pt_br

source: Anyone can get involved, and there are lots of different ways to do so. Contributing to ports is an excellent way to help <quote>give back</quote> something to the project. Whether you are looking for an ongoing role, or a fun challenge for a rainy day, we would love to have your help!
pt_br: Qualquer um pode se envolver e existem muitas maneiras diferentes de fazer isso. Contribuir para a coleção de ports é uma excelente maneira de ajudar <quote>a devolver algo</quote> ao projeto. Se você está procurando um papel contínuo ou um desafio divertido para um dia chuvoso, nós adoraríamos ter a sua ajuda!

source: There are a number of easy ways you can contribute to keeping the ports tree up to date and in good working order:
es_es: Existen varias formas de ayudar a mantener la colección de ports actualizada y en buen funcionamiento:
pt_br: Existem várias maneiras fáceis de contribuir para manter a árvore de ports atualizada e em boas condições de funcionamento:

source: Find some cool or useful software and <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">create a port</link> for it.
es_es: Encuentre algún software interesante o útil y <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/porters-handbook">cree un port</link>.
pt_br: Encontre algum software legal ou útil e <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">crie um port</link> para ele.

source: There are a large number of ports that have no maintainer. Become a maintainer and <link linkend="adopt-port">adopt a port</link>.
es_es: Hay una gran cantidad de ports que no tienen un maintainer. Conviertase en un maintainer y <link linkend="adopt-port">adopte un port</link>.
pt_br: Existe um grande número de ports que não possuem nenhum mantenedor. Torne-se um mantenedor e <link linkend="adopt-port">adote um port</link>.

source: If you have created or adopted a port, be aware of <link linkend="maintain-port">what you need to do as a maintainer</link>.
es_es: Si ha creado o adoptado un port tenga en cuenta lo <link linkend="maintain-port">que debe hacer como maintainer</link>.
pt_br: Se você criou ou adotou um port, esteja ciente <link linkend="maintain-port">do que você precisa fazer como mantenedor</link>.

source: When you are looking for a quick challenge you could <link linkend="fix-broken">fix a bug or a broken port</link>.
es_es: Si busca un desafío rápido, puede <link linkend="fix-broken">corregir un error o un port roto</link>.
pt_br: Quando estiver procurando um desafio você poderá <link linkend="fix-broken">consertar um bug ou um port quebrado</link>.

source: Pick one of the items from the Ideas page
es_es: Escoja uno de los elementos de la página de ideas
pt_br: Escolha um dos itens da “página de idéias”

source: The <link xlink:href="https://wiki.freebsd.org/IdeasPage">FreeBSD list of projects and ideas for volunteers</link> is also available for people willing to contribute to the FreeBSD project. The list is being regularly updated and contains items for both programmers and non-programmers with information about each project.
es_es: La <link xlink:href="https://wiki.freebsd.org/IdeasPage">lista de proyectos e ideas de FreeBSD para voluntarios</link> también está disponible para las personas que deseen contribuir al proyecto FreeBSD. Esta lista se actualiza regularmente y contiene elementos para programadores y no programadores, así como información sobre cada proyecto.
pt_br: A <link xlink:href="https://wiki.freebsd.org/IdeasPage">lista de projetos do FreeBSD e de idéias para voluntários</link> também está disponível para as pessoas dispostas a contribuir com o projeto FreeBSD. Esta lista é atualizada regularmente e contém itens tanto para programadores e como para não programadores e traz ainda informações sobre cada projeto .

source: How to Contribute
es_es: Cómo colaborar
pt_br: Como Contribuir

source: Contributions to the system generally fall into one or more of the following 5 categories:
es_es: Las contribuciones al sistema generalmente pueden catalogarse en las siguientes 5 categorías:
pt_br: Contribuições para o sistema geralmente se enquadram em uma das 5 categorias seguintes:

source: Bug Reports and General Commentary
es_es: Informes de errores y comentarios generales
pt_br: Relatórios de Bugs e Comentários Gerais

source: An idea or suggestion of <emphasis>general</emphasis> technical interest should be mailed to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">FreeBSD technical discussions mailing list</link>. Likewise, people with an interest in such things (and a tolerance for a <emphasis>high</emphasis> volume of mail!) may subscribe to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">FreeBSD technical discussions mailing list</link>. See <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">The FreeBSD Handbook</link> for more information about this and other mailing lists.
es_es: Una idea o sugerencia técnica de interés general debe enviarse a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">lista de correo de discusiones técnicas de FreeBSD</link>. Del mismo modo, las personas interesadas en estas cosas (¡y una tolerancia para un <emphasis>gran</emphasis> volumen de correo!) pueden subscribirse a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">lista de correo de discusiones técnicas de FreeBSD</link>. Consulte el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">Handbook de FreeBSD</link> para obtener más información sobre esta y otras listas de correo.
pt_br: Uma ideia ou sugestão técnica de interesse <emphasis>geral</emphasis> deverá ser enviada para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">Lista de discussão de assuntos técnicos do FreeBSD</link>. Da mesma forma, pessoas com este tipo de interesse (e tolerância para um <emphasis>alto</emphasis> volume de mensagens!) poderão assinar a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">Lista de discussão de assuntos técnicos do FreeBSD</link>. Veja o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">Handbook do FreeBSD</link> para mais informações sobre esta e outras listas.

source: If you find a bug or are submitting a specific change, please report it using the <link xlink:href="https://bugs.FreeBSD.org/submit/">bug submission form</link>. Try to fill-in each field of the bug report. Unless they exceed 65KB, include any patches directly in the report. If the patch is suitable to be applied to the source tree put <literal>[PATCH]</literal> in the synopsis of the report. When including patches, <emphasis>do not</emphasis> use cut-and-paste because cut-and-paste turns tabs into spaces and makes them unusable. When patches are a lot larger than 20KB, consider compressing them (eg. with <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry>) prior to uploading them.
es_es: Si encuentra un error o quiere enviar un cambio concreto puede informar sobre él utilizando el <link xlink:href="https://bugs.FreeBSD.org/submit/">formulario de envío de errores</link>. Trate de rellenar cada campo del informe. Incluya el parche directamente en el informe salvo que exceda los 65KB. Si el parche es adecuado para ser añadido al árbol del código fuente incluya <literal>[PATCH]</literal> en la sinopsis del informe. Cuando incluya parches no utilice copiar y pegar, porque copiar y pegar transforma las tabulaciones en espacios, haciendo el parche inútil. Cuando el parche exceda los 20KB por favor comprímalo (por ejemplo, con <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> o <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry>) antes de enviarlo.
pt_br: Se você encontrar um bug ou estiver enviando uma mudança específica, por favor relate-o usando o <link xlink:href="https://bugs.FreeBSD.org/submit/">relatório de envio de bug</link>. Tente preencher cada campo com do relato de bug. A não ser que exceda 65KB, inclua qualquer correção diretamente no relatório. Se o patch é apropriado para ser aplicado na árvore do código fonte coloque <literal>[PATCH]</literal> no resumo do relatório. Ao incluir patches, <emphasis>não</emphasis> use copiar-e-colar, pois o copiar-e-colar transforma tabs em espaços e os torna inúteis. Quando os patches são muito maiores que 20KB, considere comprimi-los (por exemplo, com <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry>) antes de fazer o envio.

source: After filing a report, you should receive confirmation along with a tracking number. Keep this tracking number so that you can update us with details about the problem.
es_es: Tras rellenar el informe debería recibir un mensaje de confirmación junto con un número de seguimiento. Conserve este número de seguimiento para que pueda informarnos con nuevos detalles sobre el problema.
pt_br: Após preencher o relatório, você receberá a confirmação com o número de rastreamento. Guarde este número para que você possa nos atualizar com detalhes sobre do problema.

source: See also <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">this article</link> on how to write good problem reports.
es_es: Consulte también <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/problem-reports/article.html">este artículo</link> sobre cómo escribir buenos informes de problemas.
pt_br: Veja também <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports/article.html">este artigo</link> sobre como escrever bons relatórios de problemas.

source: Changes to the Documentation
es_es: Cambios en la documentación
pt_br: Mudanças na Documentação

source: <primary>documentation submissions</primary>
pt_br: <primary>envio de documentação</primary>

source: Changes to the documentation are overseen by the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>. Please look at the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/index.html">FreeBSD Documentation Project Primer</link> for complete instructions. Send submissions and changes (even small ones are welcome!) using the same method as any other bug report.
es_es: Los cambios en la documentación son revisados por los miembros de <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">la lista de correo del proyecto de documentación de FreeBSD</link>. Por favor, consulte el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/fdp-primer/index.html">FreeBSD Documentation Project Primer</link> si quiere información detallada. Envíe contribuciones y cambios (¡incluso los más pequeños son bienvenidos!) utilizando el mismo método que cualquier otro informe de errores.
pt_br: Mudanças na documentação são supervisionadas pela <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de documentação do projeto FreeBSD</link>. Por favor veja o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/index.html">Manual do Projeto de Documentação do FreeBSD</link> para instruções completas. Envie contribuições e mudanças (mesmo as pequenas são bem vindas!) utilizando o mesmo método de qualquer outro relatório de bug.

source: Changes to Existing Source Code
es_es: Cambios en el código fuente ya existente
pt_br: Mudanças no Código Fonte Existente

source: An addition or change to the existing source code is a somewhat trickier affair and depends a lot on how far out of date you are with the current state of FreeBSD development. There is a special on-going release of FreeBSD known as <quote>FreeBSD-CURRENT</quote> which is made available in a variety of ways for the convenience of developers working actively on the system. See <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html">The FreeBSD Handbook</link> for more information about getting and using FreeBSD-CURRENT.
es_es: Añadir o modificar el código fuente existente es un tema delicado y depende en gran medida de lo obsoleto que esté el desarrollo actual de FreeBSD. Hay una release especial de FreeBSD conocida como <quote>FreeBSD-CURRENT</quote> que está disponible de varias formas para mayor comodidad de los desarrolladores que trabajan activamente en el sistema. Consulte el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/current-stable.html">Handbook de FreeBSD</link> para obtener más información sobre cómo obtener y usar FreeBSD-CURRENT.
pt_br: Um acréscimo ou mudança em um código fonte existe é um tema um pouco complicado e depende muito de como você está desatualizado com o estado atual do desenvolvimento do FreeBSD. Existe uma release especial do FreeBSD em andamento conhecida como <quote>FreeBSD-CURRENT</quote> que é disponibilizada de várias maneiras para conveniência dos desenvolvedores que trabalham ativamente no sistema. Veja o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/current-stable.html">Handbook do FreeBSD</link> para mais informação sobre como obter e usar o FreeBSD-CURRENT.

source: Working from older sources unfortunately means that your changes may sometimes be too obsolete or too divergent for easy re-integration into FreeBSD. Chances of this can be minimized somewhat by subscribing to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce">FreeBSD announcements mailing list</link> and the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">FreeBSD-CURRENT mailing list</link> lists, where discussions on the current state of the system take place.
es_es: Por desgracia trabajar con código fuente antiguo significa que a veces sus cambios podrían resultar obsoletos o diferir demasiado para hacer una reintegración en FreeBSD. Esta posibilidad puede minimizarse suscribiéndose a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce">lista de anuncios de FreeBSD</link> y a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">lista de correo FreeBSD-CURRENT</link>, donde tienen lugar los debates sobre el estado actual del sistema.
pt_br: Trabalhar com versões antigas do código, infelizmente, muitas vezes significa que as suas alterações serão demasiadamente obsoletas ou muito divergentes para possibilitar uma fácil re-integração ao FreeBSD. As possibilidades de que isso ocorra podem ser minimizadas um pouco através da sua inscrição na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-announce">lista de distribuição de comunicados oficiais do projeto FreeBSD</link> e na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">lista de discussão do FreeBSD-CURRENT</link>, nas quais as discussões sobre o estado atual do sistema ocorrem.

source: Assuming that you can manage to secure fairly up-to-date sources to base your changes on, the next step is to produce a set of diffs to send to the FreeBSD maintainers. This is done with the <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> command.
es_es: Suponiendo que pueda obtener acceso a una versión lo suficientemente actualizada del código fuente del sistema sobre el que realizar sus cambios, el siguiente paso es generar los diffs para enviar a los maintainers de FreeBSD. Esto se realiza con el comando <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Supondo que você consiga obter acesso à uma versão razoavelmente atualizada do código fonte do sistema para basear as suas alterações, o próximo passo é produzir um conjunto de diffs para enviar aos mantenedores do FreeBSD. Isto é feito com o comando <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: The preferred <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> format for submitting patches is the unified output format generated by <command>diff -u</command>.
es_es: El formato <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> recomendado para enviar parches es el formato de salida unificado generado por el comando <command>diff -u</command>.
pt_br: O formato preferido do <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> para o envio de um patch, é o formato de saída unificada gerado pelo comando <command>diff -u</command>.

source: or
es_es: o
pt_br: ou

source: would generate a set of unified diffs for the given source file or directory hierarchy.
es_es: debería generar un conjunto de diffs unificados para el archivo de origen o la jerarquía de directorios.
pt_br: deverá gerar um conjunto de diffs unificados para o arquivo de origem informado ou para a hierarquia de diretórios.

source: See <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> for more information.
es_es: Consulte el manual de <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> para obtener más información.
pt_br: Consulte o manual do <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> para maiores informações.

source: Once you have a set of diffs (which you may test with the <citerefentry><refentrytitle>patch</refentrytitle><manvolnum>1</manvolnum></citerefentry> command), you should submit them for inclusion with FreeBSD as a bug report. <emphasis>Do not</emphasis> just send the diffs to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">FreeBSD technical discussions mailing list</link> or they will get lost! We greatly appreciate your submission (this is a volunteer project!); because we are busy, we may not be able to address it immediately, but it will remain in the PR database until we do. Indicate your submission by including <literal>[PATCH]</literal> in the synopsis of the report.
es_es: Una vez que tenga el conjunto de diffs (que debería probar con el comando <citerefentry><refentrytitle>patch</refentrytitle><manvolnum>1</manvolnum></citerefentry>), debe enviarlos para que sean incluídos en FreeBSD a través de un informe de error. ¡<emphasis>No envíe</emphasis> los diffs a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">lista de correo de discusiones técnicas de FreeBSD</link> o se perderán! Agradecemos inmensamente su colaboración (¡este es un proyecto voluntario!). Estamos muy ocupados por la gran carga de trabajo, por lo tanto, es posible que no podamos abordarlo de inmediato, pero permanecerán en la base de datos de PR hasta que lo hagamos. Etiquete sus envíos incluyendo <literal>[PATCH]</literal> en la sinopsis del informe.
pt_br: Uma vez que você tenha o conjunto de diffs (os quais você pode testar com o comando <citerefentry><refentrytitle>patch</refentrytitle><manvolnum>1</manvolnum></citerefentry>), você deve submetê-lo para inclusão no FreeBSD por meio de um relatório de bug. Você <emphasis>não</emphasis> deve enviar os diffs para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hackers">lista de discussão de assuntos técnicos do FreeBSD</link> ou eles irão se perder! Agradecemos imensamente a sua submissão (este é um projeto voluntário!); Devido ao alto volume de trabalho, nós podemos não ser capazes de resolvê-lo imediatamente, mas ele permanecerá em nosso banco de dados até que o façamos. Marque a sua submissão incluindo a palavra <literal>[PATCH]</literal> na sinopse do relatório.

source: If you feel it appropriate (e.g. you have added, deleted, or renamed files), bundle your changes into a <command>tar</command> file. Archives created with <citerefentry><refentrytitle>shar</refentrytitle><manvolnum>1</manvolnum></citerefentry> are also welcome.
es_es: Si lo considera oportuno (por ejemplo si ha agregado, eliminado o renombrado archivos) empaquete sus cambios en un archivo <command>tar</command>. También aceptamos los archivos creados con <citerefentry><refentrytitle>shar</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Se você achar adequado (por ex. você adicionou, deletou ou renomeou arquivos), agrupe as suas mudanças em um arquivo <command>tar</command>. Arquivos criados com o <citerefentry><refentrytitle>shar</refentrytitle><manvolnum>1</manvolnum></citerefentry> também são bem vindos.

source: If your change is of a potentially sensitive nature, such as if you are unsure of copyright issues governing its further distribution then you should send it to Core Team <email>core@FreeBSD.org</email> directly rather than submitting as a bug report. The Core Team <email>core@FreeBSD.org</email> reaches a much smaller group of people who do much of the day-to-day work on FreeBSD. Note that this group is also <emphasis>very busy</emphasis> and so you should only send mail to them where it is truly necessary.
es_es: Si sus cambios son delicados, por ejemplo, si no está seguro acerca de los problemas de derechos de autor que regirán su distribución en el futuro, envíelos directamente al Core Team <email>core@FreeBSD.org</email> en lugar de enviarlo como un informe de error. El Core Team <email>core@FreeBSD.org</email> es un grupo mucho más pequeño de gente que se encarga de muchas de las tareas diarias de administración del proyecto FreeBSD. Tenga en cuenta que este grupo también está <emphasis>muy ocupado</emphasis> y, por lo tanto, solo debe enviarles correos cuando realmente sea necesario.
pt_br: Se as suas mudanças são de uma natureza potencialmente sensível, por exemplo, se você não tiver certeza sobre os problemas de direitos autorais que regerão sua distribuição no futuro, envie-as para o Core Team <email>core@FreeBSD.org</email> ao invés de submetê-las por meio de um relatório de bug. O FreeBSD Core Team <email>core@FreeBSD.org</email> é formado por um grupo muito pequeno de pessoas as quais cuidam de muitas das tarefas diárias de administração do projeto FreeBSD. Observe que este grupo também é <emphasis>muito ocupado</emphasis> e portanto você só deve enviar um e-mail para eles se for realmente necessário.

source: Please refer to <citerefentry><refentrytitle>intro</refentrytitle><manvolnum>9</manvolnum></citerefentry> and <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> for some information on coding style. We would appreciate it if you were at least aware of this information before submitting code.
es_es: Consulte los manuales de <citerefentry><refentrytitle>intro</refentrytitle><manvolnum>9</manvolnum></citerefentry> y <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> para obtener más información sobre el estilo de programación requerido. Agradeceríamos que tuviera esa información en cuenta antes de enviar el código.
pt_br: Por favor, consulte os manuais <citerefentry><refentrytitle>intro</refentrytitle><manvolnum>9</manvolnum></citerefentry> e <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> para algumas informações sobre estilo de codificação. Nós apreciaríamos se você estivesse ao menos ciente destas informações antes de submeter o seu código.
