Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/contributing/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: José Ramón Baz jr_baz@hartu.net José Vicente Carrasco carvay@es.FreeBSD.org Sergio Carlavilla carlavilla@FreeBSD.org, 2019,2020
pt_br: Alexandre Vasconcelos, alex.vasconcelos@gmail.com, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018

source: Contributing to FreeBSD
es_es: Contribuir a FreeBSD
pt_br: Contribuindo com o FreeBSD

source: This article describes the different ways in which an individual or organization may contribute to the FreeBSD Project.
es_es: Este artículo describe las diferentes formas en que una persona u organización puede contribuir al proyecto FreeBSD.
pt_br: Este artigo descreve maneiras diferentes sobre como um indivíduo ou organização pode contribuir com o Projeto FreeBSD.

source: <primary>contributing</primary>
pt_br: <primary>contribuindo</primary>

source: So you want to contribute to FreeBSD? That is great! FreeBSD <emphasis>relies</emphasis> on the contributions of its user base to survive. Your contributions are not only appreciated, they are vital to FreeBSD's continued growth.
es_es: ¿Así que quiere contribuir a FreeBSD? ¡Genial! FreeBSD <emphasis>depende</emphasis> de las contribuciones de su base de usuarios para sobrevivir. Sus contribuciones no solo son gratamente apreciadas, son vitales para que FreeBSD continúe creciendo.
pt_br: Então você quer contribuir com o FreeBSD? Isso é ótimo! O FreeBSD <emphasis>depende</emphasis> das contribuições da sua base de usuários para sobreviver. Suas contribuições não são apenas apreciadas, elas são vitais para que o FreeBSD continue crescendo.

source: A large and growing number of international contributors, of greatly varying ages and areas of technical expertise, develop FreeBSD. There is always more work to be done than there are people available to do it, and more help is always appreciated.
es_es: El grupo de desarrolladores de FreeBSD lo componen un grupo grande y siempre creciente de gente de todas partes del mundo, de edades y áreas de experiencia técnica muy diversas. Siempre hay más trabajo pendiente que manos disponibles y siempre se agradece ayuda adicional.
pt_br: Um grande e crescente número de contribuidores internacionais, de uma grande variedade de idade e áreas de conhecimento técnico, desenvolvem o FreeBSD. Sempre existe mais trabalho a ser feito do que pessoas disponíveis para realizá-lo, e mais ajuda é sempre bem vinda.

source: As a volunteer, what you do is limited only by what you want to do. However, we do ask that you are aware of what other members of the FreeBSD community will expect of you. You may want to take this into account before deciding to volunteer.
es_es: El único límite que ponemos a los voluntarios es el que su disponibilidad misma dicte. Por otra parte le pedimos que esté al tanto de lo que otros miembros de la comunidad de FreeBSD esperan de usted. Tener esto en cuenta es importante antes de decidir ser voluntario.
pt_br: Como um voluntário, o que você pode fazer só é limitado pelo que você quer fazer. Entretanto, o que lhe pedimos é que esteja ciente a respeito do que outros membros da comunidade FreeBSD esperará de você. Você pode querer levar isso em consideração antes de decidir se voluntariar.

source: The FreeBSD project is responsible for an entire operating system environment, rather than just a kernel or a few scattered utilities. As such, our <filename>TODO</filename> lists span a very wide range of tasks: from documentation, beta testing and presentation, to the system installer and highly specialized types of kernel development. People of any skill level, in almost any area, can almost certainly help the project.
es_es: El proyecto FreeBSD es responsable de mantener un sistema operativo completo, en lugar de un solo kernel o unas pocas utilidades sueltas. Por lo tanto nuestra lista de tareas pendientes <filename>TODO</filename> incluye una gran variedad de tareas: desde la documentación, realización de pruebas en las versiones beta, hasta el desarrollo del instalador del sistema y tareas de desarrollo del kernel altamente especializadas. Todo el mundo puede ayudar, independientemente del nivel nivel de habilidad, en un área u otra del proyecto.
pt_br: O Projeto FreeBSD é responsável por um ambiente completo de sistema operacional, em vez de apenas um kernel ou alguns utilitários dispersos. Assim sendo, nossa lista <filename>TODO</filename> passa por uma grande variedade de tarefas: da documentação do sistema, testes de versão beta e apresentação, ao instalador do sistema e outros tipos altamente especializados de desenvolvimento do kernel. Pessoas de qualquer nível de conhecimento, em quase qualquer área, quase que certamente poderá ajudar no projeto.

source: Commercial entities engaged in FreeBSD-related enterprises are also encouraged to contact us. Do you need a special extension to make your product work? You will find us receptive to your requests, given that they are not too outlandish. Are you working on a value-added product? Please let us know! We may be able to work cooperatively on some aspect of it. The free software world is challenging many existing assumptions about how software is developed, sold, and maintained, and we urge you to at least give it a second look.
es_es: Invitamos a las empresas que tengan proyectos relacionados con FreeBSD a que se pongan en contacto con nosotros. ¿Necesitan de un desarrollo concreto para hacer que su producto funcione? Estaremos encantados de escuchar sus peticiones, siempre y cuando que no sean demasiado raras. ¿Está trabajando en un producto de alto valor añadido? ¡Por favor, háganoslo saber! Podemos trabajar conjuntamente en algunos aspectos del mismo. El mundo del software libre está desafiando muchas de las suposiciones existentes sobre cómo se desarrolla, vende y mantiene el software y le instamos encarecidamente a que al menos considere seriamente su uso.
pt_br: Entidades comerciais engajadas em iniciativas relacionadas ao FreeBSD também são encorajadas a entrar em contato conosco. Você precisa de uma extensão especial para fazer seu produto funcionar? Você vai nos encontrar receptivos às suas solicitações, considerando que não sejam muito estranhas. Está trabalhando em um produto de valor adicionado? Por favor nos informe! Podemos ser capazes de trabalhar cooperativamente em algum aspecto dele. O mundo do software livre está desafiando muitas premissas sobre como um software é desenvolvido, vendido e mantido, e nós pedimos que você pelo de uma segunda olhada.

source: What Is Needed
es_es: Qué se necesita
pt_br: O que é necessário

source: The following list of tasks and sub-projects represents something of an amalgam of various <filename>TODO</filename> lists and user requests.
es_es: La lista de tareas y subproyectos que se muestra a continuación es una amalgama de varias listas de <filename>TODO</filename> y solicitudes de los usuarios.
pt_br: A lista de tarefas e sub-projetos a seguir representa algo como uma amálgama de várias listas de <filename>TODO</filename> e outras solicitações.

source: Ongoing Non-Programmer Tasks
es_es: Tareas en curso para personas que no son programadores
pt_br: Tarefas em execução por não-programadores

source: Many people who are involved in FreeBSD are not programmers. The Project includes documentation writers, Web designers, and support people. All that these people need to contribute is an investment of time and a willingness to learn.
es_es: Muchas de las personas que están involucradas en FreeBSD no son programadores. El proyecto incluye a escritores de documentación, diseñadores web y personas que dan soporte. Todo lo que estas personas necesitan para contribuir es invertir tiempo y la voluntad de aprender.
pt_br: Muitas pessoas que estão envolvidas com o FreeBSD não são programadores. O Projeto inclui escritores de documentação, Web designers, e pessoas de suporte. Todas estas pessoas contribuem investindo tempo e sua vontade de aprender.

source: Read through the FAQ and Handbook periodically. If anything is poorly explained, ambiguous, out of date or incorrect, let us know. Even better, send us a fix (Docbook is not difficult to learn, but there is no objection to ASCII submissions).
es_es: Lea cada cierto tiempo las FAQ y el Handbook. Si algo está mal explicado, es ambiguo, está desactualizado o es incorrecto, avísenos. Aún mejor, envíenos una solución (Docbook no es difícil de aprender, pero no hay ningún problema si lo envía en ASCII).
pt_br: Leia o FAQ e Handbook periodicamente. Se algo estiver explicado de forma pobre, ambígua, desatualizada ou incorreta, nos comunique. Melhor ainda, envie-nos uma versão ajustada (O formato Docbook não é difícil de aprender, mas não existem objeções em relação ao envio de material no formato ASCII).

source: Help translate FreeBSD documentation into your native language. If documentation already exists for your language, you can help translate additional documents or verify that the translations are up-to-date and correct. First take a look at the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/translations.html">Translations FAQ</link> in the FreeBSD Documentation Project Primer. You are not committing yourself to translating every single FreeBSD document by doing this — as a volunteer, you can do as much or as little translation as you desire. Once someone begins translating, others almost always join the effort. If you only have the time or energy to translate one part of the documentation, please translate the installation instructions.
es_es: Ayude a traducir la documentación de FreeBSD a su lengua materna. Si ya existe documentación en su idioma, puede ayudar a traducir otros documentos o comprobar si las traducciones están actualizadas y son correctas. Antes de nada, consulte las <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/fdp-primer/translations.html">FAQ de las traducciones</link> en el FreeBSD Documentation Project Primer. El hecho de traducir algo no implica la obligación de traducir todo; como voluntario, puede tanto o tan poco como desee. Una vez que alguien empieza a traducir, casi siempre se apunta alguien más. Si solo tiene tiempo o energía para traducir una parte de la documentación, por favor, traduzca las instrucciones de instalación.
pt_br: Ajude a traduzir a documentação do FreeBSD para a sua linguagem nativa. Se a documentação já existe na sua língua, você pode ajudar a traduzir documentos adicionais ou verificar se as traduções estão atualizadas e corretas. Primeiro dê uma olhada no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/translations.html">FAQ de Traduções</link> contido no Manual de Documentação do Projeto FreeBSD. Você não estará se comprometendo a traduzir toda a documentação do FreeBSD fazendo isto - como um voluntário, você pode fazer tantas quantas traduções desejar. Uma vez que alguém começa a traduzir, outros se unem ao esforço. Se você tem tempo ou energia para traduzir apenas uma parte da documentação, por favor traduza as instruções de instalação.

source: Read the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions mailing list</link> occasionally (or even regularly). It can be very satisfying to share your expertise and help people solve their problems; sometimes you may even learn something new yourself! These forums can also be a source of ideas for things to improve upon.
es_es: Lea la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de correo de preguntas generales de FreeBSD</link> de vez en cuando (o regularmente, si es posible). Puede ser muy satisfactorio compartir su experiencia y ayudar a las personas a resolver sus problemas ¡A veces incluso puede aprender algo nuevo! Estos foros también pueden ser una fuente de ideas de cosas que puede ser mejoradas.
pt_br: Leia a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de discussão para perguntas gerais sobre o FreeBSD</link> ocasionalmente (ou regularmente se possível). Pode ser muito recompensador compartilhar a sua experiência e ajudar outras pessoas a resolverem seus problemas; Às vezes você poderá até aprender algo novo! Estes fóruns também podem ser uma fonte de ideias de coisas a serem melhoradas.

source: Ongoing Programmer Tasks
es_es: Tareas en curso para personas que son programadores
pt_br: Tarefas em execução por programadores

source: Most of the tasks listed here may require a considerable investment of time, an in-depth knowledge of the FreeBSD kernel, or both. However, there are also many useful tasks which are suitable for <quote>weekend hackers</quote>.
es_es: La mayoría de las tareas aquí expuestas requieren de una considerable cantidad de tiempo, o un conocimiento profundo del kernel de FreeBSD, o ambas cosas. Sin embargo, también hay muchas tareas útiles que son ideales para <quote>hackers de fin de semana</quote>.
pt_br: A maioria das tarefas listadas aqui requerem um investimento considerável de tempo ou conhecimento profundo do kernel do FreeBSD; ou, ambos. Entretanto, também existem muitas tarefas úteis que são apropriadas para os <quote>hackers de final de semana</quote>.

source: If you run FreeBSD-CURRENT and have a good Internet connection, there is a machine <systemitem class="fqdomainname">current.FreeBSD.org</systemitem> which builds a full release once a day—every now and again, try to install the latest release from it and report any failures in the process.
es_es: Si usa FreeBSD-CURRENT y tiene una buena conexión a Internet, existe una máquina en <systemitem class="fqdomainname">current.FreeBSD.org</systemitem> que genera una release completa una vez al día—de vez en cuando, intente instalar una de estas releases e informe de cualquier problema en el proceso.
pt_br: Se você executa o FreeBSD-CURRENT e possui uma boa conexão com a Internet, existe uma máquina <systemitem class="fqdomainname">current.FreeBSD.org</systemitem> a qual compila uma release completa uma vez por dia - de vez em quando, tente instalar uma destas versões e informe quaisquer problemas no processo.

source: Read the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-bugs">FreeBSD problem reports mailing list</link>. There may be a problem you can comment constructively on or with patches you can test. Or you could even try to fix one of the problems yourself.
es_es: Lea la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-bugs">lista de correo de informes de problemas de FreeBSD</link>. Puede encontrar algún problema sobre el que hacer un comentario constructivo o sobre el que probar parches. O quizás pueda solucionar uno de los problemas usted mismo.
pt_br: Leia a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-bugs">Lista de discussão de relatórios de problemas do FreeBSD</link>. Talvez exista um problema que você possa comentar construtivamente ou existam correções que você possa testar. Ou você pode até consertar um dos problemas por conta própria.

source: If you know of any bug fixes which have been successfully applied to -CURRENT but have not been merged into -STABLE after a decent interval (normally a couple of weeks), send the committer a polite reminder.
es_es: Si sabe de alguna corrección que ha sido aplicada con éxito en -CURRENT y cuya solución no ha sido aplicada aun en -STABLE después de un período de tiempo razonable (normalmente, un par de semanas) envíe, de forma educada, un mensaje al committer responsable del cambio.
pt_br: Se você souber de qualquer problema que tenha sido corrigido com sucesso no -CURRENT e cuja correção não tenha sido aplicada ao -STABLE após um intervalo razoável de tempo (normalmente algumas semanas), envie ao committer um lembrete educado.

source: Move contributed software to <filename>src/contrib</filename> in the source tree.
es_es: Mueva el software de terceros a <filename>src/contrib</filename> en el árbol del código fuente.
pt_br: Mova as contribuições de software para <filename>src/contrib</filename> na árvore do código fonte.

source: Make sure code in <filename>src/contrib</filename> is up to date.
es_es: Asegúrese de que el código de <filename>src/contrib</filename> está actualizado.
pt_br: Tenha certeza que o código disponível em <filename>src/contrib</filename> está atualizado.

source: Build the source tree (or just part of it) with extra warnings enabled and clean up the warnings. A list of build warnings can also be found from our <link xlink:href="https://ci.freebsd.org">CI</link> by selecting a build and checking "LLVM/Clang Warnings".
pt_br: Compile a árvore de código fonte (ou apenas parte dela) com avisos extras ativados e limpe-os depois. Uma lista de avisos de compilação também pode ser encontrada em nosso <link xlink:href="https://ci.freebsd.org">CI</link> selecionando uma compilação e verificando "LLVM/Clang Warnings".

source: Fix warnings for ports which do deprecated things like using <function>gets()</function> or including <filename>malloc.h</filename>.
es_es: Corrija los warnings en los ports que aún utilizan recursos obsoletos como <function>gets()</function> o que incluyan <filename>malloc.h</filename>.
pt_br: Corrija os alertas existentes para os ports que ainda fazem coisas ultrapassadas tais como utilizar <function>gets()</function> ou incluir <filename>malloc.h</filename>.

source: If you have contributed any ports and you had to make FreeBSD-specific changes, send your patches back to the original authors (this will make your life easier when they bring out the next version).
es_es: Si ha contribuido con algún port y tuvo que hacer cambios específicos para FreeBSD, envíe sus parches a los autores originales (esto les hará la vida más fácil cuando lancen la próxima versión).
pt_br: Se você contribuiu com algum dos ports, e teve que fazer alguma mudança específica para o FreeBSD, envie suas correções de volta aos autores originais (isto tornará sua vida mais fácil quando eles lançarem a próxima versão).

source: Get copies of formal standards like <trademark class="registered">POSIX</trademark>. Compare FreeBSD's behavior to that required by the standard. If the behavior differs, particularly in subtle or obscure corners of the specification, send in a PR about it. If you are able, figure out how to fix it and include a patch in the PR. If you think the standard is wrong, ask the standards body to consider the question.
es_es: Hágase con copias de estándares formales como <trademark class="registered">POSIX</trademark>. Compare el comportamiento de FreeBSD con el requerido por el estándar. Si el comportamiento difiere, particularmente en áreas sutiles u oscuras de la especificación, envíenos un PR al respecto. Si puede, averigüe cómo solucionarlo e incluya un parche en el PR. Si cree que el estándar es incorrecto, pídale al organismo de estándares que considere su propuesta.
pt_br: Consiga cópias de padrões formais tais como o <trademark class="registered">POSIX</trademark>. Compare o comportamento do FreeBSD àquele requerido pelo padrão. Se o comportamento diferir, particularmente em pontos sutis ou obscuros da especificação, envie-nos um PR sobre ele. Se você for capaz, descubra como corrigi-lo e inclua um patch em seu PR. Se você acredita que o padrão está errado, peça ao comitê de padrões que considere a pergunta.

source: Suggest further tasks for this list!
es_es: ¡Sugiera nuevas tareas para esta lista!
pt_br: Sugira novas tarefas para esta lista!

source: Work through the PR Database
es_es: Trabaje en la base de datos de PR
pt_br: Trabalhe no banco de dados de PR (relatório de problemas)

source: <primary>problem reports database</primary>
pt_br: <primary>banco de dados de relatórios de problemas</primary>

source: The <link xlink:href="https://bugs.FreeBSD.org/search/">FreeBSD PR list</link> shows all the current active problem reports and requests for enhancement that have been submitted by FreeBSD users. The PR database includes both programmer and non-programmer tasks. Look through the open PRs, and see if anything there takes your interest. Some of these might be very simple tasks that just need an extra pair of eyes to look over them and confirm that the fix in the PR is a good one. Others might be much more complex, or might not even have a fix included at all.
es_es: La <link xlink:href="https://bugs.FreeBSD.org/search/">lista de PR de FreeBSD</link> muestra todos los informes de problemas activos y las solicitudes de mejora que los usuarios de FreeBSD han enviado. La base de datos de PR incluye tanto tareas para programadores como para no programadores. Eche un vistazo a los PR abiertos y mire si alguno de ellos le interesa. Algunos pueden ser tareas muy sencillas que solo necesitan una revisión adicional para confirmar que la solución adjunta al PR es la adecuada. Otros pueden ser mucho más complejos, o incluso no incluir una solución.
pt_br: A <link xlink:href="https://bugs.FreeBSD.org/search/">Lista de PRs do FreeBSD</link> mostra todos os relatórios de problemas ativos no momento e os pedidos de melhoria que foram submetidos pelos usuários do FreeBSD. O banco de dados inclui tarefas para programadores e para não-programadores. Consulte os PRs abertos, e veja se algum deles é de seu interesse. Alguns deles podem ser tarefas muito simples que necessitam apenas que um par extra de olhos olhe para eles e confirme que a correção proposta funciona. Outros podem ser muito mais complexos, ou podem nem ter vindo com uma correção.

source: Start with the PRs that have not been assigned to anyone else. If a PR is assigned to someone else, but it looks like something you can handle, email the person it is assigned to and ask if you can work on it—they might already have a patch ready to be tested, or further ideas that you can discuss with them.
es_es: Comience con los PRs que no han sido asignados a nadie. Si el PR ya ha sido asignado a otra persona, pero cree que puede ayudar, envíe un correo electrónico a la persona que lo tiene asignado y pregúntele si puede colaborar; quizás ya tenga un parche listo para pruebas, o ideas adicionales que proponer.
pt_br: Comece com os PRs que ainda não foram atribuídos a ninguém. Se um PR estiver atribuído a outra pessoa, mas se parecer com algo que você possa cuidar, envie um e-mail para a pessoa encarregada do mesmo e pergunte se você pode trabalhar nele — ele pode já ter um patch pronto para ser testado, ou você pode discutir novas idéias com ele.

source: Ongoing Ports Tasks
es_es: Tareas en curso relacionadas con la colección de ports
pt_br: Tarefas em andamento relacionadas a coleção de Ports

source: The Ports Collection is a perpetual work in progress. We want to provide our users with an easy to use, up to date, high quality repository of third party software. We need people to donate some of their time and effort to help us achieve this goal.
es_es: La colección de ports es un trabajo que está siempre activo. Queremos ofrecer a nuestros usuarios un repositorio de software de terceros fácil de usar, actualizado y de gran calidad. Necesitamos que las personas den parte de su tiempo y esfuerzo para ayudarnos a lograr este objetivo.
pt_br: A coleção de Ports é um trabalho permanente em andamento. Queremos fornecer aos nossos usuários um repositório de software de terceiros fácil de usar, atualizado e de alta qualidade. Precisamos que as pessoas doem parte de seu tempo e esforço para nos ajudar a alcançar esse objetivo.
