Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/contributing/*.po
Languages: es_es, pt_br

source: Just as with updating a port, you should now incorporate changes, review and test, submit your changes in a PR, and provide feedback if required.
es_es: Al igual que con la actualización de un port, ahora debe incorporar los cambios, revisar, probar y enviar sus cambios en eun PR y proporcionar feedback si es necesario.
pt_br: Assim como na atualização de um port, agora você deve incorporar as alterações, revisar, testar e enviar suas alterações em um relatório de problemas (PR) e fornecer feedback, se solicitado.

source: Send patches to upstream authors
es_es: Enviar parches a los autores originales
pt_br: Envie os patches para os autores upstream

source: In some cases, you will have to make patches to the port to make it run on FreeBSD. Some (but not all) upstream authors will accept such patches back into their code for the next release. If so, this may even help their users on other BSD-based systems as well and perhaps save duplicated effort. Please consider sending any applicable patches to the authors as a courtesy.
es_es: En algunos casos necesitará aplicar parches un port para que se ejecute en FreeBSD. Algunos autores originales (aunque no todos) aceptarán incorporar dichos parches en su código en la próxima versión. Si lo hacen esto podría ayudar a los usuarios de otros sistemas BSD y tal vez evitar duplicar esfuerzos. Como cortesía, recomendamos enviar los parches de este tipo a los autores originales.
pt_br: Em alguns casos, você terá que fazer um patch para que um port execute no FreeBSD. Alguns (mas não todos) autores upstream aceitarão incorporar tais patches em seu código na próxima versão. Se eles aceitarem, isto poderá até ajudar os usuários de outros sistemas BSD e talvez evitar um esforço duplicado. Por favor, considere o envio aos autores de quaisquer patches aplicáveis como uma cortesia.

source: Investigate bug reports and PRs related to your port
es_es: Investigue los informes de errores y PRs relacionados con su port
pt_br: Investigue relatórios de bugs e PRs relacionados ao seu port

source: This section is about discovering and fixing bugs.
es_es: Esta sección trata sobre encontrar y corregir errores.
pt_br: Esta seção é sobre como descobrir e corrigir bugs.

source: FreeBSD-specific bugs are generally caused by assumptions about the build and runtime environments that do not apply to FreeBSD. You are less likely to encounter a problem of this type, but it can be more subtle and difficult to diagnose.
es_es: Los errores específicos de FreeBSD son causados generalmente por suposiciones sobre los entornos de compilación y ejecución que no afectan a FreeBSD. Es poco probable que encuentre este tipo de problemas, pero pueden ser sutiles y difíciles de diagnosticar.
pt_br: Bugs específicos do FreeBSD são causados geralmente por suposições sobre os ambientes de compilação e execução que não se aplicam ao FreeBSD. É pouco provável que você encontre um problema desse tipo, mas se encontrar ele poderá ser mais sutil e difícil de diagnosticar.

source: These are the tasks you need to perform to ensure your port continues to work as intended:
es_es: Estas son las tareas que debe realizar para garantizar que su port continúe funcionando según lo previsto:
pt_br: Estas são as tarefas que você precisa executar para garantir que o seu port continuará funcionando como pretendido:

source: Respond to bug reports
es_es: Responda a los informes de errores
pt_br: Responda os relatórios de bugs

source: Bugs may be reported to you through email via the <link xlink:href="https://bugs.FreeBSD.org/search/"> Problem Report database</link>. Bugs may also be reported directly to you by users.
es_es: Los errores le pueden llegar por correo electrónico a través del <link xlink:href="https://bugs.FreeBSD.org/search/"> sistema de informe de problemas</link>. Los usuarios también le pueden informar de los errores directamente.
pt_br: Bugs podem ser reportados para você por e-mail através do <link xlink:href="https://bugs.FreeBSD.org/search/">Sistema de Relatório de Problemas</link>. Os bugs também podem ser reportados diretamente a você pelos usuários.

source: You should respond to PRs and other reports within 14 days, but please try not to take that long. Try to respond as soon as possible, even if it is just to say you need some more time before you can work on the PR.
es_es: Debe responder a los PRs y otros reportes en máximo 14 días, pero trate de no demorarse tanto. Intente responder lo antes posible, incluso si es solo para decir que necesita más tiempo antes de empezar a trabajar en el PR.
pt_br: Você deve responder os PRs (Relatório de Problemas) e outros relatórios dentro de 14 dias, mas por favor, tente não levar tanto tempo. Tente responder o mais rápido possível, mesmo que seja apenas para dizer que você precisa de mais algum tempo antes de poder trabalhar no PR.

source: If you have not responded after 14 days, any committer may commit from a PR that you have not responded to via a <literal>maintainer-timeout</literal>.
es_es: Si no ha respondido después de 14 días, cualquier committer puede realizar el commit de un PR al que no ha respondido utilizando la regla <literal>maintainer-timeout</literal>.
pt_br: Se você não tiver respondido após 14 dias, qualquer committer poderá efetuar o commit de um PR que você não tenha respondido por meio da regra de <literal>maintainer-timeout</literal>.

source: If the person reporting the bug has not also provided a fix, you need to collect the information that will allow you to generate one.
es_es: Si la persona que informó del error no ha proporcionado una solución es su obligación recopilar la suficiente información para proporcionar una.
pt_br: Se a pessoa que reportou o bug não tiver fornecido uma correção, você precisará coletar as informações que permitirão gerar uma.

source: If the bug is reproducible, you can collect most of the required information yourself. If not, ask the person who reported the bug to collect the information for you, such as:
es_es: Si puede reproducir el error podrá recoger la mayor parte de la información que necesita. Si esto no es posible solicite a la persona que reportó el error que le proporcione la siguiente información:
pt_br: Se o bug for reproduzível, você poderá coletar a maior parte das informações necessárias você mesmo. Caso contrário, peça à pessoa que relatou o bug para coletar as informações para você, tais como:

source: A detailed description of their actions, expected program behavior and actual behavior
es_es: Una descripción detallada de sus acciones, comportamiento esperado del programa y comportamiento real.
pt_br: Uma descrição detalhada das suas ações, comportamento esperado e comportamento real do aplicativo

source: Copies of input data used to trigger the bug
es_es: Una copia de los datos de entrada que producen el error
pt_br: Cópias dos dados de entrada usados para acionar o bug

source: Information about their build and execution environment — for example, a list of installed packages and the output of <citerefentry><refentrytitle>env</refentrytitle><manvolnum>1</manvolnum></citerefentry>
es_es: Información sobre su entorno de compilación y ejecución, por ejemplo, una lista de los paquetes instalados y la salida del comando <citerefentry><refentrytitle>env</refentrytitle><manvolnum>1</manvolnum></citerefentry>
pt_br: Informações sobre seu ambiente de compilação e execução - por exemplo, uma lista de pacotes instalados e a saída de <citerefentry><refentrytitle>env</refentrytitle><manvolnum>1</manvolnum></citerefentry>

source: Eliminate incorrect reports
es_es: Eliminar informes incorrectos
pt_br: Elimine os relatórios incorretos

source: Some bug reports may be incorrect. For example, the user may have simply misused the program; or their installed packages may be out of date and require updating. Sometimes a reported bug is not specific to FreeBSD. In this case report the bug to the upstream developers. If the bug is within your capabilities to fix, you can also patch the port so that the fix is applied before the next upstream release.
es_es: Algunos informes de errores pueden ser incorrectos. Por ejemplo el usuario podría simplemente haber usado mal el programa, o los paquetes que tiene instalados pueden estar desactualizados y necesitan actualizarse. Algunas veces un error reportado no es específico de FreeBSD. En este caso informe del error a los desarrolladores originales del software. Si puede corregir el error también puede aplicar el parche al port para que se aplique antes de la próxima versión original.
pt_br: Alguns relatórios de erros podem estar incorretos. Por exemplo, o usuário pode ter simplesmente usado de forma errada o programa; ou seus pacotes instalados podem estar desatualizados e precisam ser atualizados. Às vezes, um bug relatado não é específico do FreeBSD. Neste caso relate o bug para os desenvolvedores upstream. Se você for capaz de corrigir o bug, você também poderá criar um patch do port para que a correção seja aplicada antes da próxima versão do upstream.

source: Find a solution
es_es: Encontrar una solución
pt_br: Encontre uma solução

source: As with build errors, you will need to sort out a fix to the problem. Again, remember to ask if you are stuck!
es_es: Al igual que sucede con los errores de compilación su tarea es encontrar una solución para el problema. Una vez más, tenga presente que si se atasca puede (y debe) pedir ayuda.
pt_br: Tal como acontece com erros de compilação, você precisará encontrar uma correção para o problema. Mais uma vez, lembre-se de perguntar se você estiver emperrado!

source: Submit or approve changes
es_es: Enviar o aprobar cambios
pt_br: Envie ou aprove alterações

source: Just as with updating a port, you should now incorporate changes, review and test, and submit your changes in a PR (or send a follow-up if a PR already exists for the problem). If another user has submitted changes in the PR, you can also send a follow-up saying whether or not you approve the changes.
es_es: Al igual que sucede con la actualización de un port debe incorporar los cambios, revisar, probar y enviar sus cambios en un PR (o hacer un seguimiento si ya existe un PR para el problema). Si otro usuario ha enviado cambios en el PR también puede enviar un seguimiento diciendo si aprueba o no los cambios.
pt_br: Assim como na atualização de um port, agora você deve incorporar alterações, revisar, testar e enviar suas alterações em um PR (ou enviar um follow-up se já existir um PR para o problema). Se outro usuário tiver enviado alterações no PR, você também poderá enviar um follow-up dizendo se aprova ou não as alterações.

source: Providing support
es_es: Proporcionar ayuda
pt_br: Forneça Suporte

source: Part of being a maintainer is providing support — not for the software in general — but for the port and any FreeBSD-specific quirks and problems. Users may contact you with questions, suggestions, problems and patches. Most of the time their correspondence will be specific to FreeBSD.
es_es: Parte de las funciones de un maintainer es proporcionar soporte, no para el software en general sino para el port y las peculiaridades y problemas específicos de FreeBSD. Los usuarios pueden contactarle con preguntas, sugerencias, problemas y parches. La mayoría de las veces serán para asuntos específicos de FreeBSD.
pt_br: Parte de ser um mantenedor é prover suporte - não para o software em geral - mas para o port e quaisquer peculiaridades e problemas específicos dele no FreeBSD. Os usuários podem entrar em contato com dúvidas, sugestões, problemas e patches. Na maioria das vezes, sua correspondência será específica para o FreeBSD.

source: Occasionally you may have to invoke your skills in diplomacy, and kindly point users seeking general support to the appropriate resources. Less frequently you will encounter a person asking why the <literal>RPM</literal>s are not up to date or how can they get the software to run under Foo Linux. Take the opportunity to tell them that your port is up to date (if it is, of course!), and suggest that they try FreeBSD.
es_es: Puede que ocasionalmente tenga que usar sus habilidades diplomáticas y dirigir amablemente a los usuarios que buscan asistencia técnica hacia los recursos apropiados. Alguna que otra vez se encontrará con que alguien le preguntará que por qué los <literal>RPM</literal>s no están actualizados o qué hay que hacer para ejecutar tal software en tal o cual distribución de Linux. Aproveche la oportunidad para decirle que su port está actualizado (si ese es el caso, claro). Y sugiérale que pruebe FreeBSD.
pt_br: Ocasionalmente, você pode ter que invocar suas habilidades diplomáticas, e gentilmente, direcionar os usuários que buscam suporte genérico para os recursos apropriados. Com menos frequência você encontrará uma pessoa perguntando por que os <literal>RPM</literal>s não estão atualizados ou como eles podem fazer o software rodar sob o Foo Linux. Aproveite a oportunidade para dizer a eles que o seu port está atualizado (se estiver, é claro!) e sugira que eles experimentem o FreeBSD.

source: Sometimes users and developers will decide that you are a busy person whose time is valuable and do some of the work for you. For example, they might:
es_es: A veces, los usuarios y desarrolladores decidirán que usted es una persona icupada cuyo tiempo es valioso y harán parte del trabajo por usted. Por ejemplo, podrían:
pt_br: Às vezes, os usuários e os desenvolvedores podem decidir que você é uma pessoa ocupada cujo tempo é valioso e farão parte do trabalho para você. Por exemplo, eles podem:

source: submit a PR or send you patches to update your port,
es_es: enviar un PR o enviarle parches para actualizar su port
pt_br: enviar um PR ou lhe enviar patches para atualizar o seu port,

source: investigate and perhaps provide a fix to a PR, or
es_es: investigar y tal vez proporcionar una solución a un PR o
pt_br: investigar e talvez fornecer uma correção para um PR, ou

source: otherwise submit changes to your port.
es_es: incluso enviar cambios para su port.
pt_br: caso contrário, enviar alterações para o seu port.

source: In these cases your main obligation is to respond in a timely manner. Again, the timeout for non-responsive maintainers is 14 days. After this period changes may be committed unapproved. They have taken the trouble to do this for you; so please try to at least respond promptly. Then review, approve, modify or discuss their changes with them as soon as possible.
es_es: En estos casos su obligación principal es responder rápidamente. Una vez más, el tiempo de espera para los maintainers es de 14 días. Después de este período se puede realizar el commit sin aprobación. Se han tomado la molestia de hacerlo por usted, así que por lo menos intente responder lo más rápido posible. Hecho esto, revise, apruebe, modifique o discuta los cambios con ellos lo antes posible.
pt_br: Nestes casos, a sua principal obrigação é responder rapidamente. Mais uma vez, o tempo limite para mantenedores não responsivos é de 14 dias. Após esse período, as alterações podem ser aceitas mesmo sem terem sido aprovadas. Eles se deram ao trabalho de fazer isso por você; por favor, tente pelo menos responder prontamente. Em seguida, revise, aprove, modifique ou discuta as alterações com eles o mais rápido possível.

source: If you can make them feel that their contribution is appreciated (and it should be) you will have a better chance persuading them to do more things for you in the future :-).
es_es: Si puede hacerles saber que su contribución no cae en saco roto (y así debería ser) será posible que le ayuden en otras ocasiones más adelante :-).
pt_br: Se você puder fazê-los sentir que a contribuição deles é apreciada (e deveria ser), você terá uma chance maior de persuadi-los a fazer mais coisas para você no futuro :-).

source: Finding and fixing a broken port
es_es: Encontrar y arreglar un port roto
pt_br: Encontre e conserte um port quebrado

source: There are two really good places to find a port that needs some attention.
es_es: Hay dos lugares realmente buenos para encontrar un port que necesite atención.
pt_br: Existem dois lugares realmente bons para se encontrar um port que precisa de alguma atenção.

source: You can use the <link xlink:href="https://bugs.freebsd.org/search">web interface</link> to the Problem Report database to search through and view unresolved PRs. The majority of ports PRs are updates, but with a little searching and skimming over synopses you should be able to find something interesting to work on (the <literal>sw-bug</literal> class is a good place to start).
es_es: Puede usar la <link xlink:href="https://bugs.freebsd.org/search">interfaz web</link> de la base de datos de informes de problemas para buscar PRs que no están resueltos. La mayoría de los PRs relacionados con ports son actualizaciones, pero con un poco de investigación y hojeando las sinopsis debería encontrar algo interesante en lo que trabajar (la clase <literal>sw-bug</literal> es un buen lugar para empezar).
pt_br: Você pode usar a <link xlink:href="https://bugs.freebsd.org/search">interface web</link> do banco de dados dos Relatório de Problemas para pesquisar e visualizar os PRs não resolvidos. A maioria dos PRs relacionados aos ports são atualizações, mas com um pouco de pesquisa e análise das sinopses você deve encontrar algo interessante para trabalhar (a classe <literal>bug-bug</literal> é um bom lugar para começar).

source: The other place is the <link xlink:href="http://portsmon.FreeBSD.org/">FreeBSD Ports Monitoring System</link>. In particular look for unmaintained ports with build errors and ports that are marked <varname>BROKEN</varname>. It is OK to send changes for a maintained port as well, but remember to ask the maintainer in case they are already working on the problem.
es_es: El otro sitio es el <link xlink:href="http://portsmon.FreeBSD.org/">FreeBSD Ports Monitoring System</link>. En particular busque ports que no están mantenidos, con errores de compilación y marcados como <varname>BROKEN</varname>. Es totalmente correcto enviar cambios para un port que está mantenido, pero recuerde preguntar al maintainer para así saber si ya están trabajando en el problema.
pt_br: O outro lugar é o <link xlink:href="http://portsmon.FreeBSD.org/">Sistema de Monitoramento de Ports do FreeBSD</link>. Em particular, procure por ports sem mantenedores com erros de compilação e por ports marcados com <varname>BROKEN</varname>. Não existe nenhum problema em também enviar alterações para um port com um mantenedor ativo, mas antes lembre-se de consultar o mantenedor para o caso dele já estar trabalhando no problema.

source: Once you have found a bug or problem, collect information, investigate and fix! If there is an existing PR, follow up to that. Otherwise create a new PR. Your changes will be reviewed and, if everything checks out, committed.
es_es: Una vez que haya encontrado un error o problema recopile información, investigue y arréglelo. Si ya existe un PR haga seguimiento del PR. Si no existe un PR créelo. Sus cambios serán revisados. Si son correctos serán aceptados y se hará el commit.
pt_br: Depois de encontrar um bug ou problema, colete informações, investigue e corrija! Se houver um PR existente, de seguimento a ele. Caso contrário, crie um novo PR. Suas alterações serão analisadas e, se tudo estiver OK, elas serão aceitas e incorporadas.

source: When to call it quits
es_es: Cuándo dejarlo
pt_br: Quando parar

source: As your interests and commitments change, you may find that you no longer have time to continue some (or all) of your ports contributions. That is fine! Please let us know if you are no longer using a port or have otherwise lost time or interest in being a maintainer. In this way we can go ahead and allow other people to try to work on existing problems with the port without waiting for your response. Remember, FreeBSD is a volunteer project, so if maintaining a port is no fun any more, it is probably time to let someone else do it!
es_es: En cualquier caso el Ports Management Team (portmgr) se reserva el derecho a revocar su estatus de maintainer si no ha mantenido activamente su port durante un cierto periodo de tiempo. Actualmente este periodo se establece en 3 meses. Es decir, que transcurran tres meses durante los que haya problemas no resueltos o actualizaciones pendientes que no hayan sido abordadas en tiempo y forma.
pt_br: À medida que seus interesses e compromissos mudam, você pode descobrir que não tem mais tempo para continuar com algumas (ou todas) as suas contribuições para a coleção de ports. Tudo bem! Por favor, nos avise se você não estiver mais usando um port ou se não tiver mais tempo ou interesse em ser um mantenedor. Desta forma, podemos seguir em frente e permitir que outras pessoas tentem trabalhar nos problemas existentes com o port sem termos que esperar por sua resposta. Lembre-se, o FreeBSD é um projeto voluntário, então se a manutenção de um port não for mais divertida, provavelmente é hora de deixar alguém fazer isso!

source: In any case, the Ports Management Team (<literal>portmgr</literal>) reserves the right to reset your maintainership if you have not actively maintained your port in some time. (Currently, this is set to 3 months.) By this, we mean that there are unresolved problems or pending updates that have not been worked on during that time.
es_es: En cualquier caso, el Ports Management Team (<literal>portmgr</literal>) se reserva el derecho a revocar su estatus de maintainer si no ha mantenido activamente su port durante un cierto periodo de tiempo. (Actualmente, este periodo se establece en 3 meses). Con esto, queremos decir que haya problemas no resueltos o actualizaciones pendientes que no hayan sido abordadas durante este periodo.
pt_br: De qualquer forma, a Equipe de Gerenciamento da Coleção de Ports (<literal>portmgr</literal>) reserva-se o direito de redefinir o seu status de mantenedor se você não tiver mantido ativamente o seu port durante um determinado período de tempo. (Atualmente, este período é definido como 3 meses.) Com isso, queremos dizer que existem problemas não resolvidos ou atualizações pendentes que não foram tratadas por você durante esse período.

source: Resources for ports maintainers and contributors
es_es: Recursos para maintainers y colaboradores de los ports
pt_br: Recursos para mantenedores de ports e contribuidores

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link> is your hitchhiker's guide to the ports system. Keep it handy!
es_es: El <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/porters-handbook">Handbook del Porter</link> es su guía de referencia para el sistema de ports. ¡Tengala a mano!
pt_br: O <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link> é o seu Guia de Mochileiro para o sistema de ports. Mantenha-o à mão!
