Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/contributing/*.po
Languages: es_es, pt_br

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports">Writing FreeBSD Problem Reports</link> describes how to best formulate and submit a PR. In 2005 more than eleven thousand ports PRs were submitted! Following this article will greatly assist us in reducing the time needed to handle your PRs.
es_es: El artículo <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/problem-reports">Cómo enviar informes de problemas de FreeBSD</link> describe la mejor forma de formular y enviar un PR. ¡En 2005, se enviaron más de once mil PR relacionados con los ports! Seguir este artículo nos ayudará enormemente a reducir el tiempo necesario para lidiar con sus PRs.
pt_br: O artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports">Escrevendo um relatório de problemas para o FreeBSD</link> descreve como melhor formular e enviar um PR. Em 2005, foram submetidos mais de onze mil relatórios de problemas relacionados aos ports! Ao seguir as boas práticas descritas neste artigo você nos ajudará a reduzir em muito o tempo necessário para lidar com seus PRs.

source: The <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi"> Problem Report database</link>.
es_es: La <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">base de datos de informes de problemas</link>.
pt_br: O <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">Banco de dados de problemas reportados</link>.

source: The <link xlink:href="http://portsmon.FreeBSD.org/">FreeBSD Ports Monitoring System</link> can show you cross-referenced information about ports such as build errors and problem reports. If you are a maintainer you can use it to check on the build status of your ports. As a contributor you can use it to find broken and unmaintained ports that need to be fixed.
es_es: El <link xlink:href="http://portsmon.FreeBSD.org/">FreeBSD Ports Monitoring System</link> puede mostrarle información con referencias cruzadas sobre los ports, como errores de compilación e informes de problemas. Si es un maintainer, puede usarlo para verificar el estado de la compilación de sus ports. Como colaborador, puede usarlo para encontrar ports rotos y sin mantenimiento que deban ser reparados.
pt_br: O <link xlink:href="http://portsmon.FreeBSD.org/">Sistema de Monitoramento de Ports do FreeBSD</link> pode mostrar informações cruzadas sobre os ports, tais como erros de compilação e relatórios de problemas. Se você é um mantenedor, você pode usá-lo para verificar o status de compilação dos seus ports. Como colaborador, você pode usá-lo para encontrar ports quebrados e ports sem um mantenedor ativo que precisam ser consertados.

source: The <link xlink:href="http://portscout.FreeBSD.org">FreeBSD Ports distfile scanner</link> can show you ports for which the distfiles are not fetchable. You can check on your own ports or use it to find ports that need their <varname>MASTER_SITES</varname> updated.
es_es: El <link xlink:href="http://portscout.FreeBSD.org">FreeBSD Ports distfile scanner</link> puede mostrarle los ports para los cuales los archivos distfiles no están disponibles. Puede usarlo para verificar sus propios ports o para encontrar ports que necesiten actualizar sus <varname>MASTER_SITES</varname>.
pt_br: O <link xlink:href="http://portscout.FreeBSD.org">scanner de arquivos distfile</link> da coleção de ports do FreeBSD pode lhe mostrar os ports para os quais os arquivos distfiles não estão disponíveis. Você pode utilizá-lo para verificar seus próprios ports ou para encontrar ports que precisam ter seu <varname>MASTER_SITES</varname> atualizado.

source: <package>ports-mgmt/poudriere</package> is the most thorough way to test a port through the entire cycle of installation, packaging, and deinstallation. Documentation is located at the <link xlink:href="https://github.com/freebsd/poudriere"> poudriere github repository</link>
es_es: <package>ports-mgmt/poudriere</package> es la forma más completa de probar un port a través de todo el ciclo de instalación, empaquetado y desinstalación. La documentación se encuentra en el repositorio de <link xlink:href="https://github.com/freebsd/poudriere">poudriere en github</link>.
pt_br: O uso do <package>ports-mgmt/poudriere</package> é a maneira mais completa de testar um port durante todo o ciclo de instalação, empacotamento e desinstalação. A documentação está localizada no <link xlink:href="https://github.com/freebsd/poudriere">Repositório do poudriere no github</link>

source: <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> is an application which can be used to verify that your port conforms to many important stylistic and functional guidelines. <application>portlint</application> is a simple heuristic application, so you should use it <emphasis>only as a guide</emphasis>. If <application>portlint</application> suggests changes which seem unreasonable, consult the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link> or ask for advice.
es_es: <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> es una aplicación que permite verificar que su port cumple con muchas pautas importantes de estilo y funcionamiento. <application>portlint</application> es una aplicación heurística simple, por lo que <emphasis>solo debe utilizarla como guía</emphasis>. Si <application>portlint</application> sugiere cambios que parecen no tener sentido, consulte el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/porters-handbook">Handbook del Porter</link> o pida consejo.
pt_br: O <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> é uma aplicação que pode ser utilizada para verificar se o seu port está em conformidade com muitas diretrizes importantes de estilo e função. O <application>portlint</application> é um aplicativo heurístico simples, portanto você deve usá-lo <emphasis>apenas como um guia</emphasis>. Se o <application>portlint</application> sugerir alterações que não sejam razoáveis, consulte o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link> ou peça conselhos.

source: The <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link> is for general ports-related discussion. It is a good place to ask for help. You can <link xlink:href="https://lists.freebsd.org/mailman/listinfo">subscribe, or read and search the list archives</link>. Reading the archives of the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports-bugs">FreeBSD ports bugs mailing list</link> and the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-head">SVN commit messages for the ports tree for head/</link> may also be of interest.
es_es: La <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">lista de correo de ports de FreeBSD</link> está destinada a discusiones generales relacionadas con los ports. Es un buen lugar para pedir ayuda. Puede <link xlink:href="https://lists.freebsd.org/mailman/listinfo">suscribirse, leer y buscar en los archivos historicos de la lista</link>. También puede ser de su interés leer los archivos de la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports-bugs">lista de correo de errores en los ports de FreeBSD</link> y los <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-head">mensajes de commit en el árbol del código fuente de los ports de la rama head/</link>.
pt_br: A <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">Lista de discussão de ports do FreeBSD </link> é destinada para discussões gerais relacionadas aos ports. É um bom lugar para pedir ajuda. Você pode se <link xlink:href="https://lists.freebsd.org/mailman/listinfo">inscrever, ler e pesquisar os arquivos da lista</link>. Ler os arquivos da <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports-bugs">Lista de discussão sobre bugs dos ports do FreeBSD</link> e as <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-head">mensagens de commit no SVN da árvore de ports para head/</link> também pode ser interessante.

source: Getting Started in Other Areas
es_es: Empezar en otras áreas
pt_br: Começando em outras áreas

source: Looking for something interesting to get started that is not mentioned elsewhere in this article? The FreeBSD Project has several Wiki pages containing areas within which new contributors can get ideas on how to get started.
pt_br: Procurando por algo interessante para começar, e que não foi mencionado em outras partes deste artigo? O Projeto FreeBSD tem várias páginas Wiki contendo áreas nas quais novos colaboradores podem ter ideias sobre como começar.

source: The <link xlink:href="https://wiki.freebsd.org/JuniorJobs">Junior Jobs</link> page has a list of projects that might be of interest to people just getting started in FreeBSD, and want to work on interesting things to get their feet wet.
es_es: La página <link xlink:href="https://wiki.freebsd.org/JuniorJobs">Junior Jobs</link> tiene una lista de proyectos que pueden ser de interés para las personas que acaban de empezar a usar FreeBSD y desean trabajar en cosas interesantes por primera vez.
pt_br: A página <link xlink:href="https://wiki.freebsd.org/JuniorJobs">Júnior Jobs</link> tem uma lista de projetos que podem ser de interesse para pessoas que estão apenas começando no FreeBSD, e querem trabalhar em coisas interessantes para molhar os pés.

source: The <link xlink:href="https://wiki.freebsd.org/IdeasPage">Ideas Page</link> contains various "nice to have" or "interesting" things to work on in the Project.
es_es: La <link xlink:href="https://wiki.freebsd.org/IdeasPage">Ideas Page</link> contiene propuestas sobre cosas que "sería bueno tener" o son "interesantes" para trabajar en el proyecto.
pt_br: A <link xlink:href="https://wiki.freebsd.org/IdeasPage">Página de Idéias</link> contém várias coisas "legais" ou "interessantes" para se trabalhar no Projeto.

source: $FreeBSD: head/en_US.ISO8859-1/articles/contributing/article.xml 52764 2019-01-13 11:00:21Z bcr $
es_es: $FreeBSD$

source: Build the source tree (or just part of it) with extra warnings enabled and clean up the warnings.
es_es: Compile el árbol del código fuente (o solo una parte del mismo) con un nivel de depuración adicional habilitado y corrija los warnings.

source: Anyone can get involved, and there are lots of different ways to do so. Contributing to ports is an excellent way to help <quote>give back</quote> something to the project. Whether you are looking for an ongoing role, or a fun challenge for a rainy day, we would love to have your help!
es_es: Cualquiera puede participar y hay muchas formas diferentes de hacerlo. Contribuir a la colección de ports es una forma excelente de <quote>devolver</quote> algo al proyecto. Si está buscando un trabajo para realizar de forma contínua o un desafío divertido para un día lluvioso estaríamos encantados de que nos ayude.

source: <prompt>%</prompt> <userinput>diff -u oldfile newfile</userinput>
es_es: <prompt>%</prompt> <userinput>diff -u fichero-antiguo fichero-nuevo</userinput>

source: <prompt>%</prompt> <userinput>diff -u -r -N olddir newdir</userinput>
es_es: <prompt>%</prompt> <userinput>diff -u -r -N directorio-antiguo directorio-nuevo</userinput>

source: The FreeBSD Foundation is a non-profit, tax-exempt foundation established to further the goals of the FreeBSD Project. As a 501(c)3 entity, the Foundation is generally exempt from US federal income tax as well as Colorado State income tax. Donations to a tax-exempt entity are often deductible from taxable federal income.
es_es: La FreeBSD Foundation es una fundación sin ánimo de lucro, libre de impuestos, creada para impulsar los objetivos del proyecto FreeBSD. Como entidad 501(c)3, la FreeBSD Foundation está exenta del impuesto federal de la renta de los EEUU así como del Estado de Colorado. Las donaciones a una entidad exenta de impuestos suelen ser deducibles (en los EEUU).

source: The FreeBSD Foundation is now able to accept donations through the web with PayPal. To place a donation, please visit the Foundation <link xlink:href="https://www.freebsdfoundation.org">web site</link>.
es_es: La FreeBSD Foundation también puede aceptar donaciones via web mediante PayPal. Para hacer una donación, visite la <link xlink:href="https://www.freebsdfoundation.org">página web</link>. de la FreeBSD Foundation.

source: Looking for something interesting to get started that is not mentioned elsewhere in this article? The FreeBSD Project has several Wiki pages containing areas within which new contributors can get ideas on how to get started.
es_es: ¿Busca algo interesante para empezar que no haya sido mencionado en el artículo? El proyecto FreeBSD tiene varias páginas en la wiki que contienen áreas dentro de las cuales las nuevas personas que tengan interes en contribuir pueden obtener ideas sobre cómo empezar.
