Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/contributing/*.po
Languages: es_es, pt_br

source: FreeBSD is under constant development. Changes to software, libraries, the kernel or even policy changes can cause flow-on change requirements to ports.
es_es: FreeBSD está en constante desarrollo. Los cambios en el software, en las bibliotecas, en el kernel o incluso los cambios en las políticas pueden hacer necesarios ciertos de cambios en los ports.
pt_br: O FreeBSD está em constante desenvolvimento. Mudanças no software, bibliotecas, kernel ou até mesmo mudanças de políticas podem resultar em necessidade de mudança nos ports.

source: Maintainer responsibilities
es_es: Responsabilidades del maintainer
pt_br: Responsabilidades do mantenedor

source: Keep your ports up to date
es_es: Mantenga sus ports actualizados
pt_br: Manter seus ports atualizados

source: This section outlines the process to follow to keep your ports up to date.
es_es: Esta sección describe el proceso a seguir para mantener sus ports actualizados.
pt_br: Esta seção descreve o processo a ser seguido para manter seus ports atualizados.

source: This is an overview. More information about upgrading a port is available in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook"> Porter's Handbook</link>.
es_es: Esto es un resumen. Dispone de más información sobre la actualización de un port en el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/porters-handbook">Handbook del Porter</link>.
pt_br: Esta é uma visão geral. Mais informações sobre a atualização de um port está disponível no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link>.

source: Watch for updates
es_es: Esté atento a las actualizaciones
pt_br: Preste atenção às atualizações

source: Monitor the upstream vendor for new versions, updates and security fixes for the software. Announcement mailing lists or news web pages are useful for doing this. Sometimes users will contact you and ask when your port will be updated. If you are busy with other things or for any reason just cannot update it at the moment, ask if they will help you by submitting an update.
es_es: Monitorice el desarrollo para estar al tanto de nuevas versiones, actualizaciones y correcciones de seguridad. Las listas de correo de anuncios o las páginas web de noticias son útiles para este propósito. En ocasiones los usuarios se pondrán en contacto con usted para preguntarle cuándo se actualizará su port. Si está ocupado con otras cosas o simplemente no puede actualizarlo por alguna razón pregunte al usuario si puede ayudarlo enviándole una actualización.
pt_br: Monitorar os fabricantes upstream em relação a liberação de novas versões, patches e correções de segurança para o software. Listas de discussão de anúncios ou páginas web de noticias sobre o software são úteis para este propósito. Algumas vezes os usuários entrarão em contato com você perguntando quando seu port será atualizado. Se você estiver ocupado com outras atividades ou devido a qualquer outra razão não puder realizar a atualização naquele momento, pergunte se o usuário pode te ajudar enviando uma atualização.

source: You may also receive automated email from the <literal>FreeBSD Ports Version Check</literal> informing you that a newer version of your port's distfile is available. More information about that system (including how to stop future emails) will be provided in the message.
es_es: También puede recibir un correo electrónico automatizado de <literal>FreeBSD Ports Version Check</literal> informándole que ya hay una nueva versión disponible del distfile de su port. En el mensaje se incluirá más información (incluido el cómo dejar de recibir los correos electrónicos en el futuro).
pt_br: Você também pode receber emails automáticos do <literal>Verificador de Versões de Ports do FreeBSD</literal> informando a você que uma nova versão do disftile do seu port está disponível. Mais informações sobre este sistema (incluindo como deixar de receber seus emails no futuro) serão enviadas na mensagem.

source: Incorporate changes
es_es: Incorporar cambios
pt_br: Incorporar mudanças

source: When they become available, incorporate the changes into the port. You need to be able to generate a patch between the original port and your updated port.
es_es: Una vez que estén disponibles incorpore los cambios en el port. Es necesario generar un parche con las diferencias entre el port original y el port actualizado.
pt_br: Quando estiverem disponíves, incorpore as mudanças em seu port. Você precisa ser capaz de gerar um patch entre o port original e o port atualizado.

source: Review and test
es_es: Revisar y probar
pt_br: Revisão e teste

source: Thoroughly review and test your changes:
es_es: Revise y pruebe a fondo sus cambios:
pt_br: Examine cuidadosamente e teste as suas mudanças:

source: Build, install and test your port on as many platforms and architectures as you can. It is common for a port to work on one branch or platform and fail on another.
es_es: Compile, instale y pruebe su port en tantas plataformas y arquitecturas como pueda. Es común que un port funcione en una rama o plataforma y falle en otra.
pt_br: Compile, instale e teste o seu port em todas plataformas e arquiteturas que você puder. É comum um port funcionar em uma branch ou plataforma e falhar em outra.

source: Make sure your port's dependencies are complete. The recommended way of doing this is by installing your own ports <application>tinderbox</application>. See <link linkend="resources">resources</link> for more information.
es_es: Asegúrese de que las dependencias de su port estén completas. La forma recomendada de hacerlo es instalando su propio <application>tinderbox</application> de ports. Tiene más información en la sección de <link linkend="resources">recursos</link>.
pt_br: Certifique-se de que as dependências do seu port estão completas. A maneira recomendada de fazer isso é instalando seu próprio ports <application>tinderbox</application>. Consulte a seção sobre <link linkend="resources">recursos</link> para mais informações.

source: Check that the packing list is up to date. This involves adding in any new files and directories and removing unused entries.
es_es: Compruebe que la lista de componentes del paquete esté actualizada. Esto implica añadir nuevos archivos y directorios, así como eliminar entradas no utilizadas.
pt_br: Verifique se a lista de componentes do pacote está atualizada. Isto envolve adicionar novos arquivos e diretórios , bem como remover as entradas sem uso.

source: Verify your port using <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> as a guide. See <link linkend="resources">resources</link> for important information about using <application>portlint</application>.
es_es: Compruebe su port utilizando <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> como guía. Consulte los <link linkend="resources">recursos</link> para obtener información importante sobre el uso de <application>portlint</application>.
pt_br: Verifique seu port usando o <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> como um guia. Consulte a seção sobre <link linkend="resources">recursos</link> para informações importantes sobre o uso do <application>portlint</application>.

source: Consider whether changes to your port might cause any other ports to break. If this is the case, coordinate the changes with the maintainers of those ports. This is especially important if your update changes the shared library version; in this case, at the very least, the dependent ports will need to get a <varname>PORTREVISION</varname> bump so that they will automatically be upgraded by automated tools such as <application>portmaster</application> or <citerefentry vendor="ports"><refentrytitle>portupgrade</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Tenga presente la posilidad de que los cambios en su port puedan causar que otros ports dejen de funcionar (se rompan). Si este es el caso coordine los cambios con los maintainers de esos ports. Esto cobra especial importancia si su actualización cambia la versión de la librería compartida; en este caso, como mínimo, los ports que dependan del suyo deberán aumentar de versión su <varname>PORTREVISION</varname> para que puedan actualizarse de forma automática con herramientas como <application>portmaster</application> o <citerefentry vendor="ports"><refentrytitle>portupgrade</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Considere se as mudanças no seu port podem fazer com que outros ports tenham problemas. Se este for o caso, coordene as mudanças com os mantenedores destes ports. Isto é especialmente importante se a sua atualização modifica a versão de uma biblioteca compartilhada; neste caso, os ports afetados precisarão obter no mínimo um incremento no seu <varname>PORTREVISION</varname> para que eles possam ser atualizados automaticamente por ferramentas automatizadas como o <application>portmaster</application> ou o <citerefentry vendor="ports"><refentrytitle>portupgrade</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Submit changes
es_es: Enviar los cambios
pt_br: Envie as alterações

source: Send your update by submitting a PR with an explanation of the changes and a patch containing the differences between the original port and the updated one. Please refer to <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports">Writing FreeBSD Problem Reports</link> for information on how to write a really good PR.
es_es: Envíe su actualización enviando un PR con una explicación de los cambios y un parque que contenga las diferencias entre el port original y el actualizado. Consulte el artículo <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/problem-reports">Cómo enviar informes de problemas de FreeBSD</link> para obtener más información sobre como escribir un PR correctamente.
pt_br: Submeta sua atualização enviando um relatório de problema (PR) com uma explicação das alterações e um patch contendo as diferenças entre o port original e a versão atualizada. Por favor, consulte o artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/problem-reports">Escrevendo um Relatório de Problema para o FreeBSD</link> para mais informações sobre como escrever um PR realmente bom.

source: Please do not submit a <citerefentry><refentrytitle>shar</refentrytitle><manvolnum>1</manvolnum></citerefentry> archive of the entire port; instead, use <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> <literal>-ruN</literal>. In this way, committers can much more easily see exactly what changes are being made. The Porter's Handbook section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/port-upgrading.html">Upgrading</link> has more information.
es_es: No envíe un archivo <citerefentry><refentrytitle>shar</refentrytitle><manvolnum>1</manvolnum></citerefentry> de todo el port; en su lugar, utilice el comando <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> <literal>-ruN</literal>. De esta forma, los committers pueden ver más fácilmente de forma exacta qué cambios se están están realizando. Consulte la sección de <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/porters-handbook/port-upgrading.html">actualización</link> del Handbook del Porter para más información.
pt_br: Por favor não submeta um arquivo <citerefentry><refentrytitle>shar</refentrytitle><manvolnum>1</manvolnum></citerefentry> do port inteiro, ao invés disso, utilize o comando <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> <literal>-ruN</literal>. Desta forma, os committers podem ver com mais facilidade exatamente quais alterações estão sendo feitas. Consulte a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/port-upgrading.html">Upgrading</link> do Porter's Handbook para maiores informações.

source: Wait
es_es: Esperar
pt_br: Aguarde

source: At some stage a committer will deal with your PR. It may take minutes, or it may take weeks — so please be patient.
es_es: Llegado el momento un committer se encargará de su PR. Esto puede llevar entre unos minutos y varias semanas, así que tenga paciencia.
pt_br: Em algum momento, um commiter lidará com o seu PR. Isto pode levar alguns minutos ou pode levar semanas - portanto, seja paciente.

source: Give feedback
es_es: Proporcione feedback
pt_br: Dê feedback

source: If a committer finds a problem with your changes, they will most likely refer it back to you. A prompt response will help get your PR committed faster, and is better for maintaining a thread of conversation when trying to resolve any problems.
es_es: Si un committer encuentra algún problema en sus cambios lo más probable es que se los devuelva. Una respuesta rápida ayudará a que se haga más rápido el commit. Es muy importante mantener abierto el canal de comunicación para acelerar la resolución de cualquier problema.
pt_br: Se um committer encontrar um problema nas suas alterações, ele provavelmente o encaminhará de volta para você. Uma resposta rápida a este contato irá ajudá-lo a ter o seu PR resolvido mais rapidamente. É muito importante manter o canal de comunicação aberto para agilizar a resolução de qualquer eventual problema.

source: And Finally
es_es: Y para concluir
pt_br: E finalmente

source: Your changes will be committed and your port will have been updated. The PR will then be closed by the committer. That's it!
es_es: Se hará el commit con sus cambios y el port habrá sido actualizado. Después se cerrará el PR. ¡Eso es todo!
pt_br: As suas alterações serão incorporadas na arvore de código fonte e o seu port será atualizado. O PR então será fechado pelo committer. É isso!

source: Ensure your ports continue to build correctly
es_es: Asegúrese de que sus ports continuan compilando correctamente.
pt_br: Certifique-se de que seus ports continuem a ser compilados corretamente

source: This section is about discovering and fixing problems that stop your ports from building correctly.
es_es: Esta sección trata sobre descubrir y solucionar problemas que impiden que sus ports se compilen correctamente.
pt_br: Esta seção é sobre a descoberta e a solução de problemas que fazem seus ports deixarem de ser compilados corretamente.

source: FreeBSD only guarantees that the Ports Collection works on the <literal>-STABLE</literal> branches. In theory, you should be able to get by with running the latest release of each stable branch (since the ABIs are not supposed to change) but if you can run the branch, that is even better.
es_es: El proyecto FreeBSD solo garantiza que la colección de ports funcione en la rama <literal>-STABLE</literal>. En teoría debería poder ejecutarse la última versión de cada rama estable (ya que se espera que las ABIs no cambien) pero si funciona también en las demás ramas es aun mejor.
pt_br: O projeto FreeBSD garante o funcionamento da coleção de Ports apenas na branch <literal>-STABLE</literal>. Teoricamente, você deve será capaz de garantir o funcionamento do port ao executá-lo na ultima release de cada branch(já que não se espera que as ABIs mudem), mas se você puder executar a branch, será ainda melhor.

source: Since the majority of FreeBSD installations run on PC-compatible machines (what is termed the <literal>i386</literal> architecture), we expect you to keep the port working on that architecture. We prefer that ports also work on the <literal>amd64</literal> architecture running native. It is completely fair to ask for help if you do not have one of these machines.
es_es: Dado que la mayor parte de las instalaciones de FreeBSD se ejecutan en ordenadores comunes (arquitectura <literal>i386</literal>), esperamos que mantenga el port funcionando en esta arquitectura. También preferimos que los ports funcionen de forma nativa en la arquitectura <literal>amd64</literal>. No dude en pedir ayuda si no dispone de una de estas máquinas.
pt_br: Como a maioria das instalações do FreeBSD rodam em máquinas compatíveis com o PC (o que é chamado de arquitetura <literal>i386</literal>), esperamos que você mantenha o port funcionando nesta arquitetura. Nós preferimos que os ports também funcionem de forma nativa na arquitetura <literal>amd64</literal>. É completamente justo pedir ajuda caso você não tenha uma dessas máquinas para fazer seus testes.

source: The usual failure modes for non-<literal>x86</literal> machines are that the original programmers assumed that, for instance, pointers are <literal>int</literal>s, or that a relatively lax older <application>gcc</application> compiler was being used. More and more, application authors are reworking their code to remove these assumptions — but if the author is not actively maintaining their code, you may need to do this yourself.
es_es: Los fallos habituales para ordenadores que no son <literal>x86</literal> se producen porque los programadores originales asumieron que, por ejemplo, los punteros son <literal>int</literal>s, o que se utilizaría una versión mas antigua del compilador <application>gcc</application>. Cada vez más, los autores de las aplicaciones están reescribiendo su código para eliminar estos fallos — pero si el autor no mantiene activamente su código, es posible que deba hacerlo usted mismo.
pt_br: Os padrões usuais nas falhas para máquinas não-<literal>x86</literal> são que os programadores originais assumiram que, por exemplo, os ponteiros são <literal>int</literal>s, ou que um compilador <application>gcc</application> mais antigo seria utilizado. Cada vez mais, os autores de aplicativos estão retrabalhando o código das suas aplicações para remover essas suposições - mas se o autor não estiver mantendo ativamente o código, talvez seja necessário que você mesmo faça isso.

source: These are the tasks you need to perform to ensure your port is able to be built:
es_es: Estas son las tareas que debe realizar para garantizar que su port pueda compilarse:
pt_br: Estas são as tarefas que você precisa executar para garantir que o seu port pode ser compilado:

source: Watch for build failures
es_es: Esté atento a los fallos en la compilación
pt_br: Preste atenção para falhas de compilação

source: Check your mail for mail from <literal>pkg-fallout@FreeBSD.org</literal> and the <link xlink:href="http://portscout.FreeBSD.org">distfiles scanner</link> to see if any of the port which are failing to build are out of date.
es_es: Revise su correo y busque mensajes de <literal>pkg-fallout@FreeBSD.org</literal> y revise el <link xlink:href="http://portscout.FreeBSD.org">distfiles scanner</link> para ver si alguno de los ports que mantiene y que no se está compilando está desactualizado.
pt_br: Confira o seu e-mail e busque por mensagens do <literal>pkg-fallout@FreeBSD.org</literal> e consulte o <link xlink:href="http://portscout.FreeBSD.org">scanner de arquivos distfiles</link> para verificar se algum dos ports que estão falhando na compilação estão desatualizados.

source: Collect information
es_es: Recopile información
pt_br: Colete informação

source: Once you are aware of a problem, collect information to help you fix it. Build errors reported by <literal>pkg-fallout</literal> are accompanied by logs which will show you where the build failed. If the failure was reported to you by a user, ask them to send you information which may help in diagnosing the problem, such as:
es_es: Cuando encuentre algún problema recopile información para ayudar a solucionarlo. Los errores de compilación reportados por <literal>pkg-fallout</literal> incluyen registros que le mostrarán dónde falló la compilación. Si un usuario le informó sobre el fallo pídale que le envíe información que pueda ayudar a identificar el problema, como por ejemplo:
pt_br: Quando você estiver ciente de um problema, colete informações para ajudá-lo a solucioná-lo. Os erros de compilação relatados pelo <literal>pkg-fallout</literal> são acompanhados por logs que mostram onde a compilação falhou. Se a falha foi reportada para você por um usuário, peça para que ele lhe envie informações que possam ajudar no diagnóstico do problema, tais como:

source: Build logs
es_es: Logs de la compilación
pt_br: Logs de compilação

source: The commands and options used to build the port (including options set in <filename>/etc/make.conf</filename>)
es_es: Los comandos y opciones utilizados para compilar el port (incluidas las opciones establecidas en <filename>/etc/make.conf</filename>)
pt_br: Os comandos e opções usados para compilar o port (incluindo opções definidas no <filename>/etc/make.conf</filename>)

source: A list of packages installed on their system as shown by <citerefentry><refentrytitle>pkg-info</refentrytitle><manvolnum>8</manvolnum></citerefentry>
es_es: Un listado de los paquetes instalados en su sistema, por ejemplo la salida del comando <citerefentry><refentrytitle>pkg-info</refentrytitle><manvolnum>8</manvolnum></citerefentry>
pt_br: Uma lista dos pacotes instalados no sistema como mostrado pelo comando <citerefentry><refentrytitle>pkg-info</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The version of FreeBSD they are running as shown by <citerefentry><refentrytitle>uname</refentrytitle><manvolnum>1</manvolnum></citerefentry><command> -a</command>
es_es: La versión de FreeBSD que está ejecutando, es decir, la salida del comando <citerefentry><refentrytitle>uname</refentrytitle><manvolnum>1</manvolnum></citerefentry><command> -a</command>
pt_br: A versão do FreeBSD que ele está executando como mostrado pelo comando <citerefentry><refentrytitle>uname</refentrytitle><manvolnum>1</manvolnum></citerefentry><command> -a</command>

source: When their ports collection was last updated
es_es: Cuándo se actualizó por última vez su colección de ports
pt_br: Quando a coleção de ports dele foi atualizada pela última vez

source: When their ports tree and <filename>INDEX</filename> was last updated
es_es: Cuándo se actualizó por última vez su árbol de ports e <filename>INDEX</filename>
pt_br: Quando a árvore de ports e o arquivo <filename>INDEX</filename> dele foram atualizados pela última vez

source: Investigate and find a solution
es_es: Investigue y encuentre una solución
pt_br: Investigue e encontre uma solução

source: Unfortunately there is no straightforward process to follow to do this. Remember, though: if you are stuck, ask for help! The <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link> is a good place to start, and the upstream developers are often very helpful.
es_es: Lamentablemente no hay un proceso a seguir que sea sencillo. Sin embargo, recuerde que si está atascado puede pedir ayuda. La <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">lista de correo de los ports de FreeBSD</link> es un buen sitio para encontrarla, así como los desarrolladores originales del programa.
pt_br: Infelizmente não existe nenhum processo direto a ser seguido para fazer isso. Porém, lembre-se: se você está emperrado, peça ajuda! A <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">lista de discussão de ports do FreeBSD</link> é um bom lugar para começar, e os desenvolvedores de upstream são frequentemente muito prestativos.
