Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/contributing/*.po
Languages: es_es, pt_br

source: New Code or Major Value-Added Packages
es_es: Código nuevo o paquetes de gran valor añadido
pt_br: Código novo ou pacotes de maior valor agregado

source: In the case of a significant contribution of a large body work, or the addition of an important new feature to FreeBSD, it becomes almost always necessary to either send changes as tar files or upload them to a web or FTP site for other people to access. If you do not have access to a web or FTP site, ask on an appropriate FreeBSD mailing list for someone to host the changes for you.
es_es: En el caso de una contribución significativa o de gran impacto, o si se trata de añadir una nueva característica importante a FreeBSD es necesario enviar los cambios comprimidos en un archivo tar o subirlos a un sitio web o FTP para que otras personas puedan acceder a ellos. Si no tiene acceso a un sitio web o FTP solicitelo en la lista de correo de FreeBSD más adecuada para que alguien busque un sitio para alojar los cambios.
pt_br: No caso de uma contribuição significativa de um trabalho de grande porte, ou a adição de uma nova característica importante ao FreeBSD, torna-se quase sempre necessário que se envie as alterações em um arquivo tar ou então que se faça o upload das mesmas para um servidor WWW ou FTP para que as outras pessoas possam acessá-las. Se você não possui acesso a um servidor WWW ou FTP, pergunte em uma lista de discussão apropriada do FreeBSD se alguém pode hospedar essas alterações para você.

source: When working with large amounts of code, the touchy subject of copyrights also invariably comes up. FreeBSD prefers free software licenses such as BSD or ISC. Copyleft licenses such as GPLv2 are sometimes permitted. The complete listing can be found on the <link xlink:href="@@URL_RELPREFIX@@/internal/software-license.html">core team licensing policy</link> page.
es_es: Cuando se trabaja con grandes cantidades de código, siempre surge el delicado tema del copyright. FreeBSD prefiere licencias de software libre como BSD o ISC. Las licencias de Copyleft como la GPLv2, a veces están permitidas. La lista completa se puede encontrar en la <link xlink:href="@@URL_RELPREFIX@@/internal/software-license.html">página de policita de licencias del core team</link>.
pt_br: Quando se trabalha com grandes quantidades de código, o sensível assunto de direitos autorais invariavelmente vem a tona. O Projeto FreeBSD prefere licenças de software livre tais como BSD ou ISC. Licenças copyleft, como a GPLv2, às vezes são permitidas. A lista completa pode ser encontrada na página sobre a <link xlink:href="@@URL_RELPREFIX@@/internal/software-license.html">política de licenciamento do core team</link>.

source: Money or Hardware
es_es: Dinero o hardware
pt_br: Dinheiro ou Hardware

source: We are always very happy to accept donations to further the cause of the FreeBSD Project and, in a volunteer effort like ours, a little can go a long way! Donations of hardware are also very important to expanding our list of supported peripherals since we generally lack the funds to buy such items ourselves.
es_es: Estamos encantados de aceptar donaciones económicas para ayudar a impulsar el proyecto FreeBSD y, como en cualquier proyecto mantenido por voluntarios, ¡un poco puede significar mucho! También son importantes las donaciones de hardware para poder ampliar nuestra lista de hardware soportado, ya que generalmente no podemos permitirnos comprar estos artículos nosotros mismos.
pt_br: Nós ficamos sempre muito felizes em aceitar doações para agregar a causa do Projeto FreeBSD, em um esforço voluntário como o nosso, um pouco pode significar muito! Doações de hardware também são muito importantes para expandir a nossa lista de periféricos suportados, uma vez que normalmente não temos recursos para comprar estes itens nós mesmos.

source: Donating Funds
es_es: Donar dinero
pt_br: Doando Dinheiro

source: The <link xlink:href="https://www.freebsdfoundation.org">FreeBSD Foundation</link> is a non-profit, tax-exempt foundation established to further the goals of the FreeBSD Project. As a 501(c)3 entity, the Foundation is generally exempt from US federal income tax as well as Colorado State income tax. Donations to a tax-exempt entity are often deductible from taxable federal income.
pt_br: A <link xlink:href="https://www.freebsdfoundation.org">Fundação FreeBSD</link> é uma entidade sem fins lucrativos e isenta de impostos, estabelecida com o objetivo de promover os objetivos do Projeto FreeBSD. Como uma entidade 501(c)3, a fundação é isenta de recolher as taxas do governo federal, bem como as do Estado do Colorado. As doações para uma entidade isenta de impostos são frequentemente dedutíveis dos impostos federais.

source: Donations may be sent in check form to: <_:address-1/>
es_es: Las donaciones pueden enviarse mediante cheque a: <_:address-1/>
pt_br: As doações podem ser enviadas através de cheques para: <_:address-1/>

source: The FreeBSD Foundation is also able to accept <link xlink:href="https://www.freebsdfoundation.org/donate/"> online donations</link> through various payment options.
pt_br: A Fundação FreeBSD também pode aceitar <link xlink:href="https://www.freebsdfoundation.org/donate/">doações online</link> através de várias opções de pagamento.

source: More information about the FreeBSD Foundation can be found in <link xlink:href="https://people.FreeBSD.org/~jdp/foundation/announcement.html">The FreeBSD Foundation -- an Introduction</link>. To contact the Foundation by email, write to <email>info@FreeBSDFoundation.org</email>.
es_es: Puede encontrar más información sobre la FreeBSD Foundation en <link xlink:href="https://people.FreeBSD.org/~jdp/foundation/announcement.html">The FreeBSD Foundation -- an Introduction</link>. Para contactar con la FreeBSD Foundation por correo electrónico, escriba a <email>info@FreeBSDFoundation.org</email>.
pt_br: Maiores informações sobre a Fundação FreeBSD podem ser obtidas no documento <link xlink:href="https://people.FreeBSD.org/~jdp/foundation/announcement.html">A Fundação FreeBSD - Uma introdução</link>. Para contatar a Fundação por e-mail, escreva para <email>info@FreeBSDFoundation.org</email>.

source: Donating Hardware
es_es: Donar hardware
pt_br: Doando Hardware

source: <primary>donations</primary>
pt_br: <primary>doações</primary>

source: The FreeBSD Project happily accepts donations of hardware that it can find good use for. If you are interested in donating hardware, please contact the <link xlink:href="@@URL_RELPREFIX@@/donations/">Donations Liaison Office</link>.
es_es: El proyecto FreeBSD acepta encantado donaciones de hardware que le resulten útiles. Si desea donar componentes de hardware por favor póngase en contacto con la <link xlink:href="@@URL_RELPREFIX@@/donations/">Donations Liaison Office</link>.
pt_br: O projeto FreeBSD aceita alegremente doações de hardware para os quais pode encontrar bom uso. Se você estiver interessado em doar componentes de hardware, por favor contate o <link xlink:href="@@URL_RELPREFIX@@/donations/">Escritório de Relacionamento com Doadores</link>.

source: Contributing to ports
es_es: Contribuyendo a la colección de ports
pt_br: Contribuindo com a coleção de ports

source: Adopting an unmaintained port
es_es: Adoptar un port que no está mantenido
pt_br: Adotando um port não mantido

source: Choosing an unmaintained port
es_es: Elegir un port que no esté mantenido
pt_br: Escolhendo um port não mantido

source: Taking over maintainership of ports that are unmaintained is a great way to get involved. Unmaintained ports are only updated and fixed when somebody volunteers to work on them. There are a large number of unmaintained ports. It is a good idea to start with adopting a port that you use regularly.
es_es: Asumir el mantenimiento de ports que no están matenidos es una forma excelente de involucrarse. Los ports que no están mantenidos solo se actualizan y arreglan cuando alguien se ofrece como voluntario para trabajar en ellos. Hay una gran cantidad de ports sin mantenimiento. Es una buena idea empezar adoptando un port que use de forma regular.
pt_br: Assumir a manutenção de um port sem mantenedor é uma ótima maneira de se envolver. Os ports sem mantenedor só são atualizados e corrigidos quando alguém se oferece para trabalhar neles. Há um grande número de ports não mantidos. É uma boa ideia começar com a adoção de uma port que você usa regularmente.

source: Unmaintained ports have their <varname>MAINTAINER</varname> set to <literal>ports@FreeBSD.org</literal>. A list of unmaintained ports and their current errors and problem reports can be seen at the <link xlink:href="http://portsmon.FreeBSD.org/portsconcordanceformaintainer.py?maintainer=ports%40FreeBSD.org">FreeBSD Ports Monitoring System</link>.
es_es: Los ports que no están mantenidos tiene como <varname>MAINTAINER</varname> asignado <literal>ports@FreeBSD.org</literal>. Puede ver un listado de todos los ports sin mantenimiento, así como sus errores actuales e informes de problemas en el <link xlink:href="http://portsmon.FreeBSD.org/portsconcordanceformaintainer.py?maintainer=ports%40FreeBSD.org">FreeBSD Ports Monitoring System</link>.
pt_br: Os ports sem um responsável tem o seu <varname>MAINTAINER</varname> configurado como <literal>ports@FreeBSD.org</literal>. Uma lista com todos os ports nesta situação, bem como os seus erros atuais e os seus relatórios de problemas pode ser visualizada no <link xlink:href="http://portsmon.FreeBSD.org/portsconcordanceformaintainer.py?maintainer=ports%40FreeBSD.org">Sistema de Monitoração da coleção de ports do FreeBSD</link>.

source: Some ports affect a large number of others due to dependencies and slave port relationships. Generally, we want people to have some experience before they maintain such ports.
es_es: Algunos ports afectan a muchos otros debido a las dependencias y las relaciones con los ports que dependan de ellos. En general, esperamos que las personas tengan algo de experiencia antes de ofrecerse voluntariamente para mantener dichos ports.
pt_br: Alguns ports afetam um grande número de outros devido a dependências e relacionamentos de ports escravos. Geralmente, esperamos que as pessoas tenham alguma experiência antes de se voluntariarem para manter tais ports.

source: You can find out whether or not a port has dependencies or slave ports by looking at a master index of ports called <filename>INDEX</filename>. (The name of the file varies by release of FreeBSD; for instance, <filename>INDEX-8</filename>.) Some ports have conditional dependencies that are not included in a default <filename>INDEX</filename> build. We expect you to be able to recognize such ports by looking through other ports' <filename>Makefile</filename>s.
es_es: Puede comprobar si un port tiene o no dependencias o si otros puertos depende de él consultando el índice maestro de ports, <filename>INDEX</filename>. (El nombre del archivo varía según la versión de FreeBSD; por ejemplo, <filename>INDEX-8</filename>) Algunos ports tienen dependencias condicionales que no están incluidas en la compilación predeterminada de <filename>INDEX</filename>. Esperamos que pueda reconocer dichos ports analizando el archivo <filename>Makefile</filename> de otros ports.
pt_br: Você pode verificar se um port tem ou não dependências ou se outros ports dependem dele consultando o índice mestre de ports chamado <filename>INDEX</filename>. (O nome do arquivo varia de acordo com a versão do FreeBSD; por exemplo, <filename>INDEX-8</filename>.) Alguns ports têm dependências condicionais que não estão incluídas na construção do <filename>INDEX</filename> padrão. Esperamos que você seja capaz de reconhecer estes ports através da analise do arquivo <filename>Makefile</filename> de outros ports.

source: How to adopt the port
es_es: Cómo adoptar un port
pt_br: Como adotar o port

source: First make sure you understand your <link linkend="maintain-port">responsibilities as a maintainer</link>. Also read the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link>. <emphasis>Please do not commit yourself to more than you feel you can comfortably handle.</emphasis>
es_es: Primero, asegúrese de de comprender cuáles serán sus <link linkend="maintain-port">responsabilidades como maintainer</link>. Lea también el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/porters-handbook">Handbook del Porter</link>. <emphasis>Por favor, no se comprometa con más de lo que crea que puede manejar cómodamente.</emphasis>
pt_br: Primeiro, certifique-se de entender quais serão as suas <link linkend="maintain-port">responsabilidades de como mantenedor</link>. Leia também o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link>. <emphasis>Por favor, não se comprometa com mais do que você acha que pode lidar sem se sobrecarregar.</emphasis>

source: You may request maintainership of any unmaintained port as soon as you wish. Simply set <varname>MAINTAINER</varname> to your own email address and send a PR (Problem Report) with the change. If the port has build errors or needs updating, you may wish to include any other changes in the same PR. This will help because many committers are less willing to assign maintainership to someone who does not have a known track record with FreeBSD. Submitting PRs that fix build errors or update ports are the best ways to establish one.
es_es: Puede solicitar el mantenimiento de cualquier port que esté sin mantenimiento cuando lo desee. Simplemente configure el parámetro <varname>MAINTAINER</varname> con su propia dirección de correo electrónico y envíe un PR (informe de problemas) con el cambio. Si el port tiene errores de compilación o necesita actualizarse, es posible que desee aprovechar la oportunidad para incluir cualquier otro cambio que se requiera en ese mismo PR. Esto acelerará el proceso, ya que muchos committers no están dispuestos a asignar la responsabilidad del mantenimiento del port a alguien que no tenga un historial de trabajo con FreeBSD. La mejor forma de crear un historial de trabajo es enviando PRs corrigiendo errores de compilación o actualizando ports.
pt_br: Você pode solicitar para se tornar o responsável pela manutenção de qualquer port que não esteja sendo mantido por outra pessoa assim que desejar. Basta definir o parâmetro <varname>MAINTAINER</varname> para o seu próprio endereço de e-mail e enviar um PR (Relatório de Problemas) com a alteração. Se o port tiver erros de compilação ou precisar de atualização, você pode aproveitar para incluir quaisquer outras alterações que sejam necessárias neste mesmo PR. Isso irá acelerar o processo pois muitos committers não estão dispostos a atribuir a responsabilidade de manutenção de um port para alguém que não tenha um histórico conhecido com o FreeBSD. O envio de PRs (relatórios de problema) para corrigir erros de compilação ou para atualizar um port é a melhor maneira de estabelecer este histórico.

source: File your PR with category <literal>ports</literal> and class <literal>change-request</literal>. A committer will examine your PR, commit the changes, and finally close the PR. Sometimes this process can take a little while (committers are volunteers, too :).
es_es: Envíe su PR a la categoría <literal>ports</literal> y utilice la clase <literal>change-request</literal>. Un committer revisará su PR, commiteara los cambios y finalmente cerrará el PR. En algunas ocasiones, este proceso puede llevar cierto tiempo (los committers también son voluntarios :).
pt_br: Submeta o seu relatório de problema na categoria <literal>ports</literal> e utilize a classe <literal>change-request</literal>. Um committer irá examinar o seu relatório, confirmará as alterações e, por fim, fechará o relatório. Às vezes, esse processo pode demorar um pouco (os committers também são voluntários).

source: The challenge for port maintainers
es_es: El desafío para los maintainers de un port
pt_br: O desafio para os mantenedores de um port

source: This section will give you an idea of why ports need to be maintained and outline the responsibilities of a port maintainer.
es_es: Esta sección le dará una visión general de por qué los ports deben mantenerse y describirá las responsabilidades de un maintainer de port.
pt_br: Esta seção lhe dará uma ideia do motivo pelo qual os ports precisam ser mantidos e descreve as responsabilidades de um mantenedor de ports.

source: Why ports require maintenance
es_es: Por qué los ports requieren mantenimiento
pt_br: Por que os ports requerem manutenção

source: Creating a port is a once-off task. Ensuring that a port is up to date and continues to build and run requires an ongoing maintenance effort. Maintainers are the people who dedicate some of their time to meeting these goals.
es_es: Crear un port es una tarea que se realiza una vez. Pero asegurar que un port esté siempre actualizado y continúe compilandose y ejecutándose correctamente requiere de un esfuerzo de mantenimiento continuo. Los Maintainers son las personas que dedican parte de su tiempo a cumplir estos objetivos.
pt_br: Criar um port é uma tarefa eventual. Mas garantir que um port esteja sempre atualizado e que continue a ser compilado e executado corretamente requer um esforço de manutenção contínuo. Os mantenedores são as pessoas que dedicam parte do seu tempo para atingir esses objetivos.

source: The foremost reason ports need maintenance is to bring the latest and greatest in third party software to the FreeBSD community. An additional challenge is to keep individual ports working within the Ports Collection framework as it evolves.
es_es: La razón principal por la que los ports necesitan mantenimiento es para disponga de las versiones más actualizadas y mejor software de terceros a la comunidad de FreeBSD. Un desafío adicional es mantener los ports para que continuen funcionando dentro del framework de la colección de ports a medida que este evoluciona.
pt_br: O principal motivo pelo qual a coleção de ports precisa de manutenção é o de trazer os mais recentes e o melhores softwares de terceiros para a comunidade FreeBSD. Um desafio adicional é manter os ports individuais funcionando dentro do framework da coleção de ports à medida que ela evolui.

source: As a maintainer, you will need to manage the following challenges:
es_es: Como maintainer deberá enfrentarse a los siguientes desafíos:
pt_br: Como mantenedor, você precisará gerenciar os seguintes desafios:

source: New software versions and updates.
es_es: Nuevas versiones y actualizaciones de software.
pt_br: Novas versões e atualizações de software.

source: New versions and updates of existing ported software become available all the time, and these need to be incorporated into the Ports Collection in order to provide up-to-date software.
es_es: Las nuevas versiones y actualizaciones de software están disponibles todo el tiempo para las aplicaciones que ya han sido portadas, y deben incorporarse a la colección de ports para proporcionar un software actualizado.
pt_br: Novas versões e atualizações de software são disponibilizadas o tempo todo para os aplicativos já convertidos, e elas precisam ser incorporadas à Coleção de Ports a fim de prover software atualizado.

source: Changes to dependencies.
es_es: Cambios en las dependencias.
pt_br: Mudanças nas dependências.

source: If significant changes are made to the dependencies of your port, it may need to be updated so that it will continue to work correctly.
es_es: Si se realizan cambios significativos en las dependencias de su port es posible que deba actualizarlas para que continúe funcionando correctamente.
pt_br: Se forem feitas alterações significativas nas dependências do seu port, talvez seja necessário atualizá-las para que ele continue funcionando corretamente.

source: Changes affecting dependent ports.
es_es: Cambios que afectan a los ports que dependen de los suyos.
pt_br: Mudanças que afetem os ports que dependem do seu.

source: If other ports depend on a port that you maintain, changes to your port may require coordination with other maintainers.
es_es: Si otros ports depende de un port que mantiene, los cambios en su port pueden requerir que se coordine con otros maintainers.
pt_br: Se outros ports dependerem de um port que você mantém, as mudanças no seu port podem requerer um alinhamento prévio com outros mantenedores.

source: Interaction with other users, maintainers and developers.
es_es: Interacción con otros usuarios, maintainers y desarrolladores.
pt_br: Interação com outros usuários, mantenedores e desenvolvedores.

source: Part of being a maintainer is taking on a support role. You are not expected to provide general support (but we welcome it if you choose to do so). What you should provide is a point of coordination for FreeBSD-specific issues regarding your ports.
es_es: Parte de ser maintainer es asumir el rol de proporcionar soporte. No esperamos que de soporte a nivel general (pero aceptaremos gustosos si decide hacerlo). Lo que debe proporcionar es un punto de apoyo para los problemas específicos de FreeBSD que estén relacionados con sus ports.
pt_br: Parte de ser um mantenedor é assumir uma função de suporte. Não existe a expectativa de que você ofereça suporte de uma maneira geral (mas você é bem vindo se quiser fazer isso). O que você deve prover é um ponto de coordenação para as questões específicas do FreeBSD relacionadas aos seus ports.

source: Bug hunting.
es_es: Caza de bugs.
pt_br: Caça aos bugs.

source: A port may be affected by bugs which are specific to FreeBSD. You will need to investigate, find, and fix these bugs when they are reported. Thoroughly testing a port to identify problems before they make their way into the Ports Collection is even better.
es_es: Un port puede verse afectado por errores específicos de FreeBSD. Deberá investigar, encontrar y corregir estos errores cuando sean reportados. Es mucho mejor probar meticulosamente un port para identificar todos sus potenciales problemas antes de añadirlo a la colección de ports.
pt_br: Um port pode ser afetado por bugs específicos do FreeBSD. Você precisará investigar, encontrar e consertar estes bugs quando forem reportados. Testar meticulosamente um port para identificar todos os seus possíveis problemas antes que ele seja adicionado à Coleção de Ports é ainda melhor.

source: Changes to ports infrastructure and policy.
es_es: Cambios en la infraestructura y política de ports.
pt_br: Alterações na infraestrutura e política de ports.

source: Occasionally the systems that are used to build ports and packages are updated or a new recommendation affecting the infrastructure is made. You should be aware of these changes in case your ports are affected and require updating.
es_es: Ocasionalmente, los sistemas que se utilizan para compilar los ports y paquetes se actualizan o se hace una nueva recomendación que afecta a la infraestructura. Debe tener en cuenta estos cambios en caso de que sus ports se vean afectados y requieran de una actualización.
pt_br: Ocasionalmente os sistemas utilizados para construir os ports e pacotes são atualizados ou uma nova recomendação que afeta a infraestrutura é realizada. Você deverá estar atento a estas mudanças caso seus ports sejam afetados e necessitem de atualização.

source: Changes to the base system.
es_es: Cambios en el sistema base.
pt_br: Mudanças no sistema base.
