Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributing/_index.po
Languages: es, pt_br, ru

source: The https://bugs.FreeBSD.org/search/[FreeBSD PR list] shows all the current active problem reports and requests for enhancement that have been submitted by FreeBSD users. The PR database includes both programmer and non-programmer tasks. Look through the open PRs, and see if anything there takes your interest. Some of these might be very simple tasks that just need an extra pair of eyes to look over them and confirm that the fix in the PR is a good one. Others might be much more complex, or might not even have a fix included at all.
es: La https://bugs.FreeBSD.org/search/[lista de PR de FreeBSD] muestra todos los informes de problemas activos y las solicitudes de mejora que los usuarios de FreeBSD han enviado. La base de datos de PR incluye tanto tareas para programadores como para no programadores. Echa un vistazo a los PR abiertos y mire si alguno de ellos le interesa. Algunos pueden ser tareas muy sencillas que solo necesitan una revisión adicional para confirmar que la solución adjunta al PR es la adecuada. Otros pueden ser mucho más complejos, o incluso no incluir una solución.
pt_br: A https://bugs.FreeBSD.org/search/[lista de PRs do FreeBSD] mostra todos os relatórios de problemas ativos e solicitações de aprimoramento que foram enviados pelos usuários do FreeBSD. O banco de dados de PRs inclui tarefas tanto para programadores quanto para não-programadores. Olhe através dos PRs abertos e veja se algo lhe interessa. Alguns desses podem ser tarefas muito simples que só precisam de um par extra de olhos para examiná-los e confirmar que a correção no PR é boa. Outros podem ser muito mais complexos, ou podem nem mesmo ter uma correção incluída.
ru: https://bugs.FreeBSD.org/search/[Список PR FreeBSD] отображает все текущие активные отчёты о проблемах и запросы на улучшение, отправленные пользователями FreeBSD. База данных PR включает как задачи для программистов, так и для непрограммистов. Просмотрите открытые PR и посмотрите, есть ли среди них что-то, что вас заинтересует. Некоторые из них могут быть очень простыми задачами, которым просто нужен свежий взгляд, чтобы проверить и подтвердить, что исправление в PR является хорошим. Другие могут быть гораздо сложнее или даже не содержать исправления вовсе.

source: Start with the PRs that have not been assigned to anyone else. If a PR is assigned to someone else, but it looks like something you can handle, email the person it is assigned to and ask if you can work on it-they might already have a patch ready to be tested, or further ideas that you can discuss with them.
es: Comienza con los PRs que no han sido asignados a nadie. Si el PR ya ha sido asignado a otra persona, pero crees que puedes ayudar, envía un correo electrónico a la persona que lo tiene asignado y pregúntale si puedes colaborar; quizás ya tenga un parche listo para pruebas, o ideas adicionales que proponer.
pt_br: Comece com os PRs que não foram atribuídos a mais ninguém. Se um PR foi atribuído a outra pessoa, mas parece algo que você pode lidar, envie um e-mail para a pessoa a quem foi atribuído e pergunte se você pode trabalhar nele - eles podem já ter um patch pronto para ser testado ou outras ideias que você possa discutir com eles.
ru: Начните с PR, которые никому не назначены. Если PR назначен кому-то другому, но вам кажется, что вы можете с ним справиться, напишите этому человеку на почту и спросите, можно ли вам над ним поработать — возможно, у него уже есть готовый патч для тестирования или дополнительные идеи, которые можно обсудить.

source: Ongoing Ports Tasks
es: Tareas en curso relacionadas con la colección de ports
pt_br: Tarefas contínuas relacionadas a coleção de ports
ru: Текущие задачи портов

source: The Ports Collection is a perpetual work in progress. We want to provide our users with an easy to use, up to date, high quality repository of third party software. We need people to donate some of their time and effort to help us achieve this goal.
es: La colección de ports es un trabajo que está siempre activo. Queremos ofrecer a nuestros usuarios un repositorio de software de terceros fácil de usar, actualizado y de gran calidad. Necesitamos que las personas den parte de su tiempo y esfuerzo para ayudarnos a lograr este objetivo.
pt_br: A coleção de ports é um trabalho contínuo em andamento. Queremos fornecer aos nossos usuários um repositório de software de terceiros fácil de usar, atualizado e de alta qualidade. Precisamos que as pessoas doem parte de seu tempo e esforço para nos ajudar a alcançar esse objetivo.
ru: Коллекция портов — это постоянный процесс. Мы стремимся предоставить нашим пользователям удобный, современный и качественный репозиторий стороннего программного обеспечения. Нам нужны люди, готовые пожертвовать своим временем и усилиями, чтобы помочь нам достичь этой цели.

source: Anyone can get involved, and there are lots of different ways to do so. Contributing to ports is an excellent way to help "give back" something to the project. Whether you are looking for an ongoing role, or a fun challenge for a rainy day, we would love to have your help!
es: Cualquiera puede participar y hay muchas formas diferentes de hacerlo. Contribuir a la colección de ports es una forma excelente de "devolver" algo al proyecto. Si estás buscando un trabajo para realizar de forma continua o un desafío divertido para un día lluvioso ¡estaríamos encantados de que nos ayudes!
pt_br: Qualquer um pode se envolver e há muitas maneiras diferentes de fazer isso. Contribuir para os ports é uma excelente maneira de ajudar a "retribuir" algo ao projeto. Se você está procurando um papel contínuo ou um desafio divertido para um dia chuvoso, adoraríamos ter a sua ajuda!
ru: Вовлечься может любой, и способов для этого множество. Участие в разработке портов — отличный способ "отдать долг" проекту. Будь то поиск постоянной роли или интересный вызов на дождливый день — мы будем рады вашей помощи!

source: There are a number of easy ways you can contribute to keeping the ports tree up to date and in good working order:
es: Existen varias formas de ayudar a mantener la colección de ports actualizada y en buen funcionamiento:
pt_br: Há várias maneiras fáceis de contribuir para manter a árvore de ports atualizada e em bom funcionamento:
ru: Есть несколько простых способов помочь поддерживать дерево портов в актуальном состоянии и в хорошем рабочем порядке:

source: Find some cool or useful software and extref:{porters-handbook}[create a port] for it.
es: Encuentra algún software útil y chulo y extref:{porters-handbook}[crea un port] para él.
pt_br: Encontre algum software legal ou útil e extref:{porters-handbook}[crie um port] para ele.
ru: Найдите интересное или полезное программное обеспечение и extref:{porters-handbook}[создайте порт] для него.

source: There are a large number of ports that have no maintainer. Become a maintainer and <<adopt-port>>.
es: Hay muchos ports que no tienen mantenedor. Conviértete en mantenedor y <<adopt-port>>.
pt_br: Há muitos ports que não têm mantenedor. Torne-se um mantenedor e adote-o (<<adopt-port>>).

source: If you have created or adopted a port, be aware of <<maintain-port>>.
es: Si has creado o adoptado un port, considera <<maintain-port>>.
pt_br: Se você criou ou adotou um port, esteja ciente sobre <<maintain-port>>.

source: When you are looking for a quick challenge you could <<fix-broken>>.
es: Cuando busques un desafío rápido piensa en <<fix-broken>>.
pt_br: Quando você estiver procurando um desafio rápido, <<fix-broken>>.

source: Pick one of the items from the Ideas page
es: Escoge uno de los elementos de la página de ideas
pt_br: Escolha um dos itens da “página de idéias”
ru: Выберите один из пунктов со страницы Идеи

source: The https://wiki.freebsd.org/IdeasPage[FreeBSD list of projects and ideas for volunteers] is also available for people willing to contribute to the FreeBSD project. The list is being regularly updated and contains items for both programmers and non-programmers with information about each project.
es: La https://wiki.freebsd.org/IdeasPage[lista de proyectos e ideas de FreeBSD para voluntarios] también está disponible para las personas que deseen contribuir al proyecto FreeBSD. Esta lista se actualiza regularmente y contiene elementos para programadores y no programadores, así como información sobre cada proyecto.
pt_br: A https://wiki.freebsd.org/IdeasPage[lista de projetos e ideias para voluntários] do FreeBSD também está disponível para pessoas dispostas a contribuir para o projeto FreeBSD. A lista é atualizada regularmente e contém itens para programadores e não-programadores, com informações sobre cada projeto.
ru: https://wiki.freebsd.org/IdeasPage[Список проектов и идей FreeBSD для волонтёров] также доступен для тех, кто хочет внести свой вклад в проект FreeBSD. Список регулярно обновляется и содержит пункты как для программистов, так и для не-программистов, с информацией о каждом проекте.

source: How to Contribute
es: Cómo colaborar
pt_br: Como Contribuir
ru: Как внести свой вклад

source: Contributions to the system generally fall into one or more of the following 5 categories:
es: Las contribuciones al sistema generalmente pueden catalogarse en las siguientes 5 categorías:
pt_br: As contribuições para o sistema geralmente se enquadram em uma ou mais das seguintes 5 categorias:
ru: Вклады в систему обычно относятся к одной или нескольким из следующих 5 категорий:

source: Bug Reports and General Commentary
es: Informes de errores y comentarios generales
pt_br: Relatórios de Bugs e Comentários Gerais
ru: Отчеты об ошибках и общие комментарии

source: An idea or suggestion of _general_ technical interest should be mailed to the {freebsd-hackers}. Likewise, people with an interest in such things (and a tolerance for a _high_ volume of mail!) may subscribe to the {freebsd-hackers}. See extref:{handbook}[The FreeBSD Handbook, eresources-mail] for more information about this and other mailing lists.
es: Una idea o sugerencia técnica de interés _general_ se debería enviar a {freebsd-hackers}. Igualmente, gente con interés en esas cosas (¡y tolerancia para _altos_ volúmenes de correo!) pueden suscribirse a {freebsd-hackers}. Mira See extref:{handbook}[The FreeBSD Handbook, eresources-mail] para más información acerca de ésta y otras listas de correo.
pt_br: Uma ideia ou sugestão de interesse técnico _geral_ deve ser enviada para a {freebsd-hackers}. Da mesma forma, pessoas com interesse nesses assuntos (e tolerância para um volume _alto_ de mensagens!) podem se inscrever na {freebsd-hackers}. Consulte o extref:{handbook}[Handbook do FreeBSD, eresources-mail] para obter mais informações sobre esta e outras listas de e-mail.
ru: Идея или предложение, представляющие _общий_ технический интерес, должны быть отправлены на {freebsd-hackers}. Аналогично, люди, заинтересованные в подобных вещах (и готовые терпеть _высокий_ объем почты!), могут подписаться на {freebsd-hackers}. Дополнительную информацию об этом и других списках рассылки см. в extref:{handbook}[The FreeBSD Handbook, eresources-mail].

source: If you are submitting a simple patch to the src repo, please consider submitting it to the project's GitHub mirror as https://github.com/freebsd/freebsd-src/pulls[a pull request]. Suitable submissions should:
es: Si estás enviando un parche sencillo al repositorio de src, por favor considera enviarlo a la réplica en el GitHub del proyecto en https://github.com/freebsd/freebsd-src/pulls[a pull request]. Un envío aceptable sería:
pt_br: Se você está enviando um patch simples para o repositório src, considere enviar um https://github.com/freebsd/freebsd-src/pulls[pull request] para o espelho do projeto no GitHub. Envios adequados devem:
ru: Если вы отправляете простой патч в репозиторий src, рассмотрите возможность отправить его в зеркало проекта на GitHub как https://github.com/freebsd/freebsd-src/pulls[запрос на включение]. Подходящие отправки должны:

source: It is ready or nearly ready to be committed. A committer should be able to land this patch with less than 10 minutes of additional work.
es: Está listo o casi listo para ser integrado. Un committer debería ser capaz de incluir este parche con menos de 10 minutos de trabajo adicional.
pt_br: Estar pronto ou quase pronto para ser Commitado. Um committer deve ser capaz de aplicar este patch com menos de 10 minutos de trabalho adicional.

source: It passes all the GitHub CI jobs.
es: Pasa todos los trabajos de CI en GitHub.
pt_br: Ele passa em todos os trabalhos de CI do GitHub.
ru: Он проходит все задания GitHub CI.

source: You can respond to feedback quickly.
es: Puedes responder a los comentarios rápidamente.
pt_br: Você pode responder rapidamente a feedbacks.
ru: Вы можете быстро реагировать на обратную связь.

source: It touches fewer than about 10 files and the changes are less than about 200 lines. Changes larger than this may be OK, or you may be asked to submit multiple pull requests of a more manageable size.
es: Toca menos de unos 10 ficheros y los cambios son menos de 200 líneas. Cambios mayores podrían estar OK, o se te podría pedir que envíes varias pull requests de un tamaño más manejable.
pt_br: Ele afeta menos de 10 arquivos e as mudanças têm menos de 200 linhas. Mudanças maiores do que isso podem ser OK, ou você pode ser solicitado a enviar vários pull requests de um tamanho mais gerenciável.

source: Each logical change is a separate commit within the pull request. Commit messages for each change should follow extref:{committers-guide}#commit-log-message[commit log guide].
es: Cada cambio lógico está en un commit separado dentro de la pull request. Los mensajes de commit para cada cambio deberían seguir la extref:{committers-guide}#commit-log-message[guía de logs de commits].
pt_br: Cada mudança lógica é um commit separado dentro do pull request. As mensagens de commit para cada mudança devem seguir o extref:{committers-guide}#commit-log-message[guia de log de commit].

source: All commits have your name and valid email address as you'd like to see them in the FreeBSD repository as the author. Fake github.com addresses cannot be used.
es: Todos los commits tienen tu nombre y una dirección de correo electrónico válida tal y como te gustaría que aparecieran en el repositorio de FreeBSD al mostrar el autor. No se pueden usar cuentas github.com falsas.
pt_br: Todos os commits têm o seu nome e um endereço de e-mail válido como você gostaria de vê-los no repositório do FreeBSD como autor. Endereços falsos do github.com não podem ser usados.

source: The scope of the pull request should not change during review. If the review suggests changes that expand the scope, please create an independent pull request.
es: El alcance de la pull request no debería cambiar durante la revisión. Si en la revisión se sugieren cambios que amplían el alcance, por favor crea una pull request independiente.
pt_br: O escopo do pull request não deve ser alterado durante a revisão. Se a revisão sugerir mudanças que expandam o escopo, crie um pull request independente.

source: Fixup commits should be squashed with the commit they are fixing. Each commit in your branch should be suitable for FreeBSD's repository.
es: Los commits con arreglos se deberían agrupar junto al commit que arreglan. Cada commit en tu rama debería ser adecuado para el repositorio FreeBSD.
pt_br: Commits de correção devem ser combinados com o commit que estão corrigindo. Cada commit em seu branch deve ser adequado para o repositório do FreeBSD.

source: Commits should include one or more `Signed-off-by:` lines with full name and email address certifying https://developercertificate.org/[Developer Certificate of Origin].
es: Los commits deberían incluir una o más líneas `Signed-off-by:` con el nombre completo y dirección de correo electrónico cumpliendo el https://developercertificate.org/[Certificado de Origen del Desarrollador].
pt_br: Os commits devem incluir uma ou mais linhas `Signed-off-by:` com nome completo e endereço de e-mail certificando o https://developercertificate.org/[Certificado de Origem do Desenvolvedor].
ru: Коммиты должны включать одну или несколько строк `Signed-off-by:` с полным именем и адресом электронной почты, подтверждающими https://developercertificate.org/[Сертификат происхождения разработчика].

source: When updating pull request, please rebase with a forced push rather than a merge commit. More complex changes may be submitted as pull requests, but they may be closed if they are too large, too unwieldy, become inactive, need further discussion in the community, or need extensive revision. Please avoid creating large, wide-ranging cleanup patches: they are too large and lack the focus needed for a good review. Misdirected patches may be redirected to a more appropriate forum for the patch to be resolved.
es: Cuando se actualice una pull request, por favor rebasa con un push forzado en lugar de hacer un commit tipo merge. Cambios más complejos se pueden enviar como pull requests, pero podrían cerrarse si son demasiado grandes, difíciles de manejar, necesitan discutirse con la comunidad, o necesitan una revisión amplia. Por favor evita crear parches grandes, que abarquen mucho: son demasiado grandes y carecen del foco necesario para una buena revisión. Los parches que estén mal dirigidos podrían ser reenviados a un foro más apropiado para que puedan ser resueltos.
pt_br: Ao atualizar um pull request, por favor faça o rebase com um push forçado em vez de um commit de merge. Mudanças mais complexas podem ser submetidas como pull requests, mas podem ser fechadas se forem muito grandes, difíceis de manusear, tornarem-se inativas, precisarem de mais discussão na comunidade ou precisarem de uma revisão extensa. Por favor, evite criar grandes patches de limpeza abrangentes: eles são muito grandes e não têm o foco necessário para uma boa revisão. Patches mal direcionados podem ser redirecionados para um fórum mais apropriado para a resolução do patch.
ru: При обновлении запроса на включение изменений, пожалуйста, выполняйте перебазирование с принудительной отправкой (forced push), а не слиянием через коммит (merge commit). Более сложные изменения могут быть отправлены как запросы на включение (pull request), но они могут быть отклонены и закрыты, если они слишком большие, слишком громоздкие, становятся неактивными, требуют дополнительного обсуждения в сообществе или нуждаются в значительной доработке. Пожалуйста, избегайте создания больших, широкомасштабных патчей для очистки: они слишком велики и не обладают необходимой фокусировкой для качественного рецензирования. Патчи, отправленные не по адресу, могут быть перенаправлены в более подходящий форум для их доработки.

source: Pull requests submitted to the ports repository may or may not see action, based on the whims of developers. For now, you will have a better experience if you follow the ports submission process <<ports-contributing>>.
es: Las pull requests enviadas al respositorio de ports podrían ser o no atendidas, dependiendo de los desarrolladores. Por ahora, tendrás una mejor experiencia y sigues el proceso de envío de ports <<ports-contributing>>.
pt_br: Os pull requests submetidos ao repositório de ports podem ou não receber atenção, dependendo do interesse dos desenvolvedores. Por enquanto, para ter uma melhor experiência é melhor seguir o processo de submissão de ports descrito na seção <<ports-contributing>> .

source: The docs team also accepts pull requests via GitHub, but has not established any policy for them yet.
es: El equipo de documentación también acepta requests vía GitHub, pero todavía no ha establecido ninguna política al respecto.
pt_br: A equipe de documentação também aceita pull requests via GitHub, mas ainda não estabeleceu nenhuma política para eles.
ru: Команда документации также принимает pull requests через GitHub, но пока не установила для них никакой политики.

source: If you find a bug or are submitting a specific change, please report it using the https://bugs.FreeBSD.org/submit/[bug submission form]. Try to fill-in each field of the bug report. Unless they exceed 65KB, include any patches directly in the report. If the patch is suitable to be applied to the source tree put `[PATCH]` in the synopsis of the report. When including patches, _do not_ use cut-and-paste because cut-and-paste turns tabs into spaces and makes them unusable. When patches are a lot larger than 20KB, consider compressing them (eg. with man:gzip[1] or man:bzip2[1]) prior to uploading them.
es: Si encuentras un fallo estás enviando un cambio específico, por favor repórtalo utilizando el https://bugs.FreeBSD.org/submit/[formulario de envío de errores]. Intenta rellenar cada uno de los campos del informe de error. A menos que excedan 65KB, incluye cualquier parche directamente en el reporte. Si el parche puede ser aplicado sobre el árbol de fuentes, pon `[PATCH]`en la sinopsis del informe. Cuando incluyas parches, _no_ utilices copiar y pegar porque copiar y pegar convierte tabuladores en espacios y los hace inutilizables. Cuando los parches son mucho mayores que 20KB, considera comprimirlos (ej. con man:gzip[1] o man:bzip2[1]) antes de subirlos.
pt_br: Se você encontrar um bug ou estiver enviando uma mudança específica, por favor relate-o usando o https://bugs.FreeBSD.org/submit/[formulário de submissão de bug]. Tente preencher cada campo do relatório de bug. A menos que excedam 65KB, inclua quaisquer patches diretamente no relatório. Se o patch for adequado para ser aplicado à árvore de código fonte, coloque `[PATCH]` na sinopse do relatório. Ao incluir patches, _não_ use o copiar e colar, pois o copiar e colar transforma os tabs em espaços e os torna inutilizáveis. Quando os patches são muito maiores do que 20KB, considere comprimi-los (por exemplo, com man:gzip[1] ou man:bzip2[1]) antes de enviá-los.

source: After filing a report, you should receive confirmation along with a tracking number. Keep this tracking number so that you can update us with details about the problem.
es: Tras rellenar el informe debería recibir un mensaje de confirmación junto con un número de seguimiento. Conserve este número de seguimiento para que pueda informarnos con nuevos detalles sobre el problema.
pt_br: Depois de enviar um relatório, você deve receber uma confirmação juntamente com um número de rastreamento. Guarde este número de rastreamento para que você possa nos atualizar com detalhes sobre o problema.
ru: После подачи отчета вы должны получить подтверждение вместе с номером для отслеживания. Сохраните этот номер, чтобы вы могли сообщить нам дополнительные сведения о проблеме.

source: See also extref:{problem-reports}[this article] on how to write good problem reports.
es: Ver también extref:{problem-reports}[este artículo] sobre cómo escribir buenos informes de error.
pt_br: Veja também extref:{problem-reports}[este artigo] sobre como escrever bons relatórios de problemas.
ru: См. также extref:{problem-reports}[эту статью] о том, как писать хорошие отчёты о проблемах.

source: Changes to the Documentation
es: Cambios en la documentación
pt_br: Mudanças na Documentação
ru: Изменения в документации
