Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributing/_index.po
Languages: es, pt_br, ru

source: Consider whether changes to your port might cause any other ports to break. If this is the case, coordinate the changes with the maintainers of those ports. This is especially important if your update changes the shared library version; in this case, at the very least, the dependent ports will need to get a `PORTREVISION` bump so that they will automatically be upgraded by automated tools such as portmaster or man:portupgrade[1].
es: Considera si cambios en tu port pueden provocar que otros ports se rompan. Si es el caso, coordina los cambios con los maintainers de esos ports. Esto es especialmente importante si tus cambios actualizan la versión de una librería compartida; en este caso, como mínimo, los ports dependientes necesitan incrementar su `PORTREVISION`para que sean actualizados automáticamente por las herramientas de automatización como portmaster o man:portupgrade[1].
pt_br: Considere se as alterações em seu port podem fazer com que outros ports se quebrem. Se for o caso, coordene as alterações com os mantenedores desses ports. Isso é especialmente importante se sua atualização alterar a versão da biblioteca compartilhada; nesse caso, pelo menos os ports dependentes precisarão receber um incremento no `PORTREVISION` para que sejam atualizados automaticamente por ferramentas automatizadas, como portmaster ou man:portupgrade[1].

source: Submit changes
es: Enviar los cambios
pt_br: Envie as alterações
ru: Представляйте изменения

source: Send your update by submitting a PR with an explanation of the changes and a patch containing the differences between the original port and the updated one. Please refer to extref:{problem-reports}[Writing FreeBSD Problem Reports] for information on how to write a really good PR.
es: Envía tu actualización mediante un PR con una explicación de los cambios y un parche que contenga las diferencias entre el port original y el actualizado. Por favor, consulta extref:{problem-reports}[Writing FreeBSD Problem Reports] para más información sobre cómo escribir un PR realmente bueno.
pt_br: Envie sua atualização submetendo um PR com uma explicação das alterações e um patch contendo as diferenças entre o port original e o atualizado. Consulte o extref:{problem-reports}[Redação de Relatórios de Problemas do FreeBSD] para obter informações sobre como escrever um PR realmente bom.
ru: Отправьте ваше обновление, создав PR с описанием изменений и патчем, содержащим различия между исходным портом и обновлённым. Обратитесь к статье extref:{problem-reports}[Составление сообщений о проблеме во FreeBSD] для получения информации о том, как правильно оформить PR.

source: Please do not submit a man:shar[1] archive of the entire port; instead, use man:git-format-patch[1] or man:diff[1] `-ruN`. In this way, committers can much more easily see exactly what changes are being made. The Porter's Handbook section on extref:{porters-handbook}[Upgrading, port-upgrading] has more information.
es: Por favor no envíes un archivo man:shar[1] de todo el port; en su lugar, utiliza man:diff[1] `-ruN`. De este modo, los committers pueden ver mucho más fácilmente qué cambios se están haciendo exactamente. La sección extref:{porters-handbook}[Upgrading, port-upgrading] del Porter's Handbook tiene más información.
pt_br: Por favor, não envie um arquivo man:shar[1] do port inteiro; em vez disso, use man:git-format-patch[1] ou man:diff[1] `-ruN`. Dessa forma, os committers podem ver com muito mais facilidade exatamente quais mudanças estão sendo feitas. A seção extref:{porters-handbook}[Atualização, port-upgrading] do Handbook do Mantenedor de Ports contém mais informações.
ru: Пожалуйста, не отправляйте архив man:shar[1] всего порта; вместо этого используйте man:git-format-patch[1] или man:diff[1] `-ruN`. Таким образом, коммиттеры смогут гораздо проще увидеть, какие именно изменения были внесены. Раздел extref:{porters-handbook}[Обновление, port-upgrading] в Руководстве портера содержит дополнительную информацию.

source: Wait
es: Esperar
pt_br: Aguarde
ru: Ждите

source: At some stage a committer will deal with your PR. It may take minutes, or it may take one or two weeks - so please be patient. If it takes any longer, please seek for help on mailing lists ({freebsd-ports}), IRC: #bsdports on EFNet or #freebsd-ports on Libera for example.
es: En algún momento un committer tratará tu PR. Podría llevar minutos, o podría llevar una o dos semanas - así que por favor, sé paciente. Si transcurre más tiempo, por favor busca ayuda en las listas de correo ({freebsd-ports}), IRC: #bsdports en EFNet o #freebsd-ports en Libera por ejemplo.
pt_br: Em algum momento, um committer lidará com o seu PR. Isso pode levar minutos ou pode levar uma ou duas semanas - portanto, tenha paciência. Se levar mais tempo, procure ajuda em listas de discussão ({freebsd-ports}), no IRC: #bsdports na EFNet ou #freebsd-ports na Libera, por exemplo.
ru: На каком-то этапе коммиттер рассмотрит ваш PR. Это может занять минуты, а может и одну-две недели — так что проявите терпение. Если это займет больше времени, обратитесь за помощью в почтовые рассылки ({freebsd-ports}), IRC: #bsdports на EFNet или #freebsd-ports на Libera, например.

source: Give feedback
es: Proporciona feedback
pt_br: Dê feedback
ru: Предоставляйте обратную связь

source: If a committer finds a problem with your changes, they will most likely refer it back to you. A prompt response will help get your PR committed faster, and is better for maintaining a thread of conversation when trying to resolve any problems.
es: Si un committer encuentra algún problema en tus cambios lo más probable es que se los devuelva. Una respuesta rápida ayudará a que se haga más rápido el commit. Es muy importante mantener abierto el canal de comunicación para acelerar la resolución de cualquier problema.
pt_br: Se um committer encontrar um problema com as suas alterações, eles provavelmente o encaminharão de volta para você. Uma resposta rápida ajudará a obter a aprovação do seu PR mais rapidamente e é melhor para manter uma conversa ao tentar resolver qualquer problema.
ru: Если участник проекта обнаружит проблему в ваших изменениях, он, скорее всего, вернёт их вам на доработку. Быстрый ответ поможет ускорить принятие вашего PR, а также упростит поддержание последовательности обсуждения при попытке разрешить возникшие проблемы.

source: And Finally
es: Y para concluir
pt_br: E finalmente
ru: И наконец

source: Your changes will be committed and your port will have been updated. The PR will then be closed by the committer. That's it!
es: Se hará el commit con tus cambios y el port habrá sido actualizado. Después se cerrará el PR. ¡Eso es todo!
pt_br: Suas alterações serão incorporadas e o seu port será atualizada. O PR será então fechado pelo committer. É isso aí!

source: Ensure your ports continue to build correctly
es: Asegúrate de que tus ports continúan compilando correctamente
pt_br: Garanta que seus ports continuem a ser compilados corretamente
ru: Убедитесь, что ваши порты продолжают собираться корректно

source: This section is about discovering and fixing problems that stop your ports from building correctly.
es: Esta sección trata sobre descubrir y solucionar problemas que impiden que tus ports se compilen correctamente.
pt_br: Esta seção é sobre a descoberta e a solução de problemas que fazem seus ports deixarem de ser compilados corretamente.
ru: Этот раздел посвящён обнаружению и исправлению проблем, которые мешают правильной сборке портов.

source: FreeBSD only guarantees that the Ports Collection works on the `-STABLE` branches. In theory, you should be able to get by with running the latest release of each stable branch (since the ABIs are not supposed to change) but if you can run the branch, that is even better.
es: El proyecto FreeBSD solo garantiza que la colección de ports funcione en la rama `-STABLE`. En teoría debería poder ejecutarse la última versión de cada rama estable (ya que se espera que las ABIs no cambien) pero si funciona también en las demás ramas es aun mejor.
pt_br: O FreeBSD garante o funcionamento da Coleção de Ports apenas nos branches `-STABLE`. Em teoria, você deveria ser capaz de rodar a versão mais recente de cada branch estável (já que as ABIs não devem mudar), mas se puder rodar o branch, isso é ainda melhor.
ru: FreeBSD гарантирует работоспособность Коллекции портов только в ветках `-STABLE`. Теоретически можно обойтись использованием последних выпусков каждой стабильной ветки (поскольку ABI не должны меняться), но если есть возможность использовать саму ветку, это ещё лучше.

source: Since the majority of FreeBSD installations run on PC-compatible machines (what is termed the `i386` architecture), we expect you to keep the port working on that architecture. We prefer that ports also work on the `amd64` architecture running native. It is completely fair to ask for help if you do not have one of these machines.
es: Dado que la mayor parte de las instalaciones de FreeBSD se ejecutan en ordenadores comunes (arquitectura `i386`), esperamos que mantenga el port funcionando en esta arquitectura. También preferimos que los ports funcionen de forma nativa en la arquitectura `amd64`. No dude en pedir ayuda si no dispone de una de estas máquinas.
pt_br: Como a maioria das instalações do FreeBSD é executada em máquinas compatíveis com PC (o que é chamado de arquitetura `i386`), esperamos que você mantenha o port funcionando nessa arquitetura. Preferimos que os ports também funcionem na arquitetura `amd64` executando nativamente. É completamente justo pedir ajuda se você não tiver uma dessas máquinas.
ru: Поскольку большинство установок FreeBSD работают на PC-совместимых машинах (так называемая архитектура `i386`), мы ожидаем, что порт будет работать на этой архитектуре. Мы предпочитаем, чтобы порты также работали на архитектуре `amd64` в нативном режиме. Совершенно допустимо попросить о помощи, если у вас нет одной из таких машин.

source: The usual failure modes for non-`x86` machines are that the original programmers assumed that, for instance, pointers are `int`-s, or that a relatively lax older gcc compiler was being used. More and more, application authors are reworking their code to remove these assumptions - but if the author is not actively maintaining their code, you may need to do this yourself.
es: Los fallos habituales para ordenadores que no son `x86` se producen porque los programadores originales asumieron que, por ejemplo, los punteros son `int`s, o que se utilizaría una versión mas antigua del compilador gcc. Cada vez más, los autores de las aplicaciones están reescribiendo su código para eliminar estos fallos — pero si el autor no mantiene activamente su código, es posible que debas hacerlo tú mismo.
pt_br: Os modos comuns de falha para máquinas não-`x86` são que os programadores originais assumiram, por exemplo, que os ponteiros são `int`, ou que um compilador gcc mais antigo e relativamente relaxado estava sendo usado. Cada vez mais, os autores de aplicativos estão retrabalhando seu código para remover essas suposições - mas se o autor não estiver mantendo ativamente seu código, você pode precisar fazer isso sozinho.
ru: Обычные режимы сбоя для машин не на архитектуре `x86` связаны с предположениями оригинальных программистов, например, что указатели являются `int`-ами, или что используется относительно старый и менее строгий компилятор gcc. Все чаще авторы приложений перерабатывают свой код, чтобы устранить эти предположения — но если автор не занимается активной поддержкой своего кода, вам, возможно, придется сделать это самостоятельно.

source: These are the tasks you need to perform to ensure your port is able to be built:
es: Estas son las tareas que debe realizar para garantizar que su port pueda compilarse:
pt_br: Estas são as tarefas que você precisa realizar para garantir que o seu port possa ser compilado:
ru: Вот задачи, которые необходимо выполнить, чтобы убедиться, что ваш порт может быть собран:

source: Watch for build failures
es: Mantente atento a los fallos en la compilación
pt_br: Fique atento a falhas na compilação
ru: Следите за ошибками сборки

source: Check your mail for mail from `pkg-fallout@FreeBSD.org` and the http://portscout.FreeBSD.org[distfiles scanner] to see if any of the port which are failing to build are out of date.
es: Comprueba tu correo para mensajes de `pkg-fallout@FreeBSD.org` y el http://portscout.FreeBSD.org[distfiles scanner] para ver alguno de los ports que están fallando están desactualizados.
pt_br: Verifique seu e-mail para ver se há mensagens de `pkg-fallout@FreeBSD.org` e do http://portscout.FreeBSD.org[scanner de distfiles] para ver se algum dos ports que estão falhando na compilação está desatualizado.
ru: Проверьте свою почту на наличие писем от `pkg-fallout@FreeBSD.org` и http://portscout.FreeBSD.org[сканера distfiles], чтобы узнать, не устарели ли какие-либо порты, которые не собираются.

source: Collect information
es: Recopila información
pt_br: Colete informação
ru: Собрать информацию

source: Once you are aware of a problem, collect information to help you fix it. Build errors reported by `pkg-fallout` are accompanied by logs which will show you where the build failed. If the failure was reported to you by a user, ask them to send you information which may help in diagnosing the problem, such as:
es: Cuando encuentres algún problema recopila información para ayudar a solucionarlo. Los errores de compilación reportados por `pkg-fallout` incluyen registros que te mostrarán dónde falló la compilación. Si un usuario te informó sobre el fallo pídele que te envíe información que puedas ayudar a identificar el problema, como por ejemplo:
pt_br: Assim que você estiver ciente de um problema, colete informações para ajudá-lo a corrigi-lo. Os erros de compilação relatados pelo `pkg-fallout` são acompanhados por logs que mostrarão onde a compilação falhou. Se a falha foi relatada por um usuário, peça a eles que enviem informações que possam ajudar a diagnosticar o problema, tais como:
ru: Как только вы обнаружили проблему, соберите информацию, которая поможет её исправить. Ошибки сборки, о которых сообщает `pkg-fallout`, сопровождаются журналами, показывающими, где произошёл сбой. Если о проблеме сообщил пользователь, попросите его предоставить данные, которые могут помочь в диагностике, например:

source: Build logs
es: Logs de la compilación
pt_br: Logs de compilação
ru: Логи сборки

source: The commands and options used to build the port (including options set in [.filename]#/etc/make.conf#)
es: Los comandos y opciones utilizados para compilar el port (incluidas las opciones establecidas en [.filename]#/etc/make.conf#)
pt_br: Os comandos e opções usados para compilar o port (incluindo opções definidas no [.filename]#/etc/make.conf#)
ru: Команды и параметры, используемые для сборки порта (включая параметры, установленные в [.filename]#/etc/make.conf#)

source: A list of packages installed on their system as shown by man:pkg-info[8]
es: Una lista de paquetes instalados en su sistema tal como los muestra man:pkg-info[8]
pt_br: Uma lista de pacotes instalados no seu sistema, conforme mostrado por man:pkg-info[8]
ru: Список пакетов, установленных в системе, как показано в man:pkg-info[8]

source: The version of FreeBSD they are running as shown by man:uname[1] `-a`
es: La versión de FreeBSD que están corriendo como la muestra man:uname[1] `-a`
pt_br: A versão do FreeBSD que estão executando, conforme mostrado por man:uname[1] `-a`
ru: Версия FreeBSD, которую они используют, как показано в man:uname[1] `-a`

source: When their ports collection was last updated
es: Cuándo se actualizó por última vez su colección de ports
pt_br: Quando a coleção de ports foi atualizada pela última vez
ru: Когда их коллекция портов была последний раз обновлена

source: When their ports tree and [.filename]#INDEX# was last updated
es: Cuándo han sido actualizados por última vez su árbol de ports y su [.filename]#INDEX#
pt_br: Quando a sua coleção de ports e o arquivo [.filename]#INDEX# foram atualizados pela última vez
ru: Когда их дерево портов и файл [.filename]#INDEX# были последний раз обновлены

source: Investigate and find a solution
es: Investiga y encuentra una solución
pt_br: Investigue e encontre uma solução
ru: Изучить и найти решение

source: Unfortunately there is no straightforward process to follow to do this. Remember, though: if you are stuck, ask for help! The {freebsd-ports} is a good place to start, and the upstream developers are often very helpful.
es: Desgraciadamente no hay un método directo que seguir para hacer esto. De todos modos, recuerda: si te atascas, ¡pide ayuda! La {freebsd-ports} es un buen lugar para empezar, y los desarrolladores del proyecto original suelen ser de mucha ayuda.
pt_br: Infelizmente, não há um processo direto a seguir para fazer isso. Lembre-se, no entanto: se estiver travado, peça ajuda! O {freebsd-ports} é um bom lugar para começar, e os desenvolvedores upstream geralmente são muito prestativos.
ru: К сожалению, не существует прямого процесса, которому можно следовать для этого. Однако помните: если вы застряли, попросите помощи! Коллекция портов {freebsd-ports} — хорошее место для начала, и разработчики вышестоящих проектов часто очень отзывчивы.

source: Just as with updating a port, you should now incorporate changes, review and test, submit your changes in a PR, and provide feedback if required.
es: Al igual que con la actualización de un port, ahora debes incorporar los cambios, revisar, probar y enviar tus cambios en eun PR y proporcionar feedback si es necesario.
pt_br: Assim como na atualização de um port, agora você deve incorporar as alterações, revisar, testar e enviar suas alterações em um relatório de problemas (PR) e fornecer feedback, se solicitado.
ru: Как и при обновлении порта, теперь вам следует внести изменения, проверить и протестировать их, отправить изменения в PR и, если требуется, предоставить обратную связь.

source: Send patches to upstream authors
es: Enviar parches a los autores originales
pt_br: Envie os patches para os autores upstream
ru: Отправляйте исправления авторам вышестоящих проектов

source: In some cases, you will have to make patches to the port to make it run on FreeBSD. Some (but not all) upstream authors will accept such patches back into their code for the next release. If so, this may even help their users on other BSD-based systems as well and perhaps save duplicated effort. Please consider sending any applicable patches to the authors as a courtesy.
es: En algunos casos necesitarás aplicar parches un port para que se ejecute en FreeBSD. Algunos autores originales (aunque no todos) aceptarán incorporar dichos parches en su código en la próxima versión. Si lo hacen esto podría ayudar a los usuarios de otros sistemas BSD y tal vez evitar duplicar esfuerzos. Como cortesía, recomendamos enviar los parches de este tipo a los autores originales.
pt_br: Em alguns casos, você terá que fazer patches no port para fazê-lo funcionar no FreeBSD. Alguns (mas não todos) os autores upstream aceitarão tais patches em seu código para a próxima versão. Se for o caso, isso pode até ajudar seus usuários em outros sistemas baseados em BSD e talvez economizar esforço duplicado. Considere enviar quaisquer patches aplicáveis aos autores como uma cortesia.
ru: В некоторых случаях потребуется внести изменения в порт, чтобы он заработал на FreeBSD. Некоторые (но не все) разработчики исходного проекта примут такие изменения в свой код для следующего выпуска. Если это произойдет, это может помочь их пользователям и на других BSD-системах, а также, возможно, сэкономит дублирующие усилия. В качестве жеста вежливости, пожалуйста, рассмотрите возможность отправки соответствующих исправлений авторам.

source: Investigate bug reports and PRs related to your port
es: Investiga los informes de errores y PRs relacionados con tu port
pt_br: Investigue relatórios de bugs e PRs relacionados ao seu port
ru: Изучать отчеты об ошибках и PR, связанные с вашим портом

source: This section is about discovering and fixing bugs.
es: Esta sección trata sobre encontrar y corregir errores.
pt_br: Esta seção é sobre como descobrir e corrigir bugs.
ru: Этот раздел посвящён поиску и исправлению ошибок.

source: FreeBSD-specific bugs are generally caused by assumptions about the build and runtime environments that do not apply to FreeBSD. You are less likely to encounter a problem of this type, but it can be more subtle and difficult to diagnose.
es: Los errores específicos de FreeBSD son causados generalmente por suposiciones sobre los entornos de compilación y ejecución que no afectan a FreeBSD. Es poco probable que encuentres este tipo de problemas, pero pueden ser sutiles y difíciles de diagnosticar.
pt_br: Os bugs específicos do FreeBSD são geralmente causados por suposições sobre os ambientes de compilação e de tempo de execução que não se aplicam ao FreeBSD. É menos provável que você encontre um problema desse tipo, mas ele pode ser mais sutil e difícil de diagnosticar.
ru: Ошибки, специфичные для FreeBSD, обычно вызваны предположениями о среде сборки и выполнения, которые не применимы к FreeBSD. Вероятность столкнуться с такой проблемой меньше, но она может быть более тонкой и сложной для диагностики.

source: These are the tasks you need to perform to ensure your port continues to work as intended:
es: Estas son las tareas que debe realizar para garantizar que su port continúe funcionando según lo previsto:
pt_br: Essas são as tarefas que você precisa realizar para garantir que seu port continue funcionando conforme o esperado:
ru: Вот задачи, которые необходимо выполнить, чтобы ваш порт продолжал работать должным образом:

source: Respond to bug reports
es: Responde a los informes de errores
pt_br: Responda os relatórios de bugs
ru: Отвечать на отчёты об ошибках

source: Bugs may be reported to you through email via the https://bugs.FreeBSD.org/search/[Problem Report database]. Bugs may also be reported directly to you by users.
es: Los errores se te pueden reportar a través de email vía la https://bugs.FreeBSD.org/search/[Base de datos de Informes de Error]. Los errores también se te pueden reportar directamente por los usuarios.
pt_br: Os bugs podem ser relatados a você por e-mail através do https://bugs.FreeBSD.org/search/[banco de dados de relatórios de problemas]. Os bugs também podem ser relatados diretamente a você pelos usuários.
ru: Ошибки могут быть сообщены вам по электронной почте через https://bugs.FreeBSD.org/search/[базу данных отчетов о проблемах]. Также пользователи могут сообщать об ошибках напрямую вам.

source: You should respond to PRs and other reports within 14 days, but please try not to take that long. Try to respond as soon as possible, even if it is just to say you need some more time before you can work on the PR.
es: Debes responder a los PRs y otros reportes en máximo 14 días, pero trata de no demorarte tanto. Intenta responder lo antes posible, incluso si es solo para decir que necesitas más tiempo antes de empezar a trabajar en el PR.
pt_br: Você deve responder a PRs e outros relatórios dentro de 14 dias, mas tente não levar tanto tempo. Tente responder o mais rápido possível, mesmo que seja apenas para dizer que você precisa de mais tempo antes de poder trabalhar no PR.
ru: Вы должны отвечать на PR и другие сообщения в течение 14 дней, но постарайтесь не затягивать так долго. Старайтесь отвечать как можно скорее, даже если это просто сообщение о том, что вам нужно ещё немного времени, прежде чем вы сможете заняться PR.
