Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributing/_index.po
Languages: es, pt_br, ru

source: How to contribute to the FreeBSD Project
es: Cómo contribuir al Proyecto FreeBSD
pt_br: Como contribuir para o Projeto FreeBSD
ru: Как внести вклад в проект FreeBSD

source: Contributing to FreeBSD
es: Contribuir a FreeBSD
pt_br: Contribuindo com o FreeBSD
ru: Участие в проекте FreeBSD

source: Abstract
es: Resumen
pt_br: Resumo
ru: Аннотация

source: This article describes the different ways in which an individual or organization may contribute to the FreeBSD Project.
es: Este artículo describe las diferentes formas en que una persona u organización puede contribuir al proyecto FreeBSD.
pt_br: Este artigo descreve maneiras diferentes sobre como um indivíduo ou organização pode contribuir com o Projeto FreeBSD.
ru: В этой статье описаны различные способы, с помощью которых отдельный человек или организация могут внести вклад в проект FreeBSD.

source: So you want to contribute to FreeBSD? That is great! FreeBSD _relies_ on the contributions of its user base to survive. Your contributions are not only appreciated, they are vital to FreeBSD's continued growth.
es: ¿Así que quieres contribuir a FreeBSD? ¡Eso es fantástico! FreeBSD _depende_ de las contribuciones de su base de usuarios para sobrevivir. Tus contribuciones no sólo son apreciadas, son vitales para el crecimiento continuo de FreeBSD.
pt_br: Então você quer contribuir para o FreeBSD? Isso é ótimo! O FreeBSD _depende_ das contribuições de sua base de usuários para sobreviver. Suas contribuições não são apenas apreciadas, elas são vitais para o crescimento contínuo do FreeBSD.
ru: Итак, вы хотите внести свой вклад в FreeBSD? Это замечательно! FreeBSD _полагается_ на вклад своих пользователей для существования. Ваши усилия не только ценятся, они жизненно важны для дальнейшего развития FreeBSD.

source: A large and growing number of international contributors, of greatly varying ages and areas of technical expertise, develop FreeBSD. There is always more work to be done than there are people available to do it, and more help is always appreciated.
es: El grupo de desarrolladores de FreeBSD lo componen un grupo grande y siempre creciente de gente de todas partes del mundo, de edades y áreas de experiencia técnica muy diversas. Siempre hay más trabajo pendiente que manos disponibles y siempre se agradece ayuda adicional.
pt_br: Um grande e crescente número de colaboradores internacionais, de idades e áreas de experiência técnica muito diversas, desenvolvem o FreeBSD. Sempre há mais trabalho a ser feito do que pessoas disponíveis para fazê-lo, e mais ajuda sempre é apreciada.
ru: FreeBSD разрабатывает большое и постоянно растущее количество участников из разных стран, самого разного возраста и уровня технической экспертизы. Работы всегда больше, чем доступных людей, и любая помощь всегда приветствуется.

source: As a volunteer, what you do is limited only by what you want to do. However, we do ask that you are aware of what other members of the FreeBSD community will expect of you. You may want to take this into account before deciding to volunteer.
es: El único límite que ponemos a los voluntarios es el que su disponibilidad misma dicte. Por otra parte le pedimos que esté al tanto de lo que otros miembros de la comunidad de FreeBSD esperan de ti. Tener esto en cuenta es importante antes de decidir ser voluntario.
pt_br: Como voluntário, o que você faz é limitado apenas pelo que você quer fazer. No entanto, pedimos que você esteja ciente do que outros membros da comunidade FreeBSD esperarão de você. Você pode querer levar isso em consideração antes de decidir ser um voluntário.
ru: В качестве волонтёра вы ограничены только тем, чем хотите заниматься. Однако мы просим вас учитывать ожидания других участников сообщества FreeBSD. Возможно, вам стоит принять это во внимание, прежде чем решить стать волонтёром.

source: The FreeBSD project is responsible for an entire operating system environment, rather than just a kernel or a few scattered utilities. As such, our [.filename]#TODO# lists span a very wide range of tasks: from documentation, beta testing and presentation, to the system installer and highly specialized types of kernel development. People of any skill level, in almost any area, can almost certainly help the project.
es: El proyecto FreeBSD es responsable de mantener un sistema operativo completo, en lugar de un solo kernel o unas pocas utilidades sueltas. Por lo tanto nuestra lista de tareas pendientes [.filename]#TODO# incluye una gran variedad de tareas: desde la documentación, realización de pruebas en las versiones beta, hasta el desarrollo del instalador del sistema y tareas de desarrollo del kernel altamente especializadas. Todo el mundo puede ayudar, independientemente del nivel de habilidad, en un área u otra del proyecto.
pt_br: O projeto FreeBSD é responsável por um ambiente completo de sistema operacional, em vez de apenas um kernel ou alguns utilitários espalhados. Como tal, nossas listas de [.filename]#TODO# abrangem uma ampla gama de tarefas: desde documentação, teste beta e apresentação, até o instalador do sistema e tipos altamente especializados de desenvolvimento de kernel. Pessoas de qualquer nível de habilidade, em quase qualquer área, certamente podem ajudar o projeto.
ru: Проект FreeBSD отвечает за целостную операционную среду, а не только за ядро или несколько разрозненных утилит. Таким образом, наши списки [.filename]#TODO# охватывают очень широкий спектр задач: от документации, бета-тестирования и презентаций до установщика системы и высокоспециализированных видов разработки ядра. Люди с любым уровнем навыков, практически в любой области, почти наверняка могут помочь проекту.

source: Commercial entities engaged in FreeBSD-related enterprises are also encouraged to contact us. Do you need a special extension to make your product work? You will find us receptive to your requests, given that they are not too outlandish. Are you working on a value-added product? Please let us know! We may be able to work cooperatively on some aspect of it. The free software world is challenging many existing assumptions about how software is developed, sold, and maintained, and we urge you to at least give it a second look.
es: Invitamos a las empresas que tengan proyectos relacionados con FreeBSD a que se pongan en contacto con nosotros. ¿Necesitan de un desarrollo concreto para hacer que su producto funcione? Estaremos encantados de escuchar sus peticiones, siempre y cuando no sean demasiado raras. ¿Está trabajando en un producto de alto valor añadido? ¡Por favor, háganoslo saber! Podemos trabajar conjuntamente en algunos aspectos del mismo. El mundo del software libre está desafiando muchas de las suposiciones existentes sobre cómo se desarrolla, vende y mantiene el software y le instamos encarecidamente a que al menos considere seriamente su uso.
pt_br: Empresas comerciais envolvidas em empreendimentos relacionados ao FreeBSD também são incentivadas a entrar em contato conosco. Precisa de uma extensão especial para fazer seu produto funcionar? Você nos encontrará receptivos às suas solicitações, desde que não sejam muito absurdas. Você está trabalhando em um produto de valor agregado? Por favor, nos informe! Podemos trabalhar cooperativamente em algum aspecto disso. O mundo do software livre está desafiando muitas suposições existentes sobre como o software é desenvolvido, vendido e mantido, e instamos você a pelo menos dar uma segunda olhada.
ru: Коммерческие организации, занятые в сферах, связанных с FreeBSD, также приглашаются к сотрудничеству. Вам нужно специальное расширение, чтобы ваш продукт работал? Вы увидите, что мы отвечаем на ваши запросы, если они не слишком экстравагантны. Вы работаете над продуктом, добавляющим ценность системе? Пожалуйста, дайте нам знать! Возможно, мы сможем сотрудничать в каких-то аспектах. Свободное программное обеспечение бросает вызов многим устоявшимся представлениям о том, как разрабатывается, продаётся и поддерживается программное обеспечение, и мы призываем вас хотя бы взглянуть на него ещё раз.

source: What Is Needed
es: Qué se necesita
pt_br: O que é necessário
ru: Что необходимо

source: The following list of tasks and sub-projects represents something of an amalgam of various [.filename]#TODO# lists and user requests.
es: La lista de tareas y subproyectos que se muestra a continuación es una amalgama de varias listas de [.filename]#TODO# y solicitudes de los usuarios.
pt_br: A lista a seguir de tarefas e subprojetos representa algo como uma amálgama de várias listas de [.filename]#TODO# e de solicitações de usuários.
ru: Следующий список задач и подпроектов представляет собой своего рода объединение различных списков [.filename]#TODO# и запросов пользователей.

source: Ongoing Non-Programmer Tasks
es: Tareas en curso para personas que no son programadores
pt_br: Tarefas contínuas não relacionadas à programação
ru: Текущие задачи для непрограммистов

source: Many people who are involved in FreeBSD are not programmers. The Project includes documentation writers, Web designers, and support people. All that these people need to contribute is an investment of time and a willingness to learn.
es: Muchas de las personas que están involucradas en FreeBSD no son programadores. El proyecto incluye a escritores de documentación, diseñadores web y personas que dan soporte. Todo lo que estas personas necesitan para contribuir es invertir tiempo y la voluntad de aprender.
pt_br: Muitas pessoas envolvidas no FreeBSD não são programadoras. O Projeto inclui escritores de documentação, web designers e pessoas de suporte. Tudo o que essas pessoas precisam para contribuir é investir tempo e estar dispostas a aprender.
ru: Многие люди, участвующие в FreeBSD, не являются программистами. Проект включает в себя авторов документации, веб-дизайнеров и специалистов поддержки. Всё, что нужно этим людям для участия, — это вложение времени и готовность учиться.

source: Read through the FAQ and Handbook periodically. If anything is poorly explained, ambiguous, out of date or incorrect, let us know. Even better, send us a fix (AsciiDoc is not difficult to learn, but there is no objection to plain text submissions).
es: Lee cada cierto tiempo las FAQ y el Handbook. Si algo está mal explicado, es ambiguo, está desactualizado o es incorrecto, avísenos. Aún mejor, envíenos una solución (AsciiDoc no es difícil de aprender, pero no hay ningún problema si lo envía en texto plano).
pt_br: Leia periodicamente o FAQ e o Handbook. Se algo estiver mal explicado, ambíguo, desatualizado ou incorreto, avise-nos. Ainda melhor, envie-nos uma correção (AsciiDoc não é difícil de aprender, mas não há objeção a submissões em texto simples).

source: Help translate FreeBSD documentation into your native language. If documentation already exists for your language, you can help translate additional documents or verify that the translations are up-to-date and correct. First take a look at the extref:{fdp-primer}[Translations FAQ, translations] in the FreeBSD Documentation Project Primer. You are not committing yourself to translating every single FreeBSD document by doing this - as a volunteer, you can do as much or as little translation as you desire. Once someone begins translating, others almost always join the effort. If you only have the time or energy to translate one part of the documentation, please translate the installation instructions.
es: Ayuda a traducir la documentación de FreeBSD a tu idioma nativo. Si la documentación para tu idioma ya existe, puedes ayudar en la traducción de documentos adicionales o verificar que las traducciones están actualizadas y son correctas. Primero echa un vistazo a extref:{fdp-primer}[Translations FAQ, translations FAQ] en la Introducción a la Documentación del Proyecto FreeBSD. No te estás comprometiendo a traducir tú mismo cada uno de los documentos de FreeBSD - como voluntario, puedes hacer tanto o tan poca traducción como quieras. Una vez que alguien empieza a traducir, otros casi siempre se unen a la causa. Si sólo tienes tiempo o energía para traducir una parte de la documentación, por favor traduce las instrucciones de instalación.
pt_br: Ajude a traduzir a documentação do FreeBSD para seu idioma nativo. Se já existir documentação em seu idioma, você pode ajudar a traduzir documentos adicionais ou verificar se as traduções estão atualizadas e corretas. Primeiro, dê uma olhada no extref:{fdp-primer}[FAQ de traduções, translations] no FreeBSD Documentation Project Primer. Ao fazer isso, você não está se comprometendo a traduzir todos os documentos do FreeBSD - como voluntário, você pode traduzir tanto quanto desejar. Uma vez que alguém começa a traduzir, outros quase sempre se juntam ao esforço. Se você só tem tempo ou energia para traduzir uma parte da documentação, por favor, traduza as instruções de instalação.

source: Read the {freebsd-questions} occasionally (or even regularly). It can be very satisfying to share your expertise and help people solve their problems; sometimes you may even learn something new yourself! These forums can also be a source of ideas for things to improve upon.
es: Lee de vez en cuando (o regularmente) {freebsd-questions}. Puede ser muy satisfactorio compartir tu experiencia y ayudar a la gente a resolver sus problemas; de vez en cuanto ¡podrías aprender algo nuevo tú mismo¡ Estos foros pueden ser también una fuente de ideas sobre cosas que hay que mejorar.
pt_br: Leia ocasionalmente (ou mesmo regularmente) a {freebsd-questions}. Pode ser muito satisfatório compartilhar sua expertise e ajudar as pessoas a resolverem seus problemas; às vezes, você pode até aprender algo novo! Esses fóruns também podem ser uma fonte de ideias para melhorias.

source: Ongoing Programmer Tasks
es: Tareas en curso para personas que son programadores
pt_br: Tarefas contínuas para programadores
ru: Текущие задачи программистов

source: Most of the tasks listed here may require a considerable investment of time, an in-depth knowledge of the FreeBSD kernel, or both. However, there are also many useful tasks which are suitable for "weekend hackers".
es: La mayoría de las tareas aquí expuestas requieren de una considerable cantidad de tiempo, o un conocimiento profundo del kernel de FreeBSD, o ambas cosas. Sin embargo, también hay muchas tareas útiles que son ideales para "hackers de fin de semana".
pt_br: A maioria das tarefas listadas aqui pode exigir um investimento considerável de tempo, um conhecimento aprofundado do kernel do FreeBSD, ou ambos. No entanto, também existem muitas tarefas úteis que são adequadas para "hackers de fim de semana".
ru: Большинство перечисленных здесь задач может потребовать значительных временных затрат, глубоких знаний о ядре FreeBSD или того и другого. Однако, есть также множество полезных задач, подходящих для "хакеров выходного дня".

source: If you run FreeBSD-CURRENT and have a good Internet connection, there is a machine `current.FreeBSD.org` which builds a full release once a day-every now and again, try to install the latest release from it and report any failures in the process.
es: Si utilizas FreeBSD-CURRENT y tienes una buena conexión a Internet, hay una máquina `current.FreeBSD.org` que construye una versión completa una vez al día de vez en cuando, intenta instalar la última versión y reportar cualquier fallo en el proceso.
pt_br: Se você está executando o FreeBSD-CURRENT e tem uma boa conexão com a Internet, há uma máquina chamada `current.FreeBSD.org` que cria uma versão completa uma vez por dia - de tempos em tempos, tente instalar a versão mais recente dela e relate quaisquer falhas no processo.
ru: Если вы используете FreeBSD-CURRENT и имеете хорошее подключение к интернету, существует машина `current.FreeBSD.org`, которая ежедневно собирает полный релиз — время от времени пробуйте установить последний релиз с неё и сообщайте о любых сбоях в процессе.

source: Read the {freebsd-bugs}. There may be a problem you can comment constructively on or with patches you can test. Or you could even try to fix one of the problems yourself.
es: Lee la {freebsd-bugs}. Podría haber un problema sobre el que podrías comentar de forma constructiva o parches que puedes probar. O podrías incluso intentar arreglar tú mismo alguno de los problemas.
pt_br: Leia a {freebsd-bugs}. Pode haver um problema no qual você possa comentar de forma construtiva ou com patches que possa testar. Ou você poderia até mesmo tentar corrigir um dos problemas sozinho.

source: If you know of any bug fixes which have been successfully applied to -CURRENT but have not been merged into -STABLE after a decent interval (normally a couple of weeks), send the committer a polite reminder.
es: Si sabes de alguna corrección que ha sido aplicada con éxito en -CURRENT y cuya solución no ha sido aplicada aun en -STABLE después de un período de tiempo razonable (normalmente, un par de semanas) envía, de forma educada, un mensaje al committer responsable del cambio.
pt_br: Se você souber de correções de bugs que foram aplicadas com sucesso ao -CURRENT, mas ainda não foram mescladas ao -STABLE após um intervalo razoável (normalmente algumas semanas), envie um lembrete educado ao committer responsável.
ru: Если вам известны исправления ошибок, которые были успешно применены в -CURRENT, но не были перенесены в -STABLE в течение разумного срока (обычно пары недель), отправьте коммиттеру вежливое напоминание.

source: Move contributed software to [.filename]#src/contrib# in the source tree.
es: Mueva el software de terceros a [.filename]#src/contrib# en el árbol del código fuente.
pt_br: Mova o software contribuído para [.filename]#src/contrib# no diretório de código-fonte.
ru: Переместите стороннее программное обеспечение в [.filename]#src/contrib# в дереве исходных кодов.

source: Make sure code in [.filename]#src/contrib# is up to date.
es: Asegúrate de que el código en [.filename]#src/contrib# está actualizado.
pt_br: Certifique-se de que o código em [.filename]#src/contrib# esteja atualizado.
ru: Убедитесь, что код в [.filename]#src/contrib# актуален.

source: Build the source tree (or just part of it) with extra warnings enabled and clean up the warnings. A list of build warnings can also be found from our https://ci.freebsd.org[CI] by selecting a build and checking "LLVM/Clang Warnings".
es: Construye el árbol de fuentes (o sólo una parte) con los avisos extra activados y límpialos. Una lista de avisos de compilación se puede encontrar también en nuestro https://ci.freebsd.org[CI] seleccionando "LLVM/Clang Warnings".
pt_br: Compile o de código-fonte do sistema (ou apenas parte dele) com avisos extras ativados e limpe os avisos. Uma lista de avisos de compilação também pode ser encontrada em nosso https://ci.freebsd.org[CI] selecionando uma compilação e verificando "LLVM/Clang Warnings".

source: Fix warnings for ports which do deprecated things like using `gets()` or including [.filename]#malloc.h#.
es: Arregla warnings para ports que no marcan como obsoleto el uso de cosas como `gets()` o incluir [.filename]#malloc.h#.
pt_br: Corrija os avisos para ports que fazem coisas depreciadas, como usar `gets()` ou incluir [.filename]#malloc.h#.
ru: Исправление предупреждений для портов, которые используют устаревшие функции, такие как `gets()` или включают [.filename]#malloc.h#.

source: If you have contributed any ports and you had to make FreeBSD-specific changes, send your patches back to the original authors (this will make your life easier when they bring out the next version).
es: Si has contribuido con algún port y tuviste que hacer cambios específicos para FreeBSD, envía tus parches a los autores originales (esto les hará la vida más fácil cuando lancen la próxima versión).
pt_br: Se você contribuiu com quaisquer ports e teve que fazer mudanças específicas para o FreeBSD, envie seus patches de volta para os autores originais (isso facilitará sua vida quando eles lançarem a próxima versão).
ru: Если вы внесли свой вклад в какие-либо порты и вам пришлось внести изменения, специфичные для FreeBSD, отправьте свои исправления оригинальным авторам (это облегчит вашу жизнь, когда они выпустят следующую версию).

source: Get copies of formal standards like POSIX(R). Compare FreeBSD's behavior to that required by the standard. If the behavior differs, particularly in subtle or obscure corners of the specification, send in a PR about it. If you are able, figure out how to fix it and include a patch in the PR. If you think the standard is wrong, ask the standards body to consider the question.
es: Obtén copias de estándares formales como POSIX(R). Compara el comportamiento de FreeBSD con el requerido por el estándar. Si el comportamiento difiere, en particular en casos esquina y sutiles de la especificación, envía un PR acerca de ello. Si puedes, intenta averiguar cómo arreglarlo e incluye un parche en el PR. Si crees que el estándar está equivocado, pregunta al comité del estándar para que consideren la cuestión.
pt_br: Obtenha cópias dos padrões formais, como o POSIX(R). Compare o comportamento do FreeBSD com o exigido pelo padrão. Se o comportamento for diferente, especialmente em cantos sutis ou obscuros da especificação, envie um PR sobre isso. Se puder, descubra como corrigi-lo e inclua um patch no PR. Se achar que o padrão está errado, peça ao organismo responsável pelos padrões para considerar a questão.

source: Suggest further tasks for this list!
es: ¡Sugiere nuevas tareas para esta lista!
pt_br: Sugira novas tarefas para esta lista!
ru: Предложите дополнительные задачи для этого списка!

source: Work through the PR Database
es: Trabaja en la base de datos de PR
pt_br: Trabalhe no Banco de Dados de PR (Relatório de Problema) do FreeBSD
ru: Пройдитесь по базе данных PR
