Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributing/_index.po
Languages: es, pt_br, ru

source: If you have not responded after 14 days, any committer may commit from a PR that you have not responded to via a `maintainer-timeout`.
es: Si no has respondido en 14 días, cualquier committer mediante un `maintainer-timeout` puede hacer commit desde un PR al que no hayas respondido.
pt_br: Se você não respondeu após 14 dias, qualquer committer pode fazer o commit de um PR que você não respondeu através de um `maintainer-timeout`.
ru: Если вы не ответили в течение 14 дней, любой коммиттер может выполнить коммит из PR, на который вы не ответили, используя `maintainer-timeout`.

source: If the person reporting the bug has not also provided a fix, you need to collect the information that will allow you to generate one.
es: Si la persona que informó del error no ha proporcionado una solución es tu obligación recopilar la suficiente información para proporcionar una.
pt_br: Se a pessoa que reportou o bug também não forneceu uma correção, você precisa coletar as informações que permitirão gerar uma correção.
ru: Если человек, сообщивший об ошибке, также не предоставил исправление, вам необходимо собрать информацию, которая позволит вам создать исправление.

source: If the bug is reproducible, you can collect most of the required information yourself. If not, ask the person who reported the bug to collect the information for you, such as:
es: Si puedes reproducir el error podrás recoger la mayor parte de la información que necesitas. Si esto no es posible solicita a la persona que reportó el error que te proporcione la siguiente información:
pt_br: Se o erro puder ser reproduzido, você pode coletar a maioria das informações necessárias por conta própria. Caso contrário, peça para a pessoa que relatou o erro coletar as informações para você, como:
ru: Если ошибка воспроизводима, вы можете собрать большую часть необходимой информации самостоятельно. Если нет, попросите человека, сообщившего об ошибке, собрать информацию для вас, например:

source: A detailed description of their actions, expected program behavior and actual behavior
es: Una descripción detallada de sus acciones, comportamiento esperado del programa y comportamiento real
pt_br: Uma descrição detalhada das ações realizadas, comportamento esperado do programa e comportamento atual
ru: Подробное описание их действий, ожидаемого поведения программы и фактического поведения

source: Copies of input data used to trigger the bug
es: Una copia de los datos de entrada que producen el error
pt_br: Cópias dos dados de entrada usados para acionar o bug
ru: Копии входных данных, использованных для выявления ошибки

source: Information about their build and execution environment - for example, a list of installed packages and the output of man:env[1]
es: Información acerca de su entorno de ejecución y compilación - por ejemplo, una lista de paquetes instalados y la salida de man:env[1]
pt_br: Informações sobre o ambiente de compilação e execução - por exemplo, uma lista de pacotes instalados e a saída de man:env[1]
ru: Информация о среде сборки и выполнения — например, список установленных пакетов и вывод команды man:env[1]

source: Eliminate incorrect reports
es: Eliminar informes incorrectos
pt_br: Elimine os relatórios incorretos
ru: Устраните некорректные отчеты

source: Some bug reports may be incorrect. For example, the user may have simply misused the program; or their installed packages may be out of date and require updating. Sometimes a reported bug is not specific to FreeBSD. In this case report the bug to the upstream developers. If the bug is within your capabilities to fix, you can also patch the port so that the fix is applied before the next upstream release.
es: Algunos informes de error pueden ser incorrectos. Por ejemplo el usuario podría simplemente haber usado mal el programa, o los paquetes que tiene instalados pueden estar desactualizados y necesitan actualizarse. Algunas veces un error reportado no es específico de FreeBSD. En este caso informa del error a los desarrolladores originales del software. Si puedes corregir el error también puedes aplicar el parche al port para que se aplique antes de la próxima versión original.
pt_br: Algumas notificações de bugs podem estar incorretas. Por exemplo, o usuário pode ter simplesmente utilizado o programa de forma inadequada ou seus pacotes instalados podem estar desatualizados e precisarem ser atualizados. Às vezes, um bug reportado não é específico do FreeBSD. Nesse caso, reporte o bug para os desenvolvedores upstream. Se o bug estiver dentro de suas capacidades de corrigir, você também pode corrigir o port para que a correção seja aplicada antes do próximo release upstream.
ru: Некоторые отчеты об ошибках могут быть некорректными. Например, пользователь мог просто неправильно использовать программу; или установленные пакеты могут быть устаревшими и требовать обновления. Иногда сообщаемая ошибка не специфична для FreeBSD. В этом случае следует сообщить об ошибке разработчикам вышестоящего проекта. Если ошибка находится в пределах ваших возможностей для исправления, вы также можете исправить порт, чтобы исправление было применено до следующего релиза вышестоящего проекта.

source: Find a solution
es: Encontrar una solución
pt_br: Encontre uma solução
ru: Найдите решение

source: As with build errors, you will need to sort out a fix to the problem. Again, remember to ask if you are stuck!
es: Al igual que sucede con los errores de compilación tu tarea es encontrar una solución al problema. Una vez más, ¡recuerda preguntar si te atascas!
pt_br: Tal como acontece com erros de compilação, você precisará encontrar uma correção para o problema. Mais uma vez, lembre-se de perguntar se você estiver emperrado!
ru: Как и с ошибками сборки, вам потребуется найти решение проблемы. И снова, не забывайте спросить, если застряли!

source: Submit or approve changes
es: Enviar o aprobar cambios
pt_br: Envie ou aprove alterações
ru: Представить или утвердить изменения

source: Just as with updating a port, you should now incorporate changes, review and test, and submit your changes in a PR (or send a follow-up if a PR already exists for the problem). If another user has submitted changes in the PR, you can also send a follow-up saying whether or not you approve the changes.
es: Al igual que sucede con la actualización de un port debes incorporar los cambios, revisar, probar y enviar tus cambios en un PR (o hacer un seguimiento si ya existe un PR para el problema). Si otro usuario ha enviado cambios en el PR también puedes enviar un seguimiento diciendo si apruebas o no los cambios.
pt_br: Assim como na atualização de um port, você deve incorporar as mudanças, revisar e testar e enviar suas mudanças em um PR (ou enviar um acompanhamento se já existir um PR para o problema). Se outro usuário tiver enviado mudanças no PR, você também pode enviar um acompanhamento dizendo se aprova ou não as mudanças.
ru: Как и при обновлении порта, теперь вам следует внести изменения, проверить и протестировать их, а затем отправить изменения в PR (или отправить дополнение, если PR для данной проблемы уже существует). Если другой пользователь отправил изменения в PR, вы также можете отправить дополнение, указав, одобряете ли вы эти изменения или нет.

source: Providing support
es: Proporcionar ayuda
pt_br: Forneça Suporte
ru: Предоставление поддержки

source: Part of being a maintainer is providing support - not for the software in general - but for the port and any FreeBSD-specific quirks and problems. Users may contact you with questions, suggestions, problems and patches. Most of the time their correspondence will be specific to FreeBSD.
es: Parte de las funciones de un maintainer es proporcionar soporte, no para el software en general sino para el port y las peculiaridades y problemas específicos de FreeBSD. Los usuarios pueden contactarte con preguntas, sugerencias, problemas y parches. La mayoría de las veces serán para asuntos específicos de FreeBSD.
pt_br: Parte de ser um mantenedor é fornecer suporte - não para o software em geral - mas para o port e quaisquer peculiaridades e problemas específicos do FreeBSD. Os usuários podem entrar em contato com você com perguntas, sugestões, problemas e patches. Na maioria das vezes, a correspondência deles será específica para o FreeBSD.
ru: Часть обязанностей сопровождающего заключается в предоставлении поддержки — не для программного обеспечения в целом, а для порта и любых особенностей и проблем, специфичных для FreeBSD. Пользователи могут обращаться к вам с вопросами, предложениями, проблемами и патчами. В большинстве случаев их обращение будет касаться именно FreeBSD.

source: Occasionally you may have to invoke your skills in diplomacy, and kindly point users seeking general support to the appropriate resources. Less frequently you will encounter a person asking why the `RPMS` are not up to date or how can they get the software to run under Foo Linux. Take the opportunity to tell them that your port is up to date (if it is, of course!), and suggest that they try FreeBSD.
es: Puede que ocasionalmente tenga que usar sus habilidades diplomáticas y dirigir amablemente a los usuarios que buscan asistencia técnica hacia los recursos apropiados. Alguna que otra vez te encontrarás con que alguien te preguntará que por qué los `RPM`s no están actualizados o qué hay que hacer para ejecutar tal software en tal o cual distribución de Linux. Aprovecha la oportunidad para decirle que tu port está actualizado (si ese es el caso, claro). Y sugiérele que pruebe FreeBSD.
pt_br: Ocasionalmente, você pode ter que invocar suas habilidades em diplomacia e gentilmente direcionar usuários que buscam suporte geral para os recursos apropriados. Com menos frequência, você encontrará alguém perguntando por que os `RPMS` não estão atualizados ou como eles podem fazer o software rodar no Foo Linux. Aproveite a oportunidade para dizer que seu port está atualizado (se estiver, é claro!) e sugira que eles experimentem o FreeBSD.
ru: Время от времени вам может понадобиться проявить дипломатические навыки и вежливо направить пользователей, ищущих общую поддержку, к соответствующим ресурсам. Реже вы столкнётесь с людьми, спрашивающими, почему `RPMS` не обновлены или как запустить программное обеспечение под Foo Linux. Воспользуйтесь возможностью сообщить им, что ваш порт актуален (если это так, конечно!), и предложите попробовать FreeBSD.

source: Sometimes users and developers will decide that you are a busy person whose time is valuable and do some of the work for you. For example, they might:
es: A veces, los usuarios y desarrolladores decidirán que eres una persona ocupada cuyo tiempo es valioso y harán parte del trabajo por ti. Por ejemplo, podrían:
pt_br: Às vezes, os usuários e os desenvolvedores podem decidir que você é uma pessoa ocupada cujo tempo é valioso e farão parte do trabalho para você. Por exemplo, eles podem:
ru: Иногда пользователи и разработчики решают, что вы занятой человек, чьё время ценно, и выполняют часть работы за вас. Например, они могут:

source: submit a PR or send you patches to update your port,
es: enviar un PR o enviarle parches para actualizar tu port
pt_br: enviar um PR ou lhe enviar patches para atualizar o seu port,
ru: отправить PR или прислать свои патчи для обновления вашего порта,

source: investigate and perhaps provide a fix to a PR, or
es: investigar y tal vez proporcionar una solución a un PR o
pt_br: investigar e talvez fornecer uma correção para um PR, ou
ru: исследовать и, возможно, предоставить исправление для PR, или

source: otherwise submit changes to your port.
es: incluso enviar cambios para tu port.
pt_br: caso contrário, enviar alterações para o seu port.
ru: иначе отправить изменения в ваш порт.

source: In these cases your main obligation is to respond in a timely manner. Again, the timeout for non-responsive maintainers is 14 days. After this period changes may be committed unapproved. They have taken the trouble to do this for you; so please try to at least respond promptly. Then review, approve, modify or discuss their changes with them as soon as possible.
es: En estos casos tu obligación principal es responder rápidamente. Una vez más, el tiempo de espera para los maintainers es de 14 días. Después de este período se puede realizar el commit sin aprobación. Se han tomado la molestia de hacerlo por ti, así que por lo menos intenta responder lo más rápido posible. Hecho esto, revisa, aprueba, modifica o discute los cambios con ellos lo antes posible.
pt_br: Nesses casos, sua principal obrigação é responder de forma rápida. Novamente, o prazo para mantenedores não responsivos é de 14 dias. Após esse período, as alterações podem ser realizadas sem aprovação. Eles fizeram o esforço para ajudá-lo, então tente pelo menos responder prontamente. Em seguida, revise, aprove, modifique ou discuta as alterações com eles o mais rápido possível.
ru: В этих случаях ваша основная обязанность — своевременно отвечать. Напоминаем, что срок ожидания ответа от сопровождающего составляет 14 дней. По истечении этого периода изменения могут быть зафиксированы без одобрения. Они потрудились сделать это за вас; пожалуйста, постарайтесь хотя бы оперативно ответить. Затем как можно скорее проверьте, одобрите, измените или обсудите их изменения с ними.

source: If you can make them feel that their contribution is appreciated (and it should be) you will have a better chance persuading them to do more things for you in the future :-).
es: Si puede hacerles saber que su contribución no cae en saco roto (y así debería ser) será posible que le ayuden en otras ocasiones más adelante :-).
pt_br: Se você puder fazê-los sentir que a contribuição deles é apreciada (e deveria ser), você terá uma chance maior de persuadi-los a fazer mais coisas para você no futuro :-).
ru: Если вы сможете дать им почувствовать, что их вклад ценится (а так и должно быть), у вас будет больше шансов убедить их сделать для вас больше в будущем :-).

source: Finding and fixing a broken port
es: Encontrar y arreglar un port roto
pt_br: Encontre e conserte um port quebrado
ru: Поиск и исправление сломанного порта

source: There are some really good places to find a port that needs some attention.
es: Hay algunos lugares realmente buenos para encontrar un port que necesite atención.
pt_br: Existem alguns bons lugares para encontrar um port que precisa de atenção.
ru: Есть несколько хороших мест, где можно найти порт, требующий внимания.

source: You can use the https://bugs.freebsd.org/search[web interface] to the Problem Report database to search through and view unresolved PRs. The majority of ports PRs are updates, but with a little searching and skimming over synopses you should be able to find something interesting to work on (the `sw-bug` class is a good place to start).
es: Puedes utilizar el https://bugs.freebsd.org/search[interfaz web] de la base de datos de Informes de Error para buscar y ver PRs sin resolver. La mayoría de los PRs de ports son actualizaciones, pero con una pequeña búsqueda y echando un vistazo a las sinopsis deberías ser capaz de encontrar algo interesante en lo que trabajar (la clase `sw-bug` es un buen sitio para empezar).
pt_br: Você pode usar a https://bugs.freebsd.org/search[interface web] do banco de dados de Relatórios de Problemas para pesquisar e visualizar relatórios de problemas não resolvidos. A maioria dos relatórios de problemas para os ports são atualizações, mas com uma pequena busca e leitura das sinopses você deverá ser capaz de encontrar algo interessante para trabalhar (a classe `sw-bug` é um bom lugar para começar).

source: https://portsfallout.com/[PortsFallout] shows port issues gathered from the FreeBSD package building.
es: https://portsfallout.com/[PortsFallout] muestra problemas con los ports recogidos de la construcción de paquetes de FreeBSD.
pt_br: O https://portsfallout.com/[PortsFallout] mostra problemas de ports coletados durante a compilação de pacotes no FreeBSD.
ru: https://portsfallout.com/[PortsFallout] отображает проблемы с портами, собранные при сборке пакетов FreeBSD.

source: It is OK to send changes for a maintained port as well, but remember to ask the maintainer in case they are already working on the problem.
es: Está bien mandar cambios para un port que está mantenido, pero recuerda preguntar al mantainer en caso de que ya esté trabajando en el problema.
pt_br: Também é OK enviar alterações para um port que possui um mantenedor, mas lembre-se de perguntar ao mantenedor no caso de já estarem trabalhando no problema.
ru: Допустимо отправлять изменения и для поддерживаемого порта, но не забудьте уточнить у сопровождающего, не работает ли он уже над этой проблемой.

source: Once you have found a bug or problem, collect information, investigate and fix! If there is an existing PR, follow up to that. Otherwise create a new PR. Your changes will be reviewed and, if everything checks out, committed.
es: Una vez que hayas encontrado un error o problema recopila información, investiga y arréglalo. Si ya existe un PR haz seguimiento del PR. Si no existe un PR créalo. Tus cambios serán revisados. Si son correctos serán aceptados y se hará el commit.
pt_br: Depois de encontrar um bug ou problema, colete informações, investigue e corrija! Se houver um PR existente, faça um follow-up nela. Caso contrário, crie um novo PR. Suas alterações serão revisadas e, se tudo estiver correto, serão comitadas.
ru: Как только вы обнаружили ошибку или проблему, соберите информацию, изучите её и исправьте! Если уже существует PR, продолжите работу с ним. В противном случае создайте новый PR. Ваши изменения будут проверены и, если всё в порядке, приняты.

source: When to call it quits
es: Cuándo dejarlo
pt_br: Quando desistir
ru: Как прекратить сопровождение

source: As your interests and commitments change, you may find that you no longer have time to continue some (or all) of your ports contributions. That is fine! Please let us know if you are no longer using a port or have otherwise lost time or interest in being a maintainer. In this way we can go ahead and allow other people to try to work on existing problems with the port without waiting for your response. Remember, FreeBSD is a volunteer project, so if maintaining a port is no fun any more, it is probably time to let someone else do it!
es: Conforme tus intereses y compromisos cambian, podrías encontrar que ya no tienes tiempo para continuar con algunas (o todas) de tus contribuciones a los ports. ¡Está bien! Por favor haznos saber si ya no utilizas un port o si ya no tienes tiempo o has perdido el interés en ser maintainer. De este modo podemos avanzar y permitir que otra gente trabaje en los problemas que existan con el port sin esperar a tu respuesta. Recuerda, FreeBSD es un proyecto voluntario, así que si mantener un port ya no es divertido, ¡probablemente es hora de permitir que otros lo hagan!
pt_br: À medida que seus interesses e compromissos mudam, você pode descobrir que não tem mais tempo para continuar com algumas (ou todas) as suas contribuições para a coleção de ports. Tudo bem! Por favor, nos avise se você não estiver mais usando um port ou se não tiver mais tempo ou interesse em ser um mantenedor. Desta forma, podemos seguir em frente e permitir que outras pessoas tentem trabalhar nos problemas existentes com o port sem termos que esperar por sua resposta. Lembre-se, o FreeBSD é um projeto voluntário, então se a manutenção de um port não for mais divertida, provavelmente é hora de deixar alguém fazer isso!
ru: По мере изменения ваших интересов и обязательств вы можете обнаружить, что у вас больше нет времени продолжать некоторые (или все) ваши вклады в порты. Это нормально! Пожалуйста, сообщите нам, если вы больше не используете порт или у вас нет времени или интереса продолжать быть его сопровождающим. Таким образом, мы сможем позволить другим людям попытаться решить существующие проблемы с портом, не дожидаясь вашего ответа. Помните, FreeBSD — это добровольный проект, поэтому если сопровождение порта больше не приносит удовольствия, вероятно, пришло время позволить кому-то другому заняться этим!

source: In any case, the Ports Management Team (`portmgr`) reserves the right to reset your maintainership if you have not actively maintained your port in some time. (Currently, this is set to 3 months.) By this, we mean that there are unresolved problems or pending updates that have not been worked on during that time.
es: En cualquier caso, el Ports Management Team (`portmgr`) se reserva el derecho a revocar tu estatus de maintainer si no has mantenido activamente su port durante un cierto periodo de tiempo. (Actualmente, este periodo se establece en 3 meses). Con esto, queremos decir que haya problemas no resueltos o actualizaciones pendientes que no hayan sido abordadas durante este periodo.
pt_br: Em qualquer caso, a equipe de gerenciamento de ports (`portmgr`) se reserva o direito de redefinir sua posição de mantenedor se você não mantiver ativamente seu port por algum tempo. (Atualmente, este tempo é de 3 meses.) Com isso, queremos dizer que existem problemas não resolvidos ou atualizações pendentes que não foram trabalhadas durante esse tempo.
ru: В любом случае, команда управления портами (`portmgr`) оставляет за собой право сбросить ваше право сопровождения, если вы не поддерживали свой порт в течение некоторого времени. (В настоящее время этот срок установлен в 3 месяца.) Под этим подразумевается, что есть нерешенные проблемы или ожидающие обновления, над которыми не велась работа в течение этого времени.

source: Resources for ports maintainers and contributors
es: Recursos para maintainers y colaboradores de los ports
pt_br: Recursos para mantenedores de ports e contribuidores
ru: Ресурсы для сопровождающих и участников портов

source: The extref:{porters-handbook}[Porter's Handbook] is your hitchhiker's guide to the ports system. Keep it handy!
es: El extref:{porters-handbook}[Porter's Handbook] es tu guía del autoestopista para el sistema de ports. ¡Mantenlo a mano!
pt_br: O extref:{porters-handbook}[Handbook do Mantenedor de Ports] é o seu guia do sistema de ports. Mantenha-o sempre à mão!

source: extref:{problem-reports}[Writing FreeBSD Problem Reports] describes how to best formulate and submit a PR. In 2005 more than eleven thousand ports PRs were submitted! Following this article will greatly assist us in reducing the time needed to handle your PRs.
es: extref:{problem-reports}[Writing FreeBSD Problem Reports] describe como formular y enviar PRs de la mejor forma. ¡En 2005 se enviaron más de once mil PRs de ports! Seguir este artículo nos ayudará a reducir el tiempo necesario para tratar tus PRs.
pt_br: o artigo extref:{problem-reports}[Escrevendo Relatórios de Problemas do FreeBSD] descreve como formular e submeter um PR da melhor maneira possível. Em 2005, mais de onze mil PRs de ports foram submetidos! Seguir este artigo ajudará muito a reduzir o tempo necessário para lidar com seus PRs.
ru: Статья extref:{problem-reports}[Составление сообщений о проблеме во FreeBSD] описывает, как лучше всего сформулировать и отправить PR. В 2005 году было подано более одиннадцати тысяч PR для портов! Следование этой статье значительно поможет нам сократить время, необходимое для обработки ваших PR.

source: The https://bugs.freebsd.org/bugzilla/query.cgi[Problem Report database].
es: La https://bugs.freebsd.org/bugzilla/query.cgi[base de datos de Informes de Error].
pt_br: O https://bugs.freebsd.org/bugzilla/query.cgi[banco de dados de Relatórios de Problemas].
ru: https://bugs.freebsd.org/bugzilla/query.cgi[База данных отчетов о проблемах].
