Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributing/_index.po
Languages: es, pt_br, ru

source: Unmaintained ports have their `MAINTAINER` set to `ports@FreeBSD.org`. Many unmaintained ports can have pending updates, this can be seen at the https://portscout.freebsd.org/ports@freebsd.org.html[FreeBSD Ports distfile scanner].
es: Los ports sin mantener tienen su variable `MAINTAINER` establecida a `ports@FreeBSD.org`. Muchos ports no mantenidos pueden tener actualizaciones pendientes, esto se puede ver en el https://portscout.freebsd.org/ports@freebsd.org.html[FreeBSD Ports distfile scanner].
pt_br: Os ports não mantidos têm seu campo `MAINTAINER` definido como `ports@FreeBSD.org`. Muitos ports não mantidos podem ter atualizações pendentes, que podem ser vistas no https://portscout.freebsd.org/ports@freebsd.org.html[scanner de arquivos de distribuição dos Ports do FreeBSD].
ru: Неподдерживаемые порты имеют параметр `MAINTAINER`, установленный в `ports@FreeBSD.org`. Многие неподдерживаемые порты могут иметь ожидающие обновления, это можно увидеть на https://portscout.freebsd.org/ports@freebsd.org.html[сканере дистрибутивных файлов портов FreeBSD].

source: On https://portsfallout.com/fallout?port=&maintainer=ports%40FreeBSD.org[PortsFallout] can be seen a list of unmaintained ports with errors.
es: En https://portsfallout.com/fallout?port=&maintainer=ports%40FreeBSD.org[PortsFallout] se puede ver una lista de ports no mantenidos con errores.
pt_br: Em https://portsfallout.com/fallout?port=&maintainer=ports%40FreeBSD.org[PortsFallout], pode ser vista uma lista de ports sem manutenção com erros.
ru: На https://portsfallout.com/fallout?port=&maintainer=ports%40FreeBSD.org[PortsFallout] можно увидеть список неподдерживаемых портов с ошибками.

source: Some ports affect a large number of others due to dependencies and slave port relationships. Generally, we want people to have some experience before they maintain such ports.
es: Algunos ports afectan a muchos otros debido a las dependencias y las relaciones con los ports que dependan de ellos. En general, esperamos que las personas tengan algo de experiencia antes de ofrecerse voluntariamente para mantener dichos ports.
pt_br: Alguns ports afetam um grande número de outros devido a dependências e relacionamentos de ports escravos. Geralmente, esperamos que as pessoas tenham alguma experiência antes de se voluntariarem para manter tais ports.

source: You can find out whether or not a port has dependencies or slave ports by looking at a master index of ports called [.filename]#INDEX#. (The name of the file varies by release of FreeBSD; for instance, [.filename]#INDEX-8#.) Some ports have conditional dependencies that are not included in a default [.filename]#INDEX# build. We expect you to be able to recognize such ports by looking through other ports' [.filename]#Makefile#'s.
es: Puede comprobar si un port tiene o no dependencias o si otros puertos depende de él consultando el índice maestro de ports, [.filename]#INDEX#.. (El nombre del archivo varía según la versión de FreeBSD; por ejemplo, [.filename]#INDEX#. Algunos ports tienen dependencias condicionales que no están incluidas en la compilación predeterminada de [.filename]#INDEX#. Esperamos que pueda reconocer dichos ports analizando el archivo [.filename]#Makefile# de otros ports.
pt_br: Você pode descobrir se um port possui dependências ou ports dependentes olhando para o índice mestre de ports chamado [.filename]#INDEX#. (O nome do arquivo varia de acordo com a versão do FreeBSD; por exemplo, [.filename]#INDEX-8#). Alguns ports têm dependências condicionais que não são incluídas em uma compilação padrão do [.filename]#INDEX#. Esperamos que você seja capaz de reconhecer esses ports através da análise dos [.filename]#Makefile# de outros ports.

source: How to adopt the port
es: Cómo adoptar un port
pt_br: Como adotar um port
ru: Как принять сопровождение порта

source: First make sure you understand your <<maintain-port>>. Also read the extref:{porters-handbook}[Porter's Handbook]. _Please do not commit yourself to more than you feel you can comfortably handle._
es: Primero asegúrate de que entiendes tu <<maintain-port>>. También lee el extref:{porters-handbook}[Porter's Handbook]. _Por favor no te comprometas a más de lo que te sientes cómodo de manejar._
pt_br: Primeiro, certifique-se de entender <<maintain-port>>. Também leia o <<porters-handbook>>. _Por favor, não se comprometa com mais do que você sente que pode lidar confortavelmente._

source: You may request maintainership of any unmaintained port as soon as you wish. Simply set `MAINTAINER` to your own email address and send a PR (Problem Report) with the change. If the port has build errors or needs updating, you may wish to include any other changes in the same PR. This will help because many committers are less willing to assign maintainership to someone who does not have a known track record with FreeBSD. Submitting PRs that fix build errors or update ports are the best ways to establish one.
es: Puede solicitar el mantenimiento de cualquier port que esté sin mantenimiento cuando lo desee. Simplemente configure el parámetro `MAINTAINER` con su propia dirección de correo electrónico y envíe un PR (informe de problemas) con el cambio. Si el port tiene errores de compilación o necesita actualizarse, es posible que desee aprovechar la oportunidad para incluir cualquier otro cambio que se requiera en ese mismo PR. Esto acelerará el proceso, ya que muchos committers no están dispuestos a asignar la responsabilidad del mantenimiento del port a alguien que no tenga un historial de trabajo con FreeBSD. La mejor forma de crear un historial de trabajo es enviando PRs corrigiendo errores de compilación o actualizando ports.
pt_br: Você pode solicitar a manutenção de qualquer port não mantido assim que desejar. Basta definir `MAINTAINER` para o seu próprio endereço de e-mail e enviar um PR (Relatório de Problema) com a alteração. Se o port tiver erros de compilação ou precisar ser atualizado, talvez você queira incluir outras alterações no mesmo PR. Isso ajudará porque muitos committers estão menos dispostos a atribuir a manutenção a alguém que não tem um histórico conhecido com o FreeBSD. Enviar PRs que corrijam erros de compilação ou atualizem os ports são as melhores maneiras de estabelecer um histórico.
ru: Вы можете запросить статус сопровождающего для любого неподдерживаемого порта, как только пожелаете. Просто установите `MAINTAINER` на ваш собственный адрес электронной почты и отправьте PR (Problem Report) с этим изменением. Если порт имеет ошибки сборки или нуждается в обновлении, вы можете включить другие изменения в тот же PR. Это поможет, поскольку многие коммиттеры менее склонны назначать сопровождающего тому, у кого нет известной истории работы с FreeBSD. Отправка PR, исправляющих ошибки сборки или обновляющих порты, — лучший способ её установить.

source: File your PR with category `ports` and class `change-request`. A committer will examine your PR, commit the changes, and finally close the PR. Sometimes this process can take a little while (committers are volunteers, too :).
es: Envíe su PR a la categoría `ports`y utilice la clase `change-request`. Un committer revisará su PR, commiteará los cambios y finalmente cerrará el PR. En algunas ocasiones, este proceso puede llevar cierto tiempo (los committers también son voluntarios :).
pt_br: Envie seu PR com a categoria `ports` e a classe `change-request`. Um committer examinará seu PR, confirmará as alterações e, por fim, fechará o PR. Às vezes, esse processo pode levar um pouco de tempo (os committers também são voluntários :).

source: The challenge for port maintainers
es: El desafío para los maintainers de un port
pt_br: O desafio para os mantenedores de ports
ru: Задача для сопровождающих портов

source: This section will give you an idea of why ports need to be maintained and outline the responsibilities of a port maintainer.
es: Esta sección le dará una visión general de por qué los ports deben mantenerse y describirá las responsabilidades de un maintainer de port.
pt_br: Esta seção lhe dará uma ideia do motivo pelo qual os ports precisam ser mantidos e esboçará as responsabilidades de um mantenedor de port.
ru: В этом разделе вы узнаете, зачем нужно поддерживать порты, а также ознакомитесь с обязанностями сопровождающего портов.

source: Why ports require maintenance
es: Por qué los ports requieren mantenimiento
pt_br: Por que um port requer manutenção
ru: Почему порты требуют обслуживания

source: Creating a port is a once-off task. Ensuring that a port is up to date and continues to build and run requires an ongoing maintenance effort. Maintainers are the people who dedicate some of their time to meeting these goals.
es: Crear un port es una tarea que se realiza una vez. Pero asegurar que un port esté siempre actualizado y continúe compilándose y ejecutándose correctamente requiere de un esfuerzo de mantenimiento continuo. Los Maintainers son las personas que dedican parte de su tiempo a cumplir estos objetivos.
pt_br: Criar um port é uma tarefa única. Garantir que um port esteja atualizado e continue a ser compilado e executado requer um esforço contínuo de manutenção. Os mantenedores são as pessoas que dedicam parte do seu tempo para atender a esses objetivos.
ru: Создание порта — это разовая задача. Обеспечение актуальности порта, его сборки и работы требует постоянных усилий по поддержке. Поддерживающие (maintainers) — это люди, которые посвящают часть своего времени достижению этих целей.

source: The foremost reason ports need maintenance is to bring the latest and greatest in third party software to the FreeBSD community. An additional challenge is to keep individual ports working within the Ports Collection framework as it evolves.
es: La razón principal por la que los ports necesitan mantenimiento es para disponga de las versiones más actualizadas y mejor software de terceros a la comunidad de FreeBSD. Un desafío adicional es mantener los ports para que continúen funcionando dentro del framework de la colección de ports a medida que este evoluciona.
pt_br: A razão mais importante pela qual os ports precisam de manutenção é para trazer o que há de mais recente e melhor em software de terceiros para a comunidade FreeBSD. Um desafio adicional é manter os ports individuais funcionando dentro do framework da Coleção de Ports à medida que ele evolui.
ru: Основная причина, по которой порты требуют обслуживания, — это предоставление новейших и лучших сторонних программных решений сообществу FreeBSD. Дополнительная задача — обеспечение работоспособности отдельных портов в рамках коллекции Ports по мере её развития.

source: As a maintainer, you will need to manage the following challenges:
es: Como maintainer deberá enfrentarse a los siguientes desafíos:
pt_br: Como mantenedor, você precisará gerenciar os seguintes desafios:
ru: Как сопровождающему, вам потребуется управлять следующими задачами:

source: *New software versions and updates.* New versions and updates of existing ported software become available all the time, and these need to be incorporated into the Ports Collection to provide up-to-date software.
es: *Nuevas versiones de software y actualizaciones.* Las nuevas versiones y actualizaciones de software están disponibles todo el tiempo para las aplicaciones que ya han sido portadas y deben incorporarse a la colección de ports para proporcionar un software actualizado.

source: *Changes to dependencies.* If significant changes are made to the dependencies of your port, it may need to be updated so that it will continue to work correctly.
es: *Cambios en las dependencias.* Si se realizan cambios significativos en las dependencias de tu port es posible que debas actualizarlas para que continúe funcionando correctamente.
pt_br: *Mudanças nas dependências.* Se houverem mudanças significativas nas dependências do seu port, pode ser necessário atualizá-lo para que continue a funcionar corretamente.

source: *Changes affecting dependent ports.* If other ports depend on a port that you maintain, changes to your port may require coordination with other maintainers.
es: *Cambios que afectan a los ports dependientes.* Si otros ports dependen de un port que tú mantienes, cambios en tu port podrían requerir coordinación con otros maintainers.
pt_br: *Mudanças que afetam ports dependentes.* Se outros ports dependem de um port que você mantém, as alterações no seu port podem exigir coordenação com outros mantenedores.

source: *Interaction with other users, maintainers and developers.* Part of being a maintainer is taking on a support role. You are not expected to provide general support (but we welcome it if you choose to do so). What you should provide is a point of coordination for FreeBSD-specific issues regarding your ports.
es: *Interacción con otros usuarios, maintainers y desarrolladores.* Una parte de ser maintainer implica tener u rol de apoyo. No se espera de ti que proporciones suporte general (pero damos la bienvenida y escoges hacerlo). Lo que deberías proporcionar es un punto de coordinación para problemas específicos de FreeBSD que atañen a tus ports.
pt_br: *Interatividade com outros usuários, mantenedores e desenvolvedores.* Parte de ser um mantenedor é assumir um papel de suporte. Não se espera que você forneça suporte geral (mas você é bem vindo se você optar por fazê-lo). O que você deve fornecer é um ponto de coordenação para problemas específicos do FreeBSD relacionados aos seus ports.

source: *Bug hunting.* A port may be affected by bugs which are specific to FreeBSD. You will need to investigate, find, and fix these bugs when they are reported. Thoroughly testing a port to identify problems before they make their way into the Ports Collection is even better.
es: *Cazar bugs.* Un port puede verse afectado por errores específicos de FreeBSD. Deberá investigar, encontrar y corregir estos errores cuando sean reportados. Es mucho mejor probar meticulosamente un port para identificar todos sus potenciales problemas antes de añadirlo a la Colección de Ports.
pt_br: *Procura de bugs.* Um port pode ser afetado por bugs específicos do FreeBSD. Você precisará investigar, encontrar e corrigir esses bugs quando forem relatados. Testar minuciosamente um port para identificar problemas antes que eles sejam incluídos na Coleção de Ports é ainda melhor.

source: *Changes to ports infrastructure and policy.* Occasionally the systems that are used to build ports and packages are updated or a new recommendation affecting the infrastructure is made. You should be aware of these changes in case your ports are affected and require updating.
es: *Cambios en la política y la infraestructura de ports.* Ocasionalmente, los sistemas que se utilizan para compilar los ports y paquetes se actualizan o se hace una nueva recomendación que afecta a la infraestructura. Debes tener en cuenta estos cambios en caso de que tus ports se vean afectados y requieran de una actualización.
pt_br: *Mudanças na infraestrutura e políticas dos ports.* Às vezes, os sistemas usados para compilar ports e pacotes são atualizados ou uma nova recomendação que afeta a infraestrutura é feita. Você deve estar ciente dessas mudanças no caso de seus ports serem afetados e precisarem de atualização.

source: *Changes to the base system.* FreeBSD is under constant development. Changes to software, libraries, the kernel or even policy changes can cause flow-on change requirements to ports.
es: *Cambios en el sistema base.* FreeBSD está constantemente bajo desarrollo. Cambios en el software, librerías, el kernel o incluso cambios en las políticas pueden derivar en cambios en los requisitos de los ports.
pt_br: *Mudanças no sistema base.* O FreeBSD está em constante desenvolvimento. Mudanças no software, bibliotecas, kernel ou até mesmo mudanças de política podem causar a necessidade de alterações em cascata nos ports.

source: Maintainer responsibilities
es: Responsabilidades del maintainer
pt_br: Responsabilidades do mantenedor
ru: Обязанности сопровождающего

source: Keep your ports up to date
es: Mantén sus ports actualizados
pt_br: Mantenha seus ports atualizados
ru: Поддерживайте свои порты в актуальном состоянии

source: This section outlines the process to follow to keep your ports up to date.
es: Esta sección describe el proceso a seguir para mantener sus ports actualizados.
pt_br: Esta seção descreve o processo a ser seguido para manter seus ports atualizados.
ru: В этом разделе описаны шаги, которые необходимо выполнить, чтобы поддерживать ваши порты в актуальном состоянии.

source: This is an overview. More information about upgrading a port is available in the extref:{porters-handbook}[Porter's Handbook].
es: Esto es un resumen. Hay más información disponible acerca de cómo actualizar un port en el extref:{porters-handbook}[Porter's Handbook].
pt_br: Este é um resumo. Mais informações sobre atualização de um port estão disponíveis no extref:{porters-handbook}[Handbook do mantenedor de ports].
ru: Это общий обзор. Дополнительная информация об обновлении порта доступна в extref:{porters-handbook}[Руководстве FreeBSD по созданию портов].

source: Watch for updates
es: Mantente atento a las actualizaciones
pt_br: Preste atenção às atualizações
ru: Следите за обновлениями

source: Monitor the upstream vendor for new versions, updates and security fixes for the software. Announcement mailing lists or news web pages are useful for doing this. Sometimes users will contact you and ask when your port will be updated. If you are busy with other things or for any reason just cannot update it at the moment, ask if they will help you by submitting an update.
es: Monitoriza el desarrollo para estar al tanto de nuevas versiones, actualizaciones y correcciones de seguridad. Las listas de correo de anuncios o las páginas web de noticias son útiles para este propósito. En ocasiones los usuarios se pondrán en contacto contigo para preguntarte cuándo se actualizará tu port. Si estás ocupado con otras cosas o simplemente no puedes actualizarlo por alguna razón pregunta al usuario si puede ayudarte enviándote una actualización.
pt_br: Monitorar os fabricantes upstream em relação a liberação de novas versões, patches e correções de segurança para o software. Listas de discussão e de anúncios ou páginas web de noticias sobre o software são úteis para este propósito. Algumas vezes os usuários entrarão em contato com você perguntando quando seu port será atualizado. Se você estiver ocupado com outras atividades ou devido a qualquer outra razão não puder realizar a atualização naquele momento, pergunte se o usuário pode te ajudar enviando uma atualização.
ru: Отслеживайте у вышестоящего поставщика появление новых версий, обновлений и исправлений безопасности для программного обеспечения. Для этого полезны списки рассылки объявлений или новостные веб-страницы. Иногда пользователи могут связаться с вами и спросить, когда ваш порт будет обновлен. Если вы заняты другими делами или по какой-либо причине просто не можете обновить его в данный момент, спросите, могут ли они помочь вам, предоставив обновление.

source: You may also receive automated email from the `FreeBSD Ports Version Check` informing you that a newer version of your port's distfile is available. More information about that system (including how to stop future emails) will be provided in the message.
es: También puede recibir un correo electrónico automatizado de `FreeBSD Ports Version Check` informándole que ya hay una nueva versión disponible del distfile de su port. En el mensaje se incluirá más información (incluido el cómo dejar de recibir los correos electrónicos en el futuro).
pt_br: Você também pode receber e-mails automáticos do `FreeBSD Ports Version Check` informando que uma versão mais recente do arquivo de distribuição do seu port está disponível. Mais informações sobre esse sistema (incluindo como interromper futuros e-mails) serão fornecidas na mensagem.
ru: Вы также можете получать автоматические письма от `FreeBSD Ports Version Check`, уведомляющие о доступности новой версии дистрибутивного файла вашего порта. В сообщении будет предоставлена дополнительная информация об этой системе (включая инструкции по остановке будущих писем).

source: Incorporate changes
es: Incorporar cambios
pt_br: Incorporar mudanças
ru: Вносите изменения

source: When they become available, incorporate the changes into the port. You need to be able to generate a patch between the original port and your updated port.
es: Una vez que estén disponibles incorpora los cambios en el port. Es necesario generar un parche con las diferencias entre el port original y el port actualizado.
pt_br: Quando estiverem disponíveis, incorpore as alterações no port. Você precisa ser capaz de gerar um patch entre o port original e o seu port atualizado.
ru: Когда они станут доступны, включите изменения в порт. Вам нужно уметь создавать патч между оригинальным портом и вашим обновлённым портом.

source: Review and test
es: Revisar y probar
pt_br: Revisão e testes
ru: Проверяйте и тестируйте

source: Thoroughly review and test your changes:
es: Revisa y prueba a fondo sus cambios:
pt_br: Examine cuidadosamente e teste as suas mudanças:
ru: Тщательно проверьте и протестируйте свои изменения:

source: Build, install and test your port on as many platforms and architectures as you can. It is common for a port to work on one branch or platform and fail on another.
es: Compila, instala y prueba tu port en tantas plataformas y arquitecturas como puedas. Es común que un port funcione en una rama o plataforma y falle en otra.
pt_br: Compile, instale e teste seu port em quantas plataformas e arquiteturas puder. É comum um port funcionar em um branch ou plataforma e falhar em outro.

source: Make sure your port's dependencies are complete. The recommended way of doing this is by installing your own ports tinderbox. See <<resources>> for more information.
es: Asegúrate de que las dependencias de tu port están completas. El método recomendado para hacer esto es instalando tu propio tinderbox. Ver <<resources>> para más información.
pt_br: Certifique-se de que as dependências do seu port estejam completas. A maneira recomendada de fazer isso é instalando o seu próprio tinderbox. Consulte <<resources>> para obter mais informações.

source: Check that the packing list is up to date. This involves adding in any new files and directories and removing unused entries.
es: Compruebe que la lista de componentes del paquete esté actualizada. Esto implica añadir nuevos archivos y directorios, así como eliminar entradas no utilizadas.
pt_br: Verifique se a lista de pacotes está atualizada. Isso envolve adicionar quaisquer novos arquivos e diretórios e remover entradas não utilizadas.

source: Verify your port using man:portlint[1] as a guide. See <<resources>> for important information about using portlint.
es: Verifica tu port utilizando man:portlint[1] como guía. Ver <<resources>> para información importante acerca del uso de portlint.
pt_br: Verifique seu port usando o comando man:portlint[1] como guia. Consulte <<resources>> para obter informações importantes sobre o uso do portlint.
