Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/contributing/_index.po
Languages: es, pt_br, ru

source: Changes to the documentation are overseen by the {freebsd-doc}. Please look at the extref:{fdp-primer}[FreeBSD Documentation Project Primer] for complete instructions. Send submissions and changes (even small ones are welcome!) using the same method as any other bug report.
es: Los cambios en la documentación son revisados por {freebsd-doc}. Por favor, mira extref:{fdp-primer}[FreeBSD Documentation Project Primer] para las instrucciones completas. Envía cambios (¡incluso los pequeños son bienvenidos!) utilizando el mismo método que para cualquier otro informe de error.
pt_br: As mudanças na documentação são supervisionadas pelo {freebsd-doc}. Por favor, consulte o extref:{fdp-primer}[FreeBSD Documentation Project Primer] para obter instruções completas. Envie submissões e alterações (mesmo as pequenas são bem-vindas!) usando o mesmo método que qualquer outro relatório de bug.
ru: Изменения в документации контролируются {freebsd-doc}. Пожалуйста, ознакомьтесь с руководством extref:{fdp-primer}[Проект документации FreeBSD: введение для новых участников] для получения полных инструкций. Отправляйте исправления и изменения (даже небольшие правки приветствуются!) тем же способом, что и другие отчёты об ошибках.

source: Changes to Existing Source Code
es: Cambios en el código fuente ya existente
pt_br: Mudanças no Código Fonte Existente
ru: Изменения в существующем исходном коде

source: An addition or change to the existing source code is a somewhat trickier affair and depends a lot on how far out of date you are with the current state of FreeBSD development. There is a special on-going release of FreeBSD known as "FreeBSD-CURRENT" which is made available in a variety of ways for the convenience of developers working actively on the system. See extref:{handbook}[The FreeBSD Handbook, current-stable] for more information about getting and using FreeBSD-CURRENT.
es: Cambios y añadidos al código fuente existente es un asunto un poco más delicado y depende mucho de cómo de desactualizado te encuentres respecto al desarrollo actual de FreeBSD. Hay una versión especial de FreeBSD en curso denominada "FreeBSD-CURRENT" que está disponible de diversas formas para la conveniencia de los desarrolladores que trabajan activamente en el sistema. Ver See extref:{handbook}[The FreeBSD Handbook, current-stable] para más información acerca de cómo obtener y utilizar FreeBSD-CURRENT.
pt_br: Uma adição ou mudança no código-fonte existente é um assunto um pouco mais complicado e depende muito de quão desatualizado você está em relação ao estado atual do desenvolvimento do FreeBSD. Há uma versão especial em andamento do FreeBSD conhecida como "FreeBSD-CURRENT" que está disponível de várias maneiras para a conveniência de desenvolvedores que trabalham ativamente no sistema. Veja o extref:{handbook}[Handbook do FreeBSD, current-stable] para mais informações sobre como obter e usar o FreeBSD-CURRENT.
ru: Добавление или изменение существующего исходного кода — это несколько более сложная задача, которая во многом зависит от того, насколько сильно вы отстали от текущего состояния разработки FreeBSD. Существует специальная постоянно обновляемая версия FreeBSD, известная как "FreeBSD-CURRENT", которая доступна различными способами для удобства разработчиков, активно работающих над системой. Подробнее о получении и использовании FreeBSD-CURRENT можно узнать в extref:{handbook}[Руководстве FreeBSD, current-stable].

source: Working from older sources unfortunately means that your changes may sometimes be too obsolete or too divergent for easy re-integration into FreeBSD. Chances of this can be minimized somewhat by subscribing to the {freebsd-announce} and the {freebsd-current} lists, where discussions on the current state of the system take place.
es: Trabajar con fuentes antiguas significa desafortunadamente que tus cambios podrían estar obsoletos o ser demasiado divergentes como para reintegrarlos fácilmente en FreeBSD. Las posibilidades de que esto suceda se pueden minimizar algo suscribiéndose a las listas freebsd-announce} y {freebsd-current}, donde tienen lugar las discusiones sobre el estado actual del sistema.
pt_br: Trabalhar a partir de fontes mais antigos infelizmente significa que suas alterações às vezes podem ser muito obsoletas ou divergentes demais para uma reintegração fácil no FreeBSD. As chances disso podem ser minimizadas um pouco ao se inscrever nas listas {freebsd-announce} e {freebsd-current}, onde ocorrem discussões sobre o estado atual do sistema.
ru: Работа с устаревшими исходниками, к сожалению, означает, что ваши изменения иногда могут быть слишком устаревшими или слишком расходящимися для лёгкого повторного включения в FreeBSD. Шансы на это можно несколько уменьшить, подписавшись на списки рассылки {freebsd-announce} и {freebsd-current}, где обсуждается текущее состояние системы.

source: Assuming that you can manage to secure fairly up-to-date sources to base your changes on, the next step is to produce a set of diffs to send to the FreeBSD maintainers. This is done with the man:diff[1] command.
es: Asumiendo que puedes asegurarte unas fuentes actualizadas sobre la que basar tus cambios, el siguiente paso es producir un conjunto de diffs para enviárselos a los maintainers de FreeBSD. Esto se hace con el comando man:diff[1].
pt_br: Assumindo que você consegue obter fontes razoavelmente atualizadas para basear suas alterações, o próximo passo é produzir um conjunto de diffs para enviar aos mantenedores do FreeBSD. Isso é feito com o comando man:diff[1].
ru: Предполагая, что вам удалось получить достаточно актуальные исходные коды для внесения изменений, следующий шаг — создать набор различий (diff) для отправки сопровождающим FreeBSD. Это делается с помощью команды man:diff[1].

source: The preferred man:diff[1] format for submitting patches is the unified output format generated by `diff -u`.
es: El formato man:diff[1] preferido para enviar parches es el formato de salida unificada generado por `diff -u`.
pt_br: A preferência do formato man:diff[1] para envio de correções é o formato de saída unificada gerado pelo `diff -u`.
ru: Предпочтительным форматом man:diff[1] для отправки исправлений является унифицированный формат вывода, создаваемый командой `diff -u`.

source: or
es: o
pt_br: ou
ru: или

source: would generate a set of unified diffs for the given source file or directory hierarchy.
es: debería generar un conjunto de diffs unificados para el archivo de origen o la jerarquía de directorios.
pt_br: Iria gerar um conjunto de diffs unificados para o arquivo ou hierarquia de diretórios de origem fornecidos.
ru: сгенерирует набор унифицированных diff-файлов для указанного исходного файла или иерархии каталогов.

source: See man:diff[1] for more information.
es: Ver man:diff[1] para más información.
pt_br: Consulte man:diff[1] para obter mais informações.
ru: См. man:diff[1] для получения дополнительной информации.

source: Once you have a set of diffs (which you may test with the man:patch[1] command), you should submit them for inclusion with FreeBSD as a bug report. _Do not_ just send the diffs to the {freebsd-hackers} or they will get lost! We greatly appreciate your submission (this is a volunteer project!); because we are busy, we may not be able to address it immediately, but it will remain in the PR database until we do. Indicate your submission by including `[PATCH]` in the synopsis of the report.
es: Una vez que tienes un conjunto de diffs (los cuales puedes probar con el comando man:patch[1]), deberías enviarlos como un informe de error para su inclusión en FreeBSD. ¡_No envíes simplemente_ los diffs a {freebsd-hackers} o se perderán! Apreciamos enormemente tu envío (¡este es un proyecto voluntario!); debido a que estamos ocupados, quizás no podamos encargarnos de él inmediatamente pero permanecerá en la base de datos de PR hasta que lo hagamos. Señala tu envío incluyendo `[PATCH]` en la sinopsis del informe.
pt_br: Uma vez que você tem um conjunto de diffs (que você pode testar com o comando man:patch[1]), você deve enviá-los para inclusão no FreeBSD como um relatório de problema. _Não_ envie apenas os diffs para a {freebsd-hackers}, pois eles serão perdidos! Agradecemos muito sua contribuição (este é um projeto voluntário!); como estamos ocupados, pode ser que não consigamos lidar com isso imediatamente, mas ele permanecerá no banco de dados de PRs até que o façamos. Indique sua submissão incluindo `[PATCH]` no resumo do relatório.
ru: После того как у вас есть набор изменений (которые вы можете проверить с помощью команды man:patch[1]), вам следует отправить их для включения в FreeBSD в виде отчета об ошибке. _Не отправляйте_ изменения просто на {freebsd-hackers}, иначе они могут потеряться! Мы очень ценим ваши предложения (это добровольный проект!); поскольку мы заняты, мы не всегда можем обработать их сразу, но они останутся в базе данных PR, пока мы не дойдем до них. Укажите, что это предложение изменений, добавив `[PATCH]` в заголовок отчета.

source: If you feel it appropriate (e.g. you have added, deleted, or renamed files), bundle your changes into a `tar` file. Archives created with man:shar[1] are also welcome.
es: Si crees que es apropiado (ej: has añadido, borrado o renombrado ficheros), empaqueta tus cambios en un fichero `tar`. Los archivos creados con man:shar[1] también son bienvenidos.
pt_br: Se você achar apropriado (por exemplo, você adicionou, removeu ou renomeou arquivos), agrupe suas alterações em um arquivo `tar`. Arquivos criados com o comando man:shar[1] também são bem-vindos.

source: If your change is of a potentially sensitive nature, such as if you are unsure of copyright issues governing its further distribution then you should send it to {core-email} directly rather than submitting as a bug report. The {core-email} reaches a much smaller group of people who do much of the day-to-day work on FreeBSD. Note that this group is also _very busy_ and so you should only send mail to them where it is truly necessary.
es: Si sus cambios son delicados, por ejemplo, si no está seguro acerca de los problemas de derechos de autor que regirán su distribución en el futuro, envíelos directamente a {core-email} en lugar de enviarlo como un informe de error. El {core-email} es un grupo mucho más pequeño de gente que se encarga de muchas de las tareas diarias de administración del proyecto FreeBSD. Tenga en cuenta que este grupo también está _muy ocupado_ y, por lo tanto, solo debe enviarles correos cuando realmente sea necesario.
pt_br: Se a sua alteração for potencialmente sensível, como se você não tem certeza sobre questões de direitos autorais que regem a distribuição posterior, você deve enviá-la diretamente para {core-email} em vez de enviar como um relatório de bug. O {core-email} atinge um grupo muito menor de pessoas que fazem muito do trabalho diário no FreeBSD. Observe que esse grupo também é _muito ocupado_ e, portanto, você só deve enviar e-mails a eles quando for realmente necessário.
ru: Если ваше изменение носит потенциально чувствительный характер, например, если вы не уверены в вопросах авторского права, регулирующих его дальнейшее распространение, то вам следует отправить его напрямую по адресу {core-email}, а не подавать как отчёт об ошибке. Письмо на {core-email} достигает гораздо меньшей группы людей, которые выполняют большую часть повседневной работы над FreeBSD. Обратите внимание, что эта группа также _очень занята_, поэтому вам следует писать им только в случае действительной необходимости.

source: Please refer to man:intro[9] and man:style[9] for some information on coding style. We would appreciate it if you were at least aware of this information before submitting code.
es: Por favor consulta man:intro[9] y man:style[9] para más información sobre el estilo del código. Agradeceríamos si al menos fueras consciente de esta información antes de enviar código.
pt_br: Por favor, consulte man:intro[9] e man:style[9] para obter informações sobre o estilo de codificação. Agradecemos se você pelo menos estiver ciente dessas informações antes de enviar código.
ru: Пожалуйста, обратитесь к man:intro[9] и man:style[9] для получения информации о стиле написания кода. Мы будем признательны, если вы хотя бы ознакомитесь с этой информацией перед отправкой кода.

source: New Code or Major Value-Added Packages
es: Código nuevo o paquetes de gran valor añadido
pt_br: Código Novo ou Pacotes de Grande Valor Adicionado
ru: Новый код или основные пакеты с добавленной стоимостью

source: In the case of a significant contribution of a large body work, or the addition of an important new feature to FreeBSD, it becomes almost always necessary to either send changes as tar files or upload them to a web or FTP site for other people to access. If you do not have access to a web or FTP site, ask on an appropriate FreeBSD mailing list for someone to host the changes for you.
es: En el caso de una contribución significativa o de gran impacto, o si se trata de añadir una nueva característica importante a FreeBSD es necesario enviar los cambios comprimidos en un archivo tar o subirlos a un sitio web o FTP para que otras personas puedan acceder a ellos. Si no tiene acceso a un sitio web o FTP solicítelo en la lista de correo de FreeBSD más adecuada para que alguien busque un sitio para alojar los cambios.
pt_br: No caso de uma contribuição significativa de um grande volume de trabalho, ou a adição de um novo recurso importante ao FreeBSD, torna-se quase sempre necessário enviar as alterações como arquivos tar ou carregá-los em um website ou FTP para que outras pessoas possam acessá-los. Se você não tem acesso a um website ou FTP, peça em uma lista de discussão apropriada do FreeBSD para alguém hospedar as alterações para você.
ru: В случае значительного вклада в виде большого объёма работы или добавления важной новой функции в FreeBSD, почти всегда необходимо либо отправить изменения в виде tar-файлов, либо загрузить их на веб- или FTP-сайт для доступа других людей. Если у вас нет доступа к веб- или FTP-сайту, запросите на соответствующем списке рассылки FreeBSD, чтобы кто-то разместил изменения для вас.

source: When working with large amounts of code, the touchy subject of copyrights also invariably comes up. FreeBSD prefers free software licenses such as BSD or ISC. Copyleft licenses such as GPLv2 are sometimes permitted. The complete listing can be found on the link:https://www.FreeBSD.org/internal/software-license/[core team licensing policy] page.
es: Cuando se trabaja con grandes cantidades de código, indefectiblemente surge el espinoso asunto de los copyrights. FreeBSD prefiere licencias de software libre como BSD o ISC. Licencias copyleft como GPLv2 a veces también se permiten. La lista completa se puede encontrar en la página link:https://www.FreeBSD.org/internal/software-license/[core team licensing policy].
pt_br: Quando se trabalha com grandes quantidades de código, a questão delicada de direitos autorais inevitavelmente surge. O FreeBSD prefere licenças de software livre tais como BSD ou ISC. Licenças copyleft como GPLv2 às vezes são permitidas. A lista completa pode ser encontrada na página da link:https://www.FreeBSD.org/internal/software-license/[política de licenciamento do core team].
ru: При работе с большими объемами кода неизбежно возникает деликатная тема авторских прав. FreeBSD предпочитает свободные лицензии, такие как BSD или ISC. Копилефтные лицензии, например GPLv2, иногда допускаются. Полный список можно найти на странице link:https://www.FreeBSD.org/internal/software-license/[политики лицензирования основной команды].

source: Money or Hardware
es: Dinero o hardware
pt_br: Dinheiro ou Hardware
ru: Деньги или Оборудование

source: We are always very happy to accept donations to further the cause of the FreeBSD Project and, in a volunteer effort like ours, a little can go a long way! Donations of hardware are also very important to expanding our list of supported peripherals since we generally lack the funds to buy such items ourselves.
es: Estamos encantados de aceptar donaciones económicas para ayudar a impulsar el proyecto FreeBSD y, como en cualquier proyecto mantenido por voluntarios, ¡un poco puede significar mucho! También son importantes las donaciones de hardware para poder ampliar nuestra lista de hardware soportado, ya que generalmente no podemos permitirnos comprar estos artículos nosotros mismos.
pt_br: Estamos sempre muito felizes em receber doações para promover a causa do Projeto FreeBSD e, em um esforço voluntário como o nosso, um pouco pode fazer muita diferença! As doações de hardware também são muito importantes para expandir nossa lista de periféricos suportados, já que geralmente não temos fundos para comprar tais itens nós mesmos.
ru: Мы всегда рады пожертвованиям для поддержки проекта FreeBSD, и в добровольческих усилиях, подобных нашим, даже небольшая помощь может иметь большое значение! Пожертвования оборудования также очень важны для расширения списка поддерживаемых периферийных устройств, поскольку у нас обычно нет средств на их приобретение.

source: Donating Funds
es: Donar dinero
pt_br: Doando Dinheiro
ru: Пожертвование средств

source: The https://www.freebsdfoundation.org[FreeBSD Foundation] is a non-profit, tax-exempt foundation established to further the goals of the FreeBSD Project. As a 501(c)3 entity, the Foundation is generally exempt from US federal income tax as well as Colorado State income tax. Donations to a tax-exempt entity are often deductible from taxable federal income.
es: La https://www.freebsdfoundation.org[FreeBSD Foundation] es una fundación sin ánimo de lucro, exenta de impuestos creada para impulsar los objetivos del Proyecto FreeBSD. Como entidad 501(c)3, la Fundación está generalmente exenta de pagar impuestos federales en EE.UU. así como en el Estado de Colorado. Las donaciones a una entidad exenta de pagar impuestos normalmente se pueden deducir de la declaración de impuestos federal.
pt_br: A FreeBSD Foundation é uma fundação sem fins lucrativos e isenta de impostos, estabelecida para promover os objetivos do projeto FreeBSD. Como uma entidade 501(c)3, a fundação é geralmente isenta de imposto de renda federal dos EUA, bem como do imposto de renda estadual do Colorado. As doações para uma entidade isenta de impostos muitas vezes são dedutíveis do imposto de renda federal tributável.
ru: https://www.freebsdfoundation.org[FreeBSD Foundation] — это некоммерческий, освобожденный от налогов фонд, созданный для поддержки целей проекта FreeBSD. Как организация 501(c)3, Фонд, как правило, освобожден от федерального подоходного налога США, а также от подоходного налога штата Колорадо. Пожертвования освобожденным от налогов организациям часто вычитаются из налогооблагаемого федерального дохода.

source: Donations may be sent in check form to:
es: Las donaciones se pueden enviar en forma de cheque a:
pt_br: Doações podem ser enviadas em forma de cheque para:
ru: Пожертвования можно отправить в виде чека по адресу:

source: The FreeBSD Foundation is also able to accept https://www.freebsdfoundation.org/donate/[online donations] through various payment options.
es: La FreeBSD Foundation también acepta https://www.freebsdfoundation.org/donate/[donaciones online] mediante diversas opciones de pago.
pt_br: A FreeBSD Foundation também é capaz de receber https://www.freebsdfoundation.org/donate/[doações online] através de várias opções de pagamento.
ru: Фонд FreeBSD также принимает https://www.freebsdfoundation.org/donate/[онлайн-пожертвования] через различные варианты оплаты.

source: More information about the FreeBSD Foundation can be found in https://people.FreeBSD.org/~jdp/foundation/announcement.html[The FreeBSD Foundation -- an Introduction]. To contact the Foundation by email, write to mailto:info@FreeBSDFoundation.org[info@FreeBSDFoundation.org].
es: Se puede encontrar más información acerca de la FreeBSD Foundation en https://people.FreeBSD.org/~jdp/foundation/announcement.html[The FreeBSD Foundation -- an Introduction]. Para contactar con la Fundación por email, escribe a mailto:info@FreeBSDFoundation.org[info@FreeBSDFoundation.org].
pt_br: Mais informações sobre a FreeBSD Foundation podem ser encontradas em https://people.FreeBSD.org/~jdp/foundation/announcement.html[The FreeBSD Foundation - uma introdução]. Para entrar em contato com a Fundação por e-mail, escreva para mailto:info@FreeBSDFoundation.org[info@FreeBSDFoundation.org].
ru: Дополнительная информация о Фонде FreeBSD доступна по ссылке https://people.FreeBSD.org/~jdp/foundation/announcement.html[Фонд FreeBSD — введение]. Чтобы связаться с Фондом по электронной почте, напишите на mailto:info@FreeBSDFoundation.org[info@FreeBSDFoundation.org].

source: Donating Hardware
es: Donar hardware
pt_br: Doando Hardware
ru: Пожертвование оборудования

source: The FreeBSD Project happily accepts donations of hardware that it can find good use for. If you are interested in donating hardware, please contact the link:https://www.FreeBSD.org/donations/[Donations Liaison Office].
es: El Proyecto FreeBSD acepta felizmente las donaciones de hardware al que se le puede encontrar un buen uso. Si estás interesado en donar hardware, por favor contacta con la link:https://www.FreeBSD.org/donations/[Oficina del Enlace de Donaciones].
pt_br: O Projeto FreeBSD alegremente aceita doações de hardware que possa ser utilizado de forma benéfica. Se você estiver interessado em doar hardware, por favor, entre em contato com o link:https://www.FreeBSD.org/donations/[Departamento de Coordenação de Doações].
ru: Проект FreeBSD с благодарностью принимает пожертвования в виде оборудования, которое может быть полезно для проекта. Если вы хотите пожертвовать оборудование, пожалуйста, свяжитесь с link:https://www.FreeBSD.org/donations/[Офисом по связям с пожертвованиями].

source: Contributing to ports
es: Contribuyendo a la colección de ports
pt_br: Contribuindo com a coleção de ports
ru: Вклад в порты

source: Adopting an unmaintained port
es: Adopta un port que no está mantenido
pt_br: Adotando um port não mantido
ru: Принятие сопровождения неподдерживаемого порта

source: Choosing an unmaintained port
es: Elegir un port que no esté mantenido
pt_br: Escolhendo um port não mantido
ru: Выбор неподдерживаемого порта

source: Taking over maintainership of ports that are unmaintained is a great way to get involved. Unmaintained ports are only updated and fixed when somebody volunteers to work on them. There are a large number of unmaintained ports. It is a good idea to start with adopting a port that you use regularly.
es: Asumir el mantenimiento de ports que no están mantenidos es una forma excelente de involucrarse. Los ports que no están mantenidos solo se actualizan y arreglan cuando alguien se ofrece como voluntario para trabajar en ellos. Hay una gran cantidad de ports sin mantenimiento. Es una buena idea empezar adoptando un port que use de forma regular.
pt_br: Assumir a manutenção de ports que não são mantidos é uma ótima maneira de se envolver. Os ports não mantidos são atualizados e corrigidos somente quando alguém se voluntaria para trabalhar neles. Há um grande número de ports não mantidos. É uma boa ideia começar adotando um port que você usa regularmente.
ru: Принятие на себя сопровождения необслуживаемых портов — это отличный способ принять участие. Необслуживаемые порты обновляются и исправляются только тогда, когда кто-то добровольно берется за работу над ними. Существует большое количество необслуживаемых портов. Хорошей идеей будет начать с порта, который вы используете регулярно.
