freebsd/freebsd-doc/ja_JP.eucJP/man/man7/clocks.7
.\"
.\" Copyright (c) 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man7/clocks.7,v 1.22.8.1 2005/02/25 17:52:46 njl Exp %
.\"
.\" $FreeBSD$
.\" "
.Dd February 24, 2005
.Os
.Dt CLOCKS 7
.Sh 名称
.Nm clocks
.Nd いろいろなシステムタイマ
.Sh 書式
.In time.h
.Sh 解説
.Dv HZ
(ヘルツ) は
.Bx
におけるアプリケーションインタフェースの一部ではありません。
.Pp
周波数の異なるいろいろな実体をもつクロックおよび仮想的 (計時用) なクロック
があります。
.Bl -bullet
.It
スケジューリングクロック。
周波数 100 となるはずの実クロックです。
アプリケーションからは参照できません。
.It
統計クロック。
周波数 128 となるはずの実クロックです。
アプリケーションから直接参照することはできません。
.It
.Xr clock 3
によって報告されるクロック。
周波数が通常 128 の仮想クロックです。
実際の周波数は
.Dv CLOCKS_PER_SEC
マクロによって与えられます。
.Dv CLOCKS_PER_SEC
は浮動小数点値であるかもしれないことに注意してください。
.Xr clock 3
は
.Fx
での新しいプログラムには使用しないでください。
これは
.Xr getrusage 2
に比較して機能的に劣っていますが、
.Tn ANSI
に適合するために
提供されています。
.Xr getrusage 2
をコールし、情報と結果を受け渡すことによって実装されています。
.It
.Xr times 3
によって報告されるクロック。
周波数が通常 128 の仮想クロックです。
実際の周波数は
.Dv CLK_TCK
マクロ (非推奨です、使用しないでください) と
.Fn sysconf SC_CLK_TCK
と
.Xr sysctl 3
によって与えられます。
この周波数は
.Dv CLOCKS_PER_SEC
とは異なりうることに注意してください。
.Xr times 3
は
.Fx
での新しいプログラムには使用しないでください。
これは
.Xr getrusage 2
と組み合わせた
.Xr gettimeofday 2
に比較して機能的に劣っていますが、
.Tn POSIX
に適合するために
提供されています。
.Xr gettimeofday 2
と
.Xr getrusage 2
をコールし、情報と結果を受け渡すことによって実装されています。
.It
プロファイリングクロック。
1024 の周波数をもつ実クロックです。
これは主に
.Xr moncontrol 3
と
.Xr kgmon 8
と
.Xr gprof 1
で使用されます。
アプリケーションはこの実際の周波数を決定するためには
.Xr sysctl 3
を使うか、プロファイリングデータファイルのヘッダを読んで
調べなければなりません。
.It
mc14618a のクロック。
32768 の公称周波数をもつ実クロックです。
分周されて統計クロックおよびプロファイリングクロックに使われます。
このクロックはアプリケーションからは参照できません。
.It
マイクロ秒クロック。
1000000 の周波数をもつ仮想クロックです。
これは
.Bx
ではほとんどの時間計測に使用され、アプリケーションに対して
.Xr getrusage 2
や
.Xr gettimeofday 2
や
.Xr select 2
や
.Xr getitimer 2
などでエクスポートされています。
これが通常
.Bx
のアプリケーションで
使用されるべきクロックです。
.It
i8254 クロック。
1193182 の公称周波数をもつ実クロック/タイマです。
3 個の独立したタイムカウンタを使用可能です。
分周されてスケジューリングクロックに使われます。
アプリケーションからは参照できません。
.It
第 5 世代以降の x86 システムでの、TSC クロック (64 ビットレジスタ)。
CPU の 1 秒あたりのサイクル数に等しい周波数の、実クロックです。
周波数は、使用可能ならば sysctl
.Va machdep.tsc_freq
を使用して得られます。
これはスケジューリングクロックの値の間に挿入するために使用されます。
.Xr perfmon 4
の
.Dv PMIOTSTAMP
要求でアクセス可能です。
.It
ACPI クロック。
3579545 の公称周波数をもつ実クロック/タイマです。
24 または 32 ビットレジスタを介してアクセスされます。
TSC クロックとは異なり、
たとえ CPU がスリープしたり CPU のクロック速度が変わったりしても、
それに関わらず一定のチック速度を維持します。
アプリケーションからは参照できません。
.El
.Pp
まとめ: もし
.Dv HZ
(ヘルツ) が 1000000 でなければ、アプリケーションはおそらく間違った
クロックを使用することになるでしょう。
.Sh 関連項目
.Xr gprof 1 ,
.Xr clock_gettime 2 ,
.Xr getitimer 2 ,
.Xr getrusage 2 ,
.Xr gettimeofday 2 ,
.Xr select 2 ,
.Xr clock 3 ,
.Xr moncontrol 3 ,
.Xr times 3
.Sh 作者
.An -nosplit
このマニュアルページは
.An Bruce Evans
によって投稿された説明にもとづいて、
.An J\(:org Wunsch
によって書かれました。
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 99-1-21
