freebsd/freebsd-doc/ja_JP.eucJP/man/man7/environ.7
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)environ.7	8.3 (Berkeley) 4/19/94
.\"	%Id: environ.7,v 1.10.2.2 1999/08/18 19:55:04 mpp Exp %
.\"
.\" jpman %Id: environ.7,v 1.4 1999/01/21 17:56:13 kuma Stab %
.Dd April 19, 1994
.Dt ENVIRON 7
.Os BSD 4.2
.Sh 名称
.Nm environ
.Nd ユーザ環境
.Sh 書式
.Ar extern char **environ ;
.Sh 解説
.Ar 環境
と呼ばれる文字列の配列は、
プロセス開始時に
.Xr execve  2
を呼び出すことによって利用可能になります。
習慣によって、これらの文字列は
.Dq Ar name=value
という形を取ります。
以下の名前は多くのコマンドによって利用されます:
.Bl -tag -width BLOCKSIZE
.It Ev BLOCKSIZE
いくつかのコマンド (最もよく知られている物としては
.Xr df 1 ,
.Xr du 1 ,
.Xr ls 1 )
で用いられるブロック単位のサイズ。
.Ev BLOCKSIZE 
には、数字を指定することによってバイト単位の値を、
数字の後に ``K'' か ``k'' を指定することによってキロバイト単位の値を、
数字の後に ``M'' か ``m'' を指定することによってメガバイト単位の値を、
数字の後に ``G'' か ``g'' を指定することによってギガバイト単位の値を、
指定することができます。
512 バイトより小さい値や 1 ギガバイトより大きい値を指定しても無視されます。
.It Ev EDITOR
デフォルトのエディタの名前。
.It Ev EXINIT
.Xr ex  1  ,
.Xr vi  1
が参照する、スタートアップ時のコマンドリスト。
.It Ev HOME
.Xr login  1
によって、パスワードファイル
.Xr passwd  5
を元にセットされるユーザのログインディレクトリ。
.It Ev LANG
.Xr setlocale 3
を使用する全てのプログラムを、この変数に指定されたロケールを使うように
設定します。
.It Ev MAIL
ユーザのメールボックスの場所です。
.Xr mail  1 ,
.Xr sh 1 , 
その他多くのメールクライアントが、デフォルトの /var/mail の
代わりに用います。
.It Ev PAGER
デフォルトのページャプログラム。
.Xr mail 1 ,
.Xr man 1 ,
.Xr ftp 1
などが、使用中のディスプレイよりも長い情報を表示するときに、
この変数で指定されたプログラムを使用します。
.It Ev PATH
コロンで区切られたディレクトリの列です。
.Xr csh  1  ,
.Xr sh  1 ,
.Xr system  3  ,
.Xr execvp  3
などが、実行ファイルを探すときに検索します。
.Ev PATH 
の初期値は、
.Xr login  1
によって、``/usr/bin:/bin'' にセットされます。
.It Ev PRINTER
.Xr lpr  1  ,
.Xr lpq  1 ,
.Xr lprm  1
によって用いられるデフォルトのプリンタの名前。
.It Ev PWD
カレントディレクトリのパス名。
.It Ev SHELL
ユーザのログインシェルのフルパス名。
.It Ev TERM
出力を準備する必要のある端末の種類。
この情報は
.Xr nroff  1
や
.Xr plot 1
などの、端末の特殊な機能を駆使するコマンドによって用いられます。
端末タイプのリストは、
.Pa /usr/share/misc/termcap
.Pq Xr termcap 5
を参照してください。
.It Ev TERMCAP
.Ev TERM
で指定した端末の機能を記述する文字列、あるいは、文字列が `/' で
始まる場合、termcap ファイルの名前。
下記の
.Ev TERMPATH ,
.Xr termcap  5
を参照してください。
.It Ev TERMPATH
コロンあるいはスペースで区切られた、termcap のパス名の列で、
端末の機能記述を知るために、列挙された順番で検索されます。
.Ev TERMPATH
を指定していない場合は、
.Ev TERMPATH
を
.Dq Pa $HOME/.termcap:/etc/termcap
に指定している時と同じ結果になります。
.Ev TERMCAP
がフルパス名を含んでいる場合は、
.Ev TERMPATH
は無視されます。
.It Ev TMPDIR
テンポラリファイルを置くための場所。ほとんどのアプリケーションは
.Dq /tmp
か
.Dq /var/tmp
を用います。この変数を指定すれば、他のディレクトリを使うようになるでしょう。
.It Ev TZ
日付を表示する時に使われるタイムゾーン。
通常のフォーマットは、
.Dq Pa /usr/share/zoneinfo
からの相対パス名です。
例えば、コマンド
.Dq env TZ=America/Los_Angeles date
は、カリフォルニアの現在時刻を表示します。
より詳しい情報は、
.Xr tzset 3
を参照してください。
.It Ev USER
ユーザのログイン名。
.El
.Pp
これ以外の名前も、
.Xr sh  1
においては
.Xr export
コマンドと
.Ar name=value
引数によって、
.Xr csh  1
を使用している時には
.Xr setenv
コマンドによって環境に付け加えることができます。
.Pa .profile
ファイルでしばしばエキスポートされる、
.Ev MAIL ,
.Ev PS1 ,
.Ev PS2 ,
.Ev IFS
などのいくつかの
.Xr sh 1
の変数を変更するのは、自分が何をしているのか十分に理解していない場合には
賢明ではありません。
.Sh 関連項目
.Xr cd 1 ,
.Xr csh 1 ,
.Xr ex 1 ,
.Xr login 1 ,
.Xr sh 1 ,
.Xr execve 2 ,
.Xr execle 3 ,
.Xr setlocale 3 ,
.Xr system 3 ,
.Xr termcap 3 ,
.Xr termcap 5
.Sh 歴史
.Nm environ
マニュアルページは
.Bx 4.2
から登場しました。
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 99-1-21
