freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_mwww.7
.\" $FreeBSD$
.TH GROFF_MWWW 7 "26 April 2001" "Groff Version 1.17"
.\" Copyright (C) 2000 Free Software Foundation, Inc.
.\"      Written by Gaius Mulley (gaius@glam.ac.uk)
.\"
.\" This file is part of groff.
.\"
.\" groff is free software; you can redistribute it and/or modify it under
.\" the terms of the GNU General Public License as published by the Free
.\" Software Foundation; either version 2, or (at your option) any later
.\" version.
.\"
.\" groff is distributed in the hope that it will be useful, but WITHOUT ANY
.\" WARRANTY; without even the implied warranty of MERCHANTABILITY or
.\" FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
.\" for more details.
.\"
.\" You should have received a copy of the GNU General Public License along
.\" with groff; see the file COPYING.  If not, write to the Free Software
.\" Foundation, 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
.\"
.\" user level guide to using the -mwww macroset
.\"
.do mso www.tmac
.\" we need the .LINKS here as we use it in the middle as an example
.\" once the user requests .LINKS then the automatic generation of links
.\" at the top of the document is suppresed.
.LINKS
.SH 名称
groff_mwww \- ウェブページのオーサリング用 groff マクロ
.LINE
.SH 書式
.B "groff \-mwww"
[ options ]
file ...
.SH 解説
このマニュアルページは、GNU \-mwww マクロについて解説しています。
これは、groff ドキュメント整形システムの一部です。
このマニュアルページは、ごく基本的なガイドに過ぎませんし、
html デバイスドライバ
.RB (grohtml)
はいまだにアルファ版という段階です。
多くの人達がテストする機会を持てるようにするため、
このマクロを配布物に含めているのです。
このマクロファイルは、\fC-Thtml\fP を使用すれば
(\fCtroffrc\fP ファイルによって) 自動的に呼ばれるのだということに
注意してください。
.PP
ハイパーリンクが動作することを確認するには、このマニュアルページを
.B grohtml
デバイスを用いて整形してください。
.PP
これは、このマクロセットで見つかる機能の概要です。
.SH 書式
.ta 2iL
\&.HTMLINDEX	セクション / ヘッダ用に自動的に
.br
	作成されるリンクのレベルを決定します。
.br
\&.BODYCOLOR	ウェブページの色を指定します。
.br
\&.BACKGROUND	背景画像を指定します。
.br
\&.URL	2 つのパラメータを用いて URL を作成します。
.br
\&.MAILTO	HTML 用電子メールアドレスを作成します。
.br
\&.FTP	FTP への参照を作成します。
.br
\&.IMAGE	画像ファイルを挿入します。
.br
\&.HTML	デバイスドライバに生の HTML
.br
	リクエストを渡します。
.br
\&.TAG	$1 から HTML の name タグを生成します。
.br
.\"\&.CDFTP	optionally create two different links
.\".br
.\"	depending on hostname
.\".br
\&.LINE	水平方向の罫線を幅いっぱいに作成します。
.br
.PP
.IR pic ,
.IR eqn ,
.IR refer
および
.I tbl
プリプロセッサの出力を入力として受け付けることができます。
.SH リクエスト
.TP
.B HTMLINDEX
見出しに対して自動的に作成されるリンクの
切り捨てレベルを決定します。
デフォルトでは、troff ドキュメント中にある
すべての見出しへのリンクが HTML ウェブページの先頭に作成されます。
おそらく、細かいレベルの見出しにはリンクは必要ないことが
多いでしょう。またウェブページによっては、見出しへのリンクは一切
必要ないものもあるかもしれません。このような場合、
.sp
.nf
\fC\&.HTMLINDEX 0\fP
.fi
.sp
とすると、
.B grohtml
がリンクを生成しないようになります。
\fCHTMLINDEX\fP を 2 にすると
.sp
.B "1.1.1 Some Title"
.sp
という見出しも、3 レベル目の見出しがあるということにより、
リンクに含まれないようになります。
自動的な見出しを切り替える別の方法は、
コマンドラインスイッチ \fC-P-l\fP です。
.TP
.B BODYCOLOR
5 つパラメータを取ります: 文字色、背景色、アクティブな
ハイパーリンクの色、まだ訪問したことがない
ハイパーリンクの色、そして訪問したことのある
ハイパーリンクの色です。
.TP
.B BACKGROUND
このマクロの唯一のパラメータは、背景画像ファイルを示します。
.TP
.B URL
2 つあるいは 3 つのパラメータを使用して
.TAG URL
URL を生成します。
$1 はリンク名、$2 は実際の URL、そして $3 は $2 の直後に
印字されるオプション部分です。
これは、
.URL "groff のホームページ" http://groff.ffii.org/
のエンコードの方法を示したものです。
.sp
.nf
\s-2\fC\&.URL "groff のホームページ" http://groff.ffii.org/ :\fP\s+2
.fi
.sp
\fC-Thtml\fP 以外のデバイスでこれを処理すると、
次のように表示されます:
groff のホームページ \(lahttp://groff.ffii.org\(ra 。
URL マクロは、どんな種類の要素でも使えます。例えば、
.URL "Eric Raymond の pic ガイド" pic.html
という参照を次のようにして作ることができます:
.sp
.nf
\s-2\fC\&.URL "Eric Raymond の pic ガイド" pic.html\fP\s+2
.fi
.sp
.TP
.B MAILTO
HTML 用の電子メール参照を生成します。
第 1 引数は、電子メールアドレスとして必須のものです。
第 2 引数はオプションであり、ブラウザに表示されるテキストです。
そして、第 3 引数もオプションであり、これは第 2 引数の直後に
表示されるものです。
例えば、groff メンテナは
.MAILTO wl@gnu.org "Werner Lemberg"
と
.MAILTO Ted.Harding@nessie.mcc.ac.uk "Ted Harding"
です。
これは、次のマクロで実現します:
.sp
.nf
\s-2\fC\&.MAILTO wl@gnu.org "Werner Lemberg"
\&.MAILTO Ted.Harding@nessie.mcc.ac.uk "Ted Harding" .\s+2\fP
.fi
.sp
実際には、groff では URL はテキストとしての空白を
一切使わないものとして扱われることに注意してください。
このことは、いくつかの問題の原因となりますのでバグだと
考えられるでしょう。
これを回避するために、\fCwww.tmac\fP は他に影響を
与えない空白に展開される幅 0 の文字を挿入します
(-Thtml 付で実行された場合のみ)。
.TP
.B FTP
データが FTP 経由で取得できることを示します。
第 1 引数は、ブラウザに表示されるテキストであり、
第 2 引数は URL です。
第 3 引数は、先に述べたマクロと同様に、第 2 引数の
直後に表示されるテキストとして扱われます。
第 2 および第 3 の引数はオプションです。
例として、これは、
.FTP "現在の groff 開発者用配布物" \
ftp://ftp.ffii.org/pub/groff/devel/groff-current.tar.gz
の場所です。
このマクロの例は、次のように指定します:
.sp
.nf
\s-2\fC\&.FTP "現在の groff 開発者用配布物" \\
ftp://ftp.ffii.org/pub/groff/devel/groff-current.tar.gz \fP\s+2
.fi
.sp
.TP
.B IMAGE
ドキュメントに画像を含めることができます。
第 1 引数は画像ファイルです。
次の 2 つの引数はオプションです。
第 2 引数は画素数での画像の幅です (指定がなければ、デフォルトは
400 画素です)。
第 3 引数は画素数での画像の高さです (指定がなければ、デフォルトは
画像幅と同じです)。
.sp
.TP
.B HTML
このマクロの後に続いたテキストはすべて生の HTML として
扱われます。
ドキュメントが \fC-Thtml\fP を \fI使わずに\fP 
処理される場合、このマクロは無視されます。
このマクロは、より高水準な他のマクロの構成要素です。
.sp
例えば、\fCBACKGROUND\fP マクロは次のように定義されます:
.nf
\fC\&.de BACKGROUND
\&.   HTML <body background=\\$1>
\&..
\fP
.fi
.TP
.B TAG
引数から HTML の name タグを生成します。
このタグは、
.URL URL #URL
マクロを使って参照できます。
御覧の通り、同一ドキュメント内の参照ですので、タグ名の前には 
`\fC#\fP' を付けなくてはなりません。
このリンクは、先の URL マクロの記述の中で TAG を置くことで
実現したのです。ソースは次のようになります:
.sp
.nf
\s-2\fC\&.TP
\&.B URL
は、
\&.TAG URL
を生成します。
URL は 2 個あるいは 3 個の
引数を使います。
$1 がリンクの名前、そして $2 が実際の URL です。\fP\s+2
.fi
.sp
.TP
.B LINE
水平方向に幅いっぱいの罫線を生成します。
次が例です:
.sp
.nf
\fC\s-2\&.LINE\fP\s+2
.fi
.sp
.TP
.B LINKS
.TAG LINK
は、grohtml が自動的に生成されるリンクをこの位置へ置くよう要求します。
例:
.LINKS
.SH
セクション見出しへのリンク
.LP
デフォルトでは、
.B grohtml
はセクションの見出しすべてへのリンクを生成し、
リンクを
HTML ドキュメントの先頭に配置します。
オフにしたり位置を変えるための詳細は
.URL LINKS #LINK
を参照してください。
.SH
grohtml の制限
.LP
tbl 情報は、現状 png イメージで描かれます。
.SH 関連ファイル
/usr/share/tmac/mwww.tmac (www.tmac へのラッパ)
.br
/usr/share/tmac/www.tmac
.SH "関連項目"
.BR groff (1),
.BR troff (1),
.BR grohtml (1)
.LP
.SH 作者
.B grohtml
は
.MAILTO gaius@glam.ac.uk "Gaius Mulley"
が書きました。
.SH バグ
バグレポートは
.MAILTO bug-groff@gnu.org "Groff Bug Mailing List"
へ送ってください。
バグが再現できるように、完全で自己完結している例を付けてください。
また、どのバージョンの groff を使っているかも伝えてください。
