freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_mm.7
.ig \"-*- nroff -*-
Copyright (C) 1991-1995 Free Software Foundation, Inc.

Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.

Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.
..
.\" %Id: groff_mm.man,v 1.27 1995/04/24 05:37:46 jh Exp %
.\"
.\" Original Revision: 1.1.1.1
.\" jpman %Id: groff_mm.7,v 1.4 1999/01/20 17:21:55 kuma Stab %
.\"
.\" WORD: abstract		アブストラクト
.\" WORD: broken varable list	変則可変リスト
.\" WORD: bullet list		黒丸リスト
.\" WORD: diversion		転換
.\" WORD: exhibit		エグジビット
.\" WORD: front page		表題紙
.\" WORD: hanging indent	ハンギングインデント
.\" WORD: heading		見出し
.\" WORD: justification		行末揃え
.\" WORD: memorandum		覚書
.\" WORD: multiple columns	多段組
.\" WORD: nesting		入れ子
.\" WORD: overprint		重ね打ちする
.\" WORD: released paper style	公開論文形式
.\" WORD: separate environment	隔離された環境
.\" WORD: static display	スタティックディスプレイ
.\" WORD: trap			トラップ
.\" WORD: variable item list	可変項目リスト
.\" "
.de T2
.ne 2v
.ti -.5i
\\$1
.sp -1
..
.de T3
.ne 2v
.ti -.5i
\fB\\$1\fP
.br
..
.TH GROFF_MM 7 "7 September 1996" "Groff Version 1.11"
.SH 名称
groff_mm \- groff mm マクロ
.SH 書式
.B groff
.B \-mm
[
.IR options .\|.\|.
]
[
.IR files .\|.\|.
]
.SH 解説
groff mm マクロは、DWB mm マクロと互換であるように設計されています。
しかし、以下のような制限があります:
.TP
.B \(bu
ベル研の方言は実装されていません。
.TP
.B \(bu
マクロ OK 及び PM は実装されていません。
.TP
.B \(bu
groff mm は、カットマークをサポートしません。
.LP
\fBmm\fP は、国際化されて設計されています。
そのため、各国語対応用の短いマクロファイルを書き換えて、
英語のテキストを好みの言語対応に置き換えることができます。
\fBmmse\fP を例として用いて下さい。
.LP
新しいマクロ: \fBAPP\fP, \fBAPPSK\fP, \fBB1\fP, \fBB2\fP, \fBBVL\fP,
\fBCOVER\fP, \fBCOVEND\fP, \fBGETHN\fP, \fBGETPN\fP, \fBGETR\fP,
\fBGETST\fP, \fBINITR\fP, \fBMC\fP, \fBMOVE\fP, \fBMULB\fP,
\fBMULN\fP, \fBMULE\fP, \fBPGFORM\fP, \fBPGNH\fP, \fBSETR\fP,
\fBTAB\fP, \fBVERBON\fP, \fBVERBOFF\fP
.LP
.\"########################################################################"
.LP
大域変数の初期化後に \fBlocale\fP か \fIlang\fP\fB_locale\fP という
ファイルを読み込みます。そのため、企業名などについてのマクロを
ローカライズすることができます。
.sp
このマニュアルでは、角括弧は省略可能な引数を表示するのに用いられます。
.sp 3
\fB数値レジスタと文字列変数\fP
.br
多くのマクロを数値レジスタと文字列変数によって制御することが出来ます。
数値レジスタは、\fBnr\fP コマンドによって、代入が出来ます。
.br
\fB\&.nr\fP \fIXXX\fP \fI[+-]n [i]\fP
.br
\fBXXX\fP はレジスタの名前です。
\fBn\fP は、代入されるべき値です。
そして、\fBi\fP は、自動増加に使われる増分値です。
もし現在値の増減が必要ならば、\fBn\fP には、
前に接頭辞として正符号や負符号をつけることが出来ます。
(自動増加や自動減少が行なわれるのは、
数値レジスタが正符号か負符号とともに用いられた時のことで、
\fB\en+[XXX]\fP か \fB\en-[XXX]\fP
の様になります。)
.sp
文字列変数は、\fBds\fP により定義されます。
.br
\fB\&.ds\fP \fIYYY string\fP
.br
文字列 \fIstring\fP としては、空白も含めて行末までの全部が割り当てられます。
\fIstring\fP の中の最初の空白は、二重引用符が前につけられなければなりません。
(テキストの中では、文字列変数は \fB\e*[YYY]\fP の様に使われます。)
.sp
\fB数値レジスタの特殊な形式\fP
.br
数値レジスタというものは、形式が何も指定されなければ、
通常の数字で表示されます。
形式は \fBaf\fP によって設定出来ます:
.br
\fB\&.af\fP \fIR c\fP
.br
\fIR\fP はレジスタの名前で、\fIc\fP はその形式です。
.in +.5i
.T2 \fB形式\fP
\fB数の並び\fP
.T2 1
0, 1, 2, 3, ...
.T2 001
000, 001, 002, 003, ...
.T2 i
0, i, ii, iii, iv, ...
.T2 I
0, I, II, III, IV, ...
.T2 a
0, a, b, c, ..., z, aa, ab, ...
.T2 A
0, A, B, C, ..., Z, AA, AB, ...
.in

.LP
\fBマクロ:\fP
.TP
.B "1C [1]"
1 段の段組処理を開始します。引数としての \fB1\fP はページ区切りを無効にします。
広い脚注を用いて下さい。
狭い脚注は重ね打ちになってしまうでしょう。
.TP
.B 2C
2 段の段組処理を開始します。ページを 2 段のカラムに分割します。
これは、\fBMC\fP の特殊な場合になります。
関連項目は \fB1C\fP です。
.TP
.B AE
アブストラクトの終わり。
\&\fBAS\fP を参照して下さい。
.TP
.B "AF [企業名]"
著者の帰属する企業。\fBAU\fP の前に呼び出さなければなりません。
関連項目は \fBCOVER\fP です。
.TP
.B "AL [type [text-indent [1]]]"
自動番号付けリストを開始します。
項目は、1 から始められる番号を振付けられます。
引数の \fItype\fP は数字の型を制御します。
.in +.5i
.T2 引数
数字の型
.T2 1
アラビア数字 (デフォルト)
.T2 A
大文字 (A-Z)
.T2 a
小文字 (a-z)
.T2 I
大文字　ローマ数字
.T2 i
小文字　ローマ数字
.in
\fItext-indent\fP はインデントを設定し、\fBLi\fP よりも優先されます。
3 番目の引数は、各項目の前に空行を出力することを禁止します。
.TP
.B "APP name text"
\fIname\fP という名前の付録を開始します。
\fIname\fP が "" である場合には、自動的に名前がつけられます。
名前が自動生成されるならば、付録は \fBA\fP から始まります。
数値変数の \fBAph\fP が非 0 であれば、新しいページに切り替えられ、
ヘッダも生成されます。
これが、デフォルトです。
付録は、常に「List of contents」の中に正しいページ番号とともに表示されます。
\fIAPPENDIX\fP という名前は、
文字列変数の \fBApp\fP に望みのテキストを代入すれば、
変えることが出来ます。
.TP
.B "APPSK name pages text"
\&\fB.APP\fP とほぼ同じです。異なるのは、\fIpages\fP だけ
ページ番号が増加されることです。
これが使用されるのは、図表や、その他整形されていない文書が
付録に含まれる時です。
.TP
.B "AS [arg [indent]]"
アブストラクトの開始。
インデントは、「en (半角)」で指定されますが、単位付きの指定も可能です。
引数の \fIarg\fP は、アブストラクトが印字される場所を制御します。
.in +.5i
.T2 arg
配置
.T2 0
公開論文形式 (\fBMT 4\fP) の場合には、
アブストラクトは第 1 ページと表紙に印字されます。
それ以外の場合には、表紙はなく、第 1 ページに印字されます。
.T2 1
アブストラクトは第 1 ページだけに印字されます (\fBMT 4\fP の場合のみ)。
.T2 2
アブストラクトは表紙だけに印字されます。
表紙の印字には、\fBCS\fP は必要ありません。
.in
外部へのレター形式 (\fBMT 5\fP) では、アブストラクトは全く印字されません。
\fIindent\fP は両側マージンのインデントを制御します。
指定されない時は、通常のテキストのインデントが用いられます。
.TP
.B "AST [title]"
アブストラクトの題目。
デフォルトでは、\fBABSTRACT\fP です。
アブストラクトのテキストの上にそのテキストを設定します。
.TP
.B "AT title1 [title2 ...]"
著者の肩書。\fBAT\fP は、各々の \fBAU\fP のすぐ後に現れなければなりません。
肩書は、署名ブロックで名前の後に現れます。
.TP
.B "AU name [initials [loc [dept [ext [room [arg [arg [arg]]]]]]]]"
著者に関する情報。これは、覚書や論文の著者を明示し、表紙や他の同様の場所に
印字されます。
\fBAU\fP は \fBTL\fP の前に現れなければなりません。
著者情報には、イニシャル (initials)、所在地 (loc)、部局 (dept)、
電話内線番号 (ext)、部屋番号又は部屋の名前 (room)、そして 3 個までの
追加引数を含めることが出来ます。
.TP
.B "AV [name [1]]"
承認署名。これは、署名と日付を伴う承認欄を生成します。
変数 \fBLetapp\fP を用いて文字列 \fBAPPROVED:\fP を変更することが出来ます。
また、文字列 \fBDate\fP は \fBLetdate\fP に入っています。
.TP
.B "B [bold-text [prev-font-text [bold...]]]"
ボールド体の開始。引数の数には、制限はありません。
すべての引数は、1 個の単語に結合されます。
第 1 番目の引数、第 3 番目の引数、などなどがボールド体で印字されます。
.TP
.B B1
(ms マクロのような) ボックスの開始。テキストの周りにボックスを描きます。
テキストは 1 文字インデントされ、右マージンは 1 文字短くなります。
.TP
.B B2
ボックスの終了。\fBB1\fP によって開始されたボックスを終了します。
.TP
.B BE
ページ底部のブロックの終了。\fBBS\fP を参照して下さい。
.TP
.B "BI [bold-text [italic-text [bold-text [...]]]]"
ボールド体とイタリック体。
引数の数には制限はありません。
\fBB\fP を参照して下さい。
.TP
.B "BL [text-indent [1]]"
黒丸リストの開始。これは、黒丸記号と空白を各リスト項目の先頭部分に配置する
リストを初期化します (\fBLI\fP を参照して下さい)。
\fItext-indent\fP は、数値レジスタ \fBPi\fP により設定されるリスト項目の
デフォルトのインデントより優先されます。
第 3 番目の引数により、各項目前の空行の出力が禁止されます。
.TP
.B "BR [bold-text [roman-text [bold-text [...]]]]"
ボールド体とローマン体。
引数の数には、制限はありません。
.TP
.B BS
ページ底部のブロック開始。これは、テキストブロックの定義を開始します。
このブロックは各ページの底部に印字されます。
ブロックは、\fBBE\fP で終了します。
.TP
.B BVL
変則可変項目リスト。
この変則可変項目リストには、定まった項目記号がありません。
その代わり、各 \fBLI\fP に項目記号が定義されていると仮定しています。
テキストは必ず、項目記号の後の次の行で始まります。
\fItext-indent\fP によって、テキストのインデントが設定されます。
そして、\fImark-indent\fP によって、現在のインデントから項目記号までの
距離が設定されます。
第 3 番目の引数は、各項目の前に空行を出力することを禁止します。
.TP
.B "COVER [arg]"
\&\fBCOVER\fP は表紙の定義を開始します。
重要なことは、\fB.COVER\fP がすべての通常のテキストより前に現れることです。
\&\fB.COVER\fP では、\fIarg\fP を使用して、
/usr/share/tmac/mm/\fIarg\fP.cov というファイル名を構成します。
このお陰で、無制限な型の表紙を創作することが可能です。
\fIms.cov\fP の目的としていることは、\fBms\fP の表紙に似せることです。
\&\fB.COVER\fP では、表紙の定義の最後に \fB.COVEND\fP があることが要求されます。
必ず、以下のような順番で表紙マクロを使用して下さい:
.nf
\&.COVER
\&.TL
\&.AF
\&.AU
\&.AT
\&.AS
\&.AE
\&.COVEND
.fi
しかし、必ず必要なのは \fB.TL\fP と \fB.AU\fP だけです。
.TP
.B COVEND
これによって表紙の記述は終了し、表紙が印字されます。
このマクロは、表紙ファイルに定義されています。
.TP
.B DE
ディスプレイ終了。これは、\fBDS\fP 又は \fBDF\fP で始まったテキストブロック
やディスプレイを終了させます。
.TP
.B "DF [format [fill [rindent]]]"
フローティングディスプレイを開始します (入れ子にはできません)。
フローティングディスプレイは、キューに保存され、入れられた順番で印字されます。
\fIformat\fP, \fIfill\fP, \fIrindent\fP は、\fBDS\fP の場合と同じです。
フローティングディスプレイは、2 個の数値レジスタ \fBDe\fP と \fBDf\fP
とによって制御されます。
.sp
\fBDe レジスタ\fP
.in +.5i
.T2 0
特別なことは何もありません。これがデフォルトです。
.T2 1
ディスプレイが印字された後で改ページが行われます。
その為、1 ページに唯 1 つのディスプレイが出力されます。
その後ろには、テキストは何も続きません。
.in
.sp
\fBDf レジスタ\fP
.in +.5i
.T2 0
(セクション - ページの番号付けが有効な時は) 各セクションの最後に、
そうでない時には文書の最後に、ディスプレイは印字されます。
.T2 1
充分な余地があれば、新しいディスプレイは現在のページに印字されます。
そのような余地がなければ、ディスプレイは文書の最後に印字されます。
.T2 2
1 つのディスプレイが、各ページの、又は (多段組のモードでは)
各カラムの一番上に印字されます。
.T2 3
もし充分な余地があるならば、1 つのディプレイを印字します。
余地がなければ、ディスプレイは次ページか次のカラムの一番上に印字されます。
.T2 4
新しいページまたはカラムに、入るだけのディスプレイを印字します。
もし \fBDe\fP が 0 でなければ、各ディスプレイの間に改ページが出力されます。
.T2 5
現在のページをディスプレイで満たします。
そして、残りは、新しいページまたはカラムから始めます。(これがデフォルトです)。
もし \fBDe\fP が 0 でなければ、各ディスプレイの間に改ページが出力されます。
.in
.TP
.B "DL [text-indent [1]]"
ダッシュリストの開始。これは、各項目がダッシュの後に印字されるリスト
を開始します。
\fItext-indent\fP は、数値レジスタの \fBPi\fP によって設定される、リスト項目の
デフォルトのインデントを変更します。
第 3 引数は各項目の前に空行を印字することを禁止します。
第 2 引数は印字されるべきリスト項目の間の空行を抑止します。
\fBLI\fP を参照して下さい。
.TP
.B "DS [format [fill [rindent]]]"
スタティックディスプレイの開始。これは、\fBDE\fP に至るまでテキストの収集を
始めます。
テキストは、ページ長より長くならない限り同一のページに印字されます。
\fBDS\fP は入れ子にできます。入れ子の深さには限度はありません
(合理的な程度に :-)。
.sp
\fBformat\fP
.in +.5i
.ds x "
.\" "
.T2 """"""
インデントしません。
.T2 none
インデントしません。
.T2 L
インデントしません。
.T2 I
数値レジスタ \fBSi\fP の値だけテキストをインデントします。
.T2 C
各行を中央揃えします。
.T2 CB
ディスプレイ全体をブロックとして中央揃えします。
.T2 R
行を右揃えします。
.T2 RB
ディスプレイ全体をブロックとして右揃えします。
.in
.sp
L, I, C, CB は 0, 1, 2, 3 とも指定できます。これは互換性の理由からです。
(この機能は使用しないで下さい。:-)
.sp
\fBfill\fP
.in +.5i
.T2 """"""
行詰め機能を無効にします。
.T2 none
行詰め機能を無効にします。
.T2 N
行詰め機能を無効にします。
.T2 F
行詰め機能を有効にします。
.in
.sp
N と F は 0 と 1 とも指定できます。
通常は空行がディスプレイの前と後に印字されます。
数値レジスタ \fBDs\fP に 0 を設定すればこれを抑止出来ます。
\fIrindent\fP を指定すれば、行の長さをその量だけ短く出来ます。
.TP
.B "EC [title [override [flag [refname]]]]"
数式の題目。
数式に題目をつけます。
引数に \fIoverride\fP を指定すれば、数式番号を変更出来ます。
.sp
\fBflag\fP
.in +.5i
.T2 none
\fIoverride\fP は、番号の接頭辞となります。
.T2 0
\fIoverride\fP は、番号の接頭辞となります。
.T2 1
\fIoverride\fP は、番号の接尾辞となります。
.T2 2
番号は \fIoverride\fP に置き換えられます。
.in
\&\fBEC\fP は数値レジスタの \fBEc\fP をカウンタとして使います。
番号の形式を変更する為に、\fB.af\fP を用いることが出来ます。
もし数値レジスタの \fBOf\fP が 1 であれば、題目の形式として番号の後にはドット
の代わりにダッシュが使われます。
文字列変数の \fBLe\fP は、数式のリスト (List of Equations) の題目を
制御します。
これは、デフォルトでは \fILIST OF EQUATIONS\fP です。
数値レジスタの \fBLiec\fP は単語 \fIEquation\fP を含みます。
この文字列は番号の前に印字されます。
もし \fIrefname\fP が指定されている時には、数式番号が \fB.SETR\fP によって
保存されます。これは、\fB.GETST\fP \fIrefname\fP によって取り出せます。
.TP
.B "EF [arg]"
偶数ページのフッタ。これは偶数ページの通常のページフッタの
すぐ上に印字されます。
\&\fBPF\fP を参照して下さい。
.TP
.B "EH [arg]"
偶数ページのヘッダ。これは偶数ページの通常のページヘッダの
すぐ下に印字されます。
\&\fBPH\fP を参照して下さい。
.TP
.B EN
数式の終了。
\&\fBEQ\fP を参照して下さい。
.TP
.B EOP
ページ終了のユーザ定義マクロ。
フッタを通常通り印字する代わりにこのマクロが呼び出されます。
このマクロは何のトラップもアクティブではない状態の隔離された環境下で
実行されます。
\&\fBTP\fPを参照して下さい。
.sp
\fBEOP に利用できる文字列変数\fP
.in +.5i
.T2 EOPf
\&\fBPF\fP からの引数。
.T2 EOPef
\&\fBEF\fP からの引数。
.T2 EOPof
\&\fBOF\fP からの引数。
.in
.TP
.B "EQ [label]"
数式の開始。
\fBEQ\fP/\fBEN\fP は、\fBeqn\fP への入力として書かれた数式の区切り記号です。
\fBEQ\fP/\fBEN\fP は \fBDS\fP/\fBDE\fP ペアに囲まれていなければなりません。
しかし、\fBEQ\fP が \fBeqn\fP のオプションを設定するのに使用されているだけ
ならば、その必要はありません。
数値レジスタの \fBEq\fP が 1 でなければ、\fIlabel\fP は数式の右マージンに
現れます。1 であれば、ラベルは左マージンに現れます。
.TP
.B "EX [title [override [flag [refname]]]]"
エグジビットの題目。
引数は \fBEC\fP と同じです。
\&\fBEX\fP は数値レジスタの \fBEx\fP をカウンタとして使用します。
文字列変数の \fBLx\fP は、エグジビットのリスト (List of Exhibits) の題名を
制御します。デフォルトでは \fILIST OF EXHIBITS\fP となります。
文字列変数の \fBLiex\fP は、\fIExhibit\fP という単語を含みます。
この単語は、番号の前に印字されます。
もし \fIrefname\fP が指定されたなら、その時はエグジビット番号は、
\&\fB.SETR\fP により保存されます。
これは、\fB.GETST\fP \fIrefname\fP によって取り出せます。
.TP
.B "FC [closing]"
レターや覚書の正式な締めくくりとして \fIYours\ very\ truly,\fP を印字します。
引数でデフォルトの文字列を置き換えられます。
デフォルトは文字列変数の \fBLetfc\fP に保管されています。
.TP
.B "FD [arg [1]]"
脚注のデフォルトの形式。
これは、ハイフネーション (hyphen)、右マージン揃え (adjust)、
脚注テキストのインデント (indent) を制御します。
また、ラベル揃え (ljust) も変更することが出来ます。
.sp
.ne 14v
.nf
.ta .5i +.8i +.8i +.8i +.8i
\fBarg	hyphen	adjust	indent	ljust\fP
0	no	yes	yes	left
1	yes	yes	yes	left
2	no	no	yes	left
3	yes	no	yes	left
4	no	yes	no	left
5	yes	yes	no	left
6	no	no	no	left
7	yes	no	no	left
8	no	yes	yes	right
9	yes	yes	yes	right
10	no	no	yes	right
11	yes	no	yes	right
.sp
.fi
.DT
11 以上の引数は、引数 0 と見なされます。mm でのデフォルトは 10 です。
.TP
.B FE
脚注の終了。
.TP
.B "FG [title [override [flag [refname]]]]"
図の題名。
もし \fIrefname\fP が指定されていれば、図番号が
\&\fB.SETR\fP によって保存されます。
これは、\fB.GETST\fP \fIrefname\fP によって取り出せます。
.TP
.B "FS [label]"
脚注の開始。
脚注は \fBFE\fP で閉じられます。
通常脚注は自動的に番号が付されます。
この番号は、文字列変数の \fBF\fP により利用出来ます。
ただ \fB\e*F\fP をテキストに加えて下さい。
また、\fIlabel\fP を引数として加えることで、
他の番号や名前を脚注に付けることが出来ます。
ディスプレイの中の脚注も今では可能です。
空行が、脚注同士を分離します。
行の高さは、数値レジスタの \fBFs\fP により制御されます。
デフォルト値は 1 です。
.TP
.B "GETHN refname [varname]"
これは、対応する \fBSETR\fP \fIrefname\fP が配置された場所の
セクションヘッダ番号を挿入します。
これは、1 回目のパスでは、X.X.X. となっているでしょう。
\fBINITR\fP を参照して下さい。
もし varname が指定されているなら、\fBGETHN\fP により文字列変数の
\&\fIvarname\fP にはセクションヘッダ番号が代入されます。
.TP
.B "GETPN refname [varname]"
これは、対応する \fBSETR\fP \fIrefname\fP が配置された場所の
ページ番号を挿入します。
これは、1 回目のパスでは、9999 となっているでしょう。
\fBINITR\fP を参照して下さい。
もし varname が指定されているなら、\fBGETPN\fP により文字列変数の
\&\fIvarname\fP にはページ番号が代入されます。
.TP
.B "GETR refname"
これは \fBGETHN\fP と \fBGETPN\fP をテキストの
「chapter」と「, page」とともに結合します。
文字列変数の \fIQrf\fP は参照用のテキストを保持しています:
.ti +.5i
\&.ds Qrf See chapter \e\e*[Qrfh], page \e\e*[Qrfp].
.br
\fIQrf\fP は他の言語をサポートする為に変更出来ます。
文字列変数の \fIQrfh\fP と \fIQrfp\fP は \fBGETR\fP により設定され、
セクションヘッダ番号とページ番号が入っています。
.TP
.B "GETST refname [varname]"
これは、\fB.SETR\fP の第 2 引数により保存された文字列を挿入します。
これは、1 回目のパスでは、ダミー文字列になっているでしょう。
もし varname が指定されたなら、\fBGETST\fP により文字列変数の \fIvarname\fP
には保存された文字列が代入されます。
\&\fBINITR\fP を参照して下さい。
.TP
.B "H level [heading-text [heading-suffix]]"
番号付セクション見出し。
セクションヘッダには、1 から 7 迄のレベルを付けられます。
レベル 1 が、トップレベルです。
テキストは引数 \fIheading-text\fP に与えられます。
テキストに空白があるときには、二重引用符で括らなければなりません。
\fBheading-suffix\fP をセクションヘッダのテキスト中に付け加えられます。
しかし、これは目次には現れません。
通常、これは脚注マークや同様のものに用いられます。
\fIheading-suffix\fP の中では \fB\e*F\fP を使わないで下さい。
\fB\e*F\fP は機能しません。
手動のラベルを使わなければなりません。
\fBFS\fP を参照して下さい。
.sp
\fBH\fP の直後に置かれた段落 \fBP\fP は、無視されます。
\fBH\fP によって、行送りとインデントの処理が行われます。
.sp
\fB見出しの前のページ切替\fP
.br
数値レジスタの \fBEj\fP は見出しの前のページ切替を制御します。
通常、レベル 1 の見出しは、その前に 2 行の空行が印字されます。
それより高次のレベルの見出しの前では 1 行になります。
数値レジスタの \fBEj\fP が 1 であれば、各第 1 レベルの見出しの前で
新しいページが排出されます。
レベルが \fBEj\fP の値以下の見出しすべてについて、ページが切り替えられます。
\fBEj\fP のデフォルト値は 0 です。
.sp
\fB見出しの行区切りレベル\fP
.br
もし見出しレベルが数値レジスタ \fBHb\fP 以下ならば、
見出しの後で行区切りが起こります。
このレジスタのデフォルト値は 2 です。
.sp
\fB見出しの空白行のレベル\fP
.br
もし見出しレベルが数値レジスタ \fBHs\fP 以下ならば、
空白行が見出しの後に挿入されます。
このレジスタのデフォルト値は 2 です。
.sp
もしレベルが \fBHb\fP と \fBHs\fP の両方より大きければ、
テキストは同じ行で見出しの後に続きます。
.sp
\fB見出しの後のインデント\fP
.br
見出しの後のテキストのインデントは数値レジスタの \fBHi\fP によって制御
されます。
このレジスタのデフォルト値は 0 です。
.sp
\fBHi\fP
.in +.5i
.T2 0
テキストは左揃えされます。
.T2 1
テキストのインデントは数値レジスタの \fBPt\fP の値に従います。
\fBP\fP を参照して下さい。
.T2 2
テキストは見出しの最初の単語に合わせて 1 列に並べられます。
.in
.sp
\fBセクション見出しの中央揃え\fP
.br
そのレベルが数値レジスタの \fBHc\fP 以下で、かつ \fBHb\fP 又は \fBHs\fP
以下の見出しはすべて、中央揃えされます。
.sp
\fB見出しのフォントの管理\fP
.br
各見出しレベルでのフォントは文字列変数の \fBHF\fP を用いて管理されています。
この変数には各レベルでのフォント番号又はフォント名が入れられています。
デフォルトでは \fB2\ 2\ 2\ 2\ 2\ 2\ 2\fP (すべての見出しでイタリック体) です。
これをまた \fBI\ I\ I\ I\ I\ I\ I\fP の様にも書くことが出来ます。
省略された値はすべて 1 であると推定されます。
.sp
\fBポイントサイズの管理\fP
.br
各見出しのポイントサイズは、フォントが \fBHF\fP により管理されるのと同様な
方法で、文字列変数の \fBHP\fP により管理されます。
値 0 は、デフォルトのポイントサイズを選びます。
デフォルト値は \fB0\ 0\ 0\ 0\ 0\ 0\ 0\fP です。
ポイントサイズのみが変わるのであって、垂直サイズではないことに気をつけて下さい。
垂直サイズはユーザにより指定されるマクロ \fBHX\fP や \fBHZ\fP によって
管理出来ます。
.sp
\fB見出しカウンタ\fP
.br
\fBH1\fP から \fBH7\fP 迄の名前をつけられた 7 個の数値レジスタには
各見出しレベルのカウンタが入れられています。
それらの値はアラビア数字を使って印字されます。
これらは、マクロの \fBHM\fP (下記参照) によって変えられます。
すべての記号は印字する前に結合されます。
これを避ける為には、数値レジスタの \fBHt\fP に 1 を代入して下さい。
これにより各見出しでは、現在の見出しのカウンタだけが印字されます。
.sp
\fB自動の目次\fP
.br
その見出しレベルが数値レジスタ \fBCl\fP 以下の見出しは、
目次に印字する為に保存されます。
このレジスタのデフォルト値は 2 です。
.sp
\fB見出しの特別な管理、ユーザ定義マクロ\fP
.br
これから記述するマクロは垂直行送り、フォント、または他の機能を細かく
制御するためにユーザが定義できるものです。
引数 \fIlevel\fP は \fBH\fP へのレベル引数です。
しかし、これは番号無し見出しでは 0 になります (\fBHU\fP を参照して下さい)。
引数 \fIrlevel\fP は実際のレベルです。
これは、番号無し見出しの為に数値レジスタ \fBHu\fP に代入されます。
引数 \fIheading-text\fP は、\fBH\fP や \fBHU\fP へのテキスト引数です。
.sp
\fBHX\ \fP\fIlevel\ rlevel\ heading-text\fP
.br
\fBHX\fP は見出し印字の直前に呼び出されます。
以下のようなレジスタが \fBHX\fP に利用出来ます。
\fBHX\fP は\ \fB}0\fP, \fB}2\fP, \fB;3\fP を変更してもかまいません。
.in +.5i
.T3 "文字列変数\ }0"
もし \fIrlevel\fP が非 0 であれば、見出し記号と 2 個のスペースが入っています。
そうでなければ、空です。
.T3 "数値レジスタ\ ;0"
見出しの後のテキストの位置が入っています。
0 はテキストが見出しと同じ行に続くはずであることを意味しています。
1 はテキストの前で行区切りが生ずるはずであることを意味します。
2 は空白行が見出しとテキストを分離するはずであることを
意味します。
.T3 "文字列変数\ }2"
数値レジスタの \fB;0\fP が 0 であれば、このレジスタには
2 個のスペースが入ります。
これは見出しからテキストを分離するのに使われます。
もし \fB;0\fP が非 0 であれば、この文字列変数は空です。
.T3 "数値レジスタ\ ;3"
これには見出しの後に必要とされる行送りが単位付きで入ります。
デフォルトは 2v です。

これらは番号付け (\fB}0\fP)、垂直行送り (\fB}2\fP)、そして
見出しの後に必要な行送りの様な事柄を変更するのに使用出来ます。
.in
.sp
\fBHY\ \fP\fIdlevel\ rlevel\ heading-text\fP
.br
\fBHY\fP はサイズとフォントの計算の後に呼び出されます。
インデントを変更するために使えるでしょう。
.sp
\fBHZ\ \fP\fIdlevel\ rlevel\ heading-text\fP
.br
\fBHZ\fP は見出しの印字の後で、\fBH\fP 又は \fBHU\fP が終了する直前に、
呼ばれます。
これは、セクション見出しに従いページヘッダを変更する為に使うことが出来るでしょう。
.TP
.B "HC [hyphenation-character]"
ハイフネーション文字を設定します。
デフォルト文字は \e% です。
引数なしで呼ばれた時はデフォルトに再設定します。
ファイルの初めで数値レジスタ \fBHy\fP に 0 を設定すれば、
ハイフネーションを止められます。
.TP
.B "HM [arg1 [arg2 [... [arg7]]]]"
見出し記号の型。
見出しカウンタを印字する為の記号の型を制御します。
デフォルトは、すべてのレベルで 1 です。
.sp
\fB引数\fP
.in +.5i
.T2 1
アラビア数字
.T2 0001
ひとつ以上の 0 を先行したアラビア数字
.T2 A
大文字のアルファベット
.T2 a
小文字のアルファベット
.T2 I
大文字のローマ数字
.T2 i
小文字のローマ数字
.T2 \fI空\fP
アラビア数字
.in
.TP
.B "HU heading-text"
番号無しセクションヘッダ。
数値レジスタ \fBHu\fP をレベルとして \fBHU\fP は \fBH\fP の様に振舞います。
\fBH\fP を参照して下さい。
.TP
.B "HX dlevel rlevel heading-text"
ユーザ定義見出しの終了。
セクションヘッダを印字する直前に呼ばれます。
\fBH\fP を参照して下さい。
.TP
.B "HY dlevel rlevel heading-text"
ユーザ定義見出しの終了。
セクションヘッダを印字する直前に呼ばれます。
\fBH\fP を参照して下さい。
.TP
.B "HZ dlevel rlevel heading-text"
ユーザ定義見出しの終了。
セクションヘッダを印字した直後に呼ばれます。
\fBH\fP を参照して下さい。
.TP
.B "I [italic-text [prev-font-text [italic-text [...]]]]"
イタリック体です。
これは引数なしで呼ばれたならフォントをイタリック体に変更します。
引数が 1 個の場合には、これはその単語をイタリック体にします。
引数が 2 個の場合には、これは引数を連結し最初の単語にイタリック体を
設定し、2 番目に以前のままのフォントを設定します。
引数の数には制限はありません。
すべての引数は、連結されます。
.TP
.B "IA [addressee-name [title]]"
これはレター形式の受信人 (addressee) と受信人のアドレスの記述を
開始します。
いくつかの名前が空の \fBIA\fP/\fBIE\fP ペアにより指定できます。
しかし、アドレスは唯 1 つになります。
\fBLT\fP を参照して下さい。
.TP
.B "IB [italic-text [bold-text [italic-text [...]]]]"
イタリック体とボールド体。
偶数番目の引数がイタリック体で、奇数番目がボールド体で印字されます。
\fBI\fP を参照して下さい。
.TP
.B IE
\fPIA\fP の後でアドレス指定を終了します。
.TP
.B "INITR filename"
参照用マクロの初期化。
参照はファイル \fIfilename.tmp\fP と \fIfilename.qrf\fP とに
書き込まれます。
これには、groff の 2 回のパスが必要とされます。
最初のパスでは参照を探し、2 回目のパスではそれらを取り込みます。
\fBINITR\fP は数回使用できます。
しかし、有効なのは最初に出現した \fBINITR\fP だけです。
関連項目は、\fBSETR\fP, \fBGETPN\fP, \fBGETHN\fP です。
.TP
.B "IR [italic-text [roman-text [italic-text [...]]]]"
イタリック体とローマン体。
偶数番目の引数がイタリック体で、奇数番目がローマン体で印字されます。
\fBI\fP を参照して下さい。
.TP
.B "LB text-indent mark-indent pad type [mark [LI-space [LB-space]]]"
リスト開始マクロ。
これはすべてのリストに使用される共通のマクロです。
引数 \fItext-indent\fP は現在のインデントからテキストをインデントする
スペースの数です。
.sp
\fIpad\fP と \fImark-indent\fP は項目記号を置く所を指定します。
項目記号は記号領域に配置されます。
\fImark-indent\fP はこの領域の前のスペースの数を設定します。
これは通常 0 です。
記号領域はテキストが始まる所で終ります。
それでもなお、テキストの開始は \fItext-indent\fP により決められます。
.sp
もし \fIpad\fP が 0 ならば、項目記号は記号領域の中で左揃えされます。
もし\fIpad\fP が 0 より大きければ、その時は \fImark-indent\fP は無視されます。
そして項目記号はテキストに対しスペースで \fIpad\fP 個分前に配置されます。
この操作では、項目記号は右揃えされます。
.sp
もし \fItype\fP が 0 であれば、リストはハンギングインデントになるか、又は
引数の \fImark\fP が与えられていたら、文字列の \fImark\fP が項目記号
となります。
.sp
もし \fItype\fP が 0 より大きければ、自動的な番号付けが行われます。
更に \fImark\fP が空であれば、番号はアラビア数字となります。
この時、\fImark\fP には \fB1\fP, \fBA\fP, \fBa\fP, \fBI\fP, \fBi\fP
のどれでも指定出来ます。
.sp
\fItype\fP には項目記号を表示するため 6 通りの可能な方法の中から 1 つを選べます。
.br
\fBtype\fP
.in +.6i
.T2 1
x.
.T2 2
x)
.T2 3
(x)
.T2 4
[x]
.T2 5
<x>
.T2 6
{x}
.in
.sp
リストの各項目の前には \fILI-space\fP 行の空行が置かれます。
デフォルトは 1 です。
.sp
\fBLB\fP 自体には \fILB-space\fP 行の空行が印字されます。
デフォルトは 0 です。
.TP
.B "LC [list-level]"
リスト状態情報のクリア。
これにより、アクティブなリストが \fIlist-level\fP レベル迄、
あるいは引数が指定されなかった場合には 0 レベル迄、すべて終了されます。
これはアクティブなリストをすべてクリアする為に \fBH\fP により使用されます。
.TP
.B "LE [1]"
リストの終了。
これは現在のリストを終了します。
\fBLE\fP はもし引数が指定されているなら、空行を印字します。
.TP
.B "LI [mark [1]]"
リスト項目。
これは、リストの各項目の最初に置かれます。
引数がないときは、\fBLI\fP は、現在のリスト形式で決められる項目記号
を印字します。
\fBLI\fP に引数を 1 つ指定すると、それが代わりの項目記号として使用されます。
\fBLI\fP に引数を 2 つ指定すれば、\fImark\fP は現在の項目記号の接頭辞と
なります。
長さ 0 の \fImark\fP を指定した場合はハンギングインデントが生成されます。
.sp
通常はリスト項目の前に空行が印字されます。
この挙動は数値レジスタの \fBLs\fP を用いて制御出来ます。
\fBLs\fP 以下のすべてのリストレベルで先行する行送りが生成されます。
このレジスタのデフォルト値は 99 です。
(リストの入れ子は無制限です。:-)
.sp
インデントは数値レジスタの \fBLi\fP によって変えられます。
デフォルトは 6 です。
.sp
すべてのリストはリスト初期化マクロの \fBLB\fP により始まります。
しかし、リストを使いやすくする為に予め定義されているリストの形式が
7 つあります。
これらの形式はすべて異なったデフォルト値で \fBLB\fP を呼び出します。
.in +.5i
.T2 \fBAL\fP
自動増加番号リスト
.T2 \fBML\fP
記号付きリスト
.T2 \fBVL\fP
可変項目リスト
.T2 \fBBL\fP
黒丸リスト
.T2 \fBDL\fP
ダッシュリスト
.T2 \fBRL\fP
参照文献リスト
.T2 \fBBVL\fP
変則可変リスト
.in
これらのリストについてはこのマニュアルのほかの所に記述してあります。
関連項目は \fBLB\fP です。
.TP
.B "LT [arg]"
引数に基づいて 4 つの異なった形式の内の 1 つでレターを構成します。
関連項目は \fB内部\fP セクションです。
.in +.5i
.T2 \fBarg
形式\fP
.T2 BL
ブロック形式。日付欄、返送先アドレス、著者のアドレスと結辞は行の中央から始まります。
他のすべての行は左マージンから始まります。
.T2 SB
半ブロック形式。ブロック形式と同様ですが、
各段落の最初の行が スペース 5 個分インデントされます。
.T2 FB
全ブロック形式。すべての行が左マージンから始まります。
.T2 SP
簡易形式。全ブロック形式とほぼ同じです。
主題と著者の身分がすべて大文字で印字されます。
.in
.TP
.B "LO type [arg]"
レターのオプションを指定します (\fB.LT\fP を参照して下さい)。
以下に示すのは標準のオプションです。
.in +.5i
.T2 CN
機密表記。
日付欄の下 2 行目に \fBRESTRICTED\fP を印字します。
引数で \fBRESTRICTED\fP を置き換えられます。
関連項目は文字列変数 \fBLetCN\fP です。
.T2 RN
参考文献表記。
\fBIn reference to:\fP と引数を日付欄の 2 行下に印字します。
関連項目は文字列変数 \fBLetRN\fP です。
.T2 AT
気付。\fBATTENTION:\fP と引数を内部アドレスの下に印字します。
関連項目は文字列変数 \fBLetAT\fP です。
.T2 SA
頭辞。\fBTo Whom It May Concern:\fP か、又はもし指定されていた時には引数を
印字します。
頭辞は内部アドレスの 2 行下に印字されます。
関連項目は \fBLetSA\fP です。
.T2 SJ
主題欄。
レター形式 \fBSP\fP 以外の場合には、主題として \fBSUBJECT:\fP を
接頭辞として付けた引数を内部アドレスの 2 行下に印字します。
レター形式 \fBSP\fP の場合には、主題は接頭辞なしで、すべて大文字で印字されます。
関連項目は文字列変数の \fBLetSJ\fP です。
.in
.TP
.B "MC column-size [column-separation] "
多段組の開始。\fB1C\fP で通常状態に戻ります。
\fBMC\fP により現在の行長に入るだけの数のカラムが作られます。
\fIcolumn-size\fP は各カラムの幅で、\fIcolumn-separation\fP はカラムの間の
間隔です。
デフォルトの間隔は column-size/15 です。
関連項目は \fB1C\fP です。
.TP
.B "ML mark [text-indent [1]]"
記号付きリストの開始。
各リスト項目の前に引数の \fImark\fP が印字されます。
\fItext-indent\fP の指定により、インデントが設定され、
\fBLi\fP よりも優先されます。
第 3 引数により各項目の前の空行の印字が禁止されます。
.TP
.B "MT [arg [addressee]]"
覚書形式。
引数 \fIarg\fP は \fI/usr/share/tmac/mm/*.MT\fP というファイル名の部分です。
覚書の形式としては、\fI"string"\fP を含んで 0 から 5 迄サポートされています。
\fIaddressee\fP は単に、AT&T のマクロで使われる変数を設定するだけです。
.br
\fBarg\fP
.in +.5i
.T2 0
通常の覚書。形式は印字されません
.T2 1
\fIMEMORANDUM FOR FILE\fP が印字される覚書。
.T2 2
\fIPROGRAMMER'S NOTES\fP が印字される覚書。
.T2 3
\fIENGINEER'S NOTES\fP が印字される覚書。
.T2 4
公開論文形式。
.T2 5
外部へのレター形式。
.in
関連項目は、もっと柔軟な表題紙 \fBCOVER\fP/\fBCOVEND\fP です。
.TP
.B "MOVE y-pos [x-pos [line-length]]"
ある位置へ移動し、ページオフセットが \fIx-pos\fP に設定されます。
もし \fIline-length\fP が指定されなかったときは、現在の行長と
新しいページオフセットの差が使われます。
正常状態に戻るには、引数なしの \fBPGFORM\fP を使って下さい。
.TP
.B "MULB cw1 space1 [cw2 space2 [cw3 ...]]"
特殊多段組モードの開始。
各カラムの幅を指定しなければなりません。
また、カラム間の間隔も指定しなければなりません。
最後のカラムの後には間隔指定は必要ありません。
MULB により転換が開始し、MULE により転換が終了しカラムが印字されます。
幅と間隔の単位は「n」です。
しかし、MULB は「c」や「i」のような通常の単位指定をすべて受け付けます。
MULB は、隔離された環境下で機能します。
.TP
.B "MULN"
次のカラムの開始。
これは、カラムを切り替える唯一の方法です。
.TP
.B "MULE"
多段組モードの終了とカラムの印字。
.TP
.B "nP [type]"
2 段階のヘッダレベルを持つ番号付き段落の印字。
\&\fB.P\fP を参照して下さい。
.TP
.B "NS [arg [1]]"
異なる形式の注釈を印字します。
引数は予め定義された形式の注釈の中から選びます。
もし 2 番目の引数が利用可能であれば、引数が注釈全体になります。
もし引数が予め定義されたものの中になければ、このマクロは
\&\fBCopy (\fP\fIarg\fP\fB) to\fP のように印字されます。
さらに標準の注釈を加えることも可能です。
文字列変数の \fBLetns\fP と \fBLetnsdef\fP を参照して下さい。
.nf
.in +.5i
.T2 \fBarg
注釈\fP
.T2 \fIなし\fP
Copy To
.T2 """""
.\" "
Copy To
.T2 1
Copy To (with att.) to
.T2 2
Copy To (without att.) to
.T2 3
Att.
.T2 4
Atts.
.T2 5
Enc.
.T2 6
Encs.
.T2 7
Under separate cover
.T2 8
Letter to
.T2 9
Memorandum to
.T2 10
Copy (with atts.) to
.T2 11
Copy (without atts.) to
.T2 12
Abstract Only to
.T2 13
Complete Memorandum to
.T2 14
CC
.in
.fi
.TP
.B "ND new-date"
新しい日付。
現在の日付を置き換えます。
もし \fInew-date\fP が空文字列であれば、日付は印字されません。
.TP
.B "OF [arg]"
奇数ページフッタ。
通常のフッタのすぐ上に 1 行印字されます。
\fBEF\fP と \fBPF\fP を参照して下さい。
.TP
.B "OH [arg]"
奇数ページヘッダ。
通常のヘッダのすぐ下に 1 行印字されます。
\fBEH\fP と \fBPH\fP を参照して下さい。
.TP
.B OP
後続するテキストが奇数ページの一番上に印字されることを確認します。
もし現在奇数ページの一番上にいるなら、白紙ページの出力はしません。
.TP
.B "P [type]"
新しい段落の開始。
引数なしの \fBP\fP は、段落の一番最初の行も左揃えしたテキストを生成します。
これは、\fItype\fP に 0 を指定するのと同じです。
もし引数が 1 であれば、\fBP\fP に続くテキストの最初の行は
数値レジスタ \fBPi\fP に設定された数のスペースだけインデントされます。
この値は通常 5 です。
.sp
\&\fBP\fP への引数として 1 を指定する代わりに、数値レジスタ \fBPt\fP に
段落の形式を設定することも可能です。
0 と 1 を設定することは、その値を \fBP\fP に与えることと同じになります。
値 2 により、すべての段落がインデントされます。
ただし見出し、リスト、ディスプレイの後は例外です。
.sp
段落間の間隔は数値レジスタの \fBPs\fP により制御され、
デフォルトでは 1 です(1 行の空白行)。
.TP
.B "PGFORM [linelength [pagelength [pageoffset [1]]]]"
行長やページ長、ページオフセットを設定します。
このマクロは、レターヘッドや他のものの様に、特別の形式を生成するために
使用出来ます。
これは、通常はファイル中の最初のコマンドですが、必須ではありません。
\&\fBPGFORM\fP を引数なしで使用すれば、
\&\fBMOVE\fP の後ですべてを再初期化することが出来ます。
4 番目の引数が指定されなければ、行区切りが生成されます。
このマクロは、新しい行長とページ長を設定する一方、
最初のページにページ番号を出力するのを避けるために使用できます。
.TP
.B PGNH
次のページにヘッダが印字されません。
レターや他の特殊なテキストのヘッダを取り除くために使われます。
最初のページのページヘッダを禁止するためには、いかなるテキストよりも前に
このマクロが使われなければなりません。
.TP
.B PE
ピクチャの終り。
\&\fBpic\fP コマンドの為のピクチャを終了します。
\&\fBpic\fP コマンドのマニュアルを参照して下さい。
.TP
.B "PF [arg]"
ページフッタ。
\&\fBPF\fP は各ページの一番下に印字される行を設定します。
通常は空です。
引数の指定に関しては \fBPH\fP を参照して下さい。
.TP
.B "PH [arg]"
ページヘッダ。
各ページの一番上に 1 行印字されます。
引数は「'left-part'center-part'right-part'」のように
指定されなければなりません。
ここで、left-part, center-part, right-part はそれぞれ左揃え、中央揃え、右揃え
に印字されます。
文字 \fB%\fP は現在のページ番号に変更されます。
デフォルトのページヘッダは「''- % -''」で、ページ番号が 2 個のダッシュ記号に
はさまれます。
.TP
.B PS
ピクチャの開始 (pic コマンドより)。
\&\fB@TMAC@pic\fP の為のピクチャを開始します。
マニュアルを参照して下さい。
.TP
.B PX
ページヘッダのユーザ定義による出口マクロ。
\&\fIno-space\fP モードでページヘッダの印字の直後に \fBPX\fP は呼び出されます。
.TP
.B R
ローマン体。
ローマンフォントに戻ります。
関連項目は \fBI\fP です。
.TP
.B "RB [roman-text [bold-text [roman-text [...]]]]"
ローマン体とボールド体。
偶数番目の引数はローマン体で印字されます。
奇数番目は、ボールド体で印字されます。
\fBI\fP を参照して下さい。
.TP
.B "RD [prompt [diversion [string]]]"
標準入力から転換や文字列変数に読み込みます。
テキストは \fIdiversion\fP という名前の転換に保存されます。
テキストを取り出すには、空行にドットの後に転換の名前を書いて下さい。
もし \fIstring\fP が指定されたなら文字列変数 \fIstring\fP
も定義されます。
\&\fIdiversion\fP や \fIprompt\fP は空 ("") にすることが出来ます。
.TP
.B RF
参考文献の終了。
参考文献の定義を終了し、通常の処理に復帰します。
\&\fBRS\fP を参照して下さい。
.TP
.B "RI [roman-text [italic-text [roman-text [...]]]]"
偶数番目の引数はローマン体で印字されます。
奇数番目はイタリック体で印字されます。
\&\fBI\fP を参照して下さい。
.TP
.B "RL [text-indent [1]]"
参考文献リストの開始。
各項目の前に角括弧で挟まれた自動増加の番号を付けたリストを開始します。
\&\fItext-indent\fP によって、デフォルトのインデントを変更出来ます。
.TP
.B "RP [arg1 [arg2]]"
参考文献ページを生成します。
もし参考文献ページが文書のどこかで必要とされているなら
\fBRP\fP を用いることが出来ます。
もし \fBTC\fP が目次の生成に使われているなら、このマクロは必要ありません。
その時は参考文献ページは自動的に印字されます。
.sp
もし \fIarg1\fP が 1 ならば参考文献カウンタは再初期化されません。
.sp
引数 \fIarg2\fP により \fBRP\fP に対しページ切替が行われるか否か
を指定出来ます。
.br
\fBarg2\fP
.in +.5i
.T2 0
参考文献ページは別のページに印字されます。
これがデフォルトです。
.T2 1
リストの後でページを切り替えません。
.T2 2
ページの前でページを切り替えません。
.T2 3
リストの前後でページを切り替えません。
.in
参考文献の項目は空行で分離されます。
数値レジスタの \fBLs\fP を 0 に設定すれば、この空行は抑止出来ます。
.sp
文字列変数の \fBRp\fP には参考文献ページの題名が入っています。
この題名は通常は \fIREFERENCES\fP に設定されています。
.TP
.B "RS [string-name]"
\&\fBRS\fP により自動番号付けの参考文献の定義が開始します。
文字列変数の \fB\e*(Rf\fP を参考文献記号があるべき所に配置し、
参考文献を参考文献記号の後の次の改行のところから \fBRS\fP/\fBRF\fP
の間に挟んで書いて下さい。
参考文献番号は数値レジスタの \fB:R\fP に保存されています。
もし \fIstring-name\fP が指定されたら、その名前の文字列変数が
定義され、現在の参考文献記号が入れられます。
文字列変数はその後テキスト中で \fB\e*[\fIstring-name\fP]\fP により
参照することが出来ます。
.TP
.B "S [size [spacing]]"
ポイントサイズと垂直行送りを設定します。
もし引数のどれかが「P」に等しければ、そのときは以前の値が用いられます。
「C」は現在の値を表し、「D」はデフォルトの値を表します。
もし、「+」又は「-」が値の前に用いられているなら、現在の値に加算又は減算
が行われます。
.TP
.B "SA [arg]"
右マージン行末揃えが設定されます。
通常、行末揃えは機能しています。
引数がないか、または \fB0\fP であれば、行末揃えは機能を止められます。
引数が \fB1\fP であれば、行末揃えは機能を働かせます。
.TP
.B "SETR refname [string]"
現在のヘッダ番号とページ番号を refname として記憶します。
もし \fIstring\fP が定義されていれば、\fIstring\fP を保存します。
\fIstring\fP は \fB.GETST\fP によって取り出されます。
\fBINITR\fP を参照して下さい。
.TP
.B "SG [arg [1]]"
署名欄。
正式な結辞の後に著者(達)の名前を印字します。
引数は参照データに加えられて、最初か最後の著者の箇所に印字されます。
参照データとは \fB.AU\fP により指定される
所在地、部局、及びイニシャルです。
このデータは、最初の著者か、そうでなければ最後の著者の箇所に印字されます。
著者(達)が \fB.WA\fP/\fB.WE\fP で指定されていれば、
何の参照データも印字されません。
\&\fBLetter 内部\fP セクションを参照して下さい。
.TP
.B "SK [pages]"
ページ送りします。
もし \fIpages\fP が \fB0\fP であるか省略されている場合には、既に印字位置が
ページの一番上でなければ、次のページ迄ページ送りされます。
また、\fIpages\fP がこれら以外であれば、\fIpages\fP のページを
ページ送りします。
.TP
.B "SM string1 [string2 [string3]]"
文字列を小さくします。
もし \fIstring2\fP が指定されたときには、\fIstring1\fP
は小さくなり、\fIstring2\fP は通常の大きさで \fIstring1\fP に結合されます。
引数が 3 個あるときには、すべての引数が結合され、
\fIstring2\fP だけが小さくなります。
.TP
.B "SP [lines]"
垂直に行送りします。
\fIlines\fP には \fI3i\fP や \fI8v\fP の様に、何らかの単位を付けられます。
1 行にいくつかの \fBSP\fP を記述しても、それらの合計の行数ではなく、
それらのうちで最大の行数の行送りを生成します。
またページの最初のテキスト行までは \fBSP\fP は無視されます。
これを避けるには、\fBSP\fP の前に \fB\e&\fP を加えて下さい。
.TP
.B TAB
タブ位置を 5n 毎に再設定します。
通常はそれまでの任意のタブ設定位置を再設定するのに使用されます。
.TP
.B "TB [title [override [flag [refname]]]]"
表の題目。
もし \fIrefname\fP が指定されれば、表番号が
\&\fB.SETR\fP によって保存されます。
これは、\fB.GETST\fP \fIrefname\fP によって取り出せます。
.TP
.B "TC [slevel [spacing [tlevel [tab [h1 [h2 [h3 [h4 [h5]]]]]]]]]"
目次。
通常このマクロは文書の最後の行に置かれます。
このマクロは、数値レジスタの \fBCl\fP によって制御されるレベルまでの
見出しで構成される目次を生成します。
\fBCl\fP は見出しの保存を制御するのであって、\fBTC\fP には
何の関わりもないことに注意して下さい。
\fIslevel\fP 以下のレベルの見出しにはそれらの前に \fIspacing\fP
だけの空行が生成されます。
\fItlevel\fP 以下のレベルの見出しには右揃えした対応するページ番号が置かれます。
これらの見出しのテキストとページ番号はドットか空白によって分離されます。
もし \fItab\fP が 0 より大きければ、空白が用いられます。
そうでなければ、ドットが用いられます。
その他の見出しには見出しテキストの末尾にページ番号が直接置かれます
(\fI右揃えしない\fP)。
.sp
引数の残りのものは、目次の前に中央揃えで印字されます。
.sp
もし \fBTC\fP が多くて 4 個の引数を伴って呼び出されるならば、ユーザ定義の
マクロ \fBTX\fP と \fBTY\fP が使われます。
\fBTX\fP は \fICONTENTS\fP の印字の前に呼び出されます。
そして \fBTY\fP は \fICONTENTS\fP を印字する代わりに呼び出されます。
.sp
文字列変数 \fBCi\fP を各見出しレベルのインデントを制御するために
設定できます。
インデントには \fB.ds\ Ci\ .25i\ .5i\ .75i\ 1i\ 1i\fP の様に
単位を付けなければなりません。
インデントは通常各レベルの見出しの最大長によって制御されます。
.sp
すべてのテキストは再定義が出来ます。
新しい文字列変数の \fILifg\fP, \fILitb\fP, \fILiex\fP, \fILiec\fP,
\fILicon\fP にはそれぞれ
「Figure」、「TABLE」、「Exhibit」、「Equation」及び「CONTENTS」
が入っています。
これらの変数は、他の言語に再定義できます。
.TP
.B TE
表の終了。
\&\fBTS\fP を参照して下さい。
.TP
.B "TH [N]"
表のヘッダ。
\&\fBTS\fP を参照して下さい。
\&\fBTH\fP により表のヘッダが終了します。
もしページ区切りが起こればこのヘッダはもう一度印字されます。
引数の \fIN\fP はまだ実装されていません。
.TP
.B TL [charging-case number(s) [filing-case number(s)]]
覚書の題名の開始。
次の \fBAU\fP 迄のすべてのテキストが題名に含められます。
\&\fIcharging-case number\fP と \fIfiling-case number\fP は
表題紙を処理するために保存されます。
.TP
.B TM [num1 [num2 [...]]]
\&\fB.MT\fP で使われる技術覚書番号。
無制限な数の引数を指定できます。
.TP
.B TP
ユーザが定義するページ最上部のマクロです。
このマクロは通常のページヘッダの代わりに呼ばれます。
ヘッダに対して完全な制御が出来ます。
ヘッダとフッタは隔離された環境下で印字されることに注意して下さい。
ただし、行長は保持されています。
.TP
.B "TS [H]"
表の開始。
これは \fB@TMAC@tbl\fP に対する表の指定の開始です。
\&\fB@TMAC@tbl\fP については別個のマニュアルを参照して下さい。
\&\fBTS\fP は、\fBTE\fP により終了します。
引数 \fIH\fP は \fBm@TMAC@m\fP に対し表にはヘッダがあることを指定します。
\&\fBTH\fP を参照して下さい。
.TP
.B TX
ユーザが定義する目次の出口マクロ。
このマクロは \fBTC\fP が単語 \fICONTENTS\fP を印字する直前に呼び出されます。
\&\fBTC\fP を参照して下さい。
.TP
.B TY
ユーザが定義する目次の出口マクロ (「CONTENTS」は印字しません)。
\&\fICONTENTS\fP を印字する代わりにこのマクロが呼び出されます。
\&\fBTC\fP を参照して下さい。
.TP
.B VERBON [flag [pointsize [font]]]
クーリエフォントを用いた逐語的な出力の開始。
通常プログラムの印字のためです。
すべての文字が等しい幅を持ちます。
ポイントサイズは第 2 引数により変更できます。
font 引数を指定すればクーリエの代わりに他のフォントを使うことが出来ます。
\fIflag\fP によりいくつかの特別な機能を制御します。
この引数は必要とする機能をすべて合計したものとなります。
.in +.5i
.T2 値
説明
.T2 1
エスケープ文字 (\e) を無効にします。
通常、これは冗長出力の間は働いています。
.T2 2
冗長テキストの前に空行を付加します。
.T2 4
冗長テキストの後に空行を付加します。
.T2 8
冗長テキストに行番号を振って印字します。
これにより各行の先頭に数字幅のスペースが 4 個付加されます。
文字列変数の \fBVerbnm\fP でより微妙な調節が可能です。
この変数には、\fBtroff\fP コマンドの \fB.nm\fP に指定できる
すべての引数が入ります。
通常は「1」が指定されています。
.T2 16
冗長テキストを 5 個の「n」だけインデントします。
これは数値変数の \fBVerbin\fP (単位付き) により管理されます。
.in
.TP
.B VERBOFF
逐語的出力を終了させます。
.TP
.B "VL text-indent [mark-indent [1]]"
可変項目リストには決まった項目記号はありません。
代わりに、このマクロでは各 \fBLI\fP に項目記号が指定されている
と仮定しています。
\fItext-indent\fP によりテキストへのインデントが設定されます。
そして \fImark-indent\fP により現在のインデント位置から項目記号までの
距離が設定されます。
第 3 引数は各項目の前に空行が印字されることを禁止します。
.TP
.B "VM [top [bottom]]"
垂直マージン。
.TP
.B "WA [writer-name [title]]"
著者と著者のアドレスの記述を開始します。
空の \fBWA\fP/\fBWE\fP ペアでいくつかの名前を指定出来ます。
しかしアドレスについては 1 つだけです。
.TP
.B WE
\&\fP.WA\fP の後でアドレスの指定を終了します。
.TP
.B "WC [format]"
脚注とディスプレイの幅の調整。
.in +.5i
.T2 N
デフォルトのモードを設定します。
\&\fB-WF\fP, \fB-FF\fP, \fB-WD\fP 及び \fBFB\fP です。
.T2 WF
広い脚注です。2 段組モードでもやはり広い脚注です。
.T2 -WF
通常の脚注の幅です。段組モードに従います。
.T2 FF
すべての脚注は最初に出現した脚注と同じ幅になります。
.T2 -FF
通常の脚注です。幅は \fBWF\fP と \fB-WF\fP に従います。
.T2 WD
広いディスプレイです。2 段組モードでもやはり広いディスプレイです。
.T2 -WD
通常のディスプレイの幅です。段組モードに従います。
.T2 FB
フローティングディスプレイが現在のページに印字された時には
行区切りを生成します。
.T2 -FB
フローティングディスプレイは行区切を生成しません。
.in
.sp 3
.LP
.\"########################################################################"
.LP
.B "mm で用いられている文字列変数:"
.TP
.B App
単語「APPENDIX」が入れてある文字列変数です。
.TP
.B "EM"
em ダッシュ文字列です。
.TP
.B HF
見出し用のフォントの目録です。
通常は「2 2 2 2 2 2 2」です。
数字ではないフォント名も使用できます。
.TP
.B HP
見出し用のポイントサイズの目録です。
通常は「0 0 0 0 0 0 0」です。
これは、「10 10 10 10 10 10 10」と同じです。
.TP
.B Lifg
\fIFigure\fP を入れている文字列変数です。
.TP
.B Litb
\fITABLE\fP を入れている文字列変数です。
.TP
.B Liex
\fIExhibit\fP を入れている文字列変数です。
.TP
.B Liec
\&\fIEquation\fP を入れている文字列変数です。
.TP
.B Licon
\&\fICONTENTS\fP を入れている文字列変数です。
.TP
.B Lf
「LIST OF FIGURES」を入れています。
.TP
.B Lt
「LIST OF TABLES」を入れています。
.TP
.B Lx
「LIST OF EXHIBITS」を入れています。
.TP
.B Le
「LIST OF EQUATIONS」を入れています。
.TP
.B Letfc
「Yours very truly,」を入れています。
\&\fB.FC\fP で使用されます。
.TP
.B Letapp
「APPROVED:」を入れています。
\&\fB.AV\fP で使用されます。
.TP
.B Letdate
「Date」を入れています。
\&\fB.AV\fP で使用されます。
.TP
.B LetCN
「CONFIDENTIAL」を入れています。
\&\fB.LO CN\fP で使用されます。
.TP
.B LetSA
「To Whom It May Concern:」を入れています。
\&\fB.LO SA\fP で使用されます。
.TP
.B LetAT
「ATTENTION:」を入れています。
\&\fB.LO AT\fP で使用されます。
.TP
.B LetSJ
「SUBJECT:」を入れています。
\&\fB.LO SJ\fP で使用されます。
.TP
.B LetRN
「In reference to:」を入れています。
\&\fB.LO RN\fP で使用されます。
.TP
.B Letns
これは \fB.NS\fP で使用されている色々な文字列を入れている配列です。
これらは実は、\fBLetns!\fP を接頭辞とするいくつかの文字列変数です。
もし \fB.NS\fP への引数が (訳注: 予め定義されているものの中に) 存在しなければ、
その引数は \fBLetns!copy\fP を接頭辞とし \fBLetns!to\fP を接尾辞
として \fB()\fP の間に挟まれます。
\fBcopy\fP の後と \fBto\fP の前の空白に注意して下さい。
.nf
.ta 1.5i
\fB変数名	値\fP
Letns!0	Copy to
Letns!1	Copy (with att.) to
Letns!2	Copy (without att.) to
Letns!3	Att.
Letns!4	Atts.
Letns!5	Enc.
Letns!6	Encs.
Letns!7	Under separate cover
Letns!8	Letter to
Letns!9	Memorandum to
Letns!10	Copy (with atts.) to
Letns!11	Copy (without atts.) to
Letns!12	Abstract Only to
Letns!13	Complete Memorandum to
Letns!14	CC
Letns!copy	Copy "
Letns!to	" to
.fi
.TP
.B Letnsdef
\&\fB.NS\fP に何も引数が指定されていないときに使用される標準的な注釈を
定義します。
デフォルトは \fB0\fP です。
.TP
.B "MO1 - MO12"
\&\fIJanuary\fP から \fIDecember\fP 迄が入っている文字列変数です。
.TP
.B Qrf
「See chapter \e\e*[Qrfh], page \e\en[Qrfp].」
が入っている文字列変数です。
.TP
.B Rp
「REFERENCES」が入っています。
.TP
.B Tm
商標記号 \e(tm が入っています。
.TP
.B Verbnm
\&\fB.VERBON\fP で使用されている \fB.nm\fP への引数です。
デフォルト: \fB1\fP。
.\"-----------------------------------"
.LP
.B "mm で使用されている数値変数:"
.TP
.B Aph
もしこの数値変数が非 0 であれば、
各々の新しい付録について新しい付録ページに印字します。
もし \fBAph\fP が 0 であれば何も出力されません。
しかし、「目次」には付録の見出し項目が常に含まれます。
.TP
.B Cl
目次の見出し項目レベル。範囲は [0:7] です。
もし見出しレベルが Cl 以下であれば、目次の見出し項目は保存されます。
デフォルトは 2 です。
.TP
.B Cp
もし、Cp が 0 であれば、LIST OF XXXX の間で改ページを行います。
デフォルトは 0 です。
.TP
.B D
デバッグフラグ。
値が正値であれば、様々な段階のデバッグリストを出力します。
値が 1 であれば整形についての進行情報を提供します。
デフォルトは 0 です。
.TP
.B De
フローティングディスプレイの後で改ページが出力されます。
範囲は [0:1] です。デフォルトは 0 です。
.TP
.B Df
フローティングキープの出力形式。
範囲は [0:5] です。デフォルトは 5 です。
.TP
.B Ds
もし 1 であれば、ディスプレイの前後で行送りします。
範囲は [0:1] です。デフォルトは 1 です。
.TP
.B Ej
改ページ。デフォルトは 0 です。
.TP
.B Eq
数式ラベルの行揃え。
0 なら左揃え、1 なら右揃え。デフォルトは 0 です。
.TP
.B Fs
脚注の行送り。デフォルトは 1 です。
.TP
.B "H1-H7"
見出しカウンタ。
.TP
.B Hb
見出し行区切りのレベル。
範囲は [0:7] です。デフォルトは 2 です。
.TP
.B Hc
見出し中央揃えのレベル。
範囲は [0:7] です。デフォルトは 0 です。
.TP
.B Hi
見出しの一時的なインデント。
範囲は [0:2] です。デフォルトは 1 です。
.br
0\ ->\ 0 インデント、左マージン
.br
1\ ->\ 右へインデント、.P 1 と同様
.br
2\ ->\ 先行する見出しのテキスト部分に合わせてインデント
.TP
.B Hps
見出しに先立つ行送りのレベルについての数値変数です。
もし見出しレベルが \fBHps\fP 以下ならば、
セクション見出しには 1 行ではなく 2 行が先行します。
デフォルトは第 1 レベルだけです。
行送りの実際の量は変数 \fBHps1\fP と \fBHps2\fP により制御されます。
.TP
.B Hps1
見出しレベルが \fBHps\fP より大きい場合に \fB.H\fP に先行する行数です。
値には単位を付けます。通常は 0.5v です。
.TP
.B Hps2
見出しレベルが \fBHps\fP 以下の場合に \fB.H\fP に先行する行数です。
値には単位を付けます。通常は 1v です。
.TP
.B Hs
見出し行送りレベル。
範囲は [0:7] です。デフォルトは 2 です。
.TP
.B Ht
見出し番号の形式。デフォルトは 0 です。
0 -> 複合番号 (1.1.1 ...)
.br
1 -> 単一番号。
.TP
.B Hu
番号無し見出しのレベル。デフォルトは 2 です。
.TP
.B Hy
本文のハイフネーション。デフォルトは 1 です。
.br
0\ ->\ ハイフネーションしない。
.br
1\ ->\ 14 でハイフネーションをする。
.TP
.B Letwam
\fB.WA\fP/\fB.WE\fP で使われる返送先アドレスの最大行数。
デフォルトは 14 です。
.TP
.B "Lf, Lt, Lx, Le"
それぞれ、図のリスト、表のリスト、エグジビットのリスト、数式のリストの
印字の許可 (1)、又は禁止 (0) です。
デフォルトは、Lf=1, Lt=1, Lx=1, Le=0 です。
.TP
.B Li
\&.AL で使われるリストのインデントです。
デフォルトは 6 です。
.TP
.B Ls
リストの行送り。
もし現在のリストレベルが Ls より大きければ、
リストの周囲には行送りは生じません。
デフォルトは 99 です。
.TP
.B Lsp
空行の大きさ。通常は 0.5v です。
しかし、もし \fBn\fP が設定されていれば (\fB.nroff\fP)、1v となります。
.TP
.B N
番号付けの形式。範囲は [0:5] です。デフォルトは 0 です。
.br
0\ ==\ (デフォルト) すべてのページで通常のヘッダ。
.br
1\ ==\ 最初のページのフッタはヘッダに置き換えられます。
ヘッダ部分には何もありません。
.br
2\ ==\ 最初のページのページヘッダは取り除かれます。
.br
3\ ==\ 「セクション - ページ」の番号付けが有効になります。
.br
4\ ==\ 最初のページのページヘッダは取り除かれます。
.br
5\ ==\ 「セクション - ページ」と「セクション - 図」の番号付けが有効になります。
関連項目は数値レジスタの Sectf と Sectp です。
.TP
.B Np
番号付きの段落です。デフォルトは 0 です。
.br
0\ ==\ 番号を振りません。
.br
1\ ==\ 第 1 レベルの見出しに番号を振ります。
.TP
.B Of
図、表、エグジビット、数式の題目の形式です。
デフォルトは 0 です。
.br
0\ =\ ". "
.br
1\ =\ " - "
.TP
.B P
現在のページ番号です。
「セクション - ページ」の番号付けが有効でなければ、
通常は % と同じです。
.TP
.B Pi
段落のインデントです。
デフォルトは 5 です。
.TP
.B Pgps
ヘッダとフッタのポイントサイズが、現在の設定に従うべきか、
あるいはヘッダとフッタが定義されたときにだけ変更されるべきかを制御します。
.in +.5i
.ti -.5i
.T2 値
説明
.T2 0
\fB.PH\fP, \fB.PF\fP, \fB.OH\fP, \fP.EH\fP, \fB.OF\fP, \fB.OE\fP
が実行された時だけ、ポイントサイズが現在の設定に変更されます。
.T2 1
ポイントサイズは \fB.S\fP のたびに変更されます。
これがデフォルトです。
.in
.TP
.B Ps
段落の行送り。デフォルトは 1 です。
.TP
.B Pt
段落の形式です。デフォルトは 0 です。
.br
0\ ==\ 左揃え
.br
1\ ==\ インデントする .P
.br
2\ ==\ .H, .DE, .LE の後以外では、インデントする .P
.TP
.B Sectf
「セクション - 図」を制御するフラグです。
非 0 値であれば有効になります。
関連項目はレジスタ N です。
.TP
.B Sectp
「セクション - ページ番号」を制御するフラグです。
非 0 値であれば有効になります。
関連項目はレジスタ N です。
.TP
.B Si
ディスプレイのインデントです。デフォルトは 5 です。
.TP
.B Verbin
\&\fB.VERBON\fP のインデントです。デフォルトは 5n です。
.TP
.B .mgm
常に 1 です。
.LP
.SH 内部
レターマクロではレターの形式により決まる種々の副マクロが使用されています。
副マクロの名前にはレターの形式が接尾辞として入っています。
そのため他のレターの形式の定義を、
その国のマクロファイル内や、局所的な追加として行うことが可能です。
\&\fB.LT\fP は数値変数の \fBPt\fP と \fBPi\fP を 0 と 5 に設定します。
新しいレター形式については、
以下の文字列変数とマクロを定義しなければなりません:
.TP
\fBlet@init_\fP\fItype\fP
このマクロは \fB.LT\fP によって直接呼び出されます。
変数や他の要素を初期化することになっています。
.TP
\fBlet@head_\fP\fItype\fP
このマクロはレターヘッドを印字します。
通常のページヘッダの代わりに呼び出されます。
\fBlet@header\fP という別名を取り除くことになっています。
そうしなければ、この別名はすべてのページにおいて呼び出されてしまいます。
.TP
\fBlet@sg_\fP\fItype\ name\ title\ n\ flag\ [arg1\ [arg2\ [...]]]\fP
レターの場合だけ、\fB.SG\fP がこのマクロを呼び出します。
覚書にはそれ独自の処理機構があります。
\fIname\fP と \fItitle\fP は \fB.WA\fP/\fB.WB\fP によって指定されます。
\fIn\fP はカウンタで、1 から max までです。
そして \fIflag\fP は、\fIname\fP が最後の名前であれば真の値になります。
\&\fB.SG\fP に対する他の引数が追加されます。
.TP
\fBlet@fc_\fP\fItype\ closing\fP
このマクロは \fB.FC\fP によって呼び出され、正式な結辞を引数とします。
.LP
\&\fB.LO\fP が包括的なオプションマクロとして実装されています。
\&\fB.LO\fP には \fBLet\fP\fItype\fP という名前の文字列変数が
定義されていることが必要とされます。
ここで、\fItype\fP はレターの形式です。
そのとき、\fB.LO\fP は引数を文字列変数 \fBlet*lo-\fP\fItype\fP に
割り当てます。
.LP
.\".SH バグ
.\" "
.SH 作者
.ie t J\(:orgen H\(:agg, Lund, Sweden <jh@axis.se>
.el Jorgen Hagg, Lund, Sweden <jh@axis.se>
.SH 関連ファイル
.TP
.B /usr/share/tmac/tmac.m
.TP
.B /usr/share/tmac/mm/*.cov
.TP
.B /usr/share/tmac/mm/*.MT
.TP
.B /usr/share/tmac/mm/locale
.SH 関連項目
.BR groff (1),
.BR troff (1),
.BR tbl (1),
.BR pic (1),
.BR eqn (1)
.br
.BR mm (7)
.BR mmse (7)
.\" Translated by Tetsuro FURUYA <ht5t-fry@asahi-net.or.jp>, Dec., 1998.
