freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_mmse.7
.\"
.\" $Id: groff_mmse.7,v 1.11 2002-12-09 03:41:43 horikawa Exp $
.\" Skrivet av Joergen Haegg, Lund, Sverige
.\"
.\" $FreeBSD$
.TH GROFF_MMSE 7 "11 October 2002" "Groff Version 1.18.1"
.SH 名称
groff_mmse \- groff 用スウェーデン語版 mm マクロ
.SH 書式
.B groff
.B \-mmse
[
.IR flaggor .\|.\|.
]
[
.IR filer .\|.\|.
]
.SH 解説
.\"X DESCRIPTION
.\"X	mmse is a swedish flavor of mm. All internal texts are
.\"X	translated. An A4-page gets 13 cm long text lines, 3.5 cm
.\"X	left margin and 28.5 cm in height. There are support for
.\"X	swedish letter standard, both left and right adjusted text.
.\"X
.\"X	The macro COVER can use se_ms as an argument which will
.\"X	produce a swedish front page. Look in groff_mm(7) for more
.\"X	details.
\fBmmse\fP はスウェーデン語風の \fBmm\fP マクロです。すべての内部
テキストは翻訳されます。A4 ページでは、テキスト行の長さが 13 cm、
左マージンが 3.5 cm、高さが 28.5 cm です。スウェーデンのレター清書標準を、
右揃えと左揃えともにサポートしています。
.LP
マクロ \fBCOVER\fP に引数 \fIse_ms\fP を使用することにより、
スウェーデン語のフロントページを生成することができます。詳細については
\fBgroff_mm(7)\fP を参照して下さい。
.PP
(訳注: 以下未訳)
.SH 謝辞
Jorgen Hagg, Lund, Sweden <Jorgen.Hagg@axis.se>
本和訳のために、解説部分の英訳をわざわざ用意下さいました。
.SH BREV
Tillgangliga brevtyper:
.TP
.B ".LT SVV"
Vansterstalld loptext med adressat i position T0 (vansterstallt).
.TP
.B ".LT SVH"
Hoverstalld loptext med adressat i position T4 (passar
forsterkuvert).
.LP
Foljande extra LO-variabler anvands.
.TP
.B ".LO DNAMN\fI namn\fP"
Anger dokumentets namn.
.TP
.br
.B ".LO MDAT\fI datum\fP"
Mottagarens datum, anges under \fBErt datum:\fP (\fBLetMDAT\fP).
.TP
.br
.B ".LO BIL\fI strang\fP"
Anger bilaga, nummer eller strang med \fBBilaga\fP (\fBLetBIL\fP)
som prefix.
.TP
.br
.B ".LO KOMP\fI text\fP"
Anger kompletteringsuppgift.
.TP
.br
.B ".LO DBET\fI beteckning\fP"
Anger dokumentbeteckning eller dokumentnummer.
.TP
.br
.B ".LO BET\fI beteckning\fP"
Anger beteckning (arendebeteckning i form av diarienummer eller liknande).
.TP
.br
.B ".LO SIDOR\fI antal\fP"
Anger totala antalet sidor och skrivs ut efter sidnumret inom
parenteser.
.LP
Om makrot \fB.TP\fP ar definierat anropas det efter utskrift av brevhuvudet.
Dar lagger man lampligen in postadress och annat som brevfot.
.SH "SKRIVET AV"
Jorgen Hagg, Lund, Sweden <Jorgen.Hagg@axis.se>
.SH FILER
.B /usr/share/tmac/tmac.mse
.B /usr/share/tmac/mm/se_*.cov
.SH "SE OCKSO"
.BR groff (1),
.BR troff (1),
.BR tbl (1),
.BR pic (1),
.BR eqn (1)
.br
.BR groff_mm (7)
.
.\" Local Variables:
.\" mode: nroff
.\" End:
