freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_www.7
.\" $FreeBSD$
.TH GROFF_WWW 7 "11 October 2002" "Groff Version 1.19"
.\" Copyright (C) 2000, 2001, 2002 Free Software Foundation, Inc.
.\"      Written by Gaius Mulley (gaius@glam.ac.uk)
.\"
.\" This file is part of groff.
.\"
.\" groff is free software; you can redistribute it and/or modify it under
.\" the terms of the GNU General Public License as published by the Free
.\" Software Foundation; either version 2, or (at your option) any later
.\" version.
.\"
.\" groff is distributed in the hope that it will be useful, but WITHOUT ANY
.\" WARRANTY; without even the implied warranty of MERCHANTABILITY or
.\" FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
.\" for more details.
.\"
.\" You should have received a copy of the GNU General Public License along
.\" with groff; see the file COPYING.  If not, write to the Free Software
.\" Foundation, 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
.\"
.\" user level guide to using the -mwww macroset
.\"
.
.do mso www.tmac
.
.\" we need the .LK here as we use it in the middle as an example --
.\" once the user requests .LK then the automatic generation of links
.\" at the top of the document is suppressed.
.LK
.
.
.SH 名称
groff_www \- ウェブページのオーサリング用 groff マクロ
.HR
.SH 書式
.B "groff \-mwww"
[ options ]
file ...
.
.
.SH 解説
このマニュアルページは、GNU \-mwww マクロについて解説しています。
これは、groff ドキュメント整形システムの一部です。
このマニュアルページは、ごく基本的なガイドに過ぎませんし、
html デバイスドライバ
.RB (grohtml)
は完全に書き直されましたがいまだにアルファ版という段階です。
多くの人達がテストする機会を持てるようにするため、
このマクロを配布物に含めているのです。
このマクロファイルは、\fC-Thtml\fP を使用すれば
(\fCtroffrc\fP ファイルによって) 自動的に呼ばれるのだということに
注意してください。
.PP
ハイパーリンクが動作することを確認するには、このマニュアルページを
.B grohtml
デバイスを用いて整形してください。
.PP
このマクロセットで見つかる機能の概要です。
.ta 2iL
.nf
\&.HX	自動的なヘッダレベルの切り捨て。
	$1 がセクション/ヘッダを指します。
\&.BCL	ウェブページの色を指定します。
\&.BGIMG	背景画像を指定します。
\&.URL	2 つのパラメータを用いて URL を作成します。
\&.FTP	FTP への参照を作成します。
\&.MTO	HTML email アドレスを作成します。
\&.FTP	FTP への参照を作成します。
\&.TAG	HTML の name を作成します。
\&.IMG	画像ファイルを挿入します。
\&.PIMG	PNG 画像を挿入します。
\&.MPIMG	PNG を余白に置き、その周辺をテキストで包みます。
\&.HnS	見出しを開始します。
\&.HnE	見出しを終了します。
\&.LK	自動的に収集されたリンクを出力します。
\&.HR	水平罫線を出力します。
\&.NHR	罫線の自動生成を抑制します。
\&.HTL	HTML タイトルのみを作成します。
\&.ULS	順序無しリストを開始します。
\&.ULE	順序無しリストを終了します。
\&.LI	リスト項目を挿入します。
\&.DC	ドロップキャピタルを作成します。
\&.HTML	HTML の生リクエストをデバイスドライバに渡します。
.fi
.PP
Output of the
.BR pic ,
.BR eqn ,
.BR refer ,
.B tbl
プリプロセッサの出力を入力として受け付けることができます。
.
.
.SH リクエスト
.TP
.B HX
見出しに対して自動的に作成されるリンクの
切り捨てレベルを決定します。
パラメータに 2 を指定すると、
.B grohtml
は
.B .NH\ 1
と
.B .NH\ 2
にはリンクのリストを作成しますが、
.BR .NH\ 3
に対してはしません。
.RS
.IP
.nf
.B .HX 0
.fi
.RE
.IP
とすると、
.B grohtml
がリンクを生成しないようになります。
自動的な見出しをオフにする別の方法は、
.BR groff
のコマンドラインスイッチ \fC-P-l\fP です。
.
.TP
.B BCL
5 つパラメータを取ります: 文字色、背景色、アクティブな
ハイパーリンクの色、まだ訪問したことがない
ハイパーリンクの色、そして訪問したことのある
ハイパーリンクの色です。
.
.TP
.B BGIMG
このマクロの唯一のパラメータは、背景画像ファイルを示します。
.
.TP
.B URL
2 つあるいは 3 つのパラメータを使用して
.TAG URL
URL を生成します。
第 1 パラメータはリンク名、第 2 パラメータは実際の URL、
そして第 3 パラメータは省略可能であり直後に印字されます。
実際の URL を印字中はハイフネーションは無効化されます。
明示的な改行位置を
.B \[rs]:
エスケープで挿入すべきです。
以下に
.URL http://\:foo.\:org/ "foo" :
をどのようにエンコードすべきかを示します:
.RS
.IP
.B .URL http://\[rs]:foo.\[rs]:org/ "foo" :
.RE
.IP
これを
.B \-Thtml
以外のドライバで処理すると、次のようになります:
.RS
.IP
\m[blue]foo\m[] \[la]\f[C]http://foo.org\f[]\[ra]:
.RE
.IP
URL マクロはどんなタイプでも構いません。
例えば
.URL pic.html "Eric Raymond's pic guide" 
は次のように参照できます:
.RS
.IP
.B .URL pic.html \[dq]Eric Raymond's pic guide\[dq]
.RE
.
.TP
.B MTO
HTML 用の電子メール参照を生成します。
第 2 引数はオプションであり、ブラウザに表示されるテキストです。
そして、第 3 引数もオプションであり、これは第 2 引数の直後に
表示されるものです。
実際の電子メールアドレスを印字する間、ハイフネーションは無効化されます。
例えば
.MTO joe@user.org "Joe User"
は次のように実現されます:
.RS
.IP
.B .MTO joe@user.org \[dq]Joe User\[dq]
.RE
.IP
実際には、groff では URL はテキストとしての空白を
一切使わないものとして扱われることに注意してください。
このことは、いくつかの問題の原因となりますのでバグだと
考えられるでしょう。
これを回避するために、
.B www.tmac
は他に影響を
与えない空白に展開される幅 0 の文字を挿入します
.RB ( \-Thtml
付きで実行された場合のみ)。
.
.TP
.B FTP
データが FTP 経由で取得できることを示します。
第 1 引数は URL で、
第 2 引数は、ブラウザに表示されるテキストです。
第 3 引数は、先に述べたマクロと同様に、第 2 引数の
直後に表示されるテキストとして扱われます。
第 2 および第 3 の引数はオプションです。
実際の URL を印字する間、ハイフネーションは無効化されます。
例として、これは、
例として、これは、
.FTP ftp://\:ftp.gnu.org/ "GNU ftp server"
です。
このマクロの例は、次のように指定します:
.RS
.IP
.B .FTP ftp://\[rs]:ftp.gnu.org/ \[dq]GNU ftp server\[dq] .
.RE
.
.TP
.B TAG
引数から HTML の name タグを生成します。
このタグは、
.URL #URL URL
マクロを使って参照できます。
御覧の通り、同一ドキュメント内の参照ですので、タグ名の前には
.B #
を付けなくてはなりません。
このリンクは、先の URL マクロの記述の中で TAG を置くことで
実現したのです。ソースは次のようになります:
.RS
.IP
.nf
.ft B
\&.TP
\&.B URL
は、
\&.TAG URL
すなわち 2 個か 3 個の引数を使用する URL を作成します。
\&.\|.\|.
.fi
.ft P
.RE
.
.TP
.B IMG
ドキュメントに画像を含めます。
第 2 のオプションは、水平位置、すなわち右・左・中央を指定します
.RB ( \-R ,
.BR \-L ,
.BR \-C )
。
第 2 引数は画像ファイルです。
オプションの第 3 引数と第 4 引数は、幅と高さです。
幅を指定しないと、デフォルトの 1 インチになります。
高さを指定しないと、幅と同じになります。
これは、HTML の IMG タグにマップされます。
PNG 画像を挿入する場合、
.B PIMG
マクロを使用することをお勧めします。
.
.TP
.B PIMG
PNG フォーマットの画像を含めます。
このマクロは
.B IMG
マクロとまったく同じパラメータを取ります。
PostScript と HTML デバイスと連携動作するという利点があります。
また、
.B netpbm
パッケージの
.BR pngtopnm ,
.BR pnmcrop ,
.BR pnmtops
を使用して、自動的に画像を EPS フォーマットに変換するという利点があります。
ドキュメントを
.B \-Thtml
で処理しない場合、groff の
.B \-U
オプションが必要です。
.
.TP
.B MPIMG
PNG 画像を余白に置き、その周辺をテキストで包みます。
第 1 パラメータは、左か右の整列位置
.RB ( \-L
mataha
.BR \-R )
です。
第 2 引数がファイル名です。
オプションの第 3 引数と第 4 引数は、幅と高さです。
幅を指定しないと、デフォルトの 1 インチになります。
高さを指定しないと、幅と同じになります。
.
.TP
.B HnS
見出しを開始します。
見出しレベルは、第 1 引数で指定します。
URL を含む見出しにはこのマクロを使用してください。
例:
.RS
.IP
.nf
.ft B
\&.HnS 1
\&.HR
GNU Troff
\&.URL http://groff.ffii.org (Groff) 
\&\(em a
\&.URL http://www.gnu.org/ GNU
\&project.
\&Hosted by
\&.URL http://ffii.org/ FFII .
\&.HR
\&.HnE
.ft P
.fi
.RE
.
.TP
.B HnE
見出しを終了します。
.
.TP
.B LK
.TAG LK
この位置に自動生成リンクを置くよう、grohtml に強制します。
マニュアルページを
.B \-Thtml
で処理した場合、リンクはここに見えます。
.
.LK
.
.
.SH セクション見出しへのリンク
デフォルトでは
.B grohtml
はセクションの見出しすべてへのリンクを生成し、
リンクを
HTML ドキュメントの先頭に配置します
(オフにしたり位置を変えるための詳細は
.URL #LK LINKS
を参照してください)。
.
.TP
.B HR
水平方向の罫線を幅いっぱいに作成します。
.
.TP
.B NHR
grohtml がデフォルトで生成する、トップとボトムの罫線の生成を抑制します。
.
.TP
.B HTL
HTML タイトルのみを生成します。
.B ms
マクロパッケージの
.B TL
マクロは、HTML タイトルと H1 見出しの両方を生成します。
これを使って、サーチエンジン用の食材としてて HTML タイトルを提供し、
ドキュメント中では画像のタイトルを使用できます。
.
.TP
.B HTML
このマクロより後の全テキストは生の HTML として扱われます。
.B \-Thtml
無しでドキュメントを処理すると、このマクロは無視されます。
内部的に、他の高位のマクロの構成要素としてこのマクロが使用されています。
.IP
例えば
.B BGIMG
マクロは次のように定義されています。
.RS
.IP
.nf
.ft B
\&.de BGIMG
\&.   HTML <body background=\[rs]$1>
\&..
.ft P
.fi
.RE
.
.TP
.B DC
ドロップキャピタルを生成します。
第 1 パラメータが、ドロップされる文字であり大きくなります。
第 2 パラメータが、これに続くテキストであり、
この高さを最初の文字は越えてはなりません。
オプションの 第 3 パラメータは、ドロップされた文字の色です。
.
.
.SH GROHTML の制限
.LP
.B tbl
情報は、現在 PNG 画像として描かれます。
.
.
.SH 関連ファイル
/usr/share/tmac/www.tmac
.
.
.SH "関連項目"
.BR groff (1),
.BR troff (1)
.BR grohtml (1),
.BR netpbm (1)
.
.
.SH 作者
.B grohtml
は
.MTO gaius@glam.ac.uk "Gaius Mulley"
が書きました。
.
.
.SH バグ
バグレポートは
.MTO bug-groff@\:gnu.org "Groff Bug Mailing List"
へ送ってください。
バグが再現できるように、完全で自己完結している例を付けてください。
また、どのバージョンの groff を使っているかも伝えてください。
.
.\" Local Variables:
.\" mode: nroff
.\" End:
