freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_ms.7
'\" t
.ig
Copyright (C) 1989-1995, 2001, 2002 Free Software Foundation, Inc.

Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.

Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.
..
.\" $FreeBSD$
.TH GROFF_MS 7 "11 October 2002" "Groff Version 1.19"
.SH 名称
groff_ms \- groff ms マクロ
.SH 書式
.B groff
.B \-ms
[
.IR options .\|.\|.\&
]
[
.IR files .\|.\|.\&
]
.br
.B groff
.B \-m\ ms
[
.IR options .\|.\|.\&
]
[
.IR files .\|.\|.\&
]
.\" -----
.SH 解説
このマニュアルページは GNU バージョンの
.I ms
マクロの解説をします。
このマクロは、
.I groff
文書整形システムの一部分です。
この
.I ms
マクロは、4.3
.SM BSD
Unix
.I ms
マクロの文書化された機能と互換であるように設計されています
(詳細は後述の
.I troff ms との違い
を参照してください)。
.I ms
マクロは、報告書、手紙、書籍、技術文書に適しています。
.\" -----
.SH 使用法
.I ms
マクロパッケージは、ファイルにある程度の構造があることを期待しています。
最も単純な文書は、段落マクロで開始し、
段落マクロか単なる空行で区切られたテキストからなります。
長い文書は、次の構造を持ちます:
.TP
.B "文書タイプ"
文書の先頭に
.B RP
(報告書) マクロを置くと、
.I groff
は表紙の情報をそのページに印字します。
そうでない場合は、この情報は最初のページに印字され、
直後に文書のテキストが続きます。
AT&T
.I troff
の他の文書書式は AT&T か Berkeley 固有であり、
.IR "groff ms"
ではサポートされていません。
.TP
.B "書式とレイアウト"
数値レジスタを設定することで、文書の活字 (フォントと大きさ)、
マージン、間隔、ヘッダ、フッタ、脚注を変えられます。
詳細は後述の
.I "文書制御レジスタ"
を参照してください。
.TP
.B "表紙"
表紙ページは、タイトル、省略可能な著者名と組織名、
アブストラクト、日付からなります。
さらなる詳細は後述の
.I "表紙ページマクロ"
を参照してください。
.TP
.B "本文"
表紙ページに、あなたの文書が続きます。
これは、段落、見出し、リストからなります。
.TP
.B "目次"
長い文書は、通常、目次を含みます。
これは、文書の最後に
.B TC
マクロを置くことで可能となります。
.\" -----
.SS "文書制御レジスタ"
次の表は、文書制御レジスタを列挙しています。
一貫性のために、マージンに関するレジスタは、文書の先頭で、もしくは
.B RP
マクロの直後で設定してください。
.LP
.ne 9
.B マージン設定
.RS
.na
.TS
cb   s cb s s cb s cb s
afCW s l  s s l  s l  s.
レジスタ	定義	効果対象	デフォルト
_
PO	T{
ページオフセット (左マージン)
T}	T{
次ページ
T}	1i
LL	T{
行長
T}	次段落	6i
LT	T{
ヘッダ/フッタ長
T}	次段落	6i
HM	T{
トップ (ヘッダ) マージン
T}	次ページ	1i
FM	T{
ボトム (フッタ) マージン
T}	次ページ	1i
_
.TE
.RE
.LP
.ne 7
.B テキスト設定
.RS
.TS
cb   s cb s s cb s cb s
afCW s l  s s l  s l  s.
レジスタ	定義	効果対象	デフォルト
_
PS	T{
ポイントサイズ
T}	次段落	10p
VS	T{
行間 (先行)
T}	次段落	12p
_
.TE
.RE
.LP
.ne 7
.B 段落設定
.RS
.TS
cb cb s cb cb
afCW l s l l .
レジスタ	定義	効果対象	デフォルト
_
PI	T{
初期インデント
T}	次段落	5n
PD	T{
段落間の間隔
T}	次段落	0.3v
QI	T{
引用段落のインデント
T}	次段落	5n
_
.TE
.RE
.LP
.ne 7
.B 脚注設定
.RS
.TS
cb cb cb cb
afCW l l l .
レジスタ	定義	効果対象	デフォルト
_
FL	脚注の長さ	次の脚注	LL*5/6
FI	脚注のインデント	次の脚注	2n
FF	脚注の書式	次の脚注	0
_
.TE
.RE
.LP
.ne 6
.B 他の設定
.RS
.TS
cb   s cb s s cb s cb s
afCW s l  s s l  s l  s.
レジスタ	定義	効果対象	デフォルト
_
MINGW	T{
カラム間の最小幅
T}	次ページ	2n
_
.TE
.ad
.RE
.\" -----
.SS "表紙ページマクロ"
次のマクロを次の順序で使用することで、文書の表紙ページを作成してください。
.TP
.B \&.RP [no]
文書の報告書書式を指定します。
報告書書式は、独立した表紙ページを作成します。
.B RP
マクロを指定しないと、
.I groff
は、表紙のサブセットを文書のページ 1 に印字します。
.IP
省略可能な
.B no
引数を使用すると、
.I groff
は表紙ページを印字しますが、表紙ページ情報
(タイトル、著者、アブストラクト等) を文書のページ 1 に続けません。
.TP
.B \&.P1 
(P に数字の 1) ページ 1 にヘッダを印字します。
デフォルトは、ヘッダを抑制します。
.TP
.BI "\&.DA [" xxx ]
(省略可能) 現在の日付かマクロに引数があればそれを、
表紙ページ (指定されていれば) とフッタに印字します。
これは
.IR nroff
のデフォルトです。
.TP
.BI "\&.ND [" xxx ]
(省略可能) 現在の日付かマクロに引数があればそれを、
表紙ページ (指定されていれば) に印字しますが、フッタには印字しません。
これは
.IR troff
のデフォルトです。
.TP
.B \&.TL
文書のタイトルを指定します。
.I groff
は
.B TL
マクロから著者かアブストラクトまでのテキストを集め、タイトルとします。
.TP
.B \&.AU
著者名を指定します。
複数の著者を指定するには、各著者に対して
.B AU
マクロを使用します。
.TP
.B \&.AI
著者の組織を指定します。
複数の組織を指定可能です。
.TP
.B \&.AB [no]
アブストラクトを開始します。
デフォルトでは、語
.BR ABSTRACT
を中央寄せイタリックにて、アブストラクトのテキストの上に印字します。
オプションの
.B no
は、この見出しを抑制します。
.TP
.B \&.AE
アブストラクトの終了です。
.\" -----
.SS 段落
インデント付きの段落を作成するには
.B PP
マクロを使用し、初期インデント無しの段落を作成するには
.B LP
マクロを使用します。
.PP
.B QP
マクロは、すべてのテキストを、左および右のマージンに対してインデントします。
効果は、HTML の
.B <BLOCKQUOTE>
要素と同じです。
次段落や見出しは、マージンを通常に戻します。
.PP
.B XP
マクロは、拡張段落を生成します。
段落の最初の行は左マージンから開始し、続く行がインデントされます
.RB ( PP
の逆です)。
.SS 見出し
文書に階層構造を作成するには、見出しを使用します。
.I ms
マクロでは、本文と同じフォントファミリで同じポイントサイズの
.B ボールド
にて、見出しを印字します。
.PP
次の見出しマクロが使用可能です:
.TP
.BI \&.NH \0xx
数字付き見出し。
引数
.I xx
は、見出しのレベルを示す数値引数であるか、
.I S\ xx\ xx\ \c
\&".\|.\|."
という形式の明示的なセクション番号です。
順番からは外れた見出しレベル、例えば
.BR ".NH\ 1"
の後に
.B ".NH\ 3"
を指定すると、
.I groff
は標準エラーに警告を表示します。
.TP
.B \&.SH
数字無しの副見出しです。
.\" -----
.SS 強調印字
.I ms
マクロには、テキストを強調するための様々な方法があります:
.TP
.BI "\&.B [" txt " [" post " [" pre ]]]
最初の引数を
.B "ボールドタイプ"
にします。
第 2 引数を指定すると、
.I groff
は、それを以前のフォントにて、空白を挟まずに印字します
(強調テキストの後に、句読点を強調せずに置けます)。
同様に、(存在すれば) 第 3 引数を以前のフォントにて、最初の引数の
.B 前
に印字します。
例えば
.RS
.IP
\&.B foo ) (
.RE
.IP
は次のように印字されます:
.RB ( foo )
.IP
このマクロに引数を指定しないと、
次の強調・段落・見出しマクロまでの後続するすべてのテキストを、
.I groff
はボールドで印字します。
.TP
.BI "\&.R [" txt " [" post " [" pre ]]]
最初の引数をローマン (通常) タイプにします。
他は
.B B
マクロと同様に動作します。
.TP
.BI "\&.I [" txt " [" post " [" pre ]]]
最初の引数を
.IR "イタリックタイプ"
にします。
他は
.B B
マクロと同様に動作します。
.TP
.BI "\&.CW [" txt " [" post " [" pre ]]]
最初の引数を等幅フェースにします。
他は
.B B
マクロと同様に動作します。
.TP
.BI "\&.BI [" txt " [" post " [" pre ]]]
最初の引数をボールドイタリックタイプにします。
他は
.B B
マクロと同様に動作します。
.TP
.BI "\&.BX [" txt ]
引数を印字し、その周りに箱を描きます。
空白を含む文字列を箱で囲みたい場合、数値幅の空白 (\[rs]0) を使用してください。
.TP
.BI "\&.UL [" txt " [" post ]]
最初の引数を下線付きで印字します。
第 2 引数を指定すると、
.I groff
は、それを以前のフォントにて、
空白を挟まずに下線付きテキストの後に印字します。
.TP
.B \&.LG
次のフォントサイズ・強調・段落・見出しマクロまでの後続するすべてのテキストを、
大きなタイプ (現在のポイントサイズより 2 ポイント大) で印字します。
このマクロを複数回指定することで、
必要な大きさになるまでポイントサイズを大きくすることができます。
.TP
.B \&.SM
次のフォントサイズ・強調・段落・見出しマクロまでの後続するすべてのテキストを、
小さなタイプ (現在のポイントサイズより 2 ポイント小) で印字します。
このマクロを複数回指定することで、
必要な小ささになるまでポイントサイズを小さくすることができます。
.TP
.B \&.NL
後続するすべてのテキストを通常のポイントサイズ 
.RB ( PS
レジスタの値) で印字します。
.TP
.BI \[rs]*{ text \[rs]*}
括られた
.I テキスト
を上付き文字として印字します。
.\" -----
.SS インデント
テキストの一部をインデントする必要があるかもしれません。
典型的なインデントの使用法は、
入れ子のリストやサブリストを作成することです。
.PP
インデントされたテキスト部分の開始と終了には、それぞれ
.B RS
および
.B RE
のマクロを使用します。
.B PI
レジスタは、インデント量を制御します。
.PP
.B RS
および
.BR RE
の組を入れ子で使用することで、
インデントされた部分を必要なだけ深く入れ子にすることができます。
.\" -----
.SS リスト
.B IP
マクロは、すべてのリストの仕事を操作します。
この構文は次の通りです:
.TP
.BI ".IP [" marker " [" width ]]
.IP
.I marker
は、通常、順番無しリストでは中黒文字
.B \[rs](bu
、番号付きリストでは番号 (または自動的に増加する数値レジスタ)、
インデント付き (用語解説スタイル) リストでは語や句です。
.IP
.I width
は、各リスト項目の本文用のインデントを指定します。
ひとたび指定すると、次に指定されるまで、
文書中のすべてのリスト項目に対してインデントは同じままです。
.\" -----
.br
.ne 15
.SS "タブストップ"
必要に応じてタブストップを設定するには
.B ta
リクエストを使用します。
タブストップをデフォルト (5n 毎) に戻すには
.B TA
マクロを使用します。
別のデフォルトタブストップ集合を作りたい場合には、
.B TA
マクロを再定義します。
.\" -----
.SS "ディスプレイとキープ"
テキストベースの例や図 (コードリスト等) を印字するには、
ディスプレイを使用します。
ディスプレイはフィルをオフにしますので、各行の間に
.B br
リクエストを挿入せずにコードがそのまま印字されます。
ディスプレイは、単一ページ上に
.I キープ
することもできますし、ページをまたがった分割を許すこともできます。
.RS
.ne 11
.na
.TS
cb   s s    s cbt s s
cb   s cb   s ^   s s
lfCW s lfCW s l   s s.
ディスプレイマクロ	ディスプレイのタイプ
キープ有	キープ無
_
\&.DS L	\&.LD	Left-justified.
\&.DS I [\fIindent\fP]	\&.ID	T{
インデント付き (デフォルトのインデントは \fBDI\fP レジスタ値)。
T}
\&.DS B	\&.BD	T{
ブロック中央寄せ (左寄せで、最長行が中央寄せされます)。
T}
\&.DS C	\&.CD	中央寄せ。
\&.DS R	\&.RD	右寄せ。
_
.TE
.RE
.ad
.LP
ディスプレイタイプを終了するには
.B DE
マクロを使用します。
.PP
直後に続く表 (やリストや他の項目) を参照する段落等、テキストを同じページに
.I キープ
するには、
.B KS
および
.B KE
のマクロを使用します。
.B KS
マクロは、単一ページにキープされるべきテキストブロックを開始し、
.B KE
マクロはそのブロックを終了します。
.PP
.I "フローティングキープ"
は、
.B KF
および
.B KE
のマクロで指定可能です。
このキープが現在のページに入り切らない場合、
.I groff
はキープの内容を保持し、(ソースファイル中で) キープに続くテキストで
現在のページの残りを埋めます。
改ページ時、すなわち明示的な
.B bp
リクエスト時もしくはページの終了時に、
.I groff
は新規ページの先頭にフローティングキープを印字します。
指定したその場所に現れる必要が無い大きなグラフィックや表を
印字するときに有用です。
.\" -----
.SS "表、図、式、参照"
.I -ms
マクロは標準の
.I groff
プリプロセッサ
.IR tbl ,
.IR pic ,
.IR eqn ,
.IR refer
をサポートします。
プリプロセッサ用のテキストは、次のタグの組で括ってください:
.TP
.BR "\&.TS [H]" " と " \&.TE
.I tbl
プリプロセッサで処理されるべき表を表現します。
オプションの
.B H
引数は、
.B TH
マクロまでの情報を使用して、ランニングヘッダを作成すべきことを
.I groff
に指示します。
.I groff
は表の先頭にヘッダを印字し、表が別のページにまたがるときには次ページにも
.I groff
はヘッダを印字します。
.TP
.BR \&.PS " と " \&.PE
.I pic
プリプロセッサで処理されるべきグラフィックを表現します。
.I pic
ファイルは、ウェブから入手可能な
AT&T
.I pic
マニュアルを参考にして手動で作成できますし、
.IR xfig
のようなグラフィックプログラムを使用して作成することも可能です。
.TP
.BR "\&.EQ [\fI\,align\/\fP]" " と " \&.EN
.I eqn
プリプロセッサで処理されるべき式を表現します。
オプションの
.I align
引数は、
.BR C ,
.BR L ,
.B I
のいずれかであり、
式をそれぞれ中央寄せ (デフォルト)、左寄せ、インデントします。
.TP
.BR \&.[ " と " \&.]
.I refer
プリプロセッサで処理されるべき参照を表現します。
GNU
.IR refer (1)
マニュアルページは、プリプロセッサの分かり易い参照と、
参考文献データベースの書式を解説しています。
.\" -----
.SS 脚注
.I ms
マクロは、柔軟な脚注システムを提供します。
数字付き脚注は、
.B \[rs]**
エスケープに、
.B FS
および
.B FE
のマクロに括られた脚注テキストを続けることで、指定可能です。
.PP
シンボルの脚注は、印の文字 (例えば
.B \[rs](dg
はダガー文字) を本文に置き、これに続けて
.B FS\ \[rs](dg
および
.B FE
のマクロで括られた脚注テキストを続けることで、指定可能です。
.PP
.I groff
が脚注番号を印字する方法は、
.B FF
レジスタを次のように変えることで、制御可能です:
.RS
.ne 7
.TP
0
脚注番号を上付き文字として印字し、脚注をインデントします (デフォルト)。
.TP
1
番号に続けてピリオドを印字し (例えば 1.)、脚注をインデントします。
.TP
2
1 に似ていますが、インデントしません。
.TP
3
1 に似ていますが、脚注番号をぶら下がり段落として印字します。
.LP
.RE
脚注は、キープおよびディスプレイ中で安全に使用可能ですが、
フローティングキープ中では、番号付き脚注の使用は避けてください。
第 2 の
.B \[rs]**
を、
.B \[rs]**
とこれに対応する
.BR .FS
の間に置けます。
ただし、各
.B .FS
は対応する
.B \[rs]**
の後に置かれ、
.B .FS
の登場順序は対応する
.BR \[rs]**
の登場順序と同じであることが必要です。
.\" -----
.SS "ヘッダとフッタ"
ヘッダとフッタを定義する方法が 2 通りあります:
.IP \(bu 3n
文字列
.BR LH ,
.BR CH ,
.B RH
を使用して、左・中央・右のヘッダを設定します。
.BR LF ,
.BR CF ,
.B RF
を使用して、左・中央・右のフッタを設定します。
奇数ページと偶数ページを区別しない文書で、もっとも良く動作します。
.IP \(bu
.B OH
と
.B EH
のマクロで、偶数ページと奇数ページのヘッダを定義します。
.B OF
と
.B EF
のマクロで、偶数ページと奇数ページのフッタを定義します。
これは、個別の文字列を定義するより柔軟な方法です。
これらのマクロの構文は次の通りです:
.RS
.IP
.BI "\&.OH '" left ' center ' right '
.RE
.IP
クォート (') は、ヘッダやフッタのテキストに登場しない
任意の文字に置き換え可能です。
.\" -----
.SS マージン
マージンの制御は、数値レジスタを設定することで行います。
次の表は、レジスタ名とデフォルトを列挙します:
.RS
.ne 8
.na
.TS
cb   s cb s s cb s cb s
afCW s l  s s l  s l  s.
レジスタ	定義	効果対象	デフォルト
_
PO	T{
ページオフセット (左マージン)
T}	次ページ	1i
LL	T{
行長
T}	次段落	6i
LT	T{
ヘッダ/フッタ長
T}	次段落	6i
HM	T{
トップ (ヘッダ) マージン
T}	次ページ	1i
FM	T{
ボトム (フッタ) マージン
T}	次ページ	1i
_
.TE
.RE
.ad
.PP
右マージン設定が無いことに注意してください。
ページオフセットと行長の組み合わせが、右マージンを算出する情報を提供します。
.\" -----
.SS "複数カラム"
.I ms
マクロは、ページにうまく納めるように、テキストを複数カラムに植字可能です。
次のマクロが使用可能です。
複数カラムモードが既に設定済みの場合、これらは改ページを強制します。
しかしながら、現在のモードが単一カラムであり、複数カラムを開始する場合には、
改ページを強制
.I しません
。
.TP
.B \&.1C
単一カラムモード。
.TP
.B \&.2C
2 カラムモード。
.TP
.BI "\&.MC [" width " [" gutter ]]
複数カラムモード。
引数を指定しない場合には、
.B 2C
マクロと等価です。
そうでない場合、
.I width
は、各カラムの幅であり、
.I gutter
はカラム間の空間です。
.B MINGW
数値レジスタが、デフォルトのガター幅です。
.\" -----
.SS "目次の作成"
目次に登場させたいテキストを
.B XS
および
.B XE
のマクロで包んでください。
.B TC
マクロは、目次を文書の最後に印字し、ページ番号を
.B i
(ローマ数字の 1) にリセットします。
.PP
.BR XS
の最初の引数としてページ番号を指定することで、目次を手動で作成可能です。
続くエントリを
.B XA
マクロを使用して追加してください。
例えば:
.RS
.PP
.ne 8
.nf
\&.XS 1
Introduction
\&.XA 2
A Brief History of the Universe
\&.XA 729
Details of Galactic Formation
\&.\|.\|.
\&.XE
.fi
.RE  
.LP  
ページ番号をリセットせずに、手動で生成された目次を印字するには、
.B PX  
マクロを使用してください。
.PP
.B PX
もしくは
.BR TC
に引数
.B no
を指定すると、
.I groff
は
.B \[rs]*[TOC]
文字列で指定されたタイトルの印字を抑制します。
.\" -----
.SH "troff ms との違い"
.I "groff ms"
マクロは、完全な再実装であり、
元々の AT&T のコードは使用されていません。
.IR groff
の拡張機能を使用していますので、これらは AT&T の
.IR troff
では使用できません。
他の違いは次の通りです:
.IP \(bu 3n
.I "groff ms"
の内部は Unix
.I ms
の内部とは同じではありません。
したがって、Unix
.I ms
の実装の細部に依存する書式については
.I "groff ms"
で機能しないとしてももっともでしょう。
.IP \(bu
エラー処理の方針については、
.I "groff ms"
は、沈黙したままエラーを無視したりせず、エラーを検出してレポートします。
.IP \(bu
Bell Labs 方言は実装されていません。
.IP \(bu
Berkeley 方言、特に、
.B TM
や
.B CT
マクロは、実装されていません。
.IP \(bu
.I "groff ms"
は、互換モードでは機能しません
(例えば、
.B \-C
オプションなど)。
.IP \(bu
タイプライタ様のデバイスには、サポートはありません。
.IP \(bu
.I "groff ms"
では、カットマークは提供しません。
.IP \(bu
重複した行送りは許されません
(代わりに、大きな垂直行送りを使用して下さい)。
.IP \(bu
ある Unix
.I ms
の文書には、数値レジスタの
.B CW
と
.B GW
とが、それぞれカラム幅とガター幅
を制御する為に
使用できると述べられています。
これらの数値レジスタは、groff ms では使用されません。
.IP \(bu
リセットを引き起こすマクロ (段落や見出し) はインデントを設定します。
インデントを変更するマクロはインデントを増減するのではなく、
むしろインデントを絶対的に設定します。
このことによって、独自のマクロを追加定義している文書に
問題が生じるかも知れません。
これを解決するには、
.B in
リクエストを用いずに、代わりに
.B RS
や
.B RE
マクロを用いて下さい。
.IP \(bu
数値レジスタの
.B GS
は、
.I "groff ms"
マクロによって 1 に設定されます。
しかし、この数値レジスタは Unix
.I ms
マクロでは使用されていません。
このレジスタの目的は、
Unix
.I ms
か
.I "groff ms"
かのどちらによってフォーマットされているのかを判定する
必要のある文書によって利用されることです。
.br
.ne 22
.SS 文字列
次の文字列は、
.I "groff ms"
マクロを英語以外の言語に適合させるために
再定義することができます:
.TS
center;
cb cb
afCW l .
文字列	デフォルト値
_
REFERENCES	References
ABSTRACT	ABSTRACT
TOC	Table of Contents
MONTH1	January
MONTH2	February
MONTH3	March
MONTH4	April
MONTH5	May
MONTH6	June
MONTH7	July
MONTH8	August
MONTH9	September
MONTH10	October
MONTH11	November
MONTH12	December
_
.TE
.PP
.B \[rs]*-
文字列は、em ダッシュを印字します \[em] こんな感じです。
.\" -----
.SS テキスト設定
.B FAM
文字列は、デフォルトのフォントファミリを設定します。
この文字列が初期化時に未定義の場合、Times に設定されます。
.LP
脚注のポイントサイズ、垂直行送り幅、そして段落間の行送り幅は、
数値レジスタの
.BR FPS ,
.BR FVS ,
.B FPD
で制御されます。
初期化時に、これらは、それぞれ
.BR \[rs]n(PS-2 ,
.BR \[rs]n[FPS]+2 ,
.B \[rs]n(PD/2
に設定されます。
しかし、これらのレジスタのいずれかでも初期化前に定義されていれば、
初期化マクロはこれらを変更しません。
.LP
.RB ( .hy
リクエストによって設定される) ハイフネーションフラグは、
.B HY
レジスタから取られて設定されます。
デフォルトは 14 です。
.PP
(元々 Berkeley の
.I ms
バージョンで定義された) 進歩したアクセント記号は、文書の先頭で
.B AM
マクロを定義することで使用可能です。
対象となる文字の直後に、アクセントを定義する文字列を指定することで、
ほとんどの文字にアクセントを置けます。
例えば
.B n\[rs]*~ 
は、n の上にチルダを置いたものを生成します。
.\" -----
.SH "命名規則"
.LP
次のような命名規則が、マクロ、文字列そして数値レジスタに適用されています。
.I "groff ms"
マクロを使用する文書に利用出来る外部名は、大文字と数字だけからなります。
.LP
内部的には、マクロはモジュールに分割されます。
命名規則は次の通りです:
.IP \(bu 3n
ある一つのモジュールの中だけで使用される名前は、
.IB \%module * name\fR
という形をしています。
.IP \(bu
定義されているモジュールの外部で使用される名前は、
.IB \%module @ name\fR
という形をしています。
.IP \(bu
ある特別の環境に関わる名前は、
.IB \%environment : name
という形をしています。
これらの名前は、
.B par
モジュールの中でのみ使われます。
.IP \(bu
.I name
には、モジュールは接頭辞としてつきません。
.IP \(bu
組み合わされた名前で配列を実装するのに使われるものは、
.IB \%array ! index\fR
という形をしています。
.PP
以上より groff ms では以下の名前を予約しています:
.IP \(bu 3n
.BR * ,
.BR @ ,
.BR :
を含んでいる名前。
.IP \(bu
大文字と数字だけを含んでいる名前。
.SH 関連ファイル
.B /usr/share/tmac/ms.tmac
.RB ( s.tmac
のラッパファイル)
.br
.B /usr/share/tmac/s.tmac
.SH "関連項目"
.BR groff (1),
.BR troff (1),
.BR tbl (1),
.BR pic (1),
.BR eqn (1),
.BR refer (1),
.I Groff: The GNU Implementation of troff
by Trent Fisher and Werner Lemberg.
.SH 作者
元々のマニュアルページを James Clark 等が記述しました。
Larry Kollar
(\fIlkollar@despammed.com\fR) が書き直しました。
.\" Local Variables:
.\" mode: nroff
.\" End:
