freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_char.7
.TH GROFF_CHAR 7 "11 October 2002" "Groff Version 1.18.1"
.SH 名称
groff_char \- groff の文字名
.SH 解説
.\" The lines above were designed to satisfy `apropos'.
.
.\" For best results, format this document with `groff' (GNU roff).
.
.
.\" --------------------------------------------------------------------
.\" Legalize
.\" --------------------------------------------------------------------
.
.ig
groff_char(7)

This file is part of groff (GNU roff).

File position: <groff_src_top>/man/groff_char.man
Last update: 20 July 2002

Copyright (C) 1989-2000, 2001, 2002 Free Software Foundation, Inc.
written by Werner Lemberg <wl@gnu.org>
with additions by Bernd Warken <bwarken@mayn.de>

Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.1 or
any later version published by the Free Software Foundation; with the
Invariant Sections being this .ig-section and AUTHOR, with no
Front-Cover Texts, and with no Back-Cover Texts.

A copy of the Free Documentation License is included as a file called
FDL in the main directory of the groff source package.
..
.
.\" --------------------------------------------------------------------
.\" Setup Part 1
.\" --------------------------------------------------------------------
.
.\" groff only
.if \n(.g .mso www.tmac
.\".if \n(.g .ne 2v
.\".if \n(.g .sv 2v
.
.ds aq \(aq
.
.\" non-groff
.if !\n(.g .if '\(aq'' .ds aq \'
.
.\" groff
.if !\n(.g .ig
.	tr \[aq]\[aq]
.	if !c\[aq] \
.		ds aq \'
.	\" This is very special.  The standard devdvi fonts don't have a
.	\" real `aq' glyph; it is defined with .char to be ' instead.
.	\" The .tr request below in the definition of the C macro maps
.	\" the apostrophe ' onto the `aq' glyph which would cause a
.	\" recursive loop.  gtroff prevents this within the .char
.	\" request, trying to access glyph `aq' directly from the font.
.	\" Consequently, we get a warning, and nothing is printed.
.	\"
.	\" The following line prevents this.
.	if '\*[.T]'dvi' \
.		if !r ECFONTS \
.			ds aq \'
.	\" The same is true for X
.	ds dev \*[.T]
.	substring dev 0 0
.	if '\*[dev]'X' .ds aq \'
.	ig
..
.\" --------------------------------------------------------------------
.\" .Ac accented-char accent char (groff)
.if !\n(.g .ig
.de Ac
.	char \\$1 \\$3\
\k[acc]\h'(u;-\w'\\$2'-\w'\\$3'/2+\\\\n[skw]+(\w'x'*0)-\\\\n[skw])'\
\v'(u;\w'x'*0+\\\\n[rst]+(\w'\\$3'*0)-\\\\n[rst])'\\$2\
\v'(u;\w'x'*0-\\\\n[rst]+(\w'\\$3'*0)+\\\\n[rst])'\h'|\\\\n[acc]u'
.	hcode \\$1 \\$3
..
.Ac \(vc \(ah c
.Ac \(vC \(ah C
.
.
.\" --------------------------------------------------------------------
.\" Setup Part 2
.\" --------------------------------------------------------------------
.
.nr Sp 3n
.ta \w'\fI出力'u+\n(Spu \
    +\w'\fI入力'u+\n(Spu \
    +\w'\fI入力'u+\n(Spu \
    +\w'periodcentered'u+\n(Spu
.
.\" --------------------------------------------------------------------
.de C0
.	C \\$1 "" \\$1 \\$2 "\\$3"
..
.
.\" --------------------------------------------------------------------
.de C1
.	C \e\\$1 "" \\\\\\$1 \\$2 "\\$3"
..
.
.\" --------------------------------------------------------------------
.\" .C2/.CN (groff)
.if !\n(.g .ig
.de CN
.	C \e[\\$1] "" \[\\$1] \\$2 "\\$3"
..
.if \n(.g .als C2 CN
.
.\" --------------------------------------------------------------------
.\" .C2 (non-groff)
.if \n(.g .ig
.de C2
.	C \e(\\$1 "" \\(\\$1 \\$2 "\\$3"
..
.
.\" --------------------------------------------------------------------
.\" .CD (groff)
.if !\n(.g .ig
.de CD
.	C \[char\\$1] \\$1 \[char\\$1] \\$2 "\\$3"
..
.
.\" --------------------------------------------------------------------
.do if !r ECFONTS .do fspecial CR R
.
.\" --------------------------------------------------------------------
.\" input-name decimal-code output-name ps-name description
.\" .C (groff)
.if !\n(.g .ig
.de C
.	if c\\$3 \{\
.		ft CR
.		tr `\`'\*[aq]
.		in 0
.		di CH
.		nop \&\\$1
.		br
.		di
.		in
.		ft
.		ds CH \\*[CH]\
.		tr ``''
.		nop \&\\$3\t\\*[CH]\t\\$2\t\\$4\t\\$5
.	\}
..
.
.\" --------------------------------------------------------------------
.\" .C (non-groff)
.if \n(.g .ig
.de C
.	if !'\\$3'' \{\
.		ft B
.		tr `\`'\*(aq
.		in 0
.		di CH
\&\\$1
.		br
.		di
.		in
.		ft
.		ds CH \\*(CH\
.		tr ``''
\&\\$3\t\\*(CH\t\\$2\t\\$4\t\\$5
.	\}
..
.
.\" --------------------------------------------------------------------
.de Fo
'bp
.He
..
.
.\" --------------------------------------------------------------------
.de He
.P
'nf
.ft I
出力	入力	入力	PostScript	注
	名	コード	名
.ft
.P
..
.\" $FreeBSD$
.\"
.\" groff_char.7 の表記を尊重しました。
.\" JIS X 0212 の附属書 3 表 3「0208とJISX0221との対応表」を、
.\" 文字の名前の参考としてではなく、英単語と日本語の単語の対応の
.\" 参考としました。
.\" Kazuo Horikawa <horikawa@jp.FreeBSD.org> 1998/12/06
.\"
.
.\" --------------------------------------------------------------------
.\" .SH 解説
.\" --------------------------------------------------------------------
.
このマニュアルページは標準的な
.B groff
への入力文字を列挙しています。
.
この文書での出力文字は、
.RB ( man (1)
や roff 整形器への
.B \-T
オプションで) 選択された出力デバイスに依存して、
見え方が異なります。
.
このマニュアルページを印刷 (表示) するのに用いられるデバイスで
利用可能な文字のみが表示されます
.ie \n(.g (現在使用されているデバイスは `\*(.T' です)
。
.
.
.P
実際のバージョンでは、
.B groff
は直接入力に対しては 8 ビット文字のみを提供し、
更なるグリフに対しては名前付き文字を提供します。
.
ASCII プラットフォームでは、0 から 127 (10 進数) の範囲の文字コードは
通常の 7 ビット ASCII 文字を表現しますが、
127 と 255 の間のコードは対応する
.I Latin-1
.RI ( ISO-8859-1 )
コード集合の文字として解釈されます。
.
EBCDIC プラットフォームでは、コードページ
.B cp1047
のみがサポートされています (Latin-1 と同じ文字を含みます)。
.
.IR Latin-2
などの他の 8 ビット文字の設定は、
(経験のあるユーザにとっては) どちらかというと簡単です。
.B groff
の次のメジャーバージョンは Unicode を使用しますので、
追加のエンコードは提供されません。
.
.
.P
すべての roff システムは、名前付き文字の概念を提供します。
.
伝統的な roff システムでは長さ 2 の名前のみが使用されていましたが、
groff は長い名前も提供します。
.
7 ビット ASCII の範囲外のすべての文字に対しては名前付き文字だけを
使うよう、強くお勧めします。
.
.
.P
定義済みの groff エスケープシーケンス (名前の長さ 1 のもの) には、
1 文字を生成するものがあります。
これらは歴史的な理由で存在したものや、構文文字の印字可能バージョンです。
.
これらには
.BR \e\e ,
.BR \e' ,
.BR \e` ,
.BR \e- ,
.BR \e. ,
.BR \ee
があります。
.BR groff (7)
を参照してください。
.
.
.P
groff では、これらの異なったタイプの文字はすべて、
.B .if\ c
条件で陽的にテスト可能です。
.
.
.\" --------------------------------------------------------------------
.SH 参照
.\" --------------------------------------------------------------------
.
この節では、groff の文字が表形式で指定します。
.
列の意味は次の通りです。
.
.
.TP
.I "出力"
現在のデバイスに対して、どのように印字されるかを示します。
他のデバイス上では非常に異なった形になるかもしれませんが、
常に同じグリフを表現します。
.
.
.TP
.I "入力名"
キーボード上のキーで直接もしくは groff エスケープシーケンスを用いて、
文字をどのように入力するかを示します。
.
.
.TP
.I "入力コード"
この欄は単一の文字で入力することのできる文字において用いられ、
その文字の ISO Latin-1 10 進数コードが書かれています。
.
このコードは Unicode 文字の下位 256 個と等価です
(0 から 127 の範囲の 7 ビット ASCII を含みます)。
.
.
.TP
.I "PostScript 名"
欄には出力文字の一般的な PostScript 名が示されます。
.
.
.\" --------------------------------------------------------------------
.SS "ASCII 文字"
.\" --------------------------------------------------------------------
.
これらは、7 ビット ASCII コード値を持つ基本文字です。
.
これらは、文字標準 ISO-8859-1 (Latin-1) および Unicode
.RI ( "C0 制御および基本ラテン"
の範囲) の最初の 127 文字と等価です。
.
下記のコード範囲は非常に良く知られていますので、
空間を節約するためにすべてのコードエントリは書きません。
.
.TP
0\-32
制御文字 (そらら自身を印字)。
.
.TP
48\-57
10 進数字の 0 から 9 (それら自身を印字)。
.
.TP
65\-90
大文字 A\-Z (それら自身を印字)。
.
.TP
97\-122
小文字 a\-z (それら自身を印字)。
.
.TP
127
制御文字 (それ自身を印字)。
.
.P
残りの範囲は、アルファベットでも数値でもない印字可能文字を構成します。
それらのみを下記に列挙します。
.
以下の表にあるように、ほとんどの文字がそれら自身を印字します。
例外は次の文字です:
.
.TP
.B \`
ISO Latin-1 `グレーブアクセント' (コード 96) は ` として、
すなわち一重開き引用符として印字されます。
.
.TP
.B \*(aq
ISO Latin-1 `アポストロフィ' (コード 39) は ' として、
すなわち一重閉じ引用符として印字されます。
対応する ISO Latin-1 文字は、
.B \e`
および
.BR \e(aq
で得られます。
.
.TP
.B -
ISO Latin-1 の `ハイフン、負符号' (コード 45) はハイフンとして
表示されます。
負符号は
.BR \e-
で得られます。
.
.TP
.B ~
ISO Latin-1 の `チルド' (コード 126)。
より大きいグリフは
.BR \e(ti
で得られます。
.
.TP
.B ^
ISO Latin-1 の `サーカムフレクスアクセント' (コード 94)
より大きいグリフは
.BR \e(ha
で得られます。
.
.
.P
.if !\n[cR] .wh \n(nlu+\n(.tu-\n(.Vu Fo
.He
.CD 33 exclam
.CD 34 quotedbl
.CD 35 numbersign
.CD 36 dollar
.CD 37 percent
.CD 38 ampersand
.CD 39 quoteright
.CD 40 parenleft
.CD 41 parenright
.CD 42 asterisk
.CD 43 plus
.CD 44 comma
.CD 45 hyphen
.CD 46 period
.CD 47 slash
.CD 58 colon
.CD 59 semicolon
.CD 60 less
.CD 61 equal
.CD 62 greater
.CD 63 question
.CD 64 at
.CD 91 bracketleft
.CD 92 backslash
.CD 93 bracketright
.CD 94 circumflex "サーカムフレクスアクセント"
.CD 95 underscore
.CD 96 quoteleft
.CD 123 braceleft
.CD 124 bar
.CD 125 braceright
.CD 126 tilde "チルドアクセント"
.ch Fo
.
.
.\" --------------------------------------------------------------------
.SS "Latin-1 特殊文字"
.\" --------------------------------------------------------------------
.
これらの文字は、文字コード 128 から 255 の範囲です。
.
これらは、
.I Latin-1
.RI ( iso-8859-1 )
コード集合の文字、すなわち Unicode の範囲
.IR "C1 制御と Latin-1 補足"
と等価なものの文字として解釈されます。
.
.TP
128\-159
.
C1 制御。
それら自身を印字しますが、効果はほとんど未定義です。
.
.TP
160
.
ISO Latin-1 の
.I ブレイク無しスペース
はエスケープされたスペース文字
.BR `\e\ '
にマップされています。
.
.TP
173
.
ソフトハイフン制御文字 (それ自身を印字)。
.
groff はこの文字を出力に使いません
(そのため、下記の表からは省略されています)。
入力文字 173 は
.BR \e%
にマップされています。
.
.
.P
残りの範囲 (161\-172, 174\-255)、すなわち Unicode で
.I Latin-1 補足
と呼ばれるものは、それら自身を印字する印字可能文字です。
.
Latin-1 コードページを持つシステムではキーボードから直接指定可能ですが、
等価な名前付き文字を使った方が良いです。
次の節を見てください。
.
.
.P
.if !\n[cR] .wh \n(nlu+\n(.tu-\n(.Vu Fo
.He
.CD 161 exclamdown "逆向きの感嘆符"
.CD 162 cent
.CD 163 sterling
.CD 164 currency
.CD 165 yen
.CD 166 brokenbar
.CD 167 section
.CD 168 dieresis
.CD 169 copyright
.CD 170 ordfeminine
.CD 171 guillemotleft
.CD 172 logicalnot
.CD 174 registered
.CD 175 macron
.CD 176 degree
.CD 177 plusminus
.CD 178 twosuperior
.CD 179 threesuperior
.CD 180 acute "アキュートアクセント"
.CD 181 mu "マイクロ記号"
.CD 182 paragraph
.CD 183 periodcentered
.CD 184 cedilla
.CD 185 onesuperior
.CD 186 ordmasculine
.CD 187 guillemotright
.CD 188 onequarter
.CD 189 onehalf
.CD 190 threequarters
.CD 191 questiondown
.CD 192 Agrave
.CD 193 Aacute
.CD 194 Acircumflex
.CD 195 Atilde
.CD 196 Adieresis
.CD 197 Aring
.CD 198 AE
.CD 199 Ccedilla
.CD 200 Egrave
.CD 201 Eacute
.CD 202 Ecircumflex
.CD 203 Edieresis
.CD 204 Igrave
.CD 205 Iacute
.CD 206 Icircumflex
.CD 207 Idieresis
.CD 208 Eth
.CD 209 Ntilde
.CD 210 Ograve
.CD 211 Oacute
.CD 212 Ocircumflex
.CD 213 Otilde
.CD 214 Odieresis
.CD 215 multiply
.CD 216 Oslash
.CD 217 Ugrave
.CD 218 Uacute
.CD 219 Ucircumflex
.CD 220 Udieresis
.CD 221 Yacute
.CD 222 Thorn
.CD 223 germandbls
.CD 224 agrave
.CD 225 aacute
.CD 226 acircumflex
.CD 227 atilde
.CD 228 adieresis
.CD 229 aring
.CD 230 ae
.CD 231 ccedilla
.CD 232 egrave
.CD 233 eacute
.CD 234 ecircumflex
.CD 235 edieresis
.CD 236 igrave
.CD 237 iacute
.CD 238 icircumflex
.CD 239 idieresis
.CD 240 eth
.CD 241 ntilde
.CD 242 ograve
.CD 243 oacute
.CD 244 ocircumflex
.CD 245 otilde
.CD 246 odieresis
.CD 247 divide
.CD 248 oslash
.CD 249 ugrave
.CD 250 uacute
.CD 251 ucircumflex
.CD 252 udieresis
.CD 253 yacute
.CD 254 thorn
.CD 255 ydieresis
.ch Fo
.
.
.\" --------------------------------------------------------------------
.SS "名前付き文字"
.\" --------------------------------------------------------------------
.
roff システムで特殊文字を指定する標準の方法が、
名前付き文字の成句です。
.
エスケープシーケンスを使用することで、これらを文書テキストに埋め込めます。
.
.BR groff (7)
が、これらのエスケープシーケンスがどのように見えるのかを記述しています。
.
文字名は、
ASCII または Latin-1 コード集合の任意の文字から構成可能です。
アルファベットと数値だけではありません。
.
以下例です:
.
.TP
.BI \e c
名前
.IR c
を持つ文字。
名前は 1 文字 (長さ 1) です。
.
.TP
.BI \e( ch
2 文字の名前
.IR ch
を持つ名前付き文字。
.
.TP
.BI \e[ 文字名 ]
.I 文字名
という名を持つ名前付き文字
(名前の長さは 1, 2, 3, .\|.\|.)。
.
.
.P
groff では、各 8 ビット入力文字を
.BI \en[char n ]
という表現で参照可能です。
ここで
.I n
は文字の 10 進コードであり、先頭に 0 を付けない 0 から 255 の数値です。
.
これらは、
.B .trin
リクエストを使用して、グリフのエンティティにマップされます。
.
更に、新規文字名を
.B .char
リクエストで作成可能です。
.BR groff (7)
を参照してください。
.
.
.P
.\" we don't use the third column
.ta \w'\fI出力'u+\n(Spu \
    +\w'\fI入力'u+\n(Spu-1n \
    +1n \
    +\w'periodcentered'u+\n(Spu
.if !\n[cR] .wh \n(nlu+\n(.tu-\n(.Vu Fo
.de He
.P
'nf
.ft I
出力	入力		PostScript	注
	名		名
.ft
.P
..
.He
.C2 -D Eth "アイスランド語の大文字 eth"
.C2 Sd eth "アイスランド語の小文字 eth"
.C2 TP Thorn "アイスランド語の大文字 thorn"
.C2 Tp thorn "アイスランド語の小文字 thorn"
.C2 ss germandbls "ドイツ語の鋭い s"
.
.P
.I リゲチャ
.C2 ff ff "ff のリゲチャ"
.C2 fi fi "fi のリゲチャ"
.C2 fl fl "fl のリゲチャ"
.C2 Fi ffi "ffi のリゲチャ"
.C2 Fl ffl "ffl のリゲチャ"
.C2 AE AE
.C2 ae ae
.C2 OE OE
.C2 oe oe
.C2 IJ IJ "オランダ語の IJ リゲチャ"
.C2 ij ij "オランダ語の ij リゲチャ"
.C2 .i dotlessi "点のない i (トルコ語)"
.C2 .j dotlessj "点のない j"
.
.P
.I アクセント付き文字
.C2 'A Aacute
.C2 'C Cacute
.C2 'E Eacute
.C2 'I Iacute
.C2 'O Oacute
.C2 'U Uacute
.C2 'Y Yacute
.C2 'a aacute
.C2 'c cacute
.C2 'e eacute
.C2 'i iacute
.C2 'o oacute
.C2 'u uacute
.C2 'y yacute
.C2 :A Adieresis "ウムラウト付き A"
.C2 :E Edieresis
.C2 :I Idieresis
.C2 :O Odieresis
.C2 :U Udieresis
.C2 :Y Ydieresis
.C2 :a adieresis
.C2 :e edieresis
.C2 :i idieresis
.C2 :o odieresis
.C2 :u udieresis
.C2 :y ydieresis
.C2 ^A Acircumflex
.C2 ^E Ecircumflex
.C2 ^I Icircumflex
.C2 ^O Ocircumflex
.C2 ^U Ucircumflex
.C2 ^a acircumflex
.C2 ^e ecircumflex
.C2 ^i icircumflex
.C2 ^o ocircumflex
.C2 ^u ucircumflex
.C2 `A Agrave
.C2 `E Egrave
.C2 `I Igrave
.C2 `O Ograve
.C2 `U Ugrave
.C2 `a agrave
.C2 `e egrave
.C2 `i igrave
.C2 `o ograve
.C2 `u ugrave
.C2 ~A Atilde
.C2 ~N Ntilde
.C2 ~O Otilde
.C2 ~a atilde
.C2 ~n ntilde
.C2 ~o otilde
.C2 vS Scaron
.C2 vs scaron
.C2 vZ Zcaron
.C2 vz zcaron
.C2 ,C Ccedilla
.C2 ,c ccedilla
.C2 /L Lslash "ポーランド語のスラッシュ付き L"
.C2 /l lslash "ポーランド語のスラッシュ付き l"
.C2 /O Oslash "スカンジナビア語のスラッシュ付き O"
.C2 /o oslash "スカンジナビア語のスラッシュ付き o"
.C2 oA Aring
.C2 oa aring
.
.P
.I アクセント
.C2 a" hungarumlaut "ハンガリー語のウムラウト"\""
.C2 a- macron "マクロン、バーアクセント"
.C2 a. dotaccent "ドットアクセント"
.C2 a^ circumflex "サーカムフレクスアクセント"
.C2 aa acute "アキュートアクセント"
.C2 ga grave "グレーブアクセント"
.C2 ab breve "ブリーブアクセント"
.C2 ac cedilla "セディラアクセント"
.C2 ad dieresis "ウムラウト、ダイエレシス"
.C2 ah caron "h\('a\(vcek アクセント"
.C2 ao ring "リングもしくはサークルアクセント"
.C2 a~ tilde "チルドアクセント"
.C2 ho ogonek "フックもしくはオゴネクアクセント"
.C2 ha asciicircum "\s-2ASCII\s+2 サーカムフレクス、ハット、キャレット"
.C2 ti asciitilde "\s-2ASCII\s0 チルド、大きいチルド"
.
.P
.I 引用符
.C2 Bq quotedblbase "低い二重コンマ引用符"
.C2 bq quotesinglbase "低い一重コンマ引用符"
.C2 lq quotedblleft
.C2 rq quotedblright
.C2 oq quoteleft "一重開き引用符"
.C2 cq quoteright "一重閉じ引用符 (ASCII 39)"
.C2 aq quotesingle "アポストロフィ引用符"
.C2 dq quotedbl "二重引用符 (ASCII 34)"
.C2 Fo guillemotleft
.C2 Fc guillemotright
.C2 fo guilsinglleft
.C2 fc guilsinglright
.
.P
.I 句読点
.C2 r! exclamdown
.C2 r? questiondown
.C2 em emdash "全角 (M の幅の) ダッシュ"
.C2 en endash "半角 (n の幅の) ダッシュ"
.C2 hy hyphen
.
.P
.I 括弧
.C2 lB bracketleft
.C2 rB bracketright
.C2 lC braceleft
.C2 rC braceright
.C2 la angleleft "始め山括弧"
.C2 ra angleright "終り山括弧"
.
.P
.I 矢印
.C2 <- arrowleft
.C2 -> arrowright
.C2 <> arrowboth "左右向き矢印"
.C2 da arrowdown
.C2 ua arrowup
.C2 va arrowupdn "上下向き矢印"
.C2 lA arrowdblleft
.C2 rA arrowdblright
.C2 hA arrowdblboth "左右向き二重矢印"
.C2 dA arrowdbldown
.C2 uA arrowdblup
.C2 vA \& "上下向き二重矢印"
.C2 an arrowhorizex "水平な矢印の延長"
.
.P
.I 線
.C2 -h hbar
.C2 or bar
.C2 ba bar
.C2 br br "従来の troff で利用された箱罫線"
.C2 ru ru "ベースラインの罫線"
.C2 ul ul "従来の troff で利用された下線"
.C2 bv bv "縦棒"
.C2 bb brokenbar
.C2 sl slash
.C2 rs backslash
.
.P
.I テキストマーカ
.C2 ci circle
.C2 bu bullet
.C2 dd daggerdbl "ダブルダガーサイン"
.C2 dg dagger
.C2 lz lozenge
.C2 sq square
.C2 ps paragraph
.C2 sc section
.C2 lh handleft
.C2 rh handright
.C2 at at
.C2 sh numbersign
.C2 CR carriagereturn "改行の記号"
.C2 OK a19 "チェックマーク、照合のしるし"
.
.P
.I 法律関連
.C2 co copyright
.C2 rg registered
.C2 tm trademark
.C2 bs bell "AT&T Bell Labs ロゴ (groff では使われません)"
.
.P
.I 通貨記号
.C2 Do dollar
.C2 ct cent
.C2 eu \& "公式なユーロ記号"
.C2 Eu Euro "フォント依存のユーログリフバリアント"
.C2 Ye yen
.C2 Po sterling "英国の通貨記号"
.C2 Cs currency "スカンジナビアの通貨記号"
.C2 Fn florin "オランダの通貨記号"
.
.P
.I 単位
.C2 de degree
.C2 %0 perthousand "千分の一記号、パーミル"
.C2 fm minute "フィート記号、プライム"
.C2 sd second
.C2 mc mu "マイクロ記号"
.C2 Of ordfeminine
.C2 Om ordmasculine
.
.P
.I 論理シンボル
.C2 AN logicaland
.C2 OR logicalor
.C2 no logicalnot
.C2 te existential "存在する、存在限定子"
.C2 fa universal "すべての、普通限定子"
.C2 st suchthat
.C2 3d therefore
.C2 tf therefore
.
.P
.I 数学シンボル
.C2 12 onehalf
.C2 14 onequarter
.C2 34 threequarters
.C2 S1 onesuperior
.C2 S2 twosuperior
.C2 S3 threesuperior
.
.C2 pl plusmath "特殊フォントの正符号"
.C1 - minus "現在のフォントの負符号"
.C2 -+ minusplus
.C2 +- plusminus
.CN t+- plusminus "テキストバリアントの `+-'"
.C2 pc periodcentered "乗算記号のドット"
.C2 md dotmath
.C2 mu multiply
.CN tmu multiply "テキストバリアントの `mu'"
.C2 c* circlemultiply "円の中に積の記号"
.C2 c+ circleplus "円の中に正符号"
.C2 di divide "除算記号"
.CN tdi divide "テキストバージョンの `di'"
.C2 f/ fraction "除算の棒"
.C2 ** asteriskmath
.
.C2 <= lessequal
.C2 >= greaterequal
.C2 << \& "非常に小さい"
.C2 >> \& "非常に大きい"
.C2 != notequal
.C2 eq equalmath "特殊フォントの等号"
.C2 == equivalence
.C2 =~ congruent
.C2 ap similar
.C2 ~~ approxequal
.C2 ~= approxequal
.C2 pt proportional
.
.C2 es emptyset
.C2 mo element
.C2 nm notelement
.C2 nb notsubset
.C2 nc notpropersuperset
.C2 ne notequivalence
.C2 sb propersubset
.C2 sp propersuperset
.C2 ib reflexsubset
.C2 ip reflexsuperset
.C2 ca intersection "共通集合、キャップ"
.C2 cu union "合併集合、カップ"
.
.C2 /_ angle
.C2 pp perpendicular
.C2 is integral
.CN sum sum
.CN product product
.C2 gr gradient
.C2 sr radical "根号 (square root)"
.C2 rn \& overline "根号の続き"
.
.C2 if infinity
.C2 Ah aleph
.C2 Im Ifraktur "フラクトゥール(ドイツ字体) I, 虚数"
.C2 Re Rfraktur "フラクトゥール(ドイツ字体) R, 実数"
.C2 wp weierstrass "ヴァイヤーシュトラースの p"
.C2 pd partialdiff "偏微分記号"
.
.P
.I ギリシャ文字
.C2 *A Alpha
.C2 *B Beta
.C2 *C Xi
.C2 *D Delta
.C2 *E Epsilon
.C2 *F Phi
.C2 *G Gamma
.C2 *H Theta
.C2 *I Iota
.C2 *K Kappa
.C2 *L Lambda
.C2 *M Mu
.C2 *N Nu
.C2 *O Omicron
.C2 *P Pi
.C2 *Q Psi
.C2 *R Rho
.C2 *S Sigma
.C2 *T Tau
.C2 *U Upsilon
.C2 *W Omega
.C2 *X Chi
.C2 *Y Eta
.C2 *Z Zeta
.C2 *a alpha
.C2 *b beta
.C2 *c xi
.C2 *d delta
.C2 *e epsilon
.C2 *f phi
.C2 +f phi1 "ファイ変形"
.C2 *g gamma
.C2 *h theta
.C2 +h theta1 "シータ変形"
.C2 *i iota
.C2 *k kappa
.C2 *l lambda
.C2 *m mu
.C2 *n nu
.C2 *o omicron
.C2 *p pi
.C2 +p omega1 "パイ変形、オメガ風"
.C2 *q psi
.C2 *r rho
.C2 *s sigma
.C2 *t tau
.C2 *u upsilon
.C2 *w omega
.C2 *x chi
.C2 *y eta
.C2 *z zeta
.C2 ts sigma1 "語尾小文字σ"
.
.P
.I カードシンボル
.C2 CL club "クラブスート"
.C2 SP spade "スペードスート"
.C2 HE heart "ハートスート"
.C2 DI diamond "ダイヤスート"
.ch Fo
.
.
.\" --------------------------------------------------------------------
.SH "作者"
.\" --------------------------------------------------------------------
.
Copyright \(co 1989-2000, 2001, 2002 Free Software Foundation, Inc.
.
.P
この文書は、FDL (GNU Free Documentation License) バージョン 1.1 か
それ以降のものに基づいて配布されています。
.
あなたは、このパッケージとともに FDL のコピーを受け取っているはずですが、
これは
.ie \n(.g \
.  URL http://\:www.gnu.org/\:copyleft/\:fdl.html "GNU のコピーレフトのサイト"
.el GNU のコピーレフトのサイト <http://www.gnu.org/copyleft/fdl.html>
からもオンラインで入手可能です。
.
.P
この文書は GNU の roff ディストリビューションである
.IR groff
の一部です。
.
この文書は
.ie \n(.g \
.  MTO jjc@jclark.com "James Clark"
.el James Clark <jjc@jclark.com>
が書き、
.ie \n(.g \
.  MTO wl@gnu.org  "Werner Lemberg"
.el Werner Lemberg <wl@gnu.org>
と
.ie \n(.g \
.  MTO bwarken@mayn.de "Bernd Warken" .
.el Bernd Warken <bwarken@mayn.de>.
が追加しました。
.
.
.\" --------------------------------------------------------------------
.SH "関連項目"
.\" --------------------------------------------------------------------
.
.TP
.BR groff (1)
GNU roff フォーマッタ。
.
.TP
.BR groff (7)
groff 清書言語の短かい参考書。
.
.
.P
.IR "An extension to the troff character set for Europe" ,
E.G. Keizer, K.J. Simonsen, J. Akkerhuis; EUUG Newsletter, Volume 9,
No. 2, Summer 1989
.
.
.P
.ie \n(.g .URL http://\:www.unicode.org "The Unicode Standard"
.el The Unicode Standard <http://www.unicode.org>
.
.\" --------------------------------------------------------------------
.\" Emacs settings
.\" --------------------------------------------------------------------
.\" Local Variables:
.\" mode: nroff
.\" End:
