freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_msafer.7
.ig \"-*- nroff -*-
Copyright (C) 1989-1995 Free Software Foundation, Inc.

Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.

Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.
..
.\" Original Revision: 1.1.1.1
.\" jpman %Id: groff_msafer.7,v 1.3 1999/08/27 02:06:47 yt-kage Stab %
.TH MSAFER 7 "7 September 1996" "Groff Version 1.11"
.SH 名称
msafer \- groff -msafer マクロ
.SH 書式
.B groff
.B \-msafer
[
.IR options .\|.\|.
]
[
.IR files .\|.\|.
]
.SH 解説
マクロ -msafer は、リクエスト
.BR open ,
.BR opena ,
.BR pso ,
.BR sy ,
.B pi
を除去します。
信頼できない入手元からのソースを処理するときには、
本マクロを使用すべきです。
安全性を最大限に高めるには、
本マクロは、コマンドオプションにおける最初の -m オプションであるべきです。
通常、本マクロは groff の
.B \-S
オプションを使用して起動されます。
本オプションは、
.B pic
に対しても
.B \-S
フラグを渡します。
.SH 関連ファイル
.B /usr/share/tmac/tmac.safer
.SH 関連項目
.BR groff (1),
.BR troff (1),
.BR pic (1)
