freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_char.7
.TH GROFF_CHAR 7 "1 May 2003" "Groff Version 1.19"
.SH 名称
groff_char \- groff のグリフ名
.SH 解説
.\" The lines above were designed to satisfy `apropos'.
.
.\" For best results, format this document with `groff' (GNU roff).
.
.
.\" --------------------------------------------------------------------
.\" Legalize
.\" --------------------------------------------------------------------
.
.ig
groff_char(7)

This file is part of groff (GNU roff).

File position: <groff_src_top>/man/groff_char.man
Last update: 24 Feb 2003

Copyright (C) 1989-2000, 2001, 2002, 2003 Free Software Foundation, Inc.
written by Werner Lemberg <wl@gnu.org>
with additions by Bernd Warken <bwarken@mayn.de>

Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.1 or
any later version published by the Free Software Foundation; with the
Invariant Sections being this .ig-section and AUTHOR, with no
Front-Cover Texts, and with no Back-Cover Texts.

A copy of the Free Documentation License is included as a file called
FDL in the main directory of the groff source package.
..
.
.\" --------------------------------------------------------------------
.\" Setup Part 1
.\" --------------------------------------------------------------------
.
.\" groff only
.if \n(.g .mso www.tmac
.\".if \n(.g .ne 2v
.\".if \n(.g .sv 2v
.
.ds aq \(aq
.
.\" non-groff
.if !\n(.g .if '\(aq'' .ds aq \'
.
.\" groff
.if !\n(.g .ig
.  tr \[aq]\[aq]
.  if !c\[aq] \
.    ds aq \'
.  \" This is very special.  The standard devdvi fonts don't have a
.  \" real `aq' glyph; it is defined with .char to be ' instead.
.  \" The .tr request below in the definition of the C macro maps
.  \" the apostrophe ' onto the `aq' glyph which would cause a
.  \" recursive loop.  gtroff prevents this within the .char
.  \" request, trying to access glyph `aq' directly from the font.
.  \" Consequently, we get a warning, and nothing is printed.
.  \"
.  \" The following line prevents this.
.  if '\*[.T]'dvi' \
.    if !r ECFONTS \
.      ds aq \'
.  \" The same is true for X
.  ds dev \*[.T]
.  substring dev 0 0
.  if '\*[dev]'X' .ds aq \'
.  ig
..
.
.\" --------------------------------------------------------------------
.\" .Ac accented-char accent char (groff)
.
.if !\n(.g .ig
.de Ac
.  if !c\\$1 \{\
.    ie c\\$2 \
.      char \\$1 \
\k[acc]\
\h'\w'\\$3'u'\
\h'(u;-\w'\\$2'-\w'\\$3'/2+\\\\n[skw]+(\w'x'*0)-\\\\n[skw])'\
\v'(u;\w'x'*0+\\\\n[rst]+(\w'\\$3'*0)-\\\\n[rst])'\
\\$2\
\v'(u;\w'x'*0-\\\\n[rst]+(\w'\\$3'*0)+\\\\n[rst])'\
\h'|\\\\n[acc]u'\
\\$3
.    el \
.      char \\$1 \\$3
.    hcode \\$1 \\$3
.  \}
..
.
.\" --------------------------------------------------------------------
.\" Setup Part 2
.\" --------------------------------------------------------------------
.
.nr Sp 2n
.
.\" --------------------------------------------------------------------
.\" .C2/.CN (groff)
.
.if !\n(.g .ig
.de CN
.  C \e[\\$1] "" \[\\$1] \\$2 "\\$3" "\\$4"
..
.
.\" .Ns (groff) start .CN block
.
.if !\n(.g .ig
.de Ns
.  CN "\\$1" "\\$2" "\\$3" "\\$4"
.  if !\n[cR] \
.    wh (\\n[nl]u + \\n[.t]u - \\n[.V]u) Fo
..
.
.\" .Ne (groff) end .CN block
.
.if !\n(.g .ig
.de Ne
.  ch Fo
.  CN "\\$1" "\\$2" "\\$3" "\\$4"
..
.
.if \n(.g \{\
.  als C2 CN
.  als 2s Ns
.  als 2e Ne
.\}
.
.\" --------------------------------------------------------------------
.\" .C2 (non-groff)
.
.if \n(.g .ig
.de C2
.  C \e(\\$1 "" \\(\\$1 \\$2 "\\$3" "\\$4"
..
.
.\" .2s (non-groff) start .C2 block
.
.if \n(.g .ig
.de 2s
.  C2 "\\$1" "\\$2" "\\$3" "\\$4"
.  if !\n(cR \
.    wh \\n(nlu+\\n(.tu-\\n(.Vu Fo
..
.
.\" .2e (non-groff) end .C2 block
.
.if \n(.g .ig
.de 2e
.  ch Fo
.  C2 "\\$1" "\\$2" "\\$3" "\\$4"
..
.
.\" --------------------------------------------------------------------
.\" .CD (groff)
.
.if !\n(.g .ig
.de CD
.  C \[char\\$1] \\$1 \[char\\$1] \\$2 "\\$3" "\\$4" 1
..
.
.\" .Ds (groff) start .CD block
.
.if !\n(.g .ig
.de Ds
.  CD "\\$1" "\\$2" "\\$3" "\\$4"
.  if !\n[cR] \
.    wh (\\n[nl]u + \\n[.t]u - \\n[.V]u) Fo
..
.
.\" .De (groff) end .CD block
.
.if !\n(.g .ig
.de De
.  ch Fo
.  CD "\\$1" "\\$2" "\\$3" "\\$4"
..
.
.\" --------------------------------------------------------------------
.
.do if !r ECFONTS .do fspecial CR R
.
.\" .CT
.
.de CT
.  nr c1 \w'\\$1'
.  if \\n(c1 \
.    nr c1 +\\n(Spu
.  nr c2 \\n(c1+\w'\\$2'
.  if \\n(c1<\\n(c2 \
.    nr c2 +\\n(Spu
.  nr c3 \\n(c2+\w'\\$3'
.  if \\n(c2<\\n(c3 \
.    nr c3 +\\n(Spu
.  nr c4 \\n(c3+\w'\\$4'
.  if \\n(c3<\\n(c4 \
.    nr c4 +\\n(Spu
.  nr c5 \\n(c4+\w'\\$5'
.  if \\n(c4<\\n(c5 \
.    nr c5 +\\n(Spu
..
.
.\" .CL
.
.de CL
\\$1\c
\h'\\n(c1u-\\n(.ku'\\$2\c
\h'\\n(c2u-\\n(.ku'\\$3\c
\h'\\n(c3u-\\n(.ku'\\$4\c
\h'\\n(c4u-\\n(.ku'\\$5\c
\h'\\n(c5u-\\n(.ku'\\$6
.  br
..
.
.\" --------------------------------------------------------------------
.\" input-name decimal-code output-name ps-name unicode description is-char
.\" .C (groff)
.
.if !\n(.g .ig
.de C
.  nr CH 1
.  if \\$7 \
.    if !c\\$1 \
.      nr CH 0
.  ie !\\n[CH] \
.    ds CH
.  el \{\
.    ft CR
.    tr `\`'\*[aq]
.    in 0
.    di CH
.    nop \&\\$1
.    br
.    di
.    chop CH
.    in
.    ft
.    ds CH \\*[CH]
.    tr ``''
.  \}
.  di CC
.  ie c\\$3 \{\
.    nop \\&\\$3\c
.    \" The \x values assure that oversized symbols don't
.    \" overlap vertically.  The constant 1.5p is heuristic.
.    nop \x'(\w'('*0 - ((\\n[.cht]u - \\n[rst]u - 1.5p) >? 0))'\c
.    nop \x'((\\n[.cdp]u + \\n[rsb]u - 1.5p) >? 0)'\c
.    nop \h'(\\n[c1]u - \\n[.k]u)'\\*[CH]\c
.    nop \h'(\\n[c2]u - \\n[.k]u)'\\$2\c
.  \}
.  el \{\
.    nop (N/A)\c
.    nop \h'(\\n[c1]u - \\n[.k]u)'\\*[CH]\c
.  \}
.  nop \h'(\\n[c3]u - \\n[.k]u)'\\$4\c
.  nop \h'(\\n[c4]u - \\n[.k]u)'\\$5\c
.  br
.  di
.  \" we move upwards later on so force a page break now if necessary
.  if (\\n[dn] >= \\n[.t]) \
.    bp
.  mk C1
.  in 0
.  CC
.  in
.  \" allow multiple lines for last column
.  in +\\n[c5]u
.  mk C2
.  sp |\\n[C1]u
.  nr PN \\n[%]
.  ad l
.  nop \\$6
.  ad b
.  in
.  if (\\n[PN] == \\n[%]) \
.    if (\\n[nl] < \\n[C2]) \
.      sp |\\n[C2]u
..
.
.\" --------------------------------------------------------------------
.\" .C (non-groff)
.
.if \n(.g .ig
.de C
.  ft B
.  tr `\`'\*(aq
.  in 0
.  di CH
\&\\$1
.  br
.  di
.  in
.  ft
.  ds CH \\*(CH\
.  tr ``''
.  di CC
.  ie !'\\$3'' \{\
\&\\$3\c
\h'\\n(c1u-\\n(.ku)'\\*(CH\c
\h'\\n(c2u-\\n(.ku)'\\$2\c
\h'\\n(c3u-\\n(.ku)'\\$4\c
.  \}
.  el \{\
(N/A)\c
\h'\\n(c1u-\\n(.ku)'\\*(CH\c
\h'\\n(c3u-\\n(.ku)'\\$4\c
.  \}
\h'\\n(c4u-\\n(.ku)'\\$5\c
\h'\\n(c5u-\\n(.ku)'\\$6
.  br
.  di
.  \" we move upwards later on so force a page break now if necessary
.  if \\n(dn>=\\n(.t \
.    bp
.  mk C1
.  in 0
.  CC
.  in
.  \" allow multiple lines for last column
.  in +\\n(c5u
.  mk C2
.  sp |\\n(C1u
.  nr PN \\n%
.  ad l
\\$6
.  ad b
.  in
.  if \\n(PN==\\n% \
.    if \\n(nl<\\n(C2 \
.      sp |\\n(C2u
..
.
.\" --------------------------------------------------------------------
.
.de Fo
'  bp
.  He
..
.
.de Pa
.  P
.  ne 3
..
.
.
.
.\" $FreeBSD$
.\"
.\" groff_char.7 の表記を尊重しました。
.\" JIS X 0212 の附属書 3 表 3「0208とJISX0221との対応表」を、
.\" 文字の名前の参考としてではなく、英単語と日本語の単語の対応の
.\" 参考としました。
.\" Kazuo Horikawa <horikawa@jp.FreeBSD.org> 1998/12/06
.\"
.\" --------------------------------------------------------------------
.\" .SH 解説
.\" --------------------------------------------------------------------
.
このマニュアルページは標準的な
.B groff
グリフ名とデフォルト入力マッピング、\%latin-1 を列挙しています。
.
この文書でのグリフは、
.RB ( man (1)
や roff 整形器への
.B \-T
オプションで) 選択された出力デバイスに依存して、
見え方が異なります。
.
このマニュアルページを印刷 (表示) するのに用いられるデバイスで
利用できないグリフは
.ie \n(.g `(N/A)' でマークされます。
現在使用されているデバイスは `\*(.T' です。
.el `(N/A)'
.
.
.P
実際のバージョンでは、
.B groff
は直接入力に対しては \%8 ビット文字のみを提供し、
更なるグリフに対しては名前付き文字を提供します。
.
ASCII プラットフォームでは、0 から 127 (10 進数) の範囲の入力文字コードは
通常の \%7 ビット ASCII 文字を表現しますが、
127 と 255 の間のコードはデフォルトで対応する
.I \%Latin-1
.RI ( \%ISO-8859-1 )
コード集合の文字として解釈されます。
.
このマッピングはファイル \f(CWlatin1.tmac\fP に含まれていて、
異なった入力エンコードをロードすることによって変更できます。
.
いくつかの入力文字は
.BR groff
によって予約され、内部の使用のため、または特別の入力目的のための
いずれかであることに注意してください。
.
EBCDIC プラットフォームでは、コードページ
.B cp1047
のみがサポートされています (\%Latin-1 と同じ文字を含みます。
入力エンコードファイルは \f(CWcp1047.tmac\fP と呼ばれます)。
.
再び、いくつかの入力文字は内部おおび特別な目的のために予約されています。
.
.IR \%Latin-2
などの他の \%8 ビット文字の設定は、
(経験のあるユーザにとっては) どちらかというと簡単です。
.B groff
の次のメジャーバージョンは Unicode を使用しますので、
追加のエンコードは提供されません。
.
.
.P
すべての roff システムは、名前付きグリフの概念を提供します。
.
伝統的な roff システムでは長さ 2 の名前のみが使用されていましたが、
groff は長い名前も提供します。
.
印字可能な \%7 ビット ASCII の範囲外のすべての表示文字に対しては
名前付きグリフだけを使うよう、強くお勧めします。
.
.
.P
定義済みの groff エスケープシーケンス (名前の長さ 1 のもの) には、
1 文字を生成するものがあります。
これらは歴史的な理由で存在したものや、構文文字の印字可能バージョンです。
.
これらには `\f(CW\e\e\fP', `\f(CW\e\'\fP', `\f(CW\e`\fP', `\f(CW\e-\fP',
`\f(CW\e.\fP', `\f(CW\ee\fP' があります。
.BR groff (7)
を参照してください。
.
.
.P
groff では、これらの異なったタイプの文字とグリフは
すべて、`\f(CW.if\ c\fP' 条件で確実にテスト可能です。
.
.
.\" --------------------------------------------------------------------
.SH 参照
.\" --------------------------------------------------------------------
.
この節では、groff のグリフは表形式で明記します。
.
列の意味は次の通りです。
.
.
.TP
.I "出力"
現在のデバイスに対してグリフがどのように印字されるかを示します。
他のデバイス上では非常に異なった形になるかもしれませんが、
常に同じグリフを表現します。
.
.
.TP
.I "入力名"
キーボード上のキーで直接もしくは groff エスケープシーケンスを用いて、
グリフをどのように入力するかを示します。
.
.
.TP
.I "入力コード"
この欄は単一の文字で入力することのできるグリフにおいて用いられ、
その文字の ISO \%Latin-1 10 進数コードが書かれています。
.
このコードは、0 から 127 の範囲の \%7 ビット ASCII を含む、
Unicode 文字の下位 256 個と等価であることに注意してください。
.
.
.TP
.I "PostScript 名"
欄にはグリフの一般的な PostScript 名が示されます。
.
.
.TP
.I "分解された Unicode"
合成グリフ名で使用されるグリフ名です。
.
.
.
.\" --------------------------------------------------------------------
.SS "7 ビット文字コード 32-126"
.\" --------------------------------------------------------------------
.
これらは、7 ビット ASCII コード値に割り当てられる基本グリフです。
.
それは、文字標準 \%ISO-8859-1 (\%Latin-1) および Unicode
.RI ( "C0 制御および基本ラテン"
の範囲) の印字可能な文字と等価です。
.
合成グリフ名に使用されるグリフ名は 'u0020' から `u007E' です。
.
.
.P
範囲 \%0\-31 と文字 127 の入力文字は印字可能な文字で
.I ない
ことに注意してください。
.
とにかくそれらのほとんどは
.B groff
には無効の入力文字で、有効なものには特別な意味があります。
.
EBCDIC については、印字可能な文字は範囲 \%66\-255 です。
.
.
.TP
48\-57
10 進数字の 0 から\ 9 (それら自身を印字)。
.
.
.TP
65\-90
大文字 A\-Z (それら自身を印字)。
.
.
.TP
97\-122
小文字 a\-z (それら自身を印字)。
.
.
.P
残っているほとんどの文字はそれら自身として印刷する範囲として
まったく表現されていません。
唯一の例外として以下の文字があります:
.
.
.TP
.B \`
ISO \%Latin-1 `グレーブアクセント' (コード\ 96) は ` として、
すなわち一重開き引用符として印字されます。
`\f(CW\e`\fP' でオリジナルの文字を得られます。
.
.
.TP
.B \*(aq
ISO \%Latin-1 `アポストロフィ' (コード\ 39) は ' として、
すなわち一重閉じ引用符として印字されます。
`\f(CW\e(aq\fP' でオリジナルの文字を得られます。
.
.
.TP
.B -
ISO \%Latin-1 の `ハイフン、負符号' (コード\ 45) はハイフンとして
表示されます。
負符号は `\f(CW\e-\fP' で得られます。
.
.
.TP
.B ~
ISO \%Latin-1 の `チルダ' (コード\ 126) は付加記号として使用できるように
サイズが減少されます。
より大きいグリフは `\f(CW\e(ti\fP' で得られます。
.
.
.TP
.B ^
ISO \%Latin-1 の `サーカムフレクスアクセント' (コード 94) は
付加記号として使用できるようにサイズが減少されます。
より大きいグリフは `\f(CW\e(ha\fP' で得られます。
.
.
.P
.CT "\fI出力" "\fI入力" "\fI入力X" "bracketright" "XXXXXXX"
.de He
.  P
.  ne 4
.  ft I
.  CL "出力" "入力" "入力" "PostScript" "Unicode"    "注"
.  CL ""       "名"  "コード"  "名"       "分解" ""
.  ft
.  P
..
.He
.Ds 33 exclam u0021
.CD 34 quotedbl u0022
.CD 35 numbersign u0023
.CD 36 dollar u0024
.CD 37 percent u0025
.CD 38 ampersand u0026
.CD 39 quoteright u0027
.CD 40 parenleft u0028
.CD 41 parenright u0029
.CD 42 asterisk u002A
.CD 43 plus u002B
.CD 44 comma u002C
.CD 45 hyphen u2010
.CD 46 period u002E
.CD 47 slash u002F
.CD 58 colon u003A
.CD 59 semicolon u003B
.CD 60 less u003C
.CD 61 equal u003D
.CD 62 greater u003E
.CD 63 question u003F
.CD 64 at u0040
.CD 91 bracketleft u005B
.CD 92 backslash u005C
.CD 93 bracketright u005D
.CD 94 circumflex u005E "サーカムフレクスアクセント"
.CD 95 underscore u005F
.CD 96 quoteleft u0060
.CD 123 braceleft u007B
.CD 124 bar u007C
.CD 125 braceright u007D
.De 126 tilde u007E "チルダアクセント"
.
.
.\" --------------------------------------------------------------------
.SS "8 ビット文字コード 160 から 255"
.\" --------------------------------------------------------------------
.
これらは、
.I Latin-1
.RI ( iso-8859-1 )
コード集合の文字、すなわち Unicode の範囲
.IR "C1 制御と Latin-1 補足"
と等価なものの印字可能文字として解釈されます。
.
.
.P
(非 EBCDIC ホストの) 範囲 128-159 の入力文字は印字可能な文字ではありません。
.
.
.TP
160
.
ISO \%Latin-1 の
.I ブレーク無しスペース
は伸縮可能なスペース (空白) 文字 `\f(CW\e~\fP' にマップされます。
.
.
.TP
173
.
ソフトハイフン制御文字。
.
.B groff
はこの文字を出力に使いません
(そのため、下記の表からは省略されています)。
入力文字\ 173 は `\f(CW\e%\fP' にマップされています。
.
.
.P
残りの範囲 (\%161\-172, \%174\-255) は
それら自身を印字する印字可能文字です。
.
\%Latin-1 コードページを持つシステムではキーボードから直接指定可能ですが、
グリフ名を使った方が良いです。
次の節を見てください。
.
.P
.CT "\fI出力" "\fI入力" "\fI入力X" "guillemotright" "decomposed"
.He
.Ds 161 exclamdown u00A1 "逆向きの感嘆符"
.CD 162 cent u00A2
.CD 163 sterling u00A3
.CD 164 currency u00A4
.CD 165 yen u00A5
.CD 166 brokenbar u00A6
.CD 167 section u00A7
.CD 168 dieresis u00A8
.CD 169 copyright u00A9
.CD 170 ordfeminine u00AA
.CD 171 guillemotleft u00AB
.CD 172 logicalnot u00AC
.CD 174 registered u00AE
.CD 175 macron u00AF
.CD 176 degree u00B0
.CD 177 plusminus u00B1
.CD 178 twosuperior u00B2
.CD 179 threesuperior u00B3
.CD 180 acute u00B4 "アキュートアクセント"
.CD 181 mu u00B5 "マイクロ記号"
.CD 182 paragraph u00B6
.CD 183 periodcentered u00B7
.CD 184 cedilla u00B8
.CD 185 onesuperior u00B9
.CD 186 ordmasculine u00BA
.CD 187 guillemotright u00BB
.CD 188 onequarter u00BC
.CD 189 onehalf u00BD
.CD 190 threequarters u00BE
.CD 191 questiondown u00BF
.CD 192 Agrave u0041_0300
.CD 193 Aacute u0041_0301
.CD 194 Acircumflex u0041_0302
.CD 195 Atilde u0041_0303
.CD 196 Adieresis u0041_0308
.CD 197 Aring u0041_030A
.CD 198 AE u00C6
.CD 199 Ccedilla u0043_0327
.CD 200 Egrave u0045_0300
.CD 201 Eacute u0045_0301
.CD 202 Ecircumflex u0045_0302
.CD 203 Edieresis u0045_0308
.CD 204 Igrave u0049_0300
.CD 205 Iacute u0049_0301
.CD 206 Icircumflex u0049_0302
.CD 207 Idieresis u0049_0308
.CD 208 Eth u00D0
.CD 209 Ntilde u004E_0303
.CD 210 Ograve u004F_0300
.CD 211 Oacute u004F_0301
.CD 212 Ocircumflex u004F_0302
.CD 213 Otilde u004F_0303
.CD 214 Odieresis u004F_0308
.CD 215 multiply u00D7
.CD 216 Oslash u00D8
.CD 217 Ugrave u0055_0300
.CD 218 Uacute u0055_0301
.CD 219 Ucircumflex u0055_0302
.CD 220 Udieresis u0055_0308
.CD 221 Yacute u0059_0301
.CD 222 Thorn u00DE
.CD 223 germandbls u00DF
.CD 224 agrave u0061_0300
.CD 225 aacute u0061_0301
.CD 226 acircumflex u0061_0302
.CD 227 atilde u0061_0303
.CD 228 adieresis u0061_0308
.CD 229 aring u0061_030A
.CD 230 ae u00E6
.CD 231 ccedilla u0063_0327
.CD 232 egrave u0065_0300
.CD 233 eacute u0065_0301
.CD 234 ecircumflex u0065_0302
.CD 235 edieresis u0065_0308
.CD 236 igrave u0069_0300
.CD 237 iacute u0069_0301
.CD 238 icircumflex u0069_0302
.CD 239 idieresis u0069_0308
.CD 240 eth u00F0
.CD 241 ntilde u006E_0303
.CD 242 ograve u006F_0300
.CD 243 oacute u006F_0301
.CD 244 ocircumflex u006F_0302
.CD 245 otilde u006F_0303
.CD 246 odieresis u006F_0308
.CD 247 divide u00F7
.CD 248 oslash u00F8
.CD 249 ugrave u0075_0300
.CD 250 uacute u0075_0301
.CD 251 ucircumflex u0075_0302
.CD 252 udieresis u0075_0308
.CD 253 yacute u0079_0301
.CD 254 thorn u00FE
.De 255 ydieresis u0079_0308
.
.
.\" --------------------------------------------------------------------
.SS "名前付きグリフ"
.\" --------------------------------------------------------------------
.
エスケープシーケンスを使用することで、グリフ名を文書テキストに埋め込めます。
.
.BR groff (7)
が、これらのエスケープシーケンスがどのように見えるのかを記述しています。
.
グリフ名は、
ASCII または \%Latin-1 コード集合の任意の文字から構成可能です。
アルファベットと数値だけではありません。
.
以下は例です:
.
.TP
\f(CW\e\fP\fIc\fP
名前
.IR c
を持つグリフ。
名前は 1 文字 (長さ 1) です。
.
.TP
\f(CW\e(\fP\fIch\fP
2 文字の名前
.IR ch
を持つグリフ。
.
.TP
\f(CW\e[\fP\fIchar_name\fP\f(CW]\fP
名前
.I char_name
を持つグリフ (長さは 1, 2, 3, .\|.\|.)。
.
.TP
\f(CW\e[\fP\fIbase_glyph composite_1 composite_2 .\|.\|.\fP\f(CW]\fP
合成グリフ。
より詳細に関して以下を参照してください。
.
.
.P
groff では、各 \%8 ビット入力文字を
`\f(CW\e[char\fP\fIn\fP\f(CW]\fP'
という表現で参照可能です。
ここで
.I n
は文字の 10 進コードであり、先頭に 0 を付けない 0 から 255 の数値です
(それらの実体はグリフ名では
.I ありません\c
)。
.
それらは通常、\f(CW.trin\fP リクエストを使用して、グリフにマップされます。
.
別の特別の約束事は Unicode コードポイントから直接得られた
名前でのグリフの取り扱いです。
以下でこれについて議論します。
.
更に、新規グリフ名は \f(CW.char\fP リクエストで作成可能です。
.BR groff (7)
を参照してください。
.
.P
以下では、`注' 欄のプラス記号は、特定のグリフ名がオリジナル
troff 文書 CSTR\ 54 の PS バージョンに現れることを示します。
.
.
.P
.CT "\fI出力" "\f(CW\e[-D]" "" "Ocircumflex" "u0066_0066_006C"
.de He
.  P
.  ne 4
.  ft I
.  CL "出力" "入力" "" "PostScript" "Unicode"    "注"
.  CL ""       "名"  "" "名"       "分解" ""
.  ft
.  P
..
.He
.2s -D Eth u00D0 "大文字 eth"
.C2 Sd eth u00F0 "小文字 eth"
.C2 TP Thorn u00DE "大文字 thorn"
.C2 Tp thorn u00FE "小文字 thorn"
.2e ss germandbls u00DF "ドイツ語の鋭い s"
.
.Pa
.I リゲチャと他の Latin グリフ
.P
.2s ff ff u0066_0066 "ff のリゲチャ +"
.C2 fi fi u0066_0069 "fi のリゲチャ +"
.C2 fl fl u0066_006C "fl のリゲチャ +"
.C2 Fi ffi u0066_0066_0069 "ffi のリゲチャ +"
.C2 Fl ffl u0066_0066_006C "ffl のリゲチャ +"
.C2 /L Lslash u0141 "(ポーランド語)"
.C2 /l lslash u0142 "(ポーランド語)"
.C2 /O Oslash u00D8 "(スカンジナビア語)"
.C2 /o oslash u00F8 "(スカンジナビア語)"
.C2 AE AE u00C6
.C2 ae ae u00E6
.C2 OE OE u0152
.C2 oe oe u0153
.C2 IJ IJ u0132 "(オランダ語)"
.C2 ij ij u0133 "(オランダ語)"
.C2 .i dotlessi u0131 "(トルコ語)"
.2e .j dotlessj --- "ドットなし j"
.
.Pa
.I アクセント付き文字
.P
.2s 'A Aacute u0041_0301
.C2 'C Cacute u0043_0301
.C2 'E Eacute u0045_0301
.C2 'I Iacute u0049_0301
.C2 'O Oacute u004F_0301
.C2 'U Uacute u0055_0301
.C2 'Y Yacute u0059_0301
.C2 'a aacute u0061_0301
.C2 'c cacute u0063_0301
.C2 'e eacute u0065_0301
.C2 'i iacute u0069_0301
.C2 'o oacute u006F_0301
.C2 'u uacute u0075_0301
.C2 'y yacute u0079_0301
.C2 :A Adieresis u0041_0308 "ウムラウト付き A"
.C2 :E Edieresis u0045_0308
.C2 :I Idieresis u0049_0308
.C2 :O Odieresis u004F_0308
.C2 :U Udieresis u0055_0308
.C2 :Y Ydieresis u0059_0308
.C2 :a adieresis u0061_0308
.C2 :e edieresis u0065_0308
.C2 :i idieresis u0069_0308
.C2 :o odieresis u006F_0308
.C2 :u udieresis u0075_0308
.C2 :y ydieresis u0079_0308
.C2 ^A Acircumflex u0041_0302
.C2 ^E Ecircumflex u0045_0302
.C2 ^I Icircumflex u0049_0302
.C2 ^O Ocircumflex u004F_0302
.C2 ^U Ucircumflex u0055_0302
.C2 ^a acircumflex u0061_0302
.C2 ^e ecircumflex u0065_0302
.C2 ^i icircumflex u0069_0302
.C2 ^o ocircumflex u006F_0302
.C2 ^u ucircumflex u0075_0302
.C2 `A Agrave u0041_0300
.C2 `E Egrave u0045_0300
.C2 `I Igrave u0049_0300
.C2 `O Ograve u004F_0300
.C2 `U Ugrave u0055_0300
.C2 `a agrave u0061_0300
.C2 `e egrave u0065_0300
.C2 `i igrave u0069_0300
.C2 `o ograve u006F_0300
.C2 `u ugrave u0075_0300
.C2 ~A Atilde u0041_0303
.C2 ~N Ntilde u004E_0303
.C2 ~O Otilde u004F_0303
.C2 ~a atilde u0061_0303
.C2 ~n ntilde u006E_0303
.C2 ~o otilde u006F_0303
.C2 vS Scaron u0053_030C
.C2 vs scaron u0073_030C
.C2 vZ Zcaron u005A_030C
.C2 vz zcaron u007A_030C
.C2 ,C Ccedilla u0043_0327
.C2 ,c ccedilla u0063_0327
.C2 oA Aring u0041_030A
.2e oa aring u0061_030A
.
.Pa
.I アクセント
.P
.B 合成
リクエストはアクセントの大部分を非スペースグリフ名にマップするために
使用されます。
括弧で与えられた値はオリジナル (スペース) の一つです。
.
.P
.Ac \(vc \(ah c
.Ac \('a \(aa a
.
.\" we don't use the third column
.CT "\fIOutput" "\f(CW\e[-D]" "" "quotesinglebase" "uCCCC (uCCCC)"
.He
.2s a" hungarumlaut "u030B (u02DD)" "(ハンガリー語)"
.C2 a- macron "u0304 (u00AF)"
.C2 a. dotaccent "u0307 (u02D9)"
.C2 a^ circumflex "u0302 (u005E)"
.C2 aa acute "u0301 (u00B4)" "+"
.C2 ga grave "u0300 (u0060)" "+"
.C2 ab breve "u0306 (u02D8)"
.C2 ac cedilla "u0327 (u00B8)"
.C2 ad dieresis "u0308 (u00A8)" "ウムラウト"
.C2 ah caron "u030C (u02C7)" "ハチェック h\('a\(vcek"
.C2 ao ring "u030A (u02DA)" "円"
.C2 a~ tilde "u0303 (u007E)"
.C2 ho ogonek "u0328 (u02DB)" "フック"
.C2 ha asciicircum u005E "(スペース)"
.2e ti asciitilde u007E "(スペース)"
.
.Pa
.I 引用符
.P
.2s Bq quotedblbase u201E "低い二重コンマ引用符"
.C2 bq quotesinglbase u201A "低い一重コンマ引用符"
.C2 lq quotedblleft u201C
.C2 rq quotedblright u201D
.C2 oq quoteleft u2018 "一重開き引用符"
.C2 cq quoteright u2019 "一重閉じ引用符"
.C2 aq quotesingle u0027 "アポストロフィ引用符 (ASCII 39)"
.C2 dq quotedbl u0022 "二重引用符 (ASCII 34)"
.C2 Fo guillemotleft u00AB
.C2 Fc guillemotright u00BB
.C2 fo guilsinglleft u2039
.2e fc guilsinglright u203A
.
.Pa
.I 句読点
.P
.2s r! exclamdown u00A1
.C2 r? questiondown u00BF
.C2 em emdash u2014 "+"
.C2 en endash u2013
.2e hy hyphen u2010 "+"
.
.Pa
.I 括弧
.P
拡張可能な括弧の断片はフォント不変のグリフです。
.
古典的な troff では、垂直拡張角括弧、大括弧、および丸括弧の
1 つのグリフが利用可能でした: `bv'。
.
我々は独断的にそれを u23AA にマップしています。
.
.P
すべてのデバイスがエスケープパイリング (重ね合わせ)
アルゴリズムの制限のため `\f(CW\eb\fP' で重ねることができる
拡張角括弧の断片を含まないことに注意してください。
.
断片から角括弧を構築する一般的な解は以下のマクロです:
.
.P
.nf
.RS
.ft C
\&.\e" 重ね合わせを上記の基準線の垂直 0.5em で
\&.\e" 中心とします。
\&.\e" 最初の引数は先端に置かれます。
\&.\e" 重ね合わせは文字列 `pile' を返します。
\&.eo
\&.de pile-make
\&.  nr pile-wd 0
\&.  nr pile-ht 0
\&.  ds pile-args
\&.
\&.  nr pile-# \en[.$]
\&.  while \en[pile-#] \e{\e
\&.    nr pile-wd (\en[pile-wd] >? \ew'\e$[\en[pile-#]]')
\&.    nr pile-ht +(\en[rst] - \en[rsb])
\&.    as pile-args \ev'\en[rsb]u'\e"
\&.    as pile-args \eZ'\e$[\en[pile-#]]'\e"
\&.    as pile-args \ev'-\en[rst]u'\e"
\&.    nr pile-# -1
\&.  \e}
\&.
\&.  ds pile \ev'(-0.5m + (\en[pile-ht]u / 2u))'\e"
\&.  as pile \e*[pile-args]\e"
\&.  as pile \ev'((\en[pile-ht]u / 2u) + 0.5m)'\e"
\&.  as pile \eh'\en[pile-wd]u'\e"
\&..
\&.ec
.ft
.RE
.fi
.
.P
別の複雑さは、オリジナルの troff で角括弧の断片を表すいくつかのグリフが
`フロア' 演算子を提供する、例えば、`lf' と `rf' という他の数学記号を
使うことができるという事実です。
.\" fact that = (that 以下)という事実
.
他のデバイス (最も顕著なものは DVI 出力) はそのようなグリフを一つにしません。
.
そういうわけで、4 つのグリフ `lf'、`rf'、`lc' および `rc' は、
同じように見える角括弧の断片で統一しません。
.\" For this reason = こういう訳で、そういうわけで、従って、その限りでは、だからこそ、このため
.BR groff
では、長い名前がグリフだけが、(それらのグリフが存在しているなら)
すべてのデバイスのために正しく重なり合うように保証されます。
.
.P
.CT "\fI出力" "\f(CW\e[bracketrightex]" "" "bracketrightex" "decomposed"
.He
.2s lB bracketleft u005B
.C2 rB bracketright u005D
.C2 lC braceleft u007B
.C2 rC braceright u007D
.C2 la angleleft u27E8 "左山括弧"
.C2 ra angleright u27E9 "右山括弧"
.
.C2 bv braceex u23AA "*** の垂直拡張 +"
.CN braceex braceex u23AA
.
.CN bracketlefttp bracketlefttp u23A1
.CN bracketleftbt bracketleftbt u23A3
.CN bracketleftex bracketleftex u23A2
.CN bracketrighttp bracketrighttp u23A4
.CN bracketrightbt bracketrightbt u23A6
.CN bracketrightex bracketrightex u23A5
.
.C2 lt bracelefttp u23A7 "+"
.CN bracelefttp bracelefttp u23A7
.C2 lk braceleftmid u23A8 "+"
.CN braceleftmid braceleftmid u23A8
.C2 lb braceleftbt u23A9 "+"
.CN braceleftbt braceleftbt u23A9
.CN braceleftex braceleftex u23AA
.C2 rt bracerighttp u23AB "+"
.CN bracerighttp bracerighttp u23AB
.C2 rk bracerightmid u23AC "+"
.CN bracerightmid bracerightmid u23AC
.C2 rb bracerightbt u23AD "+"
.CN bracerightbt bracerightbt u23AD
.CN bracerightex bracerightex u23AA
.
.CN parenlefttp parenlefttp u239B
.CN parenleftbt parenleftbt u239D
.CN parenleftex parenleftex u239C
.CN parenrighttp parenrighttp u239E
.CN parenrightbt parenrightbt u23A0
.Ne parenrightex parenrightex u239F
.
.Pa
.I 矢印
.P
.2s <- arrowleft u2190 "+"
.C2 -> arrowright u2192 "+"
.C2 <> arrowboth u2194 "(水平)"
.C2 da arrowdown u2193 "+"
.C2 ua arrowup u2191 "+"
.C2 va arrowupdn u2195
.C2 lA arrowdblleft u21D0
.C2 rA arrowdblright u21D2
.C2 hA arrowdblboth u21D4 "(水平)"
.C2 dA arrowdbldown u21D3
.C2 uA arrowdblup u21D1
.C2 vA uni21D5 u21D5 "垂直二重頭の二重矢印
.\" "vertical double-headed double arrow"
.2e an arrowhorizex u23AF "水平な矢印の延長"
.
.Pa
.I 線
.P
フォント不変のグリフ `br'、`ul' および `rn' は角 (コーナ) を形づくります。
それらは箱 (ボックス) を作るのに使用できます。
.
PostScript とこれらの 3 つのグリフの Unicode 派生名の両方は
ただおおまかに似たものであることに注意してください。
.\" rough approximation = おおまかに似たもの、概算、大ざっぱな数字
.
.P
また、`rn' は古典的な troff で平方根記号の水平な拡張としての役割があります。
.
.P
`ru' はフォント不変のグリフ、すなわち、長さ 0.5m の罫線です。
.
.P
.CT "出力" "\f(CW\e[integral]" "" "propersuperset" "xxxxxxxxx"
.He
.2s ba bar u007C
.C2 br SF110000 u2502 "箱型罫線 +"
.C2 ul underscore u005F "+"
.C2 rn overline u203E "平方根の継続には `\f(CW\e[radicalex]\fP' を使用 +"
.C2 ru --- --- "ベースラインの罫線 +"
.C2 bb brokenbar u00A6
.C2 sl slash u002F "+"
.2e rs backslash u005C "逆固相線"
.
.Pa
.I テキストマーカ
.P
.2s ci circle u25CB "+"
.C2 bu bullet u2022 "+"
.C2 dd daggerdbl u2021 "ダブルダガーサイン +"
.C2 dg dagger u2020 "+"
.C2 lz lozenge u25CA
.C2 sq uni25A1 u25A1 "白い方形 +"
.C2 ps paragraph u00B6
.C2 sc section u00A7 "+"
.C2 lh uni261C u261C "左手指し +"
.C2 rh a14 u261E "右手指し +"
.C2 at at u0040
.C2 sh numbersign u0023
.C2 CR carriagereturn u21B5
.2e OK a19 u2713 "チェックマーク、tick"
.
.Pa
.I 法律関連
.P
.2s co copyright u00A9 "+"
.C2 rg registered u00AE "+"
.C2 tm trademark u2122
.2e bs --- --- "AT&T ベル研究所ロゴ (groff では使用されない) +"
.
.Pa
.I 通貨記号
.P
.2s Do dollar u0024
.C2 ct cent u00A2 "+"
.C2 eu --- u20AC "公式なユーロ記号"
.C2 Eu Euro u20AC "フォント依存のユーログリフバリアント"
.C2 Ye yen u00A5
.C2 Po sterling u00A3 "英国の通貨記号"
.C2 Cs currency u00A4 "スカンジナビアの通貨記号"
.2e Fn florin u0192 "オランダの通貨記号"
.
.Pa
.I 単位
.P
.2s de degree u00B0 "+"
.C2 %0 perthousand u2030 "千単位記号、千年単位記号"
.C2 fm minute u2032 "フットマーク, プライム +"
.C2 sd second u2033
.C2 mc mu u00B5 "マイクロ記号"
.C2 Of ordfeminine u00AA
.2e Om ordmasculine u00BA
.
.Pa
.I 論理シンボル
.P
.2s AN logicaland u2227
.C2 OR logicalor u2228
.C2 no logicalnot u00AC "+"
.CN tno logicalnot u00AC "`no' のテキスト形"
.C2 te existential u2203 "存在する、存在限定子"
.C2 fa universal u2200 "すべての、普通限定子"
.C2 st suchthat u220B
.C2 3d therefore u2234
.C2 tf therefore u2234
.
.2e or bar u007C "(C で使われるような) ビット単位の OR 演算子 +"
.
.Pa
.I 数学シンボル
.P
.2s 12 onehalf u00BD "+"
.C2 14 onequarter u00BC "+"
.C2 34 threequarters u00BE "+"
.C2 18 oneeighth u215B
.C2 38 threeeighths u215C
.C2 58 fiveeighths u215D
.C2 78 seveneighths u215E
.C2 S1 onesuperior u00B9
.C2 S2 twosuperior u00B2
.C2 S3 threesuperior u00B3
.
.C2 pl plus u002B "特殊フォントの正符号 +"
.C2 mi minus u2212 "特殊フォントの負符号 +"
.C2 -+ uni2213 u2213
.C2 +- plusminus u00B1 "+"
.CN t+- plusminus u00B1 "`+\-' のテキスト形"
.C2 pc periodcentered u00B7
.C2 md dotmath u22C5 "乗算のドット"
.C2 mu multiply u00D7 "+"
.CN tmu multiply u00D7 "`mu' のテキスト形"
.C2 c* circlemultiply u2297 "円の中に積の記号"
.C2 c+ circleplus u2295 "円の中に正符号"
.C2 di divide u00F7 "除算記号 +"
.CN tdi divide u00F7 "`di' のテキスト形"
.C2 f/ fraction u2044 "分数の棒"
.C2 ** asteriskmath u2217 "+"
.
.C2 <= lessequal u2264 "+"
.C2 >= greaterequal u2265 "+"
.C2 << uni226A u226A "より小さい"
.C2 >> uni226B u226B "より大きい"
.C2 eq equal u003D "特殊フォントの等号 +"
.C2 != notequal u003D_0338 "+"
.C2 == equivalence u2261 "+"
.C2 ne uni2262 u2261_0338
.C2 =~ congruent u2245 "近似等号"
.C2 |= uni2243 u2243 "漸近等号 +"
.C2 ap similar u223C "+"
.C2 ~~ approxequal u2248 "ほぼ等号"
.C2 ~= approxequal u2248
.C2 pt proportional u221D "+"
.
.C2 es emptyset u2205 "+"
.C2 mo element u2208 "+"
.C2 nm notelement u2208_0338
.C2 sb propersubset u2282 "+"
.C2 nb notsubset u2282_0338
.C2 sp propersuperset u2283 "+"
.C2 nc uni2285 u2283_0338 "スーパーセットでない"
.C2 ib reflexsubset u2286 "+"
.C2 ip reflexsuperset u2287 "+"
.C2 ca intersection u2229 "共通集合, キャップ +"
.C2 cu union u222A "合併集合, カップ +"
.
.C2 /_ angle u2220
.C2 pp perpendicular u22A5
.C2 is integral u222B "+"
.CN integral integral u222B "***"
.CN sum summation u2211 "***"
.CN product product u220F "***"
.C2 gr gradient u2207 "+"
.C2 sr radical u221A "平方根 +"
.CN sqrt radical u221A "***"
.CN radicalex radicalex --- "平方根の継続"
.CN sqrtex radicalex --- "***"
.
.C2 lc uni2308 u2308 "左シーリング +"
.C2 rc uni2309 u2309 "右シーリング +"
.C2 lf uni230A u230A "左フロア +"
.C2 rf uni230B u230B "右フロア +"
.
.C2 if infinity u221E "+"
.C2 Ah aleph u2135
.C2 Im Ifraktur u2111 "ゴシック体 I, 虚数"
.C2 Re Rfraktur u211C "ゴシック体 R, 実数"
.C2 wp weierstrass u2118 "ワイエルシュトラスの p"
.C2 pd partialdiff u2202 "偏微分記号 +"
.\" partial differentiation = 偏微分
.C2 -h uni210F u210F "2 パイのプランク定数"
.\" Planck constant = プランク定数
.2e hbar uni210F u210F
.
.Pa
.I ギリシャ文字
.P
これらのグリフは技術的な使用のためであり、本当のギリシア語のために
意図されていません。
通常、大文字には直立形があり、そして小文字のものは傾斜しています。
.
Unicode への文字 phi のマッピングに関する問題があります。
.
Unicode バージョン\ 3.0 の前に、U+03C6、GREEK SMALL LETTER PHI と
U+03D5、GREEK PHI SYMBOL の違いは明確に説明されていません。
Unicode 本のグリフ形は参照として使用することしかできませんでした。
.
Unicode\ 3.0 から始まって、参照グリフは交換して、言葉で説明されました:
数学の文脈では、U+03D5 は撫で形グリフで、U+03C5 はちじれグリフです。
.
残念ながら、ほとんどのフォント業者は
Unicode におけるこの (非互換) の変更で
それらのフォントを更新しませんでした。
.
これを書いた (2003 年 2 月) 時点で、
数学で使用されるなら Adobe Glyph Names `phi' と `phi1'
が意味を変更するかどうかはまだ明確ではありません。
したがって、互換性の問題は起こりそうです \(en
保守的ですが、groff は、現在 PostScript シンボルフォントの `phi' が
撫で形バージョンであると仮定しています
.P
groff では、シンボル `\f(CW\e[*f]\fP' は常に phi の撫で形バージョンを意味して、
`\f(CW\e[+f]\fP' はちじれ異形を意味します。
.P
.2s *A Alpha u0391 "+"
.C2 *B Beta u0392 "+"
.C2 *G Gamma u0393 "+"
.C2 *D Delta u0394 "+"
.C2 *E Epsilon u0395 "+"
.C2 *Z Zeta u0396 "+"
.C2 *Y Eta u0397 "+"
.C2 *H Theta u0398 "+"
.C2 *I Iota u0399 "+"
.C2 *K Kappa u039A "+"
.C2 *L Lambda u039B "+"
.C2 *M Mu u039C "+"
.C2 *N Nu u039D "+"
.C2 *C Xi u039E "+"
.C2 *O Omicron u039F "+"
.C2 *P Pi u03A0 "+"
.C2 *R Rho u03A1 "+"
.C2 *S Sigma u03A3 "+"
.C2 *T Tau u03A4 "+"
.C2 *U Upsilon u03A5 "+"
.C2 *F Phi u03A6 "+"
.C2 *X Chi u03A7 "+"
.C2 *Q Psi u03A8 "+"
.C2 *W Omega u03A9 "+"
.C2 *a alpha u03B1 "+"
.C2 *b beta u03B2 "+"
.C2 *g gamma u03B3 "+"
.C2 *d delta u03B4 "+"
.C2 *e epsilon u03B5 "+"
.C2 *z zeta u03B6 "+"
.C2 *y eta u03B7 "+"
.C2 *h theta u03B8 "+"
.C2 *i iota u03B9 "+"
.C2 *k kappa u03BA "+"
.C2 *l lambda u03BB "+"
.C2 *m mu u03BC "+"
.C2 *n nu u03BD "+"
.C2 *c xi u03BE "+"
.C2 *o omicron u03BF "+"
.C2 *p pi u03C0 "+"
.C2 *r rho u03C1 "+"
.C2 ts sigma1 u03C2 "終端シグマ (sigma) +"
.C2 *s sigma u03C3 "+"
.C2 *t tau u03C4 "+"
.C2 *u upsilon u03C5 "+"
.C2 *f phi u03D5 "(撫で形のグリフ) +"
.C2 *x chi u03C7 "+"
.C2 *q psi u03C8 "+"
.C2 *w omega u03C9 "+"
.C2 +h theta1 u03D1 "異形シータ (theta)"
.C2 +f phi1 u03C6 "異形 phi (ちじれ形)"
.C2 +p omega1 u03D6 "異形パイ (pi), オメガ (omega) 似"
.2e +e uni03F5 u03F5 "異形 epsilon"
.
.Pa
.I カードシンボル
.P
.2s CL club u2663 "黒のクラブ"
.C2 SP spade u2660 "黒のスペード"
.C2 HE heart u2665 "黒のハート "
.C2 u2662 uni2662 u2662 "白のハート"
.C2 DI diamond u2666 "黒のダイアモンド"
.2e u2661 uni2661 u2661 "白のダイアモンド"
.
.
.\" --------------------------------------------------------------------
.SH "作者"
.\" --------------------------------------------------------------------
.
Copyright \(co 1989-2000, 2001, 2002, 2003 Free Software Foundation, Inc.
.
.P
この文書は、FDL (GNU Free Documentation License) バージョン 1.1 か
それ以降のものに基づいて配布されています。
.
あなたは、このパッケージとともに FDL のコピーを受け取っているはずですが、
これは
.ie \n(.g \
.  URL http://\:www.gnu.org/\:copyleft/\:fdl.html "GNU のコピーレフトのサイト"
.el GNU のコピーレフトのサイト <http://www.gnu.org/copyleft/fdl.html>
からもオンラインで入手可能です。
.
.P
この文書は GNU の roff ディストリビューションである
.IR groff
の一部です。
.
この文書は
.ie \n(.g \
.  MTO jjc@jclark.com "James Clark"
.el James Clark <jjc@jclark.com>
が書き、
.ie \n(.g \
.  MTO wl@gnu.org  "Werner Lemberg"
.el Werner Lemberg <wl@gnu.org>
と
.ie \n(.g \
.  MTO bwarken@mayn.de "Bernd Warken" .
.el Bernd Warken <bwarken@mayn.de>.
が追加しました。
.
.
.\" --------------------------------------------------------------------
.SH "関連項目"
.\" --------------------------------------------------------------------
.
.TP
.BR groff (1)
GNU roff フォーマッタ。
.
.TP
.BR groff (7)
groff 清書言語の短かい参考書。
.
.
.P
.IR "An extension to the troff character set for Europe" ,
E.G. Keizer, K.J. Simonsen, J. Akkerhuis; EUUG Newsletter, Volume 9,
No. 2, Summer 1989
.
.
.P
.ie \n(.g .URL http://\:www.unicode.org "The Unicode Standard"
.el The Unicode Standard <http://www.unicode.org>
.
.\" --------------------------------------------------------------------
.\" Emacs settings
.\" --------------------------------------------------------------------
.\" Local Variables:
.\" mode: nroff
.\" End:
