freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_char.7
.\" $FreeBSD$
.ig \"-*- nroff -*-
Copyright (C) 1989-2000 Free Software Foundation, Inc.

Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.

Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.
..
.\" $FreeBSD: doc/ja_JP.eucJP/man/man7/groff_char.7,v 1.6 2001/04/30 03:48:36 horikawa Exp $
.\" 
.\" groff_char.7 の表記を尊重しました。
.\" JIS X 0212 の附属書 3 表 3「0208とJISX0221との対応表」を、
.\" 文字の名前の参考としてではなく、英単語と日本語の単語の対応の
.\" 参考としました。
.\" Kazuo Horikawa <horikawa@jp.FreBSD.org> 1998/12/06
.\"
.\" For best results, print this with groff.
.ds aq \(aq
.ie !\n(.g .if '\(aq'' .ds aq \'
.el \{\
.	tr \(aq\(aq
.	if !c\(aq .ds aq \'
.\}
.if !\n(.g .ig
.\" .Ac accented-char accent char
.de Ac
.char \\$1 \\$3\
\k[acc]\ \h'(u;-\w'\\$2'-\w'\\$3'/2+\\\\n[skw]+(\w'x'*0)-\\\\n[skw])'\
\v'(u;\w'x'*0+\\\\n[rst]+(\w'\\$3'*0)-\\\\n[rst])'\ \\$2\
\v'(u;\w'x'*0-\\\\n[rst]+(\w'\\$3'*0)+\\\\n[rst])'\ \h'|\\\\n[acc]u'
.hcode \\$1\\$3
..
.Ac \(vc \(ah c
.Ac \(vC \(ah C
.TH GROFF_CHAR 7 "26 April 2001" "Groff Version 1.17"
.SH 名称
groff_char \- groff の文字名
.SH 解説
このマニュアルページは標準的な
.B groff
への入力文字を列挙しています。
このマニュアルページを印刷 (表示) するのに用いられるデバイスで
利用可能な文字のみが表示されます
.ie \n(.g (現在使用されているデバイスは `\*(.T' です)
。
.I "Input code"
欄は単一の文字で入力することのできる文字において用いられ、
その文字の ISO Latin-1 コードが書かれています。
.I "PostScript name\"
欄には出力文字の一般的な PostScript 名が示されます。
.LP
ISO Latin-1 のブレイク無しスペース (8 進数で 0240) は
.BR \e (スペース)
と等価です。
他の ISO Latin-1 の文字はすべて、次の例外を除いてそのまま表示されます:
.B \`
は ` 
として表示され、
.B \*(aq
は ' 
として表示されます。対応する ISO Latin-1 文字は
.B \e` 
と
.BR \e(aq 
で得られます。
ISO Latin-1 の `ハイフン、負符号' (コード 45) はハイフンとして
表示されます;
負符号は
.BR \e- 
で得られます。
ISO Latin-1 の `チルド' (コード 126) は ~ として表示されます;
より大きいグリフは
.BR \e(ti 
で得られます。
ISO Latin-1 の `サーカムフレクスアクセント' (コード 94) 
は ^ として表示されます;
より大きいグリフは
.BR \e(ha 
で得られます。
.sp
'nf
.nr Sp 3n
.ta \w'\fIOutput'u+\n(Spu +\w'\fIInput'u+\n(Spu +\w'\fIInput'u+\n(Spu \
+\w'periodcentered'u+\n(Spu
.de C0
.C \\$1 "" \\$1 \\$2 "\\$3"
..
.de C1
.C \e\\$1 "" \\\\\\$1 \\$2 "\\$3"
..
.de C2
.C \e(\\$1 "" \\(\\$1 \\$2 "\\$3"
..
.if !\n(.g .ig
.de CD
.C \[char\\$1] \\$1 \[char\\$1] \\$2 "\\$3"
..
.do fspecial CR R
.\" input-name decimal-code output-name ps-name description
.if !\n(.g .ig
.de C
.if c\\$3 \{\
.ft CR
.tr `\`'\*(aq
.in 0
.di CH
\&\\$1
.br
.di
.in
.ft
.ds CH \\*(CH\
.tr ``''
\&\\$3\t\\*(CH\t\\$2\t\\$4\t\\$5
.\}
..
.if \n(.g .ig
.de C
.if !'\\$3'' \{\
.ft B
.tr `\`'\*(aq
.in 0
.di CH
\&\\$1
.br
.di
.in
.ft
.ds CH \\*(CH\
.tr ``''
\&\\$3\t\\*(CH\t\\$2\t\\$4\t\\$5
.\}
..
.if !\n[cR] .wh \n(nlu+\n(.tu-\n(.Vu Fo
.de Fo
'bp
.He
..
.de He
.ft I
Output	Input	Input	PostScript	Notes
	name	code	name
.ft
.LP
'nf
..
.He
.CD 33 exclam
.CD 34 quotedbl
.CD 35 numbersign
.CD 36 dollar
.CD 37 percent
.CD 38 ampersand
.CD 39 quoteright
.CD 40 parenleft
.CD 41 parenright
.CD 42 asterisk
.CD 43 plus
.CD 44 comma
.CD 45 hyphen
.CD 46 period
.CD 47 slash
.CD 58 colon
.CD 59 semicolon
.CD 60 less
.CD 61 equal
.CD 62 greater
.CD 63 question
.CD 64 at
.CD 91 bracketleft
.CD 92 backslash
.CD 93 bracketright
.CD 94 circumflex "サーカムフレクスアクセント"
.CD 95 underscore
.CD 96 quoteleft
.CD 123 braceleft
.CD 124 bar
.CD 125 braceright
.CD 126 tilde "チルドアクセント"
.CD 161 exclamdown
.CD 162 cent
.CD 163 sterling
.CD 164 currency
.CD 165 yen
.CD 166 brokenbar
.CD 167 section
.CD 168 dieresis
.CD 169 copyright
.CD 170 ordfeminine
.CD 171 guillemotleft
.CD 172 logicalnot
.CD 173 hyphen
.CD 174 registered
.CD 175 macron
.CD 176 degree
.CD 177 plusminus
.CD 178 twosuperior
.CD 179 threesuperior
.CD 180 acute "アキュートアクセント"
.CD 181 mu
.CD 182 paragraph
.CD 183 periodcentered
.CD 184 cedilla
.CD 185 onesuperior
.CD 186 ordmasculine
.CD 187 guillemotright
.CD 188 onequarter
.CD 189 onehalf
.CD 190 threequarters
.CD 191 questiondown
.CD 192 Agrave
.CD 193 Aacute
.CD 194 Acircumflex
.CD 195 Atilde
.CD 196 Adieresis
.CD 197 Aring
.CD 198 AE
.CD 199 Ccedilla
.CD 200 Egrave
.CD 201 Eacute
.CD 202 Ecircumflex
.CD 203 Edieresis
.CD 204 Igrave
.CD 205 Iacute
.CD 206 Icircumflex
.CD 207 Idieresis
.CD 208 Eth
.CD 209 Ntilde
.CD 210 Ograve
.CD 211 Oacute
.CD 212 Ocircumflex
.CD 213 Otilde
.CD 214 Odieresis
.CD 215 multiply
.CD 216 Oslash
.CD 217 Ugrave
.CD 218 Uacute
.CD 219 Ucircumflex
.CD 220 Udieresis
.CD 221 Yacute
.CD 222 Thorn
.CD 223 germandbls
.CD 224 agrave
.CD 225 aacute
.CD 226 acircumflex
.CD 227 atilde
.CD 228 adieresis
.CD 229 aring
.CD 230 ae
.CD 231 ccedilla
.CD 232 egrave
.CD 233 eacute
.CD 234 ecircumflex
.CD 235 edieresis
.CD 236 igrave
.CD 237 iacute
.CD 238 icircumflex
.CD 239 idieresis
.CD 240 eth
.CD 241 ntilde
.CD 242 ograve
.CD 243 oacute
.CD 244 ocircumflex
.CD 245 otilde
.CD 246 odieresis
.CD 247 divide
.CD 248 oslash
.CD 249 ugrave
.CD 250 uacute
.CD 251 ucircumflex
.CD 252 udieresis
.CD 253 yacute
.CD 254 thorn
.CD 255 ydieresis
.C2 -D Eth "アイスランド語の大文字 eth"
.C2 Sd eth "アイスランド語の小文字 eth"
.C2 TP Thorn "アイスランド語の大文字 thorn"
.C2 Tp thorn "アイスランド語の小文字 thorn"
.C2 AE AE
.C2 ae ae
.C2 OE OE
.C2 oe oe
.C2 IJ IJ "オランダ語の IJ リゲチャ"
.C2 ij ij "オランダ語の ij リゲチャ"
.C2 ss germandbls
.C2 'A Aacute
.C2 'C Cacute
.C2 'E Eacute
.C2 'I Iacute
.C2 'O Oacute
.C2 'U Uacute
.C2 'Y Yacute
.C2 'a aacute
.C2 'c cacute
.C2 'e eacute
.C2 'i iacute
.C2 'o oacute
.C2 'u uacute
.C2 'y yacute
.C2 :A Adieresis
.C2 :E Edieresis
.C2 :I Idieresis
.C2 :O Odieresis
.C2 :U Udieresis
.C2 :Y Ydieresis
.C2 :a adieresis
.C2 :e edieresis
.C2 :i idieresis
.C2 :o odieresis
.C2 :u udieresis
.C2 :y ydieresis
.C2 ^A Acircumflex
.C2 ^E Ecircumflex
.C2 ^I Icircumflex
.C2 ^O Ocircumflex
.C2 ^U Ucircumflex
.C2 ^a acircumflex
.C2 ^e ecircumflex
.C2 ^i icircumflex
.C2 ^o ocircumflex
.C2 ^u ucircumflex
.C2 `A Agrave
.C2 `E Egrave
.C2 `I Igrave
.C2 `O Ograve
.C2 `U Ugrave
.C2 `a agrave
.C2 `e egrave
.C2 `i igrave
.C2 `o ograve
.C2 `u ugrave
.C2 ~A Atilde
.C2 ~N Ntilde
.C2 ~O Otilde
.C2 ~a atilde
.C2 ~n ntilde
.C2 ~o otilde
.C2 vS Scaron
.C2 vs scaron
.C2 vZ Zcaron
.C2 vz zcaron
.C2 ,C Ccedilla
.C2 ,c ccedilla
.C2 /L Lslash "ポーランド語のスラッシュ付き L"
.C2 /l lslash "ポーランド語のスラッシュ付き l"
.C2 /O Oslash
.C2 /o oslash
.C2 oA Aring
.C2 oa aring
.C2 a" hungarumlaut "ハンガリー語のウムラウト"
.C2 a- macron "マクロン、バーアクセント"
.C2 a. dotaccent "ドットアクセント"
.C2 a^ circumflex "サーカムフレクスアクセント"
.C2 aa acute "アキュートアクセント"
.C2 ga grave "グレーブアクセント"
.C2 ab breve "ブリーブアクセント"
.C2 ac cedilla "セディラアクセント"
.C2 ad dieresis "ウムラウト、ダイエレシス"
.C2 ah caron "h\('a\(vcek アクセント"
.C2 ao ring "リングもしくはサークルアクセント"
.C2 a~ tilde "チルドアクセント"
.C2 ho ogonek "フックもしくはオゴネクアクセント"
.C2 .i dotlessi "点のない i"
.C2 .j dotlessj "点のない j"
.C2 Cs currency "スカンジナビアの通貨記号"
.C2 Do dollar
.C2 Po sterling
.C2 Ye yen
.C2 Fn florin
.C2 ct cent
.C2 Fo guillemotleft
.C2 Fc guillemotright
.C2 fo guilsinglleft
.C2 fc guilsinglright
.C2 r! exclamdown
.C2 r? questiondown
.C2 ff ff "ff のリゲチャ"
.C2 fi fi "fi のリゲチャ"
.C2 fl fl "fl のリゲチャ"
.C2 Fi ffi "ffi のリゲチャ"
.C2 Fl ffl "ffl のリゲチャ"
.C2 OK \& "チェックマーク、照合のしるし"
.C2 Of ordfeminine
.C2 Om ordmasculine
.C2 pc periodcentered
.C2 S1 onesuperior
.C2 S2 twosuperior
.C2 S3 threesuperior
.C2 <- arrowleft
.C2 -> arrowright
.C2 <> arrowboth "左右向き矢印"
.C2 da arrowdown
.C2 ua arrowup
.C2 va \& "上下向き矢印"
.C2 lA arrowdblleft
.C2 rA arrowdblright
.C2 hA arrowdblboth "左右向き二重矢印"
.C2 dA arrowdbldown
.C2 uA arrowdblup
.C2 vA \& "上下向き二重矢印"
.C2 ba bar
.C2 bb brokenbar
.C2 br br "従来の troff で利用された箱罫線"
.C2 ru ru "ベースラインの罫線"
.C2 ul ul "従来の troff で利用された下線"
.C2 bv bv "縦棒"
.C2 bs bell
.C2 ci circle
.C2 bu bullet
.C2 co copyright
.C2 rg registered
.C2 tm trademark
.C2 dd daggerdbl "ダブルダガーサイン"
.C2 dg dagger
.C2 ps paragraph
.C2 sc section
.C2 de degree
.C2 em emdash "全角 (M の幅の) ダッシュ"
.C2 en endash "半角 (n の幅の) ダッシュ"
.C2 %0 perthousand "千分の一記号、パーミル"
.C2 12 onehalf
.C2 14 onequarter
.C2 34 threequarters
.C2 f/ fraction "除算の棒"
.C2 fm minute "フィート記号、プライム"
.C2 sd second
.C2 ha asciicircum "\s-2ASCII\s+2 サーカムフレクス、ハット、キャレット"
.C2 ti asciitilde "\s-2ASCII\s0 チルド、大きいチルド"
.C2 hy hyphen
.C2 lB bracketleft
.C2 rB bracketright
.C2 lC braceleft
.C2 rC braceright
.C2 la angleleft "始め山括弧"
.C2 ra angleright "終り山括弧"
.C2 lh handleft
.C2 rh handright
.C2 Bq quotedblbase "低い二重コンマ引用符"
.C2 bq quotesinglbase "低い一重コンマ引用符"
.C2 lq quotedblleft
.C2 rq quotedblright
.C2 oq quoteleft "一重開き引用符"
.C2 cq quoteright "一重閉じ引用符 (ASCII 39)"
.C2 aq quotesingle "アポストロフィ引用符"
.C2 dq quotedbl "二重引用符 (ASCII 34)"
.C2 or bar
.C2 at at
.C1 - minus "現在のフォントの負符号"
.C2 sh numbersign
.C2 sl slash
.C2 rs backslash
.C2 sq square
.C2 3d therefore
.C2 tf therefore
.C2 *A Alpha
.C2 *B Beta
.C2 *C Xi
.C2 *D Delta
.C2 *E Epsilon
.C2 *F Phi
.C2 *G Gamma
.C2 *H Theta
.C2 *I Iota
.C2 *K Kappa
.C2 *L Lambda
.C2 *M Mu
.C2 *N Nu
.C2 *O Omicron
.C2 *P Pi
.C2 *Q Psi
.C2 *R Rho
.C2 *S Sigma
.C2 *T Tau
.C2 *U Upsilon
.C2 *W Omega
.C2 *X Chi
.C2 *Y Eta
.C2 *Z Zeta
.C2 *a alpha
.C2 *b beta
.C2 *c xi
.C2 *d delta
.C2 *e epsilon
.C2 *f phi
.C2 +f phi1 "ファイ変形"
.C2 *g gamma
.C2 *h theta
.C2 +h theta1 "シータ変形"
.C2 *i iota
.C2 *k kappa
.C2 *l lambda
.C2 *m mu
.C2 *n nu
.C2 *o omicron
.C2 *p pi
.C2 +p omega1 "パイ変形、オメガ風"
.C2 *q psi
.C2 *r rho
.C2 *s sigma
.C2 *t tau
.C2 *u upsilon
.C2 *w omega
.C2 *x chi
.C2 *y eta
.C2 *z zeta
.C2 ts sigma1 "語尾小文字σ"
.C2 ~~ approxequal
.C2 ~= approxequal
.C2 != notequal
.C2 ** asteriskmath
.C2 -+ minusplus
.C2 +- plusminus
.C2 <= lessequal
.C2 == equivalence
.C2 =~ congruent
.C2 >= greaterequal
.C2 AN logicaland
.C2 OR logicalor
.C2 no logicalnot
.C2 te existential "存在する、存在限定子"
.C2 fa universal "すべての、普通限定子"
.C2 Ah aleph
.C2 Im Ifraktur "フラクトゥール(ドイツ字体) I, 虚数"
.C2 Re Rfraktur "フラクトゥール(ドイツ字体) R, 実数"
.C2 if infinity
.C2 md dotmath
.C2 mo element
.C2 mu multiply
.C2 nb notsubset
.C2 nc notpropersuperset
.C2 ne notequivalence
.C2 nm notelement
.C2 pl plusmath "特殊フォントの正符号"
.C2 eq equalmath "特殊フォントの等号"
.C2 pt proportional
.C2 pp perpendicular
.C2 sb propersubset
.C2 sp propersuperset
.C2 ib reflexsubset
.C2 ip reflexsuperset
.C2 ap similar
.C2 is integral
.C2 sr radical "square root"
.C2 rn \& overline
.C2 pd partialdiff "偏微分記号"
.C2 c* circlemultiply "円の中に積の記号"
.C2 c+ circleplus "円の中に正符号"
.C2 ca intersection "共通集合、キャップ"
.C2 cu union "合併集合、カップ"
.C2 di divide "除算記号"
.C2 -h hbar
.C2 gr gradient
.C2 es emptyset
.C2 CL club "クラブスート"
.C2 SP spade "スペードスート"
.C2 HE heart "ハートスート"
.C2 DI diamond "ダイヤスート"
.C2 CR carriagereturn "改行の記号"
.C2 st suchthat
.C2 /_ angle
.C2 << \& "非常に小さい"
.C2 >> \& "非常に大きい"
.C2 wp weierstrass "ヴァイヤーシュトラースの p"
.C2 lz lozenge
.C2 an arrowhorizex "水平な矢印の延長"
.ch Fo
.SH "関連項目"
.BR groff (1)
.br
.IR "An extension to the troff character set for Europe" ,
E.G. Keizer, K.J. Simonsen, J. Akkerhuis,
EUUG Newsletter, Volume 9, No. 2, Summer 1989
