freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_man.7
.ig
Copyright (C) 1999-2000, 2001, 2002, 2003 Free Software Foundation, Inc.

Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.

Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.
..
.
.\" $FreeBSD$
.\" WORD: hanging indentation    ぶら下げインデント
.\" WORD: designator             指示子
.de TQ
.  br
.  ns
.  TP \\$1
..
.
.
.TH GROFF_MAN 7 "1 May 2003" "Groff Version 1.19"
.
.
.\" -----------------------------------------------------------------
.
.SH 名称
.
groff_man \- マニュアルページ生成サポート用 groff `man' マクロ
.
.
.\" -----------------------------------------------------------------
.
.SH 書式
.
.B groff
.B \-man
[
.IR options .\|.\|.\&
]
[
.IR files .\|.\|.\&
]
.br
.B groff
.B \-m\ man
[
.IR options .\|.\|.\&
]
[
.IR files .\|.\|.\&
]
.
.
.\" -----------------------------------------------------------------
.
.SH 解説
.
.I groff
でマニュアルページを生成するのに使用される
.B man
マクロは、James Clark が書きました。
このドキュメントは、パッケージ中の各マクロの使い方を、短くまとめたものです。
.
.
.\" -----------------------------------------------------------------
.
.SH オプション
.
.B man
マクロは、次のようなコマンドラインオプションを理解します
(レジスタをいくつか定義します)。
.
.TP
.B \-rcR=1
本オプション (nroff モードではデフォルト) は、
複数ページの代りに、長い単一ページを出力します。
無効にするには、
.B \-rcR=0
としてください。
.
.TP
.B \-rC1
コマンドラインに複数のマニュアルページを与えた場合、
それぞれのページ番号が\ 1 から始まるのではなく、連続した番号に
なります。
.
.TP
.B \-rD1
両面印字にします。
偶数ページと奇数ページのフッタは、異なった整形が成されます。
.
.TP
.BI \-rFT= dist
フッタ位置を設定します。
負数の場合、ボトムからの相対位置であり、正数の場合、トップからの相対位置です。
デフォルトは -0.5i です。
.
.TP
.BI \-rHY= flags
ハイフネーションフラグを設定します。
.
設定可能な値は、1 が制限無しのハイフネーション、
2 がページの最後の語をハイフネーションしない、
4 が語の最後の 2 文字をハイフネーションしない、
8 が語の最初の 2 文字をハイフネーションしないです。
.
値は加算可能です。
デフォルトは 14 です。
.
.TP
.BI \-rIN= width
本文のインデントを
.IR width
に設定します。
デフォルトは、
.IR nroff
では 7n であり
.IR troff
では 7.2n です。
.IR nroff
では、一貫性のあるインデントを得るために、
この値は `n' の整数倍であることが必要です。
.
.TP
.BI \-rLL= line-length
行の長さを設定します。
このオプションを設定しないと、行の長さは、
nroff モードではデフォルトの 78n に、
troff モードではデフォルトの 7.5i になります。
.
.TP
.BI \-rLT= title-length
タイトルの長さを設定します。
このオプションを設定しないと、タイトルの長さは、
nroff モードではデフォルトの 78n に、
troff モードではデフォルトの 7.5i になります。
.
.TP
.BI \-rP nnn
ページの数え始めを\ 1 ではなく
.I nnn
からにします。
.
.TP
.BI \-rS xx
ベースドキュメントフォントサイズを
10\ ポイントではなく
.I xx
ポイントにします
.RI ( xx
には 10, 11, 12 のいずれかが使用できます)。
.
.
.TP
.BI \-rSN= width
副副見出しのインデントを
.IR width
に設定します。
デフォルトは 3n です。
.
.TP
.BI \-rX nnn
ページ\ \c
.IR nnn
の後のページを
.IR nnn a,
.IR nnn b,
.IR nnn c
などというように数えます。例えば、`\-rX2' というオプションの場合、
ページを 1, 2, 2a, 2b, 2c というように割り振ります。
.
.
.\" -----------------------------------------------------------------
.
.SH 使用法
.
このセクションは、マニュアルページ用に使用可能なマクロについて
述べています。さらにカスタマイズしたい場合は、
.B man.local
ファイル中に追加のマクロおよびリクエストを置いてください。
このファイルは
.B man
の直後にロードされます。
.
.TP
.BI .TH " title section " [ extra1 "] [" extra2 "] [" extra3 ]
このマニュアルページのタイトルを
.I title
に、セクションを
.IR section
に設定します。セクションは、
1 から\ 8 までの値をとらなくてはなりません。
.I section
値には、後ろに文字列を置くこともできます。例えば、
`.pm' とすると、マニュアルページの特定のサブセクションを
示します。
.I title
と
.I section
は、ともにヘッダ行の左端と右端に置かれます
(括弧でくくられた
.I section
が
.IR title
の直後に付きます)。
.I extra1
は、フッタ行の中央に置かれます。
.I extra2
は、フッタ行の左に置かれます
(両面印字がアクティブになっている場合、偶数ページには
左に、奇数ページには右に、置かれます)。
.I extra3
はヘッダ行の中央に置かれます。
.
.IP
HTML 出力用には、ヘッダおよびフッタは完全に取り除かれます。
.
.IP
さらに、このマクロは改ページします。新しい行番号は、再度\ 1 に
なります (コマンドラインで `-rC1' オプションが指定されている場合を
除きます)。この機能は、複数のマニュアルページを整形する
場合のためだけにあります。マニュアルページが 1 つの場合、
.B TH
は、ファイルの先頭において、まさに 1 つだけ存在すべきです。
.
.TP
.BI ".SH [" "text for a heading" ]
番号づけをしないセクション用の見出しを設定します。
これは左詰めになります。
.B SH
に続いたテキスト (
.BR SH
に引数がない場合は次の入力行のテキスト) は、
行末までのものがすべてボールド体 (もしくは文字列
.BR HF
で指定されたフォント) で、
そしてベースドキュメントサイズよりも 1 だけ大きなフォントサイズで
表示されます。
さらに、テキストの左側の余白およびインデントは
デフォルト値に戻されます。
.
.TP
.BI ".SS [" "text for a heading" ]
番号づけしないセクションの 2 番目の見出しを設定します。
.B SS
に続いたテキスト (
.BR SS
に引数がない場合は次の入力行のテキスト) は、
行末までのものがすべてボールド体 (もしくは文字列
.BR HF
で指定されたフォント) で、
そしてベースドキュメントサイズと同じ大きさのフォントで表示されます。
さらに、テキストの左側の余白はデフォルト値に戻されます。
.TP
.BI ".TP [" nnn ]
インデントされた、ラベルつきの段落を設定します。
インデント幅は、引数が与えられていれば
.I nnn
に設定されます (省略されていれば、デフォルトの単位は `n' です)。
そうでない場合、
.BR TP ,
.BR IP ,
.B HP
で指定された以前のインデント
(これらのいずれもが未使用の場合はデフォルト値) に設定します。
.
.IP
このマクロの後に続いた入力テキストの 1 行目は、
左詰めに表示する文字列として解釈され、
ラベルとして使用するのに適切なものとなります。
これは段落の一部であるとは解釈はされませんので、
引き続く入力行のテキストで 1 行目を満たそうとはしません。
それでも、ラベルがインデント幅ほど広がっていない場合には、
同じ行から段落が始まり (ただし、インデントはされます)、次の
行へと続いていきます。
ラベルがインデント幅よりも広い場合は、段落の説明部分は
ラベルの次の行から始まり、すべてインデントされます。
ラベルのフォントの形もサイズもデフォルト値には設定されない
ことに注意してください。これに対して、残りのテキストは
デフォルトのフォント設定になります。
.
.IP
.B TP
マクロは、あなたが今ちょうど読んでいるこの解説に使用されている
マクロです。
.
.TP
.B .LP
.TQ
.B .PP
.TQ
.B .P
これらのマクロは、共通の別名です。
これらのうちのどれを使用しても現在の位置で行を打ち切ります。
そして、その後に
.B PD
マクロで指定した量だけ垂直方向にスペースを置きます。
フォントのサイズおよび形はデフォルト値に戻されます
(10pt ローマン体)。
最後に、現在の左側の余白の量とインデントを復元します。
.
.TP
.BI ".IP [" designator "] [" nnn ]
インデントされた段落を設定します。その際、
.I designator
を段落の始まりに印をつけるためのタグとして使用します。
インデント幅は、引数が与えられている場合は
.I nnn
に設定されます (省略されていれば、デフォルトの単位は `n' です)。
そうでない場合、
.BR TP ,
.BR IP ,
.B HP
で指定された以前のインデント
(これらのいずれもが未使用の場合はデフォルト値) に設定します。
この段落 (ただし、指示子 (designator) を含まず) の
フォントサイズおよびフェースはデフォルト値に戻されます。
.
.IP
特定のインデントをするが指示子をつけない段落を開始するには、
第 2 引数に `""' (ダブルクォート 2 つ) を使用してください。
.IP
例えば次の段落は、`.IP\ \\(bu\ 4' を用いて、すべて
指示子として中点をつけて設定されます。
ブロック全体が `.RS' と `.RE' で括られており、
左余白を一時的に現在のインデント値に設定します。
.
.RS
.IP \(bu 4
.B IP
は、リストを整形するために
.B man
で使用される 3 つのマクロのうちの 1 つです。
.IP \(bu 4
.B HP
は、また別のマクロです。
このマクロは、左側にぶら下げインデントされた段落を生成します。
.IP \(bu 4
.B TP
は、また別のマクロです。
このマクロは、インデントされないラベルを生成し、その後に
インデントされた段落が続きます。
.RE
.
.TP
.BI ".HP [" nnn ]
左側にぶら下げインデントされた段落を設定します。
引数が与えられている場合、インデント幅は
.I nnn
に設定されます (省略されていれば、デフォルトの単位は `n' です)。
そうでない場合、
.BR TP ,
.BR IP ,
.B HP
で指定された以前のインデント
(これらのいずれもが未使用の場合はデフォルト値) に設定します。
引数が与えられていない場合、デフォルトのインデント幅が
使用されます。
フォントサイズおよびフェースはデフォルト値に戻されます。
次の段落は、インデント幅を\ 4 に設定されているときの
このマクロの効果を示したものです。
ブロック全体が `.RS' と `.RE' で括られており、
左余白を一時的に現在のインデント値に設定します。
.
.RS
.HP 4
この段落は、
.B HP
マクロを実行したあとの段落です。
見ての通り、このマクロは、最初の行を除いた行すべてが
インデントされた段落を生成しています。
.RE
.
.TP
.BI ".RS [" nnn ]
このマクロは、値が与えられていれば (デフォルト単位は `n' です)
その値だけ左側の余白を右に移動します。
そうでない場合、
.BR TP ,
.BR IP ,
.B HP
で指定された以前のインデント
(これらのいずれもが未使用の場合はデフォルト値) に設定します。
その後、インデント値は、デフォルトへ設定されます。
.IP
.B RS
マクロの呼び出しは入れ子にできます。
.
.TP
.BI ".RE [" nnn ]
このマクロは、左側の余白を
.IR nnn
レベルまで戻し、直前の左側の余白を回復します。
引数が与えられていなければ、
このマクロはレベルを 1 つだけ戻します。
第 1 レベル (すなわち、まだ
.B RS
を呼び出していない) は番号 1 を持っており、
.B RS
マクロを呼び出すごとにレベルが 1 ずつ増加します。
.
.PP
まとめると、次のマクロは、垂直方向にスペースを入れた
行の折り返しを行います (スペースの量は
.B PD
マクロを使用すると変更できます):
.BR SH ,
.BR SS ,
.BR TP ,
.B LP
.RB ( PP ,
.BR P ),
.BR IP ,
.BR HP
。
マクロ
.B RS
および
.B RE
も行を折り返しますが、垂直方向にスペースを入れません。
.
.
.\" -----------------------------------------------------------------
.
.SH "フォントを設定するためのマクロ"
.
標準フォントはローマン体です。そして、デフォルトのテキストサイズは
10\ ポイントです。
.
.TP
.BI ".SM [" text ]
同じ行にあるテキストあるいは次の入力行にあるテキストが、
デフォルトのフォントよりも 1 ポイントだけ小さいフォントで
表示されるようになります。
.
.TP
.BI ".SB [" text ]
同じ行にあるテキストあるいは次の入力行にあるテキストが、
ボールド体のフォントで、そしてデフォルトのフォントよりも
1 ポイントだけ小さいフォントで表示されるようになります。
.
.TP
.BI ".BI " text
同じ行にあるテキストが、ボールド体とイタリック体を
交互に使って表示されるようになります。
テキストはマクロ呼び出しと同じ行にあることが必要です。
したがって、
.RS
.IP
\&.BI this "word and" that
.PP
という行は、`this' と `that' がボールド体で表示され、
それに対して `word and' の部分はイタリック体で
表示されます。
.RE
.
.TP
.BI ".IB " text
テキストが、イタリック体とボールド体を交互に使って
表示されるようになります。テキストはマクロ呼び出しと
同じ行にあることが必要です。
.
.TP
.BI ".RI " text
マクロ呼び出しと同じ行にあるテキストが、ローマン体と
イタリック体を交互に使って表示されるようになります。
テキストは、マクロ呼び出しと同じ行にあることが必要です。
.
.TP
.BI ".IR " text
マクロ呼び出しと同じ行にあるテキストが、イタリック体と
ローマン体を交互に使って表示されるようになります。
テキストは、マクロ呼び出しと同じ行にあることが必要です。
.
.TP
.BI ".BR " text
マクロ呼び出しと同じ行にあるテキストが、ボールド体と
ローマン体を交互に使って表示されるようになります。
テキストは、マクロ呼び出しと同じ行にあることが必要です。
.
.TP
.BI ".RB " text
マクロ呼び出しと同じ行にあるテキストが、ローマン体と
ボールド体を交互に使って表示されるようになります。
テキストは、マクロ呼び出しと同じ行にあることが必要です。
.
.TP
.BI ".B [" text ]
.I text
がボールド体で表示されるようになります。
マクロが呼び出された行にテキストがない場合は、次の入力行の
テキストがボールド体で表示されます。
.
.TP
.BI ".I [" text ]
.I text
がイタリック体で表示されるようになります。
マクロが呼び出された行にテキストがない場合は、次の行の
テキストがイタリック体で表示されます。
.
.
.\" -----------------------------------------------------------------
.
.SH "その他"
.
出力デバイス用のインデント幅は、troff モードでは 7.2n であり、
nroff モードでは 7n です。
.B grohtml
は例外で、インデントを無視します。
.
.TP
.B .DT
0.5 インチごとにタブを設定します。
このマクロは常に
.B TH
リクエスト中で呼ばれるため、タブ位置が変更された場合に限って
呼び出すことには意味があります。
.
.TP
.BI ".PD [" nnn ]
新しい段落やセクションの前のスペースを調整します。
オプションの引数は、スペースの量を与えます (デフォルトの単位は `v')。
パラメータ無しの場合、この値はデフォルト値に戻されます
(nroff モードでは 1 行で、それ以外では 0.4v)。
このリクエストは、
.BR SH ,
.BR SS ,
.BR TP ,
.B LP
(それぞれ \&
.B PP
および
.BR P ),
.BR IP ,
.BR HP
マクロに影響を与えます。
.
.TP
.BI ".AT [" system " [" release ]]
AT&T のマニュアルページを使用するためにフッタを変えます。
このコマンドは互換性のためだけにあるので、使用しないでください。
詳細は groff info マニュアルを参照してください。
.
.TP
.BI ".UC [" version ]
BSD のマニュアルページを使用するためにフッタを変えます。
このコマンドは互換性のためだけにあるので、使用しないでください。
詳細は groff info マニュアルを参照してください。
.
.TP
.B ".PT"
ヘッダ文字列を印字します。
ヘッダを制御するためには、このマクロを再定義してください。
.
.TP
.B ".BT"
フッタ文字列を印字します。
フッタを制御するためには、このマクロを再定義してください。
.
.PP
次の文字列が定義されています:
.TP
.B \e*S
デフォルトのフォントサイズに戻します。
.
.TP
.B \e*R
「登録」マークです。
.
.TP
.B \e*(Tm
「商標」マークです。
.
.TP
.B \e*(lq
.TQ
.B \e*(rq
左および右クォートです。
これは、それぞれ `\e(lq' と `\e(rq' と同じです。
.
.TP
.B \e*(HF
見出しと副見出しを印字するタイプフェースです。
デフォルトは `B' です。
.
.PP
.B tbl
あるいは
.B eqn
のようなプリプロセッサが必要な場合、マニュアルページの
1 行目を次のように見えるようにする例になります:
.PP
.RS
.BI .\e"\  word
.RE
.PP
ダブルクォートの後には空白文字 1 つが入ることに注意してください。
.I word
は、必要なプリプロセッサを表す文字で成り立っています。
`e' は
.BR eqn
を表し、
`r' は
.BR refer
を、そして `t' は
.BR tbl
を表します。
最近の
.B man
プログラムの実装では、この 1 行目を読んで自動的に正しい
プリプロセッサを呼び出します。
.
.
.\" -----------------------------------------------------------------
.
.SH 関連ファイル
.TP
.B man.tmac
.TQ
.B an.tmac
これらは、
.BR andoc.tmac
を呼び出すラッパファイルです。
.TP
.B andoc.tmac
このファイルは、
.B man
マクロまたは
.B mdoc
パッケージのいずれを使用すべきかを判定します。
.TP
.B an-old.tmac
全
.B man
マクロが、このファイルに含まれます。
.TP
.B man.local
ローカルの修正とカスタマイズは、このファイルに入れます。
.
.
.\" -----------------------------------------------------------------
.
.SH "関連項目"
.
.B man
マクロは、
.I groff
リクエストの集まりでできていますので、原理的には、
必要がある場合には自己流の
.I groff
リクエストを作って
.B man
の機能を追加することができます。
すべてのリクエストの完全な参照は、groff info ページを参照してください。
.
.PP
.BR tbl (1),
.BR eqn (1),
.BR refer (1),
.BR man (1)
.
.
.\" -----------------------------------------------------------------
.
.SH 作者
.
このマニュアルページは、本来 Debian GNU/Linux システム用に
Susan G. Kleinmann <sgk@debian.org> が書いたものです。
それを Werner Lemberg <wl@gnu.org> が修正し、更新しました。
それが今では GNU troff 配布物の一部になっています。
.
.\" Local Variables:
.\" mode: nroff
.\" End:
