freebsd/freebsd-doc/ja_JP.eucJP/man/man7/groff_me.7
.\" Copyright (c) 1980 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)me.7	6.4 (Berkeley) 4/13/90
.\"
.\" Modified for groff by jjc@jclark.com
.\"
.\" $FreeBSD:$
.\"
.hc %
.TH GROFF_ME 7 "26 April 2001" "Groff Version 1.17"
.UC 3
.SH 名称
groff_me \- 論文を整形するための troff マクロ
.SH 書式
.B "groff \-me"
[ options ]
file ...
.br
.B "troff \-me"
[ options ]
file ...
.SH 解説
本マニュアルページは、
groff 文書整形システムの一部である GNU バージョン \-me マクロを解説します。
本バージョンは、GNU troff でも Unix troff でも使用可能です。
この
.I troff
マクロ定義パッケージは、
様々な書式の技術論文に対して、よくある形式の文書の整形機能を提供します。
.PP
マクロリクエストの定義については後述します。
多くの
.I troff
リクエストは、本パッケージと組み合わせて使用すると危険ですが、
次のリクエストは、最初に .pp を使った後であれば問題なく使用する
ことができます。
.nf
.IP
.ta \w'.sz +n  'u
\&.bp	新しいページを開始する
\&.br	出力行をここで分割する
\&.sp n	n 個の空白行を挿入する
\&.ls n	(行間) n=1 シングルスペース, n=2 ダブルスペース
\&.na	右端を揃えない
\&.ce n	次の n 行を中央揃えにする
\&.ul n	次の n 行に下線を引く
.fi
.PP
.I pic,
.I eqn,
.I refer,
.I tbl
といったプリプロセッサの出力を、入力として受け付けます。
.SH 関連ファイル
/usr/share/tmac/me.tmac (e.tmac へのラッパファイル)
.br
/usr/share/tmac/e.tmac
.SH 関連項目
.BR groff (1),
.BR troff (1)
.br
\-me Reference Manual, Eric P. Allman
.br
Writing Papers with Groff Using \-me
.tr &.
.SH リクエスト
本リストは不完全です。
興味があるものの詳細については
.I "The \-me Reference Manual"
を参照してください。
.PP
.ta \w'.eh \'x\'y\'z\'  'u +\w'初期値 'u +\w'行分割 'u
.br
.di x
			\ka
.br
.di
.na
.in \nau
.ti 0
リクエスト	初期値	行分割	説明
.br
.in \nau
.ti 0
\&.(c	-	yes	中央揃えブロックの開始。
.ti 0
\&.(d	-	no	遅延テキストの開始。
.ti 0
\&.(f	-	no	脚注の開始。
.ti 0
\&.(l	-	yes	リストの開始。
.ti 0
\&.(q	-	yes	大きな引用の開始。
.ti 0
\&.(x \fIx\fR	-	no	
.I x
番の索引項目の開始。
.ad
.ti 0
\&.(z	-	no	フローティングキープの開始。
.ti 0
\&.)c	-	yes	中央揃えブロックの終了。
.ti 0
\&.)d	-	yes	遅延テキストの終了。
.ti 0
\&.)f	-	yes	脚注の終了。
.ti 0
\&.)l	-	yes	リストの終了。
.ti 0
\&.)q	-	yes	大きな引用の終了。
.ti 0
\&.)x	-	yes	索引項目の終了。
.ti 0
\&.)z	-	yes	フローティングキープの終了。
.ti 0
\&.++ \fIm H\fR	-	no	論文の節の定義。
.I m
は論文の部分を定義します。
.B C
(章)、
.B A
(付録)、
.B P
(序文、例えば、アブストラクト、目次など)、
.B B
(参考文献)、
.B RC
(各章において 1 ページ目から開始する章)、
.B RA
(1 ページ目から開始する付録) のいずれかです。
.ti 0
\&.+c \fIT\fR	-	yes	章 (または付録等 .++ で設定したもの) の開始。
.I T
は章のタイトルです。
.ti 0
\&.1c	1	yes	新しいページを 1 コラムで整形。
.ti 0
\&.2c	1	yes	2 コラムで整形。
.ti 0
\&.EN	-	yes	
.I eqn
や
.I neqn
が生成した式の後の空白。
.ti 0
\&.EQ \fIx y\fR	-	yes	式の前に置くことにより、
行を分割して空白を加えます。式番号は
.IR y
です。
省略可能な引数 \fIx\fR は、
.I I
の場合式のインデント (デフォルト) を、
.I L
の場合式の左揃えを、
.I C
の場合式の中央揃えを、それぞれ意味します。
.ti 0
\&.GE	-	yes	\fIgremlin\fP ピクチャの終了。
.ti 0
\&.GS	-	yes	\fIgremlin\fP ピクチャの開始。
.ti 0
\&.PE	-	yes	\fIpic\fP ピクチャの終了。
.ti 0
\&.PS	-	yes	\fIpic\fP ピクチャの開始。
.ti 0
\&.TE	-	yes	表の終了。
.ti 0
\&.TH	-	yes	表の先頭部分の終了。
.ti 0
\&.TS \fIx\fR	-	yes	表の開始; \fIx\fR が
.I H
の場合、表の先頭部分を繰り返し使用します。
.ti 0
\&.b \fIx\fR	no	no	
.I x
をボールドで表示します; 引数が無い場合にはボールドに移行します。
.ti 0
\&.ba \fI+n\fR	0	yes	ベースインデントを
.I n
だけ増加させます。
このインデントは
(段落のような)
通常のテキストのインデントをセットするために使用されます。
.ti 0
\&.bc	no	yes	新しいコラムの開始。
.ti 0
\&.bi \fIx\fR	no	no	
.I x
をボールドイタリックで表示 (フィルしない場合のみ)。
.ti 0
\&.bu	-	yes	小球 (bullet) が付いた段落の開始。
.ti 0
\&.bx \fIx\fR	no	no	\fIx\fR を箱の中に表示
(フィルしない場合のみ)。
.ti 0
\&.ef \fI\'x\'y\'z\'\fR	\'\'\'\'	no	偶数フッタを x  y  z にします。
.ti 0
\&.eh \fI\'x\'y\'z\'\fR	\'\'\'\'	no	偶数ヘッダを x  y  z にします。
.ti 0
\&.fo \fI\'x\'y\'z\'\fR	\'\'\'\'	no	フッタを x  y  z にします。
.ti 0
\&.hx	-	no	次のページのヘッダとフッタを抑制します。
.ti 0
\&.he \fI\'x\'y\'z\'\fR	\'\'\'\'	no	ヘッダを x  y  z にします。
.ti 0
\&.hl	-	yes	水平線の描画。
.ti 0
\&.i \fIx\fR	no	no	
.I x
をイタリックにします。
.I x
が無い場合、後続のテキストをイタリックにします。
.ti 0
\&.ip \fIx y\fR	no	yes	ハンギングタグ
.IR x
を伴う、インデントされた段落を開始します。
インデントは半角 (n の幅)
.I y
個分です (デフォルトは 5)。
.ti 0
\&.lp	yes	yes	左揃えしたブロックの段落の開始。
.ti 0
\&.np	1	yes	数字の付いた段落の開始。
.ti 0
\&.of \fI\'x\'y\'z\'\fR	\'\'\'\'	no	奇数フッタを x  y  z にします。
.ti 0
\&.oh \fI\'x\'y\'z\'\fR	\'\'\'\'	no	奇数ヘッダを x  y  z にします。
.ti 0
\&.pd	-	yes	遅延テキストの表示。
.ti 0
\&.pp	no	yes	段落の開始。
最初の行はインデントされます。
.ti 0
\&.r	yes	no	後続のテキストをローマンにします。
.ti 0
\&.re	-	no	タブをデフォルト値にリセットします。
.ti 0
\&.sh \fIn x\fR	-	yes	節の見出しが続きます。
フォントは自動的にボールドになります。
.I n
は節のレベルであり、
.I x
は節のタイトルです。
.ti 0
\&.sk	no	no	次のページを空白のままとします。
次の 1 ページのみに有効です。
.ti 0
\&.sm \fIx\fR	-	no	
.I x
をより小さなポイントサイズでセットします。
.ti 0
\&.sz \fI+n\fR	10p	no	ポイントサイズを
.I n
ポイントだけ増加させます。
.ti 0
\&.tp	no	yes	タイトルページの開始。
.ti 0
\&.u \fIx\fR	-	no	引数に下線を引きます (\fItroff\fR においても)。
(フィルしない場合のみ)。
.ti 0
\&.uh	-	yes	.sh に似ていますが、番号を付けません。
.ti 0
\&.xp \fIx\fR	-	no	
.I x
番の索引項目の表示。
.SH 日本語訳
堀川和雄 <horikawa@jp.FreeBSD.org>
