freebsd/freebsd-doc/ja_JP.eucJP/man/man7/hier.7
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man7/hier.7,v 1.91 2003/11/22 06:08:59 scottl Exp %
.\"
.\" $FreeBSD$
.Dd June 5, 1993
.Dt HIER 7
.Os
.Sh 名称
.Nm hier
.Nd ファイルシステムのレイアウト
.Sh 解説
ファイルシステムの階層構成についての概略です。
.Bl -tag -width "/stand/"
.It Pa /
ファイルシステムのルートディレクトリ。
.It Pa /bin/
ユーザ用ユーティリティの基本的なもの。
シングルユーザ環境、マルチユーザ環境どちらでも使用する。
.It Pa /boot/
オペレーティングシステムのブートストラップ中に使用される
プログラムと設定ファイル。
.Pp
.Bl -tag -width defaults/ -compact
.It Pa defaults/
デフォルトのブートストラップ用設定ファイル。
.Xr loader.conf 5
参照。
.It Pa kernel/
カーネルの pure な実行可能ファイル (ブート時にメモリに読み込まれる
オペレーティングシステム)。
.It Pa modules/
サードパーティのロード可能なカーネルモジュール。
.Xr kldstat 8
参照。
.El
.It Pa /cdrom/
CD-ROM ドライブのデフォルトマウントポイント
.Xr ( sysinstall 8
が作成します)。
.It Pa /compat/
通常は、
.Pa /usr/compat
へのリンクです。
そうでない場合、
.Pa /usr/compat
コメントがあてはまります。
.Xr ( sysinstall 8
が作成します)。
.It Pa /dev/
ブロックデバイスおよびキャラクタデバイスファイル。
.Pp
.Bl -tag -width ".Pa fd/" -compact
.It Pa fd/
ファイル記述子ファイル。
.Xr \&fd 4
参照。
.El
.It Pa /dist/
.Xr sysinstall 8
が使用するマウントポイント。
.It Pa /etc/
システムの設定ファイル、およびスクリプト。
.Pp
.Bl -tag -width "disklabels/" -compact
.It Pa defaults/
デフォルトのシステム設定ファイル。
.Xr rc 8
参照。
.It Pa gnats/
gnats 設定ファイル。
.Xr send-pr 1
参照。
.It Pa isdn/
isdn4bsd の設定ファイル。
.Xr isdnd 8
参照。
.It Pa localtime
ローカルタイムゾーン情報。
.Xr ctime 3
参照。
.It Pa mail/
sendmail の制御情報。
.It Pa mtree/
mtree 設定ファイル。
.Xr mtree 8
参照。
.It Pa namedb/
named 設定ファイル。
.Xr named 8
参照。
.It Pa pam.d/
プラグ可能認証モジュール (Pluggable Authentication Modules; PAM)
ライブラリの設定ファイル。
.Xr pam 8
参照。
.It Pa periodic/
.Xr cron 8
により、毎日/毎週/毎月実行されるスクリプト。
.Xr periodic 8
参照。
.It Pa ppp/
.Xr ppp 8
ppp 設定ファイル。
.Xr ppp 8
参照。
.It Pa ssl/
OpenSSL 設定ファイル。
.El
.It Pa /kernel
カーネルの pure な実行可能ファイル (ブート時にメモリに読み込まれる
オペレーティングシステム)。
.It Pa /modules/
ロード可能なカーネルモジュール。
.Xr kldstat 8
参照。
.It Pa /lib/
.Pa /bin
と
.Pa /sbin
のバイナリに必要な、重要なシステムライブラリ。
.It Pa /libexec/
.Pa /bin
と
.Pa /sbin
のバイナリに必要な、重要なシステムユーティリティ。
.It Pa /mnt/
通常、システム管理者が一時的なマウントポイントとして使用する
空のディレクトリ。
.It Pa /proc/
プロセスファイルシステム。
.Xr procfs 5 ,
.Xr mount_procfs 8
参照。
.It Pa /rescue/
緊急回復時に使用される、静的にリンクされたプログラム群です。
.Xr rescue 8
を参照してください。
.It Pa /root/
root のホームディレクトリ。
.It Pa /sbin/
システムプログラム、および基本的な管理者用ユーティリティ。
シングルユーザ環境、マルチユーザ環境どちらでも使用する。
.It Pa /stand/
スタンドアロン環境で使用されるプログラム。
.It Pa /tmp/
システムリブートをまたがった永続性が保証されない、一時ファイル。
.It Pa /usr/
ユーザ用ユーティリティ、およびアプリケーションの大部分を含む。
.Pp
.Bl -tag -width "libdata/" -compact
.It Pa bin/
一般的なユーティリティ、プログラミングツール、アプリケーション。
.It Pa compat/
Linux 等の他のオペレーティングシステムとのバイナリ互換性をサポートするために
必要なファイル
.Xr ( sysinstall 8
が作成します)。
.It Pa games/
有用でちょっとふざけたプログラム。
.It Pa include/
標準 C 言語インクルードファイル。
.Pp
.Bl -tag -width "kerberos5/" -compact
.It Pa arpa/
インターネットサービスプロトコルのための C 言語インクルードファイル。
.It Pa cam/
Common Access Methods Layer 用
C インクルードファイル。
.Bl -tag -width "kerberos5/" -compact
.It Pa scsi/
CAM 上の SCSI デバイス。
.El
.It Pa dev/
様々な
.Fx
デバイスのプログラミング用の C インクルードファイル。
.Bl -tag -width "kerberos5/" -compact
.It Pa ic/
ドライバ/バス独立なハードウェア回路を記述する、様々なヘッダファイル。
.It Pa ofw/
OpenFirmware サポート。
.It Pa ppbus/
パラレルポートバス。
.Xr ppbus 4
参照。
.It usb/
USB サブシステム。
.It Pa utopia/
ATM インタフェース用の物理チップドライバ。
.Xr utopia 4
参照。
.It Pa wi/
.Xr wi 4
WaveLAN ドライバ。
.El
.It Pa fs/
.Bl -tag -width "kerberos5/" -compact
.It Pa fdescfs/
プロセス毎のファイル記述子ファイルシステム。
.It Pa fifofs/
.St -p1003.1
FIFO ファイルシステム。
.It Pa msdosfs/
MS-DOS ファイルシステム。
.It Pa ntfs/
NTFS ファイルシステム。
.It Pa nullfs/
ループバックファイルシステム。
.It Pa nwfs/
NetWare ファイルシステム。
.It Pa portalfs/
ポータルファイルシステム。
.It Pa procfs/
プロセスファイルシステム。
.It Pa smbfs/
SMB/CIFS ファイルシステム。
.It Pa udf/
UDF ファイルシステム。
.It Pa umapfs/
uid/gid マッピングを変えるファイルシステム
.It Pa unionfs
ユニオンファイルシステム。
.El
.It Pa g++/
GNU C++ 言語インクルードファイル。
.Bl -tag -width "kerberos5/" -compact
.It Pa std/
GNU C++ 言語 libstdc++ インクルードファイル。
.El
.It Pa isc/
ISC ユーティリティライブラリ libisc インクルードファイル。
.It Pa isofs/
.Bl -tag -width "kerberos5/" -compact
.It Pa cd9660/
iso9660 形式ファイルシステム。
.El
.It Pa libmilter/
libmilter 用の C インクルードファイルであり、
.Xr sendmail 8
メールフィルタ の API です。
.It Pa machine/
マシン固有機能の C 言語インクルードファイル。
.It Pa net/
その他のネットワーク機能用 C 言語インクルードファイル。
.It Pa netatalk/
Appletalk プロトコル。
.It Pa netatm/
ATM のインクルードファイル。
.Xr atm 8
参照。
.It Pa netinet/
インターネット標準プロトコル用 C 言語インクルードファイル。
.Xr inet 4
参照。
.It Pa netinet6/
インターネットプロトコルバージョン 6 用の C インクルードファイル。
.Xr inet6 4
参照。
.It Pa netipx/
IPX/SPX プロトコルスタック。
.It Pa netkey/
カーネルの鍵管理サービス。
.It Pa netnatm/
NATM インクルードファイル。
.Xr natm 4
参照。
.It Pa netsmb/
SMB/CIFS リクエスタ。
.It Pa nfs/
NFS (Network File System) 用 C 言語インクルードファイル。
.It Pa objc/
Objective C のインクルードファイル。
.It Pa posix4/
POSIX リアルタイム拡張のインクルードファイル。
.Xr p1003_1b 9
参照。
.It Pa openssl/
OpenSSL (Cryptography/SSL ツールキットの) ヘッダ。
.It Pa pccard/
PC-CARD コントローラ。
.It Pa protocols/
Berkeley サービスプロトコル用 C 言語インクルードファイル。
.It Pa readline/
ユーザからの一行入力機能 (編集機能付き)。
.Xr readline 3
参照。
.It Pa rpc/
リモート手続き呼び出し。
.Xr rpc 3
参照。
.It Pa rpcsvc/
RPC サービス構造の定義。
.Xr rpc 3
参照。
.It Pa security/
PAM。
.Xr pam 8
参照。
.It Pa sys/
システム用 C 言語インクルードファイル (カーネルデータ構造)。
.\" .It Pa tcl/
.\" Tcl 言語。
.\" .Xr Tcl n
.\" 参照。
.\" .Bl -tag -width "kerberos5/" -compact
.\" .It Pa generic/
.\" ???
.\" .It Pa unix/
.\" ???
.\" .El
.It Pa ufs/
UFS (U-word File System) 用 C 言語インクルードファイル。
.Bl -tag -width "kerberos5/" -compact
.It Pa ffs/
Fast filesystem。
.It Pa ufs/
UFS ファイルシステム。
.El
.It Pa vm/
仮想記憶。
.Xr vmstat 8
参照。
.El
.Pp
.It Pa lib/
アーカイブライブラリ。
.Bl -tag -width Fl -compact
.It Pa aout/
a.out アーカイブライブラリ。
.It Pa compat/
互換性維持用の共有ライブラリ。
.Bl -tag -width Fl -compact
.It Pa aout/
a.out 後方互換ライブラリ。
.El
.El
.Pp
.It Pa libdata/
その他のユーティリティデータファイル。
.Bl -tag -width Fl -compact
.It Pa doscmd/
doscmd が使用するファイル (ドライバ、フォント等)。
.Xr doscmd 1
参照。
.Bl -tag -width 6n -compact
.It Pa fonts/
doscmd が使用するフォント。
.El
.It Pa gcc/
???
.It Pa ldscripts/
リンカスクリプト。
.Xr ld 1
参照。
.It Pa lint/
さまざまな lint 用ライブラリ (事前に構築されている)。
.Xr lint 1
参照。
.It Pa stallion/
Stallion シリアルコントローラ用ファームウェアイメージ。
.Xr stl 4
参照。
.El
.Pp
.It Pa libexec/
システムデーモンおよびシステムユーティリティ。
(他のプログラムから実行されるもの)。
.Bl -tag -width Fl -compact
.It Pa aout/
a.out 実行形式を操作するユーティリティ。
.It Pa elf/
ELF 実行形式を操作するユーティリティ。
.It Pa lpr/
LP プリントシステムのユーティリティとフィルタ。
.Xr lpr 1
参照。
.It Pa sendmail/
.Xr sendmail 8
バイナリ。
.Xr mailwrapper 8
参照。
.It Pa sm.bin/
.Xr sendmail 8
用制限付きシェル。
.Xr smrsh 8
参照。
.El
.Pp
.It Pa local/
ローカルの実行可能ファイル、ライブラリなど。
.Fx
ports フレームワークのデフォルトのインストール先としても使用されます。
local/以下では、
.Nm
で /usr に関して
記述された一般的な配置が使用されます。
例外は、man ディレクトリ
(local/share/ の下ではなく local/ の直下に存在)、
ports のドキュメント (share/doc/<port>/ に置かれます)、
/usr/local/etc (/etc の模倣) です。
.It Pa obj/
アーキテクチャ依存のターゲットツリー。
/usr/src ツリーを構築することで作成される。
.It Pa ports/
.Fx
ports コレクション (オプション扱い)。
.It Pa sbin/
(ユーザによって実行される) システムデーモン、およびシステムユーティリティ。
.It Pa share/
アーキテクチャに依存しないファイル。
.Pp
.Bl -tag -width "calendar/" -compact
.It Pa calendar/
事前に組み立てられた calendar ファイルいろいろ。
.Xr calendar 1
参照。
.It Pa dict/
単語リスト。
.Xr look 1
参照。
.Pp
.Bl -tag -width Fl -compact
.It Pa freebsd
.Fx
固有の術語、固有の名前、隠語。
.It Pa words
一般の単語
.It Pa web2
Webster's 2nd International からの単語
.It Pa papers/
リファレンスデータベース。
.Xr refer 1
参照。
.El
.Pp
.It Pa doc/
その他の文書。
(
.Tn USENIX
association から入手できる)
.Bx
マニュアルのほとんどのソース。
.Bl -tag -width Fl -compact
.It Pa FAQ/
しばしば行なわれる質問とその答え (Frequently Asked Questions)。
.It Pa IPv6/
IPv6 の実装に関する注。
.It Pa bind/
BIND (Berkeley Internet Name Domain) に属する文書。
.It Pa es/
/usr/share/doc 中の文書のスペイン語への翻訳。
.It Pa handbook/
.Fx
ハンドブック
.It Pa ja/
/usr/share/doc 中の文書の日本語への翻訳。
.It Pa ncurses/
ncurses に属する HTML 文書。
.Xr ncurses 3X
参照
.It Pa ntp/
Network Time Protocol に属する HTML 文書。
.It Pa papers/
UNIX 関連の論文
.It Pa psd/
UNIX プログラマ用補助文書
.It Pa ru/
/usr/share/doc 中の文書のロシア語への翻訳。
.It Pa smm/
UNIX システム管理者用マニュアル
.It Pa tutorials/
.Fx
チュートリアル。
.It Pa usd/
UNIX ユーザ用補助文書
.It Pa zh/
/usr/share/doc 中の文書の中国語への翻訳。
.El
.Pp
.It Pa examples/
一般ユーザやプログラマ向けのさまざまな用例。
.It Pa games/
各種のゲームで使用される ASCII テキストファイル。
.It Pa groff_font/
デバイス名ごとに用意されたデバイス記述ファイル。
.It Pa info/
GNU Info ハイパーテキストシステム。
.It Pa isdn/
ISDN。
.It Pa locale/
ローカル化関係のファイル。
.Xr setlocale 3
参照。
.It Pa man/
マニュアルページ。
.It Pa me/
me マクロパッケージで使用するマクロ。
.Xr me 7
参照。
.It Pa misc/
その他システム全体の ASCII テキストファイル。
.Bl -tag -width Fl -compact
.It Pa fonts/
???
.It Pa pcvtfonts/
pcvt フォント。
.Xr pcvt 4
参照。
.It Pa termcap
端末の特性を記述するデータベース。
.Xr termcap 5
参照。
.El
.It Pa mk/
make 用テンプレート。
.Xr make 1
参照。
.It Pa nls/
各国語サポート (National Lanuguage Support) ファイル。
.Xr mklocale 1
参照。
.It Pa pcvt/
pcvt の文書とその他の例。
.Xr pcvt 4
参照。
.It Pa security/
.Xr mac_lomac 4
等のセキュリティポリシ用のデータファイル。
.It Pa sendmail/
.Xr sendmail 8
の設定ファイル。
.It Pa skel/
新しいアカウントのための . (ドット) ファイルの例。
.It Pa syscons/
syscons が使用するファイル。
.Xr syscons 4
参照。
.Bl -tag -width "scrnmaps/xx" -compact
.It Pa fonts/
コンソールフォント。
.Xr vidcontrol 1
と
.Xr vidfont 1
参照。
.It Pa keymaps/
コンソールキーボードマップ。
.Xr kbdcontrol 1
と
.Xr kbdmap 1
参照。
.It Pa scrnmaps/
コンソールスクリーンマップ。
.El
.It Pa tabset/
各種端末用タブ記述ファイル。termcap ファイルの中で使用される。
.Xr termcap 5
参照。
.It Pa tmac/
テキスト処理マクロ。
.Xr nroff 1
および
.Xr troff 1
参照。
.It Pa vi/
.Xr vi 1
のローカライズサポートとユーティリティ。
.It Pa zoneinfo/
タイムゾーン設定情報。
.Xr tzfile 5
参照。
.El
.It Pa src/
.Bx
とサードバーティとローカルのソースファイル。
.Pp
.Bl -tag -width "kerberos5/" -compact
.It Pa bin/
/bin 内のファイルのソース。
.It Pa contrib/
寄贈されたソフトウェアのソース。
.It Pa crypto/
寄贈された暗号化ソフトウェアのソース。
.It Pa etc/
/etc 内のファイルのソース。
.It Pa games/
/usr/games 内のファイルのソース。
.It Pa gnu/
GNU General Public License で保護されたユーティリティ。
.It Pa include/
/usr/include 内のファイルのソース。
.It Pa kerberos5/
Kerberos version 5 のビルドインフラストラクチャ。
.It Pa lib/
/usr/lib 内のファイルのソース。
.It Pa libexec/
/usr/libexec 内のファイルのソース。
.It Pa release/
.Fx
のリリースを生成するために必要なファイル。
.It Pa sbin/
/sbin 内のファイルのソース。
.It Pa secure/
/usr/src/crypto 中のファイル用のビルドディレクトリ。
.It Pa share/
/usr/share 内のファイルのソース。
.It Pa sys/
カーネルのソースファイル。
.It Pa tools/
.Fx
のメンテナンスとテストに使用するツール。
.It Pa usr.bin/
/usr/bin 内のファイルのソース。
.It Pa usr.sbin/
/usr/sbin 内のファイルのソース。
.El
.Pp
.It Pa X11R6/
X11R6 配布パッケージの実行可能形式ファイル、ライブラリなど
(オプション扱い)。
.Bl -tag -width "include/" -compact
.It Pa bin/
X11R6 のバイナリ (サーバ、ユーティリティ、ローカルな packages/ports)。
.It Pa etc/
X11R6 の設定ファイルとスクリプト。
.It Pa include/
X11R6 のインクルードファイル。
.It Pa lib/
X11R6 のライブラリ。
.It Pa man/
X11R6 のマニュアルファイル。
.It Pa share/
アーキテクチャ独立なファイル。
.El
.El
.It Pa /var/
さまざまな用途のログファイル、一時ファイル、遷移的ファイル、
スプールファイル。
.Pp
.Bl -tag -width "preserve/" -compact
.It Pa account/
システムアカウンティングファイル。
.Pp
.Bl -tag -width Fl -compact
.It Pa acct
実行アカウントファイル。
.Xr acct 5
参照。
.El
.Pp
.It Pa at/
指定した時間に動くコマンドのスケジュールファイル。
.Xr \&at 1
参照。
.Bl -tag -width "preserve/" -compact
.It Pa jobs/
ジョブファイルを含むディレクトリ。
.It Pa spool/
出力スプールファイルを含むディレクトリ。
.El
.Pp
.It Pa backups/
さまざまなバックアップファイル。
.It Pa crash/
カーネルクラッシュダンプを保存するデフォルトのディレクトリ。
.Xr crash 8
と
.Xr savecore 8
参照。
.It Pa cron/
cron が使用するファイル。
.Xr cron 8
参照。
.Bl -tag -width "preserve/" -compact
.It Pa tabs/
crontab ファイル。
.Xr crontab 5
参照。
.El
.Pp
.It Pa db/
システム固有のさまざまなデータベースファイル。自動生成される。
.It Pa empty/
特別に空のディレクトリが必要なプログラムによって使用される、空のディレクトリ。
例えば、特権分離のために
.Xr sshd 8
が使用します。
.Xr sshd 8
参照
.It Pa games/
さまざまなゲームのステータスおよびスコアファイル。
.It Pa heimdal/
Kerberos サーバデータベース。
.Xr kdc 8
参照。
.It Pa log/
さまざまなシステムログファイル。
.Pp
.Bl -tag -width Fl -compact
.It Pa wtmp
login/logout ログ。
.Xr wtmp 5
参照。
.El
.Pp
.It Pa mail/
ユーザのメールボックスファイル。
.It Pa msgs/
システムメッセージのデータベース。
.Xr msgs 1
参照。
.It Pa preserve/
エディタの不慮の死の際に保存されるファイルを一時的に安置するディレクトリ。
.Xr \&ex 1
参照。
.It Pa quotas/
ファイルシステムのクォータ情報のファイル。
.It Pa run/
ブートされてからのシステムについての各種情報を記述した
システム情報ファイル。
.Pp
.Bl -tag -width Fl -compact
.It Pa named/
.Dq bind
ユーザが書き込み可能です。
.Xr named 8
参照。
.It Pa ppp/
コマンドの接続ソケット用に、
.Dq network
グループが書き込み可能です。
.Xr ppp 8
参照。
.It Pa utmp
現在のユーザについてのデータベース。
.Xr utmp 5
参照。
.El
.Pp
.It Pa rwho/
rwho データファイル。
.Xr rwhod 8 ,
.Xr rwho 1 ,
.Xr ruptime 1
参照。
.It Pa spool/
さまざまなプリンタ、メールシステムのスプールディレクトリ。
.Pp
.Bl -tag -width Fl -compact
.It Pa ftp/
一般に ~ftp となる部分。anonymous ftp のルートディレクトリ。
.It Pa mqueue/
配送されていないメールのキュー。
.Xr sendmail 8
参照。
.It Pa output/
ラインプリンタ用スプールディレクトリ。
.El
.Pp
.It Pa tmp/
システムリブートをまたがって保持される、一時ファイル。
.Bl -tag -width Fl -compact
.It Pa vi.recover/
vi のリカバリファイルを格納しておくディレクトリ。
.El
.It Pa yp
NIS マップ。
.El
.El
.Sh 注
このマニュアルページはデフォルトの
.Fx
ファイルシステムレイアウトを
記述しており、
各システムの実際の階層構造はシステム管理者の裁量に委ねられています。
よく維持管理されたインストールにおいては、
カスタマイズされた本ドキュメントが付属するでしょう。
.Sh 関連項目
.Xr apropos 1 ,
.Xr find 1 ,
.Xr finger 1 ,
.Xr grep 1 ,
.Xr ls 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr which 1 ,
.Xr fsck 8
.Sh 歴史
.Nm
マニュアルページは
.At v7
で登場しました。
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 98-12-26
