freebsd/freebsd-doc/ja_JP.eucJP/man/man7/hier.7
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.1 (Berkeley) 6/5/93
.\"	%Id: hier.7,v 1.16.2.2 1999/08/21 04:46:23 chris Exp %
.\"
.\" jpman %Id: hier.7,v 1.3 1999/01/04 08:08:08 kuma Stab %
.Dd June 5, 1993
.Dt HIER 7
.Os
.Sh 名称
.Nm hier
.Nd ファイルシステムのレイアウト
.Sh 解説
ファイルシステムの階層構成についての概略です。
.Bl -tag -width "/stand/"
.It Li /
ファイルシステムのルートディレクトリ。
.It Li /bin/
ユーザ用ユーティリティの基本的なもの。
シングルユーザ環境、マルチユーザ環境どちらでも使用する。
.It Li /dev/
ブロックデバイスおよびキャラクタデバイスファイル。
.Pp
.Bl -tag -width MAKEDEV -compact
.It Li MAKEDEV
デバイスファイル作成用スクリプト。
.Xr MAKEDEV 8
参照。
.It Li fd/ 
ファイル記述子ファイル。
.Xr \&fd 4
参照。
.El
.It Li /etc/
システムの設定ファイル、およびスクリプト。
.Pp
.Bl -tag -width "disklabels/" -compact
.It Li gnats/
gnats 設定ファイル。
.Xr send-pr 1
参照。
.It Li kerberosIV/ 
kerberos バージョン IV の設定ファイル。
.Xr kerberos 1
参照。
.It Li localtime
ローカルタイムゾーン情報。
.Xr ctime 3
参照。
.It Li mtree/ 
mtree 設定ファイル。
.Xr mtree 8
参照。
.It Li namedb/ 
named 設定ファイル。
.Xr named 8
参照。
.It Li ppp/
.Xr ppp 8 
ppp 設定ファイル。
.Xr ppp 8
参照。
.It Li skel/
新しいアカウントのための \&. (ドット) ファイルのローカルの例。
.Xr adduser 8
参照。
.It Li uucp/
uucp 設定ファイル。
.Xr uucp 1
参照。
.El
.It Li /kernel
カーネルの pure な実行可能ファイル (ブート時にメモリに読み込まれる
オペレーティングシステム)。
.It Li /modules/
ロード可能なカーネルモジュール。
.Xr kldstat 8
参照。
.It Li /mnt/
通常、システム管理者が一時的なマウントポイントとして使用する
空のディレクトリ。
.It Li /proc/
プロセスファイルシステム。
.Xr procfs 5 ,
.Xr mount_procfs 8
参照。
.It Li /root
root のホームディレクトリ。
.It Li /sbin/
システムプログラム、および基本的な管理者用ユーティリティ。
シングルユーザ環境、マルチユーザ環境どちらでも使用する。
.It Li /stand/
スタンドアロン環境で使用されるプログラム。
.It Li /tmp/ 
テンポラリファイル。通常は
.Xr mfs 8
メモリファイルシステム (通常、/tmp の内容はシステムを再起動した際には
保存されない)。
.It Li /usr/
ユーザ用ユーティリティ、およびアプリケーションの大部分を含む。
.Pp
.Bl -tag -width "libdata/" -compact
.It Li bin/
一般的なユーティリティ、プログラミングツール、アプリケーション。
.It Li games/
有用でちょっとふざけたプログラム。
.It Li include/
標準 C 言語インクルードファイル。
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li arpa/
インターネットサービスプロトコルのための C 言語インクルードファイル。
.It Li g++/
GNU C++ 言語インクルードファイル。
.Bl -tag -width "kerberosIV/" -compact
.It Li std/
GNU C++ 言語 libstdc++ インクルードファイル。
.El
.It Li isofs/
.Bl -tag -width "kerberosIV/" -compact
.It Li cd9660/
iso9660 形式ファイルシステム。
.El
.It Li kerberosIV/
kerberos 認証パッケージ用 C 言語インクルードファイル。
.Xr kerberos 1
参照。
.It Li machine/
マシン固有機能の C 言語インクルードファイル。
.It Li msdosfs/
MS-DOS ファイルシステム。
.It Li net/
その他のネットワーク機能用 C 言語インクルードファイル。
.\" .It Li netimp/
.\" IMP プロトコル用 C 言語インクルードファイル
.\" (
.\" .Xr imp 4
.\" 参照)
.It Li netatalk/
Appletalk プロトコル。
.It Li netinet/
インターネット標準プロトコル用 C 言語インクルードファイル。
.Xr inet 4
参照。
.\" .It Li netiso/
.\" ISO 標準プロトコル用 C 言語インクルードファイル
.\" (
.\" .Xr iso 4
.\" 参照)
.\" .It Li netns/
.\" XNS 標準プロトコル用 C 言語インクルードファイル
.\" (
.\" .Xr \&ns 4
.\" 参照)
.It Li netipx/
IPX/SPX プロトコルスタック。
.It Li netkey/
カーネルの鍵管理サービス。
.It Li netns/
Xerox 社の NS プロトコル。
.It Li nfs/
NFS (Network File System) 用 C 言語インクルードファイル。
.It Li objc/
???
.It Li pccard/
PC-CARD コントローラ。
.It Li protocols/
Berkeley サービスプロトコル用 C 言語インクルードファイル。
.It Li readline/
ユーザからの一行入力機能(編集機能付き)。
.Xr readline 3
参照。
.It Li rpc/
リモート手続き呼び出し。
.Xr rpc 3
参照。
.It Li rpcsvc/
???
.It Li ss/
libss ???
.It Li sys/
システム用 C 言語インクルードファイル (カーネルデータ構造)。
.It Li tcl/
Tcl 言語。
.Xr Tcl n
参照。
.Bl -tag -width "kerberosIV/" -compact
.It Li generic/
???
.It Li unix/
???
.El
.It Li ufs/
UFS (U-word File System) 用 C 言語インクルードファイル。
.Bl -tag -width "kerberosIV/" -compact
.It Li ffs/
Fast filesystem。
.It Li lfs/
ログファイルシステム。
.Xr mount_lfs 8
参照。
.It Li mfs/
メモリファイルシステム。
.Xr mount_mfs 8
参照。
.It Li ufs/
UFS ファイルシステム。
.El
.It Li vm/
仮想記憶。
.Xr vmstat 8
参照。
.El
.Pp
.It Li lib/
アーカイブライブラリ。
.Bl -tag -width Fl -compact
.It Li compat/
互換性維持用の共有ライブラリ。
.El
.Pp
.It Li libdata/
その他のユーティリティデータファイル。
.Bl -tag -width Fl -compact
.It Li gcc/
???
.It Li lint/
さまざまな lint 用ライブラリ(事前に構築されている)。
.Xr lint 1
参照。
.It Li stallion/
ダウンロードファームウェアのイメージが保持されている。
.It Li tcl
???;
.Xr Tcl n
参照。
.El
.Pp
.It Li libexec/
システムデーモンおよびシステムユーティリティ。
(他のプログラムから実行されるもの)。
.Bl -tag -width Fl -compact
.It Li lpr/
???
.Xr lpr 1
参照。
.It Li sm.bin/
sendmail 用制限付きシェル。
.Xr smrsh 8
参照。
.It Li uucp/
uucp ユーティリティ。
.Xr uucp 1
参照。
.El
.Pp
.It Li local/
ローカルの実行可能ファイル、ライブラリなど。
.br
.Tn FreeBSD
ports フレームワークのデフォルトのインストール先としても使用されます。
local/以下では、
.Xr hier 7
で /usr に関して
記述された一般的な配置が使用されます。例外として、man ディレクトリは
local/share/ の下ではなく、local/ の直下に存在します。ports のドキュメントは
share/doc/<port>/ に置かれます。
.It Li mdec/
ブートプログラム。
.Xr disklabel 8
参照。
.It Li obj/
アーキテクチャ依存のターゲットツリー。
/usr/src ツリーを構築することで作成される。
.It Li ports/
.Tn FreeBSD
ports コレクション (オプション扱い)。
.It Li sbin/
(ユーザによって実行される) システムデーモン、およびシステムユーティリティ。
.It Li share/
アーキテクチャに依存しないファイル。
.Pp
.Bl -tag -width "calendar/" -compact
.It Li calendar/
事前に組み立てられた calendar ファイルいろいろ。
.Xr calendar 1
参照。
.It Li dict/
単語リスト。
.Xr look 1
参照。
.Pp
.Bl -tag -width Fl -compact
.It Li words
一般の単語
.It Li web2
Webster's 2nd International からの単語
.It Li papers/
リファレンスデータベース。
.Xr refer 1
参照。
.It Li special/
特殊な語のリスト。
.Xr spell 1
参照。
.El
.Pp
.It Li doc/
その他の文書。
(
.Tn USENIX
association から入手できる)
.Bx
マニュアルのほとんどのソース。
.Bl -tag -width Fl -compact
.It Li FAQ/
しばしば行なわれる質問とその答え (Frequently Asked Questions)。
.It Li handbook/
.Tn FreeBSD
ハンドブック
.It Li papers/
UNIX 関連の論文
.It Li psd/
UNIX プログラマ用補助文書
.It Li smm/
UNIX システム管理者用マニュアル
.It Li usd/
UNIX ユーザ用補助文書
.El
.Pp
.It Li examples/
一般ユーザやプログラマ向けのさまざまな用例。
.It Li games/
各種のゲームで使用される ascii テキストファイル。
.It Li groff_font/
デバイス名ごとに用意されたデバイス記述ファイル。
.It Li info/
GNU Info ハイパーテキストシステム。
.It Li isdn/
ISDN。
.It Li libg++/
libg++ genclass のプロトタイプ/テンプレートクラスファイル。
.It Li locale/
国際化機能関係のファイル。
.Xr setlocale 3
参照。
.It Li man/
マニュアルページ。
.It Li me/
me マクロパッケージで使用するマクロ。
.It Li misc/
その他システム全体の ascii テキストファイル。
.Bl -tag -width Fl -compact
.It Li fonts/
???
.It Li pcvtfonts/
???;
.Xr pcvt 4
参照。
.It Li pkg_manage/
パッケージマネージャのヘルプファイル。
.Xr pkg_manage
参照。
.It Li termcap
端末の特性を記述するデータベース。
.Xr termcap 5
参照。
.El
.It Li mk/
make 用テンプレート。
.Xr make 1
参照。
.It Li ms/
ms マクロパッケージで使用するマクロ。
.It Li nls/
各国語サポート(National Lanuguage Support)ファイル。
.Xr mklocale 1
参照。
.It Li perl/
perl ライブラリファイル。
.Xr perl 1
参照。
.It Li sgml/
SGML ツールファイル。
.Xr instant 1 
参照。
.It Li skel/
新しいアカウントのための . (ドット) ファイルの例。
.It Li tabset/
各種端末用タブ記述ファイル。termcap ファイルの中で使用される。
.Xr termcap 5
参照。
.It Li tmac/
テキスト処理マクロ。
.Xr nroff 1
および
.Xr troff 1
参照。
.It Li zoneinfo/
タイムゾーン設定情報。
.Xr tzfile 5
参照。
.El
.It Li src/
BSD と local のソースファイル。
.Pp
.Bl -tag -width "kerberosIV/" -compact
.It Li bin/
/bin 内のファイルのソース。
.It Li contrib/
寄贈されたソフトウェアのファイルのソース。
.It Li eBones/
Kerberos と DES。
.It Li etc/
/etc 内のファイルのソース。
.It Li games/
/usr/games 内のファイルのソース。
.It Li gnu/
GNU Public Licence で保護されたユーティリティ。
.It Li include/
/usr/include 内のファイルのソース。
.It Li kerberosIV/
Kerberos version IV のソース。
.It Li lib/
/usr/lib 内のファイルのソース。
.It Li libexec/
/usr/libexec 内のファイルのソース。
.It Li local/
/usr/local 内のファイルのソース。
.It Li release/
.Tn FreeBSD 
のリリースを生成するために必要なファイル。
.It Li sbin/
/sbin 内のファイルのソース。
.It Li secure/
DES のソース。
.It Li share/
/usr/share 内のファイルのソース。
.It Li sys/
カーネルのソースファイル。
.It Li usr.bin/
/usr/bin 内のファイルのソース。
.It Li usr.sbin/
/usr/sbin 内のファイルのソース。
.El
.Pp
.It Li X11R6/
X11R6 配布パッケージの実行可能形式ファイル、ライブラリなど
(オプション扱い)。
.El
.It Li /var/
さまざまな用途のログファイル、一時ファイル、遷移的ファイル、
スプールファイル。
.Pp
.Bl -tag -width "preserve/" -compact
.It Li account/ 
システムアカウンティングファイル。
.Pp
.Bl -tag -width Fl -compact
.It Li acct
実行アカウントファイル。
.Xr acct 5
参照。
.El
.Pp
.It Li at/
指定した時間に動くコマンドのスケジュールファイル。
.Xr \&at 1
参照。
.Bl -tag -width "preserve/" -compact
.It Li jobs
ジョブファイルを含むディレクトリ。
.It Li spool
出力スプールファイルを含むディレクトリ。
.El
.Pp
.It Li backups/
さまざまなバックアップファイル。
.It Li crash/
???;
.Xr crash 8
参照。
.It Li cron/
.Bl -tag -width "preserve/" -compact
.It Li log
cron のログファイル。
.Xr cron 8
参照。
.It Li tabs
crontab ファイル。
.Xr crontab 5
参照。
.El
.Pp
.It Li db/ 
システム固有のさまざまなデータベースファイル。自動生成される。
.It Li games/ 
さまざまなゲームのステータスおよびログファイル。
.\" .It Li games/
.\" ゲームスコアのファイル。
.It Li log/ 
さまざまなシステムログファイル。
.Pp
.Bl -tag -width Fl -compact
.It Li wtmp
login/logout ログ。
.Xr wtmp 5
参照。
.El
.Pp
.It Li mail/ 
ユーザのメールボックスファイル。
.It Li preserve/
エディタの不慮の死の際に保存されるファイルを一時的に安置するディレクトリ。
.Xr \&ex 1 
参照。
.It Li msgs/
システムメッセージのデータベース。
.Xr msgs 1
参照。
.It Li quotas/ 
ファイルシステムのクォータ情報のファイル。
.It Li run/
ブートされてからのシステムについての各種情報を記述した
システム情報ファイル。
.Pp
.Bl -tag -width Fl -compact
.It Li utmp
現在のユーザについてのデータベース。
.Xr utmp 5
参照。
.El
.Pp
.It Li rwho/ 
rwho データファイル。
.Xr rwhod 8 ,
.Xr rwho 1 ,
.Xr ruptime 1
参照。
.It Li spool/ 
さまざまなプリンタ、メールシステムのスプールディレクトリ。
.Pp
.Bl -tag -width Fl -compact
.It Li ftp/ 
一般に ~ftp となる部分。anonymous ftp のルートディレクトリ。
.It Li mqueue/ 
配送されていないメールのキュー。
.Xr sendmail 8
参照。
.It Li output/
ラインプリンタ用スプールディレクトリ。
.It Li secretmail/ 
機密メール用スプールディレクトリ。
.Xr xget 1
参照。
.It Li uucp/ 
uucp スプールディレクトリ。
.It Li uucppublic/
一般に ~uucp となる部分。共用 uucp テンポラリディレクトリ。
.El
.Pp
.It Li tmp/ 
システムがリブートするまでの間保持されるテンポラリファイル。
.Bl -tag -width Fl -compact
.It Li vi.recover
vi のリカバリファイルを格納しておくディレクトリ。
.El
.It Li yp
NIS マップ。
.El
.El
.Sh 関連項目
.Xr apropos 1 ,
.Xr find 1 ,
.Xr finger 1 ,
.Xr grep 1 ,
.Xr ls 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr which 1 ,
.Xr fsck 8
.Sh 歴史
.Nm hier
マニュアルページは
.At v7
で登場しました。
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 98-12-26
