freebsd/freebsd-doc/ja_JP.eucJP/man/man7/hostname.7
.\" Copyright (c) 1987, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)hostname.7	8.2 (Berkeley) 12/30/93
.\" %FreeBSD: src/share/man/man7/hostname.7,v 1.5 1999/08/28 00:20:56 peter Exp %
.\"
.\" $FreeBSD$
.\"
.Dd December 30, 1993
.Dt HOSTNAME 7
.Os BSD 4.2
.Sh 名称
.Nm hostname
.Nd ホスト名解決の解説
.Sh 解説
ホスト名は、ドットで区切られた階層的なサブドメインのリストです。
例えば、インターネットの EDU サブドメインの Berkeley サブドメインでは、
マシン monet は以下のように表されます。
.Pp
.Dl monet.Berkeley.EDU
.Pp
(終端のドットを含まない)
.Pp
ホスト名はしばしばネットワーククライアント・サーバプログラムで使用されます。
一般に、これらのプログラムは使用の際に名前をアドレスに変換する必要があります。
(この機能は通常
.Xr gethostbyname  3
ライブラリルーチンによって実行されます。)
ホスト名はインターネットネームリゾルバによって以下の方法で解決されます。
.Pp
名前がただ 1 つの要素で構成されている、すなわちドットを含まない場合で、環境変数
.Dq Ev HOSTALIASES
にファイル名がセットされている場合、入力されたホスト名と一致する文字列をその
ファイルから検索します。
そのファイルは、空白で区切られた2つの文字列からなる行で構成されているべきです。
最初の文字列はホスト名のエイリアス、2つめの文字列はそのエイリアスと置換される
完全なホスト名です。
解決されるホスト名とそのファイルの行の第1フィールドが大文字小文字の区別なしに
一致すれば、それ以上処理を進めずに置換される名前を調べます。
.Pp
入力された名前が終端のドットを伴う場合、その終端のドットが削除され、残りの名前
がそのままの状態で調べられます。
.Pp
入力された名前が終端のドットを伴わない場合、一致するまでドメインのリストを検索
してその名前を調べます。
デフォルトの検索リストは、最初にローカルドメイン、次に少なくとも2つの名前要素を
もつ親ドメインを(長いものから順に)含んでいます。
例えば CS.Berkeley.EDU ドメインにおいて、lithium.CChem という名前はまず
lithium.CChem.CS.Berkeley.EDU として照合され、次に
lithium.CChem.Berkeley.EDU として照合されます。
lithium.CChem.EDU は、
ローカルドメインにあった要素がただ 1 つしか残っていないので、
試されません。
検索パスは、システム全体の設定ファイル (
.Xr resolver  5
参照) によってデフォルトの状態から変更することができます。
.Sh 関連項目
.Xr gethostbyname 3 ,
.Xr resolver 5 ,
.Xr mailaddr 7 ,
.Xr named 8
.Sh 歴史
.Nm hostname
は
.Bx 4.2
から登場しました。
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 99-1-21
