freebsd/freebsd-doc/ja_JP.eucJP/man/man7/mailaddr.7
.\" Copyright (c) 1983, 1987, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mailaddr.7	8.1 (Berkeley) 6/16/93
.\" %FreeBSD: src/share/man/man7/mailaddr.7,v 1.6 1999/08/28 00:20:56 peter Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 16, 1993
.Dt MAILADDR 7
.Os BSD 4.2
.Sh 名称
.Nm mailaddr
.Nd メールアドレスの解説
.Sh 解説
メールアドレスは、このマニュアルページの最後に列挙する、インターネットの
プロトコルに基づいています。これらのアドレスは汎用的な書式
.Pp
.Dl user@domain
.Pp
に従います。
ここで domain はドットで区切られた階層的なサブドメインのリストです。
例えば、ある正しいアドレスは以下の通りです。
.Pp
.Dl eric@CS.Berkeley.EDU
.Pp
アドレス表記のある種の別形式と異なり、これらドメインには経路指定と
しての意味は全くありません。
それゆえ、このアドレスがインターネットのアドレスとして指定された場合でも、
もし他の経路の方が簡便だったり効率的だったりする場合は、メールは
そちらを通ります。
例えば、Berekeley の内部では、このアドレスを指定したメッセージは
Berkeley のインターネットゲートウェイを通らず、おそらくイーサネットを
通じて直接 CS へ行くでしょう。
.Ss 省略
ある種の状況下においては完全なドメイン名を指定する必要はありません。
一般的に、宛先のアドレスの最初のドットより後の部分が、あなたが
メッセージを発信しようとしている場所と同じドメインである場合は、
ドット以降のすべてを省略して構いません。
例えば、``calder.berkeley.edu'' に所属するユーザは、送り側と受け側の
ホストが同じであるため、``berkeley.edu'' をつけずに ``eric@CS'' に
メッセージを送ることができます。
.Ss 互換性
.Pp
ある種の古いアドレスの書式は以前のメールシステムに互換になるように
新しい書式に変換されます。特に、
.Pp
.Dl user@host
.Pp
と
.Dl user@host.domain
.Pp
はそのまま新しい書式でも許されますが、
.Pp
.Dl host.domain!user
.Pp
は
.Pp
.Dl user@host.domain
.Pp
に変換され、
.Pp
.Dl host!user
.Pp
は
.Pp
.Dl user@host.UUCP
.Pp
に変換されます。
.Pp
これは通常、古くからの UUCP ホストとの互換性を保つために、
送信される前に ``host!user'' 形式に逆変換されます。
.Pp
.Ss 大文字と小文字の区別
.Pp
ドメイン名 (すなわち、``@'' 記号の後にあるすべて) は、UUCP ホスト名を
例外として、大文字と小文字をどのように混ぜても構いません。
多くのホストはユーザ名に大文字と小文字をどのように混ぜて使った指定も
受け付けますが、著名な例外としては MULTICS サイトがあります。
.Ss 経路つきアドレス
.Pp
ある種の状況下では、メッセージを最終的な送り先に行き着かせるために
いくつかのホストを経由地として指定することを余儀なくされることが
あるかもしれません。
通常この経路指定は自動的に行われますが、
メッセージの経路を手動で指定した方が望ましい場合も時々あります。
それらのリレーを示すアドレスは「経路つきアドレス(route-addr)」と呼ばれます。
これらは以下の構文に従います。
.Pp
.Dl <@hosta,@hostb:user@hostc>
.Pp
この例は、メッセージがまず hosta に送られ、そこから hostb へ、そして
最後に hostc に送られることを示します。
この経路は、hostc へのより効率的な経路が存在した場合でも、強制されます。
.Pp
経路つきアドレスはリターンアドレスにしばしば表れます。
これは、通例、各ホストにおいてソフトウェアが先頭に
経路情報を付け加えるためです。
実際の送り主を識別するために、アドレスの ``user@hostc'' 部分を除いた
すべての部分を無視することができるのが通例です。
.Pp
[注意: route-addr 構文は、使用しないように RFC 1123 で公式に要請されているので
使用するべきではありません。]
.Pp
ごく単純な経路指定のために、多くのサイトは「パーセントハック」も
サポートしています。
.Pp
.Dl user%hostc%hostb@hosta
.Pp
は、前の例に示したのと同じ経路を通って配送されます。
.Ss ポストマスタ
.Pp
すべてのサイトは、メールシステムに関する問題報告の送り先である
``postmaster'' という名前のユーザか、ユーザへのエイリアスを
備える必要があります。
.Ss その他のネットワーク
.Pp
他のネットワークのうちの一部には、そのネットワークの名前を
ドメインの最後の構成要素として与えることによって、
メッセージを届けることのできるものもあります。
これは
.Em 標準の機能ではない
ので、すべてのサイトでサポートされているわけではないでしょう。
例えば、CSNET や BITNET のサイトへはそれぞれ ``user@host.CSNET'' や
``user@host.BITNET'' として送信できることがしばしばです。
.Sh 関連項目
.Xr mail 1 ,
.Xr sendmail 8
.Rs
.%A Crocker, D. H.
.%T Standard for the Format of Arpa Internet Text Messages
.%O RFC822
.Re
.Sh 歴史
.Nm mailaddr
マニュアルページは
.Bx 4.2
から登場しました。
.Sh バグ
RFC822 のグループ構文 (``group:user1,user2,user3;'') は、
古い berknet スタイルのアドレスと衝突するため、
``group:;'' という特別な場合を除いてサポートされていません。
.Pp
経路つきアドレス構文は不愉快です。
.Pp
UUCP 式と Internet 式のアドレスは礼儀正しく共存できません。
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 99-1-21
