freebsd/freebsd-doc/ja_JP.eucJP/man/man7/man.7
.\" Copyright (c) 1998.
.\"	The FreeBSD Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: man.7,v 1.1 1998/11/26 00:21:24 jkoshy Exp %
.\" jpman %Id: man.7,v 1.2 1999/02/06 00:44:12 kuma Stab %
.\"
.\" WORD: format		(roffで)書式整形(する)[man.7]
.\" WORD: indent		インデント[man.7]
.\"
.Dd November 30, 1998
.Os
.Dt MAN 7
.Sh 名称
.Nm man
.Nd 
.Nm \-man
マクロパッケージのクイックリファレンスガイド
.Sh 書式
.Nm groff
.Fl m Ns Ar an
.Ar
.Sh 解説
.Nm \-man
パッケージは、
.Ux
マニュアルページの書式整形に使用するマクロの集合です。
.Bx
システムでは、
.Nm
の使用を大いに非としており、代わりに、それより表現力に富んだ
.Nm mdoc
パッケージが推奨されています。
.Sh 使用例
.Ss 慣習
.Nm
で使用するマクロは、1 文字か 2 文字のアルファベット大文字を用いて名前が
付けられています。
.Xr troff 1
で普通に用いられる慣習に従い、各マクロリクエストは、
.Li "."
を行の先頭の文字として始まります。
印字可能テキストを期待するマクロリクエストの引数は 0 個から 6 個までの単語
(word) からなります。マクロによっては、引数が与えられない場合は次の入力行を
処理するものもあります。例えば、
.Li ".I"
リクエストがそれだけで 1 行になっている場合、次の入力行が斜体 (italic) に
なります。
空白類文字 (whitespace characters) は、クォート文字で囲むことで引数に
含めることができます。フォントとサイズは各パラグラフが始まる直前、
もしくは、フォントサイズ、フォントフェース変更マクロの処理が完了した直後に、
デフォルト値にリセットされます。
.Ss インデント
.\" WORD:	prevailing indent	通常インデント[man.7]
通常インデント (prevailing indent) の間隔は、その後インデント状態の
パラグラフが継続する間、保持されていますが、非インデント状態の
パラグラフに到達するとデフォルト値にリセットされます。インデントに
おけるデフォルトの単位は、
.Dq en
です。
.Ss 前処理 (Preprocessing)
伝統的に、マニュアルページの書式整形と表示には
.Xr man 1
プログラムが用いられます。マニュアルソースページの最初の行が、
文字列
.Li \&\'\e"
.\" " bring emacs's font-lock mode back in sync ...
で始まる場合、
その行の残りの文字は、
.Xr troff 1
に掛ける前に通す必要があるプリプロセッサを表します。
サポートしているプリプロセッサ指示子は次のとおりです。
.Bl -column "文字" "プリプロセッサ" -offset indent
.It Em 文字 Ta Em プリプロセッサ
.It e Ta Xr eqn 1
.It g Ta Xr grap 1
.It p Ta Xr pic 1
.It r Ta Xr refer 1
.It t Ta Xr tbl 1
.It v Ta Xr vgrind 1
.El
.Ss 利用可能な文字列
.Nm
パッケージで事前に定義されている文字列は次のとおりです。
.Bl -column "文字列" "XXXXXXXXXXXXXXXXXXXXXXXXXXXX" -offset indent
.It Em 文字列 Ta Em 説明
.It "\e*R" Ta "登録商標のシンボル(registration symbol)"
.It "\e*S" Ta "デフォルトフォントサイズに戻す"
.It "\e*(Tm" Ta "商標のシンボル(trademark symbol)"
.It "\e*(lq" Ta "左引用符(left quote)"
.It "\e*(rq" Ta "右引用符(right quote)"
.El
.Pp
.Ss 利用可能なマクロ
利用可能なマクロをアルファベット順で説明しておきます。
.Bl -tag -width "XXX XX"
.It ".B" Op Ar words
.Ar words
.\" WORD: typeset	版組みする[man.7]
.\" WORD: line break	(行を)分割する[man.7]
をボールド体で版組みします。行分割は生じません。引数が与えられない
場合、次の行が処理の対象になります。
.It ".BI" Op Ar words
ボールド体と斜体で交代しながら、
.Ar words
を結合します。行分割は生じません。
引数が与えられない場合、次の行が処理の対象になります。
.It ".BR" Op Ar words
ボールド体とローマン体で交代しながら、
.Ar words
を結合します。行分割は生じません。
引数が与えられない場合、次の行が処理の対象になります。
.It ".DT"
デフォルトのタブ間隔を 0.5 インチに戻します。
行分割は生じません。
.It ".HP" Op Ar indent
パラグラフを、ハンギングインデント (hanging indent) で始め、
以後の通常インデント幅を
.Ar indent
に設定します。このリクエストは強制的に行分割を引き起こします。
.Ar indent
が指定されない場合、通常インデント幅が使用されます。
.It ".I" Op Ar words
.Ar words
を斜体で印刷します。行分割は生じません。
引数が指定されない場合、次の行が処理の対象になります。
.It ".IB" Op Ar words
斜体とボールド体で交代しながら、
.Ar words
を結合します。行分割は生じません。
引数が与えられない場合、次の行が処理の対象になります。
.It ".IP" Op Ar tag Op Ar indent
インデントされたパラグラフを、タグ
.Ar tag
を付けて始めます。
以後の通常インデント幅を
.Ar indent
に設定します。
.Ar tag
が指定されない場合、空文字列
.Qq ""
と見なされます。
.Ar indent
が指定されない場合、
通常インデント幅と見なされます。
.It ".IR" Op Ar words
斜体とローマン体で交代しながら、
.Ar words
を結合します。行分割は生じません。
引数が与えられない場合、次の行が処理の対象となります。
.It ".LP"
左整列 (left-aligned) パラグラフを開始します。
通常インデント幅はデフォルト値に設定されます。このリクエストは強制的に
行分割を引き起こします。
.It "\&.P"
\&.LP と同様に使用できる別名です。
.It ".PD" Op Ar distance
パラグラフ間の垂直間隔を
.Ar distance
に設定します。
.Ar distance
が指定されない場合、値 0.4v が使用されます。
.It ".PP"
\&.LP と同様に使用できる別名です。
.It ".RE"
相対インデント (以下の \&.RS を参照して下さい) を終了します。
このリクエストは強制的に行分割を引き起こし、
通常インデント値を以前の値に戻します。
.It ".RB" Op Ar words
ローマン体とボールド体で交代しながら、
.Ar words
を結合します。行分割は生じません。
引数が与えられない場合、次の行が処理の対象となります。
.It ".RI" Op Ar words
ローマン体と斜体で交代しながら、
.Ar words
を結合します。行分割は生じません。
引数が与えられない場合、次の行が処理の対象となります。
.It ".RS" Op Ar indent
相対インデントを開始します。インデント幅を
.Ar indent
だけ増加させます。
引数
.Ar indent
が指定されない場合、通常インデント幅の値が使用されます。
.It ".SB" Op Ar words
フォントサイズを 1 ポイント減らしてからボールド体を用いて
.Ar words
を印刷します。行分割は生じません。引数が指定されない場合、
次の行が処理の対象となります。
.It ".SH" Op Ar words
セクション先頭文字列 (section heading) を指定します。このリクエストは
強制的に行分割を引き起こします。また、通常インデント幅とマージンを
デフォルト値にリセットします。
.It ".SM" Op Ar words
フォントサイズを 1 ポイント減らしてから
.Ar words
を印刷します。行分割は生じません。引数が指定されない場合、
次の行が処理の対象となります。
.It ".SS" Op Ar words
セクション副先頭文字列 (section subheading) を指定します。このリクエストは
強制的に行分割を引き起こします。引数が与えられない場合、次の行が
処理の対象となります。このリクエストは、通常インデント幅とマージンを
デフォルト値に戻します。
.It ".TH" Ar name Ar section Ar date Xo
.Op Ar footer Op Ar center
.Xc
セクション
.Ar section
に属するリファレンスページ
.Ar name
を開始します。
第 3 引数
.Ar date
は、最近の変更日付です。
.Ar footer
が存在する場合、
これは左ページのフッタテキストを指定します。さらに、
.Ar center
が存在する場合、
これはページ中央のヘッダテキストを指定します。このリクエストは、
マニュアルページのまさに最初のリクエストでなければなりません。
.It ".TP" Op Ar indent
次の行のテキストで指定するタグを持つタグ付きインデント状態のパラグラフを
開始します。引数
.Ar indent
が指定されると、これは通常インデント幅の新しい値を指定します。
このリクエストは強制的に行分割を引き起こします。
.El
.Sh ページ構造
マニュアルページのほとんどは、以下に説明する概略に従うことが一般的です。
.Bl -tag -width ".SH 名称"
.It ".TH" Ar title Op Ar section-number
マニュアルページの最初のマクロリクエストは、\&.TH である必要があります。
このリクエストは、そのマニュアルページのタイトルと名称を確定します。
\&.TH リクエストは、マニュアルページのセクション番号も確定します。
.It ".SH NAME"
コマンドを呼び出す際の名前、または名前のリストを置き、その後ろにダッシュ
.Pq Dq -
とコマンドの動作の要約を一行で続けます。このセクションには
.Nm troff
コマンド、エスケープシーケンス、マクロリクエストを一切置いてはいけません。
このセクションは
.Xr whatis 1
コマンドが使用するデータベースを生成するために使用されます。
.It ".SH SYNOPSIS"
説明するコマンドや関数の用法の簡単な要約を書きます。
.Bl -tag -width "Commands"
.It コマンド
コマンドと引数の構文を、コマンド行で入力するように記述します。その通りに
入力しなければならない単語はボールドフェースで表します。引数は斜体で
表します。このように引数とコマンド名を表す場合、たとえ文の始まりで
あっても、大文字にしてはいけません。
.Pp
構文上のシンボルとして使用するものはローマン体で表さねばなりません。
.Bl -tag -width "XXX"
.It "[]"
角括弧は、オプション扱いの引数を表す際に使用します。
.It "|"
垂直バーは複数から一つの排他的選択を表す際に使用します。垂直バーで区切った
リストの中の項目一つだけを選択すべきということです。
.It "..."
引数の後ろに省略符号を続ける場合、その引数が繰り返し指定可能で
あることを表します。中括弧で囲んだ式の後ろに省略符号を続ける場合、
その式が繰り返し指定可能であることを表します。
.El
.It 関数
データの宣言もしくは
.Li "#include"
指示子を最初に置くことが必要です。その後ろに関数宣言を置きます。
.El
.It ".SH DESCRIPTION"
コマンドや関数の外部挙動の概要を記述します。そこには、ファイルや
データとの相互作用、標準入力、標準出力、標準エラー出力がどのように
扱われるかが含まれます。普通、内部挙動や実装の詳細をここでは示しません。
このセクションで解くべき疑問は、「これはなにをするのか?」もしくは、
「これは何のためのものか?」です。
.Pp
リテラルテキスト、ファイル名、リファレンスマニュアルの他の場所にある
項目への参照は、固定幅書体で表さねばなりません。引数は斜体を用いて
表さねばなりません。
.It ".SH OPTIONS"
オプションの一覧と、各オプションがコマンドの挙動にどういう
影響を与えるかの説明を一緒に与えます。
.It ".SH USAGE"
このセクションはオプションであり、サブコマンドの詳細な説明や、その
コマンドが理解する入力の文法を含めます。
.It ".SH RETURN VALUES"
あるライブラリルーチンが呼び出し元へ返しうる戻り値の一覧と、それらの
値が返る原因となる条件を記述します。
.It ".SH EXIT STATUS"
.\" WORD: exit status		終了状態
そのコマンドが終了状態 (exit status) として返す値の一覧と、それらの
値が返る原因となる条件を記述します。
.It ".SH FILES"
そのコマンドや関数に関連するファイルの一覧です。
.It ".SH SEE ALSO"
関連マニュアルページの一覧に続けて、他の刊行物への参照の一覧を、
コンマで区切って並べます。
.It ".SH DIAGNOSTICS"
診断メッセージと対応する説明の一覧です。
.It ".SH BUGS"
既知の障害や使用上の制限があれば、それを記述します。
.El
.Sh 関連ファイル
.Bl -tag -width "/usr/share/lib/tmac/tmac.groff_an"
.It "/usr/share/lib/tmac/tmac.an"
.Nm
パッケージを定義する初期ファイル。
.It "/usr/share/lib/tmac/tmac.groff_an"
マクロ定義のための
.Nm groff
のソース。
.It "/usr/share/lib/tmac/man.local"
.Nm
パッケージに対するローカルな変更。
.El
.Sh 関連項目
.Xr apropos 1 ,
.Xr groff 1 ,
.Xr man 1 ,
.Xr nroff 1 ,
.Xr troff 1 ,
.Xr whatis 1 ,
.Xr mdoc 7 ,
.Xr mdoc.samples 7
.Sh 歴史
このマニュアルページは
.An "Joseph Koshy"
.Ad Aq jkoshy@freebsd.org
によって記述されました。
.Sh 訳注
この日本語訳マニュアルページにおけるセクションタイトルの英和対応は次の
とおりです。
.Bl -column "RETURN VALUES" "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX" -offset indent
.It Em 英文 Ta Em 和訳
.It NAME Ta 名称
.It SYNOPSIS Ta 書式
.It DESCRIPTION Ta 解説
.It OPTIONS Ta オプション
.It USAGE Ta 使用例
.It RETURN VALUES Ta (返し値)
.It EXIT STATUS Ta (終了ステータス)
.It FILES Ta 関連ファイル
.It SEE ALSO Ta 関連項目
.It DIAGNOSTICS Ta 診断
.It BUGS Ta バグ
.El
.\"ZZZ: 3.0-19990129-SNAP by Norihiro Kumagai
