freebsd/freebsd-doc/ja_JP.eucJP/man/man7/mmroff.7
.\"
.\" %Id: mmroff.man,v 1.2 2000/02/21 20:32:58 jhaegg Exp %
.\" jpman %Id: mmroff.7,v 1.3 2001/02/06 03:23:45 horikawa Stab %
.\"
.TH MMROFF 7 "7 December 2000" "Groff Version 1.16.1"
.SH 名称
mmroff \- 参照のプリプロセッサ
.SH 書式
.B mmroff
[
.I -x
]
.I groff_arguments
.SH 解説
\fBmmroff\fP は、\fBgroff\fP 用の単純なプリプロセッサです。
これは、\fBmm\fP マクロにおいて参照を展開するために使用されます。
\fBgroff_mm(7)\fP を参照してください。
\fBgroff\fP は 2 度実行されます。1 回目では \fB-z\fP および
\fB-rRef=1\fR オプションつきで実行され、すべての参照を収集し、
そして、参照ファイルが最新のものになってから実際の参照の処理を
行います。
.TP
\fB\-x\fR
参照ファイルを作るだけです。このオプションは参照ファイルを
更新するのに使用できますが、正しい参照を作るために必要な
処理とは限りません。また、このオプションを使用すると、
\fBgroff\fP は 1 回だけ実行されます。
.\".SH BUGS
.SH 作者
J\(:orgen H\(:agg, Lund, Sweden <jh@axis.se> です。
.SH 関連ファイル
.TP
.B /usr/share/tmac/tmac.m
.TP
.B /usr/share/tmac/mm/*.cov
.TP
.B /usr/share/tmac/mm/*.MT
.TP
.B /usr/share/tmac/mm/locale
.SH "関連項目"
.BR groff_mm(7),
.BR groff_mmse(7),
.BR groff (1),
.BR troff (1),
.BR tbl (1),
.BR pic (1),
.BR eqn (1)
.br
.BR mm (7)
.BR mmse (7)
