freebsd/freebsd-doc/ja_JP.eucJP/man/man7/operator.7
.\" Copyright (c) 1989, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)operator.7	8.1 (Berkeley) 6/9/93
.\" %FreeBSD: src/share/man/man7/operator.7,v 1.5 2003/01/22 15:19:07 fanf Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 9, 1993
.Dt OPERATOR 7
.Os
.Sh 名称
.Nm operator
.Nd C 言語の演算子の優先順位および評価の順序
.Sh 書式
.Bd -ragged -offset indent -compact
.Bl -column "\&= += -= *= /= %= <<= >>= &= ^= |="
.It Sy "演算子 	 結合の順序"
.It "--------	------------"
.It "\&() [] -> .	左から右へ"
.It "! ~ ++ -- - (type) * & sizeof	右から左へ"
.It "\&* / %	左から右へ"
.It "\&+ -	左から右へ"
.It "\&<< >>	左から右へ"
.It "\&< <= > >=	左から右へ"
.It "\&== !=	左から右へ"
.It "\&&	左から右へ"
.It "\&^	左から右へ"
.It "\&|	左から右へ"
.It "\&&&	左から右へ"
.It "\&||	左から右へ"
.It "\&?:	右から左へ"
.It "\&= += -= *= /= %= <<= >>= &= ^= |=	右から左へ"
.It "\&,	左から右へ"
.El
.Ed
.Sh 関連ファイル
.Bl -tag -width /usr/share/misc/operator -compact
.It Pa /usr/share/misc/operator
.El
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 99-1-21
