freebsd/freebsd-doc/ja_JP.eucJP/man/man7/symlink.7
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)symlink.7	8.3 (Berkeley) 3/31/94
.\" %FreeBSD: src/bin/ln/symlink.7,v 1.8.2.4 2000/03/03 14:58:52 sheldonh Exp %
.\"
.\" jpman %Id: symlink.7,v 1.5 1999/01/21 17:50:41 kuma Stab %
.\"
.\" WORD: dereference	手繰る
.\" WORD: traverse	たどる
.Dd March 31, 1994
.Dt SYMLINK 7
.Os BSD 4
.Sh 名称
.Nm symlink
.Nd シンボリックリンクの扱い
.Sh シンボリックリンクの扱い
シンボリックリンクは、他のファイルへのポインタとして働くファイルです。
動作を理解するためには、ハードリンクの動作を理解する必要があります。
ファイルへのハードリンクは元のファイルとは区別できません。
なぜなら、ハードリンクは元のファイル名の下敷きとなるオブジェクトを
参照するからです。
ファイルに対する変更は、ファイルを参照するために使用する名前には依存しません。
ハードリンクは、ディレクトリを参照してはなりませんし、
他のファイルシステム上のファイルを参照してもなりません。
シンボリックリンクは、リンクされたファイルの名前を格納します。
すなわち、他の名前へのポインタです。
下敷きとなるオブジェクトを参照するわけではありません。
このため、シンボリックリンクは、ディレクトリを参照することができますし、
ファイルシステムをまたがることが可能です。
.Pp
シンボリックリンクとこれが参照するオブジェクトは
ファイルシステムの名前空間において共存しますので、
リンク自身と参照されるオブジェクトの区別に関して混乱が生じることがあります。
歴史的には、コマンドおよびシステムコールは、
場当たり的にそれぞれ独自のリンク追跡規則を採用してきました。
このシステムに実装されている、統一的なアプローチの規則をここに示します。
ユーザインタフェースをできる限り一貫性あるものとするために、
ローカルアプリケーションもまたこの規則を守ることが重要です。
.Pp
シンボリックリンクの操作は、リンク自身への操作、
もしくはリンクによって参照されるオブジェクトへの操作によって実現されます。
後者の場合、アプリケーションまたはシステムコールがリンクを
.Dq 追跡 (follow)
したと言います。
シンボリックリンクは他のシンボリックリンクを参照することができます。
この場合、シンボリックリンクではないオブジェクトが見付かるか、
存在しないファイルを参照するシンボリックリンクが見付かるか、
ループが検出されるまで、
リンクが手繰られます。
(ループ検出は、追跡可能なリンク数の上限を設定することにより実現されます。
この制限を超過する場合にはエラーとなります。)
.Pp
議論すべき領域で異なるものが 3 つあります。それらは次の通りです:
.sp
.Bl -enum -compact -offset indent
.It
システムコールのファイル名引数として使用されるシンボリックリンク。
.It
ファイルツリーをたどらないユーティリティの
コマンドライン引数として指定されるシンボリックリンク。
.It
ファイルツリーをたどる (traverse) ユーティリティが扱うシンボリックリンク
(コマンドラインで指定されるもの、
およびファイル階層をたどるときに出会うものの両方です)。
.El
.Ss システムコール
最初の領域は、
システムコールのファイル名引数として使用されるシンボリックリンクです。
.Pp
次の例外を除き、全システムコールはシンボリックリンクを追跡します。
例えば、
.Dq Li afile
という名前のファイルを指すシンボリックリンク
.Dq Li slink
が存在する場合、システムコール
.Dq Li open("slink" ...)
はファイル
.Dq afile
のファイルディスクリプタを返します。
.Pp
リンクを追跡せずに、シンボリックリンク自身を操作するシステムコールが
5 つあります。
それらは次の通りです:
.Xr lchown 2 ,
.Xr lstat 2 ,
.Xr readlink 2 ,
.Xr rename 2 ,
.Xr unlink 2
。
.Xr remove 3
は
.Xr unlink 2
の別名ですから、これもまたシンボリックリンクを追跡しません。
.Pp
既存のシンボリックリンクの所有者およびグループの変更は、
.Xr lchown 2
システムコールにて可能です。
他のファイル属性、例えば修正時刻やアクセスパーミッションは、
システムが使用しませんし、変更不能です。
.Pp
.Bx 4.4
システムは歴史的な 4BSD システムとは異なり、システムコール
.Xr chown 2
がシンボリックリンクを追跡するように変更されました。
後になって、新しい
.Xr chown 2
の制限が明らかになると、
.Xr lchown 2
システムコールが追加されました。
.Ss ファイルツリーをたどらないコマンド
第 2 の領域は、
ファイルツリーをたどらないコマンドに対する
コマンドラインのファイル名引数として指定されるシンボリックリンクです。
.Pp
下に述べる例外を除き、コマンドは、
コマンドライン引数として指定されるシンボリックリンクを追跡します。
例えば、
.Dq Li afile
という名前のファイルを指すシンボリックリンク
.Dq Li slink
が存在する場合、コマンド
.Dq Li cat slink
はファイル
.Dq afile
の内容を表示します。
.Pp
この規則は、ファイルツリーをたどることもできるコマンドも含みます。
これを認識することが重要です。
例えば、コマンド
.Dq Li "chown file"
はこの規則に含まれますが、コマンド
.Dq Li "chown -R file"
は含まれません。
(後者は第 3 の領域で後述します。)
.Pp
コマンドがシンボリックリンクを追跡するのではなく
シンボリックリンク自身を操作する
ことが明示的に意図されている場合、
例えば
.Dq Li "chown slink"
が、シンボリックリンクであるか否かにかかわらず、
.Dq Li slink
自身の所有者を変更したい場合、
.Fl h
オプションを使用します。
先の例では、
.Dq Li "chown root slink"
は
.Dq Li slink
が参照するファイルの所有者を変更しますが、
.Dq Li "chown -h root slink"
は
.Dq Li slink
自身の所有者を変更します。
.Pp
この規則には 4 つの例外があります。
.Xr mv 1
および
.Xr rm 1
のコマンドは、引数として指定されるシンボリックリンクを追跡せずに、
それぞれシンボリックリンク自身を改名したり削除しようとします。
(シンボリックリンクがファイルを相対パスで指定する場合、
シンボリックリンクを他のディレクトリに移動してしまうと、
パスが正しくなくなってしまいますので、
追跡できなくなります。)
.Pp
.Xr ls 1
コマンドもまたこの規則の例外です。
歴史的なシステムとの互換性のために (
.Nm ls
がツリーをたどらない場合、すなわち
.Fl R
オプションが指定されない場合)、
.Fl H ,
.Fl L
オプションが指定されるか
.Fl F ,
.Fl d ,
.Fl l
オプションが指定されない場合、
.Nm ls
コマンドは引数として指定されたシンボリックリンクを追跡します。(
ファイルツリーをたどらない場合にも、
.Fl H ,
.Fl L
オプションが動作に影響を与えるコマンドは
.Nm ls
だけです。)
.Pp
.Xr file 1
コマンドもまたこの規則の例外です。
.Xr file 1
コマンドは、引数として指定されるシンボリックリンクを、
デフォルトでは追跡しません。
.Fl L
オプションが指定されると、
.Xr file 1
コマンドは引数として指定されるシンボリックリンクを追跡します。
.Pp
.Bx 4.4
システムは歴史的な 4BSD システムとは異なり、
.Nm chown ,
.Nm chgrp
のコマンドがコマンドラインに指定されたシンボリックリンクを追跡します。
.Ss ファイルツリーをたどるコマンド
次のコマンドは、オプションとしてまたは常にファイルツリーをたどります:
.Xr chflags 1 ,
.Xr chgrp 1 ,
.Xr chmod 1 ,
.Xr cp 1 ,
.Xr du 1 ,
.Xr find 1 ,
.Xr ls 1 ,
.Xr pax 1 ,
.Xr rm 1 ,
.Xr tar 1 ,
.Xr chown 8
。
.Pp
ファイルシステムをたどるときに出会うシンボリックリンクおよび
コマンドライン引数として指定されるシンボリックリンクに対し、
次の規則が等しく適用されることを認識することが重要です。
.Pp
最初の規則は、
ディレクトリ型ではない
ファイルを参照するシンボリックリンクに対して適用されます。
シンボリックリンクに対して適用される操作は、
リンク自身に対してなされますが、
そうでない場合にはリンクは無視されます。
.Pp
例えば、コマンド
.Dq Li "chown -R user slink directory"
は
.Dq Li slink
を無視します。
なぜなら本システムにおけるシンボリックリンクは所有者を持たないためです。
ツリーをたどるときに出会うシンボリックリンクもまた無視されます。
コマンド
.Dq Li "rm -r slink directory"
は
.Dq Li slink
を削除し、
.Dq Li directory
のツリーをたどるときに出会うシンボリックリンクもまた削除します。
なぜなら、シンボリックリンクは削除可能であるためです。
いかなる場合も、
.Dq Li slink
が参照するファイルに
.Nm chown
および
.Nm rm
が影響することはありません。
.Pp
第 2 の規則は、
タイプがディレクトリであるファイルを参照するシンボリックリンクに適用されます。
デフォルトでは、
タイプがディレクトリであるファイルを参照するシンボリックリンクは
.Dq 追跡
されません。
これはしばしば
.Dq 物理
探索と呼ばれ、
.Dq 論理
探索 (ディレクトリを参照するシンボリックリンクが追跡される場合です)
の対極に位置します。
.Pp
可能な限り一貫性を持たせるため、
シンボリックリンクが参照するファイルのタイプに依存せずに、
ファイルツリーをたどるコマンドに
コマンドラインで指定されるシンボリックリンクを追跡させるためには、
.Fl H 
.Pf ( Dq 半論理 )
フラグを指定します。
このフラグは、
コマンドラインの名前空間を論理的な名前空間とすることを意図しています。
(注: 常にファイルツリーをたどるわけではないコマンドにおいては、
.Fl R
フラグも指定されていない場合には、
.Fl H
フラグは無視されます。)
.Pp
例えば、コマンド
.Dq Li "chown -HR user slink"
は、
.Dq Li slink
で指されるファイルを根とするファイル階層をたどります。
注:
.Fl H
は、以前議論した
.Fl h
フラグとは同じではありません。
.Fl H
フラグは、
実行される操作およびファイルツリーをたどるときの両方において、
コマンドラインで指定されるシンボリックリンクを手繰るようにします。
これにより、シンボリックリンクが指すファイルの名前を、
ユーザが指定したかのようになります。
.Pp
可能な限り一貫性を持たせるため、
シンボリックリンクが参照するファイルのタイプに依存せずに、
ファイルツリーをたどるコマンドに
コマンドラインで指定されるシンボリックリンクだけでなく
ファイルツリーをたどっているときに出会うシンボリックリンクも
追跡させるためには、
.Fl L
.Pf ( Dq 論理 )
フラグを指定します。
このフラグは、
すべての名前空間を論理的な名前空間とすることを意図しています。
(注: 常にファイルツリーをたどるわけではないコマンドにおいては、
.Fl R
フラグも指定されていない場合には、
.Fl L
フラグは無視されます。)
.Pp
例えば、コマンド
.Dq Li "chown -LR user slink"
は、
.Dq Li slink
で指されるファイルの所有者を変更します。
.Dq Li slink
がディレクトリを参照する場合、
.Nm chown
は
.Dq Li slink
で指されるディレクトリを根とするファイル階層をたどります。
さらに、
.Nm chown
がたどるファイルツリーの中でシンボリックリンクに出会うと、
そのシンボリックリンクは
.Dq Li slink
と同じ方法で扱われます。
.Pp
可能な限り一貫性を持たせるため、
デフォルトの動作を指定するには、
.Fl P
.Pf ( Dq 物理 )
フラグを指定します。
このフラグは、
名前空間全体を物理的な名前空間のように見せるためのものです。
.Pp
デフォルトでファイルツリーをたどらないコマンドにおいては、
.Fl R
もまた指定しない場合には、
.Fl H ,
.Fl L ,
.Fl P
フラグは無視されます。
また、
.Fl H ,
.Fl L ,
.Fl P
オプションは複数回指定可能です。
この場合、最後に指定したものがコマンドの動作を指定します。
ある動作を行うようにコマンドをエイリアスし、
それをコマンドラインで上書きできるようにすることを意図しています。
.Pp
.Xr ls 1
と
.Xr rm 1
のコマンドは、これらの規則において例外を持ちます。
.Nm rm
コマンドはシンボリックリンクを操作し、
シンボリックリンクが参照するファイルを操作しません。
また、シンボリックリンクを追跡しません。
.Nm rm
コマンドは
.Fl H ,
.Fl L ,
.Fl P
のオプションをサポートしません。
.Pp
歴史的なシステムとの互換性を維持するために、
.Nm ls
コマンドは少し異なる挙動を示します。
.Fl F,
.Fl d,
.Fl l
オプションのいずれも指定しない場合、
.Nm ls
コマンドは、コマンド行で指定したシンボリックリンクを追跡します。
.Fl L
フラグが指定されると、シンボリックリンクのタイプにかかわらず、
またコマンドラインで指定されたのかファイルツリーをたどる途中に
出会ったのにかもかかわらず、
.Nm ls
は全シンボリックリンクを追跡します。
.Sh 関連項目
.Xr chflags 1 ,
.Xr chgrp 1 ,
.Xr chmod 1 ,
.Xr cp 1 ,
.Xr du 1 ,
.Xr find 1 ,
.Xr ln 1 ,
.Xr ls 1 ,
.Xr mv 1 ,
.Xr pax 1 ,
.Xr rm 1 ,
.Xr tar 1 ,
.Xr lchown 2 ,
.Xr lstat 2 ,
.Xr readlink 2 ,
.Xr rename 2 ,
.Xr symlink 2 ,
.Xr unlink 2 ,
.Xr fts 3 ,
.Xr remove 3 ,
.Xr chown 8
.\"ZZZ: 3.0-RELEASE compliant by N. Kumagai 99-1-21
