<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-8.sgml,v 1.1 2006/03/13 21:09:20 blackend Exp $">
<!ENTITY title "Le Projet FreeBSD lance FreeBSD 6.0">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.1
-->

<html>
&header;

<h3>FreeBSD place haut la barre des syst&egrave;mes d'exploitation
  libres.</h3>

  <p>D&Eacute;COLLAGE IMM&Eacute;DIAT<br>
    Berkeley, CA 4 Novembre 2005</p>

  <p>Le Projet FreeBSD annonce la disponibilit&eacute; de FreeBSD 6.0,
    un syst&egrave;me d'exploitation libre d&eacute;riv&eacute; de
    UNIX BSD, qui offre une alternative puissante &agrave; Linux,
    Solaris et Windows.  FreeBSD permet aux entreprises d'utiliser des
    technologies libres qui se concentrent sur la fiabilit&eacute;, la
    s&eacute;curit&eacute;, et la mont&eacute;e en charge.</p>

  <p>"Yahoo! est impressionn&eacute; par la performance et la
    stabilit&eacute; de FreeBSD 6.0," d&eacute;clare David Filo,
    cofondateur de Yahoo!.  Yahoo! est l'une des nombreuses
    entreprises qui comptent sur la stabilit&eacute; et la performance
    mondialement connues du syst&egrave;me FreeBSD.</p>

  <p>Une des avanc&eacute;es majeures de FreeBSD 6.0 est un
    syst&egrave;me de fichiers multithread&eacute;, qui
    am&eacute;liore consid&eacute;rablement les temps d'acc&egrave;s
    aux disques locaux, aux configurations RAID, aux syst&egrave;mes
    de fichiers r&eacute;seau, et aux SANs.  Des tests de performance
    r&eacute;cents montrent que FreeBSD 6.0 d&eacute;passe Linux en
    d&eacute;bit de donn&eacute;es brutes.</p>

  <p>De plus, FreeBSD 6.0 apporte le support de
    p&eacute;riph&eacute;riques sans fil comme Intel Centrino et
    rajoute le support du protocole de s&eacute;curit&eacute; sans fil
    WPA.  Plusieurs am&eacute;liorations ont &eacute;t&eacute;
    apport&eacute;es au NDISulator, un composant du syst&egrave;me
    d'exploitation qui permet aux pilotes r&eacute;seau Windows de
    fonctionner nativement sous FreeBSD.</p>

  <p>FreeBSD est maintenant beaucoup plus efficace sur des
    syst&egrave;me multiprocesseurs.  Le support de 8 processeurs ou
    plus, comme les nouvelles configurations dual core AMD Opteron,
    donne aux utilisateurs une alternative viable aux solutions plus
    ch&egrave;res bas&eacute;es sur les mat&eacute;riels et
    syst&egrave;mes d'exploitation propri&eacute;taires d'IBM, HP et
    Sun.</p>

<h3>&Agrave; propos du Projet FreeBSD</h3>

  <p>Le Projet FreeBSD fournit un syst&egrave;me d'exploitation libre
    pour diff&eacute;rentes architectures, comprenant Intel x86 et
    AMD64.  FreeBSD est d&eacute;riv&eacute; de la version d'UNIX
    d&eacute;velopp&eacute;e &agrave; Berkeley UC.  La licence BSD
    permet la modification et la redistribution de logiciels tout en
    permettant &agrave; un individu ou &agrave; une entreprise de
    pr&eacute;server sa propri&eacute;t&eacute; intellectuelle.</p>

  <p>Pour plus d'information, veuillez visiter <a
    href="http://www.FreeBSD.org/fr/">www.FreeBSD.org/fr/</a>.</p>

<h3>Contact pour la presse</h3>

  <p>Pour des entretiens ou plus d'information, contactez: <a
    href="mailto:marketing@FreeBSD.org">marketing@FreeBSD.org</a>,
    +1-408-943-4100 ext 113; ou la Fondation FreeBSD,
    +1-720-207-5142</p>

&footer;
</body>
</html>
