<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-5.sgml,v 1.4 2005/10/06 12:56:05 blackend Exp $">
<!ENTITY title "Communiqu&eacute; de presse FreeBSD : 18 Octobre 2000">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.6

   Version francaise : Frederic Haby
-->

<html>
&header;

<p></p>

<h3>Election d'une nouvelle &eacute;quipe dirigeante ("Core Team")</h3>

<p><b>Conf&eacute;rence BSD, Monterey, Californie, 18 Octobre 2000</b> - Le Projet FreeBSD
a annonc&eacute; aujourd'hui l'&eacute;lection d'une nouvelle &eacute;quipe dirigeante. C'est la premi&egrave;re
fois que cette &eacute;quipe est choisie parmi les d&eacute;veloppeurs gr&acirc;ce &agrave; une &eacute;lection. Les
nouveaux membres sont Greg Lehey, Warner Losh, Mike Smith et Robert
Watson. Les membres r&eacute;-&eacute;lus sont Satoshi Asami, David Greenman, Jordan
Hubbard, Doug Rabson et Peter Wemm.</p>

<p>Jordan Hubbard, co-fondateur du Projet FreeBSD et membre r&eacute;-&eacute;lu, s'est
dit tr&egrave;s satisfait des r&eacute;sultats : <cite>"Pour la premi&egrave;re fois
depuis que le projet FreeBSD existe, des &eacute;lections ouvertes ont d&eacute;termin&eacute;
la composition de l'&eacute;quipe dirigeante. Cela place un important pr&eacute;c&eacute;dent
o&ugrave; tous les d&eacute;veloppeurs peuvent d&eacute;sormais faire partie de la direction
du projet"</cite>. La nouvelle &eacute;quipe dirigeante repr&eacute;sente aussi tr&egrave;s bien
la diversit&eacute; et la grande comp&eacute;tence des d&eacute;veloppeurs de par le monde avec
une expertise allant des syst&egrave;mes de fichier RAID et du d&eacute;veloppement de gestionnaire
de p&eacute;riph&eacute;riques &agrave; la s&eacute;curit&eacute;.</p>

<p>Les nouveaux membres de l'&eacute;quipe dirigeante ont &eacute;t&eacute; &eacute;lus parmi et par les
d&eacute;veloppeurs FreeBSD qui ont un acc&egrave;s direct au code source et qui r&eacute;alisent la
majeure partie du d&eacute;veloppement logiciel. Jusqu'&agrave; pr&eacute;sent,
l'&eacute;quipe dirigeante se choisissait elle-m&ecirc;me en donnant une direction
technique et administrative.</p>

<p>Cet &eacute;t&eacute;, les d&eacute;veloppeurs ont vot&eacute; pour passer &agrave; un mod&egrave;le d&eacute;mocratique permettant
au projet de s'adapter aux exigences du d&eacute;veloppement de la communaut&eacute; des syst&egrave;mes
d'exploitation en source libre. Cependant, avec plus de la moiti&eacute; des membres
de la pr&eacute;c&eacute;dente &eacute;quipe r&eacute;-&eacute;lus, une grande continuit&eacute; existe.</p>

<p>Poul-Henning Kamp, ancien membre de l'&eacute;quipe dirigeante, a d&eacute;clar&eacute; : <cite>"Je
suis tr&egrave;s fier de ce que nous avons fait ensemble dans cette &eacute;quipe durant les
8 derni&egrave;res ann&eacute;es. La nouvelle &eacute;quipe, et le fait qu'elle a &eacute;t&eacute; &eacute;lue par les
d&eacute;veloppeurs, signifie que le projet sera beaucoup plus r&eacute;actif aux
changements dans le futur"</cite>.</p>

<p>Le changement dans la direction du projet se fait sans aucune rancune,
pr&eacute;cise Kamp : tous les anciens membres de l'&eacute;quipe vont continuer &agrave; participer
au projet en mettant l'accent sur le d&eacute;veloppement, <cite>"D&eacute;sormais, je vais passer plus
de temps sur le code source de FreeBSD plut&ocirc;t que sur la gestion du projet"</cite>.</p>

<h3>Les membres &eacute;lus</h3>

<p><b>Satoshi Asami</b> est un co-fondateur et le directeur technique de la soci&eacute;t&eacute; DecorMagic et est
charg&eacute; des ports FreeBSD.</p>

<p><b>David Greenman</b> est un co-fondateur du Projet FreeBSD et est actuellement
le pr&eacute;sident de la soci&eacute;t&eacute; TeraSolutions, une compagnie qui fabrique des serveurs Internet
et des syst&egrave;mes de stockage RAID.</p>

<p><b>Jordan Hubbard</b> est un co-fondateur du Projet FreeBSD ainsi que le charg&eacute;
des relations publiques et l'ing&eacute;nieur g&eacute;rant la sortie des diff&eacute;rentes versions de FreeBSD. Il est
&eacute;galement le vice-pr&eacute;sident pour les solutions en source libre chez BSDi.</p>

<p><b>Greg Lehey</b> est un chercheur dans le domaine des logiciels en source libre avec Linuxcare. Il a pass&eacute;
la plupart de sa carri&egrave;re professionnelle en Allemagne o&ugrave; il a travaill&eacute; pour
des fabricants d'ordinateurs tels que Univac, Tandem et Siemens-Nixdorf.
Il est l'auteur du gestionnaire de volume Vinum et du RAID logiciel pour
FreeBSD, a particip&eacute; au projet FreeBSD SMPng et est l'auteur de
"Port des logiciels sous Unix" et de "Tout sur FreeBSD".</p>

<p><b>Warner Losh</b> a port&eacute; le code pccard de NetBSD sur FreeBSD et a
&eacute;t&eacute; l'officier de s&eacute;curit&eacute; FreeBSD durant les deux derni&egrave;res ann&eacute;es.</p>

<p><b>Doug Rabson</b> est un co-fondateur de la soci&eacute;t&eacute; Qube Software qui est sp&eacute;cialis&eacute;
dans les technologies de graphismes 3D. Son travail sur FreeBSD inclu notamment les ports
sur alpha et ia64 et il a &eacute;t&eacute; le principal architecte pour l'organisation des gestionnaires
de p&eacute;riph&eacute;riques sous FreeBSD.</p>

<p><b>Mike Smith</b> est ing&eacute;nieur principal dans le groupe Solutions en Source Libre chez BSDi
et a &eacute;t&eacute; actif parmi la communaut&eacute; des d&eacute;veloppeurs FreeBSD en tant que d&eacute;veloppeur de
ressources, en assurant la liaison avec les OEM et parfois en tant qu'architecte et auteur
de gestionnaires de p&eacute;riph&eacute;riques.</p>

<p><b>Robert Watson</b> est chercheur au laboratoire NAI et travaille sur la s&eacute;curit&eacute; des r&eacute;seaux
et des syst&egrave;mes d'exploitation. Ses contributions au projet
FreeBSD incluent son travail sur les extensions de s&eacute;curit&eacute;
(<a href="http://www.trustedbsd.org">TrustedBSD</a>),
l'architecture pour la s&eacute;curit&eacute; et sa participation dans l'&eacute;quipe de l'officier de s&eacute;curit&eacute;.</p>

<p><b>Peter Wemm</b> a &eacute;t&eacute; impliqu&eacute; dans le projet FreeBSD depuis les premiers jours de
l'industrie des fournisseurs d'acc&egrave;s Internet en Australie et a depuis d&eacute;m&eacute;nag&eacute; aux Etats-Unis pour
travailler en tant qu'ing&eacute;nieur logiciel chez Yahoo! Son implication dans FreeBSD
inclu la gestion du code source et le d&eacute;veloppement du noyau.</p>

<h3>A propos de FreeBSD</h3>

<p>FreeBSD est un syst&egrave;me d'exploitation open-source sous licence libre dont
l'origine remonte &agrave; BSD Net/2 et 4.4 Lite, les Distributions Logiciel de Berkeley
d&eacute;velopp&eacute;es &agrave; l'Universit&eacute; de Californie, Berkeley jusqu'en 1994. Il
est d&eacute;velopp&eacute; et maintenu par un groupe de participants r&eacute;mun&eacute;r&eacute;s ou
b&eacute;n&eacute;voles. FreeBSD se distingue par ses hautes
performances r&eacute;seaux et par son syst&egrave;me de fichiers et il est largement utilis&eacute;
chez les fournisseurs d'acc&egrave;s Internet, y compris chez des soci&eacute;t&eacute;s aussi renomm&eacute;es
que <b>Yahoo!</b>, <b>above.net</b>,
et <b>Verio</b>. FreeBSD est &eacute;galement
fr&eacute;quemment utilis&eacute; en tant que plate-forme pour les syst&egrave;mes embarqu&eacute;s avec fonctions r&eacute;seaux
dans des produits propos&eacute;s par <b>IBM</b>, <b>Inktomi</b>, <b>Juniper Networks</b>,
et <b>Network Alchemy - une soci&eacute;t&eacute; appartenant &agrave; Nokia</b>.</p>

<p>Pour plus d'informations, vous pouvez consulter
<a href="http://www.FreeBSD.org">http://www.FreeBSD.org/</a>.</p>

<h3>Contact pour la presse</h3>

<p>Jordan Hubbard<br>
The FreeBSD Project<br>
925-682-7859<br>
<a href="mailto:jkh@FreeBSD.org">jkh@FreeBSD.org</a></p>

<h3># # #</h3>

<p>BSD est une marque d&eacute;pos&eacute;e de Berkeley Software Design, Inc. Les autres
  marques appartiennent &agrave; leurs propri&eacute;taires respectifs. Les technologies BSD ont
  &eacute;t&eacute; &agrave; l'origine d&eacute;velopp&eacute;es par l'Universit&eacute; de Californie, Berkeley et ses
  collaborateurs.</p>

&footer;
</body>
</html>
