<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/fr/news/sou1999.sgml,v 1.4 2005/10/06 12:56:05 blackend Exp $">
<!ENTITY title "FreeBSD, Etat de l'union, 1999">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.6

   Version francaise : Guillain
-->

<html>
    &header;

    <p><i>De Jordan Hubbard &lt;jkh@FreeBSD.ORG&gt;, dimanche 10 janvier 1999.</i></p>

    <p>Et bien les amis, une nouvelle ann&eacute;e vient de s'&eacute;couler et il est certainement grand temps
    de faire une mise au point sur l'&eacute;tat de notre union !</p>

    <p>Hum... Je ne sais pas tr&egrave;s bien comment aborder la chose car &agrave; chaque fois,
    je me rappelle un certain pr&eacute;sident des Etats-Unis, assis devant la chemin&eacute;e,
    essayant d'avoir l'air chaleureux et populaire, faire un &eacute;tat de la croissance du ma&iuml;s
    ou bien peut-&ecirc;tre la Reine d'Angleterre &agrave; no&euml;l donnant son habituelle
    allocution sombre-mais-optimiste sur ce qu'il est advenu de la Grande-Bretagne pendant
    l'ann&eacute;e et sur ce que chacun peut esp&eacute;rer de la suivante.
    Ces descriptions ne me ressemblent pas vraiment aussi vais-je
    couper court et m'int&eacute;resser aux le&ccedil;ons plus pertinentes (et
    objectives) que j'ai retenu pour l'ann&eacute;e 1998.</p>

    <p>1998 a &eacute;t&eacute;, bien s&ucirc;r, l'ann&eacute;e de forte croissance d'internet (pas
    de surprise), divers "internetpraneurs" (gag) se sont enrichis et
    la base des utilisateurs de FreeBSD, d'apr&egrave;s les statistiques de t&eacute;l&eacute;chargement ftp, a augment&eacute;
    &agrave; son rythme habituel de 200 &agrave; 300 %. D'autres entreprises sont entr&eacute;es dans l'ar&egrave;ne FreeBSD
    pour apporter soit des add-ons soit des solutions &agrave; base de FreeBSD et notre machine &agrave; relations publiques (RP),
    toujours aussi l&eacute;g&egrave;re et discr&egrave;te, continue d'ouvrir de nouvelles br&egrave;ches. Finalement, c'&eacute;tait une tr&egrave;s bonne ann&eacute;e
    pour FreeBSD et m&ecirc;me le plus parano&iuml;aque d'entre nous ne pense pas autrement -
    Microsoft s'en est pris plein la poire, nous avons progress&eacute; et sommes devenus
    un peu plus connus, la vie &eacute;tait belle.</p>

    <p>Bon, je quitte mes lunettes roses pendant une seconde et je peux aussi
    dire qu'il reste encore pas mal de cailloux sur la route et que certains travers
    inattendus ne nous ont pas toujours laiss&eacute; le contr&ocirc;le de la situation. Alors
    que les t&eacute;l&eacute;chargements se font de plus en plus nombreux, les ventes de c&eacute;d&eacute;roms n'en font pas autant,
    leur march&eacute; en g&eacute;n&eacute;ral souffrant de la d&eacute;mocratisation d'internet
    et leurs avantages fondamentaux s'&eacute;rodant. Nous avons quand m&ecirc;me poursuivi, consid&eacute;rant l'implosion
    progressive du march&eacute;, mais il serait idiot de continuer &agrave; compter uniquement sur le seul c&eacute;d&eacute;rom
    pour fournir les ressources qui ont solidement huil&eacute; les rouages du projet
    (nous avons, par exemple, plus que doubl&eacute; la taille du cluster informatique
     de FreeBSD.org et significativement &eacute;largi en 1998
     notre programme de donations d'&eacute;quipements pour les d&eacute;veloppeurs, toutes sortes de choses qui co&ucirc;tent
     de l'argent). Il est assez &eacute;vident que Walnut Creek CDROM devra augmenter
     l'offre de ses produits s'il veut rester un
     acteur important dans le secteur de FreeBSD et nous devons garder,
     en tant que projet, notre flexibilit&eacute; dans la recherche de relations
     avec des gens qui auraient des int&eacute;r&ecirc;ts dans le succ&egrave;s de FreeBSD. Le temps
     est pass&eacute; o&ugrave;, comme solution s&eacute;rieuse et "qui monte", nous pouvions faire ce qu'il
     y avait &agrave; faire en comptant uniquement sur les bonnes volont&eacute;s  et les
     b&eacute;n&eacute;voles isol&eacute;s.</p>

    <p>Dans cet esprit, des sites comme
    <a href="http://www.freebsdmall.com">La boutique FreeBSD</a>
    ont &eacute;t&eacute; mis en place afin de proposer des produits en relation avec FreeBSD
    et nous avons commenc&eacute; &agrave; explorer des partenariats avec diverses
    entreprises qui pourraient tirer profits des campagnes de relations publiques
    qui am&eacute;liorent la r&eacute;putation de FreeBSD (traduction : il faut qu'elles
    aident &agrave; payer :). Comme beaucoup de personnes l'ont pr&eacute;cis&eacute; am&egrave;rement,
    ce commerce est devenu une &eacute;quation &agrave; 10% de technologie et 90% de sensibilit&eacute;
    pour ce qui concerne la direction dans laquelle les gens se ruent, et
    n'aiment pas cette foule de petits moutons sans cervelles, mais vous devez
    malgr&eacute; tout comprendre leurs tendances et leurs comportements lorsqu'il
    s'agit de choses qu'ils ne comprennent pas vraiment. Nous avons
    fait du beau boulot technologiquement, vraiment (et nous pouvons en
    &ecirc;tre fiers), mais nous avons trop souvent laiss&eacute; tomber
    le probl&egrave;me de la sensibilit&eacute; et demand&eacute; aux gens de penser ce
    qu'ils voulaient. Mauvais techies ! Myopes techies ! :-)</p>

    <p>Que faire pour que cela change en 1999 ? Et bien, j'ai aussi entendu
    notre &eacute;quipe d'&eacute;vang&eacute;listes r&eacute;clamer du support logistique ("Des renforts ! Nous avons besoin
    de <em>renforts</em> ici !) et je l'ai &eacute;cout&eacute;, une partie de mon projet
    pour les ann&eacute;es &agrave; venir &eacute;tant d'avoir plus d'images de d&eacute;mons disponibles
    (ce que j'ai d&eacute;ja command&eacute;), d'avantage de revues avec diverses
    comparaisons ("FreeBSD et NT", "FreeBSD et Solaris",
    "FreeBSD et Linux", etc) et plus de bulletins d'informations pour le public.
    Nous pouvons aussi produire plus de produits marketing comme des boutons, des autocollants,
    de nouveaux tee-shirts, etc... pour donner aux gens un plus large choix de produits leur permettant de montrer fi&egrave;rement
    qu'ils supportent le "ph&eacute;nom&egrave;ne naissant FreeBSD". Si nous parvenons
    &agrave; disposer de plus d'argent pour les relations publiques, peut-&ecirc;tre pourrons-nous aussi acheter certains &eacute;l&eacute;ments
    en vrac afin de les utiliser comme cadeaux dans diverses actions promotionnelles. A part &ccedil;a,
    je suis toujours ouvert aux suggestions. Nous avons besoin de faire plus de relations publiques efficaces,
    c'est indiscutable, il nous faut seulement choisir nos cibles pour
    un maximum d'effet avec un budget limit&eacute;.</p>

    <h2>L'&eacute;quipe de direction ("core team") :</h2>

    <p>1998 a aussi fini avec quelques coups en ce qui concerne la direction du
    projet FreeBSD, une frustration avec une &eacute;quipe de direction presque gisante
    encourageant un couple de vikings danois barbus dans un
    raid de minuit sur la version -current, massacrant impitoyablement le code source faible ou boiteux
    de la hi&eacute;rarchie des sources. Malheureusement certains bits de ces codes faibles
    ou boiteux &eacute;taient encore utilis&eacute;s et, sans qu'aucun avertissement
    n'ait &eacute;t&eacute; donn&eacute;, cela n'a pas laiss&eacute; le sentiment aux utilisateurs
    de la -current que cet &eacute;v&egrave;nement serait le point culminant
    de leur saison de no&euml;l. Leurs plaintes ont amen&eacute;es
    l'&eacute;quipe dirigeante non loin d'une crise constitutionnelle, les factions
    rivales s'accusant l'une l'autre soit de g&ecirc;ner le progr&egrave;s soit
    d'employer des tactiques de cowboys pour parvenir &agrave; ce progr&egrave;s, et chacune des factions
    avaient leurs torts et leurs raisons.
    Il ressortit de cette histoire plusieurs suggestions concernant
    la mise en place d'une "meilleure &eacute;quipe de direction" &agrave; laquelle
    de telles choses n'arriveraient pas (ou, si elles arrivaient, ne serait pas de notre faute puisque
    nous serions partis depuis longtemps :-). Plusieurs des rem&egrave;des sugg&eacute;r&eacute;s se
    sont r&eacute;v&eacute;l&eacute;s, tout &agrave; fait honn&egrave;tement, &ecirc;tre pire que le mal. Quelle
    le&ccedil;on en avons-nous donc tir&eacute; ?</p>

    <p>Premi&egrave;rement, je pense que tout le monde est d'accord pour
    trouver que se chamailler n'est pas une option &agrave; retenir pour le futur, quelque soit
    la justification. Quiconque veut faire un ajout majeur
    ou veut supprimer une fonctionnalit&eacute; &agrave; la hi&eacute;rarchie des sources DOIT
    communiquer ses intentions suffisamment &agrave; l'avance et donner aux lecteurs
    des listes -current, -stable ou -announce (les deux premi&egrave;res d&eacute;pendant de la
    version sur laquelle les changements sont effectu&eacute;s, le dernier d&eacute;pendant de l'ampleur de ceux-ci)
    un temps suffisant pour r&eacute;pondre. S'il y a une r&eacute;ponse n&eacute;gative,
    le changement ne doit pas s'op&eacute;rer &agrave; moins qu'&agrave; force d'arguments en sa faveur,
    la proposition ne gagne l'approbation des gens. S'il y a un ensemble de
    r&eacute;actions contradictoires ou s'il n'y a qu'une petite r&eacute;action, le d&eacute;veloppeur
    est libre de faire comme il l'entend mais jamais sans avis
    pr&eacute;alable.</p>

    <p>Deuxi&egrave;mement, en r&eacute;action aux diverses propositions de r&eacute;duire l'&eacute;quipe
    dirigeante ou de l'&eacute;lire par voix populaire, laissez-moi vous dire
    que nous n'allons pas faire cela. Il y a probablement plusieurs personnes actuellement dans
    l'&eacute;quipe dirigeante qui seraient heureuses de se retirer si elles sentaient que la
    rel&egrave;ve &eacute;tait assur&eacute;e et que le projet serait en de bonnes mains mais
    personne n'appr&eacute;cie le sc&eacute;nario o&ugrave; quelqu'un serait forc&eacute; &agrave; quitter
    l'&eacute;quipe dirigeante. Ce n'est pas la bonne fa&ccedil;on d'y arriver alors que d'autres
    solutions moins douloureuses existent et je pr&eacute;f&egrave;re largement
    agrandir l'&eacute;quipe dirigeante et laisser les membres inactifs sortir quand ils
    ont pris, eux-m&ecirc;me, la d&eacute;cision qu'ils n'avaient plus rien
    &agrave; apporter au "niveau de direction", la d&eacute;mission n'ayant pas emp&egrave;ch&eacute;
    plusieurs personnes de rester des participants efficaces ou d'apporter
    d'autres contributions apr&eacute;ciables.</p>

    <p>Nous sommes un projet de logiciel libre et personne n'est pay&eacute; pour faire partie de l'&eacute;quipe dirigeante, quelque
    soit le s&eacute;rieux avec lequel nous le prenons et nous devons nous rappeler que tout ceci a commenc&eacute; par un groupe
    de gens qui voulait simplement travailler ensemble &agrave; cr&eacute;er quelque chose
    d'utile et d'int&eacute;ressant. Le jour o&ugrave; nous perdrons cette atmosph&egrave;re informelle
    de productivit&eacute; pour cause de politique sera le jour o&ugrave; une chose
    fondamentale aura disparu de l'&eacute;quipe dirigeante et aussi le jour
    o&ugrave; je partirai moi-m&ecirc;me, en laissant mon poste &agrave; un rempla&ccedil;ant et
    en souhaitant &agrave; tout le monde bonne chance.</p>

    <p>Je peux aussi donner un avertissement similaire en ce qui concerne l'id&eacute;e
    d'&eacute;lire l'&eacute;quipe dirigeante &agrave; partir des utilisateurs ou des principaux participants qui joueraient le r&ocirc;le
    de "coll&egrave;ge &eacute;lectoral", aussi belle et d&eacute;mocratique que cette id&eacute;e puisse avoir
    l'air. L'&eacute;quipe dirigeante de FreeBSD ne repr&eacute;sente pas un corps d&eacute;mocratiquement
    choisi mais a &eacute;t&eacute;, en fait, soigneusement constitu&eacute;e de mani&egrave;re tr&egrave;s
    non-d&eacute;mocratique. Nous avons s&eacute;lectionn&eacute; ses membres avec l'intention sp&eacute;cifique qu'elle
    repr&eacute;sente un ensemble aussi vari&eacute; que possible d'&eacute;vang&eacute;listes et de d&eacute;veloppeurs FreeBSD
    convaincus et nous avons continu&eacute; &agrave; accepter d'autres personnes selon les
    m&ecirc;mes crit&egrave;res.</p>

    <p>Pour introduire une personne dans l'&eacute;quipe dirigeante, nous ne regardons pas si elle a
    r&eacute;cemment gagn&eacute; des concours de popularit&eacute; ou gagn&eacute; l'Oympiade de Programmation trois
    fois de suite, nous nous demandons : "Cette personne apportera-t-elle un talent
    ou un point de vue unique au groupe ? Le groupe fera-t-il mieux que
    la somme de ses membres ?" Ce sont nos deux principaux soucis
    et, en fait, les seules raisons pour lesquelles nous avons senti
    qu'il &eacute;tait n&eacute;cessaire de demander &agrave; quelqu'un de d&eacute;missionner de l'&eacute;quipe dirigeante. Nous
    pouvons nous permettre d'&ecirc;tre tol&eacute;rant envers une personne mais pas lorsque cela affecte
    les conditions de travail de l'ensemble du groupe ou que cela mine la
    diversit&eacute; d'opinion que nous avons durement cultiv&eacute;e. Il est agr&eacute;able
    d'&ecirc;tre un groupe efficace de d&eacute;cideurs en tant qu'&eacute;quipe dirigeante et nous avons
    nos moments importants (bons et mauvais) mais il est parfois pr&eacute;f&eacute;rable
    de savoir se tenir &agrave; l'&eacute;cart et de simplement s'assurer que le train reste
    sur ses rails. Nous avons &eacute;vit&eacute; pas mal d'idioties
    grace &agrave; cette &eacute;quipe diversifi&eacute;e et soigneusement choisie et je ne pense
    pas qu'un processus d&eacute;mocratique nous aurait permis le m&ecirc;me r&eacute;sultat.</p>

    <p>L'&eacute;quipe dirigeante continue aussi son travail de documentation interne
    qui d&eacute;crit, de la fa&ccedil;on la plus d&eacute;taill&eacute;e possible, ce que sont nos r&egrave;gles en tant que participants,
    celles supplantant les "privil&egrave;ges des membres de l'&eacute;quipe dirigeante", celles r&eacute;gissant
    les ajouts ou retraits importants de code source.
    Nous enverrons quelque chose aux participants d&egrave;s que nous en
    seront satisfait mais, en un mot, cela
    insistera sur le fait que les gens ont besoin d'&ecirc;tre avertis avant de tels
    changements et que le responsable d'une branche de code
    est prioritaire pour dire s'il est temps ou pas de l'enlever pour cause
    d'obsolescence ou de redondance. Enfin, nous nous penchons sur la
    communication interne et externe &agrave; l'&eacute;quipe dirigeante ainsi que sur la question
    d'inclure de nouveaux membre(s) d&egrave;s maintenant. Cette
    discussion est en cours et je ferai de mon mieux pour tenir tout le monde au courant
    de sa progression.</p>

    <h2>Num&eacute;rotation des versions :</h2>

    <p>D'autres d&eacute;cisions &agrave; venir concernent le retour &agrave; notre ancienne
    pratique d'utiliser des num&eacute;ros de version "majeurs" pour les branches et
    des num&eacute;ros "mineurs" pour les versions, la partie pour le num&eacute;ro de r&eacute;vision n'&eacute;tant utilis&eacute;e
    que pour noter des versions interm&eacute;diaires sorties pour des raisons
    suffisamment importantes pour m&eacute;riter une nouvelle version. Cela veut dire que la prochaine
    version sera la 3.1 et non la 3.0.1 et que la nouvelle branche sera la 4.0-current
    au lieu de la 3.1-current. Est-ce juste une strat&eacute;gie marketing ? Non,
    bien que cela eut, en effet, de fr&eacute;quentes incidences sur notre
    syst&egrave;me de num&eacute;rotation.</p>

    <p>Nous avons fr&eacute;quemment d&ucirc; faire d'importants changements entre nos "versions
    interm&eacute;diaires", des sauts comme 2.2.5->2.2.6 et 2.2.6->2.2.7 &eacute;tant beaucoup plus importants
    que ce que peuvent penser la plupart des gens en se basant sur le fait que seul un petit
    num&eacute;ro de version a chang&eacute;. Cette simple facette de la nature humaine
    a r&eacute;duit l'impact de ces versions et fait sous-estimer le travail
    r&eacute;alis&eacute; par nos d&eacute;veloppeurs pour am&eacute;liorer fortement <em>chaque</em>
    version, ind&eacute;pendamment de la branche de d&eacute;veloppement.</p>

    <p>Ce n'est pas une tendance qui semble r&eacute;versible et je me sens
    en droit de dire que la 3.1 sera une "version compl&egrave;te" apr&egrave;s la 3.0
    alors qu'une "3.0.1" aurait donn&eacute; une autre
    impression. Il est &eacute;galement important de noter que, puisque nos branches
    restent typiquement 12 &agrave; 18 mois en ce moment, ce n'est pas grave que nous
    en d&eacute;truisions une plus t&ocirc;t, un saut &agrave; une version majeure (4.0)
    &eacute;tant enti&egrave;rement m&eacute;rit&eacute; pour quelque chose qui ne sortira pas
    avant l'an 2000. L'&eacute;quipe marketing sera contente car elle ne bataillera plus pour comprendre
    les num&eacute;ros de versions et les utilisateurs seront contents car ils auront une meilleure image
    de ce qui a chang&eacute; avec, par exemple, 3.1 &agrave; 3.2 au lieu de 3.1 &agrave; 3.1.1 (qui peut &ecirc;tre
    une mise &agrave; jour importante concernant la s&eacute;curit&eacute;). Le d&eacute;veloppeur sera aussi
    content puisque j'aurai un num&eacute;ro de r&eacute;vision &agrave; nouveau disponible
    pour les versions interm&eacute;diaires. C'est une victoire et nous l'assumerons.
    La 3.0.1 est morte, longue vie &agrave; la 3.1 ! :)</p>

    <h2>Technologie:</h2>

    <p>L'ann&eacute;e pass&eacute;e a aussi vu la transition r&eacute;ussie du format a.out au format ELF
    ainsi qu'un nouveau noyau avec modules &agrave; chargement dynamique qui permet aux modules
    d'&ecirc;tre charg&eacute;s sans d&eacute;pendre d'un runtime dans /usr/bin/ld. Nous avons aussi
    un nouveau gestionnaire de d&eacute;marrage (avec interpr&eacute;teur forth !) pour assembler un "noyau" au
    d&eacute;marrage. Ce sont deux nouveaux puissants m&eacute;canismes et coupl&eacute;s avec
    les fonctions &agrave; venir en 1999, ils devraient nous donner un syst&egrave;me
    bien plus dynamique et extensible que nous n'avons jamais eu.</p>

    <p>A ne pas oublier aussi, notre nouveau syst&egrave;me SCSI CAM qui a
    un comportement plus stable avec les gros disques et qui supporte plus de
    contr&ocirc;leurs SCSI ou le support du multi-processeurs sur plate-forme
    x86. Nous avons &eacute;norm&eacute;ment progress&eacute; sur toute la ligne avec la
    version 3.0, atteignant finalement un point avec le portage vers
    l'architecture DEC Alpha o&ugrave; les gens commencent &agrave; s'inqui&eacute;ter d'avantage &agrave; propos
    de la collection de logiciels port&eacute;s que sur le fait d'avoir des noyaux fonctionnels ou un /usr/src
    qui compile. Cela repr&eacute;sente un progr&egrave;s consid&eacute;rable vers une "utilit&eacute;
    v&eacute;ritable" et j'esp&egrave;re que 1999 verra l'av&egrave;nement d'une version de
    FreeBSD/axp pour une utilisation personnelle (sans parler d'une version pour les serveurs),
    certaines difficult&eacute;s avec le serveur X faisant de la version Alpha pour une utilisation personnelle
    une &eacute;tape en elle-m&ecirc;me, surtout sur les machines ARC ou
    AlphaBIOS. 1999 devrait aussi voir la sortie d'une version pr&eacute;-alpha du
    portage sur SPARC, bien qu'il soit encore un peu t&ocirc;t pour en parler plus
    pr&eacute;cis&eacute;ment. Abonnez-vous &agrave; la liste de diffusion <a
    href="mailto:sparc@FreeBSD.org">sparc@FreeBSD.org</a> pour
    suivre les progr&egrave;s de ce portage.</p>

    <p>IPv6 et IPSec ont &eacute;galement &eacute;t&eacute; chaudement d&eacute;battus en 1998, le refus de FreeBSD
    de soutenir une quelconque impl&eacute;mentation sp&eacute;cifique &eacute;tant cit&eacute; par certains comme
    un exemple du sur-conservatisme de l'&eacute;quipe dirigeante. Heureusement pour tous,
    notre attitude "attendre et regarder" a prouv&eacute; &ecirc;tre la bonne lorsque les deux
    groupes "en comp&eacute;tition", KAME et INRIA, ont finalement d&eacute;cid&eacute; de fusionner
    leurs impl&eacute;mentations. Nous avons, en retour, d&eacute;cid&eacute; d'adopter
    cette impl&eacute;mentation commune et nous avons plusieurs personnes des groupes
    KAME/INRIA dans l'&eacute;quipe de d&eacute;veloppement FreeBSD qui importeront
    et maintiendront ce code d&egrave;s qu'il sera disponible.</p>

    <p>Un travail substantiel est parall&egrave;lement effectu&eacute; sur le code de la m&eacute;moire virtuelle et
    sur le code du syst&egrave;me de fichiers, la plupart tranquillement test&eacute; par de petits
    groupes (Dillon/Dyson/Greenman) ou attendant l'av&egrave;nement de la branche 4.0,
    toujours programm&eacute;e pour le 15 janvier 1999. Dans un autre domaine, nous avons
    acceuilli la refonte totale du pilote de console de Kazu dans la
    -current ainsi que le support USB gr&acirc;ce &agrave; Nick Hibma et d'autres.
    Tout ceci pour prendre quelques exemples parmi tous les projets en cours, je ne veux
    offenser personne en n'en nommant pas d'autres, ce sont uniquement les trois
    projets qui me viennent &agrave; l'esprit. Il semble que nous gagnions
    beaucoup d'&eacute;lan technique, c'est tr&egrave;s bien, et nous continuerons tant que nous
    garderons la t&ecirc;te froide pendant les p&eacute;riodes o&ugrave; tout le monde ne sera pas
    en accord total &agrave; propos de la direction technique &agrave; prendre.</p>

    <h2>Support technique :</h2>

    <p>Un point qui devrait aussi &ecirc;tre &eacute;vident pour tout le monde mais qui
    a quand m&ecirc;me besoin d'&ecirc;tre rappel&eacute; fr&eacute;quemment est le fait que la participation &agrave; ce projet doit rester
    <em>agr&eacute;able</em> pour les d&eacute;veloppeurs et participants ou bien ceux-ci
    auront vite fait de repartir et d'arr&ecirc;ter de nous donner le
    fruit de leur labeur (qui n'a pas de prix). C'est une chose dont chacun de nos
    utilisateurs doit &ecirc;tre conscient, au moins quelque part dans
    un coin de leur esprit, pour les fois o&ugrave; ils seraient tent&eacute;s de penser que
    FreeBSD n'est qu'une autre solution de la soci&eacute;t&eacute; Logiciels & Co
    et commencent &agrave; traiter les membres du projet comme des employ&eacute;s.
    Ceux qui cherchent des employ&eacute;s FreeBSD peuvent envoyer un courriel &agrave;
    <a href="mailto:jobs@FreeBSD.org">jobs@FreeBSD.org</a> en indiquant
    combien ils sont pr&ecirc;ts &agrave; payer, sinon, ne le faites pas.</p>

    <p>Je ne voudrais pas me montrer si s&eacute;v&egrave;re que les gens ne prennent m&ecirc;me plus
    la peine de nous demander de l'aide, je veux simplement dire que les gens qui
    utilisent eux-m&ecirc;mes les divers moyens gratuits de support technique de FreeBSD
    (courriel, forums, irc...) doivent comprendre
    que demander de l'aide &agrave; un parfait &eacute;tranger n'est pas tr&egrave;s
    diff&eacute;rent que demander un dollar &agrave; une personne au hasard dans la rue. Si
    vous voulez une aum&ocirc;ne, il vous faut au moins apprendre &agrave;
    demander poliment et savoir prendre un "non" comme une r&eacute;ponse ! :-) J'ai vu
    &eacute;norm&eacute;ment d'abus envers les volontaires des divers supports techniques cette ann&eacute;e
    et &ccedil;a "craint" franchement. Les gens doivent avoir plus de consid&eacute;ration et
    arr&ecirc;ter de prendre ce service gratuit comme un droit divin alors que c'est un
    privil&egrave;ge sp&eacute;cial. Si vous voulez du support technique &agrave; la demande, allez sur
    www.freebsdmall.com et commandez vous-m&ecirc;me votre contrat de support technique. Vous
    obtenez ce que vous payez ! :)</p>

    <h2>L'avenir :</h2>

    <p>Qu'est-ce que je pr&eacute;vois pour 1999 ? Et bien, &agrave; supposer que nous ne disparaissions pas tous
    dans quelque holocaust pr&eacute;-mill&eacute;naire, je vois de nouvelles fonctionnalit&eacute;s plus int&eacute;ressantes,
    un marketing am&eacute;lior&eacute;, plus d'articles commerciaux, plus d'articles dans les magazines
    et d'attention de la part de la presse, et, au fond, davantage que ce que nous avons d&eacute;j&agrave; si nous pouvons
    raisonnablement nous focaliser sur ce que nous avons &agrave; faire et ne pas nous
    distraire dans la chasse au r&ecirc;ve de la conqu&ecirc;te des machines personnelles ou devenir subitement
    minimaliste ou encore se clo&icirc;trer dans la cuisine /usr/src, continuant ainsi
    ce pour quoi nous sommes en partie c&eacute;l&egrave;bre. L'&eacute;quipe dirigeante de FreeBSD, d'une ann&eacute;e
    plus vieille et esp&eacute;rons le un peu plus sage, doit continuer &agrave; garder une main l&eacute;g&egrave;re
    mais assur&eacute;e sur la barre, s'appuyant comme d'habitude sur nos d&eacute;veloppeurs pour
    fournir la plus grande partie de la force motrice de FreeBSD.</p>

    <p>Nos utilisateurs ont aussi besoin d'&ecirc;tre plus impliqu&eacute;s et j'esp&egrave;re que 1999
    sera l'ann&eacute;e de formation de plus de groupes locaux ainsi que
    d'autres organisations. Le manuel de r&eacute;f&eacute;rence et la FAQ sont des documents
    qui s'am&eacute;liorent, une autre tendance qui si tout va bien continuera
    en 1999 si Nik Clayton, notre nouveau courageux dirigeant du Projet de Documentation,
    reste aux commandes. Nous devons cependant toujours nous rappeler que
    le manuel de r&eacute;f&eacute;rence et la FAQ, pour beaucoup d'utilisateurs, ne suffisent pas.</p>

    <p>Linux a beaucoup de succ&egrave;s gr&acirc;ce &agrave; un large r&eacute;seau de support et
    d'&eacute;vang&eacute;lisation qui lui a permis d'atteindre telle personne
    et de leur communiquer le message. Si les propres utilisateurs de FreeBSD veulent
    que FreeBSD fasse mieux que celui qui est souvent per&ccedil;u comme son
    concurrent, et 1998 a certainement &eacute;t&eacute; l'ann&eacute;e o&ugrave; j'ai entendu beacoup de
    plaintes sur ce sujet, alors il faut qu'ils bougent
    leurs fesses collectives et qu'ils se mettent &agrave; ce genre de travail. A quand
    remonte la derni&egrave;re fois qu'un groupe d'utilisateurs FreeBSD s'est regroup&eacute; pour distribuer
    la litt&eacute;rature FreeBSD lors du lancement d'un produit Microsof, par exemple, ou s'est
    occup&eacute; d'un installa-thon &agrave; un salon informatique local ?</p>

    <p>Les linuxiens font cela tout le temps apparemment, pendant
    qu'une poign&eacute;e d'inconditionnels de FreeBSD le font, alors
    rejoignez la liste de diffusion <a
    href="mailto:advocacy@FreeBSD.org">advocacy@FreeBSD.org</a>
    et discutez de vos plans d'actions. De cette fa&ccedil;on, des gens qui ont plus d'entousiasme
    que d'id&eacute;es penvent en tirer des le&ccedil;ons et peuvent peut-&ecirc;tre vous aider. Ecrivez
    de courts articles pour les nouveaux site d'&eacute;vang&eacute;lisation comme <a
    href="http://www.daemonnews.org/">www.daemonnews.org</a> ou <a
    href="http://www.freebsdrocks.com/">www.freebsdrocks.com</a> et aidez
    &agrave; promouvoir le succ&egrave;s des publications d'&eacute;vang&eacute;lisation BSD.</p>

    <p>Des phrases comme "c'est votre FreeBSD" et "cela d&eacute;pend de vous" peuvent
    sembler &eacute;cul&eacute;es et banales mais elles restent malheureusement toujours vraies
    quand il y a si peu de "nous" et tant de "vous". Si FreeBSD poursuit
    <em>vraiment</em> son succ&egrave;s en 1999, ce sera seulement gr&acirc;ce &agrave; la
    substantielle participation des utilisateurs, c'est &agrave; dire de vous, utilisateurs ! Cr&eacute;ez votre groupe
    local, donnez quelques-uns de vos vieux c&eacute;d&eacute;roms d'installation &agrave; votre biblioth&egrave;que locale,
    essayez de convaincre une petite entreprise locale ou un FAI d'utiliser FreeBSD, voil&agrave;
    quelques petites choses qui peuvent &ecirc;tre faites si vous voulez vraiment
    mettre de l'&eacute;nergie dans FreeBSD et les id&eacute;es doivent &ecirc;tre
    le dernier de vos soucis si vous &ecirc;tes motiv&eacute;s.</p>

    <p>R&eacute;sum&eacute; rapide :  1999, rah rah rah, au boulot ! :)</p>

      &footer;
  </body>
</html>
