<!--
     The FreeBSD Documentation Project
     The FreeBSD German Documentation Project

     Original version 1.23
     $FreeBSD$
-->

<chapter id="backups">
  <title>Datensicherung</title>

  <para><emphasis>&Uuml;bersetzt von &a.de.bwarken,
    Januar 1999</emphasis></para>

  <para>Das folgende Kapitel besch&auml;ftigt sich mit der Datensicherung und
    den dazu verwendeten Programmen. Wenn Sie etwas zu diesem Kapitel
    beisteuern m&ouml;chten, senden Sie es bitte an die (englischsprachige)
    &a.doc;</para>

  <sect1 id="backups-tapebackups">
    <title>Bandmedien</title>
    
    <para>Die wichtigsten Bandmedien sind 4mm, 8mm, QIC,
      Mini-Cartridge und DLT.</para>
    
    <sect2 id="backups-tapebackups-4mm">
      <title>4mm (DDS: Digital Data Storage)</title>
      
      <para>Die 4mm-B&auml;nder ersetzen mehr und mehr das QIC-Format als
        Backupmedium der Wahl f&uuml;r Workstations.  Dieser Trend nahm stark
        zu, als Conner die Firma Archive, einen f&uuml;hrenden Hersteller von
        QIC-Laufwerken, aufkaufte und die Produktion von QIC-Laufwerken
        stoppte.  4mm-Laufwerke sind klein und ruhig, haben aber nicht den
        gleichen Ruf der Zuverl&auml;ssigkeit, den die 8mm-Laufwerke
        genie&szlig;en.  Die 4mm-Kassetten sind preiswerter und mit den
        Ma&szlig;en 76,2 x 50,8 x 12,7 mm (3 x 2 x 0,5 Inch) kleiner als die
        8mm-Kassetten.  Sowohl die 4mm- als auch die 8mm-Magnetk&ouml;pfe
        haben eine relativ kurze Lebensdauer, weil beide die gleiche
        Helical-Scan-Technologie benutzen.</para>
      
      <para>Der Datendurchsatz dieser Laufwerke beginnt bei etwa 150
        kByte/s, Spitzenwerte liegen bei etwa 500 kByte/s.  Die
        Datenkapazit&auml;t liegt zwischen 1,3 GB und 2 GB.  Die meisten
        Ger&auml;te haben eine Hardwarekompression eingebaut, die die
        Kapazit&auml;t ungef&auml;hr verdoppelt.  Es gibt
        Multi-Drive-Einheiten f&uuml;r Bandbibliotheken mit bis zu 6
        Laufwerken in einem Geh&auml;use und automatischem Bandwechsel.  Die
        Kapazit&auml;t einer solchen Bibliothek liegt bei 240 GB.</para>
      
      <para>Der Standard DDS-3 unterst&uuml;tzt nun Bandkapazit&auml;ten bis
        zu 12 GB (oder komprimiert 24 GB).</para>
      
      <para>4mm-Laufwerke, ebenso wie 8mm-Laufwerke, verwenden Helical-Scan.
        Alle Vor- und Nachteile von Helical-Scan gelten sowohl f&uuml;r 4mm-
        als auch f&uuml;r 8mm-Laufwerke.</para>
      
      <para>B&auml;nder sollten nach 2.000 Banddurchl&auml;ufen oder 100
        vollen Backups ersetzt werden.</para>
    </sect2>
    
    <sect2 id="backups-tapebackups-8mm">
      <title>8mm (Exabyte)</title>
      
      <para>8mm-B&auml;nder sind die verbreitetsten SCSI-Bandlaufwerke; sie
        sind das geeignetste Bandformat zum Austausch von B&auml;ndern.  Fast
        an jedem Standort gibt es ein 8mm-Bandlaufwerk mit 2 GB.
        8mm-B&auml;nder sind zuverl&auml;ssig, gut zu handhaben und arbeiten
        leise.  Bandkassetten sind preiswert und klein mit 122 x 84 x 15 mm
        (4,8 x 3,3 x 0,6 Inch).  ein Nachteil der 8mm-Technologie ist die
        relativ kurze Lebensdauer des Schreib-/Lesekopfs und der B&auml;nder
        auf Grund der hohen Relativgeschwindigkeit des Bandes &uuml;ber die
        K&ouml;pfe hinweg.</para>
      
      <para>Der Datendurchsatz liegt ungef&auml;hr zwischen 250 kByte/s und
        500 kByte/s.  Die Datenkapazit&auml;t beginnt bei 300 MB und erreicht
        bis zu 7 GB bei den Spitzenger&auml;ten.  Die meisten Ger&auml;te
        haben eine Hardwarekompression eingebaut, die die Kapazit&auml;t
        ungef&auml;hr verdoppelt.  Diese Laufwerke sind erh&auml;ltlich in
        Form von Einzelger&auml;ten oder als Multi-Drive-Bandbibliotheken mit
        6 Laufwerken und 120 B&auml;ndern in einem Geh&auml;use.  Die
        B&auml;nder werden von der Ger&auml;teeinheit automatisch gewechselt.
        Die Kapazit&auml;t einer solchen Bibliothek liegt bei 840 GB und
        mehr.</para>
      
      <para>Das Exabyte-Modell <quote>Mammoth</quote> unterst&uuml;tzt 12 GB
        auf einem Band (24 MB mit Kompression) und kostet etwa doppelt so viel
        wie ein konventionelles Bandlaufwerk.</para>
      
      <para>Die Daten werden mittels Helical-Scan auf das Band
        aufgezeichnet, die K&ouml;pfe sind leicht schr&auml;g zum Medium
        angebracht (mit einem Winkel von etwa 6 Grad).  Das Band wickelt sich
        270 Grad um die Spule, die die K&ouml;pfe tr&auml;gt.  Die Spule dreht
        sich, w&auml;hrend das Band dar&uuml;berl&auml;uft.  Das Resultat ist
        eine hohe Datendichte und eng gepackte Spuren, die von einem Rand des
        Bands zum gegen&uuml;berliegenden quer &uuml;ber das Band abgewinkelt
        verlaufen.</para>
    </sect2>
    
    <sect2 id="backups-tapebackups-qic">
      <title>QIC</title>
      
      <para>QIC-150-B&auml;nder und -Laufwerke sind wohl der am weitesten
        verbreitete Bandtyp &uuml;berhaupt.  QIC-Bandlaufwerke sind die
        preiswertesten "seri&ouml;sen" Backupger&auml;te, die angeboten
        werden.  Der Nachteil dabei ist der hohe Preis der B&auml;nder.
        QIC-B&auml;nder sind im Vergleich zu 8mm- oder 4mm-B&auml;ndern bis zu
        5 Mal teurer, wenn man den Preis auf 1 GB Datenkapazit&auml;t
        umrechnet.  Aber wenn Ihr Bedarf mit einem halben Dutzend B&auml;nder
        abgedeckt werden kann, mag QIC die richtige Wahl sein.</para>
      
      <para>QIC ist der <emphasis>g&auml;ngigste</emphasis>
        Bandlaufwerkstyp.  Jeder Standort hat ein QIC-Laufwerk der einen oder
        anderen Dichte.  Aber gerade das ist der Haken an der Sache, QIC
        bietet eine gro&szlig;e Anzahl verschiedener Datendichten auf
        physikalisch &auml;hnlichen (manchmal identischen) B&auml;ndern.
        QIC-Laufwerke sind nicht leise.  Diese Laufwerke suchen lautstark die
        richtige Bandstelle, bevor sie mit der Datenaufzeichnung beginnen.
        Sie sind w&auml;hrend des Lesens, Schreibens und Suchens deutlich
        h&ouml;rbar.</para>
      
      <para>Die Abmessungen der QIC-Kassetten betragen 152.4 x 101.6 x 17.78
        mm (6 x 4 x 0,7 Inch), die QIC-Bandbreite betr&auml;gt 6,35 mm (1/4
        Inch).  <link
          linkend="backups-tapebackups-mini">Mini-Cartridges</link>, die die
        gleiche Bandbreite verwenden, werden gesondert vorgestellt.
        Bandbibliotheken und Bandwechselger&auml;te gibt es im QIC-Format
        keine.</para>
      
      <para>Der Datendurchsatz liegt ungef&auml;hr zwischen 150 kByte/s und
        500 kByte/s.  Die Datenkapzit&auml;t reicht von 40 MB bis zu 15 GB.
        Hardwarekompression ist in vielen der neueren QIC-Laufwerke eingebaut.
        QIC-Laufwerke werden heute seltener eingesetzt; sie werden von den
        DAT-Laufwerken abgel&ouml;st.</para>
      
      <para>Die Daten werden auf dem Band in Spuren aufgezeichnet.  Die
        Spuren verlaufen entlang der L&auml;ngsachse des Bandmediums von einem
        Ende zum anderen.  Die Anzahl der Spuren, und damit auch die Breite
        einer Spur, variiert mit der Kapazit&auml;t des Laufwerks.  Die
        meisten, wenn nicht alle neueren Laufwerke sind
        r&uuml;ckw&auml;rtskompatibel, zumindest zum Lesen (aber oft auch zum
        Schreiben).  QIC hat einen guten Ruf bez&uuml;glich der
        Datensicherheit (die Mechanik ist einfacher und robuster als diejenige
        der Helical-Scan-Laufwerken).</para>
      
      <para>B&auml;nder sollten nach 5,000 Backups ersetzt werden.</para>
    </sect2>
    
<![ %not.published; [

    <sect2 id="backups-tapebackups-mini">
      <title>* Mini-Cartridge</title>
      
      <para></para>
    </sect2>

]]>
    
    <sect2 id="backups-tapebackups-dlt">
      <title>DLT</title>
      
      <para>DLT hat die schnellste Datentransferrate von allen hier
        aufgelisteten Ger&auml;tetypen.  Das 1/2-Inch-Band (12,7 mm) befindet
        sich in einer Spulkassette mit den Abmessungen 101,6 x 101,6 x 25,4 mm
        (4 x 4 x 1 Inch).  Die eine Seite der Kassette hat eine bewegliche
        Abdeckung.  Der Laufwerksmechanismus &ouml;ffnet diese Abdeckung und
        zieht die Bandf&uuml;hrung heraus.  Die Bandf&uuml;hrung tr&auml;gt
        ein ovales Loch, die das Laufwerk zum "Einh&auml;ngen" des Bandes
        benutzt.  Die Aufwickelspule befindet sich im Innern des
        Bandlaufwerks.  Bei allen anderen hier besprochenen Bandkassetten
        (9-Spur-B&auml;nder sind die einzige Ausnahme) befinden sich sowohl
        die Auf- als auch die Abwickelspule im Inneren der
        Bandkassette.</para>
      
      <para>Der Datendurchsatz liegt bei etwa 1,5 MBytes/s, der dreifache
        Durchsatz der 4mm-, 8mm- oder QIC-Bandlaufwerke.  Die
        Datenkapazit&auml;t reicht von 10 GB bis 20 GB f&uuml;r
        Einfachlaufwerke.  Auch Mehrfachbandger&auml;te sind erh&auml;ltlich,
        sowohl als Bandwechsler wie auch als Multi-Drive-Bandbibliotheken, die
        Platz f&uuml;r 5 bis 900 B&auml;nder verteilt auf 1 bis 20 Laufwerke
        enthalten, mit einer Speicherkapazit&auml;t von 50 GB bis 9 TB.</para>
      
      <para>Mit Kompression unterst&uuml;tzt das Format DLT Type IV bis zu
        70 GB Kapazit&auml;t.</para>
      
      <para>Die Daten werden auf dem Band in Spuren aufgezeichnet, die
        parallel zur Bewegungsrichtung verlaufen (gerade so wie bei den
        QIC-B&auml;ndern).  Zwei Spuren werden dabei gleichzeitig beschrieben.
        Die Lebenszeit der Lese- und Schreibk&ouml;pfe sind relativ lang; denn
        sobald das Band anh&auml;lt, gibt es keine Relativbewegung mehr
        zwischen den K&ouml;pfen und dem Band.</para>
    </sect2>
    
    <sect2>
      <title id="backups-tapebackups-ait">AIT</title>
      
      <para>AIT ist ein neues Format von Sony, das (mit Kompression) bis zu
        50 GB pro Band speichern kann.  Die B&auml;nder haben einen
        Speicherchip, der einen Index mit dem Inhalt des Bandes anlegt.
        Dieser Index kann vom Bandlaufwerk zur schnellen Bestimmung der Lage
        von Dateien auf dem Band benutzt werden, w&auml;hrend andere
        B&auml;nder einige Minuten zur Lokalisierung ben&ouml;tigen.</para>
      
      <para>Entsprechende Software wie etwa SAMS:Alexandria
        k&ouml;nnen 40 oder mehr AIT-Bandbibliotheken verarbeiten, indem sie
        direkt mit dem Speicherchip des Bandes kommunizieren, wenn der
        Bandinhalt am Bildschirm dargestellt werden soll oder bestimmt werden
        soll, welche Dateien auf welchem Band gespeichert sind, oder um das
        richtige Band zu lockalisieren, zu laden und Daten vom Band
        zur&uuml;ckzuspielen.  Bibliotheken dieser Art liegen in der
        Preiskategorie von $20,000, womit sie etwas aus dem Hobbymarkt
        herausfallen.</para>
    </sect2>
    
    <sect2>
      <title>Die erste Benutzung eines neuen Bands</title>
      
      <para>Der Versuch ein neues, vollkommen leeres Band ohne weiteres zu
        lesen oder zu beschreiben wird schiefgehen.  Auf der Konsole werden
        dann Meldungen &auml;hnlich wie folgt ausgegeben:</para>
      
      <screen>sa0(ncr1:4:0): NOT READY asc:4,1
0(ncr1:4:0): Logical unit is in process of becoming ready</screen>
      
      <para>Das Band enth&auml;lt n&auml;mlich keinen Identifier-Block
        (Blocknummer 0).  Alle QIC-Bandlaufwerke seit der Einf&uuml;hrung des
        QIC-525-Standards schreiben einen Identifier-Block auf das Band.  Es
        gibt zwei L&ouml;sungen:</para>
      
      <para><command>mt fsf 1</command> veranlasst das Bandlaufwerk einen
        Identifier-Block auf das Band zu schreiben.</para>
      
      <para>Das Band durch Dr&uuml;cken des Bandauswurfknopfs an der
        Vorderseite des Bandger&auml;ts auswerfen.</para>
      
      <para>Danach das Band wieder einlegen und Daten auf das Band
        &uuml;bertragen wie in &man.dump.8; beschrieben.</para>
      
      <para>Das Kommando &man.dump.8; gibt die Meldung <literal>DUMP: End of
          tape detected</literal> zur&uuml;ck und die Konsole zeigt:
        <literal>HARDWARE FAILURE info:280 asc:80,96</literal></para>
      
      <para>Das Band zur&uuml;ckspulen mit dem Kommando: <command>mt
          rewind</command></para>
      
      <para>Nachfolgende Bandoperationen werden dann erfolgreich
        ausgef&uuml;hrt.</para>
    </sect2>
  </sect1>
  
  <sect1 id="backup-programs">
    <title>Backup-Programme</title>
    
    <para>Die drei wichtigsten Programme sind
      &man.dump.8;,
      &man.tar.1;,
      and
      &man.cpio.1;.</para>
    
    <sect2>
      <title>Aufspielen und Wiederherstellen</title>
      
      <para>&man.dump.8; und &man.restore.8; sind die traditionellen
        Backupprogramme in UNIX.  Sie betrachten das Laufwerk als eine
        Ansammlung von Bl&ouml;cken, operieren also unterhalb dem
        Abstraktionslevel von Dateien, Links und Verzeichnissen, die die
        Grundlage des Dateisystemkonzepts bilden.</para>
      
      <para>&man.dump.8; f&uuml;hrt Datensicherungen von Ger&auml;ten aus,
        bearbeitet also nur komplette Dateisysteme, nicht jedoch Teile eines
        Dateisystems und auch keine Verzeichnisb&auml;ume, die mehr als ein
        Dateisystem &uuml;berspannen, was durch Verwendung von symbolischen
        Links mittels &man.ln.1; oder durch das Einh&auml;ngen von
        Dateisystemen vorkommen kann.  &man.dump.8; schreibt also keine
        Dateien und Verzeichnisse auf das Band, sondern direkt die
        Datenbl&ouml;cke, die die Dateien und Verzeichnisse enthalten.</para>
      
      <para>&man.dump.8; hat einige Eigenarten, die noch aus den fr&uuml;hen
        Tagen der Version 6 von ATT UNIX (ca. 1975) stammen.  Die Parameter
        sind f&uuml;r 9-Spur-B&auml;nder (6250 bpi) voreingestellt, nicht auf
        die heute &uuml;blichen Medien hoher Dichte (bis zu 62.182 ftpi).  Bei
        der Verwendung der Kapazit&auml;ten moderner Bandlaufwerke muss diese
        Voreinstellung auf der Kommandozeile &uuml;berschrieben werden.</para>
      
      <para>&man.rdump.8; und &man.rrestore.8; k&ouml;nnen Daten &uuml;ber
        Netzwerk auf ein Band, das sich in einem Laufwerk eines anderen
        Computers befindet, &uuml;berspielen.  Beide Programme benutzen die
        Befehle &man.rcmd.3; und &man.ruserok.3; zum Zugriff auf das entfernte
        Bandlaufwerk.  Daher muss der Anwender, der das Backup
        durchf&uuml;hrt, auf dem entfernten Computer eine Zugangsberechtigung
        f&uuml;r <literal>rhosts</literal> haben.</para>
      
      <para>Die Argumente zu &man.rdump.8; und &man.rrestore.8; m&uuml;ssen
        zur Verwendung auf dem entfernten Computer geeignet sein.
        (Z.B. lautet das Kommando zum Aufrufen von <command>rdump</command>
        von einem FreeBSD-Computer aus auf ein Exabyte-Bandlaufwerk auf einer
        Sun namens <hostid>komodo</hostid>: <command>/sbin/rdump 0dsbfu 54000
          13000 126 komodo:/dev/nrsa8 /dev/rda0a 2&gt;&amp;1</command>).  Man
        beachte, dass bei der Ausf&uuml;hrung die Sicherheitsvorkehrungen wie
        beim Aufruf des Kommandos <literal>rhosts</literal> gelten.
        Erkundigen Sie sich nach Ihrer Zugangsberechtigung.</para>
    </sect2>
    
    <sect2>
      <title>Tar</title>
      
      <para>&man.tar.1; stammt ebenfalls aus Version 6 von ATT Unix
        (ca. 1975).  &man.tar.1; arbeitet mit dem Dateisystem, denn es
        schreibt Dateien und Verzeichnisse auf das Band.  &man.tar.1;
        unterst&uuml;tzt zwar nicht den vollen Umfang von Optionen, die bei
        &man.cpio.1; zur Verf&uuml;gung stehen, aber daf&uuml;r erfordert
        &man.tar.1; nicht die ungew&ouml;hnliche Kommando-Pipeline,1 die
        &man.cpio.1; verwendet.</para>
      
      <para>Die meisten Versionen von &man.tar.1; unterst&uuml;tzen keine
        Backups &uuml;ber das Netzwerk.  Die GNU-Version von &man.tar.1;, die
        in FreeBSD verwendet wird, unterst&uuml;zt jedoch entfernte
        Ger&auml;te mit der gleichen Syntax wie &man.rdump.8;.  Um &man.tar.1;
        f&uuml;r ein Exabyte-Bandlaufwerk auf einer Sun
        namens<hostid>komodo</hostid> auszuf&uuml;hren, muss folgendes
        Kommando aufgerufen werden: <command>/usr/bin/tar cf komodo:/dev/nrsa8
          . 2&gt;&amp;1</command>. Bei den Versionen ohne Unterst&uuml;tzung
        f&uuml;r entfernte Ger&auml;te kann man die Daten &uuml;ber eine
        Pipeline und &man.rsh.1; an ein entferntes Laufwerk senden.</para>

        <screen>&prompt.root; <userinput>tar cf - . | rsh <replaceable>hostname</replaceable> dd of=<replaceable>tape-device</replaceable> obs=20b</userinput></screen>

        <para>Wenn Sie Bedenken bez&uuml;glich der Sicherheit beim Backup
          &uuml;ber's Netz haben, sollten Sie &man.ssh.1; anstatt
          &man.rsh.1; benutzen.</para>
    </sect2>
    
    <sect2>
      <title>Cpio</title>
      
      <para>&man.cpio.1; ist das urspr&uuml;ngliche Unix-Programm zum
        Dateitransfer mit magnetischen Medien.  &man.cpio.1; hat (neben vielen
        anderen Leistungsmerkmalen) Optionen zum Byte-Swapping, zum Schreiben
        einer Anzahl verschiedener Archivformate und zum Weiterleiten von
        Daten an andere Programme &uuml;ber Pipeline.  Dieses letztes
        Leistungsmerkmal macht &man.cpio.1; zu einer ausgezeichneten Wahl
        f&uuml;r Installationsmedien.  Leider kann &man.cpio.1; keine
        Dateib&auml;ume durchlaufen, so dass eine Liste der zu bearbeitenden
        Dateien &uuml;ber <filename>stdin</filename> angegeben werden
        muss.</para>
      
      <para>&man.cpio.1; unterst&uuml;tzt keine Backups &uuml;ber das
        Netzwerk.  Man kann aber eine Pipeline und &man.rsh.1 verwenden, um
        Daten an ein entferntes Bandlaufwerk zu senden. (XXX ein
        Beispiel-Kommando beif&uuml;gen)</para>
    </sect2>
    
    <sect2>
      <title>Pax</title>
      
      <para>&man.pax.1; ist die Antort von IEEE/POSIX auf &man.tar.1; und
        &man.cpio.1;.  &Uuml;ber die Jahre hinweg sind die verschiedenen
        Versionen von &man.tar.1; und &man.cpio.1; leicht inkompatibel
        geworden.  Daher hat POSIX, statt eine Standardisierung zwischen
        diesen auszufechten, ein neues Archivprogramm geschaffen.  &man.pax.1;
        versucht viele der unterschiedlichen cpio- und tar-Formate zu lesen
        und zu schreiben, au&szlig;erdem einige neue, eigene Formate.  Die
        Kommandostruktur &auml;hnelt eher &man.cpio.1; als &man.tar.1;.</para>
    </sect2>
    
    <sect2 id="backups-programs-amanda">
      <title>Amanda</title>
      
      <para><ulink url="../ports/misc.html#amanda-2.4.0">Amanda</ulink>
        (Advanced Maryland Network Disk Archiver) ist ein
        Client/Server-Backupsystem, nicht nur ein einzelnes Programm.  Ein
        Amanda-Server kann auf einem einzigen Bandlaufwerk Datensicherungen
        von jeder beliebigen Anzahl von Computern speichern, sofern auf diesen
        jeweils ein Amanda-Client l&auml;uft und sie &uuml;ber Netzwerk mit
        dem Amanda-Server verbunden sind.</para>
      
      <para>Ein h&auml;ufiges Problem bei Standorten mit einer Anzahl
        gro&szlig;er Festplatten ist, dass das Kopieren der Daten auf Band
        langsamer vor sich geht als solche Daten anfallen.  Amanda l&ouml;st
        dieses Problem durch Verwendung einer "Holding Disk", einer Festplatte
        zum gleichzeitigen Zwischenspeichern mehrerer Dateisysteme.</para>
      
      <para>F&uuml;r Datensicherungen &uuml;ber einen l&auml;ngeren Zeitraum
        erzeugt Amanda "Archivsets" von allen Dateisystemen, die in Amanda's
        Konfigurationsdatei genannt werden.  Ein Archivset ist eine Gruppe von
        B&auml;ndern mit vollen Backups und Reihen von inkrementellen (oder
        differentiellen) Backups, die jeweils nur die Unterschiede zum vorigen
        Backup enthalten.  Zur Wiederherstellung von besch&auml;digten
        Dateissystemen ben&ouml;tigt man das letzte volle Backup und alle
        darauf folgenden inkrementellen Backups.</para>
      
      <para>Ein g&auml;ngiger Datensicherungsplan ist, an den Wochenenden
        ein volles Backup und w&auml;hrend der Woche jede Nacht ein
        inkrementelles Backup zu erstellen.</para>
      
      <para>Die Konfigurationsdatei erm&ouml;glicht die Feineinstellung der
        Backups und des Netzwerkverkehrs von Amanda.  Amanda kann zum
        Schreiben der Daten auf das Band jedes der oben beschriebenen
        Backuprogramme verwenden.  Amanda ist erh&auml;ltlich als Portierung
        oder als Softwarepaket, es ist nicht von vorne herein auf dem System
        installiert.</para>
    </sect2>
    
    <sect2>
      <title>Tue nichts</title>
      
      <para><quote>Tue nichts</quote> ist kein Computerprogramm, sondern die
        am h&auml;ufigsten angewendete Backupstrategie.  Diese kostet nichts,
        man muss keinen Backupplan befolgen, einfach nur nein sagen.  Wenn
        etwas passiert, einfach grinsen und ertragen!</para>
      
      <para>Wenn Ihre Zeit und Ihre Daten nicht so wichtig sind, dann ist
        die Strategie <quote>Tue nichts</quote> das geeignetste Backupprogramm
        f&uuml;r Ihren Computer.  Aber UNIX ein n&uuml;tzliches Werkzeug.  Sie
        m&uuml;ssen damit rechnen, dass Sie innerhalb von sechs Monaten eine
        Sammlung von Dateien haben, die f&uuml;r Sie wertvoll geworden
        sind.</para>
      
      <para><quote>Tue nichts</quote> ist die richtige Backupmethode f&uuml;r
        <filename>/usr/obj</filename> und andere Verzeichnisb&auml;ume, die
        vom Computer exakt wiedererzeugt werden k&ouml;nnen.  Ein Beispiel
        sind die Dateien, die diese Handbuchseiten darstellen &mdash; sie
        wurden aus Quelldateien im Format <acronym>SGML</acronym> erzeugt.  Es
        ist nicht n&ouml;tig, Sicherheitskopien der Dateien in den
        sekund&auml;ren Formaten wie etwa <acronym>HTML</acronym> zu
        erstellen.  Die Quelldateien in <acronym>SGML</acronym> sollten jedoch
        in die regelm&auml;&szlig;igen Backups mit einbezogen werden.</para>
    </sect2>
    
    <sect2>
      <title>Welches Backup-Programm ist am Besten?</title>
      
      <para>&man.dump.8;, <emphasis>Punkt und Schluss.</emphasis> Elizabeth
        D. Zwicky hat alle hier genannten Backup-Programme bis zur
        Ersch&ouml;pfung ausgetestet.  Ihre eindeutige Wahl zur Sicherung
        aller Daten mit Ber&uuml;cksichtigung aller Besonderheiten von
        UNIX-Dateisystemen ist &man.dump.8;.</para>
      
      <para>Elizabeth erzeugte Dateisysteme mit einer gro&szlig;en Vielfalt
        ungew&ouml;hnlicher Bedingungen (und einiger gar nicht so
        ungew&ouml;hnlicher) und testete jedes Programm durch ein Backup und
        eine Wiederherstellung dieser Dateisysteme.  Unter den Besonderheiten
        waren Dateien mit L&ouml;chern, Dateien mit L&ouml;chern und einem
        Block mit Null-Zeichen, Dateien mit ausgefallenen Buchstaben im
        Dateinamen, unlesbare und nichtschreibbare Dateien,
        Ger&auml;tedateien, Dateien, deren L&auml;nge sich w&auml;hrend des
        Backups &auml;ndert, Dateien, die w&auml;hrend des Backups erzeugt und
        gel&ouml;scht werden, u.v.m.  Sie berichtete &uuml;ber ihre Ergebnisse
        in LISA V im Oktober 1991, s. <ulink
          url="http://reality.sgi.com/zwicky_neu/testdump.doc.html">Torture-testing
          Backup and Archive Programs</ulink>.</para>
    </sect2>
    
    <sect2>
      <title>Die Wiederherstellung in einem Notfall</title>
      
      <sect3>
        <title>Vor dem Ungl&uuml;ck</title>
        
        <para>Es sind nur vier Vorkehrungen zu treffen, um auf jedes
          erdenkliche Ungl&uuml;ck vorbereitet zu sein.</para>
        
        <para>Als erstes drucken Sie das Disklabel jeder Ihrer Festplatten
          (z.B. mittels <command>disklabel da0 | lpr</command>), die
          Partitions- und Dateisystemtabelle jeder Festplatte (mit
          <filename>/etc/fstab</filename>) sowie alle Bootmeldungen, jeweils
          in zweifacher Ausfertigung.</para>
        
        <para>Zweitens, &uuml;berzeugen Sie sich, dass sowohl die
          Bootdiskette als auch die Reparaturdiskette
          (<filename>boot.flp</filename> bzw.  <filename>fixit.flp</filename>)
          all Ihre Ger&auml;te ansprechen k&ouml;nnen.  Die einfachste Methode
          dies nach zu pr&uuml;fen ist, Ihren Rechner mit der Boot-Diskette im
          Floppylaufwerk neu zu starten und die Bootmeldungen zu durchzusehen.
          Wenn all Ihre Ger&auml;te aufgelistet sind und funktionieren,
          k&ouml;nnen Sie weiter zu Schritt drei gehen.</para>
        
        <para>Ist das nicht der Fall, m&uuml;ssen Sie sich eine eigene
          Version der beiden zum Booten ben&ouml;tigten Disketten erstellen.
          Diese m&uuml;ssen einen Kernel enthalten, der all Ihre Platten
          mounten kann und Zugriff auf Ihr Bandlaufwerk gestattet.  Diese
          Disketten m&uuml;ssen ferner folgende Programme enthalten:
          &man.fdisk.8;, &man.disklabel.8;, &man.newfs.8;, &man.mount.8; sowie
          jedes Backup-Programm, das Sie verwenden.  Diese Programme
          m&uuml;ssen statisch gelinkt sein.  Falls Sie &man.dump.8;
          verwenden, muss die Diskette auch &man.restore.8; enthalten.</para>
        
        <para>Drittens, machen Sie oft Backups auf Band.  Jede &Auml;nderung
          seit Ihrem letzten Backup kann unwiederbringlich verloren gehen.
          Versehen Sie die Backup-B&auml;nder mit Schreibschutz.</para>
        
        <para>Viertens, testen Sie aus, wie die Disketten (entweder
          <filename>boot.flp</filename> und <filename>fixit.flp</filename>
          oder Ihre beiden eigenen Disketten aus Schritt zwei) und die
          B&auml;nder mit den Backups zu behandeln sind.  Machen Sie sich
          Notizen zu diesem Test.  Bewahren Sie diese Notizen zusammen mit den
          Bootdisketten, den Ausdrucken und den B&auml;ndern mit den Backups
          auf.  Wenn der Ernstfall eintritt, werden Sie vielleicht so genervt
          sein, dass Sie ohne Ihre Notizen evt. das Backup auf Ihren
          B&auml;ndern zerst&ouml;ren.  (Wie das geht?  Man braucht nur
          ungl&uuml;cklicherweise den Befehl <command>tar cvf
            /dev/rsa0</command> einzugeben um ein Band zu
          &uuml;berschreiben).</para>
        
        <para>Als zus&auml;tzliche Sicherheitsvorkehrung, kann man jeweils
          die Disketten und B&auml;nder zweifach erstellen.  Eine der Kopien
          sollte an einem entfernten Standort aufbewahrt werden.  Ein
          entfernter Standort ist NICHT der Keller im gleichen
          B&uuml;rogeb&auml;ude.  Eine Anzahl von Firmen im World Trade Center
          musste diese Lektion auf die harte Tour lernen.  Ein entfernter
          Standort sollte von Ihrem Computer und Ihren Festplatten
          physikalisch durch eine erhebliche Entfernung getrennt sein.</para>
        
        <para>Ein Beispielskript zum Erstellen eigener Bootdisketten:</para>
        
        <programlisting>
<![ CDATA [#!/bin/sh
#
# Erstellen einer Diskette zur Wiederherstellung eines Backups
#
# Diskette formatieren
#
PATH=/bin:/sbin:/usr/sbin:/usr/bin

fdformat -q fd0
if [ $? -ne 0 ]
then
echo "Bad floppy, please use a new one"
exit 1
fi

# Die Bootbloecke auf die Diskette schreiben
#
disklabel -w -B /dev/rfd0c fd1440

#
# Dateisystem fuer die (einzige) Partition auf der Diskette
#
newfs -t 2 -u 18 -l 1 -c 40 -i 5120 -m 5 -o space /dev/rfd0a

#
# Diskette mounten
#
mount /dev/fd0a /mnt

#
# Benoetigte Verzeichnisse erstellen
#
mkdir /mnt/dev
mkdir /mnt/bin
mkdir /mnt/sbin
mkdir /mnt/etc
mkdir /mnt/root
mkdir /mnt/mnt			# fuer die Root-Partition
mkdir /mnt/tmp
mkdir /mnt/var

#
# die Verzeichnisse bevoelkern
#
if [ ! -x /sys/compile/MINI/kernel ] 
then
cat << EOM
Der MINI_Kernel existiert nicht, bitte einen erzeugen.
Hier ein Beispiel einer Konfigurationsdatei:
#
# MINI -- Ein FreeBSD-Kernel, der auf die Diskette passt.
#
machine		"i386"
cpu		"I486_CPU"
ident		MINI
maxusers	5

options		INET			# notwendig fuer _tcp _icmpstat _ipstat
#               _udpstat _tcpstat _udb
options		FFS			#Berkeley Fast File System
options		FAT_CURSOR		#Blockcursor in syscons oder pccons
options		SCSI_DELAY=15		#traue nicht Joe's SCSI-Geraet
options		NCONS=2		        #2 virtuelle Konsolen
options		USERCONFIG		#Konfiguration mit -c XXX zulassen


config		kernel	root on da0 swap on da0 and da1 dumps on da0

controller	isa0
controller	pci0

controller	fdc0	at isa? port "IO_FD1" bio irq 6 drq 2 vector fdintr
disk		fd0	at fdc0 drive 0

controller	ncr0

controller	scbus0

device		sc0	at isa? port "IO_KBD" tty irq 1 vector scintr
device		npx0	at isa? port "IO_NPX" irq 13 vector npxintr

device		da0
device		da1
device		da2

device		sa0

pseudo-device	loop		# von INET benoetigt
pseudo-device	gzip		# komprimierte a.out-Dateien ausfuehren
EOM
exit 1
fi

cp -f /sys/compile/MINI/kernel /mnt

gzip -c -best /sbin/init > /mnt/sbin/init
gzip -c -best /sbin/fsck > /mnt/sbin/fsck
gzip -c -best /sbin/mount > /mnt/sbin/mount
gzip -c -best /sbin/halt > /mnt/sbin/halt
gzip -c -best /sbin/restore > /mnt/sbin/restore

gzip -c -best /bin/sh > /mnt/bin/sh
gzip -c -best /bin/sync > /mnt/bin/sync

cp /root/.profile /mnt/root

cp -f /dev/MAKEDEV /mnt/dev
chmod 755 /mnt/dev/MAKEDEV

chmod 500 /mnt/sbin/init
chmod 555 /mnt/sbin/fsck /mnt/sbin/mount /mnt/sbin/halt
chmod 555 /mnt/bin/sh /mnt/bin/sync
chmod 6555 /mnt/sbin/restore

#
# Geraetedateien erstellen
#
cd /mnt/dev
./MAKEDEV std
./MAKEDEV da0
./MAKEDEV da1
./MAKEDEV da2
./MAKEDEV sa0
./MAKEDEV pty0
cd /

#
# Minimale Dateisystemtabelle erstellen
#
cat > /mnt/etc/fstab <<EOM
/dev/fd0a	/	ufs	rw 1 1
EOM

#
# Minimale Passwortdatei erstellen
#
cat > /mnt/etc/passwd <<EOM
root:*:0:0:Charlie &:/root:/bin/sh
EOM

cat > /mnt/etc/master.passwd <<EOM
root::0:0::0:0:Charlie &:/root:/bin/sh
EOM

chmod 600 /mnt/etc/master.passwd
chmod 644 /mnt/etc/passwd
/usr/sbin/pwd_mkdb -d/mnt/etc /mnt/etc/master.passwd

#
# Die Diskette aushaengen und den Benutzer informieren
#
/sbin/umount /mnt
echo "Die Diskette wurde ausgehaengt und ist jetzt bereit."]]></programlisting>
      </sect3>
      
      <sect3>
        <title>Nach dem Ungl&uuml;ck</title>
        
        <para>Die Schl&uuml;sselfrage ist, ob Ihre Hardware &uuml;berlebt
          hat.  Denn da Sie ja regelm&auml;&szlig;ig Backups angefertigt
          haben, brauchen Sie sich um die Software keine Sorgen zu
          machen.</para>
        
        <para>Falls die Hardware besch&auml;digt wurde, ersetzen Sie zuerst
          die defekten Teile.</para>
        
        <para>Falls die Hardware funktioniert, &uuml;berpr&uuml;fen Sie die
          Disketten.  Wenn Sie eigene Bootdisketten verwenden, booten Sie im
          Single-User-Modus (geben dazu Sie <literal>-s</literal> am
          Boot-Prompt <prompt>boot:</prompt> ein).  &Uuml;berspringen Sie den
          folgenden Paragrafen.</para>
        
        <para>Wenn Sie die Standarddisketten <filename>boot.flp</filename>
          und <filename>fixit.flp</filename> verwenden, lesen Sie hier weiter.
          Legen Sie die Bootdiskette <filename>boot.flp</filename> in das
          erste Floppylaufwerk ein und starten Sie den Computer.  Wie
          &uuml;blich wird dann das originale Installationsmen&uuml; von
          FreeBSD gestartet.  W&auml;hlen Sie die Option
          <literal>Fixit--Repair mode with CDROM or floppy.</literal>.  Legen
          Sie die Diskette <filename>fixit.flp</filename> ein, wenn danach
          gefragt wird.  <command>restore</command> und die anderen Programme,
          die Sie ben&ouml;tigen, befinden sich dann in
          <filename>/mnt2/stand</filename>.</para>
        
        <para>Stellen Sie die Dateisysteme nacheinander, getrennt von
          einander, wieder her.</para>
        
        <para>Versuchen Sie die Root-Partition Ihrer ersten Festplatte
          &man.mount.8; einzuh&auml;ngen (z.B. mit <command>mount /dev/sd0a
            /mnt</command>).  Wenn das Disklabel besch&auml;digt wurde, benutzen
          Sie &man.disklabel.8; um die Platte neu zu partitionieren und zu
          benennen und zwar so, dass die Festplatte mit dem Label
          &uuml;bereinstimmt, das Sie ausgedruckt und aufbewahrt haben.</para>
        
        <para>Verwenden Sie &man.newfs.8; um neue Dateisysteme auf den
          Partitionen anzulegen.  H&auml;ngen Sie nun die Root-Partition der
          Festplatte mit Schreibzugriff ein (mit <command>mount -u -o rw
            /mnt</command>).  Benutzen Sie Ihr Backup-Programm um die Daten
          f&uuml;r das jeweilige Dateisystem aus den Backup-B&auml;ndern
          wieder her zu stellen (z.B. durch <command>restore vrf
            /dev/sta</command>).  H&auml;ngen Sie das Dateisystem wieder aus
          (z.B. durch <command>umount /mnt</command>).  Wiederholen Sie diesen
          Ablauf f&uuml;r jedes betroffene Dateisystem.</para>
        
        <para>Sobald Ihr System wieder l&auml;uft, machen Sie gleich wieder
          ein vollst&auml;ndiges Backup auf neue B&auml;nder.  Denn die
          Ursache f&uuml;r den Absturz oder den Datenverlust kann wieder
          zuschlagen.  Eine weitere Stunde, die Sie jetzt noch
          dranh&auml;ngen, kann Ihnen sp&auml;ter ein weiteres Missgeschick
          ersparen.</para>
      </sect3>
      
<![ %not.published; [

      <sect3>
        <title>* Ich habe mich nicht auf Missgeschicke vorbereitet - was
          nun?</title>
        
        <para></para>
      </sect3>

]]>

    </sect2>
  </sect1>
  
  <sect1 id="backups-floppybackups">
    <title>Was ist mit Backups auf Disketten?</title>
    
    <sect2 id="floppies-using">
      <title>Kann ich Disketten zum Backup meiner Daten verwenden?</title>
      
      <para>Disketten sind kein wirklich geeignetes Medium f&uuml;r Backups
        aus folgenden Gr&uuml;nden:</para>
      
      <itemizedlist>
        <listitem>
          <para>Disketten sind unzuverl&auml;ssig, besonders
            langfristig.</para>
        </listitem>
        
        <listitem>
          <para>Speichern und Wiederherstellen ist sehr langsam.</para>
        </listitem>
        
        <listitem>
          <para>Sie haben eine sehr eingeschr&auml;nkte Kapazit&auml;t (Die
            Zeiten sind l&auml;ngst vorbei, wo eine ganze Festplatte auf ein
            Dutzend Floppies oder so gespeichert werden konnte).</para>
        </listitem>
      </itemizedlist>
      
      <para>Wenn jedoch keine andere M&ouml;glichkeit zum Datenbackup
        vorhanden ist, dann sind Disketten immer noch besser als gar kein
        Backup.</para>
      
      <para>Wenn man gezwungen ist Disketten zu verwenden, dann sollte man
        auf eine gute Qualit&auml;t achten.  Floppies, die schon einige Jahre
        im B&uuml;ro herumgelegen haben, sind eine schlechte Wahl.  Ideal sind
        neue Disketten von einem renommierten Hersteller.</para>
    </sect2>
    
    <sect2 id="floppies-creating">
      <title>Wie mache ich ein Backup auf Disketten?</title>
      
      <para>Die beste Art eines Diskettenbackups ist der Befehl &man.tar.1;
        mit der Mehrfachband-Option <option>-M</option>, die es
        erm&ouml;glicht ein Backup &uuml;ber mehrere Floppies zu
        verteilen.</para>
      
      <para>Ein Backup aller Dateien im aktuellen Verzeichnis
        einschlie&szlig;lich aller Unterverzeichnisse wird durch den folgenden
        Befehl veranlasst (als root):</para>
      
      <screen>&prompt.root; <userinput>tar Mcvf /dev/rfd0 *</userinput></screen>
      
      <para>Wenn die erste Floppy voll ist, meldet sich &man.tar.1; und
        verlangt einen Diskettenwechsel (weil &man.tar.1; unabh&auml;ngig vom
        Medium arbeitet, wird der n&auml;chste Band (Volume) verlangt, was in
        diesem Zusammenhang eine Diskette bedeutet), in etwa wie folgt:</para>
      
      <screen>Prepare volume #2 for /dev/rfd0 and hit return:</screen>
      
      <para>Dies wird mit steigender Volumezahl wiederholt, bis alle
        angebenen Dateien archiviert sind.</para>
    </sect2>
    
    <sect2 id="floppies-compress">
      <title>K&ouml;nnen Diskettenbackups komprimiert werden?</title>
      
      <para>Leider erlaubt es &man.tar.1; nicht, die Option
        <option>-z</option> f&uuml;r Multi-Volume-Archive zu verwenden.  Man
        kann nat&uuml;rlich alle Dateien mit &man.gzip.1; komprimieren, sie
        mit &man.tar.1; auf die Floppies aufspielen, und dann die Dateien
        wieder &man.gunzip.1; entkomprimieren!</para>
    </sect2>
    
    <sect2 id="floppies-restoring">
      <title>Wie werden Diskettenbackups wieder her gestellt?</title>
      
      <para>Zur Wiederherstellung des gesamten Archivs verwendet man:</para>
      
      <screen>&prompt.root; <userinput>tar Mxvf /dev/rfd0</userinput></screen>
      
      <para>Eine Methode um nur bestimmte Dateien wieder her zu stellen ist
        mit der ersten Diskette den folgenden Befehl auszuf&uuml;hren:</para>
      
      <screen>&prompt.root; <userinput>tar Mxvf /dev/rfd0 <replaceable>filename</replaceable></userinput></screen>
      
      <para>&man.tar.1; wird dann dir folgenden Disketten anfordern, bis die
        ben&ouml;tigte Datei gefunden ist.</para>
      
      <para>Wenn man die Diskette kennt auf der sich die Datei befindet,
        kann man alternativ diese Diskette auch direkt einlegen und den
        gleichen Befehl wie oben verwenden.  Man beachte, dass, falls die
        erste Datei eine Fortsetzung eine Fortsetzung einer Datei von einer
        der vorigen Disketten ist, &man.tar.1; die Warnung ausgibt, dass diese
        Datei nicht wiederhergestellt werden kann, selbst dann, wenn dies gar
        nicht verlangt wurde!</para>
    </sect2>
  </sect1>
</chapter>
  
<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
