Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/problem-reports/_index.po
Languages: pt_br, ru

source: Similar considerations apply to use of the https://bugs.freebsd.org/bugzilla/enter_bug.cgi[web-based PR submission form]. Be careful of cut-and-paste operations that might change whitespace or other text formatting.
pt_br: Considerações semelhantes se aplicam ao uso do https://bugs.freebsd.org/bugzilla/enter_bug.cgi[formulário web de envio de PR]. Cuidado com as operações de recortar e colar que podem alterar o espaços em branco ou outras formatações de texto.
ru: Аналогичные соображения применимы к использованию https://bugs.freebsd.org/bugzilla/enter_bug.cgi[веб-формы для отправки PR]. Будьте осторожны с операциями копирования и вставки, которые могут изменить пробелы или другое форматирование текста.

source: Finally, if the submission is lengthy, prepare the work offline so that nothing will be lost if there is a problem submitting it.
pt_br: Finalmente, se o envio for demorado, prepare o trabalho off-line para que nada seja perdido se houver um problema ao enviá-lo.
ru: И наконец, если ваше сообщение будет объёмным, вы должны приготовить его в offline, чтобы ничего не потерялось в случае, если будет проблема при его отправке.

source: Attaching Patches or Files
pt_br: Anexando Patches ou Arquivos
ru: Вложение патчей или файлов

source: In general, we recommend using `git format-patch` to generate one or a series of unified diff against the base branch (e.g. `origin/main`). Patches generated this way would include the Git hashes and will include your name and email address, making it easier for committers to apply your patch and properly credit you as the author (using `git am`). For minor changes where you prefer not to use git, please be sure to use man:diff[1] with the `-u` option to create a unified diff, as this would give developers more context and are more readable than other diff formats.
pt_br: Em geral, recomendamos usar `git format-patch` para gerar um ou uma série de diffs unificados em relação ao branch base (por exemplo, `origin/main`). Os patches gerados dessa forma incluirão os hashes do Git e incluirão seu nome e endereço de e-mail, tornando mais fácil para os committers aplicarem seu patch e creditarem você como autor (usando `git am`). Para pequenas alterações em que você prefere não usar o git, certifique-se de usar man:diff[1] com a opção `-u` para criar um diff unificado, pois isso daria aos desenvolvedores mais contexto e seria mais legível do que outros formatos de diff.
ru: В общем, мы рекомендуем использовать `git format-patch` для создания одного или серии унифицированных diff-файлов относительно базовой ветки (например, `origin/main`). Патчи, созданные таким образом, будут содержать хеши Git, а также ваше имя и адрес электронной почты, что упростит применение вашего патча коммиттерами и правильное указание вас как автора (с помощью `git am`). Для небольших изменений, где вы предпочитаете не использовать git, убедитесь, что используете man:diff[1] с опцией `-u` для создания унифицированного diff-файла, так как это даст разработчикам больше контекста и сделает его более читаемым по сравнению с другими форматами diff.

source: For problems with the kernel or the base utilities, a patch against FreeBSD-CURRENT (the main Git branch) is preferred since all new code should be applied and tested there first. After appropriate or substantial testing has been done, the code will be merged/migrated to the FreeBSD-STABLE branch.
pt_br: Para problemas com o kernel ou com os utilitários da base, um patch para o FreeBSD-CURRENT (o principal branch do Git) é o preferido, já que todo código novo deve ser aplicado e testado lá primeiro. Após testes apropriados ou substanciais terem sido feitos, o código será mesclado/migrado para a branch FreeBSD-STABLE.
ru: Для проблем с ядром или базовыми утилитами предпочтителен патч для FreeBSD-CURRENT (основной ветки Git), поскольку весь новый код должен сначала применяться и тестироваться там. После проведения соответствующих или достаточных тестов код будет объединён/перенесён в ветку FreeBSD-STABLE.

source: If you attach a patch inline, instead of as an attachment, note that the most common problem by far is the tendency of some email programs to render tabs as spaces, which will completely ruin anything intended to be part of a Makefile.
pt_br: Se você anexar um patch inline, em vez de um anexo, observe que o problema mais comum, de longe, é a tendência de alguns programas de email renderizar tabs como espaços, o que ira arruinar completamente qualquer coisa destinada a fazer parte de um Makefile.
ru: Если вы вставляете патч в тело сообщения, учтите, что некоторые почтовые программы имеют тенденцию заменять табуляции серией пробелов, что полностью разрушит, например, часть файла сборки (Makefile).

source: Do not send patches as attachments using `Content-Transfer-Encoding: quoted-printable`. These will perform character escaping and the entire patch will be useless.
pt_br: Não envie patches como anexos usando `Content-Transfer-Encoding: quoted-printable`. Isso irá escapar os caracteres e todo o patch se tornará inútil.
ru: Не отсылайте патчи в виде вложений, используя `Content-Transfer-Encoding: quoted-printable`. Это выполнит экранирование (escaping) символов и весь патч будет бесполезным.

source: Also note that while including small patches in a PR is generally all right—particularly when they fix the problem described in the PR-large patches and especially new code which may require substantial review before committing should be placed on a web or ftp server, and the URL should be included in the PR instead of the patch. Patches in email tend to get mangled, and the larger the patch, the harder it will be for interested parties to unmangle it. Also, posting a patch on the web allows you to modify it without having to resubmit the entire patch in a followup to the original PR. Finally, large patches simply increase the size of the database, since closed PRs are not actually deleted but instead kept and simply marked as complete.
ru: Следует также заметить, что включение небольших патчей в сообщение о проблеме является приемлемой практикой, в особенности если они решают проблему, описанную в сообщении, большие же патчи, а в особенности новый код, который может требовать значительного просмотра перед тем, как он будет внесен в дерево исходных текстов, должны быть размещены на web- или ftp-сервере, а в сообщение о проблеме должен быть включён только URL указывающий на этот патч. Очень часто патчи, пересылаемые по электронной почте, а в особенности если задействована GNATS, бывают искажены, и, как следствие, чем больше патч, тем труднее будет для заинтересованных людей привести его к нормальному виду. Также то, что патч будет размещён отдельно от сообщения о проблеме, даёт возможность изменять его не отсылая полный патч в дополнение к изначальному сообщению о проблеме. И наконец, большие патчи просто увеличивают размер базы данных, так как закрытые сообщения об ошибках на самом деле не удаляются, а сохраняются и помечаются, как `closed`.

source: You should also take note that unless you explicitly specify otherwise in your PR or in the patch itself, any patches you submit will be assumed to be licensed under the same terms as the original file you modified.
pt_br: Você também deve observar que, a menos que você especifique explicitamente o contrário em seu PR ou no próprio patch, quaisquer patches enviados por você serão considerados licenciados sob os mesmos termos do arquivo original que você modificou.
ru: Вы должны также помнить, что пока вы явно не укажете обратного в вашем сообщении о проблеме или в самих патчах, будет предполагаться, что они подпадают под те же условия лицензирования, что и оригинальный файл, измененный вами.

source: Filling out the Form
pt_br: Preenchendo o formulário
ru: Заполнение шаблона

source: The email address you use will become public information and may become available to spammers. You should either have spam handling procedures in place, or use a temporary email account. However, please note that if you do not use a valid email account at all, we will not be able to ask you questions about your PR.
pt_br: O endereço de e-mail que você usa se tornará publico e poderá se tornar disponível para spammers. Você deve ter procedimentos de tratamento de spam ou usar uma conta de email temporária. No entanto, observe que, se você não usar uma conta de e-mail válida, não poderemos fazer perguntas sobre seu PR.
ru: Используемый вами адрес электронной почты станет общедоступной информацией и может попасть к спамерам. У вас должны быть процедуры обработки спама или следует использовать временный почтовый аккаунт. Однако учтите, что если вы вообще не используете действительный почтовый аккаунт, мы не сможем задать вам вопросы о вашем PR.

source: When you file a bug, you will find the following fields:
pt_br: Quando você for reportar um bug, você encontrará os seguintes campos:
ru: При подаче сообщения об ошибке вы увидите следующие поля:

source: _Summary:_ Fill this out with a short and accurate description of the problem. The synopsis is used as the subject of the problem report email, and is used in problem report listings and summaries; problem reports with obscure synopses tend to get ignored.
pt_br: _Summary (Sumário):_ Preencha com uma descrição breve e precisa do problema. A sinopse é usada como assunto do email do relatório de problemas. A sinopse é usada em listagens e resumos de relatórios de problemas; relatórios de problemas com sinopses obscuras tendem a ser ignoradas.
ru: _Краткое описание:_ Заполните это кратким и точным описанием проблемы. Краткое описание используется как тема письма с отчётом о проблеме, а также в списках и сводках отчётов; отчёты с неясными описаниями часто остаются без внимания.

source: _Severity:_ One of `Affects only me`, `Affects some people` or `Affects many people`. Do not overreact; refrain from labeling your problem `Affects many people` unless it really does. FreeBSD developers will not necessarily work on your problem faster if you inflate its importance since there are so many other people who have done exactly that.
pt_br: _Severity (Gravidade):_ Um dos `Affects only me (Afeta somente eu)`, `Affects some people (Afeta algumas pessoas)` ou `Affects many people (Afeta muitas pessoas)`. Não exagere; abstenha-se de rotular seu problema como `Afeta muitas pessoas` a menos que ele realmente afete. Os desenvolvedores do FreeBSD não irão necessariamente trabalhar no seu problema mais rápido se você inflar sua importância, uma vez que existem muitas outras pessoas que fizeram exatamente isso.
ru: _Серьезность:_ Одно из значений: `Затрагивает только меня (Affects only me)`, `Затрагивает некоторых людей (Affects some people)` или `Затрагивает многих людей (Affects many people)`. Не переоценивайте проблему; избегайте отмечать её как `Затрагивает многих людей`, если это не так. Разработчики FreeBSD не обязательно будут работать над вашей проблемой быстрее, если вы преувеличите её важность, поскольку многие другие уже поступали точно так же.

source: _Category:_ Choose an appropriate category.
pt_br: _Category (Categoria):_ Escolha uma categoria apropriada.
ru: _Категория:_ Выберите подходящую категорию.

source: The first thing you need to do is to decide what part of the system your problem lies in. Remember, FreeBSD is a complete operating system, which installs both a kernel, the standard libraries, many peripheral drivers, and a large number of utilities (the "base system"). However, there are thousands of additional applications in the Ports Collection. You'll first need to decide if the problem is in the base system or something installed via the Ports Collection.
pt_br: A primeira coisa que você precisa fazer é decidir em que parte do sistema está seu problema. Lembre-se, o FreeBSD é um sistema operacional completo, que instala tanto um kernel, bibliotecas padrão, muitos drivers de periféricos e um grande número de utilitários (o "sistema básico"). No entanto, existem milhares de aplicativos adicionais na coleção de portes. Você primeiro precisa decidir se o problema está no sistema básico ou algo instalado via a Coleção de Ports.
ru: Первое, что вам нужно сделать, — это определить, в какой части системы находится ваша проблема. Помните, что FreeBSD — это полноценная операционная система, которая включает в себя ядро, стандартные библиотеки, множество драйверов периферийных устройств и большое количество утилит («базовая система»). Однако в Коллекции портов доступны тысячи дополнительных приложений. Сначала вам нужно выяснить, связана ли проблема с базовой системой или с чем-то, установленным через Коллекцию портов.

source: Here is a description of the major categories:
pt_br: Aqui está uma descrição das categorias principais:
ru: Вот описание основных категорий:

source: If a problem is with the kernel, the libraries (such as standard C library `libc`), or a peripheral driver in the base system, in general you will use the `kern` category. (There are a few exceptions; see below). In general these are things that are described in section 2, 3, or 4 of the manual pages.
pt_br: Se um problema for com o kernel, as bibliotecas (como a biblioteca C padrão `libc`), ou o driver de algum periférico no sistema base, em geral você irá usar a categoria `kern`. (Existem algumas exceções; veja abaixo). Em geral, são coisas descritas nas seções 2, 3 ou 4 das páginas de manual.
ru: Если проблема в ядре, в библиотеках (таких как стандартная библиотека С `libc`) или в драйвере из базовой системы, то используйте категорию `kern`. (Есть несколько исключений, описанных ниже). В общем, это всё, что описано в разделах 2, 3 или 4 справочника.

source: If a problem is with a binary program such as man:sh[1] or man:mount[8], you will first need to determine whether these programs are in the base system or were added via the Ports Collection. If you are unsure, you can do `whereis _programname_`. FreeBSD's convention for the Ports Collection is to install everything underneath [.filename]#/usr/local#, although this can be overridden by a system administrator. For these, you will use the `ports` category (yes, even if the port's category is `www`; see below). If the location is [.filename]#/bin#, [.filename]#/usr/bin#, [.filename]#/sbin#, or [.filename]#/usr/sbin#, it is part of the base system, and you should use the `bin` category. These are all things that are described in section 1 or 8 of the manual pages.
pt_br: Se o problema for com um programa binário, como man:sh[1] ou man:mount[8], primeiro você precisará determinar se esses programas estão no sistema básico ou se foram adicionados por meio da Coleção de Ports. Se não tiver certeza, você pode executar `whereis _nome_do_programa_`. A convenção do FreeBSD para a Coleção de Ports é instalar tudo abaixo do [.filename]#/usr/local#, embora esse comportamento possa ser alterado por um administrador do sistema. Para estes, você usará a categoria `ports` (sim, mesmo se a categoria do port for `www`; veja abaixo). Se a localização for [.filename]#/bin#, [.filename]#/usr/bin#, [.filename]#/sbin# , ou [.filename]#/usr/sbin#, ele faz parte do sistema base, e você deve usar a categoria `bin`. Essas são todas as coisas descritas na seção 1 ou 8 das páginas de manual.
ru: Если проблема с бинарной программой, например с man:sh[1] или man:mount[8], то вам прежде всего необходимо определить принадлежность программы к базовой системе или к установке из коллекции портов. Если вы не уверены, выполните команду `whereis _имя программы_`. В FreeBSD для коллекции портов существует договоренность: установка ведется в [.filename]#/usr/local#, однако это может быть переопределено системным администратором. Для таких программ следует использовать категорию `ports` (даже если категория порта `www`; см. ниже). Если программа располагается в [.filename]#/bin#, [.filename]#/usr/bin#, [.filename]#/sbin# или в [.filename]#/usr/sbin#, то это часть базовой системы, и вам следует использовать категорию `bin`. (Несколько программ, например man:gcc[1], на самом деле используют категорию `gnu`, но не беспокойтесь об этом сейчас.) Программы этой категории описаны в разделах 1 и 8 справочной системы.

source: If you believe that the error is in the startup `(rc)` scripts, or in some kind of other non-executable configuration file, then the right category is `conf` (configuration). These are things that are described in section 5 of the manual pages.
pt_br: Se você acredita que o erro está nos scripts de inicialização `(rc)`, ou em algum outro tipo de arquivo de configuração não-executável, então a categoria correta é `conf` (configuração) . Estas são as coisas descritas na seção 5 das páginas de manual.
ru: Если вы уверены, что в стартовых скриптах `(rc)` или в каком-то ином неисполняемом конфигурационном файле присутствует ошибка, тогда верной категорией будет `conf` (configuration). Эти сущности описываются в разделе 5 справочной системы.

source: If you have found a problem in the documentation set (articles, books, man pages) or website the correct choice is `docs`.
pt_br: Se você encontrou um problema no conjunto de documentação (artigos, livros, man pages) ou no website, a escolha correta é `docs`.
ru: Если вы нашли проблему в наборе документации (статьи, книги, страницы справочной системы), правильным выбором будет `docs`.

source: if you are having a problem with something from a port named `www/_someportname_`, this nevertheless goes in the `ports` category.
pt_br: Se você estiver tendo um problema com algum port chamado `www/_algum-nome-de-port_`, mesmo assim, isso vai na categoria `ports`.
ru: Если проблема с чем-то из порта, называемого `www/_имяпорта_`, то она все же принадлежит к категории `ports`.

source: There are a few more specialized categories.
pt_br: Existem algumas categorias mais especializadas.
ru: Далее представлены более специализированные категории.

source: If the problem would otherwise be filed in `kern` but has to do with the USB subsystem, the correct choice is `usb`.
pt_br: Se o problema, por outro lado, estar colocado em `kern`, mas tem a ver com o subsistema USB, a escolha correta é `usb`.
ru: Если проблема принадлежит к `kern`, но в то же время имеет дело с подсистемой USB, то правильным выбором будет `usb`.

source: If the problem would otherwise be filed in `kern` but has to do with the threading libraries, the correct choice is `threads`.
pt_br: Se o problema, por outro lado, estiver colocado em `kern`, mas tem a ver com as bibliotecas de threads, a escolha correta é `threads`.
ru: Если проблема принадлежит к `kern` и найдена в потоковых библиотеках, правильным выбором будет `threads`.

source: If the problem would otherwise be in the base system, but has to do with our adherence to standards such as POSIX(R), the correct choice is `standards`.
pt_br: Se o problema, por outro lado, estiver no sistema base, mas tem a ver com nossa fidelidade a padrões como POSIX(R), a escolha correta é `standards`.
ru: Если проблема принадлежит к базовой системе и касается соблюдения стандартов, таких как POSIX(R), правильным выбором будет `standards`.

source: If you are convinced that the problem will only occur under the processor architecture you are using, select one of the architecture-specific categories: commonly `i386` for Intel-compatible machines in 32-bit mode; `amd64` for AMD machines running in 64-bit mode (this also includes Intel-compatible machines running in EMT64 mode); and less commonly `arm` or `powerpc`.
pt_br: Se estiver convencido de que o problema ocorrerá apenas sob a arquitetura do processador que você está usando, selecione uma das categorias específicas da arquitetura: geralmente `i386` para máquinas compatíveis com Intel 32 bits; `amd64` para máquinas AMD rodando em 64 bits (isto também inclui máquinas compatíveis com Intel rodando em modo EMT64); e menos comumente, as arquiteturas `arm` ou `powerpc`.
ru: Если вы уверены, что проблема возникнет только на используемой вами архитектуре процессора, выберите одну из архитектурно-зависимых категорий: обычно `i386` для Intel-совместимых машин в 32-битном режиме; `amd64` для машин AMD, работающих в 64-битном режиме (это также включает Intel-совместимые машины, работающие в режиме EMT64); и реже `arm` или `powerpc`.

source: These categories are quite often misused for "I do not know" problems. Rather than guessing, please just use `misc`.
pt_br: Estas categorias são muitas vezes mal utilizadas para problemas definidos como "Eu não sei". Em vez de adivinhar, por favor apenas use a categoria `misc`.
ru: Люди часто ошибаются в выборе категории. Если вы не уверены в правильности выбора, то лучше не гадать, а выбрать `misc`.

source: Correct Use of Arch-Specific Category
pt_br: Uso Correto da Categoria Específica de Arquitetura
ru: Правильное использование архитектурно-зависимых категорий

source: You have a common PC-based machine, and think you have encountered a problem specific to a particular chipset or a particular motherboard: `i386` is the right category.
pt_br: Você tem uma máquina comum baseada em PC e acha que encontrou um problema específico para um determinado chipset ou uma placa-mãe em particular: `i386` é a categoria correta.
ru: У вас простой ПК, и вы подозреваете, что столкнулись с проблемой, специфичной для конкретного чипсета или материнской платы: верная категория - `i386`.

source: Incorrect Use of Arch-Specific Category
pt_br: Uso Incorreto da Categoria Específica de Arquitetura
ru: Некорректное использование категории, зависящей от архитектуры

source: You are having a problem with an add-in peripheral card on a commonly seen bus, or a problem with a particular type of hard disk drive: in this case, it probably applies to more than one architecture, and `kern` is the right category.
pt_br: Você está tendo um problema com uma placa periférica adicional em um barramento comum, ou um problema com um tipo específico de unidade de disco rígido: neste caso, provavelmente se aplica a mais de uma arquitetura, e `kern` é a categoria correta.
ru: Если вы наблюдаете проблему с периферийной картой расширения на распространенной шине или неполадки с конкретного типа жестким диском: в этом случае возможно, что неисправность наблюдается на более чем одной архитектуре, и верным выбором будет `kern`.

source: If you really do not know where the problem lies (or the explanation does not seem to fit into the ones above), use the `misc` category. Before you do so, you may wish to ask for help on the {freebsd-questions} first. You may be advised that one of the existing categories really is a better choice.
pt_br: Se você realmente não sabe onde o problema se encaixa (ou a explicação não parece se encaixar nos itens acima), use a categoria `misc`. Antes de fazer isso, você pode pedir ajuda primeiro na {freebsd-questions}. Você pode ser avisado que com certeza uma das categorias existentes é uma escolha melhor.
ru: Если вы не знаете в чем проблема (или вам кажется, что описание не попадает ни под какую из вышеобозначенных), используйте категорию `misc`. Перед тем, как написать PR, можно для начала спросить помощи в {freebsd-questions}. Возможно, там вам подскажут, какую из существующих категорий следует выбрать.
