<!--
	The FreeBSD Documentation Project
	The FreeBSD French Documentation Project
        $FreeBSD$
	Original revision: 1.20
-->                         

<chapter id="admin">
    <title>Administration syst&egrave;me</title>

    <sect1>
    <title>O&ugrave; sont les fichiers de d&eacute;marrage du syst&egrave;me&nbsp;?</title>

      <para>De la version 2.0.5R &agrave; la version 2.2.1R, le fichier de
configuration principal &eacute;tait <filename> /etc/sysconfig </filename>.
Toutes les options sont sp&eacute;cifi&eacute;es dans ce fichier et les autres
fichiers comme <ulink url="http://www.freebsd.org/cgi/man.cgi?rc">
/etc/rc </ulink> et <filename> /etc/netstart </filename> ne font 
que l'inclure.</para>

      <para>Regardez dans le fichier <filename> /etc/sysconfig
</filename> et changez les valeurs n&eacute;cessaires pour configurer votre
syst&egrave;me. Ce fichier inclut des commentaires indiquant les valeurs &agrave;
mettre.</para>

      <para>Pour les versions 2.2.1 et suivantes, le fichier <filename>
/etc/sysconfig </filename> a &eacute;t&eacute; renomm&eacute; en <ulink
url="http://www.freebsd.org/cgi/man.cgi?rc.conf(5)"> <filename>
rc.conf </filename> </ulink> et a &eacute;t&eacute; &eacute;pur&eacute; au passage. Le fichier
<filename> /etc/netstart </filename> a aussi &eacute;t&eacute; renomm&eacute; en <filename>
rc/network </filename> comme cela tous les fichiers peuvent &ecirc;tre
copi&eacute;s gr&acirc;ce &agrave; une seule commande&nbsp;: <ulink
url="http://www.freebsd.org/cgi/man.cgi?cp"> cp </ulink>
<filename>/usr/src/etc/rc* /etc</filename>. </para>

      <para>Le fichier <filename>/etc/rc.local</filename> existe
toujours et peut &ecirc;tre utilis&eacute; pour d&eacute;marrer des services additionnels
comme <ulink
url="http://www.freebsd.org/cgi/ports.cgi?^inn">INN</ulink> ou pour
positionner certaines valeurs.</para>
      
      <para>Le fichier <filename>/etc/rc.serial </filename> permet
d'initialiser les ports s&eacute;rie (par exemple mettre en place les
caract&eacute;ristiques du port, etc..).</para>

      <para>Le fichier <filename>/etc/rc.i386 </filename> est
sp&eacute;cifique aux param&egrave;tres des plateformes Intel, comme l'&eacute;mulation
iBCS2 ou la configuration de la console syst&egrave;me d'un PC.</para>
      
      <para>Avec la version 2.1.0R, vous pouvez d&eacute;finir des fichiers de
d&eacute;marrage "locaux" se trouvant dans un r&eacute;pertoire sp&eacute;cifi&eacute; dans le
fichier <filename>/etc/sysconfig</filename> (ou le fichier <filename>
/etc/rc.conf </filename>): 
<programlisting>
# Emplacement des fichiers de d&eacute;marrage locaux
local_startup=/usr/local/etc/rc.local.d
</programlisting></para>

      <para>Chaque fichier se terminant par <filename> .sh </filename>
sera &eacute;x&eacute;cut&eacute; dans l'ordre alphab&eacute;tique.</para>

      <para>Si vous voulez vous assurez d'un certain ordre de
d&eacute;marrage sans changer le nom des fichiers, vous pouvez utiliser un
sch&eacute;ma similaire &agrave; celui qui suit, en faisant pr&eacute;c&eacute;der chaque fichier
de chiffres pour assurer l'ordre de d&eacute;marrage: 
<programlisting>
10news.sh
15httpd.sh
20ssh.sh
 </programlisting></para>

      <para>Cela peut vous sembler un peu laid (ou SysV :-)) mais cela
fournit une fa&ccedil;on simple pour les packages locaux ajout&eacute;s sans &ecirc;tre
oblig&eacute; d'&eacute;diter <filename> /etc/rc.local </filename>. La plupart des
ports ou des packages assument que le r&eacute;pertoire <filename>
/usr/local/etc/rc.d </filename> permet le d&eacute;marrage des programmes
locaux.</para>

    </sect1>

    <sect1>
      <title>Comment ajouter simplement un utilisateur&nbsp;?</title>
      <para>Utilisez la commande <ulink
url="http://www.freebsd.org/cgi/man.cgi?adduser"> adduser
</ulink></para>

      <para>Il existe aussi un autre outil nomm&eacute;
<filename>``new-account''</filename> &eacute;crit en Perl par <ulink
url="mailto:roberto@FreeBSD.ORG">Ollivier Robert</ulink>. Demandez le
lui. Cet outil est actuellement en cours de d&eacute;veloppements suppl&eacute;mentaires</para>
      
      <para>Pour retirer un utilisateur, utilisez la commande <ulink
url="http://www.freebsd.org/cgi/man.cgi?rmuser">rmuser</ulink>.</para>

    </sect1>

    <sect1>
      <title>Comment ajouter un nouveau disque dur &agrave; mon syst&egrave;me FreeBSD&nbsp;?</title>

      <para> Voyez le <ulink
url="&url.tutorials;diskformat/index.html">tutoriel</ulink> sur le formatage des
disques dur.</para>

    </sect1>

    <sect1>
      <title>Comment utiliser mon nouveau disque amovible&nbsp;? </title>

      <para>Que ce soit un disque amovible de type ZIP ou EZ (ou
m&ecirc;me une disquette), ou un disque dur, une fois install&eacute; et
reconnu par le syst&egrave;me et que vous avez ins&eacute;r&eacute; une cartouche/disquette, la
manipulation est la m&ecirc;me pour tous les p&eacute;riph&eacute;riques.</para>

      <para><anchor id="disklabel">(Cette section est bas&eacute;e sur <ulink url="http://www.vmunix.com/mark/FreeBSD/ZIP-FAQ.html">la FAQ </ulink> des lecteurs ZIP de Mark Mayo)</para>
      
      <para>Si c'est un disque ZIP ou une disquette DOS, il y a d&eacute;j&agrave; un syst&egrave;me de fichier DOS install&eacute;, vous pouvez utilisez les commandes suivantes:
<programlisting>
mount -t msdos /dev/fd0c /floppy
</programlisting>s'il s'agit d'une disquette; ou:
<programlisting>
mount -r msdos /dev/sd2s4 /zip
</programlisting>s'il s'agit d'un lecteur ZIP dans sa configuration d'origine.
</para>
      
      <para>Pour les autres types de disques, voyez leur partitionnement en utilisant <filename> fdisk </filename> ou <filename> /stand/sysinstall </filename>.</para>

      <para>Les exemples qui suivent supposent que vous disposez d'un disque ZIP sur sd2, le troisi&egrave;me disque SCSI.</para>

      <para>Si votre disque amovible n'est pas une disquette, ou tout autre disque amovible que vous ne d&eacute;sirez par partager avec d'autres personnes, il vaut mieux mettre un syst&egrave;me de fichiers BSD dessus. Vous pourrez avoir des noms longs, une am&eacute;lioration de performances et une meilleur stabilit&eacute;. Pour commencer, vous devez effacer la partition ou le syst&egrave;me de fichiers DOS. Vous pouvez utiliser l'utilitaire <ulink url="http://www.freebsd.org/cgi/man.cgi?fdisk"> fdisk </ulink> ou <filename> /stand/sysinstall </filename>, ou pour un disque d'une petite capacit&eacute;, d&eacute;truire la table des partitions FAT et utiliser le partitionnement BSD standard&nbsp;:
<programlisting>
dd if=/dev/zero of=/dev/rsd2 count=2
disklabel -Brw sd2 auto
</programlisting></para>

      <para>Vous pouvez utiliser disklabel ou <filename> /stand/sysinstall </filename> pour cr&eacute;er plusieurs partitions BSD. Vous effectuerez probablement ces op&eacute;rations si vous ajoutez de l'espace de "swap" sur un disque fixe, mais il est inconcevable de le faire sur un disque amovible ZIP.</para>

      <para>Pour finir construisez un nouveau syst&egrave;me de fichier, utilisant tout l'espace disponible sur votre lecteur ZIP&nbsp;:
<programlisting>
newfs /dev/rsd2c
</programlisting> et montez le&nbsp;:
<programlisting>
mount /dev/sd2c /zip
</programlisting></para>

      <para>C'est surement une bonne id&eacute;e d'ajouter la ligne suivante au fichier <ulink url="http://www.freebsd.org/cgi/man.cgi?fstab"> /etc/fstab </ulink>, cela vous permettra de ne taper que "mount /zip"  par la suite&nbsp;:
<programlisting>
/dev/sd2c /zip ffs rw,noauto 0 0
</programlisting></para>

    </sect1>
    <sect1>
      <title>Comment monter une partition DOS &eacute;tendue&nbsp;?</title>
      <para>Les partitions DOS &eacute;tendues se trouvent apr&egrave;s la fin de toutes les partitions primaires. Par exemple, si vous avez une partition "E" en tant que partition DOS &eacute;tendue sur le deuxi&egrave;me disque SCSI, vous devez cr&eacute;er le fichier sp&eacute;cial pour la partition 5 dans /dev et monter /dev/sd1s5&nbsp;:
<programlisting>
# cd /dev 
# ./MAKEDEV sd1s5 
# mount -t msdos /dev/sd1s5 /dos/e 
</programlisting></para>
    </sect1>

    <sect1>
      <title>Puis-je monter d'autres syst&egrave;mes de fichiers sous FreeBSD&nbsp;?</title>

      <para>Les CDROM <emphasis remap="bf"> Digital UNIX </emphasis>
au format UFS peuvent &ecirc;tre mont&eacute;s directements sous FreeBSD. Il peut
&ecirc;tre tr&egrave;s difficile, par contre, de monter des partitions disques de
Digital UNIX, ou d'autres syst&egrave;mes supportant l'UFS. Cela d&eacute;pend des
partitionnements effectu&eacute;s sur le syst&egrave;me en question.</para>

      <para><emphasis remap="bf">Linux:</emphasis> Les version 2.2 et
sup&eacute;rieures incluent le support des partitions <emphasis remap="bf">
ext2fs </emphasis>. Pour plus d'informations voyez la page de manuel
de <ulink url="http://www.freebsd.org/cgi/man.cgi?mount_ext2fs">
mount_ext2fs </ulink>.</para>

      <para>Toute autre information sur le sujet est appr&eacute;ci&eacute;e.</para>

    </sect1>

    <sect1>
      <title>Comment utiliser le programme de d&eacute;marrage de NT pour d&eacute;marrer FreeBSD&nbsp;?</title>
      <para>Il faut pour cela copier le premier secteur de votre
partition FreeBSD dans un fichier sur une partition DOS/NT. Nous
supposerons qu'il s'appelle <filename> c:&bsol;bootsect.bsd
</filename> (&eacute;quivalent de <filename> c:&bsol;bootsect.dos
</filename>). Il suffit d'&eacute;diter le fichier <filename>
c:&bsol;boot.ini </filename> pour qu'il ressemble &agrave; ceci:</para>
      
      <para><programlisting>
[boot loader]  
timeout=30
default=multi(0)disk(0)rdisk(0)partition(1)\WINDOWS  
[operating systems]  
multi(0)disk(0)rdisk(0)partition(1)\WINDOWS="Windows NT"
C:\BOOTSECT.BSD="FreeBSD"
C:\="DOS"  </programlisting> Cette
proc&eacute;dure implique que DOS, NT ou FreeBSD soient install&eacute;s sur le
m&ecirc;me disque. Dans mon cas DOS et NT sont install&eacute;s
respectivement sur la premi&egrave;re partition du disque et FreeBSD sur la
seconde. FreeBSD est aussi configur&eacute; pour d&eacute;marrer depuis sa partition
et <emphasis remap="bf"> non </emphasis> depuis le MBR du
disque.</para>

      <para>Monter une disquette pr&eacute;format&eacute;e DOS (si vous cette
partition n'est pas en FAT, mais en NTFS) sous <filename> /mnt
</filename>.</para>

      <para><programlisting> 
dd if=/dev/rsd0a of=/mnt/bootsect.bsd bs=512 count=1 

</programlisting> Red&eacute;marrez en mode DOS ou NT. Si vous
avez une partition NTFS copiez le fichier <filename> bootsect.bsd
</filename> de la disquette dans le r&eacute;pertoire C:&bsol;. Modifiez les
attributs (permissions) du fichier boot.ini.</para>

      <para><programlisting> 
attrib -s -r c:\boot.ini
</programlisting>Ajoutez la ligne correcte au fichier boot.ini et
restaurez les anciens attributs.</para>

      <para><programlisting>
attrib -s -r c:\boot.ini
</programlisting>Si FreeBSD d&eacute;marre depuis le MBR, restaurez-le avec
la commande DOS <filename> fdisk /MBR </filename> apr&egrave;s avoir
reconfigur&eacute; FreeBSD pour d&eacute;marrer depuis sa partition native.</para>

    </sect1>
    
    <sect1>
      <title>Comment d&eacute;marrer FreeBSD et Linux grace &agrave; LILO&nbsp;?</title>
      <para>Si vous avez install&eacute; FreeBSD et Linux sur le m&egrave;me disque,
suivez les instructions du manuel de LILO pour d&eacute;marrer sur d'autres
syst&egrave;mes que Linux. En r&eacute;sum&eacute; il faut&nbsp;:</para>

      <para>D&eacute;marrer sous Linux et ajouter les lignes suivantes au
fichier <filename> /etc/lilo.conf </filename>:  
<programlisting>
other=/dev/hda2  
table=/deb/hda  
label=FreeBSD
</programlisting>(l'exemple pr&eacute;c&eacute;dant suppose que la partition FreeBSD
est connue par linux sous le nom <filename> /dev/hda2 </filename>.
Ensuite lancez <filename> lilo </filename> sous root, et c'est
fini.</para>

      <para>Si FreeBSD se trouve sur un autre disque vous devez
ajouter <filename> loader=/boot/chain.b </filename> au fichier de
configuration de lilo&nbsp;: 
<programlisting>       
other=/dev/sdb4
table=/dev/sdb  
loader=/boot/chain.b  
label=FreeBSD  </programlisting>
Dans certains cas, vous devez sp&eacute;cifier le num&eacute;ro du disque connu par
le BIOS au programme de d&eacute;marrage de FreeBSD pour d&eacute;marrer sur le
deuxi&egrave;me disque. Par exemple, si votre disque SCSI contenant FreeBSD
est trouv&eacute; par le BIOS comme disque num&eacute;ro 1, vous devez taper la ligne
suivante au prompt du programme de d&eacute;marrage: 
<programlisting> 
Boot: 1:sd(0,a)/kernel 
</programlisting> Vous pouvez configurer le <ulink
url="http://www.freebsd.org/cgi/man.cgi?boot(8)"> programme de
d&eacute;marrage </ulink> de FreeBSD version 2.2.5 ou sup&eacute;rieure pour prendre
cette chaine par d&eacute;faut.</para>

      <para>Le document <ulink
url="http://sunsite.unc.edu/LDP/HOWTO/mini/Linux+FreeBSD.html">Linux+FreeBSD
mini-HOWTO</ulink> est une tr&egrave;s bonne r&eacute;f&eacute;rence sur 
l'interop&eacute;rabilit&eacute; entre FreeBSD et Linux.</para>

    </sect1>

    <sect1>
      <title>Comment d&eacute;marrer FreeBSD et Linux depuis BootEasy&nbsp;?</title>

      <para>Il faut installer LILO au d&eacute;but de votre partition de
d&eacute;marrage de Linux au lieu du MBR. Vous pouvez alors d&eacute;marrer LILO
depuis BootEasy.</para>

      <para>Si vous utilisez Linux et Windows-95, c'est la meilleur
fa&ccedil;on d'installer LILO si vous voulez continuer &agrave; d&eacute;marrer Linux apr&egrave;s
avoir r&eacute;install&eacute; Windows-95 (qui lui ne tient pas contre des autres
syst&egrave;mes et se croit seul sur le MBR).</para>

    </sect1>
    <sect1>
      <title>Est-ce dangereux d'utiliser un disque d&eacute;di&eacute;&nbsp;?</title>

      <para>La proc&eacute;dure d'installation vous permet de choisir deux
fa&ccedil;ons diff&eacute;rentes pour partitionner vos disques. Par d&eacute;faut, elle
permet de les rendre compatibles avec d'autres syst&egrave;mes d'exploitation
se trouvant sur votre ordinateur en utilisant les entr&eacute;es des tables
de fdisk (appel&eacute;s "slices" sous FreeBSD), en faisant en sorte qu'une
"slice" FreeBSD corresponde &agrave; une partition. Vous pouvez aussi
installer un selecteur de d&eacute;marrage pour choisir de d&eacute;marrer sous un
autre syst&egrave;me d'exploitation.</para>

      <para>Comme ceci correspond &agrave; la plupart des cas de personnes
venant des PC, les personnes venant d'Unix et qui d&eacute;sirent mettre en
place une machine pour y faire tourner FreeBSD et juste FreeBSD,
utilisent la proc&eacute;dure classique d'installation d'Unix, ou Unix
utilise le disque au complet, du premier secteur au dernier. Une
v&eacute;ritable table pour fdisk n'est d'aucune utilit&eacute; dans le vas d'une
machine utilisant FreeBSD 24h/24, 7jours sur 7, car aucun autre
syst&egrave;me d'exploitation ne sera d&eacute;marr&eacute;. Donc si vous s&eacute;lectionnez
``A)ll FreeBSD '' dans l'&eacute;diteur de partition du programme
d'installation et r&eacute;pondez ``No'' &agrave; la question qui suit, vous serez
dans ce cas. Notez que cela implique que le programme de
d&eacute;marrage BSD correspond au MBR de ce disque. N'essayez pas d'en
r&eacute;installer un sous peine de d&eacute;truire le pr&eacute;c&eacute;dent.</para>

      <para>Donc pourquoi est-ce donc ``dangereux''&nbsp;? Un disque
configur&eacute; de la sorte ne contient pas de table fdisk valides, pour la
plupart des utilitaires PC. Suivant la fa&ccedil;on dont ils ont &eacute;t&eacute; con&ccedil;us,
ils vous avertissent ou tout simplement ne disent rien et d&eacute;truisent
le programme de d&eacute;marrage BSD sans avertissement. Certains syst&egrave;mes
d'exploitation tr&egrave;s utilis&eacute;s sur PC, sont connus pour agir de la
sorte (bien s&ucirc;r, ils agissent de la sorte sous le couvert de syst&egrave;me
"orient&eacute;-utilisateur"). Au moins un BIOS de chez Award, qui est par
exemple utilis&eacute; sur les HP Netserver (mais sur d'autre syst&egrave;mes
aussi), est connu pour ignorer tout disque dur n'ayant pas de table
fdisk valide. Lorsque votre machine d&eacute;marre il ignore tout simplement
de tels disques, tente de d&eacute;marrer sur une disquette, et vous affiche
un ``Read error''. Tr&egrave;s impressionnant, non&nbsp;?. C'est ce que certains
appellent un syst&egrave;me "orient&eacute;-utilisateur".</para>
     
      <para>Les avantages de ce partitionnement sont&nbsp;: FreeBSD utilise
le disque au complet, il n'y a donc pas de besoin de garder quelques
'pistes' au d&eacute;but du disque qui ne servaient &agrave; rien sauf pour un
mod&egrave;le de partitionnement vieux et simpliste qui n'a maintenant plus
aucun sens. Ces contraintes &eacute;tant ce que l'on peut appeler la plus
grosse prise de t&ecirc;te lors de l'installation des syst&egrave;mes
d'exploitations sur PS, et qui menaient le plus souvent &agrave; deux fa&ccedil;on
compl&egrave;tement redondantes de stockage des informations dans les tables
fdisk. Voyez le chapitre sur <ulink url="missingos"> ``Missing
Operating System''</ulink>. Dans le cas d'un disque ``dangereusement d&eacute;di&eacute;'',
le programme de d&eacute;marrage BSD commence au secteur 0, qui est le seul
secteur ne changeant de valeur C/H/S, pour les valeurs du disque du
BIOS. Vous pouvez donc, dans ce cas, interchanger des disques entre
plusieurs controleurs ou syst&egrave;mes utilisant des sch&eacute;mas de translation
diff&eacute;rents sans vous poser de questions.</para>

      <para>Pour passer d'un disque ``dangereusement d&eacute;di&eacute;'' &agrave; un
disque normal de PC, il y a deux solutions simples. La premi&egrave;re est de
recouvrir le MBR d'octets vides, pour permettre de faire croire que le
disque est vierge. Pour pouvez le faire de la fa&ccedil;on suivante:
<programlisting>dd if=/dev/zero of=/dev/rds0 count=15</programlisting>
Ou en utilisant une fonctionnnalit&eacute; non-document&eacute;e de DOS&nbsp;:
<programlisting> fdisk /mbr </programlisting> qui installe aussi un
nouveau MBR, en recouvrant le programme de d&eacute;marrage BSD.</para>

    </sect1>

    <sect1>
      <title>Comme faire pour ajouter plus de "swap"&nbsp;?</title>
      
      <para>La meilleur fa&ccedil;on de faire, est d'augmenter la taille de
votre partition de swap, ou de prendre cette excuse pour ajouter un
autre disque.</para>
      
      <para>Ajouter du "swap" sur un autre disque permet plus d'augmenter
la rapidit&eacute; que d'en ajouter sur le m&ecirc;me disque. Par exemple, si
vous compilez des fichiers qui se trouvent sur un disque et que le "swap"
se trouve sur un autre disque, cela va beaucoup plus vite d'avoir
le "swap" et les sources sur le m&ecirc;me disque. Ceci est
sp&eacute;cialement vrai pour les disques SCSI.</para>

      <para>Les disques IDE ne permettent pas l'acc&egrave;s &agrave; deux disques
sur le m&ecirc;me canal au m&ecirc;me moment (FreeBSD ne supporte pas
le mode 4, donc toutes les entr&eacute;es/sorties disques sont
``programm&eacute;es''). Je vous sugg&egrave;re de mettre le "swap" sur un autre
disque aussi. Les disques durs sont si peu couteux, que cela ne vaut
pas le coup de tout mettre sur un.</para>

      <para>C'est une tr&egrave;s mauvaise id&eacute;e de mettre le fichier de
"swap" sur une partition NFS, sauf si vous disposez d'un environnement
r&eacute;seau extr&egrave;mement rapide, et d'un tr&egrave;s bon serveur NFS.</para>

      <para>Voici un exemple pour ajouter 64Mo de swap en utilisant un
fichier se nommant <filename> /usr/swap0 </filename>.</para>
      <para>Assurez vous que votre noyau est compil&eacute; avec la ligne
<programlisting>  
pseudo-device vn 1 # #Vnode driver (turns a file into a device)
 </programlisting>Le noyau GENERIC la contient par
d&eacute;faut.

<itemizedlist>
	  <listitem>
	    <para>Cr&eacute;ez un vn-device : 
<programlisting> 
cd /dev 
sh./MAKEDEV vn0
 </programlisting></para>
	  </listitem>
	  <listitem>
	    <para>Cr&eacute;ez le fichier de "swap" (<filename>/usr/swap0</filename>). 
<programlisting> dd if=/dev/zero of=/usr/swap0 bs=1024k count=64 </programlisting></para>
	  </listitem>
	  <listitem>
	    <para>Activez le fichier de "swap" dans le fichier
<filename> /etc/rc.conf </filename> <programlisting>
swapfile="/usr/swap0" # Set to name of swapfile if aux swapfile desired. 
</programlisting></para>
	  </listitem>
	  <listitem> <para>Rebootez la machine</para> </listitem>
	</itemizedlist></para>

      <para>Pour activer le fichier de "swap" imm&eacute;diatement, tapez 
<programlisting>
vnconfig -ce /dev/vn0c /usr/swap0 swap
</programlisting></para>
    </sect1>

    <sect1>
      <title>J'ai des probl&egrave;mes pour installer mon imprimante.</title>
      <para>R&eacute;f&eacute;rez-vous &agrave; la section sur les <ulink
url="../handbook/printing.html">imprimantes du Handbook</ulink>. Elle
couvre l'essentiel des probl&egrave;mes que l'on peut rencontrer.</para>

    </sect1>

    <sect1>
      <title>Le clavier est mal configur&eacute; sur mon ordinateur.</title>
      <para>Le programme <filename>kbdcontrol</filename> comporte une
option permettant de charger une configuration  clavier diff&eacute;rente.
Vous trouverez dans <filename>/usr/share/syscons/keymaps</filename>
diff&eacute;rents fichiers de configuration. Choisissez celle voulue et
chargez la&nbsp;: <programlisting> kbdcontrol -l fr.iso
</programlisting></para>

      <para>Dans tous les cas le programme <ulink
url="http://www.freebsd.org/cgi/man.cgi?kbdcontrol">kbdcontrol</ulink>
recherche dans <filename>/usr/share/syscons/keymaps</filename> un
fichier se terminant par <filename>.kbd</filename>.</para>

      <para>Vous pouvez le configurer dans le fichier
<filename>/etc/sysconfig</filename> (ou <ulink
url="http://www.freebsd.org/cgi/man.cgi?rc.conf(5)">rc.conf</ulink>).
Regardez les commentaires apropri&eacute;s dans ce fichier.</para>
      
      <para>Pour les versions 2.0.5 et suivantes, tout ce qui est
relatif aux fontes du texte, &agrave; la configuration du clavier se trouve dans
<filename>/usr/share/syscons</filename>.</para>

      <para>Actuellement les configurations de claviers suivantes sont support&eacute;es&nbsp;:
<itemizedlist>
         <listitem><para>Belgian ISO-8859-1  </para></listitem>
         <listitem><para>Brazilian 275 keyboard Codepage 850  </para></listitem>
         <listitem><para>Brazilian 275 keyboard ISO-8859-1  </para></listitem>
         <listitem><para>Danish Codepage 865  </para></listitem>
         <listitem><para>Danish ISO-8859-1  </para></listitem>
         <listitem><para>French ISO-8859-1  </para></listitem>
         <listitem><para>German Codepage 850  </para></listitem>
         <listitem><para>German ISO-8859-1  </para></listitem>
         <listitem><para>Italian ISO-8859-1  </para></listitem>
         <listitem><para>Japanese 106  </para></listitem>
         <listitem><para>Japanese 106x  </para></listitem>
         <listitem><para>Latin American  </para></listitem>
         <listitem><para>Norwegian ISO-8859-1  </para></listitem>
         <listitem><para>Polish ISO-8859-2 (programmer's)  </para></listitem>
         <listitem><para>Russian Codepage 866 (alternative)  </para></listitem>
         <listitem><para>Russian koi8-r (shift)  </para></listitem>
         <listitem><para>Russian koi8-r  </para></listitem>
         <listitem><para>Spanish ISO-8859-1  </para></listitem>
         <listitem><para>Swedish Codepage 850  </para></listitem>
         <listitem><para>Swedish ISO-8859-1  </para></listitem>
         <listitem><para>Swiss-German ISO-8859-1  </para></listitem>
         <listitem><para>United Kingdom Codepage 850  </para></listitem>
         <listitem><para>United Kingdom ISO-8859-1  </para></listitem>
         <listitem><para>United States of America ISO-8859-1  </para></listitem>
         <listitem><para>United States of America dvorak  </para></listitem>
         <listitem><para>United States of America dvorakx  </para></listitem>
	</itemizedlist>
</para>
    </sect1>
    
    <sect1>
      <title>Comment faire en sorte que les quotas utilisateurs fonctionnent correctement&nbsp;?</title>
      <para>
<itemizedlist>
	  <listitem><para>Ne mettez pas de quotas sur '/',</para></listitem>
	  <listitem><para>Mettez le fichier des quotas sur le syst&egrave;me de fichiers 
qui en dispose, par ex&nbsp;:
<programlisting> 
Syst&egrave;me de fichier	Emplacement du fichier des quotas
/usr				/usr/admin/quotas
/home				/home/admin/quotas
...
</programlisting></para></listitem></itemizedlist></para>
	  
    </sect1>

    <sect1>
      <title>Qu'est-ce qui ne va pas avec ma configuration de ccd&nbsp;?</title>
      
      <para>Le symptome est le suivant :
<programlisting>
# ccdconfig -C
ccdconfig: ioctl (CCDIOCSET): /dev/ccd0c: Inappropriate file type or format 
#
</programlisting></para>
      <para>Ceci apparait la plupart du temps lorsque vous essayez de
concat&eacute;ner les partitions ``c'', qui par d&eacute;faut ont comme type
``unused''. Le gestionnaire de disque ccd n&eacute;cessite que le type de la
partition soit de type FS_BSDFFS. Dans ce cas, &eacute;ditez le label des
disques &agrave; concat&eacute;ner et changez le type des partitions en type
``4.2BSD''.</para>

    </sect1>

    <sect1>
      <title>Pourquoi je ne peux pas &eacute;diter le label de mes disques concat&eacute;n&eacute;s&nbsp;? </title>

      <para>Le symptome est le suivant&nbsp;:
<programlisting>
# disklabel ccd0 
(&ccedil;a affiche quelque chose de particulier ici, donc essayons de l'&eacute;diter) 
# disklabel -e ccd0 
(&eacute;dition, sauvegarde, sortie)
disklabel: ioctl DIOCWDINFO: No disk label on disk; 
use "disklabel -r" to install initial label 
# 
</programlisting></para>
      
      <para>Cela apparait souvent lorsque le label retourn&eacute; par le
gestionnaire de disques concat&eacute;n&eacute; est un faux, un qui n'est pas
v&eacute;ritablement sur le disque. Pour r&eacute;soudre ce probl&egrave;me il faut &eacute;crire
explicitement sur le disque, comme ceci&nbsp;:
<programlisting> 
# disklabel ccd0 > /tmp/disklabel.tmp  
# disklabel -Rr ccd0 /tmp/disklabel.tmp  
# disklabel -e ccd0 
(maintenant cela doit fonctionner correctement)
</programlisting></para>

    </sect1>

    <sect1>
      <title>Est-ce que FreeBSD supporte les communications inter-processus de type Syst&egrave;me V (IPC)&nbsp;?</title>
      <para>Oui, FreeBSD supporte les communications inter-processus
de type Syst&egrave;me V, IPC. Cela inclue la m&eacute;moire partag&eacute;e, les files de
messages et les s&eacute;maphores. Vous devez ajouter les lignes suivantes &agrave; 
votre fichier de configuration du noyau pour les activer&nbsp;:</para>
<para><programlisting>
options    SYSVSHM 
options    "SHMMAXPGS=64"   # 256Ko de m&eacute;moire partag&eacute;e
options    SYSVSEM          # activation des s&eacute;maphores
options    SYSVMSG          # activation des files de messages
</programlisting>Recompilez le noyau et installez le.</para>

     <para><emphasis remap="bf">Note&nbsp;:</emphasis> Vous aurez s&ucirc;rement
besoin d'augmenter SHMMAXPGS &agrave; un nombre plus &eacute;lev&eacute;, comme 4096 (16M!)
si vous avez besoin d'utiliser GIMP. 256Ko est largement suffisant
pour la m&eacute;moire partag&eacute;e dont &agrave; besoin X11R6.</para>
      </sect1>

    <sect1>
      <title>Comment configurer sendmail pour fonctionner avec UUCP&nbsp;?</title>

      <para>La configuration de sendmail fournie avec FreeBSD,
correspond &agrave; un site directement connect&eacute; &agrave; l'Internet. Les sites qui
utilisent  UUCP pour &eacute;changer du courrier &eacute;lectronique doivent
installer un autre fichier de configuration pour sendmail. </para>

      <para>Modifier directement le fichier <filename>
/etc/sendmail.cf </filename> est r&eacute;serv&eacute; la plupart du temps aux
gourous. La version 8 de sendmail dispose d'une interface <ulink
url="http://www.freebsd.org/cgi/man.cgi?m4">m4</ulink> de g&eacute;n&eacute;ration
du fichier de configuration, qui encapsule le fichier de configuration
dans un format abstrait de haut niveau. Vous devez trouvez les
diff&eacute;rents fichiers de configuration dans le r&eacute;pertoire <filename>
/usr/src/usr.sbin/sendmail/cf </filename>.</para>

      <para>Si vous n'avez pas install&eacute; tous les sources du syst&egrave;me,
vous pouvez trouver les diff&eacute;rents fichiers de configuration de
sendmail dans un fichier s&eacute;par&eacute; des autres sources sur le CD-ROM. Si
vous avez mont&eacute; le CD-ROM ex&eacute;cutez les commandes suivantes&nbsp;:</para>
<para><programlisting>
cd /usr/src
tar -xvzf /cdrom/dists/src/ssmailcf.aa
</programlisting></para>
      
      <para>Cela correspond juste &agrave; une centaine de kilo-octets. Le
fichier <filename>README</filename> dans le r&eacute;pertoire
<filename>cf</filename> vous explique rapidement comment fonctionnne
m4.</para>

      <para>Pour utiliser UUCP, vous devez utiliser la fonctionnnalit&eacute;
<emphasis>mailertable</emphasis>. Elle permet &agrave; sendmail de constituer
une base de donn&eacute;es pour lui permettre de router le courrier
correctement.</para>

      <para>Pour commencer, vous devez cr&eacute;er une fichier de
configuration <filename>.mc</filename>. Tous ces types de fichiers se
trouvent dans le r&eacute;pertoire
<filename>/usr/src/usr.sbin/sendmail/cf/cf</filename>. Il y a quelques
fichiers d'exemples dans ce r&eacute;pertoire pouvant vous aider. En
supposant que vous avez appel&eacute; ce fichier <filename>foo.mc</filename>,
tout ce que vous devez faire pour le convertir en un
fichier valide de configuration de sendmail,
<filename>sendmail.cf</filename> est&nbsp;:</para>

<para><programlisting>
cd /usr/src/usr.sbin/sendmail/cf/cf
make foo.cf
cp foo.cf /etc/sendmail.cf
</programlisting></para>

      <para>Un fichier classique ressemble &agrave; ceci:</para>
<para><programlisting>
include(`../m4/cf.m4') 
VERSIONID(`Votre num&eacute;ro de version) 
OSTYPE(bsd4.4) 
FEATURE(nodns) 
FEATURE(nocanonify) 
FEATURE(mailertable) 

define(`UUCP_RELAY', nom.du.relai.uucp) 
define(`UUCP_MAX_SIZE', 200000) 

MAILER(local) 
MAILER(smtp) 
MAILER(uucp) 

Cw    alias.de.votre.nom.de.machine
Cw    votrenomdenoeuduucp.UUCP 
</programlisting></para>

      <para>Les directives <emphasis>nodns</emphasis>et
<emphasis>nocanonify</emphasis> forcent sendmail &agrave; ne pas utiliser le
DNS lors de l'envoi du courrier. La directive
<emphasis>UUCP_RELAY</emphasis> est utilis&eacute;e pour des raisons assez
bizarres; ne posez pas de questions et utilisez-la. Mettez juste un nom
de machine capable de recevoir du courrier en UUCP. La plupart du
temps il faut mettre le nom du serveur de messagerie de votre
fournisseur d'acc&egrave;s.</para>
      
      <para>Apr&egrave;s avoir d&eacute;fini tout ceci, vous avez besoin d'un
fichier <filename>/etc/mailertable</filename>. Voici un exemple de ce
type de fichier&nbsp;:</para>
<para><programlisting>
#
# makemap hash /etc/mailertable.db < /etc/mailertable 
# 
horus.interface-business.de   uucp-dom:horus 
.interface-business.de        uucp-dom:if-bus 
interface-business.de         uucp-dom:if-bus 
.heep.sax.de                  smtp8:%1 
horus.UUCP                    uucp-dom:horus 
if-bus.UUCP                   uucp-dom:if-bus 
.			      uucp-dom:sax 
</programlisting></para>

<para>Les trois premi&egrave;res lignes font en sorte d'envoyer
le courrier &agrave; des serveurs UUCP ``voisins'' et non pas au serveur par
d&eacute;faut, pour permettre de racourcir le temps d'envoi des messages. La
ligne suivante permet d'envoyer le courrier sur le domaine local en
protocole SMTP. Et pour finir, les ``voisins'' UUCP sont mentionner
dans la la notation de domaine .UUCP, permettant au format de mail
``voisin-uucp!destinataire'' d'&eacute;craser les r&egrave;gles par d&eacute;faut. La
derni&egrave;re ligne doit toujours &ecirc;tre un ``.'', qui repr&eacute;sente toutes les
destinations, qui doit correspondre &agrave; un serveur de messagerie UUCP
voisin, et qui sert de passerelle de courrier &eacute;l&eacute;ctronique vers le
reste du monde. Tous les noms de noeuds se trouvant apr&egrave;s le mot cl&eacute;
<filename>uucp-dom:</filename>doivent &ecirc;tre des noms valides de voisins
UUCP, que vous pouvez v&eacute;rifier en utilisant la commande
<filename>uuname</filename></para>

<para>Pour vous rappeler que ce fichier doit &ecirc;tre converti en
fichier DBM pour pouvoir &ecirc;tre utilis&eacute;, la ligne de commande
n&eacute;cessaire &agrave; sa cr&eacute;ation est rappel&eacute;e dans les commentaires du fichier
mailertable. Vous devez lancer cette commande &agrave; chaque fois que vous
changez quelque chose dans ce fichier.</para>

      <para>Pour finir&nbsp;: si vous n'etes pas certain de votre
configuration d'envoi de messages &eacute;lectroniques, rappellez-vous
l'option <filename>-bt</filename> de sendmail. Cela lance sendmail en
<emphasis>mode test</emphasis>&nbsp;; entrez simplement ``0 '' suivi de
l'adresse que vous voulez tester. La derni&egrave;re ligne vous indiquera
alors le type d'agent utilis&eacute; pour l'envoi, la machine auquelle
l'agent enverra le courrier, et l'adresse &agrave; laquelle il l'enverra. Pour
quitter ce mode tapez Control-D.</para>
<para><programlisting>
j@uriah 191% sendmail -bt 
ADDRESS TEST MODE (ruleset 3 NOT automatically invoked) 
Enter &lt;ruleset&gt; &lt;address&gt; 
> 0 foo@interface-business.de 
rewrite: ruleset  0   input: foo @ interface-business . de 
... 
rewrite: ruleset  0 returns: $# uucp-dom $@ if-bus $: foo \ 
< @ interface-business . de >
> ^D 
j@uriah 192% 
</programlisting></para>
    </sect1>
    
    <sect1>
      <title>Comment mettre en oeuvre le courrier &eacute;lectronique avec une connexion temporaire &agrave; un r&eacute;seau&nbsp;?</title>

      <para>Si vous disposez d'un adresse IP statique, vous ne devez rien changer. Definissez juste votre nom de machine pour qu'il corresponde &agrave; votre nom de machine internet et sendmail s'occupera du reste.</para>

      <para>Dans le cas ou vous disposez d'une adresse IP
dynamiquement assign&eacute;e et que vous utilisez une connection ppp pour
acc&egrave;der &agrave; l'internet, vous diposez probablement d'une boite aux
lettres chez votre fournisseur d'acc&egrave;s. Prenons comme exemple que le
domaine de votre fournisseur soit <filename>monISP.com</filename>, que
votre nom d'utilisateur soit <filename>monlogin</filename>, que votre nom
de machine soit <filename>bsd.perso</filename> et que votre
fournisseur vous aie indiqu&eacute; la machine
<filename>relai.monISP.com</filename> comme serveur relai de
messagerie &eacute;lectronique.</para>

      <para>Pour pouvoir recevoir votre courrier depuis votre boite &agrave;
lettres, vous devez installer un agent de rapatriement de
mail.<emphasis remap="bf">Fetchmail</emphasis> est un bon choix, car
il supporte la plupart des protocoles de messagerie. La plupart du
temps, votre fournisseur offre l'acc&egrave;s &agrave; travers le protocole POP3. Si
vous avez d&eacute;cid&eacute; d'utiliser la partie utilisateur de ppp, vous pouvez
automatiquement rapatrier votre courrier lorsque la connexion vers le
r&eacute;seau est &eacute;tablie en ajoutant la ligne suivante au fichier
<filename>/etc/ppp/ppp.linkup</filename>&nbsp;:</para>
<para><programlisting>
MYADDR:
!bg su monlogin -c fetchmail
</programlisting></para>
      
      <para>Ici nous assumons que vous disposez d'un compte nomm&eacute;
<filename>monlogin</filename> sur la machine
<filename>bsd.perso</filename>. Vous devez alors cr&eacute;er un fichier
<filename>.fetchmailrc</filename> dans votre r&eacute;pertoire principal
contenant&nbsp;:</para>
<para><programlisting>
poll monISP.com protocol pop3 fetchall pass monPasswd:
</programlisting></para>

	<para>Naturellement, ce fichier ne doit &ecirc;tre lisible que par
l'utilisateur <filename>monlogin</filename> car il contient le mot de
passe <filename>monPasswd</filename>.</para>

      <para>Pour permettre d'envoyer du courrier avec l'ent&ecirc;te
<emphasis remap="bf">from:</emphasis> correcte, vous devez configurer
sendmail pour utiliser l'adresse
<filename>monlogin@monISP.com</filename> plut&ocirc;t que
<filename>monlogin@bsd.perso</filename>. Vous devez aussi dire &agrave; votre
sendmail d'envoyer tout le courrier via le serveur
<filename>relai.monISP.com</filename>, permettant au courrier
d'&ecirc;tre envoy&eacute; plus rapidement.</para> 

<para>Le fichier de configuration <filename>.mc</filename> suivant doit convenir&nbsp;:</para>
<para><programlisting>
VERSIONID(`bsd.perso.mc version 1.0') 
OSTYPE(bsd4.4)dnl 
FEATURE(nouucp)dnl 
MAILER(local)dnl 
MAILER(smtp)dnl 
Cwlocalhost 
Cwbsd.perso 
MASQUERADE_AS(`monISP.com')dnl 
FEATURE(allmasquerade)dnl 
FEATURE(masquerade_envelope)dnl 
FEATURE(nocanonify)dnl 
FEATURE(nodns)dnl 
define(SMART_HOST, `relai.monISP.com') 
Dmbsd.perso 
define(`confDOMAIN_NAME',`bsd.perso')dnl 
define(`confDELIVERY_MODE',`deferred')dnl 
</programlisting></para>

      <para>Ref&eacute;rez-vous &agrave; la section pr&eacute;c&eacute;dente pour l'explication
d&eacute;taill&eacute;e de conversion du fichier <filename>.mc</filename>en fichier
<filename>sendmail.cf</filename>. N'oubliez pas non plus de red&eacute;marrer
sendmail apr&egrave;s avoir modifi&eacute; le fichier
<filename>/etc/sendmail.cf</filename></para>

    </sect1>

    <sect1>
      <title>Horreur&nbsp;!! J'ai perdu le mot de passe de root&nbsp;!! </title>
      
      <para>Ne paniquez pas! Red&eacute;marrez tout simplement le syst&egrave;me en
tapant -s au "prompt" Boot: pour passer en mode mono-utilisateur. A la
question sur le shell &agrave; utiliser, appuyez sur ENTREE. Vous obtiendrez
alors un prompt "#". Tapez la commande <filename>mount -u</filename>
pour remonter votre partition primaire en lecture/&eacute;criture et lancez
la commande <filename>mount -a</filename> pour remonter tous les
syst&egrave;mes de fichiers. Tapez <filename>passwd root</filename> pour
changer le mot de passe root puis tapez <filename>exit</filename> pour
continuer le processus de d&eacute;marrage du syst&egrave;me.</para>

    </sect1>

    <sect1>
      <title>Comment emp&egrave;cher le red&eacute;marrage du syst&egrave;me en appuyant sur les touches Control-Alt-Delete&nbsp;?</title>
      <para>Editez le fichier de configuration du clavier que vous
utilisez pour la console et remplacez le mot cl&eacute;
<filename>boot</filename> par <filename>nop</filename>. Le fichier de
configuration du clavier utilis&eacute; par d&eacute;faut est
<filename>/usr/share/syscons/keymaps/us.iso.kbd</filename>. Vous
pouvez changer la configuration en &eacute;ditant le fichier
<filename>/etc/rc.conf</filename>. Bien sur si vous utilisez une autre
configuration, il faut &eacute;diter le fichier de configuration la
d&eacute;crivant.</para>
    </sect1>

    <sect1>
      <title>Comment transformer les fichiers textes au format DOS en fichiers UNIX&nbsp;?</title>
      
      <para>Utilisez tout simplement la commande perl suivante&nbsp;:</para>

      <para><programlisting>
perl -i.bak -pe 's/\r\n/\n/g' fichier.dos ...
</programlisting></para>

      <para>fichier.dos &eacute;tant le fichier &agrave; modifier. Cette commande
remplace dans le fichier et sauvegarde  l'ancien sous le nom
<filename>fichier.dos.bak</filename>.</para>

    </sect1>

    <sect1>
      <title>Comment tuer un processus par son nom&nbsp;?</title>
      <para>Utilisez <ulink url="/cgi/cvsweb.cgi/man.cgi?killall">killall(1)</ulink></para>
    </sect1>
    
    <sect1>
      <title>Pourquoi la commande <filename>su</filename> me dit sans arr&ecirc;t que je ne suis pas dans les ACL de root&nbsp;?</title>
      
      <para>Cette erreur vient du syst&egrave;me d'authentification distribu&eacute;
Kerberos. Ceci n'est pas un probl&egrave;me tr&egrave;s grave. Un palliatif consiste
&agrave; utiliser l'option "-k" de su ou de d&eacute;sinstaller Kerberos comme
expliqu&eacute; &agrave; la section suivante.</para>
      
      </sect1>

    <sect1>
      <title>Comment d&eacute;sinstaller Kerberos&nbsp;?</title>
      <para>Pour d&eacute;sinstaller Kerberos de votre syst&egrave;me, vous devez
r&eacute;installer la distribution <filename>bin</filename> depuis votre
version de FreeBSD. Si vous disposez d'un CDROM, vous devez monter le
cd (la plupart du temps dans /cdrom) et lancer&nbsp;:</para>

<para><programlisting>
cd /cdrom/bin
./install.sh
</programlisting></para> 
      </sect1>
  <sect1>
     <title>Comment ajouter des pseudo-terminaux au syst&egrave;me&nbsp;?</title>

     <para>Si vous avez un grand nombre de telnet, ssh, X, or screen users, 
       vous risquez probablement de manquer de pseudo-terminaux. 
       Voici comment en ajouter plusieurs&nbsp;:</para>

     <orderedlist>
     <listitem><para>Cr&eacute;er et installer un nouveau noyau avec la ligne</para>

     <programlisting>
       pseudo-device pty 256
     </programlisting>

     <para>dans le fichier de configuration.</para></listitem>

     <listitem><para>Ex&eacute;cuter la commande&nbsp;:</para>

     <programlisting>
     # cd /dev
     # ./MAKEDEV pty{1,2,3,4,5,6,7}
     </programlisting>

     <para>pour cr&eacute;er 256 device nodes pour les nouveaux terminaux.</para></listitem>

     <listitem><para>Editer <filename>/etc/ttys</filename> et
       jouter une ligne pour chacun des 256 terminaux.
       Elles doivent correspondre &agrave; la forme des entr&eacute;es existantes.
       c'est &agrave; dire ressembler &agrave; :</para>

     <programlisting>
       ttyqc none network
     </programlisting>

    <para>L'ordre des lettres de d&eacute;signation est 
      <filename>tty[pqrsPQRS][0-9a-v]</filename>, 
      en utilisant une expression r&eacute;guli&egrave;re. </para></listitem> 

    <listitem><para>D&eacute;marrez le syst&egrave;me avec le nouveau noyau 
      et vous &ecirc;tes pr&ecirc;ts  &agrave; travailler.</para></listitem>
    </orderedlist>

     
  </sect1>

</chapter>

