<!--
	The FreeBSD Documentation Project
	The FreeBSD French Documentation Project
         
        $FreeBSD$
        Original revision: 1.33
--> 

<chapter id="preface">
    <beginpage>
    <title>Pr&eacute;face</title>

    <sect1>
      <title>Quel est le but de cette FAQ&nbsp;?</title>
      <para>Comme toutes les FAQ Usenet, ce document contient les
questions les plus fr&eacute;quemment pos&eacute;es &agrave; propos du syst&egrave;me
d'exploitation FreeBSD, ainsi que leurs r&eacute;ponses. Bien que
destin&eacute;es, &agrave; l'origine, &agrave; r&eacute;duire le trafic et &eacute;viter que 
les m&ecirc;mes questions soient pos&eacute;es encore et encore, les FAQ 
sont maintenant reconnues comme de pr&eacute;cieuses sources
d'information. </para>

      <para>Tous les efforts ont &eacute;t&eacute; apport&eacute;s pour rendre 
cette FAQ la plus compl&egrave;te possible. Si vous avez des commentaires 
la concernant ou
si vous voulez y contribuer, envoyez un e-mail au <ulink
url="mailto:freebsd-france@freebsd.francenet.fr">responsable de cette
FAQ</ulink>. 
</para>
    </sect1>

    <sect1>
       <title>FreeBSD c'est quoi&nbsp;?</title>

       <para>Pour r&eacute;sumer, FreeBSD 2.X est un syst&egrave;me d'exploitation
UN*X bas&eacute; sur la distribution 4.4BSD-lite de l'universit&eacute; de 
Berkeley pour des plate-formes i386. 
Il est aussi bas&eacute; indirectement sur le
portage de William Jolitz de la distribution Net/2 de l'universit&eacute; de
Berkeley, plus connu sous le nom de 386BSD, mais tr&egrave;s peu de code de
386BSD subsiste. Une description plus compl&egrave;te de ce qu'est
FreeBSD et &agrave; quoi il peut vous servir, peut &ecirc;tre trouv&eacute;e &agrave; <ulink
url="http://www.fr.freebsd.org">la page d'accueil de
FreeBSD</ulink>. </para>


      <para>FreeBSD est utilis&eacute; par des soci&eacute;t&eacute;s commerciales,
fournisseurs d'acc&egrave;s &agrave; l'Internet, chercheurs, professionnels de
l'informatique, &eacute;tudiants et particuliers &agrave; travers le monde entier
pour travailler, apprendre et se divertir. Reportez-vous &agrave; la  <ulink
url="http://www.fr.freebsd.org/gallery/gallery.html">galerie
FreeBSD</ulink> pour vous faire une id&eacute;e.</para>


      <para>Pour plus de d&eacute;tails et d'informations sur FreeBSD,
r&eacute;f&eacute;rez vous au <ulink
url="&url.handbook;index.html">manuel de FreeBSD</ulink></para>
  </sect1>
  <sect1> 
    <title>Quels sont les buts de FreeBSD&nbsp;?</title>
      <para>L'objectif du projet FreeBSD est de fournir un logiciel qui
        puisse &ecirc;tre utilis&eacute; &agrave; n'importe quelle fin et sans aucun restriction.
        Nombre d'entre nous sont impliqu&eacute;s de fa&ccedil;on significative dans le  
        code (et dans le projet) et ne refuseraient certainement pas une
        petite compensation financi&egrave;re de temps &agrave; autre, mais ce n'est 
        certainement pas dans nos intentions d'insister l&agrave; dessus. Nous 
        croyons que notre premi&egrave;re et principale &ldquo;mission&rdquo;
        est de fournir du code &agrave; tout le monde, pour n'importe quel projet,
        de fa&ccedil;on &agrave; ce que l'il soit utilis&eacute; le plus possible et avec
        le maximum d'avantages. C'est, nous le pensons, l'un des objectifs
        les plus fondamentaux du Logiciel Libre et l'un de ceux que nous
        soutenons avec enthousiasme.</para>
              
      <para>Le code de l'arborescence des sources, qui est r&eacute;gi par la
        Licence Publique GNU (&ldquo;GNU Public
        License&rdquo;&nbsp;-&nbsp;GPL) ou
        la Licence Publique GNU pour les Biblioth&egrave;ques (&ldquo;GNU Library
        Public License&rdquo;&nbsp;-&nbsp;GLPL) impose l&eacute;g&egrave;rement plus de
        contraintes, bien que plut&ocirc;t li&eacute;es &agrave; une disponibilit&eacute; plus grande
        qu'au contraire, comme c'est g&eacute;n&eacute;ralement le cas. En raison des
        complications suppl&eacute;mentaires qui peuvent r&eacute;sulter de l'utilisation 
        commerciale de logiciels GPL, nous essayons, cependant de remplacer
        ces derniers par des logiciels soumis &agrave; la licence BSD qui est plus
        souple, chaque fois que c'est possible.</para>
  </sect1>

     <sect1> 
       <title>Pourquoi le nom FreeBSD&nbsp;?</title>

      <para><itemizedlist>
	  <listitem>
	    <para>Il peut &ecirc;tre utilis&eacute; gratuitement, m&ecirc;me pour un usage commercial.</para>
	  </listitem>
	  <listitem><para>L'int&eacute;gralit&eacute; des sources est disponible 
gratuitement, et le moins de restrictions possible ont &eacute;t&eacute; plac&eacute;es sur 
son utilisation, sa distribution et son incorporation dans d'autres travaux
(&agrave; des fins commerciales ou non).</para>
	  </listitem>
	  <listitem><para>N'importe quelle personne qui a une nouvelle fonctionnalit&eacute; 
et/ou une correction de bogue peut soumettre une portion de 
code, qui pourra &ecirc;tre inclus dans l'arbre de 
d&eacute;veloppement (moyennant une ou deux conditions &eacute;videntes).</para>
	  </listitem>
	</itemizedlist>
	</para>
      <para> Pour ceux de nos lecteurs dont la langue maternelle n'est
pas l'anglais, il est important de rappeler que le mot "free"
est utilis&eacute; ici de deux mani&egrave;res, l'une signifiant "gratuitement" 
et l'autre "vous pouvez faire ce que vous voulez". 
Except&eacute; une ou deux choses que vous <emphasis>ne pouvez</emphasis>
pas faire avec le code FreeBSD, par exemple pr&eacute;tendre que vous l'avez 
d&eacute;velopp&eacute;, vous pouvez r&eacute;ellement faire ce que vous en voulez.  </para>
    </sect1>

    <sect1>
      <title>Quelle est la derni&egrave;re version de FreeBSD&nbsp;?</title>

<!-- 1.30 @@ -->
      <para>La <ulink url="ftp://ftp.freebsd.org/pub/FreeBSD/releases/i386/3.1-RELEASE"> version 3.1</ulink> est la derni&egrave;re version <emphasis remap="bf">stable</emphasis>&nbsp;; elle a &eacute;t&eacute; mise en circulation en f&eacute;vrier 1999.
C'est aussi la derni&egrave;re version <emphasis remap="bf">
RELEASE</emphasis>.
</para>
      <para>En quelques mots, la branche<emphasis
remap="bf">-stable</emphasis> est destin&eacute;e aux fournisseurs d'acc&egrave;s &agrave;
l'Internet et autres utilisateurs professionnels qui
recherchent un syst&egrave;me stable ainsi que des changements mineurs lors de la
mise &agrave; jour de leur syst&egrave;me en derni&egrave;re version. 

<!--
Actuellement ces deux
versions ne font qu'une, mais il ne devrait pas tarder avant que la branche  <emphasis remap="bf">-current</emphasis> soit suffisemment polie pour une distribution g&eacute;n&eacute;rale.  </para>

      <para>Cela ne veut pas dire que la version 3.0-STABLE n'est pas
utilisable en production, et beaucoup de personnes qui ont besoin de 
nouvelles fonctionnalit&eacute;s sp&eacute;cifiques &agrave; la version 3.0 (nouvelle version des compilateurs, code
r&eacute;seau plus optimis&eacute;, etc) ont d&eacute;cid&eacute; de tenter leur chance sans probl&egrave;mes. Nous ne voulons
tout simplement pas <quote>certifier</quote> la version 3.0 comme 
bonne pour le service avant qu'elle ne soit livr&eacute;e comme 3.1-RELEASE en f&eacute;vrier 1999.
-->
</para>
    </sect1>

    <sect1>
      <title>Qu'est-ce que FreeBSD-current&nbsp;?</title>
<!-- A RELIRE adresse relative/absolue a voir -->
      <para><ulink
url="http://www.freebsd-fr.org/handbook/current.html">FreeBSD-current</ulink>
est la version de d&eacute;veloppement du syst&egrave;me d'exploitation, qui
deviendra en temps utile la version 4.0-RELEASE. Comme telle, cette version ne peut
int&eacute;resser que les d&eacute;veloppeurs du noyau  ainsi que certains
passionn&eacute;s. Voyez <ulink
url="http://www.freebsd-fr.org/handbook/current.html"> la section
appropri&eacute;e</ulink> du <ulink
url="&url.handbook;index.html">manuel </ulink>
pour plus de d&eacute;tails sur l'utilisation de -current.</para>

      <para>Si vous n'&ecirc;tes pas familier avec ce syst&egrave;me d'exploitation,
ou que vous n'&ecirc;tes pas capable de diff&eacute;rencier un probl&egrave;me temporaire
d'un probl&egrave;me  critique, vous ne devez pas utiliser
FreeBSD-current. Cette branche &eacute;volue assez rapidement et peut ne pas
&ecirc;tre compil&eacute;e pendant un certain temps. 

<!--  -->
Les personnes utilisant
FreeBSD-current doivent &ecirc;tre capables d'analyser n'importe quel
probl&egrave;me et de ne rapporter que les erreurs utiles.

<!-- 
People that use FreeBSD-current are expected to be able to analyze any problems and only report them if they are deemed to be mistakes rather than ``glitches''.
Questions such as ``make world produces some error about groups'' on the
-current mailing list are sometimes treated with contempt.
-->

</para>

      <para>Assez souvent, une <ulink
url="http://www.fr.freebsd.org/releases/snapshots.html">version de
test</ulink> est cr&eacute;&eacute;e depuis la branche de d&eacute;veloppement  -current et
occasionnellement une distribution sur CDROM est disponible. Les buts
de chaque version de test sont les suivants:

<itemizedlist>
	  <listitem>
	    <para>Tester la derni&egrave;re version du programme d'installation.</para>
	  </listitem>
	  <listitem>
	    <para>Donner aux personnes voulant utiliser -current mais
n'ayant pas le temps ou la bande passante pour suivre jour apr&egrave;s jour
les &eacute;volutions du syst&egrave;me, une fa&ccedil;on simple de faire 
&eacute;voluer leur syst&egrave;me.</para>

	    </listitem>
	  <listitem>
	    <para>Garder un point de synchronisation pour les sources
du syst&egrave;me actuel, juste au cas ou nous casserions quelque chose
plus tard d'une fa&ccedil;on irr&eacute;cup&eacute;rable (Bien sur, CVS nous emp&ecirc;che
normalement d'en arriver l&agrave; :-).</para>

	  </listitem>
	  <listitem>
<para>V&eacute;rifier que toutes les nouvelles fonctionnalit&eacute;s n&eacute;cessitant
des tests ont le nombre maximum de testeurs potentiels.</para>
	    </listitem>
	</itemizedlist>

</para>
      <para>Aucune garantie ne peut &ecirc;tre donn&eacute;e sur le fait que les
versions de test puissent &ecirc;tre consid&eacute;r&eacute;es comme des versions "de
production". Pour des syst&egrave;mes en production, vous devez attendre la
version finale.</para>


      <para>Les versions de test sont directement t&eacute;l&eacute;chargeables
depuis <ulink url="ftp://current.freebsd.or/pub/FreeBSD"> ce
site</ulink> et sont g&eacute;n&eacute;r&eacute;es en moyenne une fois par jour pour les
branches 4.0-current et 3.0-stable.</para>

    </sect1>

    <sect1>
      <title>Quel est le concept de la branche FreeBSD-stable&nbsp;?</title>

<!-- A RELIRE adresse relative/absolue a voir -->
      <para>Revenons un peu en arri&egrave;re, lorsque la version 2.0.5 de
FreeBSD fut livr&eacute;e, nous avons d&eacute;cid&eacute; de scinder le d&eacute;veloppement en
deux branches. Une nomm&eacute;e <ulink
url="http://www.freebsd-fr.org/handbook/stable.html">-stable</ulink>,
o&ugrave; nous avons d&eacute;cid&eacute; de n'inclure que les correctifs test&eacute;s et
contenant quelques ajouts de fonctionnalit&eacute;s (pour les fournisseurs
d'acc&egrave;s ou les soci&eacute;t&eacute;s &agrave; vocation commerciale o&ugrave; les fonctionnalit&eacute;s
exp&eacute;rimentales sont plus qu'ind&eacute;sirables). L'autre nomm&eacute;e
<ulink
url="http://www.freebsd-fr.org/handbook/current.html">-current</ulink>
qui nous emm&egrave;nera jusqu'&agrave; la version 4.0-RELEASE (et audel&agrave;) depuis la livraison 2.0. Un dessin
ASCII qui vous montre &agrave; quoi ressemble l'arbre de d&eacute;veloppement&nbsp;:
</para>

      <figure>
	<title>L'arbre de d&eacute;veloppement</title>
	<programlisting>
                   2.0 
                    | 
                    | 
                    |  [2.1-stable] 
*Nouvelle BRANCHE*   2.0.5 -> 2.1 -> 2.1.5 -> 2.1.6 -> 2.1.7.1 [fin de la branche 2.1-stable] 
                    |                                 (Mars 1997) 
                    | 
                    | 
                    |  [2.2-stable] 
*Nouvelle BRANCHE*   2.2.1 -> 2.2.2-RELEASE -> 2.2.5 -> 2.2.6 -> 2.2.7 -> 2.2.8 [fin]
                    |(Mars 1997)   (Octobre 97) (Avril 98)  (Juillet 98)  (D&eacute;cembre 1998)
                    | 
                    | 
                 3.0-SNAPs  (Debut 1er trimestre 1997) 
                    | 
                    | 
                 3.0.0-RELEASE (Octobre 1998) 
                    |
                    |  [3.0-stable]
*Nouvelle BRANCHE*   3.1  (Feb 1999) -> ... future 3.x releases ...
                    |
                    |
                   \|/
                    +
            [4.0-current continues]
</programlisting>
      </figure>

      <para> La branche -current progresse lentement vers la version 4.0 et au-del&agrave;,  
la branche 2.2-stable &eacute;tant termin&eacute;e avec la version 2.2.8.
La branche 3.0-stable l'a maintenant remplac&eacute;e, la prochaine version arrivant avec la 3.1 au d&eacute;but 1999 .
La version 4.0-current est maintenant la "branche
courante" avec les premi&egrave;res versions 4.0 apparaissant au premier trimestre 2000.</para>


    </sect1>

<!-- suppression de la section "Pourquoi la branche 2.1-stable se finit-elle par la version 2.1.7.1 ?" -->

     <sect1>
       <title>Quand sont livr&eacute;es les versions de FreeBSD&nbsp;?</title>

      <para>Les nouvelles versions de FreeBSD sont livr&eacute;es quand
l'&eacute;quipe principale de FreeBSD d&eacute;cide qu'il y a suffisamment de
nouveaut&eacute;s et/ou de correctifs pour justifier d'une version, et
lorsqu'ils sont satisfaits des modifications apport&eacute;es et qu'elles ne
compromettent pas la stabilit&eacute; de la version. Beaucoup d'utilisateurs
pensent que cela fait partie des meilleures choses de FreeBSD, m&ecirc;me si
cela peut &ecirc;tre un peu frustrant d'attendre que les derniers ajouts
soient disponibles.</para>


      <para> Les versions sont livr&eacute;es &agrave; peu pr&egrave;s tous les 4 mois en moyenne.</para>

      <para> Pour les personnes qui ont besoin (ou veulent) d'un peu
plus de risques, il y a les versions SNAP qui sont livr&eacute;es un peu plus
souvent (&agrave; peu pr&egrave;s tous les mois). </para>

    </sect1>

    <sect1>
      <title>Sur quelles plate-formes, autre que les PC, est disponible FreeBSD&nbsp;?</title>

      <para>Actuellement FreeBSD 3.x tourne sur une plate-forme <ulink
url="../alpha/alpha.html">DEC Alpha </ulink> aussi bien que sur les architecture x86. Un int&eacute;r&ecirc;t a &eacute;t&eacute; exprim&eacute; pour un portage sur <ulink
url="http://www.freebsd.org/~jseger/freebsd-sparc/">UltraSPARC</ulink>
mais les d&eacute;tails de ce projet ne sont pas encore clairs.</para>

      <para>Si vous disposez d'une autre architecture, nous vous
conseillons d'aller voir aux URLs suivantes:
<itemizedlist>
	  <listitem>
	    <para><ulink
url="http://www.netbsd.org">NetBSD</ulink></para>
	  </listitem>
	  <listitem>
	    <para><ulink
url="http://www.openbsd.org">OpenBSD</ulink></para>
	  </listitem>

	</itemizedlist>
</para>
    </sect1>

     <sect1> 
      <title>Qui sont les responsables de FreeBSD&nbsp;?</title>

      <para>Les d&eacute;cisions concernant le projet FreeBSD, comme les
directions que vont prendre le projet ainsi que les personnes
autoris&eacute;es &agrave; ajouter du code dans le noyau, sont fix&eacute;es par <ulink
url="&url.handbook;staff.html#STAFF-CORE">l'&eacute;quipe principale </ulink>,
compos&eacute;e d'environ 15 personnes. Il y a une &eacute;quipe un peu plus large
d'environ <ulink url="&url.handbook;staff-committers.html"> 150
personnes</ulink> qui ont le droit d'effectuer des changements dans le
code.</para>

      <para>Bien s&ucirc;r, la plupart des changements sont discut&eacute;s au
pr&eacute;alable dans les listes de messagerie, et il n'y a aucune restriction
sur qui peut prendre part &agrave; la discussion.</para> 


    </sect1>

    <sect1>
      <title>O&ugrave; peut-on trouver FreeBSD&nbsp;?</title>

      <para>Toutes les versions sont disponibles via un ftp anonyme
sur le <ulink url="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/">site ftp de
FreeBSD</ulink>

<itemizedlist>
	  <listitem>
	    <para>Pour la version 2.2-stable, 2.2.8R,  voir le r&eacute;pertoire
<ulink url="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/release/2.2.8-RELEASE/">
2.2.8-RELEASE</ulink>.</para>
	  </listitem>
	  <listitem>
	    <para>Pour la version 3.0-stable, 3.0-RELEASE, voir le
r&eacute;pertoire <ulink
url="ftp://current.freebsd.org/pub/FreeBSD/release/3.0-RELEASE">3.0-RELEASE</ulink>.</para>
	  </listitem>
	  <listitem>

	    <para>Les versions <ulink
url="ftp://releng22.freebsd.org/pub/FreeBSD/">de tests 2.2 </ulink>
sont compil&eacute;es une fois par jour tout au long de la vie de la branche
RELENG_2_2 (post 2.2.8). Sauf gros incident, la branche RELENG_2_2
est maintenue avec extr&ecirc;mement d'attention (pas de changements
exp&eacute;rimentaux, correctifs ajout&eacute;s apr&egrave;s test dans la branche -current
uniquement).</para>

	  </listitem>
	  <listitem><para>Les versions <ulink
url="ftp://releng30.freebsd.org/pub/FreeBSD/"> de test 3.0</ulink> sont
compil&eacute;es une fois par jour depuis la branche RELENG_3 (post 3.0-release)jusqu'&agrave; la 3.1-RELEASE.</para>

	  </listitem>
	  <listitem><para>Les versions <ulink
url="ftp://current.freebsd.org/pub/FreeBSD/"> de test 4.0</ulink> sont
compil&eacute;es une fois par jour depuis la branche -current,  ce service
&eacute;tant juste l&agrave; pour les personnes voulant la tester, ou les
d&eacute;veloppeurs.</para>

	  </listitem>
	</itemizedlist>
</para>
      <para> FreeBSD est aussi disponible par CDROM chez&nbsp;:</para>
<para>En France
<programlisting>
Le Monde en Tique
6 rue du Ma&icirc;tre Albert
75005 PARIS
FRANCE 
T&eacute;l&eacute;phone :01 55 42 73 73 
T&eacute;l&eacute;copie :01 55 42 73 74 
WWW:<ulink url="http://www.lmet.fr">Serveur WWW du Monde en Tique</ulink>
Ouverture : Du lundi au samedi, de 9h30 &agrave; 19h30 sans interruption 
M&eacute;tro : Ligne 10 : Station Maubert - Mutualit&eacute;
Rer B : Cluny - La Sorbonne, Sortie : Boulevard Saint-Michel - Boulevard Saint-Germain
Rer C : Saint Michel - Notre Dame, Sortie : Notre-Dame
</programlisting>
<programlisting>
Infoth&egrave;que
32, rue de Moscou
75008 Paris
T&eacute;l&eacute;phone:01 45 22 67 01
T&eacute;l&eacute;copie:01 42 93 73 83
WWW: <ulink url="http://www.infotheque.com">Serveur WWW de infotheque</ulink>
</programlisting>

</para>

      <para>Aux USA
<programlisting>
Walnut Creek CDROM
4041 Pike Lane, Suite F
Concord, CA  94520  USA
Commandes:     +1 800 786-9907
Questions:  +1 925 674-0783
FAX:        +1 925 674-0821
email:      <ulink url="mailto:orders@cdrom.com">Commandes Walnut Creek</ulink>
WWW:        <ulink url="http://www.cdrom.com/">Serveur WWW de Walnut Creek</ulink>
</programlisting> 
</para>

      <para> En Australie chez : 
<programlisting>
Advanced Multimedia Distributors
Factory 1/1 Ovata Drive
Tullamarine, Melbourne
Victoria
Australia
Tel: +61 3 9338 6777

CDROM Support BBS
17 Irvine St
Peppermint Grove  WA 6011
Tel: +61 9 385-3793
Fax:   +61 9 385-2360
</programlisting>
</para>
      <para> En Angleterre :
<programlisting>
The Public Domain &amp; Shareware Library
Winscombe House, Beacon Rd
Crowborough
Sussex. TN6 1UL
Tel: +44 1892 663-298
Fax:   +44 1892 667-473
</programlisting>
</para>
    </sect1>

    <sect1>
      <title>O&ugrave; trouver de l'information sur les listes de messagerie&nbsp;?</title>

      <para>Vous trouverez ces informations dans <ulink
url="&url.handbook;eresources.html#ERESOURCES-MAIL">la section sur les listes de diffusion du manuel</ulink>
</para>
    </sect1>

    <sect1>
      <title>Quels sont les forums de discussion disponibles sur FreeBSD&nbsp;?</title>

      <para> Tous les forums sont list&eacute;s dans la section sur <ulink
url="&url.handbook;eresources.html">les forums de
discussion</ulink> du manuel</para>
    </sect1>

    <sect1>
<!-- A RELIRE -->
      <title>Existe-t-il des canaux IRC(Internet Relay Chat) sur FreeBSD&nbsp;?</title>

      <para>Oui, la plupart des r&eacute;seaux IRC comportent un canal FreeBSD.
<itemizedlist>
	  <listitem>
	    <para>Le canal <emphasis remap="tt">#FreeBSD</emphasis> sur EFNET est s&ucirc;rement le plus populaire et est disponible sur <emphasis remap="tt">irc.chat.org</emphasis>.</para>
	  </listitem>
	  <listitem>
	    <para>Le canal  <emphasis remap="tt">#FreeBSD</emphasis> sur DALNET est disponible sur <emphasis remap="tt">irc.dal.net </emphasis> pour les US et sur <emphasis remap="tt">irc.eu.dal.net</emphasis> pour l'Europe.</para>
	  </listitem>
	  <listitem>
	    <para>Le canal  <emphasis remap="tt">#FreeBSD</emphasis> sur UNDERNET est disponible sur <emphasis remap="tt">us.undernet.org</emphasis> pour les US et sur <emphasis remap="tt">eu.undernet.org</emphasis> pour l'Europe.</para>
	    </listitem>
	  <listitem>
	    <para>Enfin vous pouvez rejoindre <emphasis remap="tt">#FreeBSD</emphasis> sur BSDNET, un petit serveur de chat BSD sur <emphasis remap="tt">irc.FreeBSD.org</emphasis></para>
	    </listitem>
	</itemizedlist>
</para>

      <para>Tous ces canaux sont distincts et ne sont pas
interconnect&eacute;s entre eux. Les discussions sur chaque canal diff&egrave;rent,
donc essayez-les tous avant de trouver celui qui vous convient.</para>
    </sect1>

    <sect1>
<!-- A RELIRE -->
      <title>Quels sont les livres parlant de FreeBSD ?</title>

      <para>Le livre de Greg Lehey's <quote>stalling and Running
FreeBSD</quote> est disponible chez Walnut Creek CDROM et comprend le CDROM
de la version 2.2.8. Il y a aussi un livre plus important nomm&eacute; <quote>The
Complete FreeBSD</quote> qui est lui livr&eacute; avec certaines pages de manuel et
qui inclut aussi les CDROMs de la version 2.2.8. Ils devraient aussi
etre disponibles dans toutes les bonnes librairies.</para>

      <para>Il existe aussi un projet se nommant "FreeBSD
Documentation Project", que vous pouvez contacter (ou mieux, joindre)
sur la <quote>liste de diffusion doc</quote> <ulink
url="mailto:freebsd-doc@FreeBSD.ORG">&lt;freebsd-doc@FreeBSD.ORG&gt;</ulink>.
Cette liste a pour but de discuter sur la documentation de FreeBSD.
Les questions plus g&eacute;n&eacute;rales sur FreeBSD sont &agrave; poser dans la "mailing
list" <ulink
url="mailto:freebsd-questions@FreeBSD.ORG">&lt;freebsd-questions@FreeBSD.ORG&gt;</ulink>.</para>

      <para>Un <ulink
url="&url.handbook;index.html">``manuel''</ulink> sur FreeBSD est
disponible. Sachez, pour information, que ce manuel est en perp&eacute;tuelle
&eacute;volution, et que certaines parties peuvent &ecirc;tre incompl&egrave;tes.</para>

      <para>Comme FreeBSD 2.2.X est bas&eacute; sur la version 4.4.BSD-lite2,
la plupart des manuels relatifs &agrave; 4.4BSD peuvent s'appliquer &agrave;
FreeBSD. Des versions imprim&eacute;es sont disponibles chez O'Reilly:

<itemizedlist>
	  <listitem>
<programlisting>
4.4BSD System Manager's Manual By Computer Systems Research Group, UC
Berkeley 1st Edition June 1994, 804 pages <ulink
url="&isbn.amazon/1-56592-080-5">ISBN 1-56592-080-5</ulink>
</programlisting>
	    </listitem>
	  <listitem>
<programlisting>
4.4BSD User's Reference Manual By Computer Systems Research Group, UC
Berkeley 1st Edition June 1994, 905 pages <ulink
url="&isbn.amazon/1-56592-075-9">ISBN 1-56592-075-9 </ulink>
</programlisting>
	  </listitem>
	  <listitem>
	    <programlisting>
4.4BSD User's Supplementary Documents By Computer Systems Research
Group, UC Berkeley 1st Edition July 1994, 712 pages  <ulink
url="&isbn.amazon/1-56592-076-7">ISBN 1-56592-076-7</ulink>
</programlisting>
	  </listitem>
	  <listitem>
	    <programlisting>
4.4BSD Programmer's Reference Manual By Computer Systems Research
Group, UC Berkeley 1st Edition June 1994, 886 pages <ulink
url="&isbn.amazon/1-56592-078-3">ISBN 1-56592-078-3</ulink>


</programlisting>
</listitem>

	  <listitem>
	    <programlisting>
4.4BSD Programmer's Supplementary Documents By Computer Systems
Research Group, UC Berkeley 1st Edition July 1994, 596 pages <ulink
url="&isbn.amazon/1-56592-079-1">ISBN 1-56592-079-1</ulink>

</programlisting>
</listitem>
	</itemizedlist>
</para>
      <para>Une courte description de ces livres est disponible via
WWW &agrave; l'adresse suivante : <ulink
url="http://gnn.com/gnn/bus/ora/category/bsd.html">http://gnn.com/gnn/bus/ora/category/bsd.html</ulink>.
Vu le peu de ventes, ces livres sont relativement difficiles a trouver.</para>

      <para>Pour plus d'informations sur le noyau 4.4BSD vous pouvez vous 
reporter au livre suivant :

<programlisting>
McKusick, Marshall Kirk, Keith Bostic, Michael J Karels, and John Quarterman.

<emphasis>The Design and Implementation of the 4.4BSD Operating System</emphasis>.
 Reading, Mass. : Addison-Wesley, 1996.
<ulink url="&isbn.amazon/0-201-54979-4">ISBN 0-201-54979-4</ulink>
</programlisting>
</para>


      <para>Un bon livre sur l'administration syst&egrave;me:
<programlisting>
Evi Nemeth, Garth Snyder, Scott Seebass &amp; Trent R. Hein,
``Unix System Administration Handbook'', Prentice-Hall, 1995
<ulink url="&isbn.amazon/0-13-151051-7">ISBN 0-13-151051-7</ulink>
</programlisting>

<emphasis remap="bf">Attention &agrave; bien acheter la deuxi&egrave;me &eacute;dition,
version avec la couverture rouge, et non pas la premi&egrave;re.</emphasis>
</para>

      <para>Ce livre couvre les bases de l'administration syst&egrave;me
aussi bien que TCP/IP, le DNS, NFS, SLIP/PPP, sendmail, INN/NNTP,
l'impression, etc... Il est assez on&eacute;reux (environ 300-350 FF) mais
est indispensable. Il comprend en plus un CDROM contenant &eacute;norm&eacute;ment
d'outils, dont la plupart sont inclus sur les CDROM de FreeBSD.</para>
    </sect1>

    <sect1>
<!-- A RELIRE voir : send-pr(1)-->
      <title>Comment acc&egrave;der &agrave; la base de donn&eacute;es des probl&egrave;mes&nbsp;?</title>

      <para>La base de donn&eacute;es des probl&egrave;mes est accessible (pour
soumission ou interrogation) en utilisant votre navigateur WWW <ulink
url="http://www.freebsd.org/send-pr.html"> pour la soumission</ulink>
ou <ulink url="http://www.freebsd.org/cgi/query-pr-summary.cgi"> pour
l'interrogation </ulink>. La commande <emphasis>send-pr(1)</emphasis>
peut aussi &ecirc;tre utilis&eacute;e pour soumettre des probl&egrave;mes et des
modifications par courrier &eacute;lectronique.</para>


    </sect1>

    <sect1>
<!-- A RELIRE voir les tailles des fichiers -->
      <title>O&ugrave; peut-on trouver des versions ASCII/PostScript de cette FAQ&nbsp;?</title>

      <para> La derni&egrave;re version de cette FAQ est disponible sur le serveur
WWW de FreeBSD ou sur tout serveur miroir en PostScript ou texte (ASCII 7 bits et Latin1 8 bits).</para>
<!-- A RELIRE adresse relative/absolue a voir -->
      <para>Le PostScript (environ 370Ko) :<ulink
url="http://www.freebsd-fr.org/FAQ/FAQ.ps">http://www.freebsd-fr.org/FAQ/FAQ.ps</ulink></para>
<!--
        La version ASCII n'est plus disponible
      <para>En ASCII (environ 220KB):<ulink
url="http://www.freebsd-fr.org/FAQ/FAQ.ascii">http://www.freebsd-fr.org/FAQ/FAQ.ascii</ulink></para>
-->

<!-- A RELIRE adresse relative/absolue a voir -->
      <para>En format texte ISO 8859-1 (environ 220Ko): <ulink
url="http://www.freebsd-fr.org/FAQ/FAQ.txt">http://www.freebsd-fr.org/FAQ/FAQ.txt</ulink></para>

    </sect1>

    <sect1>
<!-- A RELIRE voir les tailles des fichiers -->

      <title>O&ugrave; peut-on trouver des versions ASCII/PostScript du manuel&nbsp;?</title>

      <para> La derni&egrave;re version du manuel est disponible sur le serveur
WWW de FreeBSD ou sur tout serveur miroir en PostScript ou texte (ASCII 7 bits et Latin1 8 bits).</para>
<!-- A RELIRE adresse relative/absolue a voir -->
      <para>Le PostScript (environ 1.7Mo) :<ulink
url="http://www.freebsd-fr.org/handbook/handbook.ps">http://www.freebsd-fr.org/handbook/handbook.ps</ulink></para>
<!--
        La version ASCII n'est plus disponible
      <para>En ASCII (environ 220KB):<ulink
url="http://www.freebsd-fr.org/handbook/handbook.ascii">http://www.freebsd-fr.org/handbook/handbook.ascii</ulink></para>
-->

<!-- A RELIRE adresse relative/absolue a voir -->
      <para>En format texte ISO 8859-1 (environ : 1.1Mo) :<ulink
url="http://www.freebsd-fr.org/handbook/handbook.txt">http://www.freebsd-fr.org/handbook/handbook.txt</ulink></para>

    </sect1>
    <sect1>
<!-- A RELIRE voir la commande col -->

      <title>La version ASCII du manuel ne contient pas que du texte !</title>

      <para>C'est vrai. Les versions ASCII et Latin1 de la FAQ et du
manuel ne contiennent pas que du texte. Elles
contiennent des soulign&eacute;s et d'autres codes qui supposent que
l'impression sera faite sur une imprimante matricielle. Si vous avez
besoin de reformater ces fichiers sous une forme plus lisible, lancez
la commande col sur le fichier&nbsp;:

<programlisting>
$ col -b < fichierOrigine > fichierSortie
</programlisting>
</para>
    </sect1>

    <sect1>
<!-- A RELIRE voir la commande rsync -->

       <title>Je voudrais devenir un miroir WWW de FreeBSD&nbsp;!</title>

      <para>Bien s&ucirc;r&nbsp;! Diff&eacute;rents moyens permettent de synchroniser les pages WWW.

<itemizedlist>
	  <listitem>

	    <para>En utilisant CVSUP: vous pouvez retrouver les pages
format&eacute;es en HTML en utilisant CVSUP depuis cvsup.freebsd.org. Ajoutez
simplement cette ligne &agrave; votre fichier cvsup:

<programlisting>
www release=current hostname=/home base=/usr/local/etc/cvsup
prefix=/usr/local/www/data/www.freebsd.org delete old use-rel-suffix
</programlisting>
</para>
	    </listitem>
	  <listitem>
	    <para>En utilisant rsync: voir la <ulink
url="http://www.freebsd.org/internal/mirror.html"> page sur les
miroirs</ulink> pour les informations.</para>

	    </listitem>
	  <listitem>
	    <para>En utilisant un miroir ftp: vous pouvez t&eacute;l&eacute;charger
la copie sur serveur WWW se trouvant sur le serveur ftp. Les fichiers
se trouvent &agrave; ftp://ftp.freebsd.org/pub/FreeBSD/FreeBSD-current/www
.</para>

	    </listitem>
	</itemizedlist>
</para>
    </sect1>

    <sect1>
      <title>Je veux traduire la documentation en Javanais</title>

      <para> On ne peut pas vous payer, mais on peut s'arranger pour
vous envoyer un CDROM gratuit ou un T-shirt et une entr&eacute;e dans la
liste des contributeurs du Handbook si vous nous soumettez une
traduction de la documentation.</para>
    </sect1>

   <sect1>
      <title>Autres sources d'informations.</title>

      <para>Les forums de discussion suivants se rapportent &agrave; FreeBSD 

<itemizedlist>
	  <listitem>
	    <para><ulink
url="news:fr.comp.os.bsd">fr.comp.os.bsd</ulink> (en francais)</para>
	  </listitem>
	  <listitem>
	    <para><ulink url="news:comp.unix.bsd.freebsd.announce">
comp.unix.bsd.freebsd.announce</ulink> (en anglais - mod&eacute;r&eacute;) </para>
	  </listitem>
	  <listitem>
	    <para><ulink
url="news:comp.unix.bsd.freebsd.misc">comp.unix.bsd.freebsd.misc</ulink> (en anglais)</para>
	    </listitem>
	  <listitem>
	    <para><ulink
url="news:comp.unix.bsd.misc">comp.unix.bsd.misc</ulink> (en anglais)</para>
	    </listitem>
	</itemizedlist>
</para>

      <para>Ressources WWW:
<itemizedlist>
	  <listitem>
	    <para>La <ulink url="http://www.freebsd.org/">page
principale de FreeBSD</ulink></para>
	  </listitem>
	  <listitem>
	    <para>La <ulink url="http://www.freebsd-fr.org/">page
principale de fr.FreeBSD</ulink></para>
	  </listitem>
	  <listitem>
	    <para><anchor id="pao">Si vous poss&eacute;dez un portable, vous devez visiter la
page de <ulink url="http://www.jp.FreeBSD.org/PAO/">Tatsumi Hosokawa's
Mobile Computing</ulink> au Japon</para>
	    </listitem>
	  <listitem>
	    <para>Pour plus d'informations sur SMP (Symmetric
MultiProcessing) voyez la <ulink
url="http://www.freebsd.org/~fsmp/SMP/SMP.html">page du support
SMP</ulink></para>
	    </listitem>
	  <listitem>
	    <para>Pour plus d'informations sur les applications multimedia FreeBSD
, voyez la page <ulink
url="http://www.freebsd.org/~faulkner/multimedia/mm.html">
multim&eacute;dia</ulink>. Si vous vous int&eacute;ressez plus sp&eacute;cialement &agrave; la capture vid&eacute;o Bt848
suivez ce <ulink url="http://www.freebsd.org/~ahasty/Bt848.html">
lien</ulink>.</para>
	  </listitem>
	</itemizedlist>
</para>
      <para>Le manuel de FreeBSD contient une section <ulink
url="&url.handbook;bibliography.html"> bibliographie</ulink> plus
importante, si vous recherchez d'autres livres ou informations.</para>
    </sect1>
    
</chapter>
