Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: The output is split into two sections. The header (the first five or six lines) shows the PID of the last process to run, the system load averages (which are a measure of how busy the system is), the system uptime (time since the last reboot) and the current time. The other figures in the header relate to how many processes are running, how much memory and swap space has been used, and how much time the system is spending in different CPU states. If the ZFS file system module has been loaded, an `ARC` line indicates how much data was read from the memory cache instead of from disk.
ko: 출력은 두 섹션으로 나뉩니다. 헤더(첫 5~6줄)에는 마지막으로 실행한 프로세스의 PID, 시스템 로드 평균(시스템 사용량 측정), 시스템 가동 시간(마지막 재부팅 이후 시간) 및 현재 시간이 표시됩니다. 헤더의 다른 수치는 실행 중인 프로세스 수, 사용된 메모리 및 스왑 공간의 양, 시스템이 다양한 CPU 상태에 따라 소모하는 시간등이 표시됩니다. ZFS 파일 시스템 모듈이 로드된 경우 `ARC` 줄은 디스크가 아닌 메모리 캐시에서 읽은 데이터의 양을 나타냅니다.
ru: Вывод разделён на две части. Заголовок (первые пять или шесть строк) показывает PID последнего запущенного процесса, среднюю загрузку системы (которая отражает, насколько система занята), время работы системы (время с последней перезагрузки) и текущее время. Остальные данные в заголовке относятся к количеству запущенных процессов, объёму используемой оперативной памяти и файла подкачки (свопа), а также времени, которое система проводит в различных состояниях процессора. Если загружен модуль файловой системы ZFS, строка `ARC` указывает, сколько данных было прочитано из кэша памяти, а не с диска.

source: Below the header is a series of columns containing similar information to the output from man:ps[1], such as the PID, username, amount of CPU time, and the command that started the process. By default, man:top[1] also displays the amount of memory space taken by the process. This is split into two columns: one for total size and one for resident size. Total size is how much memory the application has needed and the resident size is how much it is actually using now.
ko: 헤더 아래에는 man:ps[1]의 출력과 유사한 정보(예: PID, 사용자 이름, CPU 시간, 프로세스를 시작한 명령)가 포함된 일련의 열이 있습니다. 기본적으로 man:top[1]은 프로세스가 사용하고 있는 총 메모리 양도 표시합니다. 이는 총 크기와 상주 크기의 두 열로 나뉩니다. 총 크기는 애플리케이션이 요구한 메모리 양이며, 상주 크기는 애플리케이션이 현재 실제로 사용하고 있는 메모리 양입니다.
ru: Ниже заголовка расположен ряд столбцов с информацией, аналогичной выводу команды man:ps[1], такой как PID, имя пользователя, объем CPU времени и команда, запустившая процесс. По умолчанию man:top[1] также отображает объем памяти, занимаемый процессом. Эта информация разделена на два столбца: один для общего размера и один для резидентного размера. Общий размер — это объем памяти, который потребовался приложению, а резидентный размер — это объем, который оно фактически использует в данный момент.

source: man:top[1] automatically updates the display every two seconds. A different interval can be specified with `-s`.
ko: man:top[1]은 2초마다 화면을 자동으로 업데이트합니다. `-s` 옵션으로 업데이트 간격을 지정할 수 있습니다.
ru: man:top[1] автоматически обновляет отображение каждые две секунды. Другой интервал можно указать с помощью `-s`.

source: Killing Processes
ko: 프로세스 종료하기(죽이기)
ru: Прекращение процессов

source: One way to communicate with any running process or daemon is to send a _signal_ using man:kill[1]. There are a number of different signals; some have a specific meaning while others are described in the application's documentation. A user can only send a signal to a process they own and sending a signal to someone else's process will result in a permission denied error. The exception is the `root` user, who can send signals to anyone's processes.
ko: 실행 중인 프로세스나 데몬과 통신하는 한 가지 방법은 man:kill[1] _시그널_을 보내는 것입니다. 실제로는 여러 가지 시그널이 있으며 일부는 특별한 의미가 있는 반면, 그 외의 것들은 해당 애플리케이션 문서에 설명되어 있습니다. 사용자는 자신이 소유한 프로세스에만 시그널을 보낼 수 있으며 다른 사람의 프로세스에 시그널을 보내면 권한 거부 오류가 발생합니다. 모든 프로세스에 신호를 보낼 수 있는 `root` 사용자는 예외입니다.
ru: Один из способов взаимодействия с любым запущенным процессом или демоном — отправить _сигнал_ с помощью man:kill[1]. Существует множество различных сигналов; некоторые имеют определённое значение, в то время как другие описаны в документации приложения. Пользователь может отправлять сигналы только своим процессам, и попытка отправить сигнал чужому процессу приведёт к ошибке отказа в доступе. Исключением является пользователь `root`, который может отправлять сигналы любым процессам.

source: The operating system can also send a signal to a process. If an application is badly written and tries to access memory that it is not supposed to, FreeBSD will send the process the "Segmentation Violation" signal (`SIGSEGV`). If an application has been written to use the man:alarm[3] system call to be alerted after a period of time has elapsed, it will be sent the "Alarm" signal (`SIGALRM`).
ko: 운영체제 역시 프로세스에 시그널을 보낼 수도 있습니다. 응용 프로그램이 메모리를 잘못 사용하거나 지원되지 않는 메모리 영역에 접근하려고 하면, FreeBSD는 프로세스에 "세그먼트 위반" 신호(`SIGSEGV`)를 보냅니다. 응용 프로그램이 일정 시간이 경과한 후 경고를 받게 man:alarm[3] 시스템 호출을 사용하도록 작성된 경우, "알람" 시그널(`SIGALRM`)이 전송됩니다.
ru: Операционная система также может отправлять сигналы процессу. Если приложение написано с ошибками и пытается получить доступ к памяти, к которой оно не должно обращаться, FreeBSD отправит процессу сигнал "Нарушение сегментации" (`SIGSEGV`). Если приложение было написано с использованием системного вызова man:alarm[3] для оповещения по истечении определенного времени, ему будет отправлен сигнал "Будильник" (`SIGALRM`).

source: Two signals can be used to stop a process: `SIGTERM` and `SIGKILL`. `SIGTERM` is the polite way to kill a process as the process can read the signal, close any log files it may have open, and attempt to finish what it is doing before shutting down. In some cases, a process may ignore `SIGTERM` if it is in the middle of some task that cannot be interrupted.
ko: 프로세스를 중지하는 데 두 가지 시그널을 사용할 수 있는데 `SIGTERM`과 `SIGKILL`이 그것입니다. `SIGTERM`은 프로세스가 시그널을 읽고 열려 있는 모든 로그 파일을 닫은 후 종료하기 전에 수행 중인 작업을 완료하려고 시도할 수 있으므로 프로세스를 종료하는 정중한 방법입니다. 경우에 따라 프로세스가 중단할 수 없는 작업의 중간에 있는 경우, 프로세스는 `SIGTERM`을 무시할 수 있습니다.
ru: Для остановки процесса могут использоваться два сигнала: `SIGTERM` и `SIGKILL`. `SIGTERM` — это вежливый способ завершить процесс, так как процесс может прочитать сигнал, закрыть все открытые файлы журналов и попытаться завершить текущие операции перед остановкой. В некоторых случаях процесс может игнорировать `SIGTERM`, если он находится в середине задачи, которую нельзя прервать.

source: `SIGKILL` cannot be ignored by a process. Sending a `SIGKILL` to a process will usually stop that process there and then. footnote:[There are a few tasks that cannot be interrupted. For example, if the process is trying to read from a file that is on another computer on the network, and the other computer is unavailable, the process is said to be uninterruptible. Eventually the process will time out, typically after two minutes. As soon as this time out occurs the process will be killed.].
ko: `SIGKILL`은 프로세스에 의해 무시될 수 없습니다. 프로세스에 `SIGKILL`을 보내면 일반적으로 해당 프로세스가 바로 중지됩니다. footnote:[중단할 수 없는 몇 가지 작업이 있습니다. 예를 들어, 프로세스가 네트워크의 다른 컴퓨터에 있는 파일에서 읽으려고 하는데 다른 컴퓨터를 사용할 수 없는 경우 프로세스는 중단할 수 없다고 알립니다. 하지만 결과적으로 프로세스는 2분 후에 시간 초과가 발생하고, 이 시간 초과가 발생하면 프로세스가 종료됩니다].
ru: `SIGKILL` не может быть проигнорирован процессом. Отправка `SIGKILL` процессу обычно немедленно останавливает этот процесс. footnote:[Существует несколько задач, которые не могут быть прерваны. Например, если процесс пытается прочитать файл, находящийся на другом компьютере в сети, и этот компьютер недоступен, процесс считается непрерываемым. В конечном итоге процесс завершится по таймауту, обычно через две минуты. Как только это произойдет, процесс будет убит.].

source: Other commonly used signals are `SIGHUP`, `SIGUSR1`, and `SIGUSR2`. Since these are general purpose signals, different applications will respond differently.
ko: 일반적으로 사용되는 다른 시그널로는 `SIGHUP`, `SIGUSR1`, `SIGUSR2`가 있습니다. 이러한 시그널은 범용 시그널이므로 애플리케이션마다 다르게 응답합니다.
ru: Другие часто используемые сигналы — это `SIGHUP`, `SIGUSR1` и `SIGUSR2`. Поскольку они предназначены для общего применения, разные программы могут реагировать на них по-разному.

source: For example, after changing a web server's configuration file, the web server needs to be told to re-read its configuration. Restarting `httpd` would result in a brief outage period on the web server. Instead, send the daemon the `SIGHUP` signal. Be aware that different daemons will have different behavior, so refer to the documentation for the daemon to determine if `SIGHUP` will achieve the desired results.
ko: 예를 들어 웹 서버의 구성 파일을 변경한 후에는 웹 서버에 구성을 다시 읽으라고 알려야 합니다. `httpd` 재시작 명령을 하면 웹 서버가 잠시 중단될 수 있습니다. 대신 데몬에 `SIGHUP` 시그널을 보내세요. 시그널은 데몬마다 시그널에 대한 동작 방식이 다르므로 해당 데몬의 설명서를 참조하여 `SIGHUP`으로 원하는 결과를 얻을 수 있는지 확인하세요.
ru: Например, после изменения конфигурационного файла веб-сервера необходимо указать веб-серверу перечитать его конфигурацию. Перезапуск `httpd` приведёт к кратковременному простою веб-сервера. Вместо этого отправьте демону сигнал `SIGHUP`. Учтите, что разные демоны могут вести себя по-разному, поэтому обратитесь к документации демона, чтобы определить, приведёт ли `SIGHUP` к желаемому результату.

source: Killing a random process on the system is a bad idea. In particular, man:init[8], PID 1, is special. Running `/bin/kill -s KILL 1` is a quick, and unrecommended, way to shutdown the system. _Always_ double check the arguments to man:kill[1] _before_ pressing kbd:[Return].
ko: 시스템에서 임의의 프로세스를 종료(죽이는) 일은 나쁜 아이디어입니다. 특히 man:init[8], PID 1은 특별합니다. `/bin/kill -s KILL 1`을 실행하는 것은 시스템을 종료하는 빠르지만 절대 권장할 수 없는 방법입니다. _man:kill[1]을 적고 kbd:[Return]을 누르기 전에 항상 man:kill[1]의 인수를 다시 한번 확인하세요._
ru: Убить случайный процесс в системе — плохая идея. В частности, man:init[8], PID 1, является особым. Запуск `/bin/kill -s KILL 1` — это быстрый, но не рекомендуемый способ выключить систему. _Всегда_ перепроверяйте аргументы для man:kill[1] _перед_ нажатием kbd:[Return].

source: Shells
ko: 셸(Shells)
ru: Оболочки

source: A _shell_ provides a command line interface for interacting with the operating system. A shell receives commands from the input channel and executes them. Many shells provide built in functions to help with everyday tasks such as file management, file globbing, command line editing, command macros, and environment variables. FreeBSD comes with several shells, including the Bourne shell (man:sh[1]) and the extended C shell (man:tcsh[1]). Other shells are available from the FreeBSD Ports Collection, such as `zsh` and `bash`.
ko: 셸은 운영체제와 상호작용할 수 있는 명령줄 인터페이스(CLI)를 제공합니다. 셸은 입력 채널에서 명령을 받아 실행합니다. 많은 셸은 파일 관리, 파일 글로빙, 명령줄 편집, 명령 매크로 및 환경 변수와 같은 일상적인 작업에 도움이 되는 내장 함수를 제공합니다. FreeBSD은 Bourne 셸(man:sh[1])과Extended C 셸(man:tcsh[1])을 포함한 여러가지 셸을 함께 제공합니다. `zsh` 및 `bash`와 같은 셸은 FreeBSD 포트(Port) 컬렉션에서 다운받아 사용할 수 있습니다.
ru: _Оболочка_ предоставляет интерфейс командной строки для взаимодействия с операционной системой. Оболочка получает команды из входного канала и выполняет их. Многие оболочки предоставляют встроенные функции для помощи в повседневных задачах, таких как управление файлами, подстановка имён файлов (file globbing), редактирование командной строки, макросы команд и переменные окружения. FreeBSD поставляется с несколькими оболочками, включая Bourne shell (man:sh[1]) и расширенную C shell (man:tcsh[1]). Другие оболочки доступны в коллекции портов FreeBSD, например `zsh` и `bash`.

source: The shell that is used is really a matter of taste. A C programmer might feel more comfortable with a C-like shell such as man:tcsh[1]. A Linux(R) user might prefer `bash`. Each shell has unique properties that may or may not work with a user's preferred working environment, which is why there is a choice of which shell to use.
ko: 어떤 셸을 사용할지는 순전히 취향의 문제입니다. C 프로그래머는 man:tcsh[1]와 같은 C와 유사한 셸을 더 편하게 느낄 수 있습니다. Linux(R) 사용자는 `bash`를 선호할 수 있습니다. 각 셸에는 사용자가 선호하는 작업 환경에서 작동하거나 작동하지 않을 수 있는 고유한 속성이 있으므로 어떤 셸을 사용할지 선택해야 합니다.
ru: Используемая оболочка — это действительно вопрос предпочтений. Программисту на C может быть удобнее работать с C-подобной оболочкой, такой как man:tcsh[1]. Пользователь Linux(R) может предпочесть `bash`. Каждая оболочка обладает уникальными свойствами, которые могут подходить или не подходить под предпочитаемую пользователем рабочую среду, поэтому существует выбор, какую оболочку использовать.

source: One common shell feature is filename completion. After a user types the first few letters of a command or filename and presses kbd:[Tab], the shell completes the rest of the command or filename. Consider two files called `foobar` and `football`. To delete `foobar`, the user might type `rm foo` and press kbd:[Tab] to complete the filename.
ko: 일반적인 셸 기능 중 하나는 파일 이름 완성(filename completion)입니다. 사용자가 명령어 또는 파일 이름의 처음 몇 글자를 입력하고 kbd:[Tab]을 누르면 셸이 나머지 부분을 완성합니다. `foobar`와 `football`이라는 두 파일을 예로 들어 보겠습니다. 만약 사용자가 `foobar`를 삭제하고 싶다면 `rm foo`를 입력한 후 kbd:[Tab]을 눌러 파일 이름을 완성할 수 있습니다.
ru: Одной из распространённых возможностей оболочки является завершение имён файлов. Когда пользователь вводит первые несколько букв команды или имени файла и нажимает kbd:[Tab], оболочка автоматически дописывает оставшуюся часть команды или имени файла. Рассмотрим два файла с именами `foobar` и `football`. Чтобы удалить `foobar`, пользователь может ввести `rm foo` и нажать kbd:[Tab] для завершения имени файла.

source: But the shell only shows `rm foo`. It was unable to complete the filename because both `foobar` and `football` start with `foo`. Some shells sound a beep or show all the choices if more than one name matches. The user must then type more characters to identify the desired filename. Typing a `t` and pressing kbd:[Tab] again is enough to let the shell determine which filename is desired and fill in the rest.
ko: 그러나 셸은 `rm foo`만 표시합니다. `foobar`와 `football` 모두 `foo`로 시작하기 때문에 파일 이름을 완성할 수 없습니다. 일부 셸은 둘 이상의 이름이 일치하는 경우 경고음을 울리거나 모든 선택 항목을 표시합니다. 그러면 사용자는 원하는 파일 이름을 식별하기 위해 더 많은 문자를 입력해야 합니다. `t`를 입력하고 kbd:[Tab]을 다시 누르면 셸이 원하는 파일 이름을 결정하고 나머지를 채우도록 할 수 있습니다.
ru: Но оболочка показывает только `rm foo`. Она не смогла завершить имя файла, потому что и `foobar`, и `football` начинаются с `foo`. Некоторые оболочки издают звуковой сигнал или показывают все варианты, если совпадает более одного имени. Пользователь должен затем ввести дополнительные символы, чтобы указать нужное имя файла. Ввод `t` и повторное нажатие kbd:[Tab] достаточно, чтобы оболочка определила, какое имя файла требуется, и заполнила остальное.

source: Another feature of the shell is the use of environment variables. Environment variables are a variable/key pair stored in the shell's environment. This environment can be read by any program invoked by the shell, and thus contains a lot of program configuration. crossref:basics[shell-env-vars,Common Environment Variables] provides a list of common environment variables and their meanings. Note that the names of environment variables are always in uppercase.
ru: Еще одна особенность оболочки — использование переменных окружения. Переменные окружения представляют собой пару переменная/ключ, хранящуюся в окружении оболочки. Это окружение может быть прочитано любой программой, запущенной оболочкой, и поэтому содержит множество настроек программ. В crossref:basics[shell-env-vars,Распространенные переменные окружения] приведен список распространенных переменных окружения и их значений. Обратите внимание, что имена переменных окружения всегда записываются в верхнем регистре.

source: Common Environment Variables
ko: 일반적인 환경 변수
ru: Распространенные переменные окружения

source: Variable
ko: 변수
ru: Переменная

source: Current logged in user's name.
ko: 현재 로그인한 사용자 이름.
ru: Имя текущего вошедшего пользователя.

source: Colon-separated list of directories to search for binaries.
ko: 바이너리를 검색할 수 있는 콜론으로 구분된 디렉터리 목록.
ru: Двоеточием разделённый список каталогов для поиска бинарных файлов.

source: Network name of the Xorg display to connect to, if available.
ko: 연결할 Xorg 디스플레이의 네트워크 이름(가능한 경우).
ru: Сетевое имя дисплея Xorg для подключения, если доступно.

source: The current shell.
ko: 현재 셸.
ru: Текущая оболочка.

source: The name of the user's type of terminal. Used to determine the capabilities of the terminal.
ko: 사용자의 단말기 유형 이름. 단말기의 사용가능 여부를 확인하는 데 사용됩니다.
ru: Имя типа терминала пользователя. Используется для определения возможностей терминала.

source: Database entry of the terminal escape codes to perform various terminal functions.
ko: 다양한 터미널 기능을 수행하기 위한 터미널 이스케이프 코드의 데이터베이스 목록.
ru: Запись в базе данных escape-кодов терминала для выполнения различных функций терминала.

source: Type of operating system.
ko: 운영 체제 유형.
ru: Тип операционной системы.

source: The system's CPU architecture.
ko: 시스템의 CPU 아키텍처.
ru: Архитектура процессора системы.

source: The user's preferred text editor.
ko: 사용자가 선호하는 텍스트 편집기.
ru: Предпочитаемый текстовый редактор пользователя.

source: The user's preferred utility for viewing text one page at a time.
ko: 사용자가 페이지씩 텍스트를 보기 위해 선호하는 유틸리티.
ru: Предпочитаемая пользователем утилита для просмотра текста постранично.

source: Colon-separated list of directories to search for manual pages.
ko: 매뉴얼 페이지를 검색할 수 있는 콜론으로 구분된 디렉토리 목록.
ru: Двоеточием разделённый список каталогов для поиска страниц руководства.

source: How to set an environment variable differs between shells. In man:tcsh[1] and man:csh[1], use `setenv` to set environment variables. In man:sh[1] and `bash`, use `export` to set the current environment variables. This example sets the default `EDITOR` to `/usr/local/bin/emacs` for the man:tcsh[1] shell:
ko: 환경 변수를 설정하는 방법은 셸마다 다릅니다. Man:tcsh[1] 및 man:csh[1]에서는 `setenv`를 사용하여 환경 변수를 설정합니다. Man:sh[1] 및 `bash`에서는 `export`를 사용하여 현재 환경 변수를 설정합니다. 이 예에서는 man:tcsh[1] 셸의 기본 `EDITOR`를 `/usr/local/bin/emacs`로 설정합니다:
ru: Как установить переменную окружения, зависит от используемой оболочки. В man:tcsh[1] и man:csh[1] используйте `setenv` для установки переменных окружения. В man:sh[1] и `bash` используйте `export` для установки текущих переменных окружения. В этом примере устанавливается значение `EDITOR` по умолчанию в `/usr/local/bin/emacs` для оболочки man:tcsh[1]:

source: The equivalent command for `bash` would be:
ko: `bash`에 해당하는 명령은 다음과 같습니다:
ru: Эквивалентная команда для `bash` будет:

source: To expand an environment variable in order to see its current setting, type a `$` character in front of its name on the command line. For example, `echo $TERM` displays the current `$TERM` setting.
ko: 환경 변수를 확장하여 현재 설정을 확인하려면 명령줄에서 이름 앞에 `$` 문자를 입력합니다. 예를 들어 `echo $TERM`은 현재 `$TERM` 설정을 표시합니다.
ru: Чтобы раскрыть переменную окружения и увидеть её текущее значение, введите символ `$` перед её именем в командной строке. Например, `echo $TERM` выведет текущее значение переменной `$TERM`.

source: Shells treat special characters, known as meta-characters, as special representations of data. The most common meta-character is `\*`, which represents any number of characters in a filename. Meta-characters can be used to perform filename globbing. For example, `echo *` is equivalent to `ls` because the shell takes all the files that match `*` and `echo` lists them on the command line.
ko: 셸은 메타 문자로 알려진 특수 문자를 데이터의 특수 표현으로 취급합니다. 가장 일반적인 메타 문자는 `\*`로, 파일 이름에 있는 문자 수를 나타냅니다. 메타 문자를 사용하여 파일 이름 글로빙을 수행할 수 있습니다. 예를 들어 `echo *`는 `echo`와 `*`에 일치하는 모든 파일을 셸이 가져오고 나열하기 때문에 `ls`와 동일합니다.
ru: Оболочки интерпретируют специальные символы, известные как метасимволы, как особые представления данных. Наиболее распространённый метасимвол — `\*`, который обозначает любое количество символов в имени файла. Метасимволы могут использоваться для подстановки имён файлов (globbing). Например, команда `echo *` эквивалентна `ls`, поскольку оболочка выбирает все файлы, соответствующие шаблону `\*`, а `echo` выводит их в командной строке.

source: To prevent the shell from interpreting a special character, escape it from the shell by starting it with a backslash (`\`). For example, `echo $TERM` prints the terminal setting whereas `echo \$TERM` literally prints the string `$TERM`.
ko: 셸이 특수 문자를 해석하지 못하도록 하려면 백슬래시(`\`)로 시작하여 셸에서 명령을 끝냅니다. 예를 들어, `echo $TERM`은 터미널 설정을 출력하는 반면 `echo \$TERM`은 문자 그대로 문자열 `$TERM`을 출력합니다.
ru: Чтобы предотвратить интерпретацию специального символа оболочкой, экранируйте его с помощью обратной косой черты (`\`). Например, `echo $TERM` выводит настройки терминала, тогда как `echo \$TERM` выводит строку `$TERM` буквально.

source: Changing the Shell
ko: 셸 변경하기
ru: Изменение оболочки

source: The easiest way to permanently change the default shell is to use `chsh`. Running this command will open the editor that is configured in the `EDITOR` environment variable, which by default is set to man:vi[1]. Change the `Shell:` line to the full path of the new shell.
ko: 기본 셸을 영구적으로 변경하는 가장 쉬운 방법은 `chsh`를 사용하는 것입니다. 이 명령을 실행하면 `EDITOR` 환경 변수에 구성된 편집기가 열리며, 이 환경 변수는 기본적으로 man:vi[1]로 설정되어 있습니다. `Shell:` 줄을 새 셸의 전체 경로로 변경합니다.
ru: Самый простой способ навсегда изменить оболочку по умолчанию — использовать `chsh`. Запуск этой команды откроет редактор, настроенный в переменной окружения `EDITOR`, которая по умолчанию установлена в man:vi[1]. Измените строку `Shell:` на полный путь к новой оболочке.

source: Alternately, use `chsh -s` which will set the specified shell without opening an editor. For example, to change the shell to `bash`:
ko: 또는 편집기를 열지 않고도 지정된 셸을 설정하는 `chsh -s`를 사용할 수 있습니다. 예를 들어 셸을 `bash`로 변경합니다:
ru: Или используйте `chsh -s`, который установит указанную оболочку без открытия редактора. Например, чтобы изменить оболочку на `bash`:

source: Enter your password at the prompt and press kbd:[Return] to change your shell. Log off and log in again to start using the new shell.
ru: Введите пароль в командной строке и нажмите kbd:[Return], чтобы изменить оболочку. Выйдите из системы и войдите снова, чтобы начать использовать новую оболочку.

source: The new shell _must_ be present in `/etc/shells`. If the shell was installed from the FreeBSD Ports Collection as described in crossref:ports[ports,Installing Applications: Packages and Ports], it should be automatically added to this file. If it is missing, add it using this command, replacing the path with the path of the shell:
ko: 새로 사용하려는 셸은 `/etc/shells`에 _반드시_ 존재해야 합니다. crossref:ports[ports,Installing Applications: Packages and Ports]에 설명된 대로 FreeBSD 포트 컬렉션에서 셸을 설치했다면, 이 파일에 자동으로 추가되어야 합니다. 누락된 경우 다음 명령을 사용하여 경로를 셸 경로로 바꾸어 추가합니다:
ru: Новая оболочка *обязательно* должна присутствовать в `/etc/shells`. Если оболочка была установлена из Коллекции портов FreeBSD, как описано в crossref:ports[ports,Установка приложений: Пакеты и порты], она должна быть автоматически добавлена в этот файл. Если её там нет, добавьте её с помощью следующей команды, заменив путь на путь к вашей оболочке:

source: Then, rerun man:chsh[1].
ko: 그런 다음 man:chsh[1]을 다시 실행합니다.
ru: Затем снова запустите man:chsh[1].

source: Advanced Shell Techniques
ko: 고급 셸 기법
ru: Продвинутые методы работы с оболочкой

source: The UNIX(R) shell is not just a command interpreter, it acts as a powerful tool which allows users to execute commands, redirect their output, redirect their input and chain commands together to improve the final command output. When this functionality is mixed with built in commands, the user is provided with an environment that can maximize efficiency.
ko: UNIX(R) 셸은 단순한 명령 인터프리터가 아니라 사용자가 명령을 실행하고, 출력을 리디렉션하고, 입력을 리디렉션하고, 명령을 함께 연결하여 최종 명령문의 출력을 개선할 수 있는 강력한 도구입니다. 이 기능을 내장 명령어와 함께 사용하면 효율성을 극대화할 수 있는 환경을 사용자에게 제공할 수 있습니다.
ru: UNIX(R) оболочка — это не просто командный интерпретатор, а мощный инструмент, который позволяет пользователям выполнять команды, перенаправлять их вывод и ввод, а также объединять команды в цепочки для улучшения конечного результата. В сочетании со встроенными командами это предоставляет пользователю среду, способную максимизировать эффективность работы.
