Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: Shell redirection is the action of sending the output or the input of a command into another command or into a file. To capture the output of the man:ls[1] command, for example, into a file, redirect the output:
ko: 셸 리디렉션은 명령문의 출력 또는 입력을 다른 명령문이나 파일로 보내는 방법입니다. 예를 들어 man:ls[1] 명령의 출력을 파일로 캡처하려면 출력을 리디렉션합니다:
ru: Перенаправление в оболочке — это действие отправки вывода или ввода команды в другую команду или файл. Например, чтобы сохранить вывод команды man:ls[1] в файл, перенаправьте вывод:

source: The directory contents will now be listed in `directory_listing.txt`. Some commands can be used to read input, such as man:sort[1]. To sort this listing, redirect the input:
ko: 이제 디렉터리 내용이 `directory_listing.txt`에 나열됩니다. Man:sort[1]과 같은 일부 명령을 사용하여 입력을 읽을 수 있습니다. 이 목록을 정렬하려면 입력을 리디렉션합니다:
ru: Содержимое каталога теперь будет отображено в файле `directory_listing.txt`. Некоторые команды, например man:sort[1], могут использоваться для чтения ввода. Чтобы отсортировать этот список, перенаправьте ввод:

source: The input will be sorted and placed on the screen. To redirect that input into another file, one could redirect the output of man:sort[1] by mixing the direction:
ko: 입력이 정렬되어 화면에 배치됩니다. 해당 입력을 다른 파일로 리디렉션하려면 방향을 혼합하여 man:sort[1]의 출력을 리디렉션할 수 있습니다:
ru: Входные данные будут отсортированы и выведены на экран. Чтобы перенаправить эти данные в другой файл, можно перенаправить вывод `man:sort[1]`, изменив направление:

source: In all of the previous examples, the commands are performing redirection using file descriptors. Every UNIX(R) system has file descriptors, which include standard input (stdin), standard output (stdout), and standard error (stderr). Each one has a purpose, where input could be a keyboard or a mouse, something that provides input. Output could be a screen or paper in a printer. And error would be anything that is used for diagnostic or error messages. All three are considered I/O based file descriptors and sometimes considered streams.
ko: 앞의 모든 예제에서 명령은 파일 해설자(file descriptor)를 사용하여 리디렉션을 수행합니다. 모든 UNIX(R) 시스템에는 표준 입력(stdin), 표준 출력(stdout) 및 표준 오류(stderr)를 포함하는 파일 해설자가 있습니다. 각각의 파일 해설자에는 용도가 있는데, input은 키보드나 마우스 등의 입력을 제공할 수 있습니다. Output은 화면이나 프린터의 용지 등이 될 수 있습니다. 그리고 Error는 진단 또는 오류 메시지에 사용되는 모든 것이 될 수 있습니다. 이 세 가지 모두 I/O 기반 파일 해설자로 간주되며, 스트림이라고도 합니다.
ru: Во всех предыдущих примерах команды выполняют перенаправление с использованием файловых дескрипторов. Каждая UNIX(R)-система имеет файловые дескрипторы, включая стандартный ввод (stdin), стандартный вывод (stdout) и стандартный вывод ошибок (stderr). Каждый из них имеет своё назначение: ввод может осуществляться с клавиатуры или мыши — устройств, предоставляющих входные данные. Вывод может направляться на экран или бумагу в принтере. А ошибки — это всё, что используется для диагностических или сообщений об ошибках. Все три типа считаются файловыми дескрипторами, основанными на вводе-выводе, и иногда называются потоками.

source: Through the use of these descriptors, the shell allows output and input to be passed around through various commands and redirected to or from a file. Another method of redirection is the pipe operator.
ko: 셸은 이러한 해설자를 사용하여 다양한 명령을 통해 출력과 입력을 전달하고 파일로, 또는 파일에서 리디렉션할 수 있습니다. 리디렉션의 또 다른 방법은 파이프 연산자입니다.
ru: С помощью этих дескрипторов оболочка позволяет передавать вывод и ввод между различными командами и перенаправлять их в файл или из файла. Другой метод перенаправления — оператор конвейера.

source: The UNIX(R) pipe operator, "|" allows the output of one command to be directly passed or directed to another program. Basically, a pipe allows the standard output of a command to be passed as standard input to another command, for example:
ko: UNIX(R) 파이프 연산자 "|"를 사용하면 한 명령의 출력을 다른 프로그램으로 직접 전달하거나 지시할 수 있습니다. 기본적으로 파이프를 사용하면 명령의 표준 출력을 다른 명령에 표준 입력으로 전달할 수 있습니다. 예를들어:
ru: Оператор UNIX(R) pipe, `|`, позволяет передавать вывод одной команды напрямую или направлять его другой программе. По сути, pipe позволяет передать стандартный вывод одной команды в качестве стандартного ввода другой команды, например:

source: In that example, the contents of `directory_listing.txt` will be sorted and the output passed to man:less[1]. This allows the user to scroll through the output at their own pace and prevent it from scrolling off the screen.
ko: 이 예제에서는 `directory_listing.txt`의 내용이 정렬되고 출력이 man:less[1]로 전달됩니다. 이렇게 하면 사용자가 자신의 속도에 맞춰 출력을 스크롤할 수 있고 화면을 넘어 스크롤되는 것을 방지할 수 있습니다.
ru: В этом примере содержимое файла `directory_listing.txt` будет отсортировано, а вывод передан в man:less[1]. Это позволяет пользователю прокручивать вывод в удобном темпе и предотвращает его исчезновение с экрана.

source: Text Editors
ko: 텍스트 편집기
ru: Текстовые редакторы

source: Most FreeBSD configuration is done by editing text files, so it is a good idea to become familiar with a text editor. FreeBSD comes with a few as part of the base system, and many more are available in the Ports Collection.
ko: 대부분의 FreeBSD 구성은 텍스트 파일을 편집하여 이루어지므로 텍스트 편집기에 익숙해지는 것이 좋습니다. FreeBSD는 기본 시스템의 일부로 몇 가지 텍스트 편집기를 제공하며, 포트(Port) 컬렉션에서 더 많은 것을 사용할 수 있습니다.
ru: Большая часть настройки FreeBSD выполняется путём редактирования текстовых файлов, поэтому рекомендуется освоить текстовый редактор. В базовую систему FreeBSD входит несколько таких редакторов, а ещё больше доступно в Коллекции портов.

source: A simple editor to learn is man:ee[1], which stands for easy editor. To start this editor, type `ee _filename_` where _filename_ is the name of the file to be edited. Once inside the editor, all of the commands for manipulating the editor's functions are listed at the top of the display. The caret (`^`) represents kbd:[Ctrl], so `^e` expands to kbd:[Ctrl+e]. To leave man:ee[1], press kbd:[Esc], then choose the "leave editor" option from the main menu. The editor will prompt to save any changes if the file has been modified.
ko: 배우기 쉬운 편집기는 쉬운 편집기(Easy Editor)의 약자인 man:ee[1]입니다. 이 에디터를 시작하려면 `ee _파일명_`을 입력합니다. 여기서 _파일명_은 편집할 파일의 이름입니다. 편집기에 들어가면 편집기의 기능을 조작하기 위한 모든 명령이 디스플레이 상단에 나열됩니다. 캐럿(`^`)은 kbd:[Ctrl]을 나타내므로 `^e`는 kbd:[Ctrl+e]입니다. Man:ee[1]을 종료하려면 kbd:[Esc]를 누른 다음 주 메뉴에서 “”leave editor”를 선택합니다. 파일이 수정된 경우 편집기에서 변경 사항을 저장할지 묻는 메시지가 표시됩니다.
ru: Простой редактор для освоения — это man:ee[1], что означает «легкий редактор». Чтобы запустить его, введите `ee _имя_файла_`, где _имя_файла_ — это имя редактируемого файла. Внутри редактора все команды для управления его функциями перечислены в верхней части экрана. Символ каретки (`^`) обозначает kbd:[Ctrl], поэтому `^e` означает kbd:[Ctrl+e]. Для выхода из man:ee[1] нажмите kbd:[Esc] и выберите пункт «покинуть редактор» в главном меню. Если файл был изменен, редактор предложит сохранить изменения.

source: FreeBSD also comes with more powerful text editors, such as man:vi[1], as part of the base system. Other editors, like package:editors/emacs[] and package:editors/vim[], are part of the FreeBSD Ports Collection. These editors offer more functionality at the expense of being more complicated to learn. Learning a more powerful editor such as vim or Emacs can save more time in the long run.
ko: FreeBSD는 또한 기본 시스템의 일부로 man:vi[1]와 같은 더 강력한 텍스트 편집기를 제공합니다. package:editors/emacs[] 및 package:editors/vim[]과 같은 다른 편집기는 FreeBSD 포트 컬렉션에서 다운 받을 수 있습니다. 이러한 편집기는 더 복잡한 대신 더 많은 기능을 제공합니다. Vim이나 Emacs와 같은 더 강력한 편집기를 배우면 장기적으로 더 많은 시간을 절약할 수 있습니다.
ru: FreeBSD также включает более мощные текстовые редакторы, такие как man:vi[1], в составе базовой системы. Другие редакторы, например package:editors/emacs[] и package:editors/vim[], доступны в коллекции портов FreeBSD. Эти редакторы предоставляют больше возможностей, но их освоение сложнее. Изучение более мощного редактора, такого как vim или Emacs, может сэкономить время в долгосрочной перспективе.

source: Many applications which modify files or require typed input will automatically open a text editor. To change the default editor, set the `EDITOR` environment variable as described in crossref:basics[shells, Shells].
ru: Многие приложения, которые изменяют файлы или требуют ввода текста, автоматически открывают текстовый редактор. Чтобы изменить редактор по умолчанию, установите переменную окружения `EDITOR`, как описано в crossref:basics[shells, Оболочки].

source: Devices and Device Nodes
ko: 디바이스 및 디바이스 노드
ru: Устройства и Узлы Устройств

source: A device is a term used mostly for hardware-related activities in a system, including disks, printers, graphics cards, and keyboards. When FreeBSD boots, the majority of the boot messages refer to devices being detected. A copy of the boot messages is saved to `/var/run/dmesg.boot`.
ko: 디바이스(장치)는 주로 디스크, 프린터, 그래픽 카드, 키보드 등 시스템에서 하드웨어와 관련된 활동에 사용되는 용어입니다. FreeBSD가 부팅될 때, 부팅 메시지의 대부분은 감지되는 장치에 관한 것입니다. 부팅 메시지의 사본은 `/var/run/dmesg.boot`에 저장됩니다.
ru: Устройство — это термин, в основном используемый для описания аппаратных компонентов системы, таких как диски, принтеры, видеокарты и клавиатуры. При загрузке FreeBSD большинство сообщений относятся к обнаружению устройств. Копия этих сообщений сохраняется в файле `/var/run/dmesg.boot`.

source: Each device has a device name and number. For example, `ada0` is the first SATA hard drive, while `kbd0` represents the keyboard.
ko: 각 장치에는 장치 이름과 번호가 있습니다. 예를 들어, `ada0`은 첫 번째 SATA 하드 드라이브를 나타내고 `kbd0`은 키보드를 나타냅니다.
ru: У каждого устройства есть имя и номер. Например, `ada0` — это первый жёсткий диск SATA, а `kbd0` обозначает клавиатуру.

source: Most devices in FreeBSD must be accessed through special files called device nodes, which are located in `/dev`.
ko: FreeBSD의 대부분의 장치는 `/dev`에 있는 디바이스 노드라는 특수 파일을 통해 액세스해야 합니다.
ru: Большинство устройств в FreeBSD должны быть доступны через специальные файлы, называемые узлами устройств, которые расположены в `/dev`.

source: Manual Pages
ko: 매뉴얼 페이지
ru: Справочник

source: The most comprehensive documentation on FreeBSD is in the form of manual pages. Nearly every program on the system comes with a short reference manual explaining the basic operation and available arguments. These manuals can be viewed using `man`:
ko: FreeBSD에 대한 가장 포괄적인 문서는 매뉴얼 페이지입니다. 시스템의 거의 모든 프로그램에는 기본 조작과 사용 가능한 인수를 설명하는 짧은 참조 설명서가 함께 제공됩니다. 이러한 매뉴얼은 `man`을 사용하여 볼 수 있습니다:
ru: Наиболее полная документация по FreeBSD представлена в виде Справочника (manual pages). Почти каждая программа в системе имеет краткое справочное руководство, объясняющее основы работы и доступные аргументы. Эти руководства можно просматривать с помощью команды `man`:

source: where _command_ is the name of the command to learn about. For example, to learn more about man:ls[1], type:
ko: 여기서 _command_는 자세히 알아보려는 명령의 이름입니다. 예를 들어 man:ls[1]에 대해 자세히 알아보려면 다음과 같이 입력합니다:
ru: где _command_ — это название команды, о которой нужно узнать больше. Например, чтобы узнать больше о man:ls[1], введите:

source: Manual pages are divided into sections which represent the type of topic. In FreeBSD, the following sections are available:
ko: 매뉴얼 페이지는 주제 유형을 나타내는 섹션으로 나뉩니다. FreeBSD에서는 다음과 같은 섹션을 사용할 수 있습니다:
ru: Страницы Справочника разделены на разделы, которые обозначают тип темы. В FreeBSD доступны следующие разделы:

source: User commands.
ko: 사용자 명령어.
ru: Пользовательские команды.

source: System calls and error numbers.
ko: 시스템 호출 및 오류 번호.
ru: Системные вызовы и коды ошибок.

source: Functions in the C libraries.
ko: C 라이브러리의 함수.
ru: Функции в библиотеках C.

source: Device drivers.
ko: 디바이스 드라이버.
ru: Драйверы устройств.

source: File formats.
ko: 파일 형식.
ru: Форматы файлов.

source: Games and other diversions.
ko: 게임 및 기분 전환.
ru: Развлечения и другие игры.

source: Miscellaneous information.
ko: 기타 정보.
ru: Различная информация.

source: System maintenance and operation commands.
ko: 시스템 유지 관리 및 운영 명령어.
ru: Системные команды обслуживания и эксплуатации.

source: System kernel interfaces.
ko: 시스템 커널 인터페이스.
ru: Интерфейсы ядра системы.

source: In some cases, the same topic may appear in more than one section of the online manual. For example, there is a `chmod` user command and a `chmod()` system call. To tell man:man[1] which section to display, specify the section number:
ko: 경우에 따라 동일한 주제가 온라인 설명서의 여러 섹션에 나타날 수 있습니다. 예를 들어 `chmod` 사용자 명령과 `chmod()` 시스템 호출이 있습니다. Man:man[1]에 표시할 섹션 번호를 지정해 주면 해당 섹션을 표시합니다:
ru: В некоторых случаях одна и та же тема может встречаться в нескольких разделах онлайн-руководства. Например, существует пользовательская команда `chmod` и системный вызов `chmod()`. Чтобы указать man:man[1], какой раздел отображать, укажите номер раздела:

source: This will display the manual page for the user command man:chmod[1]. References to a particular section of the online manual are traditionally placed in parenthesis in written documentation, so man:chmod[1] refers to the user command and man:chmod[2] refers to the system call.
ko: 그러면 사용자 명령 man:chmod[1]에 대한 설명서 페이지가 표시됩니다. 온라인 매뉴얼의 특정 섹션에 대한 참조는 일반적으로 서면 문서에서 괄호 안에 배치되므로 man:chmod[1]은 사용자 명령을, man:chmod[2]는 시스템 호출을 참조합니다.
ru: Это отобразит справочную страницу для пользовательской команды man:chmod[1]. Ссылки на определённый раздел онлайн-руководства традиционно заключаются в скобки в письменной документации, поэтому man:chmod[1] относится к пользовательской команде, а man:chmod[2] — к системному вызову.

source: If the name of the manual page is unknown, use `man -k` to search for keywords in the manual page descriptions:
ko: 매뉴얼 페이지의 이름을 모르는 경우 `man -k`를 사용하여 매뉴얼 페이지 설명에서 키워드를 검색하세요:
ru: Если название страницы руководства неизвестно, используйте `man -k` для поиска ключевых слов в описаниях страниц руководства:

source: This command displays a list of commands that have the keyword "mail" in their descriptions. This is equivalent to using man:apropos[1].
ko: 이 명령은 설명에 "mail" 키워드가 포함된 명령 목록을 표시합니다. 이는 man:apropos[1]을 사용하는 것과 동일합니다.
ru: Эта команда выводит список команд, содержащих ключевое слово "mail" в их описаниях. Это эквивалентно использованию man:apropos[1].

source: To read the descriptions for all of the commands in `/usr/sbin`, type:
ko: `usr/sbin`에 있는 모든 명령에 대한 설명을 읽으려면 다음과 같이 입력합니다:
ru: Чтобы прочитать описания всех команд в `/usr/sbin`, введите:

source: or
ko: 또는
ru: или

source: GNU Info Files
ko: GNU 정보 파일
ru: Файлы GNU Info

source: FreeBSD includes several applications and utilities produced by the Free Software Foundation (FSF). In addition to manual pages, these programs may include hypertext documents called `info` files. These can be viewed using man:info[1] or, if package:editors/emacs[] is installed, the info mode of emacs.
ko: FreeBSD에는 자유 소프트웨어 재단(FSF)에서 제작한 여러 애플리케이션과 유틸리티가 포함되어 있습니다. 이러한 프로그램에는 매뉴얼 페이지 외에도 `info` 파일이라는 하이퍼텍스트 문서가 포함될 수 있습니다. 이러한 파일은 man:info[1]를 사용하여 볼 수 있으며, package:editors/emacs[]가 설치된 경우 이맥스의 정보 모드를 사용하여 볼 수 있습니다.
ru: FreeBSD включает несколько приложений и утилит, созданных Free Software Foundation (FSF). Помимо man-страниц, эти программы могут содержать гипертекстовые документы, называемые файлами `info`. Их можно просматривать с помощью man:info[1] или, если установлен package:editors/emacs[], в режиме info редактора emacs.

source: To use man:info[1], type:
ko: Man:info[1]을 사용하려면 다음과 같이 입력합니다:
ru: Чтобы использовать man:info[1], введите:

source: For a brief introduction, type `h`. For a quick command reference, type `?`.
ko: 간단한 소개를 보려면 `h`를 입력합니다. 빠른 명령 참조를 보려면 `?`를 입력합니다.
ru: Для краткого введения введите `h`. Для быстрой справки по командам введите `?`.

source: The first line contains some information about the system. The `amd64` indicates that the system in this example is running a 64-bit version of FreeBSD. The hostname is `pc3.example.org`, and `ttyv0` indicates that this is the "system console". The second line is the login prompt.
ko: 첫 번째 줄에는 시스템에 대한 일부 정보가 포함되어 있습니다. 이 예시에서 'amd64'는 시스템이 64비트 버전의 FreeBSD를 실행하고 있음을 나타냅니다. 호스트 이름은 'pc3.example.org'이고 'ttyv0'는 현재 "시스템 콘솔"임을 나타냅니다. 두 번째 줄은 로그인 프롬프트입니다.

source: FreeBSD provides a variety of different commands to manage user accounts. The most common commands are summarized in <<users-modifying-utilities>>, followed by some examples of their usage. See the manual page for each utility for more details and usage examples.
ko: FreeBSD는 사용자 계정을 관리하기 위한 다양한 명령어를 제공합니다. 가장 일반적인 명령은 <<users-modifying-utilities>>에 요약되어 있고, 몇 가지 사용 예가 나와 있습니다. 자세한 내용과 사용 예는 각 유틸리티의 매뉴얼 페이지를 참조하십시오.

source: The man:adduser[8] utility is interactive and walks through the steps for creating a new user account. As seen in <<users-modifying-adduser>>, either input the required information or press kbd:[Return] to accept the default value shown in square brackets. In this example, the user has been invited into the `wheel` group, allowing them to become the superuser with man:su[1]. When finished, the utility will prompt to either create another user or to exit.
ko: Man:adduser[8]는 대화형 유틸리티이며 새 사용자 계정을 만드는 단계를 안내합니다. <<users-modifying-adduser>>에서 볼 수 있듯이 필요한 정보를 직접 입력하거나 kbd:[Return]을 눌러 대괄호 안에 표시된 기본값을 입력합니다. 이 예제에서는 사용자가 'wheel' 그룹에 초대되어 man:su[1]을 가진 수퍼유저가 될 수 있습니다. 완료되면 유틸리티는 또 다른 사용자를 만들지 종료할지 묻습니다.

source: In <<users-modifying-chpass-su>>, the superuser has typed `chpass jru` and is now viewing the fields that can be changed for this user. If `jru` runs this command instead, only the last six fields will be displayed and available for editing. This is shown in <<users-modifying-chpass-ru>>.
ko: <<users-modifying-chpass-su>>에서 수퍼유저가 `chpass jru`를 입력했으면 이제 이 사용자에 대해 변경할 수 있는 필드를 볼 수 있습니다. 만약 `jru`가 이 명령을 대신 실행하면 마지막 6개 필드만 표시되고 편집이 가능해집니다. 이는 <<users-modifying-chpass-ru>>에 표시됩니다.

source: The group name to GID mapping is listed in `/etc/group`. This is a plain text file with four colon-delimited fields. The first field is the group name, the second is the encrypted password, the third the GID, and the fourth the comma-delimited list of members. For a more complete description of the syntax, refer to man:group[5].
ko: GID에 대한 그룹 이름의 매핑은 `/etc/group`에 기록되어 있습니다 이 파일은 콜론으로 구분된 4개의 필드가 있는 일반 텍스트 파일입니다. 첫 번째 필드는 그룹 이름, 두 번째 필드는 암호화된 비밀번호, 세 번째 필드는 GID, 네 번째 필드는 쉼표로 구분된 멤버 목록입니다. 이 문법에 대한 자세한 설명은 man:group[5]을 참조하세요.

source: A mount point is a directory where additional file systems can be grafted onto a parent file system (usually the root file system). This is further described in <<disk-organization>>. Standard mount points include `/usr/`, `/var/`, `/tmp/`, `/mnt/`, and `/cdrom/`. These directories are usually referenced to entries in `/etc/fstab`. This file is a table of various file systems and mount points and is read by the system. Most of the file systems in `/etc/fstab` are mounted automatically at boot time from the script man:rc[8] unless their entry includes `noauto`. Details can be found in <<disks-fstab>>.
ko: 마운트 지점은 상위 파일 시스템(일반적으로 루트 파일 시스템)에 추가 파일 시스템을 연결할 수 있는 디렉터리입니다. 이에 대한 자세한 설명은 <<disk-organization>>에서 확인할 수 있습니다. 표준 마운트 포인트에는 `/usr/`, `/var/`, `/tmp/`, `/mnt/` 및 `/cdrom/`이 포함됩니다. 이러한 디렉터리는 일반적으로 `/etc/fstab`의 항목을 참조합니다. 이 파일은 다양한 파일 시스템과 마운트 지점을 정리한 표이며 시스템에서 읽어들입니다. `/etc/fstab`에 있는 대부분의 파일 시스템은 `noauto`를 포함하지 않는 한 부팅 시 man:rc[8] 스크립트에 의해 자동으로 마운트됩니다. 자세한 내용은 <<disks-fstab>>에서 확인할 수 있습니다.

source: Process file system. Refer to man:procfs[5], man:mount_procfs[8] for details.
ko: 프로세스 파일 시스템. 자세한 내용은 man:procfs[5], man:mount_procfs[8]을 참조하세요.

source: File systems are contained in _partitions_. Disks are divided into partitions using one of several partitioning schemes; see <<bsdinstall-part-manual>>. The newer scheme is GPT; older BIOS-based computers use MBR. GPT supports division of a disk into partitions with a size, offset, and type. It supports a large number of partitions and partition types, and is recommended whenever its use is possible. GPT partitions use the disk name with a suffix, where the suffix is `p1` for the first partition, `p2` for the second, and so on. MBR, however, supports only a small number of partitions. The MBR partitions are known in FreeBSD as `slices`. Slices may be used for different operating systems. FreeBSD slices are subdivided into partitions using BSD labels (see man:bsdlabel[8]).
ko: 파일 시스템은 _파티션_에 포함되어 있습니다. 디스크는 여러 파티션 유형중 하나를 사용하여 각각의 파티션으로 나뉩니다; 이에 대해서는 <<bsdinstall-part-manual>>을 참조하세요. 최신 파티션 유형은 GPT이며, 구형 BIOS 기반 컴퓨터는 MBR을 사용합니다. GPT는 디스크를 사이즈, 오프셋 및 타입으로 파티션으로 분할하는 것을 지원합니다. 이 방식은 많은 수의 파티션과 파티션 유형을 지원하므로 사용이 가능한 경우 항상 권장됩니다. GPT 파티션은 접미사가 붙은 디스크 이름을 사용하며, 여기서 접미사는 첫 번째 파티션의 경우 `p1`, 두 번째 파티션의 경우 `p2`와 같은 식으로 붙습니다. 그러나 MBR은 적은 수의 파티션만 지원합니다. FreeBSD에서 MBR 파티션은 `slices`라고 부릅니다. 슬라이스는 다른 운영체제에서도 사용할 수 있습니다. FreeBSD 슬라이스는 BSD 레이블을 사용하여 여러 파티션으로 세분화됩니다 (man:bsdlabel[8] 참조).

source: Finally, each disk on the system is identified. A disk name starts with a code that indicates the type of disk, and then a number, indicating which disk it is. Unlike partitions and slices, disk numbering starts at 0. Common codes are listed in <<disks-naming>>.
ko: 마지막으로 시스템의 각 디스크는 구분이 가능합니다. 디스크 이름은 디스크 유형을 나타내는 코드로 시작한 다음 어느 디스크인지 나타내는 숫자가 붙습니다. 파티션 및 슬라이스와 달리 디스크 번호는 0부터 시작합니다. 일반적인 코드는 <<disks-naming>>에 정리되어 있습니다.

source: When referring to a partition in a slice, include the disk name, `s`, the slice number, and then the partition letter. Examples are shown in <<basics-disk-slice-part>>. GPT partitions include the disk name, `p`, and then the partition number.
ko: 슬라이스에서 파티션을 참조할 때는 디스크 이름, `s`, 슬라이스 번호, 그리고 파티션 문자를 사용합니다. 이와 관련된 예시는 <<basics-disk-slice-part>>에 나와 있습니다. GPT 파티션은 디스크 이름, `p`, 그리고 파티션 번호를 사용합니다.

source: <<basics-concept-disk-model>> shows a conceptual model of a disk layout using MBR slices.
ko: <<basics-concept-disk-model>>은 MBR 슬라이스를 사용하는 디스크 레이아웃의 개념적 모델을 보여줍니다.

source: An existing device name as explained in <<disks-naming>>.
ko: <<disks-naming>>에 설명된 기존 장치 이름.

source: Another feature of the shell is the use of environment variables. Environment variables are a variable/key pair stored in the shell's environment. This environment can be read by any program invoked by the shell, and thus contains a lot of program configuration. <<shell-env-vars>> provides a list of common environment variables and their meanings. Note that the names of environment variables are always in uppercase.
ko: 셸의 또 다른 특징은 환경 변수를 사용한다는 것입니다. 환경 변수는 셸의 환경에 저장된 변수/키 쌍입니다. 이 환경은 쉘이 호출하는 모든 프로그램에서 읽을 수 있으며, 따라서 많은 프로그램의 설정을 포함합니다. <<shell-env-vars>>에서 일반적인 환경 변수의 목록과 그 의미를 확인할 수 있습니다. 환경 변수의 이름은 항상 대문자로 표기된다는 점에 유의하세요.

source: Many applications which modify files or require typed input will automatically open a text editor. To change the default editor, set the `EDITOR` environment variable as described in <<shells>>.
ko: 파일을 수정하거나 입력이 필요한 많은 응용 프로그램은 자동으로 텍스트 편집기를 엽니다. 기본 편집기를 변경하려면 <<shells>>에 설명된 대로 `EDITOR` 환경 변수를 설정하세요.
