Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: Files and directories are referenced by giving the file or directory name, followed by a forward slash, `/`, followed by any other directory names that are necessary. For example, if the directory `foo` contains a directory `bar` which contains the file `readme.txt`, the full name, or _path_, to the file is `foo/bar/readme.txt`. Note that this is different from Windows(R) which uses `\` to separate file and directory names. FreeBSD does not use drive letters, or other drive names in the path. For example, one would not type `c:\foo\bar\readme.txt` on FreeBSD.
ko: 파일 및 디렉터리는 파일 또는 디렉터리 이름 뒤에 슬래시 `/`를 붙이고 그 뒤에 다른 디렉터리 이름을 붙여서 참조합니다. 예를 들어 `foo` 디렉터리에 `bar` 디렉터리가 있고 그 안에 `readme.txt` 파일이 있는 경우, 파일의 전체 이름 또는 _path_는 `foo/bar/readme.txt`가 됩니다. 파일과 디렉토리 이름을 구분하기 위해 `\`를 사용하는 Windows(R)와 다르다는 점에 유의하십시오. FreeBSD는 경로에 드라이브 문자나 다른 드라이브 이름을 사용하지 않습니다. 예를 들어, FreeBSD에서는 `c:\foo\bar\readme.txt`를 사용하지 않습니다.
ru: Файлы и каталоги указываются путём перечисления имени файла или каталога, за которым следует косая черта `/`, а затем — при необходимости — другие имена каталогов. Например, если каталог `foo` содержит каталог `bar`, в котором находится файл `readme.txt`, то полное имя или _путь_ к файлу будет `foo/bar/readme.txt`. Обратите внимание, что это отличается от Windows(R), где для разделения имён файлов и каталогов используется `\`. В FreeBSD не используются буквы дисков или другие обозначения накопителей в пути. Например, в FreeBSD не указывают путь вида `c:\foo\bar\readme.txt`.

source: File systems
ko: 파일 시스템
ru: Файловые системы

source: Directories and files are stored in a file system. Each file system contains exactly one directory at the very top level, called the _root directory_ for that file system. This root directory can contain other directories. One file system is designated the _root file system_ or `/`. Every other file system is _mounted_ under the root file system. No matter how many disks are on the FreeBSD system, every directory appears to be part of the same disk.
ko: 디렉터리와 파일은 파일 시스템에 저장됩니다. 각 파일 시스템에는 해당 파일 시스템의 _루트 디렉터리_ 라고 하는 최상위 레벨에 정확히 하나의 디렉터리를 가집니다. 이 루트 디렉터리에는 다른 디렉터리가 포함될 수 있습니다. 하나의 파일 시스템은 _루트 파일 시스템_ 또는 `/`로 지정됩니다. 다른 모든 파일 시스템은 루트 파일 시스템 아래에 _마운트_됩니다. FreeBSD 시스템에는 디스크가 몇 개 있든 상관없이 모든 디렉토리는 동일한 디스크의 일부로 나타냅니다.
ru: Каталоги и файлы хранятся в файловой системе. Каждая файловая система содержит ровно один каталог на самом верхнем уровне, называемый _корневым каталогом_ для этой файловой системы. Этот корневой каталог может содержать другие каталоги. Одна файловая система назначается _корневой файловой системой_ или `/`. Все остальные файловые системы _монтируются_ в корневую файловую систему. Независимо от количества дисков в системе FreeBSD, каждый каталог выглядит как часть одного и того же диска.

source: Consider three file systems, called `A`, `B`, and `C`. Each file system has one root directory, which contains two other directories, called `A1`, `A2` (and likewise `B1`, `B2` and `C1`, `C2`).
ko: 가령 `A`, `B`, `C`라고 하는 세 개의 파일 시스템을 생각해 봅시다. 각 파일 시스템에는 하나의 루트 디렉터리가 있으며, 이 루트 디렉터리에는 `A1`, `A2`(그리고 마찬가지로 `B1`, `B2` 및 `C1`, `C2`)라는 두 개의 다른 디렉터리가 있습니다.
ru: Рассмотрим три файловые системы: `A`, `B` и `C`. Каждая файловая система имеет один корневой каталог, который содержит два других каталога с именами `A1`, `A2` (аналогично `B1`, `B2` и `C1`, `C2`).

source: Call `A` the root file system. If man:ls[1] is used to view the contents of this directory, it will show two subdirectories, `A1` and `A2`. The directory tree looks like this:
ko: 루트 파일 시스템 `A`를 호출합니다. Man:ls[1]을 사용하여 이 디렉터리의 내용을 보면 `A1`과 `A2`라는 두 개의 하위 디렉터리가 표시됩니다. 디렉토리 트리는 다음과 같이 보입니다:
ru: Назовем корневую файловую систему `A`. Если использовать man:ls[1] для просмотра содержимого этого каталога, будут видны два подкаталога, `A1` и `A2`. Дерево каталогов выглядит следующим образом:

source: Directory tree with the root directory and two subdirectories
ko: 루트 디렉터리와 두 개의 하위 디렉터리가 있는 디렉터리 트리
ru: Дерево каталогов с корневым каталогом и двумя подкаталогами

source: A file system must be mounted on to a directory in another file system. When mounting file system `B` on to the directory `A1`, the root directory of `B` replaces `A1`, and the directories in `B` appear accordingly:
ko: 하나의 파일 시스템은 반드시 다른 파일 시스템의 디렉토리에 마운트해야 합니다. 예를 들어 파일 시스템 `B`를 `A1` 디렉터리에 마운트하면 `B`의 루트 디렉터리가 `A1`을 대체하고 `B`의 디렉터리들이 그 하위에 나타납니다:
ru: Файловая система должна быть смонтирована в каталог другой файловой системы. При монтировании файловой системы `B` в каталог `A1` корневой каталог `B` заменяет `A1`, а каталоги в `B` отображаются соответствующим образом:

source: Any files that are in the `B1` or `B2` directories can be reached with the path `/A1/B1` or `/A1/B2` as necessary. Any files that were in `/A1` have been temporarily hidden. They will reappear if `B` is _unmounted_ from `A`.
ko: `B1` 또는 `B2` 디렉터리에 있는 모든 파일은 필요에 따라 `/A1/B1` 또는 `/A1/B2` 경로로 접근할 수 있습니다. `A1`에 있던 모든 파일은 일시적으로 숨겨져 있습니다. 이 파일들은 `B`가 `A`에서 _언마운트_되면 다시 나타납니다.
ru: Любые файлы в каталогах `B1` или `B2` доступны по пути `/A1/B1` или `/A1/B2` соответственно. Файлы, которые находились в `/A1`, временно скрыты. Они снова станут доступны, если `B` будет _отмонтирован_ из `A`.

source: If `B` had been mounted on `A2` then the diagram would look like this:
ko: 만약 'B'가 'A2'에 마운트되었다면 다이어그램은 다음과 같이 보일 것입니다:
ru: Если бы `B` был смонтирован на `A2`, то диаграмма выглядела бы так:

source: and the paths would be `/A2/B1` and `/A2/B2` respectively.
ko: 그리고 경로는 각각 `/A2/B1`과 `/A2/B2`가 됩니다.
ru: и пути будут `/A2/B1` и `/A2/B2` соответственно.

source: File systems can be mounted on top of one another. Continuing the last example, the `C` file system could be mounted on top of the `B1` directory in the `B` file system, leading to this arrangement:
ko: 파일 시스템은 또다른 파일 시스템의 최상위 디렉터리에 마운트할 수도 있습니다. 지난 예제에 이어서 `C` 파일 시스템을 `B` 파일 시스템의 `B1` 디렉터리 위에 마운트하여 다음의 형태를 만들 수 있습니다:
ru: Файловые системы могут монтироваться одна поверх другой. Продолжая последний пример, файловая система `C` может быть смонтирована поверх каталога `B1` в файловой системе `B`, что приведёт к следующей структуре:

source: A complex directory tree. With different subdirectories hanging from root.
ko: 복잡한 디렉터리 트리. 루트에 다른 하위 디렉터리가 연결되어 있습니다.
ru: Сложная древовидная структура каталогов. С различными подкаталогами, отходящими от корневого.

source: Or `C` could be mounted directly on to the `A` file system, under the `A1` directory:
ko: 또는 `C`를 `A1` 디렉토리 아래의 `A` 파일 시스템에 직접 마운트할 수도 있습니다:
ru: Или `C` может быть непосредственно смонтирована в файловую систему `A`, в каталог `A1`:

source: It is entirely possible to have one large root file system, and not need to create any others. There are some drawbacks to this approach, and one advantage.
ko: 이런 방식으로 단 하나의 거대한 루트 파일 시스템을 만들 수 있으며 또 다른 루트 파일 시스템을 만들 필요가 없습니다. 이러한 접근 방식에는 몇 가지 단점과 한 가지 장점이 있습니다.
ru: Вполне возможно иметь одну большую корневую файловую систему и не создавать других. У такого подхода есть несколько недостатков и одно преимущество.

source: Benefits of Multiple File Systems
ko: 다중 파일 시스템의 이점
ru: Преимущества нескольких файловых систем

source: Different file systems can have different _mount options_. For example, the root file system can be mounted read-only, making it impossible for users to inadvertently delete or edit a critical file. Separating user-writable file systems, such as `/home`, from other file systems allows them to be mounted _nosuid_. This option prevents the _suid_/_guid_ bits on executables stored on the file system from taking effect, possibly improving security.
ko: 파일 시스템마다 _마운트 옵션_이 다를 수 있습니다. 예를 들어 루트 파일 시스템을 읽기 전용으로 마운트하면 사용자가 실수로 중요한 파일을 삭제하거나 편집할 수 없게 됩니다. `/home`과 같이 사용자가 쓰기 가능한 파일 시스템을 다른 파일 시스템과 분리하면 _nosuid_로 마운트할 수 있습니다. 이 옵션을 사용하면 파일 시스템에 저장된 실행 파일의 _suid_/_guid_ 비트가 적용되지 않으므로 보안을 향상시킬 수 있습니다.
ru: Различные файловые системы могут иметь разные _параметры монтирования_. Например, корневая файловая система может быть смонтирована в режиме только для чтения, что предотвращает случайное удаление или редактирование важных файлов пользователями. Разделение файловых систем, доступных для записи пользователями, таких как `/home`, от остальных позволяет монтировать их с опцией _nosuid_. Эта опция предотвращает действие битов _suid_/_guid_ у исполняемых файлов, хранящихся в данной файловой системе, что может повысить безопасность.

source: FreeBSD automatically optimizes the layout of files on a file system, depending on how the file system is being used. So a file system that contains many small files that are written frequently will have a different optimization to one that contains fewer, larger files. By having one big file system this optimization breaks down.
ko: FreeBSD는 파일 시스템의 사용 방식에 따라 파일 시스템의 파일 레이아웃을 자동으로 최적화합니다. 따라서 쓰기가 자주 일어나는, 작은 파일들이 많이 포함된 파일 시스템은 쓰기가 덜 발생하고 큰 파일이 저장된 파일 시스템과 다른 최적화가 이루어집니다. 하나의 큰 파일 시스템을 사용하면 이러한 최적화가 무너집니다.
ru: FreeBSD автоматически оптимизирует расположение файлов в файловой системе в зависимости от того, как она используется. Таким образом, файловая система, содержащая множество часто записываемых небольших файлов, будет оптимизирована иначе, чем система с меньшим количеством более крупных файлов. При использовании одной большой файловой системы такая оптимизация нарушается.

source: FreeBSD's file systems are robust if power is lost. However, a power loss at a critical point could still damage the structure of the file system. By splitting data over multiple file systems it is more likely that the system will still come up, making it easier to restore from backup as necessary.
ko: FreeBSD의 파일 시스템은 전원이 끊겨도 견고하게 유지됩니다. 하지만 핵심적인 순간에 전원이 끊기면 파일 시스템의 구조가 손상될 수 있습니다. 여러 파일 시스템에 데이터를 분할해 두면 시스템이 계속 가동될 가능성이 높아지며 필요시 백업에서의 복원이 더 쉬워집니다.
ru: Файловые системы FreeBSD устойчивы к потере питания. Однако отключение питания в критический момент всё же может повредить структуру файловой системы. Разделение данных между несколькими файловыми системами увеличивает вероятность успешной загрузки системы, упрощая восстановление из резервной копии при необходимости.

source: Benefit of a Single File System
ko: 단일 파일 시스템의 이점
ru: Преимущество единой файловой системы

source: File systems are a fixed size. If you create a file system when you install FreeBSD and give it a specific size, you may later discover that you need to make the partition bigger. This is not easily accomplished without backing up, recreating the file system with the new size, and then restoring the backed up data.
ko: 파일 시스템은 크기가 고정되어 있습니다. FreeBSD를 설치할 때 파일 시스템을 생성하고 특정 크기로 지정하고 나면, 나중에 파티션을 더 크게 만들어야 할 필요가 생깁니다. 이 작업은 백업하고 새 크기로 파일 시스템을 다시 만든 다음 백업된 데이터를 복원하지 않고는 쉽게 수행할 수 없습니다.
ru: Файловые системы имеют фиксированный размер. Если вы создали файловую систему при установке FreeBSD и задали ей определённый размер, позже может оказаться, что раздел нужно увеличить. Это нелегко сделать без резервного копирования, пересоздания файловой системы с новым размером и последующего восстановления данных из резервной копии.

source: FreeBSD features the man:growfs[8] command, which makes it possible to increase the size of file system on the fly, removing this limitation. A file system can only be expanded into free space in the partition in which it resides. If there is space after the partition, the partition can be expanded with man:gpart[8]. If the partition is the last one on a virtual disk, and the disk is expanded, the partition can then be expanded.
ko: FreeBSD에는 파일 시스템의 크기를 즉시 늘릴 수 있는 man:growfs[8] 명령이 있어 이 제한을 없앨 수 있습니다. 다만 파일 시스템은 해당 파일 시스템이 있는 파티션의 여유 공간으로 만큼만 확장할 수 있습니다. 파티션 뒤에 공간이 있는 경우 man:gpart[8]로 파티션을 확장할 수 있습니다. 만약 파티션이 가상 디스크의 마지막 파티션이고 디스크를 추가한 경우 파티션을 확장할 수 있습니다.
ru: FreeBSD предоставляет команду man:growfs[8], которая позволяет увеличивать размер файловой системы на лету, устраняя это ограничение. Файловая система может быть расширена только в свободное пространство раздела, в котором она находится. Если после раздела есть место, сам раздел можно расширить с помощью man:gpart[8]. Если раздел является последним на виртуальном диске и диск расширен, то раздел также можно расширить.

source: Disk partitions
ko: 디스크 파티션
ru: Разделы диска

source: File systems are contained in _partitions_. Disks are divided into partitions using one of several partitioning schemes; see crossref:bsdinstall[bsdinstall-part-manual, Manual Partitioning]. The newer scheme is GPT; older BIOS-based computers use MBR. GPT supports division of a disk into partitions with a size, offset, and type. It supports a large number of partitions and partition types, and is recommended whenever its use is possible. GPT partitions use the disk name with a suffix, where the suffix is `p1` for the first partition, `p2` for the second, and so on. MBR, however, supports only a small number of partitions. The MBR partitions are known in FreeBSD as `slices`. Slices may be used for different operating systems. FreeBSD slices are subdivided into partitions using BSD labels (see man:bsdlabel[8]).
ru: Файловые системы содержатся в _разделах_. Диски разделяются на разделы с использованием одной из нескольких схем разметки; см. crossref:bsdinstall[bsdinstall-part-manual, Ручная разметка разделов]. Более новая схема — GPT; старые компьютеры на базе BIOS используют MBR. GPT поддерживает разделение диска на разделы с указанием размера, смещения и типа. Она поддерживает большое количество разделов и их типов, и рекомендуется к использованию везде, где это возможно. Разделы GPT используют имя диска с суффиксом, где суффикс `p1` соответствует первому разделу, `p2` — второму и так далее. MBR, однако, поддерживает только небольшое количество разделов. Разделы MBR в FreeBSD называются _слайсами_. Слайсы могут использоваться для разных операционных систем. Слайсы FreeBSD дополнительно разбиваются на разделы с использованием меток BSD (см. man:bsdlabel[8]).

source: Slice numbers follow the device name, prefixed with an `s`, starting at 1. So "da0__s1__" is the first slice on the first SCSI drive. There can only be four physical slices on a disk, but there can be logical slices inside physical slices of the appropriate type. These extended slices are numbered starting at 5, so "ada0__s5__" is the first extended slice on the first SATA disk. These devices are used by file systems that expect to occupy a slice.
ko: 슬라이스 번호는 장치 이름 뒤에 `s`가 붙고, 1부터 시작합니다. 따라서 "da0__s1__"는 첫 번째 SCSI 드라이브의 첫 번째 슬라이스입니다. 디스크에는 4개의 물리적 슬라이스만 있을 수 있지만, 적절한 유형의 물리적 슬라이스 내부에 여러개의 논리 슬라이스가 있을 수 있습니다. 이러한 확장 슬라이스는 5부터 번호가 매겨지므로 "ada0__s5__"는 첫 번째 SATA 디스크의 첫 번째 확장 슬라이스입니다. 이러한 장치는 슬라이스를 사용할 것으로 예상되는 파일 시스템에서 사용됩니다.
ru: Номера слайсов указываются после имени устройства с префиксом `s` и начинаются с 1. Таким образом, "da0__s1__" — это первый слайс на первом SCSI-диске. На диске может быть только четыре физических слайса, но внутри физических слайсов соответствующего типа могут находиться логические слайсы. Эти расширенные слайсы нумеруются, начиная с 5, поэтому "ada0__s5__" — это первый расширенный слайс на первом SATA-диске. Эти устройства используются файловыми системами, которые предназначены для размещения в слайсе.

source: Each GPT or BSD partition can contain only one file system, which means that file systems are often described by either their typical mount point in the file system hierarchy, or the name of the partition they are contained in.
ko: 각각의 GPT 또는 BSD 파티션은 하나의 파일 시스템만 포함할 수 있기 때문에, 파일 시스템은 파일 시스템 계층 구조에서 일상적인 마운트 지점 또는 파일 시스템이 포함된 파티션의 이름으로 부르는 경우가 많습니다.
ru: Каждый раздел GPT или BSD может содержать только одну файловую систему, что означает, что файловые системы часто описываются либо по их стандартной точке монтирования в иерархии файловых систем, либо по имени раздела, в котором они находятся.

source: FreeBSD also uses disk space for _swap space_ to provide _virtual memory_. This allows your computer to behave as though it has much more memory than it actually does. When FreeBSD runs out of memory, it moves some of the data that is not currently being used to the swap space, and moves it back in (moving something else out) when it needs it. This is called _paging_.
ko: FreeBSD는 또한 디스크 공간을 _스왑 공간_으로 사용하여 _가상 메모리_로 제공합니다. 이를 통해 컴퓨터는 실제보다 훨씬 더 많은 메모리가 있는 것처럼 동작할 수 있습니다. FreeBSD는 메모리가 부족하면 현재 사용되지 않는 일부 데이터를 스왑 공간으로 옮기고, 필요할 때 다시 스왑 공간에서 꺼냅니다(대신 다른 것을 안으로 옮깁니다). 이것을 _페이징(paging)_이라고 합니다.
ru: FreeBSD также использует место на диске для _раздела подкачки_ (_swap space_), чтобы обеспечить работу _виртуальной памяти_. Это позволяет компьютеру вести себя так, как будто у него больше памяти, чем есть на самом деле. Когда FreeBSD исчерпывает доступную память, она перемещает часть данных, которые в данный момент не используются, в раздел подкачки, а затем возвращает их обратно (перемещая что-то другое), когда они нужны. Этот процесс называется _подкачкой_ (_paging_).

source: Some BSD partitions have certain conventions associated with them.
ko: 일부 BSD 파티션에는 관련된 특정 규칙이 있습니다.
ru: Некоторые разделы BSD имеют определенные соглашения, связанные с ними.

source: Partition
ko: 파티션
ru: Раздел

source: Convention
ko: 규칙
ru: Соглашение

source: Normally contains the root file system.
ko: 일반적으로 루트 파일 시스템을 포함합니다.
ru: Обычно содержит корневую файловую систему.

source: Normally contains swap space.
ko: 일반적으로 스왑 공간을 포함합니다.
ru: Обычно содержит раздел подкачки.

source: Normally the same size as the enclosing slice. This allows utilities that need to work on the entire slice, such as a bad block scanner, to work on the `c` partition. A file system would not normally be created on this partition.
ko: 일반적으로 포함된 슬라이스와 동일한 크기입니다. 이렇게 하면 배드 블록 스캐너와 같이 전체 슬라이스에서 동작해야 하는 유틸리티가 `c` 파티션에서 작동할 수 있습니다. 일반적으로 이 파티션에는 파일 시스템이 생성되지 않습니다.
ru: Обычно имеет тот же размер, что и окружающий слайс. Это позволяет утилитам, которым необходимо работать со всем слайсом, например, сканеру плохих блоков, работать с разделом `c`. Файловая система обычно не создается на этом разделе.

source: Partition `d` used to have a special meaning associated with it, although that is now gone and `d` may work as any normal partition.
ko: 파티션 'd'는 예전에는 특별한 의미가 있었지만 지금은 사라지고 'd'가 일반 파티션처럼 동작합니다.
ru: Раздел `d` ранее имел особое значение, но сейчас это ушло в прошлое, и `d` может использоваться как обычный раздел.

source: Slices and "dangerously dedicated" physical drives contain BSD partitions, which are represented as letters from `a` to `h`. This letter is appended to the device name, so "da0__a__" is the `a` partition on the first `da` drive, which is "dangerously dedicated". "ada1s3__e__" is the fifth partition in the third slice of the second SATA disk drive.
ko: 슬라이스 및 "위험 전용" 물리 드라이브에는 `a`에서 `h`까지의 문자로 표시되는 BSD 파티션이 포함되어 있습니다. 이 문자는 장치 이름에 추가되므로 "da0__a__"는 "위험 전용"인 첫 번째 `da` 드라이브의 `a` 파티션입니다. "ada1s3__e__"는 두 번째 SATA 디스크 드라이브의 세 번째 슬라이스에 있는 다섯 번째 파티션입니다.
ru: Слайсы и «опасно выделенные» (dangerously dedicated) физические диски содержат разделы BSD, которые обозначаются буквами от `a` до `h`. Эта буква добавляется к имени устройства, поэтому «da0__a__» — это раздел `a` на первом диске `da`, который является «опасно выделенным». «ada1s3__e__» — это пятый раздел в третьем срезе второго диска SATA.

source: Finally, each disk on the system is identified. A disk name starts with a code that indicates the type of disk, and then a number, indicating which disk it is. Unlike partitions and slices, disk numbering starts at 0. Common codes are listed in crossref:basics[disks-naming,Disk Device Names].
ru: Наконец, каждый диск в системе идентифицируется. Имя диска начинается с кода, указывающего тип диска, за которым следует номер, обозначающий конкретный диск. В отличие от разделов и слайсов, нумерация дисков начинается с 0. Распространённые коды перечислены в crossref:basics[disks-naming,Имена устройств дисков].

source: When referring to a partition in a slice, include the disk name, `s`, the slice number, and then the partition letter. Examples are shown in crossref:basics[basics-disk-slice-part,Sample Disk, Slice, and Partition Names]. GPT partitions include the disk name, `p`, and then the partition number.
ru: При указании раздела в слайсе укажите имя диска, `s`, номер слайса, а затем букву раздела. Примеры приведены в разделе crossref:basics[basics-disk-slice-part,Примеры имен дисков, слайсов и разделов]. Разделы GPT включают имя диска, `p`, а затем номер раздела.

source: crossref:basics[basics-concept-disk-model,Conceptual Model of a Disk] shows a conceptual model of a disk layout using MBR slices.
ru: crossref:basics[basics-concept-disk-model,Концептуальная модель диска] показывает концептуальную модель разметки диска с использованием разделов MBR.

source: When installing FreeBSD, configure the disk slices if using MBR, and create partitions within the slice to be used for FreeBSD. If using GPT, configure partitions for each file system. In either case, create a file system or swap space in each partition, and decide where each file system will be mounted. See man:gpart[8] for information on manipulating partitions.
ko: FreeBSD를 설치할 때 MBR을 사용하는 경우 디스크 슬라이스를 구성하고 슬라이스 내에 FreeBSD에 사용할 파티션을 생성합니다. GPT를 사용하는 경우, 각 파일 시스템에 대한 파티션을 구성합니다. 두 경우 모두 각 파티션에 파일 시스템 또는 스왑 공간을 생성하고 각 파일 시스템을 마운트할 위치를 결정합니다. 파티션 조작에 대한 정보는 man:gpart[8]을 참고하세요.
ru: При установке FreeBSD настройте слайсы диска, если используется MBR, и создайте разделы внутри слайса, который будет использоваться для FreeBSD. Если используется GPT, настройте разделы для каждой файловой системы. В обоих случаях создайте файловую систему или область подкачки в каждом разделе и определите, где будет монтироваться каждая файловая система. Подробности о работе с разделами см. в man:gpart[8].

source: Disk Device Names
ko: 디스크 디바이스 이름
ru: Имена устройств дисков

source: Drive Type
ko: 드라이브 유형
ru: Тип накопителя

source: Drive Device Name
ko: 드라이브 디바이스 이름
ru: Имя устройства накопителя

source: SATA and IDE hard drives
ko: SATA 및 IDE 하드 드라이브
ru: SATA и IDE жёсткие диски

source: SCSI hard drives and USB storage devices
ko: SCSI 하드 드라이브 및 USB 저장 장치
ru: SCSI жесткие диски и USB устройства хранения данных

source: NVMe storage
ko: NVMe 스토리지
ru: Хранилище NVMe

source: `nvd` or `nda`
ko: `nvd` 또는 `nda`
ru: `nvd` или `nda`

source: SATA and IDE CD-ROM drives
ko: SATA 및 IDE CD-ROM 드라이브
ru: SATA и IDE приводы CD-ROM

source: SCSI CD-ROM drives
ko: SCSI CD-ROM 드라이브
ru: SCSI CD-ROM приводы

source: Floppy drives
ko: 플로피 드라이브
ru: Накопители на гибких дисках

source: SCSI tape drives
ko: SCSI 테이프 드라이브
ru: SCSI-ленточные накопители

source: RAID drives
ko: RAID 드라이브
ru: RAID-диски

source: Examples include `aacd` for Adaptec(R) AdvancedRAID, `mlxd` and `mlyd` for Mylex(R), `amrd` for AMI MegaRAID(R), `idad` for Compaq Smart RAID, `twed` for 3ware(R) RAID.
ko: 예를 들어, Adaptec(R) AdvancedRAID의 경우 `aacd`, Mylex(R)의 경우 `mlxd` 와 `mlyd`, AMI MegaRAID(R)의 경우 `amrd`, Compaq Smart RAID의 경우 `idad`, 3ware(R) RAID의 경우 `twed`가 있습니다.
ru: Примеры включают `aacd` для Adaptec(R) AdvancedRAID, `mlxd` и `mlyd` для Mylex(R), `amrd` для AMI MegaRAID(R), `idad` для Compaq Smart RAID, `twed` для 3ware(R) RAID.

source: Sample Disk, Slice, and Partition Names
ko: 디스크, 슬라이스 및 파티션 이름의 예시
ru: Примеры названий дисков, слайсов и разделов

source: Name
ko: 이름
ru: Имя

source: Meaning
ko: 뜻
ru: Значение

source: The first partition (`a`) on the first slice (`s1`) on the first SATA disk (`ada0`).
ko: 첫 번째 SATA 디스크(`ada0`)의 첫 번째 슬라이스(`s1`)에 있는 첫 번째 파티션(`a`).
ru: Первый раздел (`a`) на первом слайсе (`s1`) на первом SATA-диске (`ada0`).

source: The fifth partition (`e`) on the second slice (`s2`) on the second SCSI disk (`da1`).
ko: 두 번째 SCSI 디스크(`da1`)의 두 번째 슬라이스(`s2`)에 있는 다섯 번째 파티션(`e`).
ru: Пятый раздел (`e`) на втором срезе (`s2`) второго SCSI-диска (`da1`).

source: Conceptual Model of a Disk
ko: 디스크의 개념적 모델
ru: Концептуальная модель диска
