Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: Every user account on a FreeBSD system has certain information associated with it:
ko: FreeBSD의 모든 사용자 계정은 다음의 정보를 가지고 있습니다:
ru: Каждая учетная запись пользователя в системе FreeBSD имеет определенную связанную с ней информацию:

source: User name
ko: 사용자 이름(User name)
ru: Имя пользователя

source: The user name is typed at the `login:` prompt. Each user must have a unique user name. There are a number of rules for creating valid user names which are documented in man:passwd[5]. It is recommended to use user names that consist of eight or fewer, all lower case characters in order to maintain backwards compatibility with applications.
ko: 사용자 이름은 `login:` 프롬프트에 입력합니다. 각 사용자는 고유한 사용자 이름을 가져야 합니다. 유효한 사용자 이름을 만들기 위한 여러 가지 규칙이 있으며, 이 규칙은 man:passwd[5]에 문서화되어 있습니다. 애플리케이션과의 이전 버전과의 호환성을 유지하려면 모두 소문자로 구성된 8자 이하의 사용자 이름을 사용하는 것이 좋습니다.
ru: Имя пользователя вводится в приглашении `login:`. У каждого пользователя должно быть уникальное имя. Существует ряд правил для создания допустимых имен пользователей, которые описаны в man:passwd[5]. Рекомендуется использовать имена, состоящие из восьми или менее строчных символов, для обеспечения обратной совместимости с приложениями.

source: Password
ru: Пароль

source: Each account has an associated password.
ko: 각 계정은 암호를 가져야 합니다.
ru: У каждой учетной записи есть связанный с ней пароль.

source: User ID (UID)
ru: Идентификатор пользователя (UID)

source: The User ID (UID) is a number used to uniquely identify the user to the FreeBSD system. Commands that allow a user name to be specified will first convert it to the UID. It is recommended to use a UID less than 65535, since higher values may cause compatibility issues with some software.
ko: 사용자 ID(User ID, UID)는 FreeBSD 시스템에서 사용자를 고유하게 식별하는 데 사용되는 숫자입니다. 사용자 이름을 설정하는 명령은 가장먼저 사용자 이름을 UID로 변환합니다. UID의 값이 크면 일부 소프트웨어와 호환성 문제가 발생할 수 있으므로 65535 미만의 UID를 사용하는 것이 좋습니다.
ru: Идентификатор пользователя (UID) — это число, используемое для однозначной идентификации пользователя в системе FreeBSD. Команды, которые позволяют указать имя пользователя, сначала преобразуют его в UID. Рекомендуется использовать UID меньше 65535, так как более высокие значения могут вызвать проблемы совместимости с некоторым программным обеспечением.

source: Group ID (GID)
ru: Идентификатор группы (GID)

source: The Group ID (GID) is a number used to uniquely identify the primary group that the user belongs to. Groups are a mechanism for controlling access to resources based on a user's GID rather than their UID. This can significantly reduce the size of some configuration files and allows users to be members of more than one group. It is recommended to use a GID of 65535 or lower as higher GIDs may break some software.
ko: 그룹 ID(Group ID, GID)는 사용자가 속한 기본 그룹을 식별하는 데 사용되는 고유번호입니다. 그룹은 사용자의 UID가 아닌 GID를 기반으로 리소스에 대한 액세스를 제어하기 위한 메커니즘입니다. 이를 통해 일부 구성 파일의 크기를 크게 줄일 수 있으며, 사용자는 둘 이상의 그룹 멤버가 될 수 있습니다. GID역시 그 값이 너무 크면 일부 소프트웨어에서 문제가 발생할 수 있으므로 65535 이하의 GID를 사용하는 것이 좋습니다.
ru: Идентификатор группы (GID) — это число, используемое для однозначной идентификации основной группы, к которой принадлежит пользователь. Группы представляют собой механизм управления доступом к ресурсам на основе GID пользователя, а не его UID. Это может значительно уменьшить размер некоторых конфигурационных файлов и позволяет пользователям быть членами более чем одной группы. Рекомендуется использовать GID 65535 или меньше, так как более высокие GID могут привести к неработоспособности некоторых программ.

source: Login class
ru: Класс входа (Login class)

source: Login classes are an extension to the group mechanism that provide additional flexibility when tailoring the system to different users. Login classes are discussed further in crossref:security[users-limiting,Configuring Login Classes].
ko: 로그인 클래스(Login class)는 그룹 메커니즘의 확장으로, 다양한 사용자에 맞게 시스템을 조정할 때 추가적인 유연성을 제공합니다. 로그인 클래스에 대한 자세한 내용은 crossref:security[사용자-제한,로그인 클래스 구성]에서 확인할 수 있습니다.
ru: Классы входа являются расширением механизма групп, предоставляющим дополнительную гибкость при настройке системы для различных пользователей. Подробнее классы входа рассматриваются в crossref:security[users-limiting,Настройка классов входа].

source: Password change time
ko: 패스워드 변경 시기(Password change time)
ru: Время изменения пароля

source: By default, passwords do not expire. However, password expiration can be enabled on a per-user basis, forcing some or all users to change their passwords after a certain amount of time has elapsed.
ko: 기본적으로 비밀번호는 만료시기가 없습니다. 그러나 사용자별 비밀번호 만료시기를 설정하면 일정 시간이 경과했을 때, 일부 또는 모든 사용자가 비밀번호를 변경하도록 할 수 있습니다.
ru: По умолчанию пароли не имеют срока действия. Однако можно включить истечение срока действия пароля для отдельных пользователей, что заставит некоторых или всех пользователей изменить свои пароли по истечении определённого времени.

source: Account expiration time
ko: 계정 만료 시기(Account expiration time)
ru: Время истечения срока действия учетной записи

source: By default, FreeBSD does not expire accounts. When creating accounts that need a limited lifespan, such as student accounts in a school, specify the account expiry date using man:pw[8]. After the expiry time has elapsed, the account cannot be used to log in to the system, although the account's directories and files will remain.
ko: 기본적으로 FreeBSD는 계정의 만료시기가 없습니다. 하지만 학교의 학생 계정과 같이 수명을 제한해야 하는 계정을 만들 때는 man:pw[8]을 사용하여 계정 만료 시기를 지정할 수 있습니다. 만료 시기가 지나면 계정의 디렉터리와 파일은 남아있지만 시스템에 로그인하거나 계정을 사용할 수 없습니다.
ru: По умолчанию FreeBSD не ограничивает срок действия учётных записей. При создании учётных записей с ограниченным сроком действия, например, для учащихся в школе, укажите дату истечения срока с помощью man:pw[8]. После истечения указанного времени учётная запись не может быть использована для входа в систему, хотя каталоги и файлы этой учётной записи останутся.

source: User's full name
ko: 사용자 성명(User's full name)
ru: Полное имя пользователя

source: The user name uniquely identifies the account to FreeBSD, but does not necessarily reflect the user's real name. Similar to a comment, this information can contain spaces, uppercase characters, and be more than 8 characters long.
ko: FreeBSD의 사용자 이름(user name)은 사용자를 식별하는데 사용되지만, 사용자의 실명을 의미하지는 않습니다. 이 정보는 추가정보와 마찬가지로 공백과 대문자를 포함할 수 있으며 8자 이상이어야 합니다.
ru: Имя пользователя уникально идентифицирует учетную запись в FreeBSD, но не обязательно отражает реальное имя пользователя. Как и в случае с комментарием, эта информация может содержать пробелы, заглавные буквы и быть длиннее 8 символов.

source: Home directory
ko: 홈 디렉터리
ru: Домашний каталог

source: The home directory is the full path to a directory on the system. This is the user's starting directory when the user logs in. A common convention is to put all user home directories under `/home/username` or `/usr/home/username`. Each user stores their personal files and subdirectories in their own home directory.
ko: 홈 디렉터리는 시스템에서 디렉터리의 전체 경로입니다. 이것은 로그인을 했을때 사용자가 접근하는 시작 디렉터리입니다. 일반적인 규칙은 모든 사용자 홈 디렉터리를 `/home/username` 또는 `/usr/home/username` 아래에 배치하는 것입니다. 각 사용자는 자신의 홈 디렉터리에 개인 파일과 하위 디렉터리를 저장합니다.
ru: Домашний каталог — это полный путь к каталогу в системе. Это стартовый каталог пользователя при входе в систему. Общепринятое соглашение — размещать все домашние каталоги пользователей в `/home/имя_пользователя` или `/usr/home/имя_пользователя`. Каждый пользователь хранит свои личные файлы и подкаталоги в собственном домашнем каталоге.

source: User shell
ko: 사용자 쉘(User shell)
ru: Оболочка пользователя

source: The shell provides the user's default environment for interacting with the system. There are many different kinds of shells and experienced users will have their own preferences, which can be reflected in their account settings.
ko: 쉘은 시스템과 상호 작용하기 위한 사용자의 기본 환경을 제공합니다. 쉘에는 다양한 종류가 있으며 숙련된 사용자는 계정 설정에 반영할 수 있는 자신만의 기본 설정을 할 수 있습니다.
ru: Оболочка предоставляет пользователю среду по умолчанию для взаимодействия с системой. Существует множество различных видов оболочек, и опытные пользователи могут выбрать предпочтительную, настроив её в параметрах своей учётной записи.

source: The Superuser Account
ko: 수퍼유저 계정(Superuser Account)
ru: Учетная запись суперпользователя

source: The superuser account, usually called `root`, is used to manage the system with no limitations on privileges. For this reason, it should not be used for day-to-day tasks like sending and receiving mail, general exploration of the system, or programming.
ko: 일반적으로 `root`로 알려진 수퍼유저 계정은 권한에 제한 없이 시스템을 관리하는 데 사용됩니다. 따라서 메일 송수신, 시스템의 일반적인 탐색 또는 프로그래밍과 같은 일상적인 작업에는 사용해서는 안 됩니다.
ru: Учетная запись суперпользователя, обычно называемая `root`, используется для управления системой без ограничений в правах. По этой причине её не следует использовать для повседневных задач, таких как отправка и получение почты, обычное изучение системы или программирование.

source: The superuser, unlike other user accounts, can operate without limits, and misuse of the superuser account may result in spectacular disasters. User accounts are unable to destroy the operating system by mistake, so it is recommended to login as a user account and to only become the superuser when a command requires extra privilege.
ko: 다른 사용자 계정과 달리 수퍼유저는 어떤 제한도 없으며, 수퍼유저 계정을 오용하면 큰 재앙을 초래할 수 있습니다. 사용자 계정은 실수로라도 운영 체제를 파괴할 수 없으므로 평상시에는 사용자 계정으로 로그인하고 추가 권한이 필요한 명령에 대해서만 수퍼유저를 사용하는 것을 권장합니다.
ru: Суперпользователь, в отличие от других учётных записей, может работать без ограничений, и неправильное использование учётной записи суперпользователя может привести к серьёзным последствиям. Обычные пользователи не могут случайно разрушить операционную систему, поэтому рекомендуется входить в систему под обычной учётной записью и становиться суперпользователем только тогда, когда команде требуются дополнительные привилегии.

source: Always double and triple-check any commands issued as the superuser, since an extra space or missing character can mean irreparable data loss.
ko: 단순한 공백이나 문자의 누락으로도 복구할 수 없는 데이터 손실이 발생할 수 있으므로 수퍼유저로서 실행하는 모든 명령은 항상 두 번, 세 번 확인합니다.
ru: Всегда дважды и трижды проверяйте команды, выполняемые от имени суперпользователя, поскольку лишний пробел или пропущенный символ могут привести к невосполнимой потере данных.

source: There are several ways to gain superuser privilege. While one can log in as `root`, this is highly discouraged.
ko: 수퍼유저 권한을 얻는 방법에는 여러 가지가 있습니다. `root`로 로그인할 수도 있지만 좋은 방법은 아닙니다.
ru: Существует несколько способов получения привилегий суперпользователя. Хотя можно войти в систему как `root`, это крайне не рекомендуется.

source: Instead, use man:su[1] to become the superuser. If `-` is specified when running this command, the user will also inherit the root user's environment. The user running this command must be in the `wheel` group or else the command will fail. The user must also know the password for the `root` user account.
ko: 대신 man:su[1]을 사용하여 수퍼유저가 될 수 있습니다. 이 명령을 실행할 때 `-`를 지정하면 해당 사용자는 루트 사용자의 환경도 상속받습니다. 이 명령을 실행하는 사용자는 `wheel` 그룹에 속해야 하며 그렇지 않으면 명령이 실패합니다. 또한 사용자는 `root` 사용자 계정의 비밀번호를 알고 있어야 합니다.
ru: Вместо этого используйте man:su[1], чтобы стать суперпользователем. Если при выполнении этой команды указан параметр `-`, пользователь также унаследует окружение пользователя root. Пользователь, выполняющий эту команду, должен состоять в группе `wheel`, иначе команда завершится ошибкой. Пользователь также должен знать пароль учётной записи `root`.

source: In this example, the user only becomes superuser in order to run `make install` as this step requires superuser privilege. Once the command completes, the user types `exit` to leave the superuser account and return to the privilege of their user account.
ko: 이 예에서는 `make install`을 실행하기 위해 수퍼유저 권한이 필요하므로 사용자는 이 명령을 실행할 때만 수퍼유저가 됩니다. 명령이 완료되면 사용자는 `exit`를 입력하여 수퍼유저 계정을 종료하고 사용자 계정의 권한으로 돌아갑니다.
ru: В этом примере пользователь становится суперпользователем только для выполнения команды `make install`, так как этот шаг требует прав суперпользователя. После завершения команды пользователь вводит `exit`, чтобы выйти из учётной записи суперпользователя и вернуться к правам своей учётной записи.

source: Install a Program As the Superuser
ko: 수퍼유저로 프로그램 설치하기
ru: Установка программы от имени суперпользователя

source: The built-in man:su[1] framework works well for single systems or small networks with just one system administrator. An alternative is to install the package:security/sudo[] package or port. This software provides activity logging and allows the administrator to configure which users can run which commands as the superuser.
ko: 기본 제공되는 man:su[1] 프레임워크는 시스템 관리자가 한 명뿐인 단일 시스템 또는 소규모 네트워크에 적합합니다. 다른 방법으로는 package:security/sudo[] 패키지 또는 포트(port)를 설치하는 것입니다. 이 소프트웨어는 활동 로그(Activity log)를 제공하고 관리자가 수퍼유저로서 어떤 사용자가 어떤 명령을 실행할 수 있는지 구성할 수 있습니다.
ru: Встроенная система man:su[1] хорошо подходит для отдельных компьютеров или небольших сетей с одним системным администратором. Альтернативой является установка пакета package:security/sudo[] или порта. Это программное обеспечение обеспечивает журналирование действий и позволяет администратору настроить, какие пользователи могут выполнять определённые команды с правами суперпользователя.

source: Managing Accounts
ko: 계정 관리
ru: Управление учетными записями

source: FreeBSD provides a variety of different commands to manage user accounts. The most common commands are summarized in crossref:basics[users-modifying-utilities,Utilities for Managing User Accounts], followed by some examples of their usage. See the manual page for each utility for more details and usage examples.
ru: FreeBSD предоставляет различные команды для управления учетными записями пользователей. Наиболее распространенные команды перечислены в crossref:basics[users-modifying-utilities,Утилиты для управления учетными записями пользователей], а также приведены примеры их использования. Для получения дополнительной информации и примеров использования обратитесь к руководству (man) каждой утилиты.

source: Utilities for Managing User Accounts
ko: 사용자 계정 관리를 위한 유틸리티
ru: Утилиты для управления учетными записями пользователей

source: Command
ko: 명령어
ru: Команда

source: Summary
ko: 요약
ru: Краткое содержание

source: The recommended command-line application for adding new users.
ko: 새 사용자를 추가하는 데 권장되는 CLI 애플리케이션.
ru: Рекомендуемое приложение командной строки для добавления новых пользователей.

source: The recommended command-line application for removing users.
ko: 사용자 제거에 사용되는 CLI 애플리케이션.
ru: Рекомендуемое приложение командной строки для удаления пользователей.

source: A flexible tool for changing user database information.
ko: 사용자 데이터베이스 정보를 변경할 수 있는 유연한 도구.
ru: Гибкий инструмент для изменения информации в пользовательской базе данных.

source: The command-line tool to change user passwords.
ko: 사용자 비밀번호를 변경하는 CLI 도구.
ru: Инструмент командной строки для изменения паролей пользователей.

source: A powerful and flexible tool for modifying all aspects of user accounts.
ko: 사용자 계정의 모든 부분을 수정할 수 있는 강력하고 유연한 도구.
ru: Мощный и гибкий инструмент для изменения всех аспектов пользовательских учетных записей.

source: A system configuration utility with account management support.
ko: 계정 관리가 지원되는 시스템 구성 유틸리티.
ru: Утилита для настройки системы с поддержкой управления учётными записями.

source: Adding a user
ko: 사용자 추가하기
ru: Добавление пользователя

source: The recommended program for adding new users is man:adduser[8]. When a new user is added, this program automatically updates `/etc/passwd` and `/etc/group`. It also creates a home directory for the new user, copies in the default configuration files from `/usr/share/skel`, and can optionally mail the new user a welcome message. This utility must be run as the superuser.
ko: 새 사용자를 추가하는 데 권장되는 프로그램은 man:adduser[8]입니다. 새 사용자가 추가되면 이 프로그램은 자동으로 `/etc/passwd`와 `/etc/group`을 업데이트합니다. 또한 새 사용자를 위한 홈 디렉터리를 생성하고, `/usr/share/skel`의 기본 구성 파일을 복사하며, 경우에 따라 새 사용자에게 환영 메시지를 메일로 보낼 수 있습니다. 이 유틸리티는 수퍼유저로 실행해야 합니다.
ru: Рекомендуемая программа для добавления новых пользователей — man:adduser[8]. При добавлении нового пользователя эта программа автоматически обновляет `/etc/passwd` и `/etc/group`. Она также создаёт домашний каталог для нового пользователя, копирует в него стандартные конфигурационные файлы из `/usr/share/skel` и может отправить новому пользователю приветственное письмо. Эту утилиту необходимо запускать от имени суперпользователя.

source: The man:adduser[8] utility is interactive and walks through the steps for creating a new user account. As seen in crossref:basics[users-modifying-adduser, Adding a User on FreeBSD], either input the required information or press kbd:[Return] to accept the default value shown in square brackets. In this example, the user has been invited into the `wheel` group, allowing them to become the superuser with man:su[1]. When finished, the utility will prompt to either create another user or to exit.
ru: Утилита man:adduser[8] интерактивна и проводит пользователя через шаги создания новой учётной записи. Как показано в crossref:basics[users-modifying-adduser, Добавление пользователя в FreeBSD], можно ввести необходимую информацию или нажать kbd:[Enter], чтобы принять значение по умолчанию, указанное в квадратных скобках. В этом примере пользователь был добавлен в группу `wheel`, что позволяет ему стать суперпользователем с помощью man:su[1]. По завершении утилита предложит создать ещё одного пользователя или выйти.

source: Adding a User on FreeBSD
ko: FreeBSD에서 사용자 추가하기
ru: Добавление пользователя в FreeBSD

source: The output should be similar to the following:
ru: Вывод должен быть похож на следующий:

source: Since the password is not echoed when typed, be careful to not mistype the password when creating the user account.
ko: 비밀번호를 입력할 때는 화면에 아무것도 출력되지 않으므로, 사용자 계정을 만들 때 비밀번호를 잘못 입력하지 않도록 주의해야 합니다.
ru: Поскольку пароль не отображается при вводе, будьте внимательны, чтобы не ошибиться при создании учетной записи пользователя.

source: Removing a user
ko: 사용자 삭제하기
ru: Удаление пользователя

source: To completely remove a user from the system, run man:rmuser[8] as the superuser. This command performs the following steps:
ko: 시스템에서 사용자를 완전히 삭제하려면 수퍼유저로 man:rmuser[8]를 실행합니다. 이 명령은 다음 단계를 수행합니다:
ru: Чтобы полностью удалить пользователя из системы, выполните команду man:rmuser[8] с правами суперпользователя. Эта команда выполняет следующие действия:

source: Removes the user's man:crontab[1] entry, if one exists.
ko: 사용자의 man:crontab[1] 항목이 있는 경우 해당 항목을 제거합니다.
ru: Удаляет запись пользователя в man:crontab[1], если она существует.

source: Removes any man:at[1] jobs belonging to the user.
ko: 사용자에 속한 모든 man:at[1] 작업을 제거합니다.
ru: Удаляет все задания man:at[1], принадлежащие пользователю.

source: Sends a SIGKILL signal to all processes owned by the user.
ko: 사용자가 소유한 모든 프로세스에 SIGKILL 신호를 보냅니다.
ru: Посылает сигнал SIGKILL всем процессам, принадлежащим пользователю.

source: Removes the user from the system's local password file.
ko: 시스템의 로컬 비밀번호 파일에서 사용자를 삭제합니다.
ru: Удаляет пользователя из локального файла паролей системы.

source: Removes the user's home directory (if it is owned by the user), including handling of symbolic links in the path to the actual home directory.
ko: 실제 홈 디렉터리 경로를 나타내는 심볼릭 링크 뿐만 아니라 사용자의 홈 디렉터리(사용자가 소유하고 있는 경우)를 삭제합니다.
ru: Удаляет домашний каталог пользователя (если он принадлежит пользователю), включая обработку символических ссылок в пути к фактическому домашнему каталогу.

source: Removes the incoming mail files belonging to the user from `/var/mail`.
ko: `/var/mail`에서 사용자 소유의 받은 메일 파일을 제거합니다.
ru: Удаляет входящие почтовые файлы пользователя из `/var/mail`.

source: Removes all files owned by the user from `/tmp`, `/var/tmp`, and `/var/tmp/vi.recover`.
ko: 사용자가 소유하고 있는 `tmp`, `/var/tmp` 및 `/var/tmp/vi.recover`의 모든 파일을 삭제합니다.
ru: Удаляет все файлы, принадлежащие пользователю, из `/tmp`, `/var/tmp` и `/var/tmp/vi.recover`.

source: Removes the username from all groups to which it belongs in `/etc/group`. (If a group becomes empty and the group name is the same as the username, the group is removed; this complements man:adduser[8]'s per-user unique groups.)
ko: `/etc/group`에 있는 모든 그룹에서 사용자 이름을 삭제합니다. (만약 이 과정으로 그룹이 비게 되거나 그룹의 이름이 사용자 이름과 같으면 그룹 자체가 삭제되며, 이는 man:adduser[8]로 고유 그룹을 가진 단일 사용자 문제를 보완합니다.)
ru: Удаляет имя пользователя из всех групп, к которым он принадлежит в `/etc/group`. (Если группа становится пустой и имя группы совпадает с именем пользователя, группа удаляется; это дополняет функциональность man:adduser[8] в части уникальных групп для каждого пользователя.)

source: Removes all message queues, shared memory segments and semaphores owned by the user.
ko: 사용자가 소유한 모든 메시지 큐(message queue), 공유 메모리 세그먼트 및 세마포어(semaphore)를 제거합니다.
ru: Удаляет все очереди сообщений, сегменты разделяемой памяти и семафоры, принадлежащие пользователю.

source: man:rmuser[8] cannot be used to remove superuser accounts since that is almost always an indication of massive destruction.
ko: man:rmuser[8]를 사용하여 수퍼유저 계정을 제거할 수는 없는데, 이것은 거의 항상 대규모 파괴를 의미하기 때문입니다.
ru: man:rmuser[8] не может быть использован для удаления учетных записей суперпользователя, так как это почти всегда свидетельствует о катастрофических последствиях.

source: By default, an interactive mode is used, as shown in the following example.
ko: 기본적으로 다음 예시와 같이 대화형 모드가 사용됩니다.
ru: По умолчанию используется интерактивный режим, как показано в следующем примере.

source: `rmuser` Interactive Account Removal
ko: `rmuser`대화형 계정삭제
ru: `rmuser` Интерактивное удаление учетной записи

source: Change user information
ko: 사용자 정보 변경하기
ru: Изменить информацию о пользователе

source: Any user can use man:chpass[1] to change their default shell and personal information associated with their user account. The superuser can use this utility to change additional account information for any user.
ko: 모든 사용자는 man:chpass[1]를 사용하여 기본 셸과 사용자 계정과 관련된 개인 정보를 변경할 수 있습니다. 수퍼유저는 이 유틸리티를 사용하여 모든 사용자의 추가 계정 정보를 변경할 수 있습니다.
ru: Любой пользователь может использовать man:chpass[1] для изменения своей оболочки по умолчанию и персональной информации, связанной с его учётной записью. Суперпользователь может использовать эту утилиту для изменения дополнительных параметров учётной записи любого пользователя.

source: When passed no options, aside from an optional username, man:chpass[1] displays an editor containing user information. When the user exits from the editor, the user database is updated with the new information.
ko: 사용자 이름(username) 외에 다른 옵션을 전달하지 않으면 man:chpass[1]는 사용자 정보가 포함된 편집기를 표시합니다. 사용자가 편집기를 종료하면 사용자 데이터베이스가 새 정보로 업데이트됩니다.
ru: Без указания опций, за исключением необязательного имени пользователя, man:chpass[1] отображает редактор с информацией о пользователе. После выхода пользователя из редактора база данных пользователей обновляется новой информацией.

source: This utility will prompt for the user's password when exiting the editor, unless the utility is run as the superuser.
ko: 이 유틸리티는 수퍼유저로 실행하지 않는 한 편집기를 종료할 때 사용자의 비밀번호를 묻는 메시지가 나타납니다.
ru: Этотa утилитa запрашивает пароль пользователя при выходе из редактора, если только она не запущена от имени суперпользователя.
