Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: In crossref:basics[users-modifying-chpass-su,Using `chpass` as Superuser], the superuser has typed `chpass jru` and is now viewing the fields that can be changed for this user. If `jru` runs this command instead, only the last six fields will be displayed and available for editing. This is shown in crossref:basics[users-modifying-chpass-ru,Using `chpass` as Regular User].
ru: В crossref:basics[users-modifying-chpass-su,Использование `chpass` суперпользователем], суперпользователь ввел `chpass jru` и теперь видит поля, которые можно изменить для этого пользователя. Если же команду выполнит сам `jru`, будут отображены и доступны для редактирования только последние шесть полей. Это показано в crossref:basics[users-modifying-chpass-ru,Использование `chpass` обычным пользователем].

source: Using `chpass` as Superuser
ko: 수퍼유저로 `chpass` 사용
ru: Использование `chpass` с правами суперпользователя

source: Using `chpass` as Regular User
ko: 일반 사용자로 `chpass` 사용
ru: Использование `chpass` обычным пользователем

source: The commands man:chfn[1] and man:chsh[1] are links to man:chpass[1], as are man:ypchpass[1], man:ypchfn[1], and man:ypchsh[1]. Since NIS support is automatic, specifying the `yp` before the command is not necessary. How to configure NIS is covered in crossref:network-servers[network-servers,Network Servers].
ko: Man:chfn[1] 및 man:chsh[1] 명령은 man:ypchpass[1], man:ypchfn[1] 및 man:ypchsh[1]와 마찬가지로 man:chpass[1]에 대한 링크입니다. NIS 지원은 자동으로 이루어지므로 명령 앞에 `yp`를 지정할 필요가 없습니다. NIS를 구성하는 방법은 crossref:network-servers[network-servers,Network Servers]에 설명되어 있습니다.
ru: Команды man:chfn[1] и man:chsh[1] являются ссылками на man:chpass[1], как и man:ypchpass[1], man:ypchfn[1] и man:ypchsh[1]. Поскольку поддержка NIS автоматическая, указывать `yp` перед командой не требуется. Настройка NIS описана в crossref:network-servers[network-servers,Сетевые серверы].

source: Change user password
ko: 사용자 비밀번호 변경
ru: Изменение пароля пользователя

source: Any user can easily change their password using man:passwd[1]. To prevent accidental or unauthorized changes, this command will prompt for the user's original password before a new password can be set:
ko: 모든 사용자는 man:passwd[1]를 사용하여 쉽게 비밀번호를 변경할 수 있습니다. 실수나 무단 변경을 방지하기 위해 이 명령은 새 비밀번호를 설정하기 전에 사용자의 기존 비밀번호를 묻는 메시지를 표시합니다:
ru: Любой пользователь может легко изменить свой пароль с помощью man:passwd[1]. Для предотвращения случайных или несанкционированных изменений эта команда запросит исходный пароль пользователя перед установкой нового пароля:

source: Changing Your Password
ko: 비밀번호 변경하기
ru: Смена собственного пароля

source: The superuser can change any user's password by specifying the username when running man:passwd[1]. When this utility is run as the superuser, it will not prompt for the user's current password. This allows the password to be changed when a user cannot remember the original password.
ko: 수퍼유저는 man:passwd[1]를 실행할 때 사용자 아이디를 지정하여 모든 사용자의 비밀번호를 변경할 수 있습니다. 이 유틸리티가 수퍼유저로 실행되면 사용자의 현재 비밀번호를 묻는 메시지가 표시되지 않습니다. 따라서 사용자가 원래 비밀번호를 기억하지 못할 때 비밀번호를 변경할 수 있습니다.
ru: Суперпользователь может изменить пароль любого пользователя, указав имя пользователя при запуске man:passwd[1]. При запуске этой утилиты с правами суперпользователя она не запрашивает текущий пароль пользователя. Это позволяет изменить пароль, если пользователь не может вспомнить исходный пароль.

source: Changing Another User's Password as the Superuser
ko: 수퍼유저로 다른 사용자의 비밀번호 변경하기
ru: Изменение пароля другого пользователя суперпользователем

source: As with man:chpass[1], man:yppasswd[1] is a link to man:passwd[1], so NIS works with either command.
ko: Man:chpass[1]과 마찬가지로 man:yppasswd[1]는 man:passwd[1]에 대한 링크이므로 NIS는 두 명령 모두에서 작동합니다.
ru: Как и man:chpass[1], man:yppasswd[1] является ссылкой на man:passwd[1], поэтому NIS работает с любой из этих команд.

source: Create, remove, modify and display system users and groups
ko: 시스템 사용자 및 그룹의 생성, 삭제, 수정 및 표시
ru: Создание, удаление, изменение и отображение пользователей и групп системы

source: The man:pw[8] utility can create, remove, modify, and display users and groups. It functions as a front end to the system user and group files. man:pw[8] has a very powerful set of command line options that make it suitable for use in shell scripts, but new users may find it more complicated than the other commands presented in this section.
ko: Man:pw[8] 유틸리티는 사용자와 그룹을 생성, 삭제, 수정 및 표시할 수 있습니다. 이 유틸리티는 시스템 사용자 및 그룹 파일에 대한 프런트 엔드 역할을 합니다. man:pw[8]에는 셸 스크립트에서 사용하기에 적합한 매우 강력한 명령줄 옵션이 있지만 신규 사용자는 이 섹션에 제시된 다른 명령보다 더 복잡하다고 느낄 수 있습니다.
ru: Утилита man:pw[8] может создавать, удалять, изменять и отображать пользователей и группы. Она работает как интерфейс к системным файлам пользователей и групп. man:pw[8] обладает мощным набором параметров командной строки, что делает её пригодной для использования в shell-скриптах, но новым пользователям она может показаться сложнее других команд, представленных в этом разделе.

source: Managing Groups
ko: 그룹 관리하기
ru: Управление группами

source: A group is a list of users. A group is identified by its group name and GID. In FreeBSD, the kernel uses the UID of a process, and the list of groups it belongs to, to determine what the process is allowed to do. Most of the time, the GID of a user or process usually means the first group in the list.
ko: 그룹은 사용자의 목록입니다. 그룹은 그룹 이름과 GID로 식별됩니다. FreeBSD에서 커널은 프로세스의 UID와 프로세스가 속한 그룹 목록을 사용하여 프로세스가 수행할 수 있는 작업을 결정합니다. 대부분의 경우, 사용자나 프로세스의 GID는 일반적으로 목록에서 나열된 첫 번째 그룹을 의미합니다.
ru: Группа — это список пользователей. Группа идентифицируется по своему названию и GID. В FreeBSD ядро использует UID процесса и список групп, к которым он принадлежит, чтобы определить, что процесс может делать. В большинстве случаев под GID пользователя или процесса обычно подразумевается первая группа в списке.

source: The group name to GID mapping is listed in `/etc/group`. This is a plain text file with four colon-delimited fields. The first field is the group name, the second is the encrypted password, the third the GID, and the fourth the comma-delimited list of members. For a complete description of the syntax, refer to man:group[5].
ru: Соответствие имен групп и GID перечислено в `/etc/group`. Это простой текстовый файл с четырьмя полями, разделенными двоеточиями. Первое поле — имя группы, второе — зашифрованный пароль, третье — GID, а четвертое — список участников, разделенных запятыми. Полное описание синтаксиса смотрите в man:group[5].

source: The superuser can modify `/etc/group` using a text editor, although editing the group file using man:vigr[8] is preferred because it can catch some common mistakes. Alternatively, man:pw[8] can be used to add and edit groups. For example, to add a group called `teamtwo` and then confirm that it exists:
ko: 수퍼유저는 텍스트 편집기를 사용하여 `/etc/group`을 수정할 수 있지만, 일반적인 실수를 체크할 수 있으므로 man:vigr[8]을 사용하여 그룹 파일을 편집하는 것이 좋습니다. 다른 방법으로는 man:pw[8]를 사용하여 그룹을 추가하고 편집할 수 있습니다. 예를 들어, `teamtwo`라는 그룹을 추가한 다음 그룹이 있는지 확인합니다:
ru: Суперпользователь может изменить `/etc/group` с помощью текстового редактора, однако предпочтительнее редактировать файл групп с помощью man:vigr[8], так как это позволяет избежать некоторых распространённых ошибок. Альтернативно, для добавления и редактирования групп можно использовать man:pw[8]. Например, чтобы добавить группу с именем `teamtwo` и затем убедиться, что она существует:

source: Care must be taken when using the operator group, as unintended superuser-like access privileges may be granted, including but not limited to shutdown, reboot, and access to all items in `/dev` in the group.
ko: Operator 그룹을 사용할 때는 의도하지 않은 수퍼유저 수준의 접근 권한이 부여될 수 있으므로 주의해야 하며, 여기에는 종료, 재부팅, 그룹내 `/dev`에 있는 모든 항목에 대한 접근 권한이 포함될 수 있습니다.
ru: При использовании группы operator необходимо соблюдать осторожность, так как могут быть предоставлены непредусмотренные привилегии, аналогичные правам суперпользователя, включая, но не ограничиваясь, возможностью выключения системы, перезагрузки и доступа ко всем элементам в `/dev` в рамках группы.

source: Adding a Group Using man:pw[8]
ko: Man:pw[8]을 사용하여 그룹 추가하기
ru: Добавление группы с помощью man:pw[8]

source: In this example, `1100` is the GID of `teamtwo`. Right now, `teamtwo` has no members. This command will add `jru` as a member of `teamtwo`.
ko: 이 예에서 `1100`은 `teamtwo`의 GID입니다. 현재 `teamtwo`에는 멤버가 없습니다. 이 명령은 `jru`를 `teamtwo`의 멤버로 추가합니다.
ru: В этом примере `1100` — это GID группы `teamtwo`. На данный момент в `teamtwo` нет участников. Эта команда добавит `jru` в качестве участника `teamtwo`.

source: Adding User Accounts to a New Group Using man:pw[8]
ko: Man:pw[8]을 사용하여 새 그룹에 사용자 계정 추가하기
ru: Добавление пользовательских учетных записей в новую группу с помощью man:pw[8]

source: The argument to `-M` is a comma-delimited list of users to be added to a new (empty) group or to replace the members of an existing group. To the user, this group membership is different from (and in addition to) the user's primary group listed in the password file. This means that the user will not show up as a member when using `groupshow` with man:pw[8], but will show up when the information is queried via man:id[1] or a similar tool. When man:pw[8] is used to add a user to a group, it only manipulates `/etc/group` and does not attempt to read additional data from `/etc/passwd`.
ko: `-M` 인수는 새로운(비어 있는) 그룹에 사용자를 추가하거나 추가하거나 기존 그룹의 구성원을 바꿀때 쉼표로 구분된 사용자 목록과 함께 사용합니다. 사용자에게 이 그룹 멤버십은 비밀번호 파일에 기록된 사용자의 기본 그룹과 다릅니다. 즉, man:pw[8]과 함께 `groupshow`를 사용할 때는 사용자가 멤버로 표시되지 않지만, man:id[1] 또는 유사한 도구를 통해 정보를 쿼리할 때는 표시됩니다. Man:pw[8]는 그룹에 사용자를 추가할 때, `/etc/group`만 조작하고 `/etc/passwd`에서 추가 데이터를 읽으려고 시도하지 않습니다.
ru: Аргумент `-M` представляет собой разделённый запятыми список пользователей, которые будут добавлены в новую (пустую) группу или заменят членов существующей группы. Для пользователя это членство в группе отличается от (и дополняет) его основной группы, указанной в файле паролей. Это означает, что пользователь не будет отображаться как член группы при использовании `groupshow` с man:pw[8], но будет виден при запросе информации через man:id[1] или аналогичный инструмент. Когда man:pw[8] используется для добавления пользователя в группу, он только изменяет `/etc/group` и не пытается читать дополнительные данные из `/etc/passwd`.

source: Adding a New Member to a Group Using man:pw[8]
ko: Man:pw[8]을 사용하여 그룹에 새 멤버 추가하기
ru: Добавление нового участника в группу с помощью man:pw[8]

source: In this example, the argument to `-m` is a comma-delimited list of users who are to be added to the group. Unlike the previous example, these users are appended to the group and do not replace existing users in the group.
ko: 이 예에서 `-m`의 인수는 그룹에 추가할 사용자를 쉼표로 구분하여 작성합니다. 이전 예와 달리 이러한 사용자는 그룹에 추가만 되며 그룹의 기존 사용자를 대체하지 않습니다.
ru: В этом примере аргумент `-m` представляет собой список пользователей, разделённых запятыми, которые будут добавлены в группу. В отличие от предыдущего примера, эти пользователи добавляются к группе и не заменяют уже существующих в ней пользователей.

source: Using man:id[1] to Determine Group Membership
ko: Man:id[1]을 사용하여 그룹 멤버십 결정하기
ru: Использование man:id[1] для определения членства в группе

source: In this example, `jru` is a member of the groups `jru` and `teamtwo`.
ko: 이 예에서 `jru`는 그룹 `jru` 및 `teamtwo`의 구성원입니다.
ru: В этом примере `jru` является участником групп `jru` и `teamtwo`.

source: For more information about this command and the format of `/etc/group`, refer to man:pw[8] and man:group[5].
ko: 이 명령과 `/etc/group`의 형식에 대한 자세한 내용은 man:pw[8] 및 man:group[5]을 참조하세요.
ru: Для получения дополнительной информации об этой команде и формате файла `/etc/group` обратитесь к man:pw[8] и man:group[5].

source: Permissions
ko: 권한
ru: Разрешения

source: In FreeBSD, every file and directory has an associated set of permissions and several utilities are available for viewing and modifying these permissions. Understanding how permissions work is necessary to make sure that users are able to access the files that they need and are unable to improperly access the files used by the operating system or owned by other users.
ko: FreeBSD에서는 모든 파일과 디렉터리에는 관련된 권한 집합이 있으며, 이러한 권한을 보고 수정하는 데 사용할 수 있는 여러 유틸리티가 있습니다. 사용자가 자신이 필요한 파일에 액세스할 수 있고 운영 체제에서 사용하거나 다른 사용자가 소유한 파일에 부적절하게 액세스할 수 없도록 하려면 권한이 어떻게 작동하는지 이해하는 것이 필요합니다.
ru: В FreeBSD каждому файлу и каталогу сопоставлен набор прав доступа, и существует несколько утилит для просмотра и изменения этих прав. Понимание работы прав доступа необходимо для того, чтобы пользователи могли получать доступ к нужным им файлам, но не имели возможности несанкционированного доступа к файлам операционной системы или файлам других пользователей.

source: This section discusses the traditional UNIX(R) permissions used in FreeBSD. For finer-grained file system access control, refer to crossref:security[fs-acl,Access Control Lists].
ko: 이 섹션에서는 FreeBSD에서 사용되는 전통적인 UNIX(R) 권한에 대해 설명합니다. 더 세분화된 파일 시스템 접근 제어에 대해서는 crossref:security[fs-acl,Access Control Lists]을 참조하세요.
ru: В этом разделе рассматриваются традиционные права доступа UNIX(R), используемые в FreeBSD. Для более детального управления доступом к файловой системе обратитесь к crossref:security[fs-acl,Списки контроля доступа].

source: In UNIX(R), basic permissions are assigned using three types of access: read, write, and execute. These access types are used to determine file access to the file's owner, group, and others (everyone else). The read, write, and execute permissions can be represented as the letters `r`, `w`, and `x`. They can also be represented as binary numbers as each permission is either on or off (`0`). When represented as a number, the order is always read as `rwx`, where `r` has an on value of `4`, `w` has an on value of `2` and `x` has an on value of `1`.
ko: UNIX(R)에서는 읽기, 쓰기, 실행의 세 가지 액세스 유형을 사용하여 기본 권한이 할당됩니다. 이러한 액세스 유형은 파일의 소유자, 그룹 및 기타(다른 모든 사람)에 대한 파일 액세스를 결정하는 데 사용됩니다. 읽기, 쓰기 및 실행 권한은 문자 `r`, `w` 및 `x`로 표시할 수 있습니다. 각 권한이 켜져 있거나 꺼져 있는 것(`0`)은 이진 숫자로도 나타낼 수 있습니다. 숫자로 표현할 때 순서는 항상 `rwx`로 읽으며, 여기서 `r`은 켜짐 값 `4`, `w`는 켜짐 값 `2`, `x`는 켜짐 값 `1`을 갖습니다.
ru: В UNIX(R) базовые права доступа назначаются с использованием трех типов доступа: чтение, запись и выполнение. Эти типы доступа определяют права на файл для владельца, группы и остальных (всех остальных). Права на чтение, запись и выполнение могут быть представлены буквами `r`, `w` и `x`. Они также могут быть представлены в виде двоичных чисел, так как каждое право либо включено, либо выключено (`0`). При представлении в виде чисел порядок всегда читается как `rwx`, где `r` имеет значение `4`, `w` — `2`, а `x` — `1`.

source: Table 4.1 summarizes the possible numeric and alphabetic possibilities. When reading the "Directory Listing" column, a `-` is used to represent a permission that is set to off.
ko: 표 4.1은 가능한 숫자 및 알파벳 조합을 요약한 것입니다. "디렉터리 목록”의 열을 읽을 때 `-`는 꺼짐으로 설정된 권한을 나타내는 데 사용됩니다.
ru: Таблица 4.1 обобщает возможные числовые и буквенные варианты. В столбце "Список файлов каталога" символ `-` используется для обозначения отключённого разрешения.

source: UNIX(R) Permissions
ko: UNIX(R) 권한
ru: Права доступа UNIX(R)

source: Value
ko: 값
ru: Значение

source: Permission
ko: 권한
ru: Разрешение

source: Directory Listing
ko: 디렉토리 목록
ru: Список файлов каталога

source: No read, no write, no execute
ru: Нет чтения, нет записи, нет выполнения

source: No read, no write, execute
ru: Нет чтения, нет записи, выполнение

source: No read, write, no execute
ru: Нет чтения, записи, выполнения

source: No read, write, execute
ru: Нет прав на чтение, запись, выполнение

source: Read, no write, no execute
ru: Чтение, нет записи, нет выполнения

source: Read, no write, execute
ru: Чтение, нет записи, выполнение

source: Read, write, no execute
ru: Чтение, запись, без выполнения

source: Read, write, execute
ru: Чтение, запись, выполнение

source: Use the `-l` argument with man:ls[1] to view a long directory listing that includes a column of information about a file's permissions for the owner, group, and everyone else. For example, `ls -l` in an arbitrary directory may show:
ko: Man:ls[1]과 함께 `-l` 인수를 사용하면 소유자, 그룹 및 다른 모든 사용자에 대한 파일의 권한에 대한 정보 열이 포함된 긴 디렉터리 목록을 볼 수 있습니다. 예를 들어 임의의 디렉터리에서 `ls -l`을 사용하면:
ru: Используйте аргумент `-l` с man:ls[1] для просмотра длинного списка каталога, который включает колонку с информацией о правах доступа к файлу для владельца, группы и всех остальных. Например, `ls -l` в произвольном каталоге может вывести:

source: Focusing on the line for `myfile`, the first `(leftmost)` character indicates whether this file is a regular file, a directory, a special character device, a socket, or any other special pseudo-file device. In this example, the `-` indicates a regular file. The next three characters, `rw-` in this example, give the permissions for the owner of the file. The next three characters, `r--`, give the permissions for the group that the file belongs to. The final three characters, `r--`, give the permissions for the rest of the world. A dash means that the permission is turned off. In this example, the permissions are set so the owner can read and write to the file, the group can read the file, and the rest of the world can only read the file. According to the table above, the permissions for this file would be `644`, where each digit represents the three parts of the file's permission.
ko: `myfile` 줄의 첫 번째 `(가장 왼쪽)` 문자는 이 파일이 일반 파일인지, 디렉토리인지, 특수 문자 장치인지, 소켓인지, 그외의 특수 의사-파일 장치인지를 나타냅니다. 이 예에서 `-`는 일반 파일을 나타냅니다. 이 예의 다음 세 문자 `rw-`는 파일 소유자에 대한 권한을 보여줍니다. 다음 세 문자 `r--`은 파일이 속한 그룹에 대한 권한을 보여줍니다. 마지막 세 문자 `r--`은 나머지 모든 사용자에 대한 권한을 보여줍니다. “-“는 해당 권한이 꺼져 있음을 의미합니다. 이 예에서는 소유자는 파일을 읽고 쓸 수 있고, 그룹은 파일을 읽을 수 있으며, 나머지 사용자들은 파일을 읽기만 할 수 있도록 권한이 설정되어 있습니다. 위의 표에 따르면 이 파일의 권한은 '644'이며, 각 숫자는 파일 권한의 세 부분을 나타냅니다.
ru: Рассматривая строку для файла `myfile`, первый `(крайний слева)` символ указывает, является ли этот файл обычным файлом, каталогом, специальным символьным устройством, сокетом или любым другим специальным псевдофайловым устройством. В данном примере символ `-` обозначает обычный файл. Следующие три символа, в этом примере `rw-`, указывают права для владельца файла. Следующие три символа, `r--`, указывают права для группы, к которой принадлежит файл. Последние три символа, `r--`, указывают права для всех остальных. Дефис означает, что право отключено. В этом примере права настроены так, что владелец может читать и записывать файл, группа может читать файл, а все остальные могут только читать файл. Согласно приведённой выше таблице, права для этого файла будут `644`, где каждая цифра представляет одну из трёх частей прав файла.

source: How does the system control permissions on devices? FreeBSD treats most hardware devices as a file that programs can open, read, and write data to. These special device files are stored in `/dev/`.
ko: 시스템은 장치에 대한 권한을 어떻게 제어할까요? FreeBSD는 거의 모든 하드웨어 장치를 프로그램이 데이터를 열고, 읽고, 쓸 수 있는 파일로 취급합니다. 이러한 특수 장치 파일은 `/dev/`에 저장됩니다.
ru: Как система управляет правами доступа к устройствам? FreeBSD рассматривает большинство аппаратных устройств как файлы, которые программы могут открывать, читать и записывать в них данные. Эти специальные файлы устройств хранятся в `/dev/`.

source: Directories are also treated as files. They have read, write, and execute permissions. The executable bit for a directory has a slightly different meaning than that of files. When a directory is marked executable, it means it is possible to change into that directory using man:cd[1]. This also means that it is possible to access the files within that directory, subject to the permissions on the files themselves.
ko: 디렉터리도 파일로 취급됩니다. 디렉터리에는 읽기, 쓰기, 실행 권한이 있습니다. 디렉토리의 실행 가능 비트(“x”)는 파일과 약간 다른 의미를 가집니다. 디렉터리가 실행 가능으로 표시되면 man:cd[1]를 사용하여 해당 디렉터리로 이동할 수 있다는 뜻입니다. 이는 또한 파일 자체(디렉터리를 말함)에 대한 권한에 따라 해당 디렉터리 내의 파일에 액세스할 수 있음을 의미합니다.
ru: Каталоги также рассматриваются как файлы. У них есть права на чтение, запись и выполнение. Бит выполнения для каталога имеет несколько иное значение, чем для файлов. Если каталог помечен как исполняемый, это означает, что в него можно перейти с помощью man:cd[1]. Это также означает, что можно получить доступ к файлам внутри этого каталога, в зависимости от прав на сами файлы.

source: In order to perform a directory listing, the read permission must be set on the directory. In order to delete a file that one knows the name of, it is necessary to have write _and_ execute permissions to the directory containing the file.
ko: 디렉토리내의 목록을 확인하려면 해당 디렉토리에 읽기 권한이 설정되어 있어야 합니다. 또한 이름을 알고 있는 파일을 삭제하려면 해당 파일이 포함된 디렉터리에 대한 쓰기 권한과 실행 권한이 있어야 합니다.
ru: Для выполнения списка файлов в каталоге необходимо установить право на чтение для этого каталога. Чтобы удалить файл, имя которого известно, требуются права на запись _и_ выполнение для каталога, содержащего этот файл.

source: There are more permission bits, but they are primarily used in special circumstances such as setuid binaries and sticky directories. For more information on file permissions and how to set them, refer to man:chmod[1].
ko: 더 많은 권한 비트방식이 있지만 주로 setuid 바이너리 및 고정 디렉터리(sticky directory)와 같은 특수한 상황에서 사용됩니다. 파일 권한 및 설정 방법에 대한 자세한 내용은 man:chmod[1]를 참조하세요.
ru: Существуют и другие биты разрешений, но они в основном используются в особых случаях, таких как setuid-бинарники и sticky-каталоги. Для получения дополнительной информации о правах доступа к файлам и их настройке обратитесь к man:chmod[1].

source: Symbolic Permissions
ko: 심볼릭 권한
ru: Символьные права доступа

source: Symbolic permissions use characters instead of octal values to assign permissions to files or directories. Symbolic permissions use the syntax of (who) (action) (permissions), where the following values are available:
ko: 심볼릭 권한은 8진수 값 대신 문자를 사용하여 파일 또는 디렉터리에 권한을 할당합니다. 기호 권한은 (who) (action) (permissions) 구문을 사용하여 명령을 작성합니다:
ru: Символьные права доступа используют символы вместо восьмеричных значений для назначения прав доступа файлам или каталогам. Синтаксис символьных прав доступа имеет вид (кто) (действие) (права доступа), где доступны следующие значения:

source: Option
ko: 옵션
ru: Опция

source: Letter
ko: 문자
ru: Буква

source: Represents
ko: 뜻
ru: Представляет

source: (who)
ru: (кто)

source: User
ru: Пользователь

source: Group owner
ru: Владелец группы

source: Other
ru: Другие

source: All ("world")
ru: Все (all, "world")

source: (action)
ru: (действие)

source: Adding permissions
ko: 권한 추가
ru: Добавление разрешений

source: Removing permissions
ko: 사용자 삭제
ru: Удаление прав доступа

source: Explicitly set permissions
ko: 명시적으로 설정된 권한
ru: Явно заданные разрешения

source: (permissions)
ru: (права доступа)

source: Read
ru: Чтение

source: Write
ru: Запись

source: Execute
ru: Выполнение

source: Sticky bit
ru: Бит закрепления (sticky)

source: Set UID or GID
ru: Установка UID или GID

source: These values are used with man:chmod[1], but with letters instead of numbers. For example, the following command would block both members of the group associated with _FILE_ and all other users from accessing _FILE_:
ko: 이 값은 man:chmod[1]과 함께 사용되지만 숫자 대신 문자를 사용합니다. 예를 들어, 다음 명령은 _FILE_과 연결된 그룹의 구성원과 다른 모든 사용자가 _FILE_에 액세스하지 못하도록 차단합니다:
ru: Эти значения используются с man:chmod[1], но с буквами вместо чисел. Например, следующая команда запретит доступ к _FILE_ как членам группы, связанной с _FILE_, так и всем остальным пользователям:
