Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: A comma separated list can be provided when more than one set of changes to a file must be made. For example, the following command removes the group and "world" write permission on _FILE_, and adds the execute permissions for everyone:
ko: 파일을 두 개 이상 변경해야 하는 경우 쉼표로 구분된 목록을 사용할 수 있습니다. 예를 들어 다음 명령은 _FILE_에 대한 그룹 구성원 및 다른 모두의 쓰기 권한을 제거하고 모든 사용자에 대한 실행 권한을 추가합니다:
ru: Список, разделённый запятыми, может быть указан, если к файлу необходимо применить более одного изменения. Например, следующая команда удаляет разрешение на запись для группы и всех остальных пользователей у _FILE_, а также добавляет разрешение на выполнение для всех:

source: FreeBSD File Flags
ko: FreeBSD 파일 플래그
ru: Флаги файлов FreeBSD

source: In addition to file permissions, FreeBSD supports the use of "file flags". These flags add an additional level of security and control over files, but not directories. With file flags, even `root` can be prevented from removing or altering files.
ko: 파일 권한 외에도 FreeBSD는 "파일 플래그" 기능을 지원합니다. 이 플래그는 디렉토리를 제외한 파일에 대한 보안과 제어 수준을 추가합니다. 파일 플래그를 사용하면 `root`도 파일을 제거하거나 변경하지 못하게 할 수 있습니다.
ru: В дополнение к правам доступа к файлам FreeBSD поддерживает использование "флагов файлов". Эти флаги добавляют дополнительный уровень безопасности и контроля над файлами, но не над каталогами. С помощью флагов файлов даже пользователь `root` может быть лишён возможности удалять или изменять файлы.

source: File flags are modified using man:chflags[1]. For example, to enable the system undeletable flag on the file `file1`, issue the following command:
ko: 파일 플래그는 man:chflags[1]을 사용하여 수정합니다. 예를 들어, `file1` 파일에 시스템 삭제 불가 플래그를 활성화하려면 다음 명령을 실행합니다:
ru: Флаги файлов изменяются с помощью man:chflags[1]. Например, чтобы установить системный флаг «неудаляемый» для файла `file1`, выполните следующую команду:

source: To disable the system undeletable flag, put a "no" in front of the `sunlink`:
ko: 시스템 삭제 불가 플래그를 비활성화하려면 `sunlink` 앞에 “no”를 추가합니다:
ru: Чтобы отключить системный флаг "неудаляемый", добавьте "no" перед `sunlink`:

source: To view the flags of a file, use `-lo` with man:ls[1]:
ko: 파일의 플래그를 보려면 man:ls[1]과 함께 `-lo`를 사용합니다:
ru: Чтобы просмотреть флаги файла, используйте `-lo` с man:ls[1]:

source: Several file flags may only be added or removed by the `root` user. In other cases, the file owner may set its file flags. Refer to man:chflags[1] and man:chflags[2] for more information.
ko: 몇몇 파일 플래그는 `root` 사용자만 추가하거나 제거할 수 있습니다. 그 외의 경우에는 파일 소유자가 파일 플래그를 설정할 수 있습니다. 자세한 내용은 man:chflags[1] 와 man:chflags[2]를 참조하세요.
ru: Некоторые флаги файлов могут быть добавлены или удалены только пользователем `root`. В остальных случаях владелец файла может устанавливать его флаги. Дополнительную информацию можно найти в man:chflags[1] и man:chflags[2].

source: The setuid, setgid, and sticky Permissions
ko: Setuid, setgid 및 sticky 권한
ru: Установленные биты setuid, setgid и sticky

source: Other than the permissions already discussed, there are three other specific settings that all administrators should know about. They are the `setuid`, `setgid`, and `sticky` permissions.
ko: 이미 설명한 권한 외에도 모든 관리자가 알아야 할 세 가지 특수 설정이 있습니다. `setuid`, `setgid`, `sticky` 권한이 바로 그것입니다.
ru: Помимо уже рассмотренных прав доступа, существуют три специальных параметра, которые должны знать все администраторы. Это права `setuid`, `setgid` и `sticky`.

source: These settings are important for some UNIX(R) operations as they provide functionality not normally granted to normal users. To understand them, the difference between the real user ID and effective user ID must be noted.
ko: 이러한 설정은 일반 사용자에게 일반적으로 부여되지 않는 기능을 제공하므로 몇가지 UNIX(R) 작업에서 중요합니다. 이를 이해하려면 실제 사용자 ID와 유효 사용자 ID의 차이점을 알아야 합니다.
ru: Эти настройки важны для некоторых операций UNIX(R), так как предоставляют функциональность, обычно недоступную обычным пользователям. Чтобы понять их, необходимо отметить разницу между реальным идентификатором пользователя (real user ID) и эффективным идентификатором пользователя (effective user ID).

source: The real user ID is the UID who owns or starts the process. The effective UID is the user ID the process runs as. As an example, man:passwd[1] runs with the real user ID when a user changes their password. However, in order to update the password database, the command runs as the effective ID of the `root` user. This allows users to change their passwords without seeing a `Permission Denied` error.
ko: 실제 사용자 ID는 프로세스를 소유하거나 시작하는 UID입니다. 유효 UID는 프로세스가 실행되는 사용자 ID입니다. 예를 들어, 사용자가 비밀번호를 변경할 때 man:passwd[1]은 실제 사용자 ID로 실행됩니다. 그러나 비밀번호 데이터베이스를 업데이트하기 위해 이 명령은 `root` 사용자의 유효 ID로 실행됩니다. 따라서 사용자는 `Permission Denied` 오류를 보지 않고 비밀번호를 변경할 수 있습니다.
ru: Реальный идентификатор пользователя (UID) — это UID, который владеет или запускает процесс. Эффективный идентификатор пользователя — это UID, от имени которого выполняется процесс. Например, man:passwd[1] запускается с реальным UID, когда пользователь меняет свой пароль. Однако для обновления базы данных паролей команда выполняется с эффективным UID пользователя `root`. Это позволяет пользователям изменять свои пароли без ошибки `Permission Denied`.

source: The setuid permission may be added symbolically by adding the `s` permission for the user as in the following example:
ko: 다음 예제에서와 같이 사용자에 대한 `s` 권한을 추가하여 상징적으로 setuid 권한을 추가할 수 있습니다:
ru: Разрешение setuid может быть добавлено символически путем добавления права `s` для пользователя, как в следующем примере:

source: The setuid permission may also be set by prefixing a permission set with the number four (4) as shown in the following example:
ko: 다음 예와 같이 권한 집합 앞에 숫자 4를 붙여서 setuid 권한을 설정할 수도 있습니다:
ru: Права setuid также могут быть установлены путем добавления числа четыре (4) перед набором прав, как показано в следующем примере:

source: The permissions on `suidexample.sh` now look like the following:
ko: 이제 `suidexample.sh`에 대한 권한은 다음과 같이 표시됩니다:
ru: Разрешения для файла `suidexample.sh` теперь выглядят следующим образом:

source: Note that a `s` is now part of the permission set designated for the file owner, replacing the executable bit. This allows utilities which need elevated permissions, such as man:passwd[1].
ko: 이제 `s`가 파일 소유자에게 지정된 권한 집합의 일부가 되어 실행 비트를 대체합니다. 이제 man:passwd[1]과 같이 상승된 권한이 필요한 유틸리티를 사용할 수 있습니다.
ru: Обратите внимание, что `s` теперь является частью набора прав для владельца файла, заменив бит исполнения. Это позволяет создавать программы, требующие повышенных прав, таких как man:passwd[1].

source: The `nosuid` man:mount[8] option will cause such binaries to silently fail without alerting the user. That option is not completely reliable as a `nosuid` wrapper may be able to circumvent it.
ko: `nosuid` man:mount[8] 옵션을 사용하면 이러한 바이너리가 사용자에게 표시되지 않고 자동으로 실패합니다. 이 옵션은 `nosuid` 래퍼가 이를 우회할 수 있으므로 완전히 신뢰할 수 없습니다.
ru: Опция `nosuid` в man:mount[8] приведёт к тихому отказу таких бинарных файлов без уведомления пользователя. Эта опция не полностью надежна, так как обёртка `nosuid` может её обойти.

source: To view this in real time, open two terminals. On one, type `passwd` as a normal user. While it waits for a new password, check the process table and look at the user information for man:passwd[1]:
ko: 이를 실시간으로 보려면 두 개의 터미널을 엽니다. 한 터미널에서 일반 사용자로 `passwd`를 입력합니다. 새 비밀번호를 기다리는 동안 다른 터미널에서 프로세스 테이블을 확인하여 man:passwd[1]에 대한 사용자 정보를 확인합니다:
ru: Чтобы наблюдать это в реальном времени, откройте два терминала. В одном введите `passwd` как обычный пользователь. Пока команда ожидает ввода нового пароля, проверьте таблицу процессов и посмотрите информацию о пользователе для man:passwd[1]:

source: In terminal A:
ko: 터미널 A:
ru: В терминале A:

source: In terminal B:
ko: 터미널 B:
ru: В терминале B:

source: Although man:passwd[1] is run as a normal user, it is using the effective UID of `root`.
ko: Man:passwd[1]는 일반 사용자로 실행되었지만, `root`의 유효 UID를 사용하고 있는 것을 알 수 있습니다.
ru: Хотя man:passwd[1] запускается от имени обычного пользователя, он использует эффективный UID `root`.

source: The `setgid` permission performs the same function as the `setuid` permission; except that it alters the group settings. When an application or utility executes with this setting, it will be granted the permissions based on the group that owns the file, not the user who started the process.
ko: `setgid` 권한은 그룹의 권한설정을 변경한다는 점을 제외하면 `setuid` 권한과 동일한 기능을 수행합니다. 이 설정으로 애플리케이션 또는 유틸리티를 실행하면 프로세스를 시작한 사용자가 아닌 파일을 소유한 그룹에 맞춰 권한이 부여됩니다.
ru: Разрешение `setgid` выполняет ту же функцию, что и разрешение `setuid`, за исключением того, что оно изменяет настройки группы. Когда приложение или утилита запускается с этой настройкой, оно получает разрешения в соответствии с группой, которой принадлежит файл, а не пользователем, запустившим процесс.

source: To set the `setgid` permission on a file symbolically, add the `s` permission for the group with man:chmod[1]:
ko: 파일에 `setgid` 권한을 상징적으로 설정하려면 man:chmod[1]로 그룹에 대한 `s` 권한을 추가합니다:
ru: Чтобы установить право `setgid` на файл в символьном виде, добавьте право `s` для группы с помощью man:chmod[1]:

source: Alternatively, provide man:chmod[1] with a leading two (2):
ko: 또는 man:chmod[1]에 앞의 두 개(2)를 입력합니다:
ru: В качестве альтернативы укажите в man:chmod[1] ведущую двойку (2):

source: In the following listing, notice that the `s` is now in the field designated for the group permission settings:
ko: 다음 목록에서 이제 그룹 권한 필드에 's'가 있는 것을 확인할 수 있습니다:
ru: В следующем листинге обратите внимание, что символ `s` теперь находится в поле, предназначенном для настроек прав группы:

source: In these examples, even though the shell script in question is an executable file, it will not run with a different EUID or effective user ID. This is because shell scripts may not access the man:setuid[2] system calls.
ko: 이 예제에서는 문제의 셸 스크립트가 실행 파일이지만 다른 EUID 또는 유효 사용자 ID로 실행되지 않습니다. 이는 셸 스크립트가 man:setuid[2] 시스템 호출에 액세스할 수 없기 때문입니다.
ru: В этих примерах, даже если рассматриваемый shell-скрипт является исполняемым файлом, он не будет запускаться с другим EUID или эффективным идентификатором пользователя. Это происходит потому, что shell-скрипты не могут использовать системные вызовы man:setuid[2].

source: The `setuid` and `setgid` permission bits may lower system security, by allowing for elevated permissions. The third special permission, the `sticky bit`, can strengthen the security of a system.
ko: `setuid` 및 `setgid` 권한 비트는 높은 수준의 권한을 허용하여 시스템 보안을 낮출 수 있습니다. 세 번째 특수 권한인 `sticky bit`는 시스템 보안을 강화할 수 있습니다.
ru: `setuid` и `setgid` биты прав могут снизить безопасность системы, предоставляя повышенные привилегии. Третий специальный бит прав, `sticky bit`, напротив, может повысить безопасность системы.

source: When the `sticky bit` is set on a directory, it allows file deletion only by the file owner. This is useful to prevent file deletion in public directories, such as `/tmp`, by users who do not own the file. To utilize this permission, add the `t` mode to the file:
ko: 디렉터리에 `sticky bit`가 설정되어 있으면 파일 소유자만 파일을 삭제할 수 있습니다. 이는 파일을 소유하지 않은 사용자가 `/tmp`와 같은 공용 디렉터리에서 파일을 삭제하는 것을 방지하는 데 유용합니다. 이 권한을 사용하려면 파일에 `t` 모드를 추가합니다:
ru: Когда `sticky bit` установлен на директории, он разрешает удаление файлов только владельцу файла. Это полезно для предотвращения удаления файлов в общедоступных директориях, таких как `/tmp`, пользователями, не являющимися владельцами файла. Чтобы использовать этот режим доступа, добавьте режим `t` к файлу:

source: Alternatively, prefix the permission set with a one (1):
ko: 또는 권한 집합 앞에 숫자 1(1)을 붙입니다:
ru: В качестве альтернативы можно добавить единицу (1) перед набором прав доступа:

source: The `sticky bit` permission will display as a `t` at the very end of the permission set:
ko: `sticky bit` 권한은 권한 집합의 맨 끝에 't'로 표시됩니다:
ru: Разрешение `sticky bit` отображается как `t` в самом конце набора разрешений:

source: Directory Structure
ko: 디렉터리 구조
ru: Структура каталогов

source: The FreeBSD directory hierarchy is fundamental to obtaining an overall understanding of the system. The most important directory is root or, "/". This directory is the first one mounted at boot time and it contains the base system necessary to prepare the operating system for multi-user operation. The root directory also contains mount points for other file systems that are mounted during the transition to multi-user operation.
ko: FreeBSD 디렉터리 계층 구조는 시스템에 대한 전반적인 이해를 얻기 위한 기본입니다. 가장 중요한 디렉터리는 루트 또는 "/"입니다. 이 디렉터리는 부팅 시 가장 먼저 마운트되는 디렉터리로, 다중 사용자 환경을 위해 운영 체제를 준비하는 데 필요한 기본 시스템을 포함합니다. 루트 디렉터리에는 다중 사용자 환경으로 전환하는 동안 마운트되는 다른 파일 시스템에 대한 마운트 지점도 포함되어 있습니다.
ru: Иерархия каталогов FreeBSD является основой для общего понимания системы. Наиболее важным каталогом является корневой или "/". Этот каталог монтируется первым при загрузке и содержит базовую систему, необходимую для подготовки операционной системы к многопользовательскому режиму. Корневой каталог также содержит точки монтирования для других файловых систем, которые монтируются во время перехода в многопользовательский режим.

source: A mount point is a directory where additional file systems can be grafted onto a parent file system (usually the root file system). This is further described in crossref:basics[disk-organization, Disk Organization]. Standard mount points include `/usr/`, `/var/`, `/tmp/`, `/mnt/`, and `/cdrom/`. These directories are usually referenced to entries in `/etc/fstab`. This file is a table of various file systems and mount points and is read by the system. Most of the file systems in `/etc/fstab` are mounted automatically at boot time from the script man:rc[8] unless their entry includes `noauto`. Details can be found in crossref:basics[disks-fstab, The fstab File].
ru: Точка монтирования — это каталог, в который можно подключить дополнительные файловые системы к родительской файловой системе (обычно корневой файловой системе). Это подробно описано в разделе crossref:basics[disk-organization,Организация дисков]. Стандартные точки монтирования включают `/usr/`, `/var/`, `/tmp/`, `/mnt/` и `/cdrom/`. Эти каталоги обычно связаны с записями в файле `/etc/fstab`. Этот файл представляет собой таблицу различных файловых систем и точек монтирования, которая читается системой. Большинство файловых систем в `/etc/fstab` автоматически монтируются при загрузке с помощью скрипта man:rc[8], если их запись не содержит параметра `noauto`. Подробности можно найти в разделе crossref:basics[disks-fstab,Файл fstab].

source: A complete description of the file system hierarchy is available in man:hier[7]. The following table provides a brief overview of the most common directories.
ko: 파일 시스템 계층 구조에 대한 자세한 설명은 man:hier[7]에서 확인할 수 있습니다. 다음 표는 가장 일반적인 디렉터리에 대한 간략한 개요를 제공합니다.
ru: Полное описание иерархии файловой системы доступно в man:hier[7]. В следующей таблице представлен краткий обзор наиболее распространённых каталогов.

source: Directory
ko: 디렉터리
ru: Каталог

source: Description
ko: 설명
ru: Описание

source: Root directory of the file system.
ko: 파일시스템의 루트 디렉터리.
ru: Корневой каталог файловой системы.

source: User utilities fundamental to both single-user and multi-user environments.
ko: 단일 사용자 및 다중 사용자 환경 모두에게 기본이 되는 사용자 유틸리티.
ru: Пользовательские утилиты, основные как для однопользовательской, так и для многопользовательской среды.

source: Programs and configuration files used during operating system bootstrap.
ko: 운영 체제 부트스트랩 중에 사용되는 프로그램 및 설정 파일.
ru: Программы и конфигурационные файлы, используемые при загрузке операционной системы.

source: Default boot configuration files. Refer to man:loader.conf[5] for details.
ko: 기본 부팅 설정 파일. 자세한 내용은 man:loader.conf[5]를 참조하세요.
ru: Файлы конфигурации загрузки по умолчанию. Подробности смотрите в man:loader.conf[5].

source: Device special files managed by man:devfs[5]
ko: Man:devfs[5]가 관리하는 장치 특수 파일
ru: Специальные файлы устройств, управляемые man:devfs[5]

source: System configuration files and scripts.
ko: 시스템 설정 파일 및 스크립트.
ru: Системные конфигурационные файлы и скрипты.

source: Default system configuration files. Refer to man:rc[8] for details.
ko: 기본 시스템 구성 파일. 자세한 내용은 man:rc[8]을 참조하세요.
ru: Файлы конфигурации системы по умолчанию. Подробности смотрите в man:rc[8].

source: Scripts that run daily, weekly, and monthly, via man:cron[8]. Refer to man:periodic[8] for details.
ko: Man:cron[8]을 통해 매일, 매주, 매월 실행되는 스크립트. 자세한 내용은 man:periodic[8]을 참조하세요.
ru: Скрипты, выполняемые ежедневно, еженедельно и ежемесячно, через man:cron[8]. Подробности смотрите в man:periodic[8].

source: Critical system libraries needed for binaries in `/bin` and `/sbin`
ko: `/bin` 및 `/sbin`의 바이너리에 필요한 핵심 시스템 라이브러리
ru: Критические системные библиотеки, необходимые для бинарных файлов в `/bin` и `/sbin`

source: Critical system files
ko: 핵심 시스템 파일
ru: Критические системные файлы

source: Contains subdirectories to be used as mount points for removable media such as CDs, USB drives, and floppy disks
ko: CD, USB 드라이브, 플로피 디스크와 같은 이동식 미디어의 마운트 지점으로 사용할 하위 디렉터리를 포함하고 있음
ru: Содержит подкаталоги, предназначенные для использования в качестве точек монтирования съемных носителей, таких как компакт-диски, USB-накопители и дискеты

source: Empty directory commonly used by system administrators as a temporary mount point.
ko: 시스템 관리자가 임시 마운트 지점으로 일반적으로 사용하는 빈 디렉터리.
ru: Пустая директория, обычно используемая системными администраторами в качестве временной точки монтирования.

source: Automounted NFS shares; see man:auto_master[5]
ko: 자동 마운트되는 NFS 공유공간; man:auto_master[5] 참조
ru: Автомонтируемые NFS-ресурсы; см. man:auto_master[5]

source: Process file system. Refer to man:procfs[5] for details.
ru: Файловая система процессов. Подробности смотрите в man:procfs[5].

source: Statically linked programs for emergency recovery as described in man:rescue[8].
ko: Man:rescue[8]에 설명된 대로 긴급 복구를 위한 정적으로 연결된 프로그램.
ru: Статически связанные программы для аварийного восстановления, как описано в man:rescue[8].

source: Home directory for the `root` account.
ko: 루트 계정의 홈 디렉터리.
ru: Домашний каталог для учетной записи `root`.

source: System programs and administration utilities fundamental to both single-user and multi-user environments.
ko: 단일 사용자 및 다중 사용자 환경 모두의 근간이 되는 시스템 프로그램 및 관리 유틸리티.
ru: Системные программы и административные утилиты, необходимые как для однопользовательского, так и для многопользовательского окружения.

source: Temporary files which are usually _not_ preserved across a system reboot. A memory-based file system is often mounted at `/tmp`. This can be automated using the tmpmfs-related variables of man:rc.conf[5] or with an entry in `/etc/fstab`; refer to man:mdmfs[8] for details.
ko: 임시 파일은 일반적으로 시스템 재부팅 시 _보존되지 않습니다_. 메모리 기반 파일 시스템은 종종 `/tmp`에 마운트됩니다. 이는 man:rc.conf[5]의 tmpmfs 관련 변수를 사용하거나 `/etc/fstab`의 항목을 사용하여 자동화할 수 있습니다. 자세한 내용은 man:mdmfs[8]을 참조하세요.
ru: Временные файлы, которые обычно _не_ сохраняются после перезагрузки системы. Часто в `/tmp` монтируется файловая система в памяти. Это можно автоматизировать, используя переменные, связанные с tmpmfs, из man:rc.conf[5], или добавив запись в `/etc/fstab`; подробности смотрите в man:mdmfs[8].

source: The majority of user utilities and applications.
ko: 사용자의 주요 유틸리티 및 애플리케이션.
ru: Большинство пользовательских утилит и приложений.

source: Common utilities, programming tools, and applications.
ko: 일반적인 유틸리티, 프로그래밍 도구 및 애플리케이션.
ru: Общие утилиты, инструменты программирования и приложения.

source: Standard C include files.
ko: 파일을 포함한 표준 C.
ru: Стандартные включаемые файлы языка C.

source: Archive libraries.
ko: 아카이브 라이브러리.
ru: Библиотеки архивов.

source: Miscellaneous utility data files.
ko: 기타 유틸리티 데이터 파일.
ru: Различные вспомогательные файлы данных.

source: System daemons and system utilities executed by other programs.
ko: 다른 프로그램에서 실행하는 시스템 데몬 및 시스템 유틸리티.
ru: Системные демоны и системные утилиты, выполняемые другими программами.

source: Local executables and libraries. Also used as the default destination for the FreeBSD ports framework. Within `/usr/local`, the general layout sketched out by man:hier[7] for `/usr` should be used. Exceptions are the man directory, which is directly under `/usr/local` rather than under `/usr/local/share`, and the ports documentation is in `share/doc/port`.
ko: 로컬 실행 파일 및 라이브러리. FreeBSD에서는 포트(Port) 프레임워크의 기본 위치로도 사용됩니다. `/usr/local` 내에서는, `/usr`에 대해 man:hier[7]가 구성한 일반 레이아웃을 사용해야 합니다. `/usr/local/share`의 아래가 아닌 `/usr/local` 바로 아래에 있는 man 디렉터리와 `share/doc/port`에 있는 포트 문서는 예외입니다.
ru: Локальные исполняемые файлы и библиотеки. Также используется как путь по умолчанию для установки портов FreeBSD. Внутри `/usr/local` должна использоваться общая структура каталогов, описанная в man:hier[7] для `/usr`. Исключениями являются каталог man, который находится непосредственно в `/usr/local`, а не в `/usr/local/share`, а документация портов располагается в `share/doc/port`.

source: The FreeBSD Ports Collection (optional).
ko: FreeBSD 포트(Port) 컬렉션(선택 사항).
ru: Коллекция портов FreeBSD (опционально).

source: System daemons and system utilities executed by users.
ko: 사용자에 의해 실행되는 시스템 데몬 및 시스템 유틸리티.
ru: Системные демоны и системные утилиты, выполняемые пользователями.

source: Architecture-independent files.
ko: 아키텍처에 독립적인 파일.
ru: Архитектурно-независимые файлы.

source: BSD and/or local source files.
ko: BSD 및/또는 로컬 소스 파일.
ru: BSD и/или локальные исходные файлы.

source: Multi-purpose log, temporary, transient, and spool files.
ko: 다목적 로그, 임시 파일, 트랜지션 파일 및 스풀 파일들.
ru: Многоцелевые файлы журналов, временные, транзиентные и файлы очередей.

source: Miscellaneous system log files.
ko: 기타 시스템 로그 파일.
ru: Различные системные журналы.

source: Temporary files which are usually preserved across a system reboot.
ko: 일반적으로 시스템 재부팅 시 보존되는 임시 파일.
ru: Временные файлы, которые обычно сохраняются после перезагрузки системы.

source: Disk Organization
ko: 디스크 구성
ru: Организация диска

source: The smallest unit of organization that FreeBSD uses to find files is the filename. Filenames are case-sensitive, which means that `readme.txt` and `README.TXT` are two separate files. FreeBSD does not use the extension of a file to determine whether the file is a program, document, or some other form of data.
ko: FreeBSD가 파일을 찾을 때 사용하는 가장 작은 단위는 파일 이름입니다. 파일 이름은 대소문자를 구분하므로, `readme.txt`와 `README.txt`는 별개의 파일로 취급됩니다. FreeBSD는 파일의 확장자를 사용하여 파일이 프로그램인지, 문서인지 또는 다른 형태의 데이터인지 판단하지 않습니다.
ru: Наименьшей единицей организации, которую FreeBSD использует для поиска файлов, является имя файла. Имена файлов чувствительны к регистру, что означает, что `readme.txt` и `README.TXT` — это два разных файла. FreeBSD не использует расширение файла для определения, является ли файл программой, документом или каким-либо другим видом данных.

source: Files are stored in directories. A directory may contain no files, or it may contain many hundreds of files. A directory can also contain other directories, allowing a hierarchy of directories within one another in order to organize data.
ko: 파일은 디렉터리에 저장됩니다. 디렉터리에는 파일이 하나도 없을 수도 있고 수백 개의 파일이 포함될 수도 있습니다. 또한 디렉터리는 다른 디렉터리를 포함할 수 있으므로 데이터를 정리하기 위해 여러 디렉터리를 계층화할 수 있습니다.
ru: Файлы хранятся в каталогах. Каталог может не содержать файлов или содержать сотни файлов. Каталог также может содержать другие каталоги, что позволяет создавать иерархию вложенных каталогов для организации данных.
