Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: This diagram shows FreeBSD's view of the first SATA disk attached to the system. Assume that the disk is 250 GB in size, and contains an 80 GB slice and a 170 GB slice (MS-DOS(R) partitions). The first slice contains a Windows(R) NTFS file system, `C:`, and the second slice contains a FreeBSD installation. This example FreeBSD installation has four data partitions and a swap partition.
ko: 이 다이어그램은 시스템에 연결된 첫 번째 SATA 디스크에 대한 FreeBSD를 보여줍니다. 디스크의 크기가 250GB이고 80GB 슬라이스와 170GB 슬라이스(MS-DOS(R) 파티션)가 포함되어 있다고 가정합시다. 첫 번째 슬라이스에는 Windows(R) NTFS 파일 시스템인 `C:`가 포함되어 있고 두 번째 슬라이스에는 FreeBSD가 설치되어 있습니다. 이 예시에서 FreeBSD는 4개의 데이터 파티션과 스왑 파티션을 가집니다.
ru: На этой диаграмме показано, как FreeBSD видит первый SATA-диск, подключённый к системе. Предположим, что размер диска составляет 250 ГБ, и он содержит раздел на 80 ГБ и раздел на 170 ГБ (разделы MS-DOS(R)). Первый раздел содержит файловую систему Windows(R) NTFS, `C:`, а второй раздел содержит установленную систему FreeBSD. В данном примере установки FreeBSD присутствуют четыре раздела с данными и один раздел подкачки.

source: The four partitions each hold a file system. Partition `a` is used for the root file system, `d` for `/var/`, `e` for `/tmp/`, and `f` for `/usr/`. Partition letter `c` refers to the entire slice, and so is not used for ordinary partitions.
ko: 4개의 파티션은 각각의 파일 시스템을 가집니다. 파티션 `a`는 루트 파일 시스템에, `d`는 `/var/`에, `e`는 `/tmp/`에, `f`는 `/usr/`에 사용됩니다. 파티션 문자 `c`는 전체 슬라이스를 나타내므로 일반 파티션에는 사용되지 않습니다.
ru: Четыре раздела содержат файловые системы. Раздел `a` используется для корневой файловой системы, `d` — для `/var/`, `e` — для `/tmp/`, а `f` — для `/usr/`. Буква раздела `c` относится ко всему слайсу и поэтому не используется для обычных разделов.

source: Layout of a shared drive between Windows and FreeBSD
ko: Windows와 FreeBSD 간의 공유 드라이브 레이아웃
ru: Компоновка общего диска между Windows и FreeBSD

source: Mounting and Unmounting File Systems
ko: 파일 시스템 마운트 및 마운트 해제
ru: Монтирование и демонтирование файловых систем

source: The file system is best visualized as a tree, rooted, as it were, at `/`. `/dev`, `/usr`, and the other directories in the root directory are branches, which may have their own branches, such as `/usr/local`, and so on.
ko: 파일 시스템은 `/`에 뿌리를 둔 트리로 시각화하는 것이 가장 좋습니다. `/dev`, `/usr` 및 다른 디렉터리는 루트 디렉터리의 브랜치이며, `/usr/local` 등과 같은 자체 브랜치를 가질 수 있습니다.
ru: Файловую систему удобно визуализировать как дерево, корнем которого является `/`. Каталоги `/dev`, `/usr` и другие в корневом каталоге представляют собой ветви, которые, в свою очередь, могут иметь собственные ветви, например `/usr/local`, и так далее.

source: There are various reasons to house some of these directories on separate file systems. `/var` contains the directories `log/`, `spool/`, and various types of temporary files, and as such, may get filled up. Filling up the root file system is not a good idea, so splitting `/var` from `/` is often favorable.
ko: 이러한 디렉터리 중 일부를 별도의 파일 시스템에 보관하는 데에는 여러 가지 이유가 있습니다. `/var` 에는 `log/`, `spool/` 디렉터리와 다양한 유형의 임시 파일이 포함되어 있으므로 가득 찰 수 있습니다. 루트 파일 시스템을 가득 채우는 것은 좋은 생각이 아니므로 `/var`를 `/`에서 분리하는 것이 유리한 경우가 많습니다.
ru: Существуют различные причины для размещения некоторых из этих каталогов на отдельных файловых системах. `/var` содержит каталоги `log/`, `spool/` и различные типы временных файлов, поэтому может заполняться. Заполнение корневой файловой системы нежелательно, поэтому часто предпочтительно отделить `/var` от `/`.

source: Another common reason to contain certain directory trees on other file systems is if they are to be housed on separate physical disks, or are separate virtual disks, such as Network File System mounts, described in crossref:network-servers[network-nfs,“Network File System (NFS)”], or CDROM drives.
ko: 특정 디렉터리 트리를 다른 파일 시스템에 두는 또 다른 일반적인 이유는, 해당 디렉터리 트리를 별도의 물리적 디스크에 보관하는 경우나, crossref:network-servers[network-nfs,“Network File System (NFS)”]에 설명된 네트워크 파일 시스템 또는 CDROM 드라이브와 같이 별도의 가상 디스크에 보관해야 하는 경우입니다.
ru: Еще одна распространённая причина размещать определённые каталоги на других файловых системах — это необходимость их размещения на отдельных физических дисках или виртуальных дисках, таких как сетевые файловые системы (NFS), описанные в crossref:network-servers[network-nfs,“Сетевая файловая система (NFS)”], или приводы CDROM.

source: The fstab File
ko: fstab 파일
ru: Файл fstab

source: During the boot process (crossref:boot[boot,The FreeBSD Booting Process]), file systems listed in `/etc/fstab` are automatically mounted except for the entries containing `noauto`. This file contains entries in the following format:
ko: 부팅 프로세스(crossref:boot[boot,The FreeBSD Booting Process]) 동안 `/etc/fstab`에 나열된 파일 시스템은 `noauto`가 포함된 항목을 제외하고 자동으로 마운트됩니다. 이 파일에는 다음 형식의 항목이 포함되어 있습니다:
ru: В процессе загрузки (crossref:boot[boot,Процесс загрузки FreeBSD]), файловые системы, перечисленные в `/etc/fstab`, автоматически монтируются, за исключением записей, содержащих `noauto`. Этот файл содержит записи в следующем формате:

source: An existing device name as explained in crossref:basics[disks-naming,Disk Device Names].
ru: Существующее имя устройства, как описано в crossref:basics[disks-naming,Имена устройств дисков].

source: An existing directory on which to mount the file system.
ko: 파일 시스템에 마운트할 기존 디렉터리.
ru: Существующий каталог, на который монтируется файловая система.

source: The file system type to pass to man:mount[8]. The default FreeBSD file system is `ufs`.
ko: Man:mount[8]에 전달할 파일 시스템 유형. 기본 FreeBSD 파일 시스템은 `ufs`입니다.
ru: Тип файловой системы, передаваемый в man:mount[8]. Файловая система по умолчанию в FreeBSD — `ufs`.

source: Either `rw` for read-write file systems, or `ro` for read-only file systems, followed by any other options that may be needed. A common option is `noauto` for file systems not normally mounted during the boot sequence. Other options are listed in man:mount[8].
ko: 읽기-쓰기 파일 시스템의 경우 `rw`, 읽기 전용 파일 시스템의 경우 `ro` 및 기타 필요한 다른 옵션들. 일반적인 옵션은 부팅 시퀀스 중에 자동으로 마운트하지 않는 파일 시스템에 대한 `noauto`입니다. 다른 옵션은 man:mount[8]에 설명되어 있습니다.
ru: `rw` для файловых систем с доступом на чтение и запись или `ro` для файловых систем только для чтения, за которыми могут следовать другие необходимые опции. Часто используется опция `noauto` для файловых систем, которые обычно не монтируются при загрузке. Другие опции перечислены в man:mount[8].

source: Used by man:dump[8] to determine which file systems require dumping. If the field is missing, a value of zero is assumed.
ko: Man:dump[8]에서 dumping이 필요한 파일 시스템인지를 결정하는 데 사용됩니다. 필드가 비어 있으면 0으로 가정합니다.
ru: Используется man:dump[8] для определения, какие файловые системы требуют дампинга. Если поле отсутствует, предполагается значение ноль.

source: Determines the order in which UFS file systems should be checked by man:fsck[8] after a reboot. File systems that should be skipped should have their `passno` set to zero. The root file system needs to be checked before everything else and should have its `passno` set to one. The other file systems should be set to values greater than one. If more than one file system has the same `passno`, man:fsck[8] will attempt to check file systems in parallel if possible.
ko: 재부팅 후 man:fsck[8]가 UFS 파일 시스템을 검사할 순서를 결정합니다. 건너뛰어야 하는 파일 시스템은 `passno`가 0으로 설정되어 있어야 합니다. 루트 파일 시스템은 다른 모든 파일 시스템보다 먼저 검사해야 하며 `passno`가 1로 설정되어 있어야 합니다. 다른 파일 시스템은 1보다 큰 값으로 설정해야 합니다. 만약 둘 이상의 파일 시스템에 동일한 `passno` 숫자가 들어 있는 경우, man:fsck[8]은 가능하면 해당 파일 시스템들을 병렬로 검사하려고 시도합니다.
ru: Определяет порядок проверки файловых систем UFS с помощью man:fsck[8] после перезагрузки. Файловые системы, которые следует пропускать, должны иметь значение `passno`, равное нулю. Корневая файловая система должна проверяться первой и иметь значение `passno`, равное единице. Остальные файловые системы должны иметь значения больше единицы. Если несколько файловых систем имеют одинаковое значение `passno`, man:fsck[8] попытается проверять их параллельно, если это возможно.

source: Refer to man:fstab[5] for more information on the format of `/etc/fstab` and its options.
ko: `/etc/fstab`의 형식과 옵션에 대한 자세한 내용은 man:fstab[5]을 참조하세요.
ru: См. man:fstab[5] для получения дополнительной информации о формате `/etc/fstab` и его параметрах.

source: Using man:mount[8]
ko: Man:mount[8] 사용하기
ru: Использование man:mount[8]

source: File systems are mounted using man:mount[8]. The most basic syntax is as follows:
ko: 파일 시스템은 man:mount[8]를 사용하여 마운트합니다. 가장 기본적인 구문은 다음과 같습니다:
ru: Файловые системы монтируются с помощью man:mount[8]. Базовая синтаксическая конструкция выглядит следующим образом:

source: A file system listed in `/etc/fstab` can also be mounted by providing just the mountpoint.
ko: `/etc/fstab`에 나열된 파일 시스템도 마운트 포인트만 제공하면 마운트할 수 있습니다.
ru: Файловая система, указанная в `/etc/fstab`, также может быть смонтирована, если указать только точку монтирования.

source: This command provides many options which are described in man:mount[8]. The most commonly used options include:
ko: 이 명령은 man:mount[8]에 설명된 많은 옵션을 제공합니다. 가장 일반적으로 사용되는 옵션은 다음과 같습니다:
ru: Эта команда предоставляет множество опций, которые описаны в man:mount[8]. Наиболее часто используемые опции включают:

source: Mount Options
ko: 마운트 옵션
ru: Параметры монтирования

source: Mount all the file systems listed in `/etc/fstab`, except those marked as "noauto", excluded by the `-t` flag, or those that are already mounted.
ko: `/etc/fstab`에 나열된 모든 파일 시스템(`-t` 플래그로 제외되었거나 "noauto"로 표시된 파일 시스템, 또는 이미 마운트된 파일 시스템은 제외)을 마운트합니다.
ru: Смонтировать все файловые системы, перечисленные в `/etc/fstab`, за исключением тех, которые помечены как "noauto", исключены флагом `-t` или уже смонтированы.

source: Do everything except for the actual mount system call. This option is useful in conjunction with the `-v` flag to determine what man:mount[8] is actually trying to do.
ko: 실제 마운트 시스템 호출을 제외한 모든 작업을 수행합니다. 이 옵션은 `-v` 플래그와 함께 사용하면 man:mount[8]이 실제로 수행하려는 작업을 확인하는 데 유용합니다.
ru: Выполнить все действия, кроме самого системного вызова mount. Эта опция полезна в сочетании с флагом `-v` для определения того, что на самом деле пытается сделать man:mount[8].

source: Force the mount of an unclean file system (dangerous), or the revocation of write access when downgrading a file system's mount status from read-write to read-only.
ko: 깨끗하지 않은(위험한) 파일 시스템을 강제로 마운트하거나, 파일 시스템을 읽기-쓰기에서 읽기 전용으로 다운그레이드하려고 할 때 쓰기 액세스 권한을 강제로 취소합니다.
ru: Принудительно смонтировать поврежденную файловую систему (опасно) или отозвать права на запись при понижении статуса монтирования файловой системы с чтения-записи на только чтение.

source: Mount the file system read-only. This is identical to using `-o ro`.
ko: 파일 시스템을 읽기 전용으로 마운트합니다. 이는 `-o ro`를 사용하는 것과 동일합니다.
ru: Смонтировать файловую систему в режиме только для чтения. Это эквивалентно использованию `-o ro`.

source: ``-t _fstype_``
ru: ``-t _тип_фс_``

source: Mount the specified file system type or mount only file systems of the given type, if `-a` is included. "ufs" is the default file system type.
ko: 지정된 파일 시스템 유형을 마운트하거나 `-a`가 포함된, 지정 유형의 파일 시스템만 마운트합니다. 기본 파일 시스템 유형은 "ufs"입니다.
ru: Смонтировать указанный тип файловой системы или смонтировать только файловые системы данного типа, если включен параметр `-a`. Тип файловой системы "ufs" используется по умолчанию.

source: Update mount options on the file system.
ko: 파일 시스템의 마운트 옵션을 업데이트합니다.
ru: Обновить параметры монтирования файловой системы.

source: Be verbose.
ko: 자세한 설명(verbose).
ru: Выдавать более подробную информацию.

source: Mount the file system read-write.
ko: 파일 시스템 읽기-쓰기를 마운트합니다.
ru: Смонтировать файловую систему в режиме чтения-записи.

source: The following options can be passed to `-o` as a comma-separated list:
ko: 다음 옵션은 쉼표로 구분하여 `-o`에 추가할 수 있습니다:
ru: Следующие параметры могут быть переданы в `-o` в виде списка, разделенного запятыми:

source: Do not interpret setuid or setgid flags on the file system. This is also a useful security option.
ko: 파일 시스템에서 setuid 또는 setgid 플래그를 해석하지 마세요. 이는 유용한 보안 옵션이기도 합니다.
ru: Не интерпретировать флаги setuid или setgid на файловой системе. Это также полезная опция безопасности.

source: Using man:umount[8]
ko: man:umount[8]하기
ru: Использование man:umount[8]

source: To unmount a file system use man:umount[8]. This command takes one parameter which can be a mountpoint, device name, `-a` or `-A`.
ko: 파일 시스템을 마운트 해제하려면 man:umount[8]를 사용합니다. 이 명령은 마운트 지점, 장치 이름, `-a` 또는 `-A`가 될 수 있는 하나의 매개 변수를 필요로 합니다.
ru: Для размонтирования файловой системы используйте man:umount[8]. Эта команда принимает один параметр, которым может быть точка монтирования, имя устройства, `-a` или `-A`.

source: All forms take `-f` to force unmounting, and `-v` for verbosity. Be warned that `-f` is not generally a good idea as it might crash the computer or damage data on the file system.
ko: 모든 명령은 `-f`를 사용하여 마운트를 강제로 해제하거나 `-v`를 사용하여 자세한 설명을 요구할 수 있습니다. 일반적으로 `-f`는 컴퓨터를 충돌시키거나 파일 시스템의 데이터에 손상을 입힐 수 있으므로 사용하지 않는 것이 좋습니다.
ru: Все формы команды принимают параметр `-f` для принудительного размонтирования и `-v` для вывода подробной информации. Учтите, что использование `-f` обычно не рекомендуется, так как это может привести к аварийному завершению работы компьютера или повреждению данных в файловой системе.

source: To unmount all mounted file systems, or just the file system types listed after `-t`, use `-a` or `-A`. Note that `-A` does not attempt to unmount the root file system.
ko: 마운트된 모든 파일 시스템을 해제하거나 뒤에 나열된 특정 파일 시스템 유형만 해제하려면 `-a`, `-A`, 또는 `-t`를 사용합니다. `-A` 옵션을 사용해도 루트 파일 시스템을 마운트 해제하려고 시도하지는 않습니다.
ru: Для размонтирования всех смонтированных файловых систем или только файловых систем указанных после `-t` типов используйте `-a` или `-A`. Обратите внимание, что `-A` не пытается размонтировать корневую файловую систему.

source: Processes and Daemons
ko: 프로세스와 데몬
ru: Процессы и Демоны

source: FreeBSD is a multi-tasking operating system. Each program running at any one time is called a _process_. Every running command starts at least one new process and there are a number of system processes that are run by FreeBSD.
ko: FreeBSD는 멀티태스킹 운영체제입니다. 동시에 실행되고 있는 각각의 프로그램을 우리는 _프로세스_라고 부릅니다. 실행 중인 모든 명령은 적어도 하나의 새로운 프로세스로 시작되며, FreeBSD에서는 시스템에 의해 실행되는 다양한 프로세스가 있습니다.
ru: FreeBSD - это многозадачная операционная система. Каждая программа, выполняемая в любой момент времени, называется _процессом_. Каждая запущенная команда создает как минимум один новый процесс, и в системе FreeBSD выполняется ряд системных процессов.

source: Each process is uniquely identified by a number called a _process ID_ (PID). Similar to files, each process has one owner and group, and the owner and group permissions are used to determine which files and devices the process can open. Most processes also have a parent process that started them. For example, the shell is a process, and any command started in the shell is a process which has the shell as its parent process. The exception is a special process called man:init[8] which is always the first process to start at boot time and which always has a PID of `1`.
ko: 각각의 프로세스는 _process ID_(PID)라는 고유번호로 식별할 수 있습니다. 파일과 마찬가지로 각각의 프로세스에는 하나의 소유자와 그룹이 있으며, 이 소유자 및 그룹 권한은 프로세스가 열 수 있는 파일과 장치를 결정하는 데 사용됩니다. 대부분의 프로세스에는 해당 프로세스를 실행시킨 상위 프로세스가 존재합니다. 예를 들어 셸은 하나의 프로세스이며 셸에서 시작된 모든 명령어는 셸을 부모 프로세스로 갖는 프로세스입니다. 예외로는 부팅 시 항상 가장 먼저 시작되는 man:init[8] 프로세스이며 항상 PID가 '1'인 특수 프로세스입니다.
ru: Каждый процесс однозначно идентифицируется числом, называемым _идентификатором процесса_ (PID). Подобно файлам, каждый процесс имеет владельца и группу, а права владельца и группы используются для определения того, какие файлы и устройства процесс может открыть. Большинство процессов также имеют родительский процесс, который их запустил. Например, оболочка — это процесс, и любая команда, запущенная в оболочке, является процессом, для которого оболочка выступает родительским процессом. Исключением является специальный процесс man:init[8], который всегда запускается первым при загрузке и всегда имеет PID `1`.

source: Some programs are not designed to be run with continuous user input and disconnect from the terminal at the first opportunity. For example, a web server responds to web requests, rather than user input. Mail servers are another example of this type of application. These types of programs are known as _daemons_. The term daemon comes from Greek mythology and represents an entity that is neither good nor evil, and which invisibly performs useful tasks. This is why the BSD mascot is the cheerful-looking daemon with sneakers and a pitchfork.
ko: 일부 프로그램은 지속적인 사용자 입력에 의해 동작하도록 설계되지 않았으며 첫 순간에 터미널로부터 연결이 끊어집니다. 예를 들어 웹 서버는 사용자 입력이 아닌 웹 요청에만 응답합니다. 메일 서버는 이러한 유형의 애플리케이션의 또 다른 예입니다. 이러한 유형의 프로그램을 _데몬_이라고 합니다. 데몬이라는 용어는 그리스 신화에서 유래되었으며, 선하지도 악하지도 않은 존재로 눈에 보이지 않으며 유용한 작업을 수행하는 존재를 말합니다. 이것이 바로 BSD의 마스코트가 운동화를 신고 갈퀴를 든 쾌활한 모습의 데몬인 이유입니다.
ru: Некоторые программы не предназначены для постоянного взаимодействия с пользователем и отключаются от терминала при первой возможности. Например, веб-сервер отвечает на веб-запросы, а не на действия пользователя. Почтовые серверы — ещё один пример таких приложений. Эти программы называются _демонами_. Термин «демон» происходит из греческой мифологии и обозначает сущность, которая не является ни доброй, ни злой и незаметно выполняет полезные задачи. Именно поэтому талисманом BSD стал улыбающийся демон в кроссовках и с вилами.

source: There is a convention to name programs that normally run as daemons with a trailing "d". For example, BIND is the Berkeley Internet Name Domain, but the actual program that executes is `named`. The Apache web server program is `httpd` and the line printer spooling daemon is `lpd`. This is only a naming convention. For example, the main mail daemon for the Sendmail application is `sendmail`, and not `maild`.
ko: 일반적으로 데몬으로 실행되는 프로그램의 이름은 뒤에 "d"를 붙이는 관습이 있습니다. 예를 들어, BIND는 버클리 인터넷 네임 도메인이지만 실제로 실행되는 프로그램은 `named`입니다. 아파치 웹 서버 프로그램은 `httpd`이고 라인 프린터 스풀링 데몬은 `lpd`입니다. 이것은 명명 규칙일 뿐입니다. 예를 들어, Sendmail 애플리케이션의 기본 메일 데몬은 `maild`가 아니라 `sendmail`입니다.
ru: Существует соглашение называть программы, которые обычно работают как демоны, с добавлением буквы "d" в конце. Например, BIND — это Berkeley Internet Name Domain, но фактическая программа, которая выполняется, называется `named`. Веб-сервер Apache называется `httpd`, а демон очереди печати — `lpd`. Это всего лишь соглашение об именовании. Например, основной почтовый демон для приложения Sendmail называется `sendmail`, а не `maild`.

source: Viewing Processes
ko: 프로세스 보기
ru: Просмотр процессов

source: To see the processes running on the system, use man:ps[1] or man:top[1]. To display a static list of the currently running processes, their PIDs, how much memory they are using, and the command they were started with, use man:ps[1]. To display all the running processes and update the display every few seconds in order to interactively see what the computer is doing, use man:top[1].
ko: 시스템에서 실행 중인 프로세스를 보려면 man:ps[1] 또는 man:top[1]을 사용합니다. 현재 실행 중인 프로세스의 정적 목록, 해당 프로세스의 PID, 사용 중인 메모리 양, 프로세스를 시작한 명령을 표시하려면 man:ps[1]을 사용합니다. 실행 중인 모든 프로세스를 표시하고 컴퓨터가 수행 중인 작업을 대화형으로 보기 위해 몇 초마다 디스플레이를 업데이트하려면 man:top[1]을 사용합니다.
ru: Чтобы просмотреть процессы, выполняемые в системе, используйте man:ps[1] или man:top[1]. Для отображения статичного списка текущих процессов, их PID, объема используемой памяти и команд, которыми они были запущены, используйте man:ps[1]. Для отображения всех выполняемых процессов с периодическим обновлением списка каждые несколько секунд, чтобы интерактивно наблюдать за работой компьютера, используйте man:top[1].

source: By default, man:ps[1] only shows the commands that are running and owned by the user. For example:
ko: 기본적으로 man:ps[1]은 실행 중이고 사용자가 소유하고 있는 명령만을 표시합니다. 예를 들어:
ru: По умолчанию man:ps[1] отображает только команды, выполняемые и принадлежащие текущему пользователю. Например:

source: The output from man:ps[1] is organized into a number of columns. The `PID` column displays the process ID. PIDs are assigned starting at 1, go up to 99999, then wrap around back to the beginning. However, a PID is not reassigned if it is already in use. The `TT` column shows the tty the program is running on and `STAT` shows the program's state. `TIME` is the amount of time the program has been running on the CPU. This is usually not the elapsed time since the program was started, as most programs spend a lot of time waiting for things to happen before they need to spend time on the CPU. Finally, `COMMAND` is the command that was used to start the program.
ko: Man:ps[1]의 출력은 여러 열로 구성됩니다. `PID` 열은 프로세스 ID를 표시합니다. PID는 1부터 시작하여 99999까지 할당된 다음 다시 처음으로 감싸집니다. 그러나 이미 사용 중인 PID는 다시 할당되지 않습니다. `TT` 열은 프로그램이 실행 중인 tty를 표시하고 `STAT`는 프로그램의 상태를 표시합니다. `TIME`은 프로그램이 CPU에서 실행된 시간입니다. 이 시간은 대부분의 프로그램이 CPU에서 처리되기 전 기다리는 데 많은 시간을 소비하기 때문에 일반적으로 프로그램이 시작된 후 경과된 시간이 아닙니다. 마지막으로 `COMMAND`는 프로그램을 시작하는 데 사용된 명령어입니다.
ru: Вывод команды man:ps[1] организован в несколько столбцов. В столбце `PID` отображается идентификатор процесса. PID начинаются с 1, достигают 99999, затем снова начинаются с начала. Однако, если PID уже используется, он не будет повторно назначен. Столбец `TT` показывает tty, на котором выполняется программа, а `STAT` отображает состояние программы. `TIME` — это время, в течение которого программа выполнялась на CPU. Обычно это не общее время с момента запуска программы, так как большинство программ проводят много времени в ожидании событий, прежде чем им потребуется время на CPU. Наконец, `COMMAND` — это команда, которая использовалась для запуска программы.

source: A number of different options are available to change the information that is displayed. One of the most useful sets is `auxww`, where `a` displays information about all the running processes of all users, `u` displays the username and memory usage of the process' owner, `x` displays information about daemon processes, and `ww` causes man:ps[1] to display the full command line for each process, rather than truncating it once it gets too long to fit on the screen.
ko: 표시되는 정보를 변경하기 위해 다양한 옵션을 사용할 수 있습니다. 가장 유용한 집합 중 하나는 `auxww`로, `a`는 모든 사용자의 실행 중인 모든 프로세스에 대한 정보를 표시하고, `u`는 프로세스 소유자의 사용자 이름과 메모리 사용량을 표시하며, `x`는 데몬 프로세스에 대한 정보를 표시하고, `ww`는 man:ps[1]가 각 프로세스의 명령줄이 너무 길어 화면에 맞지 않을 때 잘리지 않고 전체 명령줄을 표시하도록 합니다.
ru: Доступно несколько различных опций для изменения отображаемой информации. Один из наиболее полезных наборов — `auxww`, где `a` показывает информацию обо всех запущенных процессах всех пользователей, `u` отображает имя пользователя и использование памяти владельцем процесса, `x` показывает информацию о процессах демонов, а `ww` заставляет man:ps[1] выводить полную командную строку для каждого процесса вместо её обрезки, когда она становится слишком длинной для экрана.

source: The output from man:top[1] is similar:
ko: Man:top[1]의 출력도 비슷합니다:
ru: Вывод команды man:top[1] выглядит аналогично:
