Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/basics/_index.po
Languages: ko, ru

source: Basic commands and functionality of the FreeBSD operating system
ko: FreeBSD 운영체제의 기능과 기본명령
ru: Основные команды и функциональные возможности операционной системы FreeBSD

source: Part I. Getting Started
ko: 파트 I. 시작하기
ru: В начале

source: Chapter 3. FreeBSD Basics
ko: 챕터 3. FreeBSD 기초
ru: Глава 3. Основы FreeBSD

source: FreeBSD Basics
ko: FreeBSD 기초
ru: Основы FreeBSD

source: Synopsis
ko: 요약
ru: Обзор

source: This chapter covers the basic commands and functionality of the FreeBSD operating system. Much of this material is relevant for any UNIX(R)-like operating system. New FreeBSD users are encouraged to read through this chapter carefully.
ko: 이 챕터는 FreeBSD의 기능과 기본 명령어에 대해 설명합니다. 내용의 많은 부분이 UNIX(R)-like 운영체제와 연관되어 있습니다. FreeBSD를 처음 사용하는 사용자분들은 이 챕터를 주의깊게 읽어주세요.
ru: В этой главе рассматриваются основные команды и функциональные возможности операционной системы FreeBSD. Большая часть материала применима к любым UNIX(R)-подобным операционным системам. Новым пользователям FreeBSD рекомендуется внимательно ознакомиться с этой главой.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: How to use and configure virtual consoles.
ko: 가상 콘솔을 설정하고 사용하는 법.
ru: Как использовать и настраивать виртуальные консоли.

source: How to create and manage users and groups on FreeBSD.
ko: FreeBSD에서 사용자 및 그룹을 생성하고 관리하는 법.
ru: Как создавать пользователей и группы пользователей во FreeBSD и управлять ими.

source: How UNIX(R) file permissions and FreeBSD file flags work.
ko: UNIX(R) 파일 권한 및 FreeBSD에서의 파일 권한.
ru: Как работают права доступа на файлы в UNIX® и файловые флаги во FreeBSD.

source: The default FreeBSD file system layout.
ko: FreeBSD의 기본 파일 시스템의 구조.
ru: Иерархию каталогов FreeBSD.

source: The FreeBSD disk organization.
ko: FreeBSD 디스크 구성.
ru: Организация дисков в FreeBSD.

source: How to mount and unmount file systems.
ko: 파일 시스템을 마운트하거나 언마운트하는 법.
ru: Как монтировать и размонтировать файловые системы.

source: What processes, daemons, and signals are.
ko: 프로세스와 데몬, 그리고 시그널(signal)의 의미.
ru: Что такое процессы, демоны и сигналы.

source: What a shell is, and how to change the default login environment.
ko: 쉘(Shell)이 무엇인지와 기본 로그인 환경을 바꾸는 방법.
ru: Что такое оболочка и как изменить среду входа по умолчанию.

source: How to use basic text editors.
ko: 기본 텍스트 에디터를 사용하는 방법.
ru: Как использовать основные текстовые редакторы.

source: What devices and device nodes are.
ko: 디바이스가 무엇이고 디바이스 노드는 무엇인지.
ru: Что такое устройства и узлы устройств.

source: How to read manual pages for more information.
ko: 추가적인 정보를 위해 매뉴얼 페이지를 읽는 법.
ru: Как читать справочные страницы для получения дополнительной информации.

source: Virtual Consoles and Terminals
ko: 가상 콘솔과 터미널
ru: Виртуальные консоли и терминалы

source: Unless FreeBSD has been configured to automatically start a graphical environment during startup, the system will boot into a command line login prompt, as seen in this example:
ko: FreeBSD는 그래픽 환경으로 자동시작이 설정되어 있지 않은 경우, 이 예에서 보듯이 시스템은 명령줄 인터페이스(CLI, Command line interface)로 부팅됩니다:
ru: Если FreeBSD не настроена для автоматического запуска графической среды во время загрузки, система загрузится в командную строку с приглашением для входа, как показано в этом примере:

source: The first line contains some information about the system. The `amd64` indicates that FreeBSD is running on a 64-bit x86 system. The hostname is `pc3.example.org`, and `ttyv0` indicates that this is the "system console". The second line is the login prompt.
ru: Первая строка содержит некоторую информацию о системе. `amd64` указывает, что FreeBSD работает на 64-битной x86 системе. Имя хоста — `pc3.example.org`, а `ttyv0` означает, что это «системная консоль». Вторая строка — это приглашение для входа в систему.

source: Since FreeBSD is a multiuser system, it needs some way to distinguish between different users. This is accomplished by requiring every user to log into the system before gaining access to the programs on the system. Every user has a unique "username" and a personal "password".
ko: FreeBSD는 다중 사용자 시스템이므로 사용자를 구별할 수 있는 방법이 필요합니다. 이 방법으로 모든 사용자는 시스템의 프로그램에 액세스하기 전에 로그인을 해야 합니다. 모든 사용자는 고유한 "사용자 이름"과 개인 "비밀번호"를 가집니다.
ru: Поскольку FreeBSD — это многопользовательская система, требуется способ различать пользователей. Для этого необходимо, чтобы каждый пользователь вошел в систему перед получением доступа к программам. У каждого пользователя есть уникальное «имя пользователя» и личный «пароль».

source: To log into the system console, type the username that was configured during system installation, as described in crossref:bsdinstall[bsdinstall-addusers,Add Users], and press kbd:[Enter]. Then enter the password associated with the username and press kbd:[Enter]. The password is _not echoed_ for security reasons.
ko: 시스템 콘솔에 로그인하려면 crossref:bsdinstall[bsdinstall-addusers, Add Users]의 설명에 따라 시스템 설치 중 설정한 사용자 이름을 입력하고 kbd:[Enter]를 칩니다. 그런 다음 사용자 이름과 연결된 암호를 입력하고 kbd:[Enter]를 칩니다. 보안상의 이유로 _암호는 보여지지 않습니다_.
ru: Для входа в системную консоль введите имя пользователя, заданное при установке системы, как описано в crossref:bsdinstall[bsdinstall-addusers,Добавление пользователей], и нажмите kbd:[Enter]. Затем введите пароль, связанный с этим именем пользователя, и нажмите kbd:[Enter]. Пароль _не отображается_ в целях безопасности.

source: Once the correct password is input, the message of the day (MOTD) will be displayed followed by a command prompt. Depending upon the shell that was selected when the user was created, this prompt will be a `+#+`, `$`, or `%` character. The prompt indicates that the user is now logged into the FreeBSD system console and ready to try the available commands.
ko: 올바른 암호를 입력 했다면 명령 프롬프트에 오늘의 메시지(MOTD)가 표시됩니다. 사용자가 생성될 때 선택한 셸에 따라 프롬프트에 `+#+`, `$`, 또는 `%` 문자가 표시됩니다. 이 프롬프트는 이제 사용자가 FreeBSD에 로그인했으며 명령어를 사용할 준비가 되었다는 뜻입니다.
ru: После ввода правильного пароля будет отображено сообщение дня (MOTD), за которым последует приглашение командной строки. В зависимости от выбранной оболочки при создании пользователя, это приглашение может быть символом `+#+`, `$` или `%`. Приглашение указывает, что пользователь теперь вошел в консоль системы FreeBSD и готов попробовать доступные команды.

source: Virtual Consoles
ko: 가상 콘솔
ru: Виртуальные консоли

source: While the system console can be used to interact with the system, a user working from the command line at the keyboard of a FreeBSD system will typically instead log into a virtual console. This is because system messages are configured by default to display on the system console. These messages will appear over the command or file that the user is working on, making it difficult to concentrate on the work at hand.
ko: 시스템 콘솔이 시스템과 상호작용을 하는 동안, 사용자는 일반적으로 가상 콘솔에 로그인하여 FreeBSD 시스템에 키보드로 명령을 입력하며 사용합니다. 이것은 시스템 메시지가 기본적으로 시스템 콘솔에 표시되도록 설정되어 있기 때문입니다. 이러한 메시지는 사용자가 작업중인 명령이나 파일의 위에 나타나므로 작업에 집중하기가 어렵습니다.
ru: Хотя системную консоль можно использовать для взаимодействия с системой, пользователь, работающий из командной строки на клавиатуре FreeBSD, обычно вместо этого входит в виртуальную консоль. Это связано с тем, что системные сообщения по умолчанию настроены на отображение на системной консоли. Эти сообщения будут появляться поверх команды или файла, с которыми работает пользователь, что затрудняет концентрацию на текущей задаче.

source: By default, FreeBSD is configured to provide several virtual consoles for inputting commands. Each virtual console has its own login prompt and shell and it is easy to switch between virtual consoles. This essentially provides the command line equivalent of having several windows open at the same time in a graphical environment.
ko: 기본적으로 FreeBSD는 명령어 입력을 위해 위한 다수의 가상 콘솔을 제공하도록 설정되어 있습니다. 각 가상 콘솔에는 고유한 로그인 프롬프트와 셸이 있으며 가상 콘솔 간에 쉽게 전환할 수 있습니다. 이런 방식은 사용자에게 그래픽 환경 하에서 동시에 여러 개의 창을 여는 것과 동등한 환경을 제공합니다.
ru: По умолчанию FreeBSD настроена для предоставления нескольких виртуальных консолей для ввода команд. Каждая виртуальная консоль имеет собственную приглашение для входа и оболочку, и переключение между виртуальными консолями осуществляется легко. Это, по сути, предоставляет эквивалент командной строки для одновременного открытия нескольких окон в графической среде.

source: The key combinations kbd:[Alt+F1] through kbd:[Alt+F8] have been reserved by FreeBSD for switching between virtual consoles. Use kbd:[Alt+F1] to switch to the system console (`ttyv0`), kbd:[Alt+F2] to access the first virtual console (`ttyv1`), kbd:[Alt+F3] to access the second virtual console (`ttyv2`), and so on. When using Xorg as a graphical console, the combination becomes kbd:[Ctrl+Alt+F1] to return to a text-based virtual console.
ko: 가상 콘솔간의 전환을 위해 FreeBSD에서는 kbd:[Alt+F1]에서 kbd:[Alt+F8]까지의 키 조합을 미리 예약해 두었습니다. kbd:[Alt+F1]을 누르면 시스템 콘솔(`ttyv0`), kbd:[Alt+F2]는 `ttyv1`, kbd:[Alt+F3]은 `ttyv2`등으로 전환이 가능합니다. 그래픽 콘솔로 Xorg를 사용할 때에는, kbd:[Ctrl+Alt+F1]을 누르면 텍스트 기반의 가상 콘솔로 돌아갈 수 있습니다.
ru: Сочетания клавиш kbd:[Alt+F1] — kbd:[Alt+F8] зарезервированы в FreeBSD для переключения между виртуальными консолями. Используйте kbd:[Alt+F1] для перехода к системной консоли (`ttyv0`), kbd:[Alt+F2] для доступа к первой виртуальной консоли (`ttyv1`), kbd:[Alt+F3] для доступа ко второй виртуальной консоли (`ttyv2`) и так далее. При использовании Xorg в качестве графической консоли для возврата к текстовой виртуальной консоли используется сочетание kbd:[Ctrl+Alt+F1].

source: When switching from one console to the next, FreeBSD manages the screen output. The result is an illusion of having multiple virtual screens and keyboards that can be used to type commands for FreeBSD to run. The programs that are launched in one virtual console do not stop running when the user switches to a different virtual console.
ko: 한 콘솔에서 다른 콘솔로 전환을 하면 FreeBSD는 화면을 바꿔서 표시해 줍니다. 그 결과 FreeBSD에서 작업을 할 때 마치 여러 화면과 키보드가 있는 것처럼 느껴지게 됩니다. 한 가상 콘솔에서 실행중인 프로그램은 사용자가 다른 가상 콘솔로 전환해도 실행이 중지되지 않습니다.
ru: При переключении с одной консоли на другую FreeBSD управляет выводом на экран. В результате создаётся иллюзия наличия нескольких виртуальных экранов и клавиатур, которые можно использовать для ввода команд на выполнение в FreeBSD. Программы, запущенные в одной виртуальной консоли, продолжают работать при переключении пользователя на другую виртуальную консоль.

source: Refer to man:kbdcontrol[1], man:vidcontrol[1], man:atkbd[4], man:syscons[4], and man:vt[4] for a more technical description of the FreeBSD console and its keyboard drivers.
ko: FreeBSD 콘솔의 보다 기술적인 부분과 키보드 드라이버 정보가 필요하시다면 man:kbdcontrol[1], man:vidcontrol[1], man:atkbd[4], man:syscons[4], 그리고 man:vt[4]를 참조해 주세요.
ru: Обратитесь к man:kbdcontrol[1], man:vidcontrol[1], man:atkbd[4], man:syscons[4] и man:vt[4] для более технического описания консоли FreeBSD и её драйверов клавиатуры.

source: In FreeBSD, the number of available virtual consoles is configured in this section of `/etc/ttys`:
ko: FreeBSD에서 사용 가능한 콘솔의 수는 `/etc/ttys`에서 설정할 수 있습니다:
ru: В FreeBSD количество доступных виртуальных консолей настраивается в этом разделе `/etc/ttys`:

source: To disable a virtual console, put a comment symbol (`+#+`) at the beginning of the line representing that virtual console. For example, to reduce the number of available virtual consoles from eight to four, put a `+#+` in front of the last four lines representing virtual consoles `ttyv5` through `ttyv8`. _Do not_ comment out the line for the system console `ttyv0`. Note that the last virtual console (`ttyv8`) is used to access the graphical environment if Xorg has been installed and configured as described in crossref:x11[x11,The X Window System].
ko: 가상 콘솔을 사용하지 않도록 설정하려면 설정의 가상 콘솔을 나타내는 줄 시작 부분에 `+#+`를 입력합니다. 예를 들어 사용 가능한 가상 콘솔의 수를 8개에서 4개로 줄이려면, 가상 콘솔 `ttyv5`에서 `ttyv8`을 나타내는 마지막 네 줄의 앞에 `+#+`를 붙입니다. 절대로 시스템 콘솔 `ttyv0`의 행을 _주석 처리하지_ 마십시오. crossref:x11[x11, The X Window System]에 설명된 대로 Xorg를 설치한 경우 마지막 가상 콘솔(`ttyv8`)이 그래픽 환경에 액세스하는 데 사용됩니다.
ru: Чтобы отключить виртуальную консоль, поставьте символ комментария (`+#+`) в начале строки, соответствующей этой виртуальной консоли. Например, чтобы уменьшить количество доступных виртуальных консолей с восьми до четырёх, добавьте `+#+` перед последними четырьмя строками, представляющими виртуальные консоли `ttyv5` до `ttyv8`. _Не_ комментируйте строку системной консоли `ttyv0`. Обратите внимание, что последняя виртуальная консоль (`ttyv8`) используется для доступа к графической среде, если Xorg установлен и настроен, как описано в crossref:x11[x11,Система X Window].

source: For a detailed description of every column in this file and the available options for the virtual consoles, refer to man:ttys[5].
ko: 가상 콘솔의 사용가능한 옵션과 파일의 각각의 의미에 대한 추가적인 설명은 man:ttys[5]를 참조하세요.
ru: Для подробного описания каждой колонки в этом файле и доступных опций для виртуальных консолей обратитесь к man:ttys[5].

source: Single User Mode
ko: 단일 사용자 모드(Single User Mode)
ru: Однопользовательский режим

source: The FreeBSD boot menu provides an option labelled as "Boot Single User". If this option is selected, the system will boot into a special mode known as "single user mode". This mode is typically used to repair a system that will not boot or to reset the `root` password when it is not known. While in single user mode, networking and other virtual consoles are not available. However, full `root` access to the system is available, and by default, the `root` password is not needed. For these reasons, physical access to the keyboard is needed to boot into this mode and determining who has physical access to the keyboard is something to consider when securing a FreeBSD system.
ko: FreeBSD 부팅 메뉴에는 "단일 사용자 부팅"이라고 표시된 옵션이 있습니다. 이 옵션을 선택하면 시스템이 "단일 사용자 모드"로 알려진 특수 모드로 부팅됩니다. 이 모드는 일반적으로 부팅되지 않는 시스템을 복구하거나 `root` 암호를 알 수 없을 때 암호를 재설정하는 데에 사용됩니다. 단일 사용자 모드에서는 네트워킹 및 기타 가상 콘솔을 사용할 수 없습니다. 그러나 시스템에 대한 전체 `root` 액세스는 가능하며 기본적으로 `root` 암호는 필요하지 않습니다. 이러한 이유로, 이 모드로 부팅하려면 물리적 키보드를 직접 사용할 수 있어야 하며, 누가 이 키보드에 접근할 수 있는지를 결정하는 것은 FreeBSD 시스템을 보호할 때 고려해야 할 사항입니다.
ru: В меню загрузки FreeBSD есть пункт с названием "Boot Single User". При выборе этого пункта система загрузится в особый режим, известный как "однопользовательский режим". Этот режим обычно используется для восстановления системы, которая не загружается, или для сброса пароля `root`, если он неизвестен. В однопользовательском режиме сеть и другие виртуальные консоли недоступны. Однако предоставляется полный доступ `root` к системе, и по умолчанию пароль `root` не требуется. По этим причинам для загрузки в этом режиме необходим физический доступ к клавиатуре, и определение того, кто имеет такой доступ, является важным аспектом обеспечения безопасности системы FreeBSD.

source: The settings which control single user mode are found in this section of `/etc/ttys`:
ko: 단일 사용자 모드를 제어하는 설정은 `/etc/ttys`의 섹션에서 찾을 수 있습니다:
ru: Настройки, управляющие однопользовательским режимом, находятся в этом разделе файла `/etc/ttys`:

source: By default, the status is set to `secure`. This assumes that who has physical access to the keyboard is either not important or it is controlled by a physical security policy. If this setting is changed to `insecure`, the assumption is that the environment itself is insecure because anyone can access the keyboard. When this line is changed to `insecure`, FreeBSD will prompt for the `root` password when a user selects to boot into single user mode.
ko: 기본적으로 상태는 `secure`로 설정되어 있습니다. 이는 키보드에 물리적으로 액세스할 수 있는 사람이 중요하지 않거나 물리적 보안 정책에 의해 관리되고 있다고 가정합니다. 이 설정을 `insecure`로 변경하면 누구나 키보드에 액세스할 수 있으므로 안전하지 않은 환경이라고 가정합니다. 이 줄을 `insecure`로 변경하면, 사용자가 단일 사용자 모드로 부팅하도록 선택했을때 FreeBSD는 `root` 암호를 묻는 메시지를 표시합니다.
ru: По умолчанию статус установлен в `secure`. Это предполагает, что тот, кто имеет физический доступ к клавиатуре, либо не важен, либо контролируется политикой физической безопасности. Если этот параметр изменён на `insecure`, предполагается, что среда сама по себе небезопасна, так как любой может получить доступ к клавиатуре. При изменении этой строки на `insecure` FreeBSD будет запрашивать пароль `root`, когда пользователь выбирает загрузку в однопользовательском режиме.

source: _Be careful when changing this setting to `insecure`!_ If the `root` password is forgotten, booting into single user mode is still possible, but may be difficult for someone who is not familiar with the FreeBSD booting process.
ko: _이 설정을 `insecure`로 변경할 때 주의하세요!_ `root` 암호를 잊어버린 경우에도 단일 사용자 모드로 부팅할 수 있지만, FreeBSD 부팅 프로세스에 익숙하지 않은 사람에게는 어려울 수 있습니다.
ru: _Будьте осторожны при изменении этой настройки на `insecure`!_ Если пароль `root` забыт, загрузка в однопользовательском режиме всё ещё возможна, но может быть затруднительна для тех, кто не знаком с процессом загрузки FreeBSD.

source: Changing Console Video Modes
ko: 콘솔 비디오 모드로 변경하기
ru: Изменение видеорежимов консоли

source: The FreeBSD console default video mode may be adjusted to 1024x768, 1280x1024, or any other size supported by the graphics chip and monitor. To use a different video mode load the `VESA` module:
ko: FreeBSD 콘솔의 기본 비디오 모드는 1024x768, 1280x1024 또는 그래픽 칩과 모니터에서 지원하는 다른 해상도로 조정됩니다. 이 외의 비디오 모드를 사용하려면 `VESA` 모듈을 로드합니다:
ru: Режим видео по умолчанию в консоли FreeBSD может быть изменён на 1024x768, 1280x1024 или любой другой, поддерживаемый графическим чипом и монитором. Для использования другого видео режима загрузите модуль `VESA`:

source: To determine which video modes are supported by the hardware, use man:vidcontrol[1]. To get a list of supported video modes issue the following:
ko: 하드웨어에서 지원되는 비디오 모드를 확인하려면 man:vidcontrol[1]을 사용하세요. 지원되는 비디오 모드 목록을 얻으려면 다음을 실행하세요:
ru: Для определения видеорежимов, поддерживаемых оборудованием, используйте man:vidcontrol[1]. Чтобы получить список поддерживаемых видеорежимов, выполните следующую команду:

source: The output of this command lists the video modes that are supported by the hardware. To select a new video mode, specify the mode using man:vidcontrol[1] as the `root` user:
ko: 이 명령은 하드웨어에서 지원하는 비디오 모드를 출력합니다. 새 비디오 모드를 선택하려면 `root` 사용자로 man:vidcontrol[1]을 사용하여 모드를 지정합니다:
ru: Результат выполнения этой команды выводит список видеорежимов, поддерживаемых оборудованием. Чтобы выбрать новый видеорежим, укажите режим с помощью man:vidcontrol[1] от имени пользователя `root`:

source: If the new video mode is acceptable, it can be permanently set on boot by adding it to `/etc/rc.conf`:
ko: 새 비디오 모드를 사용할 수 있는 경우 `/etc/rc.conf`에 추가하여 부팅 시 영구적으로 변경할 수 있습니다:
ru: Если новый видео-режим приемлем, его можно установить постоянным при загрузке, добавив в `/etc/rc.conf`:

source: Users and Basic Account Management
ko: 사용자와 기본적인 계정관리
ru: Пользователи и базовая настройка учетных записей

source: FreeBSD allows multiple users to use the computer at the same time. While only one user can sit in front of the screen and use the keyboard at any one time, any number of users can log in to the system through the network. To use the system, each user should have their own user account.
ko: FreeBSD에서는 여러 사용자가 동시에 컴퓨터를 사용할 수 있습니다. 한 번에 한 명의 사용자만 화면 앞에 앉아 키보드를 사용할 수 있지만, 네트워크를 통해 얼마든지 많은 사용자가 시스템에 로그인할 수 있습니다. 시스템을 사용하려면 각각 사용자는 고유한 사용자 계정을 가지고 있어야 합니다.
ru: FreeBSD позволяет нескольким пользователям одновременно работать на компьютере. Хотя только один пользователь может находиться перед экраном и использовать клавиатуру в любой момент времени, любое количество пользователей может войти в систему через сеть. Для использования системы каждый пользователь должен иметь свою собственную учетную запись.

source: This chapter describes:
ko: 이 챕터는 다음을 설명합니다:
ru: Эта глава описывает:

source: The different types of user accounts on a FreeBSD system.
ko: FreeBSD 시스템의 다양한 사용자 계정 유형.
ru: Типы учетных записей пользователей в системе FreeBSD.

source: How to add, remove, and modify user accounts.
ko: 사용자 계정을 추가, 삭제, 수정하는 방법.
ru: Как добавлять, удалять и изменять учетные записи пользователей.

source: How to set limits to control the resources that users and groups are allowed to access.
ko: 사용자 및 그룹이 사용할 수 있는 리소스를 제한하기 위한 설정방법.
ru: Как установить ограничения для контроля ресурсов, доступных пользователям и группам.

source: How to create groups and add users as members of a group.
ko: 그룹을 생성하는 방법과 그룹에 사용자를 추가하는 방법.
ru: Как создавать группы и добавлять пользователей в качестве членов группы.

source: Account Types
ko: 계정 타입
ru: Типы учетных записей

source: Since all access to the FreeBSD system is achieved using accounts and all processes are run by users, user and account management is important.
ko: FreeBSD시스템에 대한 모든 액세스는 계정을 통해 이루어지고 모든 프로세스는 사용자에 의해 실행되기 때문에, 사용자 및 계정 관리가 중요합니다.
ru: Поскольку весь доступ к системе FreeBSD осуществляется с использованием учетных записей, а все процессы выполняются пользователями, управление пользователями и учетными записями является важным.

source: There are three main types of accounts: system accounts, user accounts, and the superuser account.
ko: 계정에는 시스템 계정(system accounts), 사용자 계정(user accounts), 수퍼유저 계정(superuser account)의 세 가지 유형이 있습니다.
ru: Существует три основных типа учетных записей: системные учетные записи, пользовательские учетные записи и учетная запись суперпользователя.

source: System Accounts
ko: 시스템 계정
ru: Системные учетные записи

source: System accounts are used to run services such as DNS, mail, and web servers. The reason for this is security; if all services ran as the superuser, they could act without restriction.
ko: 시스템 계정은 DNS, 메일, 웹 서버와 같은 서비스를 실행하는 데 사용됩니다. 만약 모든 서비스가 수퍼유저로 실행되면 아무 제한 없이 동작할 수 있기 때문에 보안상의 이유로 계정이 존재합니다.
ru: Системные учетные записи используются для запуска служб, таких как DNS, почтовые и веб-серверы. Причина этого — безопасность: если бы все службы работали от имени суперпользователя, они могли бы действовать без ограничений.

source: Examples of system accounts are `daemon`, `operator`, `bind`, `news`, and `www`.
ko: 시스템 계정의 예로는 `daemon`,`operator`,`bind`,`news`,`www`가 있습니다.
ru: Примеры системных учетных записей: `daemon`, `operator`, `bind`, `news` и `www`.

source: `nobody` is the generic unprivileged system account. However, the more services that use `nobody`, the more files and processes that user will become associated with, and hence the more privileged that user becomes.
ko: `nobody`는 권한이 없는 일반적인(제너릭) 시스템 계정입니다. 그러나 `nobody` 계정을 사용하는 서비스가 많아질수록 `nobody` 사용자가 관여하는 파일과 프로세스가 많아지므로, 해당 사용자(`nobody`)는 더 많은 권한을 획득하게 됩니다.
ru: `nobody` — это общая непривилегированная системная учётная запись. Однако чем больше сервисов используют `nobody`, тем больше файлов и процессов будут связаны с этим пользователем, и, следовательно, тем больше привилегий он получит.

source: User Accounts
ko: 사용자 계정
ru: Пользовательские учетные записи

source: User accounts are assigned to real people and are used to log in and use the system. Every person accessing the system should have a unique user account. This allows the administrator to find out who is doing what and prevents users from clobbering the settings of other users.
ko: 사용자 계정은 실제 사람에게 할당되며 시스템에 로그인하고 사용하는 데 사용됩니다. 시스템에 액세스하는 모든 사람은 고유한 사용자 계정을 가져야 합니다. 이를 통해 관리자는 누가 어떤 작업을 하는지 파악할 수 있고 사용자가 다른 사용자의 설정을 변경하는 것을 방지할 수 있습니다.
ru: Пользовательские учетные записи назначаются реальным людям и используются для входа в систему и работы с ней. Каждый человек, получающий доступ к системе, должен иметь уникальную учетную запись. Это позволяет администратору отслеживать, кто и что делает, и предотвращает возможность изменения пользователями настроек друг друга.

source: Each user can set up their own environment to accommodate their use of the system, by configuring their default shell, editor, key bindings, and language settings.
ko: 각 사용자는 기본 쉘, 편집기, 단축기(key binding) 및 언어 설정을 구성하여 자신에게 맞게 시스템 환경을 설정할 수 있습니다.
ru: Каждый пользователь может настроить свою собственную среду для удобной работы с системой, изменив настройки оболочки по умолчанию, редактора, сочетаний клавиш и языковых параметров.
