<!--
	Problem Report Handling Guidelines
	The FreeBSD Project - http://www.FreeBSD.org
	The FreeBSD French Documentation Project

	$FreeBSD$
	$Id: article.sgml,v 1.5 2002-12-11 16:24:29 gioria Exp $
	Original revision: 1.8
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR"> %abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR"> %artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN"> %man;
]>

<article lang="fr">
  <!-- :START of Article Metadata -->
  <articleinfo>
    <title>Directives d'utilisation des rapports de bogues</title>

    <pubdate>$FreeBSD$</pubdate>

    <abstract>
      <para>Ces directives d&eacute;crivent les pratiques 
	recommand&eacute;es d'utilisation des rapports de bogues de 
	FreeBSD (PRs - &ldquo;Problem Reports&rdquo;).  Bien que 
	d&eacute;velopp&eacute;es pour l'&eacute;quipe de maintenance 
	de la base de donn&eacute;es PR de FreeBSD
	<email>freebsd-bugbusters@FreeBSD.org</email>, ces directives
	devraient &ecirc;tre suivies par toute personne travaillant 
	avec les rapports de bogues de FreeBSD.</para>
	&abstract.license;
	&abstract.disclaimer;
	&trans.a.fonvieille;
    </abstract>

    <authorgroup>
      <author>
	<firstname>Dag-Erling</firstname>
	<surname>Sm&oslash;rgrav</surname>
      </author>

      <author>
	<firstname>Hiten</firstname>
	<surname>Pandya</surname>
      </author>
    </authorgroup>
  </articleinfo>
  <!-- :END of Article Metadata-->

  <section>
    <title>Introduction</title>

    <para>GNATS est un syst&egrave;me de gestion des d&eacute;fauts 
      (rapport de bogue) utilis&eacute; par le projet FreeBSD.  Comme 
      le suivi pr&eacute;cis des d&eacute;fauts logiciels en suspens 
      est important pour le processus de qualit&eacute;, une utilisation 
      correcte de GNATS est essentielle pour l'avanc&eacute;e du 
      Projet.</para>

    <para>Un acc&egrave;s &agrave; GNATS est fourni aux 
      d&eacute;veloppeurs de FreeBSD aussi bien qu'&agrave; la 
      communaut&eacute;.  Afin de maintenir la coh&eacute;rence de la
      base de donn&eacute;es et fournir une exp&eacute;rience uniforme 
      d'utilisateur, des directives ont &eacute;t&eacute; 
      &eacute;tablies couvrant les aspects courants de la gestion de 
      bogue comme la pr&eacute;sentation des requ&ecirc;tes de suivi,
      de fermeture et ainsi de suite.</para>
  </section>

  <section>
    <title>Le cycle de vie d'un rapport de bogue</title>

    <itemizedlist>
      <listitem>
	<para>L'auteur soumet un rapport de bogue (&ldquo;PR&rdquo;) et
	  re&ccedil;oit un message de confirmation la plupart du temps
          via &man.send-pr.1; ou la page Web de rapport des bogues à 
          <ulink url="http://www.FreeBSD.org/send-pr.html">
          http://www.FreeBSD.org/send-pr.html</ulink>.</para>

      </listitem>

      <listitem>
	<para>Joe Random Committer s'int&eacute;resse au PR et se 
	  l'assigne, ou Jane Random BugBuster d&eacute;cide que Joe est 
	  le plus comp&eacute;tent pour s'en occuper et le lui 
	  assigne.</para>
      </listitem>

      <listitem>
	<para>Joe a un bref &eacute;change avec l'auteur (s'assurant que 
	  que cela ira dans le rapport d'audit) et d&eacute;termine la 
	  cause du probl&egrave;me.  Il s'assure ensuite que la cause du 
	  probl&egrave;me est document&eacute;e dans le rapport d'audit, 
	  et positionne l'&eacute;tat du rapport de bogue sur 
	  &ldquo;analys&eacute;&rdquo; (&ldquo;analysed&rdquo;).</para>
      </listitem>

      <listitem>
	<para>Joe passe une nuit blanche &agrave; travailler et produit 
	  un correctif dont il pense qu'il corrigera le probl&egrave;me, 
	  et le soumet dans le suivi du rapport, demandant &agrave; son 
	  auteur de le tester.  Il fixe ensuite l'&eacute;tat du rapport 
	  de bogue sur &ldquo;retour&rdquo; (&ldquo;feeback&rdquo;).</para>
      </listitem>

      <listitem>
	<para>Quelques &eacute;changes plus tard, Joe et l'auteur sont
	  satisfaits du correctif, et Joe l'int&egrave;gre &agrave; la 
	  branche <literal>-CURRENT</literal> (ou directement &agrave; 
	  la branche <literal>-STABLE</literal> si le probl&egrave;me 
	  n'existe pas sur la branche <literal>-CURRENT</literal>), 
	  s'assurant de bien faire r&eacute;f&eacute;rence au rapport 
	  de bogue dans le commentaire de son &ldquo;commit&rdquo; (et 
	  cr&eacute;ditant l'auteur s'il a soumis tout ou une partie du 
	  correctif) et, si appropri&eacute;, commence le
	  d&eacute;compte de l'int&eacute;gration dans la branche
	  <literal>-STABLE</literal> (&ldquo;MFC&rdquo;).
      </listitem>

      <listitem>
	<para>Si le correctif ne n&eacute;cessite pas 
	  d'int&eacute;gration, Joe ferme alors le PR.</para>
      </listitem>

      <listitem>
	<para>Si le correctif n&eacute;cessite une int&eacute;gration, 
	  Joe laisse le rapport de bogue dans l'&eacute;tat 
	  &ldquo;corrig&eacute;&rdquo; (&ldquo;patched&rdquo;) 
	  jusqu'&agrave; ce que le correctif soit
	  int&eacute;gr&eacute;, et puis le ferme.</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>Beaucoup de PRs sont soumis avec tr&egrave;s peu 
	d'information sur le probl&egrave;me, et certains sont soit 
	tr&egrave;s complexes &agrave; r&eacute;soudre, soit effleurent 
	juste un probl&egrave;me bien plus important; dans ces
	cas, il est vraiment important d'obtenir toute l'information
	n&eacute;cessaire &agrave; la r&eacute;solution du 
	probl&egrave;me.  Si le probl&egrave;me d&eacute;crit
	par le rapport ne peut &ecirc;tre r&eacute;solu, ou s'est 
	reproduit, il est n&eacute;cessaire de rouvrir 
	le PR.</para>
    </note>
    <note>
      <para>L'adresse &eacute;lectronique utilis&eacute;e dans le 
	rapport de bogue pourrait ne pas pouvoir recevoir de courrier.  
	Dans ce cas, faites le suivi du PR comme &agrave; 
	l'accoutum&eacute; et demandez &agrave; l'auteur (dans le 
	message de suivi) de fournir une adresse
	&eacute;lectronique fonctionnant.  C'est habituellement le cas 
	quand &man.send-pr.1; est utilis&eacute; depuis un syst&egrave;me 
	ayant la gestion du courrier d&eacute;sactiv&eacute;e ou non 
	install&eacute;e.</para>
    </note>
  </section>

  <section>
    <title>Etat du rapport de bogue</title>

    <para>Il est important de maintenir &agrave; jour l'&eacute;tat d'un 
      PR quand des mesures ont &eacute;t&eacute; prises.  L'&eacute;tat 
      devrait refl&eacute;ter exactement l'&eacute;tat
      actuel du travail sur le rapport de bogue.</para>

    <example>
      <title>Un petit exemple sur le changement de l'&eacute;tat
      d'un PR</title>

      <para>Quand un PR a &eacute;t&eacute; &eacute;tudi&eacute; et que 
	le(s) d&eacute;veloppeur(s) responsable(s) se sent(ent) 
	satisfait(s) du correctif, ils soumettront un suivi au rapport 
	de bogue et changeront l'&eacute;tat en &ldquo;retour&rdquo; 
	(&ldquo;feedback&rdquo;).  A ce moment-l&agrave;
	l'auteur du rapport devrait &eacute;valuer le correctif dans son
	contexte et r&eacute;pondre en indiquant si le d&eacute;faut a 
	&eacute;t&eacute; en effet corrig&eacute;.</para>
    </example>

    <para>Un rapport de bogue peut &ecirc;tre dans un des &eacute;tats
      suivants:</para>

    <glosslist>
      <glossentry>
	<glossterm>open - &ldquo;ouvert&rdquo;</glossterm>
	<glossdef>
	  <para>Etat initial, le probl&egrave;me a &eacute;t&eacute; 
	    constat&eacute; et il a besoin d'&ecirc;tre pass&eacute; 
	    en revue.</para>
	</glossdef>
      </glossentry>

      <glossentry>
	<glossterm>analyzed - &ldquo;analys&eacute;&rdquo;</glossterm>
	<glossdef>
	  <para>Le probl&egrave;me a &eacute;t&eacute; pass&eacute; en 
	    revue et une solution est cherch&eacute;e.</para>
	</glossdef>
      </glossentry>

      <glossentry>
	<glossterm>feedback - &ldquo;retour&rdquo;</glossterm>
	<glossdef>
	  <para>Un travail plus approfondi exige une information
	    suppl&eacute;mentaire de la part de l'auteur ou de la 
	    communaut&eacute;, probablement de l'information concernant 
	    la solution propos&eacute;e.</para>
	</glossdef>
      </glossentry>

      <glossentry>
	<glossterm>patched - &ldquo;corrig&eacute;&rdquo;</glossterm>
	<glossdef>
	  <para>Un correctif a &eacute;t&eacute; commis, mais quelques 
	    probl&egrave;mes (&ldquo;MFC&rdquo;, ou peut &ecirc;tre une 
	    confirmation de l'auteur) sont encore en suspens.</para>
	</glossdef>
      </glossentry>

      <glossentry>
	<glossterm>suspended - &ldquo;suspendu&rdquo;</glossterm>
	<glossdef>
	  <para>Personne ne travaille sur le probl&egrave;me, en raison 
	    d'un manque d'information ou de ressources.  C'est le premier
	    candidat pour quelqu'un qui recherche un projet pour
	    travailler dessus.  Si le probl&egrave;me ne peut &ecirc;tre 
	    r&eacute;solu, il sera ferm&eacute;, plut&ocirc;t que 
	    suspendu. Le projet de documentation utilise 
	    &ldquo;suspendu&rdquo; pour les &eacute;l&eacute;ments qui
	    n&eacute;cessitent une quantit&eacute; significative de 
	    travail pour laquelle personne n'a actuellement le temps.</para>
	</glossdef>
      </glossentry>

      <glossentry>
	<glossterm>closed - &ldquo;ferm&eacute;&rdquo;</glossterm>
	<glossdef>
	  <para>Un rapport de probl&egrave;me est ferm&eacute; quand 
	    tous les changements ont &eacute;t&eacute; 
	    int&eacute;gr&eacute;s, document&eacute;s, et test&eacute;s, 
	    ou quand la correction du probl&egrave;me est 
	    abandonn&eacute;e.</para>
	</glossdef>
      </glossentry>
    </glosslist>

    <note>
      <para>L'&eacute;tat &ldquo;corrig&eacute;&rdquo; est directement 
	li&eacute; au retour, vous pouvez donc directement passer en
        état &ldquo;ferm&eacute;&rdquo;, si l'auteur ne peut tester le correctif, 
	et &eacute;tant donn&eacute; que cela fonctionne.</para>
    </note>
  </section>

  <section>
    <title>Types de rapport de bogues</title>

    <section>
      <title>PRs assign&eacute;s</title>

      <para>Si un PR a son champ <literal>responsible</literal> 
	compl&eacute;t&eacute; avec le nom d'utilisateur d'un 
	d&eacute;veloppeur FreeBSD, cela signifie que le PR a 
	&eacute;t&eacute; confi&eacute; &agrave; cette personne pour
	davantage de travail.</para>

      <para>Les PRs assign&eacute;s ne devraient pas &ecirc;tre 
	touch&eacute;s par n'importe qui mais par la personne 
	d&eacute;sign&eacute;e.  Si vous avez des commentaires, soumettez 
	un message de suivi.  Si pour une raison ou une autre vous pensez 
	que le PR devrait &ecirc;tre chang&eacute; d'&eacute;tat ou 
	r&eacute;assign&eacute;, envoyez un message &agrave; la personne 
	assign&eacute;e.  Si cette derni&egrave;re ne r&eacute;pond pas 
	dans un d&eacute;lai de deux semaines,
	d&eacute;sassignez le PR et faites ce qu'il vous pla&icirc;t.</para>
    </section>

    <section>
      <title>Doublons</title>

      <para>Si vous trouvez plus d'un PR d&eacute;crivant le m&ecirc;me 
	probl&egrave;me, choisissez celui qui contient la plus grande 
	quantit&eacute; d'information utile et fermez les autres, en 
	pr&eacute;cisant clairement le num&eacute;ro du PR de 
	remplacement.  Si plusieurs PRs contiennent des informations 
	utiles mais diff&eacute;rentes, soumettez ce qui est manquant 
	dans un PR que vous gardez ouvert par l'interm&eacute;diaire 
	d'un rapport de suivi, en faisant r&eacute;f&eacute;rence aux 
	PRs que vous fermez.</para>
    </section>

    <section>
      <title>PRs &ldquo;&eacute;vent&eacute;s&rdquo;</title>

      <para>Un PR est consid&eacute;r&eacute; comme 
	&ldquo;&eacute;vent&eacute;&rdquo; s'il n'a pas &eacute;t&eacute; 
	modifi&eacute; en plus de six mois.  Appliquez la 
	proc&eacute;dure suivante:</para>

      <itemizedlist>
	<listitem>
	  <para>Si le PR contient suffisamment de d&eacute;tails, essayez de
	    reproduire le probl&egrave;me sur les branches
	    <literal>-CURRENT</literal> et <literal>-STABLE</literal>.
	    Si vous r&eacute;ussissez, soumettez un rapport de suivi 
	    d&eacute;taillant vos r&eacute;sultats et trouvez quelqu'un 
	    &agrave; qui l'assigner.  Placez l'&eacute;tat sur 
	    &ldquo;analys&eacute;&rdquo; si c'est appropri&eacute;.</para>
	</listitem>

	<listitem>
	  <para>Si le PR d&eacute;crit un probl&egrave;me dont vous 
	    savez que c'est le r&eacute;sultat d'une erreur 
	    d'utilisation (configuration incorrecte ou autre), soumettez 
	    un rapport de suivi expliquant o&ugrave; s'est tromp&eacute; 
	    l'auteur, ensuite fermez le PR
	    avec comme raison &ldquo;User error&rdquo; (Erreur
	    d'utilisation) ou &ldquo;Configuration error&rdquo; (Erreur
	    de configuration).</para>
	</listitem>

	<listitem>
	  <para>Si le PR d&eacute;crit une erreur dont vous savez 
	    qu'elle a &eacute;t&eacute; corrig&eacute;e dans les 
	    branches <literal>-CURRENT</literal> et 
	    <literal>-STABLE</literal>, fermez-le avec un message
	    pr&eacute;cisant quand cela a &eacute;t&eacute; corrig&eacute; 
	    dans chaque branche.</para>
	</listitem>

	<listitem>
	  <para>Si le PR d&eacute;crit une erreur dont vous savez 
	    qu'elle a &eacute;t&eacute; corrig&eacute;e dans la branche 
	    <literal>-CURRENT</literal>, mais pas dans la branche 
	    <literal>-STABLE</literal>, essayez de voir si la personne 
	    qui l'a corrig&eacute; projette de faire 
	    l'int&eacute;gration dans la branche 
	    <literal>-STABLE</literal>, ou essayez de trouver quelqu'un 
	    (peut-&ecirc;tre vous-m&ecirc;me?) pour le faire.  Placez 
	    l'&eacute;tat sur &ldquo;retour&rdquo; et assignez-le 
	    &agrave; quiconque fera l'int&eacute;gration.</para>
	</listitem>

	<listitem>
	  <para>Dans tous les autres cas, demandez &agrave; l'auteur de 
	    confirmer si le probl&egrave;me existe toujours dans les 
	    nouvelles versions.  Si l'auteur ne r&eacute;pond pas sous 
	    un mois, fermez le PR avec la mention &ldquo;Feedback 
	    timeout&rdquo; (D&eacute;lai de retour expir&eacute;).</para>
	</listitem>
      </itemizedlist>
    </section>
  </section>
</article>
