Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/building-products/_index.po
Languages: es, pt_br, ru

source: FreeBSD provides the tools for creating dedicated OS and application program images. Its implementation of a BSD unix API is mature and tested. FreeBSD can also provide a stable cross-development environment for the other components of the high-end device.
es: FreeBSD proporciona las herramientas para crear imágenes dedicadas de sistemas operativos y programas. Su implementación de una API unix BSD es madura y está probada. FreeBSD también puede proporcionar un entorno estable de desarrollo cruzado para los otros componentes del dispositivo de gama alta.
pt_br: O FreeBSD fornece ferramentas para a criação de imagens do sistema operacional dedicadas a executar uma função específica. Sua implementação da API unix BSD é madura e testada. O FreeBSD também pode proporcionar um ambiente de desenvolvimento cruzado estável para os outros componentes de dispositivos topo de linha.
ru: FreeBSD предоставляет инструменты для создания выделенных образов ОС и прикладных программ. Его реализация API BSD Unix является зрелой и проверенной. FreeBSD также может обеспечить стабильную среду кросс-разработки для других компонентов высокопроизводительных устройств.

source: As a vehicle to get widespread testing and support from a worldwide team of developers for non-critical "intellectual property".
es: Como un producto para obtener amplias pruebas y soporte de un equipo mundial de desarrolladores para "propiedad intelectual" no crítica.
pt_br: Como um meio de obter testes abrangentes e suporte de uma equipe mundial de desenvolvedores para "propriedade intelectual" não crítica.
ru: Как средство для получения широкого тестирования и поддержки от международной команды разработчиков для некритичной "интеллектуальной собственности".

source: In this model, organizations contribute useful infrastructural frameworks to the FreeBSD project (for example, see man:netgraph[3]). The widespread exposure that the code gets helps to quickly identify performance issues and bugs. The involvement of top-notch developers also leads to useful extensions to the infrastructure that the contributing organization also benefits from.
es: En este modelo, las organizaciones aportan infraestructura útil al proyecto FreeBSD (por ejemplo, ver man:netgraph[3]). La amplia exposición que obtiene el código ayuda a identificar rápidamente problemas de rendimiento y fallos. La participación de desarrolladores de alto nivel también conlleva extensiones útiles de la infraestructura de las cuales también se beneficia la organización que la aportó.
pt_br: Neste modelo, as organizações contribuem com estruturas infraestruturais úteis para o projeto FreeBSD (por exemplo, veja man:netgraph[3]). A ampla exposição que o código recebe ajuda a identificar rapidamente problemas de desempenho e bugs. O envolvimento de desenvolvedores de primeira linha também leva a extensões úteis à infraestrutura das quais a organização contribuinte também se beneficia.
ru: В этой модели организации вносят полезные инфраструктурные фреймворки в проект FreeBSD (например, см. man:netgraph[3]). Широкое распространение кода помогает быстро выявлять проблемы производительности и ошибки. Участие высококлассных разработчиков также приводит к полезным расширениям инфраструктуры, от которых выигрывает и сама организация-вкладчик.

source: As a development environment supporting cross-development for embedded OSes like http://www.rtems.com/[RTEMS] and http://ecos.sourceware.org/[eCOS].
es: Como entorno de desarrollo que soporta desarrollo cruzado para sistemas operativos empotrados como http://www.rtems.com/[RTEMS] y http://ecos.sourceware.org/[eCOS].
pt_br: Como um ambiente de desenvolvimento que suporta desenvolvimento cruzado para sistemas operacionais embarcados, como http://www.rtems.com/[RTEMS] e http://ecos.sourceware.org/[eCOS].
ru: Как среда разработки, поддерживающая кросс-разработку для встраиваемых ОС, таких как http://www.rtems.com/[RTEMS] и http://ecos.sourceware.org/[eCOS].

source: There are many full-fledged development environments in the {numports}-strong collection of applications ported and packaged with FreeBSD.
es: Hay muchos entornos de desarrollo completamente equipados en la poderosa colección de {numports} aplicaciones portadas y empaquetadas con FreeBSD.
pt_br: Há muitos ambientes de desenvolvimento completos na coleção de {numports} aplicativos portados e empacotados com o FreeBSD.
ru: В обширной коллекции портированных и упакованных приложений FreeBSD, насчитывающей {numports} элементов, доступно множество полноценных сред разработки.

source: As a way to support a Unix-like API in an otherwise proprietary OS, increasing its palatability for application developers.
es: Como una forma de soportar una API similar a Unix en un sistema operativo que de otro modo sería propietario, aumentando su atractivo para los desarrolladores de aplicaciones.
pt_br: Como forma de suportar uma API estilo Unix em um sistema operacional que de outro modo seria proprietário, aumentando a sua palatabilidade para os desenvolvedores de aplicativos.
ru: В качестве способа поддержки Unix-подобного API в проприетарной ОС, повышая её привлекательность для разработчиков приложений.

source: Here parts of FreeBSD's kernel and application programs are "ported" to run alongside other tasks in the proprietary OS. The availability of a stable and well tested Unix(TM) API implementation can reduce the effort needed to port popular applications to the proprietary OS. As FreeBSD ships with high-quality documentation for its internals and has effective vulnerability management and release engineering processes, the costs of keeping up-to-date are kept low.
es: Aquí partes del núcleo de FreeBSD y programas de aplicaciones son "portados" para ejecutarse junto con otras tareas en el sistema operativo propietario. La disponibilidad de una implementación del API Unix(TM) bien testeada y estable puede reducir el esfuerzo necesario para portar aplicaciones populares al sistema operativo propietario. Puesto que FreeBSD se proporciona con documentación de alta calidad para sus detalles internos y tiene una gestión efectiva de vulnerabilidades y procesos de ingeniería de versiones, los costes de mantenerse actualizado se mantienen bajos.
pt_br: Aqui, partes do kernel do FreeBSD e dos programas de aplicação são "portadas" para serem executadas junto com outras tarefas no sistema operacional proprietário. A disponibilidade de uma implementação estável e bem testada da API Unix(TM) pode reduzir o esforço necessário para portar aplicativos populares para o sistema operacional proprietário. Como o FreeBSD é fornecido com documentação de alta qualidade para seus componentes internos e possui processos eficazes de gerenciamento de vulnerabilidades e engenharia de release, os custos para se manter atualizado são mantidos baixos.
ru: В этой части ядра FreeBSD и прикладных программ "портированы" для работы вместе с другими задачами в проприетарной ОС. Наличие стабильной и хорошо протестированной реализации Unix(TM) API может сократить усилия, необходимые для переноса популярных приложений на проприетарную ОС. Поскольку FreeBSD поставляется с качественной документацией по своей внутренней структуре и имеет эффективные процессы управления уязвимостями и выпуска релизов, затраты на поддержание актуальности остаются низкими.

source: Technologies
es: Tecnologías
pt_br: Tecnologias
ru: Технологии

source: There are a large number of technologies supported by the FreeBSD project. A selection of these are listed below:
es: Hay un gran número de tecnologías soportadas por el proyecto FreeBSD. A continuación se enumera una selección de ellos:
pt_br: Existe um grande número de tecnologias suportadas pelo projeto FreeBSD. Abaixo você encontra uma lista com alguma delas:
ru: В проекте FreeBSD поддерживается большое количество технологий. Ниже приведен их выбор:

source: A complete system that can cross-host itself for link:https://www.FreeBSD.org/platforms/[many architectures:]
es: Un sistema completo que puede auto alojarse de forma cruzada en link:https://www.FreeBSD.org/platforms/[muchas arquitecturas:]
pt_br: Um sistema completo que pode hospedar-se cruzadamente para link:https://www.FreeBSD.org/platforms/[muitas arquiteturas:]
ru: Полная система, способная самостоятельно осуществлять кросс-хостинг для link:https://www.FreeBSD.org/platforms/[множества архитектур:]

source: A modular symmetric multiprocessing capable kernel, with loadable kernel modules and a flexible and easy to use configuration system.
es: Un núcleo modular con capacidad de multiprocesamiento simétrico, con módulos integrables en el núcleo y un sistema de configuración flexible y fácil de usar.
pt_br: Um kernel modular capaz de multiprocessamento simétrico, com módulos de kernel carregáveis e um sistema de configuração flexível e fácil de usar.
ru: Модульное симметричное многопроцессорное ядро с загружаемыми модулями и гибкой, удобной системой настройки.

source: Support for emulation of Linux(TM) and SVR4 binaries at near machine speeds. Support for binary Windows(TM) (NDIS) network drivers.
es: Soporte para la emulación de binarios de Linux(TM) y SVR4 a velocidades próximas a la de la máquina. Soporte para binarios de drivers de red (NDIS) de Winwos(TM).
pt_br: Suporte para emulação de binários Linux(TM) e SVR4 em velocidades próximas às da máquina. Suporte para drivers de rede binários do Windows(TM) (NDIS).
ru: Поддержка эмуляции бинарных файлов Linux(TM) и SVR4 с почти нативной скоростью. Поддержка бинарных сетевых драйверов Windows(TM) (NDIS).

source: Libraries for many programming tasks: archivers, FTP and HTTP support, thread support, in addition to a full POSIX(TM) like programming environment.
es: Librerías para muchas tareas de programación: archivadores, soporte FTP y HTTP, soporte de hilos, además de un entorno de programación completo tipo POSIX(TM).
pt_br: Bibliotecas para muitas tarefas de programação: arquivamento, suporte a FTP e HTTP, suporte a threads, além de um ambiente de programação completo semelhante ao POSIX(TM).
ru: Библиотеки для множества задач программирования: архиваторы, поддержка FTP и HTTP, поддержка потоков, а также полноценная среда программирования, аналогичная POSIX(TM).

source: Security features: Mandatory Access Control (man:mac[9]), jails (man:jail[2]), ACLs, and in-kernel cryptographic device support.
es: Características de seguridad: Control de Acceso Obligatorio (man:mac[9]), jails (man:jail[2]), ACLs, y soporte para unidades criptográficas en el núcleo.
pt_br: Recursos de segurança: Controle de Acesso Obrigatório (man:mac[9]), jails (man:jail[2]), ACLs e suporte a dispositivos criptográficos no kernel.
ru: Безопасность: Принудительное управление доступом (man:mac[9]), клетки (man:jail[2]), ACL и поддержка криптографических устройств в ядре.

source: Networking features: firewall-ing, QoS management, high-performance TCP/IP networking with support for many extensions.
es: Funciones de red: cortafuegos, gestión de la calidad de servicio (QoS), conexiones de red TCP/IP de alto rendimiento con soporte para muchas extensiones.
pt_br: Funcionalidades avançadas de rede: firewalls, gerenciamento de QoS, rede TCP/IP de alta performance com suporte a muitos recursos avançados.
ru: Сетевые возможности: работа с межсетевым экраном, управление QoS, высокопроизводительные TCP/IP сети с поддержкой множества расширений.

source: FreeBSD's in-kernel Netgraph (man:netgraph[4]) framework allows kernel networking modules to be connected together in flexible ways.
es: La infraestructura de Netgraph (man:netgraph[4]) en el núcleo de FreeBSD permite a los módulos de red del núcleo conectarse conjuntamente de formas flexibles.
pt_br: O framework Netgraph (man:netgraph[4]) no kernel do FreeBSD permite que módulos de rede do kernel sejam conectados de maneiras flexíveis.
ru: Встроенная в FreeBSD система Netgraph (man:netgraph[4]) позволяет гибко соединять модули сетевого ядра между собой.

source: Support for storage technologies: Fibre Channel, SCSI, software and hardware RAID, ATA and SATA.
es: Soporte para tecnologías de almacenamiento: Fibre Channel, SCSI, RAID software y hardware, ATA y SATA.
pt_br: Suporte para tecnologias de armazenamento: Fibre Channel, SCSI, RAID de software e hardware, ATA e SATA.
ru: Поддержка технологий хранения данных: Fibre Channel, SCSI, программный и аппаратный RAID, ATA и SATA.

source: FreeBSD supports a number of filesystems, and its native UFS2 filesystem supports soft updates, snapshots and very large filesystem sizes (16TB per filesystem) <<McKu1999>>.
es: FreeBSD soporta varios sistemas de ficheros y su sistema de ficheros nativo UFS2 soporta actualizaciones blandas, instantáneas y tamaños de sistema de ficheros muy grandes (16TB por sistema de ficheros) <<McKu1999>>.
pt_br: O FreeBSD suporta vários sistemas de arquivos, e seu sistema de arquivos nativo UFS2 suporta "soft updates", snapshots e tamanhos de sistema de arquivos muito grandes (16 TB por sistema de arquivos) <<McKu1999>>.

source: FreeBSD's in-kernel GEOM (man:geom[4]) framework allows kernel storage modules to be composed in flexible ways.
es: La infraestructura GEOM (man:geom[4]) en el núcleo de FreeBSD permite a los módulos de almacenamiento del kernel configurarse de formas flexibles.
pt_br: O framework GEOM (man:geom[4]) no kernel do FreeBSD permite que módulos de armazenamento do kernel sejam compostos de maneiras flexíveis.
ru: Встроенная в ядро FreeBSD система GEOM (man:geom[4]) позволяет гибко комбинировать модули хранения данных.

source: Over {numports} ported applications, both commercial and open-source, managed via the FreeBSD ports collection.
es: Más de {numports} aplicaciones portadas, tanto comerciales como open-source, gestionadas mediante la colección de ports de FreeBSD.
pt_br: Mais de {numports} aplicativos portados, tanto comerciais quanto de código aberto, gerenciados por meio da coleção de ports do FreeBSD.
ru: Более {numports} портированных приложений, как коммерческих, так и с открытым исходным кодом, управляемых через коллекцию портов FreeBSD.

source: Organizational Structure
es: Estructura de la organización
pt_br: Estrutura Organizacional
ru: Организационная структура

source: FreeBSD's organizational structure is non-hierarchical.
es: La estructura organizativa de FreeBSD no es jerárquica.
pt_br: A estrutura organizacional do FreeBSD não é hierárquica.
ru: Организационная структура FreeBSD не является иерархической.

source: There are essentially two kinds of contributors to FreeBSD, general users of FreeBSD, and developers with write access (known as _committers_ in the jargon) to the source base.
es: Esencialmente hay dos tipos de contribuyentes en FreeBSD, los usuarios generales de FreeBSD y los desarrolladores con permiso de escritura sobre el código fuente (conocidos como _committers_ en la jerga).
pt_br: Existem basicamente dois tipos de contribuidores para o FreeBSD: usuários gerais do FreeBSD e desenvolvedores com acesso de escrita (conhecidos como _committers_ na gíria) à base de código-fonte.
ru: Существует два основных типа участников FreeBSD: обычные пользователи FreeBSD и разработчики с правом записи (известные в жаргоне как _коммиттеры_) в исходную базу.

source: There are many thousands of contributors in the first group; the vast majority of contributions to FreeBSD come from individuals in this group. Commit rights (write access) to the repository are granted to individuals who contribute consistently to the project. Commit rights come with additional responsibilities, and new committers are assigned mentors to help them learn the ropes.
es: Hay muchos miles de contribuyentes en el primer grupo; la gran mayoría de las contribuciones a FreeBSD provienen de individuos de este grupo. Los derechos de escritura (acceso de escritura) al repositorio se conceden a las personas que contribuyen de forma consistente al proyecto (denominados committers). Los derechos de escritura conllevan responsabilidades adicionales, y se asignan mentores a los nuevos committers para ayudarles a aprender lo que hay que hacer.
pt_br: Existem muitos milhares de colaboradores no primeiro grupo, a grande maioria das contribuições para o FreeBSD vêm de indivíduos desse grupo; A permissão de commit (acesso de escrita) no repositório é concedida a pessoas que contribuem de forma consistente para o projeto. O direito de commit vem acompanhado de responsabilidades adicionais, e para facilitar o aprendizado das mesmas, um mentor é atribuído a todos os novos committers.
ru: В первой группе участвуют тысячи разработчиков; подавляющее большинство вкладов в FreeBSD поступает от участников этой группы. Права на коммит (доступ на запись) в репозиторий предоставляются тем, кто регулярно вносит вклад в проект. Права на коммит связаны с дополнительными обязанностями, и новым коммиттерам назначаются наставники, чтобы помочь им освоиться.

source: FreeBSD Organization
es: Organización de FreeBSD
pt_br: Organização do FreeBSD
ru: Организация FreeBSD

source: Conflict resolution is performed by a nine member "Core Team" that is elected from the group of committers.
es: La resolución del conflicto es llevada a cabo por un "Core Team" de nueve miembros que es escogido entre el grupo de committers.
pt_br: A resolução de conflitos é realizada por uma equipe central ("Core Team") de nove membros que é eleita a partir do grupo de committers.
ru: Разрешение конфликтов осуществляется «Основной командой» из девяти человек, которая избирается из группы коммиттеров.

source: FreeBSD does not have "corporate" committers. Individual committers are required to take responsibility for the changes they introduce to the code. The extref:{committers-guide}[FreeBSD Committer's guide] <<ComGuide>> documents the rules and responsibilities for committers.
es: FreeBSD no tiene committers "corporativos". A los committers individuales se les requiere que asuman la responsabilidad de los cambios que introducen en el código. La extref:{committers-guide}[FreeBSD Committer's guide] <<ComGuide>> documenta las reglas y responsabilidades de los committers.
pt_br: O FreeBSD não tem committers "corporativos". Cada committer individual é responsável pelas alterações que introduz no código. O guia do committer do FreeBSD (extref:{committers-guide}[FreeBSD Committer's guide]) <<ComGuide>> documenta as regras e responsabilidades dos committers.

source: FreeBSD's project model is examined in detail in <<Nik2005>>.
es: El modelo de proyecto de FreeBSD se examina con detalle en <<Nik2005>>.
pt_br: O modelo de projeto do FreeBSD é examinado em detalhes em <<Nik2005>>.

source: FreeBSD Release Engineering Processes
es: Procesos de ingeniería de lanzamiento de versiones de FreeBSD
pt_br: Processos de Engenharia para liberação de novas versões do FreeBSD
ru: Процессы разработки релизов FreeBSD

source: FreeBSD's release engineering processes play a major role in ensuring that its released versions are of a high quality. At any point of time, FreeBSD's volunteers support multiple code lines (<<fig-freebsd-branches, FreeBSD Release Branches>>):
es: El proceso de lanzamiento de versiones de FreeBSD juega un papel importante en asegurar que las versiones liberadas son de alta calidad. En un momento dado, los voluntarios de FreeBSD soportan múltiples ramas de código (<<fig-freebsd-branches, FreeBSD Release Branches>>):
pt_br: Os processos de engenharia de release do FreeBSD desempenham um papel importante na garantia de que as versões lançadas sejam de alta qualidade. Em qualquer momento, os voluntários do FreeBSD suportam várias linhas de código (<<fig-freebsd-branches, FreeBSD Release Branches>>):

source: New features and disruptive code enters on the development branch, also known as the _-CURRENT_ branch.
es: Características nuevas y código disruptivo entra en la rama de desarrollo, también conocida como la rama _-CURRENT_.
pt_br: Novos recursos e código disruptivo entram na branch de desenvolvimento, também conhecida como branch _-CURRENT_.
ru: Новые функции и критически важный код попадают в ветку разработки, также известную как ветка _-CURRENT_.

source: _-STABLE_ branches are code lines that are branched from HEAD at regular intervals. Only tested code is allowed onto a -STABLE branch. New features are allowed once they have been tested and stabilized in the -CURRENT branch.
es: Las ramas _-STABLE_ son ramas de código que se obtienen de HEAD a intervalos regulares. Sólo el código probado se introduce en una rama -STABLE. Las características nuevas se añaden una vez que han sido probadas y estabilizadas en la rama -CURRENT.
pt_br: As branch _-STABLE_ são linhas de código que são ramificadas do HEAD em intervalos regulares. Somente o código testado é permitido em uma branch _-STABLE_. Novos recursos são permitidos apenas depois de terem sido testados e estabilizados na branch _-CURRENT_.
ru: Ветви _-STABLE_ представляют собой линии кода, ответвленные от HEAD через регулярные промежутки времени. В ветку -STABLE допускается только проверенный код. Новые функции добавляются только после их тестирования и стабилизации в ветке -CURRENT.

source: _-RELEASE_ branches are maintained by the FreeBSD security team. Only bug fixes for critical issues are permitted onto -RELEASE branches.
es: Las ramas _-RELEASE_ son mantenidas por el equipo de seguridad de FreeBSD. Sólo se permiten arreglos críticos en las ramas -RELEASE.
pt_br: As branchs _-RELEASE_ são mantidas pela equipe de segurança do FreeBSD. Somente correções de bugs para problemas críticos são permitidas nas branchs _-RELEASE_.
ru: Ветви _-RELEASE_ поддерживаются командой безопасности FreeBSD. На ветви -RELEASE допускаются только исправления ошибок для критических проблем.

source: FreeBSD Release Branches
es: Ramas RELEASE de FreeBSD
pt_br: Release Branches do FreeBSD
ru: Ветви выпусков FreeBSD

source: Code lines are kept alive for as long as there is user and developer interest in them.
es: Las líneas de código se mantienen vivas mientras haya interés en ellas por parte del usuario y del desarrollador.
pt_br: As linhas de código são mantidas vivas enquanto houver interesse dos usuários e dos desenvolvedores nelas.
ru: Строки кода поддерживаются до тех пор, пока есть интерес со стороны пользователей и разработчиков.
