Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/building-products/_index.po
Languages: es, pt_br, ru

source: FreeBSD does not have "corporate" committers. Individual committers are required to take responsibility for the changes they introduce to the code. The extref:{committers-guide}[FreeBSD Committer's guide] crossref:building-products[ComGuide,"Committer's Guide"] documents the rules and responsibilities for committers.
ru: В FreeBSD нет "корпоративных" коммиттеров. Отдельные коммиттеры обязаны нести ответственность за изменения, которые они вносят в код. В extref:{committers-guide}[Руководстве коммиттера FreeBSD] crossref:building-products[ComGuide,"Руководство коммиттера"] описаны правила и обязанности коммиттеров.

source: FreeBSD's project model is examined in detail in crossref:building-products[Nik2005,"A project model for the FreeBSD Project"].
ru: Модель проекта FreeBSD подробно рассматривается в crossref:building-products[Nik2005,"Модель проекта для FreeBSD"].

source: FreeBSD's release engineering processes play a major role in ensuring that its released versions are of a high quality. At any point of time, FreeBSD's volunteers support multiple code lines (crossref:building-products[fig-freebsd-branches, FreeBSD Release Branches]):
ru: Процессы разработки релизов FreeBSD играют важную роль в обеспечении высокого качества выпускаемых версий. В любой момент времени добровольцы FreeBSD поддерживают несколько линий кода (crossref:building-products[fig-freebsd-branches, Ветви релизов FreeBSD]):

source: FreeBSD's release engineering processes are described in crossref:building-products[RelEngDoc,"FreeBSD Release Engineering"].
ru: Процессы разработки релизов FreeBSD описаны в crossref:building-products[RelEngDoc,"Инженерия релизов FreeBSD"].

source: The goals of the FreeBSD project are crossref:building-products[Hub1994,"Contributing to the FreeBSD Project"]:
ru: Цели проекта FreeBSD описаны в crossref:building-products[Hub1994,"Участие в проекте FreeBSD"]:

source: The project values long-term perspectives crossref:building-products[Nor2001,"Teach Yourself Programming in Ten Years"]. A frequent acronym encountered in the project is DTRT, which stands for "Do The Right Thing".
ru: Проект ценит долгосрочные перспективы crossref:building-products[Nor2001,"Научись программировать за десять лет"]. Часто встречающаяся в проекте аббревиатура — DTRT, что означает «Do The Right Thing» (сделай правильно).

source: Formal specifications and design documents are seldom used in the project. Clear and well-written code and well-written change logs (crossref:building-products[fig-change-log, A sample change log entry]) are used in their place. FreeBSD development happens by "rough consensus and running code"crossref:building-products[Carp1996,"The Architectural Principles of the Internet"].
ru: Формальные спецификации и проектные документы редко используются в проекте. Вместо них применяются понятный и хорошо написанный код, а также хорошо составленные журналы изменений (crossref:building-products[fig-change-log, Пример записи в журнале изменений]). Разработка FreeBSD происходит по принципу «грубого консенсуса и работающего кода» crossref:building-products[Carp1996,"Архитектурные принципы Интернета"].

source: crossref:building-products[fig-svn-blame, An annotated source listing generated using `svn blame`] shows a portion of an annotated listing of the file referenced by the change log in crossref:building-products[fig-change-log, A sample change log entry]. The ancestry of each line of the source is clearly visible. Annotated listings showing the history of every file that is part of FreeBSD are https://svnweb.freebsd.org/[available on the web].
ru: crossref:building-products[fig-svn-blame, Аннотированный листинг исходного кода, сгенерированный с помощью `svn blame`] показывает часть аннотированного листинга файла, на который ссылается журнал изменений в crossref:building-products[fig-change-log, Пример записи в журнале изменений]. Происхождение каждой строки исходного кода чётко видно. Аннотированные листинги, показывающие историю каждого файла, входящего в состав FreeBSD, https://svnweb.freebsd.org/[доступны в интернете].

source: For less critical needs, you can ask for help on the link:https://lists.freebsd.org/[project mailing lists]. A useful guide to follow when asking for help is given in crossref:building-products[Ray2004,"How to ask questions the smart way"].
ru: Для менее критичных задач вы можете обратиться за помощью в link:https://lists.freebsd.org/[списки рассылки проекта]. Полезное руководство о том, как правильно задавать вопросы, приведено в crossref:building-products[Ray2004,"Как правильно задавать вопросы"].

source: Use double precision to simplify and optimize arg reduction for small and medium size args too: instead of conditionally subtracting a float 17+24, 17+17+24 or 17+17+17+24 bit approximation to pi/2, always subtract a double 33+53 bit one. The float version is now closer to the double version than to old versions of itself -- it uses the same 33+53 bit approximation as the simplest cases in the double version, and where the float version had to switch to the slow general case at |x| == 2^7*pi/2, it now switches at |x| == 2^19*pi/2 the same as the double version.
es: Usa doble precisión para simplificar y optimizar la reducción de argumentos también para argumentos de tamaño pequeño y medio: en lugar de restar una aproximación float a pi/2 de 17+24, 17+17+24 o 17+17+17+24 bits, siempre resta un double de 33+53 bits. La versión float es ahora más cercana a la versión double de lo que lo que era la propia versión antigua -- utiliza la misma aproximación de 33+53 bits como los casos más sencillos de la versión double, y cuando la versión float tenía que cambiar al caso general lento |x| == 2^7*pi/2, ahora cambia a |x| == 2^19*pi/2 al igual que la versión double.

source: This speeds up arg reduction by a factor of 2 for |x| between 3*pi/4 and 2^7*pi/4, and by a factor of 7 for |x| between 2^7*pi/4 and 2^19*pi/4.
es: Esto acelera la reducción de argumentos en un factor de 2 para |x| entre 3*pi/4 y 2^7*pi/4, y por un factor de 7 para |x| entre 2^7*pi/4 y 2^19*pi/4.
