Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/building-products/_index.po
Languages: es, pt_br, ru

source: How FreeBSD can help you build a better product
es: Cómo puede FreeBSD ayudarte a construir un producto mejor
pt_br: Como o FreeBSD pode ajudá-lo a construir um produto melhor
ru: Как FreeBSD может помочь вам создать лучший продукт

source: Building Products with FreeBSD
es: Construyendo productos con FreeBSD
pt_br: Construindo Produtos com o FreeBSD
ru: Создание продуктов на основе FreeBSD

source: Abstract
es: Resumen
pt_br: Resumo
ru: Аннотация

source: The FreeBSD project is a worldwide, volunteer based, and collaborative project, which develops a portable and high-quality operating system. The FreeBSD project distributes the source code for its product under a liberal license, with the intention of encouraging the use of its code. Collaborating with the FreeBSD project can help organizations reduce their time to market, reduce engineering costs and improve their product quality.
es: El proyecto FreeBSD es un proyecto mundial, basado en el voluntariado y la colaboración, que desarrolla un sistema operativo portable y de alta calidad. El proyecto FreeBSD distribuye el código fuente de su producto bajo una licencia permisiva, con la intención de fomentar el uso de su código. Colaborar con el proyecto FreeBSD puede ayudar a las organizaciones a reducir su tiempo de comercialización, reducir los costes de ingeniería y mejorar la calidad de sus productos.
pt_br: O projeto FreeBSD é um projeto voluntário e colaborativo de âmbito mundial, o qual desenvolve um sistema operacional de alta qualidade, capaz de ser utilizado em diferentes arquiteturas computacionais. O projeto FreeBSD distribui o código fonte do seu produto sob uma licença liberal, com a intenção de incentivar o uso de seu código. Colaborar com o projeto FreeBSD pode ajudar sua empresa a reduzir o tempo necessário para colocar um produto no mercado, a reduzir seus custos de engenharia e a melhorar qualidade de seus produtos.
ru: Проект FreeBSD — это всемирный, основанный на добровольцах и совместной работе проект, разрабатывающий переносимую и высококачественную операционную систему. Проект FreeBSD распространяет исходный код своего продукта под либеральной лицензией с целью поощрения использования своего кода. Сотрудничество с проектом FreeBSD может помочь организациям сократить время выхода на рынок, снизить инженерные затраты и улучшить качество своих продуктов.

source: This article examines the issues in using FreeBSD code in appliances and software products. It highlights the characteristics of FreeBSD that make it an excellent substrate for product development. The article concludes by suggesting a few "best practices" for organizations collaborating with the FreeBSD project.
es: Este artículo examina los problemas al usar el código de FreeBSD en dispositivos y productos de software. Se destacan las características que convierten a FreeBSD en una excelente base para el desarrollo de productos. El artículo concluye sugiriendo algunas "mejores prácticas" para las organizaciones que colaboran con el proyecto FreeBSD.
pt_br: Este artigo analisa as questões envolvidas no uso do código do FreeBSD em appliances e softwares. Ele também destaca as características do FreeBSD, que o tornam uma excelente base para o desenvolvimento de produtos. O artigo conclui sugerindo um conjunto das "melhores práticas" de organizações que colaboram com o projeto FreeBSD.
ru: В этой статье рассматриваются вопросы использования кода FreeBSD в устройствах и программных продуктах. В ней подчеркиваются характеристики FreeBSD, которые делают её отличной основой для разработки продуктов. В заключение статьи предлагаются несколько «лучших практик» для организаций, сотрудничающих с проектом FreeBSD.

source: Introduction
es: Introducción
pt_br: Introdução
ru: Введение

source: FreeBSD today is well-known as a high-performance server operating system. It is deployed on millions of web servers and internet-facing hosts worldwide. FreeBSD code also forms an integral part of many products, ranging from appliances such as network routers, firewalls, and storage devices, to personal computers. Portions of FreeBSD have also been used in commercial shrink-wrapped software (see <<freebsd-intro>>).
es: FreeBSD hoy es conocido como un sistema operativo de servidor de alto rendimiento. Se implementa en millones de servidores web y hosts conectados a Internet en todo el mundo. El código FreeBSD también forma parte integral de muchos productos, que van desde dispositivos como enrutadores de red, cortafuegos y dispositivos de almacenamiento, hasta computadoras personales. También se han utilizado partes de FreeBSD en software comercial empaquetado (ver <<freebsd-intro>>).
pt_br: Atualmente o FreeBSD é bem conhecido como um sistema operacional de alto desempenho para servidores. Ele está instalado em milhões de servidores web e em outros hosts conectados diretamente a internet em todo o mundo. O código do FreeBSD também é parte integrante de muitos produtos, que vão desde aparelhos como roteadores de rede, firewalls e dispositivos de armazenamento, até computadores pessoais. Partes do FreeBSD também têm sido utilizadas em softwares comerciais (consulte <<freebsd-intro>>).

source: In this article we look at the link:https://www.FreeBSD.org/[FreeBSD project] as a software engineering resource-as a collection of building blocks and processes which you can use to build products.
es: En este artículo miramos al link:https://www.FreeBSD.org/[proyecto FreeBSD] como un recurso de ingeniería de software - como una colección de bloques de construcción y procesos que puedes usar para construir tu producto.
pt_br: Neste artigo, vamos olhar para o link:https://www.FreeBSD.org/[projeto FreeBSD] como um recurso de engenharia de software, como um conjunto de blocos de construção e de processos, os quais você pode utilizar para construir produtos.
ru: В этой статье мы рассматриваем проект link:https://www.FreeBSD.org/[FreeBSD] как ресурс для разработки программного обеспечения — как набор строительных блоков и процессов, которые можно использовать для создания продуктов.

source: While FreeBSD's source is distributed freely to the public, to fully enjoy the benefits of the project's work, organizations need to _collaborate_ with the project. In subsequent sections of this article we discuss effective means of collaboration with the project and the pitfalls that need to be avoided while doing so.
es: Mientras que el código fuente de FreeBSD se distribuye libremente al público, para disfrutar plenamente de los beneficios del trabajo del proyecto, las organizaciones necesitan _colaborar_ con el proyecto. En las secciones siguientes de este artículo tratamos de los medios eficaces para colaborar con el proyecto y los escollos que deben evitarse al hacerlo.
pt_br: Embora o código fonte do FreeBSD seja distribuído gratuitamente ao público, para desfrutar plenamente dos benefícios do trabalho do projeto, as organizações precisam _colaborar_ com o mesmo. Nas seções subsequentes do presente artigo discutiremos formas eficazes de colaborar com o projeto, bem como os perigos que precisam ser evitados ao fazê-lo.
ru: Хотя исходный код FreeBSD распространяется свободно, чтобы в полной мере воспользоваться преимуществами работы проекта, организациям необходимо _сотрудничать_ с ним. В последующих разделах этой статьи мы обсудим эффективные способы взаимодействия с проектом и подводные камни, которых следует избегать при этом.

source: *Caveat Reader.* The author believes that the characteristics of the FreeBSD Project listed in this article were substantially true at the time the article was conceived and written (2005). However, the reader should keep in mind that the practices and processes used by open-source communities can change over time, and that the information in this article should therefore be taken as indicative rather than normative.
es: *Aviso al Lector.* El autor cree que las características del Proyecto FreeBSD enumeradas en este artículo eran sustancialmente verdaderas en el momento en que se concibió y escribió el artículo (2005). Sin embargo, el lector debe tener en cuenta que las prácticas y los procesos utilizados por las comunidades de código abierto pueden cambiar con el tiempo y que, por lo tanto, la información de este artículo debe tomarse como indicativa en lugar de normativa.
pt_br: *Aviso ao Leitor.* O autor considera que as características do projeto FreeBSD mencionadas neste artigo eram substancialmente verdadeiras no momento em que o artigo foi concebido e escrito (2005). No entanto, o leitor deve ter em mente que as práticas e processos utilizados por comunidades de código aberto podem mudar ao longo do tempo, e que portanto as informações deste artigo devem ser consideradas apenas como indicativas e não como verdades absolutas.

source: Target Audience
es: Público objetivo
pt_br: Público Alvo
ru: Целевая аудитория

source: This document would be of interest to the following broad groups of people:
es: Este documento sería de interés para los siguientes grupos amplios de personas:
pt_br: Este documento tem como público alvo os seguintes grupos de pessoas:
ru: Этот документ может быть интересен следующим широким группам людей:

source: Decision makers in product companies looking at ways to improve their product quality, reduce their time to market and lower engineering costs in the long term.
es: Los responsables de la toma de decisiones en las empresas de productos que buscan formas de mejorar la calidad de sus productos, reducir su tiempo de comercialización y reducir los costes de ingeniería a largo plazo.
pt_br: Tomadores de decisão em empresas que estejam em busca de meios para melhorar a qualidade de seus produtos, de reduzir o tempo necessário para lançá-los no mercado e de reduzir seus custos de engenharia no longo prazo.
ru: Принимающие решения в продуктовых компаниях, ищущие способы повысить качество своего продукта, сократить время выхода на рынок и снизить инженерные затраты в долгосрочной перспективе.

source: Technology consultants looking for best-practices in leveraging "open-source".
es: Consultores de tecnología que buscan las mejores prácticas sacando ventaja del "open-source".
pt_br: Consultores de tecnologia procurando melhores práticas em alavancar o código aberto.
ru: Консультанты по технологиям, ищущие передовые методы использования "открытого исходного кода".

source: Industry observers interested in understanding the dynamics of open-source projects.
es: Observadores de la industria interesados en comprender la dinámica de los proyectos de código abierto.
pt_br: Observadores da indústria interessados em compreender a dinâmica dos projetos de código aberto.
ru: Заинтересованные в понимании динамики проектов с открытым исходным кодом представители отрасли.

source: Software developers seeking to use FreeBSD and looking for ways to contribute back.
es: Los desarrolladores de software que buscan usar FreeBSD y buscan formas de contribuir.
pt_br: Desenvolvedores de software que utilizam o FreeBSD e que buscam formas de contribuir com o projeto.
ru: Разработчики программного обеспечения, желающие использовать FreeBSD и ищущие способы внести свой вклад.

source: Article Goals
es: Objetivos del artículo
pt_br: Objetivos do artigo
ru: Цели статьи

source: After reading this article you should have:
es: Después de leer este artículo, deberías tener:
pt_br: Após a leitura deste artigo, você deve ter:
ru: Прочитав эту статью, вы должны:

source: An understanding of the goals of the FreeBSD Project and its organizational structure.
es: Comprensión de los objetivos del proyecto FreeBSD y su estructura organizativa.
pt_br: Uma melhor compreensão dos objetivos do Projeto FreeBSD e de sua estrutura organizacional.
ru: Понимание целей проекта FreeBSD и его организационной структуры.

source: An understanding of its development model and release engineering processes.
es: Comprensión de su modelo de desarrollo y procesos de ingeniería de versiones.
pt_br: Uma visão geral das tecnologias disponíveis no projeto.
ru: Понимание модели разработки и процессов выпуска релизов.

source: An understanding of how conventional corporate software development processes differ from that used in the FreeBSD project.
es: Una comprensión de cómo los procesos convencionales de desarrollo de software corporativo difieren de los utilizados en el proyecto FreeBSD.
pt_br: Uma melhor compreensão do modelo de desenvolvimento adotado pelo Projeto FreeBSD e dos processos de engenharia envolvidos no lançamento de uma nova versão do sistema.
ru: Понимание того, как традиционные корпоративные процессы разработки программного обеспечения отличаются от используемых в проекте FreeBSD.

source: Awareness of the communication channels used by the project and the level of transparency you can expect.
es: Conocimiento de los canales de comunicación utilizados por el proyecto y del nivel de transparencia que puede esperar.
pt_br: Consciência dos canais de comunicação utilizados pelo projeto e do nível de transparência que você pode esperar.
ru: Осведомленность о каналах связи, используемых проектом, и уровне прозрачности, который вы можете ожидать.

source: Awareness of optimal ways of working with the project-how best to reduce engineering costs, improve time to market, manage security vulnerabilities, and preserve future compatibility with your product as the FreeBSD project evolves.
es: Conocimiento de las formas óptimas de trabajar con el proyecto y de la mejor manera de reducir los costes de ingeniería, mejorar el tiempo de comercialización, gestionar las vulnerabilidades de seguridad y preservar la compatibilidad futura con su producto a medida que evolucione el proyecto FreeBSD.
pt_br: Consciência das melhores formas de trabalhar com o projeto - a melhor forma de reduzir os custos de engenharia, de reduzir o tempo necessário para levar seu produto ao mercado, de gerir vulnerabilidades de segurança e preservar a compatibilidade futura com seu produto à medida que o projeto FreeBSD evolui.
ru: Осознание оптимальных способов работы с проектом — как лучше всего снизить инженерные затраты, ускорить выход на рынок, управлять уязвимостями безопасности и сохранить будущую совместимость с вашим продуктом по мере развития проекта FreeBSD.

source: Article Structure
es: Estructura del artículo
pt_br: Estrutura do Artigo
ru: Структура статьи

source: The rest of the article is structured as follows:
es: El resto del artículo está estructurado de la siguiente manera:
pt_br: O restante deste artigo está estruturado da seguinte forma:
ru: Остальная часть статьи структурирована следующим образом:

source: <<freebsd-intro>> introduces the FreeBSD project, explores its organizational structure, key technologies and release engineering processes.
es: <<freebsd-intro>> hace una introducción del proyecto FreeBSD, explora su estructura organizativa, tecnologías clave y proceso de ingeniería de versiones.
pt_br: <<freebsd-intro>> introduz o projeto FreeBSD, explora a estrutura organizacional, tecnologias principais e processos de engenharia de releases.

source: <<freebsd-collaboration>> describes ways to collaborate with the FreeBSD project. It examines common pitfalls encountered by corporates working with voluntary projects like FreeBSD.
es: <<freebsd-collaboration>> describe formas de colaborar con el proyecto FreeBSD. Examina fallos comunes encontrados por empleados de empresas trabajando con proyectos basados en voluntariado como FreeBSD.
pt_br: <<freebsd-collaboration>> descreve meios de colaboração para com o projeto FreeBSD. Examina armadilhas comuns encontrado por empresas trabalhando com projetos voluntários como o FreeBSD.

source: <<conclusion>> concludes.
es: <<conclusion>> conclusiones.
pt_br: <<conclusion>> conclui.

source: FreeBSD as a set of building blocks
es: FreeBSD como un conjunto de bloques de construcción
pt_br: O FreeBSD como um conjunto de blocos de construção
ru: FreeBSD как набор строительных блоков

source: FreeBSD makes an excellent foundation on which to build products:
es: FreeBSD constituye una excelente base sobre la que construir productos:
pt_br: O FreeBSD fornece uma excelente base sobre a qual podemos construir produtos:
ru: FreeBSD представляет собой отличную основу для создания продуктов:

source: FreeBSD source code is distributed under a liberal BSD license facilitating its adoption in commercial products <<Mon2005>> with minimum hassle.
es: El código fuente de FreeBSD se distribuye bajo una licencia BSD liberal que facilita su adopción en productos comerciales <<Mon2005>> con las mínimas molestias.
pt_br: O código fonte do FreeBSD é distribuído sob uma licença BSD liberal, o que facilita sua adoção em produtos comerciais <<Mon2005>> com um mínimo de preocupações.

source: The FreeBSD project has excellent engineering practices that can be leveraged.
es: El proyecto FreeBSD tiene excelentes prácticas de ingeniería que pueden ser aprovechadas.
pt_br: O Projeto FreeBSD possui excelentes práticas de engenharia as quais podem ser aproveitadas.
ru: Проект FreeBSD обладает превосходными инженерными практиками, которые можно использовать.

source: The project offers exceptional transparency into its workings, allowing organizations using its code to plan effectively for the future.
es: El proyecto ofrece una transparencia excepcional en su funcionamiento, permitiendo a las organizaciones que utilizan su código planificar eficazmente para el futuro.
pt_br: O projeto oferece uma transparência excepcional em seu funcionamento, permitindo que as empresas que utilizam o seu código se planejem de forma eficaz para o futuro.
ru: Проект обеспечивает исключительную прозрачность своей работы, позволяя организациям, использующим его код, эффективно планировать будущее.

source: The culture of the FreeBSD project, carried over from the Computer Science Research Group at The University of California, Berkeley <<McKu1999-1>>, fosters high-quality work. Some features in FreeBSD define the state of the art.
es: La cultura del proyecto FreeBSD, heredada del Grupo de Investigación en Ciencias de la Computación de la Universidad de California, Berkeley <<McKu1999-1>>, fomenta el trabajo de alta calidad. Algunas características de FreeBSD definen la vanguardia de la técnica.
pt_br: A cultura do projeto FreeBSD, herdada do Grupo de Pesquisa de Ciências da Computação da Universidade da Califórnia em Berkeley <<McKu1999-1>>, fomenta trabalhos de alta qualidade. Algumas funcionalidades do FreeBSD definem o estado da arte.

source: <<GoldGab2005>> examines the business reasons for using open-source in greater detail. For organizations, the benefits of using FreeBSD components in their products include a shorter time to market, lower development costs and lower development risks.
es: <<GoldGab2005>> examina con mayor detalle las razones comerciales para utilizar el código abierto. Para las organizaciones, los beneficios de usar componentes FreeBSD en sus productos incluyen un menor tiempo de lanzamiento al mercado, menores costes de desarrollo y menores riesgos de desarrollo.
pt_br: O <<GoldGab2005>> analisa em maior profundidade os motivos comerciais para se utilizar código fonte aberto. Para as organizações, os benefícios do uso de componentes do FreeBSD em seus produtos incluem a redução do tempo necessário para lançar novos produtos no mercado, menores custos e menores riscos de desenvolvimento.

source: Building with FreeBSD
es: Construyendo productos con FreeBSD
pt_br: Construindo com o FreeBSD
ru: Сборка с FreeBSD

source: Here are a few ways organizations have used FreeBSD:
es: Estas son algunas de las formas en que las organizaciones han usado FreeBSD:
pt_br: Aqui estão alguns exemplos de como as empresas estão utilizando o FreeBSD:
ru: Вот несколько способов, как организации использовали FreeBSD:

source: As an upstream source for tested code for libraries and utilities.
es: Como una fuente de código probado para librerías y empresas de servicios públicos.
pt_br: Como um provedor (upstream source) de códigos testados para bibliotecas e utilitários.
ru: В качестве вышестоящего источника для проверенного кода библиотек и утилит.

source: By being "downstream" of the project, organizations leverage the new features, bug fixes and testing that the upstream code receives.
es: Siendo un "derivado" del proyecto, las organizaciones aprovechan las nuevas características, arreglos de errores y pruebas que recibe el código base.
pt_br: Por estar "downstream" do projeto, as organizações aproveitam os novos recursos, correções de bugs e testes que o código upstream recebe.
ru: Будучи "нисходящими" по отношению к проекту, организации используют новые функции, исправления ошибок и тестирование, которые получает вышестоящий код.

source: As an embedded OS (for example, for an OEM router and firewall device). In this model, organizations use a customized FreeBSD kernel and application program set along with a proprietary management layer for their device. OEMs benefit from new hardware support being added by the FreeBSD project upstream, and from the testing that the base system receives.
es: Como un sistema operativo integrado (por ejemplo, para un enrutador OEM y un dispositivo de firewall). En este modelo, las organizaciones utilizan un kernel FreeBSD personalizado y un programa de aplicación junto con una capa de gestión propietaria para su dispositivo. Los OEM se benefician del nuevo soporte de hardware que agrega el proyecto FreeBSD en sentido ascendente y de las pruebas que recibe el sistema base.
pt_br: Como sistema operacional integrado (por exemplo, em um roteador OEM e ou em um dispositivo de firewall). Neste modelo, as empresas utilizam uma versão customizada do kernel e do conjunto de aplicativos do FreeBSD, juntamente com uma camada proprietária de gestão para os seus dispositivos. Os fabricantes de equipamentos originais (OEMs) se beneficiam da adição por parte do FreeBSD de suporte a novos componentes de hardware, bem como se beneficia dos testes que o sistema base recebe.
ru: Как встроенная ОС (например, для OEM-маршрутизаторов и устройств с межсетевым экраном). В этой модели организации используют настроенное ядро FreeBSD и набор прикладных программ вместе с проприетарным уровнем управления для своего устройства. OEM-производители получают выгоду от добавления поддержки нового оборудования проектом FreeBSD на уровне вышестоящего кода, а также от тестирования, которое проходит базовая система.

source: FreeBSD ships with a self-hosting development environment that allows easy creation of such configurations.
es: FreeBSD viene con un entorno de desarrollo auto alojado que permite crear fácilmente estas configuraciones.
pt_br: O FreeBSD é distribuído com um ambiente de desenvolvimento auto-hospedado o qual permite a fácil criação de tais configurações.
ru: FreeBSD поставляется с автономной средой разработки, которая позволяет легко создавать подобные конфигурации.

source: As a Unix compatible environment for the management functions of high-end storage and networking devices, running on a separate processor "blade".
es: Como entorno compatible con Unix para las funciones de gestión de dispositivos de red y almacenamiento de alta gama, que se ejecutan en un procesador independiente "blade".
pt_br: Como um ambiente Unix compatível para as funções de gerenciamento em dispositivos de armazenamento high-end e em dispositivos de rede, executando em uma lâmina separada "blade".
ru: Как совместимая с Unix среда для функций управления высокопроизводительными устройствами хранения данных и сетевого оборудования, работающая на отдельном процессорном "лезвии".
