Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/building-products/_index.po
Languages: es, pt_br, ru

source: Donate code to reduce costs
es: Donar código para reducir costes
pt_br: Doe código para reduzir seus custos
ru: Пожертвовуйте код для снижения затрат

source: A major proportion of the costs associated with developing products is that of doing maintenance. By donating non-critical code to the project, you benefit by having your code see much wider exposure than it would otherwise get. This in turn leads to more bugs and security vulnerabilities being flushed out and performance anomalies being identified and fixed.
es: Una parte importante de los costes asociados al desarrollo de productos es el mantenimiento. Al donar código no crítico al proyecto, te beneficias de que tu código tenga una exposición mucho más amplia de la que tendría de otro modo. Esto, a su vez, lleva a que se eliminen más errores y vulnerabilidades de seguridad y a que se identifiquen y solucionen las anomalías de rendimiento.
pt_br: Uma parte significativa dos custos relacionados ao desenvolvimento de um produto é o de realizar a sua manutenção. Ao doar partes não criticas do seu código para o projeto, você se beneficia por ter o seu código exposto de uma forma ampla, exposição que ele não teria de outra forma. Esta exposição por sua vez leva eliminação de um maior numero de bugs e de vulnerabilidades de segurança, e permite que anomalias de desempenho sejam identificadas e corrigidas.
ru: Основная часть затрат, связанных с разработкой продуктов, приходится на их поддержку. Пожертвовав некритичный код проекту, вы получаете выгоду в виде гораздо более широкого распространения вашего кода, чем это было бы возможно иначе. В свою очередь, это приводит к выявлению большего количества ошибок и уязвимостей безопасности, а также к обнаружению и исправлению аномалий производительности.

source: Get support effectively
es: Obtén apoyo de manera efectiva
pt_br: Obtenha suporte efetivo
ru: Получайте поддержку эффективно

source: For products with tight deadlines, it is recommended that you hire or enter into a consulting agreement with a developer or firm with FreeBSD experience. The {freebsd-jobs} is a useful communication channel to find talent. The FreeBSD project maintains a link:https://www.FreeBSD.org/commercial/consult_bycat/[gallery of consultants and consulting firms] undertaking FreeBSD work. The http://www.bsdcertification.org/[BSD Certification Group] offers certification for all the major BSD derived OSes.
es: Para productos con fechas límite ajustadas, se recomienda que contrates o realices un acuerdo de consultoría con un desarrollador o empresa con experiencia en FreeBSD. {freebsd-jobs} es un canal de comunicación útil para encontrar talento. El proyecto FreeBSD mantiene una link:https://www.FreeBSD.org/commercial/consult_bycat/[galería de consultores y empresas de consultoría] que realizan trabajo sobre FreeBSD. El http://www.bsdcertification.org/[BSD Certification Group] ofrece certificaciones para todos los sistemas operativos importantes derivados de BSD.
pt_br: Para produtos com prazos apertados, é recomendado contratar ou entrar em um acordo de consultoria com um desenvolvedor ou empresa com experiência em FreeBSD. O {freebsd-jobs} é um canal de comunicação útil para encontrar talentos. O projeto FreeBSD mantém uma link:https://www.FreeBSD.org/commercial/consult_bycat/[galeria de consultores e empresas de consultoria] que realizam trabalhos em FreeBSD. O http://www.bsdcertification.org/[Grupo de Certificação BSD] oferece certificação para todos os principais sistemas operacionais derivados do BSD.
ru: Для продуктов с жёсткими сроками рекомендуется нанять или заключить консультационное соглашение с разработчиком или компанией, имеющими опыт работы с FreeBSD. {freebsd-jobs} является полезным каналом связи для поиска специалистов. Проект FreeBSD поддерживает link:https://www.FreeBSD.org/commercial/consult_bycat/[галерею консультантов и консалтинговых компаний], занимающихся работой с FreeBSD. http://www.bsdcertification.org/[Группа сертификации BSD] предлагает сертификацию для всех основных ОС, производных от BSD.

source: For less critical needs, you can ask for help on the link:https://lists.freebsd.org/[project mailing lists]. A useful guide to follow when asking for help is given in <<Ray2004>>.
es: Para necesidades menos críticas, puedes solicitar ayuda en las link:https://lists.freebsd.org/[listas de correo del proyecto]. Una guía útil para seguir cuando se solicita ayuda es <<Ray2004>>.
pt_br: Para necessidades menos críticas, você pode pedir ajuda nas link:https://lists.freebsd.org/[listas de discussão do projeto]. Um guia útil a seguir ao pedir ajuda é dado em <<Ray2004>>.

source: Publicize your involvement
es: Publicita tu participación
pt_br: Divulgue o seu envolvimento
ru: Распространите информацию о вашем участии

source: You are not required to publicize your use of FreeBSD, but doing so helps both your effort as well as that of the project.
es: No es necesario que publicites tu uso de FreeBSD, pero hacerlo ayuda tanto a tu esfuerzo como al del proyecto.
pt_br: Você não é obrigado a divulgar que faz uso do FreeBSD, mas ao fazê-lo você estará ajudando ambos os esforços, o seu e o do projeto.
ru: Вы не обязаны афишировать своё использование FreeBSD, но это поможет как вашему делу, так и проекту.

source: Letting the FreeBSD community know that your company uses FreeBSD helps improve your chances of attracting high quality talent. A large roster of support for FreeBSD also means more mind share for it among developers. This in turn yields a healthier foundation for your future.
es: Hacer saber a la comunidad FreeBSD que tu empresa utiliza FreeBSD ayuda a mejorar tus posibilidades de atraer talento de alta calidad. Una amplia lista de soporte a FreeBSD también significa más intercambio de ideas para los desarrolladores. Esto a su vez produce una base más saludable para su futuro.
pt_br: Dar visibilidade para a comunidade FreeBSD de que a sua empresa utiliza o sistema ajuda a melhorar as suas chances de atrair talentos de alta qualidade. Quanto maior for a lista de organizações que apoiam o FreeBSD maior será a presença do sistema na cabeça (mind share) dos desenvolvedores. Ao contribuir para aumentar o numero de desenvolvedores interessados no FreeBSD, você estará gerando uma base saudável para o seu futuro.
ru: Позволяя сообществу FreeBSD узнать, что ваша компания использует FreeBSD, вы повышаете шансы привлечь высококвалифицированных специалистов. Большой список поддержки FreeBSD также означает большее внимание среди разработчиков. Это, в свою очередь, создает более устойчивую основу для вашего будущего.

source: Support FreeBSD developers
es: Apoya a los desarrolladores de FreeBSD
pt_br: Suporte os desenvolvedores do FreeBSD
ru: Поддержите разработчиков FreeBSD

source: Sometimes the most direct way to get a desired feature into FreeBSD is to support a developer who is already looking at a related problem. Help can range from hardware donations to direct financial assistance. In some countries, donations to the FreeBSD project enjoy tax benefits. The project has a dedicated link:https://www.FreeBSD.org/donations/[donations liaison] to assist donors. The project also maintains a web page where developers link:https://www.FreeBSD.org/donations/wantlist/[list their needs].
es: A veces el camino más directo para introducir una nueva característica en FreeBSD es apoyar al desarrollador que ya está trabajando en un problema relacionado. La ayuda puede variar desde donaciones de hardware a ayuda financiera directa. En algunos países, las donaciones al proyecto FreeBSD se benefician de exenciones fiscales. El proyecto tiene un link:https://www.FreeBSD.org/donations/[enlace de donaciones] dedicado a ayudar a los donantes. El proyecto también mantiene una página web donde los desarrolladores link:https://www.FreeBSD.org/donations/wantlist/[indican sus necesidades].
pt_br: Às vezes, a maneira mais direta de obter um recurso desejado no FreeBSD é apoiar um desenvolvedor que já está trabalhando em um problema relacionado. A ajuda pode variar desde doações de hardware até assistência financeira direta. Em alguns países, as doações ao projeto FreeBSD são isentas de impostos. O projeto possui uma link:https://www.FreeBSD.org/donations/[área de doações] dedicada para ajudar doadores. O projeto também mantém uma página da web onde os desenvolvedores link:https://www.FreeBSD.org/donations/wantlist/[listam suas necessidades].
ru: Иногда самый прямой способ получить нужную функциональность в FreeBSD — это поддержать разработчика, который уже занимается связанной проблемой. Помощь может варьироваться от пожертвования оборудования до прямой финансовой поддержки. В некоторых странах пожертвования проекту FreeBSD имеют налоговые льготы. У проекта есть специальный link:https://www.FreeBSD.org/donations/[представитель по пожертвованиям], который помогает донорам. Также проект поддерживает веб-страницу, где разработчики link:https://www.FreeBSD.org/donations/wantlist/[указывают свои потребности].

source: As a policy the FreeBSD project extref:{contributors}[acknowledges] all contributions received on its web site.
es: Como política, el proyecto FreeBSD extref:{contributors}[reconoce] en su sitio web todas las contribuciones recibidas.
pt_br: Como política, o projeto FreeBSD extref:{contributors}[reconhece] todas as contribuições recebidas em seu site.
ru: В соответствии с политикой проекта FreeBSD, о всех полученных вкладах в любой форме на его веб-сайте делается extref:{contributors}[запись с благодарностью].

source: Conclusion
es: Conclusión
pt_br: Conclusão
ru: Заключение

source: The FreeBSD project's goals are to create and give away the source code for a high-quality operating system. By working with the FreeBSD project you can reduce development costs and improve your time to market in a number of product development scenarios.
es: Los objetivos del proyecto FreeBSD son crear y obsequiar el código fuente de un sistema operativo de alta calidad. Trabajando con el proyecto FreeBSD puede reducir los costes de desarrollo y mejorar su tiempo de lanzamiento al mercado en una variedad de escenarios de desarrollo del producto.
pt_br: O Objetivo do projeto FreeBSD é criar e distribuir o código fonte de um sistema operacional de alta qualidade. Ao trabalhar com o projeto FreeBSD você pode reduzir os seus custos de desenvolvimento e melhorar o tempo necessário para lançar seus novos produtos no mercado em vários cenários de desenvolvimento de produtos.
ru: Цели проекта FreeBSD — создание и бесплатное распространение исходного кода высококачественной операционной системы. Сотрудничая с проектом FreeBSD, вы можете сократить затраты на разработку и ускорить вывод продукта на рынок в различных сценариях разработки.

source: We examined the characteristics of the FreeBSD project that make it an excellent choice for being part of an organization's product strategy. We then looked at the prevailing culture of the project and examined effective ways of interacting with its developers. The article concluded with a list of best-practices that could help organizations collaborating with the project.
es: Hemos examinado las características del proyecto FreeBSD que lo convierten en una excelente elección para formar parte de la estrategia de un producto de una organización. A continuación, examinamos la cultura predominante en el proyecto y las formas efectivas de interactuar con sus desarrolladores. El artículo ha concluido con una lista de buenas prácticas que podrían ayudar a las organizaciones que colaboran con el proyecto.
pt_br: Nós examinamos as características do projeto FreeBSD que o tornam uma excelente escolha para fazer parte da estratégia de produtos de uma organização. Em seguida, examinamos a cultura predominante do projeto e examinamos maneiras eficazes de interagir com seus desenvolvedores. O artigo concluiu com uma lista de melhores práticas que podem ajudar as organizações a colaborar com o projeto.
ru: Мы рассмотрели характеристики проекта FreeBSD, которые делают его отличным выбором для включения в продуктовую стратегию организации. Затем мы изучили преобладающую культуру проекта и рассмотрели эффективные способы взаимодействия с его разработчиками. В завершение статьи был приведён список лучших практик, которые могут помочь организациям в сотрудничестве с проектом.

source: Bibliography
es: Bibliografía
pt_br: Bibliografia
ru: Библиография

source: [[Carp1996]] [Carp1996] http://www.ietf.org/rfc/rfc1958.txt[The Architectural Principles of the Internet] B. Carpenter. The Internet Architecture Board.The Internet Architecture Board. Copyright(R) 1996.
pt_br: [[Carp1996]] [Carp1996] http://www.ietf.org/rfc/rfc1958.txt[Os Princípios Arquitetônicos da Internet]. The Internet Architecture Board. Copyright(R) 1996.
ru: [[Carp1996]] [Carp1996] http://www.ietf.org/rfc/rfc1958.txt[The Architectural Principles of the Internet] B. Carpenter. The Internet Architecture Board.The Internet Architecture Board. Copyright(R) 1996 год.

source: [[ComGuide]] [ComGuide] extref:{committers-guide}[Committer's Guide] The FreeBSD Project. Copyright(R) 2005.
pt_br: [[ComGuide]] [ComGuide] extref:{committers-guide}[Guia do Comitter] O Projeto FreeBSD. Direitos Autorais(R) 2005.
ru: [[ComGuide]] [ComGuide] extref:{committers-guide}[Committer's Guide] The FreeBSD Project. Copyright(R) 2005 год.

source: [[GoldGab2005]] [GoldGab2005] http://dreamsongs.com/IHE/IHE.html[Innovation Happens Elsewhere: Open Source as Business Strategy] Ron Goldman. Richard Gabriel. Copyright(R) 2005. Morgan-Kaufmann.
pt_br: [[GoldGab2005]] [GoldGab2005] http://dreamsongs.com/IHE/IHE.html[Inovação Acontece em Outros Lugares: Código Aberto como Estratégia de Negócios] Ron Goldman. Richard Gabriel. Copyright(R) 2005. Morgan-Kaufmann.
ru: [[GoldGab2005]] [GoldGab2005] http://dreamsongs.com/IHE/IHE.html[Innovation Happens Elsewhere: Open Source as Business Strategy] Ron Goldman. Richard Gabriel. Copyright(R) 2005 год. Morgan-Kaufmann.

source: [[Hub1994]] [Hub1994] extref:{contributing}[Contributing to the FreeBSD Project] Jordan Hubbard. Copyright(R) 1994-2005. The FreeBSD Project.
pt_br: [[Hub1994]] [Hub1994] extref:{contributing}[Contribuindo para o Projeto FreeBSD] Jordan Hubbard. Copyright(R) 1994-2005. The FreeBSD Project.
ru: [[Hub1994]] [Hub1994] extref:{contributing}[Contributing to the FreeBSD Project] Jordan Hubbard. Copyright(R) 1994-2005 гг. The FreeBSD Project.

source: [[McKu1999]] [McKu1999] http://www.usenix.org/publications/library/proceedings/usenix99/mckusick.html[Soft Updates: A Technique for Eliminating Most Synchronous Writes in the Fast Filesystem] Kirk McKusick. Gregory Ganger. Copyright(R) 1999.
pt_br: [[McKu1999]] [McKu1999] http://www.usenix.org/publications/library/proceedings/usenix99/mckusick.html[Soft Updates: Uma técnica para eliminar a maioria das gravações síncronas no sistema de arquivos rápido] Kirk McKusick. Gregory Ganger. Copyright(R) 1999.
ru: [[McKu1999]] [McKu1999] http://www.usenix.org/publications/library/proceedings/usenix99/mckusick.html[Soft Updates: A Technique for Eliminating Most Synchronous Writes in the Fast Filesystem] Kirk McKusick. Gregory Ganger. Copyright(R) 1999 год.

source: [[McKu1999-1]] [McKu1999-1] http://www.oreilly.com/catalog/opensources/book/kirkmck.html[Twenty Years of Berkeley Unix: From AT&T-Owned to Freely Redistributable] Marshall Kirk McKusick. http://www.oreilly.com/catalog/opensources/book/toc.html[Open Sources: Voices from the Open Source Revolution] O'Reilly Inc.. Copyright(R) 1993.
pt_br: [[McKu1999-1]] [McKu1999-1] http://www.oreilly.com/catalog/opensources/book/kirkmck.html[Vinte anos de Unix Berkeley: de propriedade da AT&T à redistribuição livre] Marshall Kirk McKusick. http://www.oreilly.com/catalog/opensources/book/toc.html[Open Sources: Vozes da Revolução Open Source] O'Reilly Inc.. Copyright(R) 1993.
ru: [[McKu1999-1]] [McKu1999-1] http://www.oreilly.com/catalog/opensources/book/kirkmck.html[Twenty Years of Berkeley Unix: From AT&T-Owned to Freely Redistributable] Marshall Kirk McKusick. http://www.oreilly.com/catalog/opensources/book/toc.html[Open Sources: Voices from the Open Source Revolution] O'Reilly Inc.. Copyright(R) 1993 год.

source: [[Mon2005]] [Mon2005] extref:{bsdl-gpl}[Why you should use a BSD style license for your Open Source Project] Bruce Montague. The FreeBSD Project. Copyright(R) 2005.
pt_br: [[Mon2005]] [Mon2005] extref:{bsdl-gpl}[Por que você deveria usar uma licença de estilo BSD para o seu projeto de código aberto.] Bruce Montague. The FreeBSD Project. Copyright(R) 2005.
ru: [[Mon2005]] [Mon2005] extref:{bsdl-gpl}[Why you should use a BSD style license for your Open Source Project] Bruce Montague. The FreeBSD Project. Copyright(R) 2005 год.

source: [[Nik2005]] [Nik2005] extref:{dev-model}[A project model for the FreeBSD Project] Niklas Saers. Copyright(R) 2005. The FreeBSD Project.
pt_br: [[Nik2005]] [Nik2005] extref:{dev-model}[Um modelo de projeto para o Projeto FreeBSD] Niklas Saers. Copyright(R) 2005. The FreeBSD Project.
ru: [[Nik2005]] [Nik2005] extref:{dev-model}[A project model for the FreeBSD Project] Niklas Saers. Copyright(R) 2005 год. The FreeBSD Project.

source: [[Nor1993]] [Nor1993] http://www.norvig.com/luv-slides.ps[Tutorial on Good Lisp Programming Style] Peter Norvig. Kent Pitman. Copyright(R) 1993.
pt_br: [[Nor1993]] [Nor1993] http://www.norvig.com/luv-slides.ps[Tutorial sobre Bom Estilo de Programação em Lisp.] Peter Norvig. Kent Pitman. Copyright(R) 1993.
ru: [[Nor1993]] [Nor1993] http://www.norvig.com/luv-slides.ps[Tutorial on Good Lisp Programming Style] Peter Norvig. Kent Pitman. Copyright(R) 1993 год.

source: [[Nor2001]] [Nor2001] http://www.norvig.com/21-days.html[Teach Yourself Programming in Ten Years] Peter Norvig. Copyright(R) 2001.
pt_br: [[Nor2001]] [Nor2001] http://www.norvig.com/21-days.html[Ensine a si mesmo a programar em dez anos.] Peter Norvig. Copyright(R) 2001.
ru: [[Nor2001]] [Nor2001] http://www.norvig.com/21-days.html[Teach Yourself Programming in Ten Years] Peter Norvig. Copyright(R) 2001 год.

source: [[Ray2004]] [Ray2004] http://www.catb.org/~esr/faqs/smart-questions.html[How to ask questions the smart way] Eric Steven Raymond. Copyright(R) 2004.
pt_br: [[Ray2004]] [Ray2004] http://www.catb.org/~esr/faqs/smart-questions.html[Como fazer perguntas de forma inteligente] Eric Steven Raymond. Copyright(R) 2004.
ru: [[Ray2004]] [Ray2004] http://www.catb.org/~esr/faqs/smart-questions.html[How to ask questions the smart way] Eric Steven Raymond. Copyright(R) 2004 год.

source: [[RelEngDoc]] [RelEngDoc] extref:{releng}[FreeBSD Release Engineering] Murray Stokely. Copyright(R) 2001. The FreeBSD Project.
pt_br: [[RelEngDoc]] [RelEngDoc] extref:{releng}[Engenharia de Releases do FreeBSD] Murray Stokely. Copyright(R) 2001. The FreeBSD Project.
ru: [[RelEngDoc]] [RelEngDoc] extref:{releng}[FreeBSD Release Engineering] Murray Stokely. Copyright(R) 2001 год. The FreeBSD Project.

source: FreeBSD today is well-known as a high-performance server operating system. It is deployed on millions of web servers and internet-facing hosts worldwide. FreeBSD code also forms an integral part of many products, ranging from appliances such as network routers, firewalls, and storage devices, to personal computers. Portions of FreeBSD have also been used in commercial shrink-wrapped software (see crossref:building-products[freebsd-intro, FreeBSD as a set of building blocks]).
ru: Современный FreeBSD известен как высокопроизводительная серверная операционная система. Он развернут на миллионах веб-серверов и хостов, доступных из интернета, по всему миру. Код FreeBSD также является неотъемлемой частью множества продуктов — от устройств, таких как сетевые маршрутизаторы, межсетевые экраны и системы хранения данных, до персональных компьютеров. Части FreeBSD также использовались в коммерческом коробочном программном обеспечении (см. crossref:building-products[freebsd-intro, FreeBSD как набор строительных блоков]).

source: crossref:building-products[freebsd-intro, FreeBSD as a set of building blocks] introduces the FreeBSD project, explores its organizational structure, key technologies and release engineering processes.
ru: crossref:building-products[freebsd-intro, FreeBSD как набор строительных блоков] представляет проект FreeBSD, исследует его организационную структуру, ключевые технологии и процессы разработки релизов.

source: crossref:building-products[freebsd-collaboration, Collaborating with FreeBSD] describes ways to collaborate with the FreeBSD project. It examines common pitfalls encountered by corporates working with voluntary projects like FreeBSD.
ru: crossref:building-products[freebsd-collaboration, Сотрудничество с FreeBSD] описывает способы взаимодействия с проектом FreeBSD. В нём рассматриваются типичные проблемы, с которыми сталкиваются компании при работе с добровольными проектами, такими как FreeBSD.

source: crossref:building-products[conclusion, Conclusion] concludes.
ru: crossref:building-products[conclusion, Заключение] завершает.

source: FreeBSD source code is distributed under a liberal BSD license facilitating its adoption in commercial products crossref:building-products[Mon2005,"Why you should use a BSD style license for your Open Source Project"] with minimum hassle.
ru: Исходный код FreeBSD распространяется под либеральной лицензией BSD, что способствует его использованию в коммерческих продуктах crossref:building-products[Mon2005,"Почему следует использовать лицензию в стиле BSD для вашего открытого проекта"] с минимальными сложностями.

source: The culture of the FreeBSD project, carried over from the Computer Science Research Group at The University of California, Berkeley crossref:building-products[McKu1999-1,"Twenty Years of Berkeley Unix: From AT&T-Owned to Freely Redistributable"], fosters high-quality work. Some features in FreeBSD define the state of the art.
ru: Культура проекта FreeBSD, унаследованная от Исследовательской группы по информатике Калифорнийского университета в Беркли crossref:building-products[McKu1999-1,"Двадцать лет Berkeley Unix: от собственности AT&T до свободного распространения"], способствует созданию высококачественных продуктов. Некоторые функции FreeBSD задают современный уровень развития технологий.

source: crossref:building-products[GoldGab2005,"Innovation Happens Elsewhere: Open Source as Business Strategy"] examines the business reasons for using open-source in greater detail. For organizations, the benefits of using FreeBSD components in their products include a shorter time to market, lower development costs and lower development risks.
ru: crossref:building-products[GoldGab2005,"Инновации происходят в другом месте: открытое ПО как бизнес-стратегия"] подробно рассматривает бизнес-причины использования открытого ПО. Для организаций преимущества использования компонентов FreeBSD в своих продуктах включают сокращение времени выхода на рынок, снижение затрат на разработку и уменьшение рисков разработки.

source: FreeBSD supports a number of filesystems, and its native UFS2 filesystem supports soft updates, snapshots and very large filesystem sizes (16TB per filesystem) crossref:building-products[McKu1999,"Soft Updates: A Technique for Eliminating Most Synchronous Writes in the Fast Filesystem"].
ru: FreeBSD поддерживает множество файловых систем, а его родная файловая система UFS2 поддерживает мягкие обновления, снимки и очень большие размеры файловых систем (16TB на файловую систему) crossref:building-products[McKu1999,"Soft Updates: A Technique for Eliminating Most Synchronous Writes in the Fast Filesystem"].
