Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/building-products/_index.po
Languages: es, pt_br, ru

source: Machine architectures are grouped into "tiers"; _Tier 1_ architectures are fully supported by the project's release engineering and security teams, _Tier 2_ architectures are supported on a best effort basis, and experimental architectures comprise _Tier 3_. The list of extref:{committers-guide}[supported architectures, archs] is part of the FreeBSD documentation collection.
es: Las arquitecturas se agrupan en "tiers"; Las arquitecturas _Tier 1_ están soportadas por completo por los equipos de seguridad y de ingeniería de versiones del proyecto, las arquitecturas _Tier 2_ están soportadas lo mejor posible y _Tier 3_ está compuesto de arquitecturas experimentales. La lista de extref:{committers-guide}[arquitecturas soportadas,archs] es parte de la colección de documentación de FreeBSD.
pt_br: As arquiteturas de máquinas são agrupadas em "níveis"; as arquiteturas _Tier 1_ são totalmente suportadas pelas equipes de engenharia de release e segurança do projeto, as arquiteturas _Tier 2_ são suportadas com base no melhor esforço, e as arquiteturas experimentais compõem o _Tier 3_. A lista de extref:{committers-guide}[arquiteturas suportadas, archs] faz parte da coleção de documentação do FreeBSD.
ru: Архитектуры машин разделены на «уровни»: архитектуры _Уровня 1_ полностью поддерживаются командами разработки выпусков и безопасности проекта, архитектуры _Уровня 2_ поддерживаются по мере возможностей, а экспериментальные архитектуры составляют _Уровень 3_. Список extref:{committers-guide}[поддерживаемых архитектур, archs] является частью коллекции документации FreeBSD.

source: The release engineering team publishes a link:https://www.FreeBSD.org/releng/[road map] for future releases of FreeBSD on the project's web site. The dates laid down in the road map are not deadlines; FreeBSD is released when its code and documentation are ready.
es: El equipo de ingeniería de versiones publica una link:https://www.FreeBSD.org/releng/[hoja de ruta] para futuras versiones de FreeBSD en el sitio web del proyecto. Las fechas que hay en la hoja de ruta no son fechas límite; FreeBSD se libera cuando el código y la documentación están listos.
pt_br: A equipe de engenharia de release publica um link:https://www.FreeBSD.org/releng/[road map] para futuros lançamentos do FreeBSD no site do projeto. As datas estabelecidas no roteiro não são prazos finais; o FreeBSD é lançado quando seu código e documentação estão prontos.
ru: Команда разработки релизов публикует link:https://www.FreeBSD.org/releng/[дорожную карту] будущих выпусков FreeBSD на веб-сайте проекта. Указанные в дорожной карте даты не являются крайними сроками; FreeBSD выпускается, когда его код и документация готовы.

source: FreeBSD's release engineering processes are described in <<RelEngDoc>>.
es: Los procesos de ingeniería de versiones de FreeBSD se describen en <<RelEngDoc>>.
pt_br: Os processos de engenharia de release do FreeBSD são descritos em <<RelEngDoc>>.

source: Collaborating with FreeBSD
es: Colaborando con FreeBSD
pt_br: Colaborando com o FreeBSD
ru: Сотрудничество с FreeBSD

source: Open-source projects like FreeBSD offer finished code of a very high quality.
es: Los proyectos de código abierto como FreeBSD ofrecen código terminado de muy alta calidad.
pt_br: Projetos open-source como o FreeBSD oferecem código final de alta qualidade.
ru: Проекты с открытым исходным кодом, такие как FreeBSD, предлагают готовый код очень высокого качества.

source: While access to quality source code can reduce the cost of initial development, in the long-term the costs of managing change begin to dominate. As computing environments change over the years and new security vulnerabilities are discovered, your product too needs to change and adapt. Using open-source code is best viewed not as a one-off activity, but as an __ongoing process__. The best projects to collaborate with are the ones that are __live__; i.e., with an active community, clear goals and a transparent working style.
es: Mientras que el acceso al código fuente de calidad puede reducir el coste del desarrollo inicial, a largo plazo los costes de gestión del cambio comienzan a dominar. A medida que los entornos informáticos cambian con el paso de los años y se descubren nuevas vulnerabilidades de seguridad, su producto también necesita cambiar y adaptarse. El uso de código abierto no se ve mejor como una actividad aislada, sino como un _proceso en curso_. Los mejores proyectos con los que se puede colaborar son los que son _vivos_; es decir, con una comunidad activa, objetivos claros y un estilo de trabajo transparente.
pt_br: Embora o acesso a um código fonte de qualidade possa reduzir o custo inicial de desenvolvimento, a longo prazo, os custos com o gerenciamento de mudanças começam a dominar. A medida que os ambientes computacionais mudam ao longo dos anos e novas vulnerabilidades de segurança são descobertas, o seu produto também precisará mudar e se adaptar. O uso de código open-source não deve ser encarado como uma atividade pontual, mas sim como um __processo contínuo__. Os melhores projetos para se colaborar são os que estão __vivos__, ou seja, aqueles com uma comunidade ativa, que tenha objetivos claros e que possua um estilo de trabalho transparente.
ru: Хотя доступ к качественному исходному коду может снизить затраты на начальную разработку, в долгосрочной перспективе затраты на управление изменениями становятся преобладающими. По мере того как вычислительные среды меняются с годами и обнаруживаются новые уязвимости безопасности, ваш продукт также должен меняться и адаптироваться. Использование открытого исходного кода лучше рассматривать не как разовое мероприятие, а как __непрерывный процесс__. Лучшие проекты для сотрудничества — это те, которые __активны__; т.е. имеют активное сообщество, четкие цели и прозрачный стиль работы.

source: FreeBSD has an active developer community around it. At the time of writing there are many thousands of contributors from every populated continent in the world and over 300 individuals with write access to the project's source repositories.
es: FreeBSD tiene una comunidad de desarrolladores activa a su alrededor. En el momento de escribir este artículo hay muchos miles de contribuyentes de todos los continentes del mundo y más de 300 personas con acceso de escritura a los repositorios de fuentes del proyecto.
pt_br: O FreeBSD tem uma comunidade de desenvolvimento ativa em torno dele. No momento em que este artigo foi escrito, existiam milhares de colaboradores com representantes de praticamente todos os continentes povoados do mundo, e mais de 300 indivíduos com acesso de escrita aos repositórios do projeto.
ru: FreeBSD имеет активное сообщество разработчиков. На момент написания этого документа в мире насчитываются тысячи участников со всех обитаемых континентов, а также более 300 человек с правом записи в исходные репозитории проекта.

source: The goals of the FreeBSD project are <<Hub1994>>:
es: Los objetivos del proyecto FreeBSD son <<Hub1994>>:
pt_br: Os objetivos do projeto FreeBSD são <<Hub1994>>:

source: To develop a high-quality operating system for popular computer hardware, and,
es: Desarrollar un sistema operativo de alta calidad para los equipos informáticos más utilizados, y,
pt_br: Desenvolver um sistema operacional de alta qualidade para o hardware de computadores populares, e,
ru: Разработать высококачественную операционную систему для популярного компьютерного оборудования и,

source: To make our work available to all under a liberal license.
es: Poner nuestro trabajo a disposición de todos bajo una licencia liberal.
pt_br: Tornar o nosso trabalho disponível para todos sob uma licença liberal.
ru: Сделать нашу работу доступной для всех под либеральной лицензией.

source: FreeBSD enjoys an open and transparent working culture. Nearly all discussion in the project happens by email, on link:https://lists.freebsd.org/[public mailing lists] that are also archived for posterity. The project's policies are link:https://www.FreeBSD.org/internal/policies/[documented] and maintained under revision control. Participation in the project is open to all.
es: FreeBSD disfruta de una cultura de trabajo abierta y transparente. Prácticamente toda la discusión en el proyecto se produce por email, en link:https://lists.freebsd.org/[listas públicas de correo] que son archivadas para la posteridad. Las políticas del proyecto están link:https://www.FreeBSD.org/internal/policies/[documentadas] y mantenidas bajo control de versiones. La participación en el proyecto está abierta a cualquiera.
pt_br: O FreeBSD possui uma cultura de trabalho aberta e transparente. Quase todas as discussões no projeto ocorrem por e-mail, em link:https://lists.freebsd.org/[listas de discussão públicas] que também são arquivadas para a posteridade. As políticas do projeto são link:https://www.FreeBSD.org/internal/policies/[documentadas] e mantidas sob controle de revisão. A participação no projeto está aberta a todos.
ru: FreeBSD придерживается открытой и прозрачной рабочей культуры. Почти все обсуждения в проекте происходят по электронной почте на link:https://lists.freebsd.org/[публичных списках рассылки], которые также архивируются для потомков. Политики проекта link:https://www.FreeBSD.org/internal/policies/[документированы] и поддерживаются в системе контроля версий. Участие в проекте открыто для всех.

source: Understanding FreeBSD culture
es: Comprendiendo la cultura de FreeBSD
pt_br: Compreendendo a cultura do FreeBSD
ru: Понимание культуры FreeBSD

source: To be able to work effectively with the FreeBSD project, you need to understand the project's culture.
es: Para poder trabajar eficazmente con el proyecto FreeBSD necesita entender la cultura del proyecto.
pt_br: Para ser capaz de trabalhar de forma eficaz com o projeto FreeBSD, você precisa entender a cultura do projeto.
ru: Чтобы эффективно работать с проектом FreeBSD, необходимо понимать его культуру.

source: Volunteer driven projects operate under different rules than for-profit corporates. A common mistake that companies make when venturing into the open-source world is that of underplaying these differences.
es: Los proyectos impulsados por voluntarios operan bajo reglas diferentes a las de las corporaciones con fines de lucro. Un error común que cometen las empresas al aventurarse en el mundo del software libre es subestimar estas diferencias.
pt_br: As regras que regem a operação de um projeto voluntário são diferentes das que regem a operação de uma empresa com fins lucrativos. Um erro comum que as empresas cometem ao se aventurar no mundo open-source é o de subestimar essas diferenças.
ru: Добровольческие проекты работают по другим правилам, чем коммерческие компании. Частая ошибка, которую совершают компании, входя в мир открытого исходного кода, — недооценка этих различий.

source: *Motivation.* Most contributions to FreeBSD are done voluntarily without monetary rewards entering the picture. The factors that motivate individuals are complex, ranging from altruism, to an interest in solving the kinds of problems that FreeBSD attempts to solve. In this environment, "elegance is never optional"<<Nor1993>>.
es: La mayoría de las contribuciones a FreeBSD se hacen voluntariamente sin que las recompensas económicas entren en escena. Los factores que motivan a los individuos son complejos, desde el altruismo hasta el interés por resolver los tipos de problemas que FreeBSD intenta resolver. En este entorno, la "elegancia nunca es opcional" <<Nor1993>>.
pt_br: *Motivação.* A maioria das contribuições para o FreeBSD é feita voluntariamente, sem a entrada de recompensas monetárias. Os fatores que motivam os indivíduos são complexos, variando desde o altruísmo até o interesse em resolver os tipos de problemas que o FreeBSD tenta resolver. Nesse ambiente, "a elegância nunca é opcional" <<Nor1993>>.

source: *The Long Term View.* FreeBSD traces its roots back nearly twenty years to the work of the Computer Science Research Group at the University of California Berkeley.footnote:[FreeBSD's source repository contains a history of the project since its inception, and there are CDROMs available that contain earlier code from the CSRG.] A number of the original CSRG developers remain associated with the project.
es: *La Visión a Largo Plazo.* FreeBSD tiene sus raíces hace casi veinte años en el trabajo del Grupo de Investigación de Ciencias de la Computación de la Universidad de California en Berkeley.footnote:[El repositorio de código fuente de FreeBSD contiene la historia del proyecto desde sus comienzos y hay CDROMs disponibles que contienen código anterior del CSRG]. Cierto número de los desarrolladores originales del CSRG siguen asociados al proyecto.
pt_br: *A Visão de Longo Prazo.* O FreeBSD remonta quase vinte anos ao trabalho do Computer Science Research Group da Universidade da Califórnia em Berkeley. footnote:[O repositório de código-fonte do FreeBSD contém um histórico do projeto desde o seu início, e há CDs disponíveis que contêm código anterior do CSRG.] Vários dos desenvolvedores originais do CSRG ainda estão associados ao projeto.

source: The project values long-term perspectives <<Nor2001>>. A frequent acronym encountered in the project is DTRT, which stands for "Do The Right Thing".
es: Las perspectivas a largo plazo de los valores del proyecto <<Nor2001>>. Un acrónimo encontrado frecuentemente en el proyecto es DTRT, que significa "Do The Right Thing" ("haz lo correcto").
pt_br: O projeto valoriza perspectivas de longo prazo <<Nor2001>>. Um acrônimo frequente encontrado no projeto é DTRT, que significa "Faça a Coisa Certa".

source: *Development Processes.* Computer programs are tools for communication: at one level programmers communicate their intentions using a precise notation to a tool (a compiler) that translates their instructions to executable code. At another level, the same notation is used for communication of intent between two programmers.
es: *Procesos de Desarrollo.* Los programas de ordenador son herramientas para la comunicación: a un nivel los programadores comunican sus intenciones utilizando una notación precisa a una herramienta (un compilador) que traduce sus instrucciones a código ejecutable. A otro nivel, la misma notación es utilizada para la comunicación de intenciones entre dos programadores.
pt_br: Os programas de computador são ferramentas de comunicação: em um nível, os programadores comunicam suas intenções usando uma notação precisa para uma ferramenta (um compilador) que traduz suas instruções para código executável. Em outro nível, a mesma notação é usada para comunicação de intenção entre dois programadores.

source: Formal specifications and design documents are seldom used in the project. Clear and well-written code and well-written change logs (<<fig-change-log, A sample change log entry>>) are used in their place. FreeBSD development happens by "rough consensus and running code"<<Carp1996>>.
es: Las especificaciones formales y los documentos de diseño son usados raramente en el proyecto. El código claro y bien escrito y los registros de cambio bien escritos ((<<fig-change-log, Una entrada de log de cambio de ejemplo>>) se utilizan en su lugar. El desarrollo de FreeBSD sucede por "consenso aproximado y ejecutando código"<<Carp1996>>.
pt_br: Especificações formais e documentos de design raramente são utilizados no projeto. Em seu lugar, é usado um código claro e bem escrito e registros de alterações bem escritos (<<fig-change-log, Um exemplo de entrada de registro de alterações>>). O desenvolvimento do FreeBSD acontece por meio de "consenso geral e código em execução" (tradução livre de "rough consensus and running code"<<Carp1996>>).

source: A sample change log entry [[fig-change-log]]
es: Ejemplo de una entrada de log de cambio [[fig-change-log]]
pt_br: Um exemplo de entrada de log de mudanças [[fig-change-log]]
ru: Пример записи в журнале изменений [[fig-change-log]]

source: Communication between programmers is enhanced by the use of a common coding standard man:style[9].
es: La comunicación entre los programadores es mejorada por el uso de un estándar común de codificación man:style[9].
pt_br: Comunicação entre programadores é melhorada pelo uso de um padrão de codificação comum (man:style[9]).
ru: Общение между программистами улучшается благодаря использованию общего стандарта кодирования man:style[9].

source: *Communication Channels.* FreeBSD's contributors are spread across the world. Email (and to a lesser extent, IRC) is the preferred means of communication in the project.
es: *Canales de Comunicación.* Los colaboradores de FreeBSD están repartidos por todo el mundo. Email (y en menor medida, IRC) es el medio de comunicación preferido en el proyecto.
pt_br: *Canais de Comunicação.* Os colaboradores do FreeBSD estão espalhados pelo mundo. O e-mail (e, em menor medida, o IRC) é o meio de comunicação preferido no projeto.

source: Best Practices for collaborating with the FreeBSD project
es: Buenas Prácticas para colaborar con el proyecto FreeBSD
pt_br: Melhores práticas para colaborar com o projeto FreeBSD
ru: Лучшие практики для сотрудничества с проектом FreeBSD

source: We now look at a few best practices for making the best use of FreeBSD in product development.
es: A continuación presentamos algunas de las mejores prácticas para hacer el mejor uso de FreeBSD en el desarrollo de productos.
pt_br: Agora iremos examinar algumas das melhores práticas para se fazer um melhor uso do FreeBSD no desenvolvimento de produtos.
ru: Теперь рассмотрим несколько лучших практик для наиболее эффективного использования FreeBSD в разработке продуктов.

source: Plan for the long term
es: Planificar a largo plazo
pt_br: Se planeje para o longo prazo
ru: Планируйте на долгосрочную перспективу

source: Setup processes that help in tracking the development of FreeBSD. For example:
es: Establecer procesos que ayuden a hacer el seguimiento del desarrollo de FreeBSD. Por ejemplo:
pt_br: Criar processos que auxiliem no acompanhamento do desenvolvimento do FreeBSD. Por exemplo:
ru: Настройка процессов, которые помогают отслеживать разработку FreeBSD. Например:

source: *Track FreeBSD source code.* The project makes it easy to mirror its SVN repository using extref:{committers-guide}[svnsync, svn-advanced-use-setting-up-svnsync]. Having the complete history of the source is useful when debugging complex problems and offers valuable insight into the intentions of the original developers. Use a capable source control system that allows you to easily merge changes between the upstream FreeBSD code base and your own in-house code.
es: *Seguimiento del código fuente de FreeBSD.* El proyecto hace sencillo clonar su repositorio SVN utilizando extref:{committers-guide}[svnsync,svn-advanced-use-setting-up-svnsync]. Tener el histórico completo de las fuentes es útil cuando se depuran problemas complejos y ofrece un conocimiento valioso de las intenciones de los desarrolladores originales. Utiliza un sistema de control de código capaz que te permita incorporar cambios entre el código base de FreeBSD y tu propio código.
pt_br: *Acompanhar o código-fonte do FreeBSD.* O projeto facilita a criação de um espelho do seu repositório SVN usando o extref:{committers-guide}[svnsync, svn-advanced-use-setting-up-svnsync]. Ter todo o histórico do código-fonte é útil para depurar problemas complexos e oferece informações valiosas sobre as intenções dos desenvolvedores originais. Use um sistema de controle de código capaz que permita mesclar facilmente as alterações entre o código-base upstream do FreeBSD e o seu próprio código interno.

source: <<fig-svn-blame, An annotated source listing generated using `svn blame`>> shows a portion of an annotated listing of the file referenced by the change log in <<fig-change-log, A sample change log entry>>. The ancestry of each line of the source is clearly visible. Annotated listings showing the history of every file that is part of FreeBSD are https://svnweb.freebsd.org/[available on the web].
es: <<fig-svn-blame, Listado de código fuente anotado generado con `svn blame`>> muestra una porción de un listado anotado del fichero referenciado por el registro de cambio en <fig-change-log, Un ejemplo de entrada de registro de cambios>>. El antecesor de cada línea es claramente visible. Los listados anotados que muestran el histórico de cada fichero que forma parte de FreeBSD están https://svnweb.freebsd.org/[disponibles en la web].
pt_br: <<fig-svn-blame, Um arquivo de origem anotado gerado usando `svn blame`>> mostra uma parte de um arquivo de listagem anotado do arquivo referenciado pelo registro de alterações em <<fig-change-log, Um exemplo de registro de alterações>>. A ancestralidade de cada linha do código-fonte é claramente visível. Listagens anotadas mostrando a história de cada arquivo que faz parte do FreeBSD estão disponíveis https://svnweb.freebsd.org/[no website].

source: An annotated source listing generated using `svn blame` [[fig-svn-blame]]
es: Un listado de código anotado generado con `svn blame` [[fig-svn-blame]]
pt_br: Uma listagem de origem anotada gerada usando `svn blame` [[fig-svn-blame]]
ru: Аннотированный листинг исходного кода, сгенерированный с использованием `svn blame` [[fig-svn-blame]]

source: *Use a gatekeeper.* Appoint a _gatekeeper_ to monitor FreeBSD development, to keep an eye out for changes that could potentially impact your products.
es: *Usa un guardián.* Designa un _guardián_ para monitorizar el desarrollo de FreeBSD, para controlar los cambios que potencialmente podrían impactar en tus productos.
pt_br: *Use um gatekeeper.* Nomeie um _gatekeeper_ para monitorar o desenvolvimento do FreeBSD, para ficar de olho em mudanças que possam potencialmente impactar seus produtos.

source: *Report bugs upstream.* If you notice bug in the FreeBSD code that you are using, file a https://www.FreeBSD.org/support/bugreports/[bug report]. This step helps ensure that you do not have to fix the bug the next time you take a code drop from upstream.
es: *Reporta problemas.* Si adviertes un fallo en el código de FreeBSD que estás utilizando, cumplimenta un https://www.FreeBSD.org/support/bugreports/[reporte de error]. Este paso asegura que no tengas que arreglar el fallo la próxima vez que actualices tu código con el original de FreeBSD.
pt_br: *Relate bugs upstream.* Se você notar algum bug no código do FreeBSD que está usando, envie um https://www.FreeBSD.org/support/bugreports/[relatório de bug]. Esse passo ajuda a garantir que você não precise corrigir o bug na próxima vez que fizer uma atualização de código do upstream.

source: Leverage FreeBSD's release engineering efforts
es: Aprovecha los esfuerzos de ingeniería de versiones de FreeBSD
pt_br: Se alavanque nos esforços de engenharia do FreeBSD para lançamento de novas versões
ru: Используйте преимущества разработки релизов FreeBSD

source: Use code from a -STABLE development branch of FreeBSD. These development branches are formally supported by FreeBSD's release engineering and security teams and comprise of tested code.
es: Utiliza código de una rama de desarrollo -STABLE de FreeBSD. Estas ramas de desarrollo están formalmente soportadas por los equipos de seguridad e ingeniería de lanzamiento de FreeBSD y se componen de código probado.
pt_br: Utilize código da branch de desenvolvimento -STABLE do FreeBSD. Este branch de desenvolvimento é formalmente suportado pelas equipes de engenharia de release e de segurança, e é formada apenas por código testado.
ru: Используйте код из ветви разработки -STABLE FreeBSD. Эти ветви разработки официально поддерживаются инженерной командой выпуска и командой безопасности FreeBSD и содержат проверенный код.
