Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/asciidoctor-primer/_index.po
Languages: pt_br, ru

source: A brief introduction to Asciidoctor
pt_br: Uma breve introdução ao Asciidoctor
ru: Краткое введение в Asciidoctor

source: Chapter 6. Asciidoctor Primer
pt_br: Capítulo 6. Primer Asciidoctor
ru: Глава 6. Введение в Asciidoctor

source: Asciidoctor Primer
pt_br: Primer Asciidoctor
ru: Основы Asciidoctor

source: Most FDP documentation is written with AsciiDoc. This chapter explains what that means, how to read and understand the documentation source, and the techniques used. To get a complete reference of the Asciidoctor capabilities please consult the link:https://docs.asciidoctor.org/home/[Asciidoctor documentation]. Some of the examples used in this chapter have been taken from the link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference[AsciiDoc Syntax Quick Reference].
pt_br: A maioria das documentações do FDP é escrita em AsciiDoc. Este capítulo explica o que isso significa, como ler e entender o código da documentação e as técnicas usadas. Para obter uma referência completa dos recursos do Asciidoctor, consulte a link:https://docs.asciidoctor.org/home/[documentação do Asciidoctor]. Alguns exemplos usados neste capítulo foram retirados da link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference[Referência rápida de sintaxe AsciiDoc].
ru: Большая часть документации FDP написана с использованием AsciiDoc. В этой главе объясняется, что это значит, как читать и понимать исходный код документации, а также используемые методы. Для получения полного справочника по возможностям Asciidoctor обратитесь к link:https://docs.asciidoctor.org/home/[документации Asciidoctor]. Некоторые примеры, используемые в этой главе, взяты из link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference[краткого справочника по синтаксису AsciiDoc].

source: Overview
pt_br: Visão geral
ru: Обзор

source: In the original days of computers, electronic text was simple. There were a few character sets like ASCII or EBCDIC, but that was about it. Text was text, and what you saw really was what you got. No frills, no formatting, no intelligence.
pt_br: Nos primórdios da era computacional, o texto eletrônico era simples. Havia poucos conjuntos de caracteres como ASCII ou EBCDIC, e apenas isso. Texto era texto, e o que você lia era realmente o texto que você tinha. Sem frescuras, sem formatação, sem inteligência.
ru: В первые дни существования компьютеров электронный текст был простым. Существовало несколько наборов символов, таких как ASCII или EBCDIC, но на этом всё и заканчивалось. Текст был текстом, и вы видели именно то, что получали. Никаких изысков, никакого форматирования, никакого интеллекта.

source: Inevitably, this was not enough. When text is in a machine-usable format, machines are expected to be able to use and manipulate it intelligently. Authors want to indicate that certain phrases should be emphasized, or added to a glossary, or made into hyperlinks. Filenames could be shown in a “typewriter” style font for viewing on screen, but as “italics” when printed, or any of a myriad of other options for presentation.
pt_br: Inevitavelmente, isso não era suficiente. Quando o texto está em um formato utilizável por computadores, espera-se que eles possam usá-lo e manipulá-lo de maneira inteligente. Os autores querem indicar que certas frases devem ser enfatizadas, adicionadas a um glossário ou transformadas em hiperlinks. Os nomes dos arquivos podem ser apresentados em uma fonte de estilo "typewriter" para exibição na tela do computador, ou como "itálico" quando impressos, ou qualquer outra opção dentre uma infinidade de opções para apresentação.
ru: Неизбежно, этого оказалось недостаточно. Когда текст представлен в формате, пригодном для машинной обработки, ожидается, что машины смогут использовать и обрабатывать его интеллектуально. Авторы хотят указывать, что определённые фразы должны быть выделены, добавлены в глоссарий или преобразованы в гиперссылки. Имена файлов могут отображаться моноширинным шрифтом при просмотре на экране, но курсивом при печати или в любом другом из множества вариантов представления.

source: It was once hoped that Artificial Intelligence (AI) would make this easy. The computer would read the document and automatically identify key phrases, filenames, text that the reader should type in, examples, and more. Unfortunately, real life has not happened quite like that, and computers still require assistance before they can meaningfully process text.
pt_br: Esperava-se que a Inteligência Artificial (IA) facilitasse isso. O computador leria o documento e identificaria automaticamente frases-chave, nomes de arquivos, textos que o leitor deveria digitar, exemplos e outros tipos. Infelizmente, na vida real não foi dessa forma, e os computadores ainda precisam de assistência antes que possam processar o texto de maneira significativa.
ru: Однажды надеялись, что искусственный интеллект (ИИ) сделает это легко. Компьютер прочитает документ и автоматически определит ключевые фразы, имена файлов, текст, который читатель должен ввести, примеры и многое другое. К сожалению, в реальной жизни всё оказалось не так просто, и компьютерам до сих пор требуется помощь, прежде чем они смогут осмысленно обрабатывать текст.

source: More precisely, they need help identifying what is what. Consider this text:
pt_br: Mais precisamente, eles precisam de ajuda para identificar o que é o quê. Considere este texto:
ru: Точнее говоря, им нужна помощь в определении, что есть что. Рассмотрим этот текст:

source: To remove [.filename]#/tmp/foo#, use man:rm[1].
pt_br: Para remover [.filename]#/tmp/foo#, utilize o man:rm[1].
ru: Для удаления [.filename]#/tmp/foo# используйте man:rm[1].

source: It is easy for the reader to see which parts are filenames, which are commands to be typed in, which parts are references to manual pages, and so on. But the computer processing the document cannot reliably determine this. For this we need markup.
pt_br: É fácil identificar quais partes são nomes de arquivos, quais são comandos a serem digitados, quais partes são referências a páginas de manual e assim por diante. Mas o computador que processa o documento não consegue. Para isso, precisamos utilizar markup.
ru: Читателю легко понять, какие части являются именами файлов, какие — командами для ввода, какие — ссылками на страницы руководства и так далее. Однако компьютер, обрабатывающий документ, не может надежно определить это. Для этого нам нужна разметка.

source: The previous example is actually represented in this document like this:
pt_br: O exemplo anterior é representado neste documento da seguinte forma:
ru: Предыдущий пример фактически представлен в этом документе следующим образом:

source: To remove */tmp/foo*, use man:rm[1].
pt_br: Para remover */tmp/foo*, utilize o man:rm[1].

source: Headings
pt_br: Cabeçalhos
ru: Заголовки

source: Asciidoctor supports six headings levels. If the document type is `article` only one level 0 (`=`) can be used. If the document type is `book` then there can be multiple level 0 (`=`) headings.
pt_br: Asciidoctor suporta seis níveis de cabeçalhos. Se o tipo de documento for `artigo`, apenas um nível 0 (`=`) pode ser usado. Se o tipo de documento for `livro`, pode haver vários títulos de nível 0 (`=`).
ru: Asciidoctor поддерживает шесть уровней заголовков. Если тип документа `article`, можно использовать только один заголовок уровня 0 (`=`). Если тип документа `book`, то может быть несколько заголовков уровня 0 (`=`).

source: This is an example of headings in an `article`.
pt_br: Estes são exemplos de cabeçalhos em um `artigo`.
ru: Вот пример заголовков в `article`.

source: Document Title (Level 0)
pt_br: Título do Documento (Nível 0)
ru: Название документа (Уровень 0)

source: Level 1 Section Title
pt_br: Título da Seção de Nível 1
ru: Уровень 1 Название Раздела

source: Level 2 Section Title
pt_br: Título da Seção de Nível 2
ru: Уровень 2 Раздел Заголовок

source: Level 3 Section Title
pt_br: Título da Seção de Nível 3
ru: Уровень 3 Раздел Заголовок

source: Level 4 Section Title
pt_br: Título da Seção de Nível 4
ru: Уровень 4 Раздел Заголовок

source: ====== Level 5 Section Title
pt_br: ====== Título da Seção de Nível 5

source: Another Level 1 Section Title
pt_br: Outro Título de Seção de Nível 1
ru: Другой заголовок раздела первого уровня

source: Section levels cannot be skipped when nesting sections.
pt_br: Os níveis de seção não podem ser ignorados ao aninhar seções.
ru: Уровни разделов нельзя пропускать при вложении разделов.

source: The following syntax is not correct.
pt_br: A sintaxe a seguir não está correta.
ru: Следующий синтаксис неверен.

source: Document Title
pt_br: Título do Documento
ru: Заголовок документа

source: Level 1
pt_br: Nível 1
ru: Уровень 1

source: Level 3
pt_br: Nível 3
ru: Уровень 3

source: Paragraphs
pt_br: Parágrafos
ru: Абзацы

source: Paragraphs don't require special markup in AsciiDoc. A paragraph is defined by one or more consecutive lines of text. To create a new paragraph leave one blank line.
pt_br: Os parágrafos não precisam de marcação especial no AsciiDoc. Um parágrafo é definido por uma ou mais linhas consecutivas de texto. Para criar um novo parágrafo, deixe uma linha em branco.
ru: Абзацы не требуют специальной разметки в AsciiDoc. Абзац определяется одной или несколькими последовательными строками текста. Чтобы создать новый абзац, оставьте одну пустую строку.

source: For example, this is a heading with two paragraphs.
pt_br: Por exemplo, este é um título com dois parágrafos.
ru: Например, это заголовок с двумя абзацами.

source: This is the heading
pt_br: Este é o título
ru: Это заголовок

source: This is the first paragraph. This is also the first paragraph.
pt_br: Este é o primeiro parágrafo. Este também é o primeiro parágrafo.
ru: Это первый абзац. Это тоже первый абзац.

source: And this is the second paragraph.
pt_br: E este é o segundo parágrafo.
ru: А это второй абзац.

source: Lists
pt_br: Listas
ru: Списки

source: Asciidoctor supports a few types of lists, the most common are `ordered` and `unordered`. To get more information about lists, see link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/#lists[AsciiDoc Syntax Quick Reference].
pt_br: Asciidoctor suporta alguns tipos de listas, as mais comuns são `ordenadas` e` não ordenadas`. Para obter mais informações sobre listas, consulte o link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/#lists[Referência Rápida da Sintaxe AsciiDoc].
ru: Asciidoctor поддерживает несколько типов списков, наиболее распространённые — `ordered` и `unordered`. Для получения дополнительной информации о списках см. link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/#lists[AsciiDoc Syntax Quick Reference].

source: Ordered lists
pt_br: Listas ordenadas
ru: Упорядоченные списки

source: To create an ordered list use the `.` character.
pt_br: Para criar uma lista ordenada, use o caractere `.`.
ru: Для создания нумерованного списка используйте символ `.`.

source: For example, this is an ordered list.
pt_br: Por exemplo, esta é uma lista ordenada.
ru: Например, это нумерованный список.

source: . First item . Second item .. Subsecond item . Third item
pt_br: . Primeiro item . Segundo item .. Sub-segundo item . Terceiro item
ru: . Первый пункт . Второй пункт .. Подпункт второго пункта . Третий пункт

source: And this would be rendered as.
pt_br: E isso seria processado como.
ru: И это будет отображено как.

source: First item
pt_br: Primeiro item
ru: Первый пункт

source: Second item
pt_br: Segundo item
ru: Второй пункт

source: Subsecond item
pt_br: Sub-segundo item
ru: Подпункт второго пункта

source: Third item
pt_br: Terceiro item
ru: Третий пункт

source: Unordered lists
pt_br: Listas não ordenadas
ru: Неупорядоченные списки

source: To create an unordered list use the `*` character.
pt_br: Para criar uma lista não ordenada, use o caractere `*`.
ru: Для создания маркированного списка используйте символ `*`.

source: For example, this is an unordered list.
pt_br: Por exemplo, esta é uma lista não ordenada.
ru: Например, это ненумерованный список.

source: * First item * Second item ** Subsecond item * Third item
pt_br: * Primeiro item * Segundo item ** Sub-segundo item * Terceiro item
ru: * Первый пункт * Второй пункт ** Подпункт второго пункта * Третий пункт

source: External links
pt_br: Links externos
ru: Внешние ссылки

source: To point to another website the `link` macro should be used.
pt_br: Para apontar para outro site, a macro `link` deve ser usada.
ru: Чтобы указать на другой веб-сайт, следует использовать макрос `link`.

source: As the Asciidoctor documentation describes, the `link` macro is not required when the target starts with a URL scheme like `https`. However, it is a good practice to do this anyway to ensure that Asciidoctor renders the link correctly, especially in non-latin languages like Japanese.
pt_br: Como a documentação do Asciidoctor descreve, a macro `link` não é necessária quando o link começa com um esquema de URL como `https`. No entanto, é uma boa prática fazer o uso assim para garantir que o Asciidoctor renderize o link corretamente, especialmente em idiomas não latinos como o Japonês.
ru: Как описано в документации Asciidoctor, макрос `link` не требуется, когда цель начинается со схемы URL, такой как `https`. Тем не менее, рекомендуется всё равно использовать его, чтобы гарантировать корректное отображение ссылки в Asciidoctor, особенно в языках с нелатинской письменностью, таких как японский.

source: Links to another book or article
pt_br: Links para outro livro ou artigo
ru: Ссылки на другую книгу или статью

source: To point to another book or article the Asciidoctor variables should be used. For example, if we are in the `cups` article and we want to point to `ipsec-must` these steps should be used.
pt_br: Para apontar para outro livro ou artigo, as variáveis Asciidoctor devem ser usadas. Por exemplo, se estamos no artigo `cups` e queremos apontar para `ipsec-must`, esses passos devem ser usados.
ru: Для указания на другую книгу или статью следует использовать переменные Asciidoctor. Например, если мы находимся в статье `cups` и хотим сослаться на `ipsec-must`, необходимо выполнить следующие шаги.

source: Include the [.filename]#urls.adoc# file from [.filename]#~/doc/shared# folder.
pt_br: Inclua o arquivo [.filename]#urls.adoc# da pasta [.filename]#~/doc/shared#.
ru: Включите файл [.filename]#urls.adoc# из папки [.filename]#~/doc/shared#.

source: Then create a link using the Asciidoctor variable to the `ipsec-must` article.
pt_br: Em seguida, crie um link usando a variável Asciidoctor para o artigo `ipsec-must`.
ru: Затем создайте ссылку с использованием переменной Asciidoctor на статью `ipsec-must`.

source: The `extref` macro is defined as an extension. It is designed to render the correct link across the different outputs
pt_br: A macro `extref` é definida como uma extensão. Ela é projetada para renderizar o link correto entre as diferentes saídas
ru: Макрос `extref` определён как расширение. Он предназначен для корректного отображения ссылки в различных выходных форматах

source: Links to the same file or to another file in the same book
pt_br: Links para o mesmo arquivo ou para outro arquivo no mesmo livro
ru: Ссылки на тот же файл или на другой файл в той же книге

source: Books are structured in different directories to keep a sane layout. To create a link from one subdirectory of a book to another subdirectory of the same book, use the `crossref` macro:
pt_br: Os livros são estruturados em diretórios diferentes para manter um layout sensato. Para criar um link de um subdiretório de um livro para outro subdiretório do mesmo livro, use a macro `crossref`:
ru: Книги структурированы в разных каталогах для поддержания удобной организации. Чтобы создать ссылку из одного подкаталога книги в другой подкаталог той же книги, используйте макрос `crossref`:

source: crossref:doc-build[documentation-makefile, This link]
pt_br: crossref:doc-build[documentation-makefile, Este link]
ru: crossref:doc-build[documentation-makefile, Эта ссылка]

source: And this would be rendered as
pt_br: E isso seria renderizado como
ru: И это будет отображено как

source: crossref:doc-build[documentation-makefile, This link]
pt_br: crossref:doc-build[documentation-makefile, Este link]
ru: crossref:doc-build[documentation-makefile, Эта ссылка]

source: The `crossref` macro is defined as an extension. It is designed to render the correct link across the different outputs
pt_br: A macro `crossref` é definida como uma extensão. Ela é projetada para renderizar o link correto entre as diferentes saídas
ru: Макрос `crossref` определен как расширение. Он предназначен для формирования корректной ссылки в различных выходных форматах

source: Use the `crossref` macro for intra-document links too. Although it might be inconvenient to write the name of the current document, it ensures the correct link is rendered across the different outputs
pt_br: Use a macro `crossref` para links intra-documento também. Embora possa ser inconveniente escrever o nome do documento atual, ela garante que o link correto seja renderizado entre as diferentes saídas
ru: Используйте макрос `crossref` для внутридокументных ссылок. Хотя указание имени текущего документа может быть неудобным, это гарантирует корректное отображение ссылки в различных выходных форматах

source: Do not use either the `xref` macro or its shortcut `<<` `>>`. They do not work well in all output formats.
pt_br: Não use nem a macro `xref` nem seu atalho `<<` `>>`. Eles não funcionam bem em todos os formatos de saída.
ru: Не используйте макрос `xref` или его сокращение `<<` `>>`. Они не работают хорошо во всех выходных форматах.

source: Images and Icons
pt_br: Imagens e Ícones
ru: Изображения и иконки

source: Images and icons play a crucial role in enhancing the overall user experience. These visual elements are strategically integrated to convey information, clarify concepts, and provide a visually engaging interface.
pt_br: Imagens e ícones desempenham um papel crucial na melhoria da experiência geral do usuário. Esses elementos visuais são estrategicamente integrados para transmitir informações, esclarecer conceitos e fornecer uma interface visualmente envolvente.
ru: Изображения и иконки играют ключевую роль в улучшении общего пользовательского опыта. Эти визуальные элементы стратегически интегрированы для передачи информации, пояснения концепций и создания визуально привлекательного интерфейса.

source: Images
pt_br: Imagens
ru: Изображения

source: Images help illustrate complex concepts, making them more accessible to users.
pt_br: As imagens ajudam a ilustrar conceitos complexos, tornando-os mais acessíveis aos usuários.
ru: Изображения помогают проиллюстрировать сложные концепции, делая их более понятными для пользователей.

source: The first step will be to add the image in the images directory in the path:
pt_br: O primeiro passo será adicionar a imagem no diretório de imagens no caminho:
ru: Первым шагом будет добавление изображения в директорию `images` по пути:

source: [.filename]#~/website/static/images/# for the website.
pt_br: [.filename]#~/website/static/images/# para o website.
ru: [.filename]#~/website/static/images/# для веб-сайта.

source: [.filename]#~/documentation/static/images/# for the documentation.
pt_br: [.filename]#~/documentation/static/images/# para a documentação.
ru: [.filename]#~/documentation/static/images/# для документации.

source: For example, to add a new image to the FreeBSD installation process, the image will be saved to the path [.filename]#~/documentation/static/images/books/handbook/bsdinstall/new-image3.png#.
pt_br: Por exemplo, para adicionar uma nova imagem ao processo de instalação do FreeBSD, a imagem será salva no caminho [.filename]#~/documentation/static/images/books/handbook/bsdinstall/new-image3.png#.
ru: Например, чтобы добавить новое изображение в процесс установки FreeBSD, изображение сохраняется по пути [.filename]#~/documentation/static/images/books/handbook/bsdinstall/new-image3.png#.

source: The next step will be to configure the Asciidoctor attributes `images-path` and `imagesdir`.
pt_br: O próximo passo será configurar os atributos do Asciidoctor `images-path` e `imagesdir`.
ru: Следующим шагом будет настройка атрибутов Asciidoctor `images-path` и `imagesdir`.

source: We are going to use as an example the header of the extref:{freebsd-releng}[FreeBSD Release Engineering] article.
pt_br: Usaremos como exemplo o cabeçalho do artigo extref:{freebsd-releng}[Engenharia de Releases do FreeBSD].
ru: В качестве примера мы используем заголовок статьи extref:{freebsd-releng}[Подготовка релизов FreeBSD].

source: FreeBSD Release Engineering
pt_br: Engenharia de Release do FreeBSD
ru: Подготовка релизов FreeBSD

source: Makes reference to the path inside [.filename]#/static/images# folder.
pt_br: Faz referência ao caminho dentro da pasta [.filename]#/static/images#.
ru: Ссылается на путь внутри папки [.filename]#/static/images#.

source: Makes reference to the Asciidoctor attribute.
pt_br: Faz referência ao atributo Asciidoctor.
ru: Делает ссылку на атрибут Asciidoctor.

source: Once the image is in the correct path and the Asciidoctor attributes have been configured in the document, the `image` macro can be used.
pt_br: Uma vez que a imagem esteja no caminho correto e os atributos do Asciidoctor tenham sido configurados no documento, a macro `image` pode ser usada.
ru: Как только изображение окажется в нужном пути и атрибуты Asciidoctor будут настроены в документе, можно использовать макрос `image`.

source: This is an example:
pt_br: Este é um exemplo:
ru: Вот пример:

source: image::new-image3.png[New step in the FreeBSD install process]
pt_br: image::new-image3.png[Nova etapa no processo de instalação do FreeBSD]

source: To improve accessibility, it is mandatory to add descriptive text to each image.
pt_br: Para melhorar a acessibilidade, é obrigatório adicionar texto descritivo a cada imagem.
ru: Для улучшения доступности обязательно добавлять описательный текст к каждому изображению.

source: Icons
pt_br: Ícones
ru: Иконки

source: Icons serve as intuitive symbols for quick recognition and navigation.
pt_br: Os ícones servem como símbolos intuitivos para reconhecimento e navegação rápidos.
ru: Значки служат интуитивно понятными символами для быстрого распознавания и навигации.

source: The first step to use icons is to add the `icons` property to the Asciidoctor properties section, at the top of each document.
pt_br: O primeiro passo para usar ícones é adicionar a propriedade `icons` à seção de propriedades do Asciidoctor, no topo de cada documento.
ru: Первым шагом для использования иконок является добавление свойства `icons` в раздел свойств Asciidoctor в начале каждого документа.

source: Once the Asciidoctor icon property has been set an icon supported by link:https://fontawesome.com/v4/icons/[Font Awesome] can be added.
pt_br: Depois que a propriedade do ícone do Asciidoctor for definida, um ícone suportado pela link:https://fontawesome.com/v4/icons/[Font Awesome] pode ser adicionado.
ru: После установки свойства иконки Asciidoctor можно добавить иконку, поддерживаемую link:https://fontawesome.com/v4/icons/[Font Awesome].

source: This is an example about how to use the `envelope` icon:
pt_br: Este é um exemplo de como usar o ícone `envelope`:
ru: Это пример использования иконки `envelope`:

source: To improve the accessibility of the website, the `title` attribute is mandatory.
pt_br: Para melhorar a acessibilidade do site, o atributo `title` é obrigatório.
ru: Для повышения доступности веб-сайта атрибут `title` является обязательным.
