Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/asciidoctor-primer/_index.po
Languages: pt_br, ru

source: Conclusion
pt_br: Conclusão
ru: Заключение

source: This is the conclusion of this Asciidoctor primer. For reasons of space and complexity, several things have not been covered in depth (or at all).
pt_br: Esta é a conclusão deste primer do Asciidoctor. Por razões de espaço e complexidade, várias assuntos não foram abordadas em profundidade (ou completamente).
ru: Это заключение введения в Asciidoctor. Из-за ограничений по объёму и сложности некоторые аспекты не были рассмотрены глубоко (или вообще не затронуты).

source: extref:{ipsec-must}[IPSec-Must article]
ru: extref:{ipsec-must}[Статья IPSec-Must]

source: extref:{ipsec-must}[IPSec-Must article]
ru: extref:{ipsec-must}[Статья IPSec-Must]

source: :imagesdir: ../../../images/{images-path} <2> endif::[]
ru: :imagesdir: ../../../images/{images-path} <2> endif::[] endif::[]
