freebsd/freebsd-doc/ja/man/man1/mkdosfs.1
.\"
.\" Copyright (c) 1995, 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: mkdosfs.1,v 1.3 1996/08/23 00:56:16 mpp Exp %
.\" jpman %Id: mkdosfs.1,v 1.3 1997/08/20 12:37:06 horikawa Stab %
.\"
.Dd November 5, 1995
.Os
.Dt MKDOSFS 1
.Sh 名称
.Nm mkdosfs
.Nd MS-DOS (FAT) ファイルシステムを構築する
.Sh 書式
.Nm mkdosfs
.Bq Fl f Ar capacity
.Bq Fl L Ar vollabel
.Ar device
.Sh 解説
.Nm mkdosfs
は
.Ar device
上に、
.Xr mount_msdos
や古いプログラムローダが理解するファイルシステムを構築します。
.Ar device
としては、既存の書き込み可能なファイルやデバイスなら何でも指定できますが、
通常はフロッピディスクドライブに対するキャラクタデバイス
.Pq 例 Pa /dev/rfd0
を指定します。
通常のファイルを指定した場合、それは MS-DOS ファイルシステムの
ダンプイメージとして扱われます。
ファイルシステムの構造のみそこに書き込まれ、
ファイルサイズが切り詰められることはありません。
.Pp
オプションは以下の通りです:
.Bl -tag -width 10n -offset indent
.It Fl f Ar capacity
容量
.Ar capacity
キロバイトの標準的なファイルシステムのデフォルト値を用います。
現在のところ
.Ar capacity
としては 360, 720, 1200 および 1440 が指定できます。
.Pp
このオプションを指定しない場合、
.Nm
は
.Ar device
のサイズを決定しようとします。
これは必ずしも全ての場合にうまくいくとは限りませんが、
普通の状況では正しく動作すると考えられます。
.It Fl L Ar vollabel
ファイルシステムを記述するラベルとして、デフォルトの
.Ql 4.4BSD
ではなく
.Ar vollabel
を用います。
.El
.Pp
ファイルシステムの構造は大きく分けて 3 つの領域から構成されます:
.Bl -tag -width 10n -offset indent
.It Em ブートセクタ
これが一番最初の(512 バイトの)セクタです。
このセクタには、通常はオペレーティングシステムをブートストラップする
実行コードが書き込まれています。
媒体上にオペレーティングシステムをインストールするのは
.Nm
の範疇を越えるので、このブートコードは単に
「このディスクにはブート可能なシステムは含まれません」
というメッセージを表示するだけです。
.Em ブートセクタ
の中には
.Em BIOS パラメタブロック (BPB)
があり、
ファイルシステムに関するいくつかの統計的なパラメタが保持されています。
.It Em ファイルアロケーションテーブル (FAT)
.Em ブートセクタ
に続くセクタは FAT を保持しています。
FAT はファイルを構成するブロック群のポインタ鎖を保持すると共に、
ファイルシステムのアロケーション情報の登録にも用いられます。
通常 FAT の全く同一のコピーが 2 組存在します。
.It Em ルートディレクトリ
最後の構造は、この媒体に対するルートディレクトリです。
これは 0 で埋められた予約空間に過ぎず、
残念なことにサイズは固定されています。
.Nm mkdosfs
はルートディレクトリを空で初期化し、
その一番最初のディレクトリスロットにボリュームラベルを書き込みます。
.Sh 診断
処理が成功すると終了ステータス 0 が返されます。
ファイルシステム構築時に何らかのエラーが発生した場合は 1 が返され、
プログラムに対して無効な引数が与えられた場合は
(適切な情報を診断出力に書き出すと共に)終了ステータス 2 が返されます。
.Sh 関連項目
.Xr fdformat 1 ,
.Xr mount_msdos 8 ,
.Xr newfs 8 .
.Sh バグ
現在のところ、曖昧なファイルシステムパラメタを指定する方法は
用意されていません。
従って、サポートされている容量の媒体以外はフォーマットできません。
同じ理由から、ハードディスクのパーティションを処理することもできません。
これを可能にするには更に多くのオプションを追加する必要があり、
また、更に多くのエントリを既知フォーマット表に登録する必要もあります。
.Pp
媒体の欠陥には対処しようとしていませんが、
これは
.Nm mkdosfs
の範疇を越えることであり、(まだ存在しませんが)
.Xr dosfsck 1
のほうで対処すべきことでしょう。
.Sh 歴史
.Nm mkdosfs
は
.Fx 2.2
から登場しました。
.Sh 作者
このプログラムは Dresden の
.if n Joerg Wunsch
.if t J\(:org Wunsch
から寄贈されました。
