freebsd/freebsd-doc/ja/man/man1/pkg_delete.1
.\"
.\" FreeBSD install - a package for the installation and maintainance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" Jordan K. Hubbard
.\"
.\"
.\"     @(#)pkg_delete.1
.\" jpman %Id: pkg_delete.1,v 1.3 1997/06/09 08:35:00 jsakai Stab %
.\"
.Dd November 25, 1994
.Dt pkg_delete 1
.Os FreeBSD
.Sh 名称
.Nm pkg_delete
.Nd インストールされているソフトウェア配布パッケージを削除するプログラム
.Sh 書式
.Nm
.Op Fl vDdnf
.Op Fl p Ar prefix
.Ar pkg-name ...
.Sh 解説
.Nm
コマンドは、
.Xr pkg_add 1
コマンドにより既にインストールされているパッケージを削除するために
用いられます。

.Sh 警告
.Bf -emphasis
.Nm
コマンドはパッケージファイルにより提供されるスクリプトやプログラムを
実行することがあるので、あなたのシステムは、危険な配布ファイルを
作る極悪人からの「トロイの木馬」や他の巧妙な攻撃などを受ける
可能性があります。
.Pp
パッケージファイルを提供する人物の能力と身元を確認するとよいでしょう。
より進んだ安全のためには、パッケージ記録ディレクトリ (
.Pa /var/db/pkg/<pkg-name>/
) にあるすべてのパッケージ制御ファイルを確認します。
+INSTALL 、 +DEINSTALL 、 +REQUIRE 、 +MTREE_DIRS の各ファイルには
特に注意を払い、+CONTENTS ファイルの
.Cm @cwd
、
.Cm @mode
(setuid をチェック)、
.Cm @dirrm
、
.Cm @exec
、
.Cm @unexec
ディレクティブを調べてください。
インストールされているパッケージ制御ファイルを調べるのには
.Xr pkg_info 1
コマンドも使えます。
.Ef

.Sh オプション
以下のコマンドラインオプションが提供されいます:
.Bl -tag -width indent
.It Ar pkg-name ...
指定されたパッケージがアンインストールされます。
.It Fl v
饒舌な出力に切り替えます。
.It Fl D
パッケージにアンインストール用スクリプトが存在しても、それを実行しません。
.It Fl n
実際にはアンインストールは行わず、アンインストールした場合に実行されるであろう
ステップを表示します。
.It Fl p Ar prefix
インストールされているパッケージが明示的にディレクトリを設定していない
場合に、削除するファイルの前に
.Ar prefix
をディレクトリとして付け加えます。
ほとんどのパッケージでは、このディレクトリは
.Xr pkg_add 1
によってインストールされた場所に自動的に設定されます。
.It Fl d
ファイル削除により生じた空のディレクトリを削除します。
デフォルトでは、パッケージの内容一覧に明示的に羅列された
ファイル/ディレクトリ (通常のファイル/ディレクトリか
.Cm @dirrm
ディレクトリを伴ったもの) のみがアンインストール時に削除されます。
このオプションにより
.Nm
はパッケージを削除することにより生ずる空ディレクトリも削除するように
なります。
.It Fl f
依存関係が記録されていたり、アンインストールスクリプトや
 require スクリプトが失敗した場合でも、強制的にパッケージを削除します。
.El

.Pp
.Sh 技術詳細
.Nm
は名前の通りに働きます。
.Nm
は
.Pa /var/db/pkg/<pkg-name>
に記録されたインストール済みのパッケージをチェックし、
パッケージの内容を削除し、最後にパッケージの記録も削除します。
.Pp
あるパッケージが他のインストール済みのパッケージから必要とされている場合、
.Nm
はそれらの依存しているパッケージの一覧を表示し、パッケージの削除は
行いません (ただし
.Fl f
オプションが指定された場合を除く)。
.Pp
パッケージが
.Ar require
ファイル(
.Xr pkg_create 1
を参照)を含んでいる場合、まずそのファイルを以下の引数を付けて実行し、
アンインストール作業を続けるべきかどうかを確かめます:
.Bd -filled -offset indent -compact
.Cm require
.Ar <pkg-name>
.Ar DEINSTALL
.Ed
(ここで
.Ar pkg-name
は問題としているパッケージの名前であり、
.Ar DEINSTALL
はこれがアンインストールであることを示すキーワードです)
終了ステータスが 0 以外の場合には、
.Fl f
オプションが指定されていない限りアンインストールを中断します。
.Pp
パッケージに
.Cm deinstall
スクリプトが含まれている場合、
そのスクリプトはファイルが削除される前に実行されます。
.Nm
はオリジナルのパッケージに含まれていたファイルを削除することしか
関知しないので、
パッケージのインストールにまつわる雑多な事項をきれいに片づけるのは
この
.Cm deinstall
スクリプトの責任です。
.\" since all ... 以下はなくてもどうにか意味が通じるだろう、という
.\" のとうまい訳が見つからなかったので加えていません。
.\" By kuriyama@opt.phys.waseda.ac.jp (Jun 3 1997)
.\" --> 訳してみました。By sakai@jp.freebsd.org (Jun 9, 1997)
.Nm deinstall
スクリプトは以下の引数を付けて実行されます:
.Bd -filled -offset indent -compact
.Cm deinstall
.Ar <pkg-name>
.Ar DEINSTALL
.Ed
渡されるキーワード
.Ar DEINSTALL
はインストールとアンインストールの両方を扱える一つのプログラム/
スクリプトを作ることを可能にするためにあります。
.Pp
すべてのスクリプトは環境変数
.Ev PKG_PREFIX
にインストール時の prefix が設定された状態で実行されます (上記の
.Fl p
オプションを参照)。
このことにより、パッケージの作者は
.Nm
や
.Cm pkg_add
の
.Fl p
フラグによりパッケージがインストールされるディレクトリが
変更されても、きちんとふるまうスクリプトを書くことが可能になります。
.Sh 関連項目
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_info 1 ,
.Xr mktemp 3 ,
.Xr mtree 8 .
.Sh 作者
.Bl -tag -width indent -compact
.It "Jordan Hubbard"
ほとんどの仕事
.It "John Kohl"
NetBSD 向け修正
.El
.Sh バグ
まだあるはずです。
