freebsd/freebsd-doc/ja/man/man1/uustat.1
''' %Id: uustat.1,v 1.6 1996/02/02 00:26:06 mpp Exp %
.\" jpman %Id: uustat.1,v 1.2 1997/03/29 11:58:00 horikawa Stab %
.TH uustat 1 "Taylor UUCP 1.06"
.SH 名称
uustat \- UUCP システム状態のチェックや制御を行なう
.SH 書式
.B uustat \-a
.PP
.B uustat \-\-all
.PP
.B uustat
[
.B \-eKRiMNQ ] [
.B \-sS
system ] [
.B \-uU
user ] [
.B \-cC
command ] [
.B \-oy
hours ] [
.B \-B
lines ] [
.B \-\-executions
] [
.B \-\-kill-all
] [
.B \-\-rejuvenate-all
] [
.B \-\-prompt
] [
.B \-\-mail
] [
.B \-\-notify
] [
.B \-\-no-list
] [
.B \-\-system
system ] [
.B \-\-not-system
system ] [
.B \-\-user
user ] [
.B \-\-not-user
user ] [
.B \-\-command
command ] [
.B \-\-not-command
command ] [
.B \-\-older-than
hours ] [
.B \-\-younger-than
hours ] [
.B \-\-mail-lines
lines ]
.PP
.B uustat
[
.B \-kr
jobid ] [
.B \-\-kill
jobid ] [
.B \-\-rejuvenate
jobid ]
.PP
.B uustat \-q [
.B \-sS
system ] [
.B \-oy
hours ] [
.B \-\-system
system ] [
.B \-\-not-system
system ] [
.B \-\-older-than
hours ] [
.B \-\-younger-than
hours ]
.PP
.B uustat \-\-list [
.B \-sS
system ] [
.B \-oy
hours ] [
.B \-\-system
system ] [
.B \-\-not-system
system ] [
.B \-\-older-than
hours ] [
.B \-\-younger-than
hours ]
.PP
.B uustat \-m
.PP
.B uustat \-\-status
.PP
.B uustat \-p
.PP
.B uustat \-\-ps
.SH 解説
.I uustat
コマンドは、UUCPシステムに関するいろんな情報を表示します。また、
本コマンドを用いることで、
.I uucp
(1) や
.I uux
(1)で作成されたジョブを取り消したり、ジョブのタイムスタンプの若返りを行なったりすることが
出来ます。

デフォルトでは、
.I uustat
は、コマンド
を起動したユーザが要求したジョブをすべて表示します。これは、
.B \-\-user
オプションで自分を指定した場合の動作と同じです。

.B \-a,
.B \-\-all,
.B \-e,
.B \-\-executions,
.B \-s,
.B \-\-system,
.B \-S,
.B \-\-not-system,
.B \-u,
.B \-\-user,
.B \-U,
.B \-\-not-user,
.B \-c,
.B \-\-command,
.B \-C,
.B \-\-not-command,
.B \-o,
.B \-\-older-than,
.B \-y,
.B \-\-younger-than
のいずれかのオプションが指定されると、指定条件の組合せに合致するすべてのジョブを
表示します。

.B \-K
または
.B \-\-kill-all
オプションは、要求してから7日間経過した全てのジョブのような、選択したグルー
プのジョブを削除出来ます。
.SH オプション
.I uustat
では、以下のオプションが使用可能です。
.TP 5
.B \-a, \-\-all
キューイングされたすべてのファイル転送要求を表示します。
.TP 5
.B \-e, \-\-executions
ファイル転送要求ではなく、
コマンド実行要求を表示します。キューイングされた
コマンド実行要求は、
.I uucico
(8) ではなく
.I uuxqt
(8) にて処理されます。
キューイング中のコマンド実行要求には、リモートシステムから転送される
ファイルを待っているものもあります。これらの要求は、
.I uux
(1)を起動することで作成されます。
.TP 5
.B \-s system, \-\-system system
指定したシステムに対するジョブをすべて表示します。本オプションは、
1回のコマンド起動時に複数指定することが可能です。
この場合、指定したシステムに対応するジョブが全て表示されます。
.B \-\-list
オプションと共に指定したときは、指定したシステムのジョブだけが表示されます。
.TP 5
.B \-S system, \-\-not-system system
指定したシステム向け以外のジョブをすべて表示します。本オプションは、
1回のコマンド起動時に複数指定することが可能です。
この場合、指定しなかったシステムのジョブが全て表示されます。
.B \-\-list
オプションと共に指定したときは、指定しなかったシステムのジョブだけが表示されます。
なお、本オプションは、
.B \-s
や
.B \-\-system
とは同時に指定してはいけません。
.TP 5
.B \-u user, \-\-user user
指定したユーザのジョブをすべて表示します。本オプションは、
1回のコマンド起動時に複数指定することが可能です。
この場合、指定したユーザのジョブが全て表示されます。
.TP 5
.B \-U user, \-\-not-user user
指定したユーザのジョブを除くジョブをすべて表示します。本オプションは、
1回のコマンド起動時に複数指定することが可能です。
この場合、指定しなかったユーザのジョブが全て表示されます。
なお、本オプションは、
.B \-u
や
.B \-\-user
とは同時に指定してはいけません。
.TP 5
.B \-c command, \-\-command command
指定したコマンドの実行を要求するジョブをすべて表示します。
.B command
を
.I ALL
と指定した場合、すべての(単なる
.I uucp
ファイル転送ではない)コマンドの実行を要求するジョブ
を表示します。本オプションは、1回のコマンド起動時に複数指定することが
可能です。
この場合、指定したコマンドの実行を要求するジョブが全て表示されます。
.TP 5
.B \-C command, \-\-not-command command
指定したコマンド以外の実行を要求するジョブをすべて表示します。
.B command
が
.I ALL
と指定した場合、
単なる
.I uucp
ファイル転送要求がすべて表示されます。
本オプションは、1回のコマンド起動時に複数指定することが
可能です。
この場合、指定したコマンドの実行を要求しないジョブが全て表示されます。
なお、本オプションは、
.B \-c
や
.B \-\-command
と同時に指定してはいけません。
.TP 5
.B \-o hours, \-\-older-than hours
キューイングされてから指定した時間(単位:時間)以上超過した
ジョブを全て表示します。
.B \-\-list
オプションと共に指定した場合は、
そのシステムに関するもっとも古いジョブが、指定した時間より
古いという条件を満たすシステムの名前だけを表示します。
.TP 5
.B \-y hours, \-\-younger-than hours
キューイングされてから経過した時間が指定した時間(単位:時間)を
超過していないジョブを全て表示します。
.B \-\-list
オプションと共に指定した場合は、
そのシステムに関するもっとも古いジョブが指定した時間より
新しいという条件を満たすシステムの名前だけを表示します。
.TP 5
.B \-k jobid, \-\-kill jobid
指定したジョブを削除します。jobidは、デフォルトの出力結果から取得可能
です。また、
.I uucp
(1) や
.I uux
(1)にて
.B \-j
や
.B \-\-jobid
オプションを付加して実行することで、当該ジョブのジョブidを取得する
ことも出来ます。
ジョブの削除を行なうことが出来るのは、ジョブを要求したユーザ、UUCP
システム管理者、もしくはスーパーユーザです。
.B \-k
や
.B \-\-kill
オプションは、1回のコマンド実行で複数回指定することが可能です。
.TP 5
.B \-r jobid, \-\-rejuvenate jobid
指定したジョブのジョブ時刻を、本コマンドを起動した時刻に変更します。
このことにより、
.B \-o,
.B \-\-older-than,
.B \-y,
.B \-\-younger-than
の各オプションの出力結果に影響が出ます。
このオプションの使用により、
クリーンアップデーモンにより削除されるのを免れることができます。
jobidは、デフォルトの出力結果から取得可能
です。また、
.I uucp
(1) や
.I uux
(1)にて
.B \-j
や
.B \-\-jobid
オプションを付加して実行することで、当該ジョブのジョブidを取得する
ことも出来ます。
本操作を行なうことが出来るのは、ジョブを要求したユーザ、UUCPシステム管
理者、もしくはスーパーユーザです。
.B \-r
や
.B \-\-rejuvenate
オプションは、1回のコマンド実行で複数回指定することが可能です。
.TP 5
.B \-q, \-\-list
要求がキューイングされている全てのリモートシステムに対する要求の
ステータス、そして対話のステータスを表示します。
.B \-s,
.B \-\-system,
.B \-S,
.B \-\-not-system,
.B \-o,
.B \-\-older-than,
.B \-y,
.B \-\-younger-than
の各オプションはシステムの表示を制限するために用います。要求がキューイングさ
れていないシステムは表示されません。
.TP 5
.B \-m, \-\-status
すべてのリモートシステムとの対話のステータスを表示します。
.TP 5
.B \-p, \-\-ps
UUCPロックまたはポートを保持するすべての処理のステータスを表示します。
.TP 5
.B \-i, \-\-prompt
各ジョブについて、削除するかどうかを問い合わせるよう指示します。その
問い合わせに対してユーザが
.I y
もしくは
.I Y
を先頭に含む文字列を入力した場合(y もしくは Y だけでも)、そのジョブ
は削除されます。
.TP 5
.B \-K, \-\-kill-all
各ジョブを自動的に削除します。本機能は、
.B \-\-mail
や
.B \-\-notify
オプションと組み合わせて使用することで、自動メンテナンスを行なう
スクリプトを作成するのに役立ちます。
.TP 5
.B \-R, \-\-rejuvenate-all
指定したジョブを自動的に若返らせます。本オプションは
.B \-\-kill-all
と同時に指定できません。
.TP 5
.B \-M, \-\-mail
各ジョブについて、UUCPシステム管理者に対してメールを送ります。もし
ジョブが(
.B \-\-kill-all
や
.B \-\-prompt
を用いることで)削除された場合、その旨がメールに明記されます。
.B \-\-comment
オプションで指定したコメントについても、そのメールの中に含まれます。
ジョブが実行された場合、標準入力から入力された最初の部分がメールの
メッセージに含まれます。
メールに含まれる行数は、
.B \-\-mail-lines
オプションで設定可能です(デフォルトでは100行です)。
標準入力からの入力データがNULLキャラクタを含む場合、そのファイルはバイナリ
ファイルであるとみなされ、メールには含まれません。
.TP 5
.B \-N, \-\-notify
各ジョブについて、要求を行なったユーザに対してメールを送ります。メール
の内容については、
.B \-M
や
.B \-\-mail
オプションで説明したものと同一です。
.TP 5
.B \-W comment, \-\-comment comment
.B \-M,
.B \-\-mail,
.B \-N,
.B \-\-notify
の各オプションでメールを送る際に、そのメールに含めるコメントを指定します。
.TP 5
.B \-B lines, \-\-mail-lines lines
.B \-M,
.B \-\-mail,
.B \-N,
.B \-\-notify
のいずれかのオプションで、
標準入力を用いるコマンドを実行するジョブの結果をメールで送るように
指定している場合、メールに含める標準入力の行数を指定します。
デフォルトは 100行です。
.TP 5
.B \-Q, \-\-no-list
.B \-i,
.B \-\-prompt,
.B \-K,
.B \-\-kill-all,
.B \-M,
.B \-\-mail,
.B \-N
.B \-\-notify
オプションと同時に使用します。ジョブの表示を行なわず、
指定した動作のみ行います。
.TP 5
.B \-x type, \-\-debug type
特定のデバッグタイプを指定します。タイプとしては、abnormal, chat, 
handshake, uucp-proto, proto, port, config, spooldir, execute, incoming,
outgoing がありますが、
.I uustat
では、abnormal, config, spooldir ,execute のみが意味を持ちます。
本オプションでは、コンマで区切ることで複数のデバッグタイプが指定可能です。そして、
.B \-\-debug
オプションは、1回のコマンド起動で複数回指定可能です。
また、タイプとして数字を指定することも可能です。例えば、
.B \-\-debug 2
という指定は、
.B \-\-debug abnormal,chat
と同じ意味です。
.TP 5
.B \-I file, \-\-config file
使用する設定ファイルの指定を行ないます。ただし、本
オプションは、本コマンドの
コンパイル条件によっては使用できないことがあります。
.TP 5
.B \-v, \-\-version
バージョン情報を表示します。実行は行ないません。
.TP 5
.B \-\-help
ヘルプメッセージを表示します。実行は行ないません。
.SH 使用例
.br
.nf
uustat --all
.fi
全てのジョブのステータスを表示します。出力例を以下に示します。
.br
.in +0.5i
.nf
bugsA027h bugs ian 04-01 13:50 Executing rmail ian@airs.com (sending 1283 bytes)
.fi
.in -0.5i
フォーマットは、以下の通りです。
.br
.in +0.5i
.nf
jobid system user queue-date command (size)
.fi
.in -0.5i
jobid は、
.B \-\-kill
もしくは
.B \-\-rejuvenate
オプションで主に使用します。
size は、リモートシステムにどれだけのデータが転送されるかを示します。
また、ファイル受信要求の場合は表示されません。
.B \-\-system,
.B \-\-not-system,
.B \-\-user,
.B \-\-not-user,
.B \-\-command,
.B \-\-not-command,
.B \-\-older-than,
.B \-\-younger-than
オプションは、ジョブの表示制御のために用いられます。

.br
.nf
uustat --executions
.fi
キューイングされたコマンド実行ジョブのステータスを表示します。出力
例を以下に示します。
.br
.in +0.5i
.nf
bugs bugs!ian 05-20 12:51 rmail ian
.fi
.in -0.5i
フォーマットは以下の通りです。
.br
.in +0.5i
.nf
system requestor queue-date command
.fi
.in -0.5i
.B \-\-system,
.B \-\-not-system,
.B \-\-user,
.B \-\-not-user,
.B \-\-command,
.B \-\-not-command,
.B \-\-older-than,
.B \-\-younger-than
オプションは、ジョブの表示制御のために用いられます。

.br
.nf
uustat --list
.fi
全てのシステムについてキューイングされたコマンドのステータスを表示します。以
下に出力例を示します。
.br
.in +0.5i
.nf
bugs            4C (1 hour)   0X (0 secs) 04-01 14:45 Dial failed
.fi
.in -0.5i
システム、キューイングされたコマンド数、
もっとも古いコマンドがキューイングされてからの時間、
キューイングされたローカル実行数と
もっとも古いコマンドがローカル実行キューイングされてからの時間、
最後の対話の日時とステータスが表示されています。

.br
.nf
uustat --status
.fi
全てのリモートシステムについて対話のステータスを表示します。出力例を以下に示
します。
.br
.in +0.5i
.nf
bugs           04-01 15:51 Conversation complete
.fi
.in -0.5i
システム、最後の対話の日時とステータスが示されています。最後の対話が失敗した
場合、
.I uustat
はシステムを呼び出そうとした回数を表示します。
次のリトライ間隔までシステムを呼び出せないときには
.I uustat
は次にコールできる時刻を表示します。

.br
.nf
uustat --ps
.fi
UUCPロックしている全てのプロセスのステータスを表示します。
.I uustat
は単にロックしている各プロセス上で
.I ps
(1) を起動するだけなので、出力書式はシステムにより異なります。

.br
.in +0.5i
.nf
uustat --command rmail --older-than 168 --kill-all --no-list --mail --notify --comment "Queued for over 1 week"
.fi
.in -0.5i
これは一週間(168 時間)以上配送待ちになっているキューイングされている全ての
.I rmail
コマンドの実行を取り止めます。各コマンドに対し、UUCP 管理者と rmail の実行を
要求したユーザの双方にメールが送られます。メールには
.B \-\-comment
オプションで指定した文字列が含まれています。
.B \-\-no-list
オプションはジョブの出力を端末に出力しません。このときプログラムから出力される
のはエラーメッセージだけです。
.SH 関連ファイル
関連ファイル名は、コンパイル時の指定により変化します。以下に挙げるものは、
一例です。

.br
/usr/lib/uucp/config - 初期化ファイル
.br
/usr/spool/uucp -
UUCP スプールディレクトリ
.SH 関連項目
ps(1), rmail(8), uucp(1), uux(1), uucico(8), uuxqt(8)
.SH 作者
Ian Lance Taylor
(ian@airs.com)
