freebsd/freebsd-doc/ja/man/man1/window.1
.\" Copyright (c) 1985, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Edward Wang at The University of California, Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)window.1	8.2 (Berkeley) 12/30/93
.\" jpman %Id: window.1,v 1.3 1997/08/31 14:19:38 horikawa Stab %
.\"
.Dd December 30, 1993
.Dt WINDOW 1
.Os BSD 4.3
.Sh 名称
.Nm window
.Nd ウインドウ環境を実現します
.Sh 書式
.Nm window
.Op Fl t
.Op Fl f
.Op Fl d
.Op Fl e Ar escape-char
.Op Fl c Ar command
.Sh 解説
.Nm window
は、 
.Tn ASCII
端末上でウインドウ環境を実装します。
.Pp
ウインドウとは物理的な端末スクリーンの中の部分的な長方形部分を指し、
ここをプロセスの集合が利用します。その大きさと位置はユーザがいつでも
変更できます。プロセスは
標準入力、標準出力、標準エラー出力を通して端末と通信する通常の方法と
同じ方法で、そのウインドウと通信します。
ウインドウプログラムはそのウインドウに対する入力と出力のリダイレクトに関する
細かい処理を行います。どんな時でも、 1 つのウインドウだけがキーボードからの
入力を受けることが出来ますが、全てのウインドウが同時にディスプレイへの出力を
送ることが可能です。
.Pp
.Nm window
が立ち上がった時、ユーザのホームディレクトリにある
.Pa .windowrc
内のコマンドが実行されます。もしこのファイルが存在しない時は、
デフォルトとして同じ大きさのウインドウが 2 つ作成されます。
.Pp
コマンドラインオプションには以下のものがあります。
.Bl -tag -width Fl
.It Fl t
terse モードをオンにします
(以下の
.Ic terse
コマンドを参照)。
.It Fl f
高速モードです。スタートアップ動作は何もしません。
.It Fl d
.Pa .windowrc
を無視する代わりに 2 つのデフォルトウインドウを作成します。
.It Fl e Ar escape-char 
エスケープ文字を
.Ar escape-char
にします。
.Ar escape-char
は文字 1 つか、もしくは 
.Ic ^X
.Ns ( No control\- Ns Ar X
) のような形式です
.Ns ( Ar X
はどんな文字でも構いません)。
.It Fl c Ar command 
.Ar command
をロングコマンド(以下参照)として最初に実行します。
.El
.Pp
ウインドウはオーバラップ可能で、枠が必要です。
各ウインドウには、``1'' から ``9'' の数字のうちの一つの名前が
付いています。この一文字の識別子は、ユーザが定義できるラベル文字と
同じように、ウインドウのフレームの上の辺に表示されます。
ウインドウは
.Ar フォアグラウンド
にあるように設計されています。フォアグランドウインドウは、
普通の他のフォアグラウンドではないウインドウよりもつねに上にあります。
このウインドウより上になるのは、他のフォアグランドウインドウだけです。
ウインドウは、端末画面の辺内に完全に入っている必要はありません。
したがって、(画面よりも大きくても良い)大きいウインドウは、その全画面の
一部分だけが表示されるでしょう。
.Pp
各ウインドウは、カーソルと制御機能を持っています。最も知的な端末操作、
すなわち行や文字消去や挿入が提供されています。下線を引いたり反転表示等の
ディスプレイモードは、端末によって提供されている場合には、利用可能です。
更に、複数ページ分のメモリがある端末と同じように、各ウインドウは
ウインドウ画面に表示されるよりも多くの行を保持できるテキストバッファを
持っています。
.Ss プロセス環境
新しく作成されたウインドウでは、
呼び出されたウインドウからプロセス環境を引き継いで、
シェルプログラムが実行されます。
標準入力・出力・エラー出力は、仮想端末 (
.Xr pty 4 
参照) または、
.Ux
ドメインのソケット (
.Xr socketpair 2 
参照)と結びつけられます。
仮想端末が使われている場合、特別な文字やモード(
.Xr stty 1 
参照)は、物理端末から複製されます。
このウインドウに対する
.Xr termcap 5
のエントリが作成されて、環境として(
.Xr environ 7 
参照)変数
.Ev TERMCAP  
に渡されます。
termcap エントリには、下線・反転表示・その他の表示モード・
可能であれば端末のファンクションキーによって生み出されるコード等の
物理端末からの情報と同じように、ウインドウの大きさや特徴が含まれています。
更に、仮想端末のウインドウサイズ属性は、ウインドウの大きさを反映するように
設定され、その大きさが変更された場合はその情報が更新されます。
特に、エディタ
.Xr vi 1
は、この情報を画面を再表示するために利用します。
.Ss 操作
普通の実行中には、
.Nm window
は、二つの状態の内の一つの状態にあります。
この二つの状態は、会話モードとコマンドモードです。
会話モードでは、端末の実際のカーソルは、特定のウインドウのカーソル位置
に位置します。この特定のウインドウはカレントウインドウと呼ばれます。
そして、キーボードからの入力は、そのウインドウにあるプロセスに
送られます。カレントウインドウは、他のウインドウがフォアグランドに
ある時を除いて、いつも他のウインドウよりも上にあります。
更に、その識別子とラベルは反転表示で強調されています。
.Pp
.Nm window 
のエスケープ文字 (通常は、
.Ic ^P 
です) を入力することで、会話モードからコマンドモードへ移行します。
コマンドモードでは、端末画面の一番上の行は
コマンドプロンプトウインドウに変わり、
.Nm window
はキーボードからの入力をウインドウを操作するコマンドであると解釈します。
.Pp
二つの種類のコマンドがあります。短いコマンドは普通 1文字ないし 2文字
から構成されます。長いコマンドはコマンドウインドウ (以下の
.Dq Ic \&:
コマンドを参照) で入力される文字列もしくは、ファイル (以下の
.Ic source
参照) から読み込まれます。
.Ss 短いコマンド
以下では、
.Ar \&#
は、ウインドウ 1 から 9 に結びつけられた、
数字の ``1'' から ``9'' のひとつを表現します。
.Ic ^X
は、
.No control\- Ns Ar X  
を意味します。ここで、
.Ar X
は任意の文字です。
特に、
.Ic ^^
は、
.Li control\-^
です。
.Ar escape
はエスケープキーもしくは、
.Ic ^\&[ 
です。
.Bl -tag -width Ds
.It Ar #
ウインドウ
.Ar #
をカレントウインドウとして選択し、会話モードに戻ります。
.It Ic \&% Ns Ar # 
ウインドウ
.Ar #
を選択しますが、コマンドモードのままです。
.It Ic ^^
一つ前のウインドウを選択し、会話モードに戻ります。
これは、二つのウインドウの間を交互に移動する時に便利です。
.It Ic escape
会話モードに戻ります。
.It Ic ^P
会話モードに戻り、現在のウインドウに
.Ic ^P
を書き込みます。したがって、会話モード中で二つの
.Ic ^P
を入力することで、一つを現在のウインドウに送ることができます。
.Nm window
のエスケープを別の文字に変更している場合には、その文字がここでいう
.Ic ^P
と同じ動作をします。
.It Ic ?
コマンドの短いまとめを表示します。
.It Ic ^L
画面を再描画します。
.It Ic q
.Nm window  
を終了します。
確認が行われます。
.It Ic ^Z
.Nm window  
を中断します。
.It Ic w
新しいウインドウを作成します。ユーザはウインドウの左上の場所と
右下の場所を指定します。カーソルが画面上に表示され、
``h'', ``j'', ``k'', ``l'' キーでカーソルをそれぞれ 左 , 下 , 上 , 右
に移動します。
``H'', ``J'', ``K'', ``L'' キーでは、カーソルはそれぞれの方向の
画面の限界まで移動します。移動キーの前に数字を入力することで、
移動を数字の回数だけ繰り返します。リターンでカーソル位置をウインドウの
左上の位置として入力します。右下の角も同じような方法で入力します。
この手続き中には、新しいウインドウの位置は画面に表示される長方形の
箱として示されます。この枠が、新しいウインドウが表示される枠です。
エスケープキーを入力することで、どの時点でも、このコマンドを
キャンセルします。
.Pp
このウインドウはカレントウインドウになります。そして、最初に利用可能な
ID が与えられます。また、デフォルトのバッファサイズが使われます (以下の
.Ar default_nline
コマンドを参照) 。
.Pp
完全に見ることのできるウインドウだけがこの方法で作成できます。
.It Ic c Ns Ar # 
ウインドウ
.Ar # 
を閉じます。
ウインドウ中のプロセスには、ハングアップシグナル (
.Xr kill 1 
参照) が送られます。
.Xr csh 1
は、このシグナルを正しく扱うべきで、そうであれば問題は起こりません。
.It Ic m Ns Ar # 
ウインドウ
.Ar #
を別の位置に移動します。
ウインドウの形をした箱が新しい位置を示すために画面に表示され、
.Ic w
コマンドで使われたのと同じようなキーで箱の位置を指定できます。
ウインドウは一部が画面の外にでても構いません。
.It Ic M Ns Ar # 
ウインドウ
.Ar #
を以前の位置に動かします。
.It Ic s Ns Ar # 
ウインドウ
.Ar # 
の大きさを変更します。
ウインドウの新しい右下の角を指定する必要があります。
新しいウインドウの大きさを示すために、箱が書かれます。
.Ic w
や
.Ic m
コマンドで使われたのと同じキーが位置を入力するために使われます。
.It Ic S Ns Ar # 
ウインドウ
.Ar #
を以前の大きさに変更します。
.It Ic ^Y
カレントウインドウを一行上にスクロールします。
.It Ic ^E
カレントウインドウを一行下にスクロールします。
.It Ic ^U
カレントウインドウを画面の半分上にスクロールします。
.It Ic ^D
カレントウインドウを画面の半分下にスクロールします。
.It Ic ^B
カレントウインドウを一画面分、上にスクロールします。
.It Ic ^F
カレントウインドウを一画面分、下にスクロールします。
.It Ic h
カレントウインドウのカーソルを一カラム左に動かします。
.It Ic j
カレントウインドウのカーソルを一行下に動かします。
.It Ic k
カレントウインドウのカーソルを一行上に動かします。
.It Ic l
カレントウインドウのカーソルを一カラム右に動かします。
.It Ic y
ヤンクします。ユーザはカレントウインドウの 2点を指定します。
この 2点で示される内容がヤンクバッファに保存されます。
.It Ic p
プットです。ヤンクバッファの内容を、現在のウインドウに入力として
書き込みます。
.It Ic ^S
カレントウインドウの出力を停止します。
.It Ic ^Q
カレントウインドウの出力を開始します。
.It Ic :
長いコマンドとして実行する行を入力します。
通常の行編集文字 (エスケープ文字、単語の消去、行の消去) が提供されます。
.El
.Ss 長いコマンド
ロングコマンドはプログラム言語の様に解釈される文の列です。
この文法は C 言語に似ています。数字や文字列の表現や変数が、
条件分岐と同じように提供されています。
.Pp
二つのデータ型があります。文字列と数字です。
文字列は、文字で始まる文字や数字の列です。 ``_'' と ``.'' は文字と
考えられます。別の方法として、アルファベットや数字に含まれない文字を
``"''で括るか、``\\''でエスケープすることで、文字列に含めることもできます。
更に、 C言語で提供されている ``\\'' シーケンスがクオートの内外で
利用可能です
(例えば、 ``\\n'' は改行を、``\\r'' はキャリッジリターンを表現します)。
以下の例は規則にあった文字列です。
abcde01234, "&#$^*&#", ab"$#"cd, ab\\$\\#cd, "/usr/ucb/window"
.Pp
数字は、以下の3つの形式のうちの一つの整数値です。
10進数・``0'' に続いて表現される 8 進数・``0x'' もしくは ``0X'' に続いて
表現される 16 進数です。機械にとって自然な整数サイズが使われます
(つまり、 Cコンパイラの符号付き整数型です)。 C 言語と同じように、
非ゼロの表現が論理的な真をあらわします。
.Pp
文字 ``#'' は、行末までのコメントの始まりを表現します。
.Pp
文は条件式もしくは式です。式文は改行
もしくは ``;'' で終りになります。式を次の行に継続するためには、
最初の行を ``\\'' で終らせます。
.Ss 条件文
.Nm window
は、単一の制御構造を持ちます:
それは完全にまとめられた if 文で、以下の形式です
.Pp
.Bd -literal -offset indent -compact
if <expr> then
\t<statement>
\t...
elsif <expr> then
\t<statement>
\t...
else
\t<statement>
\t...
endif
.Ed
.Pp
.Ic else
や
.Ic elsif
部分はオプションです。
.Ic elsif
は、必要なだけ繰り返して利用することができます。
<expr>
は数値である必要が有ります。
.Ss 式
.Nm window
における式は、 C 言語中のものと似ており、ほとんどの C の演算子が
数値オペランドとして提供されています。更に、いくつかの演算子は、
文字列を操作するために拡張されています。
.Pp
ある式が文として使われている時、その値は評価の後で
捨てられます。したがって、(代入や関数呼び出しの様な) 
副作用を持った式のみが文として有用です。
.Pp
(配列でない) 一つの値の変数が、数値と文字列に対して提供されています。
いくつかの変数は、あらかじめ定義されています。
これらは後でに示してあります。
.Pp
優先順序が増加していくように、演算子を以下に示します。
.Bl -tag -width Fl
.It Xo
.Aq Va expr1
.Ic =
.Aq Va expr2
.Xc
代入です。名前が
.Aq Va expr1 
で文字列を値として持つ変数に、
.Aq Va expr2 
の結果が代入されます。
.Aq Va expr2 
の値を返します。
.It Xo
.Aq Va expr1
.Ic ?
.Aq Va expr2
.Ic :
.Aq Va expr3
.Xc
.Aq Va expr1 
の評価値が真 (非 0 数値) である時、
.Aq Va expr2 
の値を返します。そうでない場合は、
.Aq Va expr3 
の値を返します。
.Aq Va expr2 
と
.Aq Va expr3 
のどちらか一方だけが、評価されます。
.Aq Va expr1 
は数値表現でなくてはなりません。
.It Xo
.Aq Va expr1
.Ic \&|\&|
.Aq Va expr2
.Xc
論理的和 (or) です。数値だけが使えます。短絡評価が提供されています
(つまり、
.Aq Va expr1 
が評価されて真である場合は、
.Aq Va expr2 
は評価されません) 。
.It Xo
.Aq Va expr1
.Ic \&&\&&
.Aq Va expr2
.Xc
短絡評価付きの論理的積 (and) です。数値だけが使えます。
.It Xo
.Aq Va expr1
.Ic \&|
.Aq Va expr2
.Xc
ビット毎の論理和 (or) です。数値だけが使えます。
.It Xo
.Aq Va expr1
.Ic ^
.Aq Va expr2
.Xc
ビット毎の排他的論理和 (xor) です。数値だけが使えます。
.It Xo
.Aq Va expr1
.Ic \&&
.Aq Va expr2
.Xc
ビット毎の論理積 (and) です。数値だけが使えます。
.It Xo
.Aq Va expr1
.Ic ==
.Aq Va expr2 ,
.Aq Va expr1
.Ic !=
.Aq expr2
.Xc
(それぞれ、等価と非等価の) 比較です。ブール値の結果 (1 か 0 のどちらか) 
が比較の結果として返されます。
オペランドは、数値もしくは文字列です。片一方が文字列の場合、
他のオペランドも必要であれば変換されます。
.It Xo
.Aq Va expr1
.Ic <
.Aq Va expr2 ,
.Aq Va expr1
.Ic >
.Aq Va expr2 ,
.Aq Va expr1
.Ic <=
.Aq Va expr2 ,
.Aq Va expr1
.Ic >=
.Aq Va expr2
.\" >= を補足
.\" Aug 31 1997 <horikawa@jp.freebsd.org>
.Xc
それぞれ、より小さい・より大きい・以下・以上をあらわします。
数値と文字列の両方が利用可能です。
上で述べたように、自動的な変換が行われます。
.It Xo
.Aq Va expr1
.Ic <<
.Aq Va expr2 ,
.Aq Va expr1
.Ic >>
.Aq Va expr2
.Xc
両方のオペランドが数値である場合、
.Aq Va expr1
は、左 (もしくは、右) に
.Aq Va expr2
ビットシフトされます。
.Aq Va expr1
が文字列で、最初 (もしくは、最後) の 
.Aq Va expr2
文字が返されます(
.Aq Va expr2
も文字列の場合、その長さがその値として利用されます)。
.It Xo
.Aq Va expr1
.Ic +
.Aq Va expr2 ,
.Aq Va expr1
.Ic -
.Aq Va expr2
.Xc
数値においては、加算と減算です。 
``+'' に対して、片方が文字列の場合、他方は文字列に変換され、
結果は二つの文字列の結合となります。
.It Xo
.Aq Va expr1
.Ic \&*
.Aq Va expr2 ,
.Aq Va expr1
.Ic \&/
.Aq Va expr2 ,
.Aq Va expr1
.Ic \&%
.Aq Va expr2
.Xc
かけ算・割算・モジュロ演算 (余りの計算) です。 数字だけが利用可能です。
.\".(訳注)モジュロ演算の後ろのカッコは訳で付け加えました。
.\" 2.2.1R 対象(1997/06/02) Takeshi MUTOH <mutoh@info.nara-k.ac.jp>
.It Xo
.Ic \- Ns Aq Va expr ,
.Ic ~ Ns Aq Va expr ,
.Ic \&! Ns Aq Va expr ,
.Ic \&$ Ns Aq Va expr ,
.Ic \&$? Ns Aq Va expr
.Xc
最初の 3つは、単項演算子のマイナス・ビット毎の補をとる (ビットの反転) 
・論理的な否定であり、数値だけを取ります。
演算子 ``$'' は
.Aq Va expr
を取り、その名前の変数の値を返します。
.Aq Va expr
が値
.Ar n
を持った数値で、それが (後述の) 別名マクロ中に現れた場合、
別名呼び出しの n 番目の引数を参照します。
``$?'' は変数
.Aq Va expr 
の存在を調べ、存在する場合は 1 を、それ以外では 0 を返します。
.It Xo
.Ao Va expr Ac Ns Pq Aq Ar arglist
.Xc
関数呼び出しです。
.Aq Va expr
は文字列でなくてはならず、
.Nm window
の組み込み関数名の区別できる範囲でのプレフィックスであるか、
ユーザ定義の別名マクロの完全な名前でなくてはなりません。
組み込み関数の場合、
.Aq Ar arglist
は以下の 2つの形式のどちらか一方です。
.Bd -literal -offset indent
<expr1>, <expr2>, ...
argname1 = <expr1>, argname2 = <expr2>, ...
.Ed
.Pp
実際、両方の形式はお互い混ぜて使うことができますが、その結果は
予想できません。ほとんどの引数は省略可能です。デフォルトの値が
それらに対しては適用されます。
.Ar argnames
は、引数名を区別できる範囲でのプレフィックスとすることができます。
引数を分離するコンマは、曖昧さを避けるためだけに用いられ、
通常は省略できます。
.Pp
最初の引数の形式は、ユーザ定義別名のために有効です。別名は、
.Ic alias
組み込み関数を使うことで定義されます(以下参照)。
引数は、変数機能の変種を使ってアクセスされます (前述の ``$'' 
演算子を参照) 。
.Pp
ほとんどの関数は値を返しますが、いくつかは副作用のためだけに
使われるため文として使われなければなりません。
関数や別名が文として使われた時、引数リストを囲むカッコは
省略可能です。別名は値を返しません。
.El
.Ss  組み込み関数
引数は自然な順番で名前で並べられます。
オプション引数は、四角カッコ
.Sq Op 
で囲みます。名前の無い引数は、角カッコ
.Sq <> 
内に書きます。
ブール値のフラグを意味する引数 (しばしば
.Ar flag 
という名前を付けられます) は、意味が明らかである
.Ar on ,
.Ar off ,
.Ar yes ,
.Ar no ,
.Ar true ,
.Ar false ,
の内の一つの値をもつか、数値表現においては非ゼロの値が真となります。
.Bl -tag -width Fl
.It Xo
.Ic alias Ns ( Bq Aq Ar string ,
.Bq Aq Ar string\-list )
.Xc
.\" マクロが誤っているので修正
.\" Aug 31 1997 <horikawa@jp.freebsd.org>
引数が与えられない場合は、全ての現在定義されている別名マクロが
表示されます。そうでない場合、
.Aq Ar string
が表現
.Aq Ar string\-list 
の別名として定義されます。もし存在すれば、以前の
.Aq Ar string 
の定義が返されます。デフォルトでは、
.Aq Ar string\-list
は変更されません。
.It Ic close Ns Pq Aq Ar window\-list
.Aq Ar window\-list 
で指定されたウインドウを閉じます。
.Aq Ar window\-list
が単語
.Ar all  
の場合、全てのウインドウが閉じられます。値は返しません。
.It Ic cursormodes Ns Pq Bq Ar modes
ウインドウカーソルを
.Ar modes  
に設定します。
.Ar modes
は、変数
.Ar m_ul
(下線)・
.Ar m_rev
(反転表示)・
.Ar m_blk
(点滅)・
.Ar m_grp
(グラフィック、端末依存です。)で示される
モードビットのビット毎の論理和です。
以前のモードの値が返されます。引数に何も指定しないと変更を行いません。
例えば、
.Li cursor($m_rev$m_blk)
は、ウインドウカーソルを点滅する反転表示に設定します。
.It Ic default_nline Ns Pq Bq Ar nline
デフォルトバッファサイズを
.Ar nline  
に設定します。
初期設定では、 48 行になっています。古いデフォルトバッファサイズが
返されます。引数に何も指定しないと変更は行いません。とても大きなバッファを
使うと、プログラムの速度が低下します。
.It Ic default_shell Ns Pq Bq Aq Ar string\-list
デフォルトのウインドウシェルプログラムを
.Aq Ar string\-list 
に設定します。
最初の文字列として古いシェル設定が返されます。
引数に何も指定しないと変更を行いません。
初期設定では、デフォルトシェルは環境変数
.Ev SHELL  
から取られます。
.It Ic default_smooth Ns Pq Bq Ar flag
コマンド
.Nm window
(以下参照)への
.Ar smooth
引数のデフォルトの値を設定します。
引数はブール値フラグ (上記の
.Ar on  ,
.Ar off  ,
.Ar yes  ,
.Ar no  ,
.Ar true  ,
.Ar false  
または数字のうちの一つ) です。引数に何も指定しないと変更を行いません。
古い値が (数字として) 返されます。
初期値は 1 (true) です。
.It Xo
.Ic echo Ns ( Op Ar window ,
.Bq Aq Ar string\-list )
.Xc
文字列のリスト
.Aq Ar string-list 
を、空白で分割し最後に改行を付けて
.Nm window  
へ書き出します。
文字列はウインドウにだけ表示され、ウインドウ中のプロセスには
影響を与えません (以下の
.Ic write
を参照) 。 値は返されません。デフォルトはカレントウインドウです。
.It Ic escape Ns Pq Bq Ar escapec
エスケープ文字を
.Ar escape-char  
に設定します。古いエスケープ文字を一文字の文字列として返します。
引数に何も指定しないと変更を行いません。
.Ar escapec
は、一文字の文字列か、
.No control\- Ns Ar X 
を意味する
.Fl ^X 
という形式です。
.It Xo
.Ic foreground Ns ( Bq Ar window ,
.Bq Ar flag ) 
.Xc
.Nm window
をフォアグラウンドに動かしたり、フォアグラウンドから外したりします。
.Ar flag
はブール値です。古いフォアグランドフラグが返されます。
.Nm window
に対するデフォルトはカレントウインドウで、
.Ar flag
に対するデフォルトは無変更です。
.It Xo
.Ic label Ns ( Bq Ar window ,
.Bq Ar label ) 
.Xc
.Nm window
のラベルを
.Ar label  
に設定します。
古いラベル文字列が返されます。
.Nm window
に対するデフォルトはカレントウインドウで、
.Ar label
に対するデフォルトは無変更です。ラベルを無くすためには、
空文字列 ("") を設定します。
.It Ic list Ns Pq
引数はありません。 全てのウインドウの ID と ラベルが表示されます。
値は返されません。
.It Ic select Ns Pq Bq Ar window
.Nm window
をカレントウインドウとします。以前のカレントウインドウが返されます。
引数を指定しないと変更を行いません。
.It Ic source Ns Pq Ar filename
.Ar filename  
内の長いコマンドを読み込み、実行します。
ファイルが読み込めない場合には -1 を返し、それ以外では 0 を返します。
.It Ic terse Ns Pq Bq flag
簡素 (terse) モードを
.Ar flag  
に設定します。簡素モードでは、コマンドウインドウはコマンドモード中
でさえ隠されたままで、エラーは端末のベルをならすことで報告されます。
.Ar flag
は、上記の
.Ar foreground
中の値と同じです。
古い簡素フラグが返されます。
引数を指定しないと変更は行いません。
.It Ic unalias Ns Pq Ar alias
別名定義
.Ar alias
を消去します。
別名がない場合には -1 を返します。それ以外の場合は 0 を返します。
.It Ic unset Ns Pq Ar variable
.Ar variable  
変数の定義を消去します。
.Ar variable
が存在しない場合には -1 を返します。それ以外の場合は 0 を返します。
.It Ic variables Ns Pq
引数はありません。全ての変数を表示します。値は返されません。
.It Xo
.Ic window Ns ( Bq Ar row ,
.Bq Ar column ,
.Bq Ar nrow ,
.Bq Ar ncol ,
.Bq Ar nline ,
.Bq Ar label ,
.Bq Ar pty , 
.Bq Ar frame ,
.Bq Ar mapnl ,
.Bq Ar keepopen ,
.Bq Ar smooth ,
.Bq Ar shell ) . 
.Xc
左上の角が
.Ar row  ,
.Ar column
で、大きさが
.Ar nrow  ,
.Ar ncol  
のウインドウを開きます。
.Ar nline
が指定された場合、テキストバッファにその行が割り当てられます。
そうでない場合は、デフォルトのバッファサイズが使われます。
.Ar row  ,
.Ar column  ,
.Ar nrow  ,
.Ar ncol
に対するデフォルトの値は、それぞれ画面の一番上, 一番左, 一番下, 一番右
になります。
.Ar label
は、ウインドウのラベル文字列です。
.Ar frame  ,
.Ar pty  ,
.Ar mapnl
は、 (上記の)
.Ar foreground
への引数と同じ方法で解釈されるフラグの値です。
これはそれぞれ、このウインドウの周りに枠を付けるか (デフォルトでは真)、
ウインドウのためにソケットペアではなく仮想端末を割り当てるか
(デフォルトでは真)、改行文字をこのウインドウでは 復帰と行送りに
マップするか (デフォルトではソケットペアの場合は真、それ以外は偽) です。
一般に、ウインドウは、プロセスが終了した時に、自動的に閉じられます。
.Ar keepopen
を真に設定する (デフォルトでは偽) ことでこの動作は妨げられます。
.Ar smooth
が真である時、より端末らしい振舞いを実現するために、
画面は (このウインドウに対して) より頻繁に更新されます。
.Ar smooth
のデフォルトの値は、 (上記)
.Ar default_smooth
コマンドで設定します。
.Ar shell
は、このウインドウ内でシェルプログラムとして使われる文字列のリストです
(デフォルトは、上記
.Ar default_shell  
で指定されたプログラムです)。 作成されたウインドウの ID が数字で
返されます。
.It Xo
.Ic write Ns ( Bq Ar window ,
.Bq Aq Ar string\-list )
.Xc
.Nm window  
に空白で分割されているが最後に改行の無い文字列リスト
.Aq Ar string-list 
を送ります。 文字列は、実際にウインドウの入力として使われます。
値は返しません。 デフォルトはカレントウインドウです。
.El
.Ss 定義済み変数
これらの変数は、情報のためだけにあります。これらを再定義しても、
.Nm window  
の内部操作には影響ありません。
.Bl -tag -width modes
.It Ar baud
50 から 38400の間のボーレートです。
.It Ar modes
物理端末で提供されている(反転表示・下線・点滅・グラフィック等の) 
表示モードです。
.Ar modes
の値は、1 ビット値
.Ar m_blk ,
.Ar m_grp ,
.Ar m_rev ,
.Ar m_ul
(以下参照)のビット毎の論理和になっています。
これらの値は、ウインドウのカーソルモードを設定する時に便利です (上の
.Ar cursormodes
参照) 。
.It Ar m_blk
点滅モードのビットです。
.It Ar m_grp
グラフィックモードのビットです (それほど有用ではありません)。
.It Ar m_rev
反転表示モードのビットです。
.It Ar m_ul
下線モードのビットです。
.It Ar ncol
物理端末の列数です。
.It Ar nrow
物理端末の行数です。
.It Ar term
端末の形式です。
端末の
.Ev TERMCAP
エントリの 2番目のフィールドに書かれている標準名が使われます。
.Sh 環境変数
.Nm window
は、以下のような環境変数を利用します。
.Ev HOME ,
.Ev SHELL ,
.Ev TERM ,
.Ev TERMCAP ,
.Ev WINDOW_ID 
.Sh 関連ファイル
.Bl -tag -width /dev/[pt]ty[pq]? -compact
.It Pa ~/.windowrc
スタートアップコマンドファイル
.It Pa /dev/[pt]ty[pq]? 
仮想端末デバイス
.El
.Sh 歴史
.Nm window
コマンドは、
.Bx 4.3 
から導入されました。
.Sh 診断
自己説明的な診断メッセージになっています。
