freebsd/freebsd-doc/ja_JP.eucJP/man/man8/man8.i386/apm.8
.\" LP (Laptop Package)
.\"
.\" Copyright (c) 1994 by Tatsumi Hosokawa <hosokawa@jp.FreeBSD.org>
.\"
.\" This software may be used, modified, copied, and distributed, in
.\" both source and binary form provided that the above copyright and
.\" these terms are retained. Under no circumstances is the author
.\" responsible for the proper functioning of this software, nor does
.\" the author assume any responsibility for damages incurred with its
.\" use.
.\"
.\" %FreeBSD: src/usr.sbin/apm/apm.8,v 1.28 2004/07/02 23:12:39 ru Exp %
.\"
.\" $FreeBSD$
.Dd November 1, 1994
.Dt APM 8 i386
.Os
.Sh 名称
.Nm apm , zzz
.Nd APM BIOS の制御を行い、その情報を表示する
.Sh 書式
.Nm
.Op Fl ablstzZ
.Op Fl d Ar enable
.Op Fl e Ar enable
.Op Fl h Ar enable
.Op Fl r Ar delta
.Pp
.Nm zzz
.Sh 解説
.Nm
ユーティリティは、
Intel / Microsoft APM (Advanced Power Management) BIOS を制御し、
ラップトップ PC 上の APM の現在の状態を表示します。
.Nm zzz
ユーティリティは、APM 制御によって、システムをサスペンドします。
.Pp
以下のオプションが
.Nm
で利用可能です
(
.Nm zzz
には、オプションはありません)。
オプションが与えられなかった場合は、
.Nm
は、現在の APM の状態や情報を冗長モードで表示します。
複数の表示オプションが指定された場合、
ここに示す順番で値を 1 行に 1 つずつ表示します。
.Bl -tag -width indent
.It Fl a
現在の AC 電源の状態を整数値で表示します。
0, 1がそれぞれ
.Dq 外れている (off-line)
状態と
.Dq つながっている (on-line)
状態をあらわします。
.It Fl b
整数値で、現在のバッテリ状態を表示します。
0, 1, 2, 3という値はそれぞれ、
.Dq 良好 (high)
状態、
.Dq 低バッテリ (low)
状態、
.Dq 危険 (critical)
状態、
.Dq 充電 (charging)
状態をあらわします。
.It Fl d Ar enable
通常のサスペンドとディスプレイのサスペンドを別に扱わない/別に扱うを、
ブール値
.Ar enable
で制御します。
この引数は Libretto 30CT や 50CT を含む
多種のラップトップで動作しないようです。
.It Fl e Ar enable
ブール値引数
.Ar enable
に依存して、コンピュータの APM 機能の有効/無効を切り替えます。
.It Fl h Ar enable
ブール値引数
.Ar enable
に依存して、
カーネルコンテキストスイッチルーチン中の HLT 命令の有効/無効を切り替えます。
これらのオプションは、ほとんど全ての APM の実装においては不要ですが、
.Dq Pa Idle CPU
呼び出しが CPU クロックの減速と HLT 命令を同時に実行する場合は、
そのピーク性能の減少からシステムをまもるために
.Fl h Cm false
オプションが必要です。
詳細については、
.Xr apm 4
を参照してください。
.It Fl l
現在のバッテリの残り割合を表示します。
もし、あなたのラップトップがこの機能を提供していない時には、
255 が表示されます。
.It Fl r Ar delta
ラップトップがサポートしている場合、
レジュームウェイクアップタイマを有効にします。
これによりラップトップがサスペンドされるわけではありませんが、
ラップトップがサスペンドされ
サスペンドからのレジュームがサポートされている場合、
.Ar delta
秒後にラップトップがレジュームします
(サスペンドした時刻を起点とするのではなく、
本コマンドを実行した時間を起点とします)。
.It Fl s
APM サポート状態を整数値で表示します。
0, 1 という値はそれぞれ、
.Dq 利用不可 (disabled)
状態
.Dq 利用可能 (enabled)
状態
をあらわします。
.It Fl t
残りのバッテリ時間を予測して、秒単位で表示します。
分からない場合には -1 を表示します。
.It Fl Z
スタンバイモードに移行します。
本モードではフルパワーモード未満、サスペンドモード以上の電力消費となります。
タイマもしくはリングインジケータイベントにより、
この状態からレジュームする機能をサポートするラップトップがあります。
.Nm
の出力により、ラップトップが何をサポートすると主張しているかが分かります。
.It Fl z
システムをサスペンドします。これは、
.Nm zzz
と等価です。
.El
.Sh バグ
いくつかの APM 実装では、
.Nm
が必要とするパラメータが提供されていません。
そのようなシステムに於いては、
.Nm
は、それらを知らないと表示します。
.Pp
いくつかの APM 実装では、電源スイッチを押したことやカバーが
閉められたことなどのイベントを扱うことができません。
そのような実装に於いては、
システムは
.Nm
か
.Nm zzz
.Ar だけを
つかってサスペンドする
.Ar べき
です。
.Sh 注
.Xr apmconf 8
は
.Nm
にマージされ、
.Nm
が全機能を置き換えました。
.Sh 関連項目
.Xr apm 4
.Sh 作者
.An Tatsumi Hosokawa Aq hosokawa@jp.FreeBSD.org
