<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Projets de d&eacute;veloppement FreeBSD">
<!ENTITY % navinclude.developers "INCLUDE">
<!ENTITY url.articles "&base;/doc/en_US.ISO8859-1/articles">
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 39039

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Frederic Culot <culot@FreeBSD.org>
-->

<html>
&header;

<a name="development"></a>

<p>En plus du d&eacute;veloppement principal de FreeBSD, un certain nombre
de groupes de d&eacute;veloppeurs travaillent en parall&egrave;le pour &eacute;largir
le champ des applications FreeBSD vers de nouvelles directions. Suivez les liens
ci-dessous pour en apprendre plus sur ces projets passionnants.</p>

Si vous remarquez qu'un projet est manquant, veuillez envoyer l'URL ainsi qu'une courte
description (3 &agrave; 10 lignes) &agrave; <A HREF="../mailto.html">www@FreeBSD.org</A>

<p>De plus, certains de ces projets envoient r&eacute;guli&egrave;rement un compte rendu sur le statut
du d&eacute;veloppement. Ils peuvent &ecirc;tre consult&eacute;s sur <a href="../news/status/status.html">la
page des compte-rendus</a>.</p>

<ul>
  <li><a href="#documentation">Documentations</a></li>
  <li><a href="../advocacy/index.html">Promouvoir FreeBSD</a></li>
  <li><a href="#applications">Applications</a></li>
  <li><a href="#networking">R&eacute;seaux</a></li>
  <li><a href="#storage">Stockage</a></li>
  <li><a href="#kernelandsecurity">Noyau et S&eacute;curit&eacute;</a></li>
  <li><a href="#devicedrivers">Pilotes de p&eacute;riph&eacute;riques</a></li>
  <li><a href="#architecture">Architectures</a></li>
  <li><a href="#misc">Divers</a></li>
  <li><a href="summerofcode.html">Google Summer of Code</a></li>
</ul>

<a name="documentation"></a>
<h3>Documentations</h3>
    <ul>
      <li><a href="../docproj/docproj.html">Projet de Documentation FreeBSD</a>
	Le Projet de Documentation FreeBSD est un groupe de personnes qui maintient
   et &eacute;crit la documentation (tel que le Manuel de r&eacute;f&eacute;rence et la FAQ) pour le
   projet FreeBSD. Si vous voulez aider ce projet de documentation,
   inscrivez-vous &agrave; la liste de diffusion freebsd-doc@FreeBSD.ORG
   et participez.</li>

      <li><a name="newbies" href="newbies.html">Ressources FreeBSD pour les D&eacute;butants</a>
	est une liste de ressources pour aider ceux qui d&eacute;butent sur FreeBSD et sur UNIX en
   g&eacute;n&eacute;ral.</li>

      <li><a name="BSDsites" href="http://mirrorlist.FreeBSD.org/">
	Moteur de recherche de RELEASE/SNAP pour les serveurs FTP</a>.
	Une ressource qui permettra &agrave; quiconque de trouver un serveur FTP contenant
   une version ("release") ou un instantan&eacute; ("snap") particulier de FreeBSD.
   La base de donn&eacute;es est mise &agrave; jour quotidiennement &agrave; 3 heures du matin,
   heure de Melbourne (+ 10 heures par rapport au Temps Universel ("UTC") ).</li>

      <li><a name="diary" href="http://www.freebsddiary.org/">L'Agenda
      FreeBSD</a> est un ensemble de guides simples &agrave; l'intention des d&eacute;butants
      sous Unix. Le but est de fournir une s&eacute;rie de guides d&eacute;crivant pas-&agrave;-pas
      l'installation et la configuration de divers ports.</li>

<li><a href="&enbase;/doc/&url.doc.langcode;/books/developers-handbook/index.html">
Le guide de r&eacute;f&eacute;rence du D&eacute;veloppeur FreeBSD</a></li>

<li><a href="&url.articles;/contributing-ports/index.html">
Contribuer au catalogue des logiciels port&eacute;s de FreeBSD</a></li>

</ul>

<a name="applications"></a>
<h3>Applications</h3>
    <ul>
      <li><a name="java" href="../java/index.html">Java sur FreeBSD</a>
	Contient des informations pour obtenir le dernier &jdk; pour
   FreeBSD, savoir comment l'installer et le faire fonctionner ainsi qu'une liste de
   logiciels &java; qui pourrait vous int&eacute;resser.</li>

      <li><a name="gnome" href="../gnome/index.html">GNOME sur FreeBSD</a>
        Contient des informations sur comment obtenir la derni&egrave;re version de GNOME
        pour FreeBSD, comment l'installer et la faire fonctionner,
        les derni&egrave;res informations concernant le projet et ses
        mises &agrave; jour, la Foire Aux Questions couvrant les probl&eacute;matiques
        sp&eacute;cifiques &agrave; GNOME sur FreeBSD, les recommandations
        pour porter des applications, et bien plus encore.</li>

      <li><a name="kde" href="http://freebsd.kde.org">KDE sur FreeBSD</a>
        Contient des liens vers les derni&egrave;re versions de KDE disponibles
        sur FreeBSD, ainsi que de la documentation et des guides relatifs
        &agrave; l'installation et &agrave; l'utilisation de KDE sur FreeBSD.
        Les actualit&eacute;s concernant le projet ainsi qu'une Foire Aux
        Questions sp&eacute;cifique &agrave; FreeBSD sont &eacute;galement
        disponibles.</li>

      <li><a name="mono" href="http://www.mono-project.com/Mono:FreeBSD">
          Mono sur FreeBSD</a>
        Contient des informations d&eacute;crivant la situation de Mono et de C#
        sur FreeBSD.</li>

      <li><a name="openoffice" href="http://porting.openoffice.org/freebsd/">
          OpenOffice.org sur FreeBSD</a>
        Contient des informations relatives aux diff&eacute;rents portages
        d'OpenOffice.org.</li>

      <li><a href="../ports/index.html">Collection de Ports FreeBSD</a>
	La Collection de Ports FreeBSD fournit un moyen simple de compiler et
   d'installer un large choix d'applications avec un minimum d'effort.
   Une liste des ports actuels est disponible avec un moteur de recherche pour
   savoir si une application donn&eacute;e existe dans la collection de ports.</li>

      <li><a href="http://people.FreeBSD.org/~fenner/portsurvey/">Le Rapport sur les fichiers de distribution des Ports FreeBSD</a>
	est une liste qui v&eacute;rifie la collection de ports pour les fichiers de distributions introuvables
   et fournit un r&eacute;sum&eacute; pour chaque port.</li>

      <li><a href="http://FreshPorts.org/">FreshPorts</a> fournit la liste la plus
        r&eacute;cente possible des logiciels portés ainsi que l'historique des modifications
        qui leurs ont &eacute;t&eacute; appliqu&eacute;es.
        Ajoutez vos logiciels portés favoris &agrave; votre liste personnelle et recevez
        un courrier &eacute;lectronique vous pr&eacute;venant d&egrave;s qu'un
        changement survient sur ceux-ci.</li>

      <li><a href="http://pointyhat.FreeBSD.org/">Pointyhat</a>
        est un serveur qui v&eacute;rifie l'&eacute;tat du catalogue des logiciels portés
        et conserve les historiques de compilation des paquetages ainsi que
        les rapports d'erreurs pour chacun des logiciels portés.</li>
    </ul>

<a name="networking"></a>
<h3>R&eacute;seaux</h3>
    <ul>
      <li><a name="netperf" href="&base;/projects/netperf/index.html">Netperf</a>,
        une optimisation de la pile r&eacute;seau pour les noyaux de FreeBSD 5.X et 6.X,
        dans la continuit&eacute; du travail effectu&eacute; sur le v&eacute;rouillage
        SMPng de la pile r&eacute;seau pour FreeBSD 5.3.  Ce projet explore et
        impl&eacute;mente des strat&eacute;gies d'optimisation pour une pile
        r&eacute;seau multi-thread&eacute;e.</li>
      <li><a name="kame" href="http://www.kame.net/">Projet KAME</a>, une pile IPv6/IPsec pour BSD disponible librement.</li>
      <li><a name="SYSLOG-SECURE" href="http://www.faqs.org/rfcs/rfc3164.html">SYSLOG-SECURE</a>:
        En Ao&ucirc;t 2001, un standard pour syslog a &eacute;t&eacute; &eacute;tabli sous la
        d&eacute;nomination RFC3164. Ce document RFC d&eacute;crit certaines extensions pour 
        am&eacute;liorer la s&eacute;curit&eacute; de syslog.  Le projet a d&eacute;but&eacute;
        en 2002 pour adapter le RFC3164 &agrave; la version FreeBSD de syslog, et pour lui ajouter
        des extensions de s&eacute;curit&eacute; (au minimum syslog-sign).  La libc et syslogd
        seront tous les deux modifi&eacute;s, et d'autres outils utilis&eacute;s pour v&eacute;rifier
        ou administrer la s&eacute;curit&eacute; seront potentiellement d&eacute;velopp&eacute;s.
        Toute aide est la bienvenue.  Vous pouvez envoyer un message &agrave; albert@ons-huis.net
        pour obtenir plus d'information.</li>
    </ul>

<a name="stockage"></a>
<h3>Stockage</h3>
<ul>
    <li><a name="afs" href="http://www.stacken.kth.se/projekt/arla/">Arla</a>
	est une impl&eacute;mentation libre d'un client AFS. L'objectif principal est de
   faire un client pleinement fonctionnel avec toutes les capacit&eacute;s de l'AFS.
   Les autres choses pr&eacute;vues et impl&eacute;ment&eacute;es sont tous les outils de gestion
   usuels et un serveur.</li>

    <li><a name="bigdisk" href="&base;/projects/bigdisk/index.html">Big Disk</a>
      dont le but est de permettre &agrave; FreeBSD de supporter les disques, volumes
      et syst&egrave;mes de fichiers de plusieurs teraoctets de capacit&eacute;.</li>

      <li><a name="coda" href="http://www.coda.cs.cmu.edu/">Coda</a> est
      un syst&egrave;me de fichiers distribu&eacute;s. Au nombre de ses caract&eacute;ristiques : op&eacute;rations
      en mode d&eacute;connect&eacute;, bon mod&egrave;le de s&eacute;curit&eacute;, r&eacute;plications entre serveurs et cache
      persistant c&ocirc;t&eacute; client.</li>

<li><a name="journaling" href="http://www.ece.cmu.edu/~ganger/papers/">
Journalisation contre Soft Updates : Protection asynchrone des m&eacute;ta-donn&eacute;es dans les syst&egrave;mes de fichiers</a></li>

      <li><a name="tcfs" href="http://www.tcfs.unisa.it/">TCFS</a>
	est un Syst&egrave;me de Fichier Chiffr&eacute; Transparent ce qui est une solution adapt&eacute;e
   au probl&egrave;me des regards indiscrets dans le cas d'un syst&egrave;me de fichier distribu&eacute;. En
   int&eacute;grant totalement le service de cryptage et le syst&egrave;me de fichier, il
   en r&eacute;sulte une compl&egrave;te transparence d'utilisation pour l'utilisateur final.
   Les fichiers sont stock&eacute;s sous une forme crypt&eacute;e et sont d&eacute;crypt&eacute;s avant
   qu'ils ne soient lus. Le processus de cryptage/d&eacute;cryptage se d&eacute;roule sur la
   machine cliente et par cons&eacute;quent la clef de cryptage/d&eacute;cryptage ne voyage
   jamais &agrave; travers le r&eacute;seau.</li>

      <li><a name="Tertiary" href="http://now.cs.berkeley.edu/Td/">Tertiary Disk</a>
	est une architecture de syst&egrave;me de stockage pour cr&eacute;er un large syst&egrave;me de disque de
   stockage qui &eacute;vite les inconv&eacute;nients des syst&egrave;mes de stockage propri&eacute;taire. Le
   nom provient de deux objectifs : avoir le co&ucirc;t par m&eacute;ga-octect et la
   capacit&eacute; des stockages par bandes et avoir les performances des disques
   magn&eacute;tiques. Nous utilisons des produits tout ce qu'il y a de plus courant pour d&eacute;velopper
   un syst&egrave;me de stockage modulable, de faible co&ucirc;t et avec une capacit&eacute; en t&eacute;ra-octects. Notre
   but est de construire un syst&egrave;me de stockage complet avec un co&ucirc;t sup&eacute;rieur de 30 &agrave; 50 % au
   prix des disques seuls. Tertiary Disk utilise des PC connect&eacute;s en r&eacute;seau
   pour pouvoir utiliser un large nombre de disques. Notre prototype consiste
   en 20 PC &agrave; 200 Mhz avec un total de 370 disques de 8 Go chacun. Les PC
   sont connect&eacute;s &agrave; travers un r&eacute;seau Ethernet &agrave; 100 Mbps.</li>

      <li><a name="vinum" href="http://www.vinumvm.org/">Vinum</a>
	 est un gestionnaire de volume logique con&ccedil;u d'apr&egrave;s le gestionnaire de volume VERITAS.
    Toutefois, il ne s'agit pas d'un clone de Veritas, et il tente de r&eacute;soudre un
    certain nombre de probl&egrave;mes plus &eacute;l&eacute;gamment que Veritas. Il offre aussi
    des possibilit&eacute;s que Veritas n'a pas.</li>

      <li><a name="PathConvert" href="http://www.tamacom.com/pathconvert/">
	Le projet de Conversion de Chemin ("PathConvert")</a> consiste &agrave; d&eacute;velopper des utilitaires
   pour r&eacute;aliser la conversion entre noms de chemins absolus et noms de chemins relatifs. Il
   est utile principalement pour les utilisateurs de NFS et de WWW.</li>

    </ul>

<a name="kernelandsecurity"></a>
<h3>Noyau et s&eacute;curit&eacute;</h3>
    <ul>
<li><a name="kse" href="../kse/index.html">Entit&eacute;s d'Ordonnancement Noyau</a>
est un projet visant &agrave; am&eacute;liorer le support des processus l&eacute;gers sur FreeBSD
en utilisant un syst&egrave;me &agrave; l'architecture similaire &agrave; celui propos&eacute; par
"Scheduler Activations".</li>

<li><a name="lotteryscheduling"
href="http://www.cs.cmu.edu/~dpetrou/research.html">
Ordonnancement du noyau par loterie</a> : Ce projet est bas&eacute; sur
l'algorithme d'ordonnancement par loterie de Waldspurger, qui impl&eacute;mente
un partage proportionnel des ressources. Les avantages principaux
sont que les utilisateurs ont un contr&ocirc;le strict sur le pourcentage relatif
d'ex&eacute;cution de leurs processus et que les utilisateurs sont isol&eacute;s les uns des
autres ce qui emp&ecirc;che un utilisateur de monopoliser le CPU.</li>

<li><a name="openbsm" href="http://www.OpenBSM.org/">OpenBSM</a>: 
est une impl&eacute;mentation open source de l'API d'Audit du Module de S&eacute;curit&eacute; Fondamentale
de Sun ("BSM - Basic Security Module") ainsi que de son format de fichier.  OpenBSM fournit
les librairies accessibles depuis l'espace utilisateur, les outils, ainsi que la documentation
pour l'impl&eacute;mentation de l'audit de TrustedBSD qui sera int&eacute;gr&eacute; &agrave;
FreeBSD.</li>

<li><a name="SMP" href="&base;/smp/index.html">Support Multi-Processeurs Sym&eacute;trique</a>
	Documentations et autres informations pour tirer avantage des syst&egrave;mes
   multi-processeurs sous FreeBSD.</li>

<li><a name="trustedbsd" href="http://www.TrustedBSD.org/">TrustedBSD</a>
fournit un ensemble d'extensions &eacute;prouv&eacute;es au syst&egrave;me d'exploitation FreeBSD.
Cela inclu notamment des fonctions comme les privil&egrave;ges que l'on peut d&eacute;finir
tr&egrave;s pr&eacute;cis&eacute;ment ("capabilities"), les listes de contr&ocirc;les d'acc&egrave;s (ACL) et les
contr&ocirc;les d'acc&egrave;s obligatoires (MAC).  Ces fonctionnalit&eacute;s sont
r&eacute;int&eacute;gr&eacute;es au syst&egrave;me FreeBSD de base, et sont
&eacute;galement port&eacute;es sur d'autres syst&egrave;mes d&eacute;riv&eacute;s de FreeBSD.</li>

<li><a name="kernelstresstest"
  href="http://www.holm.cc/stress/">Suite de Tests de Charge du Noyau</a>:
l'objectif de ces tests de charge est de provoquer une d&eacute;faillance du syst&egrave;me.
Le test de charge est compos&eacute; de petits programmes et scripts de test.  Chacun de
ces tests s'attaque &agrave; une partie sp&eacute;cifique du noyau.  Le concept cl&eacute;
de cette suite de tests est de provoquer le chaos.  Chaque test est mis en veille pendant
un nombre al&eacute;atoire de secondes avant de se mettre en action en &eacute;tant
invoqu&eacute; un nombre al&eacute;atoire de fois.</li>

</ul>

<a name="devicedrivers"></a>
<h3>Pilotes de p&eacute;riph&eacute;riques</h3>
    <ul>

      <li><a name="busdma" href="&base;/projects/busdma/index.html">busdma
          et conversion de pilote SMPng</a>:
        busdma fournit une abstraction portable aux primitives mat&eacute;rielles de la
        m&eacute;moire &agrave; acc&egrave;s direct (DMA) utilis&eacute;es par
        beaucoup de pilotes de p&eacute;riph&eacute;riques &agrave; haute
        performance.  En utilisant cette abstraction, les auteurs de pilotes
        de p&eacute;riph&eacute;riques n'ont pas &agrave; rajouter de code
        pour g&eacute;rer les sp&eacute;cificit&eacute;s de la DMA li&eacute;es
        &agrave; la plate-forme consid&eacute;r&eacute;e, am&eacute;liorant
        par la m&ecirc;me la portabilit&eacute; des pilotes sur des architectures
        mat&eacute;rielles h&eacute;t&eacute;rog&egrave;nes.  Cette page recense
        &eacute;galement les progr&egrave;s effectu&eacute;s dans le but d'&ecirc;tre
        compatible avec les syst&egrave;mes multiprocesseurs ("SMPng-safe").</li>

      <li><a name="deviceframework" href="http://people.FreeBSD.org/~dfr/devices.html">
	Une Nouvelle Structure pour les P&eacute;riph&eacute;riques sous FreeBSD</a></li>

      <li><a name="atm" href="http://chuck.cranor.org/p/bsdatm.pdf"> ATM BSD: une impl&eacute;mentation de ATM sous 4.4BSD</a>:
	Les nouvelles applications informatique dans les domaines tel que le multim&eacute;dia, le traitement d'image
   et le calcul distribu&eacute; n&eacute;cessitent de hauts niveaux de performance de la part du
   r&eacute;seau. Les solutions de r&eacute;seaux bas&eacute;es sur l'ATM fournissent une alternative
   possible pour r&eacute;pondre &agrave; ces besoins de performances.
   Cependant, la complexit&eacute; de l'ATM par rapport aux r&eacute;seaux traditionnels tel que
   l'Ethernet est une barri&egrave;re &agrave; son utilisation. Dans ce document,
   nous pr&eacute;sentons la conception et l'impl&eacute;mentation de l'ATM BSD, une
   couche logicielle ATM l&eacute;g&egrave;re et efficace pour les syst&egrave;mes d'exploitations bas&eacute;s
   sur BSD et qui demande des changements minimals au niveau du syst&egrave;me.
   ATM BSD peut &ecirc;tre utilis&eacute; &agrave; la fois sur du r&eacute;seau IP et sur de
   l'ATM "natif".</li>

      <li><a name="homeauto" href="http://people.FreeBSD.org/~fsmp/HomeAuto/HomeAuto.html">Domotique</a>
	avec FreeBSD comme par exemple des contr&ocirc;leurs d'appareils &eacute;lectriques, des contr&ocirc;leurs infra-rouge,
   des syst&egrave;mes t&eacute;l&eacute;phoniques automatis&eacute;s et plus encore.</li>

      <li><a name="tokenring" href="http://www.jurai.net/~winter/tr/">Le Projet Token-Ring FreeBSD</a>
	Informations, fichiers, patches et documentations pour ajouter le support Token Ring
   sous FreeBSD.</li>

<li><a name="xircomcem"></a>Une liste de diffusion existe pour le d&eacute;veloppement
futur du pilote ethernet pour Xircom CEM de Scott Mitchell. Envoyez
<tt>subscribe freebsd-xircom</tt> &agrave; <a
  href="mailto:majordomo@lovett.com">majordomo@lovett.com</a> pour
vous abonner.</li>

    </ul>

<a name="architecture"></a>
<h3>Architectures</h3>
    <ul>

<li><a name="ia64" href="../platforms/ia64/index.html">
Portage de FreeBSD sur les syst&egrave;mes IA-64</a>
Ce projet est responsable du portage de FreeBSD sur l'architecture
IA-64. Envoyez toutes les questions sp&eacute;cifiques &agrave; ce projet sur
la liste de diffusion freebsd-ia64@FreeBSD.org. </li>

<li><a name="ppc" href="../platforms/ppc.html">Portage de FreeBSD sur les syst&egrave;mes PowerPC.</a>
Contient des informations sur le portage de FreeBSD sur PPC comme des informations sur
la liste de diffusion, etc...</li>

      <li><a name="sparc" href="../platforms/sparc.html">Portage de FreeBSD sur les syst&egrave;mes Sparc</a>
	Contient des informations sur le portage de FreeBSD sur Sparc comme une FAQ,
   un d&eacute;but de code pour le boot, des informations sur les processeurs et les cartes m&egrave;res
   Sparc et d'autres projets Sparc.</li>

      <li><a name="sysvr4" href="http://slash.dotat.org/~newton/freebsd-svr4/">
	La page sur l'&eacute;mulation SysVR4</a> d&eacute;crit un &eacute;mulateur SysVR4 pour
   FreeBSD. Il est actuellement capable de faire fonctionner (ou de faire marcher dans certains
   cas) une large vari&eacute;t&eacute; d'ex&eacute;cutables SysV provenant de syst&egrave;mes Solaris/x86
   2.5.1 et 2.6. J'ai quelques raisons de croire qu'il peut &eacute;galement faire fonctionner
   les binaires SCO UnixWare et SCO OpenServer.</li>

      <li><a name="oskit" href="http://www.cs.utah.edu/flux/oskit/">Le Kit OS</a>
	Le Kit OS est une structure et un ensemble de 31 librairies fourni avec une documentation
   compl&egrave;te orient&eacute; vers les syst&egrave;mes d'exploitation. En
   fournissant d'une fa&ccedil;on modulaire non seulement la plupart de l'infrastructure
   de base n&eacute;cessaire pour un syst&egrave;me d'exploitation mais aussi beaucoup de composants de plus haut niveau, le
   but du Kit OS est de faciliter l'acc&egrave;s &agrave; la recherche et au d&eacute;veloppement de syst&egrave;mes d'exploitations et
   d'abaisser son co&ucirc;t. Le Kit OS rend beaucoup plus facile la cr&eacute;ation d'un nouveau syst&egrave;me d'exploitation, le
   portage d'un syst&egrave;me d'exploitation existant sur un processeur x86 (ou dans le futur sur d'autres
   architectures support&eacute;es par le Kit OS) ou bien l'am&eacute;lioration d'un syst&egrave;me d'exploitation par le support
   d'un plus grand nombre de p&eacute;riph&eacute;riques, de formats de syst&egrave;mes de fichiers, de formats d'ex&eacute;cutables ou
   de services r&eacute;seaux. Le Kit OS fonctionne aussi tr&egrave;s bien pour la construction de programmes li&eacute;s au s
   yst&egrave;me d'exploitation tel que les chargeurs de boot ("boot loaders") ou les serveurs au niveau du syst&egrave;me
   d'exploitation se situant au dessus d'un micro-noyau.</li>

    </ul>

<a name="misc"></a>
<h3>Divers</h3>
    <ul>
      <li><a name="freesbie" href="http://www.freesbie.org/">FreeSBIE</a>
        est un live CD bas&eacute; sur le syst&egrave;me d'exploitation FreeBSD.
        Il inclut un large choix d'applications utiles et peut tourner soit uniquement
        &agrave; partir du CD, soit servir d'installeur pour installer FreeBSD
        sur votre disque dur.</li>

      <li><a name="nanobsd" href="&url.articles;/nanobsd/index.html">NanoBSD</a>
        est un outil con&ccedil;u pour cr&eacute;er une image syst&egrave;me
        de FreeBSD, r&eacute;duite ou non, qui peut r&eacute;sider sur une
        carte Compact Flash (ou autres syst&egrave;me de stockage de masse)
        de telle sorte qu'il convient &agrave; l'utilisation dans le cadre d'un
        serveur applicatif ("appliance").  La documentation FreeBSD contient un
        <a href="&url.articles;/nanobsd/index.html">article d'introduction &agrave; NanoBSD</a>,
        qui inclut des indications utiles sur la mani&egrave;re dont on peut mettre
        en place, lancer et utiliser NanoBSD.</li>

      <li><a name="global" href="http://www.gnu.org/software/global/global.html">GLOBAL</a>
	est un syst&egrave;me de "marquage" ("tag system") de code source commun qui fonctionne de la m&ecirc;me mani&egrave;re
   sous des environnements divers. Actuellement, il supporte l'interpr&eacute;teur de ligne de commande,
   l'&eacute;diteur nvi, les browser web, l'&eacute;diteur emacs et l'&eacute;diteur elvis.
   Les langages support&eacute;s sont le C, Yacc, et Java.</li>

      <li><A name="enterman" HREF="http://ezine.daemonnews.org/199908/enteruser.html">Enteruser : Un remplacement &agrave; Adduser</A></li>

      <li><A name="acpi" href="&base;/projects/acpi/">ACPI sur FreeBSD</A>
        est un projet visant &agrave; obtenir un fonctionnement stable
        de l'ACPI sur FreeBSD.</li>

      <li><A name="binup" 
             href="http://www.daemonology.net/freebsd-update/">Mise &agrave; jour binaire</a>:
        FreeBSD Update est un syst&egrave;me permettant, et ce de mani&egrave;re
        automatique, de construire, distribuer, r&eacute;cup&eacute;rer et appliquer
        des mises &agrave; jour de s&eacute;curit&eacute; au format binaire sous FreeBSD.
        Cela rend possible de suivre facilement les branches s&eacute;curit&eacute;
        de FreeBSD sans avoir besoin de r&eacute;cup&eacute;rer l'arbre des sources
        et recompiler (&agrave; l'exception de la machine qui construit les mises
        &agrave; jour, bien &eacute;videmment).  Les mises &agrave; jour ont une
        signature cryptographique et sont distribu&eacute;es sous forme de
        deltas binaires, ce qui r&eacute;duit drastiquement la bande passante
        utilis&eacute;e.</li>

      <li><a name="c99" href="&base;/projects/c99/index.html">Le projet FreeBSD de
          mise en conformit&eacute; &agrave; C99 &amp; &posix;</a>
        est un projet qui vise &agrave; impl&eacute;menter toutes les sp&eacute;cifications
        des standards ISO 9899:1999 (C99) et IEEE 1003.1-2001 (POSIX).</li>

      <li><a name="cvsweb" href="cvsweb.html">CVSweb</a>
        est une interface web pour les d&eacute;p&ocirc;ts CVS avec laquelle vous
        pouvez parcourir une hi&eacute;rarchie de fichiers en utilisant votre navigateur
        et visualiser l'historique des modifications appliqu&eacute;es &agrave; un fichier
        de mani&egrave;re tr&egrave;s pratique.</li>

      <li><a name="flcl"
	href="http://laptop.bsdgroup.de/freebsd/">La Liste de Compatibilit&eacute;
          des Ordinateurs Portables avec FreeBSD</a>
        est une base de donn&eacute;es listant les mod&egrave;les d'ordinateurs
        portables et de cartes PCMCIA fonctionnant sous FreeBSD. Ce site contient
        des informations d&eacute;taill&eacute;es sur les probl&egrave;mes
        mat&eacute;riels et logiciels connus.</li>

      <li><a name="tetintegration" href="http://wiki.freebsd.org/TetIntegration">
          Int&eacute;gration TET</a> :
        la Bo&icirc;te &agrave; outils pour l'Ex&eacute;cution de Tests ("Test
        Execution Toolkit - TET") de l' <a href="http://www.opengroup.org/">Open Group</a>
        est un syst&egrave;me l&eacute;ger et open-source permettant l'ex&eacute;cution
        de tests sur des environnements distribu&eacute;s ou non.  Cet outil effectue
        ses v&eacute;rifications en utilisant TET ainsi que des suites de tests
        open-source, respectant les standards, et existant sous FreeBSD
        (VSX-PCTS, VSC-Lite, VSTH-Lite, VSW5 et autres).</li>

</ul>


&footer;
</body>
</html>
