<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: n.nn
-->

<chapter id="backups">
  <title>Sauvegardes</title>
  &trans.a.haby;

      <para>Les questions de compatibilit&eacute; mat&eacute;rielle sont aujourd'hui
        les plus probl&eacute;matiques de l'industrie informatique et FreeBSD
        n'en est nullement &agrave; l'abri. De ce point de vue, l'avantage qu'a
        FreeBSD de pouvoir &ecirc;tre utilis&eacute; sur du mat&eacute;riel PC de base et
        peu co&ucirc;teux devient un probl&egrave;me lorsqu'il faut supporter la
        vari&eacute;t&eacute; incroyable de composants disponibles sur le march&eacute;. 
        Il est impossible de donner une liste exhaustive des mat&eacute;riels
        compatibles avec FreeBSD, mais ce chapitre est un catalogue des
        pilotes de p&eacute;riph&eacute;riques inclut dans FreeBSD et des mat&eacute;riels que
        chaque pilote supporte. Si possible et appropri&eacute;, des notes ont
        ajout&eacute;es sur les mat&eacute;riels eux-m&ecirc;mes. Vous pouvez aussi vous
        r&eacute;f&eacute;rer au chapitre <link linkend="kernelconfig-config">Configurer
        le noyau de FreeBSD</link> de ce manuel pour avoir
        la liste des mat&eacute;riels support&eacute;s.</para>

      <para>FreeBSD est un projet b&eacute;n&eacute;vole qui n'a pas les moyens de financer
        un service de tests, nous reposons sur vous, les utilisateurs, pour une
        grande part des informations que fournit ce catalogue. Si vous avez
        l'exp&eacute;rience personnelle d'un mat&eacute;riel qui fonctionne ou ne fonctionne
        pas avec FreeBSD, faites-le nous savoir par courrier &eacute;lectronique
        &agrave; la &a.doc;. Les questions concernant les mat&eacute;riels compatibles doivent
        &ecirc;tre adress&eacute;es &agrave; la &a.questions; (voyez la section
        <link linkend="eresources-mail">Listes
        de diffusion</link> pour plus d'information). Quand vous nous faites
        parvenir de l'information ou posez une question, n'oubliez pas s'il vous
        pla&icirc;t de pr&eacute;ciser exactement quelle version de FreeBSD vous utilisez et
        de donner le maximum de d&eacute;tails sur votre configuration
        mat&eacute;rielle.</para>

  <sect1>
    <title>* A propos des sauvegardes sur disquettes</title>

    <para></para>
  </sect1>

  <sect1 id="backups-tapebackups">
    <title>Formats de bandes</title>
    
    <para>Les principaux types de bandes sont les 4mm, 8mm, QIC, les mini-cartouches 
       et les DLT.</para>
    
    <sect2 id="backups-tapebackups-4mm">
      <title>4mm (DDS: &ldquo;Digital Data
	Storage&rdquo;)</title>

      <para>Les bandes 4mm sont en train de remplacer les bandes QIC comme format usuel
        de sauvegarde pour les stations de travail. Cette tendance s'est acc&eacute;l&eacute;r&eacute;e
        lorsque Conner a rachet&eacute; Archive, dominant sur le march&eacute; des lecteurs QIC,
        et a arr&ecirc;t&eacute; la production de ces derniers. Les bandes 4mm sont petites et
        silencieuses, mais n'ont pas la r&eacute;putation de fiabilit&eacute; des bandes 8mm. Les
        cartouches sont moins co&ucirc;teuses et plus petites (3 x 2 x 0.5 pouces, 76 x 51
	x 12 mm) que les cartouches 8mm. Leurs dur&eacute;es de vie sont faibles et comparables,
        car elles utilisent toutes les deux un proc&eacute;d&eacute; de lecture/&eacute;criture en h&eacute;lice.</para>

      <para>Leur d&eacute;bit va de ~150kB/s &agrave; ~500kB/s au maximum. Leur capacit&eacute; varie de 
        1.3 GB &agrave; 2.0 GB. La compression mat&eacute;rielle, disponible sur la plupart des
        lecteurs, double approximativement leur capacit&eacute;. Il existe des lecteurs
        multiples avec changeur de bande automatique qui ont jusqu'&agrave; six unit&eacute;s de
        lecture/&eacute;criture. La capacit&eacute; totale qu'ils g&egrave;rent atteint 240 GB.</para>

      <para>Les t&ecirc;tes 4mm, comme les t&ecirc;tes 8mm, utilisent un proc&eacute;d&eacute; de lecture/&eacute;criture
        en h&eacute;lice. Ils pr&eacute;sentent donc tous deux les avantages et les inconv&eacute;nients de ce
        proc&eacute;d&eacute;.</para>

      <para>Il faut sortir les bandes apr&egrave;s 2.000 utilisations ou 100 sauvegardes
	compl&egrave;tes.</para>
    </sect2>
    
    <sect2 id="backups-tapebackups-8mm">
      <title>Bandes 8mm (Exabyte)</title>

      <para>Les unit&eacute;s de bandes 8mm sont les unit&eacute;s SCSI les plus courantes; c'est le
        meilleure choix de bandes amovibles. Il y a une unit&eacute; Exabyte 8mm de 2GB sur
        presque chaque site. Les bandes 8mm sont fiables, silencieuses et pratiques.  
	Les cartouches ne sont pas ch&egrave;res et d'encombrement faible (4.8 x 3.3 x 0.6 
        pouces; 122 x 84 x 15 mm). Un des inconv&eacute;nients de ce format est la dur&eacute;e de
        vie relativement courte des bandes et des t&ecirc;tes du fait de la grande vitesse
        de d&eacute;filement de la bande devant les t&ecirc;tes.</para>

      <para>Leur d&eacute;bit va ~250kB/s &agrave; ~500kB/s au maximum. Leur capacit&eacute; commence &agrave;
	300 MB jusqu'&agrave; 7 GB. La compression mat&eacute;rielle, disponible sur la plupart des
        lecteurs, double approximativement leur capacit&eacute;. Il existe des lecteurs
        simples et multiples, qui accueillent six unit&eacute;s et 120 cartouches. Ils
        disposent de changeurs de bandes automatiques. Ils g&egrave;rent une capacit&eacute; de
        stockage de 840+ GB.</para> 

      <para>L'enregistrement des donn&eacute;es utilisent un proc&eacute;d&eacute; en h&eacute;lice. Les t&ecirc;tes
        sont en biais par rapport &agrave; la bande (environ 6 degr&eacute;s). La bande fait un
        angle de 270 degr&eacute;s avec le cylindre sur lequel se trouvent les t&ecirc;tes. Ce
        cylindre tourne en m&ecirc;me temps que la bande d&eacute;file. On aboutit donc &agrave; une
        grande densit&eacute; de donn&eacute;es et des pistes tr&egrave;s serr&eacute;es qui vont de biais d'un
        bord de la bande &agrave; l'autre.</para>
    </sect2>

    <sect2 id="backups-tapebackups-qic">
      <title>QIC</title>

      <para>Les bandes et les lecteurs QIC-150 sont, peut-&ecirc;tre, le format le plus
        courant. Les lecteurs de bandes QIC sont les moins chers des supports de
        sauvegarde &ldquo;s&eacute;rieux&rdquo;. Leur inconv&eacute;nient par contre est le
        co&ucirc;t des bandes. Les bandes QIC sont ch&egrave;res par rapport aux bande 4mm et 8mm,
        pr&egrave;s de 5 fois le co&ucirc;t au GB. Mais, si une demi-douzaine de bandes vous 
        suffit, le format QIC est peut-&ecirc;tre le bon choix. QIC est le format le
	<emphasis>plus</emphasis> r&eacute;pandu. Il y a un lecteur QIC d'une densit&eacute; ou
        d'une autre sur chaque site. C'est l&agrave; la difficult&eacute;, il y a de nombreuses
        densit&eacute;s diff&eacute;rentes pour des bandes physiquement semblables (parfois
        m&ecirc;me identiques). Les lecteurs QIC ne sont pas silencieux. Ils se
        positionnent bruyamment avant d'enregistrer et on les entend lorsqu'ils
        lisent, enrregistrent ou se positionnent sur la bande. Les bandes QIC
        sont volumineuses (6 x 4 x 0.7 pouces; 15.2 x 10.2 x 1.7 mm). 
        Les <link linkend="backups-tapebackups-mini">Mini-cartouches</link>,
        qui utilisent aussi des bandes 1/4" sont d&eacute;crites par ailleurs. On ne trouve
        pas d'unit&eacute;s multi-bandes avec changeur.</para>

      <para>Leur d&eacute;bit va de ~150kB/s &agrave; ~500kB/s au maximum. Leur capacit&eacute; varie de
	40 MB &agrave; 15 GB. La compression mat&eacute;rielle est disponible sur de
        nombreux mod&egrave;les r&eacute;cents. On utilise de moins en moins les lecteurs
	QIC; ils sont remplac&eacute;s par les lecteurs DAT.</para>

      <para>Les donn&eacute;es sont enregistr&eacute;es sur des pistes sur la bande. Les pistes
        sont parall&egrave;les &agrave; la bande et vont d'une extr&eacute;mit&eacute; &agrave; l'autre. Le nombre de
        pistes et donc la largeur des pistes d&eacute;pend de la capacit&eacute; de la bande. La
        plupart, sinon toutes les unit&eacute;s r&eacute;centes sont au moins compatibles en
        lecture (mais souvent aussi en &eacute;criture) avec les anciennes. Le format
        a une bonne r&eacute;putation de fiabilit&eacute; (la m&eacute;canique est plus simple est
        plus robuste que celle du syst&egrave;me en h&eacute;lice).</para>

      <para>Les bandes sont utilisables pour 5.000 sauvegardes.</para>
    </sect2>
    
    <sect2 id="backups-tapebackups-mini">
      <title>* Mini-Cartouches</title>
      
      <para></para>
    </sect2>

    <sect2 id="backups-tapebackups-dlt">
      <title>DLT</title>

      <para>Les DLT ont le taux de transfert le plus rapide de tous les types
        de lecteurs d&eacute;crits ici. La bande d'1/2" (12.5mm) est contenue dans 
        une seule cartouche &agrave; bobine (4 x 4 x 1 pouces; 100 x 100 x 25 mm). 
        La cartouche est munie d'une trappe basculante sur une face lat&eacute;rale
        enti&egrave;re. Le lecteur ouvre cette trappe pour saisir le d&eacute;but de la
        bande. Cette amorce comporte une d&eacute;coupe ovale que le lecteur utilise
        pour &ldquo;crocheter&rdquo; la bande. La bobine d'entra&icirc;nement se 
        trouve dans le lecteur. Tous les autres types de cartouches d&eacute;crits
        ici (les bandes neuf pistes sont la seule exception) incorporent les 
        bobines de stockage et d'entra&icirc;nement.</para>

      <para>Leur d&eacute;bit est d'environ 1.5MB/s, trois fois celui des bandes 4mm,
        8mm et QIC. La capacit&eacute; d'une bande va de 10GB &agrave; 20GB. Il y a des unit&eacute;s
        avec changeur de bandes et des unit&eacute;s avec plusieurs lecteurs/enregistreurs
        qui vont de 5 &agrave; 900 bandes et de 1 &agrave; 20 lecteurs, ce qui procure une
        capacit&eacute; totale de 50GB &agrave; 9TB.</para>

      <para>Les donn&eacute;es sont enregistr&eacute;es sur des pistes parall&egrave;les &agrave; la direction
        de d&eacute;filement (tout comme les bandes QIC). L'&eacute;criture se fait sur deux pistes
        &agrave; la fois. La dur&eacute;e de vie des t&ecirc;tes de lecture/&eacute;criture est relativement
        longue; une fois que la bande s'arr&ecirc;te, il n'y a pas de d&eacute;placement des t&ecirc;tes
        par rapport &agrave; la bande.</para>
    </sect2>

    <sect2>
      <title>Utiliser une bande neuve pour la premi&egrave;re fois</title>

      <para>La premi&egrave;re fois que vous essayer de lire ou d'&eacute;crire sur une bande vierge,
        l'op&eacute;ration &eacute;choue. La console affiche des messages du type:</para>
      
<informalexample>
	<screen>st0(ncr1:4:0): NOT READY asc:4,1
st0(ncr1:4:0):  Logical unit is in process of becoming ready</screen>
      </informalexample>

      <para>Il n'y a pas de bloc d'identification (bloc num&eacute;ro 0) sur la bande.
        Tous les lecteurs QIC &eacute;crivent un bloc d'identification sur la bande 
        depuis l'adoption du standard QIC-525. Il y a deux solutions:</para>
      
      <itemizedlist>
      <listitem>
      <para><command>mt fsf 1</command> fait &eacute;crire au lecteur le bloc 
        d'identification sur la bande.</para>
      </listitem>
      
      <listitem>
      <para>Utilisez le bouton du panneau frontal pour &eacute;jecter la bande,</para>
      
      <para>r&eacute;ins&eacute;rez la bande et utilisez
	<citerefentry>
	  <refentrytitle>dump</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> pour &eacute;crire dessus,</para>
      
      <para><citerefentry>
	  <refentrytitle>dump</refentrytitle>
	  <manvolnum>8</manvolnum></citerefentry> produira l'erreur <literal>DUMP:
	  End of tape detected</literal> et la console affichera:
	<literal>HARDWARE FAILURE info:280 asc:80,96</literal>,</para>
      
      <para>rembobinez la bande avec: <command>mt rewind</command>,</para>
      
      <para>les manipulations ult&eacute;rieures sur la bande fonctionneront.</para>
      </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  
  <sect1 id="backup-programs">
    <title>Programmes de sauvegarde</title>
    
    <para>Les trois principaux programmes sont:
      <citerefentry>
	<refentrytitle>dump</refentrytitle>
	<manvolnum>8</manvolnum></citerefentry>,
      <citerefentry>
	<refentrytitle>tar</refentrytitle>
	<manvolnum>1</manvolnum></citerefentry>,
      et
      <citerefentry>
	<refentrytitle>cpio</refentrytitle>
	<manvolnum>1</manvolnum></citerefentry>.</para>
    
    <sect2>
      <title>Dump et Restore</title>
      
      <para><citerefentry>
	  <refentrytitle>dump</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> et <citerefentry>
	  <refentrytitle>restore</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> sont les programmes de sauvegarde traditionnels d'Unix.
        Ils consid&eacute;rent la bande comme une suite de blocs de disque, en dessous
        du niveau d'abstraction que constituent les fichiers, liens et r&eacute;pertoires
        cr&eacute;&eacute;s par les syst&egrave;mes de fichiers.
	<citerefentry>
	  <refentrytitle>dump</refentrytitle>
	    <manvolnum>8</manvolnum>
	  </citerefentry> sauvegarde des entr&eacute;es de "p&eacute;riph&eacute;riques", des syst&egrave;mes
          de fichiers complets, et non des sous-ensembles d'un syst&egrave;me de fichiers
          ou des arborescences de r&eacute;pertoires qui se r&eacute;partissent sur plusieurs
          syst&egrave;mes de fichiers, via des liens symboliques cr&eacute;&eacute;s avec
	<citerefentry>
	  <refentrytitle>ln</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry> ou en montant un syst&egrave;me de fichiers sur un autre.
	<citerefentry>
	  <refentrytitle>dump</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> n'&eacute;crit pas de fichiers ou r&eacute;pertoires sur la bande, mais
          &eacute;crit les blocs de donn&eacute;es dont sont constitu&eacute;s les fichiers et
	les r&eacute;pertoires. <citerefentry>
	  <refentrytitle>dump</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> a quelques particularit&eacute;s qui datent de la 
	Version 6 d'ATT Unix (circa 1975). Les param&egrave;tres par d&eacute;faut
	conviennent aux bandes 9 pistes (6250 bpi) et non aux supports
        &agrave; haute densit&eacute; que l'on trouve maintenant (jusqu'&agrave; 62,182 ftpi). 
        Il faut surcharger ces valeurs par d&eacute;faut sur la ligne de 
        commande pour utiliser la capacit&eacute; des bandes actuelles.</para>
      
      <para><citerefentry>
	  <refentrytitle>rdump</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> et <citerefentry>
	  <refentrytitle>rrestore</refentrytitle>
	  <manvolnum>8</manvolnum></citerefentry> sauvegardent les donn&eacute;es
          via le r&eacute;seau sur une unit&eacute; de bandes qui se trouve sur une
	  autre machine. Les deux programmes se servent de
	<citerefentry>
	  <refentrytitle>rcmd</refentrytitle>
	  <manvolnum>3</manvolnum>
	</citerefentry> et <citerefentry>
	  <refentrytitle>ruserok</refentrytitle>
	  <manvolnum>3</manvolnum></citerefentry> pour acc&eacute;der &agrave; l'unit&eacute; de
        bandes distante. L'utilisateur qui effectue la sauvegarde doit donc
        avoir un acc&egrave;s <literal>rhosts</literal> &agrave; la machine distante. Les
	arguments de <citerefentry>
	  <refentrytitle>rdump</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> et <citerefentry>
	  <refentrytitle>rrestore</refentrytitle>
	  <manvolnum>8</manvolnum>
	</citerefentry> doivent &ecirc;tre compatibles avec la machine distante (e.g.
        si vous sauvegardez d'une machine FreeBSD sur un lecteur Exabyte
        install&eacute; sur un ordinateur Sun appel&eacute;
	<hostid>komodo</hostid>, utilisez: <command>/sbin/rdump 0dsbfu 54000
	  13000 126 komodo:/dev/nrst8 /dev/rsd0a 2>&amp;1</command>) Attention:
	Autoriser les commandes <literal>rhosts</literal> a des cons&eacute;quences
	pour la s&eacute;curit&eacute;. Evaluez soigneusement votre situation.</para>
    </sect2>

    <sect2>
      <title>Tar</title>
      
      <para><citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry> date aussi de la Version 6 d'ATT Unix (circa
	1975). <citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry> travaille en coop&eacute;ration avec le syst&egrave;me de fichiers;
	<citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry> &eacute;crit des fichiers et des r&eacute;pertoires sur la bande.
	<citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry> ne supporte pas toutes les options que permet
	<citerefentry>
	  <refentrytitle>cpio</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry>, mais <citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> ne demande pas
        l'inhabituelle concat&eacute;nation de commandes qu'utilise
	<citerefentry>
	  <refentrytitle>cpio</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry>.</para>
      
      <para>La plupart des versions de <citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry> ne donnent pas la possibilit&eacute; de sauvegarde en r&eacute;seau. La
	version GNU de <citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry>, que FreeBSD utilise,
	supporte les p&eacute;riph&eacute;riques distants avec la m&ecirc;me syntaxe que
	<command>rdump</command>. Pour sauvegarder avec <citerefentry>
	  <refentrytitle>tar</refentrytitle>
	  <manvolnum>1</manvolnum>
	</citerefentry> sur une unit&eacute; Exabyte install&eacute;e sur un Sun appel&eacute;
	komodo, utilisez: <command>/usr/bin/tar cf komodo:/dev/nrst8 .
	  2>&amp;1</command>. Avec les versions sans support pour des
        p&eacute;riph&eacute;riques distants, vous pouvez utilisez un tuyau (&ldquo;pipe&rdquo;)
	et <citerefentry>
	  <refentrytitle>rsh</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> pour envoyer les donn&eacute;es
        sur le lecteur distant.</para>
    </sect2>
    
    <sect2>
      <title>Cpio</title>
      
      <para><citerefentry>
	  <refentrytitle>cpio</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> est le programme Unix
        original pour l'&eacute;change de fichiers par bandes magn&eacute;tiques.
	<citerefentry>
	  <refentrytitle>cpio</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> dispose d'options (entre
        beaucoup d'autres) pour intervertir les octets, utiliser diff&eacute;rents
        formats d'archivage et envoyer les donn&eacute;es &agrave; d'autres programmes.
        C'est cette derni&egrave;re possibilit&eacute; qui fait de 
	<citerefentry>
	  <refentrytitle>cpio</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> un excellent choix pour
	les supports d'installation. <citerefentry>
	  <refentrytitle>cpio</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> ne sait pas parcourir
        l'arborescence d'un r&eacute;pertoire et il faut lui passer la liste
        des fichiers via
	<filename>STDIN</filename>.</para>
      
      <para><citerefentry>
	  <refentrytitle>cpio</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> ne permet pas la
        sauvegarde sur le r&eacute;seau et il faut utiliser un tuyau (&ldquo;pipe&rdquo;) 
        et <citerefentry>
	  <refentrytitle>rsh</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> pour envoyer les donn&eacute;es sur une
	unit&eacute; distante.</para>
    </sect2>
    
    <sect2>
      <title>Pax</title>
      
      <para><citerefentry>
	  <refentrytitle>pax</refentrytitle>
	  <manvolnum>1</manvolnum></citerefentry> est la r&eacute;ponse IEEE/POSIX &agrave;
	<command>tar</command> et <command>cpio</command>. Au fil des ans, les
	diff&eacute;rentes versions de <command>tar</command> et <command>cpio</command>
        sont devenues l&eacute;g&eacute;rement incompatibles. Donc, au lieu de batailler pour
        les standardiser enti&egrave;rement, POSIX a d&eacute;fini un nouvel utilitaire d'archivage.
	<command>pax</command> essaie de lire nombre de formats
        <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> et
        <citerefentry><refentrytitle>cpio</refentrytitle><manvolnum>1</manvolnum></citerefentry> en
        plus de ses propres nouveaux formats. Son jeu de commandes ressemble plus &agrave;
        celui de <command>cpio</command> qu'&agrave; celui de
	<command>tar</command>.</para>
      </sect2>

    <sect2 id="backups-programs-amanda">
      <title>Amanda</title>
      
      <para><ulink url="http://www.freebsd.org/ports/misc.html#amanda-2.4.0">Amanda</ulink>
	(Advanced Maryland Network Disk Archiver&nbsp;-&nbsp;Syst&egrave;me Avanc&eacute; d'Archivage
        de Disques en R&eacute;seau du Maryland ) est un syst&egrave;me d'archivage client/serveur
        plut&ocirc;t qu'un simple programme. Un serveur Amanda archivera sur une seule
        unit&eacute; de bandes un nombre quelconque d'ordinateurs qui ont un client
        Amanda et un acc&egrave;s r&eacute;seau au serveur Amanda. Un probl&egrave;me habituel sur
        les sites qui ont de nombreux disques volumineux est le temps disponible
        pour la sauvegarde. Amanda r&eacute;soud ce probl&egrave;me. Amanda peut utiliser un
	&ldquo;disque interm&eacute;diaire&rdquo; pour sauvegarder plusieurs syst&egrave;mes de fichiers
        &agrave; la fois. Amanda cr&eacute;e des &ldquo;jeux d'archive&rdquo;, un ensemble de bandes
        utilis&eacute;es pour une p&eacute;riode donn&eacute;e pour cr&eacute;er une sauvegarde compl&egrave;te de tous les
        syst&egrave;mes de fichiers list&eacute;s dans ses fichiers de configuration.
        Le &ldquo;jeu d'archive&rdquo; contient aussi les sauvegardes nocturnes
	incr&eacute;mentales (ou diff&eacute;rentielles) de tous les syst&egrave;mes de fichiers.
        Pour restaurer un syst&egrave;me de fichiers endommag&eacute;, il faut la sauvegarde
        compl&egrave;te la plus r&eacute;cente et les sauvegardes incr&eacute;mentales.</para>

      <para>Le fichier de configuration permet un contr&ocirc;le en finesse des
        sauvegardes et du trafic qu'Amanda g&eacute;n&eacute;re sur le r&eacute;seau. Amanda peut
        utiliser n'importe lequel des programmes de sauvegarde d&eacute;crits plus
        haut pour &eacute;crire les donn&eacute;es sur bande. Amanda existe sous forme
        pr&eacute;-compil&eacute;e ou source, il n'est pas install&eacute; par d&eacute;faut.</para>
      </sect2>

    <sect2>
      <title>Ne rien faire</title>
      
      <para>&ldquo;Ne rien faire&rdquo; n'est pas un logiciel, mais c'est la
        strat&eacute;gie de sauvegarde la plus utilis&eacute;e. Il n'y a aucun investissement.
        Il n'y a pas de planification des sauvegardes &agrave; suivre. Juste dire non.
        Si quelque chose arrive &agrave; vos donn&eacute;es, souriez et d&eacute;brouillez-vous!</para>
	
      <para>Si votre temps et vos donn&eacute;es ne valent pas grand chose, alors
	&ldquo;Ne rien faire&rdquo; est le programme de sauvegarde le mieux
        adapt&eacute; &agrave; votre ordinateur. Mais prenez garde, Unix est un bon outil,
        vous pouvez vous rendre compte au bout de six mois que vous avez une
        collection de fichiers utiles.</para>

      <para>&ldquo;Ne rien faire&rdquo; est la bonne m&eacute;thode pour sauvegarder
	<filename>/usr/obj</filename> et les autres r&eacute;pertoires qui peuvent
        facilement &ecirc;tre recr&eacute;&eacute;s par votre ordinateur. Par exemple, les fichiers
        qui constituent ces pages ont &eacute;t&eacute; g&eacute;n&eacute;r&eacute;s &agrave; partir de fichiers
	<acronym>SGML</acronym>. Il n'est pas n&eacute;cessaire d'archiver ces fichiers
	<acronym>HTML</acronym>. Les fichiers source 
	<acronym>SGML</acronym> sont sauvegard&eacute;s r&eacute;guli&egrave;rement.</para>
    </sect2>
    
    <sect2>
      <title>Quel est le meilleur programme de sauvegarde?</title>
      
      <para><citerefentry>
	  <refentrytitle>dump</refentrytitle>
	  <manvolnum>8</manvolnum></citerefentry> <emphasis>Point.</emphasis>
        Elizabeth D. Zwicky a soumis &agrave; rude &eacute;preuve tous les programmes de
        sauvegarde dont nous avons parl&eacute;. Le choix de 
        <citerefentry><refentrytitle>dump</refentrytitle>
	  <manvolnum>8</manvolnum></citerefentry> s'impose pour pr&eacute;server toutes
        vos donn&eacute;es et les particularit&eacute;s des syst&egrave;mes de fichiers Unix.
        Elizabeth a cr&eacute;&eacute; des syst&egrave;mes de fichiers avec une grande vari&eacute;t&eacute;
        de particularit&eacute;s inhabituelles et a test&eacute; chacun des programmes
        en faisant une sauvegarde et une restauration. Parmi les sp&eacute;cificit&eacute;s
        test&eacute;es : fichiers avec des trous, fichiers avec des trous et des blocs
        de caract&egrave;res &ldquo;null&rdquo;, fichiers dont les noms comportaient des
        caract&egrave;res inhabituels, fichiers illisibles ou dans lesquels il n'&eacute;tait
        pas possible d'&eacute;crire, p&eacute;riph&eacute;riques, fichiers dont la taille changeait
        pendant la sauvegarde, fichiers cr&eacute;&eacute;s ou d&eacute;truits en cours de sauvegarde,
        et bien d'autres encore. Elle a pr&eacute;sent&eacute; les r&eacute;sultats de ces test au
	LISA V en Octobre 1991. Voyez ses <ulink
	  url="http://reality.sgi.com/zwicky_neu/testdump.doc.html">Tests d'endurance des programmes
        de sauvegarde et de restauration</ulink>.</para>
    </sect2>
    
    <sect2>
     <title>Proc&eacute;dure de restauration d'urgence</title>
      
      <sect3>
	<title>Avant le d&eacute;sastre</title>
	
	<para>Il y a quatre &eacute;tapes &agrave; mettre en oeuvre en pr&eacute;vision d'un d&eacute;sastre &eacute;ventuel.</para>
	    
	<para>Tout d'abord, imprimez le label de chacun de vos disques
	  (<command>e.g. disklabel sd0 | lpr</command>), votre table des syst&egrave;mes de fichiers
	  (<command>/etc/fstab</command>) et tous les messages de d&eacute;marrage, 
          en deux exemplaires.</para>

	<para>Deuxi&egrave;mement, v&eacute;rifiez que vos disquettes de d&eacute;marrage
          et de reprise d'urgence
	  (<filename>boot.flp</filename> et <filename>fixit.flp</filename>)
          incluent tous vos p&eacute;riph&eacute;riques. La meilleure fa&ccedil;on de le v&eacute;rifier 
          est de red&eacute;marrer avec la disquette de d&eacute;marrage dans le lecteur
          et de contr&ocirc;ler les messages de d&eacute;marrage. Si tous les p&eacute;riph&eacute;riques
          y figurent et sont op&eacute;rationnels, passez &agrave; la troisi&egrave;me &eacute;tape.</para>

	<para>Sinon, vous devez cr&eacute;er deux disquettes de d&eacute;marrage sur-mesure
          avec un noyau qui puisse monter tous vos disques et acc&eacute;der &agrave; votre 
          unit&eacute; de bandes. Ces disquettes doivent contenir:
	  <citerefentry>
	    <refentrytitle>fdisk</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry>, <citerefentry>
	    <refentrytitle>disklabel</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry>, <citerefentry>
	    <refentrytitle>newfs</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry>, <citerefentry>
	    <refentrytitle>mount</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry>, et celui des programmes
            de sauvegarde que vous utilisez. L'&eacute;dition de liens de ces
          programmes doit &ecirc;tre statique. Si vous utilisez
	  <citerefentry>
	    <refentrytitle>dump</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry>, les disquettes doivent
          inclure
	  <citerefentry>
	    <refentrytitle>restore</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry>.</para>
	
	<para>Troisi&egrave;mement, faites r&eacute;guli&egrave;rement des sauvegardes sur bandes. Toutes
          les modifications effectu&eacute;es apr&egrave;s la derni&egrave;re sauvegarde peuvent &ecirc;tre
          irr&eacute;m&eacute;diablement perdues. Prot&eacute;gez vos bandes de sauvegarde en &eacute;criture.</para>

	<para>Quatri&egrave;mement, testez vos disquettes (soit <filename>boot.flp</filename>
	  et <filename>fixit.flp</filename>, soit les deux disquettes sur-mesure que vous
          avez cr&eacute;&eacute;es &agrave; la seconde &eacute;tape) et vos bandes de sauvegarde. Prenez note de
          la proc&eacute;dure (de restauration). Rangez ces notes avec la disquette de d&eacute;marrage, 
          les impressions et les bandes de sauvegarde. Vous serez si pr&eacute;occup&eacute; quand vous 
          devrez restaurer que ces notes peuvent vous &eacute;viter de d&eacute;truire vos bandes de
          sauvegarde (Comment? En tapant accidentellement 
          <command>tar cvf /dev/rst0</command> au lieu de <command>tar xvf</command> ce qui
          &eacute;craserait vos bandes de sauvegarde).</para>

	<para>Par mesure de s&eacute;curit&eacute;, cr&eacute;ez une disquette de d&eacute;marrage et deux bandes
          de sauvegarde &agrave; chaque fois. Rangez-les dans un lieu &eacute;loign&eacute;. Le sous-sol
          du m&ecirc;me batiment <emphasis>n'est pas</emphasis> un endroit &eacute;loign&eacute;. Un certain
          nombre de compagnies du World Trade Center l'ont appris &agrave; leurs d&eacute;pends. Un
          endroit &eacute;loign&eacute; doit &ecirc;tre physiquement significativement s&eacute;par&eacute; de vos
          ordinateurs et de vos disques.</para>

	<para>Voici un exemple de proc&eacute;dure pour cr&eacute;er une disquette de d&eacute;marrage:</para>
	  
	<programlisting>
<![ CDATA [#!/bin/sh
#
# cr&eacute;er une disquette de restauration
#
# formater la disquette
#
PATH=/bin:/sbin:/usr/sbin:/usr/bin

fdformat -q fd0
if [ $? -ne 0 ]
then
	 echo "Mauvaise disquette, utilisez-en une neuve"
	 exit 1
fi
#
# mettre les blocs de d&eacute;marrage sur la disquette
#
disklabel -w -B -b /usr/mdec/fdboot -s /usr/mdec/bootfd /dev/rfd0c fd1440

#
# newfs sur la seule et unique partition
#
newfs -t 2 -u 18 -l 1 -c 40 -i 5120 -m 5 -o space /dev/rfd0a

#
# monter la nouvelle disquette
#
mount /dev/fd0a /mnt

#
# cr&eacute;er les r&eacute;pertoires voulus
#
mkdir /mnt/dev
mkdir /mnt/bin
mkdir /mnt/sbin
mkdir /mnt/etc
mkdir /mnt/root
mkdir /mnt/mnt			# pour la partition racine
mkdir /mnt/tmp
mkdir /mnt/var

#
# peupler les r&eacute;pertoires
#
if [ ! -x /sys/compile/MINI/kernel ] 
then
	 cat << EOM
Le noyau MINI n'existe pas, cr&eacute;ez-le.
Voici un exemple de fichier de configuration:
#
# MINI -- Un noyau pour FreeBSD pour mettre sur une disquette.
#
machine		"i386"
cpu		"I486_CPU"
ident		MINI
maxusers	5

options		INET		# requis pour _tcp _icmpstat _ipstat
				#             _udpstat _tcpstat _udb
options		FFS		#Berkeley Fast File System
options		FAT_CURSOR	#gros curseur pour syscons ou pccons
options		SCSI_DELAY=15	#Etre pessimiste pour les p&eacute;riph&eacute;riques SCSI de Joe
options		NCONS=2		#1 consoles virtuelle
options		USERCONFIG	#Permettre la configuration utilisateur avec -c XXX

config		kernel	root on sd0 swap on sd0 and sd1 dumps on sd0

controller	isa0
controller	pci0

controller	fdc0	at isa? port "IO_FD1" bio irq 6 drq 2 vector fdintr
disk		fd0	at fdc0 drive 0

controller	ncr0

controller	scbus0

device		sc0	at isa? port "IO_KBD" tty irq 1 vector scintr
device		npx0	at isa? port "IO_NPX" irq 13 vector npxintr

device		sd0
device		sd1
device		sd2

device		st0

pseudo-device	loop		# requis par INET
pseudo-device	gzip		# Pouvoir ex&eacute;cuter les a.out "gzipp&eacute;s"
EOM
	 exit 1
fi

cp -f /sys/compile/MINI/kernel /mnt

gzip -c -best /sbin/init > /mnt/sbin/init
gzip -c -best /sbin/fsck > /mnt/sbin/fsck
gzip -c -best /sbin/mount > /mnt/sbin/mount
gzip -c -best /sbin/halt > /mnt/sbin/halt
gzip -c -best /sbin/restore > /mnt/sbin/restore

gzip -c -best /bin/sh > /mnt/bin/sh
gzip -c -best /bin/sync > /mnt/bin/sync

cp /root/.profile /mnt/root

cp -f /dev/MAKEDEV /mnt/dev
chmod 755 /mnt/dev/MAKEDEV

chmod 500 /mnt/sbin/init
chmod 555 /mnt/sbin/fsck /mnt/sbin/mount /mnt/sbin/halt
chmod 555 /mnt/bin/sh /mnt/bin/sync
chmod 6555 /mnt/sbin/restore

#
# cr&eacute;er les fichiers sp&eacute;ciaux de p&eacute;riph&eacute;riques
#
cd /mnt/dev
./MAKEDEV std
./MAKEDEV sd0
./MAKEDEV sd1
./MAKEDEV sd2
./MAKEDEV st0
./MAKEDEV pty0
cd /

#
# cr&eacute;er une table des syst&egrave;mes de fichiers minimale
#
cat > /mnt/etc/fstab <<EOM
/dev/fd0a	/	ufs	rw 1 1
EOM

#
# cr&eacute;er un fichier d'utilisateurs minimal
#
cat > /mnt/etc/passwd <<EOM
root:*:0:0:Charlie &:/root:/bin/sh
EOM

cat > /mnt/etc/master.passwd <<EOM
root::0:0::0:0:Charlie &:/root:/bin/sh
EOM

chmod 600 /mnt/etc/master.passwd
chmod 644 /mnt/etc/passwd
/usr/sbin/pwd_mkdb -d/mnt/etc /mnt/etc/master.passwd

#
# d&eacute;monter la disquette et pr&eacute;venir l'utilisateur
#
/sbin/umount /mnt]]></programlisting>
      </sect3>

      <sect3>
	<title>Apr&egrave;s le d&eacute;sastre</title>
	
	<para>La question cruciale est: votre mat&eacute;riel a-t-il surv&eacute;cu? Vous avez fait 
          des sauvegardes r&eacute;guli&egrave;res, donc vous n'avez pas besoin de vous inqui&eacute;ter
          pour les logiciels et les fichiers.</para>
	
	<para>Si le mat&eacute;riel a subi des d&eacute;gats, remplacez d'abord ce qui a &eacute;t&eacute;
	  endommag&eacute;.</para>
	
	<para>Si votre mat&eacute;riel est en &eacute;tat, r&eacute;cup&eacute;rez vos disquettes. Si vous
          utilisez une disquette sur-mesure, d&eacute;marrez en mode mono-utilisateur
	  (tapez <literal>-s</literal> &agrave; l'invite <prompt>boot:</prompt>). Sautez
	  le paragraphe suivant.</para>
	  
	<para>Si vous utilisez les disquettes <filename>boot.flp</filename> et
	  <filename>fixit.flp</filename>, continuez &agrave; lire. Mettez la disquette 
	  <filename>boot.flp</filename> dans le premier lecteur et d&eacute;marrez
          l'ordinateur. Le menu d'installation d'origine s'affiche &agrave; l'&eacute;cran,
          choisissez l'option <literal>Fixit--Repair mode with CDROM or
          floppy</literal> (Reprise avec une disquette ou un CDROM). Ins&eacute;rez la
	  disquette <filename>fixit.flp</filename> quand on vous la demande.
	  <command>restore</command> et les autres programmes dont vous avez besoin
	  sont dans le r&eacute;pertoire <filename>/mnt2/stand</filename>.</para>

	<para>Restaurez s&eacute;parement chaque syst&egrave;me de fichiers.</para>
	
	<para>Essayez <citerefentry>
	    <refentrytitle>mount</refentrytitle>
	    <manvolnum>8</manvolnum>
	  </citerefentry>(e.g. <command>mount /dev/sd0a
	    /mnt</command>) sur la partition racine de votre premier disque. 
	  Si le label du disque est endommag&eacute;, utilisez <citerefentry>
	    <refentrytitle>disklabel</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry> pour repartitionner et
          libeller le disque comme l'indique le label que vous avez imprim&eacute;
          et mis de c&ocirc;t&eacute;. Utilisez
	  <citerefentry>
	    <refentrytitle>newfs</refentrytitle>
	    <manvolnum>8</manvolnum></citerefentry> pour recr&eacute;er les syst&egrave;mes
          de fichiers. Remontez la partition racine de la disquette en
          lecture/&eacute;criture (<command>mount -u -o rw /mnt</command>). Utilisez
          votre programme de restauration et vos bandes de sauvegardes pour
          restaurer les fichiers de ce syst&egrave;me de fichiers (e.g.
	  <command>restore vrf /dev/st0</command>). D&eacute;montez le syst&egrave;me de fichiers
	  (e.g. <command>umount /mnt</command>). R&eacute;p&eacute;tez l'op&eacute;ration pour chacun
	  des syst&egrave;mes de fichiers endommag&eacute;s.</para>
	
	<para>Une fois que le syst&egrave;me fonctionne de nouveau, faites une sauvegarde
          sur de nouvelles bandes. Ce qui a caus&eacute; la panne ou la perte de donn&eacute;es
          peut se reproduire. Une heure de perdue maintenant peut vous &eacute;pargner
          d'autres ennuis plus tard.</para>
      </sect3>
      
      <sect3>
	<title>* Je ne me suis pas pr&eacute;par&eacute; au d&eacute;sastre, que faire?</title>
	
	<para></para>
      </sect3>
    </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End:
-->
