Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/new-users/_index.po
Languages: pt_br, ru

source: Introduction for people new to both FreeBSD and UNIX®
pt_br: Introdução para iniciantes tanto no FreeBSD quanto no UNIX®
ru: Введение для пользователей, не знакомых с FreeBSD и UNIX®

source: For People New to Both FreeBSD and UNIX®
pt_br: Para iniciantes tanto no FreeBSD quanto no UNIX®
ru: Для тех, кто новичок и в FreeBSD, и в UNIX®

source: For People New to Both FreeBSD and UNIX(R)
pt_br: Para iniciantes tanto no FreeBSD quanto no UNIX®
ru: Пособие для новичков во FreeBSD и UNIX(R)

source: Abstract
pt_br: Resumo
ru: Аннотация

source: Congratulations on installing FreeBSD! This introduction is for people new to both FreeBSD _and_ UNIX(R)-so it starts with basics.
pt_br: Parabéns por instalar o FreeBSD! Esta introdução é destinada a usuários iniciantes tanto no FreeBSD quanto no UNIX(R) - então ela começa com o básico.
ru: Поздравляем вас с установкой FreeBSD! Это вводное пособие предназначено для тех, кто является новичком в мире FreeBSD _и_ UNIX(R)-так что оно начнётся с основ.

source: Logging in and Getting Out
pt_br: Logando e Deslogando
ru: Регистрация в системе и выход из неё

source: Log in (when you see `login:`) as a user you created during installation or as `root`. (Your FreeBSD installation will already have an account for `root`; who can go anywhere and do anything, including deleting essential files, so be careful!) The symbols % and # in the following stand for the prompt (yours may be different), with % indicating an ordinary user and # indicating `root`.
pt_br: Faça login (quando você ver `login:`) com o usuário que você criou durante a instalação ou como `root`. (Sua instalação do FreeBSD já terá uma conta para o usuário `root`, o qual pode ir a qualquer lugar e fazer qualquer coisa, incluindo excluir arquivos essenciais, então tenha cuidado!) Os símbolos % e # abaixo representam o prompt (o seu pode ser diferente), sendo que o % indica um usuário comum e o # indica o usuário `root`.
ru: Войдите в систему (когда увидите `login:`), используя пользователя, созданного во время установки, или как `root`. (В вашей установке FreeBSD уже будет учётная запись для `root`; этот пользователь может ходить куда угодно и делать что угодно, включая удаление важных файлов, так что будьте осторожны!) Символы % и # в дальнейшем обозначают приглашение командной строки (у вас оно может выглядеть иначе), где % означает обычного пользователя, а # — `root`.

source: To log out (and get a new `login:` prompt) type
pt_br: Para sair (e obter um novo prompt `login:`), digite
ru: Чтобы выйти из системы (и получить новое приглашение `login:`) наберите

source: as often as necessary. Yes, press kbd:[enter] after commands, and remember that UNIX(R) is case-sensitive-``exit``, not `EXIT`.
pt_br: quantas vezes for necessário. Sim, pressione kbd:[enter] após os comandos e lembre-se de que o UNIX(R) é sensível a maiúsculas e minúsculas - use ``exit``, não EXIT.
ru: столько раз, сколько нужно. Да, нажимайте kbd:[enter] после набора команд, и помните, что UNIX(R) чувствителен к регистру букв-набирайте `exit`, но не `EXIT`.

source: To shut down the machine type
pt_br: Para desligar o computador, digite
ru: Для завершения работы машины наберите

source: Or to reboot type
pt_br: Ou para reiniciar, digite
ru: Или, для перезагрузки нужно набрать

source: or
pt_br: ou
ru: или

source: You can also reboot with kbd:[Ctrl+Alt+Delete]. Give it a little time to do its work. This is equivalent to `/sbin/reboot` in recent releases of FreeBSD and is much, much better than hitting the reset button. You do not want to have to reinstall this thing, do you?
pt_br: Você também pode reiniciar o sistema com kbd:[Ctrl+Alt+Delete]. Dê um pouco de tempo para que o sistema execute suas tarefas. Isso é equivalente a `/sbin/reboot` nas versões recentes do FreeBSD e é muito, muito melhor do que pressionar o botão de reset. Você não quer ter que reinstalar tudo, certo?
ru: Перезагрузку можно также выполнить нажатием клавиш kbd:[Ctrl+Alt+Delete]. Подождите некоторое время, чтобы дать этой команде отработать. В последних релизах FreeBSD она эквивалента выдаче команды `/sbin/reboot` и гораздо, гораздо лучше, чем нажатие кнопки сброса. Вы ведь не хотите всё переустанавливать заново, не так ли?

source: Adding a User with Root Privileges
pt_br: Adicionando um Usuário com Privilégios de Root
ru: Добавление пользователя с привилегиями root

source: If you did not create any users when you installed the system and are thus logged in as `root`, you should probably create a user now with
pt_br: Se você não criou nenhum usuário durante a instalação do sistema e, portanto, está conectado como `root`, é provável que você queira criar um usuário agora com o seguinte comando
ru: Если при установке системы вы не создали ни одного пользователя, и поэтому вошли в систему как `root`, то теперь вы должны создать пользователя по команде

source: The first time you use `adduser`, it might ask for some defaults to save. You might want to make the default shell man:csh[1] instead of man:sh[1], if it suggests `sh` as the default. Otherwise just press enter to accept each default. These defaults are saved in [.filename]#/etc/adduser.conf#, an editable file.
pt_br: A primeira vez que você usa o comando `adduser`, ele pode solicitar algumas opções padrão para salvar. Você pode querer definir o shell padrão como man:csh[1] em vez de man:sh[1], se ele sugerir `sh` como padrão. Caso contrário, basta pressionar Enter para aceitar cada opção padrão. Essas opções padrão são salvas em [.filename]#/etc/adduser.conf#, um arquivo que pode ser editado.
ru: При первом использовании утилиты `adduser` она может запрашивать сохранение некоторых параметров для использования их по умолчанию. вы можете сделать оболочкой, используемой по умолчанию, командный процессор man:csh[1], а не man:sh[1], если по умолчанию вам предлагается `sh`. В противном случае просто нажимайте enter для принятия всех предлагаемых по умолчанию вариантов. Эти значения по умолчанию сохраняются в файле [.filename]#/etc/adduser.conf#, в форме, доступной для редактирования.

source: Suppose you create a user `jack` with full name _Jack Benimble_. Give `jack` a password if security (even kids around who might pound on the keyboard) is an issue. When it asks you if you want to invite `jack` into other groups, type `wheel`
pt_br: Suponha que você crie um usuário chamado `jack` com o nome completo _Jack Benimble_. Defina uma senha para `jack` se a segurança for uma preocupação (mesmo que sejam apenas crianças por perto que possam bater no teclado). Quando o comando `adduser` perguntar se você deseja convidar `jack` para outros grupos, digite `wheel`
ru: Предположим, что вы создали пользователя `jack` с полным именем __Jack Benimble__. Назначьте пользователю `jack` пароль, если информационная безопасность имеет значение (даже если это дети, которые могут стучать по клавиатуре). Когда вам будет задан вопрос по включению пользователя `jack` в другие группы, наберите `wheel`

source: This will make it possible to log in as `jack` and use the man:su[1] command to become `root`. Then you will not get scolded any more for logging in as `root`.
pt_br: Isso tornará possível fazer login como `jack` e usar o comando man:su[1] para se tornar `root`. Então, você não receberá mais repreensões por fazer login como `root`.
ru: Это позволит входить в систему как пользователь `jack` и использовать команду man:su[1] для того, чтобы стать пользователем `root`. Тогда вас не будут больше обвинять в том, чтобы вы входите в систему как пользователь `root`.

source: You can quit `adduser` any time by typing kbd:[Ctrl+C], and at the end you will have a chance to approve your new user or simply type kbd:[n] for no. You might want to create a second new user so that when you edit `jack`'s login files, you will have a hot spare in case something goes wrong.
pt_br: Você pode interromper o comando `adduser` a qualquer momento digitando kbd:[Ctrl+C], e no final você terá a chance de aprovar o novo usuário ou simplesmente digitar kbd:[n] para não aprovar. Você pode querer criar um segundo usuário para que, ao editar os arquivos de login de `jack`, você tenha um usuário reserva caso algo dê errado.
ru: Вы можете прекратить работы с `adduser` в любой момент, нажав kbd:[Ctrl+C], а в завершении ввода у вас будет шанс подтвердить заведение нового пользователя или набрать kbd:[n] в качестве отрицательного ответа. Вам может захотеться создать второго нового пользователя, для того, чтобы при редактировании файлов для входа пользователя `jack` имелся горячий резерв на тот случай, если что-то пойдёт не так.

source: Once you have done this, use `exit` to get back to a login prompt and log in as `jack`. In general, it is a good idea to do as much work as possible as an ordinary user who does not have the power-and risk-of `root`.
pt_br: Depois de ter feito isso, use o comando `exit` para voltar ao prompt de login e faça login como `jack`. Em geral, é uma boa ideia fazer o máximo de trabalho possível como um usuário comum que não possui o poder - e o risco - de `root`.
ru: После того, как вы это сделаете, воспользуйтесь командой `exit` для возврата к приглашению ко входу в систему и зарегистрируйтесь в ней как пользователь `jack`. Вообще говоря, лучше всего основную массу работы выполнять, работая как обычный пользователь, который не имеет мощь и опасность пользователя `root`.

source: If you already created a user and you want the user to be able to `su` to `root`, you can log in as `root` and edit the file [.filename]#/etc/group#, adding `jack` to the first line (the group `wheel`). But first you need to practice man:vi[1], the text editor-or use the simpler text editor, man:ee[1], installed on recent versions of FreeBSD.
pt_br: Se você já criou um usuário e deseja que o usuário possa fazer `su` para `root`, faça login como `root` e edite o arquivo [.filename]#/etc/group#, adicionando `jack` à primeira linha (o grupo `wheel`). Mas primeiro, você precisa praticar o uso do editor de texto man:vi[1], ou usar um editor de texto mais simples, o man:ee[1], instalado em versões recentes do FreeBSD.
ru: Если вы уже создали пользователя и хотите, чтобы он мог выполнять команду `su` для получения привилегий `root`, вы можете войти в систему как `root` и отредактировать файл [.filename]#/etc/group#, добавив пользователя `jack` в первую строчку (в группу `wheel`). Однако сначала вам нужно поупражняться с программой man:vi[1], текстовым редактором,-или использовать более простой редактор, man:ee[1], имеющийся в последней версии FreeBSD.

source: To delete a user, use `rmuser`.
pt_br: Para excluir um usuário, use o comando `rmuser`.
ru: Для удаления пользователя воспользуйтесь командой `rmuser`.

source: Looking Around
pt_br: Explorando o Sistema
ru: Просмотр окружения

source: Logged in as an ordinary user, look around and try out some commands that will access the sources of help and information within FreeBSD.
pt_br: Conectado como um usuário comum, explore e experimente alguns comandos que acessarão as fontes de ajuda e informações dentro do FreeBSD.
ru: Войдя в систему как обычный пользователь, оглянитесь вокруг и попробуйте выполнить некоторые команды, дающие доступ к источникам информации и помощи внутри FreeBSD.

source: Here are some commands and what they do:
pt_br: Aqui estão alguns comandos e o que eles fazem:
ru: Вот некоторые команды и то, что они делают:

source: Tells you who you are!
pt_br: Diz quem você é!
ru: Говорит вам, кто вы!

source: Shows you where you are-the current working directory.
pt_br: Exibe o diretório de trabalho atual.
ru: Показывает, где вы находитесь-текущий рабочий каталог.

source: Lists the files in the current directory.
pt_br: Lista os arquivos presentes no diretório atual.
ru: Выдаёт список файлов, находящихся в текущем каталоге.

source: Lists the files in the current directory with a * after executables, a `/` after directories, and an `@` after symbolic links.
pt_br: Lista os arquivos no diretório atual com um * após os arquivos executáveis, uma `/` após os diretórios e um `@` após os links simbólicos.
ru: Выдаёт перечень файлов, находящихся в текущем каталоге, добавляя символы `\*` после выполнимых файлов, `/` после каталогов и `@` после символических ссылок.

source: Lists the files in long format-size, date, permissions.
pt_br: Lista os arquivos no diretório atual em formato longo, mostrando informações como tamanho, data e hora de modificação, permissões de arquivo e proprietário/grupo.
ru: Выдаёт перечень файлов в расширенном формате-размер, дата и права доступа.

source: Lists hidden "dot" files with the others. If you are `root`, the "dot" files show up without the `-a` switch.
pt_br: Lista todos os arquivos no diretório atual, incluindo arquivos ocultos (com ponto no início do nome). Se você estiver logado como `root`, os arquivos ocultos serão listados sem a necessidade do uso do parâmetro `-a`.
ru: Вместе со всеми выдаёт и список скрытых "dot"-файлов (начинающихся с точки). Если вы являетесь пользователем `root`, то "dot"-файлы выдаются и без указания флага `-a`.

source: Changes directories. `cd ..` backs up one level; note the space after `cd`. `cd /usr/local` goes there. `cd ~` goes to the home directory of the person logged in-e.g., [.filename]#/usr/home/jack#. Try `cd /cdrom`, and then `ls`, to find out if your CDROM is mounted and working.
pt_br: O comando `cd` é usado para mudar de diretório. `cd ..` volta um nível; observe o espaço após o `cd`. `cd /usr/local` navega até esse diretório. `cd ~` navega até o diretório home do usuário logado, por exemplo, [.filename]#/usr/home/jack#. Experimente o comando `cd /cdrom`, e em seguida `ls`, para descobrir se o seu CDROM está montado e funcionando.
ru: Смена каталогов. `cd ..` перемещает на один уровень выше; обратите внимание на промежуток после `cd`. `cd /usr/local` перейдёт в указанное место. `cd ~` перейдёт в домашний каталог человека, который вошёл в систему-к примеру, [.filename]#/usr/home/jack#. попробуйте выполнить команду `cd /cdrom`, а затем `ls` для проверки того, что ваш CDROM смонтирован и работает.

source: Lets you look at a file (named _filename_) without changing it. Try `less /etc/fstab`. Type `q` to quit.
pt_br: Permite visualizar o conteúdo de um arquivo (chamado _filename_) sem modificá-lo. Experimente o comando `less /etc/fstab`. Digite `q` para sair do modo de visualização.
ru: Позволяет вам просмотреть файл (с именем _filename_) без внесения в него изменений. Попробуйте выполнить команду `less /etc/fstab`. Для выхода наберите `q`.

source: Displays _filename_ on screen. If it is too long and you can see only the end of it, press kbd:[ScrollLock] and use the kbd:[up-arrow] to move backward; you can use kbd:[ScrollLock] with manual pages too. Press kbd:[ScrollLock] again to quit scrolling. You might want to try `cat` on some of the dot files in your home directory-`cat .cshrc`, `cat .login`, `cat .profile`.
pt_br: Exibe o conteúdo do arquivo _filename_ na tela. Se o arquivo for muito longo e você conseguir visualizar apenas o final, pressione kbd:[ScrollLock] e use a tecla de seta para cima (kbd:[up-arrow]) para rolar para trás. Você também pode usar kbd:[ScrollLock] com páginas de manual (man pages). Pressione kbd:[ScrollLock] novamente para sair do modo de rolagem. Você pode experimentar o comando `cat` em alguns dos arquivos ocultos em seu diretório home, por exemplo: `cat .cshrc`, `cat .login`, `cat .profile`.
ru: Выдаёт содержимое _filename_ на экран. если он слишком длинный и вы можете увидеть только его конец, нажмите kbd:[ScrollLock] и используйте клавишу kbd:[стрелка вверх] для движения назад; вы можете также использовать kbd:[ScrollLock] и со страницами справки. Нажмите kbd:[ScrollLock] снова для прекращения прокрутки. Вам может захотеться попробовать команду `cat` с некоторыми из dot-файлов в вашем домашнем каталоге-`cat .cshrc`, `cat .login`, `cat .profile`.

source: You will notice aliases in [.filename]#.cshrc# for some of the `ls` commands (they are very convenient). You can create other aliases by editing [.filename]#.cshrc#. You can make these aliases available to all users on the system by putting them in the system-wide `csh` configuration file, [.filename]#/etc/csh.cshrc#.
pt_br: Você notará que existem aliases no arquivo [.filename]#.cshrc# para alguns dos comandos `ls` (eles são muito convenientes). Você pode criar outros aliases editando o arquivo [.filename]#.cshrc#. Você pode tornar esses aliases disponíveis para todos os usuários do sistema colocando-os no arquivo de configuração global do `csh`, o [.filename]#/etc/csh.cshrc#.
ru: В файле [.filename]#.cshrc# вы заметите алиасы для некоторых из команд `ls` (они очень удобны). Вы можете создать другие алиасы, отредактировав файл [.filename]#.cshrc#. Вы можете сделать эти алиасы доступными всем пользователям системы, поместив их в общесистемный конфигурационный файл для `csh`, [.filename]#/etc/csh.cshrc#.

source: Getting Help and Information
pt_br: Obtendo ajuda e informações
ru: Получение помощи и информации

source: Here are some useful sources of help. _Text_ stands for something of your choice that you type in-usually a command or filename.
pt_br: Aqui estão algumas fontes úteis de ajuda. O termo _Text_ significa algo de sua escolha que você digita, geralmente um comando ou nome de arquivo.
ru: Вот несколько полезных источников получения помощи. Здесь _Text_ обозначает что-то по вашему выбору, что вы вводите-обычно команду или имя файла.

source: Everything containing string _text_ in the `whatis database`.
pt_br: Irá retornar todos os comandos e arquivos que contenham a palavra-chave especificada _text_ no `banco de dados whatis`.
ru: Всё, что содержит строку _text_ в `базе whatis`.

source: The manual page for _text_. The major source of documentation for UNIX(R) systems. `man ls` will tell you all the ways to use `ls`. Press kbd:[Enter] to move through text, kbd:[Ctrl+B] to go back a page, kbd:[Ctrl+F] to go forward, kbd:[q] or kbd:[Ctrl+C] to quit.
pt_br: A página de manual para _text_. A principal fonte de documentação para sistemas UNIX(R). `man ls` lhe dirá todas as maneiras de usar o comando`ls`. Pressione kbd:[Enter] para mover pelo texto, kbd:[Ctrl+B] para voltar uma página, kbd:[Ctrl+F] para avançar, kbd:[q] ou kbd:[Ctrl+C] para sair .
ru: Страница справки по _text_. Это главный источник документации в UNIX(R)-системах. `man ls` покажет вам все способы использования команды `ls`. Нажимайте kbd:[Enter] для передвижения по тексту, kbd:[Ctrl+B] для возврата на страницу назад, kbd:[Ctrl+F] для продвижения вперёд, kbd:[q] или kbd:[Ctrl+C] для выхода.

source: Tells you where in the user's path the command _text_ is found.
pt_br: Mostra o caminho completo para o executável do comando _text_ especificado.
ru: Покажет, в каком месте из маршрута поиска пользователя находится команда _text_.

source: All the paths where the string _text_ is found.
pt_br: Todos os caminhos onde a string _text_ é encontrada.
ru: Все маршруты, где находится строчка _text_.

source: Tells you what the command _text_ does and its manual page. Typing `whatis *` will tell you about all the binaries in the current directory.
pt_br: Informa o que o comando _text_ faz e sua página de manual. Digitando `whatis *` irá falar sobre todos os binários no diretório atual.
ru: Описывает, что делает команда _text_ и её справочная страница. Команда `whatis *` расскажет вам обо всех двоичных файлах в текущем каталоге.

source: Finds the file _text_, giving its full path.
pt_br: Localiza o arquivo _text_, fornecendo seu caminho completo.
ru: Ищет файл _text_ и выдаёт полный путь до него.

source: You might want to try using `whatis` on some common useful commands like `cat`, `more`, `grep`, `mv`, `find`, `tar`, `chmod`, `chown`, `date`, and `script`. `more` lets you read a page at a time as it does in DOS, e.g., `ls -l | more` or `more _filename_`. The * works as a wildcard-e.g., `ls w*` will show you files beginning with `w`.
pt_br: Você pode tentar usar `whatis` em alguns comandos úteis comuns como `cat`, `more`, `grep`, `mv`, `find`, `tar`, `chmod`, `chown`, `date` , e `script`. `more` permite que você leia uma página por vez como no DOS, por exemplo, `ls -l | more` ou `more _filename_`. O * funciona como um curinga, por exemplo, `ls w*` mostrará os arquivos que começam com `w`.
ru: Вы можете захотеть попробовать использоваться команду `whatis` с некоторыми полезными командами типа `cat`, `more`, `grep`, `mv`, `find`, `tar`, `chmod`, `chown`, `date`, и `script`. Команда `more` позволит вам читать постранично, как и в DOS, например, `ls -l | more` или `more _filename_`. Знак `\*` работает как общий шаблон-например, `ls w*` выдаст перечень файлов, начинающихся с буквы `w`.

source: Are some of these not working very well? Both man:locate[1] and man:whatis[1] depend on a database that is rebuilt weekly. If your machine is not going to be left on over the weekend (and running FreeBSD), you might want to run the commands for daily, weekly, and monthly maintenance now and then. Run them as `root` and, for now, give each one time to finish before you start the next one.
pt_br: Alguns deles não estão funcionando muito bem? Ambos man:locate[1] e man:whatis[1] dependem de um banco de dados que é reconstruído semanalmente. Se sua máquina não vai ficar ligada no fim de semana (e rodando o FreeBSD), você pode querer executar os comandos para manutenção diária, semanal e mensal de vez em quando. Execute-os como `root` e, por enquanto, dê a cada um tempo para terminar antes de iniciar o próximo.
ru: Некоторые из этих команд работают не очень хорошо? Обе команды man:locate[1] и man:whatis[1] зависят от базы данных, которая перестраивается еженедельно. Если ваша машина будет оставаться включенной на выходные (и она работает под FreeBSD), то вы можете пожелать запускать определённые команды раз в день, неделю, месяц. Запускайте их как `root` и дайте каждой отработать, прежде чем запускать следующую.

source: # periodic daily output omitted # periodic weekly output omitted # periodic monthly output omitted
pt_br: # periodic daily saída omitida # periodic weekly saída omitida # periodic monthly saída omitida

source: If you get tired of waiting, press kbd:[Alt+F2] to get another _virtual console_, and log in again. After all, it is a multi-user, multi-tasking system. Nevertheless these commands will probably flash messages on your screen while they are running; you can type `clear` at the prompt to clear the screen. Once they have run, you might want to look at [.filename]#/var/mail/root# and [.filename]#/var/log/messages#.
pt_br: Se você cansar de esperar, pressione kbd:[Alt+F2] para obter outro _virtual console_ e faça login novamente. Afinal, é um sistema multiusuário e multitarefa. No entanto, esses comandos provavelmente exibirão mensagens em sua tela enquanto estiverem sendo executados; você pode digitar `clear` no prompt para limpar a tela. Uma vez executados, você pode querer olhar para [.filename]#/var/mail/root# e [.filename]#/var/log/messages#.
ru: Если вам надоело ждать, нажмите kbd:[Alt+F2] для перехода в другую _виртуальную консоль_, и войдите в систему снова. В конце концов, это многопользовательская и многозадачная система. Тем не менее эти команды, скорее всего, в процессе работы будут выдавать сообщения вам на экран; вы можете набрать `clear` в приглашении для очистки экрана. Пока они работают, вы можете смотреть в содержимое файлов [.filename]#/var/mail/root# и [.filename]#/var/log/messages#.
