Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/new-users/_index.po
Languages: pt_br, ru

source: Running such commands is part of system administration-and as a single user of a UNIX(R) system, you are your own system administrator. Virtually everything you need to be `root` to do is system administration. Such responsibilities are not covered very well even in those big fat books on UNIX(R), which seem to devote a lot of space to pulling down menus in windows managers. You might want to get one of the two leading books on systems administration, either Evi Nemeth et.al.'s UNIX System Administration Handbook (Prentice-Hall, 1995, ISBN 0-13-15051-7)-the second edition with the red cover; or Æleen Frisch's Essential System Administration (O'Reilly & Associates, 2002, ISBN 0-596-00343-9). I used Nemeth.
pt_br: Executar esses comandos faz parte da administração do sistema - e como único usuário de um sistema UNIX(R), você é seu próprio administrador de sistema. Praticamente tudo o que você precisa fazer como `root` é administração do sistema. Essas responsabilidades não são bem cobertas, mesmo nos grandes e grossos livros sobre UNIX(R), que parecem dedicar muito espaço a abrir menus em gerenciadores de janelas. Se você deseja aprofundar seus conhecimentos em administração de sistemas, pode ser útil obter um dos dois principais livros sobre o assunto. Os dois livros recomendados são "UNIX System Administration Handbook" de Evi Nemeth et al. (Prentice-Hall, 1995, ISBN 0-13-15051-7) - a segunda edição com a capa vermelha; ou "Essential System Administration" de Æleen Frisch (O'Reilly & Associates, 2002, ISBN 0-596-00343-9). Ambos os livros são excelentes recursos para administradores de sistemas e fornecem informações detalhadas sobre administração de sistemas UNIX(R). Eu usei o livro da Nemeth.
ru: Выполнение таких команд является частью системного администрирования-и как единственный пользователь UNIX(R)-системы вы являетесь собственным системным администратором. Практически всё, для чего вам нужно быть пользователем `root`, это системное администрирование. Эти обязанности не описываются достаточно хорошо даже в тех больших толстых книгах по UNIX(R), в которых слишком много места отдаётся описанию работы с меню в оконных менеджерах. Вам может понадобиться одна из двух лучших книг по системному администрированию, либо автора Эви Немет UNIX System Administration Handbook (Prentice-Hall, 1995, ISBN 0-13-15051-7)-второе издание с красной обложкой; или автора Æleen Frisch Essential System Administration (O'Reilly & Associates, 2002, ISBN 0-596-00343-9). Я использую книгу Немет.

source: Editing Text
pt_br: Editando textos
ru: Редактирование текста

source: To configure your system, you need to edit text files. Most of them will be in the [.filename]#/etc# directory; and you will need to `su` to `root` to be able to change them. You can use the easy `ee`, but in the long run the text editor `vi` is worth learning. There is an excellent tutorial on vi in [.filename]#/usr/src/contrib/nvi/docs/tutorial#, if you have the system sources installed.
pt_br: Para configurar o sistema, você precisa editar arquivos de texto. A maioria deles estará no diretório [.filename]#/etc#, e você precisará usar o comando `su` para se tornar `root` e poder alterá-los. Você pode usar o editor de texto `ee` para edição mais simples, mas a longo prazo, vale a pena aprender o editor de texto `vi`. Há um excelente tutorial sobre o vi em [.filename]#/usr/src/contrib/nvi/docs/tutorial#, se você tiver as fontes do sistema instaladas.
ru: Для конфигурации вашей системы вам нужно редактировать текстовые файлы. Большинство из них будут находиться в каталоге [.filename]#/etc#; и вам необходимо командой `su` получить полномочия пользователя `root`, чтобы их править. Вы можете использовать простой редактор `ee`, однако в смысле перспективности лучше изучить текстовый редактор `vi`. В каталоге [.filename]#/usr/src/contrib/nvi/docs/tutorial# есть прекрасный учебник по vi, если у вас есть исходники системы.

source: Before you edit a file, you should probably back it up. Suppose you want to edit [.filename]#/etc/rc.conf#. You could just use `cd /etc` to get to the [.filename]#/etc# directory and do:
pt_br: Antes de editar um arquivo, é recomendável fazer backup dele. Suponha que você deseje editar o arquivo [.filename]#/etc/rc.conf#. Você pode simplesmente usar o comando `cd /etc` para ir para o diretório [.filename]#/etc# e executar o seguinte comando:
ru: Перед тем, как редактировать файл, наверное, вы должны сохранить резервную копию. Предположим, что вы собираетесь отредактировать файл [.filename]#/etc/rc.conf#. Вы можете воспользоваться командой `cd /etc` для перехода в каталог [.filename]#/etc# и выполнить следующее:

source: This would copy [.filename]#rc.conf# to [.filename]#rc.conf.orig#, and you could later copy [.filename]#rc.conf.orig# to [.filename]#rc.conf# to recover the original. But even better would be moving (renaming) and then copying back:
pt_br: Isso copiaria o arquivo [.filename]#rc.conf# para [.filename]#rc.conf.orig#, e posteriormente você poderia copiar [.filename]#rc.conf.orig# de volta para [.filename]#rc.conf# para recuperar o original. Mas uma opção ainda melhor seria mover (renomear) e depois copiar de volta:
ru: При этом файл [.filename]#rc.conf# скопируется в [.filename]#rc.conf.orig#, и в последующем вы сможете скопировать [.filename]#rc.conf.orig# в файл [.filename]#rc.conf# для восстановления оригинала. Но ещё лучше его переместить (переименовать), после чего скопировать обратно:

source: because `mv` preserves the original date and owner of the file. You can now edit [.filename]#rc.conf#. If you want the original back, you would then `mv rc.conf rc.conf.myedit` (assuming you want to preserve your edited version) and then
pt_br: porque o comando `mv` preserva a data e o proprietário original do arquivo. Agora você pode editar o arquivo [.filename]#rc.conf#. Se quiser recuperar o original, você pode executar o comando `mv rc.conf rc.conf.myedit` (assumindo que você deseja preservar a versão editada) e depois executar o seguinte comando
ru: потому что команда `mv` сохраняет исходную информацию о дате и владельце файла. Теперь вы можете редактировать [.filename]#rc.conf#. Если вы захотите восстановить исходное состояние, то выполните `mv rc.conf rc.conf.myedit` (полагаем, что вы хотите сохранить отредактированную версию), а затем

source: to put things back the way they were.
pt_br: para colocar as coisas de volta da maneira que estavam.
ru: для возврата всего на место.

source: To edit a file, type
pt_br: Para editar um arquivo, digite
ru: Для редактирования файла наберите

source: Move through the text with the arrow keys. kbd:[Esc] (the escape key) puts `vi` in command mode. Here are some commands:
pt_br: Para mover-se pelo texto, use as teclas de seta. Pressione kbd:[Esc] (a tecla de escape) para entrar no modo de comando do `vi`. Aqui estão alguns comandos:
ru: Передвигайтесь по тексту при помощи клавиш со стрелками. kbd:[Esc] (клавиша отмены) переводит редактор `vi` в командный режим. Вот некоторые из них:

source: delete letter the cursor is on
pt_br: deleta a letra localizada onde o cursor está
ru: удалить символ, на котором находится курсор

source: delete the entire line (even if it wraps on the screen)
pt_br: Apaga a linha inteira (mesmo se ela estiver aparecendo quebrada na tela em varias linhas)
ru: удалить целую строку (даже если на экране она не помещается в целую строку)

source: insert text at the cursor
pt_br: Insere um texto na posição do cursor
ru: вставка текста в позиции курсора

source: insert text after the cursor
pt_br: Insere um texto após a posição do cursor
ru: вставка текста после курсора

source: Once you type `i` or `a`, you can enter text. `Esc` puts you back in command mode where you can type
pt_br: Depois de digitar `i` ou `a`, você pode inserir texto. `Esc` coloca você de volta no modo de comando onde você pode digitar
ru: Сразу после набора `i` или `a` вы можете вводить текст. `Esc` возвратит вас обратно в командный режим, где вы можете набрать

source: to write your changes to disk and continue editing
pt_br: para gravar suas alterações no disco e continuar editando
ru: для записи ваших изменений на диск и продолжения редактирования

source: to write and quit
pt_br: para gravar e sair
ru: для записи и выхода

source: to quit without saving changes
pt_br: para sair do arquivo sem salvar as alterações
ru: для выхода без сохранения изменений

source: to move the cursor to _text_; `/` kbd:[Enter] (the enter key) to find the next instance of _text_.
pt_br: para mover o cursor para _text_; `/` kbd:[Enter] (a tecla enter) para encontrar a próxima ocorrência de _text_.
ru: для перемещения курсора на _text_; `/` kbd:[Enter] (клавиша ввода) для поиска следующего экземпляра _text_.

source: to go to the end of the file
pt_br: para ir para o final do arquivo
ru: для перехода в конец файла

source: to go to line _n_ in the file, where _n_ is a number
pt_br: para ir para a linha _n_ no arquivo, onde _n_ é um número
ru: Для перехода к строке _n_ в файле, где _n_ является числом

source: to redraw the screen
pt_br: para redesenhar a tela
ru: для перерисовки экрана

source: go back and forward a screen, as they do with `more` and `view`.
pt_br: para voltar e avançar uma tela, como fazem o `more` e o `view`.
ru: для перелистывания экрана вперед и назад, как это делается в `more` и `view`.

source: Practice with `vi` in your home directory by creating a new file with `vi _filename_` and adding and deleting text, saving the file, and calling it up again. `vi` delivers some surprises because it is really quite complex, and sometimes you will inadvertently issue a command that will do something you do not expect. (Some people actually like `vi`-it is more powerful than DOS EDIT-find out about `:r`.) Use kbd:[Esc] one or more times to be sure you are in command mode and proceed from there when it gives you trouble, save often with `:w`, and use `:q!` to get out and start over (from your last `:w`) when you need to.
pt_br: Pratique com `vi` no seu diretório pessoal, criando um novo arquivo com o comando `vi _nome_do_arquivo_ , adicionando e excluindo texto, salvando o arquivo e chamando-o novamente. O `vi` oferece algumas surpresas porque é realmente bastante complexo e às vezes você inadvertidamente emite um comando que fará algo que você não espera. (Algumas pessoas realmente gostam do `vi` - é mais poderoso que o EDIT do DOS - descubra sobre o `:r`.) Use kbd:[Esc] uma ou mais vezes para ter certeza de que está no modo de comando e prossiga a partir daí quando ele lhe der problemas, salve frequentemente com `:w` e use `:q!` para sair e começar de novo (a partir do último `:w`) quando precisar.
ru: Поупражняйтесь с редактором `vi` в своём домашнем каталоге, создав новый файл по команде `vi _filename_`, добавляя и удаляя текст, сохраняя файл и вызывая его снова. Редактор `vi` преподносит некоторые сюрпризы, потому что он на самом деле достаточно сложный, и иногда вы можете неправильно вызвать команду, которая сделает нечто, чего вы не ожидали. (Некоторым людям действительно нравится `vi`-он более мощный, чем EDIT из DOS-посмотрите команду `:r`.) Для того, чтобы удостовериться, что вы находитесь в режиме команд, нажимайте kbd:[Esc] один или несколько раз, и начинайте снова с этого места, если возникли какие-то проблемы, часто сохраняйте текст командой `:w` и используйте `:q!` для того, чтобы прекратить работу и начать всё сначала (с вашей последней команды `:w`), если это нужно.

source: Now you can `cd` to [.filename]#/etc#, `su` to `root`, use `vi` to edit the file [.filename]#/etc/group#, and add a user to `wheel` so the user has root privileges. Just add a comma and the user's login name to the end of the first line in the file, press kbd:[Esc], and use `:wq` to write the file to disk and quit. Instantly effective. (You did not put a space after the comma, did you?)
pt_br: Agora você pode fazer `cd` para [.filename]#/etc#, `su` para `root`, usar `vi` para editar o arquivo [.filename]#/etc/group# e adicionar um usuário ao grupo `wheel ` para que ele tenha privilégios de root. Basta adicionar uma vírgula e o nome de login do usuário ao final da primeira linha do arquivo, pressionar kbd:[Esc] e usar `:wq` para gravar o arquivo no disco e sair. Instantaneamente eficaz. (Você não colocou um espaço após a vírgula, colocou?)
ru: Теперь вы можете выполнить `cd` для перехода в каталог [.filename]#/etc#, `su` в пользователя `root`, использовать `vi` для редактирования файла [.filename]#/etc/group# и добавлять пользователя в группу `wheel`, чтобы он имел полномочия пользователя root. Просто добавьте запятую и имя входа пользователя в конце первой строки этого файла, нажмите kbd:[Esc] и воспользуйтесь `:wq` для записи файла на диск и выхода. Работает всегда. (Вы не поставили пробел после запятой, ведь так?)

source: Other Useful Commands
pt_br: Outros comandos úteis
ru: Другие полезные команды

source: shows file space and mounted systems.
pt_br: mostra o espaço dos sistemas de arquivos que estão montados.
ru: выдаёт данные о занятом файлами пространстве и смонтированных файловых системах.

source: shows processes running. `ps ax` is a narrower form.
pt_br: Mostra os processos em execução. ps ax é uma forma mais simplificada.
ru: показывает работающие процессы. `ps ax` является частоупотребительной формой.

source: remove _filename_.
pt_br: remove o arquivo _filename_.
ru: удаляет _filename_.

source: removes a directory _dir_ and all subdirectories-careful!
pt_br: remove um diretório _dir_ e todos os subdiretórios - use com cuidado!
ru: удаляет каталог _dir_ и все его подкаталоги-осторожно!

source: lists files in the current directory and all subdirectories; I used a variant, `ls -AFR > where.txt`, to get a list of all the files in [.filename]#/# and (separately) [.filename]#/usr# before I found better ways to find files.
pt_br: lista arquivos no diretório atual e todos os subdiretórios; Usei uma variante, `ls -AFR > where.txt`, para obter uma lista de todos os arquivos em [.filename]#/# e (separadamente) [.filename]#/usr# antes de encontrar maneiras melhores de encontrar arquivos.
ru: выдаёт список файлов в текущем каталоге и всех его подкаталогах; я использовал вариант, `ls -AFR > where.txt`, для получения перечня всех файлов в [.filename]#/# и (отдельно) [.filename]#/usr# до того, как узнал о более эффективном способе поиска файлов.

source: to change user's password (or ``root``'s password)
pt_br: para alterar a senha do usuário (ou a senha do ``root``)
ru: для изменения пароля пользователя (или пароля `root`)

source: manual page on the UNIX(R) filesystem
pt_br: página de manual no sistema de arquivos UNIX(R)
ru: справочная страница по файловой структуре UNIX(R)

source: Use `find` to locate [.filename]#filename# in [.filename]#/usr# or any of its subdirectories with
pt_br: Use o `find` para localizar o arquivo [.filename]#filename# em [.filename]#/usr# ou qualquer um de seus subdiretórios com
ru: Используйте `find` для поиска [.filename]#filename# в [.filename]#/usr# или в любом из её подкаталогов при помощи команды

source: You can use * as a wildcard in `"_filename_"` (which should be in quotes). If you tell `find` to search in [.filename]#/# instead of [.filename]#/usr# it will look for the file(s) on all mounted filesystems, including the CDROM and the DOS partition.
pt_br: Você pode usar * como curinga em `"_filename_"` (que deve estar entre aspas). Se você disser ao `find` para procurar em [.filename]#/# ao invés de [.filename]#/usr# ele irá procurar o(s) arquivo(s) em todos os sistemas de arquivos montados, incluindo o CD-ROM e a partição DOS.
ru: Вы можете использовать `\*` в качестве шаблона внутри `"_filename_"` (это выражение должно быть в кавычках). Если вы укажете команде `find` на поиск в [.filename]#/#, а не в [.filename]#/usr#, то она будет искать файл(ы) во всех смонтированных файловых системах, включая CDROM и раздел DOS.

source: An excellent book that explains UNIX(R) commands and utilities is Abrahams & Larson, Unix for the Impatient (2nd ed., Addison-Wesley, 1996). There is also a lot of UNIX(R) information on the Internet.
pt_br: Um livro excelente que explica os comandos e utilitários do UNIX(R) é Abrahams & Larson, Unix for the Impacient (2ª ed., Addison-Wesley, 1996). Também há muitas informações sobre o UNIX(R) na Internet.
ru: Прекрасным пособием, описывающим команды и утилиты UNIX(R), является книга Abrahams & Larson, Unix for the Impatient (2nd ed., Addison-Wesley, 1996). Масса информации по UNIX(R) есть и в Internet.

source: Next Steps
pt_br: Próximos Passos
ru: Следующие шаги

source: You should now have the tools you need to get around and edit files, so you can get everything up and running. There is a great deal of information in the FreeBSD handbook (which is probably on your hard drive) and link:https://www.FreeBSD.org/[FreeBSD's web site]. A wide variety of packages and ports are on the CDROM as well as the web site. The handbook tells you more about how to use them (get the package if it exists, with `pkg add _packagename_`, where _packagename_ is the filename of the package). The CDROM has lists of the packages and ports with brief descriptions in [.filename]#cdrom/packages/index#, [.filename]#cdrom/packages/index.txt#, and [.filename]#cdrom/ports/index#, with fuller descriptions in [.filename]#/cdrom/ports/\*/*/pkg/DESCR#, where the *s represent subdirectories of kinds of programs and program names respectively.
pt_br: Você agora deve ter as ferramentas necessárias para navegar e editar arquivos, para que possa colocar tudo em funcionamento. Existe uma grande quantidade de informações no Handbook do FreeBSD (que provavelmente está no seu disco rígido) e no site do link:https://www.FreeBSD.org/[FreeBSD]. Uma ampla variedade de pacotes e ports estão no CDROM, bem como no site. O Handbook explica mais sobre como usá-los (obtenha o pacote se existir, com `pkg add _nomedopacote_`, onde nomedopacote é o nome do arquivo do pacote). O CDROM contém listas dos pacotes e ports com breves descrições em [.filename]#cdrom/packages/index#, [.filename]#cdrom/packages/index.txt#, e [.filename]#cdrom/ports/index#, e com descrições mais detalhadas em [.filename]#/cdrom/ports/\*/*/pkg/DESCR#, onde os *s representam subdiretórios de tipos de programas e nomes de programas, respectivamente.
ru: Теперь вы должны иметь инструменты, которые необходимо держать под рукой и умеете редактировать файлы, так что вы должны суметь запустить всё, что угодно. Много полезной информации содержится в Руководстве по FreeBSD (которое, скорее всего, есть на вашем жёстком диске) и link:https://www.FreeBSD.org/[Web-сайте FreeBSD]. На CDROM, а также Web-сайте находятся различные пакеты и порты. В Руководстве рассказывается более подробно о том, как их использовать (получить пакет, если он существует, командой `pkg_add /cdrom/packages/All/_packagename_`, где _packagename_ является именем файла пакета). На CDROM находится перечни пакетов и портов с их краткими описаниями в файлах [.filename]#cdrom/packages/index#, [.filename]#cdrom/packages/index.txt# и [.filename]#cdrom/ports/index#, а более полные описания можно найти в [.filename]#/cdrom/ports/\*/*/pkg/DESCR#, где знаки `*` обозначают тематические подкаталоги с программами и названиями программ, соответственно.

source: If you find the handbook too sophisticated (what with `lndir` and all) on installing ports from the CDROM, here is what usually works:
pt_br: Se você achar o handbook muito sofisticado (com isso do `lndir` e tudo mais) ao instalar os ports do CDROM, veja a seguir o que geralmente funciona:
ru: Если вы посчитаете, что Руководство является слишком сложной книгой (что с `lndir` и всё) по установке портов с CDROM, вот рецепт, который обычно срабатывает:

source: Find the port you want, say `kermit`. There will be a directory for it on the CDROM. Copy the subdirectory to [.filename]#/usr/local# (a good place for software you add that should be available to all users) with:
pt_br: Encontre o port que você deseja, digamos o `kermit`. Haverá um diretório para ele no CDROM. Copie o subdiretório para [.filename]#/usr/local# (este é um bom lugar para softwares que você adiciona no sistema e que devem estar disponíveis para todos os usuários) com:
ru: Найдите нужный вам порт, скажем, `kermit`. На CDROM для него должен существовать каталог. Скопируйте этот подкаталог в каталог [.filename]#/usr/local# (хорошее место для программного обеспечения, которое вы добавляете, и которое должно быть доступно всем пользователям) такой командой:

source: This should result in a [.filename]#/usr/local/kermit# subdirectory that has all the files that the `kermit` subdirectory on the CDROM has.
pt_br: Isso deve resultar em um subdiretório [.filename]#/usr/local/kermit# que contém todos os arquivos que o subdiretório `kermit` no CD-ROM possui.
ru: В результате должен образоваться подкаталог [.filename]#/usr/local/kermit#, содержащий все файлы, что есть в подкаталоге `kermit` на CDROM.

source: Next, create the directory [.filename]#/usr/ports/distfiles# if it does not already exist using `mkdir`. Now check [.filename]#/cdrom/ports/distfiles# for a file with a name that indicates it is the port you want. Copy that file to [.filename]#/usr/ports/distfiles#; in recent versions you can skip this step, as FreeBSD will do it for you. In the case of `kermit`, there is no distfile.
pt_br: Em seguida, crie o diretório [.filename]#/usr/ports/distfiles# se ele ainda não existir usando o comando `mkdir`. Agora verifique o [.filename]#/cdrom/ports/distfiles# para localizar um arquivo com um nome que indique que é o port que você deseja. Copie esse arquivo para [.filename]#/usr/ports/distfiles#; nas versões recentes, você pode pular esta etapa, pois o FreeBSD fará isso por você. No caso de `kermit`, não há distfile.
ru: Затем создайте каталог [.filename]#/usr/ports/distfiles#, если он ещё не существует, при помощи команды `mkdir`. Теперь проверьте содержимое [.filename]#/cdrom/ports/distfiles# на предмет наличия файла с именем, говорящем о том, что это тот порт, который вы хотите иметь. Скопируйте этот файл в каталог [.filename]#/usr/ports/distfiles#; в последних версиях вы можете пропустить этот шаг, и FreeBSD выполнит его за вас. В случае с `kermit`, дистрибутивного файла не существует.

source: Then `cd` to the subdirectory of [.filename]#/usr/local/kermit# that has the file [.filename]#Makefile#. Type
pt_br: Então utilize o `cd` para ir para o subdiretório [.filename]#/usr/local/kermit# que contém o arquivo [.filename]#Makefile#. E execute
ru: После этого по команде `cd` перейдите в подкаталог [.filename]#/usr/local/kermit#, в котором есть файл [.filename]#Makefile#. Наберите
