<!-- $FreeBSD$ -->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN">
%freebsd;

]>

<article lang=es>
  <articleinfo>
    <title>Unidades ZIP</title>

    <authorgroup>
      <author>
	<firstname>Jason</firstname>
	<surname>Bacon</surname>

	<affiliation>
	  <address><email>acadix@execpc.com</email></address>
	</affiliation>
      </author>
    </authorgroup>
  </articleinfo>

  <sect1>
    <title>Introducci&oacute;n a las Unidades ZIP</title>

    <para>Los discos ZIP son dispositivos magn&eacute;ticos, 
      extra&iacute;bles y de alta capacidad que pueden leerse y 
      escribirse mediante unidades ZIP de IOMEGA. Los discos ZIP son 
      similares a los disquetes (floppy) pero son mucho m&aacute;s 
      r&aacute;pidos y ofrecen una capacidad de almacenamiento mucho 
      mayor.  As&iacute; como los disquetes suelen ser de 1'44 MB los 
      discos ZIP existen en dos tama&ntilde;os, de 100 y 250 MB.  Los 
      discos ZIP no deben ser confundidos con el formato super-floppy, 
      un dispositivo que usa disquetes de 120 MB pero que admite los 
      discos tradicionales de 1'44 MB.</para>  

    <para>IOMEGA distribuye as&iacute;mismo unidades de rendimiento 
      m&aacute;s alto y mucha mayor capacidad llamadas JAZZ.  Las 
      unidades JAZZ usan discos de 1 y 2 GB.</para>

    <para>Las unidades ZIP est&aacute;n disponibles como dispositivos 
      internos y externos y emplean una de los siguientes 
      interfaces:</para>

    <orderedlist>
      <listitem>
        <para>El interfaz SCSI es el m&aacute;s r&aacute;pido, sofisticado, 
          expandible y caro.  El interfaz SCSI se usa en todo tipo de 
          plataformas, desde PC y estaciones RISC a miniordenadores para 
          conectar todo tipo de perif&eacute;ricos como discos duros, 
          unidades de cinta, scanners, etc.  Los dispositivos ZIP SCSI pueden 
          ser internos o externos, que requieren que la controladora SCSI 
          disponga de un conector externo.</para>

	<note>
          <para>Si usa una unidad SCSI externa es importante que nunca 
            la conecte o desconecte del bus SCSI mientras el ordenador 
            est&aacute; funcionando.  Si lo hace puede causar da&ntilde;os 
            en el sistema de ficheros del resto de los discos del 
            sistema.</para>
	</note>

        <para>Si lo que busca es el m&aacute;ximo rendimiento y una 
          sencilla configuraci&oacute;n el interfaz SCSI es la mejor 
          elecci&oacute;n.  Probablemente tendr&aacute; que 
          a&ntilde;adir una controladora SCSI dado que la mayor&iacute;a 
          de los PC (salvo los servidores de alto rendimiento) no 
          ofrecen soporte SCSI integrado.  Cada controladora SCSI puede 
          admitir entre 7 y 15 dispositivos SCSI dependiendo del 
          modelo.</para>

        <para>Cada unidad SCSI tiene su propio controlador y 
          esos controladores son razonablemente inteligentes y  
          est&aacute;n bien estandarizados (la segunda S de SCSI 
          viene de Standard), de manera que desde el punto de vista 
          del sistema operativo, todos los dispositivos SCSI parecen 
          ser el mismo, como sucede con las unidades de cinta 
          SCSI, etc.  Para poder utilizar dispositivos SCSI el 
          sistema operativo necesita &uacute;nicamente un 
          <quote>driver</quote> espec&iacute;fico para la controladora 
          que se desea usar y un <quote>driver</quote> gen&eacute;rico 
          para cada tipo de dispositivo, &eacute;sto es, un disco SCSI, 
          una unidad de cinta SCSI, etc.  Algunos dispositivos SCSI pueden 
          ser mejor aprovechados mediante <quote>drivers</quote> 
          especializados (v.g. unidades de cinta DAT) pero tienden a 
          funcionar perfectamente con los <quote>drivers</quote> 
          gen&eacute;ricos, que sencillamente puede que no incluyan alguna 
          de las caracter&iacute;sticas especiales.</para>

        <para>El usar una unidad ZIP SCSI es algo tan simple como determinar 
          cu&aacute;l es el fichero de dispositivo en el directorio 
	  <filename>/dev</filename> que representa la unidad 
          ZIP.  Esto puede saberse examinando el mensaje de arranque 
          de FreeBSD (o en <filename>/var/log/messages</filename> tras 
          el arranque), donde deber&iacute;a encontrar algo parecido 
          a:</para>

	<programlisting>da1: &lt;IOMEGA ZIP 100 D.13&gt; Removable Direct Access SCSI-2 Device</programlisting>

        <para>Esto significa que la unidad ZIP est&aacute; representada por 
           el fichero <filename>/dev/da1</filename>.</para>
      </listitem>

      <listitem>
        <para>El interfaz IDE es un interfaz de acceso a discos duros de 
          bajo coste que se usa en la mayor&iacute;a de los PC de 
          escritorio.  La mayor&iacute;a de los dispositivos IDE son 
          exclusivamente internos.</para>

        <para>El rendimiento de los dispositivos ZIP IDE es comparable al 
          de los ZIP SCSI.  (El interfaz IDE no es tan r&aacute;pido como el 
          SCSI pero el rendimiento de los dispositivos ZIP est&aacute;
          condicionado principalmente por la parte mec&aacute;nica del 
          dispositivo, no por el interfaz del bus).</para>

        <para>El inconveniente del interfaz IDE son las limitaciones que 
          conlleva.  La mayor&iacute;a de adaptadores IDE s&oacute;lo 
          permiten utilizar dos dispositivos y generalmente los interfaces 
          IDE no est&aacute;n dise&ntilde;ados para perpetuarse en el 
          tiempo.  Por ejemplo, el interfaz IDE original no admite 
          discos duros con m&aacute;s de 1.024 cilindros, lo que 
          oblig&oacute; a mucha gente a actualizar su hardware antes de lo 
          esperado.  Si prev&eacute; a&ntilde;adir nuevo hardware a su PC  
          (otro disco duro, una unidad de cinta, un scanner, etc.) no 
          estar&iacute;a de m&aacute;s que considerara la idea de adquirir
          una controladora y un ZIP SCSI para evitar problemas en el 
          futuro.</para> 

        <para>En FreeBSD los dispositivos IDE llevan el prefijo 
          <literal>a</literal>.  Por ejemplo, un disco duro IDE 
          podr&iacute;a ser 
	  <filename>/dev/ad0</filename>, y un CDROM IDE (ATAPI) 
          podr&iacute;a ser 
	  <filename>/dev/acd1</filename>, y as&iacute; sucesivamente.</para>
      </listitem>

      <listitem>
        <para>El interfaz de puerto paralelo es muy com&uacute;n en 
          dispositivos externos port&aacute;tiles como dispositivos 
          ZIP externos y scanners debido a que virtualmente todos los 
          ordenadores disponen de un puerto paralelo est&aacute;ndar 
          (que generalmente se usa con impresoras).  De &eacute;ste modo 
          se le facilitan las cosas a mucha gente a la hora de transferir 
          datos entre distintos equipos.</para> 

        <para>Generalmente el rendimiento es menor que el de dispositivos 
          ZIP IDE o SCSI dadas las limitaciones de velocidad del puerto 
          paralelo.  &Eacute;sta puede variar seg&uacute;n el caso concreto 
          y con frecuencia puede configurarse en la BIOS del 
          sistema.  En algunos casos es imprescindible configurar en la 
          BIOS el puerto paralelo para que admita el modo bidireccional 
          puesto que los puertos paralelos fueron originalmente concebidos 
          para verter su salida hacia las impresoras.</para> 
      </listitem>
    </orderedlist>
  </sect1>

  <sect1>
    <title>ZIP de Puerto Paralelo: El <quote>driver</quote> <devicename>vpo
      </devicename></title>

    <para>Para usar en FreeBSD un dispositivo ZIP de puerto paralelo debe 
      inclu&iacute;rse en el kernel el <quote>driver</quote> <devicename>vpo
      </devicename>.  Los 
      dispositivos ZIP de puerto paralelo disponen de un controlador SCSI 
      integrado.  El <quote>driver</quote> vpo permite al kernel de FreeBSD 
      comunicarse con el controlador SCSI del dispositivo ZIP a trav&eacute;s 
      del puerto paralelo.</para> 

    <para>Dado que el <quote>driver</quote> vpo no forma parte del kernel 
      GENERIC (el kernel que se instala con FreeBSD) a partir de FreeBSD 3.2  
      necesita recompilar su kernel para activar &eacute;ste 
      dispositivo.  Una de las maneras de recompilar el kernel se detalla 
      m&aacute;s adelante en &eacute;ste mismo texto.  Los pasos a seguir 
      para activar el <quote>driver</quote> vpo podr&iacute;an ser los 
      siguientes:</para>

    <orderedlist>
      <listitem>
        <para>Ejecute <command>/stand/sysinstall</command> e instale los 
          fuentes del kernel en su sistema.</para>
      </listitem>

      <listitem>
        <para>Crearemos un fichero de configuraci&oacute;n del kernel 
          que incluya el <quote>driver</quote> vpo:</para>

	<screen>&prompt.root; <userinput>cd /sys/i386/conf</userinput>
&prompt.root; <userinput>cp GENERIC MIKERNEL</userinput></screen>

        <para>Editamos <filename>MIKERNEL</filename> para sustitu&iacute;r 
          la entrada <literal>ident</literal> por <literal>MIKERNEL</literal> 
          y descomentamos la l&iacute;nea en la que aparece el <quote>driver 
          </quote>vpo.</para> 

        <para>Si dispone de un segundo puerto paralelo deber&aacute; 
          copiar la secci&oacute;n <literal>ppc0</literal> para crear 
          el dispositivo <literal>ppc1</literal>.  El segundo puerto 
          paralelo suele usar la IRQ 5 y la direcci&oacute;n 
          378.  Solamente es imprescindible asignar la IRQ en 
          el fichero de configuraci&oacute;n.</para>

        <para>Si su disco duro principal es SCSI puede tener problemas 
          durante la prueba de dispositivos SCSI que FreeBSD efect&uacute;a 
          en el arranque, dado que el sistema puede intentar utilizar el 
          dispositivo ZIP como disco de inicio.  Esto producir&iacute;a un 
          fallo en el arranque salvo, claro est&aacute;, que disponga de 
          un sistema de ficheros ra&iacute;z en su disco ZIP.  Si ese es 
          su caso debe forzar al kernel a enlazar un dispositivo concreto 
          (en &eacute;ste caso su disco duro ra&iacute;z) con 
          <filename>/dev/da0/</filename>. El kernel asignar&aacute; al 
          disco ZIP el siguiente nombre SCSI disponible, es decir, 
          <literal>/dev/da1</literal>.  Para fijar su disco duro SCSI como 
          <literal>da0</literal> cambie la l&iacute;nea
 
	  <programlisting>device  da0</programlisting>

	  a 

	  <programlisting>disk da0 at scbus0 target 0 unit 0</programlisting></para>

        <para>Quiz&aacute;s necesite modificar la l&iacute;nea anterior para 
          que concuerde con los datos de su dispositivo SCSI.  Del mismo modo 
          tendr&iacute;a que asociar la entrada scbus0 con su controladora.  
          Por ejemplo, si tiene una controladora Adaptec 15xx deber&iacute;a 
          cambiar 

	  <programlisting>controller scbus0</programlisting>

	  por 

	  <programlisting>controller scbus0 at aha0</programlisting></para>

        <para>Para conclu&iacute;r, dado que est&aacute; creando un kernel 
          personalizado deber&iacute;a aprovechar la ocasi&oacute;n para 
          eliminar todos los <quote>drivers</quote> que no necesita.  Esto 
          debe hacerse con precauci&oacute;n y solamente cuando tenga 
          la seguridad de que sabe lo que est&aacute; haciendo con su fichero 
          de configuraci&oacute;n.  Si borra los <quote>drivers</quote> que 
          no necesita reducir&aacute; el tama&ntilde;o de su kernel y por 
          lo tanto dispondr&aacute; de m&aacute;s memoria que ofrecer a sus 
          aplicaciones.  Para saber qu&eacute; <quote>drivers</quote> puede 
          borrar vaya al final del fichero <filename>/var/log/messages
          </filename> y busque l&iacute;neas que incluyan <literal>not
           found</literal> (no encontrado).  Comente las l&iacute;neas de 
          esos <quote>drivers</quote> en su fichero de 
          configuraci&oacute;n. Puede cambiar otras opciones m&aacute;s 
          para reducir el tama&ntilde;o e incrementar la velocidad de su 
          kernel. Lea la secci&oacute;n del Handbook correspondiente a la 
          recompilaci&oacute;n del kernel para conocer todos los 
          detalles.</para>
      </listitem>

      <listitem>
        <para>Ha llegado el momento de compilar nuestro kernel:</para>

	<screen>&prompt.root; <userinput>/usr/sbin/config MIKERNEL</userinput>
&prompt.root; <userinput>cd ../../compile/MIKERNEL</userinput>
&prompt.root; <userinput>make clean depend && make all install</userinput></screen>
      </listitem>
    </orderedlist>

    <para>Una vez finalizado el proceso necesitar&aacute; 
      reiniciar.  Aseg&uacute;rese de que la unidad ZIP est&eacute; conectada 
      al puerto paralelo antes del arranque.  Ver&aacute; aparecer el 
      dispositivo ZIP en los mensajes del arranque como vpo0 o vpo1, 
      dependiendo del puerto paralelo al que est&eacute; 
      conectado.  Deber&iacute;a aparecer tambi&eacute;n a qu&eacute; 
      nombre de dispositivo ha sido enlazado.  Por ejemplo 
      ser&iacute;a <filename>/dev/da0</filename> si no hay en el sistema 
      discos SCSI o <filename>/dev/da1</filename> si tiene como dispositivo 
      principal un disco SCSI.</para>
  </sect1>

  <sect1>
    <title>C&oacute;mo montar discos ZIP</title>

    <para>Para acceder a un disco ZIP simplemente hay que montarlo como 
      cualquier otro dispositivo de disco.  El sistema de ficheros 
      estar&aacute; representado como <quote>slice</quote> 4 dentro del 
      dispositivo, tanto para discos SCSI o paralelos. Por ejemplo:</para>

    <screen>&prompt.root; <userinput>mount_msdos /dev/da1s4 /mnt</userinput></screen>

    <para>Para unidades ZIP IDE, utilice:</para>

    <screen>&prompt.root; <userinput>mount_msdos /dev/ad1s4 /mnt</userinput></screen>

    <para>Puede serle &uacute;til modificar <filename>/etc/fstab</filename> 
      para montar los discos m&aacute;s f&aacute;cilmente.  A&ntilde;ada una 
      l&iacute;nea como la siguiente (con las modificaciones necesarias para 
      sus necesidades):

      <programlisting>/dev/da1s4  /zip msdos rw,noauto  0 0</programlisting>

      y cr&eacute;e el directorio <filename>/zip</filename>.</para>

    <para>Hecho esto, puede montar su disco ZIP escribiendo:

      <screen>&prompt.root; <userinput>mount /zip</userinput></screen>

      y para desmontarlo escriba

      <screen>&prompt.root; <userinput>umount /zip</userinput></screen></para>

    <para>Tiene todos los detalles del formato en el que inclu&iacute;r 
       o modificar entradas en <filename>/etc/fstab</filename> en 
      &man.fstab.5;.</para>

    <para>Si quiere puede crear un sistema de ficheros de FreeBSD en un 
      disco ZIP empleando &man.newfs.8;.  Sin embargo eso convertir&iacute;a 
      a ese disco en legible solamente en un sistema FreeBSD y 
      y quiz&aacute;s en unos pocos sistemas cl&oacute;nicos de &unix; 
      que reconocen el sistema de ficheros de FreeBSD. En cualquier caso 
      DOS y Windows <emphasis>no</emphasis> est&aacute;n entre ellos.</para>
  </sect1>
</article>
