<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY date "$FreeBSD: www/fr/advocacy/myths.sgml,v 1.4 2004/01/06 17:31:39 stephane Exp $">
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY title "Projet d'Evang&eacute;lisation FreeBSD">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
	The FreeBSD French Documentation Project
	Original revision: 1.20
	
	Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
	Version francaise (mise a jour) : Vincent Tougait <viny@FreeBSD-FR.org>
-->

<html>
  &header;

    <p>En m&ecirc;me temps que les projets BSD (FreeBSD, NetBSD et OpenBSD) prenaient de l'importance,
      plusieurs l&eacute;gendes persistantes se sont d&eacute;velopp&eacute;es &agrave; leurs sujets. Certaines d'entre elles sont
      entretenues par des personnes bien intentionn&eacute;es mais mal inform&eacute;es, d'autres par des personnes
      avec un objectif bien pr&eacute;cis.</p>

    <p>Cette page a pour but de d&eacute;mystifier ces mythes tout en restant le plus
      d&eacute;passionn&eacute; possible.</p>

    <blockquote><b>Note :</b> Tout au long de cette page, le terme "*BSD" se r&eacute;f&egrave;re aux
      3 projets BSD. Lorsqu'une l&eacute;gende ou une r&eacute;ponse est sp&eacute;cifique &agrave; un
      projet en particulier, cela est pr&eacute;cis&eacute;.</blockquote>

    <blockquote>Si vous constatez une omission ou une erreur, veuillez 
      en informer la personne qui maintient cette page, Tom Rhodes &lt;<a href="mailto:trhodes@FreeBSD.org">trhodes@FreeBSD.org</a>&gt;.</blockquote>

    <h2>Index</h2>

    <ul>
        <li><a href="#closed-model">*BSD ont un mod&egrave;le de d&eacute;veloppement ferm&eacute;,
	  ils sont plus "Cath&eacute;drale" que "Bazar"</a></li>

        <li><a href="#own-distro">Vous ne pouvez pas faire vos propres distributions ou
	  des travaux d&eacute;riv&eacute;s des *BSD</a></li>

        <li><a href="#server">Les *BSD font d'excellents serveurs mais de pi&egrave;tres
	  stations de travail/postes &agrave; usage personnel</a></li>

        <li><a href="#old-codebase">Le code source des *BSD est vieux, d&eacute;mod&eacute; et 
          mourant</a></li>

        <li><a href="#bsd-war">Les projets *BSD sont en guerre les uns contre les
	  autres, de nouveaux groupes dissidents se forment toutes les semaines</a></li>

        <li><a href="#clustering">Vous ne pouvez pas r&eacute;aliser de cluster avec des syst&egrave;mes *BSD 
          (ordinateurs en parall&egrave;les)</a></li>

        <li><a href="#support">Il n'existe pas de support commercial pour les
	  *BSD</a></li>

        <li><a href="#applications">Il n'existe pas d'applications pour les
	  *BSD</a></li>

        <li><a href="#aout">Les *BSD utilisent le format d'ex&eacute;cutable "a.out" qui est
	  obsol&egrave;te</a></li>

        <li><a href="#beats">Les *BSD sont meilleurs que (un autre syst&egrave;me quelconque)</a></li>

        <li><a href="#beaten">(un autre syst&egrave;me) est meilleur que les *BSD</a></li>
</ul>

    <h2>L&eacute;gendes</h2>

    <h3><a name="closed-model">Les *BSD</a> ont un mod&egrave;le de d&eacute;veloppement
      ferm&eacute;, ils sont plus "Cath&eacute;drale" que "Bazar"</h3>

    <p>Eric Raymond a &eacute;crit un papier qui a eu un impact important, ``<a href="http://www.tuxedo.org/~esr/writings/cathedral-bazaar/">La
      Cath&eacute;drale et le Bazar</a>'' dans lequel le mod&egrave;le de d&eacute;veloppement de Linux
      (ainsi que celui utilis&eacute; par Eric pour <tt>fetchmail</tt>) est montr&eacute; en exemple
      sur la fa&ccedil;on de conduire un d&eacute;veloppement "ouvert". A l'oppos&eacute;, le mod&egrave;le
      employ&eacute; par les *BSD est souvent d&eacute;crit comme ferm&eacute;.</p>

    <p>La conclusion implicite est que le "bazar" (ouvert) est un bon mod&egrave;le alors que
      la "cath&eacute;drale" (ferm&eacute;) est mauvais.<p>

    <p>Au contraire, le mod&egrave;le de d&eacute;veloppement des *BSD est certainement
      <strong>beaucoup plus</strong> proche du "bazar" que d&eacute;crit Eric que ce soit
      pour Linux ou <tt>fetchmail</tt>.</p>

    <p>Consid&eacute;rons les &eacute;l&eacute;ments suivants :</p>

    <ul>
        <li><p><b>Pour tous les projets *BSD :</b> Le code source de la version 
          de d&eacute;veloppement de FreeBSD, NetBSD et de OpenBSD est disponible librement
          en t&eacute;l&eacute;chargement sur Internet 24h sur 24. Vous n'avez pas besoin d'attendre
          que quelqu'un d'autre sorte une nouvelle version..</p>

	<p><b>FreeBSD, NetBSD :</b> Un "instantan&eacute;" de la version de d&eacute;veloppement
	  est r&eacute;alis&eacute; toutes les 24 heures. Ces "instantan&eacute;s" peuvent s'installer
	  exactement comme une version ordinaire et ne n&eacute;cessite pas une installation
          par-dessus un syst&egrave;me existant.</p>

	<p><b>OpenBSD :</b> des "instantan&eacute;s" qui peuvent &ecirc;tre install&eacute;s sont cr&eacute;&eacute;s si
          besoin &agrave; la demande des personnes inscrites sur les listes de diffusion OpenBSD.</p>

	<p>Cette situation contraste avec celle de Linux o&ugrave; les nouvelles distributions du noyau
          sont rendues disponibles lorsque cela est n&eacute;cessaire et o&ugrave; la fr&eacute;quence de sortie
          de chaque distribution Linux d&eacute;pend enti&egrave;rement des responsables de la 
          distribution.</p>

	<p>Contrairement &agrave; Linux, la sortie d'une nouvelle version du noyau n'est pas
          annonc&eacute;e en fanfare tout simplement parce que pour la plupart des utilisateurs
          *BSD c'est un &eacute;v&egrave;nement qui se produit tous les jours.</p></li>

        <li><p>Tous les projets *BSD utilisent CVS pour g&eacute;rer leur code source.</p>

	<p><b>Pour tous les projets *BSD :</b> L'arbre CVS est ouvert &agrave; tout le monde
	  en consultation et en t&eacute;l&eacute;chargement, 24h sur 24. L'arbre peut &ecirc;tre t&eacute;l&eacute;charg&eacute; via
	  un acc&egrave;s CVS anonyme, CVSup, CVSupit, CTM (par e-mail) ou simplement via
	  FTP.</p></li>

        <li><p>Quiconque peut proposer des patches, envoyer des rapports de bugs, proposer de la documentation ou
	  bien d'autres choses encore. Il est possible de le faire via le programme
          <tt>send-pr</tt> install&eacute; sur les syst&egrave;mes *BSD ou via
	  une interface web.</p>

	<p>Pr&eacute;cisions sur ce syst&egrave;me pour &eacute;tendre la documentation.</p></li>
	<!-- Pointers to this system litter the documentation -->

        <li><p>Seules certaines personnes peuvent modifier le code source des *BSD. Vous
	  devez &ecirc;tre un <EM>committer</EM>. Typiquement, les personnes se voient proposer
	  les "droits de commit" apr&egrave;s avoir particip&eacute; plusieurs fois au projet de fa&ccedil;on 
	  constructive en envoyant leurs travaux via <tt>send-pr</tt> ou autre.</p>

	<p>Cette mani&egrave;re de proc&eacute;d&eacute; est identique &agrave; ce qui se passe pour Linux. Seule une personne est
	  (en th&eacute;orie) autoris&eacute;e &agrave; modifier le noyau, Linus. Mais certains domaines sp&eacute;cifiques
	  (tel que le code pour la couche r&eacute;seau) sont d&eacute;l&eacute;gu&eacute;s &agrave; d'autres personnes.</p>

	<p><i>Note : Nik (nik@FreeBSD.ORG) est un exemple sur ce point. Apr&egrave;s avoir envoy&eacute;
	    plusieurs travaux au Projet de Documentation FreeBSD ainsi que 
	    des pages web, il lui a &eacute;t&eacute; propos&eacute; les "droits de commit" de mani&egrave;re &agrave; ce qu'il
	    n'ait plus besoin "d'ennuyer" les autres participants pour faire les changements. Il
	    n'a jamais eu &agrave; demander explicitiment ces "droits de commit", on le lui a propos&eacute; spontan&eacute;ment.</i></p></li>
</ul>

    <p>Vous pouvez &eacute;galement consulter l'article &eacute;crit par Jordan Hubbard dans "Performance
      Computing" intitul&eacute; <a href="http://www.performance-computing.com/features/9810of1.shtml">What is FreeBSD?</a></p>

    <hr noshade size="1">

    <h3><a name="own-distro">Vous</a> ne pouvez pas faire vos propres distributions
      ou des travaux d&eacute;riv&eacute;s des *BSD</h3>

    <p>Vous le pouvez. Vous devez juste indiquer dans la documentation et les fichiers
      sources d'o&ugrave; le code original provient.</p>

    <p>Par exemple, PicoBSD est une distribution de FreeBSD con&ccedil;ue pour
      tenir sur une disquette. Elle est tr&egrave;s bien adapt&eacute;e pour transformer un PC 386 sans disque dur
      en routeur ou en serveur d'impression.</p>

    <p>"Whistle Interjet" est un "applicatif r&eacute;seau" qui agit comme
      routeur, serveur web, serveur de messagerie (et d'autres fonctions) et qui peut
      &ecirc;tre configur&eacute; via un navigateur web. Le syst&egrave;me d'exploitation sous-jacent est
      FreeBSD et Whistle a en retour envoy&eacute; plusieurs de ses am&eacute;liorations
      du code au projet FreeBSD (tout en en conservant suffisamment
      pour garder sa place dans le monde commercial).</p>

    <p>Le projet OpenBSD a d&eacute;marr&eacute; en tant que projet d&eacute;riv&eacute; de NetBSD et a
      depuis &eacute;volu&eacute; de mani&egrave;re ind&eacute;pendante.</p>

    <hr noshade size="1">

    <h3><a name="server">Les *BSD</a> font d'excellents serveurs mais de pi&egrave;tres
      stations de travail/postes &agrave; usage personnel</h3>

    <p>Les *BSD font d'excellents serveurs. Ils font &eacute;galement d'excellents postes personnels.
      La plupart des qualit&eacute;s requises pour un serveur (temps de r&eacute;ponse corrects m&ecirc;me sous 
      forte charge, stabilit&eacute;, usage optimal des ressources syst&egrave;mes) sont les m&ecirc;mes
      que pour une machine personnelle.</p>

    <p>Les *BSD ont acc&egrave;s aux m&ecirc;mes outils (KDE, GNOME,
      gestionnaires de fen&ecirc;tres) que Linux. Et les applications bureautiques telles que
      WordPerfect ou StarOffice fonctionnent sous BSD gr&acirc;ce &agrave; la couche
      d'&eacute;mulation Linux.</p>

    <hr noshade size="1">

    <h3><a name="old-codebase">Le</a> code source des *BSD est vieux, d&eacute;mod&eacute; et
      mourant</h3>

    <p>Bien que le code de base des BSD soit vieux de plus de 20 ans, il n'est ni
      d&eacute;mod&eacute; ni mourant. De nombreux utilisateurs professionnels appr&eacute;cient la stabilit&eacute;
      que des ann&eacute;es de tests ont apport&eacute;es &agrave; FreeBSD.</p>

    <p>Des am&eacute;liorations technologiques continuent &agrave; &ecirc;tre apport&eacute;es aux *BSD, comme
      par exemple :</p>

    <ul>
        <li><p>SMP : Multi-Processeurs Sym&eacute;triques, pour la gestion des syst&egrave;mes &agrave;
	  processeurs multiples.</p></li>

        <li><p>SoftUpdates : Rends le syst&egrave;me de fichier BSD au moins aussi rapide que
	  le syst&egrave;me de fichier Linux, <strong>sans</strong> avoir besoin d'utiliser
	  les &eacute;critures asynchrones et les risques associ&eacute;s.</p></li>

        <li><p>Syst&egrave;me VM : Le sous-syst&egrave;me VM (M&eacute;moire Virtuelle) continue d'&ecirc;tre
	  am&eacute;lior&eacute;. L'imbrication de la VM et du cache permets &agrave; des syst&egrave;mes tels que
	  wcarchive.cdrom.com de g&eacute;rer des milliers (litt&eacute;ralement, plus de 10 000)
	  de connexions FTP sans faillir.</p></li>

        <li><p>Portages sur d'autres architectures : le portage des *BSD est en cours
          ou existe d&eacute;j&agrave; sur plusieurs autres architectures dont UltraSPARC, Alpha et PowerPC.
	  NetBSD et OpenBSD sont disponibles sur davantage d'architectures que FreeBSD qui
	  est, &agrave; l'heure actuelle, disponible sur i386, Alpha et
	  UltraSPARC.</p></li>
</ul>

    <hr noshade size="1">

    <h3><a name="bsd-war">Les</a> projets *BSD sont en guerre les uns contre les autres,
      de nouveaux groupes dissidents se forment toutes les semaines</h3>

    <p>Non. Bien qu'occasionnellement il puisse y avoir des discussions "anim&eacute;es", les *BSD
      continuent de travailler ensemble. Le portage de FreeBSD sur Alpha s'est initialement
      fortement bas&eacute; sur le travail r&eacute;alis&eacute; par l'&eacute;quipe NetBSD. NetBSD et
      OpenBSD ont utilis&eacute; la collection des ports FreeBSD afin de commencer leurs
      propres jeux de ports. FreeBSD et NetBSD int&egrave;grent des corrections li&eacute;es &agrave; la s&eacute;curit&eacute;
      d&eacute;couvertes en premier lieu par l'&eacute;quipe OpenBSD.</p>

    <p>Cette coop&eacute;ration s'&eacute;tend jusqu'&agrave; la soci&eacute;t&eacute; commerciale BSDi, qui a gracieusement
      fait don de la couche d'&eacute;mulation DOS &agrave; FreeBSD.</p>

    <p>Les projets FreeBSD et NetBSD sont s&eacute;par&eacute;s depuis maintenant plus de 5
      ans. OpenBSD est le seul nouveau projet BSD &agrave; &ecirc;tre apparu dans les 5 derni&egrave;res
      ann&eacute;es.</p>

    <p>Les projets *BSD coop&egrave;rent &eacute;galement dans d'autres domaines. Par exemple, la
      revue mensuelle <a href="http://www.daemonnews.org/">DaemonNews</a>
      est un effort commun entre des membres des trois projets.</p>

    <hr noshade size="1">
          
    <h3><a name="clustering">Vous</a> ne pouvez pas r&eacute;aliser de cluster avec des syst&egrave;mes *BSD 
      (ordinateurs en parall&egrave;les)</h3>

    <p>Les URLs suivantes devraient r&eacute;futer cela :</p>

    <ul>
        <li><a href="http://www.epm.ornl.gov/pvm/">http://www.epm.ornl.gov/pvm/</a>
          "Parallel Virtual Machine" n'est rien moins qu'un ensemble de logiciels qui permettent
          de mettre en place simplement un cluster. Le code source est disponible librement et fonctionnera
          sous FreeBSD sans trop de difficult&eacute;s.</li>

        <li><a href="http://cubix.desy.de/General/bsd/bsd.html">http://cubix.desy.de/General/bsd/bsd.html</a></li>

        <li><a href="http://acme.ecn.purdue.edu/">http://acme.ecn.purdue.edu/</a>
          "Advanced Computer Matrix for Engineering" (ACME) qui utilise FreeBSD.</li>

        <li><a href="http://www.scl.ameslab.gov/workshops/Talks/Mikler/mikler.html">
          http://www.scl.ameslab.gov/workshops/Talks/Mikler/mikler.html</a></li>

        <li><a href="http://www.scope.gmd.de/info/www6/technical/paper196/paper196.html">
          http://www.scope.gmd.de/info/www6/technical/paper196/paper196.html</a>NetBSD pour les Clusters!</li>

        <li><a href="http://www.ccrc.wustl.edu/~milind/MediaServers.html">
          http://www.ccrc.wustl.edu/~milind/MediaServers.html</a></li>

        <li><a href="http://daily.daemonnews.org/view_story.php3?story_id=964">
          http://daily.daemonnews.org/view_story.php3?story_id=964</a>
          messages sur Daemon News, une discussion &agrave; propos des Clusters</li>

        <li><a href="http://www.scl.ameslab.gov/Projects/ClusterCookbook/index.html">
          http://www.scl.ameslab.gov/Projects/ClusterCookbook/index.html</a></li>
</ul>
	<p>En plus de tout cela, Tom Rhodes &eacute;crit actuellement un article destin&eacute; &agrave; guider un utilisateur dans la mise en place 
	  d'un Syst&egrave;me Parall&egrave;le avec FreeBSD et d'autres logiciels. Cet article devrait sortir au plus tard
	  en 2002 ou 2003.</p>

    <hr noshade size="1">

    <h3><a name="support">Il n'existe pas de support commercial pour les *BSD</a></h3>

    <p><b>FreeBSD :</b> La <a href="http://www.freebsd.org/commercial/consulting.html">Page
	sur les Consultants FreeBSD</a> liste les soci&eacute;t&eacute;s qui proposent un support
        commercial pour FreeBSD.</p>

        <p><a href="http://www.freebsdmall.com">FreeBSD
	  Mall</a> propose &eacute;galement un support commercial ainsi que des tee-shirts,
	  des chapeaux, des livres, des logiciels et diff&eacute;rents articles promotionnels.</p>

        <p>Pour les formations, on peut consulter <a href="http://www.bsdmall.com/">BSDMall.com</a>, mais ils vendent
          aussi d'autres produits comme des tee-shirts, des chapeaux, des livres et des logiciels ! Vaut d&eacute;finitivement le coup d'oeil.</p>

    <p><b>OpenBSD :</b> La <a href="http://www.openbsd.org/support.html">Page
	sur les Consultants OpenBSD</a> liste les soci&eacute;t&eacute;s qui proposent un support 
        commercial pour OpenBSD.</p>

    <hr noshade size="1">

    <h3><a name="applications">Il</a> n'existe pas d'applications pour les *BSD</h3>

    <p>La communaut&eacute; des logiciels libres a principalement commenc&eacute; sur les syst&egrave;mes
      BSD (SunOS et consorts). Les utilisateurs *BSD peuvent g&eacute;n&eacute;ralement compiler les logiciels
      &eacute;crits pour ces syst&egrave;mes sans avoir besoin de modifier quoi que ce soit.</p>

    <p>De plus, chaque projet *BSD utilise un syst&egrave;me de "ports" afin de rendre le plus
      simple possible la compilation des logiciels port&eacute;s.</p>

    <p><b>FreeBSD :</b> Il existe actuellement plus de 8000
      applications pr&ecirc;tes &agrave; &ecirc;tre t&eacute;l&eacute;charg&eacute;es et install&eacute;es dans la collection
      des ports FreeBSD. Sur i386 et Alpha, l'&eacute;mulation Linux permet 
      &eacute;galement de faire fonctionner la plupart des applications Linux.</p>

    <p><b>NetBSD :</b> L'&eacute;mulation Linux permet de faire fonctionner la plupart
      des applications Linux pour i386, et la plupart des applications SunOS4
      peuvent &ecirc;tre utilis&eacute;es sur station SPARC.</p>

    <p><b>OpenBSD :</b> Il existe actuellement un peu plus de 400 applications
      pr&ecirc;tes &agrave; &ecirc;tre t&eacute;l&eacute;charg&eacute;es et install&eacute;es dans la collection des ports OpenBSD. 
      L'&eacute;mulation Linux permet &eacute;galement de faire fonctionner la plupart des applications
      Linux pour i386, et la plupart des applications SunOS4 peuvent &ecirc;tre utilis&eacute;es 
      sur station SPARC.</p>

    <p>NetBSD et OpenBSD sont capables d'utiliser les applications pr&eacute;sentes dans la 
      collection des ports FreeBSD sans probl&egrave;me particulier. Le plus faible nombre
      d'applications port&eacute;es refl&egrave;te cet &eacute;tat de fait.</p>

    <p>Il est exact que la plupart des soci&eacute;t&eacute;s choisissent en premier lieu Linux lorsqu'ils
      d&eacute;cident de porter leurs applications sous Unix pour PC. Heureusement, l'&eacute;mulation Linux
      permet d'utiliser ces programmes (Acrobat, StarOffice, Mathematica, WordPerfect, Quake, 
      compilateur ICC de Intel, compilateur pour Alpha de Compaq...) sans
      trop (g&eacute;n&eacute;ralement aucun) de probl&egrave;mes.</p>

    <p>Un apart&eacute; historique : la premi&egrave;re version de Netscape &agrave; avoir fonctionn&eacute;e
      sous FreeBSD avec le support du Java &eacute;tait la version Linux. A pr&eacute;sent, bien s&ucirc;r,
      vous pouvez utiliser une version native pour FreeBSD de Mozilla avec un module Java
      en natif lui aussi, le tout compil&eacute; simplement &agrave; partir des ports !</p>

    <hr noshade size="1">

    <h3><a name="aout">Les *BSD</a> utilise le format d'ex&eacute;cutable "a.out" qui est
      obsol&egrave;te</h3>

        <p><b>FreeBSD :</b> Jusqu'&agrave; r&eacute;cemment (avant 1998) FreeBSD utilisait le format
          "a.out" par d&eacute;faut. Il n'y avait aucune raison urgente de faire le passage au 
          format "ELF" plus t&ocirc;t. En particulier, FreeBSD n'avait pas (et n'a toujours pas)
          les probl&egrave;mes li&eacute;s &agrave; la compilation des biblioth&egrave;ques partag&eacute;es qu'a rencontr&eacute; 
          Linux lors de sa conversion du format "a.out" au format "ELF". Depuis
          la version 3.0 de FreeBSD, le format d'ex&eacute;cutable utilis&eacute; est le format "ELF".</p>

    <hr noshade size="1">

    <h3><a name="beats">Les *BSD</a> sont meilleurs que (un autre syst&egrave;me quelconque)</h3>

    <p>C'est uniquement une opinion personnelle.</p>

    <hr noshade size="1">

    <h3><a name="beaten">(un autre</a> syst&egrave;me) est meilleur que les *BSD</h3>

    <p>C'est uniquement une opinion personnelle</p>

    <hr noshade size="1">

    <h2>Collaborateurs</h2>

    <p>Les membres des projets FreeBSD, NetBSD et OpenBSD qui ont contribu&eacute;s
      &agrave; cette page :</p>

    <table width="100%">
<tbody>
<tr>
<td>Nik Clayton
	    &lt;<a href="mailto:nik@freebsd.org">nik@FreeBSD.ORG</a>&gt;</td>
<td>Jordan Hubbard
	    &lt;<a href="mailto:jkh@freebsd.org">jkh@FreeBSD.ORG</a>&gt;</td>
</tr>
<tr>
<td>Ian F. Darwin
	    &lt;<a href="mailto:ian@DarwinSys.com">ian@DarwinSys.com</a>&gt;</td>
<tr>
<td>Adrian Filipi-Martin
	    &lt;<a href="mailto:adrian@ubergeeks.com">adrian@ubergeeks.com</a>&gt;</td>
</tr>
<tr>
<td>Tom Rhodes
		&lt;<a href="mailto:trhodes@FreeBSD.org">trhodes@FreeBSD.org</a>&gt;</td>
</tr>
</tbody>
</table>


    &footer;
  </body>
</html>
