<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/platforms/sparc.sgml,v 1.1 2003/11/18 13:05:04 stephane Exp $">
<!ENTITY title "Projet FreeBSD/Sparc64">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.3

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
-->
 
<html>
  &header;

  <p>Cette page contient des informations &agrave; propos du port de FreeBSD sur syst&egrave;mes 
    UltraSPARC.</p>

  <h3>Informations g&eacute;n&eacute;rales</h3>

  <ul>
    <li><a href="#history">Historique du port</a></li>
    <li><a href="#status">Statut du port</a></li>
    <li><a href="#faq">FAQ</a></li>
    <li><a href="mailto:freebsd-sparc@FreeBSD.org">liste de diffusion 
      FreeBSD/SPARC</a></li>
  </ul>

  <h3>Code source</h3>

  <ul>
    <li><a
      href="http://people.FreeBSD.org/~obrien/freebsd-sparc/src-981023.tar.gz">src-981023.tar.gz</a> 
      - premier code de boot (sun4u)</li>
  </ul>

  <h3>Documentations et Livres blancs</h3>

  <ul>
    <li><a href="http://www.sun.com/microelectronics/manuals/">Manuels de 
      Sun Microelectronics</a></li>

    <li><a href="http://playground.sun.com/pub/1275/home.html">Site de Open
      Firmware (Sun)</a></li>

    <li><a
      href="http://www.UNIX-systems.org/version2/whatsnew/datasize.html">Neutralit&eacute; des 
      tailles de donn&eacute;es</a></li>

    <li><a
      href="http://www.UNIX-systems.org/version2/whatsnew/lp64_wp.html">Pourquoi 
      le LP64 ?</a></li>
  </ul>

  <h3>Autres liens int&eacute;ressant</h3>

  <ul>
    <li><a href="http://www.geog.ubc.ca/s_linux.html">Linux pour les processeurs
      SPARC</a></li>

    <li><a
      href="http://www.NetBSD.org/Ports/sparc/">NetBSD/SPARC</a></li>

    <li><a
      href="http://www.OpenBSD.org/sparc.html">OpenBSD/SPARC</a></li>

    <li><a href="http://www.firmworks.com/">FirmWorks</a></li>
  </ul>

  <hr noshade>

    <h3><a name="news">Derni&egrave;res nouvelles</a></h3>

    <ul>
      <li>
        <p><strong>3 Mars 2002</strong> : Une image ISO bootable est
	maintenant disponible pour installer FreeBSD/sparc64 sur un
	syst&egrave;me support&eacute;. Pour plus d'information, merci de consulter 
	la liste de diffusion freebsd-sparc. L'image ISO est disponible
	<a href="http://people.freebsd.org/~jake/sparc64">i&ccedil;i</a>.</p>
      </li>

      <li>
	<p><strong>26 F&eacute;vrier 2002</strong> : David O'Brien a
	post&eacute; une cha&icirc;ne d'outil sparc64 "self-hosted". Vous pouvez
	t&eacute;l&eacute;charger l'archive <a href=
        "http://people.freebsd.org/~obrien/sparc64/native-uberbaum_20020224.tar.bz2">
        i&ccedil;i</a>. D&eacute;tarrez la dans /.</p>
      </li>

      <li>
	<p><strong>9 Octobre 2001</strong> : Jake Burkholder et
	Thomas Moestl ont travaill&eacute; sur le port de FreeBSD pour UltraSparc
	durant les derniers mois et la premi&egrave;re machine &agrave; booter en mode
	"single user" (mono utilisateur) date du 18 Octobre. Le log de la
	console s&eacute;rie peut &ecirc;tre trouv&eacute;e <a href=
        "http://people.FreeBSD.org/~jake/tip.single_user">i&ccedil;i</a>.</p>
      </li>
    </ul>

    <h3><a name="history">Historique du port</a></h3>

	<p>La plateforme FreeBSD/sparc64 a &eacute;t&eacute; initi&eacute; par Jason
	Evans en 1997. A l'origine, le port &eacute;tait soutenu par Sun
	Microelectronics. Sun Microelectronics (SME) est la partie de Sun
	fabriquant les microprocesseurs. Jusqu'&agrave; maintenant, SMCC (la partie de Sun
	fabriquant les postes de travail) a &eacute;t&eacute; globalement le 
	client primordial de SME. SME d&eacute;sire naturellement 
	augmenter ses ventes, et pour cela, il doit vendre des CPUs
	&agrave; des organismes externes &agrave; Sun.
	FreeBSD a &eacute;t&eacute; per&ccedil;u comme une fa&ccedil;on d'accomplir cela.</p>

	<p>Pour comprendre pourquoi Sun pourrait financer un port de FreeBSD,
	ce qui pourrait sembler &ecirc;tre un conflit aux offres Solaris de Sun,
	vous devez r&eacute;aliser que Sun est divis&eacute; en deux parties, qui se
	<strong>concurrencent</strong> assez souvent. L'&eacute;quipe Solaris
	de Sun ne devrait pas appr&eacute;cier avoir un port FreeBSD pour la concurrencer,
	mais leur pouvoir pour l'emp&ecirc;cher est en quelque sorte diminu&eacute;
	&agrave; cause de la direction. Bien s&ucirc;r, si le port FreeBSD est
	une menace majeure, SMI devrait l'entraver. Cependant,
	cela est peu probable, car FreeBSD r&eacute;pond la plupart du temps
	aux besoin d'un secteur diff&eacute;rent du march&eacute; de Solaris.
	Solaris fait des choses magnifiques sur les gros serveurs MP.
	FreeBSD est rapide et l&eacute;ger pour les petits serveurs. Il est &eacute;galement
	utile pour certains types d'applications embarqu&eacute;es, ce qui est actuellement
	la raison principale de l'inter&ecirc;t de SME dans la r&eacute;alisation d'un port de
	FreeBSD pour UltraSPARC.</p>

	<p>Il y a quelque temps, SME a propos&eacute; &agrave; l'&eacute;quipe du noyau
	de FreeBSD une compensation mon&eacute;taire d'une certaine nature
	en &eacute;change d'un port officiel UltraSPARC. L'&eacute;quipe du noyau
	a d&eacute;clin&eacute; cette offre. Les raisons exactes sont connues de
	l'&eacute;quipe du noyau seule, mais Jordan Hubbard impliqua que
	l'offre SME n'&eacute;tait pas d'un inter&ecirc;t majeur, puisque pour &ecirc;tre
	utile &agrave; long terme &agrave; FreeBSD, une telle proposition devrait inclure
	le soutien pendant un certain nombre d'ann&eacute;es d'une personne interne
	&agrave; Sun.</p>

	<p>Jason Evans commen&ccedil;a &agrave; travailler au SME en Septembre 1997.
	Durant la premi&egrave;re semaine, il prit vent des n&eacute;gociations que
	SME &eacute;tait en train de faire avec l'&eacute;quipe du noyau. Jason
	porta un inter&ecirc;t extr&ecirc;me &agrave; travailler avec le projet.
	Avec un peu de persistance (et l'&eacute;chec de la proposition faite
	par SME), il lui a &eacute;t&eacute; donn&eacute; la permission de commencer le travail
	sur le port.</p>

	<p>Les autres devoirs de Jason inclurent de trouver des informations
	sur les &eacute;diteurs de logiciels en train de porter leurs OS/RTOS
	pour UltraSPARC. Ceci lui donna une bonne position pour recueillir
	une information mat&eacute;rielle pertinente pour le port de FreeBSD.</p>

	<p>Jason fut important en obtenant le port FreeBSD/sparc64
	fait, et en faisant une grande partie de la planification initiale.
	Sun Microsystems a depuis lors supprim&eacute; leur soutien &agrave; FreeBSD/sparc64,
	et Jason Evans a certainement quitt&eacute; Sun.</p>

	<p>Paolo Di Francesco f&ucirc;t le second "p&egrave;re" du port. Paolo
	essaya, pour la premi&egrave;re fois de l'histoire du port, d'organiser
	l'information, les d&eacute;veloppeurs et les t&acirc;ches par une stucture de
	management du projet. S'il n'y avait pas eu la p&eacute;riode de vacance 98-99
	et quelques individus trop bavards sur la mailing list, Paolo aurait
	continu&eacute;. Pendant sa pr&eacute;sence, de nombreuses personnes travaill&egrave;rent
	sur l'ancienne architecture SPARC de Sun, avec les plus qualifi&eacute;es sur
	l'UltraSPARC. Les diff&eacute;rences notables entre ces deux groupes caus&egrave;rent
	de petits probl&egrave;mes, mais les mailing-lists ne se tarirent pas &agrave; cause de ce
	probl&egrave;me.

	<!-- Probl&egrave;me de traduction (non compr&eacute;hension des phrases !-->

	<p>En 2000, Jake Burkholder et Thomas Moestl ont accompli
	une quantit&eacute; de travail incroyable sur le port sparc.
	La plus grande partie du developpement a pris place sur le
	d&eacute;p&ocirc;t Perforce sur freefall, et a seulement &eacute;t&eacute; fusionn&eacute; &agrave; la
	HEAD (branche -CURRENT) du CVS apr&egrave;s un test plus soigneux.
	David O'Brien a fait un travail consid&eacute;rable pour fournir
	une cha&icirc;ne d'outils pour le d&eacute;veloppement FreeBSD/spar64.
	Jusqu'&agrave; ce qu'une des personnes mentionn&eacute;es ci-dessus mette
	&agrave; jour ce paragraphe, voyez s'il vous pla&icirc;t les archives de la
	mailing list ;)</p>
  <hr noshade>

  <h3><a name="faq">Questions fr&eacute;quemment pos&eacute;es (FAQ)</a></h3>

  <ol>
    <li><a href="#1">Qu'est-il arriv&eacute; &agrave; l'ancienne FAQ ?</a></li>
    <li><a href="#2">Quel est le statut du port ?</a></li>
    <li><a href="#3">Sur quelles machines fonctionnera FreeBSD/Sparc64 ?</a></li>
    <li><a href="#4">Est-ce que FreeBSD/Sparc64 supporte le p&eacute;riph&eacute;rique X ?</a></li>
    <li><a href="#5">Est-ce que les binaires Solaris/SunOS fonctionneront sur FreeBSD/Sparc64 ?</a></li>
  </ol>

  <h4><a name="1">Qu'est-il arriv&eacute; &agrave; l'ancienne FAQ ?</a></h4>

  <p>Elle est <a
    href="http://people.FreeBSD.org/~obrien/freebsd-sparc/oldfaq.html">ici</a>.
    L'ancienne FAQ est tr&egrave;s centr&eacute;e sur SME et l'architecture sun4u. Cela ne
    refl&egrave;te pas l'&eacute;tat actuel du port puisque SME a retir&eacute;
    son support officiel du port et que la majorit&eacute; de 
    l'&eacute;quipement pour le d&eacute;veloppement consiste maintenant en de vieilles Sun SPARC.
    De plus, il n'y a pas eu beaucoup de questions fr&eacute;quemment pos&eacute;es
    ces derniers temps. La plupart des articles de l'ancienne FAQ datent d'avant l'archivage
    de la liste de diffusion.</p>

  <h4><a name="2">Quel est le statut du port ?</a></h4>

  <p>Bien que nous soyons dans les toutes premi&egrave;res &eacute;tapes, et pour conserver l'attention des gens 
    sur ce port, vous pouvez consulter le <a href="#status">statut</a>
    en ligne.</p>

  <h4><a name="3">Sur quelles machines fonctionnera FreeBSD/Sparc64 ?</a></h4>

  <p>Actuellement ? Aucune. Le port est bien loin de fonctionner sur
    quoi que ce soit. Nous pr&eacute;voyons de supporter toutes les machines que nous pouvons. Il est
    certain de consid&eacute;rer que FreeBSD/Sparc64 fonctionnera au moins sur toutes les stations de
    travail PCI / IDE.</p>

  <h4><a name="4">Est-ce que FreeBSD/Sparc64 supporte le p&eacute;riph&eacute;rique X ?</a></h4>

  <p>Voir la <a href="#3">question 3</a>.</p>

  <h4><a name="5">Est-ce que les binaires Solaris/SunOS fonctionneront sur FreeBSD/Sparc64 ?</a></h4>

  <p>Il est raisonnable de dire que FreeBSD/Sparc64 permettra une certaine 
    &eacute;mulation Solaris/SunOS. Il est trop t&ocirc;t dans le d&eacute;veloppement du port pour
    r&eacute;pondre &agrave; cette question de mani&egrave;re plus pr&eacute;cise.</p>

<hr noshade>

  <h3>Note de traduction</h3>
	<p>J'ai tent&eacute; autant que possible de m'en tenir &agrave; la version originale, 
	mais la syntaxe du document d'origine ne m'a pas permis de faire une 
	traduction exacte. -- <a href=
	"mailto:dc@freebsd-fr.org">Francois TIFFREAU</a>
  &footer;
</html>
