freebsd/freebsd-doc/documentation/manual-pages/ru/man1/fdformat.1
.\" Copyright (C) 1993, 1994, 1995, 2001 by Joerg Wunsch, Dresden
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/fdformat/fdformat.1,v 1.31 2007/02/28 10:24:34 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man1/fdformat.1,v 1.2 2007/02/28 10:29:54 ru Exp $
.\" $FreeBSD$
.\"
.Dd 25 декабря 2001
.Os
.Dt FDFORMAT 1
.Sh НАЗВАНИЕ
.Nm fdformat
.Nd отформатировать дискету
.Sh СИНТАКСИС
.Nm
.Op Fl F Ar заполнитель
.Op Fl f Ar формат
.Op Fl s Ar форматная_строка
.Op Fl nqvy
.Ar устройство
.Sh ОПИСАНИЕ
Утилита
.Nm
форматирует дискету, находящуюся в устройстве
.Ar устройство ,
при этом
.Ar устройство
может быть задано как полным путём
(например,
.Pa /dev/fd0 ) ,
так и относительно каталога
.Pa /dev
(например,
.Dq Li fd0 ) .
.Pp
Имеются следующие опции:
.Bl -tag -width ".Fl s Ar форматная_строка"
.It Fl F Ar заполнитель
Заполнить байтом
.Ar заполнитель
вновь отформатированные сектора диска.
Аргумент
.Ar заполнитель
может принимать значения от 0 до 255 в нотации языка C.
Значением по умолчанию является
.Dq Li 0xf6 .
.It Fl f Ar формат
Указать параметры плотности записи устройства для формата на
.Ar формат
килобайт, как описано в
.Xr fdcontrol 8 .
.It Fl s Ar форматная_строка
Явно указать параметры плотности устройства, как описано в
.Xr fdcontrol 8 .
.It Fl n
Не проверять дискету после форматирования.
.It Fl q
Подавить любой вывод команды и не спрашивать у пользователя
подтверждения на форматирование дискеты в устройстве
.Ar устройство .
.It Fl v
Не форматировать, только проверить.
.It Fl y
Не спрашивать у пользователя подтверждение на форматирование дискеты,
но по-прежнему выводить информацию о ходе процесса форматирования.
.El
.Pp
Для устройств без автоматического выбора плотности записи
использование опций
.Fl f Ar формат
и
.Fl s Ar форматная_строка
недопустимо, поскольку всегда будет использоваться заранее
сконфигурированная настройка плотности записи из драйвера.
Однако, если
.Ar устройство
является устройством с автоматическим выбором плотности записи (см.\&
.Xr fdc 4 ) ,
то для установки плотности записи вновь форматируемых носителей
могут использоваться оба метода (без изменения значений по умолчанию
для устройства
.Ar устройство ) .
.Pp
Если не был указан флаг
.Fl q ,
у пользователя запрашивается подтверждение на форматирование.
Для запуска процесса необходимо ввести
.Ql y .
.Pp
Следует заметить, что
.Nm
выполняет только низкоуровневое форматирование.
Для создания на носителе файловой системы, обратитесь к странице справочника
.Xr newfs 8
для файловой системы
.Tn UFS
или
.Xr newfs_msdos 8
для файловой системы
.Tn MS-DOS
(FAT).
.Sh СТАТУС ЗАВЕРШЕНИЯ
Программа возвращает 0 в случае успешного завершения.
Если в процессе форматирования возникли какие-либо проблемы, возвращается 1.
В случае задания неверных аргументов
.Nm
возвращает 2 (с выводом более подробной информацией в стандартный файл ошибок).
.Sh ДИАГНОСТИКА
Если не был указан флаг
.Fl q ,
то на стандартный вывод выводится одна буква, которая информирует
пользователя о ходе выполнения программы.
Пока форматируется дорожка, выводится
.Ql F ,
затем, когда дорожка проверяется, выводится
.Ql V ,
затем, в случае обнаружения ошибки, выводится
.Ql E .
Детальная информация (номер цилиндра, головки, сектора и точная причина ошибки)
выводится после полного завершения процесса форматирования
для не более чем для десяти ошибок.
.Sh СМОТРИ ТАКЖЕ
.Xr fdc 4 ,
.Xr fdcontrol 8 ,
.Xr newfs 8 ,
.Xr newfs_msdos 8
.Sh ИСТОРИЯ
Утилита
.Nm
была изначально разработана для
.Bx 386 0.1 ,
а затем обновлена для поддержки нового драйвера гибких дисков
.Xr fdc 4 .
Позднее
.Nm
стала частью системы
.Fx 1.1 .
Начиная с
.Fx 5.0 ,
утилита использует унифицированный формат задания плотности записи,
который описан в
.Xr fdcontrol 8 .
.Sh АВТОРЫ
.An -nosplit
Программу написал
.An J\(:org Wunsch ,
Дрезден, с изменениями от
.An Сергея Вакуленко
и
.An Андрея Чернова ,
Москва.
