freebsd/freebsd-doc/documentation/manual-pages/ru/man1/passwd.1
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)passwd.1	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.bin/passwd/passwd.1,v 1.32.2.1 2007/11/14 19:25:04 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man1/passwd.1,v 1.2 2007/11/16 11:31:27 ru Exp $
.\" $FreeBSD$
.\"
.Dd 6 июня 1993
.Dt PASSWD 1
.Os
.Sh НАЗВАНИЕ
.Nm passwd , yppasswd
.Nd изменить пароль пользователя
.Sh СИНТАКСИС
.Nm
.Op Fl l
.Op Ar пользователь
.Nm yppasswd
.Op Fl l
.Op Fl y
.Op Fl d Ar домен
.Op Fl h Ar хост
.Op Fl o
.Sh ОПИСАНИЕ
Утилита
.Nm
изменяет локальный, Kerberos, или NIS-пароль пользователя.
Если пользователь не является суперпользователем,
.Nm
сначала потребует ввести текущий пароль,
и не продолжит свою работу до тех пор, пока не будет введён правильный пароль.
.Pp
При вводе нового пароля символы не отображаются на экране, чтобы исключить
возможность подсматривания пароля.
Утилита
.Nm
требует ввода пароля дважды, чтобы предупредить возможные ошибки набора.
.Pp
Новый пароль должен состоять по меньшей мере из 6 символов (такое поведение
может быть изменено в файле
.Xr login.conf 5
параметром
.Dq minpasswordlen
для класса пользовательской учётной записи) и не должен состоять лишь из букв.
Длина пароля должна быть меньше чем
.Dv _PASSWORD_LEN
(в настоящее время 128 символов).
.Pp
Новый пароль должен состоять как из строчных, так и из заглавных букв
(такое поведение может быть изменено в файле
.Xr login.conf 5
параметром
.Dq mixpasswordcase
для класса пользовательской учётной записи).
Возможность создания паролей, состоящих исключительно из строчных букв, может
оказаться полезной при использовании файла паролей в ситуациях,
где только такие пароли и возможны, например, при использовании Samba для
аутентификации Windows клиентов.
Во всех остальных случаях рекомендуется также использовать
числа, заглавные буквы и специальные символы.
.Pp
Как только пароль будет подтверждён,
.Nm
передаёт информацию о новом пароле на хост аутентификации Kerberos.
.Pp
Имеется следующая опция:
.Bl -tag -width indent
.It Fl l
Означает, что пароль будет изменён только в локальном файле паролей,
и не будет изменён в базе данных Kerberos.
При изменении только локального пароля
для обновления базы данных паролей используется
.Xr pwd_mkdb 8 .
.El
.Pp
При изменении локального или NIS-пароля, время следующей смены пароля
устанавливается в соответствии с параметром
.Dq passwordtime
класса пользовательской учётной записи.
.Pp
Чтобы изменить Kerberos-пароль другого пользователя,
необходимо вначале выполнить
.Xr kinit 1 ,
а затем
.Nm .
Суперпользователю не требуется вводить текущий пароль пользователя,
если изменяется только локальный пароль.
.Sh ВЗАИМОДЕЙСТВИЕ С NIS
Утилита
.Nm
имеет встроенную поддержку NIS.
Если пользователь существует в базе данных паролей NIS,
но не существует в локальной базе данных паролей,
.Nm
автоматически переключается в режим
.Nm yppasswd .
Если указанный пользователь не существует ни в локальной базе данных паролей,
ни в базе данных NIS-паролей,
.Nm
возвращает ошибку.
.Pp
При изменении NIS-пароля непривилегированным пользователем, требуется чтобы он
ввёл свой старый пароль для аутентификации
(демон
.Xr rpc.yppasswdd 8
требует старый пароль, до того как он разрешит вносить какие-либо изменения
в карты NIS-паролей).
Это ограничение распространяется даже на суперпользователя,
с одним важным исключением: игнорируется парольная аутентификация
для суперпользователя на главном сервере NIS.
Это означает, что суперпользователь на главном сервере NIS
может делать изменения в любых пользовательских паролях без
ограничений.
На клиенте NIS и вторичном сервере NIS, суперпользователю всё равно
необходимо вводить пароль, до того как изменения будут обработаны.
.Pp
Следующие дополнительные параметры поддерживаются при использовании
.Nm
совместно с NIS:
.Bl -tag -width indent
.It Fl y
Отключает эвристику определения режима работы, и заставляет
.Nm
работать в NIS-режиме.
.It Fl l
Когда включен NIS, флаг
.Fl l
может быть использован для принудительного перевода
.Nm
в
.Dq локальный
режим.
Этот флаг может быть использован, чтобы изменить запись
для локального пользователя в том случае, когда существует NIS-пользователь
с таким же учётным именем.
Например, время от времени вам может понадобиться осуществить
поиск записей для системных
.Dq служебных
пользователей, таких как
.Pa bin
или
.Pa daemon ,
и в картах NIS-паролей, и в локальной базе данных пользователей.
По умолчанию
.Nm
будет пытаться изменить NIS-пароль.
Флаг
.Fl l
может быть использован для изменения локального пароля.
.It Fl d Ar домен
Указывает, какой домен использовать при смене NIS-пароля.
По умолчанию
.Nm
полагает, что следует использовать системный домен по умолчанию.
Этот флаг в основном предназначен для использования суперпользователем на
главном сервере NIS: один сервер NIS может поддерживать множество доменов.
Также возможно, что имя домена главного сервера NIS не было установлено
(не требуется, чтобы сервер NIS был одновременно и клиентом NIS);
в этом случае команда
.Nm
нуждается в явном указании домена.
.It Fl h Ar хост
Указывает имя сервера NIS.
Эта опция, совместно с опцией
.Fl d ,
может быть использована для изменения NIS-пароля на нелокальном сервере NIS.
Когда домен указывается опцией
.Fl d ,
и
.Nm
не в состоянии определить имя главного сервера NIS (возможно потому, что
имя локального домена не установлено), имя главного сервера
NIS полагается равным
.Dq localhost .
Такое поведение может быть изменено с помощью флага
.Fl h .
Указанное имя хоста не обязано быть именем главного сервера NIS:
имя главного сервера NIS для заданной NIS-карты может быть определено
с помощью запроса к любому из серверов домена NIS (главному или подчинённому),
таким образом, указание имени вторичного сервера должно работать также хорошо.
.It Fl o
Не выключать автоматическую парольную аутентификацию для
суперпользователя на главном сервере NIS; вместо этого работать в
.Dq старом
режиме.
Этот флаг имеет ограниченное практическое применение,
но может оказаться полезным при тестировании.
.El
.Sh ФАЙЛЫ
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/master.passwd
база данных пользователей
.It Pa /etc/passwd
файл паролей 7-й версии
.It Pa /etc/passwd.XXXXXX
временная копия файла паролей
.It Pa /etc/login.conf
база данных классов учётных записей
.It Pa /etc/auth.conf
конфигурация служб аутентификации
.El
.Sh СМОТРИ ТАКЖЕ
.Xr chpass 1 ,
.Xr kinit 1 ,
.Xr login 1 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr kerberos 8 ,
.Xr kpasswdd 8 ,
.Xr pw 8 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Rs
.%A Robert Morris
.%A Ken Thompson
.%T "UNIX password security"
.Re
.Sh ЗАМЕЧАНИЯ
Команда
.Nm yppasswd
в действительности является лишь ссылкой на
.Nm .
.Sh ИСТОРИЯ
Команда
.Nm
появилась в
.At v6 .
