freebsd/freebsd-doc/documentation/manual-pages/ru/man1/pkg_info.1
.\"
.\" FreeBSD install - a package for the installation and maintenance
.\" of non-core utilities.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" Jordan K. Hubbard
.\"
.\"
.\"     @(#)pkg_info.1
.\" %FreeBSD: src/usr.sbin/pkg_install/info/pkg_info.1,v 1.60 2007/03/04 13:30:02 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man1/pkg_info.1,v 1.1 2007/03/04 14:16:29 ru Exp $
.\" $FreeBSD$
.\"
.Dd 9 января 2006
.Dt PKG_INFO 1
.Os
.Sh НАЗВАНИЕ
.Nm pkg_info
.Nd утилита, отображающая информацию о программных пакетах
.Sh СИНТАКСИС
.Nm
.Op Fl bcdDEfgGiIjkKLmopPqQrRsvVxX
.Op Fl e Ar пакет
.Op Fl l Ar префикс
.Op Fl t Ar шаблон
.Fl a | Ar имя_пакета ...
.Nm
.Op Fl qQ
.Fl W Ar имя_файла
.Nm
.Op Fl qQ
.Fl O Ar происхождение
.Nm
.Sh ОПИСАНИЕ
Команда
.Nm
используется для вывода на экран информации о пакетах, как упакованных в
файлы при помощи команды
.Xr pkg_create 1 ,
так и уже установленных в системе посредством команды
.Xr pkg_add 1 .
.Sh ОПЦИИ
Поддерживаются следующие опции командной строки:
.Bl -tag -width indent
.It Ar имя_пакета ...
Выводится описание указанных пакетов.
Именем пакета может быть имя
уже установленного пакета, путь к файлу дистрибутива пакета или
URL пакета, доступного по FTP.
Номера версий пакетов могут также подбираться при помощи реляционных операторов
.Pa >= , <= , >
и
.Pa < .
Например,
.Pp
.Dl "pkg_info 'portupgrade>=20030723'"
.Pp
выберет версии 20030723 или более поздние пакета
.Pa portupgrade .
.It Fl a
Показать все установленные на данный момент пакеты.
.It Fl b
Использовать для вывода переменную окружения
.Ev BLOCKSIZE ,
даже если указаны флаги
.Fl q
или
.Fl Q .
.It Fl v
Включить подробный вывод.
.It Fl p
Показать установочный префикс для каждого пакета.
.It Fl q
Вывести запрашиваемую информацию в необработанном виде,
не печатать заголовков и т.п.\& (то есть предполагается,
что информация будет обрабатываться программой, а не человеком).
.It Fl Q
То же, что и
.Fl q ,
но предварять вывод именем пакета.
.It Fl c
Показать (однострочное) поле комментария для каждого пакета.
.It Fl d
Показать поле с подробным описанием пакета.
.It Fl D
Показать для каждого пакета файл с установочными сообщениями.
.It Fl f
Показать для каждого пакета инструкции упаковочного списка.
.It Fl g
Показать файлы, у которых не совпадает записанная контрольная сумма.
.It Fl i
Показать установочный сценарий (если он есть) для каждого пакета.
.It Fl I
Показать строку индекса для каждого пакета.
Эта опция имеет наивысший приоритет среди всех опций
задания формата вывода информации о пакете.
.It Fl j
Показать сценарий требований (если он есть) для каждого пакета.
.It Fl k
Показать для каждого пакета сценарий (если он есть),
выполняющийся в момент удаления пакета.
.It Fl K
Сохранять загруженные пакеты в
.Ev PKGDIR ,
если эта переменная определена, или (по умолчанию) в текущем каталоге.
.It Fl r
Для каждого указанного пакета вывести список
пакетов, от которых он зависит.
.It Fl R
Для каждого указанного пакета вывести список
установленных пакетов, которым он требуется.
.It Fl m
Показать файл
.Xr mtree 8
(если он есть) для каждого пакета.
.It Fl L
Показать файлы, входящие в состав каждого пакета.
Это отличается от простого
просмотра упаковочного списка, поскольку генерируются
полные пути для каждого файла.
.It Fl s
Показать суммарный размер файлов, установленных каждым пакетом.
.It Fl o
Показать исходный путь
.Pq Dq origin ,
записанный при создании пакета.
Этот путь является именем каталога в
.Em "коллекции портов"
.Fx ,
соответствующем порту, из которого был сгенерирован данный пакет.
.It Fl G
Не пытаться раскрывать шаблоны имён файлов командной оболочки в
.Ar имя_пакета ,
когда выбираются пакеты для вывода (по умолчанию
.Nm
автоматически раскрывает шаблоны имён файлов в
.Ar имя_пакета ) .
.It Fl W Ar имя_файла
Для заданного аргумента
.Ar имя_файла
показать, к какому пакету он принадлежит.
Если файл отсутствует в текущем
каталоге и не указан его абсолютный путь, тогда поиск
осуществляется с использованием
.Xr which 1
в каталогах, перечисленных в переменной окружения
.Ev PATH .
.It Fl O Ar происхождение
Вывести список всех пакетов, имеющих данное
.Ar происхождение
(origin).
.It Fl x
Интерпретировать
.Ar имя_пакета
как регулярное выражение и отображать информацию только для пакетов,
чьи имена сопоставимы с этим регулярным выражением.
Может быть задано несколько регулярных выражений, в этом случае
.Nm
отображает информацию обо всех пакетах, сопоставимых по крайней мере с одним
регулярным выражением из списка.
.It Fl X
То же, что и
.Fl x ,
но
.Ar имя_пакета
интерпретируется как расширенное регулярное выражение.
.It Fl e Ar пакет
Если пакет, идентифицируемый аргументом
.Ar пакет ,
уже установлен, вернуть 0, иначе вернуть 1.
Эта опция
позволяет вам легко проверять наличие другого пакета (возможно
необходимого как зависимость) из сценария.
.It Fl E
Показывать только имена подходящих пакетов.
Эта опция имеет наивысший приоритет среди всех опций
задания формата вывода информации о пакете.
Если были найдены подходящие пакеты, вернуть 0, иначе вернуть 1.
.It Fl l Ar префикс
Вывести
.Ar префикс
в начале каждого заголовка категории информации (см.\&
.Fl q ) .
Эта опция будет полезна интерфейсным программам,
которые запрашивают для пакета сразу много разных
информационных полей, но не хотят, чтобы вывод был
смешан таким образом, что они не смогут его упорядочить.
Эта опция позволяет вам добавить специальный маркер в начало
каждого поля.
.It Fl t Ar шаблон
Использовать
.Ar шаблон
в качестве аргумента
.Xr mktemp 3
для создания
.Dq строительной площадки .
По умолчанию это строка
.Pa /tmp/instmp.XXXXXX ,
но может понадобиться подменить её в случае, если в
вашем каталоге
.Pa /tmp
недостаточно свободного места.
Убедитесь, что оставляете некоторые количество символов
.Ql X ,
чтобы
.Xr mktemp 3
заполнил их уникальным идентификатором.
.Bd -ragged -offset indent -compact
Примечание: Как правило это не требуется при использовании
.Nm ,
поскольку из каждого пакета извлекается очень мало информации, и
.Pa /tmp
должен быть совсем маленьким, чтобы его переполнить.
.Ed
.It Fl V
Показать номер ревизии формата упаковочного списка.
.It Fl P
Показать номер ревизии пакетных инструментов.
.El
.Sh ТЕХНИЧЕСКИЕ ДЕТАЛИ
Информация о пакете извлекается либо из пакетных файлов,
заданных в командной строке, либо из информации об уже
установленных пакетах в
.Pa /var/db/pkg/ Ns Aq Ar имя_пакета .
.Sh ОКРУЖЕНИЕ
.Bl -tag -width ".Ev PKG_TMPDIR"
.It Ev BLOCKSIZE
Если установлена переменная окружения
.Ev BLOCKSIZE ,
счётчики числа блоков будут выводиться в единицах заданного ею
размера блока.
.It Ev PKG_TMPDIR
Указывает на каталог, где
.Nm
создаёт свои временные файлы.
Если эта переменная не установлена, используется
.Ev TMPDIR .
Если обе переменные не установлены, используется
встроенное значение по умолчанию.
.It Ev PKG_DBDIR
Задаёт альтернативное расположение базы данных установленных пакетов.
.It Ev PKG_PATH
Задаёт альтернативное расположение пакета,
если данный пакет не может быть найден.
.It Ev PKGDIR
Задаёт альтернативное расположение для сохранения загруженных пакетов.
.El
.Sh ФАЙЛЫ
.Bl -tag -width ".Pa /var/db/pkg" -compact
.It Pa /var/tmp
Используется, если переменные окружения
.Ev PKG_TMPDIR
и
.Ev TMPDIR
не установлены, или если указанные каталоги имеют недостаточно свободного места.
.It Pa /tmp
Следующий вариант, если
.Pa /var/tmp
не существует или имеет недостаточно места.
.It Pa /usr/tmp
Последний вариант, если
.Pa /tmp
не подходит.
.It Pa /var/db/pkg
Стандартное расположение базы данных установленных пакетов.
.El
.Sh СМОТРИ ТАКЖЕ
.Xr pkg_add 1 ,
.Xr pkg_create 1 ,
.Xr pkg_delete 1 ,
.Xr pkg_version 1 ,
.Xr mktemp 3 ,
.Xr mtree 8
.Sh АВТОРЫ
.An Jordan Hubbard
.Sh ПОМОЩНИКИ
.An John Kohl Aq jtk@rational.com ,
.An Oliver Eikemeier Aq eik@FreeBSD.org
.Sh ПРОБЛЕМЫ
Не без них.
