freebsd/freebsd-doc/documentation/manual-pages/ru/man1/vidcontrol.1
.\"
.\" vidcontrol - a utility for manipulating the syscons video driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\"     @(#)vidcontrol.1
.\" %FreeBSD: src/usr.sbin/vidcontrol/vidcontrol.1,v 1.58 2006/12/22 23:23:59 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man1/vidcontrol.1,v 1.4 2007/11/20 13:50:08 ru Exp $
.\" $FreeBSD$
.\"
.Dd 23 декабря 2006
.Dt VIDCONTROL 1
.Os
.Sh НАЗВАНИЕ
.Nm vidcontrol
.Nd утилита конфигурации и управления системной консолью
.Sh СИНТАКСИС
.Nm
.Op Fl CdLHPpx
.Op Fl b Ar цвет
.Op Fl c Ar форма_курсора
.Oo
.Fl f
.Op Ar размер
.Ar файл
.Oc
.Op Fl g Ar геометрия
.Op Fl h Ar размер
.Op Fl i Cm adapter | mode
.Op Fl l Ar карта_экрана
.Op Fl M Ar символ
.Op Fl m Cm on | off
.Op Fl r Ar цвет_текста Ar цвет_фона
.Op Fl S Cm on | off
.Op Fl s Ar номер
.Op Fl t Ar N | Cm off
.Op Ar режим
.Op Ar цвет_текста Op Ar цвет_фона
.Op Cm show
.Sh ОПИСАНИЕ
Утилита
.Nm
используется для установки различных опций драйвера консоли
.Xr syscons 4 ,
таких как видеорежим, цвет, форма курсора, карта экранного вывода,
шрифт и время ожидания до запуска заставки экрана.
.Pp
Имеются следующие опции:
.Bl -tag -width indent
.It Ar режим
Выбрать новый видеорежим.
В настоящее время доступны такие режимы:
.Ar 80x25 ,
.Ar 80x30 ,
.Ar 80x43 ,
.Ar 80x50 ,
.Ar 80x60 ,
.Ar 132x25 ,
.Ar 132x30 ,
.Ar 132x43 ,
.Ar 132x50 ,
.Ar 132x60 ,
.Ar VGA_40x25 ,
.Ar VGA_80x25 ,
.Ar VGA_80x30 ,
.Ar VGA_80x50 ,
.Ar VGA_80x60 ,
.Ar VGA_90x25 ,
.Ar VGA_90x30 ,
.Ar VGA_90x43 ,
.Ar VGA_90x50 ,
.Ar VGA_90x60 ,
.Ar EGA_80x25 ,
.Ar EGA_80x43 ,
.Ar VESA_132x25 ,
.Ar VESA_132x43 ,
.Ar VESA_132x50 ,
.Ar VESA_132x60 .
.\"Графический режим
.\".Ar VGA_320x200
.\"и
Также может быть выбран растровый текстовый режим
.Ar VESA_800x600 .
Режим также можно задать другим способом, по его номеру.
Для этого используется название режима в виде
.Li MODE_ Ns Aq Ar НОМЕР .
Список номеров доступных режимов можно получить с помощью опции
.Fl i Cm mode .
См.\& ниже раздел
.Sx Поддержка видеорежимов .
.It Ar цвет_текста Op Ar цвет_фона
Изменить цвета отображаемого текста.
Задать цвет текста
(например,
.Dq vidcontrol white )
или и текста, и фона
(например,
.Dq vidcontrol yellow blue ) .
Список доступных цветов может быть получен с помощью команды
.Cm show ,
описанной ниже.
.It Cm show
Показать цвета, доступные на данной платформе.
.It Fl b Ar цвет
Установить цвет границы в указанное значение
.Ar цвет .
Не любой видео-драйвер поддерживает эту опцию.
.It Fl C
Очистить буфер истории.
.It Fl c Cm normal | blink | destructive
Изменить форму курсора.
Курсор может быть либо блоком, инвертирующим цвет
.Pq Cm normal ,
возможно мигающим
.Pq Cm blink ,
либо выглядеть как старый аппаратный курсор
.Pq Cm destructive .
Последнее в действительности является эмуляцией.
.It Fl d
Напечатать текущую карту экранного вывода.
.It Xo
.Fl f
.Op Ar размер
.Ar файл
.Xc
Загрузить файл шрифта, указанного через
.Ar файл ,
с размером, равным значению
.Ar размер
(в настоящий момент доступны размеры
.Cm 8x8 ,
.Cm 8x14
и
.Cm 8x16 ) .
Файл шрифта может быть закодирован
.Xr uuencode 1
или иметь двоичный формат.
Загрузить нужный шрифт можно и через меню,
с помощью утилиты
.Xr vidfont 1 .
.Pp
Аргумент
.Ar размер
можно опустить, в этом случае
.Nm
попытается определить его по размеру файла шрифта.
.Pp
Следует заметить, что старые видеокарты, такие как MDA и CGA,
не поддерживают программные шрифты.
Смотрите также разделы
.Sx Поддержка видеорежимов
и
.Sx ПРИМЕРЫ
ниже и страницу справочника
.Xr syscons 4 .
.It Fl g Ar геометрия
Установить геометрию текстового режима для режимов с
настраиваемой геометрией.
В настоящий момент только растровые режимы, такие как
.Ar VESA_800x600 ,
поддерживают эту опцию.
Смотрите также разделы
.Sx Поддержка видеорежимов
и
.Sx ПРИМЕРЫ
ниже.
.It Fl h Ar размер
Установить размер буфера истории (прокрутки вверх) равным
.Ar размер
линий.
.It Fl i Cm adapter
Показать информацию об используемом видеоадаптере.
.It Fl i Cm mode
Показать видеорежимы, доступные на используемом оборудовании.
.It Fl l Ar карта_экрана
Загрузить карту экранного вывода из указанного файла
.Ar карта_экрана .
См.\& также
.Xr syscons 4 .
.It Fl L
Установить карту экранного вывода, используемую по умолчанию.
.It Fl M Ar символ
Задать значение базового символа, используемого для отрисовки указателя
мыши, равным
.Ar символ .
.It Fl m Cm on | off
Включить
.Pq Cm on
или выключить
.Pq Cm off
указатель мыши.
Используется совместно с
.Xr moused 8
для реализации функций копирования и вставки в текстовом режиме.
.It Fl p
Зафиксировать текущее содержимое буфера видеопамяти терминала,
подключенного к стандартному вводу.
Утилита
.Nm
пишет содержимое буфера видеопамяти в стандартный вывод в
необработанном двоичном формате.
Подробнее об этом смотрите ниже в разделе
.Sx Формат дампа буфера видеопамяти .
.It Fl P
То же, что и
.Fl p ,
но сохраняет содержимое буфера видеопамяти в простом текстовом
формате, игнорируя непечатаемые символы и атрибуты символов.
.It Fl H
Используется совместно с
.Fl p
или
.Fl P
и указывает
.Nm
на то, что сохранять нужно полную историю буфера видеопамяти,
а не только видимую на экране часть.
.It Fl r Ar цвет_текста Ar цвет_фона
Меняет цвета инвертированного режима на
.Ar цвет_текста
и
.Ar цвет_фона .
.It Fl S Cm on | off
Разрешает или запрещает переключение между виртуальными терминалами (vty).
Когда переключение запрещено,
попытка переключиться на другой виртуальный терминал окончится неудачей.
(По умолчанию переключение между терминалами разрешено.)
Эта защита легко обходится, если ядро скомпилировано с опцией
.Dv DDB .
Хотя вам пожалуй не стоит включать отладчик ядра на системе,
которая должна быть физически безопасной.
.It Fl s Ar номер
Сделать виртуальный терминал, заданный аргументом
.Ar номер ,
текущим.
.It Fl t Ar N | Cm off
Задать время ожидания до запуска заставки экрана равным
.Ar N
секунд или отключить
.Pq Cm off
функцию заставки.
.It Fl x
Использовать при выводы шестнадцатеричные цифры.
.El
.Ss Поддержка видеорежимов
Следует учитывать, что не все перечисленные выше режимы могут
поддерживаться видеооборудованием.
С помощью опции
.Fl i Cm mode ,
можно проверить, какие из режимов поддерживаются данным видеооборудованием.
.Pp
Если вы собираетесь использовать видеорежимы VESA
или режимы со 132 столбцами, то необходимо либо
собрать ядро с поддержкой VESA BIOS, либо загрузить
соответствующий KLD модуль ядра
(см.\&
.Xr vga 4 ) .
.Pp
Если вы собираетесь использовать режимы VGA с 90 столбцами,
необходимо будет собрать ядро ядро с опцией
.Ar VGA_WIDTH90
(см.\&
.Xr vga 4 ) .
.Pp
Видеорежимы, отличные от режимов с 25 и 30 строками, могут потребовать
особого размера шрифта.
Для загрузки файла шрифта в ядро используйте описанную выше опцию
.Fl f .
Если требуемый размер шрифта не был загружен в ядро,
попытка пользователя переключиться в новый видеорежим с помощью
.Nm
окончится неудачей.
.Pp
.Bl -column "25 line modes" "8x16 (VGA), 8x14 (EGA)" -compact
.Sy Режимы Ta Sy Размер шрифта
.No 25 строк Ta 8x16 (VGA), 8x14 (EGA)
.No 30 строк Ta 8x16
.No 43 строк Ta 8x8
.No 50 строк Ta 8x8
.No 60 строк Ta 8x8
.El
.Pp
Имеет смысл всегда загружать все три размера (8x8, 8x14 и 8x16)
одного и того же шрифта.
.Pp
Для того, чтобы желаемые файлы шрифта автоматически загружались при
запуске системы, можно установить соответствующие переменные в
.Pa /etc/rc.conf
или
.Pa /etc/rc.conf.local .
Смотрите ниже.
.Pp
Чтобы можно было использовать растровый текстовый режим,
потребуется пересобрать ваше ядро с опцией
.Dv SC_PIXEL_MODE .
Более подробно об этой опции ядра читайте в
.Xr syscons 4 .
.Ss Формат дампа буфера видеопамяти
Для фиксации текущего содержимого буфера видеопамяти утилита
.Nm
использует
.Xr ioctl 2
.Dv CONS_SCRSHOT
драйвера
.Xr syscons 4 .
На стандартный вывод утилита
.Nm
выдаёт версию и дополнительную информацию, а затем
содержимое буфера видеопамяти.
.Pp
Видеопамять VGA обычно организована в виде пар байтов, по
одной паре на каждый символ экрана.
В каждой паре, первый байт задаёт код символа,
а второй \[en] атрибуты цвета этого символа.
.Pp
Байт атрибутов цвета VGA выглядит следующим образом:
.Pp
.Bl -column "X:X" "<00000000>" "ширина" "яркий цвет текста"
.Sy "биты		ширина	значение"
.Li "7	<X0000000>	1	мигание символа"
.Li "6:4	<0XXX0000>	3	цвет фона"
.Li "3	<0000X000>	1	яркий цвет текста"
.Li "2:0	<00000XXX>	3	цвет текста"
.El
.Pp
Ниже перечислены основные трёхбитные цвета:
.Pp
.Bl -hang -offset indent -compact
.It 0
Чёрный
.It 1
Синий
.It 2
Зелёный
.It 3
Морской волны
.It 4
Красный
.It 5
Фиолетовый
.It 6
Коричневый
.It 7
Белый
.El
.Pp
Основные цвета с установленным битом 3 (бит яркости текста):
.Pp
.Bl -hang -offset indent -compact
.It 0
Серый
.It 1
Светло-синий
.It 2
Светло-зелёный
.It 3
Голубой
.It 4
Светло-красный
.It 5
Малиновый
.It 6
Жёлтый
.It 7
Ярко-белый
.El
.Pp
Например, два байта
.Pp
.Dl "65 158"
.Pp
означают мигающую (установлен бит 7) заглавную A (код символа 65)
жёлтого цвета (биты 3:0) на синем фоне (биты 6:4).
.Pp
Выходные данные утилиты
.Nm
содержат небольшой заголовок с дополнительной информацией, которая
может быть полезна другим утилитам, обрабатывающим эти данные.
.Pp
Первые 10 байт всегда следуют в таком порядке:
.Bl -column "Диапазон байт" "Содержимое" -offset indent
.It Sy "Диапазон байт	Содержимое"
.It "С 1 по 8	Строка" Dq Li SCRSHOT_
.It "9	Номер версии формата файла"
.It "10	Оставшееся количество байт заголовка"
.El
.Pp
Последующие байты зависят от номера версии.
.Bl -column "Версия" "13 и выше" -offset indent
.It Sy "Версия	Байт	Значение"
.It "1	11	Ширина терминала, в символах"
.It "	12	Глубина терминала, в символах"
.It "	13 и выше	Данные снимка экрана"
.El
.Pp
Таким образом, дамп экрана размером 80x25 начинается так
(в шестнадцатеричном формате)
.Bd -literal -offset indent
53 43 52 53 48 4f 54 5f 01 02 50 19
----------------------- -- -- -- --
          |              |  |  |  ` Десятичное 25
          |              |  |  `--- Десятичное 80
          |              |  `------ Ещё 2 байта заголовка
          |              `--------- Формат файла версии 1
          `------------------------ Строка "SCRSHOT_"
.Ed
.Sh КОНФИГУРАЦИЯ ВИДЕО
.Ss Конфигурация времени загрузки
Для конфигурации видео во время загрузки системы предусмотрены
следующие переменные, которые можно установить в
.Pa /etc/rc.conf
или
.Pa /etc/rc.conf.local :
.Pp
.Bl -tag -width foo_bar_var -compact
.It Ar blanktime
Задаёт значение времени ожидания для опции
.Fl t .
.It Ar font8x16 , font8x14 , font8x8
Задаёт файлы шрифтов для опции
.Fl f .
.It Ar scrnmap
Задаёт имя файла карты экранного вывода для опции
.Fl l .
.El
.Pp
Подробнее смотрите в
.Xr rc.conf 5 .
.Ss Конфигурация драйвера
Драйвер видеокарты может предоставлять вам возможность менять
опции конфигурации по умолчанию, такие как шрифт, чтобы вам
не пришлось настраивать их во время загрузки.
Подробнее об этом смотрите в документации по драйверу
видеокарты, например
.Xr vga 4 .
.Sh ФАЙЛЫ
.Bl -tag -width /usr/share/syscons/scrnmaps/foo-bar -compact
.It Pa /usr/share/syscons/fonts/*
файлы шрифтов.
.It Pa /usr/share/syscons/scrnmaps/*
файлы карт экранного вывода.
.El
.Sh ПРИМЕРЫ
Чтобы загрузить в ядро шрифт
.Pa /usr/share/syscons/fonts/iso-8x16.fnt ,
запустите
.Nm
так:
.Pp
.Dl vidcontrol -f 8x16 /usr/share/syscons/fonts/iso-8x16.fnt
.Pp
Поскольку файл шрифта находится в каталоге
.Pa /usr/share/syscons/fonts ,
можно сократить имя файла до
.Pa iso-8x16 :
.Pp
.Dl vidcontrol -f 8x16 iso-8x16
.Pp
Более того, вы также можете не указывать размер шрифта
.Dq Li 8x16 :
.Pp
.Dl vidcontrol -f iso-8x16
.Pp
И наконец, суффикс указывающий размер шрифта также может
быть опущен.
В таком случае
.Nm
будет использовать размер шрифта, используемого в настоящий момент:
.Pp
.Dl vidcontrol -f iso
.Pp
Аналогично может быть сокращено имя файла карты экранного вывода,
передаваемое опции
.Fl l ,
если файл находится в каталоге
.Pa /usr/share/syscons/scrnmaps .
.Pp
.Dl vidcontrol -l iso-8859-1_to_cp437
.Pp
Упомянутая выше команда загрузит
.Pa /usr/share/syscons/scrnmaps/iso-8859-1_to_cp437.scm .
.Pp
Следующая команда установит растровый текстовый режим 100x37 (используется на
некоторых моделях ЖКД):
.Pp
.Dl vidcontrol -g 100x37 VESA_800x600
.Pp
Следующая команда фиксирует содержимое буфера видеопамяти первого
виртуального терминала и записывает его в файл
.Pa shot.scr :
.Pp
.Dl vidcontrol -p < /dev/ttyv0 > shot.scr
.Pp
Следующая команда выдаст содержимое буфера видеопамяти четвёртого
виртуального терминала на стандартный вывод в удобочитаемом формате:
.Pp
.Dl vidcontrol -P < /dev/ttyv3
.Sh СМОТРИ ТАКЖЕ
.Xr kbdcontrol 1 ,
.Xr vidfont 1 ,
.Xr keyboard 4 ,
.Xr screen 4 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr rc.conf 5 ,
.Xr kldload 8 ,
.Xr moused 8 ,
.Xr watch 8
.Pp
Различные утилиты
.Pa scr2*
в категориях
.Pa graphics
и
.Pa textproc
из
.Em "коллекции портов" .
.Sh АВТОРЫ
.An S\(/oren Schmidt Aq sos@FreeBSD.org
.An Sascha Wildner
.Sh ПОМОЩНИКИ
.An Maxim Sobolev Aq sobomax@FreeBSD.org ,
.An Nik Clayton Aq nik@FreeBSD.org
