<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy, see www.w3.org" />
<title>FreeBSD 5.3-RELEASE Migrationsleitfaden</title>
<meta name="GENERATOR" content="Modular DocBook HTML Stylesheet Version 1.7" />
<link rel="STYLESHEET" type="text/css" href="docbook.css" />
<meta http-equiv="Content-Type" content='text/html; charset="iso-8859-1"' />
</head>
<body class="ARTICLE" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#840084"
alink="#0000FF">
<div class="ARTICLE">
<div class="TITLEPAGE">
<h1 class="TITLE"><a id="AEN2" name="AEN2">FreeBSD 5.3-RELEASE
Migrationsleitfaden</a></h1>

<div class="AUTHORGROUP"><a id="AEN4" name="AEN4"></a>
<h3 class="CORPAUTHOR">The FreeBSD Release Engineering Team</h3>
</div>

<p class="COPYRIGHT">Copyright &copy; 2002, 2003, 2004 The FreeBSD Release Engineering
Team</p>

<p class="PUBDATE">$FreeBSD$<br />
</p>

<div class="LEGALNOTICE"><a id="TRADEMARKS" name="TRADEMARKS"></a>
<p>FreeBSD ist ein eingetragenes Warenzeichen von Wind River Systems, Inc. Dies soll sich
bald &auml;ndern.</p>

<p>Apple, FireWire, Mac, Macintosh, Mac OS, Quicktime und TrueType sind eingetragene
Warenzeichen von Apple Computer, Inc., in den Vereinigten Staaten und anderen
L&auml;ndern.</p>

<p>IBM, AIX, EtherJet, Netfinity, OS/2, PowerPC, PS/2, S/390 und ThinPad sind
Warenzeichen der International Business Machines Corporation in den Vereinigten Staaten,
anderen L&auml;ndern oder beiden.</p>

<p>IEEE, POSIX und 802 sind eingetragene Warenzeichen vom Institute of Electrical and
Electronics Engineers, Inc. in den Vereinigten Staaten.</p>

<p>Intel, Celeron, EtherExpress, i386, i486, Itanium, Pentium und Xeon sind Warenzeichen
oder eingetragene Warenzeichen der Intel Corporation oder ihrer Gesellschaften in den
Vereinigten Staaten und in anderen L&auml;ndern.</p>

<p>Microsoft, FrontPage, MS-DOS, Outlook, Windows, Windows Media und Windows NT sind
entweder eingetragene Warenzeichen oder Warenzeichen der Microsoft Corporation in den
Vereinigten Staaten und/oder in anderen L&auml;ndern.</p>

<p>Sparc, Sparc64, SPARCEngine und UltraSPARC sind Warenzeichen von SPARC International,
Inc in den Vereinigten Staaten und in anderen L&auml;ndern. Produkte, die das
Warenzeichen SPARC tragen, basieren auf einer von Sun Microsystems, Inc. entwickelten
Architektur.</p>

<p>Viele Produktbezeichnungen von Herstellern und Verk&auml;ufern sind Warenzeichen.
Soweit dem FreeBSD Project das Warenzeichen bekannt ist, werden die in diesem Dokument
vorkommenden Bezeichnungen mit dem Symbol ``&trade;'' oder dem Symbol ``&reg;''
gekennzeichnet.</p>
</div>

<div>
<div class="ABSTRACT"><a id="AEN23" name="AEN23"></a>
<p>Dieser Leitfaden beschreibt die wesentlichen Unterschiede zwischen FreeBSD&nbsp;4.<var
class="REPLACEABLE">X</var> und FreeBSD 5.3-RELEASE aus Sicht eines Benutzers oder
Administrators, der ein existierendes System aktualisiert. Der Leitfaden beschreibt kurz
die vor und w&auml;hrend einer Ver&ouml;ffentlichung ablaufenden Prozesse. Danach
beschreibt er die neuen Funktionen in FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var>
sowie &Auml;nderungen, die relevant f&uuml;r Benutzer sind, die bisher mit 4.<var
class="REPLACEABLE">X</var> Releases gearbeitet haben. Weiterhin beschreibt der Leitfaden
wie existierende Systeme mit Hilfe der Quellen oder mit Hilfe von Bin&auml;rcode migriert
werden. Dieses Dokument erschien vor FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var>
unter dem Titel ``Hinweise f&uuml;r die ersten Anwender von
FreeBSD&nbsp;5.3-RELEASE''.</p>
</div>
</div>

<hr />
</div>

<div class="SECT1">
<h2 class="SECT1"><a id="INTRO" name="INTRO">1. Einf&uuml;hrung</a></h2>

<p>Mit FreeBSD&nbsp;5.3-RELEASE startet eine neue Serie von ``FreeBSD-STABLE'' Releases.
Diese Release und k&uuml;nftige Releases der 5.<var class="REPLACEABLE">X</var>-Serie
sind wie die vorhergehenden 4.<var class="REPLACEABLE">X</var>-Releases f&uuml;r den
produktiven Einsatz gedacht.</p>

<p>Dieser Artikel wendet sich an Benutzer, die von 4.<var
class="REPLACEABLE">X</var>-Release auf 5.3-RELEASE migrieren. Zuerst wird beschrieben,
wie eine neue FreeBSD-Version ver&ouml;ffentlicht wird. Anschlie&szlig;end werden einige
der neuen Funktionen in FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> beschrieben. Der
wahrscheinlich wichtigste Abschnitt beschreibt die wesentlichen &Auml;nderungen, f&uuml;r
Benutzer sichtbare &Auml;nderungen oder &Auml;nderungen an externen Schnittstellen.
Zuletzt gibt der Artikel Hinweise, wie bestehende FreeBSD&nbsp;4.<var
class="REPLACEABLE">X</var>-Systeme mit Bin&auml;rcode oder mit den Quellen auf
FreeBSD&nbsp;5.3-RELEASE migriert werden.</p>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="RELEASE-OVERVIEW" name="RELEASE-OVERVIEW">2.
Ver&ouml;ffentlichung neuer FreeBSD-Versionen</a></h2>

<p>Das Prinzip der FreeBSD-Entwicklung ist die Verwendung mehrerer Entwicklungszweige
innerhalb eines ``CVS Repository''. Der Hauptzweig wird ``CURRENT'' genannt und innerhalb
des Repository mit dem symbolischen Namen <var class="LITERAL">HEAD</var> referenziert.
Neue Funktionen werden zun&auml;chst in diesen Zweig eingebracht. Auch wenn neue
Funktionen zuerst nur in CURRENT zur Verf&uuml;gung stehen, bereitet dieser Zweig von
Zeit zu Zeit Kummer, w&auml;hrend die Neuerungen getestet und ihre Fehler entfernt
werden.</p>

<p>Wenn eine neue FreeBSD-Version ver&ouml;ffentlicht wird, basiert diese in der Regel
auf einem der ``STABLE'' (stabil) genannten Entwicklungszweige. Neuerungen werden in
diese Entwicklungszweige &uuml;bernommen, nachdem sie in CURRENT getestet wurden. In den
letzten zwei Jahren gab es nur einen aktiven STABLE-Entwicklungszweig: ``4-STABLE'';
dieser Zweig war die Grundlage f&uuml;r alle 4.<var class="REPLACEABLE">X</var>
Versionen. Dieser Zweig wird innerhalb des CVS Repository durch den symbolischen Namen
<var class="LITERAL">RELENG_4</var> gekennzeichnet.</p>

<p>Die letzten beiden STABLE-Entwicklungszweige (3-STABLE und 4-STABLE) wurden sehr
fr&uuml;h im Entwicklungsablauf (verzweigt wurde bei 3.1 und 4.0) erzeugt.
R&uuml;ckblickend m&uuml;ssen wir feststellen, da&szlig; dadurch in beiden F&auml;llen
nicht genug Zeit war, um CURRENT zu stabilisieren, bevor der neue Entwicklungszweig
eingerichtet wurde. Dies f&uuml;hrte zu unn&ouml;tiger Mehrarbeit, da Fehlerkorrekturen
von einem Zweig in den anderen Zweig &uuml;bertragen werden mu&szlig;ten; au&szlig;erdem
kam es zu einigen &Auml;nderungen in der Architektur, die nicht in den jeweils anderen
Zweig &uuml;bernommen werden konnten.</p>

<p>Die 5.<var class="REPLACEABLE">X</var>-Releases wurden anders gehandhabt.
FreeBSD&nbsp;5.0, 5.1 und 5.2 wurden auf dem CURRENT-Zweig erzeugt. Das erste dieser
Releases wurde nach einer Entwicklungszeit von &uuml;ber zwei Jahren herausgegeben (das
letzte Release aus HEAD war FreeBSD&nbsp;4.0 im M&auml;rz&nbsp;2000).</p>

<p>Der ``5-STABLE-Zweig'' wurde im Gegensatz zu anderen ``STABLE-Zweigen'' erst ein Jahr
nach dem ersten 5.<var class="REPLACEABLE">X</var>-Release im CVS mit dem Tag <var
class="LITERAL">RELENG_5</var> erzeugt (w&auml;hrend der Erstellung des 5.3 Releases).
Diese Verz&ouml;gerung gab den Entwicklern Zeit, &Auml;nderungen an der Architektur
vorzunehmen, die &Auml;nderungen zu stabilisieren, Schnittstellen fertigzustellen und
damit einen guten Ausgangspunkt f&uuml;r weitere 5.<var
class="REPLACEABLE">X</var>-Releases zu schaffen.</p>

<p>Abgesehen von allgemeinen Verbesserungen und Fehlerbehebungen liegt die Priorit&auml;t
bei der Entwicklung des 5-STABLE-Zweiges in der Beibehaltung der Application Binary
Interface (ABI) und der Kompatibilit&auml;t der Application Program Interface (API).
&Auml;nderungen, die die R&uuml;ckw&auml;rtskompatibilit&auml;t gef&auml;hrden, sind mit
Ausnahme von Fehlerbehebungen f&uuml;r kritische Fehler nicht erlaubt.</p>

<p>Das n&auml;chste CURRENT-Release aus dem CVS <var class="LITERAL">HEAD</var> wird
6.0-RELEASE sein. Zum Zeitpunkt von 5.3-Release steht noch nicht fest, wann 6.0
ver&ouml;ffentlicht wird, es wird mit dem Jahr&nbsp;2006 gerechnet.</p>

<p>Die Entwicklung des 4-STABLE-Zweiges wird begrenzt weitergef&uuml;hrt und es wird noch
mindestens ein Release (4.11) nach 5.3-RELEASE geben. F&uuml;r besonders konservative
Anwender ist es sinnvoll, 4.<var class="REPLACEABLE">X</var>-Releases noch einige Zeit
weiter zu benutzen. Releases aus dem 4-STABLE-Zweig werden weiterhin vom Security Officer
Team <code class="EMAIL">&#60;<a
href="mailto:security-officer@FreeBSD.org">security-officer@FreeBSD.org</a>&#62;</code>
unterst&uuml;tzt. Die Wartungsenden finden Sie auf der Seite <a
href="http://www.FreeBSD.org/de/security/index.html" target="_top">Sicherheit</a> des
FreeBSD-Webauftritts.</p>

<p>Weitere Informationen &uuml;ber den Ablauf bei der Ver&ouml;ffentlichung einer neuen
FreeBSD Version finden Sie auf den <a href="http://www.FreeBSD.org/releng/index.html"
target="_top">Release Engineering Web pages</a> und im Artikel <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/articles/releng/index.html"
target="_top">FreeBSD Release Engineering</a>.</p>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="NEW" name="NEW">3. Neuerungen</a></h2>

<p>Die Glanzpunkte von FreeBSD 5.<var class="REPLACEABLE">X</var> sind die vielen
Neuerungen. Diese Neuerungen und die neue Funktionalit&auml;t basieren zum
gr&ouml;&szlig;ten Teil auf massiven &Auml;nderungen der Systemarchitektur, die nicht in
den Entwicklungszweig 4-STABLE eingepflegt wurden. Viele in sich abgeschlossene
&Auml;nderungen wie neue oder aktualisierte Ger&auml;tetreiber oder neue
Benutzerprogramme wurden dagegen schon nach 4-STABLE &uuml;bernommen. Die folgende Liste
enth&auml;lt eine kurze &Uuml;bersicht &uuml;ber die wichtigsten Neuerungen:</p>

<ul>
<li>
<p>SMPng: Die ``n&auml;chste Generation'' der Unterst&uuml;tzung f&uuml;r
Mehrprozessorsysteme (SMP). Die Arbeit konzentriert sich zur Zeit darauf, Locks f&uuml;r
m&ouml;glichst kleine Bereiche der diversen Subsysteme des Kernels zu implementieren,
damit m&ouml;glichst viele Vorg&auml;nge (Threads) gleichzeitig im Kernel ablaufen
k&ouml;nnen. Dabei wurde besonderes auf die Geschwindigkeit des Netzwerk-Stacks geachtet.
Weitere Informationen finden Sie auf den Seiten des <a
href="http://www.FreeBSD.org/smp/index.html" target="_top">FreeBSD SMP Project</a>.</p>
</li>

<li>
<p>KSE: Die ``Kernel Scheduled Entities'' erlauben es einem Prozess, mehrere Threads auf
Kernel-Ebene zu nutzen, analog zur Aktivierung via Scheduler. Die Bibliotheken <tt
class="FILENAME">libpthread</tt> und <tt class="FILENAME">libthr</tt> erlauben auch
normalen Programmen mit mehreren Threads, diese Erweiterung &uuml;ber die <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=pthread&sektion=3&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">pthread</span>(3)</span></a> API
zu nutzen. Die voreingestellte Thread-Library ist nun <tt
class="FILENAME">libpthread</tt>.</p>
</li>

<li>
<p>Neue Plattformen: Zus&auml;tzlich zu i386 und alpha werden jetzt auch amd64, ia64,
pc98 und sparc64 Systeme unterst&uuml;tzt. An den Plattformen powerpc (l&auml;uft auf
<span class="TRADEMARK">PowerPC</span>&reg;-basierenden Systemen von <span
class="TRADEMARK">Macintosh</span>&reg;) und arm wird gearbeitet.</p>
</li>

<li>
<p>GCC: Der Compiler und die dazugeh&ouml;rigen Werkzeuge basieren jetzt auf GCC 3.4.<var
class="REPLACEABLE">X</var> und nicht mehr auf GCC 2.95.<var
class="REPLACEABLE">X</var>.</p>
</li>

<li>
<p>MAC: Unterst&uuml;tzung f&uuml;r erweiterbare ``Mandatory Access Control''
Regelwerke.</p>
</li>

<li>
<p>GEOM: Ein flexibles, modulares Ger&uuml;st zur Manipulation des Datentransfers von und
zu Festplatten. Das System bietet einige Funktionen f&uuml;r Laufwerke: Erkennen von
Partitionen, <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=gbde&sektion=4&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">gbde</span>(4)</span></a> ein
Modul zur Verschl&uuml;sselung des Festplatteninhaltes, verschiedene RAID-Level, den
Export von Laufwerken (mit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ggated&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ggated</span>(8)</span></a> und
verwandten Werkzeugen) und transparenter Dekompression von Laufwerken.</p>
</li>

<li>
<p>FFS: Das Dateisystem unterst&uuml;tzt jetzt Hintergrund-<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=fsck&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">fsck</span>(8)</span></a> (um das
System nach einem Absturz schneller verf&uuml;gbar zu machen) sowie
``Schnappsch&uuml;sse''.</p>
</li>

<li>
<p>UFS2: Dieses neue Dateisystem unterst&uuml;tzt gr&ouml;&szlig;ere Dateien und
zus&auml;tzliche Dateiberechtigungen. <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=newfs&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">newfs</span>(8)</span></a> erzeugt
jetzt standardm&auml;&szlig;ig UFS2 Dateisysteme und auf allen Plattformen au&szlig;er
pc98 gilt dies auch f&uuml;r Dateisysteme, die mit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sysinstall</span>(8)</span></a>
erzeugt werden.</p>
</li>

<li>
<p>Neue Netzwerkfunktionen: In den 5.<var class="REPLACEABLE">X</var>-Releases wurden
neue Funktionen hinzugef&uuml;gt, unter anderem: Unterst&uuml;tzung f&uuml;r TCP SACK
(selective acknowledgements), der <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=pf&sektion=4&manpath=FreeBSD+5.3-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">pf</span>(4)</span></a> Paketfilter von
OpenBSD und das ALTQ Packet Queueing System.</p>
</li>

<li>
<p>Neue Hardware: Es wird mehr Hardware, wie Cardbus, Bluetooth-Ger&auml;te und IEEE
802.11a/b/g Netzwerkkarten auf Basis von Atheros-Chips&auml;tzen, unterst&uuml;tzt. Auf
i386-Systemen k&ouml;nnen mit Hilfe des <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=ndis&sektion=4&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">ndis</span>(4)</span></a>-Treibers
einige Netzwerkkarten, f&uuml;r die es keinen FreeBSD-Treiber gibt, mit dem Treiber
f&uuml;r <span class="TRADEMARK">Microsoft</span>&reg; <span
class="TRADEMARK">Windows</span>&reg; benutzt werden.</p>
</li>
</ul>

<p>Eine ausf&uuml;hrlichere &Uuml;bersicht &uuml;ber die Neuerungen finden Sie in den
``Release Notes'' f&uuml;r die verschiedenen FreeBSD 5.<var class="REPLACEABLE">X</var>
Versionen.</p>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="DRAWBACKS" name="DRAWBACKS">4. Beachtenswerte
&Auml;nderungen</a></h2>

<p>Einige der Unterschiede zwischen FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var> und
FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> m&uuml;ssen besonders herausgestellt
werden, das sie &Auml;nderungen der Architektur sind oder nicht
r&uuml;ckw&auml;rtskompatibel sind. Auch wenn diese &Auml;nderungen keinen Datenverlust
verursachen, k&ouml;nnen sie doch zu Verwirrung f&uuml;hren. Einige beachtenswerte
&Auml;nderungen sind in der folgenden Liste zusammengefa&szlig;t:</p>

<ul>
<li>
<p>Einige Teile des FreeBSD Basissystems wurden in die Ports Collection verschoben, weil
sie so leichter zu warten sind oder weil sie nicht wirklich ein essentieller Bestandteil
des Basissystems waren. Dazu geh&ouml;rt insbesondere <b class="APPLICATION">Perl</b> (in
der Ports-Collection unter <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/lang/perl5.8/pkg-descr"><tt
class="FILENAME">lang/perl5.8</tt></a>), das wegen der Lage im Basissystem
Aktualisierungen des Systems erschwerte. Werkzeuge des Basissystems, die fr&uuml;her auf
<b class="APPLICATION">Perl</b> angewiesen waren, wurden entweder neu geschrieben (wenn
sie noch gebraucht werden) oder entfernt (weil sie &uuml;berfl&uuml;ssig sind).</p>

<p>Weitere Beispiele sind <b class="APPLICATION">UUCP</b> (in den Ports unter <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/net/freebsd-uucp/pkg-descr"><tt
class="FILENAME">net/freebsd-uucp</tt></a>), das Werkzeug <tt class="COMMAND">doscmd</tt>
und viele der althergebrachten Spiele (<a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/games/freebsd-games/pkg-descr"><tt
class="FILENAME">games/freebsd-games</tt></a>).</p>
</li>

<li>
<p>Durch die &Auml;nderungen in den Datenstrukturen des Kernels und der Schnittstellen
f&uuml;r Anwendungen und Programmierer (ABI/API), mu&szlig;ten Treiber anderer Hersteller
angepa&szlig;t werden, damit sie korrekt mit FreeBSD&nbsp;5.<var
class="REPLACEABLE">X</var> 5.0 zusammenarbeiten. In einigen (hoffentlich seltenen)
F&auml;llen haben sich f&uuml;r den Anwender sichtbare Datenstrukturen ge&auml;ndert, die
es erfordern, Anwendungen neu zu kompilieren und/oder Ports und Pakete neu zu
installieren. Wie schon in den 4.<var class="REPLACEABLE">X</var>-Releases will das
FreeBSD-Entwicklerteam inkompatible &Auml;nderungen in k&uuml;nftigen Releases auf dem
5.<var class="REPLACEABLE">X</var>-Zweig verhindern.</p>
</li>

<li>
<p>Einige Teile des FreeBSD-Basissystems wurden nicht mehr gepflegt, weil es nicht
gen&uuml;gend Anwender und/oder Entwickler gab. Diese Teile wurden entfernt. dazu
z&auml;hlen unter anderem die Erzeugung von Programmen im Format <tt
class="FILENAME">a.out</tt>, <a id="AEN161" name="AEN161" href="#FTN.AEN161"><span
class="footnote">[1]</span></a> die XNS-Netzwerkprotokolle und der Treiber f&uuml;r den
X-10 Controller. Einige Treiber f&uuml;r alte ISA-Karten waren kaputt und wurden
entfernt. Einzelheiten entnehmen Sie bitte den Release-Notes.</p>
</li>

<li>
<p>Unter FreeBSD/i386 4.<var class="REPLACEABLE">X</var> wurden ISA-Ger&auml;te in der
Kernelkonfigurationsdatei konfiguriert. Die Konfiguration konnte beim Systemstart mit dem
interaktiven Werkzeug <b class="APPLICATION">UserConfig</b> ge&auml;ndert werden. Unter
FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> wurden beide Mechanismen durch <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=device.hints&sektion=5&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">device.hints</span>(5)</span></a>
ersetzt. Dadurch m&uuml;ssen ISA-Ger&auml;te nicht mehr fest im Kernel konfiguriert
werden. Die Konfiguration von ISA-Ger&auml;ten zur Zeit des Systemstarts ist nicht mehr
men&uuml;gef&uuml;hrt, sondern wird im Boot-Loader vorgenommen.</p>
</li>

<li>
<p>Es gibt kein <tt class="FILENAME">MAKEDEV</tt> mehr und es wird auch nicht mehr
ben&ouml;tigt. FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> benutzt ein spezielles
Dateisystem f&uuml;r Ger&auml;te, das die entsprechenden Ger&auml;tedateien bei Bedarf
automatisch erzeugt. Ger&auml;tedateien werden mit dem Werkzeug <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=devfs&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">devfs</span>(8)</span></a> oder
&uuml;ber die Datei <tt class="FILENAME">/etc/devfs.conf</tt> konfiguriert. Weiteres
entnehmen Sie bitte der Hilfeseite <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=devfs&sektion=5&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">devfs</span>(5)</span></a>.</p>
</li>

<li>
<p>Alle mit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=newfs&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">newfs</span>(8)</span></a>
erzeugten Dateisysteme werden standardm&auml;&szlig;ig im Format UFS2 angelegt. Dies gilt
auf allen Plattformen au&szlig;er pc98 auch f&uuml;r Dateisysteme, die mit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sysinstall</span>(8)</span></a>
erzeugt werden. Da FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var> nur UFS1 lesen kann,
m&uuml;ssen alle Dateisysteme, die sowohl mit 4.<var class="REPLACEABLE">X</var> als auch
mit 5.<var class="REPLACEABLE">X</var> nutzbar sein sollen, im Format UFS1 erzeugt
werden. In <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=newfs&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">newfs</span>(8)</span></a> steht
dazu die Option <var class="OPTION">-O1</var> zur Verf&uuml;gung, auch <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sysinstall</span>(8)</span></a>
enth&auml;lt eine entsprechende Option. Dieser Fall tritt typischerweise auf Systemen
auf, auf denen 4.<var class="REPLACEABLE">X</var> und 5.<var class="REPLACEABLE">X</var>
installiert und abwechselnd betrieben werden. Bitte beachten Sie, da&szlig; es kein
Programm zur Umwandlung von UFS1 nach UFS2 (oder umgekehrt) gibt, nur die Variante
Backup, Formatieren, Restore.</p>
</li>

<li>
<p>Wegen des aktualisierten <b class="APPLICATION">GCC</b> Compilers m&uuml;ssen generell
alle C++ Programme neu &uuml;bersetzt und neu installiert werden. Die Ursache sind
ABI-&Auml;nderungen in C++.</p>
</li>

<li>
<p>Es ist zwar m&ouml;glich, f&uuml;r 4.<var class="REPLACEABLE">X</var> geschriebene
Programme unter 5.<var class="REPLACEABLE">X</var> zu nutzen, allerdings mu&szlig; dazu
die Distribution <tt class="FILENAME">compat4x</tt> (oder der Port <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/misc/compat4x/pkg-descr"><tt
class="FILENAME">misc/compat4x</tt></a>) installiert sein. Wenn aber einer der
installierten Ports aktualisiert werden muss, empfehlen wir generell <span
class="emphasis"><i class="EMPHASIS">alle</i></span> installierten Ports neu zu bauen und
neu zu installieren. Dies verhindert Probleme mit Programmen, die gegen eine Mischung aus
neuen und alten Bibliotheken gebunden sind. Das Werkzeug <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/sysutils/portupgrade/pkg-descr"><tt
class="FILENAME">sysutils/portupgrade</tt></a> kann Ihnen bei der Neuinstallation von
Ports behilflich sein.</p>

<p>Es gibt Ports, die nicht r&uuml;ckw&auml;rtskompatibel sind, beispielsweise <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/devel/gnomevfs2/pkg-descr"><tt
class="FILENAME">devel/gnomevfs2</tt></a>, <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/mail/postfix/pkg-descr"><tt
class="FILENAME">mail/postfix</tt></a> und <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/security/cfs/pkg-descr"><tt
class="FILENAME">security/cfs</tt></a>. Diese Ports m&uuml;ssen wegen &Auml;nderungen in
der <var class="LITERAL">statfs</var>-Struktur neu &uuml;bersetzt werden.</p>
</li>

<li>
<p>Die Datei <tt class="FILENAME">host.conf</tt>, mit der Namensdienste (Resolver)
konfiguriert wurden, ist durch die (allgemeinere) Datei <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=nsswitch.conf&sektion=5&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">nsswitch.conf</span>(5)</span></a>
ersetzt worden.</p>
</li>

<li>
<p><b class="APPLICATION">BIND</b> wurde von Version&nbsp;8 auf die Version&nbsp;9
aktualisiert. Zwischen BIND&nbsp;8 und BIND&nbsp;9 gibt es viele Unterschiede. Wenn Sie
<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=named&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">named</span>(8)</span></a>
produktiv einsetzen, sollten Sie die Migrationsanleitung <tt
class="FILENAME">/usr/share/doc/bind9/misc/migration</tt> lesen. Im Verzeichnis <tt
class="FILENAME">/usr/share/doc/bind9/arm</tt> befindet sich das neue
Adminstrator-Handbuch. Benutzer mit bestehenden <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=named&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span
class="REFENTRYTITLE">named</span>(8)</span></a>-Konfigurationen sollten das Verzeichnis
<tt class="FILENAME">/var/named</tt> vor der Migration sichern. Dies verhindert,
da&szlig; Dateien vom <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=named&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span
class="REFENTRYTITLE">named</span>(8)</span></a>-Startskript &uuml;berschrieben
werden.</p>
</li>

<li>
<p>Ab 5.3-RELEASE ist in FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> <b
class="APPLICATION">Xorg</b> als X-Window-System voreingestellt. Zur Zeit bleibt <b
class="APPLICATION"><span class="TRADEMARK">XFree86</span>&#8482;</b> die Vorgabe
f&uuml;r FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var>. Die Unterschiede zwischen
beiden Versionen und eine Migrationsanleitung f&uuml;r bestehende Systeme beschreibt das
Kapitel <a href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/x11.html"
target="_top">Das X-Window-System</a> des Handbuchs.</p>
</li>

<li>
<p>Die Dokumentation (wie z.B. das FreeBSD <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/index.html"
target="_top">Handbuch</a> und der <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/faq/index.html"
target="_top">FAQ</a>) ist teilweise noch nicht auf dem Stand von FreeBSD&nbsp;5.<var
class="REPLACEABLE">X</var>.</p>
</li>
</ul>

<p>Weitere Informationen enthalten die Release-Notes der verschiedenen
FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> Releases und die Datei <tt
class="FILENAME">src/UPDATING</tt> im FreeBSD-Quellbaum. Beachtenswerte &Auml;nderungen
der Ports-Collection werden in den Dateien <tt class="FILENAME">ports/UPDATING</tt> und
<tt class="FILENAME">ports/CHANGES</tt> im Ports-Baum beschrieben.</p>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="UPGRADE" name="UPGRADE">5. Hinweise f&uuml;r die Aktualisierung
von FreeBSD 4.<var class="REPLACEABLE">X</var></a></h2>

<p>Dieses Kapitel enth&auml;lt Hinweise f&uuml;r Anwender, die ihr bestehendes FreeBSD
4.<var class="REPLACEABLE">X</var> System auf FreeBSD 5.<var class="REPLACEABLE">X</var>
aktualisieren wollen. Wie bei jeder Aktualisierung ist es auf jeden Fall notwendig,
vorher die Release Notes und die Errata der neuen Version zu lesen; bei Aktualisierung
&uuml;ber den Quellcode ist <tt class="FILENAME">src/UPDATING</tt>
Pflichtlekt&uuml;re.</p>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN268" name="AEN268">5.1. Aktualisierung ohne
Quellcode</a></h3>

<p>Der einfachste Ansatz ist immer noch ``Sicherheitskopien erstellen, Platte
formatieren, neues System installieren, Benutzerdaten wieder einspielen''. Dadurch werden
alle Probleme mit veralteten und nicht kompatiblen Programmen und Konfigurationsdateien
umgangen. Die neuen Dateisysteme k&ouml;nnen maximalen Nutzen aus den diversen Neuerungen
(speziell UFS2) ziehen.</p>

<p>Zum gegenw&auml;rtigen Zeitpunkt ist die ``Upgrade''-Option in <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sysinstall</span>(8)</span></a>
zur Migration auf eine neue Hauptversion unzureichend getestet. Wir raten daher dringend
von der Verwendung dieser Funktion ab.</p>

<p>Einige &Auml;nderungen betreffen vielleicht Benutzer der FreeBSD&nbsp; 4.<var
class="REPLACEABLE">X</var> Startmedien. Die Installationsdisketten sind (auf
Plattformen, wie i386, die Disketten unterst&uuml;tzen) anders aufgebaut. Unter 4.<var
class="REPLACEABLE">X</var> Releases enthielten die Startdisketten einen Mini-Kernel, der
gerade ausreichte, um das System zu installieren. Mit dieser Aufteilung konnte der Kernel
auf einer einzigen Diskette gespeichert werden, doch fehlten unter Umst&auml;nden Treiber
f&uuml;r bestimmte Hardware-Konfigurationen. Ab FreeBSD 5.3-RELEASE enthalten die
Startdisketten einen <var class="LITERAL">GENERIC</var>-Kernel, der &uuml;ber mehrere
Disketten verteilt ist und mehr Treiber und mehr Funktionen enth&auml;lt. Der Boot-Loader
fordert das Einlegen weiterer Disketten an. Benutzer, die Installationsdisketten
herunterladen (vielleicht um eine Netzwerkinstallation durchzuf&uuml;hren), sollten
beachten, da&szlig; es jetzt drei Installationsdisketten gibt: <tt
class="FILENAME">boot.flp</tt>, <tt class="FILENAME">kern1.flp</tt> und <tt
class="FILENAME">kern2.flp</tt>.</p>

<p>Bei einer Installation von CD-ROM auf einem <span
class="TRADEMARK">i386</span>&#8482;-System wird jetzt ein neues Startprogramm mit dem
Namen ``no-emulation boot loader'' genutzt. Dadurch ist es unter anderem m&ouml;glich,
auf der CD den Standardkernel (<var class="LITERAL">GENERIC</var>) statt des auf den
Disketten verwendeten Mini-Kernels zu nutzen. Jedes System, das von den Installations-CDs
f&uuml;r <span class="TRADEMARK">Microsoft</span> <span
class="TRADEMARK">Windows&nbsp;NT</span>&reg;&nbsp;4.0 booten kann, sollte auch mit den
FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> CD-ROMs zurechtkommen.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN291" name="AEN291">5.2. Aktualisierung mit Quellcode</a></h3>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Viele Benutzer und Entwickler bevorzugen eine einfachere Art der
Installation. Sichern Sie alle Daten und Konfigurationsdateien und installieren Sie das
System mit Bin&auml;rdateien (beispielsweise von einer CD-ROM). Spielen Sie
anschlie&szlig;end die gesicherten Daten zur&uuml;ck. Verglichen mit einer Installation
&uuml;ber den Quellcode, m&uuml;ssen Sie sich bei diesem Verfahren nicht um alte Dateien
und Programme k&uuml;mmern und Sie k&ouml;nnen neue Funktionen, wie das UFS2-Dateisystem
benutzen.</p>

<p>Benutzer, die nicht mit der Bauprozedur (<var class="LITERAL">buildworld</var>/<var
class="LITERAL">installworld</var>) vertraut sind, sollten <span class="emphasis"><i
class="EMPHASIS">nicht</i></span> mit dem Quellcode aktualisieren und stattdessen nach
einer Datensicherung mit Bin&auml;rdateien installieren.</p>
</blockquote>
</div>

<p>Eine Aktualisierung mit Quellcode baut und installiert Bin&auml;rdateien aus lokal auf
der Maschine liegenden Quellcode. Die Aktualisierung beruht auf der <var
class="LITERAL">buildworld</var>/<var class="LITERAL">installworld</var> Prozedur, die
von erfahrenen Benutzern verwendet wird, um &Auml;nderungen in einem Entwicklungszweig
(wie FreeBSD-STABLE oder FreeBSD-CURRENT) zu verfolgen. Allgemein ist diese Prozedur
aufwendiger als die Installation mit Bin&auml;rdateien, sie kann aber n&uuml;tzlich sein,
wenn die Systemkonfiguration komplex oder stark angepa&szlig;t ist. Eine Aktualisierung
mit Quellcode ist auch n&uuml;tzlich f&uuml;r ein entferntes System, auf das der
Administrator keinen Zugriff hat und daher auch keine Installationsmedien einlegen
kann.</p>

<p>Es ist auf jeden Fall erforderlich, vor der Aktualisierung <tt
class="FILENAME">src/UPDATING</tt> zu lesen. Der Abschnitt ``To upgrade in-place from
4.x-stable to current'' enth&auml;lt eine Schritt-f&uuml;r-Schritt Anleitung, der Sie
unbedingt folgen m&uuml;ssen, die Nutzung der &uuml;blichen ``Abk&uuml;rzungen'' ist
nicht m&ouml;glich. Die folgende Liste beschreibt und kommentiert die n&ouml;tigen
Schritte:</p>

<ol type="1">
<li>
<p>Sichern Sie Ihre Daten.</p>

<p>Die Wichtigkeit dieses Schrittes kann nicht oft genug betont werden. Es ist wichtig,
Sicherungen von allen Benutzerdaten und Konfigurationsdateien zu erstellen. Volle
Sicherungen (Level 0) mit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=dump&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">dump</span>(8)</span></a> sind
daf&uuml;r geeignet, es gibt allerdings auch andere M&ouml;glichkeiten.</p>
</li>

<li>
<p>Stellen Sie sicher, da&szlig; im <tt class="FILENAME">/</tt>-Dateisystem ungef&auml;hr
30&nbsp;MB frei sind.</p>

<p>FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> ben&ouml;tigt mehr Platz als
FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var>. Wenn das Verzeichnis <tt
class="FILENAME">/tmp</tt> im <tt class="FILENAME">/</tt>-Dateisystem liegt (was oft der
Fall ist), k&ouml;nnen Sie Platz schaffen, indem Sie alle Dateien in diesem Verzeichnis
l&ouml;schen.</p>
</li>

<li>
<p>Wenn n&ouml;tig, editieren Sie <tt class="FILENAME">/etc/fstab</tt>.</p>

<p>Dieser Punkt betrifft wahrscheinlich nur &auml;ltere FreeBSD/i386 Systeme. Auf
Systemen, die Disk-Slices mit MBRs besitzen, unterst&uuml;tzte FreeBSD sogenannte
``compatibility slices''. Der Name dieser Slices war etwa <tt
class="FILENAME">/dev/ad0a</tt> (ohne ausdr&uuml;cklich die Slice zu benennen). Diese
Slices werden nicht mehr unterst&uuml;tzt. Slices m&uuml;ssen Namen wie <tt
class="FILENAME">/dev/ad0s1a</tt> tragen. Der Name muss das Laufwerk, die Nummer der
Slice und den Buchstaben der Partition enthalten.</p>

<p>Beachten Sie, da&szlig; ``compatibility slices'' seit FreeBSD 2.2.6-RELEASE nicht mehr
benutzt werden. Ignorieren Sie diesen Punkt wenn Sie FreeBSD/alpha Systeme oder Systeme
mit ``dangerously dediated'' Platten benutzen.</p>
</li>

<li>
<p>Besorgen Sie sich, beispielsweise mit CVS, eine Kopie der Quellen des Basissystems
(das Modul <tt class="FILENAME">src/</tt>). Mit CVS benutzen Sie f&uuml;r FreeBSD
5.3-RELEASE das Tag <var class="LITERAL">RELENG_5_3_0_RELEASE</var>, f&uuml;r den
5.3-Zweig (in dem Fehlerbehebungen stattfinden) nehmen Sie das Tag <var
class="LITERAL">RELENG_5_3</var>. Wenn Sie den 5-STABLE-Zweig verfolgen wollen, verwenden
Sie das Tag <var class="LITERAL">RELENG_5</var>. Falls Sie die Quellen mit CVS
auschecken, vergessen Sie nicht die Option <var class="OPTION">-P</var> anzugeben, damit
CVS leere Verzeichnisse entfernt.</p>
</li>

<li>
<p>FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> ben&ouml;tigt einige neue
Eintr&auml;ge in der Pa&szlig;wort- und Gruppendatei. Erzeugen Sie diese Eintr&auml;ge
mit Hilfe des nachstehenden Kommandos:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">mergemaster -p</kbd>
</pre>

<p>Dieser Schritt mu&szlig; ausgef&uuml;hrt werden, damit neue Dateien dem richtigen
Benutzerkonto und der richtigen Gruppe geh&ouml;ren.</p>

<p>Beachten Sie, da&szlig; in FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> das
Werkzeug <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=nologin&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">nologin</span>(8)</span></a> von
<tt class="FILENAME">/sbin/nologin</tt> nach <tt class="FILENAME">/usr/sbin/nologin</tt>
verschoben wurde. Die Login-Shell einiger Pseudo-Benutzer ist <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=nologin&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">nologin</span>(8)</span></a> daher
entstehen weitere Unterschiede in <tt class="FILENAME">/etc/passwd</tt>.</p>
</li>

<li>
<p>Bauen Sie mit dem nachstehenden Kommando die Benutzerwerkzeuge (Userland):</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cd /usr/src</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">make buildworld</kbd>
</pre>

<p>Wenn die Variable <var class="VARNAME">CPUTYPE</var> in <tt
class="FILENAME">/etc/make.conf</tt> definiert wird, sollte sie mit Operator <var
class="LITERAL">?=</var> definiert werden. Damit kann der <var
class="LITERAL">buildworld</var>-Proze&szlig;, falls es n&ouml;tig sein sollte, die
Variable &uuml;berschreiben.</p>

<p>Beachten Sie, da&szlig; <var class="VARNAME">MAKEOBJDIRPREFIX</var> <span
class="emphasis"><i class="EMPHASIS">nicht</i></span> in <tt
class="FILENAME">/etc/make.conf</tt> definiert werden darf.</p>

<p>Allgemein sollten die meisten der Bauoptionen in <tt
class="FILENAME">/etc/make.conf</tt> auskommentiert oder entfernt sein. Besonders gilt
das f&uuml;r Optionen, die direkt Bau- oder Basisfunktionen des Systems beeinflussen (wie
<var class="VARNAME">NO_TOOLCHAIN</var>).</p>
</li>

<li>
<p>Bauen und installieren Sie einen neuen Kernel:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">make buildkernel</kbd>
</pre>

<p>Das <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=make&sektion=1&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">make</span>(1)</span></a>-Ziel
<var class="LITERAL">buildkernel</var> mu&szlig; verwendet werden, damit der neue Kernel
mit den im vorigen Schritt (<var class="LITERAL">buildworld</var>) erzeugten
Benutzerwerkzeugen gebaut wird. Sie k&ouml;nnen die Bauumgebung nicht manuell mit dem
Werkzeug <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=config&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">config</span>(8)</span></a>
erzeugen.</p>

<p>Auch wenn es praktisch ist, in diesem Schritt einen angepa&szlig;ten Kernel zu
erzeugen, sollten Sie das System mit einem <var class="LITERAL">GENERIC</var>-Kernel
aktualisieren. Diese Vorgehensweise ist weniger fehleranf&auml;llig. Wenn Sie das erste
Mal einen angepa&szlig;ten Kernel erstellen, benutzen Sie bitte den <var
class="LITERAL">GENERIC</var>-Kernel von FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var>
als Vorlage, da viele Treiber und Optionen neu sind oder sich ge&auml;ndert haben. Auf
jeden Fall sollten Sie die Option <var class="LITERAL">COMPAT_FREEBSD4</var> in die
Kernelkonfiguration aufnehmen, da die Option Voraussetzung f&uuml;r eine erfolgreiche
Aktualisierung ist.</p>
</li>

<li>
<p>Erzeugen Sie mit einer Variante des folgenden Kommandos f&uuml;r ISA-Ger&auml;te die
Datei <tt class="FILENAME">device.hints</tt>. Setzen Sie f&uuml;r <var
class="REPLACEABLE">MACHINE</var> den Namen der passenden Architektur (beispielsweise
<var class="LITERAL">i386</var>) ein.</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cp sys/<var
class="REPLACEABLE">MACHINE</var>/conf/GENERIC.hints /boot/device.hints</kbd>
</pre>

<p>Mit moderner Hardware kann die Datei <tt class="FILENAME">device.hints</tt> leer sein.
Auf Systemen mit non-PNP ISA-Karten (hier mu&szlig; die Datei angepa&szlig;t werden),
Systemen ohne PNPBIOS oder PNPBIOS-Systemen, die mit Disketten gestartet werden, ist die
Datei zwingend erforderlich.</p>
</li>

<li>
<p>Installieren Sie den neuen Kernel:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">make installkernel</kbd>
</pre>

<p>Unter FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var> wurde der Kernel in <tt
class="FILENAME">/kernel</tt> installiert. Unter FreeBSD&nbsp;5.<var
class="REPLACEABLE">X</var> wird der Kernel nach <tt
class="FILENAME">/boot/kernel/kernel</tt> installiert. Kernelmodule wurden unter
FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var> in das Verzeichnis <tt
class="FILENAME">/modules</tt> installiert, unter FreeBSD&nbsp;5.<var
class="REPLACEABLE">X</var> werden die Module in das Verzeichnis <tt
class="FILENAME">/boot/kernel</tt> installiert.</p>
</li>

<li>
<p>Installieren Sie den FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> Boot-Loader:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cd /usr/src/sys/boot</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">make STRIP="" install</kbd>
</pre>

<p>Wir empfehlen diesen Schritt, obwohl er optional ist, auszuf&uuml;hren.</p>
</li>

<li>
<p>Deaktivieren Sie Module Dritter (wie die f&uuml;r VMware). Dies verhindert
Abst&uuml;rze auf Grund ge&auml;nderter Kernel-ABIs oder anderen
Inkompatibilit&auml;ten.</p>
</li>

<li>
<p>Booten Sie das System in den Einbenutzermodus. Sie m&uuml;ssen das System in diesem
Schritt wirklich neu starten, da der neue Kernel laufen mu&szlig;, um die
Benutzerwerkzeuge zu installieren. Da nur die erforderlichen Prozesse laufen, verringert
der Einbenutzermodus wirksam das Auftreten unerwarteter Ereignisse.</p>
</li>

<li>
<p>H&auml;ngen Sie die erforderlichen Dateisysteme ein:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">fsck -p</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">mount -uw /</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">mount -at ufs</kbd>
</pre>

<p>Das Kommando <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=fsck&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">fsck</span>(8)</span></a> ist
erforderlich, damit einige Felder im Superblock der Dateisysteme auf FreeBSD&nbsp;5.<var
class="REPLACEABLE">X</var> angepa&szlig;t werden. Wenn die Systemzeit die lokale Zeit
anstelle von UTC verwendet, f&uuml;hren Sie auch noch den nachstehenden Befehl aus:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">adjkerntz -i</kbd>
</pre>

<p>In diesem Schritt kann die folgende Meldung mehrmals auf der Systemkonsole
erscheinen:</p>

<pre class="SCREEN">
WARNING: userland calling deprecated sysctl, please rebuild world
</pre>

<p>Ignorieren Sie diese Meldung.</p>
</li>

<li>
<p>L&ouml;schen Sie die C++ Header-Dateien:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">rm -rf /usr/include/g++</kbd>
</pre>

<p>Dieser Schritt verhindert, da&szlig; bei k&uuml;nftigen Compiler-L&auml;ufen alte
Header vom <b class="APPLICATION">GCC</b>&nbsp;2.95 C++&nbsp;Compiler angezogen
werden.</p>
</li>

<li>
<p>Installieren Sie die Benutzerwerkzeuge (Userland):</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cd /usr/src</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">make installworld</kbd>
</pre>
</li>

<li>
<p>Auf Systemen, die <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=named&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">named</span>(8)</span></a>
verwenden, m&uuml;ssen die <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=named&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span
class="REFENTRYTITLE">named</span>(8)</span></a>-Konfigurationsdateien in die <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=chroot&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span
class="REFENTRYTITLE">chroot</span>(8)</span></a>-Umgebung im Verzeichnis <tt
class="FILENAME">/var/named</tt> geschoben werden. Befinden sich im Verzeichnis <tt
class="FILENAME">/var/named</tt> schon Dateien, sollten Sie diese jetzt sichern.</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cd /etc</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">mv named named.bak</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">mkdir -p /var/named/etc/namedb</kbd>
<samp class="PROMPT">#</samp> <kbd
class="USERINPUT">cp -Rp named.bak/* /var/named/etc/namedb</kbd>
</pre>

<p>Falls die Konfiguration die erzeugten Dateien f&uuml;r <tt
class="FILENAME">localhost</tt> verwendet, generieren Sie die Dateien mit den
nachstehenden Kommandos neu:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cd /var/named/etc/namedb</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">/bin/sh make-localhost</kbd>
<samp class="PROMPT">#</samp> <kbd
class="USERINPUT">rm -f localhost-v6.rev localhost.rev</kbd>
</pre>
</li>

<li>
<p>Aktualisieren Sie die Konfigurationsdateien des Systems:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">mergemaster -i</kbd>
</pre>

<p>Dieser Schritt ist zwingend erforderlich. Der Schritt gew&auml;hrleistet, da&szlig;
die Start- und Konfigurationsdateien im Verzeichnis <tt class="FILENAME">/etc</tt> zu dem
frisch installierten System passen.</p>

<p>Nach dem Lauf von <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=mergemaster&sektion=8&manpath=FreeBSD+5.3-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">mergemaster</span>(8)</span></a>
sollten Sie die Datei <tt class="FILENAME">/etc/rc.conf</tt> untersuchen und
m&ouml;glicherweise anpassen. Die Vorgabewerte einiger Variablen haben sich
ge&auml;ndert, insbesondere wurden einige Dienste, die in 4.<var
class="REPLACEABLE">X</var> aktiviert waren, in 5.<var class="REPLACEABLE">X</var>
deaktiviert.</p>
</li>

<li>
<p>Entfernen Sie &uuml;brig gebliebene Dateien von <b class="APPLICATION">BIND 8</b>:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd
class="USERINPUT">rm /usr/bin/dnskeygen /usr/bin/dnsquery</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">rm /usr/libexec/named-xfer</kbd>
<samp class="PROMPT">#</samp> <kbd
class="USERINPUT">rm /usr/sbin/named.restart /usr/sbin/ndc</kbd>
</pre>
</li>

<li>
<p>Starten Sie das System neu.</p>
</li>
</ol>

<p>Nachdem Sie das Basissystem migriert haben, m&uuml;ssen Sie noch einige Komponenten,
die nicht zum Basissystem geh&ouml;ren, aktualisieren. <b class="APPLICATION">Perl</b>
ist nicht mehr Teil des Basissystems und sollte aus der Ports-Collection (der Port <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/lang/perl5.8/pkg-descr"><tt
class="FILENAME">lang/perl5.8</tt></a>) oder als Paket nachinstalliert werden. Danach
m&uuml;ssen alle Ports oder Pakete, die von Perl abh&auml;ngen, neu installiert
werden.</p>

<p>Wenn Sie FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var> Programme laufen lassen
wollen, ben&ouml;tigen Sie Kompatibilit&auml;tsbibliotheken. Diese k&ouml;nnen Sie mit
dem Port oder Paket <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/misc/compat4x/pkg-descr"><tt
class="FILENAME">misc/compat4x</tt></a> installieren.</p>

<p>Wie oben erw&auml;hnt, wird <b class="APPLICATION">Xorg</b> in der Voreinstellung als
X-Window-System verwendet. Die Ports und Pakete beachten diese &Auml;nderung, um
Abh&auml;ngigkeiten zwischen Software zu bestimmen. Die Migration von <b
class="APPLICATION"><span class="TRADEMARK">XFree86</span></b> auf <b
class="APPLICATION">Xorg</b> beschreibt das Handbuchkapitel <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/x-install.html"
target="_top">X11 installieren</a>.</p>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="SUMMARY" name="SUMMARY">6. Zusammenfassung</a></h2>

<p>Dieser Artikel beschreibt einige der beachtenswerten Funktionen von
FreeBSD&nbsp;5.<var class="REPLACEABLE">X</var> und bespricht wichtige Punkte f&uuml;r
Benutzer von FreeBSD&nbsp;4.<var class="REPLACEABLE">X</var>, die bestehende Systeme
aktualisieren wollen. Der Artikel beschreibt weiterhin zwei Methoden ein System zu
aktualisieren. Die erste Methode benutzt Bin&auml;rdateien von einem Installationsmedium,
die zweite Methode &uuml;bersetzt den Quellcode des Basissystems.</p>
</div>
</div>

<h3 class="FOOTNOTES">Fuﬂnoten</h3>

<table border="0" class="FOOTNOTES" width="100%">
<tr>
<td align="LEFT" valign="TOP" width="5%"><a id="FTN.AEN161" name="FTN.AEN161"
href="#AEN161"><span class="footnote">[1]</span></a></td>
<td align="LEFT" valign="TOP" width="95%">
<p>Das Ausf&uuml;hren von <tt class="FILENAME">a.out</tt>-Programmen ist weiterhin mit
der Kerneloption <var class="LITERAL">COMPAT_AOUT</var> m&ouml;glich. Einige Compiler aus
der Ports-Collection (beispielsweise <a
href="http://www.FreeBSD.org/cgi/url.cgi?ports/lang/gcc28/pkg-descr"><tt
class="FILENAME">lang/gcc28</tt></a>) k&ouml;nnen auch noch <tt
class="FILENAME">a.out</tt>-Programme erzeugen.</p>
</td>
</tr>
</table>

<hr />
<p align="center"><small>Diese Datei und andere Dokumente zu dieser Version sind bei <a
href="ftp://ftp.FreeBSD.org/">ftp://ftp.FreeBSD.org/</a>verfuegbar.</small></p>

<p align="center"><small>Wenn Sie Fragen zu FreeBSD haben, lesen Sie erst die <a
href="http://www.FreeBSD.org/docs.html">Dokumentation,</a> bevor Sie sich an &#60;<a
href="mailto:de-bsd-questions@de.FreeBSD.org">de-bsd-questions@de.FreeBSD.org</a>&#62;
wenden.</small></p>

<p align="center"><small>Alle Anwender von FreeBSD 5-STABLE sollten sich in die
Mailingliste &#60;<a href="mailto:stable@FreeBSD.org">stable@FreeBSD.org</a>&#62;
eintragen.</small></p>

<p align="center"><small>Wenn Sie Fragen zu dieser Dokumentation haben, wenden Sie sich
an &#60;<a
href="mailto:de-bsd-translators@de.FreeBSD.org">de-bsd-translators@de.FreeBSD.org</a>&#62;.</small></p>
</body>
</html>

