Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/rosetta/_index.po
Languages: ru

source: Rosetta Stone with the differences between Docbook and AsciiDoc
ru: Розеттский камень с различиями между Docbook и AsciiDoc

source: Chapter 7. Rosetta Stone
ru: Глава 7. Розеттский камень

source: Rosetta Stone
ru: Розеттский камень

source: Comparison between Docbook and AsciiDoc
ru: Сравнение Docbook и AsciiDoc

source: This rosetta stone tries to show the differences between Docbook and AsciiDoc.
ru: Эта шпаргалка пытается показать различия между Docbook и AsciiDoc.

source: Language Feature
ru: Языковая функция

source: *Bold*
ru: *Жирный*

source: <strong>bold</strong>
ru: <strong>жирный</strong>

source: \*bold*
ru: \*жирный*

source: *Italic*
ru: *Курсив*

source: <emphasis>Italic</emphasis>
ru: <emphasis>Курсив</emphasis>

source: \_Italic_
ru: \_Курсив_

source: *Monospace*
ru: *Моноширинный*

source: <literal>Monospace</literal>
ru: <literal>Моноширинный</literal>

source: \`Monospace`
ru: \`Моноширинный`

source: *Paragraph*
ru: *Абзац*

source: <para>This is a paragraph</para>
ru: <para>Это абзац</para>

source: This is a paragraph
ru: Это абзац

source: *Keycap*
ru: *Клавиша*

source: *Links*
ru: *Ссылки*

source: [source,xml] ---- <link xlink:href="https://www.freebsd.org/where/">Download FreeBSD</link> ----
ru: [source,xml] ---- <link xlink:href="https://www.freebsd.org/where/"> Загрузить FreeBSD</link> ----

source: [source] ---- link:https://www.freebsd.org/where/[Download FreeBSD] ----
ru: [source] ---- link:https://www.freebsd.org/where/[Загрузить FreeBSD] ----

source: *Sections*
ru: *Разделы*

source: [source,xml] ---- <sect1 xml:id="id"> <title>Section 1</title> </sect1> ----
ru: [source,xml] ---- <sect1 xml:id="id"> <title>Раздел 1</title> </sect1> ----

source: [source] ---- [[id]] = Section 1 ----
ru: [source] ---- [[id]] = Раздел 1 ----

source: *Unordered list*
ru: *Неупорядоченный список*

source: [source,xml] ---- <itemizedlist> <listitem> <para>When to build a custom kernel.</para> </listitem> <listitem> <para>How to take a hardware inventory.</para> </listitem> </itemizedlist> ----
ru: [source,xml] ---- <itemizedlist> <listitem> <para>Когда следует собирать собственное ядро.</para> </listitem> <listitem> <para>Как выполнить инвентаризацию оборудования.</para> </listitem> </itemizedlist> ----

source: [source] ---- * When to build a custom kernel. * How to take a hardware inventory. ----
ru: [source] ---- * Когда необходимо собрать собственное ядро. * Как выполнить инвентаризацию оборудования. ----

source: *Ordered list*
ru: *Упорядоченный список*

source: [source,xml] ---- <orderedlist> <listitem> <para>One</para> </listitem> <listitem> <para>Two</para> </listitem> <listitem> <para>Three</para> </listitem> <listitem> <para>Four</para> </listitem> </orderedlist> ----
ru: [source,xml] ---- <orderedlist> <listitem> <para>Один</para> </listitem> <listitem> <para>Два</para> </listitem> <listitem> <para>Три</para> </listitem> <listitem> <para>Четыре</para> </listitem> </orderedlist> ----

source: [source] ---- . One . Two . Three . Four ----
ru: [source] ---- . Один . Два . Три . Четыре ----

source: *Variable list*
ru: *Словарный список (Variable list)*

source: [source,xml] ---- <variablelist> <varlistentry> <term>amd64</term> <listitem> <para>This is the most common desktop...</para> </listitem> </varlistentry> </variablelist> ----
ru: [source,xml] ---- <variablelist> <varlistentry> <term>amd64</term> <listitem> <para>Это наиболее распространённая десктопная...</para> </listitem> </varlistentry> </variablelist> ----

source: [source] ---- amd64:: This is the most common desktop... ----
ru: [source] ---- amd64:: Это наиболее распространённая десктопная... ----

source: *Source code*
ru: *Исходный код*

source: *Literal block*
ru: *Неформатируемый блок*

source: *Images*
ru: *Изображения*

source: [source,xml] ---- <figure xml:id="bsdinstall-newboot-loader-menu"> <title>FreeBSD Boot Loader Menu</title> <mediaobject> <imageobject> <imagedata fileref="bsdinstall/bsdinstall-newboot-loader-menu"/> </imageobject> <textobject> </literallayout>ASCII art replacement is no longer supported.</literallayout> </textobject> <textobject> <phrase>The FreeBSD loader menu, with options 1-6 to boot multi-user, boot single user, escape to loader prompt, reboot, select a kernel to load, and select boot options</phrase> </textobject> </mediaobject> </figure> ----
ru: [source,xml] ---- <figure xml:id="bsdinstall-newboot-loader-menu"> <title>Меню загрузчика FreeBSD</title> <mediaobject> <imageobject> <imagedata fileref="bsdinstall/bsdinstall-newboot-loader-menu"/> </imageobject> <textobject> </literallayout> Поддержка ASCII-графики более не предоставляется. </literallayout> </textobject> <textobject> <phrase>Меню загрузчика FreeBSD с вариантами 1-6 для загрузки в многопользовательском режиме, однопользовательском режиме, перехода в командную строку загрузчика, перезагрузки, выбора ядра для загрузки и параметров загрузки</phrase> </textobject> </mediaobject> </figure> ----

source: [source] ---- [[bsdinstall-newboot-loader-menu]] .FreeBSD Boot Loader Menu image::bsdinstall/bsdinstall-newboot-loader-menu[The FreeBSD loader menu, with options 1-6 to boot multi-user, boot single user, escape to loader prompt, reboot, select a kernel to load, and select boot options] ----
ru: [source] ---- [[bsdinstall-newboot-loader-menu]] .Меню загрузчика FreeBSD image::bsdinstall/bsdinstall-newboot-loader-menu[Меню загрузчика FreeBSD с вариантами 1-6: загрузка многопользовательского режима, загрузка однопользовательского режима, переход в командную строку загрузчика, перезагрузка, выбор ядра для загрузки и параметров загрузки] ----

source: *Includes*
ru: *Включение файла*

source: n/a
ru: не доступно

source: *Tables*
ru: *Таблицы*

source: [source,xml] ---- <table xml:id="partition-schemes" frame="none" rowsep="1" pgwide="1"> <title>Partitioning Schemes</title> <tgroup cols="2" align="left"> <thead> <row> <entry align="left">Abbreviation</entry> <entry align="left">Description</entry> </row> </thead> <tbody> <row> <entry>APM</entry> <entry>Apple Partition Map, used by PowerPC(R).</entry> </row> </tbody> </tgroup> </table> ----
ru: [source,xml] ---- <table xml:id="partition-schemes" frame="none" rowsep="1" pgwide="1"> <title>Схемы разделов</title> <tgroup cols="2" align="left"> <thead> <row> <entry align="left">Сокращение</entry> <entry align="left">Описание</entry> </row> </thead> <tbody> <row> <entry>APM</entry> <entry>Карта разделов Apple, используется в PowerPC(R).</entry> </row> </tbody> </tgroup> </table> ----

source: [source] ---- [[partition-schemes]] .Partitioning Schemes [cols="1,1", frame="none", options="header"] \
ru: [source] ---- [[partition-schemes]] .Схемы разделов [cols="1,1", frame="none", options="header"] \

source: Abbreviation \
ru: Сокращение \

source: Description \
ru: Описание \

source: Apple Partition Map, used by PowerPC(R). \
ru: Apple Partition Map, используется на PowerPC(R). \

source: *Admonitions*
ru: *Блоки-уведомления*

source: [source,xml] ---- <tip> <para>This is a tip</para> </tip> ----
ru: [source,xml] ---- <tip> <para>Это подсказка</para> </tip> ----

source: [source] ---- [TIP] ==== This is a tip ==== ----
ru: [source] ---- [ПОДСКАЗКА] ==== Это подсказка ==== ----
