Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: Do not name chapters or directories after their ordering within the Handbook. This ordering can change as the content within the Handbook is reorganized. Reorganization should be possible without renaming files, unless entire chapters are being promoted or demoted within the hierarchy.
pt_br: Não nomeie capítulos ou diretórios com a ordenação do Handbook. Essa ordenação pode mudar conforme o conteúdo do Handbook é reorganizado. A reorganização deve ser realizada sem renomear arquivos, a menos que capítulos inteiros sejam promovidos ou rebaixados dentro da hierarquia.

source: The <filename>chapter.xml</filename> files are not complete <acronym>XML</acronym> documents that can be built individually. They can only be built as parts of the whole Handbook.
pt_br: Os arquivos <filename>chapter.xml</filename> não são arquivos completos de documentos <acronym>XML</acronym> que podem ser compilados individualmente. Eles só podem ser compilados como partes de todo o Handbook.

source: The Documentation Build Process
pt_br: O Processo de Compilação da Documentação

source: This chapter covers organization of the documentation build process and how <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> is used to control it.
pt_br: Este capítulo aborda a organização do processo de compilação da documentação e como o <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> é utilizado para isso.

source: Rendering DocBook into Output
pt_br: Renderizando DocBook

source: Different types of output can be produced from a single DocBook source file. The type of output desired is set with the <varname>FORMATS</varname> variable. A list of known formats is stored in <varname>KNOWN_FORMATS</varname>:
pt_br: Diferentes tipos de saída podem ser produzidos a partir de um único arquivo fonte DocBook. O tipo de saída desejado é definido com a variável <varname>FORMATS</varname>. Uma lista de formatos de saída conhecidos é armazenada em <varname>KNOWN_FORMATS</varname>:

source: Common Output Formats
pt_br: Formatos de Saída Comuns

source: <varname>FORMATS</varname> Value
pt_br: Valor <varname>FORMATS</varname>

source: File Type
pt_br: Tipo de Arquivo

source: Description
pt_br: Descrição

source: <acronym>HTML</acronym>, one file
pt_br: <acronym>HTML</acronym>, arquivo único

source: A single <filename>book.html</filename> or <filename>article.html</filename>.
pt_br: Um único <filename>book.html</filename> ou <filename>article.html</filename>.

source: <acronym>HTML</acronym>, multiple files
pt_br: <acronym>HTML</acronym>, vários arquivos

source: Multiple <acronym>HTML</acronym> files, one for each chapter or section, for use on a typical web site.
pt_br: Vários arquivos <acronym>HTML</acronym>, um para cada capítulo ou seção, para uso em um site comum.

source: The default output format can vary by document, but is usually <literal>html-split</literal>. Other formats are chosen by setting <varname>FORMATS</varname> to a specific value. Multiple output formats can be created at a single time by setting <varname>FORMATS</varname> to a list of formats.
pt_br: O formato de saída padrão pode variar de acordo com o documento, mas geralmente é <literal>html-split</literal>. Outros formatos são escolhidos definindo <varname>FORMATS</varname> para um valor específico. Múltiplos formatos de saída podem ser criados de uma só vez definindo <varname>FORMATS</varname> para uma lista de formatos.

source: Build a Single HTML Output File
pt_br: Compilar um Arquivo Único HTML

source: Build HTML-Split and <acronym>PDF</acronym> Output Files
pt_br: Compilar HTML-Split e <acronym>PDF</acronym>

source: The FreeBSD Documentation Build Toolset
pt_br: O Conjunto de Ferramentas de Compilação da Documentação do FreeBSD

source: These are the tools used to build and install the <acronym>FDP</acronym> documentation.
pt_br: Estas são as ferramentas utilizadas para compilar e instalar a documentação do <acronym>FDP</acronym>.

source: The primary build tool is <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, specifically <application>Berkeley Make</application>.
pt_br: A principal ferramenta de compilação é o <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, especificamente o <application>Berkeley Make</application>.

source: Package building is handled by FreeBSD's <citerefentry><refentrytitle>pkg-create</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: A construção de pacotes é gerenciada pelo <citerefentry><refentrytitle>pkg-create</refentrytitle><manvolnum>8</manvolnum></citerefentry> do FreeBSD.

source: <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> is used to create compressed versions of the document. <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry> archives are also supported. <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> is used for package building.
pt_br: <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> é usado para criar versões compactadas de um documento. <citerefentry><refentrytitle>bzip2</refentrytitle><manvolnum>1</manvolnum></citerefentry> também são suportados. <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> é usado na criação de pacotes.

source: <citerefentry><refentrytitle>install</refentrytitle><manvolnum>1</manvolnum></citerefentry> is used to install the documentation.
pt_br: <citerefentry><refentrytitle>install</refentrytitle><manvolnum>1</manvolnum></citerefentry> é usado para instalar a documentação.

source: Understanding <filename>Makefile</filename>s in the Documentation Tree
pt_br: Noções Básicas de <filename>Makefile</filename>s no Repositório de Documentação

source: There are three main types of <filename>Makefile</filename>s in the FreeBSD Documentation Project tree.
pt_br: Existem três tipos principais de <filename>Makefile</filename>s no repositório de Documentação do Projeto FreeBSD.

source: <link linkend="sub-make">Subdirectory <filename>Makefile</filename>s</link> simply pass commands to those directories below them.
pt_br: <link linkend="sub-make"><filename>Makefile</filename>s de Subdiretório</link> simplesmente passam os comandos para os diretórios abaixo deles.

source: <link linkend="doc-make">Documentation <filename>Makefile</filename>s</link> describe the documents that are produced from this directory.
pt_br: <link linkend="doc-make"><filename>Makefile</filename>s de Documentação</link> descrevem os documentos que devem ser produzidos a partir deste diretório.

source: <link linkend="make-includes"><application>Make</application> includes</link> are the glue that perform the document production, and are usually of the form <filename>doc.<replaceable>xxx</replaceable>.mk</filename>.
pt_br: <link linkend="make-includes"><application>Make</application> includes</link> são os responsáveis pela produção do documento, e geralmente possuem o nome no formato <filename>doc.<replaceable>xxx</replaceable>.mk</filename>.

source: Subdirectory <filename>Makefile</filename>s
pt_br: <filename>Makefile</filename>s de Subdiretório

source: These <filename>Makefile</filename>s usually take the form of:
pt_br: Estes <filename>Makefile</filename>s geralmente tem a forma de:

source: The first four non-empty lines define the <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> variables <varname>SUBDIR</varname>, <varname>COMPAT_SYMLINK</varname>, and <varname>DOC_PREFIX</varname>.
pt_br: As quatro primeiras linhas não vazias definem as variáveis ​​do <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <varname>SUBDIR</varname>, <varname>COMPAT_SYMLINK</varname>, e <varname>DOC_PREFIX</varname>.

source: The <varname>SUBDIR</varname> statement and <varname>COMPAT_SYMLINK</varname> statement show how to assign a value to a variable, overriding any previous value.
pt_br: A declaração <varname>SUBDIR</varname> e <varname>COMPAT_SYMLINK</varname> mostram como atribuir um valor a uma variável, sobrescrevendo qualquer valor anterior que a mesma contenha.

source: The second <varname>SUBDIR</varname> statement shows how a value is appended to the current value of a variable. The <varname>SUBDIR</varname> variable is now <literal>articles books</literal>.
pt_br: A segunda declaração <varname>SUBDIR</varname> mostra como um valor é anexado ao valor atual de uma variável. A variável <varname>SUBDIR</varname> agora é composta por <literal>articles books</literal>.

source: The <varname>DOC_PREFIX</varname> assignment shows how a value is assigned to the variable, but only if it is not already defined. This is useful if <varname>DOC_PREFIX</varname> is not where this <filename>Makefile</filename> thinks it is - the user can override this and provide the correct value.
pt_br: A declaração <varname>DOC_PREFIX</varname> mostra como um valor é atribuído para uma variável, mas somente se ela ainda não estiver definida. Isso é útil se <varname>DOC_PREFIX</varname> não for onde este <filename>Makefile</filename>pensa que é - o usuário pode cancelar e fornecer o valor correto.

source: What does it all mean? <varname>SUBDIR</varname> mentions which subdirectories below this one the build process should pass any work on to.
pt_br: Agora o que tudo isso significa? <varname>SUBDIR</varname> lista quais subdiretórios abaixo do atual devem ser incluídos no processo de compilação durante a geração do documento.

source: <varname>COMPAT_SYMLINK</varname> is specific to compatibility symlinks (amazingly enough) for languages to their official encoding (<filename>doc/en</filename> would point to <filename>en_US.ISO-8859-1</filename>).
pt_br: O <varname>COMPAT_SYMLINK</varname> é específico para compatibilizar os links simbólicos que ligam os idiomas a sua codificação oficial (<filename>doc/en</filename> deve apontar para <filename>en_US.ISO-8859-1</filename>).

source: <varname>DOC_PREFIX</varname> is the path to the root of the FreeBSD Document Project tree. This is not always that easy to find, and is also easily overridden, to allow for flexibility. <varname>.CURDIR</varname> is a <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> builtin variable with the path to the current directory.
pt_br: O <varname>DOC_PREFIX</varname> é o caminho para a raíz da árvore do projeto de documentação do FreeBSD. O qual nem sempre é facil de encontrar, e que também pode ser facilmente sobrescrito, para permitir flexibilidade. O <varname>.CURDIR</varname> é uma variável interna do <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> que contém o caminho para o diretório atual.

source: The final line includes the FreeBSD Documentation Project's project-wide <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> system file <filename>doc.project.mk</filename> which is the glue which converts these variables into build instructions.
pt_br: A linha final inclui o arquivo principal do <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> <filename>doc.project.mk</filename> do Projeto de Documentação do FreeBSD, ele é o responsável por converter estas variáveis em instruções de compilação.

source: Documentation <filename>Makefile</filename>s
pt_br: <filename>Makefile</filename>s de Documentação

source: These <filename>Makefile</filename>s set <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> variables that describe how to build the documentation contained in that directory.
pt_br: Estes conjuntos de ​​<citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> <filename>Makefile</filename>s descrevem como construir a documentação contida nesse diretório.

source: Here is an example:
pt_br: Aqui está um exemplo:

source: The <varname>MAINTAINER</varname> variable allows committers to claim ownership of a document in the FreeBSD Documentation Project, and take responsibility for maintaining it.
pt_br: A variável <varname>MAINTAINER</varname> permite que os committers reivindiquem a propriedade de um documento no Projeto de Documentação do FreeBSD, e sejam responsáveis ​​por mantê-lo.

source: <varname>DOC</varname> is the name (sans the <filename>.xml</filename> extension) of the main document created by this directory. <varname>SRCS</varname> lists all the individual files that make up the document. This should also include important files in which a change should result in a rebuild.
pt_br: <varname>DOC</varname> é o nome (sem a extensão <filename>.xml</filename>) do principal documento criado por este diretório. O <varname>SRCS</varname> lista todos os arquivos individuais que compõem o documento. Ela também deve incluir os arquivos importantes, nos quais qualquer mudança deve resultar em uma reconstrução.

source: <varname>FORMATS</varname> indicates the default formats that should be built for this document. <varname>INSTALL_COMPRESSED</varname> is the default list of compression techniques that should be used in the document build. <varname>INSTALL_ONLY_COMPRESS</varname>, empty by default, should be non-empty if only compressed documents are desired in the build.
pt_br: <varname>FORMATS</varname> indica os formatos nos quais o documento deve ser gerado por padrão. <varname>INSTALL_COMPRESSED</varname> contém a lista padrão das técnicas de compressão que devem ser usadas no documento depois que ele é gerado. A variável <varname>INSTALL_ONLY_COMPRESS</varname>, nula por padrão, deve ser definida para um valor não nulo apenas se você desejar gerar exclusivamente a versão compactada do documento.

source: The <varname>DOC_PREFIX</varname> and include statements should be familiar already.
pt_br: Você já deve estar familiarizado com a atribuição da variável <varname>DOC_PREFIX</varname> e com as instruções de include.

source: FreeBSD Documentation Project <application>Make</application> Includes
pt_br: Includes do <application>Make</application> do Projeto de Documentação do FreeBSD

source: <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> includes are best explained by inspection of the code. Here are the system include files:
pt_br: <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> includes são melhor explicados por uma inspeção de código. Aqui estão os arquivos include do sistema:

source: <filename>doc.project.mk</filename> is the main project include file, which includes all the following include files, as necessary.
pt_br: <filename>doc.project.mk</filename> é o principal arquivo include do projeto, que inclui todos os arquivos includes necessários.

source: <filename>doc.subdir.mk</filename> handles traversing of the document tree during the build and install processes.
pt_br: <filename>doc.subdir.mk</filename> controla a navegação na árvore de documentação durante o processo de construção e instalação.

source: <filename>doc.install.mk</filename> provides variables that affect ownership and installation of documents.
pt_br: <filename>doc.install.mk</filename> fornece as variáveis que afetam a propriedade e a instalação de documentos.

source: <filename>doc.docbook.mk</filename> is included if <varname>DOCFORMAT</varname> is <literal>docbook</literal> and <varname>DOC</varname> is set.
pt_br: <filename>doc.docbook.mk</filename> é incluído se o <varname>DOCFORMAT</varname> for <literal>docbook</literal> e se a variável <varname>DOC</varname> estiver definida.

source: By inspection:
pt_br: Por inspeção:

source: Variables
pt_br: Variáveis

source: <varname>DOCFORMAT</varname> and <varname>MAINTAINER</varname> are assigned default values, if these are not set by the document make file.
pt_br: As variáveis <varname>DOCFORMAT</varname> e <varname>MAINTAINER</varname> serão atribuídas com valores padrão, se o valor das mesmas não tiver sido definido no arquivo Makefile do documento.

source: <varname>PREFIX</varname> is the prefix under which the <link linkend="tools">documentation building tools</link> are installed. For normal package and port installation, this is <filename>/usr/local</filename>.
pt_br: <varname>PREFIX</varname> define o caminho no qual os <link linkend="tools">aplicativos de construção da documentação</link> estão instalados. Para uma instalação normal através de pacotes e/ou ports, este caminho será sempre <filename>/usr/local</filename>.

source: <varname>PRI_LANG</varname> should be set to whatever language and encoding is natural amongst users these documents are being built for. US English is the default.
pt_br: A variável <varname>PRI_LANG</varname> deve ser configurada para refletir o idioma e a codificação nativa dos usuários aos quais os documentos se destinam. O Inglês Americano é o padrão.

source: <varname>PRI_LANG</varname> does not affect which documents can, or even will, be built. Its main use is creating links to commonly referenced documents into the FreeBSD documentation install root.
pt_br: A variável <varname>PRI_LANG</varname> de maneira alguma afeta quais documentos serão, ou que poderão, ser compilados. Sua função principal é criar links para os documentos referenciados com maior frequência no diretório raiz de instalação da documentação do FreeBSD.

source: Conditionals
pt_br: Condicionais

source: The <literal>.if defined(DOC)</literal> line is an example of a <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> conditional which, like in other programs, defines behavior if some condition is true or if it is false. <literal>defined</literal> is a function which returns whether the variable given is defined or not.
pt_br: A linha <literal>.if defined(DOC)</literal> é um exemplo da condicional do <citerefentry> <refentrytitle> make </refentrytitle> <manvolnum> 1 </manvolnum> </citerefentry> como em outros programas, define o comportamento se alguma condição é verdadeira ou se é falsa. <literal> defined </literal> é uma função que retorna se uma dada variável está definida ou não.

source: <literal>.if ${DOCFORMAT} == "docbook"</literal>, next, tests whether the <varname>DOCFORMAT</varname> variable is <literal>"docbook"</literal>, and in this case, includes <filename>doc.docbook.mk</filename>.
pt_br: A seguir, <literal>.if ${DOCFORMAT} == "docbook"</literal> testa se a variável <varname>DOCFORMAT</varname> é <literal>"docbook"</literal>, e neste caso, inclue o <filename>doc.docbook.mk</filename>.

source: The two <literal>.endif</literal>s close the two above conditionals, marking the end of their application.
pt_br: Os dois <literal>.endif</literal>s fecham as duas condicionais anteriores, marcando o fim da sua aplicação.

source: This file is too long to explain in detail. These notes describe the most important features.
pt_br: Este arquivo é muito longo para ser explicado em detalhes. Estas notas descrevem as principais funcionalidades.

source: <varname>SUBDIR</varname> is a list of subdirectories that the build process should go further down into.
pt_br: <varname>SUBDIR</varname> é a lista de subdiretórios nos quais o processo de construção deve ser executado.

source: <varname>ROOT_SYMLINKS</varname> is the name of directories that should be linked to the document install root from their actual locations, if the current language is the primary language (specified by <varname>PRI_LANG</varname>).
pt_br: <varname>ROOT_SYMLINKS</varname> são os nomes dos diretórios que devem ser linkados para a raíz de instalação do documento a partir da sua localização atual, se o idioma atual for o idioma primário (especificado por <varname>PRI_LANG</varname>).

source: <varname>COMPAT_SYMLINK</varname> is described in the <link linkend="sub-make">Subdirectory Makefile</link> section.
pt_br: <varname>COMPAT_SYMLINK</varname> já foi descrito na seção <link linkend="sub-make">Makefiles de Subdiretório</link>.

source: Targets and Macros
pt_br: Targets e Macros

source: Dependencies are described by <literal><replaceable>target</replaceable>: <replaceable>dependency1 dependency2 ...</replaceable></literal> tuples, where to build <literal>target</literal>, the given dependencies must be built first.
pt_br: As dependências são descritas por <literal><replaceable>target</replaceable>: <replaceable>dependência1 dependência2 ...</replaceable></literal>, nas quais, para construir o <literal>target</literal>, é necessário primeiramente construir as dependências informadas.

source: After that descriptive tuple, instructions on how to build the target may be given, if the conversion process between the target and its dependencies are not previously defined, or if this particular conversion is not the same as the default conversion method.
pt_br: Depois desta descrição, instruções de como construir o target podem ser passadas, no caso do processo de conversão entre o target e estas dependências não tiver sido previamente definido, ou se esta conversão em particular não for a mesma que a definida pelo método padrão de conversão.

source: A special dependency <literal>.USE</literal> defines the equivalent of a macro.
pt_br: A dependência especial <literal>.USE</literal> define o equivalente a uma macro.

source: In the above, <_:buildtarget-1/> is now a macro which will execute the given commands when it is listed as a dependency.
pt_br: No código acima, <_:buildtarget-1/> é agora uma macro, a qual irá executar determinados comandos quando for listada como dependência.

source: What sets this macro apart from other targets? Basically, it is executed <emphasis>after</emphasis> the instructions given in the build procedure it is listed as a dependency to, and it does not adjust <varname>.TARGET</varname>, which is the variable which contains the name of the target currently being built.
pt_br: O que diferencia essa macro de outros targets? Basicamente, ela é executada <emphasis>após</emphasis> as instruções passadas no processo de construção por ser uma dependência para o mesmo, e ela não configura o <varname>.TARGET</varname>, que é a variável que contém o nome do target atual que está sendo construído.

source: In the above, <_:buildtarget-1/> will use the <_:buildtarget-2/> macro after it has executed the instruction <command>rm -f ${CLEANFILES}</command>. In effect, this causes <_:buildtarget-3/> to go further and further down the directory tree, deleting built files as it goes <emphasis>down</emphasis>, not on the way back up.
pt_br: No código acima, o <_:buildtarget-1/> usará a macro <_:buildtarget-2/> depois de ter executado a instrução <command>rm -f $ {CLEANFILES}</command>. De fato, isso faz com que <_:buildtarget-3/> vá mais a fundo na árvore de diretórios, excluindo os arquivos construídos à medida que vai <emphasis>descendo</emphasis> pelos subdiretórios, e não quando vai na direção oposta.

source: Provided Targets
pt_br: Targets Fornecidos

source: <_:buildtarget-1/> and <_:buildtarget-2/> both go down the directory tree calling the real versions of themselves in the subdirectories (<_:buildtarget-3/> and <_:buildtarget-4/> respectively).
pt_br: <_:buildtarget-1/> e <_:buildtarget-2/> ambos percorrem a árvore de diretórios executando as suas versões reais dentro dos subdiretórios (<_:buildtarget-3/> e <_:buildtarget-4/> respectivamente).
