Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: The entities could be listed at the top of each book, but that quickly becomes cumbersome to manage.
pt_br: As entidades podem ser listadas no topo de cada livro, mas isso rapidamente se torna difícil de gerenciar.

source: Instead, place the general entity definitions inside one file, and use a parameter entity to include that file within the document.
pt_br: Em vez disso, coloque as definições gerais da entidade em um arquivo e use uma entidade de parâmetro para incluir esse arquivo no documento.

source: Place the entity definitions in a separate file called <filename>chapters.ent</filename> and containing this text:
pt_br: Coloque as definições de entidade em um arquivo separado chamado <filename>chapters.ent</filename> contendo este texto:

source: Create a parameter entity to refer to the contents of the file. Then use the parameter entity to load the file into the document, which will then make all the general entities available for use. Then use the general entities as before:
pt_br: Crie uma entidade de parâmetro para se referir ao conteúdo do arquivo. Em seguida, use a entidade de parâmetro para carregar o arquivo no documento, o que tornará todas as entidades gerais disponíveis para uso. Em seguida, use as entidades gerais como antes:

source: Use General Entities to Include Files
pt_br: Use Entidades Gerais para Incluir Arquivos

source: Create three files, <filename>para1.xml</filename>, <filename>para2.xml</filename>, and <filename>para3.xml</filename>.
pt_br: Crie três arquivos, <filename>para1.xml</filename>, <filename>para2.xml</filename> e <filename>para3.xml</filename>.

source: Put content like this in each file:
pt_br: Coloque conteúdo como este em cada arquivo:

source: Edit <filename>example.xml</filename> so that it looks like this:
pt_br: Edite <filename>example.xml</filename> para que fique assim:

source: Produce <filename>example.html</filename> by normalizing <filename>example.xml</filename>.
pt_br: Gere <filename>example.html</filename> ao normalizar <filename>example.xml</filename>.

source: Load <filename>example.html</filename> into the web browser and confirm that the <filename>para<replaceable>n</replaceable>.xml</filename> files have been included in <filename>example.html</filename>.
pt_br: Carregue <filename>example.html</filename> no navegador web e confirme se os arquivos <filename>para<replaceable>n</replaceable>.xml</filename> foram incluídos em <filename>example.html</filename>.

source: Use Parameter Entities to Include Files
pt_br: Use Entidades de Parâmetro para Incluir Arquivos

source: The previous steps must have completed before this step.
pt_br: As etapas anteriores devem ser concluídas antes dessa etapa.

source: Create a new file called <filename>entities.ent</filename> with this content:
pt_br: Crie um novo arquivo chamado <filename>entities.ent</filename> com este conteúdo:

source: Marked Sections
pt_br: Seções Marcadas

source: <acronym>XML</acronym> provides a mechanism to indicate that particular pieces of the document should be processed in a special way. These are called <quote>marked sections</quote>.
pt_br: <acronym>XML</acronym> fornece um mecanismo para indicar que partes específicas do documento devem ser processadas de uma maneira especial. Estes são chamados de <quote>seções marcadas</quote>.

source: Structure of a Marked Section
pt_br: Estrutura de uma Seção Marcada

source: As expected of an <acronym>XML</acronym> construct, a marked section starts with <literal>&lt;!</literal>.
pt_br: Como esperado de um construct <acronym>XML</acronym>, uma seção marcada começa com <literal>&lt;!</literal>.

source: The first square bracket begins the marked section.
pt_br: O primeiro colchete inicia a seção marcada.

source: <replaceable>KEYWORD</replaceable> describes how this marked section is to be processed by the parser.
pt_br: <replaceable>KEYWORD</replaceable> descreve como esta seção marcada deve ser processada pelo parser.

source: The second square bracket indicates the start of the marked section's content.
pt_br: O segundo colchete indica o início do conteúdo da seção marcada.

source: The marked section is finished by closing the two square brackets, and then returning to the document context from the <acronym>XML</acronym> context with <literal>&gt;</literal>.
pt_br: A seção marcada é concluída, fechando os dois colchetes e, em seguida, retornando ao contexto do documento do contexto <acronym>XML</acronym> com <literal>&gt;</literal>.

source: Marked Section Keywords
pt_br: Palavras-chave da Seção Marcada

source: These keywords denote the marked sections <emphasis>content model</emphasis>, and allow you to change it from the default.
pt_br: Essas palavras-chave indicam as seções marcadas pelo <emphasis>modelo de conteúdo</emphasis> e permitem que você a altere do padrão.

source: When an <acronym>XML</acronym> parser is processing a document, it keeps track of the <quote>content model</quote>.
pt_br: Quando um <acronym>XML</acronym> parser está processando um documento, ele acompanha o <quote>modelo de conteúdo</quote>.

source: The content model describes the content the parser is expecting to see and what it will do with that content.
pt_br: O modelo de conteúdo descreve o conteúdo que o parser espera ver e o que ele fará com esse conteúdo.

source: The <literal>CDATA</literal> content model is one of the most useful.
pt_br: O modelo de conteúdo <literal>CDATA</literal> é um dos mais úteis.

source: <literal>CDATA</literal> is for <quote>Character Data</quote>. When the parser is in this content model, it expects to see only characters. In this model the <literal>&lt;</literal> and <literal>&amp;</literal> symbols lose their special status, and will be treated as ordinary characters.
pt_br: <literal>CDATA</literal> é para <quote>Dados de Caractere</quote>. Quando o parser está neste modelo de conteúdo, ele espera ver apenas caracteres. Nesse modelo, os símbolos <literal>&lt;</literal> e <literal>&amp;</literal> perdem seu status especial e serão tratados como caracteres comuns.

source: When using <literal>CDATA</literal> in examples of text marked up in <acronym>XML</acronym>, remember that the content of <literal>CDATA</literal> is not validated. The included text must be check with other means. For example, the content could be written in another document, validated, and then pasted into the <literal>CDATA</literal> section.
pt_br: Ao usar <literal>CDATA</literal> em exemplos de texto marcados em <acronym>XML</acronym>, lembre-se de que o conteúdo de <literal>CDATA</literal> não é validado. O texto incluído deve ser verificado por outros meios. Por exemplo, o conteúdo poderia ser escrito em outro documento, validado e depois colado na seção <literal>CDATA</literal>.

source: Using a <literal>CDATA</literal> Marked Section
pt_br: Usando uma Seção Marcada <literal>CDATA</literal>

source: <literal>INCLUDE</literal> and <literal>IGNORE</literal>
pt_br: <literal>INCLUDE</literal> e <literal>IGNORE</literal>

source: When the keyword is <literal>INCLUDE</literal>, then the contents of the marked section will be processed. When the keyword is <literal>IGNORE</literal>, the marked section is ignored and will not be processed. It will not appear in the output.
pt_br: Quando a palavra-chave é <literal>INCLUDE</literal>, o conteúdo da seção marcada será processado. Quando a palavra-chave é <literal>IGNORE</literal>, a seção marcada é ignorada e não será processada. Não aparecerá na saída.

source: Using <literal>INCLUDE</literal> and <literal>IGNORE</literal> in Marked Sections
pt_br: Usando <literal>INCLUDE</literal> e <literal>IGNORE</literal> em Seções Marcadas

source: By itself, this is not too useful. Text to be removed from the document could be cut out, or wrapped in comments.
pt_br: Por si só, isso não é muito útil. O texto a ser removido do documento pode ser recortado ou estar em forma de comentários.

source: It becomes more useful when controlled by <link linkend="xml-primer-parameter-entities">parameter entities</link>, yet this usage is limited to entity files.
pt_br: Ele se torna mais útil quando controlado por <link linkend="xml-primer-parameter-entities">entidades de parâmetro</link>, mas esse uso é limitado a arquivos de entidades.

source: For example, suppose that documentation was produced in a hard-copy version and an electronic version. Some extra text is desired in the electronic version content that was not to appear in the hard-copy.
pt_br: Por exemplo, suponha que a documentação tenha sido produzida em uma versão impressa e em uma versão eletrônica. Algum texto extra é desejado no conteúdo da versão eletrônica que não deveria aparecer na cópia impressa.

source: Create an entity file that defines general entities to include each chapter and guard these definitions with a parameter entity that can be set to either <literal>INCLUDE</literal> or <literal>IGNORE</literal> to control whether the entity is defined. After these conditional general entity definitions, place one more definition for each general entity to set them to an empty value. This technique makes use of the fact that entity definitions cannot be overridden but the first definition always takes effect. So the inclusion of the chapter is controlled with the corresponding parameter entity. Set to <literal>INCLUDE</literal>, the first general entity definition will be read and the second one will be ignored. Set to <literal>IGNORE</literal>, the first definition will be ignored and the second one will take effect.
pt_br: Crie um arquivo de entidade que defina entidades gerais para incluir cada capítulo e proteja essas definições com uma entidade de parâmetro que pode ser definida como <literal>INCLUDE</literal> ou <literal>IGNORE</literal> para controlar se a entidade está definida . Após essas definições de entidades gerais condicionais, coloque mais uma definição para cada entidade geral para defini-las como um valor vazio. Essa técnica faz uso do fato de que as definições de entidade não podem ser substituídas, mas a primeira definição sempre entra em vigor. Assim, a inclusão do capítulo é controlada com a entidade de parâmetro correspondente. Definido como <literal>INCLUDE</literal>, a primeira definição de entidade geral será lida e a segunda será ignorada. Definido como <literal>IGNORE</literal>, a primeira definição será ignorada e a segunda será utilizada.

source: Using a Parameter Entity to Control a Marked Section
pt_br: Usando uma Entidade de Parâmetro para Controlar uma Seção Marcada

source: When producing the hard-copy version, change the parameter entity's definition to:
pt_br: Ao produzir a versão impressa, altere a definição do parâmetro de entidade para:

source: Modify <filename>entities.ent</filename> to contain the following:
pt_br: Modifique <filename>entidades.ent</filename> para conter o seguinte texto:

source: Normalize <filename>example.xml</filename> and notice that the conditional text is not present in the output document. Set the parameter entity guard to <literal>INCLUDE</literal> and regenerate the normalized document and the text will appear again. This method makes sense if there are more conditional chunks depending on the same condition. For example, to control generating printed or online text.
pt_br: Normalize <filename>example.xml</filename> e observe que o texto condicional não está presente no documento de saída. Altere o parâmetro de entidade para <literal>INCLUDE</literal> e gere novamente o documento normalizado, dessa forma e o texto aparecerá novamente. Esse método faz sentido se houver mais partes condicionais dependendo da mesma condição. Por exemplo, para controlar a geração de texto impresso ou on-line.

source: Conclusion
pt_br: Conclusão

source: That is the conclusion of this <acronym>XML</acronym> primer. For reasons of space and complexity, several things have not been covered in depth (or at all). However, the previous sections cover enough <acronym>XML</acronym> to introduce the organization of the <acronym>FDP</acronym> documentation.
pt_br: Essa é a conclusão deste primer <acronym>XML</acronym>. Por razões de espaço e complexidade, vários assuntos não foram cobertos bem afundo. No entanto, as seções anteriores abrangem o suficiente de <acronym>XML</acronym> para apresentar a organização da documentação do <acronym>FDP</acronym>.

source: Introduction
pt_br: Introdução

source: This chapter describes usage of the <acronym>XHTML</acronym> markup language used for the FreeBSD web site.
pt_br: Este capítulo descreve o uso da linguagem <acronym>XHTML</acronym> markup usada no site do FreeBSD.

source: <acronym>XHTML</acronym> is the <acronym>XML</acronym> version of the HyperText Markup Language, the markup language of choice on the World Wide Web. More information can be found at <uri xlink:href="http://www.w3.org/">http://www.w3.org/</uri>.
pt_br: <acronym>XHTML</acronym> é a versão <acronym>XML</acronym> da HyperText Markup Language, a linguagem markup escolhida na World Wide Web. Mais informações podem ser encontradas em <uri xlink:href="http://www.w3.org/">http://www.w3.org/</uri>.

source: <acronym>XHTML</acronym> is used to mark up pages on the FreeBSD web site. It is usually not used to mark up other documentation, since DocBook offers a far richer set of elements from which to choose. Consequently, <acronym>XHTML</acronym> pages will normally only be encountered when writing for the web site.
pt_br: <acronym>XHTML</acronym> é usado para escrever páginas no site do FreeBSD. Geralmente não é usado para escrever outra documentação, uma vez que o DocBook oferece um conjunto muito mais rico de elementos para se escolher. Consequentemente, as páginas <acronym>XHTML</acronym> normalmente só serão encontradas ao escrever para o web site.

source: <acronym>HTML</acronym> has gone through a number of versions. The <acronym>XML</acronym>-compliant version described here is called <acronym>XHTML</acronym>. The latest widespread version is <acronym>XHTML</acronym> 1.0, available in both <emphasis>strict</emphasis> and <emphasis>transitional</emphasis> variants.
pt_br: O <acronym>HTML</acronym> passou por várias versões. A versão compatível com <acronym>XML</acronym> descrita aqui é chamada <acronym>XHTML</acronym>. A versão mais recente generalizada é o <acronym>XHTML</acronym> 1.0, disponível nas variantes <emphasis>strict</emphasis> e <emphasis>transitional</emphasis>.

source: The <acronym>XHTML</acronym> <acronym>DTDs</acronym> are available from the Ports Collection in <package>textproc/xhtml</package>. They are automatically installed by the <package>textproc/docproj</package> port.
pt_br: Os <acronym>XHTML</acronym> <acronym>DTDs</acronym> estão disponíveis na Coleção de Ports em <package>textproc/xhtml</package>. Eles são automaticamente instalados pelo port <package>textproc/docproj</package>.

source: This is <emphasis>not</emphasis> an exhaustive list of elements, since that would just repeat the documentation for <acronym>XHTML</acronym>. The aim is to list those elements most commonly used. Please post questions about elements or uses not covered here to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>.
pt_br: Isto <emphasis>não</emphasis> é uma lista completa de elementos, uma vez que isso apenas repetiria a documentação de <acronym>XHTML</acronym>. O objetivo é listar os elementos mais utilizados. Por favor, poste perguntas sobre elementos ou usos não abordados aqui na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto de documentação do FreeBSD</link>.

source: In the remainder of this document, when describing elements, <emphasis>inline</emphasis> means that the element can occur within a block element, and does not cause a line break. A <emphasis>block</emphasis> element, by comparison, will cause a line break (and other processing) when it is encountered.
pt_br: No restante deste documento, ao descrever elementos, <emphasis>inline</emphasis> significa que o elemento pode estar dentro de um elemento de bloco e não causa uma quebra de linha. Um elemento <emphasis>block</emphasis>, por outro lado, causará uma quebra de linha (e outro processamento) quando for encontrado.

source: Formal Public Identifier (<acronym>FPI</acronym>)
pt_br: Identificador Público Formal (<acronym>FPI</acronym>)

source: There are a number of <acronym>XHTML</acronym> <acronym>FPI</acronym>s, depending upon the version, or <emphasis>level</emphasis> of <acronym>XHTML</acronym> to which a document conforms. Most <acronym>XHTML</acronym> documents on the FreeBSD web site comply with the transitional version of <acronym>XHTML</acronym> 1.0.
pt_br: Existem vários <acronym>XHTML</acronym> <acronym>FPI</acronym>s, dependendo da versão, ou da <emphasis>versão</emphasis> do <acronym>XHTML</acronym> ao qual um documento está em conformidade. A maioria dos documentos <acronym>XHTML</acronym> no site do FreeBSD está de acordo com a versão de transição do <acronym>XHTML</acronym> 1.0.

source: Sectional Elements
pt_br: Seções de Elementos

source: An <acronym>XHTML</acronym> document is normally split into two sections. The first section, called the <emphasis>head</emphasis>, contains meta-information about the document, such as its title, the name of the author, the parent document, and so on. The second section, the <emphasis>body</emphasis>, contains content that will be displayed to the user.
pt_br: Um documento <acronym>XHTML</acronym> é normalmente dividido em duas seções. A primeira seção, chamada de <emphasis>head</emphasis>, contém meta-informações sobre o documento, como seu título, o nome do autor, o documento pai e assim por diante. A segunda seção, o<emphasis>body</emphasis>, contém o conteúdo que será exibido ao usuário.

source: These sections are indicated with <tag>head</tag> and <tag>body</tag> elements respectively. These elements are contained within the top-level <tag>html</tag> element.
pt_br: Essas seções são indicadas com os elementos <tag>head</tag> e <tag>body</tag>, respectivamente. Esses elementos estão dentro do elemento <tag>html</tag> de nível superior.

source: Normal <acronym>XHTML</acronym> Document Structure
pt_br: Estrutura de um Documento <acronym>XHTML</acronym>

source: Block Elements
pt_br: Elementos Block

source: Headings
pt_br: Cabeçalhos

source: <acronym>XHTML</acronym> has tags to denote headings in the document at up to six different levels.
pt_br: <acronym>XHTML</acronym> tem tags para indicar títulos no documento em até seis níveis diferentes.

source: The largest and most prominent heading is <tag>h1</tag>, then <tag>h2</tag>, continuing down to <tag>h6</tag>.
pt_br: O maior e mais importante título é <tag>h1</tag>, depois <tag>h2</tag>, seguindo até <tag>h6</tag>.

source: The element's content is the text of the heading.
pt_br: O conteúdo do elemento é o texto do cabeçalho.

source: <tag>h1</tag>, <tag>h2</tag>, and Other Header Tags
pt_br: <tag>h1</tag>, <tag>h2</tag> e Outras Tags de Cabeçalho

source: Usage:
pt_br: Uso:

source: Generally, an <acronym>XHTML</acronym> page should have one first level heading (<tag>h1</tag>). This can contain many second level headings (<tag>h2</tag>), which can in turn contain many third level headings. Do not leave gaps in the numbering.
pt_br: Geralmente, uma página <acronym>XHTML</acronym> deve ter um título de primeiro nível (<tag>h1</tag>). Nela pode conter muitos títulos de segundo nível (<tag>h2</tag>), que por sua vez podem conter muitos cabeçalhos de terceiro nível. Não deixe lacunas na numeração.

source: Paragraphs
pt_br: Parágrafos

source: <acronym>XHTML</acronym> supports a single paragraph element, <tag>p</tag>.
pt_br: O <acronym>XHTML</acronym> suporta um único elemento de parágrafo, <tag>p</tag>.

source: <tag>p</tag> Example
pt_br: Exemplo <tag>p</tag>

source: Block Quotations
pt_br: Bloco de Citações

source: A block quotation is an extended quotation from another document that will appear in a separate paragraph.
pt_br: Um bloco de citação é uma citação estendida de outro documento que aparecerá em um parágrafo separado.

source: <tag>blockquote</tag> Example
pt_br: Exemplo <tag>blockquote</tag>

source: Lists
pt_br: Listas

source: <acronym>XHTML</acronym> can present the user with three types of lists: ordered, unordered, and definition.
pt_br: O <acronym>XHTML</acronym> pode apresentar ao usuário três tipos de listas: ordenadas, desordenadas e de definição.

source: Entries in an ordered list will be numbered, while entries in an unordered list will be preceded by bullet points. Definition lists have two sections for each entry. The first section is the term being defined, and the second section is the definition.
pt_br: Entradas em uma lista ordenada serão numeradas, enquanto as entradas em uma lista não ordenada serão precedidas por marcadores. Listas de definições têm duas seções para cada entrada. A primeira seção é o termo que está sendo definido e a segunda seção é a definição.

source: Ordered lists are indicated by the <tag>ol</tag> element, unordered lists by the <tag>ul</tag> element, and definition lists by the <tag>dl</tag> element.
pt_br: As listas ordenadas são indicadas pelo elemento <tag>ol</tag>, listas não ordenadas pelo elemento <tag>ul</tag> e listas de definição pelo elemento <tag>dl</tag>.

source: Ordered and unordered lists contain listitems, indicated by the <tag>li</tag> element. A listitem can contain textual content, or it may be further wrapped in one or more <tag>p</tag> elements.
pt_br: As listas ordenadas e não ordenadas contêm listitens, indicadas pelo elemento <tag>li</tag>. Um listitem pode conter conteúdo textual ou pode ser envoltos em um ou mais elementos <tag>p</tag>.

source: Definition lists contain definition terms (<tag>dt</tag>) and definition descriptions (<tag>dd</tag>). A definition term can only contain inline elements. A definition description can contain other block elements.
pt_br: As listas de definições contêm termos de definição (<tag>dt</tag>) e descrições de definição (<tag>dd</tag>). Um termo de definição pode conter apenas elementos in-line. Uma descrição de definição pode conter outros elementos de bloco.

source: <tag>ul</tag> and <tag>ol</tag> Example
pt_br: Exemplo <tag>ul</tag> and <tag>ol</tag>

source: Definition Lists with <tag>dl</tag>
pt_br: Listas de Definição com <tag>dl</tag>

source: Pre-formatted Text
pt_br: Texto Pré-formatado

source: Pre-formatted text is shown to the user exactly as it is in the file. Text is shown in a fixed font. Multiple spaces and line breaks are shown exactly as they are in the file.
pt_br: Texto pré-formatado é apresentado para o usuário exatamente como está no arquivo. O texto é mostrado em uma fonte fixa. Vários espaços e quebras de linha são mostrados exatamente como estão no arquivo.

source: Wrap pre-formatted text in the <tag>pre</tag> element.
pt_br: Deixe o texto pré-formatado no elemento <tag>pre</tag>.

source: <tag>pre</tag> Example
pt_br: Exemplo <tag>pre</tag>

source: For example, the <tag>pre</tag> tags could be used to mark up an email message:
pt_br: Por exemplo, as tags <tag>pre</tag> podem ser usadas para marcar uma mensagem de email:
