Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: Currently, the FreeBSD documentation is stored in a top level directory called <filename>head/</filename>. Directories below this are named according to the language code they are written in, as defined in ISO639 (<filename>/usr/share/misc/iso639</filename> on a version of FreeBSD newer than 20th January 1999).
pt_br: Atualmente a documentação do FreeBSD é armazenada em um diretório de nível superior chamado <filename>head/</filename>. Os diretórios abaixo desse são nomeados de acordo com o código do idioma em que estão escritos, conforme definido na ISO639 (<filename>/usr/share/misc/iso639</filename> em uma versão do FreeBSD mais recente que 20 de janeiro de 1999).

source: If your language can be encoded in different ways (for example, Chinese) then there should be directories below this, one for each encoding format you have provided.
pt_br: Se o seu idioma puder ser codificado de maneiras diferentes (por exemplo, Chinês), deve haver diretórios abaixo desse, um para cada formato de codificação fornecido.

source: Finally, you should have directories for each document.
pt_br: Finalmente, você deve ter diretórios para cada documento.

source: For example, a hypothetical Swedish translation might look like:
pt_br: Por exemplo, em uma hipotética tradução Sueca ficaria assim:

source: <literal>sv_SE.ISO8859-1</literal> is the name of the translation, in <filename><replaceable>lang</replaceable>.<replaceable>encoding</replaceable></filename> form. Note the two Makefiles, which will be used to build the documentation.
pt_br: <literal>sv_SE.ISO8859-1</literal> é o nome da tradução, no formato <filename> <replaceable>lang</replaceable>.<replaceable>encoding</replaceable> </filename>. Repare nos dois Makefiles, que serão usados ​​para compilar a documentação.

source: Use <citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> to compress up your documentation, and send it to the project.
pt_br: Use<citerefentry><refentrytitle>tar</refentrytitle><manvolnum>1</manvolnum></citerefentry> e <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> para compactar sua documentação e enviá-lo para o projeto.

source: Put <filename>swedish-docs.tar.gz</filename> somewhere. If you do not have access to your own webspace (perhaps your ISP does not let you have any) then you can email Documentation Engineering Team <email>doceng@FreeBSD.org</email>, and arrange to email the files when it is convenient.
pt_br: Coloque <filename>swedish-docs.tar.gz</filename> em algum lugar. Se você não tiver acesso ao seu próprio espaço web (talvez seu ISP não disponibilize um), envie um email para a Equipe de Engenharia da Documentação <email>doceng@FreeBSD.org</email> e combine o envio dos arquivos por email conveniente quando for conveniente.

source: Either way, you should use Bugzilla to submit a report indicating that you have submitted the documentation. It would be very helpful if you could get other people to look over your translation and double check it first, since it is unlikely that the person committing it will be fluent in the language.
pt_br: De qualquer maneira, você deve usar o Bugzilla para enviar um relatório indicando que você enviou a documentação. Seria muito útil se você conseguir outras pessoas para checar sua tradução primeiro, já que é improvável que a pessoa que irá fazer o commit seja fluente no idioma.

source: Someone (probably the Documentation Project Manager, currently Documentation Engineering Team <email>doceng@FreeBSD.org</email>) will then take your translation and confirm that it builds. In particular, the following things will be looked at:
pt_br: Alguém (provavelmente o Gerente do Projeto de Documentação, atualmente Equipe de Engenharia de Documentação <email>doceng@FreeBSD.org</email>) irá então pegar sua tradução e checar se ela compila. Em particular, as seguintes coisas serão analisadas:

source: Do all your files use RCS strings (such as "ID")?
pt_br: Todos os seus arquivos usam strings RCS (tais como "ID")?

source: Does <command>make all</command> in the <filename>sv_SE.ISO8859-1</filename> directory work correctly?
pt_br: O <command>make all</command> no diretório <filename>sv_SE.ISO8859-1</filename> funciona corretamente?

source: Does <command>make install</command> work correctly?
pt_br: O <command>make install</command> funciona corretamente?

source: If there are any problems then whoever is looking at the submission will get back to you to work them out.
pt_br: Se houver algum problema, quem estiver validando a submissão irá entrar em contato para que seja feito as correções.

source: If there are no problems your translation will be committed as soon as possible.
pt_br: Se não houver problemas, sua tradução será disponibilizada o mais rápido possível.

source: Can I include language or country specific text in my translation?
pt_br: Posso incluir um texto específico do idioma ou do país em minha tradução?

source: We would prefer that you did not.
pt_br: Nós preferimos que você não faça isso.

source: For example, suppose that you are translating the Handbook to Korean, and want to include a section about retailers in Korea in your Handbook.
pt_br: Por exemplo, suponha que você esteja traduzindo o Handbook para o Coreano e queira incluir uma seção sobre varejistas na Coreia em seu Handbook.

source: There is no real reason why that information should not be in the English (or German, or Spanish, or Japanese, or …) versions as well. It is feasible that an English speaker in Korea might try to pick up a copy of FreeBSD whilst over there. It also helps increase FreeBSD's perceived presence around the globe, which is not a bad thing.
pt_br: Não há razão pela qual esta informação não deva estar nas versões em Inglês (ou Alemão, ou Espanhol, ou Japonâs, ou …). É possível que uma pessoa que fale Inglês na Coréia possa tentar obter uma cópia do FreeBSD enquanto esteja ali. Isso também ajuda a aumentar a presença perceptível do FreeBSD ao redor do mundo, o que não é uma coisa ruim.

source: If you have country specific information, please submit it as a change to the English Handbook (using Bugzilla) and then translate the change back to your language in the translated Handbook.
pt_br: Se você tiver informações específicas do país, submeta-as como uma alteração do Handbook em Inglês (usando o Bugzilla) e em seguida, traduza a alteração de volta para o seu idioma no Handbook traduzido.

source: Thanks.
pt_br: Obrigado.

source: How should language specific characters be included?
pt_br: Como os caracteres específicos do idioma podem ser incluídos?

source: Non-ASCII characters in the documentation should be included using SGML entities.
pt_br: Caracteres não-ASCII na documentação devem ser incluídos usando entidades SGML.

source: Briefly, these look like an ampersand (&amp;), the name of the entity, and a semi-colon (;).
pt_br: Resumidamente, eles se parecem com um "e" comercial (&amp;), o nome da entidade e um ponto e vírgula (;).

source: The entity names are defined in ISO8879, which is in the ports tree as <package>textproc/iso8879</package>.
pt_br: Os nomes das entidades são definidos em ISO8879, que está na árvore de ports em <package>textproc/iso8879</package>.

source: A few examples include:
pt_br: Alguns exemplos incluem:

source: Entity
pt_br: Entidade

source: Appearance
pt_br: Aparência

source: Small <quote>e</quote> with an acute accent
pt_br: <quote>e</quote> minúsculo com acento agudo

source: Large <quote>E</quote> with an acute accent
pt_br: <quote>E</quote> maiúsculo com acento agudo

source: Small <quote>u</quote> with an umlaut
pt_br: <quote>u</quote> minúsculo com trema

source: After you have installed the iso8879 port, the files in <filename>/usr/local/share/xml/iso8879</filename> contain the complete list.
pt_br: Depois de instalar o port iso8879, os arquivos em <filename> /usr/local/share/xml/iso8879</filename> conterão a lista completa.

source: Addressing the reader
pt_br: Dirigindo-se ao leitor

source: In the English documents, the reader is addressed as <quote>you</quote>, there is no formal/informal distinction as there is in some languages.
pt_br: Nos documentos em Inglês, o leitor é tratado por <quote>você</quote>, não há distinção entre formal/informal como existe em alguns idiomas.

source: If you are translating to a language which does distinguish, use whichever form is typically used in other technical documentation in your language. If in doubt, use a mildly polite form.
pt_br: Se você estiver traduzindo para um idioma que tenha esta distinção, use qualquer forma que normalmente é usada em outras documentações técnicas. Na dúvida, use a forma mais educada.

source: Do I need to include any additional information in my translations?
pt_br: Preciso incluir informações adicionais nas minhas traduções?

source: Yes.
pt_br: Sim.

source: The header of the English version of each document will look something like this:
pt_br: O cabeçalho da versão em Inglês de cada documento será algo parecido com isto:

source: The exact boilerplate may change, but it will always include a $FreeBSD$ line and the phrase <literal>The FreeBSD Documentation Project</literal>. Note that the $FreeBSD part is expanded automatically by Subversion, so it should be empty (just <literal>$FreeBSD$</literal>) for new files.
pt_br: O forma exata pode mudar, mas sempre incluirá uma linha $FreeBSD$ e a frase <literal>The FreeBSD Documentation Project</literal>. Note que a parte do $FreeBSD é expandida automaticamente pelo Subversion, portanto ela deve estar vazia (apenas <literal>$FreeBSD$</literal>) para novos arquivos.

source: Your translated documents should include their own $FreeBSD$ line, and change the <literal>FreeBSD Documentation Project</literal> line to <literal>The FreeBSD <replaceable>language</replaceable> Documentation Project</literal>.
pt_br: Seus documentos traduzidos devem incluir sua própria linha $FreeBSD$, e mudar a linha <literal>FreeBSD Documentation Project</literal> para <literal>The FreeBSD <replaceable>language</replaceable> Documentation Project</literal>.

source: In addition, you should add a third line which indicates which revision of the English text this is based on.
pt_br: Você deve ainda adicionar uma terceira linha que indicará qual revisão do texto em inglês o texto é baseado.

source: So, the Spanish version of this file might start:
pt_br: Assim, a versão em Espanhol desse arquivo pode começar com:

source: <acronym>PO</acronym> Translations
pt_br: Traduções <acronym>PO</acronym>

source: The <link xlink:href="http://www.gnu.org/software/gettext/"><acronym>GNU</acronym> <application>gettext</application></link> system offers translators an easy way to create and maintain translations of documents. Translatable strings are extracted from the original document into a <acronym>PO</acronym> (Portable Object) file. Translated versions of the strings are entered with a separate editor. The strings can be used directly or built into a complete translated version of the original document.
pt_br: O <link xlink:href="http://www.gnu.org/software/gettext/"><acronym>GNU</acronym> <application>gettext</application></link> oferece aos tradutores uma maneira fácil de criar e manter traduções de documentos. Sequências traduzíveis são extraídas do documento original em um arquivo <acronym>PO</acronym> (Portable Object). Versões traduzidas das strings são inseridas com um editor separado. As strings podem ser usadas diretamente ou incorporadas em uma versão traduzida completa do documento original.

source: The procedure shown in <xref linkend="overview-quick-start"/> is assumed to have already been performed. The <literal>TRANSLATOR</literal> option is required and already enabled by default in the <package role="port">textproc/docproj</package> port.
pt_br: Supõe-se que o procedimento mostrado em <xref linkend="overview-quick-start"/> já tenha sido executado. A opção <literal>TRANSLATOR</literal> é necessária e já está ativada por padrão no port <package role="port">textproc/docproj</package>.

source: This example shows the creation of a Spanish translation of the short <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/leap-seconds">Leap Seconds</link> article.
pt_br: Este exemplo mostra a criação de uma tradução em Espanhol do pequeno artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/leap-seconds">Leap Seconds</link>.

source: Install a <acronym>PO</acronym> Editor
pt_br: Instale um Editor <acronym>PO</acronym>

source: A <acronym>PO</acronym> editor is needed to edit translation files. This example uses <package role="ports">editors/poedit</package>.
pt_br: É necessário um editor <acronym>PO</acronym> para editar os arquivos de tradução. Este exemplo utiliza o <package role="ports">editors/poedit</package>.

source: Initial Setup
pt_br: Configuração Inicial

source: When a new translation is first created, the directory structure and <filename>Makefile</filename> must be created or copied from the English original:
pt_br: Quando uma nova tradução é criada pela primeira vez, a estrutura do diretório e o <filename>Makefile</filename> devem ser criados ou copiados do original em Inglês:

source: Create a directory for the new translation. The English article source is in <filename>~/doc/en_US.ISO8859-1/articles/leap-seconds/</filename>. The Spanish translation will go in <filename>~/doc/es_ES.ISO8859-1/articles/leap-seconds/</filename>. The path is the same except for the name of the language directory.
pt_br: Crie um diretório para a nova tradução. O código fonte do artigo em Inglês está em <filename>~/doc/en_US.ISO8859-1/articles/leap-seconds/</filename>. A tradução em Espanhol estará em <filename>~/doc/es_ES.ISO8859-1/articles/leap-seconds/</filename>. O caminho é o mesmo, exceto pelo nome do diretório de idiomas.

source: Copy the <filename>Makefile</filename> from the original document into the translation directory:
pt_br: Copie o <filename>Makefile</filename> do documento original para o diretório de tradução:

source: Translation
pt_br: Tradução

source: Translating a document consists of two steps: extracting translatable strings from the original document, and entering translations for those strings. These steps are repeated until the translator feels that enough of the document has been translated to produce a usable translated document.
pt_br: A tradução de um documento consiste em duas etapas: extrair strings traduzíveis do documento original e inserir as traduções dessas strings. Essas etapas são repetidas até que o tradutor sinta que o documento foi traduzido o suficiente para produzir um documento traduzido que seja utilizável.

source: Extract the translatable strings from the original English version into a <acronym>PO</acronym> file:
pt_br: Extraia as strings traduzíveis da versão original em Inglês para um arquivo <acronym>PO</acronym>:

source: Use a <acronym>PO</acronym> editor to enter translations in the <acronym>PO</acronym> file. There are several different editors available. <filename>poedit</filename> from <package role="port">editors/poedit</package> is shown here.
pt_br: Use um editor <acronym>PO</acronym> para inserir as traduções no arquivo <acronym>PO</acronym>. Existem vários editores diferentes disponíveis. O <filename>poedit</filename> do <package role="port">editors/poedit</package> é mostrado aqui.

source: The <acronym>PO</acronym> file name is the two-character language code followed by an underline and a two-character region code. For Spanish, the file name is <filename>es_ES.po</filename>.
pt_br: O nome do arquivo <acronym>PO</acronym> é o código de idioma de dois caracteres seguido por um código de região de também dois caracteres, seprados por um underline. Para espanhol, o nome do arquivo é <filename>es_ES.po</filename>.

source: Generating a Translated Document
pt_br: Gerando um Documento Traduzido

source: Generate the translated document:
pt_br: Gere o documento traduzido:

source: The name of the generated document matches the name of the English original, usually <filename>article.xml</filename> for articles or <filename>book.xml</filename> for books.
pt_br: O nome do documento gerado corresponde ao nome do original em Inglês, geralmente <filename>article.xml</filename> para artigos ou <filename>book.xml</filename> para livros.

source: Check the generated file by rendering it to <acronym>HTML</acronym> and viewing it with a web browser:
pt_br: Verifique o arquivo gerado renderizando-o para <acronym>HTML</acronym> e exibindo-o com um navegador web:

source: Creating New Translations
pt_br: Criando Novas Traduções

source: The first step to creating a new translated document is locating or creating a directory to hold it. FreeBSD puts translated documents in a subdirectory named for their language and region in the format <filename><replaceable>lang</replaceable>_<replaceable>REGION</replaceable></filename>. <replaceable>lang</replaceable> is a two-character lowercase code. It is followed by an underscore character and then the two-character uppercase <replaceable>REGION</replaceable> code.
pt_br: O primeiro passo para criar um novo documento traduzido é localizar ou criar um diretório para mantê-lo. O FreeBSD coloca documentos traduzidos em um subdiretório nomeado para seu idioma e região no formato <filename><replaceable>lang</replaceable>_<replaceable>REGION</replaceable> </filename>. <replaceable>lang</replaceable> é um código minúsculo de dois caracteres. Ele é seguido por um caractere underline, em seguida, pelo código de duas letras maiúsculas <replaceable>REGION</replaceable>.

source: Language Names
pt_br: Nomes de Idioma

source: Language
pt_br: Língua

source: Region
pt_br: Região

source: Translated Directory Name
pt_br: Nome do Diretório Traduzido

source: <acronym>PO</acronym> File Name
pt_br: Nome do Arquivo <acronym>PO</acronym>

source: Character Set
pt_br: Conjunto de Caracteres

source: English
pt_br: Inglês

source: United States
pt_br: Estados Unidos

source: Danish
pt_br: Dinamarquês

source: Denmark
pt_br: Dinamarca

source: German
pt_br: Alemão

source: Germany
pt_br: Alemanha

source: Greek
pt_br: Grego

source: Greece
pt_br: Grécia

source: Spanish
pt_br: Espanhol

source: Spain
pt_br: Espanha

source: French
pt_br: Francês

source: France
pt_br: França

source: Hungarian
pt_br: Húngaro

source: Hungary
pt_br: Hungria

source: Italian
pt_br: Italiano

source: Italy
pt_br: Itália

source: Japanese
pt_br: Japonês

source: Japan
pt_br: Japão

source: Korean
pt_br: Coreano

source: Korea
pt_br: Coréia

source: Mongolian
pt_br: Mongol

source: Mongolia
pt_br: Mongólia

source: Dutch
pt_br: Holandês

source: Netherlands
pt_br: Holanda

source: Polish
pt_br: Polonês

source: Poland
pt_br: Polônia

source: Portuguese
pt_br: Português

source: Brazil
pt_br: Brasil

source: Russian
pt_br: Russo

source: Russia
pt_br: Rússia

source: Turkish
pt_br: Turco

source: Turkey
pt_br: Turquia

source: Chinese
pt_br: Chinês

source: The translations are in subdirectories of the main documentation directory, here assumed to be <filename>~/doc/</filename> as shown in <xref linkend="overview-quick-start"/>. For example, German translations are located in <filename>~/doc/de_DE.ISO8859-1/</filename>, and French translations are in <filename>~/doc/fr_FR.ISO8859-1/</filename>.
pt_br: As traduções estão em subdiretórios do diretório principal da documentação, aqui assumido como <filename>~/doc/</filename> como mostrado em <xref linkend="overview-quick-start"/>. Por exemplo, as traduções em alemão estão localizadas em <filename>~/doc/de_DE.ISO8859-1/</filename> e as traduções em francês estão em <filename>~/doc/fr_FR.ISO8859-1/</filename>.

source: Each language directory contains separate subdirectories named for the type of documents, usually <filename>articles/</filename> and <filename>books/</filename>.
pt_br: Cada diretório de idiomas contém subdiretórios separados para os tipos de documentos, geralmente <filename>articles/</filename> e <filename>books/</filename>.

source: Combining these directory names gives the complete path to an article or book. For example, the French translation of the NanoBSD article is in <filename>~/doc/fr_FR.ISO8859-1/articles/nanobsd/</filename>, and the Mongolian translation of the Handbook is in <filename>~/doc/mn_MN.UTF-8/books/handbook/</filename>.
pt_br: A combinação desses nomes de diretórios fornece o caminho completo para um artigo ou livro. Por exemplo, a tradução Francesa do artigo NanoBSD está em <filename>~/doc/fr_FR.ISO8859-1/articles/nanobsd/</filename>, e a tradução em Mongol do manual está em <filename>~/doc/mn_MN.UTF-8/books/handbook/</filename>.

source: A new language directory must be created when translating a document to a new language. If the language directory already exists, only a subdirectory in the <filename>articles/</filename> or <filename>books/</filename> directory is needed.
pt_br: Um novo diretório de idioma deve ser criado ao traduzir um documento para um novo idioma. Se o diretório de idiomas já existir, somente um subdiretório no diretório <filename>articles/</filename> ou <filename>books/</filename> será necessário.

source: FreeBSD documentation builds are controlled by a <filename>Makefile</filename> in the same directory. With simple articles, the <filename>Makefile</filename> can often just be copied verbatim from the original English directory. The translation process combines multiple separate <filename>book.xml</filename> and <filename>chapter.xml</filename> files in books into a single file, so the <filename>Makefile</filename> for book translations must be copied and modified.
pt_br: As compilações da documentação do FreeBSD são controladas por um <filename> Makefile </filename> no mesmo diretório. Com artigos simples, o <filename> Makefile </filename> muitas vezes pode ser copiado literalmente do diretório original em inglês. O processo de tradução combina vários arquivos <filename>book.xml</filename> e <filename>chapter.xml</filename> de livros em um único arquivo, portanto, o <filename> Makefile </filename> para as traduções de livros deve ser copiado e modificado.

source: Creating a Spanish Translation of the Porter's Handbook
pt_br: Criando uma Tradução em Espanhol do Porter's Handbook

source: Create a new Spanish translation of the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link>. The original is a book in <filename>~/doc/en_US.ISO8859-1/books/porters-handbook/</filename>.
pt_br: Crie uma nova tradução em Espanhol do <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link>. O original é um livro em <filename>~/doc/en_US.ISO8859-1/books/porters-handbook/</filename>.

source: The Spanish language books directory <filename>~/doc/es_ES.ISO8859-1/books/</filename> already exists, so only a new subdirectory for the Porter's Handbook is needed:
pt_br: O diretório de livros em Espanhol <filename>~/doc/es_ES.ISO8859-1/books/</filename> já existe, portanto, apenas um novo subdiretório para o Porter's Handbook é necessário:

source: Copy the <filename>Makefile</filename> from the original book:
pt_br: Copie o <filename>Makefile</filename> do livro original:

source: Modify the contents of the <filename>Makefile</filename> to only expect a single <filename>book.xml</filename>:
pt_br: Modifique o conteúdo do <filename>Makefile</filename> para esperar apenas um único <filename>book.xml</filename>:
