Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: Validation confirms that the choice of elements, their ordering, and so on, conforms to that listed in the grammar. It does <emphasis>not</emphasis> check whether <emphasis>appropriate</emphasis> markup has been used for the content. If all the filenames in a document were marked up as function names, the parser would not flag this as an error (assuming, of course, that the schema defines elements for filenames and functions, and that they are allowed to appear in the same place).
pt_br: A validação confirma se a escolha dos elementos, sua ordenação e assim por diante estão em conformidade com os listados na gramática. Ela <emphasis>não</emphasis> valida se o markup <emphasis>correto</emphasis> foi utilizado no conteúdo. Se todos os nomes de arquivo em um documento fossem marcados como sendo nomes de função, o analisador não sinalizaria isso como um erro (supondo, é claro, que o schema define elementos para nomes de arquivos e funções e que eles possam aparecer no mesmo local).

source: Most contributions to the Documentation Project will be content marked up in either <acronym>XHTML</acronym> or DocBook, rather than alterations to the schemas. For this reason, this book will not touch on how to write a vocabulary.
pt_br: A maioria das contribuições no Projeto de Documentação utilizará markup <acronym>XHTML</acronym> ou DocBook, em vez de alterações nos schemas. Por esse motivo, este livro não abordará como escrever um vocabulário.

source: Elements, Tags, and Attributes
pt_br: Elementos, Tags e Atributos

source: All the vocabularies written in <acronym>XML</acronym> share certain characteristics. This is hardly surprising, as the philosophy behind <acronym>XML</acronym> will inevitably show through. One of the most obvious manifestations of this philosophy is that of <emphasis>content</emphasis> and <emphasis>elements</emphasis>.
pt_br: Todos os vocabulários escritos em <acronym>XML</acronym> compartilham certas características. Isso não surpreende, pois a filosofia por trás do <acronym>XML</acronym> inevitavelmente irá transparecer. Uma das manifestações mais óbvias desta filosofia é a do <emphasis>conteúdo</emphasis> e dos <emphasis>elementos</emphasis>.

source: Documentation, whether it is a single web page, or a lengthy book, is considered to consist of content. This content is then divided and further subdivided into elements. The purpose of adding markup is to name and identify the boundaries of these elements for further processing.
pt_br: A documentação, seja uma única página web ou um livro extenso, é considerada como conteúdo. Este conteúdo é então dividido e subdividido em elementos. A finalidade de adicionar markup é nomear e identificar os limites desses elementos para processamento futuro.

source: For example, consider a typical book. At the very top level, the book is itself an element. This <quote>book</quote> element obviously contains chapters, which can be considered to be elements in their own right. Each chapter will contain more elements, such as paragraphs, quotations, and footnotes. Each paragraph might contain further elements, identifying content that was direct speech, or the name of a character in the story.
pt_br: Por exemplo, considere um livro típico. No maior nível, o livro é um elemento. Este elemento <quote>livro</quote> contém obviamente capítulos, que podem ser considerados elementos também. Cada capítulo conterá mais elementos, como parágrafos, citações e notas de rodapé. Cada parágrafo pode conter outros elementos, identificando o conteúdo que foi um discurso direto ou o nome de um personagem na história.

source: It may be helpful to think of this as <quote>chunking</quote> content. At the very top level is one chunk, the book. Look a little deeper, and there are more chunks, the individual chapters. These are chunked further into paragraphs, footnotes, character names, and so on.
pt_br: Pode ser útil pensar nisso como um conteúdo por <quote>pedaços</quote>. No nível mais alto é um pedaço, o livro. Olhando um pouco mais, encontra-se mais pedaços, os capítulos individuais. Estes são segmentados em parágrafos, notas de rodapé, nomes de caracteres e assim por diante.

source: Notice how this differentiation between different elements of the content can be made without resorting to any <acronym>XML</acronym> terms. It really is surprisingly straightforward. This could be done with a highlighter pen and a printout of the book, using different colors to indicate different chunks of content.
pt_br: Observe como essa diferenciação entre diferentes elementos do conteúdo pode ser feita sem recorrer a quaisquer termos <acronym>XML</acronym>. É realmente surpreendentemente simples. Isso pode ser feito com uma caneta marca-texto e um livro impresso, usando cores diferentes para indicar diferentes partes do conteúdo.

source: Of course, we do not have an electronic highlighter pen, so we need some other way of indicating which element each piece of content belongs to. In languages written in <acronym>XML</acronym> (<acronym>XHTML</acronym>, DocBook, et al) this is done by means of <emphasis>tags</emphasis>.
pt_br: É claro que não temos um marca-texto eletrônico, então precisamos de outra maneira de indicar a qual elemento cada parte do conteúdo pertence. Em idiomas escritos em <acronym>XML</acronym> (<acronym>XHTML</acronym>, DocBook, e outros) isto é feito por meio de <emphasis>tags</emphasis>.

source: A tag is used to identify where a particular element starts, and where the element ends. <emphasis>The tag is not part of the element itself</emphasis>. Because each grammar was normally written to mark up specific types of information, each one will recognize different elements, and will therefore have different names for the tags.
pt_br: Uma tag é usada para identificar onde um determinado elemento começa e onde o elemento termina. <emphasis>A tag não faz parte do próprio elemento</emphasis>. Como cada gramática foi normalmente escrita para marcar tipos específicos de informação, cada um reconhecerá elementos diferentes e, portanto, terá nomes diferentes para as tags.

source: For an element called <replaceable>element-name</replaceable> the start tag will normally look like <tag class="starttag"><replaceable>element-name</replaceable></tag>. The corresponding closing tag for this element is <tag class="endtag"><replaceable>element-name</replaceable></tag>.
pt_br: Para um elemento chamado <replaceable>nome-do-elemento</replaceable>, a tag inicial normalmente se parecerá com <tag class="starttag"><replaceable>nome-do-elemento</replaceable></tag>. A tag de fechamento correspondente para este elemento é <tag class="endtag"><replaceable>nome-do-elemento</replaceable></tag>.

source: Using an Element (Start and End Tags)
pt_br: Utilizando um Elemento (Tag Inicial e Final)

source: <acronym>XHTML</acronym> has an element for indicating that the content enclosed by the element is a paragraph, called <tag>p</tag>.
pt_br: <acronym>XHTML</acronym> possui um elemento para indicar que o conteúdo incluído pelo elemento é um parágrafo, chamado <tag>p</tag>.

source: Some elements have no content. For example, in <acronym>XHTML</acronym>, a horizontal line can be included in the document. For these <quote>empty</quote> elements, <acronym>XML</acronym> introduced a shorthand form that is completely equivalent to the two-tag version:
pt_br: Alguns elementos não possuem conteúdo. Por exemplo, em <acronym>XHTML</acronym>, uma linha horizontal pode ser incluída no documento. Para estes elementos <quote>vazios</quote>, <acronym>XML</acronym> trouxe um formato abreviado que é completamente equivalente à versão de duas tags:

source: Using an Element Without Content
pt_br: Usando um Elemento Sem Conteúdo

source: <acronym>XHTML</acronym> has an element for indicating a horizontal rule, called <tag>hr</tag>. This element does not wrap content, so it looks like this:
pt_br: <acronym>XHTML</acronym> tem um elemento para indicar uma linha horizontal, chamada <tag>hr</tag>. Esse elemento não possui conteúdo, e se parece com isso:

source: The shorthand version consists of a single tag:
pt_br: A versão abreviada consiste em uma única tag:

source: As shown above, elements can contain other elements. In the book example earlier, the book element contained all the chapter elements, which in turn contained all the paragraph elements, and so on.
pt_br: Como mostrado acima, os elementos podem conter outros elementos. No exemplo do livro anterior, o elemento livro continha elementos de capítulo, que por sua vez continham elementos de parágrafo, e assim por diante.

source: Elements Within Elements; <tag>em</tag>
pt_br: Elementos Dentro de Elementos; <tag>em</tag>

source: The grammar consists of rules that describe which elements can contain other elements, and exactly what they can contain.
pt_br: A gramática consiste em regras que descrevem quais elementos podem conter outros elementos e exatamente o que eles podem conter.

source: People often confuse the terms tags and elements, and use the terms as if they were interchangeable. They are not.
pt_br: As pessoas geralmente confundem os termos tags e elementos e usam os termos como se fossem intercambiáveis. Eles não são.

source: An element is a conceptual part of your document. An element has a defined start and end. The tags mark where the element starts and ends.
pt_br: Um elemento é uma parte conceitual do seu documento. Um elemento tem início e fim definidos. As tags marcam onde o elemento começa e termina.

source: When this document (or anyone else knowledgeable about <acronym>XML</acronym>) refers to <quote>the <tag class="starttag">p</tag> tag</quote> they mean the literal text consisting of the three characters <literal>&lt;</literal>, <literal>p</literal>, and <literal>&gt;</literal>. But the phrase <quote>the <tag>p</tag> element</quote> refers to the whole element.
pt_br: Quando este documento (ou qualquer pessoa com conhecimento sobre <acronym>XML</acronym>) refere-se a <quote>a <tag class="starttag">p</tag> tag</quote> significa o texto literal que consiste nos três caracteres <literal>&lt;</literal>, <literal>p</literal>, e <literal>&gt;</literal>. Mas a frase <quote>o elemento <tag>p</tag></quote> refere-se ao elemento inteiro.

source: This distinction <emphasis>is</emphasis> very subtle. But keep it in mind.
pt_br: Essa distinção <emphasis>é</emphasis> muito sutil. Mas tenha isso em mente.

source: Elements can have attributes. An attribute has a name and a value, and is used for adding extra information to the element. This might be information that indicates how the content should be rendered, or might be something that uniquely identifies that occurrence of the element, or it might be something else.
pt_br: Elementos podem ter atributos. Um atributo tem um nome e um valor e é usado para adicionar informações extras ao elemento. Isso pode ser uma informação que indica como o conteúdo deve ser renderizado ou pode ser algo que identifica exclusivamente essa ocorrência do elemento ou isso pode ser outra coisa também.

source: An element's attributes are written <emphasis>inside</emphasis> the start tag for that element, and take the form <literal><replaceable>attribute-name</replaceable>="<replaceable>attribute-value</replaceable>"</literal>.
pt_br: Os atributos de um elemento são escritos <emphasis>dentro</emphasis> da tag de início para aquele elemento, e toma o formato <literal><replaceable>nome-do-atributo</replaceable>="<replaceable>valor-do-atributo</replaceable>"</literal>.

source: In <acronym>XHTML</acronym>, the <tag>p</tag> element has an attribute called <tag class="attribute">align</tag>, which suggests an alignment (justification) for the paragraph to the program displaying the <acronym>XHTML</acronym>.
pt_br: Em <acronym>XHTML</acronym>, o elemento <tag>p</tag> tem um atributo chamado <tag class="attribute">align</tag>, que sugere um alinhamento (justificação) do parágrafo para o programa exibindo o <acronym>XHTML</acronym>.

source: The <tag class="attribute">align</tag> attribute can take one of four defined values, <literal>left</literal>, <literal>center</literal>, <literal>right</literal> and <literal>justify</literal>. If the attribute is not specified then the default is <literal>left</literal>.
pt_br: O atributo <tag class="attribute">align</tag> pode ter um dos quatro valores definidos, <literal>left</literal>, <literal>center</literal>, <literal>right</literal> e <literal>justify</literal>. Se o atributo não for especificado, o padrão será <literal>left</literal>.

source: Using an Element with an Attribute
pt_br: Usando um Elemento com um Atributo

source: Some attributes only take specific values, such as <literal>left</literal> or <literal>justify</literal>. Others allow any value.
pt_br: Alguns atributos só aceitam valores específicos, como <literal>left</literal> ou <literal>justify</literal>. Outros permitem qualquer valor.

source: Single Quotes Around Attributes
pt_br: Aspas Simples nos Atributos

source: Attribute values in <acronym>XML</acronym> must be enclosed in either single or double quotes. Double quotes are traditional. Single quotes are useful when the attribute value contains double quotes.
pt_br: Os valores de atributos em <acronym>XML</acronym> devem ser colocados entre aspas simples ou duplas. Aspas duplas são tradicionais. Aspas simples são úteis quando o valor do atributo contém aspas duplas.

source: Information about attributes, elements, and tags is stored in catalog files. The Documentation Project uses standard DocBook catalogs and includes additional catalogs for FreeBSD-specific features. Paths to the catalog files are defined in an environment variable so they can be found by the document build tools.
pt_br: Informações sobre atributos, elementos e tags são armazenadas em arquivos de catálogo. O Projeto de Documentação usa catálogos padrão do DocBook e inclui catálogos adicionais para recursos específicos do FreeBSD. Os caminhos para os arquivos de catálogo são definidos em uma variável de ambiente para que possam ser encontradas pelas ferramentas de compilação de documentos.

source: To Do…
pt_br: Para Fazer…

source: Before running the examples in this document, install <package>textproc/docproj</package> from the FreeBSD Ports Collection. This is a <emphasis>meta-port</emphasis> that downloads and installs the standard programs and supporting files needed by the Documentation Project. <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> users must use <command>rehash</command> for the shell to recognize new programs after they have been installed, or log out and then log back in again.
pt_br: Antes de rodar os exemplos deste documento, instale o <package>textproc/docproj</package> pela Coleção de Ports do FreeBSD. Este é um <emphasis>meta-port</emphasis> que baixa e instala os programas padrão e arquivos de suporte necessários para o Projeto de Documentação. Os usuários de <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> devem executar o <command>rehash</command> para que o shell reconheça os novos binários depois de instalados ou efetue logout e, em seguida, faça login novamente.

source: Create <filename>example.xml</filename>, and enter this text:
pt_br: Crie <filename>example.xml</filename> e insira este texto:

source: Try to validate this file using an <acronym>XML</acronym> parser.
pt_br: Tente validar esse arquivo usando um parser <acronym>XML</acronym>.

source: <package>textproc/docproj</package> includes the <command>xmllint</command> <link linkend="xml-primer-validating">validating parser</link>.
pt_br: O <package>textproc/docproj</package> inclui o <link linkend="xml-primer-validating">parser</link> <command>xmllint</command>.

source: Use <command>xmllint</command> to validate the document:
pt_br: Execute <command>xmllint</command> para validar o documento:

source: <command>xmllint</command> returns without displaying any output, showing that the document validated successfully.
pt_br: <command>xmllint</command> não retorna nada se o documento for validado com sucesso.

source: See what happens when required elements are omitted. Delete the line with the <tag class="starttag">title</tag> and <tag class="endtag">title</tag> tags, and re-run the validation.
pt_br: Veja o que acontece quando os elementos obrigatórios são omitidos. Exclua a linha com as tags <tag class="starttag">title</tag> e <tag class="endtag">title</tag>, então execute novamente a validação.

source: This shows that the validation error comes from the <replaceable>fifth</replaceable> line of the <replaceable>example.xml</replaceable> file and that the content of the <tag class="starttag">head</tag> is the part which does not follow the rules of the <acronym>XHTML</acronym> grammar.
pt_br: Isso mostra que o erro de validação vem da linha <replaceable>cinco</replaceable> do arquivo <replaceable>example.xml</replaceable> e que o conteúdo de <tag class="starttag">head</tag> é a parte que não segue as regras da gramática <acronym>XHTML</acronym>.

source: Then <command>xmllint</command> shows the line where the error was found and marks the exact character position with a <literal>^</literal> sign.
pt_br: Em seguida, o <command>xmllint</command> mostra a linha onde o erro foi encontrado e marca a posição exata com um sinal <literal>^</literal>.

source: Replace the <tag>title</tag> element.
pt_br: Substitua o elemento <tag>title</tag>.

source: The DOCTYPE Declaration
pt_br: A Declaração DOCTYPE

source: The beginning of each document can specify the name of the <acronym>DTD</acronym> to which the document conforms. This DOCTYPE declaration is used by <acronym>XML</acronym> parsers to identify the <acronym>DTD</acronym> and ensure that the document does conform to it.
pt_br: No início de cada documento pode-se especificar o nome do <acronym>DTD</acronym> ao qual o documento está em conformidade. Esta declaração DOCTYPE é usada por <acronym>XML</acronym> parsers para identificar o <acronym>DTD</acronym> e garantir que o documento esteja de acordo com ele.

source: A typical declaration for a document written to conform with version 1.0 of the <acronym>XHTML</acronym> <acronym>DTD</acronym> looks like this:
pt_br: Uma declaração típica para um documento escrito em conformidade com a versão 1.0 do <acronym>XHTML</acronym> <acronym>DTD</acronym> se parece com isto:

source: That line contains a number of different components.
pt_br: Essa linha contém vários componentes diferentes.

source: The <emphasis>indicator</emphasis> shows this is an <acronym>XML</acronym> declaration.
pt_br: O <emphasis>indicador</emphasis> mostra que esta é uma declaração <acronym>XML</acronym>.

source: Shows that this is an <acronym>XML</acronym> declaration of the document type.
pt_br: Mostra que esta é uma declaração <acronym>XML</acronym> do tipo de documento.

source: Names the first <link linkend="xml-primer-elements">element</link> that will appear in the document.
pt_br: Nomeia o primeiro <link linkend="xml-primer-elements">elemento</link> que aparecerá no documento.

source: <primary>Formal Public Identifier</primary>
pt_br: <primary>Identificador Público Formal</primary>

source: Lists the Formal Public Identifier (<acronym>FPI</acronym>) <_:indexterm-1/> for the <acronym>DTD</acronym> to which this document conforms. The <acronym>XML</acronym> parser uses this to find the correct <acronym>DTD</acronym> when processing this document.
pt_br: Lista o Identificador Público Formal (<acronym>FPI</acronym>) <_:indexterm-1/> para o <acronym>DTD</acronym> com o qual este documento está em conformidade. O <acronym>XML</acronym> parser usa isso para encontrar o <acronym>DTD</acronym> correto ao processar este documento.

source: <literal>PUBLIC</literal> is not a part of the <acronym>FPI</acronym>, but indicates to the <acronym>XML</acronym> processor how to find the <acronym>DTD</acronym> referenced in the <acronym>FPI</acronym>. Other ways of telling the <acronym>XML</acronym> parser how to find the <acronym>DTD</acronym> are shown <link linkend="xml-primer-fpi-alternatives">later</link>.
pt_br: <literal>PUBLIC</literal> não faz parte do <acronym>FPI</acronym>, mas indica ao <acronym>XML</acronym> parser como encontrar o <acronym>DTD</acronym> mencionado no <acronym>FPI</acronym>. Outras formas de informar ao <acronym>XML</acronym> parser como encontrar o <acronym>DTD</acronym> serão informadas <link linkend="xml-primer-fpi-alternatives">depois</link>.

source: A local filename or a <acronym>URL</acronym> to find the <acronym>DTD</acronym>.
pt_br: Um nome de arquivo local ou uma <acronym>URL</acronym> para encontrar o <acronym>DTD</acronym>.

source: Ends the declaration and returns to the document.
pt_br: Termina a declaração e retorna ao documento.

source: Formal Public Identifiers (<acronym>FPI</acronym>s)
pt_br: Identificadores Públicos Formais (<acronym>FPI</acronym>s)

source: It is not necessary to know this, but it is useful background, and might help debug problems when the <acronym>XML</acronym> processor cannot locate the <acronym>DTD</acronym>.
pt_br: Não é necessário conhecer isso, mas pode ser útil e ajudar a depurar problemas quando o <acronym>XML</acronym> parser não conseguir localizar o <acronym>DTD</acronym>.

source: <acronym>FPI</acronym>s must follow a specific syntax:
pt_br: <acronym>FPI</acronym>s devem seguir uma sintaxe específica:

source: "<replaceable>Owner</replaceable>//<replaceable>Keyword</replaceable> <replaceable>Description</replaceable>//<replaceable>Language</replaceable>"
pt_br: "<replaceable>Proprietário</replaceable> //<replaceable>Palavra-chave</replaceable> <replaceable>Descrição</replaceable> //<replaceable>Idioma</replaceable>"

source: <replaceable>Owner</replaceable>
pt_br: <replaceable>Proprietário</replaceable>

source: The owner of the <acronym>FPI</acronym>.
pt_br: O proprietário do <acronym>FPI</acronym>.

source: The beginning of the string identifies the owner of the <acronym>FPI</acronym>. For example, the <acronym>FPI</acronym> <literal>"ISO 8879:1986//ENTITIES Greek Symbols//EN"</literal> lists <literal>ISO 8879:1986</literal> as being the owner for the set of entities for Greek symbols. <acronym>ISO</acronym> 8879:1986 is the International Organization for Standardization (<acronym>ISO</acronym>) number for the <acronym>SGML</acronym> standard, the predecessor (and a superset) of <acronym>XML</acronym>.
pt_br: O início da string identifica o proprietário do <acronym>FPI</acronym>. Por exemplo, o <acronym>FPI</acronym> <literal>"ISO 8879:1986//ENTITIES Greek Symbols//EN"</literal> lista <literal>ISO 8879:1986</literal> como sendo o proprietário para o conjunto de entidades de Símbolos Gregos. <acronym>ISO</acronym> 8879:1986 é o número na International Organization for Standardization (<acronym>ISO</acronym>) para o padrão <acronym>SGML</acronym>, o predecessor (e um superset) do <acronym>XML</acronym>.

source: Otherwise, this string will either look like <literal>-//<replaceable>Owner</replaceable></literal> or <literal>+//<replaceable>Owner</replaceable></literal> (notice the only difference is the leading <literal>+</literal> or <literal>-</literal>).
pt_br: Caso contrário, essa sequência seria parecida com <literal>-//<replaceable>Proprietário</replaceable></literal> ou <literal>+//<replaceable>Proprietário</replaceable></literal> (observe que a única diferença é o <literal>+</literal> ou <literal>-</literal>).

source: If the string starts with <literal>-</literal> then the owner information is unregistered, with a <literal>+</literal> identifying it as registered.
pt_br: Se a string começar com <literal>-</literal>, a informação do proprietário não é registrada, com o <literal>+</literal> identifica como registrada.
