Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: Keep in mind that <literal>&lt;</literal> and <literal>&amp;</literal> still are recognized as special characters in pre-formatted text. This is why the example shown had to use <literal>&amp;lt;</literal> instead of <literal>&lt;</literal>. For consistency, <literal>&amp;gt;</literal> was used in place of <literal>&gt;</literal>, too. Watch out for the special characters that may appear in text copied from a plain-text source, like an email message or program code.
pt_br: Tenha em mente que <literal>&lt;</literal> e <literal>&amp;</literal> ainda são reconhecidos como caracteres especiais no texto pré-formatado. É por isso que o exemplo mostrado teve que usar <literal>&amp;lt;</literal> em vez de <literal>&lt;</literal>. Para consistência, o <literal>&amp;gt;</literal> também foi usado no lugar de <literal>&gt;</literal>. Fique atento com os caracteres especiais que podem aparecer no texto copiado de uma fonte de texto simples, como uma mensagem de e-mail ou código de programa.

source: Tables
pt_br: Tabelas

source: Mark up tabular information using the <tag>table</tag> element. A table consists of one or more table rows (<tag>tr</tag>), each containing one or more cells of table data (<tag>td</tag>). Each cell can contain other block elements, such as paragraphs or lists. It can also contain another table (this nesting can repeat indefinitely). If the cell only contains one paragraph then the <tag>p</tag>element is not needed.
pt_br: Marque as informações tabulares usando o elemento <tag>table</tag>. Uma tabela consiste em uma ou mais linhas da tabela (<tag>tr</tag>), cada uma contendo uma ou mais células de dados da tabela (<tag>td</tag>). Cada célula pode conter outros elementos de bloco, como parágrafos ou listas. Também pode conter outra tabela (esse aninhamento pode repetir indefinidamente). Se a célula contiver apenas um parágrafo, o elemento <tag>p</tag> não será necessário.

source: Simple Use of <tag>table</tag>
pt_br: Uso Simples de <tag>table</tag>

source: A cell can span multiple rows and columns by adding the <tag class="attribute">rowspan</tag> or <tag class="attribute">colspan</tag> attributes with values for the number of rows or columns to be spanned.
pt_br: Uma célula pode abranger várias linhas e colunas adicionando os atributos <tag class="attribute">rowspan</tag> ou <tag class="attribute">colspan</tag> com valores para o número de linhas ou colunas a serem abrangido.

source: Using <tag class="attribute">rowspan</tag>
pt_br: Usando <tag class="attribute">rowspan</tag>

source: Using <tag class="attribute">colspan</tag>
pt_br: Usando <tag class="attribute">colspan</tag>

source: Using <tag class="attribute">rowspan</tag> and <tag class="attribute">colspan</tag> Together
pt_br: Usando <tag class="attribute">rowspan</tag> e <tag class="attribute">colspan</tag> Juntos

source: In-line Elements
pt_br: Elementos In-line

source: Emphasizing Information
pt_br: Realçando Informação

source: Two levels of emphasis are available in <acronym>XHTML</acronym>, <tag>em</tag> and <tag>strong</tag>. <tag>em</tag> is for a normal level of emphasis and <tag>strong</tag> indicates stronger emphasis.
pt_br: Dois níveis de ênfase estão disponíveis em <acronym>XHTML</acronym>, <tag>em</tag> e <tag>strong</tag>. <tag>em</tag> é para um nível normal de ênfase e <tag>strong</tag> indica ênfase mais forte.

source: <tag>em</tag> is typically rendered in italic and <tag>strong</tag> is rendered in bold. This is not always the case, and should not be relied upon. According to best practices, web pages only hold structural and semantical information, and stylesheets are later applied to them. Think of semantics, not formatting, when using these tags.
pt_br: <tag>em</tag> é normalmente renderizado em itálico e o <tag>strong</tag> é renderizado em negrito. Isso nem sempre assim e não deve ser considerado ao pé da letra. De acordo com as práticas recomendadas, as páginas web armazenam apenas informações estruturais e semânticas, e as folhas de estilo são aplicadas posteriormente a elas. Pense na semântica, não na formatação, ao usar essas tags.

source: <tag>em</tag> and <tag>strong</tag> Example
pt_br: Exemplo <tag>em</tag> e <tag>strong</tag>

source: Indicating Fixed-Pitch Text
pt_br: Indicando Texto Fixo

source: Content that should be rendered in a fixed pitch (typewriter) typeface is tagged with <tag>tt</tag> (for <quote>teletype</quote>).
pt_br: O conteúdo que deve ser renderizado em um tipo fixo de texto (typewriter) é marcado com <tag>tt</tag> (para <quote>teletype</quote>).

source: <tag>tt</tag> Example
pt_br: Exemplo <tag>tt</tag>

source: Links are also inline elements.
pt_br: Links também são elementos in-line.

source: Linking to Other Documents on the Web
pt_br: Criando Links para Outros Documentos na Web

source: A link points to the <acronym>URL</acronym> of a document on the web. The link is indicated with <tag>a</tag>, and the <tag class="attribute">href</tag> attribute contains the <acronym>URL</acronym> of the target document. The content of the element becomes the link, indicated to the user by showing it in a different color or with an underline.
pt_br: Um link aponta para uma <acronym>URL</acronym> de um documento na web. O link é indicado com a <tag>a</tag>, e o atributo <tag class="attribute">href</tag> contém a <acronym>URL</acronym> do documento de destino. O conteúdo do elemento se torna o link, indicado ao usuário, mostrando-o em uma cor diferente ou com um sublinhado.

source: Using <tag class="starttag">a href="..."</tag>
pt_br: Usando <tag class="starttag">a href="..."</tag>

source: This link always takes the user to the top of the linked document.
pt_br: Esse link sempre leva o usuário ao topo do documento que foi linkado.

source: Linking to Specific Parts of Documents
pt_br: Criando Links para Partes Específicas de Documentos

source: To link to a specific point within a document, that document must include an <emphasis>anchor</emphasis> at the desired point. Anchors are included by setting the <tag class="attribute">id</tag> attribute of an element to a name. This example creates an anchor by setting the <tag class="attribute">id</tag> attribute of a <tag class="element">p</tag> element.
pt_br: Para linkar a um ponto específico dentro de um documento, esse documento deve incluir uma <emphasis>âncora</emphasis> no ponto desejado. As âncoras são incluídas configurando o atributo <tag class="attribute">id</tag> de um elemento para um nome. Este exemplo cria uma âncora definindo o atributo <tag class="attribute">id</tag> de um elemento <tag class="element">p</tag>.

source: Creating an Anchor
pt_br: Criando uma Âncora

source: Links to anchors are similar to plain links, but include a <literal>#</literal> symbol and the anchor's <acronym>ID</acronym> at the end of the <acronym>URL</acronym>.
pt_br: Links para âncoras são semelhantes aos links simples, mas incluem um símbolo <literal>#</literal> e o <acronym>ID</acronym> da âncora no final da <acronym>URL</acronym>.

source: Linking to a Named Part of a Different Document
pt_br: Criando Link para uma Parte Nomeada de um Outro Documento

source: The <literal>samplepara</literal> example is part of a document called <filename>foo.html</filename>. A link to that specific paragraph in the document is constructed in this example.
pt_br: O exemplo <literal>samplepara</literal> é parte de um documento chamado <filename>foo.html</filename>. Um link para esse parágrafo específico no documento é construído neste exemplo.

source: To link to a named anchor within the same document, omit the document's <acronym>URL</acronym>, and just use the <literal>#</literal> symbol followed by the name of the anchor.
pt_br: Para vincular-se a uma âncora nomeada no mesmo documento, omita a <acronym>URL</acronym>do documento, e use apenas o símbolo <literal>#</literal> seguido do nome da âncora.

source: Linking to a Named Part of the Same Document
pt_br: Criando Link para uma Parte Nomeada no Mesmo Documento

source: The <literal>samplepara</literal> example resides in this document. To link to it:
pt_br: O exemplo <literal>samplepara</literal> reside neste documento. Para vincular a ele:

source: This chapter is an introduction to DocBook as it is used for FreeBSD documentation. DocBook is a large and complex markup system, but the subset described here covers the parts that are most widely used for FreeBSD documentation. While a moderate subset is covered, it is impossible to anticipate every situation. Please post questions that this document does not answer to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>.
pt_br: Este capítulo é uma introdução ao DocBook e como ele é usado na documentação do FreeBSD. O DocBook é um sistema de marcação extenso e complexo, mas o subconjunto descrito aqui abrange as partes mais usadas para a documentação do FreeBSD. Enquanto um subconjunto moderado é coberto, é impossível antecipar todas as situações. Por favor, poste questões que este documento não responde à <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto de documentação do FreeBSD</link>.

source: A short history can be found under <link xlink:href="http://www.oasis-open.org/docbook/intro.shtml#d0e41">http://www.oasis-open.org/docbook/intro.shtml#d0e41</link>.
pt_br: Um breve histórico pode ser encontrado em <link xlink:href="http://www.oasis-open.org/docbook/intro.shtml#d0e41">http://www.oasis-open.org/docbook/intro.shtml#d0e41</link>.

source: DocBook was originally developed by HaL Computer Systems and O'Reilly &amp; Associates to be a Document Type Definition (<acronym>DTD</acronym>) for writing technical documentation <_:footnote-1/>. Since 1998 it is maintained by the <link xlink:href="http://www.oasis-open.org/committees/tc_home.php?wg_abbrev=docbook"> DocBook Technical Committee</link>. As such, and unlike LinuxDoc and <acronym>XHTML</acronym>, DocBook is very heavily oriented towards markup that describes <emphasis>what</emphasis> something is, rather than describing <emphasis>how</emphasis> it should be presented.
pt_br: DocBook foi originalmente desenvolvido por HaL Computer Systems and O'Reilly &amp; Associates para ser uma Definição de Tipo de Documento (<acronym>DTD</acronym>) para escrever documentação técnica <_:footnote-1/>. Desde 1998, ele é mantido pelo <link xlink:href="http://www.oasis-open.org/committees/tc_home.php?wg_abbrev=docbook">Comitê Técnico do DocBook</link>. Como tal, e ao contrário do LinuxDoc e do <acronym>XHTML</acronym>, o DocBook é fortemente orientado para um markup que descreve <emphasis>o que</emphasis> alguma coisa é, em vez de descrever <emphasis>como</emphasis> deve ser apresentado.

source: The DocBook <acronym>DTD</acronym> is available from the Ports Collection in the <package>textproc/docbook-xml</package> port. It is automatically installed as part of the <package>textproc/docproj</package> port.
pt_br: O DocBook <acronym>DTD</acronym> está disponível na coleção Ports <package>textproc/docbook-xml</package>. Ele é instalado automaticamente como parte do port <package>textproc/docproj</package>.

source: Some elements may exist in two forms, <emphasis>formal</emphasis> and <emphasis>informal</emphasis>. Typically, the formal version of the element will consist of a title followed by the informal version of the element. The informal version will not have a title.
pt_br: Alguns elementos podem existir em duas formas, <emphasis>formal</emphasis> e <emphasis>informal</emphasis>. Normalmente, a versão formal do elemento consistirá em um título seguido pela versão informal do elemento. A versão informal não terá um título.

source: FreeBSD Extensions
pt_br: Extensões do FreeBSD

source: The FreeBSD Documentation Project has extended the DocBook <acronym>DTD</acronym> with additional elements and entities. These additions serve to make some of the markup easier or more precise.
pt_br: O Projeto de Documentação do FreeBSD estendeu o DocBook <acronym>DTD</acronym> com elementos e entidades adicionais. Essas adições servem para tornar algumas das marcações mais fáceis ou mais precisas.

source: Throughout the rest of this document, the term <quote>DocBook</quote> is used to mean the FreeBSD-extended DocBook <acronym>DTD</acronym>.
pt_br: Ao longo deste documento, o termo <quote>DocBook</quote> é usado para indicar o DocBook <acronym>DTD</acronym> estendido do FreeBSD.

source: Most of these extensions are not unique to FreeBSD, it was just felt that they were useful enhancements for this particular project. Should anyone from any of the other *nix camps (NetBSD, OpenBSD, Linux, …) be interested in collaborating on a standard DocBook extension set, please contact Documentation Engineering Team <email>doceng@FreeBSD.org</email>.
pt_br: A maioria dessas extensões não é exclusiva do FreeBSD, foi apenas identificado que elas eram melhorias úteis para este projeto. Se alguém de qualquer um dos outros *nix (NetBSD, OpenBSD, Linux,…) estiverem interessados em colaborar em um conjunto de extensão DocBook padrão, entre em contato com a Equipe de Engenharia de Documentação <email>doceng@FreeBSD.org</email>.

source: FreeBSD Elements
pt_br: Elementos do FreeBSD

source: The additional FreeBSD elements are not (currently) in the Ports Collection. They are stored in the FreeBSD Subversion tree, as <link xlink:href="http://svnweb.FreeBSD.org/doc/head/share/xml/freebsd.dtd">head/share/xml/freebsd.dtd</link>.
pt_br: Os elementos adicionais do FreeBSD não estão (atualmente) na Coleção de Ports. Eles são armazenados na repositório Subversion do FreeBSD, como <link xlink:href="http://svnweb.FreeBSD.org/doc/head/share/xml/freebsd.dtd">head/share/xml/freebsd.dtd</link>.

source: FreeBSD-specific elements used in the examples below are clearly marked.
pt_br: Os elementos específicos do FreeBSD usados ​​nos exemplos abaixo estão claramente marcados.

source: FreeBSD Entities
pt_br: Entidades do FreeBSD

source: This table shows some of the most useful entities available in the <acronym>FDP</acronym>. For a complete list, see the <filename>*.ent</filename> files in <filename>doc/share/xml</filename>.
pt_br: Esta tabela mostra algumas das entidades mais úteis disponíveis no <acronym>FDP</acronym>. Para obter uma lista completa, consulte os arquivos <filename>*.ent</filename> em <filename>doc/share/xml</filename>.

source: <emphasis>FreeBSD Name Entities</emphasis>
pt_br: <emphasis>Entidades de Nome do FreeBSD</emphasis>

source: Manual Page Entities
pt_br: Entidades de Página de Manual

source: Usage: <literal>&amp;man.ls.1; is the manual page for &lt;command&gt;ls&lt;/command&gt;.</literal>
pt_br: Uso: <literal>&amp;man.ls.1; é a página de manual para o &lt;command&gt;ls&lt;/command&gt;.</literal>

source: Usage: <literal>The manual page for &lt;command&gt;cp&lt;/command&gt; is &amp;man.cp.1;.</literal>
pt_br: Uso: <literal> A página de manual para &lt;command&gt;cp&lt;/command&gt; é &amp;man.cp.1;.</literal>

source: <emphasis>link to <replaceable>command</replaceable> manual page in section <replaceable>sectionnumber</replaceable></emphasis>
pt_br: <emphasis>link para a página de manual <replaceable>command</replaceable> na seção <replaceable>sectionnumber</replaceable></emphasis>

source: Entities are defined for all the <link xlink:href="@@URL_RELPREFIX@@/cgi/man.cgi">FreeBSD manual pages</link>.
pt_br: As entidades são definidas para todas as <link xlink:href="@@URL_RELPREFIX@@/cgi/man.cgi">páginas de manual do FreeBSD</link>.

source: FreeBSD Mailing List Entities
pt_br: Entidades das Listas de Email do FreeBSD

source: <literal><link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link></literal>
pt_br: <literal><link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">Lista de discussão do projeto de documentação do FreeBSD</link> </literal>

source: Usage: <literal>A link to the &amp;a.doc;.</literal>
pt_br: Uso: <literal>Um link para a &amp;a.doc;.</literal>

source: <literal><link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions mailing list</link></literal>
pt_br: <literal><link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">Lista de discussão de assuntos gerais do FreeBSD</link></literal>

source: Usage: <literal>A link to the &amp;a.questions;.</literal>
pt_br: Uso: <literal> Um link para a &amp;a.questions;.</literal>

source: <emphasis>link to <replaceable>listname</replaceable></emphasis>
pt_br: <emphasis>link para <replaceable>listname</replaceable></emphasis>

source: Entities are defined for all the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#eresources-mail">FreeBSD mailing lists</link>.
pt_br: Foram criadas entidades para todas as <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#eresources-mail">listas de email do FreeBSD</link>.

source: FreeBSD Document Link Entities
pt_br: Entidades de Link de Documento do FreeBSD

source: <literal>&amp;url.books.handbook;</literal>
pt_br: <literal>&amp;url.books.handbook;</literal>a

source: Usage: <literal>A link to the &lt;link xlink:href="&amp;url.books.handbook;/advanced-networking.html"&gt;Advanced Networking&lt;/link&gt; chapter of the Handbook.</literal>
pt_br: Uso: <literal> Um link para o capítulo &lt;link xlink:href="&amp;url.books.handbook;/advanced-networking.html"&gt;Rede Avançado&lt;/link&gt; do Handbook.</literal>

source: <emphasis>relative path to <replaceable>bookname</replaceable></emphasis>
pt_br: <emphasis>caminho relativo para<replaceable>bookname</replaceable></emphasis>

source: Entities are defined for all the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/">FreeBSD books</link>.
pt_br: As entidades são definidas para todos os <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/">livros FreeBSD</link>.

source: Usage: <literal>A link to the &lt;link xlink:href="&amp;url.articles.committers-guide;"&gt;Committer's Guide&lt;/link&gt; article.</literal>
pt_br: Uso: <literal>Um link para o artigo &lt;link xlink:href="&amp;url.articles.committers-guide;"&gt;Guia dos Committer's&lt;/link&gt;.</literal>

source: <emphasis>relative path to <replaceable>articlename</replaceable></emphasis>
pt_br: <emphasis>caminho relativo para <replaceable>articlename</replaceable></emphasis>

source: Entities are defined for all the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/">FreeBSD articles</link>.
pt_br: As entidades são definidas para todos os <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/">artigos do FreeBSD</link>.

source: Other Operating System Name Entities
pt_br: Outras Entidades de Sistema Operacional

source: The <trademark class="registered">Linux</trademark> operating system.
pt_br: O sistema operacional <trademark class="registered">Linux</trademark>.

source: The <trademark class="registered">UNIX</trademark> operating system.
pt_br: O sistema operacional <trademark class="registered">UNIX</trademark>.

source: The <trademark class="registered">Windows</trademark> operating system.
pt_br: O sistema operacional <trademark class="registered">Windows</trademark>.

source: Miscellaneous Entities
pt_br: Entidades Diversas

source: The <systemitem class="username">root</systemitem> user prompt.
pt_br: O prompt de usuário <systemitem class="username"> root </systemitem>.

source: A prompt for an unprivileged user.
pt_br: Um prompt para um usuário sem privilégios.

source: The <trademark class="registered">PostScript</trademark> programming language.
pt_br: A linguagem de programação <trademark class="registered">PostScript</trademark>.

source: The <application>TeX</application> typesetting language.
pt_br: A linguagem de composição tipográfica <application>TeX</application>.

source: The Xorg open source X Window System.
pt_br: Xorg, Sistema X Window de código aberto.

source: Formal Public Identifier (FPI)
pt_br: Identificador Público Formal (FPI)

source: In compliance with the DocBook guidelines for writing <acronym>FPI</acronym>s for DocBook customizations, the <acronym>FPI</acronym> for the FreeBSD extended DocBook <acronym>DTD</acronym> is:
pt_br: Em conformidade com as diretrizes do DocBook, para escrever <acronym>FPI</acronym>s customizadas do DocBook, o <acronym>FPI</acronym> para o DocBook <acronym>DTD</acronym> estendido do FreeBSD é:

source: Document Structure
pt_br: Estrutura do Documento

source: DocBook allows structuring documentation in several ways. The FreeBSD Documentation Project uses two primary types of DocBook document: the book and the article.
pt_br: O DocBook permite a documentação de estruturação de várias maneiras. O Projeto de Documentação do FreeBSD usa dois tipos principais de documentos do DocBook: o book e o article.

source: Books are organized into <tag>chapter</tag>s. This is a mandatory requirement. There may be <tag>part</tag>s between the book and the chapter to provide another layer of organization. For example, the Handbook is arranged in this way.
pt_br: Os livros (books) são organizados em <tag>chapter</tag> s. Este é um requisito obrigatório. Pode haver <tag>part</tag>es entre o livro e o capítulo para fornecer outra camada de organização. Por exemplo, o Handbook é organizado dessa maneira.

source: A chapter may (or may not) contain one or more sections. These are indicated with the <tag>sect1</tag> element. If a section contains another section then use the <tag>sect2</tag> element, and so on, up to <tag>sect5</tag>.
pt_br: Um capítulo(chapter) pode (ou não) conter uma ou mais seções. Estes são indicados com o elemento <tag>sect1</tag>. Se uma seção contiver outra seção, use o elemento <tag>sect2</tag> e assim por diante, até <tag>sect5</tag>.

source: Chapters and sections contain the remainder of the content.
pt_br: Capítulos e seções contêm o restante do conteúdo.

source: An article is simpler than a book, and does not use chapters. Instead, the content of an article is organized into one or more sections, using the same <tag>sect1</tag> (and <tag>sect2</tag> and so on) elements that are used in books.
pt_br: Um artigo é mais simples que um livro e não utiliza capítulos. Em vez disso, o conteúdo de um artigo é organizado em uma ou mais seções, usando os mesmos elementos <tag>sect1</tag> (e <tag>sect2</tag> e assim por diante) que são usados ​​em livros.

source: The nature of the document being written should be used to determine whether it is best marked up as a book or an article. Articles are well suited to information that does not need to be broken down into several chapters, and that is, relatively speaking, quite short, at up to 20-25 pages of content. Books are best suited to information that can be broken up into several chapters, possibly with appendices and similar content as well.
pt_br: A natureza do documento que está sendo escrito deve ser usada para determinar se ele é melhor marcado como um livro ou um artigo. Os artigos são adequados à informação que não precisa ser dividida em vários capítulos, ou seja, relativamente curta, em até 20-25 páginas de conteúdo. Os livros são mais adequados para informações que podem ser divididas em vários capítulos, possivelmente com apêndices e conteúdo similar também.
