Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: To refer to a specific key on the keyboard, use <tag>keycap</tag>. To refer to a mouse button, use <tag>mousebutton</tag>. And to refer to combinations of key presses or mouse clicks, wrap them all in <tag>keycombo</tag>.
pt_br: Para se referir a uma tecla específica no teclado, use <tag>keycap</tag>. Para se referir a um botão do mouse, use <tag>mousebutton</tag>. E para se referir a combinações de pressionamentos de teclas ou cliques do mouse, coloque todos eles em <tag>keycombo</tag>.

source: <tag>keycombo</tag> has an attribute called <literal>action</literal>, which may be one of <literal>click</literal>, <literal>double-click</literal>, <literal>other</literal>, <literal>press</literal>, <literal>seq</literal>, or <literal>simul</literal>. The last two values denote whether the keys or buttons should be pressed in sequence, or simultaneously.
pt_br: <tag>keycombo</tag> tem um atributo chamado <literal>action</literal>, que pode ser um dos <literal>click</literal>, <literal>double-click</literal>, <literal>other</literal>, <literal>press</literal>, <literal>seq</literal>, ou <literal>simul</literal>. Os dois últimos valores indicam se as teclas ou botões devem ser pressionados em sequência ou simultaneamente.

source: The stylesheets automatically add any connecting symbols, such as <literal>+</literal>, between the key names, when wrapped in <tag>keycombo</tag>.
pt_br: As folhas de estilo adicionam automaticamente quaisquer símbolos de conexão, como <literal>+</literal>, entre os nomes das chaves, quando agrupados em <tag>keycombo</tag>.

source: Keys, Mouse Buttons, and Combinations Example
pt_br: Exemplos de Teclas, Botões do Mouse e Combinações

source: Applications, Commands, Options, and Cites
pt_br: Aplicativos, Comandos, Opções e Citações

source: Both applications and commands are frequently referred to when writing documentation. The distinction between them is that an application is the name of a program or suite of programs that fulfill a particular task. A command is the filename of a program that the user can type and run at a command line.
pt_br: Ambos os aplicativos e comandos são frequentemente utiilzados ao escrever uma documentação. A distinção entre eles é que um aplicativo é o nome de um programa ou conjunto de programas que preenche uma tarefa específica. Um comando é o nome do arquivo de um programa que o usuário pode digitar e executar em uma linha de comando.

source: It is often necessary to show some of the options that a command might take.
pt_br: Muitas vezes é necessário mostrar algumas das opções que um comando pode ter.

source: Finally, it is often useful to list a command with its manual section number, in the <quote>command(number)</quote> format so common in Unix manuals.
pt_br: Finalmente, muitas vezes é útil listar um comando com seu número de seção do manual, no formato <quote>command(number)</quote> que é comum em manuais Unix.

source: Mark up application names with <tag>application</tag>.
pt_br: Marque nomes de aplicações com <tag>application</tag>.

source: To list a command with its manual section number (which should be most of the time) the DocBook element is <tag>citerefentry</tag>. This will contain a further two elements, <tag>refentrytitle</tag> and <tag>manvolnum</tag>. The content of <tag>refentrytitle</tag> is the name of the command, and the content of <tag>manvolnum</tag> is the manual page section.
pt_br: Para listar um comando com seu número de seção do manual (que deve ser utilizado com maior frequência), o elemento DocBook é <tag>citerefentry</tag>. Isto irá conter mais dois elementos, <tag>refentrytitle</tag> e <tag>manvolnum</tag>. O conteúdo de <tag>refentrytitle</tag> é o nome do comando, e o conteúdo do <tag>manvolnum</tag> é a seção da página de manual.

source: This can be cumbersome to write, and so a series of <link linkend="xml-primer-general-entities">general entities</link> have been created to make this easier. Each entity takes the form <literal>&amp;man.<replaceable>manual-page</replaceable>.<replaceable>manual-section</replaceable>;</literal>.
pt_br: Isso pode ser trabalhoso para escrever e assim uma série de <link linkend="xml-primer-general-entities">entidades gerais</link> foram criadas para tornar esse processo mais fácil. Cada entidade assume o formato <literal>&amp;man.<replaceable>manual-page</replaceable>.<replaceable>manual-section</replaceable>;</literal>.

source: The file that contains these entities is in <filename>doc/share/xml/man-refs.ent</filename>, and can be referred to using this <acronym>FPI</acronym>:
pt_br: O arquivo que contém essas entidades está em <filename>doc/share/xml/man-refs.ent</filename> e pode ser referenciado usando este <acronym>FPI</acronym>:

source: Therefore, the introduction to FreeBSD documentation will usually include this:
pt_br: Portanto, a introdução à documentação do FreeBSD geralmente incluirá isto:

source: Use <tag>command</tag> to include a command name <quote>in-line</quote> but present it as something the user should type.
pt_br: Use <tag>command</tag> para incluir um nome de comando <quote>in-line</quote>, mas mostre como algo que o usuário deve digitar.

source: Use <tag>option</tag> to mark up the options which will be passed to a command.
pt_br: Use <tag>option</tag> para marcar as opções que serão passadas para um comando.

source: When referring to the same command multiple times in close proximity, it is preferred to use the <literal>&amp;man.<replaceable>command</replaceable>.<replaceable>section</replaceable>;</literal> notation to markup the first reference and use <tag>command</tag> to markup subsequent references. This makes the generated output, especially <acronym>HTML</acronym>, appear visually better.
pt_br: Ao se referir ao mesmo comando várias vezes nas proximidades, é preferível usar a notação <literal>&amp;man.<replaceable>command</replaceable>.<replaceable>section</replaceable>;</literal> para marcação a primeira referência e use <tag>command</tag> para marcar as referências subsequentes. Isso faz com que a saída gerada, especialmente <acronym>HTML</acronym>, apareça visualmente melhor.

source: Applications, Commands, and Options Example
pt_br: Exemplo de Aplicações, Comandos e Opções

source: <application>Sendmail</application> is the most widely used Unix mail application.
pt_br: <application> Sendmail </application> é o aplicativo de email Unix mais utilizado.

source: <application>Sendmail</application> includes the <citerefentry> <refentrytitle>sendmail</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <citerefentry><refentrytitle>mailq</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and <citerefentry><refentrytitle>newaliases</refentrytitle><manvolnum>1</manvolnum></citerefentry> programs.
pt_br: O <application> Sendmail </application> inclui o os programas <citerefentry> <refentrytitle>sendmail</refentrytitle><manvolnum>8</manvolnum> </citerefentry>, <citerefentry><refentrytitle>mailq</refentrytitle><manvolnum>1</manvolnum></citerefentry>, e o <citerefentry><refentrytitle>newaliases</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: One of the command line parameters to <citerefentry> <refentrytitle>sendmail</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, <option>-bp</option>, will display the current status of messages in the mail queue. Check this on the command line by running <command>sendmail -bp</command>.
pt_br: Um dos parâmetros da linha de comando para o <citerefentry> <refentrytitle>sendmail</refentrytitle><manvolnum>8</manvolnum> </citerefentry>, <option>-bp</option>, exibirá o status atual das mensagens no fila de email. Verifique isso na linha de comando executando <command>sendmail -bp</command>.

source: Notice how the <literal>&amp;man.<replaceable>command</replaceable>.<replaceable>section</replaceable>;</literal> notation is easier to follow.
pt_br: Observe como a notação <literal>&amp;man.<replaceable></replaceable>.<replaceable>section</replaceable>;</literal> é mais fácil de ser seguida.

source: Files, Directories, Extensions, Device Names
pt_br: Arquivos, Diretórios, Extensões, Nomes de Dispositivo

source: To refer to the name of a file, a directory, a file extension, or a device name, use <tag>filename</tag>.
pt_br: Para se referir ao nome de um arquivo, um diretório, uma extensão de arquivo ou um nome de dispositivo, use <tag>filename</tag>.

source: <tag>filename</tag> Example
pt_br: Exemplo <tag>filename</tag>

source: <tag class="starttag">para</tag>The source for the Handbook in English is found in <tag class="starttag">filename</tag>/usr/doc/en_US.ISO8859-1/books/handbook/<tag class="endtag">filename</tag>. The main file is called <tag class="starttag">filename</tag>book.xml<tag class="endtag">filename</tag>. There is also a <tag class="starttag">filename</tag>Makefile<tag class="endtag">filename</tag> and a number of files with a <tag class="starttag">filename</tag>.ent<tag class="endtag">filename</tag> extension.<tag class="endtag">para</tag> <tag class="starttag">para</tag><tag class="starttag">filename</tag>kbd0<tag class="endtag">filename</tag> is the first keyboard detected by the system, and appears in <tag class="starttag">filename</tag>/dev<tag class="endtag">filename</tag>.<tag class="endtag">para</tag>
pt_br: <tag class="starttag">para</tag> O código fonte do Handbook em inglês é encontrada em <tag class="starttag">filename</tag>/usr/doc/en_US.ISO8859-1/books/handbook/<tag class="endtag">filename</tag>. O arquivo principal é chamado <tag class="starttag">filename</tag>book.xml<tag class="endtag">filename</tag>. Há também um <tag class="starttag">filename</tag>Makefile<tag class="endtag">filename</tag> e vários arquivos com a extensão <tag class="starttag">filename</tag>.ent<tag class="endtag">filename</tag>.<tag class="endtag">para</tag> <tag class="starttag">para</tag><tag class="starttag">filename</tag>kbd0<tag class="endtag">filename</tag> é o primeiro teclado detectado pelo sistema e aparece em <tag class="starttag">filename</tag>/dev<tag class="endtag">filename</tag>. <tag class="endtag">para</tag>

source: The source for the Handbook in English is found in <filename>/usr/doc/en_US.ISO8859-1/books/handbook/</filename>. The main file is called <filename>book.xml</filename>. There is also a <filename>Makefile</filename> and a number of files with a <filename>.ent</filename> extension.
pt_br: O código fonte do Handbook em inglês é encontrada em <filename>/usr/doc/en_US.ISO8859-1/books/handbook/</filename>. O arquivo principal é chamado <filename>book.xml</filename>. Há também um <filename>Makefile</filename> e vários arquivos com a extensão <filename>.ent</filename>.

source: <filename>kbd0</filename> is the first keyboard detected by the system, and appears in <filename>/dev</filename>.
pt_br: <filename>kbd0</filename> é o primeiro teclado detectado pelo sistema e aparece em <filename>/dev</filename>.

source: The Name of Ports
pt_br: Nome dos Ports

source: FreeBSD Extension
pt_br: Extensão FreeBSD

source: These elements are part of the FreeBSD extension to DocBook, and do not exist in the original DocBook <acronym>DTD</acronym>.
pt_br: Estes elementos fazem parte da extensão do FreeBSD ao DocBook, e não existem no DocBook <acronym>DTD</acronym> original.

source: To include the name of a program from the FreeBSD Ports Collection in the document, use the <tag>package</tag> tag. Since the Ports Collection can be installed in any number of locations, only include the category and the port name; do not include <filename>/usr/ports</filename>.
pt_br: Para incluir o nome de um programa da Coleção de Ports do FreeBSD no documento, use a tag <tag>package</tag>. Como a Coleção de Ports pode ser instalada em qualquer local, inclua apenas a categoria e o nome do port; não inclua <filename>/usr/ports</filename>.

source: By default, <tag>package</tag> refers to a binary package. To refer to a port that will be built from source, set the <literal>role</literal> attribute to <literal>port</literal>.
pt_br: Por padrão, <tag>package</tag> refere-se a um pacote binário. Para se referir a um port que será compilado a partir do código fonte, configure o atributo <literal>role</literal> para <literal>port</literal>.

source: <tag>package</tag> Example
pt_br: Exemplo de <tag>package</tag>

source: <tag class="starttag">para</tag>Install the <tag class="starttag">package</tag>net/wireshark<tag class="endtag">package</tag> binary package to view network traffic.<tag class="endtag">para</tag> <tag class="starttag">para</tag><tag class="starttag">package role="port"</tag>net/wireshark<tag class="endtag">package</tag> can also be built and installed from the Ports Collection.<tag class="endtag">para</tag>
pt_br: <tag class="starttag">para</tag>Instale o pacote binário <tag class="starttag">package</tag>net/wireshark<tag class="endtag">package</tag> para visualizar o tráfego de rede.<tag class="endtag">para</tag> <tag class="starttag">para</tag><tag class="starttag">package role="port"</tag>net/wireshark<tag class="endtag">package</tag> também pode ser compilado e instalado pela Coleção de Ports.<tag class="endtag">para</tag>

source: Install the <package>net/wireshark</package> binary package to view network traffic.
pt_br: Instale o pacote binário <package>net/wireshark</package> para visualizar o tráfego de rede.

source: <package role="port">net/wireshark</package> can also be built and installed from the Ports Collection.
pt_br: O <package role="port">net/wireshark</package> também pode ser compilado e instalado pela Coleção de Ports.

source: Hosts, Domains, IP Addresses, User Names, Group Names, and Other System Items
pt_br: Hosts, Domínios, Endereços IP, Usuário, Grupo e Outros Itens do Sistema

source: Information for <quote>system items</quote> is marked up with <tag>systemitem</tag>. The <literal>class</literal> attribute is used to identify the particular type of information shown.
pt_br: Informações para <quote>itens do sistema</quote> estão marcadas com <tag>systemitem</tag>. O atributo <literal>class</literal> é usado para identificar o tipo específico de informação mostrada.

source: The text is a domain name, such as <literal>FreeBSD.org</literal> or <literal>ngo.org.uk</literal>. There is no hostname component.
pt_br: O texto é um nome de domínio, como <literal>FreeBSD.org</literal> ou <literal>ngo.org.uk</literal>. Não há nenhum componente de nome de host.

source: The text is an Ethernet <acronym>MAC</acronym> address, expressed as a series of 2 digit hexadecimal numbers separated by colons.
pt_br: O texto é um endereço Ethernet <acronym>MAC</acronym>, expresso como uma série de números hexadecimais de 2 dígitos separados por dois pontos.

source: The text is a Fully Qualified Domain Name, with both hostname and domain name parts.
pt_br: O texto é um nome de domínio FQDM, com ambos nome de domínio e hostname.

source: The text is an <acronym>IP</acronym> address, probably expressed as a dotted quad.
pt_br: O texto é um endereço de <acronym>IP</acronym>.

source: The text is a network mask, which might be expressed as a dotted quad, a hexadecimal string, or as a <literal>/</literal> followed by a number (<acronym>CIDR</acronym> notation).
pt_br: O texto é uma máscara de rede, que pode ser expressa igual a um IP, uma sequência hexadecimal ou como um <literal>/</literal> seguido por um número (notação <acronym>CIDR</acronym>).

source: With <literal>class="systemname"</literal> the marked up information is the simple hostname, such as <literal>freefall</literal> or <literal>wcarchive</literal>.
pt_br: Com <literal>class="systemname"</literal>, as informações marcadas são o nome do host simples, como <literal>freefall</literal> ou <literal>wcarchive</literal>.

source: The text is a username, like <literal>root</literal>.
pt_br: O texto é um nome de usuário, como <literal>root</literal>.

source: The text is a groupname, like <literal>wheel</literal>.
pt_br: O texto é um grupo, como <literal>wheel</literal>.

source: <tag>systemitem</tag> and Classes Example
pt_br: Exemplos <tag>systemitem</tag>

source: The local machine can always be referred to by the name <systemitem>localhost</systemitem>, which will have the IP address <systemitem class="ipaddress">127.0.0.1</systemitem>.
pt_br: A máquina local sempre pode ser referenciada pelo nome <systemitem>localhost</systemitem>, que terá o endereço IP <systemitem class="ipaddress">127.0.0.1</systemitem>.

source: The <systemitem class="fqdomainname">FreeBSD.org</systemitem> domain contains a number of different hosts, including <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem> and <systemitem class="fqdomainname">bento.FreeBSD.org</systemitem>.
pt_br: O domínio <systemitem class="fqdomainname">FreeBSD.org</systemitem> contém vários hosts diferentes, incluindo <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem> e <systemitem class="fqdomainname">bento.FreeBSD.org</systemitem>.

source: When adding an <acronym>IP</acronym> alias to an interface (using <command>ifconfig</command>) <emphasis>always</emphasis> use a netmask of <systemitem class="netmask">255.255.255.255</systemitem> (which can also be expressed as <systemitem class="netmask">0xffffffff</systemitem>).
pt_br: Ao adicionar um alias de <acronym>IP</acronym> a uma interface (usando <command>ifconfig</command>) <emphasis>sempre</emphasis> use uma máscara de rede de <systemitem class="netmask">255.255.255.255</systemitem> (que também pode ser expressa como <systemitem class="netmask">0xffffffff</systemitem>).

source: The <acronym>MAC</acronym> address uniquely identifies every network card in existence. A typical <acronym>MAC</acronym> address looks like <systemitem class="etheraddress">08:00:20:87:ef:d0</systemitem>.
pt_br: O endereço <acronym>MAC</acronym> identifica exclusivamente todas as placas de rede existentes. Um endereço <acronym>MAC</acronym> típico se parece com <systemitem class="etheraddress">08:00:20:87:ef:d0</systemitem>.

source: To carry out most system administration functions requires logging in as <systemitem class="username">root</systemitem>.
pt_br: Para executar a maioria das funções de administração do sistema, é necessário efetuar login como <systemitem class="username">root</systemitem>.

source: Uniform Resource Identifiers (<acronym>URI</acronym>s)
pt_br: Identificadores Uniformes de Recursos (<acronym>URI</acronym>s)

source: Occasionally it is useful to show a Uniform Resource Identifier (<acronym>URI</acronym>) without making it an active hyperlink. The <tag>uri</tag> element makes this possible:
pt_br: Ocasionalmente, é útil mostrar um Identificador de Recurso Uniforme (<acronym>URI</acronym>) sem torná-lo um hiperlink ativo. O elemento <tag>uri</tag> torna isso possível:

source: <tag>uri</tag> Example
pt_br: Exemplo <tag>uri</tag>

source: <tag class="starttag">para</tag>This <acronym>URL</acronym> shows only as text: <tag class="starttag">uri</tag>https://www.FreeBSD.org<tag class="endtag">uri</tag>. It does not create a link.<tag class="endtag">para</tag>
pt_br: <tag class="starttag">para</tag>Esta <acronym>URL</acronym> é mostrada apenas como texto: <tag class="starttag">uri</tag>https://www.FreeBSD.org<tag class="endtag">uri</tag>. Não é criado um link.<tag class="endtag">para</tag>

source: This <acronym>URL</acronym> shows only as text: <uri>https://www.FreeBSD.org</uri>. It does not create a link.
pt_br: Esta <acronym>URL</acronym> é mostrada apenas como texto: <uri>https://www.FreeBSD.org</uri>. Não é criado um link.

source: To create links, see <xref linkend="docbook-markup-links"/>.
pt_br: Para criar links, consulte <xref linkend="docbook-markup-links"/>.

source: Email Addresses
pt_br: Endereços de Email

source: Email addresses are marked up as <tag>email</tag> elements. In the <acronym>HTML</acronym> output format, the wrapped text becomes a hyperlink to the email address. Other output formats that support hyperlinks may also make the email address into a link.
pt_br: Os endereços de email são marcados como elementos <tag>email</tag>. No formato de saída <acronym>HTML</acronym>, o texto marcado se torna um hiperlink para o endereço de email. Outros formatos de saída que suportam hiperlinks também podem tornar o endereço de email em um link.

source: <tag>email</tag> with a Hyperlink Example
pt_br: Exemplo de Hiperlink com <tag>email</tag>

source: <tag class="starttag">para</tag>An email address that does not actually exist, like <tag class="starttag">email</tag>notreal@example.com<tag class="endtag">email</tag>, can be used as an example.<tag class="endtag">para</tag>
pt_br: <tag class="starttag">para</tag> Um endereço de email que não existe, como <tag class="starttag">email</tag>notreal@example.com<tag class="endtag">email</tag>, pode ser usado como um exemplo <tag class="endtag">para</tag>

source: An email address that does not actually exist, like <email>notreal@example.com</email>, can be used as an example.
pt_br: Um endereço de email que não existe, como <email>notreal@example.com</email>, pode ser usado como exemplo.

source: A FreeBSD-specific extension allows setting the <literal>role</literal> attribute to <literal>nolink</literal> to prevent the creation of the hyperlink to the email address.
pt_br: Uma extensão específica do FreeBSD permite configurar o atributo <literal>role</literal> para <literal>nolink</literal> para evitar a criação do hiperlink para o endereço de email.

source: <tag>email</tag> Without a Hyperlink Example
pt_br: Exemplo de <tag>email</tag> Sem Hiperlink

source: <tag class="starttag">para</tag>Sometimes a link to an email address like <tag class="starttag">email role="nolink"</tag>notreal@example.com<tag class="endtag">email</tag> is not desired.<tag class="endtag">para</tag>
pt_br: <tag class="starttag">para</tag> Às vezes, o link para um endereço de email como <tag class="starttag">email role="nolink"</tag>notreal@example.com<tag class="endtag">email</tag> não é desejado.<tag class="endtag">para</tag>

source: Sometimes a link to an email address like <email role="nolink">notreal@example.com</email> is not desired.
pt_br: Às vezes, o link para um endereço de email como <email role="nolink">notreal@example.com</email> não é desejado.

source: Describing <filename>Makefile</filename>s
pt_br: Descrevendo <filename>Makefile</filename>s

source: Two elements exist to describe parts of <filename>Makefile</filename>s, <tag>buildtarget</tag> and <tag>varname</tag>.
pt_br: Existem dois elementos para descrever partes de <filename>Makefile</filename>s, <tag>buildtarget</tag> e <tag>varname</tag>.

source: <tag>buildtarget</tag> identifies a build target exported by a <filename>Makefile</filename> that can be given as a parameter to <command>make</command>. <tag>varname</tag> identifies a variable that can be set (in the environment, on the command line with <command>make</command>, or within the <filename>Makefile</filename>) to influence the process.
pt_br: <tag>buildtarget</tag> identifica um destino de compilação exportado por um <filename>Makefile</filename> que pode ser fornecido como um parâmetro para o <command>make</command>. <tag>varname</tag> identifica uma variável que pode ser definida (no ambiente, na linha de comando com o <command>make</command>, ou dentro do <filename>Makefile</filename>) para influenciar o processo.

source: <tag>buildtarget</tag> and <tag>varname</tag> Example
pt_br: Exemplo de <tag>buildtarget</tag> e <tag>varname</tag>

source: Two common targets in a <filename>Makefile</filename> are <_:buildtarget-1/> and <_:buildtarget-2/>.
pt_br: Dois targets comuns em um <filename>Makefile</filename> são <_:buildtarget-1/> e <_:buildtarget-2/>.
