Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: The SYNOPSIS section begins. This section describes the command-line options and arguments accepted.
pt_br: A seção SYNOPSIS começa. Esta seção descreve as opções e argumentos de linha de comando que são aceitos.

source: <emphasis>Name</emphasis> (<literal>.Nm</literal>) has already been defined, and repeating it here just displays the defined value in the text.
pt_br: <emphasis>Nome</emphasis> (<literal>.Nm</literal>) já foi definido, e repeti-lo aqui apenas exibe o valor definido no texto.

source: An <emphasis>Optional</emphasis> <emphasis>Flag</emphasis> called <literal>-libxo</literal> is shown. The <literal>Fl</literal> macro adds a dash to the beginning of flags, so this appears in the manual page as <literal>--libxo</literal>.
pt_br: Uma <emphasis>Optional</emphasis> <emphasis>Flag</emphasis> chamada <literal>-libxo</literal> é mostrada. A macro <literal>Fl</literal> adiciona um traço ao início das flags, portanto, isso aparece na página de manual como <literal>--libxo</literal>.

source: A long list of optional single-character flags are shown.
pt_br: Uma longa lista de sinalizadores opcionais de caracteres únicos é apresentada.

source: An optional <literal>-D</literal> flag is defined. If the <literal>-D</literal> flag is given, it must be followed by an <emphasis>Argument</emphasis>. The argument is a <emphasis>format</emphasis>, a string that tells <citerefentry><refentrytitle>ls</refentrytitle><manvolnum>1</manvolnum></citerefentry> what to display and how to display it. Details on the format string are given later in the manual page.
pt_br: Uma flag opcional <literal>-D</literal> é definida. Se a flag <literal>-D</literal> for informada, ela deve ser seguida por um <emphasis>Argumento</emphasis>. O argumento é um <emphasis>format</emphasis>, uma string que diz <citerefentry><refentrytitle>ls</refentrytitle><manvolnum>1</manvolnum></citerefentry> o que exibir e como exibi-lo. Detalhes sobre a string de formato são fornecidos posteriormente na página de manual.

source: A final optional argument is defined. Because no name is specified for the argument, the default of <literal>file ...</literal> is used.
pt_br: Um argumento opcional final é definido. Como nenhum nome é especificado para o argumento, o padrão <literal>file ...</literal> é usado.

source: The <emphasis>Section header</emphasis> for the DESCRIPTION section is defined.
pt_br: O <emphasis>Cabeçalho da Seção</emphasis> para a seção DESCRIPTION é definido.

source: When rendered with the command <command>man ls</command>, the result displayed on the screen looks like this:
pt_br: Quando renderizado com o comando <command>man ls</command>, o resultado exibido na tela é semelhante ao seguinte:

source: Optional values are shown inside square brackets.
pt_br: Valores opcionais são mostrados entre colchetes.

source: Markup Guidelines
pt_br: Diretrizes de Marcação

source: The <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry> markup language is not very strict. For clarity and consistency, the FreeBSD Documentation project adds some additional style guidelines:
pt_br: A linguagem de marcação <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry> não é muito rigorosa. Para maior clareza e consistência, o projeto Documentação do FreeBSD adiciona algumas diretrizes de estilo adicionais:

source: Only the first letter of macros is upper case
pt_br: Apenas a primeira letra das macros é maiúscula

source: Always use upper case for the first letter of a macro and lower case for the remaining letters.
pt_br: Sempre use maiúsculas para a primeira letra de uma macro e minúscula para as letras restantes.

source: Begin new sentences on new lines
pt_br: Comece novas frases em novas linhas

source: Start a new sentence on a new line, do not begin it on the same line as an existing sentence.
pt_br: Inicie uma nova frase em uma nova linha, não a inicie na mesma linha de uma frase existente.

source: Update <literal>.Dd</literal> when making non-trivial changes to a manual page
pt_br: Atualizar <literal>.Dd</literal> ao fazer alterações não triviais em uma página de manual

source: The <emphasis>Document date</emphasis> informs the reader about the last time the manual page was updated. It is important to update whenever non-trivial changes are made to the manual pages. Trivial changes like spelling or punctuation fixes that do not affect usage can be made without updating <literal>.Dd</literal>.
pt_br: A <emphasis>Data do documento</emphasis> informa o leitor sobre a última vez que a página de manual foi atualizada. É importante atualizar sempre que alterações não triviais forem feitas nas páginas de manual. Alterações triviais, como correções ortográficas ou de pontuação que não afetam o uso, podem ser feitas sem atualizar <literal>.Dd</literal>.

source: Give examples
pt_br: Apresentando exemplos

source: Show the reader examples when possible. Even trivial examples are valuable, because what is trivial to the writer is not necessarily trivial to the reader. Three examples are a good goal. A trivial example shows the minimal requirements, a serious example shows actual use, and an in-depth example demonstrates unusual or non-obvious functionality.
pt_br: Apresente exemplos ao leitor sempre que possível. Mesmo exemplos triviais são valiosos, porque o que é trivial para o escritor não é necessariamente trivial para o leitor. Três exemplos são um bom objetivo. Um exemplo trivial mostra os requisitos mínimos, um exemplo afundo mostra o uso real e um exemplo detalhado demonstra uma funcionalidade incomum ou não óbvia.

source: Include the BSD license
pt_br: Inclua a licença BSD

source: Include the BSD license on new manual pages. The preferred license is available from the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guidepref-license">Committer's Guide</link>.
pt_br: Inclua a licença BSD em novas páginas de manual. A licença preferencial está disponível no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guidepref-license">Guia dos Committer's</link>.

source: Markup Tricks
pt_br: Truques de Marcação

source: Add a space before punctuation on a line with macros. Example:
pt_br: Adicione um espaço antes da pontuação em uma linha com macros. Exemplo:

source: Note how the commas at the end of the <literal>.Xr</literal> lines have been placed after a space. The <literal>.Xr</literal> macro expects two parameters to follow it, the name of an external manual page, and a section number. The space separates the punctuation from the section number. Without the space, the external links would incorrectly point to section <literal>4,</literal> or <literal>8,</literal>.
pt_br: Observe como as vírgulas no final das linhas <literal>.Xr</literal> foram colocadas após um espaço. A macro <literal>.Xr</literal> espera dois parâmetros, o nome de uma página de manual externa e um número de seção. O espaço separa a pontuação do número da seção. Sem o espaço, os links externos apontariam incorretamente para a seção <literal>4,</literal> ou <literal>8,</literal>.

source: Important Macros
pt_br: Macros Importantes

source: Some very common macros will be shown here. For more usage examples, see <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry>, <citerefentry><refentrytitle>groff_mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry>, or search for actual use in <filename>/usr/share/man/man*</filename> directories. For example, to search for examples of the <literal>.Bd</literal> <emphasis>Begin display</emphasis> macro:
pt_br: Algumas macros muito comuns serão mostradas aqui. Para obter mais exemplos de uso, consulte <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry>, <citerefentry><refentrytitle>groff_mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry>, ou procure por uso real no diretório <filename>/usr/share/man/man*</filename>. Por exemplo, para procurar exemplos da macro <literal>.Bd</literal> <emphasis>Begin display</emphasis>:

source: Organizational Macros
pt_br: Macros Organizacionais

source: Some macros are used to define logical blocks of a manual page.
pt_br: Algumas macros são usadas para definir blocos lógicos de uma página de manual.

source: Organizational Macro
pt_br: Macro Organizacional

source: Use
pt_br: Uso

source: Section header. Followed by the name of the section, traditionally all upper case. Think of these as chapter titles.
pt_br: Section header (Cabeçalho da seção). Seguido pelo nome da seção, tradicionalmente com os caracteres todos em maiúsculas. Pense neles como títulos de capítulos.

source: Subsection header. Followed by the name of the subsection. Used to divide a <literal>.Sh</literal> section into subsections.
pt_br: Subsection header (Cabeçalho da subseção). Seguido pelo nome da subseção. Usado para dividir uma seção <literal>.Sh</literal> em subseções.

source: Begin list. Start a list of items.
pt_br: Begin list. Comece uma lista de itens.

source: End a list.
pt_br: End a list (Finalize uma lista).

source: Begin display. Begin a special area of text, like an indented area.
pt_br: Begin display (Comece a exibição). Comece em uma área especial de texto, como uma área recuada.

source: End display.
pt_br: End display (Termine a exibição).

source: Inline Macros
pt_br: Macros Inline

source: Many macros are used to mark up inline text.
pt_br: Muitas macros são usadas para marcar texto embutido.

source: Inline Macro
pt_br: Macro Inline

source: Name. Called with a name as a parameter on the first use, then used later without the parameter to display the name that has already been defined.
pt_br: Name. Chamado com um nome como parâmetro no primeiro uso, usado depois sem o parâmetro para exibir o nome que já foi definido.

source: Path to a file. Used to mark up filenames and directory paths.
pt_br: Path to a file (Caminho para um arquivo). Usado para marcar nomes de arquivos e caminhos de diretório.

source: Sample Manual Page Structures
pt_br: Exemplo de Estruturas de Página de Manual

source: This section shows minimal desired man page contents for several common categories of manual pages.
pt_br: Esta seção mostra o conteúdo mínimo desejável para um página de manual para várias categorias comuns de páginas de manual.

source: Section 1 or 8 Command
pt_br: Seção 1 ou 8 sobre um comando

source: The preferred basic structure for a section 1 or 8 command:
pt_br: A estrutura básica preferida para uma seção 1 ou 8 sobre um comando:

source: Section 4 Device Driver
pt_br: Seção 4 sobre um Driver de Dispositivo

source: The preferred basic structure for a section 4 device driver:
pt_br: A estrutura básica preferida para a seção 4 sobre um driver de dispositivo:

source: Section 5 Configuration File
pt_br: Seção 5 sobre um Arquivo de Configuração

source: The preferred basic structure for a section 5 configuration file:
pt_br: A estrutura básica preferida para a seção 5 sobre um arquivo de configuração:

source: Example Manual Pages to Use as Templates
pt_br: Exemplos de páginas de manuais para usar como modelos

source: Some manual pages are suitable as in-depth examples.
pt_br: Algumas destas páginas de manual são adequadas para serem usadas como exemplos detalhados.

source: Manual Page
pt_br: Página Manual

source: Path to Source Location
pt_br: Caminho para o local de origem

source: Resources
pt_br: Recursos

source: Resources for manual page writers:
pt_br: Recursos para escritores de páginas manuais:

source: <link xlink:href="http://manpages.bsd.lv/mdoc.html">Practical UNIX Manuals: mdoc</link>
pt_br: <link xlink:href="http://manpages.bsd.lv/mdoc.html">Manuais Práticos do UNIX: mdoc</link>

source: <link xlink:href="http://manpages.bsd.lv/history.html">History of UNIX Manpages</link>
pt_br: <link xlink:href="http://manpages.bsd.lv/history.html">História das Man pages do UNIX</link>

source: Writing Style
pt_br: Estilo de escrita

source: Tips
pt_br: Dicas

source: Technical documentation can be improved by consistent use of several principles. Most of these can be classified into three goals: <emphasis>be clear</emphasis>, <emphasis>be complete</emphasis>, and <emphasis>be concise</emphasis>. These goals can conflict with each other. Good writing consists of a balance between them.
pt_br: A documentação técnica pode ser melhorada pelo uso consistente de vários princípios. A maioria destes pode ser classificada em três objetivos: <emphasis>ser claro</emphasis>, <emphasis>ser completo</emphasis> e <emphasis>ser conciso</emphasis>. Essas metas podem entrar em conflito umas com as outras. Uma boa escrita consiste em um equilíbrio entre eles.

source: Be Clear
pt_br: Seja claro

source: Clarity is extremely important. The reader may be a novice, or reading the document in a second language. Strive for simple, uncomplicated text that clearly explains the concepts.
pt_br: A clareza é extremamente importante. O leitor pode ser um novato ou ler o documento em um segundo idioma. Esforce-se por um texto simples e descomplicado que explique claramente os conceitos.

source: Avoid flowery or embellished speech, jokes, or colloquial expressions. Write as simply and clearly as possible. Simple text is easier to understand and translate.
pt_br: Evite discurso florido ou embelezado, piadas ou expressões coloquiais. Escreva da maneira mais simples e clara possível. Um texto simples é mais fácil de se entender e de se traduzir.

source: Keep explanations as short, simple, and clear as possible. Avoid empty phrases like <quote>in order to</quote>, which usually just means <quote>to</quote>. Avoid potentially patronizing words like <quote>basically</quote>. Avoid Latin terms like <quote>i.e.,</quote> or <quote>cf.</quote>, which may be unknown outside of academic or scientific groups.
pt_br: Mantenha as explicações o mais curtas, simples e claras possível. Evite frases vazias como <quote>a fim de</quote> as quais normalmente significam apenas um <quote>para</quote>. Evite palavras potencialmente paternalistas tais como <quote>basicamente</quote>. Evite termos latinos como <quote>i.e.</quote> ou <quote>cf.</quote>, os quais podem ser desconhecidos fora de grupos acadêmicos ou científicos.

source: Write in a formal style. Avoid addressing the reader as <quote>you</quote>. For example, say <quote>copy the file to <filename>/tmp</filename></quote> rather than <quote>you can copy the file to <filename>/tmp</filename></quote>.
pt_br: Escreva em um estilo formal. Evite dirigir-se ao leitor como <quote>você</quote>. Por exemplo, digamos <quote>copie o arquivo para <filename>/tmp</filename></quote> em vez de <quote>você pode copiar o arquivo para <filename>/tmp</filename></quote>.

source: Give clear, correct, <emphasis>tested</emphasis> examples. A trivial example is better than no example. A good example is better yet. Do not give bad examples, identifiable by apologies or sentences like <quote>but really it should never be done that way</quote>. Bad examples are worse than no examples. Give good examples, because <emphasis>even when warned not to use the example as shown</emphasis>, the reader will usually just use the example as shown.
pt_br: Dê exemplos claros, corretos, e <emphasis>testados</emphasis>. Um exemplo trivial é melhor do que nenhum exemplo. Um bom exemplo é ainda melhor. Não dê exemplos ruins, identificáveis ​​por desculpas ou frases como <quote>mas realmente isso nunca deve ser feito dessa forma</quote>. Exemplos ruins são piores que nenhum exemplo. Dê bons exemplos, porque <emphasis>mesmo quando avisado para não usar o exemplo como mostrado </emphasis>, o leitor normalmente só usa o exemplo como mostrado.

source: Avoid <emphasis>weasel words</emphasis> like <quote>should</quote>, <quote>might</quote>, <quote>try</quote>, or <quote>could</quote>. These words imply that the speaker is unsure of the facts, and create doubt in the reader.
pt_br: Evite <emphasis>palavras vazias</emphasis> como <quote>deveria</quote>, <quote>poderia</quote>, <quote>tentaria</quote>, ou <quote>podia</quote>. Estas palavras implicam que o autor não tem certeza dos fatos e cria dúvidas no leitor.

source: Similarly, give instructions as imperative commands: not <quote>you should do this</quote>, but merely <quote>do this</quote>.
pt_br: Da mesma forma, dê instruções como comandos imperativos: não utilize <quote>você deve fazer isso</quote>, mas apenas <quote>faça isso</quote>.

source: Be Complete
pt_br: Seja completo

source: Do not make assumptions about the reader's abilities or skill level. Tell them what they need to know. Give links to other documents to provide background information without having to recreate it. Put yourself in the reader's place, anticipate the questions they will ask, and answer them.
pt_br: Não faça suposições sobre as habilidades do leitor. Diga-lhes o que precisam saber. Dê links para outros documentos para fornecer informações básicas sem precisar recriá-las. Coloque-se no lugar do leitor, antecipe as perguntas que eles farão e responda-os.

source: Be Concise
pt_br: Seja conciso

source: While features should be documented completely, sometimes there is so much information that the reader cannot easily find the specific detail needed. The balance between being complete and being concise is a challenge. One approach is to have an introduction, then a <quote>quick start</quote> section that describes the most common situation, followed by an in-depth reference section.
pt_br: Embora as funcionalidades devam ser documentadas completamente, às vezes existe tanta informação que o leitor não consegue encontrar facilmente os detalhes específicos de que necessita. O equilíbrio entre ser completo e ser conciso é um desafio. Uma abordagem é ter uma introdução e, em seguida, uma seção de <quote>início rápido</quote> que descreve a situação mais comum, seguida por uma seção de referência aprofundada.

source: Guidelines
pt_br: Diretrizes

source: To promote consistency between the myriad authors of the FreeBSD documentation, some guidelines have been drawn up for authors to follow.
pt_br: Para promover a consistência entre os inúmeros autores da documentação do FreeBSD, algumas diretrizes foram elaboradas para os autores seguirem.

source: Use American English Spelling
pt_br: Use a Ortografia do Inglês Americano

source: There are several variants of English, with different spellings for the same word. Where spellings differ, use the American English variant. <quote>color</quote>, not <quote>colour</quote>, <quote>rationalize</quote>, not <quote>rationalise</quote>, and so on.
pt_br: Existem várias variantes do inglês, com grafias diferentes para a mesma palavra. Onde as grafias diferem, use a variante do inglês americano. <quote>color</quote>, não <quote>colour</quote>, <quote>rationalize</quote>, não <quote>rationalise</quote>, e assim por diante.

source: The use of British English may be accepted in the case of a contributed article, however the spelling must be consistent within the whole document. The other documents such as books, web site, manual pages, etc. will have to use American English.
pt_br: O uso do inglês britânico pode ser aceito no caso de um artigo contribuído, no entanto, a ortografia deve ser consistente em todo o documento. Os outros documentos, como livros, site, páginas de manual, etc., terão que usar o inglês americano.

source: Do not use contractions
pt_br: Não use contrações

source: Do not use contractions. Always spell the phrase out in full. <quote>Don't use contractions</quote> is wrong.
pt_br: Não use contrações. Sempre soletre a frase na íntegra. <quote>Do not</quote> é a forma correta, <quote>Don't</quote> é a errada.

source: Avoiding contractions makes for a more formal tone, is more precise, and is slightly easier for translators.
pt_br: Evitar contrações contribui para um tom mais formal, é mais preciso e é um pouco mais fácil para os tradutores.

source: Use the serial comma
pt_br: Use a vírgula serial

source: In a list of items within a paragraph, separate each item from the others with a comma. Separate the last item from the others with a comma and the word <quote>and</quote>.
pt_br: Em uma lista de itens dentro de um parágrafo, separe cada item dos outros com uma vírgula. Separe o último item dos outros com uma vírgula e a letra <quote>e</quote>.

source: For example:
pt_br: Por exemplo:

source: This is a list of one, two and three items.
pt_br: Esta é uma lista de um, dois e três itens.

source: Is this a list of three items, <quote>one</quote>, <quote>two</quote>, and <quote>three</quote>, or a list of two items, <quote>one</quote> and <quote>two and three</quote>?
pt_br: É uma lista de três itens, <quote>um</quote>, <quote>dois</quote> e <quote>três</quote>, ou uma lista de dois itens, <quote>um</quote> e <quote>dois e três</quote>?

source: It is better to be explicit and include a serial comma:
pt_br: É melhor ser explícito e incluir uma vírgula serial:

source: This is a list of one, two, and three items.
pt_br: Esta é uma lista de um, dois, e três itens.

source: Avoid redundant phrases
pt_br: Evite frases redundantes

source: Do not use redundant phrases. In particular, <quote>the command</quote>, <quote>the file</quote>, and <quote>man command</quote> are often redundant.
pt_br: Não use frases redundantes. Em particular, <quote>o comando</quote>, <quote>o arquivo</quote> e o <quote>comando man</quote> são frequentemente redundantes.

source: For example, commands:
pt_br: Por exemplo, comandos:

source: Wrong: Use the <command>svn</command> command to update sources.
pt_br: Errado: Use o comando <command>svn</command> para atualizar o código fonte.

source: Right: Use <command>svn</command> to update sources.
pt_br: Correto: Use o <command>svn</command> para atualizar o código fonte.

source: Filenames:
pt_br: Nomes de arquivo:

source: Wrong: … in the filename <filename>/etc/rc.local</filename>…
pt_br: Errado:… no nome do arquivo <filename>/etc/rc.local</filename>…

source: Right: … in <filename>/etc/rc.local</filename>…
pt_br: Correto:… no <filename>/etc/rc.local</filename>…

source: Manual page references (the second example uses <tag>citerefentry</tag> with the <literal>&amp;man.csh.1;</literal> entity):.
pt_br: Referências de páginas de manual (o segundo exemplo usa <tag>citerefentry</tag> com a entidade <literal>&amp;man.csh.1;</literal>):.

source: Wrong: See <command>man csh</command> for more information.
pt_br: Errado: Veja <command>man csh</command> para mais informações.

source: Right: See <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Correto: Veja <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Two spaces between sentences
pt_br: Dois espaços entre frases

source: Always use two spaces between sentences, as it improves readability and eases use of tools such as <application>Emacs</application>.
pt_br: Sempre use dois espaços entre as sentenças, pois isso melhora a legibilidade e facilita o uso de ferramentas como o <application>Emacs</application>.

source: A period and spaces followed by a capital letter does not always mark a new sentence, especially in names. <quote>Jordan K. Hubbard</quote> is a good example. It has a capital <literal>H</literal> following a period and a space, and is certainly not a new sentence.
pt_br: Um período e espaços seguidos por uma letra maiúscula nem sempre marcam uma nova sentença, especialmente em nomes. <quote>Jordan K. Hubbard</quote> é um bom exemplo. Ele tem um capital <literal>H</literal> após um período e um espaço, e certamente não é uma nova sentença.
