Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: For more information about writing style, see <link xlink:href="http://www.bartleby.com/141/">Elements of Style</link>, by William Strunk.
pt_br: Para mais informações sobre o estilo de escrita, consulte <link xlink:href="http://www.bartleby.com/141/">Elementos de Estilo</link>, de William Strunk.

source: Style Guide
pt_br: Guia de estilo

source: To keep the source for the documentation consistent when many different people are editing it, please follow these style conventions.
pt_br: Para manter o código fonte da documentação consistente quando muitas pessoas diferentes a estiverem editando, siga estas convenções de estilo.

source: Tags are entered in lower case, <tag>para</tag>, <emphasis>not</emphasis> <tag>PARA</tag>.
pt_br: As tags são digitadas em minúsculas, <tag>para</tag>, <emphasis>não</emphasis> <tag>PARA</tag>.

source: Text that appears in SGML contexts is generally written in upper case, <literal>&lt;!ENTITY…&gt;</literal>, and <literal>&lt;!DOCTYPE…&gt;</literal>, <emphasis>not</emphasis> <literal>&lt;!entity…&gt;</literal> and <literal>&lt;!doctype…&gt;</literal>.
pt_br: O texto que aparece em contextos SGML é geralmente escrito em letras maiúsculas, <literal>&lt;! ENTITY ... &gt;</literal>, e <literal>&lt;! DOCTYPE… &gt;</literal>, <emphasis>não</emphasis> <literal>&lt;! entity… &gt;</literal> e <literal>&lt;! doctype… &gt;</literal>.

source: Acronyms should be defined the first time they appear in a document, as in: <quote>Network Time Protocol (<acronym>NTP</acronym>)</quote>. After the acronym has been defined, use the acronym alone unless it makes more sense contextually to use the whole term. Acronyms are usually defined only once per chapter or per document.
pt_br: Os acrônimos devem ser definidos na primeira vez que aparecerem em um documento, como em: <quote>Network Time Protocol (<acronym>NTP</acronym>)</quote>. Depois que o acrônimo tiver sido definido, use apenas o acrônimo, a menos que faça mais sentido contextualmente usar todo o termo. Acrônimos geralmente são definidos apenas uma vez por capítulo ou por documento.

source: All acronyms should be enclosed in <tag>acronym</tag> tags.
pt_br: Todos os acrônimos devem ser colocados em tags <tag>acronym</tag>.

source: Indentation
pt_br: Indentação

source: The first line in each file starts with no indentation, <emphasis>regardless</emphasis> of the indentation level of the file which might contain the current file.
pt_br: A primeira linha em cada arquivo começa sem recuo, <emphasis>independentemente</emphasis> do nível de recuo do arquivo que pode conter o arquivo atual.

source: Opening tags increase the indentation level by two spaces. Closing tags decrease the indentation level by two spaces. Blocks of eight spaces at the start of a line should be replaced with a tab. Do not use spaces in front of tabs, and do not add extraneous whitespace at the end of a line. Content within elements should be indented by two spaces if the content runs over more than one line.
pt_br: Tags de abertura aumentam o nível de recuo por dois espaços. Tags de fechamento diminuem o nível de recuo por dois espaços. Blocos de oito espaços no início de uma linha devem ser substituídos por um tab. Não use espaços na frente das tabs e não adicione espaço em branco extra no final de uma linha. O conteúdo nos elementos deve ser indentado por dois espaços se o conteúdo for executado em mais de uma linha.

source: For example, the source for this section looks like this:
pt_br: Por exemplo, a fonte desta seção é assim:

source: Tags containing long attributes follow the same rules. Following the indentation rules in this case helps editors and writers see which content is inside the tags:
pt_br: Tags contendo atributos longos seguem as mesmas regras. Seguir as regras de recuo neste caso ajuda editores e escritores a ver qual conteúdo está dentro das tags:

source: When an element is too long to fit on the remainder of a line without wrapping, moving the start tag to the next line can make the source easier to read. In this example, the <literal>systemitem</literal> element has been moved to the next line to avoid wrapping and indenting:
pt_br: Quando um elemento é muito longo para caber no restante de uma linha sem quebrá-la, mover a tag inicial para a próxima linha pode facilitar a leitura do código. Neste exemplo, o elemento <literal>systemitem</literal> foi movido para a próxima linha para evitar a quebra e o recuo:

source: Configurations to help various text editors conform to these guidelines can be found in <xref linkend="editor-config"/>.
pt_br: Configurações para ajudar vários editores de texto a operar em conformidade com estas diretrizes podem ser encontradas em <xref linkend="editor-config"/>.

source: Tag Style
pt_br: Estilo de Tag

source: Tag Spacing
pt_br: Espaçamento de tag

source: Tags that start at the same indent as a previous tag should be separated by a blank line, and those that are not at the same indent as a previous tag should not:
pt_br: Tags que começam no mesmo recuo como uma tag anterior devem ser separadas por uma linha em branco, e aquelas que não estão no mesmo recuo como uma tag anterior não devem:

source: Separating Tags
pt_br: Separando Tags

source: Tags like <tag>itemizedlist</tag> which will always have further tags inside them, and in fact do not take character data themselves, are always on a line by themselves.
pt_br: Tags como <tag>itemizedlist</tag>, que sempre terão outras tags dentro delas, e de fato não pegam dados de caractere, estão sempre sozinhas em uma linha.

source: Tags like <tag>para</tag> and <tag>term</tag> do not need other tags to contain normal character data, and their contents begin immediately after the tag, <emphasis>on the same line</emphasis>.
pt_br: Tags como <tag>para</tag> e <tag>term</tag> não precisam de outras tags para conter dados de caracteres normais, e seus conteúdos começam imediatamente após a tag, <emphasis>na mesma linha</emphasis> .

source: The same applies to when these two types of tags close.
pt_br: O mesmo se aplica quando esses dois tipos de tags fecham.

source: This leads to an obvious problem when mixing these tags.
pt_br: Isso leva a um problema óbvio ao misturar essas tags.

source: When a starting tag which cannot contain character data directly follows a tag of the type that requires other tags within it to use character data, they are on separate lines. The second tag should be properly indented.
pt_br: Quando uma tag inicial que não pode conter dados de caractere segue diretamente uma tag do tipo que requer outras tags dentro dela para usar dados de caractere, elas estão em linhas separadas. A segunda tag deve estar corretamente recuada.

source: When a tag which can contain character data closes directly after a tag which cannot contain character data closes, they co-exist on the same line.
pt_br: Quando uma tag que pode conter dados de caractere é fechada diretamente após uma tag que não pode conter dados de caractere fechados, eles coexistem na mesma linha.

source: Whitespace Changes
pt_br: Mudanças no espaço em branco

source: <emphasis>Do not commit changes to content at the same time as changes to formatting</emphasis>.
pt_br: <emphasis>Não faça commit de mudanças no conteúdo ao mesmo tempo em que faz mudanças na formatação</emphasis>.

source: When content and whitespace changes are kept separate, translation teams can easily see whether a change was content that must be translated or only whitespace.
pt_br: Quando as alterações de conteúdo e espaço em branco são mantidas separadas, as equipes de tradução podem ver facilmente se uma alteração foi de um conteúdo que deve ser traduzido ou apenas espaço em branco.

source: For example, if two sentences have been added to a paragraph so that the line lengths now go over 80 columns, first commit the change with the too-long lines. Then fix the line wrapping, and commit this second change. In the commit message for the second change, indicate that this is a whitespace-only change that can be ignored by translators.
pt_br: Por exemplo, se duas sentenças foram adicionadas a um parágrafo para que os comprimentos de linha passem de 80 colunas, primeiro faça commit da alteração com as linhas longas demais. Em seguida, corrija a quebra de linha e confirme essa segunda alteração. Na mensagem de confirmação da segunda alteração, indique que esta é uma alteração somente de espaço em branco a qual pode ser ignorada pelos tradutores.

source: Non-Breaking Space
pt_br: Espaços Não Separáveis (Non-Breaking Space)

source: Avoid line breaks in places where they look ugly or make it difficult to follow a sentence. Line breaks depend on the width of the chosen output medium. In particular, viewing the HTML documentation with a text browser can lead to badly formatted paragraphs like the next one:
pt_br: Evite quebras de linha em locais onde elas pareçam feias ou dificultem o entendimento de uma frase. Quebras de linha dependem da largura do meio de saída escolhido. Em particular, a visualização da documentação em HTML com um navegador de texto pode levar a parágrafos mal formatados como o seguinte:

source: Data capacity ranges from 40 MB to 15 GB. Hardware compression …
pt_br: A capacidade de dados varia de 40 MB a 15 GB Compressão de hardware…

source: The general entity <literal>&amp;nbsp;</literal> prohibits line breaks between parts belonging together. Use non-breaking spaces in the following places:
pt_br: A entidade geral <literal>&amp;nbsp;</literal> proíbe as quebras de linha entre as partes que estão juntas. Use espaços não separáveis ​​nos seguintes locais:

source: between numbers and units:
pt_br: entre números e unidades:

source: between program names and version numbers:
pt_br: entre nomes de programas e números de versão:

source: between multiword names (use with caution when applying this to more than 3-4 word names like <quote>The FreeBSD Brazilian Portuguese Documentation Project</quote>):
pt_br: entre nomes com várias palavras (use com cautela ao aplicar isso em nomes de mais de 3-4 palavras como <quote>The FreeBSD Portuguese Portuguese Documentation Project</quote>):

source: Sun&amp;nbsp;Microsystems
pt_br: Sun &amp;Microsystems

source: Word List
pt_br: Lista de palavras

source: This list of words shows the correct spelling and capitalization when used in FreeBSD documentation. If a word is not on this list, ask about it on the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>.
pt_br: Esta lista de palavras mostra a ortografia e letras maiúsculas corretas quando usadas na documentação do FreeBSD. Se uma palavra não estiver nesta lista, pergunte sobre isso na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto de documentação do FreeBSD</link>.

source: Word
pt_br: Palavra

source: XML Code
pt_br: Código XML

source: Notes
pt_br: Notas

source: DoS (Denial of Service)
pt_br: DoS (negação de serviço)

source: file system
pt_br: sistema de arquivo

source: manual page
pt_br: página de manual

source: mail server
pt_br: servidor de email

source: name server
pt_br: nome do servidor

source: Ports Collection
pt_br: Coleção de Ports

source: read-only
pt_br: somente leitura

source: Do not refer to the Subversion application as <literal>SVN</literal> in upper case. To refer to the command, use <tag class="starttag">command</tag><literal>svn</literal><tag class="endtag">command</tag>.
pt_br: Não se refira ao aplicativo Subversion como <literal>SVN</literal> em letras maiúsculas. Para se referir ao comando, use <tag class="starttag">command</tag><literal>svn</literal><tag class="endtag">command</tag>.

source: things that apply to user space, not the kernel
pt_br: coisas que se aplicam ao espaço do usuário, não ao kernel

source: web server
pt_br: servidor web

source: Editor Configuration
pt_br: Configuração do Editor

source: Adjusting text editor configuration can make working on document files quicker and easier, and help documents conform to <acronym>FDP</acronym> guidelines.
pt_br: Ajustar a configuração do editor de texto pode tornar o trabalho nos arquivos da documentação mais rápido e fácil, além de ajudar os documentos a ficarem em conformidade com as diretrizes do <acronym>FDP</acronym>.

source: Install from <package>editors/vim</package>, <package>editors/vim-console</package>, or <package>editors/vim-tiny</package> then follow the configuration instructions in <xref linkend="editor-config-vim-config"/>.
pt_br: Instale-o a partir de <package>editors/vim</package>, <package>editors/vim-console</package>, ou <package>editors/vim-tiny</package> e siga as instruções de configuração em <xref linkend="editor-config-vim-config"/>.

source: Press <keycap>P</keycap> to reformat paragraphs or text that has been selected in Visual mode. Press <keycap>T</keycap> to replace groups of eight spaces with a tab.
pt_br: Pressione <keycap>P</keycap> para reformatar parágrafos ou texto selecionado no modo Visual. Pressione <keycap>T</keycap> para substituir grupos de oito espaços por um tab.

source: Configuration
pt_br: Configuração

source: Edit <filename>~/.vimrc</filename>, adding these lines to the end of the file:
pt_br: Edite o <filename>~/.vimrc</filename>, adicionando estas linhas ao final do arquivo:

source: Install from <package>editors/emacs</package> or <package>editors/emacs-devel</package>.
pt_br: Instale-o a partir de <package>editors/emacs</package> ou <package>editors/emacs-devel</package>.

source: Validation
pt_br: Validação

source: Emacs's nxml-mode uses compact relax NG schemas for validating XML. A compact relax NG schema for FreeBSD's extension to DocBook 5.0 is included in the documentation repository. To configure nxml-mode to validate using this schema, create <filename>~/.emacs.d/schema/schemas.xml</filename> and add these lines to the file:
pt_br: O modo nxml do Emacs usa esquemas NG relax compacto para validar o XML. Um esquema NG relax compacto para a extensão do FreeBSD para DocBook 5.0 está incluído no repositório de documentação. Para configurar o modo nxml para validar usando este esquema, crie <filename>~/.emacs.d/schema/schemas.xml</filename> e adicione estas linhas ao arquivo:

source: Automated Proofreading with Flycheck and Igor
pt_br: Revisão Automatizada com Flycheck e Igor

source: The Flycheck package is available from Milkypostman's Emacs Lisp Package Archive (<acronym>MELPA</acronym>). If <acronym>MELPA</acronym> is not already in Emacs's packages-archives, it can be added by evaluating
pt_br: O pacote Flycheck está disponível no Emacs Lisp Package Archive da Milkypostman (<acronym>MELPA</acronym>). Se a <acronym>MELPA</acronym> ainda não estiver nos repositórios de pacotes do Emacs, ele pode ser adicionado executando

source: Add the line to Emacs's initialization file (one of <filename>~/.emacs</filename>, <filename>~/.emacs.el</filename>, or <filename>~.emacs.d/init.el</filename>) to make this change permanent.
pt_br: Adicione a linha ao arquivo de inicialização do Emacs (qualquer um deles, <filename>~/.emacs</filename>, <filename>~/.emacs.el</filename>, ou <filename>~.emacs.d/init.el</filename>) para tornar esta alteração permanente.

source: To install Flycheck, evaluate
pt_br: Para instalar o Flycheck, execute

source: Create a Flycheck checker for <package>textproc/igor</package> by evaluating
pt_br: Crie um verificador Flycheck para <package>textproc/igor</package> executando

source: Again, add these lines to Emacs's initialization file to make the changes permanent.
pt_br: Novamente, adicione essas linhas ao arquivo de inicialização do Emacs para tornar as mudanças permanentes.

source: FreeBSD Documentation Specific Settings
pt_br: Configurações Específicas da Documentação do FreeBSD

source: To apply settings specific to the FreeBSD documentation project, create <filename>.dir-locals.el</filename> in the root directory of the documentation repository and add these lines to the file:
pt_br: Para aplicar configurações específicas para o projeto de documentação do FreeBSD, crie o arquivo <filename>.dir-locals.el</filename> no diretório raiz do repositório de documentação e adicione estas linhas ao arquivo:

source: Install from <package>editors/nano</package> or <package>editors/nano-devel</package>.
pt_br: Instale o aplicativo partir de <package>editors/nano</package> ou <package>editors/nano-devel</package>.

source: Copy the sample <acronym>XML</acronym> syntax highlight file to the user's home directory:
pt_br: Copie o arquivo com a amostra da regra para realce da sintaxe <acronym>XML</acronym> para o diretório inicial do usuário:

source: Use an editor to replace the lines in the <filename>~/.nanorc</filename> <literal>syntax "xml"</literal> block with these rules:
pt_br: Use um editor para substituir as linhas do <filename>~/.nanorc</filename> referentes ao bloco <literal>syntax "xml"</literal> por estas regras:

source: Process the file to create embedded tabs:
pt_br: Processe o arquivo para criar guias incorporadas:

source: Specify additional helpful options when running the editor:
pt_br: Especifique opções úteis adicionais ao executar o editor:

source: Users of <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> can define an alias in <filename>~/.cshrc</filename> to automate these options:
pt_br: Usuários do <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> podem definir um alias em <filename>~/.cshrc</filename> para automatizar estas opções:

source: After the alias is defined, the options will be added automatically:
pt_br: Depois que o alias é definido, as opções serão adicionadas automaticamente:

source: See Also
pt_br: Veja também

source: This document is deliberately not an exhaustive discussion of XML, the DTDs listed, and the FreeBSD Documentation Project. For more information about these, you are encouraged to see the following web sites.
pt_br: Este documento não é deliberadamente uma discussão exaustiva de XML, das DTDs listadas e o Projeto de Documentação do FreeBSD. Para mais informações sobre estes, você é encorajado a consultar os seguintes sites.

source: The FreeBSD Documentation Project
pt_br: O projeto de documentação do FreeBSD

source: <link xlink:href="@@URL_RELPREFIX@@/docproj/index.html">The FreeBSD Documentation Project web pages</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/docproj/index.html">As Páginas Web do Projeto de Documentação do FreeBSD</link>

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">The FreeBSD Handbook</link>
pt_br: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">O Handbook do FreeBSD</link>

source: <link xlink:href="http://www.w3.org/XML/">W3C's XML page SGML/XML web page</link>
pt_br: <link xlink:href="http://www.w3.org/XML/">Página W3C's XML Página Web SGML/XML</link>

source: <link xlink:href="http://www.w3.org/">The World Wide Web Consortium</link>
pt_br: <link xlink:href="http://www.w3.org/">O Consórcio World Wide Web</link>

source: <link xlink:href="http://www.w3.org/TR/REC-html40/">The HTML 4.0 specification</link>
pt_br: <link xlink:href="http://www.w3.org/TR/REC-html40/">A especificação HTML 4.0</link>

source: <link xlink:href="http://www.oasis-open.org/docbook/">The DocBook Technical Committee</link>, maintainers of the DocBook DTD
pt_br: <link xlink:href="http://www.oasis-open.org/docbook/">O Comitê Técnico do DocBook </link>, mantenedores do DocBook DTD

source: <link xlink:href="http://www.docbook.org/">DocBook: The Definitive Guide</link>, the online documentation for the DocBook DTD
pt_br: <link xlink:href="http://www.docbook.org/">DocBook: O Guia Definitivo </link>, a documentação online do DocBook DTD

source: <link xlink:href="http://docbook.sourceforge.net/">The DocBook Open Repository</link> contains DSSSL stylesheets and other resources for people using DocBook
pt_br: <link xlink:href="http://docbook.sourceforge.net/">O DocBook Open Repository</link> contém folhas de estilo DSSSL e outros recursos para pessoas que usam DocBook

source: These examples are not exhaustive—they do not contain all the elements that might be desirable to use, particularly in a document's front matter. For more examples of DocBook markup, examine the <acronym>XML</acronym> source for this and other documents available in the <application>Subversion</application> <literal>doc</literal> repository, or available online starting at <uri xlink:href="http://svnweb.FreeBSD.org/doc/">http://svnweb.FreeBSD.org/doc/</uri>.
pt_br: Estes exemplos não são exaustivos - eles não contêm todos os elementos que podem ser desejáveis ​​de usar, particularmente em relação ao inicio dos documentos (Front Matter). Para mais exemplos de marcação DocBook, examine o código <acronym>XML</acronym> para este e outros documentos disponíveis no repositório <application>Subversion</application> <literal>doc</literal> ou disponível on-line a partir de <uri xlink:href="http://svnweb.FreeBSD.org/doc/">http://svnweb.FreeBSD.org/doc/</uri>.

source: DocBook <tag>book</tag>
pt_br: <tag>Livro</tag> DocBook

source: DocBook <tag>article</tag>
pt_br: <tag>Artigo</tag> DocBook
