Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Danilo G. Baio, dbaio@FreeBSD.org, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018

source: FreeBSD Documentation Project Primer for New Contributors
pt_br: Primer do Projeto de Documentação do FreeBSD para Novos Colaboradores

source: <orgname>The FreeBSD Documentation Project</orgname>
pt_br: <orgname>Projeto de Documentação do FreeBSD</orgname>

source: Thank you for becoming a part of the FreeBSD Documentation Project. Your contribution is extremely valuable, and we appreciate it.
pt_br: Obrigado por fazer parte do Projeto de Documentação do FreeBSD. A sua contribuição é extremamente valiosa.

source: This primer covers details needed to start contributing to the FreeBSD Documentation Project, or <acronym>FDP</acronym>, including tools, software, and the philosophy behind the Documentation Project.
pt_br: Este primer cobre tudo o que você precisa saber para começar a contribuir com o Projeto de Documentação do FreeBSD, ou <acronym>FDP</acronym>, incluindo ferramentas, softwares, e a filosofia por trás do Projeto de Documentação.

source: This is a work in progress. Corrections and additions are always welcome.
pt_br: Este documento é um trabalho em andamento. Correções e adições são sempre bem vindas.

source: Preface
pt_br: Prefácio

source: Shell Prompts
pt_br: Prompts do Shell

source: This table shows the default system prompt and superuser prompt. The examples use these prompts to indicate which type of user is running the example.
pt_br: Esta tabela mostra o prompt padrão do sistema e o prompt do super usuário. Os exemplos usam estes prompts para indicar com qual usuário o exemplo foi executado.

source: User
pt_br: Usuário

source: Normal user
pt_br: Usuário normal

source: Typographic Conventions
pt_br: Convenções Tipográficas

source: This table describes the typographic conventions used in this book.
pt_br: Esta tabela descreve as convenções tipográficas utilizadas neste livro.

source: Meaning
pt_br: Propósito

source: Examples
pt_br: Exemplos

source: The names of commands.
pt_br: Nome dos comandos.

source: Use <command>ls -l</command> to list all files.
pt_br: Utilize <command>ls -l</command> para listar todos os arquivos.

source: The names of files.
pt_br: Nome dos arquivos.

source: Edit <filename>.login</filename>.
pt_br: Edite <filename>.login</filename>.

source: On-screen computer output.
pt_br: Saída de um programa na tela do computador.

source: What the user types, contrasted with on-screen computer output.
pt_br: O que o usuário digita, quando contrastado com a saída do programa na tela do computador.

source: Manual page references.
pt_br: Referência a uma página de manual.

source: Use <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> to change user identity.
pt_br: Utilize <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> para assumir outro nome de usuário.

source: User and group names.
pt_br: Nome de usuário e de grupos de usuários.

source: Only <systemitem class="username">root</systemitem> can do this.
pt_br: Apenas o <systemitem class="username">root</systemitem> pode fazer isso.

source: Emphasis.
pt_br: Ênfase.

source: The user <emphasis>must</emphasis> do this.
pt_br: O usuário <emphasis>deve</emphasis> fazer isso.

source: Text that the user is expected to replace with the actual text.
pt_br: Texto que o usuário deve substituir com o texto real.

source: To search for a keyword in the manual pages, type <command>man -k <replaceable>keyword</replaceable></command>
pt_br: Para buscar por uma palavra chave nas páginas de manual, digite <command>man -k <replaceable>keyword</replaceable></command>

source: Environment variables.
pt_br: Variáveis de ambiente.

source: <envar>$HOME</envar> is set to the user's home directory.
pt_br: <envar>$HOME</envar> aponta para o diretório inicial do usuário.

source: Notes, Tips, Important Information, Warnings, and Examples
pt_br: Notas, Dicas, Informações Importantes, Avisos e Exemplos

source: Notes, warnings, and examples appear within the text.
pt_br: Notas, avisos e exemplos aparecem ao longo do texto.

source: Notes are represented like this, and contain information to take note of, as it may affect what the user does.
pt_br: Notas são representadas desta forma, e contêm informações para as quais se deve ficar atento, pois podem afetar o que o usuário faz.

source: Tips are represented like this, and contain information helpful to the user, like showing an easier way to do something.
pt_br: Dicas são representadas desta forma, e contêm informações úteis para o usuário, como as que mostram uma maneira mais fácil de fazer alguma coisa.

source: Important information is represented like this. Typically, these show extra steps the user may need to take.
pt_br: Informações importantes são representadas desta forma. Normalmente elas destacam passos extras que o usuário pode precisar realizar.

source: Warnings are represented like this, and contain information warning about possible damage if the instructions are not followed. This damage may be physical, to the hardware or the user, or it may be non-physical, such as the inadvertent deletion of important files.
pt_br: Avisos são representados deste modo, e contêm informações de alerta sobre possíveis danos se não seguir as instruções. Estes danos podem ser físicos, para o equipamento ou para o usuário, ou podem ser não-físicos, tal como a deleção inadvertida de arquivos importantes.

source: A Sample Example
pt_br: Uma Amostra de Exemplo

source: Examples are represented like this, and typically contain examples showing a walkthrough, or the results of a particular action.
pt_br: Os exemplos são representados deste modo, e normalmente contêm exemplos passo a passo, ou mostram os resultados de uma determinada ação.

source: Acknowledgments
pt_br: Agradecimentos

source: My thanks to Sue Blake, Patrick Durusau, Jon Hamilton, Peter Flynn, and Christopher Maden, who took the time to read early drafts of this document and offer many valuable comments and criticisms.
pt_br: Meu muito obrigado a Sue Blake, Patrick Durusau, Jon Hamilton, Peter Flynn, e Christopher Maden, por terem gasto parte do seu tempo lendo os primeiros rascunhos deste documento e por terem oferecido muitos comentários e críticas construtivas para este trabalho.

source: Overview
pt_br: Visão Geral

source: Welcome to the FreeBSD Documentation Project (<acronym>FDP</acronym>). Quality documentation is crucial to the success of FreeBSD, and we value your contributions very highly.
pt_br: Seja bem vindo ao Projeto de Documentação do FreeBSD.(<acronym>FDP</acronym>). Documentação de boa qualidade é muito importante para o sucesso do FreeBSD, e nós valorizamos muito suas contribuições.

source: This document describes how the <acronym>FDP</acronym> is organized, how to write and submit documentation, and how to effectively use the available tools.
pt_br: Este documento descreve como o <acronym>FDP</acronym> é organizado, como escrever e como submeter documentos, e como utilizar de forma efetiva as ferramentas que estão disponíveis.

source: Everyone is welcome to contribute to the <acronym>FDP</acronym>. Willingness to contribute is the only membership requirement.
pt_br: Todos são bem vindos para se juntar ao <acronym>FDP</acronym>. A vontade de contribuir é o único requisito de adesão.

source: This primer shows how to:
pt_br: Este primer mostra como:

source: Identify which parts of FreeBSD are maintained by the <acronym>FDP</acronym>.
pt_br: Identificar quais partes do FreeBSD são mantidas pelo <acronym>FDP</acronym>.

source: Install the required documentation tools and files.
pt_br: Instalar as ferramentas e arquivos de documentação necessários.

source: Make changes to the documentation.
pt_br: Realizar alterações na documentação.

source: Submit changes back for review and inclusion in the FreeBSD documentation.
pt_br: Enviar de volta alterações para revisão e inclusão na documentação do FreeBSD.

source: Some preparatory steps must be taken before editing the FreeBSD documentation. First, subscribe to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>. Some team members also interact on the <literal>#bsddocs</literal> <acronym>IRC</acronym> channel on <link xlink:href="http://www.efnet.org/">EFnet</link>. These people can help with questions or problems involving the documentation.
pt_br: Algumas etapas preparatórias devem ser seguidas antes de editar a documentação do FreeBSD. Primeiro, se registre na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de email do projeto de documentação do FreeBSD</link>. Alguns membros do time também interagem no <acronym>IRC</acronym>, canal <literal>#bsddocs</literal> na rede <link xlink:href="http://www.efnet.org/">EFnet</link>. Estas pessoas podem ajudar com questões e problemas envolvendo documentação.

source: Install the <package>textproc/docproj</package> meta-package and <application>Subversion</application>. This meta-package installs all of the software needed to edit and build FreeBSD documentation. The <application>Subversion</application> package is needed to obtain a working copy of the documentation and generate patches with.
pt_br: Instale o meta-port <package>textproc/docproj</package> e o <application>Subversion</application>. Este meta-port instala todo software necessário para editar e compilar a documentação do FreeBSD. O pacote <application>Subversion</application> é necessário para obter uma cópia de trabalho da documentação e para gerar patches.

source: Optional: to generate PDF documentation, install the <package>textproc/fop</package> package as it is not installed by default by <package>textproc/docproj</package>.
pt_br: Opcional: para gerar a documentação em PDF, instale o pacote <package>textproc/fop</package> pois ele não é instalado por padrão com o <package>textproc/docproj</package>.

source: Install a local working copy of the documentation from the FreeBSD repository in <filename>~/doc</filename> (see <xref linkend="working-copy"/>).
pt_br: Obtenha uma cópia local da árvore de documentação do FreeBSD em <filename>~/doc</filename> (see <xref linkend="working-copy"/>).

source: Configure the text editor:
pt_br: Configure o editor de texto:

source: Word wrap set to 70 characters.
pt_br: Defina a quebra de linha para 70 caracteres.

source: Tab stops set to 2.
pt_br: Defina a parada de tabulação para 2.

source: Replace each group of 8 leading spaces with a single tab.
pt_br: Substitua cada grupo de 8 espaços por um tab.

source: Specific editor configurations are listed in <xref linkend="editor-config"/>.
pt_br: Configurações específicas por editor são informados em <xref linkend="editor-config"/>.

source: Update the local working copy:
pt_br: Atualize a árvore de trabalho local:

source: Edit the documentation files that require changes. If a file needs major changes, consult the mailing list for input.
pt_br: Edite os arquivos de documentação que precisam de alterações. Se um arquivo precisar de grandes mudanças, consulte a lista de discussão para obter informações.

source: References to tag and entity usage can be found in <xref linkend="xhtml-markup"/> and <xref linkend="docbook-markup"/>.
pt_br: Referencias pra uso de tag e entidade podem ser encontradas em <xref linkend="xhtml-markup"/> and <xref linkend="docbook-markup"/>.

source: After editing, check for problems by running:
pt_br: Após alteração, cheque por eventuais problemas rodando:

source: Review the output and edit the file to fix any problems shown, then rerun the command to find any remaining problems. Repeat until all of the errors are resolved.
pt_br: Revise a saída e edite o arquivo para corrigir os problemas informados e, em seguida, execute novamente o comando para verificar os problemas restantes. Repita até que todos os erros sejam resolvidos.

source: <emphasis>Always</emphasis> build-test changes before submitting them. Running <userinput>make</userinput> in the top-level directory of the documentation being edited will generate that documentation in split HTML format. For example, to build the English version of the Handbook in <acronym>HTML</acronym>, run <command>make</command> in the <filename>en_US.ISO8859-1/books/handbook/</filename> directory.
pt_br: <emphasis>Sempre</emphasis> realize testes de compilação antes de submeter algo. Execute <userinput>make</userinput> no diretório de nível superior da documentação alterada e assim será gerado a documentação no formato HTML com divisões. Por exemplo, pra compilar a versão Inglês do Handbook em <acronym>HTML</acronym>, execute <command>make</command> no diretório <filename>en_US.ISO8859-1/books/handbook/</filename>.

source: When changes are complete and tested, generate a <quote>diff file</quote>:
pt_br: Quando as alterações estiverem completas e testadas, gere um <quote>arquivo diff</quote>:

source: Give the diff file a descriptive name. In the example above, changes have been made to the <filename>bsdinstall</filename> portion of the Handbook.
pt_br: Dê ao arquivo diff um nome. No exemplo acima, foram feitas alterações na parte <filename>bsdinstall</filename> do Handbook.

source: Submit the diff file using the web-based <link xlink:href="https://bugs.FreeBSD.org/bugzilla/enter_bug.cgi?product=Documentation">Problem Report</link> system. If using the web form, enter a Summary of <emphasis>[patch] <replaceable>short description of problem</replaceable></emphasis>. Select the Component <literal>Documentation</literal>. In the Description field, enter a short description of the changes and any important details about them. Use the <guibutton>[ Add an attachment ]</guibutton> button to attach the diff file. Finally, use the <guibutton>[ Submit Bug ]</guibutton> button to submit your diff to the problem report system.
pt_br: Submeta o arquivo diff file pela web para o sistema de <link xlink:href="https://bugs.FreeBSD.org/bugzilla/enter_bug.cgi?product=Documentation">Relatórios de Problema</link>. Se estiver usando o formulário web, insira um Sumário com <emphasis>[patch] <replaceable>descrição curta do problema</replaceable></emphasis>. Selecione o Componente <literal>Documentation</literal>. No campo de Descrição, insira uma breve descrição das alterações e quaisquer detalhes importantes sobre elas. Use o botão <guibutton>[ Add an attachment ]</guibutton> para anexar o arquivo diff. Finalmente, pressione o botão <guibutton>[ Submit Bug ]</guibutton> para enviar seu diff para o sistema de relatório de problemas.

source: The FreeBSD Documentation Set
pt_br: Conjunto de Documentação do FreeBSD

source: The <acronym>FDP</acronym> is responsible for four categories of FreeBSD documentation.
pt_br: O <acronym>FDP</acronym> é responsável por quatro categorias de documentação do FreeBSD.

source: <emphasis>Handbook</emphasis>: The Handbook is the comprehensive online resource and reference for FreeBSD users.
pt_br: <emphasis>Handbook</emphasis>: O handbook almeja ser um compreensivo recurso de referência online para os usuários do FreeBSD.

source: <emphasis>FAQ</emphasis>: The <acronym>FAQ</acronym> uses a short question and answer format to address questions that are frequently asked on the various mailing lists and forums devoted to FreeBSD. This format does not permit long and comprehensive answers.
pt_br: <emphasis>FAQ</emphasis>: O <acronym>FAQ</acronym> utiliza um formato curto de pergunta e resposta para abordar dúvidas que são frequentemente realizadas nas listas de discussão e fóruns dedicados ao FreeBSD. Este formato não permite respostas longas e detalhadas.

source: <emphasis>Manual pages</emphasis>: The English language system manual pages are usually not written by the <acronym>FDP</acronym>, as they are part of the base system. However, the <acronym>FDP</acronym> can reword parts of existing manual pages to make them clearer or to correct inaccuracies.
pt_br: <emphasis>Páginas de Manual</emphasis>: As páginas de manual do sistema de língua inglesa geralmente não são escritas pelo <acronym>FDP</acronym>, pois fazem parte do sistema base. Contudo, o <acronym>FDP</acronym> pode reformular partes das páginas de manual existentes para torná-las mais claras ou para corrigir imprecisões.

source: <emphasis>Web site</emphasis>: This is the main FreeBSD presence on the web, visible at <link xlink:href="https://www.freebsd.org/index.html"> https://www.FreeBSD.org/</link> and many mirrors around the world. The web site is typically a new user's first exposure to FreeBSD.
pt_br: <emphasis>Web site</emphasis>: Esta é a presença principal do FreeBSD na web, visite <link xlink:href="https://www.freebsd.org/index.html"> https://www.FreeBSD.org/</link> e muitos mirrors ao redor do mundo. O site é tipicamente o primeiro contato de um usuário novo com o FreeBSD.

source: Translation teams are responsible for translating the Handbook and web site into different languages. Manual pages are not translated at present.
pt_br: As equipes de tradução são responsáveis por traduzir o manual e o site para diferentes idiomas. As páginas do manual não são traduzidas no momento.

source: Documentation source for the FreeBSD web site, Handbook, and <acronym>FAQ</acronym> is available in the documentation repository at <literal>https://svn.FreeBSD.org/doc/</literal>.
pt_br: Código fonte do site do FreeBSD, Handbook, e <acronym>FAQ</acronym> estão disponíveis no repositório de documentação em <literal>https://svn.FreeBSD.org/doc/</literal>.

source: Source for manual pages is available in a separate source repository located at <literal>https://svn.FreeBSD.org/base/</literal>.
pt_br: Código fonte das páginas de manual estão disponíveis em um repositório diferente localizado em <literal>https://svn.FreeBSD.org/base/</literal>.

source: Documentation commit messages are visible with <command>svn log</command>. Commit messages are also archived at <uri xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all"> http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all</uri>.
pt_br: As mensagens de commit de documentação podem ser visualizadas com <command>svn log</command>. As mensagens de commit também são arquivadas em <uri xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all"> http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all</uri>.

source: Web frontends to both of these repositories are available at <link xlink:href="https://svnweb.FreeBSD.org/doc/"/> and <link xlink:href="https://svnweb.FreeBSD.org/base/"/>.
pt_br: Endereço web para ambos os repositórios disponíveis em <link xlink:href="https://svnweb.FreeBSD.org/doc/"/> e <link xlink:href="https://svnweb.FreeBSD.org/base/"/>.

source: Many people have written tutorials or how-to articles about FreeBSD. Some are stored as part of the <acronym>FDP</acronym> files. In other cases, the author has decided to keep the documentation separate. The <acronym>FDP</acronym> endeavors to provide links to as much of this external documentation as possible.
pt_br: Muitas pessoas tem escrito tutoriais e artigos how-to sobre FreeBSD. Alguns são armazenados como parte dos arquivos <acronym>FDP</acronym>. Em outros casos, o autor decidiu manter a documentação separada. O <acronym>FDP</acronym> esforça-se para fornecer links para o máximo possível dessas documentações externas.

source: Tools
pt_br: Ferramentas

source: Several software tools are used to manage the FreeBSD documentation and render it to different output formats. Some of these tools are required and must be installed before working through the examples in the following chapters. Some are optional, adding capabilities or making the job of creating documentation less demanding.
pt_br: Várias ferramentas são utilizadas para gerenciar a documentação do FreeBSD e renderizá-la para diferentes formatos. Algumas dessas ferramentas são necessárias e devem ser instaladas antes de trabalhar com os exemplos nos capítulos a seguir. Algumas são opcionais, adicionando recursos ou tornando a tarefa de criar documentação mais simples.

source: Required Tools
pt_br: Ferramentas Obrigatórias

source: Install <package>textproc/docproj</package> from the Ports Collection. This <emphasis>meta-port</emphasis> installs all the applications required to do useful work with the FreeBSD documentation. Some further notes on particular components are given below.
pt_br: Instale o <package>textproc/docproj</package> pela Coleção de Ports. Este <emphasis>meta-port</emphasis> instala todos os aplicativos necessários para trabalhar com a documentação do FreeBSD. Informações adicionais específicas de alguns componentes serão informadas abaixo.

source: <acronym>DTD</acronym>s and <acronym>Entities</acronym>
pt_br: <acronym>DTD</acronym>s e <acronym>Entidades</acronym>

source: FreeBSD documentation uses several Document Type Definitions (<acronym>DTD</acronym>s) and sets of <acronym>XML</acronym> entities. These are all installed by the <package>textproc/docproj</package> port.
pt_br: A documentação do FreeBSD utiliza diversas Definições de Tipos de Documento (<acronym>DTD</acronym>s) e conjuntos de entidades <acronym>XML</acronym>. Estes são todos instalados pelo port <package>textproc/docproj</package>.

source: <acronym>XHTML</acronym> is the markup language of choice for the World Wide Web, and is used throughout the FreeBSD web site.
pt_br: <acronym>XHTML</acronym> é a linguagem markup escolhida pela Web, e é utilizada em todo o site do FreeBSD.

source: DocBook is designed for marking up technical documentation. Most of the FreeBSD documentation is written in DocBook.
pt_br: O DocBook é projetado para escrever documentação técnica. A maior parte da documentação do FreeBSD é escrita no DocBook.

source: ISO 8879 entities (<package>textproc/iso8879</package>)
pt_br: Entidades ISO 8879 (<package>textproc/iso8879</package>)

source: Character entities from the ISO 8879:1986 standard used by many <acronym>DTD</acronym>s. Includes named mathematical symbols, additional characters in the Latin character set (accents, diacriticals, and so on), and Greek symbols.
pt_br: Entidades do padrão ISO 8879:1986 utilizado por muitos <acronym>DTD</acronym>s. Inclui símbolos matemáticos nomeados, caracteres adicionais no conjunto de caracteres latinos (acentos, diacríticos e assim por diante) e símbolos Gregos.

source: Optional Tools
pt_br: Ferramentas Opcionais

source: These applications are not required, but can make working on the documentation easier or add capabilities.
pt_br: Essas ferramentas não são necessárias, mas podem facilitar o trabalho na documentação ou adicionar recursos.

source: A popular editor for working with <acronym>XML</acronym> and derived documents, like DocBook <acronym>XML</acronym>.
pt_br: Um editor de texto popular que trabalha com <acronym>XML</acronym> and documentos derivados, como DocBook <acronym>XML</acronym>.

source: Both of these editors include a special mode for editing documents marked up according to an <acronym>XML</acronym> <acronym>DTD</acronym>. This mode includes commands to reduce the amount of typing needed, and help reduce the possibility of errors.
pt_br: Ambos editores incluem um modo especial para editar documentos marcados como <acronym>XML</acronym> <acronym>DTD</acronym>. Esse modo inclui comandos para reduzir a quantidade de digitação necessária e ajudar a reduzir a possibilidade de erros.

source: The Working Copy
pt_br: A Área de Trabalho
