Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: <_:buildtarget-1/> removes files created by the build process (and goes down the directory tree too). <_:buildtarget-2/> does the same, and also removes the object directory, if any.
pt_br: <_:buildtarget-1/> remove arquivos criados pelo processo de compilação (e também desce na árvore de diretórios). <_:buildtarget-2/> faz a mesma coisa, e também remove o diretório de objetos se este existir.

source: More on Conditionals
pt_br: Mais Condicionais

source: <literal>exists</literal> is another condition function which returns true if the given file exists.
pt_br: <literal>exists</literal> é outra função condicional que retorna verdadeiro se o arquivo informado existir.

source: <literal>empty</literal> returns true if the given variable is empty.
pt_br: <literal>empty</literal> retorna verdadeiro se a variável informada estiver vazia.

source: <literal>target</literal> returns true if the given target does not already exist.
pt_br: <literal>target</literal> retorna verdadeiro se o target informado ainda não existir.

source: Looping Constructs in <command>make (.for)</command>
pt_br: Construções de Looping no <command>make (.for)</command>

source: <literal>.for</literal> provides a way to repeat a set of instructions for each space-separated element in a variable. It does this by assigning a variable to contain the current element in the list being examined.
pt_br: <literal>.for</literal> fornece uma maneira de repetir instruções definidas para cada elemento separado por espaço em uma variável. Ele faz isso atribuíndo uma variável para conter o elemento atual da lista que está sendo examinada.

source: In the above, if <varname>SUBDIR</varname> is empty, no action is taken; if it has one or more elements, the instructions between <literal>.for</literal> and <literal>.endfor</literal> would repeat for every element, with <varname>entry</varname> being replaced with the value of the current element.
pt_br: No código acima, se <varname>SUBDIR</varname> estiver vazia, nenhuma ação será executada; se ela possuir um ou mais elementos, as instruções entre <literal> .for </literal> e <literal> .endfor </literal> serão repetidas para cada elemento, com o <varname>entry</varname> sendo substituído com o valor do elemento atual.

source: The Website
pt_br: O Website

source: The FreeBSD web site is part of the FreeBSD documents. Files for the web site are stored in the <filename>en_US.ISO8859-1/htdocs</filename> subdirectory of the document tree directory, <filename>~/doc</filename> in this example.
pt_br: O web site do FreeBSD é parte da documentação do FreeBSD. Os arquivos para o web site são armazenados no subdiretório <filename>en_US.ISO8859-1/htdocs</filename> do repositório <filename>~/doc</filename> neste exemplo.

source: Environment Variables
pt_br: Variáveis ​​de Ambiente

source: Several environment variables control which parts of the web site are built or installed, and to which directories.
pt_br: Diversas variáveis ​​de ambiente controlam quais partes do web site são compiladas ou instaladas e para quais diretórios.

source: The web build system uses <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and considers variables to be set when they have been defined, even if they are empty. The examples here show the recommended ways of defining and using these variables. Setting or defining these variables with other values or methods might lead to unexpected surprises.
pt_br: O sistema de compilação do web site utiliza o <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry>, e valida variáveis configuradas mesmo se estiverem vazias. Os exemplos aqui mostram as formas recomendadas de configurar e utilizar essas variáveis. Definir ou configurar essas variáveis ​​com outros valores ou métodos pode levar a surpresas inesperadas.

source: DOCDIR specifies the path where the web site files are to be installed.
pt_br: DOCDIR especifica o caminho onde os arquivos do web site devem ser instalados.

source: This variable is best set with <citerefentry><refentrytitle>env</refentrytitle><manvolnum>1</manvolnum></citerefentry> or the user shell's method of setting environment variables, <command>setenv</command> for <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <command>export</command> for <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Esta variável é melhor configurada com <citerefentry><refentrytitle>env</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou o método do shell do usuário para configurar variáveis ​​de ambiente, <command>setenv</command> para <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou <command>export</command> para <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Default: undefined. Build and include all translations.
pt_br: Padrão: indefinido. Compile e inclua todas as traduções.

source: <userinput>ENGLISH_ONLY=yes</userinput>: use only the English documents and ignore all translations.
pt_br: <userinput>ENGLISH_ONLY=yes</userinput>: compile apenas os documentos em Inglês e ignore todas as traduções.

source: Default: undefined. Build both the web site and all the books and articles.
pt_br: Padrão: indefinido. Compile o web site e todos os livros e artigos.

source: <userinput>WEB_ONLY=yes</userinput>: build or install only <acronym>HTML</acronym> pages from the <filename>en_US.ISO8859-1/htdocs</filename> directory. Other directories and documents, including books and articles, will be ignored.
pt_br: <userinput>WEB_ONLY=yes</userinput>: Compile ou instale apenas páginas <acronym>HTML</acronym> do diretório <filename>en_US.ISO8859-1/htdocs</filename>. Outros diretórios e documentos, incluindo livros e artigos, serão ignorados.

source: Default: undefined. Build and include all the available languages on the web site.
pt_br: Padrão: indefinido. Compile e inclua todos os idiomas disponíveis no web site.

source: Set to a space-separated list of languages to be included in the build or install. The formats are the same as the directory names in the document root directory. For example, to include the German and French documents:
pt_br: Defina com uma lista separada por espaços, todos os idiomas a serem incluídos na compilação ou instalação. Os formatos são os mesmos que os nomes de diretório no diretório raiz do documento. Por exemplo, para incluir os documentos alemão e francês:

source: <varname>WEB_ONLY</varname>, <varname>WEB_LANG</varname>, and <varname>ENGLISH_ONLY</varname> are <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> variables and can be set in <filename>/etc/make.conf</filename>, <filename>Makefile.inc</filename>, as environment variables on the command line, or in dot files.
pt_br: <varname>WEB_ONLY</varname>, <varname>WEB_LANG</varname>, e <varname>ENGLISH_ONLY</varname> são variáveis <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> que​e podem ser definidas em <filename>/etc/make.conf</filename>, <filename>Makefile.inc</filename>, como variáveis ​​de ambiente na linha de comando, ou em arquivos dot.

source: Building and Installing the Web Pages
pt_br: Compilando e Instalando as Páginas Web

source: Having obtained the documentation and web site source files, the web site can be built.
pt_br: Após obter os arquivos fontes da documentação e web site, o site pode ser compilado.

source: An actual installation of the web site is run as the <systemitem class="username">root</systemitem> user because the permissions on the web server directory will not allow files to be installed by an unprivileged user. For testing, it can be useful to install the files as a normal user to a temporary directory.
pt_br: Uma instalação real do web site precisa ser executada pelo usuário <systemitem class="username">root</systemitem> porque as permissões no diretório do servidor web não permitirão a instalação de arquivos por um usuário não privilegiado. Para testar, pode ser útil instalar os arquivos com um usuário normal em um diretório temporário.

source: In these examples, the web site files are built by user <systemitem class="username">jru</systemitem> in their home directory, <filename>~/doc</filename>, with a full path of <filename>/usr/home/jru/doc</filename>.
pt_br: Nestes exemplos, os arquivos do web site são criados pelo usuário <systemitem class="username">jru</systemitem> em seu diretório home, <filename>~/doc</filename>, com um caminho completo de <filename>/usr/home/jru/doc</filename>.

source: The web site build uses the <filename>INDEX</filename> from the Ports Collection and might fail if that file or <filename>/usr/ports</filename> is not present. The simplest approach is to install the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports.html#ports-tree">Ports Collection</link>.
pt_br: A compilação do web site utiliza o arquivo <filename>INDEX</filename> da Coleção de Ports e pode falhar se este arquivo ou <filename>/usr/ports</filename> não estiver presente no sistema. A abordagem mais simples é instalar a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ports.html#ports-tree">Coleção de Ports</link>.

source: Build the Full Web Site and All Documents
pt_br: Compile o Web Site Completo e Todos Documentos

source: Build the web site and all documents. The resulting files are left in the document tree:
pt_br: Compile o web site e todos os documentos. Os arquivos finais são deixados na árvore de documento:

source: Build Only the Web Site in English
pt_br: Compile Apenas o Web Site em Inglês

source: Build the web site only, in English, as user <systemitem class="username">jru</systemitem>, and install the resulting files into <filename>/tmp/www</filename> for testing:
pt_br: Compile o web site apenas em Inglês, como usuário <systemitem class="username">jru</systemitem>, e instale os arquivos finais em <filename>/tmp/www</filename> para teste:

source: Changes to static files can usually be tested by viewing the modified files directly with a web browser. If the site has been built as shown above, a modified main page can be viewed with:
pt_br: Alterações em arquivos estáticos geralmente podem ser testadas visualizando os arquivos modificados diretamente com um navegador web. Se o web site foi construído como apresentado acima, a página principal modificada pode ser visualizada com:

source: Modifications to dynamic files can be tested with a web server running on the local system. After building the site as shown above, this <filename>/usr/local/etc/apache24/httpd.conf</filename> can be used with <package>www/apache24</package>:
pt_br: Modificações em arquivos dinâmicos podem ser testadas com um servidor web rodando no sistema local. Depois de construir o site como apresentado acima, o <filename>/usr/local/etc/apache24/httpd.conf</filename> pode ser usado com <package>www/apache24</package>:

source: Start the web server with
pt_br: Inicie o servidor web com

source: The web site can be viewed at <link xlink:href="http://localhost"/>. Be aware that many links refer to the real FreeBSD site by name, and those links will still go to the external site instead of the local test version. Fully testing the local site will require temporarily setting <acronym>DNS</acronym> so <literal>www.FreeBSD.org</literal> resolves to <literal>localhost</literal> or the local <acronym>IP</acronym> address.
pt_br: O web site pode ser visualizado em <link xlink:href="http://localhost"/>. Esteja ciente de que muitos links se referem ao site real do FreeBSD por nome, e esses links ainda levar para o site externo em vez da versão de teste local. O teste completo do web site local exigirá a configuração temporária do <acronym>DNS</acronym> para que o endereço <literal>www.FreeBSD.org</literal> seja resolvido como <literal>localhost</literal> ou o endereço <acronym>IP</acronym> local.

source: Build and Install the Web Site
pt_br: Compile e Instale o Web Site

source: Build the web site and all documents as user <systemitem class="username">jru</systemitem>. Install the resulting files as <systemitem class="username">root</systemitem> into the default directory, <filename>/root/public_html</filename>:
pt_br: Compile o web site e todos os documentos como usuário <systemitem class="username">jru</systemitem>. Instale os arquivos finais como <systemitem class="username">root</systemitem> no diretório padrão, <filename>/root/public_html</filename>:

source: The install process does not delete any old or outdated files that existed previously in the same directory. If a new copy of the site is built and installed every day, this command will find and delete all files that have not been updated in three days:
pt_br: O processo de instalação não exclui nenhum arquivo antigo ou desatualizado que existia anteriormente no mesmo diretório. Se uma nova cópia do web site for criada e instalada todos os dias, esse comando localizará e excluirá todos os arquivos que não foram atualizados em três dias:

source: XML Primer
pt_br: Primer XML

source: Most <acronym>FDP</acronym> documentation is written with markup languages based on <acronym>XML</acronym>. This chapter explains what that means, how to read and understand the documentation source, and the <acronym>XML</acronym> techniques used.
pt_br: A maioria das documentações do <acronym>FDP</acronym> é escrita com linguagens markup baseadas em <acronym>XML</acronym>. Este capítulo explica o que isso significa, como ler e entender os arquivos fontes da documentação e as técnicas de <acronym>XML</acronym> utilizadas.

source: Portions of this section were inspired by Mark Galassi's <link xlink:href="http://www.galassi.org/mark/mydocs/docbook-intro/docbook-intro.html">Get Going With DocBook</link>.
pt_br: Partes desta seção foram inspiradas por Mark Galassi's <link xlink:href="http://www.galassi.org/mark/mydocs/docbook-intro/docbook-intro.html">Get Going With DocBook</link>.

source: In the original days of computers, electronic text was simple. There were a few character sets like <acronym>ASCII</acronym> or <acronym>EBCDIC</acronym>, but that was about it. Text was text, and what you saw really was what you got. No frills, no formatting, no intelligence.
pt_br: Nos primórdios da era computacional, o texto eletrônico era simples. Havia poucos conjuntos de caracteres como <acronym>ASCII</acronym> ou <acronym>EBCDIC</acronym>, e apenas isso. Texto era texto, e o que você lia era realmente o texto que você tinha. Sem frescuras, sem formatação, sem inteligência.

source: Inevitably, this was not enough. When text is in a machine-usable format, machines are expected to be able to use and manipulate it intelligently. Authors want to indicate that certain phrases should be emphasized, or added to a glossary, or made into hyperlinks. Filenames could be shown in a <quote>typewriter</quote> style font for viewing on screen, but as <quote>italics</quote> when printed, or any of a myriad of other options for presentation.
pt_br: Inevitavelmente, isso não era suficiente. Quando o texto está em um formato utilizável por computadores, espera-se que eles possam usá-lo e manipulá-lo de maneira inteligente. Os autores querem indicar que certas frases devem ser enfatizadas, adicionadas a um glossário ou transformadas em hiperlinks. Os nomes dos arquivos podem ser apresentados em uma fonte de estilo <quote>typewriter</quote> para exibição na tela do computador, ou como <quote>itálico</quote> quando impressos, ou qualquer outra opção dentre uma infinidade de opções para apresentação.

source: It was once hoped that Artificial Intelligence (AI) would make this easy. The computer would read the document and automatically identify key phrases, filenames, text that the reader should type in, examples, and more. Unfortunately, real life has not happened quite like that, and computers still require assistance before they can meaningfully process text.
pt_br: Esperava-se que a Inteligência Artificial (IA) facilitasse isso. O computador leria o documento e identificaria automaticamente frases-chave, nomes de arquivos, textos que o leitor deveria digitar, exemplos e outros tipos. Infelizmente, na vida real não foi dessa forma, e os computadores ainda precisam de assistência antes que possam processar o texto de maneira significativa.

source: More precisely, they need help identifying what is what. Consider this text:
pt_br: Mais precisamente, eles precisam de ajuda para identificar o que é o quê. Considere este texto:

source: To remove <filename>/tmp/foo</filename>, use <citerefentry><refentrytitle>rm</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Para remover <filename>/tmp/foo</filename>, use <citerefentry><refentrytitle>rm</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: It is easy to see which parts are filenames, which are commands to be typed in, which parts are references to manual pages, and so on. But the computer processing the document cannot. For this we need markup.
pt_br: É fácil identificar quais partes são nomes de arquivos, quais são comandos a serem digitados, quais partes são referências a páginas de manual e assim por diante. Mas o computador que processa o documento não consegue. Para isso, precisamos utilizar markup.

source: <quote>Markup</quote> is commonly used to describe <quote>adding value</quote> or <quote>increasing cost</quote>. The term takes on both these meanings when applied to text. Markup is additional text included in the document, distinguished from the document's content in some way, so that programs that process the document can read the markup and use it when making decisions about the document. Editors can hide the markup from the user, so the user is not distracted by it.
pt_br: <quote>Markup</quote> é geralmate utilizado assim <quote>adicionando valor</quote> ou <quote>aumentando o custo</quote>. O termo tem seus significados realçados quando aplicado ao texto. Markup é um texto adicional incluído no documento, diferenciado de alguma forma do conteúdo do documento, para que os programas que processam o documento possam ler a marcação e utiliza-la ao tomar decisões sobre o documento. Os editores podem ocultar o markup do usuário, para que este não se distraia com ela.

source: The extra information stored in the markup <emphasis>adds value</emphasis> to the document. Adding the markup to the document must typically be done by a person—after all, if computers could recognize the text sufficiently well to add the markup then there would be no need to add it in the first place. This <emphasis>increases the cost</emphasis> (the effort required) to create the document.
pt_br: A informação extras armazenada no markup <emphasis>adiciona valor</emphasis> ao documento. Adicionar markup ao documento normalmente deve ser feito por uma pessoa - afinal, se os computadores pudessem reconhecer o texto suficientemente bem para adicionar a markup, não haveria necessidade de utilizar markup. Isto <emphasis>aumenta o custo</emphasis> (o esforço necessário) para criar algum documento.

source: The previous example is actually represented in this document like this:
pt_br: O exemplo anterior é representado neste documento da seguinte forma:

source: <tag class="starttag">para</tag>To remove <tag class="starttag">filename</tag>/tmp/foo<tag class="endtag">filename</tag>, use &amp;man.rm.1;.<tag class="endtag">para</tag> <tag class="starttag">screen</tag>&amp;prompt.user; <tag class="starttag">userinput</tag>rm /tmp/foo<tag class="endtag">userinput</tag><tag class="endtag">screen</tag>
pt_br: <tag class="starttag">para</tag>Para remover <tag class="starttag">filename</tag>/tmp/foo<tag class="endtag">filename</tag>, use &amp;man.rm.1;.<tag class="endtag">para</tag> <tag class="starttag">screen</tag>&amp;prompt.user; <tag class="starttag">userinput</tag>rm /tmp/foo<tag class="endtag">userinput</tag><tag class="endtag">screen</tag>

source: The markup is clearly separate from the content.
pt_br: O markup é claramente separado do conteúdo.

source: Markup languages define what the markup means and how it should be interpreted.
pt_br: As linguagens markup definem o que as marcações significam e como elas devem ser interpretadas.

source: Of course, one markup language might not be enough. A markup language for technical documentation has very different requirements than a markup language that is intended for cookery recipes. This, in turn, would be very different from a markup language used to describe poetry. What is really needed is a first language used to write these other markup languages. A <emphasis>meta markup language</emphasis>.
pt_br: Claro, uma linguagem markup pode não ser suficiente. Uma linguagem markup para documentação técnica tem requisitos muito diferentes de uma linguagem markup destinada a receitas de culinária. Isso, por sua vez, seria muito diferente de uma linguagem markup utilizada para descrever uma poesia. O que é realmente necessário é uma primeira linguagem utilizada para escrever essas outras linguagens markup. Uma <emphasis>meta linguagem markup</emphasis>.

source: This is exactly what the eXtensible Markup Language (<acronym>XML</acronym>) is. Many markup languages have been written in <acronym>XML</acronym>, including the two most used by the <acronym>FDP</acronym>, <acronym>XHTML</acronym> and DocBook.
pt_br: É exatamente isso que a eXtensible Markup Language (<acronym>XML</acronym>) é. Muitas linguagens markup foram escritas em <acronym>XML</acronym>, incluindo as duas mais utilizadas pelo <acronym>FDP</acronym>, <acronym>XHTML</acronym> e DocBook.

source: Each language definition is more properly called a grammar, vocabulary, schema or Document Type Definition (<acronym>DTD</acronym>). There are various languages to specify an <acronym>XML</acronym> grammar, or <emphasis>schema</emphasis>.
pt_br: Cada definição de idioma é mais apropriadamente chamada de gramática, vocabulário, esquema ou Definição de Tipo de Documento (<acronym>DTD</acronym>). Existem vários idiomas para especificar uma gramática <acronym>XML</acronym> ou um <emphasis>schema</emphasis>.

source: A schema is a <emphasis>complete</emphasis> specification of all the elements that are allowed to appear, the order in which they should appear, which elements are mandatory, which are optional, and so forth. This makes it possible to write an <acronym>XML</acronym> <emphasis>parser</emphasis> which reads in both the schema and a document which claims to conform to the schema. The parser can then confirm whether or not all the elements required by the vocabulary are in the document in the right order, and whether there are any errors in the markup. This is normally referred to as <quote>validating the document</quote>.
pt_br: Um schema é uma especificação <emphasis>completa</emphasis> de todos os elementos que podem ser utilizados, a ordem em que devem aparecer, quais elementos são obrigatórios, quais são opcionais e assim por diante. Isso torna possível escrever um <acronym>XML</acronym> <emphasis>parser</emphasis> que lê tanto o schema quanto um documento que afirma estar em conformidade com o schema. O parser pode confirmar se todos os elementos exigidos pelo vocabulário estão ou não na ordem correta do documento ou se há algum erro no markup. Isto é normalmente conhecido como a <quote>valiidação do documento</quote>.
