Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: Typically, invoking <_:buildtarget-1/> will rebuild the application, and invoking <_:buildtarget-2/> will remove the temporary files (<filename>.o</filename> for example) created by the build process.
pt_br: Normalmente, invocar <_:buildtarget-1/> irá reconstruir o aplicativo, e invocar <_:buildtarget-2/> removerá os arquivos temporários (<filename>.o</filename> por exemplo) criados pelo processo de compilação.

source: <_:buildtarget-1/> may be controlled by a number of variables, including <varname>CLOBBER</varname> and <varname>RECURSE</varname>.
pt_br: <_:buildtarget-1/> pode ser controlado por várias de variáveis, incluindo <varname>CLOBBER</varname> e <varname>RECURSE</varname>.

source: Literal Text
pt_br: Texto Literal

source: Literal text, or text which should be entered verbatim, is often needed in documentation. This is text that is excerpted from another file, or which should be copied exactly as shown from the documentation into another file.
pt_br: O texto literal, ou texto que deve ser inserido na íntegra, é frequentemente necessário na documentação. Este é um texto extraído de outro arquivo ou que deve ser copiado exatamente como mostrado na documentação em um outro arquivo.

source: Some of the time, <tag>programlisting</tag> will be sufficient to denote this text. But <tag>programlisting</tag> is not always appropriate, particularly when you want to include a portion of a file <quote>in-line</quote> with the rest of the paragraph.
pt_br: Na maioria das vezes, <tag>programlisting</tag> será suficiente para denotar este texto. Mas <tag>programlisting</tag> nem sempre é apropriado, particularmente quando você quer incluir uma parte de um arquivo <quote>in-line</quote> com o resto do parágrafo.

source: On these occasions, use <tag>literal</tag>.
pt_br: Nestes casos, use <tag>literal</tag>.

source: <tag>literal</tag> Example
pt_br: Exemplo <tag>literal</tag>

source: The <literal>maxusers 10</literal> line in the kernel configuration file determines the size of many system tables, and is a rough guide to how many simultaneous logins the system will support.
pt_br: A linha <literal>maxusers 10</literal> no arquivo de configuração do kernel determina o tamanho de muitas tabelas do sistema e é um guia aproximado de quantos logins simultâneos o sistema suportará.

source: Showing Items That the User <emphasis>Must</emphasis> Fill In
pt_br: Mostrando Itens que o Usuário <emphasis>Deve</emphasis> Preencher

source: There will often be times when the user is shown what to do, or referred to a file or command line, but cannot simply copy the example provided. Instead, they must supply some information themselves.
pt_br: Haverá diversos momentos em que o usuário irá ver o que fazer, ou será referenciado a um arquivo ou linha de comando, mas não poderá simplesmente copiar o exemplo fornecido. Em vez disso, eles precisam fornecer algumas informações.

source: <tag>replaceable</tag> is designed for this eventuality. Use it <emphasis>inside</emphasis> other elements to indicate parts of that element's content that the user must replace.
pt_br: <tag>replaceable</tag> é projetado para essa eventualidade. Use isso <emphasis>dentro</emphasis> de outros elementos para indicar partes do conteúdo desse elemento que o usuário deve substituir.

source: <tag>replaceable</tag> Example
pt_br: Exemplo de <tag>replaceable</tag>

source: <tag>replaceable</tag> can be used in many different elements, including <tag>literal</tag>. This example also shows that <tag>replaceable</tag> should only be wrapped around the content that the user <emphasis>is</emphasis> meant to provide. The other content should be left alone.
pt_br: <tag>replaceable</tag> pode ser usado em diversos elementos, incluindo <tag>literal</tag>. Este exemplo também mostra que o <tag>replaceable</tag> deve estar apenas em torno do conteúdo que o usuário <emphasis>está</emphasis> destinado a fornecer. O outro conteúdo deve ser deixado de lado.

source: The <literal>maxusers <replaceable>n</replaceable></literal> line in the kernel configuration file determines the size of many system tables, and is a rough guide to how many simultaneous logins the system will support.
pt_br: A linha <literal>maxusers <replaceable>n</replaceable></literal> no arquivo de configuração do kernel determina o tamanho de muitas tabelas do sistema e é um guia aproximado de quantos logins simultâneos o sistema suportará.

source: For a desktop workstation, <literal>32</literal> is a good value for <replaceable>n</replaceable>.
pt_br: Para uma estação de trabalho, <literal> 32 </literal> é um bom valor para <replaceable>n</replaceable>.

source: Showing <acronym>GUI</acronym> Buttons
pt_br: Mostrando Botões <acronym>GUI</acronym>

source: Buttons presented by a graphical user interface are marked with <tag>guibutton</tag>. To make the text look more like a graphical button, brackets and non-breaking spaces are added surrounding the text.
pt_br: Os botões apresentados por uma interface gráfica do usuário são marcados com <tag>guibutton</tag>. Para tornar o texto mais parecido com um botão gráfico, colchetes e espaços não separáveis ​​são adicionados em volta do texto.

source: <tag>guibutton</tag> Example
pt_br: Exemplo <tag>guibutton</tag>

source: Edit the file, then click <guibutton>[ Save ]</guibutton> to save the changes.
pt_br: Edite o arquivo e clique em <guibutton>[ Salvar ]</guibutton> para salvar as alterações.

source: Quoting System Errors
pt_br: Citações de Erros do Sistema

source: System errors generated by FreeBSD are marked with <tag>errorname</tag>. This indicates the exact error that appears.
pt_br: Erros de sistema gerados pelo FreeBSD são marcados com <tag>errorname</tag>. Isso indica o erro exato que aparece.

source: <tag>errorname</tag> Example
pt_br: Exemplo <tag>errorname</tag>

source: Images
pt_br: Imagens

source: Image support in the documentation is somewhat experimental. The mechanisms described here are unlikely to change, but that is not guaranteed.
pt_br: O suporte de imagem na documentação é um pouco experimental. Os mecanismos descritos aqui provavelmente não mudarão, mas isso não é garantido.

source: To provide conversion between different image formats, the <package>graphics/ImageMagick</package> port must be installed. This port is not included in the <package>textproc/docproj</package> meta port, and must be installed separately.
pt_br: Para fornecer conversão entre diferentes formatos de imagem, o port <package>graphics/ImageMagick</package> deve estar instalado. Esse port não está incluído no meta port <package>textproc/docproj</package> e deve ser instalado separadamente.

source: A good example of the use of images is the <filename>doc/en_US.ISO8859-1/articles/vm-design/</filename> document. Examine the files in that directory to see how these elements are used together. Build different output formats to see how the format determines what images are shown in the rendered document.
pt_br: Um bom exemplo do uso de imagens é o documento <filename>graphics/ImageMagick</filename>. Examine os arquivos nesse diretório para ver como esses elementos são usados ​​juntos. Crie formatos de saída diferentes para ver como o formato determina quais imagens são mostradas no documento renderizado.

source: Image Formats
pt_br: Formatos de Imagem

source: The following image formats are currently supported. An image file will automatically be converted to bitmap or vector image depending on the output document format.
pt_br: Os seguintes formatos de imagem são suportados atualmente. Um arquivo de imagem será automaticamente convertido em bitmap ou imagem vetorial, dependendo do formato do documento de saída.

source: These are the <emphasis>only</emphasis> formats in which images should be committed to the documentation repository.
pt_br: Estes são os formatos <emphasis>somente</emphasis> nos quais as imagens devem ser enviadas para o repositório de documentação.

source: Images that are primarily vector based, such as network diagrams, time lines, and similar, should be in this format. These images have a <filename>.eps</filename> extension.
pt_br: Imagens com base principalmente em vetores, como diagramas de rede, linhas de tempo e similares, devem estar nesse formato. Estas imagens têm uma extensão <filename>.eps</filename>.

source: For bitmaps, such as screen captures, use this format. These images have the <filename>.png</filename> extension.
pt_br: Para bitmaps, como capturas de tela, use este formato. Essas imagens têm a extensão <filename>.png</filename>.

source: <acronym>PIC</acronym> is a language for drawing simple vector-based figures used in the <citerefentry><refentrytitle>pic</refentrytitle><manvolnum>1</manvolnum></citerefentry> utility. These images have the <filename>.pic</filename> extension.
pt_br: <acronym>PIC</acronym> é uma linguagem para desenhar figuras baseadas em vetor simples usadas no utilitário <citerefentry><refentrytitle>pic</refentrytitle> <manvolnum>1</manvolnum></citerefentry>. Essas imagens têm a extensão <filename>.pic</filename>.

source: This format is specific to screenshots of console output. The following command generates an SCR file <filename>shot.scr</filename> from video buffer of <filename>/dev/ttyv0</filename>:
pt_br: Este formato é específico para capturas de tela da saída do console. O seguinte comando gera um arquivo SCR <filename>shot.scr</filename> do buffer de vídeo <filename>/dev/ttyv0</filename>:

source: This is preferable to <acronym>PNG</acronym> format for screenshots because the <acronym>SCR</acronym> file contains plain text of the command lines so that it can be converted to a <acronym>PNG</acronym> image or a plain text depending on the output document format.
pt_br: É preferível o formato <acronym>PNG</acronym> para capturas de tela porque o arquivo <acronym>SCR</acronym> contém texto sem formatação das linhas de comando para que possa ser convertido em uma imagem <acronym>PNG</acronym> ou um texto simples, dependendo do formato do documento de saída.

source: Use the appropriate format for each image. Documentation will often have a mix of <acronym>EPS</acronym> and <acronym>PNG</acronym> images. The <filename>Makefile</filename>s ensure that the correct format image is chosen depending on the output format used. <emphasis>Do not commit the same image to the repository in two different formats</emphasis>.
pt_br: Use o formato apropriado para cada imagem. A documentação geralmente tem uma mistura de imagens <acronym>EPS</acronym> e <acronym>PNG</acronym>. O <filename>Makefile</filename> assegura que a imagem de formato correta seja escolhida dependendo do formato de saída usado. <emphasis> Não envie a mesma imagem ao repositório em dois formatos diferentes</emphasis>.

source: The Documentation Project may eventually switch to using the <acronym>SVG</acronym> (Scalable Vector Graphic) format for vector images. However, the current state of <acronym>SVG</acronym> capable editing tools makes this impractical.
pt_br: O Projeto de Documentação pode eventualmente mudar para o formato <acronym>SVG</acronym> (Scalable Vector Graphic) para imagens vetoriais. No entanto, o estado atual das ferramentas de edição compatíveis com <acronym>SVG</acronym> torna isso inviável.

source: Image File Locations
pt_br: Localizações das Imagens

source: Image files can be stored in one of several locations, depending on the document and image:
pt_br: As imagens podem ser armazenados em um dos diversos locais abaixo, dependendo do documento e da imagem:

source: In the same directory as the document itself, usually done for articles and small books that keep all their files in a single directory.
pt_br: No mesmo diretório do documento em si, geralmente feito para artigos e pequenos livros que mantêm todos os arquivos em um único diretório.

source: In a subdirectory of the main document. Typically done when a large book uses separate subdirectories to organize individual chapters.
pt_br: Em um subdiretório do documento principal. Geralmente feito quando um livro grande usa subdiretórios separados para organizar capítulos individuais.

source: When images are stored in a subdirectory of the main document directory, the subdirectory name must be included in their paths in the <filename>Makefile</filename> and the <tag>imagedata</tag> element.
pt_br: Quando as imagens são armazenadas em um subdiretório do diretório do documento principal, o nome do subdiretório deve ser incluído em seus caminhos no <filename>Makefile</filename> e no elemento <tag>imagedata</tag>.

source: In a subdirectory of <filename>doc/share/images</filename> named after the document. For example, images for the Handbook are stored in <filename>doc/share/images/books/handbook</filename>. Images that work for multiple translations are stored in this upper level of the documentation file tree. Generally, these are images that can be used unchanged in non-English translations of the document.
pt_br: Em um subdiretório de <filename>doc/share/images</filename> nomeado após o documento. Por exemplo, as imagens do Handbook estão armazenadas em <filename>doc/share/images/books/handbook</filename>. Imagens que funcionam para várias traduções são armazenadas neste nível superior da árvore de arquivos da documentação. Geralmente, estas são imagens que podem ser usadas inalteradas em traduções não inglesas do documento.

source: Image Markup
pt_br: Marcação em Imagem

source: Images are included as part of a <tag>mediaobject</tag>. The <tag>mediaobject</tag> can contain other, more specific objects. We are concerned with two, the <tag>imageobject</tag> and the <tag>textobject</tag>.
pt_br: As imagens são incluídas como parte de um <tag>mediaobject</tag>. O <tag>mediaobject</tag> pode conter outros objetos mais específicos. Estamos preocupados com dois, o <tag>imageobject</tag> e o <tag>textobject</tag>.

source: Include one <tag>imageobject</tag>, and two <tag>textobject</tag> elements. The <tag>imageobject</tag> will point to the name of the image file without the extension. The <tag>textobject</tag> elements contain information that will be presented to the user as well as, or instead of, the image itself.
pt_br: Inclua um <tag>imageobject</tag> e dois elementos <tag>textobject</tag>. O <tag>imageobject</tag> apontará para o nome do arquivo de imagem sem a extensão. Os elementos <tag>textobject</tag> contêm informações que serão apresentadas ao usuário, bem como, ou em vez da própria imagem.

source: Text elements are shown to the reader in several situations. When the document is viewed in <acronym>HTML</acronym>, text elements are shown while the image is loading, or if the mouse pointer is hovered over the image, or if a text-only browser is being used. In formats like plain text where graphics are not possible, the text elements are shown instead of the graphical ones.
pt_br: Elementos de texto são mostrados ao leitor em várias situações. Quando o documento é exibido em <acronym>HTML</acronym>, elementos de texto são mostrados enquanto a imagem está sendo carregada ou se o ponteiro do mouse estiver sobre a imagem ou se um navegador somente texto estiver sendo usado. Em formatos como texto simples, onde os gráficos não são possíveis, os elementos de texto são mostrados em vez dos gráficos.

source: This example shows how to include an image called <filename>fig1.png</filename> in a document. The image is a rectangle with an A inside it:
pt_br: Este exemplo mostra como incluir uma imagem chamada <filename>fig1.png</filename> em um documento. A imagem é um retângulo com um A dentro dela:

source: Include an <tag>imagedata</tag> element inside the <tag>imageobject</tag> element. The <literal>fileref</literal> attribute should contain the filename of the image to include, without the extension. The stylesheets will work out which extension should be added to the filename automatically.
pt_br: Inclua um elemento <tag>imagedata</tag> dentro do elemento <tag>imageobject</tag>. O atributo <literal>fileref</literal> deve conter o nome do arquivo da imagem a ser incluída, sem a extensão. As folhas de estilo irão descobrir qual extensão deve ser adicionada ao nome do arquivo automaticamente.

source: The first <tag>textobject</tag> contains a <tag>literallayout</tag> element, where the <literal>class</literal> attribute is set to <literal>monospaced</literal>. This is an opportunity to demonstrate <acronym>ASCII</acronym> art skills. This content will be used if the document is converted to plain text.
pt_br: O primeiro <tag>textobject</tag> contém um elemento <tag>literallayout</tag>, onde o atributo <literal>class</literal> é definido como <literal>monospaced</literal>. Esta é uma oportunidade para demonstrar habilidades artísticas em <acronym>ASCII</acronym>. Este conteúdo será usado se o documento for convertido em texto simples.

source: Notice how the first and last lines of the content of the <tag>literallayout</tag> element butt up next to the element's tags. This ensures no extraneous white space is included.
pt_br: Observe como a primeira e a última linha do conteúdo do elemento <tag>literallayout</tag> aparecem ao lado das tags do elemento. Isso garante que nenhum espaço em branco seja incluído.

source: The second <tag>textobject</tag> contains a single <tag>phrase</tag> element. The contents of this phrase will become the <literal>alt</literal> attribute for the image when this document is converted to <acronym>HTML</acronym>.
pt_br: O segundo <tag>textobject</tag> contém um único elemento <tag>phrase</tag>. O conteúdo desta frase se tornará o atributo <literal>alt</literal> para a imagem quando este documento for convertido para <acronym>HTML</acronym>.

source: Image <filename>Makefile</filename> Entries
pt_br: Entradas de Imagem no <filename>Makefile</filename>

source: Images must be listed in the <filename>Makefile</filename> in the <varname>IMAGES</varname> variable. This variable must contain the names of all the <emphasis>source</emphasis> images. For example, if there are three figures, <filename>fig1.eps</filename>, <filename>fig2.png</filename>, <filename>fig3.png</filename>, then the <filename>Makefile</filename> should have lines like this in it.
pt_br: As imagens devem estar listadas no <filename>Makefile</filename> na variável <varname>IMAGES</varname>. Esta variável deve conter os nomes de todas as imagens <emphasis>source</emphasis>. Por exemplo, se houver três figuras, <filename>fig1.eps</filename>, <filename>fig2.png</filename>, <filename>fig3.png</filename>, então o <filename>Makefile</filename> deve ter linhas como esta.

source: or
pt_br: ou

source: Again, the <filename>Makefile</filename> will work out the complete list of images it needs to build the source document, you only need to list the image files <emphasis>you</emphasis> provided.
pt_br: Novamente, o <filename>Makefile</filename> irá elaborar a lista completa de imagens necessárias para compilar o documento, você só precisa listar os arquivos de imagem que <emphasis>você</emphasis> forneceu.

source: Images and Chapters in Subdirectories
pt_br: Imagens e Capítulos em Subdiretórios

source: Be careful when separating documentation into smaller files in different directories (see <xref linkend="xml-primer-include-using-gen-entities"/>).
pt_br: Tenha cuidado ao separar a documentação em arquivos menores em diretórios diferentes (consulte <xref linkend="xml-primer-include-using-gen-entities"/>).

source: Suppose there is a book with three chapters, and the chapters are stored in their own directories, called <filename>chapter1/chapter.xml</filename>, <filename>chapter2/chapter.xml</filename>, and <filename>chapter3/chapter.xml</filename>. If each chapter has images associated with it, place those images in each chapter's subdirectory (<filename>chapter1/</filename>, <filename>chapter2/</filename>, and <filename>chapter3/</filename>).
pt_br: Imagine que haja um livro com três capítulos e os capítulos sejam armazenados em seus próprios diretórios, chamados <filename>chapter1/chapter.xml</filename>, <filename>chapter2/chapter.xml</filename> e <filename>chapter3/chapter.xml</filename>. Se cada capítulo tiver imagens associadas, coloque essas imagens no subdiretório de cada capítulo (<filename>chapter1/</filename>, <filename>chapter2/</filename>, e <filename>chapter3/</filename>).

source: However, doing this requires including the directory names in the <varname>IMAGES</varname> variable in the <filename>Makefile</filename>, <emphasis>and</emphasis> including the directory name in the <tag>imagedata</tag> element in the document.
pt_br: No entanto, fazer isso requer a inclusão dos nomes de diretório na variável <varname>IMAGES</varname> no <filename>Makefile</filename>, <emphasis>e</emphasis> a inclusão do nome do diretório no elemento <tag>imagedata</tag> no documento.

source: For example, if the book has <filename>chapter1/fig1.png</filename>, then <filename>chapter1/chapter.xml</filename> should contain:
pt_br: Por exemplo, se o livro tiver <filename>chapter1/fig1.png</filename>, então <filename>chapter1/chapter.xml</filename> deve conter:

source: The directory name must be included in the <literal>fileref</literal> attribute.
pt_br: O nome do diretório deve ser incluído no atributo <literal>fileref</literal>.

source: The <filename>Makefile</filename> must contain:
pt_br: O <filename>Makefile</filename> deve conter:

source: Links are also in-line elements. To show a <acronym>URI</acronym> without creating a link, see <xref linkend="docbook-markup-uri"/>.
pt_br: Links também são elementos in-line. Para mostrar uma <acronym>URI</acronym> sem criar um link, consulte <xref linkend="docbook-markup-uri"/>.

source: <literal>xml:id</literal> Attributes
pt_br: Atributos <literal>xml:id</literal>

source: Most DocBook elements accept an <literal>xml:id</literal> attribute to give that part of the document a unique name. The <literal>xml:id</literal> can be used as a target for a crossreference or link.
pt_br: A maioria dos elementos DocBook aceita um atributo <literal>xml:id</literal> para dar a essa parte do documento um nome exclusivo. O <literal>xml:id</literal> pode ser usado como um destino para uma referência cruzada ou link.

source: Any portion of the document that will be a link target must have an <literal>xml:id</literal> attribute. Assigning an <literal>xml:id</literal> to all chapters and sections, even if there are no current plans to link to them, is a good idea. These <literal>xml:id</literal>s can be used as unique reference points by anyone referring to the <acronym>HTML</acronym> version of the document.
pt_br: Qualquer parte do documento que será um destino de link deve ter um atributo <literal>xml:id</literal>. Atribuir um <literal>xml:id</literal> a todos os capítulos e seções, mesmo que não haja planos atuais para criar link para eles, é uma boa ideia. Esses <literal>xml:id</literal> s podem ser usados ​​como pontos de referência exclusivos por qualquer pessoa que se refira à versão do documento <acronym>HTML</acronym>.

source: <literal>xml:id</literal> on Chapters and Sections Example
pt_br: <literal>xml:id</literal> em Ccapítulos e sSeções de eExemplo
