Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: <acronym>ISO</acronym> 9070:1991 defines how registered names are generated. It might be derived from the number of an <acronym>ISO</acronym> publication, an <acronym>ISBN</acronym> code, or an organization code assigned according to <acronym>ISO</acronym> 6523. Additionally, a registration authority could be created in order to assign registered names. The <acronym>ISO</acronym> council delegated this to the American National Standards Institute (<acronym>ANSI</acronym>).
pt_br: A <acronym>ISO</acronym> 9070:1991 define como os nomes registrados são gerados. Pode ser derivado do número de uma publicação <acronym>ISO</acronym>, um código <acronym>ISBN</acronym> ou um código de organização atribuído de acordo com a <acronym>ISO</acronym> 6523. Além disso, uma autoridade de registro poderia ser criada para atribuir nomes registrados. O conselho da <acronym>ISO</acronym> delegou isso ao American National Standards Institute (<acronym>ANSI</acronym>).

source: Because the FreeBSD Project has not been registered, the owner string is <literal>-//FreeBSD</literal>. As seen in the example, the <acronym>W3C</acronym> are not a registered owner either.
pt_br: Como o Projeto FreeBSD não foi registrado, a string de propriedade é <literal>-//FreeBSD</literal>. Como visto no exemplo, a <acronym>W3C</acronym> também não é registrada.

source: <replaceable>Keyword</replaceable>
pt_br: <replaceable>Palavra-chave</replaceable>

source: There are several keywords that indicate the type of information in the file. Some of the most common keywords are <literal>DTD</literal>, <literal>ELEMENT</literal>, <literal>ENTITIES</literal>, and <literal>TEXT</literal>. <literal>DTD</literal> is used only for <acronym>DTD</acronym> files, <literal>ELEMENT</literal> is usually used for <acronym>DTD</acronym> fragments that contain only entity or element declarations. <literal>TEXT</literal> is used for <acronym>XML</acronym> content (text and tags).
pt_br: Existem várias palavras-chave que indicam o tipo de informação no arquivo. Algumas das palavras-chave mais comuns são <literal>DTD</literal>, <literal>ELEMENT</literal>, <literal>ENTITIES</literal> e <literal>TEXT</literal>. <literal>DTD</literal> é usada apenas para arquivos <acronym>DTD</acronym>, <literal>ELEMENT</literal> é normalmente usada para fragmentos <acronym>DTD</acronym> que contêm apenas declarações de elementos ou entidades. <literal>TEXT</literal> é usada para conteúdo <acronym>XML</acronym> (texto e tags).

source: <replaceable>Description</replaceable>
pt_br: <replaceable>Descrição</replaceable>

source: Any description can be given for the contents of this file. This may include version numbers or any short text that is meaningful and unique for the <acronym>XML</acronym> system.
pt_br: Qualquer descrição pode ser informada no conteúdo deste campo. Isso pode incluir números de versão ou qualquer texto curto que tenha significado e seja exclusivo para o sistema <acronym>XML</acronym>.

source: <replaceable>Language</replaceable>
pt_br: <replaceable>Idioma</replaceable>

source: An <acronym>ISO</acronym> two-character code that identifies the native language for the file. <literal>EN</literal> is used for English.
pt_br: Um código de dois caracteres <acronym>ISO</acronym> que identifica o idioma nativo do arquivo. <literal>EN</literal> é usado para o Inglês.

source: <filename>catalog</filename> Files
pt_br: Arquivos <filename>catalog</filename>

source: With the syntax above, an <acronym>XML</acronym> processor needs to have some way of turning the <acronym>FPI</acronym> into the name of the file containing the <acronym>DTD</acronym>. A catalog file (typically called <filename>catalog</filename>) contains lines that map <acronym>FPI</acronym>s to filenames. For example, if the catalog file contained the line:
pt_br: Com a sintaxe acima, um <acronym>XML</acronym> parser precisa ter alguma forma de transformar o <acronym>FPI</acronym> no nome do arquivo que contém o <acronym>DTD</acronym>. Um arquivo de catálogo (normalmente chamado de <filename>catalog</filename>) contém linhas que mapeiam <acronym>FPI</acronym>s para nomes de arquivos. Por exemplo, se o arquivo de catálogo continha a linha:

source: The <acronym>XML</acronym> processor knows that the <acronym>DTD</acronym> is called <filename>transitional.dtd</filename> in the <filename>1.0</filename> subdirectory of the directory that held <filename>catalog</filename>.
pt_br: O <acronym>XML</acronym> parser sabe que o <acronym>DTD</acronym> é chamado de <filename>transitional.dtd</filename> no subdiretório <filename>1.0</filename> do diretório que continha <filename>catalog</filename>.

source: Examine the contents of <filename>/usr/local/share/xml/dtd/xhtml/catalog.xml</filename>. This is the catalog file for the <acronym>XHTML</acronym> <acronym>DTD</acronym>s that were installed as part of the <package>textproc/docproj</package> port.
pt_br: Examine o conteúdo de <filename>/usr/local/share/xml/dtd/xhtml/catalog.xml</filename>. Este é o arquivo de catálogo dos <acronym>XHTML</acronym> <acronym>DTD</acronym> s que foram instalados como parte do port <package>textproc/docproj</package> .

source: Alternatives to <acronym>FPI</acronym>s
pt_br: Alternativas para <acronym>FPI</acronym> s

source: Instead of using an <acronym>FPI</acronym> to indicate the <acronym>DTD</acronym> to which the document conforms (and therefore, which file on the system contains the <acronym>DTD</acronym>), the filename can be explicitly specified.
pt_br: Em vez de usar uma <acronym>FPI</acronym> para indicar o <acronym>DTD</acronym> ao qual o documento está em conformidade (e, portanto, qual arquivo no sistema contém o <acronym>DTD</acronym>), o arquivo pode ser explicitamente especificado.

source: The syntax is slightly different:
pt_br: A sintaxe é um pouco diferente:

source: The <literal>SYSTEM</literal> keyword indicates that the <acronym>XML</acronym> processor should locate the <acronym>DTD</acronym> in a system specific fashion. This typically (but not always) means the <acronym>DTD</acronym> will be provided as a filename.
pt_br: A palavra-chave <literal>SYSTEM</literal> indica que o <acronym>XML</acronym> parser deve localizar o <acronym>DTD</acronym> de uma maneira específica no sistema. Isso normalmente (mas nem sempre) significa que o <acronym>DTD</acronym> será fornecido como um nome de arquivo.

source: Using <acronym>FPI</acronym>s is preferred for reasons of portability. If the <literal>SYSTEM</literal> identifier is used, then the <acronym>DTD</acronym> must be provided and kept in the same location for everyone.
pt_br: Usando <acronym>FPI</acronym>s é preferível por razões de portabilidade. Se o identificador <literal>SYSTEM</literal> for usado, então o <acronym>DTD</acronym> deve ser fornecido e mantido no mesmo local para todos.

source: Escaping Back to <acronym>XML</acronym>
pt_br: De Volta para o <acronym>XML</acronym>

source: Some of the underlying <acronym>XML</acronym> syntax can be useful within documents. For example, comments can be included in the document, and will be ignored by the parser. Comments are entered using <acronym>XML</acronym> syntax. Other uses for <acronym>XML</acronym> syntax will be shown later.
pt_br: Algumas das sintaxes subjacentes do <acronym>XML</acronym> podem ser úteis em documentos. Por exemplo, os comentários podem ser incluídos no documento e serão ignorados pelo parser. Os comentários são inseridos usando a sintaxe <acronym>XML</acronym>. Outros usos para a sintaxe <acronym>XML</acronym> serão mostrados mais tarde.

source: <acronym>XML</acronym> sections begin with a <literal>&lt;!</literal> tag and end with a <literal>&gt;</literal>. These sections contain instructions for the parser rather than elements of the document. Everything between these tags is <acronym>XML</acronym> syntax. The <link linkend="xml-primer-doctype-declaration">DOCTYPE declaration</link> shown earlier is an example of <acronym>XML</acronym> syntax included in the document.
pt_br: Seções <acronym>XML</acronym> começam com uma tag <literal>&lt;!</literal> e terminam com <literal>&gt;</literal>. Essas seções contêm instruções para o parser em vez de elementos do documento. Tudo entre essas tags são sintaxe <acronym>XML</acronym>. A declaração <link linkend="xml-primer-doctype-declaration">DOCTYPE</link> mostrada anteriormente é um exemplo da sintaxe <acronym>XML</acronym> incluída no documento.

source: Comments
pt_br: Comentários

source: An <acronym>XML</acronym> document may contain comments. They may appear anywhere as long as they are not inside tags. They are even allowed in some locations inside the <acronym>DTD</acronym> (e.g., between <link linkend="xml-primer-entities">entity declarations</link>).
pt_br: Um documento <acronym>XML</acronym> pode conter comentários. Eles podem aparecer em qualquer lugar, desde que não estejam dentro de tags. Eles até são permitidos em alguns locais dentro do <acronym>DTD</acronym> (por exemplo, entre <link linkend="xml-primer-entities">declarações de entidade</link>).

source: <acronym>XML</acronym> comments start with the string <quote><literal>&lt;!--</literal></quote> and end with the string <quote><literal>--&gt;</literal></quote>.
pt_br: Os comentários <acronym>XML</acronym> começam com a string <quote><literal>&lt;!--</literal></quote> e terminam com a string <quote><literal>--&gt;</literal></quote>.

source: Here are some examples of valid <acronym>XML</acronym> comments:
pt_br: Aqui estão alguns exemplos de comentários válidos de <acronym>XML</acronym>:

source: <acronym>XML</acronym> Generic Comments
pt_br: <acronym>XML</acronym> Comentários Genéricos

source: <acronym>XML</acronym> comments may contain any strings except <quote><literal>--</literal></quote>:
pt_br: Os comentários <acronym>XML</acronym> podem conter quaisquer strings, exceto <quote><literal>--</literal></quote>:

source: Erroneous <acronym>XML</acronym> Comment
pt_br: Comentário <acronym>XML</acronym> Incorreto

source: Add some comments to <filename>example.xml</filename>, and check that the file still validates using <command>xmllint</command>.
pt_br: Adicione alguns comentários ao arquivo <filename>example.xml</filename> e depois o valide utilizando o <command>xmllint</command>.

source: Add some invalid comments to <filename>example.xml</filename>, and see the error messages that <command>xmllint</command> gives when it encounters an invalid comment.
pt_br: Adicione alguns comentários inválidos ao arquivo <filename>example.xml</filename> e veja as mensagens de erros que o <command>xmllint</command> irá retornar quando encontrar algum comentário inválido.

source: Entities
pt_br: Entidades

source: Entities are a mechanism for assigning names to chunks of content. As an <acronym>XML</acronym> parser processes a document, any entities it finds are replaced by the content of the entity.
pt_br: Entidades são um mecanismo para atribuir nomes a partes do conteúdo. À medida que um <acronym>XML</acronym> parser processa um documento, qualquer entidade encontrada é substituída pelo conteúdo da entidade.

source: This is a good way to have re-usable, easily changeable chunks of content in <acronym>XML</acronym> documents. It is also the only way to include one marked up file inside another using <acronym>XML</acronym>.
pt_br: Esta é uma boa maneira de ter pedaços de conteúdo reutilizáveis ​​e facilmente alteráveis ​​em documentos <acronym>XML</acronym>. Também é a única maneira de incluir um arquivo markup dentro de outro usando <acronym>XML</acronym>.

source: There are two types of entities for two different situations: <emphasis>general entities</emphasis> and <emphasis>parameter entities</emphasis>.
pt_br: Existem dois tipos de entidades para duas situações diferentes: <emphasis>entidades gerais</emphasis> e <emphasis>entidades de parâmetros</emphasis>.

source: General Entities
pt_br: Entidades Gerais

source: General entities are used to assign names to reusable chunks of text. These entities can only be used in the document. They cannot be used in an <acronym>XML</acronym> context.
pt_br: Entidades gerais são usadas para atribuir nomes a partes reutilizáveis ​​de texto. Essas entidades só podem ser usadas no documento. Elas não podem ser usadas ​​em um contexto <acronym>XML</acronym>.

source: To include the text of a general entity in the document, include <literal>&amp;<replaceable>entity-name</replaceable>;</literal> in the text. For example, consider a general entity called <literal>current.version</literal> which expands to the current version number of a product. To use it in the document, write:
pt_br: Para incluir o texto de uma entidade geral no documento, inclua <literal>&amp;<replaceable>nome-da-entidade</replaceable>;</literal> no texto. Por exemplo, considere uma entidade geral chamada <literal>current.version</literal>, que se expande para o número da versão atual de um produto. Para usá-la no documento, escreva:

source: When the version number changes, edit the definition of the general entity, replacing the value. Then reprocess the document.
pt_br: Quando o número da versão for alterado, edite a definição da entidade geral, substituindo o valor. Em seguida, reprocesse o documento.

source: General entities can also be used to enter characters that could not otherwise be included in an <acronym>XML</acronym> document. For example, <literal>&lt;</literal> and <literal>&amp;</literal> cannot normally appear in an <acronym>XML</acronym> document. The <acronym>XML</acronym> parser sees the <literal>&lt;</literal> symbol as the start of a tag. Likewise, when the <literal>&amp;</literal> symbol is seen, the next text is expected to be an entity name.
pt_br: Entidades gerais também podem ser usadas para inserir caracteres que não poderiam ser incluídos em um documento <acronym>XML</acronym>. Por exemplo, <literal>&lt;</literal> e <literal>&amp;</literal> normalmente não podem aparecer em um documento <acronym>XML</acronym>. O <acronym>XML</acronym> parser vê o símbolo <literal>&lt;</literal> como o início de uma tag. Da mesma forma, quando o símbolo <literal>&amp;</literal> é visto, espera-se que o próximo texto seja um nome de entidade.

source: These symbols can be included by using two predefined general entities: <literal>&amp;lt;</literal> and <literal>&amp;amp;</literal>.
pt_br: Esses símbolos podem ser incluídos usando duas entidades gerais predefinidas: <literal>&amp;lt;</literal> e <literal>&amp;amp;</literal>.

source: General entities can only be defined within an <acronym>XML</acronym> context. Such definitions are usually done immediately after the DOCTYPE declaration.
pt_br: Entidades gerais só podem ser definidas dentro de um contexto <acronym>XML</acronym>. Tais definições geralmente são feitas imediatamente após a declaração DOCTYPE.

source: Defining General Entities
pt_br: Definindo Entidades Gerais

source: The DOCTYPE declaration has been extended by adding a square bracket at the end of the first line. The two entities are then defined over the next two lines, the square bracket is closed, and then the DOCTYPE declaration is closed.
pt_br: A declaração DOCTYPE foi estendida adicionando um colchete no final da primeira linha. As duas entidades são então definidas nas próximas duas linhas, o colchete é fechado e, em seguida, a declaração DOCTYPE é fechada.

source: The square brackets are necessary to indicate that the DTD indicated by the DOCTYPE declaration is being extended.
pt_br: Os colchetes são necessários para indicar que o DTD indicado pela declaração DOCTYPE está sendo estendido.

source: Parameter Entities
pt_br: Entidades de Parâmetro

source: Parameter entities, like <link linkend="xml-primer-general-entities">general entities</link>, are used to assign names to reusable chunks of text. But parameter entities can only be used within an <link linkend="xml-primer-xml-escape">XML context</link>.
pt_br: Entidades de parâmetro, como as <link linkend="xml-primer-general-entities">entidades gerais</link>, são usadas para atribuir nomes a blocos reutilizáveis ​​de texto. Mas as entidades de parâmetro só podem ser usadas dentro de um <link linkend="xml-primer-xml-escape">contexto XML</link>.

source: Parameter entity definitions are similar to those for general entities. However, parameter entities are included with <literal>%<replaceable>entity-name</replaceable>;</literal>. The definition also includes the <literal>%</literal> between the <literal>ENTITY</literal> keyword and the name of the entity.
pt_br: As definições de entidade de parâmetro são semelhantes àquelas para entidades gerais. No entanto, entradas de parâmetros são incluídas com <literal>%<replaceable>nome-da-entidade</replaceable>;</literal>. A definição também inclui o <literal>%</literal> entre a palavra-chave <literal>ENTITY</literal> e o nome da entidade.

source: For a mnemonic, think <quote><emphasis>P</emphasis>arameter entities use the <emphasis>P</emphasis>ercent symbol</quote>.
pt_br: Para memorizar, lembre que entidade de<quote><emphasis>P</emphasis>arâmetro utiliza o símbolo de <emphasis>P</emphasis>orcentagem</quote>.

source: Defining Parameter Entities
pt_br: Definindo Entidades de Parâmetro

source: At first sight, parameter entities do not look very useful, but they make it possible to <link linkend="xml-primer-include">include other files</link> into an XML document.
pt_br: À primeira vista, as entidades de parâmetros não parecem muito úteis, mas elas tornam possível <link linkend="xml-primer-include">incluir outros arquivos </link> em um documento XML.

source: Add a general entity to <filename>example.xml</filename>.
pt_br: Adicione uma entidade geral ao arquivo <filename>example.xml</filename>.

source: Validate the document using <command>xmllint</command>.
pt_br: Valide o documento usando o <command>xmllint</command>.

source: Load <filename>example.xml</filename> into a web browser. It may have to be copied to <filename>example.html</filename> before the browser recognizes it as an <acronym>XHTML</acronym> document.
pt_br: Carregue <filename>example.xml</filename> em um navegador web. Ele pode ter que ser copiado para o <filename>example.html</filename> antes que o navegador o reconheça como um documento <acronym>XHTML</acronym>.

source: Older browsers with simple parsers may not render this file as expected. The entity reference <literal>&amp;version;</literal> may not be replaced by the version number, or the <acronym>XML</acronym> context closing <literal>]&gt;</literal> may not be recognized and instead shown in the output.
pt_br: Navegadores mais antigos com parsers simples podem não renderizar esse arquivo conforme o esperado. A referência de entidade <literal>&amp;version;</literal> pode não ser substituída pelo número da versão, ou o fechamento de contexto <acronym>XML</acronym> <literal>]&gt;</literal> pode não ser reconhecido e em vez disso, apresentado literalmente.

source: The solution is to <emphasis>normalize</emphasis> the document with an <acronym>XML</acronym> normalizer. The normalizer reads valid <acronym>XML</acronym> and writes equally valid <acronym>XML</acronym> which has been transformed in some way. One way the normalizer transforms the input is by expanding all the entity references in the document, replacing the entities with the text that they represent.
pt_br: A solução é <emphasis>normalizar</emphasis> o documento com um normalizador <acronym>XML</acronym>. O normalizador lê um <acronym>XML</acronym> válido e grava outro <acronym>XML</acronym> igualmente válido. Uma maneira pela qual o normalizador transforma a entrada é expandindo todas as referências de entidade no documento, substituindo as entidades pelo texto que elas representam.

source: <command>xmllint</command> can be used for this. It also has an option to drop the initial <acronym>DTD</acronym> section so that the closing <literal>]&gt;</literal> does not confuse browsers:
pt_br: O <command>xmllint</command> pode ser usado para isso. Ele também tem a opção de remover a seção inicial <acronym>DTD</acronym> para que <literal>]&gt;</literal> não confunda os navegadores:

source: A normalized copy of the document with entities expanded is produced in <filename>example.html</filename>, ready to load into a web browser.
pt_br: Uma cópia normalizada do documento com entidades expandidas é produzida em <filename>example.html</filename>, pronta para ser carregada em um navegador web.

source: Using Entities to Include Files
pt_br: Usando Entidades para Incluir Arquivos

source: Both <link linkend="xml-primer-general-entities">general</link> and <link linkend="xml-primer-parameter-entities">parameter</link> entities are particularly useful for including one file inside another.
pt_br: Ambas as entidades <link linkend="xml-primer-general-entities">geral</link> e <link linkend="xml-primer-parameter-entities">parâmetro</link> são particularmente úteis para incluir um arquivo dentro de outro .

source: Using General Entities to Include Files
pt_br: Usando Entidades Gerais para Incluir Arquivos

source: Consider some content for an <acronym>XML</acronym> book organized into files, one file per chapter, called <filename>chapter1.xml</filename>, <filename>chapter2.xml</filename>, and so forth, with a <filename>book.xml</filename> that will contain these chapters.
pt_br: Considere algum conteúdo para um livro <acronym>XML</acronym> organizado em arquivos, um arquivo por capítulo, chamado <filename>chapter1.xml</filename>, <filename>chapter2.xml</filename> e assim por diante, com um <filename>book.xml</filename> que conterá esses capítulos.

source: In order to use the contents of these files as the values for entities, they are declared with the <literal>SYSTEM</literal> keyword. This directs the <acronym>XML</acronym> parser to include the contents of the named file as the value of the entity.
pt_br: Para usar o conteúdo desses arquivos como valores para entidades, eles são declarados com a palavra-chave <literal>SYSTEM</literal>. Isso direciona o <acronym>XML</acronym> parser a incluir o conteúdo do arquivo nomeado como o valor da entidade.

source: When using general entities to include other files within a document, the files being included (<filename>chapter1.xml</filename>, <filename>chapter2.xml</filename>, and so on) <emphasis>must not</emphasis> start with a DOCTYPE declaration. This is a syntax error because entities are low-level constructs and they are resolved before any parsing happens.
pt_br: Ao usar entidades gerais para incluir outros arquivos em um documento, os arquivos que estão sendo incluídos (<filename> chapter1.xml</filename>, <filename>chapter2.xml</filename> e assim por diante)<emphasis> não devem </emphasis>começar com uma declaração DOCTYPE. Este é um erro de sintaxe porque as entidades são constructors de baixo nível e são transformadas antes que qualquer análise ocorra.

source: Using Parameter Entities to Include Files
pt_br: Usando Entidades de Parâmetro para Incluir Arquivos

source: Parameter entities can only be used inside an <acronym>XML</acronym> context. Including a file in an <acronym>XML</acronym> context can be used to ensure that general entities are reusable.
pt_br: As entidades de parâmetro só podem ser usadas dentro de um contexto <acronym>XML</acronym>. A inclusão de um arquivo em um contexto <acronym>XML</acronym> pode ser usada para garantir que as entidades gerais sejam reutilizáveis.

source: Suppose that there are many chapters in the document, and these chapters were reused in two different books, each book organizing the chapters in a different fashion.
pt_br: Suponha que haja muitos capítulos no documento, e esses capítulos foram reutilizados em dois livros diferentes, cada livro organizando os capítulos de maneira diferente.
