Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: The <link xlink:href="@@URL_RELPREFIX@@/docs.html">FreeBSD tutorials</link> are all marked up as articles, while this document, the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html">FAQ</link>, and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Handbook</link> are all marked up as books, for example.
pt_br: Os <link xlink:href="@@URL_RELPREFIX@@/docs.html">Tutoriais do FreeBSD</link> estão todos marcados como artigos, enquanto este documento, o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html">FAQ</link> e o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html">Handbook</link> estão todos marcados como livros, por exemplo.

source: Starting a Book
pt_br: Iniciando um Livro

source: The content of a book is contained within the <tag>book</tag> element. As well as containing structural markup, this element can contain elements that include additional information about the book. This is either meta-information, used for reference purposes, or additional content used to produce a title page.
pt_br: O conteúdo de um livro está dentro do elemento <tag>book</tag>. Além de conter marcação estrutural, esse elemento pode conter elementos que incluem informações adicionais sobre o livro. Isso é uma meta-informação, usada para fins de referência ou conteúdo adicional usado para produzir um título de página.

source: This additional information is contained within <tag>info</tag>.
pt_br: Esta informação adicional está em um elemento <tag>info</tag>.

source: Boilerplate <tag>book</tag> with <tag>info</tag>
pt_br: Exemplo de <tag>book</tag> com <tag>info</tag>

source: Starting an Article
pt_br: Iniciando um Artigo

source: The content of the article is contained within the <tag>article</tag> element. As well as containing structural markup, this element can contain elements that include additional information about the article. This is either meta-information, used for reference purposes, or additional content used to produce a title page.
pt_br: O conteúdo do artigo está dentro do elemento <tag>article</tag>. Além de conter marcação estrutural, esse elemento pode conter elementos que incluem informações adicionais sobre o artigo. Isso é uma meta-informação, usada para fins de referência ou conteúdo adicional usado para produzir um título de página.

source: Boilerplate <tag>article</tag> with <tag>info</tag>
pt_br: Exemplo de <tag>article</tag> com <tag>info</tag>

source: Indicating Chapters
pt_br: Criando Capítulos

source: Use <tag>chapter</tag> to mark up your chapters. Each chapter has a mandatory <tag>title</tag>. Articles do not contain chapters, they are reserved for books.
pt_br: Use <tag>chapter</tag> para marcar seus capítulos. Cada capítulo tem um <tag>title</tag> obrigatório. Os artigos não contêm capítulos, eles são reservados para livros.

source: A Simple Chapter
pt_br: Um Capítulo Simples

source: A chapter cannot be empty; it must contain elements in addition to <tag>title</tag>. If you need to include an empty chapter then just use an empty paragraph.
pt_br: Um capítulo não pode estar vazio; ele deve conter elementos além do <tag>title</tag>. Se você precisar incluir um capítulo vazio, basta usar um parágrafo vazio.

source: Empty Chapters
pt_br: Capítulos Vazios

source: Sections Below Chapters
pt_br: Seções Abaixo dos Capítulos

source: In books, chapters may (but do not need to) be broken up into sections, subsections, and so on. In articles, sections are the main structural element, and each article must contain at least one section. Use the <tag>sect<replaceable>n</replaceable></tag> element. The <replaceable>n</replaceable> indicates the section number, which identifies the section level.
pt_br: Nos livros, os capítulos podem (mas não precisam) ser divididos em seções, subseções e assim por diante. Nos artigos, as seções são o principal elemento estrutural e cada artigo deve conter pelo menos uma seção. Use o elemento <tag>sect<replaceable>n</replaceable></tag>. O <replaceable>n</replaceable> indica o número da seção, que identifica o nível da seção.

source: The first <tag>sect<replaceable>n</replaceable></tag> is <tag>sect1</tag>. You can have one or more of these in a chapter. They can contain one or more <tag>sect2</tag> elements, and so on, down to <tag>sect5</tag>.
pt_br: A primeira <tag>sect<replaceable>n</replaceable></tag> é <tag>sect1</tag>. Você pode ter um ou mais destes em um capítulo. Eles podem conter um ou mais elementos <tag>sect2</tag> e assim por diante, até <tag>sect5</tag>.

source: Sections in Chapters
pt_br: Seções em Capítulos

source: Section numbers are automatically generated and prepended to titles when the document is rendered to an output format. The generated section numbers and titles from the example above will be:
pt_br: Os números de seção são gerados automaticamente e anexados aos títulos quando o documento é renderizado em um formato de saída. Os números de seção e títulos gerados a partir do exemplo acima serão:

source: Subdividing Using <tag>part</tag> Elements
pt_br: Subdividindo Utilizando Elementos <tag>part</tag>

source: <tag>part</tag>s introduce another level of organization between <tag>book</tag> and <tag>chapter</tag> with one or more <tag>part</tag>s. This cannot be done in an <tag>article</tag>.
pt_br: <tag>part</tag>es adiciona outro nível de organização entre <tag>book</tag> e <tag>chapter</tag> com uma ou mais <tag>part</tag>es. Isso não pode ser utilizado em um <tag>article</tag>.

source: DocBook supports three types of paragraphs: <tag>formalpara</tag>, <tag>para</tag>, and <tag>simpara</tag>.
pt_br: O DocBook suporta três tipos de parágrafos: <tag>formalpara</tag>, <tag>para</tag> e <tag>simpara</tag>.

source: Almost all paragraphs in FreeBSD documentation use <tag>para</tag>. <tag>formalpara</tag> includes a <tag>title</tag> element, and <tag>simpara</tag> disallows some elements from within <tag>para</tag>. Stick with <tag>para</tag>.
pt_br: Quase todos os parágrafos da documentação do FreeBSD usam <tag>para</tag>. <tag>formalpara</tag> inclui um elemento <tag>title</tag>, e <tag>simpara</tag> desabilita alguns elementos de um <tag>para</tag>. Utilize mais o <tag> para </tag>.

source: <tag>para</tag> Example
pt_br: Exemplo de um <tag>para</tag>

source: Appearance:
pt_br: Aparência:

source: A block quotation is an extended quotation from another document that should not appear within the current paragraph. These are rarely needed.
pt_br: Uma cotação em bloco é uma cotação estendida de outro documento que não deve aparecer no parágrafo atual. Estes raramente são necessários.

source: Blockquotes can optionally contain a title and an attribution (or they can be left untitled and unattributed).
pt_br: Os blockquotes podem, opcionalmente, conter um título e uma atribuição (ou podem ser deixados sem título e sem atribuição).

source: Copied from a web site somewhere
pt_br: Copiado de um site qualquer

source: Tips, Notes, Warnings, Cautions, and Important Information
pt_br: Dicas, Notas, Avisos, Cuidados e Informações Importantes

source: Extra information may need to be separated from the main body of the text. Typically this is <quote>meta</quote> information of which the user should be aware.
pt_br: Informações adicionais podem precisar ser separadas do texto principal. Normalmente, essa é a informação <quote>meta</quote> da qual o usuário deve estar ciente.

source: Several types of admonitions are available: <tag>tip</tag>, <tag>note</tag>, <tag>warning</tag>, <tag>caution</tag>, and <tag>important</tag>.
pt_br: Vários tipos de informações estão disponíveis: <tag>tip</tag>, <tag>note</tag>, <tag>warning</tag>, <tag>caution</tag>, e <tag>important</tag>.

source: Which admonition to choose depends on the situation. The DocBook documentation suggests:
pt_br: O tipo a ser escolhido depende da situação. A documentação do DocBook sugere:

source: Note is for information that should be heeded by all readers.
pt_br: A nota é para informações onde todos os leitores devem prestar atenção.

source: Important is a variation on Note.
pt_br: Importante é uma variação de Nota.

source: Caution is for information regarding possible data loss or software damage.
pt_br: Cuidado é para informações sobre possíveis perdas de dados ou danos ao software.

source: Warning is for information regarding possible hardware damage or injury to life or limb.
pt_br: Aviso é para informações sobre possíveis danos ao hardware, sobre risco de vida ou de ferimento a um membro.

source: <tag>tip</tag> and <tag>important</tag> Example
pt_br: Example de <tag>tip</tag> e <tag>important</tag>

source: Examples can be shown with <tag>example</tag>.
pt_br: Exemplos podem ser apresentados com <tag>example</tag>.

source: <tag>example</tag> Source
pt_br: <tag>example</tag>

source: Rendered <tag>example</tag>
pt_br: <tag>example</tag> Renderizado

source: Lists and Procedures
pt_br: Listas e Procedimentos

source: Information often needs to be presented as lists, or as a number of steps that must be carried out in order to accomplish a particular goal.
pt_br: Muitas vezes, as informações precisam ser apresentadas como listas ou como uma série de etapas que devem ser realizadas para atingir um objetivo específico.

source: To do this, use <tag>itemizedlist</tag>, <tag>orderedlist</tag>, <tag>variablelist</tag>, or <tag>procedure</tag>. There are other types of list elements in DocBook, but we will not cover them here.
pt_br: Para fazer isso, utilize <tag>itemizedlist</tag>, <tag>orderedlist</tag>, <tag>variablelist</tag> ou <tag>procedure</tag>. Existem outros tipos de elementos de lista no DocBook, mas não os cobriremos aqui.

source: <tag>itemizedlist</tag> and <tag>orderedlist</tag> are similar to their counterparts in <acronym>HTML</acronym>, <tag>ul</tag> and <tag>ol</tag>. Each one consists of one or more <tag>listitem</tag> elements, and each <tag>listitem</tag> contains one or more block elements. The <tag>listitem</tag> elements are analogous to <acronym>HTML</acronym>'s <tag>li</tag> tags. However, unlike HTML, they are required.
pt_br: <tag>itemizedlist</tag> e <tag>orderedlist</tag> são semelhantes às suas contrapartes em <acronym>HTML</acronym>, <tag>ul</tag> e <tag>ol</tag>. Cada um consiste em um ou mais elementos <tag>listitem</tag>, e cada <tag>listitem</tag> contém um ou mais elementos de bloco. Os elementos <tag>listitem</tag> são análogos às tags <tag>li</tag> do <acronym>HTML</acronym>. No entanto, ao contrário do HTML, eles são obrigatórios.

source: <tag>itemizedlist</tag> and <tag>orderedlist</tag> Example
pt_br: Exemplo de <tag>itemizedlist</tag> e <tag>orderedlist</tag>

source: An alternate and often useful way of presenting information is the <tag>variablelist</tag>. These are lists where each entry has a term and a description. They are well suited for many types of descriptions, and present information in a form that is often easier for the reader than sections and subsections.
pt_br: Uma maneira alternativa e frequentemente útil de apresentar informações é a <tag>variablelist</tag>. Estas são listas onde cada entrada tem um termo e uma descrição. Eles são adequados para muitos tipos de descrições e apresentam informações de uma forma que geralmente é mais fácil para o leitor do que seções e subseções.

source: A <tag>variablelist</tag> has a <tag>title</tag>, and then pairs of <tag>term</tag> and <tag>listitem</tag> entries.
pt_br: Uma <tag>variablelist</tag> tem um <tag>title</tag> e, em seguida, pares de entradas <tag>term</tag> e <tag>listitem</tag>.

source: <tag>variablelist</tag> Example
pt_br: Exemplo<tag>variablelist</tag>

source: A <tag>procedure</tag> shows a series of <tag>step</tag>s, which may in turn consist of more <tag>step</tag>s or <tag>substep</tag>s. Each <tag>step</tag> contains block elements and may include an optional title.
pt_br: Um <tag>procedure</tag> mostra uma série de <tag>step</tag>s, que por sua vez consistem em mais <tag>step</tag>s ou <tag>substep</tag>s. Cada <tag>step</tag> contém elementos de bloco e pode incluir um título opcional.

source: Sometimes, steps are not sequential, but present a choice: do <emphasis>this</emphasis> or do <emphasis>that</emphasis>, but not both. For these alternative choices, use <tag>stepalternatives</tag>.
pt_br: Às vezes, os passos não são sequenciais, mas apresentam uma escolha: fazer <emphasis>isso</emphasis> ou fazer <emphasis>aquilo</emphasis>, mas não ambos. Para essas escolhas alternativas, use <tag>stepalternatives</tag>.

source: <tag>procedure</tag> Example
pt_br: Exemplo <tag>procedure</tag>

source: Showing File Samples
pt_br: Mostrando Exemplos de Arquivos

source: Fragments of a file (or perhaps a complete file) are shown by wrapping them in the <tag>programlisting</tag> element.
pt_br: Fragmentos de um arquivo (ou talvez um arquivo completo) são mostrados agrupando-os no elemento <tag>programlisting</tag>.

source: White space and line breaks within <tag>programlisting</tag> <emphasis>are</emphasis> significant. In particular, this means that the opening tag should appear on the same line as the first line of the output, and the closing tag should appear on the same line as the last line of the output, otherwise spurious blank lines may be included.
pt_br: Espaço em branco e quebra de linha dentro de <tag>programlisting</tag> <emphasis>são</emphasis> importantes. Em particular, isso significa que a tag de abertura deve aparecer na mesma linha que a primeira linha da saída, e a tag de fechamento deve aparecer na mesma linha da última linha da saída, caso contrário linhas vazias podem ser incluídas.

source: <tag>programlisting</tag> Example
pt_br: Exemplo <tag>programlisting</tag>

source: Notice how the angle brackets in the <literal>#include</literal> line need to be referenced by their entities instead of being included literally.
pt_br: Observe como os colchetes angulares na linha <literal>#include</literal> precisam ser referenciados por suas entidades, em vez de serem incluídos literalmente.

source: Callouts
pt_br: Chamadas

source: A callout is a visual marker for referring to a piece of text or specific position within an example.
pt_br: Uma chamada é um marcador visual para se referenciar a um texto ou a uma posição específica em um exemplo.

source: Callouts are marked with the <tag>co</tag> element. Each element must have a unique <literal>id</literal> assigned to it. After the example, include a <tag>calloutlist</tag> that describes each callout.
pt_br: As chamadas são marcadas com o elemento <tag>co</tag>. Cada elemento deve ter um <literal>id</literal> único atribuído a ele. Após o exemplo, inclua uma <tag>calloutlist</tag> que descreve cada frase de destaque.

source: <tag>co</tag> and <tag>calloutlist</tag> Example
pt_br: Exemplo <tag>co</tag> e <tag>calloutlist</tag>

source: Unlike <acronym>HTML</acronym>, DocBook does not need tables for layout purposes, as the stylesheet handles those issues. Instead, just use tables for marking up tabular data.
pt_br: Ao contrário de <acronym>HTML</acronym>, o DocBook não precisa de tabelas para fins de layout, já que a folha de estilo lida com esses problemas. Em vez disso, basta usar tabelas para marcar dados tabulares.

source: In general terms (and see the DocBook documentation for more detail) a table (which can be either formal or informal) consists of a <tag>table</tag> element. This contains at least one <tag>tgroup</tag> element, which specifies (as an attribute) the number of columns in this table group. Within the tablegroup there is one <tag>thead</tag> element, which contains elements for the table headings (column headings), and one <tag>tbody</tag> which contains the body of the table.
pt_br: Em termos gerais (e veja a documentação do DocBook para mais detalhes), uma tabela (que pode ser formal ou informal) consiste em um elemento <tag>table</tag>. Este contém pelo menos um elemento <tag>tgroup</tag>, que especifica (como um atributo) o número de colunas neste grupo de tabelas. Dentro do tgroup há um elemento <tag>thead</tag>, que contém elementos para os títulos da tabela (cabeçalhos da coluna), e um <tag>tbody</tag> que contém o corpo da tabela.

source: Both <tag>tgroup</tag> and <tag>thead</tag> contain <tag>row</tag> elements, which in turn contain <tag>entry</tag> elements. Each <tag>entry</tag> element specifies one cell in the table.
pt_br: Ambos <tag>tgroup</tag> e <tag>thead</tag> contêm elementos <tag>row</tag>, que por sua vez contêm elementos <tag>entry</tag>. Cada elemento <tag>entry</tag> especifica uma célula na tabela.

source: <tag>informaltable</tag> Example
pt_br: Exemplo <tag>informaltable</tag>

source: Always use the <literal>pgwide</literal> attribute with a value of <literal>1</literal> with the <tag>informaltable</tag> element. A bug in Internet Explorer can cause the table to render incorrectly if this is omitted.
pt_br: Sempre use o atributo <literal>pgwide</literal> com um valor <literal>1</literal> com o elemento <tag>informaltable</tag>. Um erro no Internet Explorer pode fazer com que a tabela seja renderizada incorretamente se isso for omitido.

source: Table borders can be suppressed by setting the <literal>frame</literal> attribute to <literal>none</literal> in the <tag>informaltable</tag> element. For example, <literal>informaltable frame="none"</literal>.
pt_br: As bordas da tabela podem ser escondidas configurando o atributo <literal>frame</literal> para <literal>none</literal> no elemento <tag>informaltable</tag>. Por exemplo, <literal>informaltable frame="none"</literal>.

source: Table with <literal>frame="none"</literal> Example
pt_br: Exemplo de Tabela com <literal>frame="none"</literal>

source: Examples for the User to Follow
pt_br: Exemplos para o Usuário Seguir

source: Examples for the user to follow are often necessary. Typically, these will consist of dialogs with the computer; the user types in a command, the user gets a response back, the user types another command, and so on.
pt_br: Exemplos para o usuário seguir são freqüentemente necessários. Normalmente, eles consistem em diálogos com o computador; o usuário digita um comando, o usuário recebe uma resposta de volta, o usuário digita outro comando e assim por diante.

source: A number of distinct elements and entities come into play here.
pt_br: Vários elementos e entidades podem ser utilizados nestes casos.

source: Everything the user sees in this example will be on the computer screen, so the next element is <tag>screen</tag>.
pt_br: Tudo o que o usuário vê neste exemplo estará na tela do computador, então o próximo elemento é <tag> screen </tag>.

source: Within <tag>screen</tag>, white space is significant.
pt_br: Dentro da <tag>screen</tag>, o espaço em branco é significativo.

source: Some of the things the user will be seeing on the screen are prompts from the computer (either from the operating system, command shell, or application). These should be marked up using <tag>prompt</tag>.
pt_br: Algumas das coisas que o usuário irá visualizar na tela são prompts do computador (seja do sistema operacional, da linha de comando shell ou de uma aplicação). Estes prompts devem ser marcados usando <tag>prompt</tag>.

source: As a special case, the two shell prompts for the normal user and the root user have been provided as entities. To indicate the user is at a shell prompt, use one of <literal>&amp;prompt.root;</literal> and <literal>&amp;prompt.user;</literal> as necessary. They do not need to be inside <tag>prompt</tag>.
pt_br: Por serem especiais, os prompts de shell do usuário normal e do usuário root estão disponíveis como uma entidade. Sempre que quiser indicar que o usuário está em um prompt do shell, use <literal>&amp;prompt.root;</literal> para o usuário root e <literal>&amp;prompt.user;</literal> para o usuário normal, conforme for necessário. Estas entidades não precisam estar dentro de um <tag>prompt</tag>.

source: <literal>&amp;prompt.root;</literal> and <literal>&amp;prompt.user;</literal> are FreeBSD extensions to DocBook, and are not part of the original <acronym>DTD</acronym>.
pt_br: <literal>&amp;prompt.root;</literal> e <literal>&amp;prompt.user;</literal> são extensões do FreeBSD ao DocBook e não são parte do <acronym>DTD</acronym> original.

source: When displaying text that the user should type in, wrap it in <tag>userinput</tag> tags. It will be displayed differently than system output text.
pt_br: Ao exibir o texto que o usuário deve digitar, coloque-o nas tags <tag>userinput</tag>. Ele provavelmente será mostrado diferente para o usuário.

source: <tag>screen</tag>, <tag>prompt</tag>, and <tag>userinput</tag> Example
pt_br: Exemplos <tag>screen</tag>, <tag>prompt</tag>, e <tag>userinput</tag>

source: Even though we are displaying the contents of the file <filename>foo2</filename>, it is <emphasis>not</emphasis> marked up as <tag>programlisting</tag>. Reserve <tag>programlisting</tag> for showing fragments of files outside the context of user actions.
pt_br: Ainda que estejamos mostrando o conteúdo do arquivo <filename>foo2</filename>, ele <emphasis>não</emphasis> está marcado como <tag>programlisting</tag>. Deixe o <tag>programlisting</tag> para mostrar fragmentos de arquivos fora do contexto de ações do usuário.

source: To emphasize a particular word or phrase, use <tag>emphasis</tag>. This may be presented as italic, or bold, or might be spoken differently with a text-to-speech system.
pt_br: Para enfatizar uma palavra ou frase em particular, use <tag>emphasis</tag>. Isso pode ser apresentado em itálico ou negrito, ou pode ser falado diferentemente com um sistema de conversão de texto em fala.

source: There is no way to change the presentation of the emphasis within the document, no equivalent of <acronym>HTML</acronym>'s <tag>b</tag> and <tag>i</tag>. If the information being presented is important, then consider presenting it in <tag>important</tag> rather than <tag>emphasis</tag>.
pt_br: Não há uma maneira de mudar a apresentação da ênfase no documento, não existe um equivalente a <tag>b</tag> e <tag>i</tag> do <acronym>HTML</acronym> . Se as informações apresentadas forem importantes, considere apresentá-las em <tag>important</tag> em vez de <tag>emphasis</tag>.

source: <tag>emphasis</tag> Example
pt_br: Exemplo de <tag>emphasis</tag>

source: Acronyms
pt_br: Siglas

source: Many computer terms are <emphasis>acronyms</emphasis>, words formed from the first letter of each word in a phrase. Acronyms are marked up into <tag>acronym</tag> elements. It is helpful to the reader when an acronym is defined on the first use, as shown in the example below.
pt_br: Muitos termos de computador são <emphasis>siglas</emphasis>, palavras formadas a partir da primeira letra de cada palavra em uma frase. Os acrônimos são marcados com elementos <tag>acronym</tag>. É útil para o leitor quando um acrônimo é definido no primeiro uso, como mostrado no exemplo abaixo.

source: <tag>acronym</tag> Example
pt_br: Exemplo <tag>acronym</tag>

source: Quotations
pt_br: Citações

source: To quote text from another document or source, or to denote a phrase that is used figuratively, use <tag>quote</tag>. Most of the markup tags available for normal text are also available from within a <tag>quote</tag>.
pt_br: Para citar texto de outro documento ou fonte, ou para denotar uma frase que é usada de forma figurada, use <tag>quote</tag>. A maioria das tags de marcação disponíveis para texto normal também está disponível em <tag>quote</tag>.

source: <tag>quote</tag> Example
pt_br: Exemplo <tag>quote</tag>

source: Keys, Mouse Buttons, and Combinations
pt_br: Teclas, Botões do Mouse e Combinações
