Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: Now the document structure is ready for the translator to begin translating with <command>make po</command>.
pt_br: Agora a estrutura do documento está pronta para o tradutor começar a tradução com <command>make po</command>.

source: Creating a French Translation of the <acronym>PGP</acronym> Keys Article
pt_br: Criando uma tradução em Francês do Artigo Chaves Open <acronym>PGP</acronym>

source: Create a new French translation of the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pgpkeys"><acronym>PGP</acronym> Keys article</link>. The original is an article in <filename>~/doc/en_US.ISO8859-1/articles/pgpkeys/</filename>.
pt_br: Crie uma nova tradução em Francês do <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pgpkeys">artigo Chaves Open <acronym>PGP</acronym></link>. O original é um artigo em <filename>~/doc/en_US.ISO8859-1/articles/pgpkeys/</filename>.

source: The French language article directory <filename>~/doc/fr_FR.ISO8859-1/articles/</filename> already exists, so only a new subdirectory for the <acronym>PGP</acronym> Keys article is needed:
pt_br: O diretório de artigos em Francês <filename>~/doc/fr_FR.ISO8859-1/articles/</filename> já existe, portanto, apenas um novo subdiretório para o artigo Chaves Open <acronym>PGP</acronym> é necessário:

source: Copy the <filename>Makefile</filename> from the original article:
pt_br: Copie o <filename>Makefile</filename> do artigo original:

source: Check the contents of the <filename>Makefile</filename>. Because this is a simple article, in this case the <filename>Makefile</filename> can be used unchanged. The <literal>$FreeBSD...$</literal> version string on the second line will be replaced by the version control system when this file is committed.
pt_br: Verifique o conteúdo do <filename>Makefile</filename>. Este é um artigo simples e neste caso, o <filename>Makefile</filename> pode ser usado sem altaração. A string <literal>$FreeBSD...$</literal> na segunda linha será substituída pelo sistema de controle de versão quando este arquivo sofrer um commit.

source: With the document structure complete, the <acronym>PO</acronym> file can be created with <command>make po</command>.
pt_br: Com a estrutura do documento completa, o arquivo <acronym>PO</acronym> pode ser criado com <command>make po</command>.

source: Translating
pt_br: Traduzindo

source: The <application>gettext</application> system greatly reduces the number of things that must be tracked by a translator. Strings to be translated are extracted from the original document into a <acronym>PO</acronym> file. Then a <acronym>PO</acronym> editor is used to enter the translated versions of each string.
pt_br: O sistema <application>gettext</application> reduz bastante o número de itens que devem ser rastreados por um tradutor. As strings a serem traduzidas são extraídas do documento original em um arquivo <acronym>PO</acronym>. Em seguida, um editor <acronym>PO</acronym> é usado para inserir as traduções de cada string.

source: The FreeBSD <acronym>PO</acronym> translation system does not overwrite <acronym>PO</acronym> files, so the extraction step can be run at any time to update the <acronym>PO</acronym> file.
pt_br: O sistema de tradução <acronym>PO</acronym> do FreeBSD não sobrescreve os arquivos <acronym>PO</acronym>, portanto a etapa de extração pode ser executada a qualquer momento para atualizar o arquivo <acronym>PO</acronym>.

source: A <acronym>PO</acronym> editor is used to edit the file. <package role="port">editors/poedit</package> is shown in these examples because it is simple and has minimal requirements. Other <acronym>PO</acronym> editors offer features to make the job of translating easier. The Ports Collection offers several of these editors, including <package role="port">devel/gtranslator</package>.
pt_br: Um editor <acronym>PO</acronym> é usado para editar o arquivo. <package role="port">editores/poedit</package> é usado nestes exemplos porque é simples e tem requisitos mínimos. Outros editores <acronym>PO</acronym> oferecem recursos para facilitar o trabalho de tradução. A Coleção de Ports oferece vários desses editores, incluindo o <package role="port">devel/gtranslator</package>.

source: It is important to preserve the <acronym>PO</acronym> file. It contains all of the work that translators have done.
pt_br: É importante preservar o arquivo <acronym>PO</acronym>. Ele contém todo o trabalho que os tradutores fizeram.

source: Translating the Porter's Handbook to Spanish
pt_br: Traduzindo o Porter's Handbook para o Espanhol

source: Enter Spanish translations of the contents of the Porter's Handbook.
pt_br: Digite as traduções para o Espanhol do conteúdo do Porter's Handbook.

source: Change to the Spanish Porter's Handbook directory and update the <acronym>PO</acronym> file. The generated <acronym>PO</acronym> file is called <filename>es_ES.po</filename> as shown in <xref linkend="po-translations-language-names"/>.
pt_br: Mude para o diretório Espanhol do Porter's Handbook e atualize o arquivo <acronym>PO</acronym>. O arquivo <acronym>PO</acronym> gerado é chamado <filename>es_ES.po</filename> como mostrado em <xref linkend="po-translations-language-names"/>.

source: Enter translations using a <acronym>PO</acronym> editor:
pt_br: Realize as traduções usando um editor de <acronym>PO</acronym>:

source: Tips for Translators
pt_br: Dicas para Tradutores

source: Preserving <acronym>XML</acronym> Tags
pt_br: Preservando Tags <acronym>XML</acronym>

source: Preserve <acronym>XML</acronym> tags that are shown in the English original.
pt_br: Preserve as tags <acronym>XML</acronym> mostradas no original em Inglês.

source: English original:
pt_br: Inglês original:

source: Spanish translation:
pt_br: Tradução para o Espanhol:

source: Preserving Spaces
pt_br: Preservando Espaços

source: Preserve existing spaces at the beginning and end of strings to be translated. The translated version must have these spaces also.
pt_br: Preserve os espaços existentes no início e no final das strings a serem traduzidas. A versão traduzida também deve ter esses espaços.

source: Verbatim Tags
pt_br: Tags

source: The contents of some tags should be copied verbatim, not translated:
pt_br: O conteúdo de algumas tags devem ser copiadas igualmente, sem realizar tradução:

source: <literal>$FreeBSD$</literal> Strings
pt_br: Strings <literal>$FreeBSD$</literal>

source: The $FreeBSD$ version strings used in files require special handling. In examples like <xref linkend="po-translations-creating-example"/>, these strings are not meant to be expanded. The English documents use <literal>&amp;dollar;</literal> entities to avoid including actual literal dollar signs in the file:
pt_br: As strings da versão $FreeBSD$ usadas nos arquivos requerem tratamento especial. Nos exemplos como <xref linkend="po-translations-creating-example"/>, essas strings não devem ser expandidas. Os documentos em inglês usam entidades <literal>&amp;dollar;</literal> para evitar a inclusão de sinais reais de dólar no arquivo:

source: The <literal>&amp;dollar;</literal> entities are not seen as dollar signs by the version control system and so the string is not expanded into a version string.
pt_br: As entidades <literal>&amp;dollar;</literal> não são vistas como cifrões pelo sistema de controle de versão e, portanto, a string não é expandida em uma string de versão.

source: When a <acronym>PO</acronym> file is created, the <literal>&amp;dollar;</literal> entities used in examples are replaced with actual dollar signs. The resulting literal <literal>$FreeBSD$</literal> string will be wrongly expanded by the version control system when the file is committed.
pt_br: Quando um arquivo <acronym>PO</acronym> é criado, as entidades <literal>&amp;dollar;</literal> usadas nos exemplos são substituídas por cifrões reais. A sequência literal <literal>$FreeBSD$</literal> será expandida incorretamente pelo sistema de controle de versão quando o arquivo sofrer algum commit.

source: The same technique as used in the English documents can be used in the translation. The <literal>&amp;dollar;</literal> is used to replace the dollar sign in the translation entered into the <acronym>PO</acronym> editor:
pt_br: A mesma técnica usada nos documentos em Inglês pode ser usada na tradução. O <literal>&amp;dollar;</literal> é usado para substituir o sinal de dólar na tradução inserida no editor <acronym>PO</acronym>:

source: Building a Translated Document
pt_br: Compilando um Documento Traduzido

source: A translated version of the original document can be created at any time. Any untranslated portions of the original will be included in English in the resulting document. Most <acronym>PO</acronym> editors have an indicator that shows how much of the translation has been completed. This makes it easy for the translator to see when enough strings have been translated to make building the final document worthwhile.
pt_br: Uma versão traduzida do documento original pode ser criada a qualquer momento. Quaisquer porções não traduzidas do original serão incluídas em Inglês no documento resultante. A maioria dos editores <acronym>PO</acronym> tem um indicador que mostra quanto da tradução foi realizada. Isso torna mais fácil para o tradutor ver quantas strings foram traduzidas para tornar a compilação do documento final utiilizável.

source: Building the Spanish Porter's Handbook
pt_br: Construindo o Porter's Handbook Espanhol

source: Build and preview the Spanish version of the Porter's Handbook that was created in an earlier example.
pt_br: Compile e visualize a versão em Espanhol do Porter's Handbook criado em um exemplo anterior.

source: Build the translated document. Because the original is a book, the generated document is <filename>book.xml</filename>.
pt_br: Compile o documento traduzido. Como o original é um livro, o documento gerado é <filename>book.xml</filename>.

source: Render the translated <filename>book.xml</filename> to <acronym>HTML</acronym> and view it with <application>Firefox</application>. This is the same procedure used with the English version of the documents, and other <varname>FORMATS</varname> can be used here in the same way. See <xref linkend="doc-build-rendering-common-formats"/>.
pt_br: Renderize o <filename>book.xml</filename> traduzido para <acronym>HTML</acronym> e visualize-o com o <application>Firefox</application>. Este é o mesmo procedimento usado com a versão em Inglês dos documentos, e outros <varname>FORMATS</varname> podem ser usados ​​aqui da mesma maneira. Veja <xref linkend="doc-build-rendering-common-formats"/>.

source: Submitting the New Translation
pt_br: Submetendo a Nova Tradução

source: Prepare the new translation files for submission. This includes adding the files to the version control system, setting additional properties on them, then creating a diff for submission.
pt_br: Prepare os novos arquivos de tradução para envio. Isso inclui adicionar os arquivos ao sistema de controle de versão, definir propriedades adicionais e criar um diff para a submissão.

source: The diff files created by these examples can be attached to a <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi?product=Documentation">documentation bug report</link> or <link xlink:href="https://reviews.freebsd.org/">code review</link>.
pt_br: Os arquivos diff criados por esses exemplos podem ser anexados a um <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi?product=Documentation">relatório de bug de documentação</link> ou <link xlink:href="https://reviews.freebsd.org/">revisão de código</link>.

source: Spanish Translation of the NanoBSD Article
pt_br: Tradução Espanhola do Artigo NanoBSD

source: Add a FreeBSD version string comment as the first line of the <acronym>PO</acronym> file:
pt_br: Adicione a string FreeBSD na primeira linha do arquivo <acronym>PO</acronym>:

source: Add the <filename>Makefile</filename>, the <acronym>PO</acronym> file, and the generated <acronym>XML</acronym> translation to version control:
pt_br: Adicione o <filename>Makefile</filename>, o arquivo <acronym>PO</acronym> e o arquivo traduzido <acronym>XML</acronym> que foi gerado para o controle de versão:

source: Set the <application>Subversion</application> <literal>svn:keywords</literal> properties on these files to <literal>FreeBSD=%H</literal> so <literal>$FreeBSD$</literal> strings are expanded into the path, revision, date, and author when committed:
pt_br: Configure as propriedades <application>Subversion</application> <literal>svn:keywords</literal> nesses arquivos para <literal>FreeBSD=%H</literal> para que as strings <literal>$FreeBSD$</literal> sejam expandidas com o caminho, revisão, data e autor quando o arquivo sofrer o commit:

source: Set the <acronym>MIME</acronym> types of the files. These are <literal>text/xml</literal> for books and articles, and <literal>text/x-gettext-translation</literal> for the <acronym>PO</acronym> file.
pt_br: Defina os tipos <acronym>MIME</acronym> dos arquivos. Estes são <literal>text/xml</literal> para livros e artigos, e <literal>text/x-gettext-translation</literal> para o arquivo <acronym>PO</acronym>.

source: Create a diff of the new files from the <filename>~/doc/</filename> base directory so the full path is shown with the filenames. This helps committers identify the target language directory.
pt_br: Crie um diff dos novos arquivos a partir do diretório base <filename>~/doc/</filename> para que o caminho completo seja mostrado com os nomes dos arquivos. Isso ajuda os committers a identificar o diretório do idioma de destino.

source: Korean <acronym>UTF-8</acronym> Translation of the Explaining-BSD Article
pt_br: Tradução Coreana <acronym>UTF-8</acronym> do Artigo Explicando o BSD

source: Set the <acronym>MIME</acronym> types of the files. Because these files use the <acronym>UTF-8</acronym> character set, that is also specified. To prevent the version control system from mistaking these files for binary data, the <literal>fbsd:notbinary</literal> property is also set:
pt_br: Defina os tipos <acronym>MIME</acronym> dos arquivos. Como esses arquivos usam o conjunto de caracteres <acronym>UTF-8</acronym>, isso também é especificado. Para evitar que o sistema de controle de versão confunda esses arquivos com arquivos binários, a propriedade <literal>fbsd:notbinary</literal> também é configurada:

source: Create a diff of these new files from the <filename>~/doc/</filename> base directory:
pt_br: Crie um diff desses novos arquivos no diretório base <filename>~/doc/</filename>:

source: Manual Pages
pt_br: Páginas de Manual

source: <emphasis>Manual pages</emphasis>, commonly shortened to <emphasis>man pages</emphasis>, were conceived as readily-available reminders for command syntax, device driver details, or configuration file formats. They have become an extremely valuable quick-reference from the command line for users, system administrators, and programmers.
pt_br: <emphasis>Páginas de manual</emphasis>, geralmente abreviadas como <emphasis>man pages</emphasis>, foram concebidas como lembretes prontamente disponíveis para sintaxe de comandos, detalhes de drivers de dispositivos ou formatos de arquivos de configuração. Elas se tornaram uma referência rápida extremamente valiosa de linha de comando para usuários, administradores de sistema e programadores.

source: Although intended as reference material rather than tutorials, the EXAMPLES sections of manual pages often provide detailed use case.
pt_br: Embora tenham sido planejados como material de referência em vez de tutoriais, as seções EXEMPLOS das páginas de manual geralmente fornecem casos de uso detalhados.

source: Manual pages are generally shown interactively by the <citerefentry><refentrytitle>man</refentrytitle><manvolnum>1</manvolnum></citerefentry> command. When the user types <command>man ls</command>, a search is performed for a manual page matching <literal>ls</literal>. The first matching result is displayed.
pt_br: Páginas de manual são geralmente mostradas interativamente pelo comando <citerefentry><refentrytitle>man</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Quando o usuário digita <command>man ls</command>, uma pesquisa é executada para uma página de manual que corresponde a <literal>ls</literal>. O primeiro resultado correspondente é exibido.

source: Sections
pt_br: Seções

source: Manual pages are grouped into <emphasis>sections</emphasis>. Each section contains manual pages for a specific category of documentation:
pt_br: As páginas de manual são agrupadas em <emphasis>seções</emphasis>. Cada seção contém páginas de manual para uma categoria específica de documentação:

source: Section Number
pt_br: Número da Seção

source: Category
pt_br: Categoria

source: General Commands
pt_br: Comandos Gerais

source: Kernel Interfaces
pt_br: Interfaces de Kernel

source: File Formats
pt_br: Formatos de Arquivo

source: Games
pt_br: Jogos

source: Miscellaneous
pt_br: Diversos

source: Kernel Developer
pt_br: Desenvolvedor Kernel

source: Markup
pt_br: Marcação

source: Various markup forms and rendering programs have been used for manual pages. FreeBSD has used <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>7</manvolnum></citerefentry> and the newer <citerefentry><refentrytitle>mandoc</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Most existing FreeBSD manual pages, and all new ones, use the <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry> form of markup. This is a simple line-based markup that is reasonably expressive. It is mostly semantic: parts of text are marked up for what they are, rather than for how they should appear when rendered. There is some appearance-based markup which is usually best avoided.
pt_br: Vários formulários de marcação e programas de renderização foram usados ​​para páginas de manual. O FreeBSD usou <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>7</manvolnum></citerefentry> e o mais recente <citerefentry><refentrytitle>mandoc</refentrytitle><manvolnum>1</manvolnum></citerefentry>. A maioria das páginas de manual do FreeBSD, e todas as novas, usam o formulário <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry> de marcação. Esta é uma marcação simples baseada em linhas que é razoavelmente expressiva. É principalmente semântico: partes do texto são marcadas para o que são, em vez de como devem aparecer quando renderizadas. Existe alguma marcação baseada em aparência que geralmente é melhor evitar.

source: Manual page source is usually interpreted and displayed to the screen interactively. The source files can be ordinary text files or compressed with <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> to save space.
pt_br: O código fonte de página de manual geralmente é interpretada e exibido na tela interativamente. Os arquivos fontes podem ser arquivos de texto comuns ou compactados com <citerefentry><refentrytitle>gzip</refentrytitle><manvolnum>1</manvolnum></citerefentry> para economizar espaço.

source: Manual pages can also be rendered to other formats, including PostScript for printing or <acronym>PDF</acronym> generation. See <citerefentry><refentrytitle>man</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: As páginas de manual também podem ser renderizadas para outros formatos, incluindo PostScript para impressão ou geração de <acronym>PDF</acronym>. Veja <citerefentry><refentrytitle>man</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Testing a new manual page can be challenging when it is not located in the normal manual page search path. <citerefentry><refentrytitle>man</refentrytitle><manvolnum>1</manvolnum></citerefentry> also does not look in the current directory. If the new manual page is in the current directory, prefix the filename with a <literal>./</literal>:
pt_br: O teste de uma nova página de manual pode ser um desafio quando o arquivo não está localizado no caminho de pesquisa normal da páginas de manual. <citerefentry><refentrytitle>man</refentrytitle><manvolnum>1</manvolnum></citerefentry> também não procura no diretório atual. Se a nova página de manual estiver no diretório atual, prefixe o nome do arquivo com um <literal>./</literal>:

source: An absolute path can also be used:
pt_br: Um caminho absoluto também pode ser usado:

source: Manual Page Sections
pt_br: Seções de Página de Manual

source: Manual pages are composed of several standard sections. Each section has a title in upper case, and the sections for a particular type of manual page appear in a specific order. For a category 1 General Command manual page, the sections are:
pt_br: Páginas de manual são compostas por várias seções padrão. Cada seção tem um título em letras maiúsculas e as seções de um determinado tipo de página de manual aparecem em uma ordem específica. Para uma página de manual do Comando Geral da categoria 1, as seções são:

source: Section Name
pt_br: Nome da Seção

source: Name of the command
pt_br: Nome do Comando

source: Format of options and arguments
pt_br: Formato das opções e argumentos

source: Description of purpose and usage
pt_br: Descrição da finalidade e uso

source: Environment settings that affect operation
pt_br: Configurações de ambiente que afetam a operação

source: Error codes returned on exit
pt_br: Códigos de erro retornados na saída

source: Examples of usage
pt_br: Exemplos de uso

source: Compatibility with other implementations
pt_br: Compatibilidade com outras implementações

source: Cross-reference to related manual pages
pt_br: Referência cruzada para páginas de manual relacionadas

source: Compatibility with standards like POSIX
pt_br: Compatibilidade com padrões como o POSIX

source: History of implementation
pt_br: História de implementação

source: Known bugs
pt_br: Bugs conhecidos

source: People who created the command or wrote the manual page.
pt_br: Pessoas que criaram o comando ou escreveram a página de manual.

source: Some sections are optional, and the combination of sections for a specific type of manual page vary. Examples of the most common types are shown later in this chapter.
pt_br: Algumas seções são opcionais e a combinação de seções para um tipo específico de página manual pode variar. Exemplos dos tipos mais comuns são mostrados mais adiante neste capítulo.

source: <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry> markup is based on <emphasis>macros</emphasis>. Lines that begin with a dot contain macro commands, each two or three letters long. For example, consider this portion of the <citerefentry><refentrytitle>ls</refentrytitle><manvolnum>1</manvolnum></citerefentry> manual page:
pt_br: A marcação <citerefentry><refentrytitle>mdoc</refentrytitle><manvolnum>7</manvolnum></citerefentry> é baseada em <emphasis>macros</emphasis>. As linhas que começam com um ponto contêm comandos de macro, com duas ou três letras. Por exemplo, veja esta parte da página de manual do <citerefentry><refentrytitle>ls</refentrytitle><manvolnum>1</manvolnum></citerefentry>:

source: A <emphasis>Document date</emphasis> and <emphasis>Document title</emphasis> are defined.
pt_br: O <emphasis>Document date</emphasis> e <emphasis>Document title</emphasis> são definidos.

source: A <emphasis>Section header</emphasis> for the NAME section is defined. Then the <emphasis>Name</emphasis> of the command and a one-line <emphasis>Name description</emphasis> are defined.
pt_br: O <emphasis>Cabeçalho da Seção</emphasis> para a seção NAME é definido. Em seguida, são definidos o <emphasis>Nome</emphasis> do comando e uma <emphasis>Descrição do Nome</emphasis> de uma linha.
