Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: Use descriptive values for <literal>xml:id</literal> names. The values must be unique within the entire document, not just in a single file. In the example, the subsection <literal>xml:id</literal> is constructed by appending text to the chapter <literal>xml:id</literal>. This ensures that the <literal>xml:id</literal>s are unique. It also helps both reader and anyone editing the document to see where the link is located within the document, similar to a directory path to a file.
pt_br: Use valores descritivos para nomes de <literal>xml:id</literal>. Os valores devem ser exclusivos em todo o documento, não apenas em um único arquivo. No exemplo, a subseção <literal>xml:id</literal> é construída anexando o texto ao capítulo <literal>xml:id</literal>. Isso garante que os <literal>xml:id</literal> s sejam exclusivos. Ele também ajuda o leitor e qualquer um que editar o documento a ver onde o link está localizado no documento, semelhante a um caminho de diretório para um arquivo.

source: Crossreferences with <literal>xref</literal>
pt_br: Referências Cruzadas com <literal>xref</literal>

source: <tag>xref</tag> provides the reader with a link to jump to another section of the document. The target <literal>xml:id</literal> is specified in the <literal>linkend</literal> attribute, and <tag>xref</tag> generates the link text automatically.
pt_br: <tag>xref</tag> fornece ao leitor um link para ir para outra seção do documento. O destino <literal>xml:id</literal> é especificado no atributo <literal>linkend</literal> e <tag>xref</tag> gera o texto do link automaticamente.

source: <tag>xref</tag> Example
pt_br: Exemplo <tag>xref</tag>

source: Assume that this fragment appears somewhere in a document that includes the <literal>xml:id</literal> example shown above:
pt_br: Imagine que esse fragmento apareça em algum lugar em um documento que inclua o exemplo <literal>xml:id</literal> mostrado acima:

source: The link text will be generated automatically, looking like (<emphasis>emphasized</emphasis> text indicates the link text):
pt_br: O texto do link será gerado automaticamente, parecendo como (O <emphasis> enfatizado</emphasis> indica o texto do link):

source: More information can be found in <emphasis>Chapter 1, Introduction</emphasis>.
pt_br: Mais informações podem ser encontradas no <emphasis>Capítulo 1, Introdução</emphasis>.

source: More specific information can be found in <emphasis>Section 1.1, <quote>More Details</quote></emphasis>.
pt_br: Informações mais específicas podem ser encontradas em <emphasis>Seção 1.1, <quote>Mais Detalhes</quote></emphasis>.

source: The link text is generated automatically from the chapter and section number and <literal>title</literal> elements.
pt_br: O texto do link é gerado automaticamente a partir do capítulo e número da seção e elementos <literal>title</literal>.

source: The link element described here allows the writer to define the link text. When link text is used, it is very important to be descriptive to give the reader an idea of where the link goes. Remember that DocBook can be rendered to multiple types of media. The reader might be looking at a printed book or other form of media where there are no links. If the link text is not descriptive enough, the reader might not be able to locate the linked section.
pt_br: O elemento link descrito aqui permite que o escritor defina o texto do link. Quando o texto do link é usado, é muito importante ser descritivo para dar ao leitor uma ideia de onde o link vai. Lembre-se que o DocBook pode ser renderizado para vários tipos de mídia. O leitor pode estar olhando para um livro impresso ou outra forma de mídia onde não há links. Se o texto do link não for descritivo o suficiente, talvez o leitor não consiga localizar a seção vinculada.

source: The <literal>xlink:href</literal> attribute is the <acronym>URL</acronym> of the page, and the content of the element is the text that will be displayed for the user to activate.
pt_br: O atributo <literal>xlink:href</literal> é a <acronym>URL</acronym> da página, e o conteúdo do elemento é o texto que será exibido para o usuário ativar.

source: In many situations, it is preferable to show the actual <acronym>URL</acronym> rather than text. This can be done by leaving out the element text entirely.
pt_br: Em muitas situações, é preferível mostrar a <acronym>URL</acronym> real em vez do texto. Isso pode ser feito deixando de fora o texto do elemento.

source: <tag>link</tag> to a FreeBSD Documentation Web Page Example
pt_br: <tag>link</tag> para um Exemplo de Página Web de Documentação do FreeBSD

source: Link to the book or article <acronym>URL</acronym> entity. To link to a specific chapter in a book, add a slash and the chapter file name, followed by an optional anchor within the chapter. For articles, link to the article <acronym>URL</acronym> entity, followed by an optional anchor within the article. <acronym>URL</acronym> entities can be found in <filename>doc/share/xml/urls.ent</filename>.
pt_br: Link para uma <acronym>URL</acronym> de uma entidade. de livro ou artigo Para criar um link para um capítulo específico de um livro, adicione uma barra e o nome do arquivo do capítulo, seguido por uma âncora opcional dentro do capítulo. Para artigos, crie um link para a entidade <acronym>URL</acronym> do artigo, seguida por uma âncora opcional no artigo. As entidades <acronym>URL</acronym> podem ser encontradas em <filename>doc/share/xml/urls.ent</filename>.

source: Usage for FreeBSD book links:
pt_br: Uso para links de livros do FreeBSD:

source: Read the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html#svn-intro">SVN introduction</link>, then pick the nearest mirror from the list of <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html#svn-mirrors">Subversion mirror sites</link>.
pt_br: Leia a <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html#svn-intro">Introdução ao SVN</link>, em seguida, escolha o espelho mais próximo do lista de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html#svn-mirrors">sites espelho do Subversion</link>.

source: Usage for FreeBSD article links:
pt_br: Uso para links de artigos do FreeBSD:

source: Read this <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/bsdl-gpl">article about the BSD license</link>, or just the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/bsdl-gpl#intro">introduction</link>.
pt_br: Leia este <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/bsdl-gpl">artigo sobre a licença BSD</link>, ou apenas a sua <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/bsdl-gpl#intro">introdução</link>.

source: <tag>link</tag> to a FreeBSD Web Page Example
pt_br: <tag>link</tag> para um Exemplo de Página Web do FreeBSD

source: Of course, you could stop reading this document and go to the <link xlink:href="@@URL_RELPREFIX@@/index.html">FreeBSD home page</link> instead.
pt_br: Claro, você pode parar de ler este documento e ir para a <link xlink:href="@@URL_RELPREFIX@@/index.html"> página inicial do FreeBSD</link>.

source: <tag>link</tag> to an External Web Page Example
pt_br: <tag>link</tag> para um Exemplo de Página Web Externa

source: Wikipedia has an excellent reference on <link xlink:href="http://en.wikipedia.org/wiki/GUID_Partition_Table">GUID Partition Tables</link>.
pt_br: A Wikipedia tem uma excelente referência em <link xlink:href="http://en.wikipedia.org/wiki/GUID_Partition_Table"> Tabelas de Partição GUID</link>.

source: The link text can be omitted to show the actual URL:
pt_br: O texto do link pode ser omitido para mostrar a URL real:

source: The same link can be entered using shorter notation instead of a separate ending tag:
pt_br: O mesmo link pode ser inserido usando notação mais curta em vez de uma tag de finalização separada:

source: The two methods are equivalent. Appearance:
pt_br: Os dois métodos são equivalentes. Aparência:

source: Wikipedia has an excellent reference on GUID Partition Tables: <uri xlink:href="http://en.wikipedia.org/wiki/GUID_Partition_Table">http://en.wikipedia.org/wiki/GUID_Partition_Table</uri>.
pt_br: A Wikipedia tem uma excelente referência em Tabelas de Partição GUID: <uri xlink:href="http://en.wikipedia.org/wiki/GUID_Partition_Table">http://en.wikipedia.org/wiki/GUID_Partition_Table </uri>.

source: Style Sheets
pt_br: Folhas de Estilo

source: <acronym>XML</acronym> is concerned with content, and says nothing about how that content should be presented to the reader or rendered on paper. Multiple <emphasis>style sheet</emphasis> languages have been developed to describe visual layout, including Extensible Stylesheet Language Transformation (<acronym>XSLT</acronym>), Document Style Semantics and Specification Language (<acronym>DSSSL</acronym>), and Cascading Style Sheets (<acronym>CSS</acronym>).
pt_br: O <acronym>XML</acronym> se preocupa com o conteúdo e não diz nada sobre como esse conteúdo deve ser apresentado ao leitor ou renderizado no papel. Múltiplas linguagens de <emphasis>folha de estilo</emphasis> foram desenvolvidas para descrever o layout visual, incluindo a Transformação de Linguagem de Folha de Estilo Extensível (<acronym>XSLT</acronym>), Semântica de Estilo de Documento e Linguagem de Especificação (<acronym>DSSSL</acronym> ) e Folhas de Estilo em Cascata (<acronym>CSS</acronym>).

source: The <acronym>FDP</acronym> documents use <acronym>XSLT</acronym> stylesheets to transform DocBook into <acronym>XHTML</acronym>, and then <acronym>CSS</acronym> formatting is applied to the <acronym>XHTML</acronym> pages. Printable output is currently rendered with legacy <acronym>DSSSL</acronym> stylesheets, but this will probably change in the future.
pt_br: Os documentos do <acronym>FDP</acronym> usam folhas de estilo <acronym>XSLT</acronym> para transformar o DocBook em <acronym>XHTML</acronym>, e então a formatação <acronym>CSS</acronym> é aplicada nas páginas <acronym>XHTML</acronym>. A saída imprimível é atualmente renderizada com folhas de estilo legadas do <acronym>DSSSL</acronym>, mas isso provavelmente mudará no futuro.

source: Cascading Style Sheets (<acronym>CSS</acronym>) are a mechanism for attaching style information (font, weight, size, color, and so forth) to elements in an <acronym>XHTML</acronym> document without abusing <acronym>XHTML</acronym> to do so.
pt_br: Folhas de estilos em cascata (<acronym>CSS</acronym>) são um mecanismo para anexar informações de estilo (font, weight, size, color e assim por diante) a elementos em um documento <acronym>XHTML</acronym> sem abusar de <acronym>XHTML</acronym> para o fazer.

source: The DocBook Documents
pt_br: Os Documentos DocBook

source: The FreeBSD <acronym>XSLT</acronym> and <acronym>DSSSL</acronym> stylesheets refer to <filename>docbook.css</filename>, which is expected to be present in the same directory as the <acronym>XHTML</acronym> files. The project-wide <acronym>CSS</acronym> file is copied from <filename>doc/share/misc/docbook.css</filename> when documents are converted to <acronym>XHTML</acronym>, and is installed automatically.
pt_br: As folhas de estilo <acronym>XSLT</acronym> e <acronym>DSSSL</acronym> do FreeBSD se referem a <filename>docbook.css</filename>, que deve estar presente no mesmo diretório que os arquivos <acronym>XHTML</acronym>. O arquivo <acronym>CSS</acronym> de todo o projeto é copiado de <filename>doc/share/misc/docbook.css</filename> quando os documentos são convertidos para <acronym>XHTML</acronym> e são instalados automaticamente .

source: Translations
pt_br: Traduções

source: This is the FAQ for people translating the FreeBSD documentation (FAQ, Handbook, tutorials, manual pages, and others) to different languages.
pt_br: Este é o FAQ para pessoas que estão traduzindo a documentação do FreeBSD (FAQ, Handbook, tutoriais, páginas de manual e outros) para diferentes idiomas.

source: It is <emphasis>very</emphasis> heavily based on the translation FAQ from the FreeBSD German Documentation Project, originally written by Frank Gründer <email>elwood@mc5sys.in-berlin.de</email> and translated back to English by Bernd Warken <email>bwarken@mayn.de</email>.
pt_br: Ele é <emphasis>fortemente</emphasis> baseado na tradução do FAQ do Projeto de Documentação Alemão do FreeBSD, originalmente escrito por Frank Gründer <email>elwood@mc5sys.in-berlin.de</email> e traduzido de volta para o inglês por Bernd Warken <email>bwarken@mayn.de</email>.

source: The FAQ is maintained by the Documentation Engineering Team <email>doceng@FreeBSD.org</email>.
pt_br: O FAQ é mantido pela Equipe de Engenharia de Documentação <email>doceng@FreeBSD.org</email>.

source: What do <phrase>i18n</phrase> and <phrase>l10n</phrase> mean?
pt_br: O que significa <phrase>i18n</phrase> e <phrase>l10n</phrase>?

source: <phrase>i18n</phrase> means <phrase>internationalization</phrase> and <phrase>l10n</phrase> means <phrase>localization</phrase>. They are just a convenient shorthand.
pt_br: <phrase>i18n</phrase> significa <phrase>internacionalização</phrase> e <phrase>l10n</phrase> significa <phrase>localização</phrase>. São apenas uma abreviação.

source: <phrase>i18n</phrase> can be read as <quote>i</quote> followed by 18 letters, followed by <quote>n</quote>. Similarly, <phrase>l10n</phrase> is <quote>l</quote> followed by 10 letters, followed by <quote>n</quote>.
pt_br: <phrase>i18n</phrase> pode ser lido como <quote>i</quote> seguido por 18 letras, seguido por <quote>n</quote>. Da mesma forma, <phrase>l10n</phrase> é <quote>l</quote> seguido por 10 letras, seguido por <quote>n</quote>.

source: Is there a mailing list for translators?
pt_br: Existe uma lista de discussão para tradutores?

source: Yes. Different translation groups have their own mailing lists. The <link xlink:href="https://www.freebsd.org/docproj/translations.html">list of translation projects</link> has more information about the mailing lists and web sites run by each translation project. In addition there is <email>freebsd-translators@freebsd.org</email> for general translation discussion.
pt_br: Sim. Diferentes grupos de tradução têm suas próprias listas de discussão. A <link xlink:href="https://www.freebsd.org/docproj/translations.html">lista dos projetos de tradução</link> possui mais informações sobre as listas de discussão e sites web mantidos por cada projeto de tradução. Além disso, existe a <email>freebsd-translators@freebsd.org</email> para discussão geral de tradução.

source: Are more translators needed?
pt_br: São necessários mais tradutores?

source: Yes. The more people work on translation the faster it gets done, and the faster changes to the English documentation are mirrored in the translated documents.
pt_br: Sim. Quanto mais pessoas trabalham na tradução, mais rápido ela será finalizada, e mais rapidamente as mudanças na documentação em Inglês serão refletidas nos documentos traduzidos.

source: You do not have to be a professional translator to be able to help.
pt_br: Você não precisa ser um tradutor profissional para poder ajudar.

source: What languages do I need to know?
pt_br: Quais idiomas eu preciso saber?

source: Ideally, you will have a good knowledge of written English, and obviously you will need to be fluent in the language you are translating to.
pt_br: Idealmente, você deverá possuir um bom conhecimento de Inglês escrito, e obviamente, precisará ser fluente no idioma para o qual está traduzindo.

source: English is not strictly necessary. For example, you could do a Hungarian translation of the FAQ from the Spanish translation.
pt_br: Inglês não é estritamente necessário. Por exemplo, você poderia fazer uma tradução Húngara do FAQ da tradução em Espanhol.

source: What software do I need to know?
pt_br: Quais softwares eu preciso conhecer?

source: It is strongly recommended that you maintain a local copy of the FreeBSD Subversion repository (at least the documentation part). This can be done by running:
pt_br: É fortemente recomendado que você mantenha uma cópia local do repositório Subversion do FreeBSD (pelo menos a parte da documentação). Isso pode ser feito executando:

source: <link xlink:href="https://svn.FreeBSD.org/">svn.FreeBSD.org</link> is a public <literal>SVN</literal> server. Verify the server certificate from the list of <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html#svn-mirrors">Subversion mirror sites</link>.
pt_br: <link xlink:href="https://svn.FreeBSD.org/">svn.FreeBSD.org</link> é um servidor público <literal>SVN</literal>. Verifique o certificado do servidor na lista de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html#svn-mirrors">Mirrors de Subversion</link>.

source: This will require the <package>devel/subversion</package> package to be installed.
pt_br: Será necessário que o pacote <package>devel/subversion</package> esteja instalado.

source: You should be comfortable using <application>svn</application>. This will allow you to see what has changed between different versions of the files that make up the documentation.
pt_br: Você deverá ter conhecimentos básicos de <application>svn</application>. Ele permitirá que você veja o que mudou entre as diferentes versões dos arquivos que compõem a documentação.

source: For example, to view the differences between revisions <literal>r33733</literal> and <literal>r33734</literal> of <filename>en_US.ISO8859-1/books/fdp-primer/book.xml</filename>, run:
pt_br: Por exemplo, para ver as diferenças entre as revisões <literal>r33733</literal> e <literal>r33734</literal> do <filename>en_US.ISO8859-1/books/fdp-primer/book.xml</filename>, execute:

source: Please see the complete explanation of using <application>Subversion</application> in FreeBSD in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">FreeBSD Handbook</link>.
pt_br: Por favor, veja a explicação completa de como usar o <application>Subversion</application> no FreeBSD no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">FreeBSD Handbook</link>.

source: How do I find out who else might be translating to the same language?
pt_br: Como eu faço para descobrir se já existem outras pessoas traduzindo documentos para o meu idioma?

source: The <link xlink:href="https://www.FreeBSD.org/docproj/translations.html">Documentation Project translations page</link> lists the translation efforts that are currently known about. If others are already working on translating documentation to your language, please do not duplicate their efforts. Instead, contact them to see how you can help.
pt_br: A <link xlink:href="https://www.FreeBSD.org/docproj/translations.html">página do Projeto de Tradução da Documentação</link> lista os trabalhos de tradução que são conhecidos. Se outras pessoas já estiverem trabalhando na tradução de documentação para o seu idioma, por favor, não duplique os esforços. Em vez disso, entre em contato para saber como você pode ajudar.

source: If no one is listed on that page as translating for your language, then send a message to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link> in case someone else is thinking of doing a translation, but has not announced it yet.
pt_br: Se não existir nenhum projeto de tradução para o seu idioma listado nesta página, envie uma mensagem para <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto de documentação do FreeBSD</link> para o caso de alguém estar pensando em fazer a tradução, mas ainda não tiver anunciado nada.

source: No one else is translating to my language. What do I do?
pt_br: Ninguém mais está traduzindo para o meu idioma. O que eu faço?

source: Congratulations, you have just started the <quote>FreeBSD <replaceable>your-language-here</replaceable> Documentation Translation Project</quote>. Welcome aboard.
pt_br: Parabéns, você acabou de iniciar o <quote> Projeto de Tradução da Documentação do FreeBSD em <replaceable>seu idioma aqui</replaceable> </quote>. Bem vindo a bordo.

source: First, decide whether or not you have got the time to spare. Since you are the only person working on your language at the moment it is going to be your responsibility to publicize your work and coordinate any volunteers that might want to help you.
pt_br: Primeiro, pense se você terá o tempo necessário. Uma vez que você é a única pessoa trabalhando no seu idioma no momento, será sua a responsabilidade de publicar o seu trabalho e coordenar qualquer voluntário que queira ajudá-lo.

source: Write an email to the Documentation Project mailing list, announcing that you are going to translate the documentation, so the Documentation Project translations page can be maintained.
pt_br: Escreva um email para a lista de discussão do Projeto de Documentação, anunciando que você irá traduzir a documentação, assim a página do Projeto de Traduções de Documentação poderá ser atualizada.

source: If there is already someone in your country providing FreeBSD mirroring services you should contact them and ask if you can have some webspace for your project, and possibly an email address or mailing list services.
pt_br: Se já existir alguém em seu país provendo o espelhamento de serviços do FreeBSD, você deve contacta-lo e perguntar se você pode ter algum espaço web para seu projeto, e se possível um endereço de email ou mesmo um serviço de lista de discussão.

source: Then pick a document and start translating. It is best to start with something fairly small—either the FAQ, or one of the tutorials.
pt_br: Então escolha um documento e comece a traduzir. É melhor começar com algo razoavelmente pequeno—como o FAQ ou um dos tutoriais.

source: I have translated some documentation, where do I send it?
pt_br: Eu já tenho alguns documentos traduzidos, para onde eu devo enviá-los?

source: That depends. If you are already working with a translation team (such as the Japanese team, or the German team) then they will have their own procedures for handling submitted documentation, and these will be outlined on their web pages.
pt_br: Isso depende. Se você já está trabalhando com uma equipe de tradução (tal como a equipe japonesa, ou a equipe alemã) então ela terá seus próprios procedimentos para manipular a documentação submetida, e estes serão descritos em seus web sites.

source: If you are the only person working on a particular language (or you are responsible for a translation project and want to submit your changes back to the FreeBSD project) then you should send your translation to the FreeBSD project (see the next question).
pt_br: Se você for a única pessoa trabalhando em um determinado idioma (ou se você é o responsável pelo projeto de tradução e quer submeter suas mudanças de volta para o projeto FreeBSD) então você deve enviar sua tradução ao Projeto FreBSD (veja pergunta seguinte).

source: I am the only person working on translating to this language, how do I submit my translation?
pt_br: Eu sou a única pessoa trabalhando na tradução para este idioma, como faço para enviar minha tradução?

source: We are a translation team, and want to submit documentation that our members have translated for us.
pt_br: Somos uma equipe de tradução e queremos enviar a documentação que nossos membros traduziram para nós.

source: First, make sure your translation is organized properly. This means that it should drop into the existing documentation tree and build straight away.
pt_br: Primeiro, verifique se sua tradução está organizada corretamente. Isso significa que ele deve cair na árvore de documentação existente e ser compilada de maneira correta.
