Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/fdp-primer/*.po
Languages: pt_br

source: The <emphasis>working copy</emphasis> is a copy of the FreeBSD repository documentation tree downloaded onto the local computer. Changes are made to the local working copy, tested, and then submitted as patches to be committed to the main repository.
pt_br: A <emphasis>área de trabalho</emphasis> é uma cópia da árvore de documentação do repositório do FreeBSD baixada no computador local. As alterações são feitas na cópia de trabalho local, testadas e enviadas como patches para serem submetidas no repositório principal.

source: A full copy of the documentation tree can occupy 700 megabytes of disk space. Allow for a full gigabyte of space to have room for temporary files and test versions of various output formats.
pt_br: Uma cópia completa da árvore de documentação pode ocupar 700 megabytes de espaço em disco. Tenha um gigabyte de espaço total para ter sobra para arquivos temporários e versões de teste dos diversos formatos de saída.

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html"><application>Subversion</application></link> is used to manage the FreeBSD documentation files. It is obtained by installing the <application>Subversion</application> package:
pt_br: O <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html"><application>Subversion</application></link> é utilizado para gerenciar os arquivos de documentação do FreeBSD. Ele é obtido pela instalação do pacote <application>Subversion</application>:

source: Documentation and Manual Pages
pt_br: Documentação e Páginas de Manual

source: FreeBSD documentation is not just books and articles. Manual pages for all the commands and configuration files are also part of the documentation, and part of the <acronym>FDP</acronym>'s territory. Two repositories are involved: <literal>doc</literal> for the books and articles, and <literal>base</literal> for the operating system and manual pages. To edit manual pages, the <literal>base</literal> repository must be checked out separately.
pt_br: A documentação do FreeBSD não é formada apenas por livros e artigos. Páginas de manual para todos os comandos e arquivos de configuração também fazem parte da documentação e fazem parte do território do <acronym>FDP</acronym>. Dois repositórios estão envolvidos: <literal>doc</literal> para os livros e artigos, e <literal>base</literal> para o sistema operacional e páginas de manual. Para editar páginas de manual, o repositório <literal>base</literal> deve ser registrado separadamente.

source: Repositories may contain multiple versions of documentation and source code. New modifications are almost always made only to the latest version, called <literal>head</literal>.
pt_br: Repositórios podem conter várias versões de documentação e código-fonte. Novas modificações quase sempre são feitas apenas para a versão mais recente, chamada <literal>head</literal>.

source: Choosing a Directory
pt_br: Escolhendo um Diretório

source: FreeBSD documentation is traditionally stored in <filename>/usr/doc/</filename>, and system source code with manual pages in <filename>/usr/src/</filename>. These directory trees are relocatable, and users may want to put the working copies in other locations to avoid interfering with existing information in the main directories. The examples that follow use <filename>~/doc</filename> and <filename>~/src</filename>, both subdirectories of the user's home directory.
pt_br: A documentação do FreeBSD é tradicionalmente armazenada em <filename>/usr/doc/</filename>, e o código fonte do sistema com páginas de manual em <filename>/usr/src/</filename>. Essas árvores são realocáveis ​​e os usuários podem armazenar as cópias de trabalho em outros locais para evitar interferir nas informações existentes nos diretórios principais. Os exemplos a seguir utilizam <filename>~/doc</filename> e <filename>~/src</filename>, ambos subdiretórios do diretório pessoal do usuário.

source: Checking Out a Copy
pt_br: Baixando uma Cópia

source: A download of a working copy from the repository is called a <emphasis>checkout</emphasis>, and done with <command>svn checkout</command>. This example checks out a copy of the latest version (<literal>head</literal>) of the main documentation tree:
pt_br: O processo de download de um repositório é chamado de <emphasis>checkout</emphasis> e é feito com um <command>svn checkout</command>. Este exemplo faz checkout de uma cópia da versão mais recente (<literal>head</literal>) do repositório de documentação principal:

source: A checkout of the source code to work on manual pages is very similar:
pt_br: O checkout do código-fonte para trabalhar nas páginas de manual é muito semelhante:

source: Updating a Working Copy
pt_br: Atualizando

source: The documents and files in the FreeBSD repository change daily. People modify files and commit changes frequently. Even a short time after an initial checkout, there will already be differences between the local working copy and the main FreeBSD repository. To update the local version with the changes that have been made to the main repository, use <command>svn update</command> on the directory containing the local working copy:
pt_br: Os documentos e arquivos no repositório do FreeBSD mudam diariamente. As pessoas modificam arquivos e submetem alterações com frequência. Mesmo após um checkout inicial, já haverá alterações entre a cópia de trabalho local e o repositório principal do FreeBSD. Para atualizar a versão local com as mudanças que foram feitas no repositório principal, execute <command>svn update</command> no diretório que contém a cópia de trabalho local:

source: Get in the protective habit of using <command>svn update</command> before editing document files. Someone else may have edited that file very recently, and the local working copy will not include the latest changes until it has been updated. Editing the newest version of a file is much easier than trying to combine an older, edited local file with the newer version from the repository.
pt_br: Adquira o hábito de proteção de executar <command>svn update</command> antes de editar os arquivos de documentação. Alguém pode ter editado esse arquivo muito recentemente e a cópia de trabalho local não incluirá essas alterações mais recentes até que ela seja atualizada. Editar a versão mais recente de um arquivo é muito mais fácil do que tentar combinar um arquivo local editado mais antigo com a versão mais recente do repositório.

source: Reverting Changes
pt_br: Revertendo Alterações

source: Sometimes it turns out that changes were not necessary after all, or the writer just wants to start over. Files can be <quote>reset</quote> to their unchanged form with <command>svn revert</command>. For example, to erase the edits made to <filename>chapter.xml</filename> and reset it to unmodified form:
pt_br: De vez em quando acontece que algumas mudanças não eram necessárias, ou o escritor só quer começar novamente. Arquivos podem ser <quote>resetados</quote> para sua forma anterior com <command>svn revert</command>. Por exemplo, para apagar as alterações feitas no <filename>chapter.xml</filename> e redefini-las para o formato sem modificação:

source: Making a Diff
pt_br: Criando um Diff

source: After edits to a file or group of files are completed, the differences between the local working copy and the version on the FreeBSD repository must be collected into a single file for submission. These <emphasis>diff</emphasis> files are produced by redirecting the output of <command>svn diff</command> into a file:
pt_br: Após finalizar as alterações em um arquivo ou grupo de arquivos, as diferenças entre a cópia de trabalho local e a versão no repositório do FreeBSD devem ser coletadas em um único arquivo para ser submetido. Estes arquivos <emphasis>diff</emphasis> são produzidos redirecionando a saída de <command>svn diff</command> para um arquivo:

source: Give the file a meaningful name that identifies the contents. The example above is for spelling fixes to the whole documentation tree.
pt_br: Dê ao arquivo um nome significativo que identifique o conteúdo. O exemplo acima é para correção ortográfica em toda a árvore de documentação.

source: If the diff file is to be submitted with the web <quote><link xlink:href="https://bugs.FreeBSD.org/bugzilla/enter_bug.cgi">Submit a FreeBSD problem report</link></quote> interface, add a <filename>.txt</filename> extension to give the earnest and simple-minded web form a clue that the contents are plain text.
pt_br: Se o arquivo diff for enviado com a interface web <quote><link xlink:href="https://bugs.FreeBSD.org/bugzilla/enter_bug.cgi">Submit a FreeBSD problem report</link></quote>, adicione uma extensão <filename>.txt</filename> para que o formulário web identifique que o conteúdo do arquivo é texto plano.

source: Be careful: <command>svn diff</command> includes all changes made in the current directory and any subdirectories. If there are files in the working copy with edits that are not ready to be submitted yet, provide a list of only the files that are to be included:
pt_br: Tenha cuidado: <command>svn diff</command> inclui todas as alterações feitas no diretório atual e em quaisquer subdiretórios. Se houver arquivos na cópia de trabalho com edições que ainda não estão prontas para serem enviadas, forneça uma lista apenas dos arquivos a serem incluídos:

source: <application>Subversion</application> References
pt_br: Referências <application>Subversion</application>

source: These examples show very basic usage of <application>Subversion</application>. More detail is available in the <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link> and the <link xlink:href="http://subversion.apache.org/docs/">Subversion documentation</link>.
pt_br: Estes exemplos demonstram um uso muito básico do <application>Subversion</application>. Mais detalhes estão disponíveis no <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link> e na <link xlink:href="http://subversion.apache.org/docs/">Documentação do Subversion</link>.

source: Documentation Directory Structure
pt_br: Estrutura de Diretórios da Documentação

source: Files and directories in the <filename>doc/</filename> tree follow a structure meant to:
pt_br: Arquivos e diretórios no repositório <filename>doc/</filename> seguem uma estrutura destinada a:

source: Make it easy to automate converting the document to other formats.
pt_br: Facilitar a conversão do documento para outros formatos.

source: Promote consistency between the different documentation organizations, to make it easier to switch between working on different documents.
pt_br: Promover a consistência entre as diferentes organizações de documentação, e assim facilitar a alternância entre diferentes documentos.

source: Make it easy to decide where in the tree new documentation should be placed.
pt_br: Facilitar a decisão de onde a nova documentação deve ser colocada.

source: In addition, the documentation tree must accommodate documents in many different languages and encodings. It is important that the documentation tree structure does not enforce any particular defaults or cultural preferences.
pt_br: Além disso, o repositório de documentação deve acomodar documentos em vários idiomas e codificações diferentes. É importante que a estrutura do repositório de documentação não imponha quaisquer padrões particulares ou preferências culturais.

source: The Top Level, <filename>doc/</filename>
pt_br: O Nível Superior, <filename>doc/</filename>

source: There are two types of directory under <filename>doc/</filename>, each with very specific directory names and meanings.
pt_br: Existem dois tipos de diretório em <filename>doc/</filename>, cada um com nomes de diretório e significados muito específicos.

source: Directory
pt_br: Diretório

source: Usage
pt_br: Uso

source: Contains files that are not specific to the various translations and encodings of the documentation. Contains subdirectories to further categorize the information. For example, the files that comprise the <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> infrastructure are in <filename>share/mk</filename>, while the additional <acronym>XML</acronym> support files (such as the FreeBSD extended DocBook <acronym>DTD</acronym>) are in <filename>share/xml</filename>.
pt_br: Contém arquivos que não são específicos das várias traduções e codificações da documentação. Contém subdiretórios para categorizar ainda mais as informações. Por exemplo, os arquivos que fazem parte da infra-estrutura <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> estão em <filename>share/mk</filename>, enquanto o suporte adicional a arquivos <acronym>XML</acronym> (como o DTBook estendido do FreeBSD <acronym>DTD</acronym>) estão em <filename>share/xml</filename>.

source: One directory exists for each available translation and encoding of the documentation, for example <filename>en_US.ISO8859-1/</filename> and <filename>zh_TW.UTF-8/</filename>. The names are long, but by fully specifying the language and encoding we prevent any future headaches when a translation team wants to provide documentation in the same language but in more than one encoding. This also avoids problems that might be caused by a future switch to Unicode.
pt_br: Existe um diretório para cada tradução e codificação disponível da documentação, por exemplo, <filename>en_US.ISO8859-1/</filename> e <filename>zh_TW.UTF-8/</filename>. Os nomes são longos, mas ao especificar totalmente o idioma e a codificação, evitamos dores de cabeça futuras quando uma equipe de tradução desejar fornecer documentação no mesmo idioma, mas em mais de uma codificação. Isso também evita problemas que podem ser causados ​​por uma futura mudança para Unicode.

source: The <filename><replaceable>lang</replaceable>.<replaceable>encoding</replaceable>/</filename> Directories
pt_br: Os Diretórios <filename><replaceable>lang</replaceable>.<replaceable>encoding</replaceable>/</filename>

source: These directories contain the documents themselves. The documentation is split into up to three more categories at this level, indicated by the different directory names.
pt_br: Esses diretórios contêm os próprios documentos. A documentação é dividida em até três outras categorias, indicadas pelos diferentes nomes de diretório.

source: Documentation marked up as a DocBook <tag>article</tag> (or equivalent). Reasonably short, and broken up into sections. Normally only available as one <acronym>XHTML</acronym> file.
pt_br: Documentação marcada como DocBook <tag>article</tag> (ou equivalente). Conteúdo curto e dividido em seções. Normalmente disponível apenas como um arquivo <acronym>XHTML</acronym>.

source: Documentation marked up as a DocBook <tag>book</tag> (or equivalent). Book length, and broken up into chapters. Normally available as both one large <acronym>XHTML</acronym> file (for people with fast connections, or who want to print it easily from a browser) and as a collection of linked, smaller files.
pt_br: Documentação marcada como DocBook <tag>book</tag> (ou equivalente). Conteúdo longo e dividido em capítulos. Normalmente disponível como um grande arquivo <acronym>XHTML</acronym> (para pessoas com conexões rápidas, ou que desejam imprimi-lo facilmente de um navegador) e como uma coleção de arquivos menores e com links.

source: For translations of the system manual pages. This directory will contain one or more <filename role="directory">man<replaceable>N</replaceable></filename> directories, corresponding to the sections that have been translated.
pt_br: Para traduções das páginas de manual do sistema. Esse diretório conterá um ou mais diretórios <filename role="directory">man<replaceable>N</replaceable></filename>, correspondendo às seções que foram traduzidas.

source: Not every <filename role="directory"><replaceable>lang</replaceable>.<replaceable>encoding</replaceable></filename> directory will have all of these subdirectories. It depends on how much translation has been accomplished by that translation team.
pt_br: Nem todo diretório <filename role="directory"><replaceable>lang</replaceable>.<replaceable>encoding</replaceable></filename> terá todos esses subdiretórios. Depende de quanto a tradução foi realizada por essa equipe de tradução.

source: Document-Specific Information
pt_br: Informação Específica de Documentação

source: This section contains specific notes about particular documents managed by the FDP.
pt_br: Esta seção contém informações específicas sobre documentos gerenciados pelo FDP.

source: The Handbook
pt_br: O Handbook

source: The Handbook is written in DocBook <acronym>XML</acronym> using the FreeBSD DocBook extended <acronym>DTD</acronym>.
pt_br: O Handbook está escrito em DocBook <acronym>XML</acronym> usando <acronym>DTD</acronym> extendido do DocBook FreeBSD.

source: The Handbook is organized as a DocBook <tag>book</tag>. The book is divided into <tag>part</tag>s, each of which contains several <tag>chapter</tag>s. <tag>chapter</tag>s are further subdivided into sections (<tag>sect1</tag>) and subsections (<tag>sect2</tag>, <tag>sect3</tag>) and so on.
pt_br: O Handbook está organizado como um DocBook <tag>book</tag>. O livro é dividido em <tag>part</tag>s, cada uma contendo vários <tag>chapter</tag>s. Os <tag>chapter</tag>s são subdivididos em seções (<tag>sect1</tag>) e subseções (<tag>sect2</tag>, <tag>sect3</tag>) e assim por diante.

source: Physical Organization
pt_br: Organização Física

source: There are a number of files and directories within the <filename>handbook</filename> directory.
pt_br: Existem vários arquivos e diretórios dentro do diretório <filename>handbook</filename>.

source: The Handbook's organization may change over time, and this document may lag in detailing the organizational changes. Post questions about Handbook organization to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>.
pt_br: A organização do Handbook pode ser alterada ao longo do tempo, e este documento pode estar defasado quanto ao detalhamento das mudanças organizacionais do mesmo. Envie perguntas sobre a organização do Handbook na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto FreeBSD</link>.

source: The <filename>Makefile</filename> defines some variables that affect how the <acronym>XML</acronym> source is converted to other formats, and lists the various source files that make up the Handbook. It then includes the standard <filename>doc.project.mk</filename>, to bring in the rest of the code that handles converting documents from one format to another.
pt_br: O <filename>Makefile</filename> define algumas variáveis ​​que afetam como o fonte <acronym>XML</acronym> é convertido em diversos formatos e lista os vários arquivos fontes que compõem o Handbook. Em seguida, ele inclui o <filename>doc.project.mk</filename> padrão, para inserir o restante do código que manipula a conversão de documentos de um formato para outro.

source: This is the top level document in the Handbook. It contains the Handbook's <link linkend="xml-primer-doctype-declaration">DOCTYPE declaration</link>, as well as the elements that describe the Handbook's structure.
pt_br: Este é o principal arquivo do Handbook. Ele contém a <link linkend="xml-primer-doctype-declaration">declaração DOCTYPE</link>, bem como os elementos que descrevem a estrutura do Handbook.

source: <filename>book.xml</filename> uses <link linkend="xml-primer-parameter-entities">parameter entities</link> to load in the files with the <filename>.ent</filename> extension. These files (described later) then define <link linkend="xml-primer-general-entities">general entities</link> that are used throughout the rest of the Handbook.
pt_br: <filename>book.xml</filename> utiliza <link linkend="xml-primer-parameter-entities">entidades de parâmetro</link> para carregar os arquivos com a extensão <filename>.ent</filename>. Esses arquivos (descritos posteriormente) e então definem as <link linkend="xml-primer-general-entities">entidades gerais</link> que são utilizadas ​​no restante do Handbook.

source: Each chapter in the Handbook is stored in a file called <filename>chapter.xml</filename> in a separate directory from the other chapters. Each directory is named after the value of the <literal>id</literal> attribute on the <tag>chapter</tag> element.
pt_br: Cada capítulo do Handbook é armazenado em um arquivo chamado <filename>chapter.xml</filename> em um diretório separado dos outros capítulos. Cada diretório é nomeado após o valor do atributo <literal>id</literal> no elemento <tag>chapter</tag>.

source: For example, if one of the chapter files contains:
pt_br: Por exemplo, se um dos arquivos de capítulo contiver:

source: Then it will be called <filename>chapter.xml</filename> in the <filename>kernelconfig</filename> directory. In general, the entire contents of the chapter are in this one file.
pt_br: Então ele será chamado de <filename>chapter.xml</filename> no diretório <filename>kernelconfig</filename>. Em geral, todo o conteúdo do capítulo está neste único arquivo.

source: When the <acronym>XHTML</acronym> version of the Handbook is produced, this will yield <filename>kernelconfig.html</filename>. This is because of the <literal>id</literal> value, and is not related to the name of the directory.
pt_br: Quando a versão <acronym>XHTML</acronym> do Handbook for gerada, produzirá o <filename>kernelconfig.html</filename>. Isso é por causa do valor <literal>id</literal> e não está relacionado ao nome do diretório.

source: In earlier versions of the Handbook, the files were stored in the same directory as <filename>book.xml</filename>, and named after the value of the <literal>id</literal> attribute on the file's <tag>chapter</tag> element. Now, it is possible to include images in each chapter. Images for each Handbook chapter are stored within <filename>share/images/books/handbook</filename>. The localized version of these images should be placed in the same directory as the <acronym>XML</acronym> sources for each chapter. Namespace collisions are inevitable, and it is easier to work with several directories with a few files in them than it is to work with one directory that has many files in it.
pt_br: Nas versões anteriores do Handbook, os arquivos eram armazenados no mesmo diretório que <filename>book.xml</filename> e nomeados após o valor do atributo <literal>id</literal> no elemento <tag>chapter</tag>. Agora, é possível incluir imagens em cada capítulo. Imagens para cada capítulo do Handbook são armazenadas em <filename>share/images/books/handbook</filename>. As imagens devem ser colocadas no mesmo diretório que os fontes <acronym>XML</acronym> para cada capítulo. As colisões de Namespace são inevitáveis ​​e é mais fácil trabalhar com vários diretórios que contenham alguns arquivos, do que trabalhar com um único diretório que contenham muitos arquivos.

source: A brief look will show that there are many directories with individual <filename>chapter.xml</filename> files, including <filename>basics/chapter.xml</filename>, <filename>introduction/chapter.xml</filename>, and <filename>printing/chapter.xml</filename>.
pt_br: Com uma breve analise pode-se constatar que existem diversos diretórios com arquivos individuais <filename>chapter.xml</filename>, incluindo <filename>basics/chapter.xml</filename>, <filename>introduction/chapter.xml</filename>, e <filename>printing/chapter.xml</filename>.
