<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Version fran&ccedil;aise : Michel Boucey
     Original revision: n.nn

-->   
<!-- %man; -->

<!DOCTYPE ARTICLE PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN"> %man;
<!ENTITY % urls PUBLIC "-//FreeBSD//ENTITIES Common Document URL Entities//FR"> %urls;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR"> %abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR"> %artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;

<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN"> %authors;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//FR"> %mailing-lists;
<!ENTITY rel.current CDATA "3.2">


]>

<article lang="fr">
  <articleinfo>
    <title>Les lecteurs ZIP</title>

    <authorgroup>
      <author>
	<firstname>Jason</firstname>
	<surname>Bacon</surname>
	
	<affiliation>
	  <address><email>acadix@execpc.com</email></address>
	</affiliation>
      </author>
    </authorgroup>
   <abstract>
      &abstract.license;
      &abstract.disclaimer;
      &trans.a.boucey;
   </abstract>
  </articleinfo>

  <sect1>
    <title>Les bases au sujet des lecteurs ZIP</title>

    <para>Les disques ZIP sont des disques magn&eacute;tiques amovibles de grande 
      capacit&eacute;, accessibles en lecture et en &eacute;criture par les lecteurs ZIP de 
      marque IOMEGA.  Les disques ZIP sont similaires aux disquettes, en 
      &eacute;tant cependant bien plus rapides et en ayant une capacit&eacute; bien 
      sup&eacute;rieure. Alors qu'une disquette comporte typiquement 1.44 Mo,
      les disques ZIP sont disponibles en deux capacit&eacute;s, &agrave; savoir 100 Mo
      et 250 Mo. Les lecteurs ZIP ne  doivent pas &ecirc;tre confondus avec
      super-disquette, un lecteur de disquette de 120 Mo de capacit&eacute;,
      qui accepte aussi les traditionnelles disquettes de 1.44 Mo de
      capacit&eacute;.</para>

    <para>IOMEGA vends aussi un lecteur &agrave; la capacit&eacute; et aux performances 
      sup&eacute;rieurs appel&eacute; JAZZ.  Les lecteurs JAZZ sont livr&eacute;s en 1 Go et 2
      Go de capacit&eacute;.</para>

    <para>Les lecteurs ZIP sont disponibles en unit&eacute; interne ou externe, 
      utilisant l'une des trois interfaces suivantes :</para>
    
    <orderedlist>
      <listitem>
	<para>L'interface SCSI (Small Computer Standard Interface) est 
	  l'interface la plus rapide, la plus sophistiqu&eacute;e, la plus extensible, 
	  et la plus ch&egrave;re.  L'interface SCSI est utilis&eacute;e sur tous types 
	  d'ordinateur, du PC &agrave; la station de travail RISC, jusqu'aux 
	  mini-ordinateurs, pour connecter tous types de p&eacute;riph&eacute;riques
	  tels que lecteurs de disque, lecteurs de bande, scanners, etc.
	  Les lecteurs ZIP SCSI peuvent &ecirc;tre internes ou externes, &eacute;tant 
	  entendu que votre adaptateur SCSI poss&egrave;de un connecteur 
	  externe.</para>
	
	<note>
	  <para>Si vous utilisez un mat&eacute;riel SCSI externe, il est important 
	    de ne jamais le connecter ni le d&eacute;connecter tout pendant 
	    que l'ordinateur est en fonctionnement. Faire ceci risque de 
	    causer des dommages aux syst&egrave;mes de fichiers sur les disques
	    en cours de connection.</para>
	</note>
	
	<para>Si vous souhaitez le maximum de performance et la plus grande 
	  facilit&eacute; d'installation, l'interface SCSI est le meilleur choix.  Cela 
	  demandera certainement l'adjonction d'un adaptateur SCSI, puisque la 
	  majorit&eacute; des PC (exception faite des serveurs hautes performances) 
	  ne comportent pas d'origine de support SCSI.  Chaque adaptateur peut 
	  prendre en charge 7 ou 15 p&eacute;riph&eacute;riques SCSI, selon le mod&egrave;le.</para>
	
	<para>Chaque p&eacute;riph&eacute;rique SCSI a son propre contr&ocirc;leur, et ces 
	  contr&ocirc;leurs sont assez intelligents et bien standardis&eacute;s (le 
	  second `S' de SCSI est l'abr&eacute;viation de Standard), ce qui signifie 
	  , du point de vue du syst&egrave;me d'exploitation, que tous les lecteurs de 
	  disques SCSI sont quasiment identiques, ceci vaut aussi pour les 
	  lecteurs de bandes, etc.  Pour prendre en charge du mat&eacute;riel SCSI, le 
	  syst&egrave;me d'exploitation n'a besoin que d'un pilote (driver) propre &agrave; 
	  l'adaptateur utilis&eacute;, et un pilote g&eacute;n&eacute;rique propre &agrave; chaque type de 
	  mat&eacute;riel, &agrave; savoir un pilote pour disque SCSI, un pilote pour lecteur 
	  de bande, et ainsi de suite.  Il y a certains mat&eacute;riels SCSI qui 
	  peuvent &ecirc;tre mieux utilis&eacute;s gr&acirc;ce &agrave; des pilotes sp&eacute;cialis&eacute;s (comme par 
	  exemple les lecteurs DAT), mais, g&eacute;n&eacute;ralement, ils fonctionnent bien 
	  avec le pilote g&eacute;n&eacute;rique. Il se peut alors que le pilote g&eacute;n&eacute;rique ne prenne pas
	  en compte un certain nombre de caract&eacute;ristiques sp&eacute;cifiques.</para>
	
	<para>Utiliser un lecteur ZIP SCSI consiste simplement &agrave; d&eacute;terminer 
	  quel fichier mat&eacute;riel dans le r&eacute;pertoire <filename>/dev</filename> 
	  repr&eacute;sente le lecteur ZIP. Pour ce faire, on peut observer les messages lors 
	  de l'amor&ccedil;age de BSD (ou dans <filename>/var/log/messages</filename> apr&egrave;s le 
	  d&eacute;marrage), o&ugrave; vous verrez une ligne ressemblant fort &agrave; ceci:</para>
	
	<programlisting>da1: &lt;IOMEGA ZIP 100 D.13&gt; Removable Direct Access SCSI-2 Device</programlisting>

	<para>Cela signifie que le lecteur ZIP est repr&eacute;sent&eacute; par le fichier 
	  <filename>/dev/da1</filename>.</para>
      </listitem>

      <listitem>
	 <para>L'interface IDE (Integrated Drive Electronics) est une interface 
	   de lecteur de disque bon march&eacute; utilis&eacute;e pour les ordinateurs de bureau. 
	   La plus grande partie des mat&eacute;riels IDE est strictement interne.</para>

	<para>Les performances des lecteurs ZIP IDE sont comparables &agrave; celles des  
	  lecteurs ZIP SCSI (l'interface IDE n'est pas aussi rapide que l'interface 
	  SCSI, mais les performances des lecteurs ZIP sont limit&eacute;es essentiellement 
	  par leur m&eacute;canique, non pas &agrave; cause du bus SCSI).</para>
	
	<para>L'inconv&eacute;nient de l'interface IDE sont les limites qu'elle impose.
	  La plupart des adaptateurs IDE ne peuvent prendre en charge que deux 
	  p&eacute;riph&eacute;riques, et ne sont en g&eacute;n&eacute;ral pas con&ccedil;ues pour le long terme. Par 
	  exemple, l'interface originelle IDE ne prend pas en charge les disques durs 
	  comportant plus de 1024 cylindres, ce qui oblige de nombreuses personnes &agrave; 
	  mettre &agrave; jour pr&eacute;matur&eacute;ment leurs &eacute;quipements.  Si vous pr&eacute;voyez d'&eacute;tendre 
	  votre PC par l'adjonction d'un nouveau disque dur, d'un lecteur de bande, 
	  ou d'un scanner, vous pouvez investir dans un adaptateur SCSI et ZIP SCSI 
	  afin d'&eacute;viter des probl&egrave;mes dans le futur.</para>

	<para>Les p&eacute;riph&eacute;riques IDE sous FreeBSD sont pr&eacute;fix&eacute;s par un <literal>w</literal>.
	  Par exemple, un disque dur IDE peut &ecirc;tre <filename>/dev/wd0</filename>, 
	  un lecteur de CDROM IDE (ATAPI) peut &ecirc;tre <filename>/dev/wcd1</filename>, 
	  et ainsi de suite.</para>
      </listitem>

      <listitem>
	<para>L'interface port parall&egrave;le est populaire gr&acirc;ce aux p&eacute;riph&eacute;riques externes 
	  portables tels que lecteurs ZIP externes, scanners, parce que potentiellement 
	  chaque ordinateur poss&egrave;de un port parall&egrave;le standard (habituellement utilis&eacute; 
	  pour les imprimantes).  Ceci rend ais&eacute; pour tout un chacun le transfert de donn&eacute;es 
	  entre ordinateurs par simple le transport de ces lecteurs ZIP.</para>

	<para>Les performances seront en g&eacute;n&eacute;ral moindre qu'avec un lecteur ZIP ou IDE, 
	  du fait de la vitesse limit&eacute;e du port parall&egrave;le. Cette vitesse varie 
	  consid&eacute;rablement d'un ordinateur &agrave; l'autre, et peut souvent &ecirc;tre configur&eacute;e
	  &agrave; partir du syst&egrave;me BIOS. Certaines machines demanderont une configuration du 
	  BIOS pour pouvoir faire fonctionner le port parall&egrave;le en mode bidirectionnel 
	  (Les ports parall&egrave;les ont seulement &eacute;t&eacute; con&ccedil;us &agrave; l'origine pour fournir des 
	  donn&eacute;es sortantes vers les imprimantes)</para>
      </listitem>
    </orderedlist>
  </sect1>

  <sect1>
    <title>ZIP parall&egrave;le : Le pilote <devicename>vpo</devicename></title>

    <para>Pour utiliser un lecteur ZIP port parall&egrave;le sous FreeBSD, le pilote 
      <devicename>vpo</devicename> doit &ecirc;tre configur&eacute; dans le noyau. Les lecteurs 
      ZIP port parall&egrave;le ont aussi un contr&ocirc;leur SCSI int&eacute;gr&eacute;. Le pilote vpo autorise 
      le noyau FreeBSD &agrave; communiquer avec le contr&ocirc;leur SCSI du lecteur ZIP au travers 
      du port parall&egrave;le.</para>
    
    <para>Depuis que le pilote vpo ne fait plus parti du noyau en standard (au 
      moins pour FreeBSD 3.2), vous avez &agrave; reconstruire le noyau afin de rendre 
      accessible ce p&eacute;riph&eacute;rique.  La d&eacute;marche de reconstruction d'un noyau est indiqu&eacute;e 
      en d&eacute;tails dans une autre section.  Les &eacute;tapes suivantes indiquent bri&egrave;vement 
      la d&eacute;marche &agrave; suivre afin de mettre en &eacute;tat de marche le pilote vpo:</para>
    
    <orderedlist>
      <listitem>
	<para>Lancer <command>/stand/sysinstall</command>, et installer les sources 
	  du noyau sur votre syst&egrave;me.</para>

	<screen>&prompt.root; <userinput>cd /sys/i386/conf</userinput>
&prompt.root; <userinput>cp GENERIC MYKERNEL</userinput></screen>

	<para>Editer <filename>MYKERNEL</filename>, changer la ligne 
	  <literal>ident</literal> en <literal>MYKERNEL</literal>, et d&eacute;commenter 
	  la ligne d&eacute;crivant le pilote vpo.</para>
	
	<para>Si vous poss&eacute;dez un second port parall&egrave;le, vous pourriez avoir besoin 
	  de copier la section d&eacute;di&eacute;e &agrave; <literal>ppc0</literal> pour cr&eacute;er le 
	  p&eacute;riph&eacute;rique <literal>ppc1</literal>.  Le second port parall&egrave;le utilise 
	  g&eacute;n&eacute;ralement l'IRQ 5 et l'adresse 378.  Seul l'IRQ est requise pour le 
	  fichier de configuration.</para>

	<para>Si votre disque dur est un SCSI, vous courez au devant d'un probl&egrave;me 
	  dans l'ordre de la d&eacute;tection des p&eacute;riph&eacute;riques, qui entra&icirc;nera le syst&egrave;me 
	  &agrave; tenter d'utiliser le lecteur ZIP en tant que p&eacute;riph&eacute;rique racine. Le d&eacute;marrage 
	  &eacute;chouera alors, &agrave; moins que vous ayez install&eacute; un syst&egrave;me de fichiers racine 
	  sur le disque ZIP! Dans ce cas, vous aurez besoin de forcer le noyau &agrave; lier
	  le disque SCSI racine &agrave; <filename>/dev/da0</filename>, &agrave; savoir le disque SCSI
	  racine. Cela assignera alors le disque ZIP au prochain disque SCSI disponible,
	  &agrave; savoir <literal>/dev/da1</literal>. Pour forcer votre disque dur SCSI en 
	  <literal>da0</literal>, changer la ligne

	  <programlisting>device  da0</programlisting>

	  en

	  <programlisting>disk da0 at scbus0 target 0 unit 0</programlisting></para>

	<para>Vous aurez probablement &agrave; changer la cible afin de la faire correspondre &agrave;
	  l' ID SCSI de votre disque dur. Vous devrez aussi forcer l'entr&eacute;e scbus0  afin
	  de l'ajuster &agrave; votre contr&ocirc;leur.  Par exemple, si vous avez un contr&ocirc;leur 15xx
	  de chez Adaptec, vous changerez
	  
	  <programlisting>controller scbus0</programlisting>

	  en

	  <programlisting>controller scbus0 at aha0</programlisting></para>

	<para>En dernier lieu, puisque vous &ecirc;tes en train d'&eacute;diter le fichier de 
	  configuration du noyau, profitez-en pour &ocirc;ter tous les pilotes inutiles. 
	  Cela doit &ecirc;tre fait avec de grandes pr&eacute;cautions, et seulement si vous avez 
	  assez confiance en vous en ce qui concerne les modifications du noyau. Ôter 
	  les pilotes inutiles r&eacute;duira la taille du noyau, laissant plus de m&eacute;moire disponible 
	  &agrave; vos applications.  Afin de d&eacute;terminer les pilotes qui ne sont pas n&eacute;cessaires, 
	  allez &agrave; la fin du fichier <filename>/var/log/messages</filename>, et recherchez 
	  les lignes comportant "not found" (non trouv&eacute;). Commenter alors ces p&eacute;riph&eacute;riques 
	  dans votre fichier de configuration (par un # en t&ecirc;te de ligne). Vous pouvez aussi 
	  changer d'autres options afin de r&eacute;duire la taille et d'accro&icirc;tre la rapidit&eacute; de 
	  votre noyau. Lisez la section concernant la reconstruction du noyau pour de 
	  plus amples informations.</para>
      </listitem>

      <listitem>
	<para>Il est maintenant temps de compiler le noyau:</para>

	<screen>&prompt.root; <userinput>/usr/sbin/config MYKERNEL</userinput>
&prompt.root; <userinput>cd ../../compile/MYKERNEL</userinput>	  
&prompt.root; <userinput>make clean depend && make all install</userinput></screen>
      </listitem>
    </orderedlist>
    
    <para>Apr&egrave;s le reconstruction du noyau, vous devez red&eacute;marrer.  Assurez-vous 
      que le lecteur ZIP est connect&eacute; au port parall&egrave;le avant que le d&eacute;marrage ne 
      commence. Vous devriez voir appara&icirc;tre le lecteur ZIP parmi les messages de 
      d&eacute;marrage en tant que p&eacute;riph&eacute;rique vp0 ou vp1, selon le port parall&egrave;le auquel 
      le lecteur est rattach&eacute;.  Vous devez pouvoir voir aussi &agrave; quel fichier 
      p&eacute;riph&eacute;rique le lecteur ZIP a &eacute;t&eacute; associ&eacute;. Ce sera <filename>/dev/da0</filename> 
      si vous n'avez pas d'autre disque SCSI dans le syst&egrave;me, ou <filename>/dev/da1</filename> 
      si vous avez un disque dur SCSI &agrave; la racine de votre syst&egrave;me.</para>
  </sect1>

  <sect1>
    <title>Monter les disques ZIP</title>

    <para>Pour acc&eacute;der &agrave; un disque ZIP, vous avez simplement &agrave; le monter, comme 
      n'importe quel autre p&eacute;riph&eacute;rique. Le syst&egrave;me de fichiers est repr&eacute;sent&eacute; 
      par la quatri&egrave;me tranche sur le p&eacute;riph&eacute;rique, que ce soit pour un disque ZIP 
      en SCSI ou en parall&egrave;le, vous devriez faire:</para>
    
    <screen>&prompt.root; <userinput>mount_msdos /dev/da1s4 /mnt</userinput></screen>

    <para>Pour les lecteurs ZIP IDE:</para>
    
    <screen>&prompt.root; <userinput>mount_msdos /dev/wd1s4 /mnt</userinput></screen>

    <para>Cela facilitera aussi les choses de mettre &agrave; jour <filename>/etc/fstab</filename> 
      afin de rendre le montage plus ais&eacute;. Ajoutez une ligne telle que la suivante, ajust&eacute;e 
      &agrave; votre syst&egrave;me:
    
      <programlisting>/dev/da1s4  /zip msdos rw,noauto  0 0</programlisting>
    
      et cr&eacute;er le r&eacute;pertoire <filename>/zip</filename>.</para>
    
    <para>Vous pouvez alors monter simplement en tapant 

      <screen>&prompt.root; <userinput>mount /zip</userinput></screen>

      et d&eacute;monter en entrant

      <screen>&prompt.root; <userinput>umount /zip</userinput></screen></para>

    <para>Pour savoir plus sur le format de <filename>/etc/fstab</filename>, 
      voir &man.fstab.5;.</para>
    
    <para>Vous pouvez aussi cr&eacute;er un syst&egrave;me de fichiers FreeBSD sur un disque 
      ZIP en utilisant &man.newfs.8;.  Cependant, le disque ne sera utilisable 
      que par un syst&egrave;me FreeBSD, et peut-&ecirc;tre par quelques cl&ocirc;nes Unix 
      reconnaissant le syst&egrave;me de fichiers FreeBSD (mais certainement pas par
      DOS ou Windows).</para>
  </sect1>
</article>






