<!-- $Id: preface.sgml,v 1.11 1999-05-31 12:46:48 jesusr Exp $ -->
<!-- The FreeBSD Documentation Spanish Project -->
  <sect>
    <heading>Introducci&oacute;n<label id="preface"></heading>

    <p>Bienvenido a la FAQ de FreeBSD 2.X!

    <sect1>
      <heading>&iquest;Cu&aacute;l es el objetivo de esta FAQ?</heading>

      <p>Como es habitual con las FAQ de los grupos de noticias (USENET), este
      documento pretende abarcar las preguntas m&aacute;s frecuentes 
      referentes al sistema operativo FreeBSD (y por supuesto contestarlas!).
      Pensadas en un principio para reducir el tr&aacute;fico y evitar que se 
      hagan las mismas preguntas una y otra vez, las FAQ se han convertido en 
      un valorado recurso de obtenci&oacute;n de informaci&oacute;n.

      <p>Todo el esfuerzo se ha hecho en intentar que esta FAQ sea lo m&aacute;s
      informativa posible; si tienes cualquier comentario o sugerencia, por
      favor, env&iacute;a un mail a <url url="mailto:jesusr@freebsd.org"
      name="FAQ maintainer">.

    <sect1>
      <heading>&iquest;Qu&eacute; es FreeBSD?</heading>

      <p>De manera resumida, FreeBSD 2.X es un sistema operativo UNIX
      indirectamente basado en el port de Net/2 para i386 de Berkeley
      (conocido como 386BSD) realizado por William Jolitz's. Una 
      descripci&oacute;n m&aacute;s detallada de FreeBSD y de como puede 
      trabajar, se encuentra en
      <url url="http://www.freebsd.org" name="FreeBSD home page">.****

      <p>FreeBSD es usado por compa&ntilde;&iacute;s, proveedores de Internet,
      profesionales de la inform&aacute;tica, estudiantes y usuarios 
      particulares de todo el mundo en su trabajo, educaci&oacute;n y ocio. 
      Puedes ver a algunos de ellos en 
      <url url="http://www.freebsd.org/gallery.html" name="FreeBSD Gallery.">

      <p>Para informaci&oacute;n m&aacute;s detallada sobre FreeBSD, por 
      favor mira en
      <url url="../../handbook/index.html" name="FreeBSD Handbook.">

    <sect1>
      <heading>&iquest;Cu&aacute;l es el objetivo de FreeBSD?</heading>

      <p>El objetivo del Proyecto FreeBSD es proveer software que pueda ser
      usado en todos los &aacute;mbitos sin ning&uacute;n tipo de atadura. 
      Muchos de nosotros estamos significativamente involucrados en el 
      desarrollo del c&oacute;digo (y del proyecto) y no ser&iacute;a cierto 
      decir que no esperabamos o esperamos alg&uacute;n tipo de 
      financiaci&oacute;n, pero definitivamente no estamos preparados para 
      insistir en ello. Creemos que nuestra primera y principal 
      "misi&oacute;n" es proveer el c&oacute;digo libremente, y en cualquier 
      &aacute;mbito, para que el c&oacute;digo sea lo m&aacute;s expandido 
      posible y produzca los mayores beneficios. Esto es, creemos en uno de 
      los objetivos fundamentales del Software Libre y lo apoyamos de manera 
      incondicional.

      <p>El c&oacute;digo fuente de los programas registrados bajo GNU 
      General Public License (GPL) o GNU Library General Public License (LGPL),
      se provee bajo las condiciones fijadas por esas licencias. Debido a 
      complicaciones adicionales en el uso comercial de Software GPL, 
      intentamos reemplazar ese software por otros registrados bajo el 
      copyright BSD, menos estricto y m&aacute;s permisivo.


    <sect1>
      <heading>&iquest;Porqu&eacute; se llama FreeBSD?</heading>

      <p>
      <itemize>
        <item>Este sistema debe ser usado libremente, sin coste alguno
        incluso para fines comerciales.

        <item>El c&oacute;digo fuente completo del sistema operativo es de 
        libre distribuci&oacute;n, y se han marcado el menor numero posible 
        de restricciones para su uso, distribuci&oacute;n e 
        incorporaci&oacute;n a otros trabajos (comerciales o no).

        <item>Cualquier persona que tenga alguna sugerencia de mejora y/o 
        "parche" de algun "bug", es libre de enviar el c&oacute;digo y que 
        este sea a&ntilde;adido al c&oacute;digo fuente de la 
        distribuci&oacute;n original (sujeto a una o dos condiciones obvias).
      </itemize>

      <p>Para todos nuestros lectores que su primer lenguaje no sea el 
      ingl&eacute;s, decir que la palabra "free" es usada en dos sentidos, 
      uno significando "sin coste" y el otro "puedes hacer lo que quieras". 
      Aparte de una o dos cosas que no puedes hacer con el c&oacute;digo de 
      FreeBSD, por ejemplo decir que lo has escrito, realmente puedes hacer lo 
      que quieras con &eacute;l.

    <sect1>
      <heading>&iquest;Cu&aacute;l es la &uacute;ltima versi&oacute;n de FreeBSD?
      </heading>

      <p>La versi&oacute;n 
      <url url="ftp://ftp.freebsd.org/pub/FreeBSD/releases/i386/3.2-RELEASE" 
      name="3.2R"> es la &uacute;ltima <em>-stable</em>; fue declarada 
      definitiva (a partir de ahora "release") en Mayo de 1999.

      <p>Brevemente explicado, <bf>-stable</bf> est&aacute; dirigido a 
      proveedores de Internet y otros usuarios corporativos que quieren 
      estabilidad y una sucesi&oacute;n tranquila en los cambios y 
      actualizaciones a las nuevas versiones y sus mejoras. S&oacute;lo debes
      usar la rama <em/current/ si est&aacute;s seguro de estar preparado para
      su mayor "volatilidad" (relativa a <em/-stable/).

      <p>Las versiones Release se hacen cada <ref id="release_freq" 
      name="varios meses">. Mientras mucha gente mantiene m&aacute;s al 
      d&iacute;a los fuentes de FreeBSD (lee las preguntas en
      <ref id="current" name="FreeBSD-current"> y <ref id="stable"
      name="FreeBSD-stable">, hacerlo est&aacute; pensado para gente que
      se considere preparada para seguir el desarrollo continuo del
      c&oacute;digo fuente.
     

    <sect1>
      <heading>&iquest;Qu&eacute; es FreeBSD-current?<label id="current"></heading>

      <p><url url="../../handbook/cutting-edge.html#CURRENT" name="FreeBSD-current">
      es la versi&oacute;n de desarrollo del sistema operativo, la cual 
      acabar&aacute; siendo la versi&oacute;n 4.0-RELEASE. Como es de suponer, 
      esta versi&oacute;n es de inter&eacute;s solo para los desarrolladores 
      que trabajan en el sistema y "masoquistas" de la programaci&oacute;n. 
      Mira la  
      <url url="../../handbook/cutting-edge.html#CURRENT" name="secci&oacute;n 
      correspondiente"> en el  <url url="../../handbook/index.html" 
      name="handbook"> para saber como funciona esta opci&oacute;n.

      <p>Si no est&aacute;s familiarizado con el sistema operativo o no eres 
      capaz de identificar la diferencia entre un problema real y un problema
      temporal, no deber&iacute;as usar FreeBSD-current. Esta rama a veces 
      avanza muy rapidamente y puede no ser compilable durante unos d&iacute;as.      La gente que usa FreeBSD-current es capaz de analizar los problemas y 
      solo comunicarlos si son motivo de errores. Preguntas como "al ejecutar
      make world obtengo un error referente a grupos" en la lista de
      distribuci&oacute;n -current pueden quedar fuera de lugar.

      <p>Una release <url url="../releases/snapshots.html" name="snapshot">
       corresponde al desarrollo de la rama -current; distribuciones en
       CDROM de esta versi&oacute;n est&aacute;n disponibles. Los objetivos 
       de cada release snapshot son:

      <itemize>
        <item>Testear la &uacute;ltima versi&oacute;n del software de 
        instalaci&oacute;n.

        <item>Dar a la gente que le gustar&iacute;a usar la versi&oacute;n 
        -current pero que no tiene el tiempo suficiente para seguir el ritmo 
        diario de actualizaciones, una manera f&aacute;cil de poder instalarla 
        en su sistema.

        <item>Preservar un punto de referencia fijado en el c&oacute;digo en 
        cuesti&oacute;n, s&oacute;lo en caso de que "rompamos" algo realmente 
        importante. (De todas maneras, el CVS normalmente previene de que cosas
        tan horribles como estas puedean suceder :)

        <item>Asegurar que las nuevas caracter&iacute;sticas desarrolladas 
        puedan ser suficientemente testeadas por el mayor n&uacute;mero de 
        gente.
      </itemize>

      <p>No se garantiza que ning&uacute;n snapshot pueda ser considerado
      "calidad de producci&oacute;n". Para conseguir estabilidad y un sistema
      garantizado, tendr&aacute;s que usar las versiones release.

      <p>Las release snapshot est&aacute;n directamente disponibles en
      <url url="ftp://current.freebsd.org/pub/FreeBSD/"> y son generadas
      un promedio de una vez por d&iacute;a para las ramas 4.0-current y 
      3.0-stable.

    <sect1>
      <heading>&iquest;Qu&eacute; significa FreeBSD-stable?<label id="stable"></heading>

      <p>Cuando la versi&oacute;n de FreeBSD 2.0.5 fue declarada release, 
      decidimos dividir el desarrollo de FreeBSD en dos ramas. Una rama fue 
      llamada <url url="../../handbook/stable.html" name="-stable"> con la 
      intenci&oacute;n de que solo los parches bien testeados y peque&ntilde;as 
      actualizaciones de determinadas partes del sistema fuesen incluidas en 
      ella (para proveedores de Internet y otras empresas para los que no 
      resultan deseables cambios repentinos o experimentales). La otra rama fue
      <url url="../../handbook/cutting-edge.html#CURRENT" name="-current">, 
      la cual ha sido, esencialmente, una l&iacute;nea com&uacute;n para el 
      desarrollo de la versi&oacute;n 4.0-RELEASE. Aqu&iacute; hay un 
      peque&ntilde;o gr&aacute;fico ASCII para ayudar a entender este 
      sistema de desarrollo:


<verb>
                  2.0
                   |
                   |
                   |  [2.1-stable]
*BRANCH*         2.0.5 -> 2.1 -> 2.1.5 -> 2.1.6 -> 2.1.7.1  [2.1-stable ends]
                   |                            (Mar 1997)
                   |
                   |
                   |  [2.2-stable]
*BRANCH*        2.2.1 -> 2.2.2-RELEASE -> 2.2.5-RELEASE -> ...
                   |       (Mar 1997)      (Oct 1997)
                   |
                   |
                3.0-SNAPs  (started Q1 1997)
                   |
                   |
              3.0.0-RELEASE (Oct 1998)
                   |
                   |  [3.0-stable]
*BRANCH*          3.1  (Feb 1999) -> 3.2-RELEASE -> ... future 3.x releases ...
                   |                 (Mayo 1999) 
                   | 
                  \|/
                   +
           [4.0-current continues]
</verb>

      <p>La rama -current progresa lentamente hacia la 4.0 y superiores,
      de la misma manera la anterior 2.2-estable fue sustituida por la
      release 3.0, la nueva "rama estable" tambi&eacute;n conocida como
      3.0-stable. 4.0-current continuar&aacute; hasta donde los desarrollos 
      activos lleguen cuando se convierta en release 4.0. En ese punto, 4.0 se
      convertir&aacute; en 4.0-stable y se abrir&aacute; la nueva 4.1-current.

    <sect1>
      <heading>&iquest;Cuando se realizan las releases de FreeBSD?<label id="release_freq"></heading>

      <p>Como principio general, el equipo de FreeBSD solo hace una nueva
      versi&oacute;n release de FreeBSD cuando cree que hay suficientes
      caracter&iacute;sticas nuevas y/o parches que la justifiquen y esten
      seguros de que con los cambios realizados no se compromete la estabilidad
      de la release. Muchos usuarios creen que esta precauci&oacute;n es una 
      de las mejores caracter&iacute;sticas de FreeBSD.

      <p>Las versiones release son hechas cada 6 meses aproximadamente.

      <p>Para los usuarios que necesiten (o quieran) un poco m&aacute;s de 
      excitaci&oacute;n, hay SNAP-release m&aacute;s frecuentemente, 
      particularmente durante el mes anterior a una release completa.

    <sect1>
      <heading>&iquest;Est&aacute; FreeBSD disponible solo para PCs?</heading>

      <p>En estos momentos, s&iacute;, aunque se est&aacute; trabajando en 
      portarlo a la arquitectura DEC Alpha. Si tu m&aacute;quina tiene una 
      arquitectura diferente y necesitas un sistema de este tipo, te 
      aconsejamos que mires en <url url="http://www.netbsd.org/" name="NetBSD">
      o en <url url="http://www.openbsd.org/" name="OpenBSD">.

    <sect1>
      <heading> &iquest;Qui&eacute;n es responsable de FreeBSD?</heading>

      <p>Las decisiones clave concernientes al proyecto FreeBSD como la
      direcci&oacute;n a seguir y qui&eacute;n est&aacute; autorizado a 
      a&ntilde;adir c&oacute;digo a la distribuci&oacute;n original, se hace a 
      trav&eacute;s de un grupo de unas 17 personas llamado 
      <url url="../../handbook/staff.html#STAFF-CORE" name="core team">.
      Existe tambi&eacute;n un grupo de unas 150 personas o
      <url url="../../handbook/staff-committers.html" name="committers"> que
      tambi&eacute;n est&aacute;n autorizadas a realizar cambios directamente 
      sobre la distribuci&oacute;n original.

      <p>De todas maneras, la cambios importantes son discutidos en
      las <ref id="mailing" name="listas de distribuci&oacute;n"> en las que no
      existen restricciones en quien participa en las discusiones.

    <sect1>
      <heading>&iquest;D&oacute;nde puedo conseguir FreeBSD?<label id="where-get"></heading>

      <p>Todas las versiones release de FreeBSD est&aacute;n disponibles via ftp
      an&oacute;nimo en <url url="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/"
      name="el servidor FTP de FreeBSD">:

      <itemize>
        <item>Para la actual 3.2-stable release, 3.2R mira en
        <url url="ftp://ftp.FreeBSD.ORG/pub/FreeBSD/releases/i386/3.2-RELEASE/"
        name="3.2-RELEASE">.

        <item>Para la actual 4.0-current release, 4.0-SNAP, mira en
        <url url="ftp://current.freebsd.org/pub/FreeBSD/" name="4.0">.

        <item><url url="ftp://releng22.freebsd.org/pub/FreeBSD/"
        name="2.2 Snapshot"> releases son hechas v&iacute;a 
        RELENG_2_2 rama (2.2.5 -> 2.2.x). Con la ocasional excepci&oacute;n de
        peque&ntilde;as variaciones, la rama RELENG_2_2 esta siendo 
        cuidadosamente mantenida (no hay cambios experimentales y los parches 
        son a&ntilde;adidos solo despu&eacute;s de ser testeados en -current).

        <item><url url="ftp://current.freebsd.org/pub/FreeBSD/"
        name="4.0 Snapshot"> releases son hechas una vez al d&iacute;a para la 
        rama <ref id="current" name="-current">, siendo este un servicio 
        puramente para testeadores y desarrolladores.

      <p>FreeBSD esta tambi&eacute;n disponible via CDROM, en los siguientes 
        lugares:

      <p>Walnut Creek CDROM<newline>
      4041 Pike Lane, Suite F<newline>
      Concord, CA  94520  USA<newline>
      Orders:     +1 800 786-9907<newline>
      Questions:  +1 925 674-0783<newline>
      FAX:        +1 925 674-0821<newline>
      email:      <url url="mailto:orders@cdrom.com" name="WC Orders address">
                  <newline>
      WWW:        <url url="http://www.cdrom.com/" name="WC Home page">
                  <newline>

      <p>En Australia:

      <p>Advanced Multimedia Distributors<newline>
      Factory 1/1 Ovata Drive<newline>
      Tullamarine, Melbourne<newline>
      Victoria<newline>
      Australia<newline>
      Voice: +61 3 9338 6777<newline>

      CDROM Support BBS<newline>
      17 Irvine St<newline>
      Peppermint Grove  WA 6011<newline>
      Voice: +61 9 385-3793<newline>
      Fax:   +61 9 385-2360<newline>

      Y en el Reino Unido:

      The Public Domain &amp; Shareware Library<newline>
      Winscombe House, Beacon Rd<newline>
      Crowborough<newline>
      Sussex. TN6 1UL<newline>
      Voice: +44 1892 663-298<newline>
      Fax:   +44 1892 667-473<newline>
	</itemize>

    <sect1>
      <heading>&iquest;D&oacute;nde encuentro informaci&oacute;n sobre las listas de distribuci&oacute;n de FreeBSD?<label id="mailing"></heading>

      <p>Puedes encontrar toda la informaci&oacute;n en <url
      url="../../handbook/eresources.html#ERESOURCES-MAIL"
      name="la secci&oacute;n de listas del Handbook.">

    <sect1>
      <heading>&iquest;Qu&eacute; grupos de noticias est&aacute;n disponibles sobre 
      FreeBSD?</heading>

      <p>Puedes encontrar toda la informaci&oacute;n en <url
      url="../../handbook/eresources-news.html"
      name="la secci&oacute;n de news del Handbook.">

    <sect1>
      <heading>
      &iquest;Hay algun canal IRC (Internet Relay Chat) sobre FreeBSD?
      </heading>
      
      <p>S&iacute;, muchas de las grandes redes de IRC tienen canales de
      chat de FreeBSD.

     <itemize>
      <item>El canal <tt>&num;FreeBSD</tt> en EFNet es un f&oacute;rum de
      FreeBSD, pero no acudas all&iacute; para obtener soporte t&eacute;cnico
      o contar tus penas sobre como leer las p&aacute;ginas man ;). Es un canal
      de chat, de principio a f&iacute;n, y los temas que se tratan suelen ser
      cosas como sexo, deportes o armas nucleares.
      Est&aacute;s Avisado!.
      Disponible en el servidor <tt>irc.chat.org</tt>.

      <item>El canal <tt>&num;FreeBSD</tt> en DALNET est&aacute; disponible
      en el servidor <tt>irc.dal.net</tt> en USA y <tt>irc.eu.dal.net</tt>
      en Europa.

      <item>El canal <tt>&num;FreeBSD</tt> en UNDERNET est&aacute; disponible
      en <tt>us.undernet.org</tt> en USA y <tt>eu.undernet.org</tt> en Europa.
      Igual que en EFNET, no hagas preguntas t&eacute;cnicas. Es un canal de
      chat, no de soporte.

      <item>Finalmente, puedes usar el canal <tt>&num;FreeBSD</tt> en BSDNET,
      una peque&ntilde;a red de chat, en el servidor <tt>irc.FreeBSD.org</tt>.
      Esta red intenta ofrecer m&aacute;s soporte t&eacute;cnico y no ser tan
      an&aacute;rquica como EFNET, UNDERNET o DALNET. Porqu&eacute; no ofrecer
      respuestas de manera voluntaria hoy en BSDNET?.
     </itemize>

     <p>Cada uno de estos canales es diferente y no est&aacute;n conectados
     entre ellos. Sus estilos de chat difieren, por lo que podr&iacute;s 
     probarlos todos para ver cual te gusta m&aacute;s.

    <sect1>
      <heading>Libros sobre FreeBSD</heading>

      <p>El libro de Greg Lehey's ``Installing and Running FreeBSD'' 
      est&aacute; disponible en Walnut Creek y se vende con el CDROM 2.2.5.  
      Hay tambi&eacute;n un libro
      m&aacute;s completo titulado ``The Complete FreeBSD'', el cual tiene 
      manuales adicionales e incluye el CDROM 2.2.6. Deber&iacute;a estar 
      disponible en las mejores librer&iacute;as.

      <p>Hay un proyecto de documentaci&oacute;n de FreeBSD al que puedes 
      contactar (o mejor, participar), en la lista de distribuci&oacute;n 
      <tt>doc</tt>:
      <url url="mailto:doc@FreeBSD.ORG" name="&lt;doc@FreeBSD.ORG&gt;">.
      En esta lista se tratan todos los temas referentes a la 
      documentaci&oacute;n de FreeBSD. Para preguntas actuales sobre FreeBSD, 
      existe la lista <tt>question</tt>: <url url="mailto:questions@FreeBSD.oRG"
      name="&lt;questions@FreeBSD.ORG&gt;">.

      <p>Est&aacute; disponible un "manual" (handbook a patir de ahora) de 
      FreeBSD, y se puede encontrar en:
      <url url="../../handbook/index.html" name="El Handbook de FreeBSD">.
      Ten en cuenta que este es un trabajo en constante desarrollo y
      actualizaci&oacute;n, por lo que algunas secciones podr&iacute;an estar 
      incompletas.

      <p>Teniendo en cuenta que FreeBSD 2.2.x est&aacute; basado en la 
      versi&oacute;n Berkeley 4.4BSD-Lite2, la mayor&iacute;a de manuales de 
      4.4BSD con aplicables a FreeBSD 2.2.x. O'Reilly y Asociados publican 
      estos manuales:

      <itemize>
        <item>4.4BSD System Manager's Manual <newline>
        By Computer Systems Research Group, UC Berkeley <newline>
        1st Edition June 1994, 804 pages <newline>
        ISBN: 1-56592-080-5 <newline>

        <item>4.4BSD User's Reference Manual <newline>
        By Computer Systems Research Group, UC Berkeley <newline>
        1st Edition June 1994, 905 pages <newline>
        ISBN: 1-56592-075-9 <newline>

        <item>4.4BSD User's Supplementary Documents <newline>
        By Computer Systems Research Group, UC Berkeley <newline>
        1st Edition July 1994, 712 pages <newline>
        ISBN: 1-56592-076-7 <newline>

        <item>4.4BSD Programmer's Reference Manual <newline>
        By Computer Systems Research Group, UC Berkeley <newline>
        1st Edition June 1994, 886 pages <newline>
        ISBN: 1-56592-078-3 <newline>

        <item>4.4BSD Programmer's Supplementary Documents <newline>
        By Computer Systems Research Group, UC Berkeley <newline>
        1st Edition July 1994, 596 pages <newline>
        ISBN: 1-56592-079-1 <newline>
      </itemize>

      <p>Una descripci&oacute;n de estos puede ser encontrada v&iacute;a WWW en:

      <url url="http://gnn.com/gnn/bus/ora/category/bsd.html"
      name="Descripci&oacute;n de libros sobre 4.4BSD">

      <p>Para profundizar m&aacute;s en la organizacion del kernel de 4.4BSD, no
      puedes ir mal con los siguientes:

      <p>McKusick, Marshall Kirk, Keith Bostic, Michael J Karels,
      and John Quarterman.<newline>

      <p><em>The Design and Implementation of the 4.4BSD Operating
      System</em>.  Reading, Mass. : Addison-Wesley, 1996.<newline>
      ISBN 0-201-54979-4<newline>

      <p>Un buen libro en administraci&oacute;n de sistemas es:

      <p>Evi Nemeth, Garth Snyder, Scott Seebass &amp; Trent R. Hein,<newline>
      ``Unix System Administration Handbook'', Prentice-Hall, 1995<newline>
      ISBN: 0-13-151051-7<newline>

      <p><bf/NOTE/ Asegurate de conseguir la segunda edici&oacute;n, con 
      cubierta roja y no la primera.

      <p>Este libro cubre las necesidades b&aacute;sicas, as&iacute; como 
      TCP/IP, DNS, NFS,SLIP/PPP, sendmail, INN/NNTP, impresi&oacute;n, etc,. 
      Es caro, (aproximadamente unos US&dollar;45-&dollar;55), pero vale la 
      pena.
      Tambi&eacute;n incluye un cd-rom con las fuentes de varias herramientas,
      muchas de las cuales est&aacute;n incluidas, tambi&eacute;n, en la 
      versi&oacute;n 2.2.6R (cdrom) de FreeBSD, incluso incluyendo versiones 
      m&aacute;s modernas.

    <sect1>
      <heading>&iquest;C&oacute;mo accedo a la base de datos de Problem Report?</heading>

      <p>La base de datos de Problem Report puede ser consultada v&iacute;a 
      web a traves de la direcci&oacute;n
      <url url="http://www.freebsd.org/cgi/query-pr-summary.cgi"
      name="query">. Tambi&eacute;n pueden ser enviados v&iacute;a web a 
      trav&eacute;s de la direcci&oacute;n 
      <url url="http://www.freebsd.org/send-pr.html"
      name="envio">. El comando <em>send-pr(1)</em> tambi&eacute;n puede ser 
      usado para el env&iacute;o de reporte de problemas.

    <sect1>
      <heading>
       &iquest;D&oacute;nde puedo obtener versiones ASCII/PstScript de la FAQ?
      </heading>

      <p>La FAQ actualizada est&aacute; disponible en el servidor Web de 
      FreeBSD o en cualquiera de los mirrors en formato PostScript y texto 
      (7 bits ASCII y 8 bits Latin-1).

      <p>Formato PostScript (unos 370KB):
      <itemize>
        <item><url url="http://www.freebsd.org/FAQ/FAQ.ps"
               name="http://www.freebsd.org/FAQ/FAQ.ps">
      </itemize>

      <p>Formato ASCII (unos 220KB):
      <itemize>
         <item><url url="http://www.freebsd.org/FAQ/FAQ.ascii"
                name="http://www.freebsd.org/FAQ/FAQ.ascii">
      </itemize>

      <p>Formato texto ISO 8859-1 (unos 220KB):
      <itemize>
         <item><url url="http://www.freebsd.org/FAQ/FAQ.latin1"
                name="http://www.freebsd.org/FAQ/FAQ.latin1">
      </itemize>

    <sect1>
      <heading>&iquest;D&oacute;nde puedo obtener versiones ASCII/PostScript del Handbook?
      </heading>

      <p>El Hansbook actualizado est&aacute; disponible en el servidor Web de 
      FreeBSD o en cualquiera de los mirrors en formato PostScript y texto 
      (7 bits ASCII y 8 bits Latin-1).

      <p>Formato PostScript (unos 1.7MB):
      <itemize>
        <item><url url="http://www.freebsd.org/handbook/handbook.ps"
               name="http://www.freebsd.org/handbook/handbook.ps">
      </itemize>

      <p>Formato ASCII (unos 1080KB):
      <itemize>
         <item><url url="http://www.freebsd.org/handbook/handbook.ascii"
                name="http://www.freebsd.org/handbook/handbook.ascii">
      </itemize>

      <p>Formato texto ISO 8859-1 (unos 1080KB):
      <itemize>
         <item><url url="http://www.freebsd.org/handbook/handbook.latin1"
                name="http://www.freebsd.org/handbook/handbook.latin1">
      </itemize>  

    <sect1>
      <heading>El Handbook en ASCII no est&aacute; en texto plano!</heading>

      <p>Cierto, las versiones ASCII y Latin1 del Handbook no est&aacute;n 
      estrictamente en formato de texto plano; contienen car&aacute;cteres de
      control de impresi&oacute;n asumiendo que el documento ser&aacute; 
      enviado a una impresora. Si necesitas tenerlos en un formato leible, 
      pasa el fichero por el programa col:

      <verb>
          $ col -b < inputfile > outputfile
      </verb>

    <sect1>
      <heading>Me gustar&iacute;a ser Mirror del web de FreeBSD!</heading>

      <p>Hay m&uacute;ltiples maneras de hacer mirror de las p&aacute;ginas web.

      <itemize>
         <item>Usando CVSUP: Puedes obtener todo el contenido del web usando
         el programa CVSUP desde el servidor cvsup.freebsd.org. A&ntilde;ade 
         esta l&iacute;nea a tu fichero de configuraci&oacute;n de cvsup:

<verb>
www release=current hostname=/home base=/usr/local/etc/cvsup
prefix=/usr/local/www/data/www.freebsd.org delete old use-rel-suffix

</verb>

         <item>Usando rsync: Mira en <url url="http://www.freebsd.org/internal/mirror.html"
         name="la p&aacute;gina de mirrors"> para m&aacute;s informaci&oacute;n.
         <item>Usando mirror de FTP: Puedes bajarte la copia de los contenidos
         del web usando tu herramienta favorita de mirror de FTP. Simplemente
         empieza en  ftp://ftp.freebsd.org/pub/FreeBSD/FreeBSD-current/www.
     </itemize>

    <sect1>
       <heading>Me gustar&iacute;a traducir la documentaci&oacute;n.</heading>
       <p>Bueno, no podemos pagar, pero quiz&aacute;s te enviemos un cd-rom o 
       una camiseta y a&ntilde;adiremos tu nombre en la secci&oacute;n 
       "Contributors" del Handbook si nos env&iacute;as una traducci&oacute;n 
       de la documentaci&oacute;n.

    <sect1>
      <heading>Otras fuentes de informaci&oacute;n.</heading>

      <p>Los siguientes grupos de news contienen temas relacionados con
      FreeBSD y sus usuarios:

      <itemize>
        <item><url url="news:comp.unix.bsd.freebsd.announce"
        name="comp.unix.bsd.freebsd.announce"> (moderada)

        <item><url url="news:comp.unix.bsd.freebsd.misc"
        name="comp.unix.bsd.freebsd.misc">

        <item><url url="comp.unix.bsd.misc" name="comp.unix.bsd.misc">
      </itemize>

      <p>Recursos Web:

      <itemize>
        <item>The <url url="http://www.freebsd.org/" name="FreeBSD Home Page">.

        <item><label id="pao">Si tienes un port&aacute;til asegurate de pasar 
        por <url url="http://www.jp.FreeBSD.org/PAO/"
        name="Tatsumi Hosokawa's Mobile Computing page"> .

        <item><label id="smp">Informaci&oacute;n sobre SMP (Symmetric
        MultiProcessing), <url
        url="http://www.freebsd.org/~fsmp/SMP/SMP.html"
        name="soporte de SMP">.

        <item><label id="multimedia">Informaci&oacute;n sobre aplicaciones <url
        url="http://www.freebsd.org/~faulkner/multimedia/mm.html"
        name="multimedia">. Si est&aacute;s interesado espec&iacute;ficamente 
        en el chip <url url="http://www.freebsd.org/~ahasty/Bt848.html"
        name="Bt848"> de v&iacute;deo captura, entonces sigue este link
      </itemize>

      <p>El FreeBSD handbook tiene una completa bibliograf&iacute;a en la 
      secci&oacute;n <url url="../../handbook/bibliography.html" 
      name="bibliograf&iacute;a">
      la cual recomendamos leer si est&aacute;s interesado en comprar libros
      actuales relacionados con estos temas.

  </sect>

