<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/internal/bylaws.sgml,v 1.4 2004/10/06 14:12:50 stephane Exp $">
<!ENTITY title "R&egrave;gles &eacute;tablies par l'&eacute;quipe principale">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.5

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
  Version francaise (mise a jour) : Antoine Brodin <antoine.brodin@laposte.net>
-->

<html>
&header;

    <p>Ces r&egrave;gles ont &eacute;t&eacute; approuv&eacute;es par un vote des participants actifs ("committers") le
      28 Ao&ucirc;t 2000.</p>

    <ul>
      <li>Les participants actifs doivent avoir apport&eacute;s au moins une modification aux sources dans les 12 derniers
	mois.</li>

      <li>L'&eacute;quipe principale est compos&eacute;e de 9 participants actifs &eacute;lus.</li>

      <li>L'&eacute;lection de l'&eacute;quipe principale a lieu tous les 2 ans, la premi&egrave;re s'&eacute;tant tenue en Septembre 2000.</li>

      <li>Les membres de l'&eacute;quipe principale ainsi que les participants actifs peuvent &ecirc;tre exclus par un vote des 2/3 de l'&eacute;quipe principale.</li>

      <li>Si le nombre de membres de l'&eacute;quipe principale devient inf&eacute;rieur &agrave; 7, une &eacute;lection anticip&eacute;e est organis&eacute;e.</li>

      <li>Une p&eacute;tition d'un tiers des participants actifs peut provoquer une &eacute;lection
	anticip&eacute;e.</li>

      <li>Toutes les &eacute;lections se d&eacute;roulent de la fa&ccedil;on suivante :

	<ul>
	  <li>L'&eacute;quipe principale d&eacute;signe une personne charg&eacute;e d'organiser l'&eacute;lection.</li>

	  <li>1 semaine pour &eacute;tablir la liste des participants actifs qui souhaitent &ecirc;tre candidat.</li>

	  <li>4 semaines pour le vote</li>

	  <li>1 semaine pour comptabiliser les votes et communiquer les r&eacute;sultats.</li>

	  <li>Chaque participant actif peut voter une seule fois pour soutenir jusqu'&agrave; neuf candidats.</li>

	  <li>La nouvelle &eacute;quipe principale devient effective 1 semaine apr&egrave;s la communication
	    des r&eacute;sultats.</li>

	  <li>Les cas d'&eacute;galit&eacute;s sont d&eacute;partag&eacute;s par les membres de la nouvelle &eacute;quipe principale qui ont &eacute;t&eacute; &eacute;lus
	    sans ambigu&iuml;t&eacute;s.</li>
	</ul>
      </li>

	<li>Ces r&egrave;gles peuvent &ecirc;tre chang&eacute;es &agrave; la majorit&eacute; des 2/3 des participants actifs si
	au moins 50% des participants actifs votent.</li>
    </ul>

<h2>Information compl&eacute;mentaire</h2>

    <p>La derni&egrave;re &eacute;lection de l'&eacute;quipe principale s'est tenue en juin 2004. La prochaine
      est pr&eacute;vue pour juin 2006.</p>

<h2>Interpr&eacute;tations des r&egrave;gles par l'&eacute;quipe principale</h2>

    <p>L'&eacute;quipe principale donnera de temps &agrave; autre des interpr&eacute;tations de ces r&egrave;gles
      afin de clarifier les points qui pourraient &ecirc;tre ambigus
      de mani&egrave;re &agrave; assurer un fonctionnement sans probl&egrave;me du projet.</p>
    <ul>
      <li><b>03/05/2002</b> La prochaine &eacute;lection est toujours pr&eacute;vue 2 ans
         apr&egrave;s la pr&eacute;c&eacute;dente &eacute;lection. Cela signifie qu'une &eacute;lection anticip&eacute;e
         remets &agrave; z&eacute;ro la date de l'&eacute;lection suivante de mani&egrave;re &agrave; ce qu'elle
         se d&eacute;roule deux ans apr&egrave;s l'&eacute;lection anticip&eacute;e.</li>
    </ul>

    <A HREF="developer.html">Ressources pour les participants &agrave; FreeBSD - Accueil</a>
    &footer;

  </body>
</html>
