<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/internal/new-account.sgml,v 1.4 2004/01/06 17:31:41 stephane Exp $">
<!ENTITY title "Proc&eacute;dure de cr&eacute;ation d'un nouveau compte">
<!ENTITY % navincludes SYSTEM "../includes.navdocs.sgml"> %navincludes;
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.5

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
  &header;

  <h2>Proposer un nouveau committer</h2>

  <p>Si vous d&eacute;sirez proposer un nouveau committer, vous devez envoyer les informations
    suivantes &agrave; l'entit&eacute; appropri&eacute;e :
  </p>
  <ul>
    <li>Les ant&eacute;c&eacute;dents (en rapport avec FreeBSD) de la personne
      propos&eacute;e. Ce <em>n'est pas</em> facultatif; c'est devenu
      une pratique courante ces derni&eacute;res ann&eacute;es.</li>
    <li>Le nom de la personne se portant volontaire pour devenir le mentor du nouveau
      committer.</li>
    <li>L'adresse &eacute;lectronique de la personne propos&eacute;e (trop souvent
      oubli&eacute;e).</li>
  </ul>

  <p>Les parties responsables de cette proc&eacute;dure sont :</p>
  <ul>
    <li>src --&gt; core@</li>
    <li>doc --&gt; doceng@</li>
    <li>ports --&gt; portmgr@</li>
  </ul>

  <p>Vous recevrez un AR apr&egrave;s que le message ait &eacute;t&eacute; vu, et core@ et
    doceng@ vous donneront une r&eacute;ponse en &lt;= 7 jours. Leur d&eacute;lai d'expiration
    est fix&eacute; &agrave; 7 jours. Portmgr@ peut avoir besoin de plus de temps pour prendre
    une d&eacute;cision. Si le vote se finit plus t&ocirc;t, la personne ayant propos&eacute;
    le nouveau committer et celui-ci sont inform&eacute;s du r&eacute;sultat plus t&ocirc;t.</p>

  <h2>Autorisation d'un nouveau compte</h2>

  <p>Une personne de la liste ci-dessous envoie un courrier &eacute;lectronique sign&eacute; en PGP &agrave;
    l'adresse admins@FreeBSD.org, &agrave; la personne d&eacute;sign&eacute;e comme mentor du nouveau
    participant et en copie &agrave; l'adresse core@FreeBSD.org pour confirmation de l'approbation
    du nouveau compte. Ce courrier &eacute;lectronique doit inclure un lien vers ce document
    afin que le mentor/le nouveau participant sachent ce qu'ils doivent faire.</p>

  <p>L'approbation d'un nouveau compte est uniquement valide &agrave; partir de ces entit&eacute;s PGP :</p>

  <ul>
    <li><p>core-secretary</p></li>
    <li><p>portmgr</p></li>
    <li><p>doceng</p></li>
  </ul>

  <p><i>NOTE : les demandes de nouveau compte faites par quiconque en dehors de ces
    entit&eacute;s ou les demandes sign&eacute;es avec d'autres clefs PGP
    ne seront pas accept&eacute;es. Il n'y a aucune exception.</i></p>

  <h2>Informations &agrave; fournir par le nouveau participant</h2>

  <p>La personne d&eacute;sign&eacute;e comme mentor du nouveau committer doit demander
    puis envoyer les informations suivantes &agrave; l'adresse admins@FreeBSD.org :</p>

  <ul>
    <li><p>la ligne <tt>master.passwd</tt> contenant le nom d'utilisateur d&eacute;sir&eacute;,
      le shell et les informations GECOS (aucun mot de passe n'est n&eacute;cessaire)</p></li>
    <li><p>la clef publique ssh V2 (<strong>version 2 UNIQUEMENT</strong>)</p></li>
    <li><p>la clef PGP du nouveau participant (pour la r&eacute;activation du compte ou d'autres t&acirc;ches
      qui n&eacute;cessiteraient une identification s&ucirc;re du participant)</p></li>
  </ul>

  <h2>admins@FreeBSD.org cr&eacute;&eacute; le nouveau compte</h2>

  <p>admins@FreeBSD.org cr&eacute;&eacute; le nouveau compte &agrave; partir des
    informations donn&eacute;es sur le cluster FreeBSD.org et en informe le mentor et
    le nouveau committer.</p>

  <h2>Le mentor active les droits de commit du nouveau participant</h2>

  <p>Apr&egrave;s que le nouveau participant ait confirm&eacute; que son compte fonctionne, le mentor
    active ses droits de commit et le guide dans la
    suite du processus.</p>

  &footer;

  </body>
</html>
