<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/fr/internal/new-account.sgml,v 1.7 2006/01/21 15:32:01 blackend Exp $">
<!ENTITY title "Proc&eacute;dure de cr&eacute;ation d'un nouveau compte">
<!ENTITY % navinclude.docs "INCLUDE">
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.15

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
  &header;

  <h2>Proposer un nouveau committer</h2>

  <p>Si vous d&eacute;sirez proposer un nouveau committer, vous devez envoyer les informations
    suivantes &agrave; l'entit&eacute; appropri&eacute;e :
  </p>
  <ul>
    <li>Les ant&eacute;c&eacute;dents (en rapport avec FreeBSD) de la personne
      propos&eacute;e. Ce <em>n'est pas</em> facultatif; c'est devenu
      une pratique courante ces derni&eacute;res ann&eacute;es.</li>
    <li>Le nom de la personne se portant volontaire pour devenir le mentor du nouveau
      committer.</li>
    <li>L'adresse &eacute;lectronique de la personne propos&eacute;e (trop souvent
      oubli&eacute;e).</li>
  </ul>

  <p>Toute proposition de nouveau committer ne respectant pas les
    r&egrave;gles d&eacute;crites ci-dessous sera retard&eacute;e (au
    mieux) ou vous rapporterons de mauvaises vibrations de
    l'&eacute;quipe respective/du secr&eacute;taire de
    l'&eacute;quipe.</p>

  <p>Les parties responsables de cette proc&eacute;dure sont :</p>
  <ul>
    <li>src --&gt; core@</li>
    <li>doc --&gt; doceng@</li>
    <li>ports --&gt; portmgr@</li>
  </ul>

  <p>Vous recevrez un AR apr&egrave;s que le message ait &eacute;t&eacute; vu, et core@ et
    doceng@ vous donneront une r&eacute;ponse en &lt;= 7 jours. Leur d&eacute;lai d'expiration
    est fix&eacute; &agrave; 7 jours.  Le d&eacute;lai pour portmgr@ est de 14 jours.
    Si le vote se finit plus t&ocirc;t, la personne ayant propos&eacute;
    le nouveau committer et celui-ci sont inform&eacute;s du r&eacute;sultat plus t&ocirc;t.</p>

  <h2>Autorisation d'un nouveau compte</h2>

  <p>Une personne de la liste ci-dessous envoie un courrier &eacute;lectronique sign&eacute; en PGP &agrave;
    l'adresse admins@FreeBSD.org, &agrave; la personne d&eacute;sign&eacute;e comme mentor du nouveau
    participant et en copie &agrave; l'adresse core@FreeBSD.org pour confirmation de l'approbation
    du nouveau compte. Ce courrier &eacute;lectronique doit inclure un lien vers ce document
    afin que le mentor/le nouveau participant sachent ce qu'ils doivent faire.</p>

  <p>L'approbation d'un nouveau compte est uniquement valide &agrave; partir de ces entit&eacute;s PGP :</p>

  <ul>
    <li><p>core-secretary</p></li>
    <li><p>portmgr-secretary</p></li>
    <li><p>doceng</p></li>
  </ul>

  <p><i>NOTE : les demandes de nouveau compte faites par quiconque en dehors de ces
    entit&eacute;s ou les demandes sign&eacute;es avec d'autres clefs PGP
    ne seront pas accept&eacute;es. Il n'y a aucune exception.  En cas
    d'un nouveau committer ports ou doc le courrier de demande de
    compte doit &ecirc;tre faite avec core en copie.</i></p>

  <h2>Informations &agrave; fournir par le mentor</h2>

  <p>La personne d&eacute;sign&eacute;e comme mentor du nouveau committer doit demander
    puis envoyer les informations suivantes &agrave; l'adresse admins@FreeBSD.org :</p>

  <ul>
    <li><p>la ligne <tt>master.passwd</tt> contenant le nom d'utilisateur d&eacute;sir&eacute;,
      le shell et les informations GECOS (aucun mot de passe n'est n&eacute;cessaire)</p></li>
    <li><p>la clef publique ssh V2 (<strong>version 2 UNIQUEMENT</strong>)</p></li>
  </ul>

  <p>Le mentor est charg&eacute; d'obtenir ces informations du nouveau
    committer de mani&egrave;re s&eacute;curis&eacute;e, et de les
    fournir &agrave; admins@ d'une mani&egrave;re
    s&eacute;curis&eacute;e.  Un courrier &eacute;lectronique
    sign&eacute; avec PGP, avec la cl&eacute; publique du mentor
    d&eacute;j&agrave; comprise dans le manuel, est la m&eacute;thode
    pr&eacute;f&eacute;r&eacute;e pour que le mentor envoie ces
    informations &agrave; admins@.  Si ceci est impossible pour une
    raison ou pour une autre, un substitut acceptable est que le
    mentor place les informations du compte dans son r&eacute;pertoire
    personnel sur freefall et de dire &agrave; admins@ o&ugrave; les
    trouver.  Nous devons nous assurer que les informations
    proviennent vraiment du mentor et un courrier non sign&eacute;
    n'est pas suffisant de nos jours.  Puisque admins@ ne peut rien
    v&eacute;rifier sur le nouveau committer ces informations doivent
    &ecirc;tre envoy&eacute;es &agrave; admins@ par le mentor, et non
    par le nouveau committer.</p>

  <h2>admins@FreeBSD.org cr&eacute;&eacute; le nouveau compte</h2>

  <p>admins@FreeBSD.org cr&eacute;&eacute; le nouveau compte &agrave; partir des
    informations donn&eacute;es sur le cluster FreeBSD.org et en informe le mentor et
    le nouveau committer.</p>

  <h2>Le mentor active les droits de commit du nouveau participant</h2>

  <p>Apr&egrave;s que le nouveau participant ait confirm&eacute; que son compte fonctionne, le mentor
    active ses droits de commit et le guide dans la
    suite du processus.</p>

  <h2>Fin du mentorat</h2>

  <p>Il n'y a pas de dur&eacute;e pr&eacute;d&eacute;termin&eacute;e
    pour un mentorat.  Une fois que le mentor juge que le nouveau est
    pr&ecirc;t &agrave; voler de ses propres ailes, le mentor en fait
    part &agrave; la communaut&eacute; des d&eacute;veloppeurs avec un
    commit forc&eacute; sur <tt>access</tt> avec un message de commit
    appropri&eacute;.</p>

  <h2>Transfert de mentorat</h2>

  <p>Si le besoin d'un transfert de mentorat pour un committer se fait
    sentir veuillez contacter par courrier &eacute;lectronique la
    partie responsable, comme pour la proposition d'un nouveau compte.
    Typiquement cette demande est accept&eacute;e telle quelle.  Un
    commit forc&eacute; sur <tt>access</tt> avec un message de commit
    appropri&eacute; doit informer tout le monde de ce transfert.</p>

  &footer;

  </body>
</html>
