freebsd/freebsd-doc/ja_JP.eucJP/man/man6/phantasia.6
.\" %FreeBSD: src/games/phantasia/phantasia.6,v 1.5.2.1 1999/08/29 14:22:59 peter Exp %
.\" jpman %Id: phantasia.6,v 1.4 1999/01/16 17:12:13 kuma Stab %
.\"
.de sh
.br
.ne 5
.PP
\fB\\$1\fR
.PP
..
.TH PHANTASIA 6 "June 1, 1994"
.UC 4
.SH 名称
phantasia \- ターミナル間ファンタジーゲーム
.SH 書式
phantasia [ \-HSabmpsx ]
.SH 解説
.I phantasia
はロールプレイングゲームであり、
プレイヤは様々なタイプのキャラクタを演じ、
モンスターや他のプレイヤと闘います。
キャラクタの成長はモンスター(や他のプレイヤ)との戦闘から得る経験値に依ります。
.PP
ゲームのほとんどはメニュー形式で進み、
(多少の差はありますが)読めば分るだけの解説がなされます。
スクリーンはカーソルにて更新されますので、
.B TERM
環境変数を設定してください。
.PP
このゲームでは、オプションがさまざまな機能を提供します。
以下にそれぞれを示します:
.PP
.TP .5i
.B \-s
ヘッダ情報無しで
.I phantasia
を起動します。
.TP .5i
.B \-m
モンスター一覧を得ます。
.TP .5i
.B \-a
ファイル上の全キャラクタ名一覧を得ます。
.TP .5i
.B \-x
ファイル上の特定キャラクタを検査/変更します。
.TP .5i
.B \-H
ヘッダのみを表示します。
.TP .5i
.B \-p
古いキャラクタを抹消します。
.TP .5i
.B \-b
ログイン毎のトップキャラクタのスコアボードを表示します。
.TP .5i
.B \-S
許されている場合、ウィザードオプションを有効にします。
``root'' でこのコマンドを実行する場合です。
.PP
プレイヤ間で対話的なゲームとするため、
キャラクタは一つの共通ファイルに保存されます。
後でキャラクタを取り出すために、
キャラクタごとにパスワードが与えられます。
.B レベル
0 を越えたキャラクタのみ保存可能です。
しばらく使用していないキャラクタは抹消されます。
キャラクタが死ぬと、スコアボードに名前が残るのみです。
.SH 作者
Edward Estes, AT&T Information Systems, Skokie, IL
.SH 詳細
.sh "通常プレイ"
プレイヤにとって重要な特性情報はほぼ常にスクリーン上に表示されます。
この際、(最大値があるならば) 最大値も併せて括弧内に表示します。
.PP
キャラクタはデカルト座標系の中央付近にランダムに置かれます。
ほとんどのコマンドは一文字の英数字で指定できます。
例えば、`W', `S', `N', 'E' を押すことで移動できます
(このゲームは大文字小文字を区別しませんので、小文字も使用可能です)。
また
.IR vi (1)
のように、'H', 'J', 'K', 'L' にて移動することもできます。
特定の (x,y) 座標位置に移動するためには、
.B 移動 (move)
('1') コマンドを使用します。
キャラクタが移動可能な距離は、1 + 1.5 ×
.B レベル
で計算されます。
方角で指定した場合、プレイヤはその方向に移動できる最大距離だけ移動します。
.PP
プレイヤは他にどんなプレイヤがいるのかを
.B プレイヤ (players)
('2') オプションを使用して知ることができます。
自己と原点との距離と同じ、
もしくはより近い距離にいるプレイヤを見ることが可能です。
.B 王
と
.B 賢人会議メンバー
は全員を見ることが可能ですし、全員から見られます。
.B パランティア
はこれらの制約を除外します。
.PP
他のプレイヤと会話するには
.B 会話 (talk)
('3') オプションを使用します。
一般的に、会話は一行程のテキストです。
現在のメッセージを取り除くには、
メッセージ入力のプロンプトに対して<改行> を押してください。
.PP
.B 状態 (stats)
('4') オプションはプレイヤの更なる特性値を表示します。
.PP
.B 終了 (quit)
('5') オプションにてゲームをやめることができます。
.PP
デフォルトで休むことが可能です。
休むと、最大の
.B エネルギーレベル
を再獲得し、
.B マナ
を得ます
(レベルが高くなり、原点から離れれば、それだけ多くの
.B マナ
を得ることになります)。
.PP
モンスターを呼ぶには、'9' か 'C' を押します。
.PP
他のプレイヤを調べるには 'X' を押します。
.PP
割り込みキーを押すことにより、終了したり、サブシェルを実行可能です。
戦闘中に中断すると死にます。この理由は明かです。
.PP
プレイヤの
.B レベル (level)
と
.B 魔力 (magic)
が上昇するかゲーム上での他の地位(
.B バラー、賢人会議、王
)に就任すると、別のオプションをいくつか使用することが
できるようになります。
これらについては項を改めて説明します。
一般的にコントロール L でスクリーンを再描画します。
.PP
他に起り得る事柄は、多少の差はあれ自明でしょう。
.sh "モンスターとの戦い"
モンスターとの戦闘中にプレイヤが使えるオプションがいくつかあります。
以下に示します:
.TP 1.5i
.B 混戦 (melee)
.B 強さ
を基に、モンスターにダメージを加えます。
また、モンスターの
.B 強さ
をいくらか減らします。
.TP 1.5i
.B 小競合 (skirmish)
.B 混戦
よりは与えるダメージは少ないですが、その代わりに、モンスターの
.B 素早さ
を減らします。
.TP 1.5i
.B 回避 (evade)
逃走を試みます。成功率はプレイヤとモンスターの
.B 知能
と
.B 素早さ
に依ります。
.TP 1.5i
.B 呪文 (spell)
呪文を投げるいくつかのオプション(別の場所で記述します)。
.TP 1.5i
.B 切り刻み (nick)
モンスターにプレイヤの
.B 剣
の値プラス1の打撃を与え、
プレイヤにモンスターの
.B 経験値
の 10% を与えます。
モンスターの
.B 経験値
を、得た値に応じて減らします。
また、モンスターの素早さを増します。
麻痺したモンスターは切り刻まれると非常に素早く起き上がります。
.TP 1.5i
.B 運試し (luckout)
本質的にモンスターとの智恵比べです。成功率はプレイヤとモンスターの
.B 知能
に依ります。
モンスターを倒すことに成功すると、プレイヤは名声 (credit) を得ます。
失敗するとなにも起りません。
.B 運試し
の機会が失われるだけです。
.sh "キャラクタの状態"
.TP 1.5i
.B 強さ (strength)
キャラクタが与えるダメージを決定します。
.TP 1.5i
.B 素早さ (quickness)
戦闘中、キャラクタが何回意思決定を行なう機会があるかを決定します。
.TP 1.5i
.B エネルギーレベル (energy level)
キャラクタが死ぬまでにどれほどのダメージに耐えるかを決定します。
.TP 1.5i
.B 魔法レベル (magic level)
キャラクタが投げられる呪文とその効果を決定します。
.TP 1.5i
.B 知能 (brains)
基本的にキャラクタの知性です;
種々の戦闘オプションと呪文で使用されます。
.TP 1.5i
.B マナ (mana)
呪文を投げる際の力の源として使用されます。
.TP 1.5i
.B 経験値 (experience)
モンスターや他のキャラクタと戦うことにより得られます。
.TP 1.5i
.B level (レベル)
キャラクタがどれだけの経験を積んだかを示します;
.B 経験値
の増加に応じて幾何的に増加します。
.TP 1.5i
.B 毒 (poison)
キャラクタの能力を低下させる病気です (
.B エネルギーレベル
と
.B 強さ
に影響します)。
.TP 1.5i
.B 罪 (sin)
キャラクタが悪事を行なうと累積されます;
通常のゲーム中ではめったに使用されません。
.TP 1.5i
.B 年齢 (age)
プレイヤの年齢; ターン数におおよそ等しいです。
.B 年齢
が増加すると、キャラクタの能力の多くが低下します。
.sh "キャラクタのタイプ"
キャラクタの特性情報は、キャラクタタイプに依存して、
上記リストからランダムに振られます。
タイプは以下のものがあります:
.TP 1.5i
.B 魔法使い (magic user)
.B 魔法レベル
と
.B 知能
が強いですが、他は弱いです。
生き延びるには、智恵と魔法に頼る必要があります。
.TP 1.5i
.B 戦士 (fighter)
.B 強さ
と
.B エネルギーレベル
が良好ですが、他もまあまあ良好です。
よく装備された戦士となります。
.TP 1.5i
.B エルフ (elf)
非常に高い
.B 素早さ
と平均以上の
.B 魔法レベル
は
.B エルフ
のセールスポイントです。
.TP 1.5i
.B ドワーフ (dwarf)
非常に高い
.B 強さ
と
.B エネルギーレベル
を持ちますが、比較的遅く、あまり賢くない傾向があります。
.TP 1.5i
.B ハーフリング (halfling)
比較的素早くて賢く、高い
.B エネルギーレベル
を持ちますが、
.B 魔法
と
.B 強さ
は貧弱です。
いくばくかの
.B 経験値
を持って誕生します。
.TP 1.5i
.B experimento 
全領域において、まさに並です。しかし、
.B experimento
は遊戯座標領域のいずれの領域にも置かれ得ます。
.PP
開始時の能力値の範囲を以下の表にまとめます。
.PP
.TS
l c c c c c c
l c c c c c c.
タイプ	強さ	素早さ	マナ	エネルギー	知能	魔法
_
魔法使い	10-15	30-35	50-100	30-45	60-85	5-9
戦士	40-55	30-35	30-50	45-70	25-45	3-6
エルフ	35-45	32-38	45-90	30-50	40-65	4-7
ドワーフ	50-70	25-30	25-45	60-100	20-40	2-5
ハーフリング	20-25	34	25-45	55-90	40-75	1-4
Experimento	25	27	100	35	25	2
.TE
.PP
開始時の能力特性がキャラクタタイプによって異なるのみならず、
キャラクタの
.B レベル
が上昇するごとに得られる能力特性の成長速度も
キャラクタタイプによって異なります。
.B experimento
の特性成長は他のタイプのいずれかからランダムに選ばれます。
.B レベル
が1上昇する際のキャラクタの成長を以下の表にまとめます。
.PP
.TS
l c c c c c
l n n n n n.
タイプ	強さ	マナ	エネルギー	知能	魔法
_
魔法使い	2.0	75	20	6	2.75
戦士	3.0	40	30	3.0	1.5
エルフ	2.5	65	25	4.0	2.0
ドワーフ	5	30	35	2.5	1
ハーフリング	2.0	30	30	4.5	1
.TE
.PP
プレイヤが運べる金の量、
.B 指輪
がプレイヤを支配するまでの期間、
プレイヤが耐えられる
.B 毒
の量もまた、キャラクタタイプにより決まります。
.sh "呪文"
ゲームを進めてゆく中で、プレイヤは魔力を鍛えることができます。
機会を以下に示します。
.TP 1.5i
.B クローク (cloak)
.I 必要魔法レベル:
20 (そしてレベル 7)
.br
.I 使用マナ:
35 マナ プラス 3 マナ(1休憩期間ごとに)
.br
通常プレイで使用。モンスターがキャラクタを発見することを防ぎ、
他のプレイヤからも隠します。
他のプレイヤが
.B プレイヤ
オプションで見ると、そのプレイヤの座標は '?' と見えます。
クロークされているプレイヤは
.B マナ
を集めることも、交易所をみつけることも、
.B 聖杯
を探すこともできません。
モンスターを呼んだり、クローク中にこのオプションを選択すると、
クロークは解除されます。
.br
.TP 1.5i
.B テレポート (teleport)
.I 必要魔法レベル:
40 (そしてレベル 12)
.br
.I 使用マナ:
30 マナ / 75 移動ごとに
.br
通常プレイで使用。
マナを使用することにより、
.B 移動
オプションよりもはるかに自由な移動をプレイヤが行えるようになります。
最大移動可能距離は、
.B レベル
と
.B 魔法レベル
に依存します。
.TP 1.5i
.B パワーブラスト (power blast)
.I 必要魔法レベル:
無し
.br
.I 使用マナ:
5 ×
.B レベル
.br
ターミナル間戦闘で使用。
ダメージは
.B 魔法レベル
と
.B 強さ
に依存します。
通常の打撃よりもあたりにくいです。
.TP 1.5i
.B 全てか無か (all or nothing)
.I 必要魔法レベル:
無し
.br
.I 使用マナ:
1
.br
モンスターとの戦闘で使用。
動作確率は 25% です。
動作すると、モンスターを殺すだけの打撃を与えます。
失敗すると、モンスターには打撃を与えず、
モンスターの
.B 素早さ
と
.B 強さ
を倍にします。
麻痺したモンスターは、この呪文の結果、より素早く起きます。
.TP 1.5i
.B 魔法の雷撃 (magic bolt)
.I 必要魔法レベル:
5
.br
.I 使用マナ:
可変
.br
モンスターとの戦闘で使用。
モンスターへの打撃は、費した
.B マナ
と
.B 魔法レベル
に依存します。
.B マナ
あたり最低 10 の打撃を与えられることが保証されています。
.TP 1.5i
.B 力場 (force field)
.I 必要魔法レベル:
15
.br
.I 使用マナ:
30
.br
モンスターとの戦闘で使用。
ダメージから守る盾を急造します。
盾は実際のエネルギーレベルに加えられるもので、固定値であり、
最大エネルギーに依存します。
通常、ダメージはまず盾に与えられ、
その後プレイヤの実際の
.B エネルギーレベル
に与えられます。
.TP 1.5i
.B 変身 (transform)
.I 必要魔法レベル:
25
.br
.I 使用マナ:
50
.br
モンスターとの戦闘で使用。
モンスターを、
モンスターファイルの 100 のモンスターのうちの一つにランダムに変身させます。
.TP 1.5i
.B 力の増加 (increase might)
.I 必要魔法レベル:
35
.br
.I 使用マナ:
75
.br
モンスターとの戦闘で使用。
強さを最大まで上昇させます。
.TP 1.5i
.B 不可視 (invisibility)
.I 必要魔法レベル:
45
.br
.I 使用マナ:
90
.br
モンスターとの戦闘で使用。
一時的にプレイヤの
.B 素早さ
を増し、モンスターの攻撃があたりにくくします。
この呪文は複数回使用することが可能ですが、いつかは最大レベルに達します。
.TP 1.5i
.B 移送 (transport)
.I 必要魔法レベル:
60
.br
.I 使用マナ:
125
.br
モンスターとの戦闘で使用。
プレイヤの居る場所からモンスターを遠くへ移動します。
成功率はプレイヤの
.B 魔法
と
.B 知能
およびモンスターの
.B 経験値
に依存します。
失敗した場合にはプレイヤが代りに移動されます。
60% の確率でモンスターは持っていた宝物を置いていきます。
.TP 1.5i
.B 麻痺 (paralyze)
.I 必要魔法レベル:
75
.br
.I 使用マナ:
150
.br
モンスターとの戦闘で使用。
モンスターの
.B 素早さ
を少し負にすることで、モンスターを「凍らせ」ます。
モンスターはゆっくりと起きます。
成功率はプレイヤの
.B 魔法
とモンスターの
.B 経験値
に依存します。
失敗すると何もおきません。
.TP 1.5i
.B 指定 (specify)
.I 必要魔法レベル:
無し
.br
.I 使用マナ:
1000
.br
モンスターとの戦闘において、
.B バラー
もしくは
.B 賢人会議
が使用。
プレイヤが戦うモンスターを選択できるようになります。
.sh "モンスター"
原点 (0,0) から遠くに行くほどモンスターは大きくなります。
原点から 125 の距離の輪が大きさを決定します。
モンスターの
.B 経験値、エネルギーレベル、知能
は、大きさをかけたものになります。
.B 強さ
は、1 を越える大きさごとに 50% 増します。
.B 素早さ
は、大きにかかわらず同一です。
.PP
また、原点を離れるほど、悪いモンスターにでくわします。
モンスターは群れているかもしれません。
群れている確率のパーセントは、モンスターリストの
.B flock%
に書いてあります。
最初の輪より外に居るモンスターは宝物を持っているかもしれません。
これは各モンスターの宝物タイプにより決定されます。
群れているモンスターおよび大きいモンスターは、
宝物を持っている確率が高いです。
.PP
特殊能力を持つモンスターも居ます; 以下に示します:
.TP 1.5i
.B Unicorn
プレイヤが
.B 処女
を所持している時のみ征服可能です。
.TP 1.5i
.B Modnar
ランダムな特性を持ちます。これは宝物タイプも同様です。
.TP 1.5i
.B Mimic
モンスターリスト中の他の名前を取り、混乱させます。
.TP 1.5i
.B Dark Lord
とても悪い奴です。
打撃はほとんど当たりません (特に nick) し、
呪文はうまく作用しません (またはまったく作用しません)。
.B Dark Lord.
からは、常に
.B 回避
可能です。
.TP 1.5i
.B Leanan-Sidhe
これもとても悪い奴です。彼女は永続的に
.B 強さ
を抜き取ります。
.TP 1.5i
.B Saruman
.B パランティア
を盗む
.B Wormtongue
と伴に彷っています。
また、
.B Saruman
はプレイヤの宝石を金に変えたり、
プレイヤの状態をごちゃまぜにすることがあります。
.TP 1.5i
.B Thaumaturgist
プレイヤを移送可能です。
.TP 1.5i
.B Balrog
.B エネルギー
ではなく
.B 経験値
を奪うことでダメージを与えます。
.TP 1.5i
.B Vortex
.B マナ
を奪います。
.TP 1.5i
.B Nazgul
.B 指輪
を盗もうとしたり、
.B 知能
の一部を中和しようとします。
.TP 1.5i
.B Tiamat
プレイヤの
.B 金
と
.B 宝石
の半分を奪って逃げようとします。
.TP 1.5i
.B Kobold
意地悪く金を一かけら盗み逃げようとします。
.TP 1.5i
.B Shelob
噛んで、
.B 毒
と同じ被害を与えます。
.TP 1.5i
.B Assorted Faeries
.B 聖水
を所持するものを攻撃すると、これらは死にます。
これらには
.B Cluricaun, Fir Darrig, Fachan,
.B Ghille Dhu, Bogle, Killmoulis,
.B Bwca
が含まれます。
.TP 1.5i
.B Lamprey
噛んで、
.B 毒
の 1/2 のダメージを与えます。
.TP 1.5i
.B Shrieker
拾うと、(より大きな) 仲間を呼びます。
.TP 1.5i
.B Bonnacon
戦いに飽き、放屁して逃げます。
.TP 1.5i
.B Smeagol
機会があれば、プレイヤから
.B 指輪
を盗もうとします。
.TP 1.5i
.B Succubus
.B 力場
を越えてダメージを与えることがあります。
プレイヤが展開している盾に対してでなく、
.B エネルギーレベル
にダメージを与えます。
これにより、容易に死に至ります。
.TP 1.5i
.B Cerberus
金属が好きで、可能であればプレイヤから金属の宝物を盗みます。
.TP 1.5i
.B Ungoliant
噛んで毒を与えます。
.B 毒
5 つ分の被害があり、プレイヤの
.B 素早さ
を 1 減らします。
.TP 1.5i
.B Jabberwock
戦いに疲れると、友人 (
.B Jubjub Bird
または
.B Bandersnatch
) を呼んだ後で逃げます。
.TP 1.5i
.B Morgoth
実際には
.B Modnar
ですが、
.B 賢人会議、バラー、
.B 前バラー
のために予約されています。
.B Morgoth
との戦闘は、彼かプレイヤのいずれかが死ぬまで終わりません。
彼の特質はプレイヤの特質をもとに計算されます。
プレイヤは彼と同盟する機会が与えられます。
.B 力場
以外の魔法は、
.B Morgoth
との戦闘中は作用しません。
.TP 1.5i
.B Troll
戦闘中に
.B エネルギー
と
.B 強さ
が再生することがあります。
.TP 1.5i
.B Wraith
プレイヤの目を見えなくすることがあります。
.sh "宝物"
様々な宝物のタイプを以下に示します:
.TP 1.5i
.B タイプ 0
.I 無し
.TP 1.5i
.B タイプ 1
.I パワーブースター (power booster)
\- マナを加えます。
.br
.I ドルイド (druid)
\- 経験を加えます。
.br
.I ホーリーオーブ (holy orb)
\- 罪を 0.25 減らします。
.TP 1.5i
.B タイプ 2
.I 護符 (amulet)
\- 呪われた宝物から身を守ります。
.br
.I 聖水 (holy water)
\-
.B assorted faeries
を殺します。
.br
.I 隠者 (hermit)
\- 罪を 25% 減じ、マナをいくらか増します。
.TP 1.5i
.B タイプ 3
.I 盾 (shield)
\- 最大の
.B エネルギーレベル
とします。
.br
.I 処女 (virgin)
\-
.B ユニコーン
を征服するのに使用したり、多くの
.B 経験
(そしていくつかの
.B 罪
)を得るために使用します。
.br
.I アセラス (athelas)
\-
.B 毒
を 1 減じます。
.TP 1.5i
.B  タイプ 4 (巻物)
.I 盾 (shield)
\- 通常の
.B 力場
より大きな力場を展開します。
.br
.I 不可視 (invisible)
\- 発見者の
.B 素早さ
を一時的に 1000,000 にします。
.br
.I 10 倍力 (ten fold strength)
\- 発見者の強さを 10 倍にします。
.br
.I モンスターの選択 (pick monster)
\- 発見者は次に戦うモンスターを選ぶことができます。
.br
.I 一般知識 (general knowledge)
\- 発見者の
.B 知能
と
.B 魔法レベル
を増加させます。
.PP
.B 一般知識
以外の巻物は、自動的にモンスターを呼びます。
既に効果がある呪文はそのままにしますが、戦闘の期間のみ効果があります。
.TP 1.5i
.B タイプ 5
.I 短剣 (dagger)
\- 
.B 強さ
を増加させます。
.br
.I 鎧 (armour)
\- 
.B 盾
と同じですが、盾より効果が大きいです。
.br
.I 石板 (tablet)
\- 
知能を増加させます。
.TP 1.5i
.B タイプ 6
.I 司祭 (priest)
\- 最大値まで回復させます;
.B マナ、知能
を増加させます;
.B 罪
を半分にします。
.br
.I ロビンフッド (Robin Hood)
\-
.B 盾
を増加させ、永続的に
.B 強さ
を増加させます。
.br
.I 斧 (axe)
\-
.B 短剣
と同様ですが、短剣より効果が大きいです。
.TP 1.5i
.B タイプ 7
.I 魅惑 (charm)
\- 呪われた宝物から守ります (
.B 護符
の前に使用した場合
);
.B Dark Lord
と戦う際に、
.B 祝福
と共に使用します。
.br
.I マーリン (Merlyn)
\-
.B 知能、魔法、マナ
を増加させます。
.br
.I ウォーハンマ (war hammer)
\-
.B 斧
と同様ですが、斧より効果が大きいです。
.TP 1.5i
.B タイプ 8
.I 癒し薬 (healing potion)
\-
.B 毒
を -2 にするか、
.B 毒
を 2 減じます。
より良い方の効果が採用されます。
.br
.I 移送機 (transporter)
\- 発見者をどこかに移送します。
.br
.I 剣 (sword)
\-
.B ウォーハンマ
と同様ですが、効果が大きいです。
.TP 1.5i
.B タイプ 9
.I 金の王冠 (golden crown)
\- (0,0) に移動することにより、プレイヤを
.B 王
にします。
.br
.I 祝福 (blessing)
\-
.B 罪
を 1/3 にし、
.B マナ
を加え、
最大まで休み、
.B 魅惑
と共に使用することで
.B Dark Lord
を殺します。所持者は全モンスターに最初の打撃を与えることができます。
.br
.I 素早さの銀 (quicksilver)
\-
.B 素早さ
を増加させます。
.TP 1.5i
.B タイプ 10
.I エルフのブーツ (elven boots)
\- 永続的に
.B 素早さ
を増加させます。
.TP 1.5i
.B タイプ 11
.I パランティア (palantir)
\- 他の全プレイヤを見ることができるようにします;
.B 賢人会議
が使用すると
.B 聖杯
を探すことができます。
.TP 1.5i
.B タイプ 12/13
.I 指輪 (ring)
\- 戦闘時に大きなダメージを与える等。
.PP
宝物タイプ 10-13 のモンスターはタイプ 9 の宝物を持つこともあります。
.PP
モンスターは
.B 金
または
.B 宝石
も持っていることもあります。
これらは
.B 交易所
で物を買うために使用します。
.B 宝石
の価値は金 1000 です。多くの
.B 金
を持っているとプレイヤは遅くなります。
プレイヤが持てる
.B 金
は 1000 + 200 ×
.B レベル
です。
.B 宝石
の重さは金の 1/2 です。
宝物タイプ 7 以上のモンスターは
.B 宝石
を持つことがあります。
.PP
宝物が呪われている確率は、宝物のタイプに依存します。
より価値がある宝物ほど呪われている確率が高いです。
呪われている宝物は
.B エネルギーレベル
を非常に低下させ、
.B 毒
に 0.25 を加えます。
.sh "指輪"
.B 指輪
は
.B nazguls
および
.B Dark Lord
のみが持っています。
指輪には 4 種類あります。
全ての
.B 指輪
はプレイヤを最大まで休ませ、
モンスターとの戦闘中、持ち主が相手に与える打撃を強くします (
.B 指輪
を戦闘に使用している場合を仮定)。
.PP
2 タイプの
.B 指輪
は呪われており、
.B nazguls
もしくは
.B Dark Lord
から得られます。
これらのタイプのものを数回使用すると、
プレイヤは
.B 指輪
の制御下におかれ、奇妙な出来事がランダムに起ります。
ときにはプレイヤは死に至り、そのプレイヤの名前が
モンスターファイルに登録されます。
.B 指輪
を使い切る前に死んだ場合でも、モンスターに変身させます。
.PP
残りの 2 タイプの
.B 指輪
は良性のものです。
.B nazgul
から得られるものは、
限られた回数の戦闘ラウンドで、
プレイヤが死んだ時に指輪を使っている場合、プレイヤを死から回復させます。
.B Dark Lord
から得られるものも同様ですが、使い切るということはありません。
.B 指輪
は誰かを死から回復させると消滅します。
一般的には、呪われている
.B 指輪
は通常のものよりもはるかに高い頻度で発生します。
通常は拾わない方が良いでしょう。
.B 指輪
を取り除くための唯一の方法は、モンスターに盗ませることです。
.sh "王"
プレイヤは
.I 王冠
を見つけ、(0,0) に移動することにより
.B 王
になります。
.I 王冠
を見つけるためには
.B レベル
が 10 から 1000 の範囲にある必要があります。
1 個以上の
.I 王冠
を持つプレイヤが
.B レベル
1000 になると、
.I 王冠
は
.I 金
になります。
.PP
プレイヤが一度王になると、王の部屋 (0,0)
に居る間は特別なことが出来るようになります。
これは
.B 布告 (decree)
('0') オプションで実行できます。
.TP 1.5i
.I 移送 (transport)
他のプレイヤに作用します。影響を受けるプレイヤをランダムに移動します。
.B 魅惑
は移送を防ぎます。
.TP 1.5i
.I 呪い (curse)
他のプレイヤに作用します。呪われている宝物と似ていますが、
より悪いです。2 の
.B 毒
の効果があり、
.B エネルギーレベル
を非常に低下させ、最大エネルギーを低下させます。
.B クローク
も取り去ります。
.B 祝福
は王の呪いを防ぎます。
.TP 1.5i
.I エネルギーの虚無 (energy void)
王は、好きなようにこれらを王国に広くばらまくことが可能です。
プレイヤが当たると、プレイヤは
.B マナ、エネルギー、金
を失います。
エネルギーの虚無は、打撃を受けた後、消滅します。
.TP 1.5i
.I 授与 (bestow)
これも他のプレイヤに作用します。王は、富 (
.B 金
) を複数の忠実な国民に報酬として分け与えることが可能です。
不要な荷物を捨てるための便利な方法と言うこともできますが。
.TP 1.5i
.I 徴税 (collect taxes)
全員が、所有する全
.B 金
と
.B 宝石
に対して 7% の税を支払います。これは
.B 王
の存在には無関係です。王はこのオプションで税を集めます。
.PP
.B 王
は、何も失うことなく、原点を始点として任意の場所に
.B テレポート
が可能です。
.sh "賢人会議、バラー"
.pl +0.5
プレイヤがレベル 3000 になると自動的に
.B 賢人会議
のメンバになります。賢人会議のメンバは
.B 指輪
を持てません。賢人会議メンバは実行可能なオプションが増えます。
実行には
.B 介入 (intervene)
('8') オプションを使用します。
.B 介入
オプションはどれも 1000 マナを消費します。
第一の
.B 介入
オプションは他のプレイヤを
.I 癒す (heal)
ことです。
そのプレイヤを最大まで休ませ、少し
.B 毒
を減らすための、早い方法です。
賢人会議メンバの人生の主目的は
.B 聖杯 (Holy Grail)
の探索です。これは
.B パランティア
を所持して
.I 聖杯探索 (seek grail)
オプションを使用することによりなされます。
聖杯を探すのが簡単になりすぎないよう、
聖杯探索により表示される距離の精度は 10% 以内となっています。
プレイヤが持つ
.B 罪
は、ごくごくわずかでなければなりません。
さもないと、聖杯発見時に全てが終ってしまいます。
賢人会議メンバの聖杯探索の助けとして、彼等は
.I テレポート
がより容易にできるようになっています。
.pl -0.5
.sp 1
.fM
.ne 1i
.PP
聖杯を見つけると、プレイヤは
.B バラー
の地位に進みます。
そうするとプレイヤは、
.I 介入
の際に、より多くのすばらしいオプションを使えるようになります。
賢人会議メンバが使用可能なオプションに加えて、
他のプレイヤの移動、他のプレイヤの祝福、
他のプレイヤへのモンスターの差し向けがあります。
.BR バラー
の祝福は宝物の
.I 祝福
と同様の効果がありますが、影響を受けるプレイヤの
.I 祝福
フラグがセットされるわけではありません。
他のプレイヤに影響する全
.I 介入
オプションは、使用者の年齢を増加させます。
.B バラー
は本来は不死ですが、ここでは命を 5 つ持ちます。
これを使い切ると、プレイヤは死に、
.B 前バラー
になります。
.B バラー
は
.I 移動、テレポート
、モンスターの召喚のいずれもできません
(例外は
.I バラー
が
.I 移送機
を発見した場合のみです。これによりプレイヤは余分の
.I 金
を捨てることが可能です)。
.B バラー
が出会うモンスターは、プレイヤのサイズに依存します。
同時には唯一のバラーしか存在し得ません。
現在のバラーは、他のプレイヤが聖杯を見付けると交代されます。
現在のバラーは賢人会議の地位に戻されます。
.sh "ウィザード"
通常、
.I ウィザード
はゲームの所有者であり、関連ファイルを管理します。
ゲームを'\-S' オプション付きで起動した場合、
.I ウィザード
はそのゲームで特殊な力を持ちます。
そうでなければ
.I ウィザード
は他のプレイヤと同様に扱われます。
.I ウィザード
の能力をざっと説明すると以下のようになります。
.TP
.I プレイヤの交代 (change players)
プレイヤを検査する時 ('-x' でゲームを起動、または 'X' をゲーム中で使用)、
.I ウィザード
は、検査だけでなくプレイヤを変更できます。
.TP
.I 介入
.I ウィザード
は
.I 介入
オプションの全てを使用可能で、更に、
.I 蒸発 (vaporize)
が使用可能です。これで攻撃的なプレイヤを殺せます。
.TP
.I 超越キャラクタタイプ (super character type)
キャラクタタイプが一つ追加されます。
開始時の全能力が、他のキャラクタタイプから選択した最大値になります。
.B 超越
キャラクタの能力の向上速度も、他のキャラクタタイプから選択した
最大の速度になります。
.sh "特殊な場所"
ゲーム世界の領域は、それぞれある名前を持ちます。
一般に、プレイヤがいる場所についてのイメージを与えるためだけの
意味しかありませんが、
特殊な場所もいくつかあります。
.TP 1.5i
.I 交易所 (Trading Posts)
位置は |x| == |y| == n*n*100 ただし n = 1, 2...1000 にあります。
遠くにある交易所程、売り物が沢山あります。
商人は短気ですので騙さないように注意してください。
商人は 5% の確率で不誠実です。
.TP 1.5i
.I 王の部屋 (Lord's Chamber)
位置は (0,0) です。
.B 王冠
を持つプレイヤのみが入れます。
.TP 1.5i
.I 帰らずの場所 (Point of No Return)
任意の方角の 1.2e+6 を越えた処にあります。
ここから帰るための方法は
.B 移送機
もしくは
.B バラー
に移動してもらうことです。
.TP 1.5i
.I 死の沼 (Dead Marshes)
この帯は原点からかなり遠くにあります。
最初の 14 のモンスター(水のモンスター) は、通常はここでのみ遭遇できます。
.TP 1.5i
.I ワルハラ (Valhala)
.B バラー
ががいる場所のことです。ゲーム世界の特定の座標についた名前ではありません。
.sh "その他"
プレイヤが一度
.B レベル
5 になると、入力待ちのタイムアウトにより
ゲームが再開するようになります。
これはゲームのペースを早く保つための試みです。
.PP
.B 罪
が 1 未満である場合、
.I 導師 (guru)
罪に嫌気をさすということはありません。
.PP
.I 医者 (medic)
はプレイヤの
.B 金
の半分で満足します。所有するより多くの量、もしくは負の量を与えると、
.I 医者
を怒らせてしまい、プレイヤを悪化させます (
.B 毒
が 1 増えます)。
.PP
.B 聖杯
は、これを見る準備ができていないものにとってはほとんどなにも作用しません。
これを誰かが見つけたときには、移動してしまいます。
原点からの任意の方向で、1e+6 以内の距離に常に位置します。
.PP
プレイヤが所持できる
.B マナ
および
.B 魅惑
には、
.B レベル
による最大値が存在します。
.I 素早さの銀
の限界は常に最大 99 です。
.PP
.B 交易所
で買う
.I 本 (book)
は、購入数に基づき、
.B 知能
を増加させます。
しかしながら、一時に
.B レベル
の 1/10 より多くの本を購入するのはうまいやりかたではありません。
.PP
レベル 10000 を越えたプレイヤは自動的に引退します。
.PP
.I 目が見えない状態 (blindness)
からはランダムな期間の後に回復します。
.PP
.I 王冠
を所持するプレイヤは、キャラクタタイプの前に '*' が付いて区別されます。
.sh "ターミナル間戦闘"
2 人のプレイヤの座標が一致すると、戦闘を行うことができます。
一般的に、最大の
.B 素早さ
をもつ者が最初の打撃を与えます。
2 人のプレイヤの格が違い過ぎる場合、
強いプレイヤには戦闘に際して強烈なハンディキャップが課せられます。
無限ループにはまってしまうことを避けるために、
プレイヤの応答はタイムアウトすることがあります。戦闘のオプションを示します:
.TP 1.5i
.I 戦闘 (fight)
他のプレイヤにダメージを与える。
.TP 1.5i
.I 逃走 (run away)
戦闘から逃げる。75% の成功率です。
.TP 1.5i
.I パワーブラスト (power blast)
戦闘呪文。
.TP 1.5i
.I 運試し (luckout)
相手に打ち勝とうとする一度きりの機会。10% の成功率です。
.PP
他のプレイヤを待つ時間が多大になることがあります。
これは、相手がモンスターと戦っている場合です。
戦闘で他のプレイヤを倒すと、勝者は敗者の
.B 経験値
と宝物を得ます。
.B 指輪
はターミナル間戦闘では動作しません。
.SH バグ
スクリーン形状は最低限 24 行と 80 桁はあることを想定しています。
本プログラムは、いずれかのデータ項目が
スクリーン上に割り当てられた空間よりも大きくなり過ぎることを想定した
作りにはなっていません。
.\" Amended by kuma, 98-04-29
.\"ZZZ: 3.0-RELEASE complianted by N. Kumagai, 99-1-16
