<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Proyecto de Documentaci&oacute;n de FreeBSD: Proyectos Actuales">
<!ENTITY % navinclude.docs "INCLUDE">
]>

<!-- The FreeBSD Spanish Documentation Project
     Original Revision: r1.88			-->

<html>
    &header;

    <p>Estos son los proyectos en curso (o sobre los que se
      est&aacute; trabajando en la lista freebsd-doc).</p>

    <p>Si piensa que puede ayudar en cualquier de ellos, por favor,
      no dude en hacerlo.  Hable con la persona responsable,
      que le pondr&aacute; al d&iacute;a con la marcha del proyecto.
      Si tiene ideas sobre un nuevo proyecto, por favor, env&iacute;elas
      a <a href="mailto:FreeBSD-doc@FreeBSD.org">FreeBSD-doc@FreeBSD.org</a>.</p>

   <ul>
     <li><a href="#todo">Lista TODO (tareas pendientes) de
       documentaci&oacute;n</a></li>
     <li><a href="#pr">Informes de problemas abiertos sobre la
       documentaci&oacute;</a></li>
     <li><a href="#slides">Enviar presentaciones</a></li>
     <li><a href="#freebsd4linux">FreeBSD para usuarios de Linux</a></li>
     <li><a href="#handbooksection">Escribir una secci&oacute;n del Handbook y/o
       las FAQ</a></li>
     <li><a href="#newpapers">Escribir nuevos documentos</a></li>
     <li><a href="#cgiscripts">Scripts CGI</a></li>
     <li><a href="#multilingualwebscripts">Web scripts multil&iacute;ng&uuml;es</a></li>
     <li><a href="#translations">Traducciones de la documentaci&oacute;n de
       FreeBSD</a></li>
     <li><a href="#search-enhancements">Mejoras en el motor de b&uacute;squedas</a></li>
  </ul>

    <a name="todo"></a>
    <h3>Lista TODO de documentaci&oacute;n</h3>

    <p>La lista <a href="todo.html">TODO</a> de documentaci&oacute;n es una
      lista actualizada de los problemas de la documentaci&oacute;n
      que est&aacute;n por solucionarse.  Dicha lista se env&iacute;a
      cada mes a la lista de correo <a
	href="mailto:FreeBSD-doc@FreeBSD.org">FreeBSD-doc@FreeBSD.org</a>.
      Si quiere ayudarnos a mejorar la documentaci&oacute;n de FreeBSD
      puede elegir por d&oacute;nde empezar por la lista TODO.</p>

    <a name="pr"></a>
    <h3>Informes de problemas abiertos de la documentaci&oacute;n</h3>

    <p>Los informes de problemas que hay abiertos est&aacute;n en la
      base de datos GNATS.</p>

    <p><b>Responsable:</b> Annelise Anderson &lt;andrsn@andrsn.stanford.edu&gt;
      <a
	href="http://www.FreeBSD.org/cgi/query-pr-summary.cgi?category=docs&amp;responsible=.">Aqu&iacute;</a>
       puede verlos.</p>

   <a name="handbook-index"></a>
    <h3>Mejoras en el &iacute;ndice del Handbook</h3>

    <p><b>Responsable:</b> FreeBSD-doc &lt;<a
	href="mailto:FreeBSD-doc@FreeBSD.org">FreeBSD-doc@FreeBSD.org</a>&gt;</p>

    <p><b>Sinopsis:</b> Muchas nuevas secciones se a&ntilde;adieron al
      Handbook de FreeBSD sin la correspondiente entrada en el &iacute;ndice,
      otras se a&ntilde;adieron con etiquetas indexterm primarias o secundarias
      que no se adaptan al esquema actual.  Algunos t&eacute;rminos
      se a&ntilde;adieron dentro de listas u otras &aacute;reas, cosa que
      no permite nuestra hoja de estilo, con lo que en el &iacute;ndice
      aparece <tt>???</tt> en vez del n&uacute;mero de la
      p&aacute;gina.</p>

    <p>El trabajo en el &iacute;ndice requiere experiencia previa; quien
      quiera hacer modificaciones en &eacute;l deber&iacute;a leer
      atentamente el &iacute;ndice existente (print-output) y el
      Chicago Manual of Style u otro libro que trate sobre &iacute;ndices.
      Por favor, consulte en el hist&oacute;rico del CVS sobre los errores
      ya corregidos de los ficheros chapter.sgml y el &iacute;ndice.
      Es imprescindible revisar la versi&oacute;n PostScript del Handbook
      despu&eacute;s de hacer cualquier cambio en "indexterm"; palabras
      demasiado largas o "indexterms" demasiado anidados pueden destruir
      la salida en dos columnas o hacer aparecer el n&uacute;mero de
      p&aacute;gina como <tt>???</tt>.</p>

    <p>Puede usar el "script" <tt>doc/share/misc/indexreport.pl</tt>
      para encontrar las ocasiones en las que &lt;indexterms&gt; est&aacute;
      en un sitio incorrecto en un fichero SGML.</p>

    <a name="slides"></a>
    <h3>Enviar presentaciones</h3>

    <p><b>Responsable:</b> FreeBSD-doc &lt;<a
	href="mailto:FreeBSD-doc@FreeBSD.org">FreeBSD-doc@FreeBSD.org</a>&gt;,
      Murray Stokely &lt;<a
	href="mailto:murray@FreeBSD.org">murray@FreeBSD.org</a>&gt;</p>

    <p><b>Sinopsis:</b> Las presentaciones hechas mediante la DTD
      DocBook-slides se han a&ntilde;adido recientemente a la
      documentaci&oacute;n; est&aacute;n en
      <tt>doc/en_US.ISO8859-1/slides</tt>.  Hace falta m&aacute;s
      material para usar en charlas y conferencias.  Tambi&eacute;n
      es necesario trabajar m&aacute;s en hojas de estilo para
      integrar contenidos de las noticias de releases as&iacute;
      como otros contenidos XML a nuestra documentaci&oacute;n.
      De este modo ser&aacute; m&aacute;s f&aacute;cil generar
      presentaciones totalmente actualizadas con un simple
      'make'.  Un ejemplo simple de presentaci&oacute;n con algunas
      de estas caracter&iacute;sticas ya est&aacute; en el CVS pero
      hay que hacer m&aacute;s.  Adem&aacute;s de esto, las hojas de
      estilo de la salida print/PDF (mediante procesadores XSLT
      basados en Java, PassiveTeX se queda corto para hacer
      presentaciones de calidad) se deber&iacute;an mejorar tambi&eacute;n
      ya que las hojas de estilo XSL-FO generan presentaciones
      muy espartanas.</p>

    <a name="freebsd4linux"></a>
    <h3>FreeBSD para usuarios de Linux</h3>

    <p><b>Responsable:</b> FreeBSD-doc  &lt;<a
      href="mailto:FreeBSD-doc@FreeBSD.org">FreeBSD-doc@FreeBSD.org</a>&gt;</p>

    <p><b>Sinopsis:</b> Los usuarios de FreeBSD provenientes de Linux
      pueden confundirse gracias a algunas de las diferencias que hay
      entre los dos sistemas (diferente shell por omisi&oacute;n, el
      funcionamiento de la configuraci&oacute;n del arranque, etc).</p>

    <a name="handbooksection"></a>
    <h3>Escribir una secci&oacute;n en las FAQ y/o Handbook</h3>

    <p><b>Responsable:</b> Ninguno</p>

    <p><b>Sinopsis:</b> Hay algunas partes de las FAQ y del Handbook
      que est&aacute;n incompletas y esperando su aportaci&oacute;n.  Si
      ha usado alguna parte de la documentaci&oacute;n y cree que es
      complicada o insuficiente, por favor, compl&eacute;tela con sus
      experiencias.</p>

    <p>Si tuvo que hacer algo que no existe en las FAQ y/o
      el Handbook puede escribir una nueva secci&oacute;n del
      documento.  Env&iacute;elo como se explica m&aacute;s
      arriba.</p>

    <a name="newpapers"></a>
    <h3>Escribir nuevos documentos</h3>

    <a name="newtutorials"></a>
    <h3><font color="#660000">Escribir nuevos Tutoriales</font></h3>
    <h4>El nuevo SCSI de FreeBSD (CAM)</h4>

    <p><b>Responsable:</b>
      &lt;<a href="mailto:doc@FreeBSD.org">doc@FreeBSD.org</a>&gt;,
      &lt;<a href="mailto:scsi@FreeBSD.org">scsi@FreeBSD.org</a>&gt;

    <p><b>Sinopsis:</b> Lea <a
      href="http://www.FreeBSD.org/~gibbs/">The Design and Implementation of the FreeBSD SCSI Subsystem</a>
     como introducci&oacute;n.</p>

    <a name="cgiscripts"></a>
    <h3>Scripts CGI</h3>

    <p><b>Responsable:</b>
     &lt;<a href="mailto:doc@FreeBSD.org">doc@FreeBSD.org</a>,
     Wolfram Schneider &lt;<a
       href="mailto:wosch@FreeBSD.org">wosch@FreeBSD.org</a>&gt;</p>

    <p><b>Sinopsis:</b> Los scripts CGI url.cgi, ports.cgi, pds.cgi y
      el script de portindex deben modificarse para que usen
      los m&oacute;dulos <a
	href="http://people.FreeBSD.org/~tom/portpm/">FreeBSD::Ports</a>
      de Perl.  Estos m&oacute;dulos necesitan que se les hagan pruebas
      exhaustivas.</p>

    <a name="multilingualwebscripts"></a>
	<pre>
   xfig-3.2.2|/usr/ports/graphics/xfig|/usr/X11R6|A drawing program for X11|/usr/ports/graphics/xfig/pkg/DESCR|ports@FreeBSD.ORG|graphics x11|XFree86-3.3.2 Xaw3d-1.3 jpeg-6b xpm-3.4k|XFree86-3.3.2 Xaw3d-1.3 jpeg-6b netpbm-94.3.1 tiff-3.4 transfig-3.2 xpm-3.4k
        </pre>

    <h3>Scripts web multil&iacute;ngues</h3>

    <p><b>Responsable:</b>
      &lt;<a href="mailto:doc@FreeBSD.org">doc@FreeBSD.org</a>&gt;
    <p></p>

    <p><b>Sinopsis:</b> Nuestras p&aacute;ginas web est&aacute;n
      escritas en ingl&eacute;s (americano).  Los <a
	href="translations.html">Proyectos de Traducci&oacute;n de FreeBSD</a>
      traducen el sitio web, el Handbook y las FAQ a otras lenguas.</p>

    <p>Hay que traducir los scripts cgi del web y las herramientas de
      creaci&oacute;n del web.  Los scripts deber&iacute;n admitir el
      uso de distintos idiomas, no s&oacute;lo uno.  Muchos de estos
      scripts est&aacute;n escritos en Perl.</p>

    <ul>
      <li>Unificar los scripts <a
	  href="ftp://ftp.FreeBSD.org/pub/FreeBSD/FreeBSD-current/www/en/ports/portindex">www/en/ports/portindex</a>
        y <a
	  href="ftp://ftp.FreeBSD.org/pub/FreeBSD/FreeBSD-current/www/ja/ports/portindex">www/ja/ports/portindex</a>
        en un s&oacute;lo script.  A&ntilde;adir una opci&oacute;n para la
        salida en ingl&eacute;s o japon&eacute;s.
      </li>
    </ul>

    <a name="translations"></a>
    <h3>Traducciones de la documentaci&oacute;n de FreeBSD</h3>

    <p><b>Responsable:</b> &lt;<a
      href="mailto:doc@FreeBSD.org">doc@FreeBSD.org</a>&gt;

    <p>Traducir la documentaci&oacute;n de FreeBSD (Web, FAQ, Handbook,
      p&aacute;ginas man) a otros idiomas.  Consulte los detalles en <a
	href="translations.html">el proyecto de traducciones</a>.</p>

    <a name="search-enhancements"></a>
    <h3>Mejoras en el motor de b&uacute;squedas</h3>

    <p><b>Responsable:</b> &lt;<a
      href="mailto:doc@FreeBSD.org">doc@FreeBSD.org</a>&gt;</p>

    <p>Cuando realizamos una b&uacute;squeda en el web el resultado que
      obtenemos es el nombre del fichero en el que se ha encontrado el
      resultado, algo como <tt>FAQ34.html</tt>.</p>
    <p>Ser&iacute;a mucho m&aacute;s &uacute;til si los resultados incluyesen
      el texto en cuesti&oacute;n, permitiendo al usuario ver la relevancia
      del resultado obtenido.</p>
  &footer
  </body>
</html>
