<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/es/docproj/sgml.sgml,v 1.14 2008/02/17 19:52:28 gabor Exp $">
<!ENTITY title "Proyecto de Documentaci&oacute;n de FreeBSD: SGML">
<!ENTITY % navinclude.docs "INCLUDE">
]>

<!-- The FreeBSD Spanish Documentation Project
     Original Revision: r1.28			-->

<html>
    &header;

    <p>El proyecto de Documentaci&oacute;n usa SGML como
      m&eacute;todo est&aacute;ndar de representar la documentaci&oacute;n.</p>

    <p>El nombre SGML viene de <b>S</b>tandard <b>G</b>eneralised
      <b>M</b>arkup <b>L</b>anguage, que podr&iacute;a traducirse
       como "lenguaje de etiquetado est&aacute;ndar de
       prop&oacute;sito general".</p>

    <p>Brevemente (y disculpas para los puristas de SGML que puedan sentirse
      ofendidos) SGML es un lenguaje para escribir otros lenguajes.</p>

    <p>Probablemente ya haya usado SGML sin saberlo.  HTML, el lenguaje en el
      que se escriben las p&aacute;ginas web, tiene una descripci&oacute;n
      formal.  Esta descripci&oacute;n se escribi&oacute; en SGML.  Cuando
      escribe en HTML <b>no</b> est&aacute; escribiendo SGML pero s&iacute;
      que est&aacute; usando un lenguaje definido por SGML.</p>

    <p>Existen muchos, muchos lenguajes "markup" que est&aacute;n definidos
      usando SGML.  HTML es uno de ellos.  Otro es el llamado "DocBook".
      &Eacute;ste es un lenguaje dise&ntilde;ado espec&iacute;ficamente para
      escribir documentaci&oacute;n t&eacute;cnica y tiene muchas etiquetas
      o "tags", (por ejemplo <tt>&lt;tag&nbsp;contenido&gt;</tt>).
      FreeBSD lo adopt&oacute; y definid&oacute;
      nuevos elementos para hacerlo m&aacute;s preciso.</p>

    <p>Por ejemplo, as&iacute; se escribir&iacute;a un breve p&aacute;rrafo
      en HTML (no se preocupe del contenido, solo f&iacute;jese en las
      etiquetas):</p>

    <pre><![ CDATA [
    <p>The system's passwords are stored in <tt>/etc/passwd</tt>. To edit
      this file you should use <b><tt>vipw</tt></b>. However, if you just
      want to add a new user you can use <b><tt>adduser</tt></b>.</p>
]]></pre>

    <p>El mismo p&aacute;rrafo en DocBook ser&iacute;a:</p>

    <pre><![ CDATA [
    <para>The system's passwords are stored in
      <filename>/etc/passwd</filename>. To edit this file you should use
      <command>vipw</command>. However, if you just want to add a new user
      you can use <command>adduser</command>.</para>
]]></pre>

    <p>Como puede ver DocBook es mucho m&aacute;s expresivo que HTML.  En el
      ejemplo HTML el nombre del fichero se muestra con un tipo de letra
      de m&aacute;quina de escribir.  En el ejemplo de DocBook, el nombre
      de fichero lleva la etiqueta "filename" (nombre de fichero); la
      representaci&oacute;n de un nombre de fichero no est&aacute;
      descrita.</p>

    <p>Esta mayor expresividad tiene grandes ventajas:</p>

    <ul>
      <li>
	<p>No es ambiguo o inconsistente.</p> <p>No se pierde tiempo
	  pensando "&iquest;Hmm, necesito mostrar un nombre de fichero,
	  &iquest;deber&iacute;a usar "tt", o "b", o "em"?</p>

	<p>En lugar de eso, use la etiqueta correcta para lo que quiera
	  hacer.</p>

	<p>El proceso de conversi&oacute;n de DocBook a otros formatos como
	  HTML o Postscript garantiza que la presentaci&oacute;n de todos
	  ellos ser&aacute; la misma.</p>
      </li>

      <li>
	<p>Dejar de pensar en c&oacute;mo representar la documentaci&oacute;n
	  y concentrarse solamente en el contenido.</p>

      <li>
	<p>Como la documentaci&oacute;n no est&aacute; pensada para un
	  determinado formato de salida la misma documentaci&oacute;n puede
	  crearse en diferentes formatos: texto, HTML, Postscript, RTF,
	  PDF, etc.</p></li>

      <li>
	<p>La documentaci&oacute;n es m&aacute;s "inteligente", lo que
	  permite hacer cosas m&aacute;s inteligentes con ella.  Por ejemplo,
	  es posible crear un &iacute;ndice autom&aacute;tico que liste cada
	  comando mostrado en la documentaci&oacute;n.</p>.</li>
    </ul>

    <p>Si est&aacute; familiarizado con ellos es como las galer&iacute;as
      de estilo de Microsoft Word, s&oacute;lo que infinitamente m&aacute;s
      potente.</p>

    <p>Por supuesto, esta potencia tiene un precio:</p>

    <ul>
      <li><p>Al existir un mayor n&uacute;mero de etiquetas el aprendizaje
	  es m&aacute;s largo y cuesta m&aacute;s trabajo aprender a
	  usarlas.</p>

	<p>La mejor manera de aprender es leer los fuentes de otros
	  documentos para ver c&oacute;mo representaron informaci&oacute;n
	  similar otros autores.</p></li>

      <li><p>El proceso de conversi&oacute;n no es tan simple.</p></li>
    </ul>

    <h2>&iquest;Qu&eacute; pasa si no sabe DocBook?  &iquest;Todav&iacute;a
      puedo ayudar?</h2>

    <p>S&iacute;, por supuesto.  Un poco de documentaci&oacute;n es mejor
      que no tener nada.  Si tiene documentaci&oacute;n con la que
      contribuir y no est&aacute; en formato DocBook no se preocupe.</p>

    <p><a href="submitting.html">Env&iacute;e</a> la documentaci&oacute;n
      de la manera habitual.  Alg&uacute;n miembro del proyecto
      recoger&aacute; los documentos que env&iacute;e y trabajar&aacute;
      en ellos.  Con un poco de suerte le enviar&aacute;n una copia
      ya etiquetada en DocBook.  As&iacute; podr&aacute; comparar el
      documento original con el que reciba y podr&aacute; ir aprendiendo
      a hacerlo usted mismo.</p>

    <p>Obviamente esto retrasa el que la documentaci&oacute;n est&eacute;
      online porque su documento requiere un trabajo adicional.  Esto
      puede suponer unas horas o unos d&iacute;as pero de cualquier modo
      llegar&aacute; a su destino.</p>

    <h2>&iquest; Necesita m&aacute; informaci&oacute;n sobre SGML y
      DocBook?</h2>

    <p>Lo primero que deber&iacute; leer es el <a
      href="&base;/../doc/en_US.ISO8859-1/books/fdp-primer/index.html">
      <b>Documentation Project Primer</b></a>.  Es una extensa
      explicaci&oacute;n de todo lo que necesita saber para poder trabajar
      con la documentaci&oacute;n de FreeBSD.  Es un documento largo,
      dividido en m&uacute;ltiples p&aacute;ginas diferentes de peque&ntilde;o
      tama&ntilde;o.  Tambi&eacute;n puede verlo en formato de <a
	href="&base;/../doc/en_US.ISO8859-1/books/fdp-primer/book.html"><b>un sola p&aacute;gina</b></a>.</p>

    <dl>
      <dt><a
	  href="http://www.oasis-open.org/cover/sgml-xml.html"><b>http://www.oasis-open.org/cover/sgml-xml.html</b></a></dt>

      <dd><p>La web de SGML/XML.  Incluye m&aacute;s recursos sobre SGML.</p></dd>

      <dt><a
	  href="http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html"><b>http://www-sul.stanford.edu/tools/tutorials/html2.0/gentle.html</b></a></dt>

      <dd><p>El "Gentle Introduction to SGML".  De recomendada lectura para
	cualquiera que desee tener conocimientos avanzados de SGML.</p></dd>

      <dt><a
	  href="http://www.oasis-open.org/docbook/"><b>http://www.oasis-open.org/docbook/</b></a></dt>

      <dd><p>OASIS mantiene el DTD DocBook.  Estas p&aacute;ginas
	est&aacute;n pensadas para usuarios con bastante experiencia
	con SGML y quieren aprender DocBook.</p>
      </dd>
    </dl>

    <p></p><a href="docproj.html">Inicio del Proyecto de Documentaci&oacute;n de FreeBSD</a>

  &footer;
  </body>
</html>
