<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: n.nn
-->

    <chapter id="mail">
      <title>Courrier &eacute;lectronique</title>
      
      <para><emphasis>Contribution de &a.wlloyd;.</emphasis></para>
      &trans.a.haby;
      
      <para>De nombreux ouvrages d'<link
	  linkend="bibliography">Administration Syst&egrave;me</link> traitent de la
        configuration du courrier &eacute;lectronique. Si vous envisagez de faire
        plus que configurer un seul serveur de courrier sur votre r&eacute;seau,
        il vous faut de la documentation de qualit&eacute; industrielle.</para>
      
      <para>Certaines parties de la configuration du courrier &eacute;lectronique
        sont confi&eacute;es au Syst&egrave;me de Noms de Domaines (DNS). Si vous g&eacute;rez
        votre propre serveur DNS, consultez <filename>/etc/namedb</filename> et
        <command>man -k named</command> pour plus d'informations.</para>
      
      <sect1>
	<title>Notions de base</title>
	
	<para>Voici les principaux programmes impliqu&eacute;s dans un &eacute;change de
          courrier &eacute;lectronique. Le &ldquo;serveur de courrier&rdquo; est
          responsable de l'exp&eacute;dition et de la r&eacute;ception du courrier pour
          votre machine, voire votre r&eacute;seau.</para>
	
	<sect2>
	  <title>Le programme utilisateur</title>
	  
	  <para>C'est un programme comme <application >elm</application>,
              <application>pine</application>, <application>mail</application>,
            ou un outil plus sophistiqu&eacute; tel un navigateur WWW. Ce programme
            transmet simplement toutes les transactions concernant le courrier
            &eacute;lectronique au &ldquo;serveur de courrier&rdquo; local, soit en
            invoquant <command>sendmail</command>, soit via TCP.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Le &ldquo;d&eacute;mon&rdquo; serveur de courrier</title>
	  
	  <para>C'est habituellement <command>sendmail</command> ou
	      <command>smail</command>, s'ex&eacute;cutant en t&acirc;che de fond. Vous
            le d&eacute;sactivez ou modifiez les options de sa ligne de commande
            dans le fichier <filename>/etc/rc.conf</filename> (ou, pour les
            versions ant&eacute;rieures &agrave; FreeBSD 2.2.2, 
            <filename>/etc/sysconfig</filename>). Il vaut mieux le laisser
            actif, &agrave; moins que vous n'ayez une bonne raison de ne pas
            le faire tourner, par exemple, si vous configurez un
	    <link linkend="firewalls">coupe-feu</link>.</para>
	  
	  <para>Vous devez savoir que <command>sendmail</command> est un maillon
            potentiellement faible sur un site s&eacute;curis&eacute;. Certaines versions de
	    <command>sendmail</command> ont des trous de s&eacute;curit&eacute; connus.</para>
	  
	  <para><command>sendmail</command> accomplit deux t&acirc;ches. Il se charge
            d'envoyer et de recevoir le courrier.</para>
	  
	  <para>Lorsque <command>sendmail</command> doit exp&eacute;dier du courrier
            depuis votre site, il consulte le DNS pour savoir quelle machine
            re&ccedil;oit le courrier pour la destination voulue.</para>
	  
	  <para>S'il agit comme exp&eacute;diteur, <command>sendmail</command> prendra
            le message dans la file d'attente locale et le d&eacute;livrera via 
            l'Internet &agrave; un autre <command>sendmail</command> sur la machine
            qui doit le recevoir.</para>
	  
	</sect2>
	
	<sect2>
	  <title>DNS&nbsp;-&nbsp;Syst&egrave;me de Noms de Domaines</title>
	  
	  <para>Le syst&egrave;me de noms de domaines (DNS),
            et son &ldquo;d&eacute;mon&rdquo;
            <command>named</command>, g&egrave;rent la base de donn&eacute;es qui fait
            correspondre nom de machine et adresse IP, et nom de machine
            et serveur de courrier. L'adresse IP est d&eacute;finie par un 
            enregistrement A. L'enregistrement MX d&eacute;finit le serveur qui
            recevra votre courrier. S'il n'y a pas d'enregistrement MX
            associ&eacute; &agrave; votre machine, cette derni&egrave;re recevra directement le
            courrier.</para>
	  
	  <para>A moins que vous n'ayez votre propre serveur DNS, vous ne pouvez
            pas modifier vous-m&ecirc;me les informations du DNS. Si vous passez par 
            un fournisseur d'acc&egrave;s Internet, voyez cela avec lui.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Serveur POP</title>
	  
	  <para>Ce programme r&eacute;cup&egrave;re le courrier dans votre bo&icirc;te aux lettres
            et le transmet &agrave; votre navigateur. Si vous voulez faire tourner
            un serveur POP sur votre machine, vous devrez faire deux 
            choses:</para> 
	  
	    <procedure>
	      
	      <step>
		<para>R&eacute;cup&eacute;rez le logiciel POP du <ulink
		  url="http://www.freebsd.org/ports/mail.html">catalogue des 
                  logiciels port&eacute;s</ulink>, que vous trouverez dans le 
                  r&eacute;pertoire <filename>/usr/ports</filename>, ou du catalogue 
                  des logiciels pr&eacute;compil&eacute;s. Ce manuel comprend une section qui
                  d&eacute;crit exhaustivement l'installation des
		  <link linkend="ports">logiciels port&eacute;s</link>.</para>
	      </step>
	      
	      <step>
		<para>Modifiez <filename>/etc/inetd.conf</filename>
		  pour lancer le serveur POP.</para>
	      </step>
	      
	    </procedure>
	  
	  <para>Il y aura des instructions avec le serveur POP. 
            Lisez-les.</para>
	  
	</sect2>
      </sect1>
      
      <sect1>
	<title>Configuration</title>
	
	<sect2>
	  <title>Les bases</title>
	  
	  <para>Avec votre syst&egrave;me FreeBSD &ldquo;pr&ecirc;t-&agrave;-l'emploi&rdquo;[TM], 
            vous devriez pouvoir envoyer du courrier &eacute;lectronique &agrave; l'ext&eacute;rieur,
            d&egrave;s que vous aurez configur&eacute; <filename>/etc/resolv.conf</filename>
            ou si vous faites tourner un serveur DNS. Si vous voulez que votre
            courrier soit d&eacute;livr&eacute; &agrave; une machine particuli&egrave;re, il y a deux 
            m&eacute;thodes:</para>

	  <itemizedlist>
	    <listitem>
	  <para>Faire tourner un serveur DNS (<command>man -k named</command>) 
            et avoir votre propre domaine, i.e.: 
	    <hostid role="domainname">petitemine.com</hostid>.</para>
	    </listitem>

	    <listitem>
	  <para>Faire en sorte que le courrier soit envoy&eacute; &agrave; l'adresse (nom de
            machine) DNS de votre machine, i.e.: 
	    <hostid role="fqdn">refectoire6.maison.ecole.edu</hostid>.</para>
	    </listitem>
	  </itemizedlist>
	  
	  <para>Quelle que soit la m&eacute;thode choisie, pour que le courrier soit
            directement d&eacute;livr&eacute; &agrave; votre machine, elle doit &ecirc;tre r&eacute;f&eacute;renc&eacute;e sur
            l'Internet. Vous devez avoir une adresse IP permanente. Donc pas de
            PPP dynamique. Si vous &ecirc;tes derri&egrave;re un coupe-feu, il faut qu'il
            vous passe le trafic SMTP (<foreignphrase>Simple Mail Transfer 
            Protocol</foreignphrase>&nbsp;-&nbsp;protocole &eacute;l&eacute;mentaire de
            transport de courrier &eacute;lectronique). D'apr&egrave;s 
	    <filename>/etc/services</filename>:</para>

	    <programlisting
>smtp	      25/tcp mail         #Simple Mail Transfer</programlisting>

	  <para>Si vous voulez recevoir le courrier sur la machine elle-m&ecirc;me,
            vous devez vous assurez que l'entr&eacute;e MX du DNS pointe sur cette
            machine, ou qu'il n'y a pas d'entr&eacute;e MX correspondant &agrave; son nom
            dans le DNS.</para>
	  
	  <para>Essayez:</para>

	    <informalexample>
	      <screen>&prompt.root; <userinput>hostname</userinput>
newbsdbox.freebsd.org
&prompt.root; <userinput>host newbsdbox.freebsd.org</userinput>
newbsdbox.freebsd.org has address 204.216.27.xx</screen>
	    </informalexample>
	  
	  <para>Si c'est la seule r&eacute;ponse que vous obtenez, le courrier adress&eacute;
	    &agrave; <email>root@newbsdbox.freebsd.org</email>
	    arrivera sans probl&egrave;me.</para>
	  
	  <para>Si au lieu de cela, vous obtenez:</para>

	    <informalexample>
	      <screen>&prompt.root; <userinput>host newbsdbox.freebsd.org</userinput>
newbsdbox.FreeBSD.org has address 204.216.27.xx
newbsdbox.FreeBSD.org mail is handled (pri=10) by freefall.FreeBSD.org</screen>
	    </informalexample>

	  <para>Tout le courrier adress&eacute; directement &agrave; votre machine arrivera
	    sur <hostid>freefall</hostid>, adress&eacute; au m&ecirc;me utilisateur.</para>
	  
	  <para>Cette information est configur&eacute;e par votre serveur de noms de
            domaines. C'est la machine d&eacute;finie comme serveur de noms primaire
            dans <filename>/etc/resolv.conf</filename>.</para>
	  
	  <para>L'enregistrement du DNS qui contient l'information de routage
            du courrier est l'entr&eacute;e MX (<foreignphrase>Mail 
            eXchange</foreignphrase>). S'il n'y a pas d'entr&eacute;e MX, le courrier
            est envoy&eacute; directement &agrave; la machine en utilisant l'entr&eacute;e
	    Addresse.</para>
	  
	  <para>Voici ce que fut &agrave; l'occasion l'entr&eacute;e MX pour 
            <hostid role="fqdn">freefall.freebsd.org:</hostid>.</para>

	    <programlisting>
freefall                       MX    30   mail.crl.net
freefall                       MX    40   agora.rdrop.com
freefall                       HINFO Pentium     FreeBSD
freefall                       MX    10   freefall.FreeBSD.org
freefall                       MX    20   who.cdrom.com
freefall                       A     204.216.27.xx
freefall                       CNAME www.FreeBSD.org</programlisting>
	  
	  <para><hostid>freefall</hostid> a plusieurs entr&eacute;es MX. Celle dont le
            num&eacute;ro est le plus faible re&ccedil;oit en d&eacute;finitive le courrier. Les 
            autres le mettent temporairement dans leur file d'attente, si
	    <hostid>freefall</hostid> est occup&eacute; ou hors-service.</para>
	  
	  <para>Les sites MX de secours doivent avoir une connexion s&eacute;par&eacute;e &agrave;
            l'Internet, pour &ecirc;tre vraiment utiles. Un fournisseur d'acc&egrave;s ou
            un site amical peuvent vous fournir ce service.</para>
	  
	  <para><command>dig</command>, <command>nslookup</command>,
	      et <command>host</command> sont ici vos alli&eacute;s.</para>
	  
	</sect2>
	
	<sect2 id="mail-domain">
	  <title>Courrier pour votre domaine (r&eacute;seau).</title>
	  
	  <para>Pour configurer un serveur de courrier pour votre r&eacute;seau, vous
            devez &eacute;viter que le courrier arrive &agrave; toutes vos stations de 
            travail. En d'autres termes, vous devez d&eacute;tourner tout le courrier
	    pour <hostid role="domainname">*.petitemine.com</hostid> vers une
            seule machine, votre &ldquo;serveur de courrier&rdquo;.</para>
	  
	  <para>Dans la grande majorit&eacute; des cas, les utilisateurs du r&eacute;seau
            r&eacute;cup&egrave;reront leur courrier sur leurs stations de travail avec POP
            ou telnet.</para>
	  
	  <para>Il faut qu'il y ait un compte utilisateur avec le 
            <emphasis>m&ecirc;me nom</emphasis> sur les deux machines. Utilisez
	    <command>adduser</command> pour ce faire. Si vous d&eacute;finissez
	    <literal>/nonexistent</literal> comme interpr&eacute;teur de commandes
            (sur le serveur de courrier), les utilisateurs ne pourront pas y
            ouvrir de session.</para>
	  
	  <para>Votre serveur de courrier sera d&eacute;fini comme 
            <foreignphrase>Mail eXchange</foreignphrase> pour chaque station de
            travail. Cela doit &ecirc;tre d&eacute;fini dans le DNS (i.e.: BIND, named). 
            Reportez-vous s'il vous pla&icirc;t &agrave; un ouvrage d'administration r&eacute;seau
            pour avoir des informations d&eacute;taill&eacute;es.</para>
	  
	  <para>Vous devez essentiellement ajouter les lignes suivantes &agrave; la 
            configuration de votre serveur DNS:</para>

	    <programlisting>
pc24.petitemine.com	A     <replaceable>xxx.xxx.xxx.xxx</replaceable>     ; Adresse IP de la station de travail
                       MX  10 smtp.petitemine.com ; Serveur de courrier</programlisting>
	  
	  <para>Vous ne pouvez le faire vous-m&ecirc;me que si vous g&eacute;rez un serveur
            de noms. Si vous ne voulez pas faire tourner un serveur de noms,
            trouvez quelqu'un, votre fournisseur d'acc&egrave;s Internet par exemple,
            pour le faire &agrave; votre place.</para>
	  
	  <para>Le courrier adress&eacute; &agrave; une station de travail sera envoy&eacute; &agrave; 
            votre machine <foreignphrase>Mail eXchange</foreignphrase>. Quelle
            que soit la machine sur laquelle pointe l'enregistrement A, le
	    courrier arrivera sur la machine MX.</para>
	  
	  <para>On peut utiliser cela pour impl&eacute;menter un h&eacute;bergement virtuel du
            courrier &eacute;lectronique.</para>
	  
	  <para>Exemple:</para>
	  
	  <para>J'ai un client qui a comme domaine foo.bar, et je veux que tout
            le courrier pour foo.bar arrive sur ma machine smtp.smalliap.com. 
            Il faut configurer une entr&eacute;e comme suit pour le serveur DNS:</para>

	    <programlisting>
foo.bar                  MX  10	smtp.smalliap.com      ; mon serveur de courrier</programlisting>

	  <para>Il n'y a pas besoin d'enregistrement A si l'on ne veut que 
            le courrier pour le domaine. i.e.: ne vous attendez pas &agrave; ce que
	    <command>ping foo.bar</command> fonctionne, &agrave; moins qu'il 
	    n'y ait aussi un enregistrement d'Addresse pour
            <filename>foo.bar</filename>.</para>
	  
	  <para>Sur la machine qui re&ccedil;oit le courrier pour le distribuer dans 
            une bo&icirc;te aux lettres, il faut dire &agrave; <command>sendmail</command>
             pour quelle machine il accepte du courrier.</para>
	  
	  <para>Ajoutez <literal>pc24.petitemine.com</literal> &agrave;
            <filename>/etc/sendmail.cw</filename> (si vous utilisez
	    <literal>FEATURE(use_cw_file)</literal>), ou ajoutez une ligne
            <literal>Cw myhost.smalliap.com</literal> &agrave;
	    <filename>/etc/sendmail.cf</filename>.</para>
	  
	  <para>Si vous envisagez d'utiliser s&eacute;rieusement 
            <command>sendmail</command>, vous devriez installer les
            sources de <command>sendmail</command>. Ils sont accompagn&eacute;s de
            beaucoup de documentation. Vous trouverez de l'information sur
            la fa&ccedil;on d'obtenir le source de <command>sendmail</command>
	    &agrave; la section <link linkend="sendmailuucp">Configurer  
            UUCP</link>.</para>
	  
	</sect2>
	
	<sect2 id="sendmailuucp">
	  <title>Configurer UUCP.</title>
	  
	  <para><emphasis>Emprunt&eacute; &agrave; la FAQ.</emphasis></para>
	  
	  <para>La configuration de <command>sendmail</command> livr&eacute;e avec
            FreeBSD convient &agrave; des sites directement connect&eacute;s &agrave; l'Internet.
            Les sites qui veulent &eacute;changer du courrier par UUCP doivent 
            installer un autre fichier de configuration de
	    <command>sendmail</command>.</para>
	  
	  <para>Bidouiller <filename>/etc/sendmail.cf</filename> &agrave; la main est
            g&eacute;n&eacute;ralement consid&eacute;r&eacute; comme une occupation de puriste. La version
            8 de <command>sendmail</command> s'accompagne d'une nouvelle mani&egrave;re
            de g&eacute;n&eacute;rer les fichiers de configuration avec le pr&eacute;-processeur 
	    <command>m4</command>, gr&acirc;ce auquel le travail de configuration 
            &agrave; la main se fait &agrave; un niveau d'abstraction plus &eacute;lev&eacute;.
            Utilisez les fichiers de configuration du r&eacute;pertoire
	    <filename>/usr/src/usr.sbin/sendmail/cf</filename>.</para>
	  
	  <para>Si vous n'avez pas install&eacute; la totalit&eacute; du source sur votre 
            syst&egrave;me, les fichiers et outils de <command>sendmail</command> ont
            &eacute;t&eacute; scind&eacute;s en plusieurs fichiers d'archive, pour plus de 
            commodit&eacute;s.  En supposant que vous ayez mont&eacute; le CD-ROM, 
            tapez:</para>
	  
	  <informalexample>
	    <screen>&prompt.root; <userinput>cd /usr/src</userinput>
&prompt.root; <userinput>tar -xvzf /cdrom/dists/src/ssmailcf.aa</userinput></screen>
	  </informalexample>
	  
	  <para>Pas de panique, il n'y a que quelques centaines de kilo-octets.
            Le fichier <filename>README</filename> du r&eacute;pertoire
            <filename>cf</filename> est une bonne introduction de base &agrave; la
            configuration avec <command>m4</command>.</para>
	  
	  <para>Pour le transfert par UUCP, le mieux est d'utiliser la 
            fonctionnalit&eacute; <emphasis>mailertable</emphasis>. Elle construit une
            base de donn&eacute;es que <command>sendmail</command> peut utiliser pour
            prendre ses d&eacute;cisions de routage.</para>
	  
	  <para>Vous devez d'abord cr&eacute;er un fichier <filename>.mc</filename>.
            Le r&eacute;pertoire <filename>/usr/src/usr.sbin/sendmail/cf/cf</filename> 
            contient ces fichiers. Jetez-y un coup d'oeil, il y a d&eacute;j&agrave; 
            quelques exemples. Supposons que vous ayez appel&eacute; votre fichier
	    <filename>foo.mc</filename>, tout ce que vous avez &agrave; faire pour le 
            convertir en un fichier <filename>sendmail.cf</filename> 
            valide est:</para>
	  
	  <informalexample>
	    <screen>&prompt.root; <userinput>cd /usr/src/usr.sbin/sendmail/cf/cf</userinput>
&prompt.root; <userinput>make foo.cf</userinput></screen>
	  </informalexample>
	  
	  <para>Si vous n'avez pas de r&eacute;pertoire 
            <filename>/usr/obj</filename>, alors:</para>
	  
	  <informalexample>
	    <screen>&prompt.root; <userinput>cp foo.cf /etc/sendmail.cf</userinput></screen>
	  </informalexample>
	  
	  <para>Sinon:</para>
	  
	  <informalexample>
	    <screen>&prompt.root; <userinput>cp /usr/obj/`pwd`/foo.cf /etc/sendmail.cf</userinput></screen>
	  </informalexample>
	  
	  <para>Un fichier <filename>.mc</filename> typique ressemblerait 
	    &agrave;:</para>
	  
	  <programlisting>
include(`../m4/cf.m4')
VERSIONID(`<replaceable>Votre num&eacute;ro de version</replaceable>')
OSTYPE(bsd4.4)

FEATURE(nodns)
FEATURE(nocanonify)
FEATURE(mailertable)

define(`UUCP_RELAY', <replaceable>votre.relais.uucp</replaceable>)
define(`UUCP_MAX_SIZE', 200000)

MAILER(local)
MAILER(smtp)
MAILER(uucp)

Cw    <replaceable>votre.alias.nom.machine</replaceable>
Cw    <replaceable>votrenomdenoeuduucp.UUCP</replaceable></programlisting>
	  
	  <para>Les fonctionnalit&eacute;s <literal>nodns</literal> et
	    <literal>nocanonify</literal> &eacute;vitent le recours au DNS
	    pour d&eacute;livrer le courrier. La clause <literal>UUCP_RELAY</literal>
	    est n&eacute;cessaire pour d'obscures raisons, ne me demandez pas 
            lesquelles. Mettez-y simplement un nom de machine Internet qui
            soit capable de comprendre les adresses du pseudo-domaine .UUCP;
            vous y mettrez vraisemblablement le nom du relais de courrier
            &eacute;lectronique de votre fournisseur d'acc&egrave;s.</para>
	  
	  <para>Un fois que cela est fait, il vous faut le fichier appel&eacute;
	    <filename>/etc/mailertable</filename>. De nouveau, un exemple
            typique de cette vari&eacute;t&eacute;:</para>
	  
	  <programlisting>
#
# makemap hash /etc/mailertable.db &lt; /etc/mailertable
#
horus.interface-business.de   uucp-dom:horus
.interface-business.de        uucp-dom:if-bus
interface-business.de         uucp-dom:if-bus
.heep.sax.de                  smtp8:%1 horus.UUCP
uucp-dom:horus                if-bus.UUCP
uucp-dom:if-bus .	      uucp-dom:sax</programlisting>
	  
	  <para>Comme vous pouvez le constater, c'est un exemple d'apr&egrave;s nature.
            Les trois premi&egrave;res lignes prennent en charge les cas particuliers
            o&ugrave; le courrier adress&eacute; au domaine ne doit pas &ecirc;tre exp&eacute;di&eacute; sur la
            route par d&eacute;faut, mais &agrave; un voisin UUCP pour 
            &ldquo;raccourcir&rdquo; le trajet. La ligne suivante g&egrave;re le
            courrier sur le domaine local Ethernet, qui peut &ecirc;tre d&eacute;livr&eacute;
            par SMTP. Pour finir, les voisins UUCP sont r&eacute;f&eacute;renc&eacute;s avec la
            notation utilisant le pseudo-domaine .UUCP pour permettre
            la surcharge des r&egrave;gles par d&eacute;faut
	    <literal>uucp-voisin!destinataire</literal>. Il y a toujours un
            simple point (&ldquo;.&rdquo;) sur la derni&egrave;re ligne, 
            qui correspond &agrave; tout le reste,
            et permet l'exp&eacute;dition UUCP &agrave; un voisin UUCP qui vous sert de
            passerelle universelle pour le courrier au reste du monde. Tous les
            noms de noeuds apr&egrave;s le mot-cl&eacute; <literal>uucp-dom:</literal> 
            doivent &ecirc;tre des voisins UUCP valables, ce que vous pouvez contr&ocirc;ler
	    avec <command>uuname</command>.</para>
	  
	  <para>Pour vous rappeler que ce fichier doit &ecirc;tre converti en base
            de donn&eacute;es DBM avant d'&ecirc;tre utilisable, c'est une bonne id&eacute;e de
            mettre la ligne de commande qui le fait en t&ecirc;te du fichier
	    <filename>mailertable</filename>. Vous devez l'ex&eacute;cuter chaque fois
            que vous modifiez <filename>mailertable</filename>.</para>
	  
	  <para>Dernier point: si vous n'&ecirc;tes pas s&ucirc;r qu'une route donn&eacute;e
            fonctionne, rappelez-vous l'option <option>-bt</option> de
	    <command>sendmail</command>. Elle lance <command>sendmail</command>
	    en mode &ldquo;test d'addresse&rdquo;; entrez simplement
	    <literal>0</literal>, puis l'adresse dont vous voulez tester la
            route, la derni&egrave;re ligne vous donnera l'agent de transport de
            courrier utilis&eacute; en interne, la machine destinatrice que vous
            avez donn&eacute;e en param&egrave;tre, et l'adresse (&eacute;ventuellement traduite). 
            Vous quittez ce mode en tapant Ctrl-D.</para>
	  
	  <informalexample>
	    <screen>&prompt.user; <userinput>sendmail -bt</userinput>
ADDRESS TEST MODE (ruleset 3 NOT automatically invoked)
Enter &lt;ruleset&gt; &lt;address&gt;
<prompt>&gt;</prompt> <userinput>0 foo@interface-business.de</userinput>
rewrite: ruleset  0   input: foo @ interface-business . de
&hellip;
rewrite: ruleset  0 returns: $# uucp-dom $@ if-bus $: foo &lt; @ interface-business . de</screen>
	  </informalexample>
	  
	</sect2>
      </sect1>
      
      <sect1 id="mailfaq">
	<title>FAQ</title>
	
	<para><emphasis>Emprunts &agrave; la FAQ.</emphasis></para>
	
	
	<sect2>
	  <title>Pourquoi faut-il que j'utilise les FQDN (&ldquo;Fully Qualified
            Domain Name&rdquo;&nbsp;-&nbsp;noms Internet 
            complets) pour les machines de mon site?</title>
	  
	  <para>Vous vous rendrez probablement compte que la machine est en
            fait dans un domaine diff&eacute;rent; par exemple, si vous &ecirc;tes dans
            le domaine <hostid role="fqdn">foo.bar.edu</hostid> et que vous
            voulez atteindre la machine <hostid>mumble</hostid> du domaine
            <hostid role="domainname">bar.edu</hostid>, vous devrez utiliser
            son nom de domaine complet, <hostid 
            role="fqdn">mumble.bar.edu</hostid>, au lieu de
            <hostid>mumble</hostid>.</para>
	  
	  <para>C'&eacute;tait traditionnellement admis par les solveurs BIND BSD. 
            N&eacute;anmoins, la version de <application>BIND</application> qui est
            maintenant livr&eacute;e avec FreeBSD ne sait pas compl&eacute;ter les noms
            de domaines abr&eacute;g&eacute;s autrement qu'avec le nom de votre domaine.
            Donc le nom non qualifi&eacute; <hostid>mumble</hostid> doit correspondre
	    &agrave; <hostid role="fqdn">mumble.foo.bar.edu</hostid>, sans quoi il 
            sera recherch&eacute; dans le domaine racine.</para>
	  
	  <para>Cela diff&egrave;re du comportement ant&eacute;rieur, o&ugrave; la recherche se
            prolongeait &agrave; <hostid role="domainname">mumble.bar.edu</hostid>,
	    puis <hostid role="domainname">mumble.edu</hostid>. Consultez la
	    RFC 1535 pour savoir pourquoi cela &eacute;tait consid&eacute;r&eacute; comme une mani&egrave;re
            incorrecte de faire, voire un trou de s&eacute;curit&eacute;.</para>
	  
	  <para>Comme palliatif, vous pouvez mettre la ligne:
	  
	  <programlisting>
search foo.bar.edu bar.edu</programlisting>
	  
	  &agrave; la place de:
	  
	  <programlisting>
domain foo.bar.edu</programlisting>
	  
	  dans votre fichier <filename>/etc/resolv.conf</filename>. Assurez-vous
          cependant que la recherche ne franchit pas la  
          &ldquo;limite entre l'administration locale et publique&rdquo;
          selon l'expression de la RFC 1535.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Sendmail affiche le message d'erreur
             <errorname>mail loops back to myself</errorname></title>
	  
	  <para>La r&eacute;ponse donn&eacute;e dans la FAQ de Sendmail est la suivante:</para>
	  
	    <programlisting>
* J'ai des messages "Local configuration error", du style:

553 relay.domain.net config error: mail loops back to myself
554 &lt;user@domain.net&gt;... Local configuration error

Comment puis-je r&eacute;soudre ce probl&egrave;me?

Vous avez demand&eacute; que le courrier pour un domaine (e.g., domain.net) soit
transmis &agrave; une machine donn&eacute;e (dans ce cas pr&eacute;cis, relay.domain.net) avec
un enregistrement MX, mais la machine relais ne se conna&icirc;t pas elle-m&ecirc;me
comme domain.net. Ajoutez domain.net &agrave; /etc/sendmail.cw (si vous utilisez
FEATURE(use_cw_file)) ou ajoutez "Cw domain.net" &agrave; /etc/sendmail.cf.</programlisting>
	  
	  <para>La FAQ Sendmail se trouve dans
	    <filename>/usr/src/usr.sbin/sendmail</filename>. Je vous en 
            recommande la lecture si vous voulez &ldquo;bidouiller&rdquo;
            votre configuration du courrier &eacute;lectronique.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Comment puis-je g&egrave;rer le courrier &eacute;lectronique avec une
             connexion t&eacute;l&eacute;phonique PPP?</title>
	  
	  <para>Vous voulez connecter une machine FreeBSD du r&eacute;seau local
            &agrave; l'Internet. Cette machine servira de passerelle de courrier
            pour le r&eacute;seau local. La connexion PPP n'est pas d&eacute;di&eacute;e.</para>
	  
	  <para>Il y a au moins deux fa&ccedil;ons de faire.</para>
	  
	  <para>L'une d'elle est d'utiliser UUCP. Voici l'autre.</para>
	  
	  <para>Le point cl&eacute; est d'obtenir d'un site Internet qu'il vous
            fournisse les services MX secondaires pour votre domaine. Par
            exemple:</para>

	    <programlisting>
bigco.com.	      MX	10	bigco.com.
                      MX        20      smalliap.com.</programlisting>
	  
	  <para>Il doit y avoir une seule machine comme destinataire final
            (ajoutez <literal>Cw bigco.com</literal> au fichier
            <filename>/etc/sendmail.cf</filename> de bigco.com).</para>
	  
	  <para>Quand les <command>sendmail</command> exp&eacute;diteurs essayeront
            de vous d&eacute;livrer du courrier, ils essayerons de vous contacter via
            votre liaison modem. Ce qui &eacute;chouera tr&egrave;s probablement sur 
            d&eacute;passement de d&eacute;lai puisque vous n'&ecirc;tes pas en ligne.
	    <command>sendmail</command> enverra automatiquement le courrier au
            site MX secondaire, i.e.: votre fournisseur d'acc&egrave;s. Celui-ci 
            essayera toutes les 15 minutes (<literal>sendmail_flags = 
            "-bd -q15m"</literal> dans <filename>/etc/rc.conf</filename>) 
            de se connecter &agrave; votre machine pour exp&eacute;dier le courrier au site 
            MX primaire.</para>
	  
	  <para>Vous pouvez utiliser quelque chose comme ceci comme
            proc&eacute;dure de connexion:</para>

	    <programlisting>
#!/bin/sh
# Mettez-moi dans /usr/local/bin/pppbigco
( sleep 60 ; /usr/sbin/sendmail -q ) &amp;
/usr/sbin/ppp -direct pppbigco</programlisting>

	  <para>Si vous d&eacute;finissez une proc&eacute;dure de connexion particuli&egrave;re
            pour un utilisateur, vous pouvez utiliser <command>sendmail
	    -qRbigco.com</command> au lieu de la proc&eacute;dure ci-dessus. Cela
            forcera le traitement imm&eacute;diat de tout le courrier dans la file
            d'attente pour bigco.com.</para>
	  
	  <para>On peut encore affiner comme suit la configuration:</para>
	  
	  <para>Message emprunt&eacute; &agrave; la liste de diffusion freebsd-isp.</para>

	    <programlisting>
&gt; Nous fournissons un MX secondaire &agrave; un client. Le client se connecte
&gt; &agrave; notre service automatiquement plusieurs fois par jour pour acheminer
&gt; le courrier sur son MX primaire (nous n'appelons pas son site lorsque
&gt; du courrier lui arrive). Notre sendmail envoie le courrier de la file
&gt; d'attente toutes les demi-heures. Pour l'instant, il doit rester une
&gt; demi-heure en ligne pour &ecirc;tre s&ucirc;r que tout le courrier soit arriv&eacute; au
&gt; MX primaire.
&gt;  
&gt; Y-a-t-il une commande qui permette de dire &agrave; sendmail d'envoyer 
&gt; sur-le-champ tout le courrier? L'utilisateur n'a &eacute;videmment pas
&gt; les droits super-utilisateur sur la machine. 

Dans la section 'indicateurs de confidentialit&eacute;' de sendmail.cf,
il y a la d&eacute;finition :
                        Opgoaway,restrictqrun

Supprimer restrictqrun permet &agrave; d'autres utilisateurs que le super-utilisateur
de lancer le traitement de la file d'attente. Vous pouvez aussi red&eacute;finir les
MXs. Nous sommes le premier MX pour les utilisateurs de ce type et nous avons
d&eacute;fini:

# Si nous sommes le meilleur MX pour une machine, essayer directement au lieu 
# d'&eacute;mettre des messages d'erreur de configuration locale.
OwTrue

De cette fa&ccedil;on, un site distant vous enverra le courrier, sans essayer de
se connecter chez votre client. Vous le lui transmettez ensuite. Cela ne
marche qu'avec "hosts", vous n'avez donc pas besoin que votre client appelle
son serveur de courrier "client.com" ou "machine.client.com" dans le DNS.
Mettez seulement un enregistrement A pour "client.com" dans le DNS.</programlisting>
	  
	</sect2>
      </sect1>
    </chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-shorttag: nil
     sgml-always-quote-attributes: t
     sgml-minimize-attributes: max
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End:
-->
