<!--
     The FreeBSD Documentation Project

     $FreeBSD$
-->

<chapter id="backups">
  <title>Backups</title>
  
  <para>Las cuestiones de compatibilidad de hardware se encuentran entre las m&aacute;s 
    problem&aacute;ticas hoy en d&iacute;a en la industria de los componentes de ordenador 
    y FreeBSD no es, de ning&uacute;n modo, inmune a estos problemas. A este respecto, la 
    ventaja de FreeBSD consistente en su capacidad para funcionar sobre componentes normales 
    de PC supone una carga a la hora de soportar la sorprendente variedad de componentes que 
    hay en el mercado. Si bien ser&iacute;a imposible suministrar una lista exhaustiva de 
    componentes que FreeBSD soporta, esta secci&oacute;n sirve de cat&aacute;logo de los 
    controladores de dispositivo incluidos con FreeBSD y de los componentes que cada 
    controlador soporta. Donde resulta posible y adecuado, se incluye notas acerca de 
    productos espec&iacute;ficos. Puede usted consultar la secci&oacute;n de 
    <link linkend="kernelconfig-config">configuraci&oacute;n del n&uacute;cleo</link>, en 
    este mismo manual, donde encontrar&aacute; una lista de los dispositivos soportados.
  </para>

  <para>Como FreeBSD es un proyecto realizado por voluntarios y carece de un departamento de 
    pruebas financiado, dependemos de usted, el usuario, para gran parte de la informaci&oacute;n 
    contenida en este cat&aacute;logo de dispositivos. Si tiene usted experiencia directa de 
    componentes que funcionen o que no funcionen con FreeBSD, por favor notif&iacute;quenoslo 
    mediante correo electr&oacute;nico a la lista &a.doc;. Las preguntas acerca de los 
    dispositivos soportados pueden dirigirse a la lista &a.questions (consulte 
    <link linkend="eresources-mail">Listas de Correo</link> para m&aacute;s informaci&oacute;n). 
    Cuando env&iacute;e informaci&oacute;n o realice una pregunta, por favor recuerde especificar 
    exactamente qu&eacute; versi&oacute;n de FreeBSD est&aacute; utilizando, as&iacute; como 
    incluir tantos detalles de los componentes de su ordenador como sea posible.
  </para>

  <sect1 id="backups-tapebackups">
    <title>Soportes de cinta</title>
    
    <para>Los principales soportes de cinta son: 4 mm, 8 mm, QIC, mini-cartuchos y DLT.</para>
    
    <sect2 id="backups-tapebackups-4mm">
      <title>4 mm (DDS: Digital Data Storage, Almacenamiento digital de datos)</title>

      <para>Las cintas de 4 mm est&aacute;n sustituyendo a las QIC como el soporte de copias 
        de seguridad m&aacute;s popular. Esta tendencia se aceler&oacute; considerablemente 
        cuando Conner compr&oacute; Archive, un destacado fabricante de unidades QIC, y 
        entonces detuvo la producci&oacute;n de unidades QIC. Las unidades de 4 mm son 
        peque&ntilde;as y silenciosas, pero no tienen la reputaci&oacute;n de fiabilidad de 
        las unidades de 8 mm. Los cartuchos son menos caros y m&aacute;s peque&ntilde;os 
        (76 x 51 x 12 mm, 3 x 2 x 0.5 pulgadas) que los cartuchos de 8 mm. Las unidades de 4 mm, 
        como las de 8 mm, presentan una vida comparativamente corta del cabezal por el mismo 
        motivo, ambas emplean un barrido helicoidal.
      </para>

      <para>La tasa de transferencia de datos en estas unidades comienza en torno a 150 kB/s, 
        alcanzando picos de 500 kB/s. La capacidad de almacenamiento comienza en 1.3 GB y llega 
        hasta 2.0 GB. La compresi&oacute;n mediante hardware, disponible en la mayor&iacute;a 
        de estas unidades, duplica aproximadamente la capacidad. Las unidades de cinta 
        m&uacute;ltiples pueden constar de 6 unidades en un mismo chasis, con funciones de 
        cambio autom&aacute;tico de cintas. La capacidad de las librer&iacute;as (de cintas) 
        alcanzan 240 GB.
      </para>

      <para>Las unidades de 4 mm, como las de 8 mm, emplean un barrido helicoidal. Todas las 
        ventajas e inconvenientes del barrido helicoidal son aplicables tanto a las unidades 
        de 4 mm, como a las de 8 mm.
      </para>

      <para>Las cintas deber&iacute;an ser retiradas de uso tras 2000 lecturas o 100 copias 
        de seguridad completas.
      </para>
    </sect2>
    
    <sect2 id="backups-tapebackups-8mm">
      <title>8 mm (Exabyte)</title>
      
      <para>Las unidades de 8 mm son las m&aacute;s comunes para controladoras SCSI; son la 
        mejor elecci&oacute;n para intercambiar cintas. En casi cualquier sistema se puede 
        encontrar una unidad Exabyte de 8 mm con 2 GB de capacidad. Las unidades de 8 mm son 
        fiables, c&oacute;modas y silenciosas. Los cartuchos son baratos y peque&ntilde;os 
        (122 x 84 x 15 mm; 4.8 x 3.3 x 0.6 pulgadas). Un inconveniente de las cintas de 8 mm 
        es la vida relativamente corta de la cinta y de los cabezales, debido a la alta tasa 
        de movimiento relativo entre ambos.
      </para>

      <para>La tasa de transferencia de datos oscila, aproximadamente, entre 250 kB/s y 
        500 kB/s. La capacidad de almacenamiento comienza en 300 MB y alcanza 7 GB. La 
        compresi&oacute;n mediante hardware, disponible en la mayor&iacute;a de estas unidades, 
        aproximadamente dobla la capacidad. Esta unidades est&aacute;n disponibles como unidades 
        independientes y como unidades de cinta m&uacute;ltiples, con 6 unidades y 120 cintas 
        en un mismo chasis. Las cintas son cambiadas autom&aacute;ticamente por la unidad. La 
        capacidad de las librer&iacute;as alcanza m&aacute;s de 840 GB.
      </para>

      <para>La informaci&oacute;n se registra en la cinta empleando para ello un barrido 
        helicoidal, los cabezales se sit&uacute;an formando un cierto &aacute;ngulo con la 
        cinta (aproximadamente 6 grados). La cinta rodea 270 grados al soporte que sostiene 
        los cabezales. El soporte gira mientras la cinta se desliza sobre ella. El resultado 
        es una gran densidad de datos y las pistas dispuestas muy cerca entre s&iacute; y a 
        trav&eacute;s de la cinta, formando un &aacute;ngulo, desde un extremo hasta el otro.
      </para>
    </sect2>
    
    <sect2 id="backups-tapebackups-qic">
      <title>QIC</title>
      
      <para>Las cintas y las unidades QIC-150 son, quiz&aacute;s, las m&aacute;s comunes. Las 
        unidades QIC son las menos caras de entre las unidades de backup "serias". El 
        inconveniente es el coste de las cintas. Las cintas QIC son caras comparadas con las 
        de 8mm o las de 4mm, hasta 5 veces m&aacute;s caras por GB. Pero si sus necesidades se 
        pueden satisfacer con media docena de cintas, QIC puede ser una elecci&oacute;n acertada. 
        Las unidades QIC son las unidades de cinta <emphasis>m&aacute;s</emphasis> comunes. En 
        todos los sistemas hay una unidad QIC de alguna densidad. Ahi reside el problema, QIC 
        presenta un gran n&uacute;mero de densidades en cintas f&iacute;sicamente similares 
        (en ocasiones, id&eacute;nticas). Las unidades QIC no son silenciosas. Estas unidades 
        resultan audibles cuando se sit&uacute;an antes de comenzar a escribir y claramente 
        audibles cuando leen, escriben o se sit&uacute;an (seek). Las dimensiones de las cintas 
        QIC son: 15.2 x 10.2 x 1.7 mm (6 x 4 x 0.7 pulgadas). Los 
        <link linkend="backups-tapebackups-mini">mini-cartuchos</link>, que tambi&eacute;n 
        utilizan cinta de 1/4 de pulgada de anchura, se comentan en otro apartado. No 
        est&aacute;n disponibles ni cambiadores, ni unidades m&uacute;ltiples de cintas.
      </para>

      <para>La tasa de transferencia de datos oscila entre, aproximadamente, 150k B/s y 500kB/s. 
        La capacidad de almacenamiento oscila ente 40 MB y 15 GB. La compresi&oacute;n mediante 
        hardware est&aacute; disponible en muchas de las nuevas unidades QIC. Las unidades QIC 
        se instalan cada vez menos; est&aacute;n siendo desplazadas por las unidades DAT.
      </para>

      <para>La informaci&oacute;n se almacena en pistas. Las pistas est&aacute;n dispuestas 
        longiudinalmente en la cinta, de un extremo al otro. El n&uacute;mero de pistas, y por 
        tanto la anchura de las mismas, var&iacute;a en funci&oacute;n de la capacidad de la 
        cinta. Si no todas, la mayor&iacute;a de las unidades nuevas presentan compatibilidad 
        con las anteriores al menos para la lectura (frecuentemente, tambi&eacute;n para la 
        escritura). QIC tiene una buena reputaci&oacute;n en relaci&oacute;n con la seguridad 
        de los datos (el mecanismo es m&aacute;s simple y m&aacute;s robusto que el de las 
        unidades con barrido helicoidal).
      </para>

      <para>Las cintas deber&iacute;n ser retiradas de uso tras 5000 copias de seguridad.</para>
    </sect2>
    
    <sect2 id="backups-tapebackups-mini">
      <title>* Mini-Cartuchos</title>
      
      <para></para>
    </sect2>
    
    <sect2 id="backups-tapebackups-dlt">
      <title>DLT</title>

      <para>Las unidades DLT presentan la tasa de transferencia de datos m&aacute;s elevada 
        de todos los tipos de unidades comentados. La cinta de 12.5 mm (1/2  pulgada) 
        est&aacute; contenida en un cartucho de una &uacute;nica bobina (100 x 100 x 25 mm; 
        4 x 4 x 1 pulgadas). El cartucho tiene una puerta que se abate a lo largo de un 
        costado del mismo. El mecanismo de la unidad abre esta puerta para extraer la 
        gu&iacute;a de la cinta. La gu&iacute;a de la cinta tiene un agujero oval que es 
        usado por la unidad para "enganchar" la cinta. La bobina en la que se va a enrollar 
        la cinta se localiza en el interior de la unidad. Los restantes cartuchos de cinta 
        mencionados (con la &uacute;nica excepci&oacute;n de las cintas de 9 pistas) tienen 
        situadas en el interior del propio cartucho ambas bobinas, tanto aquella en la que 
        est&aacute; inicialmente enrollada la cinta, como la bobina en la que se va a enrollar.
      </para>

      <para>La tasa de transferencia de datos es aproximadamente 1.5 MB/s, tres veces la de 
        las unidades de 4 mm, de 8 mm y QIC. La capacidad oscila entre 10 GB y 10 GB para una 
        unidad sencilla. Las unidades se encuentran disponibles como unidades sencillas con 
        cambiador de cintas y tambi&eacute;n como unidades m&uacute;ltiples con cambiador de 
        cintas, conteniendo desde 5 hasta 900 cintas, desde 1 a 20 unidades y siendo capaces 
        de almacenar entre 50 GB y 9 TB.
      </para>

      <para>La informaci&oacute;n se graba en la cinta en pistas paralelas a la direcci&oacute;n 
        de desplazamiento (como en las cintas QIC). Se escriben dos pistas a la vez. La vida 
        &uacute;til de los cabezales de lectura/escritura es relativamente larga; una vez la 
        cinta se detiene, no hay movimiento relativo entre los cabezales y la cinta.
      </para>
    </sect2>
    
    <sect2>
      <title>Usando una cinta nueva por primera vez</title>
      
      <para>La primera vez que intente leer o escribir en una cinta nueva y completamente virgen, 
        la operaci&oacute;n fracasar&aacute;. Los mensajes de la consola deber&iacute;an ser 
        similares a los siguientes:
      </para>
      
      <screen>sa0(ncr1:4:0): NOT READY asc:4,1
sa0(ncr1:4:0):  Logical unit is in process of becoming ready</screen>
      
      <para>La cinta no contiene un bloque de identificaci&oacute;n (bloque n&uacute;mero 0). 
        Desde la adopci&oacute;n del standard QIC-525, todas las unidades QIC escriben en la 
        cinta un bloque de identificaci&oacute;n. Caben dos soluciones:
      </para>
      
      <para><command>mt fsf 1</command> hace que la unidad escriba un bloque de 
        identificaci&oacute;n en la cinta.
      </para>
      
      <para>Use el bot&oacute;n del panel frontal de la unidad para expulsar la cinta.</para>
      
      <para>Reinserte la cinta y transfiera mediante &man.dump.8; la informaci&oacute;n a 
        la cinta.
      </para>
      
      <para>&man.dump.8; mostrar&aacute; el mensaje <literal>DUMP: End of tape
	  detected</literal> y en la consola aparecer&aacute;: <literal>HARDWARE
	  FAILURE info:280 asc:80,96</literal></para>
      
      <para>rebobine la cinta utilizando: <command>mt rewind</command></para>
      
      <para>Las siguientes operaciones sobre la cinta tendr&aacute;n &eacute;xito.</para>
    </sect2>
  </sect1>
  
  <sect1 id="backup-programs">
    <title>Programas para hacer copias de seguridad</title>
    
    <para>Los tres programas principales son
	&man.dump.8;,
	&man.tar.1;,
      y
	&man.cpio.1;.</para>
    
    <sect2>
      <title>Dump y Restore</title>
      
      <para>&man.dump.8; y &man.restore.8; son los programas tradicionales de Unix para 
        realizar copias de seguridad. Operan sobre la unidad como si &eacute;sta fuese un 
        conjunto de bloques de disco, a un nivel inferior a las abstracciones de archivos, 
        enlaces y directorios, creadas por los sistemas de archivos. &man.dump.8; hace copias 
        de seguridad de dispositivos, sistemas de archivos enteros, no de partes de un sistema 
        de archivos ni de &aacute;rboles de directorios que se extienden por m&aacute;s de un 
        sistema de archivos utilizando enlaces simb&oacute;licos, o bien montando un sistema 
        bajo el otro. &man.dump.8; no escribe en la cinta archivos ni directorios, sino que 
        m&aacute;s bien escribe bloques de datos que son las piezas con las que se construyen 
        los archivos y directorios.  &man.dump.8; presenta peculiaridades que provienen de su 
        origen en la Versi&oacute;n 6 del Unix de ATT (en torno a 1975). Los par&aacute;metros 
        por defecto resultan adecuados para las cintas de 9 pistas (6250 bpi), pero no para los 
        soportes de alta densidad disponibles hoy en d&iacute;a (hasta 62,182 ftpi). Estos 
        valores por defecto deben ser anulados mediante la l&iacute;nea de comandos para 
        utilizar la capacidad de las unidades de cinta actuales.
      </para>
      
      <para>&man.rdump.8; y &man.rrestore.8; hacen copias de seguridad a trav&eacute;s de la 
        red, en una unidad conectada a otro ordenador. Ambos programas se basan en &man.rcmd.3; 
        y &man.ruserok.3; para acceder a la unidad de cinta remota. Por tanto, el usuario que 
        realiza la copia de seguridad debe tener acceso al ordenador remoto mediante 
        <literal>rhosts</literal>. Los argumentos suministrados a &man.rdump.8; y a 
        &man.rrestore.8; deben ser adecuados para el ordenador remoto. (Por ejemplo, cuando 
        est&eacute; volcando datos mediante <command>rdump</command> desde un ordenador con 
        FreeBSD a una unidad Exabyte conectada a una estaci&oacute;n Sun, de nombre 
        <hostid>komodo</hostid>, emplee: 
        <command>/sbin/rdump 0dsbfu 54000 13000 126 komodo:/dev/nrsa8 /dev/rda0a 2>&amp;1</command>) 
        Atenci&oacute;n: permitir comandos <literal>rhosts</literal> afecta a la seguridad. 
        Eval&uacute;e su sitaci&oacute;n ciudadosamente.
      </para>
    </sect2>

    <sect2>
      <title>Tar</title>
      
      <para>&man.tar.1; tambi&eacute;n se remonta a la Versi&oacute;n 6 del Unix de ATT 
        (hacia 1975). &man.tar.1; trabaja con el sistema de archivos; &man.tar.1; escribe
        archivos y directorios en la cinta. &man.tar.1; no soporta todas las opciones 
        disponibles para &man.cpio.1;, pero &man.tar.1; no necesita la inusual tuber&iacute;a 
        que &man.cpio.1; emplea.
      </para>
      
      <para>La mayor parte de las versiones de  &man.tar.1; no soportan la realizaci&oacute;n 
        de copias de seguridad a trav&eacute;s de la red. La versi&oacute;n GNU de &man.tar.1;, 
        la que se usa en FreeBSD, soporta dispositivos remotos empleando la misma sintaxis que 
        &man.rdump.8;. Para hacer una copia de seguridad mediante &man.tar.1; a una unidad 
        Exabyte conectada a una estaci&oacute;n Sun de nombre <hostid>komodo</hostid>, se 
        utilizar&iacute;a: <command>/usr/bin/tar cf komodo:/dev/nrsa8 . 2>&amp;1</command>.  
        Para las versiones que no soportan dispositivos remotos, se puede utilizar una 
        tuber&iacute;a y &man.rsh.1; para enviar los datos a la unidad remota.
      </para>
    </sect2>
    
    <sect2>
      <title>Cpio</title>
      
      <para>&man.cpio.1; es el programa original de Unix para intercambiar archivos mediante 
        soportes magn&eacute;ticos. &man.cpio.1; tiene, entre muchas otras, opciones para 
        realizar intercambio (swapping) de bytes, escribir en diferentes formatos de archivo y
        enviar mediante una tuber&iacute;a los datos a otros programas. Esta &uacute;ltima 
        prestaci&oacute;n hace de &man.cpio.1; una excelente elecci&oacute;n para soportes de 
        instalaci&oacute;n. &man.cpio.1; no sabe c&oacute;mo recorrer el &aacute;rbol de 
        directorios, por lo que se le debe suministrar una lista de archivos a trav&eacute;s 
        de <filename>stdin</filename>.
      </para>
      
      <para>&man.cpio.1; no soporta la realizaci&oacute;n de copias de seguridad a trav&eacute;s 
        de la red. Puede utilizar una tuber&iacute;a junto con &man.rsh.1; para enviar los datos 
        a una unidad de cinta remota.
      </para>
    </sect2>
    
    <sect2>
      <title>Pax</title>
      
      <para>&man.pax.1; es la respuesta de IEEE/POSIX a &man.tar.1; y a &man.cpio.1;. A lo 
        largo de los a&ntilde;os, las distintas versiones de &man.tar.1; y de &man.cpio.1; se 
        han vuelto ligeramente incompatibles. Por ello, m&aacute;s que luchar para estandarizarlas 
        completamente, POSIX cre&oacute; un nuevo programa para realizar copias de seguridad. 
        &man.pax.1; lee y escribe en varios de los diversos formatos de &man.cpio.1; y 
        &man.tar.1;, adem&aacute;s de nuevos formatos propios. Su juego de comandos se parece 
        m&aacute;s al de &man.cpio.1; que al de &man.tar.1;.
      </para>
    </sect2>

    <sect2 id="backups-programs-amanda">
      <title>Amanda</title>
      
      <para><ulink url="../ports/misc.html#amanda-2.4.0">Amanda</ulink>	(Advanced Maryland 
        Network Disk Archiver) constituye, m&aacute;s que un &uacute;nico programa, un 
        sistema con estructura cliente/servidor. Un servidor de Amanda realizar&aacute;, en 
        una &uacute;nica unidad de cinta, copias de seguridad de un n&uacute;mero indeterminado 
        de ordenadores que tengan clientes de Amanda y comunicaci&oacute;n mediante red con 
        el servidor de Amanda. Un problema habitual en aquellos lugares en los que hay muchos 
        discos grandes consiste en que el tiempo necesario para realizar copias de seguridad 
        directamente sobre la cinta excede el tiempo disponible para la tarea. Amanda soluciona 
        este problema. Amanda puede utilizar un "disco contenedor" para realizar copias de 
        seguridad de varios sistemas de archivos a la vez. Amanda crea "juegos de archivos": un 
        grupo de cintas utilizadas por un determinado periodo de tiempo para hacer copias de 
        seguridad completas (full backups) de todos los sistemas de archivos indicados en el 
        archivo de configuraci&oacute;n de Amanda. El "juego de archivos" tambi&eacute;n 
        contiene copias de seguridad incrementales (o diferenciales) de los sistemas de archivos, 
        realizadas diariamente (normalmente por la noche). Restaurar un sistema de archivos 
        da&ntilde;ado requiere la copia de seguridad completa m&aacute;s reciente y las copias 
        de seguridad incrementales.
      </para>

      <para>El archivo de configuraci&oacute;n permite un control preciso de las copias de 
        seguridad y del tr&aacute;fico que Amanda genera en la red. Amanda usar&aacute; cualquiera 
        de los programas mencionados arriba para escribir los datos en la cinta. Amanda se 
        encuentra disponible tanto en forma de port, como en forma de paquete (package). Amanda no
        se instala por defecto.
      </para>
    </sect2>

    <sect2>
      <title>No haga nada</title>
      
      <para>&ldquo;No haga nada&rdquo; no es un programa de ordenador, pero es la estrategia 
        de copias de seguridad m&aacute;s ampliamente usada. No presenta costes iniciales. No 
        hay que seguir ninguna planificaci&oacute;n. Simplemente diga no. Si algo le sucediese 
        a sus datos, sonr&iacute;a y res&iacute;gnese!
      </para>
	
      <para>Si su tiempo y sus datos no tienen valor alguno, entonces &ldquo;No haga nada&rdquo; 
        es el procedimiento de realizaci&oacute;n de copias de seguridad m&aacute;s adecuado 
        para usted. Pero sepa que, como Unix es una herramienta &uacute;til, puede que en seis 
        meses tenga usted una colecci&oacute;n de archivos que le resulte valiosa.
      </para>

      <para>&ldquo;No haga nada&rdquo; es el m&eacute;todo de realizaci&oacute;n de copias de 
        seguridad apropiado para <filename>/usr/obj</filename> y otros &aacute;rboles de 
        directorios que pueden ser exactamente reproducidos por su odenador. Un ejemplo de 
        esto lo constituyen los archivos que contienen las p&aacute;ginas de este manual, que 
        han sido generados a partir de archivos <acronym>SGML</acronym>. Hacer copias de seguridad 
        de estos archivos <acronym>HTML</acronym> resulta innecesario. De los archivos fuente en 
        formato <acronym>SGML</acronym> se realiza regularmente copias de seguridad.
      </para>
    </sect2>
    
    <sect2>
      <title>&iquest;Qu&eacute; programa es el mejor para realizar copias de seguridad?</title>
      
      <para>&man.dump.8; <emphasis>Punto.</emphasis> Elizabeth D. Zwicky prob&oacute; 
        concienzudamente todos los programas para realizar copias de seguridad aqu&iacute; 
        comentados. La mejor elecci&oacute;n para preservar todos los datos y las peculiaridades 
        de los sistemas de archivos de Unix es &man.dump.8;. Elizabeth cre&oacute; sistemas de 
        archivos que presentaban una gran variedad de condiciones inusuales (y algunas no tan 
        inusuales) y prob&oacute; cada programa haciendo copias de seguridad de esos sistemas 
        de archivos y restaur&aacute;ndolas. Estas condiciones inusuales inclu&iacute;an: 
        archivos con huecos, archivos con huecos y con un bloque de caracteres NULL, archivos 
        con caracteres extra&ntilde;os en el nombre, archivos sobre los que no se pod&iacute;a 
        leer ni escribir, dispositivos, archivos que cambiaban de tama&ntilde;o durante la 
        realizaci&oacute;n de la copia de seguridad, archivos que eran creados/borrados durante 
        la realizaci&oacute;n de la copia de seguridad, etc. Elisabeth present&oacute; los 
        resultados de su estudio en LISA V, en octubre de 1991. V&eacute;ase 
        <ulink url="http://reality.sgi.com/zwicky_neu/testdump.doc.html">Torture-testing Backup 
        and Archive Programs</ulink>.
      </para>
    </sect2>
    
    <sect2>
      <title>Procedimiento de restauraci&oacute;n de emergencia</title>
      
      <sect3>
	<title>Antes del desastre</title>
	
	<para>Hay cuatro pasos que necesita realizar para prepararse para cualquier desastre que 
          pudiera ocurrir.
        </para>
	    
	<para>En primer lugar, imprima la tabla de particiones BSD (disklabel) de cada uno de 
          sus discos (por ejemplo, <command>disklabel da0 | lpr</command>), su tabla de sistemas 
          de archivos (<command>/etc/fstab</command>) y todos los mensajes que aparecen al 
          iniciar el sistema operativo. Haga dos copias de cada uno.
        </para>

	<para>En segundo lugar, compruebe que los discos de inicio y de reparaci&oacute;n 
          (<filename>boot.flp</filename> y <filename>fixit.flp</filename>) contienen controladores 
          para todos sus dispositivos. El modo m&aacute;s sencillo de comprobarlo es reiniciar 
          el ordenador con el disco de arranque en la disquetera y comprobar los mensajes que 
          aparecen al iniciarse el sistema operativo. Si todos sus dispositivos aparecen 
          mencionados y est&aacute;n operativos, pase al punto tercero.
        </para>

	<para>De no ser as&iacute;, deber&aacute; crear a medida dos discos de inicio que 
          contengan un n&uacute;cleo que permita montar todos sus discos y acceder a su unidad 
          de cinta. Estos discos deben contener: &man.fdisk.8;, &man.disklabel.8;, &man.newfs.8;, 
          &man.mount.8;, y cualquier otro programa que utilice para realizar copias de seguridad. 
          Estos programas deben estar enlazados est&aacute;ticamente. Si utiliza &man.dump.8;, 
          el disquete deber&aacute; contener tambi&eacute;n &man.restore.8;.
        </para>

	<para>En tercer lugar, realice copias de seguridad regularmente. Cualquier cambio que 
          haga tras su &uacute;ltima copia de seguridad puede resultar perdido sin posibilidad 
          de recuperaci&oacute;n. Proteja contra escritura las cintas que contengan las copias 
          de seguridad.
        </para>

	<para>En cuarto lugar, pruebe los discos (bien <filename>boot.flp</filename> y 
          <filename>fixit.flp</filename> o bien los dos discos que cre&oacute; a medida en el 
          segundo paso) y las cintas que contienen las copias de seguridad. Tome notas del 
          proceso. Almacene esas notas junto con los discos de arranque, los datos que 
          imprimi&oacute; y las cintas que contienen las copias de seguridad. Se encontrar&aacute; 
          tan inquieto cuando proceda a la restauraci&oacute;n que las notas pueden impedir que 
          destruya las cintas que contienen las copias de seguridad (&iquest;C&oacute;mo? En 
          lugar de <command>tar xvf /dev/rsa0</command>, usted podr&iacute;a accidentalmente 
          teclear <command>tar cvf /dev/rsa0</command> y sobreescribir las cintas que contienen 
          las copias de seguridad).
        </para>

	<para>Como medida adicional de seguridad, haga discos de arranque y copias por duplicado 
          cada vez. Guarde uno de cada en un lugar lejano. Un lugar lejano NO es el s&oacute;tano 
          del mismo edificio. Varias compa&ntilde;&iacute;as aprendieron esta lecci&oacute;n por 
          las malas en el Centro Mundial del Comercio (World Trade Center). Un lugar lejano 
          deber&iacute;a estar f&iacute;sicamente separado de sus ordenadores y discos duros por 
          una distancia considerable.
        </para>

	<para>Un ejemplo de script para crear un disco de arranque:</para>
	  
	<programlisting>
<![ CDATA [#!/bin/sh
#
# crear un disco de recuperacion
#
# formatear el disco
#
PATH=/bin:/sbin:/usr/sbin:/usr/bin

fdformat -q fd0
if [ $? -ne 0 ]
then
	 echo "Disco defectuoso, por favor utilice uno nuevo."
	 exit 1
fi

# escribir bloques de arranque en el disco
#
disklabel -w -B /dev/rfd0c fd1440

#
# crear un nuevo sistema de archivos en la unica particion existente
#
newfs -t 2 -u 18 -l 1 -c 40 -i 5120 -m 5 -o space /dev/rfd0a

#
# montar el nuevo disco
#
mount /dev/fd0a /mnt

#
# crear los directorios necesarios 
#
mkdir /mnt/dev
mkdir /mnt/bin
mkdir /mnt/sbin
mkdir /mnt/etc
mkdir /mnt/root
mkdir /mnt/mnt			# para la particion raiz
mkdir /mnt/tmp
mkdir /mnt/var

#
# poblar los directorios
#
if [ ! -x /sys/compile/MINI/kernel ] 
then
	 cat << EOM
El nucleo MINI no existe, por favor cree uno.
Aqui tiene un ejemplo de archivo de configuracion:
#
# MINI -- Un nucleo para poner FreeBSD en un disco
#
machine		"i386"
cpu		"I486_CPU"
ident		MINI
maxusers	5

options		INET			# necesario para _tcp _icmpstat _ipstat
					 # _udpstat _tcpstat _udb
options		FFS			# sistema de archivos rapido (Fast
                                         # File System) de Berkeley 
options		FAT_CURSOR		# cursor en forma de bloque en syscons o
                                         # pccons
options		SCSI_DELAY=15		# ser pesimista acerca de dispositivos
                                         # SCSI genericos
options		NCONS=2		        # 1 consola virtual
options		USERCONFIG		# permitir la configuracion por el
                                         # usuario mediante -c XXX

config		kernel	root on da0 swap on da0 and da1 dumps on da0

controller	isa0
controller	pci0

controller	fdc0	at isa? port "IO_FD1" bio irq 6 drq 2 vector fdintr
disk		fd0	at fdc0 drive 0

controller	ncr0

controller	scbus0

device		sc0	at isa? port "IO_KBD" tty irq 1 vector scintr
device		npx0	at isa? port "IO_NPX" irq 13 vector npxintr

device		da0
device		da1
device		da2

device		sa0

pseudo-device	loop		# requerido por INET
pseudo-device	gzip		# ejecutar archivos en formato a.out que estan
                                 # comprimidos con gzip
EOM
	 exit 1
fi

cp -f /sys/compile/MINI/kernel /mnt

gzip -c -best /sbin/init > /mnt/sbin/init
gzip -c -best /sbin/fsck > /mnt/sbin/fsck
gzip -c -best /sbin/mount > /mnt/sbin/mount
gzip -c -best /sbin/halt > /mnt/sbin/halt
gzip -c -best /sbin/restore > /mnt/sbin/restore

gzip -c -best /bin/sh > /mnt/bin/sh
gzip -c -best /bin/sync > /mnt/bin/sync

cp /root/.profile /mnt/root

cp -f /dev/MAKEDEV /mnt/dev
chmod 755 /mnt/dev/MAKEDEV

chmod 500 /mnt/sbin/init
chmod 555 /mnt/sbin/fsck /mnt/sbin/mount /mnt/sbin/halt
chmod 555 /mnt/bin/sh /mnt/bin/sync
chmod 6555 /mnt/sbin/restore

#
# crear los nodos de los dispositivos 
#
cd /mnt/dev
./MAKEDEV std
./MAKEDEV da0
./MAKEDEV da1
./MAKEDEV da2
./MAKEDEV sa0
./MAKEDEV pty0
cd /

#
# crear una tabla minima de sistemas de archivos
#
cat > /mnt/etc/fstab <<EOM
/dev/fd0a	/	ufs	rw 1 1
EOM

#
# crear un archivo de passwords minimo
#
cat > /mnt/etc/passwd <<EOM
root:*:0:0:Charlie &:/root:/bin/sh
EOM

cat > /mnt/etc/master.passwd <<EOM
root::0:0::0:0:Charlie &:/root:/bin/sh
EOM

chmod 600 /mnt/etc/master.passwd
chmod 644 /mnt/etc/passwd
/usr/sbin/pwd_mkdb -d/mnt/etc /mnt/etc/master.passwd

#
# desmontar el disco e informar al usuario
#
/sbin/umount /mnt]]></programlisting>
      </sect3>
      
      <sect3>
	<title>Tras el desastre</title>
	
	<para>La pregunta clave es: &iquest;ha sobrevivido su hardware? Como ha estado usted 
          realizando copias de seguridad regularmente, no hace falta que se preocupe por sus 
          datos.
        </para>
	
	<para>Si se ha da&ntilde;ado su hardware, comience por sustituir aquellos dispositivos 
          que se hayan estropeado.
        </para>
	
	<para>Si su hardware se encuentra bien, compruebe sus discos. Si est&aacute; usando un 
          disco de arranque creado a medida, arranque en modo monousuario (teclee 
          <literal>-s</literal> cuando aparezca el prompt <prompt>boot:</prompt>). S&aacute;ltese 
          el siguiente p&aacute;rrafo.
        </para>
	  
	<para>Si est&aacute; usando los disquetes <filename>boot.flp</filename> y 
          <filename>fixit.flp</filename>, contin&uacute;e leyendo. Introduzca el disquete 
          <filename>boot.flp</filename> en la primera unidad e inicie el ordenador. En la 
          pantalla aparecer&aacute; el men&uacute; original de instalaci&oacute;n. Seleccione 
          la opci&oacute;n de reparaci&oacute;n, 
          <literal>Fixit--Repair mode with CDROM or floppy</literal>. Cuando se le solicite, 
          introduzca el disquete <filename>fixit.flp</filename>. <command>restore</command> y 
          los otros programas que necesita se encuentran en <filename>/mnt2/stand</filename>.
        </para>

	<para>Recupere cada sistema de archivos por separado.</para>
	
	<para>Intente montar la partici&oacute;n ra&iacute;z de su primer disco mediante 
          &man.mount.8; (por ejemplo, <command>mount /dev/da0a /mnt</command>). Si la tabla de 
          particiones BSD (disklabel) se encuentra da&ntilde;ada, use &man.disklabel.8; para 
          reparticionar y etiquetar el disco de modo que coincida con la etiqueta que usted 
          imprimi&oacute; y guard&oacute;. Utilice &man.newfs.8; para volver a crear los sistemas 
          de archivos. Vuelva a montar la partici&oacute;n ra&iacute;z del disquete en modo de 
          lectura y escritura (<command>mount -u -o rw /mnt</command>). Use los programas 
          apropiados y las cintas que contienen las copias de seguridad para recuperar los datos 
          de este sistema de archivos (por ejemplo, <command>restore vrf /dev/sa0</command>). 
          Desmonte el sistema de archivos (por ejemplo, <command>umount /mnt</command>). Repita 
          este proceso para cada sistema de archivos que resultase da&ntilde;ado.
        </para>
	
	<para>Una vez que su sistema se encuentre funcionando, copie sus datos en cintas nuevas. 
          Sea lo que fuere lo que caus&oacute; la p&eacute;rdida de datos, puede suceder 
          nuevamente. Emplear una hora en esta tarea le puede salvar de problemas adicionales en 
          el futuro.</para>
      </sect3>
      
      <sect3>
	<title>* No me prepar&eacute; para el desastre, &iquest;Qu&eacute; hago ahora?</title>
	
	<para></para>
      </sect3>
    </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
