Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/port-mentor-guidelines/_index.po
Languages: es, ru

source: Port Mentor Guidelines for FreeBSD Mentors
es: Instrucciones para los Mentores de Ports de FreeBSD
ru: Руководство для наставников портов FreeBSD

source: Port Mentor Guidelines
es: Instrucciones para los Mentores de Ports
ru: Руководство для наставников портов

source: Guideline for Mentor/Mentee Relationships
es: Guía para las Relaciones Mentor/Aprendiz
ru: Рекомендации по взаимоотношениям наставника и подопечного

source: This section is intended to help demystify the mentoring process, as well as a way to openly promote a constructive discussion to adapt and grow the guidelines. In our lives we have too many rules; we are not a government organization that inflicts regulation, but rather a collective of like minded individuals working toward a common goal, maintaining the quality assurance of the product we call the Ports Tree.
es: Esta sección está destinada a ayudar a desmitificar el proceso de orientación (mentorship), así como a promover abiertamente una discusión constructiva para adaptar y desarrollar las directrices. En nuestras vidas tenemos demasiadas reglas; no somos una organización gubernamental que impone una regulación, sino un colectivo de personas afines que trabajan para lograr un objetivo común, manteniendo la garantía de calidad del producto que llamamos árbol de ports.
ru: Этот раздел предназначен для того, чтобы помочь развеять таинственность процесса наставничества, а также открыто способствовать конструктивному обсуждению для адаптации и развития руководящих принципов. В нашей жизни слишком много правил; мы не государственная организация, навязывающая регулирование, а скорее коллектив единомышленников, работающих для достижения общей цели — поддержания гарантии качества продукта, который мы называем Деревом Портов.

source: Why Mentor?
es: ¿Por qué hacer de mentor?
ru: Почему наставник (mentor)?

source: For most of us, we were mentored into the Project, so return the favor by offering to mentor somebody else in.
es: La mayoría de nosotros, fuimos guiados en el proyecto, así que devolvamos el favor ofreciendo guía a alguien más.
ru: У большинства из нас были наставники, и это наставничество в Проекте было важным и полезным, поэтому верните эти усилия, предложив стать наставником для кого-то другого.

source: You have an irresistible urge to inflict knowledge on others.
es: Tienes un impulso irresistible de traspasar conocimiento a otros.
ru: У вас есть непреодолимое желание делиться знаниями с другими.

source: The usual punishment applies because you are sick and tired of committing somebody else's good work!
es: ¡Es un castigo habitual y estás cansado de hacer los commits del buen trabajo de otra persona!
ru: В наказание за это вы обрекаете себя на добровольную каторгу коммитить хорошую работу, сделанную другими!

source: Mentor/Co-Mentor
ru: Наставник/Сонаставник

source: Reasons for a co-mentorship:
es: Razones para una co-orientación:
ru: Причины для совместного наставничества:

source: Significant timezone differential. Accessible, interactive mentor(s) available via IM is extremely helpful!
es: Diferencia significativa de zona horaria. ¡Los mentores accesibles y disponibles a través de IM son extremadamente útiles!
ru: Значительная разница во времени. Доступные, интерактивные наставники, доступные через IM, крайне полезны!

source: Potential language barrier. Yes, FreeBSD is very English oriented, as is most software development, however, having a mentor who can speak a native language can be very useful.
es: Potencial barrera de idioma. Sí, FreeBSD está muy orientado al inglés, al igual que ocurre en el resto del área del desarrollo de software, sin embargo, tener un mentor que hable un idioma nativo puede ser muy útil.
ru: Потенциальный языковой барьер. Да, FreeBSD, как и большинство разработок программного обеспечения, ориентирована на английский язык, однако наличие наставника, говорящего на родном языке, может быть очень полезным.

source: ENOTIME! Until there is a 30 hour day, and an 8 day week, some of us only have so much time to give. Sharing the load with somebody else will make it easier.
es: ¡ENOTIME! Hasta que haya un día de 30 horas y una semana de 8 días, algunos de nosotros no tenemos mucho tiempo para dedicar. Compartir la carga con otra persona hará que sea más fácil.
ru: ВРЕМЕНИ НЕТ! Пока в сутках не станет 30 часов, а в неделе — 8 дней, у некоторых из нас просто не хватает времени. Разделение нагрузки с кем-то другим облегчит задачу.

source: A rookie mentor can benefit from the experience of a senior committer/mentor.
es: Un mentor novato puede beneficiarse de la experiencia de un committer/mentor senior.
ru: Наставник для новичков может получить пользу от опыта старшего коммиттера/наставника.

source: Two heads are better than one.
es: Dos cabezas piensan más que una.
ru: Две головы лучше, чем одна.

source: Reasons for sole mentorship:
es: Razones para la orientación en solitario:
ru: Причины индивидуального наставничества:

source: You do not play nicely with others.
es: No trabajas bien con otras personas.
ru: Вы не играете по правилам с другими.

source: You prefer to have a one-on-one relationship.
es: Prefieres tener una relación de uno a uno.
ru: Вы предпочитаете иметь индивидуальные отношения.

source: The reasons for co-mentorship do not apply to you.
es: Las razones para la co-tutoría no te interesan.
ru: Причины для совместного наставничества к вам не относятся.

source: Expectations
es: Expectativas
ru: Ожидания

source: We expect mentors to review and test-build all proposed patches, at least for an initial period lasting more than a week or two.
es: Esperamos que los mentores revisen y prueben todos los parches propuestos, al menos durante un período inicial con una duración mayor a una o dos semanas.
ru: Мы ожидаем, что наставники будут проверять и тестировать все предлагаемые исправления, по крайней мере, в течение начального периода, длящегося более одной или двух недель.

source: We expect that mentors should take responsibility for the actions of their mentee. A mentor should follow up with all commits the mentee makes, both approved and implicit.
es: Esperamos que los mentores se responsabilicen de las acciones de su aprendiz. Un mentor debe hacer un seguimiento de todos los commits que el aprendiz hace, tanto los aprobados como los implícitos.
ru: Мы ожидаем, что наставники должны нести ответственность за действия своих подопечных. Наставник должен отслеживать все коммиты, сделанные подопечным, как одобренные, так и неявные.

source: We expect mentors to make sure their mentees read the extref:{porters-handbook}[Porter's Handbook], the extref:{pr-guidelines}[PR handling guide], and the extref:{committers-guide}[Committer's Guide]. While it is not necessary to memorize all the details, every committer needs to have an overview of these things to be an effective part of the community (and avoid as many rookie mistakes as possible).
es: Esperamos que los mentores se aseguren de que sus aprendices lean el extref:{porters-handbook}[Porter's Handbook], el extref:{pr-guidelines}[PR handling guide], y el extref:{committers-guide}[Committer's Guide]. Aunque no es necesario memorizar todos los detalles, todo committer necesita tener una visión general de estas cosas para ser una parte efectiva de la comunidad (y evitar tantos errores de principiante como sea posible).
ru: Мы ожидаем, что наставники убедятся, что их подопечные прочитали extref:{porters-handbook}[Руководство портировщика], extref:{pr-guidelines}[руководство по обработке PR] и extref:{committers-guide}[Руководство коммиттера]. Хотя и не обязательно запоминать все детали, каждый коммиттер должен иметь общее представление об этих вещах, чтобы быть эффективной частью сообщества (и избежать как можно больше ошибок новичка).

source: Selecting a Mentee
es: Selección de un Aprendiz
ru: Выбор подопечного

source: There is no defined rule for what makes a candidate ready; it can be a combination of number of PRs they have submitted, the number of ports maintained, frequency of ports updates and/or level of participation in a particular area of interest like GNOME, KDE, Gecko or others.
es: No hay definida una regla que haga que un candidato esté listo; puede ser una combinación del número de PRs que han enviado, el número de ports que mantiene, la frecuencia de las actualizaciones de los mismos y/o el nivel de participación en un área de interés particular como GNOME, KDE, Gecko u otras.
ru: Не существует определённого правила, по которому кандидат считается готовым; это может быть комбинация количества поданных PR, количества поддерживаемых портов, частоты обновлений портов и/или уровня участия в определённой области интересов, такой как GNOME, KDE, Gecko или других.

source: A candidate should have almost no timeouts, be responsive to requests, and generally helpful in supporting their ports.
es: Un candidato no debería de tener timeouts, responder a las solicitudes y, en general, ser útil en el soporte de sus ports.
ru: Кандидат должен практически не допускать тайм-aутов, оперативно реагировать на запросы и в целом оказывать помощь в поддержке своих портов.

source: There must be a history of commitment, as it is widely understood that training a committer requires time and effort. If somebody has been around longer, and spent the time observing how things are done, there is some anticipation of accumulated knowledge. All too often we have seen a maintainer submit a few PRs, show up in IRC and ask when they will be given a commit bit.
es: Debe haber un historial de compromiso, ya que es ampliamente entendido que la capacitación de un committer requiere tiempo y esfuerzo. Si alguien ha estado más tiempo, y ha observado cómo se hacen las cosas, hay un cierto conocimiento acumulado previamente. Con demasiada frecuencia, hemos visto a un maintaner enviar algunos PRs, aparecer en el IRC y preguntar cuándo recibirán derechos de commit.
ru: Должна быть история вовлечённости, так как общеизвестно, что обучение коммиттера требует времени и усилий. Длительное участие в проекте и наблюдение за процессами предполагают накопление знаний. Слишком часто мы видели, как сопровождающий отправляет несколько PR, появляется в IRC и спрашивает, когда ему дадут право на коммит.

source: Being subscribed to, and following the mailing lists is very beneficial. There is no real expectation that submitting posts on the lists will make somebody a committer, but it demonstrates a commitment. Some mails offer insights into the knowledge of a candidate as well how they interact with others. Similarly participating in IRC can give somebody a higher profile.
es: Estar suscrito y seguir las listas de correo es muy beneficioso. No hay una expectativa real de que el envío de publicaciones a las listas convierta a alguien en un committer, pero demuestra compromiso. Algunos correos electrónicos ofrecen información sobre el conocimiento de un candidato y también sobre cómo interactúa con otras personas. Del mismo modo, participar en el IRC puede darle a alguien un perfil superior.
ru: Подписка и активное участие в почтовых рассылках очень полезны. Нет прямой связи и ожидания быстрого результата, что отправка сообщений в списки рассылок сделает кого-то коммиттером, но это демонстрирует вовлечённость. Некоторые письма позволяют оценить знания кандидата, а также его взаимодействие с другими. Аналогично, участие в IRC может повысить заметность человека.

source: Ask six different committers how many PRs a maintainer should submit prior to being nominated, and you will get six different answers. Ask those same individuals how long somebody should have been participating, same dilemma. How many ports should they have at a minimum? Now we have a bikeshed! Some things are just hard to quantify, a mentor will just have to use their best judgement, and hope that portmgr agrees.
es: Pregunta a seis committers diferentes cuántos PRs debe enviar un maintainer antes de ser nominado, y obtendrás seis respuestas diferentes. Pregunta a las mismas personas cuánto tiempo debería estar participando, el mismo dilema. ¿Cuántos ports deberían tener como mínimo? ¡Ahora tenemos un bikeshed! Algunas cosas son difíciles de cuantificar, el mentor tendrá que usar su mejor juicio y esperar que portmgr esté de acuerdo.
ru: Спросите у шести разных коммиттеров, сколько PR должен отправить сопровождающий перед тем, как его номинируют, и вы получите шесть разных ответов. Спросите у тех же людей, как долго кто-то должен участвовать, и та же дилемма. Сколько портов у него должно быть как минимум? Теперь у нас есть повод для бесконечных споров! Некоторые вещи просто трудно измерить, наставнику придется полагаться на свое лучшее суждение и надеяться, что portmgr согласится.

source: Mentorship Duration
es: Duración de la tutoría
ru: Продолжительность наставничества

source: As the trust level develops and grows, the mentee may be granted "implicit" commit rights. This can include trivial changes to a [.filename]#Makefile#, [.filename]#pkg-descr# etc. Similarly, it may include `PORTVERSION` updates that do not include `plist` changes. Other circumstances may be formulated at the discretion of the Mentor. However, during the period of mentorship, a port version bump that affects dependent ports should be checked by a mentor.
es: A medida que el nivel de confianza crece y evoluciona, el aprendiz puede recibir derechos de commit "implícitos". Esto puede incluir cambios triviales en un [.filename]#Makefile#, [.filename]#pkg-descr#, etc. De manera similar, puede incluir actualizaciones de `PORTVERSION` que no incluyan cambios de `plist`. Otras circunstancias pueden ser formuladas a criterio del mentor. Sin embargo, durante el período de orientación, un mentor debe verificar un aumento en la versión de un port que afecte a los ports que dependan de él.
ru: По мере развития и укрепления уровня доверия, подопечному могут быть предоставлены «неявные» права на внесение изменений. Это может включать тривиальные изменения в [.filename]#Makefile#, [.filename]#pkg-descr# и т. д. Аналогично, это может включать обновления `PORTVERSION`, которые не требуют изменений в `plist`. Другие обстоятельства могут быть определены на усмотрение Наставника. Однако в период наставничества изменения версии порта, затрагивающие зависимые порты, должны проверяться наставником.

source: Just as we are all varied individuals, each mentee has different learning curves, time commitments, and other influencing factors that will contribute to the time required before they can "fly solo". Empirically, a mentee should be observed for at least 3 months. 90-100 commits is another target that a mentor could use before releasing a mentee. Other factors to consider prior releasing a mentee are the number of mistakes they may have made, QATs received etc. If they are still making rookie mistakes, they still require mentor guidance.
es: Cada persona es diferente, cada aprendiz tiene una curva de aprendizaje diferente, el tiempo de dedicación y otros factores influyen en el tiempo requerido antes de que puedan "volar en solitario". Empíricamente, un aprendiz debe ser observado durante al menos 3 meses. 90-100 commits es otro objetivo que un mentor podría usar antes de finalizar con un aprendiz. Otros factores a considerar antes de finalizar con un aprendiz son el número de errores que pueden haber cometido, QATs recibidos, etc. Si todavía están cometiendo errores de novato, todavía requieren la guía de un mentor.
ru: Как и все мы разные личности, у каждого подопечного свои кривые обучения, временные обязательства и другие влияющие факторы, которые будут влиять на время, необходимое перед тем, как они смогут «летать самостоятельно». Эмпирически, за подопечным следует наблюдать как минимум 3 месяца. 90-100 коммитов — это ещё один ориентир, который может использовать наставник перед тем, как отпустить подопечного. Другие факторы, которые следует учитывать перед освобождением подопечного, — это количество ошибок, которые они могли совершить, полученные QAT и т.д. Если они всё ещё делают ошибки новичка, им всё ещё требуется руководство наставника.

source: Mentor/Co-Mentor Debate
es: Debate mentor/co-mentor
ru: Дискуссия о роли наставника/сонаставника

source: When a request gets to portmgr, it usually reads as, "I propose 'foo' for a ports commit bit, I will co-mentor with 'bar'". Proposal received, voted, and carried.
es: Cuando una solicitud llega a portmgr, generalmente viene como, "yo propongo a 'foo' para que obtenga derechos de commit en los ports, yo seré el co-mentor con 'bar'". Propuesta recibida, votada y ejecutada.
ru: Когда запрос поступает в portmgr, он обычно звучит так: «Я предлагаю «foo» для права коммита в порты, я буду со-наставником вместе с «bar»». Предложение получено, проголосовано и принято.

source: The mentor is the primary point of contact or the "first among equals", the co-mentor is the backup.
es: El mentor es el principal punto de contacto o el "primero entre iguales", el co-mentor es el backup.
ru: Наставник является основным контактным лицом или "первым среди равных", а сонаставник — его заместитель.

source: Some reprobate, whose name shall be withheld, made the https://lists.freebsd.org/pipermail/cvs-ports/2007-September/134614.html[first recorded co-mentor commit]. Similar co-mentor commits have also been spotted in the src tree. Does this make it right? Does this make it wrong? It seems to be part of the evolution of how things are done.
es: Algunas personas, cuyo nombre será omitido, hicieron el https://lists.freebsd.org/pipermail/cvs-ports/2007-September/134614.html[primer commit aprobado por un co-mentor registrado]. Commits similares, aprobados por un co-mentor fueron vistos en el árbol src. ¿Es correcto? ¿Es incorrecto? Parece parte de la evolución de cómo se hacen las cosas.
ru: Один "ответственный" участник, чьё имя мы опустим, сделал https://lists.freebsd.org/pipermail/cvs-ports/2007-September/134614.html[первый зарегистрированный коммит с сонаставником]. Подобные коммиты с со-менторами также были замечены в дереве src. Делает ли это их правильными? Делает ли это их неправильными? Похоже, это часть эволюции того, как всё устроено.

source: We expect mentees to be prepared for constructive criticism from the community. There's still a lot of "lore" that is not written down. Responding well to constructive criticism is what we hope we are selecting for by first reviewing their existing contributions on IRC and mailing lists.
es: Esperamos que los aprendices estén preparados para las críticas constructivas de la comunidad. Todavía hay mucha "sabiduría popular" que no está por escrito. Responder bien a una crítica constructiva es lo que esperamos al analizar tus contribuciones existentes en el IRC y en las listas de correo.
ru: Мы ожидаем, что подопечные будут готовы к конструктивной критике от сообщества. Здесь еще много "преданий" и традиций, неписанных правил. Умение правильно реагировать на конструктивную критику — это то, на что мы обращаем внимание в первую очередь, оценивая вклад подопечных в IRC и в почтовых рассылках.

source: We warn mentees that some of the criticism they receive may be less "constructive" than others, (whether through language communication problems, or excessive nit-picking), and that dealing with this gracefully is just part of being in a large community. In case of specific problems with specific people, or any questions, we hope that they will approach a portmgr member on IRC or by email.
es: Advertimos a los aprendices de que algunas de las críticas que reciben pueden ser menos "constructivas" que otras, (ya sea por problemas de comunicación lingüística o por ser muy quisquillosos) y que lidiar bien con ello es solo parte de estar en una gran comunidad. En caso de problemas específicos con personas específicas, o cualquier duda, esperamos que os acerquéis a un miembro de portmgr en el IRC o por correo electrónico.
ru: Мы предупреждаем подопечных, что часть критики может быть менее "конструктивной", чем остальная (будь то из-за проблем с языком общения или излишней придирчивости), и что умение достойно принимать такую критику — это часть участия в большом сообществе. В случае конкретных проблем с определёнными людьми или любых вопросов мы надеемся, что они обратятся к членам portmgr в IRC или по электронной почте.
