Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/dev-model/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018 Silvio Ap Silva, contato@kanazuchi.com, 2018

source: A project model for the FreeBSD Project
pt_br: Um modelo de projeto para o projeto FreeBSD

source: <revnumber>1.3</revnumber> <date>October, 2012</date> <revremark>Remove hats held by specific people, these are documented elsewhere.</revremark>
pt_br: <revnumber>1.3</revnumber> <date>October, 2012</date> <revremark>Removido funções de pessoas especificas, isso é documentado em outro lugar.</revremark>

source: $FreeBSD: head/en_US.ISO8859-1/books/dev-model/book.xml 51969 2018-07-05 20:36:13Z jrm $
pt_br: $FreeBSD$

source: Foreword
pt_br: Prefácio

source: This goes hand-in-hand with Brooks' law that <quote>adding another person to a late project will make it later</quote> since it will increase the communication needs <xref linkend="brooks"/>. A project model is a tool to reduce the communication needs.
pt_br: Isso vai de mãos dadas com a lei de Brooks onde <quote>adicionar outra pessoa a um projeto atrasado irá atrasa-lo ainda mais</quote> pois irá aumentar as necessidades de comunicação <xref linkend="brooks"/>. Um modelo de projeto é uma ferramenta para reduzir as necessidades de comunicação.

source: Up until now, the FreeBSD project has released a number of described techniques to do different parts of work. However, a project model summarising how the project is structured is needed because of the increasing amount of project members. <_:footnote-1/> This paper will provide such a project model and is donated to the FreeBSD Documentation project where it can evolve together with the project so that it can at any point in time reflect the way the project works. It is based on <citation><xref linkend="thesis"/></citation>.
pt_br: Até agora, o projeto FreeBSD lançou várias técnicas descritas para fazer diferentes partes do trabalho. No entanto, um modelo de projeto resumindo como o projeto é estruturado é necessário devido à quantidade crescente de membros do projeto. <_:footnote-1/> Este artigo fornecerá esse modelo de projeto e será doado ao projeto de Documentação do FreeBSD, onde ele poderá evoluir junto com o projeto, de modo que ele possa, a qualquer momento, refletir a maneira como o projeto funciona. É baseado em <citation><xref linkend="thesis"/></citation>.

source: I would like to thank the following people for taking the time to explain things that were unclear to me and for proofreading the document.
pt_br: Gostaria de agradecer às pessoas a seguir por dedicarem tempo para explicar coisas que não estavam claras para mim e por revisar o documento.

source: Overview
pt_br: Visão geral

source: A project model is a means to reduce the communications overhead in a project. As shown by <citation><xref linkend="brooks"/></citation>, increasing the number of project participants increases the communication in the project exponentionally. FreeBSD has during the past few years increased both its mass of active users and committers, and the communication in the project has risen accordingly. This project model will serve to reduce this overhead by providing an up-to-date description of the project.
pt_br: Um modelo de projeto é um meio de reduzir a sobrecarga de comunicações em um projeto. Conforme mostrado por <citation><xref linkend="brooks"/></citation>, aumentar o número de participantes do projeto aumenta exponencialmente a comunicação no projeto. O FreeBSD tem aumentado nos últimos anos tanto sua massa de usuários ativos quanto de committers, e a comunicação no projeto aumentou de acordo com esse crescimento. Esse modelo de projeto servirá para reduzir essa sobrecarga, fornecendo uma descrição atualizada do projeto.

source: During the Core elections in 2002, Mark Murray stated <quote>I am opposed to a long rule-book, as that satisfies lawyer-tendencies, and is counter to the technocentricity that the project so badly needs.</quote> <citation><xref linkend="bsd-election2002"/></citation>. This project model is not meant to be a tool to justify creating impositions for developers, but as a tool to facilitate coordination. It is meant as a description of the project, with an overview of how the different processes are executed. It is an introduction to how the FreeBSD project works.
pt_br: Durante as eleições do Core em 2002, Mark Murray declarou: <quote>Me oponho a um longo livro de regras, pois isso satisfaz tendências de advogados e é contrário ao tecnocentrismo de que o projeto tanto necessita.</quote> <citation><xref linkend="bsd-election2002"/></citation>. Este modelo de projeto não pretende ser uma ferramenta para justificar a criação de imposições para desenvolvedores, mas como uma ferramenta para facilitar a coordenação. Isso tem significado como uma descrição do projeto, com uma visão geral de como os diferentes processos são executados. É uma introdução ao funcionamento do projeto FreeBSD.

source: The FreeBSD project model will be described as of July 1st, 2004. It is based on the Niels Jørgensen's paper <citation><xref linkend="jorgensen2001"/></citation>, FreeBSD's official documents, discussions on FreeBSD mailing lists and interviews with developers.
pt_br: O modelo do projeto FreeBSD será descrito a partir de 1º de julho de 2004. É baseado no paper de Niels Jørgensen <citation><xref linkend="jorgensen2001"/></citation>, documentos oficiais do FreeBSD, discussões em listas de discussão do FreeBSD e entrevistas com os desenvolvedores.

source: After providing definitions of terms used, this document will outline the organisational structure (including role descriptions and communication lines), discuss the methodology model and after presenting the tools used for process control, it will present the defined processes. Finally it will outline major sub-projects of the FreeBSD project.
pt_br: Depois de fornecer as definições dos termos usados, este documento delineará a estrutura organizacional (incluindo descrições de funções e linhas de comunicação), discutirá o modelo de metodologia e, depois de apresentar as ferramentas usadas para controle de processos, apresentará os processos definidos. Finalmente, ele delineará os principais subprojetos do projeto FreeBSD.

source: <citation><xref linkend="freebsd-developer-handbook"/>, Section 1.2 and 1.3</citation> give the vision and the architectural guidelines for the project. The vision is <quote>To produce the best UNIX-like operating system package possible, with due respect to the original software tools ideology as well as usability, performance and stability.</quote> The architectural guidelines help determine whether a problem that someone wants to be solved is within the scope of the project
pt_br: <citation><xref linkend="freebsd-developer-handbook"/>, Seção 1.2 e 1.3</citation> fornece a visão e as diretrizes arquitetônicas do projeto. A visão é <quote>Produzir o melhor pacote de sistema operacional semelhante ao UNIX, respeitando a ideologia das ferramentas de software originais, bem como usabilidade, desempenho e estabilidade.</quote> As diretrizes de arquitetura ajudam a determinar se um problema que alguém quer que seja resolvido está dentro do escopo do projeto

source: Definitions
pt_br: Definições

source: Activity
pt_br: Atividade

source: An <quote>activity</quote> is an element of work performed during the course of a project <citation><xref linkend="ref-pmbok"/></citation>. It has an output and leads towards an outcome. Such an output can either be an input to another activity or a part of the process' delivery.
pt_br: Uma <quote>atividade</quote> é um elemento do trabalho realizado durante o curso de um projeto <citation><xref linkend="ref-pmbok"/></citation>. Ele tem uma saída e leva a um resultado. Tal saída pode ser uma entrada para outra atividade ou parte da entrega do processo.

source: Process
pt_br: Processo

source: A <quote>process</quote> is a series of activities that lead towards a particular outcome. A process can consist of one or more sub-processes. An example of a process is software design.
pt_br: Um <quote>processo</quote> é uma série de atividades que levam a um resultado específico. Um processo pode consistir em um ou mais subprocessos. Um exemplo de um processo é o design de software.

source: Hat
pt_br: Hat (Definição/função especifica para algumas pessoas)

source: A <quote>hat</quote> is synonymous with role. A hat has certain responsibilities in a process and for the process outcome. The hat executes activities. It is well defined what issues the hat should be contacted about by the project members and people outside the project.
pt_br: Uma <quote>hat</quote> é um sinônimo de função. Uma hat tem certas responsabilidades em um processo e para o resultado do processo. O hat executa atividades. Está bem definido por quais problemas o hat deve ser contatado pelos membros do projeto e pessoas fora do projeto.

source: Outcome
pt_br: Resultado

source: An <quote>outcome</quote> is the final output of the process. This is synonymous with deliverable, that is defined as <quote>any measurable, tangible, verifiable outcome, result or item that must be produced to complete a project or part of a project. Often used more narrowly in reference to an external deliverable, which is a deliverable that is subject to approval by the project sponsor or customer</quote> by <citation><xref linkend="ref-pmbok"/></citation>. Examples of outcomes are a piece of software, a decision made or a report written.
pt_br: Um <quote>resultado</quote> é a finalização do processo. Isso é sinônimo de entrega, que é definido como <quote>qualquer finalização mensurável, tangível, verificável ou item que deve ser produzido para concluir um projeto ou parte de um projeto. Frequentemente usado de forma mais restrita em referência a uma entrega externa, que é uma entrega sujeita à aprovação do patrocinador ou cliente do projeto</quote>, por <citation><xref linkend="ref-pmbok"/></citation>. Exemplos de resultados são um software, uma decisão tomada ou um relatório escrito.

source: When saying <quote>FreeBSD</quote> we will mean the BSD derivative UNIX-like operating system FreeBSD, whereas when saying <quote>the FreeBSD Project</quote> we will mean the project organisation.
pt_br: Ao dizer <quote>FreeBSD</quote> queremos dizer o sistema operacional FreeBSD derivativo do BSD semelhante ao UNIX, enquanto ao dizer <quote>o projeto FreeBSD</quote> queremos dizer a organização do projeto.

source: Organisational structure
pt_br: Estrutura organizacional

source: While no-one takes ownership of FreeBSD, the FreeBSD organisation is divided into core, committers and contributors and is part of the FreeBSD community that lives around it.
pt_br: Enquanto ninguém assume a propriedade do FreeBSD, a organização do FreeBSD é dividida em core, committers e colaboradores e isso faz parte da comunidade do FreeBSD que vive em torno dele.

source: The FreeBSD Project's structure
pt_br: A estrutura do projeto FreeBSD

source: Number of committers has been determined by going through CVS logs from January 1st, 2004 to December 31st, 2004 and contributors by going through the list of contributions and problem reports.
pt_br: O número de committers foi determinado passando pelos logs do CVS de 1º de janeiro de 2004 a 31 de dezembro de 2004 e pelos colaboradores, passando pela lista de contribuições e relatórios de problemas.

source: The main resource in the FreeBSD community is its developers: the committers and contributors. It is with their contributions that the project can move forward. Regular developers are referred to as contributors. As by January 1st, 2003, there are an estimated 5500 contributors on the project.
pt_br: O principal recurso na comunidade do FreeBSD são seus desenvolvedores: os committers e colaboradores. É com suas contribuições que o projeto pode avançar. Desenvolvedores regulares são referidos como colaboradores. Até 1º de janeiro de 2003, havia uma estimativa de 5500 colaboradores no projeto.

source: Committers are developers with the privilege of being able to commit changes. These are usually the most active developers who are willing to spend their time not only integrating their own code but integrating code submitted by the developers who do not have this privilege. They are also the developers who elect the core team, and they have access to closed discussions.
pt_br: Os committers são desenvolvedores com o privilégio de poder aplicar mudanças (fazer commit). Geralmente, são os desenvolvedores mais ativos que estão dispostos a gastar seu tempo não apenas integrando seu próprio código, mas integrando o código enviado pelos desenvolvedores que não têm esse privilégio. Eles também são os desenvolvedores que elegem a equipe principal (core) e têm acesso a discussões fechadas.

source: The project can be grouped into four distinct separate parts, and most developers will focus their involvement in one part of FreeBSD. The four parts are kernel development, userland development, ports and documentation. When referring to the base system, both kernel and userland is meant.
pt_br: O projeto pode ser agrupado em quatro partes separadas distintas, e a maioria dos desenvolvedores focará seu envolvimento em uma parte do FreeBSD. As quatro partes são desenvolvimento de kernel, desenvolvimento de userland, ports e documentação. Ao se referir ao sistema base, nos referimos tanto o kernel quanto o userland.

source: This split changes our triangle to look like this:
pt_br: Esta divisão muda nosso triângulo para ficar assim:

source: The FreeBSD Project's structure with committers in categories
pt_br: A estrutura do Projeto FreeBSD com committers em categorias

source: Number of committers per area has been determined by going through CVS logs from January 1st, 2004 to December 31st, 2004. Note that many committers work in multiple areas, making the total number higher than the real number of committers. The total number of committers at that time was 269.
pt_br: O número de committers por área foi determinado passando por logs do CVS de 1 de janeiro de 2004 a 31 de dezembro de 2004. Observe que muitos committers trabalham em várias áreas, fazendo com que o número total seja maior que o número real de committers. O número total de committers naquele momento era 269.

source: Committers fall into three groups: committers who are only concerned with one area of the project (for instance file systems), committers who are involved only with one sub-project and committers who commit to different parts of the code, including sub-projects. Because some committers work on different parts, the total number in the committers section of the triangle is higher than in the above triangle.
pt_br: Os committers se enquadram em três grupos: committers que estão preocupados apenas com uma área do projeto (por exemplo, sistemas de arquivos), committers que estão envolvidos apenas com um subprojeto e committers que se comprometem com partes diferentes do código, incluindo subprojetos. Como alguns committers trabalham em partes diferentes, o número total na seção commiters do triângulo é maior que no triângulo acima.

source: The kernel is the main building block of FreeBSD. While the userland applications are protected against faults in other userland applications, the entire system is vulnerable to errors in the kernel. This, combined with the vast amount of dependencies in the kernel and that it is not easy to see all the consequences of a kernel change, demands developers with a relative full understanding of the kernel. Multiple development efforts in the kernel also requires a closer coordination than userland applications do.
pt_br: O kernel é o principal bloco de construção do FreeBSD. Enquanto os aplicativos em userland são protegidos contra falhas em outros aplicativos do userland, todo o sistema é vulnerável a erros no kernel. Isso, combinado com a grande quantidade de dependências no kernel e que não é fácil ver todas as consequências de uma mudança no kernel, exige que os desenvolvedores tenham uma compreensão relativamente completa do kernel. Múltiplos esforços de desenvolvimento no kernel também requerem uma coordenação mais próxima do que os aplicativos em userland requerem.

source: The core utilities, known as userland, provide the interface that identifies FreeBSD, both user interface, shared libraries and external interfaces to connecting clients. Currently, 162 people are involved in userland development and maintenance, many being maintainers for their own part of the code. Maintainership will be discussed in the <xref linkend="role-maintainer"/> section.
pt_br: Os principais utilitários, conhecidos como userland, fornecem a interface que identifica o FreeBSD, interface do usuário, bibliotecas compartilhadas e interfaces externas para conectar clientes. Atualmente, 162 pessoas estão envolvidas no desenvolvimento e manutenção da userland, muitas delas sendo mantenedoras de sua própria parte do código. A manutenção será discutida na seção <xref linkend="role-maintainer"/>.

source: Documentation is handled by <xref linkend="sub-project-documentation"/> and includes all documents surrounding the FreeBSD project, including the web pages. There were during 2004 101 people making commits to the FreeBSD Documentation Project.
pt_br: A documentação é tratada por <xref linkend="sub-project-documentation"/> e inclui todos os documentos em torno do projeto FreeBSD, incluindo as páginas web. Durante o ano de 2004, 101 pessoas fizeram commits para o Projeto de Documentação do FreeBSD.

source: Statistics are generated by counting the number of entries in the file fetched by portsdb by April 1st, 2005. portsdb is a part of the port sysutils/portupgrade.
pt_br: As estatísticas são geradas contando o número de entradas no arquivo buscado pelo portsdb até 1 de abril de 2005. portsdb é uma parte do port sysutils/portupgrade.

source: Ports is the collection of meta-data that is needed to make software packages build correctly on FreeBSD. An example of a port is the port for the web-browser Mozilla. It contains information about where to fetch the source, what patches to apply and how, and how the package should be installed on the system. This allows automated tools to fetch, build and install the package. As of this writing, there are more than 12600 ports available. <_:footnote-1/> , ranging from web servers to games, programming languages and most of the application types that are in use on modern computers. Ports will be discussed further in the section <xref linkend="sub-project-ports"/>.
pt_br: Ports é a coleção de meta-dados necessários para fazer com que os pacotes de software sejam compilados corretamente no FreeBSD. Um exemplo de port é o port do navegador Mozilla. Ele contém informações sobre onde buscar o código fonte, quais correções aplicar e como o pacote deve ser instalado no sistema. Isso permite que ferramentas automatizadas busquem, criem e instalem o pacote. Até esta data, existem mais de 12600 ports disponíveis. <_:footnote-1/>, variando de servidores web a jogos, linguagens de programação e a maioria dos tipos de aplicativos que estão em uso em computadores modernos. Os ports serão discutidos em mais detalhes na seção <xref linkend="sub-project-ports"/>.

source: Methodology model
pt_br: Modelo de metodologia

source: Development model
pt_br: Modelo de desenvolvimento

source: There is no defined model for how people write code in FreeBSD. However, Niels Jørgenssen has suggested a model of how written code is integrated into the project.
pt_br: Não existe um modelo definido para como as pessoas escrevem código no FreeBSD. No entanto, Niels Jørgenssen sugeriu um modelo de como o código escrito é integrado ao projeto.

source: Jørgenssen's model for change integration
pt_br: O modelo de Jørgenssen para integração de mudanças

source: The <quote>development release</quote> is the FreeBSD-CURRENT ("-CURRENT") branch and the <quote>production release</quote> is the FreeBSD-STABLE branch ("-STABLE") <citation><xref linkend="jorgensen2001"/></citation>.
pt_br: A <quote>versão de desenvolvimento</quote> é a branch (ramificação) FreeBSD-CURRENT ("-CURRENT") e a <quote>versão de produção </quote> é a branch (ramificação) FreeBSD-STABLE ("-STABLE") <citation><xref linkend="jorgensen2001"/></citation>.

source: This is a model for one change, and shows that after coding, developers seek community review and try integrating it with their own systems. After integrating the change into the development release, called FreeBSD-CURRENT, it is tested by many users and developers in the FreeBSD community. After it has gone through enough testing, it is merged into the production release, called FreeBSD-STABLE. Unless each stage is finished successfully, the developer needs to go back and make modifications in the code and restart the process. To integrate a change with either -CURRENT or -STABLE is called making a commit.
pt_br: Este é um modelo para uma mudança e mostra que, após a codificação, os desenvolvedores buscam a revisão da comunidade e tentam integrá-la com seus próprios sistemas. Depois de integrar a mudança na versão de desenvolvimento, chamada FreeBSD-CURRENT, ela é testada por muitos usuários e desenvolvedores na comunidade FreeBSD. Depois de passar por testes suficientes, é feito o merge (aplicado) na versão de produção, chamada FreeBSD-STABLE. A menos que cada estágio seja concluído com êxito, o desenvolvedor precisa voltar e fazer modificações no código e reiniciar o processo. Integrar uma mudança com -CURRENT ou -STABLE é chamado de fazer um commit.

source: Jørgensen found that most FreeBSD developers work individually, meaning that this model is used in parallel by many developers on the different ongoing development efforts. A developer can also be working on multiple changes, so that while he is waiting for review or people to test one or more of his changes, he may be writing another change.
pt_br: Jørgensen descobriu que a maioria dos desenvolvedores do FreeBSD trabalha individualmente, o que significa que este modelo é usado em paralelo por muitos desenvolvedores nos diferentes esforços de desenvolvimento em andamento. Um desenvolvedor também pode estar trabalhando em várias alterações, de modo que, enquanto ele aguarda revisão ou que pessoas testem uma ou mais de suas alterações, ele pode estar escrevendo outra alteração.

source: The period from January 1st, 2004 to December 31st, 2004 was examined to find this number.
pt_br: O período de 1º de janeiro de 2004 a 31 de dezembro de 2004 foi examinado para encontrar esse número.

source: As each commit represents an increment, this is a massively incremental model. The commits are in fact so frequent that during one year <_:footnote-1/> , 85427 commits were made, making a daily average of 233 commits.
pt_br: Como cada commit representa um incremento, este é um modelo massivamente incremental. Os commits são tão freqüentes que durante um ano <_:footnote-1/>, 85427 commits foram feitos, fazendo uma média diária de 233 commits.
