Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/dev-model/*.po
Languages: pt_br

source: All boxes consist of groups of committers, except for the dotted boxes where the holders are not necessarily committers. The flattened circles are sub-projects and consist of both committers and non-committers of the main project.
pt_br: Todas as caixas consistem em grupos de committers, exceto as caixas pontilhadas onde os detentores não são necessariamente committers. Os círculos planificados são subprojetos e consistem em committers e pessoas que não são committers do projeto principal.

source: Documentation project manager
pt_br: Gerente de Projetos de Documentação

source: <xref linkend="sub-project-documentation"/> architect is responsible for defining and following up documentation goals for the committers in the Documentation project.
pt_br: <xref linkend="sub-project-documentation"/> é o arquiteto responsável por definir e acompanhar as metas de documentação para os committers no projeto Documentação.

source: Hat held by: The DocEng team <email>doceng@FreeBSD.org</email>. The <link xlink:href="https://www.freebsd.org/internal/doceng.html"> DocEng Charter</link>.
pt_br: Hat mantido pela: Equipe do DocEng <email>doceng@FreeBSD.org</email>. O <link xlink:href="https://www.freebsd.org/internal/doceng.html">Capitulo DocEng</link>.

source: The Postmaster is responsible for mail being correctly delivered to the committers' email address. He is also responsible for ensuring that the mailing lists work and should take measures against possible disruptions of mail such as having troll-, spam- and virus-filters.
pt_br: O Postmaster é responsável pelo envio correto do email para o endereço de email dos committers. Ele também é responsável por garantir que as listas de discussão funcionem e deve tomar medidas contra possíveis interrupções de correspondência, como filtros de vírus, spam e trolls.

source: Hat currently held by: the Postmaster Team <email>postmaster@FreeBSD.org</email>.
pt_br: Hat atualmente mantido pelo: Time Postmaster <email>postmaster@FreeBSD.org</email>.

source: Release Coordination
pt_br: Coordenação de Release (Versões/Lançamentos)

source: Setting, publishing and following a release schedule for official releases
pt_br: Definir, publicar e seguir um cronograma de lançamento para releases (versões) oficiais

source: Documenting and formalising release engineering procedures
pt_br: Documentando e formalizando procedimentos de engenharia da release

source: Creation and maintenance of code branches
pt_br: Criação e manutenção de branches de código

source: Coordinating with the Ports and Documentation teams to have an updated set of packages and documentation released with the new releases
pt_br: Coordenando com as equipes de Ports e Documentação para ter um conjunto atualizado de pacotes e documentação lançados com as novas releases

source: Coordinating with the Security team so that pending releases are not affected by recently disclosed vulnerabilities.
pt_br: Coordenar com a equipe de segurança para que as versões pendentes não sejam afetadas por vulnerabilidades divulgadas recentemente.

source: The responsibilities of the Release Engineering Team are <_:itemizedlist-1/> Further information about the development process is available in the <xref linkend="process-release-engineering"/> section.
pt_br: As responsabilidades da Equipe de Engenharia de Release são <_:itemizedlist-1/> Mais informações sobre o processo de desenvolvimento estão disponíveis na seção <xref linkend="process-release-engineering"/>.

source: Hat held by: the Release Engineering team <email>re@FreeBSD.org</email>. The <link xlink:href="https://www.freebsd.org/releng/charter.html"> Release Engineering Charter</link>.
pt_br: Hat mantido pela: Equipe de Engenharia de Release <email>re@FreeBSD.org</email>. O <link xlink:href="https://www.freebsd.org/releng/charter.html">Capitulo de Engenharia de Release</link>.

source: Public Relations &amp; Corporate Liaison
pt_br: Relações Públicas &amp; Contato Corporativo

source: Making press statements when happenings that are important to the FreeBSD Project happen.
pt_br: Fazer declarações de imprensa quando acontecem coisas que são importantes para o projeto FreeBSD.

source: Being the official contact person for corporations that are working close with the FreeBSD Project.
pt_br: Ser a pessoa de contato oficial para corporações que estão trabalhando em estreita colaboração com o Projeto FreeBSD.

source: Take steps to promote FreeBSD within both the Open Source community and the corporate world.
pt_br: Tomar medidas para promover o FreeBSD tanto na comunidade Open Source quanto no mundo corporativo.

source: Handle the <quote>freebsd-advocacy</quote> mailing list.
pt_br: Lidar com a lista de discussão <quote>freebsd-advocacy</quote>.

source: The Public Relations &amp; Corporate Liaison's responsibilities are: <_:itemizedlist-1/>
pt_br: Relações Publicas &amp; As responsabilidades do contato corporativo são: <_:itemizedlist-1/>

source: This hat is currently not occupied.
pt_br: Este hat não está atualmente ocupado.

source: Security Officer
pt_br: Oficial de segurança

source: The Security Officer's main responsibility is to coordinate information exchange with others in the security community and in the FreeBSD project. The Security Officer is also responsible for taking action when security problems are reported and promoting proactive development behavior when it comes to security.
pt_br: A principal responsabilidade do Security Officer (Oficial de Segurança) é coordenar a troca de informações com outras pessoas na comunidade de segurança e no projeto FreeBSD. O agente de segurança também é responsável por tomar medidas quando os problemas de segurança são relatados e promover um comportamento proativo de desenvolvimento quando se trata de segurança.

source: Because of the fear that information about vulnerabilities may leak out to people with malicious intent before a patch is available, only the Security Officer, consisting of an officer, a deputy and two <xref linkend="role-core"/> members, receive sensitive information about security issues. However, to create or implement a patch, the Security Officer has the Security Officer Team <email>security-team@FreeBSD.org</email> to help do the work.
pt_br: Devido ao receio de que informações sobre vulnerabilidades possam vazar para pessoas com intenções maliciosas antes que um patch esteja disponível, apenas o Oficial de Segurança, composto por um oficial, um adjunto e dois membros do <xref linkend="role-core"/>, recebe informações confidenciais sobre problemas de segurança. No entanto, para criar ou implementar um patch, o Oficial de Segurança tem a equipe de segurança oficial <email>security-team@FreeBSD.org</email> para ajudar no trabalho.

source: Source Repository Manager
pt_br: Gerenciador do Repositório de Código Fonte

source: The Source Repository Manager is the only one who is allowed to directly modify the repository without using the <xref linkend="tool-svn"/> tool. It is his/her responsibility to ensure that technical problems that arise in the repository are resolved quickly. The source repository manager has the authority to back out commits if this is necessary to resolve a SVN technical problem.
pt_br: O Source Repository Manager (Gerenciador do Repositório de Código Fonte) é o único que tem permissão para modificar diretamente o repositório sem usar a ferramenta <xref linkend="tool-svn"/>. É sua responsabilidade garantir que os problemas técnicos que surgem no repositório sejam resolvidos rapidamente. O gerenciador do repositório de código fonte possui a autoridade para voltar commits, se isso for necessário para resolver um problema técnico do SVN.

source: Hat held by: the Source Repository Manager <email>clusteradm@FreeBSD.org</email>.
pt_br: Hat mantido pelo: Source Repository Manager <email>clusteradm@FreeBSD.org</email>.

source: Election Manager
pt_br: Gerente de Eleições

source: The Election Manager is responsible for the <xref linkend="process-core-election"/> process. The manager is responsible for running and maintaining the election system, and is the final authority should minor unforeseen events happen in the election process. Major unforeseen events have to be discussed with the <xref linkend="role-core"/>
pt_br: O Gerente de Eleições é responsável pelo processo <xref linkend="process-core-election"/>. O gerente é responsável por executar e manter o sistema eleitoral, e é a autoridade final caso eventos imprevistos menores ocorram no processo eleitoral. Grandes imprevistos devem ser discutidos com o <xref linkend="role-core"/>

source: Hat held only during elections.
pt_br: Hat realizado apenas durante as eleições.

source: Web site Management
pt_br: Gerenciamento de sites

source: The Web site Management hat is responsible for coordinating the rollout of updated web pages on mirrors around the world, for the overall structure of the primary web site and the system it is running upon. The management needs to coordinate the content with <xref linkend="sub-project-documentation"/> and acts as maintainer for the <quote>www</quote> tree.
pt_br: O hat Web site Management é responsável por coordenar o lançamento de páginas Web atualizadas em espelhos ao redor do mundo, pela estrutura geral do site principal e pelo sistema em que está sendo executado. O gerenciamento precisa coordenar o conteúdo com <xref linkend="sub-project-documentation"/> e atua como mantenedor da árvore <quote>www</quote>.

source: Hat held by: the FreeBSD Webmasters <email>www@FreeBSD.org</email>.
pt_br: Hat mantido pelos: Webmasters do FreeBSD <email>www@FreeBSD.org</email>.

source: Ports Manager
pt_br: Gerente de Ports

source: The Ports Manager acts as a liaison between <xref linkend="sub-project-ports"/> and the core project, and all requests from the project should go to the ports manager.
pt_br: O Gerente de Ports atua como uma conexão entre <xref linkend="sub-project-ports"/> e o projeto principal, e todas as solicitações do projeto devem ir para o gerente de ports.

source: Hat held by: the Ports Management Team <email>portmgr@FreeBSD.org</email>. The <link xlink:href="https://www.freebsd.org/portmgr/charter.html"> Portmgr charter</link>.
pt_br: Hat mantido pela: Equipe de Gerenciamento de Ports <email>portmgr@FreeBSD.org</email>. O <link xlink:href="https://www.freebsd.org/portmgr/charter.html">Capitulo Portmgr</link>.

source: Standards
pt_br: Padrões

source: The Standards hat is responsible for ensuring that FreeBSD complies with the standards it is committed to , keeping up to date on the development of these standards and notifying FreeBSD developers of important changes that allows them to take a proactive role and decrease the time between a standards update and FreeBSD's compliancy.
pt_br: O Standards (Padrões) é responsável por garantir que o FreeBSD cumpra com os padrões com os quais está comprometido, mantendo-se atualizado sobre o desenvolvimento desses padrões e notificando os desenvolvedores do FreeBSD sobre mudanças importantes que lhes permitam assumir um papel proativo e diminuir o tempo entre atualização de padrões e complacência do FreeBSD.

source: Hat currently held by: Garrett Wollman <email>wollman@FreeBSD.org</email>.
pt_br: Hat atualmente mantido por: Garrett Wollman <email>wollman@FreeBSD.org</email>.

source: Core Secretary
pt_br: Secretário do Core (do time do Core)

source: The Core Secretary's main responsibility is to write drafts to and publish the final Core Reports. The secretary also keeps the core agenda, thus ensuring that no balls are dropped unresolved.
pt_br: A principal responsabilidade do Secretário do Core é redigir os drafts e publicar os Relatórios finais do Core. O secretário também mantém a agenda central, assegurando assim que nenhuma bola seja descartada sem solução.

source: Hat currently held by: Joseph Mingrone <email>jrm@FreeBSD.org</email>.
pt_br: Hat atualmente mantido por: Joseph Mingrone <email>jrm@FreeBSD.org</email>.

source: The Bugmeister is responsible for ensuring that the maintenance database is in working order, that the entries are correctly categorised and that there are no invalid entries.
pt_br: O Bugmeister é responsável por garantir que o banco de dados de manutenção esteja em ordem, que as entradas sejam categorizadas corretamente e que não existam entradas inválidas.

source: Hat currently held by: the Bugmeister Team <email>bugmeister@FreeBSD.org</email>.
pt_br: Hat atualmente mantido pelo: Time Bugmeister <email>bugmeister@FreeBSD.org</email>.

source: Donations Liaison Officer
pt_br: Oficial de Contratos de doações

source: The task of the donations liaison officer is to match the developers with needs with people or organisations willing to make a donation. The Donations Liaison Charter is available <link xlink:href="https://www.freebsd.org/donations/">here</link>
pt_br: A tarefa do oficial de contratos de doações é combinar os desenvolvedores com necessidades com pessoas ou organizações dispostas a fazer uma doação. A carta de ligação de doações está disponível <link xlink:href="https://www.freebsd.org/donations/">aqui</link>

source: Hat held by: the Donations Liaison Office <email>donations@FreeBSD.org</email>.
pt_br: Hat mantida pelo: Escritório de Contratos de Doações <email>donations@FreeBSD.org</email>.

source: (Also called <quote>FreeBSD Cluster Admin</quote>)
pt_br: (Também chamado de <quote>Administrador de Cluster do FreeBSD</quote>)

source: The admin team consists of the people responsible for administrating the computers that the project relies on for its distributed work and communication to be synchronised. It consists mainly of those people who have physical access to the servers.
pt_br: A equipe administrativa consiste nas pessoas responsáveis ​​por administrar os computadores dos quais o projeto depende, para que seu trabalho distribuído e comunicação sejam sincronizados. Consiste principalmente naquelas pessoas que têm acesso físico aos servidores.

source: Hat held by: the Admin team <email>admin@FreeBSD.org</email>.
pt_br: Hat mantido pela: Equipe de Admin <email>admin@FreeBSD.org</email>.

source: Process dependent hats
pt_br: Hats dependentes de processo

source: Report originator
pt_br: Criador do relatório

source: The person originally responsible for filing a Problem Report.
pt_br: A pessoa originalmente responsável pelo preenchimento de um Relatório de Problemas.

source: A person who will either find the right person to solve the problem, or close the PR if it is a duplicate or otherwise not an interesting one.
pt_br: Uma pessoa que irá encontrar a pessoa certa para resolver o problema, ou fechar o PR se for uma duplicata ou não uma interessante.

source: A mentor is a committer who takes it upon him/her to introduce a new committer to the project, both in terms of ensuring the new committers setup is valid, that the new committer knows the available tools required in his/her work and that the new committer knows what is expected of him/her in terms of behavior.
pt_br: Um mentor é um committer que assume a responsabilidade de introduzir um novo committer no projeto, tanto em termos de garantir que a nova configuração de committers seja válida, que o novo committer conheça as ferramentas disponíveis necessárias em seu trabalho quanto que o novo committer saiba o que se espera dele em termos de comportamento.

source: Vendor
pt_br: Fornecedor

source: The person(s) or organisation whom external code comes from and whom patches are sent to.
pt_br: A(s) pessoa(s) ou organização de quem vem o código externo e para quem os patches são enviados.

source: Reviewers
pt_br: Revisores

source: People on the mailing list where the request for review is posted.
pt_br: Pessoas na lista de discussão em que a solicitação de revisão é postada.

source: Processes
pt_br: Processos

source: The following section will describe the defined project processes. Issues that are not handled by these processes happen on an ad-hoc basis based on what has been customary to do in similar cases.
pt_br: A seção a seguir descreverá os processos definidos do projeto. Questões que não são tratadas por esses processos acontecem em uma base ad-hoc com base no que era costume fazer em casos semelhantes.

source: Adding new and removing old committers
pt_br: Adicionando novos committers e removendo committers antigos

source: The Core team has the responsibility of giving and removing commit privileges to contributors. This can only be done through a vote on the core mailing list. The ports and documentation sub-projects can give commit privileges to people working on these projects, but have to date not removed such privileges.
pt_br: O Core team tem a responsabilidade de fornecer e remover os privilégios de commit aos colaboradores. Isso só pode ser feito por meio de votação na lista de discussão do core. Os subprojetos de ports e documentação podem conceder privilégios de commit a pessoas que trabalham nesses projetos, mas até o momento não removeram esses privilégios.

source: Normally a contributor is recommended to core by a committer. For contributors or outsiders to contact core asking to be a committer is not well thought of and is usually rejected.
pt_br: Normalmente, um colaborador é recomendado para o core por um committer. Para colaboradores ou pessoas de fora entrar em contato com o core pedindo para ser um committer não é algo bem pensado e geralmente é rejeitado.

source: If the area of particular interest for the developer potentially overlaps with other committers' area of maintainership, the opinion of those maintainers is sought. However, it is frequently this committer that recommends the developer.
pt_br: Se a área de interesse particular para o desenvolvedor potencialmente se sobrepuser à área de manutenção de outros committers, a opinião desses commiters mantenedores é solicitada. No entanto, é frequentemente esse committer que recomenda o desenvolvedor.

source: When a contributor is given committer status, he is assigned a mentor. The committer who recommended the new committer will, in the general case, take it upon himself to be the new committers mentor.
pt_br: Quando um colaborador recebe status de committer, ele recebe um mentor. O committer que recomendou o novo committer, no caso geral, assumirá a responsabilidade de ser o novo mentor dos committers.

source: When a contributor is given his commit bit, a <xref linkend="tool-pgp"/>-signed email is sent from either <xref linkend="role-core-secretary"/>, <xref linkend="role-ports-manager"/> or nik@freebsd.org to both admins@freebsd.org, the assigned mentor, the new committer and core confirming the approval of a new account. The mentor then gathers a password line, <xref linkend="tool-ssh2"/> public key and PGP key from the new committer and sends them to <xref linkend="role-admin"/>. When the new account is created, the mentor activates the commit bit and guides the new committer through the rest of the initial process.
pt_br: Quando um colaborador recebe seu commit bit, um e-mail assinado <xref linkend="tool-pgp"/> é enviado de <xref linkend="role-core-secretary"/>, <xref linkend="role-ports-manager"/> ou nik@freebsd.org para ambos admins@freebsd.org, o mentor designado, o novo committer e o core confirmando a aprovação de uma nova conta. O mentor então reúne uma senha, a chave pública <xref linkend="tool-ssh2"/> e a chave PGP do novo committer e as envia para <xref linkend="role-admin"/>. Quando a nova conta é criada, o mentor ativa o commit bit e orienta o novo committer pelo resto do processo inicial.

source: Process summary: adding a new committer
pt_br: Resumo do processo: adicionando um novo committer

source: When a contributor sends a piece of code, the receiving committer may choose to recommend that the contributor is given commit privileges. If he recommends this to core, they will vote on this recommendation. If they vote in favour, a mentor is assigned the new committer and the new committer has to email his details to the administrators for an account to be created. After this, the new committer is all set to make his first commit. By tradition, this is by adding his name to the committers list.
pt_br: Quando um colaborador envia uma parte do código, o committer que recebe pode optar por recomendar que o colaborador receba privilégios de commit. Se ele recomendar isso para o core, eles irão votar essa recomendação. Se eles votarem a favor, um mentor é designado ao novo committer e o novo committer tem que enviar seus dados para os administradores para que uma conta seja criada. Depois disso, o novo committer está pronto para fazer seu primeiro commit. Por tradição, isso é feito adicionando seu nome à lista de committers.

source: Recall that a committer is considered to be someone who has committed code during the past 12 months. However, it is not until after 18 months of inactivity have passed that commit privileges are eligible to be revoked. <citation><xref linkend="freebsd-expiration-policy"/></citation> There are, however, no automatic procedures for doing this. For reactions concerning commit privileges not triggered by time, see <link linkend="process-reactions">section 1.5.8</link>.
pt_br: Lembre-se de que um committer é considerado alguém que tenha feito algum commit de código nos últimos 12 meses. No entanto, somente após 18 meses de inatividade terem se passado, os privilégios de commit são qualificados para serem revogados. <citation><xref linkend="freebsd-expiration-policy"/></citation> Não há, no entanto, procedimentos automáticos para fazer isso. Para reações a consentimentos de privilégios de commit não acionados pelo tempo, veja a <link linkend="process-reactions">seção 1.5.8</link>.

source: Process summary: removing a committer
pt_br: Resumo do processo: removendo um committer

source: When Core decides to clean up the committers list, they check who has not made a commit for the past 18 months. Committers who have not done so have their commit bits revoked.
pt_br: Quando o Core decide limpar a lista de committers, eles checam quem não fez um commit nos últimos 18 meses. Os committers que não fizeram isso têm seus commit bit revogados.

source: It is also possible for committers to request that their commit bit be retired if for some reason they are no longer going to be actively committing to the project. In this case, it can also be restored at a later time by core, should the committer ask.
pt_br: Também é possível que os committers solicitem que seu commit bit seja retirado se, por alguma razão, eles não estiverem mais se comprometendo ativamente com o projeto. Nesse caso, ele também pode ser restaurado posteriormente pelo core, caso o committer peça.

source: Roles in this process: <_:orderedlist-1/>
pt_br: Funções neste processo: <_:orderedlist-1/>

source: Committing code
pt_br: Enviando código para o projeto (Committing code)

source: The committing of new or modified code is one of the most frequent processes in the FreeBSD project and will usually happen many times a day. Committing of code can only be done by a <quote>committer</quote>. Committers commit either code written by themselves, code submitted to them or code submitted through a <link linkend="model-pr">problem report</link>.
pt_br: O processo de commit de um código novo ou modificado é um dos processos mais frequentes no projeto FreeBSD e geralmente acontece muitas vezes ao dia. O commit do código só pode ser feito por um <quote>committer</quote>. Committers aplicam código escrito por eles mesmos, código enviado a eles ou código enviado através de um <link linkend="model-pr">relatório de problemas</link>.
