Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/books/dev-model/*.po
Languages: pt_br

source: The Ports Subproject
pt_br: Subprojeto Ports

source: A <quote>port</quote> is a set of meta-data and patches that are needed to fetch, compile and install correctly an external piece of software on a FreeBSD system. The amount of ports have grown at a tremendous rate, as shown by the following figure.
pt_br: Um <quote>port</quote> é um conjunto de meta-dados e patches que são necessários para buscar, compilar e instalar corretamente um software externo em um sistema FreeBSD. A quantidade de ports cresceu a um ritmo tremendo, como mostra a figura a seguir.

source: Number of ports added between 1996 and 2005
pt_br: Número de ports adicionados entre 1996 e 2005

source: <xref linkend="fig-ports"/> is taken from <link xlink:href="https://www.freebsd.org/ports/growth/status.png"> the FreeBSD web site</link>. It shows the number of ports available to FreeBSD in the period 1995 to 2005. It looks like the curve has first grown exponentionally, and then since the middle of 2001 grown linearly.
pt_br: <xref linkend="fig-ports"/> é obtido do <link xlink:href="https://www.freebsd.org/ports/growth/status.png">site do FreeBSD</link>. Ele mostra o número de ports disponíveis para o FreeBSD no período de 1995 a 2005. Parece que a curva cresceu primeiro exponencialmente e, desde meados de 2001, cresceu linearmente.

source: As the external software described by the port often is under continued development, the amount of work required to maintain the ports is already large, and increasing. This has led to the ports part of the FreeBSD project gaining a more empowered structure, and is more and more becoming a sub-project of the FreeBSD project.
pt_br: Como o software externo descrito pelo port geralmente está em desenvolvimento contínuo, a quantidade de trabalho necessária para manter os ports já é grande e está aumentando. Isso fez com que a parte dos ports do projeto FreeBSD ganhasse uma estrutura mais poderosa, e está se tornando cada vez mais um subprojeto do projeto FreeBSD.

source: Ports has its own core team with the <xref linkend="role-ports-manager"/> as its leader, and this team can appoint committers without FreeBSD Core's approval. Unlike in the FreeBSD Project, where a lot of maintenance frequently is rewarded with a commit bit, the ports sub-project contains many active maintainers that are not committers.
pt_br: Ports tem seu próprio core team (time principal) com o <xref linkend="role-ports-manager"/> como seu líder, e esta equipe pode indicar committers sem a aprovação do FreeBSD Core. Ao contrário do Projeto FreeBSD, onde muitas tarefas de manutenção são frequentemente recompensadas com um commit bit, o subprojeto ports contém muitos mantenedores ativos que não são committers.

source: Unlike the main project, the ports tree is not branched. Every release of FreeBSD follows the current ports collection and has thus available updated information on where to find programs and how to build them. This, however, means that a port that makes dependencies on the system may need to have variations depending on what version of FreeBSD it runs on.
pt_br: Ao contrário do projeto principal, a árvore de ports não é ramificada (tem uma branch própria). Cada versão do FreeBSD segue a coleção atual de ports e, portanto, disponibiliza informações atualizadas sobre onde encontrar programas e como construí-los. Isso, no entanto, significa que um port que faz dependências no sistema pode precisar ter variações dependendo de qual versão do FreeBSD é executada.

source: With an unbranched ports repository it is not possible to guarantee that any port will run on anything other than -CURRENT and -STABLE, in particular older, minor releases. There is neither the infrastructure nor volunteer time needed to guarantee this.
pt_br: Com um repositório de ports não ramificado (sem branches), não é possível garantir que qualquer port seja executado em algo diferente de -CURRENT e -STABLE, em particular liberações secundárias e antigas. Não há infraestrutura nem tempo de voluntariado necessário para garantir isso.

source: For efficiency of communication, teams depending on Ports, such as the release engineering team, have their own ports liaisons.
pt_br: Para eficiência de comunicação, as equipes que dependem de ports, como a equipe de engenharia de release, têm suas próprias conexões com ports.

source: The FreeBSD Documentation Project
pt_br: O projeto de documentação do FreeBSD

source: The FreeBSD Documentation project was started January 1995. From the initial group of a project leader, four team leaders and 16 members, they are now a total of 44 committers. The documentation mailing list has just under 300 members, indicating that there is quite a large community around it.
pt_br: O projeto de Documentação do FreeBSD foi iniciado em janeiro de 1995. Desde o grupo inicial de um líder de projeto, quatro líderes de equipe e 16 membros, eles são agora um total de 44 committers. A lista de discussão de documentação tem pouco menos de 300 membros, indicando que há uma grande comunidade em torno dela.

source: The goal of the Documentation project is to provide good and useful documentation of the FreeBSD project, thus making it easier for new users to get familiar with the system and detailing advanced features for the users.
pt_br: O objetivo do projeto de Documentação é fornecer uma documentação boa e útil do projeto FreeBSD, facilitando assim que novos usuários se familiarizem com o sistema e detalhando recursos avançados para os usuários.

source: The main tasks in the Documentation project are to work on current projects in the <quote>FreeBSD Documentation Set</quote>, and translate the documentation to other languages.
pt_br: As principais tarefas no projeto de Documentação são trabalhar em projetos atuais no <quote>Conjunto de Documentação do FreeBSD</quote>, e traduzir a documentação para outros idiomas.

source: Like the FreeBSD Project, documentation is split in the same branches. This is done so that there is always an updated version of the documentation for each version. Only documentation errors are corrected in the security branches.
pt_br: Como o Projeto FreeBSD, a documentação é dividida nas mesmas branches. Isso é feito para que sempre haja uma versão atualizada da documentação de cada versão. Apenas erros de documentação são corrigidos nas branches de segurança.

source: Like the ports sub-project, the Documentation project can appoint documentation committers without FreeBSD Core's approval. <citation><xref linkend="freebsd-doceng-charter"/></citation>.
pt_br: Como o sub-projeto ports, o projeto de Documentação pode indicar committers de documentação sem a aprovação do FreeBSD Core. <citation><xref linkend="freebsd-doceng-charter"/></citation>.

source: The Documentation project has a primer. This is used both to introduce new project members to the standard tools and syntaxes and acts as a reference when working on the project.
pt_br: O projeto de Documentação possui uma cartilha. Isso é usado para apresentar novos membros de projeto às ferramentas e sintaxes padrão e atua como referência ao trabalhar no projeto.

source: References
pt_br: Referências

source: Candidatus Scientiarum thesis
pt_br: Tese de Candidatus Scientiarum

source: Putting it All in the Trunk
pt_br: Colocando tudo no porta-malas

source: Incremental Software Development in the FreeBSD Open Source Project
pt_br: Desenvolvimento Incremental de Software no Projeto Open Source do FreeBSD

source: <personname><surname>Project Management Institute</surname></personname>
pt_br: <personname><surname>Instituto de Gerenciamento de Projeto</surname></personname>

source: <year>1996</year><year>2000</year> <holder>Project Management Institute</holder>
pt_br: <year>1996</year><year>2000</year> <holder>Instituto de Gerenciamento de Projetos</holder>

source: Project Management Institute
pt_br: Instituto de Gerenciamento de Projetos

source: PMBOK Guide
pt_br: Guia PMBOK

source: <year>2002</year> <holder>The FreeBSD Project</holder>
pt_br: <year>2002</year> <holder>O projeto FreeBSD</holder>

source: Core Bylaws
pt_br: Estatuto do Core

source: <year>2002</year> <holder>The FreeBSD Documentation Project</holder>
pt_br: <year>2002</year> <holder>O Projeto de Documentação do FreeBSD</holder>

source: FreeBSD Developer's Handbook
pt_br: Manual do desenvolvedor do FreeBSD

source: Core team election 2002
pt_br: Eleição da equipe do Core em 2002

source: Problem Report Handling Guidelines
pt_br: Diretrizes para manuseio de Relatórios de Problemas

source: Writing FreeBSD Problem Reports
pt_br: Escrevendo Relatórios de Problemas do FreeBSD

source: <year>2001</year> <holder>The FreeBSD Documentation Project</holder>
pt_br: <year>2001</year> <holder>O Projeto de Documentação do FreeBSD</holder>

source: Committers Guide
pt_br: Guia para Commiters

source: FreeBSD Release Engineering
pt_br: Engenharia de Release do FreeBSD

source: <personname><surname>The FreeBSD Documentation Project</surname></personname>
pt_br: <personname><surname>Projeto de Documentação do FreeBSD</surname></personname>

source: FreeBSD Handbook
pt_br: Manual do FreeBSD

source: Contributors to FreeBSD
pt_br: Colaboradores para o FreeBSD

source: The FreeBSD Project
pt_br: O projeto FreeBSD

source: Core team elections 2002
pt_br: Eleições da equipe do Core em 2002

source: Commit Bit Expiration Policy
pt_br: Política de expiração de commit bit

source: New Account Creation Procedure
pt_br: Novo procedimento de criação de conta

source: FreeBSD DocEng Team Charter
pt_br: Capitulo da Equipe do DocEng do FreeBSD

source: Two years in the trenches
pt_br: Dois anos nas trincheiras

source: The evolution of a software project
pt_br: A evolução de um projeto de software
