<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY date "$FreeBSD: www/es/gnome/docs/bugging.sgml,v 1.9 2003/08/26 07:47:30 marcus Exp $">
<!ENTITY title "Proyecto FreeBSD GNOME: Reportando un Error">
<!ENTITY % gnomeincludes SYSTEM "../includes.sgml"> %gnomeincludes;
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
]>

<html>
  &header;

          <h2>1. &iquest;Qu&eacute; reportar?</h2>

          <p>La regla del pulgar es: reporte toda la informaci&oacute;n
                posible.  Incluso si cuenta con informaci&oacute;n que no sea muy
                relevante, los desarrolladores puden descartarla sin problema.
                Por el contrario, la situaci&oacute;n es muy complicada cuando es muy
                poca informaci&oacute;n para rastrear o replicar el problema - en
                estos casos los desarrolladores deben pasar mucho tiempo
                adivinando y/o preguntando a quien envio el reporte por
                mas informaci&oacute;n.</p>

          <p>Existe una infinidad de ejemplos de reportes de errores
                completamente inutiles, algo como <i>"Hey, existe un
                problema con gnomefoo.  Estoy corriendo FreeBSD-X.Y.  Por
                favor arreglenlo"</i>.  De sobra esta decir que este reporte
                es una p&eacute;rdida de tiempo tanto para quien reporta como para
                el desarrollador y por supuesto de ancho de banda.  Como
                m&iacute;nimo el reporte debe contener la siguiente informaci&oacute;n:</p>

          <ul>
            <li><p>La versi&oacute;n exacta del sistema operativo (normalmente 
			  es la salida de <tt>uname -a</tt>).</p></li>
            <li><p>Una lista de todos los paquetes instalados en su sistema.</p></li>
            <li><p>Sus variables de entorno (la salida de <tt>/usr/bin/env</tt>).
            <li><p>Si esta compilando desde los ports, la fecha y hora estimada de la
                  &uacute;ltima vez que actualiz&oacute; su &aacute;rbol de ports.</p></li>
            <li><p>Informaci&oacute;n espec&iacute;fica de cada tipo de error: el archivo de
                  registro (log) de una compilaci&oacute;n fallida en el caso de que el
                  fallo se presente al compilar un port, un stack trace en caso de
                  que se trate de un core dump, una clara y detallada descripci&oacute;n
                  del problema cuando la aplicaci&oacute;n realiza algo inesperado etc.
                  Intente ponerse en los zapatos del desarrollador y en cada caso
                  en particular, y evaluar que informaci&oacute;n ser&aacute; necesaria 
				  para lograr llegar a la ra&iacute;z del problema.  No asuma que 
				  ellos ya saben del problema, pero son flojos para arreglarlo.</p></li>
          </ul>

          <p>Si cuenta con una soluci&oacute;n o una forma de arreglarlo, entonces
                incl&uacute;yalo tambi&eacute;n en el reporte, a&uacute;n cuando no
				este seguro de que sea la mejor forma de arreglarlo.  Si no lo es, 
				le puede dar una buena idea a los desarrolladores de donde enfocarse,
				lo cual se traduce en ahorro de tiempo.
          </p>

          <h2>2. &iquest;D&oacute;nde reportar?</h2>

          <p>Antes de reportar un fallo, o incluso enviar un correo a la
            lista, haga una
            <a href="http://www.freebsd.org/search/search.html">b&uacute;squeda</a>
            por los archivos de la lista de correo de FreeBSD GNOME, para
            ver si no se ha reportado ya el problema.  La mayor parte de los
            problemas reportados se repiten, y al realizar dicha b&uacute;squeda,
            puede encontrar una soluci&oacute;n mas rapidamente.
          </p>

          <p>Una vez que este seguro de que se trata de un nuevo reporte,
                existen varias formas de reportar un fallo en GNOME sobre FreeBSD:
                puede enviar un reporte a la
                <a href="mailto:&email;@FreeBSD.org">lista de correo freebsd-gnome</a>,
                llenar un reporte de fallos en el
            <a href="http://www.freebsd.org/support.html#gnats">sistema de
                reporte de fallos de FreeBSD</a>, enviar su reporte a los mismos
                desarrolladores de GNOME, a su
            <a href="http://bugzilla.gnome.org/">sistema de seguimiento de fallos</a>,
                o bien, una combinaci&oacute;n de estos.<p>

          <p>Es pr&aacute;cticamente imposible definir una g&iacute;ua que claramente
		  		le indique donde reportar en cada caso particular - por lo que debe
                hacer uso de su sentido com&uacute;n, de cualquier forma estas reglas
                pueden servir de algo:</p>

          <ul>
            <li><p>Si es un problema espec&iacute;fico de FreeBSD (ejem.
              	  error en checksum, fallo de un parche, error de escritura en
                  el Makefile del port, etc.), entonces reportelo a la lista
                  de correo <a href="mailto:&email;@FreeBSD.org">freebsd-gnome</a>.</p></li>
            <li><p>Si es claro que el problema no es espec&iacute;fico de FreeBSD, y no
                  cuenta una soluci&oacute;n, reportelo a los desarrolladores del software
                  directamente (quiere decir que para la mayor&iacute;a de los componentes
                  de GNOME, hay que usar su sistema de fallos; Bugzilla).</p></li>
            <li><p>Si el problema no es particular de FreeBSD, pero es algo grave
                  y usted cuenta con una soluci&oacute;n entonces reportelo a ambos; a
                  FreeBSD y al sistema de fallos del autor, de tal forma que el
                  port en cuesti&oacute;n ser&aacute; arreglado y otros usuarios de 
				  FreeBSD se beneficiaran de su soluci&oacute;n, sin la necesidad 
				  de esperar la pr&oacute;xima versi&oacute;n del proveedor.</p></li>
          </ul>

    &footer;
  </body>
</html>
