<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY date "$FreeBSD: www/es/gnome/docs/develfaq.sgml,v 1.1 2004/03/05 19:58:08 jesusr Exp $">
<!ENTITY title "Proyecto FreeBSD GNOME: FAQ de Desarrollo GNOME">
<!ENTITY % gnomeincludes SYSTEM "../includes.sgml"> %gnomeincludes;
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
]>
<html>
  &header;

        <h2>Contenido</h2>
          <ol>
            <li> <a href="#q1">&iquest;Qu&eacute; son las versiones de 
	      desarrollo de GNOME?</a>
            <li> <a href="#q2">&iquest;Debo seguir las versiones de 
	      desarrollo?</a>
            <li> <a href="#q3">&iquest;C&oacute;mo obtengo partes de las 
	      versiones de desarrollo de GNOME?</a>
            <li> <a href="#q4">&iquest;C&oacute;mo me mantengo actualizado y 
	      sincronizado?</a>
            <li> <a href="#q5">&iquest;Qu&eacute; debo hacer cuando algo no 
	      funcione?</a>
            <li> <a href="#q6">&iquest;C&oacute;mo puedo ayudar con las 
	      versiones de desarrollo?</a>
            <li> <a href="#q7">&iquest;C&uacute;al es el estado actual del 
	      desarrollo de GNOME sobre FreeBSD?</a>
          </ol>

        <h2>Texto Completo</h2>

          <ol>
<!-- Q1 -->
            <li style="padding-bottom: 0.5em"><a name="q1"></a>
            <p><b>&iquest;Qu&eacute; son las versiones de desarrollo de GNOME?</b></p>
<!-- A1 -->
            <p>Las versiones de desarrollo son los paquetes liberados por el 
	      proyecto GNOME, que eventualmente ser&aacute;n las versiones 
	      estables.  Existen tres ramas principales en estas versiones:
	      </p>
          <ol>
            <li><b>STABLE</b> (ESTABLE) - Las librer&iacute;as y aplicaciones
	      en la rama estable son consideradas "de calidad comprobada" y 
	      son las versiones que aparecen en el &aacute;rbol de ports de 
	      FreeBSD.  La versi&oacute;n estable actual de GNOME es 
	      &gnomever;.</li>
            <li><b>DEVELOPMENT</b> (DESARROLLO) - Entre cada versi&oacute;n 
	      estable est&aacute;n las versiones de desarrollo.  
	      Tradicionalmente las versiones en desarrollo de GNOME cuentan 
	      con numeros impares (p.e. 2.3, 2.5, 2.(n*2)-1).  Las versiones 
	      en desarrollo ser&aacute;n las versiones estables y son 
	      consideradas de calidad beta.  Las versiones de desarrollo 
	      necesitan ser probadas por usuarios de FreeBSD para poder 
	      minimizar las sorpresas una vez que la versi&oacute;n estable es
	      inclu&iacute;da en el &aacute;rbol de ports CVS de FreeBSD.  
	      Este documento trata sobre &eacute;sta rama.</li>
            <li><b>CVS</b> - Cont&iacute;nuamente 
	      lo-&uacute;ltimo-de-lo-&uacute;ltimo, las aplicaciones y 
	      bibliotecas de la versi&oacute;n de CVS de GNOME son de calidad
	      alpha y en ocasiones completamente incompilables.  El proyecto 
	      FreeBSD GNOME presta atenci&oacute;n pero no da seguimiento al 
	      c&oacute;digo de calidad alpha.</li>
          </ol>
        </li>

<!-- Q2 -->
        <li style="padding-bottom: 0.5em"><a name="q2"></a>
            <p><b>&iquest;Debo seguir las versiones de desarrollo?</b></p>
<!-- A2 -->
                <p>Si usted busca en entorno estable, definitivamente no.  
		  Por favor mant&eacute;ngase en la rama de desarrollo si 
		  desea ayudar a identificar fallos y mejorar el proyecto 
		  FreeBSD GNOME.  A usted le parecer&aacute; poco gracioso si
		  una aplicaci&oacute;n en desarrollo destruye su trabajo.</p>
                </li>

<!-- Q3 -->
                <li style="padding-bottom: 0.5em"><a name="q3"></a>
                <p><b>&iquest;C&oacute;mo obtengo partes de las versiones de 
		  desarrollo de GNOME?</b></p>
<!-- A3 -->
                <p><a href="mailto:marcus@FreeBSD.org">Marcus</a> es el 
		  responsable de mantener el servidor CVS donde se ubican  
		  todos los componentes de las versiones en desarrollo del 
		  proyecto FreeBSD GNOME.  Las instrucciones sobre como ver 
		  el m&oacute;dulo ``ports'' y c&oacute;mo fusionarlo con el 
		  &aacute;rbol de ports de FreeBSD est&aacute;n en la 
		  p&aacute;gina principal del repositorio.  Por favor, lea 
		  cuidadosamente las instrucciones en
                  <a href="http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi">
		  http://www.marcuscom.com:8080/cgi-bin/cvsweb.cgi</a>.
                  </p>
                  </li>

<!-- Q4 -->
                <li style="padding-bottom: 0.5em"><a name="q4"></a>
                <p><b>&iquest;C&oacute;mo me mantengo sincronizado y 
		  al d&iacute;a?</b></p>
<!-- A4 -->
                <p>La respuesta corta es que debe usar el script 
		  <tt>marcusmerge</tt>, que le servir&aacute; para fusionar 
		  el &aacute;rbol de desarrollo con el &aacute;rbol de ports 
		  de FreeBSD.  El script <tt>marcusmerge</tt> est&aacute; 
		  disponible en el repositorio MarcusCom, bajo el modulo 
		  <tt>portstools</tt>.</p>

                <p>La respuesta aun mas corta y determinante es que si usted 
		  no sabe como obtener algo por medio de CVS y fusionarlas 
		  usando un script preelaborado deber&iacute;a mantenerse con
		  la rama estable.</p>
                </li>

<!-- Q5 -->
                <li style="padding-bottom: 0.5em"><a name="q5"></a>
                <p><b>&iquest;Qu&eacute; debo hacer cuando algo no funcione?
		  </b></p>
<!-- A5 -->
                <p>Depende.  Si cree que el problema es realmente un error 
                  de alg&uacute;n componente de GNOME puede enviar un informe
		  de error mediante <em>bug-buddy</em> o el interfaz de 
                  GNOME <a href="http://bugzilla.gnome.org">Bugzilla</a>. El 
		  interfaz de Bugzilla para Evolution puede consultarse 
		  <a href="http://bugzilla.ximian.com">aqu&iacute;</a>).  Si 
		  considera que el problema est&aacute; en un port de FreeBSD
		  o es espec&iacute;fica de FreeBSD env&iacute;e un correo a 
		  <a href="mailto:&email;@FreeBSD.org">&email;@FreeBSD.org</a>
		  o informe del problema en el canal de IRC 
		  <em>#freebsd-gnome</em>, en FreeNode.</p>   
                </li>

<!-- Q6 -->
                <li style="padding-bottom: 0.5em"><a name="q6"></a>
                <p><b>&iquest;C&oacute;mo puedo ayudar con las versiones de 
		  desarrollo?</b></p>
<!-- A6 -->
		<p><i>Necesitamos gente que haga todas las pruebas posibles y
		  que redacte tantos buenos informes de errores como sea 
		  posible.  Necesitamos tambi&eacute;n personas con 
		  habilidades art&iacute;sticas para crear 
                  <a href="/gnome/screenshots.html">capturas de pantalla</a> 
		  impresionantes.</i></p> 
                <p>Si le gusta programar y sabe Perl necesitamos 
		  <em>imperiosamente</em> ayuda para portar 
		  <a href="http://www.gnome.org/projects/gst/index.html">gnome-system-tools</a>.  
		  Si est&aacute; interesado en ayudar por favor 
		  p&oacute;ngase en contacto con 
		  <a href="marcus@FreeBSD.org">marcus@FreeBSD.org</a>.</p>
                <p>Incluso si trabajar con c&oacute;digo fuente no es lo que 
		  m&aacute;s le motiva necesitamos informes de experiencias 
		  de actualizaci&oacute;n de GNOME 2.4 a GNOME 2.5; 
		  necesitamos informaci&oacute;n sobre qu&eacute; 
		  aplicaciones muestran un comportamiento extra&ntilde;o; 
		  necesitamos un conocimiento exhaustivo sobre todo aquello 
		  que anda rondando las cabezas de nuestros y nuestras 
		  usuarias acerca de GNOME y su futuro.</p>
                </li>

<!-- Q7 -->
                <li style="padding-bottom: 0.5em"><a name="q7"></a>
                <p><b>&iquest;C&uacute;al es el estado actual del desarrollo 
		  de GNOME sobre FreeBSD?</b></p>
<!-- A7 -->
                <p>Las versiones en desarrollo del entorno completo del 
		  escritorio GNOME est&aacute;n disponibles y todas compilan 
		  limpiamente.</p> 

                <p>La mayor&iacute;a de los componentes de 
		  <tt>x11/gnome2-fifth-toe</tt> cuentan con versiones en 
		  desarrollo operables.  Aunque <tt>AbiWord</tt> no compila 
		  a&uacute;n con las nuevas librer&iacute;as GTK+-2.3, 
		  as&iacute; como ninguna de las aplicaciones que cuentan con
		  arreglos en C++.  Los arreglos en C++ existen, pero ninguna
		  de las aplicaciones de Fifth Toe compilan a&uacute;n.  
		  <tt>GTetrinet</tt> tampoco compila a&uacute;n.</p>

                <p>Aquellas personas que usan GNOME 2.5 deber&aacute;n 
		  enfrentarse con un conflicto de ficheros entre libgnome y 
		  gnomecontrolcenter2 que provocan un fallo reiterativo en:
		  </p>
                <pre>
	# portupgrade -f gnomecontrolcenter2
	# portupgrade -f libgnome
                </pre>

                </li>

              </ol>
  &footer;
</body>
</html>
