<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Proyecto FreeBSD GNOME: GNOME 2.0 FAQ">
<!ENTITY % gnomeincludes SYSTEM "../includes.sgml"> %gnomeincludes;
<!ENTITY % includes SYSTEM "../../includes.sgml"> %includes;
]>
<html>
  &header;

  <table border="0">
    <tr>
      <td>
        <h2>Contenido</h2>
          <ol>
            <li> <a href="#q1">&iquest;C&oacute;mo obtengo GNOME 2.0 para FreeBSD?</a>
            <li> <a href="#q2">GNOME 2.0 esta fallando al compilar de los ports.  
              &iquest;Qu&eacute; debo hacer?</a>
            <li> <a href="#q3">He instalado GNOME 2.0, pero he perdido la 
	          aplicaci&oacute;n foo.  &iquest;Qu&eacute; hago?</a>
            <li> <a href="#q4">&iquest;C&uacute;al es la mejor forma de actualizar de
              GNOME 1.4 a GNOME 2.0?</a>
	    <li> <a href="#q5">&iquest;C&oacute;mo puedo mantener mi sistema GNOME 2.0 y
	          todos sus componentes actualizados?</a>
	    <li> <a href="#q6">&iquest;Puedo instalar aplicaciones de GNOME 1.4 en GNOME
	          2.0 y viceversa?</a>
	    <li> <a href="#q7">&iquest;Donde puedo obtener temas para GNOME 2.0?</a>
	    <li> <a href="#q8">&iquest;Qu&eacute; manejadores de ventanas trabajan bien 
	         con GNOME 2.0?</a>
	    <li> <a href="#q9">&iquest;Soporta GNOME 2.0 fuentes anti-alias?</a>
	    <li> <a href="#q10">&iquest;C&oacute;mo edito los menus de GNOME 2?</a>
	    <li> <a href="#q11">&iquest;C&oacute;mo utilizo configuraciones de GTK+ 2
	         para aplicaciones de GTK+ 2, cuando no estoy trabajando en GNOME?</a>
          </ol>
        <h2>Texto Completo</h2> 
        <table border="0" cellspacing="0" cellpadding="2">

<!-- Q1 -->
          <tr>
	    <td width="10">
	      <b><a name="q1"> 1.</a></b>
	    </td>
	    <td align="left" valign="top" colspan="3">
	      <b>&iquest;C&oacute;mo obtengo GNOME 2.0 para FreeBSD?</b>
	    </td>
          </tr>
          <tr>
<!-- A1 -->
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>Existen dos maneras de instalar GNOME 2.0 bajo FreeBSD.  Una forma es usar 
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/packages-using.html">
	        paquetes</a>, y la otra forma es por medio de la colecci&oacute;n de 
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/ports-using.html">
	        ports</a>.</p>

	    <p>Para instalar GNOME 2.0 desde paquetes, use el comando:</p>

	    <tt># pkg_add -r gnome2</tt>

	    <p>Con esto, descargar&aacute; los &uacute;ltimos paquetes de GNOME 2.0, 
	      del sitio FTP de FreeBSD, y proceder&aacute; a instalarlo en su sistema.
	    </p>

	    <p>Para compilar es instalar GNOME 2.0 desde los ports, primero deber&aacute;
	      actualizar su &aacute;rbol de ports, por medio de  
	      <a href="http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/cvsup.html">
	        cvsup</a>.  Y posteriormente ejecutar:</p>

	    <pre>
# cd /usr/ports/x11/gnome2
# make clean
# make install clean
	    </pre>

	    <p>La compilaci&oacute;n e instalaci&oacute;n por medio de los ports,
	      es el metodo m&aacute;s recomendado de instalar GNOME 2.</p>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q2 -->
        <tr>
	  <td width="10">
	    <b><a name="q2"> 2.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>GNOME 2.0 esta fallando al compilar de los ports.  
	      &iquest;Qu&eacute; debo hacer?</b>
	  </td>
        </tr>
<!-- A2 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>La mayor&iacute;a de los problemas de compilaci&oacute;n de GNOME 2.0, pueden
	      solucionarse al asegurarnos de que contamos con todos los componentes
	      necesarios por GNOME 2.0 <a href="#q5">actualizados</a>.  Puede ser que vea
	      errores de compilaci&oacute;n, haciendo referencia a pthreads 
	      (POSIX threads), tal como:</p>

	    <pre>
undefined reference to 'strerror_r'
            </pre>

	    <p>Para arreglar este tipo de errores, asegurese de contar con la siguiente
	      opci&oacute;n compilada en su kernel:</p>

	    <pre>
options     _KPOSIX_PRIORITY_SCHEDULING
            </pre>

	    <p>Y en el caso de que usted cuente con -stable o -current, asegurese de
	      que <b>no</b> cuenta con la opci&oacute;n <tt>NOLIBC_R</tt> habilitada 
	      en su fichero <tt>/etc/make.conf</tt>.  Si es as&iacute;, eliminela y,
	      recompile su sistema (build world).  Si a&uacute;n tiene problemas, 
	      por favor envie un correo a <a href="mailto:&email;@FreeBSD.org">
	      &email;@FreeBSD.org</a> con la salida que manda el error de la
	      compilaci&oacute;n.  Tambi&eacute;n es de ayuda, incluir el fichero
	      config.log, del directorio work del port.</p>

	    <p>Algunos ports como <tt>devel/pth</tt> y <tt>devel/ngpt</tt> pueden 
	      ocasionar tambi&eacute;n problemas relacionados con pthread, al 
	      momento de compilar GNOME 2.0.  Si no requiere de estos ports, es
	      recomendable eliminarlos.</p>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q3 -->
        <tr>
	  <td width="10">
	    <b><a name="q3"> 3.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>He instalado GNOME 2.0, pero he perdido la aplicaci&oacute;n foo.
	      &iquest;Qu&eacute; hago?</b>
	  </td>
        </tr>
<!-- A3 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>En el paquete <tt>gnome2</tt>, solamente se incluye el sistema base, y
	      algunos extras.  En virtud de que GNOME 2.0 es tan nuevo, a&uacute;n no
	      han sido portadas gran cantidad de aplicaciones, conforme existan 
	      m&aacute;s aplicaciones, estas ser&aacute;n portadas.  Mientras esto
	      sucede, usted puede ejecutar <a href="#q6">aplicaciones de GNOME 1.4</a>
	      bajo GNOME 2.0.</p>

	    <p>Gran cantidad de aplicaciones est&aacute;n listas para su uso en 
	      GNOME 2.0, y estas est&aacute;n disponibles en el meta port  
	      <tt>gnome2-fifth-toe</tt>.  El meta port <tt>gnome2-fifth-toe</tt>
	      incluye algunas aplicaciones de GNOME 1.4, en su versi&oacute;n para 
	      GNOME 2.0.  Note que algunas de estas aplicaciones a&uacute;n 
	      est&aacute;n en desarrollo, por lo que puede que no sean tan estables.
	      </p>

	    <p>Para instalar <tt>gnome2-fifth-toe</tt> desde paquetes, ejecute:</p>

            <pre>
# pkg_add -r gnome2-fifth-toe
            </pre>

	    <p>Para instalar <tt>gnome2-fifth-toe</tt> desde los ports, ejecute:</p>

	    <pre>
# cd /usr/ports/x11/gnome2-fifth-toe
# make clean
# make install clean
	    </pre>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q4 -->
        <tr>
	  <td width="10">
	    <b><a name="q4"> 4.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;C&uacute;al es la mejor forma de actualizar de GNOME 1.4 a GNOME 2.0?
	    </b>
	  </td>
        </tr>
<!-- A4 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>En este momento existen muchos cambios en el proyecto GNOME.  
	      A&uacute;n hay trabajo por hacer, para efecto de que la infraestructura
	      de ports trabaje de forma transparente.  Aun con esto, si cuenta con
	      GNOME 1.4 y desea actualizar a GNOME 2.0, en primer lugar debe
	      familiarizarse con la gu&iacute;a <a 
	      href="http://www.gnome.org/start/2.0/installation.html#upgrading">oficial</a>
	      de actualizaci&oacute;n, provista por el sitio de GNOME.  Despu&eacute;s,
	      asegurese de que los componentes de GNOME 1.4 est&aacute;n actualizados, y
	      proceda a eliminar los siguientes paquetes del sistema:</p>
	    
	    <pre>
gnomecore
sawfish
gnomeapplets 
gnomemedia
gtop
libgtop
nautilus
glade
gedit
xalf
bugbuddy
gnomegames
gnomeutils
gdm
eog
	   </pre>

	   <p>Una vez que se hayan eliminado estos paquetes, podr&aacute; compilar GNOME 2.0, de
	     acuerdo a las instrucciones que se mencionan anteriormente.</p>

	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q5 -->
        <tr>
	  <td width="10">
	    <b><a name="q5"> 5.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;C&oacute;mo puedo mantener mi sistema GNOME 2.0 y todos sus
	      componentes actualizados?</b>
	  </td>
        </tr>
<!-- A5 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>Para este tipo de trabajos he visto que 
	      <tt>/usr/ports/sysutils/portupgrade</tt> trabaja bastante bien. Por
	      ejemplo:</p>

	    <tt># portupgrade -r pkgconfig</tt>

	    <p>Esto actualizar&aacute; pkgconfig y cualquier otro componente del 
	      cual dependa (y que requiera actualizarse).</p>

	    <p>De cualquier manera, hay ocasiones que se presentan tantos cambios
	      que es necesaria una limpieza m&aacute;s profunda.  En estos casos lo 
	      que normalmente funciona es:</p>

	    <pre>
# pkg_delete -rf pkgconfig\*
# cd /usr/ports/x11/gnome2
# make clean
# make install clean
	    </pre>

	    <p>Con esto, se eliminar&aacute;n <b>todos</b> los componentes y 
	      aplicaciones de GNOME 1 y 2 de su maquina, pero reinstalar&aacute;
	      &uacute;nicamente el escritorio GNOME 2.  Si decide hacer esto, debe 
	      tomar en cuenta que todas sus aplicaciones, deber&aacute;n ser 
	      reinstaladas, una vez que instale el escritorio.  Afortunadamente, 
	      es raro la ocasi&oacute;n en que esta medida es necesaria.</p>
	  </td>
        </tr>

        <tr><td><br></td></tr>

<!-- Q6 -->
        <tr>
	  <td width="10">
	    <b><a name="q6"> 6.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;Puedo instalar aplicaciones de GNOME 1.4 bajo GNOME 2.0
	      y viceversa?</b>
	  </td>
        </tr>
<!-- A6 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>&iexcl;Claro!  En este momento el equipo de FreeBSD esta en proceso
	      de migrar todos los ports de GNOME 1.4 a una nueva infraestructura
	      de compilaci&oacute;n.  Esta nueva infraestructura, denominada
	      <b>GNOMENG</b>, permitir&aacute; a usuarios de GNOME 2, instalar
	      ports de >GNOME 1.4, sin que esto sobreescriba o altere el 
	      funcionamiento de su escritorio GNOME 2.</p>
	    
	    <p>Antes de compilar un port de GNOME 1.4 bajo GNOME 2, verifique 
	      el fichero Makefile del port, y busque en su contenido, la
	      siguiente l&iacute;nea:</p>

	    <pre>
USE_GNOMENG=	yes
	    </pre>

	    <p>En el caso de que si encuentre esta l&iacute;nea, entonces
	      puede compilar el port sin problema, bajo GNOME 2.  Si el
	      fichero Makefile, contiene la siguiente l&iacute;nea en su
	      lugar, <b>no</b> lo compile, ya que esto sobreescribira su 
	      escritorio GNOME 2 por completo:</p>

	    <pre>
USE_GNOME=	yes
	    </pre>

	    <p>En este caso, envie un correo a 
	      <a href="mailto:&email;@FreeBSD.org">&email;@FreeBSD.org</a>
	      mencionando el nombre del port, y nosotros lo convertiremos a la
	      nueva estructura.  Por otro lado, usted es libre de convertir el
	      port y enviarlo por medio de PR.</p>

	    <p><b>&iexcl;NOTA!</b>  Usted <b>debe</b> contar con un directorio 
	      <tt>/usr/ports/Mk</tt>, para efecto de poder utilizar las ventjas
	      del nuevo GNOMENG.  Si no cuenta con dicho directorio, a&uacute;n
	      cuando el Makefile contenga definido USE_GNOMENG, su escritorio
	      GNOME 2 ser&aacute; sobreescrito.  Para efecto de actualizar el
	      directorio (o contar) Mk, asegurese de que el fichero 
	      <tt>supfile</tt> que utiliza para actualizar su colecci&oacute;n 
	      de ports, contenga la declaraci&oacute;n <b>ports-base</b>.
	      Esto se hace en autom&aacute;tico, si cuenta con la
	      declaraci&oacute;n <b>ports-all</b>.</p>

	    <p>Para efecto de ejecutar aplicaciones de GNOME 2.0 bajo GNOME 
	      1.4, debe asegurarse que los componentes de GNOME 1.4 est&aacute;n
	      actualizados, y posteriormente instalar el port 
	      <tt>gnome2-devel</tt>.  Para instalar este port, puede hacer:</p>

	    <pre>
# cd /usr/ports/devel/gnome2-devel
# make clean
# make install
	    </pre>

	    <p>Una vez que haya instalado el port <tt>gnome2-devel</tt>, podr&aacute;
	      instalar aplicaciones de GNOME 2.0 sin necesidad de contar con el 
	      escritorio en s&iacute; (por ejemplo; <tt>math/gcalctool</tt>).</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q7 -->
        <tr>
	  <td width="10">
	    <b><a name="q7"> 7.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;D&oacute;nde puedo obtener m&aacute;s temas para GNOME 2.0?</b>
	  </td>
        </tr>
<!-- A7 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>Es sitio web <a href="http://art.gnome.org"> 
	      art.gnome.org</a> se ha establecido como repositorio general para
	      temas de GNOME.  Ah&iacute; podr&aacute; encontrar temas para 
	      gtk+-2.0, metacity, sawfish, nautilus, y gdm, as&iacute; como
	      tapices de escritorio (background).</p>

	    <p>Recientemente ha sido lanzado un nuevo sitio llamado 
	      <a href="http://www.themedepot.org">The Theme Depot</a>.  Este sitio
	      contiene temas para GNOME 2 y KDE, as&iacute; como para varios
	      manejadores de ventanas.</p>

	    <p>Un excelente sitio para descargar iconos de GNOME (algunos nuevos y
	      otros no tanto) es el sitio de iconos de 
	      <a href="http://jimmac.musichall.cz/ikony.php3">jimmac</a>.</p>

	    <p>Vea las instrucciones de cada sitio, para efecto de instalar los 
	      temas.  Y si siente deseos de aportar un tema nuevo, adelante, 
	      que nadie lo rechazar&aacute; ;-).</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>

<!-- Q8 -->
        <tr>
	  <td width="10">
	    <b><a name="q8"> 8.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;Qu&eacute; manejadores de ventanas trabajan bien con GNOME 2.0?</b>
	  </td>
        </tr>
<!-- A8 -->
        <tr>
	  <td width="10"> <br> </td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>El meta-port <tt>gnome2</tt> instala por default los manejadores
	      <a href="http://sawmill.sourceforge.net/">sawfish</a> y metacity.
	      Ambos trabajan bien con GNOME 2.0.  Mucha gente prefiere metacity
	      en virtud de que es un poco m&aacute;s ligero.  Aun cuando sawfish
	      ser&aacute; el manejador que se usa por default.</p>

	    <p>Para cambiar entre manejadores de ventanas entre sawfish y metacity
	      en GNOME 2, deber&aacute; realizar los siguientes pasos:</p>

<pre>
killall sawfish; metacity &
</pre>
	    <p>Para volver al anterior, simplemente sustituya sawfish por metacity
	      y viceversa.  En la futura versi&oacute;n de gnomecontrolcenter2, 
	      habr&aacute; una manera m&aacute;s sencilla de realizar esta labor.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q9 -->
        <tr>
	  <td width="10">
	    <b><a name="q9"> 9.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;Soporta GNOME 2.0 fuentes anti-alias?</b>
	  </td>
        </tr>
<!-- A9 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3"> 
		<p>&iexcl;Claro!  Esta funcionalidad requiere que cuente con
		  XFree86 4.x con soporte freetype2.  Para a&ntilde;adir soporte
		  freetype2 al servidor X, asegurese de que cuenta con las
		  siguientes opciones en la secci&oacute;n de modulos (Modules)
		  de su fichero <tt>/etc/X11/XF86Config</tt>:</p>

		<pre>
Load	"freetype"
Load	"type1"
		</pre>
		
		<p>Despu&eacute;s, simplemente establezca la variable de
		  ambiente <tt>GDK_USE_XFT</tt> a 1, antes de inicializar
		  GNOME.  Si usted utiliza gdm, puede a&ntilde;adirla en su
		  fichero <tt>~/.gnomerc</tt> (&iexcl;asegurese de que el fichero
		  es ejecutable!).  Si usted utiliza startx, para iniciar su 
		  sesi&oacute;n de GNOME, puede incluirla en el fichero
		  <tt>~/.xinitrc</tt>.</p>

		<p>Si tiene alguna pregunta, por favor enviela al correo
		  <a href="mailto:&email;@FreeBSD.org">&email;@FreeBSD.org</a>.
		</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q10 -->
        <tr>
	  <td width="10">
	    <b><a name="q10"> 10.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;C&oacute;mo edito los menus de GNOME 2?</b>
	  </td>
        </tr>
<!-- A10 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>Para efecto de editar los menus de GNOME 2, usted requiere del 
	      apoyo de Nautilus.  Si desea editar cualquier otro menu que no
	      sea el de Favoritos, requiere estar firmado como root.  Esta
	      habilidad requiere de GNOME 2.0.2 o posterior.</p>

	    <p>Para editar los menus, lance Nautilus e ingrese el URL
	      <b>applications:///</b>.  Desde ah&iacute; usted podr&aacute;
	      editar los menus de todas las aplicaciones.</p>
	  </td>
        </tr>
        <tr><td><br></td></tr>
<!-- Q11 -->
        <tr>
	  <td width="10">
	    <b><a name="q11"> 11.</a></b></td>
	  <td align="left" valign="top" colspan="3">
	    <b>&iquest;C&oacute;mo utilizo configuraciones de GTK+ 2, para aplicaciones
	      de GTK+ 2, cuando no estoy en GNOME?</b>
	  </td>
        </tr>
<!-- A11 -->
        <tr>
	  <td width="10"><br></td>
	  <td align="left" valign="top" colspan="3"> 
	    <p>Las aplicaciones de GNOME 2, obtienen los recursos de GTK+ 2 desde los
	      temas y su correspondiente configurador de temas.  Si usted prefiere
	      ejecutar sus aplicaciones GTK+ 2 en un entorno diferente de GNOME, 
	      entonces deber&aacute; de contar con un fichero llamado 
	      <tt>~/.gtkrc-2.0</tt>.  Del cual la mayor parte puede ser importado del
	      fichero <tt>~/.gtkrc</tt> (usado para GTK+ 1.2) con algunos
	      detalles por adecuar.</p>

	      <ol>
	        <li>Si cuenta con alguna referencia para configurar temas, deber&aacute;
	      asegurarse, que exista una para el motor de GTK+ 2.  De otra forma elimine 
	      las entradas de los motores.</li>
	        <li>La especificaci&oacute;n por default para fuentes, deber&aacute;
	      ser por fuera de cualquier bloque de <tt>estilo</tt> (style) y 
	      deber&aacute; especificarse con la palabra clave (keyword).  Por
	      ejemplo:
	      
		  <pre>gtk-font-name = "Verdana 11"</pre>
		</li>
              </ol>
	  </td>
        </tr>
        <tr><td><br></td></tr>
        </table>
      </td>
    </tr>
  </table>
  &footer;
</body>
</html>
