freebsd/freebsd-doc/documentation/manual-pages/ja/man9/accf_http.9
.\"
.\" Copyright (c) 2000 Alfred Perlstein
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/accf_http.9,v 1.10 2002/12/24 13:41:46 ru Exp %
.\" $FreeBSD$
.\" "
.Dd November 15, 2000
.Os
.Dt ACCF_HTTP 9
.Sh 名称
.Nm accf_http
.Nd ある完全な HTTP リクエストの到着までの間の入力接続バッファ
.Sh 書式
.Nm options INET
.Nm options ACCEPT_FILTER_HTTP
.Nm kldload accf_http
.Sh 解説
これは HTTP 入力接続を受け取るために
.Fn accept
が使用されるソケット上に配置されるためのフィルタです。
.Pp
これは完全な HTTP/1.0 または HTTP/1.1 の HEAD または GET リクエストが
カーネルによってバッファされるまでの間に、アプリケーションが
.Fn accept
を介して接続された記述子を受け取ることを防止します。
.Pp
HTTP/1.0 または HTTP/1.1 の HEAD または GET リクエスト以外の何かが
受け取られた場合には、カーネルはアプリケーションが
.Fn accept
を介して接続記述子を受け取ることを可能にします。
.Pp
.Nm
の効用は、サーバがそのリクエストの初期の文法解析を実行する前に
コンテキストの切り替えを何回か行なう必要が無いようにすることです。
Apache のようなサーバのフォーク前のアクティブプロセス数を低く抑え、
.Fn select ,
.Fn poll
または
.Fn kevent
のようなインタフェースによって管理されることが必要なファイル記述子の組の
大きさを減少させることによって、
入力リクエストのために必要な CPU 利用を効果的に減少させます。
.Pp
カーネルの中に INET オプションが既にコンパイルされている場合には、
.Nm
カーネルオプションは
.Xr kldload 8
を介して実行時に有効化することができるモジュールもあります。
.Sh 使用例
ACCEPT_FILTER_HTTP がカーネルコンフィグファイルに含まれているか、
.Nm
モジュールがロードされていると仮定して、これはソケット
.Fa sok
上の http accept フィルタを有効化します。
.Bd -literal -offset 0i
	struct accept_filter_arg afa;

	bzero(&afa, sizeof(afa));
	strcpy(afa.af_name, "httpready");
	setsockopt(sok, SOL_SOCKET, SO_ACCEPTFILTER, &afa, sizeof(afa));
.Ed
.Sh 関連項目
.Xr setsockopt 2 ,
.Xr accept_filter 9
.Sh 歴史
accept フィルタ機構および accf_http フィルタは
.Fx 4.0
で導入されました。
.Sh 作者
このマニュアルページおよびこのフィルタは
.An Alfred Perlstein
が書きました。
