freebsd/freebsd-doc/documentation/manual-pages/ja/man9/bus_release_resource.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2000 Alexander Langer
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/bus_release_resource.9,v 1.9 2004/07/03 18:29:23 ru Exp %
.\"
.\" $FreeBSD$
.Dd May 18, 2000
.Dt BUS_RELEASE_RESOURCE 9
.Os
.Sh 名称
.Nm bus_release_resource
.Nd バス上の資源の解放
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Pp
.In machine/bus.h
.In sys/rman.h
.In machine/resource.h
.Ft int
.Fn bus_release_resource "device_t dev" "int type" "int rid" "struct resource *r"
.Sh 解説
.Xr bus_alloc_resource 9
によって割り当てられた資源を解放します。
その資源は解放時に使用中であってはなりません。
すなわち、適切な関数 (IRQ のための
.Xr bus_teardown_intr 9
など) を事前に呼び出してください。
.Bl -item
.It
.Fa dev
は、資源を所有しているデバイスです。
.It
.Fa type
は、解放される資源の型です。
以前に割り当てた時と同一の型でなければなりません。
有効な型については
.Xr bus_alloc_resource 9
を参照してください。
.It
.Fa rid
は、資源の資源識別子です。
.Fa rid
は
.Xr bus_alloc_resource 9
によって返された識別子と同一でなければなりません。
.It
.Fa r
は
.Va struct resource
構造体へのポインタで、すなわち
.Xr bus_alloc_resource 9
によって返された資源そのものです。
.El
.Sh 戻り値
デバイス
.Fa dev
が親を持たない場合には
.Er EINVAL
が返され、そうでない場合には
.Dv 0
が返されます。
資源を解放できない場合には、カーネルはパニックするでしょう。
.Sh 使用例
.Bd -literal
	/* IRQ の不活性化 */
	bus_teardown_intr(dev, foosoftc->irqres, foosoftc->irqid);

	/* IRQ 資源の解放 */
	bus_release_resource(dev, SYS_RES_IRQ, foosoftc->irqid,
		foosoftc->irqres);

	/* 入出力ポートの資源の解放 */
	bus_release_resource(dev, SYS_RES_IOPORT, foosoftc->portid,
		foosoftc->portres);
.Ed
.Sh 関連項目
.Xr bus_alloc_resource 9 ,
.Xr device 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Alexander Langer Aq alex@big.endian.de
が書きました。
