freebsd/freebsd-doc/documentation/manual-pages/ja/man9/bus_child_present.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2003 M. Warner Losh
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/bus_child_present.9,v 1.3 2004/06/21 14:11:45 mpp Exp %
.\"
.\" $FreeBSD$
.Dd March 27, 2003
.Dt BUS_CHILD_PRESENT 9
.Os
.Sh 名称
.Nm bus_child_present
.Nd バスドライバへのデバイスが実際に存在しているかどうかの確認の問い合わせ
.Sh 書式
.In sys/param.h
.In sys/bus.h
.Pp
.In machine/bus.h
.In sys/rman.h
.In machine/resource.h
.Ft int
.Fn bus_child_present "device_t dev"
.Sh 解説
.Fn bus_child_present
関数は、
.Fa dev
の親デバイスドライバに対し、
.Fa dev
で記述されるハードウェアが現時点でいまだに物理的にアクセス可能であるか
どうかをチェックすることを要求します。
利用可能の概念はバス毎に異なりますが、
一般的には利用できないハードウェアとは、利用できるときには
.Fn bus_space*
メソッドを介してアクセスできるものが、
.Fn bus_space*
メソッドを介してアクセスできないものを指します。
.Pp
これは
.Dq このデバイスは子デバイスを持っていますか?
という質問を尋ねません。
この質問は
.Xr device_get_children 9
によってより良く回答されることが可能です。
.Sh 戻り値
0 の戻り値はシステム内にそのデバイスが存在しないことを示します。
0 ではない戻り値はシステム内にそのデバイスが存在すること、または
そのデバイスの状態が決定できないことを示します。
.Sh 使用例
これはあるサンプルコードです。
.Xr dc 4
デバイスが実際に存在する時に、stop を呼び出すだけです。
.Bd -literal -offset indent
device_t dev;
dc_softc *sc;

sc = device_get_softc(dev);
if (bus_child_present(dev))
	dc_stop(sc);
.Ed
.Sh 関連項目
.Xr device 9 ,
.Xr driver 9
.Sh 作者
このマニュアルページは
.An Warner Losh Aq imp@FreeBSD.org
が書きました。
