freebsd/freebsd-doc/documentation/manual-pages/ja/man9/DECLARE_MODULE.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 2000 Alexander Langer
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/DECLARE_MODULE.9,v 1.7.4.2 2005/01/13 13:45:52 keramida Exp %
.\" $FreeBSD$
.\"
.Dd January 6, 2005
.Dt DECLARE_MODULE 9
.Os
.Sh 名称
.Nm DECLARE_MODULE
.Nd カーネルモジュール宣言マクロ
.Sh 書式
.In sys/param.h
.In sys/kernel.h
.In sys/module.h
.Fn DECLARE_MODULE "name" "moduledata_t data" "sub" "order"
.Sh 解説
.Fn DECLARE_MODULE
マクロは一般的なカーネルモジュールを宣言します。
これは
.Fn SYSINIT
マクロを使用して、そのモジュールをシステムに登録します。
.Fn DECLARE_MODULE
は通常、
.Xr DRIVER_MODULE 9 ,
.Xr DEV_MODULE 9
および
.Xr SYSCALL_MODULE 9
のような他のマクロの中で使用されます。
もちろん、例えば動的な sysctl を実装するために、
直接呼び出されることも可能です。
.Pp
引数は以下のとおりです。
.Bl -tag -width indent
.It Fa name
モジュールを識別するために
.Fn SYSINIT
呼び出しで使用されるモジュールの名前です。
.It Fa data
.Vt module_t
構造体の中で使用されるモジュール名の正式名称および型
.Vt modeventhand_t
のイベントハンドラ関数へのポインタの 2 つの主要な要素を含む
.Vt moduledata_t
構造体です。
.It Fa sub
.Fn SYSINIT
マクロへの直接の引数です。
このための有効な値は
.Vt sysinit_sub_id
列挙型に
.In ( sys/kernel.h
を参照) 含まれていて、システムスタートアップインタフェースの型を明示します。
例えば
.Xr DRIVER_MODULE 9
マクロは、これらのモジュールがデバイスのためのドライバを含んでいるので、
ここで
.Dv SI_SUB_DRIVERS
の値を使用します。
実行時にロードされるカーネルモジュールでは、
.Dv SI_SUB_EXEC
の値は共通です。
.It Fa order
.Fn SYSINIT
のための引数です。
これは KLD のサブシステム内の初期化の順序を意味します。
有効な値は
.Vt sysinit_elem_order
列挙型
.Pq In sys/kernel.h
で定義されています。
.El
.Sh 関連項目
.Xr DEV_MODULE 9 ,
.Xr DRIVER_MODULE 9 ,
.Xr module 9 ,
.Xr SYSCALL_MODULE 9
.Pp
.Pa /usr/include/sys/kernel.h ,
.Pa /usr/share/examples/kld
.Sh 作者
.An -nosplit
このマニュアルページは
.An Andrew Reiter Aq arr@watson.org
によって書かれた
KLD Facility Programming Tutorial に触発されて、
.An Alexander Langer Aq alex@FreeBSD.org
によって書かれました。
