freebsd/freebsd-doc/documentation/manual-pages/ja/man9/devsw.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/devsw.9,v 1.6 2001/12/26 23:14:04 davidc Exp %
.\"
.\" $FreeBSD$
.Dd July 9, 2001
.Dt DEVSW 9
.Os
.Sh 名称
.Nm devsw
.Nd
.Vt cdevsw
構造体の取得
.Sh 書式
.In sys/param.h
.In sys/conf.h
.Ft "struct cdevsw *"
.Fn devsw "dev_t dev"
.Sh 解説
.Fn devsw
関数はこの文字型デバイス ID に関連付けられた
.Vt cdevsw
構造体へのポインタを返します。
.Fa dev->si_cdevsw
が設定されている場合にはそれが返され、そうでない場合には
.Va cdevsw
配列へ
.Xr major 9
値分オフセットさせたものが返されます。
.Pp
引数は以下の通りです。
.Bl -tag -width ".Fa dev"
.It Fa dev
返されるべき
.Vt cdevsw
エントリのデバイスです。
.El
.Sh 戻り値
.Vt cdevsw
構造体へのポインタです。
.Sh 関連項目
.Xr major 9 ,
.Xr minor 9 ,
.Xr umajor 9 ,
.Xr uminor 9
.Sh 作者
このマニュアルページは
.An Chad David Aq davidc@acns.ab.ca
が書きました。
