freebsd/freebsd-doc/documentation/manual-pages/ja/man9/pseudofs.9
.\"-
.\" Copyright (c) 2001 Dag-Erling Coidan Smorgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/pseudofs.9,v 1.5 2004/07/03 18:29:24 ru Exp %
.\"
.\" $FreeBSD$
.Dd September 30, 2001
.Dt PSEUDOFS 9
.Os
.Sh 名称
.Nm pseudofs
.Nd 疑似ファイルシステム構築キット
.Sh 書式
.In fs/pseudofs/pseudofs.h
.\" ここに使用例を挿入する
.Sh 解説
.Nm
モジュールは
.Xr procfs 5
および
.Xr linprocfs 5
のような疑似ファイルシステムのための抽象 API を提供します。
これは VFS システムとのインタフェース、アクセス制御の強制、ファイル数の
追跡の維持、およびプロセス特有のファイルとディレクトリの複製、
のような全ての複雑な事柄の面倒をみます。
コンシューマモジュール、すなわちファイルシステムの実際の中心部を
実装するモジュールは、(宣言された構造体の集合によって記述され、
.Nm
によって提供されるマクロによって初期化された) ディレクトリ構造および、
ファイルの属性の報告または sbuf にファイルの内容を
実際に書き込むコールバックだけを、提供する必要があります。
.\" ここにより多くの情報を挿入する
.Sh 関連項目
.Xr linprocfs 5 ,
.Xr procfs 5 ,
.Xr sbuf 9 ,
.Xr vnode 9
.Sh 歴史
.Nm
モジュールは
.Fx 5.0
で登場しました。
.Sh 作者
.Nm
モジュールとこのマニュアルページは
.An Dag-Erling Sm\(/orgrav
が書きました。
