freebsd/freebsd-doc/documentation/manual-pages/ja/man9/VFS_SET.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VFS_SET.9,v 1.7.4.1 2005/01/10 23:47:20 keramida Exp %
.\"
.\" $FreeBSD$
.Dd December 2, 2001
.Dt VFS_SET 9
.Os
.Sh 名称
.Nm VFS_SET
.Nd ローダブルファイルシステム
.Vt vfsconf
のセットアップ
.Sh 書式
.In sys/param.h
.In sys/kernel.h
.In sys/module.h
.In sys/mount.h
.Ft void
.Fn VFS_SET "struct vfsops *vfsops" "fsname" "int flags"
.Sh 解説
.Fn VFS_SET
はローダブルモジュールのために与えられた
.Fa vfsops , fsname
および
.Fa flags
で
.Vt vfsconf
構造体を作成し、イベントハンドラとして
.Fn vfs_modevent
を使用して
.Xr DECLARE_MODULE 9
の呼び出しによって宣言します。
.Pp
.Fa flags
引数のために利用可能な値は以下のとおりです:
.Bl -hang -width ".Dv VFCF_SYNTHETIC"
.It Dv VFCF_STATIC
ファイルシステムはカーネル内で静的に利用可能であるべきです。
.It Dv VFCF_NETWORK
ネットワークにエクスポート可能なファイルシステムです。
.It Dv VFCF_READONLY
書き込み操作がサポートされていません。
.It Dv VFCF_SYNTHETIC
疑似ファイルシステムであり、データはディスク上のファイルを表現していません。
.It Dv VFCF_LOOPBACK
ループバックファイルシステムレイヤです。
.It Dv VFCF_UNICODE
ファイル名は Unicode として格納されます。
.El
.Sh 疑似コード
.Bd -literal
/*
 * 使用するものを記述し、残りは vfs_std を使用します。
 */
static struct vfsops myfs_vfsops = {
        myfs_mount,
        vfs_stdstart,
        myfs_unmount,
        myfs_root,
        vfs_stdquotactl,
        myfs_statfs,
        vfs_stdsync,
        vfs_stdvget,
        vfs_stdfhtovp,
        vfs_stdcheckexp,
        vfs_stdvptofh,
        vfs_stdinit,
        vfs_stduninit,
        vfs_stdextattrctl,
};

VFS_SET(myfs_vfsops, skelfs, 0);
.Ed
.Sh 関連項目
.Xr DECLARE_MODULE 9 ,
.Xr vfsconf 9 ,
.Xr vfs_modevent 9
.Sh 作者
このマニュアルページは
.An Chad David Aq davidc@acns.ab.ca
によって書かれました。
