freebsd/freebsd-doc/documentation/manual-pages/ja/man9/VOP_SETACL.9
.\"-
.\" Copyright (c) 1999, 2000, 2001 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man9/VOP_SETACL.9,v 1.11 2003/10/23 02:11:14 hmp Exp %
.\"
.\" $FreeBSD$
.Dd December 23, 1999
.Os
.Dt VOP_SETACL 9
.Sh 名称
.Nm VOP_SETACL
.Nd vnode のアクセス制御リストの設定
.Sh 書式
.In sys/param.h
.In sys/vnode.h
.In sys/acl.h
.Ft int
.Fn VOP_SETACL "struct vnode *vp" "acl_type_t type" "struct acl *aclp" "struct ucred *cred" "struct thread *td"
.Sh 解説
この vnode 呼び出しは、ファイルまたはディレクトリの
アクセス制御リスト (ACL) を設定するために使用可能です。
.Pp
引数は以下の通りです。
.Bl -tag -width type
.It Fa vp
ファイルまたはディレクトリの vnode。
.It Fa type
設定される ACL の型。
.It Fa aclp
ACL データの取り出し元の ACL 構造体へのポインタ。
.It Fa cred
要求の認証時に使用されるユーザ証明。
.It Fa td
ACL を設定しているスレッド。
.El
.Pp
.Fa aclp
ポインタは、
.Dv NULL
を指定可能であり、
指定した ACL が削除されるべきであることを示します。
.Pp
.Fa cred
ポインタは、NULL を渡すことができ、
可能であるならばアクセス制御チェックが実行されないことを指示します。
この cred の設定は、アクティブプロセスに許されていない ACL 証明を、
カーネルが正当化することを認めるために使用可能です。
この cred の設定は、アクティブプロセスに許されていない拡張属性の変更を
カーネルが正当化することを認めるために使用可能です。
.Pp
vnode ACL インタフェースは、ファイルまたはディレクトリの ACL インタフェースの
セマンティクスではなく文法を定義します。
カーネル内の ACL 管理についての詳細な情報は
.Xr acl 9
を参照してください。
.Sh ロック
入る時に vnode はロックされ、戻り時にもロックされ続けているべきです。
.Sh 戻り値
ACL が成功裏に設定された場合には 0 が返されます。
そうでない場合には適切なエラーコードが返されます。
.Sh エラー
.Bl -tag -width Er
.It Bq Er EINVAL
渡された ACL 型はこの vnode には無効です。
または、ACL データが無効です。
.It Bq Er EACCES
呼び出し側が適切な特権を持っていません。
.It Bq Er ENOMEM
要求を実行するための十分なメモリが利用可能ではありません。
.It Bq Er EOPNOTSUPP
ファイルシステムが
.Fn VOP_SETACL
をサポートしていません。
.It Bq Er ENOSPC
ファイルシステムの領域不足です。
.It Bq Er EROFS
ファイルシステムが読み取り専用です。
.El
.Sh 関連項目
.Xr acl 9 ,
.Xr vnode 9 ,
.Xr VOP_ACLCHECK 9 ,
.Xr VOP_GETACL 9
.Sh 作者
このマニュアルページは
.An Robert Watson
が書きました。
