Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/gjournal-desktop/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: Implementing UFS Journaling on a Desktop PC
pt_br: Implementando o UFS Journaling em um Desktop PC

source: $FreeBSD: head/en_US.ISO8859-1/articles/gjournal-desktop/article.xml 51348 2017-12-30 22:56:56Z eadler $
pt_br: $FreeBSD$

source: A journaling file system uses a log to record all transactions that take place in the file system, and preserves its integrity in the event of a system crash or power failure. Although it is still possible to lose unsaved changes to files, journaling almost completely eliminates the possibility of file system corruption caused by an unclean shutdown. It also shortens to a minimum the time required for after-failure file system checking. Although the UFS file system employed by FreeBSD does not implement journaling itself, the new journal class of the GEOM framework in FreeBSD 7.<replaceable>X</replaceable> can be used to provide file system independent journaling. This article explains how to implement UFS journaling on a typical desktop PC scenario.
pt_br: Um sistema de arquivos com journaling usa um log para registrar todas as transações que ocorrem no sistema de arquivos e preserva sua integridade em caso de falha do sistema ou falta de energia. Embora ainda seja possível perder as alterações não salvas nos arquivos, o journaling elimina quase completamente a possibilidade de corrupção do sistema de arquivos causada por um desligamento abrupto. Ele também reduz ao mínimo o tempo necessário para a verificação do sistema de arquivos após a falha. Embora o sistema de arquivos UFS empregado pelo FreeBSD não implemente o journaling em si, a nova classe de journal do framework GEOM no FreeBSD 7.<replaceable>X</replaceable> pode ser usada para fornecer journaling independente do sistema de arquivos. Este artigo explica como implementar o UFS journaling em um cenário típico de PC de mesa.

source: Introduction
pt_br: Introdução

source: While professional servers are usually well protected from unforeseen shutdowns, the typical desktop is at the mercy of power failures, accidental resets, and other user related incidents that can lead to unclean shutdowns. Soft Updates usually protect the file system efficiently in such cases, although most of the times a lengthy background check is required. On rare occasions, file system corruption reaches a point where user intervention is required and data may be lost.
pt_br: Embora os servidores profissionais estejam geralmente bem protegidos contra desligamentos imprevistos, um desktop típico fica à mercê de falhas de energia, reinicializações acidentais e outros incidentes relacionados ao usuário que podem levar a paradas abruptas. Os soft updates costumam proteger o sistema de arquivos de maneira eficiente nestes casos, embora na maioria das vezes seja necessária uma longa verificação em background. Em raras ocasiões, a corrupção do sistema de arquivos atinge um ponto em que a intervenção do usuário é necessária e os dados podem ser perdidos.

source: The new journaling capability provided by GEOM can greatly assist in such scenarios, by virtually eliminating the time required for file system checking, and ensuring that the file system is quickly restored to a consistent state.
pt_br: O novo recurso de journaling fornecido pela GEOM pode ajudar bastante nesses cenários, praticamente eliminando o tempo necessário para a verificação do sistema de arquivos e garantindo que o sistema de arquivos seja rapidamente restaurado para um estado consistente.

source: This article describes a procedure for implementing UFS journaling on a typical desktop PC scenario (one hard disk used for both operating system and data). It should be followed during a fresh installation of FreeBSD. The steps are simple enough and do not require overly complex interaction with the command line.
pt_br: Este artigo descreve um procedimento para implementar o journaling do UFS em um cenário típico de PC de mesa (um único disco rígido usado para o sistema operacional e para os dados). Deve ser seguido durante uma nova instalação do FreeBSD. As etapas são simples o suficiente e não requerem interação excessivamente complexa com a linha de comando.

source: After reading this article, you will know:
pt_br: Depois de ler este artigo, você saberá:

source: How to reserve space for journaling during a new installation of FreeBSD.
pt_br: Como reservar espaço para o journaling durante uma nova instalação do FreeBSD.

source: How to load and enable the <literal>geom_journal</literal> module (or build support for it in your custom kernel).
pt_br: Como carregar e ativar o módulo <literal>geom_journal</literal> (ou como compilar o suporte para ele em seu kernel customizado).

source: How to convert your existing file systems to utilize journaling, and what options to use in <filename>/etc/fstab</filename> to mount them.
pt_br: Como converter seus sistemas de arquivos existentes para utilizar o journaling e quais opções usar em <filename>/etc/fstab</filename> para montá-los.

source: How to implement journaling in new (empty) partitions.
pt_br: Como implementar o journaling em novas partições (vazias).

source: How to troubleshoot common problems associated with journaling.
pt_br: Como solucionar problemas comuns associados ao journaling.

source: Before reading this article, you should be able to:
pt_br: Antes de ler este artigo, você deve ser capaz de:

source: Understand basic <trademark class="registered">UNIX</trademark> and FreeBSD concepts.
pt_br: Entender os conceitos básicos do <trademark class="registered">UNIX</trademark> e do FreeBSD.

source: Be familiar with the installation procedure of FreeBSD and the <application>sysinstall</application> utility.
pt_br: Estar familiarizado com o procedimento de instalação do FreeBSD e com o utilitário <application>sysinstall</application>.

source: The procedure described here is intended for preparing a new installation where no actual user data is stored on the disk yet. While it is possible to modify and extend this procedure for systems already in production, you should <emphasis>backup</emphasis> all important data before doing so. Messing around with disks and partitions at a low level can lead to fatal mistakes and data loss.
pt_br: O procedimento descrito aqui é destinado a preparar uma nova instalação na qual ainda não temos nenhum dado real do usuário é armazenado no disco. Embora seja possível modificar e estender este procedimento para sistemas já em produção, você deve efetuar o <emphasis>backup</emphasis> de todos os dados importantes antes de fazer isso. Mexer com discos e partições em um baixo nível pode levar a erros fatais e a perda de dados.

source: Understanding Journaling in FreeBSD
pt_br: Compreendendo o journaling no FreeBSD

source: The journaling provided by GEOM in FreeBSD 7.<replaceable>X</replaceable> is not file system specific (unlike for example the ext3 file system in <trademark class="registered">Linux</trademark>) but is functioning at the block level. Though this means it can be applied to different file systems, for FreeBSD 7.0-RELEASE, it can only be used on UFS2.
pt_br: O journaling fornecido pelo GEOM no FreeBSD 7.<replaceable>X</replaceable> não é específico do sistema de arquivos (diferentemente do sistema de arquivos ext3 no <trademark class="registered">Linux</trademark>), funcionando a nível de bloco. Embora isso signifique que ele possa ser aplicado a sistemas de arquivos diferentes, no FreeBSD 7.0-RELEASE, ele só pode ser usado com o UFS2.

source: This functionality is provided by loading the <filename>geom_journal.ko</filename> module into the kernel (or building it into a custom kernel) and using the <command>gjournal</command> command to configure the file systems. In general, you would like to journal large file systems, like <filename>/usr</filename>. You will need however (see the following section) to reserve some free disk space.
pt_br: Esta funcionalidade é fornecida pelo carregamento do módulo <filename>geom_journal.ko</filename> no kernel (ou através da compilação de um kernel personalizado) e pelo uso do comando <command>gjournal</command> para configurar os sistemas de arquivos. Em geral, você gostaria de utilizar o journal em grandes sistemas de arquivos, como o <filename>/usr</filename>. Você precisará no entanto (veja a seção seguinte) reservar algum espaço livre em disco para isso.

source: When a file system is journaled, some disk space is needed to keep the journal itself. The disk space that holds the actual data is referred to as the <emphasis>data provider</emphasis>, while the one that holds the journal is referred to as the <emphasis>journal provider</emphasis>. The data and journal providers need to be on different partitions when journaling an existing (non-empty) partition. When journaling a new partition, you have the option to use a single provider for both data and journal. In any case, the <command>gjournal</command> command combines both providers to create the final journaled file system. For example:
pt_br: Quando um sistema de arquivos é "journaled", é necessário algum espaço em disco para manter o próprio journal. O espaço em disco que contém os dados reais é chamado de <emphasis>data provider</emphasis>, enquanto o que contém o journal é chamado de <emphasis>journal provider</emphasis>. Os provedores de dados e de journal precisam estar em partições diferentes ao fazer o journaling de uma partição existente (não vazia). Ao fazer o journaling de uma nova partição, você tem a opção de usar um único provedor para os dados e o journal. Em todo caso, o comando <command>gjournal</command> combina os dois provedores para criar o sistema de arquivos journaled final. Por exemplo:

source: You wish to journal your <filename>/usr</filename> file system, stored in <filename>/dev/ad0s1f</filename> (which already contains data).
pt_br: Você deseja fazer o journaling do seu sistema de arquivos <filename>/usr</filename>, armazenado em <filename>/dev/ad0s1f</filename> (que já contém dados).

source: You reserved some free disk space in a partition in <filename>/dev/ad0s1g</filename>.
pt_br: Você reservou algum espaço livre no disco, na partição <filename>/dev/ad0s1g</filename>.

source: Using <command>gjournal</command>, a new <filename>/dev/ad0s1f.journal</filename> device is created where <filename>/dev/ad0s1f</filename> is the data provider, and <filename>/dev/ad0s1g</filename> is the journal provider. This new device is then used for all subsequent file operations.
pt_br: Usando o comando <command>gjournal</command>, um novo dispositivo <filename>/dev/ad0s1f.journal</filename> é criado no qual o <filename>/dev/ad0s1f</filename> é o data provider, e o <filename>/dev/ad0s1g</filename> é o journal provider. Este novo dispositivo é então usado para todas as operações de arquivo posteriores.

source: The amount of disk space you need to reserve for the journal provider depends on the usage load of the file system and not on the size of the data provider. For example on a typical office desktop, a 1 GB journal provider for the <filename>/usr</filename> file system will suffice, while a machine that deals with heavy disk I/O (i.e. video editing) may need more. A kernel panic will occur if the journal space is exhausted before it has a chance to be committed.
pt_br: A quantidade de espaço em disco que você precisa reservar para o journal provider depende da carga de uso do sistema de arquivos e não do tamanho do data provider. Por exemplo, em um desktop típico de escritório, um journal provider de 1 GB para o sistema de arquivos <filename>/usr</filename> será suficiente, enquanto uma máquina que lida com I/O de disco pesado (por exemplo, edição de vídeo) pode precisar de mais. Um kernel panic ocorrerá se o espaço do journal estiver esgotado antes de ter a chance de ser committed.

source: The journal sizes suggested here, are highly unlikely to cause problems in typical desktop use (such as web browsing, word processing and playback of media files). If your workload includes intense disk activity, use the following rule for maximum reliability: Your RAM size should fit in 30% of the journal provider's space. For example, if your system has 1 GB RAM, create an approximately 3.3 GB journal provider. (Multiply your RAM size with 3.3 to obtain the size of the journal).
pt_br: É improvável que os tamanhos de journal sugeridos aqui causem problemas no uso típico de um desktop (como navegação na Web, processamento de texto e reprodução de arquivos de mídia). Se sua carga de trabalho incluir intensa atividade de disco, use a regra a seguir para obter a confiabilidade máxima: o tamanho da RAM deve caber em 30% do espaço do journal provider. Por exemplo, se o seu sistema tiver 1 GB de RAM, crie um journal provider de aproximadamente 3,3 GB. (Multiplique o tamanho total da sua RAM por 3.3 para obter o tamanho do journal).

source: For more information about journaling, please read the manual page of <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: Para mais informações sobre journaling, leia a página de manual do <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Steps During the Installation of FreeBSD
pt_br: Etapas durante a instalação do FreeBSD

source: Reserving Space for Journaling
pt_br: Reservando espaço para o journaling

source: A typical desktop machine usually has one hard disk that stores both the OS and user data. Arguably, the default partitioning scheme selected by <application>sysinstall</application> is more or less suitable: A desktop machine does not need a large <filename>/var</filename> partition, while <filename>/usr</filename> is allocated the bulk of the disk space, since user data and a lot of packages are installed into its subdirectories.
pt_br: Normalmente, um desktop típico tem um disco rígido que armazena o sistema operacional e os dados do usuário. Indiscutivelmente, o esquema de particionamento padrão selecionado pelo <application>sysinstall</application> é mais ou menos adequado: Um desktop não precisa de uma grande partição <filename>/var</filename>, enquanto o <filename>/usr</filename> é alocado com a maior parte do espaço em disco, já que os dados do usuário e muitos pacotes são instalados em seus subdiretórios.

source: The default partitioning (the one obtained by pressing <keycap>A</keycap> at the FreeBSD partition editor, called <application>Disklabel</application>) does not leave any unallocated space. Each partition that will be journaled, requires another partition for the journal. Since the <filename>/usr</filename> partition is the largest, it makes sense to shrink this partition slightly, to obtain the space required for journaling.
pt_br: O particionamento padrão (aquele obtido pressionando <keycap>A</keycap> no editor de partições do FreeBSD, chamado <application>Disklabel</application>) não deixa nenhum espaço não alocado. Cada partição que será journaled, requer outra partição para journal. Como a partição <filename>/usr </filename> é a maior, faz sentido reduzir ligeiramente essa partição, para obter o espaço necessário para o journaling.

source: In our example, an 80 GB disk is used. The following screenshot shows the default partitions created by <application>Disklabel</application> during installation:
pt_br: No nosso exemplo, um disco de 80 GB é usado. A captura de tela a seguir mostra as partições padrões criadas por <application>Disklabel</application> durante a instalação:

# _
source: external ref='disklabel1' md5='__failed__'
pt_br: ref externo = 'disklabel1' md5 = '__ failed__'

source: If this is more or less what you need, it is very easy to adjust for journaling. Simply use the arrow keys to move the highlight to the <filename>/usr</filename> partition and press <keycap>D</keycap> to delete it.
pt_br: Se isso é mais ou menos o que você precisa, é muito fácil se ajustar ao journaling. Simplesmente use as teclas de seta para mover o realce para a partição <filename>/usr</filename> e pressione <keycap>D</keycap> para excluí-la.

source: Now, move the highlight to the disk name at the top of the screen and press <keycap>C</keycap> to create a new partition for <filename>/usr</filename>. This new partition should be smaller by 1 GB (if you intend to journal <filename>/usr</filename> only), or 2 GB (if you intend to journal both <filename>/usr</filename> and <filename>/var</filename>). From the pop-up that appears, opt to create a file system, and type <filename>/usr</filename> as the mount point.
pt_br: Agora, mova o realce para o nome do disco na parte superior da tela e pressione <keycap>C</keycap> para criar uma nova partição para <filename>/usr</filename>. Esta nova partição deve ser menor em 1 GB (se você pretende registrar apenas <filename>/usr</filename>), ou 2 GB (se você pretende registrar ambos <filename>/usr</filename> e <filename>/var</filename>). No pop-up exibido, opte por criar um sistema de arquivos e digite <filename>/usr</filename> como o ponto de montagem.

source: Should you journal the <filename>/var</filename> partition? Normally, journaling makes sense on quite large partitions. You may decide not to journal <filename>/var</filename>, although doing so on a typical desktop will cause no harm. If the file system is lightly used (quite probable for a desktop) you may wish to allocate less disk space for its journal.
pt_br: Você deve fazer o journal da partição <filename>/var</filename>? Normalmente, o journaling faz sentido em partições grandes. Você pode decidir não fazer o journal do <filename>/var</filename>, embora fazê-lo em um desktop típico não cause nenhum dano. Se o sistema de arquivos é usado levemente (bastante provável para um desktop) você pode querer alocar menos espaço em disco para o seu journal.

source: In our example, we journal both <filename>/usr</filename> and <filename>/var</filename>. You may of course adjust the procedure to your own needs.
pt_br: Em nosso exemplo, nós fizemos o journal em ambos <filename>/usr</filename> e <filename>/var</filename>. Você pode, naturalmente, ajustar o procedimento às suas próprias necessidades.

source: To keep things as easy going as possible, we are going to use <application>sysinstall</application> to create the partitions required for journaling. However, during installation, <application>sysinstall</application> insists on asking a mount point for each partition you create. At this point, you do not have any mount points for the partitions that will hold the journals, and in reality you <emphasis>do not even need them</emphasis>. These are not partitions that we are ever going to mount somewhere.
pt_br: Para manter as coisas o mais fáceis o possível, vamos usar o <application>sysinstall</application> para criar as partições necessárias para o journaling. No entanto, durante a instalação, o <application>sysinstall</application> insiste em pedir um ponto de montagem para cada partição criada. Neste ponto, você não tem nenhum ponto de montagem para as partições que irão manter os journals, e na realidade você <emphasis>nem precisa deles</emphasis>. Estas não são partições que iremos montar em algum lugar.

source: To avoid these problems with <application>sysinstall</application>, we are going to create the journal partitions as swap space. Swap is never mounted, and <application>sysinstall</application> has no problem creating as many swap partitions as needed. After the first reboot, <filename>/etc/fstab</filename> will have to be edited, and the extra swap space entries removed.
pt_br: Para evitar esses problemas com o <application>sysinstall</application>, vamos criar as partições de journal como espaço de troca. O swap nunca é montado, e o <application>sysinstall</application> não tem problemas para criar tantas partições de troca quantas forem necessárias. Após a primeira reinicialização, o <filename>/etc/fstab</filename> terá que ser editado, e as entradas extras do espaço de troca serão removidas.

source: To create the swap, again use the arrow keys to move the highlight to the top of <application>Disklabel</application> screen, so that the disk name itself is highlighted. Then press <keycap>N</keycap>, enter the desired size (<replaceable>1024M</replaceable>), and select <quote>swap space</quote> from the pop-up menu that appears. Repeat for every journal you wish to create. In our example, we create two partitions to provide for the journals of <filename>/usr</filename> and <filename>/var</filename>. The final result is shown in the following screenshot:
pt_br: Para criar o swap, use novamente as teclas de seta para mover o realce para a parte superior da tela do <application>Disklabel</application>, para que o nome do disco seja realçado. Em seguida, pressione <keycap>N</keycap>, insira o tamanho desejado (<replaceable>1024M</replaceable>) e selecione <quote>swap space</quote> no menu pop-up exibido. Repita para cada journal que você deseja criar. Em nosso exemplo, criamos duas partições para fornecer os diários de <filename>/usr</filename> e <filename>/var</filename>. O resultado final é mostrado na seguinte captura de tela:

# _
source: external ref='disklabel2' md5='__failed__'
pt_br: ref externo = 'disklabel2' md5 = '__ failed__'

source: When you have completed creating the partitions, we suggest you write down the partition names, and mount points, so you can easily refer to this information during the configuration phase. This will help alleviate mistakes that may damage your installation. The following table shows our notes for the sample configuration:
pt_br: Quando tiver concluído a criação das partições, sugerimos que você anote os nomes das partições e os pontos de montagem, para que possa consultar facilmente essas informações durante a fase de configuração. Isso ajudará a reduzir os erros que podem danificar sua instalação. A tabela a seguir mostra nossas anotações para a configuração de exemplo:

source: Partitions and Journals
pt_br: Partições e Journals

source: Partition
pt_br: Partições

source: Mount Point
pt_br: Ponto de montagem

source: Continue the installation as you would normally do. We would however suggest you postpone installation of third party software (packages) until you have completely setup journaling.
pt_br: Continue a instalação como faria normalmente. No entanto, sugerimos que você adie a instalação de softwares de terceiros (pacotes) até que você configure completamente o journaling.

source: Booting for the first time
pt_br: Inicializando pela primeira vez

source: Your system will come up normally, but you will need to edit <filename>/etc/fstab</filename> and remove the extra swap partitions you created for the journals. Normally, the swap partition you will actually use is the one with the <quote>b</quote> suffix (i.e. ad0s1b in our example). Remove all other swap space entries and reboot so that FreeBSD will stop using them.
pt_br: Seu sistema irá iniciar normalmente, mas você precisará editar o <filename>/etc/fstab</filename> para remover as partições extras de swap que você criou para os journals. Normalmente, a partição swap que você irá usar é aquela com o sufixo <quote>b</quote> (por exemplo, ad0s1b no nosso exemplo). Remova todas as outras entradas de espaço swap e reinicialize para que o FreeBSD pare de usá-las.

source: When the system comes up again, we will be ready to configure journaling.
pt_br: Quando o sistema voltar a funcionar, estaremos prontos para configurar o journaling.

source: Setting Up Journaling
pt_br: Configurando o journaling

source: Executing <command>gjournal</command>
pt_br: Executando o <command>gjournal</command>
