Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/gjournal-desktop/*.po
Languages: pt_br

source: Having prepared all the required partitions, it is quite easy to configure journaling. We will need to switch to single user mode, so login as <systemitem class="username">root</systemitem> and type:
pt_br: Tendo preparado todas as partições requeridas, é bastante fácil configurar o journaling. Nós precisaremos mudar para o modo de single user, então entre como <systemitem class="username">root</systemitem> e digite:

source: Press <keycap>Enter</keycap> to get the default shell. We will need to unmount the partitions that will be journaled, in our example <filename>/usr</filename> and <filename>/var</filename>:
pt_br: Pressione <keycap>Enter</keycap> para obter o shell padrão. Nós precisaremos desmontar as partições que serão registradas no diário, no nosso exemplo <filename>/usr</filename> e <filename>/var</filename>:

source: Load the module required for journaling:
pt_br: Carregue o módulo necessário para o journaling:

source: Now, use your notes to determine which partition will be used for each journal. In our example, <filename>/usr</filename> is <filename>ad0s1f</filename> and its journal will be <filename>ad0s1g</filename>, while <filename>/var</filename> is <filename>ad0s1d</filename> and will be journaled to <filename>ad0s1h</filename>. The following commands are required:
pt_br: Agora, use suas anotações para determinar qual partição será usada para cada diário. Em nosso exemplo, <filename>/usr</filename> é <filename>ad0s1f</filename> e seu journal será <filename>ad0s1g</filename>, enquanto <filename>/var</filename> é <filename>ad0s1d</filename> e será journaled para <filename>ad0s1h</filename>. Os seguintes comandos são necessários:

source: If the last sector of either partition is used, <command>gjournal</command> will return an error. You will have to run the command using the <option>-f</option> flag to force an overwrite, i.e.:
pt_br: Se o último setor de qualquer partição for usado, o <command>gjournal</command> retornará um erro. Você terá que executar o comando usando o sinalizador <option>-f</option> para forçar uma substituição, ou seja:

source: Since this is a new installation, it is highly unlikely that anything will be actually overwritten.
pt_br: Como esta é uma nova instalação, é altamente improvável que qualquer coisa seja realmente sobrescrita.

source: At this point, two new devices are created, namely <filename>ad0s1d.journal</filename> and <filename>ad0s1f.journal</filename>. These represent the <filename>/var</filename> and <filename>/usr</filename> partitions we have to mount. Before mounting, we must however set the journal flag on them and clear the Soft Updates flag:
pt_br: Neste ponto, dois novos dispositivos são criados, a saber <filename>ad0s1d.journal</filename> e <filename>ad0s1f.journal</filename>. Os quais representam as partições <filename>/var</filename> e <filename>/usr</filename> que temos que montar. Antes de montar, devemos definir o flag de Journal e limpar o flag de Soft Updates:

source: Now, mount the new devices manually at their respective places (note that we can now use the <option>async</option> mount option):
pt_br: Agora, monte os novos dispositivos manualmente em seus respectivos locais (note que agora podemos usar a opção de montagem <option>async</option>):

source: Edit <filename>/etc/fstab</filename> and update the entries for <filename>/usr</filename> and <filename>/var</filename>:
pt_br: Edite o <filename>/etc/fstab</filename> e atualize as entradas para <filename>/usr</filename> e <filename>/var</filename>:

source: Make sure the above entries are correct, or you will have trouble starting up normally after you reboot!
pt_br: Certifique-se de que as entradas acima estão corretas ou você terá problemas para inicializar normalmente após o reboot!

source: Finally, edit <filename>/boot/loader.conf</filename> and add the following line so the <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry> module is loaded at every boot:
pt_br: Finalmente, edite o <filename>/boot/loader.conf</filename> e adicione a seguinte linha para que o módulo <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry> seja carregado em cada boot:

source: Congratulations! Your system is now set for journaling. You can either type <userinput>exit</userinput> to return to multi-user mode, or reboot to test your configuration (recommended). During the boot you will see messages like the following:
pt_br: Parabéns! Seu sistema está agora configurado para journaling. Você pode digitar <userinput>exit</userinput> para retornar ao modo multiusuário ou reinicializar para testar sua configuração (recomendado). Durante a inicialização, você verá mensagens como as seguintes:

source: After an unclean shutdown, the messages will vary slightly, i.e.:
pt_br: Após um encerramento não limpo, as mensagens variam ligeiramente, ou seja:

source: This usually means that <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry> used the information in the journal provider to return the file system to a consistent state.
pt_br: Isso geralmente significa que o <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry> usou as informações no journal provider para retornar o sistema de arquivos a um estado consistente.

source: Journaling Newly Created Partitions
pt_br: Fazendo journaling de partições recém-criadas

source: While the above procedure is necessary for journaling partitions that already contain data, journaling an empty partition is somewhat easier, since both the data and the journal provider can be stored in the same partition. For example, assume a new disk was installed, and a new partition <filename>/dev/ad1s1d</filename> was created. Creating the journal would be as simple as:
pt_br: Embora o procedimento acima seja necessário para partições que fazem uso de journaling e que já contêm dados, o journaling de uma partição vazia é um pouco mais fácil, uma vez que os dados e o journal provider podem ser armazenados na mesma partição. Por exemplo, suponha que um novo disco tenha sido instalado e uma nova partição <filename>/dev/ad1s1d</filename> tenha sido criada. Criar o journal seria tão simples quanto:

source: The journal size will be 1 GB by default. You may adjust it by using the <option>-s</option> option. The value can be given in bytes, or appended by <literal>K</literal>, <literal>M</literal> or <literal>G</literal> to denote Kilobytes, Megabytes or Gigabytes respectively. Note that <command>gjournal</command> will not allow you to create unsuitably small journal sizes.
pt_br: O tamanho do journal será 1 GB por padrão. Você pode ajustá-lo usando a opção <option>-s</option>. O valor pode ser dado em bytes, ou acrescentado por <literal>K</literal>, <literal>M</literal> ou <literal>G</literal> para indicar Kilobytes, Megabytes ou Gigabytes, respectivamente. Note que o comando <command>gjournal</command> não permitirá que você crie journals de tamanhos pequenos e inadequados.

source: For example, to create a 2 GB journal, you could use the following command:
pt_br: Por exemplo, para criar um journal de 2 GB, você poderia usar o seguinte comando:

source: You can then create a file system on your new partition, and enable journaling using the <option>-J</option> option:
pt_br: Você pode criar um sistema de arquivos em sua nova partição e ativar o journaling usando a opção <option> -J </option>:

source: Building Journaling into Your Custom Kernel
pt_br: Adicionando suporte ao journaling no seu kernel personalizado

source: If you do not wish to load <literal>geom_journal</literal> as a module, you can build its functions right into your kernel. Edit your custom kernel configuration file, and make sure it includes these two lines:
pt_br: Se você não deseja carregar o <literal>geom_journal</literal> como um módulo, você pode construir suas funções diretamente em seu kernel. Edite seu arquivo de configuração do kernel personalizado e verifique se ele inclui estas duas linhas:

source: Rebuild and reinstall your kernel following the relevant <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig.html">instructions in the FreeBSD Handbook.</link>
pt_br: Recompile e reinstale seu kernel seguindo as instruções <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/kernelconfig.html"> relevantes no Handbook do FreeBSD</link>.

source: Do not forget to remove the relevant <quote>load</quote> entry from <filename>/boot/loader.conf</filename> if you have previously used it.
pt_br: Não se esqueça de remover a entrada relevante <quote>load</quote> do <filename>/boot/loader.conf</filename> se você a usou anteriormente.

source: Troubleshooting Journaling
pt_br: Solução de problemas com journaling

source: The following section covers frequently asked questions regarding problems related to journaling.
pt_br: A seção a seguir aborda as perguntas mais frequentes relacionadas a problemas relacionados ao journaling.

source: I am getting kernel panics during periods of high disk activity. How is this related to journaling?
pt_br: Estou recebendo um kernel panic durante períodos de alta atividade de disco. Como isso está relacionado ao journaling?

source: The journal probably fills up before it has a chance to get committed (flushed) to disk. Keep in mind the size of the journal depends on the usage load, and not the size of the data provider. If your disk activity is high, you need a larger partition for the journal. See the note in the <link linkend="understanding-journaling">Understanding Journaling</link> section.
pt_br: O journal provavelmente se enche antes que ele tenha a chance de ser enviado (descarregado) para o disco. Lembre-se de que o tamanho do journal depende da carga de uso e não do tamanho do provedor de dados. Se a atividade do disco for alta, você precisará de uma partição maior para o journal. Veja a nota na seção <link linkend="understanding-journaling"> Noções básicas sobre journaling</link>.

source: I made some mistake during configuration, and I cannot boot normally now. Can this be fixed some way?
pt_br: Eu cometi algum erro durante a configuração e não consigo inicializar normalmente agora. Isso pode ser resolvido de alguma forma?

source: You either forgot (or misspelled) the entry in <filename>/boot/loader.conf</filename>, or there are errors in your <filename>/etc/fstab</filename> file. These are usually easy to fix. Press <keycap>Enter</keycap> to get to the default single user shell. Then locate the root of the problem:
pt_br: Você esqueceu (ou escreveu incorretamente) a entrada em <filename>/boot/loader.conf</filename>, ou existem erros no seu arquivo <filename>/etc/fstab</filename>. Estes erros geralmente são fáceis de corrigir. Pressione <keycap>Enter</keycap> para acessar o shell padrão do modo single user. Em seguida, localize a raiz do problema:

source: If the <literal>geom_journal_load</literal> entry is missing or misspelled, the journaled devices are never created. Load the module manually, mount all partitions, and continue with multi-user boot:
pt_br: Se a entrada <literal>geom_journal_load</literal> estiver ausente ou incorreta, os dispositivos registrados nunca serão criados. Carregue o módulo manualmente, monte todas as partições e continue com a inicialização do modo multi usuário:

source: If, on the other hand, this entry is correct, have a look at <filename>/etc/fstab</filename>. You will probably find a misspelled or missing entry. In this case, mount all remaining partitions by hand and continue with the multi-user boot.
pt_br: Se, por outro lado, esta entrada estiver correta, dê uma olhada em <filename>/etc/fstab</filename>. Você provavelmente encontrará uma entrada incorreta ou faltando. Nesse caso, monte todas as partições restantes manualmente e continue com o boot em modo multi-usuários.

source: Can I remove journaling and return to my standard file system with Soft Updates?
pt_br: Posso remover o registro no journal e retornar ao meu sistema de arquivos padrão com o Soft Updates?

source: Sure. Use the following procedure, which reverses the changes. The partitions you created for the journal providers can then be used for other purposes, if you so wish.
pt_br: Certo. Use o procedimento a seguir, que inverte as alterações. As partições que você criou para os provedores de journal podem ser usadas para outros propósitos, se você desejar.

source: Login as <systemitem class="username">root</systemitem> and switch to single user mode:
pt_br: Faça login como <systemitem class="username"> root </systemitem> e alterne para o modo de usuário único:

source: Unmount the journaled partitions:
pt_br: Desmonte as partições journaled:

source: Synchronize the journals:
pt_br: Sincronize os journals:

source: Stop the journaling providers:
pt_br: Pare os provedores de journaling:

source: Clear journaling metadata from all the devices used:
pt_br: Limpe os metadados de journaling de todos os dispositivos usados:

source: Clear the file system journaling flag, and restore the Soft Updates flag:
pt_br: Limpe o sinalizador de journaling do sistema de arquivos e restaure a flag do Soft Updates:

source: Remount the old devices by hand:
pt_br: Remonte os dispositivos antigos à mão:

source: Edit <filename>/etc/fstab</filename> and restore it to its original state:
pt_br: Edite o <filename>/etc/fstab</filename> e restaure-o ao seu estado original:

source: Finally, edit <filename>/boot/loader.conf</filename>, remove the entry that loads the <literal>geom_journal</literal> module and reboot.
pt_br: Finalmente, edite o <filename>/boot/loader.conf</filename>, remova a entrada que carrega o módulo <literal> geom_journal </literal> e reinicie.

source: Further Reading
pt_br: Leitura Adicional

source: Journaling is a fairly new feature of FreeBSD, and as such, it is not very well documented yet. You may however find the following additional references useful:
pt_br: Journaling é um recurso relativamente novo do FreeBSD e, como tal, ainda não está muito bem documentado. Você pode, no entanto, encontrar as seguintes referências adicionais úteis:

source: A <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/geom-gjournal.html">new section on journaling</link> is now part of the FreeBSD Handbook.
pt_br: Uma <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/geom-gjournal.html">nova seção sobre journaling</link> agora faz parte do Handbook do FreeBSD.

source: <link xlink:href="https://lists.freebsd.org/pipermail/freebsd-current/2006-June/064043.html">This post</link> in <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">freebsd-current</link> by <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry>'s developer, Paweł Jakub Dawidek <email>pjd@FreeBSD.org</email>.
pt_br: <link xlink:href="https://lists.freebsd.org/pipermail/freebsd-current/2006-June/064043.html">Este post</link> em <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-current">freebsd-current</link> pelo desenvolvedor do <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry>, Paweł Jakub Dawidek <email>pjd@FreeBSD.org</email>.

source: <link xlink:href="https://lists.freebsd.org/pipermail/freebsd-questions/2008-April/173501.html">This post</link> in <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">freebsd-questions</link> by Ivan Voras <email>ivoras@FreeBSD.org</email>.
pt_br: <link xlink:href="https://lists.freebsd.org/pipermail/freebsd-questions/2008-April/173501.html"> Este post </link> em <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">freebsd-questions</link> por Ivan Voras <email>ivoras@FreeBSD.org</email>.

source: The manual pages of <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: As páginas de manual do <citerefentry><refentrytitle>gjournal</refentrytitle><manvolnum>8</manvolnum></citerefentry> e <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
