<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY date "$FreeBSD: www/fr/about.sgml,v 1.7 2007/02/23 19:49:33 blackend Exp $">
<!ENTITY title "A propos de FreeBSD">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.14

   Version francaise : Luc Vo Van
   Version francaise (mise a jour) : Olivier Cherrier <Olivier.Cherrier@cediti.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
   Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
   Version francaise (mise a jour) : Antoine Brodin <antoine.brodin@laposte.net>
-->

<html>
  &header;

  <h2>Qu'est-ce que FreeBSD ?</h2>

    <p>FreeBSD est un syst&#232;me d'exploitation avanc&#233; pour les
      architectures compatibles x86 (y compris Pentium&reg; et
      Athlon&trade;), compatibles amd64 (y compris Opteron&trade;,
      Athlon&trade;64 et EM64T), ARM, IA-64, PowerPC, PC-98 et UltraSPARC&reg;
      Il est d&#233;riv&#233; de UNIX BSD, la version d'&unix;
      d&#233;velopp&#233;e &#224; l'Universit&#233; de Californie,
      Berkeley.  Il est d&#233;velopp&#233; et maintenu par <a
      href="&enbase;/doc/&url.doc.langcode;/articles/contributors/staff-committers.html">une
      importante &#233;quipe de personnes</a>.  D'autres <a
      href="&base;/platforms/index.html">plates-formes</a> sont &#224;
      divers stades de d&#233;veloppement.</p>

  <h2>Des fonctions avanc&#233;es</h2>

    <p>FreeBSD offre aujourd'hui des <a
      href="&base;/features.html">fonctions avanc&#233;es</a> pour le
      r&#233;seau, les performances, la s&#233;curit&#233; et la
      compatibilit&#233; qui sont encore absentes d'autres syst&#232;mes
      d'exploitation, y compris certains des meilleurs syst&#232;mes
      commerciaux.</p>

  <h2>Des solutions performantes pour Internet</h2>

    <p>FreeBSD est id&#233;al dans le cadre d'un serveur <a
      href="&base;/internet.html">Internet ou Intranet</a>.  Il offre
      des services r&#233;seaux robustes, m&#234;me sous de fortes
      charges, et utilise efficacement la m&#233;moire afin de
      maintenir des temps de r&#233;ponses corrects pour des milliers
      de processus utilisateurs simultan&#233;s.</p>

  <h2>Une plate-forme embarqu&#233;e avanc&#233;e</h2>
    <p>FreeBSD apporte les fonctions r&#233;seau avanc&#233;es de
      syst&#232;mes d'exploitation pour les plates-formes
      embarqu&#233;es ou applicatives allant des syst&#232;mes Intel de
      haut niveau jusqu'aux plates-formes mat&#233;rielles Arm, PowerPc
      et r&#233;cemment MIPS.  Dans les serveurs applicatifs de
      messagerie ou web aux routeurs, serveurs de temps, et points
      d'acc&#232;s sans fil, des constructeurs dans le monde entier font
      confiance aux environnements de compilation int&#233;gr&#233;s et
      crois&#233;s et ainsi qu'aux fonctionnalit&#233;s avanc&#233;es
      pour base de leur produits embarqu&#233;s.  Et la licence libre
      Berkeley les laisse libres de d&#233;cider quels sont leurs
      modifications locales qu'ils rendront disponibles &#224; tous.</p>

  <h2>Une grande vari&#233;t&#233; d'applications</h2>

    <p>Avec plus de 20000 biblioth&#232;ques logicielles et d'<a
      href="&base;/applications.html">applications</a> port&#233;es,
      FreeBSD supporte les applications pour station de travail,
      serveur, serveur applicatif et environnements
      embarqu&#233;s.</p>

  <h2>Facile &#224; installer</h2>

    <p>FreeBSD peut s'installer depuis divers supports comme des
      CD-ROM, des DVDs, ou directement par le r&#233;seau en utilisant
      FTP ou NFS.  Tout ce dont vous avez besoin est
      de suivre <a
      href="&enbase;/doc/&url.doc.langcode;/books/handbook/install.html">ces
      instructions</a>.</p>

  <h2>FreeBSD est <i>libre et gratuit</i></h2>

    <a href="copyright/daemon.html"><img
      src="&enbase;/gifs/dae_up3.gif" alt="The BSD Daemon" height="81"
      width="72" align="right" border="0"></a>

    <p>Alors que vous pourriez vous attendre &#224; ce qu'un
      syst&#232;me d'exploitation avec ce type de fonctions soit vendu
      &#224; un prix &#233;lev&#233;, FreeBSD est disponible <a
      href="&base;/copyright/index.html">gratuitement</a> et est
      fourni avec l'int&#233;gralit&#233; de son code source.  Si vous
      voulez acheter ou t&#233;l&#233;charger une copie afin de
      l'essayer, <a
      href="&enbase;/doc/&url.doc.langcode;/books/handbook/mirrors.html">de
      plus amples informations sont disponibles</a>.</p>

  <h2>Contribuer &#224; FreeBSD</h2>

    <p>Il est facile de contribuer &#224; FreeBSD. Tout ce que vous
      avez &#224; faire est de trouver une partie de FreeBSD dont vous
      pensez qu'elle pourrait &#234;tre am&#233;lior&#233;e et de
      faire ces changements (avec soin) puis de les soumettre au
      projet par l'interm&#233;diaire du programme "send-pr" ou d'une
      personne y participant d&#233;j&#224;, si vous en connaissez
      une.  Cela peut &#234;tre de la documentation, du graphisme ou du
      code.  Consultez l'article <a
      href="&enbase;/doc/&url.doc.langcode;/articles/contributing/index.html">Contribuer
      &#224; FreeBSD</a> pour plus d'informations.</p>

    <p>M&#234;me si vous n'&#234;tes pas un programmeur, il existe
      d'autres fa&#231;ons de contribuer &#224; FreeBSD.  La <a
      href="http://www.FreeBSDFoundation.org">Fondation FreeBSD</a>
      est une organisation &#224; but non-lucratif pour laquelle les
      dons directs sont enti&#232;rement d&#233;ductibles.  Veuillez
      contacter <a
      href="mailto:board@FreeBSDFoundation.org">board@FreeBSDFoundation.org</a>
      pour plus d'informations ou &#233;crivez &#224; : The FreeBSD
      Foundation, P.O. Box 20247, Boulder, CO. 80303.  USA</p>


    &footer;
  </body>
</html>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
