<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY date "$FreeBSD: www/fr/internet.sgml,v 1.10 2007/02/23 19:49:33 blackend Exp $">
<!ENTITY title "FreeBSD et Internet">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.39

   Version francaise : Luc Vo Van
   Version francaise (mise a jour) : Nicolas Lecapitaine <Nicolas.Lecapitaine@chirec.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
    &header;

    <h2>FreeBSD a &eacute;t&eacute; con&ccedil;u pour l'Internet</h2>

      <p>FreeBSD inclus ce que beaucoup consid&egrave;re comme la <i>r&eacute;f&eacute;rence</i> en
         ce qui concerne l'impl&eacute;mentation du protocole TCP/IP, la pile TCP/IP de 4.4 BSD.
         Cela fait de FreeBSD le syst&egrave;me d'exploitation id&eacute;al pour les
         applications r&eacute;seaux et Internet.  FreeBSD 7.0 inclus
	 &eacute;galement l'impl&eacute;mentation de
	 r&eacute;f&eacute;rence du protocole SCTP faisant ainsi de
	 FreeBSD une plate-forme id&eacute;ale pour la
	 t&eacute;l&eacute;phonie et autres applications de diffusion
	 de donn&eacute;es.</p>
    
    <h2>FreeBSD supporte tous les protocoles
	standards TCP/IP.</h2>

      <p>Comme la plupart des syst&egrave;mes &unix;, FreeBSD vous permet
   de</p>

      <ul>
	<li>Fournir via HTTP du contenu web statique ou dynamique</li>

	<li>Partager des syst&egrave;mes de fichiers gr&acirc;ce &agrave; NFS</li>

	<li>Distribuer des informations r&eacute;seaux avec NIS</li>

	<li>G&eacute;rer et fournir un service de messagerie via SMTP,
	  IMAP et POP3</li>

	<li>Supporter la connexion &agrave; distance sur SSH et rsh</li>

	<li>Faire de la configuration et de la gestion de syst&egrave;mes &agrave; distance via SNMP</li>

	<li>Mettre en place un serveur de fichiers avec FTP</li>

	<li>R&eacute;soudre des noms d'h&ocirc;tes Internet avec DNS/BIND</li>

	<li>Rediriger des paquets entre diff&eacute;rentes interfaces, y compris des
	  lignes PPP et SLIP</li>

	<li>Utiliser les services IP Multicast (MBONE)</li>

	<li>Fournir des services sur IPv6</li>
      </ul>

      <p>FreeBSD permet de transformer votre PC&nbsp;en serveur Web,
	serveur de messagerie ou
	encore en relais de news Usenet gr&acirc;ce &agrave; de
	nombreux logiciels inclus dans la distribution.  Avec SAMBA
	vous pourrez m&ecirc;me partager fichiers et imprimantes avec
	vos machines Microsoft&reg; Windows&reg;, avec le serveur
	d'authentification PCNFS vous permettra &eacute;galement de
	g&eacute;rer les machines utilisant PC/NFS.  FreeBSD supporte
	aussi Appletalk ainsi que les r&eacute;seaux Novell
	client/serveur (en utilisant un <a
	href="http://www.netcon.com/">logiciel commercial</a>
	optionnel), faisant de FreeBSD une v&eacute;ritable
	solution pour l'Intranet.</p>

      <p>FreeBSD g&egrave;re aussi les extensions TCP comme par exemple l'extension haute
	performance <a
	  href="http://www.ietf.org/rfc/rfc1323.txt">RFC-1323</a>,
	plus le SLIP et la num&eacute;rotation PPP "sur demande". C'est
	un syst&egrave;me d'exploitation qui conviendra aussi bien &agrave; un	particulier d&eacute;sirant un acc&egrave;s performant &agrave; Internet qu'&agrave;
        un administrateur r&eacute;seau en entreprise.</p>
    
    <h2>Les fonctions r&eacute;seaux de FreeBSD sont stables et
      rapides.</h2>

      <p>Si vous avez besoin d'une plate-forme pour serveur Internet qui soit fiable et qui offre
      les meilleures performances quelque soit la charge r&eacute;seau, FreeBSD est fait pour vous. Voici
      quelques entreprises	utilisant FreeBSD quotidiennement :</p>

      <ul>
	<li>Walnut Creek CDROM exploite l'un des serveurs FTP le plus populaire
	  de l'Internet, ftp.cdrom.com, uniquement sous FreeBSD depuis
	  plusieurs ann&eacute;es. Il s'agit d'une seule machine FreeBSD qui supporte 6000
	  connections et est capable de transf&eacute;rer plus de 30
	  teraoctets (comme en Juin 1999; oui, il s'agit bien de <i>teraoctets</i> !)
	  de fichiers chaque mois &agrave; plus de 10 millions
	  de personnes.</li>

	<li><a href="http://www.yahoo.com/">Yahoo Inc.</a> dispose de
	  l'annuaire le plus complet d'Internet, proposant tous les jours &agrave; des hordes d'internautes
     les toutes derni&egrave;res informations du web. Yahoo, et toutes les entreprises
	  qui utilisent Yahoo comme support publicitaire, comptent sur FreeBSD pour disposer de
     serveurs web fiables et rapides. </li>

   <li><a href="http://www.netcraft.com/">Netcraft</a> est le leader
	  dans le domaine des statistiques d'utilisation des serveurs web sur Internet. Ils utilisent
	  FreeBSD et Apache pour faire fonctionner leur site web et FreeBSD/Perl pour
	  la collecte des donn&eacute;es sur Internet.
	</li>
  </ul>

      <p>FreeBSD est la plate-forme id&eacute;ale pour les services Internet, dont :</p>

      <ul>
	<li>Les fonctions WWW en entreprise ou sur Internet</li>

	<li>Les serveurs Proxy WWW</li>

	<li>Les serveurs&nbsp;FTP anonymes</li>

	<li>Les serveurs de fichiers, de messagerie et d'impression en entreprise</li>
	<li>Les routeurs, pare-feu et syst&egrave;mes de
	  d&eacute;tection d'intrusion</li>
      </ul>

      <p>La <a href="&base;/ports/index.html">collection de ports</a> de
	FreeBSD contient de nombreux logiciels pr&ecirc;ts &agrave; l'emploi qui
	permettent de cr&eacute;er facilement votre propre serveur Internet.</p>
    
    <h2>Performances &eacute;lev&eacute;es <em>et</em>
	s&eacute;curit&eacute;.</h2>

      <p>L'&eacute;quipe de d&eacute;veloppement de FreeBSD attache autant d'importance &agrave; la
      	s&eacute;curit&eacute; qu'aux performances. FreeBSD inclut un support noyau pour les
      	firewalls&nbsp;IP ainsi que d'autres fonctions comme les proxies IP. Si
      	vos serveurs d'entreprise sont reli&eacute;s &agrave; l'Internet, un simple
      	ordinateur sous FreeBSD vous permettra de disposer
      	d'un firewall pour les prot&eacute;ger des agressions ext&eacute;rieures.</p>

      <p>Logiciels de cryptage, shells s&eacute;curis&eacute;s, Kerberos, cryptage
	point-&agrave;-point et services RPC s&eacute;curis&eacute;s sont &eacute;galement disponibles.</p>

      <p>De plus, l'&eacute;quipe FreeBSD est tr&egrave;s active dans la d&eacute;tection
         et la diffusion des informations et des comptes rendus de bugs concernant la s&eacute;curit&eacute; avec un <a
         href="mailto:security-officer@FreeBSD.org">"officier de s&eacute;curit&eacute;"</a> et
         est li&eacute;e avec le "Computer Emergency Response Team" (<a
         href="http://www.cert.org/">CERT</a>).</p>

    <h2>Paroles d'expert...</h2>
    
      <p><i>``FreeBSD ... dipose probablement de la pile TCP/IP
	  la plus robuste et la plus fonctionnelle &agrave; ce jour ...''</i></p>

      <div align="right"><p>---Michael O'Brien, <i>SunExpert </i>Ao&ucirc;t 1996
	  volume 7 num&eacute;ro 8.</p></div>

      &footer;
  </body>
</html>

<!--
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
