Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/linuxemu/_index.po
Languages: ko, ru

source: Linux binaries linked dynamically (which is the vast majority) also require Linux shared libraries to be installed - they can run on top of the FreeBSD kernel, but they cannot use FreeBSD libraries; this is similar to how 32-bit binaries cannot use native 64-bit libraries. There are several ways of providing those libraries: one can copy them over from an existing Linux installation using the same architecture, install them from FreeBSD packages, or install using man:debootstrap[8] (from package:sysutils/debootstrap[]), and others.
ko: 동적으로 링크된 리눅스 바이너리(대부분)는 리눅스 공유 라이브러리를 설치해야 하는데, 이는 32비트 바이너리가 네이티브 64비트 라이브러리를 사용할 수 없는 것과 유사합니다 - FreeBSD 커널 위에서 실행할 수는 있지만 FreeBSD 라이브러리를 사용할 수는 없습니다. 이러한 라이브러리를 제공하는 방법에는 여러 가지가 있습니다. 동일한 아키텍처를 사용하는 기존 Linux 설치에서 복사하거나, FreeBSD 패키지에서 설치하거나, man:debootstrap[8](package:sysutils/debootstrap[])을 사용하여 설치하는 방법 등이 있습니다.

source: This method is not yet available for arm64.
ko: 이 방법은 아직 arm64에서 사용할 수 없습니다.

source: The easiest way to install Linux libraries is to install package:emulators/linux_base-c7[] package or port, which places the CentOS 7-derived base system into [.filename]#/compat/linux#:
ko: Linux 라이브러리를 설치하는 가장 쉬운 방법은 CentOS 7에서 파생된 기본 시스템을 [.filename]#/compat/linux#에 배치하는 package:emulators/linux_base-c7[] 패키지 또는 포트를 설치하는 것입니다:

source: FreeBSD provides packages for some Linux binary applications. For example, to install Sublime Text 4, along with all the Linux libraries it depends on, run this command:
ko: FreeBSD는 일부 리눅스 바이너리 애플리케이션을 위한 패키지를 제공합니다. 예를 들어, Sublime Text 4와 이에 종속된 모든 Linux 라이브러리를 설치하려면 다음 명령을 실행하세요:

source: Debian / Ubuntu Base System with man:debootstrap[8]
ko: 데비안/우분투 기본 시스템(man:debootstrap[8] 포함)

source: An alternative way of providing Linux shared libraries is by using package:sysutils/debootstrap[]. This has the advantage of providing a full Debian or Ubuntu distribution. To use it, follow the instructions at FreeBSD Wiki: https://wiki.freebsd.org/LinuxJails[FreeBSD Wiki - Linux Jails].
ko: Linux 공유 라이브러리를 제공하는 다른 방법은 package:sysutils/debootstrap[]을 사용하는 것입니다. 이 방법은 전체 데비안 또는 우분투 배포판을 제공한다는 장점이 있습니다. 이를 사용하려면 FreeBSD Wiki의 지침을 따르세요: https://wiki.freebsd.org/LinuxJails[FreeBSD Wiki - Linux Jails].

source: After debootstrapping, man:chroot[8] into the newly created directory and install software in a way typical for the Linux distribution inside, for example:
ko: Debootstrapping 후 새로 생성된 디렉터리에 man:chroot[8]를 입력하고 내부에 일반적인 Linux 배포 방식에 따라 소프트웨어를 설치합니다. 예를 들어:

source: It is possible to debootstrap into [.filename]#/compat/linux#, but it is discouraged to avoid collisions with files installed from FreeBSD ports and packages. Instead, derive the directory name from the distribution or version name, e.g., [.filename]#/compat/ubuntu#. If the bootstrapped instance is intended to provide Linux shared libraries without having to explicitly use chroot or jails, one can point the kernel at it by updating the `compat.linux.emul_path` sysctl and adding a line like this to [.filename]#/etc/sysctl.conf#:
ko: [.filename]#/compat/linux#로 부트스트랩을 디부팅할 수도 있지만, FreeBSD 포트 및 패키지에서 설치된 파일과의 충돌을 피하기 위해 권장하지 않습니다. 대신 배포판 또는 버전 이름에서 디렉토리 이름을 파생하세요(예: [.filename]#/compat/ubuntu#). 부트스트랩 인스턴스가 명시적으로 chroot나 jail을 사용하지 않고도 Linux 공유 라이브러리를 제공하려는 경우, `compat.linux.emul_path` sysctl을 업데이트하고 [.filename]#/etc/sysctl.conf#에 다음과 같은 줄을 추가하여 커널이 이를 가리키도록 할 수 있습니다:

source: This sysctl controls the kernel's path translation mechanism; see man:linux[4] for details. Please note that changing it might cause trouble for Linux applications installed from FreeBSD packages; one reason is that many of those applications are still 32-bit, while Ubuntu seems to be deprecating 32-bit library support.
ko: 이 sysctl은 커널의 경로 변환 메커니즘을 제어합니다. 자세한 내용은 man:linux[4]를 참조하세요. 이 값을 변경하면 FreeBSD 패키지에서 설치된 리눅스 애플리케이션에 문제가 발생할 수 있습니다. 그 이유 중 하나는 많은 애플리케이션이 여전히 32비트인 반면 우분투는 32비트 라이브러리 지원을 중단하고 있기 때문입니다.

source: The Linux compatibility layer is a work in progress. Consult https://wiki.freebsd.org/Linuxulator[FreeBSD Wiki - Linuxulator] for more information.
ko: 리눅스 호환성 계층은 현재 진행 중입니다. 자세한 내용은 https://wiki.freebsd.org/Linuxulator[FreeBSD Wiki - Linuxulator]를 참조하세요.

source: Some applications require specific filesystems to be mounted. This is normally handled by the [.filename]#/etc/rc.d/linux# script, but can be disabled by adding this line to [.filename]#/etc/rc.conf#:
ko: 일부 애플리케이션은 특정 파일시스템을 마운트해야 합니다. 이는 일반적으로 [.filename]#/etc/rc.d/linux# 스크립트에 의해 처리되지만, [.filename]#/etc/rc.conf#에 이 줄을 추가하여 비활성화할 수 있습니다:

source: Since the Linux binary compatibility layer has gained support for running both 32- and 64-bit Linux binaries (on 64-bit x86 hosts), it is no longer possible to link the emulation functionality statically into a custom kernel.
ko: Linux 바이너리 호환성 계층이 32비트 및 64비트 Linux 바이너리(64비트 x86 호스트에서) 실행을 모두 지원하게 되었으므로 더 이상 에뮬레이션 기능을 사용자 지정 커널에 정적으로 연결할 수 없게 되었습니다.

source: From a Linux system using the same CPU architecture, `ldd` can be used to determine which shared libraries the application needs. For example, to check which shared libraries `linuxdoom` needs, run this command from a Linux system that has Doom installed:
ko: 동일한 CPU 아키텍처를 사용하는 Linux 시스템에서 `ldd`를 사용하여 애플리케이션에 필요한 공유 라이브러리를 확인할 수 있습니다. 예를 들어, `linuxdoom`이 필요로 하는 공유 라이브러리를 확인하려면 Doom이 설치된 Linux 시스템에서 이 명령을 실행합니다:

source: Then, copy all the files in the last column of the output from the Linux system into [.filename]#/compat/linux# on the FreeBSD system. Once copied, create symbolic links to the names in the first column. This example will result in the following files on the FreeBSD system:
ko: 그런 다음 Linux 시스템에서 출력의 마지막 열에 있는 모든 파일을 FreeBSD 시스템의 [.filename]#/compat/linux#에 복사합니다. 복사한 후에는 첫 번째 열에 있는 이름에 대한 심볼릭 링크를 만듭니다. 이 예제에서는 FreeBSD 시스템에 다음과 같은 파일이 생성됩니다:

source: The FreeBSD kernel uses several methods to determine if the binary to be executed is a Linux one: it checks the brand in the ELF file header, looks for known ELF interpreter paths and checks ELF notes; finally, by default, unbranded ELF executables are assumed to be Linux anyway. Should all those methods fail, an attempt to execute the binary might result in error message:
ko: FreeBSD 커널은 실행할 바이너리가 리눅스 바이너리인지 확인하기 위해 여러 가지 방법을 사용합니다: ELF 파일 헤더에서 브랜드를 확인하고, 알려진 ELF 인터프리터 경로를 찾고, ELF 메모를 확인하고, 마지막으로 기본적으로 브랜드가 없는 ELF 실행 파일은 리눅스 파일로 간주합니다. 이러한 모든 방법이 실패하면 바이너리를 실행하려고 시도할때 오류 메시지가 표시될 수 있습니다:

source: This specifies that [.filename]#/etc/hosts# is searched first and DNS is searched second. When [.filename]#/compat/linux/etc/host.conf# does not exist, Linux applications use [.filename]#/etc/host.conf# and complain about the incompatible FreeBSD syntax. Remove `bind` if a name server is not configured using [.filename]#/etc/resolv.conf#.
ko: 이는 [.filename]#/etc/hosts#을 먼저 검색하고 DNS를 두 번째로 검색하도록 지정합니다. [.filename]#/compat/linux/etc/host.conf#가 존재하지 않으면 Linux 애플리케이션은 [.filename]#/etc/host.conf#를 사용하며 호환되지 않는 FreeBSD 구문에 대해 불평합니다. 이름 서버가 [.filename]#/etc/resolv.conf#를 사용하여 구성되지 않은 경우 `bind`를 제거합니다.

source: This section describes how Linux binary compatibility works and is based on an email written to {freebsd-chat} by Terry Lambert mailto:tlambert@primenet.com[tlambert@primenet.com] (Message ID: `<199906020108.SAA07001@usr09.primenet.com>`).
ko: 이 섹션에서는 Linux 바이너리 호환성이 어떻게 작동하는지에 대해 설명하며, Terry Lambert mailto:tlambert@primenet.com[tlambert@primenet.com](Message ID: `<199906020108.SAA07001@usr09.primenet.com>`)가 {freebsd-chat}에 보낸 이메일을 기반으로 작성되었습니다.

source: FreeBSD has an abstraction called an "execution class loader". This is a wedge into the man:execve[2] system call.
ko: FreeBSD에는 "execution class loader"라는 추상화가 있습니다. 이것은 man:execve[2] 시스템 호출에 쐐기를 박는 것입니다.

source: Historically, the UNIX(R) loader examined the magic number (generally the first 4 or 8 bytes of the file) to see if it was a binary known to the system, and if so, invoked the binary loader.
ko: 과거에는 UNIX(R) 로더가 매직넘버(일반적으로 파일의 처음 4바이트 또는 8바이트)를 검사하여 시스템에 알려진 바이너리인지 확인한 후, 바이너리인 경우 바이너리 로더를 호출했습니다.

source: If it was not the binary type for the system, the man:execve[2] call returned a failure, and the shell attempted to start executing it as shell commands. The assumption was a default of "whatever the current shell is".
ko: 시스템의 바이너리 유형이 아닌 경우, man:execve[2] 호출은 실패를 반환하고 셸은 셸 명령으로 실행을 시작하려고 시도합니다. 기본값은 "현재 셸이 무엇이든"으로 가정했습니다.

source: Later, a hack was made for man:sh[1] to examine the first two characters, and if they were `:\n`, it invoked the man:csh[1] shell instead.
ko: 나중에 man:sh[1]이 처음 두 문자를 검사하고 `:\n`이면 man:csh[1] 셸을 대신 호출하는 핵이 만들어졌습니다.

source: FreeBSD has a list of loaders, instead of a single loader, with a fallback to the `#!` loader for running shell interpreters or shell scripts.
ko: FreeBSD에는 단일 로더 대신 로더 목록이 있으며, 셸 인터프리터 또는 셸 스크립트를 실행하기 위한 `#!` 로더에 대한 폴백이 있습니다.

source: For the Linux ABI support, FreeBSD sees the magic number as an ELF binary. The ELF loader looks for a specialized _brand_, which is a comment section in the ELF image, and which is not present on SVR4/Solaris(TM) ELF binaries.
ko: 리눅스 ABI 지원의 경우, FreeBSD는 매직넘버를 ELF 바이너리로 간주합니다. ELF 로더는 ELF 이미지의 주석 섹션인 특수 _brand_를 찾으며, 이는 SVR4/Solaris(TM) ELF 바이너리에는 존재하지 않습니다.

source: For Linux binaries to function, they must be _branded_ as type `Linux` using man:brandelf[1]:
ko: Linux 바이너리가 작동하려면 man:brandelf[1]을 사용하여 `Linux` 유형으로 _branded_해야 합니다:

source: When the ELF loader sees the `Linux` brand, the loader replaces a pointer in the `proc` structure. All system calls are indexed through this pointer. In addition, the process is flagged for special handling of the trap vector for the signal trampoline code, and several other (minor) fix-ups that are handled by the Linux kernel module.
ko: ELF 로더가 'Linux' 브랜드를 발견하면 로더는 'proc' 구조체의 포인터를 대체합니다. 모든 시스템 호출은 포인터를 통해 인덱싱됩니다. 또한 신호 트램폴린 코드에 대한 트랩 벡터의 특수 처리와 Linux 커널 모듈에서 처리하는 몇 가지 다른 (사소한) 수정 사항을 위해 프로세스에 플래그가 지정됩니다.

source: The Linux system call vector contains, among other things, a list of `sysent[]` entries whose addresses reside in the kernel module.
ko: Linux 시스템 호출 벡터에는 무엇보다도 커널 모듈에 주소가 있는 `sysent[]` 항목 목록이 포함되어 있습니다.

source: When a system call is called by the Linux binary, the trap code dereferences the system call function pointer off the `proc` structure, and gets the Linux, not the FreeBSD, system call entry points.
ko: Linux 바이너리가 시스템 호출을 호출하면 트랩 코드는 `proc` 구조에서 시스템 호출 함수 포인터를 역참조하고 FreeBSD가 아닌 Linux의 시스템 호출 진입점을 가져옵니다.

source: Linux mode dynamically _reroots_ lookups. This is, in effect, equivalent to `union` file system mounts. First, an attempt is made to look up the file in [.filename]#/compat/linux/original-path#. If that fails, the lookup is done in [.filename]#/original-path#. This makes sure that binaries that require other binaries can run. For example, the Linux toolchain can all run under Linux ABI support. It also means that the Linux binaries can load and execute FreeBSD binaries, if there are no corresponding Linux binaries present, and that a man:uname[1] command can be placed in the [.filename]#/compat/linux# directory tree to ensure that the Linux binaries cannot tell they are not running on Linux.
ko: 리눅스 모드의 동적 _reroots_ 조회. 이는 사실 `유니온` 파일 시스템 마운트와 동일합니다. 먼저 [.filename]#/compat/linux/original-path#에서 파일을 조회하려고 시도합니다. 실패하면 [.filename]#/original-path#에서 조회가 수행됩니다. 이렇게 하면 다른 바이너리가 필요한 바이너리를 실행할 수 있습니다. 예를 들어 Linux 툴체인은 모두 Linux ABI 지원 하에서 실행될 수 있습니다. 또한 해당 Linux 바이너리가 없는 경우 FreeBSD 바이너리를 로드하고 실행할 수 있으며, man:uname[1] 명령을 [.filename]#/compat/linux# 디렉토리 트리에 배치하여 Linux 바이너리가 Linux에서 실행되고 있지 않다는 것을 알 수 없도록 할 수 있습니다.

source: In effect, there is a Linux kernel in the FreeBSD kernel. The various underlying functions that implement all of the services provided by the kernel are identical to both the FreeBSD system call table entries, and the Linux system call table entries: file system operations, virtual memory operations, signal delivery, and System V IPC. The only difference is that FreeBSD binaries get the FreeBSD _glue_ functions, and Linux binaries get the Linux _glue_ functions. The FreeBSD _glue_ functions are statically linked into the kernel, and the Linux _glue_ functions can be statically linked, or they can be accessed via a kernel module.
ko: 사실상 FreeBSD 커널에는 리눅스 커널이 있습니다. 커널이 제공하는 모든 서비스를 구현하는 다양한 기본 함수는 파일 시스템 작업, 가상 메모리 작업, 신호 전달 및 System V IPC와 같은 FreeBSD 시스템 호출 테이블 항목과 Linux 시스템 호출 테이블 항목 모두와 동일합니다. 유일한 차이점은 FreeBSD 바이너리는 FreeBSD _glue_ 함수를, Linux 바이너리는 Linux _glue_ 함수를 가져온다는 점입니다. FreeBSD _glue_ 함수는 커널에 정적으로 링크되어 있고, Linux _glue_ 함수는 정적으로 링크되거나 커널 모듈을 통해 액세스할 수 있습니다.

source: Technically, this is not really emulation, it is an ABI implementation. It is sometimes called "Linux emulation" because the implementation was done at a time when there was no other word to describe what was going on. Saying that FreeBSD ran Linux binaries was not true, since the code was not compiled in.
ko: 엄밀히 말하면 이것은 에뮬레이션이 아니라 ABI 구현입니다. 이 구현은 무슨 일이 일어나고 있는지 설명할 다른 단어가 없던 시절에 이루어졌기 때문에 "Linux 에뮬레이션"이라고도 불립니다. 코드가 컴파일되지 않았기 때문에 FreeBSD가 Linux 바이너리를 실행한다는 말은 사실이 아닙니다.
