Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/linuxemu/_index.po
Languages: ko, ru

source: FreeBSD provides binary compatibility with Linux, allowing users to install and run most Linux binaries on a FreeBSD system without having to first modify the binary
ko: FreeBSD는 Linux와의 바이너리 호환성을 제공하므로 사용자는 바이너리를 수정할 필요 없이 대부분의 Linux 바이너리를 FreeBSD 시스템에서 설치하고 실행할 수 있습니다
ru: FreeBSD обеспечивает двоичную совместимость с Linux, позволяя пользователям устанавливать и запускать большинство двоичных исполняемых файлов Linux в системе FreeBSD без необходимости предварительного изменения двоичного файла

source: Part II. Common Tasks
ko: 파트 II. 일반적인 작업
ru: Часть II. Стандартные задачи

source: Chapter 12. Linux Binary Compatibility
ru: Глава 12. Двоичная совместимость с Linux

source: Linux Binary Compatibility
ko: Linux 바이너리 호환성
ru: Двоичная совместимость с Linux

source: Synopsis
ko: 요약
ru: Обзор

source: FreeBSD provides *optional* binary compatibility with Linux(R), commonly referred to as Linuxulator, allowing users to install and run unmodified Linux binaries. It is available for the x86 (both 32 and 64 bit) and AArch64 architectures. Some Linux-specific operating system features are not yet supported; this mostly happens with functionality specific to hardware or related to system management, such as cgroups or namespaces.
ru: FreeBSD предоставляет *опциональную* двоичную совместимость с Linux(R), часто называемую Linuxulator, что позволяет пользователям устанавливать и запускать неизменённые Linux-бинарники. Это доступно для архитектур x86 (как 32, так и 64 бит) и AArch64. Некоторые специфичные для Linux функции операционной системы пока не поддерживаются; в основном это касается функциональности, связанной с оборудованием или управлением системой, такой как cgroups или пространства имён.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Know how to install crossref:ports[ports,additional third-party software].
ko: crossref:ports[ports,additional third-party software]를 설치하는 방법을 알고 있습니다.
ru: Знать, как установить crossref:ports[ports,дополнительное стороннее программное обеспечение].

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: How to enable Linux binary compatibility on a FreeBSD system.
ko: FreeBSD 시스템에서 Linux 바이너리 호환성을 활성화하는 방법.
ru: Как включить двоичную совместимость с Linux в системе FreeBSD.

source: How to install additional Linux shared libraries.
ko: Linux 공유 라이브러리를 추가로 설치하는 방법.
ru: Как установить дополнительные общие библиотеки Linux.

source: How to install Linux applications on a FreeBSD system.
ko: FreeBSD 시스템에 Linux 애플리케이션을 설치하는 방법.
ru: Как установить Linux-приложения в системе FreeBSD.

source: The implementation details of Linux compatibility in FreeBSD.
ko: FreeBSD의 Linux 호환성 구현 세부 정보.
ru: Как реализована совместимость с Linux в FreeBSD.

source: Configuring Linux Binary Compatibility
ko: Linux 바이너리 호환성 구성하기
ru: Настройка бинарной совместимости с Linux

source: By default, man:linux[4] binary compatibility is not enabled.
ru: По умолчанию бинарная совместимость с man:linux[4] не включена.

source: To enable the Linux ABI at boot time, execute the following command:
ru: Чтобы включить ABI Linux при загрузке, выполните следующую команду:

source: Once enabled, it can be started without rebooting by executing the following command:
ru: После включения его можно запустить без перезагрузки, выполнив следующую команду:

source: This is enough for statically linked Linux binaries to work.
ru: Этого достаточно для работы статически связанных Linux-библиотек.

source: The Linux service will load necessary kernel modules and mount filesystems expected by Linux applications under [.filename]#/compat/linux#. They can be started in the same way native FreeBSD binaries can; they behave almost exactly like native processes and can be traced and debugged the usual way.
ru: Сервис Linux загрузит необходимые модули ядра и смонтирует файловые системы, ожидаемые Linux-приложениями, в [.filename]#/compat/linux#. Их можно запускать так же, как и родные FreeBSD-приложения; они ведут себя почти так же, как родные процессы, и их можно трассировать и отлаживать обычными способами.

source: The current content of [.filename]#/compat/linux# can be checked executing the following command:
ru: Текущее содержимое [.filename]#/compat/linux# можно проверить, выполнив следующую команду:

source: The output should be similar to the following:
ru: Вывод должен быть похож на следующий:

source: Linux userlands
ru: Пользовательские окружения Linux

source: Linux software requires more than just an ABI to work. In order to run Linux software a Linux userland must be installed first.
ru: Программное обеспечение Linux требует не только ABI для работы. Для запуска программ Linux необходимо сначала установить пользовательское пространство Linux.

source: If all that is wanted is to run some software already included in the Ports tree, it can be installed via package manager and man:pkg[8] will automatically setup the required Linux userland.
ru: Если требуется только запустить какое-либо программное обеспечение, уже включённое в дерево портов, его можно установить через менеджер пакетов, и man:pkg[8] автоматически настроит необходимую пользовательскую среду Linux.

source: For example, to install Sublime Text 4, along with all the Linux libraries it depends on, run this command:
ru: Например, чтобы установить Sublime Text 4 вместе со всеми необходимыми библиотеками Linux, выполните следующую команду:

source: Rocky Linux Base System from FreeBSD Packages
ru: Базовая система Rocky Linux из пакетов FreeBSD

source: To install the Rocky Linux 9 userland execute the following command:
ru: Для установки пользовательской среды Rocky Linux 9 выполните следующую команду:

source: package:emulators/linux_base-rl9[] will place the base system derived from Rocky Linux 9 into [.filename]#/compat/linux#.
ru: Пакет package:emulators/linux_base-rl9[] разместит базовую систему, основанную на Rocky Linux 9, в [.filename]#/compat/linux#.

source: After installing the package, the contents of [.filename]#/compat/linux# can be verified by running the following command to check that the Rocky Linux userland has been installed:
ru: После установки пакета содержимое [.filename]#/compat/linux# можно проверить, выполнив следующую команду, чтобы убедиться, что пользовательская среда Rocky Linux установлена:

source: CentOS Base System from FreeBSD Packages
ko: FreeBSD 패키지의 CentOS 기본 시스템
ru: Базовая система CentOS из пакетов FreeBSD

source: package:emulators/linux_base-c7[] has been deprecated following the deprecation of the upstream project. This means package:emulators/linux_base-c7[] will not receive security updates. The use of crossref:linuxemu[linuxemu-rockylinux, the Rocky Linux Base System] is recommended unless 32-bit compatibility is needed.
ru: Пакет package:emulators/linux_base-c7[] устарел после прекращения поддержки вышестоящего проекта. Это означает, что package:emulators/linux_base-c7[] больше не будет получать обновления безопасности. Рекомендуется использовать crossref:linuxemu[linuxemu-rockylinux, базовую систему Rocky Linux], если не требуется совместимость с 32-битными системами.

source: To install the CentOS userland execute the following command:
ru: Для установки пользовательской среды CentOS выполните следующую команду:

source: package:emulators/linux_base-c7[] will place the base system derived from CentOS 7 into [.filename]#/compat/linux#.
ru: Пакет package:emulators/linux_base-c7[] разместит базовую систему, основанную на CentOS 7, в каталоге `[.filename]#/compat/linux#`.

source: After installing the package, the contents of [.filename]#/compat/linux# can be verified by running the following command to check that the CentOS userland has been installed:
ru: После установки пакета содержимое [.filename]#/compat/linux# можно проверить, выполнив следующую команду, чтобы убедиться, что пользовательская среда CentOS установлена:

source: Debian / Ubuntu Base System with debootstrap
ru: Debian / Ubuntu Базовая система с debootstrap

source: An alternative way of providing Linux shared libraries is by using package:sysutils/debootstrap[]. This has the advantage of providing a full Debian or Ubuntu distribution.
ru: Альтернативный способ предоставления общих библиотек Linux — использование package:sysutils/debootstrap[]. Это имеет преимущество в виде предоставления полного дистрибутива Debian или Ubuntu.

source: To install debootstrap execute the following command:
ru: Чтобы установить debootstrap, выполните следующую команду:

source: man:debootstrap[8] needs man:linux[4] ABI enabled. Once enabled, execute the following command to install Ubuntu or Debian in [.filename]#/compat/ubuntu#:
ru: Для работы man:debootstrap[8] требуется включённый man:linux[4] ABI. После его активации выполните следующую команду для установки Ubuntu или Debian в [.filename]#/compat/ubuntu#:

source: While it is technically possible to install into [.filename]#/compat/linux# instead, it's discouraged due to possible clashes with CentOS-based packages. Instead, derive the directory name from the distribution or version name, e.g., [.filename]#/compat/ubuntu#.
ru: Хотя технически возможно установить в [.filename]#/compat/linux#, это не рекомендуется из-за возможных конфликтов с пакетами на основе CentOS. Вместо этого используйте имя каталога, производное от названия дистрибутива или версии, например, [.filename]#/compat/ubuntu#.

source: Then set up mounts in [.filename]#/etc/fstab#.
ru: Затем настройте точки монтирования в [.filename]#/etc/fstab#.

source: If the contents of the home directory should be shared and to be able to run X11 applications, [.filename]#/home# and [.filename]#/tmp# should be mounted in the linux compat area using man:nullfs[5] for loopback.
ru: Если содержимое домашнего каталога должно быть общим и необходимо иметь возможность запускать приложения X11, [.filename]#/home# и [.filename]#/tmp# следует подключить в области совместимости linux с использованием man:nullfs[5] для loopback (обратной петли).

source: The following example can be added to [.filename]#/etc/fstab#:
ru: Следующий пример можно добавить в [.filename]#/etc/fstab#:

source: Then execute man:mount[8]:
ru: Затем выполните man:mount[8]:

source: To access the system using man:chroot[8] execute the following command:
ru: Для доступа к системе с использованием man:chroot[8] выполните следующую команду:

source: Then man:uname[1] can be executed to check the Linux environment:
ru: Тогда можно выполнить man:uname[1], чтобы проверить окружение Linux:

source: Once inside the chroot, the system behaves as in a normal Ubuntu installation. While systemd doesn't work, the man:service[8] command works as usual.
ru: Оказавшись в chroot, система ведет себя как при обычной установке Ubuntu. Хотя systemd не работает, команда man:service[8] функционирует в обычном режиме.

source: To add the package repositories missing from defaults edit the file [.filename]#/compat/ubuntu/etc/apt/sources.list#.
ru: Чтобы добавить отсутствующие репозитории пакетов по умолчанию, отредактируйте файл [.filename]#/compat/ubuntu/etc/apt/sources.list#.

source: For amd64 the following example can be used:
ru: Для amd64 можно использовать следующий пример:

source: For arm64 this other example can be used:
ru: Для arm64 можно использовать следующий пример:

source: Advanced Topics
ko: 고급 주제
ru: Сложные темы

source: A list of all Linux-related man:sysctl[8] knobs can be found in man:linux[4].
ko: 모든 Linux 관련 man:sysctl[8] 노브 목록은 man:linux[4]에서 확인할 수 있습니다.
ru: Список всех параметров man:sysctl[8], связанных с Linux, можно найти в man:linux[4].

source: Some applications require specific filesystems to be mounted.
ru: Некоторые приложения требуют подключения определенных файловых систем.

source: This is normally handled by the [.filename]#/etc/rc.d/linux# script but can be disabled at boot executing the following command:
ru: Обычно это обрабатывается скриптом [.filename]#/etc/rc.d/linux#, но можно отключить при загрузке, выполнив следующую команду:

source: Filesystems mounted by the rc script will not work for Linux processes inside chroots or jails; if needed, configure them in [.filename]#/etc/fstab#:
ko: rc 스크립트로 마운트한 파일시스템은 chroots 또는 jail 내부의 Linux 프로세스에서는 작동하지 않으므로 필요한 경우 [.filename]#/etc/fstab#에서 구성하세요:
ru: Файловые системы, смонтированные скриптом rc, не будут работать для Linux-процессов внутри chroot или клетки. При необходимости настройте их в [.filename]#/etc/fstab#:

source: Since the Linux binary compatibility layer has gained support for running both 32- and 64-bit Linux binaries, it is no longer possible to link the emulation functionality statically into a custom kernel.
ru: Поскольку уровень двоичной совместимости с Linux получил поддержку выполнения как 32-, так и 64-битных бинарных файлов Linux, стало невозможно статически линковать функциональность эмуляции в пользовательское ядро.

source: Installing Additional Libraries Manually
ko: 직접 추가 라이브러리 설치하기
ru: Установка дополнительных библиотек вручную

source: For base system subdirectories created with man:debootstrap[8], use the instructions above instead.
ko: man:debootstrap[8]으로 만든 기본 시스템 하위 디렉터리의 경우 위의 지침을 대신 사용하세요.
ru: Для подкаталогов базовой системы, созданных с помощью man:debootstrap[8], используйте приведенные выше инструкции.

source: If a Linux application complains about missing shared libraries after configuring Linux binary compatibility, determine which shared libraries the Linux binary needs and install them manually.
ko: Linux 바이너리 호환성을 구성한 후 Linux 애플리케이션에서 공유 라이브러리가 누락되었다고 불평하는 경우 Linux 바이너리에 필요한 공유 라이브러리를 결정하고 수동으로 설치하세요.
ru: Если приложение Linux жалуется на отсутствие общих библиотек после настройки совместимости с двоичными файлами Linux, определите, какие общие библиотеки нужны двоичному файлу Linux, и установите их вручную.

source: From a Linux system using the same CPU architecture, `ldd` can be used to determine which shared libraries the application needs.
ru: С системы Linux с той же архитектурой CPU можно использовать `ldd` для определения того, какие разделяемые библиотеки необходимы приложению.

source: For example, to check which shared libraries `linuxdoom` needs, run this command from a Linux system that has Doom installed:
ru: Например, чтобы проверить, какие разделяемые библиотеки требуются для `linuxdoom`, выполните следующую команду в системе Linux, где установлен Doom:

source: Then, copy all the files in the last column of the output from the Linux system into [.filename]#/compat/linux# on the FreeBSD system. Once copied, create symbolic links to the names in the first column.
ru: Затем скопируйте все файлы из последнего столбца вывода с системы Linux в [.filename]#/compat/linux# на системе FreeBSD. После копирования создайте символические ссылки на имена из первого столбца.

source: This example will result in the following files on the FreeBSD system:
ru: Этот пример приведёт к следующим файлам в системе FreeBSD:

source: If a Linux shared library already exists with a matching major revision number to the first column of the `ldd` output, it does not need to be copied to the file named in the last column, as the existing library should work. It is advisable to copy the shared library if it is a newer version, though. The old one can be removed, as long as the symbolic link points to the new one.
ko: `ldd`` 출력의 첫 번째 열에 메이저 리비전 번호가 일치하는 Linux 공유 라이브러리가 이미 존재하는 경우, 기존 라이브러리가 작동하므로 마지막 열에 있는 파일에 복사할 필요가 없습니다. 하지만 공유 라이브러리가 최신 버전인 경우 복사하는 것이 좋습니다. 심볼릭 링크가 새 라이브러리를 가리키고 있다면 이전 라이브러리는 제거할 수 있습니다.
ru: Если уже существует общая библиотека Linux с соответствующим номером старшей версии (первый столбец вывода `ldd`), её не нужно копировать в файл, указанный в последнем столбце, так как существующая библиотека должна работать. Однако рекомендуется скопировать общую библиотеку, если она является более новой версией. Старую версию можно удалить, при условии что символическая ссылка указывает на новую.

source: For example, these libraries already exist on the FreeBSD system:
ko: 예를 들어, 이 라이브러리는 이미 FreeBSD 시스템에 존재합니다:
ru: Например, эти библиотеки уже существуют в системе FreeBSD:

source: and `ldd` indicates that a binary requires a later version:
ko: 그리고 `ldd`는 바이너리에 최신 버전이 필요함을 나타냅니다:
ru: и `ldd` показывает, что для бинарного файла требуется более новая версия:

source: Since the existing library is only one or two versions out of date in the last digit, the program should still work with the slightly older version. However, it is safe to replace the existing [.filename]#libc.so# with the newer version:
ko: 기존 라이브러리의 마지막 자릿수가 한두 버전 오래되었으므로 프로그램은 여전히 약간 오래된 버전으로 작동해야 합니다. 그러나 기존 [.filename]#libc.so#를 최신 버전으로 교체하는 것이 안전합니다:
ru: Поскольку существующая библиотека устарела всего на одну или две версии в последней цифре, программа должна по-прежнему работать с немного более старой версией. Однако можно безопасно заменить существующий [.filename]#libc.so# на более новую версию:

source: Generally, one will need to look for the shared libraries that Linux binaries depend on only the first few times that a Linux program is installed on FreeBSD. After a while, there will be a sufficient set of Linux shared libraries on the system to be able to run newly installed Linux binaries without any extra work.
ko: 일반적으로, 리눅스 바이너리가 의존하는 공유 라이브러리는 리눅스 프로그램을 FreeBSD에 처음 설치하는 몇 번만 찾으면 됩니다. 시간이 지나면 시스템에 추가 작업 없이 새로 설치된 Linux 바이너리를 실행할 수 있을 만큼 충분한 Linux 공유 라이브러리 세트가 있을 것입니다.
ru: Как правило, необходимость искать разделяемые библиотеки, от которых зависят Linux-бинарники, возникает только в первые несколько раз при установке Linux-программ на FreeBSD. Через некоторое время в системе накопится достаточный набор разделяемых библиотек Linux, что позволит запускать вновь устанавливаемые Linux-бинарники без дополнительных усилий.

source: Branding Linux ELF Binaries
ko: Linux ELF 바이너리 브랜딩하기
ru: Маркировка ELF-бинарников Linux

source: The FreeBSD kernel uses several methods to determine if the binary to be executed is a Linux one: it checks the brand in the ELF file header, looks for known ELF interpreter paths and checks ELF notes; finally, by default, unbranded ELF executables are assumed to be Linux anyway.
ru: Ядро FreeBSD использует несколько методов для определения, является ли запускаемый двоичный файл Linux-программой: оно проверяет бренд в заголовке ELF-файла, ищет известные пути к ELF-интерпретаторам и проверяет ELF-заметки; наконец, по умолчанию небрендированные ELF-исполняемые файлы в любом случае считаются Linux-программами.

source: Should all those methods fail, an attempt to execute the binary might result in error message:
ru: Если все эти методы не сработают, попытка выполнить двоичный файл может привести к сообщению об ошибке:

source: To help the FreeBSD kernel distinguish between a FreeBSD ELF binary and a Linux binary, use man:brandelf[1]:
ko: FreeBSD 커널이 FreeBSD ELF 바이너리와 리눅스 바이너리를 구별할 수 있도록 하려면, man:brandelf[1]를 사용합니다:
ru: Чтобы помочь ядру FreeBSD отличить ELF-программу FreeBSD от Linux-программы, используйте man:brandelf[1]:

source: Installing a Linux RPM Based Application
ko: Linux RPM 기반 애플리케이션 설치하기
ru: Установка приложения на основе Linux RPM

source: To install a Linux RPM-based application, first install the package:archivers/rpm4[] package or port. Once installed, `root` can use this command to install a [.filename]#.rpm#:
ko: Linux RPM 기반 애플리케이션을 설치하려면 먼저 package:archivers/rpm4[] 패키지 또는 포트를 설치합니다. 설치가 완료되면 `root`는 이 명령을 사용하여 [.filename]#.rpm#을 설치할 수 있습니다:
ru: Для установки приложения на основе RPM в Linux сначала установите пакет package:archivers/rpm4[] или порт. После установки пользователь `root` может использовать следующую команду для установки файла [.filename]#.rpm#:

source: If necessary, `brandelf` the installed ELF binaries. Note that this will prevent a clean uninstall.
ko: 필요한 경우 설치된 ELF 바이너리를`brandelf`합니다. 이렇게 하면 완전히 제거되지 않습니다.
ru: При необходимости выполните `brandelf` для установленных ELF-бинарников. Заметим, что это сделает невозможной чистую деинсталляцию.

source: Configuring the Hostname Resolver
ko: 호스트 네임 리졸버 구성하기
ru: Настройка преобразователя имен хостов

source: If DNS does not work or this error appears:
ko: DNS가 작동하지 않거나 이 오류가 표시되는 경우:
ru: Если DNS не работает или появляется эта ошибка:

source: configure [.filename]#/compat/linux/etc/host.conf# as follows:
ko: 다음과 같이 [.filename]#/compat/linux/etc/host.conf#을 구성합니다:
ru: Настройте файл [.filename]#/compat/linux/etc/host.conf# следующим образом:

source: This specifies that [.filename]#/etc/hosts# is searched first and DNS is searched second. When [.filename]#/compat/linux/etc/host.conf# does not exist, Linux applications use [.filename]#/etc/host.conf# in the host system but they complain since that file does not exist in FreeBSD. Remove `bind` if a name server is not configured using [.filename]#/etc/resolv.conf#.
ru: Это указывает, что сначала выполняется поиск в [.filename]#/etc/hosts#, а затем в DNS. Если [.filename]#/compat/linux/etc/host.conf# отсутствует, Linux-приложения используют [.filename]#/etc/host.conf# основной системы, но выдают ошибку, так как этот файл отсутствует в FreeBSD. Удалите `bind`, если сервер имён не настроен в [.filename]#/etc/resolv.conf#.

source: Miscellaneous
ko: 기타
ru: Разное

source: More information on how binary compatibility works with Linux(R) can be found in the article link:{linux-emulation}[Linux emulation in FreeBSD].
ru: Дополнительная информация о работе двоичной совместимости с Linux(R) доступна в статье link:{linux-emulation}[Эмуляция Linux в FreeBSD].

source: Chapter 11. Linux Binary Compatibility
ko: 11장. Linux 바이너리 호환성

source: FreeBSD provides optional binary compatibility with Linux(R), allowing users to install and run unmodified Linux binaries. It is available for the i386, amd64, and arm64 architectures.
ko: FreeBSD는 리눅스(R)와의 바이너리 호환성을 옵션으로 제공하여 사용자가 수정할 수 없는 리눅스 바이너리를 설치 및 실행할 수 있도록 합니다. i386, amd64 및 arm64 아키텍처에서 사용할 수 있습니다.

source: Some Linux-specific operating system features are not yet supported; this mostly happens with functionality specific to hardware or related to system management, such as cgroups or namespaces.
ko: 일부 Linux 특정 운영 체제 기능은 아직 지원되지 않으며, 이는 주로 하드웨어에 고유하거나 cgroups 또는 네임스페이스와 같은 시스템 관리와 관련된 기능에서 발생합니다.

source: By default, Linux binary compatibility is not enabled. To enable it at boot time, add this line to [.filename]#/etc/rc.conf#:
ko: 기본적으로 Linux 바이너리 호환성은 사용하도록 설정되어 있지 않습니다. 부팅 시 활성화하려면 [.filename]#/etc/rc.conf에 이 줄을 추가하세요:

source: Once enabled, it can be started without rebooting by running:
ko: 활성화되면 실행하여 재부팅하지 않고도 시작할 수 있습니다:

source: The [.filename]#/etc/rc.d/linux# script will load necessary kernel modules and mount filesystems expected by Linux applications under [.filename]#/compat/linux#. This is enough for statically linked Linux binaries to work. They can be started in the same way native FreeBSD binaries can; they behave almost exactly like native processes and can be traced and debugged the usual way.
ko: [.filename]#/etc/rc.d/linux# 스크립트는 필요한 커널 모듈을 로드하고 [.filename]#/compat/linux#에서 Linux 애플리케이션이 예상하는 파일 시스템을 마운트합니다. 이 정도면 정적으로 링크된 Linux 바이너리가 작동하기에 충분합니다. 네이티브 FreeBSD 바이너리와 동일한 방식으로 시작할 수 있으며, 네이티브 프로세스와 거의 동일하게 동작하고 일반적인 방법으로 추적 및 디버깅할 수 있습니다.
