Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/filtering-bridges/*.po
Languages: es_es, pt_br

source: # Things that we have kept state on before get to go through in a hurry add check-state # Throw away RFC 1918 networks add drop all from 10.0.0.0/8 to any in via fxp0 add drop all from 172.16.0.0/12 to any in via fxp0 add drop all from 192.168.0.0/16 to any in via fxp0 # Allow the bridge machine to say anything it wants # (if the machine is IP-less do not include these rows) add pass tcp from 1.2.3.4 to any setup keep-state add pass udp from 1.2.3.4 to any keep-state add pass ip from 1.2.3.4 to any # Allow the inside hosts to say anything they want add pass tcp from any to any in via xl0 setup keep-state add pass udp from any to any in via xl0 keep-state add pass ip from any to any in via xl0 # TCP section # Allow SSH add pass tcp from any to any 22 in via fxp0 setup keep-state # Allow SMTP only towards the mail server add pass tcp from any to relay 25 in via fxp0 setup keep-state # Allow zone transfers only by the slave name server [dns2.nic.it] add pass tcp from 193.205.245.8 to ns 53 in via fxp0 setup keep-state # Pass ident probes. It is better than waiting for them to timeout add pass tcp from any to any 113 in via fxp0 setup keep-state # Pass the "quarantine" range add pass tcp from any to any 49152-65535 in via fxp0 setup keep-state # UDP section # Allow DNS only towards the name server add pass udp from any to ns 53 in via fxp0 keep-state # Pass the "quarantine" range add pass udp from any to any 49152-65535 in via fxp0 keep-state # ICMP section # Pass 'ping' add pass icmp from any to any icmptypes 8 keep-state # Pass error messages generated by 'traceroute' add pass icmp from any to any icmptypes 3 add pass icmp from any to any icmptypes 11 # Everything else is suspect add drop log all from any to any
es_es: # Cosas para las que tenemos que mantener el estado add check-state # Desechar todas las redes RFC 1918 add drop all from 10.0.0.0/8 to any in via fxp0 add drop all from 172.16.0.0/12 to any in via fxp0 add drop all from 192.168.0.0/16 to any in via fxp0 # Permitir que la máquina bridge diga lo que quiera # (si la máquina es IP-less no incluya estas líneas) add pass tcp from 1.2.3.4 to any setup keep-state add pass udp from 1.2.3.4 to any keep-state add pass ip from 1.2.3.4 to any # Permitir que los hosts internos digan lo que quieran add pass tcp from any to any in via xl0 setup keep-state add pass udp from any to any in via xl0 keep-state add pass ip from any to any in via xl0 # Sección TCP # Permitir SSH add pass tcp from any to any 22 in via fxp0 setup keep-state # Permitir SMTP solo hacia el servidor de correo add pass tcp from any to relay 25 in via fxp0 setup keep-state # Permitir transferencias de zona solo por el servidor de nombres esclavo [dns2.nic.it] add pass tcp from 193.205.245.8 to ns 53 in via fxp0 setup keep-state # Dejar pasar ident probes. Es mejor que esperar a que se agote el tiempo add pass tcp from any to any 113 in via fxp0 setup keep-state # Dejar paso al rango "quarantine" add pass tcp from any to any 49152-65535 in via fxp0 setup keep-state # Sección UDP # Permitir DNS solo hacia el servidor de nombres add pass udp from any to ns 53 in via fxp0 keep-state # Dejar pasar el rango "quarantine" add pass udp from any to any 49152-65535 in via fxp0 keep-state # Sección ICMP # Dejar paso a 'ping' add pass icmp from any to any icmptypes 8 keep-state # Dejar paso a los mensajes de error generados por 'traceroute' add pass icmp from any to any icmptypes 3 add pass icmp from any to any icmptypes 11 # Todo lo demás es sospechoso. add drop log all from any to any
