Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/fonts/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019, 2020
pt_br: Jonas Ferreira, jonas.h.ferreira@me.com, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018

source: Fonts and FreeBSD
es_es: Tipos de letra y FreeBSD
pt_br: Fontes e FreeBSD

source: A Tutorial
es_es: Un tutorial
pt_br: Um Tutorial

source: $FreeBSD: head/en_US.ISO8859-1/articles/fonts/article.xml 52891 2019-03-23 04:50:01Z bcr $
es_es: $FreeBSD$

source: This document contains a description of the various font files that may be used with FreeBSD and the syscons driver, <application>X11</application>, <application>Ghostscript</application> and <application>Groff</application>. Cookbook examples are provided for switching the syscons display to 80x60 mode, and for using type 1 fonts with the above application programs.
es_es: Este documento contiene una descripción de los diversos archivos de tipos de letra que pueden utilizarse con FreeBSD y el controlador syscons, <application>X11</application>, <application>Ghostscript</application> y <application>Groff</application>. También incluye manuales paso a paso para cambiar la pantalla de syscons al modo 80x60 y para usar tipos de letra de Tipo 1 con los programas anteriores.
pt_br: Este documento contém a descrição de vários arquivos de fontes que podem ser usados no FreeBSD e no driver do console do sistema, <application>X11</application>, <application>Ghostscript</application> e <application>Groff</application>. Manuais passo-a-passo são fornecidos para alterar a exibição do console do sistema para o modo 80x60, e para usar fontes tipo 1 com os aplicativos acima.

source: Introduction
es_es: Introducción
pt_br: Introdução

source: There are many sources of fonts available, and one might ask how they might be used with FreeBSD. The answer can be found by carefully searching the documentation for the component that one would like to use. This is very time consuming, so this tutorial is an attempt to provide a shortcut for others who might be interested.
es_es: Hay muchos orígenes (sources) de tipos disponibles y a veces no es fácil discernir cómo usarlos en FreeBSD. La respuesta puede estar en la documentación del componente que desea utilizar, aunque puede llevar su tiempo dar con ella; este tutorial intenta proporcionar una solución a quienes puedan estar en esas circunstancias.
pt_br: Existem muitas origens de fontes disponíveis, e alguém pode questionar como elas podem ser utilizadas no FreeBSD. A resposta pode ser encontrada numa busca cuidadosa na documentação do componente onde você gostaria de utilizar a mesma. Isto pode consumir um bom tempo, portanto esse tutorial é uma tentativa de fornecer um atalho para outros que possam estar interessados.

source: Basic Terminology
es_es: Terminología básica

source: There are many different font formats and associated font file suffixes. A few that will be addressed here are:
es_es: Hay muchos formatos de tipos diferentes y sufijos de archivos de tipos asociados. En este artículo abordaremos unos cuantos:
pt_br: Existem muitos formatos diferentes de fontes e sufixos de arquivos de fontes associados. Alguns deles serão abordados aqui:

source: <trademark class="registered">PostScript</trademark> type 1 fonts. The <filename>.pfa</filename> is the <emphasis>A</emphasis>scii form and <filename>.pfb</filename> the <emphasis>B</emphasis>inary form.
es_es: Tipos Tipo 1 <trademark class="registered">PostScript</trademark> . <filename>.pfa</filename> es el formato <emphasis>A</emphasis>scii y el <filename>.pfb</filename> es el formato <emphasis>B</emphasis>inario.
pt_br: <trademark class="registered">PostScript</trademark> fonte tipo 1. O <filename>.pfa</filename> é o formato <emphasis>A</emphasis>scii e o <filename>.pfb</filename> é o formato <emphasis>B</emphasis>inário .

source: The font metrics associated with a type 1 font.
es_es: Métricas del tipo asociadas al tipo Tipo 1.
pt_br: As métricas da fonte associado com a fonte tipo 1.

source: The printer font metrics associated with a type 1 font.
es_es: Métricas de impresión del tipo asociadas al tipo Tipo 1.
pt_br: As métricas da fonte para impressora associadas com a fonte tipo 1.

source: A <trademark class="registered">TrueType</trademark> font
es_es: Tipo <trademark class="registered">TrueType</trademark>
pt_br: Uma fonte <trademark class="registered">TrueType</trademark>

source: An indirect reference to a TrueType font (not an actual font)
es_es: Una referencia indirecta a un tipo TrueType (no es un tipo real)
pt_br: Uma referência indireta para uma fonte TrueType (não é realmente uma fonte)

source: Bitmapped screen fonts
es_es: Tipos de pantalla de mapa de bits
pt_br: Fontes de tela bitmap

source: The <filename>.fot</filename> is used by <trademark class="registered">Windows</trademark> as sort of a symbolic link to the actual <trademark class="registered">TrueType</trademark> font (<filename>.ttf</filename>) file. The <filename>.fon</filename> font files are also used by Windows. I know of no way to use this font format with FreeBSD.
es_es: El archivo <filename>.fot</filename> se usan en <trademark class="registered">Windows</trademark> como una especie de enlace simbólico al archivo de tipo <trademark class="registered">TrueType</trademark> (<filename>.ttf</filename>). Los archivos de tipo <filename>.fon</filename> también se usan en Windows. No conozco ninguna manera de usar este formato de tipo en FreeBSD.

source: What Font Formats Can I Use?
es_es: ¿Qué formatos de tipo puedo usar?

source: Which font file format is useful depends on the application being used. FreeBSD by itself uses no fonts. Application programs and/or drivers may make use of the font files. Here is a small cross reference of application/driver to the font type suffixes:
es_es: Qué tipo se puede usar depende de la aplicación. FreeBSD por sí mismo no utiliza tipos. Las aplicaciones y/o los controladores pueden utilizar archivos de tipo. A continuación se muestra una pequeña referencia cruzada de la aplicación/controlador para los sufijos de tipo:
pt_br: Qual formato de arquivo de fonte é útil depende do aplicativo que está sendo usado. O FreeBSD por si só, não usa fontes. Aplicativos e/ou drivers podem fazer uso de arquivos de fontes. Aqui tem uma pequena referência cruzada de aplicação/driver para os sufixos de tipo de fonte:

source: Driver
es_es: Controlador

source: Application
es_es: Aplicación
pt_br: Aplicativo

source: The <filename>.fnt</filename> suffix is used quite frequently. I suspect that whenever someone wanted to create a specialized font file for their application, more often than not they chose this suffix. Therefore, it is likely that files with this suffix are not all the same format; specifically, the <filename>.fnt</filename> files used by syscons under FreeBSD may not be the same format as a <filename>.fnt</filename> one encounters in the <trademark class="registered">MS-DOS</trademark>/<trademark class="registered">Windows</trademark> environment. I have not made any attempt at using other <filename>.fnt</filename> files other than those provided with FreeBSD.
es_es: La extensión <filename>.fnt</filename> es bastante común. Sospecho que la mayoría de las veces en las que alguien quería crear un archivo de tipo especializado para su aplicación elegían esta extensión. Por lo tanto es probable que no todos los archivos que incluyen esta extensión tengan el mismo formato; en concreto los archivos <filename>.fnt</filename> que usa syscons en FreeBSD pueden no tener el mismo formato que un archivo <filename>.fnt</filename> en <trademark class="registered">MS-DOS</trademark>/<trademark class="registered">Windows</trademark>. No he intentado utilizar otros archivos <filename>.fnt</filename> que no sean los suministrados con FreeBSD.

source: Setting a Virtual Console to 80x60 Line Mode
es_es: Configuración de una consola virtual en modo de línea 80x60

source: First, an 8x8 font must be loaded. To do this, <filename>/etc/rc.conf</filename> should contain the line (change the font name to an appropriate one for your locale):
es_es: En primer lugar se debe cargar un tipo 8x8. El archivo <filename>/etc/rc.conf</filename> debe tener la línea (cambie el nombre del tipo por el que sea más apropiado en su región):
pt_br: Primeiro, uma fonte 8x8 deve ser carregada. Para fazer isso, <filename>/etc/rc.conf</filename> deve conter a linha (altere o nome da fonte para uma apropriada para a sua região):

source: font8x8="iso-8x8" # font 8x8 from /usr/share/syscons/fonts/* (or NO).
es_es: font8x8="iso-8x8" # tipo 8x8 de /usr/share/syscons/fonts/* (o NO para cargar el tipo por defecto).

source: The command to actually switch the mode is <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>:
es_es: El comando para cambiar el modo es <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>:
pt_br: O comando para alterar o modo é <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>:

source: Various screen-oriented programs, such as <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, must be able to determine the current screen dimensions. As this is achieved this through <command>ioctl</command> calls to the console driver (such as <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>) they will correctly determine the new screen dimensions.
es_es: Varios programas screen-oriented como <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry> pueden determinar el tamaño de la pantalla mediante una llamada de <command>ioctl</command> al controlador de la consola (por ejemplo <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>) que determinará correctamente las nuevas dimensiones de la pantalla.
pt_br: Vários programas orientados à tela, como o <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, devem ser capazes de determinar a dimensão corrente da tela. Como isto é conseguido através de uma chamada do <command>ioctl</command> para o driver do console (tal como o <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>) ele irá determinar corretamente as dimensões da nova tela.

source: To make this more seamless, one can embed these commands in the startup scripts so it takes place when the system boots. To do this is add this line to <filename>/etc/rc.conf</filename>.
es_es: Para hacerlo más sencillo puede añadir estos comandos a los scripts de inicio del sistema para que se ejecuten en el inicio. Agregue esta línea en el archivo <filename>/etc/rc.conf</filename>.

source: allscreens_flags="VGA_80x60" # Set this vidcontrol mode for all virtual screens
es_es: allscreens_flags="VGA_80x60" # Establecer el modo vidcontrol para todas las pantallas virtuales

source: References: <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Referencias: <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Referências: <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Using Type 1 Fonts with <application>X11</application>
es_es: Uso de tipos Type 1 con <application>X11</application>

source: <application>X11</application> can use either the <filename>.pfa</filename> or the <filename>.pfb</filename> format fonts. The <application>X11</application> fonts are located in various subdirectories under <filename>/usr/X11R6/lib/X11/fonts</filename>. Each font file is cross referenced to its <application>X11</application> name by the contents of <filename>fonts.dir</filename> in each directory.
es_es: <application>X11</application> puede utilizar tanto el formato <filename>.pfa</filename> como el formato <filename>.pfb</filename>. Los tipos para <application>X11</application> se encuentran en varios subdirectorios bajo <filename>/usr/X11R6/lib/X11/fonts</filename>. Cada tipo es una referencia cruzada entre su nombre <application>X11</application> y el contenido del archivo <filename>fonts.dir</filename> en cada directorio.

source: There is already a directory named <filename>Type1</filename>. The most straight forward way to add a new font is to put it into this directory. A better way is to keep all new fonts in a separate directory and use a symbolic link to the additional font. This allows one to more easily keep track of ones fonts without confusing them with the fonts that were originally provided. For example:
es_es: Ya existe un directorio llamado <filename>Type1</filename>. La forma más sencilla de añadir un nuevo tipo es ponerla en ese directorio. Una forma aun mejor sería colocar todos los tipos que quiera añadir en un directorio separado y utilizar un enlace simbólico a los tipos adicionales. Esto permite identificar los tipos sin mezclarlos con los originales. Por ejemplo:
pt_br: Já existe um diretório chamado <filename>Type1</filename>. A forma mais direta de adicionar uma nova fonte é colocá-la nesse diretório. Uma forma melhor seria colocar todas as novas fontes num diretório separado e usar um link simbólico para as fontes adicionais. Isso permite identificar as fontes sem confundir com aquelas que são originalmente fornecidas. Por exemplo:

source: <lineannotation>Create a directory to contain the font files</lineannotation> <prompt>%</prompt> <userinput>mkdir -p /usr/local/share/fonts/type1</userinput> <prompt>%</prompt> <userinput>cd /usr/local/share/fonts/type1</userinput> <lineannotation>Place the .pfa, .pfb and .afm files here</lineannotation> <lineannotation>One might want to keep readme files, and other documentation</lineannotation> <lineannotation>for the fonts here also</lineannotation> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.pfb .</userinput> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.afm .</userinput> <lineannotation>Maintain an index to cross reference the fonts</lineannotation> <prompt>%</prompt> <userinput>echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat &gt;&gt;INDEX</userinput>
es_es: <lineannotation>Crear un directorio para alojar los archivos de tipos.</lineannotation> <prompt>%</prompt> <userinput>mkdir -p /usr/local/share/fonts/type1</userinput> <prompt>%</prompt> <userinput>cd /usr/local/share/fonts/type1</userinput> <lineannotation>Coloque los archivos .pfa, .pfb y .afm aquí</lineannotation> <lineannotation>Puede incluir también los archivos README, así como la documentación</lineannotation> <lineannotation>de los tipos</lineannotation> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.pfb .</userinput> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.afm .</userinput> <lineannotation>Así se mantiene el índice para la referencia cruzada de los tipos</lineannotation> <prompt>%</prompt> <userinput>echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat &gt;&gt;INDEX</userinput>
pt_br: <lineannotation>Cria um diretório para armazenar os arquivos de fonte</lineannotation> <prompt>%</prompt> <userinput>mkdir -p /usr/local/share/fonts/type1</userinput> <prompt>%</prompt> <userinput>cd /usr/local/share/fonts/type1</userinput> <lineannotation>Coloque os arquivos .pfa, .pfb and .afm aqui</lineannotation> <lineannotation>Pode-se querer manter os arquivos readme, e outras documentações</lineannotation> <lineannotation>para as fontes aqui</lineannotation> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.pfb .</userinput> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.afm .</userinput> <lineannotation>Mantenha um índice para a referência cruzada das fontes</lineannotation> <prompt>%</prompt> <userinput>echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat &gt;&gt;INDEX</userinput>

source: Now, to use a new font with <application>X11</application>, one must make the font file available and update the font name files. The <application>X11</application> font names look like:
es_es: Para poder usar el nuevo tipo en <application>X11</application> debe hacer que el archivo de tipo esté disponible y actualizar el nombre del tipo. Los nombres de los tipos de <application>X11</application> tienen este aspecto:
pt_br: Agora, para usar a nova fonte com o <application>X11</application>, deve-se tornar os arquivos de fonte disponíveis e atualizados. Os nomes de fontes do <application>X11</application> se parecem com:

source: -bitstream-charter-medium-r-normal-xxx-0-0-0-0-p-0-iso8859-1 | | | | | | | | | | | | \ \ | | | | | \ \ \ \ \ \ \ +----+- character set | | | | \ \ \ \ \ \ \ +- average width | | | | \ \ \ \ \ \ +- spacing | | | \ \ \ \ \ \ +- vertical res. | | | \ \ \ \ \ +- horizontal res. | | | \ \ \ \ +- points | | | \ \ \ +- pixels | | | \ \ \ foundry family weight slant width additional style
es_es: -bitstream-charter-medium-r-normal-xxx-0-0-0-0-p-0-iso8859-1 | | | | | | | | | | | | \ \ | | | | | \ \ \ \ \ \ \ +----+- juego de caracteres | | | | \ \ \ \ \ \ \ +- ancho promedio | | | | \ \ \ \ \ \ +- espaciado | | | \ \ \ \ \ \ +- resolución vertical. | | | \ \ \ \ \ +- resolución horizontal. | | | \ \ \ \ +- puntos | | | \ \ \ +- píxeles | | | \ \ \ tipo familia densidad inclinación anchura estilo adicional

source: A new name needs to be created for each new font. If you have some information from the documentation that accompanied the font, then it could serve as the basis for creating the name. If there is no information, then you can get some idea by using <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry> on the font file. For example:
es_es: Cada nuevo tipo necesita tener un nombre específico. Si en la documentación que acompaña al tipo encuentra la información requerida puede usarla como base para crear el nombre. Si no hay información puede hacerse una idea utilizando el comando <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry> en el tipo. Por ejemplo:
pt_br: Um novo nome precisa ser criado para cada nova fonte. Se você possui alguma informação na documentação que acompanha a fonte, então isso pode servir de base para a criação do nome. Se não há informação, então você pode ter alguma idéia usando <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry> no arquivo da fonte. Por exemplo:

source: Using this information, a possible name might be:
es_es: Basándonos esta información podríamos usar un nombre como este:
pt_br: Usando essas informações, um possível nome poderia ser:

source: The components of our name are:
es_es: Los componentes de nuestro nombre son:
pt_br: Os componentes do nosso nome são:

source: Foundry
es_es: Tipo
pt_br: Companhia

source: Lets just name all the new fonts <literal>type1</literal>.
es_es: Vamos a nombrar todos los tipos nuevos como <literal>type1</literal>.
pt_br: Vamos nomear todas as novas fontes como <literal>type1</literal>.

source: Family
es_es: Familia
pt_br: Família

source: The name of the font.
es_es: El nombre del tipo.
pt_br: O nome da fonte

source: Weight
es_es: Densidad
pt_br: Densidade

source: Normal, bold, medium, semibold, etc. From the <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry> output above, it appears that this font has a weight of <emphasis>medium</emphasis>.
es_es: Normal, negrita, media, seminegrita, etc. En la salida del comando <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry> que acabamos de mostrar vemos que este tipo tiene una densidad <emphasis>media</emphasis>.
pt_br: Normal, negrito, média, semi-negrito, etc. Pelas informações acima do <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry>, essa fonte aparenta ter uma densidade <emphasis>média</emphasis>.

source: Slant
es_es: Inclinación
pt_br: Inclinação

source: <emphasis remap="bf">r</emphasis>oman, <emphasis remap="bf">i</emphasis>talic, <emphasis remap="bf">o</emphasis>blique, etc. Since the <emphasis>ItalicAngle</emphasis> is zero, <emphasis>roman</emphasis> will be used.
es_es: <emphasis remap="bf">r</emphasis>oman, <emphasis remap="bf">c</emphasis>ursiva, <emphasis remap="bf">o</emphasis>blicua, etc. Dado que <emphasis>ItalicAngle</emphasis> es cero, se utilizará <emphasis>roman</emphasis>.
pt_br: <emphasis remap="bf">r</emphasis>oman, <emphasis remap="bf">i</emphasis>tálico, <emphasis remap="bf">o</emphasis>blíquo, etc. Como o <emphasis>Ângulo Itálico</emphasis> é zero, o <emphasis>roman</emphasis> será utilizado.

source: Width
es_es: Anchura
pt_br: Largura

source: Normal, wide, condensed, extended, etc. Until it can be examined, the assumption will be <emphasis>normal</emphasis>.
es_es: Normal, ancha, condensada, extendida, etc. Hasta que pueda ser examinada, suponemos que será <emphasis>normal</emphasis>.
pt_br: Normal, ampla, condensada, estendida, etc. Até que possa ser examinada, supomos que será <emphasis>normal</emphasis>.

source: Additional style
es_es: Estilo adicional
pt_br: Estilo Adicional

source: Usually omitted, but this will indicate that the font contains decorative capital letters.
es_es: Generalmente se omite, pero esto indicará que el tipo contiene mayúsculas decorativas.
pt_br: Frequentemente omitido, mas isso indicará que a fonte possui letras maiúsculas decorativas.

source: Spacing
es_es: Espaciado
pt_br: Espaçamento

source: proportional or monospaced. <emphasis>Proportional</emphasis> is used since <emphasis>isFixedPitch</emphasis> is false.
es_es: proporcional o monoespaciado. La opción <emphasis>Proportional</emphasis> se usa cuando <emphasis>isFixedPitch</emphasis> es false.
pt_br: proporcional ou monoespaçada. A opção <emphasis>Poporcional</emphasis> é usada quando o <emphasis> isFixedPitch </emphasis> é falso.
