Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/fonts/*.po
Languages: es_es, pt_br

source: All of these names are arbitrary, but one should strive to be compatible with the existing conventions. A font is referenced by name with possible wild cards by an <application>X11</application> program, so the name chosen should make some sense. One might begin by simply using <_:informalexample-1/> as the name, and then use <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry> to examine it and adjust the name based on the appearance of the font.
es_es: Todos estos nombres son arbitrarios, pero uno debe tratar de ser compatible con las convenciones existentes. El nombre hace referencia al tipo con posibles comodines del programa <application>X11</application>, por lo que el nombre elegido debe tener algún sentido. Simplemente puede comenzar a usar <_:informalexample-1/> como nombre, y luego usar <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry> para examinarla y ajustar el nombre en función de la apariencia del tipo.
pt_br: Todos esses nomes são arbitrários, mas deve-se tentar ser compatível com as convenções existentes. A fonte é referenciada pelo nome com possíveis curingas pelo programa <application>X11</application>, então o nome escolhido tem que fazer algum sentido. Pode-se começar simplesmente usando <_:informalexample-1/> como o nome, e então usar <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry> para examiná-lo e ajustar o nome com base na aparência da fonte.

source: So, to complete our example:
es_es: Para completar nuestro ejemplo:
pt_br: Então, para completar nosso exemplo:

source: <lineannotation>Make the font accessible to X11</lineannotation> <prompt>%</prompt> <userinput>cd /usr/X11R6/lib/X11/fonts/Type1</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edit fonts.dir and fonts.scale, adding the line describing the font and incrementing the number of fonts which is found on the first line.</lineannotation> <prompt>%</prompt> <userinput>ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq</userinput> <lineannotation>fonts.scale seems to be identical to fonts.dir…</lineannotation> <prompt>%</prompt> <userinput>cp fonts.dir fonts.scale</userinput> <lineannotation>Tell X11 that things have changed</lineannotation> <prompt>%</prompt> <userinput>xset fp rehash</userinput> <lineannotation>Examine the new font</lineannotation> <prompt>%</prompt> <userinput>xfontsel -pattern -type1-*</userinput>
es_es: <lineannotation>Haga que el tipo esté accesible para X11</lineannotation> <prompt>%</prompt> <userinput>cd /usr/X11R6/lib/X11/fonts/Type1</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edite fonts.dir y fonts.scale, agregando la línea que describe el tipo e incrementando el número de tipos que se encuentran en la primera línea.</lineannotation> <prompt>%</prompt> <userinput>ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq</userinput> <lineannotation>fonts.scale parece ser idéntico a fonts.dir…</lineannotation> <prompt>%</prompt> <userinput>cp fonts.dir fonts.scale</userinput> <lineannotation>Indique a X11 que las cosas han cambiado</lineannotation> <prompt>%</prompt> <userinput>xset fp rehash</userinput> <lineannotation>Examine el nuevo tipo</lineannotation> <prompt>%</prompt> <userinput>xfontsel -pattern -type1-*</userinput>
pt_br: <lineannotation>Torne a fonte acessível para o X11</lineannotation> <prompt>%</prompt> <userinput>cd /usr/X11R6/lib/X11/fonts/Type1</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edite os arquivos fonts.dir e fonts.scale, adicionando a linha que descreve a fonte e incremente o número de fontes que são encontradas na primeira linha.</lineannotation> <prompt>%</prompt> <userinput>ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq</userinput> <lineannotation>fonts.scale aparenta ser idêntico ao fonts.dir…</lineannotation> <prompt>%</prompt> <userinput>cp fonts.dir fonts.scale</userinput> <lineannotation>Informe ao X11 que arquivos foram alterados</lineannotation> <prompt>%</prompt> <userinput>xset fp rehash</userinput> <lineannotation>Examine a nova fonte</lineannotation> <prompt>%</prompt> <userinput>xfontsel -pattern -type1-*</userinput>

source: References: <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry vendor="xfree86"><refentrytitle>xset</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citetitle>The X Windows System in a Nutshell</citetitle>, <link xlink:href="http://www.ora.com/">O'Reilly &amp; Associates</link>.
es_es: Referencias: <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry vendor="xfree86"><refentrytitle>xset</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citetitle>The X Windows System in a Nutshell</citetitle>, <link xlink:href="http://www.ora.com/">O'Reilly &amp; Associates</link>.
pt_br: Referências: <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry vendor="xfree86"><refentrytitle>xset</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citetitle>The X Windows System in a Nutshell</citetitle>, <link xlink:href="http://www.ora.com/">O'Reilly &amp; Associates</link>.

source: Using Type 1 Fonts with Ghostscript
es_es: Uso de tipos Type 1 con Ghostscript

source: <application>Ghostscript</application> references a font via its <filename>Fontmap</filename>. This must be modified in a similar way to the <application>X11</application> <filename>fonts.dir</filename>. <application>Ghostscript</application> can use either the <filename>.pfa</filename> or the <filename>.pfb</filename> format fonts. Using the font from the previous example, here is how to use it with <application>Ghostscript</application>:
es_es: <application>Ghostscript</application> hace referencia a un tipo a través de su archivo <filename>Fontmap</filename>. Para modificarlo hay que proceder de forma parecida a cuando mofidicamos el archivo <filename>fonts.dir</filename> de <application>X11</application>. <application>Ghostscript</application> puede usar los formatos <filename>.pfa</filename> y <filename>.pfb</filename>. A continuación ofrecemos una guía paso a paso en la que usaremos el tipo anterior para mostrar cómo usarla con <application>Ghostscript</application>:

source: <lineannotation>Put the font in Ghostscript's font directory</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/fonts</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edit Fontmap so Ghostscript knows about the font</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/4.01</userinput> <prompt>%</prompt> <userinput>ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq</userinput> <lineannotation>Use Ghostscript to examine the font</lineannotation> <prompt>%</prompt> <userinput>gs prfont.ps</userinput> Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS&gt;<userinput>Showboat DoFont</userinput> Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; GS&gt;<userinput>quit</userinput>
es_es: <lineannotation>Coloque el tipo en el directorio de tipos de Ghostscript</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/fonts</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edite el archivo Fontmap para que Ghostscript esté al corriente del tipo</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/4.01</userinput> <prompt>%</prompt> <userinput>ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq</userinput> <lineannotation>Use Ghostscript para examinar el tipo</lineannotation> <prompt>%</prompt> <userinput>gs prfont.ps</userinput> Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS&gt;<userinput>Showboat DoFont</userinput> Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; GS&gt;<userinput>quit</userinput>
pt_br: <lineannotation>Coloque a fonte no diretório do Ghostscript</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/fonts</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edite o mapeamento de fontes, assim o Ghostscript saberá sobre a fonte</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/4.01</userinput> <prompt>%</prompt> <userinput>ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq</userinput> <lineannotation>Use o Ghostscript para checar a fonte</lineannotation> <prompt>%</prompt> <userinput>gs prfont.ps</userinput> Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS&gt;<userinput>Showboat DoFont</userinput> Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; GS&gt;<userinput>quit</userinput>

source: References: <filename>fonts.txt</filename> in the <application>Ghostscript 4.01</application> distribution
es_es: Referencias: consulte el archivo <filename>fonts.txt</filename> en la distribución <application>4.01 de Ghostscript</application>
pt_br: Referências: Veja o arquivo <filename>fonts.txt</filename> na distribuição do <application>Ghostscript 4.01</application>

source: Using Type 1 Fonts with Groff
es_es: Uso de tipos Type 1 con Groff

source: Now that the new font can be used by both <application>X11</application> and <application>Ghostscript</application>, how can one use the new font with <application>groff</application>? First of all, since we are dealing with type 1 <trademark class="registered">PostScript</trademark> fonts, the <application>groff</application> device that is applicable is the <emphasis>ps</emphasis> device. A font file must be created for each font that <application>groff</application> can use. A <application>groff</application> font name is just a file in <filename>/usr/share/groff_font/devps</filename>. With our example, the font file could be <filename>/usr/share/groff_font/devps/SHOWBOAT</filename>. The file must be created using tools provided by <application>groff</application>.
es_es: Ahora que el nuevo tipo puede ser utilizada tanto por <application>X11</application> como por <application>Ghostscript</application> ¿cómo se puede usar el nuevo tipo con <application>groff</application>? En primer lugar y dado que estamos utilizando tipos <trademark class="registered">PostScript</trademark> type 1, el dispositivo <application>groff</application> que vamos a usar es <emphasis>ps</emphasis>. Se debe crear un archivo de tipo para cada tipo que queramos usar con <application>groff</application>. Un nombre de tipo para <application>groff</application> es simplemente un archivo en el directorio <filename>/usr/share/groff_font/devps</filename>. Siguiendo con nuestro ejemplo, el archivo del tipo sería <filename>/usr/share/groff_font/devps/SHOWBOAT</filename>. El archivo debe crearse utilizando las herramientas proporcionadas por <application>groff</application>.
pt_br: Agora que a nova fonte pode ser utilizada tanto pelo <application>X11</application> quanto pelo <application>Ghostscript</application>, como podemos utilizar a nova fonte com o <application>groff</application>? Primeiro de tudo, como estamos usando fontes Type 1 <trademark class="registered">PostScript</trademark>, o dispositivo <application>groff</application> que é aplicável é o device <emphasis>ps</emphasis>. Um arquivo de fonte deve ser criado para cada fonte que o <application>groff</application> possa usar. Um nome de fonte <application>groff</application> é apenas um arquivo no <filename>/usr/share/groff_font/devps</filename>. Com o nosso exemplo, o arquivo da fonte poderia ser <filename>/usr/share/groff_font/devps/SHOWBOAT</filename>. O arquivo deve ser criado usando ferramentas providas pelo <application>groff</application>.

source: The first tool is <command>afmtodit</command>. This is not normally installed, so it must be retrieved from the source distribution. I found I had to change the first line of the file, so I did:
es_es: La primera herramienta es <command>afmtodit</command>. No está instalada por defecto, pero puede encontrarla en la distribución original. Descubrí que tenía que cambiar la primera línea del archivo, así que procedí del siguiente modo:
pt_br: A primeira ferramenta é o <command>afmtodit</command>. Ela normalmente não está instalada, então deve ser baixada de uma fonte de distribuição. Eu percebi que teria que mudar a primeira linha do arquivo, então eu fiz:

source: This tool will create the <application>groff</application> font file from the metrics file (<filename>.afm</filename> suffix.) Continuing with our example:
es_es: Esta herramienta creará el archivo de tipo <application>groff</application> a partir del archivo de métricas (sufijo <filename>.afm</filename>). Siguiendo con nuestro ejemplo:
pt_br: Essa ferramenta irá criar o arquivo de fontes do <application>groff</application> a partir dos arquivos de métrica (<filename>.afm</filename> suffix.) Continuando com nosso exemplo:

source: <lineannotation>Many .afm files are in Mac format… ^M delimited lines We need to convert them to <trademark class="registered">UNIX</trademark> style ^J delimited lines</lineannotation> <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' &gt;showboat.afm</userinput> <lineannotation>Now create the groff font file</lineannotation> <prompt>%</prompt> <userinput>cd /usr/share/groff_font/devps</userinput> <prompt>%</prompt> <userinput>/tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT</userinput>
es_es: <lineannotation>Muchos archivos .afm están en formato Mac, con ^M delimitando las líneas Tenemos que convertirlos al estilo <trademark class="registered">UNIX</trademark> que delimita las líneas con ^J</lineannotation> <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' &gt;showboat.afm</userinput> <lineannotation>Ahora cree el archivo de tipo groff</lineannotation> <prompt>%</prompt> <userinput>cd /usr/share/groff_font/devps</userinput> <prompt>%</prompt> <userinput>/tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT</userinput>
pt_br: <lineannotation>Muitos arquivos .afm estão no formato do Mac, com ^M delimitando as linhas Nós temos que convertê-los para o estilo <trademark class="registered">UNIX</trademark> que delimita as linhas com ^J</lineannotation> <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' &gt;showboat.afm</userinput> <lineannotation>Agora crie um arquivo de fonte groff</lineannotation> <prompt>%</prompt> <userinput>cd /usr/share/groff_font/devps</userinput> <prompt>%</prompt> <userinput>/tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT</userinput>

source: The font can now be referenced with the name SHOWBOAT.
es_es: Ahora se puede hacer referencia al tipo con el nombre SHOWBOAT.
pt_br: A fonte agora pode ser referenciada pelo nome SHOWBOAT.

source: If <application>Ghostscript</application> is used to drive the printers on the system, then nothing more needs to be done. However, if true <trademark class="registered">PostScript</trademark> printers are used, then the font must be downloaded to the printer in order for the font to be used (unless the printer happens to have the showboat font built in or on an accessible font disk.) The final step is to create a downloadable font. The <command>pfbtops</command> tool is used to create the <filename>.pfa</filename> format of the font, and <filename>download</filename> is modified to reference the new font. The <filename>download</filename> must reference the internal name of the font. This can easily be determined from the groff font file as illustrated:
es_es: Si se usa <application>Ghostscript</application> con las impresoras del sistema no es necesario hacer nada más. Sin embargo si las impresoras usan <trademark class="registered">PostScript</trademark> el tipo se debe descargar a la impresora para poder usarse (a menos que la impresora tenga el tipo showboat incorporado o pueda acceder a una unidad en la que esté .) El último paso es crear un tipo descargable. La herramienta <command>pfbtops</command> se utiliza para crear el formato de tipo <filename>.pfa</filename> y el archivo <filename>download</filename> se modifica para hacer referencia al nuevo tipo. El archivo <filename>download</filename> debe hacer referencia al nombre interno del tipo. Esto se puede determinar fácilmente a partir del archivo de tipo de groff como vemos a continuación:

source: <lineannotation>Create the .pfa font file</lineannotation> <prompt>%</prompt> <userinput>pfbtops /usr/local/share/fonts/type1/showboat.pfb &gt;showboat.pfa</userinput>
es_es: <lineannotation>Cree el archivo de tipo .pfa</lineannotation> <prompt>%</prompt> <userinput>pfbtops /usr/local/share/fonts/type1/showboat.pfb &gt;showboat.pfa</userinput>
pt_br: <lineannotation>Criando o arquivo de fonte .pfa</lineannotation> <prompt>%</prompt> <userinput>pfbtops /usr/local/share/fonts/type1/showboat.pfb &gt;showboat.pfa</userinput>

source: Of course, if <filename>.pfa</filename> is already available, just use a symbolic link to reference it.
es_es: Por supuesto, si el archivo <filename>.pfa</filename> ya existe, simplemente cree un enlace simbólico para referenciarlo.

source: <lineannotation>Get the internal font name</lineannotation> <prompt>%</prompt> <userinput>fgrep internalname SHOWBOAT</userinput> internalname Showboat <lineannotation>Tell groff that the font must be downloaded</lineannotation> <prompt>%</prompt> <userinput>ex download :$a Showboat showboat.pfa . :wq</userinput>
es_es: <lineannotation>Obtener el nombre interno del tipo</lineannotation> <prompt>%</prompt> <userinput>fgrep internalname SHOWBOAT</userinput> internalname Showboat <lineannotation>Indique a groff que el tipo debe ser descargado</lineannotation> <prompt>%</prompt> <userinput>ex download :$a Showboat showboat.pfa . :wq</userinput>
pt_br: <lineannotation>Obtendo o nome interno da fonte</lineannotation> <prompt>%</prompt> <userinput>fgrep internalname SHOWBOAT</userinput> internalname Showboat <lineannotation>Dizendo ao groff que tem que fazer o download da fonte</lineannotation> <prompt>%</prompt> <userinput>ex download :$a Showboat showboat.pfa . :wq</userinput>

source: To test the font:
es_es: Para probar el tipo:
pt_br: Para testar a fonte:

source: <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat &gt;example.t &lt;&lt;EOF .sp 5 .ps 16 This is an example of the Showboat font: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R To use it for the first letter of a paragraph, it will look like: .sp 50p \s(48\f5H\s0\fRere is the first sentence of a paragraph that uses the showboat font as its first letter. Additional vertical space must be used to allow room for the larger letter. EOF</userinput> <prompt>%</prompt> <userinput>groff -Tps example.t &gt;example.ps</userinput> <lineannotation>To use ghostscript/ghostview</lineannotation> <prompt>%</prompt> <userinput>ghostview example.ps</userinput> <lineannotation>To print it</lineannotation> <prompt>%</prompt> <userinput>lpr -Ppostscript example.ps</userinput>
es_es: <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat &gt;example.t &lt;&lt;EOF .sp 5 .ps 16 This is an example of the Showboat font: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R To use it for the first letter of a paragraph, it will look like: .sp 50p \s(48\f5H\s0\fRere is the first sentence of a paragraph that uses the showboat font as its first letter. Additional vertical space must be used to allow room for the larger letter. EOF</userinput> <prompt>%</prompt> <userinput>groff -Tps example.t &gt;example.ps</userinput> <lineannotation>Para utilizar ghostscript/ghostview</lineannotation> <prompt>%</prompt> <userinput>ghostview example.ps</userinput> <lineannotation>Para imprimir</lineannotation> <prompt>%</prompt> <userinput>lpr -Ppostscript example.ps</userinput>
pt_br: <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat &gt;example.t &lt;&lt;EOF .sp 5 .ps 16 This is an example of the Showboat font: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R To use it for the first letter of a paragraph, it will look like: .sp 50p \s(48\f5H\s0\fRere is the first sentence of a paragraph that uses the showboat font as its first letter. Additional vertical space must be used to allow room for the larger letter. EOF</userinput> <prompt>%</prompt> <userinput>groff -Tps example.t &gt;example.ps</userinput> <lineannotation>Para usar ghostscript/ghostview</lineannotation> <prompt>%</prompt> <userinput>ghostview example.ps</userinput> <lineannotation>Para imprimí-la</lineannotation> <prompt>%</prompt> <userinput>lpr -Ppostscript example.ps</userinput>
