Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/fonts/*.po
Languages: es_es, pt_br

source: References: <filename>/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man</filename>, <citerefentry><refentrytitle>groff_font</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>groff_char</refentrytitle><manvolnum>7</manvolnum></citerefentry>, <citerefentry><refentrytitle>pfbtops</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Referencias: <filename>/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man</filename>, <citerefentry><refentrytitle>groff_font</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>groff_char</refentrytitle><manvolnum>7</manvolnum></citerefentry>, <citerefentry><refentrytitle>pfbtops</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Referências: <filename>/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man</filename>, <citerefentry><refentrytitle>groff_font</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>groff_char</refentrytitle><manvolnum>7</manvolnum></citerefentry>, <citerefentry><refentrytitle>pfbtops</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Converting TrueType Fonts to a groff/PostScript Format For groff
es_es: Conversión de tipos TrueType a un formato groff/PostScript para groff

source: This potentially requires a bit of work, simply because it depends on some utilities that are not installed as part of the base system. They are:
es_es: Esto puede llevar un poco de trabajo por la sencilla razón de que depende de algunas herramientas que no se instalan como parte del sistema base:
pt_br: Isso potencialmente requer um pouco de trabalho, simplesmente porque depende de alguns utilitários que não são instalados como parte do sistema base. Eles são:

source: TrueType to PostScript conversion utilities. This allows conversion of a TrueType font to an ascii font metric (<filename>.afm</filename>) file.
es_es: Herramientas de conversión de TrueType a PostScript. Esto permite la conversión de tipos TrueType a archivos de métrica de tipo ascii (<filename>.afm</filename>).
pt_br: Utilitário de conversão TrueType para PostScript. Ee permite a conversão de uma fonte TrueType em um arquivo de métrica de fonte ascii (<filename>.afm</filename>).

source: Currently available at <uri xlink:href="http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/">http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/</uri>. Note: These files are PostScript programs and must be downloaded to disk by holding down <keycap>Shift</keycap> when clicking on the link. Otherwise, your browser may try to launch <application>ghostview</application> to view them.
es_es: Disponible en <uri xlink:href="http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/">http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/</uri>. Nota: Estos ficheros son programas PostScript y deben descargarse manteniendo la tecla <keycap>Shift</keycap> cuando haga clic en el enlace. De lo contrario su navegador puede intentar arrancar <application>ghostview</application> para verlos.

source: The files of interest are:
es_es: Los archivos importantes para esta tarea son:
pt_br: Os arquivos de interesse são:

source: The funny upper/lower case is due to their being intended also for DOS shells. <filename>ttf2pf.ps</filename> makes use of the others as upper case, so any renaming must be consistent with this. (Actually, <filename>GS_TTF.PS</filename> and <filename>PFS2AFM.PS</filename> are supposedly part of the <application>Ghostscript</application> distribution, but it is just as easy to use these as an isolated utility. FreeBSD does not seem to include the latter.) You also may want to have these installed to <filename>/usr/local/share/groff_font/devps</filename>(?).
es_es: Todo este lío de mayúsculas y minúsculas en los nombres es porque se tiene en cuenta las shells de DOS. <filename>ttf2pf.ps</filename> utiliza el resto como mayúsculas, por lo que cualquier cambio de nombre debe tener esto en cuenta. (En realidad, <filename>GS_TTF.PS</filename> y <filename>PFS2AFM.PS</filename> son parte de la distribución de <application>Ghostscript</application>, pero se pueden usar como herramientas independientes. FreeBSD no incluye esta última.) También puede ser que las instale (usted) en <filename>/usr/local/share/groff_font/devps</filename>(?).
pt_br: O caso engraçado sobre maiúsculas/minúsculas é devido ao fato de serem destinados também para os terminais DOS. O <filename>ttf2pf.ps</filename> faz uso dos outros como maiúsculos, portanto, qualquer renomeação deve ser consistente com isso. (Na verdade, <filename>GS_TTF.PS</filename> e <filename>PFS2AFM.PS</filename> são supostamente parte da distribuição <application>Ghostscript</application>, mas é muito fácil usá-los como utilitários isolados. O FreeBSD parece não incluir o último.) Você também pode querer instalá-los em <filename>/usr/local/share/groff_font/devps</filename> (?).

source: Creates font files for use with <application>groff</application> from ascii font metrics file. This usually resides in the directory, <filename>/usr/src/contrib/groff/afmtodit</filename>, and requires some work to get going.
es_es: Crea archivos de tipos para usar con <application>groff</application> desde el archivo de métricas de tipo ascii. Por lo general se encuentra en el directorio <filename>/usr/src/contrib/groff/afmtodit</filename>, pero hay unas cuantas cosas que hacer antes de poder usarlas.
pt_br: Cria arquivos de fontes para uso com o <application>groff</application> a partir do arquivo de métricas de fonte ascii. Isso geralmente fica no diretório <filename>/usr/src/contrib/groff/afmtodit</filename> e requer algum trabalho para prosseguir.

source: If you are paranoid about working in the <filename>/usr/src</filename> tree, simply copy the contents of the above directory to a work location.
es_es: Si cree que trabajar en <filename>/usr/src</filename> no es muy buena idea puede copiar el contenido del directorio anterior en otra ubicación.
pt_br: Se você é paranóico sobre o trabalhar no diretório <filename>/usr/src</filename>, simplesmente copie o conteúdo do diretório acima para um local de trabalho.

source: In the work area, you will need to make the utility. Just type:
es_es: En el directorio, necesitará compilar la utilidad. Escriba:
pt_br: Na área de trabalho, você precisará compilar o utilitário. Apenas digite:

source: You may also need to copy <filename>/usr/contrib/groff/devps/generate/textmap</filename> to <filename>/usr/share/groff_font/devps/generate</filename> if it does not already exist.
es_es: Es posible que tenga que copiar también <filename>/usr/contrib/groff/devps/generate/textmap</filename> a <filename>/usr/share/groff_font/devps/generate</filename> si no existe.
pt_br: Você também pode precisar copiar o <filename>/usr/contrib/groff/devps/generate/textmap</filename> para <filename>/usr/share/groff_font/devps/generate</filename> se ele ainda não existir.

source: Once all these utilities are in place, you are ready to commence:
es_es: Una vez que todas estas utilidades estén en su sitio, estará listo para comenzar:
pt_br: Depois que todos esses utilitários estiverem no lugar, você está pronto para começar:

source: Create <filename>.afm</filename> by typing:
es_es: Cree el archivo <filename>.afm</filename> escribiendo:

source: <prompt>%</prompt> <userinput>gs -dNODISPLAY -q -- ttf2pf.ps <replaceable>TTF_name</replaceable> <replaceable>PS_font_name</replaceable> <replaceable>AFM_name</replaceable></userinput>
es_es: <prompt>%</prompt> <userinput>gs -dNODISPLAY -q -- ttf2pf.ps <replaceable>nombre_TTF</replaceable> <replaceable>nombre_tipo_PS</replaceable> <replaceable>nombre_AFM</replaceable></userinput>

source: Where, <replaceable>TTF_name</replaceable> is your TrueType font file, <replaceable>PS_font_name</replaceable> is the file name for <filename>.pfa</filename>, <replaceable>AFM_name</replaceable> is the name you wish for <filename>.afm</filename>. If you do not specify output file names for the <filename>.pfa</filename> or <filename>.afm</filename> files, then default names will be generated from the TrueType font file name.
es_es: Donde, <replaceable>TTF_name</replaceable> es su archivo de tipo TrueType, <replaceable>PS_font_name</replaceable> es el nombre del archivo <filename>.pfa</filename>, <replaceable>AFM_name</replaceable> es el nombre que quiere que tenga el archivo <filename>.afm</filename>. Si no especifica los nombres de los archivos de salida para los archivos <filename>.pfa</filename> o <filename>.afm</filename>, los nombres predeterminados se generan a partir del nombre de archivo de la tipo TrueType.

source: This also produces a <filename>.pfa</filename>, the ascii PostScript font metrics file (<filename>.pfb</filename> is for the binary form). This will not be needed, but could (I think) be useful for a fontserver.
es_es: Esto también produce un archivo <filename>.pfa</filename>, el archivo ascii de las métricas del tipo PostScript (<filename>.pfb</filename> es para el formato binario). Esto no será necesario, pero podría (creo) ser útil para un servidor de tipos.

source: For example, to convert the 30f9 Barcode font using the default file names, use the following command:
es_es: Por ejemplo, para convertir el tipo para código de barras 30f9 usando los nombres de archivo predeterminados use el siguiente comando:
pt_br: Por exemplo, para converter a fonte de código de barras 30f9 usando o nome de arquivo padrão, use o seguinte comando:

source: If you want the converted fonts to be stored in <filename>A.pfa</filename> and <filename>B.afm</filename>, then use this command:
es_es: Si desea que los tipos convertidos se almacenen en <filename>A.pfa</filename> y <filename>B.afm</filename> use este comando:
pt_br: Se você quiser que as fontes convertidas sejam armazenadas em <filename> A.pfa</filename> e <filename>B.afm</filename>, use este comando:

source: Create the <application>groff</application> PostScript file:
es_es: Crear el archivo PostScript <application>groff</application>:
pt_br: Crie o arquivo PostScript <application>groff</application>:

source: Change directories to <filename>/usr/share/groff_font/devps</filename> so as to make the following command easier to execute. You will probably need root privileges for this. (Or, if you are paranoid about working there, make sure you reference the files <filename>DESC</filename>, <filename>text.enc</filename> and <filename>generate/textmap</filename> as being in this directory.)
es_es: Vaya al directorio <filename>/usr/share/groff_font/devps</filename> para que sea más fácil de ejecutar el siguiente comando. Probablemente necesitará privilegios de root. (O bien, si no se siente confortable del todo trabajando en ese directorio, asegúrese de hacer referencia a los archivos <filename>DESC</filename>, <filename>text.enc</filename> y <filename>generate/textmap</filename> que están en el directorio).
pt_br: Vá para o diretório <filename>/usr/share/groff_font/devps</filename> para facilitar a execução do comando abaixo. Você provavelmente precisará de privilégios de root para isso. (Ou, se você é paranoico sobre trabalhar lá, certifique-se de referenciar os arquivos<filename>DESC</filename>, <filename>text.enc</filename> e <filename>generate/textmap</filename> como estando neste diretório.)

source: <prompt>%</prompt> <userinput>afmtodit -d DESC -e text.enc file.afm generate/textmap <replaceable>PS_font_name</replaceable></userinput>
es_es: <prompt>%</prompt> <userinput>afmtodit -d DESC -e text.enc file.afm generate/textmap <replaceable>nombre_tipo_PS</replaceable></userinput>

source: Where, <filename>file.afm</filename> is the <replaceable>AFM_name</replaceable> created by <command>ttf2pf.ps</command> above, and <replaceable>PS_font_name</replaceable> is the font name used from that command, as well as the name that <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> will use for references to this font. For example, assuming you used the first <command>tiff2pf.ps</command> above, then the 3of9 Barcode font can be created using the command:
es_es: Donde, <filename>file.afm</filename> es el <replaceable>AFM_name</replaceable> creado anteriormente por <command>ttf2pf.ps</command> y <replaceable>PS_font_name</replaceable> es el nombre del tipo utilizado para ese comando, así como el nombre que <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> utilizará para las referencias a este tipo. Por ejemplo, suponiendo que haya utilizado el comando <command>tiff2pf.ps</command> anterior, el tipo para código de barras 3of9 se puede crear usando el comando:

source: Ensure that the resulting <replaceable>PS_font_name</replaceable> file (e.g., <filename>3of9</filename> in the example above) is located in the directory <filename>/usr/share/groff_font/devps</filename> by copying or moving it there.
es_es: Asegúrese de que el archivo <replaceable>PS_font_name</replaceable> resultante (por ejemplo, <filename>3of9</filename> en el ejemplo anterior) se encuentra en el directorio <filename>/usr/share/groff_font/devps</filename> al copiarlo o moverlo allí.
pt_br: Assegure-se de que o arquivo <replaceable>PS_font_name</replaceable> resultante (por exemplo, <filename>3of9</filename> no exemplo acima) esteja localizado no diretório <filename>/usr/share/groff_font/devps</filename> copiando-o ou movendo-o para lá.

source: Note that if <filename>ttf2pf.ps</filename> assigns a font name using the one it finds in the TrueType font file and you want to use a different name, you must edit the <filename>.afm</filename> prior to running <command>afmtodit</command>. This name must also match the one used in the Fontmap file if you wish to pipe <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> into <citerefentry vendor="ports"><refentrytitle>gs</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Tenga en cuenta que si <filename>ttf2pf.ps</filename> asigna un nombre de tipo con el nombre que se encuentra en el archivo de tipos TrueType y quiere usar un nombre diferente antes de ejecutar <command>afmtodit</command> tiene que editar el archivo <filename>.afm</filename>. Este nombre también debe coincidir con el que se usa en el archivo Fontmap si desea redirigir <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> a <citerefentry vendor="ports"><refentrytitle>gs</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Can TrueType Fonts be Used with Other Programs?
es_es: ¿Se pueden usar los tipos TrueType con otros programas?

source: The TrueType font format is used by Windows, Windows 95, and Mac's. It is quite popular and there are a great number of fonts available in this format.
es_es: Windows, Windows 95 y Mac utilizan el formato de tipo TrueType. Es bastante popular y hay una gran cantidad de tipos disponibles en este formato.
pt_br: O formato de fonte TrueType é usado pelo Windows, Windows 95 e Mac. É bastante popular e há um grande número de fontes disponíveis neste formato.

source: Unfortunately, there are few applications that I am aware of that can use this format: <application>Ghostscript</application> and <application>Povray</application> come to mind. <application>Ghostscript's</application> support, according to the documentation, is rudimentary and the results are likely to be inferior to type 1 fonts. <application>Povray</application> version 3 also has the ability to use TrueType fonts, but I rather doubt many people will be creating documents as a series of raytraced pages :-).
es_es: Por desgracia conozco pocas aplicaciones que puedan usar este formato: me vienen a la mente <application>Ghostscript</application> y <application>Povray</application>. Según la documentación el soporte de <application>Ghostscript</application> es rudimentario y es probable que los resultados sean pobres comparados con los tipos Type 1. La versión 3 de <application>Povray</application> también tiene la capacidad de usar tipos TrueType, pero dudo que muchas personas creen documentos como una serie de páginas con trazado de rayos :-).
pt_br: Infelizmente, há poucos aplicativos que conheço que podem usar este formato: O <application>Ghostscript</application> e o <application>Povray</application> são os que vem a mente. O suporte do <application>Ghostscript</application>, de acordo com a documentação, é rudimentar e os resultados provavelmente serão inferiores as fontes Type 1. O <application>Povray</application> versão 3 também tem a capacidade de usar fontes TrueType, mas eu duvido que muitas pessoas criem documentos como uma série de páginas tridmensionais traçadas com luz :-).

source: This rather dismal situation may soon change. The <link xlink:href="http://www.freetype.org/">FreeType Project</link> is currently developing a useful set of FreeType tools:
es_es: Esta situación, un tanto triste, puede cambiar pronto. El <link xlink:href="http://www.freetype.org/">proyecto FreeType</link> está desarrollando actualmente un conjunto útil de herramientas FreeType:
pt_br: Esta situação bastante triste pode mudar em breve. O <link xlink:href="http://www.freetype.org/">Projeto FreeType</link> está atualmente desenvolvendo um conjunto útil de ferramentas FreeType:

source: The <command>xfsft</command> font server for <application>X11</application> can serve TrueType fonts in addition to regular fonts. Though currently in beta, it is said to be quite usable. See <link xlink:href="http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/">Juliusz Chroboczek's page</link> for further information. Porting instructions for FreeBSD can be found at <link xlink:href="http://math.missouri.edu/~stephen/software/">Stephen Montgomery's software page</link>.
es_es: El servidor de tipos para <application>X11</application>, <command>xfsft</command>, ofrece tanto tipos TrueType como tipos normales. Actualmente está en versión beta, pero dicen que es bastante útil. Consulte la <link xlink:href="http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/">página de Juliusz Chroboczek</link> para más información. Las instrucciones para portarlo a FreeBSD se pueden encontrar en la <link xlink:href="http://math.missouri.edu/~stephen/software/">página de software de Stephen Montgomery</link>.
pt_br: O servidor de fontes <command>xfsft</command> para <application>X11</application> pode fornecer fontes TrueType além de fontes regulares. Embora esteja atualmente em beta, dizem que está bastante utilizável. Veja <link xlink:href="http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/">a página de Juliusz Chroboczek</link> para maiores informações. Instruções de portabilidade para o FreeBSD podem ser encontradas na <link xlink:href="http://math.missouri.edu/~stephen/software/">página do software de Stephen Montgomery</link>.

source: <application>xfstt</application> is another font server for <application>X11</application>, available under <uri xlink:href="ftp://sunsite.unc.edu/pub/Linux/X11/fonts/">ftp://sunsite.unc.edu/pub/Linux/X11/fonts/</uri>.
es_es: <application>xfstt</application> es otro servidor de tipos para <application>X11</application> y está disponible en <uri xlink:href="ftp://sunsite.unc.edu/pub/Linux/X11/fonts/">ftp://sunsite.unc.edu/pub/Linux/X11/fonts/</uri>.

source: A program called <command>ttf2bdf</command> can produce BDF files suitable for use in an X environment from TrueType files. Linux binaries are said to be available from <uri xlink:href="ftp://crl.nmsu.edu/CLR/multiling/General/">ftp://crl.nmsu.edu/CLR/multiling/General/</uri>.
es_es: Un programa llamado <command>ttf2bdf</command> puede producir archivos BDF adecuados para su uso en un entorno X a partir de archivos TrueType. Los binarios para Linux están disponibles en <uri xlink:href="ftp://crl.nmsu.edu/CLR/multiling/General/">ftp://crl.nmsu.edu/CLR/multiling/General/</uri>.
pt_br: Um programa chamado <command>ttf2bdf</command> pode produzir arquivos BDF adequados para uso em um ambiente X a partir de arquivos TrueType. Os binários para o Linux estão disponíveis em <uri xlink:href="ftp://crl.nmsu.edu/CLR/multiling/General/"> ftp://crl.nmsu.edu/CLR/multiling/Geral/</uri>.

source: and others …
es_es: y muchas más.
pt_br: e outros …

source: Where Can Additional Fonts be Obtained?
es_es: ¿Dónde se pueden obtener tipos adicionales?

source: Many fonts are available on the Internet. They are either entirely free, or are share-ware. In addition many fonts are available in the <filename>x11-fonts/</filename> category in the ports collection
es_es: Hay muchos tipos disponibles en Internet. Son totalmente gratuitos o shareware. Además, muchos de esos tipos están disponibles en la categoría de ports <filename>x11-fonts/</filename>
pt_br: Muitas fontes estão disponíveis na Internet. Elas são totalmente gratuitas ou sharewares. Além disso, muitas fontes estão disponíveis na categoria <filename>x11-fonts/</filename> na coleção do ports

source: Additional Questions
es_es: Preguntas adicionales

source: What use are the <filename>.pfm</filename> files?
es_es: ¿Para qué sirven los archivos <filename>.pfm</filename>?
pt_br: Quais são os usos dos arquivos <filename>.pfm</filename>?

source: Can one generate the <filename>.afm</filename> from a <filename>.pfa</filename> or <filename>.pfb</filename>?
es_es: ¿Se puede generar el archivo <filename>.afm</filename> desde un archivo <filename>.pfa</filename> o <filename>.pfb</filename>?

source: How to generate the <application>groff</application> character mapping files for PostScript fonts with non-standard character names?
es_es: ¿Cómo generar los archivos de mapeo de caracteres <application>groff</application> para tipos PostScript con nombres de caracteres no estándar?
pt_br: Como gerar os arquivos de mapeamento de caracteres <application>groff </application> para fontes PostScript com nomes de caracteres não padrão?

source: Can xditview and devX?? devices be set up to access all the new fonts?
es_es: ¿Se pueden configurar los dispositivos xditview y devX para acceder a todos los tipos nuevos?
pt_br: Podem os dispositivos xditview e devX serem configurados para acessar todas as novas fontes?

source: It would be good to have examples of using TrueType fonts with <application>Povray</application> and <application>Ghostscript</application>.
es_es: Sería bueno tener ejemplos del uso de tipos TrueType con <application>Povray</application> y <application>Ghostscript</application>.
pt_br: Seria bom ter exemplos de uso de fontes TrueType com <application>Povray</application> e <application>Ghostscript</application>.

source: Wed Aug 7, 1996
pt_br: Quarta-Feira, 7 de Agosto, 1996

source: $FreeBSD: head/en_US.ISO8859-1/articles/fonts/article.xml 50805 2017-09-07 11:56:16Z mat $
pt_br: $FreeBSD$

source: Basic terminology
pt_br: Terminologia Básica

source: The <filename>.fot</filename> file is used by <trademark class="registered">Windows</trademark> as sort of a symbolic link to the actual <trademark class="registered">TrueType</trademark> font (<filename>.ttf</filename>) file. The <filename>.fon</filename> font files are also used by Windows. I know of no way to use this font format with FreeBSD.
pt_br: O arquivo <filename>.fot</filename> é usado pelo <trademark class="registered">Windows</trademark> como um tipo de link simbólico para o arquivo de fonte <trademark class="registered">TrueType</trademark> (<filename>.ttf</filename>). Os arquivos de fonte <filename>.fon</filename> também são utilizados no Windows. Eu desconheço uma maneira de utilizar essa fonte no FreeBSD.

source: What font formats can I use?
pt_br: Que formatos de fonte eu posso utilizar?
