Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/fonts/*.po
Languages: es_es, pt_br

source: The <filename>.fnt</filename> suffix is used quite frequently. I suspect that whenever someone wanted to create a specialized font file for their application, more often than not they chose this suffix. Therefore, it is likely that files with this suffix are not all the same format; specifically, the <filename>.fnt</filename> files used by syscons under FreeBSD may not be the same format as a <filename>.fnt</filename> file one encounters in the <trademark class="registered">MS-DOS</trademark>/<trademark class="registered">Windows</trademark> environment. I have not made any attempt at using other <filename>.fnt</filename> files other than those provided with FreeBSD.
pt_br: O sufixo <filename>.fnt</filename> é frequentemente utilizado. Suspeito que, sempre que alguém quisesse criar um arquivo de fonte especializado para seu aplicativo, na maioria das vezes eles escolhiam esse sufixo. Então, é provável que os arquivos com esse sufixo não tenham o mesmo formato; Especificamente, os arquivos <filename>.fnt</filename> usados pelo console do sistema do FreeBSD pode não ser do mesmo formato que o arquivo <filename>.fnt</filename> encontrado no ambiente <trademark class="registered">MS-DOS</trademark>/<trademark class="registered">Windows</trademark>. Não fiz nenhuma tentativa de utilizar outro arquivo <filename>.fnt</filename> senão aquele fornecido com o FreeBSD.

source: Setting a virtual console to 80x60 line mode
pt_br: Definindo um console virtual para o modo 80x60 linhas

source: To make this more seamless, one can embed these commands in the startup scripts so it takes place when the system boots. To do this is add this line to <filename>/etc/rc.conf</filename>
pt_br: Para fazer isso de uma maneira mais integrada, é possível incluir esses comandos nos scripts de inicialização de modo que ocorra quando o sistema for iniciado. Para fazer isso basta adicionar essa linha no <filename>/etc/rc.conf</filename>

source: Using type 1 fonts with <application>X11</application>
pt_br: Usando fonte tipo 1 com <application>X11</application>

source: <application>X11</application> can use either the <filename>.pfa</filename> or the <filename>.pfb</filename> format fonts. The <application>X11</application> fonts are located in various subdirectories under <filename>/usr/X11R6/lib/X11/fonts</filename>. Each font file is cross referenced to its <application>X11</application> name by the contents of the <filename>fonts.dir</filename> file in each directory.
pt_br: O <application>X11</application> pode tanto usar o formato <filename>.pfa</filename> quanto o formato <filename>.pfb</filename> de fonte. As fontes do <application>X11</application> estão localizadas em vários subdiretórios abaixo do <filename>/usr/X11R6/lib/X11/fonts</filename>. Cada arquivo de fonte é uma referência cruzada do seu nome <application>X11</application> com o conteúdo dos arquivos <filename>fonts.dir</filename> em cada diretório.

source: Using type 1 fonts with Ghostscript
pt_br: Usando fontes Type 1 com Ghostscript

source: <application>Ghostscript</application> references a font via its <filename>Fontmap</filename> file. This must be modified in a similar way to the <application>X11</application> <filename>fonts.dir</filename> file. <application>Ghostscript</application> can use either the <filename>.pfa</filename> or the <filename>.pfb</filename> format fonts. Using the font from the previous example, here is how to use it with <application>Ghostscript</application>:
pt_br: O <application>Ghostscript</application> referencia uma fonte via seu arquivo de <filename>Fontmap</filename>. Este deve ser modificado de uma maneira similar a feita para o arquivo <filename>fonts.dir</filename> do <application>X11</application>. O <application>Ghostscript</application> pode usar tanto o formato <filename>.pfa</filename> quanto o <filename>.pfb</filename>. Usando a fonte do exemplo anterior, segue um passo a passo de como utilizá-la com o <application>Ghostscript</application>:

source: Using type 1 fonts with Groff
pt_br: Usando fontes Type 1 com Groff

source: If <application>Ghostscript</application> is used to drive the printers on the system, then nothing more needs to be done. However, if true <trademark class="registered">PostScript</trademark> printers are used, then the font must be downloaded to the printer in order for the font to be used (unless the printer happens to have the showboat font built in or on an accessible font disk.) The final step is to create a downloadable font. The <command>pfbtops</command> tool is used to create the <filename>.pfa</filename> format of the font, and the <filename>download</filename> file is modified to reference the new font. The <filename>download</filename> file must reference the internal name of the font. This can easily be determined from the groff font file as illustrated:
pt_br: Se o <application>Ghostscript</application> é utilizado para impressão com driver simulado no sistema, então não precisa fazer mais nada. Entretanto, se as impressoras usam <trademark class="registered">PostScript</trademark> real, então a fonte deve ser baixada pela impressora de maneira que a fonte a ser utilizada (a menos que a impressora tenha a fonte showboat embutida ou acessível a partir de um disco de fontes.) O passo final é criar uma fonte descarregável. A ferramenta <command>pfbtops</command> é usada para criar o formato <filename>.pfa</filename> da fonte, e o arquivo para <filename>download</filename> é modificado para referenciar a nova fonte. O arquivo para <filename>download</filename> deve referenciar o nome interno da fonte. Isso pode ser facilmente determinado de um arquivo de fonte groff conforme demonstrado:

source: Of course, if the <filename>.pfa</filename> file is already available, just use a symbolic link to reference it.
pt_br: Claro que, se o arquivo<filename>.pfa</filename> já existe, apenas crie um link simbólico para referenciá-lo.

source: Converting TrueType fonts to a groff/PostScript format for groff
pt_br: Convertendo fontes TrueType para um formato groff/PostScript para o groff

source: Currently available at <uri xlink:href="http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/">http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/</uri>. Note: These files are PostScript programs and must be downloaded to disk by holding down the <keycap>Shift</keycap> key when clicking on the link. Otherwise, your browser may try to launch <application>ghostview</application> to view them.
pt_br: Atualmente disponível em <uri xlink:href="http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/"> http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/</uri>. Nota: Esses arquivos são programas PostScript e devem ser baixados para o disco mantendo pressionada a tecla <keycap> Shift </keycap> ao clicar no link. Caso contrário, seu navegador pode tentar iniciar o <application> ghostview </application> para visualizá-los.

source: Create the <filename>.afm</filename> file by typing:
pt_br: Crie o arquivo <filename>.afm</filename> digitando:

source: Where, <replaceable>TTF_name</replaceable> is your TrueType font file, <replaceable>PS_font_name</replaceable> is the file name for the <filename>.pfa</filename> file, <replaceable>AFM_name</replaceable> is the name you wish for the <filename>.afm</filename> file. If you do not specify output file names for the <filename>.pfa</filename> or <filename>.afm</filename> files, then default names will be generated from the TrueType font file name.
pt_br: Onde, <replaceable>TTF_name</replaceable> é o seu arquivo de fonte TrueType, <replaceable>PS_font_name</replaceable> é o nome do arquivo <filename>.pfa</filename>, <replaceable>AFM_name</replaceable> é o nome que você deseja para o arquivo <filename>.afm</filename>. Se você não especificar nomes de arquivos de saída para os arquivos <filename>.pfa</filename> ou <filename>.afm</filename>, os nomes padrão serão gerados a partir do nome do arquivo de fonte TrueType.

source: This also produces a <filename>.pfa</filename> file, the ascii PostScript font metrics file (<filename>.pfb</filename> is for the binary form). This will not be needed, but could (I think) be useful for a fontserver.
pt_br: Isso também produz um arquivo <filename>.pfa</filename>, o arquivo ascii de métricas de fonte PostScript (<filename>.pfb</filename> é para o formato binário). Isso não será necessário, mas poderia (eu acho) ser útil para um fontserver.

source: Where, <filename>file.afm</filename> is the <replaceable>AFM_name</replaceable> created by <command>ttf2pf.ps</command> above, and <replaceable>PS_font_name</replaceable> is the font name used from that command, as well as the name that <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> will use for references to this font. For example, assuming you used the first <command>tiff2pf.ps</command> command above, then the 3of9 Barcode font can be created using the command:
pt_br: Onde, <filename>file.afm</filename> é o <replaceable>AFM_name</replaceable> criado pelo <command>ttf2pf.ps</command> acima e <replaceable>PS_font_name</replaceable> é o nome da fonte usada a partir desse comando, bem como o nome que <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> usará para referências a essa fonte. Por exemplo, supondo que você usou o primeiro comando <command>tiff2pf.ps</command> acima, a fonte 3of9 Barcode pode ser criada usando o comando:

source: Note that if <filename>ttf2pf.ps</filename> assigns a font name using the one it finds in the TrueType font file and you want to use a different name, you must edit the <filename>.afm</filename> file prior to running <command>afmtodit</command>. This name must also match the one used in the Fontmap file if you wish to pipe <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> into <citerefentry vendor="ports"><refentrytitle>gs</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: Note que se o <filename>ttf2pf.ps</filename> atribuir um nome de fonte usando o nome que ele encontrou no arquivo de fonte TrueType e você quiser usar um nome diferente, você deverá editar o arquivo <filename>.afm</filename> antes de executar o <command>afmtodit</command>. Esse nome também deve coincidir com o usado no arquivo Fontmap se você deseja redirecionar o <citerefentry> <refentrytitle>groff</refentrytitle> <manvolnum> 1 </manvolnum> </citerefentry> para o <citerefentry vendor="ports"><refentrytitle>gs</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Can TrueType fonts be used with other programs?
pt_br: As fontes TrueType podem ser usadas com outros programas?

source: <application>xfstt</application> is another font server for <application>X11</application>, available under <uri xlink:href=" ftp://sunsite.unc.edu/pub/Linux/X11/fonts/"> ftp://sunsite.unc.edu/pub/Linux/X11/fonts/</uri>.
pt_br: O <application>xfstt</application> é outro servidor de fontes para o <application>X11</application>, disponível no <uri xlink:href=" ftp://sunsite.unc.edu/pub/Linux/X11/fonts/"> ftp://sunsite.unc.edu/pub/Linux/X11/fonts/</uri>.

source: Where can additional fonts be obtained?
pt_br: Onde fontes adicionais podem ser obtidas?

source: Additional questions
pt_br: Questões adicionais

source: Can one generate the <filename>.afm</filename> file from a <filename>.pfa</filename> or <filename>.pfb</filename>?
pt_br: Posso gerar o arquivo <filename>.afm</filename> a partir de um arquivo <filename>.pfa</filename> ou <filename>.pfb</filename>?
