<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD: doc/fr_FR.ISO8859-1/articles/multi-os/article.sgml,v 1.2 2001/06/11 01:18:54 ache Exp $
     Original revision: n.nn
-->   

<!DOCTYPE ARTICLE PUBLIC "-//FreeBSD//DTD DocBook V3.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN"> %man;
<!ENTITY % urls PUBLIC "-//FreeBSD//ENTITIES Common Document URL Entities//FR"> %urls;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR"> %abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR"> %artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;

<!ENTITY % authors SYSTEM "../../../en_US.ISO8859-1/books/handbook/authors.ent"> %authors;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//FR"> %mailing-lists;
 <!ENTITY rel.current CDATA "3.2">
]>

<article lang="fr">
  <artheader>
    <title>Installer et utiliser FreeBSD en m&ecirc;me temps que d'autres syst&egrave;mes d'exploitation</title>
    <authorgroup>
      <author>
        <firstname>Jay</firstname>
        <surname>Richmond</surname>
      </author>
    </authorgroup>
    &artheader.copyright;
    <abstract>
      <para><email>jayrich@sysc.com</email></para>
      <para>6 Aout 1996</para>
      <para>Ce document explique comment faire cohabiter proprement FreeBSD et
        d'autres syst&egrave;mes d'exploitation courants tels que Linux, MS-DOS, OS/2
        et Windows 95. Remerciements particuliers &agrave; Annelise Anderson 
        <email>andrsn@stanford.edu</email>, Randall Hopper 
        <email>rhh@ct.picker.com</email> et Jordan K. Hubbard 
        <email>jkh@time.cdrom.com</email>.</para>
        &abstract.license;
        &abstract.disclaimer;
        &trans.a.haby;
    </abstract>
  </artheader>
  <sect1>
    <title>R&eacute;sum&eacute;</title>
    <para>La plupart des gens n'arrivent pas &agrave; faire cohabiter leurs divers
      syst&egrave;mes d'exploitation sans des disques de grande capacit&eacute;, 
      des informations sur les gros disques EIDE sont donc incluses. Comme il
      y a de nombreuses combinaisons possibles de syst&egrave;mes d'exploitation et
      de configurations de disques durs, la section 
      <link linkend="examples">Exemples</link> sera peut-&ecirc;tre celle 
      qui vous sera la plus utile. Elle d&eacute;crit plusieurs configurations 
      d'ordinateurs utilisant plusieurs syst&egrave;mes d'exploitation.</para>
    <para>Ce document suppose que vous avez d&eacute;j&agrave; pr&eacute;par&eacute; de la place sur votre
      disque dur pour un syst&egrave;me d'exploitation suppl&eacute;mentaire. Chaque fois que
      vous repartitionnez votre disque dur, vous prenez le risque de d&eacute;truire 
      les donn&eacute;es qui se trouvent sur les partitions existantes. Toutefois, si
      votre disque est enti&egrave;rement occup&eacute; par DOS, vous trouverez peut-&ecirc;tre le
      programme FIPS (qui se trouve sur le CD-ROM FreeBSD dans le r&eacute;pertoire
      <filename>\TOOLS</filename> ou que vous pouvez t&eacute;l&eacute;charger par
      <ulink url="ftp://ftp.freebsd.org/pub/FreeBSD/tools">ftp</ulink>) utile.
      Il vous permet de repartitionner votre disque sans d&eacute;truire les donn&eacute;es
      qui s'y trouvent. Il existe aussi une programme commercial appel&eacute;
      Partition Magic, qui vous permet de dimensionner et de supprimer des
      partitions sans d&eacute;g&acirc;t.</para>
  </sect1>
  <sect1 id="boot-managers">
    <title>Revue des gestionnaires de d&eacute;marrage</title>
    <para>Ce ne sont que de br&egrave;ves descriptions des diff&eacute;rents gestionnaires
      de d&eacute;marrage que vous rencontrerez. Selon la configuration de votre
      ordinateur, vous pourrez trouver utile d'en employer plus d'un sur le
      m&ecirc;me syst&egrave;me.</para>
    <variablelist>
      <varlistentry>
        <term>Boot Easy</term>
        <listitem>
          <para>C'est le gestionnaire de d&eacute;marrage par d&eacute;faut de FreeBSD. Il
            peut d&eacute;marrer &agrave; peu pr&egrave;s n'importe quoi, y compris BSD, OS/2
            (HPFS), Windows 95 (FAT et FAT32) et Linux. Les partitions sont
            s&eacute;lectionn&eacute;es &agrave; l'aide des touches fonction.</para>
        </listitem>
      </varlistentry>
      <varlistentry>
        <term><foreignphrase>OS/2 Boot Manager</foreignphrase></term>
        <listitem>
          <para>Il d&eacute;marrera depuis la FAT, HPFS, FFS (FreeBSD) et EXT2
            (Linux). Il peut aussi d&eacute;marrer depuis des partitions FAT32.
            Les partitions sont s&eacute;lectionn&eacute;es avec les touches Fl&egrave;ches.
            Le gestionnaire de d&eacute;marrage
            <foreignphrase>OS/2 Boot Manager</foreignphrase> est le
            seul &agrave; utiliser sa propre partition distincte, &agrave; l'inverse des
            autres qui utilisent l'enregistrement principal de d&eacute;marrage
            (<foreignphrase>Master Boot 
            Record</foreignphrase>&nbsp;-&nbsp;MBR). Il doit donc &ecirc;tre
            install&eacute; dans les 1024 premiers cylindres pour &eacute;viter des
            probl&egrave;mes de d&eacute;marrage. Il peut charger Linux en utilisant LILO
            lorsque ce dernier se trouve sur le secteur de d&eacute;marrage et non sur 
            le MBR. Allez sur les 
            <ulink url="http://www.freenix.fr/linux/HOWTO">HOWTO Linux</ulink>
            sur le World Wide Web pour plus d'informations sur le d&eacute;marrage
            de Linux avec le gestionnaire de d&eacute;marrage d'OS/2.</para>
        </listitem>
      </varlistentry>
      <varlistentry>
        <term>OS-BS</term>
        <listitem>
          <para>C'est une alternative &agrave; Boot Easy. Il vous donne plus de
            contr&ocirc;le sur le processus de d&eacute;marrage, avec la possibilit&eacute; de 
            s&eacute;lectionner la partition &agrave; d&eacute;marrer par d&eacute;faut et le d&eacute;lai de
            d&eacute;marrage. La version b&eacute;ta de ce programme vous permet de
            s&eacute;lectionner le syst&egrave;me d'exploitation &agrave; d&eacute;marrer avec les
            touches Fl&egrave;ches. Il est inclus sur le CD-ROM FreeBSD dans le
            r&eacute;pertoire <filename>\TOOLS</filename> et vous pouvez le
            t&eacute;l&eacute;charger par
            <ulink url="ftp://ftp.freebsd.org/pub/FreeBSD/tools">ftp</ulink>.</para> 
        </listitem>
      </varlistentry>
      <varlistentry>
        <term>LILO, ou LInux LOader (&ldquo;chargeur Linux&rdquo;)</term>
        <listitem>
          <para>C'est un gestionnaire de d&eacute;marrage limit&eacute;. Il peut d&eacute;marrer
            FreeBSD, mais il faut acommoder son fichier de configuration.</para>
        </listitem>
      </varlistentry>
    </variablelist>
    <informaltable>
      <tgroup cols="1">
        <tbody>
          <row>
            <entry><emphasis>A propos de la FAT32:</emphasis> La FAT32
              remplace le syst&egrave;me de fichiers FAT depuis la version Microsoft
              OEM SR2 B&eacute;ta, qui sera utilis&eacute;e sur les ordinateurs avec Windows
              95 pr&eacute;-install&eacute; vers la fin de 1996. Elle convertit le syst&egrave;me
              de fichiers FAT habituel et permet d'utiliser des tailles 
              d'agr&eacute;gat&nbsp;-&nbsp;&ldquo;<foreignphrase>cluster</foreignphrase>&rdquo;&nbsp;-&nbsp;plus
              petites sur de plus gros disques. La FAT32 modifie aussi le 
              secteur de d&eacute;marrage et la table d'allocation habituels de la FAT,
              ce qui la rend incompatible avec certains gestionnaires de
              d&eacute;marrage.</entry>
          </row>
        </tbody>
      </tgroup>
    </informaltable>
  </sect1>
  <sect1 id="typical">
    <title>Une configuration typique</title>
    <para>Supposons que nous ayons deux gros disques EIDE, et que nous 
      voulions y installer FreeBSD, Linux et Windows 95.</para>
    <para>Voici comment je proc&eacute;derais avec ces disques durs:</para>
    <itemizedlist>
      <listitem>
        <para><filename>/dev/wd0</filename> (premier disque dur 
          physique),</para>
      </listitem>
      <listitem>
        <para><filename>/dev/wd1</filename> (second disque dur).</para>
      </listitem>
    </itemizedlist>
    <para>Ils ont tous deux 1416 cylindres.</para>
    <orderedlist>
      <listitem>
        <para>Je d&eacute;marre avec une disquette de d&eacute;marrage MS-DOS ou
          Windows qui contient l'utilitaire <filename>FDISK.EXE</filename>
          et cr&eacute;e une petite partition primaire de 50 Mo (35-40 pour Windows
          95 et un peu d'espace libre) sur le premier disque. Je cr&eacute;e aussi
          une partition plus importante sur le second disque pour mes
          applications et mes donn&eacute;es Windows.</para>
      </listitem>
      <listitem>
        <para>Je red&eacute;marre et installe Windows 95 (plus facile &agrave; dire qu'&agrave;
          faire) sur la partition <filename>C:</filename>.</para>
      </listitem>
      <listitem>
        <para>J'installe ensuite Linux. Je ne suis pas certain pour qui
          concerne toutes les distributions de Linux, mais la Slackware
          comprend LILO (voyez la section
          <link linkend="boot-managers">Revue des gestionnaires de 
          d&eacute;marrage</link>). Au moment de partitionner mon disque dur
          avec l'utilitaire <filename>fdisk</filename> de Linux,
          je mets tout Linux sur le premier disque (peut-&ecirc;tre 300 Mo
          pour une partition racine confortable et de l'espace de
          pagination).</para>
      </listitem>
      <listitem>
        <para>Apr&egrave;s avoir install&eacute; Linux, et quand on me demande si je veux
          installer LILO, je fais <emphasis>attention</emphasis> &agrave; l'installer
          sur le secteur de d&eacute;marrage de ma partition racine Linux, et non
          sur le MBR (<foreignphrase>Master Boot 
          Record</foreignphrase>&nbsp;-&nbsp;enregistrement principal de 
          d&eacute;marrage).</para>
      </listitem>
      <listitem>
        <para>L'espace restant disponible sur le disque peut servir &agrave; 
          FreeBSD. Je v&eacute;rifie aussi que la 
          tranche&nbsp;-&nbsp;&ldquo;<foreignphrase>slice</foreignphrase>&rdquo;&nbsp;-&nbsp;racine 
          de FreeBSD ne d&eacute;borde pas de la limite des 1024 cylindres (1024 
          cylindres correspond &agrave; 528 Mo &agrave; partir du d&eacute;but du disque sur nos
          hypoth&eacute;tiques disques de 720 Mo). J'utiliserai &eacute;ventuellement le
          reste du disque dur (environ 270 Mo) pour les tranches
          <filename>/usr</filename> et <filename>/var</filename>. Le 
          reste du second
          disque (l'espace disponible d&eacute;pend de la taille de ma partition 
          d'applications/donn&eacute;es Windows que j'ai cr&eacute;&eacute;e &agrave; l'&eacute;tape 1) peut &ecirc;tre
          utilis&eacute; pour la tranche <filename>/usr/src</filename> et l'espace
          de pagination.</para>
      </listitem>
      <listitem>
        <para>Vus de l'utilitaire <filename>fdisk</filename> de Windows 95, mes 
          disques ressembleraient &agrave; ceci:</para>
        <programlisting>
---------------------------------------------------------------------

                  Display Partition Information

Current fixed disk drive: 1

Partition  Status  Type  Volume_Label  Mbytes  System  Usage
C: 1          A   PRI DOS                50    FAT**     7%
   2          A   Non-DOS (Linux)       300             43%

Total disk space is  696 Mbytes (1 Mbyte = 1048576 bytes)

Press Esc to continue

---------------------------------------------------------------------
                        
                  Display Partition Information

Current fixed disk drive: 2

Partition  Status  Type  Volume_Label  Mbytes  System  Usage
D: 1          A   PRI DOS                420   FAT**    60%

Total disk space is  696 Mbytes (1 Mbyte = 1048576 bytes)

Press Esc to continue

---------------------------------------------------------------------
        </programlisting>
        <para>Disons FAT16, ou FAT32 si vous utilisez la mise &agrave; jour
          OEM SR2 (voyez la section
          <link linkend="boot-managers">Revue des gestionnaires de 
          d&eacute;marrage</link>).</para>
      </listitem>
      <listitem>
        <para>J'installe FreeBSD. Je veille &agrave; d&eacute;marrer avec le premier
          disque dur d&eacute;fini comme &ldquo;NORMAL&rdquo; dans le param&eacute;trage
          du BIOS. Sans cela, je devrais indiquer la g&eacute;om&eacute;trie r&eacute;elle de mon
          disque au d&eacute;marrage (pour la conna&icirc;tre, d&eacute;marrez Windows 95 et
          consultez les diagnostics Microsoft (<filename>MSD.EXE</filename>)
          ou allez voir dans le BIOS) avec le param&egrave;tre 
          <literal>hd0=1416,16,63</literal> o&ugrave; <replaceable>1416</replaceable>
          est le nombre de cylindres de mon disque dur, 
          <replaceable>16</replaceable> est le nombre de t&ecirc;tes par piste et
          <replaceable>63</replaceable> est le nombre de secteurs par 
          t&ecirc;te.</para>
      </listitem>
      <listitem>
        <para>Au moment de partitionner le disque dur, je fais attention &agrave;
          bien installer Boot Easy sur le premier disque. Je ne m'occupe pas
          du second disque, &agrave; partir duquel rien n'est d&eacute;marr&eacute;.</para>
      </listitem>
      <listitem>
        <para>Au red&eacute;marrage, Boot Easy devrait reconna&icirc;tre mes trois
          partitions d&eacute;marrables comme DOS (Windows 95), Linux et BSD 
          (FreeBSD)</para>
      </listitem>
    </orderedlist>
  </sect1>
  <sect1 id="special">
    <title>Consid&eacute;rations particuli&egrave;res</title>
    <para>La plupart des syst&egrave;mes d'exploitation sont tr&egrave;s chatouilleux sur la
      fa&ccedil;on et l'endroit o&ugrave; ils sont install&eacute;s sur le disque dur. Windows 95 et
      DOS doivent &ecirc;tre sur la premi&egrave;re partition primaire du premier disque dur.
      OS/2 fait exception. Il peut &ecirc;tre sur le premier ou le second disque et
      sur une partition primaire ou &eacute;tendue. Si vous n'&ecirc;tes pas s&ucirc;r de vous,
      gardez le d&eacute;but des partitions d&eacute;marrables avant le 1024&egrave;me 
      cylindre.</para>
    <para>Si vous installez Windows 95 sur un syst&egrave;me BSD existant, cela va
      &ldquo;&eacute;craser&rdquo; le MBR, et vous devrez r&eacute;installer votre pr&eacute;c&eacute;dent
      gestionnaire de d&eacute;marrage. Boot Easy peut &ecirc;tre r&eacute;install&eacute; avec 
      l'utilitaire <filename>BOOTINST.EXE</filename> qui se trouve dans le
      r&eacute;pertoire <filename>\TOOLS</filename> du CD-ROM, ou peut &ecirc;tre t&eacute;l&eacute;charg&eacute;
      par <ulink url="ftp://ftp.freebsd.org/pub/FreeBSD/tools">ftp</ulink>. 
      Vous pouvez aussi relancer le processus d'installation et aller dans
      l'&eacute;diteur de partitions. De l&agrave;, indiquez que la partition FreeBSD est
      d&eacute;marrable, choisissez l'option <option>Boot Manager</option> 
      (gestionnaire de d&eacute;marrage) et tapez
      <literal>W</literal> pour &eacute;crire les informations sur le MBR. Vous
      pouvez maintenant red&eacute;marrer, et Boot Easy reconna&icirc;tra votre Windows 95
      en tant que DOS.</para>
    <para>N'oubliez pas s'il vous pla&icirc;t qu'OS/2 peut lire les partitions FAT
      et HPFS, mais pas les partitions FFS (FreeBSD) ou EXT2 (Linux). De m&ecirc;me,
      Windows 95 ne peut que lire et &eacute;crire sur les partitions FAT et FAT32
      (voyez la section <link linkend="boot-managers">Revue des gestionnaire
      de d&eacute;marrage</link>). FreeBSD peut lire la plupart des syst&egrave;mes de
      fichiers, mais ne sait pas actuellement lire les partitions HPFS. Linux
      peut lire les partitions HPFS, mais ne peut pas y &eacute;crire. Les versions
      r&eacute;centes du noyau Linux (2.x) peuvent lire et &eacute;crire les partitions VFAT
      de Windows 95 (La VFAT est ce qui permet &agrave; Windows d'utiliser des noms
      de fichiers longs&nbsp;-&nbsp;c'est &agrave; peu pr&egrave;s la m&ecirc;me chose que la
      FAT). Linux peut lire et &eacute;crire sur la plupart des syst&egrave;mes de fichiers.
      Pig&eacute;? Je l'esp&egrave;re.</para>
  </sect1>
  <sect1 id="examples">
    <title>Exemples</title>
    <para><emphasis>(Cette section a besoin d'&ecirc;tre revue, envoyez s'il vous 
      pla&icirc;t vos exemples &agrave; <email>jayrich@sysc.com</email>.)</emphasis></para> 
    <para>FreeBSD + Windows 95: Si vous avez install&eacute; FreeBSD apr&egrave;s Windows 95,
      vous devriez voir la mention <literal>DOS</literal> sur le menu de Boot
      Easy. C'est Windows 95. Si vous avez install&eacute; Windows 95 apr&egrave;s FreeBSD,
      lisez la section <link linkend="special">Consid&eacute;rations 
      particuli&egrave;res</link> ci-dessus. Tant que votre disque n'a pas 1024 
      cylindres, vous ne devriez pas avoir de probl&egrave;mes pour d&eacute;marrer. Si 
      toutefois une de vos partitions va au-del&agrave; du 1024&egrave;me cylindre, et que
      vous avez des messages du type <literal>invalid system disk</literal>
      sous DOS (Windows 95) et que FreeBSD ne d&eacute;marre pas, cherchez dans les
      param&egrave;tres de configuration de votre BIOS quelque chose appel&eacute; 
      &ldquo;<literal>&gt; 1024 cylinder support</literal>&rdquo; ou
      mode &ldquo;<literal>NORMAL/LBA</literal>&rdquo;. DOS peut avoir besoin
      du LBA (<foreignphrase>Logical Block 
      Adressing</foreignphrase>&nbsp;-&nbsp;Adressage de bloc logique) pour
      d&eacute;marrer correctement. Si la perspective de modifier les param&egrave;tres du
      BIOS &agrave; chaque d&eacute;marrage ne vous enchante pas, vous pouvez d&eacute;marrer 
      FreeBSD depuis DOS avec l'utilitaire <filename>FBSDBOOT.EXE</filename>
      du CD (il devrait reconna&icirc;tre votre partition FreeBSD et la 
      d&eacute;marrer).</para>
    <para>FreeBSD + OS/2 + Windows: Rien de nouveau dans ce cas. Le gestionnaire
      de d&eacute;marrage d'OS/2 peut d&eacute;marrer tous ces syst&egrave;mes d'exploitation, il ne 
      devrait pas y avoir de probl&egrave;me.</para>
    <para>FreeBSD + Linux: Vous pouvez aussi utiliser Boot Easy pour d&eacute;marrer
      les deux syst&egrave;mes d'exploitation.</para>
    <para>FreeBSD + Linux + Windows 95: (voyez la section 
      <link linkend="typical">Une installation typique</link>).</para>
  </sect1>
  <sect1 id="help">
    <title>Autres endroits o&ugrave; trouver de l'aide</title>
    <para>Il y a de nombreux
      <ulink url="http://www.freenix.fr/linux/HOWTO">HOWTO Linux</ulink>
      qui traitent des syst&egrave;mes d'exploitation multiples sur un m&ecirc;me 
      disque.</para>
    <para>Le
      <ulink url="http://www.linuxresources.com/LDP/HOWTO/mini/Linux+DOS+Win95+OS2.html">mini-HOWTO 
        Linux+DOS+Win95+OS2</ulink> donne des indications sur la configuration
        du gestionnaire de d&eacute;marrage d'OS/2, et le
      <ulink url="http://www.freenix.fr/linux/HOWTO/mini/Linux+FreeBSD.html">mini-HOWTO 
        Linux+FreeBSD</ulink> peut aussi vous int&eacute;resser. 
      L'<ulink url="http://www.in.net/~jkatz/win95/Linux-HOWTO.html">HOWTO 
        Linux</ulink> est aussi utile.</para>
    <para>Le  
      <ulink url="http://www.dorsal.org/~dcl/publications/NTLDR_hacking">Guide 
        de programmation du chargeur NT</ulink> fournit des informations 
        int&eacute;ressantes sur le d&eacute;marrage de Windows NT, 95 et DOS avec d'autres
        syst&egrave;mes d'exploitation.</para>
    <para>Le jeu de documents d'Hale Landis, &ldquo;Comment &ccedil;a marche&rdquo;,
      contient de bonnes informations sur toutes sortes de g&eacute;om&eacute;tries de disques
      et autres sujets li&eacute;s au d&eacute;marrage. Voici quelques liens qui peuvent vous
      aider &agrave; le trouver:</para>
    <itemizedlist>
      <listitem>
        <para><ulink url="ftp://fission.dt.wdc.com/pub/otherdocs/pc_systems/how_it_works/allhiw.zip">ftp://fission.dt.wdc.com/pub/otherdocs/pc_systems/how_it_works/allhiw.zip</ulink>,</para>
      </listitem>
      <listitem>
        <para><ulink url="http://www.cs.yorku.ca/People/frank/docs/">http://www.cs.yorku.ca/People/frank/docs/</ulink>.</para>
      </listitem>
    </itemizedlist>
    <para>Enfin, ne n&eacute;gligez pas la documentation du noyau de FreeBSD sur le
      processus de d&eacute;marrage, disponible dans la distribution du source du
      noyau (elle est install&eacute;e dans 
      <ulink url="file:/usr/src/sys/i386/boot/biosboot/README.386BSD">file:/usr/src/sys/i386/boot/biosboot/README.386BSD</ulink>).</para>
  </sect1>
  <sect1>
    <title>D&eacute;tails Techniques</title>
    <para><emphasis>(Contribution de Randall Hopper 
      <email>rhh@ct.picker.com</email>)</emphasis></para>
    <para>Cette section tente de vous donner assez d'informations de base
      sur vos disques durs et sur le processus de d&eacute;marrage &agrave; partir d'un
      disque pour vous permettre de r&eacute;gler la plupart des probl&egrave;mes que vous
      pourriez rencontrer lorsque vous configurerez le d&eacute;marrage de plusieurs
      syst&egrave;mes d'exploitation. Elle commence par des choses relativement
      &eacute;l&eacute;mentaires, vous pr&eacute;f&eacute;rerez donc peut-&ecirc;tre la parcourir en diagonale 
      jusqu'&agrave; ce que les points abord&eacute;s vous paraissent moins familiers et 
      commencer alors &agrave; la lire en d&eacute;tail.</para>
    <sect2>
      <title>Introduction aux disques</title>
      <para>Trois termes fondamentaux d&eacute;crivent la localisation des donn&eacute;es
        sur vos disques durs: Cylindres, T&ecirc;tes et Secteurs. Il n'est pas tr&egrave;s
        important de savoir &agrave; quoi ils se rapportent sinon qu'ensemble, ils
        d&eacute;finissent o&ugrave; sont physiquement les donn&eacute;es sur le disque.</para>
      <para>Votre disque a un nombre donn&eacute; de cylindres, de t&ecirc;tes, et de
        secteurs par t&ecirc;te-cylindre (un doublet t&ecirc;te-cylindre est aussi appel&eacute;
        une piste). Ensemble, ces informations d&eacute;finissent la &ldquo;g&eacute;om&eacute;trie 
        physique&rdquo; de votre disque. Il y a typiquement 512 octets par
        secteur et 63 secteurs par pistes, le nombre de cylindres et de t&ecirc;tes
        variant tr&egrave;s largement d'un disque &agrave; l'autre. Vous pouvez alors 
        calculer la quantit&eacute; d'informations que peut enregistrer votre disque
        par la formule:</para>
      <programlisting>
nombre de cylindres X nombre de t&ecirc;tes X 63 secteurs/piste X 512 octets/secteur
      </programlisting>
      <para>Par exemple, pour mon disque Western Digital AC31600 EIDE de 1,6 Go,
cela donne:</para>
      <programlisting>
3148 cylindres X 16 t&ecirc;tes X 63 secteurs/piste X 512 octets/secteur
      </programlisting>
      <para>c'est-&agrave;-dire 1.624.670.208 octets, ou environ 1,6 Go.</para>
      <para>Vous pouvez conna&icirc;tre la g&eacute;om&eacute;trie physique de votre disque dur
        (nombre de cylindres, de t&ecirc;tes et de secteurs par piste) avec ATAID
        ou d'autres programmes que vous trouverez sur l'Internet. Ces 
        informations sont peut-&ecirc;tre aussi fournies avec votre disque. Faites 
        cependant attention: si vous utilisez le LBA du BIOS (voyez la section
        <link linkend="limits">Restrictions pour le d&eacute;marrage et 
        avertissements</link>), vous ne pouvez pas vous servir de n'importe
        quel programme pour conna&icirc;tre la g&eacute;om&eacute;trie physique. Cela parce que de
        nombreux programmes (e.g., <filename>MSD.EXE</filename> ou 
        le <filename>fdisk</filename> de FreeBSD) ne reconnaissent pas la
        g&eacute;om&eacute;trie physique, ils listent &agrave; la place la <emphasis>g&eacute;om&eacute;trie
        red&eacute;finie</emphasis> (des valeurs virtuelles dues &agrave; l'utilisation
        du LBA). Continuez &agrave; lire pour savoir ce que cela veut dire.</para>
      <para>Une autre chose &agrave; savoir &agrave; propos de ces termes. 3 
        valeurs&nbsp;-&nbsp;un num&eacute;ro de cylindre, un num&eacute;ro de t&ecirc;te, et un
        num&eacute;ro du secteur sur la piste&nbsp;-&nbsp;identifient l'adresse absolue
        d'un secteur sur votre disque. Les cylindres et les t&ecirc;tes sont
        num&eacute;rot&eacute;s &agrave; partir de 0, et les num&eacute;ros de secteurs commencent &agrave; 
        1.</para>
      <para>Ceux que des d&eacute;tails plus techniques int&eacute;ressent peuvent
        trouver un peu partout sur l'Internet des informations sur la g&eacute;om&eacute;trie
        des disques, les secteurs de d&eacute;marrage, les BIOS, etc. Faites une
        recherche sur Yahoo, Lycos, etc. pour <literal>boot sector</literal> ou
        <literal>master boot record</literal>. Parmi les choses utiles que vous
        trouverez, il y a le jeu de documents
        &ldquo;Comment &ccedil;a marche&rdquo;&nbsp;-&nbsp;<foreignphrase>How It
        Works</foreignphrase> de Hale Landis. Voyez la section
        <link linkend="help">Autres endroits o&ugrave; trouver de l'aide</link> pour
        avoir quelques pointeurs vers ces documents.</para>
      <para>OK, assez de terminologie. Nous sommes cens&eacute;s parler de d&eacute;marrage
        ici.</para> 
    </sect2>
    <sect2 id="booting">
      <title>Le processus de d&eacute;marrage</title>
      <para>Sur le premier secteur de votre disque (cylindre 0, t&ecirc;te 0,
        secteur 1) se trouve l'enregistrement principal de 
        d&eacute;marrage&nbsp;-&nbsp;<foreignphrase>Master Boot 
        Record</foreignphrase> (MBR). Il contient une carte de votre disque.
        Il identifie jusqu'&agrave; <emphasis>4 partitions</emphasis>, chacune d'elle
        &eacute;tant un espace contigu sur ce disque. FreeBSD appelle les partitions
        des tranches&nbsp;-&nbsp;<foreignphrase>slices</foreignphrase>&nbsp;-&nbsp;pour
        &eacute;viter la confusion avec ses propres partitions, mais nous 
        n'utiliserons pas ici ce terme. Chaque partition peut contenir son
        propre syst&egrave;me d'exploitation.</para>
      <para>Chaque entr&eacute;e de partition dans le MBR comprend un 
        <emphasis>IDentifiant de partition</emphasis>, un 
        <emphasis>Cylindre/T&ecirc;te/Secteur de D&eacute;but</emphasis> et un
        <emphasis>Cylindre/T&ecirc;te/Secteur de Fin</emphasis>. L'IDentifiant de
        partition dit de quel type de partition il s'agit (de quel OS) et le
        D&eacute;but/Fin dit o&ugrave; elle se trouve. La table des 
        <link linkend="partitions">IDs de partitions</link> liste un
        &eacute;chantillon d'identifiants de partitions usuels.</para>
      <informaltable id="partitions">
        <tgroup cols="2">
          <thead>
            <row>
              <entry>ID (hex)</entry>
              <entry>Description</entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry>01</entry>
              <entry>DOS12 primaire (FAT 12-bit)</entry>
            </row>
            <row>
              <entry>04</entry>
              <entry>DOS16 primaire (FAT 16-bit)</entry>
            </row>
            <row>
              <entry>05</entry>
              <entry>DOS12 &eacute;tendue</entry>
            </row>
            <row>
              <entry>06</entry>
              <entry>DOS primaire large (&gt; 32 Mo)</entry>
            </row>
            <row>
              <entry>0A</entry>
              <entry>OS/2</entry>
            </row>
            <row>
              <entry>83</entry>
              <entry>Linux (EXT2FS)</entry>
            </row>
            <row>
              <entry>A5</entry>
              <entry>FreeBSD, NetBSD, 386BSD (UFS)</entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <note>
        <para>Toutes les partitions ne dont pas d&eacute;marrables (e.g. DOS &eacute;tendue).
          Certaines le sont&nbsp;-&nbsp;d'autres ne le sont pas. Ce qui rend
          une partition d&eacute;marrable est la configuration du secteur de d&eacute;marrage 
          de la 
          partition&nbsp;-&nbsp;<foreignphrase>Partition Boot Sector</foreignphrase>&nbsp;-&nbsp;qui
          est toujours pr&eacute;sent au d&eacute;but de chaque partition.</para>
      </note>
      <para>Quand vous configurez votre gestionnaire de d&eacute;marrage favori, il
        consulte les entr&eacute;es dans les tables de partitions du MBR de tous vos
        disques et vous donne la possibilit&eacute; de donner un nom &agrave; ces entr&eacute;es.
        Quand vous d&eacute;marrez ensuite, le gestionnaire de d&eacute;marrage
        est appel&eacute; par du code pr&eacute;vu pour cela &agrave; partir secteur principal de
        d&eacute;marrage&nbsp;-&nbsp;<foreignphrase>Master Boot Sector</foreignphrase>&nbsp;-&nbsp;du 
        premier disque trouv&eacute; sur votre syst&egrave;me. Le gestionnaire consulte
        l'entr&eacute;e de la table de partitions du MBR correspondant &agrave; la partition
        que vous avez choisie, charge le secteur de d&eacute;marrage de cette partition
        et lui passe le contr&ocirc;le. Ce secteur de d&eacute;marrage de la partition 
        elle-m&ecirc;me contient suffisamment d'informations pour commencer &agrave; charger
        le syst&egrave;me d'exploitation qui se trouve sur cette partition.</para>
      <para>Il y a une chose importante &agrave; savoir dont nous n'avons pas encore 
        parl&eacute;. Tous vos disques durs ont un MBR. Toutefois, celui qui est
        important est celui qui se trouve sur le premier disque reconnu par le
        BIOS. Si vous n'avez que des disques durs IDE, c'est le premier disque
        IDE (e.g. le disque ma&icirc;tre sur le premier contr&ocirc;leur). De m&ecirc;me pour les
        syst&egrave;mes enti&egrave;rement SCSI. Si vous avez et des disques durs IDE et des
        disques durs SCSI, le disque IDE est habituellement le premier disque
        dont la pr&eacute;sence est test&eacute;e par le BIOS, le premier disque IDE est donc
        le premier disque reconnu. Le gestionnaire de d&eacute;marrage que vous 
        installerez sera impl&eacute;ment&eacute; sur le premier disque dur reconnu comme 
        nous venons de l'expliquer.</para>
    </sect2>
    <sect2 id="limits">
      <title>Restrictions pour le d&eacute;marrage et avertissements</title
      <para>Voici maintenant les choses int&eacute;ressantes auxquelles il faut
        faire attention.</para>
        <sect3>
          <title>La redoutable limitation &agrave; 1024 cylindres et en quoi le LBA du
            BIOS peut &ecirc;tre utile</title>
          <para>La premi&egrave;re partie du processus de d&eacute;marrage est enti&egrave;rement
            confi&eacute;e au BIOS, (si ce terme est nouveau pour vous, le BIOS est
            un circuit &eacute;lectronique sur votre carte m&egrave;re qui contient le 
            code de d&eacute;marrage de votre ordinateur). C'est pourquoi cette 
            premi&egrave;re partie du processus est soumise aux limitations du
            BIOS.</para>
          <para>L'interface BIOS utilis&eacute;e pour lire le disque dur durant
            cette phase (INT 13H, Sous-fonction 2) alloue 10 bits pour le
            num&eacute;ro de cylindre, 8 bits pour le num&eacute;ro de t&ecirc;te, et 6 bits
            pour le num&eacute;ro de secteur. Cela limite les utilisateurs de
            cette interface (i.e. les gestionnaires de d&eacute;marrage impl&eacute;ment&eacute;s
            sur le MBR du disque ainsi que les chargeurs de syst&egrave;mes 
            d'exploitation impl&eacute;ment&eacute;s sur les secteurs de d&eacute;marrage) &agrave;:</para>
          <itemizedlist>
            <listitem>
              <para>1024 cylindres au plus,</para>
            </listitem>
            <listitem>
              <para>256 t&ecirc;tes au plus,</para>
            </listitem>
            <listitem>
              <para>64 secteurs/piste au plus, (en fait 63, 0 n'est pas 
                disponible).</para>
            </listitem>
          </itemizedlist>
          <para>Or les diques durs de grande capacit&eacute; ont beaucoup de 
            cylindres et peu de t&ecirc;tes, le nombre de cylindres de ces disques
            est donc invariablement sup&eacute;rieurs &agrave; 1024. De ce fait et &agrave; cause
            de l'interface BIOS telle qu'elle est, vous ne pouvez pas d&eacute;marrer
            n'importe o&ugrave; sur votre disque dur. Le code de d&eacute;marrage (le 
            gestionnaire de d&eacute;marrage et le chargeur du syst&egrave;me d'exploitation 
            impl&eacute;ment&eacute; sur les secteurs de d&eacute;marrage de chaque partition 
            d&eacute;marrable) doivent se situer avant le 1024&egrave;me cylindre. Si votre
            disque dur est standard et a 16 t&ecirc;tes, cela &eacute;quivaut &agrave;:</para>
          <programlisting>
1024 cylindres/disque X 16 t&ecirc;tes/disque X 63 secteurs/piste X 512 octets
          </programlisting>
          <para>c'est-&agrave;-dire la limite souvent cit&eacute;e de 528 Mo.</para>
          <para>C'est l&agrave; qu'intervient le LBA (<foreignphrase>Logical Block 
             Adressing</foreignphrase>&nbsp;-&nbsp;&ldquo;adressage de bloc 
             logique&rdquo;) du BIOS. Le LBA du BIOS donne &agrave; l'utilisateur
             des routines de l'API (<foreignphrase>Application Programming 
             Interface</foreignphrase>&nbsp;-&nbsp;&ldquo;interface de 
             programmation&rdquo;) du BIOS, la possibilit&eacute; d'acc&eacute;der aux
             cylindres au-del&agrave; de 1024 avec les interfaces du BIOS en
             red&eacute;finissant le cylindre. Cela signifie qu'il construit une    
             nouvelle g&eacute;om&eacute;trie de vos cylindres et t&ecirc;tes, faisant croire
             au BIOS que votre disque a moins de cylindres et plus de t&ecirc;tes
             qu'en r&eacute;alit&eacute;. En d'autres termes, il profite du fait que les
             disques ont relativement peu de t&ecirc;tes et beaucoup de cylindres,
             pour modifier le rapport entre nombre de cylindres et nombre de
             t&ecirc;tes de fa&ccedil;on &agrave; ce que tous deux soient inf&eacute;rieurs aux limites
             mentionn&eacute;es ci-dessus (1024 cylindres, 256 t&ecirc;tes).</para>
           <para>Pour prendre de nouveau l'exemple de mon Western Digital 1,6 
             Go, il a pour g&eacute;om&eacute;trie physique:</para>
           <programlisting>
(3148 cylindres, 16 t&ecirc;tes, 63 secteurs/piste, 512 octets/secteur)
           </programlisting>
           <para>Alors que le LBA du BIOS la red&eacute;finit comme suit:</para>
           <programlisting>
( 787 cylindres, 64 t&ecirc;tes, 63 secteurs/piste, 512 octets/secteur)
           </programlisting>
           <para>ce qui correspond &agrave; la m&ecirc;me capacit&eacute; physique, mais avec des
             nombres de cylindres et de t&ecirc;tes dans les limites acceptables par
             les API du BIOS. (Au passage, j'ai sur l'un de mes disques, et 
             Linux et FreeBSD au-del&agrave; du 1024&egrave;me cylindre, et les deux d&eacute;marrent
             sans probl&egrave;me, gr&acirc;ce au LBA du BIOS.)</para>
        </sect3>
        <sect3>
        <title>Gestionnaires de d&eacute;marrage et allocation de l'espace 
          disque</title>
        <para>Une autre chose &agrave; laquelle il faut faire attention lorsque vous
          installez un gestionnaire de d&eacute;marrage est l'allocation d'espace
          disque pour ce gestionnaire. Il vaut mieux &ecirc;tre inform&eacute; de cette
          question avant de commencer pour vous &eacute;viter d'avoir &agrave; r&eacute;installer un
          ou plusieurs de vos syst&egrave;mes d'exploitation.</para>
        <para>Si vous avez suivi ce qui a &eacute;t&eacute; dit sur le 
          <link linkend="booting">processus de d&eacute;marrage</link> 
          &agrave; propos du secteur principal de d&eacute;marrage (o&ugrave; se trouve le MBR), 
          des secteurs de d&eacute;marrage des partitions et du processus de d&eacute;marrage,
          vous vous &ecirc;tes peut-&ecirc;tre demand&eacute; o&ugrave; va se trouver ce foutu
          gestionnaire de d&eacute;marrage. Bien, certains gestionnaires de d&eacute;marrage 
          sont suffisament l&eacute;gers pour tenir enti&egrave;rement dans le secteur 
          principal de d&eacute;marrage (cylindre 0, t&ecirc;te 0, secteur 1) avec la table 
          de partitions. D'autres ont besoin d'un peu plus d'espace et d&eacute;bordent
          en fait de quelques secteurs apr&egrave;s le secteur principal de d&eacute;marrage 
          sur la piste cylindre 0 t&ecirc;te 0, qui sont normalement libres... 
          normalement.</para>
        <para>L&agrave; est le hic... Certains syst&egrave;mes d'exploitation (y compris 
          FreeBSD) vous permettent de faire d&eacute;buter vos partitions juste apr&egrave;s
          le secteur principal de d&eacute;marrage au cylindre 0, t&ecirc;te 0, secteur 2,
          si vous le voulez. En fait, si vous donnez au programme 
          <citerefentry><refentrytitle>sysinstall</refentrytitle></citerefentry>
          de FreeBSD, un disque dont le d&eacute;but est vierge ou un disque totalement
          vide, c'est l&agrave; qu'il fera commencer par d&eacute;faut la partition FreeBSD 
          (c'est tout du moins ce qu'il a fait quand je suis tomb&eacute; dans ce
          pi&egrave;ge). Quand vous installez ensuite le gestionnaire de d&eacute;marrage, si
          c'est l'un de ceux qui occupent quelques secteurs suppl&eacute;mentaires
          apr&egrave;s le MBR, il &eacute;crase les donn&eacute;es qui se trouvent au d&eacute;but de la
          premi&egrave;re partie. Dans le cas de FreeBSD, cela &eacute;crase le label du
          disque et emp&ecirc;che de d&eacute;marrer votre partition FreeBSD.</para>
        <para>Le moyen facile d'&eacute;viter ce probl&egrave;me (et de vous garder le 
          possibilit&eacute; d'essayer diff&eacute;rents gestionnaires de d&eacute;marrage par la
          suite) est de ne pas allouer la premi&egrave;re piste du disque quand vous le
          partitionnez. Cela r&eacute;serve l'espace entre le cylindre 0, t&ecirc;te 0, 
          secteur 2 et le cylindre 0, t&ecirc;te 0, secteur 63, et votre partition
          commence au cylindre 1, t&ecirc;te 1, secteur 1. Pour ce que cela vaut,
          quand vous cr&eacute;ez une partition DOS au d&eacute;but de votre disque, DOS 
          laisse par d&eacute;faut cet espace inoccup&eacute; (c'est pourquoi certains 
          gestionnaires de d&eacute;marrage font l'hypoth&egrave;se qu'il est disponible).
          Mettre une partition DOS au d&eacute;but de votre disque vous permet aussi
          d'&eacute;viter le probl&egrave;me. C'est ce que je pr&eacute;f&egrave;re personnellement faire,
          mettre une partition DOS de 1 Mo au d&eacute;but, parce que cela &eacute;vite
          aussi que la lettre d&eacute;signant mon disque DOS primaire soit modifi&eacute;e
          ensuite quand je repartitionne.</para>
        <para>Pour servir de r&eacute;f&eacute;rence, les gestionnaires de d&eacute;marrage 
          suivants n'utilisent que le secteur principal de d&eacute;marrage pour
          mettre leur code et leurs donn&eacute;es:</para>
        <itemizedlist>
          <listitem>
            <para>OS-BS 1.35,</para>
          </listitem>
          <listitem>
            <para>Boot Easy,</para>
          </listitem>
          <listitem>
            <para>LILO.</para>
          </listitem>
        </itemizedlist>
        <para>Ces gestionnaires de d&eacute;marrage occupent quelques secteurs 
          suppl&eacute;mentaires apr&egrave;s le secteur principal de d&eacute;marrage:</para>
        <itemizedlist>
          <listitem>
            <para>OS-BS 2.0 B&eacute;ta 8 (secteurs 2-5),</para>
          </listitem>
          <listitem>
            <para>gestionnaire de d&eacute;marrage d'OS/2.</para>
          </listitem>
        </itemizedlist>
      </sect3>
      <sect3>
        <title>Que faire si votre syst&egrave;me ne d&eacute;marre pas?</title>
        <para>Il se peut qu'&agrave; un moment donn&eacute; 
          de l'installation d'un gestionnaire
          de d&eacute;marrage, vous laissiez le MBR dans un &eacute;tat tel que votre machine
          ne red&eacute;marre plus. C'est peu probable, mais possible lorsque vous
          refaites un FDISK alors qu'il y a d&eacute;j&agrave; un gestionnaire de d&eacute;marrage
          install&eacute;.</para>
        <para>Si vous avez une partition DOS d&eacute;marrable, vous pouvez d&eacute;marrer
          avec une disquette de d&eacute;marrage DOS, et lancer:</para>
        <informalexample>
<screen><prompt>A:\></prompt> <userinput>FDISK /MBR</userinput></screen> 
        </informalexample>
        <para>pour r&eacute;installer le code d'origine de d&eacute;marrage simple du DOS 
          seul sur le syst&egrave;me. Vous pouvez alors d&eacute;marrer DOS (et DOS 
          uniquement) depuis le disque dur. Une autre solution consiste &agrave; 
          r&eacute;ex&eacute;cuter le programme d'installation de votre gestionnaire de 
          d&eacute;marrage &agrave; partir d'une disquette d&eacute;marrable.</para>
      </sect3>
    </sect2>
  </sect1>
</article>
