<!-- $FreeBSD$
     $FreeBSDes: doc/es_ES.ISO8859-1/articles/mailing-list-faq/article.sgml,v 1.1 2004/10/24 15:42:30 carvay Exp $
  Traducido de la version 1.4
The FreeBSD Documentation Project -->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN"> 
%freebsd;
<!ENTITY % newsgroups PUBLIC "-//FreeBSD//ENTITIES DocBook Newsgroup Entities//ES"> 
%newsgroups;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//ES"> 
%mailing-lists;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//ES"> 
%translators;
<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//EN"> 
%trademarks;
<!ENTITY % not.published "IGNORE">

<!-- <!ENTITY % articles.ent PUBLIC "-//FreeBSD//ENTITIES DocBook FreeBSD Articles Entity Set//EN">
%articles.ent; -->
]>

<article>
  <articleinfo>
  <title>Preguntas m&aacute;s frecuentes sobre las listas de correo de
  &os;</title>

    <authorgroup>
      <author>
	<surname>El Proyecto de Documentaci&oacute;n de &os;</surname>
      </author>
    </authorgroup>


    <copyright>
      <year>2004</year>
      <holder>El Proyecto de Documentaci&oacute;n de &os;</holder>
    </copyright>

    <abstract>
      <para>Estas son las FAQ de las listas de correo de &os;.  Si est&aacute;
	interesado en colaborar con este proyecto env&iacute;e un correo
	eletr&oacute;nico a &a.doc;.  La versi&oacute;n m&aacute;s reciente de 
	este documento siempre puede obtenerse en <ulink
	url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/mailing-list-faq/index.html">servidor
	web mundial de &os;</ulink>.  Tambi&eacute;n se puede descargar como
	un &uacute;nico archivo HTML en <ulink
	url="article.html">HTML</ulink> o como texto plano,
	PostScript, PDF, etc. desde el <ulink
	url="ftp://ftp.FreeBSD.org/pub/FreeBSD/doc/">Servidor FTP de
	&os; </ulink>.  Puede usted hacer <ulink
	url="http://www.FreeBSD.org/search/index.html">b&uacute;squedas en las
	FAQ</ulink>.
      </para> 
	&trans.es.jrh;
    </abstract> 
    
  </articleinfo>

  <sect1 id="introduction">
    <title>Introducci&oacute;n</title>

    <para>Como suele ocurrir en las FAQs este documento intenta
      abarcar las preguntas m&aacute;s frecuentes sobre las listas
      de correo de &os; (y por supuesto tambi&eacute;n pretendemos dar
      respuestas a dichas preguntas).  Aunque originalmente el
      objetivo de esta lista de preguntas era reducir el ancho de
      banda y evitar que se preguntaran una y otra vez las mismas
      cuestiones, las FAQ han evolucionado hasta convertirse en
      recursos de informaci&oacute;n muy valiosos.</para>

    <para>Este documento intenta representar el consenso actual de la
      comunidad y como tal no se puede considerar <emphasis>la opini&oacute;n 
      oficial del proyecto como tal</emphasis>.  No obstante, si 
      el lector encontrara errores t&eacute;nicos dentro del presente
      art&iacute;culo, o si se deseara realizar sugerencias sobre puntos que
      debieran tratarse en este documento, por favor o bien rellene un
      informe de problemas o env&iacute;e un correo eletr&oacute;nico a 
      &a.doc;.  Gracias.</para>

    <qandaset>
      <qandaentry>
	<question id="purpose">
	  <para>&iquest;C&uacute;al es el prop&oacute;sito de las listas de 
	    correo de &os;?</para>
	</question>

	<answer>
	  <para>Las listas de correo de &os; constituyen el canal de
	    principal de comunicaci&oacute;n de la comunidad &os; y cubren
	    varias &aacute;reas y comunidades de inter&eacute;s 
	    diferentes.</para>
	</answer> 
      </qandaentry>

      <qandaentry>
	<question id="audience">
	  <para>&iquest;Cu&aacute;l es la audiencia de las listas de correo de
	    &os;?</para> 
	</question>

	<answer>
	  <para>Esto depende del cometido oficial de cada lista en
	    particular.  Algunas listas se encuentran m&aacute;s orientadas a
	    los desarrolladores; otras est&aacute;n m&aacute;s orientadas
	    hacia la comunidad de usuarios de &os; en general.  Por favor, 
	    consulte <ulink
	    url="http://lists.FreeBSD.org/mailman/listinfo">esta
	    lista</ulink> si quiere consultar una lista actualizada de los 
	    cometidos de las listas.</para>
	</answer> 
      </qandaentry>

      <qandaentry>
	<question id="participation-who">
	  <para>&iquest;Las listas de &os; son abiertas, es decir, el 
	    p&uacute;blico en general puede participar en
	    ellas?</para>
	</question>

	<answer>
	  <para>Una vez m&aacute;s esto depende del cometido oficial de cada
	    lista en particular.  Por favor, consulte el 
	    <quote>charter</quote> (la declaraci&oacute;n del cometido de las 
            listas de correo) antes de enviar correo a la lista 
	    y siga la filosof&iacute;a de dicha lista en los env&iacute;os 
	    que haga a dicha lista.  Esto ayudar&aacute; al resto de usuarios 
	    a sacar m&aacute;s provecho de la lista.</para>

	  <para>Si depu&eacute;s de leer las listas anteriores todav&iacute;a no
	    ha podido discernir a qu&eacute; lista debe enviar su pregunta 
	    probablemente pueda enviar la consulta a la lista 
	    <quote>freebsd-questions</quote> (pero por favor lea m&aacute;s 
	    abajo antes de hacerlo)</para>

	  <para>Tenga en cuenta tambi&eacute;n que las listas de correo
	    tradicionalmente han estado abiertas a la recepci&oacute;n de
	    correo por parte de subscriptores y no subscriptores.  
	    Esto ha sido algo com&uacute;n y deliberado durante a&ntilde;os, 
	    para hacer m&aacute;s simple el proceso de entrada en la comunidad
	    &os; y para animar y fomentar la puesta en com&uacute;n de ideas.  
	    No obstante, debido a los abusos de env&iacute;o masivo de
	    correos por parte de algunos individuos, ciertas listas 
	    aplican una pol&iacute;tica seg&uacute;n la cual los correos
	    enviados por personas no subscritas deben ser procesados
	    manualmente para asegurarse de que cumplen con el objetivo
	    enunciado en el programa oficial de la lista.</para> 
	 </answer> 
      </qandaentry>

      <qandaentry>
	<question id="subscribe">
	  <para>&iquest;C&oacute;mo me puedo subscribir?</para>
	</question>

	<answer>
	  <para>Use <ulink
	    url="http://lists.FreeBSD.org/mailman/listinfo">
	    el interfaz web Mailman</ulink> para subscribirse a
	    cualquiera de las listas p&uacute;blicas.</para>
	</answer>
      </qandaentry>

      <qandaentry>
	<question id="unsubscribe">
	  <para>&iquest;C&oacute;mo me puedo dar de baja?</para>
	</question>

	<answer>
	  <para>Se puede utilizar exactamente el mismo interfaz que en
	    el caso anterior, o se pueden seguir las instrucciones que
	    se a&ntilde;aden autom&aacute;ticamente al final de cualquier 
	    mensaje publicado en la lista.</para>

	  <para>Por favor, no env&iacute;e mensajes de baja directamente a la
	    lista de correo.  En primer lugar, no se conseguir&aacute; el
	    objetivo (que es darse de baja) y en segundo lugar,
	    indudablemente se molesta a los subscriptores y es posible que 
	    sea usted increpado por ello.  Se trata de un error bastante 
	    com&uacute;n cuando se comienza a utilizar listas de
	    correo; por favor, intente evitarlo.</para> </answer>
	    </qandaentry>

      <qandaentry>
	<question id="archives">
	  <para>&iquest;Hay archivos hist&oacute;ricos de las listas 
	    en alg&uacute;n sitio?</para>
	</question>

	<answer>
	  <para>S&iacute;.  
	    <ulink url="http://docs.FreeBSD.org/mail/">aqu&iacute;</ulink> 
	   puede consultar los correos enviados a las listas agrupados por 
	   hilos.</para>
	</answer>
      </qandaentry>

      <qandaentry>
	<question id="digest">
	  <para>&iquest;Las listas de correo soportan mensajes en formato
	  resumen (<quote>digest</quote>)?</para>
	</question>

	<answer>
	  <para>Si.  Consulte <ulink
	    url="http://lists.FreeBSD.org/mailman/listinfo">
	    el interfaz web de Mailman</ulink>.</para>
	</answer>
      </qandaentry>
    </qandaset>
  </sect1>

  <sect1 id="etiquette">
    <title>Normas de protocolo de las listas de correo</title>

    <para>La participaci&oacute;n en listas de correo, como la 
      colaboraci&oacute;n en cualquier otra comunidad, se fundamenta en unas 
      bases o estructuras comunes sobre las cuales el proceso comunicativo
      tiene lugar.  Por favor, recuerde enviar solamente
      preguntas o respuestas adecuadas y siga las siguientes reglas
      de protocolo.</para>

    <qandaset>
      <qandaentry>
	<question id="before-posting">
	  <para>&iquest;Qu&eacute; debo hacer antes de enviar un correo?</para>
	</question>

	<answer>
	  <para>Usted ha completado el paso m&aacute;s importante al comenzar
	    a leer este documento.  No obstante, si es principiante en
	    &os;, puede que deba familiarizarse usted
	    mismo con el software y la historia que lo envuelve y lo
	    ha hecho evolucionar, leyendo los numerosos <ulink
	    url="http://www.FreeBSD.org/docs.html#books">libros</ulink> y <ulink
	    url="http://www.FreeBSD.org/docs.html#articles">art&iacute;culos</ulink> que
	    el proyecto mantiene.  Son puntos de particular
	    inter&eacute;s el documento de <ulink
	    url="http://www.FreeBSD.org/doc/en/books/faq/index.html"> Las Preguntas M&aacute;s
	    Frecuentes en &os;</ulink>, el <ulink
	    url="http://www.FreeBSD.org/doc/en/books/handbook/index.html">El Handbook de &os;
	    </ulink>, y los art&iacute;culos <ulink
	    url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/freebsd-questions/article.html">
	    C&oacute;mo obtener los mejores resultados de la lista de correo
	    Freebsd-questions</ulink>, <ulink
	    url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/explaining-bsd/article.html">
	    Qu&iacute; es BSD</ulink> (existen una versi&oacute;n en castellano de este 
	    texto en <ulink 
	    url="http://www.freebsd.org/doc/es_ES.ISO8859-1/articles/explaining-bsd/article.html">
	    </ulink>)
	    y <ulink
	    url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/new-users/article.html"> 
	    Primeros pasos en &os;</ulink>.</para>

	  <para>Enviar una consulta sobre algo que ya est&aacute; 
	    explicado profusamente en uno o m&aacute;s de los anteriores 
	    documentos se considera malas formas.  
	    Esto ocurre no porque los voluntarios que
	    colaboran en las listas sean personas especialmente
	    susceptibles, sino porque despu&eacute;s de un cierto tiempo
	    respondiendo una y otra vez las mismas preguntas las
	    personas comienzan a sentirse frustradas.  Esto es particularmente
	    cierto si dicha documentaci&oacute;n contiene la respuesta.  
	    Recuerde siempre que casi todo el trabajo que implica el 
	    desarrollo y mantenimiento de &os; es llevado a cabo por 
	    personal voluntario, es decir, <emphasis>humanos</emphasis>, que 
	    por lo tanto se comportan como tales y tienen los problemas que 
	    suelen tener los humanos.</para> </answer>

      </qandaentry>
      <qandaentry>
	<question id="inappropriate">
	  <para>&iquest;Qu&eacute; se puede considerar como un mensaje
	  adecuado?</para>
	</question>

	<answer>
	  <itemizedlist>
	    <listitem>
	      <para>Los env&iacute;os de mensajes deben adecuarse al programa
	      oficial de la lista o <emphasis>charter</emphasis>.</para>
	    </listitem>

	    <listitem>
	      <para>Por favor, evite los ataques personales.  Como buenos 
	        cuidadanos de internet debemos intentar mantener un
	        gran respeto a nuestros est&aacute;ndares de
	      conducta.</para>
	    </listitem>

	    <listitem>
	      <para>No se permite el <quote>spam</quote>, en ning&uacute;n 
		caso.  Las listas de correo se procesan constantemente para 
		asegurarse del cumplimiento de esta regla.</para>
	    </listitem>
	  </itemizedlist>
	</answer>
      </qandaentry>

      <qandaentry>
	<question id="etiquette-posting">
	  <para>&iquest;Qu&eacute; se considera como una norma de etiqueta 
	  apropiada cuando se env&iacute;a correos a las listas?</para>
	</question>

	<answer>
	  <itemizedlist>
	    <listitem>
	      <para>Por favor ajuste todas las l&iacute;neas a 75 caracteres,
	      ya que no todo el mundo utiliza programas de correo con
	      interfaces gr&aacute;ficas avanzados.</para>
	    </listitem>

	    <listitem>
	      <para>Por favor, tenga presente el hecho de que el ancho de
		banda no es un recurso infinito.  No todo el mundo lee el correo
		electr&oacute;nico a trav&eacute;s de conexiones de alta 
		velocidad, de forma que si sus mensajes contienen adjuntos
		tales como el contenido del fichero
		<filename>config.log</filename> (por poner un
		ejemplo) o una amplia traza de la pila del sistema,
		por favor, piense en la posibilidad de colocar dicha 
		informaci&oacute;n en un sitio web y proporcione simplemente 
		un enlace a dicho sitio en su mensaje.  Recuerde tambi&eacute;n 
		que dichos mensajes se archivar&aacute;n durante largo tiempo, 
		as&iacute; que env&iacute;os enormes s&oacute;lamente sirven 
		para inflar el tama&ntilde;o de los archivos una vez que se ha 
		solucionado el problema que se preguntaba.
	      </para> 
	    </listitem>

	    <listitem>
	      <para>Formatee su mensaje de forma que sea legible y &iexcl; POR
		FAVOR NO GRITE !.  No sobreestime el efecto de un
		mensaje de correo mal formateado y no s&oacute;lo en las
		listas de correo de &os;.  Su mensaje de correo es
		todo lo que la gente conoce de usted y si se encuentra
		mal estructurado, mal escrito, lleno de errores y/o
		posee muchas exclamaciones o interjecciones la
		impresi&oacute;n de la gente respecto a usted ser&aacute; 
		pobre y negativa.</para> </listitem>

	    <listitem>
	      <para>Por favor utilice el idioma (y el l&eacute;xico) apropiado
		para cada lista de correo.  Existen muchas listas de habla no 
		inglesa, consulte el siguiente <ulink
		url="http://www.freebsd.org/support.html#mailing-list-languages">
		enlace</ulink>.</para>

	      <para>Tenemos muy en cuenta a aquellas personas que hablan 
		lenguas distintas del ingl&eacute;s y la dificultad que 
		puede entra&ntilde;ar el comunicarse en una lengua que no es 
		la materna.  Criticar a hablantes de ingl&eacute;s no 
		nativos por su pobre gram&aacute;tica o los errores de su 
		escritura se consideran (muy) malos modos.  
		&os; posee un excelente bagaje en este tema; por favor 
		ay&uacute;denos a mantener esta
		tradici&oacute;n.</para> 
	    </listitem>

	    <listitem>
	      <para>Por favor utilice agentes de correo
		(<emphasis>Mail User Agent (MUA)</emphasis> en ingl&eacute;s)
		que cumplan los est&aacute;ndares de correo eletr&oacute;nico.  
		Muchos mensajes de correo mal estructurados tienen su origen 
		en <ulink
		url="http://www.lemis.com/email.html">malos clientes o
		clientes mal configurados</ulink>.  Los siguientes
		agentes son tristemente conocidos por lo mal que
		estructuran y formatean los mensajes de correo sin que
		usted se de cuenta de ello:
	      </para>

	      <itemizedlist>
		<listitem>
		  <para>cc:Mail</para>
		</listitem>

		<listitem>
		  <para>&eudora; (versiones antiguas)</para>
		</listitem>

		<listitem>
		  <para>exmh</para>
		</listitem>

		<listitem>
		  <para>&microsoft; Exchange</para>
		</listitem>

		<listitem>
		  <para>&microsoft; Internet Mail</para>
		</listitem>

		<listitem>
		  <para>&microsoft; &outlook;</para>
		</listitem>

		<listitem>
		  <para>&netscape; (versiones antiguas)</para>
		</listitem>
	      </itemizedlist>

	      <para>Como puede verse los agentes de correo
		relacionados con el mundo Microsoft son los que m&aacute;s
		frecuentemente inclumplen los est&aacute;ndares.  Si es
		posible utilice un agente de correo &unix;.  Si no le
		queda m&aacute;s remedio que utilizar un cliente de correo
		bajo entornos Microsoft aseg&uacute;rese de que lo ha 
		configurado apropiadamente.  Intente no utilizar
		<acronym>MIME</acronym>: muchos usuarios todav&iacute;a
		utilizan lectores de correo que no digieren bien
		dichos tipos.</para> 
	    </listitem>

	    <listitem>
	      <para>Aseg&uacute;rese de que su tiempo y zona horaria 
		est&aacute;n correctamente configurados.  Esto puede
		parecer un poco est&uacute;pido a primera vista, pero tenga
		en cuenta que no es extra&ntilde;o recibir cientos de
		mensajes durante las 24 horas del d&iacute;a.  Normalmente
		dichos mensajes se clasifican por asunto o por fecha y
		si su mensaje no se localiza antes de la primera
		respuesta, los subscriptores de la lista pueden llegar
		a pensar que no recibieron la consulta y no consultar 
		el resto de mensajes relacionados.</para>
	    </listitem>

	    <listitem>
	      <para>La gran mayor&iacute;a de las veces se ver&aacute; en la
		tesitura de adjuntar salidas de programas en sus
		mensajes, tales como &man.dmesg.8; o mensajes de
		consola, como los que normalmente aparecen en
		<filename>/var/log/messages</filename>.  No intente
		copiar estas informaciones tecleandolas manualmente;
		no s&oacute;lo es un trabajo penoso si no que es
		muy probable que se cometan errores.  Para enviar
		contenidos de ficheros de <quote>log</quote> o bien haga una
		copia del fichero para que sea adjuntado al mensaje
		previa eliminaci&oacute;n de la informaci&oacute;n no relevante,
		 o bien utilice el m&eacute;todo de copiar y pegar.  Para la
		salida de programas tales como
		<command>dmesg</command>, redireccione la salida a un
		fichero y utilice alguno de los procedimientos
		anteriores.  Por ejemplo,</para>

		  <screen>&prompt.user; <userinput>dmesg &gt; /tmp/dmesg.out</userinput></screen>

	      <para>Esto redirige la informaci&oacute;n a
	      <filename>/tmp/dmesg.out</filename>.</para>
	    </listitem>

	    <listitem>
	      <para>Cuando se utilice el m&eacute;todo copiar y pegar, por
		favor tenga en consideraci&oacute;n que algunas veces dichas
		operaciones desordenan el resultado y el formateo de
		su mensaje de correo.  Este hecho es de particular
		importancia cuando se trata de enviar el contenido de
		ficheros <filename>Makefile</filename>, donde el
		<literal>tabulador</literal> es un car&aacute;cter separador
		muy importante.  Este es uno de los
		problemas m&aacute;s comunes de los env&iacute;os a la
		<ulink 
		url="http://www.FreeBSD.org/support.html#gnats">base de 
		datos de Informes de Problemas GNATS</ulink>.  
		Los <filename>Makefile</filename> con tabuladores
		transformados en espacios, o transformados en la
		secuencia de escape ASCII <literal>=38</literal>,
		crean una especial exasperaci&oacute;n entre los
		commiters.</para> 
	    </listitem> 
	  </itemizedlist> 
	</answer> 
      </qandaentry>

      <qandaentry>
	<question id="etiquette-replying">
	  <para>&iquest;Cu&aacute;les son las consideraciones especiales de 
	  etiqueta cuando se responde a un mensaje en las listas de
	  correo?</para>
	</question>
	
	<answer>
	  <itemizedlist>
	    <listitem>
	      <para>Por favor incluya el texto del mensaje original
		que considere relevante.  Cualquier otra persona que
		no ley&oacute; el mensaje original deber&iacute;a ser capaz de
		entender de qu&eacute; se est&aacute; hablando.</para>

	      <para>Esto es particularmente importante en el caso de
		env&iacute;os del estilo de "si, yo tambi&eacute;n veo esto", 
		donde el mensaje original formado por cientos de l&iacute;neas 
		no aparece.</para> 
	    </listitem>

	    <listitem>
	      <para>Utilice alguna t&eacute;cnica para discernir entre el
		texto del mensaje original y el texto que
		usted a&ntilde;ada.  Un est&aacute;ndar de facto consiste en
		prefijar el mensaje original con <quote><literal>&gt;
		</literal></quote>.  Dejar espacios en blanco despu&eacute;s 
		de <quote><literal>&gt; </literal></quote> y dejar
		l&iacute;neas en blanco entre nuestro texto y el texto
		original.  Todos estos consejos dan como resultado una
		respuesta al mensaje m&aacute;s <quote>legible</quote>.</para>
	    </listitem>

	    <listitem>
	      <para>Por favor, aseg&uacute;rese de que las atribuciones de
		texto que se cita son correctas, es decir, de que
		realmente pertenecen a la persona que usted dice.  La
		gente puede llegar a ofenderse si se atribuyen
		palabras a personas que no las dijeron.</para>
	    </listitem>

	    <listitem>
	      <para>Por favor no responda al principio (<literal>top
		post</literal> en ingl&eacute;s).  Es decir, a&ntilde;ada sus
		comentarios al final del texto que copia en su
		mensaje.</para> 
		
		<!-- aviso: la pregunta y la respuesta se encuentran
		intercambiadas intencionadamente para provocar un
		efecto humor&iacute;stico --> 
		
	      <itemizedlist> 
		<listitem> 
		  <para>R: Es porque se invierte el flujo l&oacute;gico de la 
		  conversaci&oacute;n.</para> 
		</listitem> 
		
		<listitem> 
		  <para>P:&iquest;Por qu&eacute; el 
		    <quote>top posting</quote> <emphasis>no</emphasis>
		  est&aacute; bien visto?</para> 
		</listitem> 
	      </itemizedlist> 
	      
	      <para>(Gracias a Randy Bush por la broma.)</para>
	    </listitem> 
	  </itemizedlist> 
	</answer> 
      </qandaentry> 
    </qandaset> 
  </sect1>

  <sect1 id="recurring">
    <title>Asuntos recurrentes en las listas de correo</title>

    <para>La participaci&oacute;n en las listas de correo, as&iacute; como la
      participaci&oacute;n en cualquier otra comunidad, se basa en una serie
      de normas b&aacute;sicas para posibilitar el hecho comunicativo.  
      La participaci&oacute;n en algunas listas de correo implican el 
      el conocimiento de la historia del Proyecto &os;.  
      Existen ciertos temas que suelen aparecer en las mentes de los 
      <quote>nuevos</quote> una y
      otra vez.  Es responsabilidad de cada participante el comprobar
      que sus mensajes no caen en alguna de las siguientes categor&iacute;as.  
      Asegurando esto, se ayuda a mantener a la lista en su asunto o
      tema m&aacute;s actual, y tambi&eacute;n se evitan las acusaciones que la
      gente puede verter hacia usted por no seguir esta regla.</para>

    <para>El mejor m&eacute;todo para evitar esto consiste en familiarizarse
      con los <ulink
      url="http://docs.FreeBSD.org/mail/">archivos de las
      listas</ulink>; as&iacute; sabr&aacute; qu&eacute; temas que se han 
      tratado con anterioridad.  En este aspecto resulta de gran valor 
      el <ulink
      url="http://www.FreeBSD.org/search/search.html#mailinglists">
      interfaz de b&uacute;squeda de la lista de correo</ulink>.  (Si este
      m&eacute;todo no proporciona resultados &uacute;tiles, por favor 
      complem&eacute;ntelo con una b&uacute;squeda en su motor de 
      b&uacute;squedas favorito).</para>


    <para>Si se familiariza con los archivos hist&oacute;ricos  no solo 
      conocer&aacute; los temas que se han tratado anteriormente, tambi&eacute;n
       aprender&aacute; c&oacute;mo se produce la discusi&oacute;n en la lista,       qui&eacute;nes son los participales y cu&aacute;l es la audiencia que 
      que se espera.  Estos puntos 
      conviene conocerlos antes de preguntar en cualquier lista de
      correo, no s&oacute;lo en las de &os;.</para>

    <para>No hay lugar a discusi&oacute;n alguna si afirmamos que los
      archivos son bastante extensos y tambi&eacute;n si reconocemos que
      algunas preguntas son m&aacute;s recurrentes que otras, algunas veces
      camufladas dentro de hilos donde la l&iacute;nea de asunto no refleja
      precisamiente el nuevo contenido del mensaje.  En cualquier
      caso, la pesada carga est&aacute; en su territorio, el del
      <quote>poster</quote> o persona que env&iacute;a mensajes a la lista,
      debiendo realizar su trabajo para poder evitar estos temas
      recursivos y en particular los muy temidos
      <quote><literal>bikeshed</literal>s</quote>.  </sect1>

  <sect1 id="bikeshed">
    <title>&iquest;Que es un "bikeshed"?</title>
      <para>Literalmente, un <literal>bikeshed</literal> es un
	cobertizo exterior donde se puede almacenar un veh&iacute;culo de dos
	ruedas.  No obstante en la jerga de &os; la
	palabra se considera como un t&eacute;rmino disuasorio que se refiere
	a cualquier discusi&oacute;n frecuentemente recurrente sobre un
	determinado tema, en particular, se utiliza a menudo para
	identificar un tema sobre el que no se ha podido llegar a
	ning&uacute;n acuerdo dentro de la comunidad &os; y que permanece
	como algo controvertido.  (La g&eacute;nesis de este significado se
	explica con m&aacute;s detalle <ulink
	url="http://www.freebsd.org/doc/en_US.ISO8859-1/books/faq/misc.html#BIKESHED-PAINTING">
	en este texto</ulink>).  Simplemente se trata de conocer
	previamente a qu&eacute; se refiere este t&eacute;rmino antes de 
	empezar a enviar mensajes a cualquier lista de correo de 
	&os;.</para>
     
      <para>De una forma m&aacute;s general un <quote>bikeshed</quote> es un
	asunto que tiende a generar inmediatamente meta-discusiones y
	pasiones ardientes si no se han le&iacute;do pasadas 
	discusiones.</para>

      <para>Por favor, colabore en el mantenimiento de las listas de
	correo evitando los <quote>bikesheds</quote> siempre que
	pueda.  Gracias.</para> 
  </sect1>

  <sect1 id="acknowledgments">
    <title>Agradecimientos</title>

      <variablelist>
	<varlistentry>
	  <term>&a.grog;</term>
	  <listitem>
	    <para>Autor original de la mayor parte del material que
	    cubre las normas de etiqueta de las listas, tomadas del
	    art&iacute;culo <ulink
	      url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/freebsd-questions/">
	      C&oacute;mo obtener los mejores resultados de la lista de
	      correo <quote>FreeBSD-questions</quote> </ulink>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>&a.linimon;</term>
	  <listitem>
	    <para>Por la creaci&oacute;n del borrador inicial de esta
	    FAQ.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
  </sect1>

</article>
