freebsd/freebsd-doc/ja/man/man5/aliases.5
.\" Copyright (c) 1983, 1997 Eric P. Allman
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)aliases.5	8.3 (Berkeley) 2/1/97
.\" jpman %Id: aliases.5,v 1.3 1998/05/28 15:47:09 kuma Stab %
.\"
.\" WORD: alias	(名)別名(sendmail),エイリアス(csh)(動)エイリアスする(sendmail)[aliases.5,csh.1]
.\"
.Dd February 1, 1997
.Dt ALIASES 5
.Os BSD 4
.Sh 名称
.Nm aliases
.Nd sendmail のためのエイリアスファイル
.Sh 書式
.Nm aliases
.Sh 解説
このファイルには、
.Pa /usr/sbin/sendmail
が使用する、ユーザ
.Tn ID
の別名を記述します。
このファイルは
.Pa /etc
に置かれる、下記の形式の一連の行です。
.Bd -filled -offset indent
name: name_1, name_2, name_3, . . .
.Ed
.Pp
.Em name
はエイリアスする名前、
.Em name_n
はその名前の別名です。
空白ではじまる行は継続行です。
.Ql #
ではじまる行はコメントです。
.Pp
エイリアスはローカル名でのみ適用されます。
ループは起りえません。
なぜなら、メッセージは同じ人に複数回送られないからです。
.Pp
エイリアス適用後、ローカルかつ有効な受信者で
.Dq Pa .forward
ファイルをホームディレクトリに持つ人のメッセージは、
このファイルに定義された一連のユーザに転送されます。
.Pp
これは単なる生のデータファイルです;
実際のエイリアス情報は
.Xr newaliases 1
プログラムを使用することにより、バイナリ形式でファイル
.Pa /etc/aliases.db
に置かれます。aliases ファイルを更新したときには、その内容を反映させるために、
.Xr newaliases
コマンドを実行する必要があります。
.Sh 関連項目
.Xr newaliases 1 ,
.Xr dbm 3 ,
.Xr dbopen 3 ,
.Xr sendmail 8
.Rs
.%T "SENDMAIL Installation and Operation Guide"
.Re
.Rs
.%T "SENDMAIL An Internetwork Mail Router"
.Re
.Sh バグ
.Xr sendmail
を NEWDB サポート付きではなく DBM サポート付きでコンパイルした時には、
エイリアス 1 つがおよそ 1000 バイトまでの情報に限るという
.Xr dbm 3
の制約が問題となるかもしれません。
このような場合に長いエイリアスを使用するためには ``連鎖'' を使用します;
これは別名の最後の名前をダミーの名前にし、
これを引続き別の別名として使用するというものです。
.Sh 歴史
.Nm
ファイルフォーマットは
.Bx 4.0
に登場しました。
