freebsd/freebsd-doc/ja/man/man5/fdesc.5
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: fdesc.5,v 1.2.2.2 1998/07/19 06:52:11 jkh Exp %
.\"
.\" jpman $Id: fdesc.5,v 1.1.1.1 1998-08-13 01:45:30 kuriyama Exp $
.\" WORD: file descriptor		ファイル記述子
.\" WORD: augment			(union マウントによる)重ね合わせ
.\"
.Dd December 14, 1996
.Dt fdesc 5
.Os BSD 4.4
.Sh 名称
.Nm fdesc
.Nd ファイル記述子ファイルシステム
.Sh 書式
fdesc	/dev	fdesc rw 0 0
.Sh 解説
ファイル記述子ファイルシステム、別名
.Nm fdesc
は、プロセス毎のファイル記述子の名前空間をグローバルなファイルシステムの
名前空間からアクセスする機能を提供します。
通常のマウントポイントは
.Pa /dev
であり、
.Pa /dev
の既存のエントリを置き換えるのではなく重ね合わせるために、
ファイルシステムを union マウントする必要があります。
.Pp
マウントポイントの内容は
.Pa fd ,
.Pa stderr ,
.Pa stdin ,
.Pa stdout 
および
.Pa tty
です。
.Pp
.Pa fd
はディレクトリで、その中身は、番号で表したファイルのリストとして見えます。
これらのファイルは、ディレクトリを読むプロセスが現在オープンしている
ファイルに対応しています。
.Pa /dev/fd/0
から
.Pa /dev/fd/#
までのファイルは記述子への参照であり、
ファイルシステムを通じてアクセスすることができます。
ファイル記述子がオープンされていて、ファイルをオープンしたときのモードが
既存の記述子のモードのサブセットである場合は、システムコール呼び出し
.Bd -literal -offset indent
fd = open("/dev/fd/0", mode);
.Ed
.Pp
と、システムコール呼び出し
.Bd -literal -offset indent
fd = fcntl(0, F_DUPFD, 0);
.Ed
.Pp
は等価です。
.Pp
ファイル
.Pa /dev/stdin ,
.Pa /dev/stdout
および
.Pa /dev/stderr
は
.Pa /dev/fd
サブディレクトリの対応するエントリへのシンボリックリンクとなります。
これらをオープンするのは、以下のシステムコール呼び出しと等価です。
.Bd -literal -offset indent
fd = fcntl(STDIN_FILENO,  F_DUPFD, 0);
fd = fcntl(STDOUT_FILENO, F_DUPFD, 0);
fd = fcntl(STDERR_FILENO, F_DUPFD, 0);
.Ed
.Pp
.Xr open 2
呼び出し時のフラグは
.Dv O_RDONLY , 
.Dv O_WRONLY
および
.Dv O_RDWR
以外は無視されます。
.Pp
.Pa /dev/tty
エントリはカレントプロセスの制御端末への間接参照です。
これは見かけ上は名前つきパイプ (FIFO) ですが、本物の制御端末デバイスと
全く同じ振舞いをします。
.Sh 関連ファイル
.Bl -tag -width /dev/stderr -compact
.It Pa /dev/fd/#
.It Pa /dev/stdin
.It Pa /dev/stdout
.It Pa /dev/stderr
.It Pa /dev/tty
.El
.Sh 関連項目
.Xr tty 4 ,
.Xr mount_devfs 8 ,
.Xr mount_fdesc 8
.Sh 歴史
.Nm 
ファイルシステムは
.Bx 4.4
で最初に登場しました。
.Nm
マニュアルページは
.Fx 2.2
で最初に登場しました。
.Sh 作者
.Nm
マニュアルページは
.An Mike Pritchard Aq mpp@FreeBSD.org
によって書かれたもので、
.An Jan-Simon Pendry
による
.Xr mount_fdesc 8
マニュアルページに基づいています。
