freebsd/freebsd-doc/ja/man/man5/pbm.5
.\"
.\"	%Id: pbm.5,v 1.1.2.4 1998/07/19 06:52:12 jkh Exp %
.\" jpman %Id: pbm.5,v 1.3 1998/04/29 11:36:38 kuma Stab %
.\"
.\" WORD: whitespace	空白
.\"
.Dd September 27, 1991
.Dt PBM 5
.Sh 名称
.Nm pbm
.Nd ボータブルビットマップファイルのフォーマット
.Sh 解説
ポータブルビットマップフォーマットは、
最低位の共通の白黒画像ファイルフォーマットです。
元々は、異なったタイプのマシン間で、
ビットマップ転送には適さないネットワークメーラを使用して、
ビットマップをメールで受け渡しする妥当な方法としてデザインされました。
現在は、多くのビットマップ変換フィルタ群の共通語として使用されています。
定義を以下に示します:
.Pp
.Bl -bullet -compact
.It
ファイルタイプを識別するための "マジックナンバ"。
pbm ファイルのマジックナンバは "P1" の 2 文字です。
.It
空白 (複数のブランク・TAB・CR・LF から成ります)。
.It
幅を ASCII 10 進数で表記します。
.It
空白。
.It
高さを ASCII 10 進数で表記します。
.It
空白。
.It
幅 * 高さの数のビット。各ビットは '1' または '0' で表し、
ビットマップ左上角を起点として通常の英語を読む向きに連続します。
.It
文字 '1' は黒を、'0' は白を表します。
.It
ビット部の空白は無視されます。
.It
\&"#" から行末までの文字列は無視されます (コメント)。
.It
長さが 70 文字を越える行は許されません。
.El
.Pp
以下に、このフォーマットでの小さなビットマップの例を示します:
.Bd -literal
P1
# feep.pbm
24 7
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 1 1 1 1 0 0 1 1 1 1 0 0 1 1 1 1 0 0 1 1 1 1 0
0 1 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 1 0 0 1 0
0 1 1 1 0 0 0 1 1 1 0 0 0 1 1 1 0 0 0 1 1 1 1 0
0 1 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0
0 1 0 0 0 0 0 1 1 1 1 0 0 1 1 1 1 0 0 1 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
.Ed
.Pp
このフォーマットを読むプログラムは可能な限り寛大になるべきで、
少しでもビットマップのように見えるものはなんでも受け付けるべきです。
.Pp
このフォーマットには派生形式があり、
RAWBITS オプションをコンパイル時にセットすることで利用可能です。
この派生形式は、以下の点が異なります:
.Pp
.Bl -bullet -compact
.It
\&"マジックナンバ" が "P1" ではなく "P4" です。
.It
8 ビットが 1 バイトに格納されます。上位ビットが先で下位ビットが後になります。
.It
ビット部には空白は許されませんし、
高さの後には単一の空白 (通常は改行) のみが許されます。
.It
ファイルは 1/8 の大きさになり、読み書きが何倍も高速になります。
.El
.Sh 作者
Copyright (C) 1989, 1991 by
.An Jef Poskanzer .
.\" Permission to use, copy, modify, and distribute this software and its
.\" documentation for any purpose and without fee is hereby granted, provided
.\" that the above copyright notice appear in all copies and that both that
.\" copyright notice and this permission notice appear in supporting
.\" documentation.  This software is provided "as is" without express or
.\" implied warranty.
