freebsd/freebsd-doc/ja/man/man5/rc.conf.5
.\" Copyright (c) 1995
.\"	Jordan K. Hubbard
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: rc.conf.5,v 1.1.2.11 1998/06/27 21:23:28 steve Exp %
.\"
.\" jpman %Id: rc.conf.5,v 1.3 1998/06/26 09:39:58 jsakai Stab %
.\"
.Dd April 26, 1997
.Dt RC.CONF 5
.Os FreeBSD 2.2.2
.Sh 名称
.Nm rc.conf
.Nd ローカルコンフィギュレーションの情報
.Sh 解説
.Nm rc.conf
ファイルはローカルホスト名、全ての潜在的なネットワークインタフェースに
関するコンフィギュレーションの詳細、システムの初期起動時に立ち上げるべき
サービスに関する記述可能な情報を含んできます。初めてインストールする際に
は、一般に
.Nm rc.conf
ファイルはシステムインストールユーティリティ
.Pa /stand/sysinstall
によって初期化されます。
.Pp
ローカルホスト上で変化が生じるたびにこのファイルを適切に保守することはシ
ステム管理者の仕事です。
.Sh 関連ファイル
.Bl -tag -width /etc/rc.conf -compact
.It Pa /etc/rc.conf
.El
.Sh 解説
.Nm
の目的は、
コマンドの実行やシステム起動操作を直接行うことではありません。
それに代わり、
そこに見出される設定にしたがって内部操作を条件付きで制御する
.Pa /etc
下のいろいろな類の起動スクリプトの一部をなしています。
.Pp
以下に示すのは
.Nm
ファイル中で設定可能な各変数について、
その名前と簡単な解説をリストしたものです。
.Bl -tag -width Ar
.It Ar swapfile
(文字列)
.Ar NO
にセットすると
スワップファイルはインストールされません。
.Ar NO
以外の場合、その値は追加スワップ領域のために利用するファイルの
完全パス名として用いられます。
.It Ar apm_enable
(ブール値)
.Ar YES
にセットすると
.Xr apm 8
コマンドでの自動電源管理(Automatic Power Management)のサポートを有効に
します。
.It Ar pccard_enable
(ブール値)
.Ar YES
にセットすると起動時にPCCARDのサポートを有効にします。
.It Ar pccard_mem
(文字列) PCCARDコントローラメモリアドレスをセットします。
.Ar DEFAULT
とするとデフォルト値になります。
.It Ar pccard_ifconfig
(文字列) 挿入または起動時に動的にifconfigされるべきイーサネットデバイス
のリストです。
(例
.Ar "ed0 ed1 ep0 ..." )
.It Ar local_startup
(文字列) 起動スクリプトファイルを検索するためのディレクトリのリストです。
.It Ar hostname
(文字列) ネットワーク上でのあなたのホストの完全な形のドメイン名 (The
Fully Qualified Domain Name) です。あなたがネットワークに接続されていない
場合でも、この変数は確実に何か意味のあるものに設定すべきです。
.It Ar nisdomainname
(文字列) あなたのホストの NIS ドメイン名。NIS が動いてないときは
.Ar NO
とします。
.It Ar firewall_enable
(ブール値) 起動時にロードされるファイアウォール規則を持ちたくないときには
.Ar NO
、持ちたいときには
.Ar YES 
をセットします。
.Ar YES
にセットし、かつカーネルが IPFIREWALL 付きで作られなかった場合、
ipfw カーネルモジュールがロードされます。
.It Ar firewall_type
(文字列)
.Pa /etc/rc.firewall
中で選択されたファイアウォールのタイプまたはローカルファイアウォール規則
の組を含むファイルを名付けます。
.Pa /etc/rc.firewall
中では以下のものが選択可能です: 
``open''- 無制限の IP アクセス;
``closed''- lo0 経由を除く全ての IP サービスを禁止;
``client''- ワークステーション向けの基本的な保護;
``simple''- LAN 向けの基本的な保護。
ファイル名が指定される場合には完全なパス名でなければなりません。
.It Ar firewall_quiet
(ブール値)
.Ar YES
にセットすると起動時にコンソール上で ipfw 規則の表示を行ないません。
.It Ar natd_enable
(ブール値)
.Ar YES
にセットすると natd を有効にします。
.Ar firewall_enable
もまた
.Ar YES
にセットされ、
.Xr divert 4
ソケットがカーネルで有効にされている必要があります。
.It Ar natd_interface
natd が実行されるパブリックインタフェースの名前です。
.Ar natd_enable
が
.Ar YES
にセットされている場合には、これを設定する必要があります。
.It Ar natd_flags
追加の natd フラグはここに記述する必要があります。
.Fl n
フラグは上記
.Ar natd_interface
とともに自動的に引数として追加されます。
.It Ar tcp_extensions
(ブール値) デフォルトでは
.Ar YES
です。これは RFC 1323 や 1644 で述べられているような
ある TCP オプションを有効にします。
もしネットワークコネクションが不規則にハングアップしたり、
それに類する他の不具合がある場合には、これを
.Ar NO
にセットして様子をみてみるのもよいかもしれません。世間に出回っている
ハードウェア/ソフトウェアの中には、これらのオプションでうまく動作しない
ものがあることが知られています。
.It Ar network_interfaces
(文字列) このホスト上で形成されるネットワークインタフェースのリストを
設定します。
たとえば、ループバックデバイス (標準) および SMC Elite Ultra NIC があるなら
.Qq Ar "lo0 ed0"
という 2 つのインタフェースを設定します。
.Em interface
の各値に対して
.No ifconfig_ Ns Em interface
という変数が存在すると仮定されます。
1 つのインタフェースに複数の IP アドレスを登録したい場合は、
ここに IP エイリアスのエントリを追加することも可能です。
対象とするインタフェースが ed0 であると仮定すると、
.Bd -literal
ifconfig_ed0_alias0="inet 127.0.0.253 netmask 0xffffffff" 
ifconfig_ed0_alias1="inet 127.0.0.254 netmask 0xffffffff"

.Ed
というようになります。
見つかった各 ifconfig_<interface>_alias<n> エントリについて、
その内容が
.Xr ifconfig 8
に渡されます。最初にアクセスに失敗した時点で実行は中止されるので
.Bd -literal
ifconfig_ed0_alias0="inet 127.0.0.251 netmask 0xffffffff"
ifconfig_ed0_alias1="inet 127.0.0.252 netmask 0xffffffff"
ifconfig_ed0_alias2="inet 127.0.0.253 netmask 0xffffffff"
ifconfig_ed0_alias4="inet 127.0.0.254 netmask 0xffffffff"

.Ed
のようにすると、alias4 は追加され\fB ない\fR ことに注意してください。これは
alias3 エントリを抜かしたことで検索が中止されるからです。
.It Ar syslogd_enable
(ブール値)
.Ar YES
にセットすると
.Xr syslogd 8
デーモンを起動します。
.It Ar syslogd_flags
(文字列) syslogd_enable が
.Ar YES
の場合、これらは
.Xr syslogd 8
に渡すフラグになります。
.It Ar inetd_enable
(ブール値)
.Ar YES
にセットすると
.Xr inetd 8
デーモンを起動します。
.It Ar inetd_flags
(文字列)inetd_enable が
.Ar YES
の場合、これらは
.Xr inetd 8
へ渡すフラグとなります。
.It Ar named_enable
(ブール値)
.Ar YES
にセットすると
.Xr named 8
デーモンを起動します。
.It Ar named_program
(文字列)
.Xr named 8
のパス。(デフォルトは
.Pa /usr/sbin/named )
.It Ar named_flags
(文字列)
.Ar named_enable
が
.Ar YES
の場合、これらは
.Xr named 8
に渡すフラグとなります。
.It Ar kerberos_server_enable
(ブール値) ブート時に Kerberos 認証サーバを起動したい場合は
.Ar YES
にセットします。
.It Ar kadmind_server_enable
.Xr kadmind 8
(Kerberos 管理デーモン) を実行したい場合は
.Ar YES
とします。スレーブサーバ上では
.Ar NO
にセットします。
.It Ar kerberos_stash
(文字列)
.Ar YES
なら (唯一
.Ar kerberos_server_enable
が
.Ar YES
にセットされ、かつ
.Xr kerberos 1
および
.Xr kadmind 8
の両方を用いるときにのみ) 隠されたマスタキーのプロンプト入力を行なう代りに、
そのキーを用いるよう Kerberos サーバに指示します。
.It Ar rwhod_enable
(ブール値)
.Ar YES
にセットするとブート時に
.Xr rwhod 8
デーモンを起動します。
.It Ar amd_enable
(ブール値)
.Ar YES
にセットするとブート時に
.Xr amd 8
デーモンを起動します。
.It Ar amd_flags
(文字列)
.Ar amd_enable
が
.Ar YES
にセットされている場合、これらは amd に渡すフラグとなります。
詳しくは\fBinfo amd\fR コマンドを利用してください。
.It Ar nfs_client_enable
(ブール値)
.Ar YES
にセットするとブート時に NFS クライアントデーモンを起動します。
.It Ar nfs_client_flags
(文字列)
.Ar nfs_client_enable
が
.Ar YES
の場合、これらは
.Xr nfsiod 8
デーモンに渡すフラグとなります。
.It Ar nfs_server_enable
(ブール値)
.Ar YES
にセットするとブート時に NFS サーバデーモンを起動します。
.It Ar nfs_server_flags
(文字列)
.Ar nfs_server_enable
が
.Ar YES
の場合、これらは
.Xr nfsd 8
デーモンに渡すフラグとなります。
.It Ar weak_mountd_authentication
(ブール値)
.Ar YES
にセットすると、権限付けられていないマウント要求を行なうために
\fBPCNFSD\fR のようなサービスを許可します。
.It Ar nfs_reserved_port_only
(ブール値)
.Ar YES
にセットすると、安全なポート上でのみ NFS サービスを提供します。
.It Ar rcp_lockd_enable
(ブール値) この変数が
.Ar YES
にセットされ、しかも NFS サーバである場合、ブート時に
.Xr rpc.lockd 8
を起動します。
.It Ar rcp_statd_enable
(ブール値) この変数が
.Ar YES
にセットされ、しかも NFS サーバである場合、ブート時に
.Xr rpc.statd 8
を起動します。
.It Ar portmap_enable
(ブール値)
.Ar YES
の場合、ブート時に
.Xr portmap 8
サービスを起動します。
.It Ar portmap_flags
(文字列)
.Ar portmap_enable
が
.Ar YES
の場合、これらは
.Xr portmap 8
デーモンに渡すフラグとなります。
.It Ar xtend_enable
(ブール値)
.Ar YES
にセットすると、ブート時に
.Xr xtend 8 
デーモンを起動します。
.It Ar xtend_flags
(文字列)
.Ar xtend_enable
が
.Ar YES
の場合、これらは
.Xr xtend 8
デーモンに渡すフラグとなります。
.It Ar timed_enable
(ブール値)
.Ar YES
なら、ブート時に
.Xr timed 8
サービスを実行します。このコマンドは、全ホストについて一貫した
.Qq "ネットワーク時間"
が確立されなければならないマシンネットワークのためにあります。
これが有用である典型例は、
ファイルのタイムスタンプがネットワークワイドで一貫性をもつことが
期待されるような、大規模 NFS 環境です。
.It Ar timed_flags
(文字列)
.Ar timed_enable
が
.Ar YES
の場合、これらは
.Xr timed 8
サービスに渡すフラグとなります。
.It Ar ntpdate_enable
(ブール値)
.Ar YES
にセットすると、システムスタートアップ時に ntpdate を実行します。
このコマンドは、ある標準的な参照先を元に、ただ
.Ar 1 回
だけシステム時刻を同期させるためにあります。
また、システムを最初にインストールする際、
これを (知られているサービスのリストから) 最初にセットアップするオプションが
.Pa /stand/sysinstall
プログラムによって提供されます。
.It Ar ntpdate_program
(文字列)
.Xr ntpdate 8
のパス
(デフォルトは
.Pa /usr/sbin/ntpdate
です)。
.It Ar ntpdate_flags
(文字列)
.Ar ntpdate_enable
が
.Ar YES
の場合、これらは
.Xr ntpdate 8
コマンドに渡すフラグとなります (典型的にはホスト名)。
.It Ar xntpd_enable
(ブール値)
.Ar YES
にセットすると、ブート時に
.Xr xntpd 8
コマンドが起動されます。
.It Ar xntpd_program
(文字列)
.Xr xntpd 8
のパス
(デフォルトは
.Pa /usr/sbin/xntpd
です)。
.It Ar xntpd_flags
(文字列)
.Ar xntpd_enable
が
.Ar YES
の場合、これらは
.Xr xntpd 8
デーモンに渡すフラグとなります。
.It Ar tickadj_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr tickadj 8
コマンドを実行します。
.It Ar tickadj_flags
(文字列)
.Ar tickadj_enable
が
.Ar YES
の場合、これらは
.Xr tickadj 8
コマンドに渡すフラグとなります。
.It Ar nis_client_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypbind 8
サービスを起動します。
.It Ar nis_client_flags
(文字列)
.Ar nis_client_enable
が
.Ar YES
の場合、これらは
.Xr ypbind 8
サービスに渡すフラグとなります。
.It Ar nis_ypset_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypset 8
デーモンを起動します。
.It Ar nis_ypset_flags
(文字列)
.Ar nis_ypset_enable
が
.Ar YES
の場合、これらは
.Xr ypset 8
デーモンに渡すフラグとなります。
.It Ar nis_server_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypserv 8
デーモンを起動します。
.It Ar nis_server_flags
(文字列)
.Ar nis_server_enable
が
.Ar YES
の場合、これらは
.Xr ypserv 8
デーモンに渡すフラグとなります。
.It Ar nis_ypxfrd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr ypxfrd 8
デーモンを起動します。
.It Ar nis_ypxfrd_flags
(文字列)
.Ar nis_ypxfrd_enable
が
.Ar YES
の場合、これらは
.Xr ypxfrd 8
デーモンに渡すフラグとなります。
.It Ar nis_yppasswdd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr yppasswdd 8
デーモンを起動します。
.It Ar nis_yppasswdd_flags
(文字列)
.Ar nis_yppasswdd_enable
が
.Ar YES
の場合、これらは
.Xr yppasswdd 8
デーモンに渡すフラグとなります。
.It Ar defaultrouter
(文字列)
.Ar NO
をセットしないと、このホスト名または IP アドレスへのデフォルトルートを
作成します (このルータがネームサーバへたどりつく必要がある
場合は IPアドレスを使用すること!)。
.It Ar static_routes
(文字列) システムブート時に追加したいスタティックルートのリストを
セットします。
.Ar NO
以外をセットした場合、その値を空白で区切った各要素について、
各
.Em element
毎に変数
.No route_ Ns em element
が存在すると仮定され、その後、``route add'' 操作に渡されます。
.It Ar gateway_enable
(ブール値)
.Ar YES
にセットすると、IP ルータとして動作する、
たとえばインタフェース間でパケットをフォワードするように
ホストを設定します。
.It Ar router_enable
(ブール値)
.Ar YES
にセットすると、
.Ar router
および
.Ar router_flags
の設定に基づいて、ある種のルーティングデーモンを実行します。
.It Ar router
(文字列)
.Ar router_enable
が
.Ar YES
にセットされると、これが使用するルーティングデーモン名になります。
.It Ar router_flags
(文字列)
.Ar router_enable
が
.Ar YES
にセットされると、これらがルーティングデーモンへ渡すフラグとなります。
.It Ar mrouted_enable
(ブール値)
.Ar YES
にセットすると、マルチキャストルーティングデーモン
.Xr mrouted 8
を起動します。
.It Ar mrouted_flags
(文字列)
.Ar mrouted_enable
が
.Ar YES
の場合、これらはマルチキャストルーティングデーモンへ渡すフラグとなります。
.It Ar ipxgateway_enable
(ブール値)
.Ar YES
にセットすると、IPX トラフィックのルーティングを有効にします。
.It Ar ipxrouted_enable
(ブール値)
.Ar YES
にセットすると、ブート時に
.Xr ipxrouted 8
デーモンを起動します。
.It Ar ipxrouted_flags
(文字列)
.Ar ipxrouted_enable
が
.Ar YES
の場合、これらは
.Xr ipxrouted 8
デーモンへ渡すフラグとなります。
.It Ar arpproxy_all
.Ar YES
にセットするとグローバルプロキシ ARP を有効にします。
.It Ar forward_sourceroute
これが
.Ar YES
にセットされ、更に
.Ar gateway_enable
もまた
.Ar YES
にセットされている場合、
送信元が経路指定したパケット (source routed packets) はフォワードされます。
.It Ar accept_sourceroute
.Ar YES
にセットすると、
システムは自分宛の送信元経路指定パケットを受け付けます。
.It Ar rarpd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr rarpd 8
デーモンを起動します。
.It Ar rarpd_flags
(文字列)
.Ar rarpd_enable
が
.Ar YES
の場合、これらは
.Xr rarpd 8
デーモンへ渡すフラグとなります。
.It Ar keymap
(文字列)
.Ar NO
にセットするとキーマップはインストールされません。それ以外の場合、
ここで指定した
.Ar value
がキーマップファイル
.Pa /usr/share/syscons/keymaps/<value>.kbd
をインストールするのに用いられます。
.It Ar keyrate
(文字列) キーボードのリピートスピードです。以下のいずれかにセットします。
.Ar slow ,
.Ar normal ,
.Ar fast
デフォルト値を希望する場合は
.Ar NO
とします。
.It Ar keychange
(文字列)
.Ar NO
以外にセットすると、その値でファンクションキーをプログラムしようとします。
指定できる値は単一の文字列で,
.Qq Ar "<funkey_number> <new_value> [<funkey_number> <new_value>]..."
という形式でないといけません。
.It Ar cursor
(文字列) カーソルの動作を明示的に指定する場合は
.Ar normal ,
.Ar blink ,
.Ar destructive
のいずれかの値にセットします。デフォルト動作を選ぶには
.Ar NO
とします。
.It Ar scrnmap
(文字列)
.Ar NO
にセットすると、スクリーンマップはインストールされません。
それ以外の場合には、ここで指定した
.Ar value
がスクリーンマップファイル
.Pa /usr/share/syscons/scrnmaps/<value>
をインストールするのに用いられます。
.It Ar font8x16
(文字列)
.Ar NO
にセットするとスクリーンサイズの要求に対しデフォルトの 8x16 フォント値が
用いられます。それ以外の場合は
.Pa /usr/share/syscons/fonts/<value>
の値が用いられます。
.It Ar font8x14
(文字列)
.Ar NO
にセットするとスクリーンサイズの要求に対しデフォルトの 8x14 フォント値が
用いられます。それ以外の場合は
.Pa /usr/share/syscons/fonts/<value>
の値が用いられます。
.It Ar font8x8
(文字列)
.Ar NO
にセットすると、スクリーンサイズの要求に対しデフォルトの 8x8 フォント値が
用いられます。それ以外の場合は
.Pa /usr/share/syscons/fonts/<value>
の値が用いられます。
.It Ar blanktime
(整数)
.Ar NO
にセットすると、デフォルトのスクリーンブランク時間間隔が用いられます。
それ以外の場合は
.Ar value 
秒にセットされます。
.It Ar saver
(文字列)
.Ar NO
以外にセットすると、これが実際に使用する
スクリーンセーバ (ブランク, 蛇, デーモンなど) となります。
.It Ar moused_enable
(文字列)
.Ar YES
にセットすると、コンソール上でのカット/ペーストセレクション用に
.Xr moused 8
デーモンが起動されます。
.It Ar moused_type
(文字列) 利用したいマウスのプロトコルのタイプ。
.Ar moused_enable
が
.Ar YES
の場合、この変数は必ず設定しなければなりません。
多くの場合、
.Xr moused 8
デーモンは適切なマウスタイプを自動的に検出することができます。
デーモンにマウスを検出させるには、この変数を
.Ar auto
にセットします。
自動検出が失敗する場合、以下のリストから 1 つを選びます。
.Bd -literal
microsoft        Microsoft マウス
intellimouse     Microsoft IntelliMouse
mousesystems     Mouse system 社製のマウス
mmseries         MM シリーズのマウス
logitech         Logitech 製のマウス
busmouse         バスマウス
mouseman         Logitech の MouseMan および TrackMan
glidepoint       ALPS 製の GlidePoint
thinkingmouse    Kensignton 製の ThinkingMouse
ps/2             PS/2 マウス
mmhittab         MM の HitTablet

.Ed
お使いのマウスが上記のリストにない場合でも、
リスト中のいずれかと互換性があるかも知れません。
互換性に関する情報については
.Xr moused 8
のマニュアルページを参照してください。
.Pp
また、
この変数が有効であるときは、(Xサーバのような) 他の全てのマウスクライアントは
仮想マウスデバイス
.Pa /dev/sysmouse
を通してマウスにアクセスし、
それを sysmouse タイプのマウスとして構成すべきであると
いうことにも注意すべきです。これは、
.Xr moused 8
使用時は、全てのマウスデータがこの単一の標準フォーマットに変換されるためです。
クライアントプログラムが sysmouse タイプを
サポートしないなら次に望ましいタイプとして mousesystems を指定してください。
.It Ar moused_port
(文字列)
.Ar moused_enable
が
.Ar YES
の場合、これはマウスが接続されている実際のポートになります。
たとえば、COM1 シリアルマウスに対しては
.Pa /dev/cuaa0
、PS/2 マウスに対しては
.Pa /dev/psm0
、バスマウスに対しては
.Pa /dev/mse0
となります。
.It Ar moused_flags
(文字列)
.Ar moused_type
がセットされている場合、これらは
.Xr moused 8
デーモンに渡す追加のフラグとなります。
.It Ar cron_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr cron 8
デーモンを起動します。
.It Ar lpd_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr lpd 8
デーモンを起動します。
.It Ar lpd_flags
(文字列)
.Ar lpd_enable
が
.Ar YES
の場合、これらは
.Xr lpd 8
デーモンに渡すフラグとなります。
.It Ar sendmail_enable
(ブール値)
.Ar YES
にセットすると、システムブート時に
.Xr sendmail 8
デーモンを起動します。
.It Ar sendmail_flags
(文字列)
.Ar sendmail_enable
が
.Ar YES
の場合、これらは
.Xr sendmail 8
デーモンに渡すフラグとなります。
.It Ar savecore_enable
(ブール値)
.Ar YES
にセットすると、クラッシュ後システムが復旧するとき、デバッグ用にカーネル
のクラッシュダンプを保存します。クラッシュイメージは通常
.Pa /var/crash
ディレクトリに格納されます。
.It Ar dumpdev
(文字列)
.Ar NO
にセットしないと、カーネルクラッシュダンプ出力先を
.Em value
で指定したスワップデバイスに向けます。
.It Ar check_quotas
(ブール値)
.Xr quotacheck 8
コマンドによってユーザディスクのクォータチェックを有効にしたいなら、
.Ar YES
にセットします。
.It Ar accounting_enable
(ブール値)
.Xr accton 8
ファシリティでシステムアカウンティングを有効にしたいなら
.Ar YES
にセットします。
.It Ar ibcs2_enable
(ブール値)
システム初期ブート時に iBCS2 (SCO) バイナリエミュレーションを有効にしたいなら
.Ar YES
にセットします。
.It Ar linux_enable
(ブール値)
システムブート時に Linux/ELF バイナリエミュレーションを有効にしたいなら
.Ar YES
にセットします。
.It Ar rand_irqs
(文字列) 乱数生成用に監視する IRQ のリストをセットします (
.Xr rndcontrol 8
のマニュアル参照)。
.It Ar clear_tmp_enable
(ブール値)
起動時に
.Pa /tmp
下を消去したいなら
.Ar YES
をセットします。
.It Ar ldconfig_paths
(文字列)
.Xr ldconfig 8
で使用する共有ライブラリのパスのリストをセットします。注意:
.Pa /usr/lib
は常に先頭に追加されるので、このリストに指定する必要はありません。

.Sh 関連項目
.Xr gdb 1 ,
.Xr info 1 ,
.Xr exports 5 ,
.Xr accton 8 ,
.Xr amd 8 ,
.Xr apm 8 ,
.Xr cron 8 ,
.Xr gated 8 ,
.Xr ifconfig 8 ,
.Xr inetd 8 ,
.Xr lpd 8 ,
.Xr moused 8 ,
.Xr mrouted 8 ,
.Xr named 8 ,
.Xr nfsd 8 ,
.Xr nfsiod 8 ,
.Xr ntpdate 8 ,
.Xr pcnfsd 8 ,
.Xr portmap 8 ,
.Xr quotacheck 8 ,
.Xr rc 8 ,
.Xr rndcontrol 8 ,
.Xr route 8 ,
.Xr routed 8 ,
.Xr rpc.lockd 8 ,
.Xr rpc.statd 8 ,
.Xr rwhod 8 ,
.Xr sendmail 8 ,
.Xr syslogd 8 ,
.Xr swapon 8 ,
.Xr tickadj 8 ,
.Xr timed 8 ,
.Xr vnconfig 8 ,
.Xr xntpd 8 ,
.Xr xtend 8 ,
.Xr ypbind 8 ,
.Xr ypserv 8 ,
.Xr ypset 8
.Sh 歴史
.Nm
ファイルは
.Fx 2.2.2 で登場しました。

.Sh 作者
Jordan K. Hubbard.
