Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/vinum/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018 Lucas Andrade, slucasandrade@protonmail.ch, 2018

source: The <filename>vinum</filename> Volume Manager
pt_br: O Gerenciador de Volume <filename>vinum</filename>

source: <personname> <firstname>Greg</firstname> <surname>Lehey</surname> </personname> <contrib>Originally written by </contrib>
pt_br: <personname> <firstname>Greg</firstname> <surname>Lehey</surname> </personname> <contrib>Escrito originalmente por </contrib>

source: Synopsis
pt_br: Sinopse

source: No matter the type of disks, there are always potential problems. The disks can be too small, too slow, or too unreliable to meet the system's requirements. While disks are getting bigger, so are data storage requirements. Often a file system is needed that is bigger than a disk's capacity. Various solutions to these problems have been proposed and implemented.
pt_br: Não importa o tipo de disco, sempre há problemas em potencial. Os discos podem ser muito pequenos, muito lentos ou pouco confiáveis para atender aos requisitos do sistema. Enquanto os discos estão ficando maiores, também ficam maiores os requisitos para armazenamento de dados. Geralmente, é necessário um sistema de arquivos maior que a capacidade de um disco. Várias soluções para esses problemas foram propostas e implementadas.

source: One method is through the use of multiple, and sometimes redundant, disks. In addition to supporting various cards and controllers for hardware Redundant Array of Independent Disks <acronym>RAID</acronym> systems, the base FreeBSD system includes the <filename>vinum</filename> volume manager, a block device driver that implements virtual disk drives and addresses these three problems. <filename>vinum</filename> provides more flexibility, performance, and reliability than traditional disk storage and implements <acronym>RAID</acronym>-0, <acronym>RAID</acronym>-1, and <acronym>RAID</acronym>-5 models, both individually and in combination.
pt_br: Um método é através do uso de vários discos, e às vezes discos redundantes. Além de suportar várias placas e controladoras para sistemas <acronym>RAID</acronym> (Redundant Array of Independent Disks), o sistema básico do FreeBSD inclui o gerenciador de volumes <filename>vinum</filename>, um driver de dispositivo de bloco que implementa discos virtuais e aborda esses três problemas. O <filename>vinum</filename> oferece mais flexibilidade, desempenho e confiabilidade do que o armazenamento em disco tradicional e implementa os modelos <acronym>RAID</acronym>-0, <acronym>RAID</acronym>-1 e <acronym> RAID</acronym>-5, tanto individualmente quanto combinados.

source: This chapter provides an overview of potential problems with traditional disk storage, and an introduction to the <filename>vinum</filename> volume manager.
pt_br: Este capítulo fornece uma visão geral dos possíveis problemas com o armazenamento em disco tradicional e uma introdução ao gerenciador de volumes <filename>vinum</filename>.

source: Starting with FreeBSD 5, <filename>vinum</filename> has been rewritten in order to fit into the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/geom.html">GEOM architecture</link>, while retaining the original ideas, terminology, and on-disk metadata. This rewrite is called <emphasis>gvinum</emphasis> (for <emphasis> GEOM vinum</emphasis>). While this chapter uses the term <filename>vinum</filename>, any command invocations should be performed with <command>gvinum</command>. The name of the kernel module has changed from the original <filename>vinum.ko</filename> to <filename>geom_vinum.ko</filename>, and all device nodes reside under <filename class="directory">/dev/gvinum</filename> instead of <filename class="directory">/dev/vinum</filename>. As of FreeBSD 6, the original <filename>vinum</filename> implementation is no longer available in the code base.
pt_br: Começando com o FreeBSD 5, o <filename>vinum</filename> foi reescrito para se encaixar na <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/geom.html">Arquitetura GEOM</link>, mantendo as idéias originais, a terminologia e os metadados no disco. Esta reescrita é chamada <emphasis>gvinum</emphasis> (para <emphasis>GEOM vinum</emphasis>). Enquanto este capítulo usa o termo <filename>vinum</filename>, qualquer invocação de comandos deve ser executada com o <command>gvinum</command>. O nome do módulo do kernel mudou do original <filename>vinum.ko</filename> para <filename>geom_vinum.ko</filename>, e todos os device nodes residem em <filename class="directory">/dev/gvinum</filename> em vez de <filename class="directory">/dev/vinum</filename>. A partir do FreeBSD 6, a implementação original do <filename>vinum</filename> não está mais disponível no código base.

source: Access Bottlenecks
pt_br: Gargalos de Acesso

source: Modern systems frequently need to access data in a highly concurrent manner. For example, large FTP or HTTP servers can maintain thousands of concurrent sessions and have multiple 100 Mbit/s connections to the outside world, well beyond the sustained transfer rate of most disks.
pt_br: Sistemas modernos frequentemente precisam acessar dados de uma maneira altamente concorrente. Por exemplo, grandes servidores FTP ou HTTP podem manter milhares de sessões simultâneas e ter múltiplas conexões de 100 Mbit/s para o mundo externo, muito além da taxa de transferência sustentada da maioria dos discos.

source: Current disk drives can transfer data sequentially at up to 70 MB/s, but this value is of little importance in an environment where many independent processes access a drive, and where they may achieve only a fraction of these values. In such cases, it is more interesting to view the problem from the viewpoint of the disk subsystem. The important parameter is the load that a transfer places on the subsystem, or the time for which a transfer occupies the drives involved in the transfer.
pt_br: As unidades de disco atuais podem transferir dados sequencialmente a até 70 MB/s, mas esse valor é de pouca importância em um ambiente em que muitos processos independentes acessam uma unidade e onde podem obter apenas uma fração desses valores. Nesses casos, é mais interessante visualizar o problema do ponto de vista do subsistema de disco. O parâmetro importante é a carga que uma transferência coloca no subsistema ou o tempo pelo qual uma transferência ocupa as unidades envolvidas na transferência.

source: In any disk transfer, the drive must first position the heads, wait for the first sector to pass under the read head, and then perform the transfer. These actions can be considered to be atomic as it does not make any sense to interrupt them.
pt_br: Em qualquer transferência de disco, a unidade deve primeiro posicionar as cabeças, aguardar que o primeiro setor passe sob a cabeça de leitura e depois realizar a transferência. Essas ações podem ser consideradas atômicas, pois não faz sentido interrompê-las.

source: <anchor xml:id="vinum-latency"/> Consider a typical transfer of about 10 kB: the current generation of high-performance disks can position the heads in an average of 3.5 ms. The fastest drives spin at 15,000 rpm, so the average rotational latency (half a revolution) is 2 ms. At 70 MB/s, the transfer itself takes about 150 μs, almost nothing compared to the positioning time. In such a case, the effective transfer rate drops to a little over 1 MB/s and is clearly highly dependent on the transfer size.
pt_br: <anchor xml:id="vinum-latency"/> Considere uma transferência típica de cerca de 10 kB: a geração atual de discos de alto desempenho pode posicionar as cabeças em uma média de 3,5 ms. As unidades mais rápidas giram a 15.000 rpm, portanto a latência rotacional média (meia revolução) é de 2 ms. A 70 MB/s, a própria transferência leva cerca de 150 μs, quase nada em comparação com o tempo de posicionamento. Nesse caso, a taxa de transferência efetiva cai para pouco mais de 1 MB/s e é claramente altamente dependente do tamanho da transferência.

source: The traditional and obvious solution to this bottleneck is <quote>more spindles</quote>: rather than using one large disk, use several smaller disks with the same aggregate storage space. Each disk is capable of positioning and transferring independently, so the effective throughput increases by a factor close to the number of disks used.
pt_br: A solução tradicional e óbvia para esse gargalo é <quote>mais eixos</quote>: em vez de usar um disco grande, use vários discos menores com o mesmo espaço de armazenamento agregado. Cada disco é capaz de se posicionar e transferir de forma independente, portanto, o rendimento efetivo aumenta em um fator próximo ao número de discos usados.

source: The actual throughput improvement is smaller than the number of disks involved. Although each drive is capable of transferring in parallel, there is no way to ensure that the requests are evenly distributed across the drives. Inevitably the load on one drive will be higher than on another.
pt_br: A melhoria real da taxa de transferência é menor que o número de discos envolvidos. Embora cada unidade seja capaz de transferir em paralelo, não há como garantir que as solicitações sejam distribuídas uniformemente pelas unidades. Inevitavelmente, a carga em uma unidade será maior que em outra.

source: <primary>disk concatenation</primary>
pt_br: <primary>Concatenação de disco</primary>

source: <primary>Vinum</primary> <secondary>concatenation</secondary>
pt_br: <primary>Concatenação </primary> <secondary>Vinum</secondary>

source: The evenness of the load on the disks is strongly dependent on the way the data is shared across the drives. In the following discussion, it is convenient to think of the disk storage as a large number of data sectors which are addressable by number, rather like the pages in a book. The most obvious method is to divide the virtual disk into groups of consecutive sectors the size of the individual physical disks and store them in this manner, rather like taking a large book and tearing it into smaller sections. This method is called <emphasis>concatenation</emphasis> and has the advantage that the disks are not required to have any specific size relationships. It works well when the access to the virtual disk is spread evenly about its address space. When access is concentrated on a smaller area, the improvement is less marked. <xref linkend="vinum-concat"/> illustrates the sequence in which storage units are allocated in a concatenated organization.
pt_br: A uniformidade da carga nos discos é fortemente dependente da maneira como os dados são compartilhados entre as unidades. Na discussão a seguir, é conveniente pensar no armazenamento em disco como um grande número de setores de dados que são endereçáveis por número, mais ou menos como as páginas de um livro. O método mais óbvio é dividir o disco virtual em grupos de setores consecutivos do tamanho dos discos físicos individuais e armazená-los dessa maneira, mais ou menos como pegar um livro grande e dividi-lo em seções menores. Esse método é chamado de <emphasis>concatenação</emphasis> e tem a vantagem de os discos não precisarem ter nenhum relacionamento de tamanho específico. Ele funciona bem quando o acesso ao disco virtual é distribuído uniformemente sobre seu espaço de endereço. Quando o acesso é concentrado em uma área menor, a melhoria é menos acentuada. <xref linkend="vinum-concat"/> ilustra a seqüência na qual as unidades de armazenamento são alocadas em uma organização concatenada.

source: Concatenated Organization
pt_br: Organização Concatenada

source: <primary>disk striping</primary>
pt_br: <primary>Discos Distribuídos</primary>

source: <primary>Vinum</primary> <secondary>striping</secondary>
pt_br: <primary>Discos Distribuídos no </primary><secondary>Vinum</secondary>

source: An alternative mapping is to divide the address space into smaller, equal-sized components and store them sequentially on different devices. For example, the first 256 sectors may be stored on the first disk, the next 256 sectors on the next disk and so on. After filling the last disk, the process repeats until the disks are full. This mapping is called <emphasis>striping</emphasis> or <acronym>RAID-0</acronym>.
pt_br: Um mapeamento alternativo é dividir o espaço de endereço em componentes menores e de tamanhos iguais e armazená-los sequencialmente em diferentes dispositivos. Por exemplo, os primeiros 256 setores podem ser armazenados no primeiro disco, os próximos 256 setores no próximo disco e assim por diante. Depois de preencher o último disco, o processo é repetido até que os discos estejam cheios. Este mapeamento é chamado <emphasis>striping</emphasis> ou <acronym>RAID-0</acronym>.

source: <acronym>RAID</acronym> offers various forms of fault tolerance, though <acronym>RAID-0</acronym> is somewhat misleading as it provides no redundancy. Striping requires somewhat more effort to locate the data, and it can cause additional I/O load where a transfer is spread over multiple disks, but it can also provide a more constant load across the disks. <xref linkend="vinum-striped"/> illustrates the sequence in which storage units are allocated in a striped organization.
pt_br: O <acronym>RAID</acronym> oferece várias formas de tolerância a falhas, embora o <acronym>RAID-0</acronym> seja um pouco enganador, pois não fornece redundância. O striping requer um pouco mais de esforço para localizar os dados e pode causar carga de I/O (INPUT/OUTPUT) adicional, onde uma transferência é distribuída por vários discos, mas também pode fornecer uma carga mais constante nos discos. <xref linkend="vinum-striped"/> ilustra a seqüência na qual as unidades de armazenamento são alocadas em uma organização distribuída.

source: Striped Organization
pt_br: Organização do modo distribuido (Striped)

source: Data Integrity
pt_br: Integridade de dados

source: The final problem with disks is that they are unreliable. Although reliability has increased tremendously over the last few years, disk drives are still the most likely core component of a server to fail. When they do, the results can be catastrophic and replacing a failed disk drive and restoring data can result in server downtime.
pt_br: O problema final com os discos é que eles não são confiáveis. Embora a confiabilidade tenha aumentado tremendamente nos últimos anos, as unidades de disco ainda são o componente central mais provável de um servidor para falhar. Quando o fazem, os resultados podem ser catastróficos e substituir uma unidade de disco com falha e a restauração de dados pode resultar em tempo de inatividade do servidor.

source: <primary>disk mirroring</primary>
pt_br: <primary>Espelhamento de disco</primary>

source: <primary>vinum</primary> <secondary>mirroring</secondary>
pt_br: <primary>Espelhamento no </primary> <secondary>Vinum</secondary>

source: One approach to this problem is <emphasis>mirroring</emphasis>, or <acronym>RAID-1</acronym>, which keeps two copies of the data on different physical hardware. Any write to the volume writes to both disks; a read can be satisfied from either, so if one drive fails, the data is still available on the other drive.
pt_br: Uma abordagem para esse problema é o <emphasis>mirroring (espelhamento)</emphasis>, ou <acronym>RAID-1</acronym>, que mantém duas cópias dos dados em diferentes hardwares físicos. Qualquer gravação no volume grava em ambos os discos; uma leitura pode ser satisfeita de qualquer um, portanto, se uma unidade falhar, os dados ainda estarão disponíveis na outra unidade.

source: Mirroring has two problems:
pt_br: O mirroring tem dois problemas:

source: It requires twice as much disk storage as a non-redundant solution.
pt_br: Requer o dobro de armazenamento em disco que uma solução não redundante.

source: Writes must be performed to both drives, so they take up twice the bandwidth of a non-mirrored volume. Reads do not suffer from a performance penalty and can even be faster.
pt_br: As gravações devem ser executadas em ambas as unidades, então ela usa o dobro da largura de banda de um volume não espelhado. As leituras não sofrem uma penalidade de desempenho e podem até ser mais rápidas.

source: An alternative solution is <emphasis>parity</emphasis>, implemented in <acronym>RAID</acronym> levels 2, 3, 4 and 5. Of these, <acronym>RAID-5</acronym> is the most interesting. As implemented in <filename>vinum</filename>, it is a variant on a striped organization which dedicates one block of each stripe to parity one of the other blocks. As implemented by <filename>vinum</filename>, a <acronym>RAID-5</acronym> plex is similar to a striped plex, except that it implements <acronym>RAID-5</acronym> by including a parity block in each stripe. As required by <acronym>RAID-5</acronym>, the location of this parity block changes from one stripe to the next. The numbers in the data blocks indicate the relative block numbers.
pt_br: Uma solução alternativa é a <emphasis>parity (paridade)</emphasis>, implementada nos níveis <acronym>RAID</acronym> 2, 3, 4 e 5. Destes, o <acronym>RAID-5</acronym> é o mais interessante. Como implementado no <filename>vinum</filename>, é uma variante em uma organização striped que dedica um bloco de cada distribuição à paridade de um dos outros blocos. Como implementado por <filename>vinum</filename>, um plex <acronym>RAID-5</acronym> é semelhante a um plex striped, exceto que ele implementa <acronym>RAID-5</acronym> incluindo um bloco de paridade em cada stripe. Conforme exigido pelo <acronym>RAID-5</acronym>, o local desse bloco de paridade muda de um stripe para o próximo. Os números nos blocos de dados indicam os números de blocos relativos.

source: <acronym>RAID</acronym>-5 Organization
pt_br: Organização <acronym>RAID</acronym>-5

source: Compared to mirroring, <acronym>RAID-5</acronym> has the advantage of requiring significantly less storage space. Read access is similar to that of striped organizations, but write access is significantly slower, approximately 25% of the read performance. If one drive fails, the array can continue to operate in degraded mode where a read from one of the remaining accessible drives continues normally, but a read from the failed drive is recalculated from the corresponding block from all the remaining drives.
pt_br: Comparado ao mirroring, o <acronym>RAID-5</acronym> tem a vantagem de exigir significativamente menos espaço de armazenamento. O acesso de leitura é semelhante ao das organizações distribuídas, mas o acesso de gravação é significativamente mais lento, aproximadamente 25% do desempenho de leitura. Se uma unidade falhar, a matriz pode continuar a operar no modo degradado, onde uma leitura de uma das unidades acessíveis restantes continua normalmente, mas uma leitura da unidade com falha é recalculada a partir do bloco correspondente de todas as unidades restantes.

source: <filename>vinum</filename> Objects
pt_br: Objetos do <filename>vinum</filename>

source: In order to address these problems, <filename>vinum</filename> implements a four-level hierarchy of objects:
pt_br: A fim de resolver estes problemas, o <filename>vinum</filename> implementa uma hierarquia de quatro níveis de objetos:

source: The most visible object is the virtual disk, called a <emphasis>volume</emphasis>. Volumes have essentially the same properties as a <trademark class="registered">UNIX</trademark> disk drive, though there are some minor differences. For one, they have no size limitations.
pt_br: O objeto mais visível é o disco virtual, chamado <emphasis>volume</emphasis>. Os volumes têm essencialmente as mesmas propriedades de uma unidade de disco <trademark class="registered">UNIX</trademark>, embora haja algumas pequenas diferenças. Por um lado, eles não têm limitações de tamanho.

source: Volumes are composed of <emphasis>plexes</emphasis>, each of which represent the total address space of a volume. This level in the hierarchy provides redundancy. Think of plexes as individual disks in a mirrored array, each containing the same data.
pt_br: Os volumes são compostos de <emphasis>plexes</emphasis>, cada um dos quais representa o espaço de endereço total de um volume. Este nível na hierarquia fornece redundância. Pense em plexes como discos individuais em uma matriz espelhada, cada um contendo os mesmos dados.

source: Since <filename>vinum</filename> exists within the <trademark class="registered">UNIX</trademark> disk storage framework, it would be possible to use <trademark class="registered">UNIX</trademark> partitions as the building block for multi-disk plexes. In fact, this turns out to be too inflexible as <trademark class="registered">UNIX</trademark> disks can have only a limited number of partitions. Instead, <filename>vinum</filename> subdivides a single <trademark class="registered">UNIX</trademark> partition, the <emphasis>drive</emphasis>, into contiguous areas called <emphasis>subdisks</emphasis>, which are used as building blocks for plexes.
pt_br: Como o <filename>vinum</filename> existe dentro do framework de armazenamento em disco <trademark class="registered">UNIX</trademark>, seria possível usar as partições <trademark class="registered">UNIX</trademark> como bloco de construção para plexes de vários discos. Na verdade, isso acaba sendo muito inflexível, pois os discos <trademark class="registered">UNIX</trademark> podem ter apenas um número limitado de partições. Em vez disso, o <filename>vinum</filename> subdivide uma única partição <trademark class="registered">UNIX</trademark>, a <emphasis>unidade</emphasis>, em áreas contíguas chamadas <emphasis>subdiscos</emphasis> , que são usados como blocos de construção para plexes.

source: Subdisks reside on <filename>vinum</filename> <emphasis>drives</emphasis>, currently <trademark class="registered">UNIX</trademark> partitions. <filename>vinum</filename> drives can contain any number of subdisks. With the exception of a small area at the beginning of the drive, which is used for storing configuration and state information, the entire drive is available for data storage.
pt_br: Subdiscos residem em <filename>vinum</filename> <emphasis>drives</emphasis>, atualmente partições <trademark class="registered">UNIX</trademark>. Unidades <filename>vinum</filename> podem conter qualquer número de subdiscos. Com exceção de uma pequena área no início da unidade, que é usada para armazenar informações de configuração e estado, a unidade inteira está disponível para armazenamento de dados.

source: The following sections describe the way these objects provide the functionality required of <filename>vinum</filename>.
pt_br: As seções a seguir descrevem a maneira como esses objetos fornecem a funcionalidade necessária do <filename>vinum</filename>.

source: Volume Size Considerations
pt_br: Considerações sobre o tamanho do volume

source: Plexes can include multiple subdisks spread over all drives in the <filename>vinum</filename> configuration. As a result, the size of an individual drive does not limit the size of a plex or a volume.
pt_br: Os plexes podem incluir vários subdiscos distribuídos por todas as unidades na configuração <filename>vinum</filename>. Como resultado, o tamanho de uma unidade individual não limita o tamanho de um plex ou de um volume.

source: Redundant Data Storage
pt_br: Armazenamento de Dados Redundantes

source: <filename>vinum</filename> implements mirroring by attaching multiple plexes to a volume. Each plex is a representation of the data in a volume. A volume may contain between one and eight plexes.
pt_br: O <filename>vinum</filename> implementa o espelhamento anexando vários plexes a um volume. Cada plex é uma representação dos dados em um volume. Um volume pode conter entre um e oito plexes.
