Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/vinum/*.po
Languages: pt_br

source: At the prompt asking for a root file system to mount, any device that contains a valid root file system can be entered. If <filename>/etc/fstab</filename> is set up correctly, the default should be something like <literal>ufs:/dev/gvinum/root</literal>. A typical alternate choice would be something like <literal>ufs:da0d</literal> which could be a hypothetical partition containing the pre-<filename>vinum</filename> root file system. Care should be taken if one of the alias <literal>a</literal> partitions is entered here, that it actually references the subdisks of the <filename>vinum</filename> root device, because in a mirrored setup, this would only mount one piece of a mirrored root device. If this file system is to be mounted read-write later on, it is necessary to remove the other plex(es) of the <filename>vinum</filename> root volume since these plexes would otherwise carry inconsistent data.
pt_br: No prompt solicitando que um sistema de arquivos raiz seja montado, qualquer dispositivo que contenha um sistema de arquivos raiz válido pode ser inserido. Se o <filename>/etc/fstab</filename> estiver configurado corretamente, o padrão deve ser algo como <literal>ufs:/dev/gvinum/root</literal>. Uma opção alternativa típica seria algo como <literal>ufs:da0d</literal>, que poderia ser uma partição hipotética contendo o sistema de arquivos raiz pré-<filename>vinum</filename>. Deve-se tomar cuidado se uma das partições alias <literal>a</literal> for inserida aqui, para verificar se ela realmente faz referência aos subdiscos do dispositivo raiz <filename>vinum</filename>, porque em uma configuração espelhada, isso apenas montaria uma parte de um dispositivo raiz espelhado. Se este sistema de arquivos tiver que ser montado no modo read-write mais tarde, será necessário remover o(s) outro(s) plex(es) do volume raiz <filename>vinum</filename>, já que esses plexes carregariam dados inconsistentes.

source: Only Primary Bootstrap Loads
pt_br: Apenas o bootstrap primário carrega

source: If <filename>/boot/loader</filename> fails to load, but the primary bootstrap still loads (visible by a single dash in the left column of the screen right after the boot process starts), an attempt can be made to interrupt the primary bootstrap by pressing <keycap>space</keycap>. This will make the bootstrap stop in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1">stage two</link>. An attempt can be made here to boot off an alternate partition, like the partition containing the previous root file system that has been moved away from <literal>a</literal>.
pt_br: Se o <filename>/boot/loader</filename> falhar ao carregar, mas o bootstrap primário ainda carregar (visível por um único traço na coluna esquerda da tela logo após o processo de boot ser iniciado), uma tentativa pode ser feita para interromper o bootstrap primário pressionando <keycap>espaço</keycap>. Isso fará com que o bootstrap pare no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1">estágio dois</link>. Uma tentativa pode ser feita aqui para inicializar uma partição alternativa, como a partição que contém o sistema de arquivos raiz anterior que foi movido de <literal>a</literal>.

source: Nothing Boots, the Bootstrap Panics
pt_br: Nada carrega e o Bootstrap entra em panic

source: This situation will happen if the bootstrap had been destroyed by the <filename>vinum</filename> installation. Unfortunately, <filename>vinum</filename> accidentally leaves only 4 KB at the beginning of its partition free before starting to write its <filename>vinum</filename> header information. However, the stage one and two bootstraps plus the bsdlabel require 8 KB. So if a <filename>vinum</filename> partition was started at offset 0 within a slice or disk that was meant to be bootable, the <filename>vinum</filename> setup will trash the bootstrap.
pt_br: Esta situação acontecerá se o bootstrap tiver sido destruído pela instalação do <filename>vinum</filename>. Infelizmente, o <filename>vinum</filename> acidentalmente deixa apenas 4 KB no início de sua partição livre antes de começar a escrever suas informações de cabeçalho <filename>vinum</filename>. No entanto, o estágio um e dois bootstraps mais o bsdlabel exigem 8 KB. Portanto, se uma partição <filename>vinum</filename> tiver sido iniciada no offset 0 dentro de uma slice ou disco que deveria ser inicializável, a configuração do <filename>vinum</filename> irá estragar o bootstrap.

source: Similarly, if the above situation has been recovered, by booting from a <quote>Fixit</quote> media, and the bootstrap has been re-installed using <command>bsdlabel -B</command> as described in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1"/>, the bootstrap will trash the <filename>vinum</filename> header, and <filename>vinum</filename> will no longer find its disk(s). Though no actual <filename>vinum</filename> configuration data or data in <filename>vinum</filename> volumes will be trashed, and it would be possible to recover all the data by entering exactly the same <filename>vinum</filename> configuration data again, the situation is hard to fix. It is necessary to move the entire <filename>vinum</filename> partition by at least 4 KB, in order to have the <filename>vinum</filename> header and the system bootstrap no longer collide.
pt_br: Da mesma forma, se a situação acima foi recuperada, inicializando de uma mídia <quote>Fixit</quote>, e o bootstrap foi reinstalado usando <command>bsdlabel -B</command> como descrito em <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1"/>, o bootstrap irá estragar o cabeçalho <filename>vinum</filename> e o <filename>vinum</filename> não encontrará mais seu(s) disco(s). Entretando nenhum dado de configuração real do <filename>vinum</filename> e nenhum volume <filename>vinum</filename> de dados foi descartado, sendo possível recuperá-los digitando de novo exatamente as mesmas configurações do <filename>vinum</filename>, a situação é difícil de corrigir de forma definitiva. Pois será necessário mover toda a partição <filename>vinum</filename> em pelo menos 4 KB, para que o cabeçalho <filename>vinum</filename> e o bootstrap do sistema não colidam mais.
