Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/vinum/*.po
Languages: pt_br

source: Although a plex represents the complete data of a volume, it is possible for parts of the representation to be physically missing, either by design (by not defining a subdisk for parts of the plex) or by accident (as a result of the failure of a drive). As long as at least one plex can provide the data for the complete address range of the volume, the volume is fully functional.
pt_br: Embora um plex represente os dados completos de um volume, é possível que partes da representação estejam fisicamente ausentes, seja por design (por não definir um subdisco para partes do plex) ou por acidente (como resultado da falha de representação). Contanto que pelo menos um plex possa fornecer os dados para o intervalo de endereços completo do volume, o volume estará totalmente funcional.

source: Which Plex Organization?
pt_br: Quais são as organizações disponíveis para um Plex?

source: <filename>vinum</filename> implements both concatenation and striping at the plex level:
pt_br: O <filename>vinum</filename> implementa a concatenação e o striping no nível plex:

source: A <emphasis>concatenated plex</emphasis> uses the address space of each subdisk in turn. Concatenated plexes are the most flexible as they can contain any number of subdisks, and the subdisks may be of different length. The plex may be extended by adding additional subdisks. They require less <acronym>CPU</acronym> time than striped plexes, though the difference in <acronym>CPU</acronym> overhead is not measurable. On the other hand, they are most susceptible to hot spots, where one disk is very active and others are idle.
pt_br: Um <emphasis>plex concatenado</emphasis> usa o espaço de endereço de cada subdisco um de cada vez. Plexes concatenados são os mais flexíveis, pois podem conter qualquer número de subdiscos e os subdiscos podem ser de tamanho diferente. O plex pode ser estendido adicionando subdiscos adicionais. Eles exigem menos tempo de <acronym>CPU</acronym> do que os plexes distribuídos, embora a diferença na sobrecarga de <acronym>CPU</acronym> não seja mensurável. Por outro lado, eles são mais suscetíveis a hot spots, nos quais um disco é muito ativo e outros ficam ociosos.

source: A <emphasis>striped plex</emphasis> stripes the data across each subdisk. The subdisks must all be the same size and there must be at least two subdisks in order to distinguish it from a concatenated plex. The greatest advantage of striped plexes is that they reduce hot spots. By choosing an optimum sized stripe, about 256 kB, the load can be evened out on the component drives. Extending a plex by adding new subdisks is so complicated that <filename>vinum</filename> does not implement it.
pt_br: Um <emphasis>plex striped</emphasis> distribui os dados uniformemente entre cada subdisco. Os subdiscos devem ser todos do mesmo tamanho e deve haver pelo menos dois subdiscos para distingui-los de um plex concatenado. A maior vantagem dos plexes striped é que eles reduzem os hot spots. Ao escolher uma faixa de tamanho ideal, de cerca de 256 kB, a carga pode ser nivelada nas unidades de componentes. Estender um complexo adicionando novos subdiscos é algo tão complicado que o <filename>vinum</filename> não o implementa.

source: <xref linkend="vinum-comparison"/> summarizes the advantages and disadvantages of each plex organization.
pt_br: <xref linkend="vinum-comparison"/> resume as vantagens e desvantagens de cada organização plex.

source: <filename>vinum</filename> Plex Organizations
pt_br: Organizações Plex do <filename>vinum</filename>

source: Plex type
pt_br: Tipo plex

source: Minimum subdisks
pt_br: Subdiscos mínimos

source: Can add subdisks
pt_br: Pode adicionar subdiscos

source: Must be equal size
pt_br: Deve ser de tamanho igual

source: Application
pt_br: Aplicação

source: concatenated
pt_br: concatenado

source: yes
pt_br: sim

source: no
pt_br: não

source: Large data storage with maximum placement flexibility and moderate performance
pt_br: Armazenamento de dados grandes com flexibilidade máxima de posicionamento e desempenho moderado

source: High performance in combination with highly concurrent access
pt_br: Alto desempenho em combinação com acesso altamente concorrente

source: Some Examples
pt_br: Alguns exemplos

source: <filename>vinum</filename> maintains a <emphasis>configuration database</emphasis> which describes the objects known to an individual system. Initially, the user creates the configuration database from one or more configuration files using <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. <filename>vinum</filename> stores a copy of its configuration database on each disk <emphasis>device</emphasis> under its control. This database is updated on each state change, so that a restart accurately restores the state of each <filename>vinum</filename> object.
pt_br: O <filename>vinum</filename> mantém um <emphasis>banco de dados de configuração</emphasis> que descreve os objetos conhecidos de um sistema individual. Inicialmente, o usuário cria o banco de dados de configuração a partir de um ou mais arquivos de configuração usando <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. O <filename>vinum</filename> armazena uma cópia de seu banco de dados de configuração em cada <emphasis>dispositivo</emphasis> de disco sob seu controle. Este banco de dados é atualizado em cada mudança de estado, de modo que uma reinicialização restaura com precisão o estado de cada objeto <filename>vinum</filename>.

source: The Configuration File
pt_br: O arquivo de configuração

source: The configuration file describes individual <filename>vinum</filename> objects. The definition of a simple volume might be:
pt_br: O arquivo de configuração descreve objetos <filename>vinum</filename> individuais. A definição de um volume simples pode ser:

source: This file describes four <filename>vinum</filename> objects:
pt_br: Este arquivo descreve quatro objetos <filename>vinum</filename>:

source: The <emphasis>drive</emphasis> line describes a disk partition (<emphasis>drive</emphasis>) and its location relative to the underlying hardware. It is given the symbolic name <emphasis>a</emphasis>. This separation of symbolic names from device names allows disks to be moved from one location to another without confusion.
pt_br: A linha <emphasis>drive</emphasis> descreve uma partição de disco (<emphasis>drive</emphasis>) e sua localização relativa ao hardware subjacente. É dado o nome simbólico <emphasis>a</emphasis>. Essa separação de nomes simbólicos de nomes de dispositivos permite que os discos sejam movidos de um local para outro sem confusão.

source: The <emphasis>volume</emphasis> line describes a volume. The only required attribute is the name, in this case <emphasis>myvol</emphasis>.
pt_br: A linha <emphasis>volume</emphasis> descreve um volume. O único atributo obrigatório é o nome, neste caso <emphasis>myvol</emphasis>.

source: The <emphasis>plex</emphasis> line defines a plex. The only required parameter is the organization, in this case <emphasis>concat</emphasis>. No name is necessary as the system automatically generates a name from the volume name by adding the suffix <emphasis>.p</emphasis><emphasis>x</emphasis>, where <emphasis>x</emphasis> is the number of the plex in the volume. Thus this plex will be called <emphasis>myvol.p0</emphasis>.
pt_br: A linha <emphasis>plex</emphasis> define um plex. O único parâmetro requerido é a organização, neste caso <emphasis>concat</emphasis>. Nenhum nome é necessário, pois o sistema gera automaticamente um nome a partir do nome do volume, adicionando o sufixo <emphasis>.p</emphasis><emphasis>x</emphasis>, onde <emphasis>x</emphasis> é o número de o plex no volume. Assim, este plex será chamado <emphasis>myvol.p0</emphasis>.

source: The <emphasis>sd</emphasis> line describes a subdisk. The minimum specifications are the name of a drive on which to store it, and the length of the subdisk. No name is necessary as the system automatically assigns names derived from the plex name by adding the suffix <emphasis>.s</emphasis><emphasis>x</emphasis>, where <emphasis>x</emphasis> is the number of the subdisk in the plex. Thus <filename>vinum</filename> gives this subdisk the name <emphasis>myvol.p0.s0</emphasis>.
pt_br: A linha <emphasis>sd</emphasis> descreve um subdisco. As especificações mínimas são o nome de uma unidade na qual irá armazená-lo e o tamanho do subdisco. Nenhum nome é necessário porque o sistema atribui automaticamente nomes derivados do nome do plex adicionando o sufixo <emphasis>.s</emphasis><emphasis>x</emphasis>, onde <emphasis>x</emphasis> é o número do subdisco no plex. Assim, <filename>vinum</filename> dá ao subdisco o nome <emphasis>myvol.p0.s0</emphasis>.

source: After processing this file, <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> produces the following output:
pt_br: Depois de processar este arquivo, o <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> produz a seguinte saída:

source: This output shows the brief listing format of <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. It is represented graphically in <xref linkend="vinum-simple-vol"/>.
pt_br: Esta saída mostra o formato de listagem breve de <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Ele está representado graficamente em <xref linkend="vinum-simple-vol"/>.

source: A Simple <filename>vinum</filename> Volume
pt_br: Um volume <filename>vinum</filename> simples

source: This figure, and the ones which follow, represent a volume, which contains the plexes, which in turn contains the subdisks. In this example, the volume contains one plex, and the plex contains one subdisk.
pt_br: Esta figura, e as que se seguem, representam um volume, que contém os plexes, que por sua vez contém os subdiscos. Neste exemplo, o volume contém um plex e o plex contém um subdisco.

source: This particular volume has no specific advantage over a conventional disk partition. It contains a single plex, so it is not redundant. The plex contains a single subdisk, so there is no difference in storage allocation from a conventional disk partition. The following sections illustrate various more interesting configuration methods.
pt_br: Este volume específico não tem nenhuma vantagem específica sobre uma partição de disco convencional. Ele contém um único plex, por isso não é redundante. O plex contém um único subdisco, portanto, não há diferença na alocação de armazenamento de uma partição de disco convencional. As seções a seguir ilustram vários métodos de configuração mais interessantes.

source: Increased Resilience: Mirroring
pt_br: Maior Resiliência: Espelhamento

source: The resilience of a volume can be increased by mirroring. When laying out a mirrored volume, it is important to ensure that the subdisks of each plex are on different drives, so that a drive failure will not take down both plexes. The following configuration mirrors a volume:
pt_br: A resiliência de um volume pode ser aumentada pelo espelhamento. Ao dispor um volume espelhado, é importante garantir que os subdiscos de cada plex estejam em unidades diferentes, de modo que uma falha no dispositivo não derrubará os dois plexes. A configuração a seguir espelha um volume:

source: In this example, it was not necessary to specify a definition of drive <emphasis>a</emphasis> again, since <filename>vinum</filename> keeps track of all objects in its configuration database. After processing this definition, the configuration looks like:
pt_br: Neste exemplo, não foi necessário especificar uma definição de drive <emphasis>a</emphasis> novamente, já que o <filename>vinum</filename> registra todos os objetos em seu banco de dados de configuração. Depois de processar esta definição, a configuração se parece com:

source: <xref linkend="vinum-mirrored-vol"/> shows the structure graphically.
pt_br: <xref linkend="vinum-mirrored-vol"/> mostra a estrutura graficamente.

source: A Mirrored <filename>vinum</filename> Volume
pt_br: Um volume <filename>vinum</filename> espelhado

source: In this example, each plex contains the full 512 MB of address space. As in the previous example, each plex contains only a single subdisk.
pt_br: Neste exemplo, cada plex contém os 512 MB completos do espaço de endereço. Como no exemplo anterior, cada plex contém apenas um único subdisco.

source: Optimizing Performance
pt_br: Otimizando o desempenho

source: The mirrored volume in the previous example is more resistant to failure than an unmirrored volume, but its performance is less as each write to the volume requires a write to both drives, using up a greater proportion of the total disk bandwidth. Performance considerations demand a different approach: instead of mirroring, the data is striped across as many disk drives as possible. The following configuration shows a volume with a plex striped across four disk drives:
pt_br: O volume espelhado no exemplo anterior é mais resistente a falhas do que um volume não espelhado, mas seu desempenho é menor, pois cada gravação no volume requer uma gravação nas duas unidades, utilizando uma grande parte da largura de banda total do disco. As considerações de desempenho exigem uma abordagem diferente: em vez de espelhar, os dados são distribuídos em quantas unidades de disco forem possíveis. A configuração a seguir mostra um volume com um plex distribuído em quatro unidades de disco:

source: As before, it is not necessary to define the drives which are already known to <filename>vinum</filename>. After processing this definition, the configuration looks like:
pt_br: Como antes, não é necessário definir as unidades que já são conhecidas por <filename>vinum</filename>. Depois de processar esta definição, a configuração se parece com:

source: A Striped <filename>vinum</filename> Volume
pt_br: Um volume <filename>vinum</filename> concatenado

source: This volume is represented in <xref linkend="vinum-striped-vol"/>. The darkness of the stripes indicates the position within the plex address space, where the lightest stripes come first and the darkest last.
pt_br: Este volume é representado em <xref linkend="vinum-striped-vol"/>. A escuridão das strips indica a posição dentro do espaço de endereço plex, onde as faixas mais claras vêm primeiro e as mais escuras por último.

source: Resilience and Performance
pt_br: Resiliência e Desempenho

source: <anchor xml:id="vinum-resilience"/>With sufficient hardware, it is possible to build volumes which show both increased resilience and increased performance compared to standard <trademark class="registered">UNIX</trademark> partitions. A typical configuration file might be:
pt_br: <anchor xml:id="vinum-resilience"/> Com hardware suficiente, é possível construir volumes que mostrem maior resiliência e melhor desempenho em comparação com as partições padrão <trademark class="registered">UNIX</trademark>. Um arquivo de configuração típico pode ser:

source: The subdisks of the second plex are offset by two drives from those of the first plex. This helps to ensure that writes do not go to the same subdisks even if a transfer goes over two drives.
pt_br: Os subdiscos do segundo plex são compensados por duas unidades daquelas do primeiro plex. Isso ajuda a garantir que as gravações não vão para os mesmos subdiscos, mesmo que uma transferência passe por duas unidades.

source: <xref linkend="vinum-raid10-vol"/> represents the structure of this volume.
pt_br: <xref linkend="vinum-raid10-vol"/> representa a estrutura deste volume.

source: A Mirrored, Striped <filename>vinum</filename> Volume
pt_br: Um volume <filename>vinum</filename> espelhado e concatenado

source: Object Naming
pt_br: Nomeação de Objetos

source: <filename>vinum</filename> assigns default names to plexes and subdisks, although they may be overridden. Overriding the default names is not recommended as it does not bring a significant advantage and it can cause confusion.
pt_br: O <filename>vinum</filename> atribui nomes padrões a plexes e subdiscos, embora eles possam ser substituídos. Substituir os nomes padrões não é recomendado, pois não isso traz nenhuma vantagem significativa e pode causar confusão.

source: Names may contain any non-blank character, but it is recommended to restrict them to letters, digits and the underscore characters. The names of volumes, plexes, and subdisks may be up to 64 characters long, and the names of drives may be up to 32 characters long.
pt_br: Os nomes podem conter qualquer caractere não-branco, mas é recomendado restringi-los a letras, dígitos e caracteres de sublinhado. Os nomes de volumes, plexes e subdiscos podem ter até 64 caracteres e os nomes das unidades podem ter até 32 caracteres.

source: <filename>vinum</filename> objects are assigned device nodes in the hierarchy <filename class="directory">/dev/gvinum</filename>. The configuration shown above would cause <filename>vinum</filename> to create the following device nodes:
pt_br: Os objetos <filename>vinum</filename> são designados a device nodes na hierarquia <filename class="directory">/dev/gvinum</filename>. A configuração mostrada acima faria com que o <filename>vinum</filename> criasse os seguintes device nodes:

source: Device entries for each volume. These are the main devices used by <filename>vinum</filename>. The configuration above would include the devices <filename class="devicefile">/dev/gvinum/myvol</filename>, <filename class="devicefile">/dev/gvinum/mirror</filename>, <filename class="devicefile">/dev/gvinum/striped</filename>, <filename class="devicefile">/dev/gvinum/raid5</filename> and <filename class="devicefile">/dev/gvinum/raid10</filename>.
pt_br: Entradas de dispositivos para cada volume. Estes são os principais dispositivos usados pelo <filename>vinum</filename>. A configuração acima incluiria os dispositivos <filename class="devicefile">/dev/gvinum/myvol</filename>, <filename class="devicefile">/dev/gvinum/mirror</filename>, <filename class="devicefile">/dev/gvinum/striped</filename>, <filename class="devicefile">/dev/gvinum/raid5</filename> e o <filename class="devicefile">/dev/gvinum/raid10</filename>.

source: All volumes get direct entries under <filename class="directory">/dev/gvinum/</filename>.
pt_br: Todos os volumes recebem entradas diretas em <filename class="directory">/dev/gvinum/</filename>.

source: The directories <filename class="directory">/dev/gvinum/plex</filename>, and <filename class="directory">/dev/gvinum/sd</filename>, which contain device nodes for each plex and for each subdisk, respectively.
pt_br: Os diretórios <filename class="directory">/dev/gvinum/plex</filename>, e <filename class="directory"> /dev/gvinum/sd</filename> são aqueles que contém device nodes para cada plex e para cada subdisco, respectivamente.

source: For example, consider the following configuration file:
pt_br: Por exemplo, considere o seguinte arquivo de configuração:

source: After processing this file, <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> creates the following structure in <filename class="directory">/dev/gvinum</filename>:
pt_br: Depois de processar este arquivo, o <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum> </citerefentry> cria a seguinte estrutura em <filename class="directory">/dev/gvinum</filename>:

source: Although it is recommended that plexes and subdisks should not be allocated specific names, <filename>vinum</filename> drives must be named. This makes it possible to move a drive to a different location and still recognize it automatically. Drive names may be up to 32 characters long.
pt_br: Embora seja recomendado que os plexes e subdiscos não sejam atribuídos a nomes específicos, as unidades <filename>vinum</filename> devem ser nomeadas. Isso possibilita mover uma unidade para um local diferente e ainda reconhecê-la automaticamente. Os nomes dos drives podem ter até 32 caracteres.

source: Creating File Systems
pt_br: Criando sistemas de arquivos

source: Volumes appear to the system to be identical to disks, with one exception. Unlike <trademark class="registered">UNIX</trademark> drives, <filename>vinum</filename> does not partition volumes, which thus do not contain a partition table. This has required modification to some disk utilities, notably <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>, so that it does not try to interpret the last letter of a <filename>vinum</filename> volume name as a partition identifier. For example, a disk drive may have a name like <filename class="devicefile">/dev/ad0a</filename> or <filename class="devicefile">/dev/da2h</filename>. These names represent the first partition (<filename>a</filename>) on the first (0) IDE disk (<filename>ad</filename>) and the eighth partition (<filename>h</filename>) on the third (2) SCSI disk (<filename>da</filename>) respectively. By contrast, a <filename>vinum</filename> volume might be called <filename class="devicefile">/dev/gvinum/concat</filename>, which has no relationship with a partition name.
pt_br: Para o sistema os volumes são idênticos aos discos, com uma exceção. Ao contrário das unidades <trademark class="registered">UNIX</trademark>, o <filename>vinum</filename> não particiona os volumes, e, portanto, não contêm uma tabela de partições. Isso exigiu modificação em alguns dos utilitários de disco, notavelmente no <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>, para que ele não tente interpretar a última letra de um nome do volume <filename>vinum</filename> como um identificador de partição. Por exemplo, uma unidade de disco pode ter um nome como <filename class="devicefile">/dev/ad0a</filename> ou <filename class="devicefile">/dev/da2h</filename>. Esses nomes representam a primeira partição (<filename>a</filename>) no primeiro (0) disco IDE (<filename>ad</filename>) e a oitava partição (<filename>h</filename>) no terceiro (2) disco SCSI (<filename>da</filename>) respectivamente. Por outro lado, um volume <filename>vinum</filename> pode ser chamado de <filename class="devicefile">/dev/gvinum/concat</filename>, que não tem relação com o nome da partição.

source: In order to create a file system on this volume, use <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>:
pt_br: Para criar um sistema de arquivos neste volume, use <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>:

source: Configuring <filename>vinum</filename>
pt_br: Configurando o <filename>vinum</filename>
