Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/vinum/*.po
Languages: pt_br

source: The <filename>GENERIC</filename> kernel does not contain <filename>vinum</filename>. It is possible to build a custom kernel which includes <filename>vinum</filename>, but this is not recommended. The standard way to start <filename>vinum</filename> is as a kernel module. <citerefentry><refentrytitle>kldload</refentrytitle><manvolnum>8</manvolnum></citerefentry> is not needed because when <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> starts, it checks whether the module has been loaded, and if it is not, it loads it automatically.
pt_br: O kernel <filename>GENERIC</filename> não suporta o <filename>vinum</filename>. É possível compilar um kernel customizado que inclua o suporte estático ao <filename>vinum</filename>, mas isso não é recomendado. A maneira padrão de iniciar o <filename>vinum</filename> é como um módulo do kernel. O uso do <citerefentry><refentrytitle>kldload</refentrytitle><manvolnum>8</manvolnum></citerefentry> não é necessário porque quando o <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> é iniciado, ele verifica se o módulo já foi carregado e, se ele não tiver sido, ele será carregado automaticamente.

source: Startup
pt_br: Começando

source: <filename>vinum</filename> stores configuration information on the disk slices in essentially the same form as in the configuration files. When reading from the configuration database, <filename>vinum</filename> recognizes a number of keywords which are not allowed in the configuration files. For example, a disk configuration might contain the following text:
pt_br: O <filename>vinum</filename> armazena as informações de configuração nos slices dos discos essencialmente da mesma forma que nos arquivos de configuração. Ao ler a partir do banco de dados de configuração, o <filename>vinum</filename> reconhece um número de palavras-chave que não são permitidas nos arquivos de configuração. Por exemplo, uma configuração de disco pode conter o seguinte texto:

source: The obvious differences here are the presence of explicit location information and naming, both of which are allowed but discouraged, and the information on the states. <filename>vinum</filename> does not store information about drives in the configuration information. It finds the drives by scanning the configured disk drives for partitions with a <filename>vinum</filename> label. This enables <filename>vinum</filename> to identify drives correctly even if they have been assigned different <trademark class="registered">UNIX</trademark> drive IDs.
pt_br: As diferenças óbvias aqui são a presença de informações explícitas de localização e nomeação, as quais são ambas permitidas mas desencorajadas, e as informações sobre os estados. O <filename>vinum</filename> não armazena informações sobre unidades nas informações de configuração. Ele encontra as unidades varrendo as unidades de disco configuradas em busca de partições com um rótulo <filename>vinum</filename>. Isso permite que o <filename>vinum</filename> identifique as unidades corretamente, mesmo que elas tenham recebido diferentes IDs de unidade <trademark class="registered">UNIX</trademark>.

source: Automatic Startup
pt_br: Inicialização automática

source: <emphasis>Gvinum</emphasis> always features an automatic startup once the kernel module is loaded, via <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. To load the <emphasis>Gvinum</emphasis> module at boot time, add <literal>geom_vinum_load="YES"</literal> to <filename>/boot/loader.conf</filename>.
pt_br: O <emphasis>Gvinum</emphasis> apresenta sempre uma inicialização automática assim que o módulo do kernel é carregado, através do <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Para carregar o módulo <emphasis>Gvinum</emphasis> no momento da inicialização, adicione <literal>geom_vinum_load="YES"</literal> ao arquivo <filename>/boot/loader.conf</filename>.

source: When <filename>vinum</filename> is started with <command>gvinum start</command>, <filename>vinum</filename> reads the configuration database from one of the <filename>vinum</filename> drives. Under normal circumstances, each drive contains an identical copy of the configuration database, so it does not matter which drive is read. After a crash, however, <filename>vinum</filename> must determine which drive was updated most recently and read the configuration from this drive. It then updates the configuration, if necessary, from progressively older drives.
pt_br: Quando o <filename>vinum</filename> é iniciado com <command>gvinum start</command>, o <filename>vinum</filename> lê o banco de dados de configuração de uma das unidades <filename>vinum</filename>. Em circunstâncias normais, cada unidade contém uma cópia idêntica do banco de dados de configuração, portanto, não importa qual unidade é lida. Após uma falha, no entanto, o <filename>vinum</filename> deve determinar qual unidade foi atualizada mais recentemente e ler a configuração desta unidade. Em seguida, atualiza a configuração, se necessário, de unidades progressivamente a partir das mais antigas.

source: Using <filename>vinum</filename> for the Root File System
pt_br: Usando o <filename>vinum</filename> para o sistema de arquivos raiz

source: For a machine that has fully-mirrored file systems using <filename>vinum</filename>, it is desirable to also mirror the root file system. Setting up such a configuration is less trivial than mirroring an arbitrary file system because:
pt_br: Para uma máquina que tenha sistemas de arquivos totalmente espelhados usando <filename>vinum</filename>, é desejável também espelhar o sistema de arquivos raiz. Efetuar esta configuração é menos trivial do que espelhar um sistema de arquivos arbitrário porque:

source: The root file system must be available very early during the boot process, so the <filename>vinum</filename> infrastructure must already be available at this time.
pt_br: O sistema de arquivos raiz deve estar disponível muito cedo durante o processo de inicialização, portanto a infraestrutura <filename>vinum</filename> já deve estar disponível no momento.

source: The volume containing the root file system also contains the system bootstrap and the kernel. These must be read using the host system's native utilities, such as the BIOS, which often cannot be taught about the details of <filename>vinum</filename>.
pt_br: O volume que contém o sistema de arquivos raiz também contém a auto-inicialização do sistema e o kernel. Eles devem ser lidos usando os utilitários nativos do sistema, como o BIOS, que muitas vezes não pode ser instruído sobre os detalhes do <filename>vinum</filename>.

source: In the following sections, the term <quote>root volume</quote> is generally used to describe the <filename>vinum</filename> volume that contains the root file system.
pt_br: Nas seções a seguir, o termo <quote>volume raiz</quote> é geralmente usado para descrever o volume <filename>vinum</filename> que contém o sistema de arquivos raiz (/).

source: Starting up <filename>vinum</filename> Early Enough for the Root File System
pt_br: Iniciando o <filename>vinum</filename> cedo o suficiente para o sistema de arquivos raiz

source: <filename>vinum</filename> must be available early in the system boot as <citerefentry><refentrytitle>loader</refentrytitle><manvolnum>8</manvolnum></citerefentry> must be able to load the vinum kernel module before starting the kernel. This can be accomplished by putting this line in <filename>/boot/loader.conf</filename>:
pt_br: O <filename>vinum</filename> deve estar disponível no início da inicialização do sistema pois o <citerefentry><refentrytitle>loader</refentrytitle> <manvolnum>8</manvolnum></citerefentry> deve ser capaz de carregar o módulo do kernel vinum antes de iniciar o kernel. Isto pode ser feito colocando esta linha no <filename>/boot/loader.conf</filename>:

source: Making a <filename>vinum</filename>-based Root Volume Accessible to the Bootstrap
pt_br: Tornando um volume raiz baseado em <filename>vinum</filename> acessível ao Bootstrap

source: The current FreeBSD bootstrap is only 7.5 KB of code and does not understand the internal <filename>vinum</filename> structures. This means that it cannot parse the <filename>vinum</filename> configuration data or figure out the elements of a boot volume. Thus, some workarounds are necessary to provide the bootstrap code with the illusion of a standard <literal>a</literal> partition that contains the root file system.
pt_br: O bootstrap atual do FreeBSD tem apenas 7.5 KB de código e não entende as estruturas internas do <filename>vinum</filename>. Isso significa que não é possível analisar os dados de configuração <filename>vinum</filename> ou descobrir os elementos de um volume de inicialização. Assim, algumas soluções alternativas são necessárias para fornecer ao código de inicialização a ilusão de que ele está trabalhando com uma partição padrão <literal>a</literal> que contém o sistema de arquivos raiz.

source: For this to be possible, the following requirements must be met for the root volume:
pt_br: Para que isso seja possível, os seguintes requisitos devem ser atendidos para o volume raiz:

source: The root volume must not be a stripe or <acronym>RAID</acronym>-5.
pt_br: O volume raiz não pode ser uma stripe ou <acronym>RAID</acronym> -5.

source: The root volume must not contain more than one concatenated subdisk per plex.
pt_br: O volume raiz não deve conter mais de um subdisco concatenado por plex.

source: Note that it is desirable and possible to use multiple plexes, each containing one replica of the root file system. The bootstrap process will only use one replica for finding the bootstrap and all boot files, until the kernel mounts the root file system. Each single subdisk within these plexes needs its own <literal>a</literal> partition illusion, for the respective device to be bootable. It is not strictly needed that each of these faked <literal>a</literal> partitions is located at the same offset within its device, compared with other devices containing plexes of the root volume. However, it is probably a good idea to create the <filename>vinum</filename> volumes that way so the resulting mirrored devices are symmetric, to avoid confusion.
pt_br: Observe que é desejável e possível usar vários plexes, cada um contendo uma réplica do sistema de arquivos raiz. O processo de bootstrap usará apenas uma réplica para localizar o bootstrap e todos os arquivos de inicialização, até que o kernel monte o sistema de arquivos raiz. Cada subdisco dentro desses plexes precisa da sua própria ilusão de partição <literal>a</literal>, para que o respectivo dispositivo seja inicializável. Não é estritamente necessário que cada uma dessas falsas partições <literal>a</literal> estejam localizadas no mesmo deslocamento dentro de seu dispositivo, em comparação com outros dispositivos contendo plexes do volume raiz. No entanto, é provavelmente uma boa ideia criar os volumes <filename>vinum</filename> dessa forma para que os dispositivos espelhados resultantes sejam simétricos, para evitar confusão.

source: In order to set up these <literal>a</literal> partitions for each device containing part of the root volume, the following is required:
pt_br: Para configurar essas partições <literal>a</literal> para cada dispositivo contendo parte do volume raiz, é necessário o seguinte:

source: The location, offset from the beginning of the device, and size of this device's subdisk that is part of the root volume needs to be examined, using the command:
pt_br: A localização, offset desde o início do dispositivo, e o tamanho do subdisco desse dispositivo que faz parte do volume raiz precisam ser examinados, usando o comando:

source: <filename>vinum</filename> offsets and sizes are measured in bytes. They must be divided by 512 in order to obtain the block numbers that are to be used by <command>bsdlabel</command>.
pt_br: Os offsets (deslocamentos) e tamanhos do <filename>vinum</filename> são medidos em bytes. Eles devem ser divididos por 512 para obter os números de blocos que serão usados pelo <command>bsdlabel</command>.

source: Run this command for each device that participates in the root volume:
pt_br: Execute este comando para cada dispositivo que participa do volume raiz:

source: <replaceable>devname</replaceable> must be either the name of the disk, like <filename>da0</filename> for disks without a slice table, or the name of the slice, like <filename>ad0s1</filename>.
pt_br: No comando acima <replaceable>devname</replaceable> deve ser o nome do disco, como <filename>da0</filename> para discos sem uma tabela de slices, ou o nome da slice, como <filename>ad0s1</filename>.

source: If there is already an <literal>a</literal> partition on the device from a pre-<filename>vinum</filename> root file system, it should be renamed to something else so that it remains accessible (just in case), but will no longer be used by default to bootstrap the system. A currently mounted root file system cannot be renamed, so this must be executed either when being booted from a <quote>Fixit</quote> media, or in a two-step process where, in a mirror, the disk that is not been currently booted is manipulated first.
pt_br: Se já existir uma partição <literal>a</literal> no dispositivo a partir de um sistema de arquivos raiz pré-<filename>vinum</filename>, ela deve ser renomeada para outra coisa para que permaneça acessível (apenas nesse caso), mas ela não será mais usada por padrão para inicializar o sistema. Um sistema de arquivos raiz atualmente montado não pode ser renomeado, portanto, de forma que o processo ser executado quando o sistema for inicializado a partir de uma mídia <quote>Fixit</quote> ou em um processo de duas etapas em que, em um espelho, o disco que ainda não foi inicializado é manipulado primeiro.

source: The offset of the <filename>vinum</filename> partition on this device (if any) must be added to the offset of the respective root volume subdisk on this device. The resulting value will become the <literal>offset</literal> value for the new <literal>a</literal> partition. The <literal>size</literal> value for this partition can be taken verbatim from the calculation above. The <literal>fstype</literal> should be <literal>4.2BSD</literal>. The <literal>fsize</literal>, <literal>bsize</literal>, and <literal>cpg</literal> values should be chosen to match the actual file system, though they are fairly unimportant within this context.
pt_br: O offset da partição <filename>vinum</filename> neste dispositivo (se houver) deve ser adicionado ao deslocamento do respectivo subdisco de volume raiz neste dispositivo. O valor resultante se tornará o valor do <literal>offset</literal> para a nova partição <literal>a</literal>. O valor do <literal>size</literal> para esta partição também pode ser obtido a partir do cálculo acima. O <literal>fstype</literal> deve ser <literal>4.2BSD</literal>. Os valores de <literal>fsize</literal>, <literal>bsize</literal> e <literal>cpg</literal> devem ser escolhidos para corresponder ao sistema de arquivos atual, embora eles sejam relativamente sem importância dentro deste contexto.

source: That way, a new <literal>a</literal> partition will be established that overlaps the <filename>vinum</filename> partition on this device. <command>bsdlabel</command> will only allow for this overlap if the <filename>vinum</filename> partition has properly been marked using the <literal>vinum</literal> fstype.
pt_br: Desta forma, uma nova partição <literal>a</literal> será estabelecida sobrepondo a partição <filename>vinum</filename> neste dispositivo. O <command>bsdlabel</command> só permitirá essa sobreposição se a partição <filename>vinum</filename> tiver sido marcada corretamente usando o modo fstype do <literal>vinum</literal>.

source: A faked <literal>a</literal> partition now exists on each device that has one replica of the root volume. It is highly recommendable to verify the result using a command like:
pt_br: Temos agora uma falsa partição <literal>a</literal> em cada dispositivo que possui uma réplica do volume raiz. É altamente recomendável verificar o resultado usando um comando como:

source: It should be remembered that all files containing control information must be relative to the root file system in the <filename>vinum</filename> volume which, when setting up a new <filename>vinum</filename> root volume, might not match the root file system that is currently active. So in particular, <filename>/etc/fstab</filename> and <filename>/boot/loader.conf</filename> need to be taken care of.
pt_br: Deve ser lembrado que todos os arquivos contendo informações de controle devem ser relativos ao sistema de arquivos raiz no volume <filename>vinum</filename> e que, ao configurarmos um novo volume raiz <filename>vinum</filename>, ele pode não corresponder o sistema de arquivos raiz que está atualmente ativo. Então, em particular, o <filename>/etc/fstab</filename> e <filename>/boot/loader.conf</filename> precisam ser ajustados.

source: At next reboot, the bootstrap should figure out the appropriate control information from the new <filename>vinum</filename>-based root file system, and act accordingly. At the end of the kernel initialization process, after all devices have been announced, the prominent notice that shows the success of this setup is a message like:
pt_br: Na próxima reinicialização, o bootstrap deve descobrir as informações de controle apropriadas do novo sistema de arquivos raiz baseado no <filename>vinum</filename> e agir de acordo. No final do processo de inicialização do kernel, após todos os dispositivos terem sido anunciados, o aviso de destaque que mostra o sucesso desta configuração é uma mensagem como:

source: Example of a <filename>vinum</filename>-based Root Setup
pt_br: Exemplo de uma configuração raiz baseada em <filename>vinum</filename>

source: After the <filename>vinum</filename> root volume has been set up, the output of <command>gvinum l -rv root</command> could look like:
pt_br: Depois que o volume raiz <filename>vinum</filename> foi configurado, a saída de <command>gvinum l -rv root</command> pode parecer com:

source: The values to note are <literal>135680</literal> for the offset, relative to partition <filename class="devicefile">/dev/da0h</filename>. This translates to 265 512-byte disk blocks in <command>bsdlabel</command>'s terms. Likewise, the size of this root volume is 245760 512-byte blocks. <filename class="devicefile">/dev/da1h</filename>, containing the second replica of this root volume, has a symmetric setup.
pt_br: Os valores a serem observados são <literal>135680</literal> para o offset, relativo à partição <filename class="devicefile">/dev/da0h</filename>. Isso se traduz em 265 blocos de discos de 512 bytes nos termos do <command>bsdlabel</command>. Da mesma forma, o tamanho desse volume raiz é de 245760 blocos de 512 bytes. O <filename class="devicefile">/dev/da1h</filename>, contém a segunda réplica deste volume raiz, e possui uma configuração simétrica.

source: The bsdlabel for these devices might look like:
pt_br: O bsdlabel para esses dispositivos pode se parecer com:

source: It can be observed that the <literal>size</literal> parameter for the faked <literal>a</literal> partition matches the value outlined above, while the <literal>offset</literal> parameter is the sum of the offset within the <filename>vinum</filename> partition <literal>h</literal>, and the offset of this partition within the device or slice. This is a typical setup that is necessary to avoid the problem described in <xref linkend="vinum-root-panic"/>. The entire <literal>a</literal> partition is completely within the <literal>h</literal> partition containing all the <filename>vinum</filename> data for this device.
pt_br: Pode-se observar que o parâmetro <literal>size</literal> para a falsa partição <literal>a</literal> corresponde ao valor descrito acima, enquanto o parâmetro <literal>offset</literal> é a soma do deslocamento dentro da partição <filename>vinum</filename> <literal>h</literal>, e o offset desta partição dentro do dispositivo ou slice. Esta é uma configuração típica que é necessária para evitar o problema descrito em <xref linkend="vinum-root-panic"/>. A partição <literal>a</literal> inteira está completamente dentro da partição <literal>h</literal> que contém todos os dados <filename>vinum</filename> para este dispositivo.

source: In the above example, the entire device is dedicated to <filename>vinum</filename> and there is no leftover pre-<filename>vinum</filename> root partition.
pt_br: No exemplo acima, todo o dispositivo é dedicado ao <filename>vinum</filename> e não há sobra de partição raiz pré-<filename>vinum</filename>.

source: Troubleshooting
pt_br: Soluções de problemas

source: The following list contains a few known pitfalls and solutions.
pt_br: A lista a seguir contém algumas armadilhas e soluções conhecidas.

source: System Bootstrap Loads, but System Does Not Boot
pt_br: Sistema de bootstrap carrega, mas o sistema não

source: If for any reason the system does not continue to boot, the bootstrap can be interrupted by pressing <keycap>space</keycap> at the 10-seconds warning. The loader variable <literal>vinum.autostart</literal> can be examined by typing <command>show</command> and manipulated using <command>set</command> or <command>unset</command>.
pt_br: Se por algum motivo o sistema não continuar a inicialização, o bootstrap pode ser interrompido pressionando <keycap>espaço</keycap> no aviso de 10 segundos. A variável <literal>vinum.autostart</literal> do loader pode ser examinada digitando <command>show</command> e manipulada usando <command>set</command> ou <command>unset</command>.

source: If the <filename>vinum</filename> kernel module was not yet in the list of modules to load automatically, type <command>load geom_vinum</command>.
pt_br: Se o módulo do kernel <filename>vinum</filename> ainda não estava na lista de módulos para carregar automaticamente, digite <command>load geom_vinum</command>.

source: When ready, the boot process can be continued by typing <command>boot -as</command> which <option>-as</option> requests the kernel to ask for the root file system to mount (<option>-a</option>) and make the boot process stop in single-user mode (<option>-s</option>), where the root file system is mounted read-only. That way, even if only one plex of a multi-plex volume has been mounted, no data inconsistency between plexes is being risked.
pt_br: Quando estiver pronto, o processo de inicialização pode ser continuado digitando-se <command>boot -as</command>, no qual <option>-as</option> solicita ao kernel que peça ao sistema de arquivos raiz para montar (<option>-a</option>) e fazer com que o processo de inicialização pare no modo single user(<option>-s</option>), em que o sistema de arquivos raiz é montado como somente leitura. Dessa forma, mesmo que apenas um plex de um volume multi-plex tenha sido montado, não estaremos arriscando nenhuma inconsistência de dados entre os plexes.
