Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/mailing-list-faq/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Equipo de traducción de FreeBSD al Español Sergio Carlavilla carlavilla@mailbox.org, 2019
pt_br: Alexandre Vasconcelos, alex.vasconcelos@gmail.com, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018 Mauro Risonho de Paula Assumpção, mauro.risonho@gmail.com, 2018

source: Frequently Asked Questions About The FreeBSD Mailing Lists
es_es: Preguntas más frecuentes sobre las listas de correo de FreeBSD
pt_br: Perguntas Frequentes Sobre as Listas de Discussão do FreeBSD

source: $FreeBSD: head/en_US.ISO8859-1/articles/mailing-list-faq/article.xml 51998 2018-07-12 22:45:00Z jgh $
pt_br: $FreeBSD$

source: This is the FAQ for the FreeBSD mailing lists. If you are interested in helping with this project, send email to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>. The latest version of this document is always available from the <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/articles/mailing-list-faq/index.html">FreeBSD World Wide Web server</link>. It may also be downloaded as one large <link xlink:href="article.html">HTML</link> file with HTTP or as plain text, PostScript, PDF, etc. from the <link xlink:href="https://download.freebsd.org/ftp/doc/">FreeBSD FTP server</link>. You may also want to <link xlink:href="@@URL_RELPREFIX@@/search/index.html">Search the FAQ</link>.
es_es: Estas son las FAQ de las listas de correo de FreeBSD. Si está interesado en ayudar con este proyecto, envíe un correo electrónico a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de correo del proyecto de documentación de FreeBSD</link>. La última versión de este documento está siempre disponible en el <link xlink:href="https://www.FreeBSD.org/doc/es_ES.ISO8859-1/articles/mailing-list-faq/index.html">servidor de FreeBSD</link>. También se puede descargar como un único archivo <link xlink:href="article.html">HTML</link> con HTTP o como texto plano, PostScript, PDF, etc. desde el <link xlink:href="https://download.freebsd.org/ftp/doc/">servidor FTP de FreeBSD</link>. También es posible que desee <link xlink:href="@@URL_RELPREFIX@@/search/index.html">Buscar en las FAQ</link>.
pt_br: Esta é a FAQ para as listas de discussão do FreeBSD. Se você está interessado em ajudar este projeto, envie um email para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão do projeto de documentação do FreeBSD</link>. A última versão deste documento está sempre disponível no <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/articles/mailing-list-faq/index.html">Servidor Web do Projeto FreeBSD</link>. Ele também poderá ser obtido como um grande e único arquivo <link xlink:href="article.html">HTML</link> por meio de HTTP ou como texto puro, PostScript, PDF, etc. a partir do <link xlink:href="https://download.freebsd.org/ftp/doc/">Servidor FTP do FreeBSD</link>. Você também poderá querer <link xlink:href="@@URL_RELPREFIX@@/search/index.html">Pesquisar na FAQ</link>.

source: Introduction
es_es: Introducción
pt_br: Introdução

source: As is usual with FAQs, this document aims to cover the most frequently asked questions concerning the FreeBSD mailing lists (and of course answer them!). Although originally intended to reduce bandwidth and avoid the same old questions being asked over and over again, FAQs have become recognized as valuable information resources.
es_es: Como es habitual en las FAQ, este documento pretende cubrir las preguntas más frecuentes relacionadas con las listas de correo de FreeBSD (¡y por supuesto, responderlas!). Aunque originalmente tenía la intención de reducir el ancho de banda y evitar que se hicieran las mismas preguntas una y otra vez, las FAQ han sido reconocidas como un recurso de información valioso.
pt_br: Como é comum com as FAQs, este documento objetiva cobrir as perguntas feitas com mais frequência a respeito das listas de discussão do FreeBSD (e claro responde-las!). Embora originalmente intencionada a reduzir o tráfego e evitar que as mesmas velhas perguntas fossem enviadas várias e várias vezes, as FAQs se tornaram reconhecidamente uma fonte de informações valiosas.

source: This document attempts to represent a community consensus, and as such it can never really be <emphasis>authoritative</emphasis>. However, if you find technical errors within this document, or have suggestions about items that should be added, please either submit a PR, or email the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>. Thanks.
es_es: Este documento intenta representar el consenso de la comunidad y, como tal, jamás debería ser <emphasis>autoritario</emphasis>. Sin embargo, si encuentra errores técnicos en este documento o tiene sugerencias sobre elementos que deban añadirse, por favor envíe un PR o un correo electrónico a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de correo del proyecto de documentación de FreeBSD</link>. Gracias.
pt_br: Este documento tenta representar um consenso da comunidade, e como tal nunca poderá realmente ser <emphasis>oficial</emphasis>. Entretanto, se você encontrar erros técnicos neste documento, ou se tiver sugestões sobre itens que devam ser adicionados, por favor submeta um PR, ou envie um email para a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">lista de discussão de documentação do projeto FreeBSD</link>. Obrigado.

source: What is the purpose of the FreeBSD mailing lists?
es_es: ¿Cuál es el propósito de las listas de correo de FreeBSD?
pt_br: Qual é o propósito das listas de discussão do FreeBSD?

source: The FreeBSD mailing lists serve as the primary communication channels for the FreeBSD community, covering many different topic areas and communities of interest.
es_es: Las listas de correo de FreeBSD constituyen el canal principal de comunicación de la comunidad de FreeBSD, cubriendo varias áreas y comunidades de intereses diferentes.
pt_br: As listas de discussão do FreeBSD servem como um canal primário de comunicação para a comunidade FreeBSD, cobrindo muitos tópicos diferentes e áreas de interesse da comunidade.

source: Who is the audience for the FreeBSD mailing lists?
es_es: ¿Quién es el público de las listas de correo de FreeBSD?
pt_br: Quem é o publico das listas de discussão do FreeBSD?

source: This depends on charter of each individual list. Some lists are more oriented to developers; some are more oriented towards the FreeBSD community as a whole. Please see <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">this list</link> for the current summary.
es_es: Esto depende del cometido oficial de cada lista en particular. Algunas listas están más orientadas a los desarrolladores; otras están más orientadas hacia la comunidad de usuarios de FreeBSD en general. Por favor, vea <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">esta lista</link> para un resumen actual.
pt_br: Isto depende da premissa de cada lista. Algumas listas são mais orientadas a desenvolvedores; outras para a comunidade FreeBSD como um todo. Por favor veja <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">esta lista</link> para o resumo atual.

source: Are the FreeBSD mailing lists open for anyone to participate?
es_es: ¿Las listas de correo de FreeBSD están abiertas para que cualquiera pueda participar?
pt_br: As listas de discussão do FreeBSD são abertas para a participação de qualquer pessoa?

source: Again, this depends on charter of each individual list. Please read the charter of a mailing list before you post to it, and respect it when you post. This will help everyone to have a better experience with the lists.
es_es: Una vez más, esto depende del cometido oficial de cada lista en particular. Por favor, consulte el charter (la declaración del cometido de las listas de correo) antes de enviar un correo a la lista y siga la filosofía de dicha lista en los envíos que haga. Esto ayudará al resto de usuarios a sacar más provecho de la lista.
pt_br: Novamente, isto dependerá das regras de cada lista. Por favor leia o objetivo da lista antes de postar, e respeite estes objetivos quando você postar. Isto ajudará a todos os participantes a terem uma experiência melhor com as listas.

source: If after reading the above lists, you still do not know which mailing list to post a question to, you will probably want to post to freebsd-questions (but see below, first).
es_es: Si después de leer las listas anteriores todavía no ha podido discernir a qué lista debe enviar su pregunta, probablemente pueda enviar la consulta a la lista freebsd-questions (pero por favor lea más abajo antes de hacerlo).
pt_br: Se após ler as listas acima você ainda não souber para qual delas enviar a sua pergunta, provavelmente você deverá postar na lista freebsd-questions (mas antes, veja abaixo).

source: Also note that the mailing lists have traditionally been open to postings from non-subscribers. This has been a deliberate choice, to help make joining the FreeBSD community an easier process, and to encourage open sharing of ideas. However, due to past abuse by some individuals, certain lists now have a policy where postings from non-subscribers must be manually screened to ensure that they are appropriate.
es_es: Tenga en cuenta también que las listas de correo tradicionalmente han estado abiertas a la recepción de correo por parte de no subscriptores. Esta ha sido una elección deliberada, para ayudar a que unirse a la comunidad de FreeBSD sea un proceso más fácil y para fomentar el intercambio abierto de ideas. No obstante, debido a los abusos de envío masivo de correos por parte de algunos individuos, ciertas listas ahora tienen una política según la cual las publicaciones de no suscriptores deben seleccionarse manualmente para asegurarse de que sean apropiadas.
pt_br: Note também que as listas de discussão tradicionalmente tem estado abertas para postagens de não assinantes. Isto foi uma escolha deliberada, para fazer com o engajamento na comunidade FreeBSD seja um processo mais simples, e para encorajar o compartilhamento aberto de ideias. Entretanto, devido ao abuso de alguns indivíduos, algumas listas possuem agora políticas em os posts de não assinantes devem ser aprovados manualmente para ter certeza de que são apropriados.

source: How can I subscribe?
es_es: ¿Cómo puedo suscribirme?
pt_br: Como posso me inscrever?

source: You can use <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo"> the Mailman web interface</link> to subscribe to any of the public lists.
es_es: Puede utilizar la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">interfaz web de Mailman</link> para suscribirse a cualquiera de las listas públicas.
pt_br: Você pode usar <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo"> a interface web do Mailman</link> para se inscrever em qualquer uma das listas públicas.

source: How can I unsubscribe?
es_es: ¿Cómo puedo darme de baja?
pt_br: Como cancelo minha inscrição?

source: You can use the same interface as above; or, you can follow the instructions that are at the bottom of every mailing list message that is sent.
es_es: Puede utilizar exactamente la misma interfaz que en el caso anterior; o puede seguir las instrucciones que se añaden automáticamente al final de cualquier mensaje publicado en la lista.
pt_br: Você pode usar a mesma interface acima; ou, você pode seguir as instruções no rodapé de cada mensagem enviada pela lista.

source: Please do not send unsubscribe messages directly to the public lists themselves. First, this will not accomplish your goal, and second, it will irritate the existing subscribers, and you will probably get flamed. This is a classical mistake when using mailing lists; please try to avoid it.
es_es: Por favor, no envíe mensajes de baja directamente a la lista de correo. Primero, con esto no obtendrá su objetivo, y en segundo lugar, irritará a los subscriptores y probablemente será increpado por ello. Se trata de un error bastante común cuando se comienza a utilizar listas de correo; por favor, intente evitarlo.
pt_br: Por favor não envie mensagens de cancelamento de inscrição diretamente para as listas públicas. Primeiro, você não alcançará seu objetivo, e segundo, você irritará os outros assinantes da lista, e provavelmente você será retaliado. Este é um erro clássico ao usar as listas de discussão; por favor tente evitar isso.

source: Are archives available?
es_es: ¿Están los archivos históricos disponibles?
pt_br: O histórico da listas está disponível?

source: Yes. Threaded archives are available <link xlink:href="http://docs.FreeBSD.org/mail/">here</link>.
es_es: Sí. Los archivos agrupados por hilo están disponibles <link xlink:href="http://docs.FreeBSD.org/mail/">aquí</link>.
pt_br: Sim. Os históricos das mensagens, agrupadas por tópicos de conversa, estão disponíveis <link xlink:href="http://docs.FreeBSD.org/mail/">aqui</link>.

source: Are mailing lists available in a digest format?
es_es: ¿Las listas de correo están disponibles en un formato resumen (digest)?
pt_br: As listas de discussão estão disponíveis em um formato sumarizado (digest)?

source: Yes. See <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo"> the Mailman web interface</link>.
es_es: Sí. Consulte <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">la interfaz web de Mailman</link>.
pt_br: Sim. Veja a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">interface web do Mailman</link>.

source: Mailing List Etiquette
es_es: Normas de protocolo de las listas de correo
pt_br: Etiqueta em Listas de Discussão

source: Participation in the mailing lists, like participation in any community, requires a common basis for communication. Please make only appropriate postings, and follow common rules of etiquette.
es_es: La participación en listas de correo, como la colaboración en cualquier otra comunidad, se fundamenta en unas bases o estructuras comunes sobre las cuales el proceso comunicativo tiene lugar. Por favor, recuerde enviar únicamente preguntas o respuestas adecuadas y siga las siguientes reglas de protocolo.
pt_br: A participação em listas de discussão, assim como a participação em qualquer comunidade, requer uma base comum para comunicação. Por favor envie apenas postagens apropriadas, e siga regras comuns de etiqueta.

source: What should I do before I post?
es_es: ¿Qué debo hacer antes de enviar un correo?
pt_br: O que devo fazer antes de postar?

source: You have already taken the most important step by reading this document. However, if you are new to FreeBSD, you may first need to familiarize yourself with the software, and all the social history around it, by reading the numerous <link xlink:href="@@URL_RELPREFIX@@/docs/books.html">books and articles</link> that are available. Items of particular interest include the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html"> FreeBSD Frequently Asked Questions (FAQ)</link> document, the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html"> FreeBSD Handbook</link>, and the articles <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/freebsd-questions/article.html"> How to get best results from the FreeBSD-questions mailing list</link>, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/explaining-bsd/article.html"> Explaining BSD</link>, and <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/new-users/article.html"> FreeBSD First Steps</link>.
es_es: Usted ha completado el paso más importante al comenzar a leer este documento. Sin embargo, si es nuevo en FreeBSD, es posible que primero deba familiarizarse con el software y toda la historia social que lo rodea, leyendo los numerosos <link xlink:href="@@URL_RELPREFIX@@/docs/books.html">libros y artículos disponibles</link>. Son puntos de particular interés el documento <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/faq/index.html">Las preguntas más frecuentes en FreeBSD (FAQ)</link>, el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/index.html">Manual de FreeBSD</link> y los artículos <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/freebsd-questions/article.html">Cómo obtener los mejores resultados de la lista de correo FreeBSD-questions</link>, <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/explaining-bsd/article.html">Explicando BSD</link>, y <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/new-users/article.html">Primeros pasos en FreeBSD</link>.
pt_br: Você já deu o passo mais importante ao ler este documento. Entretanto, se você é novo no FreeBSD, você primeiro precisa se familiarizar com o software, e a história social que o envolve lendo os numerosos <link xlink:href="@@URL_RELPREFIX@@/docs/books.html">livros e artigos</link> que estão disponíveis. Itens de interesse particular incluem o documento <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html">Perguntas Frequentes do FreeBSD (FAQ)</link>, o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/index.html"> Handbook do FreeBSD</link>, e os artigos <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/freebsd-questions/article.html">Como obter melhores resultados na lista de discussão FreeBSD-questions</link>, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/explaining-bsd/article.html"> Explicando o BSD</link>, e <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/new-users/article.html"> Primeiros passos no FreeBSD</link>.

source: It is always considered bad form to ask a question that is already answered in the above documents. This is not because the volunteers who work on this project are particularly mean people, but after a certain number of times answering the same questions over and over again, frustration begins to set in. This is particularly true if there is an existing answer to the question that is already available. Always keep in mind that almost all of the work done on FreeBSD is done by volunteers, and that we are only human.
es_es: Enviar una consulta sobre algo que ya está respondido en los documentos anteriores se considera malas formas. Esto no ocurre porque los voluntarios que colaboran en las listas sean personas especialmente susceptibles, sino porque después de un cierto tiempo respondiendo una y otra vez las mismas preguntas las personas comienzan a sentirse frustradas. Tenga siempre en cuenta que casi todo el trabajo realizado en FreeBSD lo realizan voluntarios, y que solo somos humanos.
pt_br: É sempre considerado errado fazer uma pergunta que já foi respondida nos documentos acima. Isto não é porque os voluntários que trabalham neste projeto são pessoas particularmente más, mas depois de um certo número de vezes respondendo às mesmas perguntas repetidas vezes, a frustração começa a surgir. Isto é particularmente verdadeiro se houver uma resposta existente para uma pergunta que já está disponível. Tenha sempre em mente que quase todo o trabalho feito no FreeBSD é feito por voluntários, e que somos apenas humanos.

source: What constitutes an inappropriate posting?
es_es: ¿Qué se considera un mensaje inapropiado?
pt_br: O que constitui uma postagem inadequada?

source: Postings must be in accordance with the charter of the mailing list.
es_es: Las publicaciones deben seguir el charter de la lista de correo.
pt_br: As mensagens devem estar de acordo com as regras da lista de discussão.

source: Personal attacks are discouraged. As good net-citizens, we should try to hold ourselves to high standards of behavior.
es_es: Por favor, evite los ataques personales. Como buenos ciudadanos de la red, debemos tratar de mantenernos en unos altos estándares de comportamiento.
pt_br: Ataques pessoais são desencorajados. Como bons net-cidadãos, devemos tentar nos manter com altos padrões de comportamento.

source: Spam is not allowed, ever. The mailing lists are actively processed to ban offenders to this rule.
es_es: No se permite el spam, en ningún caso. Las listas de correo se procesan constantemente para asegurarse del cumplimiento de esta regla.
pt_br: Spam não é permitido, nunca. As listas de discussão são administradas ativamente para banir os infratores dessa regra.

source: What is considered proper etiquette when posting to the mailing lists?
es_es: ¿Qué se considera como una norma de etiqueta apropiada cuando se envían correos a las listas?
pt_br: O que é considerado etiqueta apropriada ao postar nas listas de discussão?

source: Please wrap lines at 75 characters, since not everyone uses fancy GUI mail reading programs.
es_es: Por favor ajuste todas las líneas a 75 caracteres, ya que no todo el mundo utiliza programas de correo con interfaces gráficas avanzadas.
pt_br: Por favor, use quebra de linha automática em 75 caracteres, pois nem todo mundo usa clientes de email em uma interface gráfica.

source: Please respect the fact that bandwidth is not infinite. Not everyone reads email through high-speed connections, so if your posting involves something like the content of <filename>config.log</filename> or an extensive stack trace, please consider putting that information up on a website somewhere and just provide a URL to it. Remember, too, that these postings will be archived indefinitely, so huge postings will simply inflate the size of the archives long after their purpose has expired.
es_es: Por favor, tenga presente el hecho de que el ancho de banda no es un recurso infinito. No todo el mundo lee el correo electrónico a través de conexiones de alta velocidad, de forma que si sus mensajes contienen adjuntos tales como el contenido del fichero <filename>config.log</filename> o un amplio seguimiento de la pila, considere colocar esa información en un sitio web y proporcione solo la URL. Recuerde, también, que estas publicaciones se archivarán indefinidamente, por lo que las publicaciones enormes aumentarán el tamaño de los archivos mucho después de que su propósito haya expirado.
pt_br: Por favor, respeite o fato de que a largura de banda não é infinita. Nem todo mundo lê e-mails através de conexões de alta velocidade, então se sua postagem envolve algo como o conteúdo de um arquivo como o <filename>config.log</filename> ou um extenso stack trace, por favor considere colocar essas informações em algum lugar e apenas fornecer uma URL para eles. Lembre-se, também, de que essas postagens serão arquivadas indefinidamente, de modo que postagens enormes simplesmente aumentarão o tamanho dos arquivos muito depois que o propósito deles tiver expirado.
