Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/mailing-list-faq/*.po
Languages: es_es, pt_br

source: Format your message so that it is legible, and PLEASE DO NOT SHOUT!!!!!. Do not underestimate the effect that a poorly formatted mail message has, and not just on the FreeBSD mailing lists. Your mail message is all that people see of you, and if it is poorly formatted, badly spelled, full of errors, and/or has lots of exclamation points, it will give people a poor impression of you.
es_es: Formatee su mensaje de forma que sea legible, y, ¡¡¡¡¡POR FAVOR NO GRITE!!!!! No subestime el efecto que tiene un mensaje de correo mal formateado, y no solo en las listas de correo de FreeBSD. Su mensaje de correo es todo lo que la gente ve de usted, y si está mal formateado, mal escrito, lleno de errores y/o tiene muchos signos de exclamación, dará a la gente una mala impresión de usted.
pt_br: Formate a sua mensagem para que fique legível e, POR FAVOR, NÃO GRITE !!!!! Não subestime o efeito que uma mensagem de correio mal formatada tem, e não apenas nas listas de discussão do FreeBSD. Sua mensagem de e-mail é tudo o que as pessoas veem de você e, se estiver mal formatada, mal grafada, cheia de erros ou tiver muitos pontos de exclamação, isso dará às pessoas uma má impressão de você.

source: Please use an appropriate human language for a particular mailing list. Many non-English mailing lists are <link xlink:href="@@URL_RELPREFIX@@/community/mailinglists.html"> available</link>.
es_es: Por favor utilice el idioma (y el léxico) apropiado para cada lista de correo. Existen muchas listas de habla no inglesa, consulte el siguiente <link xlink:href="@@URL_RELPREFIX@@/community/mailinglists.html">enlace</link>.
pt_br: Por favor, use uma linguagem humana apropriada para uma lista de discussão específica. Muitas listas de discussão que não utilizam o idioma inglês estão <link xlink:href="@@URL_RELPREFIX@@/community/mailinglists.html"> disponíveis </link>.

source: For the ones that are not, we do appreciate that many people do not speak English as their first language, and we try to make allowances for that. It is considered particularly poor form to criticize non-native speakers for spelling or grammatical errors. FreeBSD has an excellent track record in this regard; please, help us to uphold that tradition.
es_es: Para los que no lo son, sabemos que muchas personas no hablan inglés como primer idioma, y tratamos de hacer concesiones. Criticar a hablantes de inglés no nativos por una gramática pobre o errores en su escritura se consideran (muy) malos modos. FreeBSD posee un excelente bagaje en este tema; por favor ayúdenos a mantener esta tradición.
pt_br: Para os que não são, nós apreciamos que muitas pessoas não falam inglês como sua primeira língua, e tentamos fazer concessões para isso. Considera-se uma forma particularmente pobre criticar falantes não nativos por erros ortográficos ou gramaticais. O FreeBSD tem um excelente histórico neste aspecto; por favor, ajude-nos a manter essa tradição.

source: Please use a standards-compliant Mail User Agent (MUA). A lot of badly formatted messages come from <link xlink:href="http://www.lemis.com/grog/email/email.php">bad mailers or badly configured mailers</link>. The following mailers are known to send out badly formatted messages without you finding out about them:
es_es: Por favor utilice un Mail User Agent (MUA) que cumpla los estándares de correo electrónico. Muchos mensajes mal formateados provienen de <link xlink:href="http://www.lemis.com/grog/email/email.php">correos incorrectos o mal configurados</link>. Los siguientes agentes son tristemente conocidos por lo mal que estructuran y formatean los mensajes de correo sin que usted se de cuenta de ello:
pt_br: Por favor, use um Mail User Agent (MUA) compatível com os padrões. Muitas mensagens mal formatadas vêm de <link xlink:href="http://www.lemis.com/grog/email/email.php">clientes de email ruins ou mal-configurados</link>. Os seguintes clientes de email são conhecidos por enviar mensagens mal formatadas sem que você saiba sobre elas:

source: Try not to use <acronym>MIME</acronym>: a lot of people use mailers which do not get on very well with <acronym>MIME</acronym>.
es_es: Trate de no usar <acronym>MIME</acronym>: muchas personas usan correos que no se llevan muy bien con <acronym>MIME</acronym>.
pt_br: Tente não usar <acronym>MIME</acronym>: muitas pessoas usam clientes de email que não se dão muito bem com<acronym>MIME</acronym>.

source: Make sure your time and time zone are set correctly. This may seem a little silly, since your message still gets there, but many of the people on these mailing lists get several hundred messages a day. They frequently sort the incoming messages by subject and by date, and if your message does not come before the first answer, they may assume that they missed it and not bother to look.
es_es: Asegúrese de que su hora y zona horaria están configuradas correctamente. Esto puede parecer un poco estúpido a primera vista, ya que su mensaje será recibido, pero muchas de las personas en estas listas de correo reciben varios cientos de mensajes al día. Frecuentemente, ordenan los mensajes entrantes por asunto y por fecha, y si su mensaje no aparece antes de la primera respuesta, pueden asumir que lo pasaron por alto y no molestarse en mirar.
pt_br: Verifique se o seu horário e fuso horário estão definidos corretamente. Isso pode parecer um pouco bobo, já que sua mensagem ainda chegará na lista, mas muitas das pessoas nestas listas recebem centenas de mensagens por dia. Eles frequentemente classificam as mensagens recebidas por assunto e por data, e se sua mensagem não vier antes da primeira resposta, eles podem assumir que eles perderam a mensagem e não se darão ao trabalho de procurar.

source: A lot of the information you need to supply is the output of programs, such as <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, or console messages, which usually appear in <filename>/var/log/messages</filename>. Do not try to copy this information by typing it in again; not only it is a real pain, but you are bound to make a mistake. To send log file contents, either make a copy of the file and use an editor to trim the information to what is relevant, or cut and paste into your message. For the output of programs like <command>dmesg</command>, redirect the output to a file and include that. For example,
es_es: Mucha de la información que deberá proporcionar es la salida de programas, como <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum></citerefentry> o mensajes de consola, que generalmente aparecen en <filename>/var/log/messages</filename>. No intente copiar esta información escribiéndola nuevamente; no solo es un trabajo penoso sino que es muy probable que se cometan errores. Para enviar contenidos de ficheros de log o bien haga una copia del fichero para que sea adjuntado al mensaje previa eliminación de la información no relevante, o bien utilice el método de copiar y pegar. Para la salida de programas tales como <command>dmesg</command>, redireccione la salida a un fichero y utilice alguno de los procedimientos anteriores. Por ejemplo,
pt_br: Muitas das informações que você precisará fornecer referem-se a saída de programas, como <citerefentry><refentrytitle>dmesg</refentrytitle><manvolnum>8</manvolnum> </citerefentry>, ou mensagens do console, que geralmente aparecem no <filename>/ var /log /messages</filename>. Não tente copiar essa informação digitando-a novamente; Isso será não só um sofrimento real, mas você é provavelmente irá cometer um erro. Para enviar o conteúdo do arquivo de log, faça uma cópia do arquivo e use um editor para reduzi-lo às informações relevantes ou copie e cole na sua mensagem. Para a saída de programas como <command>dmesg</command>, redirecione a saída para um arquivo e inclua-o. Por exemplo,

source: This redirects the information to the file <filename>/tmp/dmesg.out</filename>.
es_es: Esto redirige la información al fichero <filename>/tmp/dmesg.out</filename>
pt_br: Isso redireciona as informações para o arquivo <filename>/tmp/dmesg.out</filename>.

source: When using cut-and-paste, please be aware that some such operations badly mangle their messages. This is of particular concern when posting contents of <filename>Makefiles</filename>, where <literal>tab</literal> is a significant character. This is a very common, and very annoying, problem with submissions to the <link xlink:href="@@URL_RELPREFIX@@/support.html"> Problem Reports database</link>. <filename>Makefiles</filename> with tabs changed to either spaces, or the annoying <literal>=3B</literal> escape sequence, create a great deal of aggravation for committers.
es_es: Cuando utilice cortar y pegar, tenga en cuenta que algunas de estas operaciones estropean sus mensajes. Este hecho es de particular importancia cuando se trata de enviar el contenido de ficheros <filename>Makefiles</filename>, donde el <literal>tabulador</literal> es un carácter separador muy importante. Este es uno de los problemas más comunes de los envíos <link xlink:href="@@URL_RELPREFIX@@/support.html">a la base de datos de informes de problemas</link>. Los <filename>Makefiles</filename> con tabuladores transformados en espacios, o transformados en la secuencia de escape <literal>=3B</literal>, crean exasperación entre los commiters.
pt_br: Ao usar o recurso de copiar e colar, lembre-se de que algumas dessas operações manipulam incorretamente suas mensagens. Isto é particularmente preocupante ao postar conteúdo de <filename>Makefiles</filename>, onde o <literal>tab</literal> é um caractere significativo. Este é um problema muito comum, e muito chato, com envios para o <link xlink:href="@@URL_RELPREFIX@@/support.html">banco de dados de Relatórios de Problemas</link>. Arquivos <filename>Makefiles</filename> com tabs alterados para espaços, ou a chata sequência de escape <literal>=3B</literal>, cria um grande agravamento para os committers.

source: What are the special etiquette consideration when replying to an existing posting on the mailing lists?
es_es: ¿Cuáles son las consideraciones especiales de etiqueta cuando se responde a un mensaje en las listas de correo?
pt_br: Qual é a consideração de etiqueta especial ao responder a uma postagem existente nas listas de discussão?

source: Please include relevant text from the original message. Trim it to the minimum, but do not overdo it. It should still be possible for somebody who did not read the original message to understand what you are talking about.
es_es: Por favor incluya el texto del mensaje original que considere relevante. Recórtelo al mínimo, pero no exagere. Cualquier otra persona que no leyó el mensaje original debería ser capaz de entender de qué se está hablando.
pt_br: Por favor, inclua o texto relevante da mensagem original. Reduza-a ao mínimo, mas não exagere. Ela deverá permitir que alguém que não leu a mensagem original entenda do que você está falando.

source: This is especially important for postings of the type "yes, I see this too", where the initial posting was dozens or hundreds of lines.
es_es: Esto es particularmente importante en el caso de envíos del estilo de "sí, yo también veo esto", donde el mensaje original formado por cientos de líneas no aparece.
pt_br: Isso é especialmente importante para postagens do tipo "sim, também vejo isso", em que a postagem inicial era de dezenas ou centenas de linhas.

source: Use some technique to identify which text came from the original message, and which text you add. A common convention is to prepend <quote><literal>&gt; </literal></quote> to the original message. Leaving white space after the <quote><literal>&gt; </literal></quote> and leaving empty lines between your text and the original text both make the result more readable.
es_es: Utilice alguna técnica para identificar entre el texto original del mensaje y el texto que usted añada. Una convención común es anteponer <quote><literal>&gt; </literal></quote> al mensaje original. Dejar espacios en blanco después de <quote><literal>&gt; </literal></quote> y dejar líneas en blanco entre nuestro texto y el texto original.
pt_br: Use alguma técnica para identificar qual texto veio da mensagem original e qual texto você adicionou. Uma convenção comum é prefixar com <quote><literal>&gt;</literal></quote> a mensagem original. Deixando espaço em branco após o <quote><literal>&gt;</literal></quote> e deixando linhas vazias entre o seu texto e o texto original, ambos tornam o resultado mais legível.

source: Please ensure that the attributions of the text you are quoting is correct. People can become offended if you attribute words to them that they themselves did not write.
es_es: Asegúrese de que las atribuciones del texto que está citando son correctas. Las personas pueden ofenderse si les atribuye palabras que ellos mismos no escribieron.
pt_br: Por favor, certifique-se de que as atribuições do texto que você está citando estão corretas. As pessoas podem ficar ofendidas se você atribuir palavras a elas que elas mesmas não escreveram.

source: Please do not <literal>top post</literal>. By this, we mean that if you are replying to a message, please put your replies after the text that you copy in your reply.
es_es: Por favor, no haga <literal>top post</literal>. Con esto, queremos decir que si está respondiendo a un mensaje, ponga sus respuestas después del texto.
pt_br: Por favor não faça <literal>top post</literal>. Com isso, queremos dizer que, se você estiver respondendo a uma mensagem, coloque suas respostas após o texto copiado na sua resposta.

source: A: Because it reverses the logical flow of conversation.
es_es: R: Porque invierte el flujo lógico de la conversación.
pt_br: R: Porque inverte o fluxo lógico da conversa.

source: Q: Why is top posting frowned upon?
es_es: P: ¿Por qué el top posting está mal visto?
pt_br: P: Por que a publicação superior é desaprovada?

source: (Thanks to Randy Bush for the joke.)
es_es: (Gracias a Randy Bush por la broma.)
pt_br: (Obrigado Randy Bush pela piada.)

source: Recurring Topics On The Mailing Lists
es_es: Temas recurrentes en las listas de correo
pt_br: Tópicos recorrentes nas listas de discussão

source: Participation in the mailing lists, like participation in any community, requires a common basis for communication. Many of the mailing lists presuppose a knowledge of the Project's history. In particular, there are certain topics that seem to regularly occur to newcomers to the community. It is the responsibility of each poster to ensure that their postings do not fall into one of these categories. By doing so, you will help the mailing lists to stay on-topic, and probably save yourself being flamed in the process.
es_es: La participación en las listas de correo, así como la participación en cualquier otra comunidad, se basa en una serie de normas básicas para posibilitar la comunicación. Muchas de las listas de correo presuponen un conocimiento de la historia del proyecto. En particular, existen ciertos temas que suelen aparecer regularmente a los recién llegados a la comunidad. Es responsabilidad de cada participante comprobar que sus mensajes no caen en alguna de estas categorías. Al hacerlo, ayudará a mantener a la lista en el tema, y probablemente se salve de ser atacado en el proceso.
pt_br: A participação nas listas de discussão, como a participação em qualquer comunidade, requer uma base comum para comunicação. Muitas das listas de discussão pressupõem um conhecimento da história do Projeto. Em particular, há certos tópicos que parecem ocorrer regularmente aos recém-chegados à comunidade. É da responsabilidade de cada usuário garantir que suas mensagens não se enquadrem em uma dessas categorias. Ao fazer isso, você ajudará as listas de discussão a permanecerem no tópico e, provavelmente, e provavelmente se salve de ser queimado no processo.

source: The best method to avoid this is to familiarize yourself with the <link xlink:href="http://docs.FreeBSD.org/mail/"> mailing list archives</link>, to help yourself understand the background of what has gone before. In this, the <link xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists"> mailing list search interface</link> is invaluable. (If that method does not yield useful results, please supplement it with a search with your favorite major search engine).
es_es: El mejor método para evitar esto consiste en familiarizarse con los <link xlink:href="http://docs.FreeBSD.org/mail/">archivos de las listas</link>, así sabrá qué temas se han tratado con anterioridad. En este aspecto resulta de gran valor <link xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">la interfaz de búsqueda</link> de la lista de correo. (Si ese método no produce resultados útiles, complételo con una búsqueda en su motor de búsqueda principal favorito).
pt_br: O melhor método para evitar isso é familiarizar-se com os <link xlink:href="http://docs.FreeBSD.org/mail/">arquivos da lista de discussão</link>, para ajudar você a entender o histórico do que aconteceu antes. E para isso, a <link xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">interface de pesquisa das listas de discussões </link> é inestimável. (Se esse método não produzir resultados úteis, por favor, complemente-o com uma pesquisa no seu mecanismo de busca favorito).

source: By familiarizing yourself with the archives, not only will you learn what topics have been discussed before, but also how discussion tends to proceed on that list, who the participants are, and who the target audience is. These are always good things to know before you post to any mailing list, not just a FreeBSD mailing list.
es_es: Si se familiariza con los archivos históricos, no solo aprenderá sobre los temas que se han tratado anteriormente, también aprenderá cómo se produce la discusión en la lista, quiénes son los participantes y quién es el público objetivo. Estos puntos conviene conocerlos antes de preguntar en cualquier lista de correo, no solo en las de FreeBSD.
pt_br: Ao se familiarizar com os arquivos, você não apenas aprenderá os tópicos que foram discutidos anteriormente, mas também como a discussão tende a prosseguir nessa lista, quem são os participantes e quem é o público-alvo. Estas são sempre boas coisas para saber antes de postar em qualquer lista de discussão, não apenas em uma lista de discussão do FreeBSD.

source: There is no doubt that the archives are quite extensive, and some questions recur more often than others, sometimes as followups where the subject line no longer accurately reflects the new content. Nevertheless, the burden is on you, the poster, to do your homework to help avoid these recurring topics.
es_es: No hay duda de que los archivos son bastante extensos, y algunas preguntas se repiten con más frecuencia que otras, algunas veces camufladas dentro de hilos donde la línea del asunto no refleja precisamente el nuevo contenido del mensaje. Sin embargo, es trabajo suyo, quien envía el mensaje, evitar que se produzcan temas recurrentes.
pt_br: Não há dúvida de que os arquivos são bastante extensos e algumas questões recorrem com maior frequência do que outras, às vezes como acompanhamentos em que a linha de assunto não reflete mais precisamente o novo conteúdo. No entanto, o fardo está em você, o usuário, para fazer sua lição de casa para ajudar a evitar esses tópicos recorrentes.

source: What Is A "Bikeshed"?
es_es: ¿Qué es un "Bikeshed"?
pt_br: O que é um "Bikeshed" (Garagem de bicicletas)?

source: Literally, a <literal>bikeshed</literal> is a small outdoor shelter into which one may store one's two-wheeled form of transportation. However, in FreeBSD parlance, the term refers to topics that are simple enough that (nearly) anyone can offer an opinion about, and often (nearly) everyone does. The genesis of this term is explained in more detail <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/misc.html#bikeshed-painting"> in this document</link>. You simply must have a working knowledge of this concept before posting to any FreeBSD mailing list.
es_es: Literalmente, un <literal>bikeshed</literal> es un cobertizo exterior donde se puede almacenar un vehículo de dos ruedas. No obstante, en la jerga de FreeBSD, el término se refiere a temas que son tan simples que (casi) cualquiera puede ofrecer una opinión y, a menudo (casi), todos lo hacen. El origen de este término se explica con más detalle en <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/faq/misc.html#bikeshed-painting">este documento</link>. Simplemente debe tener un conocimiento práctico de este concepto antes de publicar en cualquier lista de correo de FreeBSD.
pt_br: Literalmente, uma <literal>Bikeshed</literal> é um pequeno abrigo ao ar livre no qual se pode armazenar o meio de transporte de duas rodas. No entanto, no jargão do FreeBSD, o termo refere-se a tópicos que são simples o suficiente para que (quase) qualquer um possa opinar sobre ele, e geralmente (quase) todos o fazem. A gênese desse termo é explicada com mais detalhes <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/misc.html#bikeshed-painting">neste documento</link>. Você simplesmente deve ter um conhecimento prático deste conceito antes de postar em qualquer lista de discussão do FreeBSD.

source: More generally, a bikeshed is a topic that will tend to generate immediate meta-discussions and flames if you have not read up on their past history.
es_es: De una forma más general, un bikeshed es un asunto que tiende a generar meta-discusiones y ataques si no se han leído las discusiones anteriores.
pt_br: Mais genericamente, um Bikeshed é um tópico que tenderá a gerar Meta-discussões imediatas e interações hostis com usuários você ainda nem conhece.

source: Please help us to keep the mailing lists as useful for as many people as possible by avoiding bikesheds whenever you can. Thanks.
es_es: Por favor, colabore en el mantenimiento de las listas de correo evitando los bikesheds siempre que pueda. Gracias.
pt_br: Por favor, ajude-nos a manter as listas de discussão úteis para o maior numero possível de pessoas evitando Bikesheds sempre que puder. Obrigado.

source: Acknowledgments
es_es: Agradecimientos
pt_br: Agradecimentos

source: Original author of most of the material on mailing list etiquette, taken from the article on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/freebsd-questions/article.html"> How to get best results from the FreeBSD-questions mailing list</link>.
es_es: Autor original de la mayor parte del material que cubre las normas de etiqueta de las listas, tomadas del artículo <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/freebsd-questions/article.html">Cómo obtener los mejores resultados de la lista de correo FreeBSD-questions</link>.
pt_br: Autor original da maior parte do material sobre etiqueta nas listas de discussão, retirada do artigo sobre <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/freebsd-questions/article.html">Como para obter os melhores resultados da lista de discussão FreeBSD-questions</link>.

source: Creation of the rough draft of this FAQ.
es_es: Por la creación del borrador inicial de estas FAQ.
pt_br: Pela criação do rascunho deste FAQ.
