<!--
     The FreeBSD Documentation Project

     $FreeBSD$
-->

<chapter id="security">
  <chapterinfo>
    <authorgroup>
      <author>
	<firstname>Matthew</firstname>
	<surname>Dillon</surname>
	<contrib>Gran parte del contenido de este cap&iacute;tulo 
        procede de la p&aacute;gina de manual de security(7), de </contrib> 
      </author>
    </authorgroup>
  </chapterinfo>

  <title>Seguridad</title>
  <indexterm><primary>seguridad</primary></indexterm>

  <sect1 id="security-synopsis">
    <title>Sinopsis</title>

    <para>Este cap&iacute;tulo contiene una introducci&oacute;n 
      b&aacute;sica a los conceptos de seguridad del sistema, unas 
      cuantas normas b&aacute;sicas de uso y algunos avanzados del 
      tema en &os;.  Muchos de los temas expuestos se aplican a la 
      seguridad del sistema y de Internet en general.  
      Internet ya no es aqu&eacute;l lugar <quote>amistoso</quote> 
      en el que todo el mundo se comportaba como un buen ciudadano.  
      Si quiere proteger sus datos, su propiedad intelectual, su tiempo 
      y muchas m&aacute;s cosas de manos malintencionadas debe hacer 
      que su sistema sea seguro.</para>

    <para>&os; proporciona un variado arsenal de utilidades y mecanismos para 
      asegurar la integridad y la seguridad de su sistema y red.</para>

    <para>Despu&eacute;s de leer este cap&iacute;tulo:
      </para>

    <itemizedlist>
      <listitem>
        <para>conocer&aacute; conceptos b&aacute;sicos de la seguridad 
          relacionados con &os;.
	  </para>
      </listitem>

      <listitem>
        <para>Tendr&aacute; informaci&oacute;n sobre los diversos mecanismos 
          de cifrado disponibles en &os;, entre los cuales est&aacute;n 
	  <acronym>DES</acronym> y <acronym>MD5</acronym>.
	  </para>
      </listitem>

      <listitem>
        <para>Sabr&aacute; c&oacute;mo configurar la autentificaci&oacute;n 
          de contrase&ntilde;as de un solo uso.</para>
      </listitem>

      <listitem>
        <para>Sabr&aacute; c&oacute;mo configurar <acronym>TCP</acronym> 
          Wrappers y usarlos con 
          <command>inetd</command>.</para>
      </listitem>

      <listitem>
        <para>Sabr&aacute; c&oacute;mo instalar 
          <application>KerberosIV</application> en versiones de &os; 
	  anteriores a 5.0.</para>
      </listitem>

      <listitem>
        <para>Sabr&aacute; c&oacute;mo instalar 
          <application>Kerberos5</application> en versiones de &os; 
	  posteriores a 5.0.</para>
      </listitem>

      <listitem>
        <para>Podr&aacute; configurar IPsec y crear una 
          <acronym>VPN</acronym> entre 
          m&aacute;quinas &os;/&windows;.</para>
      </listitem>
     
      <listitem>
        <para>Sabr&aacute; c&oacute;mo configurar y utilizar 
          <application>OpenSSH</application>,
	  la implementaci&oacute;n de <acronym>SSH</acronym> en &os;.</para>
      </listitem>

      <listitem>
        <para>Sabr&aacute; en qu&eacute; consisten las 
          <acronym>ACL</acronym> del sistema de ficheros y c&oacute;mo 
          utilizarlas.</para>
      </listitem>

      <listitem>
        <para>Sabr&aacute; c&oacute;mo usar 
          <application>Portaudit</application>, con la que podr&aacute; 
          auditar el software que instale desde la 
          desde la colecci&oacute;n de ports.</para>
      </listitem>

      <listitem>
        <para>Sabr&aacute; c&oacute;mo sacar partido de los avisos de 
          seguridad que publica &os;.</para>
      </listitem>

      <listitem>
        <para>Podr&aacute; hacerse una idea clara de en qu&eacute; consiste 
          la contabilidad de procesos y de c&oacute;mo activarla en 
          &os;.</para>
      </listitem>
    </itemizedlist>

    <para>Antes de leer este cap&iacute;tulo:</para>

    <itemizedlist>
      <listitem>
        <para>Comprender conceptos b&aacute;sicos de &os; e Internet.</para>
      </listitem>
    </itemizedlist>

    <para>En otras secciones de este manual se cubren aspectos adicionales 
      sobre seguridad.  Por ejemplo, MAC (controles de acceso obligatorio) 
      se explica en el <xref
      linkend="mac"> y los cortafuegos en el 
      <xref linkend="firewalls">.</para>
  </sect1>

  <sect1 id="security-intro">
    <title>Introducci&oacute;n</title>

    <para>La seguridad es un trabajo que que comienza y termina en el 
      administrador de sistema.  Aunque que los sistemas multiusuario 
      BSD &unix; posean una seguridad inherente, el trabajo de construir y 
      mantener mecanismos de seguridad adicionales para que los 
      usuarios sean a&uacute;n m&aacute;s <quote>honestos</quote> es 
      probablemente una de las mayores tareas de la administraci&oacute;n 
      de sistemas.  Los sistemas son tan seguros como uno los haga, y 
      no hay que olvidar que los problemas de seguridad compiten con la 
      comodidad a la que tendemos los humanos.  Los sistemas &unix; 
      son capaces de ejecutar una gran cantidad de procesos 
      simult&aacute;neamente, muchos de los cuales son servidores, lo que 
      significa que las entidades externas pueden conectarse y 
      <quote>hablar</quote> con ellos.  Del mismo modo que las 
      minicomputadoras de ayer se convirtieron en los sistemas de 
      escritorio de hoy en d&iacute;a, la seguridad se va convirtiendo 
      en un problemas m&aacute;s y m&aacute;s acuciante.</para>

    <para>La seguridad bien entendida se implementa en capas, a la manera de 
      una <quote>cebolla</quote>.  B&aacute;sicamente lo que se hace es 
      crear la mayor cantidad posible de capas de seguridad, para m&aacute;s 
      tarde monitorizar el sistema en busca de intrusos.  No es conveniente 
      exagerar la seguridad, ya que interferir&iacute;a con la 
      detecci&oacute;n, y la detecci&oacute;n es uno de los aspectos 
      m&aacute;s importantes de cualquier mecanismo de seguridad.  
      Por ejemplo, no tiene mucho sentido activar la bandera 
      <literal>schg</literal> (consulte &man.chflags.1;) en cada binario del 
      sistema, ya que aunque proteger&iacute;a en cierto modo los binarios, 
      har&iacute;a que cualquier cambio que pudiera realizar un atacante 
      una vez dentro del sistema fuera m&aacute;s dif&iacute;cil de detectar 
      o incluso hacerlo del todo imposible.</para>

    <para>La seguridad del sistema depende tambi&eacute;n de estar preparados 
      para distintos tipos de ataque, incluyendo intentos de 
      <quote>tirar</quote> la m&aacute;quina o dejarla en un estado 
      inutilizable, pero que no impliquen intentos de comprometer el usuario 
      <username>root</username>  Los problemas de seguridad pueden 
      dividirse en diferentes categor&iacute;as:</para>

    <orderedlist>
      <listitem>
        <para>Ataques de denegaci&oacute;n de servicio (DoS).</para>
      </listitem>

      <listitem>
        <para>Comprometer cuentas de usuarios.</para>
      </listitem>

      <listitem>
        <para>Comprometer root a trav&eacute;s de servidores accesibles.
	</para>
      </listitem>

      <listitem>
        <para>Comprometer root desde cuentas de usuario.</para>
      </listitem>

      <listitem>
        <para>Creaci&oacute;n de puertas traseras 
          (<quote>Backdoors</quote>).</para>
      </listitem>
    </orderedlist>

    <indexterm>
      <primary>Ataques DoS</primary>
      <see>Denegaci&oacute;n de servicio (DoS)</see>
    </indexterm>
    <indexterm>
      <primary>seguridad</primary>
      <secondary>Ataques DoS</secondary>
      <see>Denegaci&oacute;n de servicios (DoS)</see>
    </indexterm>
    <indexterm><primary>Denegacion de servicio (DoS)</primary></indexterm>

    <para>Un ataque de denegaci&oacute;n de servicio es una acci&oacute;n que 
      priva al sistema de los recursos requeridos para su funcionamiento 
      normal.  Generalmente, los ataques DoS son mecanismos de fuerza bruta 
      que intentan <quote>tumbar</quote> el sistema o hacerlo inutilizable 
      sobrecargando la capacidad de sus servidores o de la pila de red.  
      Algunos ataques DoS intentan aprovechar errores en la pila de red 
      para <quote>tumbar</quote> el sistema con un solo paquete.  
      Estos &uacute;ltimos &uacute;nicamente pueden solucionarse aplicando 
      al kernel una actualizaci&oacute;n que subsane el error.  
      Los ataques a servidores muchas veces pueden solucionarse configurando 
      las opciones apropiadas para limitar la carga del sistema en 
      condiciones adversas.  Los ataques de fuerza bruta a redes 
      son m&aacute;s complicados.  Los ataques con paquetes enmascarados, 
      por ejemplo, son casi imposibles de detener, a menos que desconecte 
      el sistema de Internet.  Puede ser que no <quote>tiren</quote> el 
      sistema, pero saturar&aacute;n la conexi&oacute;n a Internet.</para>

    <indexterm>
      <primary>seguridad</primary>
      <secondary>compromiso de cuentas</secondary>
    </indexterm>

    <para>Comprometer una cuenta de usuario es mucho m&aacute;s com&uacute;n 
      que un ataque DoS.  Muchos administradores de sistemas
      todav&iacute;a ejecutan servidores est&aacute;ndar 
      <application>telnetd</application>, <application>rlogind</application>,
      <application>rshd</application> y <application>ftpd</application> en
      sus m&aacute;quinas.  
      Estos servidores, por defecto no operan a trav&eacute;s de conexiones 
      cifradas.  El resultado es que se si se tiene una base de usuarios de 
      tama&ntilde;o medio, tarde o temprando la contrase&ntilde;a de uno 
      (o m&aacute;s) de sus usuarios ser&aacute; descubierta durante 
      sus accesos al sistema desde ubicaciones remotas.(que es, por otra 
      parte, la forma m&aacute;s com&uacute;n y m&aacute;s c&oacute;moda 
      de acceder a un sistema).  El administrador de sistemas atento 
      analizar&aacute; sus logs de acceso remoto en busca de direcciones 
      origen spspechosas, incluso entre los accesos al sistema.</para>

    <para>Se debe asumir <emphasis>siempre</emphasis> que, una vez que 
      el atacante tiene acceso a una cuenta de usuario, el atacante 
      puede comprometer la cuenta <username>root</username>.  En realidad 
      en un sistema bien mantenido y asegurado el acceso a una cuenta de 
      usuario no necesariamente da al atacante acceso a 
      <username>root</username>.  Esta precisi&oacute;n es importante 
      porque sin acceso a <username>root</username> el atacante 
      dif&iacute;cilmente podr&aacute; esconder sus huellas;  podr&aacute;, 
      como mucho, hacer poco m&aacute;s que sembrar el caos en los ficheros 
      del usuario o <quote>tirar</quote> la m&aacute;quina.  
      Comprometer cuentas de usuario es muy com&uacute;n porque los 
      usuarios tienden a no tomar las precauciones que toma el 
      administrador.</para>

    <indexterm>
      <primary>seguridad</primary>
      <secondary>puertas traseras</secondary>
    </indexterm>

    <para>Los administradores de sistemas deben tener presente que 
      existen muchas formas potenciales de comprometer la cuenta 
      <username>root</username> de una m&aacute;quina.  El atacante puede
      conocer la contrase&ntilde;a de <username>root</username>, el 
      atacante puede encontrar un error en un servidor que se ejecuta 
      como root y ser capaz de comprometer <username>root</username> a 
      trav&eacute;s de una conexi&oacute;n de red a ese servidor; puede 
      ser que el atacante sepa de la existencia de un error en un 
      programa suid-root que le permita comprometer 
      <username>root</username> una vez dentro de una cuenta de usuario.  
      Si un atacante encuentra la manera de comprometer la cuenta 
      <username>root</username> de una m&aacute;quina puede que no 
      necesite instalar una puerta trasera.  Muchos de 
      los agujeros <username>root</username> encontrados y cerrados hasta 
      la fecha implican una cantidad considerable de trabajo para el atacante 
      limpiando todo despu&eacute;s del ataque, as&iacute; que 
      la mayor&iacute;a de los atacantes instalan puertas traseras.  
      Una puerta trasera facilita al atacante una forma sencilla de 
      recuperar el acceso de <username>root</username> al sistema, 
      pero tambi&eacute;n proporciona al administrador de sistemas 
      inteligente una forma de detectar la intrusi&oacute;n.  Si hace 
      imposible a un atacante la instalaci&oacute;n de una puerta 
      trasera puede estar actuando en detrimento de su seguridad, porque 
      no cerrar&aacute; el agujero que el atacante encontr&oacute;
      para accder al sistema la primera vez que lo hizo.</para>
      
    <para>Las medidas de seguridad se implementan en un modelo 
      multicapa (tipo <quote>cebolla</quote>), que puede categorizarse 
      del siguiente modo:</para>

    <orderedlist>
      <listitem>
        <para>Asegurar <username>root</username> y cuentas 
          administrativas.</para>
      </listitem>

      <listitem>
        <para>Asegurar los servidores que se ejecuten como 
          <username>root</username> los binarios suid/sgid.</para>
      </listitem>

      <listitem>
        <para>Asegurar cuentas de usuario.</para>
      </listitem>

      <listitem>
        <para>Asegurar el fichero de contrase&ntilde;as.</para>
      </listitem>

      <listitem>
        <para>Asegurar el n&uacute;cleo del kernel, los dispositivos 
          en bruto y el sistema de ficheros.</para>
      </listitem>

      <listitem>
        <para>Detecci&oacute;n r&aacute;pida de cambios 
          hechos al sistema.</para>
      </listitem>

      <listitem>
	<para>Paranoia.</para>
      </listitem>
    </orderedlist>

    <para>La siguiente secci&oacute;n de este cap&iacute;tulo tratar&aacute; 
      los puntos de arriba con mayor profundidad.</para>
  </sect1>

  <sect1 id="securing-freebsd">
    <title>Asegurar &os;</title>
    <indexterm>
      <primary>seguridad</primary>
      <secondary>asegurar &os;</secondary>
    </indexterm>

    <note>
      <title>Orden vs. protocolo</title>
      <para>En este cap&iacute;tulo usaremos el texto en 
        <application>negrita</application> para referirnos a una orden o 
        aplicaci&oacute;n, y una fuente en <command>cursiva</command> para 
        referirnos a &oacute;rdenes espc&iacute;ficas.  Usaremos un tipo normal 
        para los protocolos.  Esta diferencia tipogr&aacute;fica nos 
        ser&aacute; &uacute;til por ejemplo con ssh, que es tanto un 
        protocolo como una orden.</para>
    </note>

    <para>Las siguientes secciones cubren los m&eacute;todos a seguir para 
      asegurar su sistema &os; que se mencionados en la 
      <link linkend="security-intro"> secci&oacute;n anterior</link> de este 
      cap&iacute;tulo.</para>

    <sect2 id="securing-root-and-staff">
      <title>Asegurar la cuenta <username>root</username> y las 
        cuentas administrativas</title>
      <indexterm>
        <primary><command>su</command></primary>
      </indexterm>

      <para>En primer lugar, no se moleste en asegurar las cuentas 
        administrativas (o <quote>staff</quote>) si no ha asegurado la 
        cuenta <username>root</username>.  
        La mayor&iacute;a de los sistemas tienen una contrase&ntilde;a 
        asignada para la cuenta <username>root</username>.  Lo primero que 
        se hace es asumir que la contrase&ntilde;a est&aacute; 
        <emphasis>siempre</emphasis> amenazada.  
        Esto no significa que deba eliminar la contrase&ntilde;a.  La 
        contrase&ntilde;a es casi siempre necesaria para el acceso por 
        consola a la m&aacute;quina; significa que no se debe permitir 
        el uso de la contrase&ntilde;a fuera de la consola o, mejor 
        a&uacute;n, mediante &man.su.1;.  Por ejemplo, 
        aseg&uacute;rese de que sus ptys aparezcan como 
        <emphasis>inseguras</emphasis> en el fichero 
        <filename>/etc/ttys</filename>, con lo que har&aacute; que 
        los accesos como <username>root</username> v&iacute;a 
        <command>telnet</command> o <command>rlogin</command> no sean 
        posibles.  
        Si utiliza otros tipos de login como 
        <application>sshd</application> aseg&uacute;rese de que 
        los accesos al sistema como <username>root</username>
        est&eacute;n tambi&eacute;n deshabilitados.  
        Para ello edite su 
        <filename>/etc/ssh/sshd_config</filename> y aseg&uacute;rese de 
        que <literal>PermitRootLogin</literal> est&eacute; puesto a 
        <literal>NO</literal>.  Estudie cada m&eacute;todo de acceso: 
        hay servicios como FTP que frecuentemente son origen de grietas 
        en la estructura del sistema.  El acceso directo como usuario 
        <username>root</username> s&oacute;lamente debe permitirse 
        a trav&eacute;s de la consola.</para>
      <indexterm>
        <primary><groupname>wheel</groupname></primary>
      </indexterm>

      <para>Es evidente que, como administrador del sistema, debe usted 
        tener la posibilidad de acceder a <username>root</username>, 
        as&iacute; que tendr&aacute; que abrir algunos agujeros, pero 
        debe asegurarse de que estos agujeros necesiten contrase&ntilde;as 
        adicionales para verificar su correcto uso.  Puede hacer 
        que <username>root</username> sea accesible a&ntilde;adiendo 
        cuentas administrativas al grupo 
        <groupname>wheel</groupname> (en 
        <filename>/etc/group</filename>).  El personal que administra los 
        sistemas que aparezcan en el grupo 
        en el grupo <groupname>wheel</groupname> pueden hacer 
        <command>su</command> a <username>root</username>.  
        Nunca debe de proporcionar al personal administrativo el acceso 
        nativo a <groupname>wheel</groupname> poni&eacute;ndolos 
        en el grupo <groupname>wheel</groupname> en su entrada de 
        contrase&ntilde;a.  Las cuentas administrativas deben colocarse 
        en un grupo <groupname>staff</groupname>, y agregarse 
        despu&eacute;s al grupo <groupname>wheel</groupname> en 
        <filename>/etc/group</filename>.  S&oacute;lo aquellos 
        administradores que realmente necesiten acceder a 
        <username>root</username> deben pertenecer al grupo 
        <groupname>wheel</groupname>.  Tambi&eacute;n es posible, 
        mediante un m&eacute;todo de autentificaci&oacute;n como 
        Kerberos, usar el fichero <filename>.k5login</filename> en 
        la cuenta <username>root</username> para permitir un 
        &man.ksu.1; a <username>root</username> sin tener que 
        colocar a nadie en el grupo 
        <groupname>wheel</groupname>.  Puede ser una mejor soluci&oacute;n, 
        ya que el mecanismo <groupname>wheel</groupname> a&uacute;n 
        permite a un atacante comprometer <username>root</username> 
        si el intruso ha conseguido el fichero de contrase&ntilde;as 
        y puede comprometer una cuenta de administraci&oacute;n.  
        Recurrir al mecanismo <groupname>wheel</groupname> es mejor que 
        no tener nada, pero no es necesariamente la opci&oacute;n 
        m&aacute;s segura.</para>

      <!-- XXX:
	This will need updating depending on the outcome of PR bin/71147.
	Personally I know what I'd like to see, which puts this in definite
	need of a rewrite, but we'll have to wait and see.  ceri@
      -->

      <para>Una manera indirecta de asegurar las cuentas de staff y 
        el acceso a <username>root</username> es utilizar un m&eacute;todo 
        de acceso alternativo: es lo que se conoce como 
        <quote>estrellar</quote> las contrase&ntilde;as cifradas de las 
        cuentas administrativas.  Use &man.vipw.8; para reemplazar 
        cada contrase&ntilde;a cifrada por un s&oacute;lo caracter 
        asterisco (<quote><literal>*</literal></quote>).  Esto 
        actualizar&aacute; 
        <filename>/etc/master.passwd</filename> y la base de datos de 
        usuario/contrase&ntilde;a y deshabilitar&aacute; los accesos 
        al sistema validados mediante 
        contrase&ntilde;as.</para>

      <para>Veamos una cuenta administrativa t&iacute;pica:</para>

      <programlisting>foobar:R9DT/Fa1/LV9U:1000:1000::0:0:Foo Bar:/home/foobar:/usr/local/bin/tcsh</programlisting>

      <para>y c&oacute;mo deber&iacute;a quedar:</para>

      <programlisting>foobar:*:1000:1000::0:0:Foo Bar:/home/foobar:/usr/local/bin/tcsh</programlisting>

      <para>Este cambio evitar&aacute; que se efect&uacute;en logins normales, 
        ya que la contrase&ntilde;a cifrada nunca se corresponder&aacute; 
        con <quote><literal>*</literal></quote>.  Hecho esto, el personal 
        de administraci&oacute;n tendr&aacute; que usar otro mecanismo 
        de validaci&oacute;n como &man.kerberos.1; o 
        &man.ssh.1; que use un par de llave p&uacute;blica/privada.  
        Si decide usar algo como Kerberos tendr&aacute; que asegurar 
        la m&aacute;quina que ejecuta los servidores Kerberos 
        y su estaci&oacute;n de trabajo.  Si usa un par de llave 
        p&uacute;blica/privada con ssh, debe asegurar la 
        m&aacute;quina <emphasis>desde</emphasis> desde la que se hace el 
        login (normalmente nuestra estaci&oacute;n de trabajo).  Puede 
        a&ntilde;adir una capa adicional de protecci&oacute;n  al par de 
        llaves protegi&eacute;ndolas con contrase&ntilde;a al crearlo 
        con &man.ssh-keygen.1;.  
        El <quote>estrellado</quote> de las contrase&ntilde;as 
        administrativas tambi&eacute;n garantiza que dicho personal 
        s&oacute;lo pueda entrar a trav&eacute;s de m&eacute;todos de 
        acceso que haya usted configurado.  As&iacute; obligar&aacute; 
        al personal administrativo a usar conexiones seguras, cifradas,
        en todas sus sesiones, lo que cierra un importante agujero 
        de seguridad al que recurren muchos intrusos: usar un 
        sniffer (olfateador) de red desde una m&aacute;quina que le 
        permita hacer tal cosa.</para>
        
      <para>Los mecanismos de seguridad m&aacute;s indirectos tambi&eacute;n 
        asumen que est&aacute; validando su identidad desde un servidor 
        m&aacute;s restrictivo un servidor menos restrictivo.  
        Por ejemplo, si su m&aacute;quina principal ejecuta toda clase de 
        servidores su estaci&oacute;n de trabajo no debe ejecutar ninguno.  
        Para que su estaci&oacute;n de trabajo sea razonablemente segura 
        debe ejecutar los m&iacute;nimos servidores posibles, si es posible 
        ninguno, y debe usar un salvapantallas protegido por 
        contrase&ntilde;a.  Es evidente que un atancante con acceso 
        f&iacute;sico al sistema puede romper cualquier barrera de seguridad 
        que se disponga.  Es un problema a tener en cuenta, pero la 
        mayor&iacute;a de las intrusiones tienen lugar de forma remota, 
        a trav&eacute;s de la red, por parte de gente que no tiene acceso 
        f&iacute;sico a su estaci&oacute;n de trabajo ni a sus 
        servidores.</para> 
      <indexterm><primary>KerberosIV</primary></indexterm>

      <para>Usar Kerberos le ofrece tambi&eacute;n el poder 
        de deshabilitar o cambiar la contrase&ntilde;a para una cuenta 
        administrativa en un lugar, y que tenga un efecto inmediato en todas 
        las m&aacute;quinas en las cuales ese administrador pueda 
        tener una cuenta.  Si una de esas cuentas se ve comprometida 
        la posibilidad para cambiar instant&aacute;neamente su 
        contrase&ntilde;a en todas las m&aacute;quinas no debe ser 
        desestimada.  Con contrase&ntilde;as distintas, el cambio 
        de una contrase&ntilde;a en N m&aacute;quinas puede ser un 
        problema.  Tambi&eacute;n puede imponer restricciones de 
        re-contrase&ntilde;as con Kerberos: no s&oacute;lo se puede 
        hacer un ticket de Kerberos que expire despu&eacute;s de un 
        tiempo, sino que el sistema Kerberos puede requerir al usuario 
        que escoja una nueva contrase&ntilde;a despu&eacute;s de cierto 
        tiempo (digamos una vez al mes).</para>
    </sect2>

    <sect2>
      <title>Asegurar servidores que se ejecutan como 
          <username>root</username>
          y binarios SUID/SGID</title>

      <indexterm>
        <primary><command>ntalk</command></primary>
      </indexterm>
      <indexterm>
        <primary><command>comsat</command></primary>
      </indexterm>
      <indexterm>
        <primary><command>finger</command></primary>
      </indexterm>
      <indexterm>
        <primary>cajas de arena <quote>sandboxes</quote></primary>
      </indexterm>
      <indexterm>
        <primary><application>sshd</application></primary>
      </indexterm>
      <indexterm>
        <primary><application>telnetd</application></primary>
      </indexterm>
      <indexterm>
        <primary><application>rshd</application></primary>
      </indexterm>
      <indexterm>
        <primary><application>rlogind</application></primary>
      </indexterm>

      <para>Un administrador de sistemas prudente s&oacute;lo 
        ejecutar&aacute; los servidores que necesita, ni uno m&aacute;s 
        ni uno menos.  Dese cuenta de que los servidores ajenos son 
        los m&aacute;s propensos a contener errores.  Por ejemplo, 
        ejecutando una versi&oacute;n desfasada de 
        <application>imapd</application> o 
        <application>popper</application> es como dar una entrada universal 
        de <username>root</username> al mundo entero.  
        Nunca ejecute un servidor que no haya revisado cuidadosamente.  
        Muchos servidores no necesitan ejecutarse como 
        <username>root</username>.  Por ejemplo, los d&aelig;mons 
        <application>ntalk</application>, 
        <application>comsat</application> y 
        <application>finger</application> pueden ejecutarse en una 
        <firstterm>caja de arena (sandbox)</firstterm> especial de usuario.  
        Una caja de arena no es perfecta, a menos que pase por muchos 
        problemas, pero la aproximaci&oacute;n de cebolla a la seguridad 
        prevalece a&uacute;n y todo: Si alguien es capaz de penetrar a 
        trav&eacute;s de un servidor ejecut&aacute;ndose en una caja 
        de arena, todav&iacute;a tendr&aacute; que salir de la caja de 
        arena.  Cuantas m&aacute;s capas tenga que romper el atacante 
        menor ser&aacute; la posibilidad de &eacute;xito que tenga.  
        Se han encontrado v&iacute;as de entrada a 
        <username>root</username> en virtualmente todos los servidores 
        que se haya ejecutado como <username>root</username>, 
        incluyendo servidores b&aacute;sicos del sistema.  
        Si est&aacute; tiene una m&aacute;quina a trav&eacute;s de 
        la cual la gente s&oacute;lo entra por 
        <application>sshd</application>, y nunca entra por 
        <application>telnetd</application>, 
        <application>rshd</application>, o 
        <application>rlogind</application> 
        <emphasis>apague esos servicios</emphasis>.</para>
      
      <para>&os; ejecuta por defecto 
        <application>ntalkd</application>, 
        <application>comsat</application> y 
        <application>finger</application> en una caja de arena.  
        Otro programa que puede ser candidato para ejecutarse en una 
        caja de arena es &man.named.8;.  
        <filename>/etc/defaults/rc.conf</filename> contiene las directrices 
        necesarias (con comentarios) para usar <application>named</application> 
        en una caja de arena.  Dependiendo de si 
        est&aacute; instalando un nuevo sistema o actualizando un sistema 
        ya existente, las cuentas especiales de usuario que usan 
        estas cajas de arena puede que no est&eacute;n instaladas.  
        El administrador de sistemas prudente debe investigar e 
        implementar cajas de arena para servidores siempre que sea
        posible.</para>
      <indexterm>
        <primary><application>sendmail</application></primary>
      </indexterm>

      <para>Existen numerosos servidores que no se suelen 
        ejecutar en cajas de arena: 
        <application>sendmail</application>, 
        <application>imapd</application>, <application>ftpd</application>, 
        y otros.  Existen alternativas para algunos de ellos, pero 
        instalarlas puede requerir m&aacute;s trabajo del que tal vez 
        est&eacute; dispuesto a realizar (el factor comodidad ataca de  
        nuevo).  Tal vez tenga que ejecutar estos servidores como 
        <username>root</username> y depender de otros mecanismos para 
        detectar intrusiones que puedan tener lugar a trav&eacute;s de 
        ellos.</para>

       <para>Los otros grandes agujeros potenciales de 
         <username>root</username> que encontramos en un sistema son los 
         binarios suid-root y sgid.  La mayor&iacute;a 
         de estos binarios, como <application>rlogin</application>, 
         est&aacute;n en <filename>/bin</filename>, <filename>/sbin</filename>, 
         <filename>/usr/bin</filename> o <filename>/usr/sbin</filename>.  
         Aunque no hay nada absolutamente seguro los binarios suid y sgid 
         del sistema por defecto pueden considerarse razonablemente 
         seguros.  A&uacute;n as&iacute;, de vez en cuando aparecen 
         agujeros <username>root</username> en estos binarios.  
         En 1998 se encontr&oacute; un agujero 
         <username>root</username> en 
         <literal>Xlib</literal>, que hac&iacute;a a  
         <application>xterm</application> (que suele ser suid) 
         vulnerable.  Es mejor prevenir que curar, y el administrador de 
         sistemas prudente restringir&aacute; los binarios suid, que 
         s&oacute;lo el personal de administraci&oacute;n debe ejecutar, 
         a un grupo especial al que s&oacute;lo dicho personal pueda acceder, 
         y deshacerse de cualquier binario suid 
         (<command>chmod 000</command>) que no se use.  
         Un servidor sin pantalla generalmente no necesita un binario 
         <application>xterm</application>.  Los  binarios sgid pueden ser 
         igual de peligrosos.  Si un intruso logra comprometer un binario 
         sgid-kmem, el intruso podr&iacute;a leer 
         <filename>/dev/kmem</filename> y llegar a leer el fichero 
         cifrado de contrase&ntilde;as, poniendo en compromiso potencial 
         cualquier cuenta con contrase&ntilde;a.  Por otra parte, un intruso 
         que comprometa el grupo <literal>kmem</literal> puede monitorizar 
         las pulsaciones de teclado que se envien a trav&eacute;s de ptys, 
         incluyendo las ptys a las que acceden usuarios que emplean 
         m&eacute;todos seguros.  Un intruso que comprometa el grupo 
         <groupname>tty</groupname> puede escribir en la pty de casi 
         cualquier usuario.  Si un usuario ejecuta un programa de terminal 
         o un emulador capaz de simular un teclado, el intruso podr&iacute;a 
         generar un flujo de datos que provoque que la terminal del 
         usuario muestre una orden en pantalla, orden que el usuario 
         ejecutar&aacute;.</para>
    </sect2>

    <sect2 id="secure-users">
      <title>Asegurar las cuentas de usuario</title>

      <para>Las cuentas de usuario suelen ser las m&aacute;s 
        dif&iacute;ciles de asegurar.  Aunque puede imponer restricciones 
        de acceso draconianas a su personal administrativo  y 
        <quote>estrellar</quote> sus contrase&ntilde;as, tal vez no pueda 
        hacerlo con todas las cuentas de todos sus usuarios.  Si mantiene 
        el control en un grado suficiente quiz&aacute;s lo logre y sea 
        capaz de hacer que las cuentas de sus usuarios sean seguras.  Si no, 
        tendr&aacute; que ser m&aacute;s cuidadoso (a&uacute;n) en la 
        monitorizaci&oacute;n de esas cuentas.  Usar ssh y Kerberos en 
        cuentas de usuario da m&aacute;s problemas debido al soporte 
        t&eacute;cnico y administrativo que requerir&aacute;, pero sigue 
        siendo mejor soluci&oacute;n que un fichero de 
        contrase&ntilde;as cifradas.</para>
    </sect2>

    <sect2>
      <title>Asegurar el fichero de contrase&ntilde;as</title>

      <para>La &uacute;nica manera segura es ponerle <literal>*</literal> 
        a tantas contrase&ntilde;as como sea posible y utilizar ssh o 
        Kerberos para acceder a esas cuentas.  Aunque el fichero 
        cifrado de contrase&ntilde;as (<filename>/etc/spwd.db</filename>) 
        s&oacute;lo puede ser legible para <username>root</username>, puede 
        que un intruso consiga acceso de lectura a ese fichero, incluso sin 
        haber alcanzado el acceso de escritura como root.</para>

      <para>Sus <quote>scripts</quote> de seguridad deben buscar siempre  
        cambios en el fichero de contrase&ntilde;as 
        (consulte <link linkend="security-integrity">Revisi&oacute;n de 
        integridad de ficheros</link> m&aacute;s abajo) e informar de 
        ellos.</para>
    </sect2>

    <sect2>
      <title>Asegurar el Kernel, dispositivos en bruto y el sistema 
          sistema de ficheros</title>

      <para>Si un atacante compromete <username>root</username> puede 
        hacer cualquier cosa, pero hay ciertas cosas que puede usted 
        preparar para <quote>curarse en salud</quote>.  Por ejemplo, 
        la mayor&iacute;a de los kernel modernos tienen un dispositivo 
        de los Kernels modernos tienen un integrado un 
        dispositivo de paquetes.  En &os; se llama 
        <devicename>bpf</devicename>.  Un intruso t&iacute;pico 
        tratar&aacute; de ejecutar un <quote>sniffer</quote> de paquetes 
        en una m&aacute;quina comprometida.  No deber&iacute;a darle a 
        ese intruso tal recurso, y la mayor&iacute;a de los sistemas no 
        necesitan el dispositivo 
        <devicename>bpf</devicename>.</para>

      <indexterm>
        <primary><command>sysctl</command></primary>
      </indexterm>
      <para>Pero si desactiva el dispositivo <devicename>bpf</devicename> 
        todav&iacute;a tendr&aacute; que preocuparse por 
        <filename>/dev/mem</filename> y
        <filename>/dev/kmem</filename>.  
        Desde ellos el intruso podr&iacute;a en dispositivos de disco 
        en bruto.  Tambi&eacute;n hay que tener muy en cuenta 
        una opci&oacute;n del kernel llamada cargador de m&oacute;dulos, 
        &man.kldload.8;.  Un intruso con iniciativa puede usar un 
        m&oacute;dulo KLD para instalar su propio dispositivo 
        <devicename>bpf</devicename>, u otro dispositivo 
        que le permita el <quote>sniffing</quote> en un kernel en 
        ejecuci&oacute;n.  Para prevenir estos problemas debe ejecutar el 
        kernel en un nivel de seguridad mayor, al menos en securelevel 1.  
        Puede configurar el securelevel mediante una <command>sysctl</command> 
        en la variable <varname>kern.securelevel</varname>.  
        Una vez que tiene su securelevel a 1, los accesos de 
        escritura a dispositivos en bruto se 
        denegar&aacute;n y se impondr&aacute;n las banderas especiales 
        <literal>schg</literal>.  
        Tambi&eacute;n debe cerciorarse de activar la bandera 
        <literal>schg</literal> en binarios cr&iacute;ticos para el arranque, 
        directorios y scripts (dicho de otro modo, todo aquello que se 
        ejecuta <emphasis>antes</emphasis> de que se active el 
        securelevel).  Puede ser que todo esto sea una exageraci&oacute;n, 
        sobre todo teniendo en cuenta que la actualizaci&oacute;n del sistema 
        se complica bastante a medida que se incrementa el nivel de 
        seguridad.  Puede ejecutar el sistema a un nivel de seguridad 
        superior pero no activar la bandera <literal>schg</literal> 
        en cada fichero y directorio del sistema.  Otra posibilidad es 
        montar <filename>/</filename> y <filename>/usr</filename> como 
        s&oacute;lo lectura.  Recuerde que siendo demasiado draconiano 
        en aquello que busca proteger puede dificultar mucho la 
        detecci&oacute;n de una intrusi&oacute;n.</para>
    </sect2>

    <sect2 id="security-integrity">
      <title>Revisi&oacute;n de integridad de ficheros: binarios, 
        ficheros de configuraci&oacute;n, etc.</title>

      <para>Cuando se piensa de protecc&oacute;n, s&oacute;lo se puede 
        proteger la configuraci&oacute;n central del sistema y los ficheros 
        de control hasta el momento en el que el factor comodidad salta 
        a la palestra.  Por ejemplo, si usa 
        <command>chflags</command> para activar el bit <literal>schg</literal> 
        en la mayor&iacute;a de los ficheros de <filename>/</filename> 
        y <filename>/usr</filename> probablemente sea contraproducente; 
        puede proteger los ficheros haci&eacute;ndolo, pero tambi&eacute;n 
        cierra una v&iacute;a de detecci&oacute;n.  La &uacute;ltima capa 
        de su modelo de seguridad tipo cebolla es quiz&aacute;s la 
        m&aacute;s importante: la detecci&oacute;n.  El resto de su 
        estructura de seguridad ser&aacute; in&uacute;til (o peor 
        a&uacute;n, le proporcionar&aacute; un sentimiento de seguridad 
        totalmente infundado) si no puede detectar posibles intrusiones.  
        La mitad del trabajo de la cebolla es alentar al atacante, en lugar 
        de detenerlo, para darle a la parte de la ecuaci&oacute;n de
        detecci&oacute;n una oportunidad de atraparlo con las manos en la 
        masa.</para>  

      <para>La mejor manera de detectar una intrusi&oacute;n es buscar 
        ficheros modificados, perdidos, o cuya presencia o estado sea 
        inesperado.  La mejor forma de buscar ficheros modificados es 
        desde otro sistema (que muchas veces es centralizado) con acceso 
        restringido.  
        Escribir sus <quote>scripts</quote> de seguridad en un sistema 
        <quote>extraseguro</quote> y con acceso restringido los hace casi 
        invisibles a posibles atacantes, y esto es algo muy importante.  
        potenciales, y esto es importante.  Para poderle sacar el 
        m&aacute;ximo partido debe proporcionar a esa m&aacute;quina con 
        acceso restringido un acceso preferente al contenido de las otras 
        m&aacute;quinas de su entorno; suele hacerse mediante la 
        importaci&oacute;n v&iacute;a NFS de s&oacute;lo lectura de las 
        dem&aacute;s m&aacute;quinas, o configurando pares de llaves ssh 
        para acceder a las otras m&aacute;quinas desde la que tiene el 
        acceso restringido.  Si exceptuamos el tr&aacute;fico de red, NFS 
        es el m&eacute;todo menos visible y le permite monitorizar los 
        sistemas de ficheros de cada m&aacute;quina cliente de forma 
        pr&aacute;cticamente indetectable.  Si su servidor de acceso 
        restringido est&aacute; conectado a las m&aacute;quinas clientes 
        a trav&eacute;s de un concentrador o a trav&eacute;s de varias 
        capas de encaminamiento el m&eacute;todo NFS puede ser muy inseguro, 
        por lo que ssh puede ser la mejor opci&oacute;n, incluso con 
        las huellas de auditor&iacute;a que ssh va dejando.</para>

      <para>Una vez que le da a una m&aacute;quina de acceso restringido 
        (al menos) acceso de lectura a los sistemas cliente que va 
        a monitorizar, tendr&aacute; que escribir <quote>scripts</quote> 
        para efectuar la monitorizaci&oacute;n.  Si va a usar un montaje 
        NFS puede escribir <quote>scripts</quote> utilizando simples 
        herramientas del sistema como 
        &man.find.1; y &man.md5.1;.  Es aconsejable ejecutar MD5 
        f&iacute;sicamente en los ficheros de las m&aacute;quinas cliente 
        al menos una vez al d&iacute;a, y comprobar los ficheros de control 
        (los que hay en <filename>/etc</filename> y 
        <filename>/usr/local/etc</filename>) con una frecuencia incluso 
        mayor.  Si aparecen discrepancias al compararlos con la 
        informaci&oacute;n basada en MD5 que la m&aacute;quina de acceso 
        restringido usa como base debe hacer una comprobaci&oacute;n 
        inmediata y profunda.  Un buen <quote>script</quote> tambi&eacute;n 
        debe buscar binarios que sean suid sin raz&oacute;n aparente, y 
        ficheros nuevos o borrados en particiones del sistema como 
        <filename>/</filename> y <filename>/usr</filename>.</para>

      <para>Si usa ssh en lugar de NFS ser&aacute; mucho m&aacute;s 
        complicado escribir el <quote>script</quote> de seguridad.  
        En esencia, tiene que pasar por <command>scp</command> los 
        <quote>scripts</quote> a la m&aacute;quina cliente para poder 
        ejecutarlos, haci&eacute;ndolos visibles; por seguridad, 
        tambi&eacute;n tendr&aacute; que pasar v&iacute;a 
        <command>scp</command> los binarios (por ejemplo find) que 
        utilizan dichos <quote>scripts</quote>.  El cliente 
        <application>ssh</application> de la m&aacute;quina cliente 
        puede estar ya bajo el control del intruso.  Con todo y con eso, 
        puede ser necesario usar ssh si trabaja sobre enlaces inseguros, 
        tambi&eacute;n es mucho m&aacute;s dif&iacute;cil de manejar.</para>

      <para>Un buen <quote>script</quote> de seguridad buscar&aacute; 
        tambi&eacute;n cambios en la configuraci&oacute;n de los ficheros 
        de acceso de usuarios y miembros del personal de 
        administraci&oacute;n: 
        <filename>.rhosts</filename>, <filename>.shosts</filename>,
        <filename>.ssh/authorized_keys</filename>, etc; en resumen, 
        ficheros fuera del rango de revisi&oacute;n 
        <literal>MD5</literal>.</para>
        
      <para>Si tiene que v&eacute;rselas con una cantidad enorme de 
        espacio en disco para usuarios le llevar&aacute; mucho tiempo 
        recorrer cada fichero de cada partici&oacute;n.  En su caso 
        ser&iacute;a una buena idea configurar mediante opciones de 
        montaje la deshabilitaci&oacute;n de binarios y dispositivos 
        suid en esas particiones.  Revise las opciones 
        <literal>nodev</literal> y <literal>nosuid</literal> de 
        &man.mount.8;.  Deber&iacute;a comprobarlos de todas maneras 
        al menos una vez por semana, ya que el objeto de esta capa es 
        detectar intrusiones, efectivas o no.</para>

      <para>La contabilidad de procesos (vea &man.accton.8;) es una 
        opci&oacute;n con una carga relativamente ligera para el sistema 
        operativo, y puede ayudarle como mecanismo de 
        evaluaci&oacute;n tras una intrusi&oacute;n.  Es especialmente 
        &uacute;til para rastrear c&oacute;mo consigui&oacute;n realmente 
        acceder el intruso al sistema (asumiendo que el fichero 
        est&eacute; intacto despu&eacute;s de la intrusi&oacute;n).</para>

      <para>Los <quote>scripts</quote> de seguridad deben procesar los 
        logs, y los propios logs deben generarse de la forma m&aacute;s 
        segura posible: un syslog remoto puede ser muy 
        &uacute;til.  Un intruso trata de cubrir sus huellas, los logs 
        son un recurso cr&iacute;tico cuando el administrador de sistemas 
        intenta determinar la hora y el m&eacute;todo de la intrusi&oacute;n 
        inicial.  La ejecuci&oacute;n de la consola del sistema en un 
        puerto serie y recolectar la informaci&oacute;n de forma 
        peri&oacute;dica en una m&aacute;quina segura de 
        monitorizaci&oacute;n de consolas es una forma de cumplir esta 
        tarea.</para>
    </sect2>

    <sect2>
      <title>Paranoia</title>

      <para>Un poco de paranoia nunca est&aacute; de m&aacute;s.  
        Como norma, un administrador de sistemas puede a&ntilde;adir 
        cualquier tipo de mecanismo de seguridad siempre y cuando no 
        afecte a la comodidad, y puede a&ntilde;adir mecanismos de seguridad 
        que <emphasis>s&iacute;</emphasis> afecten a la comodidad 
        si tiene una buena raz&oacute;n para hacerlo.  M&aacute;s 
        a&uacute;n, un administrador de seguridad debe mezclar 
        un poco de ambas cosas: si sigue al pie de la letra las 
        recomendaciones que se dan en este documento tambi&eacute;n 
        est&aacute; sirviendo en bandeja de plata al posible atancante 
        su metodolog&iacute;a.  Ese posible atacante tambi&eacute;n 
        tiene acceso a este documento.</para>
    </sect2>

    <sect2>
      <title>Ataques de denegaci&oacute;n de servicio</title>
      <indexterm><primary>Ataques de denegaci&oacute;n de 
         servicio (DoS)</primary></indexterm>

      <para>Esta secci&oacute;n cubre ataques de denegaci&oacute;n de 
        servicio.  Un ataque DoS suele consistir en un ataque mediante 
        paquetes.  NO hay mucho que pueda hacerse contra un ataque 
        mediante paquetes falsificados (<quote>spoofed</quote>) que busque 
        saturar su red, pero puede limitar el da&ntilde;o 
        asegur&aacute;ndose de que los ataques no tiren sus servidores.</para>

      <orderedlist>
	<listitem>
          <para>Limitaci&oacute;n de forks en el servidor.</para>
	</listitem>

	<listitem>
          <para>Limitaci&oacute;n de ataques <quote>springboard</quote> 
            (ataques de respuesta ICMP, ping broadcast, etc.)</para>
	</listitem>

	<listitem>
          <para>Cach&eacute; de rutas del kernel.</para>
	</listitem>
      </orderedlist>

      <para>Un t&iacute;pico ataque DoS contra un servidor con instancias 
        (forks) ser&iacute;a tratar de provocar que el servidor consuma 
        procesos, descriptores de fichero y memoria hasta tirar la 
        m&aacute;quina.  
        <application>inetd</application> (consulte &man.inetd.8;) 
        dispone de varias opciones para limitar este tipo de ataque.  
        Recuerde que aunque es posible evitar que una m&aacute;quina 
        caiga, generalmente no es posible evitar que un servicio sea 
        vea interrumpido a causa el ataque.  Consulte la p&aacute;gina 
        de manual de <application>inetd</application> atentamente y 
        sobre todo estudie las las opciones 
        <option>-c</option>, <option>-C</option>,
        y <option>-R</option>.  Observe que los ataques con direcciones IP 
        falsificadas sortear&aacute;n la opci&oacute;n <option>-C</option> de 
        <application>inetd</application>, as&iacute; que debe usar una 
        combinaci&oacute;n de opciones.  Algunos servidores 
        aut&oacute;nomos (<quote>standalone</quote>) cuentan con 
        par&aacute;metros de autolimitaci&oacute;n de instancias.</para> 

      <para><application>Sendmail</application> tiene la opci&oacute;n 
        <option>-OMaxDaemonChildren</option>, que tiende a funcionar 
        mucho mejor que las opciones de l&iacute;mite 
        de carga de sendmail debido al retraso que provoca la carga.  
        Debe especificar un par&aacute;metro 
        <literal>MaxDaemonChildren</literal> al inicio de 
        <application>sendmail</application> que sea lo suficientemente alto 
        como para gestionar la carga esperada, pero no tan alto que la 
        computadora no pueda absorber tal n&uacute;mero de 
        <application>sendmails</application> sin caerse de boca.  
        Tambi&eacute;n es prudente ejecutar sendmail en modo de cola 
        (<option>-ODeliveryMode=queued</option>) y ejecutar el 
        d&aelig;mon (<command>sendmail -bd</command>) 
        de manera independiente de las ejecuciones de cola 
        (<command>sendmail -q15m</command>).  Si a pesar de todo necesita 
        entregas en tiempo real puede ejecutar la cola a un intervalo 
        menor, como <option>-q1m</option>, pero aseg&uacute;rese de 
        especificar una opci&oacute;n <literal>MaxDaemonChildren</literal>
        razonable para <emphasis>ese</emphasis> sendmail y as&iacute;
        evitar fallos en cascada.</para>
        
      <para><application>Syslogd</application> puede recibir ataques directos 
        y se recomienda encarecidamente que utilice la opci&oacute;n 
        <option>-s</option> siempre que sea posible, y si no la opci&oacute;n 
        <option>-a</option>.</para>

      <para>Tambi&eacute;n debe ser extremadamente cuidadoso con servicios 
        de conexi&oacute;n inversa como el ident inverso de 
        <application>TCP Wrapper</application>, que puede recibir ataques 
        directos.  No se suele usar el ident inverso de 
        <application>TCP Wrapper</application> por esa misma 
        raz&oacute;n.</para>

      <para>Es una muy buena idea proteger los servicios internos 
        de acceso externo protegi&eacute;ndolos v&iacute;a con un cortafuegos 
        en los routers de frontera.  La idea es prevenir ataques de 
        saturaci&oacute;n desde el exterior de la LAN, y no tanto para 
        proteger servicios internos de compromisos 
        <username>root</username> basados en red.  
        Configure siempre un cortafuegos exclusivo, esto es, 
        <quote>restringir todo <emphasis>menos</emphasis> los puertos 
        A, B, C, D y M-Z</quote>.  De esta manera restringir&aacute; 
        todos sus puertos con n&uacute;meros bajos excepto ciertos 
        servicios espec&iacute;ficos como 
        <application>named</application> (si es el servidor primario de 
        una zona), <application>ntalkd</application>, 
        <application>sendmail</application>, y otros servicios accesibles
        desde Internet.  Si configura el cortafuegos de la otra 
        manera (como un cortafuegos inclusivo o permisivo), tiene grandes 
        posibilidades de que olvide <quote>cerrar</quote> un 
        par de servicios, o de que agregue un nuevo servicio interno y 
        olvide actualizar el cortafuegos.  Puede incluso abrir el rango 
        de n&uacute;meros de puerto altos en el cortafuegos para permitir 
        operaciones de tipo permisivo sin comprometer sus puertos 
        bajos.  Recuerde tambi&eacute;n que &os; le permite controlar 
        el rango de n&uacute;meros de puerto utilizados para asignaci&oacute;n 
        din&aacute;mica a trav&eacute;s de las numerosas 
        <varname>net.inet.ip.portrange</varname> de 
        <command>sysctl</command> 
        (<command>sysctl -a | fgrep portrange</command>), lo cual 
        tambi&eacute;n facilita la complejidad de la configuraci&oacute;n 
        de su cortafuegos.  Por ejemplo, puede utilizar un rango normal 
        primero/&uacute;ltimo de 4000 &oacute; 5000, y un rango de puerto 
        alto de 49152 a 65535; bloqu&eacute;e todo por debajo de 
        4000 (excepto para ciertos puertos espec&iacute;ficos 
        accesibles desde Internet, por supuesto).</para>

      <indexterm><primary>ICMP_BANDLIM</primary></indexterm>

      <para>Otro ataque DoS com&uacute;n es llamado ataque 
        <quote>springboard</quote>: atacar un servidor de forma que 
        genere respuestas que lo sobrecarguen, sobrecarguen la red local 
        o alguna otra m&aacute;quina.  Los ataques m&aacute;s 
        comunes de este tipo son los 
        <emphasis>ataques ICMP ping broadcast</emphasis>.  
        El atacante falsifica paquetes ping enviados a la direcci&oacute;n 
        broadcast de su LAN simulando que la direcci&oacute;n IP origen 
        es la de la m&aacute;quina que desean atacar.  Si sus routers 
        de frontera no est&aacute;n configurados para lidiar con pings a 
        direcciones de broadcast su LAN termina generando suficientes 
        respuestas a la direcci&oacute;n origen falsificada como para saturar 
        a la v&iacute;ctima, especialmente cuando el atacante utiliza 
        el mismo truco en varias docenas de direcciones broadcast en 
        varias docenas de redes diferentes a la vez.  Se han medido 
        ataques de broadcast de m&aacute;s de ciento veinte megabits.  
        Un segundo tipo de ataque <quote>springboard</quote> bastante 
        com&uacute;n se da contra el sistema de informe de error de ICMP.  
        Un atacante puede saturar la conexi&oacute;n entrante de red de un 
        servidor mediante la construcci&oacute;n de paquetes que generen 
        respuestas de error ICMP, provocando que el servidor sature su 
        conexi&oacute;n saliente de red con respuestas ICMP.  Este tipo 
        de ataque tambi&eacute;n puede tumbar el servidor agotando sus 
        <quote>mbufs</quote>, especialmente si el servidor no puede 
        drenar lo suficientemente r&aacute;pido las respuestas ICMP que 
        genera.  El kernel de &os; tiene una opci&oacute;n de 
        compilaci&oacute;n llamada <option>ICMP_BANDLIM</option>, 
        que limita la efectividad de este tipo de ataques.  
        La &uacute;ltima gran categor&iacute;a de ataques 
        <quote>springboard</quote> est&aacute; relacionada con 
        ciertos servicios de <application>inetd</application>, como 
        el servicio de eco udp.  El atacante simplemente imita un paquete 
        UDP con el puerdo de eco del servidor A como direcci&oacute;n de 
        origen, y el puerto eco del servidor B como direcci&oacute;n de 
        destino, estando ambos servidores en la misma LAN.  Un atacante 
        puede sobrecargar ambos servidores y la propia LAN inyectando 
        simplemente un par de paquetes.  Existen problemas similares 
        con el puerto  
        <application>chargen</application>.  Un administrador de sistemas 
        competente apagar&aacute; todos estos servicios internos de 
        verificaci&oacute;n de inetd.</para>
         
      <para>Los ataques con paquetes falsificados pueden utilizarse 
        tambi&eacute;n para sobrecargar la cach&eacute; de rutas del kernel.  
        Consulte los par&aacute;metros de <command>sysctl</command> 
        <varname>net.inet.ip.rtexpire</varname>, 
        <varname>rtminexpire</varname>, y 
        <varname>rtmaxcache</varname>.  
        Un ataque de paquetes falsificados que utiliza una direcci&oacute;n 
        IP origen aleatoria provocar&aacute; que el kernel genere una 
        ruta temporal en cach&eacute; en su tabla de rutas, visible con 
        <command>netstat -rna | fgrep W3</command>.  Estas rutas 
        suelen expiran en 1600 segundos m&aacute;s o menos.  Si el 
        kernel detecta que la tabla de rutas en cach&eacute; es ya 
        demasiado grande reducir&aacute; din&aacute;micamente 
        <varname>rtexpire</varname>, pero nunca la reducir&aacute; a un 
        valor que sea menor que <varname>rtminexpire</varname>.  
        Esto nos presenta dos problemas:</para>
	
      <orderedlist>
	<listitem>
          <para>El kernel no reacciona con suficiente rapidez cuando 
            un servidor ligeramente cargado es atacado.</para>
	</listitem>
	
	<listitem>
          <para>El <varname>rtminexpire</varname> no es lo suficientemente 
            bajo para que el kernel sobreviva a un ataque sostenido.</para>
	</listitem>
      </orderedlist>
      
      <para>Si sus servidores est&aacute;n conectados a Internet mediante 
        mediante una l&iacute;nea T3 o superior puede ser prudente corregir 
        manualmente 
        <varname>rtexpire</varname> y <varname>rtminexpire</varname> 
        por medio de &man.sysctl.8;.  Nunca ponga ambos par&aacute;metros 
        a cero (a menos que des&eacute;e estrellar la m&aacute;quina).  
        Configurar ambos par&aacute;metros a 2 segundos deber&iacute;a 
        bastar para proteger de ataques la tabla de rutas.</para>
    </sect2>

    <sect2>
      <title>Otros aspectos del acceso con Kerberos y SSH</title>
      <indexterm><primary><command>ssh</command></primary></indexterm>
      <indexterm><primary>KerberosIV</primary></indexterm>

      <para>Existen un par de detalles con respecto a 
        Kerberos y ssh que debe analizar sy pretende usarlos.  
        Kerberos V es un excelente protocolo de 
        protocolo de autentificaci&oacute;n, pero hay errores en la 
        versi&oacute;n kerberizada de <application>telnet</application> 
        y <application>rlogin</application> que las hacen 
        inapropiadas para gestionar flujos binarios.  
        Adem&eacute; Kerberos no cifra por defecto una 
        sesi&oacute;n a menos que utilice la opci&oacute;n 
        <option>-x</option>.  <application>ssh</application> cifra todo 
        por defecto.</para>


      <para>ssh funciona bastante bien en todos los casos, con la sola 
        salvedad de que por defecto reenv&iacute;a llaves de cifrado.  
        Esto significa que si usted tiene una estaci&oacute;n de trabajo 
        segura, que contiene llaves que le dan acceso al resto del sistema, 
        y hace ssh a una m&aacute;quina insegura, sus llaves se pueden 
        utilizar.   Las llaves en s&iacute; no se exponen, pero ssh 
        crea un puerto de reenv&iacute;o durante el login, y si un 
        atacante ha comprometido el <username>root</username> 
        de la m&aacute;quina insegura, puede utilizar ese puerto 
        para usar sus llaves y obtener acceso a cualquier otra 
        m&aacute;quina que sus llaves abran.</para>

      <para>Le recomendamos que, siempre que sea posible, use ssh 
        combinado con Kerberos en los login de su personal de 
        administraci&oacute;n.  
        para logins de staff.  Puede compilar 
        <application>ssh</application> con soporte de Kerberos.  
        Esto reducir&aacute; su dependencia de llaves ssh expuestas, 
        al mismo tiempo que protege las contrase&ntilde;as v&iacute;a 
        Kerberos.  Las llaves ssh deben usarse s&oacute;lamente para 
        tareas autom&aacute;ticas desde m&aacute;quinas seguras 
        (algo que Kerberos no hace por incompatibilidad).  Recomendamos 
        tambi&eacute;n que desactive el reenv&iacute;o de llaves 
        en la configuraci&oacute;n de ssh, o que use la 
        opci&oacute;n <literal>from=IP/DOMAIN</literal> que ssh incluye 
        en <filename>authorized_keys</filename>; as&iacute; la llave 
        s&oacute;lo podr&aacute; ser utilizada por entidades que se 
        validen desde m&aacute;quinas
        espec&iacute;ficas.</para>
    </sect2>
  </sect1>

  <sect1 id="crypt">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Bill</firstname>
	  <surname>Swingle</surname>
	  <contrib>Secciones reescritas y actualizadas por </contrib>
	</author>
      </authorgroup>
      <!-- 21 Mar 2000 -->
    </sect1info>

    <title>DES, MD5 y Crypt</title>
    <indexterm>
      <primary>seguridad</primary>
      <secondary>crypt</secondary>
    </indexterm>

    <indexterm><primary>crypt</primary></indexterm>
    <indexterm><primary>DES</primary></indexterm>
    <indexterm><primary>MD5</primary></indexterm>

    <para>Cada usuario de un sistema &unix; tiene una contrase&ntilde;a 
      asociada a su cuenta.  Parece obvio que estas contrase&ntilde;as 
      s&oacute;lo deben ser conocidas por el usuario y por el sistema 
      operativo.  Para que estas contrase&ntilde;as permanezcan en secreto 
      se cifran con lo que se conoce como un 
      <quote>hash de una pasada</quote>, esto es, s&oacute;lo pueden ser 
      f&aacute;cilmente cifradas pero no descifradas.  En otras palabras, 
      lo que acabamos de decir es tan obvio que ni siguiera es verdad:  
      el propio sistema operativo no sabe cu&aacute;l es 
      <emphasis>realmente</emphasis> la contrase&ntilde;a.  
      Lo &uacute;nico que conoce es la versi&oacute;n  
      <emphasis>cifrada</emphasis> de la contrasen&ntilde;a.  
      La &uacute;nica manera de obtener la 
      contrase&ntilde;a en <quote>texto plano</quote> es por medio 
      de una b&uacute;squeda de fuerza bruta en el espacio de 
      contrase&ntilde;as posibles.</para>

    <para>Por desgracia la &uacute;nica manera segura de cifrar 
      contrase&ntilde;as cuando &unix; empez&oacute; a hacerlo estaba 
      basada en DES, (<quote>Data Encryption Standard</quote>,  
      <quote>est&aacute;ndar de cifrado de datos</quote>).  
      Esto no era un gran problema para usuarios residentes en los EEUU, 
      pero el c&oacute;digo fuente de &os; no se pod&iacute;a exportar desde 
      los EEUU, as&iacute; que &os; hubo de buscar una forma de complir 
      las leyes de EEUU y al mismo tiempo mantener la compatibilidad con 
      otras variantes de &unix; que 
      que todav&iacute;a utilizaban DES.</para> 

    <para>La soluci&oacute;n fu&eacute; dividir las bibliotecas de cifrado 
      para que los usuarios de EEUU pudieran instalar las bibliotecas DES 
      pero los usuarios del resto del mundo tuvieran un m&eacute;todo 
      de cifrado que pudiera ser exportado.  As&iacute; es como &os; 
      comenz&oacute; a usar MD5 como su m&eacute;todo de cifrado por 
      defecto.  MD5 se considera m&aacute;s seguro que DES, as&iacute; 
      que se mantiene la opci&oacute;n de poder instalar DES por motivos 
      de compatibilidad.</para>

    <sect2>
      <title>C&oacute;mo reconocer su mecanismo de cifrado</title>

      <para>En versiones anteriores a &os;&nbsp;4.4 
        <filename>libcrypt.a</filename> era un enlace 
        simb&oacute;lico que apuntaba a la biblioteca que se usaba para el 
        cifrado.  En &os;&nbsp;4.4 se cambi&oacute; 
        <filename>libcrypt.a</filename> para ofrecer una biblioteca hash 
        configurable de validaci&oacute;n de contrase&ntilde;as.  
        Actualmente la biblioteca permite funciones hash DES, MD5 y 
        Blowfish.  &os; utiliza por defecto MD5 para cifrar 
        contrase&ntilde;as.</para>

      <para>Es muy sencillo identificar qu&eacute; m&eacute;todo usa &os; 
        para cifrar.  Una forma es examinando las contrase&ntilde;as 
        cifradas en <filename>/etc/master.passwd</filename>.  
        Las contrase&ntilde;as cifradas con el hash MD5 son m&aacute;s 
        largas que las cifradas con el hash DES, y tambi&eacute;n 
        comienzan por los caracteres 
        <literal>&dollar;1&dollar;</literal>.  Las contrase&ntilde;as 
        que comienzan por <literal>&dollar;2a&dollar;</literal> est&aacute;n 
        cifradas con la funci&oacute;n hash de Blowfish.  Las 
        contrase&ntilde;as DES no tienen ninguna 
        caracter&iacute;stica particular, pero son m&aacute;s cortas que 
        las contrase&ntilde;as MD5, y est&aacute;n codificadas en un 
        alfabeto de 64 caracteres que no incluye el caracter 
        <literal>&dollar;</literal>; es por esto que una cadena 
        relativamente corta que comience con un signo de 
        d&oacute;lar es muy probablemente una contrase&ntilde;a 
        DES.</para>

      <para>El formato de contrase&ntilde;a a usar en nuevas 
        contrase&ntilde;as se define en 
        <filename>/etc/login.conf</filename> mediante 
        <literal>passwd_format</literal>, pudiendo tener los valores 
        <literal>des</literal>, <literal>md5</literal> o
        <literal>blf</literal>. Consulte la p&aacute;gina de manual
        &man.login.conf.5; para m&aacute;s informaci&oacute;n.</para>

    </sect2>
  </sect1>

  <sect1 id="one-time-passwords">
    <title>Contrase&ntilde;as de un solo uso</title>
    <indexterm><primary>Contrase&ntilde;as de un solo uso</primary></indexterm>
    <indexterm>
      <primary>seguridad</primary>
      <secondary>Contrase&ntilde;as de un solo uso</secondary>
    </indexterm>

    <para>S/Key es un esquema de contrase&ntilde;a de un solo uso 
      basado en una funci&oacute;n de hash de sentido &uacute;nico. 
      &os; utiliza el 
      hash MD4 por compatibilidad, pero otros sistemas usan 
      MD5 y DES-MAC.  S/Key forma parte del sistema base de &os; 
      desde la versi&oacute;n 1.1.5 y se usa tambi&eacute;n en 
      un n&uacute;mero creciente de otros sistemas operativos.  S/Key 
      es una marca registrada de Bell Communications Research, Inc.</para>

    <para>A partir de la versi&oacute;n 5.0 de &os; S/Key fu&eacute; 
      reemplazado por su equivalente OPIE (<quote>One-time Passwords
      In Everything</quote>, <quote>Contrase&ntilde;as de un solo 
      uso para todo</quote>).  OPIE usa por defecto hash MD5.</para>

    <para>En esta secci&oacute;n se explican tres tipos de 
      contrase&ntilde;a.  La primera es la t&iacute;pica 
      contrase&ntilde;a al estilo &unix; o Kerberos;  las llamaremos 
      <quote>contrase&ntilde;as &unix;</quote>.  
      El segundo tipo es la contrase&ntilde;a de un solo uso, 
      que se genera con el programa <command>key</command> de S/Key o 
      con &man.opiekey.1; de OPIE, y que aceptan los programas 
      <command>keyinit</command>, &man.opiepasswd.1;, y el prompt de
      login; llamaremos a esta una 
      <quote>contrase&ntilde;a de un solo uso</quote>.  
      El &uacute;ltimo tipo de contrase&ntilde;a es la contrase&ntilde;a 
      secreta que le da usted a los programas 
      <command>key</command>/<command>opiekey</command> (y a veces 
      <command>keyinit</command>/<command>opiepasswd</command>), que 
      se usa para generar contrase&ntilde;as de un solo uso;  
      a estas las llamaremos <quote>contrase&ntilde;as secretas</quote>, 
      o simplemente <quote>contrase&ntilde;a</quote>.</para>

    <para>La contrase&ntilde;a secreta no tiene nada que ver con su 
      contrase&ntilde;a &unix;; pueden ser la misma, pero no es 
      recomendable.  Las contrase&ntilde;as secretas S/Key y OPIE no 
      est&aacute;n limitadas a 8 caracteres como las contrase&ntilde;as 
      &unix; antiguas<footnote><para>En &os; la contrase&ntilde;a del 
      login est&aacute;ndar puede ser de hasta 128 caracteres de
      longitud.</para></footnote>, pueden ser tan largas como se quiera.  
      Las contrase&ntilde;as con frases de seis o siete palabras muy largas
      son bastante comunes.  El funcionamiento del sistema S/Key o el 
      OPIE es en gran parte completamente independiente del sistema de 
      contrase&ntilde;as &unix;.</para>
       
    <para>Adem&aacute;s de la contrase&ntilde;a hay dos datos que son 
      importantes para S/Key y OPIE.  Uno es lo que se conoce como 
      <quote>semilla</quote> o <quote>llave</quote>, que consiste en dos 
      letras y cinco d&iacute;gitos. El otro dato importante se llama 
      la <quote>cuenta de iteraci&oacute;n</quote>, que es un n&uacute;mero 
      entre 1 y 100.  S/Key genera la contrase&ntilde;a de un solo 
      uso concatenando la semilla y la contrase&ntilde;a secreta, 
       aplica el hash MD4/MD5 tantas veces como especifique la cuenta de 
      iteraci&oacute;n y convierte el resultado en seis palabras 
      cortas en ingl&eacute;s.  Estas seis palabras en ingl&eacute;s 
      son su contrase&ntilde;a de un solo uso.  El sistema de 
      autentificaci&oacute;n (principalmente PAM) mantiene un registro del 
      uso de contrase&ntilde;as de un solo uso, y el usuario 
      puede validarse si el hash de la contrase&ntilde;a que proporciona 
      es igual a la contrase&ntilde;a previa.  Como se utiliza un 
      hash de sentido &uacute;nico es imposible generar futuras 
      contrase&ntilde;as de un solo uso si una contrase&ntilde;a 
      que ya ha sido usada fuera capturada; 
      la cuenta de iteraci&oacute;n se reduce despu&eacute;s de cada login 
      correcto para sincronizar al usuario con el programa login.  
      Cuanto la iteraci&oacute;n llega a 1, S/Key y OPIE deben 
      reinicializar.</para>

    <para>Hay tres programas involucrados en cada uno de estos 
      sistemas.  Los programas <command>key</command> y 
      <command>opiekey</command> aceptan una cuenta iterativa, 
      una semilla y una contrase&ntilde;a secreta, y generan 
      una contrase&ntilde;a de un solo uso o una lista consecutiva 
      de contrase&ntilde;as de un solo uso.  Los programas 
      <command>keyinit</command> y <command>opiepasswd</command> 
      se usan respectivamente para inicializar S/Key y OPIE, 
      y para cambiar contrase&ntilde;as, cuentas iterativas o 
      semillas; toman ya sea una frase secreta, o una cuenta 
      iterativa y una contrase&ntilde;a de un solo uso.  Los 
      programas <command>keyinfo</command> y <command>opieinfo</command> 
      examinan los ficheros de credenciales correspondientes 
      (<filename>/etc/skeykeys</filename> o 
      <filename>/etc/opiekeys</filename>) e imprimen la cuenta 
      iterativa y semilla del usuario invocante.</para>

    <para>Explicaremos cuatro tipos de operaciones diferentes.  
      La primera es usar <command>keyinit</command> o 
      <command>opiepasswd</command> a trav&eacute;s de una conexi&oacute;n 
      segura para configurar contrase&ntilde;as de un solo uso por 
      primera vez, o para cambiar su contrase&ntilde;a o semilla.  
      La segunda operaci&oacute;n es utilizar <command>keyinit</command>
      o <command>opiepasswd</command> a trav&eacute;s de una conexi&oacute;n 
      insegura, adem&aacute;s de usar <command>key</command> u 
      <command>opiekey</command> sobre una conexi&oacute;n segura para 
      hacer lo mismo.  La tercera es usar 
      <command>key</command>/<command>opiekey</command> para conectarse a 
      trav&eacute;s de una conexi&oacute;n insegura.  La cuarta es usar 
      <command>opiekey</command> o <command>key</command> para generar 
      numerosas llaves, que pueden ser escritas para llevarlas con usted 
      al ir a alg&uacute;n lugar desde el que no se puedan hacer conexiones 
      seguras a ning&uacute;n sitio.</para>

    <sect2>
      <title>Inicializaci&oacute;n de conexiones seguras</title>

      <para>Para inicializar S/Key por primera vez cambie su contrase&ntilde;a, 
        o cambie su semilla mientras est&aacute; conectado a trav&eacute;s de
        una conexi&oacute;n segura (esto es, en la consola de una 
        m&aacute;quina o v&iacute;a <application>ssh</application>); use 
        <command>keyinit</command> sin ning&uacute;n par&aacute;metro:</para>

      <screen>&prompt.user; <userinput>keyinit</userinput>
Adding unfurl:
Reminder - Only use this method if you are directly connected.
If you are using telnet or rlogin exit with no password and use keyinit -s.
Enter secret password: 
Again secret password: 

ID unfurl s/key is 99 to17757
DEFY CLUB PRO NASH LACE SOFT</screen>

      <para>En OPIE se utiliza <command>opiepasswd</command>:</para>

      <screen>&prompt.user; <userinput>opiepasswd -c</userinput>
[grimreaper] ~ $ opiepasswd -f -c
Adding unfurl:
Only use this method from the console; NEVER from remote. If you are using
telnet, xterm, or a dial-in, type ^C now or exit with no password.
Then run opiepasswd without the -c parameter.
Using MD5 to compute responses.
Enter new secret pass phrase:
Again new secret pass phrase:
ID unfurl OTP key is 499 to4268
MOS MALL GOAT ARM AVID COED
</screen>

      <para>En <prompt>Enter new secret pass phrase:</prompt> o 
        <prompt>Enter secret password:</prompt>, debe introducir 
        una contrase&ntilde;a o frase.  Recuerde que no es la 
        contrase&ntilde;a que utilizar&aacute; para entrar, se usar&aacute; 
        para generar sus llaves de un solo uso.  La l&iacute;nea 
        <quote>ID</quote> da los par&aacute;metros de su instancia 
        en particular: su nombre de login, la cuenta iterativa y 
        semilla.  En el momento del login el sistema recordar&aacute; estos 
        par&aacute;metros y los presentar&aacute; de nuevo para que 
        no tenga que recordarlos.  La &uacute;ltima l&iacute;nea proporciona 
        las contrase&eacute;as de un solo uso que 
        corresponden a esos par&aacute;metros y su contrase&ntilde;a 
        secreta; si fuera a hacer login de manera inmediata, 
        deber&iacute;a usar esta contrase&ntilde;a de una sola vez.</para>
    </sect2>

    <sect2>
      <title>Inicializaci&oacute;n de conexiones inseguras</title>
      
      <para>Para inicializar o cambiar su contrase&ntilde;a secreta 
        a trav&eacute;s de una conexi&oacute;n insegura, necesitar&aacute; 
        tener alguna conexi&oacute;n segura a alg&uacute;n lugar 
        donde pueda ejecutar <command>key</command> u 
        <command>opiekey</command>; puede ser gracias a un accesorio de 
        escritorio o en una &macintosh;, o un prompt de shell en una 
        m&aacute;quina en la que conf&iacute;e.  Necesitar&aacute; 
        tambi&eacute;n una cuenta iterativa (100 probablemente sea un 
        buen valor), y puede usar su propia semilla, o usar una generada 
        aleatoriamente.  Siguiendo con la conexi&oacute;n insegura 
        (hacia la m&aacute;quina que est&aacute; inicializando), ejecute 
        <command>keyinit -s</command>:</para>

      <screen>&prompt.user; <userinput>keyinit -s</userinput>
Updating unfurl:
Old key: to17758
Reminder you need the 6 English words from the key command.
Enter sequence count from 1 to 9999: <userinput>100</userinput>
Enter new key [default to17759]: 
s/key 100 to 17759
s/key access password:
s/key access password:<userinput>CURE MIKE BANE HIM RACY GORE</userinput>
</screen>

      <para>En OPIE debe usar <command>opiepasswd</command>:</para>

      <screen>&prompt.user; <userinput>opiepasswd</userinput>

Updating unfurl:
You need the response from an OTP generator.
Old secret pass phrase:
        otp-md5 498 to4268 ext
        Response: GAME GAG WELT OUT DOWN CHAT
New secret pass phrase:
        otp-md5 499 to4269
        Response: LINE PAP MILK NELL BUOY TROY

ID mark OTP key is 499 gr4269
LINE PAP MILK NELL BUOY TROY
</screen>

      <para>Para aceptar la semilla por defecto (la que 
        el programa <command>keyinit</command> llama 
        <literal>key</literal>, <quote>llave</quote>, para terminar de 
        complicar las cosas), pulse <keycap>Enter</keycap>.  
        Antes de introducir una una contrase&ntilde;a de acceso 
        cambie a su conexi&oacute;n o accesorio de escritorio S/Key y 
        dele el mismo par&aacute;metro:</para>

      <screen>&prompt.user; <userinput>key 100 to17759</userinput>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password: <userinput>&lt;secret password&gt;</userinput>
CURE MIKE BANE HIM RACY GORE</screen>

      <para>O para OPIE:</para>

      <screen>&prompt.user; <userinput>opiekey 498 to4268</userinput>
Using the MD5 algorithm to compute response.
Reminder: Don't use opiekey from telnet or dial-in sessions.
Enter secret pass phrase:
GAME GAG WELT OUT DOWN CHAT
</screen>

      <para>Vuelva a la conexi&oacute;n insegura y copie la 
        contrase&ntilde;a de un solo uso generada al programa 
        que quiera usar.</para>
    </sect2>

    <sect2>
      <title>Generaci&oacute;n una sola contrase&ntilde;a de un solo 
        uso</title>

      <para>Una vez que ha inicializado S/Key u OPIE, cuando haga login 
        ver&aacute; un <quote>prompt</quote> parecido al siguiente:</para>

<screen>&prompt.user; <userinput>telnet ejemplo.com</userinput>
Trying 10.0.0.1...
Connected to ejemplo.com
Escape character is '^]'.

FreeBSD/i386 (ejemplo.com) (ttypa)

login: <userinput>&lt;username&gt;</userinput>
s/key 97 fw13894
Password: </screen>

      <para>O, en el caso de OPIE:</para>

<screen>&prompt.user; <userinput>telnet ejemplo.com</userinput>
Trying 10.0.0.1...
Connected to ejemplo.com
Escape character is '^]'.

FreeBSD/i386 (ejemplo.com) (ttypa)

login: <userinput>&lt;nombre_de_usuario&gt;</userinput>
otp-md5 498 gr4269 ext
Password: </screen>

      <para>Como una nota aparte, el <quote>prompt</quote> de S/Key y OPIE 
        cuenta con una opci&oacute;n &uacute;til (que no se muestra 
        aqu&iacute;): si pulsa <keycap>Enter</keycap> en el 
        <quote>prompt</quote> de contrase&ntilde;a el 
        <quote>prompt</quote> activar&aacute; el eco para que pueda ver 
        en pantalla lo que teclea.  Esto puede ser extremadamente 
        &uacute;til si est&aacute; tecleando una contrase&ntilde;a a 
        a mano o desde un la lista impresa.</para>

      <indexterm><primary>MS-DOS</primary></indexterm>
      <indexterm><primary>Windows</primary></indexterm>
      <indexterm><primary>MacOS</primary></indexterm>

      <para>Ahora necesitar&aacute; generar su contrase&ntilde;a de un 
        s&oacute;lo uso para responder a este <quote>prompt</quote> de 
        login.  Debe hacerlo en un sistema digno de confianza y en el que 
        pueda ejecutar <command>key</command> u <command>opiekey</command>.  
        Existen versiones DOS, &windows; y tambi&eacute;n para &macos;.  
        Ambos usar&aacute;n la cuenta iterativa y la semilla como opciones 
        de l&iacute;nea de &oacute;rdenes. Puede cortarlas y pegarlas desde el 
        <quote>prompt</quote> de login de la m&aacute;quina en la 
        que se est&aacute; identificando.</para>

      <para>En el sistema de confianza:</para>

      <screen>&prompt.user; <userinput>key 97 fw13894</userinput>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password: 
WELD LIP ACTS ENDS ME HAAG</screen>

      <para>Con OPIE:</para>

      <screen>&prompt.user; <userinput>opiekey 498 to4268</userinput>
Using the MD5 algorithm to compute response.
Reminder: Don't use opiekey from telnet or dial-in sessions.
Enter secret pass phrase:
GAME GAG WELT OUT DOWN CHAT</screen>

      <para>Ahora que tiene su contrase&ntilde;a de un solo uso puede 
        proceder con el login:</para>

      <screen>login: <userinput>&lt;nombre_de_usuario&gt;</userinput>
s/key 97 fw13894
Password: <userinput>&lt;<keycap>Enter</keycap> para activar el eco&gt;</userinput>
s/key 97 fw13894
Password [echo on]: WELD LIP ACTS ENDS ME HAAG
Last login: Tue Mar 21 11:56:41 from 10.0.0.2 ... </screen>

    </sect2>

    <sect2>
      <title>Generaci&oacute;n de m&uacute;ltiples contrase&ntilde;as 
        de un solo uso</title>

      <para>A veces usted hay que ir a lugares donde no hay 
        acceso a una m&aacute;quina de fiar o a una conexi&oacute;n 
        segura.  En estos casos, puede utilizar 
        <command>key</command> y <command>opiekey</command> para
        generar previamente numerosas contrase&ntilde;as de un solo uso 
        para, una vez impresas, llev&aacute;rselas a donde hagan falta.  
        Por ejemplo:</para>

      <screen>&prompt.user; <userinput>key -n 5 30 zz99999</userinput>
Reminder - Do not use this program while logged in via telnet or rlogin.
Enter secret password: <userinput>&lt;secret password&gt;</userinput>
26: SODA RUDE LEA LIND BUDD SILT 
27: JILT SPY DUTY GLOW COWL ROT  
28: THEM OW COLA RUNT BONG SCOT  
29: COT MASH BARR BRIM NAN FLAG  
30: CAN KNEE CAST NAME FOLK BILK</screen>

      <para>O para OPIE:</para>

      <screen>&prompt.user; <userinput>opiekey -n 5 30 zz99999</userinput>
Using the MD5 algorithm to compute response.
Reminder: Don't use opiekey from telnet or dial-in sessions.
Enter secret pass phrase: <userinput>&lt;secret password&gt;</userinput>
26: JOAN BORE FOSS DES NAY QUIT
27: LATE BIAS SLAY FOLK MUCH TRIG
28: SALT TIN ANTI LOON NEAL USE
29: RIO ODIN GO BYE FURY TIC
30: GREW JIVE SAN GIRD BOIL PHI</screen>

      <para>El <option>-n 5</option> pide cinco llaves en secuencia, la 
        opci&oacute;n <option>30</option> especifica que ese debe ser el 
        &uacute;ltimo n&uacute;mero de iteraci&oacute;n.  Observe que se 
        imprimen en el orden <emphasis>inverso</emphasis> de uso.  
        Si es realmente paranoico escriba los resultados a mano; si no, 
        puede enviar la salida a <command>lpr</command>.  Observe que 
        cada l&iacute;nea muestra la cuenta iterativa y la 
        contrase&ntilde;a de un solo uso; puede ir tachando las 
        contrase&ntilde;as seg&uacute;n las vaya utilizando.</para>
    </sect2>

    <sect2>
      <title>Restricci&oacute;n del uso de contrase&ntilde;as &unix;</title>

      <para>S/Key puede implantar restricciones en el uso de contrase&ntilde;as 
        &unix; bas&aacute;ndose en el nombre de equipo, nombre de usuario, 
        puerto de terminal o direcci&oacute;n IP de una sesi&oacute;n de 
        login.  Consulte el fichero de configuraci&oacute;n 
        <filename>/etc/skey.access</filename>. La p&aacute;gina de manual 
        de &man.skey.access.5; contiene m&aacute;s informaci&oacute;n sobre el 
        formato del fichero y detalla tambi&eacute;n algunas precauciones 
        de seguridad que hay que tener en cuenta antes de basar nuestra 
        seguridad en este fichero.</para>

      <para>Si <filename>/etc/skey.access</filename> no existiera 
        (por defecto es as&iacute; en sistemas &os;&nbsp;4.X) todos los 
        usuarios podr&aacute;n disponer de contrase&ntilde;as &unix;.  
        Si el fichero existe se exigir&aacute; a todos los usuarios 
        el uso de S/Key, a menos que se configure de otro modo en 
        <filename>skey.access</filename>.  En todos los casos las 
        contrase&ntilde;as &unix; son admiten en consola.</para>

      <para>Aqu&iacute; hay un ejemplo del fichero de configuraci&oacute;n 
        <filename>skey.access</filename> que muestra las tres formas m&aacute;s 
        comunes de configuraci&oacute;n:</para>

      <programlisting>permit internet 192.168.0.0 255.255.0.0
permit user fnord
permit port ttyd0</programlisting>

      <para>La primera l&iacute;nea (<literal>permit internet</literal>) 
        permite a usuarios cuyas direcciones IP origen (las cuales son 
        vulnerables a una falsificaci&oacute;n) concuerden con los valores 
        y m&aacute;scara especificados utilizar contrase&ntilde;as &unix;.  
        Esto no debe usarse como mecanismo de seguridad, sino como 
        medio de recordarle a los usuarios autorizados que est&aacute;n 
        usando una red insegura y necesitan utilizar S/Key para 
        la validaci&oacute;n.</para>

      <para>La segunda l&iacute;nea (<literal>permit user</literal>) 
        permite al nombre de usuario especificado, en este caso 
        <username>fnord</username>, utilizar contrase&ntilde;as &unix; 
        en cualquier momento.  Hablando en general, esto solo debe ser
        usado por gente que no puede usar el programa <command>key</command>, 
        como aquellos con terminales tontas o refractarios al 
        aprendizaje.</para>

      <para>La tercera l&iacute;nea (<literal>permit port</literal>) 
        permite a todos los usuarios validados en la l&iacute;nea de 
        terminal especificada utilizar contrase&ntilde;as &unix;; 
        esto puede usarse para usuarios que se conectan mediante 
        <quote>dial-ups</quote>.</para>

      <para>OPIE puede restringir el uso de contrase&ntilde;as &unix; 
        bas&aacute;ndose en la direcci&oacute;n IP de una sesi&oacute;n 
        de login igual que lo har&iacute;a S/Key.  El fichero que gestiona 
        esto es <filename>/etc/opieaccess</filename>, que est&aacute; 
        inclu&iacute;do por defecto en sistemas &os;&nbsp;5.0 o posteriores.  
        Revise &man.opieaccess.5; para m&aacute;s informaci&oacute;n sobre 
        este fichero y qu&eacute; consideraciones de seguridad debe tener 
        presentes a la hora de usarlo.</para>
	
      <para>Veamos un ejemplo de <filename>opieaccess</filename>:</para>

      <programlisting>permit 192.168.0.0 255.255.0.0</programlisting>

      <para>Esta l&iacute;nea permite a usuarios cuya direcci&oacute;n 
        IP de origen (vulnerable a falsificaci&oacute;n) concuerde 
        con los valores y m&aacute;scara especificados, utilizar
        contrase&ntilde;as &unix; en cualquier momento.</para>
	
      <para>Si no concuerda ninguna regla en <filename>opieaccess</filename> 
        se niegan por defecto los logins no-OPIE.</para>

    </sect2>
  </sect1>

  <sect1 id="tcpwrappers">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Escrito por: </contrib>
	</author>
      </authorgroup>
    </sect1info>

    <indexterm><primary>TCP Wrappers</primary></indexterm>
      
    <title>TCP Wrappers</title>

    <para>Cualquiera que est&eacute; familiarizado con &man.inetd.8; 
      probablemente haya o&iacute;do hablar de 
      <acronym>TCP</acronym> Wrappers, pero poca gente parece comprender  
      completamente su utilidad en un entorno de red.  Parece que 
      todos quieren instalar un cortafuegos para manejar conexiones 
      de red.  Aunque un cortafuegos tiene una amplia variedad de 
      usos hay cosas que un cortafuegos no es capaz de gestionar, 
      como el env&iacute;o de texto como respuesta al creador de la 
      conexi&oacute;n.  El software <acronym>TCP</acronym> hace esto 
      y m&aacute;s.  En las siguientes secciones se explicar&aacute;n 
      unas cuantas opciones de 
      <acronym>TCP</acronym> Wrappers y, cuando sea necesario, se 
      mostrar&aacute;n ejemplos de configuraciones.</para>
 
    <para>El software <acronym>TCP</acronym> Wrappers extiende 
      las habilidades de <command>inetd</command> para ofrecer 
      soporte para cada servidor d&aelig;mon bajo su control.  
      Utilizando este m&eacute;todo es posible proveer soporte de 
      logs, devolver mensajes a conexiones, permitir a un d&aelig;mon 
      aceptar solamente conexiones internas, etc.  Aunque algunas de estas 
      opciones pueden conseguirse gracias a un cortafuegos, no s&oacute;lo 
      a&ntilde;adir&aacute; una capa extra de seguridad, sino que ir&aacute; 
      m&aacute;s all&aacute; del nivel de control ue un cortafuegos 
      puede ofrecerle.</para>

    <para>Las brillantes capacidades de <acronym>TCP</acronym> Wrappers 
      no deben considerarse una alternativa a un buen cortafuegos.  
      <acronym>TCP</acronym> Wrappers puede usarse conjuntamente con un 
      cortafuegos u otro sistema de de seguridad, pues ofrece una capa 
      extra de protecci&oacute;n para el sistema.</para>

    <para>Ya que es una extensi&oacute;n de la configuraci&oacute;n 
      de <command>inetd</command>, se da por hecho que el lector ha 
      le&iacute;do la secci&oacute;n 
      <link linkend="network-inetd">configuraci&oacute;n de inetd</link>.</para>

    <note>
      <para>Aunque los programas ejecutados por &man.inetd.8; no son 
        exactamente <quote>d&aelig;mons</quote> tradicionalmente han 
        recibido ese nombre.  D&aelig;mon es, por tanto, el t&eacute;rmino 
        que usaremos en esta secci&oacute;n.</para>
    </note>

    <sect2>
      <title>Configuraci&oacute;n inicial</title>

      <para>El &uacute;nico requisito para usar 
        <acronym>TCP</acronym> Wrappers en &os; es que el servidor 
        <command>inetd</command> se inicie desde 
        <filename>rc.conf</filename> con la opci&oacute;n 
        <option>-Ww</option>  (es la configuraci&oacute;n 
        por defecto).  Por descontado, se presupone que 
        <filename>/etc/hosts.allow</filename> estar&aacute; correctamente 
        configurado, pero &man.syslogd.8; enviar&aacute; mensajes 
        a los logs del sistema si no es as&iacute;.</para>

      <note>
        <para>A diferencia de otras implementaciones de <acronym>TCP</acronym> 
          Wrappers, se ha dejado de usar 
          <filename>hosts.deny</filename>.  Todas las opciones de 
          configuraci&oacute;n deben ir en 
          <filename>/etc/hosts.allow</filename>.</para>
      </note>

      <para>En la configuraci&oacute;n m&aacute;s simple las 
        pol&iacute;ticas de conexi&oacute;n de d&aelig;mons est&aacute;n 
        configuradas ya sea a permitir o bloquear, dependiendo de 
        las opciones en <filename>/etc/hosts.allow</filename>.  
        La configuraci&oacute;n por defecto en &os; consiste en 
        permitir una conexi&oacute;n a cada d&aelig;mon iniciado por 
        <command>inetd</command>.  Es posible modificar esta 
        configuraci&oacute;n, pero explicaremos c&oacute;mo hacerlo 
        despu&eacute;s de exponer la configuraci&oacute;n 
        b&aacute;sica.</para>

      <para>La configuraci&oacute;n b&aacute;sica tiene la estructura 
        <literal>d&aelig;mon : direcci&oacute;n : acci&oacute;n</literal>, 
        donde <literal>d&aelig;mon</literal> es el nombre de d&aelig;mon 
        que inicia <command>inetd</command>.  La 
        <literal>direcci&oacute;n</literal> puede ser un nombre 
        de equipo v&aacute;lido, una direcci&oacute;n IP o 
        IPv6 encerrada en corchetes ([&nbsp;]).  El campo 
        acci&oacute;n puede ser permitir o denegar para el 
        dar el acceso apropiado.  Tenga presente que la 
        configuraci&oacute;n funciona en base a la primera
        regla cuya sem&aacute;ntica concuerde; 
        esto significa que el fichero de configuraci&oacute;n se 
        lee en orden ascendente hasta que concuerde una regla.  
        Cuando se encuentra una concordancia se aplica la regla 
        y el proceso se detendr&aacute;.</para>

      <para>Existen muchas otras opciones pero estas se 
        explican en una secci&oacute;n posterior.  Una l&iacute;nea
        de configuraci&oacute;n simple puede generarse mediante datos 
        as&iacute; de simples.  Por ejemplo, para permitir conexiones 
        <acronym>POP</acronym>3 mediante el d&aelig;mon 
        <filename role="package">mail/qpopper</filename>, a&ntilde;ada 
        las siguientes l&iacute;neas a 
        <filename>hosts.allow</filename>:</para>

      <programlisting># This line is required for POP3 connections:
qpopper : ALL : allow</programlisting>

      <para>Despues de a&ntilde;adir esta l&iacute;nea tendr&aacute; que 
        reiniciar <command>inetd</command>.  Use &man.kill.1; o use el 
        par&aacute;metro <parameter>restart</parameter> de 
        <filename>/etc/rc.d/inetd</filename>.</para>
      </sect2>

      <sect2>
        <title>Configuraci&oacute;n avanzada</title>

      <para>Las opciones avanzadas de <acronym>TCP</acronym> Wrappers 
        le permiten un mayor control sobre la gesti&oacute;n de 
	conexiones.  En algunos casos puede convenir el en&iacute;o de 
	un comentario a ciertos equipos o conexiones de d&aelig;mons.  
        En otros casos, quiz&aacute;s se deba registrar una entrada en 
        un log o enviar un correo al administrador.  Otro tipo de 
        situaciones pueden requerir el uso de un servicio 
        solamente para conexiones locales.  Todo esto es posible gracias 
        al uso de unas opciones de configuraci&oacute;n conocidas 
        como <literal>comodines</literal>, caracteres de expansi&oacute;n 
        y ejecuci&oacute;n de &oacute;rdenes externas.  Las siguientes dos 
        secciones intentar&aacute;n cubrir estas situaciones.</para>
	
      <sect3>
	<title>&Oacute;rdenes externas</title>

        <para>Imaginemos una situaci&oacute;n en la que una 
          conexi&oacute;n debe ser denegada pero se debe mandar un motivo 
          a quien intent&oacute; establecer esa conexi&oacute;n.  
          &iquest;C&oacute;mo? Mediante la opci&oacute;n 
          <option>twist</option>.  Ante un intento de conexi&oacute;n se 
          invoca a <option>twist</option>, que ejecuta una orden de shell 
          o un <quote>script</quote>.  Tiene un ejemplo en el fichero 
          <filename>hosts.allow</filename>:</para>

	<programlisting># The rest of the daemons are protected.
ALL : ALL \
        : severity auth.info \
        : twist /bin/echo "No se permite utilizar %d desde %h."</programlisting>

        <para>Este ejemplo muestra que el mensaje,
          <quote>No se permite utilizar <literal>d&aelig;mon</literal> 
          desde <literal>nombre de equipo</literal>.</quote> se 
          enviar&aacute; en el caso de cualquier d&aelig;mon no configurado 
          previamente en el fichero de acceso.  
          Esto es extremadamente &uacute;til para enviar una respuesta
          al creador de la conexi&oacute;n justo despu&eacute;s de 
          que la conexi&oacute;n establecida es rechazada.  Observe que 
          cualquier mensaje que se desee enviar <emphasis>debe ir</emphasis> 
          entre comillas <literal>"</literal>; esta regla no tiene 
          excepciones.</para>

	<warning>
          <para> Es posible lanzar un ataque de denegaci&oacute;n 
            de servicio al servidor si un atacante o grupo de 
            atacantes pueden llegar a sobrecargar estos d&aelig;mons 
            con peticiones de conexi&oacute;n.</para>
	</warning>

        <para>Otra posibilidad en estos casos es usar la opci&oacute;n 
          <option>spawn</option>.  Igual que <option>twist</option>, 
          <option>spawn</option> niega impl&iacute;citamente la 
          conexi&oacute;n, y puede usarse para ejecutar &oacute;rdenes de 
          shell externos o <quote>scripts</quote>.  A diferencia de 
          <option>twist</option>, <option>spawn</option> no 
          enviar&aacute; una respuesta al origen de la conexi&oacute;n.  
          Veamos un ejemplo; observe la siguiente l&iacute;nea de
          configuraci&oacute;n:</para>

	<programlisting># No permitimos conexiones desde ejemplo.com:
ALL : .ejemplo.com \
	: spawn (/bin/echo %a desde %h intento acceder a %d &gt;&gt; \
	  /var/log/connections.log) \
	: deny</programlisting>

        <para>Esto denegar&aacute; todos los intentos de conexi&oacute;n 
          desde el dominio <hostid role="fqdn">*.ejemplo.com</hostid>; 
          simult&aacute;neamente crear&aacute; una entrada con 
          el nombre del equipo, direcci&oacute;n <acronym>IP</acronym> 
          y el d&aelig;mon al que intent&oacute; conectarse al fichero 
          <filename>/var/log/connections.log</filename>.</para>

        <para>Adem&aacute;s de la sustituci&oacute;n de caracteres ya 
          expuesta m&aacute;s arriba (por ejemplo  %a) existen unas 
          cuantas m&aacute;s.  Si quiere ver la lista completa consulte 
          la p&aacute;gina de manual &man.hosts.access.5;.</para>
      </sect3>

      <sect3>
	<title>Opciones comod&iacute;n</title>

        <para>Hasta ahora se ha usado <literal>ALL</literal> en todos 
          los ejemplos, pero hay otras opciones interesantes para 
          extender un poco m&aacute;s la funcionalidad.  Por ejemplo, 
          <literal>ALL</literal> puede usarse para concordar con cualquier 
          instancia ya sea un d&aelig;mon, dominio o 
          direcci&oacute;n <acronym>IP</acronym>.  Otro comod&iacute;n 
          es <literal>PARANOID</literal>, que puede utilizarse para 
          concordar con cualquier equipo que presente una 
          direcci&oacute;n <acronym>IP</acronym> que pueda estar 
          falsificada.  En otras palabras, <literal>paranoid</literal> 
          puede usarse para definir una acci&oacute;n a tomar 
          siempre que tenga lugar una conexi&oacute;n desde una 
          direcci&oacute;n  <acronym>IP</acronym> que difiera de su 
          nombre de equipo.  Quiz&aacute;s todo se vea m&aacute;s claro
	  con el siguiente ejemplo:</para>

	<programlisting># Bloquear peticiones posiblemente falsificadas a sendmail:
sendmail : PARANOID : deny</programlisting>

        <para>En ese ejemplo todas las peticiones de conexi&oacute;n 
          a <command>sendmail</command> que tengan una 
          direcci&oacute;n <acronym>IP</acronym> que var&iacute;e 
          de su nombre de equipo ser&aacute;n denegadas.</para>

	<caution>
          <para>Utilizando <literal>PARANOID</literal> puede bloquear el 
	    acceso a servidores si el cliente o el servidor 
            tiene una configuraci&oacute;n de 
            <acronym>DNS</acronym> incorrecta.  Recomendamos al 
            administrador la m&aacute;xima cautela en su uso.</para>
	</caution>

	<para>Consulte &man.hosts.access.5; si quiere saber m&aacute;s 
	  sobre los comodines y sus posibilidades de uso.</para>

	<para>Si quiere que cualquiera de los ejemplos citados 
	  funcione debe comentar la primera l&iacute;nea de 
          <filename>hosts.allow</filename> (tal y como se dijo 
          al principio de la secci&oacute;n.</para>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="kerberosIV">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Mark</firstname>
	  <surname>Murray</surname>
	  <contrib>Escrito por </contrib>
	</author>
      </authorgroup>
      <authorgroup>
	<author>
	  <firstname>Mark</firstname>
	  <surname>Dapoz</surname>
	  <contrib>Basado en un texto de </contrib>
	</author>
      </authorgroup>
    </sect1info>

    <title><application>KerberosIV</application></title>

    <para>Kerberos es un sistema/protocolo de red agregado que permite 
      a los usuarios identificarse a trav&eacute;s de los servicios de un 
      servidor seguro.  Los servicios como login remoto, copia remota, copias 
      de ficheros de un sistema a otro y otras tantas tareas arriesgadas 
      pasan a ser considerablemente seguras y m&aacute;s controlables.</para>

    <para>Las siguientes instrucciones pueden usarse como una gu&iacute;a 
      para configurar Kerberos tal y como se distribuye con &os;.  De todas 
      maneras, debe consultar diversas p&aacute;ginas de manual para 
      conocer todos los detalles.</para>

    <sect2>
      <title>Instalaci&oacute;n de <application>KerberosIV</application></title>

      <indexterm><primary>MIT</primary></indexterm>
      <indexterm>
	<primary>KerberosIV</primary>
	<secondary>instalaci&oacute;n</secondary>
      </indexterm>
      <para>Kerberos es un componente opcional de &os;.  La manera 
        m&aacute;s f&aacute;cil de instalar este software es 
        seleccionando la distribuci&oacute;n <literal>krb4</literal> o 
        <literal>krb5</literal> en <application>sysinstall</application> 
        durante la instalaci&oacute;n inicial de &os;.  Desde ah&iacute; 
        instalar&aacute; la implementaci&oacute;n de Kerberos 
        <quote>eBones</quote> (KerberosIV) o 
        <quote>Heimdal</quote> (Kerberos5).  
        Estas implementaciones se incluyen porque a que han sido 
        desarrolladas fuera de EEUU y Canad&aacute;, lo que las 
	convert&iacute;a en accesibles para administradores de sistemas 
	del resto del mundo durante la &eacute;poca restrictiva de control 
        control de exportaciones de c&oacute;digo 
        criptogr&aacute;fico desde EEUU.</para>

      <para>Tambi&eacute;n puede instalar la implementaci&oacute;n de 
        Kerberos del MIT desde la colecci&oacute;n de ports 
        (<filename role="package">security/krb5</filename>).</para>
    </sect2>

    <sect2>
      <title>Creaci&oacute;n de la base de datos inicial</title>
      
      <para>Esto solo debe hacerse en el servidor Kerberos.  Lo primero 
        es asegurarse de que no tiene bases de datos de Kerberos 
        anteriores.  Entre al directorio <filename>/etc/kerberosIV</filename> 
        y aseg&uacute;rese de que solo est&eacute;n los siguientes 
	ficheros:</para>
	  
      <screen>&prompt.root; <userinput>cd /etc/kerberosIV</userinput>
&prompt.root; <userinput>ls</userinput>
README		krb.conf        krb.realms</screen>
	  
      <para>Si existe cualquier otro fichero (como 
        <filename>principal.*</filename> 
        o <filename>master_key</filename>) utilice 
        <command>kdb_destroy</command> para destruir la base
        de datos antigua de Kerberos.  Si Kerberos no est&aacute; 
        funcionando simplemente borre los ficheros sobrantes.</para>
	  
      <para>Edite <filename>krb.conf</filename> 
        y <filename>krb.realms</filename> para definir su dominio 
        Kerberos.  En nuestro ejemplo el dominio ser&aacute; 
	<literal>EJEMPLO.COM</literal> y el servidor es 
        <hostid role="fqdn">grunt.ejemplo.com</hostid>.  
        Editamos o creamos <filename>krb.conf</filename>:</para>
	  
      <screen>&prompt.root; <userinput>cat krb.conf</userinput>
EJEMPLO.COM
EJEMPLO.COM grunt.ejemplo.com admin server
CS.BERKELEY.EDU okeeffe.berkeley.edu
ATHENA.MIT.EDU kerberos.mit.edu
ATHENA.MIT.EDU kerberos-1.mit.edu
ATHENA.MIT.EDU kerberos-2.mit.edu
ATHENA.MIT.EDU kerberos-3.mit.edu
LCS.MIT.EDU kerberos.lcs.mit.edu
TELECOM.MIT.EDU bitsy.mit.edu
ARC.NASA.GOV trident.arc.nasa.gov</screen>
	  
      <para>Los dem&aacute;s dominios no deben estar forzosamente en la 
        configuraci&oacute;n.  Los hemos incluido como ejemplo de 
	c&oacute;mo puede hacerse que una m&aacute;quina trabaje con 
	m&uacute;ltiples dominios.  Si quiere mantener todo simple puede 
	abstenerse de incluirlos.</para>
	  
      <para>La primera l&iacute;nea es el dominio en el que el 
        sistema funcionar&aacute;.  Las dem&aacute;s l&iacute;neas 
	contienen entradas dominio/equipo.  El primer componente de cada 
        l&iacute;nea es un dominio y el segundo es un equipo de ese 
        dominio, que act&uacute;a como 
        <quote>centro de distribuci&oacute;n de llaves</quote>.  
        Las palabras <literal>admin server</literal> que siguen al 
        nombre de equipo significan que ese equipo tambi&eacute;n 
        ofrece un servidor de base da datos administrativo.  
        Si quiere consultar una explicaci&oacute;n m&aacute;s completa de 
	estos t&eacute;rminos consulte las p&aacute;ginas de manual de 
        de Kerberos.</para>  
	  
      <para>Ahora a&ntilde;adiremos 
        <hostid role="fqdn">grunt.ejemplo.com</hostid> al dominio 
        <literal>EJEMPLO.COM</literal> y tambi&eacute;n una entrada 
        para poner todos los equipos en el dominio 
        <hostid role="domainname">.ejemplo.com</hostid> Kerberos 
        <literal>EJEMPLO.COM</literal>.  Puede actualizar su 
        <filename>krb.realms</filename> del siguiente modo:</para>
	  
      <screen>&prompt.root; <userinput>cat krb.realms</userinput>
grunt.ejemplo.com EJEMPLO.COM
.ejemplo.com EJEMPLO.COM
.berkeley.edu CS.BERKELEY.EDU
.MIT.EDU ATHENA.MIT.EDU
.mit.edu ATHENA.MIT.EDU</screen>
	  
      <para>Igual que en caso previo, no tiene por qu&eacute; incluir 
        los dem&aacute;s dominios.  Se han incluido para mostrar 
	c&oacute;mo puede usar una m&aacute;quina en m&uacute;ltiples 
	dominios.  Puede eliminarlos y simplificar la 
	configuraci&oacute;n.</para>
	  
      <para>La primera l&iacute;nea pone al sistema 
        <emphasis>espec&iacute;fico</emphasis> 
        en el dominio nombrado.  El resto de las l&iacute;neas muestran 
        c&oacute;mo asignar por defecto sistemas de un subdominio 
        a un dominio Kerberos.</para>
	  
      <para>Ya podemos crear la base de datos.  Solo se ejecuta en el 
        servidor Kerberos (o centro de distribuci&oacute;n de 
        llaves).  Ejecute <command>kdb_init</command>:</para>
	  
      <screen>&prompt.root; <userinput>kdb_init</userinput>
<prompt>Realm name [default  ATHENA.MIT.EDU ]:</prompt> <userinput>EJEMPLO.COM</userinput>
You will be prompted for the database Master Password.
It is important that you NOT FORGET this password.
		
<prompt>Enter Kerberos master key:</prompt> </screen>
	  
       <para>Ahora tendremos que guardar la llave para que los servidores en 
         la m&aacute;quina local puedan recogerla.  Utilice 
         <command>kstash</command>:</para>
	
      <screen>&prompt.root; <userinput>kstash</userinput>
	      
<prompt>Enter Kerberos master key:</prompt>

Current Kerberos master key version is 1.

Master key entered. BEWARE!</screen>
	
      <para>Esto guarda la contrase&ntilde;a cifrada 
        maestra en <filename>/etc/kerberosIV/master_key</filename>.</para>
    </sect2>
    
    <sect2>
      <title>Puesta en marcha del sistema</title>
	
      <indexterm>
	<primary>KerberosIV</primary>
	<secondary>encendido inicial</secondary>
      </indexterm>

      <para>Tendr&aacute; que a&ntilde;adir a la base de datos dos 
        entradas en concreto para <emphasis>cada</emphasis> sistema 
	que vaya a usar Kerberos: <literal>kpasswd</literal> y 
        <literal>rcmd</literal>.  Se hacen para cada sistema individualmente 
        cada sistema, y el campo <quote>instance</quote> es el nombre 
	individual del sistema.</para>
	  
      <para>Estos d&aelig;mons <application>kpasswd</application> y 
        <application>rcmd</application> permiten a otros sistemas 
        cambiar contrase&ntilde;as de Kerberos y ejecutar &oacute;rdenes
        como &man.rcp.1;, &man.rlogin.1; y &man.rsh.1;.</para>
	  
      <para>Ahora vamos a a&ntilde;adir estas entradas:</para>
	    
      <screen>&prompt.root; <userinput>kdb_edit</userinput>
Opening database...

<prompt>Enter Kerberos master key:</prompt>

Current Kerberos master key version is 1.

Master key entered.  BEWARE!
Previous or default values are in [brackets] ,
enter return to leave the same, or new value.

<prompt>Principal name:</prompt> <userinput>passwd</userinput>
<prompt>Instance:</prompt> <userinput>grunt</userinput>

&lt;Not found&gt;, <prompt>Create [y] ?</prompt> <userinput>y</userinput>

Principal: passwd, Instance: grunt, kdc_key_ver: 1
<prompt>New Password:</prompt>                    &lt;---- tecleo aleatorio
Verifying password

<prompt>New Password:</prompt> &lt;---- tecleo aleatorio

<prompt>Random password [y] ?</prompt> <userinput>y</userinput>

Principal's new key version = 1
<prompt>Expiration date (enter yyyy-mm-dd) [ 2000-01-01 ] ?</prompt>
<prompt>Max ticket lifetime (*5 minutes) [ 255 ] ?</prompt>
<prompt>Attributes [ 0 ] ?</prompt>
Edit O.K.
<prompt>Principal name:</prompt> <userinput>rcmd</userinput>
<prompt>Instance:</prompt> <userinput>grunt</userinput>

&lt;Not found&gt;, <prompt>Create [y] ?</prompt>

Principal: rcmd, Instance: grunt, kdc_key_ver: 1
<prompt>New Password:</prompt>		&lt;---- tecleo aleatorio
Verifying password

<prompt>New Password:</prompt>           &lt;---- tecleo aleatorio

<prompt>Random password [y] ?</prompt>

Principal's new key version = 1
<prompt>Expiration date (enter yyyy-mm-dd) [ 2000-01-01 ] ?</prompt>
<prompt>Max ticket lifetime (*5 minutes) [ 255 ] ?</prompt>
<prompt>Attributes [ 0 ] ?</prompt>
Edit O.K.
<prompt>Principal name:</prompt>         &lt;---- si introduce datos nulos saldr&aacute; del programa</screen>
    </sect2>

    <sect2>
      <title>Creaci&oacute;n del fichero del servidor</title>
      
      <para>Ahora tendremos que extraer todas las instancias que definen 
        los servicios en cada m&aacute;quina; para ello usaremos 
        <command>ext_srvtab</command>.  Esto crear&aacute; un 
        fichero que debe ser copiado o movido <emphasis>por medios 
        seguros</emphasis> al directorio 
	<filename>/etc/kerberosIV</filename> de cada 
	cliente Kerberos.  Este fichero debe existir en todos los 
	servidores y clientes dada su importancia clave para el 
	funcionamiento de Kerberos.</para>
	  
	  
      <screen>&prompt.root; <userinput>ext_srvtab grunt</userinput>
<prompt>Enter Kerberos master key:</prompt>
		
Current Kerberos master key version is 1.

Master key entered. BEWARE!
Generating 'grunt-new-srvtab'....</screen>
	  
      <para>Esta orden solo genera un fichero temporal al que tendr&aacute; 
        que cambiar el nombre a <filename>srvtab</filename> para que todos
        los servidores puedan recogerlo.  Utilice 
        &man.mv.1; para moverlo al lugar correcto en el sistema
        original:</para>
	  
      <screen>&prompt.root; <userinput>mv grunt-new-srvtab srvtab</userinput></screen>
	  
      <para>Si el fichero es para un sistema cliente y la red no puede 
        considerarse segura copie el 
        <filename><replaceable>cliente</replaceable>-new-srvtab</filename> 
        en un medio extra&iacute;ble y transp&oacute;rtelo por medios 
	f&iacute;sicos seguros.  Aseg&uacute;rese de cambiar su nombre a 
        <filename>srvtab</filename> en el directorio 
        <filename>/etc/kerberosIV</filename> del cliente, y
        aseg&uacute;rese tambi&eacute;n de que tiene modo 600:</para>
	  
      <screen>&prompt.root; <userinput>mv grumble-new-srvtab srvtab</userinput>
&prompt.root; <userinput>chmod 600 srvtab</userinput></screen>
    </sect2>
    
    <sect2>
      <title>A&ntilde;adir entradas a la base de datos</title>
      
      <para>Ahora tenemos que a&ntilde;adir entradas de usuarios a la 
        base de datos.  Primero vamos a crear una entrada para el usuario
        <username>jane</username>.  Para ello usaremos 
        <command>kdb_edit</command>:</para>
	  
      <screen>&prompt.root; <userinput>kdb_edit</userinput>
Opening database...

<prompt>Enter Kerberos master key:</prompt>

Current Kerberos master key version is 1.

Master key entered.  BEWARE!
Previous or default values are in [brackets] ,
enter return to leave the same, or new value.

<prompt>Principal name:</prompt> <userinput>jane</userinput>
<prompt>Instance:</prompt>

&lt;Not found&gt;, <prompt>Create [y] ?</prompt> <userinput>y</userinput>

Principal: jane, Instance: , kdc_key_ver: 1
<prompt>New Password:</prompt>                &lt;---- introduzca una constrase&ntilde;a segura
Verifying password

<prompt>New Password:</prompt>                &lt;---- introduzca de nuevo la contrase&ntilde;a
Principal's new key version = 1
<prompt>Expiration date (enter yyyy-mm-dd) [ 2000-01-01 ] ?</prompt>
<prompt>Max ticket lifetime (*5 minutes) [ 255 ] ?</prompt>
<prompt>Attributes [ 0 ] ?</prompt>
Edit O.K.
<prompt>Principal name:</prompt>		   &lt;---- si introduce datos nulos saldr&aacute; del programa</screen>
    </sect2>

    <sect2>
      <title>Prueba del sistema</title>
      
      <para>Primero tenemos que iniciar los d&aelig;mons de Kerberos. 
        Tenga en cuenta que si su <filename>/etc/rc.conf</filename> 
	est&aacute; configurado correctamente el inicio tendr&aacute; 
	ligar cuando reinicie el sistema.  Esta prueba solo es necesaria 
	en el servidor Kerberos; los clientes Kerberos tomar&aacute;n 
	lo que necesiten autom&aacute;ticamente desde el directorio 
        <filename>/etc/kerberosIV</filename>.</para>
	  
      <screen>&prompt.root; <userinput>kerberos &amp;</userinput>
Kerberos server starting
Sleep forever on error
Log file is /var/log/kerberos.log
Current Kerberos master key version is 1.

Master key entered. BEWARE!

Current Kerberos master key version is 1
Local realm: EJEMPLO.COM
&prompt.root; <userinput>kadmind -n &amp;</userinput>
KADM Server KADM0.0A initializing
Please do not use 'kill -9' to kill this job, use a
regular kill instead

Current Kerberos master key version is 1.

Master key entered.  BEWARE!</screen>
	  
      <para>Ahora podemos probar a usar <command>kinit</command> 
        para obtener un ticket para el ID <username>jane</username>
        que creamos antes:</para>
	  
      <screen>&prompt.user; <userinput>kinit jane</userinput>
MIT Project Athena (grunt.ejemplo.com)
Kerberos Initialization for "jane"
<prompt>Password:</prompt> </screen>
	  
      <para>Pruebe a listar los tokens con <command>klist</command> para ver 
        si realmente est&aacute;n:</para>
	  
      <screen>&prompt.user; <userinput>klist</userinput>
Ticket file:    /tmp/tkt245
Principal:      jane@EJEMPLO.COM

  Issued           Expires          Principal
Apr 30 11:23:22  Apr 30 19:23:22  krbtgt.EJEMPLO.COM@EJEMPLO.COM</screen>
	  
      <para>Ahora trate de cambiar la contrase&ntilde;a usando 
        &man.passwd.1; para comprobar si el d&aelig;mon 
	<application>kpasswd</application> est&aacute; autorizado 
        a acceder a la base de datos Kerberos:</para>
	  
      <screen>&prompt.user; <userinput>passwd</userinput>
realm EJEMPLO.COM
<prompt>Old password for jane:</prompt>
<prompt>New Password for jane:</prompt>
Verifying password
<prompt>New Password for jane:</prompt>
Password changed.</screen>
    </sect2>

    <sect2>
      <title>A&ntilde;adir privilegios de <command>su</command></title>
      
      <para>Kerberos nos permite dar a <emphasis>cada</emphasis> 
        usuario que necesite privilegios de <username>root</username> 
        su <emphasis>propia</emphasis> contrase&ntilde;a para &man.su.1;.  
        Podemos agregar un ID que est&eacute; autorizado a ejecutar 
        &man.su.1; <username>root</username>.  Esto se controla 
        con una instancia de <username>root</username> 
        asociada con un usuario.  Vamos a crear una entrada 
	<literal>jane.root</literal> en la base de datos, para lo que 
	recurrimos a <command>kdb_edit</command>:</para>
	  
      <screen>&prompt.root; <userinput>kdb_edit</userinput>
Opening database...

<prompt>Enter Kerberos master key:</prompt>

Current Kerberos master key version is 1.

Master key entered.  BEWARE!
Previous or default values are in [brackets] ,
enter return to leave the same, or new value.

<prompt>Principal name:</prompt> <userinput>jane</userinput>
<prompt>Instance:</prompt> <userinput>root</userinput>

&lt;Not found&gt;, Create [y] ? y

Principal: jane, Instance: root, kdc_key_ver: 1
<prompt>New Password:</prompt>                    &lt;---- introduzca una contrase&ntilde;a SEGURA 
Verifying password

<prompt>New Password:</prompt>    	 	 &lt;---- introduzca otra vez la constrase&ntilde;a

Principal's new key version = 1
<prompt>Expiration date (enter yyyy-mm-dd) [ 2000-01-01 ] ?</prompt>
<prompt>Max ticket lifetime (*5 minutes) [ 255 ] ?</prompt> <userinput>12</userinput> &lt;--- Keep this short!
<prompt>Attributes [ 0 ] ?</prompt>
Edit O.K.
<prompt>Principal name:</prompt>		         &lt;---- si introduce datos nulos saldr&aacute; del programa</screen>
	  
      <para>Ahora trate de obtener los tokens para comprobar que 
        todo funciona:</para>
      
      <screen>&prompt.root; <userinput>kinit jane.root</userinput>
MIT Project Athena (grunt.ejemplo.com)
Kerberos Initialization for "jane.root"
<prompt>Password:</prompt></screen>
	  
      <para>Hemos de agregar al usuario al 
        <filename>.klogin</filename> de <username>root</username>:</para>
	  
      <screen>&prompt.root; <userinput>cat /root/.klogin</userinput>
jane.root@EJEMPLO.COM</screen>
	  
      <para>Ahora trate de hacer &man.su.1;:</para>
	  
      <screen>&prompt.user; <userinput>su</userinput>
<prompt>Password:</prompt></screen>
	  
      <para>y eche un vistazo a qu&eacute; tokens tenemos:</para>
	  
      <screen>&prompt.root; <userinput>klist</userinput>
Ticket file:	/tmp/tkt_root_245
Principal:      jane.root@EJEMPLO.COM

  Issued           Expires          Principal
May  2 20:43:12  May  3 04:43:12  krbtgt.EJEMPLO.COM@EJEMPLO.COM</screen>
    </sect2>

    <sect2>
      <title>Uso de otras &oacute;rdenes</title>
      
      <para>En un ejemplo anterior creamos un usuario llamado 
        <literal>jane</literal> con una instancia <literal>root</literal>.  
	Nos basamos en un usuario con el mismo nombre del 
	<quote>principal</quote> (<literal>jane</literal>), 
	el procedimiento por defecto en Kerberos:
        <literal>&lt;principal&gt;.&lt;instancia&gt;</literal> con la 
        estructura 
	<literal>&lt;nombre de usuario&gt;.</literal><username>root</username> 
        permitir&aacute; que <literal>&lt;nombre de usuario&gt;</literal>
        haga &man.su.1; a <username>root</username> si existen 
	las entradas necesarias en el 
        <filename>.klogin</filename> que hay en el directorio home de 
        <username>root</username>:</para>
          
      <screen>&prompt.root; <userinput>cat /root/.klogin</userinput>
jane.root@EJEMPLO.COM</screen>
      
      <para>De la misma manera, si un usuario tiene en su directorio home 
        lo siguiente:</para>
      
      <screen>&prompt.user; <userinput>cat ~/.klogin</userinput>
jane@EJEMPLO.COM
jack@EJEMPLO.COM</screen>
	  
      <para>significa que cualquier usuario del dominio 
        <literal>EJEMPLO.COM</literal> que se identifique como 
        <username>jane</username> o como <username>jack</username> 
        (v&iacute;a <command>kinit</command>, ver m&aacute;s arriba) 
        podr&aacute; acceder a la cuenta de <username>jane</username> o 
        a los ficheros de este sistema (<hostid>grunt</hostid>) v&iacute;a 
        &man.rlogin.1;, &man.rsh.1; o 
        &man.rcp.1;.</para>
	  
      <para>Veamos por ejemplo c&oacute;mo <username>jane</username> se 
        se identifica en otro sistema mediante Kerberos:</para>
	  
	    <screen>&prompt.user; <userinput>kinit</userinput>
MIT Project Athena (grunt.ejemplo.com)
<prompt>Password:</prompt>
&prompt.user; <userinput>rlogin grunt</userinput>
Last login: Mon May  1 21:14:47 from grumble
Copyright (c) 1980, 1983, 1986, 1988, 1990, 1991, 1993, 1994
        The Regents of the University of California.   All rights reserved.

FreeBSD BUILT-19950429 (GR386) #0: Sat Apr 29 17:50:09 SAT 1995</screen>
	  
      <para>Aqu&iacute; <username>jack</username> se identifica con la 
        cuenta de <username>jane</username> en la misma
        m&aacute;quina (<username>jane</username> tiene configurado 
        su fichero <filename>.klogin</filename> como se ha mostrado 
        antes, y la persona encargada de la administraci&oacute;n de 
        Kerberos ha configurado un usuario principal
        <emphasis>jack</emphasis> con una instancia nula):</para>
	  
      <screen>&prompt.user; <userinput>kinit</userinput>
&prompt.user; <userinput>rlogin grunt -l jane</userinput>
MIT Project Athena (grunt.ejemplo.com)
<prompt>Password:</prompt>
Last login: Mon May  1 21:16:55 from grumble
Copyright (c) 1980, 1983, 1986, 1988, 1990, 1991, 1993, 1994
        The Regents of the University of California.   All rights reserved.
FreeBSD BUILT-19950429 (GR386) #0: Sat Apr 29 17:50:09 SAT 1995</screen>
    </sect2>
  </sect1>

  <sect1 id="kerberos5">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tillman</firstname>
	  <surname>Hodgson</surname>
	  <contrib>Texto de </contrib>
	</author>
      </authorgroup>
      <authorgroup>
	<author>
	  <firstname>Mark</firstname>
	  <surname>Murray</surname>
	  <contrib>Basado en un texto de </contrib>
	</author>
      </authorgroup>
    </sect1info>

    <title><application>Kerberos5</application></title>

    <para>Cada versi&oacute;n de &os; posterior a &os;-5.1 incluye 
      soporte solamente para <application>Kerberos5</application>.  
      Por esta raz&oacute;n <application>Kerberos5</application> es 
      la &uacute;nica versi&oacute;n incluida.  Su configuraci&oacute;n 
      es similar en muchos aspectos a la de 
      <application>KerberosIV</application>.  
      La siguiente informaci&oacute;n solo ata&ntilde;e a 
      <application>Kerberos5</application> en versiones de 
      &os;-5.0 o posteriores.  Los usuarios que des&eacute;en 
      utilizar <application>KerberosIV</application> pueden 
      instalar el port 
      <filename role="package">security/krb4</filename>.</para>

    <para><application>Kerberos</application> es un sistema/protocolo 
      agregado para red que permite a los usuarios validar su identidad 
      a trav&eacute;s de los servicios de un servidor seguro.  
      Los servicios como login remoto, copia remota, copias
      de fichero de un sistema a otro y otras tareas generalmente 
      consideradas poco seguras pasan a ser considerablemente 
      seguras y m&aacute;s controlables.</para>

    <para><application>Kerberos</application> puede describirse como 
      un sistema proxy identificador/verificador.  Tambi&eacute;n 
      puede describirse como un sistema confiable de autentificaci&oacute;n 
      de terceros.  
      <application>Kerberos</application> solamente ofrece una 
      funci&oacute;n: la validaci&oacute;n segura de usuarios a 
      trav&eacute;s de una red.  No proporciona funciones de 
      autorizaci&oacute;n (es decir, lo que los usuarios tienen 
      permitido hacer) o funciones de auditor&iacute;a (lo que esos 
      usuarios hicieron).  Despu&eacute;s de que un servidor y un 
      cliente han usado <application>Kerberos</application> para 
      demostrar su identidad pueden tambi&eacute;n cifrar todas sus 
      sus comunicaciones, asegurando de este modo su intimidad y la 
      integridad de sus datos durante su uso del sistema.</para>

    <para>Es, por tanto, altamente recomendable que se use 
      <application>Kerberos</application> 
      <emphasis>adem&aacute;s</emphasis> de otros m&eacute;todos de 
      seguridad que ofrezcan servicios de autorizaci&oacute;n 
      y auditor&iacute;a.</para>

    <para>Puede usar las siguientes instrucciones como una gu&iacute;a  
      para configurar <application>Kerberos</application> tal y como se 
      distribuye en &os;.  De todas maneras, deber&iacute;a consultar 
      las p&aacute;ginas de manual adecuadas para tener toda la 
      informaci&oacute;n.</para>

    <para>Vamos a mostrar una instalaci&oacute;n 
      <application>Kerberos</application>, para lo cual usaremos 
      los siguientes espacios de nombres:</para>

    <itemizedlist>
      <listitem>
        <para>El dominio <acronym>DNS</acronym> (<quote>zona</quote>)
          ser&aacute; ejemplo.org.</para>
      </listitem>

      <listitem>
        <para>El dominio <application>Kerberos</application> (realm)
          ser&aacute; EJEMPLO.ORG.</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>Debe utilizar nombres de dominio reales al 
        configurar <application>Kerberos</application> incluso si 
        pretende ejecutarlo internamente. Esto le evitar&aacute; problemas 
        de <acronym>DNS</acronym> y asegura la interoperaci&oacute;n 
        con otros dominios <application>Kerberos</application>.</para>
    </note>

    <sect2>
      <title>Historia</title>
      <indexterm>
	<primary>Kerberos5</primary>
	<secondary>historia</secondary>
      </indexterm>

      <para><application>Kerberos</application> fu&eacute; creado 
        en el Massachusetts Institute of Technology
	(<acronym>MIT</acronym>) como una soluci&oacute;n 
        a los problemas de seguridad de la red.  
        El protocolo <application>Kerberos</application> utiliza 
        criptograf&iacute;a fuerte para que un cliente pueda 
        demostrar su identidad en un servidor (y viceversa) a 
        trav&eacute;s de una conexi&oacute;n de red insegura.</para>

      <para><application>Kerberos</application> es el nombre de un 
        protocolo de autentificaci&oacute;n v&iacute;a red y un adjetivo 
        para describir programas que implementan el programa
        (<application>Kerberos</application> telnet, por ejemplo, 
	conocido tambi&eacute;n como el 
	<quote>telnet kerberizado</quote>).  
        La versi&oacute;n actual del protocolo es la 5, descrita en 
        <acronym>RFC</acronym>&nbsp;1510.</para>

      <para>Existen diversas implementaciones libres de este protocolo, 
        cubriendo un amplio rango de sistemas operativos.  
        El <acronym>MIT</acronym>, donde <application>Kerberos</application> 
        fu&eacute; desarrollado, contin&uacute;a desarrollando su 
        propio paquete <application>Kerberos</application>.  
	Suele usarse en los EEUU como producto criptogr&aacute;fico 
        y como tal ha sufrido las regulaciones de exportaci&oacute;n 
	de los EEUU.  El 
        <application>Kerberos</application> del <acronym>MIT</acronym> 
        existe como un port en 
        (<filename role="package">security/krb5</filename>).  Heimdal 
        <application>Kerberos</application> es otra implementaci&oacute;n 
        de la versi&oacute;n 5, y fu&eacute; desarrollada de forma 
        intencionada fuera de los <acronym>EEUU</acronym> para sortear las 
        regulaciones de exportaci&oacute;n (y por eso puede incluirse 
        en versiones no comerciales de &unix;).  La distribuci&oacute;n 
        Heimdal <application>Kerberos</application> est&aacute; en el 
        port (<filename role="package">security/heimdal</filename>), y 
        se incluye una instalaci&oacute;n m&iacute;nima en el sistema 
        base de &os;.</para>

    <para>Para alcanzar la mayor audiencia estas instrucciones asumen 
      el uso de la distribuci&oacute;n Heimdal inclu&iacute;da en &os;.</para>

    </sect2>

    <sect2>
      <title>Configuraci&oacute;n de un <acronym>KDC</acronym> Heimdal</title>
      <indexterm>
	<primary>Kerberos5</primary>
	<secondary>Centro de distribuci&oacute;n de llaves</secondary>
      </indexterm>

      <para>El centro de distribuci&oacute;n de llaves (<acronym>KDC</acronym>, 
        Key Distribution Center) es el servicio centralizado de 
	validaci&oacute;n que proporciona 
        <application>Kerberos</application>: es el sistema que emite 
        tickets <application>Kerberos</application>.  
        El <acronym>KDC</acronym> goza del est&aacute;tus de ser 
	considerado como <quote>confiable</quote> por las dem&aacute;s 
        computadoras del dominio <application>Kerberos</application>, 
        y por eso tiene consideraciones de seguridad m&aacute;s 
	elevadas.</para>

    <para>Tenga en cuenta que, aunque la ejecuci&oacute;n del servidor 
      <application>Kerberos</application> requiere muy pocos recursos, 
      se recomienda el uso de una m&aacute;quina dedicada a 
      <acronym>KDC</acronym> por razones de seguridad.</para>
       
    <para>Para empezar a configurar un <acronym>KDC</acronym> aseg&uacute;rese 
      de que su <filename>/etc/rc.conf</filename> contenga la 
      configuraci&oacute;n adecuada para actuar como <acronym>KDC</acronym> 
      (tal vez deba ajustar algunas rutas para que cuadren con su 
      sistema):</para>

    <programlisting>kerberos5_server_enable="YES"
kadmind5_server_enable="YES"
kerberos_stash="YES"</programlisting>

      <note>
        <para><option>kerberos_stash</option> solo existe en 
          &os;&nbsp;4.X.</para>
      </note>

      <para>A continuaci&oacute;n configuraremos el fichero de 
        configuraci&oacute;n de <application>Kerberos</application>,
        <filename>/etc/krb5.conf</filename>:</para>

      <programlisting>[libdefaults]
    default_realm = EJEMPLO.ORG [realms]
    EXAMPLE.ORG = {
        kdc = kerberos.ejemplo.org
        admin_server = kerberos.ejemplo.org
    }
[domain_realm]
    .ejemplo.org = EJEMPLO.ORG</programlisting>

      <para>Tenga en cuenta que este <filename>/etc/krb5.conf</filename> 
        implica que su <acronym>KDC</acronym> tendr&aacute; el nombre
        de equipo completo calificado de 
	<hostid role="fqdn">kerberos.ejemplo.org</hostid>.  
        Necesitar&aacute; a&ntilde;adir una entrada CNAME (alias) a su 
        fichero de zona si su <acronym>KDC</acronym> tiene un 
        nombre de equipo diferente.</para>

      <note>
	<para>En grandes redes con un servidor <acronym>DNS</acronym> 
          <acronym>BIND</acronym> bien configurado, el ejemplo 
          de arriba puede quedar del siguiente modo:</para>

	<programlisting>[libdefaults]
      default_realm = EJEMPLO.ORG</programlisting>

        <para>Con las siguientes l&iacute;neas agregadas al 
          fichero de zona <hostid role="fqdn">ejemplo.org</hostid>:</para>

	<programlisting>_kerberos._udp      IN  SRV     01 00 88 kerberos.ejemplo.org.
_kerberos._tcp      IN  SRV     01 00 88 kerberos.ejemplo.org.
_kpasswd._udp       IN  SRV     01 00 464 kerberos.ejemplo.org.
_kerberos-adm._tcp  IN  SRV     01 00 749 kerberos.ejemplo.org.
_kerberos           IN  TXT     EJEMPLO.ORG</programlisting></note>

      <note>
        <para>Para que los clientes sean capaces de encontrar los 
          servicios <application>Kerberos</application> 
          <emphasis>debe</emphasis> tener ya sea un 
          <filename>/etc/krb5.conf</filename> configurado o 
          un <filename>/etc/krb5.conf</filename> configurado de forma 
          m&iacute;nima <emphasis>y</emphasis> un servidor DNS 
          configurado correctamente.</para>
      </note>

      <para>A continuaci&oacute;n crearemos la base de datos 
        <application>Kerberos</application>.  Esta base de datos contiene 
        las llaves de todos los principales cifradas con una 
        contrase&ntilde;a maestra.  No es necesario que recuerde 
        esta contrase&ntilde;a, pues se almacenar&aacute; en 
        <filename>/var/heimdal/m-key</filename>.  Para crear la llave 
        maestra ejecute <command>kstash</command> e introduzca una 
        contrase&ntilde;a.</para>

      <para>Una vez que se ha creado la llave maestra puede inicializar 
        la base de datos usando el programa <command>kadmin</command> 
        con la opci&oacute;n <literal>-l</literal> (que significa 
        <quote>local</quote>).  Esta opci&oacute;n le dice a 
        <command>kadmin</command> que modifique los ficheros de la base 
        de datos directamente en lugar de ir a trav&eacute;s del servicio 
        de red <command>kadmind</command>.  Esto gestiona el problema del 
        huevo y la gallina de tratar de conectar a la base de datos 
        antes de que &eacute;sta exista.  Una vez que tiene el 
	<quote>prompt</quote> de <command>kadmin</command>, utilice 
        <command>init</command> para crear su base de datos de 
        dominios iniciales.</para>

      <para>Para terminar, mientras est&aacute; todav&iacute;a en 
        <command>kadmin</command> puede crear su primer principal 
        mediante <command>add</command>.  Utilice las opciones por 
	defecto por ahora, m&aacute;s tarde puede cambiarlas mediante 
        <command>modify</command>.  Recuerde que puede usar 
        <literal>?</literal> en cualquier <quote>prompt</quote> para 
	consultar las opciones disponibles.</para>

      <para>Veamos un ejemplo de sesi&oacute;n de creaci&oacute;n de una 
        base de datos:</para>

      <screen>&prompt.root; <userinput>kstash</userinput>
Master key: <userinput>xxxxxxxx</userinput>
Verifying password - Master key: <userinput>xxxxxxxx</userinput>

&prompt.root; <userinput>kadmin -l</userinput>
kadmin> <userinput>init EJEMPLO.ORG</userinput>
Realm max ticket life [unlimited]:
kadmin> <userinput>add tillman</userinput>
Max ticket life [unlimited]:
Max renewable life [unlimited]:
Attributes []:
Password: <userinput>xxxxxxxx</userinput>
Verifying password - Password: <userinput>xxxxxxxx</userinput></screen>

      <para>Ahora puede arrancar los servicios <acronym>KDC</acronym>.  
        Ejecute <command>/etc/rc.d/kerberos start</command> y 
        <command>/etc/rc.d/kadmind start</command> para levantar dichos 
        servicios.  Recuerde que no tendr&aacute; ning&uacute;n 
        d&aelig;mon kerberizado ejecut&aacute;ndose pero debe 
	poder confirmar que <acronym>KDC</acronym> funciona por el 
        procedimiento de obtener y listar un boleto del principal 
        (usuario) que acaba de crear en la l&iacute;nea de &oacute;rdenes de 
        <acronym>KDC</acronym>:</para>

      <screen>&prompt.user; <userinput>k5init <replaceable>tillman</replaceable></userinput>
tillman@EJEMPLO.ORG's Password:

&prompt.user; <userinput>k5list</userinput>
Credentials cache: FILE:<filename>/tmp/krb5cc_500</filename>
	Principal: tillman@EJEMPLO.ORG

  Issued           Expires          Principal
Aug 27 15:37:58  Aug 28 01:37:58  krbtgt/EJEMPLO.ORG@EJEMPLO.ORG</screen>

      </sect2>

      <sect2>
	<title>Creaci&oacute;n de un servidor 
	  <application>Kerberos</application> con servicios 
          Heimdal</title>

        <indexterm>
	  <primary>Kerberos5</primary>
	  <secondary>habilitaci&oacute;n de servicios</secondary>
        </indexterm>

        <para>Antes de nada necesitaremos una copia del fichero de 
	  configuraci&oacute;n de <application>Kerberos</application>, 
          <filename>/etc/krb5.conf</filename>.  C&oacute;pielo al cliente 
          desde <acronym>KDC</acronym> de forma segura (mediante 
          &man.scp.1;, o usando un disquete).</para>

        <para>A continuaci&oacute;n necesitar&aacute; un fichero 
	  <filename>/etc/krb5.keytab</filename>.  
          Esta es la mayor diferencia entre un servidor que proporciona 
          d&aelig;mons habilitados con <application>Kerberos</application> 
          y una estaci&oacute;n de trabajo: el servidor debe 
          tener un fichero <filename>keytab</filename>.  Dicho fichero 
          contiene las llaves de equipo del servidor, las cuales 
          le permiten a &eacute;l y al <acronym>KDC</acronym> 
          verificar la identidad entre ellos.  Deben transmitirse 
          al servidor de forma segura ya que la seguridad del servidor 
          puede verse comprometida si la llave se hace p&uacute;blica.  
	  Por decirlo m&aacute;s claro, transferirla como texto plano a 
	  trav&eacute;s de la red (por ejemplo por 
          <acronym>FTP</acronym>) es una <emphasis>p&eacute;sima 
          idea</emphasis>.</para>

        <para>Lo normal es que transmita su <filename>keytab</filename> 
          al servidor mediante el programa <command>kadmin</command>.  
          Esto es pr&aacute;ctico porque tambi&eacute;n debe crear 
          el principal del equipo (el <acronym>KDC</acronym> que aparece
          al final de <filename>krb5.keytab</filename>) 
	  usando <command>kadmin</command>.</para>

        <para>Tenga en cuenta que ya debe disponer de un ticket, y que 
	  este ticket debe poder usar el interfaz 
          <command>kadmin</command> en <filename>kadmind.acl</filename>.  
           Consulte la secci&oacute;n 
          <quote>administraci&oacute;n remota</quote> en la p&aacute;gina 
          info de Heimdal (<command>info heimdal</command>), donde se 
          exponen los detalles de diseo de las listas de control de 
	  acceso.  Si no quiere habilitar acceso remoto 
          <command>kadmin</command>, puede conectarse de forma segura al 
          <acronym>KDC</acronym> (por medio de consola 
          local, &man.ssh.1; o &man.telnet.1; 
	  <application>Kerberos</application>) y administrar en local 
          mediante <command>kadmin -l</command>.</para>

        <para>Despu&eacute;s de instalar el fichero 
	  <filename>/etc/krb5.conf</filename> puede usar 
          <command>kadmin</command> desde el servidor 
          <application>Kerberos</application>.  
          <command>add --random-key</command> le permitir&aacute; 
          a&ntilde;adir el principal del equipo servidor, y 
	  <command>ext</command> le permitir&aacute; extraer el principal 
          del equipo servidor a su propio keybat.  Por ejemplo:</para>

	<screen>&prompt.root; <userinput>kadmin</userinput>
kadmin><userinput> add --random-key host/myserver.ejemplo.org</userinput>
Max ticket life [unlimited]:
Max renewable life [unlimited]:
Attributes []:
kadmin><userinput> ext host/miservidor.ejemplo.org</userinput>
kadmin><userinput> exit</userinput></screen>

        <para>Tenga en cuenta que <command>ext</command> 
          (contracci&oacute;n de <quote>extract</quote>) almacena la 
	  llave extra&iacute;da por defecto en 
          en <filename>/etc/krb5.keytab</filename>.</para>

        <para>Si no tiene <command>kadmind</command> 
	  ejecut&aacute;ndose en 
          <acronym>KDC</acronym> (posiblemente por razones de seguridad) 
          y por lo tanto carece de acceso remoto a <command>kadmin</command> 
          puede a&ntilde;adir el principal de equipo 
          (<username>host/miservidor.EJEMPLO.ORG</username>) directamente 
          en el <acronym>KDC</acronym> y entonces extraerlo a un fichero 
          temporal (para evitar sobreescribir 
	  <filename>/etc/krb5.keytab</filename> en el 
          <acronym>KDC</acronym>) mediante algo parecido a esto:</para>

	<screen>&prompt.root; <userinput>kadmin</userinput>
kadmin><userinput> ext --keytab=/tmp/ejemplo.keytab host/miservidor.ejemplo.org</userinput>
kadmin><userinput> exit</userinput></screen>

        <para>Puede entonces copiar de forma segura el keytab al 
          servidor (usando <command>scp</command> o un diquete).  
          Aseg&uacute;rese de usar un nombre de keytab diferente 
          para evitar sobreescribir el keytab en el 
          <acronym>KDC</acronym>.</para>

        <para>Su servidor puede comunicarse con el 
          <acronym>KDC</acronym> (gracias a su fichero 
          <filename>krb5.conf</filename>) y puede probar su propia 
          identidad (gracias al fichero <filename>krb5.keytab</filename>).  
          Ahora est&aacute; listo para que usted habilite algunos 
          servicios <application>Kerberos</application>.  
          En este ejemplo habilitaremos el servicio <command>telnet</command> 
          poniendo una l&iacute;nea como esta en su 
          <filename>/etc/inetd.conf</filename> y reiniciando el 
          servicio &man.inetd.8; con 
          <command>/etc/rc.d/inetd restart</command>:</para> 

	<programlisting>telnet    stream  tcp     nowait  root    /usr/libexec/telnetd  telnetd -a user</programlisting>

        <para>La parte cr&iacute;tica es <command>-a</command>, 
          de autentificaci&oacute;n de usuario.  Consulte 
          la p&aacute;gina de manual &man.telnetd.8; para 
          m&aacute;s informaci&oacute;n.</para> 

      </sect2>

      <sect2>
	<title><application>Kerberos</application> con un cliente 
	  Heimdal</title>

	<indexterm>
	  <primary>Kerberos5</primary>
	  <secondary>configurar clientes</secondary>
	</indexterm>

        <para>Configurar una computadora cliente es extremadamente 
	  f&aacute;cil.  Lo &uacute;nico que necesita es el 
          fichero de configuraci&oacute;n de 
	  <application>Kerberos</application> que encontrar&aacute; 
          en <filename>/etc/krb5.conf</filename>.  
          Simplemente c&oacute;pielo de forma segura a la computadora 
          cliente desde el <acronym>KDC</acronym>.</para>

        <para>Pruebe su computadora cliente mediante 
          <command>kinit</command>, <command>klist</command>, y 
          <command>kdestroy</command> desde el cliente para obtener, 
          mostrar y luego borrar un ticket para el principal que 
          cre&oacute; antes.  Deber&iacute;a poder usar aplicaciones 
          <application>Kerberos</application> para conectarse a 
          servidores habilitados con <application>Kerberos</application>, 
          aunque si no funciona y tiene problemas al intentar obtener 
	  el boleto lo m&aacute;s probable es que el problema 
          est&eacute; en el servidor y no en el cliente o el 
	  <acronym>KDC</acronym>.</para>

        <para>Al probar una aplicaci&oacute;n como <command>telnet</command>, 
          trate de usar un <quote>sniffer</quote> de paquetes 
	  ( como &man.tcpdump.1;) para confirmar que su contrase&ntilde;a 
          no viaja en claro por la red.  
          Trate de usar <command>telnet</command> con la opci&oacute;n 
          <literal>-x</literal>, que cifra el flujo de datos por 
          entero (algo parecido a lo que hace 
	  <command>ssh</command>).</para>

        <para>Las aplicaciones clientes <application>Kerberos</application> 
          principales (llamadas tradicionalmente <command>kinit</command>, 
          <command>klist</command>, <command>kdestroy</command> y 
          <command>kpasswd</command>) est&aacute;n incluidas en 
          la instalaci&oacute;n base de &os;.  Tenga en cuenta que 
	  en las versiones de &os; anteriores a 5.0 reciben los nombres de 
          <command>k5init</command>, 
          <command>k5list</command>, <command>k5destroy</command>, 
          <command>k5passwd</command> y <command>k5stash</command>.</para>

	<para>Tambi&eacute;n se instalan por defecto diversas aplicaciones 
          <application>Kerberos</application> que no entran dentro de 
	  la categor&iacute;a de <quote>imprescindibles</quote>.  
          Es aqu&iacute; donde la naturaleza 
          <quote>m&iacute;nima</quote> de la instalaci&oacute;n base de
          Heimdal salta a la palestra: <command>telnet</command> es el 
	  &uacute;nico servicio <application>Kerberos</application> 
	  habilitado.</para>

        <para>El port Heimdal a&ntilde;ade algunas de las aplicaciones 
          cliente que faltan: versiones <application>Kerberos</application> 
          de <command>ftp</command>, <command>rsh</command>, 
          <command>rcp</command>, <command>rlogin</command> y algunos 
          otros programas menos comunes.  El port del <acronym>MIT</acronym> 
          tambi&eacute;n contiene una suite completa de aplicaciones 
          cliente de <application>Kerberos</application>.</para>

      </sect2>

      <sect2>
	<title>Ficheros de configuraci&oacute;n de usuario: <filename>.k5login</filename> y <filename>.k5users</filename></title>

	<indexterm>
	  <primary><filename>.k5login</filename></primary>
	</indexterm>

	<indexterm>
	  <primary><filename>.k5users</filename></primary>
	</indexterm>

        <para>Suele ser habitual que los usuarios de un dominio 
          <application>Kerberos</application> (o <quote>principales</quote>) 
	  tengan su usuario 
          (por ejemplo <username>tillman@EJEMPLO.ORG</username>) mapeado 
          a una cuenta de usuario local (por ejemplo un usuario llamado 
          llamado <username>tillman</username>).  Las aplicaciones cliente 
          como <command>telnet</command> normalmente no requieren un
          nombre de usuario o un principal.</para>

	<para>Es posible que de vez en cuando quiera dar acceso a una 
          una cuenta de usuario local a alguien que no tiene un 
          principal <application>Kerberos</application>.  
          Por ejemplo, <username>tillman@EJEMPLO.ORG</username> puede 
          necesitar acceso a la cuenta de usuario local 
	  <username>webdevelopers</username>.  
          Otros principales tal vez necesiten acceso a esas 
          cuentas locales.</para>

        <para>Los ficheros <filename>.k5login</filename> y 
          <filename>.k5users</filename>, ubicados en el directorio
          home del usuario, pueden usarse de un modo similar a 
          una combinaci&oacute;n potente de 
          <filename>.hosts</filename> y <filename>.rhosts</filename>.  
          Por ejemplo, si pusiera un fichero 
          <filename>.k5login</filename> con el siguiente
          contenido</para>

	<screen>tillman@example.org
jdoe@example.org</screen>

        <para>en el directorio home del usuario local 
          <username>webdevelopers</username> ambos 
          principales listados tendr&iacute;an acceso a esa cuenta 
          sin requerir una contrase&ntilde;a compartida.</para>

	<para>Le recomendamos encarecidamente la lectura de las 
	  p&aacute;ginas de manual de estas &oacute;rdenes.  Recuerde que 
	  la p&aacute;gina de manual de 
          <command>ksu</command> abarca 
          <filename>.k5users</filename>.</para>

      </sect2>

      <sect2>
	<title><application>Kerberos</application> Sugerencias, trucos y 
	   soluci&oacute;n de problemas</title>

	<indexterm>
	  <primary>Kerberos5</primary>
	  <secondary>soluci&oacute;n de problemas</secondary>
	</indexterm>

	<itemizedlist>
	  <listitem>
            <para>Tanto si utiliza el port de Heimdal o 
	      el <application>Kerberos</application> 
              del <acronym>MIT</acronym> aseg&uacute;rese de que su 
              variable de entorno <envar>PATH</envar> liste las 
              versiones de <application>Kerberos</application> de las 
              aplicaciones cliente antes que las versiones del 
              sistema.</para>
	  </listitem>

	  <listitem>
            <para>&iquest;Todas las computadoras de su dominio Kerberos 
              tienen la hora sincronizada? Si no, la autentificaci&oacute;n
              puede fallar.
              <xref linkend="network-ntp"> describe como sincronizar
              los relojes utilizando <acronym>NTP</acronym>.</para>
	  </listitem>

	  <listitem>
            <para><acronym>MIT</acronym> y Heimdal conviven bien, con la  
              excepci&oacute;n de <command>kadmin</command>, protocolo 
              no est&aacute; estandarizado.</para>
	  </listitem>

	  <listitem>
            <para>Si cambia su nombre de equipo debe cambiar tambi&eacute;n 
              el <quote>apellido</quote> de su principal y actualizar su 
              keytab.  Esto tambi&eacute;n se aplica a entradas especiales 
              en keytab como el principal <username>www/</username> 
              que usa el <filename role="package">www/mod_auth_kerb</filename> 
              de Apache.</para>
	  </listitem>

	  <listitem>
            <para>Todos los equipos en su dominio Kerberos deben poder 
              resolverse (tanto en la forma normal normal como en la 
	      inversa) en el <acronym>DNS</acronym> (o en 
              <filename>/etc/hosts</filename> como m&iacute;nimo).  
              Los CNAME funcionar&aacute;n, pero los registros A y PTR 
              deben ser correctos y estar en su sitio.  El mensaje de error 
              que recibir&aacute; de no hacerlo as&iacute; no es muy 
	      intuitivo:  
              <errorname>Kerberos5 refuses authentication because Read req
              failed: Key table entry not found</errorname>.</para>
	  </listitem>

	  <listitem>
            <para>Algunos sistemas operativos que puede usar como clientes 
              de su <acronym>KDC</acronym> no activan 
              los permisos para <command>ksu</command> como 
              setuid <username>root</username>.  Esto har&aacute; que 
              <command>ksu</command> no funcione, lo cual es muy seguro 
              pero un tanto molesto.  Tenga en cuenta que no se debe a 
              un error de <acronym>KDC</acronym>.</para>
	  </listitem>

	  <listitem>
            <para>Si desea permitir que un principal tenga un ticket con 
	      una validez m&aacute;s larga que el valor por defecto de diez 
	      horas en <application>Kerberos</application> del
              <acronym>MIT</acronym> debe usar 
              <command>modify_principal</command> en <command>kadmin</command> 
              para cambiar <quote>maxlife</quote> tanto del principal en 
	      cuesti&oacute;n como del <username>krbtgt</username> del 
	      principal.  Hecho esto, 
              el principal puede utilizar la opci&oacute;n
              <literal>-l</literal> con <command>kinit</command> para
              solicitar un boleto con m&aacute;s tiempo de vida.</para>
	  </listitem>

	  <listitem>
            <note><para>Si ejecuta un <quote>sniffer</quote> de paquetes en su 
              <acronym>KDC</acronym> para ayudar con la resoluci&oacute;n 
              de problemas y ejecuta <command>kinit</command> desde una 
              estaci&oacute;n de trabajo puede encontrarse con que su 
              <acronym>TGT</acronym> se env&iacute;a inmediatamente 
              despu&eacute;s de ejecutar <command>kinit</command>: 
              <emphasis>incluso antes de que escriba su 
	      contrase&ntilde;a</emphasis> La explicaci&oacute;n es que el 
              servidor <application>Kerberos</application> transmite 
              tranquilamente un <acronym>TGT</acronym> (Ticket Granting
              Ticket) a cualquier petici&oacute;n no autorizada; de todas 
              maneras, cada <acronym>TGT</acronym> est&aacute; cifrado 
              en una llave derivada de la contrase&ntilde;a del usuario.  
              Por tanto, cuando un usuario teclea su contrase&ntilde;a 
              no la est&aacute; enviando al <acronym>KDC</acronym>, 
              se est&aacute; usando para descifrar el <acronym>TGT</acronym>
              que <command>kinit</command> ya obtuvo.  Si el proceso de 
              descifrado termina en un ticket v&aacute;lido con 
              una marca de tiempo v&aacute;lida, el usuario tiene 
              credenciales <application>Kerberos</application> v&aacute;lidas.  
              Estas credenciales incluyen una llave de sesi&oacute;n para 
              establecer comunicaciones seguras con el servidor 
              <application>Kerberos</application> en el futuro, as&iacute; 
              como el TGT en s&iacute;, que se cifra con la llave del propio 
              servidor <application>Kerberos</application>.  
	      Esta segunda capa de cifrado es invisible para el usuario, pero 
              es lo que permite al servidor <application>Kerberos</application>
              verificar la autenticidad de cada 
	      <acronym>TGT</acronym>.</para></note>
	  </listitem>

	  <listitem>
            <para>Si desea utilizar tickets con un tiempo largo de vida (una 
              semana, por ejemplo) y est&aacute; utilizando 
	      <application>OpenSSH</application>
              para conectarse a la m&aacute;quina donde se almacena su 
	      boleto asg&uacute;rese de que 
              <application>Kerberos</application> 
              <option>TicketCleanup</option> est&eacute; configurado a 
	      <literal>no</literal> en su <filename>sshd_config</filename>
              o de lo contrario sus tickets ser&aacute;n eliminados cuando 
              termine la sesi&oacute;n.</para>
	  </listitem>

	  <listitem>
            <para>Recuerde que los principales de equipos tambi&eacute;n 
	      pueden tener tener un tiempo de vida m&aacute;s largo.  
              Si su principal de usuario tiene un tiempo de vida de una 
	      semana pero el equipo al que se conecta tiene un 
              tiempo de vida de nueve horas, tendr&aacute; un principal de 
              equipo expirado en su cach&eacute;, y la cach&eacute; de 
              ticket no funcionar&aacute; como esperaba.</para>
	  </listitem>

	  <listitem>
            <para>Cuando est&eacute; configurando un fichero 
              <filename>krb5.dict</filename> pensando espec&iacute;ficamente 
              en prevenir el uso de contrase&ntilde;as defectuosas (la 
	      p&aacute;gina de manual de 
              de <command>kadmind</command> trata el tema brevemente), recuerde 
              que solamente se aplica a principales que tienen una 
	      pol&iacute;tica de contrase&ntilde;as asignada.  El formato 
              de los ficheros <filename>krb5.dict</filename> es simple: 
	      una cadena de texto por l&iacute;nea.  Puede serle 
              &uacute;til crear un enlace simb&oacute;lico a
              <filename>/usr/share/dict/words</filename>.</para>
	  </listitem>
        </itemizedlist>

      </sect2>

      <sect2>
	<title>Diferencias con el port del <acronym>MIT</acronym></title>

        <para>Las diferencias m&aacute;s grandes entre las instalaciones 
          <acronym>MIT</acronym> y Heimdal est&aacute;n relacionadas 
          con <command>kadmin</command>, que tiene un conjunto 
          diferente (pero equivalente) de &oacute;rdenes y utiliza un protocolo 
          diferente.  Esto tiene implicaciones muy grandes si su 
          <acronym>KDC</acronym> es <acronym>MIT</acronym>, ya que no 
          podr&aacute; utilizar el programa <command>kadmin</command> 
          de Heimdal para administrar remotamente su <acronym>KDC</acronym> 
          (o viceversa).</para>

        <para>Las aplicaciones cliente pueden tambi&eacute;n disponer de 
          diferentes opciones de l&iacute;nea de &oacute;rdenes para 
          lograr lo mismo.  Le recomendamos seguir las instrucciones de 
          la p&aacute;gina web de <application>Kerberos</application>
          del <acronym>MIT</acronym>
          (<ulink url="http://web.mit.edu/Kerberos/www/"></ulink>).  
          Sea cuidadoso con los parches: el port 
          del <acronym>MIT</acronym> se instala por defecto en 
          <filename>/usr/local/</filename>, y las 
          aplicaciones <quote>normales</quote> del sistema pueden 
          ser ejecutadas en lugar de las del <acronym>MIT</acronym>
          si su variable de entorno <envar>PATH</envar> lista antes los
          directorios del sistema.</para>

        <note><para>Si usa el port del <acronym>MIT</acronym> 
          <filename role="package">security/krb5</filename> 
          proporcionado por &os; aseg&uacute;rese de leer el fichero 
          <filename>/usr/local/share/doc/krb5/README.FreeBSD</filename> 
          instalado por el port si quiere entender por qu&eacute; los 
          login v&iacute;a <command>telnetd</command> y 
          <command>klogind</command> se comportan de un modo un tanto 
          extra&ntilde;o.  M&aacute;s importante a&uacute;n, corregir la 
          conducta de <quote>permisos incorrectos en el fichero 
          cach&eacute;</quote> requiere que el binario 
          <command>login.krb5</command> se use para la 
	  validaci&oacute;n para que pueda cambiar correctamente los 
          permisos de propiedad de credenciales reenviadas.</para></note>

      </sect2>

      <sect2>
	<title>Mitigaci&oacute;n de limitaciones encontradas en 
	  <application>Kerberos</application></title>

	<indexterm>
	  <primary>Kerberos5</primary>
	  <secondary>limitaciones y deficiencias</secondary>
	</indexterm>

	<sect3>
	 <title><application>Kerberos</application> es un enfoque 
	   <quote>todo o nada</quote></title>

          <para>Cada servicio habilitado en la red debe modificarse 
            para funcionar con <application>Kerberos</application> (o 
            debe ser asegurado contra ataques de red) o de lo 
            contrario las credenciales de usuario pueden robarse y 
            reutilizarse.  Un ejemplo de esto podr&iacute;a ser que 
            <application>Kerberos</application> habilite todos los shells 
            remotos ( v&iacute;a <command>rsh</command> y 
	    <command>telnet</command>, por ejemplo) pero que no cubra 
            el servidor de correo <acronym>POP3</acronym>, que 
	    env&iacute;a contrase&ntilde;as en texto plano.</para>

	</sect3>

	<sect3>
	  <title><application>Kerberos</application> est&aacute; pensado 
	    para estaciones de trabajo monousuario</title>

          <para>En un entorno multiusuario 
            <application>Kerberos</application> es menos seguro.  
            Esto se debe a que almacena los tickets en el 
            directorio <filename>/tmp</filename>, que puede 
            ser le&iacute;do por todos los usuarios.  Si un 
            usuario est&aacute; compartiendo una computadora con 
            varias personas (esto es, si utiliza un sistema 
	    multiusuario)  es posible que los tickets sean robados 
            (copiados) por otro usuario.</para>

          <para>Esto puede solventarse con la opci&oacute;n de l&iacute;nea 
            de &oacute;rdenes <literal>-c</literal> nombre-de-fichero o 
            (mejor a&uacute;n) la variable de entorno 
            <envar>KRB5CCNAME</envar>, pero raramente se hace.  
            Si almacena los tickets en el directorio home de los 
            usuarios y utiliza sin mucha complicaci&oacute;n los permisos 
	    de fichero puede mitigar este problema.</para>

	</sect3>

	<sect3>
	  <title>El KDC es el punto cr&iacute;tico de fallo</title>

          <para>Por motivos de dise&ntilde;o el <acronym>KDC</acronym> 
	    es tan seguro como la base de datos principal de 
            contrase&ntilde;as que contiene.  El 
            <acronym>KDC</acronym> no debe ejecutar ning&uacute;n 
            otro servicio ejecut&aacute;ndose en &eacute;l y debe ser 
	    f&iacute;sicamente seguro.  El peligro es grande debido a que 
            <application>Kerberos</application> almacena todas las 
            contrase&ntilde;as cifradas con la misma llave 
            (la llave <quote>maestra</quote>, que a su vez se guarda 
            como un fichero en el 
            <acronym>KDC</acronym>).</para> 

          <para>De todos modos una llave maestra comprometida no es 
            algo tan terrible como parece a primera vista.  La llave maestra 
	    solo se usa para cifrar la base de datos 
            <application>Kerberos</application> y como semilla para el 
            generador de n&uacute;meros aleatorios.  Mientras sea seguro 
            el acceso a su <acronym>KDC</acronym> un atancante no puede 
            hacer demasiado con la llave maestra.</para>

          <para>Adem&aacute;s, si el <acronym>KDC</acronym> no est&aacute; 
            disponible (quiz&aacute;s debido a un ataque de denegaci&oacute;n 
            de servicio o problemas de red) no se podr&aacute;n utilizar 
	    los servicios de red ya que no se puede efectuar la 
	    validaci&oacute;n, lo que hace que esta sea una buena forma de 
	    lanzar un ataque de denegaci&oacute;n de servicio.  
            Este problema puede aliviarse con m&uacute;ltiples 
	    <acronym>KDC</acronym>s (un maestro y uno o m&aacute;s esclavos) 
            y con una implementaci&oacute;n cautelosa de secundarios o 
            autentificaci&oacute;n de respaldo (para esto 
	    <acronym>PAM</acronym> es excelente).</para>

	</sect3>

	<sect3>
	  <title>Limitaciones de <application>Kerberos</application></title>

          <para><application>Kerberos</application> le permite a usuarios,
            equipos y servicios validarse entre s&iacute;, pero no 
            dispone de ning&uacute;n mecanismo para autentificar el 
	    <acronym>KDC</acronym> a los usuarios, equipos o servicios.  
            Esto significa que una versi&oacute;n 
	    (por ejemplo) <quote>troyanizada</quote> 
            <command>kinit</command> puede grabar todos los usuarios y sus 
            contrase&ntilde;as.  Puede usar 
            <filename role="package">security/tripwire</filename> o 
            alguna otra herramienta de revisi&oacute;n de integridad 
            de sistemas de ficheros para intentar evitar problemas como 
	    este.</para>

	</sect3>
      </sect2>

      <sect2>
	<title>Recursos y m&aacute;s informaci&oacute;n</title>

	<indexterm>
	  <primary>Kerberos5</primary>
	  <secondary>recursos externos</secondary>
	</indexterm>

	<itemizedlist>
	  <listitem>
	  <para><ulink
	    url="http://www.faqs.org/faqs/Kerberos-faq/general/preamble.html">
	    Las preguntas frecuentes (FAQ) de 
	    <application>Kerberos</application></ulink></para>
	</listitem>

	<listitem>
	  <para><ulink url="http://web.mit.edu/Kerberos/www/dialogue.html">Designing an 
	    Authentication System: a Dialog in Four Scenes</ulink></para> 
	</listitem>

	<listitem>
	  <para><ulink url="http://www.ietf.org/rfc/rfc1510.txt?number=1510">RFC 1510,
	    The <application>Kerberos</application> Network Authentication Service
	    (V5)</ulink></para>
	</listitem>

	<listitem>
	  <para><ulink url="http://web.mit.edu/Kerberos/www/">P&aacute;gina web de <application>Kerberos</application> 
	  del <acronym>MIT</acronym></ulink></para>
	</listitem>

	<listitem>
	<para><ulink url="http://www.pdc.kth.se/heimdal/">P&aacute;gina web de 
	  <application>Kerberos</application> Heimdal</ulink></para>
	</listitem>

	</itemizedlist>
    </sect2>
  </sect1>

  <sect1 id="openssl">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Escrito por: </contrib>
	</author>
      </authorgroup>
    </sect1info>
    <title>OpenSSL</title>
    <indexterm>
      <primary>seguridad</primary>
      <secondary>OpenSSL</secondary>
    </indexterm>

    <para>El conjunto de herramientas <application>OpenSSL</application>
      es una caracter&iacute;stica de &os; que muchos usuarios 
      pasan por alto.  <application>OpenSSL</application> ofrece una 
      capa de cifrada de transporte sobre la capa normal de 
      comunicaci&oacute;n, permitiendo la combinaci&oacute;n con 
      con muchas aplicaciones y servicios de red.</para>

    <para>Algunos usos de <application>OpenSSL</application> son  
      la validaci&oacute;n cifrada de clientes de correo, las 
      transacciones basadas en web como pagos con tarjetas de 
      cr&eacute;dito, etc.  Muchos ports, como 
      <filename role="package">www/apache13-ssl</filename> y 
      <filename role="package">mail/sylpheed-claws</filename> 
      ofrecen soporte de compilaci&oacute;n para 
      <application>OpenSSL</application>.</para>

    <note>
      <para>En la mayor&iacute;a de los casos la colecci&oacute;n 
        de ports tratar&aacute; de compilar el port 
        <filename role="package">security/openssl</filename> a menos 
        que la variable de make <makevar>WITH_OPENSSL_BASE</makevar> 
        sea puesta expl&iacute;citamente a <quote>yes</quote>.</para>
    </note>

    <para>La versi&oacute;n de <application>OpenSSL</application> 
      incluida en &os; soporta los protocolos de seguridad 
      de red Secure Sockets Layer v2/v3 (SSLv2/SSLv3) y 
      Transport Layer Security v1 (TLSv1) y puede utilizarse como 
      biblioteca criptogr&aacute;fica general.</para>

    <note>
      <para><application>OpenSSL</application> soporta el 
        algoritmo <acronym>IDEA</acronym> pero est&aacute;a deshabilitado 
        por defecto debido a patentes en vigor en los  Estados Unidos.  
        Si quiere usarlo debe revisar la licencia, y si las 
        restricciones le parecen aceptables active la variable 
        <makevar>MAKE_IDEA</makevar> en 
        <filename>make.conf</filename>.</para>
    </note>

    <para>Uno de los usos m&aacute;s comunes de 
      <application>OpenSSL</application> es ofrecer certificados para 
      usar con aplicaciones de software.  Estos certificados aseguran 
      que las credenciales de la compa&ntilde;ia o individuo son 
      v&aacute;lidos y no son fraudulentos.  Si el certificado en 
      cuesti&oacute;n no ha sido verificado por uno de las diversas 
      <quote>autoridades certificadoras</quote> 
      o <acronym>CA</acronym>, suele generarse una advertencia al respecto.  
      Una autoridad de certificados es una compa&ntilde;ia, como
      <ulink url="http://www.verisign.com">VeriSign</ulink>, que 
      firma certificados para validar credenciales de individuos
      o compa&ntilde;ias.  Este proceso tiene un costo asociado y no es 
      un requisito imprescindible para usar certificados, aunque 
      puede darle un poco de tranquilidad a los usuarios 
      m&aacute;s paran&oacute;icos.</para>
      
    <sect2>
      <title>Generaci&oacute;n de certificados</title>

      <indexterm>
	<primary>OpenSSL</primary>
	<secondary>generaci&oacute;n de certificados</secondary>
      </indexterm>

      <para>Para generar un certificado ejecute lo siguiente:</para>

      <screen>&prompt.root; <userinput>openssl req -new -nodes -out req.pem -keyout cert.pem</userinput>
Generating a 1024 bit RSA private key
................++++++
.......................................++++++
writing new private key to 'cert.pem'
-----
You are about to be asked to enter information that will be incorporated
into your certificate request.
What you are about to enter is what is called a Distinguished Name or a DN.
There are quite a few fields but you can leave some blank
For some fields there will be a default value,
If you enter '.', the field will be left blank.
-----
Country Name (2 letter code) [AU]:<userinput><replaceable>US</replaceable></userinput>
State or Province Name (full name) [Some-State]:<userinput><replaceable>PA</replaceable></userinput>
Locality Name (eg, city) []:<userinput><replaceable>Pittsburgh</replaceable></userinput>
Organization Name (eg, company) [Internet Widgits Pty Ltd]:<userinput><replaceable>Mi compa&ntilde;&iacute;a</replaceable></userinput>
Organizational Unit Name (eg, section) []:<userinput><replaceable>Administrador de sistemas</replaceable></userinput>
Common Name (eg, YOUR name) []:<userinput><replaceable>localhost.ejemplo.org</replaceable></userinput>
Email Address []:<userinput><replaceable>trhodes@FreeBSD.org</replaceable></userinput>

Please enter the following 'extra' attributes
to be sent with your certificate request
A challenge password []:<userinput><replaceable>UNA CONTRASE&Ntilde;A</replaceable></userinput>
An optional company name []:<userinput><replaceable>Otro nombre</replaceable></userinput></screen>

      <para>Tenga en cuenta que la respuesta directamente despu&eacute;s 
        de <quote>prompt</quote> <quote>Common Name</quote> muestra un 
        nombre de dominio.  Este <quote>prompt</quote> requiere que se 
	introduzca un nombre de servidor para usarlo en la 
        verificaci&oacute;n; si escribe cualquier otra cosa 
        producir&aacute; un certificado inv&aacute;lido.  
        Otras opciones, por ejemplo el tiempo 
        de expiraci&oacute;n, alternan algoritmos de cifrado, 
        etc.  Puede ver una lista completa en la p&aacute;gina 
        de manual de &man.openssl.1;.</para>

      <para>Deber&iacute;a tener dos ficheros en el directorio 
        donde ha ejecutado la orden anterior.  La petici&oacute;n 
	de certificado, 
        <filename>req.pem</filename>, es lo que debe enviar a una 
	autoridad certificadora para que valide las credenciales que 
	introdujo; firmar&aacute; la petici&oacute;n y le devolver&aacute; 
        el certificado.  El segundo fichero es 
        <filename>cert.pem</filename> y es la llave privada para 
        el certificado, que debe proteger a toda costa; si  cae en 
	malas manos podr&iacute; usarse para suplantarle a usted o a 
        sus servidores.</para>

      <para>Si no necesita la firma de una <acronym>CA</acronym> 
        puede crear y firmar usted mismo su certificado.  
        Primero, genere la llave <acronym>RSA</acronym>:</para>

      <screen>&prompt.root; <userinput>openssl dsaparam -rand -genkey -out <filename>myRSA.key</filename> 1024</userinput></screen>
	
        <para>A continuaci&oacute;n genere la llave <acronym>CA</acronym>:</para>

      <screen>&prompt.root; <userinput>openssl gendsa -des3 -out <filename>myca.key</filename> <filename>myRSA.key</filename></userinput></screen>

      <para>Utilice esta llave para crear el certificado:</para>

      <screen>&prompt.root; <userinput>openssl req -new -x509 -days 365 -key <filename>myca.key</filename> -out <filename>new.crt</filename></userinput></screen>

      <para>Deber&iacute;n aparecer dos nuevos ficheros en su directorio:
        un fichero de firma de autoridad de certificados 
        (<filename>myca.key</filename>) y el certificado en s&iacute;, 
        <filename>new.crt</filename>.  Deben ubicarse en un directorio, 
        que se recomienda que sea 
        <filename class="directory">/etc</filename>, que es legible 
        solo para <username>root</username>.  Para terminar, es recomendable 
	asignar permisos 0700 para el fichero con 
        <command>chmod</command>.</para>
    </sect2>

    <sect2>
      <title>Uso de certificados; un ejemplo</title>

      <para>&iquest;Qu&eacute; pueden hacer estos ficheros? 
        Cifrar conexiones al <acronym>MTA</acronym> 
        <application>Sendmail</application> es un buen sitio para 
	usarlos.  De este modo eliminar&aacute; el uso de validaci&oacute;n 
        mediante texto en claro para los usuarios que env&iacute;an 
        correo a trav&eacute;s del <acronym>MTA</acronym>
        local.</para>

      <note>
        <para>No es el mejor uso en el mundo, ya que algunos 
          <acronym>MUA</acronym>s enviar&aacute;n al usuario un 
	  mensaje de error si no tiene instalados localmente los 
	  certificados.  Consulte la documentaci&oacute;n 
	  para m&aacute;s datos sobre la 
          instalaci&oacute;n de certificados.</para>
      </note>

      <para>Debe a&ntilde;adir las siguientes l&iacute;neas 
        en su fichero local <filename>.mc</filename>:</para>

      <programlisting>dnl SSL Options
define(`confCACERT_PATH',`/etc/certs')dnl
define(`confCACERT',`/etc/certs/new.crt')dnl
define(`confSERVER_CERT',`/etc/certs/new.crt')dnl
define(`confSERVER_KEY',`/etc/certs/myca.key')dnl
define(`confTLS_SRV_OPTIONS', `V')dnl</programlisting>

      <para><filename class="directory">/etc/certs/</filename> 
        es el directorio destinado a almacenamiento de 
        los ficheros de certificado y llave en local.  
        El &uacute;ltimo requisito es una reconstrucci&oacute;n
        del fichero <filename>.cf</filename> local.  Solo tiene que 
        teclear <command>make</command> 
        <parameter>install</parameter> en el directorio 
        <filename class="directory">/etc/mail</filename>.  
        A continuaci&oacute;n ejecute un <command>make</command> 
        <parameter>restart</parameter>, que deber&iacute;a reiniciar el 
        d&aelig;mon <application>Sendmail</application>.</para>

      <para>Si todo fu&eacute; bien no habr&aacute; mensajes de error 
        en el fichero <filename>/var/log/maillog</filename> 
        y <application>Sendmail</application> aparecer&aacute; en
        la lista de procesos.</para>

      <para>Puede probarlo todo de una forma muy sencilla; 
        con&eacute;ctese al servidor de correo mediante 
        &man.telnet.1;:</para>

      <screen>&prompt.root; <userinput>telnet <replaceable>ejemplo.com</replaceable> 25</userinput>
Trying 192.0.34.166...
Connected to <hostid role="fqdn">ejemplo.com</hostid>.
Escape character is '^]'.
220 <hostid role="fqdn">ejemplo.com</hostid> ESMTP Sendmail 8.12.10/8.12.10; Tue, 31 Aug 2004 03:41:22 -0400 (EDT)
<userinput>ehlo <replaceable>ejemplo.com</replaceable></userinput>
250-ejemplo.com Hello ejemplo.com [192.0.34.166], pleased to meet you
250-ENHANCEDSTATUSCODES
250-PIPELINING
250-8BITMIME
250-SIZE
250-DSN
250-ETRN
250-AUTH LOGIN PLAIN
250-STARTTLS
250-DELIVERBY
250 HELP
<userinput>quit</userinput>
221 2.0.0 <hostid role="fqdn">ejemplo.com</hostid> closing connection
Connection closed by foreign host.</screen>

      <para>Si la l&iacute;nea <quote>STARTTLS</quote> aparece en la
        salida, todo est&aacute; funcionando correctamente.</para>
    </sect2>
  </sect1>

  <sect1 id="ipsec">
    <sect1info>
      <authorgroup>
        <author>
  	  <firstname>Nik</firstname>
	  <surname>Clayton</surname>
	  <affiliation>
	    <address><email>nik@FreeBSD.org</email></address>
          </affiliation>
          <contrib>Escrito por </contrib>
        </author>
      </authorgroup>
    </sect1info>

    <indexterm>
      <primary>IPsec</primary>
    </indexterm>

    <title>VPN sobre IPsec</title>
    <para>Creaci&oacute;n de una VPN entre dos redes, a trav&eacute;s de 
      Internet, mediante puertas de enlace 
      (<quote>gateways</quote>) &os;.</para>
 
    <sect2>
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Hiten M.</firstname>
            <surname>Pandya</surname>
	    <affiliation>
	      <address><email>hmp@FreeBSD.org</email></address>
	    </affiliation>
	    <contrib>Escrito por </contrib>
	  </author>
	</authorgroup>
      </sect2info>

      <title>Qu&eacute; es IPsec</title>

      <para>Esta secci&oacute;n le guiar&aacute; a trav&eacute;s del 
        proceso de configuraci&oacute;n de IPsec, y de su uso en un 
        entorno consistente en m&aacute;quinas &os; y 
        <application>&microsoft.windows; 2000/XP</application>, para 
        hacer que se comuniquen de manera segura.  Para configurar
        IPsec es necesario que est&eacute; familiarizado con los 
        conceptos de construcci&oacute;n de un kernel personalizado 
        (consulte el <xref linkend="kernelconfig">).</para>
    
      <para><emphasis>IPsec</emphasis> es un protocolo que est&aacute; 
        sobre la capa del protocolo de Internet (IP).  Le permite 
        a dos o m&aacute;s equipos comunicarse de forma segura (de ah&iacute; 
        el nombre).  La <quote>pila de red</quote> IPsec de &os; 
        se basa en la implementaci&oacute;n 
        <ulink url="http://www.kame.net/">KAME</ulink>, que incluye 
        soporte para las dos familias de protocolos, IPv4 e IPv6.</para>

      <note>
        <para>FreeBSD 5.X contiene una pila IPsec <quote>acelerada 
          por hardware</quote>, conocida como <quote>Fast 
          IPsec</quote>, que fu&eacute; obtenida de OpenBSD.  
          Emplea hardware criptogr&aacute;fico (cuando es posible) 
          a trav&eacute;s del subsistema &man.crypto.4; para 
          optimizar el rendimiento de IPsec.  Este subsistema es 
          nuevo, y no soporta todas las opciones disponibles en la 
          versi&oacute;n KAME de IPsec.  Para poder habilitar IPsec 
          acelerado por hardware debe a&ntilde;adir las siguientes 
          opciones al fichero de configuraci&oacute;n de su kernel:</para>

	<indexterm>
	  <primary>opciones de kernel</primary>
	  <secondary>FAST_IPSEC</secondary>
	</indexterm>

        <screen>
options	  FAST_IPSEC  # new IPsec (cannot define w/ IPSEC)
        </screen>

        <para>Tenga en cuenta que no es posible utilizar el subsistema 
          <quote>Fast IPsec</quote>  y la implementaci&oacute;n 
          KAME de IPsec en la misma computadora.  Consulte la 
	  p&aacute;gina de manual &man.fast.ipsec.4; para m&aacute;s 
          informaci&oacute;n.</para>

      </note>
  
      <indexterm>
	<primary>IPsec</primary>
	<secondary>ESP</secondary>
      </indexterm>
  
      <indexterm>
	<primary>IPsec</primary>
	<secondary>AH</secondary>
      </indexterm>

      <para>IPsec consta de dos sub-protocolos:</para>

      <itemizedlist>
        <listitem>
          <para><emphasis>Encapsulated Security Payload 
            (ESP)</emphasis>, que protege los datos del paquete IP 
            de interferencias de terceros, cifrando el contenido 
            utilizando algoritmos de criptograf&iacute;a sim&eacute;trica 
            (como Blowfish, 3DES).</para>  
        </listitem>
        <listitem>
          <para><emphasis>Authentication Header (AH)</emphasis>, que 
            protege la cabecera del paquete IP de interferencias de
            terceros as&iacute; como contra la  falsificaci&oacute;n 
	    (<quote>spoofing</quote>), calculando una suma de 
	    comprobaci&oacute;n criptogr&aacute;fica y aplicando a 
            los campos de cabecera IP una funci&oacute;n hash segura.  
	    Detr&aacute;s de todo esto va una cabecera adicional que 
	    contiene el hash para permitir la validaci&oacute;n de 
	    la informaci&oacute;n que contiene el paquete.</para>
        </listitem>
      </itemizedlist>
      
      <para><acronym>ESP</acronym> y <acronym>AH</acronym> pueden 
        utilizarse conjunta o separadamente, dependiendo del 
        entorno.</para>
      
      <indexterm>
	<primary>VPN</primary>
      </indexterm>

      <indexterm>
	<primary>Red privada virtual</primary>
	<see>VPN</see>
      </indexterm>
 
      <para>IPsec puede utilizarse para cifrar directamente el 
        tr&aacute;fico entre dos equipos (conocido como 
        <emphasis>modo de transporte</emphasis>) o para construir 
        <quote>t&uacute;neles virtuales</quote> entre dos subredes, 
        que pueden usarse para comunicaci&oacute;n segura 
        entre dos redes corporativas (conocido como <emphasis>modo
        de t&uacute;nel</emphasis>).  Este &uacute;ltimo es muy 
        conocido como una <emphasis>red privada virtual (Virtual
        Private Network, o VPN)</emphasis>.  &man.ipsec.4; contiene 
        informaci&oacute;n detallada sobre el subsistema IPsec de 
	&os;.</para>
         
      <para>Si quiere a&ntilde;dir soporte IPsec a su kernel debe 
        incluir las siguientes opciones al fichero de configuraci&oacute;n 
	de su kernel:</para>

      <indexterm>
	<primary>opciones de kernel</primary>
	<secondary>IPSEC</secondary>
      </indexterm>

      <indexterm>
	<primary>opciones de kernel</primary>
	<secondary>IPSEC_ESP</secondary>
      </indexterm>

      <screen>
options   IPSEC        #IP security
options   IPSEC_ESP    #IP security (crypto; define w/ IPSEC)
      </screen>

      <indexterm>
	<primary>opciones de kernel</primary>
	<secondary>IPSEC_DEBUG</secondary>
      </indexterm>

      <para>Si quiere soporte para la depuraci&oacute;n de 
        errores no olvide la siguiente opci&oacute;n:</para>

      <screen>
options   IPSEC_DEBUG  #debug for IP security
      </screen>
    </sect2>

    <sect2>
      <title>El Problema</title>
 
      <para>No existe un est&aacute;ndar para lo que constituye una VPN.  
        Las VPN pueden implementarse utilizando numerosas 
        tecnolog&iacute;as diferentes, cada una de las cuales tiene sus 
        pros y sus contras.  Esta secci&oacute;n presenta un 
        escenario, y las estrategias usadas para implementar una VPN 
        para este escenario.</para>
    </sect2>
    
    <sect2> 
      <title>El escenario: dos redes, conectadas por Internet, que 
        queremos que se comporten como una sola</title>
      
      <indexterm>
	<primary>VPN</primary>
	<secondary>creaci&oacute;n</secondary>
      </indexterm>

      <para>Este es el punto de partida:</para>
      
      <itemizedlist>
        <listitem>
          <para>Usted tiene al menos dos sitios</para>
        </listitem>
        <listitem>
          <para>Ambos sitios utilizan IP internamente</para>
        </listitem>
        <listitem>
          <para>Ambos sitios est&aacute;n conectados a Internet, a 
            trav&eacute;s de una puerta de enlace &os;.</para>
        </listitem>
        <listitem>
          <para>La puerta de enlace de cada red tiene al menos una 
	    direcci&oacute;n IP p&uacute;blica.</para>
        </listitem>
        <listitem>
          <para>Las direcciones internas de las dos redes pueden ser 
            direcciones IP p&uacute;blicas o privadas, no importa.  
            Puede ejecutar NAT en la m&aacute;quina que hace de 
	    puerta de enlace si es necesario.</para>
        </listitem>
        <listitem>
          <para>Las direcciones IP internas de las dos redes
            <emphasis>no colisionan</emphasis>.  Aunque espero
            que sea te&oacute;ricamente posible utilizar una 
	    combinaci&oacute;n de tecnolog&iacute;a VPN y NAT
            para hacer funcionar todo esto sospecho que 
	    configurarlo ser&iacute;a una pesadilla.</para>
        </listitem>
      </itemizedlist>
      
      <para>Si lo que intenta es conectar dos redes y ambas usan el 
        mismo rango de direcciones IP privadas (por ejemplo las dos usan 
        <hostid role="ipaddr">192.168.1.x</hostid>)deber&iacute;a renumerar 
	una de las dos redes.</para>
 
      <para>La topolog&iacute;a de red se parecer&iacute;a a esto:</para>
 
      <mediaobject>
	<imageobject>
	  <imagedata fileref="security/ipsec-network" align="center">
	</imageobject>

	<textobject>
<literallayout class="monospaced">Network #1            [ Internal Hosts ]    Private Net, 192.168.1.2-254
                      [   Win9x/NT/2K  ]
                      [      UNIX      ]
                               |
                               |
                        .---[fxp1]---.      Private IP, 192.168.1.1
                        |   FreeBSD  |
                        `---[fxp0]---'      Public IP, A.B.C.D
                               |
                               |
                      -=-=- Internet -=-=-
                               |
                               |
                        .---[fxp0]---.      Public IP, W.X.Y.Z
                        |   FreeBSD  |
                        `---[fxp1]---'      Private IP, 192.168.2.1
                               |
                               |
Network #2            [ Internal Hosts ]
                      [   Win9x/NT/2K  ]    Private Net, 192.168.2.2-254
                      [      UNIX      ]</literallayout>
	</textobject>
      </mediaobject>
 
      <para>Observe las dos direcciones IP p&uacute;blicas.  Usar&eacute; 
        letras para referirme a ellas en el resto de este art&iacute;culo.  
        El cualquier lugar que vea esas letras en este art&iacute;culo 
        reempl&aacute;celas con su propia direcci&oacute;n IP p&uacute;blica.  
        Observe tambi&eacute;n que internamente las dos m&aacute;quinas 
        que hacen de puerta de enlace tienen la direcci&oacute;n IP .1, 
	y que las dos redes tienen direcciones IP privadas diferentes 
        (<hostid 
        role="ipaddr">192.168.1.x</hostid> y <hostid 
        role="ipaddr">192.168.2.x</hostid> respectivamente).  Todas las 
        m&aacute;quinas de las redes privadas est&aacute;n configuradas para 
        utilizar la m&aacute;quina <hostid role="ipaddr">.1</hostid> 
        como su puerta de enlace por defecto.</para>
 
      <para>La intenci&oacute;n es que, desde el punto de vista de la 
        red, cada red debe ver las m&aacute;quinas en la otra red como 
        si estuvieran directamente conectadas al mismo router (aunque 
        aunque sea un router ligeramente lento con una tendencia 
        ocasional a tirar paquetes).</para>
 
      <para>Esto significa que (por ejemplo), la m&aacute;quina 
        <hostid role="ipaddr">192.168.1.20</hostid> debe ser 
        capaz de ejecutar</para>
 
      <programlisting>ping 192.168.2.34</programlisting>
 
      <para>y recibir de forma transparente una respuesta.  Las 
        m&aacute;quinas &windows; deben ser capaces de ver las 
        m&aacute;quinas de la otra red, acceder a sus ficheros 
	compartidos, etc, exactamente igual que cuando acceden a 
        las m&aacute;quinas de la red local.</para>
 
      <para>Y todo debe hacerse de forma segura.  Esto significa que el 
        tr&aacute;fico entre las dos redes tiene que ser 
        cifrado.</para>
 
      <para>La creaci&oacute;n de una VPN entre estas dos redes es un 
        proceso que requiere varios pasos.  Las etapas son estas:</para>
 
      <orderedlist>
        <listitem>
          <para>Crear un enlace de red <quote>virtual</quote> entre las dos 
            redes, a trav&eacute;s de Internet.  Probarlo usando herramientas 
            como &man.ping.8; para asegurarse de que funcione.</para>
        </listitem>
 
        <listitem>
          <para>Aplicar pol&iacute;ticas de seguridad para asegurarse 
            de que el tr&aacute;fico entre las dos redes sea cifrado 
            y descifrado de forma transparente.  Comprobarlo mediante 
            herramientas como &man.tcpdump.1; para asegurarse de que 
            el tr&aacute;fico est&eacute; siendo efectivamente 
	    cifrado.</para>
        </listitem>

        <listitem>
          <para>Configurar software adicional en las puertas de 
	    enlace &os; para permitir a las m&aacute;quinas &windows; 
            verse entre ellas a trav&eacute;s de la VPN.</para>
        </listitem>
      </orderedlist>

    <sect3>
      <title>Paso 1: Creaci&oacute;n y prueba de un enlace de 
        red <quote>virtual</quote></title>
 
      <para>Suponga que est&aacute; en la puerta de enlace de la red 
        red #1 (con direcci&oacute;n IP p&uacute;blica <hostid 
        role="ipaddr">A.B.C.D</hostid>, direcci&oacute;n IP privada 
        <hostid role="ipaddr">192.168.1.1</hostid>), y ejecuta 
        <command>ping 192.168.2.1</command>, que es la direcci&oacute;n 
        privada de la m&aacute;quina con direcci&oacute;n IP 
        <hostid role="ipaddr">W.X.Y.Z</hostid>.  &iquest;Qu&eacute; 
	hace falta para esto?</para>

      <orderedlist>
        <listitem>
          <para>La puerta de enlace necesita saber c&oacute;mo alcanzar 
            a <hostid role="ipaddr">192.168.2.1</hostid>.  En otras 
            palabras, necesita tener una ruta hasta <hostid
             role="ipaddr">192.168.2.1</hostid>.</para>
        </listitem>
        <listitem>
          <para>Las direcciones IP privadas, como las que est&aacute;n 
	    en el rango <hostid role="ipaddr">192.168.x</hostid> 
            no deber&iacute;an aparecer en Internet.  Por eso, cada paquete 
            que mande a <hostid role="ipaddr">192.168.2.1</hostid> 
            necesitar&aacute; encerrarse dentro de otro paquete.  
            Este paquete debe tener todas las caracter&iacute;sticas 
            de haber sido enviado desde 
	    <hostid role="ipaddr">A.B.C.D</hostid>, 
            y tendr&aacute; que ser enviado a <hostid 
            role="ipaddr">W.X.Y.Z</hostid>.  Este proceso recibe el nombre 
            de <firstterm>encapsulado</firstterm>.</para>
        </listitem>
        <listitem>
          <para>Una vez que este paquete llega a 
            <hostid role="ipaddr">W.X.Y.Z</hostid> necesitar&aacute; 
            ser <quote>desencapsulado</quote>, y entregado a 
            <hostid role="ipaddr">192.168.2.1</hostid>.</para>
	</listitem>
      </orderedlist>
 
      <para>Puede verlo como si necesitara un <quote>t&uacute;nel</quote> 
        entre las dos redes.  Las dos <quote>bocas del t&uacute;nel</quote> 
        son las direcciones IP <hostid role="ipaddr">A.B.C.D</hostid> y 
        <hostid role="ipaddr">W.X.Y.Z</hostid>, y debe hacer que el 
	t&uacute;nel sepa cu&aacute;les ser&aacute;n las direcciones 
	IP privadas que tendr&aacute;n permitido el paso a trav&eacute;s 
	de &eacute;l.  El t&uacute;nel se usa para transferir tr&aacute;fico 
        con direcciones IP privadas a trav&eacute;s de la Internet 
        p&uacute;blica.</para> 
 
      <para>Este t&uacute;nel se crea mediante la interfaz gen&eacute;rica,
        o dispositivo <devicename>gif</devicename> en &os;.  Como 
        puede imaginarse la interfaz <devicename>gif</devicename> 
        de cada puerta de enlace debe configurarse con cuatro 
        direcciones IP:  dos para las direcciones IP p&uacute;blicas,
        y dos para las direcciones IP privadas.</para>
 
      <para>El soporte para el dispositivo gif debe compilarse en el 
        kernel de &os; en ambas m&aacute;quinas a&ntilde;adiendo 
        la l&iacute;nea</para>
 
      <programlisting>device gif</programlisting>
 
      <para>a los ficheros de configuraci&oacute;n del kernel de 
        ambas m&aacute;quinas, compilarlo, instalarlo y reiniciar.</para>
 
      <para>La configuraci&oacute;n del t&uacute;nel es un proceso 
        que consta de dos partes.  Primero se le debe decir al 
	t&uacute;nel cu&aacute;les son las direcciones IP exteriores 
        (o p&uacute;blicas) mediante &man.gifconfig.8;.  Despu&eacute;s 
        configure las direcciones IP con &man.ifconfig.8;.</para>

      <note>
        <para>En &os;&nbsp;5.X las funciones de &man.gifconfig.8; 
          se han incluido en &man.ifconfig.8;.</para></note>
 
      <para>En la puerta de enlace de la red #1 debe ejecutar 
        las siguientes dos &oacute;rdenes para configurar el 
	t&uacute;nel.</para>
 
      <programlisting>gifconfig gif0 A.B.C.D W.X.Y.Z
ifconfig gif0 inet 192.168.1.1 192.168.2.1 netmask 0xffffffff
      </programlisting>
 
      <para>En la otra puerta de enlace ejecute las mismas 
        &oacute;rdenes, pero con el orden las direcciones IP 
        invertido.</para>
 
      <programlisting>gifconfig gif0 W.X.Y.Z A.B.C.D
ifconfig gif0 inet 192.168.2.1 192.168.1.1 netmask 0xffffffff
      </programlisting>
 
      <para>Ahora ejecute:</para>
 
      <programlisting>gifconfig gif0</programlisting>
 
      <para>y podr&aacute; ver la configuraci&oacute;n.  Por ejemplo, en la 
        puerta de enlace de la red #1 ver&iacute;a algo parecido 
	a esto:</para>
 
      <screen>&prompt.root; <userinput>gifconfig gif0</userinput>
gif0: flags=8011&lt;UP,POINTTOPOINT,MULTICAST&gt; mtu 1280
inet 192.168.1.1 --&gt; 192.168.2.1 netmask 0xffffffff
physical address inet A.B.C.D --&gt; W.X.Y.Z
      </screen>
 
      <para>Como puede ver se ha creado un t&uacute;nel entre las direcciones 
        f&iacute;sicas <hostid role="ipaddr">A.B.C.D</hostid> y 
        <hostid role="ipaddr">W.X.Y.Z</hostid>, y el tr&aacute;fico 
        que puede pasar a trav&eacute;s del t&uacute;nel es entre 
        <hostid role="ipaddr">192.168.1.1</hostid> y 
        <hostid role="ipaddr">192.168.2.1</hostid>.</para>
 
      <para>Esto tambi&eacute;n habr&aacute; agregado una entrada en 
        la tabla de rutas de ambas m&aacute;quinas, que puede 
        examinar con <command>netstat -rn</command>.  
        Esta salida es de la puerta de enlace de la red #1.</para>
 
      <screen>&prompt.root; <userinput>netstat -rn</userinput>
Routing tables
 
Internet:
Destination      Gateway       Flags    Refs    Use    Netif  Expire
...
192.168.2.1      192.168.1.1   UH        0        0    gif0
...
      </screen>
 
      <para>Como el valor de <quote>Flags</quote> lo indica, esta 
        es una ruta de equipo, lo que significa que cada puerta de 
        enlace sabe como alcanzar la otra puerta de enlace, pero no saben 
	c&oacute;mo llegar al resto de sus respectivas redes.  Ese 
        problema se solucionar&aacute; en breve.</para>
 
      <para>Es posible que disponga de un cortafuegos en ambas 
        m&aacute;quinas, por lo que tendr&aacute; que buscar la 
	forma de que el tr&aacute;fico de la VPN pueda entrar y 
	salir limpiamente.  Puede permitir todo el tr&aacute;fico 
	de ambas redes, o puede que quiera incluir reglas en el 
	cortafuegos para que protejan ambos extremos de la VPN uno 
	del otro.</para>
 
      <para>Las pruebas se simplifican enormemente si configura 
        el cortafuegos para permitir todo el tr&aacute;fico a 
        trav&eacute;s de la VPN.  Siempre puede ajustar las cosas 
        despu&eacute;s.  Si utiliza &man.ipfw.8; en las puertas de 
        enlace una orden similar a</para>

      <programlisting>ipfw add 1 allow ip from any to any via gif0</programlisting>
 
      <para>permitir&aacute; todo el tr&aacute;fico entre los dos 
        extremos de la VPN, sin afectar al resto de reglas del 
        cortafuegos.  Obviamente tendr&aacute; que ejecutar esta orden 
        en ambas puertas de enlace.</para>
 
      <para>Esto es suficiente para permitir a cada puerta de enlace 
        hacer un ping entre ellas.  En 
	<hostid role="ipaddr">192.168.1.1</hostid> deber&iacute; poder 
        ejecutar</para>
 
      <programlisting>ping 192.168.2.1</programlisting>
 
      <para>y obtener una respuesta; es obvio que deber&iacute;a poder 
        hacer los mismo en la otra puerte de enlace.</para>
 
      <para>A&uacute;n no podr&aacute; acceder a las m&aacute;quinas 
        internas de las redes.  El problema est&aacute; en el 
	encaminamiento: aunque las puertas de enlace saben 
	c&oacute;mo alcanzarse m&uacute;tuamente no saben c&oacute;mo 
	llegar a la red que hay detr&aacute;s de la otra.</para>
 
      <para>Para resolver este problema debe a&ntilde;adir una ruta 
        est&aacute;tica en cada puerta de enlace.  La orden 
        en la primera puerta de enlace podr&iacute;a ser:</para>
 
      <programlisting>route add 192.168.2.0 192.168.2.1 netmask 0xffffff00
      </programlisting>
 
      <para>Esto significa <quote>Para alcanzar los equipos en 
        la red <hostid role="ipaddr">192.168.2.0</hostid>, env&iacute;a 
        los paquetes al equipo 
	<hostid role="ipaddr">192.168.2.1</hostid></quote>.  
        Necesitar&aacute; ejecutar una orden similar en la otra 
        puerta de enlace, pero obviamente con las direcciones 
        <hostid role="ipaddr">192.168.1.x</hostid>.</para>
 
      <para>El tr&aacute;fico IP de equipos en una red no ser&aacute; 
        capaz de alcanzar equipos en la otra red.</para>
 
      <para>Ya tiene dos tercios de una VPN, puesto que ya es 
        <quote>virtual</quote> y es una <quote>red</quote>.  
        Todav&iacute;a no es privada.  Puede comprobarlo con 
        &man.ping.8; y &man.tcpdump.1;.  Abra una sesi&oacute;n en 
	la puerta de enlace y ejecute</para>
 
      <programlisting>tcpdump dst host 192.168.2.1</programlisting>

      <para>En otra sesi&oacute;n en el mismo equipo ejecute</para>

      <programlisting>ping 192.168.2.1</programlisting>
 
      <para>Ver&aacute; algo muy parecido a esto:</para>
 
      <programlisting>
16:10:24.018080 192.168.1.1 &gt; 192.168.2.1: icmp: echo request
16:10:24.018109 192.168.1.1 &gt; 192.168.2.1: icmp: echo reply
16:10:25.018814 192.168.1.1 &gt; 192.168.2.1: icmp: echo request
16:10:25.018847 192.168.1.1 &gt; 192.168.2.1: icmp: echo reply
16:10:26.028896 192.168.1.1 &gt; 192.168.2.1: icmp: echo request
16:10:26.029112 192.168.1.1 &gt; 192.168.2.1: icmp: echo reply
      </programlisting>
 
      <para>Como puede ver los mensajes ICMP van y vienen sin  
        cifrar.  Si usa el par&aacute;metro <option>-s</option> 
        en &man.tcpdump.1; para tomar m&aacute;s bytes de datos de 
        estos paquetes ver&aacute; m&aacute;s informaci&oacute;n.</para>
 
      <para>Obviamente esto es inaceptable.  La siguiente secci&oacute;n 
        explicar&aacute; c&oacute;mo asegurar el enlace entre las dos 
        redes para que todo el tr&aacute;fico se cifre 
        autom&aacute;ticamente.</para>
 
      <itemizedlist>
        <title>Sumario:</title>
        <listitem>
          <para>Configure ambos kernel con <quote>pseudo-device
            gif</quote>.</para>
        </listitem>
        <listitem>
          <para>Edite <filename>/etc/rc.conf</filename> en la puerta de 
            enlace #1 y a&ntilde;ada las siguientes l&iacute;neas 
            (reemplazando las direcciones IP seg&uacute;n sea necesario).</para>
          <programlisting>gifconfig_gif0="A.B.C.D W.X.Y.Z"
ifconfig_gif0="inet 192.168.1.1 192.168.2.1 netmask 0xffffffff"
static_routes="vpn"
route_vpn="192.168.2.0 192.168.2.1 netmask 0xffffff00"
          </programlisting>
        </listitem>

        <listitem>
          <para>Edite la configuraci&oacute;n de su cortafuegos 
            (<filename>/etc/rc.firewall</filename>, o lo que corresponda) 
            en ambos equipos y a&ntilde;ada</para>

          <programlisting>ipfw add 1 allow ip from any to any via gif0</programlisting>
        </listitem>
        <listitem>
          <para>Haga los cambios oportunos en el 
            <filename>/etc/rc.conf</filename> de la puerta de 
            enlace #2, invirtiendo el orden de las direcciones IP.</para>
        </listitem>
      </itemizedlist>
    </sect3>

    <sect3>
      <title>Paso 2: Asegurar el enlace</title>
 
      <para>Para asegurar el enlace usaremos IPsec. IPsec ofrece un 
        mecanismo para que dos equipos coincidan en una llave de 
        cifrado, y usar esta llave para cifrar los datos 
        entre los dos equipos.</para>
 
      <para>Existen dos &aacute;reas de configuraci&oacute;n a 
        tener en cuenta:</para>
 
      <orderedlist>
        <listitem>
          <para>Debe existir un mecanismo para que los dos equipos 
            se pongan de acuerdo en el mecanismo de cifrado que van a 
            utilizar.  Una vez que los dos equipos se han puesto de 
            acuerdo dice que existe una 
            <quote>asociaci&oacute;n de seguridad</quote> entre 
            ellos.</para>
        </listitem>
        <listitem>
          <para>Debe existir un mecanismo para especificar que tr&aacute;fico
            debe ser cifrado.  Obviamente, usted no querr&aacute; 
            cifrar todo su tr&aacute;fico saliente: solo querr&aacute; 
            cifrar el tr&aacute;fico que es parte de la VPN.  Las 
            reglas con las que determinar&aacute; qu&eacute; tr&aacute;fico 
            ser&aacute; cifrado se llaman <quote>pol&iacute;ticas
            de seguridad</quote>.</para>
         </listitem>
       </orderedlist>
 
       <para>Tanto las asociaciones de seguridad como las 
         pol&iacute;ticas de seguridad son responsabilidad del kernel, 
	 pero pueden ser modificadas desde el espacio de usuario.  
	 Antes de poder hacerlo, tendr&aacute; que configurar el kernel 
	 para que incluya IPsec y el protocolo ESP 
         (Encapsulated Security Payload).  Incluya en el fichero de 
	 configuraci&oacute;n de su kernel lo siguiente:</para>
 
       <indexterm>
	 <primary>opciones de kernel</primary>
	 <secondary>IPSEC</secondary>
       </indexterm>

       <programlisting>options IPSEC
options IPSEC_ESP
       </programlisting>
 
       <para>Recompile y resintale su kernel y reinicie.  Como se dijo 
         anteriormente, tendr&aacute; que hacer lo mismo en el kernel 
	 de las dos puertas de enlace.</para>
 
       <indexterm>
	 <primary>IKE</primary>
       </indexterm>

       <para>Tiene dos opciones cuando se trata de configurar 
         asociaciones de seguridad.  Puede configurarlas a mano en 
         los dos equipos, lo que significa elegir el algoritmo de 
         cifrado, las llaves de cifrado, etc, o puede utilizar 
         alguno de los d&aelig;mons que implementan el protocolo 
         de intercambio de llaves de Internet (IKE, Internet Key 
	 Exchange).</para>
 
       <para>Le recomiendo la segunda opci&oacute;n.  Aparte de 
         otras consideraciones es m&aacute;s f&aacute;cil de 
	 configurar.</para>
 
       <indexterm>
	 <primary>IPsec</primary>
	 <secondary>pol&iacute;ticas de seguridad</secondary>
       </indexterm>

       <indexterm>
	 <primary><command>setkey</command></primary>
       </indexterm>

       <para>La edici&oacute;n y despliegue se efect&uacute;a con 
         &man.setkey.8;.  Todo esto se entiende mejor con una 
	 analog&iacute;a.  <command>setkey</command> es a las tablas 
	 de pol&iacute;ticas de seguridad del kernel lo que &man.route.8; 
	 es a las tablas de rutas del kernel.  
         Tambi&eacute;n puede usar <command>setkey</command> 
         ver las asociaciones de seguridad en vigor, siguiendo con 
         la analog&iacute;a, igual que puede usar 
         <command>netstat -r</command>.</para>
 
       <para>Existen numerosos d&aelig;mons que pueden encargarse de 
         la gesti&oacute;n de asociaciones de seguridad en &os;.  En 
	 este texto se muestra c&oacute;mo usar uno de ellos, 
         racoon (que puede instalar desde 
         <filename role="package">security/racoon</filename> en la 
         colecci&oacute;n de ports de &os;.</para>
 
       <indexterm>
	 <primary>racoon</primary>
       </indexterm>

       <para>El software <filename role="package">security/racoon</filename> 
         debe ejecutarse en las dos puertas de enlace.  En cada equipo 
         debe configurar la direcci&oacute;n IP del otro extremo de la 
         VPN y una llave secreta (que usted puede y debe elegir, y debe ser 
	 la misma en ambas puertas de enlace).</para>
 
       <para>Los dos d&aelig;mons entran en contacto uno con otro, y confirman 
         que son quienes dicen ser (utilizando la llave secreta que usted 
         configur&oacute;).  Los d&aelig;mons generan una nueva llave 
         secreta, y la utilizan para cifrar el tr&aacute;fico que discurre a 
         trav&eacute;s de la VPN.  Peri&oacute;dicamente cambian esta 
         llave, para que incluso si un atacante comprometiera una 
         de las llaves (lo cual es te&oacute;ricamente cercano a 
	 imposible) no le serviri&iacute;a de mucho: para cuando el 
	 atacante haya <quote>crackeado</quote> la llave los d&aelig;mons 
         ya habr&aacute;n escogido una nueva.</para>
 
       <para>El fichero de configuraci&oacute;n de racoon 
         est&aacute; en <filename>${PREFIX}/etc/racoon</filename>.  
         No deber&iacute;a tener que hacer demasiados cambios a ese 
	 fichero.  El otro componente de la configuraci&oacute;n de 
	 racoon (que <emphasis>s&iacute;</emphasis> tendr&aacute; que 
	 modificar) es la <quote>llave pre-compartida</quote>.</para>
 
       <para>La configuraci&oacute;n por defecto de racoon 
         espera encontrarla en 
	 <filename>${PREFIX}/etc/racoon/psk.txt</filename>.  
         Es importante saber que la llave precompartida <emphasis>no</emphasis>
         es la llave que se utilizar&aacute; para cifrar el 
         tr&aacute;fico a trav&eacute;s del enlace VPN; solamente es una 
         muestra que permite a los d&aelig;mons que administran las 
         llaves confiar el uno en el otro.</para>

       <para><filename>psk.txt</filename> contiene una l&iacute;nea 
         por cada sitio remoto con el que est&eacute; tratando.  En 
         nuestro ejemplo, donde existen dos sitios, cada fichero 
         <filename>psk.txt</filename> contendr&aacute; una l&iacute;nea 
         (porque cada extremo de la VPN solo est&aacute; tratando 
         con un sitio en el otro extremo).</para>
 
       <para>En la puerta de enlace #1 esta l&iacute;nea deber&iacute;a
         parecerse a esta:</para>
 
       <programlisting>W.X.Y.Z            secreto</programlisting>
 
       <para>Esto es, la direcci&oacute;n IP 
         <emphasis>p&uacute;blica</emphasis> del extremo remoto, un 
	 espacio en blanco, y una cadena de texto que es el secreto 
	 en s&iacute;.  
         en el extremo remoto, espacio en blanco, y un texto de cadena que
         proporcina el secreto. Obviamente, no debe utilizar 
	 <quote>secret</quote> como su llave; aplique aqu&iacute; las 
	 reglas y recomendaciones habituales para la elecci&oacute;n de 
	 contrase&ntilde;as.</para>
 
       <para>En la puerta de enlace #2 la l&iacute;nea se parecer&iacute;a
         a esta</para>
 
       <programlisting>A.B.C.D            secreto</programlisting>
 
       <para>Esto es, la direcci&oacute;n IP p&uacute;blica del 
         extremo remoto, y la misma llave secreta.  
	 <filename>psk.txt</filename> debe tener modo 
         <literal>0600</literal> (es decir, modo de solo 
         lectura/escritura para <username>root</username>) antes de 
         que ejecute racoon.</para>
 
       <para>Debe ejecutar racoon en ambas puertas de enlace.  
         Tambi&eacute;n tendr&aacute; que a&ntilde;adir algunas reglas 
         a su cortafuegos para permitir el tr&aacute;fico IKE, que se 
         transporta sobre UDP al puerto ISAKMP (Internet Security 
         Association Key Management Protocol).   Esto debe estar 
         al principio de las reglas de su cortafuegos.</para>
 
       <programlisting>ipfw add 1 allow udp from A.B.C.D to W.X.Y.Z isakmp
ipfw add 1 allow udp from W.X.Y.Z to A.B.C.D isakmp
       </programlisting>
 
       <para>Una vez que ejecute racoon puede tratar de hacer un 
         ping a una puerta de enlace desde la otra.  La conexi&oacute;n 
         todav&iacute;a no est&aacute; cifrada porque a&uacute;n no se 
         han creado las asociaciones de seguridad entre los dos 
         equipos: esto puede llevar un poco de tiempo; es posible que 
	 advierta un peque&ntilde;o retraso antes de los ping empiecen 
         responder.</para>
 
       <para>Una vez creadas las asociaciones de seguridad 
         puede verlas utilizando &man.setkey.8;. Ejecute</para>
 
       <programlisting>setkey -D</programlisting>
 
       <para>en cualquiera de los equipos para comprobar la informaci&oacute;n 
         de la asociaci&oacute;n de seguridad.</para>
 
       <para>Ya est&aacute; resuelta la mitad del problema. La otra mitad es 
         configurar sus pol&iacute;ticas de seguridad.</para>
 
       <para>Queremos crear una pol&iacute;tica de seguridad sensata, 
         as&iacute; que vamos a revisar lo que tenemos configurado 
	 hasta el momento.  Esta revisi&oacute;n abarca ambos extremos 
	 del enlace.</para>
 
       <para>Cada paquete IP que usted manda tiene una cabecera que 
         contiene datos acerca del paquete.  La cabecera incluye la 
         direcci&oacute;n IP de destino y del origen.  Como ya sabemos, 
         las direcciones IP privadas como el rango 
         <hostid role="ipaddr">192.168.x.y</hostid> no deber&iacute;an 
         aparezcan en Internet.  Dado que es a trav&eacute;s de Internet 
	 por donde los queremos transmitir los debemos encapsular dentro 
	 de otro paquete.  Este paquete debe contener tanto la direcci&oacute;n 
	 IP de destino y origen p&uacute;blicas sustituidas por las 
	 direcciones privadas.</para>
 
       <para>As&iacute; que si su paquete saliente empez&oacute; 
         pareciendose a este:</para>
 
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="security/ipsec-out-pkt" align="center">
	  </imageobject>

	  <textobject>
	    <literallayout class="monospaced">
  .----------------------.
  | Src: 192.168.1.1     |
  | Dst: 192.168.2.1     |
  | &lt;other header info&gt;  |
  +----------------------+
  | &lt;packet data&gt;        |
  `----------------------'</literallayout>
	  </textobject>
	</mediaobject>
 
       <para>tras el encapsulado se parecer&aacute; bastante a este:</para>
 
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="security/ipsec-encap-pkt" align="center">
	  </imageobject>

	  <textobject>
	    <literallayout class="monospaced">
  .--------------------------.
  | Src: A.B.C.D             |
  | Dst: W.X.Y.Z             |
  | &lt;other header info&gt;      |
  +--------------------------+
  | .----------------------. |
  | | Src: 192.168.1.1     | |
  | | Dst: 192.168.2.1     | |
  | | &lt;other header info&gt;  | |
  | +----------------------+ |
  | | &lt;packet data&gt;        | |
  | `----------------------' |
  `--------------------------'</literallayout>
	  </textobject>
	</mediaobject>
 
       <para>El dispositivo <devicename>gif</devicename> se encarga 
         del encapsulado.  Como puede ver el paquete tiene una 
	 direcci&oacute;n IP real en el exterior, y nuestro paquete 
	 original ha sido envuelto como dato dentro del paquete que 
	 enviaremos a trav&eacute;s de Internet.</para>
 
       <para>Obviamente, queremos que todo el tr&aacute;fico entre 
         las VPN vaya cifrado.  Pongamos esto &uacute;ltimo en 
	 palabras para comprenderlo mejor:</para>

       <para><quote>Si un paquete sale desde <hostid 
         role="ipaddr">A.B.C.D</hostid>, y tiene como destino 
         <hostid role="ipaddr">W.X.Y.Z</hostid>, c&iacute;fralo 
         utilizando las asociaciones de seguridad necesarias.</quote></para>
 
       <para><quote>Si un paquete llega desde <hostid
         role="ipaddr">W.X.Y.Z</hostid>, y tiene como destino 
         <hostid role="ipaddr">A.B.C.D</hostid>, desc&iacute;fralo 
         utilizando las asociaciones de seguridad necesarias.</quote></para>

       <para>Este planteamiento se aproxima bastante, pero no es 
         exactamente lo que queremos hacer.  Si lo hiciera as&iacute; 
         todo el tr&aacute;fico desde y hacia 
	 <hostid role="ipaddr">W.X.Y.Z</hostid>, incluso el tr&aacute;fico 
         que no forma parte de la VPN, ser&aacute; cifrado; esto no es lo que 
	 queremos.  La pol&iacute;tica correcta es la siguiente:</para>
 
       <para><quote>Si un paquete sale desde <hostid
         role="ipaddr">A.B.C.D</hostid>, y est&aacute; 
         encapsulando a otro paquete, y tiene como destino 
         <hostid role="ipaddr">W.X.Y.Z</hostid>, c&iacute;fralo 
         utilizando las asociaciones de seguridad necesarias.</quote></para>

       <para><quote>Si un paquete llega desde <hostid
          role="ipaddr">W.X.Y.Z</hostid>, y est&aacute; 
          encapsulando a otro paquete, y tiene como destino 
          <hostid role="ipaddr">A.B.C.D</hostid>, desc&iacute;fralo 
          utilizando las asociaciones de seguridad necesarias.</quote></para>
 
       <para>Un cambio sutil, pero necesario.</para> 
 
       <para>Las pol&iacute;ticas de seguridad tambi&eacute;n se 
         imponen utilizando &man.setkey.8;.  &man.setkey.8; proporciona 
         un lenguaje de configuraci&oacute;n para definir la 
         pol&iacute;tica.  Puede introducir las instrucciones de 
         configuraci&oacute;n a trav&eacute;s de la entrada est&aacute;ndar 
	 (stdin), o puede usar la opci&oacute;n 
         <option>-f</option> para especificar un fichero que 
         contenga las instrucciones de configuraci&oacute;n.</para>
 
       <para>La configuraci&oacute;n en la puerta de enlace #1 (que 
         tiene la direcci&oacute;n IP p&uacute;blica 
         <hostid role="ipaddr">A.B.C.D</hostid>) para forzar que todo 
         el tr&aacute;fico saliente hacia 
	 <hostid role="ipaddr">W.X.Y.Z</hostid> vaya cifrado es:</para>
 
       <programlisting>
spdadd A.B.C.D/32 W.X.Y.Z/32 ipencap -P out ipsec esp/tunnel/A.B.C.D-W.X.Y.Z/require;
       </programlisting>
 
       <para>Ponga estas &oacute;rdenes en un fichero (por ejemplo 
         <filename>/etc/ipsec.conf</filename>) y ejecute</para>

       <screen>&prompt.root; <userinput>setkey -f /etc/ipsec.conf</userinput></screen>
 
       <para><option>spdadd</option> le dice a &man.setkey.8; que 
         queremos a&ntilde;adir una regla a la base de datos de 
	 pol&iacute;ticas de seguridad.  El resto de la l&iacute;nea 
	 especifica qu&eacute; paquetes se ajustar&aacute;n a esta 
         pol&iacute;tica.  
         <hostid role="ipaddr">A.B.C.D/32</hostid> y
         <hostid role="ipaddr">W.X.Y.Z/32</hostid> son las direcciones IP
         y m&aacute;scaras de red que identifican la red o equipos a los
         que se aplicar&aacute; esta pol&iacute;tica.  En nuestro caso 
         queremos aplicarla al tr&aacute;fico entre estos dos equipos.  
         <option>-P out</option> dice que esta pol&iacute;tica se aplica 
         a paquetes salientes, e <option>ipsec</option> hace que el 
         paquete sea asegurado.</para>
 
       <para>La segunda l&iacute;nea especifica c&oacute;mo ser&aacute;  
         cifrado este paquete.   <option>esp</option> es el 
         protocolo que se utilizar&aacute;, mientras que 
         <option>tunnel</option> indica que el paquete ser&aacute; 
         despu&eacute;s encapsulado en un paquete IPsec.  El uso repetido de 
         <hostid role="ipaddr">A.B.C.D</hostid> y 
         <hostid role="ipaddr">W.X.Y.Z</hostid> se utiliza para 
         seleccionar la asociaci&oacute;n de seguridad a usar, y 
         por &uacute;ltimo <option>require</option> exige que los 
         paquetes deben cifrarse si concuerdan con esta
         regla.</para>
 
       <para>Esta regla solo concuerda con paquetes salientes.  
         Necesitar&aacute; una regla similar para los paquetes 
         entrantes.</para>
 
       <programlisting>spdadd W.X.Y.Z/32 A.B.C.D/32 ipencap -P in ipsec esp/tunnel/W.X.Y.Z-A.B.C.D/require;</programlisting>
 
       <para>Observe el <option>in</option> en lugar del <option>out</option> 
         en este caso, y la inversi&oacute;n necesaria de las direcciones 
         IP.</para>
 
       <para>La otra puerta de enlace (que tiene la direcci&oacute;n 
         IP p&uacute;blica <hostid role="ipaddr">W.X.Y.Z</hostid>) 
         necesitar&aacute; reglas similares.</para>
 
       <programlisting>spdadd W.X.Y.Z/32 A.B.C.D/32 ipencap -P out ipsec esp/tunnel/W.X.Y.Z-A.B.C.D/require;
spdadd A.B.C.D/32 W.X.Y.Z/32 ipencap -P in ipsec esp/tunnel/A.B.C.D-W.X.Y.Z/require;</programlisting>
 
       <para>Finalmente, necesita a&ntilde;adir reglas a su cortafuegos 
         para permitir la circulaci&oacute;n de paquetes ESP e IPENCAP 
         de ida y vuelta.  Tendr&aacute; que a&ntilde;adir reglas como 
	 estas a ambos equipos.</para>
 
       <programlisting>ipfw add 1 allow esp from A.B.C.D to W.X.Y.Z
ipfw add 1 allow esp from W.X.Y.Z to A.B.C.D
ipfw add 1 allow ipencap from A.B.C.D to W.X.Y.Z
ipfw add 1 allow ipencap from W.X.Y.Z to A.B.C.D
       </programlisting>
 
       <para>Debido a que las reglas son sim&eacute;tricas puede utilizar 
         las mismas reglas en ambas puertas de enlace.</para>
 
       <para>Los paquetes salientes tendr&aacute;n ahora este aspecto:</para>
 
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="security/ipsec-crypt-pkt" align="center">
	  </imageobject>

	  <textobject>
	    <literallayout class="monospaced">
  .------------------------------.  --------------------------.
  | Src: A.B.C.D                 |                            |
  | Dst: W.X.Y.Z                 |                            |
  | &lt;other header info&gt;          |                            |  Encrypted
  +------------------------------+                            |  packet.
  | .--------------------------. |  -------------.            |  contents
  | | Src: A.B.C.D             | |               |            |  are
  | | Dst: W.X.Y.Z             | |               |            |  completely
  | | &lt;other header info&gt;      | |               |            |- secure
  | +--------------------------+ |               |  Encap'd   |  from third
  | | .----------------------. | |  -.           |  packet    |  party
  | | | Src: 192.168.1.1     | | |   |  Original |- with real |  snooping
  | | | Dst: 192.168.2.1     | | |   |  packet,  |  IP addr   |
  | | | &lt;other header info&gt;  | | |   |- private  |            |
  | | +----------------------+ | |   |  IP addr  |            |
  | | | &lt;packet data&gt;        | | |   |           |            |
  | | `----------------------' | |  -'           |            |
  | `--------------------------' |  -------------'            |
  `------------------------------'  --------------------------'
	    </literallayout>
	  </textobject>
	</mediaobject>

       <para>Cuando los paquetes llegan al otro extremo de la VPN 
         ser&aacute;n descifrados (utilizando las 
         asociaciones de seguridad que han sido negociadas por racoon).  
         Despu&eacute;s entrar&aacute;n al interfaz 
	 <devicename>gif</devicename>, que desenvuelve la segunda capa, 
	 hasta que nos quedamos con paquete m&aacute; interno, que puede 
	 entonces viajar a la red interna.</para>
 
       <para>Puede revisar la seguridad utilizando la misma prueba de 
         &man.ping.8; anterior.  Primero, inicie una sesi&oacute;n en 
         la puerta de enlace <hostid role="ipaddr">A.B.C.D</hostid>, 
         y ejecute:</para>
 
       <programlisting>tcpdump dst host 192.168.2.1</programlisting>
 
       <para>En otra sesi&oacute;n en la misma m&aacute;quina ejecute</para>
 
       <programlisting>ping 192.168.2.1</programlisting>
 
       <para>Deber&iacute;a ver algo similar a lo siguiente:</para>
 
       <programlisting>XXX tcpdump output</programlisting>
 
       <para>ahora, como puede ver, &man.tcpdump.1; muestra los paquetes ESP.  
         Si trata de examinarlos con la opci&oacute;n <option>-s</option> 
         ver&aacute; basura (aparentemente), debido al 
	 cifrado.</para>
 
      <para>Felicidades. Acaba de configurar una VPN entre dos sitios 
        remotos.</para>
 
      <itemizedlist>
        <title>Sumario</title>
        <listitem>
          <para>Configure ambos kernel con:</para>
 
          <programlisting>options IPSEC
options IPSEC_ESP
          </programlisting>
        </listitem>
        <listitem>
          <para>Instale <filename role="package">security/racoon</filename>.  
            Edite <filename>${PREFIX}/etc/racoon/psk.txt</filename> en ambas 
            puertas de enlace a&ntilde;adiendo una entrada para la 
	    direcci&oacute;n IP del equipo remoto y una llave secreta que 
	    ambos conozcan.  Aseg&uacute;rese de que este fichero est&eacute; 
	    en modo 0600.</para>
        </listitem>
        <listitem>
          <para>A&ntilde;ada las siguientes l&iacute;neas a
            <filename>/etc/rc.conf</filename> en ambos equipos:</para>
 
          <programlisting>ipsec_enable="YES"
ipsec_file="/etc/ipsec.conf"
          </programlisting>
        </listitem>
        <listitem>
          <para>Cr&eacute;e en ambos equipos un 
	    <filename>/etc/ipsec.conf</filename> que contenga las 
            l&iacute;neas spdadd necesarias.  En la puerta de enlace 
            #1 ser&iacute;a:</para>
 
          <programlisting>
spdadd A.B.C.D/32 W.X.Y.Z/32 ipencap -P out ipsec
  esp/tunnel/A.B.C.D-W.X.Y.Z/require;
spdadd W.X.Y.Z/32 A.B.C.D/32 ipencap -P in ipsec
  esp/tunnel/W.X.Y.Z-A.B.C.D/require;
</programlisting>
 
          <para>En la puerta de enlace #2 ser&iacute;a:</para>
 
<programlisting>
spdadd W.X.Y.Z/32 A.B.C.D/32 ipencap -P out ipsec
  esp/tunnel/W.X.Y.Z-A.B.C.D/require;
spdadd A.B.C.D/32 W.X.Y.Z/32 ipencap -P in ipsec
  esp/tunnel/A.B.C.D-W.X.Y.Z/require;
</programlisting>
        </listitem>
        <listitem>
          <para>A&ntilde;ada a su(s) cortafuegos las reglas necesarias para 
	    que permita(n) el paso de tr&aacute;fico IKE, ESP e 
            IPENCAP en ambos equipos:</para>
 
          <programlisting>
ipfw add 1 allow udp from A.B.C.D to W.X.Y.Z isakmp
ipfw add 1 allow udp from W.X.Y.Z to A.B.C.D isakmp
ipfw add 1 allow esp from A.B.C.D to W.X.Y.Z
ipfw add 1 allow esp from W.X.Y.Z to A.B.C.D
ipfw add 1 allow ipencap from A.B.C.D to W.X.Y.Z
ipfw add 1 allow ipencap from W.X.Y.Z to A.B.C.D
          </programlisting>
        </listitem>
      </itemizedlist>

      <para>Los dos pasos previos deben bastar para levantar la VPN.  
        Las m&aacute;quinas en cada red se&aacute;n capaces de 
        dirigirse una a otra utilizando direcciones IP, y todo el 
	tr&aacute;fico a trav&eacute;s del enlace ser&aacute; cifrado de 
	forma autom&aacute;tica y segura.</para>
    </sect3> 
    </sect2> 
  </sect1>

  <sect1 id="openssh">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Chern</firstname>
	  <surname>Lee</surname>
	  <contrib>Escrito por </contrib>
	</author>
	<!-- 21 April 2001 -->
      </authorgroup>
    </sect1info>

    <title>OpenSSH</title>
    <indexterm><primary>OpenSSH</primary></indexterm>
    <indexterm>
      <primary>seguridad</primary>
      <secondary>OpenSSH</secondary>
    </indexterm>

    <para><application>OpenSSH</application> es un conjunto de herramientas 
      de conectividad que se usan para acceder a sistemas remotos de 
      forma segura.  Puede usarse como sustituto directo de 
      <command>rlogin</command>, 
      <command>rsh</command>, <command>rcp</command> y 
      <command>telnet</command>.  Adem&aacute;s cualquier otra conexi&oacute;n 
      TCP/IP puede reenviarse o enviarse a trav&eacute;s de un t&uacute;nel a 
      trav&eacute;s de SSH.  
      <application>OpenSSH</application> cifra todo el tr&aacute;fico para 
      eliminar de forma efectiva el espionaje, el secuestro de conexiones, y 
      otros ataques en la capa de red.</para>

    <para><application>OpenSSH</application> est&aacute; a cargo del proyecto 
      OpenBSD, y est&aacute; basado en SSH v1.2.12, con todos los errores 
      recientes corregidos y todas las actualizaciones correspondientes.  
      Es compatible con los protocolos SSH 1 y 2.  
      <application>OpenSSH</application> forma parte del sistema base desde 
      &os;&nbsp;4.0.</para>

    <sect2>
      <title>Ventajas de utilizar OpenSSH</title>
  
      <para>Normalmente, al utilizar &man.telnet.1; o &man.rlogin.1; 
        los datos se env&iacute;an a trav&eacute;s de la red en limpio, 
        es decir, sin cifrar.  Cualquier <quote>sniffer</quote> de red 
        entre el cliente y el servidor puede robar la informaci&oacute;n 
        de usuario/contrase&ntilde;a o los datos transferidos durante 
        su sesi&oacute;n.  <application>OpenSSH</application> ofrece 
        diversos m&eacute;todos de validaci&oacute;n y cifrado para 
	evitar que sucedan estas cosas.</para>
    </sect2>

    <sect2>
      <title>Habilitar sshd</title>
      <indexterm>
        <primary>OpenSSH</primary>
        <secondary>habilitar</secondary>
      </indexterm>

      <para>El d&aelig;mon <application>sshd</application> est&aacute; 
        habilitado por defecto &os;&nbsp;4.X y puede elegir habilitarlo 
        o no durante la instalaci&oacute;n en &os;&nbsp;5.X.  Si quiere 
	saber si est&aacute; habilitado revise si la siguiente 
        l&iacute;nea est&aacute; en <filename>rc.conf</filename>:</para>

      <screen>sshd_enable="YES"</screen>

      <para>Esta l&iacute;nea  cargar&aacute; &man.sshd.8;, el programa 
        d&aelig;mon de <application>OpenSSH</application>, en el arranque 
        de su sistema.  Puede ejecutar el d&aelig;mon 
        <application>sshd</application> tecleando 
        <command>sshd</command> en la l&iacute;nea de &oacute;rdenes.</para>
    </sect2>

    <sect2>
      <title>Cliente SSH</title>
      <indexterm>
        <primary>OpenSSH</primary>
        <secondary>cliente</secondary>
      </indexterm>

      <para>&man.ssh.1; funciona de manera 
        similar a &man.rlogin.1;.</para>

      <screen>&prompt.root; <userinput>ssh <replaceable>user@example.com</replaceable></userinput>
Host key not found from the list of known hosts.
Are you sure you want to continue connecting (yes/no)? <userinput>yes</userinput>
Host 'ejemplo.com' added to the list of known hosts.
usuario@ejemplo.com's password: <userinput>*******</userinput></screen>

      <para>El login continuar&aacute; como lo har&iacute;a si fuera 
        una sesi&oacute;n de <command>rlogin</command> o 
        <command>telnet</command>.  SSH utiliza un sistema de huellas de 
        llaves para verificar la autenticidad del servidor cuando el 
        cliente se conecta.  Se le pide al usuario que introduzca 
        <literal>yes</literal> solamente la primera vez que se 
        conecta.  Todos los intentos futuros de login se verifican 
        contra la huella de la llave guardada la primera vez.  
	El cliente SSH le alertar&aacute; si la huella guardada difiere 
        de la huella recibida en futuros intentos de acceso al sistema.  
        Las huellas se guardan en 
        <filename>~/.ssh/known_hosts</filename>, y en 
        <filename>~/.ssh/known_hosts2</filename> las huellas 
        SSH v2.</para>
        
      <para>Por defecto las versiones recientes de  
        los servidores <application>OpenSSH</application> solamente 
        aceptan conexiones SSH v2.  El cliente utilizar&aacute; la 
        versi&oacute;n 2 si es posible y pasar&aacute; como 
        respaldo a la versi&oacute;n 1.  El cliente puede tambi&eacute;n 
        ser obligado a utilizar una u otra pas&aacute;ndole 
	<option>-1</option> o <option>-2</option>, respectivamente para 
        la versi&oacute;n 1 y la  versi&oacute;n 2.  Se mantiene la 
	compatibilidad del cliente con la versi&oacute;n 1 para 
        mantener la compatibilidad con versiones antiguas.</para>
    </sect2>
    
    <sect2>
      <title>Copia segura</title>
      <indexterm>
        <primary>OpenSSH</primary>
        <secondary>copia segura</secondary>
      </indexterm>
      <indexterm><primary><command>scp</command></primary></indexterm>

      <para>&man.scp.1; funciona de manera muy similar a &man.rcp.1;; 
        copia un fichero desde o hacia un sistema remoto, con la 
	diferencia de que lo hace de una forma segura.</para>

      <screen>&prompt.root; <userinput> scp <replaceable>usuario@ejemplo.com:/COPYRIGHT COPYRIGHT</replaceable></userinput>
usuario@ejemplo.com's password: <userinput>*******</userinput>
COPYRIGHT            100% |*****************************|  4735       
00:00    
&prompt.root;</screen>

      <para>Ya que la huella se guard&oacute; en este equipo durante 
        el ejemplo anterior se verifica ahora al utilizar 
	&man.scp.1;.</para>

      <para>Los argumentos de &man.scp.1; son similares 
        a &man.cp.1;, con el fichero o ficheros como primer 
        argumento, y el destino como segundo.  Ya que el fichero 
        se transfiere a trav&eacute;s de la red, a trav&eacute;s de
        SSH, uno o m&aacute;s argumentos tienen la estructura 
	<option>user@host:&lt;ruta_al_fichero_remoto&gt;</option>.</para>

    </sect2>

    <sect2>
      <title>Configuraci&oacute;n</title>
      <indexterm>
        <primary>OpenSSH</primary>
        <secondary>configuraci&oacute;n</secondary>
      </indexterm>

      <para>Los ficheros de configuraci&oacute;n del sistema 
        tanto para el d&aelig;mon <application>OpenSSH</application> 
        como para el cliente est&aacute;n en 
	<filename>/etc/ssh</filename>.</para>

      <para><filename>ssh_config</filename> contiene las opciones 
        del cliente, mientras que <filename>sshd_config</filename> 
        configura el d&aelig;mon.</para>

      <para>Adem&aacute;s las opciones <option>sshd_program</option> 
        (<filename>/usr/sbin/sshd</filename> por defecto), 
        y <option>sshd_flags</option> de <filename>rc.conf</filename> 
        ofrecer m&aacute;s niveles de configuraci&oacute;n.</para>
    </sect2>

    <sect2 id="security-ssh-keygen">
      <title>ssh-keygen</title>

      <para>&man.ssh-keygen.1; le permite validar a un usuario sin 
        pedirle la contrase&ntilde;a:<</para>

      <screen>&prompt.user; <userinput>ssh-keygen -t <replaceable>dsa</replaceable></userinput>
Generating public/private dsa key pair.
Enter file in which to save the key (/home/user/.ssh/id_dsa):
Created directory '/home/user/.ssh'.
Enter passphrase (empty for no passphrase):
Enter same passphrase again:
Your identification has been saved in /home/user/.ssh/id_dsa.
Your public key has been saved in /home/user/.ssh/id_dsa.pub.
The key fingerprint is:
bb:48:db:f2:93:57:80:b6:aa:bc:f5:d5:ba:8f:79:17 usuario@host.ejemplo.com
</screen>

      <para>&man.ssh-keygen.1; crear&aacute; un par de llaves 
        p&uacute;blica y privada para usar en la validaci&oacute;n.  
        La llave privada se guarda en 
        <filename>~/.ssh/id_dsa</filename> o en 
        <filename>~/.ssh/id_rsa</filename>, mientras que la llave 
        p&uacute;blica se guarda en <filename>~/.ssh/id_dsa.pub</filename> 
        o en <filename>~/.ssh/id_rsa.pub</filename>, respectivamente para 
        llaves DSA y RSA.  La llave p&uacute;blica debe guardarse en 
        el <filename>~/.ssh/authorized_keys</filename> de la 
        m&aacute;quina remota para que la configuraci&oacute;n funcione.  
        Las llaves RSA versi&oacute;n 1 deben guardarse en 
        <filename>~/.ssh/authorized_keys</filename>.</para>

      <para>De este modo permitir&aacute; conexiones a la m&aacute;quina 
        remota mediante llaves SSH en lugar de contrase&ntilde;as.</para>

      <para>Si usa una contrase&ntilde;a al ejecutar &man.ssh-keygen.1;, se 
        le pedir&aacute; al usuario una contrase&ntilde;a cada 
        vez que quiera utilizar la llave privada.  &man.ssh-agent.1; 
        puede evitar la molestia de introducir repetidamente 
        frases largas.   esto se explica  m&aacute; adelante, en la 
        <xref linkend="security-ssh-agent">.</para>

      <warning><para>Las opciones y ficheros pueden ser 
        diferentes seg&uacute;n la versi&oacute;n de 
	<application>OpenSSH</application> que tenga en su sistema;  para 
	evitar problemas consulte la p&aacute;gina de manual 
        &man.ssh-keygen.1;.</para></warning>
    </sect2>

    <sect2 id="security-ssh-agent">
      <title>ssh-agent y ssh-add</title>

      <para>&man.ssh-agent.1; y &man.ssh-add.1; ofrecen 
        m&eacute;todos para que las llaves <application>SSH</application> 
        se puedan cargar en memoria, permitiendo eliminar la necesidad de 
	teclear la contrase&ntilde;a cada vez que haga falta.</para>

      <para>&man.ssh-agent.1; gestionar&aacute; la 
        validaci&oacute;n utilizando la llave (o llaves) privada que  
        le cargue.  &man.ssh-agent.1; se usa para lanzar otras 
        aplicaciones.  En el nivel m&aacute;s b&aacute;sico 
        puede generar una shell o a un nivel m&aacute;s avanzado un 
        gestor de ventanas.<para>

      <para>Para usar &man.ssh-agent.1; en una shell necesitar&aacute; 
        primero ser invocado como argumento por una shell.  Segundo, 
        a&ntilde;ada la identidad ejecutando &man.ssh-add.1; y facilitando 
        la contrase&ntilde;a de la llave privada.  Completados estos 
        pasos el usuario puede hacer &man.ssh.1; a cualquier equipo 
        que tenga instalada la llave p&uacute;blica correspondiente.  
        Por ejemplo:</para>

      <screen>&prompt.user; ssh-agent <replaceable>csh</replaceable>
&prompt.user; ssh-add
Enter passphrase for /home/user/.ssh/id_dsa:
Identity added: /home/user/.ssh/id_dsa (/home/user/.ssh/id_dsa)
&prompt.user;</screen>

      <para>Para utilizar &man.ssh-agent.1; en X11 tendr&aacute; que 
        incluir una llamada a &man.ssh-agent.1; en 
        <filename>~/.xinitrc</filename>.  De este modo ofrecer&aacute; 
        los servicios de &man.ssh-agent.1; a todos los programas 
	lanzados en X11.  Veamos un ejemplo de 
        <filename>~/.xinitrc</filename>:</para>

      <programlisting>exec ssh-agent <replaceable>startxfce4</replaceable></programlisting>

      <para>Esto lanzar&iacute;a &man.ssh-agent.1;, que a su 
        vez lanzar&iacute;a <application>XFCE</application> cada 
        vez que inicie X11.  Hecho esto y una vez reiniciado X11 
        para aplicar los cambios puede ejecutar &man.ssh-add.1; para 
	cargar todas sus llaves SSH.</para>
    </sect2>

    <sect2 id="security-ssh-tunneling">
      <title>T&uacute;neles SSH</title>
      <indexterm>
        <primary>OpenSSH</primary>
        <secondary>t&uacute;neles</secondary>
      </indexterm>

      <para><application>OpenSSH</application> permite crear un t&uacute;nel 
        en el que encapsular otro protocolo en una sesi&oacute;n 
	cifrada.</para>

      <para>La siguiente orden le dice a &man.ssh.1; que cree un 
        t&uacute;nel para <application>telnet</application>:</para>

       <screen>&prompt.user; <userinput>ssh -2 -N -f -L <replaceable>5023:localhost:23 usuario@foo.ejemplo.com</replaceable></userinput>
&prompt.user;</screen>

      <para>Veamos las opciones que se le han suministrado a 
        <command>ssh</command>:</para>

      <variablelist>
	<varlistentry>
	  <term><option>-2</option></term>
	  
	  <listitem>
            <para>Obliga a <command>ssh</command> a utilizar la 
              versi&oacute;n 2 del protocolo.  (No la use si 
              est&aacute; trabajando con servidores SSH antiguos)</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-N</option></term>

	  <listitem>
            <para>Indica que no se ejecutar&aacute; una orden remota, o 
	      solamente t&uacute;nel.  Si se omite, 
              <command>ssh</command> iniciar&iacute;a una sesi&oacute;n 
              normal.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-f</option></term>

	  <listitem>
            <para>Obliga a <command>ssh</command> a ejecutarse 
              en segundo plano.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-L</option></term>

	  <listitem>
            <para>Indica un t&uacute;nel local seg&uacute;n el esquema 
              <replaceable>puerto local:equipo remoto:puerto remoto</replaceable>.</para>
	  </listitem>
	  </varlistentry>

	<varlistentry>
	  <term><option>usuario@foo.ejemplo.com</option></term>

	  <listitem>
	    <para>El servidor SSH remoto.</para>
	  </listitem>
	</varlistentry>
      </variablelist>


       <para>Un t&uacute;nel SSH crea un socket que escucha 
         en <hostid>localhost</hostid> en el puerto especificado.  
         Luego reenv&iacute;a cualquier conexi&oacute;n 
         recibida en el puerto/equipo local v&iacute;a la 
         conexi&oacute;n SSH al puerto o equipo remoto especificado.</para>

      <para>En el ejemplo el puerto <replaceable>5023</replaceable> en 
        <hostid>localhost</hostid> se reenv&iacute;a al puerto 
        <replaceable>23</replaceable> del <hostid>localhost</hostid> 
        de la m&aacute;quina remota.  Ya que <replaceable>23</replaceable> 
        es <application>telnet</application>, esto crear&iacute;a una 
	sesi&oacute;n <application>telnet</application> segura a 
        trav&eacute;s de un t&uacute;nel SSH.</para>

      <para>Puede usar esto para encapsular cualquier otro 
        protocolo TCP inseguro como SMTP, POP3, FTP, etc.</para>

      <example>
	<title>Uso de SSH para crear un t&uacute;nel seguro para SMTP</title>

        <screen>&prompt.user; <userinput>ssh -2 -N -f -L <replaceable>5025:localhost:25 usuario@correo.ejemplo.com</replaceable></userinput>
usuario@correo.ejemplo.com's password: <userinput>*****</userinput>
&prompt.user; <userinput>telnet localhost 5025</userinput>
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.
220 correo.ejemplo.com ESMTP</screen>     

	<para>Puede usar esta t&eacute;cnica junto con &man.ssh-keygen.1; 
	  y cuentas adicionales de usuario para crear un entorno 
	  m&aacute;s transparente, esto es, m&aacute;s c&oacute;modo.  
	  Puede usar llaves en lugar de teclear contrase&ntilde;as y 
	  puede ejecutar los t&uacute;neles de varios usuarios.</para>
      </example>

      <sect3>
	<title>Ejemplos pr&aacute;cticos de t&uacute;neles SSH</title>

	<sect4>
	  <title>Acceso seguro a un servidor POP3</title>

          <para>En el trabajo hay un servidor SSH que acepta 
            conexiones desde el exterior.  En la misma red de la 
            oficina reside un servidor de correo que ejecuta un 
            servidor POP3.  La red, o ruta de red entre su casa y
            oficina puede o no ser completamente de fiar.  Debido 
            a esto necesita revisar su correo electr&oacute;nico 
            de forma segura.  La soluci&oacute;n es crear una 
            conexi&oacute;n SSH al servidor SSH de su oficina y 
            llegar por un t&uacute;nel al servidor de correo.</para>

	  <screen>&prompt.user; <userinput>ssh -2 -N -f -L <replaceable>2110:correo.ejemplo.com:110 usuario@servidor-ssh.ejemplo.com</replaceable></userinput>
usuario@servidor-ssh.ejemplo.com's password: <userinput>******</userinput></screen>

          <para>cuando el t&uacute;nel est&eacute; funcionando 
            haga que su cliente de correo env&iacute;e peticiones 
            POP3 a <hostid>localhost</hostid> en el puerto 2110.  
            La conexi&oacute;n ser&aacute; reenviada de forma totalmente 
            segura a trave&eacute;s del t&uacute;nel a 
	    <hostid>correo.ejemplo.com</hostid>.</para>
	</sect4>

	<sect4>
	  <title>Saltarse un cortafuegos draconiano</title>

          <para>Algunos administradores de red imponen reglas de 
            cortafuegos extremadamente draconianas, filtrando no 
            solo las conexiones entrantes, sino tambi&eacute;n 
            las salientes.  Tal vez solo se le otorgue acceso 
            a m&aacute;quinas remotas a trav&eacute;s de los puertos 22
            y 80 para ssh y navegar en web.</para>

          <para>Tal vez quiera acceder a otros servicios 
	    (que tal vez ni siquiera est&eacute;n relacionados con el 
	    trabajo), como un servidor Ogg Vorbis para escuchar 
	    m&uacute;sica.  Si ese servidor Ogg Vorbis transmite en 
	    un puerto que no sea el 22 o el 80 no podr&aacute; tener 
	    acceso a &eacute;l.</para>

          <para>La soluci&oacute;n es crear una conexi&oacute;n SSH 
            fuera del cortafuegos de su red y utilizarla para hacer un 
            t&uacute;nel al servidor Ogg Vorbis.</para>

	  <screen>&prompt.user; <userinput>ssh -2 -N -f -L <replaceable>8888:musica.ejemplo.com:8000 usuario@sistema-no-filtrado.ejemplo.org</replaceable></userinput>
usuario@sistema-no-filtrado.ejemplo.org's password: <userinput>*******</userinput></screen>

	  <para>Haga que el programa con el que suele escuchar 
	    m&uacute;sica haga peticiones a 
            <hostid>localhost</hostid> puerto 8888, que ser&aacute; 
            reenviado a <hostid>musica.ejemplo.com</hostid> 
            puerto 8000, evadiendo con &eacute;xito el cortafuegos.</para>
        </sect4>
      </sect3>
    </sect2>

    <sect2>
      <title>La opci&oacute;n de usuarios <varname>AllowUsers</varname></title>

      <para>Limitar qu&eacute; usuarios pueden entrar y desde d&oacute;nde 
        suele ser razonable.  La opci&oacute;n 
        <literal>AllowUsers</literal> le permite configurarlo, por 
        ejemplo, para permitir entrar solamente al usuario 
        <username>root</username> desde 
        <hostid role="ipaddr">192.168.1.32</hostid>.  Puede hacerlo 
	con algo parecido a esto en 
        <filename>/etc/ssh/sshd_config</filename>:</para>

      <programlisting>AllowUsers root@192.168.1.32</programlisting>

      <para>Para permitir al usuario <username>admin</username> la 
        entrada desde cualquier lugar, solamente introduzca el nombre 
        de usuario:</para>

      <programlisting>AllowUsers admin</programlisting>

      <para>Puede listar m&uacute;ltiples usuarios en la misma 
        l&iacute;nea:</para>
        

      <programlisting>AllowUsers root@192.168.1.32 admin</programlisting>

      <note>
        <para>Es importante que incluya a cada usuario que necesite entrar 
          a esta m&aacute;quina o no podr&aacute;n entrar.</para>
      </note>

      <para>Despu&eacute;s de hacer los cambios a b
        <filename>/etc/ssh/sshd_config</filename> debe decirle a 
        &man.sshd.8; que cargue de nuevo sus ficheros de 
        configuraci&oacute;n ejecutando:</para>

      <screen>&prompt.root; <userinput>/etc/rc.d/sshd reload</userinput></screen>
    </sect2>

    <sect2>
      <title>Lecturas complementarias</title>
      <para><ulink url="http://www.openssh.com/">OpenSSH</ulink></para>
      <para>&man.ssh.1; &man.scp.1; &man.ssh-keygen.1; 
        &man.ssh-agent.1; &man.ssh-add.1; &man.ssh.config.5;</para>
      <para>&man.sshd.8; &man.sftp-server.8; &man.sshd.config.5;</para>
    </sect2>
  </sect1>

  <sect1 id="fs-acl">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Contribuido por </contrib>
	</author>
      </authorgroup>
    </sect1info>
    <indexterm>
      <primary>ACL</primary>
    </indexterm>
    <title>Listas de control de acceso a sistemas de ficheros</title>

    <para>Adem&aacute;s de otras mejoras del sistema de ficheros como 
      las instant&aacute;neas (<quote>snapshots</quote>), &os; 5.0 y 
      siguientes ofrecen las ACL (<quote>Access Control Lists</quote>, 
      listas de control de acceso) como un elemento m&aacute;s de 
      seguridad.</para>

    <para>Las listas de control de acceso extienden el modelo de 
      permisos est&aacute;ndar de &unix; de una manera altamente 
      compatible (&posix;.1e).  Esta opci&oacute;n permite al 
      administrador usar con gran provecho un modelo de seguridad 
      m&aacute;s sofisticado.</para>

    <para>Para habilitar soporte de <acronym>ACL</acronym> en sistemas 
      de ficheros <acronym>UFS</acronym> la siguiente opci&oacute;n:</para>
      
    <programlisting>options UFS_ACL</programlisting>

    <para>debe ser compilada en el kernel.  Si esta opci&oacute;n 
      no ha sido compilada, se mostrar&aacute; un mensaje de advertencia 
      si se intenta montar un sistema de ficheros que soporte 
      <acronym>ACL</acronym>.  Esta opci&oacute;n viene incluida 
      en el kernel <filename>GENERIC</filename>.  
      Las <acronym>ACL</acronym> dependen de los atributos extendidos 
      habilitados en el sistema de ficheros.  Los atributos extendidos 
      est&aacute;n incluidos por defecto en la nueva generaci&oacute;n 
      de sistemas de ficheros &unix; <acronym>UFS2</acronym>.</para>

    <note><para>Los atributos extendidos pueden usarse tambi&eacute;n 
      en <acronym>UFS1</acronym> pero requieren una carga de trabajo 
      mucho m&aacute;s elevada que en <acronym>UFS2</acronym>.  
      El rendimiento de los atributos extendidos es, tambi&eacute;n, 
      notablemente mayor en <acronym>UFS2</acronym>.  Por todo esto 
      si quiere usar ACL le recomendamos encarecidamente que use 
      <acronym>UFS2</acronym>.</para></note>

    <para>Las<acronym>ACL</acronym> se habilitadan mediante una bandera 
      administrativa durante el montaje, <option>acls</option>, en el fichero 
      <filename>/etc/fstab</filename>.  La bandera de montaje puede 
      tambi&eacute;n activarse de forma permanente mediante 
      &man.tunefs.8; para modificar una bandera de superbloque 
      <acronym>ACLs</acronym> en la cabecera del sistema de ficheros.  
      En general es preferible usar la bandera de superbloque por 
      varios motivos:</para>

    <itemizedlist>
      <listitem>
       <para>La bandera de montaje <acronym>ACL</acronym> no puede cambiarse 
         por un remontaje (&man.mount.8; <option>-u</option>), sino con un 
         completo &man.umount.8; y un &man.mount.8;.  Esto significa 
         que no se pueden habilitar las <acronym>ACL</acronym> en el sistema 
         de ficheros ra&iacute;z despu&eacute;s del arranque.  Tambi&eacute;n 
	 significa que no se puede cambiar la disposici&oacute;n de un 
         de ficheros una vez que se ha comenzado a usar.</para>
      </listitem>

      <listitem>
        <para>Activar la bandera de superbloque provocar&aacute; que el sistema 
          de ficheros se monte siempre con las <acronym>ACL</acronym> 
	  habilitadas incluso si no existe una entrada en 
          <filename>fstab</filename> o si los dispositivos se reordenan.  
          Esto es as&iacute; para prevenir un montaje accidental del 
          sistema de ficheros sin tener las <acronym>ACL</acronym> habilitadas, 
          que podr&iacute;a resultar en que se impongan de forma inadecuada las 
          <acronym>ACL</acronym>, y en consecuencia problema de 
	  seguridad.</para>
      </listitem>
    </itemizedlist>

    <note><para>Podemos cambiar el comportamiento de las 
      <acronym>ACL</acronym> para permitirle a la bandera ser habilitada 
      sin un &man.mount.8; completo, pero puede salirle el tiro por la 
      culata si activa las <acronym>ACL</acronym>, luego las desactiva, 
      y despu&eacute;s las vuelve a activar sin configurar desde cero las 
      atributos extendidos.  En general, una vez que se han deshabilitado 
      las <acronym>ACL</acronym> en un sistema de ficheros no deben 
      dehabilitarse, ya que la protecci&oacute;n de ficheros resultante 
      puede no ser compatible las que esperan los usuarios del sistema, 
      y al volver a activar las <acronym>ACL</acronym> volver a asignar 
      las <acronym>ACL</acronym> a ficheros cuyos permisos hubieran sido 
      cambiados, lo que puede desenbocar en un escenario 
      impredecible.</para></note>
      
    <para>Los sistemas de ficheros con <acronym>ACL</acronym> habilitadas 
      tienen un signo <literal>+</literal> (m&aacute;s) al visualizar 
      sus configuraciones de permisos.  Por ejemplo:</para>

    <programlisting>drwx------  2 robert  robert  512 Dec 27 11:54 private
drwxrwx---+ 2 robert  robert  512 Dec 23 10:57 directorio1
drwxrwx---+ 2 robert  robert  512 Dec 22 10:20 directorio2
drwxrwx---+ 2 robert  robert  512 Dec 27 11:57 directorio3
drwxr-xr-x  2 robert  robert  512 Nov 10 11:54 public_html</programlisting>

    <para>Aqu&iacute; vemos que los directorios 
      <filename>directorio1</filename>, 
      <filename>directorio2</filename>, y <filename>directorio3</filename> 
      est&aacute;n usando <acronym>ACL</acronym>.  
      El directorio <filename>public_html</filename> no.</para>

    <sect2>
      <title>Uso de <acronym>ACL</acronym></title>

      <para>Las <acronym>ACL</acronym>s del sistema de ficheros pueden 
        comprobarse con &man.getfacl.1;.  Por ejemplo, 
        para ver las configuraciones de <acronym>ACL</acronym> del 
        fichero <filename>test</filename>, uno podr&iacute;a 
        usar lo siguiente:</para>

      <screen>&prompt.user; <userinput>getfacl <filename>test</filename></userinput>
	#file:test
	#owner:1001
	#group:1001
	user::rw-
	group::r--
	other::r--</screen>

      <para>Para cambiar las configuraciones de las <acronym>ACL</acronym> en 
        este fichero use &man.setfacl.1;.  Observe:</para>

      <screen>&prompt.user; <userinput>setfacl -k <filename>test</filename></userinput></screen>

      <para>La bandera <option>-k</option> eliminar&aacute; todas 
        las <acronym>ACL</acronym>s definidas para un fichero o sistema 
        ficheros.  El m&eacute;todo preferible ser&iacute;a utilizar 
        <option>-b</option>, ya que deja los campos b&aacute;sicos 
        imprescindibles para que las <acronym>ACL</acronym> sigan 
	funcionando.</para>

      <screen>&prompt.user; <userinput>setfacl -m u:trhodes:rwx,group:web:r--,o::--- <filename>test</filename></userinput></screen>

      <para>La opci&oacute;n <option>-m</option> se usa para modificar 
        las entradas por defecto de las <acronym>ACL</acronym>.  
        Debido a que no hab&iacute;a entradas predefinidas puesto que 
        fueron eliminadas por la orden anterior, restauraremos las 
        opciones por defecto y asignar&aacute; las opciones listadas.  
	Tenga en cuenta que si a&ntilde;ade un nuevo usuario o grupo 
	aparecer&aacute; el error <errorname>Invalid argument</errorname> 
	en la salida est&aacute;ndar 
	<devicename>stdout</devicename>.</para>
    </sect2>
  </sect1>

  <sect1 id="security-portaudit">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Texto de </contrib>
	</author>
      </authorgroup>
    </sect1info>

    <indexterm>
      <primary>Portaudit</primary>
    </indexterm>
    <title>Monitorizaci&oacute;n de fallos de seguridad de aplicaciones</title>

    <para>En estos &uacute;ltimos a&ntilde;os el mundo de la seguridad 
      ha hecho grandes avances en cuanto a la gesti&oacute;n de las 
      vulnerabilidades.  La amenaza de asaltos a los sistemas se 
      incrementa cuando se instalan y configuran aplicaciones de 
      muy diversas procedencias en virtualmente cualquier sistema 
      operativo disponible.</para>

    <para>La evaluaci&oacute;n de vulnerabilidades es un factor 
      clave en la seguridad; aunque &os; libere avisos de seguridad 
      relacionados con el sistema base, llevar la gesti&oacute;n 
      de vulnerabilidades hasta cada aplicaci&oacute;n que se puede 
      instalar en &os; va mucho m&aacute;s all&aacute; de la capacidad 
      del proyecto &os;.  A pesar de esto existe una forma de 
      mitigar las vulnerabilidades de esas aplicaciones y advertir 
      a los administradores sobre los problemas de seguridad a 
      medida que se detectan.  <application>Portaudit</application> 
      existe para hacer ese trabajo.</para>

    <para>El port <filename role="port">security/portaudit</filename> 
      consulta una base de datos, actualizada y mantenida por el 
      equipo de seguridad y por los desarrolladores de &os; en busca de 
      incidentes de seguridad que hayan sido detectados.</para>

    <para>Si quiere usar <application>Portaudit</application> 
      inst&aacute;lelo desde la colecci&oacute;n de ports:</para>

    <screen>&prompt.root; <userinput>cd /usr/ports/security/portaudit && make install clean</userinput></screen>

    <para>Durante el proceso de instalaci&oacute;n los ficheros 
      de configuraci&oacute;n de &man.periodic.8; se actualizan 
      haciendo que <application>Portaudit</application> 
      aparezca en el mensaje sobre la seguridad del sistema que diariamente 
      Recuerde que ese correo (que se envia a la cuenta 
      <username>root</username> es muy importante y deber&iacute;a 
      leerlo.  No hay ninguna 
      configuraci&oacute;n que deba modificar o crear.</para>

    <para>Despu&eacute;s de la instalaci&oacute;n un administrador debe 
      actualizar la base de datos alojada en local en 
      <filename role="directory">/var/db/portaudit</filename> 
      mediante:</para>

    <screen>&prompt.root; <userinput>portaudit -F</userinput></screen>

    <note>
      <para>La base de datos ser&aacute; actualizada 
        autom&aacute;ticamente durante la ejecuci&oacute;n de 
	&man.periodic.8;; as&iacute; que la orden anterior es 
	totalmente opcional.  Solo se necesita para los siguientes 
        ejemplos.</para>
    </note>

    <para>Si quiere comproblar si entre las aplicaciones que haya 
      instalado desde el &aacute;rbol de ports en su sistema hay 
      problemas de seguridad s&oacute;lo tiene que ejecutar lo 
      siguiente:</para>

    <screen>&prompt.root; <userinput>portaudit -a</userinput></screen>

    <para>Este es un ejemplo de la salida:</para>

    <programlisting>Affected package: cups-base-1.1.22.0_1
Type of problem: cups-base -- HPGL buffer overflow vulnerability.
Reference: &lt;http://www.FreeBSD.org/ports/portaudit/40a3bca2-6809-11d9-a9e7-0001020eed82.html&gt;

1 problem(s) in your installed packages found.

You are advised to update or deinstall the affected package(s) immediately.</programlisting>

    <para>El administrador del sistema obtendr&aacute; mucha m&aacute;s 
      informaci&oacute;n sobre el problema de seguridad dirigiendo su 
      navegador web a la <acronym>URL</acronym> que aparece en el 
      mensaje.  Esto incluye versiones afectadas (por versi&oacute;n de 
      port de &os;), junto con otros sitios web que contengan advertencias 
      de seguridad.</para>

    <para>En pocas palabras, <application>Portaudit</application> es un 
      programa muy poderoso y extremadamente &uacute;til cuando se 
      combina con el port <application>Portupgrade</application>.</para>
  </sect1>

  <sect1 id="security-advisories">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Texto de </contrib>
	</author>
      </authorgroup>
    </sect1info>
    <indexterm>
      <primary>Advertencias de seguridad en FreeBSD</primary>
    </indexterm>
    <title>&os; Security Advisories</title>

    <para>Como muchos sistemas operativos con calidad de producci&oacute;n, 
      &os; publica <quote>Security Advisories</quote> (advertencias de 
      seguridad.   Estas advertencias suelen enviarse por correo a las 
      listas de seguridad e incluidas en la Errata solamente despu&eacute;s 
      de que la versi&oacute;n apropiada haya sido corregida.  Esta 
      secci&oacute;n tiene como fin explicar en qu&eacute; consiste una 
      advertencia de seguridad, c&oacute;mo entenderla y qu&eacute; 
      medidas hay que tomar para parchear el sistema.</para>

    <sect2>
      <title>&iquest;Qu&eacute; aspecto tiene una advertencia de 
        seguridad?</title>

      <para>Las advertencias de seguridad de &os; tienen un aspecto 
        similar a la que se muestra aqu&iacute;.  Fu&eacute; enviada a la 
        lista de correo &a.security-notifications.name;.</para>

      <programlisting>=============================================================================
&os;-SA-XX:XX.UTIL                                     Security Advisory
                                                          The &os; Project

Topic:          denial of service due to some problem<co id="co-topic">

Category:       core<co id="co-category">
Module:         sys<co id="co-module">
Announced:      2003-09-23<co id="co-announce">
Credits:        Person@EMAIL-ADDRESS<co id="co-credit">
Affects:        All releases of &os;<co id="co-affects">
                &os; 4-STABLE prior to the correction date
Corrected:      2003-09-23 16:42:59 UTC (RELENG_4, 4.9-PRERELEASE)
                2003-09-23 20:08:42 UTC (RELENG_5_1, 5.1-RELEASE-p6)
                2003-09-23 20:07:06 UTC (RELENG_5_0, 5.0-RELEASE-p15)
                2003-09-23 16:44:58 UTC (RELENG_4_8, 4.8-RELEASE-p8)
                2003-09-23 16:47:34 UTC (RELENG_4_7, 4.7-RELEASE-p18)
                2003-09-23 16:49:46 UTC (RELENG_4_6, 4.6-RELEASE-p21)
                2003-09-23 16:51:24 UTC (RELENG_4_5, 4.5-RELEASE-p33)
                2003-09-23 16:52:45 UTC (RELENG_4_4, 4.4-RELEASE-p43)
                2003-09-23 16:54:39 UTC (RELENG_4_3, 4.3-RELEASE-p39)<co id="co-corrected">
&os; only:   NO<co id="co-only">

For general information regarding FreeBSD Security Advisories,
including descriptions of the fields above, security branches, and the
following sections, please visit
http://www.FreeBSD.org/security/.

I.   Background<co id="co-backround">


II.  Problem Description<co id="co-descript">


III. Impact<co id="co-impact">


IV.  Workaround<co id="co-workaround">


V.   Solution<co id="co-solution">


VI.  Correction details<co id="co-details">


VII. References<co id="co-ref"></programlisting>


      <calloutlist>
	<callout arearefs="co-topic">
          <para>El campo <literal>Topic</literal> indica cu&aacute;l es 
	    exactamente el problema.  B&aacute;sicamente es la 
            introducci&oacute;n de la advertencia de seguridad actual 
            e indica el uso malintencionado que puede darse a la 
	    vulnerabilidad.</para>
	</callout>

	<callout arearefs="co-category">
          <para><literal>Category</literal> se refiere a la parte afectada del 
	    sistema, que puede ser 
            <literal>core</literal>, <literal>contrib</literal> o 
            <literal>ports</literal>.  La categor&iacute;a 
	    <literal>core</literal> significa que la vulnerabilidad afecta 
            a un componente central del sistema operativo &os;.  La 
            categor&iacute;a <literal>contrib</literal> significa que la 
            vulnerabilidad afecta a software que no ha sido desarrollado por 
            el proyecto &os;, como <application>sendmail</application>.  
            La categor&iacute;a <literal>ports</literal> indica que la 
            vulnerabilidad afecta a software incluido en la colecci&oacute;n 
            de ports.</para>
	</callout>

	<callout arearefs="co-module">
          <para>El campo <literal>Module</literal> se refiere a la 
	    ubicaci&oacute;n del componente, por ejemplo 
            <literal>sys</literal>.  En este ejemplo vemos que est&aacute; 
            afectado el m&oacute;dulo <literal>sys</literal>; 
	    por lo tanto esta vulnerabilidad afecta a componentes 
            utilizados dentro del kernel.</para>
	</callout>

	<callout arearefs="co-announce">
          <para>El campo <literal>Announced</literal> refleja la fecha 
            de publicaci&oacute;n de la advertencia de seguridad fu&eacute; 
	    publicada o anunciada al mundo.  Esto significa que el equipo 
            de seguridad ha verificado que el que el problema existe y que 
	    se ha incluido un parche que soluciona el problema en el 
	    repositorio de c&oacute;digo fuente de &os;.</para>
	</callout>

	<callout arearefs="co-credit">
          <para>El campo <literal>Credits</literal> le da el cr&eacute;dito al
            individuo u organizaci&oacute;n que descubri&oacute; y report&oacute;
            la vulnerabilidad.</para>
	</callout>

	<callout arearefs="co-affects">
          <para>El campo <literal>Affects</literal> explica a qu&eacute; 
	    versiones de &os; afecta esta vulnerabilidad.  En el caso del 
	    kernel una r&aacute;pida revisi&oacute;n de la salida de 
            <command>ident</command> en los ficheros afectados 
            ayudar&aacute; a determinar la versi&oacute;n.  En el caso de 
            de los ports el n&uacute;mero de versi&oacute;n aparece 
            despu&eacute;s del nombre del port en 
            <filename>/var/db/pkg</filename>.  Si el sistema no se 
            sincroniza con el repositorio <acronym>CVS</acronym> de 
            &os; y se reconstruye diariamente, existe la posibilidad de 
            que est&eacute; afectado por el problema de seguridad.</para>
	</callout>

	<callout arearefs="co-corrected">
          <para>El campo <literal>Corrected</literal> indica la fecha, hora, 
            zona horaria y versi&oacute;n de &os; en que fu&eacute; 
	    corregido.</para>
	</callout>

	<callout arearefs="co-only">
          <para>El campo <literal>&os; only</literal> indica si la 
	    vulnerabilidad afecta solamente a &os; o si afecta 
            tambi&eacute;n a otros sistemas operativos.</para>
	</callout>

	<callout arearefs="co-backround">
          <para>El campo <literal>Background</literal> informa acerca de 
            qu&eacute; es exactamente la aplicaci&oacute;n afectada. 
	    La mayor parte de las veces se refiere a por qu&eacute; la 
            aplicaci&oacute;n existe en &os;, para qu&eacute; se usa y 
            un poco de informaci&oacute;n de c&oacute;mo lleg&oacute; 
	    lleg&oacute; a ocupar el lugar que ocupa en el sistema o el 
	    &aacute;rbol de ports.</para>
	</callout>

	<callout arearefs="co-descript">
          <para>El campo <literal>Problem Description</literal> explica el 
	    problema de seguridad en profundidad.  Puede incluir 
            informaci&oacute;n del c&oacute;digo err&oacute;neo, 
            o incluso c&oacute;mo puede usarse maliciosamente el error 
            para abrir un agujero de seguridad.</para>
	</callout>

	<callout arearefs="co-impact">
          <para>El campo <literal>Impact</literal> describe el tipo de 
            impacto que el problema pueda tener en un sistema.  Por ejemplo, 
            esto puede ser desde un ataque de denegaci&oacute;n de servicio, 
            hasta una escalada de privilegios de usuario, o incluso 
            ofrecer al atacante acceso de superusuario.</para>
	</callout>

	<callout arearefs="co-workaround">
          <para>El campo <literal>Workaround</literal> ofrece una 
	    soluci&oacute;n temoral posible para los administradores 
            de sistemas que tal vez no puedan actualizar el sistema.  
            Esto puede deberse a la falta de tiempo, disponibilidad de 
            de red, o a muchas otras razones.  A pesar de todo la 
            la seguridad no se debe tomar a la ligera y un sistema 
            afectado debe parchearse al menos aplicar una 
            soluci&oacute;n temporal para el agujero de 
	    seguridad.</para>
	</callout>

	<callout arearefs="co-solution">
          <para>El campo <literal>Solution</literal> ofrece instrucciones 
            para parchear el sistema afectado.  Este es un m&eacute;todo paso 
            a paso, probado y verificado para parchear un sistema y que 
            trabaje seguro.</para>
	</callout>

	<callout arearefs="co-details">
          <para>El campo <literal>Correction Details</literal> despliega 
            la rama del <acronym>CVS</acronym> o el nombre de la 
            versi&oacute;n con los puntos cambiados a guiones bajos.  
	    Tambi&eacute;n muestra el n&uacute;mero de revisi&oacute;n de 
            los ficheros afectados dentro de cada rama.</para>
	</callout>

	<callout arearefs="co-ref">
          <para>El campo <literal>References</literal> suele ofrecer fuentes 
	    adicionales de informaci&oacute;n: 
            <acronym>URL</acronym>, libros, listas de correo y grupos 
	    de noticias.</para>
	</callout>
      </calloutlist>
    </sect2>
  </sect1>

  <sect1 id="security-accounting">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Texto de </contrib>
	</author>
      </authorgroup>
    </sect1info>
    <indexterm>
      <primary>Contabilidad de procesos</primary>
    </indexterm>
    <title>Contabilidad de procesos</title>

    <para>La contabilidad de procesos es un m&eacute;todo de 
      seguridad en el cual un administrador puede mantener un 
      seguimiento de los recursos del sistema utilizados, 
      su distribuci&oacute;n entre los usuarios, ofrecer 
      monitorizaci&oacute;n del sistema y seguir la pista 
      m&iacute;nimamente a las &oacute;rdenes de usuario.</para>

    <para>Esto en realidad tiene sus puntos positivos y negativos.  
      Uno de los positivos es que una intrusi&oacute;n puede 
      minimizarse en el momento de producirse.  Uno negativo 
      es la cantidad de logs generados por la contabilidad de 
      procesos y el espacio de disco que requieren.  Esta 
      secci&oacute;n guiar&aacute; al administrador a 
      trav&eacute;s de los fundamentos de la contabilidad de 
      procesos.</para>

    <sect2>
      <title>C&oacute;mo habilitar y utilizar la contabilidad 
        de procesos</title>

      <para>Antes de poder usar la contabilidad de procesos 
        tendr&aacute; que habilitarla.  Ejecute la 
        siguiente orden:</para>

      <screen>&prompt.root; <userinput>touch <filename>/var/account/acct</filename></userinput>

&prompt.root; <userinput>accton <filename>/var/account/acct</filename></userinput>

&prompt.root; <userinput>echo 'accounting_enable="YES"' &gt;&gt; <filename>/etc/rc.conf</filename></userinput></screen>

      <para>Una vez habilitada, la contabilidad de procesos 
        empezar&aacute; a seguir el rastro de estad&iacute;sticas 
        de la <acronym>CPU</acronym>, &oacute;rdenes, etc.  Todos los logs 
        de contabilidad est&aacute;n en un formato ilegible 
        para humanos, pero accesibles para &man.sa.8;.  
        Si se ejecuta sin opciones, <command>sa</command> 
        imprimir&aacute; informaci&oacute;n sobre el n&uacute;mero 
        de llamadas por usuario, el tiempo total transcurrido expresado 
        en minutos, el tiempo total de <acronym>CPU</acronym> y de usuario
        en minutos, el n&uacute;mero medio de operaciones de E/S, 
        etc.</para>

      <para>Para ver informaci&oacute;n acerca de las &oacute;rdenes 
        que se est&aacute;n ejecutados puede usar la 
        &man.lastcomm.1;.  <command>lastcomm</command> imprime 
        &oacute;rdenes ejecutadas por los usuarios en &man.ttys.5; 
        espec&iacute;ficas.  Veamos un ejemplo:</para>

      <screen>&prompt.root; <userinput>lastcomm ls
	<username>trhodes</username> ttyp1</userinput></screen>

      <para>Imprimir&iacute;a todas las veces (conocidas) que 
        el usuario <username>trhodes</username> ha usado 
	<command>ls</command> en la terminal 
        ttyp1.</para>

      <para>Hay muchas m&aacute;s opciones que pueden serle muy 
        &uacute;tiles.  Si quiere conocerlas consulte 
        las p&aacute;ginas de manual &man.lastcomm.1;, &man.acct.5; 
        y &man.sa.8;.</para>
    </sect2>
  </sect1>  
</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->

