<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     $Id: article.sgml,v 1.1 2002-04-20 21:07:09 gioria Exp $
     Original revision: 1.5
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN"> %man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN"> %freebsd;
<!ENTITY % urls PUBLIC "-//FreeBSD//ENTITIES Common Document URL Entities//FR"> %urls;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR"> %abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR"> %artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;

<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN"> %authors;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//FR"> %mailing-lists;
<!ENTITY rel.current CDATA "3.2">
]>

<article lang="fr">
  <articleinfo>
    <title>FreeBSD sur les ordinateurs portables</title>

    <pubdate>$FreeBSD$</pubdate>
   
    <abstract>
      <para>FreeBSD fonctionne bien sur la plupart des ordinateurs
	portables, en tenant compte de quelques avertissements.  Quelques 
	probl&egrave;mes sp&eacute;cifiques &agrave; l'utilisation de 
	FreeBSD sur ordinateurs portables, provenant d'exigences 
	mat&eacute;rielles diff&eacute;rentes de celles des stations de 
	travail, sont abord&eacute;s ci-dessous.</para>

	&abstract.license;
        &abstract.disclaimer;
        &trans.a.fonvieille;
    </abstract>
  </articleinfo>

    <para>On pense souvent &agrave; FreeBSD comme &eacute;tant un syst&egrave;me
      d'exploitation pour serveur, mais il fonctionne tr&egrave;s bien sur
      une station de travail, et si vous d&eacute;sirez l'utiliser sur votre
      ordinateur portable vous pouvez profiter de tous les avantages
      habituels: implantation syst&eacute;matique, administration et mise &agrave;
      jour ais&eacute;es, le syst&egrave;me de logiciels 
      port&eacute;s/pr&eacute;-compil&eacute;s pour
      ajouter des logiciels, et ainsi de suite (ses autres avantages,
      tels que la stabilit&eacute;, les performances r&eacute;seau, la 
      performance sous une charge importante, cela ne peut ne pas 
      &ecirc;tre &eacute;vident sur un portable, bien s&ucirc;r).  
      Cependant, l'installer sur des ordinateurs portables sous-entend 
      souvent des probl&egrave;mes qui ne sont pas rencontr&eacute;s 
      avec les stations de travail et qui ne sont 
      g&eacute;n&eacute;ralement pas d&eacute;battus (les portables, 
      bien plus que les stations de travail, sont r&eacute;gl&eacute;s 
      pour Microsoft Windows).  Cet article a pour but de discuter de 
      certains de ces probl&egrave;mes.</para>

  <sect1>    
    <title>XFree86</title>
      
    <para>Les versions r&eacute;centes d'XFree86 fonctionnent avec la 
      plupart des syst&egrave;mes d'affichage disponibles de nos jours 
      sur les ordinateurs portables.  L'acc&eacute;l&eacute;ration peut 
      ne pas &ecirc;tre support&eacute;e, mais une
      configuration SVGA g&eacute;n&eacute;rique devrait fonctionner.</para>

    <para>Avec la documentation de votre ordinateur portable
      d&eacute;terminez quelle carte vous disposez, et v&eacute;rifiez 
      dans la documentation d'XFree86 (ou dans le programme de 
      configuration) si elle est sp&eacute;cifiquement support&eacute;e.  
      Si non, utilisez un pilote g&eacute;n&eacute;rique (ne pas en 
      utiliser un pour son nom qui semble similaire &agrave; celui de 
      la carte).  Avec XFree86 version 4, vous
      pouvez tenter votre chance avec la commande <userinput>XFree86
      -configure</userinput> qui d&eacute;tecte automatiquement beaucoup 
      de configurations.</para>

    <para>Souvent le probl&egrave;me est de configurer l'&eacute;cran.  
      Les ressources g&eacute;n&eacute;rales pour XFree86 se concentrent 
      sur les moniteurs cathodiques; obtenir une modeline 
      ad&eacute;quate pour un &eacute;cran LCD peut s'av&eacute;rer 
      difficile.  Vous pouvez &ecirc;tre chanceux et ne pas avoir 
      &agrave; sp&eacute;cifier de modeline, ou juste pr&eacute;ciser 
      les plages HorizSync et VertRefresh qui conviennent.  Si cela ne 
      fonctionne pas, la meilleure option est de se r&eacute;f&eacute;rer 
      aux ressources web consacr&eacute;es &agrave; la configuration d'X 
      sur ordinateurs portables (ce sont souvent des sites 
      orient&eacute;s linux mais cela n'a pas d'importance parce que les 
      deux syst&egrave;mes utilisent XFree86) et copier une modeline
      post&eacute;e par quelqu'un pour un mat&eacute;riel similaire.</para>

    <para>La plupart des ordinateurs portables viennent avec deux
      boutons sur leur p&eacute;riph&eacute;rique de pointage, ce qui 
      est assez probl&eacute;matique sous X (&eacute;tant donn&eacute; 
      que le bouton du milieu est g&eacute;n&eacute;ralement 
      utilis&eacute; pour coller du texte); vous pouvez faire
      correspondre un click simultan&eacute; sur les boutons gauche et
      droite dans votre configuration d'X &agrave; un click sur le bouton 
      du milieu avec la ligne
      <programlisting>
      Option "Emulate3Buttons"
      </programlisting>
      dans le fichier XF86Config dans la section
      <literal>InputDevice</literal> (pour XFree86 version 4; pour la
      version 3, rajoutez juste la ligne <literal>Emulate3Buttons</literal>,
      sans guillemets, dans la section <literal>Pointer</literal>).
    </para>
  </sect1> 

  <sect1> 
    <title>Modems</title>
    <para>Les ordinateurs portables sont g&eacute;n&eacute;ralement 
      &eacute;quip&eacute;s de modems int&eacute;gr&eacute; (on-board).  
      Malheureusement, cela veut presque toujours dire que ce sont des 
      <quote>winmodems</quote> dont les fonctions sont 
      r&eacute;alis&eacute;es par logiciel, pour lesquels seuls des
      pilotes pour windows sont normalement disponibles (bien que
      quelques pilotes pour d'autres syst&egrave;mes commencent &agrave; 
      voir le jour).  Dans le cas contraire, vous avez besoin d'acheter un
      modem externe: la solution la plus compacte est un modem PC-Card
      (PCMCIA), abord&eacute; ci-dessous, mais un modem s&eacute;rie ou 
      USB peut &ecirc;tre moins cher.  G&eacute;n&eacute;ralement les 
      modems habituels (non-winmodems) devraient fonctionner correctement.
    </para>

  </sect1> 

  <sect1> 
    <title>P&eacute;riph&eacute;riques PCMCIA (PC-Card)</title>

    <para>La plupart des ordinateurs portables viennent avec des slots
      PCMCIA (aussi appel&eacute;s PC-Card); ceux-ci sont bien 
      support&eacute;s sous FreeBSD.  Examinez vos messages de 
      d&eacute;marrage (en utilisant dmesg) et regardez si ces derniers 
      ont &eacute;t&eacute; d&eacute;tect&eacute; correctement (ils
      devraient appara&icirc;tre comme <devicename>pccard0</devicename>,
      <devicename>pccard1</devicename> etc sur des 
      p&eacute;riph&eacute;riques comme
      <devicename>pcic0</devicename>).</para>

    <para>FreeBSD supporte actuellement les cartes PCMCIA 16-bits,
      mais pas les cartes 32-bits (<quote>CardBus</quote>).  Une base
      de donn&eacute;es des cartes support&eacute;es se trouve dans le 
      fichier <filename>/etc/defaults/pccard.conf</filename>.  
      Examinez-la, et achetez de pr&eacute;f&eacute;rence des cartes 
      list&eacute;es.  Les cartes non list&eacute;es
      peuvent aussi fonctionner comme p&eacute;riph&eacute;riques
      <quote>g&eacute;n&eacute;riques</quote>: en particulier la plupart 
      des modems (16-bits) devraient fonctionner parfaitement, 
      d&egrave;s lors que ce ne sont pas des winmodems (ils existent 
      aussi m&ecirc;me en mod&egrave;les PC-Card, donc faites attention). 
      Si votre carte est reconnue en tant que modem 
      g&eacute;n&eacute;rique, notez que le fichier pccard.conf de 
      d&eacute;faut sp&eacute;cifie un d&eacute;lai de 10 secondes 
      (pour &eacute;viter le blocage de certains modems); cela peut 
      &ecirc;tre bien plus que n&eacute;cessaire pour votre 
      mod&egrave;le, donc vous pouvez avoir envie de le modifier, le
      r&eacute;duire ou le retirer totalement.</para>

    <para>Certaines parties de <filename>pccard.conf</filename>
      peuvent n&eacute;cessiter une &eacute;dition.  Contr&ocirc;ler la 
      ligne irq, et soyez s&ucirc;r de retirer les nombres 
      d&eacute;j&agrave; utilis&eacute;s: en particulier si vous avez 
      une carte son int&eacute;gr&eacute;e, retirez l'irq 5 (sinon
      vous risquez de subir des blocages quand vous ins&eacute;rez une
      carte). V&eacute;rifiez &eacute;galement le slot m&eacute;moire 
      disponible; si votre carte n'est pas d&eacute;tect&eacute;e, 
      essayez de le changer pour une autre des valeurs autoris&eacute;es 
      (list&eacute;e dans la page de manuel &man.pccardc.8;).</para>

    <para>S'il ne tourne pas d&eacute;j&agrave;, lancer le d&eacute;mon 
      pccardd (pour le lancer au d&eacute;marrage, ajoutez
      <programlisting>pccard_enable="YES"</programlisting> &agrave;
      <filename>/etc/rc.conf</filename>).  Maintenant vos cartes
      devraient &ecirc;tre d&eacute;tect&eacute;es quand vous les 
      ins&eacute;rez et les retirez, et vous devriez obtenir des 
      messages dans vos traces syst&egrave;me au sujet de nouveaux 
      p&eacute;riph&eacute;riques activ&eacute;s.</para>

    <para>Il y a eu des changements majeurs au code de pccard
      (incluant le routage ISA des interruptions, pour les machines
      dont le PCIBIOS semble &ecirc;tre inutilisable par FreeBSD) avant 
      la sortie de FreeBSD 4.4.  Si vous rencontrez des probl&egrave;mes, 
      essayez de mettre &agrave; jour votre syst&egrave;me.</para>

  </sect1> 

  <sect1> 

    <title>Gestion d'&eacute;nergie</title>

    <para>Malheureusement, cela n'est pas support&eacute; de 
      fa&ccedil;on fiable par FreeBSD.  Si vous &ecirc;tes chanceux, 
      quelques fonctions pourraient fonctionner correctement, ou 
      pourraient ne pas fonctionner du tout.</para>

    <para>Pour l'autoriser, vous aurez peut-&ecirc;tre besoin de
      compiler un noyau avec le support de la gestion d'&eacute;nergie
      (<literal>device apm0</literal>) ou rajoutez l'option
      <literal>enable apm0</literal> au fichier
      <filename>/boot/loader.conf</filename>, et aussi lancez le 
      d&eacute;mon apm au d&eacute;marrage (ligne 
      <literal>apm_enable="YES"</literal> dans
      <filename>/etc/rc.conf</filename>).  Les commandes apm sont
      &eacute;num&eacute;r&eacute;es dans la page de manuel &man.apm.8;.  
      Par exemple, <command>apm -b</command> vous donne l'&eacute;tat de 
      la batterie ( ou 255 si non support&eacute;), 
      <command>apm -Z</command> met l'ordinateur portable en veille, 
      <command>apm -z</command> (ou zzz) le place en mode hibernation.  
      Pour arr&ecirc;ter la machine, utilisez 
      <command>shutdown -p</command>.  Encore une fois, certaines ou 
      toutes ces fonctions peuvent ne pas fonctionner correctement ou pas 
      du tout.  Il se peut qui vous trouviez que l'hibernation/veille 
      fonctionne en mode console mais pas sous X (c'est l'&eacute;cran 
      qui ne se rallume pas, dans ce cas, basculez sur
      une console virtuelle, en utilisant Ctrl-Alt-F1 ou une autre
      touche de fonction, et alors ex&eacute;cuter la commande apm).
    </para>

    <para>Le syst&egrave;me X window (XFree86) inclue aussi la gestion de
      l'alimentation de l'affichage (lire la page de manuel
      &man.xset.1; et y rechercher le terme dpms).  Il se peut que vous
      d&eacute;siriez l'&eacute;tudier en d&eacute;tail.  Cependant, cela, 
      aussi, ne fonctionne pas correctement sur les ordinateurs portables:
      souvent l'affichage est &eacute;teint mais pas le 
      r&eacute;tro-&eacute;clairage.</para>

  </sect1>
</article>
