<!-- Copyright (c) 1998, 1999 Nik Clayton, All rights reserved.

     Redistribution and use in source (SGML DocBook) and 'compiled' forms
     (SGML, HTML, PDF, PostScript, RTF and so forth) with or without
     modification, are permitted provided that the following conditions
     are met:

      1.  Redistributions of source code (SGML DocBook) must retain the above
	 copyright notice, this list of conditions and the following
	 disclaimer as the first lines of this file unmodified.

      2.  Redistributions in compiled form (transformed to other DTDs,
	 converted to PDF, PostScript, RTF and other formats) must reproduce
	 the above copyright notice, this list of conditions and the
	 following disclaimer in the documentation and/or other materials
	 provided with the distribution.

     THIS DOCUMENTATION IS PROVIDED BY NIK CLAYTON "AS IS" AND ANY EXPRESS OR
     IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
     OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
     DISCLAIMED.  IN NO EVENT SHALL NIK CLAYTON BE LIABLE FOR ANY DIRECT,
     INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
     SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
     HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
     STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
     ANY WAY OUT OF THE USE OF THIS DOCUMENTATION, EVEN IF ADVISED OF THE
     POSSIBILITY OF SUCH DAMAGE.

     The FreeBSD Documentation Project
     The FreeBSD Brazilian Portuguese Documentation Project

     $FreeBSD$

     Original revision: r38826

-->

<chapter id="sgml-primer">
  <title>SGML Primer</title>

  <para>A maioria dos documentos do FDP &eacute; escrita utilizando 
    SGML.  Este cap&iacute;tulo ir&aacute; explicar exatamente o que 
    isso significa, como ler e compreender os fontes dos documentos 
    e os truques de SGML que voc&ecirc; ir&aacute; se defrontar na 
    documenta&ccedil;&atilde;o.</para>

  <para>Partes desta se&ccedil;&atilde;o foram inspiradas no documento 
    <ulink url="http://www.galassi.org/mark/mydocs/docbook-intro/docbook-intro.html">
    Come&ccedil;ando a utilizar o DocBook</ulink> de autoria do 
    Mark Galassi.</para>

  <sect1 id="sgml-primer-overview">
    <title>Vis&atilde;o Geral</title>

    <para>Antigamente, era simples de se lidar com um texto
      eletr&ocirc;nico.  Naquela &eacute;poca, voc&ecirc; tinha que 
      saber em qual conjunto de caracteres o seu documento havia sido 
      escrito (ASCII, EBCDIC ou um dos in&uacute;meros outros), e mais 
      nada.  O texto era texto, e o que voc&ecirc; via era 
      realmente o que voc&ecirc; tinha.  Nenhuma frescura, nenhuma 
      formata&ccedil;&atilde;o, nenhuma intelig&ecirc;ncia.</para>

    <para>Inevitavelmente, isto n&atilde;o era o suficiente.  
      Uma vez que voc&ecirc; tem o texto em uma m&aacute;quina num 
      formato utiliz&aacute;vel, voc&ecirc; espera que o equipamento 
      seja capaz de us&aacute;-lo e manipul&aacute;-lo de forma 
      inteligente.  Voc&ecirc; pode desejar indicar que uma 
      determinada frase deve ser enfatizada, ou adicionada a um 
      gloss&aacute;rio, ou ser interligada a outra parte do 
      documento.  Voc&ecirc; pode querer que os nomes dos arquivos 
      sejam exibidos com uma fonte de estilo <quote>typewriter</quote>
      quando forem exibidos na tela, mas como <quote>it&aacute;lico
      </quote> quando impresso, ou qualquer outra op&ccedil;&atilde;o 
      dentre a infinidade de op&ccedil;&otilde;es dispon&iacute;veis para
      apresenta&ccedil;&atilde;o.</para>

    <para>Esperava-se que a intelig&ecirc;ncia artificial (AI) 
      torna-se isso f&aacute;cil.  O seu computador leria o 
      documento e identificaria automaticamente as frases chave, 
      nomes de arquivos, os campos que o leitor teria que preencher, 
      e muito mais.  Infelizmente, a vida real n&atilde;o evoluiu 
      como esperado, e os nossos computadores necessitam de algum 
      aux&iacute;lio antes que eles possam processar significativamente 
      nosso texto.</para>

    <para>Mais precisamente, eles precisam de ajuda para identificar
      o que &eacute; o que.  Vejamos o texto abaixo:</para>

      <blockquote>
	<para>Para remover o <filename>/tmp/foo</filename> utilize 
	  &man.rm.1;.</para>

	<screen>&prompt.user; <userinput>rm /tmp/foo</userinput></screen>
      </blockquote>

      <para>Nele podemos facilmente visualizar quais partes 
	s&atilde;o nomes de arquivos, quais s&atilde;o comandos que 
	devem ser digitados, quais partes s&atilde;o 
	refer&ecirc;ncias &agrave;s p&aacute;ginas de manual, etc.  
	Mas o computador processando o documento n&atilde;o pode.  
	Para isto n&oacute;s precisamos utilizar uma 
	marca&ccedil;&atilde;o (<literal>markup</literal>).</para>

    <para>A <quote>marca&ccedil;&atilde;o</quote> &eacute; comumente 
      utilizada para descrever a <quote>adi&ccedil;&atilde;o de 
      valor</quote> ou o <quote>aumento de custo</quote>.  O termo 
      (term) faz exame de ambos os meios quando aplicados ao texto.  
      A marca&ccedil;&atilde;o &eacute; um texto adicional inclu&iacute;do 
      no documento, e de alguma forma destacado do seu conte&uacute;do,
      de modo que os programas que forem process&aacute;-lo possam ler 
      as marca&ccedil;&otilde;es e utiliz&aacute;-las ao tomar 
      decis&otilde;es sobre o documento.  Os editores podem ocultar 
      a marca&ccedil;&atilde;o do usu&aacute;rio, de forma que o 
      usu&aacute;rio n&atilde;o se distraia com ele.</para>

    <para>As informa&ccedil;&otilde;es extras armazenadas na 
      marca&ccedil;&atilde;o <emphasis>adicionam valor</emphasis> ao 
      documento.  Tipicamente a adi&ccedil;&atilde;o da 
      marca&ccedil;&atilde;o ao documento precisa ser realizada por 
      uma pessoa &mdash; apesar de tudo, se os computadores pudessem
      reconhecer suficientemente bem o texto para adicionar as
      marca&ccedil;&otilde;es, ent&atilde;o n&atilde;o haveria 
      necessidade de adicion&aacute;-las em primeiro lugar.  Isto 
      <emphasis>aumenta o custo</emphasis> (isto &eacute;, o 
      esfor&ccedil;o requerido) para criar o documento.</para>

    <para>O exemplo acima foi na verdade escrito neste documento
      como se segue:</para>

    <programlisting><![ CDATA [
<para>Para remover <filename>/tmp/foo</filename> utilize &man.rm.1;.</para>

<screen>&prompt.user; <userinput>rm /tmp/foo</userinput></screen>]]></programlisting>

    <para>Como voc&ecirc; pode ver, a marca&ccedil;&atilde;o 
      est&aacute; claramente separada do conte&uacute;do.</para>

    <para>Obviamente, se voc&ecirc; estiver iniciando no uso de 
      marca&ccedil;&otilde;es, voc&ecirc; precisa definir o que a 
      sua marca&ccedil;&atilde;o significa, e como ela ser&aacute; 
      interpretada.  Voc&ecirc; vai precisar de uma linguagem de
      marca&ccedil;&atilde;o a qual voc&ecirc; possa seguir quando 
      estiver marcando os seus documentos.</para>

    <para>Naturalmente, uma linguagem de marca&ccedil;&atilde;o pode 
      n&atilde;o ser o bastante.  Os requisitos de uma linguagem de 
      marca&ccedil;&atilde;o destinada formata&ccedil;&atilde;o de 
      documentos t&eacute;cnicos s&atilde;o diferentes dos requisitos
      de uma linguagem de marca&ccedil;&atilde;o destinada a 
      formata&ccedil;&atilde;o de receitas culin&aacute;rias.  Esta, 
      por sua vez, seria muito diferente de uma linguagem de 
      marca&ccedil;&atilde;o usada para formatar poemas.  O que 
      voc&ecirc; realmente precisa &eacute; de uma linguagem 
      prim&aacute;ria, a qual voc&ecirc; possa utilizar para 
      escrever estas e outras linguagens de marca&ccedil;&atilde;o.
      Uma <emphasis>meta linguagem de 
      marca&ccedil;&atilde;o</emphasis>.</para>

    <para>&Eacute; exatamente isso que a <foreignphrase>Standard 
      Generalized Markup Language</foreignphrase> (SGML) &eacute;.  
      Muitas linguagens de marca&ccedil;&atilde;o foram escritas em 
      SGML, incluindo as duas mais utilizadas pelo FDP, o HTML e o 
      DocBook.</para>

    <para>Cada defini&ccedil;&atilde;o de linguagem &eacute; mais 
      corretamente chamada de Defini&ccedil;&atilde;o de Tipo de 
      Documento (DTD).  O DTD especifica o nome dos elementos que 
      podem ser utilizados, em qual ordem eles aparecem (e se alguma 
      marca&ccedil;&atilde;o pode ser utilizada dentro de outra
      marca&ccedil;&atilde;o) e as informa&ccedil;&otilde;es 
      relacionadas.  Um DTD &eacute; algumas vezes referenciado como 
      uma <emphasis>aplica&ccedil;&atilde;o</emphasis> do SGML.</para>

    <para id="sgml-primer-validating">Um DTD &eacute; uma 
      especifica&ccedil;&atilde;o <emphasis>completa</emphasis> de 
      todos os elementos que podem ser utilizados, da ordem em que 
      podem aparecer, quais elementos s&atilde;o obrigat&oacute;rios,
      quais s&atilde;o opcionais, e assim por diante.  Isto torna 
      poss&iacute;vel escrever um interpretador (parser) SGML, que 
      leia ambos os DTD e um documento que reividique se adequar ao 
      DTD.  O interpretador pode ent&atilde;o confirmar se todos os 
      elementos obrigat&oacute;rios do DTD est&atilde;o (ou 
      n&atilde;o) presentes no documento na ordem correta, e se 
      existem erros na marca&ccedil;&atilde;o.  Isto &eacute; 
      normalmente referenciado como <quote>valida&ccedil;&atilde;o 
      do documento</quote>.</para>

    <note>
      <para>Este processamento simplesmente confirma se a escolha 
	dos elementos, a sua ordena&ccedil;&atilde;o, etc, 
	est&atilde;o de acordo com o especificado no DTD.  Ele <emphasis>
	n&atilde;o</emphasis> verifica se voc&ecirc; utilizou a 
	marca&ccedil;&atilde;o <emphasis>adequada</emphasis> para o
	conte&uacute;do.  Se voc&ecirc; tentasse marcar todos os 
	nomes de arquivo em seu documento como nomes de 
	fun&ccedil;&otilde;es, o interpretador n&atilde;o iria 
	apontar isto como um erro (assumindo, naturalmente, que a sua
	DTD define elementos para nomes de arquivos e para 
	fun&ccedil;&otilde;es, e que eles podem ser utilizados nos 
	mesmos lugares).</para>
    </note>

    <para>&Eacute; prov&aacute;vel que a maioria das suas 
      contribui&ccedil;&otilde;es ao projeto de 
      documenta&ccedil;&atilde;o ir&atilde;o se constituir de 
      conte&uacute;dos marcados tanto em HTML quanto em DocBook,  
      em vez de altera&ccedil;&otilde;es nos DTDs.
      Por esta raz&atilde;o este livro n&atilde;o ir&aacute; abordar 
      a cria&ccedil;&atilde;o de um DTD.</para>
  </sect1>

  <sect1 id="sgml-primer-elements">
    <title>Elementos, tags, e atributos</title>

    <para>Todos os DTDs escritos em SGML compartilham certas
      caracter&iacute;sticas.  Isto &eacute; uma dura surpresa, 
      como a filosofia por de tr&aacute;s do SGML nos  
      mostrar&aacute; ser completamente inevit&aacute;vel.  Uma das 
      manifesta&ccedil;&otilde;es mais &oacute;bvias desta filosofia 
      est&aacute; no <emphasis>conte&uacute;do</emphasis> e nos 
      <emphasis>elementos</emphasis>.</para>

    <para>A sua documenta&ccedil;&atilde;o (independente se &eacute; 
      uma &uacute;nica p&aacute;gina web ou um livro longo) &eacute; 
      composta de conte&uacute;do.  Este conte&uacute;do &eacute; 
      ent&atilde;o dividido (e de novo subdividido) em elementos.  O 
      prop&oacute;sito da adi&ccedil;&atilde;o de 
      marca&ccedil;&otilde;es &eacute; atribuir nome e identidade 
      para os limites destes elementos de forma a possibilitar o 
      processamento adicional.</para>

    <para>Por exemplo, considere um livro t&iacute;pico.  No 
      n&iacute;vel mais alto, o livro por si s&oacute; &eacute; um 
      elemento.  Este elemento <quote>livro</quote> (book) obviamente
      cont&eacute;m cap&iacute;tulos, os quais tamb&eacute;m podem
      ser considerados elementos em sua pr&oacute;pria forma.  Cada 
      cap&iacute;tulo ir&aacute; conter mais elementos, tais como 
      par&aacute;grafos, cita&ccedil;&otilde;es, notas de 
      rodap&eacute;, etc.  Cada par&aacute;grafo pode conter 
      elementos adicionais, identificando o conte&uacute;do que era 
      de discurso direto, ou o nome de um personagem da 
      hist&oacute;ria.</para>

    <para>Voc&ecirc; pode preferir pensar nisto como uma
      <quote>quebra</quote> do conte&uacute;do.  No n&iacute;vel 
      mais alto voc&ecirc; tem um peda&ccedil;o, o Livro.  Olhando 
      um pouco mais abaixo, voc&ecirc; tem mais peda&ccedil;os, os 
      cap&iacute;tulos individuais.  Estes est&atilde;o divididos 
      em peda&ccedil;os ainda menores, os par&aacute;grafos, notas 
      de rodap&eacute;, nomes de personagens, etc.</para>

    <para>Observe que voc&ecirc; pode fazer esta 
      diferencia&ccedil;&atilde;o entre os diferentes elementos do 
      conte&uacute;do sem recorrer a nenhum termo SGML.  Na 
      realidade &eacute; surpreendentemente f&aacute;cil de usar.
      Voc&ecirc; pode fazer isso utilizando uma caneta de 
      marca&ccedil;&atilde;o e uma c&oacute;pia impressa do livro, 
      utilizando diferentes cores para indicar os diferentes 
      peda&ccedil;os do conte&uacute;do.</para>

    <para>Naturalmente, n&oacute;s n&atilde;o possu&iacute;mos uma caneta 
      eletr&ocirc;nica de marca&ccedil;&atilde;o, assim n&oacute;s 
      necessitamos de alguma outra maneira de indicar a que elemento 
      cada pe&ccedil;a de conte&uacute;do pertence.  Nas linguagens 
      escritas em SGML (HTML, DocBook, etc) isto &eacute; feito
      atrav&eacute;s do uso de <emphasis>tags</emphasis>.</para>

    <para>Uma tag &eacute; utilizada para identificar onde um elemento
      particular come&ccedil;a e onde ele termina.  <emphasis>A tag 
      n&atilde;o &eacute; uma parte pr&oacute;pria do elemento
      </emphasis>.  Porque cada DTD foi normalmente escrito para 
      marcar um tipo espec&iacute;fico de informa&ccedil;&atilde;o, 
      cada um deles reconhecer&aacute; diferentes elementos, e
      ter&aacute; nomes diferentes para cada tag.</para>

    <para>Para um elemento chamado <replaceable>element-name
      </replaceable> a tag de in&iacute;cio normalmente ir&aacute; 
      se parecer com 
      <sgmltag><replaceable>element-name</replaceable></sgmltag>.  E 
      a tag correspondente de fechamento para este elemento seria 
      <sgmltag>/<replaceable>element-name</replaceable></sgmltag>.
      </para>

    <example>
      <title>Utilizando um elemento (tags de inicio e fim)</title>

      <para>O HTML possui um elemento para indicar que o 
	conte&uacute;do envolvido por este elemento &eacute; um 
	par&aacute;grafo, chamado <sgmltag>p</sgmltag>.  Este 
	elemento possui ambas as tags de in&iacute;cio e de fim.
	</para>

      <programlisting><![ RCDATA [<p>Este &eacute; um par&aacute;grafo.  Ele inicia com a tag de inicio do 
  elemento 'p', e ir&aacute; terminar com a tag de fim para o 
  elemento 'p'.</p>

<p>Este &eacute; um outro par&aacute;grafo.  Mas este &eacute; muito menor.</p>]]></programlisting>	  
    </example>

    <para>Nem todos os elementos requerem uma tag de 
      finaliza&ccedil;&atilde;o.  Alguns elementos n&atilde;o 
      possuem conte&uacute;do.  Por exemplo, em HTML voc&ecirc; pode 
      indicar que deseja que uma linha horizontal apare&ccedil;a no
      documento.  Obviamente, esta linha n&atilde;o possui 
      conte&uacute;do, assim apenas a tag de inicio &eacute; 
      requerida para este elemento.</para>

    <example>
      <title>Utilizando um elemento (Apenas tag de in&iacute;cio)
	</title>

      <para>O HTML possui um elemento para indicar uma linha 
	horizontal, chamado <sgmltag>hr</sgmltag>.  Este elemento 
	n&atilde;o cont&eacute;m nenhum conte&uacute;do, assim ele 
	possui apenas uma tag de inicio.</para>

      <programlisting><![ RCDATA [<p>Este &eacute; um par&aacute;grafo.</p>

<hr>

<p>Este &eacute; outro par&aacute;grafo.  Uma linha horizontal o separa do 
  par&aacute;grafo anterior.</p>]]></programlisting>
    </example>

    <para>Se isto n&atilde;o &eacute; &oacute;bvio agora, os 
      elementos podem conter outros elementos.  No exemplo anterior 
      do livro, o elemento livro continha todos os elementos 
      cap&iacute;tulos, os quais por sua vez continham todos os 
      elementos par&aacute;grafos, etc.</para>

    <example>
      <title>Elementos contendo elementos; <sgmltag>em</sgmltag>
	</title>

      <programlisting><![ RCDATA [<p>Este &eacute; um <em>par&aacute;grafo</em> simples no qual 
  algumas das <em>palavras</em> foram <em>enfatizadas</em>.</p>]]></programlisting>
    </example>

    <para>O DTD ir&aacute; especificar as regras detalhando quais 
      elementos podem conter outros elementos, e o que exatamente 
      eles podem conter.</para>

    <important>
      <para>As pessoas sempre confundem os termos tags e elementos, 
	e utilizam os termos como se eles fossem 
	intercambi&aacute;veis.  Eles n&atilde;o s&atilde;o.</para>

      <para>Um elemento &eacute; uma parte conceitual do seu 
	documento.  Um elemento possui um inicio e fim determinados.  
	As tags marcam onde os elementos come&ccedil;am e terminam.
      </para>

      <para>Quando este documento (ou qualquer pessoa que 
	conhe&ccedil;a SGML) se refere a <quote>tag 
	<sgmltag>p</sgmltag></quote> estamos nos referindo 
	literalmente ao texto de tr&ecirc;s caracteres
	<literal>&lt;</literal>, <literal>p</literal> e
	<literal>&gt;</literal>.  Mas a frase <quote>o elemento
	<sgmltag>p</sgmltag></quote> se refere ao elemento inteiro.
	</para>

      <para>Esta distin&ccedil;&atilde;o 
	<emphasis>&eacute;</emphasis> muito sutil.  Mas mantenha ela 
	em mente</para>
    </important>

    <para>Os elementos podem ter atributos.  Um atributo possui um
      nome e um valor, e &eacute; utilizado para adicionar 
      informa&ccedil;&otilde;es extras ao elemento.  Esta pode ser 
      a informa&ccedil;&atilde;o a qual indica como o conte&uacute;do
      deve ser renderizado, ou pode ser algo que identifique a 
      ocorr&ecirc;ncia &uacute;nica do elemento, ou pode ser qualquer
      outra coisa.</para>

    <para>O atributo de um elemento &eacute; sempre escrito
      <emphasis>dentro</emphasis> da tag de in&iacute;cio para 
      aquele elemento, e assume a forma
      <literal><replaceable>nome-do-atributo</replaceable>="<replaceable>valor-do-atributo</replaceable>"</literal>.</para>

    <para>Nas vers&otilde;es suficientemente recentes do HTML, o 
      elemento <sgmltag>p</sgmltag> possui um atributo chamado 
      <sgmltag>align</sgmltag>, o qual sugere o alinhamento 
      (Justifica&ccedil;&atilde;o) de um par&aacute;grafo para o programa 
      que estiver exibindo o HTML.</para>

    <para>O atributo <literal>align</literal> pode assumir um de
      quatro valores poss&iacute;veis, <literal>left</literal> 
      (esquerda), <literal>center</literal> (centralizado), 
      <literal>right</literal> (direita) e <literal>justify</literal>
      (justificado).  Se o atributo n&atilde;o for especificado 
      ser&aacute; assumido o valor padr&atilde;o
      <literal>left</literal>.</para>

    <example>
      <title>Utilizando um elemento com um atributo</title>

      <programlisting><![ RCDATA [<p align="left">A inclus&atilde;o de um atributo de alinhamento neste 
  par&aacute;grafo foi sup&eacute;rfluo, uma vez que o alinhamento 
  padr&atilde;o &eacute; left (esquerda).</p>

<p align="center">Isto pode aparecer no centro.</p>]]></programlisting>
    </example>

    <para>Alguns atributos ir&atilde;o assumir apenas valores 
      espec&iacute;ficos, como o <literal>left</literal> ou 
      <literal>justify</literal>.  Outros ir&atilde;o permitir que 
      voc&ecirc; entre com qualquer coisa que deseje.  Se voc&ecirc; 
      precisar incluir aspas (<literal>"</literal>) no valor de um 
      atributo, voc&ecirc; deve envolver o valor do atributo com 
      aspas simples (<literal>'</literal>).</para>

    <example>
      <title>Aspas simples envolta de atributos</title>

      <programlisting><![ RCDATA [<p align='right'>Eu estou a direita!</p>]]></programlisting>
    </example>

    <para>Algumas vezes voc&ecirc; n&atilde;o precisa utilizar aspas 
      em volta de todos os valores dos atributos.  Entretanto, a 
      regra para fazer isso &eacute; muito sutil, e &eacute; muito 
      mais simples <emphasis>sempre</emphasis> utilizar as aspas em 
      volta dos valores dos seus atributos.</para>

    <para>A informa&ccedil;&atilde;o nos atributos, elementos e tags 
      s&atilde;o armazenados nos cat&aacute;logos SGML.  V&aacute;rias 
      ferramentas do projeto de documenta&ccedil;&atilde;o utilizam 
      estes arquivos de catalogo para validarem o seu trabalho.  As 
      ferramentas no <filename role="package">textproc/docproj</filename> 
      incluem uma variedade de arquivos de catalogo 
      SGML.  O projeto de documenta&ccedil;&atilde;o do FreeBSD 
      inclui seu pr&oacute;prio conjunto de arquivos de cat&aacute;logos.  
      Suas ferramentas precisam reconhecer ambos os tipos de 
      arquivos de catalogo.</para>

    <sect2>
      <title>Para voc&ecirc; fazer&hellip;</title>

      <para>Para poder praticar com os exemplos deste documento 
	voc&ecirc; precisar&aacute; instalar alguns aplicativos no 
	seu sistema, al&eacute;m de assegurar que as vari&aacute;veis
	de ambiente estejam corretamente configuradas.</para>

      <procedure>
	<step>
	  <para>Fa&ccedil;a o download e instale o 
	    <filename role="package">textproc/docproj</filename>
	    a partir do sistema de ports do FreeBSD.  Ele &eacute; um
	    <emphasis>meta-port</emphasis> o qual deve efetuar o
	    download e a instala&ccedil;&atilde;o de todos os 
	    aplicativos e arquivos de suporte que s&atilde;o 
	    utilizados pelo projeto de documenta&ccedil;&atilde;o.
	    </para>
	</step>
	
	<step>
	  <para>Adicione linhas ao seu arquivo de 
	    inicializa&ccedil;&atilde;o do shell para configurar a 
	    vari&aacute;vel de ambiente 
	    <envar>SGML_CATALOG_FILES</envar>. (Se voc&ecirc; 
	    n&atilde;o estiver trabalhando com a vers&atilde;o no 
	    idioma ingl&ecirc;s da documenta&ccedil;&atilde;o,
	    voc&ecirc; pode precisar substituir o caminho com o 
	    diret&oacute;rio correto para o seu idioma.)</para>
	
	  <example id="sgml-primer-envars">
	    <title><filename>.profile</filename>, para os 
	      usu&aacute;rios dos shells &man.sh.1; e &man.bash.1;
	      </title>
	
	    <programlisting>SGML_ROOT=/usr/local/share/sgml	    
SGML_CATALOG_FILES=${SGML_ROOT}/jade/catalog
SGML_CATALOG_FILES=${SGML_ROOT}/docbook/4.1/catalog:$SGML_CATALOG_FILES
SGML_CATALOG_FILES=${SGML_ROOT}/html/catalog:$SGML_CATALOG_FILES
SGML_CATALOG_FILES=${SGML_ROOT}/iso8879/catalog:$SGML_CATALOG_FILES
SGML_CATALOG_FILES=/usr/doc/share/sgml/catalog:$SGML_CATALOG_FILES
SGML_CATALOG_FILES=/usr/doc/en_US.ISO8859-1/share/sgml/catalog:$SGML_CATALOG_FILES
export SGML_CATALOG_FILES</programlisting>
	  </example>

	  <example>
	    <title><filename>.cshrc</filename>, para os 
	      usu&aacute;rios dos shell &man.csh.1; e &man.tcsh.1;
	      </title>
	
	    <programlisting>setenv SGML_ROOT /usr/local/share/sgml
setenv SGML_CATALOG_FILES ${SGML_ROOT}/jade/catalog
setenv SGML_CATALOG_FILES ${SGML_ROOT}/docbook/4.1/catalog:$SGML_CATALOG_FILES
setenv SGML_CATALOG_FILES=${SGML_ROOT}/html/catalog:$SGML_CATALOG_FILES
setenv SGML_CATALOG_FILES=${SGML_ROOT}/iso8879/catalog:$SGML_CATALOG_FILES
setenv SGML_CATALOG_FILES /usr/doc/share/sgml/catalog:$SGML_CATALOG_FILES
setenv SGML_CATALOG_FILES /usr/doc/en_US.ISO8859-1/share/sgml/catalog:$SGML_CATALOG_FILES</programlisting>
	  </example>

	  <para>Para carregar estas vari&aacute;veis, execute um 
	    logout do sistema, logando novamente em seguida, ou 
	    execute os comandos acima na sua linha de comando para 
	    configurar os valores das vari&aacute;veis.</para>
	</step>
      </procedure>

      <procedure>
	<step>
	  <para>Crie o arquivo <filename>example.sgml</filename>, e 
	    entre com o seguinte texto:</para>

	  <programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
  <head>	     
    <title>Um exemplo de arquivo HTML</title>
  </head>

  <body>	    
    <p>Este &eacute; um par&aacute;grafo contendo algum texto.</p>

    <p>Este par&aacute;grafo cont&eacute;m mais algum texto.</p>

    <p align="right">Este par&aacute;grafo pode estar alinhado a direita.</p>
  </body>	    
</html>]]></programlisting>
	</step>

	<step>
	  <para>Tente validar este arquivo utilizando um interpretador
	    SGML.</para>

	  <para>Um dos componentes do 
	    <filename role="package">textproc/docproj</filename> 
	    &eacute; o <command>onsgmls</command>, um <link
	    linkend="sgml-primer-validating">interpretador de 
	    valida&ccedil;&atilde;o</link>.  Normalmente, o 
	    <command>onsgmls</command> l&ecirc; um documento marcado 
	    de acordo com um DTD SGML e retorna uma c&oacute;pia do 
	    conjunto de informa&ccedil;&otilde;es sobre a estrutura 
	    dos elementos (ESIS, mas isso n&atilde;o &eacute; 
	    importante agora).</para>
	
	  <para>Entretanto, quando o <command>onsgmls</command> 
	    &eacute; executado com o par&acirc;metro 
	    <option>-s</option>, ele ir&aacute; suprimir o output
	    normal, e imprimir apenas as mensagens de erro.  Isto o
	    torna um meio &uacute;til de verificar se o seu documento
	    &eacute; v&aacute;lido ou n&atilde;o.</para>
	
	  <para>Utilize o <command>onsgmls</command> para verificar 
	    se o seu documento &eacute; v&aacute;lido:</para>

          <screen>&prompt.user; <userinput>onsgmls -s example.sgml</userinput></screen>

	  <para>Como voc&ecirc; ir&aacute; ver, o 
	    <command>onsgmls</command> ir&aacute; executar sem 
	    retornar nenhuma mensagem.  Isto significa que o seu
	    documento foi validado com sucesso.</para>
	</step>

	<step>
	  <para>Veja o que acontece quando um elemento 
	    obrigat&oacute;rio &eacute; omitido.  Tente remover as 
	    tags <sgmltag>title</sgmltag> e <sgmltag>/title</sgmltag>
	    , e execute novamente a valida&ccedil;&atilde;o.</para>

          <screen>&prompt.user; <userinput>onsgmls -s example.sgml</userinput>
onsgmls:example.sgml:5:4:E: character data is not allowed here
onsgmls:example.sgml:6:8:E: end tag for "HEAD" which is not finished</screen>

	  <para>As mensagens de erro emitidas pelo 
	    <command>onsgmls</command> s&atilde;o organizadas em 
	    grupos separados por dois pontos, ou colunas.</para>
	
	  <informaltable frame="none" pgwide="1">
	    <tgroup cols="2">
	      <thead>
		<row>
		  <entry>Coluna</entry>
		  <entry>Prop&oacute;sito</entry>
		</row>
	      </thead>
	
	      <tbody>
		<row>
		  <entry>1</entry>
		  <entry>O nome do programa que est&aacute; gerando 
		    o erro.  Ela ser&aacute; sempre 
		    <literal>onsgmls</literal>.</entry>
		</row>

		<row>
		  <entry>2</entry>
		  <entry>O nome do arquivo que cont&eacute;m o erro.
		    </entry>
		</row>

		<row>
		  <entry>3</entry>
		  <entry>N&uacute;mero da linha na qual o erro 
		    aparece.</entry>
		</row>

		<row>
		  <entry>4</entry>
		  <entry>N&uacute;mero da coluna na qual o erro 
		    aparece.</entry>
		</row>

		<row>
		  <entry>5</entry>
		  <entry>Um c&oacute;digo de uma letra indicando a 
		    natureza da mensagem.  <literal>I</literal> indica
		    uma mensagem informativa, <literal>W</literal> 
		    &eacute; para um aviso, e <literal>E</literal> 
		    &eacute; para um erro <footnote>
		      <para>Ele n&atilde;o est&aacute; sempre na 
			quinta coluna.  O
			<command>onsgmls -sv</command> exibe
			<literal>onsgmls:I: "OpenSP" version "1.5.2"
			</literal> (depende da vers&atilde;o 
			instalada).  Como voc&ecirc; pode ver,
			esta &eacute; uma mensagem informativa.</para>
		    </footnote>, e <literal>X</literal> &eacute; 
		    para uma refer&ecirc;ncia cruzada.  Como 
		    voc&ecirc; pode ver, estas mensagens s&atilde;o 
		    erros.</entry>
		</row>

		<row>
		  <entry>6</entry>
		  <entry>O texto da mensagem.</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>

	  <para>A simples omiss&atilde;o das tags 
	    <sgmltag>title</sgmltag> gerou 2 erros diferentes.</para>

	  <para>O primeiro erro indica que o conte&uacute;do (neste caso,
	    caracteres, ou melhor, a tag de inicio de um elemento)
	    ocorreu onde o interpretador SGML estava esperando outra
	    coisa.  Neste caso, o interpretador estava esperando
	    encontrar uma das tags de in&iacute;cio para os elementos
	    que s&atilde;o v&aacute;lidos dentro do 
	    <sgmltag>head</sgmltag> (como a <sgmltag>title</sgmltag>
	    ).</para>

	  <para>O segundo erro &eacute; porque o elemento 
	    <sgmltag>head</sgmltag> <emphasis>deve</emphasis> conter 
	    o elemento <sgmltag>title</sgmltag>.  Por causa disso o 
	    <command>onsgmls</command> considera que o elemento 
	    n&atilde;o foi corretamente finalizado.  Entretanto, a 
	    tag de finaliza&ccedil;&atilde;o indica que o elemento 
	    foi fechado antes que estivesse terminado.</para>
	</step>

	<step>
	  <para>Coloque de volta o elemento 
	    <sgmltag>title</sgmltag>.</para>
	</step>
      </procedure>
    </sect2>
  </sect1>

  <sect1 id="sgml-primer-doctype-declaration">
    <title>A declara&ccedil;&atilde;o DOCTYPE</title>

    <para>O inicio de cada documento que voc&ecirc; escrever deve
    especificar o nome do DTD o qual se aplica ao seu documento.  Isto
    deve ser feito para que os interpretadores SGML possam determinar
    o DTD e assegurar que o documento esta em conformidade com o
    mesmo.</para>

    <para>Esta informa&ccedil;&atilde;o &eacute; geralmente 
      expressada em uma linha, na declara&ccedil;&atilde;o 
      DOCTYPE.</para>

    <para>Uma declara&ccedil;&atilde;o t&iacute;pica para um 
      documento escrito para conformar-se com a vers&atilde;o 4.0 
      do DTD HTML se parece com esta:</para>

    <programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN">]]></programlisting>

    <para>Esta linha cont&eacute;m diferentes componentes.</para>

    <variablelist>
      <varlistentry>
	<term><literal>&lt;!</literal></term>
	
	<listitem>
	  <para>&Eacute; o <emphasis>indicador</emphasis> que indica 
	    que se trata de uma declara&ccedil;&atilde;o SGML.  Esta 
	    linha est&aacute; declarando o tipo do documento.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>DOCTYPE</literal></term>
	
	<listitem>
	  <para>Mostra que esta &eacute; uma declara&ccedil;&atilde;o
	    SGML para o tipo de documento.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>html</literal></term>
	
	<listitem>
	  <para>O nome do primeiro 
	    <link linkend="sgml-primer-elements">elemento</link> o 
	    qual ir&aacute; aparecer no documento</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>PUBLIC "-//W3C//DTD HTML 4.0//EN"</literal>
	  </term>

	<listitem>
	  <para>Lista o Identificador P&uacute;blico Formal (FPI)
	    <indexterm> <primary>Identificar P&uacute;blico 
	    Formal</primary> </indexterm> para o DTD ao qual este 
	    documento conforma-se.  O seu interpretador SGML 
	    ir&aacute; utiliza-lo para encontrar o DTD correto quando
	    estiver processando o documento.</para>

	  <para>O <literal>PUBLIC</literal> n&atilde;o faz parte do 
	    FPI, ele indica para o processador SGML como localizar 
	    o DTD referenciado na FPI.  Outras formas de informar ao
	    interpretador SGML como localizar o DTD ser&atilde;o 
	    abordadas <link
	    linkend="sgml-primer-fpi-alternatives">mais tarde</link>
	    .</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>&gt;</literal></term>
	
	<listitem>
	  <para>Retorno ao documento.</para>
	</listitem>
      </varlistentry>
    </variablelist>

    <sect2>
      <title>Identificadores p&uacute;blicos formais (FPIs)
	<indexterm significance="preferred"><primary>Identificadores 
	P&uacute;blicos Formais</primary></indexterm>
</title>

      <note>
	<para>Voc&ecirc; n&atilde;o precisa conhec&ecirc;-los, mas 
	  eles s&atilde;o um background &uacute;til, e podem 
	  ajud&aacute;-lo a depurar problemas quando o seu
	  processador SGML n&atilde;o puder localizar o DTD que 
	  voc&ecirc; esta utilizando.</para>
      </note>

      <para>Os FPIs devem seguir uma sintaxe espec&iacute;fica.  
	Esta sintaxe &eacute; a seguinte:</para>

      <programlisting>"<replaceable>Propriet&aacute;rio</replaceable>//<replaceable>Palavra-Chave</replaceable> <replaceable>Descri&ccedil;&atilde;o</replaceable>//<replaceable>Idioma</replaceable>"</programlisting>

      <variablelist>
	<varlistentry>
	  <term><replaceable>Propriet&aacute;rio</replaceable></term>
	
	  <listitem>
	    <para>Isto indica o propriet&aacute;rio da FPI.</para>

	    <para>Se este conjunto de caracteres come&ccedil;ar 
	      com <quote>ISO</quote> significar&aacute; que o FPI 
	      &eacute; de propriedade do ISO.  Por exemplo, a FPI 
	      <literal>"ISO 8879:1986//ENTITIES Greek Symbols//EN"
	      </literal> lista o <literal>ISO 8879:1986</literal> 
	      como sendo o propriet&aacute;rio do conjunto de 
	      entidades dos s&iacute;mbolos Gregos.  O ISO 8879:1986 
	      &eacute; o numero da ISO para o padr&atilde;o SGML.
	      </para>

	    <para>De outra forma, este conjunto de caracteres 
	      ir&aacute; se parecer com <literal>-//<replaceable>
	      Propriet&aacute;rio</replaceable></literal> ou
	      <literal>+//<replaceable>Propriet&aacute;rio
	      </replaceable></literal> (Observe que a &uacute;nica 
	      diferen&ccedil;a &eacute; a introdu&ccedil;&atilde;o do 
	      <literal>+</literal> ou do <literal>-</literal>).</para>

	    <para>Se o conjunto de caracteres come&ccedil;ar com
	      <literal>-</literal> significa que o 
	      propriet&aacute;rio da informa&ccedil;&atilde;o 
	      n&atilde;o &eacute; registrado, se come&ccedil;ar com 
	      um <literal>+</literal> significa que ele &eacute; 
	      registrado.</para>

	    <para>O ISO 9070:1991 define como os nomes registrados 
	      s&atilde;o gerados; ele pode ser derivado do numero de 
	      uma publica&ccedil;&atilde;o ISO, de um c&oacute;digo 
	      ISBN, ou um c&oacute;digo de organiza&ccedil;&atilde;o
	      atribu&iacute;do de acordo com o ISO 6523.  Al&eacute;m disso,
	      uma autoridade de registro pode ser criada a fim de 
	      atribuir nomes registrados.  O conselho ISO delegou 
	      isto ao <literal>American National Standards 
	      Institute</literal> (ANSI).</para>

	    <para>Como o Projeto FreeBSD n&atilde;o foi registrado o 
	      conjunto de caracteres de propriet&aacute;rio &eacute; 
	      <literal>-//FreeBSD</literal>.  E como voc&ecirc; pode 
	      ver, o W3C tamb&eacute;m n&atilde;o &eacute; um 
	      propriet&aacute;rio registrado.</para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term><replaceable>Palavra-Chave</replaceable></term>
	
	  <listitem>
	    <para>Existem diversas palavras-chave as quais indicam o
	      tipo de informa&ccedil;&atilde;o no arquivo.  Algumas 
	      das palavras chaves mais comuns s&atilde;o
	      <literal>DTD</literal>, <literal>ELEMENT</literal>,
	      <literal>ENTITIES</literal>, e <literal>TEXT</literal>.
	      A palavra chave <literal>DTD</literal> &eacute; 
	      utilizada apenas para os arquivos DTD, a 
	      <literal>ELEMENT</literal> &eacute; normalmente 
	      utilizada para fragmentos DTD os quais contenham 
	      apenas entidades e declara&ccedil;&otilde;es de 
	      elementos.  A palavra <literal>TEXT</literal> &eacute; 
	      utilizada para o conte&uacute;do SGML (texto e tags).
	      </para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term><replaceable>Descric&atilde;o</replaceable></term>
	
	  <listitem>
	    <para>Qualquer descri&ccedil;&atilde;o que voc&ecirc; 
	      deseje fornecer para o conte&uacute;do deste arquivo.  
	      O que pode incluir um n&uacute;mero de vers&atilde;o ou 
	      qualquer texto curto o qual seja significativo para 
	      voc&ecirc; e &uacute;nico para o sistema SGML.</para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term><replaceable>Idioma</replaceable></term>
	
	  <listitem>
	    <para>Este &eacute; um c&oacute;digo ISO de duas letras o 
	      qual identifica o idioma nativo do arquivo.  O 
	      c&oacute;digo <literal>EN</literal> &eacute; utilizado
	      para o idioma ingl&ecirc;s.</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <sect3>
	<title>Arquivos de <filename>cat&aacute;logo</filename>
	  </title>
	
	<para>Se voc&ecirc; utilizar a sintaxe acima e processar este
	  documento utilizando um processador SGML, o processador 
	  ir&aacute; precisar de uma forma de associar a FPI ao nome 
	  do arquivo no seu computador o qual cont&eacute;m o DTD.
	  </para>
	
	<para>Para isto devemos utilizar um arquivo de
	  cat&aacute;logo.  Um arquivo de cat&aacute;logo (tipicamente
	  chamado de <filename>catalog</filename>) cont&eacute;m 
	  linhas as quais mapeiam FPIs para nomes de arquivos.  Por 
	  exemplo, se o arquivo de cat&aacute;logo contiver a linha:
	  </para>
	
	<programlisting>PUBLIC "-//W3C//DTD HTML 4.0//EN" "4.0/strict.dtd"</programlisting>

	<para>O processador SGML saberia que deveria procurar pelo 
	  DTD <filename>strict.dtd</filename> no subdiret&oacute;rio 
	  <filename>4.0</filename> de qualquer diret&oacute;rio que 
	  possu&iacute;sse um arquivo <filename>catalog</filename> contendo 
	  esta linha.</para>

	<para>Veja o conte&uacute;do do 
	  <filename>/usr/local/share/sgml/html/catalog</filename>. 
	  Este &eacute; o arquivo de cat&aacute;logo para o DTD HTML 
	  o qual ser&aacute; instalado como parte do port
	  <filename role="package">textproc/docproj</filename>.</para>
      </sect3>

      <sect3>
	<title><envar>SGML_CATALOG_FILES</envar></title>

	<para>A fim de encontrar um arquivo de
	  <filename>cat&aacute;logo</filename>, o seu processador SGML
	  precisar&aacute; saber onde procurar.  Muitos deles possuem
	  recursos de par&acirc;metros de linha de comando para 
	  especificar o caminho para um ou mais cat&aacute;logos.
	  </para>
	
	<para>Adicionalmente, voc&ecirc; pode definir a 
	  vari&aacute;vel de ambiente 
	  <envar>SGML_CATALOG_FILES</envar> para apontar para os
	  arquivos.  Esta vari&aacute;vel deve consistir de uma 
	  lista, separada por dois pontos (":"), de arquivos de 
	  cat&aacute;logo (incluindo seus caminhos completos).</para>
	
	<para>Tipicamente, voc&ecirc; precisar&aacute; incluir os 
	  seguintes arquivos:</para>

	<itemizedlist>
	  <listitem>
	    <para><filename>/usr/local/share/sgml/docbook/4.1/catalog</filename></para>
	  </listitem>

	  <listitem>
	    <para><filename>/usr/local/share/sgml/html/catalog</filename></para>
	  </listitem>

	  <listitem>
	    <para><filename>/usr/local/share/sgml/iso8879/catalog</filename></para>
	  </listitem>

	  <listitem>
	    <para><filename>/usr/local/share/sgml/jade/catalog</filename></para>
	  </listitem>
	</itemizedlist>

	<para>Voc&ecirc; <link linkend="sgml-primer-envars">j&aacute;
	  deve ter feito isto</link>.</para>
      </sect3>
    </sect2>

    <sect2 id="sgml-primer-fpi-alternatives">
      <title>Alternativas aos FPIs</title>

      <para>Ao inv&eacute;s de utilizar um FPI para indicar o DTD ao 
	qual o documento conforma-se (e consequentemente, quais 
	arquivos no sistema cont&eacute;m o DTD), voc&ecirc; pode 
	especificar explicitamente o nome do arquivo.  </para>

      <para>A sintaxe para isto &eacute; ligeiramente diferente:
	</para>

      <programlisting><![ RCDATA [<!DOCTYPE html SYSTEM "/path/to/file.dtd">]]></programlisting>

      <para>A palavra chave <literal>SYSTEM</literal> indica que o
	processador SGML deve encontrar o DTD em um local 
	espec&iacute;fico do sistema.  Isto tipicamente (mas 
	n&atilde;o sempre) significa que o DTD ser&aacute; fornecido 
	como um nome de arquivo.</para>

      <para>O uso de FPIs &eacute; preferido por raz&otilde;es de 
	portabilidade.  Voc&ecirc; pode n&atilde;o desejar ter que 
	enviar uma c&oacute;pia do DTD junto com seu documento, e 
	se voc&ecirc; utilizasse um identificador
	<literal>SYSTEM</literal> todos necessitariam manter os seus
	DTDs no mesmo lugar que voc&ecirc;.</para>
    </sect2>
  </sect1>

  <sect1 id="sgml-primer-sgml-escape">
    <title>Voltando para o SGML</title>

    <para>Como mencionado anteriormente, o SGML &eacute; utilizado 
      somente quando escrevemos um DTD.  Isto n&atilde;o &eacute;
      estritamente verdade.  Existem certas sintaxes SGML as quais
      voc&ecirc; poder&aacute; desejar utilizar com os seus 
      documentos.  Por exemplo,  voc&ecirc; pode incluir 
      coment&aacute;rios no seu documento, e eles ser&atilde;o 
      ignorados pelo interpretador.  Os coment&aacute;rios s&atilde;o
      adicionados utilizando sintaxe SGML.  Outros usos para a sintaxe
      SGML no seu documento ser&atilde;o mostrados mais tarde.</para>

    <para>Obviamente, voc&ecirc; precisa indicar de alguma forma ao
      processador SGML que o conte&uacute;do seguinte n&atilde;o se 
      trata de elementos do documento, mas sim de SGML sobre o qual 
      o interpretador deve atuar.</para>

    <para>Estas sess&otilde;es s&atilde;o marcadas no seu documento 
      com <literal>&lt;! ...  &gt;</literal>.  Tudo entre estes
      delimitadores &eacute; sintaxe SGML tal como voc&ecirc; pode 
      encontrar dentro de um DTD.</para>

    <para>Como voc&ecirc; pode perceber, a 
      <link linkend="sgml-primer-doctype-declaration">
      declara&ccedil;&atilde;o DOCTYPE </link> &eacute; um exemplo 
      de sintaxe SGML a qual voc&ecirc; precisa incluir no seu 
      documento.</para>
  </sect1>

  <sect1 id="sgml-primer-comments">
    <title>Coment&aacute;rios</title>

    <para>Coment&aacute;rios s&atilde;o uma constru&ccedil;&atilde;o 
      SGML, e s&atilde;o normalmente v&aacute;lidos apenas dentro de 
      um DTD.  Entretanto, como mostrou a
      <xref linkend="sgml-primer-sgml-escape">, &eacute; poss&iacute;vel 
      utilizar sintaxe SGML com os seus documentos.</para>

    <para>O delimitador para um coment&aacute;rio SGML &eacute; o 
      conjunto de caracteres <quote><literal>--</literal></quote>.  
      A primeira ocorr&ecirc;ncia deste conjunto de caracteres abre 
      um coment&aacute;rio e a segunda fecha.</para>

    <example>
      <title>Coment&aacute;rio SGML gen&eacute;rico</title>

      <programlisting>&lt;!-- Teste de coment&aacute;rio --></programlisting>

      <programlisting><![ RCDATA [
<!-- Este &eacute; o interior do coment&aacute;rio -->

<!-- Este &eacute; outro coment&aacute;rio    -->

<!-- Esta &eacute; uma forma 
     de fazer coment&aacute;rios de v&aacute;rias linhas -->

<!-- Esta &eacute; outra forma  --
  -- de fazer coment&aacute;rios de v&aacute;rias linhas -->]]></programlisting>
    </example>

    <![ %output.print; [
    <important>
      <title>Utilize 2 tra&ccedil;os</title>

      <para>Existe um problema com a produ&ccedil;&atilde;o de 
	vers&otilde;es Postscript e PDF deste documento.  O exemplo 
	acima provavelmente mostra apenas um s&iacute;mbolo de 
	h&iacute;fen, <literal>-</literal> depois do
	<literal>&lt;!</literal> e antes do <literal>&gt;</literal>.
	</para>

      <para>Voc&ecirc; <emphasis>deve</emphasis> utilizar dois
      	<literal>-</literal> e <emphasis>n&atilde;o</emphasis> um.  
	As vers&otilde;es Postscript e PDF traduzem os dois 
	<literal>-</literal> do original para um mais longo, e mais 
	profissional <emphasis>em-dash</emphasis>, e quebra este 
	exemplo no processo.</para>

      <para>As vers&otilde;es HTML, texto plano, e RTF deste 
	documento n&atilde;o s&atilde;o afetadas.</para>
    </important>
    ]]>

    <para>Se voc&ecirc; j&aacute; utilizou HTML antes, voc&ecirc; pode ter 
      sido exposto a regras diferentes para coment&aacute;rios.  Em 
      particular, voc&ecirc; pode pensar que o conjunto de caracteres
      <literal>&lt;!--</literal> abre um coment&aacute;rio e que ele 
      apenas &eacute; fechado por um <literal>--&gt;</literal>.</para>

    <para>Este <emphasis>n&atilde;o</emphasis> &eacute; o caso.  
      Muitos dos navegadores web possuem interpretadores HTML 
      quebrados, e ir&atilde;o aceitar isso como v&aacute;lido.  
      Entretanto, os interpretadores SGML utilizados pelo projeto 
      de documenta&ccedil;&atilde;o s&atilde;o muito mais 
      r&iacute;gidos, e ir&atilde;o rejeitar os documentos que 
      contiverem este erro.</para>

    <example>
      <title>Coment&aacute;rios SGML errados</title>

      <programlisting><![ RCDATA [
<!-- Este &eacute; o coment&aacute;rio --

     Isto est&aacute; fora do coment&aacute;rio!

  -- de volta para dentro do coment&aacute;rio -->]]></programlisting>

      <para>O interpretador SGML ir&aacute; tratar isto como ele 
	&eacute; realmente;</para>

      <programlisting>&lt;!Isto est&aacute; fora do coment&aacute;rio&gt;</programlisting>

      <para>Isto n&atilde;o &eacute; um SGML v&aacute;lido, e pode 
	dar mensagens de erro confusas.</para>

      <programlisting><![ RCDATA [<!--------------- Isto &eacute; uma id&eacute;ia muito ruim --------------->]]></programlisting>

      <para>E como o exemplo sugere, <emphasis>n&atilde;o escreva
	</emphasis> coment&aacute;rios como esse.</para>

      <programlisting><![ RCDATA [<!--===================================================-->]]></programlisting>

      <para>Esta &eacute; uma abordagem (ligeiramente) melhor, mas 
	ele ainda &eacute; potencialmente confuso para as pessoas 
	novas no uso do SGML.</para>

    </example>

    <sect2>
      <title>Para voc&ecirc; fazer&hellip;</title>

      <procedure>
	<step>
	  <para>Adicione alguns coment&aacute;rios ao arquivo
	  <filename>example.sgml</filename> e verifique se ele 
	  continua v&aacute;lido usando o <command>onsgmls</command>.
	  </para>
	</step>

	<step>
	  <para>Adicione alguns coment&aacute;rios inv&aacute;lidos ao
	    <filename>example.sgml</filename> e veja as mensagens de 
	    erro que o <command>onsgmls</command> emite quando 
	    encontra um coment&aacute;rio inv&aacute;lido.</para>
	</step>
      </procedure>
    </sect2>
  </sect1>

  <sect1 id="sgml-primer-entities">
    <title>Entidades</title>

    <para>Entidades s&atilde;o um mecanismo para atribuir nomes para
      peda&ccedil;os de conte&uacute;do.  Quando o interpretador 
      SGML processar o seu documento, qualquer entidade que ele 
      encontrar ser&aacute; substitu&iacute;da pelo conte&uacute;do da 
      entidade.</para>

    <para>Esta &eacute; uma boa forma de ter peda&ccedil;os de 
      conte&uacute;do reutiliz&aacute;veis e facilmente 
      alter&aacute;veis em seus documentos SGML.  Esta &eacute; 
      tamb&eacute;m a &uacute;nica forma de incluir um arquivo 
      marcado dentro de outro utilizando SGML.</para>

    <para>Existem dois tipos de entidades que podem ser utilizadas 
      em duas situa&ccedil;&otilde;es diferentes; 
      <emphasis>Entidades gerais</emphasis> e
      <emphasis>Entidades de par&acirc;metros</emphasis>.</para>

    <sect2 id="sgml-primer-general-entities">
      <title>Entidades gerais</title>

      <para>Voc&ecirc; n&atilde;o pode utilizar uma entidade geral 
	em um contexto SGML (embora voc&ecirc; as defina em um).  
	Elas podem ser utilizadas apenas no seu documento.  Compare 
	isto com as <link linkend="sgml-primer-parameter-entities">
	entidades de par&acirc;metros</link>.</para>

      <para>Cada entidade geral possui um nome.  Quando voc&ecirc; 
	quer referenciar uma entidade geral (e consequentemente 
	incluir o texto que ela representa no seu documento), 
	voc&ecirc; escreve 
	<literal>&amp;<replaceable>nome-da-entidade</replaceable>;</literal>.
	Por exemplo, suponha que voc&ecirc; possui uma 
	entidade chamada <literal>current.version</literal>, a qual 
	expande para a vers&atilde;o atual do seu produto.  
	Voc&ecirc; pode escrever:</para>

      <programlisting><![ RCDATA [<para>A vers&atilde;o atual do nosso produto &eacute; &amp;current.version;.</para>]]></programlisting>

      <para>Quando o n&uacute;mero de vers&atilde;o mudar, 
	voc&ecirc; pode simplesmente alterar a defini&ccedil;&atilde;o
	do valor da entidade geral e reprocessar o seu documento.
	</para>

      <para>Voc&ecirc; tamb&eacute;m pode utilizar entidades gerais 
	para incorporar caracteres que voc&ecirc; n&atilde;o poderia 
	incorporar de outra forma em um documento SGML.  Por exemplo,
	os caracteres <literal>&lt;</literal> e 
	<literal>&amp;</literal> n&atilde;o podem aparecer normalmente
	em um documento SGML.  Quando o interpretador SGML v&ecirc; 
	o s&iacute;mbolo <literal>&lt;</literal> ele assume que 
	aquilo &eacute; uma tag (uma tag de abertura ou de fechamento)
	que est&aacute; a ponto de aparecer, e quando ele v&ecirc; o 
	s&iacute;mbolo <literal>&amp;</literal> ele assume que o 
	pr&oacute;ximo texto ser&aacute; o nome de uma entidade.
	</para>

      <para>Felizmente, voc&ecirc; pode utilizar as duas entidades 
      	gerais <literal>&amp;lt;</literal> e 
	<literal>&amp;amp;</literal> sempre que voc&ecirc; precisar 
	inclu&iacute;-los.</para>

      <para>Uma entidade geral s&oacute; pode ser definida dentro de 
	um contexto SGML.  Tipicamente, isto &eacute; feito 
	imediatamente depois da declara&ccedil;&atilde;o DOCTYPE.
	</para>

      <example>
	<title>Definindo uma entidade geral</title>

	<programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
<!ENTITY current.version    "3.0-RELEASE">
<!ENTITY last.version       "2.2.7-RELEASE">
]>]]></programlisting>
	
	<para>Observe como a declara&ccedil;&atilde;o DOCTYPE foi 
	  estendida adicionando-se um colchete no final da primeira 
	  linha.  As duas entidades est&atilde;o definidas nas 
	  pr&oacute;ximas duas linhas, antes que o colchete seja 
	  fechado, e ent&atilde;o a declara&ccedil;&atilde;o DOTYPE 
	  &eacute; fechada.</para>
	
	<para>O colchete &eacute; necess&aacute;rio para indicar 
	  que n&oacute;s estamos extendendo o DTD indicado pela 
	  declara&ccedil;&atilde;o DOCTYPE.</para>
      </example>
    </sect2>

    <sect2 id="sgml-primer-parameter-entities">
      <title>Entidades de par&acirc;metro</title>

      <para>Assim como as 
	<link linkend="sgml-primer-general-entities">entidades gerais</link>
	, as entidades de par&acirc;metro s&atilde;o utilizadas para
	atribuir um nome a peda&ccedil;os reutiliz&aacute;veis de
	texto.  Entretanto, enquanto as entidades gerais s&oacute; 
	podem ser utilizadas com o seu documento, as entidades de 
	par&acirc;metro podem ser utilizadas apenas dentro de um 
	<link linkend="sgml-primer-sgml-escape">contexto SGML</link>.
	</para>

      <para>As entidades de par&acirc;metro s&atilde;o definidas de uma 
	forma similar as entidades gerais.  Entretanto, ao 
	inv&eacute;s de utilizar
	<literal>&amp;<replaceable>nome-da-entidade</replaceable>;</literal>
	como refer&ecirc;ncia, utiliza
	<literal>%<replaceable>nome-da-entidade</replaceable>;</literal>
	  <footnote><para>Entidades de 
	  <emphasis>P</emphasis>ar&acirc;metro utilizam o s&iacute;mbolo de 
	  <emphasis>P</emphasis>orcentagem.</para> </footnote>.  
	A defini&ccedil;&atilde;o tamb&eacute;m inclui o 
	<literal>%</literal> entre a palavra chave 
	<literal>ENTITY</literal> e o nome da entidade.</para>
	
      <example>
	<title>Definindo entidades de par&acirc;metros</title>
	
	<programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
<!ENTITY % param.some "some">
<!ENTITY % param.text "text">
<!ENTITY % param.new  "%param.some more %param.text">

<!-- %param.new agora cont&eacute;m "some more text" -->
]>]]></programlisting>
      </example>
	
      <para>Isto pode n&atilde;o parecer particularmente 
	&uacute;til.  Mas ele ser&aacute;.</para>

    </sect2>

    <sect2>
      <title>Para voc&ecirc; fazer&hellip;</title>

      <procedure>
	<step>
	  <para>Adicione uma entidade geral ao 
	    <filename>example.sgml</filename>.</para>

	  <programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY version "1.1">
]>	  

<html>
  <head>	     
    <title>Um exemplo de arquivo HTML</title>
  </head>

  <!-- Voc&ecirc; pode ter alguns coment&aacute;rios aqui tamb&eacute;m -->
	  
  <body>	    
    <p>Este &eacute; um par&aacute;grafo contendo algum texto.</p>

    <p>Este par&aacute;grafo cont&eacute;m mais algum texto.</p>

    <p align="right">Este par&aacute;grafo pode estar alinhado a direita.</p>

    <p>A vers&atilde;o atual deste documento &eacute;: &amp;version;</p>	  
  </body>	    
</html>]]></programlisting>	  
	</step>

	<step>
	  <para>Valide o documento utilizando o <command>onsgmls
	    </command></para>
	</step>

	<step>
	  <para>Carregue o arquivo <filename>example.sgml</filename>
	    no seu navegador web (Voc&ecirc; pode precisar 
	    copi&aacute;-lo para <filename>example.html</filename> 
	    antes que o seu navegador possa reconhec&ecirc;-lo como 
	    um documento HTML).</para>
	
	  <para>A menos que o seu navegador seja muito 
	    avan&ccedil;ado, voc&ecirc; n&atilde;o ir&aacute; ver a 
	    entidade referenciada por <literal>&amp;version;</literal>
	    substitu&iacute;da pelo n&uacute;mero de vers&atilde;o.  
	    A maioria dos navegadores web possuem interpretadores 
	    muito simplistas os quais n&atilde;o manuseiam 
	    corretamente SGML <footnote><para>Isto &eacute; uma 
	    vergonha.  Imagine todos os problemas e <literal>hacks
	    </literal> (tais como os Server Side Includes) que 
	    poderiam ser evitados se eles o fizessem.</para>
	    </footnote>.</para>
	</step>

	<step>
	  <para>A solu&ccedil;&atilde;o &eacute; 
	    <emphasis>normalizar</emphasis>  seu documento utilizando
	    um normalizador SGML.  Um normalizador l&ecirc; um SGML 
	    v&aacute;lido e retorna um SGML igualmente v&aacute;lido
	    o qual foi transformado de alguma forma.  Uma das formas 
	    em que o normalizador transforma o SGML &eacute;
	    expandindo todas as entidades referenciadas no documento,
	    substituindo as entidades pelo texto que elas
	    representam.</para>
	
	  <para>Voc&ecirc; pode utilizar o <command>osgmlnorm
	    </command> para fazer isto:</para>

          <screen>&prompt.user; <userinput>osgmlnorm example.sgml &gt; example.html</userinput></screen>

	  <para>Voc&ecirc; deve encontrar uma c&oacute;pia 
	    normalizada (isto &eacute;, entidades referenciadas 
	    expandidas) do seu documento no arquivo 
	    <filename>example.html</filename>, pronta para ser
	    carregada no seu navegador web.</para>
	</step>

	<step>
	  <para>Se voc&ecirc; examinar o retorno do 
	    <command>osgmlnorm</command> voc&ecirc; ira ver que ele 
	    n&atilde;o inclui a declara&ccedil;&atilde;o DOCTYPE no 
	    inicio.  Para inclu&iacute;-la voc&ecirc; precisa 
	    utilizar a op&ccedil;&atilde;o <option>-d</option>:</para>
	
          <screen>&prompt.user; <userinput>osgmlnorm -d example.sgml &gt; example.html</userinput></screen>
	</step>
      </procedure>
    </sect2>
  </sect1>

  <sect1 id="sgml-primer-include">
    <title>Utilizando entidades para incluir arquivos</title>

    <para>As entidades (ambas <link
	linkend="sgml-primer-general-entities">gerais</link> e de <link
	linkend="sgml-primer-parameter-entities">par&acirc;metros</link>)
	s&atilde;o particularmente &uacute;teis quando utilizadas 
	para incluir um arquivo dentro de outro.</para>

    <sect2 id="sgml-primer-include-using-gen-entities">
      <title>Utilizando entidades gerais para incluir arquivos</title>

      <para>Suponha que voc&ecirc; possui algum conte&uacute;do para um 
	livro SGML organizado em arquivos, um arquivo por cap&iacute;tulo, 
	chamados <filename>chapter1.sgml</filename>,
	<filename>chapter2.sgml</filename>, e assim por diante, com 
	um arquivo <filename>book.sgml</filename> que ir&aacute; 
	conter estes cap&iacute;tulos.</para>
	
      <para>A fim de utilizar o conte&uacute;do destes arquivos como 
	os valores para as suas entidades, voc&ecirc; as declara com 
	a palavra chave <literal>SYSTEM</literal>.  Isto direciona o
	interpretador SGML para utilizar o conte&uacute;do dos 
	arquivos nomeados como o valor da entidade.</para>

      <example>
	<title>Utilizando entidades gerais para incluir
	  arquivos</title>
	
	<programlisting><![ CDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
<!ENTITY chapter.1 SYSTEM "chapter1.sgml">
<!ENTITY chapter.2 SYSTEM "chapter2.sgml">
<!ENTITY chapter.3 SYSTEM "chapter3.sgml">
<!-- e assim por diante -->
]>

<html>
  <!-- Utilize as entidades para carregar os cap&iacute;tulos -->

  &chapter.1;
  &chapter.2;
  &chapter.3;
</html>]]></programlisting>
      </example>

      <warning>
	<para>Quando utilizar uma entidade geral para incluir outros
	  arquivos em um documento, os arquivos que estiverem sendo
	  inclusos (<filename>chapter1.sgml</filename>,
	  <filename>chapter2.sgml</filename>, etc) 
	  <emphasis>n&atilde;o devem</emphasis> iniciar com uma 
	  declara&ccedil;&atilde;o DOCTYPE.  Isto &eacute; um erro 
	  de sintaxe.</para>
      </warning>
    </sect2>

    <sect2>
      <title>Utilizando entidades de par&acirc;metro para incluir 
	arquivos</title>

      <para>Recorde-se que uma entidade de par&acirc;metro s&oacute; pode 
	ser utilizada dentro de um contexto SGML.  Por que 
	ent&atilde;o voc&ecirc; desejaria incluir um arquivo dentro 
	de um contexto do SGML?</para>

      <para>Voc&ecirc; pode utilizar isto para assegurar-se de que 
	voc&ecirc; pode reutilizar as suas entidades gerais.</para>

      <para>Suponha que voc&ecirc; possui muitos cap&iacute;tulos em seu 
	documento, e voc&ecirc; reutiliza estes cap&iacute;tulos em dois 
	livros diferentes, cada livro organizando os cap&iacute;tulos de 
	uma forma diferente.</para>

      <para>Voc&ecirc; pode listar as entidades no topo de cada 
	livro, mas isto rapidamente torna-se incomodo de gerenciar.
	</para>

      <para>Em vez de disso, coloque as defini&ccedil;&otilde;es das 
	suas entidades gerais em um arquivo, e utilize uma entidade 
	de par&acirc;metro para incluir este arquivo dentro do seu 
	documento.</para>

      <example>
	<title>Utilizando entidades de par&acirc;metro para incluir
	  arquivos.</title>

	<para>Primeiro, coloque as suas defini&ccedil;&otilde;es de 
	  entidades em um arquivo separado, chamado 
	  <filename>chapters.ent</filename>.  Este arquivo 
	  cont&eacute;m o seguinte:</para>
	
	<programlisting><![ RCDATA [<!ENTITY chapter.1 SYSTEM "chapter1.sgml">
<!ENTITY chapter.2 SYSTEM "chapter2.sgml">
<!ENTITY chapter.3 SYSTEM "chapter3.sgml">]]></programlisting>

	<para>Agora crie uma entidade de par&acirc;metro para referenciar 
	  o conte&uacute;do do arquivo.  E ent&atilde;o utilize a 
	  entidade de par&acirc;metro para carregar o arquivo no seu 
	  documento, o que tornar&aacute; todas as entidades gerais 
	  dispon&iacute;veis para uso.  Feito isso, utilize as 
	  entidades gerais como antes;</para>
	
	<programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
<!-- Define uma entidade de par&acirc;metro para carregar as entidades gerais de capitulo -->
<!ENTITY % chapters SYSTEM "chapters.ent">

<!-- Agora utilize a entidade de par&acirc;metro para carregar neste arquivo -->
%chapters;
]>

<html>
  &amp;chapter.1;
  &amp;chapter.2;
  &amp;chapter.3;
</html>]]></programlisting>
      </example>
    </sect2>

    <sect2>
      <title>Para voc&ecirc; fazer&hellip;</title>

      <sect3>
	<title>Utilizando entidades gerais para incluir arquivos
	  </title>

	<procedure>
	  <step>
	    <para>Crie tr&ecirc;s arquivos, 
	      <filename>para1.sgml</filename>,
	      <filename>para2.sgml</filename>, e
	      <filename>para3.sgml</filename>.</para>

	    <para>Coloque um conte&uacute;do similar ao seguinte em 
	      cada arquivo:</para>

	    <programlisting><![ RCDATA [<p>Este &eacute; o primeiro par&aacute;grafo.</p>]]></programlisting>
	  </step>

	  <step>
	    <para>Edite o arquivo <filename>example.sgml</filename>
	      para que ele se pare&ccedil;a com este:</para>

	    <programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
<!ENTITY version "1.1">
<!ENTITY para1 SYSTEM "para1.sgml">
<!ENTITY para2 SYSTEM "para2.sgml">
<!ENTITY para3 SYSTEM "para3.sgml">
]>

<html>
  <head>
    <title>Um exemplo de arquivo HTML</title>
  </head>

  <body>
    <p>A vers&atilde;o atual deste documento &eacute;: &amp;version;</p>

    &amp;para1;
    &amp;para2;
    &amp;para3;
  </body>
</html>]]></programlisting>
	  </step>

	  <step>
	    <para>Produza o arquivo 
	      <filename>example.html</filename> atrav&eacute;s da
	      normaliza&ccedil;&atilde;o do arquivo 
	      <filename>example.sgml</filename>.</para>

            <screen>&prompt.user; <userinput>osgmlnorm -d example.sgml &gt; example.html</userinput></screen>
	  </step>

	  <step>
	    <para>Carregue o arquivo 
	      <filename>example.html</filename> no seu navegador web,
	      e confirme que os arquivos 
	      <filename>para<replaceable>n</replaceable>.sgml</filename>
	      foram inclu&iacute;dos no <filename>example.html</filename>.
	      </para>
	  </step>
	</procedure>
      </sect3>

      <sect3>
	<title>Utilizando uma entidade de par&acirc;metro para incluir
	  arquivos.</title>

	<note>
	  <para>Voc&ecirc; deve ter executado os passos anteriores 
	    primeiro.</para>
	</note>
	
	<procedure>
	  <step>
	    <para>Edite o arquivo 
	      <filename>example.sgml</filename> para que ele se
	      pare&ccedil;a com este:</para>
	
	    <programlisting><![ RCDATA [<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
<!ENTITY % entities SYSTEM "entities.sgml"> %entities;
]>

<html>
  <head>
    <title>Um exemplo de arquivo HTML</title>
  </head>

  <body>
    <p>A vers&atilde;o atual deste documento &eacute;: &amp;version;</p>

    &amp;para1;
    &amp;para2;
    &amp;para3;
  </body>
</html>]]></programlisting>
	  </step>

	  <step>
	    <para>Crie um novo arquivo chamado 
	      <filename>entities.sgml</filename>, com este 
	      conte&uacute;do:</para>

	    <programlisting><![ RCDATA [<!ENTITY version "1.1">
<!ENTITY para1 SYSTEM "para1.sgml">
<!ENTITY para2 SYSTEM "para2.sgml">
<!ENTITY para3 SYSTEM "para3.sgml">]]></programlisting>
	  </step>

	  <step>
	    <para>Produza o arquivo <filename>example.html</filename>
	      atrav&eacute;s da normaliza&ccedil;&atilde;o do arquivo
	      <filename>example.sgml</filename>.</para>

            <screen>&prompt.user; <userinput>osgmlnorm -d example.sgml &gt; example.html</userinput></screen>
	  </step>

	  <step>
	    <para>Carregue o arquivo 
	      <filename>example.html</filename> no seu navegador web
	      e confirme que os arquivos
	      <filename>para<replaceable>n</replaceable>.sgml</filename>
	      foram inclu&iacute;dos no arquivo 
	      <filename>example.html</filename>.</para>
	  </step>
	</procedure>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="sgml-primer-marked-sections">
    <title>Sess&otilde;es marcadas</title>

    <para>O SGML fornece um mecanismo para indicar que uma parte
      particular do documento deve ser processada de uma forma 
      especial.  Estas partes s&atilde;o denominadas 
      <quote>sess&otilde;es marcadas</quote>.</para>

    <example>
      <title>Estrutura de uma sess&atilde;o marcada</title>

      <programlisting>&lt;![ <replaceable>Palavra-chave</replaceable> [
  Conte&uacute;do da sess&atilde;o marcada
]]&gt;</programlisting>
    </example>

    <para>Como voc&ecirc; esperaria, sendo uma 
      constru&ccedil;&atilde;o SGML, uma sess&atilde;o
      marcada inicia com um <literal>&lt!</literal>.</para>

    <para>O primeiro colchete come&ccedil;a a limitar a sess&atilde;o
      marcada.</para>

    <para>A <replaceable>Palavra-chave</replaceable> descreve como 
      esta sess&atilde;o marcada deve ser processada pelo 
      interpretador.</para>

    <para>O segundo colchete indica que o conte&uacute;do da 
      sess&atilde;o marcada inicia aqui.</para>

    <para>A sess&atilde;o marcada &eacute; finalizada pelo fechamento
      dos dois colchetes e ent&atilde;o retornando ao contexto do 
      documento a partir do contexto SGML com o 
      <literal>&gt;</literal>.</para>

    <sect2>
      <title>Palavras-Chave de sess&otilde;es marcadas</title>

      <sect3>
	<title><literal>CDATA</literal>, 
	  <literal>RCDATA</literal></title>
	
	<para>Estas palavras chave denotam o <emphasis>modelo do 
	  conte&uacute;do</emphasis> das sess&otilde;es marcadas, e 
	  permitem que voc&ecirc; o altere a partir do padr&atilde;o.
	  </para>
	
	<para>Quando um interpretador SGML esta processando um
	  documento ele tenta seguir o que chamamos de <quote>modelo 
	  de conte&uacute;do</quote></para>
	
	<para>Resumidamente, o modelo de conte&uacute;do descreve 
	  que tipo de conte&uacute;do o interpretador esta esperando 
	  encontrar, e o que far&aacute; com ele quando o encontrar.
	  </para>
	
	<para>Os dois modelos de conte&uacute;do que voc&ecirc; 
	  provavelmente ir&aacute; achar mais &uacute;teis 
	  s&atilde;o o <literal>CDATA</literal> e o
	  <literal>RCDATA</literal>.</para>
	
	<para>O <literal>CDATA</literal> &eacute; para 
	  <quote>Dados de Caracter</quote>.  Se o interpretador 
	  est&aacute; neste modelo de conte&uacute;do ent&atilde;o ele
	  est&aacute; esperando encontrar caracteres, e apenas 
	  caracteres.  Neste modelo os s&iacute;mbolos 
	  <literal>&lt;</literal> e o <literal>&amp;</literal>
	  perdem o seu status especial, e ser&atilde;o tratados como 
	  caracteres ordin&aacute;rios.</para>
	
	<para>O <literal>RCDATA</literal> &eacute; para 
	  <quote>Refer&ecirc;ncias de entidade e dados de caracter
	  </quote>.  Se o interpretador est&aacute; neste
	  modelo de conte&uacute;do ele est&aacute; esperando 
	  encontrar caracteres <emphasis>e</emphasis> entidades.  
	  O s&iacute;mbolo <literal>&lt;</literal> perde
	  o seu status especial, mas o <literal>&amp;</literal> 
	  continuar&aacute; sendo tratado como o inicio de uma 
	  entidade geral.</para>

	<para>Isto &eacute; particularmente &uacute;til se voc&ecirc;
	  est&aacute; incluindo algum texto literal o qual 
	  cont&eacute;m muitos caracteres <literal>&lt;</literal> e 
	  <literal>&amp;</literal>.  Ao inv&eacute;s de atravessar o 
	  texto todo tendo que verificar se todos os  
	  <literal>&lt;</literal> est&atilde;o convertidos para um
	  <literal>&amp;lt;</literal> e todos os
	  <literal>&amp;</literal> est&atilde;o convertidos para um
	  <literal>&amp;amp;</literal> pode ser mais simples marcar 
	  a sess&atilde;o como contendo apenas 
	  <literal>CDATA</literal>.  Quando o interpretador SGML 
	  encontr&aacute;-los ele ir&aacute; ignorar os s&iacute;mbolos 
	  <literal>&lt;</literal> e <literal>&amp;</literal> 
	  embutidos no conte&uacute;do.</para>
	
	<note>
	  <para>Quando voc&ecirc; utiliza <literal>CDATA</literal> ou
	    <literal>RCDATA</literal> nos exemplos de texto marcado em
	    SGML, tenha em mente que o conte&uacute;do do
	    <literal>CDATA</literal> n&atilde;o &eacute; validado.  
	    Voc&ecirc; tem que verificar o SGML incluso no texto 
	    utilizando algum outro meio.  Voc&ecirc; pode, por 
	    exemplo, escrever o exemplo em outro documento, 
	    validar o c&oacute;digo de exemplo, e ent&atilde;o 
	    col&aacute;-lo para o seu conte&uacute;do
	    <literal>CDATA</literal>.</para>
	</note>

	<!-- O assentamento de CDATA dentro do exemplo seguinte &eacute; repugnante -->
	
	<example>
	  <title>Utilizando uma sess&atilde;o marcada como 
	    CDATA</title>
	
	  <programlisting>&lt;para>Aqui est&aacute; um exemplo de como voc&ecirc; incluiria algum texto que contenha muitos 
  s&iacute;mbolos &lt;literal>&amp;lt;&lt;/literal> e &lt;literal>&amp;amp;&lt;/literal>.  
  O texto de exemplo &eacute; um fragmento de HTML.  
  O texto circunvizinho (&lt;para> e &lt;programlisting>) &eacute; do
  DocBook.&lt;/para>
	  
&lt;programlisting>
  &lt;![ CDATA [  <![ RCDATA [
    <p>Esta &eacute; uma amostra que apresenta alguns elementos de HTML.
       Uma vez que os s&iacute;mbolos de < e > s&atilde;o utilizados muitas vezes, &eacute;
       mais f&aacute;cil dizer que o exemplo todo &eacute; uma sess&atilde;o marcada do
       tipo CDATA, do que utilizar nomes de entidades para representar
       estes s&iacute;mbolos ao longo de todo o texto.</p>

    <ul>
      <li>Este &eacute; um item de lista</li>
      <li>Este &eacute; um segundo item de lista</li>
      <li>Este &eacute; um terceiro item de lista</li>
    </ul>

    <p>Este &eacute; o final do exemplo.</p>]]>
  ]]&gt;
&lt;/programlisting></programlisting>

	  <para>Se voc&ecirc; examinar o fonte deste documento 
	    voc&ecirc; ir&aacute; ver que esta t&eacute;cnica foi 
	    utilizada por toda parte.</para>
	</example>
      </sect3>

      <sect3>
	<title><literal>INCLUDE</literal> and
	  <literal>IGNORE</literal></title>
	
	<para>Se a palavra chave for <literal>INCLUDE</literal> 
	  ent&atilde;o o conte&uacute;do da sess&atilde;o marcada 
	  ser&aacute; processado.  Se a palavra chave for 
	  <literal>IGNORE</literal> ent&atilde;o a sess&atilde;o 
	  marcada ser&aacute; ignorada e n&atilde;o ser&aacute; 
	  processada.  Ela n&atilde;o ir&aacute; aparecer no
	  output.</para>
	
	<example>
	  <title>Utilizando <literal>INCLUDE</literal> e
	    <literal>IGNORE</literal> nas sess&otilde;es marcadas</title>

	  <programlisting>&lt;![ INCLUDE [
  Este texto ser&aacute; processado e inclu&iacute;do.
]]&gt;

&lt;![ IGNORE [
  Este texto n&atilde;o ser&aacute; processado nem inclu&iacute;do.
]]&gt;</programlisting>
	</example>
	
	<para>Por si s&oacute;, isto n&atilde;o &eacute; muito 
	  &uacute;til.  Se voc&ecirc; desejar remover o texto do seu 
	  documento voc&ecirc; pode cort&aacute;-lo fora, ou 
	  coment&aacute;-lo.</para>
	
	<para>Torna-se mais &uacute;til quando voc&ecirc; utilizar 
	  <link linkend="sgml-primer-parameter-entities">entidades de
	  par&acirc;metro</link> para control&aacute;-lo.  Lembre-se que 
	  entidades de par&acirc;metro s&oacute; podem ser utilizadas em um 
	  contexto SGML, e que a palavra chave de uma sess&atilde;o 
	  marcada <emphasis>&eacute;</emphasis> um contexto 
	  SGML.</para>

	<para>Por exemplo, suponha que voc&ecirc; produza uma 
	  c&oacute;pia impressa e uma vers&atilde;o eletr&ocirc;nica 
	  de alguma documenta&ccedil;&atilde;o.  Voc&ecirc; pode
	  desejar incluir na vers&atilde;o eletr&ocirc;nica algum 
	  conte&uacute;do extra, o qual n&atilde;o deve aparecer na 
	  vers&atilde;o impressa.</para>
	
	<para>Crie uma entidade de par&acirc;metro, e configure seu valor
	  para <literal>INCLUDE</literal>.  Escreva seu documento,
	  usando uma sess&atilde;o marcada para delimitar o
	  conte&uacute;do 
	  que deve aparecer apenas na vers&atilde;o eletr&ocirc;nica.
	  Nesta sess&atilde;o marcada utilize a entidade de par&acirc;metro
	  no lugar da palavra chave.</para>
	
	<para>Quando voc&ecirc; desejar produzir uma c&oacute;pia 
	  impressa do documento, altere o valor da entidade de 
	  par&acirc;metro para <literal>IGNORE</literal> e reprocesse o 
	  documento.</para>
	
	<example>
	  <title>Utilizando uma entidade de par&acirc;metro para 
	    controlar uma sess&atilde;o marcada</title>
	
	  <programlisting>&lt;!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
&lt;!ENTITY % electronic.copy "INCLUDE">	     
]]&gt;

...

&lt;![ %electronic.copy [
  Este conte&uacute;do deve aparecer apenas na vers&atilde;o eletr&ocirc;nica do
  documento.
]]&gt;</programlisting>

	  <para>Quando for produzir uma vers&atilde;o impressa do 
	    documento, altere a defini&ccedil;&atilde;o da entidade 
	    para;</para>
	
	  <programlisting>&lt;!ENTITY % electronic.copy "IGNORE"></programlisting>

	  <para>Ao reprocessar o documento, a sess&atilde;o marcada 
	    que utilizar a entidade <literal>%electronic.copy
	    </literal> como a sua palavra chave ser&aacute; 
	    ignorada.</para>
	</example>
      </sect3>
    </sect2>

    <sect2>
      <title>Para voc&ecirc; fazer&hellip;</title>

      <procedure>
	<step>
	  <para>Crie um novo arquivo chamado 
	    <filename>section.sgml</filename>, o qual deve conter o 
	    seguinte conte&uacute;do:</para>

	  <programlisting>&lt;!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0//EN" [
&lt;!ENTITY % text.output "INCLUDE">
]&gt;

&lt;html>
  &lt;head>
    &lt;title>Um exemplo utilizando uma sess&atilde;o marcada.&lt;/title>
  &lt;/head>

  &lt;body>	    
    &lt;p>Este par&aacute;grafo &lt;![ CDATA [cont&ecirc;m muitos caracteres &lt;
      (&lt; &lt; &lt; &lt; &lt;) de forma que &eacute; mais simples utilizar
      uma sess&atilde;o marcada do tipo CDATA.]]&gt;&lt;/p>

    &lt;![ IGNORE [
    &lt;p>Este par&aacute;grafo definitivamente n&atilde;o ser&aacute; inclu&iacute;do
      no output.&lt;/p>
    ]]&gt;

    &lt;![ <![ CDATA [%text.output]]> [
    &lt;p>Este par&aacute;grafo pode ou n&atilde;o aparecer no output.&lt;/p>

    &lt;p>A sua ocorr&ecirc;ncia &eacute; controlada pela entidade de par&acirc;metro <![CDATA[%text.output]]>
      .&lt;/p>	    
    ]]&gt;
  &lt;/body>
&lt;/html></programlisting>	    
	</step>

	<step>
	  <para>Normalize este arquivo utilizando o 
	    <command>osgmlnorm</command> e examine o resultado.  
	    Observe quais par&aacute;grafos apareceram, quais desapareceram 
	      e o que aconteceu com o conte&uacute;do da 
	      sess&atilde;o marcada como CDATA.</para>
	</step>

	<step>
	  <para>Altere a defini&ccedil;&atilde;o da entidade 
	    <literal>text.output</literal> de <literal>INCLUDE
	    </literal> para <literal>IGNORE</literal>.  Re-normalize 
	    o arquivo, e observe o resultado para ver o que foi 
	    alterado.</para>
	</step>
      </procedure>
    </sect2>
  </sect1>

  <sect1 id="sgml-primer-conclusion">
    <title>Conclus&atilde;o</title>

    <para>Esta &eacute; a conclus&atilde;o da introdu&ccedil;&atilde;o
      ao SGML.  Devido a restri&ccedil;&otilde;es de espa&ccedil;o e 
      complexidade, diversos assuntos n&atilde;o foram abordados em 
      profundidade (ou sequer foram abordados).  Entretanto, as 
      sess&otilde;es pr&eacute;vias cobriram o suficiente do SGML 
      para que voc&ecirc; possa seguir a organiza&ccedil;&atilde;o 
      da documenta&ccedil;&atilde;o do FDP.</para>
  </sect1>
</chapter>
