<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;

<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN">
%freebsd;

<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;

<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//ES">
%mailing-lists;
]>

<article lang=es>
  <articleinfo>
    <title>FreeBSD en ordenadores port&aacute;tiles</title>

    <pubdate>$FreeBSD$</pubdate>
   
    <abstract>
      <para>FreeBSD funciona perfectamente en la mayor&iacute;a de 
        port&aacute;tiles aunque siempre haya excepciones.  En &eacute;ste 
        art&iacute;culo trataremos de las diferencias existentes 
        en el hardware de port&aacute;tiles 
        y sistemas de escritorio y de c&oacute;mo afecta esto al uso 
        de FreeBSD.</para> 
    </abstract>
  </articleinfo>

    <para>Es frecuente que se piense en FreeBSD como un sistema operativo 
      para servidores pero funciona muy bien como sistema de escritorio y 
      si quiere usarlo en su port&aacute;til dispondr&aacute; de todo su 
      potencial: 
      facilidad de administraci&oacute;n y actualizaci&oacute;n, el 
      sistema de <quote>ports</quote> y <quote>packages</quote> para 
      a&ntilde;adir software, etc.  Otras de sus caracter&iacute;sticas 
      m&aacute;s interesantes, como la estabilidad, el rendimiento en 
      red y bajo grandes cargas de trabajo pueden, por razones obvias, 
      no ser tan evidentes en un sistema port&aacute;til.  La 
      instalaci&oacute;n en port&aacute;tiles puede, sin embargo, 
      acarrear problemas que no encontrar&iacute;amos en sistemas de 
      escritorio y cuyas soluciones no podemos encontrar por doquier 
      a lo largo y ancho de Internet; los equipos port&aacute;tiles suelen 
      estar diseñados para Microsoft Windows, a&uacute;n con m&aacute;s 
      frecuencia que en sistemas de escritorio.  &Eacute;ste art&iacute;culo 
      tratar&aacute; de aclarar alguno de estos problemas.  Hay quien ha 
      documentado sus experiencias con &os; en modelos concretos de 
      port&aacute;tiles y las ha inclu&iacute;do en p&aacute;ginas web 
      que no forman parte de la documentaci&oacute;n oficial de &os;.  
      Es muy posible que encuentre informaci&oacute;n si introduce la 
      marca y modelo de su port&aacute;til y la palabra <quote>&os;</quote> 
      en un buscador.</para>

  <sect1>    
    <title>XFree86</title>
      
    <para>Las versiones recientes de <application>XFree86</application> 
      funcionar&aacute;n con la mayor&iacute;a de tarjetas gr&aacute;ficas 
      disponibles actualmente en port&aacute;tiles.  La aceleraci&oacute;n 
      gr&aacute;fica tal vez no est&eacute; soportada pero una 
      configuraci&oacute;n SVGA gen&eacute;rica deber&iacute;a 
      funcionar.</para> 

    <para>Consulte la documentaci&oacute;n de su port&aacute;til.   
      Ah&iacute; deber&iacute; encontrar todos los detalles de su tarjeta,
      tras lo cual deber&iacute;a recurrir a la  
      documentaci&oacute;n de <application>XFree86</application> 
      (o el programa de configuraci&oacute;n) para saber si est&aacute; 
      soportada o no.  Si no lo est&aacute; utilice un dispositivo 
      gen&eacute;rico pero  <emphasis>NO</emphasis> use uno cuyo 
      nombre simplemente le resulte parecido.  En la versi&oacute;n 4 de 
      <application>XFree86</application> puede probar suerte tecleando 
      <userinput>XFree86 -configure</userinput>, que ejecuta un proceso de 
      autodetecci&oacute;n y le puede facilitar una gran cantidad de 
      informaci&oacute;n muy &uacute;til.</para>

    <para>Con frecuencia el problema es la configuraci&oacute;n del 
      monitor.  La informaci&oacute;n sobre 
      <application>XFree86</application> 
      se centra en monitores CRT, por lo que disponer de una 
      configuraci&oacute;n para una pantalla LCD puede ser 
      peliagudo.  Quiz&aacute;s est&eacute; de suerte y no 
      tenga que especificar rangos de   
      <literal>HorizSync</literal> y <literal>VertRefresh</literal>.   
      Si esto no funciona la mejor opci&oacute;n es recurrir a la web 
      en busca de p&aacute;ginas dedicadas a la configuraci&oacute;n de X 
      en port&aacute;tiles; suelen estar orientadas a Linux pero no importa 
      dado que ambos sistemas operativos usan   
       <application>XFree86</application>, por lo que puede usar la 
      configuraci&oacute;n que alguien haya usado sobre un hardware 
      similar.</para>

    <para>La mayor&iacute;a de port&aacute;tiles incluyen dos 
      botones para las funciones de bot&oacute;n primario y 
      secundario del rat&oacute;n (mouse), lo que puede resultar 
      problem&aacute;tico en X ya que el bot&oacute;n central se 
      usa para pegar texto; puede <quote>mapear</quote> una 
      pulsaci&oacute;n simult&aacute;nea de ambos botones en la 
      configuraci&oacute;n de X que realice la funci&oacute;n del 
      bot&oacute;n central con la l&iacute;nea</para> 

    <programlisting>
      Option "Emulate3Buttons"
    </programlisting>

    <para>en el fichero <filename>XF86Config</filename> 
      en la secci&oacute;n <literal>InputDevice</literal>  
       de <application>XFree86</application> versi&oacute;n 4; para la 
      versi&oacute;n 3 simplemente a&ntilde;ada la l&iacute;nea 
      <literal>Emulate3Buttons</literal>, sin comillas, en la secci&oacute;n 
      <literal>Pointer</literal> .</para>
  </sect1> 

  <sect1> 
    <title>Modems</title>
    <para> 
      Los equipos port&aacute;tiles suelen inclu&iacute;r 
      modems internos.  Desgraciadamente eso casi siempre significa 
      que son <quote>winmodems</quote> cuyo funcionamiento depende 
      de software y para los cuales s&oacute;lo hay disponibles 
      controladores para windows.  A pesar de ello est&aacute;n 
      empezando a aparecer controladores para otros sistemas 
      operativos; por ejemplo, si su modem tiene un chipset 
      Lucent LT es muy posible que est&eacute; soportado por 
      el port  
      <filename role="package">comms/ltmdm</filename>.  Si ese no 
      es su caso tendr&aacute; que buscar un modem externo:  la 
      soluci&oacute;n m&aacute;s compacta probablemente sea un  
      modem PC Card (PCMCIA), de los que hablaremos m&aacute;s  
      adelante, pero 
      los modem serie o USB ser&aacute;n seguramente m&aacute;s 
      baratos.  Normalmente 
      los modems normales (es decir, los que no son winmodems), 
      deber&iacute;an funcionar sin problemas.</para> 

  </sect1> 

  <sect1> 
    <title>Dispositivos PCMCIA (PC Card)</title>

    <para> Muchos port&aacute;tiles incluyen bah&iacute;as 
      PCMCIA, tambi&eacute;n conocidas como PC Card, que suelen 
      estar soportadas perfectamente por FreeBSD.  Consulte el 
      mensaje de arranque de su sistema (mediante &man.dmesg.8;)   
      para saber si fueron detectadas correctamente; deber&iacute;an 
      figurar como  
      <devicename>pccard0</devicename>,
      <devicename>pccard1</devicename> etc.  en dispositivos como 
      <devicename>pcic0</devicename>).</para>

    <para>&os;&nbsp;4.X soporta tarjetas PCMCIA de 16 bits y  
      &os;&nbsp;5.X soporta tanto &eacute;stas  tarjetas de 16 bits  
      como tarjetas de 32 bits  
      <quote>CardBus</quote>.  Hay una lista de tarjetas soportadas en 
      el fichero  
      <filename>/etc/defaults/pccard.conf</filename>.  L&eacute;alo 
      cuidadosamente y siempre que sea posible compre tarjetas que 
      aparezcan en ese fichero.  Las que no aparecen es posible que funcionen 
      como dispositivos <quote>gen&eacute;ricos</quote>; en concreto 
      la mayor&iacute;a de los modem de 16 bits deber&iacute;an funcionar 
      correctamente siempre y cuando no sean winmodems (existen 
      tambi&eacute;n  como PC Cards, así que tenga cuidado).  Si su 
      sistema reconoce su tarjeta como un modem gen&eacute;rico tenga en 
      cuenta que el fichero <filename>pccard.conf</filename> especifica 
      por defecto un retardo de 10 segundos para evitar bloqueos en algunos 
      modelos; eso puede ser una precauci&oacute;n excesiva para su 
      modem as&iacute; que es posible que quiera cambiar ese valor, 
      reducirlo o incluso eliminarlo.</para> 

    <para>Algunas partes de  
      <filename>pccard.conf</filename> pueden necesitar un poco de 
      edici&oacute;n.  
       Busque la l&iacute;nea donde figura la irq y aseg&uacute;rese de 
      eliminar cualquier n&uacute;mero que est&eacute; en uso; si tiene 
      una tarjeta de sonido integrada borre irq 5, si no puede sufrir 
      bloqueos del sistema al insertar la tarjeta.  Consulte tambi&eacute;n 
      la memoria disponible para las  bah&iacute;as; si su tarjeta sigue sin ser 
      detectada pruebe a cambiar alguno de los valores posibles que 
      aparecen en la p&aacute;gina man de &man.pccardc.8;. 
    </para>

    <para>Si a&uacute;n no funciona puede lanzar el daemon 
      &man.pccardd.8;.  Para activarlo en el arranque a&ntilde;ada 
      <programlisting>pccard_enable="YES"</programlisting> en el 
      fichero  
      <filename>/etc/rc.conf</filename>.  Tras ese paso sus tarjetas 
      deber&iacute;an ser detectadas cuando las inserte y cuando las 
      extraiga; deber&iacute;an as&iacute;mismo aparecer entradas en 
      ficheros <quote>log</quote> reflejando el momento en el que 
      los nuevos dispositivos son activados.</para>

    <para>Ha habido cambios de gran calado en el c&oacute;digo 
      de pccard, como la inclusi&oacute;n de enrutado de 
      interrupciones ISA, muy &uacute;til en m&aacute;quinas en 
      las que hasta la irrupci&oacute;n de FreeBSD 4.4 no 
      era posible usar la BIOS PCI.  Si tiene problemas con 
      esto pruebe a actualizar su sistema.</para>
 
  </sect1> 

  <sect1> 

    <title>Administraci&oacute;n de energ&iacute;a</title>

    <para>Desgraciadamente no existe un soporte demasiado bueno 
      en FreeBSD.  Si tiene suerte algunas caracter&iacute;sticas 
      pueden ser funcionales mientras que otras no lo ser&aacute;n  
      en absoluto.</para>

    <para>Para complicar un poco m&aacute;s las cosas hay dos 
      est&aacute;ndares de administraci&oacute;n de energ&iacute;a,  
      APM y ACPI. El segundo se hizo para sustitu&iacute;r el primero 
      e incluye nuevas caracter&iacute;sticas pero tambi&eacute;n  
      m&aacute;s problemas.</para>

    <para>Algunos port&aacute;tiles soportan tanto APM como ACPI 
      (hasta cierto punto) mientras que otros s&oacute;lo soportan uno de 
      ellos as&iacute; que no tendr&aacute; m&aacute;s remedio que 
      experimentar con ambos para saber si dispone de administraci&oacute;n 
      de energ&iacute;a y hasta qu&eacute; punto.</para>

    <note>
      <para>No puede tener APM y ACPI activados simult&aacute;neamente, 
        aunque su port&aacute;til soporte ambos.</para>
    </note>

    <sect2>
      <title>APM</title>

      <para>Una BIOS con APM (Advanced Power Management, 
        Administraci&oacute;n 
        Avanzada de Energ&iacute;a) prov&eacute;e de soporte 
        para diversas caracter&iacute;sticas de administraci&oacute;n de 
        energ&iacute;a tales como <quote>standby</quote>, suspensi&oacute;n, 
        hibernaci&oacute;n, reducci&oacute;n de la velocidad del 
        reloj de la CPU, etc. y existe tanto en 
	&os;&nbsp;4.X como en &os;&nbsp;5.X.</para>

      <para>Para activar el soporte de APM deber&aacute; compilar 
        su kernel: a&ntilde;ada 
	<literal>device apm0</literal> en   
	&os;&nbsp;4.X y <literal>device apm</literal> en  
	&os;&nbsp;5.X. El soporte APM como m&oacute;dulo existe en  
	&os;&nbsp;5.X; para cargarlo en el arranque a&ntilde;ada 
        la l&iacute;nea  
	<literal>apm_load="YES"</literal> al fichero  
	<filename>/boot/loader.conf</filename>.</para>

      <para>En &os;&nbsp;5.X tendr&aacute; que asignar 
	<literal>hint.apm.0.disabled="0"</literal> en el fichero 
	<filename>/boot/device.hints</filename>.</para>

      <para>APM puede activarse en el arranque a&ntilde;adiendo 
	<literal>apm_enable="YES"</literal> en el fichero 
	<filename>/etc/rc.conf</filename>.  El daemon &man.apmd.8;  
        se puede lanzar a&ntilde;adiendo 
	<literal>apmd_enable="YES"</literal> al fichero 
	<filename>/etc/rc.conf</filename>, que se encarga de transmitir 
        ciertos eventos a la BIOS, de manera que sea posible 
        suspender/reanudar presionando alguna tecla concreta o 
        al abrir y al cerrar la pantalla.</para> 

      <para>Los comandos APM figuran en la p&aacute;gina man de 
        &man.apm.8;.  Por ejemplo <command>apm -b</command> suministra 
        el estado de la bater&iacute;a (o 255 si no est&aacute; soportado), 
        <command>apm -Z</command> pone el port&aacute;til en 
         <quote>standby</quote>, <command>apm -z</command> 
        (o <command>zzz</command>) lo suspende.  Para apagar el 
        sistema use <command>shutdown -p</command>.  Le recordamos 
        una vez m&aacute;s que alguna o incluso todas &eacute;stas 
        funciones pueden no funcionar del todo bien o incluso no hacerlo 
        en absoluto.</para> 

      <para>Es posible que la suspensi&oacute;n o    
        el modo <quote>standby</quote> funcione en consola pero 
        no en X (esto es, la pantalla no se recupera).  Si usa 
        &os;&nbsp;5.X una posible soluci&oacute;n es a&ntilde;adir  
        <literal>options       
	SC_NO_SUSPEND_VTYSWITCH</literal>
        al fichero de configuraci&oacute;n de su kernel y que lo 
        recompile.  Otra forma de solucionarlo es cambiar a otra 
        consola virtual (mediante 
        <keycombo
	action="simul"><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo>
        u otra tecla de funci&oacute;n) y ejecutar &man.apm.8;.  
        Si est&aacute; usando &man.apmd.8; puede automatizar 
        esto con &man.vidcontrol.1;: edite        
	<filename>/etc/apmd.conf</filename> y c&aacute;mbielo del 
        siguiente modo:</para> 

      <programlisting>apm_event SUSPENDREQ {
 exec "vidcontrol -s 1 &lt; /dev/console";
 exec "/etc/rc.suspend";
}

apm_event USERSUSPENDREQ {
 exec "vidcontrol -s 1 &lt; /dev/console";
 exec "sync && sync && sync";
 exec "sleep 1";
 exec "apm -z";
}

apm_event NORMRESUME, STANDBYRESUME {
 exec "/etc/rc.resume";
 exec "vidcontrol -s 9 &lt; /dev/console";
}</programlisting>
    </sect2>

    <sect2>
      <title>ACPI</title>

      <para>ACPI (Advanced Configuration and Power Management
	Interface, Interfaz para la Administraci&oacute;n de Energ&iacute;a 
        y Configuraci&oacute;n Avanzada) facilita no solo la 
        administraci&oacute;n de energ&iacute;a sino tambi&eacute;n 
        la detecci&oacute;n de hardware (sustituyendo la detecci&oacute;n 
        PnP y PCI). ACPI s&oacute;lo est&aacute; disponible en 
        &os;&nbsp;5.X y est&aacute; activado por defecto, as&iacute; que 
        no tiene que hacer nada especial para que funcione.  Puede 
        controlar el comportamiento de ACPI con  
	&man.acpiconf.8;.</para>

      <para>Desgraciadamente los fabricantes ponen a la venta sus 
        port&aacute;tiles con implementaciones ACPI defectuosas, 
        haciendo que habilitar ACPI algunas veces genere m&aacute;s 
        problemas que ventajas, hasta el punto de no poder siquiera 
        arrancar &os; en algunas m&aacute;quinas con ACPI 
        habilitado.</para>

      
      <para>Si ACPI le est&aacute; causando problemas deber&iacute;a 
        comprobar si el fabricante de su port&aacute;til ha 
        liberado una nueva versi&oacute;n de la BIOS que solucione 
        alguno de esos problemas.  Dado que la implementaci&oacute;n de 
        ACPI en &os; est&aacute; en constante evoluci&oacute;n deber&iacute;a 
        tambi&eacute;n actualizar su sistema;  tal vez as&iacute; sus 
        problemas se solucionen.</para> 

      <para>Si desea deshabilitar ACPI a&ntilde;ada
	<literal>hint.acpi.0.disabled="1"</literal> al fichero 
	<filename>/boot/device.hints</filename>.  ACPI puede 
        deshabilitarse temporalmente en el <quote>prompt</quote> 
        del arranque tecleando 
	<literal>unset acpi_load</literal> en caso de tener problemas 
        para arrancar una m&aacute;quina con ACPI 
        habilitado.  &os;&nbsp;5.1-RELEASE y posteriores disponen de 
        un men&uacute; en el arranque que controla c&oacute;mo &os;  
        arranca.  Una de las opciones que se suministran es la de 
        dehabilitar ACPI.  Para hacerlo simplemente seleccione  
	<guimenuitem>2. Boot &os; with ACPI
	disabled</guimenuitem> (Arrancar &os; con ACPI deshabilitado) 
        en el men&uacute;.</para>
    </sect2>

    <sect2>
      <title>Administraci&oacute;n de Energ&iacute;a de la Pantalla</title>

    <para>El sistema X window (<application>XFree86</application>) incluye 
      administraci&oacute;n de energ&iacute;a de la pantalla (consulte 
      la p&aacute;gina man de &man.xset.1; y busque en ella 
      <quote>dpms</quote>).  Tendr&aacute; que investigar.  Sin embargo 
      tenga en cuenta que tambi&eacute;n esto funciona de manera muy poco 
      fiable en port&aacute;tiles: con frecuencia apaga la pantalla pero 
      no apaga la retroiluminaci&oacute;n.</para>
    </sect2>

  </sect1>
</article>
