Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-src-lsp/_index.po
Languages: es, ru

source: Use Language Servers for development in the FreeBSD src tree to get precise go-to-definition and completion results.
es: Uso de Servidores de Lenguajes para desarrollo en el árbol de src de FreeBSD para obtener resultados precisos para saltar a definiciones o auto completado.
ru: Используйте языковые серверы для разработки в дереве исходного кода FreeBSD, чтобы получать точные результаты при переходах к определениям функций и переменных и при автодополнениях.

source: Use Language Servers for Development in the FreeBSD Src Tree
es: Uso de Servidores de Lenguajes para Desarrollo en el Árbol Src de FreeBSD
ru: Использование разработчиками языковых серверов в дереве исходного кода FreeBSD

source: Introduction
es: Introducción
ru: Введение

source: This guide is about setting up a FreeBSD src tree with language servers performing source code indexing. The guide describes the steps for Vim/NeoVim and VSCode. If you use a different text editor you can use this guide as a reference and search the equivalent commands for your preferred editor.
ru: Это руководство посвящено настройке дерева исходных кодов FreeBSD с использованием языковых серверов для индексации исходного кода. В руководстве описаны шаги для Vim/NeoVim и VSCode. Если вы используете другой текстовый редактор, вы можете использовать это руководство в качестве справочника и найти эквивалентные команды для вашего любимого редактора.

source: Requirements
ru: Требования

source: In order to follow this guide we need to install certain requirements. We need a Language server, `ccls` or `clangd`, and optionally a compilation database.
ru: Для следования этому руководству необходимо установить определённые требования. Нам понадобится языковой сервер, `ccls` или `clangd`, а также, опционально, база данных компиляции.

source: The installation of the Language server can be performed via `pkg` or via ports. If we chose `clangd` we need to install `llvm`.
ru: Установка языкового сервера может быть выполнена через `pkg` или через порты. Если мы выберем `clangd`, нам нужно установить `llvm`.

source: Using `pkg` to install `ccls`:
ru: Использование `pkg` для установки `ccls`:

source: If we want to use `clangd` we need to install `llvm` (The example command uses `llvm15` but choose the version you desire):
ru: Если мы хотим использовать `clangd`, нам необходимо установить `llvm` (в примере команды используется `llvm15`, но вы можете выбрать нужную версию):

source: To install via ports choose a favorite combination of tools from each category below:
ru: Для установки через порты выберите предпочтительную комбинацию инструментов из каждой категории ниже:

source: Language server implementations
es: Implementaciones de servidores de lenguajes
ru: Реализации языковых серверов

source: package:devel/llvm12[] (Other versions are okay, but newer is better. Replace `clangd12` with clangdN in case other versions are used.)
es: package:devel/llvm12[] (Otras versiones son válidas, pero cuanto más nuevo, mejor. Reemplaza `clangd12` con clangdN en caso de usar otra versión.)
ru: package:devel/llvm12[] (Другие версии также подходят, но чем новее, тем лучше. Замените `clangd12` на clangdN в случае использования других версий.)

source: Editors
es: Editores
ru: Редакторы

source: Compilation database generator
es: Generador de base de datos de compilación
ru: Генератор базы данных компиляции

source: package:devel/python[] (For llvm's scan-build-py implementation)
es: package:devel/python[] (Para la implementación de scan-build-py de llvm)
ru: package:devel/python[] (Для реализации scan-build-py из llvm)

source: package:devel/py-pip[] (For rizsotto's scan-build implementation)
es: package:devel/py-pip[] (Para la implementación de scan-build de rizsotto)
ru: package:devel/py-pip[] (Для реализации scan-build от rizsotto)

source: Editor settings
es: Configuración del editor
ru: Настройки редактора

source: LSP client plugins
es: Plugins de LSP para el cliente
ru: Плагины клиента LSP

source: The built-in plugin manager is used for both editors in this example. The LSP client plugin used is link:https://github.com/prabirshrestha/vim-lsp[prabirshrestha/vim-lsp].
es: Este ejemplo utiliza el gestor de plugins incorporado en ambos editores. El plugin de LSP para el cliente es link:https://github.com/prabirshrestha/vim-lsp[prabirshrestha/vim-lsp].
ru: Встроенный менеджер плагинов используется для обоих редакторов в этом примере. Плагин LSP-клиента, который используется, — это link:https://github.com/prabirshrestha/vim-lsp[prabirshrestha/vim-lsp].

source: To set up the LSP client plugin for Neovim:
es: Para configurar el plugin cliente de LSP en Neovim:
ru: Для настройки клиентского плагина LSP для Neovim:

source: and for Vim:
es: y para Vim:
ru: и для Vim:

source: To enable the LSP client plugin in the editor, add the following snippet into [.filepath]#~/.config/nvim/init.vim# when using Neovim, or [.filepath]#~/.vim/vimrc# when using Vim:
es: Para activar el plugin cliente de LSP en el editor, añade el siguiente fragmento en [.filepath]#~/.config/nvim/init.vim# cuando uses Neovim, o [.filepath]#~/.vim/vimrc# cuando uses Vim:
ru: Чтобы включить плагин LSP-клиента в редакторе, добавьте следующий фрагмент в [.filepath]#~/.config/nvim/init.vim# при использовании Neovim или в [.filepath]#~/.vim/vimrc# при использовании Vim:

source: For ccls
es: Para ccls
ru: Для ccls

source: For clangd
es: Para clangd
ru: Для clangd

source: Depending on the version that you installed for `clangd` you might need to update the `server-info` to point to the correct binary.
ru: В зависимости от установленной версии `clangd` может потребоваться обновить `server-info`, чтобы указать на правильный бинарный файл.

source: Please refer to link:https://github.com/prabirshrestha/vim-lsp/blob/master/README.md#registering-servers[] to learn about setting up key bindings and code completion. The official site of clangd is link:https://clangd.llvm.org[], and the repository link of ccls is link:https://github.com/MaskRay/ccls/[].
es: Por favor, dirígete a link:https://github.com/prabirshrestha/vim-lsp/blob/master/README.md#registering-servers[] para aprender cómo configurar los atajos de teclado y el auto completado de código. El sitio oficial de clangd es link:https://clangd.llvm.org[], y el enlace al repositorio de ccls es link:https://github.com/MaskRay/ccls/[].
ru: Обратитесь к link:https://github.com/prabirshrestha/vim-lsp/blob/master/README.md#registering-servers[], чтобы узнать о настройке сочетаний клавиш и автодополнения кода. Официальный сайт clangd находится по ссылке link:https://clangd.llvm.org[], а репозиторий ccls — link:https://github.com/MaskRay/ccls/[].

source: Below are the reference settings of keybindings and code completions. Put the following snippet into [.filepath]#~/.config/nvim/init.vim#, or [.filepath]#~/.vim/vimrc# for Vim users to use it:
es: Abajo se muestra la configuración de referencia para los atajos de teclado y el auto completado de código. Pon el siguiente fragmento en [.filepath]#~/.config/nvim/init.vim#, o [.filepath]#~/.vim/vimrc# para usarlo con Vim:
ru: Ниже приведены эталонные настройки сочетаний клавиш и автодополнения кода. Поместите следующий фрагмент в [.filepath]#~/.config/nvim/init.vim# или [.filepath]#~/.vim/vimrc# для пользователей Vim, чтобы использовать его:

source: LSP client plugins are required to launch the language server daemon. Press `Ctrl+Shift+X` to show the extension online search panel. Enter `llvm-vs-code-extensions.vscode-clangd` when running clangd, or `ccls-project.ccls` when running ccls.
es: Los plugins de cliente de LSP son necesarios para arrancar un demonio de servidor de lenguajes. Presiona `Ctrl+Shift+X` para mostrar el panel de búsquedas online de extensiones. Teclea `llvm-vs-code-extensions.vscode-clangd` cuando utilices clangd, o `ccls-project.ccls` cuando utilices ccls.
ru: Для работы демона языкового сервера необходимы клиентские плагины LSP. Нажмите `Ctrl+Shift+X`, чтобы открыть панель поиска расширений в сети. Введите `llvm-vs-code-extensions.vscode-clangd` при использовании clangd или `ccls-project.ccls` при использовании ccls.

source: Then, press `Ctrl+Shift+P` to show the editor commands palette. Enter `Preferences: Open Settings (JSON)` into the palette and hit `Enter` to open [.filepath]#settings.json#. Depending on the language server implementations, put one of the following JSON key/value pairs in [.filepath]#settings.json#:
es: Después, presiona `Ctrl+Shift+P` para mostrar la paleta del editor de comandos. Teclea `Preferences: Open Settings (JSON)` y presiona `Enter` para abrir [.filepath]#settings.json#. Dependiendo de la implementación del servidor de lenguajes, utiliza uno de los siguientes pares de clave/valor de JSON en [.filepath]#settings.json#:
ru: Затем нажмите `Ctrl+Shift+P`, чтобы открыть палитру команд редактора. Введите `Preferences: Open Settings (JSON)` в палитру и нажмите `Enter`, чтобы открыть [.filepath]#settings.json#. В зависимости от реализации языкового сервера, добавьте одну из следующих пар ключ/значение JSON в [.filepath]#settings.json#:

source: Compilation database
es: Base de datos de compilación
ru: База данных компиляции

source: A Compilation database contains an array of compile command objects. Each object specifies a way of compiling a source file. The compilation database file is usually [.filename]#compile_commands.json#. The database is used by language server implementations for indexing purpose.
ru: База данных компиляции содержит массив объектов команд компиляции. Каждый объект определяет способ компиляции исходного файла. Файл базы данных компиляции обычно называется [.filename]#compile_commands.json#. База данных используется реализациями языковых серверов для целей индексирования.

source: Please refer to link:https://clang.llvm.org/docs/JSONCompilationDatabase.html#format[] for details on the format of the compilation database file.
es: Por favor consulta link:https://clang.llvm.org/docs/JSONCompilationDatabase.html#format[] para detalles acerca del formato del fichero de la base de datos de compilación.
ru: Пожалуйста, обратитесь к link:https://clang.llvm.org/docs/JSONCompilationDatabase.html#format[] для получения подробностей о формате файла базы данных компиляции.

source: Generators
es: Generadores
ru: Генераторы

source: Using scan-build-py
es: Utilizando scan-build-py
ru: Использование scan-build-py

source: Installation
es: Instalación
ru: Установка

source: `intercept-build` tool from scan-build-py is used to generate compilation database.
es: La herramienta `intercept-build` de scan-build-py se utiliza para generar la base de datos de compilación.
ru: Инструмент `intercept-build` из scan-build-py используется для создания базы данных компиляции.

source: Install package:devel/python[] to get python interpreter first. To get `intercept-build` from LLVM:
es: Instala package:devel/python[] primero para tener el intérprete de python. Para obtener `intercept-build` de LLVM:
ru: Установите пакет package:devel/python[], чтобы получить интерпретатор python. Для получения `intercept-build` из LLVM:

source: where [.filename]#/path/to/llvm-project/# is your desired path for the repository. Make an alias in the shell configuration file for convenience:
es: donde [.filename]#/path/to/llvm-project/# es la ruta que quieres en el repositorio. Crea un alias en el fichero de configuración del shell para tu comodidad:
ru: где [.filename]#/path/to/llvm-project/# — это желаемый путь для репозитория. Для удобства создайте алиас в файле конфигурации оболочки:

source: link:https://github.com/rizsotto/scan-build[rizsotto/scan-build] can be used instead of LLVM's scan-build-py. The LLVM's scan-build-py was rizsotto/scan-build merged into the LLVM tree. This implementation can be installed by `pip install --user scan-build`. The `intercept-build` script is in [.filename]#~/.local/bin# by default.
es: Se puede usar link:https://github.com/rizsotto/scan-build[rizsotto/scan-build] en lugar del scan-build-py de LLVM. El scan-build-py de LLVM era rizsotto/scan-build que se integró en el árbol de LLVM.Se puede instalar esta implementación mediante `pip install --user scan-build`. El script `intercept-build` está en [.filename]#~/.local/bin# por defecto.
ru: link:https://github.com/rizsotto/scan-build[rizsotto/scan-build] можно использовать вместо LLVM's scan-build-py. LLVM's scan-build-py был объединён в дерево LLVM из rizsotto/scan-build. Эту реализацию можно установить с помощью `pip install --user scan-build`. Скрипт `intercept-build` по умолчанию находится в [.filename]#~/.local/bin#.

source: Usage
es: Uso
ru: Использование

source: In the top-level directory of the FreeBSD src tree, generate the compilation database with `intercept-build`:
es: En el directorio de más alto nivel en el árbol src de FreeBSD, genera la base de datos de compilación con `intercept-build`:
ru: В корневом каталоге исходного кода FreeBSD создайте базу данных компиляции с помощью `intercept-build`:

source: The `--append` flag tells the `intercept-build` to read an existing compilation database (if a compilation database exists) and append the results to the database. Entries with duplicated command keys are merged. The generated compilation database by default is saved in the current working directory as [.filename]#compile_commands.json#.
ru: Флаг `--append` указывает `intercept-build` прочитать существующую базу данных компиляции (если она существует) и добавить результаты в базу данных. Записи с дублирующимися ключами команд объединяются. Сгенерированная база данных компиляции по умолчанию сохраняется в текущей рабочей директории как [.filename]#compile_commands.json#.

source: Using devel/bear
es: Usando devel/bear
ru: Использование devel/bear

source: In the top-level directory of the FreeBSD src tree, to generate compilation database with `bear`:
es: En el directorio de más alto nivel en el árbol src de FreeBSD, genera la base de datos de compilación con `bear`:
ru: В корневом каталоге исходного кода FreeBSD, чтобы создать базу данных компиляции с помощью `bear`:

source: The `--append` flag tells `bear` to read an existing compilation database if it is present, and append the results to the database. Entries with duplicated command keys are merged. The generated compilation database by default is saved in the current working directory as [.filename]#compile_commands.json#.
ru: Флаг `--append` указывает `bear` прочитать существующую базу данных компиляции, если она есть, и добавить результаты в неё. Записи с дублирующимися ключами команд объединяются. Сгенерированная база данных компиляции по умолчанию сохраняется в текущей рабочей директории как [.filename]#compile_commands.json#.

source: Final
ru: Последние шаги

source: Once the compilation database is generated, open any source files in the FreeBSD src tree and LSP server daemon will be launched as well in background. Opening source files in the src tree for the first time takes significantly longer time before the LSP server is able to give a complete result, due to initial background indexing by the LSP server compiling all the listed entries in the compilation database. The language server daemon however does not index the source files not appearing in the compilation database, thus no complete results are shown on source files not being compiled during the `make`.
es: Una vez que la base de datos de compilación ha sido generada, abre cualquier fichero fuente del árbol src de FreeBSD y el demonio servidor de LSP será arrancado también en segundo plano. Abrir ficheros fuente en el árbol src la primera vez lleva significativamente más tiempo antes de que el servidor LSP sea capaz de completar el resultado, debido al indexado inicial en segundo plano que realiza el servidor LSP mediante la compilación de todas las entradas listadas en la base de datos de compilación. Sin embargo el demonio de servicio de lenguajes no indexa ficheros fuente que no aparecen en la base de datos de compilación, por lo tanto no se muestran resultados completos para ficheros fuentes que no se compilan durante la ejecución de `make`.
ru: После создания базы данных компиляции откройте любой исходный файл в дереве исходного кода FreeBSD, и серверный демон LSP также запустится в фоновом режиме. Первое открытие исходных файлов в дереве src занимает значительно больше времени, прежде чем сервер LSP сможет предоставить полный результат, из-за первоначального фонового индексирования сервером LSP, который компилирует все перечисленные записи в базе данных компиляции. Однако демон языкового сервера не индексирует исходные файлы, отсутствующие в базе данных компиляции, поэтому полные результаты не отображаются для исходных файлов, которые не компилировались во время выполнения `make`.

source: This guide is about setting up a FreeBSD src tree with language servers performing source code indexing.
es: Esta guía es acerca de cómo configurar un árbol src de FreeBSD con servidores de lenguajes para realizar indexado de código fuente.

source: Required Ports
es: Ports Requeridos

source: Some ports are required throughout the guide. Choose a favorite combination of tools from each category below:
es: Se necesitan algunos ports a lo largo de esta guía. Escoge tu combinación favorita de herramientas de cada una de las categorías siguientes:

source: A Compilation database contains an array of compile command objects. Each object specifies a way of compiling a source file. The compilation database file is usually [.filename]#compiler_commands.json#. The database is used by language server implementations for indexing purpose.
es: Una base de datos de compilación contiene un array de objetos de comandos de compilación. Cada objeto especifica una forma de compilar un fichero fuente. El fichero de la base de datos de compilación es normalmente [.filename]#compiler_commands.json#. La base de datos es utilizada por el servidor de lenguajes con propósitos de indexado.

source: The `--append` flag tells the `intercept-build` to read an existing compilation database (if a compilation database exists) and append the results to the database. Entries with duplicated command keys are merged. The generated compilation database by default is saved in the current working directory as [.filename]#compiler_commands.json#.
es: El flag `--apend` le dice a `intercept-build` que lea una base de datos de compilación existente (si es que existe) y que añada los resultados a dicha base de datos. Las entradas con claves duplicadas de comandos son integradas. La base de datos de compilación generada por defecto se salva en el directorio de trabajo actual como [.filename]#compiler_commands.json#.

source: The `--append` flag tells `bear` to read an existing compilation database if it is present, and append the results to the database. Entries with duplicated command key are merged. The generated compilation database by default is saved in the current working directory as [.filename]#compiler_commands.json#.
es: El flag `--apend` le dice a `bear` que lea una base de datos de compilación existente (si es que existe) y que añada los resultados a dicha base de datos. Las entradas con claves duplicadas de comandos son integradas. La base de datos de compilación generada por defecto se salva en el directorio de trabajo actual como [.filename]#compiler_commands.json#.
