Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/explaining-bsd/_index.po
Languages: pt_br, ru

source: Brief explanation about BSD
pt_br: Breve explicação sobre BSD
ru: Короткое объяснение, что такое BSD

source: Explaining BSD
pt_br: Explicando o BSD
ru: Что такое BSD

source: Abstract
pt_br: Resumo
ru: Аннотация

source: In the open source world, the word "Linux" is almost synonymous with "Operating System", but it is not the only open source UNIX(R) operating system.
pt_br: No mundo do código aberto, a palavra "Linux" é praticamente sinônimo de "Sistema Operacional", mas ele não é o único sistema operacional UNIX(R) de código aberto.
ru: В мире программ с открытыми исходниками, слово "Linux" практически стало синонимом слова "Операционная Система", хотя это далеко не единственная операционная система UNIX(R), исходные коды которой доступны широкой публике.

source: So what is the secret? Why is BSD not better known? This white paper addresses these and other questions.
pt_br: Então, qual é o segredo? Por que o BSD não é mais conhecido? Este artigo aborda esta e outras questões.
ru: Так в чём же секрет? Почему известность BSD оставляет желать лучшего? Эта публикация ставить целью ответить на эти и другие вопросы.

source: Throughout this paper, differences between BSD and Linux will be noted __like this__.
pt_br: Ao longo deste artigo, as diferenças entre BSD e Linux serão destacadas __desta forma__.
ru: На протяжении всего текста обращайте внимание на _выделенные_ отличия BSD от Linux.

source: What is BSD?
pt_br: O que é o BSD?
ru: Что такое BSD?

source: BSD stands for "Berkeley Software Distribution". It is the name of distributions of source code from the University of California, Berkeley, which were originally extensions to AT&T's Research UNIX(R) operating system. Several open source operating system projects are based on a release of this source code known as 4.4BSD-Lite. In addition, they comprise a number of packages from other Open Source projects, including notably the GNU project. The overall operating system comprises:
pt_br: BSD é a sigla para "Berkeley Software Distribution". É o nome do código fonte distribuído pela Universidade da Califórnia, Berkeley, que era originalmente uma extensão do UNIX(R) desenvolvido pela área de pesquisa da AT&T. Diversos projetos de sistemas operacionais de código aberto foram baseados em uma versão deste código, conhecido como 4.4BSD-Lite. Além disso, eles incluem vários pacotes de outros projetos de código aberto, com destaque para os do projeto GNU. O sistema operacional geralmente abrange:
ru: BSD означает "Berkeley Software Distribution". Так называлось программное обеспечение, распространявшееся в исходных кодах Калифорнийским Университетом в Беркли, которое сначала представляло из себя дополнения к операционной системе UNIX(R) компании AT&T. На основе версии 4.4BSD-Lite были созданы несколько операционных систем с открытыми исходными кодами. В их состав включены разработки других проектов, среди которых особо следует выделить Проект GNU. Вот что такое собственно операционная система BSD:

source: The BSD kernel, which handles process scheduling, memory management, symmetric multi-processing (SMP), device drivers, etc.
pt_br: O kernel BSD, que lida com o agendamento de processos, gerenciamento de memória, multi processamento simétrico (symmetric multi-processing ou SMP), drivers de dispositivos, etc.
ru: Ядро BSD, отвечающее за планировку процессов, управление памятью, поддержку многопроцессорных систем (SMP), работу с устройствами и так далее.

source: The C library, the base API for the system.
pt_br: A biblioteca C, a API base do sistema.
ru: Библиотека C, основной системный интерфейс программирования.

source: __The BSD C library is based on code from Berkeley, not the GNU project.__
pt_br: __A biblioteca C do BSD é baseada no código de Berkeley, não no projeto GNU.__
ru: __Библиотека C в BSD основывается на коде из Беркли, а не из Проекта GNU.__

source: Utilities such as shells, file utilities, compilers and linkers.
pt_br: Utilitários como shells, gerenciadores de arquivos, compiladores e linkers (conversores de arquivos compilados em executáveis).
ru: Оболочки, файловые утилиты, компиляторы, редакторы связей и другие утилиты пользователя.

source: __Some of the utilities are derived from the GNU project, others are not.__
pt_br: __Alguns utilitários são derivados do projeto GNU, outros não são.__
ru: __Некоторые из них базируются на коде GNU, а некоторые -- нет.__

source: The X Window system, which handles graphical display.
pt_br: O sistema X Window, que gerencia a interface gráfica.
ru: Система X Window, отвечающая за графический интерфейс.

source: The X Window system used in most versions of BSD is maintained by the http://www.X.org/[X.Org project]. FreeBSD allows the user to choose from a variety of desktop environments, such as Gnome, KDE, or Xfce; and lightweight window managers like Openbox, Fluxbox, or Awesome.
pt_br: O sistema X Window usado na maioria das versões do BSD é mantido pelo http://www.X.org/[Projeto X.Org]. O FreeBSD permite ao usuário escolher a partir de uma variedade de ambientes de desktop, tais como o Gnome, KDE ou Xfce; e gerenciadores gráficos (gerenciadores de janelas) mais leves, como Openbox, Fluxbox ou Awesome.
ru: Система X Window, которая используется в большинстве версий BSD, поддерживается http://www.X.org/[проектом X.Org]. FreeBSD дает пользователю возможность выбирать из множества графических оболочек, таких как GNOME, KDE или Xfce; а также из множества легких оконных менеджеров наподобие Openbox, Fluxbox или Awesome.

source: Many other programs and utilities.
pt_br: Diversos outros programas e utilitários.
ru: Множество разных других прикладных и системных программ.

source: What, a real UNIX(R)?
pt_br: O que, um verdadeiro UNIX(R)?
ru: Что, настоящий UNIX(R)?

source: The BSD operating systems are not clones, but open source derivatives of AT&T's Research UNIX(R) operating system, which is also the ancestor of the modern UNIX(R) System V. This may surprise you. How could that happen when AT&T has never released its code as open source?
pt_br: Os sistemas operacionais BSD não são cópias ou clones, mas sim derivações de código aberto do sistema operacional UNIX(R) da AT&T, que também é o ancestral do moderno UNIX(R) System V. Isto pode surpreendê-lo. Como isto é possível, uma vez que a AT&T nunca liberou seu código como código aberto?
ru: Операционные системы BSD не являются клонами друг друга. Они лишь потомки общего предка, ОС UNIX(R) от AT&T Research, которая также дала начало современной ОС UNIX(R) System V. Это факт может удивить, если вспомнить, что AT&T никогда не открывала исходные коды своих разработок.

source: It is true that AT&T UNIX(R) is not open source, and in a copyright sense BSD is very definitely _not_ UNIX(R), but on the other hand, AT&T has imported sources from other projects, noticeably the Computer Sciences Research Group (CSRG) of the University of California in Berkeley, CA. Starting in 1976, the CSRG started releasing tapes of their software, calling them _Berkeley Software Distribution_ or __BSD__.
pt_br: É verdade que o UNIX(R) da AT&T não é um sistema de código aberto e no sentido de licenciamento o BSD definitivamente _não é_ UNIX(R), mas por outro lado a AT&T importou fontes de outros projetos, principalmente do Grupo de Pesquisa de Ciências da Computação (Computer Sciences Research Group ou CSRG) da Universidade da Califórnia em Berkeley, CA. A partir de 1976, o CSRG começou a liberar fitas de seu software, chamando ele de _Berkeley Software Distribution_ ou __BSD__.
ru: Действительно, UNIX(R) никогда не был программным обеспечением с открытым исходным кодом, и в законном смысле BSD определённо _НЕ_ UNIX(R). Но с другой стороны, в AT&T активно использовали чужие разработки, например программное обеспечение, разрабатываемое Группой по Исследованиям в области Информатики (CSRG) Калифорнийского Университета в Беркли. С 1976 CSRG выпускала свой код на магнитных лентах под названием __Berkely Software Distribution__, сокращённо __BSD__.

source: Initial BSD releases consisted mainly of user programs, but that changed dramatically when the CSRG landed a contract with the Defense Advanced Research Projects Agency (DARPA) to upgrade the communications protocols on their network, ARPANET. The new protocols were known as the __Internet Protocols__, later _TCP/IP_ after the most important protocols. The first widely distributed implementation was part of 4.2BSD, in 1982.
pt_br: As primeiras distribuições do BSD consistiam principalmente em programas de usuários mas isso mudou radicalmente quando o CSRG firmou um contrato com a Agência de Pesquisa de Projetos de Defesa Avançados (Defense Advanced Research Projects Agency ou DARPA) para atualizar os protocolos de comunicação de sua rede, a ARPANET. Os novos protocolos ficaram conhecidos como __Internet Protocols__, posteriormente _TCP/IP_ em virtude dos protocolos mais importantes. A primeira implementação amplamente distribuída foi parte do 4.2BSD, em 1982.
ru: Изначально дистрибутивы BSD представляли собой наборы пользовательских программ, и так было до тех пор, пока CSRG не заключила контракт с Агентством по Перспективным Проектам при Министерстве Обороны США (DARPA). Целью контракта было обновление коммуникационных протоколов, на которых держалась компьютерная сеть агентства -- ARPANET. Новое семейство протоколов получило имя _Internet Protocols_ или __TCP/IP__, по названиям двух основных протоколов. Их первая широко известная реализация была выпущена в составе 4.2BSD в 1982 году.

source: In the course of the 1980s, a number of new workstation companies sprang up. Many preferred to license UNIX(R) rather than developing operating systems for themselves. In particular, Sun Microsystems licensed UNIX(R) and implemented a version of 4.2BSD, which they called SunOS(TM). When AT&T themselves were allowed to sell UNIX(R) commercially, they started with a somewhat bare-bones implementation called System III, to be quickly followed by System V. The System V code base did not include networking, so all implementations included additional software from the BSD, including the TCP/IP software, but also utilities such as the _csh_ shell and the _vi_ editor. Collectively, these enhancements were known as the __Berkeley Extensions__.
pt_br: Durante a década de 80 surgiram muitas empresas produtoras de estações de trabalho. A maioria preferiu licenciar o UNIX(R) ao invés de desenvolver seus próprios sistemas operacionais. Em particular, a Sun Microsystems licenciou o UNIX(R) e implementou uma versão do 4.2BSD, a qual eles chamaram de SunOS(TM). Quando a própria AT&T começou a comercializar o UNIX(R), eles começaram com uma implementação de certa forma simples chamada de System III, que logo transformou-se no System V. O código base do System V não incluía comunicação em rede, então todas as implementações incluíram software adicional do BSD, inclusive o software TCP/IP, e também utilitários como o shell _csh_ e o editor __vi__. Estes aprimoramentos ficaram conhecidos como __Berkeley Extensions__.
ru: В течение восьмидесятых годов образовалось несколько компаний по производству рабочих станций. Многие из них предпочли купить лицензию на UNIX(R), нежели разрабатывать своё ПО с нуля. Следует отметить компанию Sun, которая поступила именно таким образом и на основе 4.2BSD выпустила свою операционную систему SunOS(TM). Когда AT&T тоже решила заняться коммерческой продажей своей ОС UNIX(R), появилась на свет несколько аскетичная реализация под названием System III, за которой в скором времени последовала System V. Интересно, что эти версии не содержали в себе собственной поддержки работы в сети и использовали код BSD, в том числе реализацию TCP/IP и набор утилит, среди которых следует выделить оболочку _csh_ и текстовый редактор __vi__. Все эти "добавки" совместно получили название __Berkely Extensions__.

source: The BSD tapes contained AT&T source code and thus required a UNIX(R) source license. By 1990, the CSRG's funding was running out, and it faced closure. Some members of the group decided to release the BSD code, which was Open Source, without the AT&T proprietary code. This finally happened with the __Networking Tape 2__, usually known as __Net/2__. Net/2 was not a complete operating system: about 20% of the kernel code was missing. One of the CSRG members, William F. Jolitz, wrote the remaining code and released it in early 1992 as __386BSD__. At the same time, another group of ex-CSRG members formed a commercial company called http://www.bsdi.com/[Berkeley Software Design Inc.] and released a beta version of an operating system called http://www.bsdi.com/[BSD/386], which was based on the same sources. The name of the operating system was later changed to BSD/OS.
pt_br: As fitas do BSD continham código fonte da AT&T e portanto necessitavam da licença dos fontes do UNIX(R). Por volta de 1990, os recursos financeiros do CSRG's estavam acabando, e ele foi encerrado. Alguns membros do grupo decidiram liberar o código do BSD, que era código aberto, sem o código proprietário da AT&T. Isso finalmente aconteceu com a fita __Networking Tape 2__, também conhecida como __Net/2__. O Net/2 não era um sistema operacional completo: faltava cerca de 20% do código fonte do kernel. Um dos membros do CSRG, William F. Jolitz, escreveu o código que faltava e o liberou no início de 1992 sob o nome de __386BSD__. Ao mesmo tempo, um outro grupo de ex integrantes do CSRG formaram uma empresa comercial chamada http://www.bsdi.com/[Berkeley Software Design Inc.] e liberaram uma versão beta de um sistema operacional chamado http://www.bsdi.com/[BSD/386], o qual era baseado nos mesmos fontes. Mais tarde o nome deste sistema operacional foi alterado para BSD/OS.
ru: Дистрибутив BSD содержал код, принадлежавший AT&T, и, следовательно, требовал лицензии. К 1990 году финансирование CSRG прекратилось, и группа была распущена. Кое-кто из бывших членов группы решил опубликовать код BSD отдельно от закрытого кода AT&T. В концe концов это удалось, и так появилась на свет версия _Networking Tape 2_ или __Net/2__. Net/2 не была законченной, цельной операционной системой: около 20% кода ядра отсутствовало. Один из членов CSRG, William F. Jolitz, дописал недостающий код и опубликовал результат в начале 1992 года под именем __386BSD__. В то же самое время другая группа бывших членов CSRG организовала коммерческую компанию http://www.bsdi.com/[Berkeley Software Design Inc.] и выпустила бета-версию операционной системы http://www.bsdi.com/[BSD/386], которая базировалась на том же самом коде. Позже это название было изменено на BSD/OS.

source: 386BSD never became a stable operating system. Instead, two other projects split off from it in 1993: http://www.NetBSD.org/[NetBSD] and link:https://www.FreeBSD.org/[FreeBSD]. The two projects originally diverged due to differences in patience waiting for improvements to 386BSD: the NetBSD people started early in the year, and the first version of FreeBSD was not ready until the end of the year. In the meantime, the code base had diverged sufficiently to make it difficult to merge. In addition, the projects had different aims, as we will see below. In 1996, http://www.OpenBSD.org/[OpenBSD] split off from NetBSD, and in 2003, http://www.dragonflybsd.org/[DragonFlyBSD] split off from FreeBSD.
pt_br: O 386BSD nunca chegou a ser um sistema operacional estável. Ao invés disso, dois outros projetos surgiram a partir dele em 1993: http://www.NetBSD.org/[NetBSD] e link:www.FreeBSD.org[FreeBSD]. Este dois projetos divergiam originalmente na questão da espera pelas melhorias no 386BSD: o pessoal do NetBSD iniciou no começo daquele ano, e a primeira versão do FreeBSD não ficou pronta antes do final do ano. Neste meio tempo o código base ficou diferente um do outro o suficiente para tornar difícil sua fusão. Além disso, os projetos tinham objetivos diferentes, como veremos adiante. Em 1996, o http://www.OpenBSD.org/[OpenBSD] surgiu a partir do NetBSD, e em 2003, o http://www.dragonflybsd.org/[DragonFlyBSD] surgiu a partir do FreeBSD.
ru: 386BSD так никогда и не стала полноценной операционной системой. Зато в 1993 году из неё выделились два проекта: http://www.NetBSD.org/[NetBSD] и link:https://www.FreeBSD.org/[FreeBSD]. Изначально разработчики разделились на два лагеря из-за расхождений во мнениях относительно того, сколько же ещё можно ждать улучшений в 386BSD. В начале года образовалась NetBSD, а первая версия FreeBSD была готова только к его концу. Время шло, и технические различия возрастали. Вдобавок проекты поставили перед собой разные цели, как будет показано ниже. В 1996 году от NetBSD отделился ещё один проект - http://www.OpenBSD.org/[OpenBSD], а в 2003 году от FreeBSD отделилась http://www.dragonflybsd.org/[DragonFlyBSD].

source: Why is BSD not better known?
pt_br: Por que o BSD não é mais conhecido?
ru: Почему BSD недостаточно известна?

source: For a number of reasons, BSD is relatively unknown:
pt_br: Por uma série de razões, o BSD é relativamente desconhecido:
ru: Действительно, существует ряд причин этому недоразумению:

source: The BSD developers are often more interested in polishing their code than marketing it.
pt_br: Os desenvolvedores do BSD estão mais interessados em aprimorar o seu código do que em divulgá-lo.
ru: Разработчики BSD часто больше заинтересованы в качестве своего кода и заняты его "шлифовкой", а не рекламой.

source: Much of Linux's popularity is due to factors external to the Linux projects, such as the press, and to companies formed to provide Linux services. Until recently, the open source BSDs had no such proponents.
pt_br: Grande parte da popularidade do Linux se deve a fatores externos ao projeto Linux, como a mídia e empresas que foram criadas para prover serviços Linux. Até pouco tempo atrás os BSD de código aberto não tinham este tipo de proposta.
ru: По большому счёту Linux своей популярностью обязан прежде всего внешним по отношению к проекту факторам, например средствам массовой информации и компаниям, которые решили сделать бизнес на предоставлении услуг пользователям Linux.

source: In 1992, AT&T sued http://www.bsdi.com/[BSDI], the vendor of BSD/386, alleging that the product contained AT&T-copyrighted code. The case was settled out of court in 1994, but the spectre of the litigation continues to haunt people. In March 2000 an article published on the web claimed that the court case had been "recently settled".
pt_br: Em 1992 a AT&T processou a http://www.bsdi.com/[BSDI], que comercializava o BSD/386, alegando que o produto continha código protegido por direitos autorais da AT&T. O caso foi encerrado fora dos tribunais em 1994, mas o fantasma do litígio continua assombrando. Em março de 2000 um artigo publicado na web afirma que o caso foi "recentemente encerrado".
ru: В 1992 году AT&T подала в суд на http://www.bsdi.com/[BSDI], поставщика BSD/386, утверждая, что их продукт содержит код, защищённый авторскими правами AT&T. Дело было урегулировано во внесудебном порядке в 1994 году, но призрак этого судебного разбирательства продолжает преследовать людей. В марте 2000 года в интернете была опубликована статья, в которой утверждалось, что судебное дело было «недавно урегулировано».

source: One detail that the lawsuit did clarify is the naming: in the 1980s, BSD was known as "BSD UNIX(R)". With the elimination of the last vestige of AT&T code from BSD, it also lost the right to the name UNIX(R). Thus you will see references in book titles to "the 4.3BSD UNIX(R) operating system" and "the 4.4BSD operating system".
pt_br: Um detalhe que o processo civil não deixa claro refere-se ao nome: nos anos 80 o BSD era conhecido como "BSD UNIX(R)". Com a eliminação dos últimos vestígios do código da AT&T do BSD, ele também perdeu o direito ao nome UNIX(R). Desta forma você verá referências em livros para o "sistema operacional 4.3BSD UNIX(R)" e o "sistema operacional 4.4BSD".
ru: Один момент, который прояснился в ходе судебного разбирательства, касается названия: в 1980-х годах BSD была известна как «BSD UNIX(R)». Однако после удаления последних следов кода AT&T из BSD система потеряла право на использование названия UNIX(R). Поэтому в названиях книг можно встретить, например, «ОС 4.3BSD UNIX®», но уже «ОС 4.4BSD».

source: Comparing BSD and Linux
pt_br: Comparando BSD e Linux
ru: Сравнение BSD и Linux

source: So what is really the difference between, say, Debian Linux and FreeBSD? For the average user, the difference is surprisingly small: Both are UNIX(R) like operating systems. Both are developed by non-commercial projects (this does not apply to many other Linux distributions, of course). In the following section, we will look at BSD and compare it to Linux. The description applies most closely to FreeBSD, which accounts for an estimated 80% of the BSD installations, but the differences from NetBSD, OpenBSD and DragonFlyBSD are small.
pt_br: Então, qual é realmente a diferença entre, digamos, o Debian Linux e o FreeBSD? Para a maioria dos usuários, a diferença é surpreendentemente pequena: Ambos são sistemas operacionais estilo UNIX(R). Ambos são desenvolvidos por projetos não comerciais (isto não se aplica a diversas outras distribuições Linux, é claro). Nas próximas sessões vamos olhar para o BSD e compará-lo ao Linux. As descrições se aplicam principalmente ao FreeBSD, que representa aproximadamente 80% das instalações de BSD, mas as diferenças do NetBSD, OpenBSD e Dragon FlyBSD são pequenas.
ru: В чём заключается главная разница, к примеру, между Debian Linux и FreeBSD? Для среднего пользователя она на удивление мала: оба продукта представляют собой UNIX(R)-подобные операционные системы. Оба продукта разрабатываются на некоммерческой основе (это не относится к некоторым другим дистрибутивам Linux). В этом разделе мы рассмотрим BSD в сравнении с Linux. Всё сказанное в основном будет касаться FreeBSD, которой принадлежит около 80% всех инсталляций BSD в мире, хотя отличия от NetBSD, OpenBSD и DragonFlyBSD в рамках предмета данной статьи незначительны.

source: Who owns BSD?
pt_br: Quem é o dono do BSD?
ru: Кому принадлежит BSD?

source: No one person or corporation owns BSD. It is created and distributed by a community of highly technical and committed contributors all over the world. Some of the components of BSD are Open Source projects in their own right and managed by different project maintainers.
pt_br: Nenhuma pessoa ou empresa é proprietária do BSD. Ele é criado e distribuído por uma comunidade de colaboradores altamente técnica e comprometida espalhada ao redor do mundo. Alguns dos componentes do BSD são projetos de código aberto com seus próprios licenciamentos e gerenciados por diferentes mantenedores.
ru: Нельзя сказать, что какой-то конкретный человек или корпорация владеет BSD. Разработка и распространение ведутся группой высококвалифицированных и преданных проекту специалистов со всего мира. Некоторые компоненты BSD представляют собой отдельные проекты с открытым кодом со своими законами и коллективами разработчиков.

source: How is BSD developed and updated?
pt_br: Como o BSD é desenvolvido e atualizado?
ru: Как выглядит процесс разработки и обновления BSD?
