Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/structure/_index.po
Languages: pt_br, ru

source: The text for each section of the *Contributors* page contains an "include::" statement. For example, the entry for "Port Manager Alumni" is `include::{include-contrib-portmgralumni}[]`. This pulls in the text for port manager alumni into the rendered output.
ru: Текст каждого раздела страницы *Участники* содержит оператор "include::". Например, запись для "Экс-участники менеджера портов" выглядит как `include::{include-contrib-portmgralumni}[]`. Это подключает текст об экс-участниках менеджера портов в итоговый вывод.

source: To make a change, edit the appropriate include file:
ru: Чтобы внести изменения, отредактируйте соответствующий include-файл:

source: Also, edit the [.filename]#authors.adoc# file: [.filename]#~/doc/shared/authors.adoc# and any related translations.
ru: Также отредактируйте файл [.filename]#authors.adoc#: [.filename]#~/doc/shared/authors.adoc# и все связанные с ним переводы.

source: In general, if a person is being added, there is only one edit necessary, and they can be added to the appropriate include file. If a person is being moved from "current" to "alumni" status, two edits are required - one to remove and one to insert for the appropriate files. The order of entries for all files is found in the table below.
ru: В общем случае, если добавляется новый человек, требуется лишь одно изменение — его можно добавить в соответствующий включаемый файл. Если человек переводится из статуса «текущий» в «бывший», необходимо два изменения: одно для удаления и одно для добавления в соответствующие файлы. Порядок записей для всех файлов указан в таблице ниже.

source: Purpose
ru: Назначение

source: Section Anchor
ru: Якорь раздела

source: File in ~/doc/shared/
ru: Файл в ~/doc/shared/

source: Order Specification
ru: Спецификация порядка

source: *FreeBSD Developers*
ru: *Разработчики FreeBSD*

source: alphabetical order by last name
ru: упорядочено по алфавиту по фамилии

source: *Core Team Alumni*
ru: *Бывшие члены основной команды*

source: rough reverse chronological order
ru: приблизительно в обратном хронологическом порядке

source: *Development Team Alumni*
ru: *Бывшие члены команды разработчиков*

source: *Ports Management Team Alumni*
ru: *Бывшие члены команды управления портами*

source: *Additional FreeBSD Contributors*
ru: *Дополнительные участники проекта FreeBSD*

source: alphabetical order by first name
ru: упорядочено по алфавиту по имени

source: *386BSD Patch Kit Patch Contributors*
ru: *Участники, предоставившие патчи для 386BSD Patch Kit*

source: *Contributors to the central server project*
ru: *Участники проекта центрального сервера*

source: No include file used
ru: Файл include не используется

source: unordered
ru: неупорядоченное

source: *Direct funding*
ru: *Прямое финансирование*

source: *Hardware contributors*
ru: *Участники, предоставившие оборудование*

source: *Special contributors*
ru: *Особые участники*

source: "In Memoriam" Section
ru: Раздел "Памяти"

source: When notifying the BSD community of the death of a community member, the following procedure should be used:
ru: Когда уведомляют сообщество BSD о смерти члена сообщества, следует использовать следующую процедуру:

source: Use the file [.filename]#~/doc/shared/authors.adoc# to look up the person's name and attribute reference, such as `{foobsd}`.
ru: Используйте файл [.filename]#~/doc/shared/authors.adoc# для поиска имени человека и ссылки на атрибут, например `{foobsd}`.

source: If they are a current member of one or more FreeBSD project teams in [.filename]#~/doc/website/content/en/administration.adoc#, remove all instances of their attribute reference. Also, complete the following edits:
ru: Если они являются текущим членом одной или нескольких команд проекта FreeBSD в [.filename]#~/doc/website/content/en/administration.adoc#, удалите все упоминания их атрибута. Также выполните следующие правки:

source: [.filename]#~/doc/shared/contrib-committers.adoc# - Remove the attribute reference.
ru: [.filename]#~/doc/shared/contrib-committers.adoc# - Удалите ссылку на атрибут.

source: [.filename]#~/doc/shared/contrib-corealumni.adoc# - If they are a _current_ member of the core team, create an entry showing start and end dates.
ru: [.filename]#~/doc/shared/contrib-corealumni.adoc# - Если они являются _действующим_ членом основной команды, создайте запись с указанием дат начала и окончания.

source: [.filename]#~/doc/shared/contrib-develalumni.adoc# - Add the attribute reference and dates of activity as a committer.
ru: [.filename]#~/doc/shared/contrib-develalumni.adoc# - Добавьте ссылку на атрибут и даты активности в качестве коммиттера.

source: [.filename]#~/doc/shared/contrib-portmgralumni.adoc# - Add the attribute reference if necessary.
ru: [.filename]#~/doc/shared/contrib-portmgralumni.adoc# - Добавьте ссылку на атрибут при необходимости.

source: [.filename]#~/doc/shared/contrib-additional.adoc# - Remove the entry.
ru: [.filename]#~/doc/shared/contrib-additional.adoc# — Удалите запись.

source: [.filename]#~/doc/shared/contrib-386bsd.adoc# - This is a historical document only. No changes are needed.
ru: [.filename]#~/doc/shared/contrib-386bsd.adoc# - Это исключительно исторический документ. Изменения не требуются.

source: In the [.filename]#~/doc/shared/authors.adoc# file, comment out (using one backslash '\') the email address to avoid creating the email link "mailto:" See the example for `itojun` below:
ru: В файле [.filename]#~/doc/shared/authors.adoc# закомментируйте (используя одну обратную косую черту '\') адрес электронной почты, чтобы избежать создания ссылки "mailto:". См. пример для `itojun` ниже:

source: Since the member is deceased (which should be double checked), add them to the "In Memoriam" file [.filename]#contrib-develinmemoriam.adoc#.
ru: Поскольку участник скончался (что следует перепроверить), добавьте его в файл [.filename]#contrib-develinmemoriam.adoc# "Памяти ушедших".

source: Try to find some factual information about their contributions to FreeBSD over the years and add it with their entry in the file. This may require asking in the development mailing lists, contacting colleagues, contacting the FreeBSD Foundation, or searching through the commit logs.
ru: Постарайтесь найти информацию, подкрепленную фактами, о его вкладе в FreeBSD за прошедшие годы и добавьте её к записи в файле. Для этого может потребоваться запрос в списках рассылки разработчиков, обращение к коллегам, связь с FreeBSD Foundation или поиск в журналах коммитов.

source: To find the date of their first commit, use:
ru: Чтобы узнать дату их первого коммита, используйте:

source: This will print out their commits in reverse order. The date of the first commit will be at the top.
ru: Это выведет их коммиты в обратном порядке. Дата первого коммита будет вверху.

source: Ensure that the format of the dates match other entries:
ru: Убедитесь, что формат дат соответствует другим записям:

source: (year of commit bit start - year of commit bit end; RIP year deceased)
ru: (год начала предоставления права коммита - год окончания предоставления права коммита; RIP год ухода)

source: For example:
ru: Например:

source: Check the ordering of the entries in the file.
ru: Проверьте порядок записей в файле.

source: File in ~/doc/documentation/content/{language}/articles/contributors/
ru: Файл в ~/doc/documentation/content/{язык}/articles/contributors/

source: *Development Team: In Memoriam*
ru: *Команда разработчиков: Памяти ушедших*

source: See the "In Memoriam" file for similar entries.
ru: Смотрите файл "In Memoriam" для похожих записей.

source: Finally, if applicable, move the committer member entry from the "current" section to the "alumni" section of the appropriate link:https://cgit.freebsd.org/src/tree/share/misc[list of contributor mentor / mentee relationships] along with an appropriate date. It is not necessary to change the mentor / mentee relationship.
ru: Наконец, если применимо, переместите запись участника с правами коммиттера из раздела «current» в раздел «alumni» соответствующего link:https://cgit.freebsd.org/src/tree/share/misc[списка отношений наставник / подопечный] с указанием соответствующей даты. Изменять отношения наставник / подопечный не требуется.

source: This image doesn't need an introduction ;)
pt_br: Esta imagem não precisa de introdução ;)
