Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/structure/_index.po
Languages: pt_br, ru

source: Documentation Directory Structure explanation used in the FreeBSD Documentation Project
pt_br: Explicação da Estrutura de Diretórios usada no Projeto de Documentação do FreeBSD
ru: Структура каталогов документации, используемая в проекте документации FreeBSD

source: Chapter 4. Documentation Directory Structure
pt_br: Capítulo 4. Estrutura de Diretórios da Documentação
ru: Глава 4. Структура каталогов документации

source: Documentation Directory Structure
pt_br: Estrutura de Diretórios da Documentação
ru: Структура каталогов документации

source: Files and directories in the *doc/* tree follow a structure meant to:
pt_br: Arquivos e diretórios no repositório *doc/* seguem uma estrutura destinada a:
ru: Файлы и каталоги в дереве *doc/* следуют структуре, преследующей цели:

source: Make it easy to automate converting the document to other formats.
pt_br: Facilitar a conversão do documento para outros formatos.
ru: Сделать удобным автоматическое преобразование документа в другие форматы.

source: Promote consistency between the different documentation organizations, to make it easier to switch between working on different documents.
pt_br: Promover a consistência entre as diferentes organizações de documentação, e assim facilitar a alternância entre diferentes documentos.
ru: Способствовать согласованности между различными организациями, занимающимися документацией, чтобы упростить переход между работой над разными документами.

source: Make it easy to decide where in the tree new documentation should be placed.
pt_br: Facilitar a decisão de onde a nova documentação deve ser colocada.
ru: Сделать удобным выбор места в дереве для размещения новой документации.

source: In addition, the documentation tree must accommodate documents in many different languages. It is important that the documentation tree structure does not enforce any particular defaults or cultural preferences.
pt_br: Além disso, o repositório de documentação deve acomodar documentos em vários idiomas e codificações diferentes. É importante que a estrutura do repositório de documentação não imponha quaisquer padrões particulares ou preferências culturais.
ru: В дополнение, дерево документации должно поддерживать документы на многих разных языках. Важно, чтобы структура дерева документации не навязывала каких-либо конкретных настроек по умолчанию или культурных предпочтений.

source: The Top Level, doc/
pt_br: O Nível Superior, doc/
ru: Верхний уровень, doc/

source: There are three sections under *doc/*, documentation and website share the same structure.
pt_br: Existem dois tipos de diretório em *doc/*, documentation e website, ambos compartilham a mesma estrutura.
ru: В разделе *doc/* есть три подраздела, документация и веб-сайт имеют одинаковую структуру.

source: Directory
pt_br: Diretório
ru: Каталог

source: Usage
pt_br: Uso
ru: Использование

source: Contains all the articles and books in AsciiDoc format. Contains subdirectories to further categorize the information by languages.
pt_br: Contém todos os artigos e livros em formato AsciiDoc. Contém subdiretórios para categorizar ainda mais as informações por idiomas.
ru: Содержит все статьи и книги в формате AsciiDoc. Содержит подкаталоги для дальнейшей категоризации информации по языкам.

source: Contains a set of tools used to translate the documentation and the website using link:https://weblate.org/en/[Weblate]. The Weblate instance can be found link:https://translate-dev.freebsd.org[here].
pt_br: Contém um conjunto de ferramentas usadas para traduzir a documentação e o site usando link:https://weblate.org/en/[Weblate]. A instância do Weblate pode ser acessada link:https://translate-dev.freebsd.org[aqui].
ru: Содержит набор инструментов для перевода документации и веб-сайта с использованием link:https://weblate.org/en/[Weblate]. Экземпляр Weblate доступен link:https://translate-dev.freebsd.org[здесь].

source: Contains files that are not specific to the various translations of the documentation. Contains subdirectories to further categorize the information by languages and three files to store the authors, releases and mirrors information. This directory is shared between `documentation` and the `website`.
pt_br: Contém arquivos que não são específicos para as várias traduções da documentação. Contém subdiretórios para categorizar ainda mais as informações por idiomas e três arquivos para armazenar as informações dos autores, lançamentos e espelhos. Este diretório é compartilhado entre `documentation` e o `website`.
ru: Содержит файлы, не относящиеся к различным переводам документации. Включает подкаталоги для дальнейшей категоризации информации по языкам, а также три файла для хранения данных об авторах, выпусках и зеркалах. Этот каталог является общим для `documentation` и `website`.

source: Contains the link:https://www.FreeBSD.org[FreeBSD website] in AsciiDoc format. Contains subdirectories to further categorize the information by languages.
pt_br: Contém o link:https://www.FreeBSD.org[site do FreeBSD] no formato AsciiDoc Contém subdiretórios para categorizar ainda mais as informações por idiomas.
ru: Содержит ссылку link:https://www.FreeBSD.org[FreeBSD website] в формате AsciiDoc. Содержит подкаталоги для дальнейшей категоризации информации по языкам.

source: The Directories
pt_br: Os Diretórios
ru: Каталоги

source: These directories contain the documentation and the website. The documentation is organized into subdirectories below this level, following the link:https://gohugo.io/getting-started/directory-structure/[Hugo directory structure].
pt_br: Esses diretórios contêm a documentação e o website. A documentação está organizada em subdiretórios abaixo deste nível, seguindo o link:https://gohugo.io/getting-started/directory-structure/[estrutura de diretórios Hugo].
ru: Эти каталоги содержат документацию и веб-сайт. Документация организована в подкаталоги ниже этого уровня, следуя структуре каталогов link:https://gohugo.io/getting-started/directory-structure/[Hugo].

source: Contain templates to create new articles, books and webpages. For more information take a look link:https://gohugo.io/content-management/archetypes/[here].
pt_br: Contém templates para criar novos artigos, livros e páginas web. Para mais informações, veja link:https://gohugo.io/content-management/archetypes/[aqui].
ru: Содержит шаблоны для создания новых статей, книг и веб-страниц. Дополнительную информацию смотрите link:https://gohugo.io/content-management/archetypes/[здесь].

source: Contain the Hugo configuration files. One main file and one file per language. For more information take a look link:https://gohugo.io/getting-started/configuration/[here].
pt_br: Contém os arquivos de configuração do Hugo. Um arquivo principal e um arquivo por idioma. Para mais informações, veja link:https://gohugo.io/getting-started/configuration[aqui].
ru: Содержат файлы конфигурации Hugo. Один основной файл и по одному файлу для каждого языка. Для получения дополнительной информации смотрите link:https://gohugo.io/getting-started/configuration/[здесь].

source: Contain the books, articles and webpages. One directory exists for each available translation of the documentation, for example `en` and `zh-tw`.
pt_br: Contém os livros, artigos e páginas web. Existe um diretório para cada tradução disponível da documentação, por exemplo `en` e `zh-tw`.
ru: Содержат книги, статьи и веб-страницы. Для каждого доступного перевода документации существует отдельный каталог, например `en` и `zh-tw`.

source: Contain custom data for build the website in link:https://en.wikipedia.org/wiki/TOML[TOML] format. This directory is used to store the events, news, press, etc. For more information take a look link:https://gohugo.io/templates/data-templates/[here].
pt_br: Contem dados personalizados para compilar o site no formato link:https://en.wikipedia.org/wiki/TOML[TOML]. Este diretório é usado para armazenar os eventos, notícias, imprensa, etc. Para mais informações, veja link:https://gohugo.io/templates/data-templates/[aqui].
ru: Содержит пользовательские данные для сборки веб-сайта в формате link:https://en.wikipedia.org/wiki/TOML[TOML]. Этот каталог используется для хранения событий, новостей, пресс-релизов и т.д. Для получения дополнительной информации ознакомьтесь link:https://gohugo.io/templates/data-templates/[здесь].

source: Contain static assets. Images, security advisories, the pgpkeys, etc. For more information take a look link:https://gohugo.io/content-management/static-files/[here].
pt_br: Contem ativos estáticos. Imagens, avisos de segurança, pgpkeys, etc. Para mais informações, veja link:https://gohugo.io/content-management/static-files/[aqui].
ru: Содержат статические ресурсы. Изображения, бюллетени безопасности, pgpkeys и т.д. Подробнее смотрите link:https://gohugo.io/content-management/static-files/[здесь].

source: Contain the templates in the form of `.html` files that specify how the website looks. For more information take a look link:https://gohugo.io/templates/[here].
pt_br: Contém os modelos na forma de arquivos `.html` que especificam a aparência do site. Para mais informações, veja link:https://gohugo.io/templates/[aqui].
ru: Содержите шаблоны в виде файлов `.html`, которые определяют внешний вид веб-сайта. Для получения дополнительной информации посмотрите link:https://gohugo.io/templates/[здесь].

source: Contain tools used to enhance the documentation build. For example to generate the Table of Contents of the books, etc.
pt_br: Contém ferramentas usadas para aprimorar a construção da documentação. Por exemplo, para gerar o índice dos livros, etc.
ru: Содержит инструменты, используемые для улучшения сборки документации. Например, для генерации оглавления книг и т.д.

source: This image does not need an introduction ;)
ru: Это изображение не нуждается в представлении ;)

source: License of the documentation, shared and website. BSD 2-Clause License.
pt_br: Licença da documentação e site. Licença BSD de 2 cláusulas.
ru: Лицензия документации, общих материалов и веб-сайта. Лицензия BSD с 2 пунктами.

source: The *Makefile* defines the build process of the documentation and the website.
pt_br: O *Makefile* que executa o processo de compilação da documentação e do website.
ru: Файл *Makefile* определяет процесс сборки документации и веб-сайта.

source: Document-Specific Information
pt_br: Informação Específica de Documentação
ru: Информация, относящаяся к документу

source: This section contains specific notes about particular documents managed by the FDP.
pt_br: Esta seção contém informações específicas sobre documentos gerenciados pelo FDP.
ru: Этот раздел содержит особые примечания о конкретных документах, которыми управляет FDP.

source: The Books: books/
pt_br: Os Livros: books/
ru: Книги: books/

source: The books are written in AsciiDoc.
pt_br: Os livros são escritos em AsciiDoc.
ru: Книги написаны в AsciiDoc.

source: For each FreeBSD book, the AsciiDoc document type (aka doctype) is `book`. Books have ``part``s, each of which contains several ``chapter``s.
pt_br: Para cada livro do FreeBSD, o tipo de documento AsciiDoc (também conhecido como doctype) é `book`. Os livros possuem ``part``es, cada uma contendo vários ``capítulos`` (chapter).
ru: Для каждой книги FreeBSD тип документа AsciiDoc (также известный как doctype) — это `book` (книга). Книги содержат ``part`` (части), каждая из которых включает несколько ``chapter`` (глав).

source: When the document is converted to HTML 5 (using the built-in `html5` backend):
pt_br: Quando o documento é convertido para HTML 5 (usando o backend `html5` embutido):
ru: Когда документ преобразуется в HTML 5 (с использованием встроенного бэкенда `html5`):

source: AsciiDoc section level 0 (`=`) at the beginning of a ``chapter`` of a `book` will be `<h1>`
pt_br: A seção AsciiDoc nível 0 (`=`) no início de um ``capítulo `` de um `livro` será `<h1>`
ru: Уровень раздела AsciiDoc 0 (`=`) в начале `главы` `книги` будет `<h1>`

source: AsciiDoc section level 1 (`==`) must be used for the first logical section of a chapter, and will be `<h2>`
pt_br: A seção AsciiDoc nível 1 (`==`) deve ser usada para a primeira seção lógica de um capítulo e será `<h2>`
ru: Уровень секции AsciiDoc 1 (`==`) должен использоваться для первого логического раздела главы и будет преобразован в `<h2>`

source: AsciiDoc section level 2 (`===`) must be used for the first logical subsection, and will be `<h3>`
pt_br: A seção AsciiDoc nível 2 (`===`) deve ser usada para a primeira subseção lógica e será `<h3>`
ru: Уровень раздела AsciiDoc 2 (`===`) должен использоваться для первого логического подраздела и будет преобразован в `<h3>`

source: – and so on. Reference: link:https://docs.asciidoctor.org/asciidoc/latest/sections/titles-and-levels/[Section Titles and Levels | Asciidoctor Docs].
pt_br: – e assim por diante. Referência: link:https://docs.asciidoctor.org/asciidoc/latest/sections/titles-and-levels/[Títulos e Níveis de Seção | Asciidoctor Docs].
ru: – и так далее. Ссылка: link:https://docs.asciidoctor.org/asciidoc/latest/sections/titles-and-levels/[Заголовки и уровни разделов | Документация Asciidoctor].

source: Physical Organization
pt_br: Organização Física
ru: Физическая организация

source: There are a number of files and directories within the books directory, all with the same structure.
pt_br: Existem vários arquivos e diretórios no diretório books, todos com a mesma estrutura.
ru: В каталоге books находится множество файлов и директорий, все с одинаковой структурой.

source: The *_index.adoc* file defines some AsciiDoc variables that affect how the AsciiDoc source is converted to other formats and list the Table of Contents, Table of Examples, Table of Figures, Table of Tables and the abstract section.
pt_br: O arquivo *_index.adoc* define algumas variáveis AsciiDoc que afetam como o código AsciiDoc é convertido para outros formatos e lista o Índice, a Tabela de Exemplos, a Tabela de Figuras, a Tabela de Tabelas e a seção de resumo.
ru: Файл *_index.adoc* определяет некоторые переменные AsciiDoc, которые влияют на преобразование исходного кода AsciiDoc в другие форматы, а также содержит оглавление, список примеров, список рисунков, список таблиц и раздел с аннотацией.

source: The *book.adoc* file defines some AsciiDoc variables that affect how the AsciiDoc source is converted to other formats and list the Table of Contents, Table of Examples, Table of Figures, Table of Tables, the abstract section and all the chapters. This file is used to generate the PDF with `asciidoctor-pdf` and to generate the book in one `html` page.
pt_br: O arquivo *book.adoc* define algumas variáveis AsciiDoc que afetam como o código AsciiDoc é convertido para outros formatos e lista o Índice, a Tabela de Exemplos, a Tabela de Figuras, a Tabela de Tabelas, a seção de resumo e todos os capítulos. Este arquivo é usado para gerar o PDF com `asciidoctor-pdf` e para gerar o livro em uma página `html`.
ru: Файл *book.adoc* определяет некоторые переменные AsciiDoc, которые влияют на преобразование исходного кода AsciiDoc в другие форматы, а также включает оглавление, список примеров, список рисунков, список таблиц, раздел с аннотацией и все главы. Этот файл используется для генерации PDF с помощью `asciidoctor-pdf` и для создания книги в виде одной страницы `html`.

source: The **part*.adoc** files store a brief introduction of one part of the book.
pt_br: Os arquivos **part*.adoc** armazenam uma breve introdução de uma parte do livro.
ru: Файлы **part*.adoc** содержат краткое введение к одной части книги.

source: Each chapter in the Handbook is stored in a file called *_index.adoc* in a separate directory from the other chapters.
pt_br: Cada capítulo do Handbook é armazenado em um arquivo chamado *_index.adoc* em um diretório separado dos outros capítulos.
ru: Каждая глава Руководства хранится в файле с именем *_index.adoc* в отдельном каталоге от других глав.

source: For example, this is an example of the header of one chapter:
pt_br: Por exemplo, este é um exemplo do cabeçalho de um capítulo:
ru: Например, вот пример заголовка одной главы:

source: Configuring the FreeBSD Kernel
pt_br: Configurando o kernel do FreeBSD
ru: Настройка ядра FreeBSD

source: When the HTML5 version of the Handbook is produced, this will yield *kernelconfig/index.html*.
pt_br: Quando a versão HTML5 do Handbook é produzida, será gerado o *kernelconfig/index.html*.
ru: При создании HTML5-версии Handbook это приведёт к формированию файла *kernelconfig/index.html*.

source: A brief look will show that there are many directories with individual *_index.adoc* files, including *basics/_index.adoc*, *introduction/_index.adoc*, and *printing/_index.adoc*.
pt_br: Uma breve olhada mostrará que existem muitos diretórios com arquivos *_index.adoc* individuais, incluindo *basics/_index.adoc*, *introduction/_index.adoc*, e *printing/_index.xml*.
ru: Быстрый взгляд покажет, что существует множество каталогов с отдельными файлами *_index.adoc*, включая *basics/_index.adoc*, *introduction/_index.adoc* и *printing/_index.adoc*.

source: Do not name chapters or directories after their ordering within the Handbook. This ordering can change as the content within the Handbook is reorganized. Reorganization should be possible without renaming files, unless entire chapters are being promoted or demoted within the hierarchy.
pt_br: Não nomeie capítulos ou diretórios com a ordenação do Handbook. Essa ordenação pode mudar conforme o conteúdo do Handbook é reorganizado. A reorganização deve ser realizada sem renomear arquivos, a menos que capítulos inteiros sejam promovidos ou rebaixados dentro da hierarquia.
ru: Не называйте главы или каталоги в соответствии с их порядком в Руководстве. Этот порядок может измениться при реорганизации содержания Руководства. Реорганизация должна быть возможной без переименования файлов, за исключением случаев, когда целые главы перемещаются вверх или вниз по иерархии.

source: The Articles: articles/
pt_br: Os Artigos: articles/
ru: Статьи: articles/

source: The articles are written in AsciiDoc.
pt_br: Os artigos são escritos em AsciiDoc.
ru: Статьи написаны в AsciiDoc.

source: The articles are organized as an AsciiDoc `article`. The articles are divided into sections (`=`) and subsections (`==`, `===`) and so on.
pt_br: Os artigos são organizados como um `artigo` do AsciiDoc. Os artigos são divididos em seções (`=`) e subseções (`==`, `===`) e assim por diante.
ru: Статьи организованы как документ AsciiDoc `article`. Статьи разделены на разделы (`=`), подразделы (`==`, `===`) и так далее.

source: There is one *_index.adoc* file per article.
pt_br: Existe um arquivo *_index.adoc* por artigo.
ru: На каждый статью приходится один файл *_index.adoc*.

source: The *_index.adoc* file contains all the AsciiDoc variables and the content.
pt_br: O arquivo *_index.adoc* contém todas as variáveis AsciiDoc e o conteúdo.
ru: Файл *_index.adoc* содержит все переменные AsciiDoc и контент.

source: For example, this is an example of one article, the structure is pretty similar to one book chapter:
pt_br: Por exemplo, este é um exemplo de um artigo, a estrutura é muito semelhante a um capítulo de livro:
ru: Например, это образец одной статьи, структура довольно похожа на главу книги:

source: Why you should use a BSD style license for your Open Source Project
pt_br: Por que você deve usar uma licença de estilo BSD em seu Projeto Open Source
ru: Почему вы должны использовать лицензию в стиле BSD для вашего Open Source проекта

source: Introduction
pt_br: Introdução
ru: Введение

source: Managing Contributor Lists
ru: Управление списками участников

source: The FreeBSD project recognizes contributors in several different lists in the documentation and in printed materials. This section describes how the documentation team manages changes to these lists.
ru: Проект FreeBSD отмечает вклад участников в нескольких различных списках в документации и печатных материалах. В этом разделе описано, как команда документации управляет изменениями в этих списках.

source: Mentor and New Committer Relationship Lists
ru: Списки отношений наставника и нового коммиттера

source: Since FreeBSD 7.0, FreeBSD has maintained link:https://cgit.freebsd.org/src/tree/share/misc[three lists of contributor mentor / mentee relationships] - one for source code, one for ports and one for documentation. These files are in *".dot"* format, intended for use with the popular graphing toolkit package:graphics/graphviz[] available as a FreeBSD package or port.
ru: Начиная с FreeBSD 7.0, FreeBSD поддерживает link:https://cgit.freebsd.org/src/tree/share/misc[три списка отношений наставник/подопечный] — один для исходного кода, один для портов и один для документации. Эти файлы имеют формат *«.dot»* и предназначены для использования с популярным пакетом для построения графиков graphics/graphviz[], доступным как пакет или порт FreeBSD.

source: man:dot[1] is installed as part of the package:graphics/graphviz[] package or port. The [.filename]#dot# program reads files in *".dot"* format and creates a graphical image of the directed graph.
ru: man:dot[1] устанавливается как часть пакета или порта: graphics/graphviz[]. Программа [.filename]#dot# читает файлы в формате *".dot"* и создает графическое изображение направленного графа.

source: The three files often serve as a learning experience for new committers of all three teams who are instructed to add themselves, and their mentor, to the appropriate file as their first commit. Each file has a "current" section for new committers, an "alumni" section for when the commit bit is returned, and a "mentor / mentee" section showing the relationships. The format for each type of entry is explained at the top of the file.
ru: Три файла часто служат учебным опытом для новых коммиттеров всех трёх команд, которым поручается добавить себя и своего наставника в соответствующий файл в качестве их первого коммита. Каждый файл содержит раздел «current» для новых коммиттеров, раздел «alumni» для случаев возврата прав на коммит и раздел «mentor / mentee», отображающий взаимоотношения. Формат каждой записи поясняется в начале файла.

source: General Contributor Lists
ru: Общий список участников

source: extref:{contributors}[Contributors] to FreeBSD are maintained in article format. The source file for managing the *Contributors* article file is located at:
ru: extref:{contributors}[Участники] проекта FreeBSD поддерживаются в формате статьи. Исходный файл для управления статьёй *Участники* находится по адресу:

source: Copies of this contributors directory may exist in other content language directories.
ru: Копии этого каталога contributors могут существовать в других каталогах с контентом на различных языках.

source: Note that the file [.filename]#contrib-develinmemoriam.adoc# is also found in this directory. See below for additional information.
ru: Обратите внимание, что файл [.filename]#contrib-develinmemoriam.adoc# также находится в этом каталоге. Дополнительную информацию смотрите ниже.

source: The [.filename]#contributors/_index.adoc# file is designed as a collection of include files. The include files are listed in the Hugo specific section of the source file. The section is divided into several parts with "ifdef::" statements. There is a sub-section for website output and one for non-website (including PDF) output.
ru: Файл [.filename]#contributors/_index.adoc# представляет собой набор включаемых файлов. Включаемые файлы перечислены в разделе, специфичном для Hugo, в исходном файле. Раздел разделён на несколько частей с помощью операторов "ifdef::". Существует подраздел для вывода на веб-сайт и подраздел для вывода вне веб-сайта (включая PDF).
