Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/developers-handbook/introduction/_index.po
Languages: ru

source: Introduction to the FreeBSD Developers Handbook
ru: Введение в Руководство разработчика FreeBSD

source: Chapter 1. Introduction
ru: Глава 1. Введение

source: Introduction
ru: Введение

source: Developing on FreeBSD
ru: Разработка на FreeBSD

source: So here we are. System all installed and you are ready to start programming. But where to start? What does FreeBSD provide? What can it do for me, as a programmer?
ru: Вот мы и здесь. Система установлена, и вы готовы начать программировать. Но с чего начать? Что предоставляет FreeBSD? Что она может сделать для меня как для программиста?

source: These are some questions which this chapter tries to answer. Of course, programming has different levels of proficiency like any other trade. For some it is a hobby, for others it is their profession. The information in this chapter might be aimed toward the beginning programmer; indeed, it could serve useful for the programmer unfamiliar with the FreeBSD platform.
ru: Вот некоторые вопросы, на которые эта глава пытается ответить. Конечно, программирование, как и любое другое ремесло, имеет разные уровни мастерства. Для кого-то это хобби, для других — профессия. Информация в этой главе может быть ориентирована на начинающего программиста; действительно, она может быть полезна программисту, не знакомому с платформой FreeBSD.

source: The BSD Vision
ru: Видение BSD

source: To produce the best UNIX(R) like operating system package possible, with due respect to the original software tools ideology as well as usability, performance and stability.
ru: Создать наилучший пакет операционной системы, подобной UNIX(R), с должным уважением к оригинальной идеологии программных инструментов, а также к удобству использования, производительности и стабильности.

source: Architectural Guidelines
ru: Архитектурные рекомендации

source: Our ideology can be described by the following guidelines
ru: Наша идеология может быть описана следующими принципами

source: Do not add new functionality unless an implementor cannot complete a real application without it.
ru: Не добавляйте новую функциональность, если разработчик не может завершить реальное приложение без неё.

source: It is as important to decide what a system is not as to decide what it is. Do not serve all the world's needs; rather, make the system extensible so that additional needs can be met in an upwardly compatible fashion.
ru: Важно не только определить, чем является система, но и чем она не является. Не стоит пытаться удовлетворить все возможные потребности; вместо этого сделайте систему расширяемой, чтобы дополнительные требования могли быть реализованы с сохранением совместимости.

source: The only thing worse than generalizing from one example is generalizing from no examples at all.
ru: Худшее, чем обобщение на основе одного примера — это обобщение без примеров вообще.

source: If a problem is not completely understood, it is probably best to provide no solution at all.
ru: Если проблема не до конца понятна, вероятно, лучше вообще не предоставлять решения.

source: If you can get 90 percent of the desired effect for 10 percent of the work, use the simpler solution.
ru: Если вы можете получить 90% желаемого эффекта за 10% работы, используйте более простое решение.

source: Isolate complexity as much as possible.
ru: Изолируйте сложность настолько, насколько это возможно.

source: Provide mechanism, rather than policy. In particular, place user interface policy in the client's hands.
ru: Предоставлять механизмы, а не политики. В частности, передайте политику пользовательского интерфейса в руки клиента.

source: From Scheifler & Gettys: "X Window System"
ru: Из Шейфлера и Геттиса: «X Window System»

source: The Layout of /usr/src
ru: Структура каталога /usr/src

source: The complete source code for FreeBSD is available from our link:https://cgit.freebsd.org/src/[public Git repository]. The source code is normally installed in [.filename]#/usr/src#. The layout of the source tree is described by the top-level link:https://cgit.freebsd.org/src/tree/README.md[README.md] file.
ru: Полный исходный код FreeBSD доступен в нашем link:https://cgit.freebsd.org/src/[публичном Git-репозитории]. Исходный код обычно устанавливается в [.filename]#/usr/src#. Структура дерева каталогов исходного кода описана в файле link:https://cgit.freebsd.org/src/tree/README.md[README.md] на верхнем уровне дерева.
