freebsd/freebsd-doc/documentation/manual-pages/ja/man2/kldload.2
.\"
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libc/sys/kldload.2,v 1.18 2003/06/03 12:29:34 hmp Exp %
.\"
.\" $FreeBSD$
.Dd March 3, 1999
.Dt KLDLOAD 2
.Os
.Sh 名称
.Nm kldload
.Nd KLD ファイルをカーネルにロードする
.Sh ライブラリ
.Lb libc
.Sh 書式
.In sys/param.h
.In sys/linker.h
.Ft int
.Fn kldload "const char *file"
.Sh 解説
.Fn kldload
システムコールは、カーネルリンカを使用してカーネル内に kld ファイルを
ロードします。
.Sh 戻り値
.Fn kldload
システムコールは、カーネル内にロードされた kld ファイルのファイル ID を
返します。
エラーが発生すると
.Fn kldload
は -1 を返し、エラーを示すために
.Va errno
が設定されます。
.Sh エラー
指定されたファイルは次の場合を除いてロードされます:
.Bl -tag -width Er
.It Bq Er EPERM
ファイルを読み取ることができません。
あるいはファイルをカーネルとリンクすることができません。
.Nm kld
システムコールを使用するためには root ユーザである必要があります。
.It Bq Er EFAULT
kld 情報をカーネル空間に追加するときに無効アドレスが検出されました。
.It Bq Er ENOMEM
ファイルをカーネル内にロードするためのメモリがありません。
.It Bq Er ENOENT
ファイルが見つかりませんでした。
.It Bq Er ENOEXEC
.Fa file
のファイル形式が認識されませんでした。
.It Bq Er EEXIST
与えられた
.Fa file
は既にロードされています。
.El
.Sh 関連項目
.Xr kldfind 2 ,
.Xr kldfirstmod 2 ,
.Xr kldnext 2 ,
.Xr kldstat 2 ,
.Xr kldsym 2 ,
.Xr kldunload 2 ,
.Xr modfind 2 ,
.Xr modfnext 2 ,
.Xr modnext 2 ,
.Xr modstat 2 ,
.Xr kld 4 ,
.Xr kldload 8
.Sh 歴史
.Nm kld
インタフェースは
.Fx 3.0
ではじめて登場しました。
