<!--
  The FreeBSD Documentation Project
  The FreeBSD Brazilian Portuguese Documentation Project

  Original revision: r38826

  $FreeBSD$

-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based
Extension//EN" [
<!ENTITY % articles.ent PUBLIC "-//FreeBSD//ENTITIES DocBook
FreeBSD Articles Entity Set//PTBR">
%articles.ent;
]>

<article>
  <articleinfo>
    <title>Explicando o BSD</title>

    <author>
      <firstname>Greg</firstname>

      <surname>Lehey</surname>

      <affiliation>
	<address><email>grog@FreeBSD.org</email></address>
      </affiliation>
    </author>

    <abstract>
      <para>No mundo do open source, a palavra <quote>Linux</quote>
	&eacute; quase um sin&ocirc;nimo de <quote>Sistema
	  Operacional</quote>, mas esse n&atilde;o &eacute; o
	&uacute;nico sistema operacional &unix;
	de c&oacute;digo aberto.  De acordo com o <ulink
	  url="http://www.leb.net/hzo/ioscount/data/r.9904.txt">
	  Contador de Sistemas Operacionais da Internet</ulink>, em
	Abril de 1999 31.3% das m&aacute;quinas conectadas na rede
	rodam Linux.  14.6% rodam BSD &unix;.  Alguns dos
	respons&aacute;veis pelas maiores opera&ccedil;&otilde;es da
	rede no mundo, como o <ulink
	  url="http://www.yahoo.com">Yahoo!</ulink>, rodam BSD.  O
	servidor FTP mais requisitado do mundo em 1999 (atualmente
	extinto), <ulink
	  url="ftp://ftp.cdrom.com/">ftp.cdrom.com</ulink>, usava BSD
	para transferir 1.4 TB de dados por dia.  &Eacute; claro, que
	n&atilde;o se trata de um nicho de mercado:  O BSD &eacute; um
	segredo muito bem guardado.</para>

      <para>Ent&atilde;o, qual &eacute; o segredo?  Por que o BSD
	n&atilde;o &eacute; melhor difundido, mais conhecido?  Esse
	documento abordar&aacute; essas e outras
	quest&otilde;es.</para>

      <para>Ao longo desse documento, as diferen&ccedil;as entre o BSD
	e o Linux ser&atilde;o denotadas <emphasis>dessa
	  forma</emphasis>.</para>
    </abstract>
  </articleinfo>

  <sect1 id="what-is-bsd">
    <title>O que &eacute; BSD?</title>

    <para>BSD significa <quote>Distribui&ccedil;&atilde;o do Sistema
	de Berkeley</quote>.  &Eacute; o nome da
      distribui&ccedil;&atilde;o de c&oacute;digos fonte proveniente
      da Universidade da Calif&oacute;rnia, Berkeley, as quais foram
      originalmente extens&otilde;es para o sistema operacional &unix; 
      do departamento de Pesquisas da AT&amp;T.  V&aacute;rios
      projetos de sistemas operacionais de c&oacute;digo aberto
      s&atilde;o baseados em uma distribui&ccedil;&atilde;o desse
      c&oacute;digo fonte, conhecido como 4.4BSD-Lite.  Em
      adi&ccedil;&atilde;o, tais sistemas constituem-se de
      v&aacute;rias por&ccedil;&otilde;es de outros projetos de
      C&oacute;digo Aberto, incluindo o not&aacute;vel projeto GNU.  A
      constitui&ccedil;&atilde;o total do sistema operacional
      inclui:</para>

    <itemizedlist>
      <listitem>
	<para>O kernel BSD, que cuida do agendamento de processos,
	  gerenciamento de mem&oacute;ria, multi-processamento
	  sim&eacute;trico (SMP), dispositivos de controle,
	  etc.</para>

	<para><emphasis>Ao contr&aacute;rio do kernel do Linux,
	    existem v&aacute;rios kernels distintos de sistemas BSD
	    com diferentes caracter&iacute;sticas e
	    recursos.</emphasis></para>
      </listitem>

      <listitem>
	<para>A biblioteca C, a API base do sistema.</para>

	<para><emphasis>A biblioteca C do BSD &eacute; baseada em
	    c&oacute;digo proveniente de Berkeley, e n&atilde;o do
	    projeto GNU.</emphasis></para>
      </listitem>

      <listitem>
	<para>Programas utilit&aacute;rios como shells,
	  utilit&aacute;rios de manuseio de arquivos, compiladores,
	  linkadores.</para>

	<para><emphasis>Alguns desses programas s&atilde;o derivados
	    do projeto GNU, outros n&atilde;o.</emphasis></para>
      </listitem>

      <listitem>
	<para>O sistema X Window, que prov&ecirc; uma interface
	  gr&aacute;fica.</para>

	<para>O sistema X Window usado na maioria das vers&otilde;es
	  do BSD &eacute; mantido pelo <ulink url="http://www.X.org/">
	  projeto X.Org</ulink>.  O &os; permite ao usu&aacute;rio
	  escolher entre uma variedade de ambientes de desktop, tais
	  como <application>Gnome</application>,
	  <application>KDE</application>, ou
	  <application>Xfce</application>; e gerenciadores de janela
	  leves como o <application>Openbox</application>,
	  <application>Fluxbox</application>, ou
	  <application>Awesome</application>.</para>
      </listitem>

      <listitem>
	<para>Muitos outros programas e utilit&aacute;rios.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="what-a-real-unix">
    <title>O que &eacute; um UNIX de verdade?</title>

    <para>Os sistemas operacionais BSD n&atilde;o s&atilde;o clones,
      mas sim, c&oacute;digo livre derivado diretamente do sistema
      operacional &unix; da AT&amp;T, que tamb&eacute;m &eacute; o
      ancestral dos modernos &unix; System V.  Talvez isso lhe
      surpreenda.  Como pode ser isso, se a AT&amp;T nunca
      disponibilizou seus fontes como c&oacute;digo aberto?</para>

    <para>&Eacute; verdade que o &unix; da AT&amp;T n&atilde;o &eacute;
      Open Source, e do ponto de vista da licen&ccedil;a de direitos
      legais, o BSD definitivamente <emphasis>n&atilde;o 
      &eacute;</emphasis> &unix;, mas por outro lado, a AT&amp;T
      importou muito c&oacute;digo de outros projetos, especialmente
      do Grupo de Pesquisas de Ci&ecirc;ncias Computacionais (CSRG) da
      Universidade da Calif&oacute;rnia, em Berkeley, CA.  Desde 1976
      o CSRG lan&ccedil;ava fitas magn&eacute;ticas com c&oacute;pias
      de seu software, o qual era chamado de
      <emphasis>Distribui&ccedil;&atilde;o do Software de
	Berkeley</emphasis> ou <emphasis>BSD</emphasis>.</para>

    <para>As vers&otilde;es iniciais do BSD consistiam-se
      fundamentalmente de programas &agrave; n&iacute;vel de
      usu&aacute;rio, mas essa realidade mudou dramaticamente assim
      que o CSRG fechou um contrato com a Ag&ecirc;ncia de Pesquisas e
      Projetos de Avan&ccedil;ados de Defesa (a DARPA) para atualizar
      os protocolos de comunica&ccedil;&atilde;o que eram usados em
      sua rede, a ARPANET.  Os novos protocolos passaram a ser
      conhecidos como <emphasis>Protocolos de Internet</emphasis>, e
      mais tarde como <emphasis>TCP/IP</emphasis> se tornando os mais
      importantes protocolos de todos os tempos.  A primeira
      implementa&ccedil;&atilde;o amplamente distribu&iacute;da desses
      protocolos eram parte do 4.2BSD, em 1982.</para>

    <para>Ao longo da d&eacute;cada de 80, v&aacute;rias empresas que
      produziam esta&ccedil;&otilde;es de trabalho come&ccedil;aram a
      se espalhar.  Muitas delas preferiam licenciar o &unix; ao
      inv&eacute;s de desenvolverem sistemas operacionais por si
      mesmas.  A Sun Microsystems em particular, licenciou o &unix; e
      implementou uma vers&atilde;o do 4.2BSD, a qual eles chamaram de
      &sunos;.  Quando a AT&amp;T se deu permiss&atilde;o para vender
      o &unix; comercialmente, come&ccedil;aram a desenvolver uma
      implementa&ccedil;&atilde;o &ldquo;na unha&rdquo; chamada de
      System III, que seria rapidamente sucedida pelo System V.  A
      base do c&oacute;digo do System V n&atilde;o inclu&iacute;a o suporte a
      networking, ent&atilde;o todas as implementa&ccedil;&otilde;es
      passaram a incluir software adicional do BSD, incluindo o
      TCP/IP, e tamb&eacute;m programas utilit&aacute;rios como o
      interpretador de linha de comandos <emphasis>csh</emphasis> e o
      editor <emphasis>vi</emphasis>.  Em sua coletividade, estes
      aprimoramentos foram conhecidos como
      <emphasis>Extens&otilde;es de Berkeley</emphasis>.</para>

    <para>As fitas magn&eacute;ticas do BSD continham c&oacute;digo
      fonte da AT&amp;T e por isso precisavam de uma licen&ccedil;a de
      fontes do &unix;.  Por volta de 1990, os fundos do CSRG estavam
      acabando.  Alguns membros do grupo decidiram lan&ccedil;ar o
      c&oacute;digo BSD, que era Open Source, sem o c&oacute;digo
      propriet&aacute;rio da AT&amp;T.  Finalmente isso aconteceu com
      o <emphasis>Networking Tape 2</emphasis>, normalmente conhecido
      como  <emphasis>Net/2</emphasis>.  O Net/2 n&atilde;o era um
      sistema operacional completo: aproximadamente 20% do
      c&oacute;digo do kernel estava faltando.  Um dos membros do
      CSRG, William F. Jolitz, escreveu o c&oacute;digo que faltava e
      o lan&ccedil;ou em 1992, como o <emphasis>386BSD</emphasis>.  Ao
      mesmo tempo, um outro grupo de membros do extinto CSRG formou
      uma empresa comercial chamada de <ulink
	url="http://www.bsdi.com/">Berkeley Software Design
	Inc.</ulink> e lan&ccedil;ou uma vers&atilde;o beta de seu
      sistema operacional, chamada de <ulink
	url="http://www.bsdi.com/">BSD/386</ulink>, baseado nos mesmos
      fontes.  Depois o nome do sistema operacional mudou para
      BSD/OS.</para>

    <para>O 386BSD nunca se tornou um sistema operacional
      est&aacute;vel.  Ao inv&eacute;s disso, outros dois projetos
      nasceram &agrave; partir dele, em 1993: O <ulink 
      url="http://www.NetBSD.org/">NetBSD</ulink> e o <ulink 
      url="&url.base;/index.html">FreeBSD</ulink>.  Originalmente
      os dois projetos divergiram devido &agrave;s diferen&ccedil;as
      quanto &agrave; paci&ecirc;ncia na espera de novas melhorias no
      386BSD:  o pessoal do NetBSD come&ccedil;ou o projeto no
      in&iacute;cio do ano, e a primeira vers&atilde;o do FreeBSD
      n&atilde;o ficou pronta at&eacute; o final do ano.  No meio
      tempo, a base do c&oacute;digo se modificou o suficiente para
      tornar dif&iacute;cil uma uni&atilde;o.  Em
      adi&ccedil;&atilde;o, os projetos tinham objetivos diferentes,
      como veremos a seguir.  Em 1996, um projeto posterior, o <ulink
	url="http://www.OpenBSD.org/">OpenBSD</ulink>, originou-se
      &agrave; partir do NetBSD e em 2003, o <ulink
      url="http://www.dragonflybsd.org/">DragonFlyBSD</ulink>
      originou-se a partir do FreeBSD.</para>
  </sect1>

  <sect1 id="why-is-bsd-not-better-known">
    <title>Por qu&ecirc; o BSD n&atilde;o &eacute; mais
      conhecido?</title>

    <para>Por algumas raz&otilde;es, o BSD &eacute; relativamente
      desconhecido:</para>

    <orderedlist>
      <listitem>
	<para>Os desenvolvedores do BSD est&atilde;o frequentemente
	  mais interessados em aprimorar seu c&oacute;digo do que
	  fazer propaganda dele.</para>
      </listitem>

      <listitem>
	<para>A maior parte da popularidade do Linux se deve a fatores
	  externos ao projeto Linux, como a imprensa, e companhias
	  criadas para oferecer servi&ccedil;os em Linux.  At&eacute;
	  recentemente, os BSDs open source n&atilde;o contavam com
	  tais proponentes.</para>
      </listitem>

      <listitem>
	<para>Os desenvolvedores BSD tendem a ser mais experientes do
	  que desenvolvedores Linux, e tem menos interesse em tornar o
	  sistema f&aacute;cil de utilizar.  Novatos tendem a se
	  sentir mais confort&aacute;veis com Linux.</para>
      </listitem>

      <listitem>
	<para>Em 1992, a AT&amp;T processou a <ulink
	    url="http://www.bsdi.com/">BSDI</ulink>, vendedora do
	  BSD/386, alegando que o produto continha c&oacute;digo
	  propriet&aacute;rio da AT&amp;T.  O caso foi resolvido na
	  corte, em 1994, mas os aspectos da litiga&ccedil;&atilde;o
	  continuam perseguindo as pessoas.  Em Mar&ccedil;o de 2000
	  um artigo publicado na rede afirmou que o caso havia sido
	  <quote>resolvido recentemente</quote>.
	</para>

	<para>Um detalhe que o processo judicial clarificou foi sobre a
	  denomina&ccedil;&atilde;o: nos anos 80, os BSD eram
	  conhecidos como <quote>BSD &unix;</quote>.  Com a
	  elimina&ccedil;&atilde;o do &uacute;ltimo vest&iacute;gio de
	  c&oacute;digo da AT&amp;T no BSD, ele tamb&eacute;m perdeu o
	  direito de ser chamado de &unix;  Contudo ainda podem ser
	  vistas refer&ecirc;ncias em t&iacute;tulos de livros como
	  <quote>the 4.3BSD &unix; operating system</quote> e 
	  <quote>the 4.4BSD operating system</quote>.</para>
      </listitem>

      <listitem>
	<para>Existe uma id&eacute;ia que os projetos BSD sejam
	  fragmentados e beligerantes.  O <ulink
	    url="http://interactive.wsj.com/bin/login?Tag=/&amp;URI=/archive/retrieve.cgi%253Fid%253DSB952470579348918651.djm&">Wall 
	    Street Journal</ulink> falou de
	  <quote>balkaniza&ccedil;&atilde;o</quote> nos projetos BSD.
	  Assim como o processo judicial, essas id&eacute;ias se
	  baseiam fundamentalmente em hist&oacute;ria antiga.</para>
      </listitem>
    </orderedlist>
  </sect1>

  <sect1 id="comparing-bsd-and-linux">
    <title>Comparando BSD e Linux</title>

    <para>Ent&atilde;o qual &eacute; realmente a diferen&ccedil;a
      entre, digamos, o Debian Linux e o FreeBSD?  Pra maioria dos
      usu&aacute;rios, as diferen&ccedil;as s&atilde;o
      surpreendentemente pequenas: Ambos s&atilde;o sistemas
      operacionais &unix; like.  Ambos s&atilde;o desenvolvidos por
      projetos n&atilde;o comerciais (&eacute; claro que isso
      n&atilde;o se aplica a muitas outras distribui&ccedil;&otilde;es
      Linux).  Na pr&oacute;xima se&ccedil;&atilde;o, vamos dar uma
      olhada no BSD e compar&aacute;-lo com o Linux.  As
      descri&ccedil;&otilde;es se aplicam mais ao FreeBSD, que
      somatiza uma m&eacute;dia estimada de 80% das
      instala&ccedil;&otilde;es de sistemas BSD, mas as
      diferen&ccedil;as pro NetBSD, pro OpenBSD e pro DragonFlyBSD 
      s&atilde;o pequenas.</para>

    <sect2>
      <title>Quem &eacute; dono do BSD?</title>

      <para>Nenhuma pessoa ou corpora&ccedil;&atilde;o &eacute; dona
	do BSD.  Ele &eacute; criado e distribu&iacute;do por uma
	comunidade de contribuidores altamente t&eacute;cnicos em todo
	o mundo.  Alguns dos componentes do BSD s&atilde;o projetos
	Open Source independentes e gerenciados por mantenedores de 
	projetos distintos.</para>
    </sect2>

    <sect2>
      <title>Como o BSD &eacute; desenvolvido e atualizado?</title>

      <para>Os kernels do BSD s&atilde;o desenvolvidos e mantidos
	seguindo o modelo de desenvolvimento do Open Source.  Cada
	projeto mant&eacute;m uma <quote>&aacute;rvore de
	  c&oacute;digo fonte</quote> publicamente acess&iacute;vel
	sob o <ulink url="http://www.cvshome.org/">Sistema de
	  Vers&otilde;es Concorrentes</ulink> (CVS), que cont&eacute;m
	todos os arquivos fontes do projeto, incluindo
	documenta&ccedil;&atilde;o e outros arquivos acidentais.  O
	CVS permite que usu&aacute;rios fa&ccedil;am <quote>check
	  out</quote> (em outras palavras, extrair uma c&oacute;pia)
	de qualquer vers&atilde;o desejada do sistema.</para>

      <para>Um grande n&uacute;mero de desenvolvedores ao redor do
	mundo contribui para as melhorias do BSD.  Eles s&atilde;o
	divididos em 3 tipos:</para>

      <itemizedlist>
	<listitem>
	  <para><firstterm>Contribuidores</firstterm> escrevem
	    c&oacute;digo e documenta&ccedil;&atilde;o.  Eles
	    n&atilde;o t&ecirc;m permiss&atilde;o de commit (adicionar
	    c&oacute;digo) diretamente na &aacute;rvore de
	    c&oacute;digo fonte.  Para que seu c&oacute;digo seja
	    incluso no sistema, &eacute; necess&aacute;rio que seja
	    revisado e aprovado por um desenvolvedor registrado, os
	    quais s&atilde;o conhecidos como
	    <emphasis>committer</emphasis>.</para>
	</listitem>

	<listitem>
	  <para><firstterm>Committers</firstterm> s&atilde;o
	    desenvolvedores com acesso de escrita na &aacute;rvore do
	    c&oacute;digo fonte.  Para se tornar um commiter, o
	    indiv&iacute;duo deve mostrar habilidade na &aacute;rea em
	    que ele &eacute; ativo.</para>

	  <para>Faz parte da responsabilidade individual de cada
	    desenvolvedor considerar quando devem obter
	    autoriza&ccedil;&atilde;o antes de fazer um commit na
	    &aacute;rvore.  No geral, desenvolvedores experientes
	    podem fazer modifica&ccedil;&otilde;es que s&atilde;o
	    obviamente corretas sem precisar de consenso.  Por
	    exemplo, um commiter do projeto de
	    documenta&ccedil;&atilde;o pode corrigir erros
	    tipogr&aacute;ficos ou gramaticais sem a
	    necessidade de uma revis&atilde;o.  Por outro lado,
	    espera-se que desenvolvedores que fazem
	    altera&ccedil;&otilde;es muito abrangentes ou complicadas
	    enviem suas mudan&ccedil;as para revis&atilde;o antes de
	    adicion&aacute;-las.  Em casos extremos, um membro do
	    Grupo Central (Core Team) cuja fun&ccedil;&atilde;o seja,
	    o Arquiteto Principal pode ordenar que as
	    modifica&ccedil;&otilde;es sejam retiradas da
	    &aacute;rvore do c&oacute;digo fonte, em um processo
	    conhecido como <firstterm>backing out</firstterm>.  Todos
	    os desenvolvedores recebem mensagens de correio
	    eletr&ocirc;nico sobre cada altera&ccedil;&atilde;o
	    individual, portanto &eacute; imposs&iacute;vel fazer
	    alguma modifica&ccedil;&atilde;o secretamente.</para>
	</listitem>

	<listitem>
	  <para>O <firstterm>Grupo Central</firstterm>.  O FreeBSD e o
	    NetBSD cada qual, tem um grupo central que gerencia o
	    projeto.  Tais grupos centrais foram criados no decorrer
	    dos projetos e seu papel n&atilde;o &eacute; sempre bem
	    definido.  N&atilde;o &eacute; preciso ser um
	    desenvolvedor para se tornar membro do grupo central,
	    apesar de que, normalmente esse &eacute; o caso.  As
	    regras para o grupo central variam de um projeto para o
	    outro, mas no geral eles t&ecirc;m mais voz na hora de dizer as
	    dire&ccedil;&otilde;es que o projeto deve seguir, do que
	    outros membros fora do grupo.</para>
	</listitem>
      </itemizedlist>

      <para>Esse modelo se diferencia do Linux em in&uacute;meras
	maneiras:</para>

      <orderedlist>
	<listitem>
	  <para>N&atilde;o existe uma pessoa em especial que controla
	    o conte&uacute;do do sistema.  Na pr&aacute;tica, essa
	    diferen&ccedil;a &eacute; sobretaxada, considerando que o
	    Arquiteto Principal pode solicitar que c&oacute;digos 
	    sejam retirados do sistema, e que at&eacute; mesmo o 
	    projeto Linux tem v&aacute;rias pessoas autorizadas a 
	    fazer modifica&ccedil;&otilde;es.</para>
	</listitem>

	<listitem>
	  <para>Por outro lado, <emphasis>existe</emphasis> um
	    reposit&oacute;rio central, um lugar &uacute;nico onde os
	    fontes inteiros do sistema operacional podem ser
	    encontrados, incluindo todas as vers&otilde;es
	    anteriores.</para>
	</listitem>

	<listitem>
	  <para>Os projetos BSD mant&eacute;m um <quote>Sistema
	      Operacional</quote> completo, n&atilde;o apenas o
	    kernel.  Essa distin&ccedil;&atilde;o &eacute;
	    marginalmente proveitosa: nem o BSD nem o Linux s&atilde;o
	    &uacute;teis sem aplica&ccedil;&otilde;es.  As
	    aplica&ccedil;&otilde;es usadas sob BSD s&atilde;o
	    frequentemente as mesmas aplica&ccedil;&otilde;es usadas
	    sob Linux.</para>
	</listitem>

	<listitem>
	  <para>Como resultado da manuten&ccedil;&atilde;o formalizada
	    de uma &uacute;nica &aacute;rvore CVS do c&oacute;digo
	    fonte, o desenvolvimento do BSD &eacute; limpo, e &eacute;
	    poss&iacute;vel acessar qualquer vers&atilde;o do sistema
	    por seu n&uacute;mero de lan&ccedil;amento (release) ou
	    por data.  O CVS ainda oferece manuten&ccedil;&atilde;o
	    incremental ao sistema: por exemplo, o reposit&oacute;rio
	    do FreeBSD &eacute; atualizado em m&eacute;dia 100 vezes
	    por dia.  A maioria dessas altera&ccedil;&otilde;es
	    &eacute; de pequena ordem.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>Releases BSD</title>

      <para>O FreeBSD, o NetBSD e o OpenBSD oferecem o sistema em 
	tr&ecirc;s <quote>vers&otilde;es (releases)</quote> 
	diferentes.  Como no Linux, os releases s&atilde;o 
	identificados por um n&uacute;mero, como 1.4.1 ou 3.5.  Em 
	adi&ccedil;&atilde;o, o n&uacute;mero da vers&atilde;o tem 
	um sufixo, indicando seu prop&oacute;sito:</para>

      <orderedlist>
	<listitem>
	  <para>A vers&atilde;o de desenvolvimento do sistema &eacute;
	    chamada de <firstterm>CURRENT</firstterm>.  O FreeBSD
	    relaciona um n&uacute;mero ao CURRENT, por exemplo, FreeBSD
	    5.0-CURRENT.  O NetBSD usa um esquema de
	    denomina&ccedil;&atilde;o um pouco diferente, adicionando
	    um sufixo com uma letra &uacute;nica que indica
	    modifica&ccedil;&otilde;es nas interfaces internas, por
	    exemplo NetBSD 1.4.3G.  O OpenBSD n&atilde;o adiciona
	    n&uacute;meros (<quote>OpenBSD-current</quote>).  Todo 
	    novo desenvolvimento no sistema vai nesse branch.</para>
	</listitem>

	<listitem>
	  <para>Em intervalos regulares, entre duas a quatro vezes por
	    ano, os projetos lan&ccedil;am uma nova vers&atilde;o de
	    <firstterm>RELEASE</firstterm> do sistema, que &eacute;
	    disponibilizado em CD-ROM e por download gratu&iacute;to
	    em s&iacute;tios de FTP, por exemplo OpenBSD 2.6-RELEASE
	    ou NetBSD 1.4-RELEASE.  A vers&atilde;o do RELEASE
	    &eacute; destinada a usu&aacute;rios finais e &eacute; a
	    vers&atilde;o normal do sistema.  O NetBSD oferece ainda
	    <emphasis>patch releases</emphasis> (releases de
	    corre&ccedil;&otilde;es) com um terceiro d&iacute;gito,
	    por exemplo, NetBSD 1.4.2.</para>
	</listitem>

	<listitem>
	  <para>Conforme os problemas s&atilde;o encontrados em uma
	    vers&atilde;o RELEASE, eles s&atilde;o corrigidos, e as
	    corre&ccedil;&otilde;es s&atilde;o adicionadas &agrave;
	    &aacute;rvore CVS.  No FreeBSD a vers&atilde;o resultante
	    &eacute; chamada de <firstterm>STABLE</firstterm>,
	    enquanto que no NetBSD e no OpenBSD elas continuam sendo
	    chamadas de vers&atilde;o RELEASE.  Novas
	    caracter&iacute;sticas menores tamb&eacute;m podem ser
	    adicionadas nesse branch depois do per&iacute;odo de
	    testes no CURRENT.</para>
	</listitem>
      </orderedlist>

      <para><emphasis>Em contraste, o Linux mant&eacute;m duas
	  &aacute;rvores de c&oacute;digo separadas: a vers&atilde;o
	  est&aacute;vel e a vers&atilde;o de desenvolvimento.  A
	  vers&atilde;o est&aacute;vel tem ainda um n&uacute;mero
	  menor de vers&atilde;o, como 2.0, 2.2 ou 2.4.  Vers&otilde;es
	  em desenvolvimento tem o n&uacute;mero menor &iacute;mpar,
	  como 2.1, 2.4 e 2.5.  Em cada caso, a vers&atilde;o &eacute;
	  ainda seguida de um n&uacute;mero posterior designando o
	  release exato.  Em adi&ccedil;&atilde;o, cada vendedor de
	  Linux coloca suas pr&oacute;prias aplica&ccedil;&otilde;es e
	  utilit&aacute;rios &agrave; n&iacute;vel de usu&aacute;rio,
	  portanto o nome de sua distribui&ccedil;&atilde;o
	  tamb&eacute;m &eacute; importante.  Cada
	  distribui&ccedil;&atilde;o do vendedor ainda &eacute;
	  acrescida de seu pr&oacute;prio n&uacute;mero, ent&atilde;o
	  a descri&ccedil;&atilde;o completa seria algo parecido com
	  <quote>TurboLinux 6.0 com kernel
	    2.2.14</quote></emphasis></para>
    </sect2>

    <sect2>
      <title>Quais s&atilde;o as vers&otilde;es dispon&iacute;veis do
	BSD?</title>

      <para>Em contraste com as numerosas distribui&ccedil;&otilde;es
	Linux, existem apenas quatro BSDs de c&oacute;digo livre.
	Cada projeto BSD mant&eacute;m sua pr&oacute;pria
	&aacute;rvore de c&oacute;digo fonte e seu pr&oacute;prio
	kernel.  Na pr&aacute;tica, as diverg&ecirc;ncias entre o
	c&oacute;digo &agrave; n&iacute;vel de usu&aacute;rio parece
	ser ainda menor entre os projetos BSD do que entre os
	v&aacute;rios Linux.</para>

      <para>&Eacute; dif&iacute;cil categorizar os objetivos de cada
	projeto: as diferen&ccedil;as s&atilde;o bastante subjetivas.
	Basicamente,</para>

      <itemizedlist>
	<listitem>
	  <para>O FreeBSD clama por alta performance e facilidade de
	    uso para usu&aacute;rios finais, e &eacute; o favorito de
	    provedores de conte&uacute;do da rede mundial de
	    computadores.  Ele pode ser usado em um grande
	    n&uacute;mero de plataformas, incluindo sistemas baseados
	    em &i386; (<quote>PCs</quote>), sistemas baseados em
	    processadores AMD 64-bit, sistemas baseados em
	    &ultrasparc;, sistemas baseados em processadores Compaq
	    Alpha e sistemas baseados em torno da
	    especifica&ccedil;&atilde;o NEC PC-98.  O projeto &os; 
	    possui significativamente mais usu&aacute;rios do que 
	    os outros projetos.</para>
	</listitem>
	<listitem>
	  <para>O NetBSD clama pelo m&aacute;ximo de portabilidade:
	    <quote>&eacute; l&oacute;gico que roda NetBSD</quote>.  Ele
	    roda de m&aacute;quinas palmtop &agrave; grandes
	    servidores, e vem sendo usado at&eacute; em miss&otilde;es
	    espaciais da NASA.  &Eacute; particularmente uma boa
	    escolha para rodar em equipamentos antigos que n&atilde;o
	    sejam &intel;.</para>
	</listitem>

	<listitem>
	  <para>O OpenBSD clama por seguran&ccedil;a e pureza de
	    c&oacute;digo: ele usa uma combina&ccedil;&atilde;o dos
	    conceitos de c&oacute;digo livre com rigorosas
	    revis&otilde;es de seu c&oacute;digo para criar um sistema
	    demonstravelmente correto, tornando-o a escolha de
	    organiza&ccedil;&otilde;es conscientes com a
	    seguran&ccedil;a como bancos e departamentos do governo.
	    Como o NetBSD, ele roda em v&aacute;rias
	    plataformas.</para>
	</listitem>

	<listitem>
	  <para>O DragonFlyBSD clama por alta performance e
	  escalabilidade acima de tudo, n&atilde;o importa se estamos
	  falando de um sistema composto por um &uacute;nico n&oacute;
	  ou um sistema massivamente clusterizado.  O DragonFlyBSD tem
	  muitos objetivos t&eacute;cnicos de longo prazo, mas o seu
	  foco concentra-se em prover uma infra estrutura de SMP
	  (multiprocessamento sim&eacute;trico) que seja f&aacute;cil
	  de entender, manter e desenvolver.</para>
	</listitem>
      </itemizedlist>

      <para>Existem ainda dois sistemas operacionais BSD &unix; 
	adicionais que n&atilde;o s&atilde;o de c&oacute;digo livre, 
	o BSD/OS e o &macos; X da Apple:</para>

      <itemizedlist>
	<listitem>
	  <para>O BSD/OS era o mais velho dos derivados do 4.4BSD.  
	    Ele n&atilde;o era de c&oacute;digo livre, embora as
	    licen&ccedil;as de seu c&oacute;digo fonte estivessem
	    dispon&iacute;veis por um pre&ccedil;o relativamente
	    baixo.  Ele assemelhava-se ao FreeBSD de diversas formas.
	    Dois anos depois da aquisi&ccedil;&atilde;o da BSDI pela
	    Wind River Systems, o BSD/OS falhou em sobreviver como um
	    produto independente.  O suporte e o c&oacute;digo fonte
	    podem ainda estar dispon&iacute;veis pela Wind River, mas
	    os novos desenvolvimentos est&atilde;o todos focados no
	    sistema operacional embarcado VxWorks.</para>
	</listitem>

	<listitem>
	  <para>O <ulink url="http://www.apple.com/macosx/server/">
	    &macos; X</ulink> &eacute; a mais recente vers&atilde;o do
	    sistema operacional da linha &macintosh; da <ulink
	    url="http://www.apple.com/">Apple Computers Inc.</ulink>
	    O core BSD deste sistema operacional, o <ulink
	    url="http://developer.apple.com/darwin/">Darwin</ulink>,
	    est&aacute; dispon&iacute;vel como um sistema operacional
	    completamente funcional para computadores x86 e PPC.
	    Contudo, o sistema gr&aacute;fico Aqua/Quartz e muitos
	    outros aspectos propriet&aacute;rios do &macos; X
	    continuam como c&oacute;digo fechado.  V&aacute;rios
	    desenvolvedores do Darwin tamb&eacute;m s&atilde;o
	    desenvolvedores do &os; e vice versa.</para>
	</listitem>
      </itemizedlist>
    </sect2>

    <sect2>
      <title>Como a licen&ccedil;a BSD se diferencia da licen&ccedil;a
	P&uacute;blica GNU?</title>

      <para>O Linux est&aacute; dispon&iacute;vel sob a <ulink
	  url="http://www.fsf.org/copyleft/gpl.html">Licen&ccedil;a
	  P&uacute;blica Geral GPL (GPL)</ulink>, que foi planejada
	para eliminar o software propriet&aacute;rio (de fonte
	fechada).  Em particular, qualquer trabalho derivado de um
	produto lan&ccedil;ado sob a GPL tamb&eacute;m deve oferecer
	seu c&oacute;digo fonte, caso seja requerido.  Em contraste, a
	<ulink
	  url="http://www.opensource.org/licenses/bsd-license.html">licen&ccedil;a 
	  BSD</ulink> &eacute; menos restritiva:
	distribui&ccedil;&otilde;es apenas bin&aacute;rias s&atilde;o
	permitidas.  Isso &eacute; particularmente atrativo para
	aplica&ccedil;&otilde;es acopladas (embedded).</para>
    </sect2>

    <sect2>
      <title>O que mais eu deveria saber?</title>

      <para>Considerando que um n&uacute;mero menor de
	aplica&ccedil;&otilde;es est&aacute; dispon&iacute;vel para
	o BSD do que para o Linux, os desenvolvedores do BSD criaram
	um pacote de compatibilidade Linux, que permite que programas
	Linux sejam executados sob BSD.  O pacote inclui
	modifica&ccedil;&otilde;es no kernel, de forma a possibilitar
	as corretas chamadas de sistemas Linux, e arquivos de
	compatibilidade Linux, como a biblioteca C.  N&atilde;o existe
	diferen&ccedil;a not&aacute;vel na velocidade de
	execu&ccedil;&atilde;o entre aplica&ccedil;&otilde;es Linux
	rodando em uma m&aacute;quina Linux e aplica&ccedil;&otilde;es
	Linux rodando em uma m&aacute;quina BSD de mesma
	velocidade.</para>

      <para>A natureza <quote>tudo do mesmo fornecedor</quote> dos
	sistemas BSD implica na maior facilidade de
	atualiza&ccedil;&atilde;o do que frequentemente acontece no
	caso do Linux.  Os BSD oferecem atualiza&ccedil;&otilde;es de
	vers&otilde;es de bibliotecas oferecendo m&oacute;dulos de
	compatibilidade com vers&otilde;es mais antigas de
	bibliotecas, dessa forma &eacute; poss&iacute;vel rodar
	bin&aacute;rios que existem h&aacute; v&aacute;rios anos sem o
	menor problema.</para>
    </sect2>

    <sect2>
      <title>Qual eu devo usar, BSD ou Linux?</title>

      <para>O que isso tudo significa na pr&aacute;tica?  Quem deve
	usar BSD?  Quem deve usar Linux?</para>

      <para>Essa &eacute; uma pergunta muito dif&iacute;cil para se
	responder.  Aqui est&atilde;o algumas
	considera&ccedil;&otilde;es:</para>

      <itemizedlist>
	<listitem>
	  <para><quote>Se n&atilde;o est&aacute; quebrado, n&atilde;o
	      conserte</quote>:  Se voc&ecirc; j&aacute; usa algum
	    sistema operacional de c&oacute;digo livre, e est&aacute;
	    feliz com ele, provavelmente n&atilde;o existe uma boa
	    raz&atilde;o para mudar.</para>
	</listitem>

	<listitem>
	  <para>Sistemas BSD, em particular o FreeBSD, podem ter
	    performance notavelmente superior ao Linux.  Mas
	    isso n&atilde;o &eacute; uma regra.  Em muitos casos a
	    diferen&ccedil;a pode ser pouca ou at&eacute; mesmo nem
	    existir.  Em alguns casos o Linux pode funcionar melhor
	    que o FreeBSD.</para>
	</listitem>

	<listitem>
	  <para>No geral, sistemas BSD tem melhor
	    reputa&ccedil;&atilde;o por sua confiabilidade,
	    principalmente por ser resultado de uma base de
	    c&oacute;digos mais madura.</para>
	</listitem>

	<listitem>
	  <para>Os projetos BSD t&ecirc;m uma melhor
	    reputa&ccedil;&atilde;o em rela&ccedil;&atilde;o a
	    qualidade e abrang&ecirc;ncia da sua
	    documenta&ccedil;&atilde;o.  Os v&aacute;rios projetos de
	    documenta&ccedil;&atilde;o t&ecirc;m por objetivo prover
	    ativamente documentos atualizados, em muitos idiomas e
	    cobrindo todos os aspectos do sistema.</para>
	</listitem>


	<listitem>
	  <para>A licen&ccedil;a BSD pode ser mais atrativa do que a
	    GPL.</para>
	</listitem>

	<listitem>
	  <para>O BSD pode executar a maioria dos bin&aacute;rios do
	    Linux, enquanto o Linux n&atilde;o pode executar
	    bin&aacute;rios do BSD.  Muitas das
	    implementa&ccedil;&otilde;es; BSD podem inclusive executar
	    bin&aacute;rios de outros sistemas derivados do &unix;.
	    Como resultado, o BSD pode ser uma op&ccedil;&atilde;o de
	    migra&ccedil;&atilde;o a partir de outros sistemas mais
	    f&aacute;cil do que o Linux seria.</para>
	</listitem>
      </itemizedlist>
    </sect2>

    <sect2>
      <title>Quem oferece suporte, servi&ccedil;os e treinamento para
	o BSD?</title>

      <para>A BSDI / <ulink url="http://www.freebsdmall.com">FreeBSD
	Mall, Inc.</ulink> t&ecirc;m fornecido contratos de suporte
	FreeBSD no mercado a quase uma d&eacute;cada.</para>
      
      <para>Em adi&ccedil;&atilde;o, cada um dos projetos tem uma
	lista de consultores que podem ser contratados: <ulink
	  url="&url.base;/commercial/consulting_bycat.html">FreeBSD</ulink>, 
	<ulink
	  url="http://www.netbsd.org/gallery/consultants.html">NetBSD</ulink>, 
	e <ulink
	  url="http://www.openbsd.org/support.html">OpenBSD</ulink>.</para>
    </sect2>
  </sect1>
</article>
