<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/donations/index.sgml,v 1.3 2004/01/06 17:31:40 stephane Exp $">
<!ENTITY title "Coordination des donations au projet FreeBSD">
<!ENTITY email 'donations'>
<!ENTITY % navincludes SYSTEM "../includes.navabout.sgml"> %navincludes;
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.11

   Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
  &header;

    <h2>Contenu</h2>
    <ul>
      <li><a href="#goal">Objectif pour la coordination des donations</a></li>
      <li><a href="#charter">Charte</a></li>
      <li><a href="#donating">Faire un don au projet FreeBSD</a></li>
    </ul>

    <h2>Autres liens au sujet des donations</h2>
    <ul>
      <li><a href="wantlist.html">Liste des besoins des d&eacute;veloppeurs FreeBSD</a></li>
      <li><a href="donors.html">Liste des donations</a></li>
    </ul>

    <a name="goal"></a>
    <h2>Objectif</h2>

    <p>Parall&egrave;lement &agrave; l'augmentation du nombre d'utilisateurs de
      FreeBSD, le nombre de personnes qui d&eacute;sirent
      faire des dons mat&eacute;riels ou financiers a &eacute;galement augment&eacute;. La
      coordination des donations a pour but de rationaliser la gestion
      de ces dons et de s'assurer qu'ils sont g&eacute;r&eacute;s de mani&egrave;re raisonnable
      et dans les meilleurs d&eacute;lais.</p>

    <a name="charter"></a>
    <h2>Charte</h2>

    <p>L'objectif du responsable des donations est d'encourager et de
      faciliter les donations en accord avec un ensemble de r&egrave;gles accept&eacute;s
      par la communaut&eacute; FreeBSD.
      Ce responsable a les reponsabilit&eacute;s suivantes :</p>

    <ul>
      <li>&eacute;tablir et maintenir un ensemble claire de proc&eacute;dures pour
        la gestion des donations.</li>

      <li>r&eacute;pondre aux offres de dons dans un d&eacute;lai raisonnable.</li>

      <li>maintenir une liste d'&eacute;quipements et de ressources dont aurait
        besoin la communaut&eacute; FreeBSD.</li>

      <li>coordonner les offres de dons avec la communaut&eacute;
        des d&eacute;veloppeurs FreeBSD.</li>

      <li>"guider" les donations &agrave; travers tout le processus de
        donation.</li>

      <li>coordonner une &eacute;quipe de 3 &agrave; 4 personnes afin de s'assurer qu'une
        r&eacute;ponse correcte puisse &ecirc;tre apport&eacute;e dans un temps raisonnable
        &agrave; toute &eacute;ventuelle question.</li>

      <li>remercier publiquement les donateurs et confirmer publiquement
        la r&eacute;ception des dons.</li>

      <li>enregistrer le statut de tous les pr&ecirc;ts au Projet FreeBSD.</li>

      <li>fournir une liste consultable publiquement de tous les dons
        faits au profit de la communaut&eacute; des d&eacute;veloppeurs FreeBSD.</li>
    </ul>

    <a name="donating"></a>
    <h2>Faire un don au projet FreeBSD</h2>

    <p>Donc, vous voulez faire don de quelque chose au projet FreeBSD ?
      Excellent ! Nous comptons beaucoup sur les dons d'utilisateurs pour accomplir nos
      objectifs. Merci de lire les informations ci-dessous pour savoir comment nous contacter &agrave; propos de
      votre don.</p>

    <p>Si vous ne savez pas exactement ce que vous voulez donner, vous pouvez consulter notre <a
      href="wantlist.html">liste de besoins</a>. Nous recevrons avec plaisir n'importe quel
      objet de cette liste. Si vous avez du mat&eacute;riel que vous souhaitez donner,
      lisez ce qui suit.</p>

    <a name="taxcredit"></a>
    <h3>R&eacute;duction d'imp&ocirc;ts pour les donations</h3>

    <p>La "FreeBSD Foundation" peut &ecirc;tre consid&eacute;r&eacute;e comme organisation charitable en ce qui
      concerne les imp&ocirc;ts. <b>SI VOUS HABITEZ AUX ETATS-UNIS</b>, votre don
      peut-&ecirc;tre d&eacute;duit de vos imp&ocirc;ts sous certaines conditions. Si
      vous d&eacute;sirez un re&ccedil;u pour d&eacute;duire de vos imp&ocirc;ts votre contribution, merci
      de le pr&eacute;ciser avec les informations n&eacute;cessaires pour votre donation.</p>

    <p>Pouvoir b&eacute;n&eacute;ficier de cette r&eacute;duction d'imp&ocirc;ts n'est pas aussi simple qu'il n'y para&icirc;t. Les
      contributions d&eacute;ductibles doivent &ecirc;tre envoy&eacute;es &agrave; la "FreeBSD Foundation". Ensuite,
      un membre de la fondation doit s'occuper de la donation et l'envoyer &agrave; son
      destinataire final. La fondation doit aussi pouvoir
      d&eacute;montrer que la donation est pour le <i>bien publique</i>. Tout
      cela fait que m&ecirc;me si nous avons probablement des d&eacute;veloppeurs qui seraient
      int&eacute;ress&eacute;s par cette grosse bo&icirc;te de cartes ISA qui dort dans votre
      d&eacute;barras, vous ne pourrez sans doute pas avoir une r&eacute;duction d'imp&ocirc;ts pour ce don; la somme totale
      de travail n&eacute;cessaire pour g&eacute;rer, livrer et documenter ce don exc&eacute;derait de loin
      leur valeur totale.</p>

    <p>La "FreeBSD Foundation" fournira un re&ccedil;u pour la livraison du
      mat&eacute;riel. Elle ne fera pas une estimation de la valeur
      marchande du mat&eacute;riel -- en fait, la loi lui interdit de le
      faire. Nous conseillons de rechercher ailleurs les &eacute;valuations des
      dons de mat&eacute;riels. Etant donn&eacute; que la plupart des donations concernent du mat&eacute;riel obsol&egrave;te,
      ce qui rend difficile une &eacute;valuation juste, nous sugg&eacute;rons de rechercher sur
      Ebay ou sur d'autres sites de mat&eacute;riels d'occasions les prix pay&eacute;s pour des &eacute;quipements
      similaires.</p>

    <h3>Comment faire un don</h3>

    <p>Un des objectifs du Comit&eacute; de Coordination des Donations est de faire le lien
      entre les donations et les d&eacute;veloppeurs qui peuvent les utiliser. Nous n'acceptons pas
      simplement n'importe quelle donation; nous prenons uniquement en charge celles qu'un
      d&eacute;veloppeur pourra utiliser dans le cadre du projet FreeBSD. Cela permet un gain de temps
      pour tout le monde et permet aussi d'apporter aux donateurs l'assurance que leurs
      contributions seront vraiment utiliser pour le projet FreeBSD. L'inconv&eacute;nient
      est que nous avons besoin de quelques informations au sujet de votre donation
      avant de pouvoir l'accepter.</p>

    <p>Les donations se classent g&eacute;n&eacute;ralement dans l'une de ces trois cat&eacute;gories :</p>

    <ul>
      <li><a href="#money">Financi&egrave;res</a></li>
      <li><a href="#systems">Ordinateurs complets</a></li>
      <li><a href="#hardware">Pi&egrave;ces d&eacute;tach&eacute;es</a></li>
    </ul>

    <p>Si vous avez quelque chose &agrave; offrir qui ne tombe pas dans l'une de
      ces cat&eacute;gories, pas d'inqui&eacute;tude ! Contactez-nous &agrave; l'adresse
      donations@FreeBSD.org avec votre proposition. Ce n'est pas parce que
      cela sort de l'ordinaire que nous ne sommes pas int&eacute;ress&eacute;s.</p>

    <h3><a name="money">Contributions financi&egrave;res</a></h3>

    <p>Le Projet FreeBSD n'accepte pas directement les contributions
      financi&egrave;res. Une autre organisation, la <a
      href="http://www.freebsdfoundation.org">FreeBSD Foundation</a>,
      accepte les contributions financi&egrave;res pour notre compte. Merci de consulter leur site
      web pour tous les d&eacute;tails &agrave; propos des contributions financi&egrave;res.</p>

    <h3><a name="systems">Ordinateurs complets</a></h3>

    <p>Le Projet FreeBSD a constamment besoin d'ordinateurs. Si vous poss&eacute;dez un
      ordinateur dont vous souhaitez faire don au Projet, merci
      de nous contacter avec les informations suivantes :</p>

    <ul>
      <li>Pr&eacute;cisions sur le mat&eacute;riel : architecture, carte m&egrave;re, processeur,
        espace disque, m&eacute;moire (si l'ordinateur est un Alpha, merci d'inclure
        &eacute;galement la sortie des commandes SHOW CONFIG, SHOW MEM et
        SHOW DEV.)</li>

      <li>Est-ce que ce syst&egrave;me fonctionne actuellement sous FreeBSD ou est-il
        non support&eacute; ? Si possible, merci de joindre la sortie de la commande dmesg
	&agrave; partir d'un FreeBSD install&eacute; sur ce syst&egrave;me.</li>

      <li>Etes-vous pr&ecirc;ts &agrave; exp&eacute;dier ce syst&egrave;me ?</li>

      <li>Votre localisation g&eacute;ographique. Nous essayons de rendre l'exp&eacute;dition aussi simple et
        peu couteuse que possible.</li>

      <li>Pr&eacute;cisez &eacute;galement si vous d&eacute;sirez une <a href="#taxcredit">r&eacute;duction
        d'imp&ocirc;ts</a> pour cet ordinateur (notez que toutes les donations ne peuvent
        pas en pratique donner lieu &agrave; une r&eacute;duction d'imp&ocirc;ts, le co&ucirc;t de gestion
        de la r&eacute;duction pouvant d&eacute;passer la valeur de la donation).<li>
    </ul>

    <h3><a name="components">Pi&egrave;ces d&eacute;tach&eacute;es</a></h3>

    <p>Si vous avez des pi&egrave;ces d&eacute;tach&eacute;es dont vous souhaitez faire don au
      Projet, merci de nous contacter avec les informations suivantes :</p>

    <ul>
      <li>Une description du mat&eacute;riel : mod&egrave;le, num&eacute;ro de s&eacute;rie, fabricant,
        etc. Si vous avez un lien pr&eacute;cis sur une page web du fabricant
        pour ce composant, cela sera tr&egrave;s utile.</li>

      <li>Est-ce que ce mat&eacute;riel est actuellement support&eacute; par FreeBSD ?</li>

      <li>Quelle documentation avez-vous ? Un composant ne suffit pas
        pour &eacute;crire un driver; les d&eacute;veloppeurs de driver ont besoin de donn&eacute;es
	d&eacute;taill&eacute;es sur le composant de la part du fabricant (ne vous inqui&eacute;tez pas trop si
	vous n'avez pas cette documentation, elle est sans doute disponible
	ailleurs).</li>

      <li>Etes-vous pr&ecirc;ts &agrave; exp&eacute;dier ce mat&eacute;riel ?</li>

      <li>Votre localisation g&eacute;ographique. Nous essayons de rendre l'exp&eacute;dition aussi simple et
        peu couteuse que possible.</li>

      <li>Pr&eacute;cisez &eacute;galement si vous d&eacute;sirez une <a href="#taxcredit">r&eacute;duction
        d'imp&ocirc;ts</a> pour cet ordinateur (notez que toutes les donations ne peuvent
        pas en pratique donner lieu &agrave; une r&eacute;duction d'imp&ocirc;ts, le co&ucirc;t de gestion
        de la r&eacute;duction pouvant d&eacute;passer la valeur de la donation).<li>
    </ul>

    <h3>Que faisons-nous de ces informations</h3>

    <p>Une fois que nous avons une description de la donation, le Comit&eacute;
      de Coordination des Donations contactera l'ensemble des d&eacute;veloppeurs pour leur
      faire part de l'offre. Si un d&eacute;veloppeur est int&eacute;ress&eacute;,
      nous mettons en contact le donateur et le futur destinataire afin qu'ils
      se mettent d'accord sur la livraison. Si plusieurs d&eacute;veloppeurs
      sont int&eacute;ress&eacute;s, nous essayons de savoir ce que chaque d&eacute;veloppeur compte
      faire de ce don et nous l'allouons &agrave; ce qui para&icirc;t le plus profitable
      pour le Projet. Si aucun d&eacute;veloppeur n'est int&eacute;ress&eacute;, nous d&eacute;clinons
      l'offre.</p>

    <p>Notre objectif est de placer (ou de d&eacute;cliner) toutes les donations dans un d&eacute;lai de 7 jours
      apr&egrave;s la r&eacute;ception de toutes les informations.</p>

  &footer;
  </body>
</html>
