freebsd/freebsd-doc/fr_FR.ISO8859-1/man/man4/man4.i386/aic.4
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\" $Id: aic.4,v 1.1 2002-09-29 16:23:05 blackend Exp $
.\" Original revision: 1.10
.\"
.Dd November 29, 1994
.Dt AIC 4 i386
.Os
.Sh NAME
.Nm aic
.Nd Pilote pour contrôleurs SCSI Adaptec AIC-6260 et AIC-6360
.Sh SYNOPSIS
.Cd "device aic"
.Pp
In
.Pa /boot/device.hints :
.Cd hint.aic.0.at="isa"
.Sh DESCRIPTION
Le pilote
.Nm
fournit le support pour les circuits de contrôleurs SCSI Adaptec
AIC-6260 et AIC-6360.  Cela comprend les adaptateurs hôte SCSI
Adaptec 152x et Creative Labs SoundBlaster.
.Pp
De nombreux systèmes qui utilisent ces circuits contrôleurs n'ont pas
de ROM de démarrage et par conséquent ces contrôleurs ne peuvent
être utilisés pour démarrer.
.Sh VOIR AUSSI
.Xr cd 4 ,
.Xr ch 4 ,
.Xr da 4 ,
.Xr intro 4 ,
.Xr sa 4
