<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD: doc/fr_FR.ISO8859-1/articles/mh/article.sgml,v 1.1 1999/11/10 21:28:25 nik Exp $
     Original revision: 1.2
-->   

<!DOCTYPE ARTICLE PUBLIC "-//FreeBSD//DTD DocBook V3.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN"> %man;
<!ENTITY % urls PUBLIC "-//FreeBSD//ENTITIES Common Document URL Entities//FR"> %urls;
<!ENTITY % abstract PUBLIC "-//FreeBSD//ENTITIES DocBook Abstract Entities//FR"> %abstract;
<!ENTITY % artheader PUBLIC "-//FreeBSD//ENTITIES DocBook ArtHeader Entities//FR"> %artheader;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//FR"> %translators;

<!ENTITY % authors SYSTEM "../../../en_US.ISO8859-1/books/handbook/authors.ent"> %authors;
<!ENTITY % mailing-lists SYSTEM "../../books/handbook/mailing-lists.ent"> %mailing-lists;
 <!ENTITY rel.current CDATA "3.2">
]>
<article id="mh" LANG="fr">
  <artheader>
    <title>Introduction &agrave; MH</title>
      <authorgroup>
        <author>
          <firstname>Matt</firstname>
          <surname>Midboe</surname>
          <affiliation>
            <address><email>matt@garply.com</email></address>
          </affiliation>
        </author>
      </authorgroup>
    <pubdate>v1.0, 16 Janvier 1996</pubdate>
    &artheader.copyright;
    <abstract>
      <para>Ce document est une introduction sur la fa&ccedil;on d'utiliser MH 
        sous FreeBSD.</para>
      &abstract.license;
      &abstract.disclaimer;
      &trans.a.gioria; 
    </abstract>
  </artheader>
  <sect1>
    <title>Introduction</title>
      <para>MH d&eacute;buta en 1977 dans la soci&eacute;t&eacute; RAND 
        Corporation, o&ucirc; la philosophie MH fut d&eacute;velopp&eacute;e. MH
        n'est pas seulement un programme monolithique de courrier 
        &eacute;lectronique mais plut&ocirc;t une philosophie sur la meilleure 
        fa&ccedil;on de d&eacute;velopper des outils permettant de lire son
        courrier. Les d&eacute;veloppeurs de MH ont fourni un logiciel superbe 
        tout en adh&eacute;rent au concept <acronym>KISS</acronym>&nbsp;: 
        &ldquo;Keep It Simple Stupid&rdquo; (Rester le plus simple 
        possible).</para>
      <para>Plut&ocirc;t que de disposer d'un seul et complexe logiciel pour 
        lire, envoyer et g&eacute;rer ses courriers &eacute;lectroniques, ils 
        ont &eacute;crit une multitude de petits programmes
        sp&eacute;cialis&eacute;s. Certains aimeront MH pour cette
        sp&eacute;cificit&eacute;, d'autres non. Chaque outil de MH effectue une
        action, et l'effectue tr&egrave;s bien.</para>
      <para>En plus de tous les outils de gestion des courriers 
        &eacute;lectroniques, chaque outil MH comporte un m&eacute;canisme de 
        configuration uniforme. En fait, si vous ne savez pas vraiment comment 
        marche un outil, ou de quels arguments il dispose, vous vous en sortez 
        g&eacute;n&eacute;ralement tr&egrave;s facilement. Toutes les commandes
        de MH g&egrave;rent de fa&ccedil;on identique les fichiers de 
        configuration et les arguments de la ligne de commande. La chose la plus
        importante est de se souvenir que vous pouvez toujours passer l'option 
        <option>-help</option> &agrave; une commande pour afficher toutes les 
        options disponibles.</para>
      <para>Pour commencer, assurez vous que vous avez install&eacute; les 
        programmes de MH sur votre machine. Si vous disposez d'un CDROM vous
        devez pouvoir l'installer en ex&eacute;cutant la commande 
        suivante&nbsp;:</para>
      <informalexample>
<screen>#<userinput>>pkg_add /cdrom/packages/mh-6.8.3.tgz</userinput></screen>
      </informalexample>
      <para>Vous verrez alors la cr&eacute;ation d'un r&eacute;pertoire
        <filename>/usr/local/lib/mh</filename> ainsi que l'ajout de 
        diff&eacute;rents binaires dans le r&eacute;pertoire 
        <filename>/usr/local/bin</filename>. Si vous pr&eacute;f&eacute;rez le 
        compiler vous m&ecirc;me, vous pouvez t&eacute;l&eacute;charger les 
        sources en ftp anonyme depuis 
        <ulink url="ftp://ftp.ics.uci.edu/">ftp.ics.uci.edu</ulink> ou 
        <ulink url="ftp://louie.udel.edu/">louie.udel.edu</ulink>.</para>
      <para>Cette introduction n'est pas une explication d&eacute;taill&eacute;e
        de la fa&ccedil;on de fonctionner de MH. Elle vous permettra juste  
        d&eacute;marrer sur la route de la fa&ccedil;on la plus rapide de lire vos emails. Vous devrez
surement consulter les pages de manuels des diff&eacute;rentes commandes par
la suite. De m&ecirc;me il serait bon de lire le <ulink
URL="http://www.cis.ohio-state.edu/hypertext/faq/usenet/mh-faq/part1/faq.html">FAQ 
sur MH</ulink> et de vous abonnez au forum de discussion <ulink
URL="news:comp.mail.mh">comp.mail.mh</ulink>. Cependant la meilleur
ressource sur MH est le livre &eacute;crit par Jerry Peek aux &eacute;ditions
O'Reilly et Associates.</para>
</sect1>
<sect1>
<title>Lire le courrier</title>
<para>Ce chapitre explique les commandes <command>inc</command>,
<command>show</command>, <command>scan</command>, <command>next</command>,
<command>prev</>, <command>rmm</command>, <command>rmf</command>, and
<command>msgchk</command>. Le meilleur atout de MH est la consistence de
l'interface entre les diff&eacute;rents programmes. La chose la plus
importante &agrave; retenir lorsque l'on utilise les diff&eacute;rentes commandes,
est la fa&ccedil;on de sp&eacute;cifier une liste de messages. Dans le cas de la
commande <command>inc</command> cela n'a aucun sens mais avec des commandes
comme  <command>show</command> c'est plus qu'utile.</para>

<para>Une liste de messages consiste en quelque chose comme <parameter>23 20
16</parameter>, qui corresponds aux messages 23, 20 et 16. C'est vraiment tr&egrave;s
simple, mais vous pouvez avoir des choses plus  utiles comme
<parameter>23-30</parameter> correspondant &agrave; tous les messages entre le message 
23 et le message 30. Vous pouvez aussi sp&eacute;cifier <parameter>cur:10</parameter>, 
qui correspond au message courant et aux 9 messages suivants. Les
messages <parameter>cur</parameter><parameter>last</parameter>, et <parameter>first</parameter>
sont des messages sp&eacute;ciaux ref&eacute;rant au message courant, dernier
message, et premier message du dossier.</para>

<sect2 id="inc">
<title><command>inc</command>, <command>msgchk</command>&mdash;lire ou v&eacute;rifier vos
messages</title>

<para>Si vous tapez la commande <userinput>inc</userinput> sans arguments, vous 
d&eacute;butez sur la bonne voie pour lire  votre courrier avec MH. La
premi&egrave;re fois ou vous utilisez <command>inc</command>, il configurera votre
compte pour utilisez toutes les valeurs par d&eacute;faut de MH et vous
demandera la cr&eacute;ation d'un r&eacute;pertoire Mail. Si vous avez des messages
et attente de t&eacute;l&eacute;chargement, vous verrez quelque chose qui peut
ressembler &agrave; ceci:
<informalexample>
<screen>  29  01/15 Doug White         Re: Another Failed to boot problem&lt;&lt;On Mon, 15 J
  30  01/16 "Jordan K. Hubbar  Re: FBSD 2.1&lt;&lt;&gt; Do you want a library instead of
  31  01/16 Bruce Evans        Re: location of bad144 table&lt;&lt;&gt;&gt; &gt;It would appea
  32  01/16 "Jordan K. Hubbar  Re: video is up&lt;&lt;&gt; Anyway, mrouted won't run, ev
  33  01/16 Michael Smith      Re: FBSD 2.1&lt;&lt;Nate Williams stands accused of sa</screen>
</informalexample>
Vous obtenez la m&ecirc;me vue que si vous utilisiez la commande <command>scan</command> (voir
<xref linkend="scan">). Si vous lancez <command>inc</command> sans arguments
, cela vous affiche juste le courrier qui vous est destin&eacute;.</para>

<para>Enorm&eacute;ment de personnes utilisent le protocole POP pour lire
leur mail. MH sait utiliser le protocole POP pour rapatrier les emails 
sur votre poste. Vous devez passer plusieurs arguments &agrave;
<command>inc</command> pour cela.
<informalexample>
<screen>tempest% <userinput>inc -host mail.pop.org -user <replaceable>NomUtilisateur</replaceable> -norpop</userinput></screen>
</informalexample>
Cela invoque la commande <command>inc</command> en lui disant d'aller
t&eacute;l&eacute;charger le courrier sur le serveur <parameter>mail.pop.org</parameter>,
avec comme nom d'utilisateur <replaceable>NomUtilisateur</replaceable>. L'option
<option>-norpop</option> demande &agrave; la commande <command>inc</command> de
t&eacute;l&eacute;charger le courrier en clair suivant le protocole POP3. MH
supporte plusieurs variantes du protocole POP3. Vous n'utiliserez pas
dans la plupart des cas les autres variantes. Vous pouvez effectuer
des taches plus complexes avec <command>inc</command> comme, auditer des
fichiers ou parcourir des fichiers formatt&eacute;s
</para>
<para>La commande <command>msgchk</command> vous permet de savoir si
vous avez ou non de nouveaux messages dans votre
boite.<command>msgchk</command> accepte les m&ecirc;mes options
,<option>-host</option> et <option>-user</option>, que la commande
<command>inc</command>.</para>
</sect2>
<sect2 id="show">
<title><command>show</command>, <command>next</command> et <command>prev</command>&mdash;afficher un message et se d&eacute;placer dans une boite.</title>
<para><command>show</command> vous permet de visualiser un courrier de votre boite. Comme <command>inc</command>,<command>show</command> est une commande assez franche.Si vous tapez <userinput>show</userinput> sans param&egrave;tres elle affiche le message courant. Vous pouvez aussi demander l'affichage de messages particuliers en donnant son num&eacute;ro &agrave; <command>show</command>:
<informalexample>
<screen>tempest% <userinput>show 32 45 56</></screen>
</informalexample>
Cela affichera les fichiers num&eacute;ros 32 45 56 &agrave; la suite l'un de
l'autre. Si vous changez rien &agrave; la configuration par d&eacute;faut,
<command>show</command> ne fera rien d'autre qu'un
<command>more</command> sur le fichier contenant votre message.</para>

<para><command>next</command> s'utilise pour se d&eacute;placer au message
suivant et <command>prev</command> pour revenir au message
pr&eacute;cedent. Ces deux commandes executent automatiquement un
<command>show</command> ce qui vous permet de lire automatiquement le
message suivant ou pr&eacute;c&eacute;dant.</para>
</sect2>

<sect2 id="scan">
<title><command>scan</command>&mdash;Afficher un r&eacute;sum&eacute; de vos
messages</title>
<para><command>scan</command> affiche un bref descriptif de tous les
messages de votre r&eacute;pertoire courant. Voici un exemple d'affichage de
la commande <command>show</command>:
<informalexample>
<screen>  30+ 01/16 "Jordan K. Hubbar  Re: FBSD 2.1&lt;&lt;&gt; Do you want a library instead of
  31  01/16 Bruce Evans        Re: location of bad144 table&lt;&lt;&gt;&gt; &gt;It would appea
  32  01/16 "Jordan K. Hubbar  Re: video is up&lt;&lt;&gt; Anyway, mrouted won't run, ev
  33  01/16 Michael Smith      Re: FBSD 2.1&lt;&lt;Nate Williams stands accused of sa</screen>
</informalexample>
Comme tout dans MH, l'affichage est compl&egrave;tement configurable. Ce qui
est fournit dans l'exemple ci-dessus est l'affichage par d&eacute;faut. Il
vous permet de visualiser le num&eacute;ro du message, la date d'envoi,
l'envoyeur, le sujet et une partie du d&eacute;but du message. Le caract&egrave;re
<literal>+</literal> vous indique le message courant donc si vous
tapez la commande <command>show</command> vous visualiserez ce
message.</para>
<para>Une option tr&egrave;s utile de <command>scan</command> est l'option
<option>-reverse</option>. Cette option permet de lister l'ensemble de 
vos messages en affichant en premier le message ayant le num&eacute;ro le
plus &eacute;lev&eacute;. Une autre option tr&egrave;s interessante de
<command>scan</command> lui permet de lire les donn&eacute;es depuis un
fichier. Si vous d&eacute;sirez parcourir votre boite aux lettres de courrier 
entrant sans avoir &agrave; lancer la commande <command>inc</command>, il
vous suffit de faire <command>scan -file
/var/mail/<replaceable>nom_d_utilisateur</replaceable></command>. Cela 
peut etre fait sur n'importe quel fichier au format
<database>mbox</database>.</para>
</sect2>

<sect2 id="rmm">
<title><command>rmm</command> et <command>rmf</command>&mdash; Effacer 
le message courant ou le dossier</title>

<para><command>rmm</command> est utilis&eacute; pour effacer un message. Par
d&eacute;faut le message n'est pas vraiment d&eacute;truit mais renomm&eacute; en un
fichier dont le nom est ignor&eacute; par les commandes de MH. Vous devrez
effacer physiquement de fa&ccedil;on p&eacute;riodique les messages
&ldquo;effac&eacute;s&rdquo;.</para>
<para>La commande <command>rmf</command> permet d'effacer un
dossier. Cela ne renomme pas les fichiers mais les efface du disque
dur, vous devez donc faire extr&egrave;mement attention lorsque vous
l'utilisez.</para>
</sect2>
<sect2 id="samplereading">
<title>Un session typique de lecture avec MH</title>
<para>La premi&egrave;re chose que vous ferez sera de lancer la commande
<command>inc</command>. Donc sous l'interpr&eacute;teur de commandes tapez
<command>inc</command> et la touche <keycap>entr&eacute;e</keycap>.
<informalexample>
<screen>tempest% <userinput>inc</userinput>
Incorporating new mail into inbox...

  36+ 01/19 "Stephen L. Lange  Request...&lt;&lt;Please remove me as contact for pind
  37  01/19 Matt Thomas        Re: kern/950: Two PCI bridge chips fail (multipl
  38  01/19 "Amancio Hasty Jr  Re: FreeBSD and VAT&lt;&lt;&gt;&gt;&gt; Bill Fenner said: &gt; In 
tempest%</screen>
</informalexample>
Cela vous permet de visualiser les nouveaux messages rapatri&eacute;s dans
votre boite aux lettres. La commande suivante a &eacute;x&eacute;cuter est
<command>show</command> pour vous permettre de les visualiser et de
vous d&eacute;placer dans votre liste de messages.
<informalexample>
<screen>tempest% <userinput>show</>
Received: by sashimi.wwa.com (Smail3.1.29.1 #2)
        id m0tdMZ2-001W2UC; Fri, 19 Jan 96 13:33 CST
Date: Fri, 19 Jan 1996 13:33:31 -0600 (CST)
From: "Stephen L. Lange" &lt;stvlange@wwa.com&gt;
To: matt@garply.com
Subject: Request...
Message-Id: &lt;Pine.BSD.3.91.960119133211.824A-100000@sashimi.wwa.com&gt;
Mime-Version: 1.0
Content-Type: TEXT/PLAIN; charset=US-ASCII


Please remove me as contact for pindat.com

tempest% <userinput>rmm</>
tempest% <userinput>next</>
Received: from localhost (localhost [127.0.0.1]) by whydos.lkg.dec.com (8.6.11/8
.6.9) with SMTP id RAA24416; Fri, 19 Jan 1996 17:56:48 GMT
Message-Id: &lt;199601191756.RAA24416@whydos.lkg.dec.com&gt;
X-Authentication-Warning: whydos.lkg.dec.com: Host localhost didn't use HELO pro
tocol
To: hsu@clinet.fi
Cc: hackers@FreeBSD.org
Subject: Re: kern/950: Two PCI bridge chips fail (multiple multiport ethernet 
 boards) 
In-Reply-To: Your message of "Fri, 19 Jan 1996 00:18:36 +0100."
             &lt;199601182318.AA11772@Sysiphos&gt; 
X-Mailer: exmh version 1.5omega 10/6/94
Date: Fri, 19 Jan 1996 17:56:40 +0000
From: Matt Thomas &lt;matt@lkg.dec.com&gt;
Sender: owner-hackers@FreeBSD.org
Precedence: bulk


This is due to a typo in pcireg.h (to
which I am probably the guilty party).</screen>
</informalexample></para>
<para>La commande <command>rmm</command> efface le message courant et
la commande <command>next</command> permet de d&eacute;placer le num&eacute;ro du
message courant au message suivant. Maintenant vous d&eacute;sirez visualiser les
dix courriers les plus r&eacute;cents, pour choisir lequel vous d&eacute;sirez lire:
<informalexample>
<screen>tempest% <userinput>scan last:10</>
  26  01/16 maddy              Re: Testing some stuff&lt;&lt;yeah, well, Trinity has 
  27  01/17 Automatic digest   NET-HAPPENINGS Digest - 16 Jan 1996 to 17 Jan 19
  28  01/17 Evans A Criswell   Re: Hey dude&lt;&lt;&gt;From matt@tempest.garply.com Tue 
  29  01/16 Karl Heuer         need configure/make volunteers&lt;&lt;The FSF is looki
  30  01/18 Paul Stephanouk    Re: [alt.religion.scientology] Raw Meat (humor)&lt;
  31  01/18 Bill Lenherr       Re: Linux NIS Solaris&lt;&lt;--- On Thu, 18 Jan 1996 1
  34  01/19 John Fieber        Re: Stuff for the email section?&lt;&lt;On Fri, 19 Jan
  35  01/19 support@foo.garpl  [garply.com #1138] parlor&lt;&lt;Hello. This is the Ne
  37+ 01/19 Matt Thomas        Re: kern/950: Two PCI bridge chips fail (multipl
  38  01/19 "Amancio Hasty Jr  Re: FreeBSD and VAT&lt;&lt;&gt;&gt;&gt; Bill Fenner said: &gt; In 
tempest%</screen>
</informalexample>
Maintenant vous voulez lire le message num&eacute;ro 27, donc vous
tapez<userinput>show 27</userinput> et il s'affiche. Comme vous pouvez 
le voir apr&egrave;s ce court exemple MH est tr&egrave;s simple &agrave; utiliser pour
visualiser et lire votre courrier et est de plus tr&egrave;s intuitif.
</para>
</sect2>
</sect1>


<sect1>
<title>Chercher parmis les messages et les dossiers</title>

<para>Toute personne qui a beaucoup de mails aime &agrave; pouvoir mettre des
priorit&eacute;s, marquer les messages, les num&eacute;roter de diff&eacute;rentes
fa&ccedil;ons. MH permet de faire toutes ces taches de fa&ccedil;ons tr&egrave;s simple
comme d'habitude. Une chose dont nous n'avons pas encore parl&eacute; est le
concept de dossier. Vous avez surement utilis&eacute; le concept de dossier
avec d'autres programmes de lecture de courrier &eacute;l&eacute;ctronique. MH a
aussi des dossiers. MH peut aussi avoir des sous-dossiers de
dossiers. Un chose que vous devez avoir &agrave; l'esprit quand vous utilisez 
la commande <command>inc</command>, pour la premi&egrave;re fois, est qu'elle 
demande si vous voulez cr&eacute;er le r&eacute;pertoire <filename>Mail</filename>,
et qu'elle enregistre tout dans ce r&eacute;pertoire. Si vous regardez ce
qu'il se trouve dans ce r&eacute;pertoire, vous verrez un r&eacute;pertoire
<filename>inbox</filename>. Ce r&eacute;pertoire comporte tous vos nouveaux
messages qui n'ont pas encore &eacute;t&eacute; d&eacute;plac&eacute;s dans un autre
dossier.</para>

<para>Lorsque vous cr&eacute;ez un nouveau dossier, un r&eacute;pertoire est cr&eacute;e
sous votre r&eacute;pertoire <filename>Mail</filename> et les messages &agrave;
destination de se dossier sont stock&eacute;s dans ce r&eacute;pertoire. Lorsque un
nouveau message arrive, il est d&eacute;pos&eacute; dans votre r&eacute;pertoire
<filename>inbox</filename> avec comme nom le num&eacute;ro du message. Donc
m&ecirc;me si vous n'avez pas les outils MH pour lire votre courrier,
vous pouvez utiliser les commandes standards UNIX pour vous d&eacute;placer
parmis les dossiers et visualiser vos messages. C'est cette simplicit&eacute; 
qui vous donne autant de puissance dans le traitement de vos
messages.</para>

<para>De la meme fa&ccedil;on ou vous pouvez utiliser une liste de messages,
comme <parameter>23 16 42</parameter>, avec la plupart des commandes
MH; il y a une option utilisable avec toutes les commandes MH vous
permettant de travailler dans le dossier sp&eacute;cifi&eacute;. Si vous essayer
<command>scan +freebsd</command>, vous allez parcourir le dossier
<filename>freebsd</filename>. Si vous faites un <command>show +freebsd 
23 16 42</command>, la commande <command>show</command> affichera les
messages 23, 26 et 42 du dossier <filename>freebsd</filename>. Donc
souvenez vous que la syntaxe
<option>+<replaceable>dossier</replaceable></option>. Vous en aurez besoin pour
lancer les commandes dans les diff&eacute;rents dossiers. Souvenez vous aussi 
que votre dossier de courrier entrant par d&eacute;faut est
<filename>inbox</filename>, donc en faisant un <command>folder
+inbox</command> vous aurez la liste de vos nouveaux messages. Bien
sur grace &agrave; la flexibilit&eacute; de MH, vous pourriez changer ce dossier,
mais il y a peu d'interet &agrave; le faire.</para>

<sect2>
<title><command>pick</command>&mdash; recherche par crit&egrave;res dans les
messages</title>
<para><command>pick</command> est une des commandes les plus
compliqu&eacute;es de MH. Je ne saurais pas mieux vous conseiller que d'aller 
voir la page de manuel de
<citerefentry><refentrytitle>pick</refentrytitle><manvolnum>1</manvolnum></citerefentry> 
pour bien la comprendre. La plus simple fa&ccedil;on de s'en servir est la
suivante:
<informalexample>
<screen>tempest% <userinput>pick -search pci</userinput>
15
42
55
56
57</screen>
</informalexample>
Cela vous permet de trouver les num&eacute;ros de tous les messages
comprenant le mot <literal>pci</literal> dans une des lignes du
message. Vous pouvez ensuite lancer la commande
<command>show</command> sur ces messages pour les lire ou
<command>rmm</command> pour les effacer. Vous devrez bien sur lancer
la commande suivante <command>show 15 42 55-57</command> pour les voir 
tous. Une fa&ccedil;on un peu plus compliqu&eacute;e d'utiliser
<command>pick</command> serait la suivante:
<informalexample>
<screen>tempest% <userinput>pick -search pci -seq pick</userinput>
5 hits
tempest% <userinput>show pick</userinput></screen>
</informalexample>
Cela vous permet de voir les memes messages que pr&eacute;c&eacute;demment sans vous 
fatiguer. L'option <option>-seq</option> n'est rien de plus qu'une
abr&eacute;viation de l'option<option>-sequence</option> et la commande
<command>pick</command> n'est rien de plus qu'une sequence comportant
les num&eacute;ros des messages v&eacute;rifiant le crit&egrave;re. Vous pouvez aussi
utiliser la commande <command>rmm pick</command> pour effacer tous les 
messages qui r&eacute;pondent au crit&egrave;re. Le nom de la sequence n'est pas
signifiant. Si vous relancez la commande <command>pick</command> de
nouveau, l'ancienne s&eacute;quence sera effac&eacute;e si vous utilisez le meme
nom.</para>

<para>Si vous n'utilisiez que la commande <command>pick
-search</command>, cela peut prendre plus de temps que de chercher un
message entre un destinataire et un envoyeur. La commande
<command>pick</command> dispose donc de certains crit&egrave;res pr&eacute;d&eacute;finis:
<variablelist>

<varlistentry>
<term><option>-to</option></term>
<listitem>
<para>recherche sur le destinataire</para>
</listitem>
</varlistentry>


<varlistentry>
<term><option>-cc</option></term>
<listitem>
<para>recherche dans le champ cc du message</para>
</listitem>
</varlistentry>

<varlistentry>
<term><option>-from</option></term>
<listitem>
<para>recherche sur l'exp&eacute;diteur du message</para>
</listitem>
</varlistentry>

<varlistentry>
<term><option>-subject</option></term>
<listitem>
<para>recherche dans le sujet du message</para>
</listitem>
</varlistentry>

<varlistentry>
<term><option>-date</option></term>
<listitem>
<para>recherche par rapport &agrave; la date du message</para>
</listitem>
</varlistentry>


<varlistentry>
<term><option>--<replaceable>component</replaceable></option></term>
<listitem>
<para>recherche sur un quelconque autre entete. (ex:
<option>--reply-to</option> pour rechercher dans les entetes reply-to
des messages)</para>
</listitem>
</varlistentry></variablelist></para>

<para>Cela permet d'avoir des requetes de ce type:
<informalexample>
<screen>tempest% <userinput>pick -to freebsd-hackers@freebsd.org -seq hackers</userinput></screen>
</informalexample>
pour avoir tous les messages envoy&eacute;s &agrave; la liste de diffusion hackers
de FreeBSD. <command>pick</command> vous permet de grouper de
diff&eacute;rentes fa&ccedil;on en fonctiondu crit&egrave;re.
<itemizedlist>

<listitem>
<para>&hellip; <option>-and</option> &hellip;</para>
</listitem>

<listitem>
<para>&hellip; <option>-or</option> &hellip</para>
</listitem>

<listitem>
<para><option>-not</option> &hellip;</para>
</listitem>

<listitem>
<para><option>-lbrace</option> &hellip; <option>-rbrace</option></para>
</listitem>
</itemizedlist>
Ces options permettent de faire des choses comme ceci:
<informalexample>
<screen>tempest% <userinput>pick -to freebsd-hackers -and -cc freebsd-hackers</userinput></screen>
</informalexample>
Cela vous permet de retrouver tous les messages envoy&eacute;s &agrave; la liste
freebsd-hackers ou mis en copie &agrave; cette liste. Les options <option>lbrace</option> et 
<option>rbrace</option> vous permettent de grouper les crit&egrave;res ensemble. Cela peut
etre util dans certaines situations, comme dans l'exemple suivant:
<informalexample>
<screen>tempest% <userinput>pick -lbrace -to freebsd-hackers -and 
  -not -cc freebsd-questions -rbrace -and -subject pci</></screen>
</informalexample></para>

<para>Cet exemple vous permet d'extraire tous les mails destin&eacute;s &agrave; <quote>la
liste freebsd-hackers (mais qui ne sont pas mis en copie pour la liste 
freebsd-questions) et dont le sujet est pci</quote>. Normalement vous
vous poseriez la question; mais quelle est la pr&eacute;c&eacute;dence des
op&eacute;rateurs ? Vous vous rappelez qu'en math&eacute;matiques les expressions
sont &eacute;valu&eacute;es de gauche &agrave; droite et que la multiplication et la
division ont plus de poids que les additions et les soustractions. MH
utilise les memes r&egrave;gles pour la commande <command>pick</command>. Les 
combinaisons peuvent etre tr&egrave;s complexes, donc lisez la page de manuel 
pour plus d'informations. Ce document est juste la pour vous aider &agrave;
d&eacute;couvrir MH.</para>
</sect2>

<sect2>
<title><command>folder</command>, <command>folders</command>,
<command>refile</command>&mdash; trois programmes utiles pour g&eacute;rer vos
dossiers.</title>

<para>Il y a trois programmes vous permettant de g&eacute;rer de fa&ccedil;on
primitive vos dossiers. Le programme <command>folder</command> est
utilis&eacute; pour changer de dossiers, lister leur contenu. Vous pouvez
lancer la commande <command>folder
+<replaceable>dossier2</replaceable></command> et automatiquement,
vous vous retrouverez dans le dossier
<replaceable>dossier2</replaceable>. Alors toutes les commandes MH,
telles que
<command>comp</command>,<command>repl</command>,<command>scan</command>,
et <command>show</command> utiliserons le dossier <filename>dossier2</filename>.</para>

<para>Quelques fois lorsque vous lisez et effacez dans messages vous
avez des <quote>discontinuit&eacute;es</quote> dans vos dossiers. Si vous faites un
<command>scan</command> vous pouvez voir les messages  34, 35, 36, 43,
55, 56, 57, 80. Si vous faites un <command>folder -pack</command>,
cela vous permet de renum&eacute;roter tous vos messages, et vous n'aurez
plus de disccontinuit&eacute;es. Cela n'efface aucun message. Vous devez donc 
p&eacute;riodiquement faire des <command>rmm</command> sur vos
messages.</para>

<para>Si vous desirez des statistiques sur vos dossiers, vous pouvez
faire des <command>folders</command> ou des <command>folder
-all</command> pour obtenir la liste de vos dossiers, combien de
messages comporte chaque dossier et quel est le message courant dans
chacun. La ligne de statistique affich&eacute;e est la meme que celle que
vous avez lorsque vous changez de dossier avec la commande
<command>folder +dossier2</>. Un exemple de la commande
<command>folders</command> pourrait etre:
<informalexample>
<screen>                Folder      # of messages (  range  ); cur  msg  (other files)
              announce  has    1 message  (   1-   1).
                drafts  has   no messages.
             f-hackers  has   43 messages (   1-  43).
           f-questions  has   16 messages (   1-  16).
                 inbox+ has   35 messages (   1-  38); cur=  37.
                 lists  has    8 messages (   1-   8).
             netfuture  has    1 message  (   1-   1).
                   out  has   31 messages (   1-  31).
              personal  has    6 messages (   1-   6).
                  todo  has   58 messages (   1-  58); cur=   1.

                     TOTAL=  199 messages in 13 folders.
</screen>
</informalexample></para>

<para>La commande <command>refile</command> vous permet de deplacer
les messages entre les dossiers. Si vous faites un <command>refile 23
+nouveaudossier</command>, le message 23 sera d&eacute;placer dans le dossier 
<filename>nouveaudossier</filename>. Vous pouvez tout aussi bien faire 
un <command>refile 23 +nouveaudossier/sousdossier1</command> qui
d&eacute;placera le message 23 dans le un sous
dossier,<filename>sousdossier1</filename>, du dossier
<filename>nouveaudossier</filename>. Si vous voulez garder un message
dans le dossier courant tout en le mettant dans un autre, vous devez
lancer la commande <command>refile -link 23 +nouveaudossier</command>, 
qui gardera le message dans le dossier <filename>inbox</filename> tout 
en le listant dans le dossier
<filename>nouveaudossier</filename>. Cela vous permet de r&eacute;aliser
toutes les choses merveilleuses que vous pouvez faire avec MH.</para>
</sect2>
</sect1>

<sect1>
<title>Envoyer des messages</title>
<para>L'email est pour beaucoup de gens, comme une rue a double sens,
vous voudrez donc r&eacute;pondre a certains messages. La fa&ccedil;on qu'emploie MH 
pour envoyer des messages peut etre difficile a comprendre au d&eacute;but,
mais il permet une &eacute;norme flexibilit&eacute;e.La premi&egrave;re chose que fait MH,
est de copier un "composant" dans votre file de messages sortant. Un
"composant" est en fait un squelette de message comportant les entetes 
<filename>To:</filename> et <filename>Subject:</filename>. Le syst&egrave;me
lance ensuite votre &eacute;diteur favori ou vous pouvez remplir les entetes
et composer le corps du message sous les pointill&eacute;s dans le
message. Ensuite vous lancez la commande
<command>whatnow</command>. Et lorsque vous avez le prompt
<prompt>What now?</prompt>, vous pouvez r&eacute;pondre par une des commandes 
suivante <command>send</command>, <command>list</command>, <command>edit</command>,
<command>edit</command>, <command>push</command>, and
<command>quit</command>. La plupart des commandes pr&eacute;c&eacute;dentes
s'expliquent d'elles meme. Donc le processus d'envoi de message est le 
suivant; copie du fichier "composant", &eacute;dition de votre message, et
lancement de la commande <command>whatnow</command> en lui indiquant
quoi faire de votre message.</para>

<sect2>
<title><command>comp</>, <command>forw</>,
<command>reply</>&mdash;composer, faire suivre ou r&eacute;pondre &agrave; un
message</title>

<para>La commande <command>comp</command> comporte quelques options de 
la ligne de commande int&eacute;ressantes. La plus importante est
<option>-editor</option>.Lorsque vous installez MH, un programme
appell&eacute; <command>prompter</command> est utiliser comme &eacute;diteur de
texte par d&eacute;faut. Ce n'est pas un &eacute;diteur tr&egrave;s interessant. Donc
lorsque vous composez un message, vous utiliserez surement
<command>comp -editor /usr/bin/vi</command> ou <command>comp -editor
/usr/local/bin/pico</command> a la place. Apr&egrave;s avoir lancer
<emphasis>comp</emphasis>, vous vous trouvez dans votre &eacute;diteur de
texte favori et vous voyez quelque chose qui ressemble &agrave; ceci:
<informalexample>
<screen>To:
cc:
Subject:
--------
</screen>
</informalexample></para>
<para>Vous devez ajoutez l'addresse de votre destinataire apres le mot 
<literal>To:</literal>. Vous devez remplir de la meme mani&egrave;re les
autres entetes, donc vous devez mettre le sujet apr&egrave;s le mot
<literal>Subject:</literal>. Vous pouvez ensuite ajouter le corps de
votre message apr&egrave;s les lignes pointill&eacute;es. Cela peut vous sembler un
peu simpliste par rapport a d'autres programmes de messagerie qui vous 
pose des questions et remplissent automatiquement les diff&eacute;rents
entete, mais cela vous apporte une excellente flexibilit&eacute;.
<informalexample>
<screen>To:<userinput>freebsd-rave@freebsd.org</userinput>
cc:
Subject:<userinput>Et le 8&egrave;me jour, Dieu cr&eacute;a le bureau des directeurs de FreeBSD</userinput>
--------
<userinput>Ouah, c'est un super syst&egrave;me d'exploitation. Merci !</userinput></screen>
</informalexample>
Vous pouvez ensuite, sauvegarder le message et quitter votre
&eacute;diteur. Vous aurez alors le prompt <prompt>What now?</prompt> et vous 
pourrez taper <userinput>send</userinput> ou <userinput>s</userinput>
et appuyer sur la touche <keycap>entr&eacute;e</keycap>. Alors l'&eacute;quipe
principal de d&eacute;veloppemet de FreeBSD recevra votre gratitude. Comme
mentionn&eacute; pr&eacute;cedemment vous pouvez utiliser une des autres r&eacute;ponse,
par exemple <command>quit</command> si vous ne voulez pas envoyer ce
message.</para>

<para>La commande <command>forw</command> s'utilise de fa&ccedil;on
similaire. La principal diff&eacute;rence est que le message que vous envoyez 
comprends dans son corps le message courant. Lorsque vous utilisez la
commande <command>forw</command>, vous faites suivre le message
courant a un autre destinataire. Vous pouvez faire suivre un autre
message en utilisant de la fa&ccedil;on suivante <command>forw 23</command>
la commande <command>forw</command>, ainsi le message 23 sera ajoute
dans le corps du message compos&eacute;. A part ces simples diff&eacute;rences, la
commande <command>forw</command>, fonctionne de la meme fa&ccedil;on que la
commande <command>comp</command>. </para>

<para>La commande <command>repl</command> vous permet de r&eacute;pondre au
message courant, sauf si vous lui indiquez un autre num&eacute;ro de
message. La commande <command>repl</command> essaye de remplir au
mieux les diff&eacute;rents champs de l'entete en fonction de ce qui se
trouve dans le message de base. Vous noterez donc que le
champ<literal> To:</literal> de l'entete comporte deja l'adresse du
destinataire et que la ligne <literal>Subject:</literal> est deja
remplie. Ensuite vous composez de la fa&ccedil;on habituelle votre
message. Un option interessante de cette commande est
<option>-cc</option>. Vous pouvez utiliser comme parametre
<parameter>all</parameter>, <parameter>to</parameter>,
<parameter>cc</parameter>,<parameter>me</parameter> avec cette option; 
cela vous permet d'ajouter de fa&ccedil;on simple, les adresses en copie du
message original. Vous noterez que le message original n'est pas inclu
par d&eacute;faut. C'est le comportement par d&eacute;faut de la plupart des
configuration de MH.
</para>
</sect2>

<sect2>
<title><filename>components</filename>, et
<filename>replcomps</filename>&mdash;les fichiers de composition pour
<command>comp</> and <command>repl</></title>

<para>Le fichier <filename>components</filename> se trouve la plupart
du temps dans le r&eacute;pertoire
<filename>/usr/local/lib/mh</filename>. Vous pouvez copier ce fichier
dans votre r&eacute;pertoire de MH et l'&eacute;diter pour ajouter ce que vous
voulez. Vous avez certaines lignes d'entete de mail par d&eacute;faut au
d&eacute;but, une ligne pointill&eacute;e et puis plus rien. La commande
<command>comp</command> ne fait que copier ce fichier et vous permet
ensuite de l'&eacute;diter. Vous pouvez ajouter n'importe quel entete valide
(RFC822). Par exemple, vous pourriez avoir le fichier
<filename>components</filename> suivant:
<informalexample>
<screen>To:
Fcc: out
Subject:
X-Mailer: MH 6.8.3
X-Comment: FreeBSD the power to serve
X-Home-Page: http://www.freebsd-fr.org/
-------</screen>
</informalexample>
MH copiera donc ce fichier et vous enverra dans votre &eacute;diteur
favori. Le fichier <filename>components</filename> est tr&egrave;s simple. Si 
vous d&eacute;sirez inclure une signature, il vous suffit de l'ajouter dans
ce fichier.</para>

<para>Le fichier <filename>replcomps</filename> est un peu plus
complexe. Son contenu par d&eacute;faut ressemble &agrave; ceci:
<informalexample>
<screen>%(lit)%(formataddr %&lt;{reply-to}%?{from}%?{sender}%?{return-path}%&gt;)\
%&lt;(nonnull)%(void(width))%(putaddr To: )\n%&gt;\
%(lit)%(formataddr{to})%(formataddr{cc})%(formataddr(me))\
%&lt;(nonnull)%(void(width))%(putaddr cc: )\n%&gt;\
%&lt;{fcc}Fcc: %{fcc}\n%&gt;\
%&lt;{subject}Subject: Re: %{subject}\n%&gt;\
%&lt;{date}In-reply-to: Your message of "\
%&lt;(nodate{date})%{date}%|%(pretty{date})%&gt;."%&lt;{message-id}
             %{message-id}%&gt;\n%&gt;\
--------
</screen>
</informalexample></para>

<para>Ce fichier a le meme format de base que le fichier
<filename>components</filename> mais il comporte un peu plus de codes
de mise en forme. La commande <literal>%(lit)</literal> cr&eacute;e l'espace
n&eacute;cessaire pour l'adresse. La commande <literal>%(formataddr</literal> 
est une fonction qui retourne une adresse e-mail coh&eacute;rente. Le morceau 
suivant <literal>%&lt;</literal> permet de remplir le champ de
l'adresse avec l'adresse correspondante dans le cas ou elle se trouve
dans le champ <literal>{reply-to}</literal> du message de
l'emetteur. Cela sera donc transfom&eacute; de la mani&egrave;re suivante:
<informalexample>
<screen>%&lt;<emphasis remap=bf>si</emphasis> {reply-to} <emphasis
remap=bf> dans le message original ou trouve un champ reply-to</emphasis> 
alors la mettre dans le champ formataddr, %? <emphasis remap=bf>sinon
prendre le contenu du champ </emphasis> {from} <emphasis
remap=bf></emphasis>, %? <emphasis remap=bf>sinon</emphasis> prendre
le champ {sender} <emphasis remap=bf></emphasis>, %?
<emphasis remap=bf>et en dernier lieu prendre le champ </emphasis> {return-path} <emphasis remap=bf></emphasis>, %&gt; <emphasis remap=bf>endif</emphasis>.</screen>
</informalexample></para>

<para>Comme vous pouvez le voir, le formattage des champs de MH peut
etre largement &eacute;tendu. Vous pourrez surment d&eacute;crypter le maximum des
autres fonctions et des noms de variables. Toutes les autres
informations sur le fa&ccedil;on d'&eacute;crire ces chaines de formattage se trouve 
dans la page de manuel de MH. Donc lorsque vous aurez finit de creer
votre fichier <filename>replcomps</filename> vous n'aurez plus besoin
d'y toucher. Aucun autre programme ne vous donne autant de flexibilit&eacute; 
et de pouvoir que MH.</para>
</sect2>

</sect1>



</article>

