Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: This line configures the client to provide anyone with a valid account in the NIS server's password maps an account on the client. There are many ways to configure the NIS client by modifying this line. One method is described in <<network-netgroups>>. For more detailed reading, refer to the book `Managing NFS and NIS`, published by O'Reilly Media.
ko: 이 줄은 NIS 서버의 비밀번호 매핑에 유효한 계정을 가진 모든 사용자에게 클라이언트의 계정을 제공하도록 클라이언트를 구성합니다. 이 줄을 수정하여 NIS 클라이언트를 구성하는 방법에는 여러 가지가 있습니다. 한 가지 방법은 <<network-netgroups>>에 설명되어 있습니다. 더 자세한 내용은 O’Reilly Media에서 발행한 ‘NFS 및 NIS 관리 (Managing NFS and NIS)’라는 책을 참조하십시오.

source: The first step is the initialization of the NIS`netgroup` map. In FreeBSD, this map is not created by default. On the NIS master server, use an editor to create a map named [.filename]#/var/yp/netgroup#.
ko: 첫 번째 단계는 NIS의 `netgroup` 맵을 초기화하는 것입니다. FreeBSD에서는 이 맵이 자동으로 생성되지 않습니다. NIS 마스터 서버에서 편집기를 사용하여 [.filename]#/var/yp/netgroup#이라는 이름의 맵을 생성합니다.

source: At one in point in time, support for SSL inside of Apache required a secondary module called [.filename]#mod_ssl#. This is no longer the case and the default install of Apache comes with SSL built into the web server. An example of how to enable support for SSL websites is available in the installed file, [.filename]#httpd-ssl.conf# inside of the [.filename]#/usr/local/etc/apache24/extra# directory Inside this directory is also a sample file called named [.filename]#ssl.conf-sample#. It is recommended that both files be evaluated to properly set up secure websites in the Apache web server.
ko: 한때 Apache 내부에서 SSL을 지원하려면 [.filename]#mod_ssl#이라는 보조 모듈이 필요했습니다. 하지만 이제는 더 이상 필요하지 않으며 Apache를 기본 설치하면 웹 서버에 SSL이 내장되어 있습니다. SSL 웹사이트 지원을 활성화하는 방법의 예는 설치된 파일인 [.filename]#/usr/local/etc/apache24/extra# 디렉토리에 있는 [.filename]#httpd-ssl.conf#에서 확인할 수 있습니다. 이 디렉토리 안에는 [.filename]#ssl.conf-sample#이라는 이름의 샘플 파일도 포함되어 있습니다. Apache 웹 서버에서 보안 웹사이트를 올바르게 설정하려면 두 파일을 모두 확인하는 것이 좋습니다.

source: Django
ko: 장고 (Django)

source: Ruby on Rails
ko: 루비 온 레일즈 (Ruby on Rails)

source: On FreeBSD, the Samba client libraries can be installed using the package:net/samba413[] port or package. The client provides the ability for a FreeBSD system to access SMB/CIFS shares in a Microsoft(R) Windows(R) network.
ko: FreeBSD에서 Samba 클라이언트 라이브러리는 package:net/samba413[] 포트 또는 패키지를 사용하여 설치할 수 있습니다. 이 클라이언트는 FreeBSD 시스템이 Microsoft(R) Windows(R) 네트워크의 SMB/CIFS 공유에 액세스할 수 있는 기능을 제공합니다.

source: A FreeBSD system can also be configured to act as a Samba server by installing the same package:net/samba413[] port or package. This allows the administrator to create SMB/CIFS shares on the FreeBSD system which can be accessed by clients running Microsoft(R) Windows(R) or the Samba client libraries.
ko: 또한 동일한 package:net/samba413[] 포트 또는 패키지를 설치하여 FreeBSD 시스템이 Samba 서버로 작동하도록 구성할 수도 있습니다. 이를 통해 관리자는 Microsoft(R) Windows(R) 또는 Samba 클라이언트 라이브러리를 실행하는 클라이언트에서 액세스할 수 있는 SMB/CIFS 공유를 FreeBSD 시스템에 생성할 수 있습니다.

source: The most common settings are `security = share` and `security = user`. If the clients use usernames that are the same as their usernames on the FreeBSD machine, user level security should be used. This is the default security policy and it requires clients to first log on before they can access shared resources.
ko: 가장 일반적인 설정은 `security = share`와 `security = user`입니다. 클라이언트가 FreeBSD 머신의 사용자 이름과 동일한 사용자 이름을 사용하는 경우, 사용자 수준 보안(user level security)을 사용해야 합니다. 이것은 기본 보안 정책이며 클라이언트가 공유 리소스에 액세스하기 전에 먼저 로그온해야 합니다.

source: In share level security, clients do not need to log onto the server with a valid username and password before attempting to connect to a shared resource. This was the default security model for older versions of Samba.
ko: 공유 수준 보안(share level security)에서는 클라이언트가 공유 리소스에 연결을 시도하기 전에 유효한 사용자 이름과 비밀번호로 서버에 로그인할 필요가 없습니다. 이는 이전 버전의 Samba의 기본 보안 모델이었습니다.

source: ntpd and the unpriveleged `ntpd` user
ko: ntpd와 권한없는 `ntpd` 사용자

source: ntpd on FreeBSD can start and run as an unpriveleged user. Doing so requires the man:mac_ntpd[4] policy module. The [.filename]#/etc/rc.d/ntpd# startup script first examines the NTP configuration. If possible, it loads the `mac_ntpd` module, then starts ntpd as unpriveleged user `ntpd` (user id 123). To avoid problems with file and directory access, the startup script will not automatically start ntpd as `ntpd` when the configuration contains any file-related options.
ko: FreeBSD에서 권한이 없는 사용자도 ntpd를 시작하고 실행할 수 있습니다. 그렇게 하려면 man:mac_ntpd[4] 정책 모듈이 필요합니다. [.filename]#/etc/rc.d/ntpd# 시작 스크립트는 먼저 NTP 구성을 검사합니다. 가능하면 `mac_ntpd` 모듈을 로드한 다음 권한이 없는 사용자 `ntpd`(user id 123)로 ntpd를 시작합니다. 파일 및 디렉터리 액세스 문제를 방지하기 위해, 시작 스크립트는 구성에 파일 관련 옵션이 포함되어 있는 경우 자동으로 `ntpd`로 ntpd를 시작하지 않습니다.

source: -f or --driftfile
ko: -f 또는 --driftfile

source: -i or --jaildir
ko: -i 또는 --jaildir

source: -k or --keyfile
ko: -k 또는 --keyfile

source: -l or --logfile
ko: -l 또는 --logfile

source: -s or --statsdir
ko: -s 또는 --statsdir

source: The following is an example of a simple [.filename]#/etc/ctl.conf# configuration file. Refer to man:ctl.conf[5] for a more complete description of this file's available options.
ko: 다음은 간단한 [.filename]#/etc/ctl.conf# 구성 파일의 예입니다. 이 파일에서 사용할 수 있는 옵션에 대한 자세한 설명은 man:ctl.conf[5]를 참조하세요.
