Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: Authoritative Name Server Configuration
ru: Конфигурация Авторитетного Сервера Имен

source: FreeBSD does not provide authoritative name server software in the base system. Users are encouraged to install third party applications, like package:dns/nsd[] or package:dns/bind918[] package or port.
ru: FreeBSD не предоставляет программное обеспечение авторитетного сервера имен в базовой системе. Пользователям рекомендуется устанавливать сторонние приложения, такие как package:dns/nsd[] или package:dns/bind918[] из пакетов или портов.

source: Zero-configuration Networking (mDNS/DNS-SD)
ru: Сетевое взаимодействие без настройки (mDNS/DNS-SD)

source: https://en.wikipedia.org/wiki/Zero-configuration_networking[Zero-configuration networking] (sometimes referred to as _Zeroconf_) is a set of technologies, which simplify network configuration. The main parts of Zeroconf are:
ru: https://en.wikipedia.org/wiki/Zero-configuration_networking[Сетевое взаимодействие без настройки] (иногда называемое _Zeroconf_) — это набор технологий, упрощающих настройку сети. Главные составные части Zeroconf:

source: Link-Local Addressing providing automatic assignment of numeric network addresses.
ru: Линк-локальная адресация, предоставляющая автоматическое назначение числовых сетевых адресов.

source: Multicast DNS (_mDNS_) providing automatic distribution and resolution of hostnames.
ru: Мультикаст DNS (_mDNS_), обеспечивающий автоматическое распространение и разрешение имён хостов.

source: DNS-Based Service Discovery (_DNS-SD_) providing automatic discovery of service instances.
ru: DNS-Based Service Discovery (_DNS-SD_), обеспечивающий автоматическое обнаружение экземпляров сервисов.

source: Configuring and Starting Avahi
ru: Настройка и запуск Avahi

source: One of the popular implementations of zeroconf is https://avahi.org/[Avahi]. Avahi can be installed and configured with the following commands:
ru: Одной из популярных реализаций zeroconf является https://avahi.org/[Avahi]. Avahi можно установить и настроить с помощью следующих команд:

source: Apache HTTP Server
ko: 아파치 HTTP 서버
ru: HTTP сервер Apache

source: The open source Apache HTTP Server is the most widely used web server. FreeBSD does not install this web server by default, but it can be installed from the package:www/apache24[] package or port.
ko: 오픈 소스 아파치 HTTP 서버는 가장 널리 사용되는 웹 서버입니다. FreeBSD는 기본적으로 이 웹 서버를 설치하지 않지만, package:www/apache24[] 패키지 또는 포트에서 설치할 수 있습니다.
ru: Веб-сервер с открытым исходным кодом Apache является наиболее широко используемым веб-сервером. FreeBSD не устанавливает этот веб-сервер по умолчанию, но его можно установить из пакета package:www/apache24[] или порта.

source: This section summarizes how to configure and start version 2._x_ of the Apache HTTP Server on FreeBSD. For more detailed information about Apache 2.X and its configuration directives, refer to http://httpd.apache.org/[httpd.apache.org].
ko: 이 섹션은 FreeBSD에서 아파치 웹서버 2.x_ 버전을 설정하고 시작하는 방법을 설명하고 있습니다. 아파치 2.X와 설정 지시어에 대한 더 자세한 정보는 http://httpd.apache.org/[httpd.apache.org]를 참고하세요.
ru: В этом разделе приведена сводка по настройке и запуску версии 2._x_ HTTP-сервера Apache на FreeBSD. Более подробная информация о Apache 2.X и его директивах конфигурации доступна по ссылке http://httpd.apache.org/[httpd.apache.org].

source: Configuring and Starting Apache
ko: 아파치 구성과 시작하기
ru: Настройка и запуск Apache

source: In FreeBSD, the main Apache HTTP Server configuration file is installed as [.filename]#/usr/local/etc/apache2x/httpd.conf#, where _x_ represents the version number. This ASCII text file begins comment lines with a `+#+`. The most frequently modified directives are:
ko: FreeBSD에서 기본 아파치 웹서버 설정파일은 [.filename]#/usr/local/etc/apache2x/httpd.conf#로 설치되며, 여기서 _x_는 버전번호를 나타냅니다. 이 ASCII 텍스트 파일은 `+#+`로 주석줄을 시작합니다. 가장 자주 수정하게되는 지시어는 다음과 같습니다:
ru: В FreeBSD основной файл конфигурации сервера Apache HTTP Server устанавливается как [.filename]#/usr/local/etc/apache2x/httpd.conf#, где _x_ обозначает номер версии. Этот текстовый файл в формате ASCII начинается со строк комментариев, обозначенных символом `+#+`. Наиболее часто изменяемые директивы:

source: Specifies the default directory hierarchy for the Apache installation. Binaries are stored in the [.filename]#bin# and [.filename]#sbin# subdirectories of the server root and configuration files are stored in the [.filename]#etc/apache2x# subdirectory.
ko: 아파치 설치의 기본 디렉토리 계층구조를 지정합니다. 바이너리는 서버 루트의 [.filename]#bin# 및 [.filename]#sbin# 하위 디렉터리에 저장되며 구성 파일은 [.filename]#etc/apache2x# 하위 디렉터리에 저장됩니다.
ru: Указывает иерархию каталогов по умолчанию для установки Apache. Исполняемые файлы хранятся в подкаталогах [.filename]#bin# и [.filename]#sbin# корня сервера, а конфигурационные файлы — в подкаталоге [.filename]#etc/apache2x#.

source: Change this to the email address to receive problems with the server. This address also appears on some server-generated pages, such as error documents.
ko: 이 주소를 서버 관련 문제를 수신할 이메일 주소로 변경합니다. 이 주소는 오류 문서와 같이 서버에서 생성한 일부 페이지에도 표시됩니다.
ru: Замените это на адрес электронной почты для получения сообщений о проблемах с сервером. Этот адрес также появляется на некоторых страницах, сгенерированных сервером, таких как документы об ошибках.

source: Allows an administrator to set a hostname which is sent back to clients for the server. For example, `www` can be used instead of the actual hostname. If the system does not have a registered DNS name, enter its IP address instead. If the server will listen on an alternate report, change `80` to the alternate port number.
ko: 관리자가 서버에 대해 클라이언트에 다시 전송되는 호스트 이름을 설정할 수 있습니다. 예를 들어 실제 호스트 이름 대신 `www`를 사용할 수 있습니다. 시스템에 등록된 DNS 이름이 없는 경우 대신 IP 주소를 입력합니다. 서버가 대체 보고서(대체 연락?)의 수신을 기다릴 경우 `80`을 다른 포트 번호로 변경합니다.
ru: Позволяет администратору установить имя хоста, которое отправляется клиентам сервера. Например, можно использовать `www` вместо фактического имени хоста. Если у системы нет зарегистрированного DNS-имени, введите её IP-адрес. Если сервер будет прослушивать альтернативный порт, замените `80` на номер альтернативного порта.

source: The directory where documents will be served from. By default, all requests are taken from this directory, but symbolic links and aliases may be used to point to other locations.
ko: 문서가 제공될 디렉터리입니다. 기본적으로 모든 요청은 이 디렉터리에서 가져오지만 심볼릭 링크와 별칭을 사용하여 다른 위치를 가리킬 수 있습니다.
ru: Каталог, из которого будут обслуживаться документы. По умолчанию все запросы обрабатываются из этого каталога, но символические ссылки и псевдонимы могут использоваться для указания на другие расположения.

source: It is always a good idea to make a backup copy of the default Apache configuration file before making changes. When the configuration of Apache is complete, save the file and verify the configuration using `apachectl`. Running `apachectl configtest` should return `Syntax OK`.
ko: 변경하기 전에 항상 기본 Apache 구성 파일의 백업본을 만드는 것이 좋습니다. 아파치 설정이 완료되면 파일을 저장하고 `apachectl`을 사용하여 설정을 확인합니다. `apachectl configtest`를 실행(아파치 설정 테스트)하면 `Syntax OK`가 반환되어야 합니다.
ru: Всегда рекомендуется создать резервную копию конфигурационного файла Apache по умолчанию перед внесением изменений. После завершения настройки Apache сохраните файл и проверьте конфигурацию с помощью `apachectl`. Запуск команды `apachectl configtest` должен вернуть `Syntax OK`.

source: To launch Apache at system startup, add the following line to [.filename]#/etc/rc.conf#:
ko: 시스템 시작 시 Apache를 시작하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:
ru: Чтобы запускать Apache при загрузке системы, добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: If Apache should be started with non-default options, the following line may be added to [.filename]#/etc/rc.conf# to specify the needed flags:
ko: 기본 옵션이 아닌 옵션으로 아파치를 시작해야 하는 경우, [.filename]#/etc/rc.conf#에 다음 줄을 추가하여 필요한 플래그를 지정할 수 있습니다:
ru: Если Apache должен запускаться с нестандартными параметрами, следующую строку можно добавить в [.filename]#/etc/rc.conf# для указания необходимых флагов:

source: If apachectl does not report configuration errors, start `httpd` now:
ko: 만약 apachectl이 설정 오류를 보고하지 않으면, 바로 `httpd`를 시작하세요:
ru: Если apachectl не сообщает об ошибках конфигурации, то запустите `httpd`:

source: The `httpd` service can be tested by entering `http://_localhost_` in a web browser, replacing _localhost_ with the fully-qualified domain name of the machine running `httpd`. The default web page that is displayed is [.filename]#/usr/local/www/apache24/data/index.html#.
ko: 웹 브라우저에 `http://_localhost_`을 입력하고 _localhost_를 `httpd`를 실행하는 컴퓨터의 정규화된 도메인 이름으로 바꾸면 `httpd` 서비스를 테스트할 수 있습니다. 표시되는 기본 웹 페이지는 [.filename]#/usr/local/www/apache24/data/index.html#입니다.
ru: Службу `httpd` можно проверить, введя `http://_localhost_` в веб-браузере, заменив _localhost_ на полное доменное имя машины, на которой работает `httpd`. Отображаемая веб-страница по умолчанию находится в [.filename]#/usr/local/www/apache24/data/index.html#.

source: The Apache configuration can be tested for errors after making subsequent configuration changes while `httpd` is running using the following command:
ko: 다음 명령을 사용하여 `httpd`가 실행되는 동안 후속 구성을 변경한 후 아파치 구성을 테스트하여 오류를 확인할 수 있습니다:
ru: Проверить конфигурацию Apache на наличие ошибок после внесения последующих изменений в конфигурацию во время работы `httpd` можно с помощью следующей команды:

source: It is important to note that `configtest` is not an man:rc[8] standard, and should not be expected to work for all startup scripts.
ko: `configtest`는 man:rc[8] 표준이 아니며 모든 시작 스크립트에서 정상작동할 것으로 기대해서는 안 된다는 점에 유의해야 합니다.
ru: Важно отметить, что `configtest` не является стандартом man:rc[8], и не следует ожидать, что он будет работать для всех стартовых скриптов.

source: Virtual Hosting
ko: 가상 호스팅 (Virtual Hosting)
ru: Виртуальный хостинг

source: Virtual hosting allows multiple websites to run on one Apache server. The virtual hosts can be _IP-based_ or _name-based_. IP-based virtual hosting uses a different IP address for each website. Name-based virtual hosting uses the clients HTTP/1.1 headers to figure out the hostname, which allows the websites to share the same IP address.
ko: 가상 호스팅을 사용하면 하나의 아파치 서버에서 여러 웹사이트를 실행할 수 있습니다. 가상 호스트는 _IP 기반_ 또는 _이름 기반_이 될 수 있습니다. IP 기반 가상호스팅은 각 웹사이트마다 다른 IP 주소를 사용합니다. 이름 기반 가상호스팅은 클라이언트 HTTP/1.1 헤더를 사용하여 호스트 이름을 파악하므로 웹사이트가 동일한 IP 주소를 공유할 수 있습니다.
ru: Виртуальный хостинг позволяет запускать несколько веб-сайтов на одном сервере Apache. Виртуальные хосты могут быть _IP-ориентированными_ или _имя-ориентированными_. IP-ориентированный виртуальный хостинг использует разные IP-адреса для каждого сайта. Имя-ориентированный виртуальный хостинг использует заголовки HTTP/1.1 клиента для определения имени хоста, что позволяет сайтам использовать один и тот же IP-адрес.

source: To setup Apache to use name-based virtual hosting, add a `VirtualHost` block for each website. For example, for the webserver named `www.domain.tld` with a virtual domain of `www.someotherdomain.tld`, add the following entries to [.filename]#httpd.conf#:
ko: 이름 기반 가상 호스팅을 사용하도록 Apache를 설정하려면 각 웹사이트에 대해 `VirtualHost` 블록을 추가합니다. 예를 들어, `www.someotherdomain.tld`의 가상 호스팅인 `www.domain.tld`이라는 웹서버의 경우 [.filename]#httpd.conf#에 다음 항목을 추가합니다:
ru: Для настройки Apache с использованием виртуального хоста на основе имен добавьте блок `VirtualHost` для каждого веб-сайта. Например, для веб-сервера с именем `www.domain.tld` и виртуальным доменом `www.someotherdomain.tld` добавьте следующие записи в [.filename]#httpd.conf#:

source: For each virtual host, replace the values for `ServerName` and `DocumentRoot` with the values to be used.
ko: 각 가상 호스트에 대해 `ServerName` 및 `DocumentRoot`의 값을 사용할 값으로 바꿉니다.
ru: Для каждого виртуального хоста замените значения `ServerName` и `DocumentRoot` на те, которые должны использоваться.

source: For more information about setting up virtual hosts, consult the official Apache documentation at: http://httpd.apache.org/docs/vhosts/[http://httpd.apache.org/docs/vhosts/].
ko: 가상 호스트 설정에 대한 자세한 내용은 공식 Apache 문서(http://httpd.apache.org/docs/vhosts/[http://httpd.apache.org/docs/vhosts/])를 참조하세요.
ru: Для получения дополнительной информации о настройке виртуальных хостов обратитесь к официальной документации Apache по адресу: http://httpd.apache.org/docs/vhosts/[http://httpd.apache.org/docs/vhosts/].

source: Apache Modules
ko: 아파치 모듈
ru: Модули Apache

source: Apache uses modules to augment the functionality provided by the basic server. Refer to http://httpd.apache.org/docs/current/mod/[http://httpd.apache.org/docs/current/mod/] for a complete listing of and the configuration details for the available modules.
ko: 아파치는 모듈을 사용하여 기본 서버에서 제공하는 기능을 보강합니다. 사용 가능한 모듈의 전체 목록과 구성 세부 정보는 http://httpd.apache.org/docs/current/mod/[http://httpd.apache.org/docs/current/mod/]를 참조하세요.
ru: Apache использует модули для расширения функциональности, предоставляемой базовым сервером. Обратитесь к http://httpd.apache.org/docs/current/mod/[http://httpd.apache.org/docs/current/mod/] для получения полного списка и деталей настройки доступных модулей.

source: In FreeBSD, some modules can be compiled with the package:www/apache24[] port. Type `make config` within [.filename]#/usr/ports/www/apache24# to see which modules are available and which are enabled by default. If the module is not compiled with the port, the FreeBSD Ports Collection provides an easy way to install many modules. This section describes three of the most commonly used modules.
ko: FreeBSD에서 일부 모듈은 package:www/apache24[] 포트로 컴파일할 수 있습니다. [.filename]#/usr/ports/www/apache24#에서 `make config`를 입력하면 어떤 모듈을 사용할 수 있고 어떤 모듈이 기본적으로 활성화되어 있는지 확인할 수 있습니다. 모듈이 포트와 함께 컴파일되지 않은 경우, FreeBSD 포트 컬렉션은 많은 모듈을 쉽게 설치할 수 있는 방법을 제공합니다. 이 섹션에서는 가장 일반적으로 사용되는 세 가지 모듈에 대해 설명합니다.
ru: В FreeBSD некоторые модули могут быть скомпилированы с портом package:www/apache24[]. Введите `make config` в [.filename]#/usr/ports/www/apache24#, чтобы увидеть, какие модули доступны и какие включены по умолчанию. Если модуль не скомпилирован с портом, коллекция портов FreeBSD предоставляет простой способ установки многих модулей. В этом разделе описаны три наиболее часто используемых модуля.

source: SSL support
ko: SSL 지원
ru: Поддержка SSL

source: At one point, support for SSL inside of Apache required a secondary module called [.filename]#mod_ssl#. This is no longer the case and the default install of Apache comes with SSL built into the web server. An example of how to enable support for SSL websites is available in the installed file, [.filename]#httpd-ssl.conf# inside of the [.filename]#/usr/local/etc/apache24/extra# directory Inside this directory is also a sample file called named [.filename]#ssl.conf-sample#. It is recommended that both files be evaluated to properly set up secure websites in the Apache web server.
ru: В прошлом поддержка SSL в Apache требовала дополнительного модуля под названием [.filename]#mod_ssl#. Сейчас это не так, и стандартная установка Apache включает SSL в веб-сервер. Пример настройки поддержки SSL-сайтов доступен в установленном файле [.filename]#httpd-ssl.conf# внутри директории [.filename]#/usr/local/etc/apache24/extra#. В этой же директории также находится пример файла с именем [.filename]#ssl.conf-sample#. Рекомендуется изучить оба файла для правильной настройки защищённых сайтов в веб-сервере Apache.

source: After the configuration of SSL is complete, the following line must be uncommented in the main [.filename]#http.conf# to activate the changes on the next restart or reload of Apache:
ko: SSL 구성이 완료된 후 Apache를 재시작하거나 다시 로드할 때 변경 사항을 활성화하려면 기본 [.filename]#http.conf#에 다음 줄을 주석 처리하지 않아야 합니다:
ru: После настройки SSL необходимо раскомментировать следующую строку в основном файле [.filename]#http.conf#, чтобы активировать изменения при следующей перезагрузке или обновлении Apache:

source: SSL version two and version three have known vulnerability issues. It is highly recommended TLS version 1.2 and 1.3 be enabled in place of the older SSL options. This can be accomplished by setting the following options in the [.filename]#ssl.conf#:
ko: SSL 버전 2와 버전 3에는 알려진 취약성 문제가 있습니다. 이전 SSL 옵션 대신 TLS 버전 1.2 및 1.3을 사용할 것을 적극 권장합니다. 이는 [.filename]#ssl.conf#에서 다음 옵션을 설정하여 수행할 수 있습니다:
ru: Версии SSL два и три имеют известные уязвимости. Настоятельно рекомендуется использовать версии TLS 1.2 и 1.3 вместо старых вариантов SSL. Это можно сделать, установив следующие параметры в [.filename]#ssl.conf#:

source: To complete the configuration of SSL in the web server, uncomment the following line to ensure that the configuration will be pulled into Apache during restart or reload:
ko: 웹 서버에서 SSL 구성을 완료하려면 다음 줄의 주석 처리를 해제하여 재시작 또는 재로딩 중에 구성이 Apache로 가져올 수 있도록 합니다:
ru: Для завершения настройки SSL в веб-сервере раскомментируйте следующую строку, чтобы убедиться, что конфигурация будет загружена в Apache при перезапуске или обновлении:

source: The following lines must also be uncommented in the [.filename]#httpd.conf# to fully support SSL in Apache:
ko: Apache에서 SSL을 완전히 지원하려면 [.filename]#httpd.conf#에서 다음 줄도 주석 처리하지 않아야 합니다:
ru: Следующие строки также должны быть раскомментированы в файле [.filename]#httpd.conf# для полной поддержки SSL в Apache:

source: The next step is to work with a certificate authority to have the appropriate certificates installed on the system. This will set up a chain of trust for the site and prevent any warnings of self-signed certificates.
ko: 다음 단계는 인증 기관과 협력하여 시스템에 적절한 인증서를 설치하는 것입니다. 이렇게 하면 사이트에 대한 신뢰 체인이 설정되고 자체 서명 인증서에 대한 경고를 방지할 수 있습니다.
ru: Следующий шаг — работа с центром сертификации для установки соответствующих сертификатов в системе. Это создаст цепочку доверия для сайта и предотвратит появление предупреждений о самоподписанных сертификатах.

source: The [.filename]#mod_perl# module makes it possible to write Apache modules in Perl. In addition, the persistent interpreter embedded in the server avoids the overhead of starting an external interpreter and the penalty of Perl start-up time.
ko: [.filename]#mod_perl#모듈을 사용하면 Perl로 Apache 모듈을 작성할 수 있습니다. 또한 서버에 내장된 영구 인터프리터를 사용하면 외부 인터프리터를 시작해야 하는 오버헤드와 Perl 시작 시간에 따른 불이익을 피할 수 있습니다.
ru: Модуль [.filename]#mod_perl# позволяет писать модули Apache на Perl. Кроме того, встроенный в сервер постоянный интерпретатор избегает накладных расходов на запуск внешнего интерпретатора и задержек при старте Perl.

source: The [.filename]#mod_perl# can be installed using the package:www/mod_perl2[] package or port. Documentation for using this module can be found at http://perl.apache.org/docs/2.0/index.html[http://perl.apache.org/docs/2.0/index.html].
ko: [.filename]#mod_perl#은 package:www/mod_perl2[] 패키지 또는 포트를 사용하여 설치할 수 있습니다. 이 모듈 사용에 대한 설명서는 http://perl.apache.org/docs/2.0/index.html[http://perl.apache.org/docs/2.0/index.html]에서 확인할 수 있습니다.
ru: [.filename]#mod_perl# можно установить с помощью пакета package:www/mod_perl2[] или порта. Документация по использованию этого модуля доступна по адресу http://perl.apache.org/docs/2.0/index.html[http://perl.apache.org/docs/2.0/index.html].

source: _PHP: Hypertext Preprocessor_ (PHP) is a general-purpose scripting language that is especially suited for web development. Capable of being embedded into HTML, its syntax draws upon C, Java(TM), and Perl with the intention of allowing web developers to write dynamically generated webpages quickly.
ko: _PHP: 하이퍼텍스트 전처리기 (Hypertext Preprocessor, PHP)_는 웹 개발에 특히 적합한 범용 스크립트 언어입니다. HTML에 포함될 수 있는 이 구문은 웹 개발자가 동적으로 생성된 웹페이지를 빠르게 작성할 수 있도록 C, Java(TM), Perl을 기반으로 작성되었습니다.
ru: _PHP: Препроцессор Гипертекста_ (PHP) — это язык программирования общего назначения, который особенно хорошо подходит для веб-разработки. Способный встраиваться в HTML, его синтаксис основан на C, Java(TM) и Perl, что позволяет веб-разработчикам быстро создавать динамически генерируемые веб-страницы.

source: Support for PHP for Apache and any other feature written in the language, can be added by installing the appropriate port.
ko: Apache용 PHP 및 해당 언어로 작성된 기타 기능에 대한 지원은 해당 포트를 설치하여 추가할 수 있습니다.
ru: Поддержка PHP для Apache и любых других функций, написанных на этом языке, может быть добавлена путем установки соответствующего порта.

source: For all supported versions, search the package database using `pkg`:
ko: 지원되는 모든 버전은 `pkg`를 사용하여 패키지 데이터베이스를 검색하세요:
ru: Для всех поддерживаемых версий выполните поиск в базе данных пакетов с помощью `pkg`:

source: A list will be displayed including the versions and additional features they provide. The components are completely modular, meaning features are enabled by installing the appropriate port. To install PHP version 7.4 for Apache, issue the following command:
ko: 제공되는 버전과 추가 기능이 포함된 목록이 표시됩니다. 구성 요소는 완전히 모듈화되어 있으므로 적절한 포트를 설치하면 기능을 사용할 수 있습니다. Apache용 PHP 버전 7.4를 설치하려면 다음 명령을 실행합니다:
ru: Будет отображен список, включающий версии и дополнительные возможности, которые они предоставляют. Компоненты полностью модульные, что означает, что функции включаются путем установки соответствующего порта. Чтобы установить PHP версии 7.4 для Apache, выполните следующую команду:

source: If any dependency packages need to be installed, they will be installed as well.
ko: 종속성 패키지를 설치해야 하는 경우 해당 패키지도 함께 설치됩니다.
ru: Если необходимо установить какие-либо зависимости, они также будут установлены.

source: By default, PHP will not be enabled. The following lines will need to be added to the Apache configuration file located in [.filename]#/usr/local/etc/apache24# to make it active:
ko: 기본적으로 PHP는 활성화되지 않습니다. 활성화하려면 [.filename]#/usr/local/etc/apache24#에 있는 Apache 구성 파일에 다음 줄을 추가해야 합니다:
ru: По умолчанию PHP не будет включен. Следующие строки необходимо добавить в конфигурационный файл Apache, расположенный в [.filename]#/usr/local/etc/apache24#, чтобы активировать его:

source: In addition, the `DirectoryIndex` in the configuration file will also need to be updated and Apache will either need to be restarted or reloaded for the changes to take effect.
ko: 또한 설정파일의 `DirectoryIndex`도 업데이트해야 하며, 변경 사항을 적용하려면 아파치를 재시작하거나 다시 로드해야 합니다.
ru: В дополнение, параметр `DirectoryIndex` в конфигурационном файле также потребуется обновить, и Apache нужно будет перезапустить или перезагрузить, чтобы изменения вступили в силу.

source: Support for many of the PHP features may also be installed by using `pkg`. For example, to install support for XML or SSL, install their respective ports:
ko: 많은 PHP 기능에 대한 지원은 `pkg`를 사용하여 설치할 수도 있습니다. 예를 들어 XML 또는 SSL에 대한 지원을 설치하려면 해당 포트를 설치하세요:
ru: Поддержка многих функций PHP также может быть установлена с помощью `pkg`. Например, для установки поддержки XML или SSL установите соответствующие порты:

source: As before, the Apache configuration will need to be reloaded for the changes to take effect, even in cases where it was just a module install.
ko: 이전과 마찬가지로 변경 사항을 적용하려면 모듈만 설치한 경우에도 Apache 구성을 다시 로드해야 합니다.
ru: Как и ранее, для вступления изменений в силу необходимо перезагрузить конфигурацию Apache, даже в случаях, когда была просто установка модуля.

source: To perform a graceful restart to reload the configuration, issue the following command:
ko: 구성을 다시 로드하기 위해 정상 재시작을 수행하려면 다음 명령을 실행합니다:
ru: Для выполнения плавного перезапуска с целью перезагрузки конфигурации выполните следующую команду:

source: Once the install is complete, there are two methods of obtaining the installed PHP support modules and the environmental information of the build. The first is to install the full PHP binary and running the command to gain the information:
ko: 설치가 완료되면 설치된 PHP 지원 모듈과 빌드의 환경 정보를 얻는 방법에는 두 가지가 있습니다. 첫 번째는 전체 PHP 바이너리를 설치한 후 명령을 실행하여 정보를 얻는 것입니다:
ru: После завершения установки есть два способа получить установленные модули поддержки PHP и информацию о среде сборки. Первый — установить полный бинарный файл PHP и выполнить команду для получения информации:
