Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: This chapter covers some of the more frequently used network services on UNIX systems
ko: 이 장에서는 UNIX 시스템의 네트워크 서비스중 자주 사용되는 몇 가지를 다룹니다
ru: Эта глава рассказывает о некоторых из наиболее часто используемых сетевых служб в системах UNIX

source: IV. Network Communication
ko: IV. 네트워크 통신
ru: IV. Сетевое взаимодействие

source: Chapter 32. Network Servers
ru: Глава 32. Сетевые серверы

source: Network Servers
ko: 네트워크 서버
ru: Сетевые серверы

source: Synopsis
ko: 요약
ru: Обзор

source: This chapter covers some of the more frequently used network services on UNIX(R) systems. This includes installing, configuring, testing, and maintaining many different types of network services. Example configuration files are included throughout this chapter for reference.
ko: 이 장에서는 UNIX(R) 시스템의 네트워크 서비스중 자주 사용되는 몇 가지를 다룹니다. 여기에는 다양한 유형의 네트워크 서비스 설치, 구성, 테스트 및 유지 관리가 포함됩니다. 이 장에는 참조를 위해 구성 파일 예제가 포함되어 있습니다.
ru: В этой главе рассматриваются некоторые из наиболее часто используемых сетевых служб в системах UNIX(R). Сюда входит установка, настройка, тестирование и поддержка различных типов сетевых служб. В этой главе приведены примеры конфигурационных файлов для справки.

source: By the end of this chapter, readers will know:
ko: 이 장이 끝나면 여러분은 다음을 배우게 됩니다:
ru: К концу этой главы читатели будут знать:

source: How to manage the inetd daemon.
ko: inetd 데몬을 관리하는 법.
ru: Как управлять демоном inetd.

source: How to set up the Network File System (NFS).
ko: 네트워크 파일 시스템(NFS)를 설정하는 법.
ru: Как настроить Network File System (NFS).

source: How to set up the Network Information Server (NIS) for centralizing and sharing user accounts.
ko: 사용자 계정을 중앙 집중화하고 공유하기 위해 네트워크 정보 서버(Network Information Server, NIS)를 설정하는 법.
ru: Как настроить сервер сетевой информации (NIS) для централизации и совместного использования учетных записей пользователей.

source: How to set FreeBSD up to act as an LDAP server or client
ko: FreeBSD를 LDAP 서버 또는 클라이언트로 작동하도록 설정하는 방법
ru: Как настроить FreeBSD в качестве сервера или клиента LDAP

source: How to set up automatic network settings using DHCP.
ko: DHCP를 사용하여 자동 네트워크 설정을 하는 방법.
ru: Как настроить автоматические параметры сети с использованием DHCP.

source: How to set up a Domain Name Server (DNS).
ko: 도메인 네임 서버(DNS)를 설정하는 법.
ru: Как настроить сервер доменных имен (DNS).

source: How to set up the Apache HTTP Server.
ko: 아파치 HTTP 서버를 설청하는 법.
ru: Как настроить веб-сервер Apache HTTP.

source: How to set up a File Transfer Protocol (FTP) server.
ko: FTP 서버를 설정하는 법.
ru: Как настроить сервер протокола передачи файлов (FTP).

source: How to set up a file and print server for Windows(R) clients using Samba.
ko: Samba를 이용해 Windows(R)용 파일 서버와 프린트 서버를 설정하는 법.
ru: Как настроить файловый и печатный сервер для клиентов Windows(R) с использованием Samba.

source: How to synchronize the time and date, and set up a time server using the Network Time Protocol (NTP).
ko: Network Time Protocol (NTP)를 이용해 시간과 날짜를 동기화하고, 타임 서버를 설정하는 법.
ru: Как синхронизировать время и дату, а также настроить сервер времени с использованием протокола Network Time Protocol (NTP).

source: How to set up iSCSI.
ko: iSCSI를 설정하는 법.
ru: Как настроить iSCSI.

source: This chapter assumes a basic knowledge of:
ko: 이 장은 다음의 내용을 알고 있어야 합니다:
ru: Эта глава предполагает базовые знания о:

source: [.filename]#/etc/rc# scripts.
ko: [.filename]#/etc/rc# 스크립트.
ru: Скриптах [.filename]#/etc/rc#.

source: Network terminology.
ko: 네트워크 용어.
ru: Сетевой терминологии.

source: Installation of additional third-party software (crossref:ports[ports,Installing Applications: Packages and Ports]).
ko: 추가적인 타사 소프트웨어를 crossref:ports[ports,Installing Applications: Packages and Ports]에서 설치하는 법.
ru: Установке дополнительного стороннего программного обеспечения (crossref:ports[ports,Установка приложений: Пакеты и Порты]).

source: The inetd Super-Server
ko: inetd Super-Server
ru: Суперсервер inetd

source: The man:inetd[8] daemon is sometimes referred to as a Super-Server because it manages connections for many services. Instead of starting multiple applications, only the inetd service needs to be started. When a connection is received for a service that is managed by inetd, it determines which program the connection is destined for, spawns a process for that program, and delegates the program a socket. Using inetd for services that are not heavily used can reduce system load, when compared to running each daemon individually in stand-alone mode.
ko: man:inetd[8] 데몬은 많은 서비스에 대한 연결을 관리하기 때문에 슈퍼 서버(Super-Server)라고도 불립니다. 일반적으로 여러 애플리케이션을 시작하는 대신 inetd 서비스만 시작하면 됩니다. inetd으로 관리되는 서비스에 대해 연결이 요청되면, inetd는 대상 프로그램을 결정하고 해당 프로그램에 대한 프로세스를 생성한 다음 해당 프로그램에 소켓을 위임합니다. 사용 부하가 높지 않은 서비스에 inetd를 사용하면 각 데몬을 독립 실행형 모드에서 개별적으로 실행할 때보다 시스템 부하를 줄일 수 있습니다.
ru: Демон man:inetd[8] иногда называют суперсервером, потому что он управляет соединениями для многих служб. Вместо запуска множества приложений, достаточно запустить только службу inetd. Когда поступает соединение для службы, управляемой inetd, он определяет, какому программе предназначено соединение, создает процесс для этой программы и делегирует программе сокет. Использование inetd для служб, которые не используются интенсивно, может снизить нагрузку на систему по сравнению с запуском каждого демона отдельно в автономном режиме.

source: Primarily, inetd is used to spawn other daemons, but several trivial protocols are handled internally, such as chargen, auth, time, echo, discard, and daytime.
ko: inetd는 일반적인 프로세스에 대해 보통 다른 데몬을 생성하지만 chargen, auth, time, echo, discard, daytime과 같이 사소한 프로토콜은 내부적으로 직접 처리합니다.
ru: Прежде всего, inetd используется для запуска других демонов, но несколько простых протоколов обрабатываются внутри него, таких как chargen, auth, time, echo, discard и daytime.

source: This section covers the basics of configuring inetd.
ko: 이 섹션에서는 inetd 구성의 기본 사항을 다룹니다.
ru: Этот раздел охватывает основы настройки inetd.

source: Configuration File
ko: 구성 파일
ru: Файл конфигурации

source: Configuration of inetd is done by editing [.filename]#/etc/inetd.conf#. Each line of this configuration file represents an application which can be started by inetd. By default, every line starts with a comment (`+#+`), meaning that inetd is not listening for any applications. To configure inetd to listen for an application's connections, remove the `+#+` at the beginning of the line for that application.
ko: inetd의 구성은 [.filename]#/etc/inetd.conf#를 편집하여 할 수 있습니다. 이 구성 파일의 각 줄은 inetd로 시작할 수 있는 애플리케이션을 나타냅니다. 기본적으로 모든 줄은 주석(`+#+`)으로 시작하는데, 이는 inetd가 어떤 애플리케이션도 수신 대기하고 있지 않음을 의미합니다. 애플리케이션의 연결을 수신 대기하도록 inetd를 구성하려면 해당 애플리케이션의 첫 줄에 있는 `+#+`를 제거하세요.
ru: Настройка inetd выполняется путем редактирования [.filename]#/etc/inetd.conf#. Каждая строка этого файла конфигурации представляет приложение, которое может быть запущено inetd. По умолчанию каждая строка начинается с комментария (`+#+`), что означает, что inetd не ожидает подключений для каких-либо приложений. Чтобы настроить inetd на ожидание подключений для приложения, удалите `+#+` в начале соответствующей строки.

source: After saving your edits, configure inetd to start at system boot by editing [.filename]#/etc/rc.conf#:
ko: 이 파일을 편집하고 저장한 후, 시스템 부팅시 inetd가 시작되도록 [.filename]#/etc/rc.conf#을 설정합니다:
ru: После сохранения изменений настройте inetd для запуска при загрузке системы, отредактировав [.filename]#/etc/rc.conf#:

source: To start inetd now, so that it listens for the service you configured, type:
ko: 구성한 서비스를 수신 대기하도록 지금 inetd를 시작하려면 다음과 같이 입력합니다:
ru: Чтобы запустить inetd сейчас, чтобы он начал прослушивать настроенную службу, введите:

source: Once inetd is started, it needs to be notified whenever a modification is made to [.filename]#/etc/inetd.conf#:
ko: 일단 inetd가 시작되면 [.filename]#/etc/inetd.conf#를 수정할 때마다 알림을 받게 됩니다:
ru: После запуска inetd необходимо уведомлять его о каждом изменении в файле [.filename]#/etc/inetd.conf#:

source: Reloading the inetd Configuration File
ko: inetd 구성 파일을 리로딩 하기
ru: Перезагрузка конфигурационного файла inetd

source: Typically, the default entry for an application does not need to be edited beyond removing the `+#+`. In some situations, it may be appropriate to edit the default entry.
ko: 일반적으로 애플리케이션의 기본 항목은 `+#+`을 제거하는 것 외에는 편집할 필요가 없습니다. 하지만 어떤 경우에는 기본 항목을 편집하는 것이 적절할 수 있습니다.
ru: Обычно запись по умолчанию для приложения не требует редактирования, кроме удаления `+#+`. В некоторых ситуациях может быть целесообразно изменить запись по умолчанию.

source: As an example, this is the default entry for man:ftpd[8] over IPv4:
ko: 예를 들어, 다음은 IPv4를 사용하는 man:ftpd[8]의 기본 항목입니다:
ru: В качестве примера, это стандартная запись для man:ftpd[8] по IPv4:

source: The seven columns in an entry are as follows:
ko: 항목의 7개 열은 다음과 같습니다:
ru: Семь столбцов в записи следующие:

source: where:
ru: где:

source: The service name of the daemon to start. It must correspond to a service listed in [.filename]#/etc/services#. This determines which port inetd listens on for incoming connections to that service. When using a custom service, it must first be added to [.filename]#/etc/services#.
ko: 시작할 데몬의 서비스 이름입니다. 이 이름은 [.filename]#/etc/services#에 나열된 서비스와 일치해야 합니다. 이 값에 따라 해당 서비스로 들어오는 연결을 수신 대기할 포트가 결정됩니다. 사용자 지정 서비스를 사용하는 경우 먼저 [.filename]#/etc/services#에 추가해야 합니다.
ru: Имя службы демона для запуска. Оно должно соответствовать службе, указанной в [.filename]#/etc/services#. Это определяет, на каком порту inetd ожидает входящие соединения для этой службы. При использовании пользовательской службы она сначала должна быть добавлена в [.filename]#/etc/services#.

source: Either `stream`, `dgram`, `raw`, or `seqpacket`. Use `stream` for TCP connections and `dgram` for UDP services.
ko: `stream`, `dgram`, `raw`, 이나 `seqpacket`중 하나입니다. UDP 서비스를 할 때에는 `dgram`을, TCP 연결에 대해서는 `stream`을 사용합니다.
ru: Либо `stream`, `dgram`, `raw`, или `seqpacket`. Используйте `stream` для TCP-соединений и `dgram` для UDP-сервисов.

source: Use one of the following protocol names:
ko: 다음 프로토콜 이름중 하나를 사용하세요:
ru: Используйте одно из следующих названий протоколов:

source: Protocol Name
ko: 프로토콜 이름
ru: Имя протокола

source: Explanation
ko: 설명
ru: Объяснение

source: tcp or tcp4
ko: tcp 또는 tcp4
ru: tcp или tcp4

source: udp or udp4
ko: udp 또는 udp4
ru: udp или udp4

source: Both TCP IPv4 and IPv6
ko: TCP IPv4와 IPv6 모두
ru: Как TCP IPv4, так и IPv6

source: Both UDP IPv4 and IPv6
ko: UDP IPv4와 IPv6 모두
ru: Как UDP IPv4, так и IPv6

source: `wait|nowait` indicates whether or not the service is able to handle its own socket. `dgram` socket types must use `wait` while `stream` daemons, which are usually multi-threaded, should use `nowait`. `wait` usually hands off multiple sockets to a single daemon, while `nowait` spawns a child daemon for each new socket.
ko: `wait|nowait` 는 서비스가 자체 소켓을 처리할 수 있는지 여부를 나타냅니다. `dgram` 소켓 유형은 `wait`을 사용해야 하며, 일반적으로 멀티스레드인 `stream` 데몬은 `nowait`을 사용해야 합니다. `wait`는 일반적으로 여러 소켓을 단일 데몬에 넘겨주는 반면, `nowait`은 새 소켓마다 자식 데몬을 생성합니다.
ru: `wait|nowait` указывает, способна ли служба обрабатывать свой собственный сокет. Типы сокетов `dgram` должны использовать `wait`, в то время как для демонов `stream`, которые обычно многопоточные, следует использовать `nowait`. `wait` обычно передаёт несколько сокетов одному демону, тогда как `nowait` создаёт дочерний демон для каждого нового сокета.

source: The maximum number of child daemons inetd may spawn is set by `max-child`. For example, to limit ten instances of the daemon, place a `/10` after `nowait`. Specifying `/0` allows an unlimited number of children.
ko: inetd가 생성할 수 있는 자식 데몬의 최대 개수는 `max-child`로 설정합니다. 예를 들어, 데몬의 인스턴스를 10개로 제한하려면 `nowait` 뒤에 `/10`을 넣습니다. `/0`을 지정하면 자식 수를 무제한으로 허용합니다.
ru: Максимальное количество дочерних демонов, которые может породить inetd, задается параметром `max-child`. Например, чтобы ограничить десять экземпляров демона, укажите `/10` после `nowait`. Указание `/0` позволяет создавать неограниченное количество дочерних процессов.

source: `max-connections-per-ip-per-minute` limits the number of connections from any particular IP address per minute. Once the limit is reached, further connections from this IP address will be dropped until the end of the minute. For example, a value of `/10` would limit any particular IP address to ten connection attempts per minute. `max-child-per-ip` limits the number of child processes that can be started on behalf on any single IP address at any moment. These options can limit excessive resource consumption and help to prevent Denial of Service attacks.
ko: `max-connections-per-ip-per-minute`는 특정 IP 주소로부터의 분당 연결 수를 제한합니다. 이 제한에 도달하면 해당 IP 주소로부터의 추가 연결은 해당 시간(분)이 끝날 때까지 끊어집니다. 예를 들어 `/10` 값은 특정 IP 주소의 연결 시도를 분당 10회로 제한합니다. `max-child-per-ip`는 언제든 단일 IP 주소에서 시작할 수 있는 최대 자식 프로세스의 수를 제한합니다. 이러한 옵션은 과도한 리소스 소비를 제한하고 서비스 거부 공격을 방지하는 데 도움이 될 수 있습니다.
ru: `max-connections-per-ip-per-minute` ограничивает количество соединений с любого конкретного IP-адреса в минуту. Как только лимит достигнут, последующие соединения с этого IP-адреса будут отбрасываться до конца минуты. Например, значение `/10` ограничивает любой конкретный IP-адрес десятью попытками соединения в минуту. `max-child-per-ip` ограничивает количество дочерних процессов, которые могут быть запущены от имени любого отдельного IP-адреса в любой момент времени. Эти опции позволяют ограничить чрезмерное потребление ресурсов и помогают предотвратить атаки типа "Отказ в обслуживании".

source: An example can be seen in the default settings for man:fingerd[8]:
ko: man:fingerd[8]의 기본 설정에서 예시를 확인할 수 있습니다:
ru: Пример можно увидеть в настройках по умолчанию для man:fingerd[8]:

source: The username the daemon will run as. Daemons typically run as `root`, `daemon`, or `nobody`.
ko: 데몬이 실행할 사용자 이름입니다. 데몬은 일반적으로 `root`, `daemon`, 또는 `nobody`로 실행됩니다.
ru: Имя пользователя, от имени которого будет работать демон. Демоны обычно работают от имени `root`, `daemon` или `nobody`.

source: The full path to the daemon. If the daemon is a service provided by inetd internally, use `internal`.
ko: 데몬의 전체 경로입니다. 데몬이 내부적으로 inetd에서 제공하는 서비스인 경우 `internal`을 사용합니다.
ru: Полный путь к демону. Если демон является службой, предоставляемой inetd внутренне, используйте `internal`.

source: Used to specify any command arguments to be passed to the daemon on invocation. If the daemon is an internal service, use `internal`.
ko: 호출 시 데몬에 전달할 명령 인수를 지정하는 데 사용됩니다. 데몬이 내부 서비스인 경우 `internal`을 사용합니다.
ru: Используется для указания любых аргументов командной строки, передаваемых демону при его запуске. Если демон является внутренней службой, используйте `internal`.

source: Command-Line Options
ko: 명령줄 옵션
ru: Параметры командной строки

source: Like most server daemons, inetd has a number of options that can be used to modify its behavior. By default, inetd is started with `-wW -C 60`. These options enable TCP wrappers for all services, including internal services, and prevent any IP address from requesting any service more than 60 times per minute.
ko: 대부분의 서버 데몬과 마찬가지로 inetd에는 동작을 조정하는 데 사용할 수 있는 여러 옵션이 있습니다. 기본적으로 inetd는 `-wW -C 60`으로 시작됩니다. 이 옵션은 내부 서비스를 포함한 모든 서비스에 대해 TCP 래퍼를 활성화하고 어떤 IP 주소도 분당 60회 이상 서비스를 요청하지 못하도록 합니다.
ru: Как и большинство серверных демонов, inetd имеет ряд опций, которые можно использовать для изменения его поведения. По умолчанию inetd запускается с параметрами `-wW -C 60`. Эти опции включают TCP wrappers для всех сервисов, включая внутренние, и предотвращают запросы любого IP-адреса к любому сервису чаще 60 раз в минуту.

source: To change the default options which are passed to inetd, add an entry for `inetd_flags` in [.filename]#/etc/rc.conf#. If inetd is already running, restart it with `service inetd restart`.
ko: inetd에 전달되는 기본 옵션을 변경하려면 [.filename]#/etc/rc.conf#에 `inetd_flags` 항목을 추가합니다. inetd이 이미 실행 중이면 `service inetd restart`로 다시 시작합니다.
ru: Для изменения параметров по умолчанию, передаваемых inetd, добавьте запись `inetd_flags` в файл [.filename]#/etc/rc.conf#. Если inetd уже запущен, перезапустите его командой `service inetd restart`.

source: The available rate limiting options are:
ko: 사용 가능한 제한 옵션은 다음과 같습니다:
ru: Доступные варианты ограничения скорости:

source: Specify the default maximum number of simultaneous invocations of each service, where the default is unlimited. May be overridden on a per-service basis by using `max-child` in [.filename]#/etc/inetd.conf#.
ko: 각 서비스의 기본 최대 동시 호출 수를 지정하며, 기본값은 무제한입니다. 서비스별로 [.filename]#/etc/inetd.conf#에서 `max-child`를 사용하여 재정의할 수 있습니다.
ru: Укажите максимальное количество одновременных вызовов каждой службы по умолчанию, где по умолчанию значение не ограничено. Может быть переопределено для каждой службы отдельно с помощью параметра `max-child` в [.filename]#/etc/inetd.conf#.

source: Specify the default maximum number of times a service can be invoked from a single IP address per minute. May be overridden on a per-service basis by using `max-connections-per-ip-per-minute` in [.filename]#/etc/inetd.conf#.
ko: 단일 IP 주소에서 분당 서비스를 호출할 수 있는 기본 최대 횟수를 지정합니다. [.filename]#/etc/inetd.conf#에서 `max-connections-per-ip-per-minute`를 사용하여 서비스별로 재정의할 수 있습니다.
ru: Укажите максимальное количество вызовов службы с одного IP-адреса в минуту по умолчанию. Это значение может быть переопределено для отдельной службы с помощью параметра `max-connections-per-ip-per-minute` в файле [.filename]#/etc/inetd.conf#.

source: Specify the maximum number of times a service can be invoked in one minute, where the default is `256`. A rate of `0` allows an unlimited number.
ko: 1분 동안 서비스를 호출할 수 있는 최대 횟수를 지정하며, 기본값은 `256`입니다. `0`으로 설정하면 횟수에 제한이 없습니다.
ru: Укажите максимальное количество вызовов службы в течение одной минуты, где значение по умолчанию — `256`. Значение `0` позволяет неограниченное количество.

source: Specify the maximum number of times a service can be invoked from a single IP address at any one time, where the default is unlimited. May be overridden on a per-service basis by using `max-child-per-ip` in [.filename]#/etc/inetd.conf#.
ko: 단일 IP 주소에서 한 번에 서비스를 호출할 수 있는 최대 횟수를 지정하며, 기본값은 무제한입니다. [.filename]#/etc/inetd.conf#에서 `max-child-per-ip`를 사용하여 서비스별로 재정의할 수 있습니다.
ru: Укажите максимальное количество раз, которое служба может быть вызвана с одного IP-адреса одновременно, по умолчанию значение не ограничено. Может быть переопределено для каждой службы отдельно с помощью параметра `max-child-per-ip` в [.filename]#/etc/inetd.conf#.

source: Additional options are available. Refer to man:inetd[8] for the full list of options.
ko: 이외에도 다양한 추가 옵션을 사용할 수 있습니다. 전체 옵션 목록은 man:inetd[8]을 참조하세요.
ru: Доступны дополнительные параметры. Полный список параметров смотрите в man:inetd[8].

source: Security Considerations
ko: 보안 고려사항
ru: Безопасность

source: Many of the daemons which can be managed by inetd are not security-conscious. Some daemons, such as fingerd, can provide information that may be useful to an attacker. Only enable the services which are needed and monitor the system for excessive connection attempts. `max-connections-per-ip-per-minute`, `max-child` and `max-child-per-ip` can be used to limit such attacks.
ko: inetd로 관리할 수 있는 많은 데몬은 보안을 고려하지 않습니다. fingerd와 같은 일부 데몬은 공격자에게 유용할 수 있는 정보를 제공할 수 있습니다. 필요한 서비스만 활성화하고 과도한 연결 시도가 있는지 시스템을 모니터링하세요. `max-connections-per-ip-per-minute`, `max-child` 와 `max-child-per-ip`를 사용하여 이러한 공격을 제한할 수 있습니다.
ru: Многие демоны, которыми может управлять inetd, не обладают достаточной защитой. Некоторые демоны, такие как fingerd, могут предоставлять информацию, полезную для злоумышленника. Включайте только необходимые службы и отслеживайте систему на предмет чрезмерных попыток подключения. Параметры `max-connections-per-ip-per-minute`, `max-child` и `max-child-per-ip` могут быть использованы для ограничения подобных атак.

source: By default, TCP wrappers are enabled. Consult man:hosts_access[5] for more information on placing TCP restrictions on various inetd invoked daemons.
ko: 기본적으로 TCP 래퍼는 활성화되어 있습니다. 다양한 inetd 호출 데몬에 TCP 제한을 설정하는 방법에 대한 자세한 내용은 man:hosts_access[5]를 참조하세요.
ru: По умолчанию TCP wrappers включены. Дополнительную информацию о наложении TCP-ограничений на различные демоны, запускаемые через inetd, можно найти в man:hosts_access[5].

source: Network File System (NFS)
ko: 네트워크 파일 시스템 (NFS)
ru: Сетевая файловая система (NFS — Network File System)

source: FreeBSD supports the Network File System (NFS), which allows a server to share directories and files with clients over a network. With NFS, users and programs can access files on remote systems as if they were stored locally.
ko: FreeBSD는 서버가 네트워크를 통해 클라이언트와 디렉터리 및 파일을 공유할 수 있는 네트워크 파일 시스템(NFS)을 지원합니다. NFS를 사용하면 사용자와 프로그램은 원격 시스템의 파일에 마치 로컬에 저장된 것처럼 액세스할 수 있습니다.
ru: FreeBSD поддерживает Network File System (NFS), что позволяет серверу делиться каталогами и файлами с клиентами по сети. С помощью NFS пользователи и программы могут обращаться к файлам на удалённых системах так, как если бы они хранились локально.

source: NFS has many practical uses. Some of the more common uses include:
ko: NFS는 실용적인 용도로 많이 사용됩니다. 몇 가지 일반적인 용도는 다음과 같습니다:
ru: NFS имеет множество практических применений. Некоторые из наиболее распространенных вариантов использования включают:

source: Data that would otherwise be duplicated on each client can be kept in a single location and accessed by clients on the network.
ko: 각 클라이언트에서 중복될 수 있는 데이터를 단일 위치에 보관하고 네트워크의 클라이언트가 액세스할 수 있습니다.
ru: Данные, которые в противном случае дублировались бы на каждом клиенте, могут храниться в одном месте и быть доступными для клиентов в сети.

source: Several clients may need access to the [.filename]#/usr/ports/distfiles# directory. Sharing that directory allows for quick access to the source files without having to download them to each client.
ko: 여러 클라이언트가 [.filename]#/usr/ports/distfiles# 디렉터리에 액세스해야 할 수 있습니다. 해당 디렉터리를 공유하면 각 클라이언트에 다운로드할 필요 없이 소스 파일에 빠르게 액세스할 수 있습니다.
ru: Несколько клиентов могут нуждаться в доступе к каталогу [.filename]#/usr/ports/distfiles#. Общий доступ к этому каталогу позволяет быстро получить исходные файлы без необходимости загрузки их на каждый клиент.

source: On large networks, it is often more convenient to configure a central NFS server on which all user home directories are stored. Users can log into a client anywhere on the network and have access to their home directories.
ko: 대규모 네트워크에서는 모든 사용자의 홈 디렉터리가 저장되는 중앙 NFS 서버를 구성하는 것이 더 편리한 경우가 많습니다. 사용자는 네트워크의 어느 곳에서나 클라이언트에 로그인하여 자신의 홈 디렉터리에 액세스할 수 있습니다.
ru: На крупных сетях часто удобнее настроить центральный NFS-сервер, на котором хранятся все домашние каталоги пользователей. Пользователи могут входить в систему с любого клиента в сети и получать доступ к своим домашним каталогам.

source: Administration of NFS exports is simplified. For example, there is only one file system where security or backup policies must be set.
ko: NFS 내보내기 관리가 간소화됩니다. 예를 들어 보안 또는 백업 정책을 설정해야 하는 파일 시스템을 단 하나로 줄일 수 있습니다.
ru: Управление экспортом NFS упрощено. Например, существует только одна файловая система, в которой необходимо настраивать политики безопасности или резервного копирования.

source: Removable media storage devices can be used by other machines on the network. This reduces the number of devices throughout the network and provides a centralized location to manage their security. It is often more convenient to install software on multiple machines from a centralized installation media.
ko: 이동식 미디어 저장 장치는 네트워크의 다른 컴퓨터에서 사용할 수 있습니다. 이렇게 하면 네트워크 전체에서 디바이스 수가 줄어들고 보안을 관리할 수 있는 중앙 집중형 장소를 구성할 수 있습니다. 또한 중앙 집중식 설치 미디어에서 여러 머신에 소프트웨어를 설치하는 것이 더 편리한 경우가 많습니다.
ru: Съемные устройства хранения данных могут использоваться другими компьютерами в сети. Это уменьшает количество устройств в сети и обеспечивает централизованное управление их безопасностью. Часто бывает удобнее устанавливать программное обеспечение на несколько компьютеров с централизованного носителя для установки.
