Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: It is necessary to pass the output to a pager, such as the `more` or `less` to easier digest the amount of output.
ko: 출력량을 쉽게 소화하기 위해 `more` 또는 `less`와 같은 호출기로 출력을 전달해야 합니다.
ru: Необходимо передать вывод в постраничный просмотрщик, например, `more` или `less`, чтобы упростить восприятие большого объема вывода.

source: Finally, to make any changes to the global configuration of PHP there is a well documented file installed into [.filename]#/usr/local/etc/php.ini#. At the time of install, this file will not exist because there are two versions to choose from, one is [.filename]#php.ini-development# and the other is [.filename]#php.ini-production#. These are starting points to assist administrators in their deployment.
ko: 마지막으로, PHP의 전역 구성을 변경하려면 [.filename]#/usr/local/etc/php.ini#에 잘 문서화된 파일이 설치되어 있습니다. 설치 시에는 이 파일이 존재하지 않는데, 그 이유는 [.filename]#php.ini-development#와 [.filename]#php.ini-production# 두 가지 버전 중 하나를 선택할 수 있기 때문입니다. 이는 관리자의 배포를 돕기 위한 시작점입니다.
ru: Наконец, для внесения изменений в глобальную конфигурацию PHP существует хорошо документированный файл, установленный в [.filename]#/usr/local/etc/php.ini#. На момент установки этот файл не будет существовать, так как есть две версии на выбор: [.filename]#php.ini-development# и [.filename]#php.ini-production#. Они представляют собой отправные точки, помогающие администраторам в развертывании.

source: HTTP2 Support
ko: HTTP2 지원
ru: Поддержка HTTP2

source: Apache support for the HTTP2 protocol is included by default when installing the port with `pkg`. The new version of HTTP includes many improvements over the previous version, including utilizing a single connection to a website, reducing overall roundtrips of TCP connections. Also, packet header data is compressed and HTTP2 requires encryption by default.
ko: `pkg`로 포트를 설치하면 HTTP2 프로토콜에 대한 아파치 지원이 기본적으로 포함됩니다. 새 버전의 HTTP에는 웹 사이트에 대한 단일 연결을 활용하여 전체 TCP 연결의 왕복 횟수를 줄이는 등 이전 버전에 비해 많은 개선 사항이 포함되어 있습니다. 또한 패킷 헤더 데이터가 압축되고 HTTP2는 기본적으로 암호화를 요구합니다.
ru: Поддержка протокола HTTP2 в Apache включена по умолчанию при установке порта с помощью `pkg`. Новая версия HTTP содержит множество улучшений по сравнению с предыдущей версией, включая использование одного соединения с веб-сайтом, что сокращает общее количество циклов TCP-соединений. Кроме того, данные заголовков пакетов сжимаются, а HTTP2 по умолчанию требует шифрования.

source: When Apache is configured to only use HTTP2, web browsers will require secure, encrypted HTTPS connections. When Apache is configured to use both versions, HTTP1.1 will be considered a fall back option if any issues arise during the connection.
ko: Apache가 HTTP2만 사용하도록 설정된 경우 웹 브라우저는 안전한 암호화된 HTTPS 연결을 요구합니다. Apache가 두 버전을 모두 사용하도록 구성된 경우 연결 중에 문제가 발생하면 HTTP1.1이 대체 옵션으로 간주됩니다.
ru: Когда Apache настроен на использование только HTTP2, веб-браузеры будут требовать безопасное, зашифрованное HTTPS-соединение. Если Apache настроен на использование обеих версий, HTTP1.1 будет считаться резервным вариантом при возникновении проблем с соединением.

source: While this change does require administrators to make changes, they are positive and equate to a more secure Internet for everyone. The changes are only required for sites not currently implementing SSL and TLS.
ko: 이 변경은 관리자의 권한이 필요하지만, 이는 모두에게 더 안전한 인터넷을 제공하는 긍정적인 변화입니다. 이 변경은 현재 SSL 및 TLS를 구현하지 않는 사이트에만 필요합니다.
ru: Хотя это изменение требует от администраторов внесения изменений, они положительные и способствуют более безопасному Интернету для всех. Изменения требуются только для сайтов, которые в настоящее время не используют SSL и TLS.

source: This configuration depends on the previous sections, including TLS support. It is recommended those instructions be followed before continuing with this configuration.
ko: 이 구성은 TLS 지원을 포함한 이전 섹션에 따라 달라집니다. 이 구성을 계속하기 전에 해당 지침을 따르는 것이 좋습니다.
ru: Эта конфигурация зависит от предыдущих разделов, включая поддержку TLS. Рекомендуется выполнить эти инструкции перед продолжением с данной конфигурацией.

source: Start the process by enabling the http2 module by uncommenting the line in [.filename]#/usr/local/etc/apache24/httpd.conf# and replace the mpm_prefork module with mpm_event as the former does not support HTTP2.
ko: [.filename]#/usr/local/etc/apache24/httpd.conf#에서 해당 줄을 주석 처리해 http2 모듈을 활성화하여 프로세스를 시작하고, mpm_prefork 모듈은 HTTP2를 지원하지 않으므로 mpm_event로 대체합니다.
ru: Начните процесс, включив модуль http2, раскомментировав строку в [.filename]#/usr/local/etc/apache24/httpd.conf#, и замените модуль mpm_prefork на mpm_event, так как первый не поддерживает HTTP2.

source: There is a separate [.filename]#mod_http2# port that is available. It exists to deliver security and bug fixes quicker than the module installed with the bundled [.filename]#apache24# port. It is not required for HTTP2 support but is available. When installed, the [.filename]#mod_h2.so# should be used in place of [.filename]#mod_http2.so# in the Apache configuration.
ko: 사용할 수 있는 별도의 [.filename]#mod_http2# 포트가 있습니다. 이 포트는 번들로 제공되는 [.filename]#apache24# 포트와 함께 설치된 모듈보다 더 빠르게 보안 및 버그 수정을 제공하기 위해 존재합니다. HTTP2 지원에는 필요하지 않지만 사용할 수 있습니다. 이 모듈을 설치하면 Apache 구성에서 [.filename]#mod_h2.so# 대신 [.filename]#mod_http2.so#를 사용해야 합니다.
ru: Существует отдельный порт [.filename]#mod_http2#, который доступен. Он предназначен для более быстрого получения исправлений безопасности и ошибок по сравнению с модулем, установленным через встроенный порт [.filename]#apache24#. Он не обязателен для поддержки HTTP2, но доступен. При установке следует использовать [.filename]#mod_h2.so# вместо [.filename]#mod_http2.so# в конфигурации Apache.

source: There are two methods to implement HTTP2 in Apache; one way is globally for all sites and each VirtualHost running on the system. To enable HTTP2 globally, add the following line under the ServerName directive:
ko: 아파치에서 HTTP2를 구현하는 방법은 두 가지가 있는데, 한 가지 방법은 모든 사이트와 시스템에서 실행되는 각 VirtualHost에 전역적으로 적용하는 것입니다. HTTP2를 전역적으로 사용하려면 ServerName 지시어 아래에 다음 줄을 추가합니다:
ru: Существует два метода реализации HTTP2 в Apache; один способ — глобально для всех сайтов и каждого VirtualHost, работающего в системе. Чтобы включить HTTP2 глобально, добавьте следующую строку под директивой ServerName:

source: To enable HTTP2 over plaintext, use h2h2chttp/1.1 in the [.filename]#httpd.conf#.
ko: HTTP2를 평문으로 사용하려면 [.filename]#httpd.conf#에 h2h2chttp/1.1을 사용하세요.
ru: Для включения HTTP2 в незашифрованном виде используйте h2h2chttp/1.1 в файле [.filename]#httpd.conf#.

source: Having the h2c here will allow plaintext HTTP2 data to pass on the system but is not recommended. In addition, using the http/1.1 here will allow fallback to the HTTP1.1 version of the protocol should it be needed by the system.
ko: 여기에 h2c를 사용하면 평문으로 HTTP2 데이터가 시스템에 전달될 수 있지만 권장되지는 않습니다. 또한 여기에 http/1.1을 사용하면 시스템에서 필요한 경우 HTTP1.1 버전의 프로토콜로 폴백할 수 있습니다.
ru: Наличие здесь h2c позволит передавать незашифрованные данные HTTP2 в системе, но это не рекомендуется. Кроме того, использование здесь http/1.1 позволит системе вернуться к версии протокола HTTP1.1, если это потребуется.

source: To enable HTTP2 for individual VirtualHosts, add the same line within the VirtualHost directive in either [.filename]#httpd.conf# or [.filename]#httpd-ssl.conf#.
ko: 개별 가상 호스트에 대해 HTTP2를 사용 설정하려면 VirtualHost 지시어 내에 [.filename]#httpd.conf# 또는 [.filename]#httpd-ssl.conf#에 동일한 줄을 추가합니다.
ru: Для включения HTTP2 для отдельных VirtualHosts добавьте ту же строку в директиву VirtualHost в файле [.filename]#httpd.conf# или [.filename]#httpd-ssl.conf#.

source: Reload the configuration using the `apachectl`[parameter]#reload# command and test the configuration either by using either of the following methods after visiting one of the hosted pages:
ko: `apachectl`[parameter]#reload# 명령을 사용하여 구성을 다시 로드하고 호스팅된 페이지 중 하나를 방문한 후 다음 방법 중 하나를 사용하여 구성을 테스트합니다:
ru: Перезагрузите конфигурацию с помощью команды `apachectl`[parameter]#reload# и проверьте конфигурацию каким-либо из следующих способов после посещения одной из страниц на сервере:

source: This should return something similar to the following:
ko: 그러면 다음과 비슷한 결과가 반환됩니다:
ru: Это должно вернуть что-то похожее на следующее:

source: The other method is using the web browser's built in site debugger or `tcpdump`; however, using either method is beyond the scope of this document.
ko: 다른 방법은 웹 브라우저에 내장된 사이트 디버거 또는 `tcpdump`를 사용하는 것이지만, 두 가지 방법중 어느 것을 사용하든 이 문서의 범위를 벗어납니다.
ru: Другой способ — использование встроенного в веб-браузер отладчика сайтов или `tcpdump`; однако использование любого из этих методов выходит за рамки данного документа.

source: Support for HTTP2 reverse proxy connections by using the [.filename]#mod_proxy_http2.so# module. When configuring the ProxyPass or RewriteRules [P] statements, they should use h2:// for the connection.
ko: [.filename]#mod_proxy_http2.so# 모듈을 사용하여 HTTP2 역방향 프록시 연결을 지원합니다. ProxyPass 또는 RewriteRules [P] 문을 구성할 때는 연결에 h2://를 사용해야 합니다.
ru: Поддержка обратных прокси-соединений HTTP2 с использованием модуля [.filename]#mod_proxy_http2.so#. При настройке директив ProxyPass или RewriteRules с флагом [P] следует использовать h2:// для соединения.

source: Dynamic Websites
ko: 동적 웹사이트
ru: Динамические веб-сайты

source: In addition to mod_perl and mod_php, other languages are available for creating dynamic web content. These include Django and Ruby on Rails.
ko: 동적 웹 콘텐츠를 만드는 데 mod_perl 및 mod_php 외에도 다른 언어를 사용할 수 있습니다. 여기에는 장고(Django)와 루비 온 레일즈(Ruby on Rails)가 포함됩니다.
ru: В дополнение к mod_perl и mod_php, доступны другие языки для создания динамического веб-содержимого. Среди них Django и Ruby on Rails.

source: Django is a BSD-licensed framework designed to allow developers to write high performance, elegant web applications quickly. It provides an object-relational mapper so that data types are developed as Python objects. A rich dynamic database-access API is provided for those objects without the developer ever having to write SQL. It also provides an extensible template system so that the logic of the application is separated from the HTML presentation.
ko: Django는 개발자가 고성능의 우아한 웹 애플리케이션을 빠르게 작성할 수 있도록 설계된 BSD 라이선스 프레임워크입니다. 이 프레임워크는 객체 관계형 매퍼를 제공하여 데이터 유형을 Python 객체로 개발할 수 있도록 합니다. 개발자가 SQL을 작성할 필요 없이 이러한 객체에 대한 풍부한 동적 데이터베이스 액세스 API가 제공됩니다. 또한 확장 가능한 템플릿 시스템을 제공하여 애플리케이션의 로직이 HTML 프레젠테이션과 분리되도록 합니다.
ru: Django — это фреймворк под лицензией BSD, разработанный для того, чтобы позволить разработчикам быстро создавать высокопроизводительные и элегантные веб-приложения. Он предоставляет объектно-реляционный преобразователь (ORM), позволяющий разрабатывать типы данных как объекты Python. Для этих объектов предоставляется богатый динамический API доступа к базе данных, без необходимости написания разработчиком кода на SQL. Также имеется расширяемая система шаблонов, чтобы логика приложения была отделена от HTML-представления.

source: Django depends on [.filename]#mod_python#, and an SQL database engine. In FreeBSD, the package:www/py-django[] port automatically installs [.filename]#mod_python# and supports the PostgreSQL, MySQL, or SQLite databases, with the default being SQLite. To change the database engine, type `make config` within [.filename]#/usr/ports/www/py-django#, then install the port.
ko: Django는 [.filename]#mod_python# 및 SQL 데이터베이스 엔진에 의존합니다. FreeBSD에서는 package:www/py-django[] 포트가 자동으로 [.filename]#mod_python#을 설치하며, 기본값은 SQLite이나 PostgreSQL, MySQL 또한 지원합니다. 데이터베이스 엔진을 변경하려면 [.filename]#/usr/ports/www/py-django# 내에서 `make config`를 입력한 다음 포트를 설치합니다.
ru: Django зависит от [.filename]#mod_python# и движка SQL-базы данных. В FreeBSD порт package:www/py-django[] автоматически устанавливает [.filename]#mod_python# и поддерживает базы данных PostgreSQL, MySQL или SQLite, по умолчанию используется SQLite. Чтобы изменить движок базы данных, введите `make config` в [.filename]#/usr/ports/www/py-django#, затем установите порт.

source: Once Django is installed, the application will need a project directory along with the Apache configuration in order to use the embedded Python interpreter. This interpreter is used to call the application for specific URLs on the site.
ko: Django가 설치된 후, 애플리케이션이 내장된 Python 인터프리터를 사용하려면 Apache 구성과 함께 프로젝트 디렉터리가 필요합니다. 이 인터프리터는 사이트의 특정 URL에 대해 애플리케이션을 호출하는 데 사용됩니다.
ru: После установки Django приложению понадобится каталог проекта вместе с конфигурацией Apache для использования встроенного интерпретатора Python. Этот интерпретатор используется для вызова приложения при обращении к определённым URL на сайте.

source: To configure Apache to pass requests for certain URLs to the web application, add the following to [.filename]#httpd.conf#, specifying the full path to the project directory:
ko: 특정 URL에 대한 요청을 웹 애플리케이션에 전달하도록 Apache를 구성하려면 프로젝트 디렉터리의 전체 경로를 지정하여 [.filename]#httpd.conf#에 다음을 추가합니다:
ru: Для настройки Apache для передачи запросов определенных URL веб-приложению добавьте следующее в [.filename]#httpd.conf#, указав полный путь к каталогу проекта:

source: Refer to https://docs.djangoproject.com[https://docs.djangoproject.com] for more information on how to use Django.
ko: Django의 사용 방법에 대한 자세한 내용은 https://docs.djangoproject.com[https://docs.djangoproject.com]를 참조하세요.
ru: Обратитесь к https://docs.djangoproject.com[https://docs.djangoproject.com] для получения дополнительной информации о том, как использовать Django.

source: Ruby on Rails is another open source web framework that provides a full development stack. It is optimized to make web developers more productive and capable of writing powerful applications quickly. On FreeBSD, it can be installed using the package:www/rubygem-rails[] package or port.
ko: Ruby on Rails는 전체 개발 스택을 제공하는 또 다른 오픈 소스 웹 프레임워크입니다. 웹 개발자의 생산성을 높이고 강력한 애플리케이션을 빠르게 작성할 수 있도록 최적화되어 있습니다. FreeBSD에서는 package:www/rubygem-rails[] 패키지 또는 포트를 사용하여 설치할 수 있습니다.
ru: Ruby on Rails — это еще один фреймворк с открытым исходным кодом для веб-разработки, предоставляющий полный стек разработки. Он оптимизирован для повышения продуктивности веб-разработчиков и позволяет быстро создавать мощные приложения. В FreeBSD его можно установить с помощью пакета package:www/rubygem-rails[] или порта.

source: Refer to http://guides.rubyonrails.org[http://guides.rubyonrails.org] for more information on how to use Ruby on Rails.
ko: 루비 온 레일즈 사용 방법에 대한 자세한 내용은 http://guides.rubyonrails.org[http://guides.rubyonrails.org]를 참조하세요.
ru: Обратитесь к http://guides.rubyonrails.org[http://guides.rubyonrails.org] для получения дополнительной информации о том, как использовать Ruby on Rails.

source: File Transfer Protocol (FTP)
ko: 파일 전송 프로토콜 (File Transfer Protocol, FTP)
ru: Протокол передачи файлов (FTP)

source: The File Transfer Protocol (FTP) provides users with a simple way to transfer files to and from an FTP server. FreeBSD includes FTP server software, ftpd, in the base system.
ko: 파일 전송 프로토콜(FTP)은 사용자에게 FTP 서버와 파일을 주고받을 수 있는 간단한 방법을 제공합니다. FreeBSD는 기본 시스템에 FTP 서버 소프트웨어인 ftpd를 포함하고 있습니다.
ru: Протокол передачи файлов (FTP — File Transfer Protocol) предоставляет пользователям простой способ передачи файлов на FTP-сервер и с него. В базовую систему FreeBSD включено программное обеспечение FTP-сервера — ftpd.

source: FreeBSD provides several configuration files for controlling access to the FTP server. This section summarizes these files. Refer to man:ftpd[8] for more details about the built-in FTP server.
ko: FreeBSD는 FTP 서버에 대한 액세스를 제어하기 위한 몇 가지 구성 파일을 제공합니다. 이 섹션에서는 이러한 파일들을 설명합니다. 내장된 FTP 서버에 대한 자세한 내용은 man:ftpd[8]를 참고하세요.
ru: В FreeBSD предусмотрено несколько файлов конфигурации для управления доступом к FTP-серверу. В этом разделе приводится их краткое описание. Подробнее о встроенном FTP-сервере можно узнать в man:ftpd[8].

source: Configuration
ko: 구성
ru: Конфигурация

source: The most important configuration step is deciding which accounts will be allowed access to the FTP server. A FreeBSD system has a number of system accounts which should not be allowed FTP access. The list of users disallowed any FTP access can be found in [.filename]#/etc/ftpusers#. By default, it includes system accounts. Additional users that should not be allowed access to FTP can be added.
ko: 가장 중요한 구성 단계는 어떤 계정이 FTP 서버에 접근하도록 허용할지 결정하는 것입니다. FreeBSD 시스템에는 FTP 액세스가 허용되지 않아야 하는 시스템 계정이 많이 있습니다. FTP 액세스가 허용되지 않는 사용자 목록은 [.filename]#/etc/ftpusers#에서 찾을 수 있습니다. 기본적으로 시스템 계정이 포함됩니다. FTP 액세스가 허용되지 않아야 하는 사용자를 추가로 추가할 수 있습니다.
ru: Самый важный этап настройки — определение учётных записей, которым будет разрешён доступ к FTP-серверу. В системе FreeBSD существует ряд системных учётных записей, которым не следует разрешать доступ по FTP. Список пользователей, которым запрещён любой доступ по FTP, можно найти в [.filename]#/etc/ftpusers#. По умолчанию в него включены системные учётные записи. Можно добавить дополнительных пользователей, которым не следует разрешать доступ к FTP.

source: In some cases it may be desirable to restrict the access of some users without preventing them completely from using FTP. This can be accomplished be creating [.filename]#/etc/ftpchroot# as described in man:ftpchroot[5]. This file lists users and groups subject to FTP access restrictions.
ko: 경우에 따라 일부 사용자의 FTP 사용을 완전히 막지 않고 액세스를 제한하는 것이 바람직할 수 있습니다. man:ftpchroot[5]에 설명된 대로 [.filename]#/etc/ftpchroot#를 생성하면 이 작업을 수행할 수 있습니다. 이 파일에는 FTP 액세스 제한이 적용되는 사용자 및 그룹이 나열됩니다.
ru: В некоторых случаях может быть желательно ограничить доступ некоторых пользователей, не запрещая им полностью использовать FTP. Это можно сделать, создав файл [.filename]#/etc/ftpchroot#, как описано в man:ftpchroot[5]. В этом файле перечислены пользователи и группы, подлежащие ограничениям доступа к FTP.

source: To enable anonymous FTP access to the server, create a user named `ftp` on the FreeBSD system. Users will then be able to log on to the FTP server with a username of `ftp` or `anonymous`. When prompted for the password, any input will be accepted, but by convention, an email address should be used as the password. The FTP server will call man:chroot[2] when an anonymous user logs in, to restrict access to only the home directory of the `ftp` user.
ko: 서버에 대한 익명의 FTP 액세스를 활성화하려면, FreeBSD 시스템에서 `ftp`라는 사용자를 만드세요. 그러면 사용자는 `ftp` 또는 `anonymous`라는 사용자 이름으로 FTP 서버에 로그온할 수 있습니다. 비밀번호를 묻는 메시지가 표시되면 어떤 입력도 허용되지만, 관례에 따라 이메일 주소를 비밀번호로 사용해야 합니다. FTP 서버는 익명 사용자가 로그인할 때 man:chroot[2]를 호출하여 `ftp` 사용자의 홈 디렉토리로만 액세스를 제한합니다.
ru: Для обеспечения анонимного доступа по FTP к серверу создайте пользователя с именем `ftp` в системе FreeBSD. Пользователи смогут входить на FTP-сервер под именем `ftp` или `anonymous`. При запросе пароля будет принят любой ввод, но по соглашению в качестве пароля следует использовать адрес электронной почты. FTP-сервер вызовет man:chroot[2] при входе анонимного пользователя, чтобы ограничить доступ только домашним каталогом пользователя `ftp`.

source: There are two text files that can be created to specify welcome messages to be displayed to FTP clients. The contents of [.filename]#/etc/ftpwelcome# will be displayed to users before they reach the login prompt. After a successful login, the contents of [.filename]#/etc/ftpmotd# will be displayed. Note that the path to this file is relative to the login environment, so the contents of [.filename]#~ftp/etc/ftpmotd# would be displayed for anonymous users.
ko: FTP 클라이언트에 표시할 환영 메시지를 지정하기 위해 만들 수 있는 텍스트 파일은 두 가지가 있습니다. 로그인 프롬프트가 표시되기 전에 [.filename]#/etc/ftpwelcome#의 내용이 사용자에게 표시됩니다. 로그인에 성공하면 [.filename]#/etc/ftpmotd#의 내용이 표시됩니다. 이 파일의 경로는 로그인 환경에 상대적이므로 익명 사용자의 경우 [.filename]#~ftp/etc/ftpmotd#의 내용이 표시됩니다.
ru: Существуют два текстовых файла, которые можно создать для отображения приветственных сообщений клиентам FTP. Содержимое файла [.filename]#/etc/ftpwelcome# будет показано пользователям до появления запроса на вход. После успешного входа будет отображено содержимое файла [.filename]#/etc/ftpmotd#. Обратите внимание, что путь к этому файлу указывается относительно окружения входа, поэтому для анонимных пользователей будет отображаться содержимое файла [.filename]#~ftp/etc/ftpmotd#.

source: Once the FTP server has been configured, set the appropriate variable in [.filename]#/etc/rc.conf# to start the service during boot:
ko: FTP 서버가 구성되면 [.filename]#/etc/rc.conf#에서 적절한 변수를 설정하여 부팅 중에 서비스를 시작하세요:
ru: После настройки FTP-сервера установите соответствующую переменную в [.filename]#/etc/rc.conf#, чтобы служба запускалась при загрузке:

source: To start the service now:
ko: 서비스를 바로 시작하려면:
ru: Чтобы запустить службу сейчас:

source: Test the connection to the FTP server by typing:
ko: 키보드 타이핑으로 FTP 서버의 연결을 테스트하려면:
ru: Протестируйте подключение к FTP-серверу, набрав:

source: The ftpd daemon uses man:syslog[3] to log messages. By default, the system log daemon will write messages related to FTP in [.filename]#/var/log/xferlog#. The location of the FTP log can be modified by changing the following line in [.filename]#/etc/syslog.conf#:
ko: ftpd 데몬은 man:syslog[3]를 사용하여 메시지를 기록합니다. 기본적으로 시스템 로그 데몬은 [.filename]#/var/log/xferlog#에 FTP와 관련된 메시지를 기록합니다. FTP 로그의 위치는 [.filename]#/etc/syslog.conf#에서 다음 줄을 변경하여 수정할 수 있습니다:
ru: Демон ftpd использует man:syslog[3] для записи сообщений. По умолчанию, демон системного журнала записывает сообщения, связанные с FTP, в [.filename]#/var/log/xferlog#. Местоположение журнала FTP может быть изменено путём редактирования следующей строки в [.filename]#/etc/syslog.conf#:

source: Be aware of the potential problems involved with running an anonymous FTP server. In particular, think twice about allowing anonymous users to upload files. It may turn out that the FTP site becomes a forum for the trade of unlicensed commercial software or worse. If anonymous FTP uploads are required, then verify the permissions so that these files cannot be read by other anonymous users until they have been reviewed by an administrator.
ko: 익명 FTP 서버를 실행할 때 발생할 수 있는 잠재적인 문제에 유의하세요. 특히 익명 사용자가 파일을 업로드할 수 있도록 허용하기 전에 다시 한 번 생각하세요. FTP 사이트가 라이선스가 없는 상용 소프트웨어 거래의 장이 되거나 더 심각한 문제가 발생할 수 있습니다. 익명 FTP 업로드가 필요한 경우에는 관리자가 검토할 때까지 다른 익명 사용자가 해당 파일을 읽을 수 없도록 권한을 확인해야 합니다.
ru: Имейте в виду потенциальные проблемы, связанные с запуском анонимного FTP-сервера. В частности, хорошо подумайте, прежде чем разрешать анонимным пользователям загружать файлы. Может оказаться, что FTP-сайт станет площадкой для обмена нелицензионным коммерческим программным обеспечением или даже чем-то хуже. Если загрузка файлов анонимными пользователями необходима, убедитесь в правильности настроек прав доступа, чтобы эти файлы не могли быть прочитаны другими анонимными пользователями до тех пор, пока их не проверит администратор.

source: File and Print Services for Microsoft(R) Windows(R) Clients (Samba)
ko: Microsoft(R) Windows(R) 클라이언트를 위한 파일 및 인쇄 서비스(Samba, 삼바)
ru: Услуги файлов и печати для клиентов Microsoft(R) Windows(R) (Samba)
