Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: NFS consists of a server and one or more clients. The client remotely accesses the data that is stored on the server machine. In order for this to function properly, a few processes have to be configured and running.
ko: NFS는 서버와 하나 이상의 클라이언트로 구성됩니다. 클라이언트는 서버 머신에 저장된 데이터에 원격으로 액세스합니다. 이것이 제대로 작동하려면 몇 가지 프로세스를 구성하고 실행해야 합니다.
ru: NFS состоит из сервера и одного или нескольких клиентов. Клиент удалённо получает доступ к данным, хранящимся на машине сервера. Для корректной работы необходимо настроить и запустить несколько процессов.

source: These daemons must be running on the server:
ko: 다음의 데몬은 서버에서 반드시 실행 중이어야 합니다:
ru: Эти демоны должны быть запущены на сервере:

source: Daemon
ko: 데몬
ru: Демон

source: Description
ko: 설명
ru: Описание

source: The NFS daemon which services requests from NFS clients.
ko: NFS 클라이언트의 요청을 서비스하는 NFS 데몬.
ru: Демон NFS, обслуживающий запросы от клиентов NFS.

source: The NFS mount daemon which carries out requests received from nfsd.
ko: nfsd에서 받은 요청을 수행하는 NFS 마운트 데몬.
ru: Демон монтирования NFS, который выполняет запросы, полученные от nfsd.

source: This daemon allows NFS clients to discover which port the NFS server is using.
ko: NFS 클라이언트가 NFS 서버가 사용 중인 포트를 찾을 수 있게 허용해주는 데몬.
ru: Этот демон позволяет клиентам NFS определять, какой порт использует сервер NFS.

source: Running man:nfsiod[8] on the client can improve performance, but is not required.
ko: 클라이언트에서 man:nfsiod[8]를 실행하면 성능을 향상시킬 수 있지만 필수는 아닙니다.
ru: Запуск man:nfsiod[8] на клиенте может повысить производительность, но не является обязательным.

source: Configuring the Server
ko: 서버 구성하기
ru: Настройка сервера

source: The file systems which the NFS server will share are specified in [.filename]#/etc/exports#. Each line in this file specifies a file system to be exported, which clients have access to that file system, and any access options. When adding entries to this file, each exported file system, its properties, and allowed hosts must occur on a single line. If no clients are listed in the entry, then any client on the network can mount that file system.
ko: NFS 서버가 공유할 파일 시스템은 [.filename]#/etc/exports#에 지정됩니다. 이 파일의 각 줄은 내보낼 파일 시스템, 해당 파일 시스템에 액세스할 수 있는 클라이언트 및 모든 액세스 옵션을 지정합니다. 이 파일에 항목을 추가할 때는 내보낸 각 파일 시스템, 해당 속성 및 허용된 호스트가 한 줄에 포함되어야 합니다. 항목에 특정 클라이언트가 표시되어 있지 않으면 네트워크의 모든 클라이언트가 해당 파일 시스템을 마운트할 수 있습니다.
ru: Файловые системы, которые сервер NFS будет предоставлять в общий доступ, указаны в [.filename]#/etc/exports#. Каждая строка в этом файле определяет файловую систему для экспорта, клиентов, которые имеют доступ к этой файловой системе, и любые параметры доступа. При добавлении записей в этот файл каждая экспортируемая файловая система, её свойства и разрешённые хосты должны быть указаны в одной строке. Если в записи не указаны клиенты, то любой клиент в сети может подключить эту файловую систему.

source: The following [.filename]#/etc/exports# entries demonstrate how to export file systems. The examples can be modified to match the file systems and client names on the reader's network. There are many options that can be used in this file, but only a few will be mentioned here. See man:exports[5] for the full list of options.
ko: 다음 [.filename]#/etc/exports# 항목은 파일 시스템을 내보내는 방법을 보여줍니다. 이 예제는 여러분 네트워크의 파일 시스템 및 클라이언트 이름과 일치하도록 수정해 사용할 수 있습니다. 이 파일에 사용할 수 있는 옵션은 많지만 여기서는 몇 가지 옵션만 언급합니다. 전체 옵션 목록은 man:exports[5]를 참조하세요.
ru: Следующие записи в [.filename]#/etc/exports# демонстрируют, как экспортировать файловые системы. Примеры могут быть изменены в соответствии с файловыми системами и именами клиентов в сети читателя. В этом файле можно использовать множество опций, но здесь упомянуты лишь некоторые. Полный список опций смотрите в man:exports[5].

source: This example shows how to export [.filename]#/cdrom# to three hosts named _alpha_, _bravo_, and _charlie_:
ko: 이 예는 _alpha_, _bravo_, _charlie_라는 세 개의 호스트로 [.filename]#/cdrom#을 내보내는 방법을 보여 줍니다:
ru: В этом примере показано, как экспортировать [.filename]#/cdrom# на три хоста с именами _alpha_, _bravo_ и _charlie_:

source: The `-ro` flag makes the file system read-only, preventing clients from making any changes to the exported file system. This example assumes that the host names are either in DNS or in [.filename]#/etc/hosts#. Refer to man:hosts[5] if the network does not have a DNS server.
ko: `-ro` 플래그를 사용하면 파일 시스템을 읽기 전용으로 설정하여 클라이언트가 내보낸 파일 시스템을 변경할 수 없게 합니다. 이 예에서는 호스트 이름이 DNS 또는 [.filename]#/etc/hosts#에 있다고 가정합니다. 네트워크에 DNS 서버가 없는 경우 man:hosts[5]를 참조하세요.
ru: Флаг `-ro` делает файловую систему доступной только для чтения, предотвращая внесение клиентами изменений в экспортированную файловую систему. В этом примере предполагается, что имена хостов находятся либо в DNS, либо в [.filename]#/etc/hosts#. Обратитесь к man:hosts[5], если в сети нет DNS-сервера.

source: The next example exports [.filename]#/home# to three clients by IP address. This can be useful for networks without DNS or [.filename]#/etc/hosts# entries. The `-alldirs` flag allows subdirectories to be mount points. In other words, it will not automatically mount the subdirectories, but will permit the client to mount the directories that are required as needed.
ko: 다음 예는 [.filename]#/home#을 IP 주소별로 세 명의 클라이언트로 내보냅니다. 이 방법은 DNS 또는 [.filename]#/etc/hosts# 항목이 없는 네트워크에 유용할 수 있습니다. `-alldirs` 플래그를 사용하면 하위 디렉터리가 마운트 지점이 될 수 있습니다. 즉, 하위 디렉터리를 자동으로 마운트하지는 않지만 클라이언트가 필요에 따라 필요한 디렉터리를 마운트할 수 있도록 허용합니다.
ru: Следующий пример экспортирует [.filename]#/home# трём клиентам по IP-адресу. Это может быть полезно для сетей без DNS или записей в [.filename]#/etc/hosts#. Флаг `-alldirs` позволяет подкаталогам быть точками монтирования. Другими словами, он не будет автоматически монтировать подкаталоги, но разрешит клиенту монтировать необходимые каталоги по мере надобности.

source: This next example exports [.filename]#/a# so that two clients from different domains may access that file system. The `-maproot=root` allows `root` on the remote system to write data on the exported file system as `root`. If `-maproot=root` is not specified, the client's `root` user will be mapped to the server's `nobody` account and will be subject to the access limitations defined for `nobody`.
ko: 다음 예제는 서로 다른 도메인의 두 클라이언트가 해당 파일 시스템에 액세스할 수 있도록 [.filename]#/a#을 내보냅니다. `-maproot=root`를 사용하면 원격 시스템의 `root`가 내보낸 파일 시스템에 `root`로 데이터를 쓸 수 있습니다. `-maproot=root`를 지정하지 않으면 클라이언트의 `root` 사용자가 서버의 `nobody` 계정에 매핑되고 `nobody`에 정의된 액세스 제한이 적용됩니다.
ru: Следующий пример экспортирует [.filename]#/a#, чтобы два клиента из разных доменов могли получить доступ к этой файловой системе. Параметр `-maproot=root` позволяет пользователю `root` на удалённой системе записывать данные в экспортированную файловую систему как `root`. Если параметр `-maproot=root` не указан, пользователь `root` на клиенте будет отображён на учётную запись `nobody` на сервере и будет ограничен правами доступа, определёнными для `nobody`.

source: A client can only be specified once per file system. For example, if [.filename]#/usr# is a single file system, these entries would be invalid as both entries specify the same host:
ko: 클라이언트는 파일 시스템당 한 번만 지정할 수 있습니다. 예를 들어 [.filename]#/usr#이 단일 파일 시스템인 경우 두 항목이 모두 동일한 호스트를 지정하므로 다음 항목은 유효하지 않습니다:
ru: Клиент может быть указан только один раз для каждой файловой системы. Например, если [.filename]#/usr# представляет собой одну файловую систему, следующие записи будут недопустимыми, так как обе указывают на один и тот же узел:

source: The correct format for this situation is to use one entry:
ko: 이 상황에 맞는 올바른 형식은 하나의 항목을 사용하는 것입니다:
ru: Правильный формат для данной ситуации — использовать одну запись:

source: The following is an example of a valid export list, where [.filename]#/usr# and [.filename]#/exports# are local file systems:
ko: 다음은 유효한 내보내기 목록의 예입니다. 여기서 [.filename]#/usr# 및 [.filename]#/exports#는 로컬 파일 시스템입니다:
ru: Ниже приведён пример корректного списка экспорта, где [.filename]#/usr# и [.filename]#/exports# являются локальными файловыми системами:

source: To enable the processes required by the NFS server at boot time, add these options to [.filename]#/etc/rc.conf#:
ko: 부팅 시 NFS 서버에 필요한 프로세스를 활성화하려면 [.filename]#/etc/rc.conf#에 다음의 옵션을 추가합니다:
ru: Чтобы включить процессы, необходимые для работы сервера NFS при загрузке, добавьте следующие параметры в [.filename]#/etc/rc.conf#:

source: The server can be started now by running this command:
ko: 이 명령을 실행하여 서버를 지금 시작할 수 있습니다:
ru: Сервер можно запустить, выполнив следующую команду:

source: Whenever the NFS server is started, mountd also starts automatically. However, mountd only reads [.filename]#/etc/exports# when it is started. To make subsequent [.filename]#/etc/exports# edits take effect immediately, force mountd to reread it:
ko: NFS 서버가 시작될 때마다 mountd도 자동으로 시작됩니다. 그러나 mountd는 시작될 때 [.filename]#/etc/exports#만 읽습니다. 이후의 [.filename]#/etc/exports# 편집 내용을 즉시 적용하려면 mountd가 해당 파일을 다시 읽도록 강제 실행합니다:
ru: Всякий раз, когда запускается сервер NFS, также автоматически запускается mountd. Однако mountd читает [.filename]#/etc/exports# только при запуске. Чтобы последующие изменения в [.filename]#/etc/exports# вступили в силу немедленно, заставьте mountd перечитать его:

source: Refer to man:zfs-share[8] for a description of exporting ZFS datasets via NFS using the `sharenfs` ZFS property instead of the man:exports[5] file.
ru: Обратитесь к man:zfs-share[8] для описания экспорта наборов данных ZFS через NFS с использованием свойства ZFS `sharenfs` вместо файла man:exports[5].

source: Refer to man:nfsv4[4] for a description of an NFS Version 4 setup.
ko: NFS 버전 4 설정에 대한 설명은 man:nfsv4[4]를 참조하세요.
ru: Обратитесь к man:nfsv4[4] для описания настройки NFS версии 4.

source: Configuring the Client
ko: 클라이언트 구성하기
ru: Настройка клиента

source: To enable NFS clients, set this option in each client's [.filename]#/etc/rc.conf#:
ko: NFS 클라이언트를 사용하려면 각 클라이언트의 [.filename]#/etc/rc.conf#에서 다음 옵션을 설정하세요:
ru: Чтобы включить клиенты NFS, установите эту опцию в файле [.filename]#/etc/rc.conf# каждого клиента:

source: Then, run this command on each NFS client:
ko: 그런 다음 각각의 NFS 클라이언트에서 다음 명령을 실행합니다:
ru: Затем выполните эту команду на каждом клиенте NFS:

source: The client now has everything it needs to mount a remote file system. In these examples, the server's name is `server` and the client's name is `client`. To mount [.filename]#/home# on `server` to the [.filename]#/mnt# mount point on `client`:
ko: 이제 클라이언트는 원격 파일 시스템을 마운트하는 데 필요한 모든 것을 갖추었습니다. 이 예제에서 서버의 이름은 `server`이고 클라이언트의 이름은 `client`입니다. `server`의 [.filename]#/home#을 `client`의 [.filename]#/mnt# 마운트 지점에 마운트하려면 다음과 같이 하세요:
ru: Клиент теперь имеет всё необходимое для монтирования удалённой файловой системы. В этих примерах имя сервера — `server`, а имя клиента — `client`. Чтобы смонтировать [.filename]#/home# с сервера `server` в точку монтирования [.filename]#/mnt# на клиенте `client`:

source: The files and directories in [.filename]#/home# will now be available on `client`, in the [.filename]#/mnt# directory.
ko: 이제 [.filename]#/home#에 있는 파일과 디렉터리는 `client`의 [.filename]#/mnt# 디렉터리에서 사용할 수 있습니다.
ru: Файлы и каталоги в [.filename]#/home# теперь будут доступны на `client`, в директории [.filename]#/mnt#.

source: To mount a remote file system each time the client boots, add it to [.filename]#/etc/fstab#:
ko: 클라이언트가 부팅할 때마다 원격 파일 시스템을 마운트하려면 [.filename]#/etc/fstab#에 추가합니다:
ru: Для монтирования удаленной файловой системы при каждой загрузке клиента добавьте её в [.filename]#/etc/fstab#:

source: Refer to man:fstab[5] for a description of all available options.
ko: 사용 가능한 모든 옵션에 대한 설명은 man:fstab[5]을 참조하세요.
ru: Обратитесь к man:fstab[5] для описания всех доступных опций.

source: Locking
ko: 잠금
ru: Блокировка

source: Some applications require file locking to operate correctly. To enable locking, execute the following command on both the client and server:
ru: Некоторые приложения требуют блокировки файлов для корректной работы. Чтобы включить блокировку, выполните следующую команду как на клиенте, так и на сервере:

source: Then start the man:rpc.lockd[8] service:
ru: Затем запустите службу man:rpc.lockd[8]:

source: If locking is not required on the server, the NFS client can be configured to lock locally by including `-L` when running mount. Refer to man:mount_nfs[8] for further details.
ko: 서버에서 잠금이 필요하지 않은 경우, 마운트를 실행할 때 `-L`을 포함하여 로컬에서 잠그도록 NFS 클라이언트를 구성할 수 있습니다. 자세한 내용은 man:mount_nfs[8]을 참고하세요.
ru: Если блокировка не требуется на сервере, клиент NFS можно настроить для локальной блокировки, добавив параметр `-L` при выполнении команды mount. Дополнительные сведения см. в man:mount_nfs[8].

source: Automating Mounts with man:autofs[5]
ko: man:autofs[5]로 마운트 자동화하기
ru: Автоматизация монтирования с помощью man:autofs[5]

source: The man:autofs[5] automount facility is supported starting with FreeBSD 10.1-RELEASE. To use the automounter functionality in older versions of FreeBSD, use man:amd[8] instead. This chapter only describes the man:autofs[5] automounter.
ko: man:autofs[5] 오토마운트 기능은 FreeBSD 10.1-RELEASE부터 지원됩니다. 이전 버전의 FreeBSD에서 오토마운터 기능을 사용하려면, man:amd[8]를 사용하십시오. 이 장에서는 man:autofs[5] 오토마운터에 대해서만 설명합니다.
ru: Автомонтирование man:autofs[5] поддерживается начиная с FreeBSD 10.1-RELEASE. Для использования функциональности автомонтирования в более старых версиях FreeBSD используйте man:amd[8]. В этой главе описывается только автомонтирование man:autofs[5].

source: The man:autofs[5] facility is a common name for several components that, together, allow for automatic mounting of remote and local filesystems whenever a file or directory within that file system is accessed. It consists of the kernel component, man:autofs[5], and several userspace applications: man:automount[8], man:automountd[8] and man:autounmountd[8]. It serves as an alternative for man:amd[8] from previous FreeBSD releases. amd is still provided for backward compatibility purposes, as the two use different map formats; the one used by autofs is the same as with other SVR4 automounters, such as the ones in Solaris, MacOS X, and Linux.
ko: man:autofs[5] 기능은 파일 시스템 내의 파일이나 디렉터리에 액세스할 때마다 원격 및 로컬 파일 시스템을 자동으로 마운트할 수 있도록 하는 여러 구성 요소의 공통 이름입니다. 이것은 커널 구성 요소인 man:autofs[5]와 여러 사용자 공간 응용 프로그램인 man:automount[8], man:automountd[8] 및 man:autounmountd[8]로 구성되어 있습니다. 이는 이전 FreeBSD 릴리스의 man:amd[8]를 대체하는 역할을 합니다. man:amd[8]는 이전 버전과의 호환성을 위해 여전히 제공되지만, 둘은 서로 다른 맵 형식을 사용하며 autofs에서 사용하는 맵 형식은 Solaris, MacOS X 및 Linux와 같은 다른 SVR4 오토마운터와 동일합니다.
ru: Утилита man:autofs[5] — это общее название для нескольких компонентов, которые вместе позволяют автоматически монтировать удалённые и локальные файловые системы при обращении к файлу или каталогу внутри этих файловых систем. Она состоит из компонента ядра man:autofs[5] и нескольких пользовательских приложений: man:automount[8], man:automountd[8] и man:autounmountd[8]. Она служит альтернативой для man:amd[8] из предыдущих выпусков FreeBSD. amd по-прежнему предоставляется для обратной совместимости, так как эти утилиты используют разные форматы карт; формат, используемый autofs, совпадает с форматом других автомонтировщиков SVR4, таких как в Solaris, MacOS X и Linux.

source: The man:autofs[5] virtual filesystem is mounted on specified mountpoints by man:automount[8], usually invoked during boot.
ko: man:autofs[5] 가상 파일 시스템은 보통 부팅 중에 호출되는 man:automount[8]에 의해 지정된 마운팅 포인트에 마운트됩니다.
ru: Виртуальная файловая система man:autofs[5] монтируется на указанные точки монтирования с помощью man:automount[8], который обычно запускается во время загрузки.

source: Whenever a process attempts to access a file within the man:autofs[5] mountpoint, the kernel will notify man:automountd[8] daemon and pause the triggering process. The man:automountd[8] daemon will handle kernel requests by finding the proper map and mounting the filesystem according to it, then signal the kernel to release blocked process. The man:autounmountd[8] daemon automatically unmounts automounted filesystems after some time, unless they are still being used.
ko: 프로세스가 man:autofs[5] 마운팅 포인트 내의 파일에 액세스하려고 시도할 때마다 커널은 man:automountd[8] 데몬에게 알리고 트리거 프로세스를 일시 중지합니다. man:automountd[8] 데몬은 적절한 맵을 찾고 그에 따라 파일 시스템을 마운트하여 커널 요청을 처리한 다음 커널에 차단된 프로세스를 해제하라는 신호를 보냅니다. man:autounmountd[8] 데몬은 자동 마운트된 파일시스템이 아직 사용 중이 아닌 경우 일정 시간이 지나면 자동으로 마운트를 해제합니다.
ru: Всякий раз, когда процесс пытается получить доступ к файлу в точке монтирования man:autofs[5], ядро уведомляет демон man:automountd[8] и приостанавливает вызвавший процесс. Демон man:automountd[8] обрабатывает запросы ядра, находя соответствующую карту и монтируя файловую систему в соответствии с ней, после чего сигнализирует ядру о разблокировке процесса. Демон man:autounmountd[8] автоматически размонтирует автомонтируемые файловые системы по истечении некоторого времени, если они больше не используются.

source: The primary autofs configuration file is [.filename]#/etc/auto_master#. It assigns individual maps to top-level mounts. For an explanation of [.filename]#auto_master# and the map syntax, refer to man:auto_master[5].
ko: man:autofs[5]의 기본 구성 파일은 [.filename]#/etc/auto_master#입니다. 이 파일은 개별 맵을 최상위 마운트에 할당합니다. [.filename]#auto_master# 및 맵 구문에 대한 설명은 man:auto_master[5]를 참조하세요.
ru: Основной файл конфигурации autofs — это [.filename]#/etc/auto_master#. Он связывает отдельные карты с корневыми точками монтирования. Для объяснения синтаксиса [.filename]#auto_master# и карт обратитесь к man:auto_master[5].

source: There is a special automounter map mounted on [.filename]#/net#. When a file is accessed within this directory, man:autofs[5] looks up the corresponding remote mount and automatically mounts it. For instance, an attempt to access a file within [.filename]#/net/foobar/usr# would tell man:automountd[8] to mount the [.filename]#/usr# export from the host `foobar`.
ko: [.filename]#/net#에 마운트된 특수 자동 마운트 맵이 있습니다. 이 디렉터리 내에서 파일에 액세스하면 man:autofs[5]가 해당 원격 마운트를 조회하여 자동으로 마운트합니다. 예를 들어, [.filename]#/net/foobar/usr# 내의 파일에 액세스하려는 시도는 man:automountd[8]에게 호스트 `foobar`에서 내보낸 [.filename]#/usr#를 마운트하도록 지시합니다.
ru: Существует специальная карта автомонтирования, смонтированная в [.filename]#/net#. При обращении к файлу в этом каталоге, man:autofs[5] ищет соответствующую удалённую точку монтирования и автоматически монтирует её. Например, попытка доступа к файлу в [.filename]#/net/foobar/usr# приведёт к тому, что man:automountd[8] смонтирует экспорт [.filename]#/usr# с хоста `foobar`.

source: Mounting an Export with man:autofs[5]
ko: man:autofs[5]로 마운팅 내보내기
ru: Подключение экспорта с помощью man:autofs[5]

source: In this example, `showmount -e` shows the exported file systems that can be mounted from the NFS server, `foobar`:
ko: 이 예제에서 `showmount -e`는 NFS 서버에 마운트 할 수 있는 파일 시스템을 내보내기를 보여줍니다:
ru: В этом примере `showmount -e` показывает экспортированные файловые системы, которые могут быть подключены с NFS-сервера `foobar`:

source: The output from `showmount` shows [.filename]#/usr# as an export. When changing directories to [.filename]#/host/foobar/usr#, man:automountd[8] intercepts the request and attempts to resolve the hostname `foobar`. If successful, man:automountd[8] automatically mounts the source export.
ko: `showmount`의 출력은 내보내기로 [.filename]#/usr#을 표시합니다. 디렉터리를 [.filename]#/host/foobar/usr#로 변경할 때, man:automountd[8]는 요청을 가로채서 호스트 이름 `foobar`를 확인하려고 시도합니다. 성공하면 man:automountd[8]가 자동으로 소스 내보내기를 마운트합니다.
ru: Результат выполнения `showmount` показывает, что [.filename]#/usr# экспортируется. При переходе в каталог [.filename]#/host/foobar/usr#, man:automountd[8] перехватывает запрос и пытается разрешить имя хоста `foobar`. В случае успеха man:automountd[8] автоматически монтирует исходный экспорт.

source: To enable man:autofs[5] at boot time, add this line to [.filename]#/etc/rc.conf#:
ko: 부팅 시 man:autofs[5]를 활성화하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가하세요:
ru: Чтобы включить man:autofs[5] при загрузке, добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: Then man:autofs[5] can be started by running:
ko: 그런 다음 man:autofs[5]를 실행하여 시작할 수 있습니다:
ru: Затем man:autofs[5] может быть запущен выполнением:

source: The man:autofs[5] map format is the same as in other operating systems. Information about this format from other sources can be useful, like the http://web.archive.org/web/20160813071113/http://images.apple.com/business/docs/Autofs.pdf[Mac OS X document].
ko: man:autofs[5] 맵 형식은 다른 운영 체제에서와 동일합니다. 이 형식에 대한 정보는 http://web.archive.org/web/20160813071113/http://images.apple.com/business/docs/Autofs.pdf[Mac OS X document]와 같은 다른 출처의 정보가 유용할 수 있습니다.
ru: Формат карты man:autofs[5] такой же, как и в других операционных системах. Информация об этом формате из других источников может быть полезной, например, из http://web.archive.org/web/20160813071113/http://images.apple.com/business/docs/Autofs.pdf[документации Mac OS X].

source: Consult the man:automount[8], man:automountd[8], man:autounmountd[8], and man:auto_master[5] manual pages for more information.
ko: 자세한 내용은 man:automount[8], man:automountd[8], man:autounmountd[8], man:auto_master[5] 매뉴얼 페이지를 참조하세요.
ru: Обратитесь к справочным страницам man:automount[8], man:automountd[8], man:autounmountd[8] и man:auto_master[5] для получения дополнительной информации.

source: Network Information System (NIS)
ko: 네트워크 정보 시스템 (NIS)
ru: Сетевая информационная система (NIS)

source: Network Information System (NIS) is designed to centralize administration of UNIX(R)-like systems such as Solaris(TM), HP-UX, AIX(R), Linux, NetBSD, OpenBSD, and FreeBSD. NIS was originally known as Yellow Pages but the name was changed due to trademark issues. This is the reason why NIS commands begin with `yp`.
ko: NIS(네트워크 정보 시스템)는 Solaris(TM), HP-UX, AIX(R), Linux, NetBSD, OpenBSD, FreeBSD 등 UNIX(R) 계열 시스템의 관리를 중앙 집중화하도록 설계되었습니다. NIS는 원래 Yellow Pages로 알려졌지만 상표권 문제로 인해 이름이 변경되었습니다. 이것이 NIS 명령이 `yp`로 시작하는 이유입니다.
ru: Сетевая информационная система (NIS — Network Information System) предназначена для централизованного администрирования UNIX(R)-подобных систем, таких как Solaris(TM), HP-UX, AIX(R), Linux, NetBSD, OpenBSD и FreeBSD. Изначально NIS была известна как Yellow Pages, но название было изменено из-за проблем с товарными знаками. Именно поэтому команды NIS начинаются с `yp`.

source: NIS is a Remote Procedure Call (RPC)-based client/server system that allows a group of machines within an NIS domain to share a common set of configuration files. This permits a system administrator to set up NIS client systems with only minimal configuration data and to add, remove, or modify configuration data from a single location.
ko: NIS는 NIS 도메인 내의 컴퓨터 그룹이 공통 구성 파일 집합을 공유할 수 있도록 하는 RPC(원격 프로시저 호출) 기반 클라이언트/서버 시스템입니다. 이를 통해 시스템 관리자는 최소한의 구성 데이터만으로 NIS 클라이언트 시스템을 설정하고 단일 위치에서 구성 데이터를 추가, 제거 또는 수정할 수 있습니다.
ru: NIS — это клиент-серверная система на основе удалённых вызовов процедур (RPC), которая позволяет группе машин в домене NIS использовать общий набор конфигурационных файлов. Это позволяет системному администратору настраивать клиентские системы NIS с минимальным объёмом конфигурационных данных, а также добавлять, удалять или изменять конфигурационные данные из единого места.

source: FreeBSD uses version 2 of the NIS protocol.
ko: FreeBSD는 NIS 프로토콜 버전 2를 사용합니다.
ru: FreeBSD использует вторую версию протокола NIS.

source: NIS Terms and Processes
ko: NIS 약관 및 프로세스
ru: Термины и процессы NIS

source: Table 28.1 summarizes the terms and important processes used by NIS:
ko: 표 28.1은 NIS에서 사용하는 용어와 주요 프로세스를 요약한 것입니다:
ru: Таблица 28.1 обобщает термины и важные процессы, используемые NIS:

source: NIS Terminology
ko: NIS 용어
ru: Терминология NIS

source: Term
ko: 용어
ru: Термин

source: NIS domain name
ru: Имя домена NIS
