Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: Some non-FreeBSD NIS clients cannot handle netgroups containing more than 15 entries. This limit may be circumvented by creating several sub-netgroups with 15 users or fewer and a real netgroup consisting of the sub-netgroups, as seen in this example:
ko: 일부 비 FreeBSD NIS 클라이언트는 15개 이상의 항목을 포함하는 넷그룹을 처리할 수 없습니다. 이 예에서 보는 것처럼 사용자가 15명 이하인 하위 넷그룹을 여러 개 만들고 이 하위 넷그룹으로 구성된 실제 넷그룹을 만들면 이 제한을 피할 수 있습니다:
ru: Некоторые клиенты NIS, не относящиеся к FreeBSD, не могут обрабатывать сетевые группы, содержащие более 15 записей. Это ограничение можно обойти, создав несколько подгрупп с 15 или менее пользователями и настоящую сетевую группу, состоящую из этих подгрупп, как показано в этом примере:

source: Repeat this process if more than 225 (15 times 15) users exist within a single netgroup.
ko: 단일 넷그룹 내에 225명(15x15명) 이상의 사용자가 있는 경우 이 과정을 반복합니다.
ru: Повторите этот процесс, если в одной сетевой группе существует более 225 (15 умножить на 15) пользователей.

source: To activate and distribute the new NIS map:
ko: 새 NIS 맵을 활성화하고 배포합니다:
ru: Для активации и распространения новой NIS-карты:

source: This will generate the three NIS maps [.filename]#netgroup#, [.filename]#netgroup.byhost# and [.filename]#netgroup.byuser#. Use the map key option of man:ypcat[1] to check if the new NIS maps are available:
ko: 이렇게 하면 [.filename]#netgroup#, [.filename]#netgroup.byhost# 및 [.filename]#netgroup.byuser#의 세 가지 NIS 맵이 생성됩니다. man:ypcat[1]의 맵 키 옵션을 사용하여 새 NIS 맵을 사용할 수 있는지 확인합니다:
ru: Это создаст три карты NIS [.filename]#netgroup#, [.filename]#netgroup.byhost# и [.filename]#netgroup.byuser#. Используйте опцию ключа карты в man:ypcat[1], чтобы проверить доступность новых карт NIS:

source: The output of the first command should resemble the contents of [.filename]#/var/yp/netgroup#. The second command only produces output if host-specific netgroups were created. The third command is used to get the list of netgroups for a user.
ko: 첫 번째 명령의 출력은 [.filename]#/var/yp/netgroup#의 내용과 비슷해야 합니다. 두 번째 명령은 호스트별 넷그룹이 생성된 경우에만 출력을 생성합니다. 세 번째 명령은 사용자에 대한 넷그룹 목록을 가져오는 데 사용됩니다.
ru: Вывод первой команды должен напоминать содержимое файла [.filename]#/var/yp/netgroup#. Вторая команда выводит результат только в случае создания специфичных для хоста групп сетей. Третья команда используется для получения списка групп сетей для пользователя.

source: To configure a client, use man:vipw[8] to specify the name of the netgroup. For example, on the server named `war`, replace this line:
ko: 클라이언트를 구성하려면 man:vipw[8]을 사용하여 넷그룹의 이름을 지정합니다. 예를 들어 `war`라는 서버의 경우 이 줄을…:
ru: Для настройки клиента используйте man:vipw[8], чтобы указать имя сетевой группы. Например, на сервере с именем `war` замените эту строку:

source: with
ko: 다음으로 바꿉니다
ru: строкой

source: This specifies that only the users defined in the netgroup `IT_EMP` will be imported into this system's password database and only those users are allowed to login to this system.
ko: 이는 넷그룹 `IT_EMP`에 정의된 사용자만 이 시스템의 비밀번호 데이터베이스로 가져오고 해당 사용자들만 이 시스템에 로그인할 수 있도록 지정합니다.
ru: Указывает, что только пользователи, определённые в сетевой группе `IT_EMP`, будут импортированы в базу данных паролей этой системы, и только этим пользователям разрешён вход в систему.

source: This configuration also applies to the `~` function of the shell and all routines which convert between user names and numerical user IDs. In other words, `cd ~_user_` will not work, `ls -l` will show the numerical ID instead of the username, and `find . -user joe -print` will fail with the message `No such user`. To fix this, import all user entries without allowing them to login into the servers. This can be achieved by adding an extra line:
ko: 이 구성은 셸의 `~` 함수와 사용자 이름과, 숫자 사용자 ID를 변환하는 모든 루틴에도 적용됩니다. 즉, `cd ~_user_`는 동작하지 않고, `ls -l`은 사용자 이름 대신 숫자 ID를 표시하며, `find . -user joe -print`는 `No such user`라는 메시지와 함께 실패할 것입니다. 이 문제를 해결하려면 모든 사용자들이 서버에 로그인하지 않도록 한 후, 사용자 항목을 가져오세요. 이 작업은 다음 명령을 추가하여 수행할 수 있습니다:
ru: Эта конфигурация также применяется к функции `~` оболочки и всем процедурам, которые преобразуют между именами пользователей и числовыми идентификаторами пользователей. Другими словами, `cd ~_user_` не будет работать, `ls -l` покажет числовой ID вместо имени пользователя, а `find . -user joe -print` завершится с сообщением `No such user`. Чтобы исправить это, импортируйте все записи пользователей, не разрешая им вход на серверы. Это можно достичь, добавив дополнительную строку:

source: This line configures the client to import all entries but to replace the shell in those entries with [.filename]#/usr/sbin/nologin#.
ko: 이 명령은 클라이언트가 모든 항목을 가져오되 해당 항목의 셸을 [.filename]#/usr/sbin/nologin#으로 바꾸도록 구성합니다.
ru: Эта строка настраивает клиент на импорт всех записей, но с заменой оболочки в этих записях на [.filename]#/usr/sbin/nologin#.

source: Make sure that extra line is placed _after_ `+@IT_EMP:::::::::`. Otherwise, all user accounts imported from NIS will have [.filename]#/usr/sbin/nologin# as their login shell and no one will be able to login to the system.
ko: `+@IT_EMP:::::::::` 뒤에 여분의 줄을 추가해야 합니다. 그렇지 않으면 NIS에서 가져온 모든 사용자 계정의 로그인 셸이 [.filename]#/usr/sbin/nologin#으로 지정되어 아무도 시스템에 로그인할 수 없게 됩니다.
ru: Убедитесь, что дополнительная строка добавлена _после_ `+@IT_EMP:::::::::`. В противном случае у всех пользовательских учётных записей, импортированных из NIS, будет указана оболочка входа [.filename]#/usr/sbin/nologin#, и никто не сможет войти в систему.

source: To configure the less important servers, replace the old `+:::::::::` on the servers with these lines:
ko: 덜 중요한 서버를 구성하려면 서버의 기존 `+:::::::::`을 다음으로 바꿉니다:
ru: Для настройки менее важных серверов замените старые `+:::::::::` на серверах следующими строками:

source: The corresponding lines for the workstations would be:
ko: 워크스테이션에 해당하는 내용은 다음과 같습니다:
ru: Соответствующие строки для рабочих станций будут:

source: NIS supports the creation of netgroups from other netgroups which can be useful if the policy regarding user access changes. One possibility is the creation of role-based netgroups. For example, one might create a netgroup called `BIGSRV` to define the login restrictions for the important servers, another netgroup called `SMALLSRV` for the less important servers, and a third netgroup called `USERBOX` for the workstations. Each of these netgroups contains the netgroups that are allowed to login onto these machines. The new entries for the NIS`netgroup` map would look like this:
ko: NIS는 사용자 액세스 관련 정책이 변경되는 경우 사용할 수 있는 다른 넷그룹으로부터 넷그룹을 만드는 기능을 지원합니다. 한 가지 방법은 역할 기반 넷그룹을 만드는 것입니다. 예를 들어, 중요한 서버에 대한 로그인 제한을 정의하기 위해 `BIGSRV`라는 넷그룹을 만들고, 덜 중요한 서버에 대해 `SMALLSRV`라는 넷그룹을 만들고, 워크스테이션을 위해 `USERBOX`라는 세 번째 넷그룹을 만들 수 있습니다. 이러한 각 넷그룹에는 해당 머신에 로그인할 수 있는 넷그룹이 포함되어 있습니다. NIS`netgroup` 맵의 새 항목은 다음과 같습니다:
ru: NIS поддерживает создание netgroups из других netgroups, что может быть полезно при изменении политики доступа пользователей. Одна из возможностей — создание ролевых netgroups. Например, можно создать netgroup с именем `BIGSRV` для определения ограничений входа на важные серверы, другую netgroup `SMALLSRV` для менее важных серверов и третью netgroup `USERBOX` для рабочих станций. Каждая из этих netgroups содержит netgroups, которым разрешено входить на эти машины. Новые записи для карты NIS `netgroup` будут выглядеть так:

source: This method of defining login restrictions works reasonably well when it is possible to define groups of machines with identical restrictions. Unfortunately, this is the exception and not the rule. Most of the time, the ability to define login restrictions on a per-machine basis is required.
ko: 로그인 제한을 정의하는 이 방법은 동일한 제한을 가진 컴퓨터 그룹을 정의할 수 있을 때 매우 합리적으로 작동합니다. 안타깝게도 이것은 예외이지 규칙은 아닙니다. 대부분의 경우 컴퓨터별로 로그인 제한을 정의할 수 있는 기능이 필요합니다.
ru: Этот метод определения ограничений входа работает достаточно хорошо, когда можно определить группы машин с одинаковыми ограничениями. К сожалению, это скорее исключение, чем правило. В большинстве случаев требуется возможность определять ограничения входа для каждой машины отдельно.

source: Machine-specific netgroup definitions are another possibility to deal with the policy changes. In this scenario, the [.filename]#/etc/master.passwd# of each system contains two lines starting with "+". The first line adds a netgroup with the accounts allowed to login onto this machine and the second line adds all other accounts with [.filename]#/usr/sbin/nologin# as shell. It is recommended to use the "ALL-CAPS" version of the hostname as the name of the netgroup:
ko: 시스템별 넷그룹 정의는 정책 변경을 해결할 수 있는 또 다른 방법입니다. 이 시나리오에서는 각 시스템의 [.filename]#/etc/master.passwd#에 “+”로 시작하는 두 줄이 포함되어 있습니다. 첫 번째 줄은 이 시스템에 로그인할 수 있는 계정이 포함된 넷그룹을 추가하고, 두 번째 줄은 [.filename]#//usr/sbin/nologin#을 셸로 사용하는 다른 모든 계정을 추가합니다. 넷그룹의 이름으로 호스트 이름의 “ALL-CAPS” 버전을 사용하는 것이 좋습니다:
ru: Определения машинно-зависимых сетевых групп — ещё один способ справиться с изменениями политики. В этом сценарии файл [.filename]#/etc/master.passwd# на каждой системе содержит две строки, начинающиеся с "+". Первая строка добавляет сетевую группу с учётными записями, которым разрешён вход на эту машину, а вторая строка добавляет все остальные учётные записи с оболочкой [.filename]#/usr/sbin/nologin#. Рекомендуется использовать имя сетевой группы в версии "ВСЕ-ЗАГЛАВНЫЕ", соответствующее имени хоста:

source: Once this task is completed on all the machines, there is no longer a need to modify the local versions of [.filename]#/etc/master.passwd# ever again. All further changes can be handled by modifying the NIS map. Here is an example of a possible `netgroup` map for this scenario:
ko: 모든 컴퓨터에서 이 작업을 완료하면 더 이상 [.filename]#/etc/master.passwd#의 로컬 버전을 수정할 필요가 없습니다. 모든 추가 변경 사항은 NIS 맵을 수정하여 처리할 수 있습니다. 다음은 이 시나리오에 사용할 수 있는 `netgroup` 맵의 예시입니다:
ru: После выполнения этой задачи на всех машинах больше не требуется изменять локальные версии файла [.filename]#/etc/master.passwd#. Все дальнейшие изменения можно выполнять, редактируя карту NIS. Вот пример возможной карты `netgroup` для данного сценария:

source: It may not always be advisable to use machine-based netgroups. When deploying a couple of dozen or hundreds of systems, role-based netgroups instead of machine-based netgroups may be used to keep the size of the NIS map within reasonable limits.
ko: 머신 기반 넷그룹을 사용하는 것이 항상 권장되는 것은 아닙니다. 수십 또는 수백 대의 시스템을 배포할 때는 머신 기반 넷그룹 대신 역할 기반 넷그룹을 사용하여 NIS 맵의 크기를 합리적인 한도 내에서 유지할 수 있습니다.
ru: Не всегда целесообразно использовать сетевые группы, привязанные к машинам. При развертывании нескольких десятков или сотен систем можно использовать ролевые сетевые группы вместо машинных, чтобы размер карты NIS оставался в разумных пределах.

source: Password Formats
ko: 패스워드 형식(규칙)
ru: Форматы паролей

source: NIS requires that all hosts within an NIS domain use the same format for encrypting passwords. If users have trouble authenticating on an NIS client, it may be due to a differing password format. In a heterogeneous network, the format must be supported by all operating systems, where DES is the lowest common standard.
ko: NIS에서는 NIS 도메인 내의 모든 호스트가 암호를 암호화할 때 동일한 형식을 사용하도록 요구합니다. 사용자가 NIS 클라이언트에서 인증하는 데 문제가 있는 경우 암호 형식이 다르기 때문일 수 있습니다. 이기종 네트워크에서는 모든 운영 체제에서 이 형식을 지원해야 하며, 여기서 DES는 가장 낮은 공통 표준입니다.
ru: NIS требует, чтобы все хосты в домене NIS использовали одинаковый формат шифрования паролей. Если у пользователей возникают проблемы с аутентификацией на клиенте NIS, это может быть связано с разным форматом паролей. В гетерогенной сети формат должен поддерживаться всеми операционными системами, где DES является минимальным общим стандартом.

source: To check which format a server or client is using, look at this section of [.filename]#/etc/login.conf#:
ko: 서버 또는 클라이언트가 어떤 형식을 사용하는지 확인하려면 [.filename]#/etc/login.conf#의 다음 섹션을 확인하세요:
ru: Чтобы проверить, какой формат использует сервер или клиент, посмотрите на этот раздел в [.filename]#/etc/login.conf#:

source: In this example, the system is using the DES format for password hashing. Other possible values include `blf` for Blowfish, `md5` for MD5, `sha256` and `sha512` for SHA-256 and SHA-512 respectively. For more information and the up to date list of what is available on your system, consult the man:crypt[3] manpage.
ko: 이 예에서는 시스템에서 비밀번호 해싱에 DES 형식을 사용하고 있습니다. 다른 가능한 값으로는 Blowfish의 경우 `blf`, MD5의 경우 `md5`, SHA-256 및 SHA-512의 경우 각각 `sha256` 및 `sha512`가 있습니다. 자세한 정보와 시스템에서 사용할 수 있는 최신 목록은 man:crypt[3] 페이지를 참조하세요.
ru: В этом примере система использует формат DES для хеширования паролей. Другие возможные значения включают `blf` для Blowfish, `md5` для MD5, `sha256` и `sha512` для SHA-256 и SHA-512 соответственно. Для получения дополнительной информации и актуального списка доступных вариантов на вашей системе обратитесь к man:crypt[3].

source: If the format on a host needs to be edited to match the one being used in the NIS domain, the login capability database must be rebuilt after saving the change:
ko: 호스트의 형식을 NIS 도메인에서 사용 중인 형식과 일치하도록 편집해야 하는 경우, 변경 사항을 저장한 후 로그인 기능 데이터베이스를 다시 빌드해야 합니다:
ru: Если формат на хосте необходимо изменить, чтобы он соответствовал формату, используемому в домене NIS, базу данных возможностей входа необходимо перестроить после сохранения изменений:

source: The format of passwords for existing user accounts will not be updated until each user changes their password _after_ the login capability database is rebuilt.
ko: 기존 사용자 계정의 비밀번호 형식은 로그인 기능 데이터베이스가 재구축된 후 각 사용자가 비밀번호를 변경할 때까지 업데이트되지 않습니다.
ru: Формат паролей для существующих учётных записей не будет обновлён, пока каждый пользователь не изменит свой пароль _после_ перестроения базы данных возможностей входа.

source: Lightweight Directory Access Protocol (LDAP)
ko: 경량 디렉터리 액세스 프로토콜 (Lightweight Directory Access Protocol, LDAP)
ru: Протокол LDAP

source: The Lightweight Directory Access Protocol (LDAP) is an application layer protocol used to access, modify, and authenticate objects using a distributed directory information service. Think of it as a phone or record book which stores several levels of hierarchical, homogeneous information. It is used in Active Directory and OpenLDAP networks and allows users to access to several levels of internal information utilizing a single account. For example, email authentication, pulling employee contact information, and internal website authentication might all make use of a single user account in the LDAP server's record base.
ko: LDAP(경량 디렉토리 액세스 프로토콜)는 분산 디렉토리 정보 서비스를 사용하여 개체에 액세스, 수정 및 인증하는 데 사용되는 애플리케이션 계층 프로토콜입니다. 여러 수준의 계층적이고 동질적인 정보를 저장하는 전화번호부라고 생각하면 됩니다. 분산 디렉터리 정보 서비스는 Active Directory 및 OpenLDAP 네트워크에서 사용되며 사용자가 단일 계정을 사용하여 여러 수준의 내부 정보에 액세스할 수 있도록 합니다. 예를 들어 이메일 인증, 직원 연락처 정보 가져오기, 내부 웹사이트 인증은 모두 LDAP 서버의 레코드 베이스에 있는 단일 사용자 계정을 사용할 수 있습니다.
ru: Протокол LDAP (Lightweight Directory Access Protocol) — это протокол уровня приложений, используемый для доступа, изменения и аутентификации объектов с помощью распределённой службы каталогов. Его можно сравнить с телефонной книгой или архивом, который хранит несколько уровней иерархической однородной информации. Он применяется в сетях Active Directory и OpenLDAP, позволяя пользователям получать доступ к различным уровням внутренней информации с использованием одной учётной записи. Например, аутентификация электронной почты, получение контактных данных сотрудников и аутентификация на внутренних веб-сайтах могут осуществляться с помощью одной учётной записи в базе данных LDAP-сервера.

source: This section provides a quick start guide for configuring an LDAP server on a FreeBSD system. It assumes that the administrator already has a design plan which includes the type of information to store, what that information will be used for, which users should have access to that information, and how to secure this information from unauthorized access.
ko: 이 섹션에서는 FreeBSD 시스템에서 LDAP 서버를 구성하기 위한 빠른 시작 가이드를 제공합니다. 여기서는 관리자가 저장할 정보의 유형, 해당 정보가 사용될 용도, 해당 정보에 액세스할 수 있는 사용자, 무단 액세스로부터 해당 정보를 보호하는 방법 등을 포함하는 설계 계획을 이미 가지고 있다고 가정합니다.
ru: В этом разделе представлено краткое руководство по настройке сервера LDAP в системе FreeBSD. Предполагается, что администратор уже имеет продуманный план, включающий тип хранимой информации, её назначение, перечень пользователей с доступом к этой информации и способы защиты от несанкционированного доступа.

source: LDAP Terminology and Structure
ko: LDAP의 용어와 구조
ru: Терминология и структура LDAP

source: LDAP uses several terms which should be understood before starting the configuration. All directory entries consist of a group of _attributes_. Each of these attribute sets contains a unique identifier known as a _Distinguished Name_ (DN) which is normally built from several other attributes such as the common or _Relative Distinguished Name_ (RDN). Similar to how directories have absolute and relative paths, consider a DN as an absolute path and the RDN as the relative path.
ko: LDAP의 구성을 시작하기 전에 이해해야 하는 몇 가지 용어를 설명합니다. 모든 디렉터리 항목은 _속성_ 그룹으로 구성됩니다. 이러한 각 속성 집합에는 _고유 이름 (Distinguished Name, DN)_이라는 고유 식별자가 포함되어 있으며, 일반적으로 공통 또는 _상대 고유 이름 (Relative Distinguished Name, RDN)_과 같은 여러가지 다양한 속성을 기반으로 구축됩니다. 디렉터리에 절대 경로와 상대 경로가 있는 것과 유사하게 DN을 절대 경로로, RDN을 상대 경로로 생각하면 됩니다.
ru: LDAP использует несколько терминов, которые следует понять перед началом настройки. Все записи каталога состоят из группы _атрибутов_. Каждый из этих наборов атрибутов содержит уникальный идентификатор, известный как _Отличительное имя_ (DN — Distinguished Name), который обычно строится из нескольких других атрибутов, таких как общее имя или _Относительное отличительное имя_ (RDN — Relative Distinguished Name). Подобно тому, как каталоги имеют абсолютные и относительные пути, можно рассматривать DN как абсолютный путь, а RDN — как относительный путь.

source: An example LDAP entry looks like the following. This example searches for the entry for the specified user account (`uid`), organizational unit (`ou`), and organization (`o`):
ko: LDAP 항목의 예는 다음과 같습니다. 이 예에서는 지정된 사용자 계정(`uid`), 조직 단위(`ou`) 및 조직(`o`)에 대한 항목을 검색합니다:
ru: Пример записи LDAP выглядит следующим образом. В этом примере выполняется поиск записи для указанной учетной записи пользователя (`uid`), организационного подразделения (`ou`) и организации (`o`):

source: This example entry shows the values for the `dn`, `mail`, `cn`, `uid`, and `telephoneNumber` attributes. The cn attribute is the RDN.
ko: 이 예제 항목은 `dn`, `mail`, `cn`, `uid` 및 `telephoneNumber` 속성에 대한 값을 보여줍니다. cn 특성은 RDN입니다.
ru: Этот пример записи показывает значения атрибутов `dn`, `mail`, `cn`, `uid` и `telephoneNumber`. Атрибут `cn` является RDN.

source: More information about LDAP and its terminology can be found at http://www.openldap.org/doc/admin24/intro.html[http://www.openldap.org/doc/admin24/intro.html].
ko: LDAP 및 해당 용어에 대한 자세한 내용은 http://www.openldap.org/doc/admin24/intro.html[http://www.openldap.org/doc/admin24/intro.html]에서 확인할 수 있습니다.
ru: Дополнительная информация о LDAP и его терминологии доступна по адресу http://www.openldap.org/doc/admin24/intro.html[http://www.openldap.org/doc/admin24/intro.html].

source: Configuring an LDAP Server
ko: LDAP 서버 구성하기
ru: Настройка сервера LDAP

source: FreeBSD does not provide a built-in LDAP server. Begin the configuration by installing package:net/openldap-server[] package or port:
ko: FreeBSD는 내장 LDAP 서버를 제공하지 않습니다. package:net/openldap-server[] 패키지 또는 포트를 설치하여 구성을 시작하세요:
ru: FreeBSD не предоставляет встроенный LDAP-сервер. Начните настройку с установки пакета package:net/openldap-server[] или порта:

source: There is a large set of default options enabled in the extref:{linux-users}[package, software]. Review them by running `pkg info openldap-server`. If they are not sufficient (for example if SQL support is needed), please consider recompiling the port using the appropriate crossref:ports[ports-using,framework].
ko: extref:{linux-users}[package, software]에 활성화된 기본 옵션이 많이 있습니다. `pkg info openldap-server`를 실행하여 검토하세요. 기본 옵션이 충분하지 않은 경우(예: SQL 지원이 필요한 경우) 적절한 crossref:ports[ports-using,framework]를 사용하여 포트를 다시 컴파일하는 것을 고려하세요.
ru: В extref:{linux-users}[пакете, software] включен большой набор параметров по умолчанию. Их можно просмотреть, выполнив команду `pkg info openldap-server`. Если их недостаточно (например, требуется поддержка SQL), рекомендуется перекомпилировать порт с использованием соответствующего crossref:ports[ports-using,фреймворка].

source: The installation creates the directory [.filename]#/var/db/openldap-data# to hold the data. The directory to store the certificates must be created:
ko: 설치하면 데이터를 저장하기 위해 [.filename]#/var/db/openldap-data# 디렉터리가 만들어집니다. 인증서를 저장할 디렉터리를 만들어야 합니다:
ru: Установка создает каталог [.filename]#/var/db/openldap-data# для хранения данных. Необходимо создать каталог для хранения сертификатов:

source: The next phase is to configure the Certificate Authority. The following commands must be executed from [.filename]#/usr/local/etc/openldap/private#. This is important as the file permissions need to be restrictive and users should not have access to these files. More detailed information about certificates and their parameters can be found in crossref:security[openssl,"OpenSSL"]. To create the Certificate Authority, start with this command and follow the prompts:
ko: 다음 단계는 인증 기관(Certificate Authority)을 구성하는 것입니다. 다음 명령은 [.filename]#/usr/local/etc/openldap/private#에서 실행해야 합니다. 파일 권한이 제한적이어야 하며 사용자가 이러한 파일에 액세스할 수 없어야 하므로 이 작업은 매우 중요합니다. 인증서 및 해당 매개변수에 대한 자세한 정보는 crossref:security[openssl,”OpenSSL”]에서 확인할 수 있습니다. 인증 기관을 만들려면 이 명령으로 시작하여 메시지에 따라 진행합니다:
ru: Следующий этап — настройка Центра Сертификации. Следующие команды должны быть выполнены из директории [.filename]#/usr/local/etc/openldap/private#. Это важно, так как права доступа к файлам должны быть строгими, и пользователи не должны иметь доступ к этим файлам. Более подробную информацию о сертификатах и их параметрах можно найти в crossref:security[openssl,"OpenSSL"]. Чтобы создать Центр Сертификации, начните с этой команды и следуйте инструкциям:

source: The entries for the prompts may be generic _except_ for the `Common Name`. This entry must be _different_ than the system hostname. If this will be a self signed certificate, prefix the hostname with `CA` for Certificate Authority.
ko: 프롬프트에 입력할 항목은 `Common Name`을 _제외_하고 대개 일반적인 것들입니다. 이 항목은 시스템 호스트 이름과 반드시 _다른_ 이름이어야 합니다. 자체 서명된 인증서인 경우, 호스트 이름 앞에 인증 기관의 `CA`를 붙입니다.
ru: Записи для запросов могут быть любыми, _за исключением_ `Common Name`. Эта запись должна _отличаться_ от имени хоста системы. Если это будет самоподписанный сертификат, добавьте к имени хоста префикс `CA` — как Центр Сертификации.

source: The next task is to create a certificate signing request and a private key. Input this command and follow the prompts:
ko: 다음 작업은 인증서 서명 요청과 개인 키를 만드는 것입니다. 이 명령을 입력하고 지시를 따릅니다:
ru: Следующая задача — создать запрос на подпись сертификата и закрытый ключ. Введите эту команду и следуйте инструкциям:

source: During the certificate generation process, be sure to correctly set the `Common Name` attribute. The Certificate Signing Request must be signed with the Certificate Authority in order to be used as a valid certificate:
ko: 인증서 생성 과정에서 `Common Name` 속성을 올바르게 설정해야 합니다. 인증서 서명 요청을 유효한 인증서로 사용하려면 인증 기관에서 서명해야 합니다:
ru: В процессе генерации сертификата обязательно правильно укажите атрибут `Common Name`. Запрос на подпись сертификата (Certificate Signing Request) должен быть подписан Центром сертификации, чтобы использоваться в качестве действительного сертификата:

source: The final part of the certificate generation process is to generate and sign the client certificates:
ko: 인증서 생성 프로세스의 마지막 부분은 클라이언트 인증서를 생성하고 서명하는 것입니다:
ru: Заключительная часть процесса генерации сертификатов — создание и подписание клиентских сертификатов:
