Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: ntpd on FreeBSD can start and run as an unprivileged user. Doing so requires the man:mac_ntpd[4] policy module. The [.filename]#/etc/rc.d/ntpd# startup script first examines the NTP configuration. If possible, it loads the `mac_ntpd` module, then starts ntpd as unprivileged user `ntpd` (user id 123). To avoid problems with file and directory access, the startup script will not automatically start ntpd as `ntpd` when the configuration contains any file-related options.
ru: ntpd в FreeBSD может запускаться и работать как непривилегированный пользователь. Для этого требуется модуль политики man:mac_ntpd[4]. Скрипт запуска [.filename]#/etc/rc.d/ntpd# сначала проверяет конфигурацию NTP. Если возможно, он загружает модуль `mac_ntpd`, а затем запускает ntpd как непривилегированный пользователь `ntpd` (идентификатор пользователя 123). Чтобы избежать проблем с доступом к файлам и каталогам, скрипт запуска не будет автоматически запускать ntpd как `ntpd`, если конфигурация содержит любые файлозависимые параметры.

source: The presence of any of the following in `ntpd_flags` requires manual configuration as described below to run as the `ntpd` user:
ko: `ntpd_flags`에 다음 내용이 하나라도 있으면, `ntpd` 사용자를 실행하기 위해 아래에 설명된 대로 수동구성을 해야 합니다:
ru: Присутствие любого из следующих параметров в `ntpd_flags` требует ручной настройки, как описано ниже, для запуска от пользователя `ntpd`:

source: The presence of any of the following keywords in [.filename]#ntp.conf# requires manual configuration as described below to run as the `ntpd` user:
ko: [.filename]#ntp.conf#에 다음 내용이 하나라도 있으면, `ntpd` 사용자를 실행하기 위해 아래에 설명된 대로 수동구성을 해야 합니다:
ru: Наличие любого из следующих ключевых слов в [.filename]#ntp.conf# требует ручной настройки, как описано ниже, для запуска от пользователя `ntpd`:

source: To manually configure ntpd to run as user `ntpd` you must:
ko: 사용자 `ntpd`로 실행되도록 ntpd를 수동구성하려면 다음을 반드시 설정해야 합니다:
ru: Для ручной настройки ntpd для запуска от пользователя `ntpd` необходимо:

source: Ensure that the `ntpd` user has access to all the files and directories specified in the configuration.
ko: ‘ntpd’ 사용자에게, 구성에 지정된 모든 파일과 디렉터리에 대한 액세스 권한이 있는지 확인합니다.
ru: Убедитесь, что пользователь `ntpd` имеет доступ ко всем файлам и каталогам, указанным в конфигурации.

source: Arrange for the `mac_ntpd` module to be loaded or compiled into the kernel. See man:mac_ntpd[4] for details.
ko: `mac_ntpd` 모듈을 커널에 로드하거나 컴파일할 수 있도록 준비합니다. 자세한 내용은 man:mac_ntpd[4]를 참조하십시오.
ru: Обеспечьте загрузку или компиляцию модуля `mac_ntpd` в ядро. Подробности см. в man:mac_ntpd[4].

source: Set `ntpd_user="ntpd"` in [.filename]#/etc/rc.conf#
ko: [.filename]#/etc/rc.conf#에 `ntpd_user="ntpd"`를 설정합니다
ru: Установите `ntpd_user="ntpd"` в [.filename]#/etc/rc.conf#

source: Using NTP with a PPP Connection
ko: PPP 연결로 NTP 사용하기
ru: Использование NTP с PPP-подключением

source: ntpd does not need a permanent connection to the Internet to function properly. However, if a PPP connection is configured to dial out on demand, NTP traffic should be prevented from triggering a dial out or keeping the connection alive. This can be configured with `filter` directives in [.filename]#/etc/ppp/ppp.conf#. For example:
ko: NTP가 제대로 작동하기 위해 인터넷에 영구적으로 연결할 필요는 없습니다. 그러나 PPP 연결이 필요 시 전화 걸기를 하도록 구성된 경우, NTP 트래픽이 전화 걸기를 트리거하거나 연결을 계속 유지하지 못하도록 해야 합니다. 이는 [.filename]#/etc/ppp/ppp.conf#에서 `filter` 지시어를 사용하여 구성할 수 있습니다. 예를 들어:
ru: ntpd не требует постоянного подключения к Интернету для корректной работы. Однако, если PPP-соединение настроено на дозвон по требованию, следует предотвратить инициацию дозвона или поддержание соединения из-за трафика NTP. Это можно настроить с помощью директив `filter` в [.filename]#/etc/ppp/ppp.conf#. Например:

source: For more details, refer to the `PACKET FILTERING` section in man:ppp[8] and the examples in [.filename]#/usr/share/examples/ppp/#.
ko: 보다 자세한 내용은 man:ppp[8]의 `PACKET FILTERING` 섹션과 [.filename]#/usr/share/exples/ppp/#의 예제를 참조하세요.
ru: Для получения более подробной информации обратитесь к разделу `ФИЛЬТРАЦИЯ ПАКЕТОВ` в man:ppp[8] и примерам в [.filename]#/usr/share/examples/ppp/#.

source: Some Internet access providers block low-numbered ports, preventing NTP from functioning since replies never reach the machine.
ko: 일부 인터넷 액세스 제공업체(ISP)는 낮은 번호의 포트를 차단하여 응답이 컴퓨터에 도달하지 않아 NTP가 작동하지 않도록 합니다.
ru: Некоторые интернет-провайдеры блокируют порты с низкими номерами, что мешает работе NTP, так как ответы никогда не достигают машины.

source: iSCSI Initiator and Target Configuration
ko: iSCSI 초기자(Initiator)와 타깃 구성
ru: Настройка инициатора и цели iSCSI

source: iSCSI is a way to share storage over a network. Unlike NFS, which works at the file system level, iSCSI works at the block device level.
ko: iSCSI는 네트워크를 통해 스토리지를 공유하는 방법입니다. 파일 시스템 수준에서 작동하는 NFS와 달리 iSCSI는 블록 장치 수준에서 작동합니다.
ru: iSCSI — это способ совместного использования хранилища по сети. В отличие от NFS, который работает на уровне файловой системы, iSCSI работает на уровне блочного устройства.

source: In iSCSI terminology, the system that shares the storage is known as the _target_. The storage can be a physical disk, or an area representing multiple disks or a portion of a physical disk. For example, if the disk(s) are formatted with ZFS, a zvol can be created to use as the iSCSI storage.
ko: iSCSI 용어로는 스토리지 공유를 제공하는 시스템을 _타깃_이라고 합니다. 스토리지는 물리적 디스크일 수도 있고, 여러 디스크 또는 물리적 디스크의 일부를 나타내는 영역일 수도 있습니다. 예를 들어, 디스크가 ZFS로 포맷된 경우 zvol을 생성하여 iSCSI 스토리지로 사용할 수 있습니다.
ru: В терминологии iSCSI система, предоставляющая хранилище, называется _целью_. Хранилище может быть физическим диском, областью, представляющей несколько дисков, или частью физического диска. Например, если диск(и) отформатированы с использованием ZFS, можно создать zvol для использования в качестве хранилища iSCSI.

source: The clients which access the iSCSI storage are called _initiators_. To initiators, the storage available through iSCSI appears as a raw, unformatted disk known as a LUN. Device nodes for the disk appear in [.filename]#/dev/# and the device must be separately formatted and mounted.
ko: iSCSI 스토리지에 액세스하는 클라이언트를 _초기자(Initiator)_라고 합니다. 초기자가 iSCSI를 통해 사용할 수 있는 스토리지는 LUN이라고 알려진 포맷되지 않은 원시 디스크 형태로 나타납니다. 디스크의 장치 노드는 [.filename]#/dev/#에 나타나며, 장치를 별도로 포맷하고 마운트해야 합니다.
ru: Клиенты, которые обращаются к хранилищу iSCSI, называются _инициаторами_. Для инициаторов хранилище, доступное через iSCSI, отображается как неформатированный диск, известный как LUN (логический номер устройства). Узлы устройств для диска появляются в [.filename]#/dev/#, и устройство должно быть отдельно отформатировано и смонтировано.

source: FreeBSD provides a native, kernel-based iSCSI target and initiator. This section describes how to configure a FreeBSD system as a target or an initiator.
ko: FreeBSD는 기본 커널 기반 iSCSI 타깃과 초기자를 제공합니다. 이 섹션에서는 FreeBSD 시스템을 타깃 또는 초기자로 구성하는 방법을 설명합니다.
ru: FreeBSD предоставляет встроенную поддержку iSCSI целевой системы и инициатора на уровне ядра. В этом разделе описывается, как настроить систему FreeBSD в качестве целевой системы или инициатора.

source: Configuring an iSCSI Target
ko: iSCSI 타깃 구성하기
ru: Настройка цели iSCSI

source: To configure an iSCSI target, create the [.filename]#/etc/ctl.conf# configuration file, add a line to [.filename]#/etc/rc.conf# to make sure the man:ctld[8] daemon is automatically started at boot, and then start the daemon.
ko: iSCSI 타깃을 구성하려면 [.filename]#/etc/ctl.conf# 구성 파일을 만들고 [.filename]#/etc/rc.conf#에 man:ctld[8] 데몬이 부팅 시 자동으로 시작되도록 하는 명령을 추가한 다음 데몬을 시작하세요.
ru: Для настройки цели iSCSI создайте конфигурационный файл [.filename]#/etc/ctl.conf#, добавьте строку в [.filename]#/etc/rc.conf#, чтобы убедиться, что демон man:ctld[8] автоматически запускается при загрузке, а затем запустите демон.

source: The following is an example of a simple [.filename]#/etc/ctl.conf# configuration file. Refer to man:ctl.conf[5] for a complete description of this file's available options.
ru: Вот пример простого файла конфигурации [.filename]#/etc/ctl.conf#. Полное описание доступных опций этого файла можно найти в man:ctl.conf[5].

source: The first entry defines the `pg0` portal group. Portal groups define which network addresses the man:ctld[8] daemon will listen on. The `discovery-auth-group no-authentication` entry indicates that any initiator is allowed to perform iSCSI target discovery without authentication. Lines three and four configure man:ctld[8] to listen on all IPv4 (`listen 0.0.0.0`) and IPv6 (`listen [::]`) addresses on the default port of 3260.
ko: 첫 번째 항목은 `pg0` 포털 그룹을 정의합니다. 포털 그룹은 man:ctld[8] 데몬이 수신 대기할 네트워크 주소를 정의합니다. `discovery-auth-group no-authentication (발견-인증-그룹인증 없음)` 항목은 모든 초기자가 인증 없이 iSCSI 대상 검색을 수행할 수 있도록 허용됨을 나타냅니다. 세 번째와 네 번째 줄은 기본 포트 3260의 모든 IPv4(`listen 0.0.0.0`) 및 IPv6(`listen [::]`) 주소에서 수신 대기하도록 man:ctld[8]을 구성합니다.
ru: Первая запись определяет группу порталов `pg0`. Группы порталов определяют, на каких сетевых адресах будет слушать демон man:ctld[8]. Запись `discovery-auth-group no-authentication` указывает, что любой инициатор может выполнять обнаружение целей iSCSI без аутентификации. Третья и четвёртая строки настраивают man:ctld[8] для прослушивания всех IPv4-адресов (`listen 0.0.0.0`) и IPv6-адресов (`listen [::]`) на стандартном порту 3260.

source: It is not necessary to define a portal group as there is a built-in portal group called `default`. In this case, the difference between `default` and `pg0` is that with `default`, target discovery is always denied, while with `pg0`, it is always allowed.
ko: `default`이라는 기본 포털 그룹이 있으므로 포털 그룹을 정의할 필요가 없습니다. 이 경우 `default`와 `pg0`의 차이점은 `default`를 사용하면 대상 검색이 항상 거부되는 반면 `pg0`을 사용하면 항상 허용된다는 점입니다.
ru: Нет необходимости определять группу порталов, так как существует встроенная группа порталов с именем `default`. В этом случае разница между `default` и `pg0` заключается в том, что для `default` обнаружение целей всегда запрещено, а для `pg0` — всегда разрешено.

source: The second entry defines a single target. Target has two possible meanings: a machine serving iSCSI or a named group of LUNs. This example uses the latter meaning, where `iqn.2012-06.com.example:target0` is the target name. This target name is suitable for testing purposes. For actual use, change `com.example` to the real domain name, reversed. The `2012-06` represents the year and month of acquiring control of that domain name, and `target0` can be any value. Any number of targets can be defined in this configuration file.
ko: 두 번째 항목은 단일 타깃을 정의합니다. 타깃은 두 가지 의미로 사용할 수 있습니다. iSCSI를 제공하는 컴퓨터 또는 명명된 LUN 그룹입니다. 이 예에서는 후자의 의미를 사용하며, 여기서 `iqn.2012-06.com.example:target0`은 타깃 이름입니다. 이 타깃 이름은 테스트 목적으로 적합합니다. 실제 사용하려면 `com.example`을 실제 도메인 이름으로 변경합니다. `2012-06`은 해당 도메인 네임의 제어권을 획득한 연도와 월을 나타내며, `target0`은 어떤 값이라도 사용할 수 있습니다. 이 구성 파일에는 원하는 수의 타깃을 정의할 수 있습니다.
ru: Вторая запись определяет одну цель. У цели есть два возможных значения: машина, обслуживающая iSCSI, или именованная группа LUN. В этом примере используется второе значение, где `iqn.2012-06.com.example:target0` — это имя цели. Это имя цели подходит для тестирования. Для реального использования замените `com.example` на настоящий домен, записанный в обратном порядке. `2012-06` представляет год и месяц получения контроля над этим доменом, а `target0` может быть любым значением. В этом файле конфигурации можно определить любое количество целей.

source: The `auth-group no-authentication` line allows all initiators to connect to the specified target and `portal-group pg0` makes the target reachable through the `pg0` portal group.
ko: `auth-group no-authentication`줄은, 모든 초기자가 지정된 타깃에 연결할 수 있도록 허용하고 `portal-group pg0`은 `pg0` 포털 그룹을 통해 타깃에 연결할 수 있도록 합니다.
ru: Строка `auth-group no-authentication` разрешает всем инициаторам подключаться к указанной цели, а `portal-group pg0` делает цель доступной через группу порталов `pg0`.

source: The next section defines the LUN. To the initiator, each LUN will be visible as a separate disk device. Multiple LUNs can be defined for each target. Each LUN is identified by a number, where LUN 0 is mandatory. The `path /data/target0-0` line defines the full path to a file or zvol backing the LUN. That path must exist before starting man:ctld[8]. The second line is optional and specifies the size of the LUN.
ko: 다음 섹션에서는 LUN을 정의합니다. 초기자에게는 각 LUN이 별도의 디스크 장치로 표시됩니다. 각각의 타깃에 대해 여러 개의 LUN을 정의할 수 있습니다. 각 LUN은 숫자로 식별되며, 여기서 LUN 0은 필수입니다. `path /data/target0-0` 줄은 LUN을 백업한 파일 또는 zvol의 전체 경로를 정의합니다. 이 경로는 man:ctld[8]을 시작하기 전에 반드시 있어야 합니다. 두 번째 줄은 선택 사항이며 LUN의 크기를 지정합니다.
ru: Следующий раздел определяет LUN. Для инициатора каждый LUN будет виден как отдельное дисковое устройство. Для каждой цели можно определить несколько LUN. Каждый LUN идентифицируется числом, где LUN 0 является обязательным. Строка `path /data/target0-0` определяет полный путь к файлу или zvol, который используется для LUN. Этот путь должен существовать до запуска man:ctld[8]. Вторая строка необязательна и указывает размер LUN.

source: Next, to make sure the man:ctld[8] daemon is started at boot, add this line to [.filename]#/etc/rc.conf#:
ko: 다음으로, 부팅 시 man:ctld[8] 데몬이 시작되도록 하려면 [.filename]#/etc/rc.conf#에 다음 내용을 추가합니다:
ru: Далее, чтобы убедиться, что демон man:ctld[8] запускается при загрузке, добавьте эту строку в [.filename]#/etc/rc.conf#:

source: To start man:ctld[8] now, run this command:
ko: 바로 man:ctld[8]을 시작하려면 다음 명령을 실행하세요:
ru: Чтобы запустить man:ctld[8] сейчас, выполните следующую команду:

source: As the man:ctld[8] daemon is started, it reads [.filename]#/etc/ctl.conf#. If this file is edited after the daemon starts, use this command so that the changes take effect immediately:
ko: man:ctld[8] 데몬이 시작되면 [.filename]#/etc/ctl.conf#를 읽습니다. 데몬이 시작된 후 이 파일을 편집하는 경우 다음 명령을 사용하면 변경 사항이 즉시 적용됩니다:
ru: Поскольку демон man:ctld[8] запускается, он читает файл [.filename]#/etc/ctl.conf#. Если этот файл был изменён после запуска демона, используйте следующую команду, чтобы изменения вступили в силу немедленно:

source: Authentication
ko: 인증
ru: Аутентификация

source: The previous example is inherently insecure as it uses no authentication, granting anyone full access to all targets. To require a username and password to access targets, modify the configuration as follows:
ko: 이전 예는 인증을 사용하지 않아, 모든 대상에 대한 전체 액세스 권한을 누구에게나 부여하므로 본질적으로 안전하지 않습니다. 대상에 액세스하기 위해 사용자 이름과 비밀번호를 요구하려면 다음과 같이 구성을 수정합니다:
ru: Предыдущий пример изначально небезопасен, так как не использует аутентификацию, предоставляя любому полный доступ ко всем целям. Чтобы потребовать имя пользователя и пароль для доступа к целям, измените конфигурацию следующим образом:

source: The `auth-group` section defines username and password pairs. An initiator trying to connect to `iqn.2012-06.com.example:target0` must first specify a defined username and secret. However, target discovery is still permitted without authentication. To require target discovery authentication, set `discovery-auth-group` to a defined `auth-group` name instead of `no-authentication`.
ko: `auth-group` 섹션은 사용자 이름과 암호 쌍을 정의합니다. `iqn.2012-06.com.example:target0`에 연결하려는 초기자는 먼저 정의된 사용자 이름과 암호를 제공해야 합니다. 그러나 단순 타깃 검색은 인증 없이도 허용됩니다. 타깃 검색에도 인증을 요구하려면 `discovery-auth-group`을 `no-authentication` 대신 정의된 `auth-group` 이름으로 설정합니다.
ru: Раздел `auth-group` определяет пары имени пользователя и пароля. Инициатор, пытающийся подключиться к `iqn.2012-06.com.example:target0`, должен сначала указать определённое имя пользователя и секрет. Однако обнаружение цели по-прежнему разрешено без аутентификации. Чтобы потребовать аутентификацию при обнаружении цели, установите `discovery-auth-group` в определённое имя `auth-group` вместо `no-authentication`.

source: It is common to define a single exported target for every initiator. As a shorthand for the syntax above, the username and password can be specified directly in the target entry:
ko: 모든 초기자에 대해 하나의 타깃만 내보내는 것이 일반적입니다. 위의 구문을 줄여서 사용자 이름과 비밀번호를 타깃 항목에 직접 지정할 수 있습니다:
ru: Обычно определяют один экспортируемый объект для каждого инициатора. В качестве сокращения для синтаксиса выше, имя пользователя и пароль могут быть указаны непосредственно в записи объекта:

source: Configuring an iSCSI Initiator
ko: iSCSI 초기자 구성하기
ru: Настройка инициатора iSCSI

source: The iSCSI initiator described in this section is supported starting with FreeBSD 10.0-RELEASE. To use the iSCSI initiator available in older versions, refer to man:iscontrol[8].
ko: 이 섹션에서 설명하는 iSCSI 초기자는 FreeBSD 10.0-RELEASE부터 지원됩니다. 이전 버전에서도 사용할 수 있는 iSCSI 초기자를 사용하려면 man:iscontrol[8]을 참조하십시오.
ru: Описаный в этом разделе инициатор iSCSI поддерживается начиная с FreeBSD 10.0-RELEASE. Для использования инициатора iSCSI, доступного в более старых версиях, обратитесь к man:iscontrol[8].

source: The iSCSI initiator requires that the man:iscsid[8] daemon is running. This daemon does not use a configuration file. To start it automatically at boot, add this line to [.filename]#/etc/rc.conf#:
ko: iSCSI 초기자를 사용하려면 man:iscsid[8] 데몬이 실행 중이어야 합니다. 이 데몬은 구성 파일을 사용하지 않습니다. 부팅 시 자동으로 시작하려면 [.filename]#/etc/rc.conf#에 다음 내용을 추가합니다:
ru: Инициатору iSCSI требуется, чтобы демон man:iscsid[8] был запущен. Этот демон не использует файл конфигурации. Для его автоматического запуска при загрузке добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: To start man:iscsid[8] now, run this command:
ko: 바로 man:iscsid[8]을 시작하려면 다음 명령을 사용하세요:
ru: Чтобы сейчас запустить man:iscsid[8], выполните следующую команду:

source: Connecting to a target can be done with or without an [.filename]#/etc/iscsi.conf# configuration file. This section demonstrates both types of connections.
ko: 타깃에 연결할 때 [.filename]#/etc/iscsi.conf# 구성 파일을 사용하거나 사용하지 않고 연결할 수 있습니다. 이 섹션에서는 두 가지 유형의 연결을 모두 보여줍니다.
ru: Подключение к цели может быть выполнено с файлом конфигурации [.filename]#/etc/iscsi.conf# или без него. В этом разделе показаны оба типа подключений.

source: Connecting to a Target Without a Configuration File
ko: 구성파일 없이 타깃에 연결하기
ru: Подключение к цели без файла конфигурации

source: To connect an initiator to a single target, specify the IP address of the portal and the name of the target:
ko: 초기자를 단일 대상에 연결하려면 포털의 IP 주소와 타깃의 이름을 지정합니다:
ru: Для подключения инициатора к одному целевому устройству укажите IP-адрес портала и имя целевого устройства:

source: To verify if the connection succeeded, run `iscsictl` without any arguments. The output should look similar to this:
ko: 연결이 성공했는지 확인하려면 인자 없이 `iscsictl`을 실행합니다. 출력은 다음과 비슷해야 합니다:
ru: Для проверки успешности соединения выполните команду `iscsictl` без аргументов. Вывод должен выглядеть примерно так:

source: In this example, the iSCSI session was successfully established, with [.filename]#/dev/da0# representing the attached LUN. If the `iqn.2012-06.com.example:target0` target exports more than one LUN, multiple device nodes will be shown in that section of the output:
ko: 이 예제에서는 [.filename]#/dev/da0#이 연결된 LUN을 나타내며 iSCSI 세션이 성공적으로 설정되었습니다. `iqn.2012-06.com.example:target0` 타깃이 둘 이상의 LUN을 내보내는 경우 출력의 해당 섹션에 여러 장치 노드가 표시됩니다:
ru: В этом примере сеанс iSCSI был успешно установлен, где [.filename]#/dev/da0# представляет подключённый LUN. Если цель `iqn.2012-06.com.example:target0` экспортирует более одного LUN, в соответствующем разделе вывода будет показано несколько устройств:

source: Any errors will be reported in the output, as well as the system logs. For example, this message usually means that the man:iscsid[8] daemon is not running:
ko: 모든 오류는 출력과 시스템 로그에 기록됩니다. 예를 들어, 다음 메시지는 일반적으로 man:iscsid[8] 데몬이 실행되고 있지 않음을 의미합니다:
ru: Любые ошибки будут отображены в выводе, а также в системных журналах. Например, это сообщение обычно означает, что демон man:iscsid[8] не запущен:

source: The following message suggests a networking problem, such as a wrong IP address or port:
ko: 다음 메시지는 잘못된 IP 주소 또는 포트와 같은 네트워킹 문제를 나타냅니다:
ru: Следующее сообщение указывает на проблему с сетью, например, неверный IP-адрес или порт:

source: This message means that the specified target name is wrong:
ko: 이 메시지는 지정한 타깃 이름이 잘못되었다는 의미입니다:
ru: Это сообщение означает, что указано неправильное имя цели:

source: This message means that the target requires authentication:
ko: 이 메시지는 타깃에 인증이 필요하다는 것을 의미합니다:
ru: Это сообщение означает, что цель требует аутентификации:

source: To specify a CHAP username and secret, use this syntax:
ko: CHAP 사용자 이름과 비밀번호를 지정하려면 다음 구문을 사용합니다:
ru: Чтобы указать имя пользователя CHAP и секрет, используйте следующий синтаксис:

source: Connecting to a Target with a Configuration File
ko: 구성파일로 타깃에 연결하기
ru: Подключение к цели с использованием файла конфигурации

source: To connect using a configuration file, create [.filename]#/etc/iscsi.conf# with contents like this:
ko: 구성 파일을 사용하여 연결하려면 다음과 같은 내용으로 [.filename]#/etc/iscsi.conf#를 생성합니다:
ru: Для подключения с использованием файла конфигурации создайте файл [.filename]#/etc/iscsi.conf# с содержимым, подобным этому:

source: The `t0` specifies a nickname for the configuration file section. It will be used by the initiator to specify which configuration to use. The other lines specify the parameters to use during connection. The `TargetAddress` and `TargetName` are mandatory, whereas the other options are optional. In this example, the CHAP username and secret are shown.
ko: `t0`은 구성 파일 섹션의 별명을 지정합니다. 이 별명은 초기자가 사용할 구성을 지정하는 데 사용됩니다. 다른 줄은 연결 중 사용할 매개변수를 지정합니다. `TargetAddress`와 `TargetName`은 필수이고 다른 옵션은 선택 사항입니다. 이 예에서는 CHAP 사용자 이름과 비밀번호가 표시됩니다.
ru: `t0` задаёт псевдоним для раздела конфигурационного файла. Он будет использоваться инициатором для указания, какую конфигурацию применять. Остальные строки определяют параметры, используемые при подключении. `TargetAddress` и `TargetName` являются обязательными, тогда как остальные параметры — опциональными. В этом примере показаны имя пользователя CHAP и секретный ключ.

source: To connect to the defined target, specify the nickname:
ko: 지정된 타깃에만 연결하기 위해 정확한 별명을 지정해 주세요:
ru: Для подключения к указанной цели укажите псевдоним:

source: Alternately, to connect to all targets defined in the configuration file, use:
ko: 구성파일에 있는 모든 타깃에 연결하기 위해서는 다음을 사용하세요:
ru: Или для подключения ко всем целям, определенным в файле конфигурации, используйте:

source: To make the initiator automatically connect to all targets in [.filename]#/etc/iscsi.conf#, add the following to [.filename]#/etc/rc.conf#:
ko: 초기자가 [.filename]#/etc/iscsi.conf#의 모든 타깃에 자동으로 연결되도록 하려면 [.filename]#/etc/rc.conf#에 다음을 추가합니다:
ru: Чтобы инициатор автоматически подключался ко всем целям в [.filename]#/etc/iscsi.conf#, добавьте следующее в [.filename]#/etc/rc.conf#:

source: Chapter 31. Network Servers
ko: 31장. 네트워크 서버

source: {wait|nowait}[/max-child[/max-connections-per-ip-per-minute[/max-child-per-ip]]]:: In this field, `wait` or `nowait` must be specified. `max-child`, `max-connections-per-ip-per-minute` and `max-child-per-ip` are optional.
ko: {wait|nowait}[/max-child[/max-connections-per-ip-per-minute[/max-child-per-ip]]]:: 이 필드에는 `wait` 또는 `nowait`을 지정해야 합니다. `max-child`, `max-connections-per-ip-per-minute` 및 `max-child-per-ip` 는 선택 사항입니다.

source: Some applications require file locking to operate correctly. To enable locking, add these lines to [.filename]#/etc/rc.conf# on both the client and server:
ko: 일부 애플리케이션이 제대로 작동하려면 파일 잠금이 필요합니다. 잠금을 사용하려면 클라이언트와 서버 모두에서 [.filename]#/etc/rc.conf#에 다음 줄을 추가하세요:

source: Then start the applications:
ko: 그리고나서 애플리케이션을 시작하세요:
