Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: Samba is a popular open source software package that provides file and print services using the SMB/CIFS protocol. This protocol is built into Microsoft(R) Windows(R) systems. It can be added to non-Microsoft(R) Windows(R) systems by installing the Samba client libraries. The protocol allows clients to access shared data and printers. These shares can be mapped as a local disk drive and shared printers can be used as if they were local printers.
ko: Samba는 SMB/CIFS 프로토콜을 사용하여 파일 및 인쇄 서비스를 제공하는 인기 있는 오픈 소스 소프트웨어 패키지입니다. 이 프로토콜은 Microsoft(R) Windows(R) 시스템에 내장되어 있습니다. Samba 클라이언트 라이브러리를 설치하여 비 Windows(R) 시스템에도 사용할 수 있습니다. 이 프로토콜을 통해 클라이언트는 공유 데이터와 프린터에 액세스할 수 있습니다. 이러한 공유는 로컬 디스크 드라이브로 매핑할 수 있으며 공유 프린터를 로컬 프린터처럼 사용할 수 있습니다.
ru: Samba — это популярный пакет открытого программного обеспечения, предоставляющий файловые и печатные услуги с использованием протокола SMB/CIFS. Этот протокол встроен в системы Microsoft(R) Windows(R). Он может быть добавлен в системы, отличные от Microsoft(R) Windows(R), путем установки клиентских библиотек Samba. Протокол позволяет клиентам получать доступ к общим данным и принтерам. Эти ресурсы могут быть отображены как локальный диск, а общие принтеры могут использоваться так, как если бы они были локальными.

source: On FreeBSD, the Samba client libraries can be installed using the package:net/samba416[] port or package. The client provides the ability for a FreeBSD system to access SMB/CIFS shares in a Microsoft(R) Windows(R) network.
ru: На FreeBSD клиентские библиотеки Samba могут быть установлены с помощью порта или пакета package:net/samba416[]. Клиент предоставляет возможность системе FreeBSD получать доступ к общим ресурсам SMB/CIFS в сети Microsoft(R) Windows(R).

source: A FreeBSD system can also be configured to act as a Samba server by installing the same package:net/samba416[] port or package. This allows the administrator to create SMB/CIFS shares on the FreeBSD system which can be accessed by clients running Microsoft(R) Windows(R) or the Samba client libraries.
ru: Система FreeBSD также может быть настроена в качестве сервера Samba путем установки порта или пакета package:net/samba416[]. Это позволяет администратору создавать общие ресурсы SMB/CIFS на системе FreeBSD, к которым могут обращаться клиенты под управлением Microsoft(R) Windows(R) или использующие клиентские библиотеки Samba.

source: Server Configuration
ko: 서버 구성
ru: Конфигурация сервера

source: Samba is configured in [.filename]#/usr/local/etc/smb4.conf#. This file must be created before Samba can be used.
ko: Samba는 [.filename]#/usr/local/etc/smb4.conf#에 구성내용을 저장합니다. 이 파일을 생성해야 Samba를 사용할 수 있습니다.
ru: Samba настраивается в файле [.filename]#/usr/local/etc/smb4.conf#. Этот файл должен быть создан до начала использования Samba.

source: A simple [.filename]#smb4.conf# to share directories and printers with Windows(R) clients in a workgroup is shown here. For more complex setups involving LDAP or Active Directory, it is easier to use man:samba-tool[8] to create the initial [.filename]#smb4.conf#.
ko: 여기에는 작업 그룹의 Windows(R) 클라이언트와 디렉터리 및 프린터를 공유하기 위한 간단한 [.filename]#smb4.conf#이 나와 있습니다. LDAP 또는 Active Directory와 관련된 더 복잡한 설정의 경우, man:samba-tool[8]을 사용하여 초기 [.filename]#smb4.conf#를 만드는 것이 더 쉽습니다.
ru: Простой пример [.filename]#smb4.conf# для общего доступа к каталогам и принтерам с клиентами Windows(R) в рабочей группе показан ниже. Для более сложных настроек, включающих LDAP или Active Directory, проще использовать man:samba-tool[8] для создания начального [.filename]#smb4.conf#.

source: Global Settings
ko: 글로벌 설정
ru: Глобальные Настройки

source: Settings that describe the network are added in [.filename]#/usr/local/etc/smb4.conf#:
ko: 네트워크를 설명하는 설정은 [.filename]#/usr/local/etc/smb4.conf#에 기록됩니다:
ru: Настройки, описывающие сеть, добавляются в [.filename]#/usr/local/etc/smb4.conf#:

source: The name of the workgroup to be served.
ko: 서비스를 제공할 작업 그룹의 이름.
ru: Имя рабочей группы, которая будет обслуживаться.

source: The NetBIOS name by which a Samba server is known. By default, it is the same as the first component of the host's DNS name.
ko: Samba 서버로 알려진 NetBIOS 이름입니다. 기본적으로 호스트 DNS 이름의 첫 번째 구성 요소와 동일합니다.
ru: Имя NetBIOS, под которым известен сервер Samba. По умолчанию оно совпадает с первой частью DNS-имени хоста.

source: The string that will be displayed in the output of `net view` and some other networking tools that seek to display descriptive text about the server.
ko: `net view` 출력에 표시될 내용과 서버에 대한 설명을 찾아 표시하기 위한 네트워크 툴.
ru: Строка, которая будет отображаться в выводе команды `net view` и некоторых других сетевых инструментов, предназначенных для отображения описательного текста о сервере.

source: Whether Samba will act as a WINS server. Do not enable support for WINS on more than one server on the network.
ko: Samba가 WINS 서버로 작동할지 여부. 네트워크에 있는 둘 이상의 서버에서 WINS 지원을 사용하도록 설정하지 마세요.
ru: Будет ли Samba выступать в качестве сервера WINS. Не следует включать поддержку WINS более чем на одном сервере в сети.

source: Security Settings
ko: 보안 세팅
ru: Настройки Безопасности

source: The most important settings in [.filename]#/usr/local/etc/smb4.conf# are the security model and the backend password format. These directives control the options:
ko: [.filename]#/usr/local/etc/smb4.conf#에서 가장 중요한 설정은 보안 모델과 백엔드 비밀번호 형식입니다. 이 지시어는 옵션을 제어합니다:
ru: Важнейшие настройки в [.filename]#/usr/local/etc/smb4.conf# — это модель безопасности и формат хранения паролей. Эти параметры управляются следующими директивами:

source: If the clients use usernames that are the same as their usernames on the FreeBSD machine, user level security should be used. `security = user` is the default security policy and it requires clients to first log on before they can access shared resources.
ru: Если клиенты используют имена пользователей, совпадающие с их именами на машине FreeBSD, следует использовать уровень безопасности пользователя. `security = user` — это политика безопасности по умолчанию, которая требует от клиентов сначала войти в систему, прежде чем они смогут получить доступ к общим ресурсам.

source: Refer to man:smb.conf[5] to learn about other supported settings for the `security` option.
ru: Обратитесь к man:smb.conf[5], чтобы узнать о других поддерживаемых настройках для опции `security`.

source: Samba has several different backend authentication models. Clients may be authenticated with LDAP, NIS+, an SQL database, or a modified password file. The recommended authentication method, `tdbsam`, is ideal for simple networks and is covered here. For larger or more complex networks, `ldapsam` is recommended. `smbpasswd` was the former default and is now obsolete.
ko: Samba에는 여러 가지 백엔드 인증 모델이 있습니다. 클라이언트는 LDAP, NIS+, SQL 데이터베이스 또는 수정된 비밀번호 파일로 인증될 수 있습니다. 권장 인증 방법인 `tdbsam`은 간단한 네트워크에 이상적이며 여기에서 다루고 있습니다. 규모가 크거나 복잡한 네트워크의 경우 `ldapsam`을 사용하는 것이 좋습니다. `smbpasswd`는 이전 기본값이었으나 지금은 더 이상 사용되지 않습니다.
ru: Samba поддерживает несколько различных моделей аутентификации на стороне сервера. Клиенты могут быть аутентифицированы с помощью LDAP, NIS+, SQL-базы данных или модифицированного файла паролей. Рекомендуемый метод аутентификации `tdbsam` идеально подходит для простых сетей, и мы его рассмотрим здесь. Для более крупных или сложных сетей рекомендуется `ldapsam`. `smbpasswd` был прежним методом по умолчанию и теперь устарел.

source: Samba Users
ko: Samba 사용자
ru: Пользователи Samba

source: FreeBSD user accounts must be mapped to the `SambaSAMAccount` database for Windows(R) clients to access the share. Map existing FreeBSD user accounts using man:pdbedit[8]:
ko: Windows(R) 클라이언트가 공유에 액세스하려면 FreeBSD 사용자 계정이 `SambaSAMAccount` 데이터베이스에 매핑되어 있어야 합니다. man:pdbedit[8]을 사용하여 기존 FreeBSD 사용자 계정을 매핑합니다:
ru: Пользовательские учетные записи FreeBSD должны быть сопоставлены с базой данных `SambaSAMAccount` для доступа клиентов Windows(R) к общему ресурсу. Сопоставьте существующие учетные записи FreeBSD с помощью man:pdbedit[8]:

source: This section has only mentioned the most commonly used settings. Refer to the https://wiki.samba.org[Official Samba Wiki] for additional information about the available configuration options.
ko: 이 섹션에서는 가장 일반적으로 사용되는 설정만 언급했습니다. 사용 가능한 구성 옵션에 대한 자세한 내용은 https://wiki.samba.org[공식 삼바 위키]를 참조하세요.
ru: В этом разделе упомянуты только наиболее часто используемые настройки. Дополнительную информацию о доступных параметрах конфигурации можно найти на https://wiki.samba.org[Официальном вики Samba].

source: Starting Samba
ko: Samba 시작하기
ru: Начало работы с Samba

source: To enable Samba at boot time, add the following line to [.filename]#/etc/rc.conf#:
ko: 부팅 시 Samba를 활성화하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:
ru: Чтобы включить Samba при загрузке, добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: To start Samba now:
ko: 바로 Samba를 시작하려면:
ru: Чтобы сейчас запустить Samba:

source: Samba consists of three separate daemons. Both the nmbd and smbd daemons are started by `samba_enable`. If winbind name resolution is also required, set:
ko: Samba는 세 개의 별도 데몬으로 구성됩니다. nmbd 및 smbd 데몬은 모두 `samba_enable`에 의해 시작됩니다. 만약 winbind 이름 확인이 필요하다면 설정합니다:
ru: Samba состоит из трёх отдельных демонов. Оба демона nmbd и smbd запускаются параметром `samba_enable`. Если также требуется разрешение имён через winbind, укажите:

source: Samba can be stopped at any time by typing:
ko: Samba는 언제든지 다음 명령으로 중지할 수 있습니다:
ru: Samba можно остановить в любой момент, набрав:

source: Samba is a complex software suite with functionality that allows broad integration with Microsoft(R) Windows(R) networks. For more information about functionality beyond the basic configuration described here, refer to https://www.samba.org[https://www.samba.org].
ko: Samba는 Microsoft(R) Windows(R) 네트워크와 광범위하게 통합할 수 있는 기능을 갖춘 복잡한 소프트웨어 제품군입니다. 여기에 설명된 기본 구성 이외의 기능에 대한 자세한 내용은 https://www.samba.org[https://www.samba.org]를 참조하세요.
ru: Samba — это комплексный программный комплект, функциональность которого обеспечивает широкую интеграцию с сетями Microsoft(R) Windows(R). Для получения дополнительной информации о возможностях, выходящих за рамки базовой конфигурации, описанной здесь, обратитесь к https://www.samba.org[https://www.samba.org].

source: Clock Synchronization with NTP
ko: NTP로 시간 동기화
ru: Синхронизация времени с помощью NTP

source: Over time, a computer's clock is prone to drift. This is problematic as many network services require the computers on a network to share the same accurate time. Accurate time is also needed to ensure that file timestamps stay consistent. The Network Time Protocol (NTP) is one way to provide clock accuracy in a network.
ko: 시간이 지남에 따라 컴퓨터의 시계는 오차가 생기기 쉽습니다. 이는 많은 네트워크 서비스에서 네트워크상의 컴퓨터가 정확하고 동일한 시간을 공유해야 하기 때문에 문제가 됩니다. 파일 타임스탬프가 일관성을 유지하려면 정확한 시간이 필요합니다. NTP(네트워크 시간 프로토콜)는 네트워크에서 시계 정확도를 제공하는 하나의 방법입니다.
ru: Со временем часы компьютера могут отставать или спешить. Это создаёт проблемы, так как многие сетевые службы требуют, чтобы компьютеры в сети использовали одинаковое точное время. Точное время также необходимо для обеспечения согласованности временных меток файлов. Протокол сетевого времени (NTP — Network Time Protocol) — это один из способов обеспечить точность часов в сети.

source: FreeBSD includes man:ntpd[8] which can be configured to query other NTP servers to synchronize the clock on that machine or to provide time services to other computers in the network.
ko: FreeBSD에는 다른 NTP 서버를 쿼리하여 해당 컴퓨터의 시계를 동기화하거나 네트워크의 다른 컴퓨터에 시간 서비스를 제공하도록 구성할 수 있는 man:ntpd[8]가 포함되어 있습니다.
ru: FreeBSD включает man:ntpd[8], который можно настроить для запроса к другим серверам NTP с целью синхронизации часов на этом компьютере или для предоставления сервиса времени другим компьютерам в сети.

source: This section describes how to configure ntpd on FreeBSD. Further documentation can be found in [.filename]#/usr/share/doc/ntp/# in HTML format.
ko: 이 섹션에서는 FreeBSD에서 ntpd를 구성하는 방법을 설명합니다. 자세한 문서는 [.filename]#/usr/share/doc/ntp/#에서 HTML 형식으로 찾을 수 있습니다.
ru: В этом разделе описывается, как настроить ntpd в FreeBSD. Дополнительная документация доступна в [.filename]#/usr/share/doc/ntp/# в формате HTML.

source: NTP Configuration
ko: NTP 구성
ru: Конфигурация NTP

source: On FreeBSD, the built-in ntpd can be used to synchronize a system's clock. ntpd is configured using man:rc.conf[5] variables and [.filename]#/etc/ntp.conf#, as detailed in the following sections.
ko: FreeBSD에서는 내장된 ntpd를 사용하여 시스템 시계를 동기화할 수 있습니다. ntpd는 다음 섹션에 자세히 설명된 대로 man:rc.conf[5] 변수와 [.filename]#/etc/ntp.conf#를 사용하여 구성합니다.
ru: На FreeBSD встроенный ntpd может использоваться для синхронизации системных часов. Настройка ntpd осуществляется с помощью переменных man:rc.conf[5] и файла [.filename]#/etc/ntp.conf#, как подробно описано в следующих разделах.

source: ntpd communicates with its network peers using UDP packets. Any firewalls between your machine and its NTP peers must be configured to allow UDP packets in and out on port 123.
ko: NTP는 UDP 패킷을 사용하여 네트워크 피어와 통신합니다. 컴퓨터와 NTP 피어 사이의 모든 방화벽은 포트 123에서 UDP 패킷의 입출력을 허용하도록 구성되어야 합니다.
ru: ntpd взаимодействует с сетевыми узлами с помощью UDP-пакетов. Любые межсетевые экраны между вашей машиной и её NTP-узлами должны быть настроены так, чтобы разрешать входящие и исходящие UDP-пакеты через порт 123.

source: The [.filename]#/etc/ntp.conf# file
ko: [.filename]#/etc/ntp.conf# 파일
ru: Файл [.filename]#/etc/ntp.conf#

source: ntpd reads [.filename]#/etc/ntp.conf# to determine which NTP servers to query. Choosing several NTP servers is recommended in case one of the servers becomes unreachable or its clock proves unreliable. As ntpd receives responses, it favors reliable servers over the less reliable ones. The servers which are queried can be local to the network, provided by an ISP, or selected from an http://support.ntp.org/bin/view/Servers/WebHome[ online list of publicly accessible NTP servers]. When choosing a public NTP server, select one that is geographically close and review its usage policy. The `pool` configuration keyword selects one or more servers from a pool of servers. An http://support.ntp.org/bin/view/Servers/NTPPoolServers[ online list of publicly accessible NTP pools] is available, organized by geographic area. In addition, FreeBSD provides a project-sponsored pool, `0.freebsd.pool.ntp.org`.
ko: ntpd는 [.filename]#/etc/ntp.conf#를 읽어 쿼리할 NTP 서버를 결정합니다. 서버 중 하나에 연결할 수 없거나 시계가 불안정할 경우를 대비하여 여러 개의 NTP 서버를 선택하는 것이 좋습니다. ntpd는 응답을 받을때 신뢰성이 낮은 서버보다 안정적인 서버를 선호합니다. 쿼리되는 서버는 네트워크에 로컬로 연결되어 있거나, ISP에서 제공하거나, http://support.ntp.org/bin/view/Servers/WebHome[ 공개적으로 액세스할 수 있는 NTP 서버의 온라인 목록]에서 선택할 수 있습니다. 공용 NTP 서버를 선택할 때는 지리적으로 가까운 서버를 선택하고 해당 서버의 사용 정책을 검토하세요. `pool` 구성 키워드는 서버 풀에서 하나 이상의 서버를 선택합니다. http://support.ntp.org/bin/view/Servers/NTPPoolServers[ 공개적으로 액세스 가능한 NTP 풀의 온라인 목록]은 지역별로 정리되어 있습니다. 또한, FreeBSD는 프로젝트가 후원하는 풀인 `0.freebsd.pool.ntp.org`를 제공합니다.
ru: ntpd читает файл [.filename]#/etc/ntp.conf#, чтобы определить, к каким серверам NTP обращаться. Рекомендуется выбирать несколько серверов NTP на случай, если один из серверов станет недоступен или его часы окажутся ненадёжными. По мере получения ответов ntpd отдаёт предпочтение более надёжным серверам перед менее надёжными. Запрашиваемые серверы могут быть локальными в сети, предоставляться ISP или выбираться из http://support.ntp.org/bin/view/Servers/WebHome[онлайн-списка общедоступных серверов NTP]. При выборе общедоступного сервера NTP следует выбирать сервер, географически близкий к вам, и ознакомиться с его политикой использования. Ключевое слово `pool` в конфигурации выбирает один или несколько серверов из пула серверов. Доступен http://support.ntp.org/bin/view/Servers/NTPPoolServers[онлайн-список общедоступных пулов NTP], организованный по географическим регионам. Кроме того, FreeBSD предоставляет спонсируемый проектом пул `0.freebsd.pool.ntp.org`.

source: Sample [.filename]#/etc/ntp.conf#
ko: [.filename]#/etc/ntp.conf# 예시
ru: Пример [.filename]#/etc/ntp.conf#

source: This is a simple example of an [.filename]#ntp.conf# file. It can safely be used as-is; it contains the recommended `restrict` options for operation on a publicly-accessible network connection.
ko: 다음은 [.filename]#ntp.conf# 파일의 간단한 예입니다. 이 파일은 공개적으로 액세스할 수 있는 네트워크 연결에서 작동하기 위해 권장되는 `restrict` 옵션이 포함되어 있으므로 그대로 사용해도 안전합니다.
ru: Вот простой пример файла [.filename]#ntp.conf#. Его можно безопасно использовать в таком виде; он содержит рекомендуемые параметры `restrict` для работы в общедоступном сетевом подключении.

source: The format of this file is described in man:ntp.conf[5]. The descriptions below provide a quick overview of just the keywords used in the sample file above.
ko: 이 파일의 형식은 man:ntp.conf[5]에 설명되어 있습니다. 아래 설명은 위의 샘플 파일에 사용된 키워드에 대한 간략한 개요를 제공합니다.
ru: Формат этого файла описан в man:ntp.conf[5]. Приведённые ниже описания дают краткий обзор только ключевых слов, использованных в примере файла выше.

source: By default, an NTP server is accessible to any network host. The `restrict` keyword controls which systems can access the server. Multiple `restrict` entries are supported, each one refining the restrictions given in previous statements. The values shown in the example grant the local system full query and control access, while allowing remote systems only the ability to query the time. For more details, refer to the `Access Control Support` subsection of man:ntp.conf[5].
ko: 기본적으로 NTP 서버는 모든 네트워크 호스트에서 액세스할 수 있습니다. `restrict` 키워드는 서버에 액세스할 수 있는 시스템을 제어합니다. 여러 개의 `restrict` 항목이 지원되며, 각 항목은 이전 문장에서 제공된 제한을 구체화합니다. 예제에 표시된 값은 로컬 시스템에는 전체 쿼리 및 제어 액세스 권한을 부여하고 원격 시스템에는 시간 쿼리 기능만 허용합니다. 자세한 내용은 man:ntp.conf[5]의 `Access Control Support` 하위 섹션을 참조하세요.
ru: По умолчанию сервер NTP доступен для любого узла сети. Ключевое слово `restrict` управляет тем, какие системы могут обращаться к серверу. Поддерживается несколько записей `restrict`, каждая из которых уточняет ограничения, заданные в предыдущих утверждениях. Значения, указанные в примере, предоставляют локальной системе полный доступ для запросов и управления, в то время как удалённые системы могут только запрашивать время. Для получения дополнительной информации обратитесь к подразделу `Access Control Support` в man:ntp.conf[5].

source: The `server` keyword specifies a single server to query. The file can contain multiple server keywords, with one server listed on each line. The `pool` keyword specifies a pool of servers. ntpd will add one or more servers from this pool as needed to reach the number of peers specified using the `tos minclock` value. The `iburst` keyword directs ntpd to perform a burst of eight quick packet exchanges with a server when contact is first established, to help quickly synchronize system time.
ko: `server` 키워드는 쿼리할 단일 서버를 지정합니다. 파일에는 여러 서버 키워드를 포함할 수 있으며, 각 줄에 하나의 서버가 나열됩니다. `pool` 키워드는 서버 풀을 지정합니다. 이 풀에 있는 하나 이상의 서버를 필요에 따라 추가하여 `tos minclock` 값을 사용하여 지정한 피어 수에 도달합니다. `iburst` 키워드는 접속이 처음 설정될 때 서버와 8번의 빠른 패킷 교환을 수행하여 시스템 시간을 빠르게 동기화하도록 ntpd에 지시합니다.
ru: Ключевое слово `server` указывает отдельный сервер для запросов. Файл может содержать несколько ключевых слов `server`, по одному серверу на каждой строке. Ключевое слово `pool` определяет пул серверов. ntpd добавит один или несколько серверов из этого пула по мере необходимости, чтобы достичь количества узлов, указанного с помощью значения `tos minclock`. Ключевое слово `iburst` предписывает ntpd выполнить серию из восьми быстрых обменов пакетами с сервером при первом установлении соединения, чтобы быстро синхронизировать системное время.

source: The `leapfile` keyword specifies the location of a file containing information about leap seconds. The file is updated automatically by man:periodic[8]. The file location specified by this keyword must match the location set in the `ntp_db_leapfile` variable in [.filename]#/etc/rc.conf#.
ko: `leapfile` 키워드는 윤초에 대한 정보가 포함된 파일의 위치를 지정합니다. 이 파일은 man:periodic[8]에 의해 자동으로 업데이트됩니다. 이 키워드로 지정한 파일 위치는 [.filename]#/etc/rc.conf#의 `ntp_db_leapfile` 변수에 설정된 위치와 일치해야 합니다.
ru: Ключевое слово `leapfile` указывает расположение файла, содержащего информацию о високосных секундах. Этот файл автоматически обновляется с помощью man:periodic[8]. Указанное расположение файла должно соответствовать значению переменной `ntp_db_leapfile` в файле [.filename]#/etc/rc.conf#.

source: NTP entries in [.filename]#/etc/rc.conf#
ko: [.filename]#/etc/rc.conf#의 NTP 항목
ru: Записи NTP в [.filename]#/etc/rc.conf#

source: Set `ntpd_enable=YES` to start ntpd at boot time. Once `ntpd_enable=YES` has been added to [.filename]#/etc/rc.conf#, ntpd can be started immediately without rebooting the system by typing:
ko: 부팅할 때 ntpd를 시작하려면 `ntpd_enable=YES`를 설정합니다. [.filename]#/etc/rc.conf#에 `ntpd_enable=YES`를 추가한 후 다음 명령을 통해 시스템을 재부팅하지 않고도 ntpd를 즉시 시작할 수 있습니다:
ru: Установите `ntpd_enable=YES` для запуска ntpd при загрузке. После добавления `ntpd_enable=YES` в [.filename]#/etc/rc.conf#, ntpd можно немедленно запустить без перезагрузки системы, введя:

source: Only `ntpd_enable` must be set to use ntpd. The [.filename]#rc.conf# variables listed below may also be set as needed.
ko: ntpd를 사용하려면 `ntpd_enable`만 설정해야 합니다. 아래 나열된 [.filename]#rc.conf# 변수도 필요에 따라 설정할 수 있습니다.
ru: Для использования ntpd необходимо установить только `ntpd_enable`. При необходимости также могут быть заданы перечисленные ниже переменные [.filename]#rc.conf#.

source: Set `ntpd_sync_on_start=YES` to allow ntpd to step the clock any amount, one time at startup. Normally ntpd will log an error message and exit if the clock is off by more than 1000 seconds. This option is especially useful on systems without a battery-backed realtime clock.
ko: `ntpd_sync_on_start=YES`를 설정하면 시작 시 한 번씩 ntpd가 시계를 원하는대로 단계적인 조정을 할 수 있습니다. 일반적으로 시계가 1000초 이상 꺼져 있으면 ntpd는 오류 메시지를 기록하고 종료합니다. 이 옵션은 배터리로 백업되는 실시간 시계가 없는 시스템에서 특히 유용합니다.
ru: Установите `ntpd_sync_on_start=YES`, чтобы разрешить ntpd однократно корректировать время при запуске на любую величину. Обычно ntpd записывает сообщение об ошибке и завершает работу, если расхождение времени превышает 1000 секунд. Эта опция особенно полезна для систем без аккумуляторного резервного питания часов реального времени.

source: Set `ntpd_oomprotect=YES` to protect the ntpd daemon from being killed by the system attempting to recover from an Out Of Memory (OOM) condition.
ko: 메모리 부족(OOM) 상태에서 복구를 시도하는 시스템에서, ntpd 데몬이 종료되지 않도록 보호하려면 `ntpd_oomprotect=YES`를 설정합니다.
ru: Установите `ntpd_oomprotect=YES`, чтобы защитить демон ntpd от завершения системой при попытке восстановиться после состояния нехватки памяти (OOM).

source: Set `ntpd_config=` to the location of an alternate [.filename]#ntp.conf# file.
ko: 대체(또는 백업) [.filename]#ntp.conf# 파일의 위치로 `ntpd_config=`를 설정하세요
ru: Установите в значении`ntpd_config=` расположение альтернативного файла [.filename]#ntp.conf#.

source: Set `ntpd_flags=` to contain any other ntpd flags as needed, but avoid using these flags which are managed internally by [.filename]#/etc/rc.d/ntpd#:
ko: 필요에 따라 다른 ntpd 플래그를 포함하도록 `ntpd_flags=`를 설정하되, [.filename]#/etc/rc.d/ntpd#에서 내부적으로 관리하는 다음의 플래그는 사용하지 않도록 합니다:
ru: Установите `ntpd_flags=` с любыми другими флагами ntpd по необходимости, но избегайте использования тех флагов, которые устанавливаются внутри файла [.filename]#/etc/rc.d/ntpd#:

source: `-p` (pid file location)
ko: `-p` (pid 파일 위치)
ru: `-p` (расположение pid-файла)

source: `-c` (set `ntpd_config=` instead)
ko: `-c` (`ntpd_config=` 대신 설정)
ru: `-c` (вместо этого установите `ntpd_config=` )

source: ntpd and the unprivileged `ntpd` user
ru: ntpd и непривилегированный пользователь `ntpd`
