Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: To set up an NIS slave server, log on to the slave server and edit [.filename]#/etc/rc.conf# as for the master server. Do not generate any NIS maps, as these already exist on the master server. When running `ypinit` on the slave server, use `-s` (for slave) instead of `-m` (for master). This option requires the name of the NIS master in addition to the domain name, as seen in this example:
ko: NIS 슬레이브 서버를 설정하려면 슬레이브 서버에 로그온하여 마스터 서버와 마찬가지로 [.filename]#/etc/rc.conf#을 편집합니다. 마스터 서버에 이미 존재하는 NIS 맵은 생성하지 마세요. 슬레이브 서버에서 `ypinit`을 실행할 때는 `-m`(마스터용) 대신 `-s`(슬레이브용)를 사용합니다. 이 옵션을 사용하려면 다음 예에서와 같이 도메인 이름 외에 NIS 마스터의 이름이 필요합니다:
ru: Для настройки подчиненного сервера NIS войдите на подчиненный сервер и отредактируйте [.filename]#/etc/rc.conf#, как для основного сервера. Не генерируйте карты NIS, так как они уже существуют на основном сервере. При запуске `ypinit` на подчиненном сервере используйте `-s` (для подчиненного) вместо `-m` (для основного). Эта опция требует указания имени основного сервера NIS в дополнение к имени домена, как показано в этом примере:

source: This will generate a directory on the slave server called [.filename]#/var/yp/test-domain# which contains copies of the NIS master server's maps. Adding these [.filename]#/etc/crontab# entries on each slave server will force the slaves to sync their maps with the maps on the master server:
ko: 이렇게 하면 슬레이브 서버에 [.filename]#/var/yp/test-domain#이라는 디렉터리가 생성되며, 여기에는 NIS 마스터 서버의 맵 사본이 포함됩니다. 각 슬레이브 서버에 이 [.filename]#/etc/crontab# 항목을 추가하면 슬레이브가 마스터 서버의 맵과 맵을 동기화하게 됩니다:
ru: Это создаст каталог на подчиненном сервере с именем [.filename]#/var/yp/test-domain#, который содержит копии карт основного сервера NIS. Добавление этих записей в [.filename]#/etc/crontab# на каждом подчиненном сервере заставит их синхронизировать свои карты с картами на основном сервере:

source: These entries are not mandatory because the master server automatically attempts to push any map changes to its slaves. However, since clients may depend upon the slave server to provide correct password information, it is recommended to force frequent password map updates. This is especially important on busy networks where map updates might not always complete.
ko: 마스터 서버는 모든 맵 변경 사항을 슬레이브 서버에 자동으로 푸시하기 때문에 이러한 항목이 필수는 아닙니다. 하지만 클라이언트가 올바른 비밀번호 정보를 제공하기 위해 슬레이브 서버에 의존할 수 있으므로 비밀번호 맵을 자주 강제로 업데이트하는 것이 좋습니다. 이는 맵 업데이트가 항상 완료되지 않을 수 있는 바쁜 네트워크에서 특히 중요합니다.
ru: Эти записи не являются обязательными, поскольку основной сервер автоматически пытается передать любые изменения карт своим подчинённым серверам. Однако, поскольку клиенты могут зависеть от подчинённого сервера для предоставления корректной информации о паролях, рекомендуется принудительно выполнять частые обновления карт паролей. Это особенно важно в загруженных сетях, где обновления карт могут не всегда завершаться.

source: To finish the configuration, run `/etc/netstart` on the slave server in order to start the NIS services.
ko: 구성을 완료하려면 슬레이브 서버에서 `/etc/netstart`를 실행하여 NIS 서비스를 시작합니다.
ru: Для завершения настройки выполните `/etc/netstart` на подчинённом сервере, чтобы запустить службы NIS.

source: Setting Up an NIS Client
ko: NIS 클라이언트 설정하기
ru: Настройка клиента NIS

source: An NIS client binds to an NIS server using man:ypbind[8]. This daemon broadcasts RPC requests on the local network. These requests specify the domain name configured on the client. If an NIS server in the same domain receives one of the broadcasts, it will respond to ypbind, which will record the server's address. If there are several servers available, the client will use the address of the first server to respond and will direct all of its NIS requests to that server. The client will automatically ping the server on a regular basis to make sure it is still available. If it fails to receive a reply within a reasonable amount of time, ypbind will mark the domain as unbound and begin broadcasting again in the hopes of locating another server.
ko: NIS 클라이언트는 man:ypbind[8]를 사용하여 NIS 서버에 바인딩합니다. 이 데몬은 로컬 네트워크에서 RPC 요청을 브로드캐스트합니다. 이러한 요청은 클라이언트에 구성된 도메인 이름을 포함합니다. 동일한 도메인의 NIS 서버가 브로드캐스트 중 하나를 수신하면 서버의 주소를 기록하는 ypbind에 응답합니다. 사용 가능한 서버가 여러 대 있는 경우 클라이언트는 첫 번째 서버의 주소를 사용하여 응답하고 모든 NIS 요청을 해당 서버로 보냅니다. 클라이언트는 서버가 여전히 사용 가능한지 확인하기 위해 정기적으로 서버에 자동으로 핑을 보냅니다. 적절한 시간 내에 응답을 받지 못하면 ypbind는 도메인을 바인딩 해제된 것으로 표시하고 다른 서버를 찾기 위해 다시 브로드캐스팅을 시작합니다.
ru: Клиент NIS связывается с сервером NIS с помощью man:ypbind[8]. Этот демон рассылает RPC-запросы в локальной сети. Эти запросы указывают доменное имя, настроенное на клиенте. Если NIS-сервер в том же домене получает один из таких запросов, он отвечает, и ypbind записывает адрес сервера. Если доступно несколько серверов, клиент будет использовать адрес первого ответившего сервера и направлять все свои NIS-запросы к нему. Клиент автоматически отправляет ping-запросы серверу через регулярные промежутки времени, чтобы убедиться, что он всё ещё доступен. Если ответ не получен в разумные сроки, ypbind пометит домен как несвязанный и снова начнёт рассылку запросов в надежде найти другой сервер.

source: To configure a FreeBSD machine to be an NIS client:
ko: FreeBSD 머신에 NIS 클라이언트를 구성하려면:
ru: Для настройки машины FreeBSD в качестве клиента NIS:

source: Edit [.filename]#/etc/rc.conf# and add the following lines in order to set the NIS domain name and start man:ypbind[8] during network startup:
ko: [.filename]#/etc/rc.conf#을 편집하고 다음 줄을 추가하여 네트워크 시작 중에 NIS 도메인 이름을 설정과 man:ypbind[8]를 시작하세요:
ru: Отредактируйте файл [.filename]#/etc/rc.conf# и добавьте следующие строки, чтобы установить имя домена NIS и запустить man:ypbind[8] при старте сети:

source: To import all possible password entries from the NIS server, use `vipw` to remove all user accounts except one from [.filename]#/etc/master.passwd#. When removing the accounts, keep in mind that at least one local account should remain and this account should be a member of `wheel`. If there is a problem with NIS, this local account can be used to log in remotely, become the superuser, and fix the problem. Before saving the edits, add the following line to the end of the file:
ko: NIS 서버에서 가능한 모든 비밀번호 항목을 가져오려면 `vipw`를 사용하여 [.filename]#/etc/master.passwd#를 제외한 모든 사용자 계정을 제거합니다. 계정을 제거할 때 로컬 계정이 하나 이상 남아 있어야 하며 이 계정은 `wheel`의 구성원이어야 한다는 점에 유의하세요. NIS에 문제가 있는 경우 이 로컬 계정을 사용하여 원격으로 로그인하고 수퍼유저가 되어 문제를 해결할 수 있습니다. 편집 내용을 저장하기 전에 파일 끝에 다음 줄을 추가합니다:
ru: Для импорта всех возможных записей паролей с сервера NIS, используйте `vipw`, чтобы удалить все учетные записи пользователей, кроме одной, из [.filename]#/etc/master.passwd#. При удалении учетных записей учитывайте, что хотя бы одна локальная учетная запись должна остаться, и эта учетная запись должна быть членом группы `wheel`. Если возникнут проблемы с NIS, эту локальную учетную запись можно использовать для удаленного входа, получения прав суперпользователя и устранения проблемы. Перед сохранением изменений добавьте следующую строку в конец файла:

source: This line configures the client to provide anyone with a valid account in the NIS server's password maps an account on the client. There are many ways to configure the NIS client by modifying this line. One method is described in crossref:network-servers[network-netgroups, Using Netgroups]. For more detailed reading, refer to the book `Managing NFS and NIS`, published by O'Reilly Media.
ru: Эта строка настраивает клиент для предоставления любому пользователю с действительной учётной записью в картах паролей NIS-сервера учётной записи на клиенте. Существует множество способов настройки NIS-клиента путём изменения этой строки. Один из методов описан в crossref:network-servers[network-netgroups, Использование групп сети]. Для более подробного ознакомления обратитесь к книге `Managing NFS and NIS`, опубликованной O'Reilly Media.

source: To import all possible group entries from the NIS server, add this line to [.filename]#/etc/group#:
ko: NIS 서버에서 가능한 모든 그룹 항목을 가져오려면 [.filename]#/etc/group#에 다음 내용을 추가하세요:
ru: Для импорта всех возможных записей групп с сервера NIS добавьте следующую строку в [.filename]#/etc/group#:

source: To start the NIS client immediately, execute the following commands as the superuser:
ko: NIS 클라이언트를 즉시 시작하려면 수퍼유저로 다음 명령을 실행합니다:
ru: Для немедленного запуска клиента NIS выполните следующие команды от имени суперпользователя:

source: After completing these steps, running `ypcat passwd` on the client should show the server's [.filename]#passwd# map.
ko: 이 단계를 완료한 후 클라이언트에서 `ypcat passwd`를 실행하면 서버의 [.filename]#passwd# 맵이 표시됩니다.
ru: После выполнения этих шагов, выполнение команды `ypcat passwd` на клиенте должно отобразить карту [.filename]#passwd# сервера.

source: NIS Security
ko: NIS 보안
ru: Безопасность NIS

source: Since RPC is a broadcast-based service, any system running ypbind within the same domain can retrieve the contents of the NIS maps. To prevent unauthorized transactions, man:ypserv[8] supports a feature called "securenets" which can be used to restrict access to a given set of hosts. By default, this information is stored in [.filename]#/var/yp/securenets#, unless man:ypserv[8] is started with `-p` and an alternate path. This file contains entries that consist of a network specification and a network mask separated by white space. Lines starting with `+"#"+` are considered to be comments. A sample [.filename]#securenets# might look like this:
ko: RPC는 브로드캐스트 기반 서비스이기 때문에, 같은 도메인 내에서 ypbind를 실행하는 모든 시스템은 NIS 맵의 내용을 검색할 수 있습니다. 무단 트랜잭션을 방지하기 위해, man:ypserv[8]는 특정 호스트 집합에 대한 액세스를 제한하는 데 사용할 수 있는 “securenets”이라는 기능을 지원합니다. 기본적으로 이 정보는 man:ypserv[8]이 `-p`와 대체 경로로 시작하지 않는 한 [.filename]#/var/yp/securenets#에 저장됩니다. 이 파일에는 공백으로 구분된 네트워크 사양과 네트워크 마스크로 구성된 항목이 포함되어 있습니다. “+”#”+`로 시작하는 줄은 주석으로 간주됩니다. 샘플 [.filename]#securenets#은 다음과 같이 보일 수 있습니다:
ru: Поскольку RPC — это широковещательный сервис, любая система, запускающая ypbind в том же домене, может получить содержимое NIS-карт. Чтобы предотвратить несанкционированные операции, man:ypserv[8] поддерживает функцию под названием "securenets", которая может использоваться для ограничения доступа к определённому набору хостов. По умолчанию эта информация хранится в [.filename]#/var/yp/securenets#, если только man:ypserv[8] не запущен с ключом `-p` и альтернативным путём. Этот файл содержит записи, состоящие из спецификации сети и сетевой маски, разделённых пробелами. Строки, начинающиеся с `+"#"+`, считаются комментариями. Пример файла [.filename]#securenets# может выглядеть так:

source: If man:ypserv[8] receives a request from an address that matches one of these rules, it will process the request normally. If the address fails to match a rule, the request will be ignored and a warning message will be logged. If the [.filename]#securenets# does not exist, `ypserv` will allow connections from any host.
ko: man:ypserv[8]는 이 규칙 중 하나와 일치하는 주소에서 요청을 받으면 요청을 정상적으로 처리합니다. 하지만 주소가 규칙과 일치하지 않으면 요청이 무시되고 경고 메시지가 기록됩니다. [.filename]#securenets#이 존재하지 않는 경우, `ypserv`는 모든 호스트의 연결을 허용합니다.
ru: Если man:ypserv[8] получает запрос от адреса, соответствующего одному из этих правил, он обработает запрос как обычно. Если адрес не соответствует ни одному правилу, запрос будет проигнорирован и в журнал будет записано предупреждение. Если файл [.filename]#securenets# не существует, `ypserv` разрешит соединения с любого хоста.

source: crossref:security[tcpwrappers,"TCP Wrapper"] is an alternate mechanism for providing access control instead of [.filename]#securenets#. While either access control mechanism adds some security, they are both vulnerable to "IP spoofing" attacks. All NIS-related traffic should be blocked at the firewall.
ko: crossref:security[tcpwrappers,”TCP Wrapper”]는 [.filename]#securenets# 대신 접근 제어를 제공하기 위한 대체 메커니즘입니다. 두 가지 접근 제어 메커니즘 모두 보안을 강화할 수 있지만 “IP spoofing” 공격에 취약합니다. 모든 NIS 관련 트래픽은 방화벽에서 차단해야 합니다.
ru: crossref:security[tcpwrappers,"TCP Wrapper"] — это альтернативный механизм контроля доступа вместо [.filename]#securenets#. Хотя оба механизма контроля доступа добавляют некоторый уровень безопасности, они оба уязвимы к атакам "подмены IP". Весь трафик, связанный с NIS, должен блокироваться на межсетевом экране.

source: Servers using [.filename]#securenets# may fail to serve legitimate NIS clients with archaic TCP/IP implementations. Some of these implementations set all host bits to zero when doing broadcasts or fail to observe the subnet mask when calculating the broadcast address. While some of these problems can be fixed by changing the client configuration, other problems may force the retirement of these client systems or the abandonment of [.filename]#securenets#.
ko: [.filename]#securenets#을 사용하는 서버는 구식 TCP/IP 구현을 사용하는 정상적인 NIS 클라이언트에 서비스를 제공하지 못할 수 있습니다. 이러한 장비 중 일부는 브로드캐스트 할 때 모든 호스트 비트를 0으로 설정하거나 브로드캐스트 주소를 계산할 때 서브넷 마스크를 확인하지 못할 수 있습니다. 이러한 문제가 발생했을때 일부는 클라이언트 구성을 변경하여 해결할 수 있지만, 이게 불가능할 경우 클라이언트 시스템을 폐기하거나 [.filename]#securenets#을 포기해야 할 수도 있습니다.
ru: Серверы, использующие [.filename]#securenets#, могут не обслуживать легитимных клиентов NIS с устаревшими реализациями TCP/IP. Некоторые из этих реализаций устанавливают все биты хоста в ноль при выполнении широковещательных запросов или не учитывают маску подсети при вычислении широковещательного адреса. Хотя некоторые из этих проблем можно устранить, изменив конфигурацию клиента, другие проблемы могут потребовать вывода из эксплуатации этих клиентских систем или отказа от [.filename]#securenets#.

source: The use of TCP Wrapper increases the latency of the NIS server. The additional delay may be long enough to cause timeouts in client programs, especially in busy networks with slow NIS servers. If one or more clients suffer from latency, convert those clients into NIS slave servers and force them to bind to themselves.
ko: TCP 래퍼를 사용하면 NIS 서버의 지연 시간이 증가합니다. 추가 지연은 클라이언트 프로그램에서 시간 초과를 일으킬 만큼 충분히 길 수 있으며, 특히 느린 NIS 서버가 있는 바쁜 네트워크에서는 더욱 그렇습니다. 하나 이상의 클라이언트에 지연이 발생하면 해당 클라이언트를 NIS 슬레이브 서버로 변환하고 강제로 바인딩하세요.
ru: Использование TCP Wrapper увеличивает задержку сервера NIS. Дополнительная задержка может быть достаточно длительной, чтобы вызвать таймауты в клиентских программах, особенно в загруженных сетях с медленными серверами NIS. Если один или несколько клиентов страдают от задержек, преобразуйте этих клиентов в подчинённые серверы NIS и заставьте их привязываться к самим себе.

source: Barring Some Users
ko: 일부 사용자 차단하기
ru: Запрет доступа некоторым пользователям

source: In this example, the `basie` system is a faculty workstation within the NIS domain. The [.filename]#passwd# map on the master NIS server contains accounts for both faculty and students. This section demonstrates how to allow faculty logins on this system while refusing student logins.
ko: 이 예에서 `basie` 시스템은 NIS 도메인 내의 교직원 워크스테이션입니다. 마스터 NIS 서버의 [.filename]#passwd# 맵에는 교직원과 학생의 계정이 모두 포함되어 있습니다. 이 섹션에서는 이 시스템에서 교직원 로그인을 허용하고 학생 로그인을 거부하는 방법을 설명합니다.
ru: В этом примере система `basie` является рабочей станцией преподавателя в домене NIS. Файл [.filename]#passwd# на главном сервере NIS содержит учетные записи как преподавателей, так и студентов. В этом разделе показано, как разрешить вход преподавателей в эту систему, запретив вход студентам.

source: To prevent specified users from logging on to a system, even if they are present in the NIS database, use `vipw` to add `-_username_` with the correct number of colons towards the end of [.filename]#/etc/master.passwd# on the client, where _username_ is the username of a user to bar from logging in. The line with the blocked user must be before the `+` line that allows NIS users. In this example, `bill` is barred from logging on to `basie`:
ko: 지정된 사용자가 NIS 데이터베이스에 있더라도 시스템에 로그온하지 못하도록 하려면 `vipw`를 사용하여 클라이언트에서 [.filename]#/etc/master.passwd# 끝에 정확한 콜론 수로 `-_username_`을 추가하세요. 여기서 _username_은 로그인을 금지할 사용자의 사용자 이름입니다. 차단할 사용자의 목록은 NIS 사용자를 허용하는 `+` 줄 앞에 와야 합니다. 이 예제에서는 `bill`이 `basie`에 로그온하지 못하도록 차단되었습니다:
ru: Чтобы предотвратить вход определенных пользователей в систему, даже если они присутствуют в базе данных NIS, используйте `vipw` для добавления `-_имя_пользователя_` с правильным количеством двоеточий в конце файла [.filename]#/etc/master.passwd# на клиенте, где _имя_пользователя_ — это имя пользователя, которому запрещен вход. Строка с заблокированным пользователем должна находиться перед строкой `+`, которая разрешает вход пользователям NIS. В этом примере пользователю `bill` запрещен вход на `basie`:

source: Using Netgroups
ko: 넷그룹 사용하기
ru: Использование сетевых групп

source: Barring specified users from logging on to individual systems becomes unscaleable on larger networks and quickly loses the main benefit of NIS: _centralized_ administration.
ko: 특정 사용자가 개별 시스템에 로그온하지 못하도록 차단하면 대규모 네트워크에서는 확장할 수 없게 되며, NIS의 주요 이점인 _중앙 집중식_ 관리 기능을 빠르게 잃게 됩니다.
ru: Запрет указанным пользователям возможности входа в отдельные системы становится неэффективным и не масштабируемым в крупных сетях и быстро лишает NIS основного преимущества: _централизованного_ администрирования.

source: Netgroups were developed to handle large, complex networks with hundreds of users and machines. Their use is comparable to UNIX(R) groups, where the main difference is the lack of a numeric ID and the ability to define a netgroup by including both user accounts and other netgroups.
ko: 넷그룹은 수백 명의 사용자와 컴퓨터가 있는 대규모의 네트워크를 처리하기 위해 개발되었습니다. 넷그룹의 사용법은 UNIX(R) 그룹과 비슷하지만, 숫자 ID가 없다는 점과 사용자 계정과 다른 넷그룹을 모두 포함하여 넷그룹을 정의할 수 있다는 점이 가장 큰 차이점입니다.
ru: Сетевые группы были разработаны для управления большими и сложными сетями с сотнями пользователей и машин. Их использование аналогично группам в UNIX(R), с той основной разницей, что отсутствует числовой идентификатор и есть возможность определять сетевую группу, включая как учётные записи пользователей, так и другие сетевые группы.

source: To expand on the example used in this chapter, the NIS domain will be extended to add the users and systems shown in Tables 28.2 and 28.3:
ko: 이 장에서 사용된 예제를 확장하기 위해 NIS 도메인을 확장하여 표 28.2 및 28.3에 표시된 사용자 및 시스템을 추가합니다:
ru: Для дополнения примера, используемого в этой главе, домен NIS будет увеличен за счет пользователей и систем, показанным в таблицах 28.2 и 28.3:

source: Additional Users
ko: 추가 사용자
ru: Дополнительные пользователи

source: User Name(s)
ko: 사용자 이름
ru: Имена пользователей

source: IT department employees
ko: IT부서 직원
ru: Сотрудники IT-отдела

source: IT department apprentices
ko: IT 부서 견습사원
ru: Стажеры IT-отдела

source: employees
ko: 임직원
ru: Сотрудники

source: interns
ko: 인턴
ru: Интерны

source: Additional Systems
ko: 추가 시스템
ru: Дополнительные Системы

source: Machine Name(s)
ko: 장비 이름
ru: Имена машин

source: Only IT employees are allowed to log onto these servers.
ko: IT 부서 직원만 이 서버에 로그인 허용.
ru: Только сотрудники IT имеют право входить на эти серверы.

source: All members of the IT department are allowed to login onto these servers.
ko: 모든 IT 부서의 멤버는 이 서버에 로그인 허용.
ru: Все сотрудники IT-отдела имеют право входить на эти серверы.

source: Ordinary workstations used by employees.
ko: 임직원을 위한 일반 워크스테이션.
ru: Обычные рабочие станции, используемые сотрудниками.

source: A very old machine without any critical data. Even interns are allowed to use this system.
ko: 중요한 자료는 전혀 없는 아주 오래된 장비. 인턴들도 이 시스템은 사용할 수 있음.
ru: Очень старая машина без каких-либо важных данных. Даже интернам разрешено использовать эту систему.

source: When using netgroups to configure this scenario, each user is assigned to one or more netgroups and logins are then allowed or forbidden for all members of the netgroup. When adding a new machine, login restrictions must be defined for all netgroups. When a new user is added, the account must be added to one or more netgroups. If the NIS setup is planned carefully, only one central configuration file needs modification to grant or deny access to machines.
ko: 넷그룹을 사용하여 이 시나리오를 구성하는 경우, 각 사용자는 하나 이상의 넷그룹에 할당되고 넷그룹의 모든 구성원에 대해 로그인이 허용되거나 금지됩니다. 새 머신을 추가할 때는 모든 넷그룹에 대해 로그인 제한을 정의해야 합니다. 새 사용자가 추가되면 해당 계정을 하나 이상의 넷그룹에 추가해야 합니다. NIS 설정을 신중하게 계획한 경우, 중앙 구성 파일 하나만 수정하면 머신에 대한 액세스를 허용하거나 거부할 수 있습니다.
ru: При использовании сетевых групп для настройки этого сценария каждый пользователь назначается в одну или несколько сетевых групп, а затем вход разрешается или запрещается для всех членов сетевой группы. При добавлении новой машины необходимо определить ограничения входа для всех сетевых групп. Когда добавляется новый пользователь, его учётная запись должна быть добавлена в одну или несколько сетевых групп. Если настройка NIS выполнена тщательно, для предоставления или запрета доступа к машинам потребуется изменить только один центральный файл конфигурации.

source: The first step is the initialization of the NIS `netgroup` map. In FreeBSD, this map is not created by default. On the NIS master server, use an editor to create a map named [.filename]#/var/yp/netgroup#.
ru: Первым шагом является инициализация NIS `netgroup` карты. В FreeBSD эта карта не создается по умолчанию. На главном сервере NIS используйте редактор для создания карты с именем [.filename]#/var/yp/netgroup#.

source: This example creates four netgroups to represent IT employees, IT apprentices, employees, and interns:
ko: 이 예에서는 IT 직원, IT 견습사원, 임직원 및 인턴을 나타내는 네 개의 넷 그룹을 만듭니다:
ru: Этот пример создает четыре сетевые группы для представления сотрудников IT, стажеров IT, сотрудников и интернов:

source: Each entry configures a netgroup. The first column in an entry is the name of the netgroup. Each set of parentheses represents either a group of one or more users or the name of another netgroup. When specifying a user, the three comma-delimited fields inside each group represent:
ko: 각 항목에 대한 넷그룹을 구성합니다. 항목의 첫 번째 열은 넷그룹의 이름입니다. 괄호 안의 각 집합은 한 명 이상의 사용자로 구성된 그룹 또는 다른 넷그룹의 이름을 나타냅니다. 사용자를 지정할 때 각 그룹 내부의 쉼표로 구분된 세 개의 필드는 사용자를 나타냅니다:
ru: Каждая запись настраивает сетевую группу. Первый столбец в записи — это название сетевой группы. Каждый набор скобок представляет либо группу из одного или нескольких пользователей, либо имя другой сетевой группы. При указании пользователя три поля, разделённые запятыми, внутри каждой группы означают:

source: The name of the host(s) where the other fields representing the user are valid. If a hostname is not specified, the entry is valid on all hosts.
ko: 사용자를 나타내는 다른 필드가 유효한 호스트의 이름입니다. 호스트 이름을 지정하지 않으면 모든 호스트에서 접근이 허용됩니다.
ru: Имя хоста(ов), на котором другие поля, представляющие пользователя, действительны. Если имя хоста не указано, запись действительна на всех хостах.

source: The name of the account that belongs to this netgroup.
ko: 이 넷그룹에 속한 계정의 이름입니다.
ru: Имя учетной записи, принадлежащей этой сетевой группе.

source: The NIS domain for the account. Accounts may be imported from other NIS domains into a netgroup.
ko: 계정의 NIS 도메인입니다. 다른 NIS 도메인에서 넷그룹으로 계정을 가져올 수 있습니다.
ru: NIS-домен для учетной записи. Учетные записи могут быть импортированы из других NIS-доменов в сетевую группу.

source: If a group contains multiple users, separate each user with whitespace. Additionally, each field may contain wildcards. See man:netgroup[5] for details.
ko: 그룹에 여러 명의 사용자가 포함된 경우 각 사용자를 공백으로 구분합니다. 또한 각 필드에는 와일드카드가 포함될 수 있습니다. 자세한 내용은 man:netgroup[5]을 참조하세요.
ru: Если группа содержит нескольких пользователей, разделяйте каждого пользователя пробелом. Кроме того, каждое поле может содержать символы подстановки. Подробности см. в man:netgroup[5].

source: Netgroup names longer than 8 characters should not be used. The names are case sensitive and using capital letters for netgroup names is an easy way to distinguish between user, machine and netgroup names.
ko: 8자를 초과하는 넷그룹 이름은 사용하지 않아야 합니다. 이름은 대소문자를 구분하며 넷그룹 이름에 대문자를 사용하면 사용자, 컴퓨터 및 넷그룹 이름을 쉽게 구분할 수 있습니다.
ru: Имена сетевых групп длиннее 8 символов не должны использоваться. Имена чувствительны к регистру, и использование заглавных букв для имён сетевых групп — это простой способ отличить имена пользователей, машин и сетевых групп.
