Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: Remember to use the same `Common Name` attribute when prompted. When finished, ensure that a total of eight (8) new files have been generated through the proceeding commands.
ko: 메시지가 표시되면 동일한 `Common Name` 속성을 사용해야 합니다. 완료되면 진행 과정을 확인해 총 8개의 새 파일이 생성되었는지 확인합니다.
ru: Помните, что нужно использовать тот же атрибут `Common Name` при запросе. По завершении убедитесь, что в результате выполнения команд было создано в общей сложности восемь (8) новых файлов.

source: The daemon running the OpenLDAP server is [.filename]#slapd#. Its configuration is performed through [.filename]#slapd.ldif#: the old [.filename]#slapd.conf# has been deprecated by OpenLDAP.
ko: OpenLDAP 서버를 실행하는 데몬은 [.filename]#slapd#입니다. 이 구성은 [.filename]#slapd.ldif#를 통해 수행됩니다. 이전 [.filename]#slapd.conf#는 OpenLDAP에서 더 이상 사용되지 않습니다.
ru: Демон, запускающий сервер OpenLDAP, называется [.filename]#slapd#. Его настройка выполняется через файл [.filename]#slapd.ldif#: старый файл [.filename]#slapd.conf# больше не используется в OpenLDAP.

source: http://www.openldap.org/doc/admin24/slapdconf2.html[Configuration examples] for [.filename]#slapd.ldif# are available and can also be found in [.filename]#/usr/local/etc/openldap/slapd.ldif.sample#. Options are documented in slapd-config(5). Each section of [.filename]#slapd.ldif#, like all the other LDAP attribute sets, is uniquely identified through a DN. Be sure that no blank lines are left between the `dn:` statement and the desired end of the section. In the following example, TLS will be used to implement a secure channel. The first section represents the global configuration:
ko: http://www.openldap.org/doc/admin24/slapdconf2.html[Configuration examples]는 [.filename]#slapd.ldif#에 사용할 수 있으며 [.filename]#/usr/local/etc/openldap/slapd.ldif.sample#에서도 다른 예제를 찾을 수 있습니다. 이에대한 옵션은 slapd-config(5)에 문서화되어 있습니다. 다른 모든 LDAP 어트리뷰트 세트와 마찬가지로 [.filename]#slapd.ldif#의 각 섹션은 DN을 통해 고유하게 구분됩니다. `dn:` 문과 섹션의 끝 사이에는 절대 빈 줄이 없어야 합니다. 다음 예에서는 보안 채널을 구현하는 데 TLS를 사용합니다. 첫 번째 섹션은 글로벌 구성을 나타냅니다:
ru: Есть http://www.openldap.org/doc/admin24/slapdconf2.html[примеры конфигурации] для [.filename]#slapd.ldif# доступны, и также их можно найти в [.filename]#/usr/local/etc/openldap/slapd.ldif.sample#. Документация параметров в slapd-config(5). Каждый раздел [.filename]#slapd.ldif#, как и все другие наборы атрибутов LDAP, однозначно идентифицируется через DN. Убедитесь, что между строкой `dn:` и желаемым концом раздела нет пустых строк. В следующем примере TLS будет использоваться для настройки безопасного канала. Первый раздел представляет глобальную конфигурацию:

source: The Certificate Authority, server certificate and server private key files must be specified here. It is recommended to let the clients choose the security cipher and omit option `olcTLSCipherSuite` (incompatible with TLS clients other than [.filename]#openssl#). Option `olcTLSProtocolMin` lets the server require a minimum security level: it is recommended. While verification is mandatory for the server, it is not for the client: `olcTLSVerifyClient: never`.
ko: 여기에 인증 기관, 서버 인증서 및 서버 개인 키 파일을 지정해야 합니다. 클라이언트가 보안 암호를 선택하도록 하고 `olcTLSCipherSuite` 옵션은 생략하는 것이 좋습니다([.filename]#openssl# 이외의 TLS 클라이언트와 호환되지 않음). 옵션 `olcTLSProtocolMin`을 사용하면 서버에 최소한의 보안 수준을 요구할 수 있으므로 권장됩니다. 서버에서는 인증절차가 필수이지만 클라이언트 측에서는 인증절차가 필요하지 않습니다(`olcTLSVerifyClient: never`).
ru: Здесь необходимо указать файлы Центра сертификации, сертификата сервера и закрытого ключа сервера. Рекомендуется позволить клиентам выбирать алгоритм шифрования и опустить опцию `olcTLSCipherSuite` (несовместимо с TLS-клиентами, кроме [.filename]#openssl#). Опция `olcTLSProtocolMin` позволяет серверу требовать минимальный уровень безопасности: это рекомендуется. Хотя проверка обязательна для сервера, для клиента она не требуется: `olcTLSVerifyClient: never`.

source: The second section is about the backend modules and can be configured as follows:
ko: 두 번째 섹션은 백엔드 모듈에 관한 것으로 다음과 같이 구성할 수 있습니다:
ru: Второй раздел посвящен серверным модулям и может быть настроен следующим образом:

source: The third section is devoted to load the needed `ldif` schemas to be used by the databases: they are essential.
ko: 세 번째 섹션은 데이터베이스를 사용할 때 필요한 `ldif` 스키마 로딩에 대해 기술하고 있습니다: 이 부분은 매우 중요합니다.
ru: Третий раздел посвящён загрузке необходимых схем `ldif` для использования базами данных: они являются важными.

source: Next, the frontend configuration section:
ko: 다음은 프론트엔드 구성 섹션:
ru: Далее, раздел конфигурации фронтенда (уровня взаимодействия с клиентами):

source: Another section is devoted to the _configuration backend_, the only way to later access the OpenLDAP server configuration is as a global super-user.
ko: 또 다른 섹션에서는 나중에 글로벌 수퍼유저로서만 OpenLDAP 서버 구성에 액세스할 수 있는 유일한 방법인 _configuration 백엔드_에 대해 기술하고 있습니다.
ru: Еще один раздел посвящен _бэкенду конфигурации_ — единственному способу последующего доступа к конфигурации сервера OpenLDAP, который доступен только глобальному суперпользователю.

source: The default administrator username is `cn=config`. Type [.filename]#slappasswd# in a shell, choose a password and use its hash in `olcRootPW`. If this option is not specified now, before [.filename]#slapd.ldif# is imported, no one will be later able to modify the _global configuration_ section.
ko: 기본 관리자 이름은 `cn=config`입니다. 셸에 [.filename]#slappasswd#를 입력하고 비밀번호를 선택한 다음 `olcRootPW`에서 해당 해시를 사용합니다. 지금 이 옵션을 지정하지 않으면 [.filename]#slapd.ldif#를 가져오기 전에 아무도 나중에 _global configuration_ 섹션을 수정할 수 없습니다.
ru: Имя администратора по умолчанию — `cn=config`. Введите [.filename]#slappasswd# в оболочке, выберите пароль и используйте его хеш в `olcRootPW`. Если этот параметр не указан сейчас, до импорта [.filename]#slapd.ldif#, никто не сможет впоследствии изменить раздел _глобальной конфигурации_.

source: The last section is about the database backend:
ko: 마지막 섹션은 데이터베이스 백앤드에 대한 것입니다:
ru: Последний раздел посвящен бэкенду базы данных (уровню хранения данных):

source: This database hosts the _actual contents_ of the LDAP directory. Types other than `mdb` are available. Its super-user, not to be confused with the global one, is configured here: a (possibly custom) username in `olcRootDN` and the password hash in `olcRootPW`; [.filename]#slappasswd# can be used as before.
ko: 이 데이터베이스는 LDAP 디렉터리의 _실제 내용_을 호스팅합니다. `mdb` 이외의 유형도 사용할 수 있습니다. 글로벌 사용자와 혼동하지 말아야 할 수퍼유저가 여기에 구성됩니다: `olcRootDN`에 (사용자 정의 가능한) 사용자 이름, `olcRootPW`에 비밀번호 해시; [.filename]#slappasswd#는 이전과 같이 사용할 수 있습니다.
ru: Эта база данных содержит _фактическое содержимое_ каталога LDAP. Доступны типы, отличные от `mdb`. Суперпользователь (не путать с глобальным) настраивается здесь: (возможно, пользовательское) имя пользователя в `olcRootDN` и хэш пароля в `olcRootPW`; [.filename]#slappasswd# можно использовать, как и раньше.

source: This http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=tree;f=tests/data/regressions/its8444;h=8a5e808e63b0de3d2bdaf2cf34fecca8577ca7fd;hb=HEAD[repository] contains four examples of [.filename]#slapd.ldif#. To convert an existing [.filename]#slapd.conf# into [.filename]#slapd.ldif#, refer to http://www.openldap.org/doc/admin24/slapdconf2.html[this page] (please note that this may introduce some unuseful options).
ko: 이 http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=tree;f=tests/data/regressions/its8444;h=8a5e808e63b0de3d2bdaf2cf34fecca8577ca7fd;hb=HEAD[repository]에는 [.filename]#slapd.ldif#의 네 가지 예가 포함되어 있습니다. 기존 [.filename]#slapd.conf#를 [.filename]#slapd.ldif#로 변환하려면 http://www.openldap.org/doc/admin24/slapdconf2.html[이 페이지]를 참조하세요(일부 쓸모없는 옵션이 생길 수 있음에 유의하세요).
ru: Этот http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=tree;f=tests/data/regressions/its8444;h=8a5e808e63b0de3d2bdaf2cf34fecca8577ca7fd;hb=HEAD[репозиторий] содержит четыре примера файла [.filename]#slapd.ldif#. Для преобразования существующего [.filename]#slapd.conf# в [.filename]#slapd.ldif# обратитесь к http://www.openldap.org/doc/admin24/slapdconf2.html[этой странице] (обратите внимание, что это может добавить некоторые бесполезные опции).

source: When the configuration is completed, [.filename]#slapd.ldif# must be placed in an empty directory. It is recommended to create it as:
ko: 구성이 완료되면 [.filename]#slapd.ldif#를 빈 디렉터리에 배치해야 합니다. 다음과 같이 생성하는 것이 좋습니다:
ru: После завершения настройки файл [.filename]#slapd.ldif# должен быть скопирован в пустую директорию. Рекомендуется создать её следующим образом:

source: Import the configuration database:
ko: 구성 데이터베이스를 가져옵니다:
ru: Импорт базы данных конфигурации:

source: Start the [.filename]#slapd# daemon:
ko: [.filename]#slapd# 데몬을 실행합니다:
ru: Запустите демон [.filename]#slapd#:

source: Option `-d` can be used for debugging, as specified in slapd(8). To verify that the server is running and working:
ko: 옵션 `-d`는 slapd(8)에 지정된 대로, 디버깅에 사용할 수 있습니다. 서버가 실행 중이고 작동하는지 확인합니다:
ru: Опция `-d` может использоваться для отладки, как указано в slapd(8). Чтобы проверить, что сервер запущен и работает:

source: The server must still be trusted. If that has never been done before, follow these instructions. Install the OpenSSL package or port:
ko: 서버를 여전히 신뢰할 수 있어야 합니다(인증되어 있어야 한다는 뜻). 이전에 이 작업을 수행한 적이 없다면 다음 지침을 따르세요. OpenSSL 패키지 또는 포트를 설치합니다:
ru: Сервер по-прежнему должен быть доверенным. Если это никогда не делалось ранее, следуйте этим инструкциям. Установите пакет или порт OpenSSL:

source: From the directory where [.filename]#ca.crt# is stored (in this example, [.filename]#/usr/local/etc/openldap#), run:
ko: [.filename]#ca.crt#가 저장되어 있는 디렉터리(이 예에서는 [.파일 이름]#/usr/local/etc/openldap#)에서 다음을 실행합니다:
ru: Из каталога, где находится [.filename]#ca.crt# (в данном примере, [.filename]#/usr/local/etc/openldap#), выполните:

source: Both the CA and the server certificate are now correctly recognized in their respective roles. To verify this, run this command from the [.filename]#server.crt# directory:
ko: 이제 CA 및 서버 인증서가 모두 각자의 역할에서 올바르게 인식됩니다. 이를 확인하려면 [.filename]#server.crt# 디렉토리에서 이 명령을 실행합니다:
ru: И сертификат центра сертификации, и сертификат сервера теперь правильно распознаются в своих соответствующих ролях. Чтобы проверить это, выполните следующую команду из директории, где находится [.filename]#server.crt#:

source: If [.filename]#slapd# was running, restart it. As stated in [.filename]#/usr/local/etc/rc.d/slapd#, to properly run [.filename]#slapd# at boot the following lines must be added to [.filename]#/etc/rc.conf#:
ko: [.filename]#slapd#가 실행 중이라면 다시 시작합니다. [.filename]#/usr/local/etc/rc.d/slapd#에 명시된 대로, 부팅 시 [.filename]#slapd#를 제대로 실행하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가해야 합니다:
ru: Если [.filename]#slapd# был запущен, перезапустите его. Как указано в [.filename]#/usr/local/etc/rc.d/slapd#, для корректного запуска [.filename]#slapd# при загрузке следующие строки должны быть добавлены в [.filename]#/etc/rc.conf#:

source: [.filename]#slapd# does not provide debugging at boot. Check [.filename]#/var/log/debug.log#, [.filename]#dmesg -a# and [.filename]#/var/log/messages# for this purpose.
ko: [.filename]#slapd#는 부팅 시 디버깅을 제공하지 않습니다. 만약 확인이 필요하다면 [.filename]#/var/log/debug.log#, [.filename]#dmesg -a# 및 [.filename]#/var/log/messages#를 확인하시기 바랍니다.
ru: [.filename]#slapd# не предоставляет отладку при загрузке. Для этой цели проверьте [.filename]#/var/log/debug.log#, [.filename]#dmesg -a# и [.filename]#/var/log/messages#.

source: The following example adds the group `team` and the user `john` to the `domain.example` LDAP database, which is still empty. First, create the file [.filename]#domain.ldif#:
ko: 다음 예에서는 아직 비어 있는 `domain.example` LDAP 데이터베이스에 그룹 `team`과 사용자 `john`을 추가합니다. 먼저 [.filename]#domain.ldif# 파일을 만듭니다:
ru: Следующий пример добавляет группу `team` и пользователя `john` в базу данных LDAP `domain.example`, которая пока пуста. Сначала создайте файл [.filename]#domain.ldif#:

source: See the OpenLDAP documentation for more details. Use [.filename]#slappasswd# to replace the plain text password `secret` with a hash in `userPassword`. The path specified as `loginShell` must exist in all the systems where `john` is allowed to login. Finally, use the `mdb` administrator to modify the database:
ko: 자세한 내용은 OpenLDAP 설명서를 참조하세요. [.filename]#slappasswd#를 사용하여 일반 텍스트 비밀번호 `secret`을 `userPassword`의 해시로 바꿉니다. `loginShell`로 지정된 경로는 `john`이 로그인할 수 있는 모든 시스템에 존재해야 합니다. 마지막으로 `mdb` 관리자를 사용하여 데이터베이스를 수정합니다:
ru: См. документацию OpenLDAP для получения более подробной информации. Используйте [.filename]#slappasswd# для замены пароля в открытом тексте `secret` на хеш в `userPassword`. Путь, указанный как `loginShell`, должен существовать во всех системах, где `john` имеет право входить. Наконец, используйте администратора `mdb` для изменения базы данных:

source: Modifications to the _global configuration_ section can only be performed by the global super-user. For example, assume that the option `olcTLSCipherSuite: HIGH:MEDIUM:SSLv3` was initially specified and must now be deleted. First, create a file that contains the following:
ko: _global configuration_ 섹션에 대한 수정은 글로벌 수퍼유저만 수행할 수 있습니다. 예를 들어, 옵션 `olcTLSCipherSuite: HIGH:MEDIUM:SSLv3` 옵션이 처음에 지정되었으므로 이제 삭제해야 한다고 가정합니다. 먼저 다음을 포함하는 파일을 만듭니다:
ru: Изменения в разделе _глобальной конфигурации_ могут выполняться только глобальным суперпользователем. Например, предположим, что изначально была указана опция `olcTLSCipherSuite: HIGH:MEDIUM:SSLv3`, которую теперь необходимо удалить. Сначала создайте файл, содержащий следующее:

source: Then, apply the modifications:
ko: 그리고 나서 다음과 같이 수정합니다:
ru: Затем примените изменения:

source: When asked, provide the password chosen in the _configuration backend_ section. The username is not required: here, `cn=config` represents the DN of the database section to be modified. Alternatively, use `ldapmodify` to delete a single line of the database, `ldapdelete` to delete a whole entry.
ko: 메시지가 표시되면 _configuration backend_ 섹션에서 선택한 비밀번호를 입력합니다. 사용자 이름은 필수가 아닙니다. 여기서 `cn=config`는 수정할 데이터베이스 섹션의 DN을 나타냅니다. 또는 데이터베이스의 한 줄을 삭제하려면 `ldapmodify`를, 전체 항목을 삭제하려면 `ldapdelete`를 사용합니다.
ru: При запросе введите пароль, выбранный в разделе _бекенда конфигурации_. Имя пользователя не требуется: здесь `cn=config` представляет DN раздела базы данных, который нужно изменить. Альтернативно, используйте `ldapmodify` для удаления отдельной строки базы данных или `ldapdelete` для удаления всей записи.

source: If something goes wrong, or if the global super-user cannot access the configuration backend, it is possible to delete and re-write the whole configuration:
ko: 문제가 발생하거나 글로벌 수퍼유저가 구성 백엔드에 액세스할 수 없는 경우 전체 구성을 삭제하고 다시 작성할 수 있습니다:
ru: Если что-то пойдет не так или если глобальный суперпользователь не сможет получить доступ к бэкенду конфигурации, можно удалить и перезаписать всю конфигурацию:

source: [.filename]#slapd.ldif# can then be edited and imported again. Please, follow this procedure only when no other solution is available.
ko: 그런 다음 [.filename]#slapd.ldif#를 편집하고 다시 가져올 수 있습니다. 다른 해결 방법을 사용할 수 없는 경우에만 이 절차를 따르세요.
ru: [.filename]#slapd.ldif# затем можно отредактировать и снова импортировать. Пожалуйста, следуйте этой процедуре только в том случае, если нет другого доступного решения.

source: This is the configuration of the server only. The same machine can also host an LDAP client, with its own separate configuration.
ko: 이것은 서버만 해당되는 구성입니다. 동일한 컴퓨터에서 별도의 구성을 통해 LDAP 클라이언트를 호스팅할 수도 있습니다.
ru: Это конфигурация только сервера. На той же машине также может быть размещен LDAP-клиент с собственной отдельной конфигурацией.

source: Dynamic Host Configuration Protocol (DHCP)
ko: 동적 호스트 구성 프로토콜(Dynamic Host Configuration Protocol, DHCP)
ru: Протокол динамической конфигурации узла (DHCP)

source: The Dynamic Host Configuration Protocol (DHCP) allows a system to connect to a network in order to be assigned the necessary addressing information for communication on that network. FreeBSD includes the OpenBSD version of `dhclient` which is used by the client to obtain the addressing information. FreeBSD does not install a DHCP server, but several servers are available in the FreeBSD Ports Collection. The DHCP protocol is fully described in http://www.freesoft.org/CIE/RFC/2131/[RFC 2131]. Informational resources are also available at http://www.isc.org/downloads/dhcp/[isc.org/downloads/dhcp/].
ko: 동적 호스트 구성 프로토콜(DHCP)은 시스템이 네트워크에 연결하여 해당 네트워크에서 통신하는 데 필요한 주소 지정 정보를 할당받을 수 있도록 합니다. FreeBSD에는 클라이언트가 주소 지정 정보를 얻기 위해 사용하는 `dhclient`의 OpenBSD 버전이 포함되어 있습니다. FreeBSD는 DHCP 서버를 기본설치하지 않지만, 이와 관련된 여러가지 서버를 FreeBSD 포트 컬렉션에서 사용할 수 있습니다. DHCP 프로토콜은 http://www.freesoft.org/CIE/RFC/2131/[RFC 2131]에 자세히 설명되어 있습니다. 정보 리소스는 http://www.isc.org/downloads/dhcp/[isc.org/downloads/dhcp/]에서도 확인할 수 있습니다.
ru: Протокол динамической конфигурации узла (DHCP —Dynamic Host Configuration Protocol) позволяет системе подключаться к сети для получения необходимой адресной информации для общения в этой сети. FreeBSD включает версию `dhclient` от OpenBSD, которая используется клиентом для получения адресной информации. FreeBSD не устанавливает сервер DHCP, но несколько серверов доступны в коллекции портов FreeBSD. Протокол DHCP полностью описан в http://www.freesoft.org/CIE/RFC/2131/[RFC 2131]. Информационные ресурсы также доступны на http://www.isc.org/downloads/dhcp/[isc.org/downloads/dhcp/].

source: This section describes how to use the built-in DHCP client. It then describes how to install and configure a DHCP server.
ko: 이 섹션에서는 기본 제공 DHCP 클라이언트를 사용하는 방법을 설명합니다. 그런 다음 DHCP 서버를 설치하고 구성하는 방법을 설명합니다.
ru: Этот раздел описывает, как использовать встроенный DHCP-клиент. Затем он описывает, как установить и настроить DHCP-сервер.

source: In FreeBSD, the man:bpf[4] device is needed by both the DHCP server and DHCP client. This device is included in the [.filename]#GENERIC# kernel that is installed with FreeBSD. Users who prefer to create a custom kernel need to keep this device if DHCP is used.
ko: FreeBSD에서, man:bpf[4] 장치는 DHCP 서버와 DHCP 클라이언트 모두에 필요합니다. 이 장치는 FreeBSD와 함께 설치되는 [.filename]#GENERIC# 커널에 포함되어 있습니다. 사용자 정의 커널을 만들고자 하는 사용자는 DHCP를 사용하는 경우 이 장치를 유지해야 합니다.
ru: В FreeBSD устройство man:bpf[4] необходимо как для сервера DHCP, так и для клиента DHCP. Это устройство включено в ядро [.filename]#GENERIC#, которое устанавливается с FreeBSD. Пользователям, предпочитающим создавать собственное ядро, необходимо оставить это устройство, если используется DHCP.

source: It should be noted that [.filename]#bpf# also allows privileged users to run network packet sniffers on that system.
ko: [.filename]#bpf#를 사용하면 권한 있는 사용자가 해당 시스템에서 네트워크 패킷 스니퍼를 실행할 수도 있습니다.
ru: Следует отметить, что [.filename]#bpf# также позволяет привилегированным пользователям запускать анализаторы сетевых пакетов в этой системе.

source: Configuring a DHCP Client
ko: DHCP 클라이언트 구성하기
ru: Настройка клиента DHCP

source: DHCP client support is included in the FreeBSD installer, making it easy to configure a newly installed system to automatically receive its networking addressing information from an existing DHCP server. Refer to crossref:bsdinstall[bsdinstall-post,"Accounts, Time Zone, Services and Hardening"] for examples of network configuration.
ko: DHCP 클라이언트 지원은 FreeBSD 설치 프로그램에 포함되어 있어, 새로 설치한 시스템이 기존 DHCP 서버로부터 네트워크 주소 정보를 자동으로 수신하도록 쉽게 구성할 수 있습니다. 네트워크 구성의 예는 crossref:bsdinstall[bsdinstall-post,”Accounts, Time Zone, Services and Hardening”]를 참조하세요.
ru: Поддержка DHCP-клиента включена в установщик FreeBSD, что позволяет легко настроить новую систему для автоматического получения сетевой адресации от существующего DHCP-сервера. Примеры настройки сети можно найти в разделе crossref:bsdinstall[bsdinstall-post,"Учетные записи, Часовая зона, Службы и Защита"].

source: When `dhclient` is executed on the client machine, it begins broadcasting requests for configuration information. By default, these requests use UDP port 68. The server replies on UDP port 67, giving the client an IP address and other relevant network information such as a subnet mask, default gateway, and DNS server addresses. This information is in the form of a DHCP "lease" and is valid for a configurable time. This allows stale IP addresses for clients no longer connected to the network to automatically be reused. DHCP clients can obtain a great deal of information from the server. An exhaustive list may be found in man:dhcp-options[5].
ko: 클라이언트 시스템에서 `dhclient`가 실행되면 구성 정보에 대한 브로드캐스트 요청을 시작합니다. 기본적으로 이러한 요청은 UDP 포트 68을 사용합니다. 서버는 UDP 포트 67로 응답하여 클라이언트에 IP 주소와 서브넷 마스크, 기본 게이트웨이 및 DNS 서버 주소와 같은 기타 관련 네트워크 정보를 제공합니다. 이 정보는 DHCP “임대” 형태로 제공되며 구성 가능한 시간 동안 유효합니다. 따라서 더 이상 네트워크에 연결되지 않는 클라이언트의 오래된 IP 주소를 자동으로 재사용할 수 있습니다. DHCP 클라이언트는 서버로부터 많은 정보를 얻을 수 있습니다. 전체 목록은 man:dhcp-options[5]에서 확인할 수 있습니다.
ru: Когда `dhclient` выполняется на клиентской машине, он начинает транслировать запросы на получение конфигурационной информации. По умолчанию эти запросы используют UDP-порт 68. Сервер отвечает на UDP-порту 67, предоставляя клиенту IP-адрес и другую соответствующую сетевую информацию, такую как маска подсети, шлюз по умолчанию и адреса DNS-серверов. Эта информация предоставляется в форме "аренды" DHCP и действительна в течение настраиваемого времени. Это позволяет автоматически повторно использовать устаревшие IP-адреса для клиентов, которые больше не подключены к сети. Клиенты DHCP могут получить от сервера большое количество информации. Полный список можно найти в man:dhcp-options[5].

source: By default, when a FreeBSD system boots, its DHCP client runs in the background, or _asynchronously_. Other startup scripts continue to run while the DHCP process completes, which speeds up system startup.
ko: 기본적으로 FreeBSD 시스템이 부팅되면 DHCP 클라이언트가 백그라운드에서 실행되거나 _비동기적으로_ 실행됩니다. DHCP 프로세스가 완료되는 동안 다른 시작 스크립트가 계속 실행되므로 시스템 시작 속도가 빨라집니다.
ru: По умолчанию, при загрузке системы FreeBSD её DHCP-клиент работает в фоновом режиме или _асинхронно_. Другие скрипты запуска продолжают выполняться, пока завершается процесс DHCP, что ускоряет загрузку системы.

source: Background DHCP works well when the DHCP server responds quickly to the client's requests. However, DHCP may take a long time to complete on some systems. If network services attempt to run before DHCP has assigned the network addressing information, they will fail. Using DHCP in _synchronous_ mode prevents this problem as it pauses startup until the DHCP configuration has completed.
ko: 백그라운드 DHCP는 DHCP 서버가 클라이언트의 요청에 빠르게 응답할 때 잘 작동합니다. 그러나 일부 시스템에서는 DHCP를 완료하는 데 시간이 오래 걸릴 수 있습니다. DHCP가 네트워크 주소 지정 정보를 할당하기 전에 네트워크 서비스가 실행을 시도하면 실패합니다. _동기화_모드에서 DHCP를 사용하면 DHCP 구성이 완료될 때까지 시작을 일시 중지하므로 이 문제를 방지할 수 있습니다.
ru: DHCP в фоновом режиме работает хорошо, когда сервер DHCP быстро отвечает на запросы клиента. Однако на некоторых системах выполнение DHCP может занять много времени. Если сетевые службы пытаются запуститься до того, как DHCP назначит информацию о сетевой адресации, они завершатся с ошибкой. Использование DHCP в _синхронном_ режиме предотвращает эту проблему, приостанавливая запуск до завершения настройки DHCP.

source: This line in [.filename]#/etc/rc.conf# is used to configure background or asynchronous mode:
ko: [.filename]#/etc/rc.conf#의 이 줄은 백그라운드 또는 비동기 모드를 구성하는 데 사용됩니다:
ru: Эта строка в [.filename]#/etc/rc.conf# используется для настройки фонового или асинхронного режима:
