Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: This line may already exist if the system was configured to use DHCP during installation. Replace the _fxp0_ shown in these examples with the name of the interface to be dynamically configured, as described in crossref:config[config-network-setup,“Setting Up Network Interface Cards”].
ko: 설치 중에 시스템이 DHCP를 사용하도록 구성되었다면 이 줄이 이미 존재할 수 있습니다. 이 예제에 표시된 _fxp0_을 crossref:config[config-network-setup,“Setting Up Network Interface Cards”]에 설명한 대로 동적으로 구성할 인터페이스의 이름으로 바꿉니다.
ru: Эта строка может уже существовать, если система была настроена на использование DHCP во время установки. Замените `_fxp0_`, указанный в этих примерах, на имя интерфейса, который нужно настроить динамически, как описано в crossref:config[config-network-setup,"Настройка сетевых интерфейсов"].

source: To instead configure the system to use synchronous mode, and to pause during startup while DHCP completes, use "`SYNCDHCP`":
ko: 동기 모드(Synchronous mode)를 사용하도록 시스템을 구성하고 DHCP가 완료되는 동안 시작 중에 일시중지를 하려면 “`SYNCDHCP`”를 사용합니다:
ru: Для настройки системы на использование синхронного режима с приостановкой во время запуска до завершения DHCP используйте "`SYNCDHCP`":

source: Additional client options are available. Search for `dhclient` in man:rc.conf[5] for details.
ko: 추가 클라이언트 옵션을 사용할 수 있습니다. 자세한 내용은 man:rc.conf[5]에서 `dhclient`를 검색하세요.
ru: Есть еще несколько опций клиента. Подробности смотрите в man:rc.conf[5], выполнив поиск по `dhclient`.

source: The DHCP client uses the following files:
ko: DHCP 클라이언트는 다음 파일들을 사용합니다:
ru: Клиент DHCP использует следующие файлы:

source: The configuration file used by `dhclient`. Typically, this file contains only comments as the defaults are suitable for most clients. This configuration file is described in man:dhclient.conf[5].
ko: `dhclient`에서 사용하는 구성 파일입니다. 일반적으로 이 파일에는 기본값이 대부분의 클라이언트에 적합하므로 주석만 포함되어 있습니다. 이 구성 파일은 man:dhclient.conf[5]에서 자세히 설명하고 있습니다.
ru: Файл конфигурации, используемый `dhclient`. Обычно этот файл содержит только комментарии, так как значения по умолчанию подходят для большинства клиентов. Этот конфигурационный файл описан в man:dhclient.conf[5].

source: More information about the command itself can be found in man:dhclient[8].
ko: 명령 자체에 대한 자세한 정보는 man:dhclient[8]에서 확인할 수 있습니다.
ru: Дополнительную информацию о самой команде можно найти в man:dhclient[8].

source: The FreeBSD-specific DHCP client configuration script. It is described in man:dhclient-script[8], but should not need any user modification to function properly.
ko: FreeBSD 전용 DHCP 클라이언트 구성 스크립트. 이 스크립트는 man:dhclient-script[8]에 설명되어 있지만, 제대로 작동하기 위해 사용자가 수정할 필요는 없습니다.
ru: Специфичный для FreeBSD скрипт конфигурации DHCP-клиента. Он описан в man:dhclient-script[8], но для правильной работы не требует изменений со стороны пользователя.

source: The DHCP client keeps a database of valid leases in this file, which is written as a log and is described in man:dhclient.leases[5].
ko: DHCP 클라이언트는 이 파일에 유효한 임대 데이터베이스를 보관하며, 이 데이터베이스는 로그로 작성되어 man:dhclient.leases[5]에 설명되어 있습니다.
ru: Клиент DHCP сохраняет базу данных действительных аренд в этом файле, который записывается как журнал и описывается в man:dhclient.leases[5].

source: Installing and Configuring a DHCP Server
ko: DHCP 서버 설치와 구성하기
ru: Установка и настройка сервера DHCP

source: This section demonstrates how to configure a FreeBSD system to act as a DHCP server using the Internet Systems Consortium (ISC) implementation of the DHCP server. This implementation and its documentation can be installed using the package:net/isc-dhcp44-server[] package or port.
ko: 이 섹션에서는 DHCP 서버의 인터넷 시스템 컨소시엄(Internet Systems Consortium, ISC) 구현을 사용하여 FreeBSD 시스템이 DHCP 서버로 작동하도록 구성하는 방법을 설명합니다. 이 구현과 해당 문서는 package:net/isc-dhcp44-server[] 패키지 또는 포트를 사용하여 설치할 수 있습니다.
ru: В этом разделе показано, как настроить систему FreeBSD в качестве DHCP-сервера с использованием реализации DHCP-сервера от Консорциума Интернет-систем (ISC —Internet Systems Consortium). Эту реализацию и её документацию можно установить с помощью пакета package:net/isc-dhcp44-server[] или порта.

source: The installation of package:net/isc-dhcp44-server[] installs a sample configuration file. Copy [.filename]#/usr/local/etc/dhcpd.conf.example# to [.filename]#/usr/local/etc/dhcpd.conf# and make any edits to this new file.
ko: package:net/isc-dhcp44-server[]를 설치하면 샘플 구성 파일이 설치됩니다. [.filename]#/usr/local/etc/dhcpd.conf.example#를 [.filename]#/usr/local/etc/dhcpd.conf.example#에 복사하고 이 새 파일을 편집합니다.
ru: Установка пакета package:net/isc-dhcp44-server[] включает образец файла конфигурации. Скопируйте [.filename]#/usr/local/etc/dhcpd.conf.example# в [.filename]#/usr/local/etc/dhcpd.conf# и внесите необходимые изменения в этот новый файл.

source: The configuration file is comprised of declarations for subnets and hosts which define the information that is provided to DHCP clients. For example, these lines configure the following:
ko: 구성 파일은 서브넷 및 호스트에 대한 선언으로 구성되며, 이 선언은 DHCP 클라이언트에 제공되는 정보를 정의합니다. 예를 들어, 다음 내용은 해당 내용을 구성합니다:
ru: Файл конфигурации состоит из объявлений для подсетей и хостов, которые определяют информацию, предоставляемую клиентам DHCP. Например, следующие строки настраивают следующее:

source: This option specifies the default search domain that will be provided to clients. Refer to man:resolv.conf[5] for more information.
ko: 이 옵션은 클라이언트에 제공될 기본 검색 도메인을 지정합니다. 자세한 내용은 man:resolv.conf[5]를 참조하세요.
ru: Этот параметр задаёт домен поиска по умолчанию, который будет предоставляться клиентам. Дополнительную информацию можно найти в man:resolv.conf[5].

source: This option specifies a comma separated list of DNS servers that the client should use. They can be listed by their Fully Qualified Domain Names (FQDN), as seen in the example, or by their IP addresses.
ko: 이 옵션은 클라이언트가 사용해야 하는 DNS 서버의 쉼표로 구분된 목록을 지정합니다. 서버는 예시에서와 같이 FQDN(정규화된 도메인 이름)으로 나열하거나 IP 주소로 나열할 수 있습니다.
ru: Эта опция определяет разделённый запятыми список DNS-серверов, которые должен использовать клиент. Они могут быть указаны по их Полным Доменным Именам (FQDN), как показано в примере, или по их IP-адресам.

source: The subnet mask that will be provided to clients.
ko: 클라이언트에 제공될 서브넷 마스크입니다.
ru: Маска подсети, которая будет предоставлена клиентам.

source: The default lease expiry time in seconds. A client can be configured to override this value.
ko: 기본 임대 만료 시간(초)입니다. 클라이언트가 이 값을 재정의하도록 구성할 수 있습니다.
ru: Время истечения аренды по умолчанию в секундах. Клиент может быть настроен для переопределения этого значения.

source: The maximum allowed length of time, in seconds, for a lease. Should a client request a longer lease, a lease will still be issued, but it will only be valid for `max-lease-time`.
ko: 임대에 허용되는 최대 기간(초)입니다. 클라이언트가 더 긴 임대를 요청하는 경우에도 임대가 발급되지만 `max-lease-time`을 넘길수는 없습니다.
ru: Максимально допустимая продолжительность аренды в секундах. Если клиент запросит аренду на более длительный срок, аренда всё равно будет выдана, но будет действительна только в течение `max-lease-time`.

source: The default of `none` disables dynamic DNS updates. Changing this to `interim` configures the DHCP server to update a DNS server whenever it hands out a lease so that the DNS server knows which IP addresses are associated with which computers in the network. Do not change the default setting unless the DNS server has been configured to support dynamic DNS.
ko: 기본값인 `none`은 동적 DNS 업데이트를 비활성화합니다. 이 설정을 `interim`으로 변경하면 DHCP 서버가 임대를 제공할 때마다 DNS 서버를 업데이트하도록 구성하여 DNS 서버가 네트워크의 어떤 IP 주소가 어떤 컴퓨터와 연결되어 있는지 알 수 있도록 합니다. DNS 서버가 동적 DNS를 지원하도록 구성되지 않은 경우 기본 설정을 변경하지 마세요.
ru: Значение по умолчанию `none` отключает динамические обновления DNS. Изменение этого параметра на `interim` настраивает DHCP-сервер на обновление DNS-сервера при каждой выдаче аренды, чтобы DNS-сервер знал, какие IP-адреса связаны с какими компьютерами в сети. Не изменяйте значение по умолчанию, если DNS-сервер не настроен для поддержки динамического DNS.

source: This line creates a pool of available IP addresses which are reserved for allocation to DHCP clients. The range of addresses must be valid for the network or subnet specified in the previous line.
ko: 이 줄은 DHCP 클라이언트에 할당하기 위해 예약된 사용 가능한 IP 주소 풀을 생성합니다. 주소 범위는 이전 줄에 지정된 네트워크 또는 서브넷에 유효해야 합니다.
ru: Эта строка создает пул доступных IP-адресов, зарезервированных для выделения клиентам DHCP. Диапазон адресов должен быть действительным для сети или подсети, указанной в предыдущей строке.

source: Declares the default gateway that is valid for the network or subnet specified before the opening `{` bracket.
ko: 여는 `{` 괄호 앞에 지정된 네트워크 또는 서브넷에 유효한 기본 게이트웨이를 선언합니다.
ru: Объявляет шлюз по умолчанию, действительный для сети или подсети, указанной перед открывающей скобкой `{`.

source: Specifies the hardware MAC address of a client so that the DHCP server can recognize the client when it makes a request.
ko: 클라이언트가 요청할 때 DHCP 서버가 클라이언트를 인식할 수 있도록 클라이언트의 하드웨어 MAC 주소를 지정합니다.
ru: Указывает аппаратный MAC-адрес клиента, чтобы DHCP-сервер мог распознать клиента при его запросе.

source: Specifies that this host should always be given the same IP address. Using the hostname is correct, since the DHCP server will resolve the hostname before returning the lease information.
ko: 이 호스트에 항상 동일한 IP 주소를 할당하도록 지정합니다. DHCP 서버가 임대 정보를 반환하기 전에 호스트 이름을 확인하므로 호스트 이름을 사용하는 것이 올바릅니다.
ru: Указывает, что данный узел всегда должен получать один и тот же IP-адрес. Использование имени узла корректно, так как DHCP-сервер разрешит имя узла перед возвратом информации об аренде.

source: This configuration file supports many more options. Refer to dhcpd.conf(5), installed with the server, for details and examples.
ko: 이 설정 파일은 더 많은 옵션을 지원합니다. 자세한 내용과 예제는 서버와 함께 설치되는 dhcpd.conf(5)를 참조하세요.
ru: Этот файл конфигурации поддерживает гораздо больше опций. Подробности и примеры смотрите в dhcpd.conf(5), который устанавливается вместе с сервером.

source: Once the configuration of [.filename]#dhcpd.conf# is complete, enable the DHCP server in [.filename]#/etc/rc.conf#:
ko: [.filename]#dhcpd.conf#의 구성이 완료되면 [.filename]#/etc/rc.conf#에서 DHCP 서버를 활성화합니다:
ru: После завершения настройки [.filename]#dhcpd.conf# включите DHCP-сервер в [.filename]#/etc/rc.conf#:

source: Replace the `dc0` with the interface (or interfaces, separated by whitespace) that the DHCP server should listen on for DHCP client requests.
ko: 공백으로 구분된 `dc0`을 DHCP 서버가 DHCP 클라이언트 요청에 대해 수신 대기해야 하는 인터페이스로 바꿉니다.
ru: Замените `dc0` на интерфейс (или интерфейсы, разделенные пробелами), на котором DHCP-сервер должен ожидать запросы от DHCP-клиентов.

source: Start the server by issuing the following command:
ko: 다음 명령을 실행하여 서버를 시작합니다:
ru: Запустите сервер, выполнив следующую команду:

source: Any future changes to the configuration of the server will require the dhcpd service to be stopped and then started using man:service[8].
ko: 향후 서버 구성을 변경하려면 dhcpd 서비스를 중지한 다음 man:service[8]를 사용하여 시작해야 합니다.
ru: Любые последующие изменения конфигурации сервера потребуют остановки и последующего запуска службы dhcpd с помощью man:service[8].

source: The DHCP server uses the following files. Note that the manual pages are installed with the server software.
ko: DHCP 서버는 다음 파일을 사용합니다. 매뉴얼 페이지는 서버 소프트웨어와 함께 설치됩니다.
ru: Сервер DHCP использует следующие файлы. Обратите внимание, что страницы руководства устанавливаются вместе с серверным программным обеспечением.

source: More information about the dhcpd server can be found in dhcpd(8).
ko: dhcpd 서버에 대한 자세한 정보는 dhcpd(8)에서 확인할 수 있습니다.
ru: Дополнительную информацию о сервере dhcpd можно найти в dhcpd(8).

source: The server configuration file needs to contain all the information that should be provided to clients, along with information regarding the operation of the server. This configuration file is described in dhcpd.conf(5).
ko: 서버 구성 파일에는 서버 작동에 관한 정보와 함께 클라이언트에 제공해야 하는 모든 정보가 포함되어야 합니다. 이 구성 파일은 dhcpd.conf(5)에 설명되어 있습니다.
ru: Файл конфигурации сервера должен содержать всю информацию, которую необходимо предоставить клиентам, а также сведения о работе сервера. Этот конфигурационный файл описан в dhcpd.conf(5).

source: The DHCP server keeps a database of leases it has issued in this file, which is written as a log. Refer to dhcpd.leases(5), which gives a slightly longer description.
ko: DHCP 서버는 이 파일에 발급한 임대 데이터베이스를 보관하며, 이 데이터베이스는 로그로 기록됩니다. 조금 더 자세한 설명은 dhcpd.leases(5)를 참조하세요.
ru: Сервер DHCP ведет базу данных выданных аренд в этом файле, который записывается в виде журнала. Обратитесь к dhcpd.leases(5), где приводится несколько более подробное описание.

source: This daemon is used in advanced environments where one DHCP server forwards a request from a client to another DHCP server on a separate network. If this functionality is required, install the package:net/isc-dhcp44-relay[] package or port. The installation includes dhcrelay(8) which provides more detail.
ko: 이 데몬은 한 DHCP 서버가 클라이언트의 요청을, 별도의 네트워크에 있는 다른 DHCP 서버로 전달하는 고급 환경에서 사용됩니다. 이 기능이 필요한 경우 package:net/isc-dhcp44-relay[] 패키지 또는 포트를 설치하세요. 이 설치에 대한 더 자세한 내용은 함께 제공되는 dhcrelay(8)에 포함되어 있습니다.
ru: Этот демон используется в сложных средах, где один DHCP-сервер перенаправляет запрос от клиента другому DHCP-серверу в отдельной сети. Если требуется такая функциональность, установите пакет package:net/isc-dhcp44-relay[] или соответствующий порт. Установка включает dhcrelay(8), где приведены более подробные сведения.

source: Domain Name System (DNS)
ko: 도메인 네임 시스템(DNS)
ru: Система доменных имен (DNS)

source: Domain Name System (DNS) is the protocol through which domain names are mapped to IP addresses, and vice versa. DNS is coordinated across the Internet through a somewhat complex system of authoritative root, Top Level Domain (TLD), and other smaller-scale name servers, which host and cache individual domain information. It is not necessary to run a name server to perform DNS lookups on a system.
ko: DNS(도메인 네임 시스템)는 도메인 네임이 IP 주소에 매핑되거나 그 반대로 매핑되는 형태의 프로토콜입니다. DNS는 개별 도메인 정보를 호스팅하고 캐시하는 권한 있는 루트, TLD(최상위 도메인) 및 기타 소규모 네임 서버로 구성된 다소 복잡한 시스템을 통해 인터넷 전체에서 조정됩니다. 시스템에서 DNS 조회를 수행하기 위해 네임 서버를 실행할 필요는 없습니다.
ru: Система доменных имен (DNS) — это протокол, который сопоставляет доменные имена с IP-адресами и наоборот. DNS координируется в масштабах Интернета через довольно сложную систему авторитетных корневых серверов, серверов доменов верхнего уровня (TLD — Top Level Domain) и других менее масштабных серверов имен, которые хранят и кэшируют информацию об отдельных доменах. Для выполнения DNS-запросов в системе не обязательно запускать сервер имен.

source: The following table describes some of the terms associated with DNS:
ko: 다음 표에서는 DNS와 관련된 몇 가지 용어에 대해 설명합니다:
ru: Следующая таблица описывает некоторые термины, связанные с DNS:

source: DNS Terminology
ko: DNS 용어
ru: Терминология DNS

source: Definition
ko: 정의
ru: Определение

source: Forward DNS
ru: Прямая запись DNS (Forward DNS)

source: Mapping of hostnames to IP addresses.
ko: IP 주소를 호스트 네임에 매핑.
ru: Сопоставление имен хостов с IP-адресами.

source: Origin
ru: Зона ответственности (Origin)

source: Refers to the domain covered in a particular zone file.
ko: 특정 영역(zone) 파일에서 다루는 도메인을 나타냅니다.
ru: Относится к домену, охватываемому определенным файлом зоны.

source: Resolver
ko: 리졸버(Resolver)
ru: Резолвер (Resolver)

source: A system process through which a machine queries a name server for zone information.
ko: 컴퓨터가 네임 서버에 영역 정보를 쿼리하는 시스템 프로세스.
ru: Системный процесс, с помощью которого машина запрашивает у сервера имен информацию о зоне.

source: Reverse DNS
ko: 역참조 DNS
ru: Обратная запись DNS (Reverse DNS)

source: Mapping of IP addresses to hostnames.
ko: IP 주소를 호스트 네임에 매핑.
ru: Сопоставление IP-адресов с именами хостов.

source: Root zone
ru: Корневая зона (Root zone)

source: The beginning of the Internet zone hierarchy. All zones fall under the root zone, similar to how all files in a file system fall under the root directory.
ko: 인터넷 영역 계층 구조의 시작입니다. 모든 영역은 파일 시스템의 모든 파일이 루트 디렉터리에 속하는 것과 유사하게 루트 영역 아래에 속합니다.
ru: Начало иерархии зон Интернета. Все зоны находятся под корневой зоной, аналогично тому, как все файлы в файловой системе находятся под корневым каталогом.

source: Zone
ru: Зона (Zone)

source: An individual domain, subdomain, or portion of the DNS administered by the same authority.
ko: 동일한 기관에서 관리하는 개별 도메인, 하위 도메인 또는 DNS의 일부.
ru: Отдельный домен, поддомен или часть DNS, управляемые одной организацией.

source: Examples of zones:
ko: 영역(zone)의 예:
ru: Примеры зон:

source: `.` is how the root zone is usually referred to in documentation.
ko: `.` 는 일반적으로 문서에서 루트 영역을 지칭하는 방식입니다.
ru: `.` — так обычно обозначается корневая зона в документации.

source: `org.` is a Top Level Domain (TLD) under the root zone.
ko: `org.`는 루트 영역 아래의 최상위 도메인(TLD)입니다.
ru: `org.` — это домен верхнего уровня (TLD) в корневой зоне.

source: `example.org.` is a zone under the `org.`TLD.
ko: `example.org.` 는 `org.`TLD 아래의 영역입니다.
ru: `example.org.` — это зона под доменом `org.`.

source: `1.168.192.in-addr.arpa` is a zone referencing all IP addresses which fall under the `192.168.1.*`IP address space.
ko: `1.168.192.in-addr.arpa`는 `192.168.1.*` IP 주소 공간에 속하는 모든 IP 주소를 참조하는 영역입니다.
ru: `1.168.192.in-addr.arpa` — это зона, содержащая ссылки на все IP-адреса, входящие в адресное пространство `192.168.1.*`.

source: As one can see, the more specific part of a hostname appears to its left. For example, `example.org.` is more specific than `org.`, as `org.` is more specific than the root zone. The layout of each part of a hostname is much like a file system: the [.filename]#/dev# directory falls within the root, and so on.
ko: 보시다시피 호스트 이름의 더 구체적인 부분은 왼쪽에 표시됩니다. 예를 들어, `example.org.`는 `org.`보다 더 구체적인데, 이는 `org.`가 루트 영역보다 더 구체적이기 때문입니다. 호스트 이름의 각 부분의 레이아웃은 파일 시스템과 매우 유사합니다: [.filename]#/dev# 디렉토리는 루트 디렉터리 아래에 속하고, 서브 디렉터리는 그 아래에 속하는 방식입니다.
ru: Как видно, более специфичная часть имени хоста расположена слева. Например, `example.org.` более специфично, чем `org.`, а `org.` более специфично, чем корневая зона. Структура каждой части имени хоста во многом напоминает файловую систему: каталог [.filename]#/dev# находится в корне и так далее.

source: Reasons to Run a Name Server
ko: 네임 서버를 운영해야 하는 이유
ru: Причины для запуска сервера имен

source: Name servers generally come in two forms: authoritative name servers, and caching (also known as resolving) name servers.
ko: 네임 서버는 일반적으로 권한 있는 네임 서버와 캐싱(리졸버라고도 함) 네임 서버의 두 가지 형태로 제공됩니다.
ru: Серверы имен обычно бывают двух видов: авторитетные DNS-серверы и кэширующие DNS-серверы (также известные как резолвинг-серверы).

source: An authoritative name server is needed when:
ko: 다음과 같은 경우 권한 있는 네임 서버가 필요합니다:
ru: Авторитетный сервер имен необходим, когда:

source: One wants to serve DNS information to the world, replying authoritatively to queries.
ko: 전 세계에 DNS 정보를 제공하여 쿼리에 권위 있게 응답하고자 합니다.
ru: Хочется предоставлять DNS-информацию для всего мира, отвечая на запросы авторитетно.

source: A domain, such as `example.org`, is registered and IP addresses need to be assigned to hostnames under it.
ko: `example.org`와 같은 도메인을 등록하고 그 아래 호스트 네임에 IP 주소를 할당해야 합니다.
ru: Домен, например `example.org`, зарегистрирован, и IP-адреса должны быть назначены именам хостов в нём.

source: An IP address block requires reverse DNS entries (IP to hostname).
ko: IP 주소 블록에는 역참조 DNS 항목(IP에서 호스트 이름으로)이 필요합니다.
ru: Блок IP-адресов требует обратных DNS-записей (IP к имени хоста).

source: A backup or second name server, called a slave, will reply to queries.
ko: 슬레이브라고 하는 백업 또는 두 번째 네임 서버가 쿼리에 응답할 수 있습니다.
ru: Резервный или вторичный сервер имен, называемый подчиненным (slave), будет отвечать на запросы.

source: A caching name server is needed when:
ko: 캐싱 네임 서버는 다음과 같은 경우에 필요합니다:
ru: Кэширующий сервер имен необходим, когда:

source: A local DNS server may cache and respond more quickly than querying an outside name server.
ko: 로컬 DNS 서버는 외부 네임 서버를 쿼리하는 것보다 더 빠르게 캐시하고 응답할 수 있습니다.
ru: Локальный DNS-сервер может кэшировать и отвечать быстрее, чем запрос к внешнему серверу имен.

source: When one queries for `www.FreeBSD.org`, the resolver usually queries the uplink ISP's name server, and retrieves the reply. With a local, caching DNS server, the query only has to be made once to the outside world by the caching DNS server. Additional queries will not have to go outside the local network, since the information is cached locally.
ko: 일반적으로 `www.FreeBSD.org`을 쿼리하면 리졸버는 업링크 ISP의 네임 서버에 쿼리하고 응답을 검색합니다. 로컬 캐싱 DNS 서버를 사용하면 캐싱 DNS 서버를 통해 외부로 한 번만 쿼리하면 됩니다. 정보가 로컬에 캐시되므로 추가 쿼리는 로컬 네트워크 외부로 나갈 필요가 없습니다.
ru: Когда кто-нибудь запрашивает информацию о `www.FreeBSD.org`, резолвер обычно обращается к серверу имен провайдера и получает ответ. При использовании локального кэширующего DNS-сервера запрос во внешний мир выполняется только один раз этим сервером. Дополнительные запросы не будут выходить за пределы локальной сети, так как информация сохраняется в локальном кэше.

source: DNS Server Configuration
ko: DNS 서버 구성
ru: Конфигурация DNS-сервера

source: Unbound is provided in the FreeBSD base system. By default, it will provide DNS resolution to the local machine only. While the base system package can be configured to provide resolution services beyond the local machine, it is recommended that such requirements be addressed by installing Unbound from the FreeBSD Ports Collection.
ko: 언바운드는 FreeBSD 기본 시스템에서 제공됩니다. 기본적으로 로컬 머신에 대해서만 DNS 확인을 제공합니다. 기본 시스템 패키지는 로컬 머신을 넘어서는 확인 서비스를 제공하도록 구성할 수 있지만, 이러한 요구사항은 FreeBSD 포트 컬렉션에서 언바운드를 설치하여 해결하는 것이 좋습니다.
ru: Unbound включён в базовую систему FreeBSD. По умолчанию он предоставляет разрешение DNS только для локальной машины. Хотя пакет базовой системы можно настроить для предоставления служб разрешения за пределами локальной машины, рекомендуется удовлетворять такие требования путём установки Unbound из коллекции портов FreeBSD.

source: To enable Unbound, add the following to [.filename]#/etc/rc.conf#:
ko: 언바인드를 사용 설정하려면 [.filename]#/etc/rc.conf#에 다음을 추가합니다:
ru: Чтобы включить Unbound, добавьте следующую строку в [.filename]#/etc/rc.conf#:

source: Any existing nameservers in [.filename]#/etc/resolv.conf# will be configured as forwarders in the new Unbound configuration.
ko: [.filename]#/etc/resolv.conf#에 있는 모든 기존 네임서버는 새 언바운드 구성에서 전달자(forwarder)로 구성됩니다.
ru: Любые существующие серверы имен в [.filename]#/etc/resolv.conf# будут настроены как серверы пересылки в новой конфигурации Unbound.

source: If any of the listed nameservers do not support DNSSEC, local DNS resolution will fail. Be sure to test each nameserver and remove any that fail the test. The following command will show the trust tree or a failure for a nameserver running on `192.168.1.1`:
ko: 나열된 네임서버 중 하나라도 DNSSEC을 지원하지 않는 경우 로컬 DNS 확인이 실패합니다. 각 네임서버를 테스트하고 테스트에 실패한 네임서버를 제거해야 합니다. 다음 명령은 `192.168.1.1`에서 실행 중인 네임서버의 트러스트 트리 또는 실패를 표시합니다:
ru: Если какой-либо из перечисленных серверов имен не поддерживает DNSSEC, локальное разрешение DNS завершится неудачей. Обязательно протестируйте каждый сервер имен и удалите те, которые не прошли проверку. Следующая команда покажет дерево доверия или ошибку для сервера имен, работающего на `192.168.1.1`:

source: Once each nameserver is confirmed to support DNSSEC, start Unbound:
ko: 각 네임서버가 DNSSEC을 지원하는 것으로 확인되면 언바인딩을 시작합니다:
ru: После подтверждения поддержки DNSSEC каждым сервером имен, запустите Unbound:

source: This will take care of updating [.filename]#/etc/resolv.conf# so that queries for DNSSEC secured domains will now work. For example, run the following to validate the FreeBSD.org DNSSEC trust tree:
ko: 이렇게 하면 [.filename]#/etc/resolv.conf#을 업데이트하여 이제 DNSSEC 보안 도메인에 대한 쿼리가 작동하게 됩니다. 예를 들어, 다음을 실행하여 FreeBSD.org DNSSEC 트러스트 트리의 유효성을 검사합니다:
ru: Это обеспечит обновление [.filename]#/etc/resolv.conf#, чтобы запросы к доменам, защищённым DNSSEC, теперь работали. Например, выполните следующую команду для проверки дерева доверия DNSSEC FreeBSD.org:
