Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network-servers/_index.po
Languages: ko, ru

source: NIS servers and clients share an NIS domain name. Typically, this name does not have anything to do with DNS.
ko: NIS 서버와 클라이언트는 NIS 도메인 이름을 공유합니다. 일반적으로 이 이름은 DNS와 관련이 없습니다.
ru: Серверы и клиенты NIS используют общее имя домена NIS. Как правило, это имя не связано с DNS.

source: This service enables RPC and must be running in order to run an NIS server or act as an NIS client.
ko: 이 서비스는 RPC를 사용하도록 설정하며, NIS 서버를 실행하거나 NIS 클라이언트로 작동하려면 반드시 실행 중이어야 합니다.
ru: Эта служба включает RPC и должна работать для запуска сервера NIS или работы в качестве клиента NIS.

source: This service binds an NIS client to its NIS server. It will take the NIS domain name and use RPC to connect to the server. It is the core of client/server communication in an NIS environment. If this service is not running on a client machine, it will not be able to access the NIS server.
ko: 이 서비스는 NIS 클라이언트를 NIS 서버에 바인딩합니다. 이 서비스는 NIS 도메인 이름을 취하고 RPC를 사용하여 서버에 연결합니다. 이 서비스는 NIS 환경에서 클라이언트/서버 통신의 핵심입니다. 이 서비스가 클라이언트 컴퓨터에서 실행되고 있지 않으면 NIS 서버에 액세스할 수 없습니다.
ru: Эта служба связывает клиент NIS с его сервером NIS. Она принимает имя домена NIS и использует RPC для подключения к серверу. Это основа клиент-серверного взаимодействия в среде NIS. Если эта служба не запущена на клиентской машине, она не сможет получить доступ к серверу NIS.

source: This is the process for the NIS server. If this service stops running, the server will no longer be able to respond to NIS requests so hopefully, there is a slave server to take over. Some non-FreeBSD clients will not try to reconnect using a slave server and the ypbind process may need to be restarted on these clients.
ko: 이것은 NIS 서버의 프로세스입니다. 이 서비스 실행이 중지되면 서버가 더 이상 NIS 요청에 응답할 수 없으므로 슬레이브 서버가 있다면 슬레이브 서버가 이를 대신합니다. 일부 FreeBSD가 아닌 클라이언트는 슬레이브 서버를 사용하여 다시 연결하려고 시도하지 않으므로 이러한 클라이언트에서 ypbind 프로세스를 다시 시작해야 할 수 있습니다.
ru: Это процесс для сервера NIS. Если эта служба перестанет работать, сервер больше не сможет отвечать на запросы NIS, поэтому, надеюсь, есть подчиненный сервер, который возьмет на себя управление. Некоторые клиенты, не относящиеся к FreeBSD, не будут пытаться переподключиться с использованием подчиненного сервера, и процесс ypbind, возможно, потребуется перезапустить на этих клиентах.

source: This process only runs on NIS master servers. This daemon allows NIS clients to change their NIS passwords. If this daemon is not running, users will have to login to the NIS master server and change their passwords there.
ko: 이 프로세스는 NIS 마스터 서버에서만 실행됩니다. 이 데몬을 통해 NIS 클라이언트는 NIS 암호를 변경할 수 있습니다. 이 데몬이 실행되고 있지 않으면 사용자가 NIS 마스터 서버에 로그인하여 거기서 암호를 변경해야 합니다.
ru: Этот процесс работает только на основных серверах NIS. Этот демон позволяет клиентам NIS изменять свои пароли в NIS. Если этот демон не запущен, пользователям придется входить на главный сервер NIS и изменять пароли там.

source: Machine Types
ko: 장비 유형
ru: Типы машин

source: There are three types of hosts in an NIS environment:
ko: NIS 환경에는 세 가지 유형의 호스트가 있습니다:
ru: В среде NIS существует три типа хостов:

source: NIS master server
ru: Основной сервер NIS

source: This server acts as a central repository for host configuration information and maintains the authoritative copy of the files used by all of the NIS clients. The [.filename]#passwd#, [.filename]#group#, and other various files used by NIS clients are stored on the master server. While it is possible for one machine to be an NIS master server for more than one NIS domain, this type of configuration will not be covered in this chapter as it assumes a relatively small-scale NIS environment.
ko: 이 서버는 호스트 구성 정보의 중앙 저장소 역할을 하며 모든 NIS 클라이언트에서 사용하는 권한에 대한 파일 사본을 유지 관리합니다. [.filename]#passwd#, [.filename]#group# 및 NIS 클라이언트에서 사용하는 기타 다양한 파일은 마스터 서버에 저장됩니다. 하나의 컴퓨터가 둘 이상의 NIS 도메인에 대한 NIS 마스터 서버가 될 수 있지만 이러한 유형의 구성은 비교적 작은 규모의 NIS 환경을 가정하므로 이 장에서는 다루지 않습니다.
ru: Этот сервер выступает в роли центрального хранилища информации о конфигурации хостов и содержит авторитетные копии файлов, используемых всеми клиентами NIS. Файлы [.filename]#passwd#, [.filename]#group# и другие, используемые клиентами NIS, хранятся на главном сервере. Хотя возможно, чтобы одна машина была основным сервером NIS для нескольких доменов NIS, такая конфигурация не рассматривается в этой главе, так как предполагается относительно небольшая среда NIS.

source: NIS slave servers
ru: Подчиненные серверы NIS

source: NIS slave servers maintain copies of the NIS master's data files in order to provide redundancy. Slave servers also help to balance the load of the master server as NIS clients always attach to the NIS server which responds first.
ko: NIS 슬레이브 서버는 중복성을 제공하기 위해 NIS 마스터 데이터 파일의 복사본을 유지합니다. 또한 슬레이브 서버는 NIS 클라이언트가 항상 먼저 응답하는 NIS 서버에 연결하므로 마스터 서버의 부하를 분산하는 데 도움이 됩니다.
ru: Подчинённые серверы NIS хранят копии файлов данных NIS главного сервера для обеспечения избыточности. Подчинённые серверы также помогают распределить нагрузку основного сервера, так как клиенты NIS всегда подключаются к NIS серверу, который отвечает первым.

source: NIS clients
ru: Клиенты NIS

source: NIS clients authenticate against the NIS server during log on.
ko: NIS 클라이언트는 로그온하는 동안 NIS 서버에 대해 인증을 진행합니다.
ru: Клиенты NIS проходят аутентификацию на сервере NIS при входе в систему.

source: Information in many files can be shared using NIS. The [.filename]#master.passwd#, [.filename]#group#, and [.filename]#hosts# files are commonly shared via NIS. Whenever a process on a client needs information that would normally be found in these files locally, it makes a query to the NIS server that it is bound to instead.
ko: 많은 파일에 있는 정보는 NIS를 사용하여 공유할 수 있습니다. [.filename]#master.passwd#, [.filename]#group# 및 [.filename]#hosts# 파일은 일반적으로 NIS를 통해 공유됩니다. 클라이언트의 프로세스가 로컬에서 일반적으로 이러한 파일에 있는 정보가 필요할 때마다 대신 바인딩된 NIS 서버에 쿼리를 수행합니다.
ru: Информация из многих файлов может быть совместно использована с помощью NIS. Файлы [.filename]#master.passwd#, [.filename]#group# и [.filename]#hosts# часто распространяются через NIS. Когда процессу на клиенте требуется информация, которая обычно находится в этих файлах локально, он отправляет запрос к связанному с ним NIS-серверу.

source: Planning Considerations
ko: 계획시 고려 사항
ru: Планирование и подготовка

source: This section describes a sample NIS environment which consists of 15 FreeBSD machines with no centralized point of administration. Each machine has its own [.filename]#/etc/passwd# and [.filename]#/etc/master.passwd#. These files are kept in sync with each other only through manual intervention. Currently, when a user is added to the lab, the process must be repeated on all 15 machines.
ko: 이 섹션에서는 중앙 집중식 관리 지점이 없는 15대의 FreeBSD 머신으로 구성된 샘플 NIS 환경에 대해 설명합니다. 각 머신에는 고유한 [.filename]#/etc/passwd# 및 [.filename]#/etc/master.passwd#가 있습니다. 이러한 파일은 수동 개입을 통해서만 서로 동기화 상태로 유지됩니다. 현재는 실습에 사용자를 추가할 때 15대의 모든 머신에서 이 과정을 반복해야 합니다.
ru: В этом разделе описывается пример среды NIS, состоящей из 15 машин FreeBSD без централизованной точки администрирования. На каждой машине есть свои файлы [.filename]#/etc/passwd# и [.filename]#/etc/master.passwd#. Эти файлы синхронизируются между собой только вручную. В настоящее время, когда в лабораторию добавляется новый пользователь, этот процесс необходимо повторять на всех 15 машинах.

source: The configuration of the lab will be as follows:
ko: 실습의 구성은 다음과 같습니다:
ru: Конфигурация лаборатории будет следующей:

source: Machine name
ko: 장비 이름
ru: Имя машины

source: IP address
ko: IP주소
ru: IP-адрес

source: Machine role
ko: 장비 역할
ru: Роль машины

source: NIS master
ru: Основной сервер NIS

source: NIS slave
ru: Подчиненный сервер NIS

source: Faculty workstation
ru: Факультетская рабочая станция

source: Client machine
ru: Клиентская машина

source: Other client machines
ru: Другие клиентские машины

source: If this is the first time an NIS scheme is being developed, it should be thoroughly planned ahead of time. Regardless of network size, several decisions need to be made as part of the planning process.
ko: NIS 체계를 처음 개발하는 경우, 사전에 철저히 계획해야 합니다. 네트워크 규모에 관계없이 계획 프로세스의 일부로 몇 가지 결정을 내려야 합니다.
ru: Если это первый раз, когда разрабатывается схема NIS, её следует тщательно спланировать заранее. Независимо от размера сети, в процессе планирования необходимо принять несколько решений.

source: Choosing a NIS Domain Name
ko: NIS 도메인 이름 선택하기
ru: Выбор имени домена NIS

source: When a client broadcasts its requests for info, it includes the name of the NIS domain that it is part of. This is how multiple servers on one network can tell which server should answer which request. Think of the NIS domain name as the name for a group of hosts.
ko: 클라이언트가 정보 요청을 브로드캐스트할 때 해당 클라이언트가 속한 NIS 도메인의 이름이 포함됩니다. 이를 통해 하나의 네트워크에 있는 여러 서버중 어떤 서버가 요청에 응답해야 하는지 알 수 있습니다. NIS 도메인 이름은 호스트 그룹의 이름이라고 생각하면 됩니다.
ru: Когда клиент рассылает широковещательные запросы на получение информации, он включает имя домена NIS, к которому принадлежит. Таким образом, несколько серверов в одной сети могут определить, какой сервер должен отвечать на конкретный запрос. Думайте о доменном имени NIS как об имени для группы хостов.

source: Some organizations choose to use their Internet domain name for their NIS domain name. This is not recommended as it can cause confusion when trying to debug network problems. The NIS domain name should be unique within the network and it is helpful if it describes the group of machines it represents. For example, the Art department at Acme Inc. might be in the "acme-art" NIS domain. This example will use the domain name `test-domain`.
ko: 일부 조직에서는 인터넷 도메인 이름을 NIS 도메인 이름으로 사용하기도 합니다. 이는 네트워크 문제를 디버깅할 때 혼동을 일으킬 수 있으므로 권장하지 않습니다. NIS 도메인 이름은 네트워크 내에서 고유해야 하며, 해당 도메인 이름이 나타내는 컴퓨터 그룹을 설명하는 것이 도움이 됩니다. 예를 들어, Acme Inc.의 미술 부서는 “acme-art” NIS 도메인에 있는 것이 좋습니다. 이 예에서는 도메인 이름 ‘test-domain’을 사용합니다.
ru: Некоторые организации предпочитают использовать своё доменное имя интернета в качестве имени домена NIS. Это не рекомендуется, так как может вызвать путаницу при попытках отладки сетевых проблем. Имя домена NIS должно быть уникальным в пределах сети, и полезно, если оно описывает группу машин, которую представляет. Например, художественный отдел компании Acme Inc. может находиться в домене NIS "acme-art". В этом примере будет использоваться имя домена `test-domain`.

source: However, some non-FreeBSD operating systems require the NIS domain name to be the same as the Internet domain name. If one or more machines on the network have this restriction, the Internet domain name _must_ be used as the NIS domain name.
ko: 그러나 일부 비FreeBSD 운영 체제에서는 NIS 도메인 이름이 인터넷 도메인 이름과 동일해야 합니다. 네트워크에 있는 하나 이상의 컴퓨터에 이 제한이 있는 경우, 인터넷 도메인 이름을 NIS 도메인 이름으로 _필수_ 사용해야 합니다.
ru: Однако некоторые операционные системы, отличные от FreeBSD, требуют, чтобы имя домена NIS совпадало с именем интернет-домена. Если одна или несколько машин в сети имеют это ограничение, _необходимо_ использовать имя интернет-домена в качестве имени домена NIS.

source: Physical Server Requirements
ko: 물리서버 요구사항
ru: Требования к физическому серверу

source: There are several things to keep in mind when choosing a machine to use as a NIS server. Since NIS clients depend upon the availability of the server, choose a machine that is not rebooted frequently. The NIS server should ideally be a stand alone machine whose sole purpose is to be an NIS server. If the network is not heavily used, it is acceptable to put the NIS server on a machine running other services. However, if the NIS server becomes unavailable, it will adversely affect all NIS clients.
ko: NIS 서버로 사용할 컴퓨터를 선택할 때 염두에 두어야 할 몇 가지 사항이 있습니다. NIS 클라이언트는 서버의 가용성에 따라 달라지므로 자주 재부팅하지 않는 컴퓨터를 선택하세요. NIS 서버는 NIS 서버로만 사용되는 독립 실행형 컴퓨터가 이상적입니다. 네트워크 사용량이 많지 않은 경우 다른 서비스를 실행하는 컴퓨터에 NIS 서버를 설치해도 됩니다. 그러나 NIS 서버를 사용할 수 없게 되면 모든 NIS 클라이언트에 부정적인 영향을 미칩니다.
ru: Есть несколько моментов, которые следует учитывать при выборе машины для использования в качестве сервера NIS. Поскольку клиенты NIS зависят от доступности сервера, следует выбрать машину, которая не перезагружается часто. Идеально, чтобы сервер NIS был отдельной машиной, единственной целью которой является быть сервером NIS. Если сеть не сильно загружена, допустимо разместить сервер NIS на машине, где выполняются другие службы. Однако, если сервер NIS станет недоступен, это негативно скажется на всех клиентах NIS.

source: Configuring the NIS Master Server
ko: NIS 마스터 서버 구성하기
ru: Настройка основного сервера NIS

source: The canonical copies of all NIS files are stored on the master server. The databases used to store the information are called NIS maps. In FreeBSD, these maps are stored in [.filename]#/var/yp/[domainname]# where [.filename]#[domainname]# is the name of the NIS domain. Since multiple domains are supported, it is possible to have several directories, one for each domain. Each domain will have its own independent set of maps.
ko: 모든 NIS 파일의 정식 사본은 마스터 서버에 저장됩니다. 정보를 저장하는 데 사용되는 데이터베이스를 NIS 맵이라고 합니다. FreeBSD에서 이러한 맵은 [.filename]#/var/yp/[domainname]#에 저장되며, 여기서 [.filename]#[domainname]#은 NIS 도메인의 이름입니다. 여러 도메인이 지원되므로 각 도메인마다 하나씩 여러 개의 디렉터리를 가질 수 있습니다. 각 도메인에는 고유한 독립적인 맵 세트가 있습니다.
ru: Канонические копии всех NIS-файлов хранятся на основном сервере. Базы данных, используемые для хранения информации, называются NIS-картами. В FreeBSD эти карты хранятся в [.filename]#/var/yp/[domainname]#, где [.filename]#[domainname]# — это имя NIS-домена. Поскольку поддерживается несколько доменов, возможно наличие нескольких каталогов, по одному для каждого домена. Каждый домен будет иметь свой независимый набор карт.

source: NIS master and slave servers handle all NIS requests through man:ypserv[8]. This daemon is responsible for receiving incoming requests from NIS clients, translating the requested domain and map name to a path to the corresponding database file, and transmitting data from the database back to the client.
ko: NIS 마스터 및 슬레이브 서버는 man:ypserv[8]를 통해 모든 NIS 요청을 처리합니다. 이 데몬은 NIS 클라이언트로부터 들어오는 요청을 수신하고, 요청된 도메인 및 맵 이름을 해당 데이터베이스 파일의 경로로 변환하고, 데이터베이스의 데이터를 클라이언트로 다시 전송하는 작업을 담당합니다.
ru: Основные и подчинённые серверы NIS обрабатывают все запросы NIS через man:ypserv[8]. Этот демон отвечает за приём входящих запросов от клиентов NIS, преобразование запрошенного домена и имени карты в путь к соответствующему файлу базы данных и передачу данных из базы обратно клиенту.

source: Setting up a master NIS server can be relatively straight forward, depending on environmental needs. Since FreeBSD provides built-in NIS support, it only needs to be enabled by adding the following lines to [.filename]#/etc/rc.conf#:
ko: 마스터 NIS 서버를 설정하는 것은 환경에 따라 비교적 간단할 수 있습니다. FreeBSD는 기본적으로 NIS 지원을 제공하므로 [.filename]#/etc/rc.conf#에 다음 줄을 추가하여 활성화하기만 하면 됩니다:
ru: Настройка основного NIS-сервера может быть относительно простой, в зависимости от потребностей окружения. Поскольку FreeBSD предоставляет встроенную поддержку NIS, её достаточно включить, добавив следующие строки в [.filename]#/etc/rc.conf#:

source: This line sets the NIS domain name to `test-domain`.
ko: 이 줄은 NIS 도메인 이름을 `test-domain`으로 설정합니다.
ru: Эта строка устанавливает имя домена NIS в `test-domain`.

source: This automates the start up of the NIS server processes when the system boots.
ko: 이것은 시스템이 부팅될 때 NIS 서버 프로세스가 자동으로 시작되도록 합니다.
ru: Это автоматизирует запуск процессов сервера NIS при загрузке системы.

source: This enables the man:rpc.yppasswdd[8] daemon so that users can change their NIS password from a client machine.
ko: 이것은 사용자가 클라이언트 컴퓨터에서 NIS 암호를 변경할 수 있도록 man:rpc.yppasswdd[8] 데몬을 활성화합니다.
ru: Это включает демон man:rpc.yppasswdd[8], позволяющий пользователям изменять свой NIS-пароль с клиентской машины.

source: Care must be taken in a multi-server domain where the server machines are also NIS clients. It is generally a good idea to force the servers to bind to themselves rather than allowing them to broadcast bind requests and possibly become bound to each other. Strange failure modes can result if one server goes down and others are dependent upon it. Eventually, all the clients will time out and attempt to bind to other servers, but the delay involved can be considerable and the failure mode is still present since the servers might bind to each other all over again.
ko: 서버 컴퓨터가 NIS 클라이언트이기도 한 다중 서버 도메인에서는 주의를 기울여야 합니다. 일반적으로 서버가 바인딩 요청을 브로드캐스트하여 서로 바인딩될 수 있도록 허용하는 것보다 서버가 스스로 바인딩하도록 하는 것이 좋습니다. 한 서버가 다운되고 다른 서버가 그 서버에 종속되어 있는 경우 알 수 없는 장애 모드가 발생할 수 있습니다. 결국 모든 클라이언트가 시간이 초과되어 다른 서버에 바인딩을 시도하지만 지연 시간이 상당할 수 있으며 서버가 다시 서로 바인딩할 수 있으므로 장애 모드가 계속 발생할 수 있습니다.
ru: В многосерверном домене, где серверные машины также являются клиентами NIS, необходимо соблюдать осторожность. Обычно рекомендуется принудительно заставлять серверы привязываться к самим себе, а не разрешать им рассылать запросы на привязку и потенциально привязываться друг к другу. Могут возникнуть странные режимы сбоев, если один сервер выйдет из строя, а другие будут зависеть от него. В конечном итоге все клиенты превысят время ожидания и попытаются привязаться к другим серверам, но задержка может быть значительной, а режим сбоя сохранится, поскольку серверы могут снова привязаться друг к другу.

source: A server that is also a client can be forced to bind to a particular server by adding these additional lines to [.filename]#/etc/rc.conf#:
ko: 클라이언트이기도 한 서버는 [.filename]#/etc/rc.conf#에 이러한 추가 줄을 추가하여 특정 서버에 강제로 바인딩할 수 있습니다:
ru: Сервер, который также является клиентом, может быть принудительно привязан к определённому серверу путём добавления следующих строк в [.filename]#/etc/rc.conf#:

source: This enables running client stuff as well.
ko: 클라이언트 작업도 실행할 수 있게 합니다.
ru: Это позволяет также запускать клиентские приложения.

source: This line sets the NIS domain name to `test-domain` and bind to itself.
ko: NIS 도메인 이름을 `test-domain`으로 설정하고 이 도메인에 바인딩합니다.
ru: Эта строка устанавливает имя домена NIS в `test-domain` и привязывает к себе.

source: After saving the edits, type `/etc/netstart` to restart the network and apply the values defined in [.filename]#/etc/rc.conf#. Before initializing the NIS maps, start man:ypserv[8]:
ko: 편집 내용을 저장한 후 `/etc/netstart`를 입력하여 네트워크를 다시 시작하고 [.filename]#/etc/rc.conf#에 정의된 값을 적용합니다. NIS 맵을 초기화하기 전에 man:ypserv[8]를 시작합니다:
ru: После сохранения изменений введите `/etc/netstart`, чтобы перезапустить сеть и применить значения, указанные в [.filename]#/etc/rc.conf#. Перед инициализацией карт NIS запустите man:ypserv[8]:

source: Initializing the NIS Maps
ko: NIS 맵 시작하기
ru: Инициализация карт NIS

source: NIS maps are generated from the configuration files in [.filename]#/etc# on the NIS master, with one exception: [.filename]#/etc/master.passwd#. This is to prevent the propagation of passwords to all the servers in the NIS domain. Therefore, before the NIS maps are initialized, configure the primary password files:
ko: NIS 맵은 한 가지 예외를 제외하고 NIS 마스터의 [.filename]#/etc#에 있는 구성 파일에서 생성됩니다: [.filename]#/etc/master.passwd#. 이는 NIS 도메인의 모든 서버에 비밀번호가 전파되는 것을 방지하기 위한 것입니다. 따라서 NIS 맵을 초기화하기 전에 기본 비밀번호 파일을 구성하세요:
ru: NIS-карты создаются из конфигурационных файлов в [.filename]#/etc# на NIS-мастере, за исключением одного: [.filename]#/etc/master.passwd#. Это сделано для предотвращения распространения паролей на все серверы в NIS-домене. Поэтому перед инициализацией NIS-карт необходимо настроить основные файлы паролей:

source: It is advisable to remove all entries for system accounts as well as any user accounts that do not need to be propagated to the NIS clients, such as the `root` and any other administrative accounts.
ko: 시스템 계정에 대한 모든 항목과 `root` 및 기타 관리 계정과 같이, NIS 클라이언트에 전파할 필요가 없는 사용자 계정에 대한 모든 항목은 제거하는 것이 좋습니다.
ru: Рекомендуется удалить все записи системных учетных записей, а также любые пользовательские учетные записи, которые не нужно распространять на клиенты NIS, такие как `root` и другие административные учетные записи.

source: Ensure that the [.filename]#/var/yp/master.passwd# is neither group or world readable by setting its permissions to `600`.
ko: 권한을 `600`으로 설정하여 [.filename]#/var/yp/master.passwd#이 그룹 또는 월드 모두에서 읽을 수 없는지 확인합니다.
ru: Убедитесь, что файл [.filename]#/var/yp/master.passwd# не доступен для чтения группе или всем, установив его права доступа на `600`.

source: After completing this task, initialize the NIS maps. FreeBSD includes the man:ypinit[8] script to do this. When generating maps for the master server, include `-m` and specify the NIS domain name:
ko: 이 작업을 완료한 후, NIS 맵을 초기화합니다. FreeBSD에는 이 작업을 수행할 수 있는 man:ypinit[8] 스크립트가 포함되어 있습니다. 마스터 서버용 맵을 생성할 때 `-m`을 포함하고 NIS 도메인 이름을 지정합니다:
ru: После завершения этой задачи инициализируйте карты NIS. FreeBSD включает скрипт man:ypinit[8] для этого. При создании карт для главного сервера укажите `-m` и задайте имя домена NIS:

source: This will create [.filename]#/var/yp/Makefile# from [.filename]#/var/yp/Makefile.dist#. By default, this file assumes that the environment has a single NIS server with only FreeBSD clients. Since `test-domain` has a slave server, edit this line in [.filename]#/var/yp/Makefile# so that it begins with a comment (`+#+`):
ko: 이렇게 하면 [.filename]#/var/yp/Makefile.dist#에서 [.filename]#/var/yp/Makefile#가 생성됩니다. 기본적으로 이 파일은 네트워크에 FreeBSD 클라이언트만 있는 단일 NIS 서버가 있다고 가정합니다. `test-domain`에는 슬레이브 서버가 있으므로, 이 줄이 주석(`+#+`)으로 시작되도록 [.filename]#/var/yp/Makefile#에 이 줄을 편집합니다:
ru: Это создаст файл [.filename]#/var/yp/Makefile# на основе [.filename]#/var/yp/Makefile.dist#. По умолчанию этот файл предполагает, что в окружении есть единственный NIS-сервер только с клиентами FreeBSD. Поскольку у `test-domain` есть подчиненный сервер, отредактируйте эту строку в [.filename]#/var/yp/Makefile#, чтобы она начиналась с комментария (`+#+`):

source: Adding New Users
ko: 신규 사용자 추가하기
ru: Добавление новых пользователей

source: Every time a new user is created, the user account must be added to the master NIS server and the NIS maps rebuilt. Until this occurs, the new user will not be able to login anywhere except on the NIS master. For example, to add the new user `jsmith` to the `test-domain` domain, run these commands on the master server:
ko: 새 사용자를 만들 때마다 사용자 계정을 마스터 NIS 서버에 추가하고 NIS 맵을 다시 빌드해야 합니다. 이 작업이 완료될 때까지 새 사용자는 NIS 마스터를 제외한 다른 곳에서는 로그인할 수 없습니다. 예를 들어, 새 사용자 `jsmith`를 `test-domain` 도메인에 추가하려면 마스터 서버에서 다음 명령을 실행합니다:
ru: Каждый раз при создании нового пользователя учетная запись должна быть добавлена на основной NIS-сервер, а NIS-карты должны быть перестроены. До этого новый пользователь не сможет войти в систему нигде, кроме главного NIS-сервера. Например, чтобы добавить нового пользователя `jsmith` в домен `test-domain`, выполните следующие команды на основном сервере:

source: The user could also be added using `adduser jsmith` instead of `pw useradd smith`.
ko: ‘pw useradd smith’ 대신 ‘adduser jsmith’를 사용하여 사용자를 추가할 수도 있습니다.
ru: Пользователь также может быть добавлен с помощью `adduser jsmith` вместо `pw useradd smith`.

source: Setting up a NIS Slave Server
ko: NIS 슬레이브 서버 설정하기
ru: Настройка подчиненного сервера NIS
