Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/pam/*.po
Languages: pt_br

source: <link xlink:href="http://www.opengroup.org/pubs/catalog/p702.htm">X/Open Single Sign-on Preliminary Specification</link>
pt_br: <link xlink:href="http://www.opengroup.org/pubs/catalog/p702.htm">Especificação Preliminar do X/Open Single Sign-on</link>

source: The Open Group
pt_br: O grupo aberto

source: June 1997
pt_br: Junho de 1997

source: <link xlink:href="http://www.kernel.org/pub/linux/libs/pam/pre/doc/current-draft.txt"> Pluggable Authentication Modules</link>
pt_br: <link xlink:href="http://www.kernel.org/pub/linux/libs/pam/pre/doc/current-draft.txt">Módulos de autenticação plugáveis​​</link>

source: User Manuals
pt_br: Manuais do usuário

source: <link xlink:href="http://www.sun.com/software/solaris/pam/pam.admin.pdf">PAM Administration</link>
pt_br: <link xlink:href="http://www.sun.com/software/solaris/pam/pam.admin.pdf">Administração do PAM</link>

source: Related Web pages
pt_br: Páginas Web relacionadas

source: <link xlink:href="http://openpam.sourceforge.net/">OpenPAM homepage</link>
pt_br: <link xlink:href="http://openpam.sourceforge.net/">Homepage do OpenPAM</link>

source: <link xlink:href="http://www.kernel.org/pub/linux/libs/pam/">Linux-PAM homepage</link>
pt_br: <link xlink:href="http://www.kernel.org/pub/linux/libs/pam/">Página inicial do Linux-PAM</link>

source: <link xlink:href="http://wwws.sun.com/software/solaris/pam/">Solaris PAM homepage</link>
pt_br: <link xlink:href="http://wwws.sun.com/software/solaris/pam/">Página inicial do Solaris PAM</link>
