Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/pam/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Nilton José Rizzo, rizzo@rizzo.eng.br, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018 Silvio Ap Silva, contato@kanazuchi.com, 2018

source: Pluggable Authentication Modules
pt_br: Módulos de Autenticação Plugáveis

source: This article describes the underlying principles and mechanisms of the Pluggable Authentication Modules (PAM) library, and explains how to configure PAM, how to integrate PAM into applications, and how to write PAM modules.
pt_br: Esse artigo descreve princípios subjacentes e mecanismos da biblioteca de Módulos de Autenticação Plugáveis (PAM), e explica como configurar, como integrar com outras aplicações e como escrever novos módulos.

source: $FreeBSD: head/en_US.ISO8859-1/articles/pam/article.xml 48488 2016-03-28 17:29:21Z jgh $
pt_br: $FreeBSD$

source: Introduction
pt_br: Introdução

source: The Pluggable Authentication Modules (PAM) library is a generalized API for authentication-related services which allows a system administrator to add new authentication methods simply by installing new PAM modules, and to modify authentication policies by editing configuration files.
pt_br: A biblioteca dos Módulos de Autenticação Plugáveis (PAM) é uma API generalizada para serviços relacionados com autenticações as quais permitem ao administrador de sistema adicionar um novo método de autenticação simplesmente pela instalação de um novo módulo PAM, e modificar a política de autenticação pela edição do arquivo de configuração.

source: PAM was defined and developed in 1995 by Vipin Samar and Charlie Lai of Sun Microsystems, and has not changed much since. In 1997, the Open Group published the X/Open Single Sign-on (XSSO) preliminary specification, which standardized the PAM API and added extensions for single (or rather integrated) sign-on. At the time of this writing, this specification has not yet been adopted as a standard.
pt_br: O PAM foi definido e desenvolvido em 1995 por Vipin Samar e Charlie Lai da Sun Microsystems, e não teve muitas mudanças até hoje. Em 1997, o Open Group publicou a especificação preliminar do X/Open Single Sign-on (XSSO), a qual padroniza a API do PAM e adiciona extensões para autenticação única ou integrada. No momento da redação deste documento, esta especificação ainda não tinha sido adotada como padrão.

source: Although this article focuses primarily on FreeBSD 5.x, which uses OpenPAM, it should be equally applicable to FreeBSD 4.x, which uses Linux-PAM, and other operating systems such as Linux and <trademark>Solaris</trademark>.
pt_br: Apesar deste artigo focar primariamente no sistema FreeBSD 5.x, o qual usa o OpenPAM, ele poderá ser igualmente aplicado ao FreeBSD 4.x, o qual usa o Linux-PAM, e a outros systemas operacionais, tais como o Linux e o <trademark>Solaris</trademark>.

source: Terms and conventions
pt_br: Termos e convenções

source: Definitions
pt_br: Definições

source: The terminology surrounding PAM is rather confused. Neither Samar and Lai's original paper nor the XSSO specification made any attempt at formally defining terms for the various actors and entities involved in PAM, and the terms that they do use (but do not define) are sometimes misleading and ambiguous. The first attempt at establishing a consistent and unambiguous terminology was a whitepaper written by Andrew G. Morgan (author of Linux-PAM) in 1999. While Morgan's choice of terminology was a huge leap forward, it is in this author's opinion by no means perfect. What follows is an attempt, heavily inspired by Morgan, to define precise and unambiguous terms for all actors and entities involved in PAM.
pt_br: A terminologia em torno do PAM é bastante confusa. Nem o artigo original de Neither Samar e Lai nem a especificação original do XSSO fizeram algum esforço para definir formalmente os termos de vários atores e entidades envolvidas no PAM, e os termos que eles usam (mas não definem) são algumas vezes duvidosos ou ambíguos. A primeira tentativa de estabelecer uma terminologia consistente e não ambígua foi feita no artigo escrito por Andrew G. Morgan (autor do Linux-PAM) em 1999. A escolha da terminologia de Morgan foi um grande avanço, mas na opinião deste autor, não é perfeita. O que segue é uma tentativa, fortemente inspirada por Morgan, de definir termos precisos e não ambíguos para todos os atores e entidades envolvidas no PAM.

source: account
pt_br: conta (account)

source: The set of credentials the applicant is requesting from the arbitrator.
pt_br: Um conjunto de credenciais que o requerente está solicitando ao mediador.

source: applicant
pt_br: requerente (applicant)

source: The user or entity requesting authentication.
pt_br: Usuário ou entidade que solicita autenticação

source: arbitrator
pt_br: Mediador (arbitrator)

source: The user or entity who has the privileges necessary to verify the applicant's credentials and the authority to grant or deny the request.
pt_br: Usuário ou entidade a qual tem privilégios necessários para verificar as credenciais do requerente e autorizar ou não a solicitação

source: A sequence of modules that will be invoked in response to a PAM request. The chain includes information about the order in which to invoke the modules, what arguments to pass to them, and how to interpret the results.
pt_br: Uma sequência de módulos que irá ser chamada em resposta a uma solicitação do PAM. A chain inclui informações sobre a ordem a qual invocar os módulos, quais argumentos foram passados e como interpretar os resultados.

source: The application responsible for initiating an authentication request on behalf of the applicant and for obtaining the necessary authentication information from him.
pt_br: A aplicação responsável por inicializar uma solicitação de autenticação em nome do requerente para obter as informações necessárias da autenticação dele.

source: facility
pt_br: recursos

source: One of the four basic groups of functionality provided by PAM: authentication, account management, session management and authentication token update.
pt_br: Um dos quatro grupos básicos de funcionalidades fornecidos pelo PAM: autenticação, gerenciamento de conta, gerenciamento de sessão e atualização de token de autenticação.

source: module
pt_br: módulo

source: A collection of one or more related functions implementing a particular authentication facility, gathered into a single (normally dynamically loadable) binary file and identified by a single name.
pt_br: Uma coleção de uma ou mais funções relacionadas implementando um recurso de autenticação específico, reunidas em um único arquivo binário (normalmente carregável dinamicamente) e identificadas por um único nome.

source: policy
pt_br: política

source: The complete set of configuration statements describing how to handle PAM requests for a particular service. A policy normally consists of four chains, one for each facility, though some services do not use all four facilities.
pt_br: O conjunto completo de instruções de configuração que descrevem como lidar com solicitações do PAM para um serviço específico. Uma política normalmente consiste em quatro chains, uma para cada recurso, embora alguns serviços não utilizem os quatro recursos.

source: server
pt_br: servidor

source: The application acting on behalf of the arbitrator to converse with the client, retrieve authentication information, verify the applicant's credentials and grant or deny requests.
pt_br: O aplicativo agindo em nome do mediador para conversar com o cliente, recuperar informações de autenticação, verificar as credenciais do requerente e conceder ou negar solicitações.

source: service
pt_br: serviço

source: A class of servers providing similar or related functionality and requiring similar authentication. PAM policies are defined on a per-service basis, so all servers that claim the same service name will be subject to the same policy.
pt_br: Classe de servidores que provêm recursos similares ou relacionados e requerem autenticação similar. As políticas do PAM são definidas por serviço, portanto, todos os servidores que reivindicam o mesmo nome de serviço estarão sujeitos à mesma política.

source: session
pt_br: sessão

source: The context within which service is rendered to the applicant by the server. One of PAM's four facilities, session management, is concerned exclusively with setting up and tearing down this context.
pt_br: O contexto com o qual serviços são apresentados para o requerente pelo servidor. Um dos quatro recursos do PAM, gerenciamento de sessão, é concedido exclusivamente configurando e derrubando esse contexto.

source: A chunk of information associated with the account, such as a password or passphrase, which the applicant must provide to prove his identity.
pt_br: Um pedaço de informação associada à conta, como uma senha sendo uma palavra ou uma frase, que o solicitante deve fornecer para provar sua identidade.

source: transaction
pt_br: transação

source: A sequence of requests from the same applicant to the same instance of the same server, beginning with authentication and session set-up and ending with session tear-down.
pt_br: Uma sequência de solicitações do mesmo requerente para a mesma instância do mesmo servidor, começando com a configuração de autenticação e sessão e terminando com a desmontagem da sessão.

source: Usage examples
pt_br: Exemplos de uso

source: This section aims to illustrate the meanings of some of the terms defined above by way of a handful of simple examples.
pt_br: Esta seção tem como objetivo ilustrar os significados de alguns dos termos definidos acima por meio de alguns exemplos simples.

source: Client and server are one
pt_br: O cliente e o servidor são um

source: This simple example shows <literal>alice</literal> <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>'ing to <literal>root</literal>.
pt_br: Este exemplo simples mostra <literal>alice</literal> usando <citerefentry> <refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> para se tornar <literal>root</literal>.

source: The applicant is <literal>alice</literal>.
pt_br: O requerente é <literal>alice</literal>.

source: The account is <literal>root</literal>.
pt_br: A conta é <literal>root</literal>.

source: The <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> process is both client and server.
pt_br: O processo <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> é ao mesmo tempo, o cliente e o servidor.

source: The authentication token is <literal>xi3kiune</literal>.
pt_br: O token de autenticação é <literal>xi3kiune</literal>.

source: The arbitrator is <literal>root</literal>, which is why <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> is setuid <literal>root</literal>.
pt_br: O mediador é <literal>root</literal>, e é por isso que <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> possui setuid para <literal>root</literal>.

source: Client and server are separate
pt_br: O cliente e o servidor são separados

source: The example below shows <literal>eve</literal> try to initiate an <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> connection to <literal>login.example.com</literal>, ask to log in as <literal>bob</literal>, and succeed. Bob should have chosen a better password!
pt_br: O exemplo abaixo mostra <literal>eve</literal> tentar iniciar uma conexão <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> com <literal>login.example.com</literal>, solicitar para efetuar login como <literal>bob</literal> e ter exito. Bob deveria ter escolhido uma senha melhor!

source: The applicant is <literal>eve</literal>.
pt_br: O requerente é <literal>eve</literal>.

source: The client is Eve's <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> process.
pt_br: O cliente é o processo <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> de Eve.

source: The server is the <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> process on <literal>login.example.com</literal>
pt_br: O servidor é o processo <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> em <literal>login.example.com</literal>

source: The account is <literal>bob</literal>.
pt_br: A conta é <literal>bob</literal>.

source: The authentication token is <literal>god</literal>.
pt_br: O token de autenticação é <literal>god</literal>.

source: Although this is not shown in this example, the arbitrator is <literal>root</literal>.
pt_br: Embora isso não seja mostrado neste exemplo, o mediador é <literal>root</literal>.

source: Sample policy
pt_br: Exemplo de política

source: The following is FreeBSD's default policy for <literal>sshd</literal>:
pt_br: A seguir, a política padrão do FreeBSD para <literal>sshd</literal>:

source: This policy applies to the <literal>sshd</literal> service (which is not necessarily restricted to the <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> server.)
pt_br: Esta política se aplica ao serviço <literal>sshd</literal> (que não é necessariamente restrito ao servidor <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>).

source: <literal>auth</literal>, <literal>account</literal>, <literal>session</literal> and <literal>password</literal> are facilities.
pt_br: <literal>auth</literal>, <literal>account</literal>, <literal>session</literal> e <literal>password</literal> são recursos.

source: <filename>pam_nologin.so</filename>, <filename>pam_unix.so</filename>, <filename>pam_login_access.so</filename>, <filename>pam_lastlog.so</filename> and <filename>pam_permit.so</filename> are modules. It is clear from this example that <filename>pam_unix.so</filename> provides at least two facilities (authentication and account management.)
pt_br: <filename>pam_nologin.so</filename>, <filename>pam_unix.so</filename>, <filename>pam_login_access.so</filename>, <filename>pam_lastlog.so</filename> e <filename>pam_permit.so</filename> são módulos. Fica claro neste exemplo que o <filename>pam_unix.so</filename> fornece pelo menos dois recursos (autenticação e gerenciamento de conta).

source: PAM Essentials
pt_br: PAM Essencial

source: Facilities and primitives
pt_br: Recursos e primitivos

source: The PAM API offers six different authentication primitives grouped in four facilities, which are described below.
pt_br: A API do PAM oferece seis primitivas de autenticação diferentes agrupadas em quatro recursos, descritos abaixo.

source: <emphasis>Authentication.</emphasis> This facility concerns itself with authenticating the applicant and establishing the account credentials. It provides two primitives:
pt_br: <emphasis>Autenticação.</emphasis> Este recurso se preocupa em autenticar o requerente e estabelecer as credenciais da conta. Ele fornece duas primitivas:

source: <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> authenticates the applicant, usually by requesting an authentication token and comparing it with a value stored in a database or obtained from an authentication server.
pt_br: <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> autentica o requerente, geralmente solicitando um token de autenticação e comparando-o com um valor armazenado em um banco de dados ou obtido de um servidor de autenticação.

source: <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> establishes account credentials such as user ID, group membership and resource limits.
pt_br: <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> estabelece credenciais de conta, como ID de usuário, associação de grupo e limites de recursos.

source: <emphasis>Account management.</emphasis> This facility handles non-authentication-related issues of account availability, such as access restrictions based on the time of day or the server's work load. It provides a single primitive:
pt_br: <emphasis>Gerenciamento de contas.</emphasis> Esse recurso lida com problemas de disponibilidade de conta não relacionados à autenticação, como restrições de acesso com base na hora do dia ou na carga de trabalho do servidor. Ele fornece uma única primitiva:

source: <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> verifies that the requested account is available.
pt_br: <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> verifica se a conta solicitada está disponível.

source: <emphasis>Session management.</emphasis> This facility handles tasks associated with session set-up and tear-down, such as login accounting. It provides two primitives:
pt_br: <emphasis>Gerenciamento de sessão.</emphasis> Esse recurso lida com tarefas associadas à configuração e desmontagem da sessão, como a contabilização de login. Ele fornece duas primitivas:

source: <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> performs tasks associated with session set-up: add an entry in the <filename>utmp</filename> and <filename>wtmp</filename> databases, start an SSH agent, etc.
pt_br: <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> executa tarefas associadas à configuração da sessão: adiciona uma entrada nos bancos de dados <filename>utmp</filename> e <filename>wtmp</filename>, inicia um agente SSH, etc.

source: <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> performs tasks associated with session tear-down: add an entry in the <filename>utmp</filename> and <filename>wtmp</filename> databases, stop the SSH agent, etc.
pt_br: <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> executa tarefas associadas à desmontagem da sessão: adiciona uma entrada nos bancos de dados <filename>utmp</filename> e <filename>wtmp</filename>, pare o agente SSH, etc.

source: <emphasis>Password management.</emphasis> This facility is used to change the authentication token associated with an account, either because it has expired or because the user wishes to change it. It provides a single primitive:
pt_br: <emphasis>Gerenciamento de senhas.</emphasis> Esse recurso é usado para alterar o token de autenticação associado a uma conta, porque expirou ou porque o usuário deseja alterá-lo. Ele fornece uma única primitiva:

source: <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> changes the authentication token, optionally verifying that it is sufficiently hard to guess, has not been used previously, etc.
pt_br: <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> altera o token de autenticação, opcionalmente, verificando se é suficientemente difícil de adivinhar, se não foi usado anteriormente etc.

source: Modules
pt_br: Módulos

source: Modules are a very central concept in PAM; after all, they are the <quote>M</quote> in <quote>PAM</quote>. A PAM module is a self-contained piece of program code that implements the primitives in one or more facilities for one particular mechanism; possible mechanisms for the authentication facility, for instance, include the <trademark class="registered">UNIX</trademark> password database, NIS, LDAP and Radius.
pt_br: Módulos são um conceito muito central no PAM; afinal, eles são os <quote>M</quote> no <quote>PAM</quote>. Um módulo PAM é um código de programa autocontido que implementa as primitivas em uma ou mais instalações para um mecanismo específico; possíveis mecanismos para o recurso de autenticação, por exemplo, incluem os bancos de dados de senhas <trademark class="registered">UNIX</trademark>, NIS, LDAP e Radius.

source: Module Naming
pt_br: Nomeação de Módulos

source: FreeBSD implements each mechanism in a single module, named <literal>pam_<replaceable>mechanism</replaceable>.so</literal> (for instance, <literal>pam_unix.so</literal> for the <trademark class="registered">UNIX</trademark> mechanism.) Other implementations sometimes have separate modules for separate facilities, and include the facility name as well as the mechanism name in the module name. To name one example, <trademark>Solaris</trademark> has a <literal>pam_dial_auth.so.1</literal> module which is commonly used to authenticate dialup users.
pt_br: O FreeBSD implementa cada mecanismo em um único módulo, chamado <literal>pam_<replaceable>mechanism</replaceable>.so</literal> (por exemplo, <literal>pam_unix.so</literal> para o mecanismo <trademark class="registered">UNIX</trademark>. Outras implementações às vezes possuem módulos separados para instalações separadas e incluem o nome do recurso, bem como o nome do mecanismo no nome do módulo. Para citar um exemplo, <trademark>Solaris</trademark> tem um módulo <literal>pam_dial_auth.so.1</literal> que é comumente usado para autenticar usuários de conexões discadas.

source: Module Versioning
pt_br: Versionando Módulos

source: FreeBSD's original PAM implementation, based on Linux-PAM, did not use version numbers for PAM modules. This would commonly cause problems with legacy applications, which might be linked against older versions of the system libraries, as there was no way to load a matching version of the required modules.
pt_br: A implementação original do PAM no FreeBSD, baseada no Linux-PAM, não utilizou números de versão para os módulos PAM. Isso normalmente causaria problemas com aplicativos legados, que poderiam estar vinculados a versões mais antigas das bibliotecas do sistema, pois não havia como carregar uma versão correspondente dos módulos necessários.

source: OpenPAM, on the other hand, looks for modules that have the same version number as the PAM library (currently 2), and only falls back to an unversioned module if no versioned module could be loaded. Thus legacy modules can be provided for legacy applications, while allowing new (or newly built) applications to take advantage of the most recent modules.
pt_br: O OpenPAM, por outro lado, procura por módulos que possuam o mesmo número de versão que a biblioteca PAM (atualmente 2), e só retorna a um módulo não versionado se nenhum módulo versionado puder ser carregado. Assim, os módulos legados podem ser fornecidos para aplicativos legados, permitindo que novos aplicativos (ou recém-construídos) aproveitem os módulos mais recentes.

source: Although <trademark>Solaris</trademark> PAM modules commonly have a version number, they are not truly versioned, because the number is a part of the module name and must be included in the configuration.
pt_br: Embora os módulos PAM do <trademark>Solaris</trademark> normalmente tenham um número de versão, eles não são realmente versionados, porque o número é uma parte do nome do módulo e deve ser incluído na configuração.

source: Chains and policies
pt_br: Chains e Políticas
