Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/pam/*.po
Languages: pt_br

source: The first exception of note is that the error code <literal>PAM_NEW_AUTHTOK_REQD</literal> is treated like a success, except that if no module failed, and at least one module returned <literal>PAM_NEW_AUTHTOK_REQD</literal>, the dispatcher will return <literal>PAM_NEW_AUTHTOK_REQD</literal>.
pt_br: A primeira exceção é que o código de erro <literal>PAM_NEW_AUTHTOK_REQD</literal> é tratado como um sucesso, exceto que se nenhum módulo falhar e pelo menos um módulo retornar <literal>PAM_NEW_AUTHTOK_REQD</literal>, o dispatcher retornará <literal>PAM_NEW_AUTHTOK_REQD</literal>.

source: The second exception is that <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> treats <literal>binding</literal> and <literal>sufficient</literal> modules as if they were <literal>required</literal>.
pt_br: A segunda exceção é que <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> trata os módulos <literal>binding</literal> e <literal>sufficient</literal> como se eles fossem <literal>required</literal>.

source: The third and final exception is that <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> runs the entire chain twice (once for preliminary checks and once to actually set the password), and in the preliminary phase it treats <literal>binding</literal> and <literal>sufficient</literal> modules as if they were <literal>required</literal>.
pt_br: A terceira e última exceção é que <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> executa a chain inteira duas vezes (uma vez para verificações preliminares e uma vez para definir a senha), e na fase preliminar, ele trata os módulos <literal>binding</literal> e <literal>sufficient</literal> como se fossem <literal>required</literal>.

source: FreeBSD PAM Modules
pt_br: Módulos PAM do FreeBSD

source: The <citerefentry><refentrytitle>pam_deny</refentrytitle><manvolnum>8</manvolnum></citerefentry> module is one of the simplest modules available; it responds to any request with <literal>PAM_AUTH_ERR</literal>. It is useful for quickly disabling a service (add it to the top of every chain), or for terminating chains of <literal>sufficient</literal> modules.
pt_br: O módulo <citerefentry><refentrytitle>pam_deny</refentrytitle><manvolnum>8</manvolnum></citerefentry> é um dos módulos mais simples disponíveis; responde a qualquer pedido com <literal>PAM_AUTH_ERR</literal>. É útil para desabilitar rapidamente um serviço (adicioná-lo ao topo de cada chain) ou para encerrar chains de módulos <literal>sufficient</literal>.

source: The <citerefentry><refentrytitle>pam_echo</refentrytitle><manvolnum>8</manvolnum></citerefentry> module simply passes its arguments to the conversation function as a <literal>PAM_TEXT_INFO</literal> message. It is mostly useful for debugging, but can also serve to display messages such as <quote>Unauthorized access will be prosecuted</quote> before starting the authentication procedure.
pt_br: O módulo <citerefentry><refentrytitle>pam_echo</refentrytitle><manvolnum>8</manvolnum></citerefentry> simplesmente passa seus argumentos para a função de conversação como uma mensagem <literal>PAM_TEXT_INFO</literal>. É principalmente útil para depuração, mas também pode servir para exibir mensagens como <quote>O acesso não autorizado será processado</quote> antes de iniciar o procedimento de autenticação.

source: The <citerefentry><refentrytitle>pam_exec</refentrytitle><manvolnum>8</manvolnum></citerefentry> module takes its first argument to be the name of a program to execute, and the remaining arguments are passed to that program as command-line arguments. One possible application is to use it to run a program at login time which mounts the user's home directory.
pt_br: O módulo <citerefentry><refentrytitle>pam_exec</refentrytitle><manvolnum>8</manvolnum></citerefentry> leva seu primeiro argumento a ser o nome de um programa a ser executado, e os argumentos restantes são passados ​​para esse programa como argumentos de linha de comando. Uma aplicação possível é usá-lo para executar um programa no momento do login, que monta o diretório pessoal do usuário.

source: The <citerefentry><refentrytitle>pam_group</refentrytitle><manvolnum>8</manvolnum></citerefentry> module accepts or rejects applicants on the basis of their membership in a particular file group (normally <literal>wheel</literal> for <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>). It is primarily intended for maintaining the traditional behavior of BSD <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>, but has many other uses, such as excluding certain groups of users from a particular service.
pt_br: O módulo <citerefentry><refentrytitle>pam_group</refentrytitle><manvolnum>8</manvolnum></citerefentry> aceita ou rejeita os requerentes com base em sua participação em um determinado grupo de arquivos (normalmente <literal>wheel</literal> para <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>). Ele é destinado principalmente para manter o comportamento tradicional do <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> do BSD, mas tem muitos outros usos, como excluir determinados grupos de usuários de um serviço particular.

source: The <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> module allows guest logins using fixed login names. Various requirements can be placed on the password, but the default behavior is to allow any password as long as the login name is that of a guest account. The <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> module can easily be used to implement anonymous FTP logins.
pt_br: O módulo <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> permite logins convidados usando nomes de login fixos. Vários requerimentos podem ser colocados na senha, mas o comportamento padrão é permitir qualquer senha, desde que o nome de login seja o de uma conta de convidado. O módulo <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> pode ser facilmente utilizado para implementar logins FTP anônimos.

source: The <citerefentry><refentrytitle>pam_krb5</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_krb5</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_ksu</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_ksu</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_lastlog</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_lastlog</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_login_access</refentrytitle><manvolnum>8</manvolnum></citerefentry> module provides an implementation of the account management primitive which enforces the login restrictions specified in the <citerefentry><refentrytitle>login.access</refentrytitle><manvolnum>5</manvolnum></citerefentry> table.
pt_br: O módulo <citerefentry><refentrytitle>pam_login_access</refentrytitle><manvolnum>8</manvolnum></citerefentry> fornece uma implementação da primitiva de gerenciamento de contas que impõe as restrições de login especificadas na tabela <citerefentry><refentrytitle>login.access</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: The <citerefentry><refentrytitle>pam_nologin</refentrytitle><manvolnum>8</manvolnum></citerefentry> module refuses non-root logins when <filename>/var/run/nologin</filename> exists. This file is normally created by <citerefentry><refentrytitle>shutdown</refentrytitle><manvolnum>8</manvolnum></citerefentry> when less than five minutes remain until the scheduled shutdown time.
pt_br: O módulo <citerefentry><refentrytitle>pam_nologin</refentrytitle><manvolnum>8</manvolnum></citerefentry> recusa logins não-root quando existe um <filename>/var/run/nologin</filename>. Este arquivo é normalmente criado por <citerefentry><refentrytitle>shutdown</refentrytitle><manvolnum>8</manvolnum></citerefentry> quando restam menos de cinco minutos até o horário de encerramento programado.

source: The <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry> module implements the <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> authentication method. The <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> system is a challenge-response mechanism where the response to each challenge is a direct function of the challenge and a passphrase, so the response can be easily computed <quote>just in time</quote> by anyone possessing the passphrase, eliminating the need for password lists. Moreover, since <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> never reuses a challenge that has been correctly answered, it is not vulnerable to replay attacks.
pt_br: O módulo <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry> implementa o método de autenticação <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry>. O sistema <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> é um mecanismo de desafio-resposta em que a resposta a cada desafio é uma função direta do desafio e uma frase-senha, então a resposta pode ser facilmente computada <quote>just in time</quote> por qualquer pessoa que possua a senha, eliminando a necessidade de listas de senhas. Além disso, como <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> nunca reutiliza um desafio que tenha sido respondido corretamente, ele não é vulnerável a ataques de repetição.

source: The <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> module is a companion module to <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Its purpose is to enforce the restrictions codified in <citerefentry><refentrytitle>opieaccess</refentrytitle><manvolnum>5</manvolnum></citerefentry>, which regulate the conditions under which a user who would normally authenticate herself using <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> is allowed to use alternate methods. This is most often used to prohibit the use of password authentication from untrusted hosts.
pt_br: O módulo <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> é um módulo complementar para <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Sua finalidade é impor as restrições codificadas em <citerefentry><refentrytitle>opieaccess</refentrytitle><manvolnum>5</manvolnum></citerefentry>, que regulam as condições sob as quais um usuário que normalmente se autenticaria usando <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> tem permissão para usar métodos alternativos. Isso geralmente é usado para proibir o uso de autenticação de senha de hosts não confiáveis.

source: In order to be effective, the <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> module must be listed as <literal>requisite</literal> immediately after a <literal>sufficient</literal> entry for <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>, and before any other modules, in the <literal>auth</literal> chain.
pt_br: Para ser eficaz, o módulo <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> deve ser listado como <literal>requisite</literal> imediatamente após uma entrada <literal>sufficient</literal> para <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>, e antes de qualquer outro módulo, na chain <literal>auth</literal>.

source: The <citerefentry><refentrytitle>pam_passwdqc</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_passwdqc</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_permit</refentrytitle><manvolnum>8</manvolnum></citerefentry> module is one of the simplest modules available; it responds to any request with <literal>PAM_SUCCESS</literal>. It is useful as a placeholder for services where one or more chains would otherwise be empty.
pt_br: O módulo <citerefentry><refentrytitle>pam_permit</refentrytitle><manvolnum>8</manvolnum></citerefentry> é um dos módulos mais simples disponíveis; responde a qualquer pedido com <literal>PAM_SUCCESS</literal>. É útil como um espaço reservado para serviços onde uma ou mais chains estariam vazias.

source: The <citerefentry><refentrytitle>pam_radius</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_radius</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_rhosts</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_rhosts</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_rootok</refentrytitle><manvolnum>8</manvolnum></citerefentry> module reports success if and only if the real user id of the process calling it (which is assumed to be run by the applicant) is 0. This is useful for non-networked services such as <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>1</manvolnum></citerefentry>, to which the <literal>root</literal> should have automatic access.
pt_br: O módulo <citerefentry><refentrytitle>pam_rootok</refentrytitle><manvolnum>8</manvolnum></citerefentry> reporta sucesso se e somente se o ID do usuário real do processo que o chama (que é assumido como sendo executado pelo requerente) é 0. Isso é útil para serviços que não estão em rede, como <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>1</manvolnum></citerefentry>, para o qual o <literal>root</literal> deve ter acesso automático.

source: The <citerefentry><refentrytitle>pam_securetty</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_securetty</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_self</refentrytitle><manvolnum>8</manvolnum></citerefentry> module reports success if and only if the names of the applicant matches that of the target account. It is most useful for non-networked services such as <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>, where the identity of the applicant can be easily verified.
pt_br: O módulo <citerefentry><refentrytitle>pam_self</refentrytitle><manvolnum>8</manvolnum></citerefentry> reporta sucesso se, e somente se, os nomes do requerente coincidem com os da conta de destino. É mais útil para serviços que não estão em rede, como <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>, onde a identidade do requerente pode ser facilmente verificada.

source: The <citerefentry><refentrytitle>pam_ssh</refentrytitle><manvolnum>8</manvolnum></citerefentry> module provides both authentication and session services. The authentication service allows users who have passphrase-protected SSH secret keys in their <filename>~/.ssh</filename> directory to authenticate themselves by typing their passphrase. The session service starts <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> and preloads it with the keys that were decrypted in the authentication phase. This feature is particularly useful for local logins, whether in X (using <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> or another PAM-aware X login manager) or at the console.
pt_br: O módulo <citerefentry><refentrytitle>pam_ssh</refentrytitle><manvolnum>8</manvolnum></citerefentry> fornece serviços de autenticação e de sessão. O serviço de autenticação permite que os usuários que tenham chaves secretas SSH protegidas por senha em seu diretório <filename>~/.ssh</filename> se autentiquem digitando sua frase secreta. O serviço de sessão inicia o <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> e o pré-carrega com as chaves que foram descriptografadas na fase de autenticação. Esse recurso é particularmente útil para logins locais, seja em X (usando <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou outro gerenciador de login X que reconhece o PAM ) ou no console.

source: The <citerefentry><refentrytitle>pam_tacplus</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
pt_br: O módulo <citerefentry><refentrytitle>pam_tacplus</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry> module implements traditional <trademark class="registered">UNIX</trademark> password authentication, using <citerefentry><refentrytitle>getpwnam</refentrytitle><manvolnum>3</manvolnum></citerefentry> to obtain the target account's password and compare it with the one provided by the applicant. It also provides account management services (enforcing account and password expiration times) and password-changing services. This is probably the single most useful module, as the great majority of admins will want to maintain historical behavior for at least some services.
pt_br: O módulo <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry> implementa a autenticação de senha <trademark class="registered">UNIX</trademark> tradicional, usando <citerefentry><refentrytitle>getpwnam</refentrytitle><manvolnum>3</manvolnum></citerefentry> para obter a senha da conta de destino e compará-la com a fornecida pelo requerente. Ele também fornece serviços de gerenciamento de conta (impondo tempos de expiração de conta e senha) e serviços de alteração de senha. Este é provavelmente o módulo mais útil, já que a grande maioria dos administradores desejará manter um comportamento histórico para pelo menos alguns serviços.

source: PAM Application Programming
pt_br: Programação de Aplicação PAM

source: This section has not yet been written.
pt_br: Esta seção ainda não foi escrita.

source: PAM Module Programming
pt_br: Programação de Módulos PAM

source: Sample PAM Application
pt_br: Exemplo de Aplicação PAM

source: The following is a minimal implementation of <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> using PAM. Note that it uses the OpenPAM-specific <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> conversation function, which is prototyped in <filename>security/openpam.h</filename>. If you wish build this application on a system with a different PAM library, you will have to provide your own conversation function. A robust conversation function is surprisingly difficult to implement; the one presented in <xref linkend="pam-sample-conv"/> is a good starting point, but should not be used in real-world applications.
pt_br: O que vem a seguir é uma implementação mínima de <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> utilizando o PAM. Observe que ele usa a função de conversa <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> específica do OpenPAM, que é prototipada em <filename>security/openpam.h</filename> . Se você deseja construir este aplicativo em um sistema com uma biblioteca PAM diferente, você terá que fornecer sua própria função de conversação. Uma função de conversa robusta é surpreendentemente difícil de implementar; o apresentado em <xref linkend="pam-sample-conv"/> é um bom ponto de partida, mas não deve ser usado em aplicações do mundo real.

source: Sample PAM Module
pt_br: Exemplo do módulo PAM

source: The following is a minimal implementation of <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry>, offering only authentication services. It should build and run with most PAM implementations, but takes advantage of OpenPAM extensions if available: note the use of <citerefentry><refentrytitle>pam_get_authtok</refentrytitle><manvolnum>3</manvolnum></citerefentry>, which enormously simplifies prompting the user for a password.
pt_br: Segue-se uma implementação mínima de <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry>, oferecendo apenas serviços de autenticação. Ele deve ser compilado e executado com a maioria das implementações do PAM, mas aproveita as extensões do OpenPAM, se disponível: observe o uso de <citerefentry><refentrytitle>pam_get_authtok</refentrytitle><manvolnum>3</manvolnum></citerefentry>, que simplifica enormemente solicitando ao usuário uma senha.

source: Sample PAM Conversation Function
pt_br: Exemplo de função de conversação PAM

source: The conversation function presented below is a greatly simplified version of OpenPAM's <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry>. It is fully functional, and should give the reader a good idea of how a conversation function should behave, but it is far too simple for real-world use. Even if you are not using OpenPAM, feel free to download the source code and adapt <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> to your uses; we believe it to be as robust as a tty-oriented conversation function can reasonably get.
pt_br: A função de conversação apresentada abaixo é uma versão bastante simplificada do <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum></manvolnum></citerefentry> do OpenPAM. Ele é totalmente funcional e deve dar ao leitor uma boa ideia de como uma função de conversa deve se comportar, mas é simples demais para uso no mundo real. Mesmo se você não estiver usando o OpenPAM, sinta-se à vontade para baixar o código-fonte e adaptar <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> aos seus usos; acreditamos que seja tão robusto quanto uma função de conversa orientada para tty pode razoavelmente ser.

source: Further Reading
pt_br: Leitura Adicional

source: This is a list of documents relevant to PAM and related issues. It is by no means complete.
pt_br: Esta é uma lista de documentos relevantes para o PAM e questões relacionadas. Não está de modo algum completo.

source: <link xlink:href="http://www.sun.com/software/solaris/pam/pam.external.pdf"> Making Login Services Independent of Authentication Technologies</link>
pt_br: <link xlink:href="http://www.sun.com/software/solaris/pam/pam.external.pdf">Tornando os serviços de login independentes das tecnologias de autenticação</link>
