Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/pam/*.po
Languages: pt_br

source: When a server initiates a PAM transaction, the PAM library tries to load a policy for the service specified in the <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry> call. The policy specifies how authentication requests should be processed, and is defined in a configuration file. This is the other central concept in PAM: the possibility for the admin to tune the system security policy (in the wider sense of the word) simply by editing a text file.
pt_br: Quando um servidor inicia uma transação PAM, a biblioteca PAM tenta carregar uma política para o serviço especificado na chamada <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry>. A política especifica como as solicitações de autenticação devem ser processadas e definidas em um arquivo de configuração. Este é o outro conceito central no PAM: a possibilidade de o administrador ajustar a política de segurança do sistema (no sentido mais amplo da palavra) simplesmente editando um arquivo de texto.

source: A policy consists of four chains, one for each of the four PAM facilities. Each chain is a sequence of configuration statements, each specifying a module to invoke, some (optional) parameters to pass to the module, and a control flag that describes how to interpret the return code from the module.
pt_br: Uma política consiste em quatro cadeias, uma para cada uma dos quatro recursos do PAM. Cada chain é uma sequência de instruções de configuração, cada uma especificando um módulo para invocar, alguns parâmetros (opcionais) para passar para o módulo e um sinalizador de controle que descreve como interpretar o código de retorno do módulo.

source: Understanding the control flags is essential to understanding PAM configuration files. There are four different control flags:
pt_br: Entender os sinalizadores de controle é essencial para entender os arquivos de configuração do PAM. Existem quatro diferentes flags de controle:

source: If the module succeeds and no earlier module in the chain has failed, the chain is immediately terminated and the request is granted. If the module fails, the rest of the chain is executed, but the request is ultimately denied.
pt_br: Se o módulo tiver exito e nenhum módulo anterior na chain tiver falhado, a chain será encerrada imediatamente e a solicitação será concedida. Se o módulo falhar, o resto da chain é executado, mas a solicitação é negada no final.

source: This control flag was introduced by Sun in <trademark>Solaris</trademark> 9 (<trademark>SunOS</trademark> 5.9), and is also supported by OpenPAM.
pt_br: Esta flag de controle foi introduzida pela Sun no <trademark>Solaris</trademark>9 (<trademark>SunOS</trademark> 5.9), e também é suportado pelo OpenPAM.

source: If the module succeeds, the rest of the chain is executed, and the request is granted unless some other module fails. If the module fails, the rest of the chain is also executed, but the request is ultimately denied.
pt_br: Se o módulo tiver exito, o restante da chain será executada e a solicitação será concedida, a menos que algum outro módulo falhe. Se o módulo falhar, o restante da chain também será executado, mas a solicitação será negada no final.

source: If the module succeeds, the rest of the chain is executed, and the request is granted unless some other module fails. If the module fails, the chain is immediately terminated and the request is denied.
pt_br: Se o módulo for tiver exito, o restante da chain será executado e a solicitação será concedida, a menos que algum outro módulo falhe. Se o módulo falhar, a chain será encerrada imediatamente e a solicitação será negada.

source: If the module succeeds and no earlier module in the chain has failed, the chain is immediately terminated and the request is granted. If the module fails, the module is ignored and the rest of the chain is executed.
pt_br: Se o módulo tiver exito e nenhum módulo anterior na chain tiver falhado, a chain será encerrada imediatamente e a solicitação será concedida. Se o módulo falhar, o módulo será ignorado e o resto da chain será executado.

source: As the semantics of this flag may be somewhat confusing, especially when it is used for the last module in a chain, it is recommended that the <literal>binding</literal> control flag be used instead if the implementation supports it.
pt_br: Como a semântica dessa flag pode ser um pouco confusa, especialmente quando ela é usada para o último módulo em uma chain, é recomendado que a flag de controle <literal>binding</literal> seja usada em seu lugar, se a implementação o suportar.

source: The module is executed, but its result is ignored. If all modules in a chain are marked <literal>optional</literal>, all requests will always be granted.
pt_br: O módulo é executado, mas seu resultado é ignorado. Se todos os módulos em uma chain estiverem marcados como <literal>optional</literal>, todas as solicitações serão sempre concedidas.

source: When a server invokes one of the six PAM primitives, PAM retrieves the chain for the facility the primitive belongs to, and invokes each of the modules listed in the chain, in the order they are listed, until it reaches the end, or determines that no further processing is necessary (either because a <literal>binding</literal> or <literal>sufficient</literal> module succeeded, or because a <literal>requisite</literal> module failed.) The request is granted if and only if at least one module was invoked, and all non-optional modules succeeded.
pt_br: Quando um servidor invoca uma das seis primitivas PAM, o PAM recupera a chain para o recurso ao qual a primitiva pertence, e invoca cada um dos módulos listados na chain, na ordem em que estão listados, até chegar ao fim ou determina que nenhum processamento adicional é necessário (porque um módulo <literal>binding</literal> ou <literal>sufficient</literal> teve exito, ou porque um módulo <literal>requisite</literal> falhou.) O pedido é concedido se e somente se pelo menos um módulo foi chamado e todos os módulos não opcionais tiveram exito.

source: Note that it is possible, though not very common, to have the same module listed several times in the same chain. For instance, a module that looks up user names and passwords in a directory server could be invoked multiple times with different parameters specifying different directory servers to contact. PAM treat different occurrences of the same module in the same chain as different, unrelated modules.
pt_br: Note que é possível, embora não muito comum, ter o mesmo módulo listado várias vezes na mesma chain. Por exemplo, um módulo que procura nomes de usuário e senhas em um servidor de diretório pode ser chamado várias vezes com parâmetros diferentes, especificando diferentes servidores de diretórios para contato. O PAM trata diferentes ocorrências do mesmo módulo na mesma chain de módulos diferentes e não relacionados.

source: Transactions
pt_br: Transações

source: The lifecycle of a typical PAM transaction is described below. Note that if any of these steps fails, the server should report a suitable error message to the client and abort the transaction.
pt_br: O ciclo de vida de uma transação típica do PAM é descrito abaixo. Observe que, se qualquer uma dessas etapas falhar, o servidor deverá informar uma mensagem de erro adequada ao cliente e anular a transação.

source: If necessary, the server obtains arbitrator credentials through a mechanism independent of PAM—most commonly by virtue of having been started by <literal>root</literal>, or of being setuid <literal>root</literal>.
pt_br: Se necessário, o servidor obtém as credenciais do mediador por meio de um mecanismo independente do PAM - mais comumente em virtude de ter sido iniciado por <literal>root</literal> ou de ser setuid <literal>root</literal>.

source: The server calls <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry> to initialize the PAM library and specify its service name and the target account, and register a suitable conversation function.
pt_br: O servidor chama <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry> para inicializar a biblioteca PAM, especificar seu nome de serviço e a conta de destino e registrar uma função de conversação adequada.

source: The server obtains various information relating to the transaction (such as the applicant's user name and the name of the host the client runs on) and submits it to PAM using <citerefentry><refentrytitle>pam_set_item</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
pt_br: O servidor obtém várias informações relacionadas à transação (como o nome de usuário do requerente e o nome do host no qual o cliente é executado) e o envia ao PAM usando <citerefentry><refentrytitle>pam_set_item</refentrytitle><manvolnum>3</manvolnum></citerefentry>.

source: The server calls <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> to authenticate the applicant.
pt_br: O servidor chama <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> para autenticar o requerente.

source: The server calls <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> to verify that the requested account is available and valid. If the password is correct but has expired, <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> will return <literal>PAM_NEW_AUTHTOK_REQD</literal> instead of <literal>PAM_SUCCESS</literal>.
pt_br: O servidor chama <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> para verificar se a conta solicitada está disponível e é válida. Se a senha estiver correta mas expirar, <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> retornará <literal>PAM_NEW_AUTHTOK_REQD</literal> em vez de <literal>PAM_SUCCESS</literal>.

source: If the previous step returned <literal>PAM_NEW_AUTHTOK_REQD</literal>, the server now calls <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> to force the client to change the authentication token for the requested account.
pt_br: Se a etapa anterior retornasse <literal>PAM_NEW_AUTHTOK_REQD</literal>, o servidor agora chamaria <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> para forçar o cliente a alterar o token de autenticação para a conta solicitada.

source: Now that the applicant has been properly authenticated, the server calls <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> to establish the credentials of the requested account. It is able to do this because it acts on behalf of the arbitrator, and holds the arbitrator's credentials.
pt_br: Agora que o requerente foi devidamente autenticado, o servidor chama <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> para estabelecer as credenciais da conta solicitada. É capaz de fazer isso porque age em nome do mediador e possui as credenciais do madiador.

source: Once the correct credentials have been established, the server calls <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> to set up the session.
pt_br: Depois que as credenciais corretas forem estabelecidas, o servidor chamará <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> para configurar a sessão.

source: The server now performs whatever service the client requested—for instance, provide the applicant with a shell.
pt_br: O servidor agora executa qualquer serviço solicitado pelo cliente - por exemplo, fornecer ao requerente um shell.

source: Once the server is done serving the client, it calls <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> to tear down the session.
pt_br: Quando o servidor terminar de atender ao cliente, ele chamará <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> para derrubar a sessão.

source: Finally, the server calls <citerefentry><refentrytitle>pam_end</refentrytitle><manvolnum>3</manvolnum></citerefentry> to notify the PAM library that it is done and that it can release whatever resources it has allocated in the course of the transaction.
pt_br: Finalmente, o servidor chama <citerefentry><refentrytitle>pam_end</refentrytitle><manvolnum>3</manvolnum></citerefentry> para notificar a biblioteca PAM que ela esta pronta e que pode liberar quaisquer recursos alocados no curso da transação.

source: PAM Configuration
pt_br: Configuração do PAM

source: PAM policy files
pt_br: Arquivos de política do PAM

source: The <filename>/etc/pam.conf</filename> file
pt_br: O arquivo <filename>/etc/pam.conf</filename>

source: The traditional PAM policy file is <filename>/etc/pam.conf</filename>. This file contains all the PAM policies for your system. Each line of the file describes one step in a chain, as shown below:
pt_br: O arquivo de política tradicional do PAM é <filename>/etc/pam.conf</filename>. Este arquivo contém todas as políticas do PAM para o seu sistema. Cada linha do arquivo descreve uma etapa em uma chain, conforme mostrado abaixo:

source: The fields are, in order: service name, facility name, control flag, module name, and module arguments. Any additional fields are interpreted as additional module arguments.
pt_br: Os campos estão, na ordem: nome do serviço, nome do recurso, flag de controle, nome do módulo e argumentos do módulo. Quaisquer campos adicionais são interpretados como argumentos adicionais do módulo.

source: A separate chain is constructed for each service / facility pair, so while the order in which lines for the same service and facility appear is significant, the order in which the individual services and facilities are listed is not. The examples in the original PAM paper grouped configuration lines by facility, and the <trademark>Solaris</trademark> stock <filename>pam.conf</filename> still does that, but FreeBSD's stock configuration groups configuration lines by service. Either way is fine; either way makes equal sense.
pt_br: Uma chain separada é construída para cada par de serviço/recurso, portanto, embora a ordem na qual as linhas para o mesmo serviço e recurso apareçam seja significativa, a ordem na qual os serviços e recursos individuais são listados não é. Os exemplos no artigo original do PAM agruparam as linhas de configuração por recurso, e o suporte do <trademark>Solaris</trademark> ao <filename>pam.conf</filename> ainda faz isso, mas a configuração de ações do FreeBSD configura as linhas por serviço. De qualquer maneira está bem; De qualquer forma, faz o mesmo sentido.

source: The <filename>/etc/pam.d</filename> directory
pt_br: O diretório <filename>/etc/pam.d</filename>

source: OpenPAM and Linux-PAM support an alternate configuration mechanism, which is the preferred mechanism in FreeBSD. In this scheme, each policy is contained in a separate file bearing the name of the service it applies to. These files are stored in <filename>/etc/pam.d/</filename>.
pt_br: O OpenPAM e o Linux-PAM suportam um mecanismo de configuração alternativo, que é o mecanismo preferido no FreeBSD. Neste esquema, cada política está contida em um arquivo separado com o nome do serviço ao qual se aplica. Esses arquivos são armazenados em <filename>/etc/pam.d/</filename>.

source: These per-service policy files have only four fields instead of <filename>pam.conf</filename>'s five: the service name field is omitted. Thus, instead of the sample <filename>pam.conf</filename> line from the previous section, one would have the following line in <filename>/etc/pam.d/login</filename>:
pt_br: Esses arquivos de políticas por serviço possuem apenas quatro campos, em vez de cinco no <filename>pam.conf</filename>: o campo nome do serviço é omitido. Assim, em vez da linha de exemplo no <filename>pam.conf</filename> da seção anterior, a seguinte linha deve estar em <filename>/etc/pam.d/login</filename>:

source: As a consequence of this simplified syntax, it is possible to use the same policy for multiple services by linking each service name to a same policy file. For instance, to use the same policy for the <literal>su</literal> and <literal>sudo</literal> services, one could do as follows:
pt_br: Como consequência dessa sintaxe simplificada, é possível usar a mesma política para vários serviços vinculando cada nome de serviço a um mesmo arquivo de política. Por exemplo, para usar a mesma política para os serviços <literal>su</literal> e <literal>sudo</literal>, pode-se fazer o seguinte:

source: This works because the service name is determined from the file name rather than specified in the policy file, so the same file can be used for multiple differently-named services.
pt_br: Isso funciona porque o nome do serviço é determinado a partir do nome do arquivo em vez de ser especificado no arquivo de políticas, portanto, o mesmo arquivo pode ser usado para vários serviços com nomes diferentes.

source: Since each service's policy is stored in a separate file, the <filename>pam.d</filename> mechanism also makes it very easy to install additional policies for third-party software packages.
pt_br: Como a política de cada serviço é armazenada em um arquivo separado, o mecanismo <filename>pam.d</filename> também facilita a instalação de políticas adicionais para pacotes de software de terceiros.

source: The policy search order
pt_br: A ordem de pesquisa da política

source: As we have seen above, PAM policies can be found in a number of places. What happens if policies for the same service exist in multiple places?
pt_br: Como vimos acima, as políticas do PAM podem ser encontradas em vários lugares. O que acontece se as políticas para o mesmo serviço existirem em vários lugares?

source: It is essential to understand that PAM's configuration system is centered on chains.
pt_br: É essencial entender que o sistema de configuração do PAM está centrado em chains.

source: Breakdown of a configuration line
pt_br: Quebra de uma linha de configuração

source: As explained in <xref linkend="pam-config-file"/>, each line in <filename>/etc/pam.conf</filename> consists of four or more fields: the service name, the facility name, the control flag, the module name, and zero or more module arguments.
pt_br: Como explicado em <xref linkend="pam-config-file"/>, cada linha em <filename>/etc/pam.conf</filename> consiste em quatro ou mais campos: o nome do serviço, o nome do recurso, a flag de controle, o nome do módulo e nenhum ou mais argumentos do módulo.

source: The service name is generally (though not always) the name of the application the statement applies to. If you are unsure, refer to the individual application's documentation to determine what service name it uses.
pt_br: O nome do serviço é geralmente (embora nem sempre) o nome do aplicativo ao qual a instrução se aplica. Se não tiver certeza, consulte a documentação do aplicativo individual para determinar qual nome de serviço ele usa.

source: Note that if you use <filename>/etc/pam.d/</filename> instead of <filename>/etc/pam.conf</filename>, the service name is specified by the name of the policy file, and omitted from the actual configuration lines, which then start with the facility name.
pt_br: Note que se você usar <filename>/etc/pam.d/</filename> em vez de <filename>/etc/pam.conf</filename>, o nome do serviço é especificado pelo nome do arquivo de política e omitido a partir das linhas de configuração atuais, que então começam com o nome da instalação.

source: The facility is one of the four facility keywords described in <xref linkend="pam-facilities-primitives"/>.
pt_br: O recurso é uma das quatro palavras-chave do recurso descritas em <xref linkend="pam-facilities-primitives"/>.

source: Likewise, the control flag is one of the four keywords described in <xref linkend="pam-chains-policies"/>, describing how to interpret the return code from the module. Linux-PAM supports an alternate syntax that lets you specify the action to associate with each possible return code, but this should be avoided as it is non-standard and closely tied in with the way Linux-PAM dispatches service calls (which differs greatly from the way <trademark>Solaris</trademark> and OpenPAM do it.) Unsurprisingly, OpenPAM does not support this syntax.
pt_br: Da mesma forma, a flag de controle é uma das quatro palavras-chave descritas em <xref linkend="pam-chains-policies"/>, descrevendo como interpretar o código de retorno do módulo. O Linux-PAM suporta uma sintaxe alternativa que permite especificar a ação para associar com cada código de retorno possível, mas isso deve ser evitado, pois não é padrão e está intimamente ligado à forma como o Linux-PAM envia chamadas de serviço (que difere muito da maneira que <trademark>Solaris</trademark> e OpenPAM fazem isso). Não surpreendentemente, o OpenPAM não suporta esta sintaxe.

source: Policies
pt_br: Políticas

source: To configure PAM correctly, it is essential to understand how policies are interpreted.
pt_br: Para configurar o PAM corretamente, é essencial entender como as políticas são interpretadas.

source: When an application calls <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry>, the PAM library loads the policy for the specified service and constructs four module chains (one for each facility.) If one or more of these chains are empty, the corresponding chains from the policy for the <literal>other</literal> service are substituted.
pt_br: Quando um aplicativo chama <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry>, a biblioteca PAM carrega a diretiva do serviço especificado e constrói quatro chains de módulos (uma para cada recurso). Se uma ou mais dessas chains estiverem vazias, as chains correspondentes da política para o <literal>outro</literal> serviço são substituídas.

source: When the application later calls one of the six PAM primitives, the PAM library retrieves the chain for the corresponding facility and calls the appropriate service function in each module listed in the chain, in the order in which they were listed in the configuration. After each call to a service function, the module type and the error code returned by the service function are used to determine what happens next. With a few exceptions, which we discuss below, the following table applies:
pt_br: Quando o aplicativo chama mais tarde uma das seis primitivas PAM, a biblioteca PAM recupera a chain para o recurso correspondente e chama a função de serviço apropriado em cada módulo listado na chain, na ordem em que foram listadas na configuração. Após cada chamada para uma função de serviço, o tipo de módulo e o código de erro retornado pela função de serviço são usados ​​para determinar o que acontece a seguir. Com algumas exceções, discutidas abaixo, a tabela a seguir se aplica:

source: PAM chain execution summary
pt_br: Resumo de execução da chain de PAM

source: If <varname>fail</varname> is true at the end of a chain, or when a <quote>break</quote> is reached, the dispatcher returns the error code returned by the first module that failed. Otherwise, it returns <literal>PAM_SUCCESS</literal>.
pt_br: Se <varname>fail</varname> for true no final de uma chain, ou quando um <quote>break</quote> for atingido, o dispatcher retornará o código de erro retornado pelo primeiro módulo que falhou. Caso contrário, retorna <literal>PAM_SUCCESS</literal>.
