<!--
     The FreeBSD Documentation Project

     $FreeBSD$
-->

<chapter id="disks">
  <title>Discos</title>
  
  <para><emphasis>Escrito por &a.obrien; 26 de Abril de 1998</emphasis></para>
    
  <para>Supongamos que queremos a&ntilde;adir un nuevo disco SCSI a una 
  m&aacute;quina que en la actualidad s&oacute;lo tiene un &uacute;nico 
  disco. En primer lugar, apague el ordenador e instale el disco siguiendo 
  las instrucciones del fabricante del ordenador, de la controladora y del 
  propio disco. A causa de la diversidad de procedimientos para hacer esto, 
  los detalles exceden el &aacute;mbito de este documento.</para>

  <para>Entre en el sistema como el usuario <username>root</username>. Una 
  vez que haya instalado el disco, inspeccione 
  <filename>/var/run/dmesg.boot</filename> para asegurarse de que el nuevo 
  disco ha sido encontrado. Continuando con nuestro ejemplo, el disco 
  recientemente a&ntilde;adido ser&aacute; <filename>da1</filename> y lo 
  montaremos en <filename>/1</filename> (si est&aacute; usted 
  a&ntilde;adiendo un disco IDE, sustituya <filename>da</filename> por 
  <filename>wd</filename>).</para>
  
  <para>Como FreeBSD funciona en ordenadores compatibles con el IBM-PC, debe 
  tener en cuenta las particiones de la BIOS del PC. Estas son diferentes de 
  las particiones tradicionales de tipo BSD. Un disco de PC puede tener 
  hasta cuatro entradas para particiones de tipo BIOS. Si el disco va a ser 
  realmente dedicado a FreeBSD, puede usted emplear el modo dedicado 
  (<emphasis>dedicated</emphasis>). En otro caso, FreeBSD tendr&aacute; que 
  alojarse en una de las particiones de la BIOS. FreeBSD llama a las 
  particiones de la BIOS <emphasis>slices</emphasis>, para no confundirlas 
  con las particiones tradicionales de tipo BSD. Tambi&eacute;n puede usted 
  usar slices en un disco que est&eacute; dedicado a FreeBSD, pero en un 
  ordenador que adem&aacute;s tenga otro sistema operativo instalado. Esto  
  es as&iacute; para no confundir a la utilidad <command>fdisk</command> del 
  otro sistema operativo.</para>

  <para>En el caso de utilizar slices, el disco ser&aacute; a&ntilde;adido 
  como <filename>/dev/da1s1e</filename>. Esto se lee del siguiente modo: 
  disco SCSI, unidad n&uacute;mero 1 (segundo disco SCSI), slice 1 
  (partici&oacute;n 1 de la BIOS) y partici&oacute;n <filename>e</filename> 
  de tipo BSD. En el caso de utilizar el modo dedicado, el disco ser&aacute; 
  a&ntilde;adido, simplemente, como <filename>/dev/da1e</filename>.</para>

  <sect1>
    <title>Utilizando Sysinstall</title>
    
    <para>Puede utilizar <command>/stand/sysinstall</command> para crear y 
    etiquetar particiones en un disco nuevo usando sus intuitivos 
    men&uacute;s. Bien entre en el sistema como el usuario 
    <username>root</username>, o bien utilice el comando 
    <command>su</command>. Ejecute <command>/stand/sysinstall</command> y 
    seleccione el men&uacute; <literal>Configure</literal>. Dentro del 
    men&uacute; <literal>FreeBSD Configuration Menu</literal>, baje hasta 
    seleccionar la opci&oacute;n <literal>Partition</literal>. A 
    continuaci&oacute;n, se le deber&iacute;a mostrar una lista de los 
    discos duros instalados en su sistema. Si no aparece 
    <literal>da1</literal>, deber&aacute; usted comprobar la 
    instalaci&oacute;n f&iacute;sica del disco y la salida del comando 
    <command>dmesg</command> almacenada en el archivo 
    <filename>/var/run/dmesg.boot</filename>.</para>
    
    <para>Seleccione <literal>da1</literal> para pasar al editor de 
    particiones <literal>FDISK Partition Editor</literal>. Pulse 
    <literal>A</literal> para usar el disco entero para FreeBSD. Cuando se 
    le pregunte si quiere mantener el disco compatible con la 
    instalaci&oacute;n de  alg&uacute;n sistema operativo en el futuro 
    (<quote>remain cooperative with any future possible operating systems</quote>) 
    conteste afirmativamente (<literal>YES</literal>). Escriba los cambios en 
    el disco pulsando <command>W</command>. Ahora salga del editor FDISK 
    pulsando <command>q</command>. A continuaci&oacute;n se le 
    preguntar&aacute; acerca del sector de inicio del disco (MBR, Master 
    Boot Record). Como est&aacute; usted a&ntilde;adiendo un disco a un 
    sistema que ya se encuentra en funcionamiento, seleccione la 
    opci&oacute;n <literal>None</literal> (esta opci&oacute;n deja el MBR 
    intacto).</para>

    <para>A continuaci&oacute;n llegar&aacute; al <literal>Disk Label Editor</literal>. Aqu&iacute; es donde crear&aacute; las particiones de estilo tradicional BSD. Un disco puede tener hasta ocho particiones, designadas a-h. Algunas de las etiquetas de las particiones tienen usos especiales. La etiqueta <literal>a</literal> se utiliza para la partici&oacute;n ra&iacute;z (<filename>/</filename>, root partition). Por tanto, s&oacute;lo su disco de sistema (es decir, aquel desde el cual arranca el sistema) deber&iacute;a tener una partici&oacute;n <literal>a</literal>. La etiqueta <literal>b</literal> se utiliza para particiones de swap (memoria virtual) y es posible tener varios discos con particiones de swap. La etiqueta <literal>c</literal> representa a todo el disco utilizado en modo dedicado, o a todo el slice de FreeBSD si es que utilizamos el modo slice. Las restantes etiquetas son para uso general.</para>

    <para>El editor de etiquetas (de particiones) de Sysinstall utiliza la etiqueta <literal>e</literal> para particiones que no son root ni swap. Dentro del editor de etiquetas de particiones, cree un &uacute;nico sistema de archivos pulsando <command>C</command>. Cuando se le pregunte si ser&aacute; un sistema de archivos (FS, file system) o swap, elija <literal>FS</literal> e indique un punto donde montarlo (por ejemplo, <filename>/mnt</filename>). Cuando a&ntilde;ada un disco una vez instalado FreeBSD, Sysinstall no crear&aacute; la entrada correspondiente en <filename>/etc/fstab</filename>, por lo que no resulta importante el punto que indique para montar el disco.</para>

    <para>En este momento, ya puede escribir en el disco la informaci&oacute;n de las particiones y sus etiquetas y crear un sistema de archivos. Para ello pulse <command>W</command>. Ignore cualquier error de Sysinstall que le informe de que no pudo montar la nueva partici&oacute;n. Ya puede salir del editor de etiquetas de particiones y de Sysinstall.</para>

    <para>El &uacute;ltimo paso consiste en editar <filename>/etc/fstab</filename> para a&ntilde;adir una entrada para el nuevo disco.</para>
  </sect1>

  <sect1>
    <title>Usando la l&iacute;nea de comandos</title>

    <sect2>
      <title>* Utilizando  Slices</title>

      <para></para>
    </sect2>
    
    <sect2>
      <title>Modo Dedicado</title>

      <para>Si no va a compartir el nuevo disco con otro sistema operativo, puede usar el modo dedicado (<literal>dedicated</literal>). Recuerde que este modo puede confundir a los sistemas operativos de Microsoft; no obstante, estos no causar&aacute;n ning&uacute;n da&ntilde;o. En cambio, el OS/2 de IBM se &ldquo;apropiar&aacute;&rdquo; de cualquier partici&oacute;n que encuentre y que no reconozca.</para>
      
      <screen>&prompt.root; <userinput>dd if=/dev/zero of=/dev/rda1 bs=1k count=1</userinput>
&prompt.root; <userinput>disklabel -Brw da1 auto</userinput>
&prompt.root; <userinput>disklabel -e da1</userinput>				# creamos la partici&oacute;n `e'
&prompt.root; <userinput>newfs -d0 /dev/rda1e</userinput>
&prompt.root; <userinput>mkdir -p /1</userinput>
&prompt.root; <userinput>vi /etc/fstab</userinput>				# a&ntilde;adimos una entrada para /dev/da1e
&prompt.root; <userinput>mount /1</userinput></screen>
    
      <para>Un m&eacute;todo alternativo resulta:</para>
    
      <screen>&prompt.root; <userinput>dd if=/dev/zero of=/dev/rda1 count=2</userinput>
&prompt.root; <userinput>disklabel /dev/rda1 | disklabel -BrR da1 /dev/stdin</userinput>
&prompt.root; <userinput>newfs /dev/rda1e</userinput>
&prompt.root; <userinput>mkdir -p /1</userinput>
&prompt.root; <userinput>vi /etc/fstab</userinput>					# a&ntilde;adimos una entrada para  /dev/da1e
&prompt.root; <userinput>mount /1</userinput></screen>
    </sect2>
  </sect1>
  
  <sect1>
    <title>* Discos no tradicionales</title>
    
    <sect2>
      <title>* Discos Zip</title>

      <para></para>
    </sect2>

    <sect2>
      <title>* Discos Jaz</title>

      <para></para>
    </sect2>
    
    <sect2>
      <title>* Discos Sequest</title>

      <para></para>
    </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End:
-->






























