$FreeBSD$
<!--
     The FreeBSD Documentation Project
-->

<!--
<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % articles.ent PUBLIC "-//FreeBSD//ENTITIES DocBook FreeBSD Articles Entity Set//EN">
%articles.ent;
]>
-->


<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous
FreeBSD Entities//EN"> %freebsd;
<!ENTITY % newsgroups PUBLIC "-//FreeBSD//ENTITIES DocBook Newsgroup Entities//ES"> %newsgroups;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//EN">
%trademarks;
<!ENTITY % translators PUBLIC "-//FreeBSD//ENTITIES DocBook Translator Entities//ES">
%translators;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//ES"> %mailing-lists;
<!ENTITY % not.published "IGNORE">
]>


<article>
  <title>Argentina.com : Un estudio de caso</title>
  <articleinfo>

    <authorgroup>
      <author>
        <firstname>Carlos</firstname>
        <surname>Horowicz</surname>
        <affiliation>
          <address><email>ch@argentina.com</email>
          </address>
        </affiliation>
      </author>
    </authorgroup>

    <pubdate>$FreeBSD$</pubdate>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.cvsup;
      &tm-attrib.intel;
      &tm-attrib.xfree86;
      &tm-attrib.general;
    </legalnotice>

  </articleinfo>

<sect1 id="overview">
  <title>Introducci&oacute;n</title>

   <para>Argentina.Com es un ISP argentino con una peque&ntilde;a
   infraestructura de menos de 15 empleados y cuya fuente principal de
   ingresos proviene del negocio del acceso telef&oacute;nico a redes
   gratuito. Comenz&oacute; a operar en el a&ntilde;o 2000 con s&oacute;lo 
   un servidor para correo y chat.</para>

   <para>Desde entonces ha crecido su presencia en un mercado
   argentino de acceso telef&oacute;nico a redes que genera unos 45.000
   millones de minutos anualmente. Su producto m&aacute;s famoso proporciona
   a cerca de medio mill&oacute;n de usuarios correo gratuito con webmail,
   POP3 y acceso SMPT, junto con 300M de espacio de disco. Hacia el
   final de 2002 hab&iacute;a alrededor de 50.000 usuarios de correo.
   Despu&eacute;s de dos a&ntilde;os y medio de reingenier&iacute;a y de 
   s&oacute;lidas mejoras
   t&eacute;cnicas este ISP ha crecido en un factor de 3 en t&eacute;rminos 
   de facturaci&oacute;n, y en un factor de 10 en cuanto a la base de usuarios
   de correo.</para>

   <para>Nuestros competidores en el mercado argentino de acceso
   telef&oacute;nico incluyen a Fullzero (filial perteneciente a Clarin 
   Media Group), 
   Alternativa Gratis y Tutopia, este &uacute;ltimo fundado por IFX y
   promocionado por Hotmail. Algunos de estos grandes competidores
   comenzaron sus respectivos negocios de acceso telef&oacute;nico con
   inversiones multimillonarias y con campa&ntilde;as de publicidad agresivas
   en televisi&oacute;n e Internet.  Argentina.Com no utiliza este tipo de 
   publicidad. Ha alcanzado la cuarta posici&oacute;n con un 8% de cuota de
   mercado durante los dos &uacute;ltimos a&ntilde;os gracias a un calidad de
   servicio superior.</para>

   <para>En Argentina y en Latinoam&eacute;rica en general las personas que
   no poseen ordenador personal van a los llamados
   <quote>locutorios</quote> (centros de Internet), donde por unos
   pocos pesos pueden utilizar un ordenador conectado a Internet y
   donde normalmente leen y escriben correos electr&oacute;nicos  a 
   trav&eacute;s de portales
   populares como Hotmail, Yahoo! o Argentina.Com.</para>

   <para>Debido a los limitados recursos financieros disponibles,
   Argentina.Com decidi&oacute; invertir en un nuevo sistema de correo en vez
   de darse publicidad a trav&eacute;s de los medios. Esta decisi&oacute;n
   estrat&eacute;gica abre las puertas a un futuro negocio en el campo del
   correo corporativo y de pago.</para>
</sect1>

<sect1 id="challenge">
  <title>El desaf&iacute;o</title>

  <para>El desaf&iacute;o principal para Argentina.Com es alcanzar un tiempo
  de vida para el servicio de acceso telef&oacute;nico a redes de al menos
  99.95%, o menos de 5 horas de ca&iacute;das al a&ntilde;o. Debido a la alta
  rotaci&oacute;n y volatilidad que existe en este negocio, las cosas deben
  funcionar correctamente para que el usuario no cambie
  -voluntariamente o no- de proveedor de acceso a internet o de n&uacute;mero
  de tel&eacute;fono utilizado para conectarse. El negocio del
  <quote>dialup</quote>, como se le conoce en su denominaci&oacute;n inglesa,
  requiere una estructura de soporte para tratar con las grandes
  operadoras de telecomunicaciones problemas telef&oacute;nicos y de
  calidad de servicio, junto con una infraestructura t&eacute;cnica donde la
  latencia y la p&eacute;rdida de paquetes deben minimizarse debido a la
  naturaleza UDP de los servicio de Radius y DNS, y donde el DNS
  recursivo deber&iacute;a estar siempre disponible.</para>

   <para>Esto tamb&iacute;en implica tener un tiempo de vida alto en los
   servicio de POP3 y SMTP, junto con el servicio de webmail. Para
   POP3 y SMTP se estim&oacute; la necesidad de <quote>uptime</quote> igual
   que para el servicio de <quote>dialup</quote>, mientras que para el
   servicio de webmail se pens&oacute; en un porcentaje de 99.5%, lo que
   significa alrededor de dos dias por a&ntilde;o sin servicio o de 
   ca&iacute;da.</para>

  <para>Decidimos migrar el correo a una soluci&oacute;n propietaria de
  c&oacute;digo abierto que deber&iacute;a ser horizontalmente escalable y cuyos
  sistemas antivirus y antispam pudieran soportar m&aacute;s de un 
  &uacute;nico tipo
  de <quote>backend</quote> o de almacenamiento de correos.</para>

  <para>La feroz competencia en el mercado del correo
  electr&oacute;nico gratuito, principalmente iniciada por las recientes
  mejoras introducidas por Hotmail, Yahoo! y Gmail, hac&iacute;an necesario
  dise&ntilde;ar el nuevo sistema con al menos 300M de espacio de usuario en
  disco para cada usuario, pero a un coste inferior a 3 d&oacute;lares
  americanos por GB incluyendo cierto grado de redundancia. Hay que tener 
  en cuenta que el hardware que puede disponerse en <quote>rack</quote> 
  es dif&iacute;cil de encontrar en Argentina y que
  resulta ser entre un 30 y un 40% m&aacute;s caro que en los EEUU. Nuestro
  l&iacute;quido financiero para adquisici&oacute;n de equipos en dos 
  a&ntilde;os fue de
  75.000 d&oacute;lares americanos, lo cual es una fracci&oacute;n muy 
  peque&ntilde;a de las
  inversiones acometidas por nuestros competidores directos.</para>

  <para>Respecto al servicio antispam, era necesario desarrollar un
  producto que pudiera competir con los sistemas ofrecidos por los
  grandes. Dadas las hostiles condiciones que impone la existencia del
  spam (ataques de diccionario, spams con alto grado de ofuscaci&oacute;n y
  refinamiento, <quote>phishing</quote>, troyanos, correos-bomba,
  etc.) resulta muy complicado alcanzar tiempos de <quote>uptime</quote> 
  excelentes y
  al mismo tiempo repeler dichos ataques. Uno debe tambi&eacute;n ser
  cuidadoso para que el usuario no pierda correos debido a falsos
  positivos en la estrategia de clasificaci&oacute;n, para que no se le
  inunde con spam o notificaciones de spam y para que el correo
  peligroso no alcance la carpeta de entrada de los usuarios. Por
  &uacute;ltimo, el sistema de correo debe protegerse para que los
  <quote>spammers</quote> no lo utilicen en su provecho para 
  enviar spam.</para>

  <para>El paradigma del c&oacute;digo abierto normalmente requiere la
  adquisici&oacute;n de grandes equipos de administradores de sistemas,
  operadores y programadores que se  encarguen de aplicar parches,
  corregir <quote>bugs</quote> e integrar plataformas. El paradigma opuesto es
  tambi&eacute;n costoso debido a las caras licencias de software, la
  necesidad de hardware cada vez m&aacute;s caro y debido al 
  elevado n&uacute;mero de empleados encargados de proporcionar soporte.  
  As&iacute; que el desaf&iacute;o era
  encontrar la mezcla correcta entre recursos monetarios y humanos
  escasos, alta estabilidad y grado de predicci&oacute;n, y un desarrollo
  r&aacute;pido y fiable. En Buenos Aires resulta dif&iacute;cil encontrar 
  profesionales de las ciencias de la computaci&oacute;n bien entrenados, la
  mayor&iacute;a de los cuales viven y trabajan en el extranjero, mientras
  que los restantes poseen trabajos estables dentro de las
  instituciones del gobierno o en grades compa&ntilde;&iacute;as.</para>
</sect1>

<sect1 id="freebsd">
  <title>La soluci&oacute;n FreeBSD</title>

  <sect2 id="freebsd-intro">
    <title>Introducci&oacute;n</title>

    <para>A comienzos de 2003 ten&iacute;amos un sistema de correo
    CriticalPath bajo Solaris x86 y una m&aacute;quina Redhat
    para SMTP, Radius y DNS. Los servicios de DNS y Radius se ca&iacute;an
    constantemente y est&aacute;bamos luchando con colas enormes de correo
    electr&oacute;nico. Hubo un intento de instalar CriticalPath para Linux
    en Redhat en una m&aacute;quina Intel con una tarjeta Megaraid, pero la
    latencia del disco era enorme y la aplicaci&oacute;n de correo 
    no lleg&oacute; a funcionar.</para>

    <para>El primer paso realizado hacia la <quote>soluci&oacute;n &os;</quote>
    consiti&oacute; en migrar este hardware y software comercial a &os;
    4.8 con la ayuda de la emulaci&oacute;n Linux.</para>
  </sect2>

  <sect2 id="freebsd-choice">
    <title>La elecci&oacute;n de &os;</title>

    <para>El sistema operativo &os; goza de una merecida fama de por su gran
    estabilidad, junto con su pragmatismo y sentido com&uacute;n a la hora de
    poner aplicaciones <quote>on-line</quote> gracias a su excelente
    <ulink url="http://www.FreeBSD.org/ports">colecci&oacute;n de Ports</ulink>. 
    Nosotros consideramos su <ulink url="http://www.FreeBSD.org/releng">
    proceso de generaci&oacute;n de releases</ulink> muy sencillo de entender, 
    adem&aacute;s de que la comunidad de usuarios de las listas oficiales 
    de correo electr&oacute;nico mantiene un estilo educado y civilizado 
    cuando ayudan o leen los problemas de otros usuarios y sus soluciones.
    </para>

    <para>Otra caracter&iacute;stica importante es su r&aacute;pida 
    implantaci&oacute;n.  
    Afortunadamente pudimos establecer nuestra pol&iacute;tica de
    instalaci&oacute;n de SO alrededor de las capacidades predefinidas de
    &os;. En una compa&ntilde;&iacute;a peque&ntilde;a algunas veces 
    necesitas ir corriendo a un centro de datos y 
    r&aacute;pidamente levantar un servidor para
    proporcionar alg&uacute;n servicio. En los dos &uacute;ltimos a&ntilde;os,
    Argentina.Com adquiri&oacute; alrededor de cuarenta servidores, la
    mayor&iacute;a Pentium IV pero tambi&eacute;n varios Xeon duales y unos 
    cuantos Opteron duales para ubicarlos en los centros de datos
    donde tenemos los contratos de operaciones de <quote>hosting</quote> 
    y de acceso
    telef&oacute;nico a redes. Todos ellos ejecutan &os;, desde 4.8
    (un par de ellos con dos a&ntilde;os de <quote>uptime</quote> y 
    cero problemas) hasta 6.0-BETA2.</para>

    <para>La pol&iacute;tica general que tenemos para con el sistema 
    operativo consiste en intentar llevar a todos los servidores a la rama 
    de c&oacute;digo estable de una forma peri&oacute;dica utilizando 
    <literal>RELENG_4</literal>, <literal>RELENG_5</literal>
    y ahora <literal>RELENG_6</literal>. Estas operaciones nos permiten estar
    m&aacute;s preparados ante posibles amenazas de seguridad a nivel del 
    sistema operativo o del software base del mismo, especialmente en los 
    servidores web.</para>
  </sect2>

  <sect2 id="freebsd-engineer">
    <title>Reingenier&iacute;a b&aacute;sica</title>

    <para>El prime paso de reingenier&iacute;a fue poner en funcionamiento
      dos m&aacute;quinas &os; 4.8 cuya &uacute;nica tarea iba a consistir en 
      ser DNS autorizados para todos nuestros dominios. El software elegido 
      result&oacute; ser BIND9. Estas m&aacute;quinas se ubicaron en diferentes 
      centros de datos, cuid&aacute;ndonos de asegurar una
      buena latencia entre ellos para evitar problemas en transferencias
      de zonas, haciendo posible tratar con TTLs entre 60 y 600 segundos
      para as&iacute; poseer unos mejores m&aacute;rgenes de reacci&oacute;n 
      en caso de problemas.</para>

    <para>El segundo paso consisti&oacute; en desplegar dos m&aacute;quinas 
      m&aacute;s del mismo tipo, tambi&eacute;n en distintos centros de datos,  
      para s&oacute;lo servir Radius y DNS recursivo.  Los servidores de 
      acceso de red (<quote>Network Access 
      Servers</quote> o NAS) de los operadores de telecomunicaciones se 
      configuraron para enviar las peticiones de autorizaci&oacute; y 
      <quote>accounting</quote> de Radius hacia los nuestros, y 
      tambi&eacute;n para asignar dichos DNS recursivos
      a nuestros usuarios de acceso telef&oacute;nico.</para>

    <para>La tercera <quote>regla de oro</quote> consiste en no poner
      jam&aacute;s en la misma m&aacute;quina  el servicio de entrada 
      y salida de correo SMTP.  Desplegamos m&aacute;quinas &os; distintas 
      utilizando Postfix tanto para la entrada como para la salida.</para>
  </sect2>

  <sect2 id="freebsd-email">
    <title>Migraci&oacute;n del correo</title>
    
    <para>La migraci&oacute;n del correo requer&iacute;a una 
      planificaci&oacute;n cuidadosa debido al hecho de que &iacute;bamos a 
      a migrar tanto los frontales como los <quote>backends</quote>.  
      El primer paso fue construir un sistema perimetral antispam
      y antivirus con &os; 4.x y 5.x basado en postfix, amavisd-new,
      clamav y SpamAssassin. Estos sistemas iban a entregar correos
      tanto a los antiguos sistemas como a los nuevos hasta que el
      nuevo <quote>backend</quote> estuviera en funcionamiento. 
      Entre tanto a&ntilde;adimos peque&ntilde;as m&aacute;quinas &os; 
      para incrementar el <quote>spool</quote> de correo de
      CriticalPath sin ningún problema.</para>

    <para>En la primera l&iacute;nea de la entrada de correo pusimos
      varios MX del dominio Argentina.com para filtrar ataques de
      diccionario (intentos de reenviar correo a usuarios no existentes)
      adem&aacute;s de una <emphasis>lista negra</emphasis> derivada de 
      SURBL que result&oacute; no dar casi ning&uacute;n falso positivo.  
      Los correos eran multiplexados hacia un
      cluster de Xeon duales y Opteron duales donde ejecut&aacute;bamos 
      amavisd-new junto con un filtrado basado en listas blancas y negras
      basado en MySQL. Descartamos el uso de Bayes y Autowhitelisting
      en un nivel global debido a las grandes cantidades de falsos positivos
      y de falsos negativos que proporcionaban. En su lugar definimos unos
      cuantos niveles de spam de menos a m&aacute;s tolerante, cada uno con
      niveles de corte y de descarte. A cada correo electr&oacute;nico 
      recibido el sistema le asigna una determinada puntuaci&oacute;n.  
      Los correos con una puntuaci&oacute;n por debajo de la puntuaci&oacute;n 
      asociada con el nivel de corte establecido 
      por el nivel de spam pueden continuar hasta la bandeja de entrada del 
      usuario. Los correos entre el nivel de corte y el nivel de descarte se 
      env&iacute;an a una carpeta del usuario
      denominada Spam, y por &uacute;ltimo aquellos correos por encima 
      del nivel de
      corte se descartan porque se considera una situaci&oacute;n muy 
      evidente de spam.  
      En aras de la simplicidad, se asocian de forma transparente los correos
      almacenados en la libreta de direcciones con el sistema antispam, 
      coloc&aacute;ndolos en las <quote>listas blancas</quote> de forma 
      autom&aacute;tica.</para>

    <para>Con la introducci&oacute;n de Spamassassin 3.x, el tr&aacute;fico 
      de DNS utilizado para preguntar a las listas negras de correo 
      creci&oacute; 
      considerablemente, de tal forma que firmamos acuerdos con SpamCop,
      Spamhaus y SURBL para instalar r&eacute;plicas p&uacute;blicas de 
      sus bases de datos en nuestro equipo &os;.  Gracias a estas 
      r&eacute;plicas, que nos costaron entre 1 y 2Mbps de tr&aacute;fico, 
      fuimos capaces de
      reducir dr&aacute;sticamente la latencia de Spamassassin.</para>

    <para>En un tercer nivel nos encontramos con la entrega a los
      buzones de correo de los usuarios. Tan pronto como nos pusimos
      a contruir el nuevo <quote>backend</quote> Cyrus-Imap  con 
      autentificaci&oacute;n MySQL,
      nos dimos cuenta de que necesit&aacute;bamos multiplexar el correo de
      entrada a los usuarios en los formatos de los buzones nuevos y
      antiguos. Finalmente, conseguimos migrar cientos de miles de 
      correos hacia la nueva arquitectura Cyrus utilizando una fenomenal
      herramienta denominada imapsync, que se puede instalar directamente
      desde los ports. Tambi&eacute;n instalamos perdition (un proxy de POP3 y 
      de IMAP) entre medias para asegurar una migraci&acute;n transparente
      y permitir la distribuci&oacute;n entre distintos servidores de 
      los buzones.  
      En resumen, toda la informaci&oacute;n de localizaci&oacute;n de un 
      buz&oacute;n de usuario est&aacute; en MySQL, y dicha informaci&oacute;n 
      se encuentra disponible para todo el software que forma parte de 
      la cadena.</para>
      
    <para>Respecto al hardware para el espacio de disco, actualmente 
      utilizamos siete máquinas &os; con Cyrus-Imap de distinto hardware.
      El mayor es un Pentium IV con 4G de RAM y tarjetas 3ware 
      con 12 bah&iacute;as extra&iacute;bles en caliente, 
      organizadas en 3 unidades RAID-5
      de 1 Terabyte cada una. El software 3ware env&iacute;a un correo 
      electr&oacute;nico al administrador cuando el RAID se degrada 
      (en la mayor&iacute;a de los casos se trata de errores de disco) y 
      es posible reconstruir el RAID con el sistema a pleno rendimiento.  
      Utilizamos smartmontools en los casos en los que hay 
      menor redundancia, para disponer inmediatamente de alertas de discos
      con problemas de temperatura o de fallos de 
      <quote>selftests</quote>.</para>

    <para>Como software de correo web elegimos un producto comercial
      denominado Atmail, disponible con sus fuentes en perl y que 
      utiliza mod_perl. Bajo &os; resulta extremadamente 
      sencillo gestionar los m&oacute;dulos de perl y no es necesario usar 
      la <quote>shell</quote> de CPAN; &uacute;nicamente hay que seleccionar 
      el port correcto y ejecutar <quote>make install</quote>.  Tras varios 
      meses de trabajo de integraci&oacute;n pudimos integrar la parte cliente 
      de Atmail que habla IMAP con nuestros <quote>backends</quote>.  
      Tuvimos que modificar algunas partes del c&oacute;digo para adaptar
      el producto a nuestro entorno libre y para hacerlo compatible con nuestro
      per&iacute;metro antispam antivirus, adem&aacute;s de aplicar 
      nuestras personalizaciones y traducciones.</para>
  </sect2>

  <sect2 id="freebsd-web">
    <title>Migraci&oacute;n web</title>

    <para>Con la adopci&oacute;n de &os; no hubo que realizar ningún
      esfuerzo adicional para tener en ejecuci&oacute; en cuestion de minutos
      los entornos de Apache, PHP y MySQL. Incluso las actualizaciones de
      PHP4 a PHP5 se efectuaron sin problemas. El sistema de ports nos 
      result&oacute; una vez m&aacute;s extremadamente &uacute;til 
      y nos permitió hacer cosas como comprimir los contenidos de texto y de 
      html de Apache utilizando unas pocas l&iacute;neas de 
      documentaci&oacute;n.  Adem&aacute;s, hemos experimentado 
      un rendimiento excelente y una estabilidad y <quote>uptimes</quote> 
      extraordinarios.</para>
  </sect2>

</sect1>

<sect1 id="results">
  <title>Resultados</title>

  <para>Conseguimos implantar una arquitectura de correo electr&oacute;nico 
    basada en &os; que es escalable horizontalmente, utilizando 3
    Terabytes de almacenamiento basado en servidores Intel incurriendo
    en un coste de 3 dólares por Gigabyte con redundancia.</para>

  <para>La gran estabilidad alcanzada permiti&oacute; a Argentina.com explorar
    otros campos como el <quote>hosting</quote> para terceros y el 
    <quote>housing</quote> con presencia
    en los centros de datos argentinos.</para>

  <para>Ahora ofrecemos tambi&eacute;n acceso telef&oacute;nico a redes 
    corporativas para usuarios de <quote>roaming</quote> y Per&uacute; 
    gracias a nuestra presencia y a los acuerdos suscritos con la 
    mayor&iacute;a de los operadores de telecomunicaciones.  
    Entre nuestros clientes indirectos se encuentran las principales
    compa&ntilde;&iacute;as americanas como Ford, Exxon y Reuters.  
    Tambi&eacute;n estamos en el negocio del acceso telef&oacute;nico a redes
    en Brasil, Chile, Colombia y Panam&aacute;.</para>
</sect1>

</article>


