Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/kernelconfig/_index.po
Languages: ko, ru

source: This chapter covers how to configure the FreeBSD Kernel. When to build a custom kernel, how to take a hardware inventory, how to customize a kernel configuration file, etc
ko: 이 장에서는 FreeBSD 커널을 구성하는 방법을 다룹니다. 커스텀 커널을 빌드하는 시기, 하드웨어 인벤토리를 가져오는 방법, 커널 구성 파일을 커스터마이징하는 방법 등을 설명합니다
ru: Эта глава рассказывает о настройке ядра FreeBSD. Когда стоит собирать собственное ядро, как провести инвентаризацию оборудования, как настроить конфигурационный файл ядра и т. д.

source: Part II. Common Tasks
ko: 파트 II. 일반적인 작업
ru: Часть II. Стандартные задачи

source: Chapter 10. Configuring the FreeBSD Kernel
ru: Глава 10. Настройка ядра FreeBSD

source: Configuring the FreeBSD Kernel
ko: FreeBSD 커널 구성하기
ru: Настройка ядра FreeBSD

source: Synopsis
ko: 요약
ru: Обзор

source: The kernel is the core of the FreeBSD operating system. It is responsible for managing memory, enforcing security controls, networking, disk access, and much more. While much of FreeBSD is dynamically configurable, some users may wish to configure and compile a custom kernel.
ru: Ядро — это основа операционной системы FreeBSD. Оно отвечает за управление памятью, обеспечение контроля безопасности, работу с сетью, доступ к дискам и многое другое. Хотя большая часть FreeBSD динамически настраивается, некоторые пользователи могут захотеть настроить и скомпилировать собственное ядро.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: When to build a custom kernel.
ko: 커스텀 커널을 빌드할 시기.
ru: Когда следует собирать собственный ядро.

source: How to take a hardware inventory.
ko: 하드웨어 인벤토리를 작성하는 방법.
ru: Как провести инвентаризацию оборудования.

source: How to customize a kernel configuration file.
ko: 커널 구성 파일을 커스터마이징 하는 방법.
ru: Как настроить файл конфигурации ядра.

source: How to use the kernel configuration file to create and build a new kernel.
ko: 커널 구성 파일을 사용하여 새 커널을 생성하고 빌드하는 방법.
ru: Как использовать файл конфигурации ядра для создания и сборки нового ядра.

source: How to install the new kernel.
ko: 새 커널을 설치하는 방법.
ru: Как установить новое ядро.

source: How to troubleshoot if things go wrong.
ko: 문제를 해결하는 방법.
ru: Как устранить неполадки, если что-то пойдет не так.

source: All of the commands listed in the examples in this chapter should be executed as `root`.
ko: 이 장의 예제에 나열된 모든 명령은 `root`로 실행해야 합니다.
ru: Все команды, приведенные в примерах этой главы, должны выполняться от имени пользователя `root`.

source: Why Build a Custom Kernel?
ko: 커스텀 커널을 빌드하는 이유는 무엇인가요?
ru: Зачем собирать собственное ядро?

source: Traditionally, FreeBSD used a monolithic kernel. The kernel was one large program, supported a fixed list of devices, and in order to change the kernel's behavior, one had to compile and then reboot into a new kernel.
ko: 전통적으로 FreeBSD는 모놀리식 커널(단일 커널)을 사용했습니다. 커널은 하나의 큰 프로그램으로 고정된 장치 목록을 지원했으며, 커널의 동작을 변경하려면 컴파일한 다음 새 커널로 재부팅해야 했습니다.
ru: Традиционно FreeBSD использовала монолитное ядро. Ядро представляло собой одну большую программу, поддерживало фиксированный список устройств, и для изменения его поведения необходимо было скомпилировать новое ядро, а затем перезагрузиться в него.

source: Today, most of the functionality in the FreeBSD kernel is contained in modules which can be dynamically loaded and unloaded from the kernel as necessary. This allows the running kernel to adapt immediately to new hardware and for new functionality to be brought into the kernel. This is known as a modular kernel.
ko: 오늘날 FreeBSD 커널의 대부분의 기능은 필요에 따라 커널에서 동적으로 로드 및 언로드할 수 있는 모듈에 포함되어 있습니다. 이를 통해 실행 중인 커널이 새로운 하드웨어에 즉시 적응하고 새로운 기능을 커널로 가져올 수 있습니다. 이를 모듈형 커널이라고 합니다.
ru: Сегодня большая часть функциональности ядра FreeBSD содержится в модулях, которые могут быть динамически загружены в ядро или выгружены из него по мере необходимости. Это позволяет работающему ядру немедленно адаптироваться к новому оборудованию и добавлять новую функциональность. Такое ядро называется модульным.

source: Occasionally, it is still necessary to perform static kernel configuration. Sometimes the needed functionality is so tied to the kernel that it can not be made dynamically loadable. Some security environments prevent the loading and unloading of kernel modules and require that only needed functionality is statically compiled into the kernel.
ko: 때때로 정적 커널 구성을 해야 하는 경우도 있습니다. 때로는 필요한 기능이 커널에 너무 많이 묶여 있어 동적으로 로드할 수 없는 경우도 있습니다. 일부 보안 환경에서는 커널 모듈의 로딩 및 언로딩을 방지하고 필요한 기능만 커널에 정적으로 컴파일해야 합니다.
ru: Время от времени всё ещё требуется выполнять статическую настройку ядра. Иногда необходимая функциональность настолько тесно связана с ядром, что её невозможно сделать динамически загружаемой. В некоторых средах с повышенными требованиями к безопасности запрещена загрузка и выгрузка модулей ядра, и требуется, чтобы только необходимая функциональность была статически скомпилирована в ядро.

source: Building a custom kernel is often a rite of passage for advanced BSD users. This process, while time consuming, can provide benefits to the FreeBSD system. Unlike the [.filename]#GENERIC# kernel, which must support a wide range of hardware, a custom kernel can be stripped down to only provide support for that computer's hardware. This has a number of benefits, such as:
ko: 커스텀 커널을 빌드하는 것은 종종 고급 BSD 사용자들에겐 통과의례 같은 것입니다. 이 과정은 시간이 많이 걸리지만 FreeBSD 시스템에 이점을 제공할 수 있습니다. 광범위한 하드웨어를 지원해야 하는 [.filename]#GENERIC# 커널과 달리, 커스텀 커널은 해당 컴퓨터의 하드웨어만 지원하도록 커널을 재편성할 수 있습니다. 여기에는 다음과 같은 여러 가지 이점이 있습니다:
ru: Сборка собственного ядра часто является своего рода обрядом посвящения для опытных пользователей BSD. Этот процесс, хотя и отнимает много времени, может принести пользу системе FreeBSD. В отличие от ядра [.filename]#GENERIC#, которое должно поддерживать широкий спектр оборудования, собственное ядро можно сократить до поддержки только аппаратного обеспечения данного компьютера. Это дает ряд преимуществ, таких как:

source: Faster boot time. Since the kernel will only probe the hardware on the system, the time it takes the system to boot can decrease.
ko: 부팅 시간이 빨라집니다. 커널이 시스템의 하드웨어만 검사하기 때문에 시스템 부팅에 걸리는 시간이 단축될 수 있습니다.
ru: Более быстрая загрузка. Поскольку ядро будет проверять только оборудование, установленное в системе, время загрузки системы может сократиться.

source: Lower memory usage. A custom kernel often uses less memory than the [.filename]#GENERIC# kernel by omitting unused features and device drivers. This is important because the kernel code remains resident in physical memory at all times, preventing that memory from being used by applications. For this reason, a custom kernel is useful on a system with a small amount of RAM.
ko: 메모리 사용량 감소. 사용자 지정 커널은 사용하지 않는 기능과 장치 드라이버를 생략하여 [.filename]#GENERIC# 커널보다 메모리를 적게 사용하는 경우가 많습니다. 커널 코드는 항상 실제 메모리에 상주하여 애플리케이션에서 해당 메모리를 사용하지 못하도록 하기 때문에 이 점이 중요합니다. 이러한 이유로 커스텀 커널은 RAM 용량이 적은 시스템에서 유용합니다.
ru: Снижение использования памяти. Собственное ядро часто потребляет меньше памяти, чем ядро [.filename]#GENERIC#, за счёт исключения неиспользуемых функций и драйверов устройств. Это важно, поскольку код ядра постоянно находится в физической памяти, не позволяя использовать эту память приложениям. По этой причине собственное ядро полезно на системах с небольшим объёмом оперативной памяти.

source: Additional hardware support. A custom kernel can add support for devices which are not present in the [.filename]#GENERIC# kernel.
ko: 추가 하드웨어 지원. 사용자 지정 커널은 [.filename]#GENERIC# 커널에 없는 장치에 대한 지원을 추가할 수 있습니다.
ru: Дополнительная поддержка оборудования. Собственное ядро может добавить поддержку устройств, которые отсутствуют в ядре [.filename]#GENERIC#.

source: When building a custom kernel, it is important to note that non-default configurations are less thoroughly tested than the GENERIC configuration. While customizing the kernel can provide specific benefits it also increases the risk of encountering build or runtime issues. Custom kernel configurations are recommended only for advanced users who have a specific reason for making changes and are willing to engage in the debugging process if necessary.
ru: При сборке собственного ядра важно учитывать, что нестандартные конфигурации тестируются менее тщательно, чем конфигурация GENERIC. Хотя настройка ядра может дать определённые преимущества, она также увеличивает риск возникновения проблем при сборке или во время работы. Пользовательские конфигурации ядра рекомендуются только опытным пользователям, у которых есть веская причина для внесения изменений и которые готовы при необходимости участвовать в процессе отладки.

source: Before building a custom kernel, consider the reason for doing so. If there is a need for specific hardware support, it may already exist as a module.
ko: 커스텀 커널을 빌드하기 전에 커널을 빌드하는 이유를 고려하세요. 특정 하드웨어 지원이 필요한 경우 이미 모듈로 존재할 수 있습니다.
ru: Прежде чем собирать собственное ядро, стоит подумать о причине этого. Если требуется поддержка определённого оборудования, она может уже существовать в виде модуля.

source: Kernel modules exist in [.filename]#/boot/kernel# and may be dynamically loaded into the running kernel using man:kldload[8]. Most kernel drivers have a loadable module and manual page. For example, the man:ath[4] wireless network driver has the following information in its manual page:
ko: 커널 모듈은 [.filename]#/boot/kernel#에 존재하며 man:kldload[8]를 사용하여 실행 중인 커널에 동적으로 로드할 수 있습니다. 대부분의 커널 드라이버에는 로드 가능한 모듈과 매뉴얼 페이지가 있습니다. 예를 들어, man:ath[4] 무선 네트워크 드라이버는 매뉴얼 페이지에 다음과 같은 정보가 있습니다:
ru: Модули ядра находятся в [.filename]#/boot/kernel# и могут быть динамически загружены в работающее ядро с помощью man:kldload[8]. Большинство драйверов ядра имеют загружаемый модуль и страницу руководства. Например, драйвер беспроводной сети man:ath[4] содержит следующую информацию на своей странице руководства:

source: Alternatively, to load the driver as a module at boot time, place the following line in man:loader.conf[5]:
ru: В качестве альтернативы, для загрузки драйвера в виде модуля при старте системы, поместите следующую строку в man:loader.conf[5]:

source: Adding `if_ath_load="YES"` to [.filename]#/boot/loader.conf# will load this module dynamically at boot time.
ko: `if_ath_load=“YES”`를 [.filename]#/boot/loader.conf#에 추가하기만 하면 부팅 시 이 모듈을 동적으로 로드할 수 있습니다.
ru: Добавление `if_ath_load="YES"` в [.filename]#/boot/loader.conf# позволит динамически загрузить этот модуль во время загрузки системы.

source: In some cases, there is no associated module in [.filename]#/boot/kernel#. This is mostly true for certain subsystems.
ko: 경우에 따라 [.filename]#/boot/kernel#에 관련 모듈이 없는 경우도 있습니다. 이는 몇몇 서브시스템에서 주로 발생합니다.
ru: В некоторых случаях связанный модуль отсутствует в [.filename]#/boot/kernel#. Это в основном относится к определенным подсистемам.

source: Finding the System Hardware
ko: 시스템 하드웨어 찾기
ru: Поиск информации об оборудовании системы

source: Before editing the kernel configuration file, it is recommended to perform an inventory of the machine's hardware. On a dual-boot system, the inventory can be created from the other operating system. For example, Microsoft(R)'s Device Manager contains information about installed devices.
ko: 커널 구성 파일을 편집하기 전에 머신의 하드웨어 인벤토리를 준비하는 것이 좋습니다. 듀얼 부팅 시스템에서는 다른 운영 체제에서 인벤토리를 생성할 수 있습니다. 예를 들어 Microsoft(R)의 장치 관리자에는 설치된 장치에 대한 정보가 포함되어 있습니다.
ru: Прежде чем редактировать файл конфигурации ядра, рекомендуется составить перечень оборудования компьютера. На системе с двойной загрузкой этот перечень можно создать из другой операционной системы. Например, Диспетчер устройств Microsoft(R) содержит информацию об установленных устройствах.

source: Some versions of Microsoft(R) Windows(R) have a System icon which can be used to access Device Manager.
ko: 일부 Microsoft(R) Windows(R) 버전에는 장치 관리자에 액세스하는 데 사용할 수 있는 시스템 아이콘이 있습니다.
ru: Некоторые версии Microsoft(R) Windows(R) имеют значок "Система", который можно использовать для доступа к диспетчеру устройств.

source: If FreeBSD is the only installed operating system, use man:dmesg[8] to determine the hardware that was found and listed during the boot probe. Most device drivers on FreeBSD have a manual page which lists the hardware supported by that driver. For example, the following lines indicate that the man:psm[4] driver found a mouse:
ko: 설치된 운영체제가 FreeBSD뿐인 경우, man:dmesg[8]를 사용하여 부팅 프로브 중에 발견되어 나열된 하드웨어를 확인합니다. FreeBSD의 대부분의 장치 드라이버에는 해당 드라이버가 지원하는 하드웨어를 나열하는 설명서 페이지가 있습니다. 예를 들어, 다음 줄은 man:psm[4] 드라이버가 마우스를 찾았음을 나타냅니다:
ru: Если FreeBSD — единственная установленная операционная система, используйте man:dmesg[8] для определения оборудования, обнаруженного и перечисленного во время загрузки. Большинство драйверов устройств в FreeBSD имеют справочную страницу, в которой перечислено поддерживаемое оборудование. Например, следующие строки указывают, что драйвер man:psm[4] обнаружил мышь:

source: Since this hardware exists, this driver should not be removed from a custom kernel configuration file.
ko: 이 하드웨어가 존재하므로 사용자 정의 커널 구성 파일에서 이 드라이버를 제거해서는 안 됩니다.
ru: Поскольку данное оборудование существует, этот драйвер не следует удалять из файла конфигурации собственного ядра.

source: If the output of `dmesg` does not display the results of the boot probe output, instead read the contents of [.filename]#/var/run/dmesg.boot#.
ko: `dmesg`의 출력에 부팅 프로브 출력 결과가 표시되지 않는 경우, 대신 [.filename]#/var/run/dmesg.boot#의 내용을 확인합니다.
ru: Если вывод команды `dmesg` не отображает результаты загрузочного probing, вместо этого прочитайте содержимое файла [.filename]#/var/run/dmesg.boot#.

source: Another tool for finding hardware is man:pciconf[8], which provides more verbose output. For example:
ko: 하드웨어를 찾는 또 다른 도구로는 man:pciconf[8]가 있는데, 이 도구는 더 자세한 출력을 제공합니다. 예를 들어:
ru: Еще один инструмент для поиска оборудования — это man:pciconf[8], который предоставляет более подробный вывод. Например:

source: This output shows that the [.filename]#ath# driver located a wireless Ethernet device.
ko: 이 출력은 [.filename]#ath# 드라이버가 무선 이더넷 장치를 찾았음을 보여줍니다.
ru: Этот вывод показывает, что драйвер [.filename]#ath# обнаружил беспроводное Ethernet-устройство.

source: The `-k` flag of man:man[1] can be used to provide useful information. For example, it can be used to display a list of manual pages which contain a particular device brand or name:
ko: Man:man[1]의 `-k` 플래그는 유용한 정보를 제공하는 데 사용할 수 있습니다. 예를 들어 특정 기기 브랜드나 이름이 포함된 매뉴얼 페이지 목록을 표시하는 데 사용할 수 있습니다:
ru: Флаг `-k` утилиты man:man[1] может быть полезен для получения информации. Например, с его помощью можно вывести список страниц руководства, содержащих определённое название или марку устройства:

source: Once the hardware inventory list is created, refer to it to ensure that drivers for installed hardware are not removed as the custom kernel configuration is edited.
ko: 하드웨어 인벤토리 목록이 생성되면 이를 참조하여 사용자 지정 커널 구성을 편집할 때 설치된 하드웨어의 드라이버가 제거되지 않도록 합니다.
ru: После составления списка оборудования обратитесь к нему, чтобы убедиться, что драйверы установленного оборудования не будут удалены при редактировании конфигурации собственного ядра.

source: The Configuration File
ko: 구성 파일
ru: Файл конфигурации

source: In order to create a custom kernel configuration file and build a custom kernel, the full FreeBSD source tree must first be installed.
ko: 커스텀 커널 구성 파일을 생성하고 커스텀 커널을 빌드하려면 먼저 전체 FreeBSD 소스 트리를 설치해야 합니다.
ru: Для создания файла конфигурации собственного ядра и сборки кастомного ядра необходимо сначала установить полное дерево исходных кодов FreeBSD.

source: If [.filename]#/usr/src/# does not exist or it is empty, source has not been installed. Source can be installed with Git using the instructions in crossref:mirrors[git,“Using Git”].
ko: [.filename]#/usr/src/#이 존재하지 않거나 비어 있으면 소스가 설치되지 않은 것입니다. crossref:mirrors[git,“Using Git”]의 지침에 따라 Git으로 소스를 설치할 수 있습니다.
ru: Если [.filename]#/usr/src/# не существует или пуст, исходный код не установлен. Исходный код можно установить с помощью Git, следуя инструкциям в crossref:mirrors[git,“Использование Git”].

source: Once source is installed, review the contents of [.filename]#/usr/src/sys#. This directory contains a number of subdirectories, including those which represent the following supported architectures: [.filename]#amd64#, [.filename]#i386#, [.filename]#powerpc#, and [.filename]#sparc64#. Everything inside a particular architecture's directory deals with that architecture only and the rest of the code is machine independent code common to all platforms. Each supported architecture has a [.filename]#conf# subdirectory which contains the [.filename]#GENERIC# kernel configuration file for that architecture.
ko: 소스가 설치되면 [.filename]#/usr/src/sys#의 내용을 검토합니다. 이 디렉토리에는 다음과 같이 지원되는 아키텍처를 나타내는 하위 디렉터리가 다수 포함되어 있습니다: [.filename]#amd64#, [.filename]#i386#, [.filename]#powerpc#, [.filename]#sparc64#. 특정 아키텍처의 디렉터리 안에 있는 모든 코드는 해당 아키텍처만 다루며 나머지 코드는 모든 플랫폼에 공통으로 적용되는 머신 독립적인 코드입니다. 지원되는 각 아키텍처에는 [.filename]#conf# 하위 디렉터리가 있으며, 이 디렉터리에는 해당 아키텍처에 대한 [.filename]#GENERIC# 커널 구성 파일이 포함되어 있습니다.
ru: После установки исходного кода ознакомьтесь с содержимым каталога [.filename]#/usr/src/sys#. Этот каталог содержит несколько подкаталогов, включая те, которые соответствуют следующим поддерживаемым архитектурам: [.filename]#amd64#, [.filename]#i386#, [.filename]#powerpc# и [.filename]#sparc64#. Всё содержимое каталога конкретной архитектуры относится только к этой архитектуре, а остальной код является машинонезависимым и общим для всех платформ. Каждая поддерживаемая архитектура имеет подкаталог [.filename]#conf#, который содержит файл конфигурации ядра [.filename]#GENERIC# для данной архитектуры.

source: Do not make edits to [.filename]#GENERIC#. Instead, copy the file to a different name and make edits to the copy. The convention is to use a name with all capital letters. When maintaining multiple FreeBSD machines with different hardware, it is a good idea to name it after the machine's hostname. This example creates a copy, named [.filename]#MYKERNEL#, of the [.filename]#GENERIC# configuration file for the `amd64` architecture:
ko: [.filename]#GENERIC#을 수정하지 마세요. 대신 파일을 다른 이름으로 복사하고 복사본을 수정합니다. 전부 대문자로 된 이름을 사용하는 것이 규칙입니다. 하드웨어가 다른 여러 대의 FreeBSD 머신을 유지 관리할 때는 머신의 호스트 이름을 따서 이름을 지정하는 것이 좋습니다. 이 예는 `amd64` 아키텍처에 대한 [.filename]#MYKERNEL# 구성 파일의 [.filename]#GENERIC# 복사본을 만듭니다:
ru: Не вносите изменения в файл [.filename]#GENERIC#. Вместо этого скопируйте его под другим именем и редактируйте копию. По сложившейся практике имя файла должно состоять из заглавных букв. Если вы обслуживаете несколько машин FreeBSD с разным оборудованием, разумно назвать файл по имени хоста соответствующей машины. В следующем примере создаётся копия файла конфигурации [.filename]#GENERIC# для архитектуры `amd64` с именем [.filename]#MYKERNEL#:

source: [.filename]#MYKERNEL# can now be customized with any `ASCII` text editor. The default editor is vi, though an easier editor for beginners, called ee, is also installed with FreeBSD.
ko: 이제 `ASCII` 텍스트 편집기를 사용하여 [.filename]#MYKERNEL#을 사용자 지정할 수 있습니다. 기본 편집기는 vi이지만, 초보자를 위한 더 쉬운 편집기인 ee도 FreeBSD와 함께 설치되어 있습니다.
ru: [.filename]#MYKERNEL# теперь можно настроить с помощью любого текстового редактора, поддерживающего `ASCII`. Редактор по умолчанию — vi, но для новичков также установлен более простой редактор под названием ee.

source: The format of the kernel configuration file is simple. Each line contains a keyword that represents a device or subsystem, an argument, and a brief description. Any text after a `+#+` is considered a comment and ignored. To remove kernel support for a device or subsystem, put a `+#+` at the beginning of the line representing that device or subsystem. Do not add or remove a `+#+` for any line that you do not understand.
ko: 커널 구성 파일의 형식은 간단합니다. 각 줄에는 장치 또는 하위 시스템을 나타내는 키워드, 인수 및 간단한 설명이 포함됩니다. `+#+`이후의 텍스트는 주석으로 간주되어 무시됩니다. 장치 또는 하위 시스템에 대한 커널 지원을 제거하려면 해당 장치 또는 하위 시스템을 나타내는 줄의 시작 부분에 `+#+`를 넣습니다. 잘 모르는 내용에 `+#+`를 추가하거나 제거하지 마세요.
ru: Формат файла конфигурации ядра прост. Каждая строка содержит ключевое слово, представляющее устройство или подсистему, аргумент и краткое описание. Любой текст после `+#+` считается комментарием и игнорируется. Чтобы удалить поддержку устройства или подсистемы в ядре, поставьте `+#+` в начале строки, соответствующей этому устройству или подсистеме. Не добавляйте и не удаляйте `+#+` для строк, которые вы не понимаете.

source: It is easy to remove support for a device or option and end up with a broken kernel. For example, if the man:ata[4] driver is removed from the kernel configuration file, a system using `ATA` disk drivers may not boot. When in doubt, just leave support in the kernel.
ko: 장치 또는 옵션에 대한 지원을 제거하면 커널이 손상되기 쉽습니다. 예를 들어 커널 구성 파일에서 man:ata[4] 드라이버가 제거되면 `ATA` 디스크 드라이버를 사용하는 시스템이 부팅되지 않을 수 있습니다. 확실하지 않은 경우 커널에 지원을 남겨두세요.
ru: Легко удалить поддержку устройства или опции и получить нерабочее ядро. Например, если драйвер man:ata[4] удалён из конфигурационного файла ядра, система, использующая драйверы дисков `ATA`, может не загрузиться. Если сомневаетесь — оставьте поддержку в ядре.

source: In addition to the brief descriptions provided in this file, additional descriptions are contained in [.filename]#NOTES#, which can be found in the same directory as [.filename]#GENERIC# for that architecture. For architecture independent options, refer to [.filename]#/usr/src/sys/conf/NOTES#.
ko: 이 파일에 제공된 간략한 설명 외에도 해당 아키텍처의 [.filename]#GENERIC#과 같은 디렉터리에서 찾을 수 있는 [.filename]#NOTES#에 추가 설명이 포함되어 있습니다. 아키텍처 독립적인 옵션은 [.filename]#/usr/src/sys/conf/NOTES#를 참조하세요.
ru: В дополнение к кратким описаниям, приведённым в этом файле, дополнительные описания содержатся в [.filename]#NOTES#, которые можно найти в том же каталоге, что и [.filename]#GENERIC# для данной архитектуры. Для архитектурно-независимых параметров обратитесь к [.filename]#/usr/src/sys/conf/NOTES#.

source: When finished customizing the kernel configuration file, save a backup copy to a location outside of [.filename]#/usr/src#.
ko: 커널 구성 파일 사용자 지정이 완료되면 백업 복사본을 [.filename]#/usr/src# 외부 위치에 저장합니다.
ru: После завершения настройки конфигурационного файла ядра сохраните резервную копию в расположении за пределами [.filename]#/usr/src#.

source: Alternately, keep the kernel configuration file elsewhere and create a symbolic link to the file:
ko: 또는 커널 구성 파일을 다른 곳에 보관하고 파일에 대한 심볼릭 링크를 생성하세요:
ru: Или можно сохранить файл конфигурации ядра в другом месте и создать символическую ссылку на него:

source: An `include` directive is available for use in configuration files. This allows another configuration file to be included in the current one, making it easy to maintain small changes relative to an existing file. If only a small number of additional options or drivers are required, this allows a delta to be maintained with respect to [.filename]#GENERIC#, as seen in this example:
ko: `include` 지시어를 설정파일에 사용할 수 있습니다. 이렇게 하면 다른 설정 파일을 현재 설정 파일에 포함시킬 수 있으므로 기존 파일과 관련된 작은 변경 사항을 쉽게 유지할 수 있습니다. 소수의 추가 옵션이나 드라이버만 필요한 경우 이 예제에서 볼 수 있듯이 [.filename]#GENERIC#에 대한 델타를 유지 관리할 수 있습니다:
ru: В конфигурационных файлах доступна директива `include`, которая позволяет включать содержимое другого конфигурационного файла в текущий. Это упрощает поддержку небольших изменений относительно существующего файла. Если требуется лишь несколько дополнительных параметров или драйверов, можно сохранять разницу относительно [.filename]#GENERIC#, как показано в примере:
