Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/kernelconfig/_index.po
Languages: ko, ru

source: Using this method, the local configuration file expresses local differences from a [.filename]#GENERIC# kernel. As upgrades are performed, new features added to [.filename]#GENERIC# will also be added to the local kernel unless they are specifically prevented using `nooptions` or `nodevice`. A comprehensive list of configuration directives and their descriptions may be found in man:config[5].
ko: 이 방법을 사용하면 로컬 구성 파일은 [.filename]#GENERIC# 커널과의 로컬 차이점을 표현합니다. 업그레이드가 수행될 때, `nooptions` 또는 `nodevice`를 사용하여 특별히 차단하지 않는 한, [.filename]#GENERIC#에 추가된 새로운 기능도 로컬 커널에 추가됩니다. 구성 지시어의 포괄적인 목록과 설명은 man:config[5]에서 찾을 수 있습니다.
ru: При использовании этого метода локальный конфигурационный файл отражает локальные отличия от ядра [.filename]#GENERIC#. При выполнении обновлений новые функции, добавленные в [.filename]#GENERIC#, также будут добавлены в локальное ядро, если они не запрещены явно с помощью `nooptions` или `nodevice`. Полный список директив конфигурации и их описания можно найти в man:config[5].

source: To build a file which contains all available options, run the following command as `root`:
ko: 사용 가능한 모든 옵션이 포함된 파일을 빌드하려면 다음 명령을 `root`로 실행합니다:
ru: Чтобы создать файл, содержащий все доступные параметры, выполните следующую команду от имени `root`:

source: Building and Installing a Custom Kernel
ko: 커스텀 커널 빌드 및 설치하기
ru: Сборка и установка собственного ядра

source: Once the edits to the custom configuration file have been saved, the source code for the kernel can be compiled using the following steps:
ko: 사용자 지정 구성 파일에 대한 편집 내용을 저장한 후에는 다음 단계에 따라 커널의 소스 코드를 컴파일할 수 있습니다:
ru: После сохранения изменений в пользовательском конфигурационном файле исходный код ядра можно скомпилировать, выполнив следующие шаги:

source: *Procedure: Building a Kernel*
ko: *절차: 커널 빌드*
ru: *Процедура: Сборка ядра*

source: Change to this directory:
ko: 이 디렉토리로 변경합니다:
ru: Перейдите в этот каталог:

source: Compile the new kernel by specifying the name of the custom kernel configuration file:
ko: 사용자 지정 커널 구성 파일의 이름을 지정하여 새 커널을 컴파일합니다:
ru: Соберите новое ядро, указав имя файла конфигурации собственного ядра:

source: Install the new kernel associated with the specified kernel configuration file. This command will copy the new kernel to [.filename]#/boot/kernel/kernel# and save the old kernel to [.filename]#/boot/kernel.old/kernel#:
ko: 지정된 커널 구성 파일과 연결된 새 커널을 설치합니다. 이 명령은 새 커널을 [.filename]#/boot/kernel/kernel#에 복사하고 이전 커널을 [.filename]#/boot/kernel.old/kernel#에 저장합니다:
ru: Установите новое ядро, связанное с указанным файлом конфигурации ядра. Эта команда скопирует новое ядро в [.filename]#/boot/kernel/kernel#, а старое ядро сохранит в [.filename]#/boot/kernel.old/kernel#:

source: Shutdown the system and reboot into the new kernel. If something goes wrong, refer to crossref:kernelconfig[kernelconfig-noboot, The kernel does not boot].
ru: Выключите систему и перезагрузитесь с новым ядром. Если возникнут проблемы, обратитесь к разделу crossref:kernelconfig[kernelconfig-noboot, Ядро не загружается].

source: By default, when a custom kernel is compiled, all kernel modules are rebuilt. To update a kernel faster or to build only custom modules, edit [.filename]#/etc/make.conf# before starting to build the kernel.
ko: 기본적으로 커스텀 커널을 컴파일하면 모든 커널 모듈이 다시 빌드됩니다. 커널을 더 빠르게 업데이트하거나 커스텀 모듈만 빌드하려면 커널 빌드를 시작하기 전에 [.filename]#/etc/make.conf#을 편집하세요.
ru: По умолчанию при компиляции собственного ядра все модули ядра пересобираются. Чтобы ускорить обновление ядра или собрать только необходимые модули, отредактируйте [.filename]#/etc/make.conf# перед началом сборки ядра.

source: For example, this variable specifies the list of modules to build instead of using the default of building all modules:
ko: 예를 들어 다음 변수는 모든 모듈을 빌드하는 기본값을 사용하는 대신, 빌드할 모듈 목록을 지정합니다:
ru: Например, эта переменная задаёт список модулей для сборки вместо использования значения по умолчанию (сборка всех модулей):

source: Alternately, this variable lists which modules to exclude from the build process:
ko: 또는 다음 변수는 빌드 프로세스에서 제외할 모듈을 나열합니다:
ru: Или эта переменная указывает, какие модули исключить из процесса сборки:

source: Additional variables are available. Refer to man:make.conf[5] for details.
ko: 추가 변수를 사용할 수도 있습니다. 자세한 내용은 man:make.conf[5]를 참조하세요.
ru: Доступны дополнительные переменные. Подробности смотрите в man:make.conf[5].

source: If Something Goes Wrong
ko: 문제가 발생했을 때
ru: Если что-то пойдет не так

source: There are four categories of trouble that can occur when building a custom kernel:
ko: 사용자 정의 커널을 빌드할 때 발생할 수 있는 문제에는 네 가지 범주가 있습니다:
ru: Существует четыре типа проблем, которые могут возникнуть при сборке собственного ядра:

source: `config` fails
ko: `config` 실패
ru: `config` завершается с ошибкой

source: If `config` fails, it will print the line number that is incorrect. As an example, for the following message, make sure that line 17 is typed correctly by comparing it to [.filename]#GENERIC# or [.filename]#NOTES#:
ko: `config`가 실패하면 잘못된 줄 번호가 인쇄됩니다. 예를 들어 다음 메시지의 경우 17번 줄을 [.filename]#GENERIC# 또는 [.filename]#NOTES#와 비교하여 올바르게 입력되었는지 확인합니다:
ru: Если `config` завершается с ошибкой, он выводит номер строки, содержащей ошибку. Например, при получении следующего сообщения убедитесь, что строка 17 введена правильно, сравнив её с [.filename]#GENERIC# или [.filename]#NOTES#:

source: `make` fails
ko: `make` 실패
ru: `make` завершается с ошибкой

source: If `make` fails, it is usually due to an error in the kernel configuration file which is not severe enough for `config` to catch. Review the configuration, and if the problem is not apparent, send an email to the {freebsd-questions} which contains the kernel configuration file.
ko: `make`가 실패하는 경우 일반적으로 커널 구성 파일에 `config`가 포착할 수 있을 만큼 심각하지 않은 오류가 있기 때문일 수 있습니다. 구성을 검토하고 문제가 명확하지 않은 경우 커널 구성 파일이 포함된 {freebsd-questions}으로 이메일을 보내세요.
ru: Если `make` завершается с ошибкой, обычно это связано с ошибкой в файле конфигурации ядра, которую `config` не смог обнаружить. Проверьте конфигурацию, и если проблема не очевидна, отправьте письмо в список рассылки {freebsd-questions}, приложив файл конфигурации ядра.

source: The kernel does not boot
ko: 커널이 부팅되지 않음
ru: Ядро не загружается

source: If the new kernel does not boot or fails to recognize devices, do not panic! Fortunately, FreeBSD has an excellent mechanism for recovering from incompatible kernels. Simply choose the kernel to boot from at the FreeBSD boot loader. This can be accessed when the system boot menu appears by selecting the "Escape to a loader prompt" option. At the prompt, type `boot _kernel.old_`, or the name of any other kernel that is known to boot properly.
ko: 새 커널이 부팅되지 않거나 장치를 인식하지 못하더라도 당황하지 마세요! 다행히도 FreeBSD에는 호환되지 않는 커널에서 복구할 수 있는 훌륭한 메커니즘이 있습니다. FreeBSD 부트 로더에서 부팅할 커널을 선택하기만 하면 됩니다. 시스템 부팅 메뉴가 나타날 때 “Escape to a loader prompt”옵션을 선택하면 이 메뉴에 액세스할 수 있습니다. 프롬프트에서 `boot _kernel.old_` 또는 제대로 부팅되는 것으로 알려진 다른 커널의 이름을 입력합니다.
ru: Если новый ядро не загружается или не распознаёт устройства, не паникуйте! К счастью, в FreeBSD есть отличный механизм восстановления после проблем с несовместимыми ядрами. Просто выберите ядро для загрузки в загрузчике FreeBSD. Это можно сделать при появлении меню загрузки системы, выбрав опцию «Escape to a loader prompt». В командной строке введите `boot _kernel.old_` или имя любого другого ядра, которое заведомо загружается правильно.

source: After booting with a good kernel, check over the configuration file and try to build it again. One helpful resource is [.filename]#/var/log/messages# which records the kernel messages from every successful boot. Also, man:dmesg[8] will print the kernel messages from the current boot.
ko: 정상 커널로 부팅한 후 구성 파일을 확인하고 다시 빌드를 시도하세요. 부팅에 성공할 때마다 커널 메시지를 기록하는 [.filename]#/var/log/messages#가 유용한 리소스 중 하나입니다. 또한 man:dmesg[8]는 현재 부팅의 커널 메시지를 인쇄합니다.
ru: После загрузки с исправным ядром проверьте конфигурационный файл и попробуйте собрать его снова. Полезным ресурсом может быть [.filename]#/var/log/messages#, где записываются сообщения ядра при каждой успешной загрузке. Также man:dmesg[8] выведет сообщения ядра текущей загрузки.

source: When troubleshooting a kernel make sure to keep a copy of a kernel that is known to work, such as [.filename]#GENERIC#. This is important because every time a new kernel is installed, [.filename]#kernel.old# is overwritten with the last installed kernel, which may or may not be bootable. As soon as possible, move the working kernel by renaming the directory containing the good kernel:
ko: 커널 문제를 해결할 때는 [.filename]#GENERIC#과 같이 작동하는 것으로 알려진 커널의 사본을 보관하세요. 새 커널이 설치될 때마다 [.filename]#kernel.old#는 마지막으로 설치된 커널로 덮어쓰기 때문에 부팅이 가능하거나 불가능할 수 있으므로 이 점이 중요합니다. 가능한 한 빨리 정상 커널이 포함된 디렉터리의 이름을 변경하여 작업 중인 커널을 이동하세요:
ru: При устранении неполадок ядра обязательно сохраняйте копию работоспособного ядра, например, [.filename]#GENERIC#. Это важно, потому что при каждой установке нового ядра файл [.filename]#kernel.old# перезаписывается последним установленным ядром, которое может быть или не быть загружаемым. Как можно скорее переместите рабочее ядро, переименовав каталог, содержащий исправное ядро:

source: The kernel works, but man:ps[1] does not
ko: 커널은 작동하지만 man:ps[1]가 작동하지 않습니다
ru: Ядро работает, но man:ps[1] — нет

source: If the kernel version differs from the one that the system utilities have been built with, for example, a kernel built from -CURRENT sources is installed on a -RELEASE system, many system status commands like man:ps[1] and man:vmstat[8] will not work. To fix this, crossref:cutting-edge[makeworld,recompile and install a world] built with the same version of the source tree as the kernel. It is never a good idea to use a different version of the kernel than the rest of the operating system.
ko: 커널 버전이 시스템 유틸리티가 빌드된 버전과 다른 경우(예: -CURRENT 소스로 빌드된 커널이 -RELEASE 시스템에 설치되어 있는 경우) man:ps[1] 및 man:vmstat[8] 같은 많은 시스템 상태 명령이 작동하지 않습니다. 이 문제를 해결하려면 커널과 동일한 버전의 소스 트리로 구축된 crossref:cutting-edge[makeworld,recompile and install a world]를 사용하십시오. 운영 체제의 다른 버전과 다른 버전의 커널을 사용하는 것은 결코 좋은 생각이 아닙니다.
ru: Если версия ядра отличается от той, с которой собраны системные утилиты, например, при установке ядра, собранного из исходников -CURRENT, на систему -RELEASE, многие команды для просмотра состояния системы, такие как man:ps[1] и man:vmstat[8], не будут работать. Чтобы исправить это, crossref:cutting-edge[makeworld,пересоберите и установите world], собранный из той же версии исходного дерева, что и ядро. Никогда не рекомендуется использовать версию ядра, отличную от остальной операционной системы.

source: Chapter 9. Configuring the FreeBSD Kernel
ko: 9장. FreeBSD 커널 구성하기

source: The kernel is the core of the FreeBSD operating system. It is responsible for managing memory, enforcing security controls, networking, disk access, and much more. While much of FreeBSD is dynamically configurable, it is still occasionally necessary to configure and compile a custom kernel.
ko: 커널은 FreeBSD 운영 체제의 핵심입니다. 커널은 메모리 관리, 보안 제어, 네트워킹, 디스크 액세스 등을 담당합니다. FreeBSD의 대부분은 동적으로 구성할 수 있지만, 커스텀 커널을 구성하고 컴파일해야 하는 경우도 있습니다.

source: Shutdown the system and reboot into the new kernel. If something goes wrong, refer to <<kernelconfig-noboot, The kernel does not boot>>.
ko: 시스템을 종료하고 새 커널로 재부팅합니다. 문제가 발생하면 <<kernelconfig-noboot, The kernel does not boot>>을 참조하세요.
