Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/writing-style/_index.po
Languages: pt_br, ru

source: Writing Style and some conventions used in the FreeBSD Documentation Project
pt_br: Estilo de Escrita e algumas convenções usadas no Projeto de Documentação do FreeBSD
ru: Стиль написания и некоторые соглашения, используемые в проекте документации FreeBSD

source: Chapter 12. Writing Style
pt_br: Capítulo 12. Estilo de Escrita
ru: Глава 12. Стиль написания

source: Writing Style
pt_br: Estilo de escrita
ru: Стиль написания

source: Tips
pt_br: Dicas
ru: Советы

source: Technical documentation can be improved by consistent use of several principles. Most of these can be classified into three goals: _be clear_, _be complete_, and _be concise_. These goals can conflict with each other. Good writing consists of a balance between them.
pt_br: A documentação técnica pode ser melhorada pelo uso consistente de vários princípios. A maioria destes pode ser classificada em três objetivos: _ser claro_, _ser completo_ e _ser conciso_. Essas metas podem entrar em conflito umas com as outras. Uma boa escrita consiste em um equilíbrio entre elas.
ru: Техническая документация может быть улучшена за счёт последовательного применения нескольких принципов. Большинство из них можно разделить на три цели: _быть понятным_, _быть полным_ и _быть кратким_. Эти цели могут противоречить друг другу. Хорошее изложение заключается в нахождении баланса между ними.

source: Be Clear
pt_br: Seja claro
ru: Будьте понятны

source: Clarity is extremely important. The reader may be a novice, or reading the document in a second language. Strive for simple, uncomplicated text that clearly explains the concepts.
pt_br: A clareza é extremamente importante. O leitor pode ser um novato ou ler o documento em um segundo idioma. Esforce-se por um texto simples e descomplicado que explique claramente os conceitos.
ru: Ясность чрезвычайно важна. Читатель может быть новичком или изучать документ на неродном языке. Стремитесь к простому, понятному тексту, который чётко объясняет концепции.

source: Avoid flowery or embellished speech, jokes, or colloquial expressions. Write as simply and clearly as possible. Simple text is easier to understand and translate.
pt_br: Evite discurso florido ou embelezado, piadas ou expressões coloquiais. Escreva da maneira mais simples e clara possível. Um texto simples é mais fácil de se entender e de se traduzir.
ru: Избегайте витиеватой или украшенной речи, шуток или разговорных выражений. Пишите как можно проще и яснее. Простой текст легче понять и перевести.

source: Keep explanations as short, simple, and clear as possible. Avoid empty phrases like "in order to", which usually just means "to". Avoid potentially patronizing words like "basically". Avoid Latin terms like "i.e.," or "cf.", which may be unknown outside of academic or scientific groups.
pt_br: Mantenha as explicações o mais curtas, simples e claras possíveis. Evite frases vazias como "a fim de" as quais normalmente significam apenas um "para". Evite palavras potencialmente paternalistas tais como "basicamente". Evite termos latinos como "i.e." ou "cf.", os quais podem ser desconhecidos fora de grupos acadêmicos ou científicos.
ru: Делайте объяснения как можно короче, проще и понятнее. Избегайте пустых фраз вроде "для того чтобы", которые обычно можно заменить на "чтобы". Не используйте снисходительные слова вроде "по сути". Избегайте латинских терминов, таких как "i.e." или "cf.", которые могут быть непонятны за пределами академических или научных кругов.

source: Write in a formal style. Avoid addressing the reader as "you". For example, say "copy the file to [.filename]#/tmp#" rather than "you can copy the file to [.filename]#/tmp#".
pt_br: Escreva em um estilo formal. Evite dirigir-se ao leitor como "você". Por exemplo, digamos "copie o arquivo para /tmp" em vez de "você pode copiar o arquivo para /tmp".
ru: Следует писать в формальном стиле. Необходимо избегать прямого обращения к читателю. Например, следует использовать формулировку "скопировать файл в [.filename]#/tmp#", а не "вы можете скопировать файл в [.filename]#/tmp#".

source: Give clear, correct, _tested_ examples. A trivial example is better than no example. A good example is better yet. Do not give bad examples, identifiable by apologies or sentences like "but really it should never be done that way". Bad examples are worse than no examples. Give good examples, because _even when warned not to use the example as shown_, the reader will usually just use the example as shown.
pt_br: Dê exemplos claros, corretos, e _testados_. Um exemplo trivial é melhor do que nenhum exemplo. Um bom exemplo é ainda melhor. Não dê exemplos ruins, identificáveis por desculpas ou frases como "mas realmente isso nunca deve ser feito dessa forma". Exemplos ruins são piores que nenhum exemplo. Dê bons exemplos, porque _mesmo quando avisado para não usar o exemplo como mostrado_ , o leitor normalmente só usa o exemplo como mostrado.
ru: Приводите понятные, корректные и _проверенные_ примеры. Простой пример лучше, чем отсутствие примера. Хороший пример ещё лучше. Не приводите плохих примеров, которые можно распознать по извинениям или фразам вроде «но на самом деле так делать не стоит». Плохие примеры хуже, чем их отсутствие. Приводите хорошие примеры, потому что _даже если предупредить читателя, чтобы он не использовал пример в таком виде_, он всё равно, скорее всего, воспользуется им как есть.

source: Avoid _weasel words_ like "should", "might", "try", or "could". These words imply that the speaker is unsure of the facts, and create doubt in the reader.
pt_br: Evite palavras vazias como "deveria", "poderia", "tentaria", ou "podia". Estas palavras implicam que o autor não tem certeza dos fatos e cria dúvidas no leitor.
ru: Избегайте _неопределённых выражений_, таких как «должен», «может», «попытаться» или «смог бы». Эти слова создают впечатление, что автор не уверен в фактах, и вызывают сомнения у читателя.

source: Similarly, give instructions as imperative commands: not "you should do this", but merely "do this".
pt_br: Da mesma forma, dê instruções como comandos imperativos: não utilize "você deve fazer isso", mas apenas "faça isso".
ru: Аналогично, давайте инструкции в виде повелительных команд: не "вам следует сделать это", а просто "сделайте это".

source: Be Complete
pt_br: Seja completo
ru: Будьте полными

source: Do not make assumptions about the reader's abilities or skill level. Tell them what they need to know. Give links to other documents to provide background information without having to recreate it. Put yourself in the reader's place, anticipate the questions they will ask, and answer them.
pt_br: Não faça suposições sobre as habilidades do leitor. Diga-lhes o que precisam saber. Dê links para outros documentos para fornecer informações básicas sem precisar recriá-las. Coloque-se no lugar do leitor, antecipe as perguntas que eles farão e responda-os.
ru: Не делайте предположений о способностях или уровне навыков читателя. Сообщите им то, что им необходимо знать. Давайте ссылки на другие документы, чтобы предоставить справочную информацию без необходимости её повторного изложения. Поставьте себя на место читателя, предугадайте вопросы, которые у него возникнут, и ответьте на них.

source: Be Concise
pt_br: Seja conciso
ru: Будьте краткими

source: While features should be documented completely, sometimes there is so much information that the reader cannot easily find the specific detail needed. The balance between being complete and being concise is a challenge. One approach is to have an introduction, then a "quick start" section that describes the most common situation, followed by an in-depth reference section.
pt_br: Embora as funcionalidades devam ser documentadas completamente, às vezes existe tanta informação que o leitor não consegue encontrar facilmente os detalhes específicos de que necessita. O equilíbrio entre ser completo e ser conciso é um desafio. Uma abordagem é ter uma introdução e, em seguida, uma seção de "início rápido" que descreve a situação mais comum, seguida por uma seção de referência aprofundada.
ru: Хотя функции должны быть описаны полностью, иногда информации так много, что читателю сложно найти нужную деталь. Баланс между полнотой и лаконичностью — это непростая задача. Один из подходов — включить введение, затем раздел «быстрый старт» с описанием наиболее распространённого сценария, а после него — подробный справочный раздел.

source: Guidelines
pt_br: Diretrizes
ru: Рекомендации

source: To promote consistency between the myriad authors of the FreeBSD documentation, some guidelines have been drawn up for authors to follow.
pt_br: Para promover a consistência entre os inúmeros autores da documentação do FreeBSD, algumas diretrizes foram elaboradas para os autores seguirem.
ru: Для обеспечения единообразия среди множества авторов документации FreeBSD были разработаны рекомендации, которым следует придерживаться при написании.

source: Use American English Spelling
pt_br: Use a Ortografia do Inglês Americano
ru: Используйте американское написание английских слов

source: There are several variants of English, with different spellings for the same word. Where spellings differ, use the American English variant. "color", not "colour", "rationalize", not "rationalise", and so on.
pt_br: Existem várias variantes do Inglês, com grafias diferentes para a mesma palavra. Onde as grafias diferem, use a variante do Inglês Americano. "color", não "colour", "rationalize", não "rationalise", e assim por diante.
ru: Существует несколько вариантов английского языка с разным написанием одних и тех же слов. Если варианты написания отличаются, используйте американский английский. Например, «color», а не «colour», «rationalize», а не «rationalise», и так далее.

source: The use of British English may be accepted in the case of a contributed article, however the spelling must be consistent within the whole document. The other documents such as books, web site, manual pages, etc. must use American English.
pt_br: O uso do Inglês Britânico pode ser aceito no caso de um artigo contribuído, no entanto, a ortografia deve ser consistente em todo o documento. Os outros documentos, como livros, site, páginas de manual, etc, devem usar o Inglês Americano.
ru: Использование британского варианта английского языка может быть допустимо в случае предоставленной статьи, однако орфография должна быть единообразной во всем документе. Остальные документы, такие как книги, веб-сайты, справочные страницы и т. д., должны использовать американский вариант английского языка.

source: Do not use contractions
pt_br: Não use contrações
ru: Не используйте сокращения

source: Do not use contractions. Always spell the phrase out in full. "Don't use contractions" is wrong.
pt_br: Não use contrações. Sempre soletre a frase na íntegra. "Do not" é a forma correta, "Don't" é a errada.
ru: Не используйте сокращения. Всегда пишите фразу полностью. "Don't use contractions" является неправильным вариантом.

source: Avoiding contractions makes for a more formal tone, is more precise, and is slightly easier for translators.
pt_br: Evitar contrações contribui para um tom mais formal, é mais preciso e é um pouco mais fácil para os tradutores.
ru: Избегание сокращений способствует более формальному тону, повышает точность и немного облегчает работу переводчиков.

source: Use the serial comma
pt_br: Use a vírgula serial
ru: Используйте серийную запятую

source: In a list of items within a paragraph, separate each item from the others with a comma. Separate the last item from the others with a comma and the word "and".
pt_br: Em uma lista de itens dentro de um parágrafo, separe cada item dos outros com uma vírgula. Separe o último item dos outros com uma vírgula e a letra "e".
ru: В списке элементов внутри абзаца разделяйте каждый элемент запятой. Последний элемент отделяйте от остальных запятой и словом "and".

source: For example:
pt_br: Por exemplo:
ru: Например:

source: This is a list of one, two and three items.
pt_br: Esta é uma lista de um, dois e três itens.
ru: This is a list of one, two and three items (Вот список из одного, двух и трёх элементов).

source: Is this a list of three items, "one", "two", and "three", or a list of two items, "one" and "two and three"?
pt_br: Esta é uma lista de três itens, "um", "dois", e "três", ou uma lista de dois itens, "um" e "dois" e "três"?
ru: Это список из трех элементов: "one", "two" и "three" или список из двух элементов: "one" и "two and three"?

source: It is better to be explicit and include a serial comma:
pt_br: É melhor ser explícito e incluir uma vírgula serial:
ru: Лучше быть точным и включать серийную запятую:

source: This is a list of one, two, and three items.
pt_br: Esta é uma lista de um, dois, e três itens.
ru: This is a list of one, two, and three items (Вот список из одного, двух и трёх элементов).

source: Avoid redundant phrases
pt_br: Evite frases redundantes
ru: Избегайте избыточных фраз

source: Do not use redundant phrases. In particular, "the command", "the file", and "man command" are often redundant.
pt_br: Não use frases redundantes. Em particular, "the command", "the file", e "man command" são frequentemente redundantes.
ru: Избегайте избыточных фраз. В частности, "команда", "файл" и "man команда" часто избыточны.

source: For example, commands:
pt_br: Por exemplo, comandos:
ru: Например, команды:

source: Wrong: Use the `git` command to update sources.
pt_br: Errado: Use o comando `git` para atualizar o código fonte.
ru: Неверно: Используйте команду `git` для обновления исходного кода.

source: Right: Use `git` to update sources.
pt_br: Correto: Use o `git` para atualizar o código fonte.
ru: Правильно: Используйте `git` для обновления исходников.

source: Filenames:
pt_br: Nomes de arquivo:
ru: Имена файлов:

source: Wrong: ... in the filename [.filename]#/etc/rc.local#...
pt_br: Errado: ... no nome do arquivo [.filename]#/etc/rc.local#...
ru: Неверно: ... в имени файла [.filename]#/etc/rc.local#...

source: Right: ... in [.filename]#/etc/rc.local#...
pt_br: Correto: ... no [.filename]#/etc/rc.local#...
ru: Правильно: ... в [.filename]#/etc/rc.local#...

source: Manual page references (the second example uses `man:[]` with the man:csh[1] entity):
ru: Ссылки на страницы Справочника (во втором примере используется `man:[]` с сущностью man:csh[1]):

source: Wrong: See `man csh` for more information.
pt_br: Errado: veja `man csh` para mais informações.
ru: Неправильно: Дополнительную информацию смотрите в `man csh`.

source: Right: See man:csh[1].
pt_br: Certo: Veja man:csh[1].
ru: Правильно: См. man:csh[1].

source: For more information about writing style, see http://www.bartleby.com/141/[Elements of Style] by William Strunk.
pt_br: Para mais informações sobre o estilo de escrita, consulte http://www.bartleby.com/141/[Elements of Style] de William Strunk.
ru: Для получения дополнительной информации о стиле написания текстов см. http://www.bartleby.com/141/[«Элементы стиля»] Уильяма Странка.

source: Style Guide
pt_br: Guia de estilo
ru: Руководство по стилю

source: To keep the source for the documentation consistent when many different people are editing it, please follow these style conventions.
pt_br: Para manter o código fonte da documentação consistente quando muitas pessoas diferentes a estiverem editando, siga estas convenções de estilo.
ru: Чтобы сохранить единообразие исходного кода документации при редактировании множеством разных людей, пожалуйста, следуйте этим стилевым соглашениям.

source: One sentence per line
pt_br: Uma frase por linha
ru: Одно предложение на строку

source: Use Semantic Line Breaks in the documentation, a technique called "one sentence per line". The idea of this technique is to help the users to write and read documentation. To get more information about this technique read the link:https://sembr.org/[Semantic Line Breaks] page.
pt_br: Use quebras de linha semântica na documentação, uma técnica chamada "uma frase por linha". A ideia dessa técnica é ajudar os usuários a escrever e ler a documentação. Para obter mais informações sobre essa técnica, leia a página link:https://sembr.org/[Semantic Line Breaks].
ru: Используйте семантические разрывы строк в документации, метод, называемый "одно предложение на строку". Идея этого метода заключается в том, чтобы помочь пользователям писать и читать документацию. Для получения дополнительной информации об этом методе прочитайте страницу https://sembr.org/[Semantic Line Breaks].

source: This is an example which does not use "one sentence per line".
pt_br: Este é um exemplo que não usa "uma frase por linha".
ru: Это пример, который не использует "одно предложение на строку".

source: And this is an example which uses the technique.
pt_br: E este é um exemplo que usa a técnica.
ru: И вот пример, использующий этот метод.

source: Acronyms
pt_br: Siglas
ru: Аббревиатуры

source: Acronyms should be defined the first time they appear in a document, as in: "Network Time Protocol (NTP)". After the acronym has been defined, use the acronym alone unless it makes more sense contextually to use the whole term. Acronyms are usually defined only once per chapter or per document.
pt_br: As siglas devem ser definidas na primeira vez que aparecerem em um documento, como em: "Network Time Protocol (NTP)". Depois que o acrônimo tiver sido definido, use apenas a sigla, a menos que faça mais sentido contextualmente usar todo o termo. Siglas geralmente são definidos apenas uma vez por capítulo ou por documento.
ru: Акроним должен быть определён при первом упоминании в документе, например: «Network Time Protocol (NTP)». После того как акроним определён, используйте только акроним, если контекст не требует полного термина. Обычно акроним определяется один раз в главе или документе.

source: All acronyms should be enclosed using the ` character.
pt_br: Todas as siglas devem ser incluídas com o caractere `.
ru: Все аббревиатуры должны быть заключены в символ `.

source: Special Character List
pt_br: Lista de Caracteres Especiais
ru: Список специальных символов

source: This list of special characters shows the correct syntax and the output when used in FreeBSD documentation. If a character is not on this list, ask about it on the {freebsd-doc}.
pt_br: Esta lista de caracteres especiais mostra a sintaxe correta e a saída quando usada na documentação do FreeBSD. Se um caractere não está nesta lista, pergunte sobre ele na {freebsd-doc}.
ru: Этот список специальных символов показывает правильный синтаксис и результат их использования в документации FreeBSD. Если нужного символа нет в списке, задайте вопрос на {freebsd-doc}.

source: Name
pt_br: Nome
ru: Имя

source: Syntax
pt_br: Sintaxe
ru: Синтаксис

source: Rendered
pt_br: Renderizado
ru: Выводится

source: Copyright
ru: Авторское право (copyright)

source: (C)
ru: (С)

source: Registered
pt_br: Registrado
ru: Зарегистрировано

source: Trademark
pt_br: Marca Comercial
ru: Товарный знак

source: Em dash
pt_br: Travessão
ru: Тире

source: Ellipses
pt_br: Elipses
ru: Многоточия

source: Single right arrow
pt_br: Seta simples para a direita
ru: Одиночная стрелка вправо

source: Double right arrow
pt_br: Seta dupla para a direita
ru: Двойная правая стрелка

source: Single left arrow
pt_br: Seta simples para a esquerda
ru: Одиночная стрелка влево

source: Double left arrow
pt_br: Seta dupla para a esquerda
ru: Двойная левая стрелка

source: Linting with Vale
pt_br: Linting com Vale
ru: Проверка стиля с помощью Vale

source: To maintain clarity and consistency across all documentation and website pages, link:https://vale.sh[Vale] styles have been introduced in the documentation tree. link:https://vale.sh[Vale] is a powerful linter for writing customized rules and can be used in multiple scenarios. Currently link:https://vale.sh[Vale] can be used as a command line tool, for CI/CD pipelines, and integrated into an editor of choice.
pt_br: Para manter clareza e consistência em toda a documentação e páginas do site, estilos link:https://vale.sh[Vale] foram introduzidos na árvore de documentação. link:https://vale.sh[Vale] é um linter poderoso para escrever regras personalizadas e pode ser usado em vários cenários. Atualmente o link:https://vale.sh[Vale] pode ser usado como uma ferramenta de linha de comando, para pipelines de CI/CD e integrado a um editor de texto de sua escolha.
ru: Для обеспечения ясности и единообразия во всей документации и на страницах веб-сайта в дерево документации были добавлены стили link:https://vale.sh[Vale]. link:https://vale.sh[Vale] — это мощный линтер для создания пользовательских правил написания текста, который можно использовать в различных сценариях. В настоящее время link:https://vale.sh[Vale] можно применять как инструмент командной строки, в CI/CD-процессах и интегрировать в предпочитаемый редактор.

source: The following table describes the current rule names and their respective severity.
pt_br: A tabela a seguir descreve os nomes das regras atuais e as suas respectivas severidade.
ru: Следующая таблица описывает текущие названия правил и их соответствующую степень серьёзности.

source: Severity
pt_br: Severidade
ru: Степень серьезности

source: error
pt_br: erro
ru: ошибка

source: suggestion
pt_br: sugestão
ru: предложение

source: Current Vale Rules
pt_br: Regras Atuais do Vale
ru: Текущие правила Vale

source: FreeBSD.BrandTerms: According to the copyright rules of The FreeBSD Foundation, *freebsd* should be written as *FreeBSD*. Similarly, every major vendor and company has specific rules on writing their brand names and trademarks. Care should be taken to be respectful to the brand value of others and to take time to write PostgreSQL, Node.js, Let's Encrypt etc. Missing brand names should be added to the [.filename]#.vale/styles/FreeBSD/BrandTerms.yml# in the `doc` repository.
pt_br: FreeBSD.BrandTerms: De acordo com as regras de direitos autorais da Fundação FreeBSD, *freebsd* deve ser escrito como *FreeBSD*. Da mesma forma, todos os principais fornecedores e empresas têm regras específicas sobre como escrever seus nomes de marcas e marcas registradas. Deve-se tomar cuidado para respeitar o valor da marca de outras pessoas e reservar um tempo para escrever PostgreSQL, Node.js, Let's Encrypt, etc. Nomes de marcas ausentes devem ser adicionados ao [.filename]#.vale/styles/FreeBSD/BrandTerms.yml# no repositório `doc`.
ru: FreeBSD.BrandTerms: В соответствии с правилами авторского права The FreeBSD Foundation, *freebsd* следует писать как *FreeBSD*. Аналогично, у каждого крупного поставщика и компании есть свои правила написания их торговых марок и брендов. Следует проявлять уважение к брендам других и уделять время правильному написанию PostgreSQL, Node.js, Let's Encrypt и т. д. Отсутствующие названия брендов следует добавлять в файл [.filename]#.vale/styles/FreeBSD/BrandTerms.yml# в репозитории `doc`.

source: FreeBSD.ConsciousLanguage: This rule proposes use of conscious language so that sensitive words pointing to the color, age, race, or sexual orientation of people are avoided where possible.
pt_br: FreeBSD.ConsciousLanguage: Esta regra propõe o uso de linguagem consciente para que palavras sensíveis apontando para a cor, idade, raça ou orientação sexual das pessoas sejam evitadas sempre que possível.
ru: FreeBSD.ConsciousLanguage: Это правило предлагает использовать осознанный язык, чтобы по возможности избегать чувствительных слов, указывающих на цвет кожи, возраст, расу или сексуальную ориентацию людей.
