Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/writing-style/_index.po
Languages: pt_br, ru

source: FreeBSD.Contractions: Contracted words should not be used. This rule avoids all contractions and suggests full words.
pt_br: FreeBSD.Contractions: Palavras contraídas não devem ser usadas. Esta regra evita todas as contrações e sugere palavras completas.
ru: FreeBSD.Сокращения: Не следует использовать сокращенные слова. Это правило исключает все сокращения и рекомендует использовать полные слова.

source: FreeBSD.EOLSpacing: In most of the documents EOL spacing is present which is not the desirable situation.
pt_br: FreeBSD.EOLSpacing: Na maioria dos documentos, espaços presentes no fim da linha (EOL) não são desejáveis.
ru: FreeBSD.EOLSpacing: В большинстве документов присутствуют пробелы в конце строк, что не является желательной ситуацией.

source: FreeBSD.Hang: `Hang` is often used to mean that the application has stopped responding. This rule proposes better wording.
pt_br: FreeBSD.Hang: `Hang` é frequentemente usado para significar de que o aplicativo parou de responder. Esta norma propõe melhor redação.
ru: FreeBSD.Hang: Термин `Hang` часто используется для обозначения ситуации, когда приложение перестает отвечать. Это правило предлагает более подходящую формулировку.

source: FreeBSD.Hyphens: Often adverbs ending with 'ly' are added with a hyphen which is wrong.
pt_br: FreeBSD.Hyphens: Muitas vezes advérbios que terminam com 'ly' são adicionados com um hífen, o que está errado.
ru: FreeBSD.Дефисы: Часто наречия, оканчивающиеся на 'ly', добавляются с дефисом, что является ошибкой.

source: FreeBSD.Spacing: Often double spaces are hard to catch with the naked eye and this is addressed here.
pt_br: FreeBSD.Spacing: Muitas vezes, os espaços duplos são difíceis de captar a olho nu e isso é abordado aqui.
ru: FreeBSD.Расстояние: Часто двойные пробелы трудно заметить невооруженным глазом, и здесь это решается.

source: FreeBSD.SuperfluousOptArgInLinks: Suggest to empty square brackets in `link:` macros when the displayed text coincides with the URL.
pt_br: FreeBSD.SuperfluousOptArgInLinks: Sugere colchetes vazios nas macros `link:` quando o texto exibido coincide com a URL.
ru: FreeBSD.SuperfluousOptArgInLinks: Рекомендуется оставлять квадратные скобки пустыми в макросах `link:`, если отображаемый текст совпадает с URL.

source: Vale.Avoid: Enforces the *DO NOT USE* vocabulary terms for The FreeBSD Project. If any word is found that should not be in the documentation, the word should be added to [.filename]#.vale/styles/Vocab/Terms/reject.txt# in the `doc` repository. The list is empty at the moment.
pt_br: Vale.Avoid: Impõe os termos de vocabulário *NÃO USE* para o Projeto FreeBSD. Se for encontrada alguma palavra que não deva estar na documentação, a palavra deve ser adicionada a [.filename]#.vale/styles/Vocab/Terms/reject.txt# no repositório `doc`. A lista está vazia no momento.
ru: Vale.Avoid: Запрещает использование терминов из списка *НЕ ИСПОЛЬЗОВАТЬ* в документации The FreeBSD Project. Если обнаружено слово, которое не должно присутствовать в документации, его следует добавить в файл [.filename]#.vale/styles/Vocab/Terms/reject.txt# в репозитории `doc`. На данный момент список пуст.

source: Vale.Repetition: Same words are often typed twice when leaving the keyboard and rejoining the work again. This rule finds repeated words and warns the users.
pt_br: Vale.Repetition: Muitas vezes, as mesmas palavras são digitadas duas vezes ao sair do teclado e voltar ao trabalho novamente. Esta regra encontra palavras repetidas e avisa os usuários.
ru: Vale.Repetition: Одни и те же слова часто набираются дважды при отходе от клавиатуры и возвращении к работе. Это правило находит повторяющиеся слова и предупреждает пользователей.

source: Vale.Spelling: At the moment there is a mix of en_US and en_GB spellings in the documentation and website. Vale comes with an in built dictionary from which uses strictly en_US and do not accept the en_GB variant of any words.
pt_br: Vale.Spelling: No momento, há uma mistura de grafias en_US e en_GB na documentação e no site. Vale vem com um dicionário embutido do qual usa estritamente en_US e não aceita a variante en_GB de nenhuma palavra.
ru: Vale.Spelling: В настоящее время в документации и на веб-сайте используется смесь написания en_US и en_GB. Vale поставляется со встроенным словарем, который использует строго en_US и не принимает варианты написания en_GB для любых слов.

source: Vale.Terms: Enforces the *PREFERRED* vocabulary terms for The FreeBSD Project. At the moment the list of terms is empty and the FreeBSD specific terms will be added gradually. If any word is found to be correct and not available in the dictionary the word should be added to the [.filename]#.vale/styles/Vocab/Terms/accept.txt# in the `doc` repository.
pt_br: Vale.Terms: Aplica os termos de vocabulário *PREFERIDO* para o Projeto FreeBSD. No momento, a lista de termos está vazia e os termos específicos do FreeBSD serão adicionados gradualmente. Se alguma palavra estiver correta e não disponível no dicionário, a palavra deve ser adicionada ao [.filename]#.vale/styles/Vocab/Terms/accept.txt# no repositório `doc`.
ru: Vale.Terms: Обеспечивает соблюдение *ПРЕДПОЧТИТЕЛЬНЫХ* терминов для проекта FreeBSD. В настоящее время список терминов пуст, и специфичные для FreeBSD термины будут добавляться постепенно. Если какое-либо слово считается правильным, но отсутствует в словаре, его следует добавить в файл [.filename]#.vale/styles/Vocab/Terms/accept.txt# в репозитории `doc`.

source: More rules will be introduced in the upcoming days when and where required.
pt_br: Mais regras serão introduzidas nos próximos dias, quando e onde for necessário.
ru: Дополнительные правила будут введены в будущем по мере необходимости.

source: Using Vale
pt_br: Utilizando o Vale
ru: Использование Vale

source: link:https://vale.sh[Vale] can be used from the command line and from within an editor or IDE. package:textproc/vale[] can be installed as following:
pt_br: O link:https://vale.sh[Vale] pode ser usado em linha de comando e em um editor de texto ou IDE. package:textproc/vale[] pode ser instalado da seguinte forma:
ru: link:https://vale.sh[Vale] можно использовать из командной строки, а также из редактора или IDE. Установить package:textproc/vale[] можно следующим образом:

source: Using Vale on the command line
pt_br: Usando o Vale na linha de comando
ru: Использование Vale в командной строке

source: Assuming that the `doc` repository was cloned into [.filename]#~/doc# the following commands are required to run:
pt_br: Assumindo que o repositório `doc` foi clonado em [.filename]#~/doc# os seguintes comandos são necessários para executar:
ru: Предполагая, что репозиторий `doc` был склонирован в [.filename]#~/doc#, для запуска потребуются следующие команды:

source: link:https://vale.sh[Vale] is a CPU and memory intensive program due to the nature of the application and can take a while to show any output on the screen. A better way to run the application is on specific folders or files rather than the entire `doc` repository as that is already done in the CI pipeline.
pt_br: O link:https://vale.sh[Vale] é um programa intensivo de CPU e memória devido à natureza do aplicativo e pode demorar um pouco para mostrar qualquer saída na tela. Uma melhor maneira de executar o aplicativo é em diretórios ou arquivos específicos, em vez de todo o repositório `doc`, pois isso já é feito na pipeline de CI.
ru: link:https://vale.sh[Vale] — это программа с высокой нагрузкой на процессор и память из-за специфики приложения, и она может долго не выводить результаты на экран. Лучше запускать её для конкретных папок или файлов, а не для всего репозитория `doc`, так как это уже выполняется в CI-пайплайне.

source: Using Vale in editors
pt_br: Usando Vale em editores
ru: Использование Vale в редакторах

source: link:https://vale.sh[Vale] works with major mainstream editors like package:editors/vim[], package:editors/emacs[], package:editors/vscode[]. At the moment the necessary configuration for package:editors/vim[] is described in crossref:editor-config[editor-config-vim, Vim]. A configuration for package:editors/emacs[] is being worked on.
pt_br: O link:https://vale.sh[Vale] funciona com os principais editores tradicionais como o package:editors/vim[], package:editors/emacs[], package:editors/vscode[]. No momento a configuração necessária para o package:editors/vim[] estão descritas em rossref:editor-config[editor-config-vim, Vim]. As configuração para o package:editors/emacs[] está sendo desenvolvida.
ru: link:https://vale.sh[Vale] работает с основными популярными редакторами, такими как package:editors/vim[], package:editors/emacs[], package:editors/vscode[]. В настоящее время необходимая конфигурация для package:editors/vim[] описана в crossref:editor-config[editor-config-vim, Vim]. Конфигурация для package:editors/emacs[] находится в разработке.

source: Manual page references (the second example uses `citerefentry` with the man:csh[1] entity):
pt_br: Referências de páginas de manual (o segundo exemplo usa `citerefentry` com a entidade man:csh[1]):

source: warning
pt_br: aviso
