<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/projects/newbies.sgml,v 1.3 2004/01/08 00:26:46 stephane Exp $">
<!ENTITY title 'Ressources pour les d&eacute;butants'>
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
   The FreeBSD French Documentation Project
   Original revision: 1.28
   
   Version francaise : Luc Vo Van
   Version francaise (mise a jour) : Nicolas Lecapitaine <Nicolas.Lecapitaine@chirec.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
    &header;

    <p>Les sources d'informations suivantes sont les plus pris&eacute;es par
       les nouveaux utilisateurs de FreeBSD. N'h&eacute;sitez pas &agrave; nous
       envoyez toute correction ou addition &agrave;
       <a href="mailto:freebsd-newbies@FreeBSD.org">FreeBSD-Newbies@FreeBSD.org</a>.</p>

    <ul>
      <li><a href="#web-site">Utiliser le site web FreeBSD</a></li>
      <li><a href="#fbsd">En savoir plus sur FreeBSD</a></li>
      <li><a href="#unix">En savoir plus sur UNIX</a></li>
      <li><a href="#xwin">En savoir plus sur le syst&egrave;me X Window</a></li>
      <li><a href="#people">Aider d'autres personnes</a></li>
    </ul>


    <h2><a name="web-site">Utiliser le site web FreeBSD</a></h2>

    <p>Ce site comporte les derni&egrave;res nouveaut&eacute;s et les plus r&eacute;centes
       informations au sujet de FreeBSD. Les pages suivantes ont aid&eacute; de
       nombreux nouveaux utilisateurs :
  </p>

    <ul>
      <li><p><a href="../search/search.html">Chercher</a> dans le
          Manuel de r&eacute;f&eacute;rence et la FAQ, dans tout le site, ou encore dans les
          archives de la liste FreeBSD-Questions</p>

      <li><p>La page des <a href="../docs.html">Documentations</a>
          poss&egrave;de des liens vers le Manuel de r&eacute;f&eacute;rence, la FAQ, les guides, des
          informations pour contribuer au Projet de Documentation,
     	  de nombreux documents non-anglophones, et bien plus encore.
          </p></li>

      <li><p>La page <a href="../support.html">Support</a>
          comporte de nombreuses informations sur FreeBSD, dont les
          listes de diffusion, les groupes d'utilisateurs, les sites web et FTP,
          les informations sur les versions de FreeBSD et des liens vers d'autres
          ressources UNIX.</p></li>
    </ul>

    <h2><a name="fbsd">En savoir plus sur FreeBSD</a></H2>

    <ul>
      <li><p>Si vous ne l'avez pas encore install&eacute;, jetez un oeil sur la
          <a href="&u.rel.announce;">derni&egrave;re distribution majeure.</a>.
          (Voir le Manuel de r&eacute;f&eacute;rence pour savoir pourquoi il ne faut <strong>PAS</strong>
          &ecirc;tre tent&eacute; par une autre version). Avant de commencer, lisez avec attention les
          <a href="&enbase;/doc/&url.doc.langcode;/books/handbook/install.html">instructions d'installation</a>,
          ainsi que chaque fichier .TXT du r&eacute;pertoire FTP ou du CD d'installation.
          Ces fichiers sont l&agrave; car ils contiennent des
          informations dont vous aurez besoin t&ocirc;t ou tard. Prenez &eacute;galement le dernier
          <a href="../releases/index.html">fichier errata</a> &agrave; partir
          du site web, au cas o&ugrave; il aurait &eacute;t&eacute; mis &agrave; jour.</p>

         <p>Si vous d&eacute;cidez de t&eacute;l&eacute;charger FreeBSD, v&eacute;rifiez en
          premier lieu si ces
          <a href="http://www.lemis.com/what-to-download.html">
          instructions pour le t&eacute;l&eacute;chargement</a> qui concerne une ancienne version
          sont toujours disponibles. Cela clarifiera et simplifiera certainement la t&acirc;che.</p></li>

      <li><p>Un grand nombre de <a href="../docs.html#articles">guides</a> sont 
          disponibles. Celui d&eacute;nomm&eacute; 
          <a href="http://andrsn.stanford.edu/FreeBSD/">Guide 
          pour les nouveaux utilisateurs de FreeBSD et d'Unix</a> est tr&egrave;s populaire chez 
          les d&eacute;butants. Tr&egrave;s peu d'acquis sont n&eacute;cessaires &agrave; la lecture
	       de ce guide. Il peut aussi &ecirc;tre t&eacute;l&eacute;charg&eacute; en format <a
	    href="ftp://andrsn.stanford.edu/pub/">postscript ou RTF</a>
	  pour l'impression.</p></li>

      <li><p>La premi&egrave;re chose dont la plupart des gens ont besoin est le ppp, et les documentations
          &agrave; ce sujet ne manquent pas. Vous pouvez commencer par les
          sections du
          <a href="&enbase;/doc/&url.doc.langcode;/books/handbook/index.html">Manuel de R&eacute;f&eacute;rence</a>
          qui correspondent le plus &agrave; vos besoins, et explorer la
          <a href="http://www.awfulhak.org/ppp.html">page ppp</a>
          pour avoir des liens vers de nombreuses informations et les derni&egrave;res mises &agrave; jour.</p></li>

      <li><p><a name="cfbsd" href="http://www.freebsdmall.com/cgi-bin/fm/bsdcomp">The
	    Complete FreeBSD</a> par Greg Lehey, publi&eacute; par BSDi.
	  Ce livre n&eacute;cessite quelques connaissances de bases &agrave;
          propos d'UNIX et guide le nouvel utilisateur pas-&agrave;-pas depuis
          l'installation de FreeBSD jusqu'&agrave; sa configuration et sa mise en fonction. Vous
          comprendrez aussi ce que vous faites et pourquoi.</p></li>

      <li><p>Le <a href="&enbase;/doc/&url.doc.langcode;/books/handbook/index.html">Manuel de r&eacute;f&eacute;rence FreeBSD</a> et <a
	    href="&enbase;/doc/&url.doc.langcode;/books/faq/index.html">la Foire Aux Questions (FAQ)</a>
            sont les documents principaux de FreeBSD.
            Ce sont des documents essentiels, ils
            contiennent beaucoup d'informations pour les d&eacute;butants 
            mais aussi de nombreuses informations plus avanc&eacute;es.
            Ne vous inqui&eacute;tez pas si vous ne comprenez
            pas les section avanc&eacute;es. Le Manuel de r&eacute;f&eacute;rence
            contient les instructions d'installation et fourni &eacute;galement une
            liste de livres et de ressources en ligne. La FAQ poss&egrave;de
            une section d&eacute;di&eacute;e &agrave; la r&eacute;solution des probl&egrave;mes les
            plus courants.</p></li>

      <li><p>Rejoignez la liste de diffusion FreeBSD-Questions pour avoir les
          r&eacute;ponses aux questions que vous n'osiez pas poser. Inscrivez vous
          en envoyant un courrier &eacute;lectronique &agrave; <a href="mailto:majordomo@FreeBSD.org">
          majordomo@FreeBSD.org</a> avec "subscribe freebsd-questions"
          dans le corps du message (le sujet n'a pas d'importance).
          Vous pouvez regarder les anciennes question et leurs r&eacute;ponses
          via la page de <a href="../search/search.html#mailinglists">recherche</a>.
	  </p></li>

      <li><p>Le forum de discussion principal de FreeBSD est <a
	    href="news:comp.unix.bsd.freebsd.misc">comp.unix.bsd.freebsd.misc</a>.
            Il est &eacute;galement int&eacute;ressant de consulter r&eacute;guli&egrave;rement
            <a href="news:comp.unix.bsd.freebsd.announce">comp.unix.bsd.freebsd.announce</a>
            .</p></li>

      <li><p>Les <strong>pages de manuel</strong> sont de bonnes r&eacute;f&eacute;rences
          mais ne sont pas toujours la meilleure solution pour les d&eacute;butants.
	  Plus vous utiliserez les pages de manuel, plus elles vous
          sembleront famili&egrave;res, c'est une question d'habitude.
          Certaines conviennent parfaitement au d&eacute;butants, jetez-y
          donc un oeil &agrave; l'occasion.. Les pages de manuel ppp, par exemple,
          ressemblent &agrave; un guide.</p></li>
    </ul>

    <h2><a name="unix">En savoir plus sur UNIX</a></h2>

    <p>Beaucoup des probl&egrave;mes rencontr&eacute;s lorsqu'on est d&eacute;butant
       proviennent du fait que l'on est pas forc&eacute;ment familiaris&eacute; avec
       les commandes UNIX. Sans une pr&eacute;c&eacute;dente exp&eacute;rience UNIX,
       vous aurez la sensation de devoir apprendre deux choses &agrave; la
       fois. Heureusement, de nombreuses ressources sont disponibles
       pour vous aider.</p>

    <ul>
      <li><p>De nombreux livres, tels que les guides "Pour
             les nuls", vous seront d'une grande aide, et sont
          disponibles dans toutes les librairies. Si vous voulez
          quelque chose de vraiment facile, regardez ce qui est 
          disponible et prenez simplement le livre
          qui vous convient le mieux. Dans peu de temps vous voudrez
          certainement un autre livre plus avanc&eacute; afin d'en savoir plus.</p></li>

      <li><p>Un livre recommand&eacute; par de nombreux d&eacute;butants est <a
          name="ufti"> <em>UNIX for the Impatient</em></a> par Paul
          W. Abrahams et Bruce R. Larson, publi&eacute; chez Addison-Wesley.
          Il a pour but d'initier &agrave; l'utilisation d'UNIX, mais peut
          &eacute;galement servir de r&eacute;f&eacute;rence. Il comprend une introduction
          aux concepts fondamentaux d'UNIX et un chapitre tr&egrave;s pratique sur
          l'utilisation du syst&egrave;me X Window</p></li>

      <li><p>Un autre ouvrage populaire est <em>UNIX Power Tools</em> par Jerry Peek,
	  Tim O'Reilly et Mike Loukides, publi&eacute; par O'Reilly et
	  Associ&eacute;s. Il est organis&eacute; en petits articles, chacun
          traitant d'un probl&egrave;me sp&eacute;cifique. Ces articles se r&eacute;f&egrave;rent
          les uns aux autres, couvrant ainsi tr&egrave;s largement chacun des
          sujets. Ce livre ne vise pas particuli&egrave;rement les d&eacute;butants, mais la
          fa&ccedil;on dont il a &eacute;t&eacute; &eacute;crit permet aux d&eacute;butants de trouver tr&egrave;s
          rapidement r&eacute;ponses &agrave; leurs questions. Les &eacute;l&eacute;ments fondamentaux
          d'UNIX sont surtout d&eacute;crits en d&eacute;but d'ouvrage, mais de nombreux
          articles faciles d'acc&egrave;s sont disponibles dans tout le livre.</p></li>

      <li><p>L'<a
	    href="http://www-wks.acs.ohio-state.edu/unix_course/unix.html">UNIX Introductory Course</a>
           de l'Universit&eacute; de l'&eacute;tat d'Ohio est disponible en ligne. Les
           formats disponibles pour sa lecture sont le HTML, le postscript et l'Acrobat PDF.</p></li>

      <li><p><a href="http://www.mcsr.olemiss.edu/unixhelp/">UNIXhelp
	    for Users</a> est un autre guide en ligne pour les
            d&eacute;butants et est disponible en HTML sur de nombreux sites ou peut
            m&ecirc;me &ecirc;tre install&eacute; en local sur votre propre machine.</p></li>

      <li><p>Toutes les questions concernant UNIX peuvent &ecirc;tre pos&eacute;es sur le forum de discussion <a
	    href="news:comp.unix.questions">comp.unix.questions</a>. Voir aussi cette
	  <a
	  href="http://www.cis.ohio-state.edu/hypertext/faq/usenet/unix-faq/faq/top.html">
          Foire Aux Questions</a>. Vous pouvez &eacute;galement vous procurer une copie
          de la <a href="ftp://rtfm.mit.edu/pub/usenet/news.answers/unix-faq/faq/">FAQ</a>
          &agrave; partir du site FTP RMIT. Les d&eacute;butants trouveront
          certainement les sections 1 et 2 des plus int&eacute;ressantes.</p></li>

      <li><p>Un autre forum de discussion int&eacute;ressant est <a
	    href="news:comp.unix.user-friendly">comp.unix.user-friendly</a>
	  qui poss&egrave;de &eacute;galement sa propre  <a
	    href="http://www.camelcity.com/~noel/usenet/cuuf-FAQ.htm">FAQ</a>.
	  M&ecirc;me si ce forum discute essentiellement de la facilit&eacute;
	  d'acc&egrave;s et de l'ergonomie sous UNIX, les d&eacute;butants trouveront
	  &eacute;galement r&eacute;ponses &agrave; de nombreuses questions. La <a
	    href="ftp://rtfm.mit.edu/pub/usenet/news.answers/unix-faq/user-friendly">FAQ</a>
	  est aussi disponible via FTP.</p></li>

      <li><p>De nombreux autres sites web poss&egrave;dent des guides &agrave; propos d'UNIX
      	ainsi que de multiples documents de r&eacute;ference. Un des meilleurs
	endroits pour commencer votre recherche est la page UNIX
	sur <a
	    href="http://www.yahoo.com/Computers_and_Internet/Software/Operating_Systems/Unix/">Yahoo!</a>.</p></li>

    </ul>

    <h2><a name="xwin">En savoir plus sur le syst&egrave;me X Window</a></h2>

    <p>Le syst&egrave;me X Window est utilis&eacute; par plusieurs syst&egrave;mes
	d'exploitation, dont FreeBSD. La documentation sur X peut &ecirc;tre
	trouv&eacute;e sur <a href="http://www.xfree86.org/">The XFree86 Project, Inc.</a>.
      Attention tout de m&ecirc;me, cette documentation est surtout compos&eacute;e
      de documents de r&eacute;f&eacute;rence assez difficiles &agrave; comprendre pour un d&eacute;butant.</p>

    <ul>
    <li><p>Pour les informations de base li&eacute;es &agrave; l'installation,
      la configuration et l'utilisation du syst&egrave;me X Window, trois des livres
      mentionn&eacute;s plus haut comportent des sections d&eacute;di&eacute;es &agrave; X :
      <a href="&enbase;/doc/&url.doc.langcode;/books/handbook/index.html">The FreeBSD Handbook</a>,
      <a href="#cfbsd">The Complete FreeBSD</a> et
      <a href="#ufti">UNIX for the Impatient</a>.</p></li>

    <li><p>Une section sur l'utilisation du Syst&egrave;me X Window du
      <a href="ftp://sunsite.unc.edu/pub/Linux/docs/LDP/users-guide">Users' Guide</a>
      de Linux pourra s'av&eacute;rer int&eacute;ressante et tr&egrave;s informative pour le n&eacute;ophyte.
      Ce document contient de nombreuses autres informations int&eacute;ressantes,
      cependant, rappelez-vous que Linux ne fonctionne pas toujours exactement
      de la m&ecirc;me fa&ccedil;on que FreeBSD.</p></li>

    <li><p>Avant de personaliser votre environement X, vous devrez choisir un
      gestionnaire de fen&ecirc;tre (window manager).
      Visitez la page <a href="http://www.PLiG.org/xwinman/">Window Managers for X</a>
      et suivez le lien vers l'introduction pour en savoir plus sur
      les gestionnaires de fen&ecirc;tre, puis revenez &agrave; la page d'accueil pour
      lire les concepts fondamentaux ("The Basics"). Vous pourrez ainsi
      comparer les diff&eacute;rents types de gestionnaires disponibles (vous
      trouverez &eacute;galement un autre guide pour les nouveaux utilisateurs d'UNIX)
      La plupart de ces gestionnaires de fen&ecirc;tre (si ce n'est tous)
      peuvent &ecirc;tre install&eacute;s &agrave; partir des ports FreeBSD.</p></li>
    </ul>

    <h2><a name="people">Aider d'autres personnes</a></h2>

    <p>Chacun peut faire quelque chose pour la communaut&eacute;
     FreeBSD, m&ecirc;me les nouveaux utilisateurs! Certains travaillent avec
     le nouveau groupe "d'&eacute;vang&eacute;lisation" et d'autres sont impliqu&eacute;s dans le
     <a href="../docproj/docproj.html">Projet de Documentation</a> en
     tant que correcteurs. D'autres d&eacute;butants peuvent avoir des comp&eacute;tences particuli&egrave;res
     ou une exp&eacute;rience &agrave; partager, que ce soit dans le domaine de l'informatique
     ou non ou, tout simplement, peuvent accueillir d'autres nouveaux utilisateurs.
     Il y a toujours des gens pr&ecirc;ts &agrave; vous
     aider, tout simplement parce qu'ils aiment rendre service ! Ecrivez &agrave;
     <a href="mailto:freebsd-newbies@FreeBSD.org">FreeBSD Newbies</a>
     pour en savoir plus.</p>

    <p>Les amis qui utilisent FreeBSD sont une grande source d'information. Aucun livre ne
       remplacera une discussion amicale au t&eacute;l&eacute;phone ou autour d'une bonne
       pizza avec quelqu'un qui a les m&ecirc;mes centres d'int&eacute;r&ecirc;ts et qui fait face aux m&ecirc;mes
       probl&egrave;mes. Si vous n'avez pas beaucoup d'amis qui utilisent FreeBSD,
       pensez &agrave; utiliser vos vieux CD FreeBSD pour vous en faire d'autres :-)</p>

    <p><a href="../support.html#user">Les groupes d'utilisateurs</a> sont
      des endroits privil&eacute;gi&eacute;s pour rencontrer d'autres utilisateurs
      de FreeBSD. Si aucun groupe n'existe d&eacute;j&agrave; pr&egrave;s de chez vous, pourquoi
      ne pas en cr&eacute;er un ?</p>

    <p>Avant de parler &agrave; d'autres personnes de vos nouveaux talents,
      vous devriez jeter un coup d'oeil sur le <a
      href="http://manuel.brad.ac.uk/help/.faq/.unix/.pronun.html">Pronunciation Guide</a>
      (Guide de la Prononciation) et sur le <a
      href="http://www.wins.uva.nl/~mes/jargon/">Jargon File</a> :-)</p>

    <p>Disponibles en ligne :
      <a href="http://www.welearn.com.au/freebsd/newbies/">FreeBSD-Newbies</a>,
      une liste de diffusion traitant de sujets non techniques pouvant
      int&eacute;resser les d&eacute;butants. Un autre liste de diffusion,
      <a href="mailto:questions@FreeBSD.org">FreeBSD-Questions</a>,
      r&eacute;pondra &agrave; toutes vos questions concernant FreeBSD.</p>

      &footer;
  </body>
</html>
