<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/projects/projects.sgml,v 1.2 2004/01/06 17:31:43 stephane Exp $">
<!ENTITY title "Projets de d&eacute;veloppement FreeBSD">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.112

  Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
&header;

<a name="development"></a>

<p>En plus du d&eacute;veloppement principal de FreeBSD, un certain nombre
de groupes de d&eacute;veloppeurs travaillent en parall&egrave;le pour &eacute;largir
le champ des applications FreeBSD vers de nouvelles directions. Suivez les liens
ci-dessous pour en apprendre plus sur ces projets passionnants.</p>

Si vous remarquez qu'un projet est manquant, veuillez envoyer l'URL ainsi qu'une courte
description (3 &agrave; 10 lignes) &agrave; <A HREF="../mailto.html">www@FreeBSD.ORG</A>

<p>De plus, certains de ces projets envoient r&eacute;guli&egrave;rement un compte rendu sur le statut
du d&eacute;veloppement. Ils peuvent &ecirc;tre consult&eacute;s sur <a href="../news/status/status.html">la
page des compte-rendus</a>.</p>

<ul>
  <li><a href="#documentation">Documentations</a>
  <li><a href="#advocacy">Promouvoir FreeBSD</a>
  <li><a href="#applications">Applications</a>
  <li><a href="#networking">R&eacute;seaux</a>
  <li><a href="#filesystem">Syst&egrave;mes de fichiers</a>
  <li><a href="#kernelandsecurity">Noyau et S&eacute;curit&eacute;</a>
  <li><a href="#devicedrivers">Pilotes de p&eacute;riph&eacute;riques</a>
  <li><a href="#architecture">Architectures</a>
  <li><a href="#misc">Divers</a>
</ul>

<a name="documentation"></a>
<h3>Documentations</h3>
    <ul>
      <li><a href="../docproj/docproj.html">Projet de Documentation FreeBSD</a>
	Le Projet de Documentation FreeBSD est un groupe de personnes qui maintient
   et &eacute;crit la documentation (tel que le Manuel de r&eacute;f&eacute;rence et la FAQ) pour le
   projet FreeBSD. Si vous voulez aider ce projet de documentation,
   inscrivez-vous &agrave; la liste de diffusion freebsd-doc@FreeBSD.ORG
   et participez.</li>

      <li><a name="newbies" href="newbies.html">Ressources FreeBSD pour les D&eacute;butants</a>
	est une liste de ressources pour aider ceux qui d&eacute;butent sur FreeBSD et sur UNIX en
   g&eacute;n&eacute;ral. Il y a &eacute;galement une liste de diffusion freebsd-newbies@FreeBSD.ORG.</li>

      <li><a name="retail" href="http://www.bafug.org/purchase/FbsdRetail.html">Magasins pour FreeBSD</a>
	est une liste internationale de revendeurs o&ugrave; l'on peut acheter FreeBSD.</li>

      <li><a name="securityhowto" href="http://people.FreeBSD.org/~jkb/howto.html">
	Guide de s&eacute;curit&eacute; FreeBSD</a>
	FreeBSD est un syst&egrave;me d'exploitation tr&egrave;s s&eacute;curis&eacute;. Comme le code source
   est librement disponible, le syst&egrave;me est constamment examin&eacute; et
   v&eacute;rifi&eacute;. Bien que FreeBSD soit par d&eacute;faut tr&egrave;s s&eacute;curis&eacute;, il existe de
   nombreux moyens pour le rendre encore plus s&ucirc;r pour ceux d'entre vous
   qui sont "parano&iuml;aques". Ce guide d&eacute;crit plusieurs &eacute;tapes qui vous aideront
   &agrave; accroitre la s&eacute;curit&eacute; globale de votre machine.</li>

      <li><a name="BSDsites" href="http://www.freebsdmirrors.org/">
	Moteur de recherche de RELEASE/SNAP pour les serveurs FTP</a>.
	Une ressource qui permettra &agrave; quiconque de trouver un serveur FTP contenant
   une version ("release") ou un instantan&eacute; ("snap") particulier de FreeBSD.
   La base de donn&eacute;es est mise &agrave; jour quotidiennement &agrave; 3 heures du matin,
   heure de Melbourne (+ 10 heures par rapport au Temps Universel ("UTC") ).</li>

      <li><a name="diary" href="http://www.freebsddiary.org/">L'Agenda
      FreeBSD</a> est un ensemble de guides simples &agrave; l'intention des d&eacute;butants
      sous Unix. Le but est de fournir une s&eacute;rie de guides d&eacute;crivant pas-&agrave;-pas
      l'installation et la configuration de divers ports.</li>

      <li><A HREF="http://www.vmunix.com/fbsd-book/">Guide
      Complet FreeBSD</A> - une tentative de guide plus lisible
      et ressemblant davantage &agrave; un livre pour expliquer le syst&egrave;me
      d'exploitation FreeBSD. A l'intention des personnes d&eacute;butant &agrave; la
      fois sur FreeBSD et UNIX. Actuellement en cours d'avancement.</li>

      <li><A HREF="http://flag.blackened.net/freebsd/">Guide
      FreeBSD pour les Paresseux et les D&eacute;sesp&eacute;r&eacute;s</A> est une autre tentative
      quelque peu plus l&eacute;g&egrave;re de fournir un guide plus lisible sur
      l'installation et la configuration de FreeBSD.</li>

      <li><A HREF="http://www.linuxdoc.org/HOWTO/mini/Linux+FreeBSD.html">Le
      mini-Guide Linux+FreeBSD</a> d&eacute;crit comment
      utiliser Linux et FreeBSD sur un m&ecirc;me syst&egrave;me. Il pr&eacute;sente FreeBSD
      et discute sur la fa&ccedil;on dont les deux syst&egrave;mes peuvent coop&eacute;rer,
      par exemple en partageant l'espace de swap.</li>

    <li><a href="http://www.freebsd.org/~rpratt/227/index.html">
	D&eacute;couverte de l'Installation de FreeBSD 2.2.7</a>
	C'est un guide expliquant le programme d'installation de FreeBSD
   pour ceux d&eacute;butant sous Unix et/ou FreeBSD.</li>

    <li><a href="http://home.wxs.nl/~asmodai/pdp.html">Projet
    de Documentation pour les D&eacute;veloppeurs FreeBSD</a></li>

    <li><a name="cookbook"
    href="http://home.austin.rr.com/aaweber/CookBook/cookbook.html">
    Le Livre de Recettes FreeBSD</a>
    OK, vous avez install&eacute; FreeBSD, et maintenant ? Voici quelques suggestions
    de solutions aux probl&egrave;mes courants que vous pouvez mettre en oeuvre avec ce
    que vous connaissez d&eacute;j&agrave;. Ce document est r&eacute;dig&eacute; &agrave; la fa&ccedil;on des livres de
    cuisine &eacute;lectroniques avec quelques recettes pour les types d'installations les
    plus courants. Chaque "recette" inclus des configurations mat&eacute;rielles minimums
    recommand&eacute;es, des logiciels sp&eacute;cifiques &agrave; utiliser et, le plus important, les
    informations de configuration indispensables pour que le syst&egrave;me fonctionne
    correctement.</li>

<li><a name="freebsd-corp-net-guide"
href="http://www.freebsd-corp-net-guide.com/">
"The FreeBSD Corporate Networker's Guide"</a>
Ce site web est un suppl&eacute;ment au livre "The FreeBSD Corporate
Networker's Guide", avec comme objectif principal d'am&eacute;liorer son
utilit&eacute;. Alors que les livres tels que les romans de science-fiction peuvent
&ecirc;tre lus avec plaisir plusieurs centaines d'ann&eacute;es apr&egrave;s leur premi&egrave;re
parution, les manuels techniques comme le "Networker's Guide" sont rendus obsol&egrave;tes
en quelques ann&eacute;es avec les changements concernant les produits dont ils parlent.
</li>

</ul>

<a name="advocacy"></a>
<h3>Promouvoir FreeBSD</h3>
    <ul>

    <Li><a name="advocacyproj" href="http://freebsd.tesserae.com/">
	Projet pour Promouvoir FreeBSD</a>
	Ce projet est un groupe de personnes responsables de la promotion
   de FreeBSD. Notre objectif principal est de d&eacute;velopper une image
   marketing comp&eacute;titive pour le projet FreeBSD et d'accro&icirc;tre le
   nombre d'utilisateurs FreeBSD.
	</li>

    <li><a name=bsdvlin href="http://www.futuresouth.com/~fullermd/freebsd/bsdvlin.html">
	FreeBSD contre Linux</a> : quelques comparaisons entre FreeBSD et
   Linux, qui est un autre syst&egrave;me d'exploitation pour PC tr&egrave;s proche d'Unix
   et qui lui aussi est gratuit et librement distribuable.</li>

    <li><a name="daemonnews" href="http://www.daemonnews.org/">Daemon News</a>
	est une publication &eacute;lectronique consacr&eacute;e aux syst&egrave;mes d'exploitations BSD en g&eacute;n&eacute;ral.
   Son but est d'&ecirc;tre une ressource pour les communaut&eacute;s FreeBSD, OpenBSD
   et NetBSD.</li>

      <li><a href="http://www.bsdcounter.org/">La Page Compteur de FreeBSD</a>
	est le d&eacute;but d'un projet qui va essayer de d&eacute;terminer le nombre d'utilisateurs
   FreeBSD dans le monde entier. L'&eacute;quipe de d&eacute;veloppement FreeBSD a pour
   l'instant une tr&egrave;s vague id&eacute;e du nombre d'utilisateurs et cela rends
   beaucoup plus difficile de persuader les fournisseurs de mat&eacute;riels
   et de logiciels de prendre FreeBSD au s&eacute;rieux.</li>

    <li><a name="giveaway" href="http://visar.csustan.edu/giveaway.html">Liste des CD BSD &agrave; un prix d&eacute;fiant toute concurrence</a>
	Si quelqu'un a un CD &agrave; donner (le destinataire paye les frais de port) ou &agrave;
   pr&ecirc;ter localement, il peut mettre son adresse e-mail sur la liste. Du mat&eacute;riel
   et des livres peuvent aussi &ecirc;tre donn&eacute;s. Nous encourageons tout le monde &agrave; donner
   leurs CD aux biblioth&egrave;ques locales et &agrave; l'indiquer &eacute;galement sur la liste.</li>

    <li><a name="softwarebazaar" href="http://visar.csustan.edu/bazaar/">
	Le Bazar du Logiciel Libre</a> est un "march&eacute;" con&ccedil;u pour accro&icirc;tre
   le nombre de logiciels libres, pour soutenir les d&eacute;veloppeurs de logiciels libres
   et pour mesurer plus pr&eacute;cis&eacute;ment la demande en logiciels libres.</li>

    <li><a href="http://www.freebsdzine.org/">Fanzine &eacute;lectronique FreeBSD</a>
	Le fanzine FreeBSD est un recueil mensuel d'articles faciles &agrave; lire (nous l'esp&eacute;rons)
   &eacute;crits par des utilisateurs et des administrateurs FreeBSD tout comme vous.</li>

    <li><a href="http://dmoz.org/Computers/Software/Operating_Systems/Unix/BSD/FreeBSD/" name="dmoz">
	Le Projet d'Annuaire Public</a> a pour but de cr&eacute;er l'annuaire le plus complet
   du web en comptant sur une vaste arm&eacute;e de r&eacute;dacteurs b&eacute;n&eacute;voles.</li>

    <li><a href="http://www.cdrom.com/~rab/bsd_chart.html" name="freebsdvslinuxvsnt">
	FreeBSD contre Linux contre Windows NT</a>
	Un comparatif entre ces trois syst&egrave;mes d'exploitations qui comprend
   la fiabilit&eacute;, les performances, les probl&egrave;mes li&eacute;s &agrave; l'an 2000, le support,
   les co&ucirc;ts d'exploitation et plus encore.</li>

    <li><a href="http://leb.net/hzo/ioscount/" name="ioscount"> Le
    Compteur des Syst&egrave;mes d'Exploitations sur Internet</a> est une &eacute;tude concernant
    l'utilisation des syst&egrave;mes d'exploitation sur Internet. Des adresses de machines
    sont collect&eacute;es et "interrog&eacute;es" par le programme queso pour conna&icirc;tre leurs
    syst&egrave;mes d'exploitation.</li>

    <li><a name="cellphone"
    href="http://mygiea.heim8.tu-clausthal.de/projects/handy/">Le t&eacute;l&eacute;phone
    portable BSD</a>. Housse pour t&eacute;l&eacute;phone portable d&eacute;cor&eacute;e avec le d&eacute;mon FreeBSD.
    </li>

    <li><a name="freebsdcon"
href="http://www.usenix.org/events/bsdcon02/cfp/">BSDCon 2002</a>, la
3&egrave;me exposition et conf&eacute;rence BSD.
</li>
    </ul>

<a name="applications"></a>
<h3>Applications</h3>
    <ul>
      <li><a name="java" href="../java/index.html">Java sur FreeBSD</a>
	Contient des informations pour obtenir le dernier JDK pour
   FreeBSD, savoir comment l'installer et le faire fonctionner ainsi qu'une liste de
   logiciels java qui pourrait vous int&eacute;resser. Veuillez noter que le JDK n'est pas support&eacute;
   pour les versions de FreeBSD ant&eacute;rieures &agrave; 2.2.</li>

      <li><a name="mozilla" href="mozilla.html">Groupe Mozilla FreeBSD</a>
	cherche &agrave; centraliser le travail sur le projet Mozilla de Netscape pour
   le monde FreeBSD en fournissant des ressources centralis&eacute;es comme un serveur
   CVS, une liste de diffusion &eacute;lectronique et d'autres outils de d&eacute;veloppement.</li>

      <li><a name="multimedia" href="http://people.FreeBSD.org/~faulkner/multimedia/mm.html">Multim&eacute;dia</a>
	Un ensemble de liens sur des informations et des logiciels concernant le monde du
   multim&eacute;dia sous Unix.</li>

      <li><a href="../ports/index.html">Collection de Ports FreeBSD</a>
	La Collection de Ports FreeBSD fournit un moyen simple de compiler et
   d'installer un large choix d'applications avec un minimum d'effort.
   Une liste des ports actuels est disponible avec un moteur de recherche pour
   savoir si une application donn&eacute;e existe dans la collection de ports.</li>

      <li><a href="http://people.FreeBSD.org/~fenner/portsurvey/">Le Rapport sur les fichiers de distribution des Ports FreeBSD</a>
	est une liste qui v&eacute;rifie la collection de ports pour les fichiers de distributions introuvables
   et fournit un r&eacute;sum&eacute; pour chaque port.</li>

<li><a href="http://FreshPorts.org/">FreshPorts</a> fournit la liste la plus &agrave; jour des
ports et des changements sur les ports. Ajouter vos ports favoris &agrave; votre liste personnelle et recevez
un courrier &eacute;lectronique si un changement survient.</li>
    </ul>

<a name="networking"></a>
<h3>R&eacute;seaux</h3>
    <ul>
      <li><a name="altq"  href="http://www.csl.sony.co.jp/person/kjc/kjc/software.html">ALTQ</a> : gestion de bande passante pour les applications</li>
      <li><a name="kame" href="http://www.kame.net/">Projet KAME</a>, une pile IPv6/IPsec pour BSD disponible librement.</li>
      <li><a name="ppp" href="http://www.awfulhak.org/ppp.html">Protocole Point &agrave; Point (PPP)</a></li>
      <li><a name="smn" href="http://ns0.malefic.org/traduction/SMN/">IP Mobile S&eacute;curis&eacute; via IP</a></li>
    </ul>

<a name="filesystem"></a>
<h3>Syst&egrave;mes de Fichiers</h3>
    <ul>
      <li><a name="afs" href="http://www.stacken.kth.se/projekt/arla/">Arla</a>
	est une impl&eacute;mentation libre d'un client AFS. L'objectif principal est de
   faire un client pleinement fonctionnel avec toutes les capacit&eacute;s de l'AFS.
   Les autres choses pr&eacute;vues et impl&eacute;ment&eacute;es sont tous les outils de gestion
   usuels et un serveur.</li>

      <li><a name="coda" href="http://www.coda.cs.cmu.edu/">Coda</a> est
      un syst&egrave;me de fichiers distribu&eacute;s. Au nombre de ses caract&eacute;ristiques : op&eacute;rations
      en mode d&eacute;connect&eacute;, bon mod&egrave;le de s&eacute;curit&eacute;, r&eacute;plications entre serveurs et cache
      persistant c&ocirc;t&eacute; client.</li>

<li><a name="crossfs" href="http://crossfs.bizland.com/cxvfs.html">
Le Syst&egrave;me de Fichier Virtuel crossFS</a>
est bas&eacute; sur le syst&egrave;me de fichier virtuel FreeBSD et fournit un
canevas pour porter les syst&egrave;mes de fichiers Unix sur les syst&egrave;mes Windows NT.
</li>

<li><a name="cruptfs" href="http://www.cs.columbia.edu/~ezk/research/software/">cryptfs</a> crypte les noms de fichiers et les pages de donn&eacute;es en utilisant Blowfish.</li>

<li><a name="elephant" href="http://www.cs.ubc.ca/~feeley/DSG%20Web/dsg_p_elephant.html">Elephant</a> : Le syst&egrave;me de fichier qui n'oublie jamais

<li><a name="journaling" href="http://www.ece.cmu.edu/~ganger/papers/">
Journalisation contre Soft Updates : Protection asynchrone des m&eacute;ta-donn&eacute;es dans les syst&egrave;mes de fichiers</a></li>

      <li><a href="http://people.FreeBSD.org/~terry/">Mode de v&eacute;rouillage ("Mode locking")</a></li>
      <li><a href="http://people.FreeBSD.org/~terry/">Rendre l'interface namei r&eacute;flexive</a></li>
      <li><a href="http://people.FreeBSD.org/~terry/">V&eacute;rouillage NFS (client et serveur)</a></li>

<li><a name="dcd" href="http://www.usenix.org/events/usenix99/full_papers/nightingale/nightingale_html/">Conception et Impl&eacute;mentation d'un gestionnaire de p&eacute;riph&eacute;rique DCD pour Unix</a></li>

      <li><a href="http://iclub.nsu.ru/~semen/ntfs/">Pilote NTFS pour FreeBSD</a>
	Ce pilote permet de monter des partitions Windows NTFS sous FreeBSD.
   Actuellement, les partitions NTFS sont uniquement accessibles en lecture seule mais
   l'acc&egrave;s en lecture-&eacute;criture est pr&eacute;vu.</li>

      <li><a name="rio" href="http://www.eecs.umich.edu/Rio/">Rio (Entr&eacute;es/Sorties
      en RAM)</a> : Le projet Rio cherche comment impl&eacute;menter et utiliser
      une m&eacute;moire "fiable". La m&eacute;moire "fiable" permets une forte am&eacute;lioration
      de la fiabilit&eacute; et des performances.</li>

       <li><a name="softupdate" href="ftp://ftp.FreeBSD.org/pub/FreeBSD/FreeBSD-current/src/sys/ufs/ffs/README.softupdates"> Soft Updates : </a>Une solution au probl&egrave;me de mise &agrave; jour des m&eacute;ta-donn&eacute;es dans les syst&egrave;mes de fichiers.</li>

      <li><a name="tcfs" href="http://tcfs.dia.unisa.it/">TCFS</a>
	est un Syst&egrave;me de Fichier Chiffr&eacute; Transparent ce qui est une solution adapt&eacute;e
   au probl&egrave;me des regards indiscrets dans le cas d'un syst&egrave;me de fichier distribu&eacute;. En
   int&eacute;grant totalement le service de cryptage et le syst&egrave;me de fichier, il
   en r&eacute;sulte une compl&egrave;te transparence d'utilisation pour l'utilisateur final.
   Les fichiers sont stock&eacute;s sous une forme crypt&eacute;e et sont d&eacute;crypt&eacute;s avant
   qu'ils ne soient lus. Le processus de cryptage/d&eacute;cryptage se d&eacute;roule sur la
   machine cliente et par cons&eacute;quent la clef de cryptage/d&eacute;cryptage ne voyage
   jamais &agrave; travers le r&eacute;seau.</li>

      <li><a name="Tertiary" href="http://now.cs.berkeley.edu/Td/">Tertiary Disk</a>
	est une architecture de syst&egrave;me de stockage pour cr&eacute;er un large syst&egrave;me de disque de
   stockage qui &eacute;vite les inconv&eacute;nients des syst&egrave;mes de stockage propri&eacute;taire. Le
   nom provient de deux objectifs : avoir le co&ucirc;t par m&eacute;ga-octect et la
   capacit&eacute; des stockages par bandes et avoir les performances des disques
   magn&eacute;tiques. Nous utilisons des produits tout ce qu'il y a de plus courant pour d&eacute;velopper
   un syst&egrave;me de stockage modulable, de faible co&ucirc;t et avec une capacit&eacute; en t&eacute;ra-octects. Notre
   but est de construire un syst&egrave;me de stockage complet avec un co&ucirc;t sup&eacute;rieur de 30 &agrave; 50 % au
   prix des disques seuls. Tertiary Disk utilise des PC connect&eacute;s en r&eacute;seau
   pour pouvoir utiliser un large nombre de disques. Notre prototype consiste
   en 20 PC &agrave; 200 Mhz avec un total de 370 disques de 8 Go chacun. Les PC
   sont connect&eacute;s &agrave; travers un r&eacute;seau Ethernet &agrave; 100 Mbps.</li>

      <li><a name="vinum" href="http://www.vinumvm.org/">Vinum</a>
	 est un gestionnaire de volume logique con&ccedil;u d'apr&egrave;s le gestionnaire de volume VERITAS.
    Toutefois, il ne s'agit pas d'un clone de Veritas, et il tente de r&eacute;soudre un
    certain nombre de probl&egrave;mes plus &eacute;l&eacute;gamment que Veritas. Il offre aussi
    des possibilit&eacute;s que Veritas n'a pas.</li>

      <li><a name="PathConvert" href="http://www.tamacom.com/pathconvert/">
	Le projet de Conversion de Chemin ("PathConvert")</a> consiste &agrave; d&eacute;velopper des utilitaires
   pour r&eacute;aliser la conversion entre noms de chemins absolus et noms de chemins relatifs. Il
   est utile principalement pour les utilisateurs de NFS et de WWW.</li>

      <li><a name="v9fs" href="http://www.acl.lanl.gov/~rminnich/">
      V9FS: syst&egrave;me de fichier en m&eacute;moire pour FreeBSD</a> Cela deviendra (nous l'esp&eacute;rons)
      dans le futur la base des espaces de nommage priv&eacute;s pour FreeBSD.
      Il fournit un syst&egrave;me de fichier qui utilise uniquement la m&eacute;moire vive
      pour les r&eacute;pertoires, les i-nodes et les donn&eacute;es. Ce n'est pas du tout comme mfs,
      car mfs utilise la m&eacute;moire pour les "bloques disques" et agit essentiellement
      comme un p&eacute;riph&eacute;rique pour UFS. V9FS est au contraire un "citoyen de premier ordre"
      et peut &ecirc;tre mont&eacute; comme un syst&egrave;me de fichier. Pas encore de code
      pour l'instant.</li>

<li><a name="WAFS" href="http://www.eecs.harvard.edu/~stein/wafs/">
WAFS</a> est un syst&egrave;me de fichier simple con&ccedil;u pour &ecirc;tre un service
de logs pour les sous-syst&egrave;mes du noyau. Les lectures et &eacute;critures sont index&eacute;es
avec des num&eacute;ros de s&eacute;quence de log (LSN). Toutes les &eacute;critures sur WAFS sont
s&eacute;quentielles. Les sous-syst&egrave;mes du noyau peuvent utiliser ce service LSN pour
forcer une &eacute;criture des logs et garantir l'int&eacute;grit&eacute;.
</li>

    </ul>

<a name="kernelandsecurity"></a>
<h3>Noyau et s&eacute;curit&eacute;</h3>
    <ul>
      <li><a name="drawbridge" href="http://drawbridge.tamu.edu/">Drawbridge</a>
	est un firewall complet qui fut d&eacute;velopp&eacute; &agrave; l'Universit&eacute; A&amp;M du Texas et
   qui fut con&ccedil;u en gardant &agrave; l'esprit un large environnement de type universitaire. Sa plus
   grande force est sa capacit&eacute; &agrave; ex&eacute;cuter le filtrage de paquet tr&egrave;s rapidement pour
   un grand nombre de machines &agrave; l'int&eacute;rieur d'un intranet.</li>

<li><a name="lotteryscheduling"
href="http://www.csua.berkeley.edu/computing/software/lottery-sched.html">
Ordonnancement du noyau par loterie</a> : Ce projet est bas&eacute; sur
l'algorithme d'ordonnancement par loterie de Waldspurger, qui impl&eacute;mente
un partage proportionnel des ressources. Les avantages principaux
sont que les utilisateurs ont un contr&ocirc;le strict sur le pourcentage relatif
d'ex&eacute;cution de leurs processus et que les utilisateurs sont isol&eacute;s les uns des
autres ce qui emp&ecirc;che un utilisateur de monopoliser le CPU.</li>

      <li><a name="metacomputing" href="http://www.acl.lanl.gov/~rminnich/">Metacomputing</a></li>
      <li><a name="DHCP" href="http://home.san.rr.com/freebsd/dhcp.html">Configuration DHCP</a>
	Comment mettre en oeuvre DHCP sur les syst&egrave;mes FreeBSD pour une utilisation avec les modems cables, etc...</li>

      <li><a href="http://people.FreeBSD.org/~terry/">LDAP pour FreeBSD</a></li>

      <li><a name="SMP" href="http://people.FreeBSD.org/~fsmp/SMP/SMP.html">Support Multi-Processeurs Sym&eacute;trique</a>
	Documentations et autres informations pour tirer avantage des syst&egrave;mes
   multi-processeurs sous FreeBSD.</li>

      <li><a href="http://people.FreeBSD.org/~terry/">Un syst&egrave;me de validation pour tester les allocations/d&eacute;sallocations m&eacute;moire du noyau.</a></li>

<li><a name="spy" href="http://people.FreeBSD.org/~abial/spy/">SPY</a>
vous permet de surveiller et/ou bloquer certains appels syst&egrave;mes sur votre
poste. Il peut &ecirc;tre utilis&eacute; pour une surveillance des p&eacute;riph&eacute;riques, forcer
une politique de s&eacute;curit&eacute; ou comme outil de debugage.</li>

<li><a name="trustedbsd" href="http://www.TrustedBSD.org/">TrustedBSD</a>
fournit un ensemble d'extensions &eacute;prouv&eacute;es au syst&egrave;me d'exploitation FreeBSD.
Cela inclu notamment des fonctions comme les privil&egrave;ges que l'on peut d&eacute;finir
tr&egrave;s pr&eacute;cis&eacute;ment ("capabilities"), les listes de contr&ocirc;les d'acc&egrave;s (ACL) et les
contr&ocirc;les d'acc&egrave;s obligatoires (MAC).</li>

    </ul>

<a name="devicedrivers"></a>
<h3>Pilotes de p&eacute;riph&eacute;riques</h3>
    <ul>

<li><a name="fdd" href="http://www.posi.net/freebsd/drivers/">Base de donn&eacute;es des gestionnaires de p&eacute;riph&eacute;riques BSD</a>
Ce n'est pas parce que vous n'avez pas le temps d'&eacute;crire un gestionnaire de p&eacute;riph&eacute;riques
vous-m&ecirc;me que vous ne pouvez pas apporter votre aide. L'id&eacute;e derri&egrave;re
la base de donn&eacute;es des gestionnaires de p&eacute;riph&eacute;riques BSD est d'aider les personnes
qui poss&egrave;dent le mat&eacute;riel &agrave; &ecirc;tre en contact avec les d&eacute;veloppeurs de gestionnaire
de p&eacute;riph&eacute;riques qui ont les connaissances n&eacute;cessaires pour &eacute;crire le code.
Il s'agit d'une liste de gestionnaire de p&eacute;riph&eacute;riques actuellement en cours de
d&eacute;veloppement qui pourraient tirer profit du temps ou des ressources que
vous pourriez apporter.</li>

      <li><a name="deviceframework" href="http://people.FreeBSD.org/~dfr/devices.html">
	Une Nouvelle Structure pour les P&eacute;riph&eacute;riques sous FreeBSD</a></li>

      <li><a name="atm" href="http://www.ccrc.wustl.edu/pub/chuck/tech/bsdatm/bsdatm.html"> ATM BSD : une impl&eacute;mentation de ATM sous 4.4BSD</a> :
	Les nouvelles applications informatique dans les domaines tel que le multim&eacute;dia, le traitement d'image
   et le calcul distribu&eacute; n&eacute;cessitent de hauts niveaux de performance de la part du
   r&eacute;seau. Les solutions de r&eacute;seaux bas&eacute;es sur l'ATM fournissent une alternative
   possible pour r&eacute;pondre &agrave; ces besoins de performances.
   Cependant, la complexit&eacute; de l'ATM par rapport aux r&eacute;seaux traditionnels tel que
   l'Ethernet est une barri&egrave;re &agrave; son utilisation. Dans ce document,
   nous pr&eacute;sentons la conception et l'impl&eacute;mentation de l'ATM BSD, une
   couche logicielle ATM l&eacute;g&egrave;re et efficace pour les syst&egrave;mes d'exploitations bas&eacute;s
   sur BSD et qui demande des changements minimals au niveau du syst&egrave;me.
   ATM BSD peut &ecirc;tre utilis&eacute; &agrave; la fois sur du r&eacute;seau IP et sur de
   l'ATM "natif".</li>

<li><a name="NVIDIA" href="http://nvidia.netexplorer.org/">
Initiative pour un gestionnaire de p&eacute;riph&eacute;rique NVIDIA sur
FreeBSD</a> - Une initiative dont le but est d'obtenir des gestionnaires de p&eacute;riph&eacute;riques 3D
pour FreeBSD support&eacute;s par NVIDIA. Cela doit &ecirc;tre accompli avec l'aide de la communaut&eacute;
des d&eacute;veloppeurs FreeBSD et celle de NVIDIA. Veuillez visiter la page web pour des nouvelles
r&eacute;guli&egrave;rement mises &agrave; jour et pour savoir comment vous pouvez participer.</li>

      <li><a name="timekeeping" href="http://phk.freebsd.dk/rover.html">Horloge de Haute-pr&eacute;cision avec FreeBSD</a>
	Comment cr&eacute;er un serveur NTP de niveau 1 avec des performances optimales.</li>

      <li><a name="homeauto" href="http://people.FreeBSD.org/~fsmp/HomeAuto/HomeAuto.html">Domotique</a>
	avec FreeBSD comme par exemple des contr&ocirc;leurs d'appareils &eacute;lectriques, des contr&ocirc;leurs infra-rouge,
   des syst&egrave;mes t&eacute;l&eacute;phoniques automatis&eacute;s et plus encore.</li>

      <li><a name="isdn" href="http://www.freebsd-support.de/i4b/">i4b : ISDN pour FreeBSD</a>
	ISDN4BSD (ou i4b pour faire court) est un ensemble de logiciels pour connecter
   un ordinateur fonctionnant sous FreeBSD, NetBSD, OpenBSD, ou BSD/OS &agrave; ISDN.  Le seul protocole
   ISDN support&eacute; pour l'instant est le protocole BRI. ISDN4BSD vous permet de r&eacute;aliser des
   connexions r&eacute;seaux IP en utilisant soit des paquets IP envoy&eacute;s dans des trames
   HDLC "brutes" sur le canal B soit en utilisant PPP en mode synchrone. Pour la
   t&eacute;l&eacute;phonie, ISDN4BSD peut r&eacute;pondre aux appels entrants tout comme un r&eacute;pondeur
   automatique.</li>

      <li><a name="cam" href="http://people.FreeBSD.org/~gibbs/">CAM : une nouvelle couche SCSI pour FreeBSD</a>
	D&eacute;tails sur ce qu'est la nouvelle couche SCSI CAM et comment elle fonctionne.</li>

      <li><a name="tokenring" href="http://www.jurai.net/~winter/tr/tr.html">Le Projet Token-Ring FreeBSD</a>
	Informations, fichiers, patches et documentations pour ajouter le support Token Ring
   sous FreeBSD.</li>

      <li><a name="usb" href="http://www.etla.net/~n_hibma/usb/usb.pl"> D&eacute;veloppement de pilotes USB pour FreeBSD</a>
	La pile USB pour NetBSD a &eacute;t&eacute; port&eacute;e sur FreeBSD. En collaboration avec NetBSD, nous
   avons commenc&eacute; le d&eacute;veloppement de pilotes pour les nombreux p&eacute;riph&eacute;riques utilisant le bus USB.
   Jetez un oeil sur la page web si vous voulez vous joindre &agrave; nous ou si vous voulez conna&icirc;tre
   les p&eacute;riph&eacute;riques support&eacute;s.</li>

      <li><a name="awe64" href="http://members.tripod.com/~section001/bsdawe64.html">Configuration d'une Soundblaster Awe64 sous
      FreeBSD 3.1</a></li>

<li><a name="xircomcem"></a>Une liste de diffusion existe pour le d&eacute;veloppement
futur du pilote ethernet pour Xircom CEM de Scott Mitchell. Envoyez
<tt>subscribe freebsd-xircom</tt> &agrave; <a
  href="mailto:majordomo@lovett.com">majordomo@lovett.com</a> pour
vous abonner.</li>

<li><a name="raid"></a><a
href="http://people.FreeBSD.org/~msmith/RAID/">Liste</a> de Mike Smith des cartes
RAID support&eacute;es et informations sur ces cartes.</li>

    </ul>

<a name="architecture"></a>
<h3>Architectures</h3>
    <ul>
      <li><a name="alpha" href="../platforms/alpha.html">Portage de FreeBSD sur les syst&egrave;mes Alpha</a>
	Contient des informations sur le portage de FreeBSD sur Alpha comme l'&eacute;tat d'avancement,
   les informations sur la liste de diffusion &eacute;lectronique, le mat&eacute;riel utilis&eacute; et d'autres
   projets sur Alpha.</li>

<li><a name="ia64" href="../platforms/ia64.html">
Portage de FreeBSD sur les syst&egrave;mes IA-64</a>
Ce projet est responsable du portage de FreeBSD sur l'architecture
IA-64. Envoyez toutes les questions sp&eacute;cifiques &agrave; ce projet sur
la liste de diffusion freebsd-ia64@FreeBSD.org. </li>

<li><a name="ppc" href="../platforms/ppc.html">Portage de FreeBSD sur les syst&egrave;mes PowerPC.</a>
Contient des informations sur le portage de FreeBSD sur PPC comme des informations sur
la liste de diffusion, etc...</li>

      <li><a name="sparc" href="../platforms/sparc.html">Portage de FreeBSD sur les syst&egrave;mes Sparc</a>
	Contient des informations sur le portage de FreeBSD sur Sparc comme une FAQ,
   un d&eacute;but de code pour le boot, des informations sur les processeurs et les cartes m&egrave;res
   Sparc et d'autres projets Sparc.</li>

      <li><a name="sysvr4" href="http://slash.dotat.org/~newton/freebsd-svr4/">
	La page sur l'&eacute;mulation SysVR4</a> d&eacute;crit un &eacute;mulateur SysVR4 pour
   FreeBSD. Il est actuellement capable de faire fonctionner (ou de faire marcher dans certains
   cas) une large vari&eacute;t&eacute; d'ex&eacute;cutables SysV provenant de syst&egrave;mes Solaris/x86
   2.5.1 et 2.6. J'ai quelques raisons de croire qu'il peut &eacute;galement faire fonctionner
   les binaires SCO UnixWare et SCO OpenServer.</li>

      <li><a name="oskit" href="http://www.cs.utah.edu/flux/oskit/">Le Kit OS</a>
	Le Kit OS est une structure et un ensemble de 31 librairies fourni avec une documentation
   compl&egrave;te orient&eacute; vers les syst&egrave;mes d'exploitation. En
   fournissant d'une fa&ccedil;on modulaire non seulement la plupart de l'infrastructure
   de base n&eacute;cessaire pour un syst&egrave;me d'exploitation mais aussi beaucoup de composants de plus haut niveau, le
   but du Kit OS est de faciliter l'acc&egrave;s &agrave; la recherche et au d&eacute;veloppement de syst&egrave;mes d'exploitations et
   d'abaisser son co&ucirc;t. Le Kit OS rend beaucoup plus facile la cr&eacute;ation d'un nouveau syst&egrave;me d'exploitation, le
   portage d'un syst&egrave;me d'exploitation existant sur un processeur x86 (ou dans le futur sur d'autres
   architectures support&eacute;es par le Kit OS) ou bien l'am&eacute;lioration d'un syst&egrave;me d'exploitation par le support
   d'un plus grand nombre de p&eacute;riph&eacute;riques, de formats de syst&egrave;mes de fichiers, de formats d'ex&eacute;cutables ou
   de services r&eacute;seaux. Le Kit OS fonctionne aussi tr&egrave;s bien pour la construction de programmes li&eacute;s au s
   yst&egrave;me d'exploitation tel que les chargeurs de boot ("boot loaders") ou les serveurs au niveau du syst&egrave;me
   d'exploitation se situant au dessus d'un micro-noyau.</li>

      <li><a name="picobsd" href="http://people.FreeBSD.org/~picobsd/">FreeBSD l&eacute;ger et embarqu&eacute; (PicoBSD)</a>
	PicoBSD est une version de FreeBSD tenant sur une seule disquette qui, dans ses diff&eacute;rentes
   variantes, vous permet d'avoir un acc&egrave;s dial-up s&eacute;curis&eacute;, un petit routeur sans disque dur
   ou m&ecirc;me un serveur dial-in. Tout cela sur seulement une disquette standard
   de 1.44 Mo. Il a besoin au minimum d'un processeur 386SX avec 8 Mo de m&eacute;moire vive
   et aucun disque dur n'est n&eacute;cessaire !</li>

      <li><a name="buds" href="http://www.mozie.com/projects/buds/index.html">
      BUDS : Unix BSD Distribu&eacute; "Simplement"</a>

      Fournit un syst&egrave;me de clusters &agrave; vocation g&eacute;n&eacute;raliste pour de futurs
      d&eacute;veloppements dans le domaine des multi-processeurs parall&egrave;les. Ce syst&egrave;me
      est destin&eacute; &agrave; &ecirc;tre g&eacute;n&eacute;rique par nature mais puissant. Il n'est pas destin&eacute;
      aux applications n&eacute;cessitant des calculs intensifs ni aux applications
      interd&eacute;pendantes extr&ecirc;mement complexes.</li>

<li>The <a name="Eclipse"
href="http://www.bell-labs.com/project/eclipse/release/">Syst&egrave;me d'Exploitation Eclipse</a>
est un banc d'essai pour la Qualit&eacute; de Service (QoS) qui est actuellement
d&eacute;velopp&eacute; au Centre de Recherche des Sciences de l'Information de Bell-Labs,
Lucent Technologies.

Eclipse fournit un support QoS flexible et hautement configurable pour les
applications. Sa conception permet aux applications sp&eacute;cifiques ou non
de fournir un support QoS sans modification ni recompilation. Une
API simple est fournie pour les (nouvelles) applications qui veulent tirer avantage
du support QoS hautement configurable.

Actuellement, le projet Eclipse cible le support QoS pour les applications
serveurs, en particulier, pour diff&eacute;rencier les performances de
diff&eacute;rents sites web h&eacute;berg&eacute;s sur une m&ecirc;me plate-forme (voir les exemples
avec Apache).  </li>

    </ul>

<a name="misc"></a>
<h3>Divers</h3>
    <ul>
      <li><a name="global" href="http://www.tamacom.com/global/">GLOBAL</a>
	est un syst&egrave;me de "marquage" ("tag system") de code source commun qui fonctionne de la m&ecirc;me mani&egrave;re
   sous des environnements divers. Actuellement, il supporte l'interpr&eacute;teur de ligne de commande,
   l'&eacute;diteur nvi, les browser web, l'&eacute;diteur emacs et l'&eacute;diteur elvis.
   Les langages support&eacute;s sont le C, Yacc, et Java.</li>

      <li><a name="pao" href="http://www.jp.FreeBSD.org/PAO/">PAO : la page de l'Informatique Mobile, les ordinateurs portables fonctionnant sous FreeBSD</a>
      PAO permets &agrave; FreeBSD d'utiliser de nombreuses cartes PCMCIA (PC-card) et vous permet
      aussi d'avoir des PC-card pouvant &ecirc;tre connect&eacute;s "&agrave; chaud" sur votre portable fonctionnant
      sous FreeBSD. Il contient aussi certaines am&eacute;liorations et corrections de bugs pour le
      pilote APM BIOS.</li>

      <li><A name="freebsdxr" HREF="http://lxr.linux.no/freebsd/source">R&eacute;ferences crois&eacute;es FreeBSD</A>.
	Une pr&eacute;sentation hypertexte avec des r&eacute;f&eacute;rences crois&eacute;es du code source du noyau
   FreeBSD. La version index&eacute;e est celle de d&eacute;veloppement (version "-CURRENT") et elle est mise &agrave; jour
   chaque nuit.</li>

   <li><A name="enterman" HREF="http://www.de.daemonnews.org/199908/enteruser.html">Enteruser : Un remplacement &agrave; Adduser</A></li>
      <li><A name="libh" HREF="http://people.FreeBSD.org/~alex/libh/">libh</A>.
        Libh est un "wrapper" qui permet aux scripts tcl de
	tourner dans une sorte de "bo&icirc;te noire" et de s'interfacer avec d'autres librairies.
	Parmi les librairies fournies avec libh qui peuvent &ecirc;tre utilis&eacute;es
	depuis des scripts Tcl il existe une librairie g&eacute;n&eacute;rique pour les interfaces utilisateurs,
	qui utilise Turbo Vision pour le mode console et Qt pour le mode X11.
	Libh inclu &eacute;galement un nouveau syst&egrave;me de package qui utilise des archives
   Zip et divers scripts par package parmi d'autres choses. Inclu &eacute;galement
	le d&eacute;but d'un nouveau sysinstall.</li>

</ul>


&footer;
</body>
</html>
