<?xml version="1.0" encoding="ISO-8859-1" ?>
<!-- useful for the french translation -->

<!-- 
   The FreeBSD French Documentation Project
   Original revision:
   Original checkum: md5 = b573d0324d07019e0e99dadeb0992f6a
   Original date: 2002-10-03
   
   Version francaise : Luc Vo Van
   Version francaise (mise a jour) : Olivier Cherrier <Olivier.Cherrier@cediti.be>
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org> 
-->

<report>
  <date>
    <month>Juillet - Ao&#251;t</month>
    <year>2002</year>
  </date>

  <section>
    <title>Introduction</title>

    <p>Durant Juillet et Ao&#251;t, les efforts se sont concentr&#233;s sur 
      la mise en place des derniers composants majeurs concernant les nouvelles fonctionnalit&#233;s
      de FreeBSD 5.0-RELEASE. Pour l'instant, cette nouvelle version est pr&#233;vue
      pour fin Novembre ou d&#233;but D&#233;cembre. Les travaux sur une granularit&#233; plus fine
      continuent, en particulier en ce qui concerne le VFS, tout comme l'am&#233;lioration du support pour les threads
      avec le travail sur le KSE; des fonctionnalit&#233;s telles que le GEOM, l'UFS2 et TrustedBSD MAC arrivent
      &#224; maturit&#233; et les nouveaux ports pour processeurs ia64 et sparc64 sont proches de la qualit&#233; n&#233;cessaire
      &#224; une utilisation en production. Dans les deux prochains mois, nous devrions voir
      de nouvelles pr&#233;-versions de la 5.0 pour les d&#233;veloppeurs et des am&#233;liorations suppl&#233;mentaires concernant
      la granularit&#233; et les threads ainsi que les nouvelles architectures support&#233;es. 
      Le support du Firewire a &#233;t&#233; import&#233; dans l'arbre des sources et
      une refonte substantielle du code portant sur l'ACPI/le PCI est en cours. 
      Enfin, l'import du support de l'acc&#233;l&#233;ration mat&#233;rielle pour IPsec est pr&#233;vu
      dans un futur proche.</p>
    <p>Lorsque de nouvelles pr&#233;-versions pour les d&#233;veloppeurs sortent, essayez-les ! M&#234;me si
      la version 5.0-RELEASE sera destin&#233;e aux "utilisateurs aventureux", plus nous ferons
      de tests maintenant, moins nous aurons de corrections &#224; faire plus tard. Les nouvelles
      fonctionnalit&#233;s sont tr&#232;s prometteuses et bien comprendre quand et comment les utiliser
      correctement est important. Dans les deux prochains mois, entre autres choses,
      l'&#233;quipe en charge des versions communiquera les plannings de sortie des versions ainsi que
      des conseils pour aider les utilisateurs de FreeBSD &#224; choisir la nouvelle version
      la plus adapt&#233;e &#224; leurs besoins. Garder un oeil sur tout cela et n'h&#233;sitez pas
      &#224; nous envoyer vos commentaires.</p>
    <p>Pour celles et ceux qui sont en Europe -- nous attendons avec impatience de vous voir &#224; la 
      Convention Europ&#233;enne BSD qui aura lieu dans quelques mois !</p>
    <p>Scott Long, Robert Watson</p>

  </section>

<project>
  <title>Convention BSD 2003</title>

  <contact>
    <person>
      <name>
	<given>Gregory</given>
	<common>Shapiro</common>
      </name>
      <email>gshapiro@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.usenix.org/events/bsdcon03/cfp/">Convention BSD 2003 - Appel &#224; participation</url>
  </links>

  <body>

    <p>Le Comit&#233; pour le programme de la Convention BSD 2003 vous invite &#224; envoyer
    des articles originaux et novateurs sur des sujets li&#233;s aux syst&#232;mes de la famille BSD
    et au monde de l'open-source. Par exemple :</p>

    <ul>
      <li>D&#233;veloppement et mise en oeuvre d'une application BSD embarqu&#233;e</li>
      <li>Exp&#233;riences concr&#232;tes d'utilisations des syst&#232;mes BSD</li>
      <li>Utilisation des BSD dans un environnement multi-syst&#232;mes</li>
      <li>Comparaison avec les syst&#232;mes non-BSD au niveau technique,
      pratique et des licences (GPL vs. BSD)</li>
      <li>Suivi du d&#233;veloppement open-source sur les syst&#232;mes non-BSD</li>
      <li>BSD pour un ordinateur personnel</li>
      <li>D&#233;veloppement de gestionnaires de p&#233;riph&#233;riques et du sous-syst&#232;me d'E/S</li>
      <li>Threads noyau et SMP</li>
      <li>Am&#233;liorations du noyau</li>
      <li>Services r&#233;seaux et Internet</li>
      <li>S&#233;curit&#233;</li>
      <li>Analyse des performances et configuration</li>
      <li>Administration syst&#232;me</li>
      <li>Le futur des BSD</li>
    </ul>

    <p>Les propositions sous la forme de r&#233;sum&#233;s d&#233;taill&#233;s doivent &#234;tre envoy&#233;es avant le 
    1er Avril 2003. Assurez-vous de respecter toutes les conditions requises concernant ce 
    r&#233;sum&#233; avant de l'envoyer. La s&#233;lection se fera sur la 
    qualit&#233; des travaux et sur leur int&#233;r&#234;t pour la communaut&#233;.</p>

    <p>Nous attendons avec impatience vos articles !</p>

  </body>
</project>

<project>
  <title>Modularit&#233; et duplication des interfaces r&#233;seaux</title>

  <contact>
    <person>
      <name>
	<given>Brooks</given>

	<common>Davis</common>
      </name>

      <email>brooks@FreeBSD.org</email>
    </person>
  </contact>

  <body>
    <p>Le support de la duplication pour les interfaces ppp(4) et disc(4) a &#233;t&#233;
      int&#233;gr&#233;. Une page de manuel au sujet de "disc" est maintenant disponible et les
      p&#233;riph&#233;riques "disc" apparaissent dor&#233;navant en "disc#" au lieu de "ds#". Il reste
      du travail &#224; faire sur "pppd" pour lui int&#233;grer la duplication mais cela devrait
      fonctionner tant que les p&#233;riph&#233;riques sont cr&#233;&#233;s au pr&#233;alable.</p>
    <p>Du c&#244;t&#233; de l'API, la gestion des interfaces obligatoires (i.e. lo0) 
      est prise en charge par le code g&#233;n&#233;rique de duplication si bien que if_clone_destroy a de
      nouveau la m&#234;me API que sous NetBSD et &lt;if&gt;_modevent n'a pas besoin de cr&#233;er
      les p&#233;riph&#233;riques n&#233;cessaires manuellement.</p>
    <p>Actuellement, toutes les pseudo-interfaces ont &#233;t&#233; converties vers 
      l'API de duplication ou poss&#232;dent d&#233;j&#224; leurs propres duplications (sl(4) par exemple
      utilise un m&#233;canisme qui lui est propre). Certains p&#233;riph&#233;riques tels que tun(4) et
      tap/vmware devrait probablement &#234;tre convertis vers l'API de duplication
      au lieu d'utiliser leurs propres syst&#232;mes bas&#233;s sur devfs. Cela serait
      un bon exercice pour les apprentis d&#233;veloppeurs noyau. Enfin, le manuel de r&#233;f&#233;rence et
      la FAQ devraient int&#233;grer une documentation g&#233;n&#233;rale sur la duplication avant la sortie
      de la version 5.0.</p>
  </body>
</project>

<project>
  <title>Projet jpman (pages de manuel en japonais)</title>

  <contact>
    <person>
      <name>
	<given>Kazuo</given>
	<common>Horikawa</common>
      </name>

      <email>horikawa@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.jp.FreeBSD.org/man-jp/">projet jpman</url>
  </links>

  <body>
    <p>Nous &#233;tions sur la mise &#224; jour de la branche RELENG_4 en vue de la 4.7-RELEASE.
      Lorsque le port ja-man-1.1j_5 ne fonctionnait plus vers la fin Juillet,
      Kumano-san et Mori-san ont essay&#233; de mettre &#224; jour le port de mani&#232;re &#224; ce qu'il soit bas&#233; 
      sur une version plus r&#233;cente des pages de manuel des commandes du syst&#232;me de base FreeBSD.
      Finalement, nous avons d&#233;cid&#233; de simplement corriger le port ja-man-1.1j_5 de fa&#231;on &#224; ce 
      qu'il puisse &#234;tre compil&#233;, &#233;tant donn&#233; que le nouveau port n'&#233;tait pas encore termin&#233;.</p>
  </body>
</project>

<project>
  <title>GEOM - manipulation g&#233;n&#233;ral des blocs de stockage</title>

  <contact>
    <person>
      <name>
	<given>Poul-Henning</given>

	<common>Kamp</common>
      </name>

      <email>phk@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.freebsd.org/~phk/Geom/">Un ancien papier sur le concept du projet.</url>

  </links>

  <body>
    <p>Le code GEOM est si bien avanc&#233; qu'il surpasse notre code actuel 
      sur plusieurs points bien qu'il soit encore en retard sur d'autres. L'objectif est de faire
      de GEOM le d&#233;faut dans la 5.0-RELEASE.</p>
    <p>Un module de chiffrement qui devrait &#234;tre capable de 
      prot&#233;ger un disque/une partition de pratiquement n'importe quel attaque
      est actuellement en cours de conception.</p>

  </body>
</project>

<project>
  <title>UFS2 - UFS 64bits avec attributs &#233;tendus natifs</title>

  <contact>
    <person>
      <name>
	<given>Poul-Henning</given>

	<common>Kamp</common>
      </name>

      <email>phk@FreeBSD.org</email>
    </person>
    <person>
      <name>
	<given>Kirk</given>

	<common>McKusick</common>
      </name>

      <email>mckusick@FreeBSD.org</email>
    </person>
  </contact>

  <body>
    <p>Le syst&#232;me de fichier UFS2 est en cours d'ach&#232;vement : les fonctions
      pour les attributs &#233;tendus ont &#233;t&#233; ajout&#233;es (dont une nouvelle 
      API compos&#233;e pour les modifications) et les tests de base ont &#233;t&#233; un succ&#232;s.</p>

  </body>
</project>

<project>
  <title>Projet de Documentation FreeBSD en langue fran&#231;aise</title>
  <contact>
    <person>
      <name>
	<given>Sebastien </given>
	<common>Gioria</common>
      </name>

      <email>gioria@FreeBSD.org</email>
    </person>
    <person>
      <name>
	<given>Marc </given>
	<common>Fonvieille</common>
      </name>
      <email>blackend@FreeBSD.org</email>
    </person>
    <person>
      <name>
	<given>Stephane</given>
	<common>Legrand</common>
      </name>
      <email>stephane@FreeBSD-fr.ORG</email>
    </person>
  </contact>

  <links>
    <url href="http://www.freebsd-fr.org">Projet de Documentation FreeBSD en langue fran&#231;aise.</url>
    <url href="http://www.freebsd-fr.org/index-trad.html">Le serveur web FreeBSD traduit en fran&#231;ais.</url>
    <url href="http://people.freebsd.org/~blackend/doc/fr_FR.ISO8859-1/books/handbook/">Traduction du Manuel de R&#233;f&#233;rence.</url>
  </links>

  <body>
    <p>Environ 50% du nouveau Manuel de R&#233;f&#233;rence a &#233;t&#233; traduit (toute la partie 
      concernant l'installation est traduite). La plupart des articles ont &#233;galement
      &#233;t&#233; traduits.</p>
    <p>Le site web est en cours, consultez le serveur web. Nous devons maintenant
      l'int&#233;grer &#224; l'arbre CVS US.</p>
    <p>La traduction de la derni&#232;re version de la FAQ reste &#224; faire et le prochain _tr&#232;s_ 
      gros projet sera les pages de manuel.</p>
  </body>
</project>
<project>
  <title> Pile Bluetooth pour FreeBSD (impl&#233;mentation Netgraph)</title>

  <contact>
    <person>
      <name>
        <given>
          Maksim
        </given>

        <common>
          Yevmenkin
        </common>
      </name>

      <email>
        m_evmenkin@yahoo.com
      </email>
    </person>
  </contact>

  <links>
    <url href="http://www.geocities.com/m_evmenkin/ngbt-fbsd-20020909.tar.gz">Toute derni&#232;re version</url>

    <url href="http://bluez.sf.net">pile BlueZ pour Linux</url>
  </links>

  <body>
    <p>Je suis tr&#232;s heureux d'annoncer qu'une nouvelle version de 
      d&#233;veloppement est disponible &#224; l'adresse 
      http://www.geocities.com/m_evmenkin/ngbt-fbsd-20020909.tar.gz</p>
    <p>Cette version comprends plusieurs changements majeurs et inclue
      le support des couches de transport UART H4 et USB H2, l'Interface
      de Contr&#244;leur d'H&#244;te (HCI), le Protocole de Contr&#244;le et d'Adaptation
      de la Couche Liaison (L2CAP) et la couche pour les sockets Bluetooth.
      Elle inclue &#233;galement plusieurs utilitaires qui 
      peuvent &#234;tre utilis&#233;s pour configurer et tester les p&#233;riph&#233;riques Bluetooth.
      Enfin, plusieurs pages de manuel ont &#233;t&#233; ajout&#233;es.</p>
    <p>Le Protocole de D&#233;couverte de Service (SDP) est maintenant support&#233;. Cette
      version inclue un d&#233;mon SDP, un outil de configuration et une biblioth&#232;que
      utilisateur (un portage de BlueZ-sdp-0.7).</p>
    <p>RFCOMM est maintenant support&#233;. Cette version inclue le d&#233;mon 
      rfcommd qui fournit un service RFCOMM via des pseudo-ttys.
      Ce n'est pas tr&#232;s utile pour les applications classiques, mais il est maintenant
      possible de faire fonctionner PPP &#224; travers Bluetooth. C'est un portage de l'ancien
      BlueZ-rfcommd-1.1 (qui n'est plus support&#233; par BlueZ) et il 
      comporte encore plusieurs bugs.</p>
    <p>Les prochaines &#233;tapes sont de corriger le support RFCOMM actuel et de travailler sur
      une nouvelle impl&#233;mentation c&#244;t&#233; noyau de RFCOMM et BNEP (Protocole
      d'Encapsulation de R&#233;seau Bluetooth). Il reste aussi beaucoup de travail  
      sur les programmes utilisateurs (de meilleurs utilitaires et biblioth&#232;ques, une meilleure 
      documentation, etc.).</p>
  </body>
</project>
<project>
  <title>ATM Netgraph</title>

  <contact>
    <person>
      <name>
	<given>Harti</given>

	<common>Brandt</common>
      </name>

      <email>brandt@fokus.fhg.de</email>
    </person>
  </contact>

  <links>
    <url href="http://www.fokus.fhg.de/research/cc/cats/employees/hartmut.brandt/ngatm/index.html">Introduction &#224; NgAtm</url>
  </links>

  <body>
    <p>La version 1.2 est disponible depuis peu. Elle devrait compiler et fonctionner
      sur n'importe quel FreeBSD-current r&#233;cent. Le support pour manipuler les registres SUNI
      a &#233;t&#233; ajout&#233; aux drivers ATM (afin de passer entre les modes 
      SONET et SDH par exemple). Le paquetage ngatmsig inclu d&#233;sormais un petit module 
      simple de contr&#244;le d'appel qui peut &#234;tre utilis&#233; pour concevoir un switch
      ATM basique. Le code netgraph a &#233;t&#233; corrig&#233; afin d'utiliser le verrouillage "officiel"
      de netgraph.</p>
  </body>
</project>

<project>
  <title>Projet de conformit&#233; C99 &amp; POSIX pour FreeBSD</title>

  <contact>
    <person>
      <name>
	<given>Mike</given>

	<common>Barcroft</common>
      </name>

      <email>mike@FreeBSD.org</email>
    </person>
    <person>
      <name>
        <common>Liste de diffusion FreeBSD-Standards</common>
      </name>

      <email>standards@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.FreeBSD.org/projects/c99/" />
  </links>

  <body>
    <p>Du c&#244;t&#233; API, fmtmsg(3) a &#233;t&#233; impl&#233;ment&#233;, glob(3) supporte de nouvelles
      options, ulimit(3) a &#233;t&#233; impl&#233;ment&#233; et le support des caract&#232;res/cha&#238;nes de 
      caract&#232;res &#233;tendus a &#233;t&#233; largement am&#233;lior&#233; avec l'ajout de 30 nouvelles fonctions
      (consultez l'&#233;tat du projet pour plus de d&#233;tails). Le travail progresse en ce qui 
      concerne l'ajout de qualification de type restreint C99 aux fonctions de l'ensemble
      du syst&#232;me. Cela permet au compilateur de r&#233;aliser des optimisations suppl&#233;mentaires bas&#233;es
      sur le fait qu'un argument &#224; qualification restreinte est la seule r&#233;f&#233;rence
      sur un objet donn&#233; (ie. il ne d&#233;borde pas sur un autre argument).</p>
    <p>Plusieurs en-t&#234;tes ont &#233;t&#233; mis en conformit&#233; avec POSIX.1-2001,
      dont : &lt;fmtmsg.h&gt;, &lt;poll.h&gt;, &lt;sys/mman.h&gt;, et
      &lt;ulimit.h&gt;. L'en-t&#234;te &lt;cpio.h&gt; a &#233;t&#233; impl&#233;ment&#233;. Les en-t&#234;tes
      &lt;machine/ansi.h&gt; et &lt;machine/types.h&gt; ont &#233;t&#233; fusionn&#233;s
      en un seul en-t&#234;te de mani&#232;re &#224; simplifier la mani&#232;re dont les types de variables sont
      cr&#233;&#233;s.</p>
    <p>Le sh(1) int&#233;gr&#233; et command(1) ont &#233;t&#233; r&#233;-impl&#233;ment&#233;s de mani&#232;re &#224; &#234;tre conforme &#224;
      POSIX. Par ailleurs, plusieurs utilitaires qui avaient &#233;t&#233; mis en conformit&#233;
      ont &#233;t&#233; int&#233;gr&#233;s dans la branche 4-STABLE.</p>
  </body>
</project>

<project>
  <title>Projet GNOME pour FreeBSD</title>

  <contact>
    <person>
      <name>
	<given>Joe</given>

	<common>Marcus</common>
      </name>

      <email>marcus@FreeBSD.org</email>
    </person>
    <person>
      <name>
	<given>Maxim</given>

	<common>Sobolev</common>
      </name>

      <email>sobomax@FreeBSD.org</email>
    </person>

  </contact>

  <links>
    <url href="http://www.freebsd.org/gnome/">Site web du Projet GNOME
      pour FreeBSD.</url>

  </links>

  <body>
    <p>Le port du bureau GNOME 2 en est maintenant &#224; sa version 2.0.2rc1 avec une version
      2.0.2 qui devrait sortir avant la 4.7-RELEASE. Mozilla 1.1 a &#233;t&#233; port&#233;
      et est disponible au c&#244;t&#233; de Mozilla 1.0.1. Les d&#233;veloppements sur GNOMENG 
      sont en bonne voie. Une bonne partie des ports utilisent maintenant
      la nouvelle infrastructure notamment gr&#226;ce &#224; la participation de
      Edwin Groothuis. Nous sommes actuellement sur les
      derni&#232;res finitions et, lorsque tout le travail sera achev&#233;,
      GNOMENG sera utilis&#233; par d&#233;faut.</p>
    <p>Un bug pr&#233;sent depuis longtemps sur Nautilus a &#233;galement &#233;t&#233; r&#233;cemment
      corrig&#233;. Le bureau n'est plus encombr&#233; d'ic&#244;nes et les
      m&#233;dias amovibles (comme les CDs) devraient maintenant &#234;tre g&#233;r&#233;s correctement.</p>

  </body>
</project>
<project>
  <title>Rapport de statut sur ATAPI/CAM</title>

  <contact>
    <person>
      <name>
	<given>Thomas</given>

	<common>Quinot</common>
      </name>

      <email>thomas@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.cuivre.fr.eu.org/~thomas/atapicam/"/>
  </links>

  <body>
    <p>Le module ATAPI/CAM permet aux p&#233;riph&#233;riques ATAPI (lecteurs 
    CD-ROM, CD-RW et DVD, lecteurs de disques tels que Iomega Zip, lecteurs de bandes) 
    d'&#234;tre accessibles &#224; travers le sous-syst&#232;me SCSI (CAM). ATAPI/CAM a &#233;t&#233; 
    int&#233;gr&#233; dans -CURRENT. Le code devrait &#234;tre compl&#232;tement fonctionnel (il
    a &#233;t&#233; utilis&#233; par de nombreux testeurs via des patches pour -STABLE et
    -CURRENT durant les huit derniers mois), mais il reste quelques probl&#232;mes
    avec les machines SMP. Les testeurs sont plus que bienvenus.</p>
    <p>Une MFC (N.d.T. une int&#233;gration de -current vers -stable) est pr&#233;vue probablement
    apr&#232;s la fin du gel des sources li&#233; &#224; la sortie de la 4.7.</p>
  </body>
</project>
<project>
  <title>Statut du support du chiffrement avec acc&#233;l&#233;ration mat&#233;riel</title>
    <contact>
      <person>
        <name>
          <given>Sam</given>
          <common>Leffler</common>
        </name>
      <email>sam@FreeBSD.org</email>
    </person>
  </contact>
  <body>
    <p>L'objectif de ce projet est d'importer le sous-syst&#232;me de chiffrement int&#233;gr&#233; au noyau
      de OpenBSD. Ce syst&#232;me permet un acc&#232;s c&#244;t&#233; noyau et c&#244;t&#233; utilisateur aux 
      p&#233;riph&#233;riques de chiffrement mat&#233;riels pour le calcul des "hashes" et
      des clefs de chiffrement ainsi que pour les op&#233;rations avec clef publique. Les principaux clients
      de ce syst&#232;me sont RNG (/dev/random), les protocoles r&#233;seaux (comme IPSEC) et
      OpenSSL (&#224; travers /dev/crypto).</p>
    <p>OpenSSL 0.9.7 beta 3 a &#233;t&#233; import&#233; et inclu les corrections provenant de l'arbre des
      sources de OpenBSD. Cela permet &#224; toutes les applications utilisateurs qui utilisent -lcrypto
      de profiter automatiquement de l'acc&#233;l&#233;ration mat&#233;riel. Le coeur du support du
      chiffrement est stable et est utilis&#233; en production sur des machines en version -stable depuis
      plusieurs mois.</p>
    <p>L'import de ce d&#233;veloppement dans la branche -current a commenc&#233;. Un patch disponible
      publiquement pour la version 4.7 sera propos&#233; apr&#232;s la sortie de la 4.7. L'int&#233;gration 
      dans la branche -stable est pr&#233;vu pour la 4.8.</p>
  </body>
</project>

<project>
  <title>Statut du Fast IPsec</title>
    <contact>
      <person>
        <name>
          <given>Sam</given>
          <common>Leffler</common>
        </name>
        <email>sam@FreeBSD.org</email>
      </person>
    </contact>
  <body>
    <p>Le principal objectif de ce projet est de modifier les protocoles IPsec pour qu'ils utilisent
      le sous-syst&#232;me de chiffrement int&#233;gr&#233; au noyau import&#233; de OpenBSD (voir ci-dessus). Un
      objectif secondaire est d'am&#233;liorer les performances globales des protocoles IPsec.</p>
    <p>Les derniers travaux ont port&#233; sur cette am&#233;lioration des performances. Le support est encore limit&#233;
      aux protocoles IPv4, avec le support de IPv6 cod&#233; mais pas encore test&#233;. </p>
    <p>L'import de ce d&#233;veloppement dans la branche -current a commenc&#233;. Un patch
      disponible publiquement pour la version 4.7 sera propos&#233; apr&#232;s la sortie de la 4.7.</p>
  </body>
</project>

<project>
  <title>Probl&#232;mes li&#233;s &#224; la VM dans -stable</title>

  <contact>
    <person>
      <name>
	<given>Matthew</given>

	<common>Dillon</common>
      </name>

      <email>dillon@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://apollo.backplane.com/FreeBSD/wiring_patch_03.diff">
      Patch contre la corruption de la VM pour -stable.</url>
  </links>

  <body>
    <p>Le travail progresse pour faire passer en -stable plusieurs corrections de 
    bugs li&#233;s &#224; une corruption vm_map. Ce travail est probablement
    trop compliqu&#233; pour qu'il soit termin&#233; avant la sortie de la 4.7 mais il devrait
    &#234;tre achev&#233; apr&#232;s la fin du gel du code source. Le bug en question
    se produit typiquement sur les syst&#232;mes avec beaucoup de m&#233;moire et fortement
    charg&#233;s. Il conduit g&#233;n&#233;ralement &#224; des paniques ou &#224; des fautes de page noyau 
    (KPF, "kernel-page-fault's") dans une fonction li&#233;e &#224; vm_map.</p>
  </body>
</project>

<project>
  <title>Nouvel &#233;mulateur de cible SCSI</title>

  <contact>
    <person>
      <name>
	<given>Nate</given>

	<common>Lawson</common>
      </name>

      <email>nate@root.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.root.org/~nate/freebsd/" />
  </links>

  <body>

    <p>Le code existant a &#233;t&#233; r&#233;&#233;crit. Le gestionnaire noyau est
      nettement plus simple puisqu'il d&#233;place toutes les fonctions en mode utilisateur et 
      passe simplement les CCBs vers/depuis le SIM. Le mode utilisateur &#233;mule un disque (RBC)
      avec les E/S dirig&#233;es vers un fichier. Il remplace /sys/cam/scsi/scsi_target*
      et /usr/share/examples/scsi_target.</p>
    <p>Le code est d&#233;finitivement en version alpha et plusieurs probl&#232;mes connus existent
      sur -current. Il semble toutefois que le code fonctionne correctement sur -stable. Consultez le
      fichier README pour l'installation et les tests. Les commentaires sont les bienvenus !</p>

  </body>
</project>

<project>
  <title>Un gestionnaire de processus avec algorithme "loterie" sur FreeBSD -STABLE</title>

  <contact>
    <person>
      <name>
	<given>M&#225;rio S&#233;rgio Fujikawa</given>

	<common>Ferreira</common>
      </name>

      <email>lioux@FreeBSD.org</email>
    </person>
  </contact>

  <body>
    <p>Une nouvelle impl&#233;mentation du gestionnaire de processus avec algorithme "loterie"
      imagin&#233; par Carl Waldspurger et. al. est en cours de d&#233;veloppement sur FreeBSD
      -STABLE. Il est d&#233;velopp&#233; dans le cadre d'un projet d'&#233;tude 
      informatique de l'Universit&#233; de Bras&#237;lia
      du Br&#233;sil. En cons&#233;quence, d'autres impl&#233;mentations existantes n'ont pas &#233;t&#233;
      consult&#233;es de mani&#232;re &#224; &#233;viter le plagiat mais elles le seront plus tard
      afin de chercher des id&#233;es pour une meilleure impl&#233;mentation. 
      Actuellement, une partie de la structure n&#233;cessaire a &#233;t&#233; cod&#233;e
      dans le noyau et le travail progresse malgr&#233; le manque g&#233;n&#233;ral de 
      documentation en ce qui concerne le noyau. Ce projet apportera &#233;galement une 
      documentation simple sur la structure du gestionnaire de processus du noyau 
      de la branche -STABLE, un port du gestionnaire avec algorithme "loterie" sur 
      la branche -CURRENT et des impl&#233;mentations suppl&#233;mentaires 
      d'autres algorithmes de gestion de processus de Carl Waldspurger et. al.
      Les membres de la communaut&#233; FreeBSD ont jou&#233; et continueront &#224; jouer un
      r&#244;le d&#233;cisif par leurs tests et leurs suggestions/commentaires sur les id&#233;es
      impl&#233;ment&#233;es dans ce projet.</p>
  </body>
</project>

<project>
  <title>Projet de Documentation FreeBSD en langue Portugaise/Br&#233;silienne</title>

  <contact>
    <person>
      <name>
	<given>Edson</given>

	<common>Brandi</common>
      </name>

      <email>ebrandi.home@uol.com.br</email>
    </person>

    <person>
      <name>
	<given>M&#225;rio S&#233;rgio Fujikawa</given>

	<common>Ferreira</common>
      </name>

      <email>lioux@FreeBSD.org</email>
    </person>

    <person>
      <name>
	<given>Ricardo Nascimento</given>

	<common>Ferreira</common>
      </name>

      <email>nightwish@techemail.com</email>
    </person>

    <person>
      <name>
	<given>Diego</given>

	<common>Linke</common>
      </name>

      <email>gamk@gamk.com.br</email>
    </person>

    <person>
      <name>
	<given>Jean Milanez</given>

	<common>Melo</common>
      </name>

      <email>jmelo@freebsdbrasil.com.br</email>
    </person>

    <person>
      <name>
	<given>Patrick</given>

	<common>Tracanelli</common>
      </name>

      <email>eksffa@freebsdbrasil.com.br</email>
    </person>

    <person>
      <name>
	<given>Alexandre</given>

	<common>Vasconcelos</common>
      </name>

      <email>alexandre@sspj.go.gov.br</email>
    </person>
  </contact>

  <links>
    <url href="http://www.fugspbr.org/">FUG-BR Grupo de Usu&#225;rios
      FreeBSD - Brasil</url>
  </links>

  <body>
    <p>Le Projet de Documentation FreeBSD en langue Portugaise/Br&#233;silienne a 
      fusionn&#233; avec un groupe de traduction form&#233; de membres du groupe
      d'utilisateurs br&#233;silien de FreeBSD (le FUG-BR). Le projet br&#233;silien
      a d&#233;cid&#233; de devenir un groupe officiel au sein du FUG-BR apr&#232;s avoir re&#231;u
      d'excellentes contributions de la part de ses membres. Ils sont parvenus &#224;
      achever la traduction de la FAQ FreeBSD qui est maintenant en phase
      de correction et de "SGMLification".
      Le travail progresse vite : le Manuel de R&#233;f&#233;rence est &#224; moiti&#233; traduit
      et la traduction des articles est en cours. Les membres de l'ancien projet de traduction
      sont fiers de maintenant faire partie d'un groupe d'utilisateurs aussi motiv&#233;s. Les contacts
      ci-dessus repr&#233;sentent les contacts officiels pour le nouveau 
      groupe de traduction. Nous esp&#233;rons avoir au moins une partie de ces 
      travaux pr&#234;ts &#224; temps pour la sortie de FreeBSD 4.7.</p>
  </body>
</project>

<project>
    <title>KSE</title>
 
    <contact>
      <person>
        <name>
          <given>Julian</given>
          <common>Elischer</common>
        </name>
        <email>julian@freebsd.org</email>
      </person>
      <person>
        <name>
          <given>Jonathon</given>
          <common>Mini</common>
        </name>
        <email>mini@freebsd.org</email>
      </person>
      <person>
        <name>
          <given>Dan</given>
          <common>Eischen</common>
        </name>
        <email>deischen@freebsd.org</email>
      </person>
    </contact>
 
    <links>
      <url href="http://www.freebsd.org/~julian">une vague description</url>
    </links>
 
    <body>
      <p>David Xu et moi-m&#234;me avons travaill&#233; sur le "nettoyage" de certaines parties
        de KSE-III et Jonathon et Dan ont travaill&#233; sur l'interface 
	utilisateur. La librairie utilisateur sera prochainement int&#233;gr&#233;e &#224; l'&#233;tat
        de prototype et un programme de test fonctionnel utilisant cette devrait
        l'accompagner. Je viens &#233;galement d'int&#233;grer une refonte des &#233;tats de fonctionnement
        pour les threads noyau, ce qui permet de simplifier ou de r&#233;soudre certains probl&#232;mes
        apparus r&#233;cemment.</p>
      <p>Si tout va bien, nous devrions &#234;tre capable de faire fonctionner des threads sur 
        plusieurs processeurs d&#232;s les prochaines semaines. Les bases du support pour les signaux sont
        actuellement en cours d'&#233;volution. Archie Cobbs apportera &#233;galement son aide sur certains travaux.
        Un alias de courrier &#233;lectronique est disponible pour tous les d&#233;veloppeurs &#224; l'adresse kse@elischer.org. 
        Il est pour le moment g&#233;r&#233; manuellement.</p>
    </body>
 </project>

<project>
  <title>Cr&#233;ation des versions</title>

  <contact>
    <person>
      <email>re@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.FreeBSD.org/releng/" />
  </links>

  <body>
    <p>L'&#233;quipe en charge de cr&#233;er les nouvelles versions a termin&#233; FreeBSD
      4.6.2. Cette version corrige plusieurs bugs importants dans le
      sous-syst&#232;me ATA ainsi que plusieurs probl&#232;mes de s&#233;curit&#233;
      dans le syst&#232;me de base apparus peu de temps apr&#232;s la sortie
      de FreeBSD 4.6. La documentation &#224; propos de cette version distribu&#233;e avec
      FreeBSD 4.6.2 contient de plus amples d&#233;tails. (Note : certains documents
      et articles plus anciens se r&#233;f&#232;rent &#224; cette version en tant que version
      4.6.1.) La prochaine version de la s&#233;rie 4.X sera FreeBSD 4.7 et
      elle est pr&#233;vue pour le 1er Octobre 2002.</p>
    <p>Parall&#232;lement, le travail se poursuit pour la sortie de la pr&#233;-version
      d&#233;veloppeur 5.0-DP2, une &#233;tape importante sur le chemin de 
      FreeBSD 5.0, toujours pr&#233;vue pour le 20 Novembre.
      Au fur et &#224; mesure que la 5.0 se rapproche, les efforts se focalisent sur la 
      stabilisation du syst&#232;me et non plus sur l'ajout de nouvelles fonctions. Pour
      nous aider dans cette t&#226;che, les d&#233;veloppeurs sont invit&#233;s &#224; discuter avec nous
      de toutes les nouvelles fonctions pr&#233;vues dans -CURRENT &#224; partir du 1er Octobre.</p>
  </body>
</project>

<project>
 <title>Projet "d'instantan&#233;s" quotidiens de jp.FreeBSD.org</title>
 <contact>
  <person>
   <name>
    <given>Makoto</given>
    <common>Matsushita</common>
   </name>
   <email>matusita@jp.FreeBSD.org</email>
  </person>
 </contact>
 <links>
  <url href="http://snapshots.jp.FreeBSD.org/">Site web du projet</url>
  <url href="http://www.jp.FreeBSD.org/snapshots/">Site web du projet (en japonais)</url>
 </links>
 <body>
  <p>Le projet fonctionne comme pr&#233;vu. De nouveaux "instantan&#233;s" de la branche s&#233;curit&#233; sont
    disponibles pour les versions 4.5 et 4.6(.2). J'ai mis &#224; jour les syst&#232;mes des machines sur lesquelles sont lanc&#233;es les compilations
    avec les versions les plus r&#233;centes de 5-current/4-stable sans aucune erreur. Le probl&#232;me
    actuel, &#224; savoir moins de puissance CPU &#224; disposition dans le futur, n'est pas encore r&#233;solu -- mais
    la situation n'est pas si mauvaise et j'esp&#232;re pouvoir donner de bonnes nouvelles dans le prochain
    rapport.</p>
 </body>
</project>

<project>
  <title>Equipe en charge des donations pour le projet FreeBSD</title>

  <contact>
    <person>
      <name>
	<given>Michael</given>

	<common>Lucas</common>
      </name>

      <email>donations@FreeBSD.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.FreeBSD.org/donations/index.html" />
  </links>

  <body>
    <p>L'&#233;quipe en charge des donations a commenc&#233; son activit&#233; ces derniers
      mois. Les offres en &#233;quipement continuent d'arriver et nous les 
      distribuons aux d&#233;veloppeurs FreeBSD aussi rapidement que possible.
      Nous avons maintenant une "liste de souhaits" dans la section d&#233;di&#233;e aux donations
      sur le site web. Plusieurs petites choses, comme des cartes r&#233;seaux, ont
      &#233;t&#233; envoy&#233;es aux personnes d&#233;sirant &#233;crire le code n&#233;cessaire pour 
      supporter ce mat&#233;riel. Nous avons eu quelques donations plus importantes (i.e. des
      serveurs) pr&#234;tes &#224; &#234;tre envoy&#233;es aux d&#233;veloppeurs, une fois que tous les d&#233;tails
      pour l'exp&#233;dition auront &#233;t&#233; r&#233;gl&#233;s.</p>
  </body>
</project>

<project>
  <title>RAIDFrame pour FreeBSD</title>

  <contact>
    <person>
      <name>
	<given>Scott</given>

	<common>Long</common>
      </name>

      <email>scottl@freebsd.org</email>
    </person>
  </contact>

  <links>
    <url href="http://people.freebsd.org/~scottl/rf">Site web du projet</url>
  </links>

  <body>
    <p>Le travail sur RAIDFrame s'&#233;tait arr&#234;t&#233; pour quelque temps, puis avait repris
      l'&#233;t&#233; dernier, avait cess&#233; &#224; nouveau et il est maintenant reparti. Des progr&#232;s 
      significatifs ont et&#233; faits pour rendre les m&#233;canismes de verrous
      compatibles avec SMPng et pour &#233;viter un usage abusif de la pile noyau. Je suis heureux
      d'annoncer qu'il commence &#224; fonctionner de mani&#232;re fiable sur des disques
      "md" (disque simul&#233; avec un fichier). Encore plus sensationnel, il commence enfin
      &#224; fonctionner avec de vrais disques. Beaucoup de nettoyage reste &#224; faire et
      quelques gros "hack" sont encore pr&#233;sents mais tout sera peut-&#234;tre pr&#234;t pour la
      sortie de FreeBSD 5.0. Les patches pour FreeBSD 5-current et 4-stable
      sont disponibles sur le site web. Bien que les patches pour 4-stable datent de plus d'un an, 
      ils s'appliquent et fonctionnent toujours sans probl&#232;me.</p>
  </body>
</project>

<project>
  <title>Rapport de statut sur la Libh</title>

  <contact>
    <person>
      <name>
	<given>Antoine</given>

	<common>Beaupr&#233;</common>
      </name>

      <email>anarcat@anarcat.ath.cx</email>
    </person>

    <person>
      <name>
	<given>Alexander</given>

	<common>Langer</common>
      </name>

      <email>alex@freebsd.org</email>
    </person>
  </contact>

  <links>
    <url href="http://www.freebsd.org/projects/libh.html">Page web du 
    projet</url>

  </links>

  <body>
    <p>L'ordinateur de d&#233;veloppement principal, o&#249; &#233;tait stock&#233; le d&#233;p&#244;t CVS et
      les pages web, est mort. Le serveur a plant&#233; 
      apr&#232;s une mise &#224; jour du syst&#232;me et il n'a jamais pu red&#233;marr&#233;. Nous avons
      du sortir les disques afin de faire des backups. Nous allons 
      mettre en place une autre machine en remplacement de celle-ci et esp&#233;rer que tout se passe pour le mieux. Donc
      pour l'instant, le port est arr&#234;t&#233; puisque le CVS ainsi que les pages web 
      sont inaccessibles. Nous travaillons &#224; corriger ce probl&#232;me, merci
      d'&#234;tre indulgent.</p>
    <p>Sur une note plus positive, Max a commenc&#233; &#224; coder les changements qu'il avait
      lui-m&#234;me propos&#233; concernant le syst&#232;me de compilation et l'API TCL; LibH va passer
      &#224; SWIG pour l'interface TCL, ce qui devrait consid&#233;rablement simplifier le 
      syst&#232;me et r&#233;duire les temps de compilation. Le sous-syst&#232;me Hui est par cons&#233;quent
      en cours de r&#233;-&#233;criture. De mon c&#244;t&#233;, j'ai r&#233;alis&#233; quelques tests sur
      la compilation et l'utilisation de LibH avec rhtvision mais ces tests ont &#233;t&#233;
      moins concluants que je ne l'avais esp&#233;r&#233; et j'ai donc mis de c&#244;t&#233;
      cette id&#233;e. Le travail sur libh s'est arr&#234;t&#233; durant tout le mois de Juillet puisque je n'avais plus
      d'acc&#232;s r&#233;seau pendant ce laps de temps. Pour l'instant, LibH est plut&#244;t en
      mauvais &#233;tat. Mais nous avons bon espoir de tout remettre en place 
      tr&#232;s bient&#244;t pour pouvoir sortir une nouvelle version qui utilisera pleinement
      la nouvelle interface SWIG.</p>
  </body>
</project>


<project>
  <title>Equipe de l'officier de s&#233;curit&#233; FreeBSD</title>

  <contact>
    <person>
      <name>
	<given>Jacques</given>

	<common>Vidrine</common>
      </name>

      <email>nectar@FreeBSD.org</email>
    </person>
  </contact>

  <links>
      <url href="http://www.freebsd.org/security/"/>
  </links>

  <body>

  <p>L'&#233;quipe de s&#233;curit&#233; continue d'&#234;tre tr&#232;s occup&#233;. Le
    traffic de la liste de diffusion "security-officer" pendant les mois de Juin, Juillet
    et Ao&#251;t a &#233;t&#233; de 1230 messages (plus de 13 messages par jour).
    Cela repr&#233;sente plus de 50% du traffic de la liste "freebsd-hackers" durant
    la m&#234;me p&#233;riode !</p>
  <p>Depuis Juin (la date de notre dernier rapport), 9 nouveaux avis de
    s&#233;curit&#233; ont &#233;t&#233; publi&#233;s et une note de s&#233;curit&#233; a &#233;t&#233; publi&#233;e
    pour des probl&#232;mes concernant 25 logiciels de la collection des ports.</p>
  <p>FreeBSD 4.6.2-RELEASE est sorti le 15 Ao&#251;t. C'est la premi&#232;re fois
    qu'un nouveau num&#233;ro de version est cr&#233;&#233; &#224; partir de la branche s&#233;curit&#233;.
    Tout s'est plut&#244;t bien pass&#233; du point de vue de l'&#233;quipe de s&#233;curit&#233;, malgr&#233;
    un retard dans la date de sortie pr&#233;vue &#224; cause de la d&#233;couverte de nouveaux bugs et de petits probl&#232;mes d'organisation
    qui ont emp&#234;ch&#233; la sortie d'une version 4.6.1.</p>
  <p>En Septembre, l'officier de s&#233;curit&#233; FreeBSD a publi&#233; une nouvelle clef
    PGP (ID 0xCA6CDFB2, disponible sur le site FTP et dans le manuel de r&#233;f&#233;rence).
    Cela a permis de remettre en ad&#233;quation la liste des personnes qui poss&#232;de la clef priv&#233; correspondante
    avec la liste des membre du groupe de l'officier de s&#233;curit&#233; publi&#233;e sur 
    le site web. Cela a &#233;galement permis de contourner le probl&#232;me li&#233;
    &#224; la pr&#233;sence d'une version corrompue de l'ancienne clef sur certains serveurs de 
    clefs publiques.</p>
  </body>
</project>

<project>
  <title>Contr&#244;le d'Acc&#232;s Obligatoire (MAC) - TrustedBSD</title>
  <contact>
    <person>
      <name>
	<given>Robert</given>
	<common>Watson</common>
      </name>
      <email>rwatson@FreeBSD.org</email>
    </person>
    <person>
      <name>
	<common>Liste de diffusion TrustedBSD</common>
      </name>
      <email>trustedbsd-discuss@TrustedBSD.org</email>
    </person>
  </contact>
  <body>
    <p>Les derniers mois ont &#233;t&#233; tr&#232;s occup&#233;s avec des activit&#233;s de d&#233;veloppement,
      de documentation et de relations publiques. L'infrastructure MAC,
      notre plug-in noyau de contr&#244;le d'acc&#232;s pour FreeBSD, a &#233;norm&#233;ment
      &#233;volu&#233; et une grande partie de cette infrastructure a &#233;t&#233; int&#233;gr&#233;e
      dans la branche principale de d&#233;veloppement de FreeBSD durant Juillet et Ao&#251;t.</p>
    <p>Plusieurs changements ont &#233;t&#233; apport&#233;s comme: les noms des 
      composants sont pass&#233;s &#224; l'espace de nommage VOP de VFS; une meilleure mise en cache
      des labels MAC dans les vnodes; acc&#232;s m&#233;moire mmap pour le relabel
      des sujets; v&#233;rification pour access()/eaccess(); v&#233;rifications pour les fonctions read,
      write, ioctl, pool des vnodes ce qui permet une r&#233;vocation post-open() par les politiques
      de contr&#244;les concern&#233;es; v&#233;rifications de contr&#244;le d'acc&#232;s et de labelisation pour les objets pipe IPC,
      nettoyage des v&#233;rifications de socket/visibilit&#233;; v&#233;rifications pour les fonctions socket bind,
      connect, listen, ....; de nombreuses am&#233;liorations en ce qui concerne le v&#233;rouillage et les assertions,
      en particulier pour les vnodes, des processus; l'infrastructure supporte d&#233;sormais les mises &#224; jour
      partielles de label sur les sujets et les objets; la gestion des r&#233;f&#233;rences dans 
      'struct file' a &#233;t&#233; am&#233;lior&#233;e, il y a une meilleure distinction entre active_cred 
      et file_cred et ils sont pass&#233;s explicitement &#224; l'infrastructure
      MAC; le syst&#232;me de comptabilit&#233; utilise maintenant les r&#233;f&#233;rences en cache pour 
      les op&#233;rations d'&#233;critures; socreate() peut utiliser les r&#233;f&#233;rences en cache pour 
      le label des sockets ce qui corrige les connexions socket nfs diff&#233;r&#233;es et
      les reconnexions avec TCP; les int&#233;ractions entre kse et proc1 ont &#233;t&#233; corrig&#233;es;
      l'option IO_NOMACCHECK a &#233;t&#233; ajout&#233;e &#224; vn_rdwr() pour une utilisation interne de fa&#231;on &#224; &#233;viter
      des v&#233;rifications MAC redondantes ou incorrectes sur les op&#233;rations vnode aio;
      "demux" (N.d.T. : ??) de la fonction de politique de contr&#244;le mac_syscall(); su ne modifie plus
      les labels MAC par d&#233;faut; mac_get_pid() afin de supporter ps et getpmac -p pid;
      r&#233;vocation mmap par d&#233;faut en "fail stop"; MAC_DEBUG inclu un compteur
      atomique de labels; support des attributs &#233;tendus de UFS2; premier
      port de LOMAC sur l'infrastructure MAC; mise &#224; jour des politiques de contr&#244;les pour tenir 
      compte de tous ces changements; int&#233;gration de KSE III; int&#233;gration de nmount(); mise &#224; jour de 
      ugidfw pour pouvoir utiliser les noms de groupes et d'utilisateurs; libugidfw; nombreuses am&#233;liorations
      dans les conventions de nommages; d&#233;pendances des modules dans 
      l'infrastructure MAC; int&#233;gration &#224; grande &#233;chelle des fonctions MAC dans
      la branche principale de FreeBSD. Interfaces KDE pour les activit&#233;s de gestion
      les plus courantes.</p>
    <p>R&#233;daction d'un guide sur l'infrastructure MAC et pr&#233;sentation de ce guide pendant une journ&#233;e enti&#232;re
      lors du "STOS BSD" et du "Darwin Security Symposium"; premi&#232;re &#233;bauche d'un guide sur l'architecture
      et l'API de l'infrastructure MAC. Ce document est maintenant int&#233;gr&#233; au Manuel du
      D&#233;veloppeur.</p>
    <p>Pendant les prochains mois, le travail consistera &#224; poursuivre les am&#233;liorations,
      &#224; prot&#233;ger et &#233;tiqueter plus d'objets; &#224; am&#233;liorer les performances
      VFS; &#224; am&#233;liorer le support des EA de l'UFS2 et &#224; utiliser des entr&#233;es EA
      s&#233;par&#233;es pour chaque politique de contr&#244;le; &#224; am&#233;liorer le support pour LOMAC; &#224; cr&#233;er
      des compartiments MLS; &#224; associer la s&#233;curit&#233; IPsec et les labels; &#224; am&#233;liorer
      le port SEBSD FLASK/TE et &#224; bien d'autres choses encore.</p>
  </body>
</project>
</report>
