<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY date "$FreeBSD: www/es/applications.sgml,v 1.2 1999/09/06 07:02:59 peter Exp $">
<!ENTITY title "Sobre las Aplicaciones para FreeBSD">
<!ENTITY % includes SYSTEM "includes.sgml"> %includes;
]>
<!-- $FreeBSD: www/es/applications.sgml,v 1.2 1999/09/06 07:02:59 peter Exp $ -->

<HTML>
&header;

<H1>Experimenta las posibilidades con FreeBSD</H1>

<blockquote>
<p>FreeBSD puede manejar cualquier tarea que puedas esperar de una estaci&oacute;n de trabajo UNIX, incluyendo algunas de las que no esperar&iacute;as:</p>
</blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">FreeBSD
es un verdadero sistema abierto con todo el c&oacute;digo fuente.</FONT></FONT>

<blockquote>
<p>No hay duda que los llamados sistemas abiertos son <i>el</i> requerimiento
para las aplicaciones inform&aacute;ticas de hoy en d&iacute;a. Pero 
ning&uacute;n soluci&oacute;n comercial es m&aacute;s abierta que una que
incluya el c&oacute;digo fuente de todo el sistema, incluyendo el kernel 
adem&aacute;s de todos los daemons del sistema, programas y utilidades. Puedes
modificar cualquier parte de FreeBSD para acomodarlo a tus necesidades 
personales, de organizaci&oacute;n o corporativas.</p>

<p>Con su generosa <A HREF="&base/copyright/license.html"> pol&iacute;tica de
licencias</a>, puedes usar FreeBSD como base para culquier tipo de <i>aplicaci&oacute;n</i> tanto comercial como libre.</p>
</blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">FreeBSD&nbsp;ejecuta
miles de aplicaciones.</FONT></FONT>

<blockquote>
<p>Por que FreeBSD est&aacute; basado en 4.4BSD, una versi&oacute;n est&aacute;ndar
de UNIX en la industria, es f&aacute;cil compilar y ejecutar programas.
FreeBSD tambi&eacute;n incluye una extensa <A HREF="&base/where.html"> 
colecci&oacute;n de packages</a> y <A HREF="&base/ports/index.html">
colecci&oacute;n de ports</a> que ofrecen software precompilado y f&aacute;cil
de instalar. Existe tambi&eacute;n un gr&aacute;n n&uacute;mero de
<A HREF="&base/commercial/commercial.html">aplicaciones comerciales</a>
escritas para FreeBSD</p>

<p>Aqu&iacute; tienes algunos ejemplos de los entornos en los que FreeBSD
es usado:</p>

<ul>
<li><b>Servicios Internet.</b> Muchos proveedores de Internet (ISPs) encuentran
en FreeBSD la plataforma ideal para ofrecer servicios WWW, News, FTP, Email y otros. Software "Ready-to-run" como el servidor web <A HREF="http://www.apache.org/">Apache</A> o el servidor FTP Wu-ftpd hacen realmente sencillo poner en
marcha un servidor de servicios Internet. Por supuesto, con la potencia de
<A HREF="&base/internet.html">networking</a> de FreeBSD, tus usuarios 
disfrutar&aacute;n de alta velocidad y servicios fiables.</li>

<li><b>Estaci&oacute;n de trabajo X Window. </b>Desde un barato terminal X hasta un avanzado monitor X, FreeBSD responde. <A HREF="http://www.xig.com/">Xi Graphics</A> ofrece software de aceleraci&oacute;n X para hardware gr&aacute;fico de
altas prestaciones (como Matrox), adem&aacute;s de estandares como librer&iacute;as Motif y OpenGL.</li>

<li><b>Networking. </b>Desde filtrado de paquetes hasta rutas o servicios de
resoluci&oacute;n de nombres, FreeBSD puede convertir cualquier PC en un 
excelente Firewall de Internet, servidor de correo, servidor de impresi&oacute;n, servidor PC/NFS y mucho m&aacute;s.</li>

<li><b>Desarrollo de software.</b> Cuenta con una suite de herramientas de desarrollo, incluyendo el compilador y debugger de GNU C/C++ y el lenguaje Perl. Los desarrollos en Java y Tcl/Tk tambi&eacute;n son posibles. Editores populares
como Xemacs y lenguajes de programaci&oacute;n m&aacute;s esot&eacute;ricos como Icon tambi&eacute;n est&aacute;n soportados. Y las librer&iacute;as compartidas siempre han sido f&aacute;ciles de hacer y usar.</li>

<li><b>Navegaci&oacute;n por la red.</b> Una verdadera estaci&oacute;n de trabajo UNIX es una gr&aacute;n "embarcaci&oacute;n" para la red, y la versi&oacute;n BSD de <A HREF="http://home.netscape.com/comprod/products/communicator/index.html">Netscape Navigator</a> com soporte de Java funciona en FreeBSD. Navega, publica tus propias p&aacute;ginas, lee las News y env&iacute;a y recibe correo con un sistema FreeBSD en tu m&acute;quina.</li>

<li><b>Educaci&oacute;n e investigaci&oacute;n</b>. &nbsp;FreeBSD es una excelente plataforma de investigaci&oacute;n por que incluye el c&oacute;digo fuente
completo. Estudiantes e investigadores de sistemas operativos pueden beneficiarse enormemente de este sistema abierto y bi&eacute;n documentado.</li>

<li><b>Y mucho m&aacute;s.</b> Accounting, juegos de acci&oacute;n, bases de datos, visualizaci&oacute;n cient&iacute;fica, v&iacute;deo conferencia, Internet Relay Chat (IRC), automatizaci&oacute;n del hogar, bbs's, escaneo de im&aacute;genes y m&aacute;s son todos usos reales de FreeBSD hoy. Si tienes alguna aplicaci&oacute;n innovadora para FreeBSD, <A HREF="http://www.freebsd.org/cgi/gallery.cgi"> haznoslo saber</a> para que podamos a&ntilde;dirla a nuestra <A HREF="&base/../gallery/gallery.html">galer&iacute;a</a>.</li>
</UL>
</blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">Un
sistema operativo que colmar&aacute; todas tus necesidades.</FONT></FONT>

<blockquote>
<p>Aunque FreeBSD es un software libre, es un software <i>soportado por usuarios</i>. Cualquier pregunta que tengas puede ser enviada a cientos de desarrolladores de FreeBSD y usuarios a la lista de distribuci&oacute;n <A HREF="mailto:freebsd-questions@FreeBSD.ORG">freebsd-questions@FreeBSD.ORG</A>.</p>

<p>FreeBSD tiene un completo grupo a nivel mundial de programadores y desarrolladores que se encargan de fijar los posibles bugs, a&ntilde;adir nuevas caracter&iacute;sticas y documentar el sistema. Soporte de nuevos dispositivos y opciones especiales se incluyen en el proceso de desarrollo constante, manteniendo una atenci&oacute;n especial a los problemas que afectan a la estabilidad del sistema.</p>
</blockquote>

<H2>Lo que dicen los expertos. . .</H2>

<blockquote>
<P><I>``FreeBSD handles [our] heavy load quite well and it is nothing short
of amazing. Salutations to the FreeBSD team.''</I></P>

<DIV ALIGN=right><P>---Mark Hittinger, administrator of WinNet Communications,
Inc.</P></DIV>
</blockquote>

&footer;
</BODY>
</HTML>
