<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Avances Tecnol&oacute;gicos de FreeBSD">
<!ENTITY % includes SYSTEM "includes.sgml"> %includes;
]>
<!-- $FreeBSD$ -->

<HTML>
&header;

<H1>FreeBSD ofrece diferentes caracter&iacute;sticas avanzadas.</H1>

<blockquote>
<p>No importa que aplicaci&oacute;n quieras que use los recursos del sistema
aprovech&aacute;ndolos al m&aacute;ximo. Las avanzadas caracter&iacute;sticas
de FreeBSD se encargar&aacute;n de ello.</p>
</blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">Un
 sistema operativo completo basado en 4.4BSD.</FONT></FONT>

<blockquote>
<p>Las raices de FreeBSD derivan de la &uacute;ltima release de software del
Computer Systems Research Group de la Universidad de California, Berkeley. El
libro <I>The Design and Implementation of 4.4BSD Operating System</I>,
escrito por los arquitectos del sistema 4.4BSD, describe en detalle muchas
de las funcionalidades del n&uacute;cleo de FreeBSD.</p>

<p>Gracias al nivel y experiencia de diversos grupos de desarrolladores de
todo el mundo, el proyecto FreeBSD ha trabajado para extender las 
caracter&iacute;sticas y posibilidades del sistema operativo 4.4BSD, 
consiguiendo en cada nueva release un sistema operativo m&aacute;s estable,
r&aacute;pido y conteniendo nuevas funcionalidades creadas a demanda de los
usuarios.</p>
</blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">
FreeBSD ofrece el m&aacute;s alto rendimiento, gran compatibilidad con otros
sistemas operativos y una menor administraci&oacute;n del sistema.
</FONT></FONT>

<blockquote>
<p>Los desarrolladores de FreeBSD se han enfrentado a algunos de los problemas
m&aacute;s dif&iacute;ciles en el dise&ntilde;o de sistemas operativos para
poder ofrecerte estas avanzadas caracter&iacute;sticas:</p>

<ul>
<LI><B>Bounce buffering</B> trata sobre la limitaci&oacute;n en la 
arquitectura ISA de los PC's que limita el acceso directo a memoria en los
primeros 16 megabytes.<p><i>Resultado:</i> sistemas con m&aacute;s de 
16 megabytes operan m&aacute;s eficientemente con perif&eacute;ricos DMA
en el bus ISA.</li>

<li><b>Un buffer de cach&eacute; conjunto de memoria virtual y sistema de 
ficheros</b> continuamente ajusta la cantidad de memoria usada por los 
programas y el cache de disco.<p><i>Resultado:</i> los programas reciben
una excelente gesti&oacute;n de memoria y un alto rendimiento en los accesos
a disco, liberando al administrador del sistema del trabajo de ajustar los
tama&ntilde;os de los cach&eacute;s.</li>

<li><b>M&oacute;dulos de compatibilidad</b> que permiten la ejecuci&oacute;n de
programas de otros sistemas operativos en FreeBSD, incluyendo programas para
Linux, SCO, NetBSD y BSDI.
<p><i>Resultado:</i>&nbsp;los usuarios no tendr&aacute;n que recompilar 
programas ya compilados para algunos de los sistemas compatibles, teniendo
acceso a programas como las extensiones para BSDI de
<a href="http://www.microsoft.com/FrontPage/">Microsoft FrontPage Server</a> o
<a href="http://www.corel.com/products/unix/wpunix/index.htm">WordPerfect</a>
para SCO y Linux.</LI>

<li><b>M&oacute;dulos de kernel de carga din&aacute;mica</b> que permiten 
tener acceso a nuevos sistemas de ficheros, protocolos de red o emuladores
de binarios en tiempo de ejecuci&oacute;n sin necesidad de generar un 
nuevo kernel. <p><i>Resultado:</i> Se puede ganar mucho tiempo y 
desarrolladores de terceras partes pueden ofrecer subsistemas completos
como m&oacute;dulos de kernel sin necesidad de distribuir el c&oacute;digo
fuente o complejos procedimientos de instalaci&oacute;n.</li>

<li><b>Librer&iacute;as compartidas</b> reducen el tama&ntilde;o de los
programas, ahorrando espacio de disco y memoria. FreeBSD usa un avanzado 
esquema de librer&iacute;as compartidas que ofrecen muchas de las ventajas
de ELF, ofreciendo la versi&oacute;n actual compatibilidad ELF con 
programas de Linux y nativos de FreeBSD.</li>
</ul>

<p>Naturalmente, c&oacute;mo FreeBSD es un esfuerzo en constante
evoluci&oacute;n, puedes esperar nuevas caracter&iacute;sticas y niveles
m&aacute;s altos de estabilidad con cada release.</p>
</blockquote>

<H2>Lo que dicen los expertos . . .</H2>

<blockquote>
<P><I>``FreeBSD has an outline-structured visual configuration editor ...
you can enter the configuration of every device the OS supports and can
therefore get a successful installation on the first try almost every time.
IBM, Microsoft, and others would do well to emulate FreeBSD's approach.''</I></P>

<DIV ALIGN=right><P>---Brett Glass, <I>Infoworld</I>, April 8 1996.</P></DIV>
</blockquote>

&footer;
</BODY>
</HTML>
