<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY date "$FreeBSD$">
<!ENTITY title "Gesti&oacute;n de red de FreeBSD">
<!ENTITY % includes SYSTEM "includes.sgml"> %includes;
]>
<!-- $FreeBSD$ -->

<HTML>
&header;

<H1>FreeBSD fue dise&ntilde;ado para Internet</H1>

<blockquote><P>FreeBSD incluye lo que muchos consideran la 
<i>implementac&oacute;n de referencia</i> de TCP/IP, el stack 4.4BSD del 
protocolo TCP/IP, haciendolo ideal para aplicaciones de red e Interenet.
</P></blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">
FreeBSD soporta los protocolos estandar TCP/IP.</FONT></FONT>

<blockquote>
<p>Como muchos sistemas UNIX, el sistema operativo FreeBSD te permite</p>

<UL>
<LI>Compartir ficheros mediante NFS</LI>

<LI>Distribuci&oacute;n de informaci&oacute;n de red con NIS</LI>

<LI>Soporte de logins remotos</LI>

<LI>Gesti&oacute;n y configuraci&oacute;n remota v&iacute;a SNMP</LI>

<LI>Servidor de ficheros FTP</LI>

<LI>Resoluci&oacute;n de nombres de m&aacute;quinas con DNS/BIND</LI>

<li>Rutar paquetes entre m&uacute;ltiples interfaces, incluyendo 
l&iacute;neas PPP y SLIP</li>

<LI>Servicios IP Multicast (MBONE)</LI>
</ul>

<p>FreeBSD te permite convertir un PC en un servidor World Wide Web o
servidor de news, con el software ya incluido. Usando el software incluido 
SAMBA puedes compartir discos e impresoras con tus m&aacute;quinas Win95 y
NT, adem&aacute;s de soportar m&aacute;quinas con PC/NFS gracias al 
daemon de autentificaci&oacute;n PCNFS. FreeBSD tambi&eacute;n soporta
los protocolos de red Appletalk y Novell en modo cliente/servidor, haciendo
de este sistema una verdadera soluci&oacute;n de servicios Intranet.</p>

<p>FreeBSD tambi&eacute;n gestiona extensiones TCP como la extensi&oacute;n de
alto rendimiento <A HREF="http://www.cis.ohio-state.edu/htbin/rfc/rfc1323.html">RFC-1323</A> y la extensi&oacute;n 
<A HREF="http://www.cis.ohio-state.edu/htbin/rfc/rfc1644.html">RFC-1644</A>
para transacciones, adem&aacute;s de SLIP y PPP bajo demanda. Es un sistema
que responde a las expectativas tanto del usuario dom&eacute;stico como del
administrador de sistemas corporativo.</p>
</blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">El
sistema de red de FreeBSD es r&aacute;pido y estable.</FONT></FONT>

<blockquote>
<p>Si necesitas una plataforma para servicios de Internet que ofrezca el
mejor rendimiento bajo fuertes cargas de trabajo, considera FreeBSD. 
Aqu&iacute; est&aacute;n solo algunas de las compa&ntilde;&iacute;as que
usan FreeBSD diariamente:</p>

<UL>
<LI><A HREF="http://www.cdrom.com/">Walnut Creek CD-ROM</A> en las afueras
de San Francisco mantiene en funcionamiento uno de los 
<A HREF="ftp://ftp.cdrom.com/">servidores FTP</A> m&aacute;s populares de
Internet, soportando 3600 conexiones simult&aacute;neas. Su servidor es una
&uacute;nica m&aacute;quina con FreeBSD transfiriendo m&aacute;s de 7 
terabytes (en Noviembre de 1997); si son <i>terabytes</i>, cada mes. Los
<A HREF="ftp://ftp.cdrom.com/archive-info/wcarchive.txt">detalles de
configuraci&oacute;n</a> est&aacute;n disponibles para aquellos interesados
en sistemas similares.</li> 

<li><A HREF="http://www.yahoo.com/">Yahoo Inc.</A> gestiona el &iacute;ndice
de Internet m&aacute;s usado, sirviendo enormes cantidades de 
informaci&oacute;n diariamente a los usuarios de Internet. Yahoo, y las
compa&ntilde;&iacute;as que usan su buscador, utilizan FreeBSD como 
plataforma de sus servidores Web.</li>

<li>Si esto no es suficiente, visita nuestra
<A HREF="&base/../gallery/gallery.html">galer&iacute;a</a> de usuarios 
satisfechos con FreeBSD.</li>
</ul>

<p>FreeBSD es la plataforma ideal para estos y otros servicios de Internet:</p>

<ul>
<LI>Servicios WWW</LI>

<LI>Servicios Proxy WWW</LI>

<LI>Servicios de FTP</LI>

<LI>Servicios de ficheros e impresi&oacute;n</LI>
</ul>

<p>La <A HREF="&base/ports/index.html">colecci&oacute;n de ports</a> contiene
software listo para funcionar que hace m&aacute;s f&aacute;cil la 
puesta en marcha de tus servidores de Interent.</p>
</blockquote>

<HR ALIGN=LEFT NOSHADE WIDTH="100%"><FONT COLOR="#FF0000"><FONT SIZE="+1">Alto
rendimiento <em>y</em> seguridad.</FONT></FONT>

<blockquote>
<p>El equipo de desarrollo de FreeBSD est&aacute; tan comprometido con la
seguridad como con el rendimiento. FreeBSD incluye en el kernel soporte de 
firewall IP, adem&aacute;s de otros servicios como gateways e IP proxy. Si
conectas tu servidor corporativo en Internet, cualquier PC 386 (o superior)
funcionando con FreeBSD puede actuar como firewall de red para protegerte
de ataques externos.</p>

<p>Software de encriptaci&oacute;n, shells seguras, Kerberos, 
encriptaci&oacute;n punto a punto y RPC seguro tambi&eacute;n est&aacute;n 
disponibles (sujetas a restricciones de exportaci&oacute;n).</p>

<p>Adem&aacute;s, el equipo de FreeBSD est&aacute; continuamente investigando
y comunicando informaciones de seguridad con un 
<a href="mailto:security-officer@FreeBSD.ORG">responsable de seguridad</a> y
el Computer Emergency Response Team (<A HREF="http://www.cert.org/">CERT</A>).
</P>
</blockquote>

<H2>Qu&eacute; dicen los expertos . . .</H2>

<blockquote>
<P><I>``FreeBSD ... provides what is probably the most robust and capable
TCP/IP stack in existence ...''</I></P>

<DIV ALIGN=right><P>---Michael O'Brien, <I>SunExpert </I>August 1996 volume
7 number 8.</P></DIV>
</blockquote>

&footer;
</BODY>
</HTML>
