<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN" [
<!ENTITY date "$FreeBSD$">
<!ENTITY title 'Compatibilidad a&ntilde;o  2000 ("Millennium Bug")'>
<!ENTITY % includes SYSTEM "includes.sgml"> %includes;
]>
<!-- $FreeBSD$ -->

<html>
&header;

    <p>A medida que se va entendiendo el problema del a&ntilde;o 2000,
      m&aacute;s y m&aacute;s compa&ntilde;&iacute;as est&aacute;n 
      demandando informes oficiales de los proveedores de hardware y
      software, de como sus productos responder&aacute;n frente al cambio
      de milenio.</p>

    <p>Las organizaciones que usan sistemas operativos unix como FreeBSD
      est&aacute;n un paso por delante del problema. FreeBSD mantendr&aacute;
      sin problemas las fechas posteriores al a&ntilde;o 2000.</p>

<h2>M&aacute;s informaci&oacute;n</h2>

    <p><i>(Esta secci&oacute;n est&aacute; basada en el texto de <a
     href="http://www.linux.org.uk/mbug.html">Linux Y2K compliance
     </a>)</i></p> 
    
    <p>Como en todos los sistemas operativos Unix, la hora y fecha se 
      representa internamente como el n&uacute;mero de segundos transcurridos
      desde el 1 de Enero de 1970 (la "&eacute;poca" Unix). Actualmente,
      esta figura se almacena en un entero de 32 bits, desbordandose sobre
      el a&ntilde;o 2038. Para entonces esperamos (seguro) usar un contador
      de 64 bits (o mayor) el cual no dar&iacute;a problemas hasta el fin
      del universo.</p>

    <p>Ten en cuenta que un sistema operativo sin el problema Y2K no 
      solucionar&aacute; las aplicaciones que no sean Y2k.</p>

    <p>De la misma manera, el sistema operativo espera leer la fecha y hora
      actual del reloj CMOS de tu ordenador. No todos estos dispositivos
      manejan correctamente el a&ntilde;o 2000. Recomendamos que testees cada
      plataforma independientemente para asegurar que el reloj de tu hardware
      soporta sin problemas el paso del a&ntilde;o 1999 al 2000, y que 
      &eacute;ste es interpretado correctamente.</p>

<h2>Qu&eacute; puedes hacer.</h2>

      <p>FreeBSD continuar&aacute;a manteniendo correctamente tanto la 
      fecha como la hora durante el pr&oacute;ximo siglo. Aplicaciones
      de terceras partes, quiz&aacute;s no lo hagan. Tu mejor defensa
      frente a los problemas del 2000 es un buen ataque. Escuchar las
      historias clamando el final del mundo pensamos que <strong>no</strong>
      es la mejor manera de hacer frente al problema. El proyecto FreeBSD
      te recomienda realizar comprobaciones de tus sistemas antes de
      la llegada del 2000.</p>

      <p>Hay tests que puedes usar para comprobar la respuesta de tu
      sistema. Pon el reloj de tu ordenador a unos minutos antes de la
      media noche del nuevo a&ntilde;o y comprueba la fecha. Tu sistema
      deber&iacute;a mostrar el a&ntilde;o 2000 y no el 1900. Si el 
      a&ntilde;o mostrado es incorrecto, tendr&aacute;s bastante tiempo
      por delante para actualizar el hardware. Operar los sistemas de
      informaci&oacute;n de tu organizaci&oacute;n durante unos 
      d&iacute;as con la fecha adelantada, puede darte una idea real de
      lo que ocurrir&aacute; en el cambio del a&ntilde;o.</p>

    <blockquote>
      <strong>Importante:</strong> <strong>No</strong> hagas esto en 
      sistemas en producci&oacute;n. Puedes confundir y tener muchos 
      problemas en aplicaciones que utilizan las fechas (sistemas de
      facturaci&oacute;n, reg&iacute;menes de copias, etc). Utiliza siempre
      para este tipo de pruebas m&aacute;quinas de desarrollo las cuales no
      puedan afectar datos importantes.
    </blockquote>


    <h2>Estado del Y2K en FreeBSD</h2>
    
    <blockquote>
     <p>
     "Despu&eacute;s de extensos an&aacute;lisis y tests, creemos que FreeBSD
      es 100% compatible con el Y2K. En caso de que algo se nos haya pasado
      por alto, haremos todo lo posible para fijar el problema lo antes
      posible."
    </p>
      
    <p align="right">David Greenman<br>Arquitecto Principal, The
	FreeBSD project</p>
    </blockquote>

    <h2>Problemas solucionados</h2>
    
    <p>Los siguientes problemas Y2K han sido identificados y solucionados
      en FreeBSD.</p>

    <dl>
      <dt><a
	  href="http://www.freebsd.org/cgi/query-pr.cgi?pr=1380">misc/1380</a></dt>
      <dd>Muchos programas ten&iacute;an incluido de manera fija el formato
        19%d para el a&ntilde;o. Los programas afectados incluyen: yacc, ftpd,
        y make.
        [Solucionado: yacc v1.2 1999/01/18; ftpd v1.7 1996/08/05;
        make v1.4 1996/10/06] </dd>

      <dt><a
	  href="http://www.freebsd.org/cgi/query-pr.cgi?pr=1382">conf/1382</a></dt>
      <dd>El script sed de /etc/rc.local que crea la l&iacute;nea del 
        host/kernel ID para el mensaje del d&iacute;a depende de que el 
        a&ntilde;o no sobrepase el 1999. [Solucionado: v1.21 1996/10/24]</dd>

      <dt><a
	  href="http://www.freebsd.org/cgi/query-pr.cgi?pr=3465">misc/3465</a></dt>
      <dd>El comando etc/namedb/make-localhost genera el n&uacute;mero
        serial del DNS como YYMMDD. En el a&ntilde;o 2000, &eacute;ste
        ser&aacute; generado como 1YYMMDD.[Solucionado v1.2 1997/08/11]</dd>

      <dt><a
	  href="http://www.freebsd.org/cgi/query-pr.cgi?pr=4930">gnu/4930</a> y
	  <a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=8321">gnu/8321</a></dt>
      <dd>Las macros groff ten&iacute;an integrado 19 para generar algunas
         fechas.
         [Solucionado: tmac.e v1.3 1998/12/06; doc-common v1.10 1999/01/19]</dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9323">bin/9323</a>
</dt>

      <dd>El comando touch no trata correctamente los dos digitos del
        a&ntilde;o. Los a&ntilde;os en el rango 00-68 son tratados como
        1900-1968 en lugar de 2000-2068. [Solucionado: v1.7 1999/01/05]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/cvsweb.cgi/src/usr.sbin/xntpd/parse/util/dcfd.c">xntpd/parse/util/dcfd.c</a></dt>
      <dd>El c&aacute;lculo de a&ntilde;os bisiestos para el n&uacute;mero de 
        d&iacute;as en un a&ntilde;o, y la conversi&oacute;n del tiempo DFC77 
        a segundos desde el Epoch era incorrecta. Estos errores afectaban a 
        todos los a&ntilde;os. [Solucionado: v1.6 1999/01/12]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/cvsweb.cgi/src/gnu/usr.bin/tar/getdate.y.diff?r1=1.3&amp;r2=1.4">tar/getdate.y</a></dt>
      <dd>La funci&oacute;n convert() ten&iacute;a fijado el uso de dos
        d&iacute;gitos en el a&ntilde;o para el rango 70-99. Ha sido ajustada
        para permitir a&ntilde;os de dos d&iacute;gitos para for 1970-2069.
        La funci&oacute;n no permite usar a&ntilde;os bisiestos - 
        alerta y2k1!. [Solucionado: v1.4 1999/01/12]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/cvsweb.cgi/src/usr.bin/fetch/http.c.diff?r1=1.22&amp;r2=1.24">fetch/http.c</a></dt>
      <dd>El protocolo HTTP incluye un formato de fecha obsoleto que usa un
        a&ntilde;o de dos d&iacute;gitos. Las versiones anteriores de fetch
        interpretaban todas las fechas en 1900s; con esta revisi&oacute;n, se
        usa la recomendaci&oacute;n de la
        <a href="ftp://ftp.cdrom.com/pub/internet/rfc/rfc2068.txt">RFC
        2068</a>. [Solucionado: v1.24 1999/01/15]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9500">misc/9500</a></dt>
      <dd>El script `edithook' en el directorio CVSROOT usa tm_year y
        mostrar&iacute;a 01/01/100 en el 2000-JAN-01. 
        [Solucionado: v1.2 1999/01/17]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9501">bin/9501</a></dt>
      <dd>Muchos de los ficheros "cvs contrib" tienen el problema del 
        a&ntilde;o 2000. Los scripts log.pl y sccs2rcs.csh a&ntilde;aden 19
        al a&ntilde;o, resultando en mostrar 19100 para el 2000. El script
        log_accum.pl usa un a&ntilde;o de 2 d&iacute;gitos en un lugar y en
        otro asume que tm_year es el a&ntilde;o dentro del siglo en lugar
        de a&ntilde;o desde 1900.
        [Solucionado: log.pl v1.2 1999/01/15; sccs2rcs.csh v1.3 1999/01/15]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9502">bin/9502</a></dt>
      <dd>El registro num&eacute;rico de groff `yr' es asignado desde 
        (struct tm).tm_year representando el n&uacute;mero de a&ntilde;os desde
        1900, no el a&ntilde;o dentro del siglo (mirar la definici&oacute;n en
        troff/input.cc).
        [Solucionado: ahora usa mod 100, input.cc V1.2 1999/06/03] 
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9503">bin/9503</a></dt>
      <dd>El programa simple_httpd de PicoBSD usa tm_year y mostrar&aacute;
        01/01/100 para 2000-JAN-01.
        [Solucionado: v1.2 1999/01/16]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9505">bin/9505</a></dt>
      <dd>Adduser usa tm_year y mostrar&aacute; 01/01/100 para 2000-JAN-01.
        [Solucionado: v1.42 1999/01/15]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9506">bin/9506</a></dt>
      <dd>Cron usa tm_year y mostrar&aacute; 01/01/100 para 2000-JAN-01.
        [Solucionado: v1.7 1999/01/16]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9507">bin/9507</a></dt> 
      <dd>tcpslice(8) usa tm_year y mostrar&aacute;a 100y01m01d... para
        2000-JAN-01. Por compatibilidad, usa un a&ntilde;o de dos 
        d&iacute;gitos hasta el 2000. [Solucionado: v1.8 1999/01/20]
      </dd>

    </dl>
    
    <h2>Aplicaciones Problem&aacute;ticas</h2>

    <dl>
      <dt><a
	  href="http://www.freebsd.org/cgi/query-pr.cgi?pr=7681">ports/7681</a></dt>
      <dd>TkDesk 1.0 tiene integrado un 19 en el fichero de lista de 
        ventanas. Un fichero con fecha &gt 2000 se muestra como
        "191xx" donde xx son los dos &uacute;ltimos n&uacute;ros de la
        fecha real. Este error ha sido fijado en la versi&oacute;n 1.1.
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9295">ports/9295</a></dt>

      <dd>INN 1.7.2 tiene varios problemas relacionados con Y2K. Uno ocurre
        cuando purgamos las news (option -f del nntpget) y otro est&aacute;
        relacionado con la cabecera Expire con fechas relativas pasado el
        a&ntilde;o 2000.
        [Ports INN actualizados a INN 2.2 1999/05/02]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9298">ports/9298</a></dt> 
      <dd>Knews tiene varios problemas relacionados con Y2K. Uno ocurre 
        durante la generaci&oacute;n del comando NNTP NEWGROUPS. El otro ocurre
        por que knews no piensa que el 2000 es una a&ntilde;o bisiesto. Ambos
        est&aacute;n solucionados en knews-1.0b.1. [Port actualizado 1999/01/07]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=9300">ports/9300</a></dt>
      <dd>Nntp-t5 tiene un problema de Y2K durante la generaci&oacute;n del 
        comando NEWNEWS. [Port parcheado 1999/01/05]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=11144">ports/11144</a></dt>
      <dd>El port tiff tiene fijado 19xx. Aunque est&eacute; en la 
        secci&oacute;n contrib (para convertir el formato de SUN a TIFF), y
        no es instalado por defecto, deber&iacute;a ser solucionado.
        [Solucionado: 1999/04/18]
      </dd>

      <dt><a href="http://www.freebsd.org/cgi/query-pr.cgi?pr=11145">ports/11145</a></dt>
      <dd>El port dgs tiene el mismo problema que el port tiff.
        [Solucionado: 1999/04/18]
      </dd>

    </dl>



    <h2>M&aacute;s informaci&oacute;n</h2>

    <p>Si tienes alguna pregunta sobre la compatibilidad de FreeBSD con el
      a&ntilde;o 2000, o has descubierto alguna aplicaci&oacute;n ejecutada
      bajo FreeBSD que no cumple con Y2K, por favor, ponte en contacto con
      nosotros en la direcci&oacute;n <a
      href="mailto:freebsd-bugs@FreeBSD.ORG">freebsd-bugs@FreeBSD.ORG</a>.</p>

&footer;
</body>
</html>

