Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-15/articles/bsdl-gpl/*.po
Languages: it_it

source: Large companies, in which Open Source code is developed, should be aware that programmers appreciate Open Source because it leaves the software available to the employee when they change employers. Some companies encourage this behavior as an employment perk, especially when the software involved is not directly strategic. It is, in effect, a front-loaded retirement benefit with potential lost opportunity costs but no direct costs. Encouraging employees to work for peer acclaim outside the company is a cheap portable benefit a company can sometimes provide with near zero downside.
it_it: Grandi aziende, in cui viene sviluppato codice Open Source, dovrebbero essere a conoscenza del fatto che i programmatori apprezzano l'Open Source perché lascia il software disponibile all'impiegato quando cambiano datore di lavoro. Alcune aziende incoraggiano questo comportamento come un vantaggio dell'impiego, soprattuto quando il software in questione non è direttamente strategico. Si tratta, in effetti, di un benificio anticipato dell'interruzione del rapporto di lavoro con costi di perdita potenziali ma senza costi diretti. Incoraggiare gli impiegati a lavorare per colleghi al di fuori dell'azienda è un beneficio trasferibile poco costoso che un'azienda può a volte fornire quasi senza svantaggi.

source: Small companies with software projects vulnerable to orphaning should attempt to use the BSD license when possible. Companies of all sizes should consider forming such Open Source projects when it is to their mutual advantage to maintain the minimal legal and organization overheads associated with a true BSD-style Open Source project.
it_it: Piccole aziende con progetti software vulnerabili all'orphaning dovrebbero cercare di usare la licenza BSD quando possibile. Aziende di tutte le dimensioni dovrebbero considerare di formare tali progetti Open Source quando il mantenimento al minimo dei problemi legali e dei costi generali associati ad un vero progetto Open Source in stile BSD costituisce un vantaggio per tutte le parti.

source: Non-profits should participate in Open Source projects when possible. To minimize software engineering problems, such as mixing code under different licenses, BSD-style licenses should be encouraged. Being leery of the GPL should particularly be the case with non-profits that interact with the developing world. In some locales where application of law becomes a costly exercise, the simplicity of the new BSD license, as compared to the GPL, may be of considerable advantage.
it_it: Le organizzazioni senza fini di lucro dovrebbero partecipare a progetti Open Source quando possibile. Per evitare problemi di programmazione del software, come il mescolamento di codici sottoposti a licenze diverse, bisognerebbe incoraggiare l'uso di licenze in stile BSD. Essere cauti con la GPL è particolarmente indicato nel caso di organizzazioni senza scopo di lucro che interagiscono con il mondo della programmazione. In località in cui l'applicazione della legge diventa un esercizio costoso, la semplicità della nuova licenza BSD, paragonata alla GPL, può costituire un vantaggio considerevole.

source: Conclusion
it_it: Conclusione

source: In contrast to the GPL, which is designed to prevent the proprietary commercialization of Open Source code, the BSD license places minimal restrictions on future behavior. This allows BSD code to remain Open Source or become integrated into commercial solutions, as a project's or company's needs change. In other words, the BSD license does not become a legal time-bomb at any point in the development process.
it_it: Al contrario della GPL, che è progettata per impedire la commercializzazione proprietaria di codice Open Source, la licenza BSD pone restrizioni minime su comportamenti futuri. Questo consente al codice BSD di rimanere Open Source o di venire integrato in soluzioni commerciali, dato che i bisogni di un progetto o di un'azienda cambiano. In altre parole, la licenza BSD non diventa una bomba ad orologeria legale in nessun punto del processo di sviluppo.

source: In addition, since the BSD license does not come with the legal complexity of the GPL or LGPL licenses, it allows developers and companies to spend their time creating and promoting good code rather than worrying if that code violates licensing.
it_it: Inoltre, siccome la licenza BSD non comporta la complessità legale delle licenze GPL e LGPL, consente ai programmatori e alle aziende di impiegare il loro tempo nel creare e promuovere codice di qualità invece di preoccuparsi riguardo alla possibilità che tale codice violi qualche licenza.

source: Bibliographical References
it_it: Riferimenti bibliografici

source: [1] http://www.gnu.org/licenses/gpl.html [2] http://archives.cnn.com/2000/TECH/computing/03/28/cyberpatrol.mirrors/ [3] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Quotes are from page 114, ``Effects of the GNU GPL''. [4] In the "What License to Use?" section of http://www.oreilly.com/catalog/opensources/book/brian.html This whitepaper is a condensation of an original work available at http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
it_it: [1] http://www.gnu.org/licenses/gpl.html [2] http://archives.cnn.com/2000/TECH/computing/03/28/cyberpatrol.mirrors/ [3] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Citazioni da pagina 114, ``Effects of the GNU GPL''. [4] Nella sezione "What License to Use?" di http://www.oreilly.com/catalog/opensources/book/brian.html Questo documento è un riassunto del lavoro originale disponibile a http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
