Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-15/articles/bsdl-gpl/*.po
Languages: it_it

# _
source: translator-credits
it_it: Lorenzo Salvadore, salvadore@Freebsd.org, 2020

source: Why you should use a BSD style license for your Open Source Project
it_it: Perché dovresti usare una licenza in stile BSD per il tuo progetto Open Source

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
it_it: FreeBSD è un marchio registrato della FreeBSD Foundation.

source: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium, and Xeon are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries.
it_it: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium e Xeon sono marchi o marchi registrati di Intel Corporation o dei suoi affiliati negli Stati Uniti o in altri paesi.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
it_it: Molte denominazioni usate dai produttori e dai rivenditori per distinguere i loro prodotti sono rivendicati come marchi. Laddove queste denominazioni appaiono in questo documento e il Progetto FreeBSD è al corrente della rivendicazione del marchio, le denominazioni sono state fatte seguire dai simboli <quote>™</quote> o da <quote>®</quote>.

source: Introduction
it_it: Introduzione

source: This document makes a case for using a BSD style license for software and data; specifically it recommends using a BSD style license in place of the GPL. It can also be read as a BSD versus GPL Open Source License introduction and summary.
it_it: Questo documento promuove l'uso di una licenza in stile BSD per programmi e dati; in particolare raccomanda l'uso di una licenza in stile BSD al posto della GPL. Esso può anche essere interpretato come un'introduzione e un riassunto comparativo delle licenze Open Source BSD e GPL.

source: Very Brief Open Source History
it_it: Storia molto breve dell'Open Source

source: Long before the term <quote>Open Source</quote> was used, software was developed by loose associations of programmers and freely exchanged. Starting in the early 1950's, organizations such as <link xlink:href="http://www.share.org">SHARE</link> and <link xlink:href="http://www.decus.org">DECUS</link> developed much of the software that computer hardware companies bundled with their hardware offerings. At that time computer companies were in the hardware business; anything that reduced software cost and made more programs available made the hardware companies more competitive.
it_it: Molto prima che il termine <quote>Open Source</quote> fosse usato, esisteva del software che veniva sviluppato da associazioni informali di programmatori e che veniva liberamente scambiato. A cominciare dai primi anni Cinquanta, organizzazioni quali <link xlink:href="http://www.share.org">SHARE</link> e <link xlink:href="http://www.decus.org">DECUS</link> sviluppavano molto del software che le aziende di hardware informatico vendevano incluso nelle loro offerte. In effetti, a quel tempo le aziende informatiche vendevano hardware; qualsiasi cosa che riducesse il costo del software e rendesse disponibile un maggior numero di programmi rendeva tali aziende più competitive.

source: This model changed in the 1960's. In 1965 ADR developed the first licensed software product independent of a hardware company. ADR was competing against a free IBM package originally developed by IBM customers. ADR patented their software in 1968. To stop sharing of their program, they provided it under an equipment lease in which payment was spread over the lifetime of the product. ADR thus retained ownership and could control resale and reuse.
it_it: Questo modello cambiò negli anni Sessanta. Nel 1965 ADR sviluppò il primo prodotto con licenza software indipendente dall'hardware dell'azienda. ADR competeva contro un pachetto gratuito dell'IBM originalmente sviluppato dai clienti di IBM. ADR brevettò il proprio software nel 1968. Per impedire la condivisione del suo programma, lo distribuì a condizione di noleggio di materiale il cui pagamento si estendeva per tutta la durata di vita del prodotto. ADR ne mantenne così la proprietà e poteva controllarne la rivendita e il riuso.

source: In 1969 the US Department of Justice charged IBM with destroying businesses by bundling free software with IBM hardware. As a result of this suit, IBM unbundled its software; that is, software became independent products separate from hardware.
it_it: Nel 1965 il Dipartimento di Giustizia degli Stati Uniti accusò IBM di concorrenza sleale offrendo software gratuito incluso nel prezzo di hardware IBM. In seguito al processo, IBM escluse il suo software; cioè, i programmi divennero prodotti separati dall'hardware.

source: In 1968 Informatics introduced the first commercial killer-app and rapidly established the concept of the software product, the software company, and very high rates of return. Informatics developed the perpetual license which is now standard throughout the computer industry, wherein ownership is never transferred to the customer.
it_it: Nel 1968 Informatics introdusse la prima applicazione di successo e rapidamente stabilì i concetti di prodotto software e azienda software, nonché alti tassi di ricavo. Informatics sviluppò la licenza perpetua che è ora uno standard nell'industria informatica e che prevede che la proprietà non venga mai trasferita al cliente.

source: Unix from a BSD Licensing Perspective
it_it: Unix dal punto di vista delle licenze BSD

source: AT&amp;T, who owned the original Unix implementation, was a publicly regulated monopoly tied up in anti-trust court; it was legally unable to sell a product into the software market. It was, however, able to provide it to academic institutions for the price of media.
it_it: AT&amp;T, prorietario dell'implementazione originale di Unix, era un monopolio pubblicamente regolato e vincolato da una causa antitrust; non poteva vendere legalmente prodotti nel mercato del software. Poteva, tuttavia, distribuire software ad istituzioni accademiche al prezzo del supporto.

source: Universities rapidly adopted Unix after an OS conference publicized its availability. It was extremely helpful that Unix ran on the PDP-11, a very affordable 16-bit computer, and was coded in a high-level language that was demonstrably good for systems programming. The DEC PDP-11 had, in effect, an open hardware interface designed to make it easy for customers to write their own OS, which was common. As DEC founder Ken Olsen famously proclaimed, <quote>software comes from heaven when you have good hardware</quote>.
it_it: Le università adottarono rapidamente Unix dopo che una conferenza sui sistemi operativi ne pubblicizzò la disponibilità. Fu estremamente utile il fatto che Unix girasse su PDP-11, un computer 16-bit molto economico, e fosse codificato in un linguaggio di alto livello che era dimostrabilmente buono per la programmazione di sistemi. Il DEC PDP-11 aveva, in effetti, un'interfaccia hardware aperta progettata per rendere facile per i propri clienti la scrittura dei propri sistemi operativi, un'operazione allora comune. Come il fondatore di DEC Ken Olsen proclamò con una celebre dichiarazione <quote>il software viene dal cielo quando hai un buon hardware</quote>.

source: Unix author Ken Thompson returned to his alma mater, University of California Berkeley (UCB), in 1975 and taught the kernel line-by-line. This ultimately resulted in an evolving system known as BSD (Berkeley Standard Distribution). UCB converted Unix to 32-bits, added virtual memory, and implemented the version of the TCP/IP stack upon which the Internet was essentially built. UCB made BSD available for the cost of media, under what became known as <quote>the BSD license</quote>. A customer purchased Unix from AT&amp;T and then ordered a BSD tape from UCB.
it_it: L'autore di Unix Ken Thompson tornò alla sua alma mater, l'Università di Berkeley in California (UCB), nel 1975 e tenne corsi sul kernel insegnandolo riga per riga. Questo risultò infine in un sistema in evoluzione noto come BSD (Berkeley Standard Distribution). L'UCB convertì Unix a 32-bit, aggiunse la memoria virtuale e implementò la versione dello stack TCP/IP sulla quale sostanzialmente fu costruito Internet. L'UCB rese BSD disponibile al costo del supporto, sotto quella che divenne nota come la <quote>licenza BSD</quote>. Un cliente comprava Unix da AT&amp;T e quindi ordinava un nastro BSD dall'UCB.

source: In the mid-1980s a government anti-trust case against AT&amp;T ended with the break-up of AT&amp;T. AT&amp;T still owned Unix and was now able to sell it. AT&amp;T embarked on an aggressive licensing effort and most commercial Unixes of the day became AT&amp;T-derived.
it_it: A metà degli anni Ottanta una causa antitrust del governo contro AT&amp;T si concluse con la divisione dell'azienda in diverse società. AT&amp;T possedeva ancora Unix ed era ora autorizzata a venderlo. AT&amp;T intraprese uno sforzo di licenziamento aggressivo a la maggior parte degli Unix commerciali di allora divennero derivati di AT&amp;T.

source: In the early 1990's AT&amp;T sued UCB over license violations related to BSD. UCB discovered that AT&amp;T had incorporated, without acknowledgment or payment, many improvements due to BSD into AT&amp;T's products, and a lengthy court case, primarily between AT&amp;T and UCB, ensued. During this period some UCB programmers embarked on a project to rewrite any AT&amp;T code associated with BSD. This project resulted in a system called BSD 4.4-lite (lite because it was not a complete system; it lacked 6 key AT&amp;T files).
it_it: Nei primi anni Novanta, AT&amp;T querelò l'UCB per violazione di licenza in relazione a BSD. L'UCB scoprì che AT&amp;T aveva incorporato, senza riconoscimento né pagamento, molti miglioramenti dovuti a BSD nei prodotti di AT&amp;T, e ne seguì una lunga causa, principalmente tra AT&amp;T e l'UCB. In questo periodo alcuni programmatori dell'UCB intrapresero un progetto di riscrittura di ogni codice AT&amp;T associato a BSD. Questo progetto risultò in un sistema chiamato BSD 4.4-lite (lite perché non era un sistema completo; mancavano 6 file AT&amp;T chiave).

source: A lengthy series of articles published slightly later in Dr. Dobbs magazine described a BSD-derived 386 PC version of Unix, with BSD-licensed replacement files for the 6 missing 4.4 lite files. This system, named 386BSD, was due to ex-UCB programmer William Jolitz. It became the original basis of all the PC BSDs in use today.
it_it: Una lunga serie di articoli pubblicati poco dopo nella rivista Dr. Dobbs descriveva una versione di Unix per PC 386 derivata da BSD, con file sotto licenza BSD per la sostituzione dei 6 file mancanti da 4.4-lite. Questo sistema, chiamato 386BSD, era opera del programmatore William Jolitz, in precedenza nell'UCB. Esso divenne la base originale di tutti i BSD per PC oggi in uso.

source: In the mid 1990s, Novell purchased AT&amp;T's Unix rights and a (then secret) agreement was reached to terminate the lawsuit. UCB soon terminated its support for BSD.
it_it: A metà degli anni Novanta, Novell comprò i diritti di Unix da AT&amp;T e fu trovato un accordo (allora segreto) per porre fine alla causa. L'UCB interruppe il supporto per BSD poco tempo dopo.

source: The Current State of FreeBSD and BSD Licenses
it_it: Lo stato attuale di FreeBSD e delle licenze BSD

source: The so-called <link xlink:href="http://www.opensource.org/licenses/bsd-license.php"> new BSD license</link> applied to FreeBSD within the last few years is effectively a statement that you can do anything with the program or its source, but you do not have any warranty and none of the authors has any liability (basically, you cannot sue anybody). This new BSD license is intended to encourage product commercialization. Any BSD code can be sold or included in proprietary products without any restrictions on the availability of your code or your future behavior.
it_it: La cosiddetta <link xlink:href="http://www.opensource.org/licenses/bsd-license.php">nuova licenza BSD</link> applicata a FreeBSD negli ultimi anni è di fatto una dichiarazione per la quale si può fare qualsiasi cosa col programma o il suo sorgente, ma non si riceve nessuna garanzia e nessuno degli autori ha nessuna responsabilità (sostanzialmente, non è possibile fare causa a nessuno). Questa nuova licenza BSD è intesa per incoraggiare la commercializzazione di prodotti. Qualsiasi codice BSD può essere venduto o incluso in prodotti proprietari senza restrizioni sulla disponibilità del codice o su comportamenti futuri.

source: Do not confuse the new BSD license with <quote>public domain</quote>. While an item in the public domain is also free for all to use, it has no owner.
it_it: Non si confondano la nuova licenza BSD con il <quote>dominio pubblico</quote>. Sebbene anche un oggetto di dominio pubblico sia libero di essere usato da chiunque, esso non ha proprietario.

source: The origins of the GPL
it_it: Le origini della GPL

source: While the future of Unix had been so muddled in the late 1980s and early 1990s, the GPL, another development with important licensing considerations, reached fruition.
it_it: Mentre il futuro di Unix era così farraginoso nei tardi anni Ottanta e nei primi anni Novanta, la GPL, un altro sviluppo con importanti considerazioni in materia di licenza, giunse a compimento.

source: Richard Stallman, the developer of Emacs, was a member of the staff at MIT when his lab switched from home-grown to proprietary systems. Stallman became upset when he found that he could not legally add minor improvements to the system. (Many of Stallman's co-workers had left to form two companies based on software developed at MIT and licensed by MIT; there appears to have been disagreement over access to the source code for this software). Stallman devised an alternative to the commercial software license and called it the GPL, or "GNU Public License". He also started a non-profit foundation, the <link xlink:href="http://www.fsf.org">Free Software Foundation</link> (FSF), which intended to develop an entire operating system, including all associated software, that would not be subject to proprietary licensing. This system was called GNU, for "GNU is Not Unix".
it_it: Richard Stallman, il programmatore di Emacs, era un membro del personale del MIT quando il suo laboratorio sostituì i suoi sistemi prodotti internamente con prodotti proprietari. Stallman si innervosì quando scoprì di non poter apportare legalmente piccoli miglioramenti al sistema. (Molti dei collaboratori di Stallman se ne erano andati per formare due aziende basate su software sviluppato al MIT e licenziato dal MIT; pare che ci sia stato disaccordo sull'accesso al codice sorgente di questo software). Stallman ideò un'alternativa alla licenza software commerciale e la chiamò GPL, o "Gnu Public License". Creò anche una fondazione senza scopo di lucro, la <link xlink:href="http://www.fsf.org">Free Software Foundation</link> (FSF), che intendeva sviluppare un intero sistema operativo, software associato incluso, che non sarebbe stato oggetto di licenza proprietaria. Il sistema fu chiamato GNU, stante per "GNU non è Unix".

source: The GPL was designed to be the antithesis of the standard proprietary license. To this end, any modifications that were made to a GPL program were required to be given back to the GPL community (by requiring that the source of the program be available to the user) and any program that used or linked to GPL code was required to be under the GPL. The GPL was intended to keep software from becoming proprietary. As the last paragraph of the GPL states:
it_it: La GPL fu progettata per essere l'antitesi della licenza proprietaria standard. A questo fine, si richiese che ogni modifica che fosse apportata ad un programma GPL fosse restituita alla comunità GPL (richiedendo che il sorgente del programma fosse reso disponibile all'utente) e che ogni programma che usasse o linkasse codice GPL venisse sottoposto alla GPL. La GPL intendeva impedire che il software diventasse proprietario. All'ultimo paragrafo la GPL dichiara:

source: <quote>This General Public License does not permit incorporating your program into proprietary programs.</quote>[1]
it_it: <quote>Questa Licenza Pubblica Generale non permette di incorporare il tuo programma in programmi proprietari.</quote>

source: The <link xlink:href="http://www.opensource.org/licenses/gpl-license.php">GPL</link> is a complex license so here are some rules of thumb when using the GPL:
it_it: La <link xlink:href="http://www.opensource.org/licenses/gpl-license.php">GPL</link> è una licenza complessa quindi ecco alcune regole pratiche sul suo utilizzo:

source: you can charge as much as you want for distributing, supporting, or documenting the software, but you cannot sell the software itself.
it_it: è possibile fissare qualsivoglia prezzo per la distribuzione, il supporto o la documentazione del software, ma non è possibile la vendita del software stesso.

source: the rule-of-thumb states that if GPL source is required for a program to compile, the program must be under the GPL. Linking statically to a GPL library requires a program to be under the GPL.
it_it: la regola generale stabilisce che se è necessario codice GPL per la compilazione di un programma, il programma deve essere sottoposto alla GPL. Il link statico ad una libreria GPL implica che il programma sia sottoposto alla GPL.

source: the GPL requires that any patents associated with GPLed software must be licensed for everyone's free use.
it_it: la GPL richiede che qualsiasi brevetto associato a software GPL debba essere sottoposto ad una licenza che ne garantisca il libero uso da parte di chiunque.

source: simply aggregating software together, as when multiple programs are put on one disk, does not count as including GPLed programs in non-GPLed programs.
it_it: la semplice aggregazione di software, come il porre programmi diversi su uno stesso disco, non conta quale inclusione di programmi GPL in programmi non GPL.

source: output of a program does not count as a derivative work. This enables the gcc compiler to be used in commercial environments without legal problems.
it_it: l'output di un programma non conta quale lavoro derivato. Questo consente al compilatore gcc di essere usato in ambienti commerciali senza problemi legali.

source: since the Linux kernel is under the GPL, any code statically linked with the Linux kernel must be GPLed. This requirement can be circumvented by dynamically linking loadable kernel modules. This permits companies to distribute binary drivers, but often has the disadvantage that they will only work for particular versions of the Linux kernel.
it_it: siccome il kernel Linux è sottoposto alla GPL, ogni codice linkato staticamente col kernel Linux deve essere sottoposto alla GPL. Questo requisito può essere aggirato linkando dinamicamente moduli del kernel. Questo permette alle aziende di distribuire driver binari, ma spesso con lo svantaggio che essi funzioneranno solo per versioni specifiche del kernel Linux.

source: Due in part to its complexity, in many parts of the world today the legalities of the GPL are being ignored in regard to Linux and related software. The long-term ramifications of this are unclear.
it_it: A causa della sua complessità, in molte parti del mondo oggigiorno gli aspetti legali della GPL vengono ignorati per quanto riguarda Linux e software relativo. Le conseguenze a lungo termine di questo approccio non sono chiare.

source: The origins of Linux and the LGPL
it_it: Le origini di Linux e della LGPL

source: While the commercial Unix wars raged, the Linux kernel was developed as a PC Unix clone. Linus Torvalds credits the existence of the GNU C compiler and the associated GNU tools for the existence of Linux. He put the Linux kernel under the GPL.
it_it: Mentre imperversavano le guerre tra gli Unix commerciali, il kernel Linux veniva sviluppato come un clone di Unix per PC. Linus Torvalds riconosce l'importanza del compilatore GNU C e degli strumenti GNU associati per l'esistenza di Linux. Egli sottopone il kernel Linux alla GPL.

source: Remember that the GPL requires anything that statically links to any code under the GPL also be placed under the GPL. The source for this code must thus be made available to the user of the program. Dynamic linking, however, is not considered a violation of the GPL. Pressure to put proprietary applications on Linux became overwhelming. Such applications often must link with system libraries. This resulted in a modified version of the GPL called the <link xlink:href="http://www.opensource.org/licenses/lgpl-license.php">LGPL</link> ("Library", since renamed to "Lesser", GPL). The LGPL allows proprietary code to be linked to the GNU C library, glibc. You do not have to release the source code which has been dynamically linked to an LGPLed library.
it_it: Si ricordi che la GPL impone che ogni cosa linkata staticamente ad un qualsiasi codice sottoposto alla GPL debba essere sottoposta anch'essa alla GPL. Il sorgente per questa cosa deve dunque essere reso disponibile all'utente del programma. Il link dinamico, tuttavia, non è considerato una violazione della GPL. La pressione per inserire applicazioni proprietarie in Linux divenne schiacciante. Tali applicazioni devono spesso effettuare link con librerie di sistema. Ciò portò ad una versione modificata della GPL chiamata <link xlink:href="http://www.opensource.org/licenses/lgpl-license.php">LGPL</link> ("Library", da allora rinominata "Lesser", GPL). La LGPL consente di linkare codice proprietario con la libreria C di GNU, glibc. Non è necessario rilasciare il codice sorgente che è stato linkato dinamicamente ad una libreria sottoposta alla LGPL.

source: If you statically link an application with glibc, such as is often required in embedded systems, you cannot keep your application proprietary, that is, the source must be released. Both the GPL and LGPL require any modifications to the code directly under the license to be released.
it_it: Se si linka staticamente un'applicazione con glibc, come è spesso necessario in sistemi integrati, non è possibile mantenere la propria applicazione proprietaria, vale a dire, il sorgente deve essere pubblicato. Sia la GPL che la LGPL impongono che ogni modifica al codice direttamente sottoposto alla licenza venga pubblicata.

source: Open Source licenses and the Orphaning Problem
it_it: Licenze Open Source e il problema dell'Orphaning
