Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-15/articles/bsdl-gpl/*.po
Languages: it_it

source: One of the serious problems associated with proprietary software is known as <quote>orphaning</quote>. This occurs when a single business failure or change in a product strategy causes a huge pyramid of dependent systems and companies to fail for reasons beyond their control. Decades of experience have shown that the momentary size or success of a software supplier is no guarantee that their software will remain available, as current market conditions and strategies can change rapidly.
it_it: Uno dei gravi problemi associati al software proprietario è noto come <quote>orphaning</quote> (letteralmente: "rendere orfano"). Esso si presenta quando un'impresa fallisce o un cambiamento nella strategia dei prodotti causa il fallimento di una vasta piramide di sistemi dipendenti e di aziende per ragioni al di là del loro controllo. Decadi di esperienza hanno dimostrato che la dimensione o il successo momentanei di un distributore di software non garantiscono che il loro software rimanga disponibile, dato che le condizioni del mercato e le strategie possono cambiare rapidamente.

source: The GPL attempts to prevent orphaning by severing the link to proprietary intellectual property.
it_it: La GPL tenta di impedire l'orphaning spezzando il legame con la proprietà intellettuale privata.

source: A BSD license gives a small company the equivalent of software-in-escrow without any legal complications or costs. If a BSD-licensed program becomes orphaned, a company can simply take over, in a proprietary manner, the program on which they are dependent. An even better situation occurs when a BSD code-base is maintained by a small informal consortium, since the development process is not dependent on the survival of a single company or product line. The survivability of the development team when they are mentally in the zone is much more important than simple physical availability of the source code.
it_it: Una licenza BSD consegna all'azienda il software in una specia di acconto di garanzia senza complicazioni o costi legali. Se un programma sottoposto a licenza BSD diventa orfano, un'azienda può semplicemente subentare, in maniera proprietaria, nel mantenimento del programma da cui dipende. Una situazione anche migliore si presenta quando codice BSD viene mantenuto da un piccolo consorzio informale, siccome il processo di sviluppo non dipende dalla sopravvivenza di una singola azienda o di una linea di prodotti. La sopravvivenza di una squadra di sviluppo mentalmente concentrata è molto più importante della semplice disponibilità fisica del codice sorgente.

source: What a license cannot do
it_it: Ciò che una licenza non può fare

source: No license can guarantee future software availability. Although a copyright holder can traditionally change the terms of a copyright at anytime, the presumption in the BSD community is that such an attempt simply causes the source to fork.
it_it: Nessuna licenza può garantire la futura disponibilità del software. Benché il detentore di copyright possa tradizionalmente cambiare i termini del copyright stesso in qualsiasi momento, si presuppone nella comunità BSD che tale tentativo causi semplicemente il fork del sorgente.

source: The GPL explicitly disallows revoking the license. It has occurred, however, that a company (Mattel) purchased a GPL copyright (cphack), revoked the entire copyright, went to court, and prevailed [2]. That is, they legally revoked the entire distribution and all derivative works based on the copyright. Whether this could happen with a larger and more dispersed distribution is an open question; there is also some confusion regarding whether the software was really under the GPL.
it_it: La GPL vieta esplicitamente la revoca della licenza. È accaduto, tuttavia, che un'azienda (Mattel) avesse comprato un copyright GPL (cphack), revocato l'intero copyright e vinto in tribunale [2]. Cioè, essa ha legalmente revocato l'intera distribuzione e tutti i lavori derivati basati su quel copyright. Se ciò possa accadere con una distribuzione più ampia e distribuita è una questione aperta; c'è anche qualche confusione riguardo a se il software fosse veramente sottoposto alla GPL.

source: In another example, Red Hat purchased Cygnus, an engineering company that had taken over development of the FSF compiler tools. Cygnus was able to do so because they had developed a business model in which they sold support for GNU software. This enabled them to employ some 50 engineers and drive the direction of the programs by contributing the preponderance of modifications. As Donald Rosenberg states "projects using licenses like the GPL...live under constant threat of having someone take over the project by producing a better version of the code and doing it faster than the original owners." [3]
it_it: In un altro esempio, Red Hat comprò Cygnus, un'azienda di ingegneria che era subentrata nello sviluppo degli strumenti del compilatore della FSF. Cygnus era autorizzata a svolgere questa operazione perché aveva sviluppato un modello commerciale che prevedeva la vendita di supporto al software GNU. Questo le permise di assumere una cinquantina di programmatori e guidare la direzione dei programmi contribuendo alla maggior parte delle modifiche. Come dichiara Donald Rosenberg "progetti che usano licenze quali la GPL... vivono sotto la costante minaccia di vedersi soffiar via il progetto da qualcuno che produce una versione migliore del codice e lo fa più velocemente dei proprietari originali." [3]

source: GPL Advantages and Disadvantages
it_it: Vantaggi e svantaggi della GPL

source: A common reason to use the GPL is when modifying or extending the gcc compiler. This is particularly apt when working with one-off specialty CPUs in environments where all software costs are likely to be considered overhead, with minimal expectations that others will use the resulting compiler.
it_it: Una ragione comune per l'uso della GPL è la modifica o l'estensione del compilatore gcc. Ciò è particolarmente conveniente quando si lavora con processori molto particolari in ambienti in cui è probabile che tutti i costi del software siano considerati spese di gestione, con minime aspettative riguardo all'uso da parte di altri del compilatore risultante.

source: The GPL is also attractive to small companies selling CDs in an environment where "buy-low, sell-high" may still give the end-user a very inexpensive product. It is also attractive to companies that expect to survive by providing various forms of technical support, including documentation, for the GPLed intellectual property world.
it_it: La GPL è vantaggiosa per piccole aziende che vendono CD in un ambiente dove "compra basso, vendi alto" può ancora consegnare all'utente finale un prodotto molto economico. Essa è vantaggiosa anche per le aziende che contano di sopravvivere fornendo varie forme di supporto tecnico, documentazione inclusa, per il mondo della proprietà intellettuale GPL.

source: A less publicized and unintended use of the GPL is that it is very favorable to large companies that want to undercut software companies. In other words, the GPL is well suited for use as a marketing weapon, potentially reducing overall economic benefit and contributing to monopolistic behavior.
it_it: Un uso meno pubblicizzato e imprevisto della GPL consiste nell'essere molto favorevole a grandi aziende che vogliono tagliar fuori aziende del software. In altre parole, la GPL è adatta per essere utilizzata come un'arma di mercato, potenzialmente riducendo il beneficio economico globale e contribuendo ad un comportamento monopolistico.

source: The GPL can present a real problem for those wishing to commercialize and profit from software. For example, the GPL adds to the difficulty a graduate student will have in directly forming a company to commercialize his research results, or the difficulty a student will have in joining a company on the assumption that a promising research project will be commercialized.
it_it: La GPL può costituire un vero problema per coloro che vogliono commercializzare software e trarne profitto. Per esempio, la GPL accresce la difficoltà di uno studente laureato di fondare un'azienda per commercializzare i risultati delle sue ricerche e accrese altresì la difficoltà di uno studente di entrare in un'azienda a condizione che un suo progetto di ricerca promettente venga commercializzato.

source: For those who must work with statically-linked implementations of multiple software standards, the GPL is often a poor license, because it precludes using proprietary implementations of the standards. The GPL thus minimizes the number of programs that can be built using a GPLed standard. The GPL was intended to not provide a mechanism to develop a standard on which one engineers proprietary products. (This does not apply to Linux applications because they do not statically link, rather they use a trap-based API.)
it_it: Per coloro che devono lavorare con implementazioni linkate staticamente di diversi standard software, la GPL è spesso una licenza infelice, perché preclude l'uso di implementazioni proprietarie degli standard. Così la GPL riduce il numero di programmi che possono essere costruiti usando uno standard GPL. La GPL intenzionalmente non fornisce un meccanismo per sviluppare uno standard sul quale si possano sviluppare prodotti proprietari. (Ciò non si applica alle applicazioni Linux perché non si collegano staticamente al kernel, bensì usano un'API trap-based.)

source: The GPL attempts to make programmers contribute to an evolving suite of programs, then to compete in the distribution and support of this suite. This situation is unrealistic for many required core system standards, which may be applied in widely varying environments which require commercial customization or integration with legacy standards under existing (non-GPL) licenses. Real-time systems are often statically linked, so the GPL and LGPL are definitely considered potential problems by many embedded systems companies.
it_it: La GPL cerca di portare i programmatori a contribuire ad una collezione di programmi in evoluzione, quindi di competere nella distribuzione e nel supporto di questa collezione. Questa situazione è irrealistica per molti standard di sistema di base richiesti, che potrebbero essere applicati in ambienti ampiamente variabili richiedenti personalizzazioni commerciali o integrazioni con standard legacy sottoposti a licenze già esistenti (non GPL). I sistemi in tempo reale sono spesso linkati staticamente, quindi la GPL e la LGPL sono decisamente considerate potenziali problemi da molte aziende di sistemi integrati.

source: The GPL is an attempt to keep efforts, regardless of demand, at the research and development stages. This maximizes the benefits to researchers and developers, at an unknown cost to those who would benefit from wider distribution.
it_it: La GPL è un tentativo di mantenere gli sforzi, senza riguardo per la domanda, ai livelli della ricerca e dello sviluppo. Questo massimizza i benefici per i ricercatori e gli sviluppatori, ad un costo ignoto per coloro che guadagnerebbero da una distribuzione più ampia.

source: The GPL was designed to keep research results from transitioning to proprietary products. This step is often assumed to be the last step in the traditional technology transfer pipeline and it is usually difficult enough under the best of circumstances; the GPL was intended to make it impossible.
it_it: La GPL è stata progettata per impedire che i risultati di ricerca diventassero prodotti proprietari. Si suppone spesso che questo passo sia l'ultimo nel processo tradizionale di trasferimento tecnologico ed è solitamente abbastanza difficile anche nelle migliori delle circostanze; la GPL lo rende intenzionalmente impossibile.

source: BSD Advantages
it_it: Vantaggi di BSD

source: A BSD style license is a good choice for long duration research or other projects that need a development environment that:
it_it: Una licenza in stile BSD è una buona scelta per ricerche di lunga durata o altri progetti che necessitano di un ambiente di sviluppo tale che:

source: has near zero cost
it_it: abbia costi quasi nulli

source: will evolve over a long period of time
it_it: evolva in un lungo periodo di tempo

source: permits anyone to retain the option of commercializing final results with minimal legal issues.
it_it: permetta a chiunque di mantenere la possibilità di commercializzare i risultati finali con problemi legali minimi.

source: This final consideration may often be the dominant one, as it was when the Apache project decided upon its license:
it_it: Quest'ultima considerazione può essere spesso quella dominante, come fu il caso quando il progetto Apache decise la sua licenza:

source: <quote>This type of license is ideal for promoting the use of a reference body of code that implements a protocol for common service. This is another reason why we choose it for the Apache group - many of us wanted to see HTTP survive and become a true multiparty standard, and would not have minded in the slightest if Microsoft or Netscape choose to incorporate our HTTP engine or any other component of our code into their products, if it helped further the goal of keeping HTTP common... All this means that, strategically speaking, the project needs to maintain sufficient momentum, and that participants realize greater value by contributing their code to the project, even code that would have had value if kept proprietary.</quote>
it_it: <quote>Questo tipo di licenza è ideale per promuovere l'uso di un codice di riferimento che implementi un protocollo per un servizio comune. Questa è un'altra ragione per cui l'abbiamo scelto per il gruppo Apache - molti di noi volevano vedere HTTP sopravvivere e diventare un vero standard comune e non si sarebbero preoccupati minimamente se Microsoft o Netscape avessero scelto di incorporare il nostro motore HTTP o qualsiasi altra componente del nostro codice nei loro prodotti, se fosse stato ulteriormente utile allo scopo di mantenere HTTP comune... Tutto ciò significa che, strategicamente parlando, il progetto necessita di mantenere slancio sufficiente e che i partecipanti realizzano valore maggiore condividendo il loro codice col progetto, anche quel codice che avrebbe avuto valore se mantenuto proprietario.</quote>

source: Developers tend to find the BSD license attractive as it keeps legal issues out of the way and lets them do whatever they want with the code. In contrast, those who expect primarily to use a system rather than program it, or expect others to evolve the code, or who do not expect to make a living from their work associated with the system (such as government employees), find the GPL attractive, because it forces code developed by others to be given to them and keeps their employer from retaining copyright and thus potentially "burying" or orphaning the software. If you want to force your competitors to help you, the GPL is attractive.
it_it: I programmatori tendono a trovare la licenza BSD vantaggiosa per il fatto che tiene i problemi legali fuori dai piedi e lascia loro fare ciò che vogliono con il codice. Al contrario, coloro che contano principalmente di utilizzare un sistema piuttosto che di programmarlo, o contano che altri facciano evolvere il codice, o coloro che non contano di vivere del loro lavoro associato al sistema (quali gli impiegati di governi), trovano la GPL vantaggiosa, perché fa sì che il codice sviluppato da altri sia loro restituito e impedisce il loro datore di lavoro di mantenere il copyright e così potenzialmente di "seppellire" il software o di renderlo orfano. Se si desidera costringere i concorrenti ad aiutare, la GPL è vantaggiosa.

source: A BSD license is not simply a gift. The question <quote>why should we help our competitors or let them steal our work?</quote> comes up often in relation to a BSD license. Under a BSD license, if one company came to dominate a product niche that others considered strategic, the other companies can, with minimal effort, form a mini-consortium aimed at reestablishing parity by contributing to a competitive BSD variant that increases market competition and fairness. This permits each company to believe that it will be able to profit from some advantage it can provide, while also contributing to economic flexibility and efficiency. The more rapidly and easily the cooperating members can do this, the more successful they will be. A BSD license is essentially a minimally complicated license that enables such behavior.
it_it: Una licenza BSD non è semplicemente un regalo. La domanda <quote>perché dovremmo aiutare i nostri concorrenti o lasciarli rubare il nostro lavoro?</quote> sorge spesso riguardo ad una licenza BSD. Secondo la licenza BSD, se un'azienda è venuta a dominare una nicchia di mercato che altri consideravano strategica, le altre aziende possono, con uno sforzo minimo, formare un mini-consorzio mirato a riequilibrare le parti contribuendo ad una variante BSD competitiva che aumenta la concorrenza di mercato e l'equità. Ciò permette ad ogni azienda di ritenere che sarà in grado di trarre profitto da un qualche vantaggio che è capace di fornire, nonché di contribuire alla flessibilità e all'efficienza economica. Più rapidamente e facilmente i membri cooperanti sono in grado di attuare ciò, più successo conseguiranno. Una licenza BSD è essenzialmente una licenza complicata il minimo necessario da consentire tale comportamento.

source: A key effect of the GPL, making a complete and competitive Open Source system widely available at cost of media, is a reasonable goal. A BSD style license, in conjunction with ad-hoc-consortiums of individuals, can achieve this goal without destroying the economic assumptions built around the deployment-end of the technology transfer pipeline.
it_it: Un effetto chiave della GPL, la costruzione di un sistema Open Source completo e competitivo ampiamente disponibile al prezzo del supporto, è uno scopo ragionevole. Una licenza in stile BSD, in congiunzione con consorzi ad hoc ed individui, può raggiungere questo scopo senza distruggere i presupposti economici costruiti attorno al termine del processo di trasferimento tecnologico, vale a dire la distribuzione.

source: Specific Recommendations for using a BSD license
it_it: Raccomandazione specifiche per l'uso di una licenza BSD

source: The BSD license is preferable for transferring research results in a way that will widely be deployed and most benefit an economy. As such, research funding agencies, such as the NSF, ONR and DARPA, should encourage in the earliest phases of funded research projects, the adoption of BSD style licenses for software, data, results, and open hardware. They should also encourage formation of standards based around implemented Open Source systems and ongoing Open Source projects.
it_it: La licenza BSD è preferibile per trasferire risultati di ricerca in modo che vengano ampiamente distribuiti e che benefici l'economia. Pertanto, agenzie di finanziamento di ricerca, quali le americane NSF, ONR, DARPA o, in Italia, il CNR, dovrebbero incoraggiare, nelle fasi iniziali dei progetti di ricerca finanziati, l'adozione di licenze in stile BSD per software, dati, risultati e hardware aperto. Dovrebbero incoraggiare anche la formazione di standard basati su sistemi implementati Open Source e progetti Open Source in sviluppo.

source: Government policy should minimize the costs and difficulties in moving from research to deployment. When possible, grants should require results to be available under a commercialization friendly BSD style license.
it_it: Le politiche di governo dovrebbero minimizzare i costi e le difficoltà nel pasaggio dalla ricerca alla distribuzione. Quando possibile, le sovvenzioni dovrebbero richiedere che i risultati vengano resi disponibili secondo le condizioni di una licenza compatibile con la commercializzazione in stile BSD.

source: In many cases, the long-term results of a BSD style license more accurately reflect the goals proclaimed in the research charter of universities than what occurs when results are copyrighted or patented and subject to proprietary university licensing. Anecdotal evidence exists that universities are financially better rewarded in the long run by releasing research results and then appealing to donations from commercially successful alumni.
it_it: In molti casi, i risultati a lungo termine di una licenza in stile BSD riflettono più precisamente gli obiettivi proclamati nella carta di ricerca delle università rispetto a quanto accade quando i risultati sono sottoposti a copyright o brevetti e soggetti a licenze proprietarie di università. Aneddoti dimostrano che le università vengono ricompensate meglio finanziariamente nel lungo termine rilasciando i propri risultati di ricerca e quindi esortando a versare donazioni gli ex allievi che vantano successi commerciali.

source: Companies have long recognized that the creation of de facto standards is a key marketing technique. The BSD license serves this role well, if a company really has a unique advantage in evolving the system. The license is legally attractive to the widest audience while the company's expertise ensures their control. There are times when the GPL may be the appropriate vehicle for an attempt to create such a standard, especially when attempting to undermine or co-opt others. The GPL, however, penalizes the evolution of that standard, because it promotes a suite rather than a commercially applicable standard. Use of such a suite constantly raises commercialization and legal issues. It may not be possible to mix standards when some are under the GPL and others are not. A true technical standard should not mandate exclusion of other standards for non-technical reasons.
it_it: Le aziende hanno riconosciuto da molto tempo che la creazione di standard de facto è una tecnica di commercializzazione chiave. La licenza BSD interpreta bene questo ruolo, se un'azienda ha veramente un vantaggio unico nell'evoluzione del sistema. La licenza è legalmente vantaggiosa per il pubblico più ampio mentre l'esperienza dell'azienda assicura il controllo dello standard. Esistono casi in cui la GPL può essere il veicolo appropriato per creare uno standard del genere, soprattutto quando si cerca di sabotare o cooptare altri. La GPL, tuttavia, penalizza l'evoluzione dello standard, perché promuove una collezione di software piuttosto che uno standard commercialmente applicabile. L'uso di una tale collezione solleva costantemente problemi legali e di commercializzazione. Può non essere possibile mescolare standard quando alcuni sono sottoposti alla GPL mentre altri non lo sono. Un vero standard tecnico non dovrebbe imporre esclusioni di altri standard per ragioni non tecniche.

source: Companies interested in promoting an evolving standard, which can become the core of other companies' commercial products, should be wary of the GPL. Regardless of the license used, the resulting software will usually devolve to whoever actually makes the majority of the engineering changes and most understands the state of the system. The GPL simply adds more legal friction to the result.
it_it: Aziende interessate a promuovere uno standard in evoluzione, che potrebbe diventare il cuore dei prodotti commerciali di altre aziende, dovrebbero diffidare della GPL. Indipendentemente dalla licenza usata, il software risultante sarà generalmente trasferito a chiunque compia effettivamente la maggioranza dei cambiamenti tecnici e capisce meglio lo stato del sistema. La GPL semplicemente aggiunge più attrito legale al risultato.
