<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-9.sgml,v 1.1 2006/03/13 21:09:20 blackend Exp $">
<!ENTITY title "Hewlett-Packard donne un cluster blade &agrave; FreeBSD">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.1
-->

<html>
&header;

<!--
<img src="../gifs/news.jpg" align="right" border="0" alt="FreeBSD News">
-->

<p></p>

<p><b>La Fondation FreeBSD a re&ccedil;u la donation d'un
syst&egrave;me blade de Hewlett-Packard pour le cluster de compilation
de logiciels tiers.  Ce cluster HP BladeSystem &agrave; 20 noeuds
permet de tripler la vitesse de compilation des paquets i386.</b></p>

<p><i>"Avec cette donation g&eacute;n&eacute;reuse de HP, nous pouvons
produire en permanence des paquets &agrave; jour pour plus de 13 000
logiciels tiers du catalogue des logiciels port&eacute;s FreeBSD,
&agrave; une fr&eacute;quence environ trois fois plus grande qu'avec
le cluster pr&eacute;c&eacute;dent,"</i> dit Kris Kennaway, membre de
l'&eacute;quipe de gestion des logiciels port&eacute;s FreeBSD.</p>

<p><i>"Ceci b&eacute;n&eacute;ficie directement aux utilisateurs de
FreeBSD avec une disponibilit&eacute; rapide de paquetages nouveaux et
&agrave; jour, et avec le test accru et l'assurance qualit&eacute; de
FreeBSD que ce nouveau mat&eacute;riel permet."</i></p>

<p><i>"Chez HP, nous reconnaissons le r&ocirc;le important que joue
FreeBSD dans l'infrastructure du r&eacute;seau Internet, et nous
sommes heureux que le cluster HP BladeSystem puisse contribuer au
succ&egrave;s de la Fondation FreeBSD,"</i> dit Mark Potter, vice
pr&eacute;sident de la division BladeSystem de Hewlett-Packard.</p>

<p><i>"Ce sont des syst&egrave;mes i386 standards, architecturalement,
avec un serveur de gestion bas&eacute; sur ssh et sur des consoles
s&eacute;ries tr&egrave;s sympatiques,"</i> d&eacute;clare Kennaway,
qui maintient le cluster des logiciels portés FreeBSD.</p>

<p>Kennaway dit que FreeBSD a quelques dizaines d'autres marchines
&eacute;parpill&eacute;es autour du monde pour les compilations de
paquetages.  Une concentration importante de machines sparc
h&eacute;berg&eacute;es par Hiroki Sato au Japon comprend de gros
e4500 multiprocesseurs (10, 12 et 14 CPUs) qui sont extr&ecirc;mement
importants pour les tests SMP.  Il y a &eacute;galement deux machines
h&eacute;berg&eacute;es par ISC, un amd64 h&eacute;berg&eacute; par
Scott Long, trois machines i386 chez Yahoo! Cor&eacute;e, et parfois
les propres machines de Kennaway aux Canada sont utilis&eacute;es pour
la compilation des paquetages officiels.</p>

<p>Le cluster HP BladeSystem est h&eacute;berg&eacute; au datacenter
Yahoo!  dans la baie de San Francisco.  En plus de Kennaway, Paul Saab
et Peter Wemm du projet FreeBSD, ainsi que John Cagle de HP ont
aid&eacute; &agrave; configurer le syst&egrave;me blade.</p>

<h3>&Agrave; propos du Projet FreeBSD</h3>

<p>Le Projet FreeBSD fournit un syst&egrave;me d'exploitation moderne,
&agrave; jour et tenant la mont&eacute;e en charge qui offre de la
haute performance, de la s&eacute;curit&eacute; et des
fonctionnalit&eacute;s r&eacute;seau avanc&eacute;es aux stations de
travail personnelles, aux serveurs Internet, aux routeurs et aux
parefeux.  La collection de paquetages FreeBSD comprend des logiciels
populaires comme le serveur web Apache, Gnome, KDE, le syst&egrave;me
graphique X11 X.org, Python, Mozilla et plus de 13 000 logiciels.
FreeBSD peut &ecirc;tre trouv&eacute; sur Internet sur <a
href="http://www.FreeBSD.org/fr/">http://www.FreeBSD.org/fr/</a>.</p>

<h3>Plus d'Information :</h3>

<p>Page web des Ports FreeBSD<br>
<a href="http://www.freebsd.org/ports/">http://www.FreeBSD.org/ports/</a>
<br><br>
Page web des journaux et des erreurs de compilation des paquets FreeBSD<br>
<a href="http://pointyhat.freebsd.org/errorlogs/">http://pointyhat.freebsd.org/errorlogs/</a></p>

&footer;
</body>
</html>
