<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "..">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-3.sgml,v 1.4 2005/10/06 12:56:05 blackend Exp $">
<!ENTITY title "FreeBSD - revue de presse : 7 juin 1999">
<!ENTITY % navinclude.about "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.6

   Version francaise : Guillain
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
&header;

<!--
<img src="&enbase;/gifs/pressreleases.jpg" align="right" border="0">
-->
<p></p>

<h2>La communaut&eacute; BSD souhaite la bienvenue au nouveau syst&egrave;me d'exploitation Open Source d'Apple</h2>

<p><b>Concord, CA, 7 juin 1999</b> : Aujourd'hui, alors que commence la
convention annuelle Usenix de la communaut&eacute; de d&eacute;veloppement Unix, les syst&egrave;mes d'exploitation
les plus influents ont accueilli Darwin, d'Apple Computer (www.apple.com/darwin)
en tant que nouveau membre de la famille BSD
(Berkeley Software Distribution).</p>

<p>"Nous sommes tr&egrave;s heureux de la participation d'Apple dans la communaut&eacute;
BSD," d&eacute;clare Jordan Hubbard, pr&eacute;sident de la section Freenix
de la convention Usenix et co-fondateur du projet FreeBSD. "Si les
entrepreneurs intelligents d&eacute;couvrent l'incroyable ressource libre que repr&eacute;sente les logiciels BSD,
ils r&eacute;aliseront que contribuer au d&eacute;veloppement open-source est
dans leur propre int&eacute;r&ecirc;t."</p>

<p>Comme le d&eacute;clare Herb Peyerl du projet NetBSD, "Notre collaboration avec
Apple sur le projet Darwin a &eacute;t&eacute; extr&egrave;mement enrichissante pour NetBSD
et c'est le genre de coop&eacute;ration ouverte que nous aimerions voir plus
souvent."</p>

<p>"S'appuyer sur l'h&eacute;ritage de vingt ans de BSD permet aux d&eacute;veloppeurs d'Apple de
se concentrer sur l'ajout d'une exp&eacute;rience utilisateur unique &agrave; la fondation solide
et robuste du code BSD" d&eacute;clare Avie Tevanian, vice-pr&eacute;sident s&eacute;nior d'Apple
Computer, section ing&eacute;nierie logicielle. "Nous pensons
qu'en rejoignant le mouvement open source avec notre logiciel Darwin,
il en r&eacute;sultera de meilleurs produits pour les millions de clients Mac
de par le monde. Le code BSD de Darwin est une part essentielle de notre
strat&eacute;gie en ce qui concerne les syst&egrave;mes d'exploitation."</p>

<p>Ce genre de r&eacute;ciprocit&eacute; est un retour au mod&egrave;le original de d&eacute;veloppement
logiciel qui &eacute;tait universel aux premiers temps des ordinateurs,
avant les PC. Wilfredo Sanchez, dirigeant technique pour le Projet Darwin,
fera un discours au sujet de Darwin cette semaine &agrave; Freenix, discours qui fait partie du
programme de Usenix consacr&eacute; exclusivement &agrave; ce genre de d&eacute;veloppement logiciel
en open source.</p>

<h3>A propos de NetBSD et de FreeBSD</h3>

<p>NetBSD et FreeBSD sont des syst&egrave;mes d'exploitation open source bas&eacute;s sur la derni&egrave;re
version publique de l'Unix BSD, 4.4BSDLite2. Tous les efforts ont &eacute;t&eacute; faits pour suivre
les technologies les plus r&eacute;centes en mati&egrave;re de processeurs et d'architectures
logicielles. Tout en ayant des priorit&eacute;s diff&eacute;rentes, les &eacute;quipes de d&eacute;veloppement
BSD entretiennent une amicale rivalit&eacute;, se stimulant l'un l'autre afin de
sortir les meilleurs produits pour leurs utilisateurs de par le monde. Apr&egrave;s vingt
ans de d&eacute;veloppement, une &eacute;norme quantit&eacute; de logiciels a &eacute;t&eacute; d&eacute;velopp&eacute;e
pour BSD -- dont la plupart de ceux qui g&egrave;rent l'infrastructure de l'Internet --
permettant au syst&egrave;me d'exploitation d'&ecirc;tre utilis&eacute; efficacement dans presque toutes
les applications informatiques. Le mod&egrave;le de d&eacute;veloppement ouvert implique qu'il n'y a pas de secrets,
permettant une compr&eacute;hension universelle du code. Cela permet aux d&eacute;veloppeurs
BSD de s'appuyer sur les efforts des pr&eacute;c&eacute;dents d&eacute;veloppeurs sans rencontrer
les difficult&eacute;s end&eacute;miques dues aux syst&egrave;mes d'exploitation et applications propri&eacute;taires.</p>

<h3>Pour plus d'informations, contactez :</h3>
<p>
The FreeBSD Project<br>
Concord, Californie<br>
925-682-7859<br>
<a href="mailto:freebsd-questions@FreeBSD.org">
freebsd-questions@FreeBSD.org</a><br>
<a href="http://www.FreeBSD.org">http://www.FreeBSD.org</a><br>
</p>

<p>
The NetBSD Project<br>
C/O Charles M. Hannum<br>
81 Bromfield Rd, #2<br>
Somerville, MA 02144<br>
<a href="mailto:mindshare@netbsd.org">mindshare@netbsd.org</a><br>
<a href="http://www.netbsd.org">http://www.netbsd.org</a><br>
</p>

&footer;
</body>
</html>
