<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-6.sgml,v 1.3 2004/08/07 15:33:38 mat Exp $">
<!ENTITY title "Communiqu&eacute; de presse FreeBSD : 31 Octobre 2002">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
<!ENTITY % newsincludes SYSTEM "includes.sgml"> %newsincludes;
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.2

   Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
   Version francaise (mise a jour) : Mathieu Arnold <mat@FreeBSD.org>
-->

<html>
&header;

<p></p>

<h3>Le D&eacute;mon de l'Op&eacute;ra : Opera Software sort une version pour FreeBSD</h3>

<p><b>Oslo, Norv&egrave;ge, 31 Octobre 2002 :</b> Opera Software est fier d'
annoncer la premi&egrave;re version "Or" de son nouveau port pour le syst&egrave;me de type UNIX
FreeBSD. Avec cette version pour FreeBSD, Opera est maintenant disponible sur
huit syst&egrave;mes d'exploitation diff&eacute;rents.</p>

<p>Le syst&egrave;me d'exploitation BSD (Berkeley Software Distribution) trouve ses origines
&agrave; l'Universit&eacute; de Californie, Berkeley. Il a commenc&eacute; sa carri&egrave;re en tant que suppl&eacute;ment &agrave;
UNIX, mais il a &eacute;volu&eacute; au fil du temps en plusieurs syst&egrave;mes d'exploitation. Parmi ces
diff&eacute;rentes variantes de BSD, la plus largement distribu&eacute;e est FreeBSD,
tr&egrave;s populaire parmi les utilisateurs exp&eacute;riment&eacute;s comme les administrateurs syst&egrave;mes qui recherchent un syst&egrave;me
rapide et fiable.</p>

<p><cite>"Les utilisateurs d'Opera et de FreeBSD ont ceci de commun qu'ils mettent en avant, et
s'attendent &agrave; trouver, la stabilit&eacute; et la fiabilit&eacute;. Ce point commun entre FreeBSD et Opera devrait
plaire &agrave; de nombreux clients professionnels."</cite> d&eacute;clare Jon S. von
Tetzchner, CEO, Opera Software ASA. <cite>"A un niveau plus personnel, je suis &eacute;galement heureux
d'accueillir les utilisateurs FreeBSD dans la famille Opera. FreeBSD n'est pas uniquement
un syst&egrave;me d'exploitation, c'est aussi une communaut&eacute; et une philosophie avec des valeurs qui, je le sais,
sont en accords avec les notres."</cite></p>

<p>La communaut&eacute; FreeBSD est enthousiaste &agrave; l'id&eacute;e de pouvoir enfin surfer avec
Opera.</p>

<p><cite>"Avec la sortie de Opera pour FreeBSD, les utilisateurs FreeBSD qui t&eacute;l&eacute;chargent
Opera pour FreeBSD peuvent surfer sur le web avec l'un des navigateurs les plus rapides
du march&eacute;,"</cite> d&eacute;clare Robert Watson, membre de l'&eacute;quipe principale FreeBSD.
<cite>"La r&eacute;putation de FreeBSD comme syst&egrave;me d'exploitation fiable et rapide pour les postes bureautiques
s'&eacute;tend de plus en plus et nous sommes heureux de voir que Opera Software nous aide
&agrave; cr&eacute;er un environnement bureautique encore plus complet."</cite></p>

<p>Opera 6.1 pour FreeBSD peut &ecirc;tre t&eacute;l&eacute;charg&eacute; sur
<a href="http://www.opera.com/">www.opera.com</a>.</p>

<h3>A propos de Opera Software</h3>

<p>Opera Software ASA est une soci&eacute;t&eacute; leader dans le d&eacute;veloppement de navigateurs
Web pour les march&eacute;s de la bureautique et de l'embarqu&eacute;. Elle est partenaire de soci&eacute;t&eacute;s
comme IBM, AMD, Symbian, Canal+ Technologies, Ericsson, Sharp et Lineo
(maintenant division de Embedix). Le navigateur Opera a &eacute;t&eacute; reconnu internationalement
aussi bien par les utilisateurs que par la presse sp&eacute;cialis&eacute;e comme &eacute;tant plus rapide,
moins gourmand en ressources et plus respectueux des standards que les autres navigateurs. Opera est
disponible pour Windows, Mac, Linux, Solaris, FreeBSD, OS/2, Symbian OS et
QNX. Opera Software ASA est une soci&eacute;t&eacute; priv&eacute;e dont le si&egrave;ge se situe &agrave; Oslo,
Norv&egrave;ge. Pour en savoir plus sur Opera, vous pouvez consulter le site
<a href="http://www.opera.com/">www.opera.com</a>.</p>

<h3>A propos du syst&egrave;me d'exploitation "Berkeley Software Distribution"</h3>

<p>Les technologies du syst&egrave;me BSD ("Berkeley Software Distribution") ont
&eacute;t&eacute; &agrave; l'origine d&eacute;velopp&eacute;es entre 1979 et 1992 par le "Computer Systems Research
Group (CSRG)" &agrave; l'Universit&eacute; de Californie &agrave; Berkeley. Les technologies syst&egrave;mes
et r&eacute;seaux d&eacute;riv&eacute;es de Berkeley sont au coeur des syst&egrave;mes Unix et apparent&eacute;s
les plus modernes. Actuellement, tous les grandsd fournisseurs d'infrastructures
Internet utilisent virtuellement des syst&egrave;mes d'exploitation BSD. Les technologies
du syst&egrave;me BSD sont utilis&eacute;es dans d'importants projets o&ugrave; la partie r&eacute;seau est
critique et sont embarqu&eacute;es dans des plates-formes Internet qui n&eacute;cessitent des
fonctions Internet avanc&eacute;es, une excellente fiabilit&eacute; et une tr&egrave;s bonne s&eacute;curit&eacute;.</p>

<h3>A propos du Projet FreeBSD</h3>

<p>FreeBSD est un syst&egrave;me d'exploitation open-source tr&egrave;s populaire d&eacute;velopp&eacute; par le Projet
FreeBSD et toute une &eacute;quipe de personnes r&eacute;partie dans le monde entier qui consiste en plus de 5000 d&eacute;veloppeurs
qui coordonnent leurs travaux via 185 d&eacute;veloppeurs "committers" (N.d.T.: d&eacute;veloppeurs pouvant modifier le code source).
Il est disponible gratuitement sur le site <a href="ftp://ftp.FreeBSD.org/">ftp.FreeBSD.org</a> et est aussi
distribu&eacute; en CDs/DVDs chez CompUSA, Fry's, Borders,
Ingram, FreeBSDmall.com et d'autres. FreeBSD inclue des milliers d'applications
dont des logiciels bureautiques, "groupware" et multim&eacute;dia. Il est largement
utilis&eacute; par des soci&eacute;t&eacute;s du monde entier en tant que serveur
web, serveur de fichiers, firewall et routeur. FreeBSD est distribu&eacute; sous licence
"Berkeley Software Distribution", ce qui signifie qu'il peut &ecirc;tre copi&eacute; et
modifi&eacute; librement y compris dans un but commercial. Pour plus d'informations &agrave; propos du Projet
FreeBSD, visitez le site <a href="http://www.FreeBSD.org/">www.FreeBSD.org</a>.</p>

<h3>Contacts Presse</h3>

<p>Opera Software<br>
Pal A. Hvistendahl<br>
Marcom Director<br>
T&eacute;l: +47 99 72 43 31<br>
Fax: +47 24 16 40 01<br>
<a href="mailto:pal@opera.com">pal@opera.com</a><br>
Num&eacute;ro vert aux USA : 1-888-624-4846, uniquement la presse svp</p>

<p>Le projet FreeBSD<br>
<a href="mailto:press@FreeBSD.org">press@FreeBSD.org</a></p>

&footer;
</body>
</html>
