<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-4.sgml,v 1.2 2004/01/06 17:31:42 stephane Exp $">
<!ENTITY title "Communiqu&eacute; de presse FreeBSD : 9 Mars 2000">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
<!ENTITY % newsincludes SYSTEM "includes.sgml"> %newsincludes;
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.4

   Version francaise : Frederic Haby
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
&header;

<p></p>

<h3>
POUR DIFFUSION IMMEDIATE</h3>

<h3>
DES FOURNISSEURS BSD FUSIONNENT POUR DIFFUSER LE SYSTEME D'EXPLOITATION
POUR INTERNET LE PLUS POPULAIRE DU MONDE</h3>

<h4>
La nouvelle soci&eacute;t&eacute; BSDI va diffuser les technologies du
syst&egrave;me d'exploitation BSD et &eacute;pauler la communaut&eacute;
"Open Source" FreeBSD dans sa croissance rapide.</h4>

<p><b>Colorado Springs, Colorado, 9 Mars 2000:</b> Berkeley Software Design,
Inc. (BSDI) a annonc&eacute; aujourd'hui sa fusion avec Walnut Creek CDROM,
qui distribue le cel&egrave;bre syst&egrave;me d'exploitation FreeBSD.
Avec cette fusion, la nouvelle soci&eacute;t&eacute; BSDI rassemble les
principaux d&eacute;veloppeurs et fournisseurs du syst&egrave;me d'exploitation
de Berkeley Software Distribution. BSDI d&eacute;veloppera et fournira
des syst&egrave;mes d'exploitation et des plate-formes Internet BSD&reg;,
tout en fournissant technologie, support et assistance au Projet FreeBSD,
logiciel libre.</p>

<p>Les syst&egrave;mes d'exploitation BSD sont au coeur des plus gros sites
Internet et sont employ&eacute;s par les plus gros fournisseurs de services,
dont Yahoo!, Hotmail de Microsoft et UUNET, une soci&eacute;t&eacute; de
MCI WorldCom. BSD et Linux sont actuellement les syst&egrave;mes d'exploitation
en plus forte croissance, selon Survey.com, la principale soci&eacute;t&eacute;
d'"eRecherche".</p>

<p>Le syst&egrave;me d'exploitation BSD et ses technologies r&eacute;seau
et Internet ont acquis une reconnaissance &eacute;tendue dans l'infrastructure
Internet. Plus de 100,000 utilisateurs commerciaux Internet utilisent des
syst&egrave;mes d'exploitation BSD sur plus de 2,000,000 serveurs BSD.
On estime que 9 Fournisseurs d'Acc&egrave;s Internet - Internet Service
Providers (ISP) - et Fournisseurs d'Acc&egrave;s R&eacute;seau - Network
Service Providers (NSP) - sur 10, et 15 pour 100 des sites Internet, utilisent
des syst&egrave;mes BSD. Les syst&egrave;mes d'exploitation BSD sont aussi
incorpor&eacute;s &agrave; des solutions Internet integr&eacute;es produites
par Intel, IBM, Lucent, F5 Labs, Hitachi et bien d'autres.</p>

<p>BSDI a aussi annonc&eacute; que Yahoo! Inc. apportera son soutien financier
&agrave; la nouvelle soci&eacute;t&eacute;. BSDI utilisera cette participation
pour rapprocher les innovations du logiciel libre des exigences commerciales. Elle
servira &agrave; renforcer la position dominante de BSDI comme fournisseur du plus
&eacute;volu&eacute; des syst&egrave;mes d'exploitation pour l'infrastructure
Internet.</p>

<p>BSDI souhaite cr&eacute;er un front uni pour les syst&egrave;mes d'exploitation
BSD. La soci&eacute;t&eacute; distribuera, supportera et am&eacute;liorera
aussi bien BSD/OS que FreeBSD. BSDI et le Projet FreeBSD &eacute;valuent
ensemble la technologie et les besoins du march&eacute; en vue de fusionner
les codes des deux syst&egrave;mes d'exploitation.</p>

<h3>Le nouveau chef de file BSDI</h3>

<p>"Les technologies BSD ont un long historique de d&eacute;veloppements avanc&eacute;es
qui sont au coeur de l'Internet," a d&eacute;clar&eacute; le&nbsp; Dr.
Marshall Kirk McKusick, pr&eacute;sident de BSDI. "La nouvelle BSDI enrichira
encore la populaire plate-forme BSD, qui est d&eacute;j&agrave; largement
d&eacute;ploy&eacute;e &agrave; travers le monde." McKusick fut un des fondateur
du Computer Systems Research Group (CSRG) de l'Universit&eacute; de Californie
&agrave; Berkeley et est unaniment reconnu comme un des participants cl&eacute;s
aux d&eacute;buts du mouvement du logiciel libre.</p>

<p>Pour mener la nouvelle vision de BSDI, ses plans et sa croissance continue,
Gary J. Johnson a&nbsp; &eacute;t&eacute; nomm&eacute; directeur. Johnson
est un dirigeant exp&eacute;riment&eacute; dans le domaine technologique,
qui a occup&eacute; divers postes de gestion, vente, marketing et de responsable
d'op&eacute;ration dans des compagnies phares de la Silicon Valley dont
Tandem Computers (Compaq), Convergent Technologies (Unisys) et SCO. Johnson
&eacute;tait derni&egrave;rement pr&eacute;sident de ClickService Software,
un fournisseur majeur de logiciel d'e-commerce et de gestion des relations
client&egrave;le (Customer Relationship Management - CRM).</p>

<p>"L'innovation sur le terrain des syst&egrave;mes d'exploitation s'appuie
principalement sur le travail de la communaut&eacute; du logiciel libre,"
a dit Johnson. "Aujourd'hui, les fournisseurs Linux, tels Red Hat Software
et VA Linux, ont attir&eacute; l'attention de tous sur l'approche de d&eacute;veloppement
du logiciel libre. Au coeur de l'Internet, toutefois, les technologies
BSD sont partout. Le nouveau BSDI travaillera &eacute;troitement avec la
communaut&eacute; du logiciel libre pour garantir que les syst&egrave;mes
d'exploitation et plate-formes BSD avanc&eacute;s continuent &agrave; r&eacute;pondre
&agrave; la demande toujours croissante de serveurs Internet, d'applications,
de syst&egrave;mes int&eacute;gr&eacute;s et autres &eacute;l&eacute;ments
vitaux pour l'infrastructure Internet."</p>

<p>En plus de ses responsabilit&eacute;s actuelles, Mike Karels, vice-directeur
de l'ing&eacute;nierie de BSDI, ancien architecte syst&egrave;me en chef
et programmeur principal pour le CSRG de l'Universit&eacute; de Californie
&agrave; Berkeley, projette de rejoindre l'&eacute;quipe d'architectes
du Projet. Karels, qui a remplac&eacute; le co-fondateur de Sun Microsystems
Bill Joy au CSRG, est reconnu comme l'un des plus &eacute;minents d&eacute;veloppeurs
des internes d'Unix et du logiciel r&eacute;seau TCP/IP au monde.</p>

<p>"Les technologies BSD ont contribu&eacute; au succ&egrave;s continu
de Yahoo! en apportant la fiabilit&eacute; et la qualit&eacute; de service
n&eacute;cessaire pour assurer la disponibilit&eacute; et l'evolutivit&eacute;
dont nous avons besoin pour que Yahoo! fonctionne sans interruption, quelque
soit la demande croissante des utilisateurs," a d&eacute;clar&eacute; David
Filo, co-fondateur et pr&eacute;sident de Yahoo! Inc.</p>

<h3>BSDI continue &agrave; distribuer BSD/OS et FreeBSD et &eacute;tend et
acc&eacute;l&egrave;re les initiatives logiciel libre de FreeBSD</h3>

<p>Le nouveau BSDI vendra et supportera FreeBSD, BSD/OS, BSDI Internet Super
Server et une ligne de produits BSD &agrave; valeur ajout&eacute; via ses
r&eacute;seaux mondiaux de distribution aux fournisseurs d'infrastructure
Internet, d&eacute;veloppeurs de solutions int&eacute;gr&eacute;es et utilisateurs
professionnels. BSDI fournira des syst&egrave;mes d'exploitation BSD et
des applications associ&eacute;es, avec un support commercial, des plate-formes
int&eacute;gr&eacute;es pour Internet, le support et des services
techniques, d&eacute;veloppera du logiciel libre, et fournira des prestations
de conseil. La soci&eacute;t&eacute; offrira ses technologies Internet
et r&eacute;seau BSD sur les principales architectures de microprocesseur,
dont Intel, SPARC, Alpha, PowerPC et StrongARM.</p>

<p>BSDI continuera a d&eacute;velopper, am&eacute;liorer et distribuer
BSD/OS et FreeBSD sous les termes de la licence logicielle Berkeley, non
restrictive et favorable aux utilisations commerciales, qui encourage le
d&eacute;veloppement de projets de logiciel libre, syst&egrave;mes embarqu&eacute;s,
applications sp&eacute;cialis&eacute;es, solutions int&eacute;gr&eacute;es
et autres produits bas&eacute;s sur un syst&egrave;me d'exploitation.</p>

<p>BSDI &eacute;tendra et acc&eacute;l&eacute;rera les initiatives logiciel libre
FreeBSD de Walnut Creek CDROM en partageant les innovations&nbsp; techniques
de BSD/OS avec le Projet FreeBSD et en fournissant &agrave; ce projet de
logiciel libre un support technique et op&eacute;rationnel, le marketing
et des fonds. BSDI continuera &agrave; distribuer les versions pr&ecirc;tes
&agrave; l'emploi de&nbsp; FreeBSD et projette aussi de d&eacute;velopper
des produits &agrave; valeur ajout&eacute;e autour de FreeBSD, ainsi que
de fournir support technique, conseil et formation aux utilisateurs de
FreeBSD. Ces initiatives devraient promouvoir et encourager le mouvement
de logiciel libre BSD. Le Projet FreeBSD d&eacute;veloppe le c&eacute;l&eacute;bre
syst&egrave;me d'exploitation FreeBSD et rassemble et int&egrave;gre les
contributions en logiciel de plus de 5.000 d&eacute;veloppeurs dans le
monde entier.</p>

<h3>Les chefs de file de l'Internet et du Logiciel Libre supportent le nouveau
BSDI</h3>

<p>"Nous nous r&eacute;jouissons que BSDI &eacute;paule la communaut&eacute;
logiciel libre FreeBSD," a dit Jordan Hubbard, principal promoteur et co-fondateur
du Projet FreeBSD. "La nouvelle soci&eacute;t&eacute; BSDI
dispose d'une expertise consid&eacute;rable de commercialisation, maintenance,
distribution et support du plus avanc&eacute; des syst&egrave;mes d'exploitation
Internet au monde. Nous sommes enthousiasm&eacute;s et impatients de coop&eacute;rer
avec les principaux d&eacute;veloppeurs de BSDI, et notamment Mike Karels
et les autres membres de l'&eacute;quipe d'origine du CSRG de l'UC Berkeley's,
pour acc&eacute;lerer l'innovation dans le domaine des syst&egrave;mes
d'exploitation, du r&eacute;seau et d'Internet."
<p>"Les syst&egrave;mes d'exploitation libres comme BSD apporte &agrave;
l'utilisateur une meilleure technologie et plus de choix," a d&eacute;clar&eacute;
Eric Raymond, pr&eacute;sident de l'"Open Source Initiative". "Je m'attends
&agrave; ce que BSDI prouve une fois de plus que la communaut&eacute; du
logiciel libre et la communaut&eacute; professionnelle prouvent une fois
de plus qu'elles peuvent faire de grandes choses ensemble et pousser l'industrie
de fa&ccedil;on aussi spectaculaire que l'Internet."</p>

<p>"Nos investigations montrent que BSD et Linux vont augmenter leur pr&eacute;sence
sur les serveurs d'entreprise de 100 &agrave;&nbsp; 500 pour cent dans
les deux ann&eacute;es &agrave; venir pour les applications essentielles
dans les entreprises am&eacute;ricaines," a dit Dave Trowbridge, analyste
senior chez Survey.com. "Cette nouvelle soci&eacute;t&eacute; contribuera
&agrave; garantir que BSD ait sa place au soleil, ce que m&eacute;ritent
son riche h&eacute;ritage et ses solides fondations technologiques."</p>

<h3>A propos du syst&egrave;me d'exploitation "Berkeley Software Distribution"</h3>

<p>Les technologies du syst&egrave;me d'exploitation Berkeley Software Distribution
ont &eacute;t&eacute; d&eacute;velopp&eacute;es &agrave; l'origine de 1979
&agrave; 1992 par le "Computer Systems Research Group" (CSRG) de l'Universit&eacute;
de Californie &agrave; Berkeley. Des d&eacute;riv&eacute;s de ces technologies
de syst&egrave;me d'exploitation et r&eacute;seau de Berkeley sont au coeur
de la plupart des syst&egrave;mes d'exploitation Unix et apparent&eacute;s
modernes. Aujourd'hui, pratiquement tous les grands fournisseurs d'infrastructure
Internet utilisent des syst&egrave;mes d'exploitation BSD. Les technologies
du syst&egrave;me d'exploitation BSD sont utilis&eacute;s dans la plupart
des principaux environnements informatiques critiques et sont embarqu&eacute;es
dans des plate-formes Internet int&eacute;gr&eacute;es qui ont besoin de
fonctionnalit&eacute;s Internet avanc&eacute;es, en m&ecirc;me temps que
de fiabilit&eacute; et de s&eacute;curit&eacute;.</p>

<h3>A propos du Projet FreeBSD</h3>

<p>FreeBSD est un syst&egrave;me d'exploitation libre populaire d&eacute;velopp&eacute;
par le Projet FreeBSD et son &eacute;quipe r&eacute;partie dans le monde
entier, et constitu&eacute;e de plus de 5,000 d&eacute;veloppeurs
dont le travail est int&eacute;gr&eacute;
par 185 d&eacute;veloppeurs "soumetteurs". Il est disponible gratutement
sur ftp.FreeBSD.org et est aussi distribu&eacute; sous forme de produit
logiciel "packag&eacute;" par CompUSA, Fry's, Borders, Ingram, FreeBSDmall.com
et d'autres. FreeBSD incorpore des milliers d'applications port&eacute;es,
dont les plus populaires logiciels Web, Internet et E-mail. FreeBSD est
distribu&eacute; sous les termes de la licence Berkeley Software Distribution,
ce qui signifie qu'il peut &ecirc;tre librement copi&eacute; et modifi&eacute;.
Pour plus d'informations sur le Projet FreeBSD, visitez <a
href="http://www.FreeBSD.org/">www.FreeBSD.org</a>.</p>

<h3>A propos de Walnut Creek</h3>

<p>Walnut Creek CDROM a &eacute;t&eacute; cr&eacute;&eacute; en 1991 et a commenc&eacute;
&agrave; publier du logiciel Linux en 1992, et du logiciel BSD en 1993.
La soci&eacute;t&eacute; a une longue histoire de coop&eacute;ration &eacute;troite
avec la communaut&eacute; du logiciel libre, apportant finances, comp&eacute;tences
et autres ressources aux projets "Open Source". Walnut Creek CDROM publie
de nombreux logiciels, dont FreeBSD et Slackware, la plus BSD des versions
de Linux.</p>

<p>A propos de Berkeley Software Design, Inc. (BSDI)</p>

<p>Les principaux d&eacute;veloppeurs de BSD ont cr&eacute;&eacute; Berkeley
Software Design, Inc. en 1991 pour commercialiser les technologies BSD
et prolonger la tradition Berkeley Unix de syst&egrave;mes d'exploitation
r&eacute;seau et Internet robustes, fiables et extr&egrave;mement s&ucirc;rs.
En fusionnant Berkeley Software Design, Inc. et Walnut Creek CDROM, BSDI
devient le premier fournisseur mondial de syst&egrave;mes d'exploitation
Internet avanc&eacute;s pour l'infrastructure Internet. Vous pouvez contacter
BSDI &agrave; <a href="mailto:info@BSDI.com">info@BSDI.com</a> ou sur
<a href="http://www.BSDI.com/">www.BSDI.com</a>
ou par t&eacute;l&eacute;phone au 1-719-593-9445 (num&eacute;ro vert :
1-800-800-4273).</p>

<h3># # #</h3>

<p>BSD est une marque d&eacute;pos&eacute;e et BSD/OS et BSDI sont des
marques d&eacute;pos&eacute;es de Berkeley Software Design, Inc. Yahoo!
et le logo Yahoo! sont des marques d&eacute;pos&eacute;es de Yahoo!
Inc. Toutes les autres marques cit&eacute;es sont la propri&eacute;t&eacute;
de leurs d&eacute;tenteurs respectifs.</p>

<p>Contacts :<br>
Kevin Rose<br>
BSDI<br>
801-553-8166<br>
<a href="mailto:kgr@bsdi.com">kgr@bsdi.com</a></p>

<p>Jordan Hubbard<br>
FreeBSD Project<br>
925-691-2863<br>
<a href="mailto:jkh@FreeBSD.org">jkh@FreeBSD.org</a></p>

<p>Brigid Fuller<br>
ZNA Communications<br>
831-425-1581<br>
<a href="mailto:brigid@zna.com">brigid@zna.com</a></p>

<br>&nbsp;
<h2>
Note du Traducteur :</h2>
Cette traduction est publi&eacute;e sous r&eacute;serves et &agrave; titre
informatif. N'&eacute;tant ni juriste, ni financier, certains aspects du
document original ont pu m'&eacute;chapper ou &ecirc;tre mal interpr&eacute;t&eacute;s.
Merci au besoin de consulter l'original sur
<a href=">http://www.freebsd.org/news/press-rel-4.html">http://www.freebsd.org/news/press-rel-4.html</a>.
<br>&nbsp;

&footer;
</body>
</html>
