<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-7.sgml,v 1.2 2004/01/06 17:31:42 stephane Exp $">
<!ENTITY title "Communiqu&eacute; de presse FreeBSD 5.0">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
        The FreeBSD French Documentation Project
        Original revision: 1.4

        Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
        Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
&header;

<h3>Le Projet FreeBSD annonce FreeBSD 5.0</h3>

  <p><b>Berkeley, CA - 20 Janvier 2003 - Le Projet FreeBSD</b> Le
    Projet FreeBSD a annonc&eacute; aujourd'hui la disponibilit&eacute; de FreeBSD 5.0
    apr&egrave;s bient&ocirc;t 3 ans de d&eacute;veloppement ininterrompu. La derni&egrave;re
    version de ce projet de syst&egrave;me d'exploitation open-source 
    inclu plusieurs fonctions avanc&eacute;es :</p>

<ul>
  <li><b>Le support multi-processeurs</b> a &eacute;t&eacute; &eacute;tendu et am&eacute;lior&eacute;.
    Nous supportons le SMP sur toutes les plates-formes et nous avons l'infrastructure
    n&eacute;cessaire pour am&eacute;liorer substantiellement les performances.</li>

   <li><b>La v&eacute;rification du syst&egrave;me de fichiers en t&acirc;che de fonds</b> permet un d&eacute;marrage
    plus rapide en cas de probl&egrave;me.</li>

  <li><b>Les "instantan&eacute;s" du syst&egrave;me de fichiers</b> permettent aux administrateurs de
    dupliquer les syst&egrave;mes de fichiers en temps r&eacute;el.</li>

  <li><b>Le support exp&eacute;rimental des Contr&ocirc;les d'Acc&egrave;s Obligatoires ("Mandatory Access Controls" - MAC)</b>
    apporte aux administrateurs un moyen souple de 
    d&eacute;finir des politiques de s&eacute;curit&eacute; syst&egrave;me.</li>

  <li>Les <b>"Kernel Schedulable Entities"</b> impl&eacute;mente un mod&egrave;le de threads
    N-&agrave;-N multi-processeurs &agrave; haute performance.</li>

  <li><b>Une meilleure compatibilit&eacute; mat&eacute;riel</b> qui inclue d&eacute;sormais du mat&eacute;riel
    de cryptographie, l'ACPI, le Bluetooth et le FireWire.</li>

</ul>

  <p>Cette version inclue &eacute;galement d'autres am&eacute;liorations 
    dans des domaines o&ugrave; FreeBSD excellait d&eacute;j&agrave;, comme
    les performances r&eacute;seaux, la stabilit&eacute; et la fiabilit&eacute;.</p>

  <p><cite>"Cette version repr&eacute;sente notre plus grande r&eacute;ussite technique jusqu'&agrave;
   aujourd'hui."</cite>, d&eacute;clare Murray Stokely, vice-pr&eacute;sident technique
   chez FreeBSD Mall Inc et membre de l'&eacute;quipe technique en charge de la
   production des versions de FreeBSD. <cite>"Les nouvelles technologies pr&eacute;sentes
   dans FreeBSD 5.X apporteront &agrave; nos utilisateurs de nouvelles possibilit&eacute;s excitantes sans
   sacrifier notre l&eacute;gendaire fiabilit&eacute;."</cite>

<h3>A propos du projet FreeBSD</h3>

  <p>Le projet FreeBSD a pour but de fournir un syst&egrave;me d'exploitation libre et gratuit de type UNIX
    pour les plates-formes compatibles Intel, Alpha et Sparc, bas&eacute; sur le 
    standard "Berkeley Software Distribution". Le projet
    FreeBSD regroupe plusieurs milliers de d&eacute;veloppeurs des quatre coins du
    monde, dont les efforts sont coordonn&eacute;s &agrave; travers une &eacute;quipe 
    de plusieurs centaines de participants actifs ("committers"). FreeBSD est disponible librement sur
    Internet et est &eacute;galement distribu&eacute; par diff&eacute;rents
    revendeurs dont la liste est disponible sur la page <a
    href="http://www.FreeBSD.org/vendors.html">www.FreeBSD.org/vendors.html</a>.
    Pour plus d'informations, merci de visiter le site web de FreeBSD <a
    href="http://www.FreeBSD.org/">www.FreeBSD.org</a>.</p>

<h3>Contact pour la presse</h3>

  <p><a href="mailto:press@FreeBSD.org">press@FreeBSD.org</a>, ou t&eacute;l&eacute;phoner au
    1-925-674-0783</p>

&footer;
</body>
</html>


