<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/news/press-rel-1.sgml,v 1.2 2003/12/29 17:23:43 stephane Exp $">
<!ENTITY title "FreeBSD - revue de presse : 22 avril 1999">
<!ENTITY % navincludes SYSTEM "../includes.navabout.sgml"> %navincludes;
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
<!ENTITY % newsincludes SYSTEM "includes.sgml"> %newsincludes;
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.7

   Version francaise : Guillain
   Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
-->

<html>
&header;

<!--
<img src="&enbase;/gifs/pressreleases.jpg" align="right" border="0">
-->

<p></p>

<h2>FreeBSD utilis&eacute; pour g&eacute;n&eacute;rer de spectaculaires effets sp&eacute;ciaux</h2>

<p><b>Concord, CA, 22 avril 1999</b> :
32 syst&egrave;mes FreeBSD bi-processeurs ont &eacute;t&eacute; utilis&eacute;s pour g&eacute;n&eacute;rer un grand nombre
d'effets sp&eacute;ciaux dans le film avant-gardiste de Warner Brothers, <em>
Matrix</em>.</p>

<p>La soci&eacute;t&eacute; Manex Visual Effects a utilis&eacute; 32 syst&egrave;mes Dell Precision 410 bi-processeurs P-II/450
sous FreeBSD comme &eacute;l&eacute;ment central de "CG Render Farm". Charles
Henrich, l'administrateur syst&egrave;me s&eacute;nior de Manex, a d&eacute;clar&eacute; : "En production,
nous sommes arriv&eacute;s au point o&ugrave; nous avons r&eacute;alis&eacute; que la puissance de calcul
de nos infrastructures SGI existantes n'&eacute;tait pas suffisante pour
les s&eacute;quences utilisant la 3D intensivement. C'est &agrave; ce moment que nous avons d&eacute;cid&eacute;
d'utiliser une solution bas&eacute;e sur FreeBSD, &agrave; cause de la possibilit&eacute; d'acqu&eacute;rir rapidement le mat&eacute;riel
ainsi qu'&agrave; la fiabilit&eacute; et &agrave; la facilit&eacute; d'administration que
nous offre FreeBSD. Travaillant avec Dell, nous avons acquis 32 de ces
syst&egrave;mes un mercredi et nous avons pu les utiliser en production
le samedi apr&egrave;s-midi. Cela a demand&eacute; un incroyable effort pour tout le
monde et je ne pense pas que cela aurait &eacute;t&eacute; m&ecirc;me possible si
nous avions choisi un autre syst&egrave;me d'exploitation."</p>

<p>Le syst&egrave;me d'exploitation FreeBSD est un puissant syst&egrave;me d'exploitation enti&egrave;rement open-source
bas&eacute; sur la version BSD (Berkeley Software Distribution) d'Unix. Il est
disponible gratuitement sur de nombreux sites web Internet ainsi que
sur c&eacute;d&eacute;rom chez Walnut Creek CDROM et inclu des milliers d'applications
comme des logiciels de rendus graphiques 3D ainsi que beaucoup d'autres
outils tout aussi performants. FreeBSD est optimis&eacute; pour les processeurs Intel x86,
lesquels sont au coeur d'un nombre vari&eacute; d'ordinateurs personnels actuels.
Infiniment personnalisable, FreeBSD est au coeur
d'applications Internet telles que Yahoo! et U.S. West
car il n'est pas encombr&eacute; par les restrictions li&eacute;es &agrave; une licence commerciale et peut &ecirc;tre
copi&eacute; et modifi&eacute; librement.</p>

<p>Pour plus d'informations sur FreeBSD, visitez <a href="http://www.FreeBSD.org/">
http://www.FreeBSD.org/</a> et <a href="http://www.cdrom.com/">
http://www.cdrom.com/</a>. Pour plus d'informations sur Manex Visual
Effects, veuillez visiter <a href="http://www.mvfx.com/">http://www.mvfx.com/
</a>.</p>

&footer;
</body>
</html>
