freebsd/freebsd-doc/fr_FR.ISO8859-1/man/man4/agp.4
.\" Copyright (c) 2001 Yar Tikhiy
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\" $Id: agp.4,v 1.1 2002-09-29 20:39:12 blackend Exp $
.\" Original revision: 1.3
.\"
.Dd October 5, 2001
.Dt AGP 4
.Os
.Sh NAME
.Nm agp
.Nd "interface générique au Port Graphique Acceléré (AGP)"
.Sh SYNOPSIS
.Cd "device agp"
.Sh DESCRIPTION
Le pilote
.Nm
fournit des méthodes abstraites et uniformes pour contrôler les
périphériques suivants:
.Bl -bullet -offset indent -compact
.It
Pont hôte-vers-AGP Ali M1541
.It
.\" 761 not in -stable
Ponts hôte-vers-AGP AMD 751 et 761
.It
Pont hôte-vers-AGP Intel i820, i840, i845, i850, et i860
.It
Contrôleurs SVGA Intel i810, i810-DC100, i810E, et i815
.It
Pont hôte-vers-AGP Intel 82443GX
.It
Pont hôte-vers-AGP SiS 5591
.El
.Pp
L'application la plus courante d'
.Nm
est d'exécuter
.Xr XFree86 1
sur les contrôleurs Intel i81x.
.Sh FILES
.Bl -tag -width ".Pa /dev/agpgart" -compact
.It Pa /dev/agpgart
fichier spécial de périphérique AGP.
.El
.Sh VOIR AUSSI
.Xr XFree86 1
.Sh HISTORIQUE
Le pilote
.Nm
est apparu pour la première fois sous
.Fx 4.1 .
