Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/problem-reports/*.po
Languages: es_es, pt_br

source: The first thing you need to do is to decide what part of the system your problem lies in. Remember, FreeBSD is a complete operating system, which installs both a kernel, the standard libraries, many peripheral drivers, and a large number of utilities (the <quote>base system</quote>). However, there are thousands of additional applications in the Ports Collection. You'll first need to decide if the problem is in the base system or something installed via the Ports Collection.
es_es: Lo primero que debe hacer es decidir en qué parte del sistema se encuentra su problema. Recuerde, FreeBSD es un sistema operativo completo, instala un kernel, la biblioteca estándar, muchos controladores de periféricos y un gran número de utilidades (el <quote>sistema base</quote>). Sin embargo, hay miles de aplicaciones adicionales en la colección de ports. Primero deberá decidir si el problema está en el sistema base o en algo instalado a través de la colección de ports.
pt_br: A primeira coisa que você precisa fazer é decidir em que parte do sistema está seu problema. Lembre-se, o FreeBSD é um sistema operacional completo, que instala tanto um kernel, bibliotecas padrão, muitos drivers de periféricos e um grande número de utilitários (o <quote>sistema básico</quote>). No entanto, existem milhares de aplicativos adicionais na coleção de portes. Você primeiro precisa decidir se o problema está no sistema básico ou algo instalado via a Coleção de Ports.

source: Here is a description of the major categories:
es_es: Aquí una descripción de las principales categorías:
pt_br: Aqui está uma descrição das categorias principais:

source: If a problem is with the kernel, the libraries (such as standard C library <literal>libc</literal>), or a peripheral driver in the base system, in general you will use the <literal>kern</literal> category. (There are a few exceptions; see below). In general these are things that are described in section 2, 3, or 4 of the manual pages.
es_es: Si hay un problema con el kernel, las bibliotecas (como la biblioteca estándar de C <literal>libc</literal>) o en un controlador de un periférico en el sistema base, en general, utilizará la categoría <literal>kern</literal>. (Hay algunas excepciones; vea más abajo). En general, estas son las cosas que se describen en la sección 2, 3 ó 4 de las páginas del manual.
pt_br: Se um problema for com o kernel, as bibliotecas (como a biblioteca C padrão <literal>libc</literal>), ou o driver de algum periférico no sistema base, em geral você irá usar a categoria <literal>kern</literal>. (Existem algumas exceções; veja abaixo). Em geral, são coisas descritas nas seções 2, 3 ou 4 das páginas de manual.

source: If a problem is with a binary program such as <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry>, you will first need to determine whether these programs are in the base system or were added via the Ports Collection. If you are unsure, you can do <command>whereis <replaceable>programname</replaceable></command>. FreeBSD's convention for the Ports Collection is to install everything underneath <filename class="directory">/usr/local</filename>, although this can be overridden by a system administrator. For these, you will use the <literal>ports</literal> category (yes, even if the port's category is <literal>www</literal>; see below). If the location is <filename class="directory">/bin</filename>, <filename class="directory">/usr/bin</filename>, <filename class="directory">/sbin</filename>, or <filename class="directory">/usr/sbin</filename>, it is part of the base system, and you should use the <literal>bin</literal> category. (A few programs, such as <citerefentry><refentrytitle>gcc</refentrytitle><manvolnum>1</manvolnum></citerefentry>, actually use the <literal>gnu</literal> category, but do not worry about that for now.) These are all things that are described in section 1 or 8 of the manual pages.
pt_br: Se for um problema com um programa binário, como o <citerefentry> <refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou o <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry>, primeiro você irá precisar determinar se esses programas estão no sistema base ou se foram adicionados por meio da Coleção de Ports. Se não tiver certeza, você pode executar o <command>whereis<replaceable> nome do programa</replaceable></command>. A convenção do FreeBSD para a Coleção de Ports é instalar tudo no diretório <filename class="directory">/usr/local</filename>, embora isso possa ser substituído por um administrador do sistema. Para estes, você usará a categoria <literal>ports</literal> (sim, mesmo se a categoria do port for <literal>www</literal>; veja abaixo). Se a localização for no diretório <filename class="directory">/bin</filename>, <filename class="directory">/usr/bin</filename>, <filename class="directory">/sbin</filename> , ou <filename class="directory">/usr/sbin</filename>, faz parte do sistema base, e você deve usar a categoria <literal>bin</literal>. (Alguns programas, como o <citerefentry><refentrytitle>gcc</refentrytitle><manvolnum>1</manvolnum></citerefentry>, na verdade usam a categoria <literal>gnu</literal>, mas não se preocupe com isso por enquanto.) Estas são todas as coisas descritas na seção 1 ou 8 das páginas do manual.

source: If you believe that the error is in the startup <literal>(rc)</literal> scripts, or in some kind of other non-executable configuration file, then the right category is <literal>conf</literal> (configuration). These are things that are described in section 5 of the manual pages.
es_es: Si cree que el error está en los scripts de inicio <literal>(rc)</literal>, o en algún otro tipo de archivo de configuración no ejecutable, entonces la categoría correcta es <literal>conf</literal> (configuración). Estas son las cosas que se describen en la sección 5 de las páginas del manual.
pt_br: Se você acredita que o erro está nos scripts de inicialização <literal>(rc)</literal>, ou em algum outro tipo de arquivo de configuração não-executável, então a categoria correta é <literal>conf</literal> (configuração) . Estas são as coisas descritas na seção 5 das páginas de manual.

source: If you have found a problem in the documentation set (articles, books, man pages), the correct choice is <literal>docs</literal>.
pt_br: Se você encontrou um problema no conjunto de documentação (artigos, livros, man pages), a escolha correta é <literal>docs</literal>.

source: If you are having a problem with the <link xlink:href="http://www.FreeBSD.org">FreeBSD web pages</link>, the proper choice is <literal>www</literal>.
pt_br: Se você estiver tendo um problema com as <link xlink:href="http://www.FreeBSD.org">páginas web do FreeBSD</link>, a escolha apropriada é <literal>www</literal>.

source: if you are having a problem with something from a port named <literal>www/<replaceable>someportname</replaceable></literal>, this nevertheless goes in the <literal>ports</literal> category.
es_es: Si tiene un problema con un port llamado <literal>www/<replaceable>algunnombredeport</replaceable></literal>, esto entra en la categoría de <literal>ports</literal>.
pt_br: Se você estiver tendo um problema com algum port chamado <literal>www/<replaceable>algum nome de port</replaceable></literal>, mesmo assim, isso vai na categoria <literal>ports</literal>.

source: There are a few more specialized categories.
es_es: Hay algunas categorías más especializadas.
pt_br: Existem algumas categorias mais especializadas.

source: If the problem would otherwise be filed in <literal>kern</literal> but has to do with the USB subsystem, the correct choice is <literal>usb</literal>.
es_es: Si el problema se catalogará en <literal>kern</literal> pero estuviera relacionado con el subsistema USB, la elección correcta es <literal>usb</literal>.
pt_br: Se o problema, por outro lado, estar colocado em <literal>kern</literal>, mas tem a ver com o subsistema USB, a escolha correta é <literal>usb</literal>.

source: If the problem would otherwise be filed in <literal>kern</literal> but has to do with the threading libraries, the correct choice is <literal>threads</literal>.
es_es: Si el problema se catalogará en <literal>kern</literal> pero estuviera relacionado con las bibliotecas de threading, la elección correcta es <literal>threads</literal>.
pt_br: Se o problema, por outro lado, estiver colocado em <literal>kern</literal>, mas tem a ver com as bibliotecas de threads, a escolha correta é <literal>threads</literal>.

source: If the problem would otherwise be in the base system, but has to do with our adherence to standards such as <trademark class="registered">POSIX</trademark>, the correct choice is <literal>standards</literal>.
es_es: Si el problema se catalogará en el sistema base, pero estuviera relacionado con nuestra interpretación de estándares, como <trademark class="registered">POSIX</trademark>, la elección correcta es <literal>standards</literal>.
pt_br: Se o problema, por outro lado, estiver no sistema base, mas tem a ver com nossa fidelidade a padrões como <trademark class="registered">POSIX</trademark>, a escolha correta é <literal>standards</literal>.

source: If the problem has to do with errors internal to a <trademark>Java Virtual Machine</trademark> (<trademark>JVM</trademark>), even though <trademark>Java</trademark> was installed from the Ports Collection, you should select the <literal>java</literal> category. More general problems with <trademark>Java</trademark> ports still go under <literal>ports</literal>.
pt_br: Se o problema for relacionado a erros internos de uma <trademark>Java Virtual Machine</trademark> (<trademark>JVM</trademark> Maquina Virtual do Java), mesmo que o <trademark>Java</trademark> tenha sido instalado a partir da coleção de ports, deve ser selecionada a categoria <literal>java</literal>. Problemas mais gerais com os ports <trademark>Java</trademark> ainda irão estar em <literal>ports</literal>.

source: This leaves everything else.
pt_br: Isso deixa tudo mais.

source: If you are convinced that the problem will only occur under the processor architecture you are using, select one of the architecture-specific categories: commonly <literal>i386</literal> for Intel-compatible machines in 32-bit mode; <literal>amd64</literal> for AMD machines running in 64-bit mode (this also includes Intel-compatible machines running in EMT64 mode); and less commonly <literal>arm</literal>, <literal>ia64</literal>, <literal>powerpc</literal>, and <literal>sparc64</literal>.
pt_br: Se estiver convencido de que o problema ocorrerá apenas sob a arquitetura do processador que você está usando, selecione uma das categorias específicas da arquitetura: geralmente <literal>i386</literal> para máquinas compatíveis com Intel 32 bits; <literal>amd64</literal> para máquinas AMD rodando em de 64 bits (isto também inclui máquinas compatíveis com Intel rodando em modo EMT64); e menos comum, as arquiteturas <literal>arm</literal>, <literal>ia64</literal>, <literal>powerpc</literal> e <literal>sparc64</literal>.

source: These categories are quite often misused for <quote>I do not know</quote> problems. Rather than guessing, please just use <literal>misc</literal>.
es_es: Estas categorías se utilizan con frecuencia para los problemas <quote>No lo sé</quote>. En lugar de suponer, utilice <literal>misc</literal>.
pt_br: Estas categorias são muitas vezes mal utilizadas para problemas definidos como <quote>Eu não sei</quote>. Em vez de adivinhar, por favor use apenas <literal>misc</literal>.

source: Correct Use of Arch-Specific Category
es_es: Uso correcto de la categoría de arquitectura específica
pt_br: Uso Correto da Categoria Específica de Arquitetura

source: You have a common PC-based machine, and think you have encountered a problem specific to a particular chipset or a particular motherboard: <literal>i386</literal> is the right category.
es_es: Tiene un ordenador común (PC-based machine), y cree que ha encontrado un problema específico para un conjunto de chips o una placa base en particular: <literal>i386</literal> es la categoría correcta.
pt_br: Você tem uma máquina comum baseada em PC e acha que encontrou um problema específico para um determinado chipset ou uma placa-mãe em particular: <literal>i386</literal> é a categoria correta.

source: Incorrect Use of Arch-Specific Category
es_es: Uso incorrecto de la categoría de arquitectura específica
pt_br: Uso Incorreto da Categoria Específica de Arquitetura

source: You are having a problem with an add-in peripheral card on a commonly seen bus, or a problem with a particular type of hard disk drive: in this case, it probably applies to more than one architecture, and <literal>kern</literal> is the right category.
es_es: Está teniendo un problema con una tarjeta periférica adicional en un bus común, o un problema con un tipo particular de unidad de disco duro: en este caso, probablemente afecte a más de una arquitectura, y <literal>kern</literal> es la categoría correcta.
pt_br: Você está tendo um problema com uma placa periférica adicional em um barramento comum, ou um problema com um tipo específico de unidade de disco rígido: neste caso, provavelmente se aplica a mais de uma arquitetura, e <literal>kern</literal> é a categoria correta.

source: If you really do not know where the problem lies (or the explanation does not seem to fit into the ones above), use the <literal>misc</literal> category. Before you do so, you may wish to ask for help on the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions mailing list</link> first. You may be advised that one of the existing categories really is a better choice.
es_es: Si realmente no sabe dónde está el problema (o la explicación no parece encajar en los anteriores), use la categoría <literal>misc</literal>. Antes de hacerlo, es posible que primero desee solicitar ayuda en la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de correo de preguntas generales de FreeBSD</link>. Es posible que le indiquen que una de las categorías ya existentes es mejor opción.
pt_br: Se você realmente não sabe onde o problema se encaixa (ou a explicação não parece se encaixar nos itens acima), use a categoria <literal>misc</literal>. Antes de fazer isso, você pode pedir ajuda primeiro na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de discussão de perguntas gerais do FreeBSD</link>. Você pode ser avisado que com certeza uma das categorias existentes é uma escolha melhor.

source: Here is the current list of categories (taken from <uri xlink:href="https://svnweb.freebsd.org/base/head/gnu/usr.bin/send-pr/categories">https://svnweb.freebsd.org/base/head/gnu/usr.bin/send-pr/categories</uri>):
pt_br: Aqui está a lista atual de categorias atual (retiradas de <uri xlink:href="https://svnweb.freebsd.org/base/head/gnu/usr.bin/send-pr/categories">https://svnweb.freebsd.org/base/head/gnu/usr.bin/send-pr/categories</uri>):

source: <literal>advocacy:</literal> problems relating to FreeBSD's public image. Obsolete.
pt_br: <literal> advocacy: </literal> problemas relacionados à imagem pública do FreeBSD. Obsoleto.

source: <literal>amd64:</literal> problems specific to the AMD64 platform.
pt_br: <literal>amd64:</literal> problemas específicos da plataforma AMD64.

source: <literal>arm:</literal> problems specific to the ARM platform.
pt_br: <literal>arm:</literal> problemas específicos da plataforma ARM.

source: <literal>bin:</literal> problems with userland programs in the base system.
pt_br: <literal>bin:</literal> problemas com programas em espaço de usuário no sistema base.

source: <literal>conf:</literal> problems with configuration files, default values, and so forth.
pt_br: <literal>conf:</literal> problemas com arquivos de configuração, valores padrão e assim por diante.

source: <literal>docs:</literal> problems with manual pages or on-line documentation.
pt_br: <literal>docs:</literal> problemas com páginas de manual ou documentação on-line.

source: <literal>gnu:</literal> problems with imported GNU software such as <citerefentry><refentrytitle>gcc</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry><refentrytitle>grep</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
pt_br: <literal>gnu:</literal> problemas com software GNU importado, como <citerefentry><refentrytitle>gcc</refentrytitle><manvolnum>1</manvolnum></citerefentry> ou <citerefentry><refentrytitle>grep</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: <literal>i386:</literal> problems specific to the <trademark>i386</trademark> platform.
pt_br: <literal>i386:</literal> problemas específicos da plataforma <trademark>i386</trademark>.

source: <literal>ia64:</literal> problems specific to the ia64 platform.
pt_br: <literal>ia64:</literal> problemas específicos da plataforma ia64.

source: <literal>java:</literal> problems related to the <trademark>Java</trademark> Virtual Machine.
pt_br: <literal>java:</literal> problemas relacionados à máquina virtual do <trademark>Java</trademark>.

source: <literal>kern:</literal> problems with the kernel, (non-platform-specific) device drivers, or the base libraries.
pt_br: <literal>kern:</literal> problemas com o kernel, drivers de dispositivos (sem-plataforma-especifica) ou as bibliotecas da base.

source: <literal>misc:</literal> anything that does not fit in any of the other categories. (Note that there is almost nothing that truly belongs in this category, except for problems with the release and build infrastructure. Temporary build failures on <literal>HEAD</literal> do not belong here. Also note that it is easy for things to get lost in this category).
pt_br: <literal>misc:</literal> qualquer coisa que não se encaixe em nenhuma das outras categorias. (Note que não há quase nada que realmente pertença a esta categoria, exceto por problemas com a infraestrutura de release e build. Falhas de compilação temporárias na branch <literal>HEAD</literal> não pertencem a essa categoria. Note também que é fácil para as coisas se perderem nessa categoria).

source: <literal>ports:</literal> problems relating to the Ports Collection.
pt_br: <literal>ports:</literal> problemas relacionados à Coleção de Ports.

source: <literal>powerpc:</literal> problems specific to the <trademark class="registered">PowerPC</trademark> platform.
pt_br: <literal>powerpc:</literal> problemas específicos da plataforma <trademark class="registered">PowerPC</trademark>.

source: <literal>sparc64:</literal> problems specific to the <trademark class="registered">SPARC64</trademark> platform.
pt_br: <literal>sparc64:</literal> problemas específicos da plataforma <trademark class="registered">SPARC64</trademark>.

source: <literal>standards:</literal> standards conformance issues.
pt_br: <literal>standards:</literal> problemas de conformidade de padrões.

source: <literal>threads:</literal> problems related to the FreeBSD threads implementation (especially on FreeBSD-CURRENT).
pt_br: <literal>threads:</literal> problemas relacionados a implementação de threads do FreeBSD (especialmente no FreeBSD-CURRENT).

source: <literal>usb:</literal> problems related to the FreeBSD USB implementation.
pt_br: <literal>usb:</literal> problemas relacionados à implementação de USB no FreeBSD.

source: <literal>www:</literal> changes or enhancements to the FreeBSD website.
pt_br: <literal>www:</literal> alterações ou melhorias no site do FreeBSD.

source: <emphasis>Class:</emphasis> Choose one of the following:
pt_br: <emphasis>Class:</emphasis> Escolha uma das seguintes opções:

source: <literal>sw-bug:</literal> software bugs.
pt_br: <literal>sw-bug:</literal> bugs em software.

source: <literal>doc-bug:</literal> errors in documentation.
pt_br: <literal>doc-bug:</literal> bugs na documentação.

source: <literal>change-request:</literal> requests for additional features or changes in existing features.
pt_br: <literal>change-request:</literal> requisições para recursos adicionais ou alterações em recursos existentes.

source: <literal>update:</literal> updates to ports or other contributed software.
pt_br: <literal>update:</literal> atualizações para ports ou outra atribuição de software.

source: <literal>maintainer-update:</literal> updates to ports for which you are the maintainer.
pt_br: <literal>maintainer-update:</literal> atualização para ports que você é o mantenedor.

source: <emphasis>Release:</emphasis> The version of FreeBSD that you are running. This needs to be filled in.
pt_br: <emphasis>Release:</emphasis> A versão do FreeBSD que você está executando. Isto precisa ser preenchido.

source: Finally, there is a series of multi-line fields:
pt_br: Finalmente, aqui está uma série de campos com várias linhas:

source: <emphasis>Environment:</emphasis> This should describe, as accurately as possible, the environment in which the problem has been observed. This includes the operating system version, the version of the specific program or file that contains the problem, and any other relevant items such as system configuration, other installed software that influences the problem, etc.—quite simply everything a developer needs to know to reconstruct the environment in which the problem occurs.
es_es: <emphasis>Environment:</emphasis> Esto debe describir, con la mayor precisión posible, el entorno en el que se ha observado el problema. Esto incluye la versión del sistema operativo, la versión del programa o archivo específico que contiene el problema y cualquier otro elemento relevante como la configuración del sistema, otro software instalado que influya en el problema, etc. — simplemente todo lo que un desarrollador necesita saber para reconstruir el entorno en el que se produce el problema.
pt_br: <emphasis>Environment:</emphasis> Isto deve descrever, com a maior precisão possível, o ambiente em que o problema foi observado. Isto inclui a versão do sistema operacional, a versão do programa ou arquivo específico que contém o problema e quaisquer outros itens relevantes, como configuração do sistema, outro software instalado que influencia no problema, etc. - simplesmente tudo o que um desenvolvedor precisa saber para reconstruir o ambiente em que ocorra o problema.

source: <emphasis>Description:</emphasis> A complete and accurate description of the problem you are experiencing. Try to avoid speculating about the causes of the problem unless you are certain that you are on the right track, as it may mislead a developer into making incorrect assumptions about the problem.
pt_br: <emphasis>Description:</emphasis> Uma descrição completa e precisa do problema que você está enfrentando. Tente evitar especular sobre as causas do problema, a menos que tenha certeza de que você está no caminho certo, pois isso pode induzir o desenvolvedor a fazer suposições incorretas sobre o problema.

source: <emphasis>How-To-Repeat:</emphasis> A summary of the actions you need to take to reproduce the problem.
pt_br: <emphasis>How-To-Repeat:</emphasis> Um resumo das ações que você precisa realizar para reproduzir o problema.
