Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/problem-reports/*.po
Languages: es_es, pt_br

source: <emphasis>Fix:</emphasis> Preferably a patch, or at least a workaround (which not only helps other people with the same problem work around it, but may also help a developer understand the cause for the problem), but if you do not have any firm ideas for either, it is better to leave this field blank than to speculate.
pt_br: <emphasis>Fix:</emphasis> De preferência um patch, ou pelo menos uma solução alternativa (que não só ajuda outras pessoas com o mesmo problema a contorná-lo, mas também pode ajudar um desenvolvedor a entender a causa do problema), mas se você não tem idéias firmes para nenhum dos dois, é melhor deixar esse campo em branco do que especular.

source: Sending the Problem Report
pt_br: Enviando o Relatório de Problemas

source: If you are using the <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi">web form</link>:
pt_br: Se você estiver usando o <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi">formulário web</link>:

source: Before you hit <literal>submit</literal>, you will need to fill in a field containing text that is represented in image form on the page. This unfortunate measure has had to be adopted due to misuse by automated systems and a few misguided individuals. It is a necessary evil that no one likes; please do not ask us to remove it.
pt_br: Antes de clicar em <literal>submit</literal>, você irá precisar preencher um campo contendo um texto que é representado em forma de imagem na página. Esta infeliz medida teve que ser adotada devido ao uso indevido por sistemas automatizados e alguns indivíduos mal orientados. É um mal necessário que ninguém gosta; por favor, não nos peça para removê-lo.

source: Note that you are <literal>strongly advised</literal> to save your work somewhere before hitting <literal>submit</literal>. A common problem for users is to have their web browser displaying a stale image from its cache. If this happens to you, your submission will be rejected and you may lose your work.
pt_br: Note que é <literal>fortemente recomendado</literal> salvar seu trabalho em algum lugar antes de clicar em <literal>submit</literal>. Um problema comum para os usuários é ter seu navegador web exibindo uma imagem obsoleta de seu cache. Se isso acontecer com você, seu envio será rejeitado e você poderá perder seu trabalho.

source: If you are unable to view images for any reason, please accept our apologies for the inconvenience and email your problem report to the bugbuster team at <email>freebsd-bugbusters@FreeBSD.org</email>.
pt_br: Se você não conseguir ver as imagens por qualquer motivo, aceite nossas desculpas pelo inconveniente e envie seu relatório por e-mail para a equipe do bugbuster através de <email>freebsd-bugbusters@FreeBSD.org</email>.

source: Follow-up
pt_br: Acompanhamento

source: Once the problem report has been filed, you will receive a confirmation by email which will include the tracking number that was assigned to your problem report and a URL you can use to check its status. With a little luck, someone will take an interest in your problem and try to address it, or, as the case may be, explain why it is not a problem. You will be automatically notified of any change of status, and you will receive copies of any comments or patches someone may attach to your problem report's audit trail.
es_es: Una vez que se haya enviado el informe de problemas, recibirá una confirmación por correo electrónico que incluirá el número de seguimiento que se asignó a su informe de problemas y una URL que puede usar para verificar su estado. Con un poco de suerte, alguien se interesará en su problema e intentará solucionarlo o, según sea el caso, explicará por qué no es un problema. Se le notificará automáticamente de cualquier cambio de estado y recibirá copias de los comentarios o parches que alguien pueda adjuntar al registro de auditoría de su informe de problemas.
pt_br: Uma vez que o relatório de problema foi colocado na fila, você receberá uma confirmação por e-mail que incluirá o número de rastreamento que foi atribuído ao seu relatório de problema e uma URL que você pode usar para verificar seu status. Com um pouco de sorte, alguém se interessará por seu problema e tentará resolvê-lo, ou, conforme o caso, explicar por que isso não é um problema. Você será automaticamente notificado de qualquer alteração de status e receberá cópias de quaisquer comentários ou correções que alguém possa anexar à trilha de auditoria do seu relatório de problemas.

source: If someone requests additional information from you, or you remember or discover something you did not mention in the initial report, please submit a follow up. The number one reason for a bug not getting fixed is lack of communication with the originator.
pt_br: Se alguém solicitar informações adicionais de você, lembrar ou descobrir algo que você não mencionou no relatório inicial, por favor, adicione um novo comentário de acompanhamento. O motivo número um para um bug não ser corrigido é a falta de comunicação com o criador do relatório.

source: The easiest way is to use the comment option on the individual PR's web page, which you can reach from the <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">PR search page</link>.
pt_br: A maneira mais fácil é usar a opção de comentário na página web do PR individual, que você pode acessar na <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">página de pesquisa de PR</link>.

source: If the problem report remains open after the problem has gone away, just add a comment saying that the problem report can be closed, and, if possible, explaining how or when the problem was fixed.
es_es: Si el informe de problemas permanece abierto una vez que dicho problema ha desaparecido, solo agregue un comentario que indique que el informe de problemas se puede cerrar y, a ser posible, explique cómo o cuándo se solucionó el problema.
pt_br: Se o relatório de problemas permanecer aberto após o desaparecimento do problema, basta adicionar um comentário dizendo que o relatório de problemas pode ser fechado e, se possível, explicar como ou quando o problema foi corrigido.

source: Sometimes there is a delay of a week or two where the problem report remains untouched, not assigned or commented on by anyone. This can happen when there is an increased problem report backlog or during a holiday season. When a problem report has not received attention after several weeks, it is worth finding a committer particularly interested in working on it.
es_es: A veces hay un retraso de una o dos semanas en las cuales el informe del problema está sin cambios, sin asignar, ni comentado por nadie. Esto puede suceder cuando hay una acumulación de informes de problemas o durante la temporada de vacaciones. Cuando un informe de problemas no ha recibido atención después de varias semanas, vale la pena encontrar a un committer que esté interesado en trabajar en él.
pt_br: As vezes, há um atraso de uma semana ou duas em que o relatório do problema permanece intocado, não atribuído ou comentado por alguém. Isto pode acontecer quando há um aumento na lista de pendências de relatórios de problemas ou durante uma temporada de feriados. Quando um relatório de problema não recebe atenção após várias semanas, vale a pena encontrar um committer particularmente interessado em trabalhar nele.

source: There are a few ways to do so, ideally in the following order, with a few days between attempting each communication channel:
es_es: Hay varias formas de hacerlo, lo ideal es el orden siguiente, con algunos días entre cada intento:
pt_br: Existem algumas maneiras de se fazer isso, idealmente na seguinte ordem, com alguns dias entre a tentativa em cada canal de comunicação:

source: Find the relevant FreeBSD mailing list for the problem report from the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">list in the Handbook</link> and send a message to that list asking about assistance or comments on the problem report.
es_es: Encuentre la lista de correo de FreeBSD que sea relevante para el informe de problemas en <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">la lista del manual</link> y envíe un mensaje a esa lista preguntando por asistencia o comentarios sobre el informe de problemas.
pt_br: Encontre a lista de discussão relevante do FreeBSD para o relatório de problemas <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">listadas no Handbook</link> e envie uma mensagem para essa lista perguntando sobre assistência ou comentários sobre o relatório do problema.

source: Join the relevant <acronym>IRC</acronym> channels. A partial listing is here: <link xlink:href="https://wiki.freebsd.org/IrcChannels"/>. Inform the people in that channel about the problem report and ask for assistance. Be patient and stay in the channel after posting, so that the people from different time zones around the world have a chance to catch up.
es_es: Únase a los canales de <acronym>IRC</acronym> relevantes. Aquí un listado parcial: <link xlink:href="https://wiki.freebsd.org/IrcChannels"/>. Informe a las personas en ese canal sobre el informe del problema y solicite asistencia. Sea paciente y permanezca en el canal después de la publicación, para que las personas de diferentes zonas horarias de todo el mundo tengan la oportunidad de ponerse al día.
pt_br: Junte-se aos canais relevantes do <acronym>IRC</acronym>. Uma lista parcial está aqui: <link xlink:href="https://wiki.freebsd.org/IrcChannels"/>. Informe as pessoas nesse canal sobre o relatório de problemas e peça ajuda. Seja paciente e fique no canal depois de postar, para que as pessoas de diferentes fusos horários ao redor do mundo tenham a chance de responder.

source: Find committers interested in the problem that was reported. If the problem was in a particular tool, binary, port, document, or source file, check the <link xlink:href="http://svnweb.FreeBSD.org">SVN Repository</link>. Locate the last few committers who made substantive changes to the file, and try to reach them via <acronym>IRC</acronym> or email. A list of committers and their emails can be found in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors">Contributors to FreeBSD</link> article.
es_es: Encuentre a committers interesados en el problema que reportó. Si el problema estaba en una herramienta, binario, port, documento o un fichero de código fuente en particular, verifique el <link xlink:href="http://svnweb.FreeBSD.org">repositorio SVN</link>. Localice a los últimos committers que realizaron cambios sustanciales en el archivo e intente acceder a ellos a través de <acronym>IRC</acronym> o correo electrónico. Puede encontrar una lista de los committers y sus correos electrónicos en el artículo <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/contributors">Colaboradores de FreeBSD</link>.
pt_br: Encontre committers interessados no problema que foi relatado. Se o problema estiver em uma ferramenta, binário, porta, documento ou arquivo fonte específico, verifique o <link xlink:href="http://svnweb.FreeBSD.org">Repositório SVN</link>. Localize os últimos committers que fizeram alterações substanciais no arquivo e tente falar com eles pelo <acronym>IRC</acronym> ou por email. Uma lista de committers e seus e-mails podem ser encontrados no artigo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors">Contributors do FreeBSD</link>.

source: Remember that these people are volunteers, just like maintainers and users, so they might not be immediately available to assist with the problem report. Patience and consistency in the follow-ups is highly advised and appreciated. With enough care and effort dedicated to that follow-up process, finding a committer to take care of the problem report is just a matter of time.
es_es: Recuerde que estas personas son voluntarios, al igual que los maintainers y usuarios, por lo que es posible que no estén disponibles de inmediato para ayudar con el informe del problema. La paciencia y la constancia en los seguimientos son altamente recomendadas y apreciadas. Con el suficiente cuidado y esfuerzo dedicado al proceso de seguimiento, encontrar un committer para encargarse del informe del problema es solo cuestión de tiempo.
pt_br: Lembre-se de que essas pessoas são voluntárias, assim como mantenedores e usuários, portanto, podem não estar disponíveis imediatamente para ajudar no relatório de problemas. Paciência e consistência nos acompanhamentos são altamente recomendados e apreciados. Com cuidado e esforço suficientemente dedicados a esse processo de acompanhamento, encontrar um committer para cuidar do relatório do problema é apenas uma questão de tempo.

source: If There Are Problems
es_es: Si hay problemas
pt_br: Se Existir Problemas

source: If you found an issue with the bug system, file a bug! There is a category for exactly this purpose. If you are unable to do so, contact the bug wranglers at <email>bugmeister@FreeBSD.org</email>.
es_es: Si ha encontrado un problema con el sistema de errores, ¡presente un error! Hay una categoría exacta para este propósito. Si no puede hacerlo, póngase en contacto con los encargados de los errores en <email>bugmeister@FreeBSD.org</email>.
pt_br: Se você encontrou um problema com o sistema de bugs, registre um bug! Existe uma categoria exatamente para esse propósito. Se você não conseguir, entre em contato com os organizadores do bug em <email>bugmeister@FreeBSD.org</email>.

source: Further Reading
es_es: Lecturas adicionales
pt_br: Leitura Adicional

source: This is a list of resources relevant to the proper writing and processing of problem reports. It is by no means complete.
es_es: A continuación se muestra una lista de recursos relacionados con la escritura adecuada de informes y con el procesamiento de dichos informes. No pretende ser una completa enumeración.
pt_br: Esta é uma lista de recursos relevantes para a escrita adequada e processamento de relatórios de problemas. Não está de modo algum completo.

source: <link xlink:href="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html">How to Report Bugs Effectively</link>—an excellent essay by Simon G. Tatham on composing useful (non-FreeBSD-specific) problem reports.
pt_br: <link xlink:href="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html">Como reportar bugs efetivamente</link> -um excelente ensaio de Simon G. Tatham sobre compor de forma util relatórios de problemas (não específicos do FreeBSD).

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines/article.html">Problem Report Handling Guidelines</link>—valuable insight into how problem reports are handled by the FreeBSD developers.
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines/article.html">Guía para el manejo de informes de problemas</link>—contiene una información valiosa sobre cómo los informes de problemas son manejados por los desarrolladores de FreeBSD.
pt_br: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines/article.html">Orientações para o tratamento dos relatórios de problemas</link> —informações valiosas sobre como os relatórios de problemas são tratados pelos desenvolvedores do FreeBSD.

source: If the problem is in a port, consider filing a bug with the upstream. The FreeBSD Project can not fix all bugs in all software.
es_es: Si el problema está en un port, considere enviar el error al upstream. El proyecto FreeBSD no puede corregir todos los errores en todo el software.

source: <emphasis>Do not leave the <quote>Summary</quote> line empty.</emphasis> The PRs go both onto a mailing list that goes all over the world (where the <quote>Summary</quote> is used for the <literal>Subject:</literal> line), but also into a database. Anyone who comes along later and browses the database by synopsis, and finds a PR with a blank subject line, tends just to skip over it. Remember that PRs stay in this database until they are closed by someone; an anonymous one will usually just disappear in the noise.
es_es: <emphasis>No deje el campo <quote>Summary</quote> vacío.</emphasis> Los PRs se envían a una lista de correo global (donde se utiliza el campo <quote>Summary</quote> para la línea <literal>Subject:</literal>), y se almacenan en una base de datos. Cualquiera que haga una búsqueda por el campo synopsis (sinopsis) en la base de datos y encuentre un PR con la línea del subject (asunto) en blanco tiende a omitirlo. Recuerde que los PR permanecen en esta base de datos hasta que alguien los cierra; un PR que no esté debidamente cumplimentado pasará desapercibido.

source: <emphasis>Avoid using a weak <quote>Summary</quote> line.</emphasis> You should not assume that anyone reading your PR has any context for your submission, so the more you provide, the better. For instance, what part of the system does the problem apply to? Do you only see the problem while installing, or while running? To illustrate, instead of <literal>Summary: portupgrade is broken</literal>, see how much more informative this seems: <literal>Summary: port ports-mgmt/portupgrade coredumps on -current</literal>. (In the case of ports, it is especially helpful to have both the category and portname in the <quote>Summary</quote> line.)
es_es: <emphasis>Rellene el campo <quote>Summary</quote> correctamente, no use descripciones vagas.</emphasis> No asuma que aquella persona que lea su PR entienda el contexto que motivó su envío, por lo tanto, cuanta más información proporcione, mejor. Por ejemplo, ¿en qué parte del sistema se produce el problema? ¿El problema sucede solo durante la instalación o durante la ejecución del sistema? Por ejemplo, en lugar de, <literal>Summary: portupgrade is broken</literal>, podría utilizar este otro, el cual, tiene mucha más información: <literal>Summary: port ports-mgmt/portupgrade coredumps on -current</literal>. (En el caso de los ports, es especialmente útil tener el nombre de la categoría y el nombre del port en el campo <quote>Summary</quote>).

source: <emphasis>If you have a patch, say so.</emphasis> A PR with a patch included is much more likely to be looked at than one without. Please set the <literal>patch</literal> Keyword in Bugzilla.
es_es: <emphasis>Si tiene un parche, dígalo.</emphasis> Es más probable que se analice un PR con un parche incluido que uno sin él. Incluya la palabra clave <literal>patch</literal> en Bugzilla.

source: <emphasis>If you are a maintainer, say so.</emphasis> If you are maintaining a part of the source code (for instance, an existing port), you definitely should set the <quote>Class</quote> of your PR to <literal>maintainer-update</literal>. This way any committer that handles your PR will not have to check.
es_es: <emphasis>Si es un maintainer, dígalo</emphasis>. Si mantiene una parte del código fuente (por ejemplo, un port que ya exista), debe establecer el campo <quote>Class</quote> de su PR a <literal>maintainer-update</literal>. De esta forma, cualquier committer que se ocupe de su PR no tendrá que verificarlo.

source: Include which global options you have specified in your <filename>make.conf</filename>, <filename>src.conf</filename>, and <filename>src-env.conf</filename>. Given the infinite number of options, not every combination may be fully supported.
es_es: Incluya qué opciones globales ha especificado en sus ficheros <filename>make.conf</filename>, <filename>src.conf</filename> y <filename>src-env.conf</filename>. Dado el número infinito de opciones, no todas las combinaciones pueden ser totalmente compatibles.

source: When attaching a patch, be sure to use either <command>svn diff</command> or <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> with the <option>-u</option> option to create a unified diff and make sure to specify the SVN revision number of the repository against which you modified files, so the developers who read your report will be able to apply them easily. For problems with the kernel or the base utilities, a patch against FreeBSD-CURRENT (the HEAD Subversion branch) is preferred since all new code should be applied and tested there first. After appropriate or substantial testing has been done, the code will be merged/migrated to the FreeBSD-STABLE branch.
es_es: Al adjuntar un parche, asegúrese de usar <command>svn diff</command> o <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> con el argumento <option>-u</option> para crear un diff unificado, y asegúrese de especificar el número de revisión SVN del repositorio contra el que modificó los archivos, para que los desarrolladores que lean su informe puedan aplicarlos fácilmente. Para problemas relacionados con el kernel o utilidades del sistema base, se prefiere un parche contra FreeBSD-CURRENT (la rama HEAD de Subversion), ya que todo el código nuevo debe aplicarse y probarse allí primero. Después de que se hayan realizado las pruebas adecuadas o importantes, se hará el merge/migración a la rama FreeBSD-STABLE.

source: Filling out the Form
es_es: Rellenar el formulario

source: When you file a bug, you will find the following fields:
es_es: Cuando presente un error, encontrará los siguientes campos:

source: <emphasis>Summary:</emphasis> Fill this out with a short and accurate description of the problem. The synopsis is used as the subject of the problem report email, and is used in problem report listings and summaries; problem reports with obscure synopses tend to get ignored.
es_es: <emphasis>Synopsis:</emphasis> Rellene este campo con una descripción corta y precisa del problema. El campo debe ser rellenado en inglés, pues es el idioma de comunicación en el proyecto FreeBSD. La sinopsis se utiliza como subject del correo electrónico del informe de problemas, y también se utiliza en los listados y resúmenes de informes de la base de datos; informes de problemas con vagas sinopsis tienden a ser completamente ignorados.

source: <emphasis>Severity:</emphasis> One of <literal>Affects only me</literal>, <literal>Affects some people</literal> or <literal>Affects many people</literal>. Do not overreact; refrain from labeling your problem <literal>Affects many people</literal> unless it really does. FreeBSD developers will not necessarily work on your problem faster if you inflate its importance since there are so many other people who have done exactly that.
es_es: <emphasis>Severity:</emphasis> Escoga una de las opciones, <literal>Affects only me (Solo me afecta a mi)</literal>, <literal>Affects some people (Afecta a algunas personas)</literal> o <literal>Affects many people (Afecta a muchas personas)</literal>. No sea exagerado; absténgase de etiquetar su problema <literal>Affects many people (Afecta a muchas personas)</literal> a menos que realmente lo haga. Los desarrolladores de FreeBSD no trabajarán en su problema más rápido si infla su importancia, ya que muchas otras personas han hecho exactamente lo mismo.
