Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/problem-reports/*.po
Languages: es_es, pt_br

source: If a problem is with a binary program such as <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry>, you will first need to determine whether these programs are in the base system or were added via the Ports Collection. If you are unsure, you can do <command>whereis <replaceable>programname</replaceable></command>. FreeBSD's convention for the Ports Collection is to install everything underneath <filename class="directory">/usr/local</filename>, although this can be overridden by a system administrator. For these, you will use the <literal>ports</literal> category (yes, even if the port's category is <literal>www</literal>; see below). If the location is <filename class="directory">/bin</filename>, <filename class="directory">/usr/bin</filename>, <filename class="directory">/sbin</filename>, or <filename class="directory">/usr/sbin</filename>, it is part of the base system, and you should use the <literal>bin</literal> category. These are all things that are described in section 1 or 8 of the manual pages.
es_es: Si el problema es con un binario como <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> o <citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry>, primero deberá determinar si estos programas se encuentran en el sistema base o se añadieron a través de la colección de ports. Si no está seguro, puede hacer <command>whereis <replaceable>programname</replaceable></command>. La convención de FreeBSD para la colección de ports es instalar todo por debajo de <filename class="directory">/usr/local</filename>, aunque un administrador del sistema puede sobreescribirlo. Para estos, utilizará la categoría de <literal>ports</literal> (sí, incluso si la categoría del port es <literal>www</literal>; vea más abajo). Si la ubicación es <filename class="directory">/bin</filename>, <filename class="directory">/usr/bin</filename>, <filename class="directory">/sbin</filename>, o <filename class="directory">/usr/sbin</filename>, es parte del sistema base, y debe usar la categoría <literal>bin</literal>. Estas son todas las cosas que se describen en las secciones 1 u 8 de las páginas del manual.

source: If you have found a problem in the documentation set (articles, books, man pages) or website the correct choice is <literal>docs</literal>.
es_es: Si ha encontrado un problema en el conjunto de la documentación (artículos, libros, man pages) o en el sitio web, la elección correcta es <literal>docs</literal>.

source: If you are convinced that the problem will only occur under the processor architecture you are using, select one of the architecture-specific categories: commonly <literal>i386</literal> for Intel-compatible machines in 32-bit mode; <literal>amd64</literal> for AMD machines running in 64-bit mode (this also includes Intel-compatible machines running in EMT64 mode); and less commonly <literal>arm</literal> or <literal>powerpc</literal>.
es_es: Si está convencido de que el problema solo ocurrirá con la arquitectura del procesador que está utilizando, seleccione una de las categories específicas de la arquitectura: normalmente, <literal>i386</literal> para ordenadores compatibles con Intel en modo 32 bits; <literal>amd64</literal> para máquinas AMD que se ejecutan en modo 64 bits (esto también incluye ordenadores compatibles con Intel que se ejecutan en modo EMT64); y las menos comunes, <literal>arm</literal> o <literal>powerpc</literal>.

source: <emphasis>Description:</emphasis>A complete and accurate description of the problem you are experiencing. Try to avoid speculating about the causes of the problem unless you are certain that you are on the right track, as it may mislead a developer into making incorrect assumptions about the problem. It should include the actions you need to take to reproduce the problem. If you know any workaround, include it. It not only helps other people with the same problem work around it, but may also help a developer understand the cause for the problem.
es_es: <emphasis>Description:</emphasis> Una descripción completa y precisa del problema que está experimentando. Intente evitar especular sobre las posibles causas del problema a menos que se tenga la seguridad de que el camino descrito es el correcto, ya que puede inducir a un desarrollador a hacer suposiciones incorrectas sobre el problema. Debe incluir las acciones que hay que realizar para reproducir el problema. Si conoce alguna solución, inclúyala. No solo ayuda a otras personas con el mismo problema a solucionarlo, sino que también puede ayudar a un desarrollador a entender la causa del problema.

source: If someone requests additional information from you, or you remember or discover something you did not mention in the initial report, please submit a follow up. The number one reason for a bug not getting fixed is lack of communication with the originator. The easiest way is to use the comment option on the individual PR's web page, which you can reach from the <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">PR search page</link>.
es_es: Si alguien le solicita información adicional, o si recuerda o descubre algo que no mencionó en el informe inicial, por favor, envíe un follow-up. La razón número uno para que un error no se arregle es la falta de comunicación con el usario que creó el error. La forma más fácil es usar la opción de comentarios en la página web de cada PR, a la que puede acceder desde la <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">página de búsqueda de PR</link>.

source: <link xlink:href="https://github.com/smileytechguy/reporting-bugs-effectively/blob/master/ENGLISH.md">How to Report Bugs Effectively</link>—an excellent essay by Simon G. Tatham on composing useful (non-FreeBSD-specific) problem reports.
es_es: <link xlink:href="https://github.com/smileytechguy/reporting-bugs-effectively/blob/master/ENGLISH.md">Cómo informar errores de forma efectiva</link>—un excelente ensayo por Simon G. Tatham sobre la redacción de informes de problemas (el texto no es específico sobre FreeBSD).
