Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/problem-reports/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Juan F. Rodriguez jrh@it.uc3m.es, 2007 Sergio Carlavilla carlavilla@mailbox.org, 2019
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Silvio Ap Silva, contato@kanazuchi.com, 2018 André Franciosi, andre@franciosi.org, 2018

source: Writing FreeBSD Problem Reports
es_es: Escribiendo informes de problemas de FreeBSD
pt_br: Escrevendo Relatórios de Problemas para o FreeBSD

source: This article describes how to best formulate and submit a problem report to the FreeBSD Project.
es_es: Este artículo describe cómo realizar y enviar informes de problemas para el proyecto FreeBSD de la mejor forma posible.
pt_br: Este artigo descreve como redigir e submeter um bom relatório de problemas ao Projeto FreeBSD.

source: <personname> <firstname>Dag-Erling</firstname> <surname>Smørgrav</surname> </personname> <contrib>Contributed by </contrib>
pt_br: <personname> <firstname>Dag-Erling</firstname> <surname>Smørgrav</surname> </personname> <contrib> Contribuído por </contrib>

source: <primary>problem reports</primary>
pt_br: <primary>relatórios de problemas</primary>

source: Introduction
es_es: Introducción
pt_br: Introdução

source: One of the most frustrating experiences one can have as a software user is to submit a problem report only to have it summarily closed with a terse and unhelpful explanation like <quote>not a bug</quote> or <quote>bogus PR</quote>. Similarly, one of the most frustrating experiences as a software developer is to be flooded with problem reports that are not really problem reports but requests for support, or that contain little or no information about what the problem is and how to reproduce it.
es_es: Una de las experiencias más frustrantes que uno puede tener como usuario de software es enviar un informe de problemas solo para que se cierre sumariamente con una explicación breve e inútil como <quote>no es un error</quote> o <quote>PR erróneo</quote>. De manera similar, una de las experiencias más frustrantes que puede experimentar un desarrollador de aplicaciones consiste en verse inundado por una cantidad ingente de informes de problemas que en realidad vienen a ser solicitudes de soporte o ayuda, o que contienen poca o ninguna información sobre cúal es el problema y cómo reproducirlo.
pt_br: Uma das experiências mais frustrantes que alguém pode ter como usuário de um software é submeter um relatório de problema apenas para vê-lo ser encerrado sumariamente com uma explicação curta e inútil tal como <quote>não é um bug</quote> ou <quote>PR Falso</quote>. Da mesma forma, uma das experiências mais frustrantes como desenvolvedor de software é ser inundado com relatórios de problemas que não são realmente relatórios de problemas mas sim pedidos de suporte, ou então por relatórios que contêm pouca ou nenhuma informação sobre o que é o problema e sobre como reproduzi-lo.

source: This document attempts to describe how to write good problem reports. What, one asks, is a good problem report? Well, to go straight to the bottom line, a good problem report is one that can be analyzed and dealt with swiftly, to the mutual satisfaction of both user and developer.
es_es: Este documento intenta describir cómo escribir buenos informes de problemas. ¿Qué, se preguntará, es un buen informe de problemas? Bien, para ir directos al grano, un buen informe de problemas es aquél que se puede analizar y tratar rápidamente, para mutua satisfacción del usuario y del desarrollador.
pt_br: Este documento tenta descrever como escrever bons relatórios de problemas. O que, alguém pergunta, é um bom relatório de problemas? Bem, para ir diretamente para ao ponto, um bom relatório de problema é aquele que pode ser analisado e tratado rapidamente, para a satisfação mútua do usuário e do desenvolvedor.

source: Although the primary focus of this article is on FreeBSD problem reports, most of it should apply quite well to other software projects.
es_es: Aunque el objetivo principal de este artículo se centra en los informes de problemas de FreeBSD, la mayoría de los conceptos se pueden aplicar bastante bien en otros proyectos de software.
pt_br: Embora o foco principal deste artigo esteja nos relatórios de problemas do FreeBSD, a maioria das recomendações deve se aplicar muito bem a outros projetos de software.

source: Note that this article is organized thematically, not chronologically. Read the entire document before submitting a problem report, rather than treating it as a step-by-step tutorial.
es_es: Tenga en cuenta que este artículo está organizado temáticamente, no cronológicamente. Lea todo el documento antes de enviar un informe de problemas, en lugar de tratarlo como un tutorial paso a paso.
pt_br: Observe que este artigo é organizado por temas, não de uma forma cronológica. Leia todo o documento antes de enviar um relatório de problemas, em vez de tratá-lo como um tutorial passo a passo.

source: When to Submit a Problem Report
es_es: Cuándo enviar informes de problemas
pt_br: Quando Enviar um Relatório de Problemas

source: There are many types of problems, and not all of them should engender a problem report. Of course, nobody is perfect, and there will be times when what seems to be a bug in a program is, in fact, a misunderstanding of the syntax for a command or a typographical error in a configuration file (though that in itself may sometimes be indicative of poor documentation or poor error handling in the application). There are still many cases where submitting a problem report is clearly <emphasis>not</emphasis> the right course of action, and will only serve to frustrate both the submitter and the developers. Conversely, there are cases where it might be appropriate to submit a problem report about something else than a bug—an enhancement or a new feature, for instance.
es_es: Hay muchos tipos de problemas y no todos ellos merecen la creación de un informe de problemas. Por supuesto, nadie es perfecto, y habrá ocasiones en que lo que parece ser un error en un programa es, de hecho, un malentendido de la sintaxis de un comando o un error tipográfico en un archivo de configuración (aunque en este último caso podría tratarse de un indicador de documentación escasa o que la aplicación peca de una gestión de errores defectuosa). Incluso teniendo estos aspectos en cuenta existen varios casos en los cuales el envío de un informe de problemas resulta claramente <emphasis>no ser</emphasis> la mejor forma de proceder, y solo servirá para frustrar tanto al remitente como a los desarrolladores. Por el contrario, hay casos en los que podría ser apropiado enviar un informe de problemas sobre algo más que un error: una mejora o una nueva característica, por ejemplo.
pt_br: Existem muitos tipos de problemas, e nem todos devem gerar um relatório de problemas. Naturalmente, ninguém é perfeito, e haverá momentos em que o que parece ser um bug em um programa é, na verdade, um equívoco na sintaxe de um comando ou um erro tipográfico em um arquivo de configuração (embora isto por si só possa ser um indicativo de uma documentação deficiente ou de deficiências no manuseio de erros pelo aplicativo). Existem ainda muitos casos em que submeter um relatório de problema claramente <emphasis>não</emphasis> é o curso de ação correto, e só servirá para frustrar tanto o usuário e quanto o desenvolvedor. Por outro lado, existem casos em que pode ser apropriado enviar um relatório de problema sobre algo diferente de um bug - tal como um aprimoramento ou um novo recurso, por exemplo.

source: So how does one determine what is a bug and what is not? As a simple rule of thumb, the problem is <emphasis>not</emphasis> a bug if it can be expressed as a question (usually of the form <quote>How do I do X?</quote> or <quote>Where can I find Y?</quote>). It is not always quite so black and white, but the question rule covers a large majority of cases. When looking for an answer, consider posing the question to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">FreeBSD general questions mailing list</link>.
es_es: Entonces, ¿cómo se determina qué es un error y qué no? Como regla general, el problema <emphasis>no</emphasis> es un error si puede expresarse como una pregunta (normalmente del estilo de <quote>¿Cómo hago X?</quote> o <quote>¿Dónde puedo encontrar Y?</quote>). Las cosas no son siempre blancas o negras, pero la regla de la pregunta cubre la gran mayoría de los casos. Al buscar una respuesta, considere plantear la pregunta a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de correo de preguntas generales de FreeBSD</link>.
pt_br: Então, como se determina o que é um bug e o que não é? Como uma regra simples, o problema <emphasis>não</emphasis> é um bug se ele puder ser expresso como uma pergunta (geralmente na forma <quote>Como faço X?</quote> ou <quote>Onde posso encontrar Y?</quote>). Nem sempre é tão preto e branco, mas a regra da pergunta cobre a grande maioria dos casos. Ao procurar por uma resposta, considere colocar a questão na <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-questions">lista de discussão de perguntas gerais sobre o FreeBSD</link>.

source: Consider these factors when submitting PRs about ports or other software that is not part of FreeBSD itself:
es_es: Tenga en cuenta estos factores al enviar PRs sobre ports u otro software que no sea parte de FreeBSD:
pt_br: Considere estes fatores ao enviar PRs sobre ports ou outros softwares que não fazem parte do próprio FreeBSD:

source: Please do not submit problem reports that simply state that a newer version of an application is available. Ports maintainers are automatically notified by <application>portscout</application> when a new version of an application becomes available. Actual patches to update a port to the latest version are welcome.
es_es: Por favor, no envíe informes de problemas que simplemente indiquen la disponibilidad de una nueva versión de una aplicación. Los maintainers de ports son notificados automáticamente por <application>portscout</application> cuando una nueva versión de una aplicación esta disponible. Los parches para actualizar un port a la última versión son bien recibidos.
pt_br: Por favor, não envie relatórios de problemas que simplesmente afirmam que uma versão mais nova de um aplicativo está disponível. Os mantenedores de ports são notificados automaticamente pelo <application>portscout</application> quando uma nova versão de um aplicativo fica disponível. Patches para atualizar um port para uma versão mais recente do software são sempre bem-vindos.

source: For unmaintained ports (<varname>MAINTAINER</varname> is <literal>ports@FreeBSD.org</literal>), a PR without an included patch is unlikely to get picked up by a committer. To become the maintainer of an unmaintained port, submit a PR with the request (patch preferred but not required).
es_es: Para los ports que no están mantenidos (el <varname>MAINTAINER</varname> es <literal>ports@FreeBSD.org</literal>), es poco probable que un PR sin un parche adjunto sea cogido por un committer. Para convertirse en el maintainer de un port que no este mantenido, envíe un PR con la petición (sería ideal si viene con un parche adjunto, pero no es necesario).
pt_br: Para ports não mantidos (O seu <varname>MAINTAINER</varname> é <literal>ports@FreeBSD.org</literal>), é improvável que um PR que não tenha um patch incluído seja escolhido para ser trabalhado por um committer. Para se tornar o mantenedor de um port não mantido, envie um PR com o pedido (será ótimo se o pedido vier com um patch, mas isso não é obrigatório).

source: In either case, following the process described in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/port-upgrading.html">Porter's Handbook</link> will yield the best results. (You might also wish to read <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/ports-contributing.html">Contributing to the FreeBSD Ports Collection</link>.)
es_es: En cualquier caso, seguir el proceso descrito en el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/porters-handbook/port-upgrading.html">Manual del Porter</link> dará los mejores resultados. (Es posible que también desee leer <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/contributing/ports-contributing.html">Cómo contribuir a la colección de ports de FreeBSD</link>).
pt_br: Em ambos os casos, seguir o processo descrito no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/port-upgrading.html">Porter's Handbook</link> produzirá os melhores resultados. (Você também pode desejar ler a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing/ports-contributing.html">Contribuindo para a Coleção de Ports do FreeBSD</link>.)

source: A bug that cannot be reproduced can rarely be fixed. If the bug only occurred once and you cannot reproduce it, and it does not seem to happen to anybody else, chances are none of the developers will be able to reproduce it or figure out what is wrong. That does not mean it did not happen, but it does mean that the chances of your problem report ever leading to a bug fix are very slim. To make matters worse, often these kinds of bugs are actually caused by failing hard drives or overheating processors — you should always try to rule out these causes, whenever possible, before submitting a PR.
es_es: Un error que no se puede reproducir rara vez se podrá arreglar. Si el error solo ocurrió una vez y no puede reproducirlo, y no parece que le ocurra a nadie más, es probable que ninguno de los desarrolladores pueda reproducirlo o descubrir qué es lo que está mal. Eso no significa que no haya ocurrido, significa que las posibilidades de que su informe de problemas lleve a la corrección del error son muy escasas. Para empeorar las cosas, a menudo, este tipo de errores son en realidad causados por fallos en los discos duros o procesadores con sobrecalentamiento, siempre debe intentar descartar estas causas, siempre que sea posible, antes de enviar un PR.
pt_br: Um bug que não pode ser reproduzido raramente pode ser corrigido. Se o bug ocorreu apenas uma vez e você não pode reproduzi-lo, e não parece acontecer com mais ninguém, é muito provável que nenhum dos desenvolvedores consiga reproduzi-lo ou descobrir o que está errado. Isso não significa que isso não tenha acontecido, mas significa que as chances do seu relatório de problema levar à correção do bug são muito pequenas. Para piorar, muitas vezes esses tipos de bugs são causados por discos rígidos com defeito ou por processadores superaquecidos - sempre que possível você deve tentar descartar essas causas antes de enviar um PR.

source: Next, to decide to whom you should file your problem report, you need to understand that the software that makes up FreeBSD is composed of several different elements:
es_es: A continuación, para decidir a quién debe presentar su informe de problemas, debe comprender que el software que compone FreeBSD está compuesto de varios elementos diferentes:
pt_br: Em seguida, para decidir para quem você deve enviar seu relatório de problema, você precisa entender que o software que compõe o FreeBSD é composto por vários elementos diferentes:

source: Code in the base system that is written and maintained by FreeBSD contributors, such as the kernel, the C library, and the device drivers (categorized as <literal>kern</literal>); the binary utilities (<literal>bin</literal>); the manual pages and documentation (<literal>docs</literal>); and the web pages (<literal>www</literal>). All bugs in these areas should be reported to the FreeBSD developers.
es_es: El código en el sistema base que escriben y mantienen los colaboradores de FreeBSD, como el kernel, la biblioteca de C y los controladores de dispositivos (categorizados como <literal>kern</literal>); las utilidades binarias (<literal>bin</literal>); las páginas del manual y documentación (<literal>docs</literal>); y las páginas web (<literal>www</literal>). Todos los errores en estas áreas deben informarse a los desarrolladores de FreeBSD.
pt_br: Código no sistema base que é escrito e mantido por contribuidores do FreeBSD, como o kernel, a biblioteca C e os drivers de dispositivo (categorizados como <literal>kern</literal>); os utilitários binários (<literal>bin</literal>); as páginas de manual e documentação (<literal>docs</literal>); e as páginas web (<literal>www</literal>). Todos os erros nestas áreas devem ser reportados aos desenvolvedores do FreeBSD.

source: Code in the base system that is written and maintained by others, and imported into FreeBSD and adapted. Examples include <citerefentry><refentrytitle>clang</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and <citerefentry><refentrytitle>sendmail</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Most bugs in these areas should be reported to the FreeBSD developers; but in some cases they may need to be reported to the original authors instead if the problems are not FreeBSD-specific.
es_es: El código en el sistema base escrito y mantenido por otros, e importado y adaptado a FreeBSD. Los ejemplos incluyen <citerefentry><refentrytitle>clang</refentrytitle><manvolnum>1</manvolnum></citerefentry> y <citerefentry><refentrytitle>sendmail</refentrytitle><manvolnum>8</manvolnum></citerefentry>. La mayoría de los errores en estas áreas deben informarse a los desarrolladores de FreeBSD; pero en algunos casos es posible que deban informarse a los autores originales si los problemas no son específicos de FreeBSD.
pt_br: Código no sistema base que é escrito e mantido por outras pessoas, o qual é importado e adaptado para o FreeBSD. Exemplos incluem o <citerefentry><refentrytitle>clang</refentrytitle><manvolnum>1</manvolnum></citerefentry> e o <citerefentry><refentrytitle>sendmail</refentrytitle><manvolnum>8</manvolnum></citerefentry>. A maioria dos bugs nessas áreas deve ser reportada aos desenvolvedores do FreeBSD; mas em alguns casos eles podem precisar ser relatados aos autores originais se os problemas não forem específicos do FreeBSD.

source: Individual applications that are not in the base system but are instead part of the FreeBSD Ports Collection (category <literal>ports</literal>). Most of these applications are not written by FreeBSD developers; what FreeBSD provides is merely a framework for installing the application. Therefore, only report a problem to the FreeBSD developers when the problem is believed to be FreeBSD-specific; otherwise, report it to the authors of the software.
es_es: Las aplicaciones individuales que no están en el sistema base, sino que forman parte de la colección de ports de FreeBSD (categoría <literal>ports</literal>). La mayoría de estas aplicaciones no están escritas por los desarrolladores de FreeBSD; lo que proporciona FreeBSD es simplemente un framework para instalar la aplicación. Por lo tanto, solo informe de un problema a los desarrolladores de FreeBSD cuando crea que el problema es específico de FreeBSD; de lo contrario, repórtelo a los autores del software.
pt_br: Aplicativos individuais que não estão no sistema base, mas que são parte da coleção de ports do FreeBSD (categoria <literal>ports</literal>). A maioria desses aplicativos não são escritos por desenvolvedores do FreeBSD; o que o FreeBSD fornece é meramente um framework para instalar o aplicativo. Portanto, apenas relate um problema para os desenvolvedores do FreeBSD quando o problema for considerado específico do FreeBSD; caso contrário, informe aos autores do software.

source: Then, ascertain whether the problem is timely. There are few things that will annoy a developer more than receiving a problem report about a bug she has already fixed.
es_es: Después, averigüe si es un problema puntual. Existen pocas cosas que molesten más a un desarrollador que recibir un informe de problemas sobre un error que ya ha solucionado.
pt_br: Em seguida, verifique se o problema é oportuno. Há poucas coisas que incomodarão mais um desenvolvedor do que receber um relatório de problemas sobre um bug que ele já corrigiu.

source: If the problem is in the base system, first read the FAQ section on <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/introduction.html#LATEST-VERSION">FreeBSD versions</link>, if you are not already familiar with the topic. It is not possible for FreeBSD to fix problems in anything other than certain recent branches of the base system, so filing a bug report about an older version will probably only result in a developer advising you to upgrade to a supported version to see if the problem still recurs. The Security Officer team maintains the <link xlink:href="@@URL_RELPREFIX@@/security/">list of supported versions</link>.
es_es: Si el problema está en el sistema base, primero lea la sección de preguntas frecuentes sobre las <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/introduction.html#LATEST-VERSION">versiones de FreeBSD</link>, si aún no está familiarizado con el tema. FreeBSD no puede solucionar problemas en otras ramas que no sean las más recientes del sistema base, por lo que presentar un informe de error sobre una versión anterior probablemente hará que un desarrollador le aconseje que se actualice a una versión soportada para comprobar si el problema todavía sucede. El equipo Security Officer mantiene <link xlink:href="@@URL_RELPREFIX@@/security/">la lista de versiones soportadas</link>.
pt_br: Se o problema estiver no sistema base, primeiro leia a seção <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/introduction.html#LATEST-VERSION"> Versões do FreeBSD</link> do FAQ, se você ainda não estiver familiarizado com o tópico. Não é possível para o FreeBSD consertar problemas em nada além de certas branchs recentes do sistema base, de forma que enviar um relatório de bug sobre uma versão mais antiga provavelmente resultará em um desenvolvedor aconselhando você a atualizar para uma versão suportada para ver se o problema ainda continua ocorrendo. A equipe do Security Officer mantém a <link xlink:href="@@URL_RELPREFIX@@/security/">lista das versões suportadas </link>.

source: If the problem is in a port, note that you must first upgrade to the latest version of the Ports Collection and see if the problem still applies. Due to the rapid pace of changes in these applications, it is infeasible for FreeBSD to support anything other than the absolute latest versions, and problems with older version of applications simply cannot be fixed.
pt_br: Se o problema estiver em um port, observe que você deverá primeiro atualizar para a versão mais recente da Coleção de Ports e verificar se o problema ainda se aplica. Devido ao ritmo acelerado de mudanças nesses aplicativos, é inviável que o FreeBSD ofereça suporte para qualquer coisa que não seja absolutamente a versão mais recente e os problemas com versões mais antigas de aplicativos simplesmente não podem ser corrigidos.

source: Preparations
es_es: Preparativos
pt_br: Preparativos
