Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/problem-reports/*.po
Languages: es_es, pt_br

source: If this is a ports problem, then be prepared to supply the following information. (You do not have to include these by default, which only tends to fill up the database, but you should include excerpts that you think might be relevant):
es_es: Si se trata de un problema relacionado con los ports, prepárese para poder proporcionar la información que se muestra a continuación. (No es necesario incluir esta información por defecto, ya que esto solo produce un crecimiento indeseado de la base de datos, pero debe incluir extractos que considere que pueden ser relevantes):
pt_br: Se este for um problema de algum port, esteja preparado para fornecer as seguintes informações. (Você não precisa incluí-las por padrão, o que apenas tende a preencher o banco de dados, mas você deve incluir trechos que você considera relevantes):

source: which ports you have installed
es_es: Qué ports ha instalado
pt_br: quais ports você instalou

source: any environment variables that override the defaults in <filename>bsd.port.mk</filename>, such as <varname>PORTSDIR</varname>
es_es: Cualquier variable de entorno que sobrescriba los valores por defecto del archivo <filename>bsd.port.mk</filename>, como <varname>PORTSDIR</varname>
pt_br: quaisquer variáveis de ambiente que sobreescrevem as variáveis padrões em <filename>bsd.port.mk</filename>, assim como <varname>PORTSDIR</varname>

source: the fact that you have read <filename>ports/UPDATING</filename> and that your problem is not listed there (someone is guaranteed to ask)
es_es: El hecho de que ha leído el archivo <filename>ports/UPDATING</filename> y que su problema no se encuentra en la lista (puede preguntar a alguien)
pt_br: o fato de você ter lido <filename>ports/UPDATING</filename> e o seu problema não estar listado lá (é garantido que alguém irá perguntar)

source: <emphasis>Avoid vague requests for features.</emphasis> PRs of the form <quote>someone should really implement something that does so-and-so</quote> are less likely to get results than very specific requests. Remember, the source is available to everyone, so if you want a feature, the best way to ensure it being included is to get to work! Also consider the fact that many things like this would make a better topic for discussion on <literal>freebsd-questions</literal> than an entry in the PR database, as discussed above.
es_es: <emphasis>Evitar peticiones de características vagas.</emphasis> Los PRs del estilo <quote>alguien debería implementar algo que haga esto, aquello y lo de más allá</quote> son informes con pocas probabilidades de obtener resultados positivos. Recuerde, el código fuente se encuentra disponible para todo el mundo, por lo tanto, si desea una característica, ¡la mejor manera de asegurarse de que se incluya es ponerse a trabajar en ella! También tenga en cuenta que para discutir este tipo de problemas resulta más adecuado utilizar la lista <literal>freebsd-questions</literal>, que una entrada en la base de datos de PR, como ya se ha comentado anteriormente.
pt_br: <emphasis>Evite requisições vagas de novas funcionalidades.</emphasis> Os PRs no formato <quote>alguém realmente deve implementar algo que faz isso e aquilo</quote> têm menor probabilidade de obter resultados do que requisições muito específicas. Lembre-se, o código fonte está disponível para todos, então se você quiser uma nova funcionalidade, a melhor maneira de garantir que ela seja incluída é começar a trabalhar! Considere também o fato de que muitas coisas como essa seriam um tópico melhor para a discussão sobre <literal>freebsd-questions</literal> do que uma entrada no banco de dados de PR, como discutido acima.

source: <emphasis>Make sure no one else has already submitted a similar PR.</emphasis> Although this has already been mentioned above, it bears repeating here. It only take a minute or two to use the web-based search engine at <uri xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">https://bugs.freebsd.org/bugzilla/query.cgi</uri>. (Of course, everyone is guilty of forgetting to do this now and then.)
es_es: <emphasis>Asegúrese que nadie más ha enviado un PR similar.</emphasis> Aunque esto ya se ha mencionado anteriormente, vale la pena repetirlo aquí. Solamente lleva uno o dos minutos utilizar el motor de búsqueda web en <uri xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">https://bugs.freebsd.org/bugzilla/query.cgi</uri>. (Por supuesto, todo el mundo es culpable de olvidarse de hacerlo de vez en cuando).
pt_br: <emphasis>Certifique-se de que ninguém mais tenha submetido um PR similar.</emphasis> Embora isso já tenha sido mencionado acima, vale a pena repetir aqui. Leva apenas um ou dois minutos para usar o mecanismo de busca baseado na Web em <uri xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">https://bugs.freebsd.org/bugzilla/query.cgi</uri>. (Claro, todo mundo é culpado de esquecer de fazer isso de vez em quando.)

source: <emphasis>Report only one issue per Problem Report.</emphasis> Avoid including two or more problems within the same report unless they are related. When submitting patches, avoid adding multiple features or fixing multiple bugs in the same PR unless they are closely related—such PRs often take longer to resolve.
es_es: <emphasis>Informe un solo problema por informe.</emphasis> Evite incluir dos o más problemas dentro del mismo informe, a menos que estén relacionados. Al enviar parches, evite agregar múltiples funciones o corregir varios errores en el mismo PR, a menos que estén estrechamente relacionados — ya que los PR suelen tardar más en resolverse.
pt_br: <emphasis> Relate um problema apenas através do Relatório de Problemas.</emphasis> Evite incluir dois ou mais problemas dentro do mesmo relatório, a menos que estejam relacionados. Ao enviar patches, evite adicionar várias funcionalidades ou corrigir multiplos bugs no mesmo PR, a menos que eles estejam intimamente relacionados - esses PRs geralmente levam mais tempo para serem resolvidos.

source: <emphasis>Avoid controversial requests.</emphasis> If your PR addresses an area that has been controversial in the past, you should probably be prepared to not only offer patches, but also justification for why the patches are <quote>The Right Thing To Do</quote>. As noted above, a careful search of the mailing lists using the archives at <uri xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">https://www.FreeBSD.org/search/search.html#mailinglists</uri> is always good preparation.
es_es: <emphasis>Evite peticiones controvertidas.</emphasis> Si su PR se dirige a un área que ha sido controvertida en el pasado, probablemente debería estar preparado para no solo ofrecer parches, sino también una justificación de por qué los parches son la <quote>forma correcta de hacerlo</quote>. Como se avisó anteriormente, una búsqueda meticulosa en las listas de correo utilizando los archivos históricos en <uri xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">https://www.FreeBSD.org/search/search.html#mailinglists</uri> es siempre una buena opción.
pt_br: <emphasis>Evite requisições controversas.</emphasis> Se o seu PR aborda uma área que já foi controversa no passado, você provavelmente deverá estar preparado para não apenas oferecer patches, mas também justificar por que os patches são <quote>A Coisa Certa A Se Fazer </quote>. Como observado acima, uma busca cuidadosa nas listas de discussão usando os arquivos em <uri xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists"> https://www.FreeBSD.org /search/search.html#mailinglists </uri> é sempre uma boa preparação.

source: <emphasis>Be polite.</emphasis> Almost anyone who would potentially work on your PR is a volunteer. No one likes to be told that they have to do something when they are already doing it for some motivation other than monetary gain. This is a good thing to keep in mind at all times on Open Source projects.
es_es: <emphasis>Sea educado.</emphasis> Practicamente cualquier persona que se encargue de tratar su PR es un voluntario. A nadie le gusta que le digan que tiene que hacer algo cuando ya lo están haciendo por alguna otra motivación que no sea la económica. Es bueno tenerlo en cuenta en todo momento en los proyectos de código abierto.
pt_br: <emphasis>Seja educado.</emphasis> Quase todo mundo que potencialmente irá trabalhar em seu PR é um voluntário. Ninguém gosta que digam o que eles tem que fazer quando já estão fazendo por alguma motivação que não seja o ganho monetário. É sempre bom ter isso em mente em projetos de código aberto.

source: Before Beginning
es_es: Antes de comenzar
pt_br: Antes de Começar

source: Similar considerations apply to use of the <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi">web-based PR submission form</link>. Be careful of cut-and-paste operations that might change whitespace or other text formatting.
es_es: Se aplican consideraciones similares al uso del formulario de envío de PR <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi">por la aplicación web</link>. Tenga cuidado con las operaciones de cortar y pegar que puedan cambiar los espacios en blanco u otro formato de texto.
pt_br: Considerações semelhantes se aplicam ao uso do <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi">formulário de envio de PR web-based (com base em web)</link>. Cuidado com as operações de recortar e colar que podem alterar o espaços em branco ou outras formatações de texto.

source: Finally, if the submission is lengthy, prepare the work offline so that nothing will be lost if there is a problem submitting it.
es_es: Finalmente, si el envío es largo, prepare el trabajo sin conexión, de forma que no se pierda nada si hay un problema al enviarlo.
pt_br: Finalmente, se o envio for demorado, prepare o trabalho off-line para que nada seja perdido se houver um problema ao enviá-lo.

source: Attaching Patches or Files
es_es: Adjuntar parches o archivos
pt_br: Anexando Patches ou Arquivos

source: When attaching a patch, be sure to use <option>-u</option> with <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> to create or unified diff and make sure to specify the exact SVN revision numbers of the files you modified so the developers who read your report will be able to apply them easily. For problems with the kernel or the base utilities, a patch against FreeBSD-CURRENT (the HEAD Subversion branch) is preferred since all new code should be applied and tested there first. After appropriate or substantial testing has been done, the code will be merged/migrated to the FreeBSD-STABLE branch.
pt_br: Ao anexar um patch, certifique-se de usar <option>-u</option> com <citerefentry><refentrytitle>diff</refentrytitle><manvolnum>1</manvolnum></citerefentry> para criar ou unificar o diff e certificar-se de especificar os números de revisão exatos do SVN dos arquivos que você modificou para que os desenvolvedores que lerem seu relatório possam aplicá-los facilmente. Para problemas com o kernel ou com os utilitários de base, um patch para o FreeBSD-CURRENT (a branch HEAD do Subversion) é o preferido, já que todo código novo deve ser aplicado e testado lá primeiro. Após testes apropriados ou substanciais terem sido feitos, o código será mesclado/migrado para a branch FreeBSD-STABLE.

source: If you attach a patch inline, instead of as an attachment, note that the most common problem by far is the tendency of some email programs to render tabs as spaces, which will completely ruin anything intended to be part of a Makefile.
es_es: Si adjunta un parche como parte del mensaje, en lugar de como adjunto, tenga en cuenta que uno de los problemas más comunes es la tendencia de algunos programas de correo electrónico de mostrar las tabulaciones como espacios, lo cual estropeará por completo todo lo que pretenda que forme parte de un Makefile.
pt_br: Se você anexar um patch inline, em vez de um anexo, observe que o problema mais comum, de longe, é a tendência de alguns programas de email renderizar tabs como espaços, o que ira arruinar completamente qualquer coisa destinada a fazer parte de um Makefile.

source: Do not send patches as attachments using <command>Content-Transfer-Encoding: quoted-printable</command>. These will perform character escaping and the entire patch will be useless.
es_es: No envíe parches como archivos adjuntos usando <command>Content-Transfer-Encoding: quoted-printable</command>. Esto escapará el carácter (character escaping) y todo el parche será inútil.
pt_br: Não envie correções como anexos usando <command>Content-Transfer-Encoding: quoted-printable</command>. Isso irá escapar os caracteres e todo o patch se tornará inútil.

source: Also note that while including small patches in a PR is generally all right—particularly when they fix the problem described in the PR—large patches and especially new code which may require substantial review before committing should be placed on a web or ftp server, and the URL should be included in the PR instead of the patch. Patches in email tend to get mangled, and the larger the patch, the harder it will be for interested parties to unmangle it. Also, posting a patch on the web allows you to modify it without having to resubmit the entire patch in a followup to the original PR. Finally, large patches simply increase the size of the database, since closed PRs are not actually deleted but instead kept and simply marked as complete.
es_es: También tenga en cuenta que, incluir pequeños parches en un PR, en general, está bien, especialmente cuando soluciona el problema descrito en el PR, los parches grandes y especialmente el nuevo código que pueda requerir una revisión sustancial antes de realizar el commit deben colocarse en un servidor web o ftp, y la URL debe incluirse en el PR en lugar del parche. Los parches en el correo electrónico tienden a ser destrozados, y cuanto más grande sea el parche, más difícil será para las partes interesadas desenmarañarlo. Además, la publicación de un parche en la web le permite modificarlo sin tener que volver a enviar el parche completo en un follow-up al PR original. Finalmente, los parches grandes simplemente aumentan el tamaño de la base de datos, ya que los PR cerrados no se eliminan, sino que se guardan y simplemente se marcan como completos.
pt_br: Observe também que, embora a inclusão de pequenos patches em um PR geralmente esteja correto - particularmente quando eles corrigem o problema descrito no PR - patches grandes e especialmente códigos novos que podem exigir uma revisão substancial antes do commit, deveriam ser colocados em um servidor web ou FTP, e a URL deveria ser incluída no PR em vez do patch. Patches por e-mail tendem a ficar embaralhados, e quanto maior o patch, mais difícil será para as partes interessadas recuperá-lo. Além disso, postar um patch na web permite modificá-lo sem ter que reenviar todo o patch em um followup do PR original. Finalmente, os patches grandes simplesmente aumentam o tamanho do banco de dados, uma vez que os PRs fechados não são realmente excluídos, mas sim mantidos e simplesmente marcados como completos.

source: You should also take note that unless you explicitly specify otherwise in your PR or in the patch itself, any patches you submit will be assumed to be licensed under the same terms as the original file you modified.
es_es: También debe tener en cuenta que, a menos que se especifique explícitamente lo contrario en su PR o en el propio parche, se asumirá que los parches que envíe se licenciarán en los mismos términos que el archivo original que modificó.
pt_br: Você também deve observar que, a menos que você especifique explicitamente o contrário em seu PR ou no próprio patch, quaisquer patches enviados por você serão considerados licenciados sob os mesmos termos do arquivo original que você modificou.

source: Filling out the Template
pt_br: Preenchendo o Modelo

source: In the email template only, you will find the following single-line fields:
pt_br: Somente no modelo de e-mail, você encontrará os seguintes campos de uma única linha:

source: <emphasis>Submitter-Id:</emphasis> Do not change this. The default value of <literal>current-users</literal> is correct, even if you run FreeBSD-STABLE.
pt_br: <emphasis>Submeter-Id (ID do remetente):</emphasis> Não altere isso. O valor padrão de <literal>current-users</literal> está correto, mesmo se você estiver usando o FreeBSD-STABLE.

source: <emphasis>Confidential:</emphasis> This is prefilled to <literal>no</literal>. Changing it makes no sense as there is no such thing as a confidential FreeBSD problem report—the PR database is distributed worldwide.
pt_br: <emphasis>Confidential (Confidencial): </emphasis> Isto é pré-preenchido como <literal>no</literal>. Alterá-lo não faz sentido, já que não existe um relatório confidencial de problemas do FreeBSD - o banco de dados de PR é distribuído para todo mundo.

source: <emphasis>Severity:</emphasis> One of <literal>non-critical</literal>, <literal>serious</literal> or <literal>critical</literal>. Do not overreact; refrain from labeling your problem <literal>critical</literal> unless it really is (e.g., data corruption issues, serious regression from previous functionality in -CURRENT) or <literal>serious</literal> unless it is something that will affect many users (kernel panics or freezes; problems with particular device drivers or system utilities). FreeBSD developers will not necessarily work on your problem faster if you inflate its importance since there are so many other people who have done exactly that — in fact, some developers pay little attention to this field because of this.
pt_br: <emphasis>Severety (Gravidade):</emphasis> Um dos <literal>non-critical (não críticos)</literal>, <literal>serious (sério)</literal> ou <literal>critical (crítico)</literal>. Não exagere; abstenha-se de rotular seu problema como <literal>critical</literal> a menos que realmente seja (por exemplo, problemas de corrupção de dados, séria regressão da funcionalidade anterior no -CURRENT) ou <literal>serious</literal> a menos que seja algo que afetará muitos usuários (kernel entra em pane ou congela; problemas com determinados drivers de dispositivo ou utilitários do sistema). Os desenvolvedores do FreeBSD não irão necessariamente trabalhar no seu problema mais rapido se você inflar sua importância, já que há tantas outras pessoas que fizeram exatamente isso - na verdade, alguns desenvolvedores dão pouca atenção a esse campo por causa disso.

source: <emphasis>Priority:</emphasis> This field indicates how widespread the effects of this bug is likely to be.
pt_br: <emphasis>Priority (Prioridade):</emphasis> Este campo indica o quão abrangentes sejam os efeitos deste bug.

source: The next section describes fields that are common to both the email interface and the <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi">web interface</link>:
pt_br: A próxima seção descreve os campos que são comuns a ambos, interface de e-mail e a <link xlink:href="https://bugs.freebsd.org/bugzilla/enter_bug.cgi">interface web</link>:

source: <emphasis>Originator:</emphasis> Please specify your real name, optionally followed by your email address in angle brackets. In the email interface, this is normally prefilled with the <literal>gecos</literal> field of the currently logged-in user.
pt_br: <emphasis>Originator (Originador):</emphasis> Por favor, especifique seu nome verdadeiro, seguido opcionalmente pelo seu endereço de e-mail entre colchetes angulares (sinais de maior e menor <>). Na interface de email, isso é normalmente preenchido com o campo <literal>gecos</literal> do usuário atualmente logado.

source: The email address you use will become public information and may become available to spammers. You should either have spam handling procedures in place, or use a temporary email account. However, please note that if you do not use a valid email account at all, we will not be able to ask you questions about your PR.
es_es: La dirección de correo electrónico que utilice pasará a ser pública y podrá estar disponible para los spammers. Debe tener implementados procedimientos de manejo de spam o usar una cuenta de correo electrónico temporal. Sin embargo, tenga en cuenta que si no utiliza una cuenta de correo electrónico válida, no podremos hacerle preguntas sobre su PR.
pt_br: O endereço de e-mail que você usa se tornará publico e poderá se tornar disponível para spammers. Você deve ter procedimentos de tratamento de spam ou usar uma conta de email temporária. No entanto, observe que, se você não usar uma conta de e-mail válida, não poderemos fazer perguntas sobre seu PR.

source: <emphasis>Organization:</emphasis> Whatever you feel like. This field is not used for anything significant.
pt_br: <emphasis>Organization (Organização):</emphasis> O que você quiser. Este campo não é usado para nada significativo.

source: <emphasis>Synopsis:</emphasis> Fill this out with a short and accurate description of the problem. The synopsis is used as the subject of the problem report email, and is used in problem report listings and summaries; problem reports with obscure synopses tend to get ignored.
pt_br: <emphasis>Synopsis (Sinopse):</emphasis> Preencha com uma descrição breve e precisa do problema. A sinopse é usada como assunto do email do relatório de problemas. A sinopse é usada em listagens e resumos de relatórios de problemas; relatórios de problemas com sinopses obscuras tendem a ser ignoradas.

source: As noted above, if your problem report includes a patch, please have the synopsis start with <literal>[patch]</literal> (including the brackets); if this is a ports PR and you are the maintainer, you may consider adding <literal>[maintainer update]</literal> (including the brackets) and set the <quote>Class</quote> of your PR to <literal>maintainer-update</literal>.
pt_br: Como mencionado acima, se o seu relatório de problemas incluir um patch, faça com que a sinopse comece com <literal>[patch]</literal> (incluindo os colchetes); se este for um PR de um ports que você for o mantenedor, você pode considerar adicionar <literal>[maintainer update]</literal> (incluindo os colchetes) e definir a <quote>Class (Classe)</quote> do seu PR para <literal>maintainer-update</literal>.

source: <emphasis>Category:</emphasis> Choose an appropriate category.
es_es: <emphasis>Category:</emphasis> Elija una categoría apropiada.
pt_br: <emphasis>Category (Categoria):</emphasis> Escolha uma categoria apropriada.
