Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/problem-reports/*.po
Languages: es_es, pt_br

source: A good rule to follow is to always do a background search before submitting a problem report. Maybe the problem has already been reported; maybe it is being discussed on the mailing lists, or recently was; it may even already be fixed in a newer version than what you are running. You should therefore check all the obvious places before submitting your problem report. For FreeBSD, this means:
es_es: Una buena regla que se puede seguir consiste en realizar siempre una búsqueda antes de enviar un informe de problemas. Quizá nuestro problema ya ha sido reportado; quizá se está discutiendo en las listas de correo o fue discutido hace poco; incluso puede que ya esté arreglado en una versión más nueva que la que está ejecutando. Por lo tanto, se deben consultar los sitios y fuentes más obvias antes de proceder con el envío del informe de errores. En FreeBSD, esto significa:
pt_br: Uma boa regra a seguir é sempre fazer uma pesquisa sobre o tema antes de enviar um relatório de problemas. Talvez o problema já tenha sido relatado anteriormente; talvez esteja sendo discutido nas listas de discussão, ou foi discutido recentemente; pode até mesmo já estar corrigido em uma versão mais recente da que você está executando. Portanto, você deve verificar todos os lugares óbvios antes de enviar seu relatório de problemas. Para o FreeBSD, isso significa:

source: The FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html">Frequently Asked Questions</link> (FAQ) list. The FAQ attempts to provide answers for a wide range of questions, such as those concerning <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/hardware.html">hardware compatibility</link>, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/applications.html">user applications</link>, and <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/kernelconfig.html">kernel configuration</link>.
es_es: La lista de <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/faq/index.html">preguntas más frecuentes</link> (FAQ) de FreeBSD. Las preguntas frecuentes intentan proporcionar respuestas a una amplia gama de preguntas, como las relacionadas con la <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/faq/hardware.html">compatibilidad del hardware</link>, las <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/faq/applications.html">aplicaciones de usuario</link> y la <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/faq/kernelconfig.html">configuración del kernel</link>.
pt_br: A lista das <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/index.html">Perguntas Mais Freqüentes</link> (FAQ) sobre o FreeBSD. A FAQ tenta fornecer respostas para uma ampla variedade de perguntas, como aquelas relacionadas à <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/hardware.html">compatibilidade de hardware </link>, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/applications.html"> aplicativos de usuário</link> e <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/faq/kernelconfig.html"> configuração do kernel</link>.

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">mailing lists</link>—if you are not subscribed, use <link xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">the searchable archives</link> on the FreeBSD web site. If the problem has not been discussed on the lists, you might try posting a message about it and waiting a few days to see if someone can spot something that has been overlooked.
es_es: Las <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">listas de correo</link>, si no está suscrito, utilice la <link xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">búsqueda en los archivos</link> del sitio web de FreeBSD. Si el problema no se ha discutido con anterioridad en las listas, se puede intentar enviar un mensaje y esperar unos pocos días para ver si alguien puede aconsejarle adecuadamente sobre algún punto que quizá haya pasado por alto en relación con el problema.
pt_br: As <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">listas de discussão</link> - se você não está inscrito, faça uma pesquisa nos arquivos <link xlink:href="https://www.FreeBSD.org/search/search.html#mailinglists">históricos das listas</link> no site do FreeBSD. Se o problema não tiver sido discutido nas listas, você pode tentar postar uma mensagem sobre ele e aguardar alguns dias para ver se alguém consegue detectar algo que foi esquecido.

source: Optionally, the entire web—use your favorite search engine to locate any references to the problem. You may even get hits from archived mailing lists or newsgroups you did not know of or had not thought to search through.
es_es: Opcionalmente, toda la web: utilice su motor de búsqueda favorito para localizar cualquier referencia al problema. Incluso puede obtener listas de correo archivadas o grupos de noticias que no conocía o en los que no había pensado buscar.
pt_br: Opcionalmente, na web toda - use seu mecanismo de pesquisa favorito para localizar qualquer referência ao problema. Você pode até receber hits de listas de discussão arquivadas ou grupos de notícias que você não conhecia ou que não pensou em pesquisar.

source: Next, the searchable <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">FreeBSD PR database</link> (Bugzilla). Unless the problem is recent or obscure, there is a fair chance it has already been reported.
es_es: A continuación, la búsqueda a través de la <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">base de datos de PR de FreeBSD</link> (Bugzilla). A menos que el problema sea muy reciente o rebuscado, existe un gran número de posibilidades de que ya haya sido informado o reportado.
pt_br: Em seguida, faça uma pesquisa no <link xlink:href="https://bugs.freebsd.org/bugzilla/query.cgi">banco de dados de Relatórios de Problemas do FreeBSD</link> (Bugzilla). A menos que o problema seja recente ou obscuro, há uma boa chance de que ele já tenha sido relatado.

source: Most importantly, attempt to see if existing documentation in the source base addresses your problem.
es_es: Lo más importante, se debería intentar comprobar si la documentación existente en el código fuente del programa puede resolver el problema.
pt_br: Mais importante ainda, tente verificar se a documentação existente não endereça o seu problema.

source: For the base FreeBSD code, you should carefully study the contents of <filename>/usr/src/UPDATING</filename> on your system or the latest version at <uri xlink:href="https://svnweb.freebsd.org/base/head/UPDATING?view=log">https://svnweb.freebsd.org/base/head/UPDATING?view=log</uri>. (This is vital information if you are upgrading from one version to another—especially if you are upgrading to the FreeBSD-CURRENT branch).
es_es: Para el código base de FreeBSD, debe estudiar cuidadosamente el contenido del fichero <filename>/usr/src/UPDATING</filename> del sistema o la versión más reciente en <uri xlink:href="https://svnweb.freebsd.org/base/head/UPDATING?view=log">https://svnweb.freebsd.org/base/head/UPDATING?view=log</uri>. (Esta información se considera de vital importancia si se está actualizando de una versión a otra, especialmente si está actualizando a la rama de FreeBSD-CURRENT).
pt_br: Para o código fonte do FreeBSD, você deve estudar cuidadosamente o conteúdo do <filename>/usr/src/UPDATING</filename> em seu sistema ou a última versão disponível em <uri xlink:href="https://svnweb.freebsd.org/base/head/UPDATING?view=log"> https://svnweb.freebsd.org/base/head/UPDATING?view=log</uri>. (Esta é uma informação vital se você estiver atualizando de uma versão para outra - especialmente se você estiver atualizando para a Branch FreeBSD-CURRENT).

source: However, if the problem is in something that was installed as a part of the FreeBSD Ports Collection, you should refer to <filename>/usr/ports/UPDATING</filename> (for individual ports) or <filename>/usr/ports/CHANGES</filename> (for changes that affect the entire Ports Collection). <uri xlink:href="https://svnweb.freebsd.org/ports/head/UPDATING?view=log">https://svnweb.freebsd.org/ports/head/UPDATING?view=log</uri> and <uri xlink:href="https://svnweb.freebsd.org/ports/head/CHANGES?view=log">https://svnweb.freebsd.org/ports/head/CHANGES?view=log</uri> are also available via svnweb.
es_es: No obstante, si el problema se encuentra en algo que se instaló como parte de la colección de ports de FreeBSD, se debe consultar el archivo <filename>/usr/ports/UPDATING</filename> (para ports individuales) o el archivo <filename>/usr/ports/CHANGES</filename> (para cambios que afectan a la colección de ports completa). <uri xlink:href="https://svnweb.freebsd.org/ports/head/UPDATING?view=log">https://svnweb.freebsd.org/port/head/UPDATING?view=log</uri> y <uri xlink:href="https://svnweb.freebsd.org/ports/head/CHANGES?view=log">https://svnweb.freebsd.org/ports/head/CHANGES?view=log</uri> también están disponibles a través de svnweb.
pt_br: No entanto, se o problema estiver em algo que foi instalado como parte da coleção de ports do FreeBSD, você deve consultar <filename>/usr/ports/UPDATING</filename> (para ports individuais) ou <filename>/usr/ports/CHANGES</filename> (para alterações que afetam toda a coleção de ports). O <uri xlink:href="https://svnweb.freebsd.org/ports/head/UPDATING?view=log">https://svnweb.freebsd.org/ports/head/UPDATING?view=log</uri> e o <uri xlink:href="https://svnweb.freebsd.org/ports/head/CHANGES?view=log">https://svnweb.freebsd.org/ports/head/CHANGES?view=log</uri> também estão disponíveis via svnweb.

source: Writing the Problem Report
es_es: Escribiendo el informe de problemas
pt_br: Escrevendo o Relatório do Problema

source: Now that you have decided that your issue merits a problem report, and that it is a FreeBSD problem, it is time to write the actual problem report. Before we get into the mechanics of the program used to generate and submit PRs, here are some tips and tricks to help make sure that your PR will be most effective.
es_es: Ahora que ha decidido que su problema merece un informe de problemas y que es un problema de FreeBSD, es el momento de escribir el informe de problemas propiamente dicho. Antes de pasar a describir los mecanismos utilizados por el programa encargado de generar y enviar los PRs, aquí hay algunos consejos y trucos para ayudarle a asegurarse de que su PR sea más efectivo.
pt_br: Agora que você decidiu que seu problema merece um relatório de problema e que ele é um problema especifico do FreeBSD, é hora de escrever o relatório de problema. Antes de entrarmos na mecânica do sistema utilizado para gerar e enviar os PRs, aqui estão algumas dicas e truques para ajudar a garantir que seu o PR seja mais eficaz.

source: Tips and Tricks for Writing a Good Problem Report
es_es: Consejos y trucos para escribir un buen informe de problemas
pt_br: Dicas e Truques para Escrever um Bom Relatório de Problemas

source: <emphasis>Do not leave the <quote>Synopsis</quote> line empty.</emphasis> The PRs go both onto a mailing list that goes all over the world (where the <quote>Synopsis</quote> is used for the <literal>Subject:</literal> line), but also into a database. Anyone who comes along later and browses the database by synopsis, and finds a PR with a blank subject line, tends just to skip over it. Remember that PRs stay in this database until they are closed by someone; an anonymous one will usually just disappear in the noise.
pt_br: <emphasis>Não deixe a linha <quote>Synopsis</quote> (Sinopse) vazia. </emphasis>Os PRs são enviados para listas de discussão no mundo todo (nas quais <quote>Synopsis</quote> é usado para na linha de <literal>Subject:</literal>), além de serem armazenadas em um banco de dados. Qualquer pessoa que vier a navegar no banco de dados pelas sinopses, e encontrar um PR com a linha de assunto em branco, tende a pulá-lo. Lembre-se que os PRs permanecem na base de dados até que sejam fechados por alguém; os anônimos normalmente irão desaparecer em meio ao ruído.

source: <emphasis>Avoid using a weak <quote>Synopsis</quote> line.</emphasis> You should not assume that anyone reading your PR has any context for your submission, so the more you provide, the better. For instance, what part of the system does the problem apply to? Do you only see the problem while installing, or while running? To illustrate, instead of <literal>Synopsis: portupgrade is broken</literal>, see how much more informative this seems: <literal>Synopsis: port ports-mgmt/portupgrade coredumps on -current</literal>. (In the case of ports, it is especially helpful to have both the category and portname in the <quote>Synopsis</quote> line.)
pt_br: <emphasis>Evite usar uma <quote>Sinopse</quote> (Sinopse) fraca. </emphasis> Você não deve presumir que alguém que esteja lendo seu PR conheça o contexto que motivou o seu envio, desta forma, quanto mais informação você fornecer, melhor. Por exemplo, a parte do sistema o problema se aplica? O problema ocorre durante a instalação ou durante a execução do sistema? Para ilustrar, em vez de usa <literal>Sinopse: o portupgrade está quebrado</literal>, veja o quanto mais informativo isso parece: <literal> Sinopse: port ports-mgmt/portupgrade gerando coredumps on -current</literal>. (No caso de um port, é especialmente útil ter tanto o nome da categoria quanto o nome do port na linha <quote>Sinopse</quote>.)

source: <emphasis>If you have a patch, say so.</emphasis> A PR with a patch included is much more likely to be looked at than one without. If you are including one, put the string <literal>[patch]</literal> (including the brackets) at the beginning of the <quote>Synopsis</quote>. (Although it is not mandatory to use that exact string, by convention, that is the one that is used.)
pt_br: <emphasis>Se você tem um patch, mencione-o.</emphasis> Um PR com um patch incluído é muito mais provável de ser analisado do que um sem. Se você está incluindo um, coloque a palavra <literal>[patch]</literal> (incluindo os colchetes) no início da linha de <quote>Sinopse</quote>. (Embora não seja obrigatório usar exatamente essa palavra, por convenção, essa é a que é usada.)

source: <emphasis>If you are a maintainer, say so.</emphasis> If you are maintaining a part of the source code (for instance, a port), you might consider adding the string <literal>[maintainer update]</literal> (including the brackets) at the beginning of your synopsis line, and you definitely should set the <quote>Class</quote> of your PR to <literal>maintainer-update</literal>. This way any committer that handles your PR will not have to check.
pt_br: <emphasis>Se você é um mantenedor, diga.</emphasis> Se você está mantendo uma parte do código fonte (por exemplo, um port), você pode considerar adicionar as palavras <literal>[atualização do mantenedor]</literal> (incluindo os colchetes) no início da sua linha de sinopse, e você definitivamente deve definir a <quote>Class</quote> (Classe) do seu PR para <literal>maintainer-update</literal>. Desta forma, qualquer committer que lide com seu PR não terá que verificar o Makefile do port, para certificar-se de que a atualização foi enviada pelo maintainer.

source: <emphasis>Be specific.</emphasis> The more information you supply about what problem you are having, the better your chance of getting a response.
es_es: <emphasis>Sea concreto.</emphasis> Cuanta más información se proporcione sobre el problema que tiene, más posibilidades de obtener una respuesta.
pt_br: <emphasis>Seja específico.</emphasis> Quanto mais informações você fornecer sobre o problema que está tendo, maiores serão suas chances de obter uma resposta.

source: Include the version of FreeBSD you are running (there is a place to put that, see below) and on which architecture. You should include whether you are running from a release (e.g., from a <acronym>CD-ROM</acronym> or download), or from a system maintained by Subversion (and, if so, what revision number you are at). If you are tracking the FreeBSD-CURRENT branch, that is the very first thing someone will ask, because fixes (especially for high-profile problems) tend to get committed very quickly, and FreeBSD-CURRENT users are expected to keep up.
es_es: Incluya la versión de FreeBSD que está ejecutando (existe un lugar donde escribir esta información, vea a continuación) y en qué arquitectura. Debe incluir si se está ejecutando desde una release (por ejemplo, desde un <acronym>CD-ROM</acronym> o descarga), o si es desde un sistema mantenido por Subversion (y, si es así, en qué número de revisión se encuentra). Si está usando la rama FreeBSD-CURRENT, esa es la primera pregunta que le harán, porque las correcciones (especialmente para problemas de alto nivel) tienden a aplicarse muy rápidamente, y se espera que los usuarios de FreeBSD-CURRENT se mantengan al día.
pt_br: Inclua a versão do FreeBSD que você está utilizando (há um lugar para colocar essa informação, veja abaixo) e em qual arquitetura. Você deve incluir se você está executando a partir de uma release (por exemplo, de um <acronym>CD-ROM</acronym> ou feito um download), ou de um sistema mantido pelo Subversion (e, caso seja afirmativo, em qual número de revisão você está). Se você estiver utilizando a branch FreeBSD-CURRENT, essa é a primeira coisa que alguém vai perguntar, porque as correções (especialmente para problemas de alto nível) tendem a ser realizadas muito rapidamente, e é esperado que usuários do FreeBSD-CURRENT se mantenham atualizados.

source: Include which global options you have specified in your <filename>make.conf</filename>. Note: specifying <literal>-O2</literal> and above to <citerefentry><refentrytitle>gcc</refentrytitle><manvolnum>1</manvolnum></citerefentry> is known to be buggy in many situations. While the FreeBSD developers will accept patches, they are generally unwilling to investigate such issues due to simple lack of time and volunteers, and may instead respond that this just is not supported.
pt_br: Inclua quais opções globais você especificou em seu <filename>make.conf</filename>. Nota: sabemos que especificar <literal>-O2</literal> e acima com o <citerefentry><refentrytitle>gcc</refentrytitle><manvolnum>1</manvolnum></citerefentry> gera bugs em muitas situações. Embora os desenvolvedores do FreeBSD aceitem patches, eles geralmente não estarão dispostos a investigar tais problemas devido a simples falta de tempo e de voluntários, ao invés disso podem apenas responder que isso simplesmente não é suportado.

source: If the problem can be reproduced easily, include information that will help a developer to reproduce it themselves. If a problem can be demonstrated with specific input then include an example of that input if possible, and include both the actual and the expected output. If this data is large or cannot be made public, then do try to create a minimal file that exhibits the same issue and that can be included within the PR.
es_es: Si el problema se puede reproducir fácilmente, incluya información que ayude al desarrollador a reproducirlo por sí mismo. Si se puede hacer una demostración con una entrada específica, incluya un ejemplo con esa entrada, si es posible, e incluya la salida real y la esperada. Si la información es grande o no se puede hacer pública, intente crear un archivo con lo mínimo que muestre el mismo problema y que pueda incluirse en el PR.
pt_br: Se o problema puder ser reproduzido facilmente, inclua informações que irão ajudar um desenvolvedor a reproduzi-lo. Se um problema puder ser demonstrado com uma entrada específica, então inclua um exemplo desta entrada se possível, e inclua tanto a saída real quanto a esperada. Se esses dados forem grandes ou não puderem ser tornados públicos, então tente criar um arquivo pequeno que exiba o mesmo problema e que possa ser incluído no PR.

source: If this is a kernel problem, then be prepared to supply the following information. (You do not have to include these by default, which only tends to fill up the database, but you should include excerpts that you think might be relevant):
es_es: Si se trata de un problema del kernel, prepárese para proporcionar la siguiente información. (No es necesario incluir esta información por defecto, puesto que lo único que produce es un crecimiento desmesurado de la base de datos, pero sí puede merecer la pena incluir extractos que usted considere importantes):
pt_br: Se este for um problema do kernel, esteja preparado para fornecer as seguintes informações. (Você não precisa incluí-las por padrão, o que apenas tende a preencher o banco de dados, mas você deve incluir os trechos que considera ser relevantes):

source: your kernel configuration (including which hardware devices you have installed)
es_es: la configuración del kernel (incluidos los dispositivos de hardware que ha instalado)
pt_br: sua configuração do kernel (incluindo quais dispositivos de hardware você tem instalado)

source: whether or not you have debugging options enabled (such as <literal>WITNESS</literal>), and if so, whether the problem persists when you change the sense of that option
es_es: si tiene o no opciones de depuración activadas (como <literal>WITNESS</literal>), y si es así, si el problema persiste cuando se cambia el valor de dichas opciones
pt_br: independente de você ter ou não opções de debug habilitadas (como <literal>WITNESS</literal>), e se tiver, se o problema persiste quando você muda o sentido da opção

source: the full text of any backtrace, panic or other console output, or entries in <filename>/var/log/messages</filename>, if any were generated
es_es: el texto completo de cualquier backtrace, panic u otra salida por consola, o entradas en <filename>/var/log/messages</filename>, si se generó alguna
pt_br: o texto completo de qualquer backtrace, panic ou outra mensagens de console, ou registros em <filename>/var/log/messages</filename>, se houver sido gerado

source: the output of <command>pciconf -l</command> and relevant parts of your <command>dmesg</command> output if your problem relates to a specific piece of hardware
es_es: la salida de <command>pciconf -l</command> y partes relevantes de su salida <command>dmesg</command> si su problema se relaciona con una pieza específica de hardware
pt_br: a saída de <command>pciconf -l</command> e partes relevantes da saída do comando <command>dmesg</command> se o seu problema estiver relacionado a uma peça específica de hardware

source: the fact that you have read <filename>src/UPDATING</filename> and that your problem is not listed there (someone is guaranteed to ask)
es_es: el hecho de que haya leído <filename>src/UPDATING</filename> y que su problema no esté listado (seguro que alguien le preguntará sobre este punto)
pt_br: o fato de você ter lido <filename>src/UPDATING</filename> e o seu problema não estar listado lá (alguém pode perguntar)

source: whether or not you can run any other kernel as a fallback (this is to rule out hardware-related issues such as failing disks and overheating CPUs, which can masquerade as kernel problems)
es_es: si puede o no ejecutar otro kernel de respaldo sin problemas (se trata de descartar problemas relacionados con el hardware, como discos con errores o CPUs con sobrecalentamiento, que pueden confundirse fácilmente con problemas del kernel)
pt_br: independente de você poder executar qualquer outro kernel como um fallback (isso é para descartar problemas relacionados a hardware, como discos com falhas e CPUs superaquecidas, que podem se passar por problemas de kernel)
