Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/printing/_index.po
Languages: ru

source: _Filters_ allow files to be translated or processed. The typical use is to translate one type of input, like plain text, into a form that the printer can understand, like PostScript(R) or `PCL`. Filters can also be used to provide additional features, like adding page numbers or highlighting source code to make it easier to read.
ru: Фильтры позволяют преобразовывать или обрабатывать файлы. Обычно они используются для преобразования одного типа входных данных, например, простого текста, в формат, который принтер может понять, например PostScript(R) или `PCL`. Фильтры также могут использоваться для предоставления дополнительных функций, таких как добавление номеров страниц или подсветка исходного кода для удобства чтения.

source: The filters discussed here are _input filters_ or _text filters_. These filters convert the incoming file into different forms. Use man:su[1] to become `root` before creating the files.
ru: Обсуждаемые здесь фильтры являются _входными фильтрами_ или _текстовыми фильтрами_. Эти фильтры преобразуют входящий файл в различные формы. Используйте man:su[1], чтобы стать `root` перед созданием файлов.

source: Filters are specified in [.filename]#/etc/printcap# with the `if=` identifier. To use [.filename]#/usr/local/libexec/lf2crlf# as a filter, modify [.filename]#/etc/printcap# like this:
ru: Фильтры указываются в [.filename]#/etc/printcap# с идентификатором `if=`. Чтобы использовать [.filename]#/usr/local/libexec/lf2crlf# в качестве фильтра, измените [.filename]#/etc/printcap# следующим образом:

source: `if=` identifies the _input filter_ that will be used on incoming text.
ru: `if=` определяет _входной фильтр_, который будет использоваться для входящего текста.

source: The backslash _line continuation_ characters at the end of the lines in [.filename]#printcap# entries reveal that an entry for a printer is really just one long line with entries delimited by colon characters. An earlier example can be rewritten as a single less-readable line:
ru: Символы обратной косой черты _продолжения строки_ в конце строк в записях [.filename]#printcap# показывают, что запись для принтера на самом деле представляет собой одну длинную строку с элементами, разделёнными двоеточиями. Предыдущий пример можно переписать в виде одной менее читаемой строки:

source: Preventing Stairstepping on Plain Text Printers
ru: Предотвращение ступенчатости на простых текстовых принтерах

source: Typical FreeBSD text files contain only a single line feed character at the end of each line. These lines will "stairstep" on a standard printer:
ru: Типичные текстовые файлы FreeBSD содержат только один символ перевода строки в конце каждой строки. Эти строки будут выводиться "лесенкой" на стандартном принтере:

source: A filter can convert the newline characters into carriage returns and newlines. The carriage returns make the printer return to the left after each line. Create [.filename]#/usr/local/libexec/lf2crlf# with these contents:
ru: Фильтр может преобразовывать символы новой строки в возврат каретки и новую строку. Возврат каретки заставляет принтер возвращаться к левому краю после каждой строки. Создайте файл [.filename]#/usr/local/libexec/lf2crlf# со следующим содержимым:

source: Set the permissions and make it executable:
ru: Установите разрешения и сделайте файл исполняемым:

source: Modify [.filename]#/etc/printcap# to use the new filter:
ru: Измените [.filename]#/etc/printcap#, чтобы использовать новый фильтр:

source: Test the filter by printing the same plain text file. The carriage returns will cause each line to start at the left side of the page.
ru: Протестируйте фильтр, напечатав тот же текстовый файл. Возврат каретки приведет к тому, что каждая строка будет начинаться с левого края страницы.

source: Fancy Plain Text on PostScript(R) Printers with package:print/enscript[]
ru: Красивое оформление текста на PostScript(R) принтерах с помощью package:print/enscript[]

source: GNUEnscript converts plain text files into nicely-formatted PostScript(R) for printing on PostScript(R) printers. It adds page numbers, wraps long lines, and provides numerous other features to make printed text files easier to read. Depending on the local paper size, install either package:print/enscript-letter[] or package:print/enscript-a4[] from the Ports Collection.
ru: GNUEnscript преобразует обычные текстовые файлы в аккуратно отформатированный PostScript(R) для печати на принтерах PostScript(R). Он добавляет номера страниц, переносит длинные строки и предоставляет множество других функций, чтобы сделать печать текстовых файлов более удобочитаемой. В зависимости от местного размера бумаги установите один из пакетов: package:print/enscript-letter[] или package:print/enscript-a4[] из коллекции портов.

source: Create [.filename]#/usr/local/libexec/enscript# with these contents:
ru: Создайте файл [.filename]#/usr/local/libexec/enscript# со следующим содержимым:

source: Test the filter by printing a plain text file.
ru: Проверьте фильтр, напечатав простой текстовый файл.

source: Printing PostScript(R) to `PCL` Printers
ru: Печать PostScript(R) на принтеры `PCL`

source: Many programs produce PostScript(R) documents. However, inexpensive printers often only understand plain text or `PCL`. This filter converts PostScript(R) files to `PCL` before sending them to the printer.
ru: Многие программы создают документы в формате PostScript(R). Однако недорогие принтеры часто поддерживают только простой текст или `PCL`. Этот фильтр преобразует файлы PostScript(R) в `PCL` перед отправкой на принтер.

source: Install the Ghostscript PostScript(R) interpreter, package:print/ghostscript9-base[], from the Ports Collection.
ru: Установите интерпретатор PostScript(R) Ghostscript, package:print/ghostscript9-base[], из коллекции портов.

source: Create [.filename]#/usr/local/libexec/ps2pcl# with these contents:
ru: Создайте файл [.filename]#/usr/local/libexec/ps2pcl# со следующим содержимым:

source: PostScript(R) input sent to this script will be rendered and converted to `PCL` before being sent on to the printer.
ru: Поступающие на вход этого скрипта данные в формате PostScript(R) будут обработаны, преобразованы в `PCL` и отправлены на принтер.

source: Modify [.filename]#/etc/printcap# to use this new input filter:
ru: Измените файл [.filename]#/etc/printcap#, чтобы использовать новый входной фильтр:

source: Test the filter by sending a small PostScript(R) program to it:
ru: Протестируйте фильтр, отправив в него небольшую программу PostScript(R):

source: Smart Filters
ru: Умные Фильтры

source: A filter that detects the type of input and automatically converts it to the correct format for the printer can be very convenient. The first two characters of a PostScript(R) file are usually `%!`. A filter can detect those two characters. PostScript(R) files can be sent on to a PostScript(R) printer unchanged. Text files can be converted to PostScript(R) with Enscript as shown earlier. Create [.filename]#/usr/local/libexec/psif# with these contents:
ru: Фильтр, который определяет тип входных данных и автоматически преобразует их в правильный формат для принтера, может быть очень удобным. Первые два символа файла PostScript(R) обычно `%!`. Фильтр может обнаружить эти два символа. Файлы PostScript(R) можно передавать на PostScript(R) принтер без изменений. Текстовые файлы можно преобразовать в PostScript(R) с помощью Enscript, как показано ранее. Создайте файл [.filename]#/usr/local/libexec/psif# с таким содержимым:

source: Test the filter by printing PostScript(R) and plain text files.
ru: Протестируйте фильтр, распечатав файлы в формате PostScript(R) и обычные текстовые файлы.

source: Multiple Queues
ru: Множественные очереди

source: The entries in [.filename]#/etc/printcap# are really definitions of _queues_. There can be more than one queue for a single printer. When combined with filters, multiple queues provide users more control over how their jobs are printed.
ru: Записи в [.filename]#/etc/printcap# фактически являются определениями _очередей_. Для одного принтера может быть несколько очередей. В сочетании с фильтрами множественные очереди предоставляют пользователям больше контроля над печатью их заданий.

source: As an example, consider a networked PostScript(R) laser printer in an office. Most users want to print plain text, but a few advanced users want to be able to print PostScript(R) files directly. Two entries can be created for the same printer in [.filename]#/etc/printcap#:
ru: В качестве примера рассмотрим сетевой PostScript(R) лазерный принтер в офисе. Большинство пользователей хотят печатать простой текст, но несколько продвинутых пользователей хотят иметь возможность печатать PostScript(R) файлы напрямую. Для одного и того же принтера можно создать две записи в [.filename]#/etc/printcap#:

source: Documents sent to `textprinter` will be formatted by the [.filename]#/usr/local/libexec/enscript# filter shown in an earlier example. Advanced users can print PostScript(R) files on `psprinter`, where no filtering is done.
ru: Документы, отправленные на `textprinter`, будут отформатированы фильтром [.filename]#/usr/local/libexec/enscript#, показанным в предыдущем примере. Опытные пользователи могут печатать PostScript(R) файлы на `psprinter`, где фильтрация не выполняется.

source: This multiple queue technique can be used to provide direct access to all kinds of printer features. A printer with a duplexer could use two queues, one for ordinary single-sided printing, and one with a filter that sends the command sequence to enable double-sided printing and then sends the incoming file.
ru: Этот метод с несколькими очередями может быть использован для предоставления прямого доступа к различным функциям принтера. Принтер с дуплексом может использовать две очереди: одну для обычной односторонней печати и другую с фильтром, который отправляет последовательность команд для включения двусторонней печати, а затем передает входящий файл.

source: Monitoring and Controlling Printing
ru: Мониторинг и управление печатью

source: Several utilities are available to monitor print jobs and check and control printer operation.
ru: Доступно несколько утилит для мониторинга заданий печати, проверки и управления работой принтера.

source: man:lpq[1] shows the status of a user's print jobs. Print jobs from other users are not shown.
ru: man:lpq[1] отображает состояние заданий печати пользователя. Задания печати других пользователей не показываются.

source: Show the current user's pending jobs on a single printer:
ru: Показать ожидающие задания текущего пользователя на одном принтере:

source: Show the current user's pending jobs on all printers:
ru: Показать ожидающие задания текущего пользователя на всех принтерах:

source: man:lprm[1] is used to remove print jobs. Normal users are only allowed to remove their own jobs. `root` can remove any or all jobs.
ru: man:lprm[1] используется для удаления заданий печати. Обычные пользователи могут удалять только свои собственные задания. `root` может удалять любые или все задания.

source: Remove all pending jobs from a printer:
ru: Удалить все ожидающие задания из принтера:

source: Remove a single job from a printer. man:lpq[1] is used to find the job number.
ru: Удалить отдельное задание из принтера. Для определения номера задания используется man:lpq[1].

source: man:lpc[8] is used to check and modify printer status. `lpc` is followed by a command and an optional printer name. `all` can be used instead of a specific printer name, and the command will be applied to all printers. Normal users can view status with man:lpc[8]. Only `root` can use commands which modify printer status.
ru: man:lpc[8] используется для проверки и изменения состояния принтеров. После `lpc` указывается команда и, при необходимости, имя принтера. Вместо имени конкретного принтера можно использовать `all`, и тогда команда будет применена ко всем принтерам. Обычные пользователи могут просматривать статус с помощью man:lpc[8]. Только пользователь `root` может использовать команды, изменяющие состояние принтеров.

source: Show the status of all printers:
ru: Показать состояние всех принтеров:

source: Prevent a printer from accepting new jobs, then begin accepting new jobs again:
ru: Запретить принтеру принимать новые задания, затем снова разрешить прием новых заданий:

source: Stop printing, but continue to accept new jobs. Then begin printing again:
ru: Приостановить печать, но продолжать принимать новые задания. Затем возобновить печать:

source: Restart a printer after some error condition:
ru: Перезапустить принтер после возникновения ошибки:

source: Turn the print queue off and disable printing, with a message to explain the problem to users:
ru: Отключите очередь печати и запретите печать, добавив сообщение для пользователей с объяснением проблемы:

source: Re-enable a printer that is down:
ru: Включить принтер, который выключен:

source: See man:lpc[8] for more commands and options.
ru: См. man:lpc[8] для получения дополнительных команд и параметров.

source: Shared Printers
ru: Общие принтеры

source: Printers are often shared by multiple users in businesses and schools. Additional features are provided to make sharing printers more convenient.
ru: Принтеры часто используются совместно несколькими пользователями в офисах и учебных заведениях. Для удобства совместного использования предусмотрены дополнительные функции.

source: The printer name is set in the first line of the entry in [.filename]#/etc/printcap#. Additional names, or _aliases_, can be added after that name. Aliases are separated from the name and each other by vertical bars:
ru: Имя принтера задается в первой строке записи в [.filename]#/etc/printcap#. Дополнительные имена или _псевдонимы_ могут быть добавлены после этого имени. Псевдонимы отделяются от имени и друг от друга вертикальными чертами:

source: Aliases can be used in place of the printer name. For example, users in the Sales department print to their printer with
ru: Алиасы могут использоваться вместо имени принтера. Например, сотрудники отдела продаж печатают на свой принтер с помощью

source: Users in the Repairs department print to _their_ printer with
ru: Пользователи отдела ремонта печатают на _своём_ принтере с помощью

source: All of the documents print on that single printer. When the Sales department grows enough to need their own printer, the alias can be removed from the shared printer entry and used as the name of a new printer. Users in both departments continue to use the same commands, but the Sales documents are sent to the new printer.
ru: Все документы печатаются на этом единственном принтере. Когда отдел продаж разрастётся настолько, что ему понадобится собственный принтер, псевдоним можно удалить из записи общего принтера и использовать как имя нового принтера. Пользователи в обоих отделах продолжают использовать те же команды, но документы отдела продаж отправляются на новый принтер.

source: Header Pages
ru: Страницы заголовков

source: It can be difficult for users to locate their documents in the stack of pages produced by a busy shared printer. _Header pages_ were created to solve this problem. A header page with the user name and document name is printed before each print job. These pages are also sometimes called _banner_ or _separator_ pages.
ru: Пользователям может быть сложно найти свои документы в стопке страниц, напечатанных на занятом общем принтере. Для решения этой проблемы были созданы _титульные страницы_. Перед каждой задачей печати выводится титульная страница с именем пользователя и названием документа. Эти страницы также иногда называют _баннерами_ или _разделителями_.

source: Enabling header pages differs depending on whether the printer is connected directly to the computer with a `USB`, parallel, or serial cable, or is connected remotely over a network.
ru: Включение титульных страниц различается в зависимости от того, подключен ли принтер напрямую к компьютеру с помощью кабеля `USB`, кабеля параллельного или последовательного порта или удаленно через сеть.

source: Header pages on directly-connected printers are enabled by removing the `:sh:\` (Suppress Header) line from the entry in [.filename]#/etc/printcap#. These header pages only use line feed characters for new lines. Some printers will need the [.filename]#/usr/share/examples/printing/hpif# filter to prevent stairstepped text. The filter configures `PCL` printers to print both carriage returns and line feeds when a line feed is received.
ru: Заголовочные страницы на непосредственно подключенных принтерах включаются путем удаления строки `:sh:\` (Suppress Header) из записи в файле [.filename]#/etc/printcap#. Эти заголовочные страницы используют только символы перевода строки для новых строк. Некоторым принтерам может потребоваться фильтр [.filename]#/usr/share/examples/printing/hpif#, чтобы предотвратить ступенчатый текст. Фильтр настраивает принтеры `PCL` на печать как возврата каретки, так и перевода строки при получении символа перевода строки.

source: Header pages for network printers must be configured on the printer itself. Header page entries in [.filename]#/etc/printcap# are ignored. Settings are usually available from the printer front panel or a configuration web page accessible with a web browser.
ru: Заглавные страницы для сетевых принтеров должны быть настроены на самом принтере. Записи заглавных страниц в [.filename]#/etc/printcap# игнорируются. Настройки обычно доступны через панель управления принтера или веб-интерфейс конфигурации, который можно открыть в браузере.

source: References
ru: Список литературы

source: Example files: [.filename]#/usr/share/examples/printing/#.
ru: Примеры файлов: [.filename]#/usr/share/examples/printing/#.

source: The _4.3BSD Line Printer Spooler Manual_, [.filename]#/usr/share/doc/smm/07.lpd/paper.ascii.gz#.
ru: _Руководство по системе печати 4.3BSD_, [.filename]#/usr/share/doc/smm/07.lpd/paper.ascii.gz#.

source: Manual pages: man:printcap[5], man:lpd[8], man:lpr[1], man:lpc[8], man:lprm[1], man:lpq[1].
ru: Страницы Справочника: man:printcap[5], man:lpd[8], man:lpr[1], man:lpc[8], man:lprm[1], man:lpq[1].

source: Other Printing Systems
ru: Другие системы печати

source: Several other printing systems are available in addition to the built-in man:lpd[8]. These systems offer support for other protocols or additional features.
ru: Несколько других систем печати доступны в дополнение к встроенной man:lpd[8]. Эти системы обеспечивают поддержку других протоколов или дополнительные возможности.

source: CUPS is a popular printing system available on many operating systems. Using CUPS on FreeBSD is documented in a separate article: extref:{cups}[CUPS]
ru: CUPS — это популярная система печати, доступная во многих операционных системах. Использование CUPS в FreeBSD описано в отдельной статье: extref:{cups}[CUPS]

source: Hewlett Packard provides a printing system that supports many of their inkjet and laser printers. The port is package:print/hplip[]. The main web page is at https://developers.hp.com/hp-linux-imaging-and-printing[]. The port handles all the installation details on FreeBSD. Configuration information is shown at https://developers.hp.com/hp-linux-imaging-and-printing/install[].
ru: Компания Hewlett Packard предоставляет систему печати, поддерживающую многие их струйные и лазерные принтеры. Порт находится в package:print/hplip[]. Основная веб-страница расположена по адресу https://developers.hp.com/hp-linux-imaging-and-printing[]. Порт обрабатывает все детали установки в FreeBSD. Информация по настройке доступна на странице https://developers.hp.com/hp-linux-imaging-and-printing/install[].

source: LPRng was developed as an enhanced alternative to man:lpd[8]. The port is package:sysutils/LPRng[]. For details and documentation, see https://lprng.sourceforge.net/[].
ru: LPRng был разработан как улучшенная альтернатива man:lpd[8]. Порт находится в package:sysutils/LPRng[]. Подробности и документацию можно найти на https://lprng.sourceforge.net/[].
