Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/printing/_index.po
Languages: ru

source: This chapter covers the printing system in FreeBSD
ru: Эта глава посвящена системе печати в FreeBSD

source: Part II. Common Tasks
ru: Часть II. Стандартные задачи

source: Chapter 11. Printing
ru: Глава 11. Печать

source: Printing
ru: Печать

source: Putting information on paper is a vital function, despite many attempts to eliminate it. Printing has two basic components. The data must be delivered to the printer, and must be in a form that the printer can understand.
ru: Размещение информации на бумаге — это важная функция, несмотря на многочисленные попытки отказаться от неё. Печать состоит из двух основных компонентов. Данные должны быть переданы на принтер и представлены в форме, которую принтер может обработать.

source: Quick Start
ru: Быстрый старт

source: Basic printing can be set up quickly. The printer must be capable of printing plain `ASCII` text. For printing to other types of files, see crossref:printing[printing-lpd-filters, Filters].
ru: Базовую печать можно быстро настроить. Принтер должен уметь печатать обычный текст `ASCII`. Для печати других типов файлов см. crossref:printing[printing-lpd-filters, Фильтры].

source: Create a directory to store files while they are being printed:
ru: Создайте каталог для хранения файлов во время печати:

source: As `root`, create [.filename]#/etc/printcap# with these contents:
ru: Как `root`, создайте файл [.filename]#/etc/printcap# со следующим содержимым:

source: This line is for a printer connected to a `USB` port.
ru: Эта строка предназначена для принтера, подключенного к порту `USB`.

source: For a printer connected to a parallel or "printer" port, use:
ru: Для принтера, подключённого к параллельному или «принтерному» порту, используйте:

source: For a printer connected directly to a network, use:
ru: Для принтера, подключенного напрямую к сети, используйте:

source: Replace _network-printer-name_ with the `DNS` host name of the network printer.
ru: Замените _network-printer-name_ на `DNS` имя хоста сетевого принтера.

source: Enable LPD by editing [.filename]#/etc/rc.conf#, adding this line:
ru: Включите LPD, отредактировав файл [.filename]#/etc/rc.conf# и добавив следующую строку:

source: Start the service:
ru: Запустите службу:

source: Print a test:
ru: Напечатайте тест:

source: If both lines do not start at the left border, but "stairstep" instead, see crossref:printing[printing-lpd-filters-stairstep, Preventing Stairstepping on Plain Text Printers].
ru: Если обе строки начинаются не с левого края, а с отступом («ступеньками»), см. crossref:printing[printing-lpd-filters-stairstep, Предотвращение образования ступенек на простых текстовых принтерах].

source: Text files can now be printed with `lpr`. Give the filename on the command line, or pipe output directly into `lpr`.
ru: Текстовые файлы теперь можно печатать с помощью `lpr`. Укажите имя файла в командной строке или передайте вывод напрямую в `lpr`.

source: Printer Connections
ru: Подключение принтеров

source: Printers are connected to computer systems in a variety of ways. Small desktop printers are usually connected directly to a computer's `USB` port. Older printers are connected to a parallel or "printer" port. Some printers are directly connected to a network, making it easy for multiple computers to share them. A few printers use a rare serial port connection.
ru: Принтеры подключаются к компьютерным системам различными способами. Небольшие настольные принтеры обычно подключаются непосредственно к `USB`-порту компьютера. Более старые принтеры подключаются к параллельному или «принтерному» порту. Некоторые принтеры подключаются напрямую к сети, что упрощает их совместное использование несколькими компьютерами. Некоторые принтеры используют редкое последовательное соединение через serial-порт.

source: FreeBSD can communicate with all of these types of printers.
ru: FreeBSD может взаимодействовать со всеми типами принтеров.

source: `USB` printers can be connected to any available `USB` port on the computer.
ru: `USB`-принтеры можно подключить к любому свободному `USB`-порту компьютера.

source: When FreeBSD detects a `USB` printer, two device entries are created: [.filename]#/dev/ulpt0# and [.filename]#/dev/unlpt0#. Data sent to either device will be relayed to the printer. After each print job, [.filename]#ulpt0# resets the `USB` port. Resetting the port can cause problems with some printers, so the [.filename]#unlpt0# device is usually used instead. [.filename]#unlpt0# does not reset the USB port at all.
ru: Когда FreeBSD обнаруживает принтер `USB`, создаются два устройства: [.filename]#/dev/ulpt0# и [.filename]#/dev/unlpt0#. Данные, отправленные на любое из этих устройств, будут переданы принтеру. После каждой печати [.filename]#ulpt0# сбрасывает порт `USB`. Сброс порта может вызывать проблемы с некоторыми принтерами, поэтому обычно используется устройство [.filename]#unlpt0#. [.filename]#unlpt0# не сбрасывает порт USB вообще.

source: Parallel (`IEEE`-1284)
ru: Параллельный порт (`IEEE`-1284)

source: The parallel port device is [.filename]#/dev/lpt0#. This device appears whether a printer is attached or not, it is not autodetected.
ru: Параллельный порт устройства это [.filename]#/dev/lpt0#. Это устройство присутствует независимо от того, подключен принтер или нет, оно не определяется автоматически.

source: Vendors have largely moved away from these "legacy" ports, and many computers no longer have them. Adapters can be used to connect a parallel printer to a `USB` port. With such an adapter, the printer can be treated as if it were actually a `USB` printer. Devices called _print servers_ can also be used to connect parallel printers directly to a network.
ru: Производители в основном отказались от этих «устаревших» портов, и многие компьютеры больше их не имеют. Для подключения параллельного принтера к порту `USB` можно использовать переходники. С таким переходником принтер можно использовать так, как если бы он был настоящим `USB`-принтером. Также для прямого подключения параллельных принтеров к сети можно использовать устройства, называемые _серверами печати_.

source: Serial (RS-232)
ru: Последовательный порт (RS-232)

source: Serial ports are another legacy port, rarely used for printers except in certain niche applications. Cables, connectors, and required wiring vary widely.
ru: Последовательные порты — это ещё один устаревший интерфейс, который редко используется для принтеров, за исключением некоторых специализированных применений. Кабели, разъёмы и необходимая распиновка могут сильно различаться.

source: For serial ports built into a motherboard, the serial device name is [.filename]#/dev/cuau0# or [.filename]#/dev/cuau1#. Serial `USB` adapters can also be used, and these will appear as [.filename]#/dev/cuaU0#.
ru: Для последовательных портов, встроенных в материнскую плату, имя последовательного устройства — [.filename]#/dev/cuau0# или [.filename]#/dev/cuau1#. Также можно использовать последовательные адаптеры `USB`, которые будут отображаться как [.filename]#/dev/cuaU0#.

source: Several communication parameters must be known to communicate with a serial printer. The most important are _baud rate_ or `BPS` (Bits Per Second) and _parity_. Values vary, but typical serial printers use a baud rate of 9600 and no parity.
ru: Несколько параметров связи должны быть известны для взаимодействия с последовательным принтером. Наиболее важные из них — это _скорость передачи_ или `BPS` (бит в секунду) и _четность_. Значения могут различаться, но обычно последовательные принтеры используют скорость 9600 и отсутствие проверки на четность.

source: Network
ru: Сеть

source: Network printers are connected directly to the local computer network.
ru: Сетевые принтеры подключаются напрямую к локальной компьютерной сети.

source: The `DNS` hostname of the printer must be known. If the printer is assigned a dynamic address by `DHCP`, `DNS` should be dynamically updated so that the host name always has the correct `IP` address. Network printers are often given static `IP` addresses to avoid this problem.
ru: `DNS` имя хоста принтера должно быть известно. Если принтеру назначается динамический адрес через `DHCP`, `DNS` должен динамически обновляться, чтобы имя хоста всегда соответствовало правильному `IP`-адресу. Сетевые принтеры часто получают статические `IP`-адреса, чтобы избежать этой проблемы.

source: Most network printers understand print jobs sent with the LPD protocol. A print queue name can also be specified. Some printers process data differently depending on which queue is used. For example, a `raw` queue prints the data unchanged, while the `text` queue adds carriage returns to plain text.
ru: Большинство сетевых принтеров понимают задания печати, отправленные по протоколу LPD. Также можно указать имя очереди печати. Некоторые принтеры обрабатывают данные по-разному в зависимости от используемой очереди. Например, очередь `raw` печатает данные без изменений, а очередь `text` добавляет символы возврата каретки к обычному тексту.

source: Many network printers can also print data sent directly to port 9100.
ru: Многие сетевые принтеры также могут печатать данные, отправленные напрямую на порт 9100.

source: Summary
ru: Краткое содержание

source: Wired network connections are usually the easiest to set up and give the fastest printing. For direct connection to the computer, `USB` is preferred for speed and simplicity. Parallel connections work but have limitations on cable length and speed. Serial connections are more difficult to configure. Cable wiring differs between models, and communication parameters like baud rate and parity bits must add to the complexity. Fortunately, serial printers are rare.
ru: Проводные сетевые подключения обычно проще всего настроить и обеспечивают наиболее быструю печать. Для прямого подключения к компьютеру предпочтительнее использовать `USB` из-за скорости и простоты. Параллельные подключения работают, но имеют ограничения по длине кабеля и скорости. Последовательные подключения сложнее настроить. Разводка кабелей различается в зависимости от модели, а параметры связи, такие как скорость передачи данных и биты четности, добавляют сложности. К счастью, последовательные принтеры встречаются редко.

source: Common Page Description Languages
ru: Языки описания страниц

source: Data sent to a printer must be in a language that the printer can understand. These languages are called Page Description Languages, or PDLs.
ru: Данные, отправляемые на принтер, должны быть на языке, который принтер может понять. Эти языки называются языками описания страниц или PDL (Page Description Languages).

source: Plain `ASCII` text is the simplest way to send data to a printer. Characters correspond one to one with what will be printed: an `A` in the data prints an `A` on the page. Very little formatting is available. There is no way to select a font or proportional spacing. The forced simplicity of plain `ASCII` means that text can be printed straight from the computer with little or no encoding or translation. The printed output corresponds directly with what was sent.
ru: Обычный текст `ASCII` — это самый простой способ отправить данные на принтер. Символы соответствуют один к одному тому, что будет напечатано: символ `A` в данных напечатает `A` на странице. Доступно очень мало возможностей форматирования. Нет способа выбрать шрифт или пропорциональные интервалы. Вынужденная простота обычного `ASCII` означает, что текст можно печатать напрямую с компьютера с минимальным или вообще отсутствующим кодированием или преобразованием. Напечатанный вывод напрямую соответствует отправленным данным.

source: Some inexpensive printers cannot print plain `ASCII` text. This makes them more difficult to set up, but it is usually still possible.
ru: Некоторые недорогие принтеры не могут печатать обычный текст `ASCII`. Это усложняет их настройку, но обычно это всё равно возможно.

source: PostScript(R) is almost the opposite of `ASCII`. Rather than simple text, a PostScript(R) program is a set of instructions that draw the final document. Different fonts and graphics can be used. However, this power comes at a price. The program that draws the page must be written. Usually this program is generated by application software, so the process is invisible to the user.
ru: PostScript(R) почти противоположен `ASCII`. Вместо простого текста программа PostScript(R) представляет собой набор инструкций, которые рисуют итоговый документ. Можно использовать различные шрифты и графику. Однако за эту мощь приходится платить. Необходимо написать программу, которая рисует страницу. Обычно эта программа генерируется прикладным программным обеспечением, поэтому процесс остается невидимым для пользователя.

source: Inexpensive printers sometimes leave out PostScript(R) compatibility as a cost-saving measure.
ru: Недорогие принтеры иногда не поддерживают совместимость с PostScript(R) в целях экономии.

source: `PCL` is an extension of `ASCII`, adding escape sequences for formatting, font selection, and printing graphics. Many printers provide `PCL5` support. Some support the newer `PCL6` or `PCLXL`. These later versions are supersets of `PCL5` and can provide faster printing.
ru: `PCL` является расширением `ASCII`, добавляющим escape-последовательности для форматирования, выбора шрифтов и печати графики. Многие принтеры поддерживают `PCL5`. Некоторые поддерживают более новые версии `PCL6` или `PCLXL`. Эти более поздние версии являются надмножествами `PCL5` и могут обеспечивать более быструю печать.

source: Host-Based
ru: Принтер на основе хоста

source: Manufacturers can reduce the cost of a printer by giving it a simple processor and very little memory. These printers are not capable of printing plain text. Instead, bitmaps of text and graphics are drawn by a driver on the host computer and then sent to the printer. These are called _host-based_ printers.
ru: Производители могут снизить стоимость принтера, используя простой процессор и минимум памяти. Такие принтеры не способны печатать обычный текст. Вместо этого растровые изображения текста и графики создаются драйвером на главном компьютере и затем отправляются на принтер. Такие принтеры называются _host-based_ (управляемыми хостом).

source: Communication between the driver and a host-based printer is often through proprietary or undocumented protocols, making them functional only on the most common operating systems.
ru: Взаимодействие между драйвером и принтером, подключенным к хосту, часто осуществляется по проприетарным или недокументированным протоколам, что делает их работоспособными только в наиболее распространённых операционных системах.

source: Converting PostScript(R) to Other PDLs
ru: Преобразование PostScript(R) в другие PDL

source: Many applications from the Ports Collection and FreeBSD utilities produce PostScript(R) output. This table shows the utilities available to convert that into other common PDLs:
ru: Многие приложения из Коллекции портов и утилиты FreeBSD создают вывод в формате PostScript(R). В следующей таблице представлены утилиты для преобразования этого формата в другие распространённые PDL:

source: Output PDLs
ru: Языки PDL на выходе

source: Output PDL
ru: PDL на выходе

source: Generated By
ru: Чем создается

source: Notes
ru: Заметки

source: `PCL` or `PCL5`
ru: `PCL` или `PCL5`

source: `-sDEVICE=ljet4` for monochrome, `-sDEVICE=cljet5` for color
ru: `-sDEVICE=ljet4` для монохромной печати, `-sDEVICE=cljet5` для цветной

source: `PCLXL` or `PCL6`
ru: `PCLXL` или `PCL6`

source: `-sDEVICE=pxlmono` for monochrome, `-sDEVICE=pxlcolor` for color
ru: `-sDEVICE=pxlmono` для монохромного режима, `-sDEVICE=pxlcolor` для цветного

source: For the easiest printing, choose a printer that supports PostScript(R). Printers that support `PCL` are the next preferred. With package:print/ghostscript9-base[], these printers can be used as if they understood PostScript(R) natively. Printers that support PostScript(R) or `PCL` directly almost always support direct printing of plain `ASCII` text files also.
ru: Для наиболее простой печати выберите принтер с поддержкой PostScript(R). Принтеры, поддерживающие `PCL`, являются следующим предпочтительным вариантом. С помощью package:print/ghostscript9-base[] эти принтеры можно использовать так, как если бы они изначально понимали PostScript(R). Принтеры, которые напрямую поддерживают PostScript(R) или `PCL`, почти всегда также поддерживают прямую печать обычных текстовых файлов в формате `ASCII`.

source: Line-based printers like typical inkjets usually do not support PostScript(R) or `PCL`. They often can print plain `ASCII` text files. package:print/ghostscript9-base[] supports the PDLs used by some of these printers. However, printing an entire graphic-based page on these printers is often very slow due to the large amount of data to be transferred and printed.
ru: Строковые принтеры, такие как обычные струйные, обычно не поддерживают PostScript(R) или `PCL`. Они часто могут печатать простые текстовые файлы в формате `ASCII`. Пакет package:print/ghostscript9-base[] поддерживает языки описания страниц (PDL), используемые некоторыми из этих принтеров. Однако печать всей графической страницы на таких принтерах часто происходит очень медленно из-за большого объема передаваемых и печатаемых данных.

source: Host-based printers are often more difficult to set up. Some cannot be used at all because of proprietary PDLs. Avoid these printers when possible. The particular `PDL` used by various models of printers can be found at http://www.openprinting.org/printers[].
ru: Настроить принтеры, управляемые хостом, часто сложнее. Некоторые из них вообще нельзя использовать из-за проприетарных языков описания страниц (PDL). По возможности избегайте таких принтеров. Информацию о конкретных `PDL`, используемых различными моделями принтеров, можно найти на сайте http://www.openprinting.org/printers[].

source: Direct Printing
ru: Прямая печать

source: For occasional printing, files can be sent directly to a printer device without any setup. For example, a file called [.filename]#sample.txt# can be sent to a `USB` printer:
ru: Для периодической печати файлы можно отправлять непосредственно на устройство принтера без дополнительной настройки. Например, файл с именем [.filename]#sample.txt# можно отправить на принтер с интерфейсом `USB`:

source: Direct printing to network printers depends on the abilities of the printer, but most accept print jobs on port 9100, and man:nc[1] can be used with them. To print the same file to a printer with the `DNS` hostname of _netlaser_:
ru: Прямая печать на сетевые принтеры зависит от возможностей принтера, но большинство из них принимают задания на печать через порт 9100, и для этого можно использовать man:nc[1]. Чтобы напечатать тот же файл на принтере с `DNS`-именем хоста _netlaser_:

source: LPD (Line Printer Daemon)
ru: LPD (демон линейного принтера)

source: Printing a file in the background is called _spooling_. A spooler allows the user to continue with other programs on the computer without waiting for the printer to slowly complete the print job.
ru: Печать файла в фоновом режиме называется спулингом. Спулер позволяет пользователю продолжать работу с другими программами на компьютере, не ожидая завершения медленного процесса печати.

source: FreeBSD includes a spooler called man:lpd[8]. Print jobs are submitted with man:lpr[1].
ru: FreeBSD включает спулер под названием man:lpd[8]. Задания на печать отправляются с помощью man:lpr[1].

source: Initial Setup
ru: Начальная настройка

source: A directory for storing print jobs is created, ownership is set, and the permissions are set to prevent other users from viewing the contents of those files:
ru: Создается каталог для хранения заданий печати, устанавливается владелец, а права доступа настраиваются так, чтобы другие пользователи не могли просматривать содержимое этих файлов:

source: Printers are defined in [.filename]#/etc/printcap#. An entry for each printer includes details like a name, the port where it is attached, and various other settings. Create [.filename]#/etc/printcap# with these contents:
ru: Принтеры определяются в файле [.filename]#/etc/printcap#. Запись для каждого принтера включает такие данные, как имя, порт, к которому он подключен, и различные другие параметры. Создайте файл [.filename]#/etc/printcap# со следующим содержимым:

source: The name of this printer. man:lpr[1] sends print jobs to the `lp` printer unless another printer is specified with `-P`, so the default printer should be named `lp`.
ru: Имя этого принтера. man:lpr[1] отправляет задания на печать на принтер `lp`, если другой принтер не указан с помощью `-P`, поэтому принтер по умолчанию должен называться `lp`.

source: The device where the printer is connected. Replace this line with the appropriate one for the connection type shown here.
ru: Устройство, к которому подключен принтер. Замените эту строку на соответствующую для типа подключения, указанного здесь.

source: Suppress the printing of a header page at the start of a print job.
ru: Подавить вывод титульной страницы в начале задания печати.

source: Do not limit the maximum size of a print job.
ru: Не ограничивать максимальный размер задания на печать.

source: The path to the spooling directory for this printer. Each printer uses its own spooling directory.
ru: Путь к каталогу спулинга для этого принтера. Каждый принтер использует свой собственный каталог спулинга.

source: The log file where errors on this printer will be reported.
ru: Файл журнала, в который будут записываться ошибки для этого принтера.

source: After creating [.filename]#/etc/printcap#, use man:chkprintcap[8] to test it for errors:
ru: После создания [.filename]#/etc/printcap# используйте man:chkprintcap[8] для проверки на ошибки:

source: Fix any reported problems before continuing.
ru: Исправьте все выявленные проблемы перед продолжением.

source: Enable man:lpd[8] in [.filename]#/etc/rc.conf#:
ru: Включите man:lpd[8] в [.filename]#/etc/rc.conf#:

source: Printing with man:lpr[1]
ru: Печать с помощью man:lpr[1]

source: Documents are sent to the printer with `lpr`. A file to be printed can be named on the command line or piped into `lpr`. These two commands are equivalent, sending the contents of [.filename]#doc.txt# to the default printer:
ru: Документы отправляются на печать с помощью `lpr`. Файл для печати может быть указан в командной строке или передан в `lpr` через конвейер. Эти две команды эквивалентны и отправляют содержимое файла [.filename]#doc.txt# на принтер по умолчанию:

source: Printers can be selected with `-P`. To print to a printer called _laser_:
ru: Принтеры можно выбрать с помощью `-P`. Для печати на принтере с именем _laser_:

source: Filters
ru: Фильтры

source: The examples shown so far have sent the contents of a text file directly to the printer. As long as the printer understands the content of those files, output will be printed correctly.
ru: Примеры, показанные до этого, отправляли содержимое текстового файла напрямую на принтер. Пока принтер понимает содержимое этих файлов, вывод будет печататься корректно.

source: Some printers are not capable of printing plain text, and the input file might not even be plain text.
ru: Некоторые принтеры не способны печатать обычный текст, а входной файл может даже не быть текстовым.
