Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-status-report-process/_index.po
Languages: es, pt_br, ru

source: Instructions for both writers and editors of status reports
es: Instrucciones tanto para autores como editores de los informes de estado
pt_br: Instruções para escritores e editores dos relatórios de status
ru: Инструкции для авторов и редакторов отчетов о состоянии

source: FreeBSD Status Report Process
es: Proceso de Informe de Estado de FreeBSD
pt_br: Processo de Relatório de Status do FreeBSD
ru: Процесс составления отчёта о состоянии FreeBSD

source: FreeBSD status reports are published quarterly and provide the general public with a view of what is going on in the Project, and they are often augmented by special reports from Developer Summits. As they are one of our most visible forms of communication, they are very important.
es: Los informes de estado de FreeBSD se publican trimestralmente y proporcionan al público general una visión de lo que está sucediendo en el Proyecto, y normalmente se amplían con informes especiales de las Cumbres de Desarrolladores. Como son una de nuestras formas de comunicación más visibles, son muy importantes.
pt_br: Os relatórios de status do FreeBSD são publicados trimestralmente e fornecem ao público em geral uma visão do que está acontecendo no projeto, muitas vezes complementados por relatórios especiais de reuniões de desenvolvedores. Como eles são uma das nossas formas mais visíveis de comunicação, são muito importantes.
ru: Отчеты о состоянии FreeBSD публикуются ежеквартально и предоставляют широкой общественности обзор происходящего в проекте. Они часто дополняются специальными отчетами с встреч разработчиков. Поскольку это одна из самых заметных форм коммуникации, они очень важны.

source: Throughout this document and in other places related to FreeBSD status reports as well, the expression _status report_ is used both to indicate the document published on a quarterly basis and the single entries that are in it.
es: A lo largo de este documento y en otros lugares relacionados con los informes de estado de FreeBSD también, la expresión _informe de estado_ se usa tanto para indicar el documento publicado de forma trimestral como las entradas individuales que hay en él.
pt_br: Em todo este documento e em outros lugares relacionados aos relatórios de status do FreeBSD, a expressão "relatório de status" é usada tanto para indicar o documento publicado trimestralmente quanto as entradas individuais que estão nele.
ru: На протяжении этого документа, а также в других материалах, связанных с отчётами о состоянии FreeBSD, выражение _отчёт о состоянии_ используется как для обозначения документа, публикуемого ежеквартально, так и для отдельных записей, содержащихся в нём.

source: Instructions for writers
es: Instrucciones para los autores
pt_br: Instruções para escritores
ru: Инструкции для авторов

source: This section provides some advice on writing status report entries from mailto:theraven@FreeBSD.org[David Chisnall], experienced in technical writing. Instructions on how to submit your entries are also given.
es: Esta sección proporciona algún consejo para escribir entradas de informes de estado de parte de mailto:theraven@FreeBSD.org[David Chisnall], quien tiene mucha experiencia en escritura técnica. También se dan instrucciones sobre cómo enviar tus entradas.
pt_br: Esta seção fornece alguns conselhos sobre como escrever entradas para os relatórios de status do FreeBSD, do mailto:theraven@FreeBSD.org[David Chisnall], experiente em redação técnica. Instruções sobre como enviar suas entradas também são fornecidas.

source: _Do not worry if you are not a native English speaker. The mailto:status@FreeBSD.org[status team] will check your entries for spelling and grammar, and fix it for you._
es: _No te preocupes si no eres anglo parlante. El mailto:status@FreeBSD.org[status team] comprobará tus entradas desde el punto de vista de la ortografía y la gramática, y lo arreglará por ti._
pt_br: _Não se preocupe se você não é um falante nativo de inglês. A equipe de status (mailto:status@FreeBSD.org) verificará suas entradas quanto à ortografia e gramática e as corrigirá para você._
ru: _Не беспокойтесь, если вы не являетесь носителем английского языка. Команда mailto:status@FreeBSD.org[status team] проверит ваши записи на орфографию и грамматику и исправит их за вас._

source: Introduce Your Work
es: Presenta Tu Trabajo
pt_br: Introduza o seu trabalho
ru: Представьте свою работу

source: _Do not assume that the person reading the report knows about your project._
es: _No asumas que la persona que lee el informe sabe acerca de tu proyecto._
pt_br: _Não assuma que a pessoa que lerá o relatório conhece o seu projeto._
ru: _Не предполагайте, что человек, читающий отчёт, знает о вашем проекте._

source: The status reports have a wide distribution. They are often one of the top news items on the FreeBSD web site and are one of the first things that people will read if they want to know a bit about what FreeBSD is. Consider this example:
es: Los informes de estado se distribuyen ampliamente. Están habitualmente en lo alto de la lista de noticias en el sitio web de FreeBSD y son una de las primeras cosas que la gente leerá si quieren conocer lo que es FreeBSD. Considera este ejemplo:
pt_br: Os relatórios de status possuem uma ampla distribuição. Eles são frequentemente um dos principais itens de notícias no site do FreeBSD e são uma das primeiras coisas que as pessoas vão ler se quiserem saber um pouco sobre o que é o FreeBSD. Considere este exemplo:
ru: Отчеты о состоянии имеют широкое распространение. Они часто становятся одними из главных новостей на веб-сайте FreeBSD и являются одним из первых материалов, которые прочитают люди, желающие узнать немного о том, что такое FreeBSD. Рассмотрим следующий пример:

source: abc(4) support was added, including frobnicator compatibility.
es: Se ha añadido soporte para abc(4), incluyendo compatibilidad con frobnicator.
pt_br: O suporte ao abc(4) foi adicionado, incluindo a compatibilidade com o frobnicator.

source: Someone reading this, if they are familiar with UNIX man pages, will know that `abc(4)` is some kind of device. But why should the reader care? What kind of device is it? Compare with this version:
es: Alguien que lea esto, si está familiarizado con las páginas de manual de UNIX, sabrá que `acb(4)` es algún tipo de dispositivo. ¿Pero por qué le debería importar al lector?¿Qué tipo de dispositivo es? Compara con esta versión:
pt_br: Alguém que esteja lendo isso, se estiver familiarizado com as páginas do manual UNIX, saberá que `abc(4)` é algum tipo de dispositivo. Mas por que o leitor deveria se importar? Que tipo de dispositivo é esse? Compare com esta versão:
ru: Читающий это, если он знаком с руководствами UNIX, поймет, что `abc(4)` — это какое-то устройство. Но почему это должно волновать читателя? Что это за устройство? Сравните с этой версией:

source: A new driver, abc(4), was added to the tree, bringing support for Yoyodyne's range of Frobnicator network interfaces.
es: Se ha añadido un driver nuevo, abc(4), al árbol de fuentes que proporciona soporte para el rango Frobnicator de interfaces de red de Yoyodyne.
pt_br: Foi adicionado um novo driver, abc(4), na árvore, oferecendo suporte às interfaces de rede Frobnicator da linha Yoyodyne.

source: Now the reader knows that abc is a network interface driver. Even if they do not use any Yoyodyne products, you have communicated that FreeBSD's support for network devices is improving.
es: Ahora el lector sabe que abc es un controlador de un interfaz de red. Incluso si no usa ninguno de los productos de Yoyodyne, has comunicado que el soporte en FreeBSD para los dispositivos de red está mejorando.
pt_br: Agora o leitor sabe que abc é um driver de interface de rede. Mesmo que eles não usem nenhum produto Yoyodyne, você comunicou que o suporte do FreeBSD para dispositivos de rede está melhorando.

source: Show the Importance of Your Work
es: Muestra la Importancia de Tu Trabajo
pt_br: Mostre a importância do seu trabalho
ru: Покажите важность вашей работы

source: _Status reports are not just about telling everyone that things were done, they also need to explain why they were done._
es: _Los informes de estado no son sólo para decirle a todo el mundo que se están haciendo cosas, también necesitan explicar por qué se están haciendo._
pt_br: _Os relatórios de status não são apenas para informar a todos que coisas foram feitas, eles também precisam explicar por que elas foram feitas._
ru: _Отчеты о состоянии нужны не только для того, чтобы сообщать всем о выполненных задачах, но и для объяснения причин их выполнения._

source: Carry on with the previous example. Why is it interesting that we now support Yoyodyne Frobnicator cards? Are they widespread? Are they used in a specific popular device? Are they used in a particular niche where FreeBSD has (or would like to have) a presence? Are they the fastest network cards on the planet? Status reports often say things like this:
es: Continuemos con el ejemplo anterior. ¿Por qué es interesante que ahora soportemos las tarjetas Frobnicator de Yoyodyne? ¿Son habituales? ¿Se usan en algún dispositivo popular? ¿Se usan en un nicho de mercado particular donde FreeBSD tiene (o le gustaría tener) presencia? ¿Son las tarjetas más rápidas del planeta? Los informes de error habitualmente incluyen cosas como estas:
pt_br: Continuando com o exemplo anterior. Por que é interessante que agora suportemos os cartões Yoyodyne Frobnicator? Eles são amplamente utilizados? São usados em um dispositivo popular específico? Eles são usados em uma área específica em que o FreeBSD tem (ou gostaria de ter) presença? Eles são os cartões de rede mais rápidos do planeta? Os relatórios de status frequentemente dizem coisas como essas:
ru: Продолжим предыдущий пример. Почему интересно, что мы теперь поддерживаем карты Yoyodyne Frobnicator? Они широко распространены? Они используются в каком-то конкретном популярном устройстве? Они применяются в определенной нише, где FreeBSD имеет (или хотела бы иметь) присутствие? Это самые быстрые сетевые карты на планете? В отчетах о состоянии часто встречаются такие фразы:

source: We imported Cyberdyne Systems T800 into the tree.
es: Importamos Cyberdyne Systems T800 en el árbol.
pt_br: Nós importamos o Cyberdyne Systems T800 para a árvore.

source: And then they stop. Maybe the reader is an avid Cyberdyne fan and knows what exciting new features the T800 brings. This is unlikely. It is far more likely that they have vaguely heard of whatever you have imported (especially into the ports tree: remember that there are over 35,000 other things there too...). List some of the new features, or bug fixes. Tell them why it is a good thing that we have the new version.
pt_br: E então eles param. Talvez o leitor seja um ávido fã da Cyberdyne e saiba quais novos recursos emocionantes o T800 traz. Isso é improvável. É muito mais provável que eles tenham ouvido vagamente sobre o que você importou (especialmente na árvore de ports: lembre-se de que existem mais de 35.000 outras coisas lá também...). Liste alguns dos novos recursos ou correções de bugs. Diga-lhes por que é uma boa coisa que tenhamos a nova versão.
ru: И затем они останавливаются. Возможно, читатель — ярый поклонник Cyberdyne и знает, какие захватывающие новые функции предлагает T800. Это маловероятно. Гораздо вероятнее, что они смутно слышали о том, что вы импортировали (особенно в дерево портов: помните, что там есть ещё более 35 000 других элементов...). Перечислите некоторые новые функции или исправления ошибок. Объясните, почему хорошо, что у нас появилась новая версия.

source: Tell Us Something New
es: Dinos Algo Nuevo
pt_br: Conte-nos Algo Novo
ru: Расскажите нам что-то новое

source: _Do not recycle the same status report items._
es: _No recicles los mismos elementos del informe de estado._
pt_br: _Não recicle os mesmos itens do relatório de status._
ru: _Не используйте повторно одни и те же пункты отчёта о состоянии._

source: Bear in mind that status reports are not just reports on the status of the project, they are reports on the change of status of the project. If there is an ongoing project, spend a couple of sentences introducing it, but then spend the rest of the report talking about the new work. What progress has been made since the last report? What is left to do? When is it likely to be finished (or, if "finished" does not really apply, when is it likely to be ready for wider use, for testing, for deployment in production, and so on)?
es: Ten en cuenta que los informes de estado no son sólo informes de estado del proyecto, son informes sobre el cambio de estado del proyecto. Si hay un proyecto en curso, utiliza un par de frases para presentarlo, pero utiliza el resto del informe hablando acerca del trabajo nuevo ¿Qué progresos se han hecho desde el último informe? ¿Qué queda por hacer? ¿Cuándo es probable que termine (o, si "terminado" no se puede aplicar, cuando está previsto que esté listo para un uso más amplio, para pruebas, para desplegarlo en producción, etc)?
pt_br: Tenha em mente que os relatórios de status não são apenas relatórios sobre o status do projeto, são relatórios sobre a mudança de status do projeto. Se houver um projeto em andamento, gaste algumas frases apresentando-o, mas depois gaste o restante do relatório falando sobre o novo trabalho. Qual progresso foi feito desde o último relatório? O que ainda falta ser feito? Quando é provável que esteja concluído (ou, se "concluído" não se aplica realmente, quando é provável que esteja pronto para uso mais amplo, para testes, para implementação em produção e assim por diante)?
ru: Имейте в виду, что отчеты о состоянии — это не просто отчеты о состоянии проекта, это отчеты об изменении состояния проекта. Если проект продолжается, уделите пару предложений его представлению, но затем сосредоточьтесь в отчете на новой работе. Какой прогресс был достигнут с момента последнего отчета? Что осталось сделать? Когда он, вероятно, будет завершен (или, если "завершение" не совсем применимо, когда он будет готов для более широкого использования, тестирования, развертывания в производстве и так далее)?

source: Sponsorship
es: Patrocinio
pt_br: Patrocínio
ru: Спонсорство

source: _Do not forget about your sponsors._
es: _No te olvides de tus patrocinadores._
pt_br: _Não se esqueça dos seus patrocinadores._
ru: _Не забывайте о ваших спонсорах._

source: If you or your project has received sponsorship, a scholarship from somebody or you have been already working as a contractor or an employee for a company, please include it. Sponsors always certainly appreciate if you thank them for their funding, but it is also beneficial for them to show that they are actively supporting the Project this way. Last, but not least, this helps FreeBSD to learn more about its important consumers.
es: Si tú o tu proyecto habéis recibido patrocinio, una beca de alguien o habéis trabajado como consultor externo o empleado para una empresa, por favor inclúyelo. Los patrocinadores siempre aprecian que les agradezcas su inversión, pero también es beneficioso para ellos mostrar que están activos apoyando el Proyecto de esta forma. Por último, pero no por ello menos importante, esto ayuda a FreeBSD a aprender más acerca de sus consumidores importantes.
pt_br: Se você ou seu projeto receberam patrocínio ou bolsa de estudo de alguém ou você já estava trabalhando como contratado ou funcionário de uma empresa, por favor inclua essa informação. Patrocinadores sempre apreciam quando são agradecidos pelo seu financiamento, mas também é benéfico para eles mostrarem que estão apoiando ativamente o Projeto dessa maneira. Por último, mas não menos importante, isso ajuda o FreeBSD a aprender mais sobre seus importantes consumidores.
ru: Если вы или ваш проект получили спонсорскую поддержку, стипендию от кого-либо или вы уже работали подрядчиком или сотрудником компании, пожалуйста, укажите это. Спонсоры всегда ценят, когда их благодарят за финансирование, но также им выгодно показать, что они активно поддерживают Проект таким образом. И последнее, но не менее важное: это помогает FreeBSD узнать больше о своих важных потребителях.

source: Open Items
es: Elementos Abiertos
pt_br: Tarefas Pendentes
ru: Открытые вопросы

source: _If help is needed, make this explicit!_
es: _Si se necesita ayuda, ¡hazlo explícito!_
pt_br: _Se você precisa de ajuda, deixe isso explícito!_
ru: _Если требуется помощь, укажите это явно!_

source: Is there any help needed with something? Are there tasks other people can do? There are two ways in which you can use the open items part of the status report: to solicit help, or to give a quick overview of the amount of work left. If there are already enough people working on the project, or it is in a state where adding more people would not speed it up, then the latter is better. Give some big work items that are in progress, and maybe indicate who is focussing on each one.
es: ¿Se necesita ayuda con algo? ¿Hay tareas que pueda hacer otra gente? Hay dos formas en la que puedes usar la parte de elementos abiertos del informe de estado: para solicitar ayuda, o para ofrecer un resumen rápido de la cantidad de trabajo pendiente. Si ya hay suficiente gente trabajando en el proyecto, o si está en un estado en el que añadir más gente no va a hacer que vaya más rápido, entonces esta segunda opción es mejor. Da algunos elementos grandes que están en progreso, y quizás indica quién se está enfocando en cada uno.
pt_br: Precisa de ajuda com algo? Existem tarefas que outras pessoas podem fazer? Existem duas maneiras de usar a parte de tarefas pendentes do relatório de status: para solicitar ajuda ou para dar uma visão geral rápida da quantidade de trabalho restante. Se já houver pessoas suficientes trabalhando no projeto, ou se ele estiver em um estado em que adicionar mais pessoas não aceleraria o processo, então é melhor usar a segunda opção. Fale sobre algumas das grandes tarefas em andamento e talvez indique quem está focado em cada uma delas.
ru: Нужна ли помощь с чем-то? Есть ли задачи, которые могут выполнить другие люди? Существует два способа использования раздела открытых пунктов в отчете о состоянии: для запроса помощи или для быстрого обзора объема оставшейся работы. Если над проектом уже работает достаточное количество людей или он находится в таком состоянии, что добавление новых участников не ускорит его, то лучше использовать второй вариант. Укажите крупные рабочие задачи, которые находятся в процессе выполнения, и, возможно, обозначьте, кто над каждой из них работает.

source: List tasks, with enough detail that people know if they are likely to be able to do them, and invite people to get in contact.
es: Lista tareas, con suficiente detalle como para que la gente sepa si son capaces de hacerlas, e invita a que la gente entre en contacto.
pt_br: Enumere as tarefas, com detalhes suficientes para que as pessoas saibam se são capazes de realizá-las, e convide-as a entrar em contato.
ru: Перечислите задачи с достаточной детализацией, чтобы люди могли понять, смогут ли они их выполнить, и предложите им связаться с вами.

source: Submit your report
es: Envía tu informe
pt_br: Envie seu relatório
ru: Представьте ваш отчёт

source: The following methods are available to submit your reports:
es: Los siguientes métodos están disponibles para enviar tus informes:
pt_br: Os seguintes métodos estão disponíveis para você enviar os seus relatórios:
ru: Доступны следующие методы для отправки ваших отчетов:

source: submit a link:https://reviews.freebsd.org/[Phabricator review] and add the group _status_ to the reviewers list. You should put your reports in the appropriate subdirectory of `doc/website/content/en/status/` (create it if it is missing);
es: envía una link:https://reviews.freebsd.org/[revisión en Phabricator] y añade al grupo _status_ a la lista de revisores. Deberías poner tus informes en el subdirectorio apropiado de `doc/website/content/en/status/` (créalo si no existe);
pt_br: enviar um link:https://reviews.freebsd.org/[review no Phabricator] e adicionar o grupo _status_ à lista de revisores. Você deve colocar seus relatórios no subdiretório apropriado do `doc/website/content/en/status/` (crie-o se ele não existir);
ru: отправить ссылку link:https://reviews.freebsd.org/[Phabricator review] и добавить группу _status_ в список рецензентов. Вы должны разместить свои отчёты в соответствующем подкаталоге `doc/website/content/en/status/` (создайте его, если он отсутствует);

source: submit a pull request to the doc repository through link:https://github.com/freebsd/freebsd-doc[its GitHub mirror] . You should put your reports in the appropriate subdirectory of `doc/website/content/en/status` (create it if it is missing);
es: envía una pull request al repositorio doc mediante link:https://github.com/freebsd/freebsd-doc[su réplica en GitHub]. Deberías poner tus informes en el subdirectorio apropiado de `doc/website/content/en/status` (créalo si no existe);
pt_br: enviar uma solicitação de pull request para o repositório doc através do link:https://github.com/freebsd/freebsd-doc [seu espelho GitHub]. Você deve colocar seus relatórios no subdiretório apropriado de `doc/website/content/en/status` (crie-o se ele não existir);
ru: отправить запрос на включение изменений (pull request) в репозиторий документации через link:https://github.com/freebsd/freebsd-doc[его зеркало на GitHub]. Вы должны размещать свои отчёты в соответствующем подкаталоге `doc/website/content/en/status` (создайте его, если он отсутствует);

source: send an email to status-submissions@FreeBSD.org including your report.
es: envía un email a status-submissions@FreeBSD.org adjuntando tu informe.
pt_br: enviar um e-mail para status-submissions@FreeBSD.org incluindo o seu relatório.
ru: отправить письмо на адрес status-submissions@FreeBSD.org, приложив ваш отчет.

source: An link:https://www.FreeBSD.org/status/report-sample.adoc[AsciiDoc sample report template] is available.
es: Está disponible link:https://www.FreeBSD.org/status/report-sample.adoc[una plantilla de ejemplo en formato Asciidoc].
pt_br: Um modelo de relatório em AsciiDoc link:https://www.FreeBSD.org/status/report-sample.adoc[está disponível aqui].
ru: Доступен link:https://www.FreeBSD.org/status/report-sample.adoc[шаблон отчёта в формате AsciiDoc].

source: Instructions for editors
es: Instrucciones para los editores
pt_br: Instruções para editores
ru: Инструкции для редакторов

source: This section describes how the reviewing and publication process works.
es: Esta sección describe cómo funcionan los procesos de revisión y publicación.
pt_br: Esta seção descreve como funciona o processo de revisão e publicação.
ru: Этот раздел описывает, как работает процесс проверки и публикации.

source: Status reports main webpage
es: Página web principal de los informes de estado
pt_br: Página principal dos relatórios de status
ru: Главная веб-страница отчетов о статусе

source: Status reports archived GitHub repository (was used for reports from 2017Q4 to 2022Q4):
es: Informes de estado archivados en el repositorio de GitHub (se usó para los informes desde 2017Q4 hasta 2022Q4):
pt_br: Repositório arquivado do GitHub de relatórios de status (foi usado para os relatórios do 4º trimestre de 2017 até o 4º trimestre de 2022):
ru: Отчеты о статусе архивированного репозитория GitHub (использовались для отчетов с 2017Q4 по 2022Q4):

source: Main status team email address
es: Direcciones de email principales del equipo _status_
pt_br: Endereço de email principal da equipe de status
ru: Основной адрес электронной почты команды статуса
