Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-status-report-process/_index.po
Languages: es, pt_br, ru

source: Email address for reports submission
es: Dirección de email para el envío de informes
pt_br: Endereço de e-mail para envio de relatórios
ru: Адрес электронной почты для отправки отчетов

source: Mailing list for receiving calls for status reports
es: Lista de correo para recibir avisos de informes de estado
pt_br: Lista de discussão para receber chamados para os relatórios de status
ru: Список рассылки для получения запросов на отчеты о состоянии

source: Phabricator status team main page
es: Página de Phabricator del equipo _status_
pt_br: Página principal da equipe de status no Phabricator
ru: Страница команды статуса в Phabricator

source: Timeline
es: Planificación
pt_br: Linha do tempo
ru: Сроки

source: Reports are always accepted by the status team, but the main collection process happens the last month of each quarter, hence in March, June, September and December. Explicit calls for status reports will be sent in those months. The months of January, April, July and October are dedicated to putting together the reports submitted during the precedent quarter; this can include waiting for late submissions. Status reports publication is done during the same months as soon as the report are ready.
es: Los informes siempre son aceptado por el _status team_, pero el proceso de recolección principal sucede en el último mes de cada trimestre, esto es en Marzo, Junio, Septiembre y Diciembre. Se enviarán llamadas para los informes de estado en esos meses. Los meses de Enero, Abril, Julio y Octubre se dedican a organizar los informes enviados durante el trimestre anterior; esto puede incluir esperar por envíos tardíos. La publicación de los informes de estado se realiza durante los mismos meses en cuanto el informe está listo.
pt_br: Os relatórios são sempre aceitos pela equipe de status, mas o principal processo de coleta ocorre no último mês de cada trimestre, ou seja, em março, junho, setembro e dezembro. Chamadas explícitas para relatórios de status serão enviadas nesses meses. Os meses de janeiro, abril, julho e outubro são dedicados a reunir os relatórios enviados durante o trimestre anterior; isso pode incluir aguardar por envios tardios. A publicação dos relatórios de status é feita durante os mesmos meses assim que os relatórios estiverem prontos.
ru: Отчеты всегда принимаются командой статуса, но основной процесс сбора происходит в последний месяц каждого квартала, то есть в марте, июне, сентябре и декабре. В эти месяцы будут отправляться явные запросы на статусные отчеты. Месяцы январь, апрель, июль и октябрь посвящены сбору отчетов, представленных в предыдущем квартале; это может включать ожидание запоздавших отправлений. Публикация статусных отчетов происходит в те же месяцы, как только отчеты будут готовы.

source: All report submissions can have the deadline extended by link:mailto:status-submissions@FreeBSD.org[emailing the status team] up until the extended deadline, which is 8 days after the end of the quarter. Entries from the link:https://www.freebsd.org/administration/#t-portmgr[ports management team] default to the extended headline, because of the overlap between status reports and quarterly ports branches.
es: Todos los envíos de informes pueden extender su fecha límite link:mailto:status-submissions@FreeBSD.org[enviando un email al _status team_] hasta la fecha extendida, que es 8 días después del final del trimestre. Las entradas del link:https://www.freebsd.org/administration/#t-portmgr[equipo de gestión de ports] tienen por defecto la fecha de entrega extendida, porque los informes de estado se solapan con las ramas trimestrales de los ports.
pt_br: Todas as submissões de relatórios podem ter o prazo estendido link:mailto:status-submissions@FreeBSD.org[enviando um email para a equipe de status] até o prazo estendido, que é de 8 dias após o final do trimestre. As entradas da link:https://www.freebsd.org/administration/#t-portmgr[equipe de gerenciamento do ports] por padrão utilizam o prazo estendido, devido à sobreposição entre os relatórios de status e os branchs trimestrais do ports.
ru: Все отправленные отчёты могут быть продлены по ссылке link:mailto:status-submissions@FreeBSD.org[электронной почте команды статуса] вплоть до продлённого срока, который составляет 8 дней после окончания квартала. Записи от link:https://www.freebsd.org/administration/#t-portmgr[команды управления портами] по умолчанию используют продлённый заголовок из-за пересечения отчётов о статусе и квартальных веток портов.

source: Reviewing of submitted reports by people not part of the status team should be essentially complete by mid-January/April/July/October (third-party review slush). That is, barring typos or other light copyediting, the status team should be able to start assembling the submissions soon after the 15th. Note that this is not a complete freeze, and the status team may still be able to accept reviews then.
es: La revisión de los informes enviados por parte de gente que no es parte del _status team_ debería estar completada a mediados de Enero/Abril/Julio/Octubre (congelación de la revisión de terceros). Es decir, con excepción de faltas ortográficas u otro tipo de edición sencilla, el _status team_ debería empezar a ensamblar los envíos poco después del día 15. Fíjate en que no es un congelación completa, y el _status team_ todavía podría aceptar revisiones por entonces.
pt_br: A revisão dos relatórios enviados por pessoas que não fazem parte da equipe de status deve estar essencialmente concluída até meados de janeiro/abril/julho/outubro (deadline para a revisão de terceiros). Ou seja, exceto por erros de digitação ou outra revisão leve, a equipe de status deve ser capaz de começar a montar os envios logo após o dia 15. Observe que isso não é uma restrição completa e a equipe de status ainda pode aceitar revisões após essa data.
ru: Проверка представленных отчетов людьми, не входящими в команду статуса, должна быть в основном завершена к середине января/апреля/июля/октября (срок для сторонней отложенной проверки). То есть, за исключением опечаток или других незначительных правок, команда статуса должна быть готова начать сбор представленных материалов вскоре после 15-го числа. Отметим, что это не полный заморозка, и команда статуса все еще может принимать проверки в этот период.

source: First quarter
es: Primer trimestre
pt_br: Primeiro trimestre
ru: Первый квартал

source: Second quarter
es: Segundo trimestre
pt_br: Segundo trimestre
ru: Второй квартал

source: Third quarter
es: Tercer trimestre
pt_br: Terceiro trimestre
ru: Третий квартал

source: Fourth quarter
es: Cuarto trimestre
pt_br: Quarto trimestre
ru: Четвертый квартал

source: First call for reports
es: Primera llamada para informes
pt_br: Primeira chamada para relatórios
ru: Первый запрос отчетов

source: March 1st
es: 1 de Marzo
pt_br: 1º de março
ru: 1 марта

source: June 1st
es: 1 de Junio
pt_br: 1º de junho
ru: 1 июня

source: September 1st
es: 1 de Septiembre
pt_br: 1º de setembro
ru: 1 сентября

source: December 1st
es: 1 de Diciembre
pt_br: 1º de dezembro
ru: 1 декабря

source: 2 weeks left reminder
es: Recordatorio de 2 últimas semanas
pt_br: Lembrete de 2 semanas restantes
ru: Напоминание через 2 недели

source: March 15th
es: 15 de Marzo
pt_br: 15 de março
ru: 15 марта

source: June 15th
es: 15 de Junio
pt_br: 15 de junho
ru: 15 июня

source: September 15th
es: 15 de Septiembre
pt_br: 15 de setembro
ru: 15 сентября

source: December 15th
es: 15 de Diciembre
pt_br: 15 de dezembro
ru: 15 декабря

source: Last reminder
es: Último recordatorio
pt_br: Último lembrete
ru: Последнее напоминание

source: March 24th
es: 24 de Marzo
pt_br: 24 de março
ru: 24 марта

source: June 24th
es: 24 de Junio
pt_br: 24 de junho
ru: 24 июня

source: September 24th
es: 24 de Septiembre
pt_br: 24 de setembro
ru: 24 сентября

source: December 24th
es: 24 de Diciembre
pt_br: 24 de dezembro
ru: 24 декабря

source: Standard deadline
es: Fecha límite estándar
pt_br: Prazo padrão
ru: Стандартный срок выполнения

source: March 31st
es: 31 de Marzo
pt_br: 31 de março
ru: 31 марта

source: June 30th
es: 30 de Junio
pt_br: 30 de junho
ru: 30 июня

source: September 30th
es: 30 de Septiembre
pt_br: 30 de setembro
ru: 30 сентября

source: December 31st
es: 31 de Diciembre
pt_br: 31 de dezembro
ru: 31 декабря

source: Extended deadline
es: Fecha límite extendida
pt_br: Prazo estendido
ru: Расширенный срок выполнения

source: April 8th
es: 8 de Abril
pt_br: 8 de abril
ru: 8 апреля

source: July 8th
es: 8 de Julio
pt_br: 8 de julho
ru: 8 июля

source: October 8th
es: 8 de Octubre
pt_br: 8 de outubro
ru: 8 октября

source: January 8th
es: 8 de Enero
pt_br: 8 de janeiro
ru: 8 января

source: Third-party review slush
es: Semicongelación de revisión de terceros
pt_br: Revisão por terceiros
ru: Срок проверки другими участниками

source: April 15th
es: 15 de Abril
pt_br: 15 de abril
ru: 15 апреля

source: July 15th
es: 15 de Julio
pt_br: 15 de julho
ru: 15 июля

source: October 15th
es: 15 de Octubre
pt_br: 15 de outubro
ru: 15 октября

source: January 15th
es: 15 de Enero
pt_br: 15 de janeiro
ru: 15 января

source: Call for reports
es: Llamadas para informes
pt_br: Chamada para relatórios
ru: Запрос отчетов

source: Calls for status reports are sent to the following recipients:
es: Las llamadas para los informes de estado se envían a los siguientes destinatarios:
pt_br: As chamadas para relatórios de status são enviadas para os seguintes destinatários:
ru: Запросы отчетов о состоянии отправляются следующим получателям:

source: the link:https://lists.freebsd.org/subscription/freebsd-status-calls[freebsd-status-calls@FreeBSD.org mailing list];
es: la link:https://lists.freebsd.org/subscription/freebsd-status-calls[lista de correo freebsd-status-calls@FreeBSD.org];
pt_br: a lista de discussão link:https://lists.freebsd.org/subscription/freebsd-status-calls[freebsd-status-calls@FreeBSD.org];
ru: link:https://lists.freebsd.org/subscription/freebsd-status-calls[почтовая рассылка freebsd-status-calls@FreeBSD.org];

source: to all submitters of last status reports (they may have updates or further improvements);
es: a todos los que enviaron los últimos informes de estado (podrían tener actualizaciones u otras mejoras);
pt_br: a todos os remetentes dos últimos relatórios de status (eles podem ter atualizações ou melhorias adicionais);
ru: всем авторам последних отчетов о состоянии (у них могут быть обновления или дополнительные улучшения);

source: and, depending on the season:
es: y, dependiendo de la temporada:
pt_br: e, dependendo da época do ano:

source: Various conference organizers:
es: Organizadores de varias conferencias:
pt_br: Diversos organizadores de conferências:
ru: Различные организаторы конференций:

source: link:mailto:secretary@asiabsdcon.org[AsiaBSDCon] in March (First Quarter);
es: link:mailto:secretary@asiabsdcon.org[AsiaBSDCon] en Marzo (Primer Trimestre);
pt_br: link:mailto:secretary@asiabsdcon.org[AsiaBSDCon] em março (primeiro trimestre);
ru: link:mailto:secretary@asiabsdcon.org[AsiaBSDCon] в марте (первый квартал);

source: link:mailto:info@bsdcan.org[BSDCan] in May (Second Quarter);
es: link:mailto:info@bsdcan.org[BSDCan] en Mayo (Segundo Trimestre);
pt_br: link:mailto:info@bsdcan.org[BSDCan] em maio (Segundo Trimestre);
ru: link:mailto:info@bsdcan.org[BSDCan] в мае (второй квартал);

source: EuroBSDcon September - October (Third-Fourth Quarter).
es: EuroBSDcon Septiembre - Octubre (Tercer-Cuarto Trimestre).
pt_br: EuroBSDcon entre setembro e outubro (Terceiro-Quarto Trimestre).

source: EuroBSDcon as an organization is not interested in writing reports for FreeBSD (at least it was not in October 2019: its reason is that the conference is not FreeBSD specific), so reports about this event should be asked of members of the FreeBSD community that attended it;
es: EuroBSDcon como organización no está interesada en escribir informes de estado para FreeBSD (al menos no lo estaba en 2019: la razón es que no es una conferencia específica de FreeBSD), así que los informes acerca de este evento se deben pedir a los miembros de la comunidad de FreeBSD que asistieron al mismo;
pt_br: A EuroBSDcon como organização não está interessada em escrever relatórios para o FreeBSD (pelo menos não estava em outubro de 2019: sua razão é que a conferência não é específica do FreeBSD), portanto, relatórios sobre este evento devem ser solicitados aos membros da comunidade FreeBSD que participaram dele;

source: Google Summer of Code link:mailto:soc-students@FreeBSD.org[students] and their link:mailto:soc-mentors@FreeBSD.org[mentors].
es: link:mailto:soc-students@FreeBSD.org[Estudiantes] del Google Summer of Code y sus link:mailto:soc-mentors@FreeBSD.org[mentores].
pt_br: Para os link:mailto:soc-students@FreeBSD.org[estudantes] do programa Google Summer of Code e seus link:mailto:soc-mentors@FreeBSD.org[mentores].
ru: Google Summer of Code: link:mailto:soc-students@FreeBSD.org[студенты] и их link:mailto:soc-mentors@FreeBSD.org[наставники].

source: The easiest way to send calls for status reports is to use the link:https://cgit.freebsd.org/doc/tree/tools/sendcalls/sendcalls[[.filename]#sendcalls# perl script] in the [.filename]#tools/sendcalls# directory of the doc git repository. The script automatically sends calls to all intended recipients. It can also be used through a cron job, for example:
es: La forma más fácil de enviar las llamadas para los informes de estado es usar el link:https://cgit.freebsd.org/doc/tree/tools/sendcalls/sendcalls[script perl [.filename]#sendcalls#] en el directorio [.filename]#tools/sendcalls# del repositorio doc en git . El script automáticamente envía llamadas a todos los destinatarios. También puede ser usado desde un trabajo cron, por ejemplo:
pt_br: A maneira mais fácil de enviar chamadas para relatórios de status é usar o script Perl link:https://cgit.freebsd.org/doc/tree/tools/sendcalls/sendcalls[[.filename]#sendcalls#] existente no diretório [.filename]#tools/sendcalls# do repositório doc no git. O script envia automaticamente chamadas para todos os destinatários pretendidos. Ele também pode ser usado por meio de uma tarefa agendada no cron, por exemplo:
ru: Самый простой способ отправки запросов на отчеты о состоянии — использовать скрипт link:https://cgit.freebsd.org/doc/tree/tools/sendcalls/sendcalls[[.filename]#sendcalls# на Perl] из каталога [.filename]#tools/sendcalls# git репозитория документации. Скрипт автоматически отправляет запросы всем указанным получателям. Его также можно использовать через задание cron, например:

source: If you are in charge of sending calls for status reports and you are indeed using a cron job, please run it on freefall and sign it with your name so that it is possible to infer who has configured the cronjob, in case something goes wrong. Also please update the example above with your name, as an additional safety measure.
es: Si estás a cargo de enviar las llamadas para los informes de estado y estás usando un trabajo cron, por favor ejecútalo en freefall y fírmalo con tu nombre de forma que sea posible inferir quién ha configurado el trabajo, en caso de que algo vaya mal. Por favor actualiza también el ejemplo anterior con tu nombre, como una medida de seguridad adicional.
pt_br: Se você está encarregado de enviar chamadas para relatórios de status e está usando um cronjob, execute-o na freefall e assine-o com seu nome para que seja possível inferir quem configurou a tarefa, caso algo dê errado. Além disso, atualize o exemplo acima com seu nome, como uma medida de segurança adicional.
ru: Если вы отвечаете за рассылку запросов отчетов о состоянии и используете задание cron, пожалуйста, запускайте его на freefall и подписывайте своим именем, чтобы в случае возникновения проблем можно было определить, кто настроил задание cron. Также, в качестве дополнительной меры предосторожности, обновите приведенный выше пример, указав свое имя.

source: It may also be worth making a call for reports on the forums as link:https://forums.freebsd.org/threads/call-for-freebsd-2014q4-october-december-status-reports.49812/[was done in the past].
es: También podría merecer la pena hacer una llamada para los informes en los foros como link:https://forums.freebsd.org/threads/call-for-freebsd-2014q4-october-december-status-reports.49812/[se hizo en el pasado].
pt_br: Pode ser que valha a pena fazer uma chamada para relatórios nos fóruns, link:https://forums.freebsd.org/threads/call-for-freebsd-2014q4-october-december-status-reports.49812/[como foi feito no passado].
ru: Также может быть полезно объявить сбор отчетов на форумах, как это link:https://forums.freebsd.org/threads/call-for-freebsd-2014q4-october-december-status-reports.49812/[делалось ранее].

source: Building the report
es: Construyendo el informe
pt_br: Construindo o relatório
ru: Построение отчета

source: Submitted reports are reviewed and merged in the proper subdirectory of [.filename]#doc/website/content/en/status/# as they come in. While the reports are being updated, people outside the status team may also review the individual entries and propose fixes.
es: Los informes enviados son revisados e integrados en el subdirectorio apropiado de [.filename]#doc/website/content/en/status/# conforme van llegado. Mientras los informes están siendo actualizados, gente fuera del _status team_ también puede revisar las entradas individuales y proponer arreglos.
pt_br: Os relatórios enviados são revisados e mesclados na subpasta apropriada de [.filename]#doc/website/content/en/status/# assim que são recebidos. Enquanto os relatórios estão sendo atualizados, pessoas fora da equipe de status também podem revisar as entradas individuais e propor correções.
ru: Отправленные отчеты проверяются и объединяются в соответствующем подкаталоге [.filename]#doc/website/content/en/status/# по мере поступления. Пока отчеты обновляются, люди вне команды статуса также могут просматривать отдельные записи и предлагать исправления.

source: Usually the last step in the content review process is writing the introduction in a file named [.filename]#intro.adoc#: a good introduction can only be written once all the reports have been collected. If possible, it is a good idea to ask different people to write the introduction to add variety: different people will bring different viewpoints and help keep it fresh.
es: Normalmente el último paso en el proceso de revisión del contenido es escribir la introducción en un fichero llamado [.filename]#intro.adoc#: una buena introducción sólo puede escribirse una vez que se han recolectado todos los informes. Si es posible, es una buena idea pedir a distintas personas que escriban la introducción para añadir variedad: personas distintas ofrecerán distintos puntos de vista y ayudarán a mantenerlo fresco.
pt_br: Geralmente, o último passo no processo de revisão de conteúdo é escrever a introdução em um arquivo chamado [.filename]#intro.adoc#: uma boa introdução só pode ser escrita depois que todos os relatórios foram coletados. Se possível, é uma boa ideia pedir a diferentes pessoas para escrever a introdução para adicionar variedade: pessoas diferentes trarão diferentes pontos de vista e ajudarão a manter o texto interessante.
ru: Обычно последним шагом в процессе проверки содержания является написание введения в файле с названием [.filename]#intro.adoc#: хорошее введение можно написать только после того, как собраны все отчеты. По возможности, полезно попросить разных людей написать введение, чтобы добавить разнообразия: разные люди привнесут разные точки зрения и помогут сохранить его свежим.

source: Once all the reports and the introduction are ready, the [.filename]#_index.adoc# file needs to be created: this is the file in which the reports are distributed into the various categories and sorted.
es: Una vez que los informes y la introducción están listos, se necesita crear el fichero [.filename]#_index.adoc#: este es el fichero en el que los informes son distribuidos en categorías y ordenados.
pt_br: Assim que todos os relatórios e a introdução estiverem prontos, o arquivo [.filename]#_index.adoc# precisa ser criado: este é o arquivo no qual os relatórios são distribuídos nas várias categorias e classificados.
ru: После того как все отчеты и введение готовы, необходимо создать файл [.filename]#_index.adoc#: это файл, в котором отчеты распределяются по различным категориям и сортируются.

source: Publishing the report
es: Publicando el informe
pt_br: Publicação do relatório
ru: Публикация отчета

source: When all the files of the status report are ready, it is time to publish it.
es: Cuando todos los ficheros del informe de estado están listos, es momento de publicarlo.
pt_br: Quando todos os arquivos do relatório de status estiverem prontos, é hora de publicá-lo.
ru: Когда все файлы отчета о состоянии готовы, пришло время опубликовать его.

source: First [.filename]#doc/website/content/en/status/_index.adoc# is edited: the next due date is updated and a link to the new report is added. The change is then pushed on the repository and the status team checks that everythings works as expected.
es: Primero se edita [.filename]#doc/website/content/en/status/_index.adoc#: se actualiza la siguiente fecha de entra y se añade un enlace al nuevo informe. Después se empuja el cambio al repositorio y el _status team_ comprueba que todo funciona como se espera.
pt_br: Primeiramente, o arquivo [.filename]#doc/website/content/en/status/_index.adoc# é editado: a próxima data de entrega é atualizada e um link para o novo relatório é adicionado. A alteração é, então, enviada para o repositório e a equipe de status verifica se tudo está funcionando conforme o esperado.
ru: Сначала редактируется файл [.filename]#doc/website/content/en/status/_index.adoc#: обновляется следующая дата отчёта и добавляется ссылка на новый отчёт. Затем изменения отправляются в репозиторий, и команда статуса проверяет, что всё работает как ожидалось.

source: Then the news entry for the main website page is added to [.filename]#doc/website/data/en/news/news.toml#.
es: Después se añade la entrada a la sección de noticias de la página web principal en [.filename]#doc/website/data/en/news/news.toml#.
pt_br: Em seguida, é adicionada uma entrada de notícias na página principal do site em [.filename]#doc/website/data/en/news/news.toml#.
ru: Затем запись новости для главной страницы сайта добавляется в [.filename]#doc/website/data/ru/news/news.toml#.

source: Here is a sample for the news entry:
es: Aquí hay una muestra de la entrada de noticias:
pt_br: Aqui está um exemplo para uma entrada de notícias:
ru: Вот пример записи новостей:

source: [[news]] date = "2021-01-16" title = "October-December 2020 Status Report" description = "The <a href=\"https://www.FreeBSD.org/status/report-2020-10-2020-12.html\">October to December 2020 Status Report</a> is now available with 42 entries."
pt_br: [[news]] date = "2021-01-16" title = "Relatório de Status de Outubro a Dezembro de 2020" description = "O <a href=\"https://www.FreeBSD.org/status/report-2020-10-2020-12.html\">Relatório de Status de Outubro a Dezembro de 2020</a> está agora disponível com 42 entradas."

source: Once the HTML version of the report has been built and is online, man:w3m[1] is used to dump the website as plain-text, e.g:
es: Una vez que la versión HTML del informe se ha construido y está online, se usa man:w3m[1] para volcar la página web como texto plano, e.g:
pt_br: Assim que a versão HTML do relatório estiver compilada e online, o man:w3m[1] é usado fazer o dump do website em formato de texto simples, por exemplo:
ru: После создания HTML-версии отчёта и её публикации в сети используется man:w3m[1] для преобразования веб-сайта в простой текст, например:
