Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/freebsd-status-report-process/_index.po
Languages: es, pt_br, ru

source: man:w3m[1] has full proper unicode support. `-dump` simply outputs text rendering of the HTML code that can then have a few elements snipped, while `-cols` ensures that everything is wrapped to 80 columns.
es: man:w3m[1] tiene soporte completo para unicod. `-dump` simplemente extrae texto renderizado del código HTML en el que se pueden omitir algunos elementos, mientras que `-cols` asegura que todo está dentro del límite de 80 columnas.
pt_br: O `man:w3m[1]` possui suporte completo para unicode. O `-dump` simplesmente produz uma saída de texto da renderização do código HTML, que pode então ter alguns elementos recortados, enquanto o `-cols` garante que tudo seja enquadrado em 80 colunas.
ru: man:w3m[1] имеет полную поддержку юникода. Опция `-dump` просто выводит текстовое представление HTML-кода, из которого затем можно удалить несколько элементов, а `-cols` гарантирует, что всё будет перенесено на 80 колонок.

source: A link to the rendered report is added between the introduction and the first entry.
es: Se añade un enlace al informe renderizado entre la introducción y la primera entrada.
pt_br: Um link para o relatório gerado é adicionado entre a introdução e a primeira entrada.
ru: Ссылка на сформированный отчет добавляется между введением и первой записью.

source: The report is finally ready to be sent, toggling disposition (the report should be inlined), and ensuring it is encoded as UTF-8.
es: Finalmente el informe está listo para ser enviado, cambiando la disposición (el informe debe ser _inline_), y asegurándose de que esté codificado en UTF-8.
pt_br: O relatório está finalmente pronto para ser enviado, alterando o posicionamento (o relatório deve ser inserido) e garantindo que ele esteja codificado em UTF-8.
ru: Переключив способ доставки (отчёт должен быть в тексте письма, а не в приложении) и убедившись, что его кодировка в UTF-8, вы получаете окончательно готовый к отправке отчёт.

source: Two emails are sent, both with subject in the format `FreeBSD Status Report - <First/Second/Third/Fourth> Quarter <year>`:
es: Se envían dos correos, ambos con un tema con formato `FreeBSD Status Report - <First/Second/Third/Fourth> Quarter <year>`:
pt_br: Duas mensagens de e-mail são enviadas, ambas com o assunto no formato `Relatório de Status do FreeBSD - <Primeiro/Segundo/Terceiro/Quarto> Trimestre de <ano>`:
ru: Отправляются два письма, оба с темой в формате `FreeBSD Status Report - <First/Second/Third/Fourth> Quarter <year>`:

source: one to link:https://lists.freebsd.org/subscription/freebsd-announce[freebsd-announce@FreeBSD.org];
es: uno a link:https://lists.freebsd.org/subscription/freebsd-announce[freebsd-announce@FreeBSD.org];
pt_br: um para o link:https://lists.freebsd.org/subscription/freebsd-announce[freebsd-announce@FreeBSD.org];
ru: одно для link:https://lists.freebsd.org/subscription/freebsd-announce[freebsd-announce@FreeBSD.org];

source: This one must be approved, so if you are in charge of sending this email, ensure that someone does it (mail link:mailto:postmaster@FreeBSD.org[postmaster] if it is taking long).
es: Este debe ser aprobado, así que si estás a cargo de enviar este email, asegúrate de que alguien lo hace (envía un correo a link:mailto:postmaster@FreeBSD.org[postmaster] si tarda demasiado).
pt_br: Este deverá ser aprovado, portanto, se você for responsável por enviar este e-mail, certifique-se de que alguém o faça (envie um e-mail para o link:mailto:postmaster@FreeBSD.org[postmaster] se estiver demorando muito).
ru: Это письмо должно быть одобрено, поэтому если вы отвечаете за отправку этого письма, убедитесь, что кто-то сделает это одобрение (напишите link:mailto:postmaster@FreeBSD.org[постмастеру], если одобрение займет много времени).

source: one to link:https://lists.freebsd.org/subscription/freebsd-hackers[freebsd-hackers@FreeBSD.org], which also has link:https://lists.freebsd.org/subscription/freebsd-current[freebsd-current@FreeBSD.org] and link:https://lists.freebsd.org/subscription/freebsd-stable[freebsd-stable@FreeBSD.org] in CC and `developers@FreeBSD.org` in BCC.
es: uno a link:https://lists.freebsd.org/subscription/freebsd-hackers[freebsd-hackers@FreeBSD.org], que también tiene link:https://lists.freebsd.org/subscription/freebsd-current[freebsd-current@FreeBSD.org] y link:https://lists.freebsd.org/subscription/freebsd-stable[freebsd-stable@FreeBSD.org] en CC y a `developers@FreeBSD.org` en BCC.
pt_br: um para link:https://lists.freebsd.org/subscription/freebsd-hackers[freebsd-hackers@FreeBSD.org], que também inclua link:https://lists.freebsd.org/subscription/freebsd-current[freebsd-current@FreeBSD.org] e link:https://lists.freebsd.org/subscription/freebsd-stable[freebsd-stable@FreeBSD.org] em cópia (CC), e o `developers@FreeBSD.org` em cópia oculta (BCC).
ru: одно на link:https://lists.freebsd.org/subscription/freebsd-hackers[freebsd-hackers@FreeBSD.org], которому добавьте link:https://lists.freebsd.org/subscription/freebsd-current[freebsd-current@FreeBSD.org] и link:https://lists.freebsd.org/subscription/freebsd-stable[freebsd-stable@FreeBSD.org] в копию (CC) и `developers@FreeBSD.org` в скрытую копию (BCC).

source: And then they stop. Maybe the reader is an avid Cyberdyne fan and knows what exciting new features the T800 brings. This is unlikely. It is far more likely that they have vaguely heard of whatever you have imported (especially into the ports tree: remember that there are over 30,000 other things there too...). List some of the new features, or bug fixes. Tell them why it is a good thing that we have the new version.
es: Y luego paran. A lo mejor el lector es un ávido fan de Cyberdyne y conoce todas las características excitantes del nuevo T800. Es improbable. Es mucho más probable que haya oído hablar vagamente de lo que quiera que hayas importado (especialmente en el árbol de ports: recuerda que hay cerca de 30,000 cosas ahí también...). Proporciona una lista de nuevas características, o fallos corregidos. Diles por qué es bueno que tengamos una nueva versión.

source: This section provides some advice on writing status report entries. Instructions on how to submit your entries are also given.
ru: Этот раздел содержит рекомендации по написанию записей в отчетах о состоянии. Также приведены инструкции по отправке ваших записей.

source: Now the reader knows that `abc` is a network interface driver. Even if they do not use any Yoyodyne products, you have communicated that FreeBSD's support for network devices is improving.
ru: Теперь читатель знает, что `abc` — это драйвер сетевого интерфейса. Даже если они не используют продукты Yoyodyne, вы сообщили, что поддержка сетевых устройств в FreeBSD улучшается.

source: and, depending on the season,
ru: и, в зависимости от времени года,

source: Various conference attendees:
ru: Различные участники конференции:

source: EuroBSDcon in September - October (Third-Fourth Quarter); EuroBSDcon as an organization is not interested in writing reports for FreeBSD - at least it was not in October 2019: its reason is that the conference is not FreeBSD specific. Hence, reports about this event should be asked of members of the FreeBSD community that attended it.
ru: ЕвроBSDcon в сентябре - октябре (третий-четвертый квартал); организация ЕвроBSDcon не заинтересована в написании отчетов для FreeBSD — по крайней мере, не была заинтересована в октябре 2019 года: причина в том, что конференция не ориентирована конкретно на FreeBSD. Следовательно, отчеты об этом мероприятии следует запрашивать у участников сообщества FreeBSD, которые присутствовали на нем.
