Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: This section provides an overview of the built-in client utilities to securely access other systems and securely transfer files from a FreeBSD system. It then describes how to configure a SSH server on a FreeBSD system. More information is available in the man pages mentioned in this chapter.
ko: 이 섹션에서는 다른 시스템에 안전하게 액세스하고 FreeBSD 시스템에서 파일을 안전하게 전송하기 위한 내장 클라이언트 유틸리티에 대한 개요를 제공합니다. 그런 다음 FreeBSD 시스템에서 SSH 서버를 구성하는 방법을 설명합니다. 자세한 내용은 이 장에 언급된 매뉴얼 페이지에서 확인할 수 있습니다.

source: Using the SSH Client Utilities
ko: SSH 클라이언트 유틸리티 사용하기
ru: Использование клиентских утилит SSH

source: To log into a SSH server, use `ssh` and specify a username that exists on that server and the IP address or hostname of the server. If this is the first time a connection has been made to the specified server, the user will be prompted to first verify the server's fingerprint:
ko: SSH 서버에 로그인하려면 `ssh`를 사용하여 해당 서버에 존재하는 사용자 아이디와 서버의 IP 주소 또는 호스트명을 지정합니다. 지정한 서버에 처음 연결하는 경우 먼저 서버의 지문을 확인하라는 메시지가 표시됩니다:

source: SSH utilizes a key fingerprint system to verify the authenticity of the server when the client connects. When the user accepts the key's fingerprint by typing `yes` when connecting for the first time, a copy of the key is saved to [.filename]#.ssh/known_hosts# in the user's home directory. Future attempts to login are verified against the saved key and `ssh` will display an alert if the server's key does not match the saved key. If this occurs, the user should first verify why the key has changed before continuing with the connection.
ko: SSH는 키 지문 시스템을 사용하여 클라이언트가 연결할 때 서버의 진위 여부를 확인합니다. 사용자가 처음 연결할 때 `yes`를 입력하여 키 지문을 수락하면 키의 사본이 사용자의 홈 디렉터리에 있는 [.filename]#.ssh/known_hosts#에 저장됩니다. 향후 로그인 시도는 저장된 키와 비교하여 확인되며 서버의 키가 저장된 키와 일치하지 않으면 `ssh`에서 경고를 표시합니다. 이 경우 사용자는 연결을 계속하기 전에 먼저 키가 변경된 이유를 확인해야 합니다.

source: Recent versions of OpenSSH only accept SSHv2 connections. SSH protocol version 1 is obsolete.
ko: 최신 버전의 OpenSSH는 SSHv2 연결만 허용합니다. SSH 프로토콜 버전 1은 더 이상 사용되지 않습니다.

source: Use man:scp[1] to securely copy a file to or from a remote machine. This example copies [.filename]#COPYRIGHT# on the remote system to a file of the same name in the current directory of the local system:
ko: man:scp[1]을 사용하여 원격 시스템으로 또는 원격 시스템에서 파일을 안전하게 복사합니다. 이 예에서는 원격 시스템의 [.filename]#COPYRIGHT#을 로컬 시스템의 현재 디렉터리에 있는 같은 이름의 파일로 복사합니다:

source: Since the fingerprint was already verified for this host, the server's key is automatically checked before prompting for the user's password.
ko: 이 호스트에 대해 이미 지문이 확인되었으므로 사용자의 비밀번호를 묻기 전에 서버의 키가 자동으로 확인됩니다.
ru: Поскольку отпечаток этого узла уже был проверен, ключ сервера автоматически проверяется перед запросом пароля пользователя.

source: The arguments passed to `scp` are similar to `cp`. The file or files to copy is the first argument and the destination to copy to is the second. Since the file is fetched over the network, one or more of the file arguments takes the form `user@host:<path_to_remote_file>`. Be aware when copying directories recursively that `scp` uses `-r`, whereas `cp` uses `-R`.
ko: `scp`에 전달되는 인수는 `cp`와 유사합니다. 복사할 파일은 첫 번째 인수이고 복사할 대상은 두 번째 인수입니다. 파일은 네트워크를 통해 가져오기 때문에 하나 이상의 파일 인수는 `사용자@호스트:<원격_파일_경로>` 형식을 취합니다. 디렉터리를 재귀적으로 복사할 때 `scp`는 `-r`을 사용하는 반면, `cp`는 `-R`을 사용한다는 점에 유의하세요.

source: To open an interactive session for copying files, use `sftp`. Refer to man:sftp[1] for a list of available commands while in an `sftp` session.
ko: 파일 복사를 위한 대화형 세션을 열려면 `sftp`를 사용합니다. `sftp` 세션에서 사용할 수 있는 명령어 목록은 man:sftp[1]을 참조하세요.

source: Key-based Authentication
ko: 키 기반 인증
ru: Аутентификация на основе ключей

source: Instead of using passwords, a client can be configured to connect to the remote machine using keys. To generate RSA authentication keys, use `ssh-keygen`. To generate a public and private key pair, specify the type of key and follow the prompts. It is recommended to protect the keys with a memorable, but hard to guess passphrase.
ko: 암호를 사용하는 대신 키를 사용하여 원격 컴퓨터에 연결하도록 클라이언트를 구성할 수 있습니다. RSA 인증 키를 생성하려면 `ssh-keygen`을 사용합니다. 공개 키와 개인 키 쌍을 생성하려면 키 유형을 지정하고 지시에 따릅니다. 기억하기 쉽지만 추측하기 어려운 암호 구문으로 키를 보호하는 것이 좋습니다.

source: Type a passphrase here. It can contain spaces and symbols.
ko: 여기에 비밀번호를 입력합니다. 공백과 기호를 포함할 수 있습니다.

source: Retype the passphrase to verify it.
ko: 비밀번호를 다시 입력하여 확인합니다.

source: The private key is stored in [.filename]#~/.ssh/id_rsa# and the public key is stored in [.filename]#~/.ssh/id_rsa.pub#. The _public_ key must be copied to [.filename]#~/.ssh/authorized_keys# on the remote machine for key-based authentication to work.
ko: 개인 키는 [.filename]#~/.ssh/id_rsa#에 저장되고 공개 키는 [.filename]#~/.ssh/id_rsa.pub#에 저장됩니다. 공개 키는 원격 컴퓨터의 [.filename]#~/.ssh/authorized_keys#에 복사해야 키 기반 인증이 작동합니다.
ru: Закрытый ключ хранится в [.filename]#~/.ssh/id_rsa#, а открытый ключ — в [.filename]#~/.ssh/id_rsa.pub#. _Открытый_ ключ должен быть скопирован в файл [.filename]#~/.ssh/authorized_keys# на удалённой машине, чтобы аутентификация по ключу работала.

source: Many users believe that keys are secure by design and will use a key without a passphrase. This is _dangerous_ behavior. An administrator can verify that a key pair is protected by a passphrase by viewing the private key manually. If the private key file contains the word `ENCRYPTED`, the key owner is using a passphrase. In addition, to better secure end users, `from` may be placed in the public key file. For example, adding `from="192.168.10.5"` in front of the `ssh-rsa` prefix will only allow that specific user to log in from that IP address.
ko: 많은 사용자가 키가 설계상 안전하다고 믿고 비밀번호 없이 키를 사용합니다. 이는 _위험한_ 행동입니다. 관리자는 개인키를 수동으로 확인하여 키 쌍이 암호문으로 보호되는지 확인할 수 있습니다. 개인키 파일에 `ENCRYPTED`라는 단어가 포함되어 있으면 키 소유자가 암호 구문을 사용하고 있는 것입니다. 또한 최종 사용자를 더 안전하게 보호하기 위해 공개 키 파일에 `from`을 넣을 수 있습니다. 예를 들어, `ssh-rsa` 접두사 앞에 `from=“192.168.10.5”`를 추가하면 특정 사용자만 해당 IP 주소에서 로그인할 수 있습니다.

source: The options and files vary with different versions of OpenSSH. To avoid problems, consult man:ssh-keygen[1].
ko: 옵션과 파일은 OpenSSH 버전에 따라 다릅니다. 문제를 방지하려면 man:ssh-keygen[1]을 참조하세요.

source: If a passphrase is used, the user is prompted for the passphrase each time a connection is made to the server. To load SSH keys into memory and remove the need to type the passphrase each time, use man:ssh-agent[1] and man:ssh-add[1].
ko: 암호 구문을 사용하는 경우 서버에 연결할 때마다 사용자에게 암호 구문을 묻는 메시지가 표시됩니다. SSH 키를 메모리에 로드하여 매번 암호를 입력할 필요가 없도록 하려면 man:ssh-agent[1] 및 man:ssh-add[1]를 사용하세요.

source: Authentication is handled by `ssh-agent`, using the private keys that are loaded into it. `ssh-agent` can be used to launch another application like a shell or a window manager.
ko: 인증은 로드된 개인 키를 사용하여 `ssh-agent`에 의해 처리됩니다. `ssh-agent`는 셸이나 창 관리자와 같은 다른 애플리케이션을 시작하는 데 사용할 수 있습니다.

source: To use `ssh-agent` in a shell, start it with a shell as an argument. Add the identity by running `ssh-add` and entering the passphrase for the private key. The user will then be able to `ssh` to any host that has the corresponding public key installed. For example:
ko: 셸에서 `ssh-agent`를 사용하려면 셸을 인수로 사용하여 시작합니다. `ssh-add`를 실행하고 개인 키의 암호를 입력하여 ID를 추가합니다. 그러면 사용자는 해당 공개 키가 설치된 모든 호스트에 `ssh`할 수 있습니다. 예를 들어:

source: Enter the passphrase for the key.
ko: 키의 비밀번호를 입력합니다.

source: To use `ssh-agent` in Xorg, add an entry for it in [.filename]#~/.xinitrc#. This provides the `ssh-agent` services to all programs launched in Xorg. An example [.filename]#~/.xinitrc# might look like this:
ko: Xorg에서 `ssh-agent`를 사용하려면 [.filename]#~/.xinitrc#에 해당 항목을 추가합니다. 이렇게 하면 Xorg에서 실행되는 모든 프로그램에 `ssh-agent` 서비스가 제공됩니다. 예제 [.filename]#~/.xinitrc#은 다음과 같습니다:

source: This launches `ssh-agent`, which in turn launches XFCE, every time Xorg starts. Once Xorg has been restarted so that the changes can take effect, run `ssh-add` to load all of the SSH keys.
ko: 이렇게 하면 Xorg가 시작될 때마다 `ssh-agent`가 실행되고, 이는 다시 XFCE를 시작합니다. 변경 사항을 적용할 수 있도록 Xorg를 재시작한 후, `ssh-add`를 실행하여 모든 SSH 키를 로드합니다.

source: SSH Tunneling
ko: SSH 터널링
ru: Туннелирование SSH

source: OpenSSH has the ability to create a tunnel to encapsulate another protocol in an encrypted session.
ko: OpenSSH는 터널을 생성하여 암호화된 세션에서 다른 프로토콜을 캡슐화할 수 있습니다.
ru: OpenSSH обладает возможностью создания туннеля для инкапсуляции другого протокола в зашифрованном сеансе.

source: The following command tells `ssh` to create a tunnel for telnet:
ko: 다음 명령은 `ssh`에게 텔넷용 터널을 생성하도록 지시합니다:

source: This example uses the following options:
ko: 이 예에서는 다음 옵션을 사용합니다:
ru: Этот пример использует следующие параметры:

source: Indicates no command, or tunnel only. If omitted, `ssh` initiates a normal session.
ko: 명령이 없거나 터널만 있음을 나타냅니다. 생략하면 `ssh`가 일반 세션을 시작합니다.

source: Forces `ssh` to run in the background.
ko: `ssh`가 백그라운드에서 실행되도록 강제합니다.

source: Indicates a local tunnel in _localport:remotehost:remoteport_ format.
ko: _localport:remotehost:remoteport_ 형식의 로컬 터널을 나타냅니다.

source: The login name to use on the specified remote SSH server.
ko: 지정된 원격 SSH 서버에서 사용할 로그인 이름입니다.
ru: Имя пользователя для входа на указанный удаленный SSH-сервер.

source: An SSH tunnel works by creating a listen socket on `localhost` on the specified `localport`. It then forwards any connections received on `localport` via the SSH connection to the specified `remotehost:remoteport`. In the example, port `5023` on the client is forwarded to port `23` on the remote machine. Since port 23 is used by telnet, this creates an encrypted telnet session through an SSH tunnel.
ko: SSH 터널은 지정된 `localport`의 `localhost`에 수신 대기 소켓을 생성하는 방식으로 작동합니다. 그런 다음 SSH 연결을 통해 `localport`에서 수신된 모든 연결을 지정된 `remotehost:remoteport`로 전달합니다. 이 예제에서는 클라이언트의 `5023` 포트가 원격 컴퓨터의 `23` 포트로 전달됩니다. 포트 23은 텔넷에서 사용되므로 SSH 터널을 통해 암호화된 텔넷 세션이 생성됩니다.

source: This method can be used to wrap any number of insecure TCP protocols such as SMTP, POP3, and FTP, as seen in the following examples.
ko: 이 방법은 다음 예제에서 볼 수 있듯이 SMTP, POP3, FTP 등 안전하지 않은 TCP 프로토콜을 얼마든지 래핑하는 데 사용할 수 있습니다.

source: Create a Secure Tunnel for SMTP
ko: SMTP용 보안 터널 만들기

source: This can be used in conjunction with `ssh-keygen` and additional user accounts to create a more seamless SSH tunneling environment. Keys can be used in place of typing a password, and the tunnels can be run as a separate user.
ko: `ssh-keygen` 및 추가 사용자 계정과 함께 사용하여 보다 원활한 SSH 터널링 환경을 만들 수 있습니다. 비밀번호를 입력하는 대신 키를 사용할 수 있으며, 터널을 별도의 사용자로 실행할 수 있습니다.

source: Secure Access of a POP3 Server
ko: POP3 서버의 보안 액세스

source: In this example, there is an SSH server that accepts connections from the outside. On the same network resides a mail server running a POP3 server. To check email in a secure manner, create an SSH connection to the SSH server and tunnel through to the mail server:
ko: 이 예제에서는 외부로부터의 연결을 허용하는 SSH 서버가 있습니다. 같은 네트워크에 POP3 서버를 실행하는 메일 서버가 있습니다. 안전한 방식으로 이메일을 확인하려면 SSH 서버에 대한 SSH 연결을 만들고 메일 서버로 터널링합니다:

source: Once the tunnel is up and running, point the email client to send POP3 requests to `localhost` on port 2110. This connection will be forwarded securely across the tunnel to `mail.example.com`.
ko: 터널이 실행되면 이메일 클라이언트에서 포트 2110의 `localhost`로 POP3 요청을 보내도록 지정합니다. 이 연결은 터널을 통해 `mail.example.com`으로 안전하게 전달됩니다.

source: Bypassing a Firewall
ko: 방화벽 우회하기

source: Some firewalls filter both incoming and outgoing connections. For example, a firewall might limit access from remote machines to ports 22 and 80 to only allow SSH and web surfing. This prevents access to any other service which uses a port other than 22 or 80.
ko: 일부 방화벽은 들어오는 연결과 나가는 연결을 모두 필터링합니다. 예를 들어, 방화벽은 원격 컴퓨터에서 22번과 80번 포트로의 액세스를 제한하여 SSH와 웹 서핑만 허용할 수 있습니다. 이렇게 하면 22번이나 80번 이외의 포트를 사용하는 다른 서비스에 대한 액세스가 차단됩니다.

source: The solution is to create an SSH connection to a machine outside of the network's firewall and use it to tunnel to the desired service:
ko: 해결책은 네트워크 방화벽 외부의 머신에 SSH 연결을 생성하고 이를 사용하여 원하는 서비스로 터널링하는 것입니다:

source: In this example, a streaming Ogg Vorbis client can now be pointed to `localhost` port 8888, which will be forwarded over to `music.example.com` on port 8000, successfully bypassing the firewall.
ko: 이 예제에서는 이제 스트리밍 Ogg Vorbis 클라이언트가 `localhost` 포트 8888을 가리키면 포트 8000의 `music.example.com`으로 전달되어 방화벽을 성공적으로 우회할 수 있습니다.

source: Enabling the SSH Server
ko: SSH 서버 활성화하기
ru: Включение сервера SSH

source: In addition to providing built-in SSH client utilities, a FreeBSD system can be configured as an SSH server, accepting connections from other SSH clients.
ko: FreeBSD 시스템은 내장된 SSH 클라이언트 유틸리티를 제공할 뿐만 아니라, 다른 SSH 클라이언트로부터의 연결을 수락하여 SSH 서버로 구성할 수 있습니다.
ru: В дополнение к встроенным клиентским утилитам SSH, система FreeBSD может быть настроена как SSH-сервер, принимающий подключения от других SSH-клиентов.

source: To see if sshd is operating, use the man:service[8] command:
ko: sshd가 작동 중인지 확인하려면 man:service[8] 명령을 사용합니다:

source: If the service is not running, add the following line to [.filename]#/etc/rc.conf#.
ko: 서비스가 실행 중이 아닌 경우 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다.

source: This will start sshd, the daemon program for OpenSSH, the next time the system boots. To start it now:
ko: 그러면 다음 번에 시스템이 부팅될 때 OpenSSH용 데몬 프로그램인 sshd가 시작됩니다. 지금 시작하려면:

source: The first time sshd starts on a FreeBSD system, the system's host keys will be automatically created and the fingerprint will be displayed on the console. Provide users with the fingerprint so that they can verify it the first time they connect to the server.
ko: FreeBSD 시스템에서 sshd를 처음 시작하면 시스템의 호스트 키가 자동으로 생성되고 콘솔에 지문이 표시됩니다. 사용자가 서버에 처음 연결할 때 지문을 확인할 수 있도록 사용자에게 지문을 제공하세요.
ru: При первом запуске `sshd` в системе FreeBSD автоматически создаются ключи хоста системы, и их отпечаток выводится на консоль. Предоставьте пользователям этот отпечаток, чтобы они могли проверить его при первом подключении к серверу.

source: Refer to man:sshd[8] for the list of available options when starting sshd and a more complete discussion about authentication, the login process, and the various configuration files.
ko: sshd를 시작할 때 사용할 수 있는 옵션 목록과 인증, 로그인 프로세스 및 다양한 구성 파일에 대한 자세한 설명은 man:sshd[8]을 참조하세요.

source: At this point, the sshd should be available to all users with a username and password on the system.
ko: 이 시점에서 시스템에서 사용자 이름과 비밀번호를 가진 모든 사용자가 sshd를 사용할 수 있어야 합니다.
ru: На этом этапе `sshd` должен быть доступен всем пользователям системы, имеющим имя пользователя и пароль.

source: SSH Server Security
ko: SSH 서버 보안

source: While sshd is the most widely used remote administration facility for FreeBSD, brute force and drive by attacks are common to any system exposed to public networks. Several additional parameters are available to prevent the success of these attacks and will be described in this section.
ko: sshd는 FreeBSD에서 가장 널리 사용되는 원격 관리 기능이지만, 무차별 대입 및 드라이브 바이 공격은 공용 네트워크에 노출된 모든 시스템에서 흔히 발생합니다. 이러한 공격의 성공을 막기 위해 몇 가지 추가 매개변수를 사용할 수 있으며 이에대해 이번 섹션에서 설명합니다.

source: It is a good idea to limit which users can log into the SSH server and from where using the `AllowUsers` keyword in the OpenSSH server configuration file. For example, to only allow `root` to log in from `192.168.1.32`, add this line to [.filename]#/etc/ssh/sshd_config#:
ko: OpenSSH 서버 구성 파일에서 `AllowUsers` 키워드를 사용하여 SSH 서버에 로그인할 수 있는 사용자와 로그인 위치를 제한하는 것이 좋습니다. 예를 들어 ‘root’만 `192.168.1.32`에서 로그인할 수 있도록 허용하려면 [.filename]#/etc/ssh/sshd_config#에 이 줄을 추가합니다:

source: To allow `admin` to log in from anywhere, list that user without specifying an IP address:
ko: `admin`이 어디서든 로그인할 수 있도록 하려면 IP 주소를 지정하지 않고 해당 사용자를 나열합니다:

source: Multiple users should be listed on the same line, like so:
ko: 다음과 같이 여러 사용자가 같은 줄에 나열되어야 합니다:
ru: Несколько пользователей следует перечислять в одной строке, например:

source: After making changes to [.filename]#/etc/ssh/sshd_config#, tell sshd to reload its configuration file by running:
ko: [.filename]#/etc/ssh/sshd_config#을 변경한 후 sshd를 실행하여 구성 파일을 다시 로드하도록 지시합니다:

source: When this keyword is used, it is important to list each user that needs to log into this machine. Any user that is not specified in that line will be locked out. Also, the keywords used in the OpenSSH server configuration file are case-sensitive. If the keyword is not spelled correctly, including its case, it will be ignored. Always test changes to this file to make sure that the edits are working as expected. Refer to man:sshd_config[5] to verify the spelling and use of the available keywords.
ko: 이 키워드를 사용할 때는 컴퓨터에 로그인해야 하는 각 사용자를 나열하는 것이 중요합니다. 해당 줄에 지정되지 않은 사용자는 모두 잠깁니다. 또한 OpenSSH 서버 구성 파일에 사용되는 키워드는 대소문자를 구분합니다. 키워드의 철자가 대소문자를 포함하여 올바르지 않으면 무시됩니다. 항상 이 파일의 변경 사항을 테스트하여 편집 내용이 예상대로 작동하는지 확인하세요. 사용 가능한 키워드의 철자와 사용법을 확인하려면 man:sshd_config[5]를 참조하세요.

source: In addition, users may be forced to use two factor authentication via the use of a public and private key. When required, the user may generate a key pair through the use of man:ssh-keygen[1] and send the administrator the public key. This key file will be placed in the [.filename]#authorized_keys# as described above in the client section. To force the users to use keys only, the following option may be configured:
ko: 또한 사용자는 공개 키와 개인 키를 사용하여 2단계 인증을 사용해야 할 수도 있습니다. 필요한 경우 사용자는 man:ssh-keygen[1]을 사용하여 키 쌍을 생성하고 관리자에게 공개 키를 보낼 수 있습니다. 이 키 파일은 위의 클라이언트 섹션에서 설명한 대로 [.filename]#authorized_keys#에 배치됩니다. 사용자가 키만 사용하도록 하려면 다음 옵션을 구성할 수 있습니다:

source: Do not confuse [.filename]#/etc/ssh/sshd_config# with [.filename]#/etc/ssh/ssh_config# (note the extra `d` in the first filename). The first file configures the server and the second file configures the client. Refer to man:ssh_config[5] for a listing of the available client settings.
ko: [.filename]#/etc/ssh/sshd_config#과 [.filename]#/etc/ssh/ssh_config#을 혼동하지 마세요(첫 번째 파일명에서 `d`가 추가됨을 주의하세요). 첫 번째 파일은 서버를 구성하고 두 번째 파일은 클라이언트를 구성합니다. 사용 가능한 클라이언트 설정 목록은 man:ssh_config[5]를 참조하세요.
ru: Не путайте [.filename]#/etc/ssh/sshd_config# с [.filename]#/etc/ssh/ssh_config# (обратите внимание на дополнительную букву `d` в первом имени файла). Первый файл настраивает сервер, а второй — клиент. Список доступных настроек клиента приведён в man:ssh_config[5].

source: Access Control Lists
ko: 액세스 제어 목록
ru: Списки контроля доступа

source: Access Control Lists (ACLs) extend the standard UNIX(R) permission model in a POSIX(R).1e compatible way. This permits an administrator to take advantage of a more fine-grained permissions model.
ko: ACL(액세스 제어 목록, Access Control Lists)은 표준 UNIX(R) 권한 모델을 POSIX(R).1e와 호환되는 방식으로 확장합니다. 이를 통해 관리자는 보다 세분화된 권한 모델을 활용할 수 있습니다.

source: The FreeBSD [.filename]#GENERIC# kernel provides ACL support for UFS file systems. Users who prefer to compile a custom kernel must include the following option in their custom kernel configuration file:
ko: FreeBSD [.filename]#GENERIC# 커널은 UFS 파일 시스템에 대한 ACL 지원을 제공합니다. 사용자 정의 커널을 컴파일하려는 사용자는 사용자 정의 커널 구성 파일에 다음 옵션을 포함해야 합니다:

source: If this option is not compiled in, a warning message will be displayed when attempting to mount a file system with ACL support. ACLs rely on extended attributes which are natively supported in UFS2.
ko: 이 옵션이 컴파일되어 있지 않으면 ACL을 지원하는 파일 시스템을 마운트하려고 할 때 경고 메시지가 표시됩니다. ACL은 UFS2에서 기본적으로 지원되는 확장 속성에 의존합니다.

source: This chapter describes how to enable ACL support and provides some usage examples.
ko: 이 장에서는 ACL 지원을 사용 설정하는 방법과 몇 가지 사용 예제를 설명합니다.

source: Enabling ACL Support
ko: ACL 지원 활성화하기

source: ACLs are enabled by the mount-time administrative flag, `acls`, which may be added to [.filename]#/etc/fstab#. The mount-time flag can also be automatically set in a persistent manner using man:tunefs[8] to modify a superblock ACLs flag in the file system header. In general, it is preferred to use the superblock flag for several reasons:
ko: ACL은 마운트 시간 관리 플래그(mount-time administrative flag)인 `acls`에 의해 활성화되며, 이 플래그는 [.filename]#/etc/fstab#에 추가할 수 있습니다. 마운트-시간 플래그는 파일 시스템 헤더의 슈퍼블록 ACL 플래그를 수정하는 man:tunefs[8]를 사용하여 영구적인 방식으로 자동으로 설정할 수도 있습니다. 일반적으로 여러 가지 이유로 슈퍼블록 플래그를 사용하는 것이 바람직합니다:

source: The superblock flag cannot be changed by a remount using `mount -u` as it requires a complete `umount` and fresh `mount`. This means that ACLs cannot be enabled on the root file system after boot. It also means that ACL support on a file system cannot be changed while the system is in use.
ko: 슈퍼블록 플래그는 완전한 ‘마운트’와 새로운 ‘마운트’가 필요하므로 ‘mount -u’를 사용한 재마운트로(remount)는 변경할 수 없습니다. 즉, 부팅 후 루트 파일 시스템에서 ACL을 사용할 수 없습니다. 또한 시스템이 사용 중일 때는 파일 시스템의 ACL 지원을 변경할 수 없다는 의미이기도 합니다.

source: Setting the superblock flag causes the file system to always be mounted with ACLs enabled, even if there is not an [.filename]#fstab# entry or if the devices re-order. This prevents accidental mounting of the file system without ACL support.
ko: 슈퍼블록 플래그를 설정하면 [.filename]#fstab# 항목이 없거나 장치 순서가 바뀌더라도 파일 시스템이 항상 ACL이 활성화된 상태로 마운트됩니다. 이렇게 하면 ACL이 지원되지 않는 파일 시스템이 실수로 마운트되는 것을 방지할 수 있습니다.

source: It is desirable to discourage accidental mounting without ACLs enabled because nasty things can happen if ACLs are enabled, then disabled, then re-enabled without flushing the extended attributes. In general, once ACLs are enabled on a file system, they should not be disabled, as the resulting file protections may not be compatible with those intended by the users of the system, and re-enabling ACLs may re-attach the previous ACLs to files that have since had their permissions changed, resulting in unpredictable behavior.
ko: ACL을 사용하도록 설정했다가 비활성화했다가 확장 속성을 플러시하지 않고 다시 사용하도록 설정하면 불쾌한 일이 발생할 수 있으므로 ACL을 사용하지 않고 마운트하지 않는 것이 바람직합니다. 일반적으로 파일 시스템에서 ACL을 사용하도록 설정하면 그 결과 파일 보호가 시스템 사용자가 의도한 것과 호환되지 않을 수 있으며, ACL을 다시 사용하도록 설정하면 권한이 변경된 파일에 이전 ACL이 다시 적용되어 예측할 수 없는 동작이 발생할 수 있으므로 비활성화 시켜서는 안 됩니다.

source: File systems with ACLs enabled will show a plus (`+`) sign in their permission settings:
ko: ACL이 활성화된 파일 시스템에는 권한 설정에 더하기(`+`) 기호가 표시됩니다:

source: In this example, [.filename]#directory1#, [.filename]#directory2#, and [.filename]#directory3# are all taking advantage of ACLs, whereas [.filename]#private# and [.filename]#public_html# are not.
ko: 이 예제에서 [.filename]#directory1#, [.filename]#directory2#, [.filename]#directory3#은 모두 ACL을 활용하고 있지만 [.filename]#private#과 [.filename]#public_html#은 활용하지 않습니다.

source: Using ACLs
ko: ACL 사용하기

source: File system ACLs can be viewed using `getfacl`. For instance, to view the ACL settings on [.filename]#test#:
ko: 파일 시스템 ACL은 `getfacl`을 사용하여 볼 수 있습니다. 예를 들어, [.filename]#test#의 ACL 설정을 보려면:

source: To change the ACL settings on this file, use `setfacl`. To remove all of the currently defined ACLs from a file or file system, include `-k`. However, the preferred method is to use `-b` as it leaves the basic fields required for ACLs to work.
ko: 이 파일에 대한 ACL 설정을 변경하려면 `setfacl`을 사용합니다. 파일 또는 파일 시스템에서 현재 정의된 모든 ACL을 제거하려면 `-k`를 포함합니다. 그러나 `-b`를 사용하면 ACL이 작동하는 데 필요한 기본 필드는 그대로 유지되므로 권장되는 방법입니다.

source: To modify the default ACL entries, use `-m`:
ko: 기본 ACL 항목을 수정하려면 `-m`을 사용합니다:

source: In this example, there were no pre-defined entries, as they were removed by the previous command. This command restores the default options and assigns the options listed. If a user or group is added which does not exist on the system, an `Invalid argument` error will be displayed.
ko: 이 예에서는 이전 명령에 의해 제거되었으므로 사전 정의된 항목이 없습니다. 이 명령은 기본 옵션을 복원하고 나열된 옵션을 할당합니다. 시스템에 존재하지 않는 사용자 또는 그룹을 추가하면 `Invalid argument` 오류가 표시됩니다.

source: Refer to man:getfacl[1] and man:setfacl[1] for more information about the options available for these commands.
ko: 이러한 명령에 사용할 수 있는 옵션에 대한 자세한 내용은 man:getfacl[1] 및 man:setfacl[1]을 참조하세요.
ru: Обратитесь к man:getfacl[1] и man:setfacl[1] для получения дополнительной информации о доступных опциях этих команд.

source: Monitoring Third Party Security Issues
ko: 타사 보안 문제 모니터링
ru: Мониторинг проблем безопасности приложений сторонних разработчиков
