Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: The second method is to prevent login access by changing the shell to [.filename]#/usr/sbin/nologin#. The man:nologin[8] shell prevents the system from assigning a shell to the user when they attempt to login.
ru: Второй способ — запретить вход в систему, изменив оболочку на [.filename]#/usr/sbin/nologin#. Оболочка man:nologin[8] предотвращает назначение оболочки пользователю при попытке входа в систему.

source: Only the superuser can change the shell for other users:
ru: Только суперпользователь может изменить оболочку для других пользователей:

source: Passwords are a necessary evil of technology. When they must be used, they should be complex and a powerful hash mechanism should be used to encrypt the version that is stored in the password database. FreeBSD supports several algorithms, including SHA256, SHA512 and Blowfish hash algorithms in its `crypt()` library, see man:crypt[3] for details.
ru: Пароли — это неизбежное зло в мире технологий. Когда их использование необходимо, они должны быть сложными, а для хранения зашифрованной версии в базе данных паролей следует использовать надежный механизм хеширования. FreeBSD поддерживает несколько алгоритмов, включая SHA256, SHA512 и Blowfish, в своей библиотеке `crypt()`. Подробности можно найти в man:crypt[3].

source: The default of SHA512 should not be changed to a less secure hashing algorithm, but can be changed to the more secure Blowfish algorithm.
ru: По умолчанию используется SHA512, и его не следует заменять на менее безопасный алгоритм хеширования, но можно перейти на более безопасный алгоритм Blowfish.

source: To determine which hash algorithm is used to encrypt a user's password, the superuser can view the hash for the user in the FreeBSD password database. Each hash starts with a symbol which indicates the type of hash mechanism used to encrypt the password.
ru: Для определения того, какой алгоритм хеширования используется для шифрования пароля пользователя, суперпользователь может просмотреть хеш пользователя в базе данных паролей FreeBSD. Каждый хеш начинается с символа, который указывает на тип механизма хеширования, использованного для шифрования пароля.

source: If DES is used, there is no beginning symbol. For MD5, the symbol is `$`. For SHA256 and SHA512, the symbol is `$6$`. For Blowfish, the symbol is `$2a$`. In this example, the password for `imani` is hashed using the default SHA512 algorithm as the hash starts with `$6$`. Note that the encrypted hash, not the password itself, is stored in the password database:
ru: Если используется DES, начальный символ отсутствует. Для MD5 символ — `$`. Для SHA256 и SHA512 символ — `$6$`. Для Blowfish символ — `$2a$`. В этом примере пароль для `imani` хеширован с использованием алгоритма SHA512 по умолчанию, так как хеш начинается с `$6$`. Обратите внимание, что в базе данных паролей хранится зашифрованный хеш, а не сам пароль:

source: The hash mechanism is set in the user's login class.
ru: Механизм хеширования задается в классе входа пользователя.

source: The following command can be run to check which hash mechanism is currently being used:
ru: Следующая команда позволяет проверить, какой механизм хеширования используется в данный момент:

source: For example, to change the algorithm to Blowfish, modify that line to look like this:
ru: Например, чтобы изменить алгоритм на Blowfish, измените эту строку следующим образом:

source: Then, man:cap_mkdb[1] must be executed to upgrade the login.conf database:
ru: Затем необходимо выполнить man:cap_mkdb[1] для обновления базы данных login.conf:

source: Note that this change will not affect any existing password hashes. This means that all passwords should be re-hashed by asking users to run `passwd` in order to change their password.
ru: Обратите внимание, что это изменение не затронет существующие хэши паролей. Это означает, что все пароли должны быть перехэшированы, для чего пользователям необходимо запустить `passwd`, чтобы изменить свой пароль.

source: This section demonstrates how to configure the minimum and maximum password length and the enforcement of mixed characters using the man:pam_passwdqc[8] module. This module is enforced when a user changes their password.
ru: Этот раздел демонстрирует, как настроить минимальную и максимальную длину пароля, а также принудительное использование смешанных символов с помощью модуля man:pam_passwdqc[8]. Данный модуль применяется при изменении пользователем своего пароля.

source: To configure this module, become the superuser and uncomment the line containing `pam_passwdqc.so` in [.filename]#/etc/pam.d/passwd#.
ru: Для настройки этого модуля станьте суперпользователем и раскомментируйте строку с `pam_passwdqc.so` в [.filename]#/etc/pam.d/passwd#.

source: Then, edit that line to match the password policy:
ru: Затем отредактируйте эту строку в соответствии с политикой паролей:

source: The explanation of the parameters can be found in man:pam_passwdqc[8].
ru: Описание параметров можно найти в man:pam_passwdqc[8].

source: If your organization's policy requires passwords to expire, FreeBSD supports the `passwordtime` in the user's login class in [.filename]#/etc/login.conf#
ru: Если политика вашей организации требует, чтобы пароли имели срок действия, FreeBSD поддерживает параметр `passwordtime` в классе пользователя в [.filename]#/etc/login.conf#

source: The `default` login class contains an example:
ru: Класс входа `default` содержит пример:

source: So, to set an expiry of 90 days for this login class, remove the comment symbol (#), save the edit, and execute the following command:
ru: Итак, чтобы установить срок действия в 90 дней для этого класса входа, удалите символ комментария (#), сохраните изменения и выполните следующую команду:

source: Shared Administration with sudo
ru: Совместное администрирование с помощью sudo

source: Even administrators should limit their privileges when not needed.
ru: Даже администраторы должны ограничивать свои привилегии, когда в них нет необходимости.

source: Sudo allows administrators to configure more rigid access to system commands and provide for some advanced logging features. As a tool, it is available from the Ports Collection as package:security/sudo[] or by use of the man:pkg[8] utility.
ru: Sudo позволяет администраторам настраивать более строгий доступ к системным командам и обеспечивать дополнительные функции ведения журналов. Этот инструмент доступен в коллекции портов как package:security/sudo[] или с помощью утилиты man:pkg[8].

source: Execute the following command to install it:
ru: Выполните следующую команду для установки:

source: Unlike man:su[1], man:sudo[8] only requires the end user password. This avoids sharing passwords, which is a poor practice.
ru: В отличие от man:su[1], man:sudo[8] требует только пароль конечного пользователя. Это позволяет избежать совместного использования паролей, что является небезопасной практикой.

source: Users permitted to run applications with man:sudo[8] only enter their own passwords. This is more secure and gives better control than man:su[1], where the `root` password is entered and the user acquires all `root` permissions.
ru: Пользователи, которым разрешено запускать приложения с помощью man:sudo[8], вводят только свои собственные пароли. Это более безопасно и обеспечивает лучший контроль, чем man:su[1], где вводится пароль `root` и пользователь получает все права `root`.

source: Most organizations are moving or have moved toward a two factor authentication model. In these cases, the user may not have a password to enter.
ru: Большинство организаций переходят или уже перешли на модель двухфакторной аутентификации. В таких случаях у пользователя может не быть пароля для ввода.

source: man:sudo[8] can be configured to permit two factor authentication model by using the `NOPASSWD` variable. Adding it to the configuration above will allow all members of the _webteam_ group to manage the service without the password requirement:
ru: man:sudo[8] можно настроить для поддержки двухфакторной модели аутентификации с использованием переменной `NOPASSWD`. Добавление её в приведённую выше конфигурацию позволит всем членам группы _webteam_ управлять службой без требования пароля:

source: Shared Administration with Doas
ru: Совместное администрирование с Doas

source: man:doas[1] is a command-line utility ported from OpenBSD. It serves as an alternative to the widely used man:sudo[8] command in Unix-like systems.
ru: man:doas[1] - это утилита командной строки, портированная из OpenBSD. Она служит альтернативой широко используемой команде man:sudo[8] в Unix-подобных системах.

source: With doas, users can execute commands with elevated privileges, typically as the root user, while maintaining a simplified and security-conscious approach. Unlike man:sudo[8], doas emphasizes simplicity and minimalism, focusing on streamlined privilege delegation without an overwhelming array of configuration options.
ru: С помощью `doas` пользователи могут выполнять команды с повышенными привилегиями, обычно от имени пользователя `root`, сохраняя при этом простой и безопасный подход. В отличие от man:sudo[8], `doas` делает акцент на простоте и минимализме, предлагая лаконичное делегирование полномочий без избыточного количества настройки.

source: The simplest entry could be the following, which grants the user `local_user` with `root` permissions without asking for its password when executing the doas command.
ru: Самый простой вариант может выглядеть следующим образом, который предоставляет пользователю `local_user` права `root` без запроса пароля при выполнении команды doas.

source: After the installation and configuration of the `doas` utility, a command can now be executed with enhanced privileges, for example:
ru: После установки и настройки утилиты `doas` команда теперь может быть выполнена с повышенными привилегиями, например:

source: Intrusion Detection System (IDS)
ru: Система обнаружения вторжений (IDS)

source: FreeBSD provides native support for a basic IDS system called man:mtree[8]. While the nightly security emails will notify an administrator of changes, the information is stored locally and there is a chance that a malicious user could modify this information in order to hide their changes to the system. As such, it is recommended to create a separate set of binary signatures and store them on a read-only, root-owned directory or, preferably, on a removable USB disk or remote server.
ru: FreeBSD предоставляет встроенную поддержку базовой системы IDS под названием man:mtree[8]. Хотя ежедневные письма с информацией о безопасности уведомят администратора об изменениях, эти данные хранятся локально, и существует вероятность, что злоумышленник может изменить их, чтобы скрыть свои изменения в системе. Поэтому рекомендуется создать отдельный набор бинарных сигнатур и хранить их в предназначенном только для чтения каталоге, принадлежащем root, или, предпочтительно, на съёмном USB-диске или удалённом сервере.

source: It is also recommended to run `freebsd-update IDS` after each update.
ru: Также рекомендуется запускать `freebsd-update IDS` после каждого обновления.

source: Generating the Specification File
ru: Генерация файла спецификации

source: The built-in man:mtree[8] utility can be used to generate a specification of the contents of a directory. A seed, or a numeric constant, is used to generate the specification and is required to check that the specification has not changed. This makes it possible to determine if a file or binary has been modified. Since the seed value is unknown by an attacker, faking or checking the checksum values of files will be difficult to impossible.
ru: Встроенная утилита man:mtree[8] может использоваться для создания спецификации содержимого каталога. Спецификация генерируется с использованием начального значения (seed) — числовой константы, которая также необходима для проверки неизменности спецификации. Это позволяет определить, был ли изменён файл или бинарный файл. Поскольку злоумышленник не знает начальное значение, подделать или проверить контрольные суммы файлов будет крайне сложно или невозможно.

source: The following example generates a set of `sha512` hashes, one for each system binary in [.filename]#/bin#, and saves those values to a hidden file in user's home directory, [.filename]#/home/user/.bin_chksum_mtree#:
ru: Следующий пример создает набор хешей `sha512` — по одному для каждого системного бинарного файла в [.filename]#/bin# — и сохраняет эти значения в скрытый файл в домашней директории пользователя [.filename]#/home/user/.bin_chksum_mtree#:

source: The `123456789` value represents the seed, and should be chosen randomly. This value should be remembered, *but not shared*.
ru: Значение `123456789` представляет собой зерно (seed) и должно быть выбрано случайным образом. Этот параметр необходимо запомнить, *но не раскрывать*.

source: It is important to keep the seed value and the checksum output hidden from malicious users.
ru: Важно скрывать начальное значение и контрольную сумму от злоумышленников.

source: The Specification File Structure
ru: Структура Файла Спецификации

source: The mtree format is a textual format that describes a collection of filesystem objects. Such files are typically used to create or verify directory hierarchies.
ru: Формат `mtree` — это текстовый формат, описывающий набор объектов файловой системы. Такие файлы обычно используются для создания или проверки иерархий каталогов.

source: An mtree file consists of a series of lines, each providing information about a single filesystem object. Leading whitespace is always ignored.
ru: Файл mtree состоит из серии строк, каждая из которых содержит информацию об отдельном объекте файловой системы. Начальные пробельные символы всегда игнорируются.

source: The specification file created above will be used to explain the format and content:
ru: Созданный выше файл спецификации будет использоваться для объяснения формата и содержания:

source: User who created the specification.
ru: Пользователь, создавший спецификацию.

source: Machine's hostname.
ru: Имя хоста машины.

source: Directory path.
ru: Путь к каталогу.

source: The Date and time when the specification was created.
ru: Дата и время создания спецификации.

source: `/set` special commands, defines some settings obtained from the files analyzed.
ru: `/set` специальные команды, определяют некоторые настройки, полученные из проанализированных файлов.

source: Refers to the parsed directory and indicates things like what type it is, its mode, the number of hard links, and the time in UNIX format since it was modified.
ru: Ссылается на разобранный каталог и указывает такие параметры, как его тип, режим доступа, количество жёстких ссылок и время изменения в формате UNIX.

source: Refers to the file and shows the size, time and a list of hashes to verify the integrity.
ru: Ссылается на файл и показывает его размер, время и список хешей для проверки целостности.

source: Verify the Specification file
ru: Проверка файла спецификации

source: To verify that the binary signatures have not changed, compare the current contents of the directory to the previously generated specification, and save the results to a file.
ru: Для проверки неизменности бинарных сигнатур сравните текущее содержимое каталога с ранее созданной спецификацией и сохраните результаты в файл.

source: This command requires the seed that was used to generate the original specification:
ru: Эта команда требует начальное значение, которое использовалось для создания исходной спецификации:

source: This should produce the same checksum for [.filename]#/bin# that was produced when the specification was created. If no changes have occurred to the binaries in this directory, the [.filename]#/home/user/.bin_chksum_output# output file will be empty.
ru: Это должно дать такую же контрольную сумму для [.filename]#/bin#, какая была получена при создании спецификации. Если в каталоге не было изменений бинарных файлов, выходной файл [.filename]#/home/user/.bin_chksum_output# будет пустым.

source: To simulate a change, change the date on [.filename]#/bin/cat# using man:touch[1] and run the verification command again:
ru: Для имитации изменения измените дату файла [.filename]#/bin/cat# с помощью man:touch[1] и снова выполните команду проверки:

source: Run the verification command again:
ru: Выполните команду проверки еще раз:

source: And then check the content of the output file:
ru: И затем проверьте содержимое выходного файла:

source: This is just an example of what would be displayed when executing the command, to show the changes that would occur in the metadata.
ru: Это просто пример того, что будет отображено при выполнении команды, чтобы показать изменения, которые произойдут в метаданных.

source: Secure levels
ru: Уровни безопасности

source: securelevel is a security mechanism implemented in the kernel. When the securelevel is positive, the kernel restricts certain tasks; not even the superuser (root) is allowed to do them.
ru: securelevel — это механизм безопасности, реализованный в ядре. Когда securelevel имеет положительное значение, ядро ограничивает выполнение определенных задач; даже суперпользователь (root) не может их выполнять.

source: The securelevel mechanism limits the ability to:
ru: Механизм securelevel ограничивает возможность:

source: Unset certain file flags, such as `schg` (the system immutable flag).
ru: Снять определенные флаги файлов, такие как `schg` (флаг системной неизменяемости).

source: Write to kernel memory via [.filename]#/dev/mem# and [.filename]#/dev/kmem#.
ru: Записать в память ядра через [.filename]#/dev/mem# и [.filename]#/dev/kmem#.

source: Load kernel modules.
ru: Загрузить модули ядра.

source: Alter firewall rules.
ru: Изменить правила межсетевого экрана.

source: Secure Levels Definitions
ru: Определения уровней безопасности

source: The kernel runs with five different security levels. Any super-user process can raise the level, but no process can lower it.
ru: Ядро работает с пятью различными уровнями безопасности. Любой процесс с правами суперпользователя может повысить уровень, но ни один процесс не может его понизить.

source: The security definitions are:
ru: Определения безопасности следующие:

source: In summary, the key difference between `Permanently Insecure Mode` and `Insecure Mode` in FreeBSD secure levels is the degree of security they provide. `Permanently Insecure Mode` completely lifts all security restrictions, while `Insecure Mode` relaxes some restrictions but still maintains a level of control and security.
ru: Вкратце, ключевое различие между `Режимом постоянной незащищённости` и `Незащищённым режимом` в уровнях безопасности FreeBSD заключается в степени предоставляемой защиты. `Режим постоянной незащищённости` полностью снимает все ограничения безопасности, тогда как `Незащищённый режим` ослабляет некоторые ограничения, но сохраняет определённый уровень контроля и защиты.

source: Modify Secure Levels
ru: Изменение уровней безопасности

source: In order to change the securelevel of the system it is necessary to activate `kern_securelevel_enable` by executing the following command:
ru: Для изменения securelevel системы необходимо активировать `kern_securelevel_enable`, выполнив следующую команду:

source: And set the value of `kern_securelevel` to the desired security level:
ru: И установите значение `kern_securelevel` на желаемый уровень безопасности:

source: To check the status of the securelevel on a running system execute the following command:
ru: Для проверки уровня безопасности (securelevel) в работающей системе выполните следующую команду:

source: The output contains the current value of the securelevel. If it is greater than 0, at least some of the securelevel's protections are enabled.
ru: Вывод содержит текущее значение уровня securelevel. Если оно больше 0, значит, включена по крайней мере часть защит securelevel.

source: File flags
ru: Флаговые атрибуты файлов

source: File flags allow users to attach additional metadata or attributes to files and directories beyond basic permissions and ownership. These flags provide a way to control various behaviors and properties of files without needing to resort to creating special directories or using extended attributes.
ru: Флаги файлов позволяют пользователям добавлять дополнительные метаданные или атрибуты к файлам и каталогам, помимо базовых прав доступа и владения. Эти флаги предоставляют способ управления различными поведениями и свойствами файлов без необходимости создавать специальные каталоги или использовать расширенные атрибуты.

source: File flags can be used to achieve different goals, such as preventing file deletion, making files append-only, synchronizing file updates, and more. Some commonly used file flags in FreeBSD include the "immutable" flag, which prevents modification or deletion of a file, and the "append-only" flag, which allows only data to be added to the end of a file but not modified or removed.
ru: Флаги файлов могут использоваться для достижения различных целей, таких как предотвращение удаления файла, разрешение только дополнения файла, синхронизация обновлений файлов и многое другое. Некоторые часто используемые флаги файлов в FreeBSD включают флаг "immutable", который запрещает изменение или удаление файла, и флаг "append-only", который разрешает только добавление данных в конец файла, но не их изменение или удаление.

source: These flags can be managed using the man:chflags[1] command in FreeBSD, providing administrators and users with greater control over the behavior and characteristics of their files and directories. It is important to note that file flags are typically managed by root or users with appropriate privileges, as they can influence how files are accessed and manipulated. Some flags are available for the use of the file's owner, as described in man:chflags[1].
ru: Эти флаги можно управлять с помощью команды man:chflags[1] в FreeBSD, что предоставляет администраторам и пользователям больший контроль над поведением и характеристиками их файлов и каталогов. Важно отметить, что флаги файлов обычно управляются root или пользователями с соответствующими привилегиями, так как они могут влиять на доступ и манипуляции с файлами. Некоторые флаги доступны для использования владельцем файла, как описано в man:chflags[1].

source: Work with File Flags
ru: Работа с флагами файлов

source: In this example, a file named [.filename]#~/important.txt# in user's home directory want to be protected against deletions.
ru: В этом примере файл с именем [.filename]#~/important.txt# в домашнем каталоге пользователя необходимо защитить от удаления.

source: Execute the following command to set the `schg` file flag:
ru: Выполните следующую команду, чтобы установить флаг файла `schg`:

source: When any user, including the `root` user, tries to delete the file, the system will display the message:
ru: Когда любой пользователь, включая пользователя `root`, пытается удалить файл, система отобразит сообщение:

source: To delete the file, it will be necessary to delete the file flags of that file by executing the following command:
ru: Чтобы удалить файл, необходимо сначала удалить его флаги, выполнив следующую команду:

source: A list of supported file flags and their functionality can be found in man:chflags[1].
ru: Список поддерживаемых флагов файлов и их функциональность можно найти в man:chflags[1].
