Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: In recent years, the security world has made many improvements to how vulnerability assessment is handled. The threat of system intrusion increases as third party utilities are installed and configured for virtually any operating system available today.
ko: 최근 몇 년 동안 보안 업계에서는 취약성 평가 처리 방식을 많이 개선했습니다. 현재 사용 가능한 거의 모든 운영 체제에 대해 타사 유틸리티가 설치 및 구성됨에 따라 시스템 침입의 위협이 증가하고 있습니다.
ru: В последние годы в сфере безопасности было внесено множество улучшений в методы оценки уязвимостей. Угроза взлома системы возрастает по мере установки и настройки сторонних утилит практически для любой доступной сегодня операционной системы.

source: Vulnerability assessment is a key factor in security. While FreeBSD releases advisories for the base system, doing so for every third party utility is beyond the FreeBSD Project's capability. There is a way to mitigate third party vulnerabilities and warn administrators of known security issues. A FreeBSD add on utility known as pkg includes options explicitly for this purpose.
ko: 취약성 평가는 보안의 핵심 요소입니다. FreeBSD는 기본 시스템에 대한 권고사항을 발표하지만, 모든 타사 유틸리티에 대한 권고사항을 발표하는 것은 FreeBSD 프로젝트의 역량을 넘어서는 일입니다. 타사 취약성을 완화하고 관리자에게 알려진 보안 문제를 경고하는 방법이 있습니다. pkg로 알려진 FreeBSD 애드온 유틸리티에는 이러한 목적을 위한 옵션이 명시적으로 포함되어 있습니다.
ru: Оценка уязвимостей является ключевым фактором в обеспечении безопасности. Хотя FreeBSD выпускает рекомендации для базовой системы, делать это для каждой сторонней утилиты выходит за рамки возможностей проекта FreeBSD. Существует способ снизить риски уязвимостей стороннего ПО и предупредить администраторов о известных проблемах безопасности. Дополнительная утилита FreeBSD, известная как `pkg`, включает возможности, предназначенные именно для этой цели.

source: pkg polls a database for security issues. The database is updated and maintained by the FreeBSD Security Team and ports developers.
ko: pkg는 데이터베이스에서 보안 문제를 조사합니다. 데이터베이스는 FreeBSD 보안 팀과 포트 개발자가 업데이트하고 유지 관리합니다.
ru: pkg опрашивает базу данных на наличие уязвимостей безопасности. База данных обновляется и поддерживается командой FreeBSD Security Team и разработчиками портов.

source: Please refer to crossref:ports[pkgng-intro,instructions] for installing pkg.
ko: pkg 설치에 대한 자세한 내용은 crossref:ports[pkgng-intro,instructions]을 참조하세요.

source: Installation provides man:periodic[8] configuration files for maintaining the pkg audit database, and provides a programmatic method of keeping it updated. This functionality is enabled if `daily_status_security_pkgaudit_enable` is set to `YES` in man:periodic.conf[5]. Ensure that daily security run emails, which are sent to ``root``'s email account, are being read.
ko: 설치는 pkg 감사 데이터베이스를 유지 관리하기 위한 man:periodic[8] 구성 파일을 제공하며, 이를 업데이트하는 프로그래밍 방법을 제공합니다. 이 기능은 man:periodic.conf[5]에서 `daily_status_security_pkgaudit_enable`을 `YES`로 설정하면 활성화됩니다. ``root``의 이메일 계정으로 전송되는 일일 보안 실행 이메일이 읽히고 있는지 확인합니다.

source: After installation, and to audit third party utilities as part of the Ports Collection at any time, an administrator may choose to update the database and view known vulnerabilities of installed packages by invoking:
ko: 설치 후 언제든지 포트 컬렉션의 일부로 타사 유틸리티를 감사하기 위해 관리자는 데이터베이스를 업데이트하고 설치된 패키지의 알려진 취약성을 확인하도록 선택할 수 있습니다:
ru: После установки, а также для проверки сторонних утилит из Коллекции портов в любое время, администратор может обновить базу данных и просмотреть известные уязвимости установленных пакетов, выполнив:

source: pkg displays messages any published vulnerabilities in installed packages:
ko: pkg는 설치된 패키지에 게시된 모든 취약점을 메시지로 표시합니다:

source: By pointing a web browser to the displayed URL, an administrator may obtain more information about the vulnerability. This will include the versions affected, by FreeBSD port version, along with other web sites which may contain security advisories.
ko: 관리자는 웹 브라우저로 표시된 URL을 가리키면 해당 취약점에 대한 자세한 정보를 얻을 수 있습니다. 여기에는 영향을 받는 버전, FreeBSD 포트 버전, 보안 권고가 포함될 수 있는 다른 웹사이트가 포함됩니다.

source: pkg is a powerful utility and is extremely useful when coupled with package:ports-mgmt/portmaster[].
ko: pkg는 강력한 유틸리티이며 package:ports-mgmt/portmaster[]와 함께 사용하면 매우 유용합니다.

source: FreeBSD Security Advisories
ko: FreeBSD 보안 권고사항
ru: Рекомендации по безопасности FreeBSD

source: Like many producers of quality operating systems, the FreeBSD Project has a security team which is responsible for determining the End-of-Life (EoL) date for each FreeBSD release and to provide security updates for supported releases which have not yet reached their EoL. More information about the FreeBSD security team and the supported releases is available on the link:https://www.FreeBSD.org/security[FreeBSD security page].
ko: 많은 고품질 운영 체제 제작자들과 마찬가지로, FreeBSD 프로젝트에는 각 FreeBSD 릴리스의 종료일(EoL)을 결정하고 아직 종료일에 도달하지 않은 지원 릴리스에 대한 보안 업데이트를 제공하는 보안 팀이 있습니다. FreeBSD 보안 팀과 지원되는 릴리스에 대한 자세한 정보는 https://www.FreeBSD.org/security[FreeBSD 보안 페이지] 링크에서 확인할 수 있습니다.
ru: Как и многие разработчики качественных операционных систем, проект FreeBSD имеет команду безопасности, которая отвечает за определение даты окончания срока службы (EoL) для каждого выпуска FreeBSD и предоставляет обновления безопасности для поддерживаемых выпусков, которые ещё не достигли своего EoL. Дополнительная информация о команде безопасности FreeBSD и поддерживаемых выпусках доступна на странице link:https://www.FreeBSD.org/security[безопасности FreeBSD].

source: One task of the security team is to respond to reported security vulnerabilities in the FreeBSD operating system. Once a vulnerability is confirmed, the security team verifies the steps necessary to fix the vulnerability and updates the source code with the fix. It then publishes the details as a "Security Advisory". Security advisories are published on the link:https://www.FreeBSD.org/security/advisories/[FreeBSD website] and mailed to the {freebsd-security-notifications}, {freebsd-security}, and {freebsd-announce} mailing lists.
ko: 보안팀의 업무 중 하나는 보고된 FreeBSD 운영체제의 보안 취약점에 대응하는 것입니다. 취약점이 확인되면 보안팀은 취약점을 수정하는 데 필요한 단계를 확인하고 수정 사항이 포함된 소스 코드를 업데이트합니다. 그런 다음 세부 사항을 ‘보안 권고’로 게시합니다. 보안 권고문은 https://www.FreeBSD.org/security/advisories/[FreeBSD 웹사이트] 링크에 게시되며 {freebsd-security-notifications}, {freebsd-security} 및 {freebsd-announce} 메일링 리스트에 발송됩니다.

source: This section describes the format of a FreeBSD security advisory.
ko: 이 섹션에서는 FreeBSD 보안 권고의 형식을 설명합니다.

source: Format of a Security Advisory
ko: 보안 권고 형식
ru: Формат рекомендации по безопасности

source: Here is an example of a FreeBSD security advisory:
ko: 다음은 FreeBSD 보안 권고의 예입니다:
ru: Вот пример рекомендации по безопасности FreeBSD:

source: Every security advisory uses the following format:
ko: 모든 보안 권고에는 다음 형식이 사용됩니다:
ru: Каждый бюллетень безопасности использует следующий формат:

source: Each security advisory is signed by the PGP key of the Security Officer. The public key for the Security Officer can be verified at crossref:pgpkeys[pgpkeys,OpenPGP Keys].
ko: 각 보안 권고에는 보안 담당자의 PGP 키가 서명되어 있습니다. 보안 담당자의 공개 키는 crossref:pgpkeys[pgpkeys,OpenPGP Keys]에서 확인할 수 있습니다.
ru: Каждое уведомление о безопасности подписано PGP-ключом офицера безопасности. Открытый ключ офицера безопасности можно проверить в crossref:pgpkeys[pgpkeys,OpenPGP Keys].

source: The name of the security advisory always begins with `FreeBSD-SA-` (for FreeBSD Security Advisory), followed by the year in two digit format (`14:`), followed by the advisory number for that year (`04.`), followed by the name of the affected application or subsystem (`bind`). The advisory shown here is the fourth advisory for 2014 and it affects BIND.
ko: 보안 권고의 이름은 항상 `FreeBSD-SA-`(FreeBSD 보안 권고의 경우)로 시작하고, 두 자리 형식의 연도(`14:`), 해당 연도의 권고 번호(`04.`), 영향을 받는 애플리케이션 또는 서브시스템의 이름(`bind`)이 이어집니다. 여기에 표시된 권고 사항은 2014년에 대한 네 번째 권고 사항이며 BIND에 영향을 줍니다.

source: The `Topic` field summarizes the vulnerability.
ko: ‘Topic’ 필드에는 취약점이 요약되어 있습니다.
ru: Поле `Topic` содержит краткое описание уязвимости.

source: The `Category` refers to the affected part of the system which may be one of `core`, `contrib`, or `ports`. The `core` category means that the vulnerability affects a core component of the FreeBSD operating system. The `contrib` category means that the vulnerability affects software included with FreeBSD, such as BIND. The `ports` category indicates that the vulnerability affects software available through the Ports Collection.
ko: `Category`는 시스템의 영향을 받는 부분을 의미하며, `core`, `contrib` 또는 `ports` 중 하나일 수 있습니다. `core` 카테고리는 취약점이 FreeBSD 운영 체제의 핵심 구성 요소에 영향을 미친다는 것을 의미합니다. `contrib` 카테고리는 취약점이 BIND와 같이 FreeBSD에 포함된 소프트웨어에 영향을 미친다는 것을 의미합니다. `ports` 카테고리는 취약점이 포트 컬렉션을 통해 제공되는 소프트웨어에 영향을 미친다는 것을 나타냅니다.
ru: `Category` относится к затронутой части системы, которая может быть одной из следующих: `core`, `contrib` или `ports`. Категория `core` означает, что уязвимость затрагивает основной компонент операционной системы FreeBSD. Категория `contrib` означает, что уязвимость затрагивает программное обеспечение, включённое в состав FreeBSD, например BIND. Категория `ports` указывает, что уязвимость затрагивает программное обеспечение, доступное через Коллекцию портов.

source: The `Module` field refers to the component location. In this example, the `bind` module is affected; therefore, this vulnerability affects an application installed with the operating system.
ko: `Module` 필드는 컴포넌트 위치를 나타냅니다. 이 예에서는 `bind` 모듈이 영향을 받으므로 이 취약점은 운영 체제와 함께 설치된 애플리케이션에 영향을 미칩니다.

source: The `Announced` field reflects the date the security advisory was published. This means that the security team has verified that the problem exists and that a patch has been committed to the FreeBSD source code repository.
ko: `Announced` 필드는 보안 권고가 발표된 날짜를 반영합니다. 이는 보안 팀이 해당 문제가 존재하고 패치가 FreeBSD 소스 코드 저장소에 커밋되었음을 확인했음을 의미합니다.
ru: Поле `Announced` указывает дату публикации уведомления о безопасности. Это означает, что команда безопасности подтвердила наличие проблемы и что исправление было добавлено в репозиторий исходного кода FreeBSD.

source: The `Credits` field gives credit to the individual or organization who noticed the vulnerability and reported it.
ko: `Credits` 필드에는 취약점을 발견하고 신고한 개인 또는 조직에 대한 크레딧이 표시됩니다.
ru: Поле `Credits` указывает на человека или организацию, которые обнаружили уязвимость и сообщили о ней.

source: The `Affects` field explains which releases of FreeBSD are affected by this vulnerability.
ko: `Affects` 필드에는 이 취약점에 영향을 받는 FreeBSD 릴리스가 설명되어 있습니다.
ru: Поле `Affects` указывает, какие выпуски FreeBSD подвержены данной уязвимости.

source: The `Corrected` field indicates the date, time, time offset, and releases that were corrected. The section in parentheses shows each branch for which the fix has been merged, and the version number of the corresponding release from that branch. The release identifier itself includes the version number and, if appropriate, the patch level. The patch level is the letter `p` followed by a number, indicating the sequence number of the patch, allowing users to track which patches have already been applied to the system.
ko: `Corrected` 필드에는 수정된 날짜, 시간, 시간 오프셋 및 릴리스가 표시됩니다. 괄호 안의 섹션에는 수정 사항이 병합된 각 브랜치와 해당 브랜치에서 해당 릴리스의 버전 번호가 표시됩니다. 릴리스 식별자 자체에는 버전 번호와 적절한 경우 패치 레벨이 포함됩니다. 패치 레벨은 문자 ‘p’ 뒤에 숫자가 붙어 패치의 시퀀스 번호를 나타내며, 사용자가 시스템에 이미 적용된 패치를 추적할 수 있습니다.
ru: Поле `Corrected` указывает дату, время, смещение времени и версии, в которых была исправлена ошибка. Раздел в скобках показывает каждую ветку, в которую было внесено исправление, и номер версии соответствующего выпуска из этой ветки. Идентификатор выпуска включает номер версии и, если необходимо, уровень патча. Уровень патча обозначается буквой `p` с последующим числом, указывающим порядковый номер патча, что позволяет пользователям отслеживать, какие патчи уже были применены к системе.

source: The `CVE Name` field lists the advisory number, if one exists, in the public http://cve.mitre.org[cve.mitre.org] security vulnerabilities database.
ko: `CVE Name` 필드에는 공개 http://cve.mitre.org[cve.mitre.org] 보안 취약성 데이터베이스에 있는 권고 번호가 있는 경우 해당 번호가 나열됩니다.
ru: Поле `CVE Name` содержит номер рекомендации, если он существует, в публичной базе данных уязвимостей безопасности http://cve.mitre.org[cve.mitre.org].

source: The `Background` field provides a description of the affected module.
ko: `Background` 필드에는 영향을 받는 모듈에 대한 설명이 제공됩니다.
ru: Поле `Background` содержит описание затронутого модуля.

source: The `Problem Description` field explains the vulnerability. This can include information about the flawed code and how the utility could be maliciously used.
ko: `Problem Description` 필드에는 취약점을 설명합니다. 여기에는 결함이 있는 코드와 유틸리티가 악의적으로 사용될 수 있는 방법에 대한 정보가 포함될 수 있습니다.
ru: Поле `Описание проблемы` поясняет уязвимость. Оно может содержать информацию о проблемном коде и о том, как утилита может быть использована злоумышленниками.

source: The `Impact` field describes what type of impact the problem could have on a system.
ko: `Impact` 필드에는 문제가 시스템에 미칠 수 있는 영향의 유형을 설명합니다.
ru: Поле `Impact` описывает, какой тип воздействия проблема может оказать на систему.

source: The `Workaround` field indicates if a workaround is available to system administrators who cannot immediately patch the system .
ko: `Workaround` 필드는 시스템 관리자가 시스템을 즉시 패치할 수 없는 경우 해결 방법을 사용할 수 있는지 여부를 나타냅니다.

source: The `Solution` field provides the instructions for patching the affected system. This is a step by step tested and verified method for getting a system patched and working securely.
ko: `Solution` 필드에는 영향을 받는 시스템에 패치를 적용하기 위한 지침이 제공됩니다. 이는 시스템을 패치하고 안전하게 작동시키기 위한 단계별 테스트 및 검증 방법입니다.
ru: Поле `Solution` содержит инструкции по исправлению уязвимости на затронутой системе. Это пошаговый проверенный метод, позволяющий обновить систему и обеспечить её безопасную работу.

source: The `Correction Details` field displays each affected Subversion branch with the revision number that contains the corrected code.
ko: `Correction Details` 필드에는 수정된 코드가 포함된 리비전 번호와 함께 영향을 받는 각 서브버전 브랜치가 표시됩니다.

source: The `References` field offers sources of additional information regarding the vulnerability.
ko: `References` 필드에는 취약점과 관련된 추가 정보의 출처가 나와 있습니다.
ru: Поле `References` содержит источники дополнительной информации об уязвимости.

source: Process Accounting
ko: 프로세스 통계 (Process Accounting)
ru: Учет процессов

source: Process accounting is a security method in which an administrator may keep track of system resources used and their allocation among users, provide for system monitoring, and minimally track a user's commands.
ko: 프로세스 통계는 관리자가 사용된 시스템 리소스와 사용자 간의 할당을 추적하고, 시스템 모니터링을 제공하며, 사용자의 명령을 최소한으로 추적할 수 있는 보안 방법입니다.
ru: Учёт процессов — это метод безопасности, при помощи которого администратор может отслеживать использование системных ресурсов и их распределение между пользователями, обеспечивать мониторинг системы и минимально фиксировать выполняемые пользователями команды.

source: Process accounting has both positive and negative points. One of the positives is that an intrusion may be narrowed down to the point of entry. A negative is the amount of logs generated by process accounting, and the disk space they may require. This section walks an administrator through the basics of process accounting.
ko: 프로세스 통계는 긍정적인 점과 부정적인 점이 모두 있습니다. 긍정적인 점 중 하나는 침입을 침입 지점까지 좁힐 수 있다는 점입니다. 단점은 프로세스 계정으로 인해 생성되는 로그의 양과 이에 필요한 디스크 공간입니다. 이 섹션에서는 관리자에게 프로세스 통계의 기본 사항을 안내합니다.
ru: Учет процессов имеет как положительные, так и отрицательные стороны. Один из плюсов заключается в том, что вторжение может быть локализовано до точки входа. Минус — это объем журналов, генерируемых учетом процессов, и дисковое пространство, которое они могут занять. В этом разделе рассматриваются основы учета процессов для администратора.

source: If more fine-grained accounting is needed, refer to crossref:audit[audit,Security Event Auditing].
ko: 더 세분화된 통계 처리가 필요한 경우 crossref:audit[감사,보안 이벤트 감사]를 참조하세요.
ru: Если требуется более детальный учёт, обратитесь к crossref:audit[audit,Аудит событий безопасности].

source: Enabling and Utilizing Process Accounting
ko: 프로세스 통계 활성화 및 활용
ru: Включение и использование учёта процессов

source: Before using process accounting, it must be enabled using the following commands:
ko: 프로세스 통계를 사용하기 전에 다음 명령을 사용하여 활성화해야 합니다:
ru: Прежде чем использовать учёт процессов, его необходимо включить с помощью следующих команд:

source: The accounting information is stored in files located in [.filename]#/var/account#, which is automatically created, if necessary, the first time the accounting service starts. These files contain sensitive information, including all the commands issued by all users. Write access to the files is limited to `root`, and read access is limited to `root` and members of the `wheel` group. To also prevent members of `wheel` from reading the files, change the mode of the [.filename]#/var/account# directory to allow access only by `root`.
ko: 계정 정보는 [.filename]#/var/account#에 있는 파일에 저장되며, 필요한 경우 계정 서비스를 처음 시작할 때 자동으로 생성됩니다. 이 파일에는 모든 사용자가 실행한 모든 명령을 포함한 민감한 정보가 포함되어 있습니다. 파일에 대한 쓰기 권한은 ‘root’로 제한되며, 읽기 권한은 ‘root’와 ‘wheel’ 그룹의 구성원으로 제한됩니다. `wheel`의 구성원이 파일을 읽지 못하도록 하려면 [.filename]#/var/account# 디렉터리의 모드를 변경하여 `root`만 액세스할 수 있도록 허용하세요.
ru: Информация учёта хранится в файлах, расположенных в [.filename]#/var/account#, который автоматически создаётся при необходимости при первом запуске службы учёта. Эти файлы содержат конфиденциальную информацию, включая все команды, выполненные всеми пользователями. Право записи в файлы ограничено для `root`, а право чтения — для `root` и членов группы `wheel`. Чтобы также запретить членам `wheel` читать эти файлы, измените режим доступа к каталогу [.filename]#/var/account#, разрешив доступ только для `root`.

source: Once enabled, accounting will begin to track information such as CPU statistics and executed commands. All accounting logs are in a non-human readable format which can be viewed using `sa`. If issued without any options, `sa` prints information relating to the number of per-user calls, the total elapsed time in minutes, total CPU and user time in minutes, and the average number of I/O operations. Refer to man:sa[8] for the list of available options which control the output.
ko: 활성화하면 프로세스가 CPU 통계 및 실행된 명령과 같은 정보를 추적하기 시작합니다. 모든 계정 로그는 사람이 읽을 수 없는 형식으로 되어 있으며, `sa`를 사용하여 볼 수 있습니다. 옵션 없이 `sa`를 실행하면 사용자당 호출 수, 총 경과 시간(분), 총 CPU 및 사용자 시간(분), 평균 I/O 작업 수와 관련된 정보를 인쇄합니다. 출력을 제어하는 사용 가능한 옵션 목록은 man:sa[8]을 참조하세요.

source: To display the commands issued by users, use `lastcomm`. For example, this command prints out all usage of `ls` by `trhodes` on the `ttyp1` terminal:
ko: 사용자가 실행한 명령을 표시하려면 `lastcomm`을 사용합니다. 예를 들어, 이 명령은 `ttyp1` 터미널에서 `trhodes`가 `ls`를 사용한 모든 내용을 출력합니다:

source: Many other useful options exist and are explained in man:lastcomm[1], man:acct[5], and man:sa[8].
ko: 다른 많은 유용한 옵션이 존재하며 man:lastcomm[1], man:acct[5], man:sa[8]에 설명되어 있습니다.
ru: Существует множество других полезных опций, которые описаны в man:lastcomm[1], man:acct[5] и man:sa[8].

source: Resource Limits
ko: 리소스 제한
ru: Ограничения ресурсов

source: FreeBSD provides several methods for an administrator to limit the amount of system resources an individual may use. Disk quotas limit the amount of disk space available to users. Quotas are discussed in crossref:disks[quotas,"Disk Quotas"].
ko: FreeBSD는 관리자가 개인이 사용할 수 있는 시스템 리소스의 양을 제한할 수 있는 몇 가지 방법을 제공합니다. 디스크 할당량은 사용자가 사용할 수 있는 디스크 공간의 양을 제한합니다. 할당량은 Quotas are discussed in crossref:disks[quotas,”Disk Quotas”]에 설명되어 있습니다.

source: Limits to other resources, such as CPU and memory, can be set using either a flat file or a command to configure a resource limits database. The traditional method defines login classes by editing [.filename]#/etc/login.conf#. While this method is still supported, any changes require a multi-step process of editing this file, rebuilding the resource database, making necessary changes to [.filename]#/etc/master.passwd#, and rebuilding the password database. This can become time consuming, depending upon the number of users to configure.
ko: CPU 및 메모리와 같은 기타 리소스에 대한 제한은 플랫 파일 또는 리소스 제한 데이터베이스를 구성하는 명령을 사용하여 설정할 수 있습니다. 기존 방법은 [.filename]#/etc/login.conf#를 편집하여 로그인 클래스를 정의합니다. 이 방법은 여전히 지원되지만 변경하려면 이 파일을 편집하고, 리소스 데이터베이스를 다시 빌드하고, [.filename]#/etc/master.passwd#에 필요한 변경을 수행하고, 비밀번호 데이터베이스를 다시 빌드하는 여러 단계의 프로세스를 거쳐야 합니다. 이 과정은 구성할 사용자 수에 따라 시간이 오래 걸릴 수 있습니다.

source: `rctl` can be used to provide a more fine-grained method for controlling resource limits. This command supports more than user limits as it can also be used to set resource constraints on processes and jails.
ko: `rctl`을 사용하면 리소스 제한을 보다 세밀하게 제어하는 방법을 제공할 수 있습니다. 이 명령은 프로세스와 jail에 리소스 제약을 설정하는 데에도 사용할 수 있으므로 사용자 제한 이상의 기능을 지원합니다.

source: This section demonstrates both methods for controlling resources, beginning with the traditional method.
ko: 이 섹션에서는 기존 방법부터 시작하여 리소스를 제어하는 두 가지 방법을 설명합니다.
ru: Этот раздел демонстрирует оба метода управления ресурсами, начиная с традиционного метода.

source: Configuring Login Classes
ko: 로그인 클래스 구성하기
ru: Настройка классов входа

source: In the traditional method, login classes and the resource limits to apply to a login class are defined in [.filename]#/etc/login.conf#. Each user account can be assigned to a login class, where `default` is the default login class. Each login class has a set of login capabilities associated with it. A login capability is a `_name_=_value_` pair, where _name_ is a well-known identifier and _value_ is an arbitrary string which is processed accordingly depending on the _name_.
ko: 기존 방식에서는 로그인 클래스와 로그인 클래스에 적용할 리소스 제한이 [.filename]#/etc/login.conf#에 정의됩니다. 각 사용자 계정은 로그인 클래스에 할당될 수 있으며, 여기서 `default`는 기본 로그인 클래스입니다. 각 로그인 클래스에는 연결된 로그인 기능 집합이 있습니다. 로그인 기능은 `_name_=_value_` 쌍으로, 여기서 _name_은 잘 알려진 식별자이고 _value_는 _name_에 따라 적절하게 처리되는 임의의 문자열입니다.
ru: В традиционном методе классы входа и ограничения ресурсов, применяемые к классу входа, определяются в файле [.filename]#/etc/login.conf#. Каждой учётной записи пользователя может быть назначен класс входа, где `default` является классом входа по умолчанию. Каждый класс входа имеет набор связанных с ним возможностей входа. Возможность входа — это пара `_имя_=_значение_`, где _имя_ — это общеизвестный идентификатор, а _значение_ — произвольная строка, которая обрабатывается соответствующим образом в зависимости от _имени_.

source: Whenever [.filename]#/etc/login.conf# is edited, the [.filename]#/etc/login.conf.db# must be updated by executing the following command:
ko: [.filename]#/etc/login.conf#를 편집할 때마다 다음 명령을 실행하여 [.filename]#/etc/login.conf.db#를 업데이트해야 합니다:

source: Resource limits differ from the default login capabilities in two ways. First, for every limit, there is a _soft_ and _hard_ limit. A soft limit may be adjusted by the user or application, but may not be set higher than the hard limit. The hard limit may be lowered by the user, but can only be raised by the superuser. Second, most resource limits apply per process to a specific user.
ko: 리소스 제한은 기본 로그인 기능과는 두 가지 점에서 다릅니다. 첫째, 모든 제한에는 _소프트_ 및 _하드_ 제한이 있습니다. 소프트 제한은 사용자 또는 애플리케이션에서 조정할 수 있지만 하드 제한보다 높게 설정할 수 없습니다. 하드 제한은 사용자가 낮출 수 있지만 수퍼유저만 올릴 수 있습니다. 둘째, 대부분의 리소스 제한은 특정 사용자에 대해 프로세스별로 적용됩니다.

source: <<resource-limits>> lists the most commonly used resource limits. All of the available resource limits and capabilities are described in detail in man:login.conf[5].
ko: <<resource-limits>> 에는 가장 일반적으로 사용되는 리소스 제한이 나열되어 있습니다. 사용 가능한 모든 리소스 제한 및 기능은 man:login.conf[5]에 자세히 설명되어 있습니다.

source: Login Class Resource Limits
ko: 로그인 클래스 리소스 제한

source: Resource Limit
ko: 리소스 제한

source: Description
ko: 설명
ru: Описание
