Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: A _rootkit_ is any unauthorized software that attempts to gain `root` access to a system. Once installed, this malicious software will normally open up another avenue of entry for an attacker. Realistically, once a system has been compromised by a rootkit and an investigation has been performed, the system should be reinstalled from scratch. There is tremendous risk that even the most prudent security or systems engineer will miss something an attacker left behind.
ko: _루트킷_은 시스템에 대한 `root`액세스 권한을 얻으려고 시도하는 무단 소프트웨어입니다. 이 악성 소프트웨어는 일단 설치되면 일반적으로 공격자에게 또 다른 침입 경로를 열어줍니다. 현실적으로 시스템이 루트킷에 의해 손상되어 조사를 수행한 후에는 시스템을 처음부터 다시 설치해야 합니다. 아무리 신중한 보안 또는 시스템 엔지니어라도 공격자가 남긴 무언가를 놓칠 위험이 매우 높습니다.

source: A rootkit does do one thing useful for administrators: once detected, it is a sign that a compromise happened at some point. But, these types of applications tend to be very well hidden. This section demonstrates a tool that can be used to detect rootkits, package:security/rkhunter[].
ko: 루트킷은 관리자에게 유용한 한 가지 기능을 수행합니다. 일단 탐지되면 어느 시점에 침해가 발생했다는 신호입니다. 하지만 이러한 유형의 애플리케이션은 매우 잘 숨겨져 있는 경향이 있습니다. 이 섹션에서는 루트킷을 탐지하는 데 사용할 수 있는 도구인 package:security/rkhunter[]를 보여줍니다.

source: After installation of this package or port, the system may be checked using the following command. It will produce a lot of information and will require some manual pressing of kbd:[ENTER]:
ko: 이 패키지 또는 포트를 설치한 후 다음 명령을 사용하여 시스템을 확인할 수 있습니다. 이 명령은 많은 정보를 생성하며 kbd:[ENTER]를 수동으로 눌러야 합니다:

source: After the process completes, a status message will be printed to the screen. This message will include the amount of files checked, suspect files, possible rootkits, and more. During the check, some generic security warnings may be produced about hidden files, the OpenSSH protocol selection, and known vulnerable versions of installed software. These can be handled now or after a more detailed analysis has been performed.
ko: 프로세스가 완료되면 화면에 상태 메시지가 인쇄됩니다. 이 메시지에는 검사한 파일의 양, 의심스러운 파일, 가능한 루트킷 등이 포함됩니다. 검사하는 동안 숨겨진 파일, OpenSSH 프로토콜 선택, 설치된 소프트웨어의 알려진 취약 버전에 대한 일반적인 보안 경고가 표시될 수 있습니다. 이러한 경고는 지금 처리하거나 더 자세한 분석이 수행된 후에 처리할 수 있습니다.

source: Every administrator should know what is running on the systems they are responsible for. Third-party tools like rkhunter and package:sysutils/lsof[], and native commands such as `netstat` and `ps`, can show a great deal of information on the system. Take notes on what is normal, ask questions when something seems out of place, and be paranoid. While preventing a compromise is ideal, detecting a compromise is a must.
ko: 모든 관리자는 자신이 담당하는 시스템에서 무엇이 실행되고 있는지 알아야 합니다. rkhunter, package:sysutils/lsof[] 같은 타사 도구와 `netstat`, `ps` 같은 기본 명령은 시스템에 대한 많은 정보를 보여줄 수 있습니다. 무엇이 정상인지 메모하고, 뭔가 이상해 보이면 질문하고, 의심해 보세요. 보안 침해를 예방하는 것이 가장 이상적이지만, 보안 침해를 탐지하는 것은 필수입니다.

source: Binary Verification
ko: 바이너리 검증

source: Verification of system files and binaries is important because it provides the system administration and security teams information about system changes. A software application that monitors the system for changes is called an Intrusion Detection System (IDS).
ko: 시스템 파일과 바이너리의 검증은 시스템 관리 및 보안 팀에 시스템 변경에 대한 정보를 제공하기 때문에 중요합니다. 시스템의 변경 사항을 모니터링하는 소프트웨어 애플리케이션을 침입 탐지 시스템(IDS)이라고 합니다.
ru: Проверка системных файлов и двоичных файлов важна, поскольку предоставляет администраторам системы и командам безопасности информацию об изменениях в системе. Программное приложение, которое отслеживает изменения в системе, называется системой обнаружения вторжений (Intrusion Detection System — IDS).

source: FreeBSD provides native support for a basic IDS system. While the nightly security emails will notify an administrator of changes, the information is stored locally and there is a chance that a malicious user could modify this information in order to hide their changes to the system. As such, it is recommended to create a separate set of binary signatures and store them on a read-only, root-owned directory or, preferably, on a removable USB disk or remote rsync server.
ko: FreeBSD는 기초적인 IDS 시스템에 대한 기본 지원을 제공합니다. 야간 보안 이메일은 관리자에게 변경 사항을 알려주지만, 이 정보는 로컬에 저장되므로 악의적인 사용자가 시스템에 대한 변경 사항을 숨기기 위해 이 정보를 수정할 가능성이 있습니다. 따라서 별도의 바이너리 서명 세트를 만들어 읽기 전용, 루트 소유 디렉터리 또는 이동식 USB 디스크 또는 원격 rsync 서버에 저장하는 것이 좋습니다.

source: The built-in `mtree` utility can be used to generate a specification of the contents of a directory. A seed, or a numeric constant, is used to generate the specification and is required to check that the specification has not changed. This makes it possible to determine if a file or binary has been modified. Since the seed value is unknown by an attacker, faking or checking the checksum values of files will be difficult to impossible. The following example generates a set of SHA256 hashes, one for each system binary in [.filename]#/bin#, and saves those values to a hidden file in ``root``'s home directory, [.filename]#/root/.bin_chksum_mtree#:
ko: 내장된 `mtree` 유틸리티를 사용하여 디렉터리 콘텐츠의 사양을 생성할 수 있습니다. 시드 또는 숫자 상수는 사양을 생성하는 데 사용되며 사양이 변경되지 않았는지 확인하는 데 필요합니다. 이를 통해 파일 또는 바이너리가 수정되었는지 여부를 확인할 수 있습니다. 공격자가 시드 값을 알 수 없기 때문에 파일의 체크섬 값을 위조하거나 확인하는 것은 어렵거나 불가능합니다. 다음 예제는 [.filename]#/bin#의 각 시스템 바이너리에 대해 하나씩 SHA256 해시 집합을 생성하고 해당 값을 ‘root’의 홈 디렉터리인 [.filename]#/root/.bin_chksum_mtree#에 있는 숨겨진 파일에 저장합니다:

source: The _3483151339707503_ represents the seed. This value should be remembered, but not shared.
ko: _3483151339707503_은 시드를 나타냅니다. 이 값은 기억해야 하지만 공유해서는 안 됩니다.

source: Viewing [.filename]#/root/.bin_cksum_mtree# should yield output similar to the following:
ko: [.filename]#/root/.bin_cksum_mtree#를 확인하면 다음과 비슷한 출력이 표시됩니다:

source: The machine's hostname, the date and time the specification was created, and the name of the user who created the specification are included in this report. There is a checksum, size, time, and SHA256 digest for each binary in the directory.
ko: 이 보고서에는 머신의 호스트 이름, 사양이 생성된 날짜와 시간, 사양을 생성한 사용자의 이름이 포함됩니다. 디렉터리의 각 바이너리에 대한 체크섬, 크기, 시간, SHA256 다이제스트가 있습니다.

source: To verify that the binary signatures have not changed, compare the current contents of the directory to the previously generated specification, and save the results to a file. This command requires the seed that was used to generate the original specification:
ko: 바이너리 서명이 변경되지 않았는지 확인하려면 디렉터리의 현재 내용을 이전에 생성한 사양과 비교하고 결과를 파일에 저장합니다. 이 명령에는 원본 사양을 생성하는 데 사용된 시드가 필요합니다:

source: This should produce the same checksum for [.filename]#/bin# that was produced when the specification was created. If no changes have occurred to the binaries in this directory, the [.filename]#/root/.bin_chksum_output# output file will be empty. To simulate a change, change the date on [.filename]#/bin/cat# using `touch` and run the verification command again:
ko: 이렇게 하면 사양을 생성할 때 생성된 것과 동일한 [.filename]#/bin#에 대한 체크섬이 생성되어야 합니다. 이 디렉터리의 바이너리에 변경 사항이 없는 경우 [.filename]#/root/.bin_chksum_output# 출력 파일은 비어 있습니다. 변경을 시뮬레이션하려면 `touch`를 사용하여 [.filename]#/bin/cat#의 날짜를 변경하고 확인 명령을 다시 실행합니다:

source: It is recommended to create specifications for the directories which contain binaries and configuration files, as well as any directories containing sensitive data. Typically, specifications are created for [.filename]#/bin#, [.filename]#/sbin#, [.filename]#/usr/bin#, [.filename]#/usr/sbin#, [.filename]#/usr/local/bin#, [.filename]#/etc#, and [.filename]#/usr/local/etc#.
ko: 바이너리와 구성 파일이 포함된 디렉터리와 민감한 데이터가 포함된 디렉터리에 대한 사양을 생성하는 것이 좋습니다. 일반적으로 [.filename]#/bin#, [.filename]#/sbin#, [.filename]#/usr/bin#, [.filename]#/usr/sbin#, [.filename]#/usr/local/bin#, [.filename]#/etc#, [.filename]#/usr/local/etc#에 대해 사양을 생성합니다.
ru: Рекомендуется создавать спецификации для каталогов, содержащих исполняемые файлы и конфигурационные файлы, а также для любых каталогов с чувствительными данными. Обычно спецификации создаются для [.filename]#/bin#, [.filename]#/sbin#, [.filename]#/usr/bin#, [.filename]#/usr/sbin#, [.filename]#/usr/local/bin#, [.filename]#/etc# и [.filename]#/usr/local/etc#.

source: More advanced IDS systems exist, such as package:security/aide[]. In most cases, `mtree` provides the functionality administrators need. It is important to keep the seed value and the checksum output hidden from malicious users. More information about `mtree` can be found in man:mtree[8].
ko: package:security/aide[]과 같은 고급 IDS 시스템이 존재합니다. 대부분의 경우 `mtree`는 관리자가 필요로 하는 기능을 제공합니다. 시드 값과 체크섬 출력을 악의적인 사용자로부터 숨기는 것이 중요합니다. `mtree`에 대한 자세한 정보는 man:mtree[8]에서 확인할 수 있습니다.

source: System Tuning for Security
ko: 보안을 위한 시스템 튜닝

source: In FreeBSD, many system features can be tuned using `sysctl`. A few of the security features which can be tuned to prevent Denial of Service (DoS) attacks will be covered in this section. More information about using `sysctl`, including how to temporarily change values and how to make the changes permanent after testing, can be found in crossref:config[configtuning-sysctl,“Tuning with sysctl(8)”].
ko: FreeBSD에서는 `sysctl`을 사용하여 많은 시스템 기능을 조정할 수 있습니다. 이 섹션에서는 서비스 거부(DoS) 공격을 방지하기 위해 조정할 수 있는 몇 가지 보안 기능에 대해 다룹니다. 일시적으로 값을 변경하는 방법과 테스트 후 변경 사항을 영구적으로 적용하는 방법을 포함하여 `sysctl` 사용에 대한 자세한 정보는 crossref:config[configtuning-sysctl,“Tuning with sysctl(8)”]에서 찾을 수 있습니다.

source: Any time a setting is changed with `sysctl`, the chance to cause undesired harm is increased, affecting the availability of the system. All changes should be monitored and, if possible, tried on a testing system before being used on a production system.
ko: `sysctl`로 설정을 변경할 때마다 원치 않는 피해를 유발하여 시스템 가용성에 영향을 미칠 가능성이 높아집니다. 모든 변경 사항은 모니터링하고 가능하면 프로덕션 시스템에서 사용하기 전에 테스트 시스템에서 시도해야 합니다.

source: By default, the FreeBSD kernel boots with a security level of `-1`. This is called "insecure mode" because immutable file flags may be turned off and all devices may be read from or written to. The security level will remain at `-1` unless it is altered through `sysctl` or by a setting in the startup scripts. The security level may be increased during system startup by setting `kern_securelevel_enable` to `YES` in [.filename]#/etc/rc.conf#, and the value of `kern_securelevel` to the desired security level. See man:security[7] and man:init[8] for more information on these settings and the available security levels.
ko: 기본적으로 FreeBSD 커널은 보안 수준 `-1`로 부팅됩니다. 이를 “안전하지 않은 모드”라고 부르는데, 변경 불가능한 파일 플래그가 꺼지고 모든 장치에서 읽거나 쓸 수 있기 때문입니다. 보안 수준은 `sysctl` 또는 시작 스크립트의 설정을 통해 변경하지 않는 한 `-1`로 유지됩니다. 시스템 시작 시 [.filename]#/etc/rc.conf#에서 `kern_securelevel_enable`을 `YES`로 설정하고 `kern_securelevel`의 값을 원하는 보안 수준으로 설정하여 보안 수준을 높일 수 있습니다. 이러한 설정과 사용 가능한 보안 수준에 대한 자세한 내용은 man:security[7] 및 man:init[8]을 참조하세요.

source: Increasing the `securelevel` can break Xorg and cause other issues. Be prepared to do some debugging.
ko: `securelevel`을 높이면 Xorg가 중단되고 다른 문제가 발생할 수 있습니다. 디버깅을 할 준비를 하세요.

source: The `net.inet.tcp.blackhole` and `net.inet.udp.blackhole` settings can be used to drop incoming SYN packets on closed ports without sending a return RST response. The default behavior is to return an RST to show a port is closed. Changing the default provides some level of protection against ports scans, which are used to determine which applications are running on a system. Set `net.inet.tcp.blackhole` to `2` and `net.inet.udp.blackhole` to `1`. Refer to man:blackhole[4] for more information about these settings.
ko: `net.inet.tcp.blackhole` 및 `net.inet.udp.blackhole` 설정을 사용하면 반환 RST 응답을 보내지 않고 닫힌 포트에서 들어오는 SYN 패킷을 드롭할 수 있습니다. 기본 동작은 포트가 닫혔음을 나타내는 RST를 반환하는 것입니다. 기본값을 변경하면 시스템에서 실행 중인 애플리케이션을 확인하는 데 사용되는 포트 검사에 대해 어느 정도 보호할 수 있습니다. `net.inet.tcp.blackhole`을 `2`로, `net.inet.udp.blackhole`을 `1`로 설정합니다. 이 설정에 대한 자세한 내용은 man:blackhole[4]을 참조하세요.

source: The `net.inet.icmp.drop_redirect` and `net.inet.ip.redirect` settings help prevent against _redirect attacks_. A redirect attack is a type of DoS which sends mass numbers of ICMP type 5 packets. Since these packets are not required, set `net.inet.icmp.drop_redirect` to `1` and set `net.inet.ip.redirect` to `0`.
ko: `net.inet.icmp.drop_redirect` 및 `net.inet.ip.redirect` 설정은 _리디렉션 공격_을 방지하는 데 도움이 됩니다. 리디렉션 공격은 대량의 ICMP 유형 5 패킷을 전송하는 DoS의 한 유형입니다. 이 패킷은 필요하지 않으므로 `net.inet.icmp.drop_redirect`를 `1`로 설정하고 `net.inet.ip.redirect`를 `0`으로 설정합니다.

source: Source routing is a method for detecting and accessing non-routable addresses on the internal network. This should be disabled as non-routable addresses are normally not routable on purpose. To disable this feature, set `net.inet.ip.sourceroute` and `net.inet.ip.accept_sourceroute` to `0`.
ko: 소스 라우팅은 내부 네트워크에서 라우팅할 수 없는 주소를 감지하고 액세스하는 방법입니다. 라우팅할 수 없는 주소는 일반적으로 의도적으로 라우팅할 수 없으므로 이 기능은 비활성화해야 합니다. 이 기능을 비활성화하려면 `net.inet.ip.sourceroute` 및 `net.inet.ip.accept_sourceroute`를 `0`으로 설정하세요.

source: When a machine on the network needs to send messages to all hosts on a subnet, an ICMP echo request message is sent to the broadcast address. However, there is no reason for an external host to perform such an action. To reject all external broadcast requests, set `net.inet.icmp.bmcastecho` to `0`.
ko: 네트워크의 컴퓨터가 서브넷의 모든 호스트에 메시지를 보내야 하는 경우 ICMP 에코 요청 메시지가 브로드캐스트 주소로 전송됩니다. 그러나 외부 호스트가 이러한 작업을 수행할 이유는 없습니다. 모든 외부 브로드캐스트 요청을 거부하려면 `net.inet.icmp.bmcastecho`를 `0`으로 설정합니다.

source: Some additional settings are documented in man:security[7].
ko: 일부 추가 설정은 man:security[7]에 문서화되어 있습니다.

source: One-time Passwords
ko: 일회용 비밀번호

source: By default, versions of FreeBSD prior to 14.x include support for One-time Passwords In Everything (OPIE).
ko: 기본적으로 14.x 이전 버전의 FreeBSD에는 OPIE(One-time Password In Everything)가 지원됩니다.

source: OPIE is no longer considered secure and has been removed from FreeBSD -CURRENT; it will not be available from 14.x onwards. If you wish to use OPIE on versions of FreeBSD later than 13.x, the package:security/opie[] package or port is available, though not recommended.
ko: OPIE는 더 이상 안전한 것으로 간주되지 않으며 FreeBSD -CURRENT에서 제거되었습니다; 14.x 이후부터는 사용할 수 없습니다. 13.x 이후 버전의 FreeBSD에서 OPIE를 사용하려면 package:security/opie[] 패키지 또는 포트를 사용할 수 있지만 권장되지는 않습니다.

source: OPIE is designed to prevent replay attacks, in which an attacker discovers a user's password and uses it to access a system. Since a password is only used once in OPIE, a discovered password is of little use to an attacker. OPIE uses a secure hash and a challenge/response system to manage passwords. The FreeBSD implementation uses the MD5 hash by default.
ko: OPIE는 공격자가 사용자의 비밀번호를 알아내어 시스템에 액세스하는 데 사용하는 리플레이 공격을 방지하도록 설계되었습니다. OPIE에서 비밀번호는 한 번만 사용되므로, 공격자가 발견한 비밀번호는 거의 쓸모가 없습니다. OPIE는 보안 해시와 챌린지/응답 시스템을 사용하여 암호를 관리합니다. FreeBSD 구현은 기본적으로 MD5 해시를 사용합니다.

source: OPIE uses three different types of passwords. The first is the usual UNIX(R) or Kerberos password. The second is the one-time password which is generated by `opiekey`. The third type of password is the "secret password" which is used to generate one-time passwords. The secret password has nothing to do with, and should be different from, the UNIX(R) password.
ko: OPIE는 세 가지 유형의 비밀번호를 사용합니다. 첫 번째는 일반적인 UNIX(R) 또는 Kerberos 암호입니다. 두 번째는 `opiekey`에 의해 생성되는 일회용 비밀번호입니다. 세 번째 유형의 비밀번호는 일회용 비밀번호를 생성하는 데 사용되는 “비밀 비밀번호”입니다. 비밀 비밀번호는 UNIX(R) 비밀번호와 관련이 없으며, UNIX(R) 비밀번호와는 달라야 합니다.

source: There are two other pieces of data that are important to OPIE. One is the "seed" or "key", consisting of two letters and five digits. The other is the "iteration count", a number between 1 and 100. OPIE creates the one-time password by concatenating the seed and the secret password, applying the MD5 hash as many times as specified by the iteration count, and turning the result into six short English words which represent the one-time password. The authentication system keeps track of the last one-time password used, and the user is authenticated if the hash of the user-provided password is equal to the previous password. Since a one-way hash is used, it is impossible to generate future one-time passwords if a successfully used password is captured. The iteration count is decremented after each successful login to keep the user and the login program in sync. When the iteration count gets down to `1`, OPIE must be reinitialized.
ko: OPIE에 중요한 두 가지 데이터가 더 있습니다. 하나는 두 글자와 다섯 자리 숫자로 구성된 “시드” 또는 “키”입니다. 다른 하나는 1에서 100 사이의 숫자인 “반복 횟수”입니다. OPIE는 시드와 비밀 비밀번호를 연결하고, 반복 횟수에 지정된 횟수만큼 MD5 해시를 적용한 다음, 그 결과를 일회용 비밀번호를 나타내는 6개의 짧은 영어 단어로 변환하여 일회용 비밀번호를 생성합니다. 인증 시스템은 마지막으로 사용된 일회용 비밀번호를 추적하고, 사용자가 제공한 비밀번호의 해시가 이전 비밀번호와 동일한 경우 사용자를 인증합니다. 단방향 해시를 사용하기 때문에 성공적으로 사용된 비밀번호가 캡처되면 향후 일회용 비밀번호를 생성할 수 없습니다. 반복 횟수는 로그인에 성공할 때마다 감소하여 사용자와 로그인 프로그램의 동기화를 유지합니다. 반복 횟수가 ‘1’이 되면 OPIE를 다시 초기화해야 합니다.

source: There are a few programs involved in this process. A one-time password, or a consecutive list of one-time passwords, is generated by passing an iteration count, a seed, and a secret password to man:opiekey[1]. In addition to initializing OPIE, man:opiepasswd[1] is used to change passwords, iteration counts, or seeds. The relevant credential files in [.filename]#/etc/opiekeys# are examined by man:opieinfo[1] which prints out the invoking user's current iteration count and seed.
ko: 이 과정에는 몇 가지 프로그램이 관여합니다. 일회용 비밀번호 또는 일회용 비밀번호의 연속 목록은 반복 횟수, 시드, 비밀 비밀번호를 man:opiekey[1]에 전달하여 생성됩니다. OPIE를 초기화하는 것 외에도 man:opiepasswd[1]는 비밀번호, 반복 횟수 또는 시드를 변경하는 데 사용됩니다. [filename]#/etc/opiekeys#에 있는 관련 자격증명 파일은 호출하는 사용자의 현재 반복 횟수와 시드를 출력하는 man:opieinfo[1]에 의해 검사됩니다.

source: This section describes four different sorts of operations. The first is how to set up one-time-passwords for the first time over a secure connection. The second is how to use `opiepasswd` over an insecure connection. The third is how to log in over an insecure connection. The fourth is how to generate a number of keys which can be written down or printed out to use at insecure locations.
ko: 이 섹션에서는 네 가지 종류의 작업에 대해 설명합니다. 첫 번째는 보안 연결을 통해 처음으로 일회용 비밀번호를 설정하는 방법입니다. 두 번째는 안전하지 않은 연결에서 `opiepasswd`를 사용하는 방법입니다. 세 번째는 안전하지 않은 연결에서 로그인하는 방법입니다. 네 번째는 안전하지 않은 위치에서 사용하기 위해 기록하거나 인쇄할 수 있는 여러 개의 키를 생성하는 방법입니다.

source: Initializing OPIE
ko: OPIE 초기화하기

source: To initialize OPIE for the first time, run this command from a secure location:
ko: OPIE를 처음 초기화하려면 안전한 위치에서 이 명령을 실행하세요:

source: The `-c` sets console mode which assumes that the command is being run from a secure location, such as a computer under the user's control or an SSH session to a computer under the user's control.
ko: `-c`는 명령이 사용자가 제어하는 컴퓨터 또는 사용자가 제어하는 컴퓨터에 대한 SSH 세션과 같은 보안 위치에서 실행되고 있다고 가정하는 콘솔 모드를 설정합니다.

source: When prompted, enter the secret password which will be used to generate the one-time login keys. This password should be difficult to guess and should be different than the password which is associated with the user's login account. It must be between 10 and 127 characters long. Remember this password.
ko: 메시지가 표시되면 일회용 로그인 키를 생성하는 데 사용할 비밀 비밀번호를 입력합니다. 이 비밀번호는 추측하기 어렵고 사용자의 로그인 계정과 연결된 비밀번호와 달라야 합니다. 비밀번호 길이는 10~127자 사이여야 합니다. 이 비밀번호를 기억하세요.

source: The `ID` line lists the login name (`unfurl`), default iteration count (`499`), and default seed (`to4268`). When logging in, the system will remember these parameters and display them, meaning that they do not have to be memorized. The last line lists the generated one-time password which corresponds to those parameters and the secret password. At the next login, use this one-time password.
ko: `ID` 줄에는 로그인 이름(`unfurl`), 기본 반복 횟수(`499`), 기본 시드(`to4268`)가 나열됩니다. 로그인할 때 시스템이 이러한 매개변수를 기억하여 표시하므로 기억할 필요가 없습니다. 마지막 줄에는 해당 매개변수에 해당하는 생성된 일회용 비밀번호와 비밀 비밀번호가 나열됩니다. 다음에 로그인할 때 이 일회용 비밀번호를 사용하세요.

source: Insecure Connection Initialization
ko: 안전하지 않은 연결 초기화

source: To initialize or change the secret password on an insecure system, a secure connection is needed to some place where `opiekey` can be run. This might be a shell prompt on a trusted machine. An iteration count is needed, where 100 is probably a good value, and the seed can either be specified or the randomly-generated one used. On the insecure connection, the machine being initialized, use man:opiepasswd[1]:
ko: 안전하지 않은 시스템에서 비밀 비밀번호를 초기화하거나 변경하려면 `opiekey`를 실행할 수 있는 곳에 보안 연결이 필요합니다. 신뢰할 수 있는 컴퓨터의 셸 프롬프트일 수 있습니다. 반복 횟수는 100이 적당하며, 시드는 지정하거나 무작위로 생성된 시드를 사용할 수 있습니다. 안전하지 않은 연결에서 초기화 중인 머신은 man:opiepasswd[1]을 사용합니다:

source: To accept the default seed, press kbd:[Return]. Before entering an access password, move over to the secure connection and give it the same parameters:
ko: 기본 시드를 수락하려면 kbd:[Return]을 누릅니다. 액세스 비밀번호를 입력하기 전에 보안 연결로 이동하여 동일한 매개 변수를 입력합니다:

source: Switch back over to the insecure connection, and copy the generated one-time password over to the relevant program.
ko: 안전하지 않은 연결로 다시 전환하고 생성된 일회용 비밀번호를 관련 프로그램에 복사합니다.

source: Generating a Single One-time Password
ko: 단일 일회용 비밀번호 생성하기

source: After initializing OPIE and logging in, a prompt like this will be displayed:
ko: OPIE를 초기화하고 로그인하면 다음과 같은 메시지가 표시됩니다:

source: The OPIE prompt provides a useful feature. If kbd:[Return] is pressed at the password prompt, the prompt will turn echo on and display what is typed. This can be useful when attempting to type in a password by hand from a printout.
ko: OPIE 프롬프트는 유용한 기능을 제공합니다. 비밀번호 프롬프트에서 kbd:[Return]을 누르면 프롬프트가 에코를 켜고 입력한 내용을 표시합니다. 이 기능은 인쇄물에서 직접 비밀번호를 입력하려고 할 때 유용합니다.

source: At this point, generate the one-time password to answer this login prompt. This must be done on a trusted system where it is safe to run man:opiekey[1]. There are versions of this command for Windows(R), Mac OS(R) and FreeBSD. This command needs the iteration count and the seed as command line options. Use cut-and-paste from the login prompt on the machine being logged in to.
ko: 이 시점에서 로그인 프롬프트에 응답할 일회용 비밀번호를 생성합니다. 이 작업은 man:opiekey[1]를 실행해도 안전한 신뢰할 수 있는 시스템에서 수행해야 합니다. 이 명령은 Windows(R), Mac OS(R) 및 FreeBSD용 버전이 있습니다. 이 명령은 명령줄 옵션으로 반복 횟수와 시드가 필요합니다. 로그인하려는 컴퓨터의 로그인 프롬프트에서 잘라내기 및 붙여넣기를 사용합니다.

source: On the trusted system:
ko: 신뢰할 수 있는 시스템에서:

source: Once the one-time password is generated, continue to log in.
ko: 일회용 비밀번호가 생성되면 계속 로그인합니다.

source: Generating Multiple One-time Passwords
ko: 여러 개의 일회용 비밀번호 생성하기

source: Sometimes there is no access to a trusted machine or secure connection. In this case, it is possible to use man:opiekey[1] to generate a number of one-time passwords beforehand. For example:
ko: 신뢰할 수 있는 컴퓨터나 보안 연결에 액세스할 수 없는 경우가 있습니다. 이 경우 man:opiekey[1]를 사용하여 미리 여러 개의 일회용 비밀번호를 생성할 수 있습니다. 예를 들어:

source: The `-n 5` requests five keys in sequence, and `30` specifies what the last iteration number should be. Note that these are printed out in _reverse_ order of use. The really paranoid might want to write the results down by hand; otherwise, print the list. Each line shows both the iteration count and the one-time password. Scratch off the passwords as they are used.
ko: `-n 5` 는 5개의 키를 순서대로 요청하고 `30`은 마지막 반복 횟수를 지정합니다. 사용 순서의 _역_ 순서로 출력된다는 점에 유의하세요. 정말 편집증적인 사람은 결과를 손으로 적고 싶을 수도 있지만, 그렇지 않다면 목록을 인쇄하세요. 각 줄에는 반복 횟수와 일회용 비밀번호가 모두 표시됩니다. 사용한 비밀번호는 지워버리세요.

source: Restricting Use of UNIX(R) Passwords
ko: UNIX(R) 암호 사용 제한하기

source: OPIE can restrict the use of UNIX(R) passwords based on the IP address of a login session. The relevant file is [.filename]#/etc/opieaccess#, which is present by default. Refer to man:opieaccess[5] for more information on this file and which security considerations to be aware of when using it.
ko: OPIE는 로그인 세션의 IP 주소에 따라 UNIX(R) 비밀번호 사용을 제한할 수 있습니다. 관련 파일은 [.filename]#/etc/opieaccess#이며, 기본적으로 존재합니다. 이 파일에 대한 자세한 내용과 이 파일을 사용할 때 주의해야 할 보안 고려사항은 man:opieaccess[5]를 참조하세요.

source: Here is a sample [.filename]#opieaccess#:
ko: [.filename]#opieaccess#의 샘플이 있습니다:

source: This line allows users whose IP source address (which is vulnerable to spoofing) matches the specified value and mask, to use UNIX(R) passwords at any time.
ko: 이 줄을 사용하면 스푸핑에 취약한 IP 소스 주소가 지정된 값과 마스크와 일치하는 사용자는 언제든지 UNIX(R) 비밀번호를 사용할 수 있습니다.

source: If no rules in [.filename]#opieaccess# are matched, the default is to deny non-OPIE logins.
ko: [.filename]#opieaccess#에 일치하는 규칙이 없는 경우 기본값은 OPIE가 아닌 로그인을 거부합니다.

source: TCP Wrapper
ko: TCP 래퍼
