Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: Next, create [.filename]#/etc/krb5.keytab# on the server. This is the main part of "Kerberizing" a service - it corresponds to generating a secret shared between the service and the KDC. The secret is a cryptographic key, stored in a "keytab". The keytab contains the server's host key, which allows it and the KDC to verify each others' identity. It must be transmitted to the server in a secure fashion, as the security of the server can be broken if the key is made public. Typically, the [.filename]#keytab# is generated on an administrator's trusted machine using `kadmin`, then securely transferred to the server, e.g., with man:scp[1]; it can also be created directly on the server if that is consistent with the desired security policy. It is very important that the keytab is transmitted to the server in a secure fashion: if the key is known by some other party, that party can impersonate any user to the server! Using `kadmin` on the server directly is convenient, because the entry for the host principal in the KDC database is also created using `kadmin`.
ko: 그런 다음 서버에 [.filename]#/etc/krb5.keytab#을 만듭니다. 이것은 서비스 “케르베로스화(Kerberizing)”의 주요 부분으로, 서비스와 KDC 간에 공유되는 시크릿을 생성하는 것에 해당합니다. 시크릿은 암호화 키로, “keytab”에 저장됩니다. keytab에는 서버의 호스트 키가 포함되어 있어 서버와 KDC가 서로의 신원을 확인할 수 있습니다. 키가 공개되면 서버의 보안이 손상될 수 있으므로 안전한 방식으로 서버에 전송해야 합니다. 일반적으로 관리자가 신뢰할 수 있는 컴퓨터에서 `kadmin`을 사용하여 [.filename]#keytab#을 생성한 다음 man:scp[1] 등을 사용하여 서버로 안전하게 전송하지만, 원하는 보안 정책에 부합하는 경우 서버에서 직접 생성할 수도 있습니다. 키탭이 안전한 방식으로 서버로 전송되는 것이 매우 중요합니다. 다른 사람이 키를 알고 있으면 그 사람이 서버에 어떤 사용자든 사칭할 수 있기 때문입니다! KDC 데이터베이스의 호스트 주체에 대한 항목도 `kadmin`을 사용하여 생성되므로 서버에서 `kadmin`을 직접 사용하는 것이 편리합니다.
ru: Затем создайте файл [.filename]#/etc/krb5.keytab# на сервере. Это основная часть процесса "керберизации" службы — она соответствует созданию общего секрета между службой и KDC. Секрет представляет собой криптографический ключ, хранящийся в "keytab". Keytab содержит хост-ключ сервера, который позволяет ему и KDC проверять подлинность друг друга. Этот файл должен быть передан на сервер безопасным способом, так как если ключ станет общедоступным, безопасность сервера может быть нарушена. Обычно [.filename]#keytab# генерируется на доверенной машине администратора с помощью `kadmin`, а затем безопасно передается на сервер, например, с помощью man:scp[1]; его также можно создать непосредственно на сервере, если это соответствует выбранной политике безопасности. Очень важно, чтобы keytab был передан на сервер безопасным способом: если ключ станет известен третьей стороне, эта сторона сможет выдавать себя за любого пользователя на сервере! Использование `kadmin` непосредственно на сервере удобно, так как запись для хостового принципала в базе данных KDC также создается с помощью `kadmin`.

source: Of course, `kadmin` is a kerberized service; a Kerberos ticket is needed to authenticate to the network service, but to ensure that the user running `kadmin` is actually present (and their session has not been hijacked), `kadmin` will prompt for the password to get a fresh ticket. The principal authenticating to the kadmin service must be permitted to use the `kadmin` interface, as specified in [.filename]#/var/heimdal/kadmind.acl#. See the section titled "Remote administration" in `info heimdal` for details on designing access control lists. Instead of enabling remote `kadmin` access, the administrator could securely connect to the KDC via the local console or man:ssh[1], and perform administration locally using `kadmin -l`.
ko: 물론 `kadmin`은 케르베로스화된 서비스이므로 네트워크 서비스에 인증하려면 케르베로스 티켓이 필요하지만, `kadmin`을 실행하는 사용자가 실제로 존재하고 세션이 도용되지 않았는지 확인하기 위해 `kadmin`은 새 티켓을 얻기 위해 암호를 입력하라는 메시지를 표시합니다. kadmin 서비스에 인증하는 주체는 [.filename]#/var/heimdal/kadmind.acl#에 지정된 대로 `kadmin` 인터페이스를 사용할 수 있도록 허용되어야 합니다. 액세스 제어 목록 설계에 대한 자세한 내용은 `info heimda`의 “Remote administration” 섹션을 참조하세요. 관리자는 원격 `kadmin` 액세스를 활성화하는 대신 로컬 콘솔 또는 man:ssh[1]를 통해 KDC에 안전하게 연결하고 `kadmin -l`을 사용하여 로컬에서 관리를 수행할 수 있습니다.
ru: Конечно, `kadmin` — это керберизованный сервис; для аутентификации в сетевой службе необходим билет Kerberos, но чтобы убедиться, что пользователь, запускающий `kadmin`, действительно присутствует (и его сеанс не был захвачен), `kadmin` запросит пароль для получения нового билета. Учётная запись, аутентифицирующаяся в службе kadmin, должна иметь разрешение на использование интерфейса `kadmin`, как указано в [.filename]#/var/heimdal/kadmind.acl#. Подробнее о создании списков контроля доступа см. в разделе «Удалённое администрирование» в `info heimdal`. Вместо включения удалённого доступа к `kadmin` администратор может безопасно подключиться к KDC через локальную консоль или man:ssh[1] и выполнять администрирование локально с помощью `kadmin -l`.

source: After installing [.filename]#/etc/krb5.conf#, use `add --random-key` in `kadmin`. This adds the server's host principal to the database, but does not extract a copy of the host principal key to a keytab. To generate the keytab, use `ext` to extract the server's host principal key to its own keytab:
ko: [.filename]#/etc/krb5.conf#을 설치한 후 `kadmin`에서 `add —random-key`를 사용합니다. 이렇게 하면 서버의 호스트 주체가 데이터베이스에 추가되지만 호스트 주체의 키 복사본이 키탭으로 추출되지는 않습니다. 키탭을 생성하려면 `ext`를 사용하여 서버의 호스트의 principal 키를 자체 키탭으로 추출합니다:
ru: После установки [.filename]#/etc/krb5.conf# используйте `add --random-key` в `kadmin`. Это добавит главный серверный принципал в базу данных, но не извлечет копию ключа главного принципала в keytab. Чтобы сгенерировать keytab, используйте `ext` для извлечения ключа главного серверного принципала в его собственный keytab:

source: Note that `ext_keytab` stores the extracted key in [.filename]#/etc/krb5.keytab# by default. This is good when being run on the server being kerberized, but the `--keytab _path/to/file_` argument should be used when the keytab is being extracted elsewhere:
ko: `ext_keytab`은 기본적으로 추출된 키를 [.filename]#/etc/krb5.keytab#에 저장한다는 점에 유의하세요. 이는 케르베로스화 되는 서버에서 실행할 때 유용하지만, 키탭을 다른 곳에서 추출할 때는 `—keytab _path/to/file_` 인수를 사용해야 합니다:
ru: Обратите внимание, что `ext_keytab` по умолчанию сохраняет извлечённый ключ в [.filename]#/etc/krb5.keytab#. Это удобно при выполнении на сервере, который керберизируется, но следует использовать аргумент `--keytab _путь/к/файлу_`, когда извлечение keytab происходит на другом устройстве:

source: The keytab can then be securely copied to the server using man:scp[1] or a removable media. Be sure to specify a non-default keytab name to avoid inserting unneeded keys into the system's keytab.
ko: 그런 다음 man:scp[1] 또는 이동식 미디어를 사용하여 키탭(keytab)을 서버에 안전하게 복사할 수 있습니다. 시스템의 키탭에 불필요한 키가 삽입되지 않도록 기본 키탭 이름이 아닌 다른 이름을 지정해야 합니다.
ru: Затем файл keytab можно безопасно скопировать на сервер с помощью man:scp[1] или съемного носителя. Убедитесь, что указано нестандартное имя keytab, чтобы избежать добавления ненужных ключей в системный keytab.

source: At this point, the server can read encrypted messages from the KDC using its shared key, stored in [.filename]#krb5.keytab#. It is now ready for the Kerberos-using services to be enabled. One of the most common such services is man:sshd[8], which supports Kerberos via the GSS-API. In [.filename]#/etc/ssh/sshd_config#, add the line:
ko: 이 시점에서 서버는 [.filename]#krb5.keytab#에 저장된 공유 키를 사용하여 KDC에서 암호화된 메시지를 읽을 수 있습니다. 이제 Kerberos를 사용하는 서비스를 사용할 준비가 되었습니다. 이러한 서비스 중 가장 일반적인 서비스 중 하나는 GSS-API를 통해 Kerberos를 지원하는 man:sshd[8]입니다. [.filename]#/etc/ssh/sshd_config#에 다음 줄을 추가합니다:
ru: На этом этапе сервер может читать зашифрованные сообщения от KDC, используя свой общий ключ, хранящийся в [.filename]#krb5.keytab#. Теперь он готов к включению служб, использующих Kerberos. Одна из самых распространённых таких служб — man:sshd[8], которая поддерживает Kerberos через GSS-API. В файле [.filename]#/etc/ssh/sshd_config# добавьте строку:

source: After making this change, man:sshd[8] must be restarted for the new configuration to take effect: `service sshd restart`.
ko: 변경된 사항을 적용하려면 man:sshd[8]를 다시 시작해야 합니다: `service sshd restart`.
ru: После внесения этого изменения необходимо перезапустить `man:sshd[8]`, чтобы новая конфигурация вступила в силу: `service sshd restart`.

source: Configuring a Client to Use Kerberos
ko: 케르베로스를 사용하는 클라이언트 구성하기
ru: Настройка клиента для использования Kerberos

source: As it was for the server, the client requires configuration in [.filename]#/etc/krb5.conf#. Copy the file in place (securely) or re-enter it as needed.
ko: 서버에서와 마찬가지로 클라이언트에서도 [.filename]#/etc/krb5.conf#에 구성이 필요합니다. 파일을 (안전하게) 복사하거나 필요에 따라 다시 입력합니다.
ru: Как и для сервера, клиенту требуется настройка в [.filename]#/etc/krb5.conf#. Скопируйте файл (безопасным способом) или введите его заново при необходимости.

source: Test the client by using `kinit`, `klist`, and `kdestroy` from the client to obtain, show, and then delete a ticket for an existing principal. Kerberos applications should also be able to connect to Kerberos enabled servers. If that does not work but obtaining a ticket does, the problem is likely with the server and not with the client or the KDC. In the case of kerberized man:ssh[1], GSS-API is disabled by default, so test using `ssh -o GSSAPIAuthentication=yes _hostname_`.
ko: 클라이언트에서 `kinit`, `klist` 및 `kdestroy`를 사용하여 기존 주체에 대한 티켓을 가져와서 표시한 다음 삭제하여 클라이언트를 테스트합니다. Kerberos 애플리케이션도 Kerberos 사용 서버에 연결할 수 있어야 합니다. 그렇게 해도 작동하지 않지만 티켓을 얻는 데는 성공한다면 클라이언트나 KDC가 아니라 서버에 문제가 있을 가능성이 높습니다. 케르베로스화된 man:ssh[1]의 경우 GSS-API는 기본적으로 비활성화되어 있으므로 `ssh -o GSSAPIAuthentication=yes _hostname_`을 사용하여 테스트하세요.
ru: Проверьте клиент, используя `kinit`, `klist` и `kdestroy` на клиенте, чтобы получить, отобразить, а затем удалить билет для существующего принципала. Приложения Kerberos также должны иметь возможность подключаться к серверам с поддержкой Kerberos. Если это не работает, но получение билета проходит успешно, проблема, скорее всего, на стороне сервера, а не клиента или KDC. В случае с kerberized man:ssh[1], GSS-API по умолчанию отключен, поэтому проверьте с помощью `ssh -o GSSAPIAuthentication=yes _имя_хоста_`.

source: When testing a Kerberized application, try using a packet sniffer such as `tcpdump` to confirm that no sensitive information is sent in the clear.
ko: 케르베로스화된 애플리케이션을 테스트할 때는 `tcpdump`와 같은 패킷 스니퍼를 사용하여 민감한 정보가 전송되지 않는지 확인하세요.
ru: При тестировании приложения с поддержкой Kerberos попробуйте использовать анализатор трафика, например `tcpdump`, чтобы убедиться, что конфиденциальная информация не передаётся в открытом виде.

source: Various Kerberos client applications are available. With the advent of a bridge so that applications using SASL for authentication can use GSS-API mechanisms as well, large classes of client applications can use Kerberos for authentication, from Jabber clients to IMAP clients.
ko: 다양한 Kerberos 클라이언트 애플리케이션을 사용할 수 있습니다. 인증에 SASL을 사용하는 애플리케이션이 GSS-API 메커니즘도 사용할 수 있도록 브리지가 등장함에 따라 Jabber 클라이언트에서 IMAP 클라이언트에 이르기까지 다양한 종류의 클라이언트 애플리케이션이 인증에 Kerberos를 사용할 수 있게 되었습니다.
ru: Доступны различные клиентские приложения Kerberos. С появлением моста, позволяющего приложениям, использующим SASL для аутентификации, также применять механизмы GSS-API, широкий спектр клиентских приложений — от клиентов Jabber до клиентов IMAP — может использовать Kerberos для аутентификации.

source: Users within a realm typically have their Kerberos principal mapped to a local user account. Occasionally, one needs to grant access to a local user account to someone who does not have a matching Kerberos principal. For example, `tillman@EXAMPLE.ORG` may need access to the local user account `webdevelopers`. Other principals may also need access to that local account.
ko: 영역(Realm) 내의 사용자는 일반적으로 Kerberos 주체가 로컬 사용자 계정에 매핑되어 있습니다. 때때로 일치하는 Kerberos 주체가 없는 사람에게 로컬 사용자 계정에 대한 액세스 권한을 부여해야 하는 경우가 있습니다. 예를 들어, `tillman@EXAMPLE.ORG`은 로컬 사용자 계정 `webdevelopers`에 대한 액세스 권한이 필요할 수 있습니다. 다른 주체는 해당 로컬 계정에 대한 액세스 권한도 필요할 수 있습니다.
ru: Пользователи в пределах realm обычно имеют свой Kerberos-принципал, сопоставленный с локальной учетной записью. Иногда необходимо предоставить доступ к локальной учетной записи пользователю, у которого нет соответствующего Kerberos-принципала. Например, `tillman@EXAMPLE.ORG` может потребоваться доступ к локальной учетной записи `webdevelopers`. Другие принципалы также могут нуждаться в доступе к этой локальной учетной записи.

source: The [.filename]#.k5login# and [.filename]#.k5users# files, placed in a user's home directory, can be used to solve this problem. For example, if the following [.filename]#.k5login# is placed in the home directory of `webdevelopers`, both principals listed will have access to that account without requiring a shared password:
ko: 사용자의 홈 디렉터리에 있는 [.filename]#.k5login# 및 [.filename]#.k5users# 파일을 사용하여 이 문제를 해결할 수 있습니다. 예를 들어 [.filename]#.k5login#을 `webdevelopers`의 홈 디렉터리에 배치하면 양쪽 주체(Principal) 모두 공유 비밀번호 없이도 해당 계정에 액세스할 수 있습니다:
ru: Файлы [.filename]#.k5login# и [.filename]#.k5users#, размещённые в домашнем каталоге пользователя, могут быть использованы для решения этой проблемы. Например, если следующий [.filename]#.k5login# поместить в домашний каталог пользователя `webdevelopers`, оба указанных принципала получат доступ к этой учётной записи без необходимости использования общего пароля:

source: Refer to man:ksu[1] for more information about [.filename]#.k5users#.
ko: man:ksu[1]에서 [.filename]#.k5users#에 대한 자세한 내용을 참조하세요.
ru: Обратитесь к man:ksu[1] для получения дополнительной информации о [.filename]#.k5users#.

source: MIT Differences
ko: MIT 차이점
ru: Различия MIT

source: The major difference between the MIT and Heimdal implementations is that `kadmin` has a different, but equivalent, set of commands and uses a different protocol. If the KDC is MIT, the Heimdal version of `kadmin` cannot be used to administer the KDC remotely, and vice versa.
ko: MIT와 Heimdal 구현의 가장 큰 차이점은 `kadmin`의 명령 집합이 다르지만 동일하며, 다른 프로토콜을 사용한다는 것입니다. KDC가 MIT인 경우 Heimdal 버전의 `kadmin`을 사용하여 원격으로 KDC를 관리할 수 없으며, 그 반대의 경우도 마찬가지입니다.
ru: Основное различие между реализациями MIT и Heimdal заключается в том, что `kadmin` имеет разные, но эквивалентные наборы команд и использует разные протоколы. Если KDC — MIT, то версия `kadmin` от Heimdal не может использоваться для удалённого администрирования KDC, и наоборот.

source: Client applications may also use slightly different command line options to accomplish the same tasks. Following the instructions at http://web.mit.edu/Kerberos/www/[http://web.mit.edu/Kerberos/www/] is recommended. Be careful of path issues: the MIT port installs into [.filename]#/usr/local/# by default, and the FreeBSD system applications run instead of the MIT versions if `PATH` lists the system directories first.
ko: 클라이언트 애플리케이션은 동일한 작업을 수행하기 위해 약간 다른 명령줄 옵션을 사용할 수도 있습니다. http://web.mit.edu/Kerberos/www/[http://web.mit.edu/Kerberos/www/]의 지침을 따르는 것이 좋습니다. 경로 문제에 주의하세요: MIT 포트는 기본적으로 [.filename]#/usr/local/#에 설치되며, `PATH`에 시스템 디렉터리가 먼저 나열되어 있으면 MIT 버전 대신 FreeBSD 시스템 애플리케이션이 실행됩니다.
ru: Клиентские приложения также могут использовать немного другие параметры командной строки для выполнения тех же задач. Рекомендуется следовать инструкциям на сайте http://web.mit.edu/Kerberos/www/[http://web.mit.edu/Kerberos/www/]. Обратите внимание на пути: порт MIT по умолчанию устанавливается в [.filename]#/usr/local/#, а системные приложения FreeBSD будут запускаться вместо версий MIT, если `PATH` указывает на системные директории в первую очередь.

source: When using MIT Kerberos as a KDC on FreeBSD, the following edits should also be made to [.filename]#rc.conf#:
ko: FreeBSD에서 MIT Kerberos를 KDC로 사용하는 경우 [.filename]#rc.conf#도 다음과 같이 편집해야 합니다:

source: Kerberos Tips, Tricks, and Troubleshooting
ko: 케르베로스 팀과 트릭, 그리고 문제해결
ru: Советы, хитрости и устранение неполадок Kerberos

source: When configuring and troubleshooting Kerberos, keep the following points in mind:
ko: Kerberos를 구성하고 문제를 해결할 때는 다음 사항에 유의하세요:
ru: При настройке и устранении неполадок Kerberos учитывайте следующие моменты:

source: When using either Heimdal or MITKerberos from ports, ensure that the `PATH` lists the port's versions of the client applications before the system versions.
ko: 포트에서 Heimdal 또는 MITKerberos를 사용하는 경우, `PATH`에 시스템 버전보다 먼저 포트의 클라이언트 애플리케이션 버전이 나열되어 있는지 확인하세요.
ru: При использовании Heimdal или MITKerberos из портов убедитесь, что в `PATH` версии клиентских приложений из портов указаны перед системными версиями.

source: If all the computers in the realm do not have synchronized time settings, authentication may fail. crossref:network-servers[network-ntp,“Clock Synchronization with NTP”] describes how to synchronize clocks using NTP.
ko: 영역(Realm) 내 모든 컴퓨터의 시간 설정이 동기화되어 있지 않으면 인증에 실패할 수 있습니다. crossref:network-servers[network-ntp,“Clock Synchronization with NTP”]에서는 NTP를 사용하여 시계를 동기화하는 방법을 설명합니다.
ru: Если временные настройки всех компьютеров в домене не синхронизированы, аутентификация может завершиться неудачей. crossref:network-servers[network-ntp,“Синхронизация часов с помощью NTP”] описывает, как синхронизировать часы с использованием NTP.

source: If the hostname is changed, the `host/` principal must be changed and the keytab updated. This also applies to special keytab entries like the `HTTP/` principal used for Apache's package:www/mod_auth_kerb[].
ko: 호스트명이 변경되면 `host/` 주체(Principal)를 변경하고 keytab을 업데이트해야 합니다. 이는 아파치 package:www/mod_auth_kerb[]에 사용되는 `HTTP/` 주체와 같은 특수 키탭 항목에도 적용됩니다.
ru: Если имя хоста изменено, необходимо изменить принципал `host/` и обновить keytab. Это также относится к особым записям keytab, таким как принципал `HTTP/`, используемый для пакета Apache package:www/mod_auth_kerb[].

source: All hosts in the realm must be both forward and reverse resolvable in DNS or, at a minimum, exist in [.filename]#/etc/hosts#. CNAMEs will work, but the A and PTR records must be correct and in place. The error message for unresolvable hosts is not intuitive: `Kerberos5 refuses authentication because Read req failed: Key table entry not found`.
ko: 영역(Realm)의 모든 호스트는 DNS에서 정방향 및 역방향으로 모두 확인 가능하거나 최소한 [.filename]#/etc/hosts#에 존재해야 합니다. CNAME은 작동하지만 A 및 PTR 레코드가 정확하고 제자리에 있어야 합니다. 확인할 수 없는 호스트에 대한 오류 메시지는 직관적이지 않습니다: `Kerberos5 refuses authentication because Read req failed: Key table entry not found`.
ru: Все узлы в области должны разрешаться как в прямом, так и в обратном направлении через DNS или, как минимум, присутствовать в [.filename]#/etc/hosts#. CNAME-записи будут работать, но A- и PTR-записи должны быть корректными и присутствовать. Сообщение об ошибке для неразрешимых узлов неочевидно: `Kerberos5 refuses authentication because Read req failed: Key table entry not found`.

source: Some operating systems that act as clients to the KDC do not set the permissions for `ksu` to be setuid `root`. This means that `ksu` does not work. This is a permissions problem, not a KDC error.
ko: KDC의 클라이언트 역할을 하는 일부 운영 체제는 `ksu`에 대한 권한을 `root`로 설정하지 않습니다. 즉, `ksu`가 작동하지 않습니다. 이는 KDC 오류가 아니라 권한 문제입니다.
ru: Некоторые операционные системы, выступающие в роли клиентов KDC, не устанавливают для `ksu` права setuid `root`. Это означает, что `ksu` не работает. Это проблема прав доступа, а не ошибка KDC.

source: With MITKerberos, to allow a principal to have a ticket life longer than the default lifetime of ten hours, use `modify_principal` at the man:kadmin[8] prompt to change the `maxlife` of both the principal in question and the `krbtgt` principal. The principal can then use `kinit -l` to request a ticket with a longer lifetime.
ko: MITKerberos에서 티켓 수명을 기본 수명인 10시간보다 길게 하려면 man:kadmin[8] 프롬프트에서 `modify_principal`을 사용하여 해당 주체(Principal)의 `maxlife`와 `krbtgt` 주체(Principal)의 `maxlife`를 모두 변경합니다. 이후 주체(Principal)는 `kinit -l`을 사용하여 더 긴 수명의 티켓을 요청할 수 있습니다.
ru: С использованием MITKerberos, чтобы разрешить принципалу иметь билет сроком действия больше стандартных десяти часов, используйте `modify_principal` в командной строке man:kadmin[8], чтобы изменить `maxlife` как для нужного принципала, так и для принципала `krbtgt`. После этого принципал может использовать `kinit -l` для запроса билета с увеличенным сроком действия.

source: When running a packet sniffer on the KDC to aid in troubleshooting while running `kinit` from a workstation, the Ticket Granting Ticket (TGT) is sent immediately, even before the password is typed. This is because the Kerberos server freely transmits a TGT to any unauthorized request. However, every TGT is encrypted in a key derived from the user's password. When a user types their password, it is not sent to the KDC, it is instead used to decrypt the TGT that `kinit` already obtained. If the decryption process results in a valid ticket with a valid time stamp, the user has valid Kerberos credentials. These credentials include a session key for establishing secure communications with the Kerberos server in the future, as well as the actual TGT, which is encrypted with the Kerberos server's own key. This second layer of encryption allows the Kerberos server to verify the authenticity of each TGT.
ko: 워크스테이션에서 `kinit`을 실행하는 동안 문제 해결을 돕기 위해 KDC에서 패킷 스니퍼를 실행하면 비밀번호를 입력하기 전에도 티켓 부여 티켓(TGT)이 즉시 전송됩니다. 이는 Kerberos 서버가 승인되지 않은 요청에 대해 TGT를 자유롭게 전송하기 때문입니다. 그러나 모든 TGT는 사용자의 비밀번호에서 파생된 키로 암호화됩니다. 사용자가 비밀번호를 입력할 때, 비밀번호는 KDC로 전송되지 않고 대신 `kinit`이 이미 획득한 TGT를 해독하는 데 사용됩니다. 복호화 프로세스에서 유효한 타임스탬프가 있는 유효한 티켓이 생성되면 사용자는 유효한 Kerberos 자격 증명을 갖게 됩니다. 이러한 자격 증명에는 향후 Kerberos 서버와의 보안 통신을 설정하기 위한 세션 키와 Kerberos 서버의 자체 키로 암호화된 실제 TGT가 포함됩니다. 이 두 번째 암호화 계층을 통해 Kerberos 서버는 각 TGT의 진위 여부를 확인할 수 있습니다.
ru: При запуске сниффера пакетов на KDC для устранения неполадок во время выполнения `kinit` с рабочей станции, билет на получение билетов (TGT) отправляется немедленно, даже до ввода пароля. Это происходит потому, что сервер Kerberos свободно передаёт TGT на любой неавторизованный запрос. Однако каждый TGT зашифрован с использованием ключа, производного от пароля пользователя. Когда пользователь вводит свой пароль, он не отправляется на KDC, а вместо этого используется для расшифровки TGT, который `kinit` уже получил. Если процесс расшифровки приводит к действительному билету с корректной временной меткой, пользователь получает действительные учётные данные Kerberos. Эти учётные данные включают в себя сеансовый ключ для установления безопасного соединения с сервером Kerberos в будущем, а также сам TGT, зашифрованный собственным ключом сервера Kerberos. Этот второй уровень шифрования позволяет серверу Kerberos проверять подлинность каждого TGT.

source: Host principals can have a longer ticket lifetime. If the user principal has a lifetime of a week but the host being connected to has a lifetime of nine hours, the user cache will have an expired host principal and the ticket cache will not work as expected.
ko: 호스트 주체는 티켓 수명이 더 길 수 있습니다. 사용자 주체의 수명이 일주일이지만 연결 중인 호스트의 수명이 9시간인 경우에는 사용자 캐시에 만료된 호스트 주체가 있고 티켓 캐시가 예상대로 작동하지 않습니다.
ru: Принципалы хостов могут иметь более длительное время жизни билета. Если принципал пользователя имеет время жизни в неделю, а у хоста, к которому происходит подключение, время жизни составляет девять часов, кэш пользователя будет содержать просроченный принципал хоста, и кэш билетов не будет работать должным образом.
