Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: Hundreds of standard practices have been authored about how to secure systems and networks, and as a user of FreeBSD, understanding how to protect against attacks and intruders is a must
ko: 시스템과 네트워크를 보호하는 방법에 대한 수백 가지의 표준 관행이 작성되어 있으며, FreeBSD 사용자는 공격과 침입자로부터 보호하는 방법을 이해하는 것은 필수입니다
ru: Описаны сотни стандартных практик о том, как защитить системы и сети, и для пользователя FreeBSD понимание того, как защититься от атак и злоумышленников, является обязательным

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 15. Security
ko: 15장. 보안

source: Security
ko: 보안
ru: Безопасность

source: Synopsis
ko: 요약
ru: Обзор

source: Security, whether physical or virtual, is a topic so broad that an entire industry has evolved around it. Hundreds of standard practices have been authored about how to secure systems and networks, and as a user of FreeBSD, understanding how to protect against attacks and intruders is a must.
ko: 물리적이든 가상이든 보안은 매우 광범위한 주제이며, 전체 산업은 보안을 중심으로 발전해 왔습니다. 시스템과 네트워크를 보호하는 방법에 대한 수백 가지의 표준 관행이 작성되었으며, FreeBSD 사용자라면 공격과 침입자로부터 보호하는 방법을 이해하는 것은 필수입니다.

source: In this chapter, several fundamentals and techniques will be discussed. The FreeBSD system comes with multiple layers of security, and many more third party utilities may be added to enhance security.
ko: 이 장에서는 몇 가지 기본 사항과 기술에 대해 설명합니다. FreeBSD 시스템에는 여러 계층의 보안이 제공되며, 보안을 강화하기 위해 더 많은 타사 유틸리티를 추가할 수 있습니다.
ru: В этой главе будут рассмотрены несколько основополагающих принципов и методов. Система FreeBSD включает в себя несколько уровней безопасности, а также множество сторонних утилит, которые могут быть добавлены для её усиления.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:

source: Basic FreeBSD system security concepts.
ko: 기본적인 FreeBSD 시스템 보안 개념.
ru: Основные концепции безопасности системы FreeBSD.

source: The various crypt mechanisms available in FreeBSD.
ko: FreeBSD에서 사용할 수 있는 다양한 암호화 메커니즘.
ru: Доступные в FreeBSD механизмы шифрования.

source: How to set up one-time password authentication.
ko: 일회용 비밀번호 인증을 설정하는 방법.

source: How to configure TCP Wrapper for use with man:inetd[8].
ko: man:inetd[8]을 사용해 TCP 래퍼를 구성하는 방법.

source: How to set up Kerberos on FreeBSD.
ko: FreeBSD에서 Kerberos를 설정하는 방법.
ru: Как настроить Kerberos на FreeBSD.

source: How to configure IPsec and create a VPN.
ko: IPsec을 구성하고 VPN을 만드는 방법.

source: How to configure and use OpenSSH on FreeBSD.
ko: FreeBSD에서 OpenSSH를 구성하고 사용하는 방법.
ru: Как настроить и использовать OpenSSH на FreeBSD.

source: How to use file system ACLs.
ko: 파일 시스템 ACL을 사용하는 방법.
ru: Как использовать ACL файловых систем.

source: How to use pkg to audit third party software packages installed from the Ports Collection.
ko: pkg를 사용하여 포트 컬렉션에서 설치된 타사 소프트웨어 패키지를 감사하는 방법.
ru: Как использовать pkg для аудита сторонних программных пакетов, установленных из Коллекции портов.

source: How to utilize FreeBSD security advisories.
ko: FreeBSD 보안 권고를 활용하는 방법.
ru: Как использовать рекомендации по безопасности FreeBSD.

source: What Process Accounting is and how to enable it on FreeBSD.
ko: 프로세스 어카운팅이란 무엇이며 FreeBSD에서 이를 활성화하는 방법.
ru: Что такое учёт процессов и как его включить в FreeBSD.

source: How to control user resources using login classes or the resource limits database.
ko: 로그인 클래스 또는 리소스 제한 데이터베이스를 사용하여 사용자 리소스를 제어하는 방법.
ru: Как управлять ресурсами пользователей с помощью классов входа или базы данных ограничений ресурсов.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:

source: Understand basic FreeBSD and Internet concepts.
ko: 기본적인 FreeBSD 사용법 및 인터넷의 개념.

source: Additional security topics are covered elsewhere in this Handbook. For example, Mandatory Access Control is discussed in crossref:mac[mac,Mandatory Access Control] and Internet firewalls are discussed in crossref:firewalls[firewalls,Firewalls].
ko: 추가 보안 주제는 이 핸드북의 다른 곳에서 다룹니다. 예를 들어, 필수 액세스 제어는 crossref:mac[mac,Mandatory Access Control]에서, 인터넷 방화벽은 crossref:firewalls[firewalls,Firewalls]에서 설명합니다.

source: Introduction
ko: 소개
ru: Введение

source: Security is everyone's responsibility. A weak entry point in any system could allow intruders to gain access to critical information and cause havoc on an entire network. One of the core principles of information security is the CIA triad, which stands for the Confidentiality, Integrity, and Availability of information systems.
ko: 보안은 모두의 책임입니다. 모든 시스템의 진입 지점이 취약하면 침입자가 중요한 정보에 액세스하여 전체 네트워크에 혼란을 일으킬 수 있습니다. 정보 보안의 핵심 원칙 중 하나는 정보 시스템의 기밀성, 무결성, 가용성을 의미하는 CIA 삼원칙입니다.
ru: Безопасность — это ответственность каждого. Слабое звено в любой системе может позволить злоумышленникам получить доступ к важной информации и нанести ущерб всей сети. Один из основных принципов информационной безопасности — триада КИД, которая означает Конфиденциальность, Целостность и Доступность информационных систем.

source: The CIA triad is a bedrock concept of computer security as customers and users expect their data to be protected. For example, a customer expects that their credit card information is securely stored (confidentiality), that their orders are not changed behind the scenes (integrity), and that they have access to their order information at all times (availability).
ko: CIA 삼원칙은 고객과 사용자가 자신의 데이터가 보호받기를 바라는 컴퓨터 보안의 기본 개념입니다. 예를 들어, 고객은 자신의 신용카드 정보가 안전하게 저장되고(기밀성), 주문이 뒤에서 변경되지 않으며(무결성), 주문 정보에 항상 액세스할 수 있기를 기대합니다(가용성).
ru: Триада КИД (конфиденциальность, целостность, доступность) — это фундаментальная концепция безопасности в компьютерных системах, так как клиенты и пользователи ожидают, что их данные будут защищены. Например, клиент ожидает, что информация о его кредитной карте хранится безопасно (конфиденциальность), что его заказы не будут изменены без его ведома (целостность) и что он в любое время сможет получить доступ к информации о своих заказах (доступность).

source: To provide CIA, security professionals apply a defense in depth strategy. The idea of defense in depth is to add several layers of security to prevent one single layer failing and the entire security system collapsing. For example, a system administrator cannot simply turn on a firewall and consider the network or system secure. One must also audit accounts, check the integrity of binaries, and ensure malicious tools are not installed. To implement an effective security strategy, one must understand threats and how to defend against them.
ko: 보안 전문가는 CIA에 심층 방어 전략을 적용합니다. 심층 방어의 개념은 하나의 계층이 실패하여 전체 보안 시스템이 무너지는 것을 방지하기 위해 여러 계층의 보안을 추가하는 것입니다. 예를 들어, 시스템 관리자는 단순히 방화벽을 켜고 네트워크나 시스템이 안전하다고 생각할 수 없습니다. 또한 계정을 감사하고 바이너리의 무결성을 확인하며 악성 도구가 설치되지 않았는지 확인해야 합니다. 효과적인 보안 전략을 구현하려면 위협과 이를 방어하는 방법을 이해해야 합니다.
ru: Для обеспечения КИД специалисты по безопасности применяют стратегию "глубокой эшелонированной защиты". Идея глубокой эшелонированной защиты заключается в добавлении нескольких уровней безопасности, чтобы предотвратить отказ одного уровня и полный крах всей системы безопасности. Например, системный администратор не может просто включить межсетевой экран и считать сеть или систему безопасными. Необходимо также проводить аудит учетных записей, проверять целостность бинарных файлов и убеждаться, что вредоносные инструменты не установлены. Для реализации эффективной стратегии безопасности необходимо понимать угрозы и способы защиты от них.

source: What is a threat as it pertains to computer security? Threats are not limited to remote attackers who attempt to access a system without permission from a remote location. Threats also include employees, malicious software, unauthorized network devices, natural disasters, security vulnerabilities, and even competing corporations.
ko: 컴퓨터 보안과 관련된 위협이란 무엇일까요? 위협은 원격 위치에서 허가 없이 시스템에 액세스하려는 원격 공격자에게만 국한되지 않습니다. 위협에는 직원, 악성 소프트웨어, 승인되지 않은 네트워크 장치, 자연 재해, 보안 취약성, 심지어 경쟁 기업도 포함됩니다.
ru: Что такое угроза в контексте компьютерной безопасности? Угрозы не ограничиваются удаленными злоумышленниками, которые пытаются получить доступ к системе без разрешения из удаленного местоположения. Угрозы также включают сотрудников, вредоносное программное обеспечение, несанкционированные сетевые устройства, стихийные бедствия, уязвимости безопасности и даже конкурирующие компании.

source: Systems and networks can be accessed without permission, sometimes by accident, or by remote attackers, and in some cases, via corporate espionage or former employees. As a user, it is important to prepare for and admit when a mistake has led to a security breach and report possible issues to the security team. As an administrator, it is important to know of the threats and be prepared to mitigate them.
ko: 시스템과 네트워크는 때로는 실수로, 때로는 원격 공격자에 의해, 때로는 기업 스파이나 전직 직원을 통해 무단으로 액세스될 수 있습니다. 사용자는 실수로 인해 보안 침해가 발생했을 때 이에 대비하고 인정하며 보안 팀에 가능한 문제를 보고하는 것이 중요합니다. 관리자는 위협을 파악하고 이를 완화할 수 있도록 준비하는 것이 중요합니다.
ru: Системы и сети могут быть доступны без разрешения, иногда случайно, или удаленными злоумышленниками, а в некоторых случаях — посредством корпоративного шпионажа или действий бывших сотрудников. Как пользователю, важно быть готовым признать, когда ошибка привела к нарушению безопасности, и сообщить о возможных проблемах команде безопасности. Как администратору, важно знать об угрозах и быть готовым к их устранению.

source: When applying security to systems, it is recommended to start by securing the basic accounts and system configuration, and then to secure the network layer so that it adheres to the system policy and the organization's security procedures. Many organizations already have a security policy that covers the configuration of technology devices. The policy should include the security configuration of workstations, desktops, mobile devices, phones, production servers, and development servers. In many cases, standard operating procedures (SOPs) already exist. When in doubt, ask the security team.
ko: 시스템에 보안을 적용할 때는 기본 계정과 시스템 구성을 보호하는 것부터 시작한 다음, 시스템 정책과 조직의 보안 절차를 준수할 수 있도록 네트워크 계층을 보호하는 것이 좋습니다. 많은 조직이 이미 기술 디바이스 구성을 다루는 보안 정책을 가지고 있습니다. 이 정책에는 워크스테이션, 데스크톱, 모바일 디바이스, 휴대폰, 프로덕션 서버 및 개발 서버의 보안 구성이 포함되어야 합니다. 대부분의 경우 표준 운영 절차(SOP)가 이미 존재합니다. 확실하지 않은 경우 보안팀에 문의하세요.
ru: Применяя меры безопасности к системам, рекомендуется начать с защиты базовых учетных записей и конфигурации системы, а затем обеспечить безопасность сетевого уровня, чтобы он соответствовал политике системы и процедурам безопасности организации. Многие организации уже имеют политику безопасности, которая охватывает конфигурацию технологических устройств. Эта политика должна включать настройки безопасности рабочих станций, настольных компьютеров, мобильных устройств, телефонов, производственных серверов и серверов разработки. Во многих случаях уже существуют стандартные операционные процедуры (СОП). Если возникают сомнения, обратитесь к команде безопасности.

source: The rest of this introduction describes how some of these basic security configurations are performed on a FreeBSD system. The rest of this chapter describes some specific tools which can be used when implementing a security policy on a FreeBSD system.
ko: 이 소개의 나머지 부분에서는 이러한 기본 보안 구성 중 일부가 FreeBSD 시스템에서 어떻게 수행되는지 설명합니다. 그리고 이 장의 나머지 부분에서는 FreeBSD 시스템에서 보안 정책을 구현할 때 사용할 수 있는 몇 가지 도구에 대해 설명합니다.

source: Preventing Logins
ko: 로그인 방지
ru: Предотвращение входов в систему

source: In securing a system, a good starting point is an audit of accounts. Ensure that `root` has a strong password and that this password is not shared. Disable any accounts that do not need login access.
ko: 시스템 보안에 있어 가장 좋은 출발점은 계정 감사입니다. `root`에 강력한 비밀번호가 설정되어 있는지, 이 비밀번호가 공유되지 않았는지 확인하세요. 로그인 액세스가 필요하지 않은 계정은 모두 비활성화하세요.

source: To deny login access to accounts, two methods exist. The first is to lock the account. This example locks the `toor` account:
ko: 계정에 대한 로그인 액세스를 거부하는 방법에는 두 가지가 있습니다. 첫 번째는 계정을 잠그는 것입니다. 이 예에서는 `toor` 계정을 잠급니다:

source: The second method is to prevent login access by changing the shell to [.filename]#/usr/sbin/nologin#. Only the superuser can change the shell for other users:
ko: 두 번째 방법은 셸을 [.filename]#/usr/sbin/nologin#으로 변경하여 로그인 액세스를 방지하는 것입니다. 수퍼유저만 다른 사용자의 셸을 변경할 수 있습니다:

source: The [.filename]#/usr/sbin/nologin# shell prevents the system from assigning a shell to the user when they attempt to login.
ko: [.filename]#/usr/sbin/nologin# 셸은 사용자가 로그인을 시도할 때 시스템에서 사용자에게 셸을 할당하지 못하도록 합니다.

source: Permitted Account Escalation
ko: 허용된 계정 승격

source: In some cases, system administration needs to be shared with other users. FreeBSD has two methods to handle this. The first one, which is not recommended, is a shared root password used by members of the `wheel` group. With this method, a user types `su` and enters the password for `wheel` whenever superuser access is needed. The user should then type `exit` to leave privileged access after finishing the commands that required administrative access. To add a user to this group, edit [.filename]#/etc/group# and add the user to the end of the `wheel` entry. The user must be separated by a comma character with no space.
ko: 경우에 따라 시스템 관리를 다른 사용자와 공유해야 하는 경우가 있습니다. FreeBSD에는 이를 처리하는 두 가지 방법이 있습니다. 첫 번째 방법은 권장되지 않는 방법이지만, `wheel` 그룹의 구성원들이 사용하는 공유 루트 암호입니다. 이 방법을 사용하면, 사용자는 수퍼유저 접근이 필요할 때마다 `su`를 입력하고 `wheel`의 암호를 입력합니다. 그런 다음 사용자는 관리 액세스 권한이 필요한 명령을 완료한 후 `exit`를 입력하여 권한 있는 액세스 권한을 종료해야 합니다. 이 그룹에 사용자를 추가하려면 [.filename]#/etc/group#을 편집하고 `wheel` 항목의 끝에 사용자를 추가합니다. 사용자는 공백 없이 쉼표로 구분해야 합니다.

source: The second, and recommended, method to permit privilege escalation is to install the package:security/sudo[] package or port. This software provides additional auditing, more fine-grained user control, and can be configured to lock users into running only the specified privileged commands.
ko: 권한 상승을 허용하는 두 번째 방법이자 권장되는 방법은 package:security/sudo[] 패키지 또는 포트를 설치하는 것입니다. 이 소프트웨어는 추가 감사와 보다 세분화된 사용자 제어 기능을 제공하며 사용자가 지정된 권한 명령만 실행하도록 제한할 수 있습니다.

source: After installation, use `visudo` to edit [.filename]#/usr/local/etc/sudoers#. This example creates a new `webadmin` group, adds the `trhodes` account to that group, and configures that group access to restart package:apache24[]:
ko: 설치 후, `visudo`를 사용하여 [.filename]#/usr/local/etc/sudoers#를 편집합니다. 이 예제에서는 새로운 `webadmin` 그룹을 생성하고, 해당 그룹에 `trhodes` 계정을 추가한 다음, package:apache24[]를 재시작하도록 해당 그룹 액세스를 구성합니다:

source: Password Hashes
ko: 암호 해시
ru: Хеши паролей

source: Passwords are a necessary evil of technology. When they must be used, they should be complex and a powerful hash mechanism should be used to encrypt the version that is stored in the password database. FreeBSD supports the DES, MD5, SHA256, SHA512, and Blowfish hash algorithms in its `crypt()` library. The default of SHA512 should not be changed to a less secure hashing algorithm, but can be changed to the more secure Blowfish algorithm.
ko: 비밀번호는 기술의 필요악입니다. 암호를 사용해야 하는 경우, 암호는 복잡해야 하며 암호 데이터베이스에 저장된 버전을 암호화하기 위해 강력한 해시 메커니즘을 사용해야 합니다. FreeBSD는 `crypt()` 라이브러리에서 DES, MD5, SHA256, SHA512 및 Blowfish 해시 알고리즘을 지원합니다. 기본값인 SHA512는 보안성이 낮은 해싱 알고리즘으로 변경해서는 안 되며, 보안성이 높은 Blowfish 알고리즘으로 변경할 수 있습니다.

source: Blowfish is not part of AES and is not considered compliant with any Federal Information Processing Standards (FIPS). Its use may not be permitted in some environments.
ko: 블로우피쉬(Blowfish)는 AES의 일부가 아니며 연방 정보 처리 표준(FIPS)을 준수하는 것으로 간주되지 않습니다. 일부 환경에서는 사용이 허용되지 않을 수 있습니다.
ru: Blowfish не является частью AES и не соответствует Федеральным стандартам обработки информации (FIPS). Его использование может быть запрещено в некоторых средах.

source: To determine which hash algorithm is used to encrypt a user's password, the superuser can view the hash for the user in the FreeBSD password database. Each hash starts with a symbol which indicates the type of hash mechanism used to encrypt the password. If DES is used, there is no beginning symbol. For MD5, the symbol is `$`. For SHA256 and SHA512, the symbol is `$6$`. For Blowfish, the symbol is `$2a$`. In this example, the password for `dru` is hashed using the default SHA512 algorithm as the hash starts with `$6$`. Note that the encrypted hash, not the password itself, is stored in the password database:
ko: 사용자의 암호를 암호화하는 데 사용되는 해시 알고리즘을 확인하기 위해 수퍼유저는 FreeBSD 암호 데이터베이스에서 사용자의 해시를 볼 수 있습니다. 각 해시는 비밀번호를 암호화하는 데 사용되는 해시 메커니즘의 유형을 나타내는 기호로 시작합니다. DES를 사용하는 경우 시작 기호가 없습니다. MD5의 경우 기호는 `$`입니다. SHA256 및 SHA512의 경우 기호는 `$6$`입니다. Blowfish의 경우 기호는 `$2a$`입니다. 이 예제에서는 해시가 `$6$`로 시작하므로 `dru`의 비밀번호는 기본 SHA512 알고리즘을 사용하여 해시됩니다. 비밀번호 자체가 아닌 암호화된 해시가 비밀번호 데이터베이스에 저장된다는 점에 유의하세요:

source: The hash mechanism is set in the user's login class. For this example, the user is in the `default` login class and the hash algorithm is set with this line in [.filename]#/etc/login.conf#:
ko: 해시 메커니즘은 사용자의 로그인 클래스에서 설정됩니다. 이 예제에서는 사용자가 ‘default’ 로그인 클래스에 있으며 해시 알고리즘은 [.filename]#/etc/login.conf#에 다음 줄로 설정되어 있습니다:

source: To change the algorithm to Blowfish, modify that line to look like this:
ko: 알고리즘을 블로우피쉬로 변경하려면 해당 줄을 다음과 같이 수정합니다:

source: Then run `cap_mkdb /etc/login.conf` as described in <<users-limiting>>. Note that this change will not affect any existing password hashes. This means that all passwords should be re-hashed by asking users to run `passwd` in order to change their password.
ko: 그런 다음 <<users-limiting>>>에 설명된 대로 `cap_mkdb /etc/login.conf`를 실행합니다. 이 변경 사항은 기존 비밀번호 해시에는 영향을 미치지 않습니다. 즉, 비밀번호를 변경하려면 사용자에게 `passwd`를 실행하도록 요청하여 모든 비밀번호를 다시 해시해야 합니다.

source: For remote logins, two-factor authentication should be used. An example of two-factor authentication is "something you have", such as a key, and "something you know", such as the passphrase for that key. Since OpenSSH is part of the FreeBSD base system, all network logins should be over an encrypted connection and use key-based authentication instead of passwords. For more information, refer to <<openssh>>. Kerberos users may need to make additional changes to implement OpenSSH in their network. These changes are described in <<kerberos5>>.
ko: 원격 로그인의 경우 2단계 인증을 사용해야 합니다. 2단계 인증의 예로는 키와 같은 “가지고 있는 것”과 해당 키의 암호와 같은 “알고 있는 것”이 있습니다. OpenSSH는 FreeBSD 기본 시스템의 일부이므로 모든 네트워크 로그인은 암호화된 연결을 통해 이루어져야 하며 비밀번호 대신 키 기반 인증을 사용해야 합니다. 자세한 내용은 <<openssh>>을 참조하세요. Kerberos 사용자는 네트워크에서 OpenSSH를 구현하기 위해 추가 변경을 수행해야 할 수 있습니다. 이러한 변경 사항은 <<kerberos5>>에 설명되어 있습니다.

source: Password Policy Enforcement
ko: 비밀번호 정책 시행
ru: Политика применения паролей

source: Enforcing a strong password policy for local accounts is a fundamental aspect of system security. In FreeBSD, password length, password strength, and password complexity can be implemented using built-in Pluggable Authentication Modules (PAM).
ko: 로컬 계정에 강력한 암호 정책을 시행하는 것은 시스템 보안의 기본 요소입니다. FreeBSD에서는 내장된 PAM(플러그 가능한 인증 모듈)을 사용하여 암호 길이, 암호 강도 및 암호 복잡성을 구현할 수 있습니다.
ru: Обеспечение строгой политики паролей для локальных учетных записей является основополагающим аспектом безопасности системы. В FreeBSD длина пароля, его стойкость и сложность могут быть реализованы с использованием встроенных подключаемых модулей аутентификации (Pluggable Authentication Modules - PAM).

source: This section demonstrates how to configure the minimum and maximum password length and the enforcement of mixed characters using the [.filename]#pam_passwdqc.so# module. This module is enforced when a user changes their password.
ko: 이 섹션에서는 [.filename]#pam_passwdqc.so# 모듈을 사용하여 최소 및 최대 비밀번호 길이와 혼합 문자 적용을 구성하는 방법에 대해 설명합니다. 이 모듈은 사용자가 비밀번호를 변경할 때 적용됩니다.

source: To configure this module, become the superuser and uncomment the line containing `pam_passwdqc.so` in [.filename]#/etc/pam.d/passwd#. Then, edit that line to match the password policy:
ko: 이 모듈을 구성하려면 수퍼유저가 되어 [.filename]#/etc/pam.d/passwd#의 `pam_passwdqc.so`가 포함된 줄의 주석 처리를 해제합니다. 그런 다음 비밀번호 정책과 일치하도록 해당 줄을 편집합니다:

source: This example sets several requirements for new passwords. The `min` setting controls the minimum password length. It has five values because this module defines five different types of passwords based on their complexity. Complexity is defined by the type of characters that must exist in a password, such as letters, numbers, symbols, and case. The types of passwords are described in man:pam_passwdqc[8]. In this example, the first three types of passwords are disabled, meaning that passwords that meet those complexity requirements will not be accepted, regardless of their length. The `12` sets a minimum password policy of at least twelve characters, if the password also contains characters with three types of complexity. The `10` sets the password policy to also allow passwords of at least ten characters, if the password contains characters with four types of complexity.
ko: 이 예에서는 새 비밀번호에 대한 몇 가지 요구 사항을 설정합니다. `min` 설정은 최소 비밀번호 길이를 제어합니다. 이 모듈은 복잡도에 따라 다섯 가지 유형의 비밀번호를 정의하기 때문에 다섯 가지 값이 있습니다. 복잡도는 문자, 숫자, 특수문자, 대/소문자 등 비밀번호에 포함되어야 하는 문자 유형에 따라 정의됩니다. 비밀번호의 유형은 man:pam_passwdqc[8]에 설명되어 있습니다. 이 예에서는 처음 세 가지 유형의 비밀번호가 비활성화되어 있으므로 이러한 복잡도 요구 사항을 충족하는 비밀번호는 길이에 관계없이 허용되지 않습니다. `12`는 비밀번호에 세 가지 유형의 복잡도를 가진 문자가 포함된 경우 최소 12자 이상의 비밀번호 정책을 설정합니다. `10`은 비밀번호에 4가지 유형의 복잡도를 가진 문자가 포함된 경우 최소 10자 이상의 비밀번호도 허용하도록 비밀번호 정책을 설정합니다.

source: The `similar` setting denies passwords that are similar to the user's previous password. The `retry` setting provides a user with three opportunities to enter a new password.
ko: `similar` 설정은 사용자의 이전 비밀번호와 유사한 비밀번호를 거부합니다. `retry` 설정은 사용자에게 새 비밀번호를 입력할 수 있는 세 번의 기회를 제공합니다.

source: Once this file is saved, a user changing their password will see a message similar to the following:
ko: 이 파일이 저장되면 비밀번호를 변경하는 사용자에게 다음과 유사한 메시지가 표시됩니다:
ru: После сохранения этого файла пользователь, изменяющий свой пароль, увидит сообщение, похожее на следующее:

source: If a password that does not match the policy is entered, it will be rejected with a warning and the user will have an opportunity to try again, up to the configured number of retries.
ko: 정책과 일치하지 않는 비밀번호를 입력하면 경고와 함께 거부되며 사용자는 구성된 재시도 횟수까지 다시 시도할 수 있는 기회를 갖게 됩니다.
ru: Если вводится пароль, не соответствующий политике, он будет отклонён с предупреждением, и пользователю будет предоставлена возможность попробовать снова, но не более установленного количества попыток.

source: Most password policies require passwords to expire after so many days. To set a password age time in FreeBSD, set `passwordtime` for the user's login class in [.filename]#/etc/login.conf#. The `default` login class contains an example:
ko: 대부분의 암호 정책은 암호가 특정 날짜 후에 만료되도록 요구합니다. FreeBSD에서 비밀번호 유효기간을 설정하려면 [.filename]#/etc/login.conf#에서 사용자의 로그인 클래스에 대해 `passwordtime`을 설정합니다. `default` 로그인 클래스에 예제가 포함되어 있습니다:

source: So, to set an expiry of 90 days for this login class, remove the comment symbol (`+#+`), save the edit, and run `cap_mkdb /etc/login.conf`.
ko: 따라서 이 로그인 클래스의 만료일을 90일로 설정하려면 주석 기호(`+#+`)를 제거하고 편집 내용을 저장한 후 `cap_mkdb /etc/login.conf`를 실행합니다.

source: To set the expiration on individual users, pass an expiration date or the number of days to expiry and a username to `pw`:
ko: 개별 사용자에 대해 만료일을 설정하려면 만료일 또는 만료일까지의 일수와 사용자 아이디를 `pw`로 전달합니다:
ru: Чтобы установить срок действия для отдельных пользователей, передайте дату истечения срока или количество дней до истечения и имя пользователя в `pw`:

source: As seen here, an expiration date is set in the form of day, month, and year. For more information, see man:pw[8].
ko: 여기에서 볼 수 있듯이 만료 날짜는 일, 월, 연도의 형태로 설정됩니다. 자세한 내용은 man:pw[8]을 참조하세요.
ru: Как показано здесь, срок действия устанавливается в виде дня, месяца и года. Для получения дополнительной информации см. man:pw[8].

source: Detecting Rootkits
ko: 루트킷 감지
