Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: OpenSSH is a set of network connectivity tools used to provide secure access to remote machines. Additionally, TCP/IP connections can be tunneled or forwarded securely through SSH connections. OpenSSH encrypts all traffic to eliminate eavesdropping, connection hijacking, and other network-level attacks.
ru: OpenSSH — это набор сетевых инструментов для подключения, которые используются для обеспечения безопасного доступа к удаленным машинам. Кроме того, TCP/IP-соединения могут быть туннелированы или перенаправлены через SSH-соединения с обеспечением безопасности. OpenSSH шифрует весь трафик, чтобы исключить прослушивание, перехват соединений и другие атаки на сетевом уровне.

source: When data is sent over the network in an unencrypted form, network sniffers anywhere in between the client and server can steal user/password information or data transferred during the session. OpenSSH offers a variety of authentication and encryption methods to prevent this from happening.
ru: Когда данные передаются по сети в незашифрованном виде, снифферы где-либо между клиентом и сервером могут украсть информацию о пользователе/пароле или данные, передаваемые во время сеанса. OpenSSH предлагает различные методы аутентификации и шифрования, чтобы предотвратить это.

source: More information about OpenSSH is available in the link:https://www.openssh.com/[web page].
ru: Дополнительная информация о OpenSSH доступна на link:https://www.openssh.com/[веб-сайте].

source: This section provides an overview of the built-in client utilities to securely access other systems and securely transfer files from a FreeBSD system. It then describes how to configure a SSH server on a FreeBSD system.
ru: В этом разделе представлен обзор встроенных клиентских утилит для безопасного доступа к другим системам и безопасной передачи файлов с системы FreeBSD. Затем описывается, как настроить SSH-сервер на системе FreeBSD.

source: As stated, this chapter will cover the base system version of OpenSSH. A version of OpenSSH is also available in the package:security/openssh-portable[], which provides additional configuration options and is updated with new features more regularly.
ru: Как уже упоминалось, в этой главе будет рассмотрена базовая версия OpenSSH. Также доступна версия OpenSSH в пакете package:security/openssh-portable[], которая предоставляет дополнительные параметры конфигурации и регулярно обновляется с новыми функциями.

source: To log into a SSH server, use man:ssh[1] and specify a username that exists on that server and the IP address or hostname of the server. If this is the first time a connection has been made to the specified server, the user will be prompted to first verify the server's fingerprint:
ru: Для входа на SSH-сервер используйте man:ssh[1], указав имя пользователя, существующее на этом сервере, и IP-адрес или имя хоста сервера. Если подключение к указанному серверу выполняется впервые, пользователю будет предложено сначала подтвердить его отпечаток:

source: SSH utilizes a key fingerprint system to verify the authenticity of the server when the client connects. When the user accepts the key's fingerprint by typing `yes` when connecting for the first time, a copy of the key is saved to [.filename]#~/.ssh/known_hosts# in the user's home directory. Future attempts to login are verified against the saved key and man:ssh[1] will display an alert if the server's key does not match the saved key. If this occurs, the user should first verify why the key has changed before continuing with the connection.
ru: SSH использует систему отпечатков ключей для проверки подлинности сервера при подключении клиента. Когда пользователь принимает отпечаток ключа, введя `yes` при первом подключении, копия ключа сохраняется в файле [.filename]#~/.ssh/known_hosts# в домашнем каталоге пользователя. Последующие попытки входа проверяются по сохранённому ключу, и man:ssh[1] выведет предупреждение, если ключ сервера не совпадает с сохранённым. В таком случае пользователю следует сначала проверить, почему изменился ключ, прежде чем продолжать подключение.

source: How to perform this check is outside the scope of this chapter.
ru: Как выполнить эту проверку, выходит за рамки данной главы.

source: Use man:scp[1] to securely copy a file to or from a remote machine.
ru: Используйте man:scp[1] для безопасного копирования файла на удалённую машину или с неё.

source: This example copies `COPYRIGHT` on the remote system to a file of the same name in the current directory of the local system:
ru: Этот пример копирует файл `COPYRIGHT` на удалённой системе в файл с тем же именем в текущем каталоге локальной системы:

source: The arguments passed to man:scp[1] are similar to man:cp[1]. The file or files to copy is the first argument and the destination to copy to is the second. Since the file is fetched over the network, one or more of the file arguments takes the form `user@host:<path_to_remote_file>`. Be aware when copying directories recursively that man:scp[1] uses `-r`, whereas man:cp[1] uses `-R`.
ru: Аргументы, передаваемые в man:scp[1], аналогичны аргументам man:cp[1]. Первым аргументом указывается файл или файлы для копирования, а вторым — место назначения. Поскольку файл передаётся по сети, один или несколько аргументов с файлами имеют вид `user@host:<путь_к_удалённому_файлу>`. Обратите внимание, что при рекурсивном копировании каталогов man:scp[1] использует `-r`, тогда как man:cp[1] использует `-R`.

source: To open an interactive session for copying files, use man:sftp[1].
ru: Чтобы открыть интерактивную сессию для копирования файлов, используйте man:sftp[1].

source: Refer to man:sftp[1] for a list of available commands while in an man:sftp[1] session.
ru: Обратитесь к man:sftp[1] для получения списка доступных команд во время сеанса man:sftp[1].

source: Instead of using passwords, a client can be configured to connect to the remote machine using keys. For security reasons, this is the preferred method.
ru: Вместо использования паролей клиент может быть настроен для подключения к удалённой машине с использованием ключей. В целях безопасности это предпочтительный метод.

source: man:ssh-keygen[1] can be used to generate the authentication keys. To generate a public and private key pair, specify the type of key and follow the prompts. It is recommended to protect the keys with a memorable, but hard to guess passphrase.
ru: man:ssh-keygen[1] можно использовать для генерации ключей аутентификации. Чтобы создать пару из открытого и закрытого ключей, укажите тип ключа и следуйте инструкциям. Рекомендуется защитить ключи запоминающейся, но трудной для угадывания парольной фразой.

source: Utilizing a passphrase for OpenSSH keys is a key security practice, providing an extra layer of protection against unauthorized access and enhancing overall cybersecurity.
ru: Использование парольной фразы для ключей OpenSSH является важной практикой безопасности, обеспечивающей дополнительный уровень защиты от несанкционированного доступа и повышающей общую кибербезопасность.

source: In case of loss or theft, this adds another layer of security.
ru: В случае утери или кражи это добавляет дополнительный уровень защиты.

source: The following command tells man:ssh[1] to create a tunnel:
ru: Следующая команда указывает man:ssh[1] создать туннель:

source: Specifies a local "dynamic" application-level port forwarding.
ru: Указывает локальное "динамическое" перенаправление портов на уровне приложений.

source: An SSH tunnel works by creating a listen socket on `localhost` on the specified `localport`.
ru: Туннель SSH работает путем создания сокета для прослушивания на `localhost` на указанном `localport`.

source: This method can be used to wrap any number of insecure TCP protocols such as SMTP, POP3, and FTP.
ru: Этот метод можно использовать для защиты любого количества незащищённых TCP-протоколов, таких как SMTP, POP3 и FTP.

source: As stated, this chapter will cover the base system version of OpenSSH. Please *not* confuse with package:security/openssh-portable[], the version of OpenSSH that ships with the FreeBSD ports.
ru: Как уже было сказано, в этой главе рассматривается базовая версия OpenSSH. *Не* путайте её с package:security/openssh-portable[], версией OpenSSH, которая поставляется с коллекцией портов FreeBSD.

source: In order to have the SSH Server enabled across reboots execute the following command:
ru: Чтобы включить сервер SSH для автоматического запуска после перезагрузки, выполните следующую команду:

source: Then execute the following command to enable the service:
ru: Затем выполните следующую команду, чтобы включить службу:

source: Refer to man:sshd[8] for the list of available options when starting sshd and a complete discussion about authentication, the login process, and the various configuration files.
ru: Обратитесь к man:sshd[8] для получения списка доступных параметров при запуске sshd, а также полного описания аутентификации, процесса входа и различных конфигурационных файлов.

source: Configuring publickey auth method
ru: Настройка метода аутентификации по открытому ключу

source: Configuring OpenSSH to use public key authentication enhances security by leveraging asymmetric cryptography for authentication. This method eliminates password-related risks, such as weak passwords or interception during transmission, while thwarting various password-based attacks. However, it's vital to ensure the private keys are well-protected to prevent unauthorized access.
ru: Настройка OpenSSH для использования аутентификации по открытому ключу повышает безопасность за счёт применения асимметричной криптографии. Этот метод устраняет риски, связанные с паролями, такие как слабые пароли или их перехват при передаче, а также предотвращает различные атаки, основанные на паролях. Однако важно обеспечить надёжную защиту закрытых ключей, чтобы предотвратить несанкционированный доступ.

source: The first step will be to configure man:sshd[8] to use the required authentication method.
ru: Первым шагом будет настройка man:sshd[8] для использования требуемого метода аутентификации.

source: Edit [.filename]#/etc/ssh/sshd_config# and uncomment the following configuration:
ru: Отредактируйте файл [.filename]#/etc/ssh/sshd_config# и раскомментируйте следующую настройку:

source: Once the configuration is done, the users will have to send the system administrator their *public key* and these keys will be added in [.filename]#.ssh/authorized_keys#. The process for generating the keys is described in crossref:security[security-ssh-keygen, Key-based Authentication].
ru: После завершения настройки пользователям необходимо отправить системному администратору свой *открытый ключ*, и эти ключи будут добавлены в [.filename]#.ssh/authorized_keys#. Процесс генерации ключей описан в crossref:security[security-ssh-keygen,Аутентификация на основе ключей].

source: Then restart the server executing the following command:
ru: Затем перезапустите сервер, выполнив следующую команду:

source: It is strongly recommended to follow the security improvements indicated in crossref:security[security-sshd-security-options, SSH Server Security Options].
ru: Настоятельно рекомендуется выполнить указанные улучшения безопасности, приведенные в crossref:security[security-sshd-security-options, Параметры безопасности SSH-сервера].

source: SSH Server Security Options
ru: Параметры безопасности сервера SSH

source: While sshd is the most widely used remote administration facility for FreeBSD, brute force and drive by attacks are common to any system exposed to public networks.
ru: В то время как `sshd` является наиболее широко используемым средством удалённого администрирования в FreeBSD, атаки методом грубой силы и сканирование уязвимостей распространены для любой системы, доступной из публичных сетей.

source: Several additional parameters are available to prevent the success of these attacks and will be described in this section. All configurations will be done in [.filename]#/etc/ssh/sshd_config#
ru: В этом разделе описаны дополнительные параметры, которые помогают предотвратить успех подобных атак. Все настройки выполняются в файле [.filename]#/etc/ssh/sshd_config#

source: By default, authentication can be done with both pubkey and password. To allow *only* pubkey authentication, *which is strongly recommended*, change the variable:
ru: По умолчанию аутентификация может выполняться как по открытому ключу, так и по паролю. Чтобы разрешить *только* аутентификацию по открытому ключу, *что настоятельно рекомендуется*, измените переменную:

source: It is a good idea to limit which users can log into the SSH server and from where using the `AllowUsers` keyword in the OpenSSH server configuration file. For example, to only allow `user` to log in from `192.168.1.32`, add this line to [.filename]#/etc/ssh/sshd_config#:
ru: Хорошей практикой является ограничение пользователей, которые могут подключаться к SSH-серверу, а также мест, откуда они могут это делать, с помощью ключевого слова `AllowUsers` в конфигурационном файле сервера OpenSSH. Например, чтобы разрешить вход только пользователю `user` с адреса `192.168.1.32`, добавьте следующую строку в файл [.filename]#/etc/ssh/sshd_config#:

source: To allow `user` to log in from anywhere, list that user without specifying an IP address:
ru: Чтобы разрешить пользователю `user` входить из любого места, укажите этого пользователя без указания IP-адреса:

source: After making all the changes, and before restarting the service, it is recommended to verify that the configuration made is correct by executing the following command:
ru: После внесения всех изменений и перед перезапуском службы рекомендуется проверить правильность конфигурации, выполнив следующую команду:

source: If the configuration file is correct, no output will be shown. In case the configuration file is incorrect, it will show something like this:
ru: Если файл конфигурации верен, вывод не будет отображен. В случае, если файл конфигурации содержит ошибки, будет показано примерно следующее:

source: After making the changes and checking that the configuration file is correct, tell sshd to reload its configuration file by running:
ru: После внесения изменений и проверки корректности файла конфигурации, дайте команду `sshd` перезагрузить файл конфигурации, выполнив:

source: OpenSSL is a cryptography toolkit implementing the Secure Sockets Layer (SSL) and Transport Layer Security (TLS) network protocols and many cryptography routines.
ru: OpenSSL — это набор криптографических инструментов, реализующий сетевые протоколы Secure Sockets Layer (SSL) и Transport Layer Security (TLS), а также множество криптографических функций.

source: The openssl program is a command line tool for using the various cryptography functions of OpenSSL's crypto library from the shell. It can be used for
ru: Программа `openssl` — это инструмент командной строки для использования различных криптографических функций криптобиблиотеки OpenSSL из оболочки. Она может быть использована для

source: Creation and management of private keys, public keys and parameters
ru: Создания и управления закрытыми ключами, открытыми ключами и параметрами

source: Public key cryptographic operations
ru: Криптографических операций с открытым ключом

source: Creation of X.509 certificates, CSRs and CRLs
ru: Создания сертификатов X.509, запросов на подпись сертификатов (CSR) и списков отозванных сертификатов (CRL)

source: Calculation of Message Digests
ru: Вычисления дайджестов сообщений

source: Encryption and Decryption with Ciphers
ru: Шифрования и дешифрования с использованием шифров

source: SSL/TLS Client and Server Tests
ru: Тестирования SSL/TLS клиента и сервера

source: Handling of S/MIME signed or encrypted mail
ru: Обработки почты с подписью или шифрованием S/MIME

source: Time Stamp requests, generation and verification
ru: Запросов, генерации и проверки временных меток

source: Benchmarking the crypto routines
ru: Бенчмаркинга криптографических процедур

source: For more information about OpenSSL, read the free https://www.feistyduck.com/books/openssl-cookbook/[OpenSSL Cookbook].
ru: Для получения дополнительной информации о OpenSSL ознакомьтесь с бесплатной книгой https://www.feistyduck.com/books/openssl-cookbook/[OpenSSL Cookbook].

source: OpenSSL supports the generation of certificates both to be validated by a link:https://en.wikipedia.org/wiki/Certificate_authority[CA] and for own use.
ru: OpenSSL поддерживает создание сертификатов как для проверки link:https://en.wikipedia.org/wiki/Certificate_authority[ЦС], так и для собственного использования.

source: Run the command man:openssl[1] to generate a valid certificate for a link:https://en.wikipedia.org/wiki/Certificate_authority[CA] with the following arguments. This command will create two files in the current directory. The certificate request, [.filename]#req.pem#, can be sent to a link:https://en.wikipedia.org/wiki/Certificate_authority[CA] which, will validate the entered credentials, sign the request, and return the signed certificate. The second file, [.filename]#cert.key#, is the private key for the certificate and should be stored in a secure location. If this falls in the hands of others, it can be used to impersonate the user or the server.
ru: Выполните команду man:openssl[1] для генерации действительного сертификата для link:https://en.wikipedia.org/wiki/Certificate_authority[центра сертификации (CA)] с указанными аргументами. Эта команда создаст два файла в текущем каталоге. Запрос на сертификат, [.filename]#req.pem#, можно отправить в link:https://en.wikipedia.org/wiki/Certificate_authority[центр сертификации (CA)], который проверит введённые данные, подпишет запрос и вернёт подписанный сертификат. Второй файл, [.filename]#cert.key#, является закрытым ключом для сертификата и должен храниться в безопасном месте. Если он попадёт в чужие руки, его можно использовать для выдачи себя за пользователя или сервер.

source: Execute the following command to generate the certificate:
ru: Выполните следующую команду для создания сертификата:

source: Alternately, if a signature from a link:https://en.wikipedia.org/wiki/Certificate_authority[CA] is not required, a self-signed certificate can be created. This will create two new files in the current directory: a private key file [.filename]#cert.key#, and the certificate itself, [.filename]#cert.crt#. These should be placed in a directory, preferably under [.filename]#/etc/ssl/#, which is readable only by `root`. Permissions of `0700` are appropriate for these files and can be set using `chmod`.
ru: В качестве альтернативы, если подпись от link:https://ru.wikipedia.org/wiki/Центр_сертификации[центра сертификации] не требуется, можно создать самоподписанный сертификат. Это приведёт к созданию двух новых файлов в текущем каталоге: файла закрытого ключа [.filename]#cert.key# и самого сертификата [.filename]#cert.crt#. Эти файлы следует поместить в каталог, желательно в [.filename]#/etc/ssl/#, с доступом только для пользователя `root`. Для этих файлов подходят права доступа `0700`, которые можно установить с помощью команды `chmod`.

source: Configuring the FIPS Provider
ru: Настройка поставщика FIPS

source: With the import of OpenSSL 3 into the base system (on FreeBSD 14 and later), its new concept of provider modules was introduced in the system. Besides the default provider module built-in to the library, the _legacy_ module implements the now optional deprecated cryptography algorithms, while the _fips_ module restricts the OpenSSL implementation to the cryptography algorithms present in the link:https://en.wikipedia.org/wiki/Federal_Information_Processing_Standards[FIPS] set of standards. This part of OpenSSL receives link:https://www.openssl.org/docs/fips.html[particular care], including a link:https://www.openssl.org/news/fips-cve.html[list of relevant security issues], and is subject to the link:https://github.com/openssl/openssl/blob/master/README-FIPS.md[FIPS 140 validation process] on a regular basis. The link:https://www.openssl.org/source/[list of FIPS validated versions] is also available. This allows users to ensure FIPS compliance in their use of OpenSSL.
ru: С внедрением OpenSSL 3 в базовую систему (на FreeBSD 14 и новее) в систему была добавлена новая концепция модулей-провайдеров. Помимо модуля по умолчанию, встроенного в библиотеку, модуль _legacy_ реализует теперь необязательные устаревшие криптографические алгоритмы, а модуль _fips_ ограничивает реализацию OpenSSL криптографическими алгоритмами, присутствующими в наборе стандартов link:https://en.wikipedia.org/wiki/Federal_Information_Processing_Standards[FIPS]. Эта часть OpenSSL получает link:https://www.openssl.org/docs/fips.html[особое внимание], включая link:https://www.openssl.org/news/fips-cve.html[список соответствующих проблем безопасности], и регулярно проходит link:https://github.com/openssl/openssl/blob/master/README-FIPS.md[процесс валидации FIPS 140]. Также доступен link:https://www.openssl.org/source/[список версий, прошедших валидацию FIPS]. Это позволяет пользователям обеспечивать соответствие FIPS при использовании OpenSSL.

source: Importantly, the man:fips_module[7] is protected by an additional security measure, preventing its use without passing an integrity check. This check can be setup by the local system administrator, allowing every user of OpenSSL 3 to load this module. When not configured correctly, the FIPS module is expected to fail as follows:
ru: Важно отметить, что модуль man:fips_module[7] защищен дополнительной мерой безопасности, предотвращающей его использование без прохождения проверки целостности. Эта проверка может быть настроена системным администратором, что позволяет каждому пользователю OpenSSL 3 загружать этот модуль. Если настройка выполнена некорректно, ожидается, что модуль FIPS завершит работу следующим образом:

source: The check can be configured through the creation of a file in [.filename]#/etc/ssl/fipsmodule.cnf#, which will then be referenced in OpenSSL's main configuration file [.filename]#/etc/ssl/openssl.cnf#. OpenSSL provides the man:openssl-fipsinstall[1] utility to help with this process, which can be used as follows:
ru: Проверка может быть настроена путем создания файла [.filename]#/etc/ssl/fipsmodule.cnf#, который затем будет указан в основном конфигурационном файле OpenSSL [.filename]#/etc/ssl/openssl.cnf#. OpenSSL предоставляет утилиту man:openssl-fipsinstall[1] для помощи в этом процессе, которую можно использовать следующим образом:

source: The [.filename]#/etc/ssl/openssl.cnf# should then be modified, in order to:
ru: Файл [.filename]#/etc/ssl/openssl.cnf# затем следует изменить, чтобы:

source: Include the [.filename]#/etc/ssl/fipsmodule.cnf# file generated above,
ru: Включить файл [.filename]#/etc/ssl/fipsmodule.cnf#, созданный выше,

source: Expose the FIPS module for possible use,
ru: Предоставить доступ к модулю FIPS для возможного использования,

source: And explicitly activate the default module.
ru: И явно активировать модуль по умолчанию.

source: With this done, it should be possible to confirm that the FIPS module is effectively available and working:
ru: После этого можно убедиться, что модуль FIPS действительно доступен и работает:

source: This procedure has to be repeated every time the FIPS module is modified, e.g., after performing system updates, or after applying security fixes affecting OpenSSL in the base system.
ru: Эта процедура должна повторяться каждый раз, когда модуль FIPS изменяется, например, после выполнения обновлений системы или после применения исправлений безопасности, затрагивающих OpenSSL в базовой системе.
