Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: The limit on the size of a core file generated by a program is subordinate to other limits on disk usage, such as `filesize` or disk quotas. This limit is often used as a less severe method of controlling disk space consumption. Since users do not generate core files and often do not delete them, this setting may save them from running out of disk space should a large program crash.
ko: 프로그램에서 생성된 핵심 파일의 크기 제한은 `파일 크기` 또는 디스크 할당량과 같은 디스크 사용량에 대한 다른 제한에 종속됩니다. 이 제한은 디스크 공간 소비를 덜 심각하게 제어하는 방법으로 자주 사용됩니다. 사용자는 코어 파일을 생성하지 않고 삭제하지 않는 경우가 많으므로 이 설정을 사용하면 대규모 프로그램 충돌 시 디스크 공간이 부족해지는 것을 방지할 수 있습니다.

source: The maximum amount of CPU time a user's process may consume. Offending processes will be killed by the kernel. This is a limit on CPU _time_ consumed, not the percentage of the CPU as displayed in some of the fields generated by `top` and `ps`.
ko: 사용자 프로세스가 소비할 수 있는 최대 CPU 시간입니다. 위반 프로세스는 커널에 의해 종료됩니다. 이것은 `top` 및 `ps`에 의해 생성된 일부 필드에 표시되는 CPU의 백분율이 아니라 소비된 CPU _시간_에 대한 제한입니다.

source: The maximum size of a file the user may own. Unlike disk quotas (crossref:disks[quotas,"Disk Quotas"]), this limit is enforced on individual files, not the set of all files a user owns.
ko: 사용자가 소유할 수 있는 파일의 최대 크기입니다. 디스크 할당량(crossref:disks[quotas,”Disk Quotas”])과 달리 이 제한은 사용자가 소유한 모든 파일 집합이 아니라 개별 파일에 적용됩니다.

source: The maximum number of foreground and background processes a user can run. This limit may not be larger than the system limit specified by `kern.maxproc`. Setting this limit too small may hinder a user's productivity as some tasks, such as compiling a large program, start lots of processes.
ko: 사용자가 실행할 수 있는 포어그라운드 및 백그라운드 프로세스의 최대 수입니다. 이 제한은 `kern.maxproc`에 지정된 시스템 제한보다 클 수 없습니다. 이 제한을 너무 작게 설정하면 대규모 프로그램 컴파일과 같은 일부 작업에서 많은 프로세스가 시작되므로 사용자의 생산성을 저해할 수 있습니다.

source: The maximum amount of memory a process may request to be locked into main memory using man:mlock[2]. Some system-critical programs, such as man:amd[8], lock into main memory so that if the system begins to swap, they do not contribute to disk thrashing.
ko: 프로세스가 man:mlock[2]를 사용하여 주 메모리에 잠그도록 요청할 수 있는 최대 메모리 양입니다. man:amd[8]와 같은 일부 시스템 크리티컬 프로그램은 시스템이 스왑을 시작해도 디스크 스레싱을 악화시키지 않도록 않도록 메인 메모리에 잠급니다.

source: The maximum amount of memory a process may consume at any given time. It includes both core memory and swap usage. This is not a catch-all limit for restricting memory consumption, but is a good start.
ko: 프로세스가 특정 시간에 사용할 수 있는 최대 메모리 양입니다. 여기에는 코어 메모리와 스왑 사용량이 모두 포함됩니다. 이는 메모리 소비를 제한하기 위한 포괄적인 제한은 아니지만 좋은 시작점입니다.

source: The maximum number of files a process may have open. In FreeBSD, files are used to represent sockets and IPC channels, so be careful not to set this too low. The system-wide limit for this is defined by `kern.maxfiles`.
ko: 프로세스가 열 수 있는 최대 파일 수입니다. FreeBSD에서 파일은 소켓과 IPC 채널을 나타내는 데 사용되므로 이 값을 너무 낮게 설정하지 않도록 주의하세요. 이에 대한 시스템 전체 제한은 `kern.maxfiles`에 의해 정의됩니다.

source: The limit on the amount of network memory a user may consume. This can be generally used to limit network communications.
ko: 사용자가 사용할 수 있는 네트워크 메모리 양에 대한 제한입니다. 일반적으로 네트워크 통신을 제한하는 데 사용할 수 있습니다.

source: The maximum size of a process stack. This alone is not sufficient to limit the amount of memory a program may use, so it should be used in conjunction with other limits.
ko: 프로세스 스택의 최대 크기입니다. 이것만으로는 프로그램이 사용할 수 있는 메모리 양을 제한하기에 충분하지 않으므로 다른 제한 사항과 함께 사용해야 합니다.

source: There are a few other things to remember when setting resource limits:
ko: 리소스 제한을 설정할 때 기억해야 할 몇 가지 다른 사항이 있습니다:

source: Processes started at system startup by [.filename]#/etc/rc# are assigned to the `daemon` login class.
ko: 시스템 시작 시 [.filename]#/etc/rc#에 의해 시작된 프로세스는 `데몬` 로그인 클래스에 할당됩니다.

source: Although the default [.filename]#/etc/login.conf# is a good source of reasonable values for most limits, they may not be appropriate for every system. Setting a limit too high may open the system up to abuse, while setting it too low may put a strain on productivity.
ko: 기본값인 [.filename]#/etc/login.conf#는 대부분의 제한에 대해 합리적인 값을 제공하는 좋은 소스이지만, 모든 시스템에 적합하지 않을 수도 있습니다. 제한을 너무 느슨하게 설정하면 시스템이 남용될 수 있고, 너무 빡빡하게 설정하면 생산성에 부담을 줄 수 있습니다.

source: Xorg takes a lot of resources and encourages users to run more programs simultaneously.
ko: Xorg는 많은 리소스를 사용하며 사용자가 더 많은 프로그램을 동시에 실행하도록 권장합니다.

source: Many limits apply to individual processes, not the user as a whole. For example, setting `openfiles` to `50` means that each process the user runs may open up to `50` files. The total amount of files a user may open is the value of `openfiles` multiplied by the value of `maxproc`. This also applies to memory consumption.
ko: 많은 제한은 사용자 뿐만 아니라 개별 프로세스에도 적용됩니다. 예를 들어, `openfiles`를 `50`으로 설정하면 사용자가 실행하는 각 프로세스가 최대 `50`개의 파일을 열 수 있습니다. 사용자가 열 수 있는 파일의 총량은 `openfiles` 값에 `maxproc` 값을 곱한 값입니다. 이는 메모리 소비에도 적용됩니다.

source: For further information on resource limits and login classes and capabilities in general, refer to man:cap.mkdb[1], man:getrlimit[2], and man:login.conf[5].
ko: 리소스 제한과 로그인 클래스 및 기능 전반에 대한 자세한 내용은 man:cap.mkdb[1], man:getrlimit[2], man:login.conf[5]를 참조하세요.

source: Enabling and Configuring Resource Limits
ko: 리소스 제한 활성화 및 구성하기
ru: Включение и настройка ограничений ресурсов

source: The `kern.racct.enable` tunable must be set to a non-zero value. Custom kernels require specific configuration:
ko: `kern.racct.enable` 튜너블은 0이 아닌 값으로 설정해야 합니다. 커스텀 커널은 특정 구성이 필요합니다:

source: Once the system has rebooted into the new kernel, `rctl` may be used to set rules for the system.
ko: 시스템이 새 커널로 재부팅되면 `rctl`을 사용하여 시스템에 대한 규칙을 설정할 수 있습니다.

source: Rule syntax is controlled through the use of a subject, subject-id, resource, and action, as seen in this example rule:
ko: 규칙 구문은 이 예제 규칙에서 볼 수 있듯이 제목, 제목-ID, 리소스 및 작업을 사용하여 제어됩니다:

source: In this rule, the subject is `user`, the subject-id is `trhodes`, the resource, `maxproc`, is the maximum number of processes, and the action is `deny`, which blocks any new processes from being created. This means that the user, `trhodes`, will be constrained to no greater than `10` processes. Other possible actions include logging to the console, passing a notification to man:devd[8], or sending a sigterm to the process.
ko: 이 규칙에서 제목은 `user`이며, 제목-ID는 `trhodes`, 리소스, `maxproc`은 최대 프로세스 수, 액션은 `deny`로 새 프로세스가 생성되지 않도록 차단합니다. 즉, 사용자 `trhodes`는 `10`개 이하의 프로세스로 제한됩니다. 다른 가능한 작업으로는 콘솔에 로깅하거나, man:devd[8]에 알림을 전달하거나, 프로세스에 시그너처를 보내는 것 등이 있습니다.

source: Some care must be taken when adding rules. Since this user is constrained to `10` processes, this example will prevent the user from performing other tasks after logging in and executing a `screen` session. Once a resource limit has been hit, an error will be printed, as in this example:
ko: 규칙을 추가할 때는 약간의 주의가 필요합니다. 이 사용자는 `10` 프로세스로 제한되므로 이 예에서는 사용자가 로그인하여 `screen` 세션을 실행한 후 다른 작업을 수행하지 못하도록 합니다. 리소스 제한에 도달하면 이 예제에서와 같이 오류가 인쇄됩니다:

source: As another example, a jail can be prevented from exceeding a memory limit. This rule could be written as:
ko: 다른 예로, jail이 메모리 제한을 초과하지 못하도록 할 수 있습니다. 이 규칙은 다음과 같이 작성할 수 있습니다:

source: Rules will persist across reboots if they have been added to [.filename]#/etc/rctl.conf#. The format is a rule, without the preceding command. For example, the previous rule could be added as:
ko: 규칙은 [.filename]#/etc/rctl.conf#에 추가한 경우 재부팅 시에도 지속됩니다. 형식은 앞의 명령어가 없는 규칙입니다. 예를 들어 이전 규칙을 다음과 같이 추가할 수 있습니다:
ru: Правила сохранятся после перезагрузки, если они добавлены в [.filename]#/etc/rctl.conf#. Формат записи — это правило без указания команды в начале. Например, предыдущее правило можно добавить так:

source: To remove a rule, use `rctl` to remove it from the list:
ko: 규칙을 제거하려면 `rctl`을 사용하여 목록에서 규칙을 제거합니다:

source: A method for removing all rules is documented in man:rctl[8]. However, if removing all rules for a single user is required, this command may be issued:
ko: 모든 규칙을 제거하는 방법은 man:rctl[8]에 문서화되어 있습니다. 그러나 단일 사용자에 대한 모든 규칙을 제거해야 하는 경우 이 명령을 실행할 수 있습니다:

source: Many other resources exist which can be used to exert additional control over various `subjects`. See man:rctl[8] to learn about them.
ko: 다양한 ‘주제’를 추가로 제어하는 데 사용할 수 있는 다른 많은 리소스가 존재합니다. 이에 대한 자세한 내용은 man:rctl[8]을 참고하세요.

source: Shared Administration with Sudo
ko: Sudo를 통한 공유 관리

source: System administrators often need the ability to grant enhanced permissions to users so they may perform privileged tasks. The idea that team members are provided access to a FreeBSD system to perform their specific tasks opens up unique challenges to every administrator. These team members only need a subset of access beyond normal end user levels; however, they almost always tell management they are unable to perform their tasks without superuser access. Thankfully, there is no reason to provide such access to end users because tools exist to manage this exact requirement.
ko: 시스템 관리자는 종종 사용자에게 권한 있는 작업을 수행할 수 있도록 향상된 권한을 부여할 수 있는 기능이 필요합니다. 팀원들이 특정 작업을 수행하기 위해 FreeBSD 시스템에 대한 액세스 권한을 제공받는다는 생각은 모든 관리자에게 고유한 과제를 안겨줍니다. 이러한 팀원들은 일반 최종 사용자 수준 이상의 일부 액세스만 필요하지만, 거의 항상 수퍼유저 액세스 없이는 작업을 수행할 수 없다고 관리자에게 말합니다. 다행히도 이러한 요구 사항을 정확히 관리할 수 있는 도구가 존재하기 때문에 최종 사용자에게 이러한 액세스 권한을 제공할 이유가 없습니다.
ru: Системные администраторы часто сталкиваются с необходимостью предоставления пользователям расширенных прав для выполнения привилегированных задач. Идея о том, что члены команды получают доступ к системе FreeBSD для выполнения своих конкретных задач, создает уникальные проблемы для каждого администратора. Этим сотрудникам требуется лишь ограниченный набор прав, выходящий за рамки обычного уровня пользователя; однако они почти всегда заявляют руководству, что не могут выполнять свои задачи без прав суперпользователя. К счастью, нет необходимости предоставлять такие права конечным пользователям, так как существуют инструменты для управления этим требованием.

source: Up to this point, the security chapter has covered permitting access to authorized users and attempting to prevent unauthorized access. Another problem arises once authorized users have access to the system resources. In many cases, some users may need access to application startup scripts, or a team of administrators need to maintain the system. Traditionally, the standard users and groups, file permissions, and even the man:su[1] command would manage this access. And as applications required more access, as more users needed to use system resources, a better solution was required. The most used application is currently Sudo.
ko: 지금까지 보안 장에서는 권한이 부여된 사용자에게 액세스를 허용하고 무단 액세스를 방지하는 방법에 대해 설명했습니다. 권한이 부여된 사용자가 시스템 리소스에 액세스할 수 있게 되면 또 다른 문제가 발생합니다. 대부분의 경우 일부 사용자는 애플리케이션 시작 스크립트에 액세스해야 하거나 관리자 팀이 시스템을 유지 관리해야 할 수 있습니다. 기존에는 표준 사용자 및 그룹, 파일 권한, 심지어 man:su[1] 명령으로 이러한 액세스를 관리했습니다. 애플리케이션에 더 많은 액세스 권한이 필요하고 시스템 리소스를 사용해야 하는 사용자가 늘어남에 따라 더 나은 솔루션이 필요했습니다. 현재 가장 많이 사용되는 애플리케이션은 Sudo입니다.
ru: До этого момента в главе о безопасности рассматривались вопросы предоставления доступа авторизованным пользователям и попытки предотвратить несанкционированный доступ. Однако возникает другая проблема, когда авторизованные пользователи получают доступ к системным ресурсам. Во многих случаях некоторым пользователям может потребоваться доступ к скриптам запуска приложений, или команде администраторов необходимо обслуживать систему.. Традиционно для управления таким доступом использовались стандартные пользователи и группы, права доступа к файлам и даже команда man:su[1]. Однако по мере того, как приложениям требовалось больше прав, а большему числу пользователей нужно было использовать системные ресурсы, потребовалось лучшее решение. В настоящее время наиболее часто используемым приложением для этих целей является Sudo.

source: Sudo allows administrators to configure more rigid access to system commands and provide for some advanced logging features. As a tool, it is available from the Ports Collection as package:security/sudo[] or by use of the man:pkg[8] utility. To use the man:pkg[8] tool:
ko: 관리자는 Sudo를 사용하여 시스템 명령에 대한 보다 엄격한 액세스를 구성하고 일부 고급 로깅 기능을 제공할 수 있습니다. 도구로서, 포트 컬렉션에서 package:security/sudo[] 또는 man:pkg[8] 유틸리티를 사용하여 사용할 수 있습니다. man:pkg[8] 도구를 사용하려면:

source: After the installation is complete, the installed `visudo` will open the configuration file with a text editor. Using `visudo` is highly recommended as it comes with a built in syntax checker to verify there are no errors before the file is saved.
ko: 설치가 완료되면 설치된 `visudo`가 텍스트 편집기로 구성 파일을 엽니다. 구문 검사기가 내장되어 있어 파일을 저장하기 전에 오류가 없는지 확인할 수 있으므로 `visudo`를 사용하는 것을 적극 권장합니다.
ru: После завершения установки установленный `visudo` откроет файл конфигурации в текстовом редакторе. Настоятельно рекомендуется использовать `visudo`, так как он содержит встроенную проверку синтаксиса для подтверждения отсутствия ошибок перед сохранением файла.

source: The configuration file is made up of several small sections which allow for extensive configuration. In the following example, web application maintainer, user1, needs to start, stop, and restart the web application known as _webservice_. To grant this user permission to perform these tasks, add this line to the end of [.filename]#/usr/local/etc/sudoers#:
ko: 구성 파일은 여러 개의 작은 섹션으로 구성되어 있어 광범위하게 구성할 수 있습니다. 다음 예제에서 웹 애플리케이션 관리자인 user1은 _webservice_라는 웹 애플리케이션을 시작, 중지 및 다시 시작해야 합니다. 이 사용자에게 이러한 작업을 수행할 수 있는 권한을 부여하려면 [.filename]#/usr/local/etc/sudoers#의 끝에 이 줄을 추가합니다:
ru: Файл конфигурации состоит из нескольких небольших разделов, которые позволяют проводить детальную настройку. В следующем примере администратору веб-приложения, user1, требуется запускать, останавливать и перезапускать веб-приложение с именем _webservice_. Чтобы предоставить этому пользователю права на выполнение данных задач, добавьте следующую строку в конец файла [.filename]#/usr/local/etc/sudoers#:

source: The user may now start _webservice_ using this command:
ko: 이제 사용자는 다음 명령을 사용하여 _webservice_를 시작할 수 있습니다:
ru: Пользователь может теперь запустить _webservice_ с помощью следующей команды:

source: While this configuration allows a single user access to the webservice service; however, in most organizations, there is an entire web team in charge of managing the service. A single line can also give access to an entire group. These steps will create a web group, add a user to this group, and allow all members of the group to manage the service:
ko: 이 구성을 사용하면 한 명의 사용자가 웹서비스 서비스에 액세스할 수 있지만, 대부분의 조직에서는 전체 웹팀이 서비스 관리를 담당합니다. 한 줄로 전체 그룹에 대한 액세스 권한을 부여할 수도 있습니다. 이 단계에서는 웹 그룹을 만들고, 이 그룹에 사용자를 추가하고, 그룹의 모든 구성원이 서비스를 관리할 수 있도록 허용합니다:
ru: Хотя данная конфигурация предоставляет одному пользователю доступ к службе `webservice`, в большинстве организаций управление этой службой доверено целой команде веб-разработчиков. Одной строкой можно также предоставить доступ всей группе. Следующие шаги позволят создать группу `web`, добавить в неё пользователя и разрешить всем членам группы управлять службой:

source: Using the same man:pw[8] command, the user is added to the webteam group:
ko: 동일한 man:pw[8] 명령을 사용하여 사용자가 웹팀 그룹에 추가됩니다:
ru: Используя ту же команду man:pw[8], пользователь добавляется в группу webteam:

source: Finally, this line in [.filename]#/usr/local/etc/sudoers# allows any member of the webteam group to manage _webservice_:
ko: 마지막으로 [.filename]#/usr/local/etc/sudoers#에 있는 이 줄을 통해 웹팀 그룹의 모든 구성원이 _webservice_를 관리할 수 있습니다:
ru: Наконец, эта строка в [.filename]#/usr/local/etc/sudoers# разрешает любому члену группы webteam управлять _webservice_:

source: Unlike man:su[1], Sudo only requires the end user password. This adds an advantage where users will not need shared passwords, a finding in most security audits and just bad all the way around.
ko: man:su[1]와 달리 sudo는 최종 사용자 비밀번호만 필요합니다. 따라서 대부분의 보안 감사에서 지적되는 공유 비밀번호가 필요하지 않다는 이점이 있습니다.

source: Users permitted to run applications with Sudo only enter their own passwords. This is more secure and gives better control than man:su[1], where the `root` password is entered and the user acquires all `root` permissions.
ko: sudo로 애플리케이션을 실행할 수 있는 사용자는 자신의 비밀번호만 입력합니다. 이는 `root` 비밀번호를 입력하고 사용자가 모든 `root` 권한을 획득하는 man:su[1]보다 더 안전하며 더 나은 제어 기능을 제공합니다.

source: Most organizations are moving or have moved toward a two factor authentication model. In these cases, the user may not have a password to enter. Sudo provides for these cases with the `NOPASSWD` variable. Adding it to the configuration above will allow all members of the _webteam_ group to manage the service without the password requirement:
ko: 대부분의 조직은 2단계 인증 모델로 전환 중이거나 이미 전환한 상태입니다. 이러한 경우 사용자에게 입력할 비밀번호가 없을 수 있습니다. sudo는 이러한 경우를 위해 `NOPASSWD` 변수를 제공합니다. 위의 구성에 이 변수를 추가하면 _webteam_ 그룹의 모든 구성원이 비밀번호 없이도 서비스를 관리할 수 있습니다:

source: Logging Output
ko: 로그 출력

source: An advantage to implementing Sudo is the ability to enable session logging. Using the built in log mechanisms and the included sudoreplay command, all commands initiated through Sudo are logged for later verification. To enable this feature, add a default log directory entry, this example uses a user variable. Several other log filename conventions exist, consult the manual page for sudoreplay for additional information.
ko: sudo를 구현할 때의 장점은 세션 로깅을 활성화할 수 있다는 것입니다. 기본 제공 로그 메커니즘과 포함된 sudoreplay 명령을 사용하면 나중에 확인할 수 있도록 sudo를 통해 시작된 모든 명령이 로깅됩니다. 이 기능을 사용하려면 기본 로그 디렉터리 항목을 추가하세요. 이 예에서는 사용자 변수를 사용합니다. 다른 로그 파일 이름 규칙이 몇 가지 더 있으며, 자세한 내용은 sudoreplay 매뉴얼 페이지를 참조하세요.

source: This directory will be created automatically after the logging is configured. It is best to let the system create directory with default permissions just to be safe. In addition, this entry will also log administrators who use the sudoreplay command. To change this behavior, read and uncomment the logging options inside [.filename]#sudoers#.
ko: 이 디렉터리는 로깅을 구성한 후 자동으로 생성됩니다. 안전을 위해 시스템에서 기본 권한으로 디렉터리를 만들도록 하는 것이 가장 좋습니다. 또한 이 항목은 sudoreplay 명령을 사용하는 관리자에 대해서도 로깅합니다. 이 동작을 변경하려면 [.filename]#sudoers# 내부의 로깅 옵션을 읽고 주석을 해제하세요.

source: Once this directive has been added to the [.filename]#sudoers# file, any user configuration can be updated with the request to log access. In the example shown, the updated _webteam_ entry would have the following additional changes:
ko: 이 지시문을 [.filename]#sudoers# 파일에 추가하면 액세스 로그 요청을 통해 모든 사용자 구성을 업데이트할 수 있습니다. 표시된 예에서 업데이트된 _webteam_ 항목에는 다음과 같은 추가 변경 사항이 있습니다:

source: From this point on, all _webteam_ members altering the status of the _webservice_ application will be logged. The list of previous and current sessions can be displayed with:
ko: 이 시점부터 _webservice_ 애플리케이션의 상태를 변경하는 모든 _webteam_ 멤버가 기록됩니다. 이전 및 현재 세션 목록이 함께 표시될 수 있습니다:

source: In the output, to replay a specific session, search for the `TSID=` entry, and pass that to sudoreplay with no other options to replay the session at normal speed. For example:
ko: 출력에서 특정 세션을 재생하려면 `TSID=` 항목을 검색한 다음 다른 옵션 없이 sudoreplay에 전달하면 세션이 정상 속도로 재생됩니다. 예를 들어:

source: While sessions are logged, any administrator is able to remove sessions and leave only a question of why they had done so. It is worthwhile to add a daily check through an intrusion detection system (IDS) or similar software so that other administrators are alerted to manual alterations.
ko: 세션이 기록되는 동안 모든 관리자는 세션을 삭제할 수 있으며, 왜 세션을 삭제했는지에 대한 질문만 남길 수 있습니다. 침입 탐지 시스템(IDS) 또는 유사한 소프트웨어를 통해 매일 확인을 추가하여 다른 관리자에게 수동 변경에 대한 경고를 보내는 것이 좋습니다.

source: The `sudoreplay` is extremely extendable. Consult the documentation for more information.
ko: `sudoreplay`’는 확장성이 매우 뛰어납니다. 자세한 내용은 문서를 참조하세요.

source: Using doas as an alternative to sudo
ko: sudo의 대안으로 doas 사용하기

source: As an alternative to package:security/sudo[] package:security/doas[] can be used to provide the ability for users to get enhanced privileges.
ko: package:security/sudo[] 대신 package:security/doas[]를 사용하여 사용자가 향상된 권한을 얻을 수 있는 기능을 제공할 수 있습니다.

source: The doas utility is available via the ports collection in package:security/doas[] or via the man:pkg[8] utility.
ko: doas 유틸리티는 package:security/doas[]의 포트 컬렉션을 통해 또는 man:pkg[8] 유틸리티를 통해 사용할 수 있습니다.

source: After the installation [.filename]#/usr/local/etc/doas.conf# must be configured to grant access for users for specific commands, or roles.
ko: 설치 후 [.filename]#/usr/local/etc/doas.conf#를 구성하여 특정 명령 또는 역할에 대한 사용자 액세스 권한을 부여해야 합니다.
ru: После установки необходимо настроить [.filename]#/usr/local/etc/doas.conf#, чтобы предоставить пользователям доступ к определенным командам или ролям.

source: The simpliest entry could be the following, which grants local_user root permissions without asking for its password when executing the doas command.
ko: 가장 간단한 항목은 다음과 같을 수 있는데, doas 명령을 실행할 때 비밀번호를 묻지 않고 local_user 루트 권한을 부여합니다.

source: For more configuration examples, please read man:doas.conf[5].
ko: 더 많은 구성 예제는 man:doas.conf[5]를 참조하세요.
ru: Для дополнительных примеров конфигурации обратитесь к man:doas.conf[5].

source: After the installation and configuration of the `doas` utility, a command can now be executed with enhanced privileges, like for example.
ko: 이제 `doas` 유틸리티를 설치하고 구성한 후 다음과 같이 향상된 권한으로 명령을 실행할 수 있습니다.

source: Chapter 16. Security
ru: Глава 16. Безопасность

source: Hundreds of standard practices have been authored about how to secure systems and networks, and as a user of FreeBSD, understanding how to protect against attacks and intruders is a must.
ru: Сотни стандартных практик написаны о том, как защитить системы и сети, и, как пользователю FreeBSD, понимание того, как защититься от атак и злоумышленников, является обязательным.

source: This chapter covers:
ru: Эта глава охватывает:

source: How to configure TCP Wrappers for use with man:inetd[8].
ru: Как настроить TCP Wrappers для использования с man:inetd[8].

source: How to use OpenSSL on FreeBSD.
ru: Как использовать OpenSSL в FreeBSD.

source: What is Capsicum and a basic example.
ru: Что такое Capsicum и базовый пример.

source: Certain topics due to their complexity are found in dedicated chapters such as crossref:firewalls[firewalls,Firewalls], crossref:mac[mac,Mandatory Access Control] and articles like extref:{vpn-ipsec}[VPN over IPsec].
ru: Некоторые темы из-за их сложности рассматриваются в отдельных главах, таких как crossref:firewalls[firewalls,Межсетевые экраны], crossref:mac[mac,Принудительное управление доступом], и статьях, например extref:{vpn-ipsec}[VPN через IPsec].

source: Securing Accounts
ru: Защита учетных записей

source: Maintaining secure accounts in FreeBSD is crucial for data confidentiality, system integrity, and privilege separation, as it prevents unauthorized access, malware, and data breaches while ensuring compliance and protecting an organization's reputation.
ru: Поддержание безопасных учетных записей в FreeBSD крайне важно для конфиденциальности данных, целостности системы и разделения привилегий, так как это предотвращает несанкционированный доступ, вредоносное ПО и утечки данных, обеспечивая соответствие требованиям и защищая репутацию организации.

source: In securing a system, a good starting point is an audit of accounts. Disable any accounts that do not need login access.
ru: При обеспечении безопасности системы хорошей отправной точкой является аудит учетных записей. Отключите все учетные записи, которым не требуется доступ для входа.

source: Ensure that `root` has a strong password and that this password is not shared.
ru: Убедитесь, что у пользователя `root` установлен надежный пароль и что этот пароль не используется совместно.

source: To deny login access to accounts, two methods exist.
ru: Для запрета входа в учетные записи существуют два метода.

source: The first is to lock the account, this example shows how to lock the `imani` account:
ru: Первый способ — заблокировать учетную запись, в этом примере показано, как заблокировать учетную запись `imani`:
