Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: When using MIT Kerberos as a KDC on FreeBSD, execute the following commands to add the required configurations to [.filename]#/etc/rc.conf#:
ru: При использовании MIT Kerberos в качестве KDC на FreeBSD выполните следующие команды, чтобы добавить необходимые конфигурации в [.filename]#/etc/rc.conf#:

source: http://www.faqs.org/faqs/Kerberos-faq/general/preamble.html[The Kerberos FAQ]
ru: http://www.faqs.org/faqs/Kerberos-faq/general/preamble.html[Часто задаваемые вопросы Kerberos]

source: http://web.mit.edu/Kerberos/www/dialogue.html[Designing an Authentication System: a Dialog in Four Scenes]
ru: http://web.mit.edu/Kerberos/www/dialogue.html[Проектирование системы аутентификации: диалог в четырех сценах]

source: http://web.mit.edu/Kerberos/www/[MIT Kerberos home page]
ru: http://web.mit.edu/Kerberos/www/[Домашняя страница MIT Kerberos]

source: https://github.com/heimdal/heimdal/wiki[Heimdal Kerberos project wiki page]
ru: https://github.com/heimdal/heimdal/wiki[Wiki страница проекта Heimdal Kerberos]

source: TCP Wrappers is a host-based network access control system. By intercepting incoming network requests before they reach the actual network service, TCP Wrappers assess whether the source IP address is permitted or denied access based on predefined rules in configuration files.
ru: TCP Wrappers — это система контроля сетевого доступа на основе хоста. Перехватывая входящие сетевые запросы до их поступления к реальному сетевому сервису, TCP Wrappers определяет, разрешен или запрещен доступ для исходного IP-адреса, на основе предопределенных правил в конфигурационных файлах.

source: However, while TCP Wrappers provide basic access control, they should not be considered a substitute for more robust security measures. For comprehensive protection, it's recommended to use advanced technologies like firewalls, along with proper user authentication practices and intrusion detection systems.
ru: Однако, хотя TCP Wrappers обеспечивают базовый контроль доступа, их не следует рассматривать как замену более надежным мерам безопасности. Для всесторонней защиты рекомендуется использовать передовые технологии, такие как межсетевые экраны, вместе с надлежащими методами аутентификации пользователей и системами обнаружения вторжений.

source: TCP Wrappers are enabled by default in man:inetd[8]. So the first step will be to enable man:inetd[8] executing the following commands:
ru: TCP Wrappers включены по умолчанию в man:inetd[8]. Первым шагом будет включение man:inetd[8] выполнением следующих команд:

source: Unlike other implementations of TCP Wrappers, the use of [.filename]#hosts.deny# is deprecated in FreeBSD. All configuration options should be placed in [.filename]#/etc/hosts.allow#.
ru: В отличие от других реализаций TCP Wrappers, использование [.filename]#hosts.deny# в FreeBSD считается устаревшим. Все параметры конфигурации должны размещаться в [.filename]#/etc/hosts.allow#.

source: Basic configuration usually takes the form of `daemon : address : action`, where `daemon` is the daemon which inetd started, `address` is a valid hostname, IP address, or an IPv6 address enclosed in brackets ([ ]), and `action` is either `allow` or `deny`. TCP Wrappers uses a first rule match semantic, meaning that the configuration file is scanned from the beginning for a matching rule. When a match is found, the rule is applied and the search process stops.
ru: Базовая конфигурация обычно имеет вид `daemon : address : action`, где `daemon` — это демон, запущенный inetd, `address` — допустимое имя хоста, IP-адрес или адрес IPv6, заключённый в квадратные скобки ([ ]), а `action` — либо `allow`, либо `deny`. TCP Wrappers использует семантику первого совпадения, то есть файл конфигурации сканируется с начала до первого совпадающего правила. При обнаружении совпадения правило применяется, и процесс поиска прекращается.

source: For example, to allow POP3 connections via the package:mail/qpopper[] daemon, the following lines should be appended to [.filename]#/etc/hosts.allow#:
ru: Например, чтобы разрешить соединения POP3 через демон package:mail/qpopper[], в файл [.filename]#/etc/hosts.allow# следует добавить следующие строки:

source: TCP Wrappers provides advanced options to allow more control over the way connections are handled. In some cases, it may be appropriate to return a comment to certain hosts or daemon connections. In other cases, a log entry should be recorded or an email sent to the administrator. Other situations may require the use of a service for local connections only. This is all possible through the use of configuration options known as wildcards, expansion characters, and external command execution. To learn more about wildcards and their associated functionality, refer to man:hosts_access[5].
ru: TCP Wrappers предоставляет расширенные возможности для более тонкого управления обработкой соединений. В некоторых случаях может быть уместно отправить сообщение определённым хостам или демонам при подключении. В других ситуациях может потребоваться сделать запись в журнал или отправить письмо администратору. Также бывают случаи, когда сервис должен быть доступен только для локальных соединений. Всё это возможно благодаря использованию параметров конфигурации, известных как шаблоны (wildcards), символы подстановки и выполнение внешних команд. Для получения дополнительной информации о шаблонах и связанной с ними функциональности обратитесь к man:hosts_access[5].

source: Access Control Lists (ACLs) extend traditional UNIX(R) file permissions by allowing fine-grained access control for users and groups on a per-file or per-directory basis. Each ACL entry defines a user or group and the associated permissions, such as read, write, and execute. FreeBSD provides commands like man:getfacl[1] and man:setfacl[1] to manage ACLs.
ru: Списки контроля доступа (Access Control Lists — ACL) расширяют традиционные права доступа UNIX(R), позволяя детально управлять доступом пользователей и групп к отдельным файлам или каталогам. Каждая запись ACL определяет пользователя или группу и связанные с ними права, такие как чтение, запись и выполнение. FreeBSD предоставляет команды, такие как man:getfacl[1] и man:setfacl[1], для управления ACL.

source: ACLs are useful in scenarios requiring more specific access control than standard permissions, commonly used in multi-user environments or shared hosting. However, complexity may be unavoidable, but careful planning is required to ensure that the desired security properties are being provided
ru: ACL полезны в сценариях, требующих более детального контроля доступа, чем стандартные разрешения, обычно используемые в многопользовательских средах или на shared-хостингах. Однако сложность может быть неизбежной, но требуется тщательное планирование, чтобы обеспечить желаемые свойства безопасности

source: FreeBSD supports the implementation of NFSv4 ACLs in both UFS and OpenZFS. Please note that some arguments to the man:setfacl[1] command only work with POSIX ACLs and others in NFSv4 ACLs.
ru: FreeBSD поддерживает реализацию NFSv4 ACL как в UFS, так и в OpenZFS. Обратите внимание, что некоторые аргументы команды man:setfacl[1] работают только с POSIX ACL, а другие — с NFSv4 ACL.

source: Enabling ACL Support in UFS
ru: Включение поддержки ACL в UFS

source: ACLs are enabled by the mount-time administrative flag, `acls`, which may be added to [.filename]#/etc/fstab#.
ru: ACL включаются с помощью административного флага при монтировании `acls`, который может быть добавлен в [.filename]#/etc/fstab#.

source: Therefore it will be necessary to access [.filename]#/etc/fstab# and in the options section add the `acls` flag as follows:
ru: Следовательно, необходимо получить доступ к [.filename]#/etc/fstab# и в разделе опций добавить флаг `acls` следующим образом:

source: Get ACLs information
ru: Получение информации об ACL

source: It is possible to check the ACLs of a file or a directory using man:getfacl[1].
ru: Можно проверить ACL файла или каталога с помощью man:getfacl[1].

source: For example, to view the ACL settings on [.filename]#~/test# file execute the following command:
ru: Например, чтобы просмотреть настройки ACL для файла [.filename]#~/test#, выполните следующую команду:

source: The output should be similar to the following in case of using NFSv4 ACLs:
ru: Вывод должен быть похож на следующий в случае использования NFSv4 ACL:

source: And the output should be similar to the following in case of using POSIX.1e ACLs:
ru: И вывод должен быть похож на следующий в случае использования POSIX.1e ACL:

source: Working with ACLs
ru: Работа с ACL

source: man:setfacl[1] can be used to add, modify or remove ACLs from a file or directory.
ru: `man:setfacl[1]` можно использовать для добавления, изменения или удаления ACL из файла или каталога.

source: As noted above, some arguments to man:setfacl[1] do not work with NFSv4 ACLs, and vice versa. This section covers how to execute the commands for POSIX ACLs and for NFSv4 ACLs and shows examples of both.
ru: Как упоминалось выше, некоторые аргументы man:setfacl[1] не работают с ACL NFSv4, и наоборот. В этом разделе описывается, как выполнять команды для POSIX ACL и для ACL NFSv4, а также приводятся примеры для обоих типов.

source: For example, to set the mandatory elements of the POSIX.1e default ACL:
ru: Например, чтобы установить обязательные элементы ACL по умолчанию POSIX.1e:

source: This other example sets read, write, and execute permissions for the file owner's POSIX.1e ACL entry and read and write permissions for group mail on file:
ru: Этот другой пример устанавливает права на чтение, запись и выполнение для записи POSIX.1e ACL владельца файла, а также права на чтение и запись для группы mail в файле:

source: To do the same as in the previous example but in NFSv4 ACL:
ru: Чтобы сделать то же самое, что и в предыдущем примере, но с использованием ACL NFSv4:

source: To remove all ACL entries except for the three required from file in POSIX.1e ACL:
ru: Чтобы удалить все записи ACL, кроме трех обязательных, из файла в POSIX.1e ACL:

source: To remove all ACL entries in NFSv4 ACL:
ru: Чтобы удалить все записи ACL в NFSv4 ACL:

source: Capsicum is a lightweight OS capability and sandbox framework implementing a hybrid capability system model. Capabilities are unforgeable tokens of authority that can be delegated and must be presented to perform an action. Capsicum makes file descriptors into capabilities.
ru: Capsicum — это легковесная платформа возможностей ОС и песочницы, реализующая гибридную модель системы возможностей. Возможности (capabilities) являются не подделываемыми токенами авторизации, которые могут быть делегированы и должны быть предъявлены для выполнения действия. Capsicum преобразует файловые дескрипторы в возможности.

source: Capsicum can be used for application and library compartmentalisation, the decomposition of larger bodies of software into isolated (sandboxed) components in order to implement security policies and limit the impact of software vulnerabilities.
ru: Capsicum можно использовать для разделения приложений и библиотек на изолированные компоненты (песочницы), что позволяет реализовать политики безопасности и снизить последствия уязвимостей в программном обеспечении.

source: Once enabled, accounting will begin to track information such as CPU statistics and executed commands. All accounting logs are in a non-human readable format which can be viewed using man:sa[8]. If issued without any options, man:sa[8] prints information relating to the number of per-user calls, the total elapsed time in minutes, total CPU and user time in minutes, and the average number of I/O operations. Refer to man:sa[8] for the list of available options which control the output.
ru: После включения учёт начнёт собирать информацию, такую как статистика использования CPU и выполненные команды. Все журналы учёта хранятся в нечитаемом формате, который можно просмотреть с помощью man:sa[8]. Если команда запущена без параметров, man:sa[8] выводит информацию о количестве вызовов для каждого пользователя, общем затраченном времени в минутах, общем времени CPU и пользователя в минутах, а также среднем количестве операций ввода-вывода. Полный список доступных параметров, управляющих выводом, смотрите в man:sa[8].

source: To display the commands issued by users, use `lastcomm`.
ru: Для отображения команд, выполненных пользователями, используйте `lastcomm`.

source: For example, this command prints out all usage of `ls` by `trhodes` on the `ttyp1` terminal:
ru: Например, эта команда выводит все случаи использования `ls` пользователем `trhodes` на терминале `ttyp1`:

source: In FreeBSD, resource limits refer to the mechanisms that control and manage the allocation of various system resources to processes and users. These limits are designed to prevent a single process or user from consuming an excessive amount of resources, which could lead to performance degradation or system instability. Resource limits help ensure fair resource distribution among all active processes and users on the system.
ru: В FreeBSD ограничения ресурсов относятся к механизмам, которые контролируют и управляют выделением различных системных ресурсов процессам и пользователям. Эти ограничения предназначены для предотвращения ситуации, когда один процесс или пользователь потребляет чрезмерное количество ресурсов, что может привести к снижению производительности или нестабильности системы. Ограничения ресурсов помогают обеспечить справедливое распределение ресурсов между всеми активными процессами и пользователями в системе.

source: FreeBSD provides several methods for an administrator to limit the amount of system resources an individual may use.
ru: FreeBSD предоставляет несколько методов, позволяющих администратору ограничивать объем системных ресурсов, которые может использовать отдельный пользователь.

source: The traditional method defines login classes by editing [.filename]#/etc/login.conf#. While this method is still supported, any changes require a multi-step process of editing this file, rebuilding the resource database, making necessary changes to [.filename]#/etc/master.passwd#, and rebuilding the password database. This can become time consuming, depending upon the number of users to configure.
ru: Традиционный метод определения классов входа в систему предполагает редактирование файла [.filename]#/etc/login.conf#. Хотя этот метод по-прежнему поддерживается, любые изменения требуют многоэтапного процесса: правки этого файла, пересборки базы данных ресурсов, внесения необходимых изменений в [.filename]#/etc/master.passwd# и пересборки базы данных паролей. Это может быть затратным по времени в зависимости от количества настраиваемых пользователей.

source: man:rctl[8] can be used to provide a more fine-grained method for controlling resource limits. This command supports more than user limits as it can also be used to set resource constraints on processes and jails.
ru: man:rctl[8] может использоваться для более детального управления ограничениями ресурсов. Эта команда поддерживает не только пользовательские ограничения, так как также может применяться для установки ограничений ресурсов на процессы и jail.

source: Types of Resources
ru: Типы ресурсов

source: FreeBSD provides limits for various types of resources, including:
ru: FreeBSD устанавливает ограничения для различных типов ресурсов, включая:

source: Resource types
ru: Типы ресурсов

source: Type
ru: Тип

source: CPU Time
ru: Время процессора

source: Limits the amount of CPU time a process can consume
ru: Ограничивает количество процессорного времени, которое может использовать процесс

source: Memory
ru: Память

source: Controls the amount of physical memory a process can use
ru: Управляет количеством физической памяти, которое может использовать процесс

source: Open Files
ru: Открытые файлы

source: Limits the number of files a process can have open simultaneously
ru: Ограничивает количество файлов, которые процесс может открыть одновременно

source: Processes
ru: Процессы

source: Controls the number of processes a user or a process can create
ru: Управляет количеством процессов, которые пользователь или процесс может создать

source: File Size
ru: Размер файла

source: Limits the maximum size of files that a process can create
ru: Ограничивает максимальный размер файлов, которые процесс может создать

source: Core Dumps
ru: Дампы памяти

source: Controls whether processes are allowed to generate core dump files
ru: Управляет возможностью процессов создавать файлы дампа памяти

source: Network Resources
ru: Сетевые ресурсы

source: Limits the amount of network resources (e.g., sockets) a process can use
ru: Ограничивает количество сетевых ресурсов (например, сокетов), которые может использовать процесс

source: For a full listing of types see man:login.conf[5] and man:rctl[8].
ru: Для полного списка типов см. man:login.conf[5] и man:rctl[8].

source: The first step to configure a resource limit will be to open [.filename]#/etc/login.conf# by executing the following command:
ru: Первым шагом для настройки ограничения ресурсов будет открытие файла [.filename]#/etc/login.conf# с помощью следующей команды:

source: Then locate the section for the user class to be modified. In this example, let's assume the user class is named `limited`, create it in case it does not exist.
ru: Затем найдите раздел для изменяемого класса пользователей. В этом примере предположим, что класс пользователей называется `limited`; создайте его, если он не существует.

source: Name of the user class.
ru: Имя класса пользователя.

source: Sets the maximum number of processes (maxproc) to 50 for users in the `limited` class.
ru: Устанавливает максимальное количество процессов (maxproc) равным 50 для пользователей в классе `limited`.

source: Indicates that this user class inherits the default settings from the "default" class.
ru: Указывает, что этот класс пользователя наследует настройки по умолчанию из класса "default".

source: After modifying the [.filename]#/etc/login.conf# file, run man:cap_mkdb[1] to generate the database that FreeBSD uses to apply these settings:
ru: После изменения файла [.filename]#/etc/login.conf# выполните команду man:cap_mkdb[1] для создания базы данных, которую FreeBSD использует для применения этих настроек:

source: man:chpass[1] can be used to change the class to the desired user by executing the following command:
ru: man:chpass[1] может быть использован для изменения класса пользователя на желаемый, выполнив следующую команду:

source: This will open a text editor, add the new `limited` class there as follows:
ru: Это откроет текстовый редактор, где нужно добавить новый класс `limited` следующим образом:

source: Now, the user assigned to the `limited` class will have a maximum process limit of 50. Remember that this is just one example of setting a resource limit using the [.filename]#/etc/login.conf# file.
ru: Теперь пользователь, назначенный классу `limited`, будет иметь ограничение на максимальное количество процессов в 50. Помните, что это лишь один пример настройки ограничения ресурсов с помощью файла [.filename]#/etc/login.conf#.

source: Keep in mind that after making changes to the [.filename]#/etc/login.conf# file, the user needs to log out and log back in for the changes to take effect. Additionally, always exercise caution when editing system configuration files, especially when using privileged access.
ru: Имейте в виду, что после внесения изменений в файл [.filename]#/etc/login.conf# пользователю необходимо выйти из системы и снова войти, чтобы изменения вступили в силу. Кроме того, всегда соблюдайте осторожность при редактировании системных конфигурационных файлов, особенно при использовании привилегированного доступа.

source: The man:rctl[8] system provides a more fine-grained way to set and manage resource limits for individual processes and users. It allows you to dynamically assign resource limits to specific processes or users, regardless of their user class.
ru: Система man:rctl[8] предоставляет более детализированный способ установки и управления ограничениями ресурсов для отдельных процессов и пользователей. Она позволяет динамически назначать ограничения ресурсов конкретным процессам или пользователям, независимо от их класса.

source: The first step to use man:rctl[8] will be to enable it adding the following line to [.filename]#/boot/loader.conf# and reboot the system:
ru: Первым шагом для использования man:rctl[8] будет его включение путем добавления следующей строки в [.filename]#/boot/loader.conf# и перезагрузки системы:

source: Then enable and start the man:rctl[8] service by executing the following commands:
ru: Затем включите и запустите службу man:rctl[8], выполнив следующие команды:

source: Then man:rctl[8] may be used to set rules for the system.
ru: Затем man:rctl[8] может быть использован для установки правил в системе.

source: Rule syntax (man:rctl.conf[5]) is controlled through the use of a subject, subject-id, resource, and action, as seen in this example rule:
ru: Синтаксис правил (man:rctl.conf[5]) определяется с использованием субъекта, идентификатора субъекта, ресурса и действия, как показано в следующем примере правила:

source: For example to constrained the user to add no more than 10 processes execute the following command:
ru: Например, чтобы ограничить пользователя не более чем 10 процессами, выполните следующую команду:

source: To check the applied resource limits the man:rctl[8] command can be executed:
ru: Для проверки установленных ограничений ресурсов можно выполнить команду man:rctl[8]:

source: Installation provides man:periodic[8] configuration files for maintaining the pkg audit database, and provides a programmatic method of keeping it updated.
ru: Установка предоставляет файлы конфигурации man:periodic[8] для поддержания базы данных pkg audit и предлагает программный метод её обновления.

source: By pointing a web browser to the displayed URL, an administrator may obtain more information about the vulnerability.
ru: Направив веб-браузер по указанному URL, администратор может получить дополнительную информацию об уязвимости.

source: This will include the versions affected, by FreeBSD port version, along with other web sites which may contain security advisories.
ru: Это будет включать затронутые версии, указанные по версии порта FreeBSD, а также другие веб-сайты, которые могут содержать рекомендации по безопасности.

source: One task of the security team is to respond to reported security vulnerabilities in the FreeBSD operating system. Once a vulnerability is confirmed, the security team verifies the steps necessary to fix the vulnerability and updates the source code with the fix. It then publishes the details as a "Security Advisory". Security advisories are published on the link:https://www.FreeBSD.org/security/advisories/[FreeBSD website] and mailed to the {freebsd-security-notifications}, {freebsd-security}, and {freebsd-announce}.
ru: Одна из задач команды безопасности — реагировать на сообщения об уязвимостях в операционной системе FreeBSD. После подтверждения уязвимости команда безопасности проверяет шаги, необходимые для её устранения, и обновляет исходный код с исправлением. Затем она публикует подробности в виде «Рекомендации по безопасности» (Security Advisory). Рекомендации по безопасности публикуются на сайте link:https://www.FreeBSD.org/security/advisories/[FreeBSD] и рассылаются в списки рассылки {freebsd-security-notifications}, {freebsd-security} и {freebsd-announce}.
