Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: When setting up [.filename]#krb5.dict# to prevent specific bad passwords from being used as described in man:kadmind[8], remember that it only applies to principals that have a password policy assigned to them. The format used in [.filename]#krb5.dict# is one string per line. Creating a symbolic link to [.filename]#/usr/share/dict/words# might be useful.
ko: man:kadmind[8]에 설명된 대로 특이하게 잘못된 비밀번호가 사용되지 않도록 [.filename]#krb5.dict#를 설정할 때는 비밀번호 정책이 할당된 주체에만 적용된다는 점을 기억하세요. [.filename]#krb5.dict#에 사용되는 형식은 한 줄당 하나의 문자열입니다. [.filename]#/usr/share/dict/words#에 대한 심볼릭 링크를 만드는 것이 유용할 수 있습니다.
ru: При настройке файла [.filename]#krb5.dict# для запрета использования определённых слабых паролей, как описано в man:kadmind[8], помните, что он применяется только к принципалам, для которых назначена политика паролей. Формат файла [.filename]#krb5.dict# предполагает одну строку на каждую запись. Может быть полезно создать символическую ссылку на [.filename]#/usr/share/dict/words#.

source: Mitigating Kerberos Limitations
ko: Kerberos 제한 완화하기
ru: Смягчение ограничений Kerberos

source: Since Kerberos is an all or nothing approach, every service enabled on the network must either be modified to work with Kerberos or be otherwise secured against network attacks. This is to prevent user credentials from being stolen and re-used. An example is when Kerberos is enabled on all remote shells but the non-Kerberized POP3 mail server sends passwords in plain text.
ko: Kerberos는 All or Nothing 접근 방식이므로 네트워크에서 사용하도록 설정된 모든 서비스는 Kerberos와 함께 작동하도록 수정하거나 네트워크 공격으로부터 보안을 유지해야 합니다. 이는 사용자 자격 증명이 도용되어 재사용되는 것을 방지하기 위한 것입니다. 예를 들어 모든 원격 셸에서 Kerberos를 사용하도록 설정했지만 케르베로스화되지 않은 POP3 메일 서버가 일반 텍스트로 비밀번호를 전송하는 경우를 들 수 있습니다.
ru: Поскольку Kerberos — это подход «всё или ничего», каждая служба, включённая в сети, должна быть либо изменена для работы с Kerberos, либо защищена от сетевых атак другим способом. Это необходимо для предотвращения кражи и повторного использования учётных данных пользователей. Например, если Kerberos включён для всех удалённых оболочек, но не поддерживающий Kerberos POP3-сервер передаёт пароли в открытом виде.

source: The KDC is a single point of failure. By design, the KDC must be as secure as its master password database. The KDC should have absolutely no other services running on it and should be physically secure. The danger is high because Kerberos stores all passwords encrypted with the same master key which is stored as a file on the KDC.
ko: KDC는 단일 장애 지점입니다. 설계상 KDC는 마스터 비밀번호 데이터베이스만큼 안전해야 합니다. KDC는 다른 서비스가 전혀 실행되지 않아야 하며 물리적으로 안전해야 합니다. Kerberos는 모든 암호를 동일한 마스터 키로 암호화하여 KDC에 파일로 저장하기 때문에 위험성이 높습니다.
ru: KDC представляет собой единую точку отказа. По замыслу, KDC должен быть таким же защищенным, как и его главная база данных паролей. На KDC не должно быть запущено никаких других служб, и он должен быть физически защищен. Риск очень высок, поскольку Kerberos хранит все пароли, зашифрованные одним главным ключом, который хранится в виде файла на KDC.

source: A compromised master key is not quite as bad as one might fear. The master key is only used to encrypt the Kerberos database and as a seed for the random number generator. As long as access to the KDC is secure, an attacker cannot do much with the master key.
ko: 마스터 키 유출은 우려하는 것만큼 나쁘지 않습니다. 마스터 키는 Kerberos 데이터베이스를 암호화하기 위한 난수 생성기의 시드로만 사용됩니다. KDC에 대한 액세스가 안전한 한, 공격자는 마스터 키로 많은 일을 할 수 없습니다.
ru: Скомпрометированный мастер-ключ не так страшен, как может показаться. Мастер-ключ используется только для шифрования базы данных Kerberos и в качестве затравки для генератора случайных чисел. Пока доступ к KDC защищен, злоумышленник не сможет сделать многое с мастер-ключом.

source: If the KDC is unavailable, network services are unusable as authentication cannot be performed. This can be alleviated with a single master KDC and one or more slaves, and with careful implementation of secondary or fall-back authentication using PAM.
ko: KDC를 사용할 수 없는 경우 인증을 수행할 수 없으므로 네트워크 서비스를 사용할 수 없습니다. 하나의 마스터 KDC와 하나 이상의 슬레이브를 사용하고 PAM을 사용하여 보조 인증 또는 폴백 인증을 신중하게 구현하면 이러한 문제를 완화할 수 있습니다.
ru: Если KDC недоступен, сетевые службы становятся непригодными к использованию, так как аутентификация не может быть выполнена. Это можно смягчить, используя один основной KDC и один или несколько подчинённых, а также тщательно реализовав вторичную или резервную аутентификацию с помощью PAM.

source: Kerberos allows users, hosts and services to authenticate between themselves. It does not have a mechanism to authenticate the KDC to the users, hosts, or services. This means that a trojaned `kinit` could record all user names and passwords. File system integrity checking tools like package:security/tripwire[] can alleviate this.
ko: Kerberos를 사용하면 사용자, 호스트 및 서비스가 서로 인증할 수 있습니다. 그러나 Keroberos는 사용자, 호스트 또는 서비스에 대해 KDC를 인증하는 메커니즘이 없습니다. 즉, 트로이 목마에 감염된 `kinit`은 모든 사용자 이름과 비밀번호를 기록할 수 있습니다. package:security/tripwire[] 같은 파일 시스템 무결성 검사 도구를 사용하면 이 문제를 완화할 수 있습니다.
ru: Kerberos позволяет пользователям, хостам и службам аутентифицироваться между собой. Однако у него нет механизма для аутентификации KDC перед пользователями, хостами или службами. Это означает, что троянская версия `kinit` может записывать все имена пользователей и пароли. Инструменты проверки целостности файловой системы, такие как package:security/tripwire[], могут помочь смягчить эту проблему.

source: Resources and Further Information
ko: 리소스 및 추가 정보
ru: Ресурсы и дополнительная информация

source: OpenSSL is an open source implementation of the SSL and TLS protocols. It provides an encryption transport layer on top of the normal communications layer, allowing it to be intertwined with many network applications and services.
ko: OpenSSL은 SSL 및 TLS 프로토콜의 오픈 소스 구현입니다. 일반 통신 계층 위에 암호화 전송 계층을 제공하여 많은 네트워크 애플리케이션 및 서비스와 연동할 수 있습니다.

source: The version of OpenSSL included in FreeBSD supports Transport Layer Security 1.0/1.1/1.2/1.3 (TLSv1/TLSv1.1/TLSv1.2/TLSv1.3) network security protocols and can be used as a general cryptographic library.
ko: FreeBSD에 포함된 OpenSSL 버전은 전송 계층 보안 1.0/1.1/1.2/1.3(TLSv1/TLSv1.1/TLSv1.2/TLSv1.3) 네트워크 보안 프로토콜을 지원하며 일반 암호화 라이브러리로 사용할 수 있습니다.

source: OpenSSL is often used to encrypt authentication of mail clients and to secure web based transactions such as credit card payments. Some ports, such as package:www/apache24[] and package:databases/postgresql11-server[], include a compile option for building with OpenSSL. If selected, the port will add support using OpenSSL from the base system. To instead have the port compile against OpenSSL from the package:security/openssl[] port, add the following to [.filename]#/etc/make.conf#:
ko: OpenSSL은 메일 클라이언트의 인증을 암호화하고 신용카드 결제와 같은 웹 기반 거래를 보호하는 데 자주 사용됩니다. package:www/apache24[] 및 package:databases/postgresql11-server[] 등 일부 포트에는 OpenSSL로 빌드하기 위한 컴파일 옵션이 포함되어 있습니다. 이 옵션을 선택하면 포트가 기본 시스템에서 OpenSSL을 사용하여 지원을 추가합니다. 대신 package:security/openssl[] 포트에서 OpenSSL에 대해 컴파일하도록 하려면 [.filename]#/etc/make.conf#에 다음을 추가합니다:

source: Another common use of OpenSSL is to provide certificates for use with software applications. Certificates can be used to verify the credentials of a company or individual. If a certificate has not been signed by an external _Certificate Authority_ (CA), such as http://www.verisign.com[http://www.verisign.com], the application that uses the certificate will produce a warning. There is a cost associated with obtaining a signed certificate and using a signed certificate is not mandatory as certificates can be self-signed. However, using an external authority will prevent warnings and can put users at ease.
ko: OpenSSL의 또 다른 일반적인 용도는 소프트웨어 애플리케이션에 사용할 인증서를 제공하는 것입니다. 인증서는 회사 또는 개인의 자격 증명을 확인하는 데 사용할 수 있습니다. 인증서가 http://www.verisign.com[http://www.verisign.com]와 같은 외부 CA(인증 기관)에 의해 서명되지 않은 경우, 인증서를 사용하는 애플리케이션에서 경고가 표시됩니다. 서명된 인증서를 받는 데는 비용이 들며, 인증서를 자체 서명할 수 있으므로 서명된 인증서를 사용하는 것이 필수는 아닙니다. 그러나 외부 기관을 사용하면 경고를 방지하고 사용자를 안심시킬 수 있습니다.

source: This section demonstrates how to create and use certificates on a FreeBSD system. Refer to crossref:network-servers[ldap-config,“Configuring an LDAP Server”] for an example of how to create a CA for signing one's own certificates.
ko: 이 섹션에서는 FreeBSD 시스템에서 인증서를 만들고 사용하는 방법을 설명합니다. 자체 인증서에 서명하기 위한 CA를 만드는 방법의 예는 crossref:network-servers[ldap-config,”LDAP 서버 구성하기”]를 참조하세요.

source: For more information about SSL, read the free https://www.feistyduck.com/books/openssl-cookbook/[OpenSSL Cookbook].
ko: SSL에 대한 자세한 내용은 무료 https://www.feistyduck.com/books/openssl-cookbook/[OpenSSL Cookbook]을 참조하세요.

source: Generating Certificates
ko: 인증서 생성하기
ru: Генерация сертификатов

source: To generate a certificate that will be signed by an external CA, issue the following command and input the information requested at the prompts. This input information will be written to the certificate. At the `Common Name` prompt, input the fully qualified name for the system that will use the certificate. If this name does not match the server, the application verifying the certificate will issue a warning to the user, rendering the verification provided by the certificate as useless.
ko: 외부 CA가 서명할 인증서를 생성하려면 다음 명령을 실행하고 프롬프트에서 요청하는 정보를 입력합니다. 이 입력 정보는 인증서에 기록됩니다. `Common Name` 프롬프트에서 인증서를 사용할 시스템의 정규화된 이름을 입력합니다. 이 이름이 서버와 일치하지 않으면 인증서를 확인하는 애플리케이션에서 사용자에게 경고를 발행하여 인증서가 제공한 확인을 쓸모없게 만듭니다.

source: Other options, such as the expire time and alternate encryption algorithms, are available when creating a certificate. A complete list of options is described in man:openssl[1].
ko: 인증서를 만들 때 만료 시간 및 대체 암호화 알고리즘과 같은 다른 옵션을 사용할 수 있습니다. 옵션의 전체 목록은 man:openssl[1]에 설명되어 있습니다.

source: This command will create two files in the current directory. The certificate request, [.filename]#req.pem#, can be sent to a CA who will validate the entered credentials, sign the request, and return the signed certificate. The second file, [.filename]#cert.key#, is the private key for the certificate and should be stored in a secure location. If this falls in the hands of others, it can be used to impersonate the user or the server.
ko: 이 명령은 현재 디렉터리에 두 개의 파일을 만듭니다. 인증서 요청 파일인 [.filename]#req.pem#은 입력한 자격 증명의 유효성을 검사하고 요청에 서명하고 서명된 인증서를 반환하는 CA로 보낼 수 있습니다. 두 번째 파일인 [.filename]#cert.key#는 인증서의 개인 키이며 안전한 위치에 저장해야 합니다. 이 파일이 다른 사람에게 넘어가면 사용자나 서버를 사칭하는 데 사용될 수 있습니다.

source: Alternately, if a signature from a CA is not required, a self-signed certificate can be created. First, generate the RSA key:
ko: 또는 CA의 서명이 필요하지 않은 경우 자체 서명된 인증서를 만들 수 있습니다. 먼저 RSA 키를 생성합니다:

source: Use this key to create a self-signed certificate. Follow the usual prompts for creating a certificate:
ko: 이 키를 사용하여 자체 서명 인증서를 만들 수 있습니다. 인증서를 만드는 일반적인 프롬프트를 따릅니다:

source: This will create two new files in the current directory: a private key file [.filename]#cert.key#, and the certificate itself, [.filename]#cert.crt#. These should be placed in a directory, preferably under [.filename]#/etc/ssl/#, which is readable only by `root`. Permissions of `0700` are appropriate for these files and can be set using `chmod`.
ko: 그러면 현재 디렉터리에 두 개의 새 파일이 생성됩니다: 개인 키 파일 [.filename]#cert.key#와 인증서 자체 [.filename]#cert.crt#입니다. 이 파일은 `root`만 읽을 수 있는 디렉토리, 가급적 [.filename]#/etc/ssl/# 아래에 배치해야 합니다. 이 파일에는 `0700`의 권한이 적합하며 `chmod`를 사용하여 설정할 수 있습니다.

source: Using Certificates
ko: 인증서 사용하기

source: One use for a certificate is to encrypt connections to the Sendmail mail server in order to prevent the use of clear text authentication.
ko: 인증서의 용도중 한 가지는 일반 텍스트 인증의 사용을 방지하기 위해 Sendmail 메일 서버에 대한 연결을 암호화하는 것입니다.

source: Some mail clients will display an error if the user has not installed a local copy of the certificate. Refer to the documentation included with the software for more information on certificate installation.
ko: 사용자가 인증서의 로컬 복사본을 설치하지 않은 경우 일부 메일 클라이언트에서 오류를 표시합니다. 인증서 설치에 대한 자세한 내용은 소프트웨어에 포함된 설명서를 참조하세요.

source: In FreeBSD 10.0-RELEASE and above, it is possible to create a self-signed certificate for Sendmail automatically. To enable this, add the following lines to [.filename]#/etc/rc.conf#:
ko: FreeBSD 10.0-RELEASE 이상에서는 Sendmail용 자체 서명 인증서를 자동으로 생성할 수 있습니다. 이 기능을 사용하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가하세요:

source: This will automatically create a self-signed certificate, [.filename]#/etc/mail/certs/host.cert#, a signing key, [.filename]#/etc/mail/certs/host.key#, and a CA certificate, [.filename]#/etc/mail/certs/cacert.pem#. The certificate will use the `Common Name` specified in `sendmail_cert_cn`. After saving the edits, restart Sendmail:
ko: 그러면 자체 서명 인증서인 [.filename]#/etc/mail/certs/host.cert#, 서명 키인 [.filename]#/etc/mail/certs/host.key# 및 CA 인증서인 [.filename]#/etc/mail/certs/cacert.pem#이 자동으로 만들어집니다. 인증서는 `sendmail_cert_cn`에 지정된 `Common Name`을 사용합니다. 편집 내용을 저장한 후 Sendmail을 다시 시작합니다:

source: If all went well, there will be no error messages in [.filename]#/var/log/maillog#. For a simple test, connect to the mail server's listening port using `telnet`:
ko: 모든 것이 정상적으로 진행되었다면 [.filename]#/var/log/maillog#에 오류 메시지가 표시되지 않을 것입니다. 간단한 테스트를 위해 `telnet`을 사용하여 메일 서버의 수신 포트에 연결합니다:

source: If the `STARTTLS` line appears in the output, everything is working correctly.
ko: 출력에 `STARTTLS` 줄이 나타나면 모든 것이 올바르게 작동하는 것입니다.

source: VPN over IPsec
ko: IPsec을 통한 VPN

source: Internet Protocol Security (IPsec) is a set of protocols which sit on top of the Internet Protocol (IP) layer. It allows two or more hosts to communicate in a secure manner by authenticating and encrypting each IP packet of a communication session. The FreeBSD IPsec network stack is based on the http://www.kame.net/[http://www.kame.net/] implementation and supports both IPv4 and IPv6 sessions.
ko: 인터넷 프로토콜 보안(IPsec)은 인터넷 프로토콜(IP) 계층 위에 있는 일련의 프로토콜입니다. 이 프로토콜은 통신 세션의 각 IP 패킷을 인증하고 암호화하여 두 개 이상의 호스트가 안전한 방식으로 통신할 수 있도록 합니다. FreeBSD IPsec 네트워크 스택은 http://www.kame.net/[http://www.kame.net/] 구현을 기반으로 하며 IPv4 및 IPv6 세션을 모두 지원합니다.

source: IPsec is comprised of the following sub-protocols:
ko: IPsec은 다음과 같은 하위 프로토콜로 구성됩니다:

source: _Encapsulated Security Payload (ESP)_: this protocol protects the IP packet data from third party interference by encrypting the contents using symmetric cryptography algorithms such as Blowfish and 3DES.
ko: _Encapsulated Security Payload (ESP)_: 이 프로토콜은 Blowfish 및 3DES와 같은 대칭 암호화 알고리즘을 사용하여 내용을 암호화함으로써 제3자의 간섭으로부터 IP 패킷 데이터를 보호합니다.

source: _Authentication Header (AH)_: this protocol protects the IP packet header from third party interference and spoofing by computing a cryptographic checksum and hashing the IP packet header fields with a secure hashing function. This is then followed by an additional header that contains the hash, to allow the information in the packet to be authenticated.
ko: _Authentication Header (AH)_: 이 프로토콜은 암호화 체크섬을 계산하고 보안 해싱 기능으로 IP 패킷 헤더 필드를 해싱하여 제3자의 간섭 및 스푸핑으로부터 IP 패킷 헤더를 보호합니다. 그런 다음 해시가 포함된 추가 헤더를 추가하여 패킷의 정보를 인증할 수 있도록 합니다.

source: _IP Payload Compression Protocol (IPComp_): this protocol tries to increase communication performance by compressing the IP payload in order to reduce the amount of data sent.
ko: _IP Payload Compression Protocol (IPComp_): 이 프로토콜은 전송되는 데이터 양을 줄이기 위해 IP 페이로드를 압축하여 통신 성능을 향상시키려고 합니다.

source: These protocols can either be used together or separately, depending on the environment.
ko: 이러한 프로토콜은 환경에 따라 함께 사용하거나 개별적으로 사용할 수 있습니다.

source: IPsec supports two modes of operation. The first mode, _Transport Mode_, protects communications between two hosts. The second mode, _Tunnel Mode_, is used to build virtual tunnels, commonly known as Virtual Private Networks (VPNs). Consult man:ipsec[4] for detailed information on the IPsec subsystem in FreeBSD.
ko: IPsec은 두 가지 작동 모드를 지원합니다. 첫 번째 모드인 _Transport Mode_는 두 호스트 간의 통신을 보호합니다. 두 번째 모드인 _Tunnel Mode_는 일반적으로 가상 사설망(VPN)으로 알려진 가상 터널을 구축하는 데 사용됩니다. FreeBSD의 IPsec 서브시스템에 대한 자세한 정보는 man:ipsec[4]을 참고하세요.

source: IPsec support is enabled by default on FreeBSD 11 and later. For previous versions of FreeBSD, add these options to a custom kernel configuration file and rebuild the kernel using the instructions in crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]:
ko: IPsec 지원은 FreeBSD 11 이상에서 기본적으로 활성화되어 있습니다. 이전 버전의 FreeBSD의 경우 사용자 지정 커널 구성 파일에 이러한 옵션을 추가하고 crossref:kernelconfig[kernelconfig,FreeBSD 커널 구성하기]의 지침에 따라 커널을 다시 빌드하세요:

source: If IPsec debugging support is desired, the following kernel option should also be added:
ko: IPsec 디버깅 지원을 원하는 경우 다음 커널 옵션도 추가해야 합니다:

source: This rest of this chapter demonstrates the process of setting up an IPsecVPN between a home network and a corporate network. In the example scenario:
ko: 이 장의 나머지 부분에서는 홈 네트워크와 회사 네트워크 간에 IPsecVPN을 설정하는 과정을 설명합니다. 예제 시나리오에서:

source: Both sites are connected to the Internet through a gateway that is running FreeBSD.
ko: 두 사이트 모두 FreeBSD를 실행하는 게이트웨이를 통해 인터넷에 연결됩니다.

source: The gateway on each network has at least one external IP address. In this example, the corporate LAN's external IP address is `172.16.5.4` and the home LAN's external IP address is `192.168.1.12`.
ko: 각 네트워크의 게이트웨이에는 하나 이상의 외부 IP 주소가 있습니다. 이 예에서 회사 LAN의 외부 IP 주소는 `172.16.5.4`이고 홈 LAN의 외부 IP 주소는 `192.168.1.12`입니다.

source: The internal addresses of the two networks can be either public or private IP addresses. However, the address space must not overlap. In this example, the corporate LAN's internal IP address is `10.246.38.1` and the home LAN's internal IP address is `10.0.0.5`.
ko: 두 네트워크의 내부 주소는 공용 또는 사설 IP 주소 중 하나를 사용할 수 있습니다. 그러나 주소 공간이 겹치지 않아야 합니다. 이 예에서 회사 LAN의 내부 IP 주소는 `10.246.38.1`이고 홈 LAN의 내부 IP 주소는 `10.0.0.5`입니다.

source: Configuring a VPN on FreeBSD
ko: FreeBSD에서 VPN 구성하기

source: To begin, package:security/ipsec-tools[] must be installed from the Ports Collection. This software provides a number of applications which support the configuration.
ko: 시작하려면, package:security/ipsec-tools[]를 포트 컬렉션에서 설치해야 합니다. 이 소프트웨어는 구성을 지원하는 여러 애플리케이션을 제공합니다.

source: The next requirement is to create two man:gif[4] pseudo-devices which will be used to tunnel packets and allow both networks to communicate properly. As `root`, run the following command on each gateway:
ko: 다음 요구 사항은 패킷을 터널링하고 두 네트워크가 제대로 통신할 수 있도록 하는 데 사용되는 두 개의 man:gif[4] 의사 장치를 생성하는 것입니다. `root`로 각 게이트웨이에서 다음 명령을 실행합니다:

source: Verify the setup on each gateway, using `ifconfig gif0`. Here is the output from the home gateway:
ko: `ifconfig gif0`을 사용하여 각 게이트웨이의 설정을 확인합니다. 다음은 홈 게이트웨이의 출력입니다:

source: Here is the output from the corporate gateway:
ko: 다음은 회사 게이트웨이의 출력입니다:

source: Once complete, both internal IP addresses should be reachable using man:ping[8]:
ko: 완료되면 man:ping[8]을 사용하여 두 내부 IP 주소에 모두 연결할 수 있어야 합니다:

source: As expected, both sides have the ability to send and receive ICMP packets from the privately configured addresses. Next, both gateways must be told how to route packets in order to correctly send traffic from the networks behind each gateway. The following commands will achieve this goal:
ko: 예상대로 양쪽 모두 비공개로 구성된 주소에서 ICMP 패킷을 보내고 받을 수 있습니다. 다음으로, 각 게이트웨이 뒤에 있는 네트워크에서 트래픽을 올바르게 보내려면 두 게이트웨이에 패킷 라우팅 방법을 알려야 합니다. 다음 명령으로 이 목표를 달성할 수 있습니다:

source: Internal machines should be reachable from each gateway as well as from machines behind the gateways. Again, use man:ping[8] to confirm:
ko: 각 게이트웨이와 게이트웨이 뒤에 있는 머신에서 내부 머신에 연결할 수 있어야 합니다. 다시 man:ping[8]을 사용하여 확인합니다:

source: At this point, traffic is flowing between the networks encapsulated in a gif tunnel but without any encryption. Next, use IPSec to encrypt traffic using pre-shared keys (PSK). Other than the IP addresses, [.filename]#/usr/local/etc/racoon/racoon.conf# on both gateways will be identical and look similar to:
ko: 이 시점에서 트래픽은 암호화되지 않은 채 gif 터널로 캡슐화된 네트워크 간에 흐릅니다. 다음으로, IPSec을 사용하여 PSK(사전 공유 키)를 사용하여 트래픽을 암호화합니다. IP 주소를 제외하고 두 게이트웨이의 [.filename]#/usr/local/etc/racoon/racoon.conf#는 동일하며 다음과 비슷하게 보입니다:

source: For descriptions of each available option, refer to the manual page for [.filename]#racoon.conf#.
ko: 사용 가능한 각 옵션에 대한 설명은 [.filename]#racoon.conf#의 설명서 페이지를 참조하세요.

source: The Security Policy Database (SPD) needs to be configured so that FreeBSD and racoon are able to encrypt and decrypt network traffic between the hosts.
ko: FreeBSD와 Racoon이 호스트 간의 네트워크 트래픽을 암호화하고 해독할 수 있도록 보안 정책 데이터베이스(Security Policy Database, SPD)를 구성해야 합니다.

source: This can be achieved with a shell script, similar to the following, on the corporate gateway. This file will be used during system initialization and should be saved as [.filename]#/usr/local/etc/racoon/setkey.conf#.
ko: 이는 회사 게이트웨이에서 다음과 유사한 셸 스크립트를 사용하여 수행할 수 있습니다. 이 파일은 시스템 초기화 중에 사용되며 [.filename]#/usr/local/etc/racoon/setkey.conf#로 저장해야 합니다.

source: Once in place, racoon may be started on both gateways using the following command:
ko: 설치가 완료되면 다음 명령을 사용하여 두 게이트웨이 모두에서 Racoon을 시작할 수 있습니다:

source: The output should be similar to the following:
ko: 출력은 다음과 비슷해야 합니다:
ru: Вывод должен быть похож на следующий:

source: To ensure the tunnel is working properly, switch to another console and use man:tcpdump[1] to view network traffic using the following command. Replace `em0` with the network interface card as required:
ko: 터널이 제대로 작동하는지 확인하려면 다른 콘솔로 전환하고 man:tcpdump[1]를 사용하여 다음 명령을 사용하여 네트워크 트래픽을 확인합니다. 필요에 따라 `em0`을 네트워크 인터페이스 카드로 바꿉니다:

source: Data similar to the following should appear on the console. If not, there is an issue and debugging the returned data will be required.
ko: 콘솔에 다음과 유사한 데이터가 표시되어야 합니다. 그렇지 않은 경우 문제가 있는 것이므로 반환된 데이터를 디버깅해야 합니다.

source: At this point, both networks should be available and seem to be part of the same network. Most likely both networks are protected by a firewall. To allow traffic to flow between them, rules need to be added to pass packets. For the man:ipfw[8] firewall, add the following lines to the firewall configuration file:
ko: 이 시점에서 두 네트워크 모두 사용할 수 있어야 하며 동일한 네트워크의 일부인 것처럼 보입니다. 두 네트워크 모두 방화벽으로 보호되어 있을 가능성이 높습니다. 두 네트워크 간에 트래픽이 흐르도록 허용하려면 패킷을 통과시키는 규칙을 추가해야 합니다. man:ipfw[8] 방화벽의 경우 방화벽 구성 파일에 다음 줄을 추가합니다:

source: The rule numbers may need to be altered depending on the current host configuration.
ko: 현재 호스트 구성에 따라 규칙 번호를 변경해야 할 수도 있습니다.

source: For users of man:pf[4] or man:ipf[8], the following rules should do the trick:
ko: man:pf[4] 또는 man:ipf[8] 사용자의 경우 다음 규칙이 도움이 될 것입니다:

source: Finally, to allow the machine to start support for the VPN during system initialization, add the following lines to [.filename]#/etc/rc.conf#:
ko: 마지막으로, 시스템 초기화 중에 컴퓨터가 VPN 지원을 시작하도록 하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가하세요:

source: OpenSSH is a set of network connectivity tools used to provide secure access to remote machines. Additionally, TCP/IP connections can be tunneled or forwarded securely through SSH connections. OpenSSH encrypts all traffic to effectively eliminate eavesdropping, connection hijacking, and other network-level attacks.
ko: OpenSSH는 원격 머신에 대한 보안 액세스를 제공하는 데 사용되는 네트워크 연결 도구 세트입니다. 또한, TCP/IP 연결은 SSH 연결을 통해 안전하게 터널링하거나 전달할 수 있습니다. OpenSSH는 모든 트래픽을 암호화하여 도청, 연결 하이재킹 및 기타 네트워크 수준 공격을 효과적으로 제거합니다.

source: OpenSSH is maintained by the OpenBSD project and is installed by default in FreeBSD.
ko: OpenSSH는 OpenBSD 프로젝트에서 유지 관리하며 FreeBSD에 기본적으로 설치됩니다.
ru: OpenSSH разрабатывается проектом OpenBSD и устанавливается по умолчанию в FreeBSD.

source: When data is sent over the network in an unencrypted form, network sniffers anywhere in between the client and server can steal user/password information or data transferred during the session. OpenSSH offers a variety of authentication and encryption methods to prevent this from happening. More information about OpenSSH is available from http://www.openssh.com/[http://www.openssh.com/].
ko: 데이터가 암호화되지 않은 형태로 네트워크를 통해 전송되면 클라이언트와 서버 사이에 있는 네트워크 스니퍼가 세션 중에 전송된 사용자/비밀번호 정보나 데이터를 훔칠 수 있습니다. OpenSSH는 이를 방지하기 위해 다양한 인증 및 암호화 방법을 제공합니다. OpenSSH에 대한 자세한 정보는 http://www.openssh.com/[http://www.openssh.com/]에서 확인할 수 있습니다.
