Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/security/_index.po
Languages: ko, ru

source: TCP Wrapper is a host-based access control system which extends the abilities of crossref:network-servers[network-inetd,“The inetd Super-Server”]. It can be configured to provide logging support, return messages, and connection restrictions for the server daemons under the control of inetd. Refer to man:tcpd[8] for more information about TCP Wrapper and its features.
ko: TCP 래퍼는 crossref:network-servers[network-inetd,“The inetd Super-Server”]의 기능을 확장하는 호스트 기반 액세스 제어 시스템입니다. inetd의 제어를 받는 서버 데몬에 대해 로깅 지원, 메시지 반환 및 연결 제한을 제공하도록 구성할 수 있습니다. TCP 래퍼와 그 기능에 대한 자세한 내용은 man:tcpd[8]을 참조하세요.

source: TCP Wrapper should not be considered a replacement for a properly configured firewall. Instead, TCP Wrapper should be used in conjunction with a firewall and other security enhancements in order to provide another layer of protection in the implementation of a security policy.
ko: TCP 래퍼는 제대로 구성된 방화벽을 대체하는 것으로 간주해서는 안 됩니다. 대신, 보안 정책을 구현할 때 또 다른 보호 계층을 제공하기 위해 방화벽 및 기타 보안 향상 기능과 함께 TCP 래퍼를 사용해야 합니다.

source: Initial Configuration
ko: 초기 구성
ru: Начальная настройка

source: To enable TCP Wrapper in FreeBSD, add the following lines to [.filename]#/etc/rc.conf#:
ko: FreeBSD에서 TCP 래퍼를 활성화하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:

source: Then, properly configure [.filename]#/etc/hosts.allow#.
ko: 그리고 나서 [.filename]#/etc/hosts.allow#를 적절히 구성합니다.
ru: Затем правильно настройте [.filename]#/etc/hosts.allow#.

source: Unlike other implementations of TCP Wrapper, the use of [.filename]#hosts.deny# is deprecated in FreeBSD. All configuration options should be placed in [.filename]#/etc/hosts.allow#.
ko: 다른 TCP 래퍼 구현과 달리, [.filename]#hosts.deny#의 사용은 FreeBSD에서 더 이상 사용되지 않습니다. 모든 구성 옵션은 [.filename]#/etc/hosts.allow#에 배치해야 합니다.

source: In the simplest configuration, daemon connection policies are set to either permit or block, depending on the options in [.filename]#/etc/hosts.allow#. The default configuration in FreeBSD is to allow all connections to the daemons started with inetd.
ko: 가장 간단한 구성에서 데몬 연결 정책은 [.filename]#/etc/hosts.allow#의 옵션에 따라 허용 또는 차단으로 설정됩니다. FreeBSD의 기본 구성은 inetd로 시작하는 데몬에 대한 모든 연결을 허용하는 것입니다.
ru: В простейшей конфигурации политики подключения к демонам устанавливаются на разрешение или блокировку в зависимости от параметров в [.filename]#/etc/hosts.allow#. Конфигурация по умолчанию в FreeBSD разрешает все подключения к демонам, запущенным через inetd.

source: Basic configuration usually takes the form of `daemon : address : action`, where `daemon` is the daemon which inetd started, `address` is a valid hostname, IP address, or an IPv6 address enclosed in brackets ([ ]), and `action` is either `allow` or `deny`. TCP Wrapper uses a first rule match semantic, meaning that the configuration file is scanned from the beginning for a matching rule. When a match is found, the rule is applied and the search process stops.
ko: 기본 구성은 일반적으로 `daemon : address : action`의 형식을 취하는데, 여기서 `daemon`은 inetd를 시작한 데몬이고, `address`는 괄호([ ])로 묶인 유효한 호스트 이름, IP 주소 또는 IPv6 주소이며, `action`은 `allow` 또는 `deny` 중 하나입니다. TCP 래퍼는 첫 번째 규칙 일치 시맨틱을 사용합니다. 즉, 구성 파일에서 일치하는 규칙이 있는지 처음부터 검색합니다. 일치하는 규칙이 발견되면 규칙이 적용되고 검색 프로세스가 중지됩니다.

source: For example, to allow POP3 connections via the package:mail/qpopper[] daemon, the following lines should be appended to [.filename]#hosts.allow#:
ko: 예를 들어 package:mail/qpopper[] 데몬을 통해 POP3 연결을 허용하려면 [.filename]#hosts.allow#에 다음 줄을 추가해야 합니다:

source: Whenever this file is edited, restart inetd:
ko: 이 파일을 편집할 때마다 inetd를 다시 시작합니다:
ru: Всякий раз, когда редактируется этот файл, перезапустите inetd:

source: Advanced Configuration
ko: 고급 구성
ru: Расширенная Настройка

source: TCP Wrapper provides advanced options to allow more control over the way connections are handled. In some cases, it may be appropriate to return a comment to certain hosts or daemon connections. In other cases, a log entry should be recorded or an email sent to the administrator. Other situations may require the use of a service for local connections only. This is all possible through the use of configuration options known as wildcards, expansion characters, and external command execution.
ko: TCP 래퍼는 연결이 처리되는 방식을 더 잘 제어할 수 있는 고급 옵션을 제공합니다. 경우에 따라 특정 호스트나 데몬 연결에 대한 코멘트를 반환하는 것이 적절할 수 있습니다. 다른 경우에는 로그 항목을 기록하거나 관리자에게 이메일을 보내야 합니다. 다른 상황에서는 로컬 연결 전용 서비스를 사용해야 할 수도 있습니다. 와일드카드, 확장 문자, 외부 명령 실행으로 알려진 구성 옵션을 사용하면 이 모든 것이 가능합니다.

source: Suppose that a situation occurs where a connection should be denied yet a reason should be sent to the host who attempted to establish that connection. That action is possible with `twist`. When a connection attempt is made, `twist` executes a shell command or script. An example exists in [.filename]#hosts.allow#:
ko: 연결을 거부해야 하지만 연결을 시도한 호스트에게 이유를 보내야 하는 상황이 발생한다고 가정해 보겠습니다. `twist`를 사용하면 이러한 작업이 가능합니다. 연결이 시도되면 `twist`는 셸 명령 또는 스크립트를 실행합니다. 예제는 [.filename]#hosts.allow#에 있습니다:

source: In this example, the message "You are not allowed to use _daemon name_ from _hostname_." will be returned for any daemon not configured in [.filename]#hosts.allow#. This is useful for sending a reply back to the connection initiator right after the established connection is dropped. Any message returned _must_ be wrapped in quote (`"`) characters.
ko: 이 예에서는 [.filename]#hosts.allow#에서 구성되지 않은 데몬에 대해 “_호스트명_에서 _데몬 이름_을 사용할 수 없습니다.”라는 메시지가 반환됩니다. 이는 설정된 연결이 끊어진 직후 연결 개시자에게 회신을 보낼 때 유용합니다. 반환되는 모든 메시지는 따옴표(`”`) 문자로 묶어야 합니다.

source: It may be possible to launch a denial of service attack on the server if an attacker floods these daemons with connection requests.
ko: 공격자가 이러한 데몬에 연결 요청을 폭주하면 서버에 대한 서비스 거부 공격을 시작할 수 있습니다.

source: Another possibility is to use `spawn`. Like `twist`, `spawn` implicitly denies the connection and may be used to run external shell commands or scripts. Unlike `twist`, `spawn` will not send a reply back to the host who established the connection. For example, consider the following configuration:
ko: 또 다른 가능성은 `spawn`을 사용하는 것입니다. `twist`와 마찬가지로 `spawn`은 암시적으로 연결을 거부하며 외부 셸 명령이나 스크립트를 실행하는 데 사용될 수 있습니다. `twist`와 달리 `spawn`은 연결을 설정한 호스트에게 응답을 보내지 않습니다. 예를 들어 다음 구성을 고려하세요:

source: This will deny all connection attempts from `*.example.com` and log the hostname, IP address, and the daemon to which access was attempted to [.filename]#/var/log/connections.log#. This example uses the substitution characters `%a` and `%h`. Refer to man:hosts_access[5] for the complete list.
ko: 이렇게 하면 `*.example.com`으로부터의 모든 연결 시도가 거부되고 호스트 이름, IP 주소, 액세스가 시도된 데몬을 [.filename]#/var/log/connections.log#에 기록합니다. 이 예에서는 대체 문자 `%a`와 `%h`를 사용합니다. 전체 목록은 man:hosts_access[5]를 참조하세요.

source: To match every instance of a daemon, domain, or IP address, use `ALL`. Another wildcard is `PARANOID` which may be used to match any host which provides an IP address that may be forged because the IP address differs from its resolved hostname. In this example, all connection requests to Sendmail which have an IP address that varies from its hostname will be denied:
ko: 데몬, 도메인 또는 IP 주소의 모든 인스턴스를 일치시키려면 `ALL`을 사용합니다. 또 다른 와일드카드는 `PARANOID`로, IP 주소가 확인된 호스트 이름과 다르기 때문에 위조되었을 수 있는 IP 주소를 제공하는 모든 호스트와 일치시키는 데 사용할 수 있습니다. 이 예에서는 호스트 이름과 다른 IP 주소를 가진 센드메일에 대한 모든 연결 요청이 거부됩니다:

source: Using the `PARANOID` wildcard will result in denied connections if the client or server has a broken DNS setup.
ko: `PARANOID` 와일드카드를 사용하면 클라이언트 또는 서버의 DNS 설정이 손상된 경우 연결이 거부됩니다.

source: To learn more about wildcards and their associated functionality, refer to man:hosts_access[5].
ko: 와일드카드 및 관련 기능에 대해 자세히 알아보려면 man:hosts_access[5]를 참조하세요.

source: When adding new configuration lines, make sure that any unneeded entries for that daemon are commented out in [.filename]#hosts.allow#.
ko: 새 구성 줄을 추가할 때 해당 데몬에 대한 불필요한 항목이 [.filename]#hosts.allow#에 주석 처리되어 있는지 확인하세요.

source: Kerberos is a network authentication protocol which was originally created by the Massachusetts Institute of Technology (MIT) as a way to securely provide authentication across a potentially hostile network. The Kerberos protocol uses strong cryptography so that both a client and server can prove their identity without sending any unencrypted secrets over the network. Kerberos can be described as an identity-verifying proxy system and as a trusted third-party authentication system. After a user authenticates with Kerberos, their communications can be encrypted to assure privacy and data integrity.
ko: Kerberos는 잠재적으로 적대적인 네트워크에서 안전하게 인증을 제공하기 위해 매사추세츠 공과대학(MIT)에서 만든 네트워크 인증 프로토콜입니다. Kerberos 프로토콜은 강력한 암호화를 사용하여 클라이언트와 서버 모두 암호화되지 않은 비밀을 네트워크를 통해 전송하지 않고도 자신의 신원을 증명할 수 있습니다. Kerberos는 신원 확인 프록시 시스템과 신뢰할 수 있는 타사 인증 시스템으로 설명할 수 있습니다. 사용자가 Kerberos로 인증하면 통신을 암호화하여 개인 정보 보호 및 데이터 무결성을 보장할 수 있습니다.
ru: Kerberos — это сетевой протокол аутентификации, изначально созданный Массачусетским технологическим институтом (MIT) для безопасной аутентификации в потенциально враждебной сети. Протокол Kerberos использует надежное шифрование, позволяя как клиенту, так и серверу подтверждать свою подлинность без передачи незашифрованных секретов по сети. Kerberos можно охарактеризовать как систему проверки подлинности через посредника (прокси) и как систему аутентификации с доверенным третьим лицом. После аутентификации пользователя в Kerberos его передаваемые данные могут шифроваться для обеспечения конфиденциальности и целостности информации.

source: The only function of Kerberos is to provide the secure authentication of users and servers on the network. It does not provide authorization or auditing functions. It is recommended that Kerberos be used with other security methods which provide authorization and audit services.
ko: Kerberos의 유일한 기능은 네트워크에서 사용자와 서버에 대한 보안 인증을 제공하는 것입니다. 권한 부여 또는 감사 기능은 제공하지 않습니다. Kerberos는 권한 부여 및 감사 서비스를 제공하는 다른 보안 방법과 함께 사용하는 것이 좋습니다.
ru: Единственная функция Kerberos — обеспечение безопасной аутентификации пользователей и серверов в сети. Он не предоставляет функций авторизации или аудита. Рекомендуется использовать Kerberos вместе с другими методами безопасности, которые обеспечивают сервисы авторизации и аудита.

source: The current version of the protocol is version 5, described in RFC 4120. Several free implementations of this protocol are available, covering a wide range of operating systems. MIT continues to develop their Kerberos package. It is commonly used in the US as a cryptography product, and has historically been subject to US export regulations. In FreeBSD, MITKerberos is available as the package:security/krb5[] package or port. The Heimdal Kerberos implementation was explicitly developed outside of the US to avoid export regulations. The Heimdal Kerberos distribution is included in the base FreeBSD installation, and another distribution with more configurable options is available as package:security/heimdal[] in the Ports Collection.
ko: 현재 프로토콜의 버전은 RFC 4120에 설명된 버전 5입니다. 이 프로토콜은 다양한 운영 체제를 지원하는 여러 무료 구현을 사용할 수 있습니다. MIT는 Kerberos 패키지를 계속 개발하고 있습니다. 이 패키지는 미국에서 암호화 제품으로 일반적으로 사용되며, 역사적으로 미국 수출 규제의 적용을 받아왔습니다. FreeBSD에서 MITKerberos는 package:security/krb5[] 패키지 또는 포트로 제공됩니다. 하임달 케르베로스(Heimdal Kerberos) 구현은 수출 규제를 피하기 위해 미국 이외의 지역에서 명시적으로 개발되었습니다. 하임달 케르베로스 배포판은 기본 FreeBSD 설치에 포함되어 있으며, 구성 가능한 옵션이 더 많은 다른 배포판은 포트 컬렉션에서 package:security/heimdal[]로 사용할 수 있습니다.
ru: Текущая версия протокола — версия 5, описанная в RFC 4120. Существует несколько свободных реализаций этого протокола, охватывающих широкий спектр операционных систем. MIT продолжает развивать свой пакет Kerberos. Он широко используется в США как криптографический продукт и исторически подпадал под экспортные ограничения США. В FreeBSD MITKerberos доступен в виде пакета package:security/krb5[] или порта. Реализация Heimdal Kerberos была разработана за пределами США специально, чтобы избежать экспортных ограничений. Дистрибутив Heimdal Kerberos включён в базовую установку FreeBSD, а другая версия с более гибкими настройками доступна в коллекции портов как package:security/heimdal[].

source: In Kerberos users and services are identified as "principals" which are contained within an administrative grouping, called a "realm". A typical user principal would be of the form `_user_@_REALM_` (realms are traditionally uppercase).
ko: Kerberos에서 사용자 및 서비스는 “영역(Realm)”이라고 하는 관리 그룹 내에 포함된 “주체(Principal)”로 식별됩니다. 일반적인 사용자 주체는 `_user_@_REALM_` 형식입니다(영역은 전통적으로 대문자임).
ru: В Kerberos пользователи и службы идентифицируются как «принципалы», которые входят в административную группу, называемую «реалмом». Типичный принципал пользователя имеет вид `_пользователь_@_РЕАЛМ_` (реалмы традиционно пишутся в верхнем регистре).

source: This section provides a guide on how to set up Kerberos using the Heimdal distribution included in FreeBSD.
ko: 이 섹션에서는 FreeBSD에 포함된 하임달 배포판을 사용하여 Kerberos를 설정하는 방법에 대한 가이드를 제공합니다.
ru: Эта часть руководства содержит инструкции по настройке Kerberos с использованием дистрибутива Heimdal, включённого в FreeBSD.

source: For purposes of demonstrating a Kerberos installation, the name spaces will be as follows:
ko: Kerberos 설치 데모를 위해 이름 공간(Name space)은 다음과 같습니다:
ru: Для демонстрации установки Kerberos пространства имен будут следующими:

source: The DNS domain (zone) will be `example.org`.
ko: DNS 도메인(영역)은 `example.org`가 됩니다.
ru: Доменная зона DNS будет `example.org`.

source: The Kerberos realm will be `EXAMPLE.ORG`.
ko: Kerberos 영역은 `EXAMPLE.ORG`가 됩니다.
ru: Realm Kerberos будет `EXAMPLE.ORG`.

source: Use real domain names when setting up Kerberos, even if it will run internally. This avoids DNS problems and assures inter-operation with other Kerberos realms.
ko: 내부에서 실행되는 경우에도 Kerberos를 설정할 때는 실제 도메인 이름을 사용하세요. 이렇게 하면 DNS 문제를 방지하고 다른 Kerberos 영역과의 상호 운용을 보장할 수 있습니다.
ru: Используйте настоящие доменные имена при настройке Kerberos, даже если он будет работать внутри сети. Это позволяет избежать проблем с DNS и обеспечивает взаимодействие с другими доменами Kerberos.

source: Setting up a Heimdal KDC
ko: 하임달 KDC 설정하기
ru: Настройка Heimdal KDC

source: The Key Distribution Center (KDC) is the centralized authentication service that Kerberos provides, the "trusted third party" of the system. It is the computer that issues Kerberos tickets, which are used for clients to authenticate to servers. As the KDC is considered trusted by all other computers in the Kerberos realm, it has heightened security concerns. Direct access to the KDC should be limited.
ko: KDC(Key Distribution Center)는 Kerberos가 제공하는 중앙 집중식 인증 서비스로, 시스템의 “신뢰할 수 있는 제3자”입니다. 여기서 KDC는 클라이언트가 서버에 인증하는 데 사용되는 Kerberos 티켓을 발급하는 컴퓨터입니다. KDC는 Kerberos 영역의 다른 모든 컴퓨터에서 신뢰할 수 있는 것으로 간주되므로 보안에 대한 우려가 높습니다. KDC에 대한 직접 액세스는 제한되어야 합니다.
ru: Центр распределения ключей (Key Distribution Center — KDC) — это централизованная служба аутентификации, предоставляемая Kerberos, «доверенная третья сторона» системы. Это компьютер, который выдает билеты Kerberos, используемые клиентами для аутентификации на серверах. Поскольку KDC считается доверенным для всех остальных компьютеров в области Kerberos, к нему предъявляются повышенные требования безопасности. Прямой доступ к KDC должен быть ограничен.

source: While running a KDC requires few computing resources, a dedicated machine acting only as a KDC is recommended for security reasons.
ko: KDC를 실행하는 데는 컴퓨팅 리소스가 거의 필요하지 않지만, 보안상의 이유로 KDC 역할만 하는 전용 머신을 사용하는 것이 좋습니다.
ru: При работе KDC требуется мало вычислительных ресурсов, однако по соображениям безопасности рекомендуется выделить отдельный компьютер, который будет использоваться исключительно в качестве KDC.

source: To begin, install the package:security/heimdal[] package as follows:
ko: 시작하려면 다음과 같이 package:security/heimdal[] 패키지를 설치합니다:
ru: Для начала установите пакет package:security/heimdal[] следующим образом:

source: Next, update [.filename]#/etc/rc.conf# using `sysrc` as follows:
ko: 그런 다음 `sysrc`를 사용하여 다음과 같이 [.filename]#/etc/rc.conf#를 업데이트합니다:
ru: Далее обновите [.filename]#/etc/rc.conf# с помощью `sysrc` следующим образом:

source: Next, edit [.filename]#/etc/krb5.conf# as follows:
ko: 다음으로 [.filename]#/etc/krb5.conf#을 편집합니다:
ru: Далее отредактируйте файл [.filename]#/etc/krb5.conf# следующим образом:

source: In this example, the KDC will use the fully-qualified hostname `kerberos.example.org`. The hostname of the KDC must be resolvable in the DNS.
ko: 이 예제에서 KDC는 정규화된 호스트 이름인 `kerberos.example.org`를 사용합니다. KDC의 호스트 이름은 DNS에서 확인할 수 있어야 합니다.
ru: В этом примере KDC будет использовать полное доменное имя `kerberos.example.org`. Имя хоста KDC должно разрешаться в DNS.

source: Kerberos can also use the DNS to locate KDCs, instead of a `[realms]` section in [.filename]#/etc/krb5.conf#. For large organizations that have their own DNS servers, the above example could be trimmed to:
ko: Kerberos는 또한 [.filename]#/etc/krb5.conf#의 `[realms]` 섹션 대신 DNS를 사용하여 KDC를 찾을 수 있습니다. 자체 DNS 서버가 있는 대규모 조직의 경우 위의 예제를 다음과 같이 다듬을 수 있습니다:
ru: Kerberos также может использовать DNS для поиска KDC вместо раздела `[realms]` в [.filename]#/etc/krb5.conf#. Для крупных организаций, имеющих собственные DNS-серверы, приведённый выше пример можно сократить до:

source: With the following lines being included in the `example.org` zone file:
ko: `example.org` 영역 파일에 다음 줄이 포함되어 있습니다:
ru: Со следующими строками, включёнными в файл зоны `example.org`:

source: In order for clients to be able to find the Kerberos services, they _must_ have either a fully configured [.filename]#/etc/krb5.conf# or a minimally configured [.filename]#/etc/krb5.conf# _and_ a properly configured DNS server.
ko: 클라이언트가 Kerberos 서비스를 찾을 수 있으려면 완전히 구성된 [.filename]#/etc/krb5.conf# 또는 최소로 구성된 [.filename]#/etc/krb5.conf#과 제대로 구성된 DNS _서버가 있어야_ 합니다.
ru: Чтобы клиенты могли найти службы Kerberos, они _должны_ иметь либо полностью настроенный файл [.filename]#/etc/krb5.conf#, либо минимально настроенный [.filename]#/etc/krb5.conf# _и_ правильно настроенный DNS-сервер.

source: Next, create the Kerberos database which contains the keys of all principals (users and hosts) encrypted with a master password. It is not required to remember this password as it will be stored in [.filename]#/var/heimdal/m-key#; it would be reasonable to use a 45-character random password for this purpose. To create the master key, run `kstash` and enter a password:
ko: 다음으로 마스터 비밀번호로 암호화된 모든 주체(사용자 및 호스트)의 키가 포함된 Kerberos 데이터베이스를 만듭니다. 이 비밀번호는 [.filename]#/var/heimdal/m-key#에 저장되므로 기억할 필요가 없으며, 45자 임의의 비밀번호를 사용하는 것이 좋습니다. 마스터 키를 생성하려면 `kstash`를 실행하고 비밀번호를 입력합니다:
ru: Далее создайте базу данных Kerberos, которая содержит ключи всех принципалов (пользователей и хостов), зашифрованные мастер-паролем. Нет необходимости запоминать этот пароль, так как он будет храниться в [.filename]#/var/heimdal/m-key#; разумно использовать для этого случайный пароль длиной 45 символов. Чтобы создать мастер-ключ, выполните `kstash` и введите пароль:

source: Once the master key has been created, the database should be initialized. The Kerberos administrative tool man:kadmin[8] can be used on the KDC in a mode that operates directly on the database, without using the man:kadmind[8] network service, as `kadmin -l`. This resolves the chicken-and-egg problem of trying to connect to the database before it is created. At the `kadmin` prompt, use `init` to create the realm's initial database:
ko: 마스터 키가 생성되면 데이터베이스를 초기화해야 합니다. Kerberos 관리 도구 man:kadmin[8]은 `kadmin -l`로 man:kadmind[8] 네트워크 서비스를 구동하지 않고 데이터베이스에서 직접 KDC에서 사용할 수 있습니다. 이렇게 하면 데이터베이스가 생성되기 전에 데이터베이스에 연결하려고 시도하는 닭과 달걀 문제를 해결할 수 있습니다. `kadmin` 프롬프트에서 `init`을 사용하여 영역의 초기 데이터베이스를 만듭니다:
ru: После создания мастер-ключа следует инициализировать базу данных. Утилита администрирования Kerberos man:kadmin[8] может быть использована на KDC в режиме, который работает напрямую с базой данных, без использования сетевого сервиса man:kadmind[8], как `kadmin -l`. Это решает проблему курицы и яйца, когда попытка подключения к базе данных происходит до её создания. В командной строке `kadmin` используйте `init` для создания начальной базы данных realm:

source: Lastly, while still in `kadmin`, create the first principal using `add`. Stick to the default options for the principal for now, as these can be changed later with `modify`. Type `?` at the prompt to see the available options.
ko: 마지막으로 `kadmin`에 있는 동안 `add`를 사용하여 첫 번째 주체(Principal)를 생성합니다. 나중에 `modify`를 사용하여 변경할 수 있으므로 지금은 기본 옵션을 그대로 사용합니다. 프롬프트에 `?`를 입력하여 사용 가능한 옵션을 확인합니다.
ru: Наконец, оставаясь в `kadmin`, создайте первый принципал с помощью команды `add`. Пока придерживайтесь стандартных настроек для принципала, так как их можно изменить позже с помощью команды `modify`. Введите `?` в командной строке, чтобы увидеть доступные опции.

source: Next, start the KDC services by running:
ko: 아래의 명령으로 KDC 서비스를 시작합니다:
ru: Далее запустите службы KDC, выполнив:

source: While there will not be any kerberized daemons running at this point, it is possible to confirm that the KDC is functioning by obtaining a ticket for the principal that was just created:
ko: 이 시점에서 실행 중인 케르베로스화된 데몬은 없지만 방금 생성한 주체에 대한 티켓을 가져와서 KDC가 작동 중인지 확인할 수 있습니다:
ru: Хотя на этом этапе не будет запущено никаких сервисов с поддержкой Kerberos, можно убедиться, что KDC функционирует, получив билет для только что созданного принципала:

source: Confirm that a ticket was successfully obtained using `klist`:
ko: `klist`를 사용하여 티켓을 성공적으로 받았는지 확인합니다:
ru: Подтвердите успешное получение билета с помощью `klist`:

source: The temporary ticket can be destroyed when the test is finished:
ko: 임시 티켓은 테스트가 완료되면 폐기할 수 있습니다:
ru: Временный билет можно уничтожить после завершения теста:

source: Configuring a Server to Use Kerberos
ko: 케르베로스 사용을 위한 서버 구성하기
ru: Настройка сервера для использования Kerberos

source: The first step in configuring a server to use Kerberos authentication is to ensure that it has the correct configuration in [.filename]#/etc/krb5.conf#. The version from the KDC can be used as-is, or it can be regenerated on the new system.
ko: Kerberos 인증을 사용하도록 서버를 구성하는 첫 번째 단계는 [.filename]#/etc/krb5.conf#에 올바른 구성이 있는지 확인하는 것입니다. KDC의 버전을 그대로 사용하거나 새 시스템에서 다시 생성할 수 있습니다.
ru: Первым шагом в настройке сервера для использования аутентификации Kerberos является проверка правильности конфигурации в файле [.filename]#/etc/krb5.conf#. Версию с KDC можно использовать как есть или пересоздать на новой системе.
