Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/arch-handbook/scsi/_index.po
Languages: ru

source: Else the command itself has completed, pay more attention to details. If auto-sense is not disabled for this CCB and the command has failed with sense data then run REQUEST SENSE command to receive that data.
ru: Иначе сама команда завершена, уделяйте больше внимания деталям. Если автоопределение не отключено для этого CCB и команда завершилась неудачно с данными состояния, выполните команду REQUEST SENSE для получения этих данных.

source: One typical thing would be negotiation events: negotiation messages received from a SCSI target (in answer to our negotiation attempt or by target's initiative) or the target is unable to negotiate (rejects our negotiation messages or does not answer them).
ru: Типичным примером могут быть события согласования: сообщения согласования, полученные от цели SCSI (в ответ на нашу попытку согласования или по инициативе цели), или если цель не может согласовать (отклоняет наши сообщения согласования или не отвечает на них).

source: Then we handle any errors that could have happened during auto-sense in the same simple-minded way as before. Otherwise we look closer at the details again.
ru: Затем мы обрабатываем любые ошибки, которые могли произойти во время автоопределения, тем же простым способом, что и раньше. В противном случае мы снова внимательно изучаем детали.

source: The next event we consider is unexpected disconnect. Which is considered normal after an ABORT or BUS DEVICE RESET message and abnormal in other cases.
ru: Следующее событие, которое мы рассматриваем, — это неожиданное отключение. Оно считается нормальным после сообщения ABORT или BUS DEVICE RESET и аномальным в остальных случаях.

source: If the target refuses to accept tags we notify CAM about that and return back all commands for this LUN:
ru: Если цель отказывается принимать теги, мы уведомляем CAM об этом и возвращаем все команды для этого LUN:

source: Then we check a number of other conditions, with processing basically limited to setting the CCB status:
ru: Затем мы проверяем ряд других условий, при этом обработка в основном ограничивается установкой статуса CCB:

source: Then we check if the error was serious enough to freeze the input queue until it gets proceeded and do so if it is:
ru: Затем мы проверяем, была ли ошибка достаточно серьёзной, чтобы заморозить очередь ввода до её обработки, и если да, то делаем это:

source: This concludes the generic interrupt handling although specific controllers may require some additions.
ru: На этом общее описание обработки прерываний завершается, хотя для некоторых контроллеров могут потребоваться дополнительные действия.

source: Errors Summary
ru: Сводка ошибок

source: When executing an I/O request many things may go wrong. The reason of error can be reported in the CCB status with great detail. Examples of use are spread throughout this document. For completeness here is the summary of recommended responses for the typical error conditions:
ru: При выполнении запроса ввода-вывода может произойти множество ошибок. Причина ошибки может быть указана в статусе CCB с большим количеством деталей. Примеры использования разбросаны по всему документу. Для полноты изложения приведём сводку рекомендуемых действий при типичных ошибках:

source: _CAM_RESRC_UNAVAIL_ - some resource is temporarily unavailable and the SIM driver cannot generate an event when it will become available. An example of this resource would be some intra-controller hardware resource for which the controller does not generate an interrupt when it becomes available.
ru: _CAM_RESRC_UNAVAIL_ — некоторый ресурс временно недоступен, и драйвер SIM не может сгенерировать событие, когда он станет доступен. Примером такого ресурса может быть некоторый внутренний аппаратный ресурс контроллера, для которого контроллер не генерирует прерывание при его доступности.

source: _CAM_UNCOR_PARITY_ - unrecovered parity error occurred
ru: _CAM_UNCOR_PARITY_ - произошла неисправимая ошибка четности

source: _CAM_DATA_RUN_ERR_ - data overrun or unexpected data phase (going in other direction than specified in CAM_DIR_MASK) or odd transfer length for wide transfer
ru: _CAM_DATA_RUN_ERR_ - переполнение данных или неожиданная фаза данных (направление передачи не соответствует указанному в CAM_DIR_MASK) или нечётная длина передачи для широкой передачи

source: _CAM_SEL_TIMEOUT_ - selection timeout occurred (target does not respond)
ru: _CAM_SEL_TIMEOUT_ - произошел таймаут выбора (цель не отвечает)

source: _CAM_CMD_TIMEOUT_ - command timeout occurred (the timeout function ran)
ru: _CAM_CMD_TIMEOUT_ - произошло превышение времени ожидания команды (сработала функция таймаута)

source: _CAM_SCSI_STATUS_ERROR_ - the device returned error
ru: _CAM_SCSI_STATUS_ERROR_ - устройство вернуло ошибку

source: _CAM_AUTOSENSE_FAIL_ - the device returned error and the REQUEST SENSE COMMAND failed
ru: _CAM_AUTOSENSE_FAIL_ - устройство вернуло ошибку и команда REQUEST SENSE завершилась неудачно

source: _CAM_MSG_REJECT_REC_ - MESSAGE REJECT message was received
ru: _CAM_MSG_REJECT_REC_ - получено сообщение MESSAGE REJECT

source: _CAM_SCSI_BUS_RESET_ - received SCSI bus reset
ru: _CAM_SCSI_BUS_RESET_ - получен сброс шины SCSI

source: _CAM_REQ_CMP_ERR_ - "impossible" SCSI phase occurred or something else as weird or just a generic error if further detail is not available
ru: _CAM_REQ_CMP_ERR_ - произошла «невозможная» фаза SCSI или что-то столь же странное, либо это просто общая ошибка, если дополнительная информация недоступна

source: _CAM_UNEXP_BUSFREE_ - unexpected disconnect occurred
ru: _CAM_UNEXP_BUSFREE_ - произошло неожиданное отключение

source: _CAM_BDR_SENT_ - BUS DEVICE RESET message was sent to the target
ru: _CAM_BDR_SENT_ - Сообщение BUS DEVICE RESET было отправлено целевому устройству

source: _CAM_UNREC_HBA_ERROR_ - unrecoverable Host Bus Adapter Error
ru: _CAM_UNREC_HBA_ERROR_ - невосстановимая ошибка адаптера шины хоста

source: _CAM_REQ_TOO_BIG_ - the request was too large for this controller
ru: _CAM_REQ_TOO_BIG_ - запрос слишком велик для данного контроллера

source: _CAM_REQUEUE_REQ_ - this request should be re-queued to preserve transaction ordering. This typically occurs when the SIM recognizes an error that should freeze the queue and must place other queued requests for the target at the sim level back into the XPT queue. Typical cases of such errors are selection timeouts, command timeouts and other like conditions. In such cases the troublesome command returns the status indicating the error, the and the other commands which have not be sent to the bus yet get re-queued.
ru: _CAM_REQUEUE_REQ_ - этот запрос должен быть повторно поставлен в очередь для сохранения порядка транзакций. Обычно это происходит, когда SIM обнаруживает ошибку, которая должна заморозить очередь, и необходимо поместить другие запросы в очереди для цели на уровне SIM обратно в очередь XPT. Типичными случаями таких ошибок являются тайм-ауты выбора, тайм-ауты команд и другие подобные условия. В таких случаях проблемная команда возвращает статус, указывающий на ошибку, а другие команды, которые ещё не были отправлены на шину, повторно ставятся в очередь.

source: _CAM_LUN_INVALID_ - the LUN ID in the request is not supported by the SCSI controller
ru: _CAM_LUN_INVALID_ - идентификатор LUN в запросе не поддерживается контроллером SCSI

source: _CAM_TID_INVALID_ - the target ID in the request is not supported by the SCSI controller
ru: _CAM_TID_INVALID_ - идентификатор целевого устройства в запросе не поддерживается контроллером SCSI

source: Timeout Handling
ru: Обработка таймаутов

source: When the timeout for an HCB expires that request should be aborted, just like with an XPT_ABORT request. The only difference is that the returned status of aborted request should be CAM_CMD_TIMEOUT instead of CAM_REQ_ABORTED (that is why implementation of the abort better be done as a function). But there is one more possible problem: what if the abort request itself will get stuck? In this case the SCSI bus should be reset, just like with an XPT_RESET_BUS request (and the idea about implementing it as a function called from both places applies here too). Also we should reset the whole SCSI bus if a device reset request got stuck. So after all the timeout function would look like:
ru: Когда время ожидания для HCB истекает, этот запрос должен быть прерван, как и в случае с запросом XPT_ABORT. Единственное отличие заключается в том, что возвращаемый статус прерванного запроса должен быть CAM_CMD_TIMEOUT вместо CAM_REQ_ABORTED (вот почему реализацию прерывания лучше сделать в виде функции). Но есть ещё одна возможная проблема: что если сам запрос на прерывание зависнет? В этом случае шина SCSI должна быть сброшена, как и при запросе XPT_RESET_BUS (и идея о реализации этого в виде функции, вызываемой из обоих мест, применима и здесь). Также мы должны сбросить всю шину SCSI, если запрос на сброс устройства завис. В итоге функция обработки таймаута будет выглядеть следующим образом:

source: When we abort a request all the other disconnected requests to the same target/LUN get aborted too. So there appears a question, should we return them with status CAM_REQ_ABORTED or CAM_CMD_TIMEOUT? The current drivers use CAM_CMD_TIMEOUT. This seems logical because if one request got timed out then probably something really bad is happening to the device, so if they would not be disturbed they would time out by themselves.
ru: Когда мы прерываем запрос, все остальные отключенные запросы к тому же целевому устройству/LUN также прерываются. Возникает вопрос: следует ли возвращать их со статусом CAM_REQ_ABORTED или CAM_CMD_TIMEOUT? Текущие драйверы используют CAM_CMD_TIMEOUT. Это кажется логичным, потому что если один запрос превысил время ожидания, то, вероятно, с устройством происходит что-то действительно плохое, и если их не трогать, они бы сами превысили время ожидания.
