Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/arch-handbook/scsi/_index.po
Languages: ru

source: Implementing the CCB abort as a function may be quite a good idea, this function can be re-used if an I/O transaction times out. The only difference would be that the timed out transaction would return the status CAM_CMD_TIMEOUT for the timed out request. Then the case XPT_ABORT would be small, like that:
ru: Реализация прерывания CCB в виде функции может быть довольно хорошей идеей, эта функция может быть повторно использована, если транзакция ввода-вывода превысит время ожидания. Единственное различие будет в том, что для транзакции с истекшим временем ожидания будет возвращён статус CAM_CMD_TIMEOUT. Тогда код в case XPT_ABORT будет небольшим, например:

source: _XPT_SET_TRAN_SETTINGS_ - explicitly set values of SCSI transfer settings
ru: _XPT_SET_TRAN_SETTINGS_ — явно установить значения настроек передачи SCSI

source: The arguments are transferred in the instance "struct ccb_trans_setting cts" of the union ccb:
ru: Аргументы передаются в экземпляре "struct ccb_trans_setting cts" объединения ccb:

source: _valid_ - a bitmask showing which settings should be updated:
ru: _valid_ - битовая маска, показывающая, какие настройки должны быть обновлены:

source: _CCB_TRANS_SYNC_RATE_VALID_ - synchronous transfer rate
ru: _CCB_TRANS_SYNC_RATE_VALID_ - скорость синхронной передачи

source: _CCB_TRANS_SYNC_OFFSET_VALID_ - synchronous offset
ru: _CCB_TRANS_SYNC_OFFSET_VALID_ - синхронное смещение

source: _CCB_TRANS_BUS_WIDTH_VALID_ - bus width
ru: _CCB_TRANS_BUS_WIDTH_VALID_ - ширина шины

source: _CCB_TRANS_DISC_VALID_ - set enable/disable disconnection
ru: _CCB_TRANS_DISC_VALID_ - установить разрешение/запрет отключения

source: _CCB_TRANS_TQ_VALID_ - set enable/disable tagged queuing
ru: _CCB_TRANS_TQ_VALID_ - установить разрешение/запрет очередей с тегами

source: _flags_ - consists of two parts, binary arguments and identification of sub-operations. The binary arguments are:
ru: _flags_ - состоит из двух частей: бинарных аргументов и идентификации подопераций. Бинарные аргументы:

source: _CCB_TRANS_DISC_ENB_ - enable disconnection
ru: _CCB_TRANS_DISC_ENB_ - разрешить отключение

source: _CCB_TRANS_TAG_ENB_ - enable tagged queuing
ru: _CCB_TRANS_TAG_ENB_ - разрешить тегированную очередь

source: the sub-operations are:
ru: подоперации:

source: _CCB_TRANS_CURRENT_SETTINGS_ - change the current negotiations
ru: _CCB_TRANS_CURRENT_SETTINGS_ - изменить текущие параметры согласования

source: _CCB_TRANS_USER_SETTINGS_ - remember the desired user values sync_period, sync_offset - self-explanatory, if sync_offset==0 then the asynchronous mode is requested bus_width - bus width, in bits (not bytes)
ru: _CCB_TRANS_USER_SETTINGS_ - сохранять желаемые пользовательские значения sync_period, sync_offset - самоочевидные параметры; если sync_offset==0, то запрашивается асинхронный режим bus_width - ширина шины в битах (не в байтах)

source: Two sets of negotiated parameters are supported, the user settings and the current settings. The user settings are not really used much in the SIM drivers, this is mostly just a piece of memory where the upper levels can store (and later recall) its ideas about the parameters. Setting the user parameters does not cause re-negotiation of the transfer rates. But when the SCSI controller does a negotiation it must never set the values higher than the user parameters, so it is essentially the top boundary.
ru: Поддерживаются два набора согласованных параметров: пользовательские настройки и текущие настройки. Пользовательские настройки не так часто используются в драйверах SIM, это в основном просто область памяти, где верхние уровни могут сохранять (и позже извлекать) свои представления о параметрах. Установка пользовательских параметров не вызывает повторного согласования скоростей передачи. Однако, когда SCSI-контроллер выполняет согласование, он никогда не должен устанавливать значения выше пользовательских параметров, так что они по сути являются верхней границей.

source: The current settings are, as the name says, current. Changing them means that the parameters must be re-negotiated on the next transfer. Again, these "new current settings" are not supposed to be forced on the device, just they are used as the initial step of negotiations. Also they must be limited by actual capabilities of the SCSI controller: for example, if the SCSI controller has 8-bit bus and the request asks to set 16-bit wide transfers this parameter must be silently truncated to 8-bit transfers before sending it to the device.
ru: Текущие настройки, как следует из названия, являются текущими. Их изменение означает, что параметры должны быть повторно согласованы при следующей передаче. Опять же, эти «новые текущие настройки» не предназначены для принудительного применения к устройству, они лишь используются в качестве начального шага переговоров. Кроме того, они должны быть ограничены реальными возможностями SCSI-контроллера: например, если SCSI-контроллер имеет 8-битную шину, а запрос требует установки 16-битных передач, этот параметр должен быть тихо усечён до 8-битных передач перед отправкой на устройство.

source: One caveat is that the bus width and synchronous parameters are per target while the disconnection and tag enabling parameters are per lun.
ru: Один нюанс заключается в том, что ширина шины и синхронные параметры относятся к цели, тогда как параметры отключения и включения тегов относятся к логическому устройству LUN.

source: The recommended implementation is to keep 3 sets of negotiated (bus width and synchronous transfer) parameters:
ru: Рекомендуемая реализация заключается в хранении 3 наборов согласованных параметров (ширина шины и синхронная передача):

source: _user_ - the user set, as above
ru: _user_ - пользовательский набор, как указано выше

source: _current_ - those actually in effect
ru: _current_ - тот, который фактически действуют

source: _goal_ - those requested by setting of the "current" parameters
ru: _goal_ - тот набор, который запрошен для установки параметров в качестве "текущих"

source: The code looks like:
ru: Код выглядит следующим образом:

source: Then when the next I/O request will be processed it will check if it has to re-negotiate, for example by calling the function target_negotiated(hcb). It can be implemented like this:
ru: Затем, когда следующий запрос ввода-вывода будет обработан, он проверит, нужно ли повторное согласование, например, вызовом функции target_negotiated(hcb). Это может быть реализовано следующим образом:

source: After the values are re-negotiated the resulting values must be assigned to both current and goal parameters, so for future I/O transactions the current and goal parameters would be the same and `target_negotiated()` would return TRUE. When the card is initialized (in `xxx_attach()`) the current negotiation values must be initialized to narrow asynchronous mode, the goal and current values must be initialized to the maximal values supported by controller.
ru: После пересогласования значений полученные значения должны быть присвоены как текущим, так и целевым параметрам, чтобы для будущих операций ввода-вывода текущие и целевые параметры совпадали, и функция `target_negotiated()` возвращала TRUE. При инициализации карты (в `xxx_attach()`) текущие параметры согласования должны быть инициализированы узким асинхронным режимом, а целевые и текущие значения должны быть инициализированы максимальными значениями, поддерживаемыми контроллером.

source: _XPT_GET_TRAN_SETTINGS_ - get values of SCSI transfer settings
ru: _XPT_GET_TRAN_SETTINGS_ — получить значения настроек передачи SCSI

source: This operations is the reverse of XPT_SET_TRAN_SETTINGS. Fill up the CCB instance "struct ccb_trans_setting cts" with data as requested by the flags CCB_TRANS_CURRENT_SETTINGS or CCB_TRANS_USER_SETTINGS (if both are set then the existing drivers return the current settings). Set all the bits in the valid field.
ru: Эта операция является обратной XPT_SET_TRAN_SETTINGS. Заполните экземпляр CCB "struct ccb_trans_setting cts" данными, запрошенными флагами CCB_TRANS_CURRENT_SETTINGS или CCB_TRANS_USER_SETTINGS (если установлены оба, существующие драйверы возвращают текущие настройки). Установите все биты в поле valid.

source: _XPT_CALC_GEOMETRY_ - calculate logical (BIOS) geometry of the disk
ru: _XPT_CALC_GEOMETRY_ — вычислить логическую (BIOS) геометрию диска

source: The arguments are transferred in the instance "struct ccb_calc_geometry ccg" of the union ccb:
ru: Аргументы передаются в экземпляре "struct ccb_calc_geometry ccg" объединения ccb:

source: _block_size_ - input, block (A.K.A sector) size in bytes
ru: _block_size_ - вход, размер блока (также известный как сектор) в байтах

source: _volume_size_ - input, volume size in bytes
ru: _volume_size_ - вход, размер тома в байтах

source: _cylinders_ - output, logical cylinders
ru: _cylinders_ - выход, логические цилиндры

source: _heads_ - output, logical heads
ru: _heads_ - выход, логические головки

source: _secs_per_track_ - output, logical sectors per track
ru: _secs_per_track_ - выход, логических секторов на дорожку

source: If the returned geometry differs much enough from what the SCSI controller BIOS thinks and a disk on this SCSI controller is used as bootable the system may not be able to boot. The typical calculation example taken from the aic7xxx driver is:
ru: Если возвращённая геометрия значительно отличается от той, которую предполагает BIOS SCSI-контроллера, и диск на этом SCSI-контроллере используется как загрузочный, система может не загрузиться. Типичный пример расчёта, взятый из драйвера `aic7xxx`, выглядит следующим образом:

source: This gives the general idea, the exact calculation depends on the quirks of the particular BIOS. If BIOS provides no way set the "extended translation" flag in EEPROM this flag should normally be assumed equal to 1. Other popular geometries are:
ru: Это дает общее представление, точный расчет зависит от особенностей конкретной BIOS. Если BIOS не предоставляет возможности установить флаг "расширенной трансляции" в EEPROM, этот флаг обычно следует считать равным 1. Другие популярные геометрии:

source: Some system BIOSes and SCSI BIOSes fight with each other with variable success, for example a combination of Symbios 875/895 SCSI and Phoenix BIOS can give geometry 128/63 after power up and 255/63 after a hard reset or soft reboot.
ru: Некоторые системные BIOS и SCSI BIOS конфликтуют друг с другом с переменным успехом. Например, комбинация Symbios 875/895 SCSI и Phoenix BIOS может выдавать геометрию 128/63 после включения питания и 255/63 после жесткого сброса или мягкой перезагрузки.

source: _XPT_PATH_INQ_ - path inquiry, in other words get the SIM driver and SCSI controller (also known as HBA - Host Bus Adapter) properties
ru: _XPT_PATH_INQ_ — запрос пути, другими словами, получение свойств драйвера SIM и контроллера SCSI (также известного как HBA - Host Bus Adapter)

source: The properties are returned in the instance "struct ccb_pathinq cpi" of the union ccb:
ru: Свойства возвращаются в экземпляре "struct ccb_pathinq cpi" объединения ccb:

source: version_num - the SIM driver version number, now all drivers use 1
ru: `version_num` - номер версии драйвера SIM, в настоящее время все драйверы используют 1

source: hba_inquiry - bitmask of features supported by the controller:
ru: hba_inquiry - битовая маска функций, поддерживаемых контроллером:

source: PI_MDP_ABLE - supports MDP message (something from SCSI3?)
ru: PI_MDP_ABLE - поддерживает сообщение MDP (что-то из SCSI3?)

source: PI_WIDE_32 - supports 32 bit wide SCSI
ru: PI_WIDE_32 — поддерживает 32-битную широкую SCSI

source: PI_WIDE_16 - supports 16 bit wide SCSI
ru: PI_WIDE_16 — поддерживает 16-битную широкую SCSI

source: PI_SDTR_ABLE - can negotiate synchronous transfer rate
ru: PI_SDTR_ABLE - может согласовать синхронную скорость передачи

source: PI_LINKED_CDB - supports linked commands
ru: PI_LINKED_CDB - поддерживает связанные команды

source: PI_TAG_ABLE - supports tagged commands
ru: PI_TAG_ABLE - поддерживает помеченные команды

source: PI_SOFT_RST - supports soft reset alternative (hard reset and soft reset are mutually exclusive within a SCSI bus)
ru: PI_SOFT_RST — поддерживает альтернативу мягкого сброса (жесткий сброс и мягкий сброс являются взаимоисключающими в пределах шины SCSI)

source: target_sprt - flags for target mode support, 0 if unsupported
ru: target_sprt - флаги поддержки целевого режима, 0 если не поддерживается

source: hba_misc - miscellaneous controller features:
ru: hba_misc - различные функции контроллера:

source: PIM_SCANHILO - bus scans from high ID to low ID
ru: PIM_SCANHILO - сканирование шины от высокого ID к низкому ID

source: PIM_NOREMOVE - removable devices not included in scan
ru: PIM_NOREMOVE - съемные устройства не включены в сканирование

source: PIM_NOINITIATOR - initiator role not supported
ru: PIM_NOINITIATOR - роль инициатора не поддерживается

source: PIM_NOBUSRESET - user has disabled initial BUS RESET
ru: PIM_NOBUSRESET - пользователь отключил начальный BUS RESET

source: hba_eng_cnt - mysterious HBA engine count, something related to compression, now is always set to 0
ru: hba_eng_cnt - загадочное количество движков HBA, что-то связанное со сжатием, в настоящее время всегда устанавливается в 0

source: vuhba_flags - vendor-unique flags, unused now
ru: vuhba_flags - уникальные флаги производителя, в настоящее время не используются

source: max_target - maximal supported target ID (7 for 8-bit bus, 15 for 16-bit bus, 127 for Fibre Channel)
ru: max_target - максимальный поддерживаемый идентификатор целевого устройства (7 для 8-битной шины, 15 для 16-битной шины, 127 для Fibre Channel)

source: max_lun - maximal supported LUN ID (7 for older SCSI controllers, 63 for newer ones)
ru: max_lun - максимально поддерживаемый идентификатор LUN (7 для старых SCSI-контроллеров, 63 для новых)

source: async_flags - bitmask of installed Async handler, unused now
ru: async_flags - битовая маска установленных обработчиков Async, в настоящее время не используется

source: hpath_id - highest Path ID in the subsystem, unused now
ru: hpath_id - наивысший Path ID в подсистеме, в настоящее время не используется

source: unit_number - the controller unit number, cam_sim_unit(sim)
ru: unit_number - номер контроллера, cam_sim_unit(sim)

source: bus_id - the bus number, cam_sim_bus(sim)
ru: bus_id - номер шины, cam_sim_bus(sim)

source: initiator_id - the SCSI ID of the controller itself
ru: initiator_id - SCSI ID самого контроллера

source: base_transfer_speed - nominal transfer speed in KB/s for asynchronous narrow transfers, equals to 3300 for SCSI
ru: base_transfer_speed - номинальная скорость передачи в КБ/с для асинхронных узкополосных передач, равна 3300 для SCSI

source: sim_vid - SIM driver's vendor id, a zero-terminated string of maximal length SIM_IDLEN including the terminating zero
ru: sim_vid - идентификатор производителя драйвера SIM, строка с нулевым окончанием максимальной длины SIM_IDLEN, включая завершающий ноль

source: hba_vid - SCSI controller's vendor id, a zero-terminated string of maximal length HBA_IDLEN including the terminating zero
ru: hba_vid - идентификатор производителя SCSI-контроллера, строка с нулевым окончанием максимальной длины HBA_IDLEN, включая завершающий ноль

source: dev_name - device driver name, a zero-terminated string of maximal length DEV_IDLEN including the terminating zero, equal to cam_sim_name(sim)
ru: dev_name - имя драйвера устройства, строка с нулевым окончанием максимальной длины DEV_IDLEN, включая завершающий ноль, эквивалентно cam_sim_name(sim)

source: The recommended way of setting the string fields is using strncpy, like:
ru: Рекомендуемый способ установки строковых полей — использование strncpy, например:

source: After setting the values set the status to CAM_REQ_CMP and mark the CCB as done.
ru: После установки значений установите статус в CAM_REQ_CMP и пометьте CCB как завершённый.

source: Polling xxx_poll
ru: Опрос xxx_poll

source: The poll function is used to simulate the interrupts when the interrupt subsystem is not functioning (for example, when the system has crashed and is creating the system dump). The CAM subsystem sets the proper interrupt level before calling the poll routine. So all it needs to do is to call the interrupt routine (or the other way around, the poll routine may be doing the real action and the interrupt routine would just call the poll routine). Why bother about a separate function then? This has to do with different calling conventions. The `xxx_poll` routine gets the struct cam_sim pointer as its argument while the PCI interrupt routine by common convention gets pointer to the struct `xxx_softc` and the ISA interrupt routine gets just the device unit number. So the poll routine would normally look as:
ru: Функция poll используется для имитации прерываний, когда подсистема прерываний не функционирует (например, когда система аварийно завершила работу и создает дамп памяти). Подсистема CAM устанавливает соответствующий уровень прерывания перед вызовом процедуры poll. Таким образом, все, что ей нужно сделать, — это вызвать процедуру прерывания (или наоборот, процедура poll может выполнять реальные действия, а процедура прерывания просто вызывает процедуру poll). Зачем тогда нужна отдельная функция? Это связано с различными соглашениями о вызовах. Процедура `xxx_poll` получает указатель на структуру cam_sim в качестве аргумента, в то время как процедура прерывания PCI по общему соглашению получает указатель на структуру `xxx_softc`, а процедура прерывания ISA получает только номер устройства. Таким образом, процедура poll обычно выглядит следующим образом:

source: or
ru: или

source: Asynchronous Events
ru: Асинхронные события

source: If an asynchronous event callback has been set up then the callback function should be defined.
ru: Если была настроена асинхронная callback-функция для события, то callback-функция должна быть определена.

source: callback_arg - the value supplied when registering the callback
ru: callback_arg - значение, переданное при регистрации callback

source: code - identifies the type of event
ru: code - определяет тип события

source: path - identifies the devices to which the event applies
ru: path - определяет устройства, к которым применяется событие

source: arg - event-specific argument
ru: arg - аргумент, специфичный для события

source: Implementation for a single type of event, AC_LOST_DEVICE, looks like:
ru: Реализация для одного типа события, AC_LOST_DEVICE, выглядит следующим образом:

source: Interrupts
ru: Прерывания

source: The exact type of the interrupt routine depends on the type of the peripheral bus (PCI, ISA and so on) to which the SCSI controller is connected.
ru: Точный тип процедуры прерывания зависит от типа периферийной шины (PCI, ISA и так далее), к которой подключен SCSI-контроллер.

source: The interrupt routines of the SIM drivers run at the interrupt level splcam. So `splcam()` should be used in the driver to synchronize activity between the interrupt routine and the rest of the driver (for a multiprocessor-aware driver things get yet more interesting but we ignore this case here). The pseudo-code in this document happily ignores the problems of synchronization. The real code must not ignore them. A simple-minded approach is to set `splcam()` on the entry to the other routines and reset it on return thus protecting them by one big critical section. To make sure that the interrupt level will be always restored a wrapper function can be defined, like:
ru: Прерывания в драйверах SIM выполняются на уровне прерывания splcam. Поэтому в драйвере следует использовать `splcam()` для синхронизации между обработчиком прерывания и остальной частью драйвера (для драйверов, учитывающих многопроцессорность, ситуация становится ещё сложнее, но здесь мы этот случай не рассматриваем). Псевдокод в этом документе беззаботно игнорирует проблемы синхронизации. Реальный код так делать не должен. Простейший подход — установить `splcam()` при входе в другие функции и сбросить при выходе, защищая их одной большой критической секцией. Чтобы гарантировать восстановление уровня прерывания, можно определить обёрточную функцию, например:

source: This approach is simple and robust but the problem with it is that interrupts may get blocked for a relatively long time and this would negatively affect the system's performance. On the other hand the functions of the `spl()` family have rather high overhead, so vast amount of tiny critical sections may not be good either.
ru: Этот подход прост и надежен, но проблема в том, что прерывания могут блокироваться на относительно долгое время, что негативно скажется на производительности системы. С другой стороны, функции семейства `spl()` имеют довольно высокие накладные расходы, поэтому большое количество мелких критических секций также может быть нежелательным.

source: The conditions handled by the interrupt routine and the details depend very much on the hardware. We consider the set of "typical" conditions.
ru: Условия, обрабатываемые процедурой прерывания, и детали сильно зависят от оборудования. Мы рассматриваем набор "типичных" условий.

source: First, we check if a SCSI reset was encountered on the bus (probably caused by another SCSI controller on the same SCSI bus). If so we drop all the enqueued and disconnected requests, report the events and re-initialize our SCSI controller. It is important that during this initialization the controller will not issue another reset or else two controllers on the same SCSI bus could ping-pong resets forever. The case of fatal controller error/hang could be handled in the same place, but it will probably need also sending RESET signal to the SCSI bus to reset the status of the connections with the SCSI devices.
ru: Сначала проверяем, было ли на шине событие SCSI сброса (вероятно, вызванное другим SCSI-контроллером на той же SCSI-шине). Если это так, мы отменяем все поставленные в очередь и отключенные запросы, сообщаем о событиях и повторно инициализируем наш SCSI-контроллер. Важно, чтобы во время этой инициализации контроллер не инициировал ещё один сброс, иначе два контроллера на одной SCSI-шине могут бесконечно обмениваться сбросами. Случай фатальной ошибки/зависания контроллера может быть обработан в том же месте, но, вероятно, также потребуется отправка сигнала RESET на SCSI-шину для сброса состояния соединений с SCSI-устройствами.

source: If interrupt is not caused by a controller-wide condition then probably something has happened to the current hardware control block. Depending on the hardware there may be other non-HCB-related events, we just do not consider them here. Then we analyze what happened to this HCB:
ru: Если прерывание не вызвано условием, общим для всего контроллера, то, вероятно, что-то произошло с текущим блоком управления аппаратным обеспечением. В зависимости от оборудования могут быть и другие события, не связанные с HCB, но мы их здесь не рассматриваем. Затем мы анализируем, что произошло с этим HCB:

source: First we check if the HCB has completed and if so we check the returned SCSI status.
ru: Сначала мы проверяем, завершился ли HCB, и если да, то проверяем возвращённый статус SCSI.

source: Then look if this status is related to the REQUEST SENSE command and if so handle it in a simple way.
ru: Затем проверьте, связан ли этот статус с командой REQUEST SENSE, и если да, обработайте его простым способом.
