Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/ipsec-must/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@mailbox.org, 2019
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Mauro Risonho de Paula Assumpção, mauro.risonho@gmail.com, 2018

source: Independent Verification of IPsec Functionality in FreeBSD
es_es: Verificación independiente de la funcionalidad de IPsec en FreeBSD
pt_br: Verificação Independente da Funcionalidade IPsec no FreeBSD

source: You installed IPsec and it seems to be working. How do you know? I describe a method for experimentally verifying that IPsec is working.
es_es: Instaló IPsec y parece estar funcionando. ¿Cómo lo sabe? Describo un método para verificar de forma experimental que IPsec está funcionando.
pt_br: Você instalou o IPsec e ele parece estar funcionando. Como você sabe? Eu descrevo um método para verificar experimentalmente se o IPsec está funcionando.

source: The Problem
es_es: El problema
pt_br: O problema

source: First, lets assume you have <link linkend="ipsec-install"> installed <emphasis>IPsec</emphasis></link>. How do you know it is <link linkend="caveat">working</link>? Sure, your connection will not work if it is misconfigured, and it will work when you finally get it right. <citerefentry><refentrytitle>netstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> will list it. But can you independently confirm it?
es_es: Primero, asumamos que ha <link linkend="ipsec-install">instalado <emphasis>IPsec</emphasis></link>. ¿Cómo sabe que está <link linkend="caveat">funcionando</link>? Claro, su conexión no funcionará si está mal configurada, y funcionará cuando finalmente lo haga bien. <citerefentry><refentrytitle>netstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> la listará. ¿Pero puede confirmarlo de forma independiente?
pt_br: Primeiro, vamos assumir que você tem o <link linkend="ipsec-install"><emphasis>IPsec</emphasis> instalado </link>. Como você sabe que ele está <link linkend="caveat">funcionando</link>? Claro, sua conexão não funcionará se ele estiver mal configurado, e funcionará quando você finalmente acertar a configuração. O <citerefentry> <refentrytitle>netstat</refentrytitle><manvolnum>1</manvolnum></citerefentry>irá listá-lo. Mas você pode confirmar isso de forma independente?

source: The Solution
es_es: La solución
pt_br: A solução

source: First, some crypto-relevant info theory:
es_es: Primero, alguna información teórica relevante sobre criptografía:
pt_br: Em primeiro lugar, vejamos alguma informação teórica relevante em relação à criptografia:

source: Encrypted data is uniformly distributed, i.e., has maximal entropy per symbol;
es_es: Los datos cifrados se distribuyen uniformemente, es decir, tienen una entropía máxima por símbolo;
pt_br: Dados criptografados são uniformemente distribuídos, ou seja, possuem entropia máxima por símbolo;

source: Raw, uncompressed data is typically redundant, i.e., has sub-maximal entropy.
es_es: Los datos sin procesar y sin comprimir suelen ser redundantes, es decir, tienen una entropía submáxima.
pt_br: Os dados brutos, não comprimidos são tipicamente redundantes, isto é, possuem entropia submáxima.

source: Suppose you could measure the entropy of the data to- and from- your network interface. Then you could see the difference between unencrypted data and encrypted data. This would be true even if some of the data in <quote>encrypted mode</quote> was not encrypted---as the outermost IP header must be if the packet is to be routable.
es_es: Suponga que usted pudiera medir la entropía de los datos que van hacia -y desde- su interfaz de red. Entonces podría ver la diferencia entre los datos no cifrados y los cifrados. Esto sería verdad incluso si algunos de los datos en <quote>modo cifrado</quote> no lo estuvieran---ya que el encabezado IP más externo debe estarlo para que el paquete sea enrutable.
pt_br: Suponha que você possa medir a entropia dos dados destinados para a sua interface de rede e também dos dados originados dela. Então você pode ver a diferença entre dados não criptografados e dados criptografados. Isso seria verdade mesmo que alguns dos dados no <quote>modo criptografado</quote> não estivessem criptografados --- como deve o cabeçalho IP mais externo para que o pacote seja roteável.

source: Ueli Maurer's <quote>Universal Statistical Test for Random Bit Generators</quote>(<link xlink:href="https://web.archive.org/web/20011115002319/http://www.geocities.com/SiliconValley/Code/4704/universal.pdf"> <acronym>MUST</acronym></link>) quickly measures the entropy of a sample. It uses a compression-like algorithm. <link linkend="code">The code is given below</link> for a variant which measures successive (~quarter megabyte) chunks of a file.
es_es: El <quote>Universal Statistical Test for Random Bit Generators</quote> (<link xlink:href="https://web.archive.org/web/20011115002319/http://www.geocities.com/SiliconValley/Code/4704/universal.pdf"><acronym>MUST</acronym></link>) de Ueli Maurer mide rápidamente la entropía de una muestra. Utiliza un algoritmo de compresión. <link linkend="code">El código se proporciona a continuación</link> para una variante que mide partes sucesivas (~cuarto de megabyte) de un archivo
pt_br: O teste de <quote>Estatística Universal para Geradores de Bits Aleatórios</quote> de Ueli Maurer (<link xlink:href="https://web.archive.org/web/20011115002319/http://www.geocities.com/SiliconValley/Code/4704/universal.pdf"><acronym>MUST</acronym> </link>) mede rapidamente a entropia de uma amostra. Ele usa um algoritmo semelhante à compressão. <link linkend="code"> O código é dado abaixo</link> para uma variante que mede partes sucessivas (aproximadamente um quarto de megabyte) de um arquivo.

source: We also need a way to capture the raw network data. A program called <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry> lets you do this, if you have enabled the <emphasis>Berkeley Packet Filter</emphasis> interface in your <link linkend="kernel">kernel's config file</link>.
es_es: También necesitamos una forma de capturar los datos de red sin procesar. Un programa llamado <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry> le permite hacerlo, si tiene habilitada la interfaz de <emphasis>Berkeley Packet Filter</emphasis> en el <link linkend="kernel">archivo de configuración de su kernel</link>.
pt_br: Também precisamos de uma maneira de capturar os dados brutos da rede. Um programa chamado <citerefentry><refentrytitle>tcpdump</refentrytitle> <manvolnum>1</manvolnum></citerefentry> permite que você faça isso, se você ativou a interface <emphasis>Berkeley Packet Filter</emphasis> no seu <link linkend="kernel">arquivo de configuração do kernel</link>.

source: The command:
es_es: El comando:
pt_br: O comando:

source: will capture 4000 raw packets to <replaceable>dumpfile.bin</replaceable>. Up to 10,000 bytes per packet will be captured in this example.
es_es: capturará 4000 paquetes sin procesar en el fichero <replaceable>dumpfile.bin</replaceable>. En este ejemplo se capturarán hasta 10.000 bytes por paquete.
pt_br: irá capturar 4000 pacotes brutos no arquivo <replaceable>dumpfile.bin</replaceable>. Até 10.000 bytes por pacote serão capturados neste exemplo.

source: The Experiment
es_es: El experimento
pt_br: O Experimento

source: Here is the experiment:
es_es: Aquí está el experimento:
pt_br: Aqui está o experimento:

source: Open a window to an IPsec host and another window to an insecure host.
es_es: Abra una ventana a un host IPsec y otra ventana a un host inseguro.
pt_br: Abra uma janela para um host IPsec e outra janela para um host inseguro.

source: Now start <link linkend="tcpdump">capturing packets</link>.
es_es: Ahora empiece a <link linkend="tcpdump">capturar paquetes</link>.
pt_br: Agora comece a <link linkend="tcpdump">capturar os pacotes</link>.

source: In the <quote>secure</quote> window, run the <trademark class="registered">UNIX</trademark> command <citerefentry><refentrytitle>yes</refentrytitle><manvolnum>1</manvolnum></citerefentry>, which will stream the <literal>y</literal> character. After a while, stop this. Switch to the insecure window, and repeat. After a while, stop.
es_es: En la ventana <quote>segura</quote>, ejecute el comando <trademark class="registered">UNIX</trademark> <citerefentry><refentrytitle>yes</refentrytitle><manvolnum>1</manvolnum></citerefentry>, que transmitirá el carácter <literal>y</literal>. Después de un rato, detenga el comando. Cambie a la ventana insegura, y repita. Espere un poco, detenga el comando.
pt_br: Na janela <quote>segura</quote>, execute o comando <trademark class="registered">UNIX</trademark> <citerefentry><refentrytitle>yes</refentrytitle><manvolnum>1</manvolnum></citerefentry>, que transmitirá o caractere <literal>y</literal>. Depois de um tempo, pare com isso. Alterne para a janela insegura e repita. Depois de um tempo, pare.

source: Now run <link linkend="code">MUST</link> on the captured packets. You should see something like the following. The important thing to note is that the secure connection has 93% (6.7) of the expected value (7.18), and the <quote>normal</quote> connection has 29% (2.1) of the expected value.
es_es: Ahora ejecute <link linkend="code">MUST</link> en los paquetes capturados. Debería ver algo como lo siguiente. Lo importante a tener en cuenta es que la conexión segura tiene un 93% (6,7) del valor esperado (7,18), y la conexión <quote>normal</quote> tiene un 29% (2,1) del valor esperado.
pt_br: Agora execute o <link linkend="code">MUST</link> nos pacotes capturados. Você deve ver algo como o seguinte. O importante é notar que a conexão segura tem 93% (6,7) do valor esperado (7,18), e a conexão <quote>normal</quote> tem 29% (2,1) do valor esperado.

source: Caveat
es_es: Advertencia
pt_br: Embargo

source: This experiment shows that IPsec <emphasis>does</emphasis> seem to be distributing the payload data <emphasis>uniformly</emphasis>, as encryption should. However, the experiment described here <emphasis>cannot</emphasis> detect many possible flaws in a system (none of which do I have any evidence for). These include poor key generation or exchange, data or keys being visible to others, use of weak algorithms, kernel subversion, etc. Study the source; know the code.
es_es: Este experimento muestra que IPsec <emphasis>parece</emphasis> estar distribuyendo los datos de la carga útil <emphasis>uniformemente</emphasis>, como debe hacerlo el cifrado. Sin embargo, el experimento aquí descrito <emphasis>puede no</emphasis> detectar muchas de las posibles fallas del sistema (para las cuales no tengo evidencias). Esto incluye la generación o intercambio de claves deficientes, datos o claves visibles para otros, uso de algoritmos débiles, subversión del kernel, etc. Estudie el código; conozca el código.
pt_br: Esta experiência mostra que o IPsec <emphasis>parece</emphasis> estar distribuindo os dados de carga <emphasis>uniformemente</emphasis>, como a criptografia deveria. No entanto, o experimento descrito aqui <emphasis>não pode</emphasis> detectar muitas das falhas possíveis em um sistema (nenhum dos quais eu tenho qualquer evidência para). Estes incluem geração ou troca deficiente de chaves, dados ou chaves sendo visíveis para outros, uso de algoritmos fracos, subversão do kernel, etc. Estude a fonte; conheça o código.

source: IPsec---Definition
es_es: IPsec---Definición
pt_br: IPsec --- Definição

source: Internet Protocol security extensions to IPv4; required for IPv6. A protocol for negotiating encryption and authentication at the IP (host-to-host) level. SSL secures only one application socket; <application>SSH</application> secures only a login; <application>PGP</application> secures only a specified file or message. IPsec encrypts everything between two hosts.
es_es: Extensiones de seguridad del Protocolo de Internet para IPv4; requerido para IPv6. Un protocolo para negociar el cifrado y la autenticación a nivel de IP (host a host). SSL solo protege un socket de aplicación. <application>SSH</application> protege solo el login. <application>PGP</application> protege un archivo o mensaje específico. IPsec encripta todo entre dos hosts.
pt_br: Extensões de segurança do protocolo Internet para o IPv4; obrigatório para o IPv6. Um protocolo para negociar criptografia e autenticação no nível IP (host para host). O SSL protege apenas um soquete de aplicativo; O <application>SSH</application> protege apenas um login;<application>PGP</application> protege apenas um arquivo ou mensagem especifico. O IPsec criptografa tudo entre dois hosts.

source: Installing IPsec
es_es: Instalando IPsec
pt_br: Instalando o IPsec

source: Most of the modern versions of FreeBSD have IPsec support in their base source. So you will need to include the <option>IPSEC</option> option in your kernel config and, after kernel rebuild and reinstall, configure IPsec connections using <citerefentry><refentrytitle>setkey</refentrytitle><manvolnum>8</manvolnum></citerefentry> command.
es_es: La mayoría de las versiones modernas de FreeBSD soportan IPsec en su código base. Por lo tanto, deberá incluir la opción <option>IPSEC</option> en la configuración de su kernel y, después de recompilar y reinstalar el kernel, configure las conexiones de IPsec usando el comando <citerefentry><refentrytitle>setkey</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: A maioria das versões modernas do FreeBSD tem suporte a IPsec em sua fonte base. Portanto, você precisará incluir a opção <option>IPSEC</option> em sua configuração de kernel e, após a reconstrução e reinstalação do kernel, configurar as conexões IPsec usando o comando <citerefentry><refentrytitle>setkey</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: A comprehensive guide on running IPsec on FreeBSD is provided in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ipsec.html">FreeBSD Handbook</link>.
es_es: En el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/ipsec.html">Manual de FreeBSD</link> se proporciona una guía completa sobre cómo ejecutar IPsec en FreeBSD.
pt_br: Um guia completo sobre como executar o IPsec no FreeBSD é fornecido no <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ipsec.html">Handbook do FreeBSD</link>.

source: This needs to be present in the kernel config file in order to capture network data with <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Be sure to run <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> after adding this, and rebuild and reinstall.
es_es: Esto debe estar presente en el archivo de configuración del kernel para capturar datos de red con <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Asegúrese de ejecutar <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> después de agregar esto, recompilar y reinstalar.
pt_br: Isto precisa estar presente no arquivo de configuração do kernel para habilitar o suporte para captura de dados de rede com o <citerefentry><refentrytitle>tcpdump</refentrytitle> <manvolnum>1</manvolnum></citerefentry>. Certifique-se de executar o <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum> </citerefentry> depois de adicionar a linha, de recompilar e de reinstalar.

source: Maurer's Universal Statistical Test (for block size=8 bits)
es_es: Maurer's Universal Statistical Test (tamaño de bloque=8 bits)
pt_br: Teste Estatístico Universal de Maurer (para tamanho de bloco = 8 bits)

source: You can find the same code at <link xlink:href="https://web.archive.org/web/20031204230654/http://www.geocities.com:80/SiliconValley/Code/4704/uliscanc.txt"> this link</link>.
es_es: Puede encontrar el mismo código fuente en <link xlink:href="https://web.archive.org/web/20031204230654/http://www.geocities.com:80/SiliconValley/Code/4704/uliscanc.txt">este enlace</link>.
pt_br: Você pode encontrar o mesmo código em <link xlink:href="https://web.archive.org/web/20031204230654/http://www.geocities.com:80/SiliconValley/Code/4704/uliscanc.txt">neste link</link>.
