freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/aic.4
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: aic.4,v 1.4 1997/02/22 13:25:10 peter Exp %
.\" $FreeBSD$
.\"
.Dd November 29, 1994
.Dt AIC 4 i386
.Os
.Sh 名称
.Nm aic
.Nd Adaptec の AIC-6260 と AIC-6360 の SCSI ドライバ
.Sh 書式
.Cd "device aic0 at isa? port 0x340 bio irq 11"
.Sh 解説
.Nm aic
ドライバは Adaptec の AIC-6260 と AIC-6360 の SCSI
コントローラチップのサポートを提供します。
これは、Adaptec 152x と Creative
Labs SoundBlaster SCSI ホストアダプタを含みます。
.Pp
これらのコントローラチップを用いた多くのシステムは
ブート ROM を持っていません。したがって、ここからブートはできません。
.Sh 関連項目
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr sd 4 ,
.Xr st 4


