freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/ar.4
.\"
.\" Copyright (c) 1995 John Hay.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by John Hay.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY John Hay ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL John Hay BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %Id: ar.4,v 1.9 1998/10/22 14:12:55 bde Exp %
.\" $FreeBSD$
.\"
.\" WORD: link level layer  リンクレベルの層
.\"
.Dd November 19, 1995
.Dt AR 4 i386
.Os
.Sh 名称
.Nm ar
.Nd
同期 Arnet デバイスドライバ
.Sh 書式
.Cd "device ar0 at isa? port 0x300 net irq 10 iomem 0xd0000"
.Cd "device ar1 at isa? port 0x310 net irq 11 iomem 0xd0000"
.Pp
.Cd "pseudo-device sppp"
.Sh 解説
.Nm ar
ドライバは HD64570 チップを使用した Arnet SYNC/570i ISA カードを
サポートします。
2 ポートと 4 ポートの両方のカードをサポートし、自動検出します。
.Pp
回線速度は最大で 2Mbps まで得られます。この速度では 486DX プロセッサで
帯域の約 85 % を使用することができます。
.Pp
リンクレベルの層に、標準の
.\" link level layer は OSI モデルでは data link layer に相当するもの
.\" もしくは data link layer の一部に相当するものと思いますが、原文を
.\" 尊重して「リンクレベルの層」としたい
.Tn FreeBSD
sppp コードを使用します。
デフォルトのプロトコルは PPP です。
Cisco HDLC プロトコルは
.Xr ifconfig 8
に
.Ar link2
を追加することによって使用できます。
.Sh 番号
カーネル設定ファイルでは、カード毎に 1 行のみが必要です。
最初のカードのポートは、ar0 から導入されます。
次のカードの番号は、最初のカードで止まった所から続けます。
つまり、もし最初のカードが 2 ポートのカードなら、そのカードは ar0 と ar1
を使います。そして次のカードは、ar2 から始めます。
.Pp
カードは IRQ 3, 5, 7, 10, 11, 12, 15 のみをサポートします。
.Pp
iomem 領域は、16Kb ブロックであり、16Kb 境界から始まる必要があります。
.Pp
.Sh 診断
.Bl -diag
.It "ar%d: Warning illegal interrupt %d."
カードが指定された割り込みを使用できません。他の割り込みを選んでください。
.El
.Sh 関連ファイル
.Bl -tag -width /sys/i386/isa/ic/hd64570.h -compact
.It Pa /sys/i386/isa/ic/hd64570.h
.It Pa /sys/i386/isa/if_arregs.h
.It Pa /sys/i386/isa/if_ar.c
.El
.Sh バグ
現時点で V.35 と X.21 インタフェースだけを試験しています。
他のものではクロック部分のコードを微調整する必要があるでしょう。
.Pp
このコードには、おそらく最適化の余地があります。
.Pp
このコードは、まだできたばかりですから非常に多くのバグがあるでしょう。
バグは jhay@mikom.csir.co.za へ報告してください。
.Sh 関連項目
.Xr cx 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr lsdev 8
.Sh 作者
.Nm ar
デバイスドライバは
.An John Hay Aq jhay@mikom.csir.co.za
が作成しました。
