freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/cs.4
.\"
.\" Copyright (c) 1998 Michael Smith
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: cs.4,v 1.2 1998/10/22 14:12:55 bde Exp %
.\" $FreeBSD$
.\"
.Dd July 20, 1998
.Dt CS 4 i386
.Os FreeBSD
.Sh 名称
.Nm cs
.Nd イーサネットデバイスドライバ
.Sh 書式
.Cd "device cs0 at isa? port 0x300 net irq ?"
.Cd "device cs1 at isa? port 0x300 net irq 10 iomem 0xd0000"
.Sh 解説
.Nm
ドライバは
.Nm Crystal Semiconductor CS8900 と CS8920
NIC をベースにした ISA イーサネットアダプタをサポートします。
これらのデバイスは CS89x0 ファミリの欠点を補うだけの
高い完成度と小型化および低価格化を実現した、
.Nm IBM EtherJet ISA 
アダプタおよび同デバイスを組み込んだ多くの製品において使われています。
.Pp
.Nm
ドライバは設定パラメータを、設定エントリまたはカードのどちらからでも
取得できます。設定エントリで指定されたパラメータがもし存在すれば
そちらを使用しますが、カードはソフトウェアで設定できるので、
これらの設定は適正な値になっていると思われます。
CS8920 ベースのアダプタは、通常 PnP 設定を提供するので、ドライバは
.Nm IBM EtherJet 
と
.Nm CSC6040 
を自動的に検出します。
.Pp
CS8900 は 4 つの IRQ 値に限定されていることに注意してください。これらの値は
通常 5, 10, 11, 12 となっています。CS8920 にはそのような制限はありません。
.Pp
メモリマップと DMA 動作は現時点ではサポートされていません。
.Sh 診断
.Bl -diag
.It "cs%d: full/half duplex negotiation timeout"
ハブとの全二重設定ネゴシエート試行がタイムアウトを起こしました。
このことはケーブル接続に問題があるか、欠陥か、互換性のないハブであることを
示しています。
.It "cs%d: failed to enable <media>"
CS89x0 は指示されたメディアの選択に失敗しました。そのメディアが存在しないか、
操作が正しくありません。
.It "cs%d: No EEPROM, assuming defaults"
CS89x0 に EEPROM がないか、絶望的に損傷しています。設定エントリがアダプタの
値に適した値になっていた場合にしか操作できません。
.It "cs%d: Invalid irq"
設定エントリで指定された IRQ がアダプタにあっていません。
.It "cs%d: Could not allocate memory for NIC"
致命的なメモリ不足です。アダプタは動きません。
.It "cs%d: Adapter has no media"
アダプタは特定のメディアタイプに設定されていません。
メディアタイプは手動でセットする必要があります。
.It "This is a %s, but LDN %d is disabled"
PnP 探査コードは処理可能なアダプタを検出しましたが、
アダプタは無効化されています。
.It "failed to read pnp parms"
PnP アダプタが検出されましたが、そのアダプタ用の設定パラメータが読めません。
.It "failed to pnp card parametars"
PnP 経由で得たパラメータをドライバは受けとれませんでした。アダプタはたぶん
動かないでしょう。
.Sh 警告
CS89x0 ファミリのアダプタは、とても小さな RAM バッファ (4K) しか
持っていません。このことは極端に高いネットワーク負荷や
爆発的なネットワークトラフィック下では問題を起こすかもしれません。
実際、NFS 操作はオーバランを防ぐために、 1k の読み書き処理に
制限するべきです。
.Sh 作者
.Nm
デバイスドライバは
.An Maxim Bolotin 
と
.An Oleg Sharoiko
が書きました。
このマニュアルページは
.An Michael Smith
が書きました。
