freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/ep.4
.\"
.\" Copyright (c) 1994 Herb Peyerl
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Herb Peyerl
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: ep.4,v 1.9 1998/10/22 14:12:55 bde Exp %
.\" $FreeBSD$
.\"
.Dd February 04, 1993
.Dt EP 4 i386
.Os
.Sh 名称
.Nm ep
.Nd
3Com Etherlink III イーサネットデバイスドライバ (3c5x9)
.Sh 書式
.Cd "device ep0 at isa? port 0x300 net irq 10"
.Sh 解説
.Nm ep
ドライバは 3c509 (ISA) と 3c579 (EISA) のサポートを提供します。
これらのカードのさまざまなモデルは、コネクタの配列がそれぞれ異なります。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It AUI/DIX
標準 15 ピンコネクタ
.It 10Base2
BNC (シンケーブルとしても知られているもの)
.It 10BaseT
UTP (ツイストペアとしても知られているもの)
.El
.Pp
デフォルトで使用されるポートは、
セットアップユーティリティで選択されているポートです。
これをオーバライドするには、
.Xr ifconfig 8
または
.Pa /etc/rc.conf
ファイルで次のフラグを使用します。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It link0
AUI ポートを使用
.It link1
BNC ポートを使用
.It link2
UTP ポートを使用
.El
.Pp
コンピュータに複数のカードを装着している場合は、次の順番で探されます。
最初に 3c579 EISA カードが探されます --
これらは EISA スロット番号順に検出されます。
次に、3c509 ISA カードが探されます --
イーサネットアドレスの昇順に検出されます。
次に、どのようにプローブされるかの例を示します。
.Pp
ep0 at isa0 port 0x6000-0x600f irq 10: aui/bnc address 00:60:8c:70:e5:c5
ep1 at isa0 port 0x300-0x30f irq 3: aui/bnc/utp address 00:20:af:10:62:ab
.Pp
カードが発見されることが期待されるポートと IRQ を指定することもできますが、
この指定は必ずしも必要ではありません。
カードは ISA バス上での自分の居場所を我々に伝えるに
十分なインテリジェンスを備えているのです。
.Pp
.Sh 注釈
3c509 カードにはアドレスを設定するジャンパがありません。
3Com はカードのアドレスを設定するソフトウェアを提供しています。
ISA バス上でこのカードを見つけるために、
カーネルは IO アドレス 0x110 で複雑なスキャン操作を行います。
注意してください! このアドレスに他のカードを配置することは避けてください。
.Pp
.Sh 診断
ep0: reset (status: %x)
.in +4
ドライバは FIFO のアンダランまたはオーバランを検出しました。ドライバが
カードをリセットし、パケットが失われます。これは致命的ではありません。
.in -4
ep0: eeprom failed to come ready
.in +4
EEPROM の準備ができていません。おそらくカードが死んでいます。
.in -4
ep0: 3c509 in test mode. Erase pencil mark!
.in +4
誰かがカードの上のテスト領域に鉛筆で落書きをしているかもしれません。鉛筆書き
の跡を消してリブートしてください (これはジョークではありません)。
.in -4
.Sh 関連項目
.Xr ed 4 ,
.Xr eg 4 ,
.Xr el 4 ,
.Xr ie 4 ,
.Xr intro 4 ,
.Xr le 4 ,
.Xr vx 4 ,
.Xr ifconfig 8
.Sh 規格
は偉大なり。豊富な選択肢があります。

