freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/ex.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: ex.4,v 1.6 1998/10/22 14:32:20 bde Exp %
.\" $FreeBSD$
.\"
.\" WORD: Plug-N-Play プラグアンドプレイ
.\"
.Dd January 19, 1997
.Dt EX 4 i386
.Os FreeBSD
.Sh 名称
.Nm ex
.Nd
Intel EtherExpress Pro/10 と Pro/10+ イーサネットデバイスドライバ
.Sh 書式
.Cd "device ex0 at isa? port? net irq ?"
.Sh 解説
.Nm
ドライバは Intel i82595 チップを搭載した 16 ビット PCI の
Intel EtherExpress Pro/10 と Pro/10+ イーサネットカードの
サポートを提供します。
.Pp
ポートの開始アドレスが見つからなければ、
I/O アドレスの 0x200 から 0x3a0 の範囲からカードを探します。
IRQ が指定されていなければ、カードの EEPROM から読み出されます。
新しめのカードでの正しい操作のためには
プラグアンドプレイのサポートを無効にすべきです。
.Pp
.Sh 診断
.Bl -diag
.It "ex%d: Intel EtherExpress Pro/10, address %6D, connector %s"
デバイスプローブはインストールされたカードを発見して、
デバイスドライバを正しくインストールすることができました。
.It "ex%d: WARNING: board's EEPROM is configured for IRQ %d, using %d"
デバイスプローブはカーネル設定ファイルで指定されたものとは
異なる割り込みが設定されているボードを検出しました。
.It "ex%d: invalid IRQ."
デバイスプローブは不正な IRQ 設定を検出しました。
.El
.Pp
.Sh バグ
現在は、ドライバはマルチキャストをサポートしていません。
.Pp
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
デバイスドライバは
.Fx 2.2
に初めて登場しました。
.Sh 作者
.Nm
デバイスドライバは
.ie t .An Javier Mart\)'in Rueda
.el .An Javier Martin Rueda
によって書かれました。
このマニュアルページは
.An David E. O'Brien
によって書かれました。
