freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/lnc.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: lnc.4,v 1.6 1998/11/06 09:46:02 obrien Exp %
.\" $FreeBSD$
.\"
.Dd January 19, 1997
.Dt LNC 4 i386
.Os FreeBSD
.Sh 名称
.Nm lnc
.Nd
AMD Lance/PCnet イーサネットデバイスドライバ
.Sh 書式
.Cd "device lnc0 at isa? port 0x280 net irq 10 drq 0"
.Sh 解説
.Nm
ドライバは、Am7990 と Am79C960 含む AMD ファミリを利用している
Lance/PCnet Ethernet NIC をサポートするために用意されています。
.Nm
インタフェースによってサポートされているイーサネットカードは次の通りです:
.Bl -tag -width -offset ident -compat
.It Novell NE2100
.It Novell NE32-VL
.It Isolan BICC
.It Digital DEPCA
.It Hewlett Packard Vectra 486/66XM
.It Hewlett Packard Vectra XU
.El
.Sh 診断
.Bl -diag
.It "lnc%d: Framing error"
フレーミングエラーが発生しました。
これはまた、CRC エラーも発生したことを意味しています。
この結果、
ドライバはフレーミングエラーを含んでいるパケットを落としました。
.It "lnc%d: Receive CRC error"
受信したイーサネットフレームは、CRC チェックサムに失敗しました。
この結果、
ドライバがチェックサムに失敗したパケットを落としました。
.It "lnc%d: Packet dropped, no mbufs"
ドライバは mbuf を使い果してしまいました。
おそらく資源の問題だと思われます。
.It "lnc%d: Couldn't allocate memory for NIC"
致命的エラーです。
この状況下では、カードに対してドライバはアタッチされません。
.It "lnc%d: Memory allocated above 16Mb limit"
ISA と ESIA カードは、
16MB 以上の領域に DMA 転送を行うために、バウンスバッファが必要となります。
Am7990 と Am79C960 のアドレスラインは 24 本しかありませんので、
物理メモリのうち、下位の 16MB にしかアクセスできません。
.Nm
ドライバは、自己が割り当てるメモリが下位 16MB の範囲内にあると仮定しています。
これはあまり妥当な仮定ではありませんが、
これ以外の方法は今のところ何もできません。
共有メモリを利用した NIC に関しては関係ありません。
.It "lnc%d: Device timeout -- Resetting"
デバイスはネットワークに応答するのを停止したか、あるいは、
ネットワーク接続 (ケーブル) に関する問題が発生しました。
使用中のネットワーク接続とカードの設定が同じになっているか
どうか確認してください。
.It "lnc%d: Transmit late collision  -- Net error?"
.It "lnc%d: Loss of carrier during transmit -- Net error?"
.It "lnc%d: Transmit of packet failed after 16 attempts -- TDR = %d"
.It "lnc%d: Heartbeat error -- SQE test failed"
.It "lnc%d: Babble error - more than 1519 bytes transmitted"
.It "lnc%d: Missed packet -- no receive buffer"
.It "lnc%d: Memory error  -- Resetting"
.It "lnc%d: Couldn't get mbuf for transmit packet -- Resetting"
.It "lnc%d: Receive buffer error"
.It "lnc%d: Receive overflow error"
.It "lnc%d: Receive interrupt with buffer still owned by controller -- Resetting"
.It "lnc%d: Receive interrupt but not start of packet -- Resetting"
.It "lnc%d: Start of packet found before end of previous in receive ring -- Resetting"
.It "lnc%d: End of received packet not found -- Resetting"
.It "lnc%d: Transmit interrupt with buffer still owned by controller -- Resetting"
.It "lnc%d: Transmit interrupt but not start of packet -- Resetting"
.It "lnc%d: Start of packet found before end of previous in transmit ring -- Resetting"
.It "lnc%d: End of transmitted packet not found -- Resetting"
.It "lnc%d: Transmit buffer error -- Resetting"
.It "lnc%d: Transmit underflow error -- Resetting"
.El
.Sh バグ
このドライバは、
どのイーサネットドライバよりも冗長に作られている可能性があります。
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
デバイスドライバは
.Fx 2.2 
から登場しました。
.Sh 作者
.Nm
デバイスドライバは
.An Paul Richards
が作成しました。
このマニュアルページは 
.An David E. O'Brien
が書きました。
