freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/mcd.4
.\"
.\" Copyright (c) 1994 Keith E. Walker
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: mcd.4,v 1.6 1998/10/22 14:12:55 bde Exp %
.\" jpman %Id: mcd.4,v 1.3 1999/11/19 15:19:56 horikawa Stab %
.\"
.Dd December 8, 1994
.Dt MCD 4 i386
.Os FreeBSD 2.0
.Sh 名称
.Nm mcd
.Nd Mitsumi CD-ROM ドライバ
.Sh 書式
.Cd "device mcd0 at isa? port 0x300 bio irq 10"
.Sh 解説
.Nm mcd
ドライバは Mitsumi 製 CD-ROM プレイヤに対して、データとオーディオの
インタフェースを提供します。
CD-ROM プレイヤは、Mitsumi 専用のコントローラ
ボードの 1 つを経てISA バスに接続されていることが必要です。
サポートされているコントローラボードは LU002S, LU005S, FX001, そして一般的な 
FX001D です。 
.Pp
.Nm mcd
ドライバはディスク固有の
.Fn ioctl
コマンド、すなわち
.Dv DIOCGDINFO ,
.Dv DIOCGPART ,
.Dv DIOCWDINFO ,
.Dv DIOCSDINFO ,
コマンドに対して応答します。
他のディスク固有の
.Fn ioctl
コマンドにはエラーを返すものもあるでしょう。
.Pp
.Nm mcd
ドライバは、特別な CD-ROM
.Fn ioctl
コマンドに対しても応答します。これらのコマンドは、CD-ROM プレイヤの
オーディオ機能を制御します。
コマンドは次の通りです:
.Pp
.Bl -tag -width CDIOCREADSUBCHANNEL -compact -offset indent
.It CDIOCREADSUBCHANNEL
ディスクを再生中の現在の状態におけるサブチャネルの情報を取得します。
.It CDIOCREADTOCHEADER
目次ヘッダを取得します。
.It CDIOCREADTOCENTRYS
全ての目次を取得します。
.It CDIOCPLAYTRACKS
指定された位置において、オーディオ再生を始めます。
.It CDIOCPLAYBLOCKS
.Dv EINVAL
エラーで失敗します。
.It CDIOCPLAYMSF
指定された位置において、オーディオ再生を始めます。
.It CDIOCRESUME
あらかじめ一時停止したディスクの再生をレジュームします。
.It CDIOCPAUSE
ディスクの再生を一時停止します。
.It CDIOCSTART
ディスク再生を始めます。
.It CDIOCSTOP
あらかじめ再生中のディスクを停止します。
.It CDIOCEJECT
ディスクトレーをオープンします
(クローズするコマンドはサポートされていません)。 
.It CDIOCRESET
あらゆる再生を停止し、Mitsumi コントローラボードをリセットします。
.It CDIOCSETDEBUG
カーネルは
.Nm mcd
ドライバについてのデバッグメッセージをコンソールに出力します。
.It CDIOCCLRDEBUG
カーネルは
.Nm mcd
ドライバについてのデバッグメッセージの出力を終了します。
.El
.Pp
上記で定義した
.Fn ioctl
コマンドは
.Nm mcd
ドライバがサポートするコマンドだけです。(
.Dv CDIOCSETVOL
や
.Dv CDIOCSETSTERIO
のような) CD-ROM 関連
.Fn ioctl
コマンドも存在しますが、そのようなコマンドは
ドライバの将来のバージョンでサポートされるかも知れません。
.Sh 関連ファイル
.Bl -tag -width /dev/(r)mcd0a -compact
.It Pa /dev/(r)mcd0a
ディスク上の BSD パーティションにアクセスします。通常、CD-ROM ディスク
上に存在するファイルシステムは単一です。
.It Pa /dev/(r)mcd0c
raw デバイスにアクセスします。
.El
.Sh 注
.Nm mcd
ドライバのキャラクタモードデバイスは、
オーディオ機能に限定してアクセスするために使うべきです。
データ機能にアクセスすると、性能がひどく悪いからです。
.Pp
ドライバの現在のバージョンは、生成されたあらゆる IRQ に対して割り込み
ハンドラを保持しているにもかかわらず、インタフェースボードの DMA と  
IRQ 機能のどちらも用いていません。
ともかく DMA 機能がサポートされるまで、ボード
の生成する割り込みだけはドライバによってサポートされません。
.Sh 関連項目
.Pa /usr/include/sys/cdio.h
.Sh 作者
ドライバは
.An Holger Veit
(データ部分) 及び
.An Brian Moore
(オーディオ部分) が書きました。それに対する変更が
.An Gary Clark II ,
.An Andrew A. Chernov ,
.An Jordan K. Hubbard
によって提供されました。
.Sh 歴史
.Nm mcd
ドライバは
.Fx 1.0
で最初に登場しました。
