freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/npx.4
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: npx.4,v 1.1 1993/08/06 10:58:03 cgd Exp
.\"	%Id: npx.4,v 1.5 1998/10/22 14:22:13 bde Exp %
.\" jpman %Id: npx.4,v 1.3 1999/08/15 14:20:56 horikawa Stab %
.\"
.\" WORD: Numeric Processing Extension coprocessor 数値演算コプロセッサ
.\"
.Dd August 28, 1993
.Dt NPX 4 i386
.Os FreeBSD
.Sh 名称
.Nm npx
.Nd 数値演算コプロセッサとエミュレータ
.Sh 書式
.Cd "options MATH_EMULATE"
.\" XXX this is awful hackery to get it to work right... -- cgd
.Cd "device npx0 at isa? port IO_NPX tty irq 13"
.Sh 解説
.Nm npx
ドライバは、システムに数値演算コプロセッサがあれば、
それを利用できるようにします。
拡張数値演算機能 (NPX) は、
.Sy 486DX
CPU を使ったシステムや、
.Sy 387
または
.Sy 487SX
コプロセッサを使ったシステムに存在します。
.Nm npx
ドライバは NPX が存在するか否かに関わらず、
システムが正常に動作するために必要です。
.Pp
もし NPX がシステムに存在しない場合には、
カーネル設定ファイルに "MATH_EMULATE" オプションが
記述されていることが必要です。
これにより、通常は NPX で実行される命令がサポートされます。
システムに NPX が存在せず、カーネルが数学エミュレーションを付けずに
構築されている場合には、システムは起動しません。
.Sh 警告
エミュレータは NPX コプロセッサと比べて非常に遅いです。
そのため、エミュレータを使わなければならないときには、
浮動小数点演算の性能が悪くなります。
.Sh バグ
たくさんあります。特に安っぽいマザーボード上で使った時にはそうです。
NPX から CPU への割り込みラインが正しく結線されていない
マザーボードがあります。
もしこのような場合に、システムが常に正常な動作をすることを望むならば、
エミュレータを使うことが必要です。
.Pp
超越関数命令のエミュレーションは不正確です。
それ以外の命令のエミュレーションも怪しいです。
