freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/pcf.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD$
.Dd August 6, 1998
.Dt PCF 4
.Os FreeBSD
.Sh 名称
.Nm pcf
.Nd
Philips I2C バスコントローラ
.Sh 書式
.Cd "controller pcf0 at isa? port? irq 5"
.Pp
1 つ以上の iicbus バスに対し
.Cd "controller iicbus0"
.Sh 解説
.Em pcf
ドライバは
.Xr iicbus 4
システム用の Philips PCF8584 I2C コントローラのサポートを提供します。
.Pp
PCF8584 は CMOS テクノロジで設計された集積回路であり、
ほとんどの標準的なパラレルバスマイクロコントローラ/マイクロプロセッサと
シリアル I2C バスとの間のインタフェースを提供します。
PCF8584 はマスタとスレーブの両方の機能を提供します。
I2C バスとの通信は割り込みかポーリングハンドシェークを使い、
バイトを基本として実行されます。
また、I2C バス特有のシーケンス、プロトコル、調停、タイミングの全てを
制御します。
PCF8584 はパラレルバスシステムの I2C バスとの双方向通信を可能にしています。
.Pp
.Sh 関連項目
.Xr iicbus 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
