freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/scd.4
.\"
.\" Copyright (c) 1995 Jordan K. Hubbard
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: scd.4,v 1.6 1998/03/12 07:30:37 charnier Exp %
.\" $FreeBSD$
.\"
.Dd January 1, 1995
.Dt SCD 4 i386
.Os FreeBSD 2.0.5
.Sh 名称
.Nm scd
.Nd Sony CDU31/33 CD-ROM ドライバ
.Sh 書式
.Cd "device scd0 at isa? port 0x230 bio"
.Sh 解説
.Nm scd
ドライバは Sony CDU31 及び CDU33A CD-ROM ドライブに対する
データインタフェースを提供します。
ドライブは、
Sony 固有のインタフェースカードか互換カードに接続する必要があります。
.Sh 関連ファイル
.Bl -tag -width /dev/[r]scd0a -compact
.It Pa /dev/[r]scd0a
ディスク上の BSD パーティションにアクセスします。通常、CDROM ディスク
上には単一のファイルシステムのみ存在します。
.It Pa /dev/[r]scd0c
raw デバイスにアクセスします。
.Sh 関連項目
.Pa /sys/i386/isa/scd.c
.Sh 作者
本ドライバは、
.An Holger Veit
と
.An Brian Moore
が寄贈したコードを用いて、
.An Mikael Hybsch
が書きました。
.Sh 歴史
.Nm scd
ドライバは
.Fx 2.0.5
で最初に登場しました。 
