freebsd/freebsd-doc/ja_JP.eucJP/man/man4/man4.i386/spkr.4
.\"
.\"	%Id: spkr.4,v 1.10 1998/03/12 07:30:38 charnier Exp %
.\" $FreeBSD$
.\"
.Dd November 7, 1993
.Dt SPKR 4 i386
.Os FreeBSD
.Sh 名称
.Nm speaker ,
.Nm spkr
.Nd コンソールスピーカのデバイスドライバ
.Sh 書式
.Cd pseudo-device speaker
.Fd #include <machine/speaker.h>
.Sh 解説
スピーカデバイスドライバは、
.Tn FreeBSD
が走っている
.Tn IBM-PC 
互換 PC 上で、
アプリケーションがコンソールスピーカを制御できるようにします。
.Pp
いかなるときでも、このデバイスをオープンできるのは
ただ 1 つのプロセスだけです。
このため、このデバイスのロックと解放には、
.Xr open 2
と
.Xr close 2
を使用します。
他のプロセスがデバイスを独占している時にオープンしようとすると、
.Er EBUSY
エラーを示して -1 を返します。
デバイスへの書き込みは、 ASCII 文字で単純にメロディを表記した
演奏文字列 (`play string') として解釈されます。
.Xr ioctl 2
リクエストによる任意の周波数の発音もサポートされています。
.Pp
発音することでプロセッサを独占することはありません。
実際には、ドライバは PC ハードウェアが音を発している間の
ほとんどの時間をスリープして待っています。
他のプロセスはドライバが走っている間にビープを鳴らすことができます。
.Pp
アプリケーションは、スピーカのファイル記述子に対して
.Xr ioctl 2
呼び出しをすることにより、スピーカドライバを直接制御可能です。
.Xr ioctl 2
インタフェースについての定義は
.Pa /usr/include/machine/speaker.h
にあります。
これらの呼び出しに使われる
.Li tone_t
構造体には、
周波数 (ヘルツ) と持続時間 (1/100 秒単位で) を指定する
2 つのフィールドがあります。
周波数 0 は、休符と解釈されます。
.Pp
現在そのような
.Xr ioctl 2
呼び出しは 2 つあります。
.Dv SPKRTONE
は、第 3 引数に単一の tone 構造体へのポインタ 1 個を受け取り、
それを演奏します。
.Dv SPKRTUNE
は、単一の tone 構造体配列の先頭へのポインタ 1 個を受け取り、
それらを順番に演奏します。
この配列は末尾が持続時間 0 のメンバで終っていることが必要です。
.Pp
演奏文字列の語法は
.Tn IBM 
Advanced BASIC 2.0 の PLAY 文の習慣を模倣しています。
PLAY 文の
.Li MB , 
.Li MF ,
.Li X
要素は時分割環境では役に立たないため除かれます。
`オクターブ追従' 機能とスラー記号は新しく追加されたものです。
.Pp
 7 オクターブ 84 音が使用可能で 1-84 の番号がついています。
.\" 原文では 1-83 となっている。 send-pr 済み。
それぞれのオクターブは C から B まで続いていて 0-6 の番号がついています。
音階は A440 に合わせて調律されていて、オクターブ 3 は真中の C から始まります。
デフォルトでは演奏機能は半秒の音符を発音し、そのうち最後の 1/16 秒は休みます。
.Pp
演奏文字列は左から右へと、演奏コマンドグループの連続として解釈されます。
大文字小文字は区別されません。演奏コマンドグループは次の通りです:
.Bl -tag -width CDEFGABxx
.It Li CDEFGAB
A から G までの文字は対応する音を現在のオクターブで鳴らします。
音符文字にはオプションで、 # + - のうちいずれかひとつの
.Dq Em "臨時記号"
を続けることができます。このうち最初の 2 つは音を半音高くし、
最後のものは音を半音低くします。
また音符文字の後には音長を表す数字と付点記号 (後述) をつけることもできます。
音長は次の L コマンドの場合と同様に解釈されます。
.It Ns Li O Sy n
もし
.Sy n
が数字なら、以後のオクターブを設定します。
.Sy n
に
.Li L
または
.Li N
のいずれかを指定することにより、
オクターブ追従を有効または無効にすることができます
(デフォルトでは無効です)。
オクターブ追従が有効になっている時は、1 組の音符を解釈すると、
音符間での音程の差が最小になるように必要に応じてオクターブが変化します。
したがって、 ``olbc'' は ``olb>c'' のように、
``olcb'' は ``olc<b'' のように演奏されます。
オクターブ追従は、> と < と O[0123456] に続く、1 音符については無効です。
(オクターブ追従機能は
.Tn IBM
BASIC ではサポートされていません。)
.It Li >
現在のオクターブを 1 つ上げます。
.It Li <
現在のオクターブを 1 つ下げます。
.It Ns Li N Sy n
音符
.Sy n
を演奏します。
.Sy n
は 1 から 84 か、現在の音長の休符として 0 です。
付点記号を続けることもできます。
.It Ns Li L Sy n
音符の音長を設定します。デフォルトは
.Li L4
で、四分音符です。
この値は 1 から 64 までが認められます。
.Li L1
は全音符に、
.Li L2
は二分音符に、
.Li L4
は四分音符に、などと設定されます。
.It Ns Li P Sy n
.Sy n
を
.Ns Li L Sy n
と同様に解釈した休符です。付点記号をつけることもできます。
.Li ~
と書くこともできます。
.It Ns Li T Sy n
1 分あたりの四分音符の数を設定します。デフォルトは 120 です。
よくあるテンポの音楽名:

.Bd -literal -offset indent
        	テンポ    	分あたり拍数
とても遅い	Larghissimo	
        	Largo    	40-60
         	Larghetto    	60-66
        	Grave       	
        	Lento       	
        	Adagio       	66-76
遅い    	Adagietto    	
        	Andante   	76-108
中くらい   	Andantino	
        	Moderato	108-120
速い    	Allegretto	
        	Allegro   	120-168
        	Vivace    	
        	Veloce    	
        	Presto    	168-208
とても速い	Prestissimo	
.Ed
.It Li M[LNS]
調音を設定します。
.Li MN
.Ns No ( Li N
は普通 (normal) を示します) がデフォルトで、音符の最後 1/8 を休みます。
レガート (休みなし) にするには
.Li ML
を、スタッカート (1/4 休む) にするには
.Li MS
を設定できます。
.El
.Pp
音符 (つまり
.Li CDEFGAB
または
.Li N
コマンド文字グループ) には付点記号 (.) を続けることができます。
.\" dot とは . であるが日本語では明示しないとわからない
それぞれの付点記号は 1 つにつき、音符の音長を 1.5 倍にします。
したがって、付点記号が 1 つついた音符はついていないものの 3/2 の音長に、
2 つついた音符は 9/4 の音長に、
3 つついた音符は 27/8 の音長になります。
.Pp
音符と付点記号にはスラー記号 (_) を続けることができます。
これによって音符の後に普段ある小さな休みが埋められて、
音符を次の音符にスラーでつなげます。(スラー機能は
.Tn IBM
BASIC ではサポートされていません。)
.Pp
演奏文字列中の空白は単に飛ばされるので、
楽節を分けるのに使うことができます。
.Sh バグ
音程テーブルの丸めや、発音ハードウェアやタイマハードウェアの
こぼれ (どちらも精度を考慮していない) のため、
音程の正確さやタイミングは数学的に厳密ではありません。
音量調節はありません。
.Pp
2 つ以上の付点記号の動作は標準的な音楽記号を反映していません。
標準的には、それぞれの付点記号は前の付点の半分だけ音長を長くするのであり、
付点によって修正された音符の半分ではありません。
つまり、付点記号が 1 つついた音符はついていないものの 3/2 の音長に、
2 つついた音符は 7/4 の音長に、
3 つついた音符は 15/8 の音長になります。
それでも、3/2 倍にする解釈は
.Tn IBM
BASIC マニュアルに記されているため、
互換性のためにそのままにしています。
.Pp
非常に長い (システムの物理 I/O ブロックよりも長い) 演奏文字列では、
ブロック境界をまたがるために、
音符の修飾や数値が時々間違って解釈されることがあります。
.Sh 関連ファイル
.Bl -tag -width /dev/speakerxx
.It Pa /dev/speaker
スピーカデバイスファイル
.El
.Sh 関連項目
.Xr spkrtest 8
.Sh 作者
.An Eric S. Raymond Aq esr@snark.thyrsus.com
1990 年 6 月
.Sh 移植者
.An Andrew A. Chernov Aq ache@astral.msk.su
.Sh 歴史
.Nm
デバイスは
.Fx 1.0
に初めて登場しました。
