freebsd/freebsd-doc/documentation/manual-pages/ja/man4/aha.4
.\"
.\" Copyright (c) 1994 Wilko Bulte
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: aha.4,v 1.7 1998/10/16 04:41:38 ken Exp %
.\" $FreeBSD$
.\"
.Dd October 15, 1998
.Dt AHA 4 i386
.Os FreeBSD
.Sh 名称
.Nm aha
.Nd Adaptec SCSI ホストアダプタドライバ
.Sh 書式
.Cd controller "aha0 at isa? port ? cam irq ? drq 5"
.Cd controller scbus0 at aha0
.Sh 解説
このドライバは、
Adaptec の 154xA, 154xB, 154xC, 154xCF, 154xCP のいずれかの
ホストアダプタに接続された
.Tn SCSI 
バスへのアクセスを提供します。
154X 互換インタフェースをサポートするホストアダプタも、
このドライバにアタッチできます。
このようなホストアダプタには、
154x エミュレーションモードの一部の Tekram コントローラや 
Adaptec 174x コントローラなどがあります。
Adaptec 174x コントローラで最適なパフォーマンスを得るには、
エンハンストモードに設定し、
.Xr ahb 4
ドライバを通じてアタッチするとよいでしょう。
.Pp
カーネルの設定ファイルには、システムに取り付けられたカード毎に
1 つのエントリが必要です。
ポートアドレス、割り込み番号 (irq)、DMA リクエスト番号 (drq)
には特定の値を指定できます。
値にワイルドカードが使用された場合、
ドライバはデバイスに現在の設定を問い合わせ、結果を使用します。
ポートアドレスがワイルドカードの場合、
ドライバは、ありうるポートアドレス位置が書かれた内部表を参照し、
最初に見つけたアタッチされていないカードをアタッチします。
このカードにありうるポートアドレスは、
0x330, 0x334, 0x230, 0x234, 0x130, 0x134 です。
.Sh 関連項目
.Xr ahb 4 ,
.Xr ahc 4 ,
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr da 4 ,
.Xr sa 4
.\"
.\" .Sh 診断
.\"
.Sh 作者
.Nm aha 
ドライバは、Justin T. Gibbs による
.Nm bt 
ドライバを、M. Warner Losh が移植したものです。
