freebsd/freebsd-doc/documentation/manual-pages/ja/man4/arp.4
.\" Copyright (c) 1985, 1986, 1988, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)arp4.4	6.5 (Berkeley) 4/18/94
.\" $FreeBSD$
.\"
.Dd April 18, 1994
.Dt ARP 4
.Os BSD 4
.Sh 名称
.Nm arp
.Nd アドレス解決プロトコル
.Sh 書式
.Em "pseudo-device ether"
.Sh 解説
アドレス解決プロトコル (ARP) はインターネットホストアドレスと
10Mb/s のイーサネットアドレスを動的にマッピングするプロトコルです。
これは全ての 10Mb/s イーサネットインタフェースドライバで
利用されています。
このプロトコルはインターネットプロトコルや 10Mb/s イーサネットに
限定されているわけではありませんが、
現在の実装ではこの組み合わせしかサポートしていません。
.Pp
ARP はインターネットアドレスとイーサネットアドレスのマッピング (対応関係) を
キャッシュします。
キャッシュにないアドレスのマッピングをインタフェースが要求したとき、
ARP は、そのマッピングを要求するメッセージをキューに入れ、
そのアドレスマッピングを要求するメッセージを
接続されたネットワークに対してブロードキャストします。
応答があった場合、新たにマッピングされたアドレスを
キャッシュに格納し、キューに入れられていたメッセージを送信します。
ARP はマッピング要求の応答を待つ間、
高々 1 つのパケットをキューに保持します。
すなわち、1 番最近 ``送信した'' パケットのみを保持します。
もし目的のホストが数回の要求にも応じない場合、
そのホストは短期間 (通常 20 秒) ダウンしていると考えられ、
その間の転送要求に対しエラーが返ります。
そのエラーは、宛先のホストが応じない場合は
.Li EHOSTDOWN
、ルータが応じない場合は
.Li EHOSTUNREACH
となります。
.Pp
ARP キャッシュは、動的に生成されたホスト経路として、
システムのルーティングテーブルに収められます。
直接接続されているイーサネットネットワークへの経路は
.Dq 複製
された経路 (
.Li RTF_CLONING
フラグが立った経路) として格納され、
そのネットワーク上の個々のホストへの経路は必要に応じて生成されます。
これらの経路は定期的にタイムアウトします
(通常その経路が有効になってから 20 分でタイムアウトし、
これらのエントリは使われない限り有効にはなりません)。
応答のないホストへのエントリは
.Dq 拒否
された経路 (
.Li RTF_REJECT
フラグが立てられた経路) になります。
.Pp
ARP エントリは
.Xr arp 8
ユーティリティにより追加や削除、変更されることがあります。
手作業で追加されたエントリには一時的なものも永続的なものもありえますし、
.Dq 公表
されることもあります。公表された場合、システムは ARP リクエストに対し、
自分がそのリクエストの目的ホストであるかのように応答します。
.Pp
以前 ARP は、トレーラカプセル化の使用を
交渉するために使われていました。
これはもはやサポートされていません。
.Pp
ARP は自分の振りをするホスト (つまり自分のアドレスに対する
ARP 要求に応答するホスト) を受動的に監視します。
.Sh 診断
.Em "arp: %x:%x:%x:%x:%x:%x is using my IP address %d.%d.%d.%d!" :
ARP はローカルネットワークに、
違うイーサネットアドレスなのにもかかわらず
自分と同じインターネットアドレスに対する
マッピング要求に応答する別のホストを見つけました。
一般的に、2 つのホストが同じインターネットアドレスを
使おうとしていることを示しています。
.Pp
.Em "arp: ether address is broadcast for IP address %d.%d.%d.%d!" :
ARP はあるホストについての情報を要求し、そのホストのイーサネットアドレスが
イーサネットのブロードキャストアドレスであることを示す応答を
受け取りました。
これはデバイスの設定ミスか、壊れていることを示しています。
.Pp
.Em "arp: %d.%d.%d.%d moved from %x:%x:%x:%x:%x:%x to %x:%x:%x:%x:%x:%x" :
ARP は参照したホストのイーサネットアドレスをキャッシュしていますが、
そのホストが新しいアドレスを持っていることを示す応答を受け取りました。
これは通常ホストのハードウェアアドレスが変わったり、モバイル端末が
ローカルのサブネットに繋がれたか切り放されたときに起こります。
またこれは代理 ARP の問題であることもあります。
.Pp
.Em "arpresolve: can't allocate llinfo for %d.%d.%d.%d" :
参照しているホストへの経路は ARP が要求されたデバイスを指しています。
しかし ARP はそのホストの MAC アドレスを格納する
ルーティングテーブルのエントリを割り当てることができませんでした。
これは通常ルーティングテーブルの設定ミスを示しています。
また、カーネルがメモリを割り当てられなかった時にも起ります。
.Sh 関連項目
.Xr inet 4 ,
.Xr route 4 ,
.Xr arp 8 ,
.Xr ifconfig 8 ,
.Xr route 8
.sp
.Rs
.%A Plummer, D.
.%B "An Ethernet Address Resolution Protocol"
.%T RFC826
.Re
.Rs
.%A Leffler, S.J.
.%A Karels, M.J.
.%B "Trailer Encapsulations
.%T RFC893
.Re

