freebsd/freebsd-doc/documentation/manual-pages/ja/man4/atkbdc.4
.\"
.\" Copyright (c) 1999
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: atkbdc.4,v 1.1.2.2 1999/02/10 14:49:51 yokota Exp %
.\" $FreeBSD$
.\"
.Dd February 9, 1999
.Dt ATKBDC 4
.Os FreeBSD
.Sh 名称
.Nm atkbdc
.Nd
AT キーボードコントローラのインタフェース
.Sh 書式
.Cd "options" \&"KBD_RESETDELAY=N\&"
.Cd "options" \&"KBD_MAXWAIT=N\&"
.Cd "options" \&"KBDIO_DEBUG=N\&"
.Cd "controller atkbdc0 at isa? port IO_KBD tty"
.Sh 解説
キーボードコントローラ
.Nm
は AT キーボードや PS/2 マウス形式のポインティングデバイスへの
I/O サービスを提供します。
このコントローラはキーボードドライバ
.Nm atkbd
と PS/2 ポインティングデバイスドライバ
.Nm psm
のために必要です。
.Pp
システム中には
.Nm
デバイスを 1 つだけ設定することができます。
.Sh ドライバの設定
.Ss カーネル設定オプション
.Nm
ドライバを制御するために、次のカーネル設定オプションが使えます。
これらはカーネル設定ファイル
.Pq Xr config 8 参照
で指定できます。
.Bl -tag -width MOUSE
.It Em KBD_RESETDELAY=X, KBD_MAXWAIT=Y
キーボードドライバ
.Nm atkbd
やポインティングデバイスドライバ
.Nm psm
は、ブート時に
.Nm
ドライバを通じてデバイスをリセットします。
これらのデバイスがリセットコマンドに応答するのに
時間がかかることがあります。
これらのオプションは、
.Nm
ドライバが応答を待つのをあきらめるまでの時間を設定します。
ドライバは最大で
.Fa X
*
.Fa Y
ミリ秒待ちます。
もしドライバがデバイスを検出できないようなら、
これらの値を増やすと良いかもしれません。
デフォルトの値は
.Fa X
が 200 ミリ秒で、
.Fa Y
が 5 です。
.It Em KBDIO_DEBUG=N
デバッグレベルを
.Fa N
にします。
デフォルトは 0 で、すべてのデバッグ出力は抑制されます。
.El
.\".Ss Driver Flags
.\".Sh FILES
.\".Sh EXAMPLE
.\".Sh DIAGNOSTICS
.\".Sh CAVEATS
.\".Sh BUGS
.Sh 関連項目
.Xr atkbd 4 ,
.Xr psm 4 ,
.Xr config 8
.Sh 歴史
.Nm
ドライバは
.Fx 3.1
に初めて登場しました。
これは
.Fx 2.2
の kbdio モジュールに基づいています。
.Sh 作者
kbdio モジュールと
.Nm
ドライバ、およびこのマニュアルページは
.An Kazutaka Yokota Aq yokota@FreeBSD.org
が書きました。
