freebsd/freebsd-doc/documentation/manual-pages/ja/man4/atkbd.4
.\"
.\" Copyright (c) 1999
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: atkbd.4,v 1.1.2.2 1999/02/10 14:49:51 yokota Exp %
.\" $FreeBSD$
.\"
.Dd February 9, 1999
.Dt ATKBD 4
.Os FreeBSD
.Sh 名称
.Nm atkbd
.Nd
AT キーボードのインタフェース
.Sh 書式
.Cd "device atkbd0 at isa? tty irq 1"
.Sh 解説
.Nm
ドライバは
.Nm atkbdc
ドライバと共に、AT キーボードコントローラに接続された
AT 84キーボードや AT 拡張キーボードを利用できるようにします。
.Pp
このドライバはコンソールドライバ
.Xr syscons 4 
もしくは
.Xr pcvt 4
のために必要です。
.Pp
カーネル設定ファイルには
.Nm
デバイスを 1 つだけ定義することができます。
また、このデバイスが機能するためには
.Nm atkbdc
キーボードコントローラが必要です。
.Em irq
は常に 1 であることが必要で、変えることはできません。
.Sh ドライバの設定
.\".Ss カーネル設定オプション
.Ss ドライバのフラグ
.Nm
ドライバは次のドライバフラグを受け付けます。
これらはカーネル設定ファイル
.Pq Xr config 8 参照
か、もしくはブート時のユーザ設定メニュー
.Pq Xr boot 8 参照
で指定できます。
.Bl -tag -width FAIL
.It bit 0 (FAIL_IF_NO_KBD)
デフォルトでは、たとえ実際にはキーボードが接続されていなくても、
.Nm
ドライバはインストールされます。
このオプションは、このような状況ではドライバをインストールしないようにします。
.It bit 1 (NO_RESET)
このオプションが与えられると、
.Nm
ドライバは初期化の際にキーボードをリセットしません。
ファンクションキーが特別な機能を持っていて、キーボードをリセットすると
機能が失われるようなラップトップコンピュータで、役に立つかもしれません。
.It bit 2 (ALT_SCANCODESET)
ThinkPad のいくつかのモデルのキーボードのように、キーボードのなかには
古い XT キーボードのように振舞うものがあります。このようなキーボードでは
このオプションが必要です。
.El
.\".Sh FILES
.\".Sh EXAMPLE
.\".Sh DIAGNOSTICS
.\".Sh CAVEATS
.\".Sh BUGS
.Sh 関連項目
.Xr atkbdc 4 ,
.Xr pcvt 4 ,
.Xr psm 4 ,
.Xr syscons 4 ,
.Xr boot 8 ,
.Xr config 8
.Sh 歴史
.Nm
ドライバは
.Fx 3.1
に初めて登場しました。
.Sh 作者
.Nm
ドライバは
.ie t .An S\(/oren Schmidt Aq sos@FreeBSD.org
.el .An Soren Schmidt Aq sos@FreeBSD.org
と
.An Kazutaka Yokota Aq yokota@FreeBSD.org
が書きました。このマニュアルページは
.An Kazutaka Yokota
が書きました。
