freebsd/freebsd-doc/documentation/manual-pages/ja/man4/imm.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD$
.Dd October 27, 1998
.Dt IMM 4
.Os FreeBSD
.Sh 名称
.Nm imm
.Nd
パラレルから SCSI へのインタフェースドライバ
.Sh 書式
.Cd "controller vpo at ppbus?"
.Pp
1 つ以上の SCSI バスに対し:
.Cd "controller scbus0 at vpo0"
.Sh 解説
imm ドライバは、
.Xr vpo 4
ドライバを拡張して、
Iomega Matchmaker Parallel to SCSI インタフェース用にしたものです。
このドライバのほとんどは
.Xr microseq 9
のメカニズムを使用して書かれています。
.Sh 関連項目
.Xr ppbus 4 ,
.Xr vpo 4 ,
.Xr microseq 9 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
