freebsd/freebsd-doc/documentation/manual-pages/ja/man4/lpt.4
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" Copyright (c) 1994 Geoffrey M. Rehmet
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: lpt.4,v 1.1 1993/08/06 10:34:12 cgd Exp
.\"	$id: lpt.4,v 1.8 1998/10/22 14:12:55 bde Exp $
.\" $FreeBSD$
.\"
.Dd August 28, 1993
.Dt LPT 4 i386
.Os FreeBSD
.Sh 名称
.Nm lpt
.Nd
パラレルポートドライバ
.Sh 書式
割り込み駆動ポート:
.Cd "device lpt0 at isa? port" \&"IO_LPT1\&" tty irq 7
.Cd "device lpt1 at isa? port" \&"IO_LPT2\&" tty irq 7
.Cd "device lpt2 at isa? port" \&"IO_LPT3\&" tty irq 7
.Pp
BIOS がプローブするポート:
.Cd "device lpt0 at isa? port? tty irq 7"
.Pp
ポーリングポート:
.Cd "device lpt0 at isa? port? tty"
.Cd "device lpt1 at isa? port" \&"IO_LPT2\&" tty
.Sh 解説
このドライバはパラレルポートへのアクセスを提供します。
.Pp
ドライバは割り込み駆動と、
プリンタへのポーリングのいずれかに設定することができます。
割り込み駆動に設定されたポートは
.Xr lptcontrol 8
コマンドを使ってポーリングモードに変更することができます。
.Pp
このドライバは現在は存在しない
.Xr lpa 4
ドライバの機能を置き換えるものです。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /dev/lpt0
パラレルポートドライバの最初のもの
.El
.Sh 関連項目
.Xr lp 4 ,
.Xr lptcontrol 8
.Sh バグ
沢山あります。特に安価なパラレルポートの実装において沢山あります。
.Pp
lpt ポートはプリンタが接続されていて、
かつオンライン状態にある時しかオープンできません。このため、
プリンタが接続されていない時には、
.Xr lptcontrol 8 
は実行できません。
.Pp
このドライバはまだ書き直す必要があるかもしれません。
