freebsd/freebsd-doc/documentation/manual-pages/ja/man4/plip.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD$
.Dd March 5, 1998
.Dt PLIP 4
.Os FreeBSD
.Sh 名称
.Nm plip
.Nd
パラレルポートネットワークインタフェース
.Sh 書式
.Cd "device plip at ppbus?"
.Sh 解説
.Em plip
ドライバは
.Xr lp 4
ドライバを
.Xr ppbus 4
システムへ移植したものです。
.Pp
この移植の 1 つの目的は、
パラレルポートを他のパラレルデバイスと共有できるようにすることです。
パラレルポートバスの割り当てが元の
.Xr lp 4
ドライバに追加されています。
また、inb()/outb() の呼び出しは
ppbus の関数への呼び出しに置き換えられています。
plip は ppbus インタフェースのおかげで、現在アーキテクチャ独立となっています。
ppbus システムの詳細な情報については
.Xr ppbus 4
を参照してください。
.Pp
ppbus はパラレルネットワークインタフェースが up になった時に割り当てられ、
インタフェースが down になると開放されます。
その結果、ネットワークインタフェースが up の時は、
パラレルポートバスは他のデバイスから使用できなくなります。
plip は割り込み駆動であり、
パラレルポートの割り込みを受け取るためにバスを保有する必要があります。
.Pp
あなたの MACHINE ファイルの
.Xr ppc 4
のエントリに net 割り込みレベルが定義されていることを確認してください...
.Sh 関連項目
.Xr ppbus 4 ,
.Xr lp 4 ,
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
