freebsd/freebsd-doc/documentation/manual-pages/ja/man4/pt.4
.\" Copyright (c) 1995
.\"	Peter Dufault,  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: pt.4,v 1.5 1997/03/07 02:49:30 jmg Exp %
.\" $FreeBSD$
.\"
.Dd March 2, 1995
.Dt PT 4
.Os FreeBSD
.Sh 名称
.Nm pt
.Nd SCSI プロセッサ型ドライバ
.Sh 書式
.Cd device pt0 at scbus?
.Sh 解説
.Nm
ドライバは
.Tn SCSI
プロセッサ型デバイスをサポートします。
このような機器は、大抵スキャナなどのデバイスであり、
データストリームに機器固有の命令を埋め込むことにより、
.Tn SCSI
接続を通信インタフェースとして使用します。
.Pp
.Tn SCSI
ドライバを利用する前に、各 SCSI アダプタをシステムに対して設定する
必要があります。
.Pp
このデバイスは
.Xr read 2 ,
.Xr write 2 
および、一般的な
.Tn SCSI
.Xr ioctl 2
システムコールのみが利用可能です。
.Sq Li at scbus?
という記述がシステムを構成するための設定ファイル中に必要となります。
これは、デバイスが SCSI デバイスであることをシステムに通知し、
適切なテーブルを生成するのに必要となります。
.Pp
設定ファイル中の
.Sq Li pt0
には
.Sq Li 0
を指定する必要があります。
これは
.Xr config 8 
の欠陥です。
.Sh IOCTL
.Nm 
ドライバは独自の ioctl は持ちませんが、一般的な
.Xr scsi 4 
コマンドへの媒介として動作します。
これらに関しては、
.Em sys/scsiio.h
に記述されています。
.Xr scsi 4
の全てのデバッグ用 ioctl が
.Nm
デバイスで利用可能です。
.Sh 関連ファイル
.Bl -tag -width /dev/ptQQQ -compact
.It Pa /dev/pt Ns Ar N
.No Ar N 番目の外部機器へのドライバ
.El
.Sh 関連項目
.Xr scsi 4
.Sh 歴史
.Nm
ドライバは
.Fx 2.1 
で登場しました。
