freebsd/freebsd-doc/documentation/manual-pages/ja/man4/screen.4
.\"
.\"	%Id: screen.4,v 1.10 1998/06/08 06:11:59 jkoshy Exp %
.\" $FreeBSD$
.\" WORD: original console device	オリジナルコンソールデバイス
.\" WORD: character attribute		文字属性
.\" WORD: blink			明滅(表示) [screen.4]
.\" WORD: reverse		反転(表示) [screen.4]
.\" WORD: cyan		シアン
.\" WORD: magenta	マゼンタ
.\" "
.Dd January 8, 1995
.Dt SCREEN 4 i386
.Os FreeBSD
.Sh 名称
.Nm screen
.Nd PC ディスプレイのインタフェース
.Sh 解説

/dev にあるデバイスファイル ttyv0 - ttyvb を通して
.Ar 仮想コンソール
へアクセスできます。
これらのファイルはそれぞれ別々の仮想コンソールに対応します。
すべての仮想コンソールデバイスを同時にオープンすることもできますが、
アクティブなのは一度にひとつだけです。
アクティブな仮想コンソールがキーボードやディスプレイ画面を「占有」します。
.Pp
ディスプレイに現在向けられていない仮想コンソールへの出力は、
「画面全体」(普通は 25 行) の行を保持するバッファに保存されます。
.Ar /dev/console 
(オリジナルコンソールデバイス) へ書き込まれた出力はすべて
/dev/ttyv0 にエコーされます。
.Pp
仮想コンソールを切り替えるには、シーケンス
.Ar ALT+Fn
を使います。
これは ALT を押しながらファンクションキーのひとつを押すという意味です。
そうすると、そのファンクションキーと同じ番号の仮想コンソールが
現在の仮想コンソールとして選択され、
キーボードやディスプレイの専有的な使用権が与えられます。
この切り替えシーケンスは
キーボードマッピング ioctl 呼び出しで変更できます (keyboard.4 参照)。
.Pp

コンソールでは、特別なキーシーケンスを用いてキーボード上に物理的に
存在しない値を入力できます。この機能を使うには、ALT を押したままにして、
数字キーパッドで 0 から 255 の 10 進数字を入力し、ALT を離してください。
そうすると、入力された値がひとつの文字を表す ASCII 値として使われます。
このようにして、任意の ASCII 値を入力することができます。
また、コンソールドライバは履歴機能も備えています。
履歴機能は scroll-lock キーを押すことで有効になります。
これは表示を固定し、最近スクロールされた行に渡って矢印キーで
スクロールアップ・ダウンできるようにします。

コンソールは ANSI x3.64 文字シーケンスのサブセットを解釈します。
古い pccons ドライバとの互換性のため、
PC3 文字シーケンスもサポートされています。
.Pp
.Bd -literal 
ANSI	Seq	機能					termcap エントリ
======= ======= =====================================   ==============

--	E7	カーソル位置を保存			sc

--	E8	保存したカーソル位置を復元		rc

CUU     E[nA    カーソルを n 行上に移動			up/UP (ku)

CUD     E[nB    カーソルを n 行下に移動			do/DO (kd)

CUF     E[nC    カーソルを n 文字右に移動		nd/RI (kr)

CUB     E[nD    カーソルを n 文字左に移動		--/LE (kl)

HPA     E[n`	カーソルを文字位置 n に移動		ch

HPR	E[na	カーソルを n 文字右に移動		--

VPA     E[nd    カーソルを行 n に移動			cv

VPR	E[ne	カーソルを n 行下に移動			--

CPL     E[nF    カーソルを n 行上の行頭に移動		-- (@7)

CNL     E[nE    カーソルを n 行下の行頭に移動		nw

CUP	E[y;xH	カーソルを x, y	に移動			cm

HVP	E[y;xf	カーソルを x, y	に移動			--

CBT     E[nZ    カーソルを n タブ戻す			bt (kB)

IL      E[nL    n 行の空行を挿入			al/AL

ICH     E[n@    n 個の空白文字を挿入			ic/IC

DL      E[nM    n 行削除				dl/DL

DCH     E[nP    n 文字削除				dc/DC

ED	E[nJ	表示の一部または全部を消去:		cd
		n=0 カーソルから表示終端までを消去
		n=1 表示始点からカーソルまでを消去
		n=2 表示全体を消去

EL	E[nK	行の一部または全部を消去:		ce
		n=0 カーソルから行末までを消去
		n=1 行頭からカーソルまでを消去
		n=2 行全体を消去

ECH     E[nX    n 文字消去				ec

SU      E[nS    表示を n 行スクロールアップ (進める)	sf/SF

SD      E[nT    表示を n 行スクロールダウン (戻す)	sr/SR


SGR	E[nm	文字属性を設定:				--
		n= 0 通常の属性 (すべてオフ)
		n= 1 ボールド体 (ハイライト表示)
		n= 4 下線付き (ハードウェアがサポートしている場合)
		n= 5 明滅表示 (ハードウェアがサポートしている場合)
		n= 7 反転表示
		n=3X 前景色を設定 (次表参照)
		n=4X 背景色を設定 (次表参照)

		   X=0 黒 	X=1 赤
		   X=2 緑	X=3 茶
		   X=4 青	X=5 マゼンタ
		   X=6 シアン 	X=7 白

--	E[s	カーソル位置を保存			sc

--	E[u	保存したカーソル位置を復元		rc

--	E[=p;dB	ベル音の調子 (p) と時間 (d) を設定	--
			調子は 840 nS 単位
			時間は 0.1 S 単位

--	E[=tC	カーソル種を設定			--
			1 で明滅カーソル
			0 で固定カーソル

--	E[=nA	境界色を n に設定
		(次表参照) (ハードウェアがサポートしている場合)

--	E[=cF	通常前景色を n に設定			--
		(次表参照)

--	E[=cG	通常背景色を n に設定			--
		(次表参照)

--	E[=cH	反転前景色を n に設定			--
		(次表参照)

--	E[=cI	反転背景色を n に設定			--
		(次表参照)

		   n= 0 黒		n= 8 灰
		   n= 1 青		n= 9 明るい青
		   n= 2 緑		n=10 明るい緑
		   n= 3 シアン		n=11 明るいシアン
		   n= 4 赤		n=12 明るい赤
		   n= 5 マゼンタ	n=13 明るいマゼンタ
		   n= 6 茶		n=14 黄
		   n= 7 白		n=15 明るい白

注: シーケンス (Seq) 中の最初の E は ESC (0x1b) を表します。

.Ed
.Pp
.Sh 作者
.ie t .An S\(/oren Schmidt Aq sos@FreeBSD.org
.el .An So/ren Schmidt Aq sos@FreeBSD.org
.\" ISO-8859 集合の文字(0xe4)に対処     金ん田 1999.03.12
.\" .An Soren Schmidt Aq sos@FreeBSD.org
.\"      ^0xe4
