freebsd/freebsd-doc/documentation/manual-pages/ja/man4/smb.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD$
.Dd October 25, 1998
.Dt SMB 4
.Os FreeBSD
.Sh 名称
.Nm smb
.Nd
SMB 汎用 I/O デバイスドライバ
.Sh 書式
.Cd "device smb0 at smbus?"
.Sh 解説
.Em smb
キャラクタデバイスドライバは、
すべての
.Xr smbus 4
のインスタンスに汎用の I/O を提供します。
SMB デバイスを制御するためには、次の ioctl で /dev/smb? を使用します。
.Pp
.Bl -column "システム管理バス ioctl" -compact
.It Em ioctl Ta Em 説明
.It Sy SMB_QUICK_WRITE Ta "QuickWrite コマンド"
.It Sy SMB_QUICK_READ Ta "QuickRead コマンド"
.It Sy SMB_SENDB Ta "SendByte コマンド"
.It Sy SMB_RECVB Ta "ReceiveByte コマンド"
.It Sy SMB_WRITEB Ta "WriteByte コマンド"
.It Sy SMB_WRITEW Ta "WriteWord コマンド"
.It Sy SMB_READB Ta "ReadByte コマンド"
.It Sy SMB_READW Ta "ReadWord コマンド"
.It Sy SMB_PCALL Ta "ProcedureCall コマンド"
.It Sy SMB_BWRITE Ta "BlockWrite コマンド"
.It Sy SMB_BREAD Ta "BlockRead コマンド"
.El
.Pp
write ルーチンを使うのは SMB_WRITEW ioctl と等価です。
.Pp
.Sh 関連項目
.Xr smbus 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
