freebsd/freebsd-doc/documentation/manual-pages/ja/man4/smbus.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD$
.Dd August 10, 1998
.Dt SMBBUS 4
.Os FreeBSD
.Sh 名称
.Nm smbus
.Nd
システム管理バス
.Sh 書式
.Cd "controller smbus"
.Pp
.Cd "device iicsmb0 at iicbus?"
.Cd "device bktr0"
.Sh 解説
様々な SMB デバイスを制御し
種々の SMB コントローラ (I2C, PIIX4, Brooktree848, vm86...)
を利用するドライバを実装するため、
.Em smbus
システムは、
単一形態で、モジュール化された、
アーキテクチャに依存しないシステムを提供します。
.Sh システム管理バス
.Em システム管理バス
は 2 本のワイヤからなるインタフェースであり、
単純な電源関連のチップが
システムの残りの部分と通信できるようにするためのものです。
これはバックボーンとして I2C を使っています (
.Xr iicbus 4
参照)。

SMB を使ったシステムはデバイスの個々の制御ラインを見ていくのではなく、
デバイスとメッセージのやりとりをします。

SMBus を使うことにより、
デバイスは、製造業者の情報を提供すること、
システムに対してそのモデルや部品番号を伝えること、
サスペンドイベントのために状態を保存すること、
様々なタイプのエラーを報告すること、
制御パラメータを受け付けること、
ステータスを返すことが可能となります。

適切な電気的ブリッジが内部の SMB デバイスと外部の ACCESS
バスデバイスの間に提供されていれば、
SMBus は、
ACCESS バスのコンポーネントとして
同じホストデバイスと物理バスを共有できます。
.Sh 関連項目
.Xr iicbus 4 ,
.Xr iicsmb 4 ,
.Xr bktr 4 ,
.Xr smb 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
