freebsd/freebsd-doc/documentation/manual-pages/ja/man4/uk.4
.\"	%Id: uk.4,v 1.12 1997/03/21 20:13:27 mpp Exp %
.\" $FreeBSD$
.\" Copyright (c) 1996
.\"	Julian Elischer <julian@freebsd.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 11, 1993
.Dt UK 4
.Os FreeBSD
.Sh 名称
.Nm uk
.Nd SCSI ユーザレベルドライバ
.Sh 書式
.Cd "device uk"
.Sh 解説
.Nm uk
ドライバは、ドライバの設定が行われていないデバイスを、
SCSI バス上でアドレスするためのサポートを提供します。
.Pp
.Fx 2.1
以前は、
最初にみつかった未知のデバイスは、
.Em uk0
としてアタッチされ、以下
.Em uk1
という具合にアタッチしてゆきます。
.Fx 2.1
以降では、あるデバイスがどの uk ユニットとして接続すべきかを
指定できるようになりました。
カーネルを設定する上での詳細は
.Xr scsi 4
を参照してください。
.Pp
このドライバを利用する前に、各 SCSI アダプタをシステムに対して設定する
必要があります。
.Pp
.Sh カーネルの設定
数が指定されると、その数の
.Nm 
ドライバがカーネルに組み込まれます。
.Pp
.Sh IOCTL
.Nm 
ドライバは独自の ioctl は持ちませんが、一般的な
.Xr scsi 4 
コマンドへの媒介として動作します。
これらに関しては、
.Em sys/scsiio.h
に記述されています。
.Sh 関連ファイル
.Bl -tag -width /dev/uk0XXX -compact
.It Pa /dev/uk[0-255]
uk{x} は「x 番目」に見つかった未知のデバイスです。
.El
.Sh 診断
.Xr scsi 4
の全てのデバッグ用 ioctl が
.Nm
デバイスで利用可能です。
.Sh 関連項目
.Xr cd 4 ,
.Xr ch 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr su 4
.Sh 歴史
.Nm
ドライバは 386BSD 0.1 で登場しました。
