freebsd/freebsd-doc/documentation/manual-pages/ja/man4/wfd.4
.\" Copyright (c) 1997 Junichi Satoh
.\"   All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY FreeBSD, Inc. AND CONTRIBUTORS ``AS IS''
.\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL FreeBSD, Inc.  OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: wfd.4,v 1.5 1998/08/31 16:41:07 wosch Exp %
.\" $FreeBSD$
.\"
.Dd January 16, 1998
.Dt WFD 4
.Os FreeBSD
.Sh 名称
.Nm wfd
.Nd
ATAPI フロッピドライバ (LS-120 フロッピドライバ)
.Sh 書式
.Cd options ATAPI
.Cd options ATAPI_STATIC
.Cd device wfd0
.Pp
.Sh 解説
.Nm
ドライバは
.Em ATAPI
フロッピディスクや、典型的な LS-120 スタイルである 120mb/1.4mb
フロッピドライブをサポートします。一般的にインタフェースは
.Xr wd 4 ,
.Xr sd 4 ,
.Xr od 4
に書かれていることと類似しています。
.Pp
ブート時に IDE コントローラがプローブされるとき、デバイスを検出するた
めに
.Em IDE
バスが調べられます。検出されたもののうち
.Sq Em Floppy
かつ
.Sq Em removable
型と返されるどのデバイスも
.Nm
ドライバに接続されます。
以降では、最初に検出されたデバイスは
.Em wfd0
として接続され、次は
.Em wfd1
と以下同様に続きます。
.\" 1.5.2.4 で wfd1 になっている
.Pp
LS-120 ドライブと共に使われるとき、このドライバは次のタイプのフロッピ
ディスクを読み書きします。
.Bl -tag -width 1.25MB -compact
.It 120mb
.It 1.44mb
.It 1.25mb (PC-9801 シリーズのフォーマット形式)
.It 1.2mb
.It 720kb
.El
.Sh パーティション
.Nm
ドライバはディスクに対し、2 つの階層のパーティションが可能です。
一つ目の層は
.Dq スライス層
と呼ばれるもので、ディスク中の
.Tn FreeBSD
領域と、その他のオペレーティングシステムで使用されている領域を分離するた
めに用います。2 つ目は、
.Xr disklabel 5
による純然たる
.Bx 4.4
のパーティショニングの実行で、
.Tn FreeBSD
スライスを独自のファイルシステムに細分するために用いられます。
さらに詳しい事は、
.Xr fdisk 8
や
.Xr disklabel 8
をそれぞれ参照してください。
.Pp
初期化されていないディスクが開かれると、ディスク全体まで及ぶ仮想的な
.Tn FreeBSD
スライスによって、スライステーブルが初期化されます。同様に、初期化され
ていない (あるいは非
.Tn FreeBSD )
スライスが開かれると、ドライブおよびスライス全体を含む単一
.Sq Li c
パーティションによって返されるパラメータで、ディスクラベルが初期化されます。
.Sh 使用例
スライスコードを使うかどうかに依存しますが、LS-120/ZIP ディスクを作る
事は、普通より少しばかり複雑です。LS-120 フロッピは一般的にフロッピ
デバイスと考えられ、スライステーブルを有効にしません。一方、同じドライバ
を用いる Zip ディスクは、ベンダがハードディスクであるとみなしています。
そのため、互換性のために、スライステーブルを使うべきです。
.Pp
このドライバは、スライステーブルを用いるディスクと用いないディスクの、
両タイプのディスクを扱います。しかしその互換性のため、一般的にベンダの特性に
合ったディスクを作るべきです。
.Pp
スライステーブルのない UFS LS-120 ディスクを作るためには、最初にその
ディスクにスライステーブルがないことを確認して下さい。
.Dl # dd if=/dev/zero of=/dev/wfd0 count=16

次に、ディスクラベルを書き込みます。
.Dl # disklabel -rw wfd0 fd120m

そして、普通通り newfs を行います。
.Dl # newfs /dev/rfd0a
.Fi

スタンダードな 1.44mb のフロッピを LS-120 ドライブに作るためには、同様
の手順に従いますが、
.Nm disklabel
コマンドを使う時には
.Ar fd1440
をディスクレイアウトとして使います。
.Sh カーネルの設定
唯一、一つの
.Nm
デバイスが設定ファイルの中に必要です。データ構造は
.Tn IDE
バスで検出されたディスクとして、動的に割り当てられます。
.Sh 注
このドライバは
.Xr wdc 4
IDE/ATAPI ディスクコントローラのドライバにアタッチされます。また、IDE 
コントローラが設定されておらず、カーネル内で有効になっていない限り、動
作しません。
.Sh バグ
フロッピのフォーマットは、まだサポートされていません。
.Pp
このドライバはまだベータバージョンです。もし問題が生じた場合は
.Aq bugs@FreeBSD.org
と作者に報告してください。
.Sh 関連ファイル
.Bl -tag -width /dev/rwfdXXXXX -compact
.It Pa /dev/rwfd Ns Ar u
raw モードの
.Tn ATAPI
フロッピ
.Ar u
は、パーティショニングされていないデバイスとしてアクセスされます。
.Sm off
.It Pa /dev/wfd Ar u Pa s Ar n
.Sm on
ブロックモードの
.Tn ATAPI
フロッピディスクユニット
.Ar u
スライス
.Ar n
は、パーティショニングされていないデバイスとしてアクセスされます。
.Sm off
.It Pa /dev/rwfd Ar u Pa s Ar n
.Sm on
raw モードの
.Tn ATAPI
フロッピディスクユニット
.Ar u
スライス
.Ar n
は、パーティショニングされていないデバイスとしてアクセスされます。
.It Pa /dev/wfd Ns Ar u Ns Ar p
ブロックモードの
.Tn ATAPI
フロッピディスクユニット
.Ar u
の最初の
.Tn FreeBSD
スライスのパーティション
.Ar p
。
.It Pa /dev/rwfd Ns Ar u Ns Ar p
raw モードの
.Tn ATAPI
フロッピディスクユニット
.Ar u
の最初の
.Tn FreeBSD
スライスのパーティション
.Ar p
。
.Sm off
.It Xo
.Pa /dev/wfd Ar u Pa s Ar n Ar p
.Xc
.Sm on
ブロックモードの
.Tn ATAPI
フロッピディスクユニット
.Ar u
の
.No Ar n
番目のスライスに存在するパーティション
.Ar p
。
.Sm off
.It Xo
.Pa /dev/rwfd Ar u Pa s Ar n Ar p
.Xc
.Sm on
raw モードの
.Tn ATAPI
フロッピディスクユニット
.Ar u
の
.No Ar n
番目のスライスに存在するパーティション
.Ar p
。
.El
.Sh 関連項目
.Xr fdisk 1 ,
.Xr wcd 4 ,
.Xr wd 4 ,
.Xr disklabel 5 ,
.Xr disklabel 8
.Sh 作者
.An Junichi\ Satoh\  Aq junichi@jp.FreeBSD.org
.Sh 歴史
.Nm
ドライバは、
.Fx 2.2.6
で最初に現れました。
