Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/fdp-primer/tools/_index.po
Languages: pt_br, ru

source: Tools used in the FreeBSD Documentation Project
pt_br: Ferramentas usadas no Projeto de Documentação do FreeBSD
ru: Инструменты, используемые в проекте документации FreeBSD

source: Chapter 2. Tools
pt_br: Capítulo 2. Ferramentas
ru: Глава 2. Инструменты

source: Tools
pt_br: Ferramentas
ru: Инструменты

source: Several software tools are used to manage the FreeBSD documentation and render it to different output formats. Some of these tools are required and must be installed before working through the examples in the following chapters. Some are optional, adding capabilities or making the job of creating documentation less demanding.
pt_br: Várias ferramentas são utilizadas para gerenciar a documentação do FreeBSD e renderizá-la para diferentes formatos. Algumas dessas ferramentas são necessárias e devem ser instaladas antes de trabalhar com os exemplos nos capítulos a seguir. Algumas são opcionais, adicionando recursos ou tornando a tarefa de criar documentação mais simples.
ru: Для управления документацией FreeBSD и её преобразования в различные выходные форматы используется несколько программных инструментов. Некоторые из них обязательны и должны быть установлены перед работой с примерами из следующих глав. Другие являются опциональными, расширяя возможности или упрощая процесс создания документации.

source: Required Tools
pt_br: Ferramentas Obrigatórias
ru: Необходимые инструменты

source: Install `docproj` _meta-port_ as shown in crossref:overview[overview,the overview chapter] from the Ports Collection. These applications are required to do useful work with the FreeBSD documentation. Some further notes on particular components are given below.
pt_br: Instale o _meta-port_ `docproj` como mostrado no crossref:overview[overview,capítulo de introdução] da coleção de Ports. Estes pacotes são necessários para trabalhar com a documentação do FreeBSD. Informações adicionais específicas de alguns componentes serão informadas abaixo.
ru: Установите `docproj` _мета-порт_, как показано в crossref:overview[overview,обзорной главе] из Коллекции портов. Эти приложения необходимы для работы с документацией FreeBSD. Далее приведены дополнительные заметки об отдельных компонентах.

source: Optional Tools
pt_br: Ferramentas Opcionais
ru: Необязательные инструменты

source: These applications are not required, but can make working on the documentation easier or add capabilities.
pt_br: Essas ferramentas não são necessárias, mas podem facilitar o trabalho na documentação ou adicionar recursos.
ru: Эти приложения не обязательны, но могут упростить работу с документацией или расширить её возможности.

source: Software
ru: Программное обеспечение

source: Vim (package:editors/vim[]) -- a popular editor for working with Asciidoctor.
ru: Vim (package:editors/vim[]) — популярный редактор для работы с Asciidoctor.

source: Both tools include a special mode that reduces the amount of typing needed, and helps to reduce errors.
ru: Оба инструмента включают специальный режим, который сокращает количество необходимых нажатий клавиш и помогает снизить количество ошибок.

source: A popular editor for working with AsciiDoctor.
pt_br: Um editor popular para trabalhar com AsciiDoctor.

source: Both of these editors include a special mode for editing documents. This mode includes commands to reduce the amount of typing needed, and help reduce the possibility of errors.
pt_br: Ambos editores incluem um modo especial para editar documentos. Esse modo inclui comandos para reduzir a quantidade de digitação necessária e ajudar a reduzir a possibilidade de erros.
