<!--
     The FreeBSD Documentation Project

     The FreeBSD Spanish Documentation Project
     %SOURCE% en_US.ISO8859-1/books/handbook/multimedia/chapter.sgml
     %SRCID%    0.0

     $FreeBSD$
-->

<chapter id="multimedia">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Ross</firstname>
	<surname>Lippert</surname>
	<contrib>Editado por </contrib>
      </author>
    </authorgroup>
    <!-- 20 November 2000 -->
  </chapterinfo>

  <title>Multimedia</title>

  <sect1>
    <title>Sinopsis</title>

    <para>&os; admite una gran variedad de tarjetas de sonido,
      lo que permite disfrutar de sonido de alta fidelidad en su
      sistema. &Eacute;sto incluye la posibilidad de grabar y reproducir
      ficheros de audio tanto en los formatos MPEG Audio Layer 3
      (MP3), WAV y Ogg Vorbis, as&iacute; como muchos otros.  
      La Colecci&oacute;n de Ports de &os; contiene tambi&eacute;n
      aplicaciones que le permitir&aacute;n editar audio previamente grabado,
      a&ntilde;adir efectos y controlar dispositivos MIDI.</para>
    

    <para>Tras unas cuantas pruebas podr&aacute; reproducir ficheros de
      video y DVD en &os;.  La cantidad de aplicaciones disponibles
      para codificar, convertir y reproducir los diversos soportes de
      video es m&aacute;s limitada que lo que hay disponible para
      el sonido.  Por ejemplo, en el momento de escribir este texto
      no hay en la Colecci&oacute;n de Ports de &os; una buena
      aplicaci&oacute;n que permita pasar datos de un formato a
      otro, el equivalente a lo que hay en el campo del sonido con
      <filename role="package">audio/sox</filename>.  A pesar de eso
      la situaci&oacute;n en este &aacute;rea est&aacute; cambiando
      r&aacute;pidamente.</para>

    <para>Este cap&iacute;tulo muestra los pasos necesarios para configurar
      una tarjeta de sonido.  La configuraci&oacute;n e instalaci&oacute;n
      de X11 (<xref linkend="x11">) habr&aacute; solucionado ya todos
      los problemas que hubiera podido darle su tarjeta gr&aacute;fica,
      aunque quiz&aacute;s haya alg&uacute;n peque&ntilde;o detalle que 
      a&ntilde;adir para mejorar la reproducci&oacute;n.</para>



    <para>Tras leer &eacute;ste cap&iacute;tulo sabr&aacute; usted:</para>
    <itemizedlist>
      <listitem><para>C&oacute;mo configurar su sistema de modo que su tarjeta
        de sonido sea reconocida por el mismo.</para></listitem> 

      <listitem><para>Confirmar el funcionamiento de su tarjeta usando
        herramientas de muestreo.</para></listitem>

      <listitem><para>C&oacute;mo enfrentarse a problemas de
        configuraci&oacute;n de sonido.</para></listitem>

      <listitem><para>C&oacute;mo reproducir y crear ficheros
        MP3 y otros.</para></listitem>

      <listitem><para>C&oacute;mo gestiona el video el servidor X.</para></listitem>
      <listitem><para>Identificar unos cuantos ports para reproducir y
        codificar video que le dar&aacute;n muy buenos resultados.</para></listitem>
      <listitem><para>C&oacute;mo reproducir DVD y ficheros
        <filename>.mpg</filename> y
	<filename>.avi</filename>.</para></listitem>

      <listitem><para>C&oacute;mo convertir CD y DVD en ficheros
        de datos.</para></listitem>
      <listitem><para>C&oacute;mo configurar una tarjeta de TV.</para></listitem>
      <listitem><para>C&oacute;mo configurar un esc&aacute;ner de
        im&aacute;genes.</para></listitem>
    </itemizedlist>

    <para>Antes de leer &eacute;ste cap&iacute;tulo deber&iacute;a:</para>

    <itemizedlist>
      <listitem><para>Saber configurar e instalar un nuevo kernel (<xref
        linkend="kernelconfig">).</para></listitem>
    </itemizedlist>


    <warning>
      <para>&nbsp;Si intenta montar un cd con &man.mount.8; provocar&aacute;
        (como m&iacute;nimo) un error en el sistema, pero puede
        llegar a provocar un <emphasis>kernel
        panic</emphasis>.  Dichos soportes tienen codificaciones
	especiales sustancialmente diferentes de los t&iacute;picos
	sistemas de ficheros ISO.</para>
    </warning>


  </sect1>



  <sect1 id="sound-setup">
    <sect1info>
      <authorgroup>
        <author>
	 <firstname>Moses</firstname>
	 <surname>Moore</surname>
	 <contrib>Escrito por </contrib>
	 <!-- 20 November 2000 -->
        </author>
      </authorgroup>
      <authorgroup>
        <author>
	 <firstname>Marc</firstname>
	 <surname>Fonvieille</surname>
	 <contrib>Ampliado para &os;&nbsp;5.X por </contrib>
	 <!-- 13 September 2004 -->
        </author>
      </authorgroup>
    </sect1info>

    <title>Configuraci&oacute;n de la tarjeta de sonido</title>
    
  <sect2 id="sound-device">
    <title>Configuraci&oacute;n del sistema </title>

    <indexterm><primary>PCI</primary></indexterm>
    <indexterm><primary>ISA</primary></indexterm>
    <indexterm><primary>sound cards</primary></indexterm>
    <para>Antes de nada tendr&aacute; que saber a ciencia cierta el
      modelo de tarjeta que tiene, qu&eacute; chip utiliza y si es PCI
      o ISA.  &os; admite una amplia variedad de tarjetas, tanto PCI como
      ISA.  Consulte la lista de dispositivos de sonido que puede usar
      en &os; en las <ulink
      url="&rel.current.hardware;">Hardware Notes</ulink>.  Las
      &laquo;Hardware Notes&raquo; le dir&aacute;n tambi&eacute;n
      qu&eacute; controlador es el que hace funcionar su tarjeta.</para>

    <indexterm>
      <primary>kernel</primary>
      <secondary>configuration</secondary>
    </indexterm>

    <para>Para poder usar su dispositivo de sonido en &os; tiene que
      cargar el controlador de dispositivo adecuado, cosa que puede
      hacerse de dos maneras.  La forma m&aacute;s f&aacute;cil es
      cargar el m&oacute;dulo del kernel correspondiente a su tarjeta
      de sonido mediante &man.kldload.8;.  Puede hacerlo en su shell
      con la siguiente orden</para>

    <screen>&prompt.root; <userinput>kldload snd_emu10k1</userinput></screen>

    <para>o a&ntilde;adiendo la l&iacute;nea apropiada al fichero
      <filename>/boot/loader.conf</filename>:</para>

    <programlisting>snd_emu10k1_load="YES"</programlisting>

    <para>Ambos ejemplos son para una tarjeta de sonido
      Creative &soundblaster; Live!.  Encontrar&aacute; una lista de
      m&oacute;dulos de sonido que puede cargar del mismo modo en
      <filename>/boot/defaults/loader.conf</filename>.  Si no est&aacute;
      del todo seguro sobre el controlador que debe usar pruebe con el
      m&oacute;dulo <filename>snd_driver</filename>:</para>

    <screen>&prompt.root; <userinput>kldload snd_driver</userinput></screen>

    <para>Se trata de un &laquo;metacontrolador&raquo; que carga en
      memoria todos los controladores m&aacute;s habituales.  De este modo
      acelerar&aacute; notablemente el proceso de detectar cu&aacute;l es
      el controlador perfecto para su hardware.  Tambi&eacute;n
      puede cargar todos los controladores de sonido desde
      <filename>/boot/loader.conf</filename>.</para>

    <para>Si quiere saber qu&eacute; controlador se corresponde
      con su tarjeta de sonido una vez cargado el &laquo;metadriver&raquo;
      <filename>snd_driver</filename> debe comprobar el contenido de
      <filename>/dev/sndstat</filename> mediante la orden
      <command>cat /dev/sndstat</command>.</para>

    <para>El segundo m&eacute;todo es compilar de forma est&aacute;tica
      el soporte para su tarjeta de sonido dentro de un kernel
      personalizado.  En la siguiente secci&oacute;n encontrar&aacute;
      la informaci&oacute;n necesaria para a&ntilde;adir a su kernel
      el soporte que necesita su hardware.  Para m&aacute;s informaci&oacute;n
      sobre la compilaci&oacute;n de un kernel consulte el <xref
      linkend="kernelconfig">.</para>

    <sect3>
      <title>Configuraci&oacute;n de un kernel personalizado con soporte de sonido</title>

      <para>Lo primero que hay que hacer es a&ntilde;adir el
        controlador del &laquo;framework&raquo; de sonido
	&man.sound.4; al kernel;  tendr&aacute; que a&ntilde;adir
	la siguiente l&iacute;nea a su fichero de configuraci&oacute;n
	del kernel:</para>

      <programlisting>device sound</programlisting>

      <para>Una vez hecho esto tiene que a&ntilde;adir el soporte
        para su tarjeta de sonido.  Evidentemente tendr&aacute; que
	saber exactamente qu&eacute; controlador es el que hace
	funcionar su tarjeta.  Consulte la lista de dispositivos de
	sonido soportados que encontrar&aacute; en las <ulink
	url="&rel.current.hardware;">Hardware Notes</ulink> y elija
	el controlador perfecto para su tarjeta.  Por ejemplo una
	una tarjeta de sonido Creative &soundblaster; Live! usar&aacute;
	el controlador &man.snd.emu10k1.4;.  Siguiendo con el ejemplo,
	si queremos a&ntilde;adir soporte para esta tarjeta agregaremos
	lo siguiente:</para>

      <programlisting>device snd_emu10k1</programlisting>

      <para>Por favor, lea la p&aacute;gina de manual del controlador
        si tiene dudas con la sintaxis.  La sintaxis espec&iacute;fica
	para la configuraci&oacute;n en el kernel de cada tarjeta de
	sonido soportada existente puede encontrarse tambi&eacute;n
	en <filename>/usr/src/sys/conf/NOTES</filename>.</para>

      <para>Las tarjetas ISA no PnP pueden requerir que se le
        facilite al kernel la informaci&oacute;n de la
	configuraci&oacute;n de la tarjeta (IRQ, puerto de E/S, etc).  Esto
	se hace modificando el fichero
	<filename>/boot/device.hints</filename>.  Durante el proceso de
	arranque &man.loader.8; leer&aacute; este fichero y le
	pasar&aacute; los par&aacute;metros al kernel.  Veamos un ejemplo:
	una vieja tarjeta Creative &soundblaster; 16 ISA no PnP
	utilizar&aacute; el controlador &man.snd.sbc.4; junto con
	<literal>snd_sb16</literal>.  En el caso de esta tarjeta
	habr&aacute; que a&ntilde;adir las siguientes l&iacute;neas
	al fichero de configuraci&oacute;n del kernel</para>

      <programlisting>device snd_sbc
device snd_sb16</programlisting>

      <para>y a&ntilde;adir lo siguiente a
	<filename>/boot/device.hints</filename>:</para>

      <programlisting>hint.sbc.0.at="isa"
hint.sbc.0.port="0x220"
hint.sbc.0.irq="5"
hint.sbc.0.drq="1"
hint.sbc.0.flags="0x15"</programlisting>

      <para>La tarjeta del ejemplo usa el puerto de E/S <literal>0x220</literal>
	I/O port y la IRQ <literal>5</literal>.</para>

      <para>La sintaxis a utilizar en
	<filename>/boot/device.hints</filename> se explica en
	la p&aacute;gina de manual de &man.sound.4; y en la del
	controlador en cuesti&oacute;n.</para>

      <para>En el ejemplo se muestran los par&aacute;metros por
        omisi&oacute;n.  En ciertos casos habr&aacute; que usar
	otra IRQ o usar otros par&aacute;metros para hacer funcionar
	la tarjeta de sonido.  Consulte la p&aacute;gina de manual de
	&man.snd.sbc.4; para m&aacute;s informaci&oacute;n sobre esta
	tarjeta.</para>
    </sect3>
  </sect2>

  <sect2 id="sound-testing">
    <title>C&oacute;mo probar su tarjeta de sonido</title>

    <para>Una vez que haya reiniciado con su kernel personalizado, o
      tras cargar el m&oacute;lo del kernel necesario la tarjeta de
      sonido aparecer&aacute; en el b&uacute;fer de mensajes del sistema
      (&man.dmesg.8;); deber&iacute; ser algo muy parecido a esto:</para>

    <screen>pcm0: &lt;Intel ICH3 (82801CA)&gt; port 0xdc80-0xdcbf,0xd800-0xd8ff irq 5 at device 31.5 on pci0
pcm0: [GIANT-LOCKED]
pcm0: &lt;Cirrus Logic CS4205 AC97 Codec&gt;</screen>

    <para>Puede comprobar el estado de la tarjeta de sonido en
      el fichero <filename>/dev/sndstat</filename>:</para>

    <screen>&prompt.root; <userinput>cat /dev/sndstat</userinput>
FreeBSD Audio Driver (newpcm)
Installed devices:
pcm0: &lt;Intel ICH3 (82801CA)&gt; at io 0xd800, 0xdc80 irq 5 bufsz 16384
kld snd_ich (1p/2r/0v channels duplex default)</screen>

    <para>El resultado en su sistema seguramente ser&aacute; distinto.  Si
      no aparecen dispositivos <devicename>pcm</devicename> revise todo el
      proceso a ver d&oacute;nde est&aacute; el error.  Revise su fichero
      de configuraci&oacute;n del kernel nuevamente y compruebe que
      eligi&oacute; el controlador de dispositivo adecuado.  Tiene una
      lista de problemas habituales en la <xref
      linkend="troubleshooting">.</para>

    <para>Si todo ha ido bien ya tiene una tarjeta de sonido funcionando
      en su sistema.  Si los pins de salida de sonido de su CD-ROM o DVD-ROM
      est&aacute;n colocados correctamente puede poner un CD en la unidad
      y reproducirlo con &man.cdcontrol.1;.</para>

      <screen>&prompt.user; <userinput>cdcontrol -f /dev/acd0 play 1</userinput></screen>

    <para>Hay muchas aplicaciones como <filename
      role="package">audio/workman</filename> que le ofrecer&aacute;n
      un interfaz m&aacute;s amigable.  Si quiere escuchar ficheros MP3
      puede instalar, por ejemplo,
      <filename role="package">audio/mpg123</filename>.</para>

    <para>Hay otra via a&uacute;n m&aacute;s r&aacute;pida de probar su
      tarjeta de sonido.  Env&iacute;e datos a
      to <filename>/dev/dsp</filename> del siguiente modo:</para>

    <screen>&prompt.user; <userinput>cat <replaceable>fichero</replaceable> &gt; /dev/dsp</userinput></screen>

    <para>donde <filename><replaceable>fichero</replaceable></filename>
      puede ser cualquier fichero.  Esta orden producir&aacute; ruido,
      lo que confirmar&aacute; que la tarjeta de sonido funciona.</para>

    <para>Puede manejar los niveles de la tarjeta de sonido con &man.mixer.8;.  
      Tiene todos los detalles en la p&aacute;gina de manual de
      &man.mixer.8;.</para>

    <sect3 id="troubleshooting">
      <title>Problemas habituales</title>

      <indexterm><primary>device nodes</primary></indexterm>
      <indexterm><primary>I/O port</primary></indexterm>
      <indexterm><primary>IRQ</primary></indexterm>
      <indexterm><primary>DSP</primary></indexterm>

      <informaltable frame="none" pgwide="1">
         <tgroup cols="2">
  	  <thead>
	    <row>
	     <entry>Error</entry>
	      <entry>Solution</entry>
	    </row>
          </thead>

	  <tbody>
            <row>
              <entry><errorname>sb_dspwr(XX) timed out</errorname></entry>
              <entry><para>El puerto de E/S no ha sido configurado correctamente.</para></entry>
            </row>

            <row>
              <entry><errorname>bad irq XX</errorname></entry>
	      <entry><para>No ha elegido correctamente la IRQ.  Aseg&uacute;rese
  	        de que la IRQ que ha elegido y la IRQ del sonido son la misma.</para></entry>
            </row>

            <row>
              <entry><errorname>xxx: gus pcm not attached, out of memory</errorname></entry>
              <entry><para>No queda memoria suficiente en el sistema para poder
	        usar el dispositivo.</para></entry>
            </row>

            <row>
              <entry><errorname>xxx: can't open /dev/dsp!</errorname></entry>
              <entry><para>Compruebe si hay otra aplicaci&oacute;n utilizando
	        (y por tanto ocupando) el dispositivo.  Escriba
	        <command>fstat | grep dsp</command>.  Los sospechosos
                habituales son <application>esound</application> y
		el sistema de sonido de <application>KDE</application>.
                </para></entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect3>
  </sect2>

  <sect2 id="sound-multiple-sources">
    <sect2info>
     <authorgroup>
      <author>
       <firstname>Munish</firstname>
       <surname>Chopra</surname>
       <contrib>Escrito por </contrib>
      </author>
     </authorgroup>
    </sect2info>
    <title>C&oacute;mo utilizar m&uacute;ltiples fuentes de sonido</title>

    <para>Disponer de m&uacute;ltiples fuentes de sonido puede ser muy
      &uacute;til, por ejemplo cuando
      <application>esound</application> o
      <application>artsd</application> no permiten compartir el dispositivo
      de sonido con otra aplicaci&oacute;n.</para>

    <para>&os; permite hacerlo gracias a los <emphasis>Virtual Sound
      Channels</emphasis> (<literal>canales virtuales de sonido</literal>),
      que se activan mediante &man.sysctl.8;.  Los canales virtuales
      permiten multiplexar la reproducci&oacute;n de sonido de su tarjeta
      mezclando el sonido en el kernel.</para>

    <para>El n&uacute;mero de canales virtuales se configura utilizando
      dos sysctl; como <username>root</username> escriba lo siguiente:</para>
    <screen>&prompt.root; <userinput>sysctl hw.snd.pcm0.vchans=4</userinput>
&prompt.root; <userinput>sysctl hw.snd.maxautovchans=4</userinput></screen>

    <para>En el ejemplo anterior se han creado cuatro canales virtuales, una
      cantidad muy razonable para el uso normal.  
      <varname>hw.snd.pcm0.vchans</varname> es el n&uacute;mero de canales
      virtuales de que dispone <devicename>pcm0</devicename>; puede configurarlo
      en cuanto el dispositivo sea reconocido por el sistema.  
      <literal>hw.snd.maxautovchans</literal> es el n&uacute;mero de canales
      virtuales que se le asignan a un nuevo dispositivo de audio cuando se
      conecta al sistema mediante &man.kldload.8;.  Puesto que el
      m&oacute;dulo <devicename>pcm</devicename> puede cargarse independientemente
      de los controladores de hardware
      <varname>hw.snd.maxautovchans</varname> puede almacenar cu&aacute;ntos
      canales virtuales tienen asignados los dispositivos que se vayan
      conectando al sistema.</para>

    <note>
      <para>No es posible modificar el n&uacute;mero de canales virtuales
        de un dispositivo que est&eacute; en marcha.  Cierre antes todos
	los programas que est&eacute;n utilizando el dispositivo, como
	reproductores de m&uacute;sica o d&aelig;mons de sonido.</para>
    </note>

    <para>Si no usa &man.devfs.5; tendr&aacute; que configurar sus
      aplicaciones para que apunten a
      <filename>/dev/dsp0</filename>.<replaceable>x</replaceable>,
      donde <replaceable>x</replaceable> es un n&uacute;mero entre 0 y 3 si
      <varname>hw.snd.pcm.0.vchans</varname> tiene un valor de 4 como en el
      ejemplo anterior.  Si se estuviera usando
      &man.devfs.5; en el ejemplo anterior cualquier programa que pidiera
      <filename>/dev/dsp0</filename> ser&iacute;a atendido de
      forma totalmente transparente.</para>
   </sect2>

  <sect2>
    <sect2info>
      <authorgroup>
	<author>
	  <firstname>Josef</firstname>
	  <surname>El-Rayes</surname>
	  <contrib>Escrito por </contrib>
	</author>
      </authorgroup>
    </sect2info>

    <title>Asignaci&oacute;n a los canales de mezcla de valores por omisi&oacute;n</title>

    <para>Los valores por defecto de los distintos canales de mezcla
      est&aacute;n fijados en el c&oacute;digo del controlador
      &man.pcm.4;.  Hay distintas aplicaciones y d&aelig;mons
      que le permitir&aacute;n asignar valores al mezclador y que
      permanezcan entre uso y uso, pero no es una soluci&oacute;n
      demasiado limpia.  Puede asignar valores por omisi&oacute;n a
      las mezclas a nivel de controlador definiendo los valores
      apropiados en <filename>/boot/device.hints</filename>.  Veamos
      un ejemplo:</para>

<programlisting>hint.pcm.0.vol="50"</programlisting>

    <para>Esto asignar&aacute; al canal de volumen un valor por
      omisi&oacute;n de 50 al cargar el m&oacute;dulo
      &man.pcm.4;.</para>
  </sect2>
</sect1>


<!-- hemendik -->



  <sect1 id="sound-mp3">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Chern</firstname>
	  <surname>Lee</surname>
	  <contrib>Escrito por </contrib>
	</author>
      </authorgroup>
      <!-- 11 Sept 2001 -->
    </sect1info>

    <title>Sonido MP3</title>

    <para>El formato MP3 (MPEG Layer 3 Audio) llega casi al nivel de
      calidad del CD, por lo que no hay motivo por el deba faltar en
      su escritorio &os;.</para>

    <sect2 id="mp3-players">
      <title>Reproductores de MP3</title>

      <para>El reproductor de MP3 para X11 m&aacute;s extendido
	es, de lejos, <application>XMMS</application> (X Multimedia System).  
	Puede usar en &eacute;l &laquo;skins&raquo;de
	<application>Winamp</application> puesto que el interfaz
	gr&aacute;fico de <application>XMMS</application> es casi
	id&eacute;ntico al de Nullsoft
	<application>Winamp</application>.  
	<application>XMMS</application> incluye tambi&eacute;n soporte nativo
	para &laquo;plug-ins&raquo;.</para>

      <para>Puede instalar <application>XMMS</application> como port 
	(<filename role="package">multimedia/xmms</filename>) o como package.</para>

      <para>La interfaz de <application>XMMS</application> es intuitiva e
	incluye una lista de reproducci&oacute;n, un ecualizador
	gr&aacute;fico y muchas otras cosas.  Si est&aacute; acostumbrado
	a <application>Winamp</application>
	<application>XMMS</application> le ser&aacute; muy
	f&aacute;cil de usar.</para>

      <para>El port <filename role="package">audio/mpg123</filename>
        es un reproductor MP3 que se usa desde la shell.</para>

      <para>Puede especificarle desde la misma l&iacute;nea de &oacute;rdenes
        a <application>mpg123</application> el dispositivo de
        sonido que debe usar y el fichero MP3 que debe reproducir.  Veamos
	un ejemplo:</para>

      <screen>&prompt.root; <userinput>mpg123 -a <replaceable>/dev/dsp1.0</replaceable> ASaber-Grandes…xitos.mp3</userinput>
High Performance MPEG 1.0/2.0/2.5 Audio Player for Layer 1, 2 and 3.
Version 0.59r (1999/Jun/15). Written and copyrights by Michael Hipp.
Uses code from various people. See 'README' for more!
THIS SOFTWARE COMES WITH ABSOLUTELY NO WARRANTY! USE AT YOUR OWN RISK!





Playing MPEG stream from ASaber-Grandes…xitos.mp3 ...
MPEG 1.0 layer III, 128 kbit/s, 44100 Hz joint-stereo
</screen>

      <para>Sustituya <filename><replaceable>/dev/dsp1.0</replaceable></filename>
	por el dispositivo <devicename>dsp</devicename> que haya en su
	sistema.</para>

    </sect2>

    <sect2 id="rip-cd">
      <title>Extracci&oacute;n de pistas de sonido de un CD</title>

      <para>Antes de convirtir una pista o todo un CD a MP3 la informaci&oacute;n
        sonido debe volcarse al disco duro.  Esto se hace convirtiendo
	los datos &laquo;raw CDDA&raquo; (CD Digital Audio) a ficheros
	WAV.</para>

      <para>La herramienta <command>cdda2wav</command>, que forma parte
	del port <filename role="package">sysutils/cdrtools</filename>,
	permite la extracci&oacute;n de informaci&oacute;n de sonido en
	CD as&iacute; como la informaci&oacute;n asociada a &eacute;l.</para>

      <para>Con el CD en la unidad la siguiente orden
	(como <username>root</username>) un CD entero en ficheros WAV
	individuales, uno por pista:</para>

      <screen>&prompt.root; <userinput>cdda2wav -D <replaceable>0,1,0</replaceable> -B</userinput></screen>

      <para><application>cdda2wav</application> soporta unidades CDROM
	ATAPI (IDE).  En el caso de unidades IDE  especifique
	el n&uacute;mero de dispositivo en el lugar correspondiente al
	n&uacute;ro de unidad SCSI.  Por ejemplo, para extraer la pista
	7 desde una unidad IDE:</para>

      <screen>&prompt.root; <userinput>cdda2wav -D <replaceable>/dev/acd0</replaceable> -t 7</userinput></screen>

      <para>La opci&oacute;n
        <option>-D <replaceable>0,1,0</replaceable></option>
	indica el dispositivo SCSI <devicename>0,1,0</devicename>,
	que corresponde con la salida de <command>cdrecord
	-scanbus</command>.</para>

      <para>Para extraer pistas de forma selectiva use la opci&oacute;n 
	<option>-t</option>:</para>

      <screen>&prompt.root; <userinput>cdda2wav -D <replaceable>0,1,0</replaceable> -t 7</userinput></screen>

      <para>Esta opci&oacute;n extrae la s&eacute;ptima pista de un CDROM
        de sonido.  Si quiere extraer un rango de pistas, por ejemplo las
	pistas de la uno a la siete, declare el rango del siguiente
	modo:</para>

      <screen>&prompt.root; <userinput>cdda2wav -D <replaceable>0,1,0</replaceable> -t 1+7</userinput></screen>

      <para>La herramienta &man.dd.1; le permite tambi&eacute;n extraer
        pistas de sonido desde unidades ATAPI; consulte la <xref
	linkend="duplicating-audiocds"> para m&aacute;s
	informaci&oacute;n.</para>

    </sect2>

    <sect2 id="mp3-encoding">
      <title>Codificaci&oacute;n de MP3</title>

      <para>Hoy por hoy el codificador de MP3 por antonomasia es
	<application>lame</application>.  
	Puede encontrar <application>lame</application> en
	<filename role="package">audio/lame</filename>.</para>

      <para>Partiendo de ficheros WAV previamente extraidos la
        siguiente orden convierte
	<filename><replaceable>audio01.wav</replaceable></filename> en
	<filename><replaceable>audio01.mp3</replaceable></filename>:</para>

      <screen>&prompt.root; <userinput>lame -h -b <replaceable>128</replaceable> \
--tt "<replaceable>T&iacute;tulo de copla o cantar</replaceable>" \
--ta "<replaceable>Grupo, solista o coral sinf&oacute;nica</replaceable>" \
--tl "<replaceable>T&iacute;tulo del &aacute;lbum</replaceable>" \
--ty "<replaceable>2001</replaceable>" \
--tc "<replaceable>Autor de la extracci&oacute;n y paso a MP3</replaceable>" \
--tg "<replaceable>Estilo</replaceable>" \
<replaceable>audio01.wav audio01.mp3</replaceable></userinput></screen>

      <para>Los 128&nbsp;kbits pasan por se el est&aacute;ndar de ratio
        de bits de los MP3, aunque puede que usted sea de los que prefieren
	calidades m&aacute;s altas, 160 o incluso 192.  A mayor ratio
	de bits, m&aacute;s espacio en disco necesitar&aacute;, aunque
	la calidad tambi&eacute;n ser&aacute; mayor.  La opci&oacute;n
	<option>-h</option> usa el modo <quote>m&aacute;s calidad pero
	algo m&aacute;s lento</quote>.  Las opciones que empiezan por 
	<option>--t</option> indican etiquetas ID3, que suelen contener
	informaci&oacute;n de la canci&oacute;n que contiene el fichero
	MP3.  Tiene informaci&oacute;n sobre otras opciones de
	codificaci&oacute;n en la p&aacute;gina de manual de
	<application>lame</application>.</para>
    </sect2>

    <sect2 id="mp3-decoding">
      <title>Decodificaci&oacute;n de MP3</title>

      <para>Para grabar un CD de sonido desde ficheros MP3 hay
        que convertirlos a formato WAV no comprimido.  Tanto
	<application>XMMS</application> como
	<application>mpg123</application> soportan la conversi&oacute;n
	de MP3 a un formato de fichero no comprimido.</para>

      <para>Escritura a disco desde <application>XMMS</application>:</para>

      <procedure>
	<step>
	  <para>Arranque <application>XMMS</application>.</para>
	</step>

	<step>
	  <para>Bot&oacute;n derecho del ra&oacute;n en la
	    ventana para acceder al men&uacute; de
	    <application>XMMS</application>.</para>
	</step>

	<step>
	  <para>Elija <literal>Preferences</literal> en
	    <literal>Options</literal>.</para>
	</step>

	<step>
	  <para>Cambie el &laquo;Output Plugin&raquo; a <quote>Disk Writer
	      Plugin</quote>.</para>
	</step>

	<step>
	  <para>Pulse <literal>Configure</literal>.</para>
	</step>

	<step>
	  <para>Elija un directorio en el que guardar los ficheros
	    descomprimidos.</para>
	</step>

	<step>
	  <para>Cargue el fichero MP3 en <application>XMMS</application>
	    de la forma habitual, pero aseg&uacute;rese de tener el
	    volumen al 100% y las opciones de ecualizaci&oacute;n
	    desactivadas.</para>
	</step>

	<step>
	  <para>Pulse <literal>Play</literal> &mdash;  parecer&aacute;
	    que <application>XMMS</application> est&aacute; reproduciendo
	    m&uacute;sica pero no sonar&aacute; nada.  Lo que est&aacute;
	    haciendo es volcar el MP3 a un fichero.</para>
	</step>

	<step>
	  <para>Recuerde que antes de poder volver a escuchar ficheros
	    MP3 de nuevo tendr&aacute; que devolver el &laquo;Plugin de
	    salida&raquo; por omisi&oacute;n a la posici&oacute;n
	    inicial.</para>
	</step>
      </procedure>

      <para>Escritura de la salida est&aacute;ndar en <application>mpg123</application>:</para>

      <procedure>
	<step>
	  <para>Ejecute <command>mpg123 -s <replaceable>audio01.mp3</replaceable>
	    &gt; <replaceable>audio01.pcm</replaceable></command></para>
	</step>
      </procedure>

      <para><application>XMMS</application> genera un fichero WAV,
	mientras que  <application>mpg123</application> convierte MP3 a
	datos de sonido raw PCM.  Puede usar
	<application>cdrecord</application> con ambos formatos para crear
	CD de sonido.  Tendr&aacute; que usar &man.burncd.8; para raw PCM.  
	Si lo que tiene son ficheros WAV escuchar&aacute; un ligero clic
	al principio de cada pista: se trata de la cabecera del fichero
	WAV.  Puede eliminar esta cabecera mediante
	<application>SoX</application> (que puede instalar como port desde
	<filename role="package">audio/sox</filename> o si lo prefiere como
	package):</para>

      <screen>&prompt.user; <userinput>sox -t wav -r 44100 -s -w -c 2 <replaceable>pista.wav pista.raw</replaceable></userinput></screen>

      <para>Consulte la <xref linkend="creating-cds"> para m&aacute;s
        informaci&oacute;n sobre el uso de grabadoras de CD en
	&os;.</para>
    </sect2>
 </sect1>


</chapter>
