<!--
        The FreeBSD Documentation Project
        The FreeBSD French Documentation Project
         
        $FreeBSD$
        Original revision: 1.13
--> 

   <chapter id="introduction">
      <title>Introduction</title>
      &trans.a.haby;
      <para>FreeBSD est une syst&egrave;me d'exploitation bas&eacute; sur 4.4BSD-Lite2 pour 
        les PCs &agrave; base d'architecture Intel (x86) et DEC Alpha. Pour un aper&ccedil;u de FreeBSD,
        reportez-vous &agrave; <link linkend="nutshell">FreeBSD en bref</link>. Pour
	conna&icirc;tre l'histoire du projet, lisez <link linkend="history">Un 
        court historique de FreeBSD</link>. Pour avoir une description de la
        version la plus r&eacute;cente, allez &agrave; la section
	<link linkend="relnotes">A propos de cette version</link>. Si vous
        voulez contribuer d'une fa&ccedil;on ou d'une autre au projet FreeBSD
	(code, mat&eacute;riel, ch&egrave;ques en blanc), voyez s'il vous pla&icirc;t &agrave; la section
	<link linkend="contrib">Contribuer &agrave; FreeBSD</link>.</para>
      
      <sect1 id="nutshell">
	<title>FreeBSD en bref</title>
	
    <para>FreeBSD est un syst&egrave;me d'exploitation en l'&eacute;tat de
      l'art pour les ordinateurs personnels &agrave; base d'architecture &agrave; 
      processeurs Intel, ce qui inclut les processeurs 386, 486 (SX et
      DX) et Pentium ainsi que l'architecture Alpha. Les CPUs
      compatibles Intel d'AMD et Cyrix sont aussi support&eacute;es. FreeBSD
      vous apporte de nombreuses fonctionnalit&eacute;s avanc&eacute;es qui
      n'&eacute;taient jusque-l&agrave; disponibles que sur des ordinateurs beaucoup
      plus on&eacute;reux. Parmi ces fonctionnalit&eacute;s:</para>

	
	  <itemizedlist>
	    
	    <listitem>
	      <para><emphasis>Multi-t&acirc;che pr&eacute;emptif</emphasis> avec
                ajustement dynamique des priorit&eacute;s pour garantir un 
                partage &eacute;quilibr&eacute; et fluide de l'ordinateur entre les
                applications et utilisateurs.</para>
	    </listitem>
	    
	    <listitem>
	      <para>Acc&egrave;s <emphasis>Multi-utilisateurs</emphasis>, ce qui 
                signifie que de nombreuses personnes peuvent utiliser en
                m&ecirc;me temps un syst&egrave;me FreeBSD &agrave; des fins tr&egrave;s diff&eacute;rentes.
                Les p&eacute;riph&eacute;riques tels que les imprimantes ou les lecteurs
                de bandes peuvent &ecirc;tre aussi PARTAGES sans probl&egrave;me entre
                TOUS les utilisateurs du syst&egrave;me.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>R&eacute;seau TCP/IP</emphasis> complet dont le 
                support de SLIP, PPP, NFS et NIS. Cela signifie que votre
                machine FreeBSD peut coop&eacute;rer facilement avec les autres
                syst&egrave;mes ou bien &ecirc;tre utilis&eacute;e
                comme serveur d'entreprise, fournissant
                des fonctions essentielles comme NFS (acc&egrave;s aux fichiers en
                r&eacute;seau) ou le service de courrier &eacute;lectronique, ou encore
                g&eacute;rer l'acc&egrave;s de votre entreprise &agrave; l'Internet gr&acirc;ce aux
                services WWW, ftp, et aux fonctionnalit&eacute;s de routage et de
                coupe-feu (s&eacute;curit&eacute;).</para>
	    </listitem>
	    
	    <listitem>
	      <para>La <emphasis>Protection m&eacute;moire</emphasis> garantit que les
                applications ou les utilisateurs n'interf&egrave;rent pas entre eux.
                Une application qui &ldquo;plante&rdquo; n'affecte en rien les
                autres.</para>
	    </listitem>
	    
	    <listitem>
	      <para>FreeBSD est un syst&egrave;me d'exploitation
                <emphasis>32-bit</emphasis> et a &eacute;t&eacute; con&ccedil;u comme tel d&egrave;s le
                d&eacute;but.</para>
	    </listitem>
	    
	    <listitem>
	      <para>Le standard industriel <emphasis>X Window System</emphasis>
                (X11R6) fournit une interface graphique (&ldquo;Graphical User
                Interface&rdquo;&nbsp;-&nbsp;GUI),
                 moyennant l'achat d'une carte VGA
                ordinaire et d'un moniteur, et est livr&eacute; avec l'int&eacute;gralit&eacute; de
                son code source.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>Compatibilit&eacute; binaire</emphasis> avec de 
                nombreux programmes compil&eacute;s pour SCO, BSDI, NetBSD, Linux et
		386BSD.</para>
	    </listitem>
	    
	    <listitem>
	      <para>Des centaines d'applications 
              <emphasis>pr&ecirc;tes &agrave; l'emploi</emphasis>
	      sont disponibles gr&acirc;ce au catalogue des logiciels 
              <emphasis>port&eacute;s</emphasis> (&ldquo;ports&rdquo;) et au catalogue
              des logiciels <emphasis>pr&eacute;-compil&eacute;s</emphasis> 
              (&ldquo;packages&rdquo;). Pourquoi chercher sur l'Internet alors
              que tout est d&eacute;j&agrave; l&agrave;?</para>
	    </listitem>
	    
	    <listitem>
	      <para>Des milliers d'applications <emphasis>faciles &agrave; 
              porter</emphasis> sont disponibles sur l'Internet. FreeBSD est
              compatible au niveau du code source avec les syst&egrave;mes
              Unix commerciaux les plus r&eacute;pandus et donc il y a peu, sinon 
              aucune modification, &agrave; faire pour les compiler.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>M&eacute;moire virtuelle</emphasis> pagin&eacute;e &agrave; la demande
               et &ldquo;cache unifi&eacute; pour le disque
               et la m&eacute;moire virtuelle&rdquo;; cela
               permet de r&eacute;pondre aux besoins d'applications gourmandes en 
               m&eacute;moire tout en garantissant le temps de r&eacute;ponse aux autres 
               utilisateurs.</para> 
	    </listitem>
	    
	    <listitem>
	      <para>Les <emphasis>Bilioth&egrave;ques partag&eacute;es</emphasis> 
                (l'&eacute;quivalent Unix des DLLs de MS-Windows) permettent une
                utilisation efficace de la m&eacute;moire et du disque.</para>
	    </listitem>
	    
	    <listitem>
	      <para>Des outils complets de d&eacute;veloppement <emphasis>C</emphasis>,
		<emphasis>C++</emphasis> et <emphasis>Fortran</emphasis>. De
                nombreux autres langages pour la recherche de pointe et le
                d&eacute;veloppement sont aussi disponibles dans les catalogues des
                logiciels port&eacute;s et pr&eacute;-compil&eacute;s.</para>
	    </listitem>
	    
	    <listitem>
	      <para>La disponibilit&eacute; du <emphasis>Code source</emphasis> de la 
                totalit&eacute; du syst&egrave;me vous donne tout contr&ocirc;le sur votre
                environnement. Pourquoi &ecirc;tre prisonnier d'une solution
                propri&eacute;taire et d&eacute;pendant de votre fournisseur alors que vous 
                pouvez avoir un vrai Syst&egrave;me Ouvert?</para>
                
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>Documentation en ligne</emphasis> tr&egrave;s 
                compl&egrave;te.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>Et beaucoup d'autres choses 
                encore!</emphasis></para>
	    </listitem>
	    
	  </itemizedlist>
	
	<para>FreeBSD est bas&eacute; sur la version 4.4BSD-Lite2 du &ldquo;Computer
	  Systems Research Group&rdquo; (CSRG) de l'Universit&eacute; de Californie &agrave;
	  Berkeley et continue la tradition de d&eacute;veloppement renomm&eacute;e des 
          syst&egrave;mes BSD. En plus de l'excellent travail fourni par le CSRG, le
          Projet FreeBSD a investi des milliers d'heures de travail pour
          optimiser le syst&egrave;me pour arriver aux meilleures performances et au
          maximum de fiabilit&eacute; sous la charge d'un environnement de production. 
	  Alors que la plupart des g&eacute;ants dans le domaine des syst&egrave;mes 
          d'exploitation pour PC s'acharnent encore 
          &agrave; obtenir de telles possibilit&eacute;s,
          performances et fiabilit&eacute;, FreeBSD peut les offrir
	  <emphasis>d&egrave;s maintenant</emphasis>!</para>
	
	<para>La seule limite aux domaines d'application auxquels FreeBSD peut 
          satisfaire est votre propre imagination. Du d&eacute;veloppement 
          de logiciels &agrave; la production robotis&eacute;e, de la gestion de stocks &agrave;
          la correction d'azimuth pour les antennes satellites; si un
          Unix commercial peut le faire, il y a de tr&egrave;s fortes chances que
          FreeBSD le puisse aussi! FreeBSD b&eacute;n&eacute;ficie aussi 
          de centaines d'applications de haute qualit&eacute; developp&eacute;es par les
          centres de recherche et les universit&eacute;s du monde entier, souvent
          disponibles gratuitement ou presque. Il existe aussi des applications
          commerciales et leur nombre cro&icirc;t de jour en jour.</para>
	
	<para>Comme le code source de FreeBSD lui-m&ecirc;me est globalement
          disponible, le syst&egrave;me peut aussi &ecirc;tre adapt&eacute; sur mesure &agrave; un
          point pratiquement jamais atteint pour des applications ou des
          projets particuliers, d'une fa&ccedil;on qui serait habituellement
          impossible avec les syst&egrave;mes d'exploitation commerciaux de la
          plupart des principaux fournisseurs. Voici juste quelques exemples
          d'applications pour lesquelles FreeBSD est utilis&eacute;:</para>
	
	
	  <itemizedlist>
	    
	    <listitem>
	      <para><emphasis>Services Internet:</emphasis> Les
                 fonctionnalit&eacute;s r&eacute;seau TCP/IP robustes qu'inclut FreeBSD
                 en font la plate-forme id&eacute;ale pour un &eacute;ventail de services
                 Internet, tels que:</para>
		<itemizedlist>
		  
		  <listitem>
		    <para>Serveurs FTP,</para>
		  </listitem>
		  
		  <listitem>
		    <para>Serveurs &ldquo;World Wide Web&rdquo;,</para>
		  </listitem>
		  
		  <listitem>
		    <para>Serveurs Gopher,</para>
		  </listitem>
		  
		  <listitem>
		    <para>Serveurs de courrier &eacute;lectronique,</para>
		  </listitem>
		  
		  <listitem>
		    <para>Serveurs de &ldquo;News 
                        USENET&rdquo;&nbsp;-&nbsp;forums
                        de discussion,</para>
		  </listitem>
		  
		  <listitem>
		    <para>&ldquo;Bulletin Board Systems (BBS)&rdquo;,</para>
		  </listitem>
		  
		  <listitem>
		    <para>Et plus...</para>
		  </listitem>
		  
		</itemizedlist>

	    <para>Vous pouvez facilement commencer petit avec un PC 386 &agrave; bas
                prix et muscler votre configuration au fur et &agrave; mesure que
                votre entreprise grandit.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>Education:</emphasis> Etes-vous &eacute;tudiant en
                informatique ou dans un domaine d'ing&eacute;nierie apparent&eacute;? Il
                n'y a pas de meilleur moyen pour &eacute;tudier les syst&egrave;mes 
                d'exploitation, l'architecture des ordinateurs et les 
                r&eacute;seaux que l'exp&eacute;rience directe et de 
                &ldquo;derri&egrave;re la coulisse&rdquo;
                que FreeBSD peut vous apporter. Il y a aussi un grand nombre
                d'outils math&eacute;matiques, graphiques et de Conception Assist&eacute;e 
                par Ordinateur qui en font en outil tr&egrave;s utile pour ceux qui
                s'int&eacute;ressent aux ordinateurs essentiellement pour faire un
		<emphasis>autre</emphasis> travail!</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>Recherche:</emphasis> Avec le code source de la
                totalit&eacute; du syst&egrave;me disponible, FreeBSD est un excellent outil
                de recherche sur les syst&egrave;mes d'exploitation tout autant que
                pour d'autres branches de l'informatique. Le fait que FreeBSD
                soit librement disponible rend aussi possible l'&eacute;change d'id&eacute;es
                et le d&eacute;veloppement partag&eacute; entre groupes &eacute;loign&eacute;s sans avoir &agrave;
                se pr&eacute;occuper de probl&egrave;mes de licence particuli&egrave;res ou de
                restrictions &agrave; ce qui pourait &ecirc;tre discut&eacute; sur des forums 
                ouverts.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>R&eacute;seau:</emphasis> Il vous faut un nouveau 
		routeur? Un serveur de domaine (DNS)? Un coupe-feu pour tenir
                les gens &agrave; l'&eacute;cart de votre r&eacute;seau interne? FreeBSD peut
                facilement faire de votre vieux 386 ou 486 inutilis&eacute; qui 
                tra&icirc;ne dans un coin un routeur &eacute;volu&eacute; avec des fonctionnalit&eacute;s
                sophistiqu&eacute;es de filtrage de paquets.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>Station de travail X Window:</emphasis> FreeBSD
                est un excellent choix pour faire un terminal X peu co&ucirc;teux,
                soit avec le serveur XFree86 librement disponible, soit avec
                les excellents serveurs commerciaux de X Inside. Au contraire
                d'un terminal X, FreeBSD permet d'ex&eacute;cuter localement, si
                d&eacute;sir&eacute;, un grand nombre d'applications, d&eacute;chargeant ainsi
                le serveur central. FreeBSD peut m&ecirc;me d&eacute;marrer &ldquo;sans
                disque&rdquo;, ce qui permet de concevoir des postes de
                travail individuels moins chers et plus faciles &agrave;
                administrer.</para>
	    </listitem>
	    
	    <listitem>
	      <para><emphasis>D&eacute;veloppement de logiciel:</emphasis> Le syst&egrave;me
                FreeBSD de base inclut un environnement de d&eacute;veloppement
                complet dont les compilateur et d&eacute;bogueur GNU C/C++ 
                r&eacute;put&eacute;s.</para>
	    </listitem>
	    
	  </itemizedlist>
	
	<para>FreeBSD est disponible sous forme de code source ou binaire sur
          CD-ROM ou par ftp anonyme, Voyez <link linkend="mirrors">Se procurer 
	    FreeBSD</link> pour plus de d&eacute;tails.</para>
	
      </sect1>
      
      <sect1 id="history">
	<title>Un court historique de FreeBSD</title>
	
	<para><emphasis>Contribution de &a.jkh;</emphasis>.</para>
	
	<para>Le projet FreeBSD a vu le jour au d&eacute;but de 1993, en partie
          comme extension du &ldquo;Kit de mise &agrave; jour non officiel de 
          386BSD&rdquo; des trois derniers coordinateurs du kit de mise &agrave;
          jour : Nate Williams, Rod Grimes et moi-m&ecirc;me.</para>
	
	<para>Notre objectif de d&eacute;part &eacute;tait de fournir une distribution
          interm&eacute;diaire de 386BSD pour corriger un certain nombre de
          probl&egrave;mes que le m&eacute;canisme du kit de mise &agrave; jour ne permettait
          pas de r&eacute;soudre. Certains d'entre vous se rappellent peut-&ecirc;tre
          que l'intitul&eacute; de travail d'origine du projet &eacute;tait
          &ldquo;386 BSD 0.5&rdquo; ou &ldquo;386BSD Interim&rdquo; en
          r&eacute;f&eacute;rence &agrave; ce probl&egrave;me.</para>
	
	<para>386BSD &eacute;tait le syst&egrave;me d'exploitation de Bill Jolitz, qui
          souffrait assez s&eacute;v&egrave;rement &agrave; ce moment-l&agrave; d'avoir &eacute;t&eacute; n&eacute;glig&eacute;
          presque un an. Comme le kit de mise &agrave; jour enflait de plus
          en plus inconfortablement au fil des jours, nous avons d&eacute;cid&eacute; &agrave;
          l'unanimit&eacute; qu'il fallait faire quelque chose et aider Bill en
          fournissant cette distribution provisoire de &ldquo;remise &agrave; plat&rdquo;.
          Ces projets se sont brutalement interrompus lorsque Bill a d&eacute;cid&eacute;
          de retirer son aval au projet sans dire 
          clairement ce qui serait fait &agrave;
          la place.</para>
	
	<para>Il ne nous a pas fallu longtemps pour d&eacute;cider que l'objectif
          restait valable, m&ecirc;me sans l'adh&eacute;sion de Bill, et nous avons donc
          adopt&eacute; le nom &ldquo;FreeBSD&rdquo;, une proposition de David
          Greenman.  Nos objectifs de d&eacute;part ont &eacute;t&eacute; d&eacute;finis apr&egrave;s avoir
          consult&eacute; les utilisateurs du moment du syst&egrave;me et, d&egrave;s qu'il est
          devenu clair que le projet &eacute;tait parti pour devenir un jour 
          &eacute;ventuellement r&eacute;alit&eacute;, nous avons contact&eacute; Walnut
          Creek CDROM dans l'optique d'am&eacute;liorer la distribution de
          FreeBSD pour le grand nombre de ceux qui n'avaient pas la chance
          de pouvoir acc&eacute;der facilement &agrave; l'Internet. Non seulement Walnut
          Creek CDROM a adopt&eacute; l'id&eacute;e de distribuer FreeBSD sur CD-ROM, mais
          a &eacute;t&eacute; jusqu'&agrave; fournir au projet une machine pour travailler et
          une connexion rapide &agrave; l'Internet. Sans le degr&eacute; pratiquement
          sans pr&eacute;c&eacute;dent de confiance de Walnut Creek CDROM en ce qui n'&eacute;tait
          alors qu'un projet totalement inconnu, il y a peu de chance que
          FreeBSD ait &eacute;t&eacute; aussi loin, aussi vite, que l&agrave; o&ugrave; il en est
          aujourd'hui.</para>
	
	<para>La premi&egrave;re version sur CD-ROM (et sur l'ensemble du Net) fut
          FreeBSD 1.0, parue en D&eacute;cembre 1993. Elle reposait sur la bande
	  4.3BSD-Lite (&ldquo;Net/2&rdquo;) de l'Universit&eacute; de Californie &agrave;
          Berkeley, avec de nombreux composants venant aussi de 386BSD et de
          la &ldquo;Free Software Foundation&rdquo;. Ce fut un 
          succ&egrave;s honn&ecirc;te pour une
          version initiale, qui fut suivi par le franc succ&egrave;s de la version 1.1
          de FreeBSD, publi&eacute;e en Mai 1994.</para> 
	
	<para>A peu pr&egrave;s &agrave; cette &eacute;poque, des nuages mena&ccedil;ants et inattendus
          apparurent lorsque commen&ccedil;a la bataille juridique entre Novell et
          l'U.C. Berkley autour du statut l&eacute;gal de la bande Net/2 de
          Berkeley. Dans les termes de l'accord, l'U.C. Berkeley conc&eacute;dait
          qu'une grande partie de Net/2 &eacute;tait du code &ldquo;prot&eacute;g&eacute;&rdquo;
          et propri&eacute;t&eacute; de Novell, qui l'avait &agrave; son tour rachet&eacute; &agrave;
          AT&amp;T quelque temps auparavant. Berkeley obtint en retour la
          &ldquo;b&eacute;n&eacute;diction&rdquo; de Novell que 4.4BSD-Lite soit, lorsqu'il
          vit finalement le jour, d&eacute;clar&eacute; non prot&eacute;g&eacute; et que tous les 
          utilisateurs de Net/2 soit fortement incit&eacute;s &agrave; migrer. Cela incluait
          FreeBSD, et l'on donna au projet jusqu'&agrave; Juillet 1994 pour mettre un 
          terme &agrave; propre produit bas&eacute; sur Net/2. Selon les termes de cet accord,
          une derni&egrave;re livraison &eacute;tait autoris&eacute;e avant le d&eacute;lai final; ce
          fut FreeBSD 1.1.5.1.</para>
	
	<para>FreeBSD s'attela alors &agrave; la t&acirc;che difficile de litt&eacute;ralement se
          r&eacute;inventer &agrave; partir de fragments totalement nouveaux et assez 
          incomplets de 4.4BSD-Lite. Les versions &ldquo;Lite&rdquo;
          &eacute;taient l&eacute;g&egrave;res (&ldquo;light&rdquo;) en partie parce que le
          CSRG avait retir&eacute; de gros morceaux du code n&eacute;cessaires pour que
          l'on puisse effectivement en faire un syst&egrave;me qui d&eacute;marre (pour
          diff&eacute;rentes raisons l&eacute;gales) et parce que le portage pour Intel
          de la version 4.4 &eacute;tait tr&egrave;s partiel. Il fallu au projet jusqu'&agrave;
	  D&eacute;cembre 1994 pour terminer cette &eacute;tape de transition et FreeBSD 2.0
          parut sur l'Internet et sur CD-ROM en Janvier 1995. Bien qu'elle fut
          encore assez rugueuse aux angles, cette livraison obtint un succ&egrave;s
          significatif et fut suivie par la version 2.0.5 de FreeBSD, plus
          fiable et facile &agrave; installer.</para>
	
	<para>Nous avons publi&eacute; FreeBSD 2.1.5 en Ao&ucirc;t 1996, et il s'av&eacute;ra
          suffisamment populaire chez les fournisseurs d'acc&egrave;s et les 
          utilisateurs professionnels pour qu'une nouvelle version sur
          la branche 2.1-stable soit justifi&eacute;e. Ce fut la version
	  FreeBSD 2.1.7.1, parue en F&eacute;vrier 1997 et qui marque la fin de
          2.1-stable comme branche principale de d&eacute;veloppement. D&egrave;s lors, il
          n'y aurait plus que des am&eacute;liorations quant &agrave; la s&eacute;curit&eacute; et autres
          corrections de bogues critiques sur cette branche, (RELENG_2_1_0),
          pass&eacute;e en phase de maintenance.</para>
	
	<para>La branche FreeBSD 2.2 fut cr&eacute;&eacute;e &agrave; partir de la branche principale
          de d&eacute;veloppement (&ldquo;-current&rdquo;) en Novembre 1996 en tant
          que branche RELENG_2_2, et la premi&egrave;re version compl&egrave;te (2.2.1) parut
          en Avril 1997. Il y eut d'autres versions sur la branche 2.2 &agrave; l'&eacute;t&eacute;
          et &agrave; l'automne 97, la plus r&eacute;cente &eacute;tant la 2.2.7, qui a &eacute;t&eacute; publi&eacute;e
          en Juillet 1998. La premi&egrave;re version officielle 3.0 sortira en
          Octobre 1998 et la derni&egrave;re version sur la branche 2.2, la version
          2.2.8, en Novembre.</para>
	
	<para>Il y eut la cr&eacute;ation d'une nouvelle branche le 20
	  Janvier 1999. Cela donna une branche 4.0-current et une branche
          3.X-stable. De cette derni&egrave;re il y eut la version 3.1 livr&eacute;e le
          15 F&eacute;vrier 1999 et la version 3.2 livr&eacute;e le 25 Mai 1999</para>

	<para>Tous les projets de d&eacute;veloppement &agrave; long terme, de SMP &agrave; la 
          version DEC Alpha, continueront &agrave; se faire sur la branche 4.0-current
          et sur les versions d'instantan&eacute;s de la 4.0 sur CD-ROM (et bien s&ucirc;r
          sur l'Internet).</para>
	
      </sect1>
      
      <sect1 id="goals">
	<title>Les objectifs du projet FreeBSD</title>
	
	<para><emphasis>Contribution de &a.jkh;</emphasis>.</para>
	
	<para>L'objectif du projet FreeBSD est de fournir du logiciel qui
          puisse &ecirc;tre utilis&eacute; &agrave; n'importe quelle fin et sans aucun restriction.
          Nombre d'entre nous sont impliqu&eacute;s de fa&ccedil;on significative dans le
          code (et dans le projet) et ne refuseraient certainement pas une
          petite compensation financi&egrave;re de temps &agrave; autre, mais ce n'est
          certainement pas dans nos intentions d'insister l&agrave; dessus. Nous
          croyons que notre premi&egrave;re et principale &ldquo;mission&rdquo;
          est de fournir du code &agrave; tout le monde, pour n'importe quel projet,
          de fa&ccedil;on &agrave; ce que l'il soit utilis&eacute; le plus possible et avec
          le maximum d'avantages. C'est, nous le pensons, l'un des objectifs
          les plus fondamentaux du Logiciel Libre et l'un de ceux que nous
          soutenons avec enthousiasme.</para>
	
	<para>Le code de l'arborescence des sources, qui est r&eacute;gi par la
          Licence Publique GNU (&ldquo;GNU Public 
          License&rdquo;&nbsp;-&nbsp;GPL) ou 
          la Licence Publique GNU pour les Biblioth&egrave;ques (&ldquo;GNU Library
          Public License&rdquo;&nbsp;-&nbsp;GLPL) impose l&eacute;g&egrave;rement plus de
          contraintes, bien que plut&ocirc;t li&eacute;es &agrave; une disponibilit&eacute; plus grande
          qu'au contraire, comme c'est g&eacute;n&eacute;ralement le cas. En raison des 
          complications suppl&eacute;mentaires qui peuvent r&eacute;sulter de l'utilisation
          commerciale de logiciels GPL, nous essayons, cependant de remplacer
          ces derniers par des logiciels soumis &agrave; la licence BSD qui est plus
          souple, chaque fois que c'est possible.</para>
	
      </sect1>
      
      <sect1 id="development">
	<title>Le mode de d&eacute;veloppement de FreeBSD</title>
	
	<para><emphasis>Contribution de &a.asami;</emphasis>.</para>
	
	<para>Le d&eacute;veloppement de FreeBSD est un processus tr&egrave;s ouvert et 
           tr&egrave;s souple, FreeBSD est litt&eacute;ralement le r&eacute;sultat de 
           contributions de centaines de personnes dans le mode entier,
           ce que refl&egrave;te notre <link linkend="staff">liste des 
           participants</link>. Nous sommes toujours &agrave; l'affut de nouveaux
           d&eacute;veloppeurs et de nouvelles id&eacute;es, et ceux que s'impliquer
           de plus pr&egrave;s int&eacute;resse n'ont besoin que de contacter la 
	   &a.hackers;. Ceux qui pr&eacute;f&egrave;rent travailler de fa&ccedil;on plus 
           ind&eacute;pendante sont aussi accept&eacute;s, et sont libres d'utiliser nos
           possibilit&eacute;s de FTP sur <ulink
	   url="ftp://ftp.freebsd.org/pub/FreeBSD/incoming">ftp.freebsd.org</ulink> 
           pour livrer leurs propres modifications ou sources en cours de
           d&eacute;veloppement. La &a.announce; est aussi disponible pour ceux qui
           veulent faire conna&icirc;tre aux autres utilisateurs de FreeBSD les
           principaux domaines de d&eacute;veloppement en cours.</para>
	
	<para>Quelques points utiles &agrave; conna&icirc;tre &agrave; propos du projet FreeBSD
           et de son processus de d&eacute;veloppement, que vous travailliez 
           ind&eacute;pendamment ou en collaboration &eacute;troite:</para>
	
	  <variablelist>
	    <varlistentry><term>Les archives CVS
		  <anchor id="development-cvs-repository"></term>
	      <listitem>
		<para>L'arborescence centrale des sources de FreeBSD est g&eacute;r&eacute;e
                  sous <ulink
                  url="http://www.cyclic.com/cyclic-pages/CVS-sheet.html">CVS</ulink> (&ldquo;Concurrent Version System&rdquo;), 
                  un syst&egrave;me librement disponible de gestion de
	          version des sources qui est livr&eacute; avec FreeBSD. Les
                  <ulink url="http://www.freebsd.org/cgi/cvsweb.cgi">archives
                  CVS</ulink> d'origine sont sur une machine &agrave; Concord, CA, USA,
                  d'o&ugrave; elles sont r&eacute;pliqu&eacute;es sur de nombreuses machines miroir
                  &agrave; travers le monde. L'arborescence CVS, et les branches 
                   <link linkend="current">-current</link> et <link
		    linkend="stable">-stable</link> qui en sont extraites,
                  peuvent facilement &ecirc;tre dupliqu&eacute;es sur votre propre machine.
                  Reportez-vous &agrave; la section
		  <link linkend="synching">Synchroniser votre arborescence des 
                  sources</link> pour plus d'informations sur la fa&ccedil;on de 
                  proc&eacute;der.</para>
	      </listitem>
	    </varlistentry>
	    
	    <varlistentry><term>La liste des personnes autoris&eacute;es, les &ldquo;commiters&rdquo;
		  <anchor id="development-committers"></term>
	      
	      <listitem>
		<para>Les <link linkend="staff-committers">personnes
                  autoris&eacute;es (&ldquo;committers&rdquo;)</link> sont celles qui
                   ont les droits en
		  <emphasis>&eacute;criture</emphasis> sur l'arborescence CVS, et sont
                  donc autoris&eacute;es &agrave; faire des modifications dans les sources
                  de FreeBSD (le terme &ldquo;committer&rdquo; vient de la 
                  commande
		  <citerefentry><refentrytitle>cvs</refentrytitle><manvolnum>1</manvolnum></citerefentry> <command>commit</command>, que l'on utilise pour
                  reporter des modifications dans les archives CVS). La 
                  meilleure fa&ccedil;on de proposer des modifications pour qu'elles
                  soient valid&eacute;es par les &ldquo;committers&rdquo; est
                  d'utiliser la commande 
                  <citerefentry><refentrytitle>send-pr</refentrytitle><manvolnum>1</manvolnum></citerefentry>, 
                  quoique, s'il semble y avoir un probl&egrave;me avec ce syst&egrave;me, vous
                  pouvez aussi les joindre en envoyant un courrier &eacute;lectronique
                  aux <email>committers@freebsd.org</email>.</para>
	      </listitem>
	    </varlistentry>
	    
	    <varlistentry><term>L'&eacute;quipe de base de 
                  FreeBSD<anchor id="development-core"></term>
	      
	      <listitem>
		<para><link linkend="staff-core">L'&eacute;quipe de base de 
                  FreeBSD</link> serait l'&eacute;quivalent du comit&eacute; de direction
                  si le Projet FreeBSD &eacute;tait une entreprise. La responsabilit&eacute;
                  principale de l'&eacute;quipe de base est de s'assurer que le projet,
                  dans son ensemble, fonctionne correctement et va dans la
                  bonne direction. Proposer &agrave; des d&eacute;veloppeurs impliqu&eacute;s et
                  responsables de rejoindre notre groupe de personnes autoris&eacute;es
                  est une des fonctions de l'&eacute;quipe de base, ainsi que le
                  recrutement de nouveaux membres de l'&eacute;quipe de base quand
                  d'autres s'en vont. La plupart des membres actuels de
                  l'&eacute;quipe de base ont d'abord &eacute;t&eacute; des &ldquo;commiters&rdquo;
                  dont l'attachement au projet a mobilis&eacute; la meilleure part 
                  d'eux-m&ecirc;mes.</para>

		<para>Certains membres de l'&eacute;quipe de base ont aussi leur 
                    propre <link
		    linkend="staff-who">domaine de responsabilit&eacute;</link>,
                    ce qui signifie qu'il leur est d&eacute;volu de veiller &agrave; ce
                    qu'une partie significative du syst&egrave;me satisfasse aux
                    fonctionnalit&eacute;s annonc&eacute;es.</para>

		<note>
		  <para>La plupart des membres de l'&eacute;quipe de base sont 
                    volontaires en ce qui concerne le d&eacute;veloppement de FreeBSD
                     et ne retirent aucun profit financier du projet, donc
                     &ldquo;implication&rdquo; ne doit pas &ecirc;tre compris
                     &ldquo;support garanti&rdquo;. La comparaison pr&eacute;c&eacute;dente
                     avec un comit&eacute; directeur n'est pas tr&egrave;s exacte, et il 
                     serait plus juste de dire que ce sont des gens qui ont
                     sacrifi&eacute; leur vie &agrave; FreeBSD contre toute raison!
		     <!-- smiley --><emphasis>;)</emphasis></para>
		</note>
	      </listitem>
	    </varlistentry>
	    
	    <varlistentry><term>Contributions ext&eacute;rieures</term>
	      
	      <listitem>
		<para>Enfin, mais certainement pas des moindres, le groupe le
                  plus important de d&eacute;veloppeurs est constitu&eacute; par les 
                  utilisateurs eux-m&ecirc;mes qui nous fournissent de fa&ccedil;on quasi
                  r&eacute;guli&egrave;re leur retour d'exp&eacute;rience et leurs corrections de
                  bogues. Le principal moyen d'entrer en contact avec le 
                  d&eacute;veloppement plus d&eacute;centralis&eacute; de FreeBSD est
                  de s'inscrire sur la &a.hackers; (voyez les informations 
                  sur les <link linkend="eresources-mail">listes de 
                  discussion</link>), o&ugrave; ces questions sont abord&eacute;es.</para>

		<para>La <link linkend="contrib-additional">liste</link> de
                  ceux qui ont fourni quelque chose qui a trouv&eacute; son chemin
                  jusqu'&agrave; notre arborescence des sources est longue et 
                  s'accro&icirc;t sans cesse, pourquoi donc ne pas vous y joindre
                  et contribuer &agrave; quelque chose en retour d&egrave;s 
                  aujourd'hui? <!-- smiley --><emphasis>:-)</emphasis></para>

		<para>Fournir du code n'est pas la seule mani&egrave;re de contribuer
                  au projet. Pour avoir une liste plus compl&egrave;te de ce qu'il y
                  a &agrave; faire, voyez s'il vous pla&icirc;t la section
		  <link linkend="contrib">Comment contribuer</link> de ce 
                  manuel.</para>
	      </listitem>
	    </varlistentry>
	  </variablelist>
	
	
	<para>En r&eacute;sum&eacute;, notre mod&egrave;le de d&eacute;veloppement est organis&eacute; comme
          un ensemble relach&eacute; de cercles concentriques. Ce mod&egrave;le centralis&eacute;
          est en place pour la commodit&eacute; des <emphasis>utilisateurs</emphasis>
          de FreeBSD, qui disposent ainsi d'un moyen facile de suivre
          l'&eacute;volution d'une base de code centrale, et non pour tenir &agrave; l'&eacute;cart
          d'&eacute;ventuels participants! Nous souhaitons fournir un syst&egrave;me
          d'exploitation stable avec un nombre cons&eacute;quent de
	  <link linkend="ports">programmes d'application</link> coh&eacute;rents que
          les utilisateurs puissent facilement installer et employer,
          et c'est un mod&egrave;le qui fonctionne tr&egrave;s bien pour cela.</para>
	
	<para>Tout ce que nous attendons de ceux qui se joindraient &agrave; nous
          pour d&eacute;velopper FreeBSD est un peu de la m&ecirc;me implication que les 
          d&eacute;veloppeurs actuels ont vis-&agrave;-vis de sa r&eacute;ussite continue!</para>
	
      </sect1>
      
      <sect1 id="relnotes">
	<title>A propos de cette version</title>
	
	<para>FreeBSD est une version librement disponible et incluant tout
          le code source bas&eacute; sur 4.4BSD-Lite2 pour les PCs &agrave; architecture
	  Intel i386/i486/Pentium/PentiumPro/Pentium II (ou
          compatible) et DEC Alpha . Il est bas&eacute; essentiellement sur
          du logiciel du groupe CSRG de l'Universit&eacute; de Californie &agrave;
          Berkeley, avec des additions venant de NetBSD, OpenBSD, 386BSD,
          et de la &ldquo;Free Software Foundation&rdquo;.</para>

	
	<para>Depuis la publication de FreeBSD 2.0 en Janvier 95, les
          performances, fonctionnalit&eacute;s et la stabilit&eacute; de FreeBSD ont
          &eacute;t&eacute; am&eacute;lior&eacute;es de fa&ccedil;on spectaculaire. La plus grosse modification
          est un gestionnaire de m&eacute;moire virtuelle totalement revu qui
          comprend un cache commun au disque et &agrave; la m&eacute;moire virtuelle, qui
          n'am&eacute;liore pas seulement les performances, mais diminue aussi
          l'occupation de la m&eacute;moire, de telle sorte qu'une configuration avec
          5MB devienne un minimum acceptable. D'autres ajouts concernent le
          support int&eacute;gral des clients et serveurs NIS, le support des
          transactions TCP, les connexions PPP &agrave; la demande, un sous-syst&egrave;me
          SCSI am&eacute;lior&eacute;, un premier support ISDN, les supports des interfaces
          FDDI et &ldquo;Fast Ethernet&rdquo; (100 Mbit), un meilleur support
          du contr&ocirc;leur Adaptec 2940 (Wide et normal) et des centaines de
          corrections de bogues.</para>
	
	<para>Nous avons aussi pris en consid&eacute;ration les commentaires et les
          suggestions de nombre de nos utilisateurs et avons essay&eacute; de 
          fournir ce que nous esp&eacute;rons &ecirc;tre une proc&eacute;dure d'installation
          plus saine et facile &agrave; comprendre. Votre avis en retour 
          sur cette proc&eacute;dure (constamment en &eacute;volution) sera 
          particuli&egrave;rement le bienvenu!</para>
	
	<para>En plus du syst&egrave;me lui-m&ecirc;me, FreeBSD offre un nouveau catalogue
          de logiciels port&eacute;s (&ldquo;ports&rdquo;) qui inclut 
          des centaines de programmes
          habituellement demand&eacute;s. A la fin Avril 1999, il y en avait plus de
          2300! La liste va des serveurs HTTP (WWW) aux jeux, langages,
          &eacute;diteurs et presque tout ce qui existe entre. Le catalogue complet
          des logiciels demande pr&egrave;s de 50MB d'espace disque, les portages se
          pr&eacute;sentant sous forme de &ldquo;delta&rdquo; avec les sources
          d'origine. Cela rend leur mise &agrave; jour bien plus facile, et diminue
          de facon sensible l'espace n&eacute;cessaire par rapport &agrave; l'ancien
          catalogue 1.0. Pour compiler un logiciel port&eacute;, il vous suffit
          d'aller dans le r&eacute;pertoire o&ugrave; il se trouve, de taper
	  <command>make all</command>, puis <command>make install</command>
	  une fois la compilation r&eacute;ussie, et de laisser le syst&egrave;me faire 
          le reste. La distribution originale compl&egrave;te de chaque logiciel est 
          charg&eacute;e dynamiquement depuis le CD-ROM ou un site ftp proche, il vous
          suffit de disposer de suffisamment de place pour compiler le logiciel
          que vous voulez. (Presque) tous les logiciels sont aussi fournis
          sous forme pr&eacute;-compil&eacute;e (&ldquo;package&rdquo;) qui s'installe
          en une seule commande (<command>pkg_add</command>), si vous ne voulez
          pas les compiler &agrave; partir du source.</para>
	
	<para>Il y a un certain nombre d'autres documents qui vous serons
           peut-&ecirc;tre tr&egrave;s utiles &agrave; l'installation et &agrave; l'utilisation de
           FreeBSD, que vous pouvez maintenant trouver dans le r&eacute;pertoire
	   <filename>/usr/share/doc</filename> de n'importe quelle machine
           sous FreeBSD 2.1 ou ult&eacute;rieur. Vous pouvez consulter les manuels
           localement disponibles avec n'importe quel navigateur HTML aux 
	   URLs suivantes:</para>
	
	
	  <variablelist>
	    <varlistentry><term>Le manuel FreeBSD</term>
	      <listitem>
		<para><ulink
		    url="file:/usr/share/doc/handbook/handbook.html">file:/usr/share/doc/handbook/handbook.html</ulink></para>
	      </listitem>
	    </varlistentry>
	    
	    <varlistentry><term>La FAQ FreeBSD</term>
	      
	      <listitem>
		<para><ulink
		    url="file:/usr/share/doc/FAQ/FAQ.html">file:/usr/share/doc/FAQ/FAQ.html</ulink></para>
		
	      </listitem>
	    </varlistentry>
	  </variablelist>
	
	
	<para>Vous pouvez aussi consulter les exemplaires originaux (et les plus
           souvent mis &agrave; jour) sur <ulink
	    url="http://www.freebsd.org">http://www.freebsd.org</ulink>.</para>
	
	<para>Le coeur de FreeBSD ne contient pas de code DES qui en
          emp&ecirc;cherait l'exportation &agrave; l'ext&eacute;rieur des Etats-Unis. Il y a un
          suppl&eacute;ment &agrave; la version de base, utilisable aux Etats-Unis
          uniquement, qui contient les programmes qui utilisent habituellement
          le DES. Les logiciels auxiliaires fournis s&eacute;parement peuvent &ecirc;tre
          utilis&eacute;s par tout le monde. Il y a aussi une version Europ&eacute;enne
          librement exportable (d'ailleurs que des Etats-Unis) du DES pour nos 
          utilisateurs non am&eacute;ricains, qui est d&eacute;crite dans la
	  <ulink url="&url.faq;index.html">FAQ FreeBSD</ulink>.</para>
	
	<para>Si vous ne voulez que des mots de passe s&ucirc;rs, et que vous n'avez 
          pas besoin de copier de mots de passe venant de machines diff&eacute;rentes
	  (des machines Suns, DEC, etc) vers des mots de passe FreeBSD, alors
          l'encodage FreeBSD bas&eacute; sur MD5 est probablement tout ce qu'il vous
          faut. Nous pensons que notre mod&egrave;le de s&eacute;curit&eacute; par d&eacute;faut est mieux
          qu'un concurrent du DES, et il n'est 
          pas encombr&eacute; de tous ces probl&egrave;mes
          d&eacute;licats d'exportation. Si vous &ecirc;tes &agrave; l'ext&eacute;rieur, ou m&ecirc;me aux
          Etats-Unis, essayez-le donc!</para>
	
      </sect1>
    </chapter>


<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-shorttag: nil
     sgml-always-quote-attributes: t
     sgml-minimize-attributes: max
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End:
-->
