Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/faq/_index.po
Languages: nl_nl, ru

source: FreeBSD's documentation offer detailed guidance on both methods, ensuring that users can easily expand their system's capabilities with the software they need.
nl_nl: De documentatie bij FreeBSD geeft gedetailleerde uitleg over beide methoden, zodat gebruikers eenvoudig de mogelijkheden van hun systeem kunnen uitbreiden met de software die zij nodig hebben.
ru: Документация FreeBSD предоставляет подробные руководства по обоим методам, гарантируя, что пользователи смогут легко расширить возможности своей системы с помощью необходимого программного обеспечения.

source: What are the differences between FreeBSD, NetBSD, OpenBSD, and other open source BSD operating systems?
nl_nl: Wat zijn de verschillen tussen FreeBSD, NetBSD, OpenBSD en andere opensource BSD-besturingssystemen?
ru: Каковы различия между FreeBSD, NetBSD, OpenBSD и другими открытыми BSD-операционными системами?

source: FreeBSD, NetBSD, OpenBSD and DragonFly BSD are all part of the open source BSD family, sharing common UNIX-like foundations, but each has its own distinct focus and priorities. These differences reflect the unique goals of each project, and while they share similarities, their specific strengths and emphases cater to different use cases and preferences within the BSD ecosystem.
nl_nl: FreeBSD, NetBSD, OpenBSD en DragonFly BSD zijn allen onderdeel van de opensource BSD-familie en delen de op UNIX gebaseerde uitgangspunten, maar elke variant heeft zijn eigen focus en prioriteiten. De verschillen tonen de unieke doelstellingen van elk project en hoewel ze overeenkomsten hebben, komen hun specifieke sterktes en aandachtsgebieden tegemoet aan verschillende toepassingsgebieden en voorkeuren binnen het BSD-ecosysteem.
ru: FreeBSD, NetBSD, OpenBSD и DragonFly BSD - все они являются частью семейства BSD с открытым исходным кодом, разделяя общие UNIX-подобные основы, но каждый имеет свою собственную направленность и приоритеты. Эти различия отражают уникальные цели каждого проекта, и хотя они имеют сходства, их конкретные сильные стороны и акценты ориентированы на различные сценарии использования и предпочтения в экосистеме BSD.

source: Is FreeBSD a Linux(R) distribution?
nl_nl: Is FreeBSD een Linux(R)-distributie?
ru: Является ли FreeBSD дистрибутивом Linux(R)?

source: No, FreeBSD is *not* a Linux distribution.
nl_nl: Nee, FreeBSD is geen Linux-distributie.
ru: Нет, FreeBSD *не* является дистрибутивом Linux.

source: While both FreeBSD and Linux are UNIX-like operating systems and share many similarities, they have distinct kernels. Linux uses the Linux kernel, whereas FreeBSD uses the FreeBSD kernel, which is based on the Berkeley Software Distribution (BSD) UNIX operating system.
nl_nl: Hoewel zowel FreeBSD als Linux UNIX-achtige besturingssystemen zijn en veel overeenkomsten vertonen, hebben ze verschillende kernels. Linux gebruikt de Linux-kernel, terwijl FreeBSD de FreeBSD-kernel gebruikt, die is gebaseerd op het UNIX-besturingssysteem van de Berkeley Software Distribution (BSD).
ru: Хотя FreeBSD и Linux являются UNIX-подобными операционными системами и имеют много общего, у них разные ядра. Linux использует ядро Linux, тогда как FreeBSD использует ядро FreeBSD, основанное на операционной системе Berkeley Software Distribution (BSD) UNIX.

source: FreeBSD and Linux each have their own unique development communities, release cycles, and system architectures, making them separate and independent operating systems.
nl_nl: FreeBSD en Linux hebben elk hun eigen unieke ontwikkelcommunity, release-cyclus en systeemarchitectuur, waardoor ze verschillende en onafhankelijke besturingssystemen zijn.
ru: FreeBSD и Linux имеют свои уникальные сообщества разработчиков, циклы выпуска версий и архитектуры систем, что делает их отдельными и независимыми операционными системами.

source: FreeBSD provides its own set of advantages, including a different licensing model, system design, and userland utilities compared to Linux distributions.
nl_nl: FreeBSD biedt zijn eigen voordelen, waaronder een ander licentiemodel, systeemontwerp en andere systeem- en hulpprogramma's vergeleken met Linux-distributies.
ru: FreeBSD предоставляет свои собственные преимущества, включая отличную модель лицензирования, дизайн системы и пользовательские утилиты по сравнению с дистрибутивами Linux.

source: Is it possible to run Linux programs on FreeBSD?
nl_nl: Is het mogelijk om Linux-programma's te draaien op FreeBSD?
ru: Возможно ли запускать Linux-программы в FreeBSD?

source: Yes, FreeBSD provides a compatibility layer known as _linuxulator_ (man:linux[4]), allowing many Linux programs to function on FreeBSD. This feature facilitates the execution of a broad spectrum of Linux binaries without the necessity of a dedicated Linux environment.
nl_nl: Ja, FreeBSD biedt een compatibiliteitslaag genaamd _linuxulator_ (man:linux[4]), waarmee veel Linux-programma's uitgevoerd kunnen worden op FreeBSD. Met deze feature kan een breed spectrum aan Linux-binaries worden uitgevoerd zonder dat een speciale Linux-omgeving nodig is.
ru: Да, FreeBSD предоставляет слой совместимости, известный как _linuxulator_ (man:linux[4]), который позволяет многим Linux-программам работать в FreeBSD. Эта функция обеспечивает выполнение широкого спектра Linux-бинарников без необходимости в отдельной Linux-среде.

source: Nevertheless, it's important to note that numerous widely used open-source software *have native FreeBSD versions available* through the ports and packages system.
nl_nl: Het is overigens goed om op te merken dat erg veel opensource software *originele FreeBSD-versies beschikbaar* hebben via het ports and packages-systeem.
ru: Тем не менее, важно отметить, что множество широко используемых программ с открытым исходным кодом *имеют собственные версии для FreeBSD*, доступные через систему портов и пакетов.

source: Installing FreeBSD
nl_nl: FreeBSD installeren
ru: Установка FreeBSD

source: The process of installing FreeBSD is the initial step toward harnessing the power of this robust open-source operating system. This section provides essential information on where to obtain FreeBSD, detailed installation instructions, and insights into concepts like FreeBSD-CURRENT and FreeBSD-STABLE. It also delves into the release and snapshot schedules, post-installation configuration tools, package search methods, and addresses common questions regarding package updates.
nl_nl: Het installeren van FreeBSD is de eerste stap naar het ontplooien van de kracht van dit robuuste opensource besturingssysteem. Dit hoofstuk beschrijft waar u FreeBSD kunt verkrijgen, geeft gedetailleerde installatie-instructies en legt uit wat het verschil is tussen FreeBSD-CURRENT en FreeBSD-STABLE. We duiken ook in de release- en snapshot-planning, configuratietools voor ná de installatie, het zoeken naar pakketten en algemene vragen over pakketupdates.
ru: Процесс установки FreeBSD — это первый шаг к использованию возможностей этой мощной операционной системы с открытым исходным кодом. В этом разделе представлена важная информация о том, где получить FreeBSD, подробные инструкции по установке, а также объяснение таких концепций, как FreeBSD-CURRENT и FreeBSD-STABLE. Также рассматриваются график выпуска релизов и снимков (snapshots), инструменты настройки после установки, методы поиска пакетов и ответы на часто задаваемые вопросы об обновлении пакетов.

source: Where can I get FreeBSD?
nl_nl: Waar kan ik FreeBSD vandaan halen?
ru: Где взять FreeBSD?

source: FreeBSD is freely available for download from the link:https://www.FreeBSD.org/where/[official FreeBSD website].
nl_nl: FreeBSD is vrij verkrijgbaar voor downloaden via link:https://www.FreeBSD.org/where/[official FreeBSD website].
ru: FreeBSD доступна для бесплатной загрузки по ссылке: link:https://www.FreeBSD.org/ru/where/[официальный сайт FreeBSD].

source: Additionally, FreeBSD may also be available through various mirror sites, ensuring accessibility to users worldwide. The link:https://www.FreeBSD.org/where/[official website] is the primary and most reliable source for obtaining the latest FreeBSD releases and updates, making it the ideal starting point for a FreeBSD journey.
nl_nl: Daarnaast is FreeBSD ook beschikbaar via verscheidene mirror-sites, wat het toegankelijkheid maakt voor gebruikers wereldwijd. De link:https://www.FreeBSD.org/where/[official website] is de primaire en meest betrouwbare bron voor het verkrijgen van de laatste release en updates van FreeBSD en is het ideale startpunt om FreeBSD beter te leren kennen.
ru: Кроме того, FreeBSD также может быть доступен через различные зеркальные сайты, что обеспечивает доступность для пользователей по всему миру. Основным и наиболее надежным источником для получения последних выпусков и обновлений FreeBSD является link:https://www.FreeBSD.org/ru/where/[официальный сайт], что делает его идеальной отправной точкой для начала работы с FreeBSD.

source: Where are the instructions for installing FreeBSD?
nl_nl: Waar vind ik installatie-instructies voor FreeBSD?
ru: Где находятся инструкции по установке FreeBSD?

source: Installation instructions can be found at the extref:{handbook}bsdinstall/[Installing FreeBSD Chapter of the Handbook].
nl_nl: Installatie-instructies kunt u vinden in extref:{handbook}bsdinstall/[het hoofdstuk FreeBSD installeren van het Handboek].
ru: Инструкции по установке можно найти в главе extref:{handbook}bsdinstall/[Установка FreeBSD Руководства].

source: What is the FreeBSD-CURRENT concept?
nl_nl: Wat is het concept achter FreeBSD-CURRENT?
ru: Что такое концепция FreeBSD-CURRENT?

source: FreeBSD-CURRENT represents the development branch of the FreeBSD operating system. It is the most cutting-edge version of FreeBSD, where active development takes place.
nl_nl: FreeBSD-CURRENT is de ontwikkelingstak van het FreeBSD besturingssysteem. Het is de meest recente versie van FreeBSD, waar actieve ontwikkelingen in plaatsvinden.
ru: FreeBSD-CURRENT представляет собой ветку разработки операционной системы FreeBSD. Это самая передовая версия FreeBSD, в которой ведётся активная разработка.

source: While it incorporates the latest features, improvements, and experimental changes, it may not always be as stable as the FreeBSD-STABLE or release versions.
nl_nl: Het bevat de laatste functies, verbeteringen en experimentele wijzigingen, maar is niet altijd even stabiel als de FreeBSD-STABLE- of de release-versies.
ru: Хотя он включает последние функции, улучшения и экспериментальные изменения, он не всегда может быть таким стабильным, как FreeBSD-STABLE или релизные версии.

source: FreeBSD-CURRENT serves as a platform for developers and enthusiasts who want to contribute to the future of FreeBSD and stay on the leading edge of its development, even though it may occasionally undergo significant changes and *is not recommended for production systems*.
nl_nl: FreeBSD-CURRENT dient als platform voor ontwikkelaars en enthousiaste gebruikers die willen bijdragen aan de toekomst van FreeBSD en de laatste ontwikkelingen willen volgen, ondanks dat er af en toe grondige wijzigingen plaatsvinden en de versie *niet aanbevolen wordt voor productiesystemen*.
ru: FreeBSD-CURRENT — это платформа для разработчиков и энтузиастов, которые хотят внести свой вклад в будущее FreeBSD и оставаться на переднем крае её разработки, даже несмотря на то, что в ней могут иногда происходить значительные изменения и *она не рекомендуется для производственных систем*.

source: What is the FreeBSD-STABLE concept?
nl_nl: Wat is het concept achter FreeBSD-STABLE?
ru: Что такое концепция FreeBSD-STABLE?

source: The FreeBSD-STABLE branch is a more stable development branch compared to CURRENT. It contains code that is undergoing further testing and refinement before being merged into the RELEASE branch. STABLE is a good choice for those who want to track FreeBSD's development but prefer a more stable environment than CURRENT.
nl_nl: De FreeBSD-STABLE-versie is een stabielere versie dan de CURRENT. De versie bevat code die nog in de testfase is en waar nog aan wordt gewerkt voordat het wordt toegevoegd aan de RELEASE-versie. STABLE is een goede keuze voor diegenen die wel de ontwikkelingen willen volgen, maar liever een stabielere omgeving hebben dan de CURRENT.
ru: Ветка FreeBSD-STABLE — это более стабильная ветка разработки по сравнению с CURRENT. Она содержит код, который проходит дополнительные тестирование и доработку перед слиянием в ветку RELEASE. STABLE — хороший выбор для тех, кто хочет следить за разработкой FreeBSD, но предпочитает более стабильную среду, чем CURRENT.

source: When are FreeBSD releases made of?
nl_nl: Wanneer worden de FreeBSD-versies vrijgegeven?
ru: Когда выходят выпуски FreeBSD?

source: The {re} releases a new major version of FreeBSD about every 18 months and a new minor version about every 8 months, on average. Release dates are announced well in advance, so that the people working on the system know when their projects need to be finished and tested. A testing period precedes each release, to ensure that the addition of new features does not compromise the stability of the release.
nl_nl: De {re} publiceert ongeveer elke 18 maanden een grote versie-update van FreeBSD en ongeveer elke 8 maanden een kleinere update. Publicatiedata worden ruim van tevoren aangekondigd, zodat de mensen die aan het project werken, weten wanneer hun projecten gereed en getest moeten zijn. Een publicatie wordt altijd voorafgegaan door een testperiode om zeker te zijn dat het toevoegen van de nieuwe functies niet de stabiliteit van de bestaande versie in gevaar brengen.
ru: Версия {re} выпускает новую основную версию FreeBSD примерно каждые 18 месяцев и новую промежуточную версию — в среднем каждые 8 месяцев. Даты выпуска объявляются заранее, чтобы разработчики знали, когда их проекты должны быть завершены и протестированы. Перед каждым выпуском проводится период тестирования, чтобы убедиться, что добавление новых функций не нарушает стабильность релиза.

source: When are FreeBSD snapshots made?
nl_nl: Wanneer worden er momentopnames van FreeBSD gemaakt?
ru: Когда создаются снимки состояния FreeBSD?

source: FreeBSD snapshots are typically generated at regular intervals for all actively developed branches. These snapshots capture a moment in time of the FreeBSD source code and associated binary packages. The frequency of these snapshots may vary but is often done on a weekly or bi-weekly basis. These snapshots provide users with an opportunity to access the latest developments and changes in FreeBSD, helping them stay up-to-date with the project's progress.
nl_nl: Voor alle actief ontwikkelde versies van FreeBSD worden met regelmatige tussenpozen momentopnames gegenereerd. Deze momentopnames leggen een moment in de tijd vast van de FreeBSD-broncode en de bijbehorende pakketten. De frequentie van deze momentopnames kan variëren, maar het wordt meestal wekelijks of twee-wekelijks uitgevoerd. De gebruikers krijgen met deze momentopnames toegang tot de laatste ontwikkelingen en wijzigingen in FreeBSD, zodat ze op de hoogte blijven van de voortgang van het project.
ru: Снимки FreeBSD обычно создаются с регулярными интервалами для всех активно разрабатываемых веток. Эти снимки фиксируют состояние исходного кода FreeBSD и связанных с ним бинарных пакетов на определённый момент времени. Частота создания снимков может варьироваться, но обычно они делаются еженедельно или раз в две недели. Эти снимки предоставляют пользователям возможность получить доступ к последним изменениям и разработкам в FreeBSD, помогая им оставаться в курсе прогресса проекта.

source: Is there a tool to perform post-installation configuration tasks?
nl_nl: Is er een tool om na de installatie nog instellingen te wijzigen?
ru: Есть ли инструмент для выполнения задач пост-установочной конфигурации?

source: Yes. man:bsdconfig[8] provides a nice interface to configure FreeBSD post-installation.
nl_nl: Ja. man:bsdconfig[8] biedt een prettige interface om FreeBSD te configureren na de installatie.
ru: Да. man:bsdconfig[8] предоставляет удобный интерфейс для настройки FreeBSD после установки.

source: How can I search for software to install in FreeBSD?
nl_nl: Hoe kan ik in FreeBSD zoeken naar te installeren software?
ru: Как найти программное обеспечение для установки в FreeBSD?

source: Searching for software to install in FreeBSD is made easy through the man:pkg[8] package manager and the `pkg search` command.
nl_nl: In FreeBSD kan met de pakketmanager man:pkg[8] en het commando `pkg search` naar beschikbare software worden gezocht.
ru: Поиск программного обеспечения для установки в FreeBSD упрощается благодаря менеджеру пакетов man:pkg[8] и команде `pkg search`.

source: Users can utilize this command to search for available packages using keywords, package names, or descriptions. This feature helps users quickly locate the software they need within the extensive FreeBSD ports and packages collection, simplifying the process of adding new applications and tools to their FreeBSD systems.
nl_nl: Gebruikers kunnen dit commando toepassen voor het zoeken naar beschikbare pakketten met gebruikmaking van zoekwoorden, pakketnamen of beschrijvingen. Deze functie helpt gebruikers om in de uitgebreide verzameling poorten en pakketten binnen FreeBSD snel de software te vinden die ze nodig hebben. Het toevoegen van nieuwe applicaties en tools aan hun FreeBSD-systeem wordt op deze manier erg eenvoudig.
ru: Пользователи могут использовать эту команду для поиска доступных пакетов по ключевым словам, названиям пакетов или описаниям. Эта функция помогает быстро найти нужное программное обеспечение в обширной коллекции портов и пакетов FreeBSD, упрощая процесс добавления новых приложений и инструментов в систему FreeBSD.

source: Why am I not getting the latest packages in my FreeBSD system?
nl_nl: Waarom krijg ik niet de laatste pakketten in mijn FreeBSD-systeem?
ru: Почему я не получаю последние пакеты в моей системе FreeBSD?

source: The availability of the latest packages in FreeBSD can be influenced by various factors, including the package repository's update frequency and the specific version of FreeBSD being used.
nl_nl: De beschikbaarheid van de meest recente pakketten in FreeBSD wordt beïnvloed door verschillende factoren, zoals de update-frequentie van de pakketarchieven en de gebruikte FreeBSD-versie.
ru: Доступность последних пакетов в FreeBSD может зависеть от различных факторов, включая частоту обновлений репозитория пакетов и используемую версию FreeBSD.

source: It should also be added that there are two branches for the FreeBSD ports. The most updated is called `latest` and the most stable is called `quarterly`. To use the latest packages it will be necessary to configure the `latest` branch. Information on how to configure branches can be found in the link:{handbook}ports/[Ports chapter of the Handbook].
nl_nl: Daarnaast bestaan er twee aftakkingen voor de FreeBSD-poorten. De meest recente is de `latest` en de meest stabiele is de `quarterly`. Om de meest recente pakketten te gebruiken, moet de `latest` aftakking geconfigureerd worden. Informatie over het configureren van aftakkingen is te vinden in link:{handbook}ports/[hoofdstuk Poorten van het Handboek].
ru: Также следует отметить, что для портов FreeBSD существуют две ветки. Наиболее обновляемая называется `latest`, а наиболее стабильная — `quarterly`. Для использования самых свежих пакетов необходимо настроить ветку `latest`. Информацию о настройке веток можно найти в link:{handbook}ports/[главе о портах в Руководстве].

source: Hardware
ru: Оборудование

source: The Hardware section explores FreeBSD's compatibility with various hardware configurations. It covers a range of topics, including supported architectures, maximum RAM capacity, processor scalability, graphics card compatibility, Wi-Fi card support, and the inclusion of 10 Gigabit Ethernet network card support. Whether planning to deploy FreeBSD on servers, workstations, or specialized hardware, this section provides insights into FreeBSD's capabilities and limitations, offering information about hardware choices and configurations.
nl_nl: Het hoofdstuk Hardware beschrijft de compatibiliteit van FreeBSD met verschillende hardwareconfiguraties. Het bevat uiteenlopende onderwerpen, zoals ondersteunde architecturen, maximale RAM-capaciteit, schaalbaarheid van processoren, ondersteunde grafische kaarten, WiFi-kaarten en ondersteuning voor 10 Gigabit Ethernet-netwerkkaarten. Dit hoofdstuk geeft inzicht in de mogelijkheden en beperkingen van FreeBSD en informatie over hardwarekeuzes en -configuraties voor zowel het gebruik van FreeBSD op servers en werkstations als op gespecialiseerde hardware.
ru: В разделе «Оборудование» рассматривается совместимость FreeBSD с различными аппаратными конфигурациями. Он охватывает широкий круг тем, включая поддерживаемые архитектуры, максимальный объем оперативной памяти, масштабируемость процессоров, совместимость с видеокартами, поддержку Wi-Fi-адаптеров, а также работу с сетевыми картами 10 Gigabit Ethernet. Независимо от того, планируется ли развертывание FreeBSD на серверах, рабочих станциях или специализированном оборудовании, этот раздел дает представление о возможностях и ограничениях FreeBSD, предоставляя информацию о выборе и настройке оборудования.

source: What architectures does FreeBSD support?
nl_nl: Welke architecturen ondersteunt FreeBSD?
ru: Какие архитектуры поддерживает FreeBSD?

source: FreeBSD boasts a versatile range of supported architectures, making it a flexible choice for a variety of hardware environments. Its compatibility extends to architectures such as `amd64`, `arm64`, `riscv` and more.
nl_nl: FreeBSD draait op een grote verscheidenheid aan architecturen, waardoor het een flexibele keuze is voor veel hardwareomgevingen. Het is onder andere compatibel met architecturen zoals `amd64`, `arm64` en `riscv`.
ru: FreeBSD поддерживает широкий спектр архитектур, что делает его гибким выбором для различных аппаратных сред. Совместимость распространяется на такие архитектуры, как `amd64`, `arm64`, `riscv` и другие.

source: A complete list of supported architectures can be found on the link:https://www.FreeBSD.org/platforms/[platforms page].
nl_nl: Een complete lijst met architecturen is te vinden op link:https://www.FreeBSD.org/platforms/[pagina platforms].
ru: Полный список поддерживаемых архитектур можно найти на странице link:https://www.FreeBSD.org/platforms/[платформ].

source: How much RAM does FreeBSD support?
nl_nl: Hoeveel RAM ondersteunt FreeBSD?
ru: Сколько оперативной памяти поддерживает FreeBSD?

source: FreeBSD as an operating system generally supports as much physical memory (RAM) as the platform it is running on does. Keep in mind that different platforms have different limits for memory.
nl_nl: FreeBSD ondersteunt als besturingssysteem gewoonlijk net zoveel fysiek geheugen (RAM) als het platform waarop het draait. Houd in gedachten dat verschillende platforms verschillende limieten hebben wat betreft geheugen.
ru: FreeBSD как операционная система обычно поддерживает столько же физической памяти (RAM), сколько и платформа, на которой она работает. Следует учитывать, что разные платформы имеют разные ограничения по памяти.

source: For example, `amd64` platforms support up to 4TB of physical memory.
nl_nl: Amd64-platforms ondersteunen bijvoorbeeld maximaal 4 TB aan fysiek geheugen.
ru: Например, платформы `amd64` поддерживают до 4 ТБ физической памяти.

source: How many processors does FreeBSD support?
nl_nl: Hoeveel processors ondersteunt FreeBSD?
ru: Сколько процессоров поддерживает FreeBSD?
