Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/faq/_index.po
Languages: nl_nl, ru

source: Frequently Asked Questions for FreeBSD
nl_nl: Veelgestelde vragen (FAQ) voor FreeBSD
ru: Часто задаваемые вопросы по FreeBSD

source: Abstract
nl_nl: Samenvatting
ru: Аннотация

source: This is the Frequently Asked Questions (FAQ) for FreeBSD. Every effort has been made to make this FAQ as informative as possible.
nl_nl: Hier vindt u de veelgestelde vragen (FAQ) voor FreeBSD. Er is alles aan gedaan om deze FAQ zo informatief mogelijk te maken.
ru: Это Часто Задаваемые Вопросы (FAQ) по FreeBSD. Были приложены все усилия, чтобы сделать это руководство максимально информативным.

source: Introduction
nl_nl: Introductie
ru: Введение

source: Welcome to the world of FreeBSD! In this section, we provide a comprehensive overview of what FreeBSD is, its origins, goals, use cases, and the community behind it.
nl_nl: Welkom in de wereld van FreeBSD! In dit gedeelte vertellen we uitgebreid wat FreeBSD is, waar het vandaan komt en we bespreken doelstellingen, toepassingen en de community achter FreeBSD.
ru: Добро пожаловать в мир FreeBSD! В этом разделе представлен обзор системы FreeBSD: что это такое, её происхождение, цели, варианты использования и сообщество, стоящее за ней.

source: Discover the reasons behind its name, learn how to contribute to this project, and explore the rich ecosystem of FreeBSD within the context of open-source operating systems.
nl_nl: Ontdek de oorsprong van de naam, lees hoe u kunt bijdragen aan dit project en verken het rijke ecosysteem van FreeBSD binnen de context van opensource besturingssystemen.
ru: Узнайте причины выбора этого названия, научитесь участвовать в разработке проекта и изучите богатую экосистему FreeBSD в контексте открытых операционных систем.

source: What is FreeBSD?
nl_nl: Wat is FreeBSD?
ru: Что такое FreeBSD?

source: FreeBSD is a versatile and open-source UNIX(R)-like operating system known for its exceptional stability, security, and performance. Developed by a dedicated community of volunteers, it's based on the Berkeley Software Distribution (BSD) UNIX operating system.
nl_nl: FreeBSD is een veelzijdig, opensource UNIX(R)-achtig besturingssysteem dat bekend staat om zijn exceptionele stabiliteit, beveiliging en prestaties. Het is gebaseerd op het UNIX besturingssysteem van de Berkeley Software Distribution (BSD) en verder doorontwikkeld door een toegewijde community van vrijwilligers.
ru: FreeBSD — это универсальная и открытая операционная система, подобная UNIX(R), известная своей исключительной стабильностью, безопасностью и производительностью. Разрабатываемая преданным сообществом добровольцев, она основана на операционной системе Berkeley Software Distribution (BSD) UNIX.

source: FreeBSD offers a powerful and customizable environment suitable for a wide range of applications, from servers and embedded systems to desktops and networking equipment. Its commitment to open source principles ensures a transparent and collaborative development process, making FreeBSD a trusted choice for those seeking a reliable and highly adaptable operating system.
nl_nl: FreeBSD biedt een krachtige en naar wens in te stellen omgeving, die geschikt is voor een breed scala aan toepassingen, van servers en embedded systemen tot desktops en netwerkapparatuur. De toewijding aan de opensource principes zorgt voor een transparant en toegankelijk ontwikkelproces. Dit maakt FreeBSD een veilige keuze voor als u op zoek bent naar een betrouwbaar en sterk aanpasbaar besturingssysteem.
ru: FreeBSD предоставляет мощную и настраиваемую среду, подходящую для широкого спектра применений — от серверов и встраиваемых систем до настольных компьютеров и сетевого оборудования. Приверженность принципам открытого исходного кода обеспечивает прозрачный и совместный процесс разработки, что делает FreeBSD надежным выбором для тех, кто ищет стабильную и высокоадаптируемую операционную систему.

source: Why is it called FreeBSD?
nl_nl: Waarom heet het FreeBSD?
ru: Почему система называется FreeBSD?

source: The name "FreeBSD" stems from its roots in the Berkeley Software Distribution (BSD) UNIX operating system, renowned for its contributions to the world of open-source software. The "Free" in FreeBSD signifies its commitment to the principles of free and open-source software, which grant users the freedom to study, modify, and distribute the code.
nl_nl: De naam "FreeBSD" heeft zijn roots in de Berkeley Software Distribution (BSD), een UNIX besturingssysteem, vermaard om zijn bijdragen aan de wereld van de opensource software. Het "Free" in FreeBSD toont de toewijding aan de principes van gratis en opensource software, die gebruikers de vrijheid bieden om de code te bestuderen, aan te passen en te distribueren.
ru: Название "FreeBSD" происходит от его корней в операционной системе UNIX Berkeley Software Distribution (BSD), известной своим вкладом в мир открытого программного обеспечения. Слово "Free" в FreeBSD подчеркивает приверженность принципам свободного и открытого программного обеспечения, которые предоставляют пользователям свободу изучать, изменять и распространять исходный код.

source: It is worth pointing out that the word "free" is being used in two ways here: one meaning "at no cost" and the other meaning "do whatever you like".
nl_nl: Merk op dat het Engelse woord "free" hier op twee manieren wordt gebruikt. In de betekenis van "gratis" en in de betekenis van "doe ermee wat je wilt".
ru: Стоит отметить, что слово «free» здесь используется в двух значениях: одно означает «бесплатно», а другое — «делай что хочешь».

source: What is the goal of the FreeBSD Project?
nl_nl: Wat is het doel van het FreeBSD-project?
ru: Какова цель проекта FreeBSD?

source: The FreeBSD Project has a clear and unwavering goal: to provide a high-quality, open-source UNIX-like operating system that excels in terms of performance, security, and stability.
nl_nl: Het FreeBSD-project heeft een helder en onwrikbaar doel: het bieden van een hoogwaardig, opensource, UNIX-achtig besturingssysteem, dat uitblinkt in prestaties, beveiliging en stabiliteit.
ru: Проект FreeBSD преследует ясную и непоколебимую цель: предоставить высококачественную UNIX-подобную операционную систему с открытым исходным кодом, которая отличается высокой производительностью, безопасностью и стабильностью.

source: It aims to offer a versatile platform suitable for a wide range of computing needs, from servers and workstations to embedded systems and beyond. FreeBSD is developed with a strong commitment to open source principles, fostering a collaborative environment where contributions from a global community of developers help shape and refine the operating system. This dedication to quality, freedom, and reliability is what sets FreeBSD apart and drives its ongoing success as an open-source project.
nl_nl: Het heeft als doel een veelzijdig platform te bieden, dat geschikt is voor een breed scala aan computertoepassingen, van servers en werkstations tot embedded systemen en nog veel meer. FreeBSD is ontwikkeld met een grote toewijding aan de opensource principes, resulterend in een omgeving waar de bijdragen van een wereldwijde community van ontwikkelaars het besturingssysteem vormgeven en definiëren. Deze toewijding aan kwaliteit, vrijheid en betrouwbaarheid is wat FreeBSD onderscheidt en wat het doorlopende succes als opensource project verklaard.
ru: Он стремится предоставить универсальную платформу, подходящую для широкого спектра вычислительных задач — от серверов и рабочих станций до встраиваемых систем и не только. FreeBSD разрабатывается с твердой приверженностью принципам открытого исходного кода, создавая среду для сотрудничества, в которой вклад глобального сообщества разработчиков помогает формировать и совершенствовать операционную систему. Эта приверженность качеству, свободе и надежности отличает FreeBSD и способствует её постоянному успеху как проекта с открытым исходным кодом.

source: What uses cases is FreeBSD good for?
ru: Для каких задач подходит FreeBSD?

source: FreeBSD is a versatile operating system that excels in various use cases. It is particularly well-suited for server environments, where its stability and performance make it a popular choice for web hosting, databases, and networking applications. FreeBSD's robust security features also position it as a strong candidate for firewall and security appliance deployments. Beyond servers, FreeBSD can be tailored to function in specialized environments, including embedded systems and game console devices. Its adaptability, reliability, and open-source nature make FreeBSD a compelling choice for a wide range of computing needs.
nl_nl: FreeBSD is een veelzijdig besturingssysteem dat uitblinkt in verschillende toepassingsgebieden. Het is in het bijzonder geschikt voor servers. De stabiliteit en prestaties van FreeBSD maken het een populaire keuze voor webhosting, databases en netwerktoepassingen. De robuuste beveiligingsfuncties maken het ook een sterke kandidaat voor firewalls en beveiligingstoepassingen. Naast het gebruik als server kan FreeBSD ook op maat worden ingesteld voor gespecialiseerde omgevingen, zoals bijvoorbeeld embedded systemen en game consoles. De aanpasbaarheid, betrouwbaarheid en het opensource karakter maken FreeBSD een aantrekkelijke keuze voor een breed scala aan computertoepassingen.
ru: FreeBSD — это универсальная операционная система, которая превосходно подходит для различных сценариев использования. Она особенно хорошо зарекомендовала себя в серверных средах, где её стабильность и производительность делают её популярным выбором для веб-хостинга, баз данных и сетевых приложений. Надёжные механизмы безопасности FreeBSD также делают её отличным вариантом для развёртывания межсетевых экранов и защищённых устройств. Помимо серверов, FreeBSD может быть адаптирована для работы в специализированных средах, включая встраиваемые системы и игровые консоли. Её гибкость, надёжность и открытый исходный код делают FreeBSD привлекательным выбором для широкого спектра вычислительных задач.

source: Who is responsible for FreeBSD?
nl_nl: Wie is verantwoordelijk voor FreeBSD?
ru: Кто отвечает за FreeBSD?

source: FreeBSD is a community-driven open-source project with a decentralized structure. Its development and maintenance are carried out by a global community of dedicated volunteers, developers, and organizations who collaborate to enhance and expand the operating system.
nl_nl: FreeBSD is een opensource project met een decentrale structuur, ontwikkeld en beheerd door 'de community'. Dit is een wereldwijde gemeenschap van toegewijde vrijwilligers, ontwikkelaars en organisaties die samenwerken om het besturingssysteem te verbeteren en uit te breiden.
ru: FreeBSD - это проект с открытым исходным кодом, развиваемый сообществом и имеющий децентрализованную структуру. Его разработка и поддержка осуществляются глобальным сообществом преданных добровольцев, разработчиков и организаций, которые совместно работают над улучшением и расширением возможностей операционной системы.

source: The key decisions concerning the FreeBSD project, such as the overall direction of the project or who is allowed to add code to the source tree, are made by an elected Core Team of nine people.
nl_nl: Een gekozen kernteam van negen personen neemt de belangrijke beslissingen voor het FreeBSD-project, zoals bijvoorbeeld de algehele richting van het project of wie het is toegestaan om iets toe te voegen aan de broncode.
ru: Ключевые решения, касающиеся проекта FreeBSD, такие как общее направление развития проекта или право на добавление кода в дерево исходных текстов, принимаются избираемой командой разработчиков (Core Team) из девяти человек.

source: This collaborative and community-driven approach has been fundamental to FreeBSD's success and longevity as a reliable and robust UNIX-like operating system.
nl_nl: Deze aanpak, gericht op samenwerking in de community, is de basis voor het succes en het duurzame karakter van FreeBSD als betrouwbaar en robuust UNIX-achtig besturingssysteem.
ru: Этот совместный и ориентированный на сообщество подход был основополагающим для успеха и долголетия FreeBSD в качестве надежной и устойчивой UNIX-подобной операционной системы.

source: How can I contribute to FreeBSD? What can I do to help?
nl_nl: Hoe kan ik bijdragen aan FreeBSD? Wat kan ik doen om te helpen?
ru: Как я могу внести свой вклад в FreeBSD? Чем я могу помочь?

source: We accept all types of contributions: documentation, code, and even art. See the article on extref:{contributing}[Contributing to FreeBSD] for specific advice on how to do this.
nl_nl: We staan open voor allerlei soorten bijdragen: documentatie, coderen en zelfs kunst. Zie het artikel extref:{contributing}[Bijdragen aan FreeBSD] voor specifieke informatie om hiermee aan de slag te gaan.
ru: Мы принимаем все виды вкладов: документацию, код и даже произведения искусства. Конкретные рекомендации о том, как это сделать, смотрите в статье extref:{contributing}[Участие в разработке FreeBSD].

source: And thanks for the thought!
nl_nl: En bedankt voor het meedenken!
ru: И спасибо за идеи!

source: Does the FreeBSD license have any restrictions?
nl_nl: Heeft de FreeBSD-licentie bepaalde restricties?
ru: Есть ли ограничения в лицензии FreeBSD?

source: FreeBSD is distributed under the https://www.FreeBSD.org/copyright/freebsd-license/[BSD License], which is known for its permissive nature.
nl_nl: FreeBSD wordt uitgegeven onder de licentie https://www.FreeBSD.org/copyright/freebsd-license/[BSD License], die bekendstaat om haar tolerante karakter.
ru: FreeBSD распространяется под лицензией https://www.FreeBSD.org/copyright/freebsd-license/[BSD License], известной своим разрешительным характером.

source: This license places very few restrictions on how you can use FreeBSD:
nl_nl: De licentie stelt erg weinig beperkingen aan het gebruik van FreeBSD:
ru: Данная лицензия накладывает очень мало ограничений на использование FreeBSD:

source: Do not claim that you wrote this.
nl_nl: Beweer niet dat je dit geschreven hebt.
ru: Не утверждайте, что это написали вы.

source: Do not sue us if it breaks.
nl_nl: Klaag ons niet aan als het uitvalt.
ru: Не подавайте на нас в суд, если что-то сломается.

source: Do not remove or modify the license.
nl_nl: Verwijder of verander de licentie niet.
ru: Не удаляйте и не изменяйте лицензию.

source: The license means you are free to modify, distribute, and even sell FreeBSD without *being required to release your modifications as open source*. However, there are some minimal conditions, such as retaining the original copyright notice and disclaimers when distributing FreeBSD. Overall, the BSD License provides a high degree of freedom and flexibility, making FreeBSD an attractive choice for a wide range of applications and projects.
nl_nl: De licentie houdt in dat u FreeBSD vrij mag wijzigen, distribueren en zelfs mag verkopen zonder *verplicht te zijn om de wijzigingen te publiceren als opensource*. Er zijn echter enkele minimale voorwaarden voor het distribueren van FreeBSD, zoals het behoud van de originele copyrightmelding en de vrijwaringen. De BSD-licentie biedt dus een grote mate van vrijheid en flexibiliteit, wat FreeBSD een aantrekkelijke keuze maakt voor een breed scala aan toepassingen en projecten.
ru: Лицензия означает, что вы можете свободно изменять, распространять и даже продавать FreeBSD, *не будучи обязанным публиковать свои изменения как открытый исходный код*. Однако есть несколько минимальных условий, таких как сохранение оригинального уведомления об авторских правах и отказ от гарантий при распространении FreeBSD. В целом, лицензия BSD предоставляет высокую степень свободы и гибкости, что делает FreeBSD привлекательным выбором для широкого спектра приложений и проектов.

source: Code in our source tree which falls under the https://www.FreeBSD.org/copyright/COPYING[GNU General Public License (GPL)] or https://www.FreeBSD.org/copyright/COPYING.LIB[GNU Library General Public License (LGPL)] comes with slightly more strings attached though, at least on the side of enforced access rather than the usual opposite.
nl_nl: Programmacode in onze broncode, die valt onder de licentie https://www.FreeBSD.org/copyright/COPYING[GNU General Public License (GPL)] of https://www.FreeBSD.org/copyright/COPYING.LIB[GNU Library General Public License (LGPL)] heeft wat meer voeten in de aarde, tenminste als het gaat om afgedwongen toegang, vergeleken met het gebruikelijke tegengestelde.
ru: Код в нашем дереве исходников, подпадающий под действие https://www.FreeBSD.org/copyright/COPYING[GNU General Public License (GPL)] или https://www.FreeBSD.org/copyright/COPYING.LIB[GNU Library General Public License (LGPL)], сопровождается несколько большими ограничениями, по крайней мере, в части обеспечения доступа, в отличие от обычной противоположной ситуации.

source: Can FreeBSD replace my current operating system?
nl_nl: Kan FreeBSD mijn huidige besturingssysteem vervangen?
ru: Может ли FreeBSD заменить мою текущую операционную систему?

source: For many users and administrators, yes. But this question is not quite that cut-and-dried.
nl_nl: Voor veel gebruikers en beheerders is het antwoord daarop ja. Maar deze vraag is wat te eenvoudig gesteld.
ru: Для многих пользователей и администраторов — да. Но этот вопрос не настолько однозначен.

source: FreeBSD is a powerful and versatile operating system that can replace or coexist with many other operating systems, depending on users and administrators specific needs. However, whether FreeBSD can replace your current operating system depends on factors such as your hardware, software requirements, and familiarity with FreeBSD.
nl_nl: FreeBSD is een krachtig en veelzijdig besturingssysteem dat prima naast of in plaats van een ander besturingssysteem geïnstalleerd kan worden, afhankelijk van de specifieke wensen van de gebruiker of beheerder. Of FreeBSD uw huidige besturingssysteem kan vervangen, hangt af van factoren zoals het type hardware, softwarevereisten en vertrouwdheid met FreeBSD.
ru: FreeBSD — это мощная и универсальная операционная система, которая может заменить или сосуществовать с множеством других операционных систем в зависимости от конкретных потребностей пользователей и администраторов. Однако возможность замены вашей текущей операционной системы на FreeBSD зависит от таких факторов, как ваше оборудование, требования к программному обеспечению и уровень знакомства с FreeBSD.

source: While it offers a robust and feature-rich alternative, it's essential to evaluate your specific use case and compatibility requirements before making the switch.
nl_nl: Het biedt een robuust alternatief met zeer veel mogelijkheden, maar het is essentieel dat u uw eigen specifieke situatie en eisen onderzoekt voordat u de overstap maakt.
ru: Хотя она предлагает надежную и многофункциональную альтернативу, важно оценить ваши конкретные задачи и требования к совместимости перед переходом.

source: If an application is only available on one operating system, that operating system cannot just be replaced.
nl_nl: Als een bepaald programma slechts beschikbaar is voor één besturingssysteem, kan dat besturingssysteem niet zomaar worden vervangen.
ru: Если приложение доступно только в одной операционной системе, эту операционную систему нельзя просто заменить.

source: Users migrating to FreeBSD from another UNIX-like environment will find FreeBSD to be similar. Non-UNIX users, like Windows(R) users, should expect to invest some additional time learning the UNIX way of doing things.
nl_nl: Gebruikers die vanaf een andere UNIX-achtige omgeving overstappen naar FreeBSD, zullen weinig verrassingen ondervinden. Niet-UNIX-gebruikers, bijvoorbeeld Windows-gebruikers, zullen wat meer tijd moeten steken in het leren kennen van de UNIX-omgeving en werkwijze.
ru: Пользователи, переходящие на FreeBSD из другой UNIX-подобной среды, найдут FreeBSD похожей. Пользователи, не знакомые с UNIX, например пользователи Windows(R), должны быть готовы потратить дополнительное время на изучение принципов работы UNIX.

source: Can FreeBSD run popular open source software?
nl_nl: Draait populaire opensource software wel op FreeBSD?
ru: Может ли FreeBSD запускать популярное открытое программное обеспечение?

source: Yes, FreeBSD is well-suited for running popular open source software. Its compatibility with a wide range of applications and libraries makes it a favorable choice for those looking to deploy and use open source software packages. FreeBSD provides a robust and stable environment that supports various programming languages, databases, web servers, and other software commonly used in the open source community. Its ports and packages system simplifies the installation and management of such software, ensuring that users can easily access and run their favorite open source tools and applications on FreeBSD with minimal hassle.
nl_nl: Ja, FreeBSD is goed uitgerust voor het uitvoeren van populaire opensource software. Het is compatibel met een breed scala aan applicaties en bibliotheken, wat het een favoriete keuze maakt voor degenen die graag opensource software willen gebruiken. FreeBSD biedt een robuuste en stabiele omgeving met ondersteuning voor diverse programmeertalen, databases, webservers en andere software die veel wordt gebruikt in de opensource-community. Het systeem van poorten en pakketten vereenvoudigt de installatie en het beheer van dergelijke software, zodat gebruikers met heel weinig moeite hun favoriete opensource tools en programma's kunnen draaien op FreeBSD.
ru: Да, FreeBSD хорошо подходит для запуска популярного открытого программного обеспечения. Его совместимость с широким спектром приложений и библиотек делает его предпочтительным выбором для тех, кто хочет развертывать и использовать пакеты открытого ПО. FreeBSD предоставляет надежную и стабильную среду, поддерживающую различные языки программирования, базы данных, веб-серверы и другое ПО, часто используемое в сообществе открытого исходного кода. Система портов и пакетов FreeBSD упрощает установку и управление таким ПО, гарантируя, что пользователи могут легко получить доступ и запускать свои любимые открытые инструменты и приложения на FreeBSD с минимальными трудностями.

source: How can I install software in FreeBSD?
nl_nl: Hoe installeer ik software in FreeBSD?
ru: Как установить программное обеспечение в FreeBSD?

source: FreeBSD offers multiple methods for software installation. One of the most common methods involves using the built-in man:pkg[8] package manager, which simplifies the process by fetching and installing pre-built binary packages. Another approach is to compile and install software from source code using the man:ports[7] collection, providing a flexible and customizable way to install software.
nl_nl: FreeBSD biedt meerdere methoden voor het installeren van software. Een van de meest gebruikte methoden is het gebruik van de ingebouwde man:pkg[8] package manager, die het proces vereenvoudigt door vooraf gebouwde binaire pakketten op te halen en te installeren. Een andere benadering is het compileren en installeren van software vanuit broncode via de man:ports[7] collectie. Deze methode is flexibel en biedt mogelijkheden om de software op maat te installeren.
ru: FreeBSD предоставляет несколько методов установки программного обеспечения. Один из наиболее распространённых методов — использование встроенного менеджера пакетов man:pkg[8], который упрощает процесс, загружая и устанавливая предварительно собранные бинарные пакеты. Другой подход — компиляция и установка программ из исходного кода с использованием коллекции man:ports[7], что обеспечивает гибкий и настраиваемый способ установки программного обеспечения.
