Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/faq/_index.po
Languages: nl_nl, ru

source: If you are still prompted to give the `root` password when entering the single-user mode, it means that the console has been marked as `insecure` in [.filename]#/etc/ttys#. In this case, it will be required to boot from a FreeBSD installation disk, choose the [.guimenuitem]#Live CD# or [.guimenuitem]#Shell# at the beginning of the install process and issue the commands mentioned above. Mount the specific partition in this case and then chroot to it. For example, replace `mount -urw /` with `mount /dev/ada0p1 /mnt; chroot /mnt` for a system on _ada0p1_.
nl_nl: Als u nog steeds wordt gevraagd het `root` wachtwoord in te voeren als u naar single-user-mode gaat, dan is de console aangemerkt als `insecure` in [.filename]#/etc/ttys#. In dat geval moet u opstarten van een FreeBSD installatieschijf, vervolgens aan het begin van het installatieproces kiezen voor de [.guimenuitem]#Live CD# of de [.guimenuitem]#Shell# en bovenstaande commando's geven. Mount in dit geval de specifieke partitie en ga hier met chroot naartoe. Vervang bijvoorbeeld `mount -urw /` met `mount /dev/ada0p1 /mnt; chroot /mnt` als het systeem zich op _ada0p1_ bevindt.
ru: Если при входе в однопользовательский режим всё ещё запрашивается пароль `root`, это означает, что консоль помечена как `insecure` в [.filename]#/etc/ttys#. В этом случае потребуется загрузиться с установочного диска FreeBSD, выбрать [.guimenuitem]#Live CD# или [.guimenuitem]#Shell# в начале процесса установки и выполнить указанные выше команды. Смонтируйте конкретный раздел в этом случае и затем выполните chroot для него. Например, замените `mount -urw /` на `mount /dev/ada0p1 /mnt; chroot /mnt` для системы на _ada0p1_.

source: If the root partition cannot be mounted from single-user mode, it is possible that the partitions are encrypted and it is impossible to mount them without the access keys. For more information see the section about encrypted disks in the FreeBSD extref:{handbook}disks/[Handbook, disks-encrypting].
nl_nl: Als de root-partitie niet vanuit single-user-mode gemount kan worden, zijn de partities mogelijk beveiligd en is het onmogelijk ze te mounten zonder toegangscode. Zie voor meer informatie het hoofdstuk over beveiligde schijven in het FreeBSD extref:{handbook}disks/[Handboek, schijfbeveiliging].
ru: Если корневой раздел не удаётся смонтировать в однопользовательском режиме, возможно, разделы зашифрованы, и их невозможно смонтировать без ключей доступа. Дополнительную информацию см. в разделе о зашифрованных дисках в extref:{handbook}disks/[Handbook, disks-encrypting].

source: I made a mistake in rc.conf, or another startup file, and now I cannot edit it because the file system is read-only. What should I do?
nl_nl: Ik heb een fout gemaakt in rc.conf of een ander opstartbestand en nu kan ik het niet meer bewerken, omdat het bestandssysteem alleen-lezen is. Wat kan ik doen?
ru: Я допустил ошибку в rc.conf или другом стартовом файле, и теперь не могу его отредактировать, потому что файловая система доступна только для чтения. Что мне делать?

source: Restart the system using `boot -s` at the loader prompt to enter single-user mode. When prompted for a shell pathname, press kbd:[Enter] and run `mount -urw /` to re-mount the root file system in read/write mode. You may also need to run `mount -a -t ufs` to mount the file system where your favorite editor is defined. If that editor is on a network file system, either configure the network manually before mounting the network file systems, or use an editor which resides on a local file system, such as man:ed[1].
nl_nl: Start het systeem opnieuw op met `boot -s` in de loader-prompt om naar single-user-mode te gaan. Wanneer gevraagd wordt naar een padnaam voor de shell, drukt u op kbd:[Enter] en typt u `mount -urw /` om het root bestandssysteem te remounten in lees/schrijf-modus. U moet mogelijk ook `mount -a -t ufs` uitvoeren om het bestandssysteem te mounten waar uw favoriete editor is geconfigureerd. Als het bestandssysteem van de editor zich op het netwerk bevindt, configureert u handmatig het netwerk voordat de bestandssystemen op het netwerk worden gemount of u gebruikt een editor die zich op een lokaal bestandssysteem bevindt, zoals man:ed[1].
ru: Перезагрузите систему, используя `boot -s` в приглашении загрузчика, чтобы войти в однопользовательский режим. При запросе пути к оболочке нажмите kbd:[Enter] и выполните `mount -urw /`, чтобы перемонтировать корневую файловую систему в режиме чтения/записи. Также может потребоваться выполнить `mount -a -t ufs` для монтирования файловой системы, где находится ваш предпочитаемый редактор. Если этот редактор находится на сетевой файловой системе, либо настройте сеть вручную перед монтированием сетевых файловых систем, либо используйте редактор, расположенный на локальной файловой системе, например, man:ed[1].

source: In order to use a full screen editor such as man:vi[1] or man:emacs[1], run `export TERM=xterm` so that these editors can load the correct data from the man:termcap[5] database.
nl_nl: Om een full screen editor zoals man:vi[1] of man:emacs[1] te gebruiken, voert u `export TERM=xterm` uit, zodat deze editors de juiste gegevens kunnen ophalen uit de man:termcap[5] database.
ru: Чтобы использовать полноэкранные редакторы, такие как man:vi[1] или man:emacs[1], выполните команду `export TERM=xterm`, чтобы эти редакторы могли загрузить корректные данные из базы man:termcap[5].

source: After performing these steps, edit [.filename]#/etc/rc.conf# to fix the syntax error. The error message displayed immediately after the kernel boot messages should indicate the number of the line in the file which is at fault.
nl_nl: Na het uitvoeren van deze stappen, bewerkt u [.filename]#/etc/rc.conf# om de syntaxfout te corrigeren. De foutmelding die wordt weergegeven direct na de opstartmeldingen van de kernel, zou het regelnummer moeten aangeven in het bestand waar de fout in optreedt.
ru: После выполнения этих действий отредактируйте файл [.filename]#/etc/rc.conf#, чтобы исправить синтаксическую ошибку. Сообщение об ошибке, отображаемое сразу после сообщений загрузки ядра, должно указывать номер строки в файле, в которой допущена ошибка.

source: How much free memory is available?
nl_nl: Hoeveel vrij geheugen is er beschikbaar?
ru: Сколько свободной памяти доступно?

source: There are a couple of kinds of "free memory". The most common is the amount of memory immediately available without reclaiming memory already in use. That is the size of the free pages queue plus some other reserved pages. This amount is exported by the `vm.stats.vm.v_free_count` man:sysctl[8], shown, for instance, by man:top[1]. Another kind of "free memory" is the total amount of virtual memory available to userland processes, which depends on the sum of swap space and usable memory. Other kinds of "free memory" descriptions are also possible, but it is relatively useless to define these, but rather it is important to make sure that the paging rate is kept low, and to avoid running out of swap space.
nl_nl: Er zijn verschillende soorten "vrij geheugen". Het meest gebruikelijke is de hoeveelheid geheugen die direct beschikbaar is, zonder geheugen terug te claimen die al in gebruik is. Dat is de grootte van de wachtrij met vrije pagina's plus wat andere gereserveerde pagina's. Deze hoeveelheid wordt geëxporteerd door `vm.stats.vm.v_free_count` man:sysctl[8], weergegeven door bijvoorbeeld man:top[1]. Een ander soort "vrij geheugen" is de totale hoeveelheid virtueel geheugen beschikbaar voor userland-processen, die afhangt van de totale swapruimte en het bruikbaar geheugen. ther kinds of "free memory" descriptions are also possible, but it is relatively useless to define these, but rather it is important to make sure that the paging rate is kept low, and to avoid running out of swap space.
ru: Существует несколько видов "свободной памяти". Наиболее распространенный - это объем памяти, который доступен немедленно, без освобождения уже используемой памяти. Это размер очереди свободных страниц плюс некоторые другие зарезервированные страницы. Этот объем отображается через `vm.stats.vm.v_free_count` man:sysctl[8] и, например, выводится man:top[1]. Другой вид "свободной памяти" - это общий объем виртуальной памяти, доступной пользовательским процессам, который зависит от суммы swap-пространства и используемой памяти. Возможны и другие определения "свободной памяти", но их описание относительно бесполезно; гораздо важнее следить за тем, чтобы частота подкачки оставалась низкой, и избегать исчерпания swap-пространства.

source: My time is wrong, how can I change the timezone?
nl_nl: Mijn tijd klopt niet, hoe kan ik de tijdzone veranderen?
ru: Мое время указано неверно, как я могу изменить часовой пояс?

source: Use man:tzsetup[8].
nl_nl: Via man:tzsetup[8].
ru: Используйте man:tzsetup[8].

source: FreeBSD uses a lot of swap space even when the computer has free memory left. Why?
nl_nl: FreeBSD gebruikt veel swapruimte, terwijl de computer veel vrij geheugen heeft. Waarom?
ru: FreeBSD использует много swap-пространства, даже когда в компьютере остаётся свободная память. Почему?

source: FreeBSD will proactively move entirely idle, unused pages of main memory into swap in order to make more main memory available for active use. This heavy use of swap is balanced by using the extra free memory for caching.
nl_nl: FreeBSD verplaatst proactief complete niet-gebruikte pagina's van het hoofdgeheugen naar swap om meer hoofdgeheugen beschikbaar te maken voor actief gebruik. Dit extra gebruik van swap wordt in evenwicht gehouden door het extra vrije geheugen te gebruiken als cache.
ru: FreeBSD активно перемещает полностью неиспользуемые страницы основной памяти в своп, чтобы освободить больше основной памяти для активного использования. Такое активное использование свопа компенсируется за счет использования дополнительной свободной памяти для кэширования.

source: Note that while FreeBSD is proactive in this regard, it does not arbitrarily decide to swap pages when the system is truly idle. Thus, the system will not be all paged out after leaving it idle overnight.
nl_nl: Er zijn verschillende soorten "vrij geheugen". Het meest gebruikelijke is de hoeveelheid geheugen die direct beschikbaar is, zonder geheugen terug te claimen die al in gebruik is. Dat is de grootte van de wachtrij met vrije pagina's plus wat andere gereserveerde pagina's. Deze hoeveelheid wordt geëxporteerd door `vm.stats.vm.v_free_count` man:sysctl[8], weergegeven door bijvoorbeeld man:top[1]. Een ander soort "vrij geheugen" is de totale hoeveelheid virtueel geheugen beschikbaar voor userland-processen, die afhangt van de totale swapruimte en het bruikbaar geheugen. ther kinds of "free memory" descriptions are also possible, but it is relatively useless to define these, but rather it is important to make sure that the paging rate is kept low, and to avoid running out of swap space.
ru: Обратите внимание, что хотя FreeBSD активно работает в этом направлении, она не принимает произвольных решений о выгрузке страниц, когда система действительно простаивает. Таким образом, система не будет полностью выгружена в своп после простоя в течение ночи.

source: Why does top show very little free memory even when I have very few programs running?
nl_nl: Waarom toont top erg weinig vrij geheugen, terwijl er erg weinig programma's actief zijn?
ru: Почему top показывает очень мало свободной памяти, даже когда у меня запущено очень мало программ?

source: The simple answer is that free memory is wasted memory.
nl_nl: Het simpele antwoord is dat vrij geheugen verloren geheugen is.
ru: Простой ответ заключается в том, что свободная память — это потраченная впустую память.

source: Any memory that programs do not actively allocate is used within the FreeBSD kernel as disk cache. The values shown by man:top[1] labeled as `Inact` and `Laundry` are cached data at different aging levels. This cached data means the system does not have to access a slow disk again for data it has accessed recently, thus increasing overall performance. In general, a low value shown for `Free` memory in man:top[1] is good, provided it is not _very_ low.
nl_nl: Geheugen dat programma's niet actief reserveren, wordt binnen de FreeBSD-kernel gebruikt als disk-cache. De waarden die man:top[1] toont bij `Inact` en `Laundry` zijn cache-gegevens van verschillende ouderdomsniveaus. Dankzij deze cache-gegevens hoeft het systeem niet opnieuw toegang te vragen tot een langzame schijf voor gegevens waarvoor kortgeleden toegang is verkregen. Op deze manier wordt het hele systeem sneller. In het algemeen is een lage waarde voor `Free` geheugen in man:top[1] goed, zolang het maar niet _erg_ laag is.
ru: Любая память, которую программы не используют активно, применяется в ядре FreeBSD в качестве дискового кэша. Значения, отображаемые в man:top[1] с метками `Inact` и `Laundry`, представляют собой кэшированные данные на разных уровнях старения. Эти кэшированные данные позволяют системе не обращаться к медленному диску повторно для данных, к которым она недавно обращалась, тем самым повышая общую производительность. В целом, низкое значение памяти, отображаемое как `Free` в man:top[1], является хорошим признаком, при условии, что оно не _очень_ низкое.

source: What is the cute little red guy's name?
nl_nl: Wat is de naam van dat grappige kleine mannetje?
ru: Как зовут этого милого маленького красного человечка?

source: He does not have one, and is just called "the BSD daemon". If you insist upon using a name, call him "beastie". Note that "beastie" is pronounced "BSD".
nl_nl: Hij heeft geen naam en wordt gewoonlijk "de BSD-daemon" genoemd. Als u hem echt een naam wilt geven, noem hem dan "Beastie". Let op dat "Beastie" wordt uitgesproken als "BSD".
ru: У него нет имени, и его просто называют "демон BSD". Если вам непременно нужно имя, называйте его "биести" (beastie). Обратите внимание, что "биести" произносится как "Би-Эс-Ди".

source: More about the BSD daemon is available on his http://www.mckusick.com/beastie/index.html[home page].
nl_nl: Kijk voor meer informatie over de BSD-daemon op http://www.mckusick.com/beastie/index.html[home page].
ru: Дополнительная информация о демоне BSD доступна на его http://www.mckusick.com/beastie/index.html[домашней странице].

source: Can I use the BSD daemon image?
nl_nl: Mag ik de afbeelding van de BSD-daemon gebruiken?
ru: Могу ли я использовать изображение BSD-демона?

source: Perhaps. The BSD daemon is copyrighted by Marshall Kirk McKusick. Check his http://www.mckusick.com/beastie/mainpage/copyright.html[Statement on the Use of the BSD Daemon Figure] for detailed usage terms.
nl_nl: Misschien. De BSD-daemon valt onder het copyright van Marshall Kirk McKusick. Kijk voor meer informatie over de gebruiksvoorwaarden op zijn website http://www.mckusick.com/beastie/mainpage/copyright.html[Statement on the Use of the BSD Daemon Figure].
ru: Возможно. Демон BSD защищен авторским правом Маршалла Кирка МакКузика. Ознакомьтесь с его http://www.mckusick.com/beastie/mainpage/copyright.html[Заявлением об использовании изображения демона BSD] для получения подробных условий использования.

source: In summary, the image can be used in a tasteful manner, for personal use, so long as appropriate credit is given. Before using the logo commercially, contact {mckusick} for permission. More details are available on the http://www.mckusick.com/beastie/index.html[BSD Daemon's home page].
nl_nl: Samenvattend kan de afbeelding op een fatsoenlijke manier gebruikt worden voor persoonlijk gebruik, zolang de bron op een correcte manier wordt vermeld. Neem contact op met {mckusick} voor toestemming als u het logo zakelijk wilt gebruiken. Ga voor meer informatie naar http://www.mckusick.com/beastie/index.html[BSD Daemon's home page].
ru: В заключение, изображение можно использовать в хорошем вкусе, для личного пользования, при условии указания соответствующей авторской принадлежности. Перед коммерческим использованием логотипа свяжитесь с {mckusick} для получения разрешения. Подробнее можно узнать на http://www.mckusick.com/beastie/index.html[домашней странице BSD Daemon].

source: Why should I care what color the bikeshed is?
nl_nl: Waarom moet ik me druk maken over de kleur van het fietsenschuurtje?
ru: Почему меня должен волновать цвет сарая для велосипедов?

source: The really, really short answer is that you should not. The somewhat longer answer is that just because you are capable of building a bikeshed does not mean you should stop others from building one just because you do not like the color they plan to paint it. This is a metaphor indicating that you need not argue about every little feature just because you know enough to do so. Some people have commented that the amount of noise generated by a change is inversely proportional to the complexity of the change.
nl_nl: Het heel korte antwoord is dat u zich daar niet druk om moet maken. Het iets langere antwoord is dat alleen omdat u een fietsenschuurtje kan bouwen, betekent dat nog niet dat u anderen moet verhinderen ook zo'n schuurtje te bouwen, omdat u de kleur niet mooi vindt. Dit is een metafoor om aan te geven dat u niet over elke kleine wijziging of vernieuwing moet discussiëren, alleen omdat u er veel van afweet. Sommige mensen hebben geschreven dat de hoeveelheid gegenereerde ruis omgekeerd evenredig is met de complexiteit van de wijziging.
ru: Очень, очень краткий ответ — не должен. Более развёрнутый ответ: просто потому, что вы способны построить сарай для велосипедов, это не значит, что вы должны мешать другим делать то же самое лишь из-за того, что вам не нравится цвет, которым они собираются его покрасить. Это метафора, напоминающая, что не нужно спорить о каждой мелочи только потому, что у вас достаточно знаний для этого. Некоторые люди отмечали, что количество шума, вызванного изменением, обратно пропорционально сложности этого изменения.

source: The longer and complete answer is that after a very long argument about whether man:sleep[1] should take fractional second arguments, {phk} posted a long message entitled link:http://www.bikeshed.com[A bike shed (any color will do) on greener grass...].
nl_nl: Het langere en complete antwoord is dat na een zeer lange discussie over of man:sleep[1] secondenargumenten met cijfers achter de komma zou moeten accepteren, {phk} een lang bericht postte met de titel link:http://www.bikeshed.com[A bike shed (any color will do) on greener grass...].
ru: Более длинный и полный ответ заключается в том, что после долгих споров о том, должна ли команда man:sleep[1] принимать аргументы в виде дробных секунд, {phk} опубликовал длинное сообщение под названием link:http://www.bikeshed.com[Велосипедный сарай (любого цвета) на более зелёной траве...].

source: Acknowledgments
nl_nl: Dankbetuiging
ru: Благодарности

source: This FAQ has undergone countless revisions and improvements by a diverse group of contributors over the past decades.
nl_nl: Deze FAQ heeft de laatste decennia talloze revisies en verbeteringen ondergaan, uitgevoerd door een grote verscheidenheid aan vrijwilligers.
ru: Этот FAQ претерпел бесчисленные правки и улучшения благодаря разнообразной группе участников на протяжении последних десятилетий.
