Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/faq/_index.po
Languages: nl_nl, ru

source: FreeBSD's processor support varies across different architectures. On amd64 and arm64 systems, FreeBSD can efficiently harness the power of up to 1024 processors. For powerpc-based systems, FreeBSD supports up to 256 processors, while on risc-v systems, it can effectively utilize up to 16 processors.
nl_nl: De ondersteuning van FreeBSD voor processors verschilt per architectuur. Op amd64- en arm64-systemen kan FreeBSD efficiënt de kracht van maar liefst 1024 processors verwerken. In op powerpc-gebaseerde systemen ondersteunt FreeBSD maximaal 256 processors en op risc-v-systemen maximaal 16 processors.
ru: Поддержка процессоров в FreeBSD варьируется в зависимости от архитектуры. На системах amd64 и arm64 FreeBSD может эффективно использовать до 1024 процессоров. На системах с архитектурой powerpc FreeBSD поддерживает до 256 процессоров, а на системах risc-v — до 16 процессоров.

source: What graphics cards does FreeBSD support?
nl_nl: Welke grafische kaarten ondersteunt FreeBSD?
ru: Какие графические карты поддерживает FreeBSD?

source: Popular graphics vendors like Intel(R), AMD(R) or NVIDIA(R) are well-supported.
nl_nl: Er is goede ondersteuning voor de populaire fabrikanten van grafische kaarten, zoals Intel(R), AMD(R) en NVIDIA(R).
ru: Известные производители графических устройств, такие как Intel(R), AMD(R) или NVIDIA(R), хорошо поддерживаются.

source: A list of supported graphics cards from link:https://wiki.freebsd.org/Graphics/Intel-GPU-Matrix[Intel] and link:https://wiki.freebsd.org/Graphics/AMD-GPU-Matrix[AMD] can be found in the FreeBSD Wiki.
nl_nl: Een lijst van ondersteunde grafische kaarten van link:https://wiki.freebsd.org/Graphics/Intel-GPU-Matrix[Intel] en link:https://wiki.freebsd.org/Graphics/AMD-GPU-Matrix[AMD] is te vinden in de FreeBSD Wiki.
ru: Список поддерживаемых видеокарт от link:https://wiki.freebsd.org/Graphics/Intel-GPU-Matrix[Intel] и link:https://wiki.freebsd.org/Graphics/AMD-GPU-Matrix[AMD] можно найти в FreeBSD Wiki.

source: What Wi-Fi cards does FreeBSD support?
nl_nl: Welke WiFi-kaarten ondersteunt FreeBSD?
ru: Какие Wi-Fi карты поддерживает FreeBSD?

source: This is a rapidly changing area as of 2025, so it's worth checking the Hardware Compatibility List for your chosen link:https://www.freebsd.org/releases/[release].
nl_nl: Anno 2025 gaan de veranderingen snel op dit gebied. Hou vooral de Hardware Compatibility List in de gaten voor uw gekozen link:https://www.freebsd.org/releases/[versie].
ru: Это область, которая быстро меняется по состоянию на 2025 год, поэтому рекомендуется проверить Список совместимого оборудования для выбранного link:https://www.freebsd.org/releases/[релиза].

source: The list of PCIe Wi-Fi devices that are known to work well on FreeBSD:
nl_nl: De lijst met PCIe WiFi-apparaten die goed werken onder FreeBSD:
ru: Список устройств PCIe Wi-Fi, которые хорошо работают в FreeBSD:

source: Intel chipset devices covered by man:iwlwifi[4] (high-speed as of FreeBSD 14.3)
nl_nl: Intel chipset-apparaten worden behandeld in man:iwlwifi[4] (high-speed vanaf FreeBSD 14.3)
ru: Устройства на чипсетах Intel, поддерживаемые man:iwlwifi[4] (высокоскоростные — начиная с FreeBSD 14.3)

source: The list of USB Wi-Fi devices that are known to work well on FreeBSD:
nl_nl: De lijst met USB WiFi-apparaten die goed werken onder FreeBSD:
ru: Список USB Wi-Fi устройств, которые хорошо работают в FreeBSD:

source: RT5370 USB dongles (supports hostap mode)
nl_nl: RT5370 USB dongles (ondersteunt hostap mode)
ru: USB-адаптеры RT5370 (поддерживают режим hostap)

source: Does FreeBSD support 10 Gigabit Ethernet network cards?
nl_nl: Ondersteunt FreeBSD 10 Gigabit Ethernet netwerkkaarten?
ru: Поддерживает ли FreeBSD сетевые карты 10 Gigabit Ethernet?

source: FreeBSD provides robust support for 10 Gigabit Ethernet network cards, making it a viable choice for high-speed networking environments. The FreeBSD kernel includes drivers for a wide range of 10 Gigabit Ethernet adapters from various manufacturers, ensuring seamless integration and optimal network performance.
nl_nl: FreeBSD biedt een robuuste ondersteuning voor 10 Gigabit Ethernet netwerkkaarten, waardoor het een uitstekende keuze is voor high-speed netwerkomgevingen. De FreeBSD-kernel bevat stuurprogramma's voor een groot aantal 10 Gigabit Ethernet adapters van verschillende fabrikanten, wat zorgt voor een naadloze integratie en optimale netwerkprestaties.
ru: FreeBSD обеспечивает надежную поддержку сетевых карт 10 Gigabit Ethernet, что делает его подходящим выбором для высокоскоростных сетевых сред. Ядро FreeBSD включает драйверы для широкого спектра адаптеров 10 Gigabit Ethernet от различных производителей, гарантируя беспрерывную интеграцию и оптимальную производительность сети.

source: More information can be obtained at the link:https://wiki.freebsd.org/Networking/10GbE[FreeBSD Wiki].
nl_nl: Zie voor meer informatie link:https://wiki.freebsd.org/Networking/10GbE[FreeBSD Wiki].
ru: Дополнительную информацию можно получить по ссылке: link:https://wiki.freebsd.org/Networking/10GbE[FreeBSD Wiki].

source: Documentation and Support
nl_nl: Documentatie en ondersteuning
ru: Документация и Поддержка

source: This section provides valuable resources for those seeking to deepen their knowledge of FreeBSD. It covers a range of topics, including recommended books for learning FreeBSD, avenues for commercial training and support, insights into understanding FreeBSD's internals, and where to find assistance within the FreeBSD community.
nl_nl: Dit gedeelte geeft waardevolle informatie voor diegenen die hun kennis van FreeBSD verder willen verdiepen. Het behandelt verschillende onderwerpen, zoals aanbevolen boeken voor het leren van FreeBSD, routes naar commerciële trainingen en ondersteuning, een kijkje onder de motorkap van FreeBSD en informatie over waar hulp te vinden is binnen de FreeBSD-community.
ru: В этом разделе представлены полезные ресурсы для тех, кто хочет углубить свои знания о FreeBSD. Здесь рассматриваются различные темы, включая рекомендуемые книги для изучения FreeBSD, варианты коммерческого обучения и поддержки, информацию о понимании внутреннего устройства FreeBSD, а также о том, где можно получить помощь в сообществе FreeBSD.

source: What good books are there about FreeBSD?
nl_nl: Wat zijn goede boeken over FreeBSD?
ru: Какие есть хорошие книги о FreeBSD?

source: FreeBSD enthusiasts and learners can explore a variety of informative books dedicated to the operating system. These books cover topics ranging from FreeBSD basics to advanced system administration and development.
nl_nl: Bent u enthousiast over FreeBSD en wilt u er meer van leren, dan zijn er diverse boeken beschikbaar die toegespitst zijn op dit besturingssysteem. De onderwerpen variëren van de basisbeginselen tot geavanceerd systeembeheer en programmeren.
ru: Энтузиасты и изучающие FreeBSD могут ознакомиться с разнообразными информативными книгами, посвящёнными этой операционной системе. Эти книги охватывают темы от основ FreeBSD до продвинутого системного администрирования и разработки.

source: Some notable titles include "Absolute FreeBSD: The Complete Guide To FreeBSD" by Michael W. Lucas, and the "FreeBSD Mastery series" also by Michael W. Lucas, among others. These resources offer valuable insights and knowledge to help users of all levels master FreeBSD and maximize its potential.
nl_nl: Enkele goed bekend staande titels zijn "Absolute FreeBSD: The Complete Guide To FreeBSD" van Michael W. Lucas en de "FreeBSD Mastery series" ook van Michael W. Lucas en medeauteurs. Deze boeken leveren waardevolle inzichten aan gebruikers van alle niveaus om FreeBSD onder de knie te krijgen en maximaal te benutten.
ru: Некоторые примечательные книги включают *"FreeBSD: Подробное руководство" ("Absolute FreeBSD: The Complete Guide To FreeBSD")* Майкла В. Лукаса и серию *"FreeBSD Mastery"* того же автора, среди прочих. Эти ресурсы предоставляют ценные знания и помогают пользователям любого уровня освоить FreeBSD и раскрыть её потенциал.

source: Apart from the books, The FreeBSD Project produces a wide range of documentation, available online in the link:https://docs.FreeBSD.org/[Documentation Portal].
nl_nl: Naast de boeken produceert het FreeBSD-project een grote hoeveelheid documentatie, online beschikbaar via het link:https://docs.FreeBSD.org/[Documentatieportaal].
ru: Помимо книг, проект FreeBSD создает обширную документацию, доступную онлайн на портале link:https://docs.FreeBSD.org/[Документация].

source: Where can I get commercial FreeBSD training and support?
nl_nl: Waar kan ik commerciële trainingen volgen en ondersteuning krijgen voor FreeBSD?
ru: Где можно получить коммерческое обучение и поддержку FreeBSD?

source: For those seeking professional training and support for FreeBSD, several commercial providers offer tailored services. The FreeBSD project maintains a link:https://www.freebsd.org/commercial/[list of companies] from which support can be requested.
nl_nl: Voor diegenen die professionele trainingen en ondersteuning zoeken voor FreeBSD zijn er diverse aanbieders die oplossingen op maat aanbieden. Het FreeBSD-project heeft een link:https://www.freebsd.org/commercial/[lijst met bedrijven] waar ondersteuning kan worden aangevraagd.
ru: Для тех, кто ищет профессиональное обучение и поддержку по FreeBSD, несколько коммерческих поставщиков предлагают индивидуальные услуги. Проект FreeBSD ведет link:https://www.freebsd.org/commercial/[список компаний], у которых можно запросить поддержку.

source: How can I learn more about FreeBSD's internals?
nl_nl: Hoe kan ik meer te weten komen over de interne werking van FreeBSD?
ru: Как можно узнать больше о внутреннем устройстве FreeBSD?

source: To delve deeper into the inner workings of FreeBSD, interested individuals can explore resources like "The Design And Implementation Of The FreeBSD Operating System". The extref:{arch-handbook}[FreeBSD Architecture Handbook]. is another valuable resource that provides detailed information about FreeBSD's architecture, system organization, and design principles
nl_nl: Om FreeBSD op een dieper niveau te leren kennen, kunnen geïnteresseerde gebruikers bronnen raadplegen zoals bijvoorbeeld "The Design And Implementation Of The FreeBSD Operating System". Het extref:{arch-handbook}[FreeBSD Architecture Handbook] is ook een waardevolle bron, die gedetailleerde informatie geeft over de architectuur, systeemopbouw en ontwerpprincipes van FreeBSD.
ru: Для более глубокого изучения внутреннего устройства FreeBSD заинтересованные лица могут обратиться к таким ресурсам, как "FreeBSD: Дизайн и архитектура (The Design And Implementation Of The FreeBSD Operating System)". Ещё одним ценным источником информации является extref:{arch-handbook}[Руководство по архитектуре FreeBSD], который предоставляет подробные сведения об архитектуре FreeBSD, организации системы и принципах проектирования

source: Additionally, reviewing the FreeBSD source code, available through the FreeBSD source repository, provides valuable insights into the operating system's core components.
nl_nl: Daarnaast kan het doornemen van de broncode van FreeBSD via de FreeBSD bronbestanden waardevolle inzichten geven omtrent de kerncomponenten van het besturingssysteem.
ru: Кроме того, изучение исходного кода FreeBSD, доступного в репозитории исходных текстов FreeBSD, дает ценное представление об основных компонентах операционной системы.

source: How can I get help in a FreeBSD system?
nl_nl: Waar kan ik hulp vinden binnen een FreeBSD-systeem?
ru: Как получить помощь в системе FreeBSD?

source: Getting assistance within a FreeBSD system is straightforward. FreeBSD offers a wealth of built-in documentation, accessible through the man:man[1] command, which provides comprehensive information about various commands and system components.
nl_nl: Ondersteuning is rechtstreeks beschikbaar binnen FreeBSD. Er is een grote verzameling ingebouwde documentatie, die direct toegankelijk is via het man:man[1] commando. Dat geeft uitgebreide informatie over diverse commando's en systeemcomponenten.
ru: Получить помощь в системе FreeBSD довольно просто. FreeBSD предоставляет обширную встроенную документацию, доступную через команду man:man[1], которая содержит подробную информацию о различных командах и компонентах системы.

source: Additionally, the extref:{handbook}[FreeBSD Handbook], available both online and locally on the system, serves as a valuable resource for in-depth guidance.
nl_nl: Daarnaast vormt het extref:{handbook}[FreeBSD Handboek], dat zowel online als lokaal op het systeem beschikbaar is, een waardevolle informatiebron met uitgebreide instructies.
ru: Кроме того, extref:{handbook}[Руководство FreeBSD], доступное как онлайн, так и локально в системе, служит ценным ресурсом для получения подробных инструкций.

source: If specific issues arise, seeking help from the FreeBSD community via mailing lists, forums, or IRC can provide timely solutions and insights from experienced FreeBSD users and developers.
nl_nl: Als er problemen optreden, kan er meestal snel een oplossing gevonden worden door hulp te vragen aan ervaren gebruikers en ontwikkelaars in de FreeBSD-community via mailing lists, forums of IRC.
ru: Если возникают конкретные проблемы, можно обратиться за помощью в сообщество FreeBSD через списки рассылки, форумы или IRC, чтобы получить своевременные решения и советы от опытных пользователей и разработчиков FreeBSD.

source: Community Questions
nl_nl: Vragen aan de community
ru: Вопросы о сообществе

source: Explore this section to discover ways to engage with the FreeBSD community.
nl_nl: Bestudeer dit hoofdstuk om te ontdekken hoe u deel kunt nemen aan de FreeBSD-community.
ru: Изучите этот раздел, чтобы узнать о способах взаимодействия с сообществом FreeBSD.

source: Learn about FreeBSD IRC channels for real-time discussions, web-based forums for sharing insights, and access to FreeBSD mailing lists and news groups for in-depth discussions and news updates.
nl_nl: U vindt hier uitleg over de IRC-kanalen voor realtime discussies, webgebaseerde forums voor het delen van inzichten en toegang tot de mailing lists en nieuwsgroepen van FreeBSD voor diepgaande discussies en nieuwsupdates.
ru: Узнайте о каналах FreeBSD в IRC для обсуждений в реальном времени, веб-форумах для обмена мнениями, а также о почтовых рассылках и группах новостей FreeBSD для углубленных обсуждений и получения обновлений.

source: Are there FreeBSD IRC (Internet Relay Chat) channels?
nl_nl: Zijn er IRC (Internet Relay Chat)-kanalen voor FreeBSD?
ru: Есть ли каналы FreeBSD в IRC (Internet Relay Chat)?

source: Yes, most major IRC networks host a FreeBSD chat channel and the FreeBSD wiki holds an up to date link:https://wiki.freebsd.org/IRC/Channels[list of IRC channels].
nl_nl: Ja, de meeste grote IRC-netwerken hosten een FreeBSD-chatkanaal en de FreeBSD-wiki houdt een actuele link:https://wiki.freebsd.org/IRC/Channels[lijst van IRC-kanalen] bij.
ru: Да, большинство крупных IRC-сетей имеют канал для обсуждения FreeBSD, а на вики FreeBSD доступен актуальный link:https://wiki.freebsd.org/IRC/Channels[список IRC-каналов].

source: Each of these channels are distinct and are not connected to each other. Since their chat styles differ, try each to find one suited to your chat style.
nl_nl: Elk van deze kanalen staan op zichzelf en zijn niet verbonden met elkaar. Omdat de chat-stijlen verschillen, raden we u aan elk kanaal te proberen en te kijken welk het best bij u past.
ru: Каждый из этих каналов уникален и не связан с другими. Поскольку их стили общения различаются, попробуйте каждый, чтобы найти подходящий вам стиль чата.

source: Are there any web based forums to discuss FreeBSD?
nl_nl: Zijn er ook internetforums die discussiëren over FreeBSD?
ru: Есть ли веб-форумы для обсуждения FreeBSD?

source: The official FreeBSD forums are located at the link:https://forums.FreeBSD.org/[FreeBSD Forums homepage].
nl_nl: De officiële FreeBSD-forums zijn te vinden via link:https://forums.FreeBSD.org/[FreeBSD Forums startpagina].
ru: Официальные форумы FreeBSD расположены по ссылке: link:https://forums.FreeBSD.org/[Домашняя страница форумов FreeBSD].

source: Where do I find info on the FreeBSD mailing lists?
nl_nl: Waar vind ik informatie over de FreeBSD-maillijsten?
ru: Где найти информацию о списках рассылки FreeBSD?

source: The public mailing lists can be found at the link:https://lists.freebsd.org/[FreeBSD mailing lists].
nl_nl: De publieke maillijsten zijn te vinden via link:https://lists.freebsd.org/[FreeBSD maillijsten].
ru: Списки рассылки с открытым доступом можно найти по ссылке: link:https://lists.freebsd.org/[списки рассылки FreeBSD].

source: Miscellaneous Questions
nl_nl: Overige vragen
ru: Разные вопросы

source: Explore a variety of intriguing and practical queries about FreeBSD, covering topics from shell choices to system quirks and even the FreeBSD pet's name.
nl_nl: Blader door een variëteit van intrigerende en praktische vragen over FreeBSD. Van keuzes voor de shell en eigenaardigheden van het systeem tot en met de naam van het huisdier van FreeBSD.
ru: Изучите множество интересных и практичных вопросов о FreeBSD, начиная от выбора оболочки (shell) до особенностей системы и даже имени питомца FreeBSD.

source: Why is /bin/sh so minimal? Why does FreeBSD not use bash or another shell?
nl_nl: Waarom is /bin/sh zo minimaal? Waarom gebruikt FreeBSD geen bash of andere shell?
ru: Почему /bin/sh такой минималистичный? Почему FreeBSD не использует bash или другую оболочку?

source: Many people need to write shell scripts which will be portable across many systems. That is why POSIX(R) specifies the shell and utility commands in great detail. Most scripts are written in Bourne shell (man:sh[1]), and because several important programming interfaces are specified to use the Bourne shell to interpret commands. As the Bourne shell is so often and widely used, it is important for it to be quick to start, be deterministic in its behavior, and have a small memory footprint.
nl_nl: Veel mensen moeten shellscripts schrijven, die uitwisselbaar zijn tussen verschillende systemen. Daarom specificeert POSIX(R) de shell en ondersteunende commando's zeer gedetailleerd. De meeste scripts zijn geschreven in de Bourne-shell (man:sh[1]), omdat verscheidene belangrijke programmeerinterfaces de Bourne-shell gebruiken om commando's te interpreteren. Omdat de Bourne-shell zo vaak en wijdverbreid wordt gebruikt, is het belangrijk dat deze snel start, deterministisch is qua gedrag en weinig geheugen gebruikt.
ru: Многие люди сталкиваются с необходимостью написания сценариев командной оболочки, которые будут переносимы между различными системами. Именно поэтому POSIX(R) детально определяет стандарты для оболочки и утилит. Большинство сценариев пишутся на Bourne shell (man:sh[1]), так как несколько важных программных интерфейсов требуют использования Bourne shell для интерпретации команд. Поскольку Bourne shell так часто и широко применяется, важно, чтобы он быстро запускался, имел предсказуемое поведение и требовал мало памяти.

source: The existing implementation is our best effort at meeting as many of these requirements simultaneously as we can. To keep `/bin/sh` small, we have not provided many of the convenience features that other shells have.
nl_nl: De bestaande implementatie is onze beste oplossing om aan al deze vereisten tegelijk te voldoen. Om `/bin/sh` klein te houden, hebben we veel van de handige functies die andere shells hebben, niet ingebouwd.
ru: Существующая реализация — это наш наилучший подход к одновременному удовлетворению как можно большего числа этих требований. Чтобы сохранить `/bin/sh` компактным, мы не добавили многие удобные функции, которые есть в других оболочках.

source: That is why other more featureful shells like `bash`, `scsh`, man:tcsh[1], and `zsh` are available.
nl_nl: Om die reden zijn er andere shells met meer functies beschikbaar, zoals `bash`, `scsh`, man:tcsh[1] en `zsh`.
ru: Вот почему доступны другие, более функциональные оболочки, такие как `bash`, `scsh`, man:tcsh[1] и `zsh`.

source: How do I use my delete key in sh and csh?
nl_nl: Hoe gebruik ik de delete-toets in sh en csh?
ru: Как использовать клавишу Delete в sh и csh?

source: For the Bourne Shell, add the following lines to [.filename]#~/.shrc#:
nl_nl: Voor de Bourne Shell voegt u de volgende regels toe aan [.filename]#~/.shrc#:
ru: Для оболочки Bourne Shell добавьте следующие строки в файл [.filename]#~/.shrc#:

source: For the C Shell, add the following lines to [.filename]#~/.cshrc#:
nl_nl: Voor the C-shell voegt u de volgende regels toe aan [.filename]#~/.cshrc#:
ru: Для оболочки C Shell добавьте следующие строки в файл [.filename]#~/.cshrc#:

source: I have forgotten the root password! What do I do?
nl_nl: Ik ben het root-wachtwoord vergeten! Wat moet ik doen?
ru: Я забыл пароль root! Что делать?

source: Do not panic! Restart the system, type `boot -s` at the `Boot:` prompt to enter single-user mode. At the question about the shell to use, hit kbd:[Enter] which will display a # prompt. Enter `mount -urw /` to remount the root file system read/write, then run `mount -a` to remount all the file systems. Run `passwd root` to change the `root` password then run man:exit[1] to continue booting.
nl_nl: Geen paniek! Herstart het systeem, typ `boot -s` op de `Boot:` prompt om naar single-user mode te gaan. Op de vraag over welke shell te gebruiken, drukt u op kbd:[Enter]. Hierna verschijnt een # prompt. Typ `mount -urw /` om het root bestandssysteem te remounten als read/write. Typ vervolgens `mount -a` om alle bestandssystemen te remounten. Typ `passwd root` om het `root` wachtwoord te wijzigen en voer dan man:exit[1] uit om verder te gaan met booten.
ru: Не паникуйте! Перезагрузите систему, введите `boot -s` при появлении запроса `Boot:`, чтобы перейти в однопользовательский режим. На вопрос о выборе оболочки нажмите kbd:[Enter], после чего появится приглашение #. Введите `mount -urw /`, чтобы перемонтировать корневую файловую систему в режиме чтения/записи, затем выполните `mount -a` для перемонтирования всех файловых систем. Выполните `passwd root`, чтобы изменить пароль `root`, а затем введите man:exit[1] для продолжения загрузки.
