Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/freebsd-releng/*.po
Languages: pt_br

source: The files specified throughout this section are relative to the <literal>head/</literal> branch of the <literal>doc</literal> repository in <application>Subversion</application>.
pt_br: Os arquivos especificados ao longo desta seção são relativos à branch <literal>head/</literal> do repositório <literal>doc</literal> no <application>Subversion</application>.

source: Website Changes Before the Release Cycle Begins
pt_br: Alterações na Página Web Antes do Início do Ciclo de Release

source: When the release cycle schedule is available, these files need to be updated to enable various different functionalities on the FreeBSD Project website:
pt_br: Quando o cronograma do ciclo de release está disponível, esses arquivos precisam ser atualizados para habilitar várias funcionalidades diferentes no site do Projeto FreeBSD:

source: File to Edit
pt_br: Arquivo para editar

source: What to Change
pt_br: O que mudar

source: Change <literal>beta.upcoming</literal> from <literal>IGNORE</literal> to <literal>INCLUDE</literal>
pt_br: Altere <literal>beta.upcoming</literal> de <literal>IGNORE</literal> para <literal>INCLUDE</literal>

source: Change <literal>% beta.upcoming</literal> from <literal>IGNORE</literal> to <literal>INCLUDE</literal>
pt_br: Altere <literal>% beta.upcoming</literal> de <literal>IGNORE</literal> para <literal>INCLUDE</literal>

source: Change <literal>beta.testing</literal> from <literal>IGNORE</literal> to <literal>INCLUDE</literal>
pt_br: Altere <literal>beta.testing</literal> de <literal>IGNORE</literal> para <literal>INCLUDE</literal>

source: Change <literal>% beta.testing</literal> from <literal>IGNORE</literal> to <literal>INCLUDE</literal>
pt_br: Altere <literal>% beta.testing</literal> de <literal>IGNORE</literal> para <literal>INCLUDE</literal>

source: Website Changes During <literal>BETA</literal> or <literal>RC</literal>
pt_br: Alterações na página web durante a fase <literal>BETA</literal> ou <literal>RC</literal>

source: When transitioning from <literal>PRERELEASE</literal> to <literal>BETA</literal>, these files need to be updated to enable the "Help Test" block on the download page. All files are relative to <filename class="directory">head/</filename> in the <literal>doc</literal> repository:
pt_br: Ao fazer a transição de <literal>PRERELEASE</literal> para <literal>BETA</literal>, esses arquivos precisam ser atualizados para ativar o bloco "Teste de ajuda" na página de download. Todos os arquivos são relativos ao <filename class="directory">head/</filename> no repositório <literal>doc</literal>:

source: Change <literal>% beta.local.where</literal> <literal>IGNORE</literal> to <literal>INCLUDE</literal>
pt_br: Altere <literal>% beta.local.where</literal> <literal>IGNORE</literal> para <literal>INCLUDE</literal>

source: Update <literal>% betarel.vers</literal> to <literal>BETA<replaceable>1</replaceable></literal>
pt_br: Atualize <literal>% betarel.vers</literal> para <literal>BETA<replaceable>1</replaceable></literal>

source: Add an entry announcing the <literal>BETA</literal>
pt_br: Adicione uma entrada anunciando a versão <literal>BETA</literal>

source: Add the new <literal>BETA</literal>, <literal>RC</literal>, or final <literal>RELEASE</literal> to the template
pt_br: Adicione as novas <literal>BETA</literal>, <literal>RC</literal> ou <literal>RELEASE</literal> final ao modelo

source: Once the <literal>releng/<replaceable>12.0</replaceable>/</literal> branch is created, the various release-related documents need to be generated and manually added to the <literal>doc/</literal> repository.
pt_br: Uma vez criada a branch <literal>releng/<replaceable>12.0</replaceable>/</literal>, os diversos documentos relacionados à release precisam ser gerados e adicionados manualmente ao repositório <literal>doc/</literal>.

source: Within <filename class="directory">release/doc</filename>, invoke <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> to generate <filename>errata.html</filename>, <filename>hardware.html</filename>, <filename>readme.html</filename>, and <filename>relnotes.html</filename> pages, which are then added to <filename class="directory">doc/head/en_US.ISO8859-1/htdocs/releases/<replaceable>X.Y</replaceable>R/</filename>, where <replaceable>X.Y</replaceable> represents the major and minor version number of the release.
pt_br: Dentro de <filename class="directory">release/doc</filename>, invoque <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> para gerar as páginas <filename>errata.html</filename>, <filename>hardware.html</filename>, <filename>readme.html</filename> e <filename>relnotes.html</filename>, que são então adicionadas ao diretório <filename class="directory">doc/head/en_US.ISO8859-1/htdocs/releases/<replaceable>XY</replaceable>R/</filename>, em que <replaceable>XY</replaceable> representa o número da versão principal e da versão secundária.

source: The <literal>fbsd:nokeywords</literal> property must be set to <literal>on</literal> on the newly-added files before the pre-commit hooks will allow them to be added to the repository.
pt_br: A propriedade <literal>fbsd:nokeywords</literal> deve ser definido como <literal>on</literal> nos arquivos recém-adicionados para que os hooks de pré-commit permitam que eles sejam adicionados ao repositório.

source: The relevant release-related documents exist in the <filename class="directory">doc</filename> repository for FreeBSD 12.x and later.
pt_br: Os documentos relevantes relacionados à release existem no repositório <filename class="directory">doc</filename> para FreeBSD 12.x e posterior.

source: Ports Changes During <literal>BETA</literal>, <literal>RC</literal>, and the Final <literal>RELEASE</literal>
pt_br: Mudanças nos ports durante as fases <literal>BETA</literal>, <literal>RC</literal>, e a versão <literal>RELEASE</literal> final

source: For each build during the release cycle, the <literal>MANIFEST</literal> files containing the <literal>SHA256</literal> of the various distribution sets, such as <literal>base.txz</literal>, <literal>kernel.txz</literal>, and so on, are added to the <package>misc/freebsd-release-manifests</package> port. This allows utilities other than <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>, such as <package>ports-mgmt/poudriere</package>, to safely use these distribution sets by providing a mechanism through which the checksums can be verified.
pt_br: Para cada compilação durante o ciclo de release, os arquivos <literal>MANIFEST</literal> contendo o <literal>SHA256</literal> dos vários conjuntos de distribuição, como <literal>base.txz</literal>, <literal>kernel.txz</literal>, e assim por diante, são adicionados ao port <package>misc/freebsd-release-manifests</package>. Isso permite outros utilitários além do <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>, como <package>ports-mgmt/poudriere</package>, usem esses conjuntos de distribuição com segurança fornecendo um mecanismo através do qual os checksums possam ser verificados.

source: Release from <literal>head/</literal>
pt_br: Releases a partir da branch <literal>head/</literal>

source: This section describes the general procedures of the FreeBSD release cycle from the <literal>head/</literal> branch.
pt_br: Esta seção descreve os procedimentos gerais do ciclo de release do FreeBSD na branch <literal>head</literal>.

source: FreeBSD <quote><literal>ALPHA</literal></quote> Builds
pt_br: Compilações <quote><literal>ALPHA</literal></quote> do FreeBSD

source: Starting with the FreeBSD 10.0-RELEASE cycle, the notion of <quote><literal>ALPHA</literal></quote> builds was introduced. Unlike the <literal>BETA</literal> and <literal>RC</literal> builds, <literal>ALPHA</literal> builds are not included in the FreeBSD Release schedule.
pt_br: Tendo aparecido primeiramente durante o ciclo de release do FreeBSD 10.0-RELEASE, a noção de compilações de fases <quote><literal>ALPHA</literal></quote> foi introduzida. Ao contrário das compilações <literal>BETA</literal> e <literal>RC</literal>, as compilações desse novo estágio <literal>ALPHA</literal> não fazem parte do cronograma de Release do FreeBSD.

source: The idea behind <literal>ALPHA</literal> builds is to provide regular FreeBSD-provided builds before the creation of the <literal>stable/</literal> branch.
pt_br: A idéia por trás das compilações <literal>ALPHA</literal> é disponibilizar builds regulares fornecidas pelo FreeBSD antes da criação da branch <literal>stable/</literal>.

source: FreeBSD <literal>ALPHA</literal> snapshots should be built approximately once a week.
pt_br: Os snapshots <literal>ALPHA</literal> do FreeBSD devem ser preparados aproximadamente uma vez por semana.

source: For the first <literal>ALPHA</literal> build, the <varname>BRANCH</varname> value in <filename>sys/conf/newvers.sh</filename> needs to be changed from <literal>CURRENT</literal> to <literal>ALPHA1</literal>. For subsequent <literal>ALPHA</literal> builds, increment each <literal>ALPHA<replaceable>N</replaceable></literal> value by one.
pt_br: Para a primeira compilação <literal>ALPHA</literal>, o valor <varname>BRANCH</varname> em <filename>sys/conf/newvers.sh</filename> precisa ser alterado de <literal>CURRENT</literal> para <literal>ALPHA1</literal>. Para compilações <literal>ALPHA</literal> subsequentes, incremente cada valor de <literal>ALPHA<replaceable>N</replaceable></literal> em um.

source: See <xref linkend="releng-building"/> for information on building the <literal>ALPHA</literal> images.
pt_br: Veja <xref linkend="releng-building"/> para informações sobre como construir as imagens <literal>ALPHA</literal>.

source: Creating the <literal>stable/<replaceable>12</replaceable>/</literal> Branch
pt_br: Criando a branch <literal>stable/<replaceable>12</replaceable>/</literal>

source: When creating the <literal>stable/</literal> branch, several changes are required in both the new <literal>stable/</literal> branch and the <literal>head/</literal> branch. The files listed are relative to the repository root. To create the new <literal>stable/<replaceable>12</replaceable>/</literal> branch in Subversion:
pt_br: Ao criar a branch <literal>stable/</literal>, várias alterações são necessárias na nova branch <literal>stable/</literal> e na branch <literal>head/</literal>. Os arquivos listados são relativos ao repositório raiz. Para criar a nova branch <literal>stable/<replaceable>12</replaceable>/</literal> no Subversion:

source: Once the <literal>stable/<replaceable>12</replaceable>/</literal> branch has been committed, make the following edits:
pt_br: Uma vez que a branch <literal>stable/<replaceable>12</replaceable>/</literal> tenha sido criada, faça as seguintes edições:

source: Update the FreeBSD version, and remove the notice about <literal>WITNESS</literal>
pt_br: Atualize a versão do FreeBSD e remova o aviso sobre <literal>WITNESS</literal>

source: Uncomment <literal>-DNDEBUG</literal>
pt_br: Remova o comentário <literal>-DNDEBUG</literal>

source: Remove debugging support
pt_br: Remova o suporte de depuração

source: Update <varname>SRCBRANCH</varname>
pt_br: Atualize o <varname>SRCBRANCH</varname>

source: Remove these kernel configurations
pt_br: Remova essas configurações do kernel

source: Remove debugging options
pt_br: Remova as opções de depuração

source: Update the <varname>BRANCH</varname> value to reflect <literal>BETA1</literal>
pt_br: Atualize o valor de <varname>BRANCH</varname> para refletir <literal>BETA1</literal>

source: Move <varname>REPRODUCIBLE_BUILD</varname> from <literal>__DEFAULT_NO_OPTIONS</literal> to <literal>__DEFAULT_YES_OPTIONS</literal>
pt_br: Mova <varname>REPRODUCIBLE_BUILD</varname> de <literal>__DEFAULT_NO_OPTIONS</literal> para <literal>__DEFAULT_YES_OPTIONS</literal>

source: Move <varname>LLVM_ASSERTIONS</varname> from <literal>__DEFAULT_YES_OPTIONS</literal> to <literal>__DEFAULT_NO_OPTIONS</literal> (FreeBSD 13.x and later only)
pt_br: Mova <varname>LLVM_ASSERTIONS</varname> de <literal>__DEFAULT_NO_OPTIONS</literal> para <literal>__DEFAULT_YES_OPTIONS</literal> (Apenas para FreeBSD 13.x e posterior)

source: Set <literal>dumpdev</literal> from <literal>AUTO</literal> to <literal>NO</literal> (it is configurable via <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> for those that want it enabled by default)
pt_br: Defina o <literal>dumpdev</literal> de <literal>AUTO</literal> para <literal>NO</literal> (ele é configurável via <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> para aqueles que o querem habilitado por padrão)

source: Remove the <literal>debug.witness.trace</literal> entries
pt_br: Remova as entradas <literal>debug.witness.trace</literal>

source: Then in the <literal>head/</literal> branch, which will now become a new major version:
pt_br: Então, na branch <literal>head/</literal>, que agora se tornará uma nova versão principal:

source: Update the FreeBSD version
pt_br: Atualize a versão do FreeBSD

source: Update the <varname>BRANCH</varname> value to reflect <literal>CURRENT</literal>, and increment <literal>REVISION</literal>
pt_br: Atualize o valor de <varname>BRANCH</varname> para refletir <literal>CURRENT</literal> e incremente a <literal>REVISION</literal>

source: Update <literal>TARGET_TRIPLE</literal> and <literal>MACHINE_TRIPLE</literal>
pt_br: Atualize o <literal>TARGET_TRIPLE</literal> e o <literal>MACHINE_TRIPLE</literal>

source: Update <literal>__FreeBSD_version</literal>
pt_br: Atualize o <literal>__FreeBSD_version</literal>

source: Update <literal>FBSD_MAJOR</literal> and <literal>FBSD_CC_VER</literal>
pt_br: Atualize o <literal>FBSD_MAJOR</literal> e o <literal>FBSD_CC_VER</literal>

source: Append the <literal>freebsd&lt;version&gt;.h</literal> section
pt_br: Anexe a seção <literal>freebsd&lt;versão&gt;.h</literal>

source: Update the value of <literal>OS_VERSION</literal>
pt_br: Atualize o valor do <literal>OS_VERSION</literal>

source: Update <literal>FREEBSD_CC_VERSION</literal>
pt_br: Atualize o <literal>FREEBSD_CC_VERSION</literal>

source: Update <literal>LLD_REVISION_STRING</literal>
pt_br: Atualize o <literal>LLD_REVISION_STRING</literal>

source: Update <literal>LILB32CPUFLAGS</literal>
pt_br: Atualize o <literal>LILB32CPUFLAGS</literal>

source: Release from <literal>stable/</literal>
pt_br: Release a partir da branch <literal>stable/</literal>

source: This section describes the general procedures of the FreeBSD release cycle from an extablished <literal>stable/</literal> branch.
pt_br: Esta seção descreve os procedimentos gerais do ciclo de release do FreeBSD a partir de uma branch <literal>stable/</literal>.

source: FreeBSD <literal>stable</literal> Branch Code Slush
pt_br: Code Slush da branch <literal>stable</literal> do FreeBSD

source: In preparation for the code freeze on a <literal>stable</literal> branch, several files need to be updated to reflect the release cycle is officially in progress. These files are all relative to the top-most level of the stable branch:
pt_br: Na preparação para o code freeze em uma branch <literal>stable</literal>, vários arquivos precisam ser atualizados para refletir o ciclo de release que está oficialmente em andamento. Esses arquivos são todos relativos ao nível mais alto da branch stable:

source: Update the <varname>BRANCH</varname> value to reflect <literal>PRERELEASE</literal>
pt_br: Atualize o valor da <varname>BRANCH</varname> para refletir <literal>PRERELEASE</literal>

source: Update <varname>TARGET_TRIPLE</varname>
pt_br: Atualize o <varname>TARGET_TRIPLE</varname>

source: Update <varname>OS_VERSION</varname>
pt_br: Atualize o <varname>OS_VERSION</varname>

source: Update <literal>LIB32CPUFLAGS</literal>
pt_br: Atualize o <literal>LIB32CPUFLAGS</literal>

source: Add a new <literal>.ds</literal> entry for the FreeBSD version, and update <varname>doc-default-operating-system</varname> (FreeBSD 11.x and earlier only)
pt_br: Adiciona uma nova entrada <literal>.ds</literal> para a versão do FreeBSD, e atualiza <varname>doc-default-operating-system</varname> (FreeBSD 11.x e anteriores apenas)

source: In the <literal>doc</literal> repository, also update <filename>head/en_US.ISO8859-1/htdocs/releases/<replaceable>12.0</replaceable>R/Makefile.hardware</filename>, switching the value of <varname>_BRANCH</varname> to <literal>BETA<replaceable>X</replaceable></literal>, <literal>RC<replaceable>X</replaceable></literal>, or <literal>RELEASE</literal>, respectively.
pt_br: No repositório <literal>doc</literal>, atualize também <filename>head/pt_BR.ISO8859-1/htdocs/releases/<replaceable>12.0</replaceable>R/Makefile.hardware</filename>, alternando o valor de <varname>_BRANCH</varname> para <literal>BETA<replaceable>X</replaceable></literal>, <literal>RC<replaceable>X</replaceable></literal> ou <literal>RELEASE</literal>, respectivamente.

source: FreeBSD <literal>BETA</literal> Builds
pt_br: Builds <literal>BETA</literal> do FreeBSD

source: Following the code slush, the next phase of the release cycle is the code freeze. This is the point at which all commits to the stable branch require explicit approval from the FreeBSD Release Engineering Team. This is enforced by pre-commit hooks in the Subversion repository by editing <filename>base/svnadmin/conf/approvers</filename> to include a regular expression matching the <literal>stable/<replaceable>12</replaceable>/</literal> branch for the release:
pt_br: Após o code slush, a próxima fase do ciclo de release é o code freeze. Este é o ponto no qual todos os commits para a branch stable requerem aprovação explícita da Equipe de Engenharia de Release do FreeBSD. Isto é reforçado por hooks de pré-commit no repositório Subversion editando <filename>base/svnadmin/conf/approvers</filename> para incluir uma expressão regular que coincida com a branch <literal>stable/<replaceable>12</replaceable>/</literal> para a release:

source: There are two general exceptions to requiring commit approval during the release cycle. The first is any change that needs to be committed by the Release Engineer in order to proceed with the day-to-day workflow of the release cycle, the other is security fixes that may occur during the release cycle.
pt_br: Há duas exceções gerais para exigir aprovação de commit durante o ciclo de release. A primeira é qualquer alteração que precise ser "committed" pelo Engenheiro de Release para continuar com o fluxo de trabalho diário do ciclo de lançamento, e a outra são as correções de segurança que podem ocorrer durante o ciclo de lançamento.

source: Once the code freeze is in effect, the next build from the branch is labeled <literal>BETA1</literal>. This is done by updating the <varname>BRANCH</varname> value in <filename>sys/conf/newvers.sh</filename> from <literal>PRERELEASE</literal> to <literal>BETA1</literal>.
pt_br: Quando o code freeze estiver em vigor, a próxima construção da branch será rotulada como <literal>BETA1</literal>. Isso é feito atualizando o valor de <varname>BRANCH</varname> em <filename>sys/conf/newvers.sh</filename> de <literal>PRERELEASE</literal> para <literal>BETA1</literal>.

source: Once this is done, the first set of <literal>BETA</literal> builds are started. Subsequent <literal>BETA</literal> builds do not require updates to any files other than <filename>sys/conf/newvers.sh</filename>, incrementing the <literal>BETA</literal> build number.
pt_br: Feito isso, o primeiro conjunto de builds <literal>BETA</literal> é iniciado. Builds <literal>BETA</literal> subseqüentes não requerem atualizações em nenhum arquivo diferente do <filename>sys/conf/newvers.sh</filename>, incrementando o número de compilação da versão <literal>BETA</literal>.

source: Creating the <literal>releng/<replaceable>12.0</replaceable>/</literal> Branch
pt_br: Criando a branch <literal>releng/<replaceable>12.0</replaceable>/</literal>

source: When the first <literal>RC</literal> (Release Candidate) build is ready to begin, the <literal>releng/</literal> branch is created. This is a multi-step process that must be done in a specific order, in order to avoid anomalies such as overlaps with <varname>__FreeBSD_version</varname> values, for example. The paths listed below are relative to the repository root. The order of commits and what to change are:
pt_br: Quando a primeira construção <literal>RC</literal> (Release Candidate) está pronta para começar, a branch <literal>releng/</literal> é criada. Este é um processo de várias etapas que deve ser feito em uma ordem específica, a fim de evitar anomalias, como sobreposições com valores de <varname>__ FreeBSD_version</varname>, por exemplo. Os caminhos listados abaixo são relativos ao repositório raiz. A ordem dos commits e o que mudar são:

source: Change <literal>BETA<replaceable>X</replaceable></literal> to <literal>RC1</literal>
pt_br: Altere <literal>BETA<replaceable>X</replaceable></literal> para <literal>RC1</literal>

source: Update <varname>__FreeBSD_version</varname>
pt_br: Atualize o <varname>__ FreeBSD_version</varname>

source: Replace <literal>latest</literal> with <literal>quarterly</literal> as the default package repository location
pt_br: Substitua <literal>latest</literal> por <literal>quarterly</literal> (trimestral) como a localização padrão do repositório de pacotes

source: Update <literal>BETA<replaceable>X</replaceable></literal> with <literal>PRERELEASE</literal>
pt_br: Atualize <literal>BETA<replaceable>X</replaceable></literal> para <literal>PRERELEASE</literal>

source: Add a new approvers line for the releng branch as was done for the stable branch
pt_br: Adicione uma nova linha de aprovadores para a branch releng como foi feito para a branch stable

source: Now that two new <varname>__FreeBSD_version</varname> values exist, also update <filename>head/en_US.ISO8859-1/books/porters-handbook/versions/chapter.xml</filename> in the Documentation Project repository.
pt_br: Agora que existem dois novos valores de <varname>__ FreeBSD_version</varname>, também atualize <filename>head/pt_BR.ISO8859-1/books/porters-handbook/versions/chapter.xml</filename> no repositório do Projeto de Documentação.

source: After the first <literal>RC</literal> build has completed and tested, the <literal>stable/</literal> branch can be <quote>thawed</quote> by removing (or commenting) the ^/<literal>stable/<replaceable>12</replaceable>/</literal> entry in <filename>svnadmin/conf/approvers</filename>.
pt_br: Depois que a primeira compilação de um <literal>RC</literal> estiver concluída e testada, a branch <literal>stable/</literal> pode ser <quote>descongelada</quote> removendo (ou comentando) a entrada ^/<literal>stable/<replaceable>12</replaceable>/</literal> em <filename>svnadmin/conf/approvers</filename>.

source: Following the availability of the first <literal>RC</literal>, FreeBSD Bugmeister Team should be emailed to add the new FreeBSD <literal>-RELEASE</literal> to the <literal>versions</literal> available in the drop-down menu shown in the bug tracker.
pt_br: Seguindo a disponibilidade do primeiro <literal>RC</literal>, o Time Bugmeister do FreeBSD deve ser avisado por e-mail para adicionar o novo FreeBSD <literal>-RELEASE</literal> às <literal>versões</literal> disponíveis no menu drop-down exibido no rastreador de bugs.

source: Building FreeBSD Installation Media
pt_br: Construindo a Mídia de Instalação do FreeBSD

source: This section describes the general procedures producing FreeBSD development snapshots and releases.
pt_br: Esta seção descreve os procedimentos gerais de produção de snapshots e releases de desenvolvimento do FreeBSD.
