Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/freebsd-releng/*.po
Languages: pt_br

source: Release Build Scripts
pt_br: Scripts para compilação de Releases

source: This section describes the build scripts used by FreeBSD Release Engineering Team to produce development snapshots and releases.
pt_br: Esta seção descreve os scripts de build usados pela Equipe de Engenharia de Release do FreeBSD para produzir snapshots da versão em desenvolvimento e das releases.

source: The <filename>release.sh</filename> Script
pt_br: O script <filename>release.sh</filename>

source: Prior to FreeBSD 9.0-RELEASE, <filename>src/release/Makefile</filename> was updated to support <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>, and the <filename>src/release/generate-release.sh</filename> script was introduced as a wrapper to automate invoking the <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> targets.
pt_br: Antes do FreeBSD 9.0-RELEASE, o <filename>src/release/Makefile</filename> era atualizado para suportar o <citerefentry><refentrytitle>bsdinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>, e o script <filename>src/release/generate-release.sh</filename> foi introduzido como um wrapper para automatizar a chamada dos targets <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry>.

source: Prior to FreeBSD 9.2-RELEASE, <filename>src/release/release.sh</filename> was introduced, which heavily based on <filename>src/release/generate-release.sh</filename> included support to specify configuration files to override various options and environment variables. Support for configuration files provided support for cross building each architecture for a release by specifying a separate configuration file for each invocation.
pt_br: Antes do FreeBSD 9.2-RELEASE, foi introduzido o <filename>src/release/release.sh</filename>, que baseado fortemente em <filename>src/release/generate-release.sh</filename> incluía suporte para especificar arquivos de configuração para substituir várias opções e variáveis de ambiente. O suporte para arquivos de configuração forneceu suporte para cross building (compilação para mais de uma arquitetura) de uma release para cada arquitetura, especificando um arquivo de configuração separado para cada chamada.

source: As a brief example of using <filename>src/release/release.sh</filename> to build a single release in <filename class="directory">/scratch</filename>:
pt_br: Como um breve exemplo do uso de <filename>src/release/release.sh</filename> para construir uma única versão em <filename class="directory">/scratch</filename>:

source: As a brief example of using <filename>src/release/release.sh</filename> to build a single, cross-built release using a different target directory, create a custom <filename>release.conf</filename> containing:
pt_br: Como um breve exemplo do uso de <filename>src/release/release.sh</filename> para construir uma única versão cross-build (entre arquiteturas) usando um diretório de destino diferente, crie um <filename>release.conf</filename> personalizado contendo:

source: Then invoke <filename>src/release/release.sh</filename> as:
pt_br: Em seguida, invoque <filename>src/release/release.sh</filename> da seguinte forma:

source: See <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> and <filename>src/release/release.conf.sample</filename> for more details and example usage.
pt_br: Veja <citerefentry><refentrytitle>release</refentrytitle><manvolnum>7</manvolnum></citerefentry> e <filename>src/release/release.conf.sample</filename> para mais detalhes e exemplos de uso.

source: The <filename>thermite.sh</filename> Wrapper Script
pt_br: O Script Wrapper <filename>thermite.sh</filename>

source: In order to make cross building the full set of architectures supported on a given branch faster, easier, and reduce human error factors, a wrapper script around <filename>src/release/release.sh</filename> was written to iterate through the various combinations of architectures and invoke <filename>src/release/release.sh</filename> using a configuration file specific to that architecture.
pt_br: Para tornar o cross building do conjunto completo de arquiteturas suportadas em uma determinada branch mais rápido, mais fácil e reduzindo os fatores de erro humano, um script wrapper de apoio ao <filename>src/release/release.sh</filename> foi escrito para iterar pelas várias combinações de arquiteturas e chamar o script <filename>src/release/release.sh</filename> usando um arquivo de configuração específico para essa arquitetura.

source: The wrapper script is called <filename>thermite.sh</filename>, which is available in the FreeBSD Subversion repository at <literal>svn://svn.freebsd.org/base/user/gjb/thermite/</literal>, in addition to configuration files used to build <literal>head/</literal> and <literal>stable/<replaceable>12</replaceable>/</literal> development snapshots.
pt_br: O script wrapper é chamado de <filename>thermite.sh</filename>, o qual está disponível no repositório Subversion do FreeBSD em <literal>svn://svn.freebsd.org/base/user/gjb/thermite/</literal> , além dos arquivos de configuração usados para construir os snapshots de desenvolvimento <literal>head/</literal> e <literal>stable/<replaceable>12</replaceable>/</literal>.

source: Using <filename>thermite.sh</filename> is covered in <xref linkend="releng-build-snapshot"/> and <xref linkend="releng-build-release"/>.
pt_br: O uso do <filename>thermite.sh</filename> é explicado em <xref linkend="releng-build-snapshot"/> e <xref linkend="releng-build-release"/>.

source: Each architecture and individual kernel have their own configuration file used by <filename>release.sh</filename>. Each branch has its own <filename>defaults-X.conf</filename> configuration which contains entries common throughout each architecture, where overrides or special variables are set and/or overridden in the per-build files.
pt_br: Cada arquitetura e kernel individual tem seu próprio arquivo de configuração usado pelo <filename>release.sh</filename>. Cada branch tem sua própria configuração <filename>defaults-X.conf</filename> que contém entradas comuns em cada arquitetura, onde substituições ou variáveis especiais são definidas e/ou substituídas nos arquivos por compilação.

source: The per-build configuration file naming scheme is in the form of <filename>${revision}-${TARGET_ARCH}-${KERNCONF}-${type}.conf</filename>, where the uppercase variables are equivalent to what <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> uses in the build system, and lowercase variables are set within the configuration files, mapping to the major version of the respective branch.
pt_br: O esquema de nomenclatura do arquivo de configuração por compilação está na forma de <filename>${revision}-${TARGET_ARCH}-${KERNCONF}-${type}.conf</filename>, em que as variáveis em maiúsculas são equivalentes a que <citerefentry><refentrytitle>make</refentrytitle><manvolnum>1</manvolnum></citerefentry> usa no sistema de compilação e as variáveis minúsculas são definidas nos arquivos de configuração, mapeando para a versão principal da respectiva branch.

source: Each branch also has its own <filename>builds-X.conf</filename> configuration, which is used by <filename>thermite.sh</filename>. The <filename>thermite.sh</filename> script iterates through each ${revision}, ${TARGET_ARCH}, ${KERNCONF}, and ${type} value, creating a master list of what to build. However, a given combination from the list will only be built if the respective configuration file exists, which is where the naming scheme above is relevant.
pt_br: Cada branch também possui sua própria configuração <filename>builds-X.conf</filename>, que é usada pelo <filename>thermite.sh</filename>. O script <filename>thermite.sh</filename> itera através de cada valor ${revision}, ${TARGET_ARCH}, ${KERNCONF} e ${type}, criando uma lista principal do que construir. No entanto, uma determinada combinação da lista só será criada se o respectivo arquivo de configuração existir, que é onde o esquema de nomenclatura acima é relevante.

source: There are two paths of file sourcing:
pt_br: Existem dois caminhos de fornecimento de arquivos:

source: This controls <filename>thermite.sh</filename> behavior
pt_br: Isto controla o comportamento do <filename>thermite.sh</filename>

source: This controls <filename>release/release.sh</filename> behavior within the build <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry>
pt_br: Isto controla o comportamento do <filename>release/release.sh</filename> dentro do <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> de compilação

source: The <filename>builds-<replaceable>12</replaceable>.conf</filename>, <filename>defaults-<replaceable>12</replaceable>.conf</filename>, and <filename>main.conf</filename> configuration files exist to reduce repetition between the various per-build files.
pt_br: Os arquivos de configuração <filename>builds-<replaceable>12</replaceable>.conf</filename>, <filename>defaults-<replaceable>12</replaceable>.conf</filename>, e <filename>main.conf</filename> existem para reduzir a repetição entre os vários arquivos por compilação.

source: Building FreeBSD Development Snapshots
pt_br: Construindo Snapshots de Desenvolvimento do FreeBSD

source: The official release build machines have a specific filesystem layout, which using <acronym>ZFS</acronym>, <filename>thermite.sh</filename> takes heavy advantage of with clones and snapshots, ensuring a pristine build environment.
pt_br: As máquinas oficiais de compilação de versões têm um layout do sistema de arquivos específico, que utiliza <acronym>ZFS</acronym>, o <filename>thermite.sh</filename> tira grande proveito de clones e snapshots, garantindo um ambiente de compilação uniforme e consistente.

source: The build scripts reside in <filename class="directory">/releng/scripts-snapshot/scripts</filename> or <filename class="directory">/releng/scripts-release/scripts</filename> respectively, to avoid collisions between an <literal>RC</literal> build from a releng branch versus a <literal>STABLE</literal> snapshot from the respective stable branch.
pt_br: Os scripts de compilação localizam-se respectivamente em <filename class="directory">/releng/scripts-snapshot/scripts</filename> ou <filename class="directory">/releng/scripts-release/scripts</filename>, para evitar colisões entre uma compilação <literal>RC</literal> de uma branch releng contra um snapshot <literal>STABLE</literal> da respectiva branch stable.

source: A separate dataset exists for the final build images, <filename class="directory">/snap/ftp</filename>. This directory contains both snapshots and releases directories. They are only used if the <literal>EVERYTHINGISFINE</literal> variable is defined in <filename>main.conf</filename>.
pt_br: Existe um dataset (conjunto de dados) separado para as imagens finais de compilação, <filename class="directory">/snap/ftp</filename>. Este diretório contém diretórios de snapshots e releases. Eles são usados apenas se a variável <literal>EVERYTHINGISFINE</literal> estiver definida em <filename>main.conf</filename>.

source: The <literal>EVERYTHINGISFINE</literal> variable name was chosen to avoid colliding with a variable that might be possibly set in the user environment, accidentally enabling the behavior that depends on it being defined.
pt_br: O nome da variável <literal>EVERYTHINGISFINE</literal> foi escolhido para evitar a colisão com uma variável possivelmente definida no ambiente do usuário, ativando acidentalmente o comportamento que depende de sua definição.

source: As <filename>thermite.sh</filename> iterates through the master list of combinations and locates the per-build configuration file, a <acronym>ZFS</acronym> dataset is created under <filename class="directory">/releng</filename>, such as <filename class="directory">/releng/12-amd64-GENERIC-snap</filename>. The <literal>src/</literal>, <literal>ports/</literal>, and <literal>doc/</literal> trees are checked out to separate <acronym>ZFS</acronym> datasets, such as <filename class="directory">/releng/12-src-snap</filename>, which are then cloned and mounted into the respective build datasets. This is done to avoid checking out a given tree more than once.
pt_br: Como o <filename>thermite.sh</filename> percorre a lista principal de combinações e localiza o arquivo de configuração por compilação, um dataset <acronym>ZFS</acronym> é criado sob o <filename class="directory">/releng</filename>, tal como <filename class="directory">/releng/12-amd64-GENERIC-snap</filename>. O checkout das árvores <literal>src/</literal>, <literal>ports/</literal> e <literal>doc/</literal> é realizado em diferentes datasets <acronym>ZFS</acronym>, tal como <filename class="directory">/releng/12-src-snap</filename>, os quais são então clonados e montados nos respectivos datasets de compilação. Isso é feito para evitar a remoção de uma determinada árvore mais de uma vez.

source: Assuming these filesystem paths, <filename>thermite.sh</filename> would be invoked as:
pt_br: Assumindo esses caminhos do sistema de arquivos, o <filename>thermite.sh</filename> deveria ser chamado como:

source: Once the builds have completed, additional helper scripts are available to generate development snapshot emails which are sent to the <literal>freebsd-snapshots@freebsd.org</literal> mailing list:
pt_br: Quando as compilações forem concluídas, scripts adicionais auxiliares estarão disponíveis para gerar e-mails de snapshots de desenvolvimento que são enviados para a lista de e-mail <literal>freebsd-snapshots@freebsd.org</literal>:

source: The generated output should be double-checked for correctness, and the email itself should be PGP signed, in-line.
pt_br: A saída gerada deve ser checada duas vezes para garantir a exatidão, e o próprio e-mail deve ter assinatura PGP, in-line (no arquivo).

source: These helper scripts only apply to development snapshot builds. Announcements during the release cycle (excluding the final release announcement) are created from an email template. A sample of the email template currently used can be found <link xlink:href="https://svn.freebsd.org/base/user/gjb/thermite/non-release-template-mail.txt">here</link>.
pt_br: Esses scripts auxiliares aplicam-se apenas às compilações de snapshot (versão instantânea) de desenvolvimento. Os anúncios durante o ciclo de lançamento (excluindo o anúncio de versão final) são criados a partir de um modelo de email. Uma amostra do modelo de email usado atualmente pode ser encontrada <link xlink:href="https://svn.freebsd.org/base/user/gjb/thermite/non-release-template-mail.txt">aqui</link>.

source: Building FreeBSD Releases
pt_br: Construindo Releases do FreeBSD

source: Similar to building FreeBSD development snapshots, <filename>thermite.sh</filename> would be invoked the same way. The difference between development snapshots and release builds, <literal>BETA</literal> and <literal>RC</literal> included, is that the <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> configuration files must be named with <literal>release</literal> instead of <literal>snap</literal> as the "type", as mentioned above.
pt_br: Similar a compilação de snapshots de desenvolvimento do FreeBSD, o <filename>thermite.sh</filename> seria invocado da mesma maneira. A diferença entre snapshots de desenvolvimento e builds de releases, <literal>BETA</literal> e <literal>RC</literal> inclusos, é que os arquivos de configuração do <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> devem ser nomeados com <literal>release</literal> ao invés de <literal>snap</literal> no "type", como mencionado acima.

source: In addition, the <literal>BUILDTYPE</literal> and <literal>types</literal> must be changed from <literal>snap</literal> to <literal>release</literal> in <filename>defaults-<replaceable>12</replaceable>.conf</filename> and <filename>builds-<replaceable>12</replaceable>.conf</filename>, respectively.
pt_br: Além disso, <literal>BUILDTYPE</literal> e <literal>types</literal> devem ser alterados de <literal>snap</literal> para <literal>release</literal> em <filename>defaults-<replaceable>12</replaceable>.conf</filename> e <filename>builds-<replaceable>12</replaceable>.conf</filename>, respectivamente.

source: When building <literal>BETA</literal>, <literal>RC</literal>, and the final <literal>RELEASE</literal>, also statically set <literal>BUILDSVNREV</literal> to the revision on the branch reflecting the name change, <literal>BUILDDATE</literal> to the date the builds are started in <literal>YYYYMMDD</literal> format. If the <literal>doc/</literal> and <literal>ports/</literal> trees have been tagged, also set <literal>PORTBRANCH</literal> and <literal>DOCBRANCH</literal> to the relevant tag path in the Subversion repository, replacing <literal>HEAD</literal> with the last changed revision. Also set <literal>releasesrc</literal> in <filename>builds-<replaceable>12</replaceable>.conf</filename> to the relevant branch, such as <literal>stable/<replaceable>12</replaceable>/</literal> or <literal>releng/<replaceable>12.0</replaceable>/</literal>.
pt_br: Ao construir o <literal>BETA</literal>, o <literal>RC</literal>, e o <literal>RELEASE</literal> final, também ajuste estaticamente o <literal>BUILDSVNREV</literal> para a revisão na branch refletindo a mudança de nome, <literal>BUILDDATE</literal> para a data em que as compilações são iniciadas no formato <literal>YYYYMMDD</literal>. Se as árvores <literal>doc/</literal> e <literal>ports/</literal> tiverem sido marcadas, defina também o <literal>PORTBRANCH</literal> e o <literal>DOCBRANCH</literal> para o caminho da tag relevante no repositório Subversion, substituindo <literal>HEAD</literal> pela última revisão alterada. Também defina <literal>releasesrc</literal> em <filename>builds-<replaceable>12</replaceable>.conf </filename> para a branch relevante, como <literal>stable/<replaceable>12</replaceable>/</literal> ou <literal>releng/<replaceable>12.0</replaceable>/</literal>.

source: During the release cycle, a copy of <filename>CHECKSUM.SHA512</filename> and <filename>CHECKSUM.SHA256</filename> for each architecture are stored in the FreeBSD Release Engineering Team internal repository in addition to being included in the various announcement emails. Each <filename>MANIFEST</filename> containing the hashes of <filename>base.txz</filename>, <filename>kernel.txz</filename>, etc. are added to <package>misc/freebsd-release-manifests</package> in the Ports Collection, as well.
pt_br: Durante o ciclo de release, uma cópia do <filename>CHECKSUM.SHA512</filename> e do <filename>CHECKSUM.SHA256</filename> para cada arquitetura é armazenada no repositório interno da Equipe de Engenharia de Release do FreeBSD, além de ser incluída nos diversos e-mails de anúncio. Cada <filename>MANIFEST</filename> contendo os hashes do <filename>base.txz</filename>, do <filename>kernel.txz</filename>, etc. também são adicionados ao <package>misc/freebsd-release-manifests</package> na coleção de ports.

source: In preparation for the release build, several files need to be updated:
pt_br: Na preparação para a compilação da release, vários arquivos precisam ser atualizados:

source: Update the <varname>BRANCH</varname> value to <literal>RELEASE</literal>
pt_br: Atualize o valor <varname>BRANCH</varname> para <literal>RELEASE</literal>

source: Add the anticipated announcement date
pt_br: Adicione a data prevista do anúncio

source: Replace <literal>__FreeBSD_version</literal> with the value in <filename>sys/sys/param.h</filename>
pt_br: Altere <literal>__FreeBSD_version</literal> com o valor em <filename>sys/sys/param.h</filename>

source: After building the final <literal>RELEASE</literal>, the <literal>releng/<replaceable>12.0</replaceable>/</literal> branch is tagged as <literal>release/<replaceable>12.0.0</replaceable>/</literal> using the revision from which the <literal>RELEASE</literal> was built. Similar to creating the <literal>stable/<replaceable>12</replaceable>/</literal> and <literal>releng/<replaceable>12.0</replaceable>/</literal> branches, this is done with <command>svn cp</command>. From the repository root:
pt_br: Depois de construir a <literal>RELEASE</literal> final, a branch <literal>releng/<replaceable>12.0</replaceable>/</literal> é marcada como <literal>release/<replaceable>12.0.0</replaceable>/</literal> usando a revisão a partir da qual a <literal>RELEASE</literal> foi construída. Semelhante a criar as branches <literal>stable/<replaceable>12</replaceable>/</literal> e <literal>releng/<replaceable>12.0</replaceable>/</literal>, isso é feito com <command>svn cp</command>. Da raiz do repositório:

source: Publishing FreeBSD Installation Media to Project Mirrors
pt_br: Publicando a Mídia de Instalação do FreeBSD nos Espelhos do Projeto

source: This section describes the procedure to publish FreeBSD development snapshots and releases to the Project mirrors.
pt_br: Esta seção descreve o procedimento para publicar snapshots e releases de desenvolvimento do FreeBSD nos espelhos do Projeto.

source: Staging FreeBSD Installation Media Images
pt_br: Preparando Imagens de Mídias de Instalação do FreeBSD

source: Staging FreeBSD snapshots and releases is a two part process:
pt_br: A preparação dos snapshots e das versões do FreeBSD é um processo de duas partes:

source: Creating the directory structure to match the hierarchy on <systemitem>ftp-master</systemitem>
pt_br: Criando a estrutura de diretórios para corresponder a hierarquia em <systemitem>ftp-master</systemitem>

source: If <literal>EVERYTHINGISFINE</literal> is defined in the build configuration files, <filename>main.conf</filename> in the case of the build scripts referenced above, this happens automatically in the <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> after the build is complete, creating the directory structure in <filename class="directory">${DESTDIR}/R/ftp-stage</filename> with a path structure matching what is expected on <systemitem>ftp-master</systemitem>. This is equivalent to running the following in the <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> directly:
pt_br: Se <literal>EVERYTHINGISFINE</literal> for definido nos arquivos de configuração de compilação, <filename>main.conf</filename> no caso dos scripts de compilação mencionados acima, isto acontece automaticamente no <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> após a compilação ser concluída, criando a estrutura de diretório em <filename class="directory">${DESTDIR}/R/ftp-stage</filename> com um estrutura de caminho que corresponde ao que é esperado em <systemitem>ftp-master</systemitem>. Isto é equivalente a executar o seguinte diretamente no <citerefentry><refentrytitle>chroot</refentrytitle> <manvolnum>8</manvolnum></citerefentry>:
