Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/freebsd-releng/*.po
Languages: pt_br

source: After each architecture is built, <filename>thermite.sh</filename> will <application>rsync</application> the <filename class="directory">${DESTDIR}/R/ftp-stage</filename> from the build <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> to <filename class="directory">/snap/ftp/snapshots</filename> or <filename class="directory">/snap/ftp/releases</filename> on the build host, respectively.
pt_br: Depois que cada arquitetura é compilada, o <filename>thermite.sh</filename> irá fazer um <application>rsync</application> do <filename class="directory">${DESTDIR}/R/ftp-stage</filename> da compilação <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> para o diretório <filename class="directory">/snap/ftp/snapshots</filename> ou <filename class="directory">/snap/ftp/releases</filename> no host de compilação, respectivamente.

source: Copying the files to a staging directory on <systemitem>ftp-master</systemitem> before moving the files into <filename class="directory">pub/</filename> to begin propagation to the Project mirrors
pt_br: Copiando os arquivos para um diretório temporário em <systemitem>ftp-master </systemitem> antes de mover os arquivos para <filename class="directory">pub/</filename> para iniciar a propagação para os servidores espelhos do Projeto

source: Once all builds have finished, <filename class="directory">/snap/ftp/snapshots</filename>, or <filename class="directory">/snap/ftp/releases</filename> for a release, is polled by <systemitem>ftp-master</systemitem> using <application>rsync</application> to <filename class="directory">/archive/tmp/snapshots</filename> or <filename class="directory">/archive/tmp/releases</filename>, respectively.
pt_br: Uma vez que todas as compilações terminarem, <filename class="directory">/snap/ftp/snapshots</filename>, ou <filename class="directory">/snap/ftp/releases</filename> para uma versão, é pesquisado pelo <systemitem>ftp-master</systemitem> usando <application>rsync</application> para <filename class="directory">/archive/tmp/snapshots</filename> ou <filename class="directory">/archive/tmp/releases</filename>, respectivamente.

source: On <systemitem>ftp-master</systemitem> in the FreeBSD Project infrastructure, this step requires <literal>root</literal> level access, as this step must be executed as the <literal>archive</literal> user.
pt_br: No <systemitem>ftp-master</systemitem> na infraestrutura do Projeto FreeBSD, esta etapa requer acesso ao nível de <literal>root</literal>, já que esta etapa deve ser executada como o usuário <literal>archive</literal>.

source: Publishing FreeBSD Installation Media
pt_br: Publicando a Mídia de Instalação do FreeBSD

source: Once the images are staged in <filename class="directory">/archive/tmp/</filename>, they are ready to be made public by putting them in <filename class="directory">/archive/pub/FreeBSD</filename>. In order to reduce propagation time, <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> is used to create hard links from <filename class="directory">/archive/tmp</filename> to <filename class="directory">/archive/pub/FreeBSD</filename>.
pt_br: Uma vez que as imagens são colocadas em <filename class="directory">/archive/tmp/</filename>, elas estão prontas para serem publicadas colocando-as em <filename class="directory">/archive/pub/FreeBSD</filename>. Para reduzir o tempo de propagação, o <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> é usado para criar links físicos a partir de <filename class="directory">/archive/tmp</filename> para <filename class="directory">/archive/pub/FreeBSD</filename>.

source: In order for this to be effective, both <filename class="directory">/archive/tmp</filename> and <filename class="directory">/archive/pub</filename> must reside on the same logical filesystem.
pt_br: Para que isto seja efetivo, tanto o <filename class="directory">/archive/tmp</filename> quanto o <filename class="directory">/archive/pub</filename> devem residir no mesmo sistema de arquivos lógico.

source: There is a caveat, however, where <application>rsync</application> must be used after <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> in order to correct the symbolic links in <filename class="directory">pub/FreeBSD/<replaceable>snapshots</replaceable>/ISO-IMAGES</filename> which <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> will replace with a hard link, increasing the propagation time.
pt_br: Há uma ressalva, no entanto, em que o <application>rsync</application> deve ser usado após o <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> para corrigir os links simbólicos no <filename class="directory">pub/FreeBSD/<replaceable>snapshots</replaceable>/ISO-IMAGES</filename> que o <citerefentry><refentrytitle>pax</refentrytitle><manvolnum>1</manvolnum></citerefentry> irá substituir por um hard link, aumentando o tempo de propagação.

source: As with the staging steps, this requires <literal>root</literal> level access, as this step must be executed as the <literal>archive</literal> user.
pt_br: Assim como nas etapas de preparação, isto requer acesso em nível de <literal>root</literal>, já que essa etapa deve ser executada como o usuário <literal>archive</literal>.

source: As the <literal>archive</literal> user:
pt_br: Como o usuário <literal>archive</literal>:

source: Replace <replaceable>snapshots</replaceable> with <replaceable>releases</replaceable> as appropriate.
pt_br: Substitua os <replaceable>snapshots</replaceable> por <replaceable>releases</replaceable> conforme apropriado.

source: Wrapping up the Release Cycle
pt_br: Encerrando o Ciclo de Release

source: This section describes general post-release tasks.
pt_br: Esta seção descreve as tarefas gerais de pós-release.

source: Post-Release Errata Notices
pt_br: Avisos de Erratas de Pós-Release

source: As the release cycle approaches conclusion, it is common to have several <acronym>EN</acronym> (Errata Notice) candidates to address issues that were discovered late in the cycle. Following the release, the FreeBSD Release Engineering Team and the FreeBSD Security Team revisit changes that were not approved prior to the final release, and depending on the scope of the change in question, may issue an <acronym>EN</acronym>.
pt_br: A medida que o ciclo de release se aproxima da conclusão, é comum ter vários candidatos a <acronym>EN</acronym> (Aviso de Erratas) para abordar os problemas que foram descobertos ao final do ciclo. Após o lançamento, a Equipe de Engenharia de Release do FreeBSD e a Equipe de Segurança do FreeBSD reveem mudanças que não foram aprovadas antes da versão final, e dependendo do escopo da mudança em questão, podem emitir um <acronym>EN</acronym>.

source: The actual process of issuing <acronym>EN</acronym>s is handled by the FreeBSD Security Team.
pt_br: O processo atual de emissão de <acronym>EN</acronym>s é tratado pela Equipe de Segurança do FreeBSD.

source: To request an Errata Notice after a release cycle has completed, a developer should fill out the <link xlink:href="https://www.freebsd.org/security/errata-template.txt">Errata Notice template</link>, in particular the <literal>Background</literal>, <literal>Problem Description</literal>, <literal>Impact</literal>, and if applicable, <literal>Workaround</literal> sections.
pt_br: Para solicitar uma Errata após a conclusão de um ciclo de lançamento, o desenvolvedor deve preencher o <link xlink:href="https://www.freebsd.org/security/errata-template.txt">Template de Errata</link>>, em particular as seções <literal>Background</literal>, <literal>Problem Description</literal>, <literal>Impact</literal> e, se aplicável, as seções <literal>Workaround</literal>.

source: The completed Errata Notice template should be emailed together with either a patch against the <literal>releng/</literal> branch or a list of revisions from the <literal>stable/</literal> branch.
pt_br: O modelo de Errata preenchido deve ser enviado por e-mail juntamente com um patch na branch <literal>releng/</literal> ou uma lista de revisões da branch <literal>stable/</literal>.

source: For Errata Notice requests immediately following the release, the request should be emailed to both the FreeBSD Release Engineering Team and the FreeBSD Security Team. Once the <literal>releng/</literal> branch has been handed over to the FreeBSD Security Team as described in <xref linkend="releng-wrapup-handoff"/>, Errata Notice requests should be sent to the FreeBSD Security Team.
pt_br: Para pedidos de Errata imediatamente após o lançamento, o pedido deve ser enviado por e-mail à Equipe de Engenharia de Releases do FreeBSD e à Equipe de Segurança do FreeBSD. Depois que a branch <literal>releng/</literal> foi entregue à equipe de Segurança do FreeBSD, conforme descrito em <xref linkend="releng-wrapup-handoff"/>, as solicitações de Errata devem ser enviadas à equipe de Segurança do FreeBSD.

source: Handoff to the FreeBSD Security Team
pt_br: Entrega para a Equipe de Segurança do FreeBSD

source: Roughly two weeks following the release, the Release Engineer updates <filename>svnadmin/conf/approvers</filename> changing the approver column from <literal>re</literal> to <literal>(so|security-officer)</literal> for the <literal>releng/<replaceable>12.0</replaceable>/</literal> branch.
pt_br: Aproximadamente duas semanas após o lançamento, o Engenheiro de Release atualiza o <filename>svnadmin/conf/approvers</filename> alterando a coluna do aprovador de <literal>re</literal> para <literal>(so|security-officer)</literal> para a branch <literal>releng/<replaceable>12.0</replaceable>/</literal>.

source: Release End-of-Life
pt_br: Fim de Vida (End-of-Life) de Releases

source: This section describes the website-related files to update when a release reaches <acronym>EoL</acronym> (End-of-Life).
pt_br: Esta seção descreve os arquivos relacionados ao website que precisam ser atualizados quando uma release atingir o <acronym>EoL</acronym> (End-of-Life).

source: Website Updates for End-of-Life
pt_br: Atualizações do Website para End-of-Life

source: When a release reaches End-of-Life, references to that release should be removed and/or updated on the website:
pt_br: Quando uma release atinge o End-of-Life, as referências para essa release precisam ser removidas ou atualizadas no website:

source: File
pt_br: Arquivo

source: Remove <literal>&amp;u.relXXX.announce;</literal> and <literal>&amp;u.relXXX.current;</literal> references.
pt_br: Remover referências <literal>&amp;u.relXXX.announce;</literal> e <literal>&amp;u.relXXX.current;</literal>.

source: Move the &amp;u.relXXX.*; macros from the supported release list to the Legacy Releases list.
pt_br: Mova as macros &amp;u.relXXX.*; da lista de releases suportadas para a lista de Releases Legadas.

source: Update the appropriate releng branch to refelect the branch is no longer supported.
pt_br: Atualizar a branch releng em questão para refletir que a branch não é mais suportada.

source: Remove the branch from the supported branch list.
pt_br: Remover a branch da lista de branchs suportadas.

source: Remove the URLs for the release.
pt_br: Remover as URLs da release.

source: Remove references to the release and releng branch.
pt_br: Remover referências da release e releng branch.
