Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/freebsd-releng/*.po
Languages: pt_br

# _
source: translator-credits
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Lucas Andrade, slucasandrade@protonmail.ch, 2018 André Franciosi, andre@franciosi.org, 2018 Vinícius Zavam, egypcio@googlemail.com, 2018 Silvio Ap Silva, contato@kanazuchi.com, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2020

source: FreeBSD Release Engineering
pt_br: Engenharia de Release do FreeBSD

source: This article describes the release engineering process of the FreeBSD Project.
pt_br: Este artigo descreve o processo por trás do modelo de engenharia de release adotado pelo Projeto FreeBSD.

source: Introduction to the FreeBSD Release Engineering Process
pt_br: Introdução ao Processo de Engenharia de Release do FreeBSD

source: Development of FreeBSD has a very specific workflow. In general, all changes to the FreeBSD base system are committed to the <literal>head/</literal> branch, which reflects the top of the source tree.
pt_br: O desenvolvimento do FreeBSD segue um fluxo muito específico. Em geral, todas as mudanças no sistema base do FreeBSD são feitas em uma branch chamada <literal>head/</literal>, a qual reflete o topo da árvore de código fonte.

source: After a reasonable testing period, changes can then be merged to the <literal>stable/</literal> branches. The default minimum timeframe before merging to <literal>stable/</literal> branches is three (3) days.
pt_br: Após um período razoável de testes, as alterações podem ser fundidas na branch <literal>stable/</literal>. O período de tempo mínimo padrão antes da fusão das alterações na branch <literal>stable/</literal> é de três (3) dias.

source: Although a general rule to wait a minimum of three days before merging from <literal>head/</literal>, there are a few special circumstances where an immediate merge may be necessary, such as a critical security fix, or a bug fix that directly inhibits the release build process.
pt_br: Embora seja uma regra geral esperar pelo menos três (3) dias antes de fundir o código produzido na branch <literal>head/</literal>, existem algumas circunstâncias especiais em que uma fusão imediata pode ser necessária, tal como uma correção de segurança crítica ou uma correção de bug que inibe diretamente o processo de compilação de uma release.

source: After several months, and the number of changes in the <literal>stable/</literal> branch have grown significantly, it is time to release the next version of FreeBSD. These releases have been historically referred to as <quote>point</quote> releases.
pt_br: Após vários meses, quando o número de mudanças na branch <literal>stable/</literal> cresceu significativamente, é hora de lançar a próxima versão do FreeBSD. Essas versões foram historicamente chamadas de <quote>point</quote> releases.

source: In between releases from the <literal>stable/</literal> branches, approximately every two (2) years, a release will be cut directly from <literal>head/</literal>. These releases have been historically referred to as <quote>dot-zero</quote> releases.
pt_br: Entre as versões das branches <literal>stable/</literal>, aproximadamente a cada dois (2) anos, uma nova versão é criada vinda diretamente da branch <literal>head/</literal>. Essas versões foram historicamente chamadas de versões <quote>dot-zero</quote>.

source: This article will highlight the workflow and responsibilities of the FreeBSD Release Engineering Team for both <quote>dot-zero</quote> and <quote>point</quote>' releases.
pt_br: Este artigo irá destacar o fluxo de trabalho e as responsabilidades da Equipe de Engenharia de Release do FreeBSD para ambas as versões <quote>dot-zero</quote> e <quote>point release</quote>.

source: The following sections of this article describe:
pt_br: As seções a seguir deste artigo descrevem:

source: General information and preparation before starting the release cycle.
pt_br: Informações gerais e preparativos antes de iniciar o ciclo de release.

source: Website Changes During the Release Cycle
pt_br: Alterações na Página Web Durante o Ciclo de Release

source: Terminology and general information, such as the <quote>code slush</quote> and <quote>code freeze</quote>, used throughout this document.
pt_br: Terminologia e informações gerais, como <quote>code slush</quote> e <quote>code freeze</quote>, usadas por todo este documento.

source: The Release Engineering process for a <quote>dot-zero</quote> release.
pt_br: O processo de Engenharia de Release para uma versão <quote>dot-zero</quote>.

source: The Release Engineering process for a <quote>point</quote> release.
pt_br: O processo de Engenharia de Release para uma versão <quote>point release</quote>.

source: Information related to the specific procedures to build installation medium.
pt_br: Informações relacionadas aos procedimentos específicos para construir o meio de instalação.

source: Procedures to publish installation medium.
pt_br: Procedimentos para publicar um meio de instalação.

source: Wrapping up the release cycle.
pt_br: Encerrando o ciclo de release.

source: General Information and Preparation
pt_br: Informação Geral e Preparativos

source: Approximately two months before the start of the release cycle, the FreeBSD Release Engineering Team decides on a schedule for the release. The schedule includes the various milestone points of the release cycle, such as freeze dates, branch dates, and build dates. For example:
pt_br: Aproximadamente dois meses antes do início do ciclo de vida de uma nova versão, a Equipe de Engenharia de Release do FreeBSD decide sobre um cronograma para o seu lançamento. A programação inclui os vários milestones do ciclo de release, como datas de congelamento, datas para as branches e datas para compilação do código. Por exemplo:

source: Anticipated Date
pt_br: Data prevista

source: <literal>head/</literal> slush:
pt_br: pré congelamento da <literal>head/</literal>:

source: May 27, 2016
pt_br: 27 de maio de 2016

source: <literal>head/</literal> freeze:
pt_br: Congelamento da <literal>head/</literal>:

source: June 10, 2016
pt_br: 10 de junho de 2016

source: <literal>head/</literal> KBI freeze:
pt_br: Congelamento de KBI da <literal>head/</literal>:

source: June 24, 2016
pt_br: 24 de junho de 2016

source: <literal>doc/</literal> tree slush [1]:
pt_br: Pré congelamento da árvore <literal>doc/</literal> [1]:

source: Ports quarterly branch [2]:
pt_br: Branch trimestral dos ports [2]:

source: July 1, 2016
pt_br: 1º de julho de 2016

source: <literal>stable/<replaceable>12</replaceable>/</literal> branch:
pt_br: branch <literal>stable/<replaceable>12</replaceable>/</literal>:

source: July 8, 2016
pt_br: 8 de julho de 2016

source: <literal>doc/</literal> tree tag [3]:
pt_br: Aplicação da tag na árvore <literal>doc/</literal> [3]:

source: BETA1 build starts:
pt_br: Começa a compilação da fase BETA1:

source: <literal>head/</literal> thaw:
pt_br: descongelamento da branch <literal>head/</literal>:

source: July 9, 2016
pt_br: 9 de julho de 2016

source: BETA2 build starts:
pt_br: Começa a compilação da fase BETA2:

source: July 15, 2016
pt_br: 15 de julho de 2016

source: BETA3 build starts [*]:
pt_br: Começa a compilação da fase BETA3 [*]:

source: July 22, 2016
pt_br: 22 de julho de 2016

source: <literal>releng/<replaceable>12.0</replaceable>/</literal> branch:
pt_br: branch <literal>releng/<replaceable>12.0</replaceable>/</literal>:

source: July 29, 2016
pt_br: 29 de julho de 2016

source: RC1 build starts:
pt_br: A compilação da fase RC1 é iniciada:

source: <literal>stable/<replaceable>12</replaceable>/</literal> thaw:
pt_br: descongelamento da branch <literal>stable/<replaceable>12</replaceable>/</literal>:

source: July 30, 2016
pt_br: 30 de julho de 2016

source: RC2 build starts:
pt_br: Começa a compilação da fase RC2:

source: August 5, 2016
pt_br: 5 de agosto de 2016

source: Final Ports package builds [4]:
pt_br: Última compilação dos ports [4]:

source: August 6, 2016
pt_br: 6 de agosto de 2016

source: Ports release tag:
pt_br: Aplicação da tag na árvore dos ports:

source: August 12, 2016
pt_br: 12 de agosto de 2016

source: RC3 build starts [*]:
pt_br: compilação da fase RC3 [*]:

source: RELEASE build starts:
pt_br: início de compilação da RELEASE:

source: August 19, 2016
pt_br: 19 de agosto de 2016

source: RELEASE announcement:
pt_br: Anúncio da RELEASE:

source: September 2, 2016
pt_br: 2 de setembro de 2016

source: Items marked with "[*]" are "as needed".
pt_br: Itens marcados com "[*]" identificam passos executados apenas "conforme necessário".

source: The <literal>doc/</literal> tree slush is coordinated by the FreeBSD Documentation Engineering Team.
pt_br: O pré congelamento da árvore <literal>doc</literal> é coordenado pela Equipe de Engenharia de Documentação do FreeBSD.

source: The Ports quarterly branch used is determined by when the final <literal>RC</literal> build is planned. A new quarterly branch is created on the first day of the quarter, so this metric should be used when taking the release cycle milestones into account. The quarterly branch is created by the FreeBSD Ports Management Team.
pt_br: A branch trimestral da árvore da coleção de ports é determinada quando a compilação final da fase <literal>RC</literal> é planejada. Uma nova branch trimestral é criada no primeiro dia do trimestre, portanto, essa métrica deve ser usada ao considerar os marcos do ciclo de release. Uma branch trimestral é criada pela Equipe de Gerenciamento de Ports do FreeBSD.

source: The <literal>doc/</literal> tree is tagged by the FreeBSD Documentation Engineering Team.
pt_br: A árvore <literal>doc</literal> é recebe a tag da Equipe de Engenharia de Documentação do FreeBSD.

source: The final Ports package build is done by the FreeBSD Ports Management Team after the final (or what is expected to be final) <literal>RC</literal> build.
pt_br: A compilação final dos pacotes é feita pela Equipe de Gerenciamento de Ports do FreeBSD após a compilação final (ou o que é esperada ser a final) de uma fase <literal>RC</literal>.

source: If the release is being created from an existing <literal>stable/</literal> branch, the <acronym>KBI</acronym> freeze date can be excluded, since the <acronym>KBI</acronym> is already considered frozen on established <literal>stable/</literal> branches.
pt_br: Se a versão RELEASE estiver sendo criada a partir de uma branch <literal>stable</literal> existente, a data de congelamento do <acronym>KBI</acronym> poderá ser excluída, já que o <acronym>KBI</acronym> já está congelado em branchs <literal>stable</literal>.

source: When writing the release cycle schedule, a number of things need to be taken into consideration, in particular milestones where the target date depends on predefined milestones upon which there is a dependency. For example, the Ports Collection release tag originates from the active quarterly branch at the time of the last <literal>RC</literal>. This in part defines which quarterly branch is used, when the release tag can happen, and what revision of the ports tree is used for the final <literal>RELEASE</literal> build.
pt_br: Ao escrever o cronograma do ciclo de versões, várias coisas precisam ser levadas em consideração, em particular os milestones nos quais a data alvo depende de milestones pré-definidos sobre os quais existe uma dependência. Por exemplo, a aplicação da tag de release da Coleção de Ports é originada da branch trimestral ativa no momento da última fase do <literal>RC</literal>. Isso em parte define qual branch trimestral é usada, quando a aplicação da tag pode acontecer e qual revisão da árvore de ports é usada para a construção final de uma <literal>RELEASE</literal>.

source: After general agreement on the schedule, the FreeBSD Release Engineering Team emails the schedule to the FreeBSD Developers.
pt_br: Depois de um acordo geral sobre o cronograma, a Equipe de Engenharia de Release do FreeBSD envia e-mails para os desenvolvedores do FreeBSD.

source: It is somewhat typical that many developers will inform the FreeBSD Release Engineering Team about various works-in-progress. In some cases, an extension for the in-progress work will be requested, and in other cases, a request for <quote>blanket approval</quote> to a particular subset of the tree will be made.
pt_br: É normal que muitos desenvolvedores informem a Equipe de Engenharia de Release do FreeBSD sobre vários trabalhos em andamento. Em alguns casos, uma extensão para o trabalho em andamento será solicitada e, em outros casos, uma solicitação para uma <quote>aprovação geral</quote> para um subconjunto específico da árvore será feita.

source: When such requests are made, it is important to make sure timelines (even if estimated) are discussed. For blanket approvals, the length of time for the blanket approval should be made clear. For example, a FreeBSD developer may request blanket approvals from the start of the code slush until the start of the <literal>RC</literal> builds.
pt_br: Quando tais solicitações são feitas, é importante certificar-se de que os cronogramas (mesmo que estimados) sejam discutidos. Para as aprovações gerais, o período de tempo para a aprovação geral deve ser claro. Por exemplo, um desenvolvedor do FreeBSD pode solicitar aprovações gerais desde o início do code slush até o início da construção da primeira <literal>RC</literal>.

source: In order to keep track of blanket approvals, the FreeBSD Release Engineering Team uses an internal repository to keep a running log of such requests, which defines the area upon which a blanket approval was granted, the author(s), when the blanket approval expires, and the reason the approval was granted. One example of this is granting blanket approval to <filename class="directory">release/doc/</filename> to all FreeBSD Release Engineering Team members until the final <literal>RC</literal> to update the release notes and other release-related documentation.
pt_br: Para manter o controle das aprovações gerais, a Equipe de Engenharia de Release do FreeBSD usa um repositório interno para manter um registro de tais solicitações, que define a área na qual uma aprovação geral foi concedida, o(s) autor(es), quando a aprovação geral expira e a razão pela qual a aprovação foi concedida. Um exemplo disso é a concessão de uma aprovação geral na <filename class="directory">release/doc/</filename> a todos os membros da Equipe de Engenharia de Release do FreeBSD até o <literal>RC</literal> final para atualizar as notas de lançamento e outras documentação relacionada ao lançamento.

source: The FreeBSD Release Engineering Team also uses this repository to track pending approval requests that are received just prior to starting various builds during the release cycle, which the Release Engineer specifies the cutoff period with an email to the FreeBSD developers.
pt_br: A Equipe de Engenharia de Release do FreeBSD também usa este repositório para rastrear solicitações de aprovação pendentes que são recebidas antes de iniciar várias compilações durante o ciclo de release, que o Engenheiro de Release especifica o período de corte com um email para os desenvolvedores do FreeBSD.

source: Depending on the underlying set of code in question, and the overall impact the set of code has on FreeBSD as a whole, such requests may be approved or denied by the FreeBSD Release Engineering Team.
pt_br: Dependendo do conjunto de código subjacente em questão, e do impacto geral que o conjunto de código tem no FreeBSD como um todo, tais solicitações podem ser aprovadas ou negadas pela Equipe de Engenharia de Release do FreeBSD.

source: The same applies to work-in-progress extensions. For example, in-progress work for a new device driver that is otherwise isolated from the rest of the tree may be granted an extension. A new scheduler, however, may not be feasible, especially if such dramatic changes do not exist in another branch.
pt_br: O mesmo se aplica às extensões de trabalho em andamento. Por exemplo, o trabalho em andamento para um novo driver de dispositivo que de outra forma é isolado do restante da árvore pode receber uma extensão. Um novo scheduler, no entanto, pode não ser viável, especialmente se tais mudanças dramáticas não existirem em outra branch.

source: The schedule is also added to the Project website, in the <literal>doc/</literal> repository, in <filename>head/en_US.ISO8859-1/htdocs/releases/<replaceable>12.0</replaceable>R/schedule.xml</filename>. This file is continuously updated as the release cycle progresses.
pt_br: O cronograma também é adicionado ao site do projeto, no repositório <literal>doc</literal>, em <filename>head/en_US.ISO8859-1/htdocs/releases/<replaceable>12.0</replaceable>R/schedule.xml</filename>. Este arquivo é continuamente atualizado conforme o ciclo progride.

source: In most cases, the <filename>schedule.xml</filename> can be copied from a prior release and updated accordingly.
pt_br: Na maioria dos casos, o <filename>schedule.xml</filename> pode ser copiado de uma versão anterior e atualizado de acordo.

source: In addition to adding <filename>schedule.xml</filename> to the website, <filename>head/share/xml/navibar.ent</filename> and <filename>head/share/xml/release.ent</filename> are also updated to add the link to the schedule to various subpages, as well as enabling the link to the schedule on the Project website index page.
pt_br: Além de adicionar o <filename>schedule.xml</filename> ao site, o <filename>head/share/xml/navibar.ent</filename> e o <filename>head/share/xml/release.ent</filename> também são atualizados para adicionar o link para o cronograma em várias subpáginas, bem como para habilitar o link para o cronograma na página principal do website do projeto.

source: The schedule is also linked from <filename>head/en_US.ISO8859-1/htdocs/releng/index.xml</filename>.
pt_br: O cronograma também chamado a partir de <filename>head/en_US.ISO8859-1/htdocs/releng/index.xml</filename>.

source: Approximately one month prior to the scheduled <quote>code slush</quote>, the FreeBSD Release Engineering Team sends a reminder email to the FreeBSD Developers.
pt_br: Aproximadamente um mês antes do <quote>code slush</quote>, a Equipe de Engenharia de Release do FreeBSD envia um email de lembrete para os desenvolvedores do FreeBSD.

source: Once the first builds of the release cycle are available, update the <literal>beta.local.where</literal> entity in <filename>head/en_US.ISO8859-1/htdocs/releases/<replaceable>12.0</replaceable>R/schedule.xml</filename>. replacing <literal>IGNORE</literal> with <literal>INCLUDE</literal>.
pt_br: Uma vez que as primeiras compilações do ciclo de release estejam disponíveis, atualize a entidade <literal>beta.local.where</literal> em <filename>head/en_US.ISO8859-1/htdocs/releases/<replaceable>12.0</replaceable>R/schedule.xml</filename>. substituindo <literal>IGNORE</literal> por <literal>INCLUDE</literal>.

source: If two parallel release cycles are happening at once, the <literal>beta2.local.where</literal> entity may be used instead.
pt_br: Se dois ciclos de lançamento paralelo estão acontecendo ao mesmo tempo, a entidade <literal>beta2.local.where</literal> pode ser usada no lugar.

source: Release Engineering Terminology
pt_br: Terminologia da Engenharia de Release

source: This section describes some of the terminology used throughout the rest of this document.
pt_br: Esta seção descreve algumas das terminologias usadas no restante deste documento.

source: The Code Slush
pt_br: O Code Slush

source: Although the code slush is not a hard freeze on the tree, the FreeBSD Release Engineering Team requests that bugs in the existing code base take priority over new features.
pt_br: Embora o code slush não seja um congelamento mandatório da árvore, a Equipe de Engenharia de Release do FreeBSD solicita que resoluções dos bugs existentes no código tenham prioridade sobre implementação de novos recursos.

source: The code slush does not enforce commit approvals to the branch.
pt_br: O code slush não impõe aprovações de confirmação para o Branch.

source: The Code Freeze
pt_br: O Code Freeze

source: The code freeze marks the point in time where all commits to the branch require explicit approval from the FreeBSD Release Engineering Team.
pt_br: O code freeze marca o momento em que todos os commits para a branch exigem aprovação explícita da Equipe de Engenharia de Release do FreeBSD.

source: The FreeBSD <application>Subversion</application> repository contains several hooks to perform sanity checks before any commit is actually committed to the tree. One of these hooks will evaluate if committing to a particular branch requires specific approval.
pt_br: O repositório <application>Subversion</application> do FreeBSD contém vários ganchos para executar verificações de integridade antes que qualquer commit seja realmente confirmado na árvore. Um desses ganchos avaliará se o comprometimento com uma branch específica requer aprovação específica.

source: To enforce commit approvals by the FreeBSD Release Engineering Team, the Release Engineer updates <filename>base/svnadmin/conf/approvers</filename>, and commits the change back to the repository. Once this is done, any change to the branch must include an <quote>Approved by:</quote> line in the commit message.
pt_br: Para impor aprovações de commit pela Equipe de Engenharia de Release do FreeBSD, o Engenheiro de Release atualiza o <filename>base/svnadmin/conf/approvers</filename>, e aplica a mudança de volta para o repositório. Feito isso, qualquer alteração na branch deve incluir uma linha <quote>Aprovado por:</quote> na mensagem de commit.

source: The <quote>Approved by:</quote> line must match the second column in <filename>base/svnadmin/conf/approvers</filename>, otherwise the commit will be rejected by the repository hooks.
pt_br: A linha <quote>Aprovada por:</quote> deve corresponder à segunda coluna em <filename>base/svnadmin/conf/aprovovers </filename>, caso contrário, o commit será rejeitado pelos hooks do repositório.

source: During the code freeze, FreeBSD committers are urged to follow the <link xlink:href="https://wiki.freebsd.org/Releng/ChangeRequestGuidelines">Change Request Guidelines</link>.
pt_br: Durante o code freeze, os committers do FreeBSD devem seguir as <link xlink:href="https://wiki.freebsd.org/Releng/ChangeRequestGuidelines">Recomendações de Requisição de Mudanças</link>.

source: The <acronym>KBI</acronym>/<acronym>KPI</acronym> Freeze
pt_br: O <acronym>KBI</acronym> / Congelamento <acronym>KPI</acronym>

source: <acronym>KBI</acronym>/<acronym>KPI</acronym> stability implies that the caller of a function across two different releases of software that implement the function results in the same end state. The caller, whether it is a process, thread, or function, expects the function to operate in a certain way, otherwise the <acronym>KBI</acronym>/<acronym>KPI</acronym> stability on the branch is broken.
pt_br: A estabilidade de <acronym>KBI</acronym>/<acronym>KPI</acronym> implica que o caller (que faz uma chamada) de uma função através de duas versões diferentes de software que implementam a função, resulta no mesmo estado final. O caller, seja um processo, thread ou função, espera que a função opere de uma determinada maneira, caso contrário, a estabilidade do <acronym>KBI</acronym>/<acronym>KPI</acronym> na branch é interrompida.

source: This section describes the changes to the website that should occur as the release cycle progresses.
pt_br: Esta seção descreve as alterações no site que devem ocorrer conforme o ciclo de lançamento progride.
