Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: By carefully setting these keywords for each startup script, an administrator has a fine-grained level of control of the startup order of the scripts, without the need for "runlevels" used by some UNIX(R) operating systems.
ko: 각 시작 스크립트에 대해 이러한 키워드를 신중하게 설정하면 관리자는 일부 UNIX(R) 운영 체제에서 사용하는 "runlevels"을 사용하지 않고도 스크립트의 시작 순서를 세밀하게 제어할 수 있습니다.

source: Additional information can be found in man:rc[8] and man:rc.subr[8]. Refer to extref:{rc-scripting}[this article] for instructions on how to create custom man:rc[8] scripts.
ko: 추가 정보는 man:rc[8] 및 man:rc.subr[8]에서 확인할 수 있습니다. 사용자 지정 man:rc[8] 스크립트를 만드는 방법에 대한 지침은 extref:{rc-scripting}[이 문서]를 참조하세요.

source: Managing System-Specific Configuration
ko: 시스템에 특화된 구성 관리하기
ru: Управление конфигурацией, специфичной для системы

source: The principal location for system configuration information is [.filename]#/etc/rc.conf#. This file contains a wide range of configuration information and it is read at system startup to configure the system. It provides the configuration information for the [.filename]#rc*# files.
ko: 시스템 구성 정보의 주요 위치는 [.filename]#/etc/rc.conf#입니다. 이 파일에는 다양한 구성 정보가 포함되어 있으며 시스템 시작 시 시스템을 구성하기 위해 읽습니다. 이 파일은 [.filename]#rc*# 파일에 대한 구성 정보를 제공합니다.

source: The entries in [.filename]#/etc/rc.conf# override the default settings in [.filename]#/etc/defaults/rc.conf#. The file containing the default settings should not be edited. Instead, all system-specific changes should be made to [.filename]#/etc/rc.conf#.
ko: [.filename]#/etc/rc.conf#의 항목은 [.filename]#/etc/defaults/rc.conf#의 기본 설정을 재정의합니다. 기본 설정이 포함된 파일은 편집해서는 안 됩니다. 대신 모든 시스템별 변경 사항은 [.filename]#/etc/rc.conf#에서 수행해야 합니다.

source: A number of strategies may be applied in clustered applications to separate site-wide configuration from system-specific configuration in order to reduce administration overhead. The recommended approach is to place system-specific configuration into [.filename]#/etc/rc.conf.local#. For example, these entries in [.filename]#/etc/rc.conf# apply to all systems:
ko: 클러스터된 애플리케이션에서는 관리 오버헤드를 줄이기 위해 사이트 전체 구성과 시스템별 구성을 분리하는 여러 가지 전략을 적용할 수 있습니다. 권장되는 접근 방식은 시스템별 구성을 [.filename]#/etc/rc.conf.local#에 배치하는 것입니다. 예를 들어 [.filename]#/etc/rc.conf#에 있는 이러한 항목은 모든 시스템에 적용됩니다:

source: Whereas these entries in [.filename]#/etc/rc.conf.local# apply to this system only:
ko: 반면 [.filename]#/etc/rc.conf.local#의 이러한 항목은 이 시스템에만 적용됩니다:
ru: В то время как эти записи в [.filename]#/etc/rc.conf.local# применяются только к этой системе:

source: Distribute [.filename]#/etc/rc.conf# to every system using an application such as rsync or puppet, while [.filename]#/etc/rc.conf.local# remains unique.
ko: [.filename]#/etc/rc.conf#는 고유한 상태로 유지하면서, [.filename]#/etc/rc.conf.local#은 rsync 또는 puppet과 같은 애플리케이션을 사용하여 모든 시스템에 배포하세요.
ru: Распределите [.filename]#/etc/rc.conf# на каждую систему с помощью таких приложений, как rsync или puppet, в то время как [.filename]#/etc/rc.conf.local# остается уникальным.

source: Upgrading the system will not overwrite [.filename]#/etc/rc.conf#, so system configuration information will not be lost.
ko: 시스템을 업그레이드해도 [.filename]#/etc/rc.conf#를 덮어쓰지는 않으므로 시스템 구성 정보는 손실되지 않습니다.
ru: Обновление системы не перезапишет [.filename]#/etc/rc.conf#, поэтому системные настройки не будут потеряны.

source: Both [.filename]#/etc/rc.conf# and [.filename]#/etc/rc.conf.local# are parsed by man:sh[1]. This allows system operators to create complex configuration scenarios. Refer to man:rc.conf[5] for further information on this topic.
ko: [.filename]#/etc/rc.conf# 및 [.filename]#/etc/rc.conf.local#은 모두 man:sh[1]로 파싱됩니다. 이를 통해 시스템 운영자는 복잡한 구성 시나리오를 만들 수 있습니다. 이 주제에 대한 자세한 내용은 man:rc.conf[5]를 참조하세요.
ru: Оба файла [.filename]#/etc/rc.conf# и [.filename]#/etc/rc.conf.local# обрабатываются man:sh[1]. Это позволяет системным операторам создавать сложные сценарии конфигурации. Дополнительную информацию по этой теме можно найти в man:rc.conf[5].

source: Setting Up Network Interface Cards
ko: 네트워크 인터페이스 카드 설정하기

source: Adding and configuring a network interface card (NIC) is a common task for any FreeBSD administrator.
ko: 네트워크 인터페이스 카드(NIC)를 추가하고 구성하는 것은 모든 FreeBSD 관리자에게 일반적인 작업입니다.

source: Locating the Correct Driver
ko: 올바른 드라이버 찾기

source: First, determine the model of the NIC and the chip it uses. FreeBSD supports a wide variety of NICs. Check the Hardware Compatibility List for the FreeBSD release to see if the NIC is supported.
ko: 먼저, NIC의 모델과 사용하는 칩을 결정합니다. FreeBSD는 다양한 NIC를 지원합니다. 해당 NIC가 지원되는지 확인하려면 FreeBSD 릴리즈의 하드웨어 호환성 목록을 확인하세요.

source: If the NIC is supported, determine the name of the FreeBSD driver for the NIC. Refer to [.filename]#/usr/src/sys/conf/NOTES# and [.filename]#/usr/src/sys/arch/conf/NOTES# for the list of NIC drivers with some information about the supported chipsets. When in doubt, read the manual page of the driver as it will provide more information about the supported hardware and any known limitations of the driver.
ko: NIC가 지원되는 경우, NIC용 FreeBSD 드라이버의 이름을 결정합니다. 지원되는 칩셋에 대한 정보가 포함된 NIC 드라이버 목록은 [.filename]#/usr/src/sys/conf/NOTES# 및 [.filename]#/usr/src/sys/arch/conf/NOTES#를 참조하세요. 확실하지 않은 경우 드라이버의 설명서 페이지에서 지원되는 하드웨어와 드라이버의 알려진 제한 사항에 대한 자세한 정보를 확인할 수 있습니다.

source: The drivers for common NICs are already present in the [.filename]#GENERIC# kernel, meaning the NIC should be probed during boot. The system's boot messages can be viewed by typing `more /var/run/dmesg.boot` and using the spacebar to scroll through the text. In this example, two Ethernet NICs using the man:dc[4] driver are present on the system:
ko: 일반 NIC용 드라이버는 [.filename]#GENERIC# 커널에 이미 존재하므로 부팅 중에 NIC를 검색해야 합니다. 시스템의 부팅 메시지는 `more /var/run/dmesg.boot`를 입력하고 스페이스바를 사용하여 텍스트를 스크롤하면 볼 수 있습니다. 이 예제에서는 man:dc[4] 드라이버를 사용하는 두 개의 이더넷 NIC가 시스템에 있습니다:

source: If the driver for the NIC is not present in [.filename]#GENERIC#, but a driver is available, the driver will need to be loaded before the NIC can be configured and used. This may be accomplished in one of two ways:
ko: NIC용 드라이버가 [.filename]#GENERIC#에 없지만 드라이버를 사용할 수 있는 경우, 드라이버를 로드해야 NIC를 구성하고 사용할 수 있습니다. 이 작업은 두 가지 방법 중 하나로 수행할 수 있습니다:

source: The easiest way is to load a kernel module for the NIC using man:kldload[8]. To also automatically load the driver at boot time, add the appropriate line to [.filename]#/boot/loader.conf#. Not all NIC drivers are available as modules.
ko: 가장 쉬운 방법은 man:kldload[8]를 사용하여 NIC용 커널 모듈을 로드하는 것입니다. 부팅 시 드라이버를 자동으로 로드하려면 [.filename]#/boot/loader.conf#에 적절한 줄을 추가하세요. 모든 NIC 드라이버를 모듈로 사용할 수 있는 것은 아닙니다.

source: Alternatively, statically compile support for the NIC into a custom kernel. Refer to [.filename]#/usr/src/sys/conf/NOTES#, [.filename]#/usr/src/sys/arch/conf/NOTES# and the manual page of the driver to determine which line to add to the custom kernel configuration file. For more information about recompiling the kernel, refer to crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]. If the NIC was detected at boot, the kernel does not need to be recompiled.
ko: 또는 NIC에 대한 지원을 사용자 정의 커널에 정적으로 컴파일합니다. 사용자 지정 커널 구성 파일에 추가할 줄을 결정하려면 [.filename]#/usr/src/sys/conf/NOTES#, [.filename]#/usr/src/sys/arch/conf/NOTES# 및 드라이버의 설명서 페이지를 참조하세요. 커널을 다시 컴파일하는 방법에 대한 자세한 내용은 crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]를 참조하십시오. 부팅 시 NIC가 감지된 경우 커널을 다시 컴파일할 필요가 없습니다.

source: Using Windows(R) NDIS Drivers
ko: Windows(R) NDIS 드라이버 사용하기

source: Unfortunately, there are still many vendors that do not provide schematics for their drivers to the open source community because they regard such information as trade secrets. Consequently, the developers of FreeBSD and other operating systems are left with two choices: develop the drivers by a long and pain-staking process of reverse engineering or using the existing driver binaries available for Microsoft(R) Windows(R) platforms.
ko: 안타깝게도 이러한 정보를 영업 비밀로 간주하여 오픈 소스 커뮤니티에 드라이버의 회로도를 제공하지 않는 공급업체가 여전히 많이 있습니다. 따라서 FreeBSD 및 기타 운영 체제 개발자는 오랜 시간이 걸리는 리버스 엔지니어링 프로세스를 통해 드라이버를 개발하거나 Microsoft(R) Windows(R) 플랫폼에서 사용할 수 있는 기존 드라이버 바이너리를 사용하는 두 가지 선택지가 남습니다.

source: FreeBSD provides "native" support for the Network Driver Interface Specification (NDIS). It includes man:ndisgen[8] which can be used to convert a Windows(R) XP driver into a format that can be used on FreeBSD. As the man:ndis[4] driver uses a Windows(R) XP binary, it only runs on i386(TM) and amd64 systems. PCI, CardBus, PCMCIA, and USB devices are supported.
ko: FreeBSD는 네트워크 드라이버 인터페이스 사양(NDIS)에 대한 "네이티브" 지원을 제공합니다. 여기에는 man:ndisgen[8]이 포함되어 있는데, 이는 Windows(R) XP 드라이버를 FreeBSD에서 사용할 수 있는 포맷으로 변환하는 데 사용할 수 있습니다. man:ndis[4] 드라이버는 Windows(R) XP 바이너리를 사용하므로, i386(TM) 및 amd64 시스템에서만 실행됩니다. PCI, CardBus, PCMCIA 및 USB 장치가 지원됩니다.

source: To use man:ndisgen[8], three things are needed:
ko: man:ndisgen[8]을 사용하려면 세 가지가 필요합니다:

source: FreeBSD kernel sources.
ko: FreeBSD 커널 소스.

source: A Windows(R) XP driver binary with a [.filename]#.SYS# extension.
ko: 확장자가 [.filename]#.SYS#인 Windows(R) XP 드라이버 바이너리입니다.

source: A Windows(R) XP driver configuration file with a [.filename]#.INF# extension.
ko: 확장자가 [.filename]#.INF#인 Windows(R) XP 드라이버 구성 파일입니다.

source: Download the [.filename]#.SYS# and [.filename]#.INF# files for the specific NIC. Generally, these can be found on the driver CD or at the vendor's website. The following examples use [.filename]#W32DRIVER.SYS# and [.filename]#W32DRIVER.INF#.
ko: 특정 NIC에 대한 [.filename]#.SYS# 및 [.filename]#.INF# 파일을 다운로드합니다. 일반적으로 드라이버 CD 또는 공급업체 웹사이트에서 찾을 수 있습니다. 다음 예제에서는 [.filename]#W32DRIVER.SYS# 및 [.filename]#W32DRIVER.INF#를 사용합니다.

source: The driver bit width must match the version of FreeBSD. For FreeBSD/i386, use a Windows(R) 32-bit driver. For FreeBSD/amd64, a Windows(R) 64-bit driver is needed.
ko: 드라이버 비트 폭은 FreeBSD 버전과 일치해야 합니다. FreeBSD/i386의 경우 Windows(R) 32비트 드라이버를 사용합니다. FreeBSD/amd64의 경우 Windows(R) 64비트 드라이버가 필요합니다.

source: The next step is to compile the driver binary into a loadable kernel module. As `root`, use man:ndisgen[8]:
ko: 다음 단계는 드라이버 바이너리를 로드 가능한 커널 모듈로 컴파일하는 것입니다. `root`로 man:ndisgen[8]을 사용합니다:

source: This command is interactive and prompts for any extra information it requires. A new kernel module will be generated in the current directory. Use man:kldload[8] to load the new module:
ko: 이 명령은 대화형이며 필요한 추가 정보를 묻는 메시지를 표시합니다. 현재 디렉토리에 새 커널 모듈이 생성됩니다. man:kldload[8]을 사용하여 새 모듈을 로드합니다:

source: In addition to the generated kernel module, the [.filename]#ndis.ko# and [.filename]#if_ndis.ko# modules must be loaded. This should happen automatically when any module that depends on man:ndis[4] is loaded. If not, load them manually, using the following commands:
ko: 생성된 커널 모듈 외에도 [.filename]#ndis.ko# 및 [.filename]#if_ndis.ko# 모듈을 로드해야 합니다. 이 작업은 man:ndis[4]에 의존하는 모듈이 로드될 때 자동으로 수행되어야 합니다. 그렇지 않은 경우 다음 명령을 사용하여 수동으로 로드하세요:

source: The first command loads the man:ndis[4] miniport driver wrapper and the second loads the generated NIC driver.
ko: 첫 번째 명령은 man:ndis[4] 미니포트 드라이버 래퍼를 로드하고 두 번째 명령은 생성된 NIC 드라이버를 로드합니다.

source: Check man:dmesg[8] to see if there were any load errors. If all went well, the output should be similar to the following:
ko: man:dmesg[8]를 확인하여 로드 오류가 있는지 확인합니다. 모든 것이 정상적으로 진행되었다면 출력은 다음과 비슷할 것입니다:

source: From here, [.filename]#ndis0# can be configured like any other NIC.
ko: 여기에서 [.filename]#ndis0#은 다른 NIC와 마찬가지로 구성할 수 있습니다.

source: To configure the system to load the man:ndis[4] modules at boot time, copy the generated module, [.filename]#W32DRIVER_SYS.ko#, to [.filename]#/boot/modules#. Then, add the following line to [.filename]#/boot/loader.conf#:
ko: 부팅 시 man:ndis[4] 모듈을 로드하도록 시스템을 구성하려면 생성된 모듈인 [.filename]#W32DRIVER_SYS.ko#를 [.filename]#/boot/modules#에 복사합니다. 그런 다음 [.filename]#/boot/loader.conf#에 다음 줄을 추가합니다:

source: Configuring the Network Card
ko: 네트워크 카드 구성하기

source: Once the right driver is loaded for the NIC, the card needs to be configured. It may have been configured at installation time by man:bsdinstall[8].
ko: NIC에 적합한 드라이버가 로드되면 카드를 구성해야 합니다. 설치 시 man:bsdinstall[8]에 의해 구성되었을 수 있습니다.

source: To display the NIC configuration, enter the following command:
ko: NIC 구성을 표시하려면 다음 명령을 입력합니다:

source: In this example, the following devices were displayed:
ko: 이 예제에서는 다음과 같은 장치가 표시되었습니다:

source: [.filename]#dc0#: The first Ethernet interface.
ko: [.filename]#dc0#: 첫번째 이더넷 인터페이스.

source: [.filename]#dc1#: The second Ethernet interface.
ko: [.filename]#dc1#: 두 번째 이더넷 인터페이스.

source: [.filename]#lo0#: The loopback device.
ko: [.filename]#lo0#: 루프백 장치.

source: FreeBSD uses the driver name followed by the order in which the card is detected at boot to name the NIC. For example, [.filename]#sis2# is the third NIC on the system using the man:sis[4] driver.
ko: FreeBSD는 드라이버 이름 뒤에 부팅 시 카드가 감지되는 순서를 사용하여 NIC의 이름을 지정합니다. 예를 들어, [.filename]#sis2#는 man:sis[4] 드라이버를 사용하는 시스템에서 세 번째 NIC입니다.

source: In this example, [.filename]#dc0# is up and running. The key indicators are:
ko: 이 예에서는 [.filename]#dc0#이 실행 중입니다. 주요 지표는 다음과 같습니다:

source: `UP` means that the card is configured and ready.
ko: `UP`은 카드가 구성되고 준비되었음을 의미합니다.

source: The card has an Internet (`inet`) address, `192.168.1.3`.
ko: 카드의 인터넷(`inet`) 주소는 `192.168.1.3`입니다.

source: It has a valid subnet mask (`netmask`), where `0xffffff00` is the same as `255.255.255.0`.
ko: 유효한 서브넷 마스크(`netmask`)가 있으며, 여기서 `0xffffff00`은 `255.255.255.0`과 동일합니다.

source: It has a valid broadcast address, `192.168.1.255`.
ko: 유효한 브로드캐스트 주소는 `192.168.1.255`입니다.

source: The MAC address of the card (`ether`) is `00:a0:cc:da:da:da`.
ko: 카드의 MAC 주소(`ether`)는 `00:a0:cc:da:da:da`입니다.

source: The physical media selection is on autoselection mode (`media: Ethernet autoselect (100baseTX <full-duplex>)`). In this example, [.filename]#dc1# is configured to run with `10baseT/UTP` media. For more information on available media types for a driver, refer to its manual page.
ko: 물리적 미디어 선택이 자동 선택 모드에 있습니다(`media: Ethernet autoselect (100baseTX <full-duplex>)`). 이 예제에서는 [.filename]#dc1#이 `10baseT/UTP` 미디어로 실행되도록 구성되었습니다. 드라이버에 사용 가능한 미디어 유형에 대한 자세한 내용은 해당 설명서 페이지를 참조하십시오.

source: The status of the link (`status`) is `active`, indicating that the carrier signal is detected. For [.filename]#dc1#, the `status: no carrier` status is normal when an Ethernet cable is not plugged into the card.
ko: 링크의 상태(`status`)는 `active`으로, 캐리어 신호가 감지되었음을 나타냅니다. 이더넷 케이블이 카드에 연결되어 있지 않은 경우 [.filename]#dc1#의 경우 `status: no carrier` 상태는 정상입니다.

source: If the man:ifconfig[8] output had shown something similar to:
ko: man:ifconfig[8] 출력에 다음과 비슷한 내용이 표시되었다면:

source: it would indicate the card has not been configured.
ko: 로 나타나면, 카드가 구성되지 않았음을 나타냅니다.

source: The card must be configured as `root`. The NIC configuration can be performed from the command line with man:ifconfig[8] but will not persist after a reboot unless the configuration is also added to [.filename]#/etc/rc.conf#. If a DHCP server is present on the LAN, just add this line:
ko: 카드는 `root`로 구성해야 합니다. NIC 구성은 명령줄에서 man:ifconfig[8]을 사용하여 수행할 수 있지만 [.filename]#/etc/rc.conf#에도 구성을 추가하지 않으면 재부팅 후에도 지속되지 않습니다. LAN에 DHCP 서버가 있는 경우 이 줄만 추가하면 됩니다:

source: Replace _dc0_ with the correct value for the system.
ko: _dc0_를 시스템에 맞는 올바른 값으로 바꿉니다.

source: The line added, then, follow the instructions given in <<config-network-testing>>.
ko: 그런 다음 추가한 줄에 <<config-network-testing>>에 제공된 지침을 따릅니다.

source: If the network was configured during installation, some entries for the NIC(s) may be already present. Double check [.filename]#/etc/rc.conf# before adding any lines.
ko: 설치 중에 네트워크를 구성한 경우, NIC에 대한 일부 항목이 이미 있을 수 있습니다. 줄을 추가하기 전에 [.filename]#/etc/rc.conf#을 다시 확인하세요.

source: If there is no DHCP server, the NIC(s) must be configured manually. Add a line for each NIC present on the system, as seen in this example:
ko: DHCP 서버가 없는 경우 NIC를 수동으로 구성해야 합니다. 이 예와 같이 시스템에 있는 각 NIC에 대해 한 줄을 추가합니다:

source: Replace [.filename]#dc0# and [.filename]#dc1# and the IP address information with the correct values for the system. Refer to the man page for the driver, man:ifconfig[8], and man:rc.conf[5] for more details about the allowed options and the syntax of [.filename]#/etc/rc.conf#.
ko: [.filename]#dc0# 및 [.filename]#dc1#과 IP 주소 정보를 시스템에 맞는 올바른 값으로 바꿉니다. 허용되는 옵션과 [.filename]#/etc/rc.conf#의 구문에 대한 자세한 내용은 드라이버의 매뉴얼 페이지, man:ifconfig[8] 및 man:rc.conf[5]를 참조하세요.

source: If the network is not using DNS, edit [.filename]#/etc/hosts# to add the names and IP addresses of the hosts on the LAN, if they are not already there. For more information, refer to man:hosts[5] and to [.filename]#/usr/share/examples/etc/hosts#.
ko: 네트워크에서 DNS를 사용하지 않는 경우, [.filename]#/etc/hosts#을 수정하여 LAN에 호스트의 이름과 IP 주소가 없는 경우 추가하세요. 자세한 내용은 man:hosts[5] 및 [.filename]#/usr/share/examples/etc/hosts#을 참조하세요.

source: If there is no DHCP server and access to the Internet is needed, manually configure the default gateway and the nameserver:
ko: DHCP 서버가 없고 인터넷에 액세스해야 하는 경우 기본 게이트웨이와 네임서버를 수동으로 구성합니다:

source: Testing and Troubleshooting
ko: 테스트 및 문제 해결

source: Once the necessary changes to [.filename]#/etc/rc.conf# are saved, a reboot can be used to test the network configuration and to verify that the system restarts without any configuration errors. Alternatively, apply the settings to the networking system with this command:
ko: [.filename]#/etc/rc.conf#에 필요한 변경 사항을 저장한 후 재부팅하여 네트워크 구성을 테스트하고 구성 오류 없이 시스템이 다시 시작되는지 확인할 수 있습니다. 또는 이 명령을 사용하여 네트워킹 시스템에 설정을 적용할 수도 있습니다:

source: If a default gateway has been set in [.filename]#/etc/rc.conf#, also issue this command:
ko: 기본 게이트웨이가 [.filename]#/etc/rc.conf#에 설정되어 있는 경우에도 이 명령을 실행하세요:

source: Once the networking system has been relaunched, test the NICs.
ko: 네트워킹 시스템이 다시 시작되면 NIC를 테스트합니다.

source: Testing the Ethernet Card
ko: 이더넷 카드 테스트하기

source: To verify that an Ethernet card is configured correctly, man:ping[8] the interface itself, and then man:ping[8] another machine on the LAN:
ko: 이더넷 카드가 올바르게 구성되었는지 확인하려면 인터페이스 자체를 man:ping[8]한 다음 LAN에 있는 다른 머신을 man:ping[8]합니다:

source: To test network resolution, use the host name instead of the IP address. If there is no DNS server on the network, [.filename]#/etc/hosts# must first be configured. To this purpose, edit [.filename]#/etc/hosts# to add the names and IP addresses of the hosts on the LAN, if they are not already there. For more information, refer to man:hosts[5] and to [.filename]#/usr/share/examples/etc/hosts#.
ko: 네트워크 확인을 테스트하려면 IP 주소 대신 호스트 이름을 사용하세요. 네트워크에 DNS 서버가 없는 경우 먼저 [.filename]#/etc/hosts#을 구성해야 합니다. 이를 위해 [.filename]#/etc/hosts#을 편집하여 LAN에 호스트의 이름과 IP 주소가 없는 경우 추가합니다. 자세한 내용은 man:hosts[5] 및 [.filename]#/usr/share/examples/etc/hosts#을 참조하세요.

source: Troubleshooting
ko: 문제 해결

source: When troubleshooting hardware and software configurations, check the simple things first. Is the network cable plugged in? Are the network services properly configured? Is the firewall configured correctly? Is the NIC supported by FreeBSD? Before sending a bug report, always check the Hardware Notes, update the version of FreeBSD to the latest STABLE version, check the mailing list archives, and search the Internet.
ko: 하드웨어 및 소프트웨어 구성 문제를 해결할 때는 간단한 사항을 먼저 확인하세요. 네트워크 케이블이 연결되어 있나요? 네트워크 서비스가 올바르게 구성되어 있나요? 방화벽이 올바르게 구성되어 있나요? NIC가 FreeBSD에서 지원되나요? 버그 리포트를 보내기 전에 항상 하드웨어 노트를 확인하고, FreeBSD 버전을 최신 안정 버전으로 업데이트하고, 메일링 리스트 아카이브를 확인하고, 인터넷에서 검색하세요.

source: If the card works, yet performance is poor, read through man:tuning[7]. Also, check the network configuration as incorrect network settings can cause slow connections.
ko: 카드가 작동하지만 성능이 좋지 않은 경우, man:tuning[7]을 읽어보세요. 또한 네트워크 설정이 잘못되면 연결 속도가 느려질 수 있으므로 네트워크 구성을 확인하세요.

source: Some users experience one or two `device timeout` messages, which is normal for some cards. If they continue, or are bothersome, determine if the device is conflicting with another device. Double check the cable connections. Consider trying another card.
ko: 일부 사용자는 한두 번의 `device timeout` 메시지를 경험하는데, 이는 일부 카드의 경우 정상입니다. 메시지가 계속 표시되거나 귀찮을 경우 장치가 다른 장치와 충돌하는지 확인하세요. 케이블 연결을 다시 확인하세요. 다른 카드를 사용해 보세요.

source: To resolve `watchdog timeout` errors, first check the network cable. Many cards require a PCI slot which supports bus mastering. On some old motherboards, only one PCI slot allows it, usually slot 0. Check the NIC and the motherboard documentation to determine if that may be the problem.
ko: `watchdog timeout` 오류를 해결하려면 먼저 네트워크 케이블을 확인하세요. 많은 카드에는 버스 마스터링을 지원하는 PCI 슬롯이 필요합니다. 일부 구형 마더보드에서는 하나의 PCI 슬롯(보통 슬롯 0)만 허용합니다. NIC와 마더보드 설명서를 확인하여 해당 문제가 있는지 확인하세요.

source: `No route to host` messages occur if the system is unable to route a packet to the destination host. This can happen if no default route is specified or if a cable is unplugged. Check the output of `netstat -rn` and make sure there is a valid route to the host. If there is not, read crossref:advanced-networking[network-routing,“Gateways and Routes”].
ko: 시스템이 대상 호스트로 패킷을 라우팅할 수 없는 경우 `No route to host` 메시지가 표시됩니다. 기본 경로가 지정되지 않았거나 케이블이 분리된 경우 발생할 수 있습니다. `netstat -rn`의 출력을 확인하여 호스트에 대한 유효한 경로가 있는지 확인하세요. 그렇지 않은 경우 crossref:advanced-networking[network-routing,“Gateways and Routes”]을 참조하세요.

source: `ping: sendto: Permission denied` error messages are often caused by a misconfigured firewall. If a firewall is enabled on FreeBSD but no rules have been defined, the default policy is to deny all traffic, even man:ping[8]. Refer to crossref:firewalls[firewalls,Firewalls] for more information.
ko: `ping: sendto: Permission denied` 오류 메시지는 종종 잘못 구성된 방화벽으로 인해 발생합니다. 방화벽이 FreeBSD에서 활성화되었지만 규칙이 정의되지 않은 경우, 기본 정책은 모든 트래픽을 거부하는 것입니다(심지어 man:ping[8] 포함). 자세한 내용은 crossref:firewalls[firewalls,Firewalls]을 참고하세요.

source: Sometimes performance of the card is poor or below average. In these cases, try setting the media selection mode from `autoselect` to the correct media selection. While this works for most hardware, it may or may not resolve the issue. Again, check all the network settings, and refer to man:tuning[7].
ko: 때때로 카드의 성능이 좋지 않거나 평균 이하인 경우가 있습니다. 이러한 경우 미디어 선택 모드를 `autoselect`에서 올바른 미디어 선택으로 설정해 보세요. 이 방법은 대부분의 하드웨어에서 작동하지만, 문제가 해결될 수도 있고 해결되지 않을 수도 있습니다. 다시 한 번 모든 네트워크 설정을 확인하고 man:tuning[7]을 참조하세요.

source: Virtual Hosts
ko: 가상 호스트

source: A common use of FreeBSD is virtual site hosting, where one server appears to the network as many servers. This is achieved by assigning multiple network addresses to a single interface.
ko: 하나의 서버가 네트워크에 여러 대의 서버로 표시되는 가상 사이트 호스팅은 FreeBSD의 일반적인 용도입니다. 이는 단일 인터페이스에 여러 네트워크 주소를 할당하여 이루어집니다.

source: A given network interface has one "real" address, and may have any number of "alias" addresses. These aliases are normally added by placing alias entries in [.filename]#/etc/rc.conf#, as seen in this example:
ko: 주어진 네트워크 인터페이스에는 하나의 "실제" 주소가 있으며, "별칭" 주소는 얼마든지 가질 수 있습니다. 이러한 별칭은 일반적으로 이 예제에서 볼 수 있듯이 [.filename]#/etc/rc.conf#에 별칭 항목을 배치하여 추가합니다:

source: Alias entries must start with `alias__0__` using a sequential number such as `alias0`, `alias1`, and so on. The configuration process will stop at the first missing number.
ko: 별칭 항목은`alias0`, `alias1` 등과 같은 순차 번호를 사용하여 `alias__0__`으로 시작해야 합니다. 구성 프로세스는 첫 번째 누락된 번호에서 중지됩니다.

source: The calculation of alias netmasks is important. For a given interface, there must be one address which correctly represents the network's netmask. Any other addresses which fall within this network must have a netmask of all ``1``s, expressed as either `255.255.255.255` or `0xffffffff`.
ko: 별칭 넷마스크 계산은 중요합니다. 주어진 인터페이스에 대해 네트워크의 넷마스크를 올바르게 나타내는 주소가 하나 있어야 합니다. 이 네트워크에 속하는 다른 모든 주소는 `255.255.255.255` 또는 `0xffffffff`로 표현되는 모든 ``1``의 넷마스크를 가져야 합니다.
