Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: For example, consider the case where the [.filename]#fxp0# interface is connected to two networks: `10.1.1.0` with a netmask of `255.255.255.0` and `202.0.75.16` with a netmask of `255.255.255.240`. The system is to be configured to appear in the ranges `10.1.1.1` through `10.1.1.5` and `202.0.75.17` through `202.0.75.20`. Only the first address in a given network range should have a real netmask. All the rest (`10.1.1.2` through `10.1.1.5` and `202.0.75.18` through `202.0.75.20`) must be configured with a netmask of `255.255.255.255`.
ko: 예를 들어, [.filename]#fxp0# 인터페이스가 두 개의 네트워크에 연결되어 있는 경우를 생각해 보겠습니다: 넷마스크가 `255.255.255.0`인 `10.1.1.0`과 넷마스크가 `255.255.255.240`인 `202.0.75.16`이죠. 시스템은 `10.1.1.1` ~ `10.1.1.5` 및 `202.0.75.17` ~ `202.0.75.20` 범위에 나타나도록 구성해야 합니다. 주어진 네트워크 범위의 첫 번째 주소만 실제 넷마스크를 가져야 합니다. 나머지 모든 주소(`10.1.1.2` ~ `10.1.1.5` 및 `202.0.75.18` ~ `202.0.75.20`)는 `255.255.255.255`의 넷마스크로 구성해야 합니다.

source: The following [.filename]#/etc/rc.conf# entries configure the adapter correctly for this scenario:
ko: 다음 [.filename]#/etc/rc.conf# 항목은 이 시나리오에 맞게 어댑터를 올바르게 구성한 것입니다:

source: A simpler way to express this is with a space-separated list of IP address ranges. The first address will be given the indicated subnet mask and the additional addresses will have a subnet mask of `255.255.255.255`.
ko: 이를 더 간단하게 표현하는 방법은 공백으로 구분된 IP 주소 범위 목록을 사용하는 것입니다. 첫 번째 주소에는 지정된 서브넷 마스크가 지정되고 추가 주소에는 `255.255.255.255`의 서브넷 마스크가 지정됩니다.

source: Configuring System Logging
ko: 시스템 로깅 구성하기
ru: Настройка системного журналирования

source: Generating and reading system logs is an important aspect of system administration. The information in system logs can be used to detect hardware and software issues as well as application and system configuration errors. This information also plays an important role in security auditing and incident response. Most system daemons and applications will generate log entries.
ko: 시스템 로그를 생성하고 읽는 것은 시스템 관리의 중요한 측면입니다. 시스템 로그의 정보는 하드웨어 및 소프트웨어 문제와 애플리케이션 및 시스템 구성 오류를 감지하는 데 사용할 수 있습니다. 이 정보는 보안 감사 및 사고 대응에도 중요한 역할을 합니다. 대부분의 시스템 데몬과 애플리케이션은 로그 항목을 생성합니다.
ru: Генерация и чтение системных журналов — важный аспект администрирования системы. Информация в системных журналах может использоваться для выявления проблем с оборудованием и программным обеспечением, а также ошибок в конфигурации приложений и системы. Эти данные также играют важную роль в аудите безопасности и реагировании на инциденты. Большинство системных демонов и приложений создают записи в журналах.

source: FreeBSD provides a system logger, syslogd, to manage logging. By default, syslogd is started when the system boots. This is controlled by the variable `syslogd_enable` in [.filename]#/etc/rc.conf#. There are numerous application arguments that can be set using `syslogd_flags` in [.filename]#/etc/rc.conf#. Refer to man:syslogd[8] for more information on the available arguments.
ko: FreeBSD는 로깅을 관리하기 위해 시스템 로거인 syslogd를 제공합니다. 기본적으로 시스템이 부팅될 때 syslogd가 시작됩니다. 이것은 [.filename]#/etc/rc.conf#의 `syslogd_enable` 변수에 의해 제어됩니다. [.filename]#/etc/rc.conf#의 `syslogd_flags`를 사용하여 설정할 수 있는 애플리케이션 인수는 다양합니다. 사용 가능한 인자에 대한 자세한 내용은 man:syslogd[8]을 참조하세요.

source: This section describes how to configure the FreeBSD system logger for both local and remote logging and how to perform log rotation and log management.
ko: 이 섹션에서는 로컬 및 원격 로깅을 위해 FreeBSD 시스템 로거를 구성하는 방법과 로그 로테이션 및 로그 관리를 수행하는 방법을 설명합니다.
ru: В этом разделе описывается, как настроить системный модуль журналирования FreeBSD для локального и удалённого ведения журналов, а также как выполнять ротацию и управление журналами.

source: Configuring Local Logging
ko: 로컬 로깅 구성하기
ru: Настройка локального журналирования

source: The configuration file, [.filename]#/etc/syslog.conf#, controls what syslogd does with log entries as they are received. There are several parameters to control the handling of incoming events. The _facility_ describes which subsystem generated the message, such as the kernel or a daemon, and the _level_ describes the severity of the event that occurred. This makes it possible to configure if and where a log message is logged, depending on the facility and level. It is also possible to take action depending on the application that sent the message, and in the case of remote logging, the hostname of the machine generating the logging event.
ko: 구성 파일인 [.filename]#/etc/syslog.conf#는 수신된 로그 항목에 대해 syslogd가 수행하는 작업을 제어합니다. 들어오는 이벤트의 처리를 제어하는 몇 가지 매개변수가 있습니다. _facility_은 커널이나 데몬 등 메시지를 생성한 하위 시스템을 설명하고, _level_은 발생한 이벤트의 심각도를 설명합니다. 이를 통해 시설과 수준에 따라 로그 메시지의 기록 여부와 위치를 구성할 수 있습니다. 또한 메시지를 전송한 애플리케이션과 원격 로깅의 경우 로깅 이벤트를 생성하는 머신의 호스트 이름에 따라 조치를 취할 수도 있습니다.
ru: Файл конфигурации [.filename]#/etc/syslog.conf# определяет, как syslogd обрабатывает поступающие записи журналов. Существует несколько параметров для управления обработкой входящих событий. _Facility_ (источник) указывает, какая подсистема сгенерировала сообщение, например, ядро или демон, а _level_ (уровень) описывает степень серьезности произошедшего события. Это позволяет настроить, будет ли сообщение зарегистрировано и куда, в зависимости от категории и уровня. Также можно выполнять действия в зависимости от приложения, отправившего сообщение, а в случае удалённого журналирования — от имени хоста машины, генерирующей событие.

source: This configuration file contains one line per action, where the syntax for each line is a selector field followed by an action field. The syntax of the selector field is _facility.level_ which will match log messages from _facility_ at level _level_ or higher. It is also possible to add an optional comparison flag before the level to specify more precisely what is logged. Multiple selector fields can be used for the same action, and are separated with a semicolon (`;`). Using `*` will match everything. The action field denotes where to send the log message, such as to a file or remote log host. As an example, here is the default [.filename]#syslog.conf# from FreeBSD:
ko: 이 구성 파일에는 작업당 한 줄씩 추가되며, 각 줄의 구문은 선택기 필드 다음에 작업 필드가 있습니다. 선택기 필드의 구문은 _facility.level_로, _facility_에서 _level_ 이상의 로그 메시지와 일치합니다. 레벨 앞에 선택적 비교 플래그를 추가하여 기록되는 내용을 보다 정확하게 지정할 수도 있습니다. 동일한 작업에 여러 선택기 필드를 사용할 수 있으며 세미콜론(`;`)으로 구분합니다. `*`를 사용하면 모든 항목이 일치합니다. 작업 필드는 로그 메시지를 보낼 위치(예: 파일 또는 원격 로그 호스트)를 나타냅니다. 예를 들어, 다음은 FreeBSD의 기본 [.filename]#syslog.conf#입니다:

source: In this example:
ko: 이 예제에서는

source: Line 8 matches all messages with a level of `err` or higher, as well as `kern.warning`, `auth.notice` and `mail.crit`, and sends these log messages to the console ([.filename]#/dev/console#).
ko: 8행은 `err` 이상의 모든 메시지와 `kern.warning`, `auth.notice` 및 `mail.crit`을 찾고 이러한 로그 메시지를 콘솔([.filename]#/dev/console#)로 보냅니다.

source: Line 12 matches all messages from the `mail` facility at level `info` or above and logs the messages to [.filename]#/var/log/maillog#.
ko: 12줄은 `info` 레벨 이상의 `mail` 기능의 모든 메시지를 찾고 메시지를 [.filename]#/var/log/maillog#에 기록합니다.

source: Line 17 uses a comparison flag (`=`) to only match messages at level `debug` and logs them to [.filename]#/var/log/debug.log#.
ko: 17행은 비교 플래그(`=`)를 사용하여 `debug` 레벨의 메시지만 찾고 이를 [.filename]#/var/log/debug.log#에 기록합니다.

source: Line 33 is an example usage of a program specification. This makes the rules following it only valid for the specified program. In this case, only the messages generated by ppp are logged to [.filename]#/var/log/ppp.log#.
ko: 33줄은 프로그램 사양의 사용 예시입니다. 따라서 그 뒤에 나오는 규칙은 지정된 프로그램에 대해서만 유효합니다. 이 경우 ppp에서 생성된 메시지만 [.filename]#/var/log/ppp.log#에 기록됩니다.

source: The available levels, in order from most to least critical are `emerg`, `alert`, `crit`, `err`, `warning`, `notice`, `info`, and `debug`.
ko: 사용 가능한 레벨은 가장 심각한 것부터 가장 덜 심각한 것 순으로 `emerg`, `alert`, `crit`, `err`, `warning`, `notice`, `info`, `debug`입니다.

source: The facilities, in no particular order, are `auth`, `authpriv`, `console`, `cron`, `daemon`, `ftp`, `kern`, `lpr`, `mail`, `mark`, `news`, `security`, `syslog`, `user`, `uucp`, and `local0` through `local7`. Be aware that other operating systems might have different facilities.
ko: 특정 순서 없이 `auth`, `authpriv`, `console`, `cron`, `daemon`, `ftp`, `kern`, `lpr`, `mail`, `mark`, `news`, `security`, `syslog`, `user`, `uucp`, `local0`~`local7`의 순서입니다. 다른 운영 체제에는 다른 기능이 있을 수 있습니다.

source: To log everything of level `notice` and higher to [.filename]#/var/log/daemon.log#, add the following entry:
ko: `notice` 레벨 이상의 모든 항목을 [.filename]#/var/log/daemon.log#에 기록하려면 다음 항목을 추가합니다:

source: For more information about the different levels and facilities, refer to man:syslog[3] and man:syslogd[8]. For more information about [.filename]#/etc/syslog.conf#, its syntax, and more advanced usage examples, see man:syslog.conf[5].
ko: 다양한 수준과 기능에 대한 자세한 내용은 man:syslog[3] 및 man:syslogd[8]를 참조하세요. [.filename]#/etc/syslog.conf#, 구문 및 고급 사용 예제에 대한 자세한 내용은 man:syslog.conf[5]를 참조하세요.

source: Log Management and Rotation
ko: 로그 관리 및 순환
ru: Управление журналами и их ротация

source: Log files can grow quickly, taking up disk space and making it more difficult to locate useful information. Log management attempts to mitigate this. In FreeBSD, newsyslog is used to manage log files. This built-in program periodically rotates and compresses log files, and optionally creates missing log files and signals programs when log files are moved. The log files may be generated by syslogd or by any other program which generates log files. While newsyslog is normally run from man:cron[8], it is not a system daemon. In the default configuration, it runs every hour.
ko: 로그 파일은 빠르게 증가하여 디스크 공간을 차지하고 유용한 정보를 찾기가 더 어려워질 수 있습니다. 로그 관리는 이를 완화하기 위해 사용됩니다. FreeBSD에서는 newsyslog를 사용하여 로그 파일을 관리합니다. 이 기본 제공 프로그램은 주기적으로 로그 파일을 순환 및 압축하고, 선택적으로 누락된 로그 파일을 생성하고 로그 파일이 이동될 때 프로그램에 신호를 보냅니다. 로그 파일은 syslogd 또는 로그 파일을 생성하는 다른 프로그램에서 생성할 수 있습니다. newsyslog는 일반적으로 man:cron[8]에서 실행되지만 시스템 데몬은 아닙니다. 기본 구성에서는 매시간 실행됩니다.

source: To know which actions to take, newsyslog reads its configuration file, [.filename]#/etc/newsyslog.conf#. This file contains one line for each log file that newsyslog manages. Each line states the file owner, permissions, when to rotate that file, optional flags that affect log rotation, such as compression, and programs to signal when the log is rotated. Here is the default configuration in FreeBSD:
ko: 어떤 조치를 취해야 하는지 알기 위해 newsyslog는 구성 파일인 [.filename]#/etc/newsyslog.conf#를 읽습니다. 이 파일에는 newsyslog가 관리하는 각 로그 파일에 대해 한 줄씩 포함되어 있습니다. 각 줄에는 파일 소유자, 권한, 해당 파일을 회전할 시기, 압축과 같이 로그 회전에 영향을 주는 선택적 플래그, 로그가 회전할 때 신호를 보내는 프로그램이 명시되어 있습니다. 다음은 FreeBSD의 기본 구성입니다:

source: Each line starts with the name of the log to be rotated, optionally followed by an owner and group for both rotated and newly created files. The `mode` field sets the permissions on the log file and `count` denotes how many rotated log files should be kept. The `size` and `when` fields tell newsyslog when to rotate the file. A log file is rotated when either its size is larger than the `size` field or when the time in the `when` field has passed. An asterisk (`*`) means that this field is ignored. The _flags_ field gives further instructions, such as how to compress the rotated file or to create the log file if it is missing. The last two fields are optional and specify the name of the Process ID (PID) file of a process and a signal number to send to that process when the file is rotated.
ko: 각 줄은 회전할 로그의 이름으로 시작하며, 선택적으로 회전된 파일과 새로 생성된 파일 모두에 대한 소유자와 그룹이 뒤따릅니다. `mode` 필드는 로그 파일에 대한 권한을 설정하고 `count`는 보관해야 하는 회전된 로그 파일 수를 나타냅니다. `size` 및 `when` 필드는 파일을 회전할 시기를 newsyslog에 알려줍니다. 로그 파일은 크기가 `size` 필드보다 크거나 `when` 필드의 시간이 지나면 회전됩니다. 별표(`*`)는 이 필드가 무시됨을 의미합니다. _flags_ 필드는 회전된 파일을 압축하는 방법이나 누락된 경우 로그 파일을 생성하는 방법과 같은 추가 지침을 제공합니다. 마지막 두 필드는 선택 사항이며 프로세스의 프로세스 ID(PID) 파일 이름과 파일이 회전될 때 해당 프로세스로 전송할 신호 번호를 지정합니다.

source: For more information on all fields, valid flags, and how to specify the rotation time, refer to man:newsyslog.conf[5]. Since newsyslog is run from man:cron[8], it cannot rotate files more often than it is scheduled to run from man:cron[8].
ko: 모든 필드, 유효한 플래그 및 로테이션 시간을 지정하는 방법에 대한 자세한 내용은 man:newsyslog.conf[5]를 참조하세요. newsyslog는 man:cron[8]에서 실행되기 때문에 man:cron[8]에서 실행되도록 예약된 것보다 더 자주 파일을 회전시킬 수는 없습니다.

source: Configuring Remote Logging
ko: 원격 로깅 구성하기
ru: Настройка удаленного журналирования

source: Monitoring the log files of multiple hosts can become unwieldy as the number of systems increases. Configuring centralized logging can reduce some of the administrative burden of log file administration.
ko: 시스템 수가 증가함에 따라 여러 호스트의 로그 파일을 모니터링하는 것이 부담스러워질 수 있습니다. 중앙 집중식 로깅을 구성하면 로그 파일 관리의 관리 부담을 일부 줄일 수 있습니다.
ru: Мониторинг журналов событий на нескольких хостах может стать громоздким по мере увеличения количества систем. Настройка централизованного журналирования позволяет снизить нагрузку на администратора при управлении журналами.

source: In FreeBSD, centralized log file aggregation, merging, and rotation can be configured using syslogd and newsyslog. This section demonstrates an example configuration, where host `A`, named `logserv.example.com`, will collect logging information for the local network. Host `B`, named `logclient.example.com`, will be configured to pass logging information to the logging server.
ko: FreeBSD에서 중앙 집중식 로그 파일 집계, 병합 및 로테이션은 syslogd와 newsyslog를 사용하여 구성할 수 있습니다. 이 섹션에서는 `logserv.example.com`이라는 이름의 호스트 `A`가 로컬 네트워크에 대한 로깅 정보를 수집하는 구성 예시를 보여줍니다. 호스트 `B`는 `logclient.example.com`이라는 이름으로 로깅 정보를 로깅 서버로 전달하도록 구성됩니다.

source: Log Server Configuration
ko: 로그 서버 구성
ru: Конфигурация сервера журналов

source: A log server is a system that has been configured to accept logging information from other hosts. Before configuring a log server, check the following:
ko: 로그 서버는 다른 호스트의 로깅 정보를 받아들이도록 구성된 시스템입니다. 로그 서버를 구성하기 전에 다음 사항을 확인하세요:

source: If there is a firewall between the logging server and any logging clients, ensure that the firewall ruleset allows UDP port 514 for both the clients and the server.
ko: 로깅 서버와 로깅 클라이언트 사이에 방화벽이 있는 경우 방화벽 규칙 집합이 클라이언트와 서버 모두에 대해 UDP 포트 514를 허용하는지 확인합니다.
ru: Если между сервером журналирования и клиентами журналирования есть межсетевой экран, убедитесь, что набор правил межсетевого экрана разрешает UDP-порт 514 как для клиентов, так и для сервера.

source: The logging server and all client machines must have forward and reverse entries in the local DNS. If the network does not have a DNS server, create entries in each system's [.filename]#/etc/hosts#. Proper name resolution is required so that log entries are not rejected by the logging server.
ko: 로깅 서버와 모든 클라이언트 시스템에는 로컬 DNS에 정방향 및 역방향 항목이 있어야 합니다. 네트워크에 DNS 서버가 없는 경우 각 시스템의 [.filename]#/etc/hosts#에 항목을 만듭니다. 로그 항목이 로깅 서버에서 거부되지 않도록 올바른 이름 확인이 필요합니다.
ru: Сервер журналирования и все клиентские машины должны иметь прямые и обратные записи в локальной DNS. Если в сети нет DNS-сервера, создайте записи в файле [.filename]#/etc/hosts# каждой системы. Корректное разрешение имен необходимо для того, чтобы записи журналов не отклонялись сервером журналирования.

source: On the log server, edit [.filename]#/etc/syslog.conf# to specify the name of the client to receive log entries from, the logging facility to be used, and the name of the log to store the host's log entries. This example adds the hostname of `B`, logs all facilities, and stores the log entries in [.filename]#/var/log/logclient.log#.
ko: 로그 서버에서 [.filename]#/etc/syslog.conf#를 편집하여 로그 항목을 수신할 클라이언트의 이름, 사용할 로깅 facility, 호스트의 로그 항목을 저장할 로그의 이름을 지정합니다. 이 예제에서는 호스트 이름을 `B`로 추가하고 모든 facility를 로깅한 후 로그 항목을 [.filename]#/var/log/logclient.log#에 저장합니다.
ru: На сервере журналов отредактируйте файл [.filename]#/etc/syslog.conf#, указав имя клиента, от которого будут приниматься записи журнала, используемое средство ведения журнала и имя файла для хранения записей журнала данного хоста. В этом примере добавляется имя хоста `B`, регистрируются все средства и записи журнала сохраняются в файле [.filename]#/var/log/logclient.log#.

source: Sample Log Server Configuration
ko: 샘플 로그 서버 구성
ru: Пример конфигурации сервера журналов

source: When adding multiple log clients, add a similar two-line entry for each client. More information about the available facilities may be found in man:syslog.conf[5].
ko: 여러 로그 클라이언트를 추가할 때는 각 클라이언트에 대해 비슷한 두 줄 항목을 추가하세요. 사용 가능한 기능에 대한 자세한 내용은 man:syslog.conf[5]에서 확인할 수 있습니다.
ru: При добавлении нескольких клиентов для журналирования добавьте аналогичную запись из двух строк для каждого клиента. Дополнительную информацию о доступных средствах можно найти в man:syslog.conf[5].

source: Next, configure [.filename]#/etc/rc.conf#:
ko: 그런 다음 [.filename]#/etc/rc.conf#을 구성합니다:

source: The first entry starts syslogd at system boot. The second entry allows log entries from the specified client. The `-v -v` increases the verbosity of logged messages. This is useful for tweaking facilities as administrators are able to see what type of messages are being logged under each facility.
ko: 첫 번째 항목은 시스템 부팅 시 syslogd를 시작합니다. 두 번째 항목은 지정된 클라이언트의 로그 항목을 허용합니다. `-v -v`는 기록된 메시지의 상세도를 높입니다. 관리자가 각 기능에서 어떤 유형의 메시지가 기록되고 있는지 확인할 수 있으므로 기능을 조정하는 데 유용합니다.
ru: Первый параметр запускает syslogd при загрузке системы. Второй параметр разрешает записи журналов от указанного клиента. Опция `-v -v` увеличивает подробность записываемых сообщений. Это полезно для настройки категорий, так как администраторы могут видеть, какие типы сообщений записываются в каждой категории.

source: Multiple `-a` options may be specified to allow logging from multiple clients. IP addresses and whole netblocks may also be specified. Refer to man:syslogd[8] for a full list of possible options.
ko: 여러 개의 `-a` 옵션을 지정하여 여러 클라이언트의 로깅을 허용할 수 있습니다. IP 주소와 전체 넷블록도 지정할 수 있습니다. 가능한 옵션의 전체 목록은 man:syslogd[8]를 참조하세요.
ru: Можно указать несколько параметров `-a`, чтобы разрешить ведение журнала от нескольких клиентов. Также можно указывать IP-адреса и целые сетевые блоки. Полный список возможных параметров приведён в man:syslogd[8].

source: Finally, create the log file:
ko: 마지막으로 로그 파일을 생성합니다:
ru: Наконец, создайте файл журнала:

source: At this point, syslogd should be restarted and verified:
ko: 이 시점에서 syslogd를 다시 시작하고 확인해야 합니다:
ru: На этом этапе следует перезапустить и проверить syslogd:

source: If a PID is returned, the server restarted successfully, and client configuration can begin. If the server did not restart, consult [.filename]#/var/log/messages# for the error.
ko: PID가 반환되면 서버가 성공적으로 재시작된 것이며 클라이언트 구성을 시작할 수 있습니다. 서버가 다시 시작되지 않았다면 [.filename]#/var/log/messages#에서 오류를 참조하세요.
ru: Если возвращен PID, сервер успешно перезапущен, и можно приступать к настройке клиента. Если сервер не перезапустился, проверьте ошибку в [.filename]#/var/log/messages#.

source: Log Client Configuration
ko: 로그 클라이언트 구성
ru: Конфигурация клиента журналирования

source: A logging client sends log entries to a logging server on the network. The client also keeps a local copy of its own logs.
ko: 로깅 클라이언트는 로그 항목을 네트워크의 로깅 서버로 전송합니다. 클라이언트는 자체 로그의 로컬 복사본도 보관합니다.
ru: Клиент системы журналирования отправляет записи журналов на сервер журналирования в сети. Клиент также сохраняет локальную копию своих собственных журналов.

source: Once a logging server has been configured, edit [.filename]#/etc/rc.conf# on the logging client:
ko: 로깅 서버가 구성되면 로깅 클라이언트에서 [.filename]#/etc/rc.conf#를 편집합니다:

source: The first entry enables syslogd on boot up. The second entry prevents logs from being accepted by this client from other hosts (`-s`) and increases the verbosity of logged messages.
ko: 첫 번째 항목은 부팅 시 syslogd를 활성화합니다. 두 번째 항목은 이 클라이언트가 다른 호스트(`-s`)로부터 로그를 수신하지 못하도록 하고 기록된 메시지의 상세도를 높입니다.
ru: Первый параметр включает запуск syslogd при загрузке системы. Второй параметр запрещает получение журналов от других хостов (`-s`) и увеличивает детализацию записываемых сообщений.

source: Next, define the logging server in the client's [.filename]#/etc/syslog.conf#. In this example, all logged facilities are sent to a remote system, denoted by the `@` symbol, with the specified hostname:
ko: 그런 다음 클라이언트의 [.filename]#/etc/syslog.conf#에서 로깅 서버를 정의합니다. 이 예제에서는 모든 로깅된 시설이 지정된 호스트 이름으로 `@` 기호로 표시된 원격 시스템으로 전송됩니다:
ru: Затем определите сервер журналирования в файле [.filename]#/etc/syslog.conf# клиента. В этом примере все журналируемые источники отправляются на удалённую систему, обозначенную символом `@`, с указанным именем хоста:

source: After saving the edit, restart syslogd for the changes to take effect:
ko: 편집 내용을 저장한 후 변경 내용을 적용하려면 syslogd를 다시 시작합니다:
ru: После сохранения изменений перезапустите syslogd, чтобы изменения вступили в силу:

source: To test that log messages are being sent across the network, use man:logger[1] on the client to send a message to syslogd:
ko: 로그 메시지가 네트워크를 통해 전송되고 있는지 테스트하려면 클라이언트에서 man:logger[1]를 사용하여 syslogd로 메시지를 보내세요:
ru: Для проверки отправки журнальных сообщений по сети используйте man:logger[1] на клиенте, чтобы отправить сообщение в syslogd:

source: This message should now exist both in [.filename]#/var/log/messages# on the client and [.filename]#/var/log/logclient.log# on the log server.
ko: 이제 이 메시지는 클라이언트의 [.filename]#/var/log/messages#와 로그 서버의 [.filename]#/var/log/logclient.log#에 모두 존재해야 합니다.
ru: Это сообщение теперь должно присутствовать как в [.filename]#/var/log/messages# на клиенте, так и в [.filename]#/var/log/logclient.log# на сервере журналов.

source: Debugging Log Servers
ko: 로그 서버 디버깅하기
ru: Отладка серверов журналов

source: If no messages are being received on the log server, the cause is most likely a network connectivity issue, a hostname resolution issue, or a typo in a configuration file. To isolate the cause, ensure that both the logging server and the logging client are able to `ping` each other using the hostname specified in their [.filename]#/etc/rc.conf#. If this fails, check the network cabling, the firewall ruleset, and the hostname entries in the DNS server or [.filename]#/etc/hosts# on both the logging server and clients. Repeat until the `ping` is successful from both hosts.
ko: 로그 서버에 메시지가 수신되지 않는다면 네트워크 연결 문제, 호스트 이름 확인 문제 또는 구성 파일의 오타가 원인일 가능성이 높습니다. 원인을 파악하려면 로깅 서버와 로깅 클라이언트가 모두 [.filename]#/etc/rc.conf#에 지정된 호스트명을 사용하여 서로를 `ping`할 수 있는지 확인하세요. 실패하면 네트워크 케이블, 방화벽 규칙 집합, 로깅 서버와 클라이언트 모두의 DNS 서버 또는 [.filename]#/etc/hosts#에 있는 호스트 이름 항목을 확인하세요. 두 호스트 모두에서 `ping`이 성공할 때까지 이 과정을 반복합니다.
ru: Если на сервере журналов не поступают сообщения, скорее всего, причина в проблеме с сетевым подключением, разрешении имён или опечатке в конфигурационном файле. Чтобы выявить причину, убедитесь, что и сервер журналов, и клиент могут `ping` друг друга, используя имя хоста, указанное в их [.filename]#/etc/rc.conf#. Если это не удаётся, проверьте сетевые кабели, набор правил межсетевого экрана и записи имён хостов на DNS-сервере или в [.filename]#/etc/hosts# как на сервере журналов, так и на клиентах. Повторяйте проверки, пока `ping` не будет успешным с обоих хостов.

source: If the `ping` succeeds on both hosts but log messages are still not being received, temporarily increase logging verbosity to narrow down the configuration issue. In the following example, [.filename]#/var/log/logclient.log# on the logging server is empty and [.filename]#/var/log/messages# on the logging client does not indicate a reason for the failure. To increase debugging output, edit the `syslogd_flags` entry on the logging server and issue a restart:
ko: 두 호스트 모두에서 `ping`이 성공했지만 로그 메시지가 여전히 수신되지 않는 경우 일시적으로 로깅 상세도를 높여 구성 문제를 좁히세요. 다음 예제에서는 로깅 서버의 [.filename]#/var/log/logclient.log#가 비어 있고 로깅 클라이언트의 [.filename]#/var/log/messages#에 실패 사유가 표시되지 않습니다. 디버깅 출력을 늘리려면 로깅 서버에서 `syslogd_flags` 항목을 편집하고 다시 시작하세요:

source: Debugging data similar to the following will flash on the console immediately after the restart:
ko: 재시작 직후 콘솔에 다음과 유사한 디버깅 데이터가 깜박입니다:
ru: На консоли сразу после перезагрузки появится отладочная информация, подобная следующей:
