Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: This entry defines the values for this cron job. The `\*/11`, followed by several more `*` characters, specifies that `/usr/libexec/save-entropy` is invoked by `operator` every eleven minutes of every hour, of every day and day of the week, of every month. Commands can include any number of switches. However, commands which extend to multiple lines need to be broken with the backslash "\" continuation character.
ru: Эта запись определяет значения для этого задания cron. Комбинация `\*/11`, за которой следует несколько символов `*`, указывает, что `/usr/libexec/save-entropy` запускается от имени пользователя `operator` каждые одиннадцать минут каждого часа, каждого дня и дня недели, каждого месяца. Команды могут включать любое количество параметров. Однако команды, занимающие несколько строк, должны быть разделены символом продолжения обратной косой черты "\".

source: When finished editing the crontab, save the file. It will automatically be installed, and cron will read the crontab and run its cron jobs at their specified times. To list the cron jobs in a crontab, use this command:
ru: После завершения редактирования файла crontab сохраните его. Он будет автоматически установлен, и cron прочитает crontab и запустит задания по расписанию. Для просмотра списка заданий в crontab используйте следующую команду:

source: Periodic
ru: Периодические задачи (Periodic)

source: FreeBSD provides a set of system management scripts to check status of various subsystems, perform security-related checks, rotate log files, etc. These scripts are run on a periodic basis: daily. weekly, or monthly. The management of these tasks is performed by man:periodic[8] and its configuration resides in man:periodic.conf[5]. The periodic tasks are initiated by entries in the system crontab, shown above.
ru: FreeBSD предоставляет набор скриптов для управления системой, которые проверяют состояние различных подсистем, выполняют проверки, связанные с безопасностью, осуществляют ротацию файлов журналов и т.д. Эти скрипты запускаются периодически: ежедневно, еженедельно или ежемесячно. Управление этими задачами осуществляется с помощью man:periodic[8], а его конфигурация находится в man:periodic.conf[5]. Периодические задачи инициируются записями в системном crontab, как показано выше.

source: Scripts executed by man:periodic[8] are located in [.filename]#/etc/periodic/# for base utilities and in [.filename]#/usr/local/etc/periodic/# for third-party software.
ru: Скрипты, выполняемые man:periodic[8], расположены в [.filename]#/etc/periodic/# для базовых утилит и в [.filename]#/usr/local/etc/periodic/# для стороннего программного обеспечения.

source: They are organized in 4 subdirectories, daily, weekly, monthly and security.
ru: Они организованы в 4 подкаталога: daily, weekly, monthly и security.

source: Enable or Disable Periodic Tasks
ru: Включение или отключение периодических задач

source: FreeBSD has some scripts enabled by default to run periodically.
ru: FreeBSD имеет некоторые скрипты, включённые по умолчанию для периодического выполнения.

source: To enable or disable a task, the first step is to edit [.filename]#/etc/periodic.conf# executing the following command:
ru: Чтобы включить или отключить задачу, первым шагом необходимо отредактировать файл [.filename]#/etc/periodic.conf#, выполнив следующую команду:

source: And then to enable, for example, `daily_status_zfs_enable` put the following content in the file:
ru: И затем, чтобы включить, например, `daily_status_zfs_enable`, поместите следующее содержимое в файл:

source: To disable a task that is active by default, all that needs to be done is to change `YES` to `NO`.
ru: Чтобы отключить задание, которое активно по умолчанию, достаточно изменить `YES` на `NO`.

source: Configuring the Output of Periodic Tasks
ru: Настройка вывода периодических задач

source: In [.filename]#/etc/periodic.conf# the variables `daily_output`, `weekly_output` and `monthly_output` specifies where to send the results of the script execution.
ru: В файле [.filename]#/etc/periodic.conf# переменные `daily_output`, `weekly_output` и `monthly_output` определяют, куда отправлять результаты выполнения скриптов.

source: By default the output of the periodic scripts are emailed to root, and therefore it is best to read root's mail or alias root to a mailbox that is monitored.
ru: По умолчанию результаты работы периодических скриптов отправляются по электронной почте пользователю root, поэтому рекомендуется либо читать почту root, либо настроить пересылку писем root на почтовый ящик, который регулярно проверяется.

source: To send the results to another email or to other emails, add the email addresses separated by spaces to [.filename]#/etc/periodic.conf#:
ru: Чтобы отправить результаты на другой адрес электронной почты или на несколько адресов, добавьте email-адреса через пробел в файл [.filename]#/etc/periodic.conf#:

source: To log periodic output instead of receiving it as email, add the following lines to [.filename]#/etc/periodic.conf#. man:newsyslog[8] will rotate these files at the appropriate times:
ru: Для записи периодического вывода в журнал вместо получения его по электронной почте добавьте следующие строки в [.filename]#/etc/periodic.conf#. Утилита man:newsyslog[8] будет выполнять ротацию этих файлов в соответствующее время:

source: FreeBSD provides a system logger, man:syslogd[8], to manage logging. By default, syslogd is enabled and started when the system boots.
ru: FreeBSD предоставляет системный модуль журналирования man:syslogd[8] для управления журналированием. По умолчанию syslogd включен и запускается при загрузке системы.

source: This configuration file contains one line per action, where the syntax for each line is a selector field followed by an action field. The syntax of the selector field is _facility.level_ which will match log messages from _facility_ at level _level_ or higher. It is also possible to add an optional comparison flag before the level to specify more precisely what is logged. Multiple selector fields can be used for the same action, and are separated with a semicolon (`;`). Using `*` will match everything. The action field denotes where to send the log message, such as to a file or remote log host.
ru: Этот файл конфигурации содержит по одной строке для каждого действия, где синтаксис каждой строки представляет собой поле селектора, за которым следует поле действия. Синтаксис поля селектора — _facility.level_, что соответствует журнальным сообщениям от _facility_ уровня _level_ и выше. Также можно добавить необязательный флаг сравнения перед уровнем, чтобы точнее указать, что регистрируется. Для одного действия можно использовать несколько полей селектора, разделённых точкой с запятой (`;`). Использование `*` соответствует всем сообщениям. Поле действия указывает, куда отправлять журнальное сообщение, например, в файл или на удалённый хост для журналирования.

source: As an example, here is the default [.filename]#/etc/syslog.conf# from FreeBSD:
ru: В качестве примера приведен стандартный файл [.filename]#/etc/syslog.conf# из FreeBSD:

source: Matches all messages with a level of `err` or higher, as well as `kern.warning`, `auth.notice` and `mail.crit`, and sends these log messages to the console ([.filename]#/dev/console#).
ru: Соответствует всем сообщениям с уровнем `err` или выше, а также `kern.warning`, `auth.notice` и `mail.crit`, и отправляет эти сообщения журнала на консоль ([.filename]#/dev/console#).

source: Matches all messages from the `mail` facility at level `info` or above and logs the messages to [.filename]#/var/log/maillog#.
ru: Соответствует всем сообщениям из источника `mail` уровня `info` и выше и записывает их в [.filename]#/var/log/maillog#.

source: Uses a comparison flag (`=`) to only match messages at level `debug` and logs them to [.filename]#/var/log/debug.log#.
ru: Использует флаг сравнения (`=`) для совпадения только с сообщениями уровня `debug` и записывает их в [.filename]#/var/log/debug.log#.

source: Is an example usage of a program specification. This makes the rules following it only valid for the specified program. In this case, only the messages generated by man:devd[8] are logged to [.filename]#/var/log/devd.log#.
ru: Пример использования спецификации программы. Это делает следующие правила действительными только для указанной программы. В данном случае только сообщения, генерируемые man:devd[8], записываются в [.filename]#/var/log/devd.log#.

source: For more information about [.filename]#/etc/syslog.conf#, its syntax, and more advanced usage examples, see man:syslog.conf[5].
ru: Для получения дополнительной информации о [.filename]#/etc/syslog.conf#, его синтаксисе и более сложных примерах использования см. man:syslog.conf[5].

source: Logging Facilities
ru: Источники системы журналирования

source: A facility describes the part of the system generating the message. Facilities are a way of separating the different messages so that it is easier for the user to consult the logs.
ru: Источник описывает часть системы, генерирующую сообщение. Источники — это способ разделения различных сообщений, чтобы пользователю было проще анализировать журналы.

source: syslog facilities
ru: Источники системных журналов (syslog)

source: Name
ru: Имя

source: Description
ru: Описание

source: The authorization system: man:login[1], man:su[1], man:getty[8], etc.
ru: Система авторизации: man:login[1], man:su[1], man:getty[8] и т.д.

source: The same as auth, but logged to a file readable only by root.
ru: То же, что и auth, но записывается в файл, доступный только для чтения root.

source: Messages written to [.filename]#/dev/console# by the kernel console output driver.
ru: Сообщения, записываемые драйвером вывода консоли ядра в [.filename]#/dev/console#.

source: Messages written by the man:cron[8] daemon.
ru: Сообщения, записываемые демоном man:cron[8].

source: System daemons, such as man:routed[8], that are not provided for explicitly by other facilities.
ru: Системные демоны, такие как man:routed[8], которые не предусмотрены явно другими средствами.

source: The file transfer protocol daemons: man:ftpd[8], man:tftpd[8].
ru: Демоны протокола передачи файлов: man:ftpd[8], man:tftpd[8].

source: Messages generated by the kernel. These cannot be generated by any user processes.
ru: Сообщения, генерируемые ядром. Они не могут быть созданы какими-либо пользовательскими процессами.

source: The line printer spooling system: man:lpr[1], man:lpc[8], man:lpd[8], etc.
ru: Система буферизации принтеров: man:lpr[1], man:lpc[8], man:lpd[8] и т.д.

source: The mail system.
ru: Почтовая система.

source: This facility adds a record every 20 minutes.
ru: Этот механизм добавляет запись каждые 20 минут.

source: The network news system.
ru: Система сетевых новостей.

source: The network time protocol system.
ru: Система протокола сетевого времени.

source: Security subsystems, such as man:ipfw[4].
ru: Подсистемы безопасности, такие как man:ipfw[4].

source: Messages generated internally by syslogd(8).
ru: Сообщения, генерируемые внутренне syslogd(8).

source: Messages generated by random user processes. *This is the default facility identifier if none is specified*.
ru: Сообщения, генерируемые случайными пользовательскими процессами. *Это идентификатор источника по умолчанию, если не указан другой*.

source: The Unix-to-Unix Copy system. An ancient protocol. Really weird to see messages from this facility.
ru: Система Unix-to-Unix Copy. Устаревший протокол. Очень странно видеть сообщения от этого сервиса.

source: local0 through local7
ru: от `local0`до `local7`

source: Reserved for local use.
ru: Зарезервировано для локального использования.

source: Logging Levels
ru: Уровни журналирования

source: The level describes the severity of the message, and is a keyword from the following ordered list (higher to lower):
ru: Уровень описывает степень важности сообщения и является ключевым словом из следующего упорядоченного списка (от высшего к низшему):

source: syslog levels
ru: Уровни в syslog

source: A panic condition. This is normally broadcast to all users.
ru: Паника. Обычно это сообщение рассылается всем пользователям.

source: A condition that should be corrected immediately, such as a corrupted system database.
ru: Условие, которое должно быть немедленно исправлено, например, повреждение системной базы данных.

source: Critical conditions, e.g., hard device errors.
ru: Критические условия, например, аппаратные ошибки устройств.

source: Errors.
ru: Ошибки.

source: Warning messages.
ru: Предупреждающие сообщения.

source: Conditions that are not error conditions, but should possibly be handled specially.
ru: Условия, которые не являются ошибочными, но, возможно, требуют специальной обработки.

source: Informational messages.
ru: Информационные сообщения.

source: Messages that contain information normally of use only when debugging a program.
ru: Сообщения, содержащие информацию, которая обычно полезна только при отладке программы.

source: This special level disables a particular facility.
ru: Этот специальный уровень отключает определённую функцию.

source: Read Log Messages
ru: Как читать сообщения журналов

source: By default FreeBSD log files use the format link:https://datatracker.ietf.org/doc/html/rfc3164[rfc3164], also known as The BSD syslog Protocol. Learn more about other formats and how to use them at man:syslog[8].
ru: По умолчанию журнальные файлы FreeBSD используют формат link:https://datatracker.ietf.org/doc/html/rfc3164[rfc3164], также известный как протокол BSD syslog. Подробнее о других форматах и их использовании можно узнать в man:syslog[8].

source: Typically the logs have the following syntax:
ru: Обычно журналы имеют следующий синтаксис:

source: The output of the [.filename]#/var/log/cron# file will be used as an example:
ru: В качестве примера будет использоваться вывод файла [.filename]#/var/log/cron#:

source: Verbose logging, so the facility and the level on each message will be added, can be enabled in man:syslog[8] by running the following command:
ru: Подробное журналирование, при котором к каждому сообщению добавляются данные о facility и level, можно включить в man:syslog[8], выполнив следующую команду:

source: Once the function is activated, the facility and the level will be displayed in the log as shown in the following example:
ru: После активации функции источник и уровень будут отображаться в журнале, как показано в следующем примере:

source: Log files can grow quickly, taking up disk space and making it more difficult to locate useful information.
ru: Файлы журналов могут быстро увеличиваться в размере, занимая место на диске и затрудняя поиск полезной информации.

source: In FreeBSD, man:newsyslog[8] is used to manage log files and attempt to mitigate this.
ru: В FreeBSD для управления файлами журналов и предотвращения этой проблемы используется man:newsyslog[8].

source: This built-in program periodically rotates and compresses log files, and optionally creates missing log files and signals programs when log files are moved.
ru: Эта встроенная программа периодически выполняет ротацию и сжатие файлов журналов, а также при необходимости создает отсутствующие файлы журналов и отправляет сигналы программам при перемещении файлов журналов.

source: Since newsyslog is run from man:cron[8], it cannot rotate files more often than it is scheduled to run from man:cron[8]. In the default configuration, it runs every hour.
ru: Поскольку newsyslog запускается через man:cron[8], он не может выполнять ротацию файлов чаще, чем запланировано в man:cron[8]. В стандартной конфигурации он запускается каждый час.

source: Here is the default configuration in FreeBSD, more information in man:newsyslog.conf[5]:
ru: Вот стандартная конфигурация в FreeBSD, подробнее можно узнать в man:newsyslog.conf[5]:

source: `logfilename` - Name of the system log file to be archived.
ru: `logfilename` - Имя файла системного журнала, предназначенного для архивирования.

source: `[owner:group]` - This optional field specifies the owner and group for the archive file.
ru: `[owner:group]` - Это необязательное поле указывает владельца и группу для архивируемого файла.

source: `mode` - Specify the file mode of the log file and archives. Valid mode bits are 0666. (That is, read and write permissions for the rotated log may be specified for the owner, group, and others.)
ru: `mode` - Указывает режим доступа к файлу журнала и архивам. Допустимые биты режима - 0666. (То есть, права на чтение и запись для ротированного журнала могут быть заданы для владельца, группы и остальных пользователей.)

source: `count` - Specify the maximum number of archive files which may exist.
ru: `count` - Указывает максимальное количество архивных файлов, которые могут существовать.

source: `size` - When the size of the log file reaches size in kilobytes, the log file will be trimmed as described above. If this field contains an asterisk ('*'), the log file will not be trimmed based on size.
ru: `size` — Когда размер файла журнала достигает указанного размера в килобайтах, файл журнала будет обрезан, как описано выше. Если в этом поле указана звёздочка ('*'), файл журнала не будет обрезаться по размеру.

source: `when` - Consist of an interval, a specific time, or both. Supported options in man:newsyslog.conf[5].
ru: `when` - Может состоять из интервала, конкретного времени или обоих вариантов. Поддерживаемые опции описаны в man:newsyslog.conf[5].

source: `flags` - Indicates the flags that newsyslog accepts, supported options in man:newsyslog.conf[5].
ru: `flags` - Указывает флаги, которые принимает newsyslog, поддерживаемые опции описаны в man:newsyslog.conf[5].

source: `[/pid_file]` - This optional field specifies the file name containing a daemon's process ID or to find a group process ID.
ru: `[/pid_file]` - Это необязательное поле указывает имя файла, содержащего идентификатор процесса (PID) демона или идентификатор группы процессов.

source: `[sig_num]` - This optional field specifies the signal that will be sent to the daemon process.
ru: `[sig_num]` - Это необязательное поле указывает сигнал, который будет отправлен процессу демона.

source: The last two fields are optional and specify the name of the Process ID (PID) file of a process and a signal number to send to that process when the file is rotated.
ru: Последние два поля необязательны и указывают имя файла ID процесса (PID) и номер сигнала, который будет отправлен этому процессу при ротации файла.

source: In FreeBSD, centralized log file aggregation, merging, and rotation can be configured using syslogd and newsyslog.
ru: В FreeBSD централизованная агрегация, объединение и ротация файлов журналов могут быть настроены с помощью `syslogd` и `newsyslog`.

source: This section demonstrates an example configuration, where host `A`, named `logserv.example.com`, will collect logging information for the local network.
ru: В этом разделе приведен пример конфигурации, в которой хост `A` с именем `logserv.example.com` будет собирать информацию журналирования для локальной сети.

source: Host `B`, named `logclient.example.com`, will be configured to pass logging information to the logging server.
ru: Узел `B` с именем `logclient.example.com` будет настроен для передачи информации журналирования на сервер журналирования.

source: A log server is a system that has been configured to accept logging information from other hosts.
ru: Сервер журналов — это система, настроенная для приёма информации журналирования с других узлов.

source: Before configuring a log server, check the following:
ru: Перед настройкой сервера журналов проверьте следующее:

source: Next, execute the following commands:
ru: Далее выполните следующие команды:

source: Once a logging server has been configured, execute the following commands on the logging client:
ru: После настройки сервера журналирования выполните следующие команды на клиенте журналирования:

source: If the `ping` succeeds on both hosts but log messages are still not being received, temporarily increase logging verbosity to narrow down the configuration issue. In the following example, [.filename]#/var/log/logclient.log# on the logging server is empty and [.filename]#/var/log/messages# on the logging client does not indicate a reason for the failure.
ru: Если команда `ping` выполняется успешно на обоих хостах, но сообщения журнала по-прежнему не поступают, временно увеличьте уровень детализации журналирования, чтобы сузить круг поиска проблемы в конфигурации. В следующем примере файл [.filename]#/var/log/logclient.log# на сервере журналирования пуст, а файл [.filename]#/var/log/messages# на клиенте журналирования не указывает на причину сбоя.

source: To increase debugging output, edit the `syslogd_flags` entry on the logging server and issue a restart:
ru: Для увеличения уровня отладочной информации отредактируйте параметр `syslogd_flags` на сервере журналирования и выполните перезапуск:

source: It is important to utilize hardware resources in an efficient manner. Power and resource management allows the operating system to monitor system limits and to possibly run some actions triggered by events related to those limits.
ru: Важно эффективно использовать аппаратные ресурсы. Управление питанием и ресурсами позволяет операционной системе отслеживать системные ограничения и, возможно, выполнять некоторые действия, вызванные событиями, связанными с этими ограничениями.

source: ACPI configuration
ru: Конфигурация ACPI

source: On FreeBSD the management of these resources is managed by the man:acpi[4] kernel device.
ru: На FreeBSD управление этими ресурсами осуществляется с помощью устройства ядра man:acpi[4].

source: In FreeBSD the man:acpi[4] driver is loaded by default at system boot.
ru: В FreeBSD драйвер man:acpi[4] загружается по умолчанию при загрузке системы.

source: This driver *cannot be unloaded after boot* because the system bus uses it for various hardware interactions.
ru: Этот драйвер *нельзя выгрузить после загрузки*, так как системная шина использует его для различных взаимодействий с оборудованием.

source: In addition to man:acpi[4], FreeBSD has several dedicated kernel modules for various ACPI vendor subsystems. These modules will add some extra functionality like fan speed, keyboard backlit or screen brightness.
ru: В дополнение к man:acpi[4], FreeBSD имеет несколько специализированных модулей ядра для различных подсистем ACPI от производителей. Эти модули добавляют дополнительную функциональность, такую как управление скоростью вентилятора, подсветкой клавиатуры или яркостью экрана.

source: The list can be obtained by running the following command:
ru: Список можно получить, выполнив следующую команду:

source: In the event that, for example, an IBM/Lenovo laptop is used, it will be necessary to load the module man:acpi_ibm[4] by executing the following command:
ru: В случае, если используется ноутбук IBM/Lenovo, необходимо загрузить модуль man:acpi_ibm[4], выполнив следующую команду:

source: And add this line to [.filename]#/boot/loader.conf# to load it at boot:
ru: И добавьте эту строку в [.filename]#/boot/loader.conf#, чтобы загружать модуль при запуске:
