Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: This chapter explains much of the FreeBSD configuration process, including some of the parameters which can be set to tune a FreeBSD system.
ko: 이 장에서는 FreeBSD 시스템을 튜닝하기 위해 설정할 수 있는 몇 가지 파라미터를 포함하여 FreeBSD 구성 프로세스의 대부분을 설명합니다.

source: Part III. System Administration
ko: 파트 III. 시스템 관리
ru: Часть III. Администрирование системы

source: Chapter 13. Configuration and Tuning
ko: 13장. 구성 및 튜닝

source: Configuration and Tuning
ko: 구성 및 튜닝

source: Synopsis
ko: 요약
ru: Обзор

source: One of the important aspects of FreeBSD is proper system configuration. This chapter explains much of the FreeBSD configuration process, including some of the parameters which can be set to tune a FreeBSD system.
ko: FreeBSD의 중요한 측면 중 하나는 적절한 시스템 구성입니다. 이 장에서는 FreeBSD 시스템을 튜닝하기 위해 설정할 수 있는 몇 가지 파라미터를 포함하여 FreeBSD 구성 프로세스의 대부분을 설명합니다.
ru: Одним из важных аспектов FreeBSD является правильная настройка системы. В этой главе описывается процесс настройки FreeBSD, включая некоторые параметры, которые можно задать для тонкой настройки системы FreeBSD.

source: After reading this chapter, you will know:
ko: 이 챕터를 읽고 나면, 여러분은:
ru: Прочитав эту главу, вы будете знать:

source: The basics of [.filename]#rc.conf# configuration and [.filename]#/usr/local/etc/rc.d# startup scripts.
ko: [.filename]#rc.conf# 구성 및 [.filename]#/usr/local/etc/rc.d# 시작 스크립트의 기본.
ru: Основы настройки [.filename]#rc.conf# и скриптов запуска в [.filename]#/usr/local/etc/rc.d#.

source: How to configure and test a network card.
ko: 네트워크 카드를 구성하고 테스트하는 방법.

source: How to configure virtual hosts on network devices.
ko: 네트워크 장치에서 가상 호스트를 구성하는 방법.

source: How to use the various configuration files in [.filename]#/etc#.
ko: [.filename]#/etc#에 있는 다양한 설정 파일을 사용하는 방법.
ru: Как использовать различные конфигурационные файлы в [.filename]#/etc#.

source: How to tune FreeBSD using man:sysctl[8] variables.
ko: man:sysctl[8] 변수를 사용하여 FreeBSD를 튜닝하는 방법.
ru: Как настроить FreeBSD с помощью переменных man:sysctl[8].

source: How to tune disk performance and modify kernel limitations.
ko: 디스크 성능을 조정하고 커널 제한을 수정하는 방법.

source: Before reading this chapter, you should:
ko: 이 챕터를 읽기 전에 여러분은:
ru: Прежде чем читать эту главу, вы должны:

source: Understand UNIX(R) and FreeBSD basics (crossref:basics[basics,FreeBSD Basics]).
ko: UNIX(R) 및 FreeBSD 기본 사항을 이해합니다(crossref:basics[basics,FreeBSD Basics]).
ru: Понимать основы UNIX(R) и FreeBSD (crossref:basics[basics,Основы FreeBSD]).

source: Be familiar with the basics of kernel configuration and compilation (crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]).
ko: 커널 구성 및 컴파일의 기본 사항에 익숙해야 합니다 (crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]).

source: Starting Services
ko: 서비스 시작하기
ru: Запуск служб

source: Many users install third party software on FreeBSD from the Ports Collection and require the installed services to be started upon system initialization. Services, such as package:mail/postfix[] or package:www/apache22[] are just two of the many software packages which may be started during system initialization. This section explains the procedures available for starting third party software.
ko: 많은 사용자가 포트 컬렉션에서 타사 소프트웨어를 FreeBSD에 설치하며, 시스템 초기화 시 설치된 서비스가 시작되도록 요구합니다. package:mail/postfix[] 또는 package:www/apache22[]와 같은 서비스는 시스템 초기화 중에 시작될 수 있는 많은 소프트웨어 패키지 중 두 가지에 불과합니다. 이 섹션에서는 타사 소프트웨어를 시작할 때 사용할 수 있는 절차에 대해 설명합니다.

source: In FreeBSD, most included services, such as man:cron[8], are started through the system startup scripts.
ko: FreeBSD에서는 man:cron[8]과 같은 대부분의 기본 제공 서비스가 시스템 시작 스크립트를 통해 시작됩니다.

source: Extended Application Configuration
ko: 확장된 애플리케이션 구성

source: Now that FreeBSD includes [.filename]#rc.d#, configuration of application startup is easier and provides more features. Using the key words discussed in <<configtuning-rcd>>, applications can be set to start after certain other services and extra flags can be passed through [.filename]#/etc/rc.conf# in place of hard coded flags in the startup script. A basic script may look similar to the following:
ko: 이제 FreeBSD에 [.filename]#rc.d#가 포함되었으므로, 애플리케이션 시작을 구성하는 것이 더 쉬워지고 더 많은 기능을 제공합니다. <<configtuning-rcd>>에 설명된 키워드를 사용하여 애플리케이션이 특정 다른 서비스 이후에 시작되도록 설정할 수 있으며, 시작 스크립트에서 하드 코딩된 플래그 대신 [.filename]#/etc/rc.conf#을 통해 추가 플래그를 전달할 수 있습니다. 기본 스크립트는 다음과 비슷하게 보일 수 있습니다:

source: This script will ensure that the provided `utility` will be started after the `DAEMON` pseudo-service. It also provides a method for setting and tracking the process ID (PID).
ko: 이 스크립트는 제공된 `utility`가 `DAEMON` 의사 서비스 이후에 시작되도록 합니다. 또한 프로세스 ID(PID)를 설정하고 추적하는 방법도 제공합니다.

source: This application could then have the following line placed in [.filename]#/etc/rc.conf#:
ko: 그러면 이 애플리케이션은 [.filename]#/etc/rc.conf#에 다음 줄을 넣을 수 있습니다:

source: This method allows for easier manipulation of command line arguments, inclusion of the default functions provided in [.filename]#/etc/rc.subr#, compatibility with man:rcorder[8], and provides for easier configuration via [.filename]#rc.conf#.
ko: 이 방법을 사용하면 명령줄 인수를 더 쉽게 조작할 수 있고, [.filename]#/etc/rc.subr#에 제공되는 기본 함수를 포함할 수 있으며, man:rcorder[8]와 호환되고, [.filename]#rc.conf#를 통해 더 쉽게 구성할 수 있습니다.

source: Using Services to Start Services
ko: 서비스를 사용하여 시작하기
ru: Использование служб для запуска сервисов

source: Other services can be started using man:inetd[8]. Working with man:inetd[8] and its configuration is described in depth in crossref:network-servers[network-inetd,“The inetd Super-Server”].
ko: 다른 서비스는 man:inetd[8]을 사용하여 시작할 수 있습니다. man:inetd[8] 및 그 구성에 대한 작업은 crossref:network-servers[network-inetd,“The inetd Super-Server”]에 자세히 설명되어 있습니다.
ru: Другие службы могут быть запущены с помощью man:inetd[8]. Работа с man:inetd[8] и его настройка подробно описаны в crossref:network-servers[network-inetd,«Суперсервер inetd»].

source: In some cases, it may make more sense to use man:cron[8] to start system services. This approach has a number of advantages as man:cron[8] runs these processes as the owner of the man:crontab[5]. This allows regular users to start and maintain their own applications.
ko: 경우에 따라 man:cron[8]을 사용하여 시스템 서비스를 시작하는 것이 더 합리적일 수 있습니다. 이 접근 방식은 man:crontab[5]의 소유자로서 이러한 프로세스를 실행하기 때문에 여러 가지 장점이 있습니다. 이를 통해 일반 사용자가 자신의 애플리케이션을 시작하고 유지 관리할 수 있습니다.
ru: В некоторых случаях может быть целесообразнее использовать man:cron[8] для запуска системных служб. Такой подход имеет ряд преимуществ, поскольку man:cron[8] запускает эти процессы от имени владельца man:crontab[5]. Это позволяет обычным пользователям запускать и поддерживать свои собственные приложения.

source: The `@reboot` feature of man:cron[8], may be used in place of the time specification. This causes the job to run when man:cron[8] is started, normally during system initialization.
ko: man:cron[8]의 `@reboot` 기능을 시간 지정 대신 사용할 수 있습니다. 이렇게 하면 일반적으로 시스템 초기화 중에 man:cron[8]이 시작될 때 작업이 실행됩니다.
ru: Функция `@reboot` в man:cron[8] может быть использована вместо указания времени. Это приводит к запуску задачи при старте man:cron[8], обычно во время инициализации системы.

source: Configuring man:cron[8]
ko: man:cron[8] 구성하기

source: One of the most useful utilities in FreeBSD is cron. This utility runs in the background and regularly checks [.filename]#/etc/crontab# for tasks to execute and searches [.filename]#/var/cron/tabs# for custom crontab files. These files are used to schedule tasks which cron runs at the specified times. Each entry in a crontab defines a task to run and is known as a _cron job_.
ko: FreeBSD에서 가장 유용한 유틸리티 중 하나는 cron입니다. 이 유틸리티는 백그라운드에서 실행되며 [.filename]#/etc/crontab#에서 실행할 작업이 있는지 정기적으로 확인하고 [.filename]#/var/cron/tabs#에서 사용자 지정 crontab 파일을 검색합니다. 이러한 파일은 지정된 시간에 cron이 실행할 작업을 예약하는 데 사용됩니다. crontab의 각 항목은 실행할 작업을 정의하며 이를 _cron job_이라고 합니다.

source: Two different types of configuration files are used: the system crontab, which should not be modified, and user crontabs, which can be created and edited as needed. The format used by these files is documented in man:crontab[5]. The format of the system crontab, [.filename]#/etc/crontab# includes a `who` column which does not exist in user crontabs. In the system crontab, cron runs the command as the user specified in this column. In a user crontab, all commands run as the user who created the crontab.
ko: 두 가지 유형의 구성 파일이 사용됩니다. 수정해서는 안 되는 system crontab과 필요에 따라 생성하고 편집할 수 있는 user crontab이 그것입니다. 이러한 파일에 사용되는 형식은 man:crontab[5]에 문서화되어 있습니다. System crontab의 형식인 [.filename]#/etc/crontab#에는 user crontab에는 없는 `who` 열이 포함되어 있습니다. System crontab에서 cron은 이 열에 지정된 사용자로 명령을 실행합니다. User crontab에서는 모든 명령이 crontab을 생성한 사용자로 실행됩니다.
ru: Используются два типа конфигурационных файлов: системный crontab, который не следует изменять, и пользовательские crontabs, которые можно создавать и редактировать по необходимости. Формат этих файлов описан в man:crontab[5]. Формат системного crontab, [.filename]#/etc/crontab#, включает столбец `who`, который отсутствует в пользовательских crontabs. В системном crontab команды выполняются от имени пользователя, указанного в этом столбце. В пользовательском crontab все команды выполняются от имени пользователя, создавшего crontab.

source: User crontabs allow individual users to schedule their own tasks. The `root` user can also have a user [.filename]#crontab# which can be used to schedule tasks that do not exist in the system [.filename]#crontab#.
ko: User crontab을 사용하면 개별 사용자가 자신의 작업을 예약할 수 있습니다. `root` 사용자는 시스템 [.filename]#crontab#에 존재하지 않는 작업을 예약하는 데 사용할 수 있는 사용자 [.filename]#crontab#을 가질 수도 있습니다.
ru: Пользовательские crontab-файлы позволяют отдельным пользователям планировать свои собственные задачи. У пользователя `root` также может быть пользовательский [.filename]#crontab#, который можно использовать для планирования задач, отсутствующих в системном [.filename]#crontab#.

source: Here is a sample entry from the system crontab, [.filename]#/etc/crontab#:
ko: 다음은 system crontab의 샘플 항목인 [.filename]#/etc/crontab#입니다:
ru: Вот пример записи из системного crontab, [.filename]#/etc/crontab#:

source: Lines that begin with the `+#+` character are comments. A comment can be placed in the file as a reminder of what and why a desired action is performed. Comments cannot be on the same line as a command or else they will be interpreted as part of the command; they must be on a new line. Blank lines are ignored.
ko: `+#+` 문자로 시작하는 줄은 주석입니다. 주석은 파일에 원하는 작업이 수행되는 이유와 내용을 알려주는 알림으로 사용할 수 있습니다. 주석은 명령과 같은 줄에 있으면 명령의 일부로 해석되므로 새 줄에 넣어야 합니다. 빈 줄은 무시됩니다.
ru: Строки, начинающиеся с символа `+#+`, являются комментариями. Комментарий можно добавить в файл как напоминание о том, что и зачем выполняется. Комментарии не могут находиться на одной строке с командой, иначе они будут восприняты как часть команды; они должны быть на отдельной строке. Пустые строки игнорируются.

source: The equals (`=`) character is used to define any environment settings. In this example, it is used to define the `SHELL` and `PATH`. If the `SHELL` is omitted, cron will use the default Bourne shell. If the `PATH` is omitted, the full path must be given to the command or script to run.
ko: 등호(`=`) 문자는 환경 설정을 정의하는 데 사용됩니다. 이 예제에서는 `SHELL`과 `PATH`를 정의하는 데 사용됩니다. `SHELL`을 생략하면 cron은 기본 Bourne 셸을 사용합니다. `PATH`가 생략된 경우 실행할 명령 또는 스크립트의 전체 경로를 지정해야 합니다.
ru: Символ равенства (`=`) используется для определения параметров окружения. В данном примере он применяется для задания переменных `SHELL` и `PATH`. Если `SHELL` не указана, cron будет использовать оболочку Bourne по умолчанию. Если `PATH` не указан, необходимо указывать полный путь к команде или скрипту, который требуется выполнить.

source: This line defines the seven fields used in a system crontab: `minute`, `hour`, `mday`, `month`, `wday`, `who`, and `command`. The `minute` field is the time in minutes when the specified command will be run, the `hour` is the hour when the specified command will be run, the `mday` is the day of the month, `month` is the month, and `wday` is the day of the week. These fields must be numeric values, representing the twenty-four hour clock, or a `*`, representing all values for that field. The `who` field only exists in the system crontab and specifies which user the command should be run as. The last field is the command to be executed.
ko: 이 줄은 시스템 크론탭에 사용되는 7개의 필드를 정의합니다: `minute`, `hour`, `mday`, `month`, `wday`, `who`, `command` 입니다. `minute` 필드는 지정된 명령이 실행될 시간(분), `hour`은 지정된 명령이 실행될 시간, `mday`은 그 달의 날짜, `month`은 월, `wday`는 요일입니다. 이러한 필드는 24시간 시계를 나타내는 숫자 값 또는 해당 필드의 모든 값을 나타내는 `*`여야 합니다. `who` 필드는 system crontab에만 존재하며 명령으로 어떤 사용자로 실행될지 지정합니다. 마지막 필드는 실행할 명령입니다.
ru: Эта строка определяет семь полей, используемых в системном crontab: `minute`, `hour`, `mday`, `month`, `wday`, `who` и `command`. Поле `minute` указывает время в минутах, когда должна выполняться указанная команда, `hour` — час, `mday` — день месяца, `month` — месяц, а `wday` — день недели. Эти поля должны содержать числовые значения в 24-часовом формате или символ `*`, обозначающий все возможные значения для данного поля. Поле `who` существует только в системном crontab и указывает, от имени какого пользователя должна выполняться команда. Последнее поле — это команда, которую нужно выполнить.

source: This entry defines the values for this cron job. The `\*/5`, followed by several more `*` characters, specifies that `/usr/libexec/atrun` is invoked by `root` every five minutes of every hour, of every day and day of the week, of every month.Commands can include any number of switches. However, commands which extend to multiple lines need to be broken with the backslash "\" continuation character.
ko: 이 항목은 이 cron job의 값을 정의합니다. `\*/5` 뒤에 여러 개의 `*` 문자가 이어지면 매시간, 매일, 요일, 매월 5분마다 `root`에 의해 `/usr/libexec/atrun`이 호출되도록 지정되며, 명령에는 스위치 개수에 제한 없이 포함될 수 있습니다. 그러나 여러 줄로 확장되는 명령은 백슬래시 "\" 연속 문자로 끊어야 합니다.

source: Creating a User Crontab
ko: User Crontab 만들기
ru: Создание пользовательского Crontab

source: To create a user crontab, invoke `crontab` in editor mode:
ko: User crontab을 만들려면 편집기 모드에서 `crontab`을 호출합니다:
ru: Чтобы создать пользовательский crontab, вызовите `crontab` в режиме редактора:

source: This will open the user's crontab using the default text editor. The first time a user runs this command, it will open an empty file. Once a user creates a crontab, this command will open that file for editing.
ko: 그러면 기본 텍스트 편집기를 사용하여 사용자의 crontab이 열립니다. 사용자가 이 명령을 처음 실행하면 빈 파일이 열립니다. 사용자가 crontab을 만들면 이 명령은 편집을 위해 해당 파일을 엽니다.
ru: Это откроет crontab пользователя в текстовом редакторе по умолчанию. При первом запуске этой команды откроется пустой файл. После создания crontab эта команда будет открывать его для редактирования.

source: It is useful to add these lines to the top of the crontab file in order to set the environment variables and to remember the meanings of the fields in the crontab:
ko: 환경 변수를 설정하고 crontab에 있는 필드의 의미를 기억하기 위해 crontab 파일 상단에 이 줄을 추가하는 것이 유용합니다:
ru: Полезно добавить следующие строки в начало файла crontab, чтобы установить переменные окружения и запомнить назначение полей в crontab:

source: Then add a line for each command or script to run, specifying the time to run the command. This example runs the specified custom Bourne shell script every day at two in the afternoon. Since the path to the script is not specified in `PATH`, the full path to the script is given:
ko: 그런 다음 실행할 각 명령 또는 스크립트에 대해 한 줄을 추가하여 명령 실행 시간을 지정합니다. 이 예에서는 매일 오후 2시에 지정된 사용자 지정 Bourne 셸 스크립트를 실행합니다. 스크립트 경로가 `PATH`에 지정되지 않았으므로 스크립트의 전체 경로가 제공됩니다:
ru: Затем добавьте строку для каждой команды или скрипта, указав время их выполнения. В этом примере указанный пользовательский скрипт Bourne shell будет запускаться каждый день в два часа дня. Поскольку путь к скрипту не указан в `PATH`, указывается полный путь к скрипту:

source: Before using a custom script, make sure it is executable and test it with the limited set of environment variables set by cron. To replicate the environment that would be used to run the above cron entry, use:
ko: 사용자 지정 스크립트를 사용하기 전에 실행 가능한지 확인하고 cron에서 설정한 제한된 환경 변수 집합으로 테스트하세요. 위의 cron 항목을 실행하는 데 사용되는 환경을 복제하려면 다음을 사용합니다:
ru: Перед использованием пользовательского скрипта убедитесь, что он исполняемый, и протестируйте его с ограниченным набором переменных окружения, установленных cron. Чтобы воспроизвести окружение, которое будет использоваться для выполнения вышеуказанной записи cron, используйте:

source: The environment set by cron is discussed in man:crontab[5]. Checking that scripts operate correctly in a cron environment is especially important if they include any commands that delete files using wildcards.
ko: Cron으로 설정한 환경은 man:crontab[5]에 설명되어 있습니다. 스크립트가 와일드카드를 사용하여 파일을 삭제하는 명령이 포함된 경우 스크립트가 cron 환경에서 올바르게 작동하는지 확인하는 것이 특히 중요합니다.
ru: Окружение, устанавливаемое cron, описано в man:crontab[5]. Особенно важно проверять корректность работы скриптов в окружении cron, если они содержат команды удаления файлов с использованием шаблонов.

source: When finished editing the crontab, save the file. It will automatically be installed and cron will read the crontab and run its cron jobs at their specified times. To list the cron jobs in a crontab, use this command:
ko: Crontab 편집이 끝나면 파일을 저장합니다. 그러면 자동으로 설치되고 cron이 crontab을 읽고 지정된 시간에 cron job을 실행합니다. Crontab에 있는 cron job을 나열하려면 다음 명령을 사용합니다:

source: To remove all of the cron jobs in a user crontab:
ko: User crontab에서 모든 cron job을 제거하려면:
ru: Удалить все задания cron из пользовательского crontab:

source: Managing Services in FreeBSD
ko: FreeBSD에서 서비스 관리하기
ru: Управление службами в FreeBSD

source: FreeBSD uses the man:rc[8] system of startup scripts during system initialization and for managing services. The scripts listed in [.filename]#/etc/rc.d# provide basic services which can be controlled with the `start`, `stop`, and `restart` options to man:service[8]. For instance, man:sshd[8] can be restarted with the following command:
ko: FreeBSD는 시스템 초기화와 서비스 관리를 위해 man:rc[8] 시스템의 시작 스크립트를 사용합니다. [.filename]#/etc/rc.d#에 나열된 스크립트는 man:service[8]에 `start`, `stop` 및 `restart` 옵션으로 제어할 수 있는 기본 서비스를 제공합니다. 예를 들어, 다음 명령으로 man:sshd[8]를 재시작할 수 있습니다:

source: This procedure can be used to start services on a running system. Services will be started automatically at boot time as specified in man:rc.conf[5]. For example, to enable man:natd[8] at system startup, add the following line to [.filename]#/etc/rc.conf#:
ko: 이 절차는 실행 중인 시스템에서 서비스를 시작하는 데 사용할 수 있습니다. 서비스는 man:rc.conf[5]에 지정된 대로 부팅 시 자동으로 시작됩니다. 예를 들어, 시스템 시작 시 man:natd[8]를 활성화하려면 [.filename]#/etc/rc.conf#에 다음 줄을 추가합니다:

source: If a `natd_enable="NO"` line is already present, change the `NO` to `YES`. The man:rc[8] scripts will automatically load any dependent services during the next boot, as described below.
ko: `natd_enable="NO"` 줄이 이미 있는 경우, `NO`를 `YES`로 변경합니다. 아래에 설명된 대로 다음 부팅 시 man:rc[8] 스크립트가 종속 서비스를 자동으로 로드합니다.

source: Since the man:rc[8] system is primarily intended to start and stop services at system startup and shutdown time, the `start`, `stop` and `restart` options will only perform their action if the appropriate [.filename]#/etc/rc.conf# variable is set. For instance, `sshd restart` will only work if `sshd_enable` is set to `YES` in [.filename]#/etc/rc.conf#. To `start`, `stop` or `restart` a service regardless of the settings in [.filename]#/etc/rc.conf#, these commands should be prefixed with "one". For instance, to restart man:sshd[8] regardless of the current [.filename]#/etc/rc.conf# setting, execute the following command:
ko: man:rc[8] 시스템은 주로 시스템 시작 및 종료 시 서비스를 시작하고 중지하기 위한 것이므로, `start`, `stop` 및 `restart` 옵션은 적절한 [.filename]#/etc/rc.conf# 변수가 설정되어 있는 경우에만 동작을 수행합니다. 예를 들어, `sshd restart`는 `sshd_enable`이 [.filename]#/etc/rc.conf#에서 `YES`로 설정된 경우에만 작동합니다. [.filename]#/etc/rc.conf#의 설정에 관계없이 서비스를 `start`, `stop` 또는 `restart`하려면 이러한 명령 앞에 "one"을 붙여야 합니다. 예를 들어, 현재 [.filename]#/etc/rc.conf# 설정에 관계없이 man:sshd[8]을 다시 시작하려면 다음 명령을 실행합니다:

source: To check if a service is enabled in [.filename]#/etc/rc.conf#, run the appropriate man:rc[8] script with `rcvar`. This example checks to see if man:sshd[8] is enabled in [.filename]#/etc/rc.conf#:
ko: [.filename]#/etc/rc.conf#에서 서비스가 활성화되어 있는지 확인하려면 `rcvar`와 함께 적절한 man:rc[8] 스크립트를 실행합니다. 이 예에서는 [.filename]#/etc/rc.conf#에서 man:sshd[8]이 활성화되어 있는지 확인합니다:

source: The `# sshd` line is output from the above command, not a `root` console.
ko: `root` 콘솔이 아닌 위 명령에서 `# sshd` 줄이 출력됩니다.

source: To determine whether or not a service is running, use `status`. For instance, to verify that man:sshd[8] is running:
ko: 서비스가 실행 중인지 확인하려면 `status`를 사용합니다. 예를 들어, man:sshd[8]이 실행 중인지 확인합니다:

source: In some cases, it is also possible to `reload` a service. This attempts to send a signal to an individual service, forcing the service to reload its configuration files. In most cases, this means sending the service a `SIGHUP` signal. Support for this feature is not included for every service.
ko: 경우에 따라 서비스를 `reload`할 수도 있습니다. 이는 개별 서비스에 신호를 전송하여 서비스가 구성 파일을 강제로 다시 로드하도록 시도합니다. 대부분의 경우 이는 서비스에 `SIGHUP` 신호를 보내는 것을 의미합니다. 이 기능이 모든 서비스에 지원되는 것은 아닙니다.

source: The man:rc[8] system is used for network services and it also contributes to most of the system initialization. For instance, when the [.filename]#/etc/rc.d/bgfsck# script is executed, it prints out the following message:
ko: man:rc[8] 시스템은 네트워크 서비스에 사용되며 대부분의 시스템 초기화에도 기여합니다. 예를 들어 [.filename]#/etc/rc.d/bgfsck# 스크립트가 실행되면 다음과 같은 메시지가 출력됩니다:
ru: Система man:rc[8] используется для сетевых сервисов, а также играет важную роль в большинстве процессов инициализации системы. Например, при выполнении скрипта [.filename]#/etc/rc.d/bgfsck# выводится следующее сообщение:

source: Starting background file system checks in 60 seconds.
ko: 60초 후에 백그라운드 파일 시스템 검사를 시작하기.

source: This script is used for background file system checks, which occur only during system initialization.
ko: 이 스크립트는 시스템 초기화 중에만 발생하는 백그라운드 파일 시스템 검사에 사용됩니다.
ru: Этот скрипт используется для фоновой проверки файловых систем, которая выполняется только во время инициализации системы.

source: Many system services depend on other services to function properly. For example, man:yp[8] and other RPC-based services may fail to start until after the man:rpcbind[8] service has started. To resolve this issue, information about dependencies and other meta-data is included in the comments at the top of each startup script. The man:rcorder[8] program is used to parse these comments during system initialization to determine the order in which system services should be invoked to satisfy the dependencies.
ko: 많은 시스템 서비스는 제대로 작동하기 위해 다른 서비스에 의존합니다. 예를 들어, man:yp[8] 및 기타 RPC 기반 서비스는 man:rpcbind[8] 서비스가 시작될 때까지 시작하지 못할 수 있습니다. 이 문제를 해결하기 위해 종속성 및 기타 메타 데이터에 대한 정보가 각 시작 스크립트 상단의 주석에 포함되어 있습니다. man:rcorder[8] 프로그램은 시스템 초기화 중에 이러한 주석을 파싱하여 종속성을 충족하기 위해 시스템 서비스를 호출해야 하는 순서를 결정하는 데 사용됩니다.

source: The following key word must be included in all startup scripts as it is required by man:rc.subr[8] to "enable" the startup script:
ko: 다음 키워드는 시작 스크립트를 "활성화"하기 위해 man:rc.subr[8]에 필요하므로 모든 시작 스크립트에 포함되어야 합니다:

source: `PROVIDE`: Specifies the services this file provides.
ko: `PROVIDE`: 이 파일이 제공하는 서비스를 지정합니다.

source: The following key words may be included at the top of each startup script. They are not strictly necessary, but are useful as hints to man:rcorder[8]:
ko: 각 시작 스크립트 상단에 다음 키워드를 포함할 수 있습니다. 반드시 필요한 것은 아니지만 man:rcorder[8]에 대한 힌트로 유용합니다:

source: `REQUIRE`: Lists services which are required for this service. The script containing this key word will run _after_ the specified services.
ko: `REQUIRE`: 이 서비스에 필요한 서비스를 나열합니다. 이 키워드가 포함된 스크립트는 지정된 서비스 _후_에 실행됩니다.

source: `BEFORE`: Lists services which depend on this service. The script containing this key word will run _before_ the specified services.
ko: `BEFORE`: 이 서비스에 종속된 서비스를 나열합니다. 이 키워드가 포함된 스크립트는 지정된 서비스 _전에_ 실행됩니다.
