Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: The second approach is to use asynchronous meta-data updates. This is the default for a UFS file system mounted with `mount -o async`. Since all meta-data updates are also passed through the buffer cache, they will be intermixed with the updates of the file content data. The advantage of this implementation is there is no need to wait until each meta-data update has been written to disk, so all operations which cause huge amounts of meta-data updates work much faster than in the synchronous case. This implementation is still clear and simple, so there is a low risk for bugs creeping into the code. The disadvantage is that there is no guarantee for a consistent state of the file system If there is a failure during an operation that updated large amounts of meta-data, like a power failure or someone pressing the reset button, the file system will be left in an unpredictable state. There is no opportunity to examine the state of the file system when the system comes up again as the data blocks of a file could already have been written to the disk while the updates of the inode table or the associated directory were not. It is impossible to implement a man:fsck[8] which is able to clean up the resulting chaos because the necessary information is not available on the disk. If the file system has been damaged beyond repair, the only choice is to reformat it and restore from backup.
ko: 두 번째 접근 방식은 비동기 메타데이터 업데이트를 사용하는 것입니다. 이것은 `mount -o async`로 마운트된 UFS 파일 시스템의 기본값입니다. 모든 메타데이터 업데이트도 버퍼 캐시를 통해 전달되므로 파일 콘텐츠 데이터의 업데이트와 혼합됩니다. 이 구현의 장점은 각 메타데이터 업데이트가 디스크에 기록될 때까지 기다릴 필요가 없으므로 대량의 메타데이터 업데이트를 유발하는 모든 작업이 동기식 경우보다 훨씬 빠르게 작동한다는 것입니다. 이 구현은 여전히 명확하고 간단하므로 코드에 버그가 숨어 있을 위험이 낮습니다. 단점은 파일 시스템의 일관된 상태를 보장할 수 없다는 것입니다. 대량의 메타데이터를 업데이트하는 작업 중에 정전이나 누군가 리셋 버튼을 누르는 등의 장애가 발생하면 파일 시스템이 예측할 수 없는 상태로 남게 됩니다. 파일의 데이터 블록은 이미 디스크에 기록되었을 수 있지만, 이노드 테이블이나 관련 디렉터리의 업데이트는 기록되지 않았을 수 있으므로 시스템이 다시 시작될 때 파일 시스템의 상태를 검사할 기회가 없습니다. 디스크에서 필요한 정보를 사용할 수 없기 때문에 그로 인한 혼돈을 정리할 수 있는 man:fsck[8]를 구현하는 것은 불가능합니다. 파일 시스템이 복구할 수 없을 정도로 손상된 경우 유일한 선택은 파일 시스템을 다시 포맷하고 백업에서 복원하는 것입니다.

source: The usual solution for this problem is to implement _dirty region logging_, which is also referred to as _journaling_. Meta-data updates are still written synchronously, but only into a small region of the disk. Later on, they are moved to their proper location. Since the logging area is a small, contiguous region on the disk, there are no long distances for the disk heads to move, even during heavy operations, so these operations are quicker than synchronous updates. Additionally, the complexity of the implementation is limited, so the risk of bugs being present is low. A disadvantage is that all meta-data is written twice, once into the logging region and once to the proper location, so performance "pessimization" might result. On the other hand, in case of a crash, all pending meta-data operations can be either quickly rolled back or completed from the logging area after the system comes up again, resulting in a fast file system startup.
ko: 이 문제에 대한 일반적인 해결책은 _저널링_이라고도 하는 _더티 영역 로깅_을 구현하는 것입니다. 메타데이터 업데이트는 여전히 동기식으로 기록되지만 디스크의 작은 영역에만 기록됩니다. 나중에 적절한 위치로 이동됩니다. 로깅 영역은 디스크의 작고 인접한 영역이므로 작업이 많은 경우에도 디스크 헤드가 이동해야 하는 거리가 길지 않으므로 이러한 작업이 동기식 업데이트보다 빠릅니다. 또한 구현의 복잡성이 제한되어 있으므로 버그가 발생할 위험이 낮습니다. 단점은 모든 메타데이터가 로깅 영역에 한 번, 적절한 위치에 한 번씩 두 번 기록되므로 성능이 저하될 수 있다는 것입니다. 반면에 충돌이 발생하면 보류 중인 모든 메타데이터 작업을 빠르게 롤백하거나 시스템이 다시 가동된 후 로깅 영역에서 완료할 수 있으므로 파일 시스템을 빠르게 시작할 수 있습니다.

source: Kirk McKusick, the developer of Berkeley FFS, solved this problem with Soft Updates. All pending meta-data updates are kept in memory and written out to disk in a sorted sequence ("ordered meta-data updates"). This has the effect that, in case of heavy meta-data operations, later updates to an item "catch" the earlier ones which are still in memory and have not already been written to disk. All operations are generally performed in memory before the update is written to disk and the data blocks are sorted according to their position so that they will not be on the disk ahead of their meta-data. If the system crashes, an implicit "log rewind" causes all operations which were not written to the disk appear as if they never happened. A consistent file system state is maintained that appears to be the one of 30 to 60 seconds earlier. The algorithm used guarantees that all resources in use are marked as such in their blocks and inodes. After a crash, the only resource allocation error that occurs is that resources are marked as "used" which are actually "free". man:fsck[8] recognizes this situation, and frees the resources that are no longer used. It is safe to ignore the dirty state of the file system after a crash by forcibly mounting it with `mount -f`. In order to free resources that may be unused, man:fsck[8] needs to be run at a later time. This is the idea behind the _background man:fsck[8]_: at system startup time, only a _snapshot_ of the file system is recorded and man:fsck[8] is run afterwards. All file systems can then be mounted "dirty", so the system startup proceeds in multi-user mode. Then, background man:fsck[8] is scheduled for all file systems where this is required, to free resources that may be unused. File systems that do not use Soft Updates still need the usual foreground man:fsck[8].
ko: 버클리 FFS의 개발자 Kirk McKusick은 소프트 업데이트로 이 문제를 해결했습니다. 보류 중인 모든 메타데이터 업데이트는 메모리에 보관되고 정렬된 순서("정렬된 메타데이터 업데이트")로 디스크에 기록됩니다. 이렇게 하면 메타데이터 작업이 많은 경우 나중에 항목에 대한 업데이트가 아직 메모리에 남아 있고 디스크에 아직 기록되지 않은 이전 업데이트를 "포착"하는 효과가 있습니다. 모든 작업은 일반적으로 업데이트가 디스크에 기록되기 전에 메모리에서 수행되며, 데이터 블록은 위치에 따라 정렬되어 메타 데이터보다 디스크에 먼저 기록되지 않습니다. 시스템이 충돌하면 암시적 '로그 되감기'로 인해 디스크에 기록되지 않은 모든 작업이 마치 발생한 적이 없는 것처럼 표시됩니다. 30~60초 전의 파일 시스템 상태가 일관되게 유지됩니다. 사용된 알고리즘은 사용 중인 모든 리소스가 해당 블록과 이노드에 표시되도록 보장합니다. 크래시 후 발생하는 유일한 리소스 할당 오류는 실제로는 "비었음"인 리소스가 "사용 중"으로 표시되는 것입니다. man:fsck[8]는 이 상황을 인식하고 더 이상 사용되지 않는 리소스를 해제합니다. `mount -f`로 강제 마운트하여 크래시 후 파일 시스템의 더티 상태를 무시하는 것이 안전합니다. 사용하지 않을 수 있는 리소스를 확보하려면 나중에 man:fsck[8]를 실행해야 합니다. 이것이 바로 시스템 시작 시 파일 시스템의 _스냅샷_만 기록하고 나중에 man:fsck[8]을 실행하는 _background man:fsck[8]_의 아이디어입니다. 그러면 모든 파일 시스템을 "더티" 마운트할 수 있으므로 시스템 시작이 다중 사용자 모드에서 진행됩니다. 그런 다음 백그라운드 man:fsck[8]가 필요한 모든 파일 시스템에 대해 스케줄링되어 사용되지 않을 수 있는 리소스를 해제합니다. 소프트 업데이트를 사용하지 않는 파일 시스템에는 여전히 일반적인 포그라운드 man:fsck[8]가 필요합니다.

source: The advantage is that meta-data operations are nearly as fast as asynchronous updates and are faster than _logging_, which has to write the meta-data twice. The disadvantages are the complexity of the code, a higher memory consumption, and some idiosyncrasies. After a crash, the state of the file system appears to be somewhat "older". In situations where the standard synchronous approach would have caused some zero-length files to remain after the man:fsck[8], these files do not exist at all with Soft Updates because neither the meta-data nor the file contents have been written to disk. Disk space is not released until the updates have been written to disk, which may take place some time after running man:rm[1]. This may cause problems when installing large amounts of data on a file system that does not have enough free space to hold all the files twice.
ko: 장점은 메타데이터 작업이 비동기 업데이트만큼 빠르며 메타데이터를 두 번 써야 하는 _logging_보다 빠르다는 것입니다. 단점은 코드가 복잡하고 메모리를 더 많이 사용하며 몇 가지 특이한 점이 있다는 것입니다. 충돌 후 파일 시스템의 상태는 다소 "오래된" 것처럼 보입니다. 표준 동기식 접근 방식에서는 man:fsck[8] 이후에도 길이가 0인 파일이 일부 남아있을 수 있지만, 소프트 업데이트에서는 메타데이터나 파일 내용이 디스크에 기록되지 않았기 때문에 이러한 파일이 전혀 존재하지 않습니다. 디스크 공간은 업데이트가 디스크에 기록될 때까지 해제되지 않으며, 이는 man:rm[1]을 실행한 후 일정 시간이 지난 후에 발생할 수 있습니다. 모든 파일을 두 번 저장할 수 있는 충분한 여유 공간이 없는 파일 시스템에 많은 양의 데이터를 설치할 때 문제가 발생할 수 있습니다.

source: Tuning Kernel Limits
ko: 커널 제한 튜닝하기

source: File/Process Limits
ko: 파일/프로세스 제한

source: The `kern.maxfiles` man:sysctl[8] variable can be raised or lowered based upon system requirements. This variable indicates the maximum number of file descriptors on the system. When the file descriptor table is full, `file: table is full` will show up repeatedly in the system message buffer, which can be viewed using man:dmesg[8].
ko: `kern.maxfiles` man:sysctl[8] 변수는 시스템 요구 사항에 따라 높이거나 낮출 수 있습니다. 이 변수는 시스템에서 파일 기술자(descriptor)의 최대 수를 나타냅니다. 파일 기술자 테이블이 가득 차면 시스템 메시지 버퍼에 `file: table is full`이 반복적으로 표시되며, 이는 man:dmesg[8]을 사용하여 확인할 수 있습니다.

source: Each open file, socket, or fifo uses one file descriptor. A large-scale production server may easily require many thousands of file descriptors, depending on the kind and number of services running concurrently.
ko: 열려 있는 파일, 소켓 또는 fifo는 각각 하나의 파일 기술자를 사용합니다. 대규모 프로덕션 서버에는 동시에 실행되는 서비스의 종류와 수에 따라 수천 개의 파일 설명자가 필요할 수 있습니다.

source: In older FreeBSD releases, the default value of `kern.maxfiles` is derived from `maxusers` in the kernel configuration file. `kern.maxfiles` grows proportionally to the value of `maxusers`. When compiling a custom kernel, consider setting this kernel configuration option according to the use of the system. From this number, the kernel is given most of its pre-defined limits. Even though a production machine may not have 256 concurrent users, the resources needed may be similar to a high-scale web server.
ko: 이전 FreeBSD 릴리즈에서, `kern.maxfiles`의 기본값은 커널 구성 파일의 `maxusers`에서 파생됩니다. `kern.maxfiles는 `maxusers`의 값에 비례하여 증가합니다. 커스텀 커널을 컴파일할 때 시스템 용도에 따라 이 커널 구성 옵션을 설정하는 것을 고려하세요. 이 수치에서 커널은 대부분의 사전 정의된 한계를 부여받습니다. 프로덕션 머신의 동시 사용자 수가 256명이 아닐지라도 필요한 리소스는 대규모 웹 서버와 비슷할 수 있습니다.

source: The read-only man:sysctl[8] variable `kern.maxusers` is automatically sized at boot based on the amount of memory available in the system, and may be determined at run-time by inspecting the value of `kern.maxusers`. Some systems require larger or smaller values of `kern.maxusers` and values of `64`, `128`, and `256` are not uncommon. Going above `256` is not recommended unless a huge number of file descriptors is needed. Many of the tunable values set to their defaults by `kern.maxusers` may be individually overridden at boot-time or run-time in [.filename]#/boot/loader.conf#. Refer to man:loader.conf[5] and [.filename]#/boot/defaults/loader.conf# for more details and some hints.
ko: 읽기 전용 man:sysctl[8] 변수 `kern.maxusers`는 시스템에서 사용 가능한 메모리 양에 따라 부팅 시 자동으로 크기가 결정되며, 런타임에 `kern.maxusers`의 값을 검사하여 결정될 수 있습니다. 일부 시스템에서는 더 크거나 작은 값을 필요로 하며 `64`, `128`, `256`의 값은 드물지 않습니다. 많은 수의 파일 기술자가 필요하지 않는 한 `256`을 초과하는 것은 권장하지 않습니다. `kern.maxusers`에 의해 기본값으로 설정된 많은 조정 가능한 값은 부팅 시간 또는 런타임에 [.filename]#/boot/loader.conf#에서 개별적으로 재정의할 수 있습니다. 자세한 내용과 몇 가지 힌트는 man:loader.conf[5] 및 [.filename]#/boot/defaults/loader.conf#를 참조하세요.

source: In older releases, the system will auto-tune `maxusers` if it is set to `0`. footnote:[The auto-tuning algorithm sets maxusers equal to the amount of memory in the system, with a minimum of 32, and a maximum of 384.]. When setting this option, set `maxusers` to at least `4`, especially if the system runs Xorg or is used to compile software. The most important table set by `maxusers` is the maximum number of processes, which is set to `20 + 16 * maxusers`. If `maxusers` is set to `1`, there can only be `36` simultaneous processes, including the `18` or so that the system starts up at boot time and the `15` or so used by Xorg. Even a simple task like reading a manual page will start up nine processes to filter, decompress, and view it. Setting `maxusers` to `64` allows up to `1044` simultaneous processes, which should be enough for nearly all uses. If, however, the error is displayed when trying to start another program, or a server is running with a large number of simultaneous users, increase the number and rebuild.
ko: 과거 릴리스에선 `maxusers`가 `0`으로 설정되어 있으면 자동 튜닝이 되었습니다. footnote:[자동 튜닝 알고리즘은 최소 32에서 최대 384까지 시스템의 메모리 양과 동일한 최대 사용자를 자동 튜닝합니다.] 이 옵션을 설정할 때, 특히 시스템이 Xorg를 실행하거나 소프트웨어 컴파일에 사용되는 경우 `maxusers`를 최소 `4`로 설정하세요. `maxusers`로 설정되는 가장 중요한 테이블은 최대 프로세스 수이며, `20 + 16 * maxusers`로 설정됩니다. `maxusers`가 `1`로 설정되면 부팅 시 시스템이 시작되는 `18`개와 Xorg가 사용하는 `15`개를 포함하여 총 `36`개의 동시 프로세스만 있을 수 있습니다. 매뉴얼 페이지를 읽는 것과 같은 간단한 작업도 필터링, 압축 해제 및 보기를 위해 9개의 프로세스가 시작됩니다. `maxusers`를 `64`로 설정하면 최대 `1044` 개의 프로세스를 동시에 처리할 수 있으므로 거의 모든 용도에 충분합니다. 그러나 다른 프로그램을 시작하려고 할 때 오류가 표시되거나 동시 사용자 수가 많은 서버를 실행 중인 경우 수를 늘린 후 다시 빌드하세요.

source: `maxusers` does _not_ limit the number of users which can log into the machine. It instead sets various table sizes to reasonable values considering the maximum number of users on the system and how many processes each user will be running.
ko: `maxusers`는 시스템에 로그인할 수 있는 사용자 수를 제한하지 않습니다. 대신 시스템의 최대 사용자 수와 각 사용자가 실행할 프로세스 수를 고려하여 다양한 테이블 크기를 합리적인 값으로 설정합니다.

source: The `kern.ipc.soacceptqueue` man:sysctl[8] variable limits the size of the listen queue for accepting new `TCP` connections. The default value of `128` is typically too low for robust handling of new connections on a heavily loaded web server. For such environments, it is recommended to increase this value to `1024` or higher. A service such as man:sendmail[8], or Apache may itself limit the listen queue size, but will often have a directive in its configuration file to adjust the queue size. Large listen queues do a better job of avoiding Denial of Service (DoS) attacks.
ko: `kern.ipc.soacceptqueue` man:sysctl[8] 변수는 새 `TCP` 연결을 수락하기 위한 수신 대기열의 크기를 제한합니다. 기본값인 `128`은 일반적으로 부하가 많은 웹 서버에서 새 연결을 안정적으로 처리하기에는 너무 낮습니다. 이러한 환경에서는 이 값을 `1024` 이상으로 늘리는 것이 좋습니다. man:sendmail[8]이나 아파치 같은 서비스는 자체적으로 수신 대기열 크기를 제한할 수도 있지만, 구성 파일에 대기열 크기를 조정하는 지시어가 있는 경우가 많습니다. 수신 대기열이 크면 서비스 거부(DoS) 공격을 더 잘 피할 수 있습니다.

source: Network Limits
ko: 네트워크 제한

source: The `NMBCLUSTERS` kernel configuration option dictates the amount of network Mbufs available to the system. A heavily-trafficked server with a low number of Mbufs will hinder performance. Each cluster represents approximately 2 K of memory, so a value of `1024` represents `2` megabytes of kernel memory reserved for network buffers. A simple calculation can be done to figure out how many are needed. A web server which maxes out at `1000` simultaneous connections where each connection uses a 6 K receive and 16 K send buffer, requires approximately 32 MB worth of network buffers to cover the web server. A good rule of thumb is to multiply by `2`, so 2x32 MB / 2 KB = 64 MB / 2 kB = `32768`. Values between `4096` and `32768` are recommended for machines with greater amounts of memory. Never specify an arbitrarily high value for this parameter as it could lead to a boot time crash. To observe network cluster usage, use `-m` with man:netstat[1].
ko: 커널 구성 옵션인 `NMBCLUSTERS`는 시스템에서 사용할 수 있는 네트워크 Mbuf의 양을 결정합니다. 트래픽이 많은 서버에서 Mbuf 수가 적으면 성능이 저하됩니다. 각 클러스터는 약 2K의 메모리를 나타내므로 `1024` 값은 네트워크 버퍼를 위해 예약된 커널 메모리의 `2` 메가바이트를 나타냅니다. 간단한 계산을 통해 얼마나 많은 메모리가 필요한지 알아낼 수 있습니다. 각 연결이 6K 수신 및 16K 전송 버퍼를 사용하는 동시 연결이 최대 '1000'인 웹 서버의 경우 웹 서버를 처리하려면 약 32MB 상당의 네트워크 버퍼가 필요합니다. 경험상 `2`를 곱하는 것이 좋으므로 2x32MB/2KB = 64MB/2kB = `32768`입니다. `4096`에서 `32768` 사이의 값은 메모리 용량이 더 큰 컴퓨터에 권장됩니다. 이 매개변수에 임의로 높은 값을 지정하면 부팅 시간 충돌이 발생할 수 있으므로 절대로 높은 값을 지정하지 마십시오. 네트워크 클러스터 사용량을 관찰하려면 `-m`을 man:netstat[1]과 함께 사용하세요.

source: The `kern.ipc.nmbclusters` loader tunable should be used to tune this at boot time. Only older versions of FreeBSD will require the use of the `NMBCLUSTERS` kernel man:config[8] option.
ko: 부팅할 때 `kern.ipc.nmbclusters` 로더 튜너블을 사용하여 이를 조정해야 합니다. 이전 버전의 FreeBSD에서만 `NMBCLUSTERS` 커널 man:config[8] 옵션을 사용해야 합니다.

source: For busy servers that make extensive use of the man:sendfile[2] system call, it may be necessary to increase the number of man:sendfile[2] buffers via the `NSFBUFS` kernel configuration option or by setting its value in [.filename]#/boot/loader.conf# (see man:loader[8] for details). A common indicator that this parameter needs to be adjusted is when processes are seen in the `sfbufa` state. The man:sysctl[8] variable `kern.ipc.nsfbufs` is read-only. This parameter nominally scales with `kern.maxusers`, however it may be necessary to tune accordingly.
ko: man:sendfile[2] 시스템 호출을 광범위하게 사용하는 바쁜 서버의 경우, `NSFBUFS` 커널 구성 옵션을 통해 또는 [.filename]#/boot/loader.conf#에 값을 설정하여 man:sendfile[2] 버퍼 수를 늘려야 할 수 있습니다(자세한 내용은 man:loader[8] 참고). 이 매개변수를 조정해야 하는 일반적인 지표는 프로세스가 `sfbufa` 상태로 표시되는 경우입니다. man:sysctl[8] 변수 `kern.ipc.nsfbufs`는 읽기 전용입니다. 이 매개변수는 명목상 `kern.maxusers`에 따라 스케일링되지만 직접 조정해야 할 수도 있습니다.

source: Even though a socket has been marked as non-blocking, calling man:sendfile[2] on the non-blocking socket may result in the man:sendfile[2] call blocking until enough ``struct sf_buf``'s are made available.
ko: 소켓이 비차단 소켓으로 표시되어 있더라도, 비차단 소켓에서 man:sendfile[2]을 호출하면 충분한 ``struct sf_buf``를 사용할 수 있을 때까지 man:sendfile[2] 호출이 차단될 수 있습니다.

source: The `net.inet.ip.portrange.*` man:sysctl[8] variables control the port number ranges automatically bound to `TCP` and `UDP` sockets. There are three ranges: a low range, a default range, and a high range. Most network programs use the default range which is controlled by `net.inet.ip.portrange.first` and `net.inet.ip.portrange.last`, which default to `1024` and `5000`, respectively. Bound port ranges are used for outgoing connections and it is possible to run the system out of ports under certain circumstances. This most commonly occurs when running a heavily loaded web proxy. The port range is not an issue when running a server which handles mainly incoming connections, such as a web server, or has a limited number of outgoing connections, such as a mail relay. For situations where there is a shortage of ports, it is recommended to increase `net.inet.ip.portrange.last` modestly. A value of `10000`, `20000` or `30000` may be reasonable. Consider firewall effects when changing the port range. Some firewalls may block large ranges of ports, usually low-numbered ports, and expect systems to use higher ranges of ports for outgoing connections. For this reason, it is not recommended that the value of `net.inet.ip.portrange.first` be lowered.
ko: `net.inet.ip.portrange.*` man:sysctl[8] 변수는 `TCP` 및 `UDP` 소켓에 자동으로 바인딩되는 포트 번호 범위를 제어합니다. 낮은 범위, 기본 범위, 높은 범위의 세 가지 범위가 있습니다. 대부분의 네트워크 프로그램은 `net.inet.ip.portrange.first`와 `net.inet.ip.portrange.last`에 의해 제어되는 기본 범위를 사용하며, 기본값은 각각 `1024`와 `5000`입니다. 바운드 포트 범위는 나가는 연결에 사용되며 특정 상황에서는 포트가 부족하여 시스템이 고갈될 수 있습니다. 이는 부하가 많은 웹 프록시를 실행할 때 가장 일반적으로 발생합니다. 웹 서버와 같이 주로 들어오는 연결을 처리하거나 메일 릴레이와 같이 나가는 연결 수가 제한되어 있는 서버를 실행할 때는 포트 범위가 문제가 되지 않습니다. 포트가 부족한 상황에서는 `net.inet.ip.portrange.last`를 적당히 늘리는 것이 좋습니다. `10000`, `20000` 또는 `30000`의 값이 적당할 수 있습니다. 포트 범위를 변경할 때는 방화벽 효과를 고려하세요. 일부 방화벽은 넓은 범위의 포트(일반적으로 낮은 번호의 포트)를 차단하고 시스템이 나가는 연결에 더 높은 범위의 포트를 사용하도록 기대할 수 있습니다. 따라서 `net.inet.ip.portrange.first`의 값을 낮추지 않는 것이 좋습니다.

source: Virtual Memory
ko: 가상 메모리

source: A vnode is the internal representation of a file or directory. Increasing the number of vnodes available to the operating system reduces disk I/O. Normally, this is handled by the operating system and does not need to be changed. In some cases where disk I/O is a bottleneck and the system is running out of vnodes, this setting needs to be increased. The amount of inactive and free RAM will need to be taken into account.
ko: vnode는 파일 또는 디렉터리의 내부 표현입니다. 운영 체제에서 사용할 수 있는 vnode 수를 늘리면 디스크 I/O가 줄어듭니다. 일반적으로 이는 운영 체제에서 처리하므로 변경할 필요가 없습니다. 디스크 I/O가 병목 현상이 발생하여 시스템 vnode가 부족한 경우에는 이 설정을 늘려야 하는 경우도 있습니다. 비활성 및 사용 가능한 RAM의 양을 고려해야 합니다.

source: To see the current number of vnodes in use:
ko: 현재 사용 중인 vnode 수를 확인하려면:

source: To see the maximum vnodes:
ko: 최대 vnode 수를 확인하려면:

source: If the current vnode usage is near the maximum, try increasing `kern.maxvnodes` by a value of `1000`. Keep an eye on the number of `vfs.numvnodes`. If it climbs up to the maximum again, `kern.maxvnodes` will need to be increased further. Otherwise, a shift in memory usage as reported by man:top[1] should be visible and more memory should be active.
ko: 현재 vnode 사용량이 최대치에 가까우면 `kern.maxvnodes` 값을 `1000`만큼 늘려보십시오. `vfs.numvnodes`의 수를 주시합니다. 다시 최대치까지 올라간다면 `kern.maxvnodes`를 더 늘려야 합니다. 그렇지 않으면, man:top[1]에 보고된 메모리 사용량의 변화를 볼 수 있어야 하며 더 많은 메모리가 활성화되어야 합니다.

source: Adding Swap Space
ko: 스왑 공간 추가하기
ru: Добавление swap-пространства

source: Sometimes a system requires more swap space. This section describes two methods to increase swap space: adding swap to an existing partition or new hard drive, and creating a swap file on an existing partition.
ko: 시스템에 더 많은 스왑 공간이 필요한 경우가 있습니다. 이 섹션에서는 기존 파티션 또는 새 하드 드라이브에 스왑을 추가하는 방법과 기존 파티션에 스왑 파일을 만드는 두 가지 스왑 공간을 늘리는 방법에 대해 설명합니다.

source: For information on how to encrypt swap space, which options exist, and why it should be done, refer to crossref:disks[swap-encrypting,“Encrypting Swap”].
ko: 스왑 공간을 암호화하는 방법, 어떤 옵션이 있는지, 왜 암호화해야 하는지에 대한 자세한 내용은 crossref:disks[swap-encrypting,“Encrypting Swap”]를 참조하세요.
ru: Для получения информации о том, как зашифровать пространство подкачки, какие существуют варианты и почему это следует делать, обратитесь к crossref:disks[swap-encrypting,"Шифрование подкачки"].

source: Swap on a New Hard Drive or Existing Partition
ko: 새 하드 드라이브 또는 기존 파티션에서 스왑
ru: Раздел подкачки на новом жестком диске или существующем разделе

source: Adding a new hard drive for swap gives better performance than using a partition on an existing drive. Setting up partitions and hard drives is explained in crossref:disks[disks-adding,“Adding Disks”] while crossref:bsdinstall[configtuning-initial,“Designing the Partition Layout”] discusses partition layouts and swap partition size considerations.
ko: 스왑을 위해 새 하드 드라이브를 추가하면 기존 드라이브의 파티션을 사용하는 것보다 더 나은 성능을 제공합니다. 파티션 및 하드 드라이브 설정은 crossref:disks[disks-adding,“Adding Disks”] 에 설명되어 있으며, crossref:bsdinstall[configtuning-initial,“Designing the Partition Layout”]에서는 파티션 레이아웃과 스왑 파티션 크기 고려 사항에 대해 설명합니다.

source: Use `swapon` to add a swap partition to the system. For example:
ko: `swapon`을 사용하여 시스템에 스왑 파티션을 추가합니다. 예를 들어:

source: It is possible to use any partition not currently mounted, even if it already contains data. Using `swapon` on a partition that contains data will overwrite and destroy that data. Make sure that the partition to be added as swap is really the intended partition before running `swapon`.
ko: 현재 마운트되지 않은 파티션은 이미 데이터가 포함되어 있더라도 사용할 수 있습니다. 데이터가 있는 파티션에 `swapon`을 사용하면 해당 데이터를 덮어쓰고 파괴합니다. `swapon`을 실행하기 전에 스왑으로 추가할 파티션이 실제로 의도한 파티션인지 확인하세요.
ru: Можно использовать любой раздел, который в данный момент не смонтирован, даже если он уже содержит данные. Использование `swapon` на разделе с данными приведёт к их перезаписи и уничтожению. Перед выполнением `swapon` убедитесь, что выбранный раздел действительно предназначен для добавления в swap.

source: To automatically add this swap partition on boot, add an entry to [.filename]#/etc/fstab#:
ko: 부팅 시 이 스왑 파티션을 자동으로 추가하려면 [.filename]#/etc/fstab#에 내용을 추가하세요:
ru: Для автоматического добавления этого раздела подкачки при загрузке добавьте запись в [.filename]#/etc/fstab#:

source: See man:fstab[5] for an explanation of the entries in [.filename]#/etc/fstab#. More information about `swapon` can be found in man:swapon[8].
ko: [.filename]#/etc/fstab#의 항목에 대한 설명은 man:fstab[5]를 참조하세요. `swapon`에 대한 자세한 정보는 man:swapon[8]에서 확인할 수 있습니다.

source: Creating a Swap File
ko: 스왑 파일 생성하기
ru: Создание файла подкачки

source: These examples create a 512M swap file called [.filename]#/usr/swap0# instead of using a partition.
ko: 이 예제에서는 파티션을 사용하는 대신 [.filename]#/usr/swap0#이라는 512M 스왑 파일을 생성합니다.

source: Using swap files requires that the module needed by man:md[4] has either been built into the kernel or has been loaded before swap is enabled. See crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel] for information about building a custom kernel.
ko: 스왑 파일을 사용하려면 man:md[4]에 필요한 모듈이 커널에 빌드되었거나 스왑이 활성화되기 전에 로드되어 있어야 합니다. 커스텀 커널을 빌드하는 방법에 대한 정보는 crossref:kernelconfig[kernelconfig,Configuring the FreeBSD Kernel]를 참고하세요.

source: Create the swap file:
ko: 스왑 파일을 생성합니다:

source: Set the proper permissions on the new file:
ko: 새 파일에 적절한 권한을 설정합니다:
