Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: The ACPI driver has a flexible debugging facility. A set of subsystems and the level of verbosity can be specified. The subsystems to debug are specified as layers and are broken down into components (`ACPI_ALL_COMPONENTS`) and ACPI hardware support (`ACPI_ALL_DRIVERS`). The verbosity of debugging output is specified as the level and ranges from just report errors (`ACPI_LV_ERROR`) to everything (`ACPI_LV_VERBOSE`). The level is a bitmask so multiple options can be set at once, separated by spaces. In practice, a serial console should be used to log the output so it is not lost as the console message buffer flushes. A full list of the individual layers and levels is found in man:acpi[4].
ko: ACPI 드라이버에는 유연한 디버깅 기능이 있습니다. 하위 시스템 세트와 상세 수준을 지정할 수 있습니다. 디버깅할 서브시스템은 레이어로 지정되며 컴포넌트(`ACPI_ALL_COMPONENTS`)와 ACPI 하드웨어 지원(`ACPI_ALL_DRIVERS`)으로 구분됩니다. 디버깅 출력의 상세도는 레벨로 지정되며, 오류만 보고하는 것(`ACPI_LV_ERROR`)부터 모든 것을 보고하는 것(`ACPI_LV_VERBOSE`)까지 다양합니다. 레벨은 비트마스크이므로 공백으로 구분하여 여러 옵션을 한 번에 설정할 수 있습니다. 실제로는 직렬 콘솔을 사용하여 출력을 기록해야 콘솔 메시지 버퍼가 플러시될 때 손실되지 않습니다. 개별 레이어와 레벨의 전체 목록은 man:acpi[4]에서 확인할 수 있습니다.

source: Debugging output is not enabled by default. To enable it, add `options ACPI_DEBUG` to the custom kernel configuration file if ACPI is compiled into the kernel. Add `ACPI_DEBUG=1` to [.filename]#/etc/make.conf# to enable it globally. If a module is used instead of a custom kernel, recompile just the [.filename]#acpi.ko# module as follows:
ko: 디버깅 출력은 기본적으로 활성화되어 있지 않습니다. 활성화하려면 ACPI가 커널로 컴파일된 경우 커스텀 커널 구성 파일에 `options ACPI_DEBUG`를 추가합니다. 전역으로 활성화하려면 [.filename]#/etc/make.conf#에 `ACPI_DEBUG=1`을 추가합니다. 커스텀 커널 대신 모듈을 사용하는 경우 다음과 같이 [.filename]#acpi.ko# 모듈만 다시 컴파일하세요:

source: Copy the compiled [.filename]#acpi.ko# to [.filename]#/boot/kernel# and add the desired level and layer to [.filename]#/boot/loader.conf#. The entries in this example enable debug messages for all ACPI components and hardware drivers and output error messages at the least verbose level:
ko: 컴파일된 [.filename]#acpi.ko#를 [.filename]#/boot/kernel#에 복사하고 원하는 레벨과 레이어를 [.filename]#/boot/loader.conf#에 추가합니다. 이 예제의 항목은 모든 ACPI 구성 요소 및 하드웨어 드라이버에 대한 디버그 메시지를 활성화하고 최소 상세 수준에서 오류 메시지를 출력합니다:

source: If the required information is triggered by a specific event, such as a suspend and then resume, do not modify [.filename]#/boot/loader.conf#. Instead, use `sysctl` to specify the layer and level after booting and preparing the system for the specific event. The variables which can be set using `sysctl` are named the same as the tunables in [.filename]#/boot/loader.conf#.
ko: 일시 중단 후 재개와 같은 특정 이벤트에 의해 필요한 정보가 트리거되는 경우 [.filename]#/boot/loader.conf#를 수정하지 마세요. 대신, 부팅 후 특정 이벤트에 대비하여 시스템을 준비한 후 `sysctl`을 사용하여 레이어와 레벨을 지정하세요. `sysctl`을 사용하여 설정할 수 있는 변수의 이름은 [.filename]#/boot/loader.conf#의 튜너블과 동일합니다.

source: Once the debugging information is gathered, it can be sent to {freebsd-acpi} so that it can be used by the FreeBSD ACPI maintainers to identify the root cause of the problem and to develop a solution.
ko: 디버깅 정보가 수집되면 {freebsd-acpi}로 전송되어 FreeBSD ACPI 유지 관리자가 문제의 근본 원인을 파악하고 해결책을 개발하는 데 사용할 수 있습니다.

source: Before submitting debugging information to this mailing list, ensure the latest BIOS version is installed and, if available, the embedded controller firmware version.
ko: 이 메일링 리스트에 디버깅 정보를 제출하기 전에 최신 BIOS 버전이 설치되어 있는지, 가능한 경우 임베디드 컨트롤러 펌웨어 버전이 설치되어 있는지 확인합니다.

source: When submitting a problem report, include the following information:
ko: 문제 보고서를 제출할 때는 다음 정보를 포함하세요:

source: Description of the buggy behavior, including system type, model, and anything that causes the bug to appear. Note as accurately as possible when the bug began occurring if it is new.
ko: 시스템 유형, 모델, 버그를 발생시킨 원인 등 버그가 발생한 동작에 대한 설명입니다. 새로운 버그인 경우 버그가 언제 발생하기 시작했는지 가능한 한 정확하게 기록하세요.

source: The output of `dmesg` after running `boot -v`, including any error messages generated by the bug.
ko: `boot -v`를 실행한 후 `dmesg`의 출력(버그로 인해 생성된 오류 메시지 포함).

source: The `dmesg` output from `boot -v` with ACPI disabled, if disabling ACPI helps to fix the problem.
ko: ACPI를 비활성화하여 문제를 해결하는 데 도움이 되는 경우, ACPI를 비활성화한 상태에서 `boot -v`의 `dmesg` 출력을 확인합니다.

source: Output from `sysctl hw.acpi`. This lists which features the system offers.
ko: `sysctl hw.acpi`의 출력. 시스템이 제공하는 기능을 나열합니다.

source: The URL to a pasted version of the system's ASL. Do _not_ send the ASL directly to the list as it can be very large. Generate a copy of the ASL by running this command:
ko: 붙여넣은 버전의 시스템 ASL에 대한 URL. ASL은 매우 클 수 있으므로 목록에 직접 보내지 마세요. 이 명령을 실행하여 ASL의 복사본을 생성합니다:

source: Substitute the login name for _name_ and manufacturer/model for _system_. For example, use [.filename]#njl-FooCo6000.asl#.
ko: 로그인 이름을 _이름_으로, 제조사/모델을 _시스템_으로 대체합니다. 예를 들어 [.filename]#njl-FooCo6000.asl#을 사용합니다.

source: Most FreeBSD developers watch the {freebsd-current}, but one should submit problems to {freebsd-acpi} to be sure it is seen. Be patient when waiting for a response. If the bug is not immediately apparent, submit a bug report. When entering a PR, include the same information as requested above. This helps developers to track the problem and resolve it. Do not send a PR without emailing {freebsd-acpi} first as it is likely that the problem has been reported before.
ko: 대부분의 FreeBSD 개발자는 {freebsd-current}를 보지만, {freebsd-acpi}에 문제를 제출해야 볼 수 있습니다. 응답을 기다릴 때는 인내심을 가지세요. 버그가 즉시 드러나지 않는다면 버그 리포트를 제출하세요. PR을 입력할 때 위에서 요청한 것과 동일한 정보를 포함하세요. 이렇게 하면 개발자가 문제를 추적하고 해결하는 데 도움이 됩니다. 이전에 문제가 보고되었을 가능성이 높으므로 {freebsd-acpi}에 먼저 이메일을 보내지 않고 PR을 보내지 마세요.

source: References
ko: 참고 자료

source: More information about ACPI may be found in the following locations:
ko: ACPI에 대한 자세한 정보는 다음 위치에서 확인할 수 있습니다:

source: The FreeBSD ACPI Mailing List Archives (https://lists.freebsd.org/pipermail/freebsd-acpi/[https://lists.freebsd.org/pipermail/freebsd-acpi/])
ko: FreeBSD ACPI 메일링 리스트 아카이브(https://lists.freebsd.org/pipermail/freebsd-acpi/[https://lists.freebsd.org/pipermail/freebsd-acpi/])

source: The ACPI 2.0 Specification (http://acpi.info/spec.htm[http://acpi.info/spec.htm])
ko: ACPI 2.0 사양 (http://acpi.info/spec.htm[http://acpi.info/spec.htm])

source: man:acpi[4], man:acpi_thermal[4], man:acpidump[8], man:iasl[8], and man:acpidb[8]
ko: man:acpi[4], man:acpi_thermal[4], man:acpidump[8], man:iasl[8], man:acpidb[8]

source: This chapter explains much of the FreeBSD configuration files, how to enable or disable a service, how to configure the logging system and the power management area.
ru: Эта глава объясняет большинство файлов конфигурации FreeBSD, как включить или отключить службу, как настроить систему ведения журналов и область управления питанием.

source: Chapter 14. Configuration, Services, Logging and Power Management
ru: Глава 14. Конфигурация, сервисы, журналирование и управление питанием

source: Configuration, Services, Logging and Power Management
ru: Конфигурация, сервисы, журналирование и управление питанием

source: How to configure the power management in FreeBSD.
ru: Как настроить управление питанием в FreeBSD.

source: FreeBSD maintains a clear separation between the base system and third party applications and therefore this affects where the configuration files of these applications are located.
ru: FreeBSD поддерживает четкое разделение между базовой системой и сторонними приложениями, что влияет на расположение их конфигурационных файлов.

source: FreeBSD base system configuration is located at the [.filename]#/etc# directory, and the [.filename]#/usr/local/etc# directory contains all the configuration files of the applications installed on the system through the ports collection and packages.
ru: Конфигурация базовой системы FreeBSD находится в каталоге [.filename]#/etc#, а в каталоге [.filename]#/usr/local/etc# содержатся все конфигурационные файлы приложений, установленных в систему через коллекцию портов и пакеты.

source: The kernel state configuration is located in [.filename]#/etc/sysctl.conf#. In the section crossref:config[configtuning-sysctl, The sysctl utility], the operation of man:sysctl[8] will be explained in more detail.
ru: Конфигурация состояния ядра находится в файле [.filename]#/etc/sysctl.conf#. В разделе crossref:config[configtuning-sysctl, Утилита sysctl] работа man:sysctl[8] будет рассмотрена более подробно.

source: For more information about the FreeBSD file system structure refer to man:hier[7].
ru: Для получения дополнительной информации о структуре файловой системы FreeBSD обратитесь к man:hier[7].

source: As a general rule, configuration files do not use a standard on what syntax they must follow. Although it is true that the `#` character is normally used to comment a line and that each line has a configuration variable.
ru: Как правило, конфигурационные файлы не придерживаются единого стандарта в отношении синтаксиса. Хотя верно, что символ `#` обычно используется для комментирования строки и что каждая строка содержит переменную конфигурации.

source: Some applications like man:pkg[8] are starting to use the link:https://github.com/vstakhov/libucl[Universal Configuration Language (UCL)].
ru: Некоторые приложения, такие как man:pkg[8], начинают использовать link:https://github.com/vstakhov/libucl[Universal Configuration Language (UCL)].

source: The [.filename]#/etc# directory
ru: Каталог [.filename]#/etc#

source: The [.filename]#/etc# directory contains all of the FreeBSD base system configuration files that are responsible for configuring FreeBSD.
ru: Каталог [.filename]#/etc# содержит все файлы конфигурации базовой системы FreeBSD, которые отвечают за её настройку.

source: *Extreme* caution must be taken when modifying files in the [.filename]#/etc# directory; misconfiguration could make FreeBSD unbootable or malfunction.
ru: *Крайнюю* осторожность следует соблюдать при изменении файлов в каталоге [.filename]#/etc#; неправильная настройка может сделать FreeBSD незагружаемой или неработоспособной.

source: System configuration files and scripts.
ru: Системные конфигурационные файлы и скрипты.

source: Default system configuration files, see man:rc[8] for more information.
ru: Файлы конфигурации системы по умолчанию, подробности см. в man:rc[8].

source: man:fstab[5] contains descriptive information about the various file systems.
ru: man:fstab[5] содержит описательную информацию о различных файловых системах.

source: mtree configuration files, see man: mtree[8] for more information.
ru: Файлы конфигурации mtree, подробнее см. man:mtree[8].

source: Configuration files for the Pluggable Authentication Modules (PAM) library.
ru: Файлы конфигурации библиотеки Pluggable Authentication Modules (PAM).

source: Scripts that are run daily, weekly, and monthly, via man:cron[8], see man:periodic[8] for more information.
ru: Скрипты, выполняемые ежедневно, еженедельно и ежемесячно через man:cron[8]. Подробнее см. man:periodic[8].

source: System and daemon startup/control scripts, see man:rc[8] for more information.
ru: Системные и демон-скрипты запуска/управления, подробнее см. в man:rc[8].

source: Contains descriptive information about the local host name, configuration details for any potential network interfaces and which services should be started up at system initial boot time. More information in crossref:bsdinstall[configtuning-core-configuration, Managing System-Specific Configuration]
ru: Содержит описательную информацию о локальном имени хоста, настройках сетевых интерфейсов и службах, которые должны запускаться при начальной загрузке системы. Подробнее в разделе crossref:bsdinstall[configtuning-core-configuration, Управление системными настройками]

source: OpenBSM audit configuration files, see man:audit[8] for more information.
ru: Файлы конфигурации аудита OpenBSM, дополнительную информацию смотрите в man:audit[8].

source: ppp configuration files, see man:ppp[8] for more information.
ru: Файлы конфигурации ppp, подробности смотрите в man:ppp[8].

source: OpenSSH configuration files, see man:ssh[1] for more information.
ru: Файлы конфигурации OpenSSH, подробности см. в man:ssh[1].

source: OpenSSL configuration files.
ru: Конфигурационные файлы OpenSSL.

source: Contains settings for the kernel. More information in crossref:bsdinstall[configtuning-sysctl, The sysctl utility]
ru: Содержит настройки ядра. Дополнительная информация в crossref:bsdinstall[configtuning-sysctl, Утилита sysctl]

source: The sysctl utility
ru: Утилита sysctl

source: The man:sysctl[8] utility is used to make changes to a running FreeBSD system.
ru: Утилита man:sysctl[8] используется для внесения изменений в работающую систему FreeBSD.

source: The man:sysctl[8] utility retrieves kernel state and allows processes with appropriate privilege to set kernel state. The state to be retrieved or set is described using a "Management Information Base" ("MIB") style name, described as a dotted set of components.
ru: Утилита man:sysctl[8] позволяет получать состояние ядра и, при наличии соответствующих привилегий, изменять его. Состояние, которое требуется получить или установить, описывается с использованием имени в стиле "Базы управляющей информации" ("MIB"), представленного в виде набора компонентов, разделённых точками.

source: Management Information Base
ru: База управляющей информации

source: "Magic" numbers
ru: «Волшебные» числа

source: Kernel functions and features
ru: Ядро: функции и возможности

source: virtual memory
ru: Виртуальная память

source: Filesystem
ru: Файловая система

source: Network
ru: Сеть

source: Debugging parameters
ru: Параметры отладки

source: Hardware
ru: Оборудование

source: Machine dependent
ru: Зависимые от аппаратного обеспечения

source: Userland
ru: Пользовательское пространство

source: The output should be similar to the following:
ru: Вывод должен быть похож на следующий:

source: The Management Information Base (MIB) is hierarchical and hence, specifying a prefix prints all the nodes hanging from it:
ru: База управляющей информации (MIB) иерархична, поэтому указание префикса выводит все узлы, зависящие от него:

source: To keep the configuration after a reboot it is necessary to add these variables to the [.filename]#/etc/sysctl.conf# file as explained below.
ru: Чтобы сохранить настройки после перезагрузки, необходимо добавить эти переменные в файл [.filename]#/etc/sysctl.conf#, как описано ниже.

source: The [.filename]#/etc/sysctl.conf# file
ru: Файл [.filename]#/etc/sysctl.conf#

source: The configuration file for man:sysctl[8], [.filename]#/etc/sysctl.conf#, looks much like [.filename]#/etc/rc.conf#.
ru: Файл конфигурации для man:sysctl[8], [.filename]#/etc/sysctl.conf#, выглядит очень похоже на [.filename]#/etc/rc.conf#.

source: Values are set using a `variable=value` syntax.
ru: Значения задаются с использованием синтаксиса `переменная=значение`.

source: The specified values are set after the system goes into multi-user mode. Not all variables are settable in this mode.
ru: Указанные значения устанавливаются после перехода системы в многопользовательский режим. Не все переменные могут быть установлены в этом режиме.

source: To obtain more information about what function a particular sysctl has, the following command can be executed:
ru: Чтобы получить дополнительную информацию о функции конкретного sysctl, можно выполнить следующую команду:

source: The principal location for system configuration information is [.filename]#/etc/rc.conf#.
ru: Основное расположение информации о конфигурации системы — это [.filename]#/etc/rc.conf#.

source: This file contains a wide range of configuration information and it is read at system startup to configure the system. It provides the configuration information for the [.filename]#rc*# files.
ru: Этот файл содержит обширную информацию о конфигурации и читается при запуске системы для её настройки. Он предоставляет конфигурационную информацию для файлов [.filename]#rc*#.

source: The entries in [.filename]#/etc/rc.conf# override the default settings in [.filename]#/etc/defaults/rc.conf#.
ru: Записи в [.filename]#/etc/rc.conf# переопределяют настройки по умолчанию из [.filename]#/etc/defaults/rc.conf#.

source: The file [.filename]#/etc/defaults/rc.conf# containing the default settings should not be edited. Instead, all system-specific changes should be made to [.filename]#/etc/rc.conf#.
ru: Файл [.filename]#/etc/defaults/rc.conf#, содержащий настройки по умолчанию, не следует редактировать. Вместо этого все специфичные для системы изменения должны вноситься в [.filename]#/etc/rc.conf#.

source: A number of strategies may be applied in clustered applications to separate site-wide configuration from system-specific configuration in order to reduce administration overhead.
ru: В кластеризованных приложениях может быть применен ряд стратегий для разделения общесайтовой конфигурации и системно-специфичной конфигурации с целью снижения административной нагрузки.

source: The recommended approach is to place system-specific configuration into [.filename]#/etc/rc.conf.local#.
ru: Рекомендуемый подход заключается в размещении специфичной для системы конфигурации в [.filename]#/etc/rc.conf.local#.

source: For example, these entries in [.filename]#/etc/rc.conf# apply to all systems:
ru: Например, эти записи в [.filename]#/etc/rc.conf# применяются ко всем системам:

source: FreeBSD uses the man:rc[8] system of startup scripts during system initialization and for managing services.
ru: FreeBSD использует систему стартовых сценариев man:rc[8] для инициализации системы и управления службами.

source: The scripts listed in [.filename]#/etc/rc.d# provide basic services which can be controlled with the `start`, `stop`, and `restart` options to man:service[8].
ru: Скрипты, перечисленные в [.filename]#/etc/rc.d#, предоставляют базовые сервисы, которыми можно управлять с помощью опций `start`, `stop` и `restart` команды man:service[8].

source: A basic script may look similar to the following:
ru: Базовый скрипт может выглядеть следующим образом:

source: Refer to extref:{rc-scripting}[this article] for instructions on how to create custom man:rc[8] scripts.
ru: Обратитесь к extref:{rc-scripting}[этой статье] для получения инструкций по созданию пользовательских сценариев man:rc[8].

source: Many users install third party software on FreeBSD from the Ports Collection and require the installed services to be started upon system initialization.
ru: Многие пользователи устанавливают стороннее программное обеспечение на FreeBSD из Коллекции портов и требуют, чтобы установленные службы запускались при инициализации системы.

source: Services, such as package:security/openssh-portable[] or package:www/nginx[] are just two of the many software packages which may be started during system initialization. This section explains the procedures available for starting services.
ru: Службы, такие как package:security/openssh-portable[] или package:www/nginx[], являются лишь двумя из множества программных пакетов, которые могут запускаться при инициализации системы. В этом разделе описаны доступные процедуры для запуска служб.

source: Since the man:rc[8] system is primarily intended to start and stop services at system startup and shutdown time, the `start`, `stop` and `restart` options will only perform their action if the appropriate [.filename]#/etc/rc.conf# variable is set.
ru: Поскольку система man:rc[8] в первую очередь предназначена для запуска и остановки служб во время загрузки и выключения системы, опции `start`, `stop` и `restart` выполнят соответствующие действия только в том случае, если установлена соответствующая переменная в [.filename]#/etc/rc.conf#.

source: So the first step to start a service, like for example package:www/nginx[] is to add it to [.filename]#/etc/rc.conf# by executing the following command:
ru: Итак, первый шаг для запуска службы, например package:www/nginx[], — это добавить её в [.filename]#/etc/rc.conf#, выполнив следующую команду:

source: Then nginx can be started executing the following command:
ru: Затем nginx можно запустить, выполнив следующую команду:

source: To `start`, `stop` or `restart` a service regardless of the settings in [.filename]#/etc/rc.conf#, these commands should be prefixed with "one". For instance, to start package:www/nginx[] regardless of the current [.filename]#/etc/rc.conf# setting, execute the following command:
ru: Для запуска (`start`), остановки (`stop`) или перезапуска (`restart`) службы независимо от настроек в [.filename]#/etc/rc.conf#, перед этими командами следует добавить "one". Например, чтобы запустить package:www/nginx[] независимо от текущих настроек в [.filename]#/etc/rc.conf#, выполните следующую команду:

source: It is also possible to put a service automatically into a jail, see the corresponding crossref:jails[service-jails,Service Jails] explanation.
ru: Также возможно автоматическое размещение службы в jail, см. соответствующее пояснение в разделе crossref:jails[service-jails,Сервисные клетки].

source: Status of a Service
ru: Состояние службы

source: To determine if a service is running, use the `status` subcommand.
ru: Чтобы определить, запущена ли служба, используйте подкоманду `status`.

source: For example, to verify that package:www/nginx[] is running:
ru: Например, чтобы проверить, что package:www/nginx[] работает:

source: Reload a Service
ru: Перезагрузить службу

source: In some cases, it is also possible to `reload` a service. This attempts to send a signal to an individual service, forcing the service to reload its configuration files.
ru: В некоторых случаях также можно `перезагрузить` службу. Это попытка отправить сигнал отдельной службе, заставляя её перезагрузить свои конфигурационные файлы.

source: In most cases, this means sending the service a `SIGHUP` signal.
ru: В большинстве случаев это означает отправку службе сигнала `SIGHUP`.

source: *Not all services support this feature.*
ru: *Не все службы поддерживают эту возможность.*

source: Many system services depend on other services to function properly. For example, man:yp[8] and other RPC-based services may fail to start until after the man:rpcbind[8] service has started.
ru: Многие системные службы зависят от других служб для корректной работы. Например, man:yp[8] и другие службы на основе RPC могут не запуститься, пока не будет запущена служба man:rpcbind[8].

source: Additional information can be found in man:rc[8] and man:rc.subr[8].
ru: Дополнительную информацию можно найти в man:rc[8] и man:rc.subr[8].

source: Cron and Periodic
ru: Cron и Periodic

source: Scheduling tasks to run at a certain day or time is a very common task on FreeBSD. The tool in charge of performing this task is man:cron[8].
ru: Планирование задач на определенный день или время — очень распространенная задача в FreeBSD. Инструмент, отвечающий за выполнение этой задачи, — это man:cron[8].

source: In addition to tasks that can be scheduled by the user via man:cron[8], FreeBSD performs routine background tasks managed by man:periodic[8].
ru: В дополнение к задачам, которые пользователь может запланировать с помощью man:cron[8], FreeBSD выполняет фоновые задачи, управляемые man:periodic[8].

source: The man:cron[8] utility runs in the background and regularly checks [.filename]#/etc/crontab# for tasks to execute and searches [.filename]#/var/cron/tabs# for custom crontab files.
ru: Утилита man:cron[8] работает в фоновом режиме и периодически проверяет файл [.filename]#/etc/crontab# на наличие задач для выполнения, а также ищет пользовательские файлы crontab в каталоге [.filename]#/var/cron/tabs#.

source: These files are used to schedule tasks which cron runs at the specified times.
ru: Эти файлы используются для планирования задач, которые cron запускает в указанное время.

source: Each entry in a crontab defines a task to run and is known as a _cron job_.
ru: Каждая запись в crontab определяет задачу для выполнения и называется _cron job_.
