Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: An alternative to the man:acpi_video[4] module is the man:backlight[9] driver. It provides a generic way for handling a panel backlight. The default GENERIC kernel includes this driver. The man:backlight[8] utility can be used to query and adjust the brightness of the panel backlight. In this example the brightness is decreased by 10%:
ru: Альтернативой модулю man:acpi_video[4] является драйвер man:backlight[9]. Он предоставляет универсальный способ управления подсветкой экрана. Этот драйвер включён в стандартное ядро GENERIC. Утилита man:backlight[8] позволяет запрашивать и изменять яркость подсветки экрана. В этом примере яркость уменьшается на 10%:

source: CPU Power Management
ru: Управление питанием процессора

source: CPU is the most consuming part of the system. Knowing how to improve CPU efficiency is a fundamental part of our system in order to save energy.
ru: `CPU` — это наиболее энергозатратная часть системы. Знание того, как повысить эффективность использования `CPU`, является важной частью нашей системы для экономии энергии.

source: In order to make proper use of the machine's resources in a correct way, FreeBSD supports technologies such as Intel Turbo Boost, AMD Turbo Core, Intel Speed Shift among others through the use of man:powerd[8] and man:cpufreq[4].
ru: Для правильного и эффективного использования ресурсов системы FreeBSD поддерживает такие технологии, как Intel Turbo Boost, AMD Turbo Core, Intel Speed Shift и другие, с помощью man:powerd[8] и man:cpufreq[4].

source: The first step will be to obtain the CPU information by executing the following command:
ru: Первым шагом будет получение информации о процессоре с помощью выполнения следующей команды:

source: In this case the `0` digit represents the first core of the CPU.
ru: В этом случае цифра `0` обозначает первое ядро процессора.

source: Lowest Cx state to use for idling the CPU.
ru: Наименьшее состояние Cx, используемое для бездействия процессора.

source: CPU supported Cx states.
ru: Поддерживаемые процессором состояния Cx.

source: Currently available levels for the CPU (frequency/power usage).
ru: Доступные в настоящее время уровни для CPU (частота/потребление энергии).

source: Current active CPU frequency in MHz.
ru: Текущая активная частота CPU в МГц.

source: Current temperature of the CPU.
ru: Текущая температура процессора.

source: If the temperature information is not displayed, load the man:coretemp[4] module. In case of using an AMD CPU, load the man:amdtemp[4] module.
ru: Если информация о температуре не отображается, загрузите модуль man:coretemp[4]. В случае использования процессора AMD загрузите модуль man:amdtemp[4].

source: Once the CPU information is available the easiest way to configure power saving is to let man:powerd[8] take over.
ru: Как только информация о CPU станет доступной, самый простой способ настроить энергосбережение — позволить man:powerd[8] взять управление на себя.

source: Enable man:powerd[8] service in [.filename]#/etc/rc.conf# to start at system boot:
ru: Включите службу man:powerd[8] в [.filename]#/etc/rc.conf# для запуска при загрузке системы:

source: It will also be necessary to indicate certain parameters to man:powerd[8] to tell it how to manage the state of the CPU executing the following command:
ru: Также необходимо указать определённые параметры для man:powerd[8], чтобы сообщить ему, как управлять состоянием CPU, выполнив следующую команду:

source: `-a`: Selects the mode to use while on AC power.
ru: `-a`: Выбирает режим, используемый при работе от сети переменного тока.

source: `hiadaptive`: Operation mode. More info at man:powerd[8].
ru: `hiadaptive`: Режим работы. Подробнее см. в man:powerd[8].

source: `-i`: Specifies the CPU load percent level when adaptive mode should begin to degrade performance to save power.
ru: `-i`: Указывает уровень загрузки процессора в процентах, при котором адаптивный режим должен начать снижать производительность для экономии энергии.

source: `-r`: Specifies the CPU load percent level where adaptive mode should consider the CPU running and increase performance.
ru: `-r`: Указывает уровень загрузки процессора в процентах, при котором адаптивный режим считает, что процессор работает, и повышает производительность.

source: `-N`: Treat "nice" time as idle for the purpose of load calculation; i.e., do not increase the CPU frequency if the CPU is only busy with "nice" processes.
ru: `-N`: Рассматривать время выполнения "nice"-процессов как время простоя при расчете нагрузки; т.е. не увеличивать частоту CPU, если он занят только "nice"-процессами.

source: And then enable the service executing the following command:
ru: И затем включите службу, выполнив следующую команду:

source: CPU Frequency Control
ru: Управление частотой процессора

source: FreeBSD includes a generic man:cpufreq[4] driver to allow the administrator, or software such as man:powerd[8] and package:sysutils/powerdxx[], to manage the frequency of the CPU to achieve the desired balance between performance and economy. A lower setting will save power while reducing the heat generated by the CPU. A higher setting will increase performance at the cost of using additional power and generating more heat.
ru: FreeBSD включает универсальный драйвер man:cpufreq[4], который позволяет администратору или программам, таким как man:powerd[8] и package:sysutils/powerdxx[], управлять частотой CPU для достижения желаемого баланса между производительностью и энергопотреблением. Более низкая настройка сэкономит энергию, уменьшая нагрев CPU. Более высокая настройка увеличит производительность за счёт большего энергопотребления и усиленного нагрева.

source: The Intel(R) Enhanced Speed Step(TM) driver, man:est[4], replaces the generic man:cpufreq[4] driver for CPUs that provide this feature. The CPU frequency can be statically adjusted using man:sysctl[8], or with the `/etc/rc.d/power_profile` startup script. Additional software, such as man:powerd[8] or package:sysutils/powerdxx[], can be used to automatically adjust the CPU frequency based on processor utilization.
ru: Драйвер Intel(R) Enhanced Speed Step(TM), man:est[4], заменяет универсальный драйвер man:cpufreq[4] для процессоров, поддерживающих эту функцию. Частота процессора может быть статически настроена с помощью man:sysctl[8] или скрипта запуска `/etc/rc.d/power_profile`. Дополнительное программное обеспечение, такое как man:powerd[8] или package:sysutils/powerdxx[], может использоваться для автоматической регулировки частоты процессора на основе его загрузки.

source: Each supported frequency, along with its expected power consumption, can be listed by examining the man:sysctl[3] tree:
ru: Все поддерживаемые частоты, а также ожидаемое энергопотребление, можно узнать, изучив дерева man:sysctl[3]:

source: A frequency 1 MHz higher than the maximum frequency of the CPU indicates the Intel(R) Turbo Boost(TM) feature.
ru: Частота на 1 МГц выше максимальной частоты процессора указывает на наличие технологии Intel(R) Turbo Boost(TM).

source: Users running newer Intel(R) CPUs may find some differences in dynamic frequency control when upgrading to FreeBSD 13. A new driver for the Intel(R) Speed Shift(TM) feature set, available on certain SKUs, exposes the ability for the hardware to dynamically vary the core frequencies, including on a per core basis. FreeBSD 13 comes with the man:hwpstate_intel[4] driver to automatically enable Speed Shift(TM) control on equipped CPUs, replacing the older Enhanced Speed Step(TM) man:est[4] driver. The man:sysctl[8] `dev.cpufreq.%d.freq_driver` will indicate if the system is using Speed Shift.
ru: Пользователи, работающие на новых процессорах Intel(R), могут заметить некоторые различия в динамическом управлении частотой при обновлении до FreeBSD 13. Новый драйвер для технологии Intel(R) Speed Shift(TM), доступной в определённых моделях, предоставляет возможность аппаратного изменения частоты ядер, в том числе для каждого ядра отдельно. FreeBSD 13 включает драйвер man:hwpstate_intel[4] для автоматического включения управления Speed Shift(TM) на поддерживаемых процессорах, заменяя старый драйвер Enhanced Speed Step(TM) man:est[4]. Значение `dev.cpufreq.%d.freq_driver` в man:sysctl[8] покажет, использует ли система Speed Shift.

source: To determine which frequency control driver is being used, examining the `dev.cpufreq.0.freq_driver` oid.
ru: Чтобы определить, какой драйвер управления частотой используется, изучите OID `dev.cpufreq.0.freq_driver`.

source: This indicates that the new man:hwpstate_intel[4] driver is in use. On such systems, the oid `dev.cpu.%d.freq_levels` will show only the maximum CPU frequency, and will indicate a power consumption level of `-1`.
ru: Это указывает на использование нового драйвера man:hwpstate_intel[4]. В таких системах OID `dev.cpu.%d.freq_levels` будет показывать только максимальную частоту CPU и указывать уровень энергопотребления `-1`.

source: The current CPU frequency can be determined by examining the `dev.cpu.%d.freq` oid.
ru: Текущая частота процессора может быть определена путем проверки OID `dev.cpu.%d.freq`.

source: For more information, including on how to balance performance and energy use, and on how to disable this driver, refer to the man page man:hwpstate_intel[4].
ru: Для получения дополнительной информации, включая сведения о балансировке производительности и энергопотребления, а также о том, как отключить этот драйвер, обратитесь к справочной странице man:hwpstate_intel[4].

source: Users accustomed to using man:powerd[8] or package:sysutils/powerdxx[] will find these utilities have been superseded by the man:hwpstate_intel[4] driver and no longer work as expected.
ru: Пользователи, привыкшие к использованию man:powerd[8] или package:sysutils/powerdxx[], обнаружат, что эти утилиты были заменены драйвером man:hwpstate_intel[4] и больше не работают как ожидалось.

source: Graphics Card Power Management
ru: Управление энергопотреблением графической карты

source: Graphics cards have become a fundamental part of computing in recent years. Some graphics cards may have excessive power consumption. FreeBSD allows certain configurations to improve power consumption.
ru: Графические карты стали неотъемлемой частью современных компьютеров. Некоторые графические карты могут потреблять чрезмерное количество энергии. FreeBSD позволяет настраивать определённые параметры для снижения энергопотребления.

source: In case of using a Intel(R) graphics card with the package:graphics/drm-kmod[] driver these options can be added to [.filename]#/boot/loader.conf#:
ru: В случае использования видеокарты Intel(R) с драйвером package:graphics/drm-kmod[] следующие параметры можно добавить в [.filename]#/boot/loader.conf#:

source: Try to skip unnecessary mode sets at boot time.
ru: Попытайтесь пропустить ненужные установки режимов во время загрузки.

source: Enable power-saving display C-states.
ru: Включить энергосберегающие состояния C для дисплея.

source: Enable frame buffer compression for power savings
ru: Включить сжатие кадрового буфера для экономии энергии

source: The suspend/resume function allows the machine to be kept in a state in which there is no a big energy consumption and allows the system to be resumed without having to lose the state of the running programs.
ru: Функция приостановки/возобновления позволяет перевести машину в состояние с низким энергопотреблением и возобновить работу системы без потери состояния запущенных программ.

source: In order for the suspend/resume functionality to work correctly the graphics drivers must be loaded on the system. In non-KMS-supported graphics cards man:sc[4] must be used not to break the suspend/resume functionality.
ru: Для корректной работы функции приостановки/возобновления в системе должны быть загружены графические драйверы. В видеокартах без поддержки KMS следует использовать man:sc[4], чтобы не нарушить функциональность приостановки/возобновления.

source: More information about which driver to use and how to configure it can be found at the crossref:x11[x11, The X Window System chapter].
ru: Дополнительная информация о том, какой драйвер использовать и как его настроить, доступна в главе crossref:x11[x11, Система X Window].

source: man:acpi[4] supports the next list of sleep states:
ru: man:acpi[4] поддерживает следующий список состояний сна:

source: Supported Sleep States
ru: Поддерживаемые состояния сна

source: Quick suspend to RAM. The CPU enters a lower power state, but most peripherals are left running.
ru: Быстрый переход в режим ожидания с сохранением в оперативной памяти. ЦП переходит в состояние пониженного энергопотребления, но большинство периферийных устройств остаются активными.

source: Lower power state than S1, but with the same basic characteristics. Not supported by many systems.
ru: Состояние с меньшим энергопотреблением, чем S1, но с теми же основными характеристиками. Не поддерживается многими системами.

source: S3 (Sleep mode)
ru: S3 (Режим сна)

source: Suspend to RAM. Most devices are powered off, and the system stops running except for memory refresh.
ru: Режим приостановки с сохранением в ОЗУ. Большинство устройств отключается, и система перестает работать, за исключением обновления памяти.

source: S4 (Hibernation)
ru: S4 (Режим гибернации)

source: Suspend to disk. All devices are powered off, and the system stops running. When resuming, the system starts as if from a cold power on. *Not yet supported by FreeBSD*.
ru: Приостановка с сохранением состояния на диск. Все устройства отключаются, и система прекращает работу. При возобновлении система запускается, как после холодного включения. *Пока не поддерживается в FreeBSD*.

source: System shuts down cleanly and powers off.
ru: Система корректно завершает работу и выключается.

source: Configuring Suspend/Resume
ru: Настройка приостановки/возобновления

source: The first step will be to know which type of sleep states supports the hardware we are using executing the following command:
ru: Первым шагом будет определение типов состояний сна, которые поддерживает используемое оборудование, выполнив следующую команду:

source: As stated above FreeBSD does *not* yet support the `S4` state.
ru: Как упоминалось выше, FreeBSD *пока* не поддерживает состояние `S4`.

source: man:acpiconf[8] can be used to check if the `S3` state works correctly by running the following command, if it succeeds, the screen should go black and the machine will turn off:
ru: man:acpiconf[8] можно использовать для проверки корректности работы состояния `S3`, выполнив следующую команду. Если команда выполнится успешно, экран погаснет и компьютер выключится:

source: In the vast majority of cases the Suspend/Resume functionality wants to be used on a laptop.
ru: В подавляющем большинстве случаев функциональность Suspend/Resume предназначена для использования на ноутбуке.

source: FreeBSD can be configured to enter the `S3` state when closing the lid by adding the following line to the [.filename]#/etc/sysctl.conf# file.
ru: FreeBSD можно настроить для перехода в состояние `S3` при закрытии крышки, добавив следующую строку в файл [.filename]#/etc/sysctl.conf#.

source: Troubleshooting in Suspend/Resume
ru: Устранение неполадок при приостановке/возобновлении работы

source: A lot of effort has been made to make the Suspend and Resume functions work properly and in the best way on FreeBSD. But currently the Suspend and Resume functions only work properly on some specific laptops.
ru: Много усилий было приложено, чтобы функции приостановки (Suspend) и возобновления (Resume) работали корректно и наилучшим образом в FreeBSD. Однако в настоящее время эти функции работают правильно только на некоторых определенных моделях ноутбуков.

source: Some checks can be done in case it doesn't work properly.
ru: Некоторые проверки можно выполнить, если система работает некорректно.

source: In some cases it is enough to turn off the bluetooth. In others it is enough loading the correct driver for the graphics card, etc.
ru: В некоторых случаях достаточно выключить bluetooth. В других — загрузить правильный драйвер для видеокарты и т.д.

source: In case it doesn't work correctly, some tips can be found on the FreeBSD Wiki in the section link:https://wiki.freebsd.org/SuspendResume[Suspend/Resume].
ru: В случае, если это работает некорректно, некоторые рекомендации можно найти на FreeBSD Wiki в разделе link:https://wiki.freebsd.org/SuspendResume[Приостановка/возобновление].

source: Sometimes a FreeBSD system requires more swap space. This section describes two methods to increase swap space: adding swap to an existing partition or new hard drive, and creating a swap file on an existing file system.
ru: Иногда системе FreeBSD требуется больше места в подкачке. В этом разделе описаны два способа увеличения пространства подкачки: добавление раздела подкачки к существующему разделу или новому жесткому диску и создание файла подкачки в существующей файловой системе.

source: Adding a new drive for swap gives better performance than using a partition on an existing drive. Setting up partitions and drives is explained in crossref:disks[disks-adding,"Adding Disks"] while crossref:bsdinstall[configtuning-initial,"Designing the Partition Layout"] discusses partition layouts and swap partition size considerations.
ru: Добавление нового диска для раздела подкачки обеспечивает лучшую производительность по сравнению с использованием раздела на существующем диске. Настройка разделов и дисков описана в crossref:disks[disks-adding,"Добавление дисков"], а crossref:bsdinstall[configtuning-initial,"Проектирование разметки разделов"] рассматривает варианты разметки разделов и вопросы выбора размера раздела подкачки.

source: man:swapon[8] can be used to add a swap partition to the system executing the following command:
ru: man:swapon[8] может использоваться для добавления раздела подкачки в систему выполнением следующей команды:

source: See man:fstab[5] for an explanation of the entries in [.filename]#/etc/fstab#.
ru: См. man:fstab[5] для объяснения записей в [.filename]#/etc/fstab#.

source: These examples create a 512M swap file called [.filename]#/usr/swap0#.
ru: Эти примеры создают файл подкачки размером 512 МБ с именем [.filename]#/usr/swap0#.

source: Swap files on ZFS file systems are strongly discouraged, as swapping can lead to system hangs.
ru: Файлы подкачки на файловых системах ZFS крайне не рекомендуются, так как подкачка может привести к зависанию системы.

source: The first step is to create the swap file:
ru: Первым шагом является создание файла подкачки:

source: The second step is to put the proper permissions on the new file:
ru: Второй шаг — установить соответствующие разрешения для нового файла:

source: The third step is to inform the system about the swap file by adding a line to [.filename]#/etc/fstab#:
ru: Третий шаг — сообщить системе о файле подкачки, добавив строку в [.filename]#/etc/fstab#:
