Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: In this example, the log messages are being rejected due to a typo which results in a hostname mismatch. The client's hostname should be `logclient`, not `logclien`. Fix the typo, issue a restart, and verify the results:
ko: 이 예에서는 오타로 인해 호스트 이름 불일치가 발생하여 로그 메시지가 거부되고 있습니다. 클라이언트의 호스트 이름은 `logclient`가 아니라 `logclien`이어야 합니다. 오타를 수정하고 다시 시작한 후 결과를 확인합니다:
ru: В этом примере сообщения журнала отклоняются из-за опечатки, которая приводит к несоответствию имени хоста. Имя хоста клиента должно быть `logclient`, а не `logclien`. Исправьте опечатку, выполните перезапуск и проверьте результат:

source: At this point, the messages are being properly received and placed in the correct file.
ko: 이 시점에서는 메시지가 제대로 수신되어 올바른 파일에 저장되고 있는 것입니다.
ru: На данном этапе сообщения правильно принимаются и помещаются в нужный файл.

source: Security Considerations
ko: 보안 고려사항
ru: Безопасность

source: As with any network service, security requirements should be considered before implementing a logging server. Log files may contain sensitive data about services enabled on the local host, user accounts, and configuration data. Network data sent from the client to the server will not be encrypted or password protected. If a need for encryption exists, consider using package:security/stunnel[], which will transmit the logging data over an encrypted tunnel.
ko: 다른 네트워크 서비스와 마찬가지로 로깅 서버를 구현하기 전에 보안 요구 사항을 고려해야 합니다. 로그 파일에는 로컬 호스트에서 활성화된 서비스, 사용자 계정 및 구성 데이터에 대한 민감한 데이터가 포함될 수 있습니다. 클라이언트에서 서버로 전송되는 네트워크 데이터는 암호화되거나 비밀번호로 보호되지 않습니다. 암호화가 필요한 경우, 암호화된 터널을 통해 로깅 데이터를 전송하는 package:security/stunnel[] 사용을 고려하세요.
ru: Как и в случае с любой сетевой службой, перед внедрением сервера журналирования следует учитывать требования безопасности. Журналы могут содержать конфиденциальные данные о службах, включенных на локальном хосте, учетных записях пользователей и конфигурации. Данные, передаваемые по сети от клиента к серверу, не шифруются и не защищаются паролем. Если требуется шифрование, можно использовать package:security/stunnel[], который передает данные журналирования через зашифрованный туннель.

source: Local security is also an issue. Log files are not encrypted during use or after log rotation. Local users may access log files to gain additional insight into system configuration. Setting proper permissions on log files is critical. The built-in log rotator, newsyslog, supports setting permissions on newly created and rotated log files. Setting log files to mode `600` should prevent unwanted access by local users. Refer to man:newsyslog.conf[5] for additional information.
ko: 로컬 보안도 문제입니다. 로그 파일은 사용 중 또는 로그 로테이션 후에 암호화되지 않습니다. 로컬 사용자는 로그 파일에 액세스하여 시스템 구성에 대한 추가 인사이트를 얻을 수 있습니다. 로그 파일에 대한 적절한 권한을 설정하는 것이 중요합니다. 기본 제공 로그 로테이터인 newsyslog는 새로 생성 및 로테이션되는 로그 파일에 대한 권한 설정을 지원합니다. 로그 파일을 `600` 모드로 설정하면 로컬 사용자의 원치 않는 액세스를 방지할 수 있습니다. 자세한 내용은 man:newsyslog.conf[5]를 참조하세요.
ru: Локальная безопасность также является важным вопросом. Журналы не шифруются ни во время использования, ни после ротации. Локальные пользователи могут получить доступ к файлам журналов для сбора дополнительной информации о конфигурации системы. Установка правильных разрешений для файлов журналов крайне важна. Встроенный ротатор журналов newsyslog поддерживает установку разрешений для вновь создаваемых и ротируемых файлов журналов. Установка режима `600` для файлов журналов должна предотвратить нежелательный доступ со стороны локальных пользователей. Дополнительную информацию можно найти в man:newsyslog.conf[5].

source: Configuration Files
ko: 구성 파일
ru: Файлы конфигурации

source: [.filename]#/etc# Layout
ko: [.filename]#/etc# 레이아웃

source: There are a number of directories in which configuration information is kept. These include:
ko: 구성 정보가 저장되는 디렉터리에는 여러 가지가 있습니다. 여기에는 다음이 포함됩니다:

source: Generic system-specific configuration information.
ko: 일반적인 시스템별 구성 정보.

source: Default versions of system configuration files.
ko: 시스템 구성 파일의 기본 버전.

source: Extra man:sendmail[8] configuration and other MTA configuration files.
ko: 추가 man:sendmail[8] 구성 및 기타 MTA 구성 파일.
ru: Дополнительная конфигурация man:sendmail[8] и другие файлы конфигурации MTA.

source: Configuration for both user- and kernel-ppp programs.
ko: 사용자 및 커널-ppp 프로그램 모두에 대한 구성.

source: Configuration files for installed applications. May contain per-application subdirectories.
ko: 설치된 애플리케이션의 구성 파일. 애플리케이션별 하위 디렉터리를 포함할 수 있습니다.

source: man:rc[8] scripts for installed applications.
ko: 설치된 애플리케이션에 대한 man:rc[8] 스크립트.

source: Automatically generated system-specific database files, such as the package database and the man:locate[1] database.
ko: 패키지 데이터베이스 및 man:locate[1] 데이터베이스와 같은 시스템별 데이터베이스 파일을 자동으로 생성합니다.

source: How a FreeBSD system accesses the Internet Domain Name System (DNS) is controlled by man:resolv.conf[5].
ko: FreeBSD 시스템이 인터넷 도메인 네임 시스템(DNS)에 액세스하는 방법은 man:resolv.conf[5]에 의해 제어됩니다.

source: The most common entries to [.filename]#/etc/resolv.conf# are:
ko: [.filename]#/etc/resolv.conf#의 가장 일반적인 항목은 다음과 같습니다:

source: The IP address of a name server the resolver should query. The servers are queried in the order listed with a maximum of three.
ko: 확인자가 쿼리해야 하는 네임 서버의 IP 주소입니다. 서버는 나열된 순서대로 쿼리되며 최대 3개까지 쿼리할 수 있습니다.

source: Search list for hostname lookup. This is normally determined by the domain of the local hostname.
ko: 호스트명 조회를 위한 검색 목록입니다. 이는 일반적으로 로컬 호스트명의 도메인에 따라 결정됩니다.

source: The local domain name.
ko: 로컬 도메인 네임.

source: A typical [.filename]#/etc/resolv.conf# looks like this:
ko: 일반적인 [.filename]#/etc/resolv.conf#는 다음과 같습니다:

source: Only one of the `search` and `domain` options should be used.
ko: `search` 및 `domain` 옵션 중 하나만 사용해야 합니다.

source: When using DHCP, man:dhclient[8] usually rewrites [.filename]#/etc/resolv.conf# with information received from the DHCP server.
ko: DHCP를 사용할 때 man:dhclient[8]는 일반적으로 DHCP 서버에서 받은 정보로 [.filename]#/etc/resolv.conf#를 다시 작성합니다.

source: [.filename]#/etc/hosts# is a simple text database which works in conjunction with DNS and NIS to provide host name to IP address mappings. Entries for local computers connected via a LAN can be added to this file for simplistic naming purposes instead of setting up a man:named[8] server. Additionally, [.filename]#/etc/hosts# can be used to provide a local record of Internet names, reducing the need to query external DNS servers for commonly accessed names.
ko: [.filename]#/etc/hosts#는 DNS 및 NIS와 함께 작동하여 호스트 이름과 IP 주소 매핑을 제공하는 간단한 텍스트 데이터베이스입니다. LAN을 통해 연결된 로컬 컴퓨터에 대한 항목은 man:named[8] 서버를 설정하는 대신 간단한 명명 목적으로 이 파일에 추가할 수 있습니다. 또한 [.filename]#/etc/hosts#을 사용하여 인터넷 이름의 로컬 레코드를 제공할 수 있으므로 일반적으로 액세스하는 이름을 외부 DNS 서버에 쿼리할 필요성을 줄일 수 있습니다.

source: The format of [.filename]#/etc/hosts# is as follows:
ko: [.filename]#/etc/hosts#의 형식은 다음과 같습니다:

source: For example:
ko: 예를 들어:

source: Consult man:hosts[5] for more information.
ko: 자세한 내용은 man:hosts[5]를 참조하세요.

source: Tuning with man:sysctl[8]
ko: man:sysctl[8]로 튜닝하기

source: man:sysctl[8] is used to make changes to a running FreeBSD system. This includes many advanced options of the TCP/IP stack and virtual memory system that can dramatically improve performance for an experienced system administrator. Over five hundred system variables can be read and set using man:sysctl[8].
ko: man:sysctl[8]은 실행 중인 FreeBSD 시스템을 변경하는 데 사용됩니다. 여기에는 숙련된 시스템 관리자의 성능을 크게 향상시킬 수 있는 TCP/IP 스택과 가상 메모리 시스템의 많은 고급 옵션이 포함됩니다. 500개 이상의 시스템 변수를 man:sysctl[8]을 사용하여 읽고 설정할 수 있습니다.

source: At its core, man:sysctl[8] serves two functions: to read and to modify system settings.
ko: man:sysctl[8]은 기본적으로 시스템 설정을 읽고 수정하는 두 가지 기능을 수행합니다.
ru: В основе своей man:sysctl[8] выполняет две функции: чтение и изменение системных настроек.

source: To view all readable variables:
ko: 읽기 가능한 모든 변수를 보려면:
ru: Для просмотра всех доступных для чтения переменных:

source: To read a particular variable, specify its name:
ko: 특정 변수를 읽으려면 해당 이름을 지정합니다:
ru: Чтобы прочитать конкретную переменную, укажите её имя:

source: To set a particular variable, use the _variable_=_value_ syntax:
ko: 특정 변수를 설정하려면 _variable_=_value_ 구문을 사용합니다:
ru: Чтобы установить конкретную переменную, используйте синтаксис _переменная_=_значение_:

source: Settings of sysctl variables are usually either strings, numbers, or booleans, where a boolean is `1` for yes or `0` for no.
ko: sysctl 변수의 설정은 일반적으로 문자열, 숫자 또는 부울이며, 여기서 부울은 '예'인 경우 `1`, '아니오'인 경우 `0`입니다.

source: To automatically set some variables each time the machine boots, add them to [.filename]#/etc/sysctl.conf#. For more information, refer to man:sysctl.conf[5] and <<configtuning-sysctlconf>>.
ko: 머신이 부팅될 때마다 일부 변수를 자동으로 설정하려면 [.filename]#/etc/sysctl.conf#에 추가합니다. 자세한 내용은 man:sysctl.conf[5] 및 <<configtuning-sysctlconf>>을 참조하세요.

source: The configuration file for man:sysctl[8], [.filename]#/etc/sysctl.conf#, looks much like [.filename]#/etc/rc.conf#. Values are set in a `variable=value` form. The specified values are set after the system goes into multi-user mode. Not all variables are settable in this mode.
ko: man:sysctl[8]의 구성 파일인 [.filename]#/etc/sysctl.conf#는 [.filename]#/etc/rc.conf#와 매우 유사합니다. 값은 `variable=value` 형식으로 설정됩니다. 지정된 값은 시스템이 다중 사용자 모드로 전환된 후에 설정됩니다. 이 모드에서 모든 변수를 설정할 수 있는 것은 아닙니다.

source: For example, to turn off logging of fatal signal exits and prevent users from seeing processes started by other users, the following tunables can be set in [.filename]#/etc/sysctl.conf#:
ko: 예를 들어 치명적인 신호 종료 로깅을 끄고 다른 사용자가 시작한 프로세스가 사용자에게 표시되지 않도록 하려면 [.filename]#/etc/sysctl.conf#에서 다음 튜너블을 설정하면 됩니다:
ru: Например, чтобы отключить запись завершений по фатальным сигналам и запретить пользователям видеть процессы, запущенные другими пользователями, в файле [.filename]#/etc/sysctl.conf# можно установить следующие параметры:

source: man:sysctl[8] Read-only
ko: man:sysctl[8] 읽기 전용

source: In some cases it may be desirable to modify read-only man:sysctl[8] values, which will require a reboot of the system.
ko: 경우에 따라 시스템을 재부팅해야 하는 읽기 전용 man:sysctl[8] 값을 수정하는 것이 바람직할 수 있습니다.

source: For instance, on some laptop models the man:cardbus[4] device will not probe memory ranges and will fail with errors similar to:
ko: 예를 들어, 일부 노트북 모델에서 man:cardbus[4] 장치는 메모리 범위를 조사하지 않으며 다음과 유사한 오류로 실패합니다:

source: The fix requires the modification of a read-only man:sysctl[8] setting. Add `hw.pci.allow_unsupported_io_range=1` to [.filename]#/boot/loader.conf# and reboot. Now man:cardbus[4] should work properly.
ko: 이 문제를 해결하려면 읽기 전용 man:sysctl[8] 설정을 수정해야 합니다. [.filename]#/boot/loader.conf#에 `hw.pci.allow_unsupported_io_range=1`을 추가하고 재부팅합니다. 이제 man:cardbus[4]가 제대로 작동합니다.

source: Tuning Disks
ko: 디스크 튜닝

source: The following section will discuss various tuning mechanisms and options which may be applied to disk devices. In many cases, disks with mechanical parts, such as SCSI drives, will be the bottleneck driving down the overall system performance. While a solution is to install a drive without mechanical parts, such as a solid state drive, mechanical drives are not going away anytime in the near future. When tuning disks, it is advisable to utilize the features of the man:iostat[8] command to test various changes to the system. This command will allow the user to obtain valuable information on system IO.
ko: 다음 섹션에서는 디스크 장치에 적용할 수 있는 다양한 튜닝 메커니즘과 옵션에 대해 설명합니다. 대부분의 경우 SCSI 드라이브와 같은 기계적 부품이 포함된 디스크는 전체 시스템 성능을 저하시키는 병목 현상을 유발합니다. 솔리드 스테이트 드라이브와 같이 기계적 부품이 없는 드라이브를 설치하는 것이 해결책이 될 수 있지만, 기계식 드라이브는 가까운 장래에 사라지지 않을 것입니다. 디스크를 튜닝할 때는 man:iostat[8] 명령의 기능을 활용하여 시스템에 대한 다양한 변경 사항을 테스트하는 것이 좋습니다. 이 명령을 통해 사용자는 시스템 I/O에 대한 유용한 정보를 얻을 수 있습니다.

source: Sysctl Variables
ko: Sysctl 변수

source: The `vfs.vmiodirenable` man:sysctl[8] variable may be set to either `0` (off) or `1` (on). It is set to `1` by default. This variable controls how directories are cached by the system. Most directories are small, using just a single fragment (typically 1 K) in the file system and typically 512 bytes in the buffer cache. With this variable turned off, the buffer cache will only cache a fixed number of directories, even if the system has a huge amount of memory. When turned on, this man:sysctl[8] allows the buffer cache to use the VM page cache to cache the directories, making all the memory available for caching directories. However, the minimum in-core memory used to cache a directory is the physical page size (typically 4 K) rather than 512 bytes. Keeping this option enabled is recommended if the system is running any services which manipulate large numbers of files. Such services can include web caches, large mail systems, and news systems. Keeping this option on will generally not reduce performance, even with the wasted memory, but one should experiment to find out.
ko: `vfs.vmiodirenable` man:sysctl[8] 변수는 `0`(꺼짐) 또는 `1`(켜짐)로 설정할 수 있습니다. 기본적으로 `1`로 설정되어 있습니다. 이 변수는 시스템에서 디렉터리를 캐시하는 방법을 제어합니다. 대부분의 디렉터리는 파일 시스템에서 단일 조각(일반적으로 1K)만 사용하고 버퍼 캐시에서 일반적으로 512바이트를 사용하는 작은 크기입니다. 이 변수를 끄면 시스템에 엄청난 양의 메모리가 있더라도 버퍼 캐시는 정해진 수의 디렉터리만 캐시합니다. 이 man:sysctl[8]을 켜면 버퍼 캐시가 VM 페이지 캐시를 사용하여 디렉터리를 캐시할 수 있으므로 디렉터리를 캐시하는 데 모든 메모리를 사용할 수 있습니다. 그러나 디렉토리를 캐시하는 데 사용되는 최소 인코어 메모리는 512바이트가 아닌 물리적 페이지 크기(일반적으로 4K)입니다. 시스템에서 많은 수의 파일을 조작하는 서비스를 실행하는 경우 이 옵션을 활성화하는 것이 좋습니다. 이러한 서비스에는 웹 캐시, 대용량 메일 시스템 및 뉴스 시스템이 포함될 수 있습니다. 이 옵션을 켜두면 일반적으로 메모리가 낭비되더라도 성능이 저하되지 않지만 실험을 통해 확인해야 합니다.

source: The `vfs.write_behind` man:sysctl[8] variable defaults to `1` (on). This tells the file system to issue media writes as full clusters are collected, which typically occurs when writing large sequential files. This avoids saturating the buffer cache with dirty buffers when it would not benefit I/O performance. However, this may stall processes and under certain circumstances should be turned off.
ko: `vfs.write_behind` man:sysctl[8] 변수의 기본값은 `1`(켜짐)입니다. 이는 일반적으로 대용량 순차 파일을 쓸 때 발생하는 전체 클러스터가 수집될 때 미디어 쓰기를 실행하도록 파일 시스템에 지시합니다. 이렇게 하면 I/O 성능에 도움이 되지 않을 때 더티 버퍼로 버퍼 캐시가 포화되는 것을 방지할 수 있습니다. 하지만 프로세스가 중단될 수 있으므로 특정 상황에서는 이 기능을 해제해야 합니다.

source: The `vfs.hirunningspace` man:sysctl[8] variable determines how much outstanding write I/O may be queued to disk controllers system-wide at any given instance. The default is usually sufficient, but on machines with many disks, try bumping it up to four or five _megabytes_. Setting too high a value which exceeds the buffer cache's write threshold can lead to bad clustering performance. Do not set this value arbitrarily high as higher write values may add latency to reads occurring at the same time.
ko: `vfs.hirunningspace` man:sysctl[8] 변수는 특정 인스턴스에서 시스템 전체의 디스크 컨트롤러 큐에 대기할 수 있는 미결 쓰기 I/O의 양을 결정합니다. 기본값은 일반적으로 충분하지만 디스크가 많은 시스템에서는 4~5메가바이트까지 늘려보세요. 버퍼 캐시의 쓰기 임계값을 초과하는 값을 너무 높게 설정하면 클러스터링 성능이 저하될 수 있습니다. 쓰기 값이 높으면 동시에 발생하는 읽기에 지연 시간이 추가될 수 있으므로 이 값을 임의로 높게 설정하지 마세요.

source: There are various other buffer cache and VM page cache related man:sysctl[8] values. Modifying these values is not recommended as the VM system does a good job of automatically tuning itself.
ko: 그 외에도 버퍼 캐시 및 VM 페이지 캐시와 관련된 다양한 man:sysctl[8] 값이 있습니다. 이러한 값은 VM 시스템에서 자동으로 잘 조정되므로 수정하지 않는 것이 좋습니다.

source: The `vm.swap_idle_enabled` man:sysctl[8] variable is useful in large multi-user systems with many active login users and lots of idle processes. Such systems tend to generate continuous pressure on free memory reserves. Turning this feature on and tweaking the swapout hysteresis (in idle seconds) via `vm.swap_idle_threshold1` and `vm.swap_idle_threshold2` depresses the priority of memory pages associated with idle processes more quickly then the normal pageout algorithm. This gives a helping hand to the pageout daemon. Only turn this option on if needed, because the tradeoff is essentially pre-page memory sooner rather than later which eats more swap and disk bandwidth. In a small system this option will have a determinable effect, but in a large system that is already doing moderate paging, this option allows the VM system to stage whole processes into and out of memory easily.
ko: man:sysctl[8] 변수는 활성 로그인 사용자가 많고 유휴 프로세스가 많은 대규모 다중 사용자 시스템에서 유용합니다. 이러한 시스템은 사용 가능한 메모리에 지속적인 압박을 가하는 경향이 있습니다. 이 기능을 켜고 `vm.swap_idle_threshold1` 및 `vm.swap_idle_threshold2`를 통해 스왑아웃 히스테리시스(유휴 초 단위)를 조정하면 일반 페이지아웃 알고리즘보다 유휴 프로세스와 관련된 메모리 페이지의 우선 순위가 더 빨리 낮아집니다. 이는 페이지아웃 데몬에 도움을 줍니다. 이 옵션은 기본적으로 메모리를 더 빨리 사전 페이지화하여 더 많은 스왑 및 디스크 대역폭을 사용한다는 단점이 있으므로 필요한 경우에만 이 옵션을 켜세요. 소규모 시스템에서는 이 옵션이 결정적인 영향을 미치지만, 이미 중간 정도의 페이징을 수행하는 대규모 시스템에서는 이 옵션을 사용하면 VM 시스템이 전체 프로세스를 메모리 안팎으로 쉽게 스테이징할 수 있습니다.

source: Turning off IDE write caching reduces write bandwidth to IDE disks, but may sometimes be necessary due to data consistency issues introduced by hard drive vendors. The problem is that some IDE drives lie about when a write completes. With IDE write caching turned on, IDE hard drives write data to disk out of order and will sometimes delay writing some blocks indefinitely when under heavy disk load. A crash or power failure may cause serious file system corruption. Check the default on the system by observing the `hw.ata.wc` man:sysctl[8] variable. If IDE write caching is turned off, one can set this read-only variable to `1` in [.filename]#/boot/loader.conf# in order to enable it at boot time.
ko: IDE 쓰기 캐싱을 끄면 IDE 디스크에 대한 쓰기 대역폭이 줄어들지만, 하드 드라이브 공급업체에서 도입한 데이터 일관성 문제를 해결하기위해 필요할 수도 있습니다. 문제는 일부 IDE 드라이브가 쓰기 완료 시점에 대해 거짓말을 한다는 것입니다. IDE 쓰기 캐싱이 켜져 있으면 IDE 하드 드라이브는 디스크에 데이터를 순서대로 쓰지 않고 디스크 부하가 많을 때 일부 블록 쓰기를 무기한 지연시킬 수 있습니다. 충돌 또는 정전으로 인해 심각한 파일 시스템 손상이 발생할 수 있습니다. `hw.ata.wc` man:sysctl[8] 변수를 관찰하여 시스템의 기본값을 확인하십시오. IDE 쓰기 캐싱이 꺼져 있는 경우, 부팅 시 활성화하려면 [.filename]#/boot/loader.conf#에서 이 읽기 전용 변수를 `1`로 설정합니다.

source: For more information, refer to man:ata[4].
ko: 자세한 내용은 man:ata[4]를 참조하세요.

source: The `SCSI_DELAY` kernel configuration option may be used to reduce system boot times. The defaults are fairly high and can be responsible for `15` seconds of delay in the boot process. Reducing it to `5` seconds usually works with modern drives. The `kern.cam.scsi_delay` boot time tunable should be used. The tunable and kernel configuration option accept values in terms of _milliseconds_ and _not seconds_.
ko: 시스템 부팅 시간을 줄이기 위해 `SCSI_DELAY` 커널 구성 옵션을 사용할 수 있습니다. 기본값은 상당히 높으며 부팅 프로세스에서 `15`초의 지연을 초래할 수 있습니다. 이를 `5`초로 줄여도 일반적인 최신 드라이브에서 잘 작동합니다. 부팅 시간 튜너블인 `kern.cam.scsi_delay`를 사용해야 합니다. 튜너블 및 커널 구성 옵션은 _초 단위_가 아닌, _밀리초(ms)_ 단위를 사용합니다.

source: Soft Updates
ko: 소프트 업데이트 (Soft Updates)

source: To fine-tune a file system, use man:tunefs[8]. This program has many different options. To toggle Soft Updates on and off, use:
ko: 파일 시스템을 미세 조정하려면 man:tunefs[8]를 사용하세요. 이 프로그램에는 다양한 옵션이 있습니다. 소프트 업데이트를 켜고 끄려면 다음을 사용합니다:

source: A file system cannot be modified with man:tunefs[8] while it is mounted. A good time to enable Soft Updates is before any partitions have been mounted, in single-user mode.
ko: 파일 시스템이 마운트되어 있는 동안에는 man:tunefs[8]로 파일 시스템을 수정할 수 없습니다. 단일 사용자 모드에서 파티션을 마운트하기 전에 소프트 업데이트를 활성화하는 것이 좋습니다.

source: Soft Updates is recommended for UFS file systems as it drastically improves meta-data performance, mainly file creation and deletion, through the use of a memory cache. There are two downsides to Soft Updates to be aware of. First, Soft Updates guarantee file system consistency in the case of a crash, but could easily be several seconds or even a minute behind updating the physical disk. If the system crashes, unwritten data may be lost. Secondly, Soft Updates delay the freeing of file system blocks. If the root file system is almost full, performing a major update, such as `make installworld`, can cause the file system to run out of space and the update to fail.
ko: 소프트 업데이트는 메모리 캐시를 사용하여 주로 파일 생성 및 삭제와 같은 메타데이터 성능을 크게 향상시키므로 UFS 파일 시스템에서 권장됩니다. 소프트 업데이트에는 두 가지 단점이 있습니다. 첫째, 소프트 업데이트는 충돌이 발생할 경우 파일 시스템 일관성을 보장하지만, 실제 디스크 업데이트보다 몇 초 또는 몇 분 정도 늦어질 수 있습니다. 시스템이 충돌하면 기록되지 않은 데이터가 손실될 수 있습니다. 둘째, 소프트 업데이트는 파일 시스템 블록의 해제 시간을 지연시킵니다. 루트 파일 시스템이 거의 꽉 차 있는 경우 `make installworld`와 같은 큰 규모의 업데이트를 수행하면 파일 시스템의 공간이 부족하여 업데이트가 실패할 수 있습니다.

source: More Details About Soft Updates
ko: 소프트 업데이트에 대한 보다 자세한 정보

source: Meta-data updates are updates to non-content data like inodes or directories. There are two traditional approaches to writing a file system's meta-data back to disk.
ko: 메타데이터 업데이트는 이노드나 디렉터리와 같은 콘텐츠가 아닌 데이터에 대한 업데이트입니다. 파일 시스템의 메타데이터를 디스크에 다시 쓰는 전통적인 접근 방식에는 두 가지가 있습니다.

source: Historically, the default behavior was to write out meta-data updates synchronously. If a directory changed, the system waited until the change was actually written to disk. The file data buffers (file contents) were passed through the buffer cache and backed up to disk later on asynchronously. The advantage of this implementation is that it operates safely. If there is a failure during an update, meta-data is always in a consistent state. A file is either created completely or not at all. If the data blocks of a file did not find their way out of the buffer cache onto the disk by the time of the crash, man:fsck[8] recognizes this and repairs the file system by setting the file length to `0`. Additionally, the implementation is clear and simple. The disadvantage is that meta-data changes are slow. For example, `rm -r` touches all the files in a directory sequentially, but each directory change will be written synchronously to the disk. This includes updates to the directory itself, to the inode table, and possibly to indirect blocks allocated by the file. Similar considerations apply for unrolling large hierarchies using `tar -x`.
ko: 역사적으로 메타데이터 업데이트를 동기식으로 기록하는 것이 기본 동작이었습니다. 디렉터리가 변경되면 시스템은 변경 내용이 실제로 디스크에 기록될 때까지 기다렸습니다. 파일 데이터 버퍼(파일 내용)는 버퍼 캐시를 통과하여 나중에 비동기적으로 디스크에 백업되었습니다. 이 구현의 장점은 안전하게 작동한다는 것입니다. 업데이트 중에 장애가 발생하더라도 메타데이터는 항상 일관된 상태를 유지합니다. 파일은 완전히 생성되거나 전혀 생성되지 않습니다. 파일의 데이터 블록이 크래시 시점까지 버퍼 캐시에서 디스크로 이동하지 못한 경우, man:fsck[8]는 이를 인식하고 파일 길이를 `0`으로 설정하여 파일 시스템을 복구합니다. 또한 구현이 명확하고 간단합니다. 단점은 메타 데이터 변경이 느리다는 것입니다. 예를 들어 `rm -r`은 디렉터리의 모든 파일을 순차적으로 변경하지만 각 디렉터리 변경 사항은 디스크에 동기적으로 기록됩니다. 여기에는 디렉터리 자체, inode 테이블, 파일이 할당하는 간접 블록에 대한 업데이트가 포함됩니다. `tar -x'를 사용하여 복잡한 계층 구조의 압축을 풀 때도 비슷한 고려 사항이 적용됩니다.
