Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/config/_index.po
Languages: ko, ru

source: Inform the system about the swap file by adding a line to [.filename]#/etc/fstab#:
ko: [.filename]#/etc/fstab#에 한 줄을 추가하여 스왑 파일에 대해 시스템에 알립니다:

source: Swap space will be added on system startup. To add swap space immediately, use man:swapon[8]:
ko: 스왑 공간은 시스템 시작 시 추가됩니다. 스왑 공간을 즉시 추가하려면 man:swapon[8]을 사용합니다:
ru: Раздел подкачки будет добавлен при запуске системы. Чтобы добавить раздел подкачки немедленно, используйте man:swapon[8]:

source: Power and Resource Management
ko: 전원 및 리소스 관리
ru: Управление питанием и ресурсами

source: It is important to utilize hardware resources in an efficient manner. Power and resource management allows the operating system to monitor system limits and to possibly provide an alert if the system temperature increases unexpectedly. An early specification for providing power management was the Advanced Power Management (APM) facility. APM controls the power usage of a system based on its activity. However, it was difficult and inflexible for operating systems to manage the power usage and thermal properties of a system. The hardware was managed by the BIOS and the user had limited configurability and visibility into the power management settings. The APMBIOS is supplied by the vendor and is specific to the hardware platform. An APM driver in the operating system mediates access to the APM Software Interface, which allows management of power levels.
ko: 하드웨어 리소스를 효율적으로 활용하는 것이 중요합니다. 전력 및 리소스 관리를 통해 운영 체제는 시스템 한계를 모니터링하고 시스템 온도가 예기치 않게 상승할 경우 경고를 제공할 수 있습니다. 전력 관리를 제공하기 위한 초기 사양은 고급 전원 관리(APM) 기능이었습니다. APM은 시스템 활동을 기반으로 시스템의 전력 사용량을 제어합니다. 그러나 운영 체제가 시스템의 전력 사용량과 열 속성을 관리하는 것은 어렵고 유연하지 않았습니다. 하드웨어는 BIOS에 의해 관리되었고 사용자는 전원 관리 설정에 대한 구성 가능성과 가시성이 제한적이었습니다. APMBIOS는 공급업체에서 제공하며 하드웨어 플랫폼에 따라 다릅니다. 운영 체제의 APM 드라이버는 전력 수준을 관리할 수 있는 APM 소프트웨어 인터페이스에 대한 액세스를 중개합니다.

source: There are four major problems in APM. First, power management is done by the vendor-specific BIOS, separate from the operating system. For example, the user can set idle-time values for a hard drive in the APMBIOS so that, when exceeded, the BIOS spins down the hard drive without the consent of the operating system. Second, the APM logic is embedded in the BIOS, and it operates outside the scope of the operating system. This means that users can only fix problems in the APMBIOS by flashing a new one into the ROM, which is a dangerous procedure with the potential to leave the system in an unrecoverable state if it fails. Third, APM is a vendor-specific technology, meaning that there is a lot of duplication of efforts and bugs found in one vendor's BIOS may not be solved in others. Lastly, the APMBIOS did not have enough room to implement a sophisticated power policy or one that can adapt well to the purpose of the machine.
ko: APM에는 네 가지 주요 문제가 있습니다. 첫째, 전원 관리가 운영 체제와 별도로 공급업체별 BIOS에 의해 수행됩니다. 예를 들어, 사용자는 하드 드라이브의 유휴 시간 값을 APMBIOS에서 설정하여 초과 시 운영 체제의 동의 없이 BIOS가 하드 드라이브를 턴다운하도록 할 수 있습니다. 둘째, APM 로직은 BIOS에 내장되어 있으며 운영 체제의 범위 밖에서 작동합니다. 즉, 사용자는 ROM에 새 펌웨어를 플래시해야만 APMBIOS의 문제를 해결할 수 있으며, 이는 실패 시 시스템을 복구할 수 없는 상태로 만들 수 있는 위험한 절차입니다. 셋째, APM은 공급업체별 기술이기 때문에 중복되는 작업이 많고 한 공급업체의 BIOS에서 발견된 버그가 다른 공급업체에서는 해결되지 않을 수 있습니다. 마지막으로, APMBIOS는 정교한 전원 정책이나 기계의 목적에 맞게 잘 조정할 수 있는 정책을 구현할 여지가 충분하지 않았습니다.

source: The Plug and Play BIOS (PNPBIOS) was unreliable in many situations. PNPBIOS is 16-bit technology, so the operating system has to use 16-bit emulation in order to interface with PNPBIOS methods. FreeBSD provides an APM driver as APM should still be used for systems manufactured at or before the year 2000. The driver is documented in man:apm[4].
ko: Plug and Play BIOS(PNPBIOS)는 많은 상황에서 불안정했습니다. PNPBIOS는 16비트 기술이기 때문에 운영 체제가 16비트 에뮬레이션을 사용해야 PNPBIOS 방식과 인터페이스할 수 있습니다. 2000년 이전에 제조된 시스템에서는 여전히 APM을 사용해야 하므로 FreeBSD는 APM 드라이버를 제공합니다. 드라이버는 man:apm[4]에 문서화되어 있습니다.

source: The successor to APM is the Advanced Configuration and Power Interface (ACPI). ACPI is a standard written by an alliance of vendors to provide an interface for hardware resources and power management. It is a key element in _Operating System-directed configuration and Power Management_ as it provides more control and flexibility to the operating system.
ko: APM의 후속 버전은 고급 구성 및 전원 인터페이스(ACPI)입니다. ACPI는 하드웨어 리소스 및 전원 관리를 위한 인터페이스를 제공하기 위해 공급업체 연합에서 작성한 표준입니다. 운영 체제에 더 많은 제어와 유연성을 제공하기 때문에 _운영 체제 중심 구성 및 전원 관리_의 핵심 요소입니다.

source: This chapter demonstrates how to configure ACPI on FreeBSD. It then offers some tips on how to debug ACPI and how to submit a problem report containing debugging information so that developers can diagnosis and fix ACPI issues.
ko: 이 장에서는 FreeBSD에서 ACPI를 구성하는 방법을 설명합니다. 그런 다음 개발자가 ACPI 문제를 진단하고 수정할 수 있도록 ACPI를 디버깅하는 방법과 디버깅 정보가 포함된 문제 보고서를 제출하는 방법에 대한 몇 가지 팁을 제공합니다.

source: Configuring ACPI
ko: ACPI 구성하기

source: In FreeBSD the man:acpi[4] driver is loaded by default at system boot and should _not_ be compiled into the kernel. This driver cannot be unloaded after boot because the system bus uses it for various hardware interactions. However, if the system is experiencing problems, ACPI can be disabled altogether by rebooting after setting `hint.acpi.0.disabled="1"` in [.filename]#/boot/loader.conf# or by setting this variable at the loader prompt, as described in crossref:boot[boot-loader,“Stage Three”].
ko: FreeBSD에서는 시스템 부팅 시 man:acpi[4] 드라이버가 기본적으로 로드되며 커널에 컴파일해서는 안됩니다. 이 드라이버는 시스템 버스가 다양한 하드웨어 상호 작용에 사용하기 때문에 부팅 후 언로드할 수 없습니다. 그러나 시스템에 문제가 있는 경우 [.filename]#/boot/loader.conf#에서 `hint.acpi.0.disabled="1"`을 설정한 후 재부팅하거나 crossref:boot[boot-loader,“Stage Three”]에 설명된 대로 로더 프롬프트에서 이 변수를 설정하여 ACPI를 완전히 비활성화할 수 있습니다.

source: ACPI and APM cannot coexist and should be used separately. The last one to load will terminate if the driver notices the other is running.
ko: ACPI와 APM은 공존할 수 없으며 별도로 사용해야 합니다. 드라이버가 다른 드라이버가 실행 중인 것을 감지하면 마지막으로 로드한 드라이버가 종료됩니다.

source: ACPI can be used to put the system into a sleep mode with `acpiconf`, the `-s` flag, and a number from `1` to `5`. Most users only need `1` (quick suspend to RAM) or `3` (suspend to RAM). Option `5` performs a soft-off which is the same as running `halt -p`.
ko: ACPI는 `acpiconf`, `-s` 플래그 및 `1`에서 `5` 사이의 숫자를 사용하여 시스템을 절전 모드로 전환하는 데 사용할 수 있습니다. 대부분의 사용자는 `1`(RAM으로 빠른 일시 중단) 또는 `3`(RAM으로 일시 중단)만 필요합니다. 옵션 `5`는 `halt -p`를 실행하는 것과 동일한 소프트 오프를 수행합니다.

source: The man:acpi_video[4] driver uses link:https://uefi.org/specs/ACPI/6.4/Apx_B_Video_Extensions/Apx_B_Video_Extensions.html[ACPI Video Extensions] to control display switching and backlight brightness. It must be loaded after any of the DRM kernel modules. After loading the driver, the kbd:[Fn] brightness keys will change the brightness of the screen. It is possible to check the ACPI events by inspecting [.filename]#/var/run/devd.pipe#:
ko: man:acpi_video[4] 드라이버는 link:https://uefi.org/specs/ACPI/6.4/Apx_B_Video_Extensions/Apx_B_Video_Extensions.html[ACPI 비디오 확장]을 사용하여 디스플레이 전환 및 백라이트 밝기를 제어합니다. 이 드라이버는 DRM 커널 모듈 다음에 로드해야 합니다. 드라이버를 로드한 후 kbd:[Fn] 밝기 키로 화면 밝기를 변경할 수 있습니다. ACPI 이벤트는 [.filename]#/var/run/devd.pipe#를 검사하여 확인할 수 있습니다:

source: Other options are available using `sysctl`. Refer to man:acpi[4] and man:acpiconf[8] for more information.
ko: 다른 옵션은 `sysctl`을 사용하여 사용할 수 있습니다. 자세한 내용은 man:acpi[4] 및 man:acpiconf[8]을 참조하세요.

source: Common Problems
ko: 일반적인 문제

source: ACPI is present in all modern computers that conform to the ia32 (x86) and amd64 (AMD) architectures. The full standard has many features including CPU performance management, power planes control, thermal zones, various battery systems, embedded controllers, and bus enumeration. Most systems implement less than the full standard. For instance, a desktop system usually only implements bus enumeration while a laptop might have cooling and battery management support as well. Laptops also have suspend and resume, with their own associated complexity.
ko: ACPI는 ia32(x86) 및 amd64(AMD) 아키텍처를 준수하는 모든 최신 컴퓨터에 존재합니다. 전체 표준에는 CPU 성능 관리, 전원면 제어, 열 영역, 다양한 배터리 시스템, 임베디드 컨트롤러, 버스 열거 등 많은 기능이 포함되어 있습니다. 대부분의 시스템은 전체 표준보다 적은 기능을 구현합니다. 예를 들어 데스크톱 시스템은 일반적으로 버스 열거만 구현하는 반면 노트북은 냉각 및 배터리 관리도 지원할 수 있습니다. 또한 노트북에는 일시 중단 및 재개 기능이 있으며, 이와 관련된 복잡한 설정도 있습니다.

source: An ACPI-compliant system has various components. The BIOS and chipset vendors provide various fixed tables, such as FADT, in memory that specify things like the APIC map (used for SMP), config registers, and simple configuration values. Additionally, a bytecode table, the Differentiated System Description Table DSDT, specifies a tree-like name space of devices and methods.
ko: ACPI 호환 시스템에는 다양한 구성 요소가 있습니다. BIOS 및 칩셋 공급업체는 APIC 맵(SMP에 사용됨), 구성 레지스터, 간단한 구성 값 등을 지정하는 FADT와 같은 다양한 고정 테이블을 메모리에 제공합니다. 또한 바이트코드 테이블인 차별화 시스템 설명 테이블 (Differentiated System Description Table, DSDT는 장치 및 메서드의 트리와 같은 이름 공간을 지정합니다.

source: The ACPI driver must parse the fixed tables, implement an interpreter for the bytecode, and modify device drivers and the kernel to accept information from the ACPI subsystem. For FreeBSD, Intel(R) has provided an interpreter (ACPI-CA) that is shared with Linux(R) and NetBSD. The path to the ACPI-CA source code is [.filename]#src/sys/contrib/dev/acpica#. The glue code that allows ACPI-CA to work on FreeBSD is in [.filename]#src/sys/dev/acpica/Osd#. Finally, drivers that implement various ACPI devices are found in [.filename]#src/sys/dev/acpica#.
ko: ACPI 드라이버는 고정 테이블을 구문 분석하고, 바이트코드에 대한 인터프리터를 구현하고, 장치 드라이버와 커널을 수정하여 ACPI 서브시스템의 정보를 받아들여야 합니다. FreeBSD의 경우, 인텔(R)은 Linux(R) 및 NetBSD와 공유되는 인터프리터(ACPI-CA)를 제공했습니다. ACPI-CA 소스 코드의 경로는 [.filename]#src/sys/contrib/dev/acpica#입니다. ACPI-CA가 FreeBSD에서 작동할 수 있도록 하는 글루 코드는 [.filename]#src/sys/dev/acpica/Osd#에 있습니다. 마지막으로, 다양한 ACPI 장치를 구현하는 드라이버는 [.filename]#src/sys/dev/acpica#에서 찾을 수 있습니다.

source: For ACPI to work correctly, all the parts have to work correctly. Here are some common problems, in order of frequency of appearance, and some possible workarounds or fixes. If a fix does not resolve the issue, refer to <<ACPI-submitdebug>> for instructions on how to submit a bug report.
ko: ACPI가 올바르게 작동하려면 모든 부품이 올바르게 작동해야 합니다. 다음은 자주 발생하는 몇 가지 일반적인 문제와 가능한 해결 방법 또는 수정 사항을 빈도 순으로 나열한 것입니다. 수정해도 문제가 해결되지 않으면 <<ACPI-submitdebug>>에서 버그 리포트를 제출하는 방법에 대한 지침을 참조하세요.

source: Mouse Issues
ko: 마우스 문제

source: In some cases, resuming from a suspend operation will cause the mouse to fail. A known work around is to add `hint.psm.0.flags="0x3000"` to [.filename]#/boot/loader.conf#.
ko: 경우에 따라 일시 중단된 작업에서 다시 시작하면 마우스가 실패할 수 있습니다. 알려진 해결 방법은 `hint.psm.0.flags="0x3000"`을 [.filename]#/boot/loader.conf#에 추가하는 것입니다.

source: Suspend/Resume
ko: 일시 중단/재개
ru: Приостановка/возобновление

source: ACPI has three suspend to RAM (STR) states, `S1`-`S3`, and one suspend to disk state (STD), called `S4`. STD can be implemented in two separate ways. The ``S4``BIOS is a BIOS-assisted suspend to disk and ``S4``OS is implemented entirely by the operating system. The normal state the system is in when plugged in but not powered up is "soft off" (`S5`).
ko: ACPI에는 `S1`-`S3`의 세 가지 RAM 일시 중단(STR) 상태와 `S4`라는 하나의 디스크 일시 중단(STD) 상태가 있습니다. STD는 두 가지 방법으로 구현할 수 있습니다. ``S4`` BIOS는 BIOS가 지원하는 디스크 일시 중단이고 ``S4`` OS는 운영 체제에서 전적으로 구현합니다. 전원이 연결되었지만 전원이 켜지지 않은 상태의 정상적인 시스템은 "소프트 오프"(``S5``) 상태입니다.

source: Use `sysctl hw.acpi` to check for the suspend-related items. These example results are from a Thinkpad:
ko: `sysctl hw.acpi`를 사용하여 일시 중단 관련 항목을 확인합니다. 이 예제 결과는 Thinkpad의 결과입니다:

source: Use `acpiconf -s` to test `S3`, `S4`, and `S5`. An `s4bios` of one (`1`) indicates ``S4``BIOS support instead of `S4` operating system support.
ko: `acpiconf -s`를 사용하여 `S3`, `S4` 및 `S5`를 테스트합니다. `s4bios`가 1(`1`)이면 `S4` 운영 체제 지원 대신 `S4` BIOS를 지원함을 나타냅니다.

source: When testing suspend/resume, start with `S1`, if supported. This state is most likely to work since it does not require much driver support. No one has implemented `S2`, which is similar to `S1`. Next, try `S3`. This is the deepest STR state and requires a lot of driver support to properly reinitialize the hardware.
ko: 일시 중단/재개를 테스트할 때, 지원되는 경우 `S1`으로 시작합니다. 이 상태는 많은 드라이버 지원이 필요하지 않으므로 작동할 가능성이 가장 높습니다. `S1`과 유사한 `S2`를 구현한 곳은 없습니다. 다음으로 `S3`을 시도해 보세요. 이것은 가장 깊은 STR 상태이며 하드웨어를 올바르게 다시 초기화하기 위해 많은 드라이버 지원이 필요합니다.

source: A common problem with suspend/resume is that many device drivers do not save, restore, or reinitialize their firmware, registers, or device memory properly. As a first attempt at debugging the problem, try:
ko: 일시 중단/재개와 관련된 일반적인 문제는 많은 장치 드라이버가 펌웨어, 레지스터 또는 장치 메모리를 제대로 저장, 복원 또는 다시 초기화하지 못한다는 점입니다. 문제를 디버깅하기 위한 첫 번째 시도로 다음을 시도해 보세요:

source: This test emulates the suspend/resume cycle of all device drivers without actually going into `S3` state. In some cases, problems such as losing firmware state, device watchdog time out, and retrying forever, can be captured with this method. Note that the system will not really enter `S3` state, which means devices may not lose power, and many will work fine even if suspend/resume methods are totally missing, unlike real `S3` state.
ko: 이 테스트는 실제로 `S3` 상태가 되지 않고 모든 디바이스 드라이버의 일시 중단/재개 주기를 에뮬레이션합니다. 경우에 따라 펌웨어 상태 손실, 장치 감시 시간 초과, 영원히 재시도하는 등의 문제를 이 방법으로 캡처할 수 있습니다. 시스템이 실제로 `S3`상태가 되지 않으므로 기기의 전원이 손실되지 않을 수 있으며, 실제 `S3`상태와 달리 일시 중단/재시작 방법이 완전히 누락되더라도 많은 기기가 정상적으로 작동한다는 점에 유의하세요.

source: If the previous test worked, on a laptop it is possible to configure the system to suspend into `S3` on lid close and resume when it is open back again:
ko: 이전 테스트가 작동했다면 노트북에서 뚜껑을 닫을 때 시스템이 `S3'로 일시 중단되었다가 열면 다시 시작되도록 구성할 수 있습니다:

source: This change can be made persistent across reboots:
ko: 이 변경 사항은 재부팅 시에도 영구적으로 적용될 수 있습니다:

source: Harder cases require additional hardware, such as a serial port and cable for debugging through a serial console, a Firewire port and cable for using man:dcons[4], and kernel debugging skills.
ko: 더 어려운 경우에는 직렬 콘솔을 통한 디버깅하기 위해 직렬 포트 및 케이블, man:dcons[4] 실행을 위한 Firewire 포트 및 케이블, 커널 디버깅 기술 등의 추가 하드웨어가 필요합니다.

source: To help isolate the problem, unload as many drivers as possible. If it works, narrow down which driver is the problem by loading drivers until it fails again. Typically, binary drivers like [.filename]#nvidia.ko#, display drivers, and USB will have the most problems while Ethernet interfaces usually work fine. If drivers can be properly loaded and unloaded, automate this by putting the appropriate commands in [.filename]#/etc/rc.suspend# and [.filename]#/etc/rc.resume#. Try setting `hw.acpi.reset_video` to `1` if the display is messed up after resume. Try setting longer or shorter values for `hw.acpi.sleep_delay` to see if that helps.
ko: 문제를 분리하는 데 도움이 되도록 최대한 많은 드라이버를 언로드하세요. 작동하면 다시 실패할 때까지 드라이버를 로드하여 어떤 드라이버가 문제인지 좁혀보세요. 일반적으로 [.filename]#nvidia.ko#와 같은 바이너리 드라이버, 디스플레이 드라이버, USB에 가장 많은 문제가 발생하지만 이더넷 인터페이스는 보통 정상 작동합니다. 드라이버를 제대로 로드 및 언로드할 수 있는 경우 [.filename]#/etc/rc.suspend# 및 [.filename]#/etc/rc.resume#에 적절한 명령을 넣어 이 작업을 자동화하세요. 다시 시작한 후 디스플레이가 엉망인 경우 `hw.acpi.reset_video`를 `1`로 설정해 보세요. `hw.acpi.sleep_delay`의 값을 더 길게 또는 더 짧게 설정하여 도움이 되는지 확인하세요.

source: Try loading a recent Linux(R) distribution to see if suspend/resume works on the same hardware. If it works on Linux(R), it is likely a FreeBSD driver problem. Narrowing down which driver causes the problem will assist developers in fixing the problem. Since the ACPI maintainers rarely maintain other drivers, such as sound or ATA, any driver problems should also be posted to the {freebsd-current} and mailed to the driver maintainer. Advanced users can include debugging man:printf[3]s in a problematic driver to track down where in its resume function it hangs.
ko: 최신 Linux(R) 배포판을 로드하여 동일한 하드웨어에서 일시 중단/다시 시작이 작동하는지 확인하세요. Linux(R)에서 작동한다면 FreeBSD 드라이버 문제일 가능성이 높습니다. 문제를 일으키는 드라이버를 좁히면 개발자가 문제를 해결하는 데 도움이 됩니다. ACPI 유지 관리자는 사운드나 ATA와 같은 다른 드라이버는 거의 관리하지 않으므로, 드라이버 문제는 {freebsd-current}에 게시하고 드라이버 유지 관리자에게 메일을 보내야 합니다. 고급 사용자는 문제가 있는 드라이버에서 man:printf[3]를 디버깅하여 재개 기능의 어느 부분에서 중단되는지 추적할 수 있습니다.

source: Finally, try disabling ACPI and enabling APM instead. If suspend/resume works with APM, stick with APM, especially on older hardware (pre-2000). It took vendors a while to get ACPI support correct and older hardware is more likely to have BIOS problems with ACPI.
ko: 마지막으로 ACPI를 비활성화하고 대신 APM을 활성화해 보세요. 일시 중단/재개가 APM과 함께 작동하는 경우, 특히 구형 하드웨어(2000년 이전)에서는 APM을 계속 사용하세요. 공급업체가 ACPI를 올바르게 지원하는 데 시간이 걸렸고 구형 하드웨어는 ACPI와 관련된 BIOS 문제가 있을 가능성이 더 높습니다.

source: System Hangs
ko: 시스템 멈춤

source: Most system hangs are a result of lost interrupts or an interrupt storm. Chipsets may have problems based on boot, how the BIOS configures interrupts before correctness of the APIC (MADT) table, and routing of the System Control Interrupt (SCI).
ko: 대부분의 시스템 중단은 인터럽트 손실 또는 인터럽트 폭풍으로 인해 발생합니다. 칩셋은 부팅, BIOS에서 인터럽트를 구성하는 방법, APIC(MADT) 테이블의 정확성, 시스템 제어 인터럽트(SCI)의 라우팅에 따라 문제가 발생할 수 있습니다.

source: Interrupt storms can be distinguished from lost interrupts by checking the output of `vmstat -i` and looking at the line that has `acpi0`. If the counter is increasing at more than a couple per second, there is an interrupt storm. If the system appears hung, try breaking to DDB (kbd:[CTRL+ALT+ESC] on console) and type `show interrupts`.
ko: 인터럽트 폭풍은 `vmstat -i`의 출력을 확인하고 `acpi0`이 있는 줄을 확인하여 손실된 인터럽트와 구별할 수 있습니다. 카운터가 초당 두 개 이상 증가하면 인터럽트 폭풍이 발생한 것입니다. 시스템이 중단된 것처럼 보이면 DDB(콘솔에서 kbd:[CTRL+ALT+ESC])로 이동하여 `show interrupts`를 입력해 보세요.

source: When dealing with interrupt problems, try disabling APIC support with `hint.apic.0.disabled="1"` in [.filename]#/boot/loader.conf#.
ko: 인터럽트 문제를 해결할 때는 [.filename]#/boot/loader.conf#에서 `hint.apic.0.disabled="1"`을 사용하여 APIC 지원을 비활성화해 보세요.

source: Panics
ko: 패닉

source: Panics are relatively rare for ACPI and are the top priority to be fixed. The first step is to isolate the steps to reproduce the panic, if possible, and get a backtrace. Follow the advice for enabling `options DDB` and setting up a serial console in crossref:serialcomms[serialconsole-ddb,“Entering the DDB Debugger from the Serial Line”] or setting up a dump partition. To get a backtrace in DDB, use `tr`. When handwriting the backtrace, get at least the last five and the top five lines in the trace.
ko: 패닉은 ACPI에서 비교적 드물게 발생하나 최우선적으로 해결해야 할 문제입니다. 첫 번째 단계는 가능한 경우 패닉을 재현하는 단계를 분리하고 백트레이스를 확보하는 것입니다. crossref:serialcomms[serialconsole-ddb,“Entering the DDB Debugger from the Serial Line”] 또는 덤프 파티션 설정에서 `options DDB`를 활성화하고 시리얼 콘솔을 설정하는 방법에 대한 조언을 따르세요. DDB에서 백트레이스를 얻으려면 `tr`을 사용합니다. 백트레이스를 손으로 기록할 때는 최소한 추적의 마지막 다섯 줄과 상위 다섯 줄을 가져와야 합니다.

source: Then, try to isolate the problem by booting with ACPI disabled. If that works, isolate the ACPI subsystem by using various values of `debug.acpi.disable`. See man:acpi[4] for some examples.
ko: 그런 다음 ACPI를 비활성화한 상태로 부팅하여 문제를 격리해 보세요. 문제가 해결되면 `debug.acpi.disable`의 다양한 값을 사용하여 ACPI 하위 시스템을 격리합니다. 몇 가지 예는 man:acpi[4]를 참조하세요.

source: System Powers Up After Suspend or Shutdown
ko: 일시 중단 또는 종료 후 시스템 전원 켜짐

source: First, try setting `hw.acpi.disable_on_poweroff="0"` in [.filename]#/boot/loader.conf#. This keeps ACPI from disabling various events during the shutdown process. Some systems need this value set to `1` (the default) for the same reason. This usually fixes the problem of a system powering up spontaneously after a suspend or poweroff.
ko: 먼저, [.filename]#/boot/loader.conf#에서 `hw.acpi.disable_on_poweroff="0"`을 설정해 보세요. 이렇게 하면 종료 프로세스 중에 ACPI가 다양한 이벤트를 비활성화하지 않습니다. 일부 시스템에서는 같은 이유로 이 값을 `1`(기본값)로 설정해야 합니다. 이렇게 하면 일반적으로 일시 중단 또는 전원 끄기 후 시스템이 저절로 전원이 켜지는 문제가 해결됩니다.

source: BIOS Contains Buggy Bytecode
ko: 버기 바이트코드가 포함된 BIOS

source: Some BIOS vendors provide incorrect or buggy bytecode. This is usually manifested by kernel console messages like this:
ko: 일부 BIOS 공급업체는 부정확하거나 버그가 있는 바이트코드를 제공합니다. 이는 일반적으로 다음과 같은 커널 콘솔 메시지로 나타납니다:

source: Often, these problems may be resolved by updating the BIOS to the latest revision. Most console messages are harmless, but if there are other problems, like the battery status is not working, these messages are a good place to start looking for problems.
ko: 대개 이러한 문제는 BIOS를 최신 버전으로 업데이트하면 해결될 수 있습니다. 대부분의 콘솔 메시지는 무해하지만 배터리 상태가 작동하지 않는 등의 다른 문제가 있는 경우 이러한 메시지를 통해 문제를 찾아보는 것이 좋습니다.

source: Overriding the Default AML
ko: 기본 AML 재정의하기

source: The BIOS bytecode, known as ACPI Machine Language (AML), is compiled from a source language called ACPI Source Language (ASL). The AML is found in the table known as the Differentiated System Description Table (DSDT).
ko: ACPI 기계어(AML)로 알려진 BIOS 바이트 코드는 ACPI 소스 언어(ASL)라는 소스 언어에서 컴파일됩니다. AML은 차별화 시스템 설명 테이블(Differentiated System Description Table, DSDT)이라는 테이블에서 찾을 수 있습니다.

source: The goal of FreeBSD is for everyone to have working ACPI without any user intervention. Workarounds are still being developed for common mistakes made by BIOS vendors. The Microsoft(R) interpreter ([.filename]#acpi.sys# and [.filename]#acpiec.sys#) does not strictly check for adherence to the standard, and thus many BIOS vendors who only test ACPI under Windows(R) never fix their ASL. FreeBSD developers continue to identify and document which non-standard behavior is allowed by Microsoft(R)'s interpreter and replicate it so that FreeBSD can work without forcing users to fix the ASL.
ko: FreeBSD의 목표는 모든 사람이 사용자 개입 없이 작동하는 ACPI를 사용하는 것입니다. BIOS 공급업체가 흔히 저지르는 실수에 대한 해결 방법은 여전히 개발 중입니다. Microsoft(R) 인터프리터([.filename]#acpi.sys# 및 [.filename]#acpiec.sys#)는 표준 준수 여부를 엄격하게 검사하지 않기 때문에, Windows(R)에서만 ACPI를 테스트하는 많은 BIOS 벤더들은 그들의 ASL을 수정하지 않습니다. FreeBSD 개발자들은 Microsoft(R)의 인터프리터가 허용하는 비표준 동작을 지속적으로 식별하고 문서화하여 사용자가 ASL을 수정하지 않고도 FreeBSD가 작동할 수 있도록 복제하고 있습니다.

source: To help identify buggy behavior and possibly fix it manually, a copy can be made of the system's ASL. To copy the system's ASL to a specified file name, use `acpidump` with `-t`, to show the contents of the fixed tables, and `-d`, to disassemble the AML:
ko: 버그가 있는 동작을 식별하고 수동으로 수정하는 데 도움이 되도록 시스템의 ASL을 복사할 수 있습니다. 시스템의 ASL을 지정된 파일 이름으로 복사하려면 `acpidump`에 고정 테이블의 내용을 표시하는 `-t`와 AML을 분해하는 `-d`를 함께 사용합니다:

source: Some AML versions assume the user is running Windows(R). To override this, set `hw.acpi.osname=_"Windows 2009"_` in [.filename]#/boot/loader.conf#, using the most recent Windows(R) version listed in the ASL.
ko: 일부 AML 버전은 사용자가 Windows(R)를 실행하고 있다고 가정합니다. 이를 재정의하려면 ASL에 나열된 가장 최신 Windows(R) 버전을 사용하여 [.filename]#/boot/loader.conf#에 `hw.acpi.osname=_"Windows 2009"_`를 설정하세요.

source: Other workarounds may require [.filename]#my.asl# to be customized. If this file is edited, compile the new ASL using the following command. Warnings can usually be ignored, but errors are bugs that will usually prevent ACPI from working correctly.
ko: 다른 해결 방법을 사용하려면 [.filename]#my.asl#을 사용자 지정해야 할 수도 있습니다. 이 파일을 편집한 경우 다음 명령을 사용하여 새 ASL을 컴파일합니다. 경고는 일반적으로 무시할 수 있지만 오류는 일반적으로 ACPI가 올바르게 작동하지 못하게 하는 버그입니다.

source: Including `-f` forces creation of the AML, even if there are errors during compilation. Some errors, such as missing return statements, are automatically worked around by the FreeBSD interpreter.
ko: `-f`를 포함하면 컴파일 중에 오류가 있더라도 AML을 강제로 생성합니다. 누락된 반환문과 같은 일부 오류는 FreeBSD 인터프리터가 자동으로 해결합니다.

source: The default output filename for `iasl` is [.filename]#DSDT.aml#. Load this file instead of the BIOS's buggy copy, which is still present in flash memory, by editing [.filename]#/boot/loader.conf# as follows:
ko: `iasl`의 기본 출력 파일 이름은 [.filename]#DSDT.aml#입니다. 플래시 메모리에 여전히 존재하는 BIOS의 버그 복사본 대신 이 파일을 로드하려면 [.filename]#/boot/loader.conf#를 다음과 같이 편집합니다:

source: Be sure to copy [.filename]#DSDT.aml# to [.filename]#/boot#, then reboot the system. If this fixes the problem, send a man:diff[1] of the old and new ASL to {freebsd-acpi} so that developers can work around the buggy behavior in [.filename]#acpica#.
ko: [.filename]#DSDT.aml#을 [.filename]#/boot#에 복사한 다음 시스템을 재부팅하세요. 이렇게 해서 문제가 해결되면 개발자가 [.filename]#acpica#에서 버그가 있는 동작을 해결할 수 있도록 이전 및 새 ASL의 man:diff[1]을 {freebsd-acpi}로 보내세요.

source: Getting and Submitting Debugging Info
ko: 디버깅 정보 얻기 및 제출하기
