<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: n.nn
-->

    <chapter>
      <title>Communications s&eacute;rie</title>
      &trans.a.haby;
      
      <sect1 id="serial">
	<title>Les bases</title>
	
	<para><emphasis>Compil&eacute;es &agrave; partir de la FAQ.</emphasis></para>
	
	<para>Cette section devrait vous donner des informations
          g&eacute;n&eacute;rales sur les ports s&eacute;rie. Si vous n'y trouvez pas
          ce que vous cherchez, consultez les sections de ce manuel
          consacr&eacute;es aux terminaux et aux liaisons t&eacute;l&eacute;phoniques.</para>
	
	<para>Vos applications ouvrirons normalement le fichier sp&eacute;cial 
          de p&eacute;riph&eacute;rique <filename>ttyd<replaceable>X</replaceable></filename>
          (ou <filename>cuaa<replaceable>X</replaceable></filename>). Quand
          un programme ouvre ce fichier, il retrouve normalement un ensemble
          de param&egrave;tres par d&eacute;faut pour les entr&eacute;es/sorties sur le terminal. 
          Vous pouvez visualiser ces valeurs par d&eacute;faut avec la commande:</para>

	  <informalexample>
            <screen>&prompt.root; <userinput>stty -a -f /dev/ttyd1</userinput></screen>
	  </informalexample>
	
	<para>Si vous modifiez le param&egrave;trage de ce p&eacute;riph&eacute;rique, ces 
          modifications s'appliquent jusqu'&agrave; ce que vous fermiez le 
          p&eacute;riph&eacute;rique. A la prochaine ouverture, le param&egrave;trage par
          d&eacute;faut s'applique de nouveau. Pour changer le param&egrave;trage
          par d&eacute;faut, vous devez ouvrir et modifier l'&ldquo;&eacute;tat
          initial&rdquo; du p&eacute;riph&eacute;rique. Par exemple, pour activer
          le mode <acronym>CLOCAL</acronym>, la transmission de donn&eacute;es
          8 bits et le contr&ocirc;le de flux <emphasis>XON/XOFF</emphasis>
          par d&eacute;faut pour la ligne ttyd5, tapez:</para>

	  <informalexample>
            <screen>&prompt.root; <userinput>stty -f /dev/ttyid5 clocal cs8 ixon ixoff</userinput></screen>
	  </informalexample>
	
	<para>Il est bien de confier cela &agrave; la proc&eacute;dure
	  <filename>/etc/rc.serial</filename>. Ces param&egrave;tres par d&eacute;faut
          s'appliqueront maintenant lorsqu'une application ouvrira
	  <filename>ttyd5</filename>. Ce qui ne l'emp&ecirc;che pas de modifier
          ces valeurs, si besoin est.</para>
	
	<para>Vous pouvez aussi emp&ecirc;cher que certaines valeurs puissent
          &ecirc;tre modifi&eacute;es par une application en changeant 
          l'&ldquo;&eacute;tat verrouill&eacute;&rdquo; du p&eacute;riph&eacute;rique. Par exemple,
          pour fixer la vitesse de <filename>ttyd5</filename> &agrave; 57600 bps,
          tapez:</para>

	  <informalexample>
            <screen>&prompt.root; <userinput>stty -f /dev/ttyld5 57600</userinput></screen>
	  </informalexample>
	
	<para>Si une application qui ouvre maintenant <filename>ttyd5</filename>
          essaie de modifier la vitesse de ce port, elle sera contrainte de
          garder la valeur de 57600 bps.</para>
	
	<para>Vous devriez bien entendu n'autoriser l'&eacute;criture 
          de l'&eacute;tat initial et de l'&eacute;tat bloqu&eacute; du p&eacute;riph&eacute;rique qu'au
          super-utilisateur <emphasis remap=tt>root</emphasis>. La proc&eacute;dure
	  <filename>MAKEDEV</filename> <emphasis>NE</emphasis> le fait 
          <emphasis>PAS</emphasis> quand elle cr&eacute;e les fichiers sp&eacute;ciaux de
          p&eacute;riph&eacute;riques.</para>
	
      </sect1>
      
      <sect1 id="term">
	<title>Terminaux</title>
	
	<para><emphasis>Contribution de &a.kelly;<!-- <br> -->28 Juillet
	    1996</emphasis></para>
	
	<para>Utiliser des terminaux est une solution commode et peu co&ucirc;teuse 
          pour disposer de la puissance de votre syst&egrave;me FreeBSD lorsque vous
          n'&ecirc;tes pas sur la console de l'ordinateur ou sur un r&eacute;seau auquel il
          est connect&eacute;. Cette section vous explique comment utiliser des
          terminaux avec FreeBSD.</para>
	
	<sect2 id="term-uses">
	  <title>Usages et types de terminaux</title>
	  
	  <para>Les premiers syst&egrave;mes Unix n'avaient pas de console. Au lieu
            de cela, les gens ouvraient des sessions et ex&eacute;cutaient leurs
            programmes &agrave; partir de terminaux qui &eacute;taient connect&eacute;s aux ports
            s&eacute;rie de l'ordinateur. C'est un peu la m&ecirc;me chose que lorsque
            l'on utilise un modem et un logiciel d'&eacute;mulation de terminal
            pour se connecter &agrave; un syst&egrave;me distant et travailler en mode
            texte.</para> 
	  
	  <para>Les PCs d'aujourd'hui ont des consoles graphiques de
            haute r&eacute;solution, mais la possibilit&eacute; d'ouvrir une session
            sur un port s&eacute;rie subsiste toujours sur presque tous les
            syst&egrave;mes d'exploitation de type Unix; FreeBSD ne fait pas
            exception &agrave; la r&egrave;gle. Avec un terminal reli&eacute; &agrave; un port s&eacute;rie
            disponible, vous pouvez ouvrir une session 
            et ex&eacute;cuter des programmes
            comme vous le feriez normalement &agrave; la console ou dans une
	    fen&ecirc;tre <command>xterm</command> avec le gestionnaire
            X Window.</para>
	  
	  <para>Pour un usage professionnel, vous pouvez connecter de
            nombreux terminaux &agrave; un syst&egrave;me FreeBSD et les installer
            sur les bureaux de vos employ&eacute;s. Pour une usage domestique,
            un ordinateur inutilis&eacute;, un vieux PC ou Macintosh, peut
            servir de terminal sur un ordinateur plus puissant sous
            FreeBSD. Vous pouvez ainsi faire de ce qui serait sinon un
            syst&egrave;me mono-utilisateur un puissant syst&egrave;me 
            multi-utilisateurs.</para>
	  
	  <para>FreeBSD conna&icirc;t trois types de terminaux:</para>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>Les <link linkend="term-dumb">Terminaux 
                   passifs</link>,</para>
	      </listitem>
	      
	      <listitem>
		<para>Les <link linkend="term-pcs">PCs servant de
		    terminaux</link>,</para>
	      </listitem>
	      
	      <listitem>
		<para>Les <link linkend="term-x">Terminaux X</link>.</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  <para>Les sections qui suivent d&eacute;crivent chacun de ces types de
              terminaux.</para>
	  
	  
	  <sect3 id="term-dumb">
	    <title>Terminaux passifs</title>
	    
	    <para>Les terminaux passifs sont des mat&eacute;riels sp&eacute;cialis&eacute;s qui
               vous permettent de vous connecter &agrave; votre ordinateur via une
               ligne s&eacute;rie. On les appelle &ldquo;passifs&rdquo; parce qu'ils
               ne savent qu'afficher, envoyer et recevoir du texte. Ils ne 
               peuvent pas ex&eacute;cuter de programmes. C'est l'ordinateur auquel 
               ils sont connect&eacute;s qui dispose de tout ce qu'il faut pour faire 
               tourner les logiciels de traitement de texte, les compilateurs, 
               la messagerie &eacute;lectroniques, les jeux, et ainsi de suite.</para>
	    
	    <para>Il ya a des centaines de mod&egrave;les de terminaux passifs de
              constructeurs diff&eacute;rents, dont le VT-100 de Digital Equipment 
              Corporation et le WY-75 de Wyse. Ils fonctionneront pratiquement
              tous avec FreeBSD. Certains terminaux haut de gamme peuvent m&ecirc;me
              afficher des graphiques, mais seuls certains logiciels tireront
              parti de ces possibilit&eacute;s &eacute;volu&eacute;es.</para>
	    
	    <para>Les terminaux passifs sont d'usage courant 
              lorsque les utilisateurs
              n'ont pas besoin d'acc&eacute;der &agrave; des outils graphiques tels que ceux
              que fournit le syst&egrave;me X Window.</para>
	    
	  </sect3>
	  
	  <sect3 id="term-pcs">
	    <title>PCs servant de terminaux</title>
	    
	    <para>Si un  <link linkend="term-dumb">terminal passif</link>
              ne sait qu'afficher, envoyer et recevoir du texte, alors 
              n'importe quel ordinateur personnel inutilis&eacute; peut servir
              de terminal passif. Il vous faudra uniquement le c&acirc;ble
              adapt&eacute; et un programme d'<emphasis>&eacute;mulation de 
              terminal</emphasis> qui tourne sur cet ordinateur.</para>
	    
	    <para>C'est un usage domestique courant. Si votre femme travaille 
              sur votre console syst&egrave;me FreeBSD, vous pouvez travailler en mode
              texte en m&ecirc;me temps &agrave; partir d'une machine moins puissante
              connect&eacute;e comme terminal &agrave; votre syst&egrave;me FreeBSD.</para>
	    
	  </sect3>
	  
	  <sect3 id="term-x">
	    <title>Terminaux X</title>
	    
	    <para>Les terminaux X sont les terminaux les plus sophistiqu&eacute;s,
              ils ne se connectent pas &agrave; un port s&eacute;rie, mais habituellement
              &agrave; un r&eacute;seau du type Ethernet. Au lieu d'&ecirc;tre cantonn&eacute;s au mode
              texte, ils peuvent afficher des applications X Window.</para>
	    
	    <para>Les terminaux X ne sont cit&eacute;s ici que pour &ecirc;tre exhaustif.
              Ce chapitre <emphasis>ne</emphasis> d&eacute;crit 
              <emphasis>pas</emphasis> comment installer, configurer et utiliser
              des terminaux X.</para>
	    
	  </sect3>
	</sect2>
	
	<sect2 id="term-cables-ports">
	  <title>C&acirc;bles et Ports</title>
	  
	  <para>Pour relier un terminal &agrave; votre syst&egrave;me FreeBSD, il vous faut
            le bon c&acirc;ble et un port s&eacute;rie auquel le connecter. Cette section
            vous explique comment faire. Si vous savez d&eacute;j&agrave; comment brancher
            votre terminal et quel type de c&acirc;ble il vous faut, passez &agrave; la
            section <link linkend="term-config">Configuration</link>.</para>
	  
	  <sect3 id="term-cables">
	    <title>C&acirc;bles</title>
	    
	    <para>Comme les terminaux utilisent les ports s&eacute;rie, il vous faudra
	      un c&acirc;ble s&eacute;rie&nbsp;-&nbsp;appel&eacute; aussi RS-232C&nbsp;-&nbsp;pour relier le 
              terminal &agrave; votre syst&egrave;me FreeBSD.</para>
	    
	    <para>Il y a deux sortes de c&acirc;bles s&eacute;rie. Celui que vous utiliserez
              d&eacute;pendra du type de terminal que vous voulez connecter:</para>
	    
	    <para>
	      <itemizedlist>
		
		<listitem>
		  <para>Si vous connectez un ordinateur personnel pour servir
                    de terminal, utilisez un <link linkend="term-null">c&acirc;ble
		    &ldquo;null-modem&rdquo;</link>. Un c&acirc;ble
		    &ldquo;null-modem&rdquo; relie deux ordinateurs ou deux
		    terminaux entre eux.</para>
		</listitem>
		
		<listitem>
		  <para>Si vous avez un vrai terminal, la meilleure source 
                    d'information pour savoir quel c&acirc;ble utiliser est la
                    documentation du terminal. Si vous n'avez pas de
                    documentation, essayez un <link linkend="term-null">c&acirc;ble
		    &ldquo;null-modem&rdquo;</link>. Si cela ne marche pas,
                    alors essayez avec un <link linkend="term-std">c&acirc;ble 
                    standard</link>.</para>
		</listitem>
		
	      </itemizedlist>
	    </para>
	    
	    <para>Il faudra aussi que les ports s&eacute;rie de votre terminal
              <emphasis>et</emphasis> de votre syst&egrave;me FreeBSD aient des
              connecteurs compatibles avec le c&acirc;ble que vous utilisez.</para>
	    
	    <sect4 id="term-null">
	      <title>C&acirc;bles &ldquo;Null-modem&rdquo;</title>
	      
	      <para>Un c&acirc;ble &ldquo;null-modem&rdquo; transmet directement
                certains signaux, le &ldquo;signal &agrave; la terre&rdquo;, par
                exemple, mais en permute d'autres, les broches
		&ldquo;&eacute;mission&rdquo; et &ldquo;r&eacute;ception&rdquo; 
                sont par exemple reli&eacute;es entre elles, d'une extr&eacute;mit&eacute; sur 
                l'autre.</para>
	      
	      <para>Si vous r&eacute;alisez vous-m&ecirc;me vos propres c&acirc;bles, voici une
                table qui d&eacute;crit la m&eacute;thode recommand&eacute;e pour fabriquer un c&acirc;ble
		&ldquo;null-modem&rdquo; pour les terminaux. Cette table donne
                les noms et les num&eacute;ros de broches des signaux RS-232C sur un
                connecteur DB-25,</para>

		<informaltable frame="none">
		  <tgroup cols="5">
		    <thead>
		      <row>
			<entry>Signal</entry>
			<entry>Broche #</entry>
			<entry></entry>
			<entry>Broche #</entry>
			<entry>Signal</entry>
		      </row>
		    </thead>
		    
		    <tbody>

		      <row>
			<entry>TxD</entry>
			<entry>2</entry>
			<entry>reli&eacute;e &agrave;</entry>
			<entry>3</entry>
			<entry>RxD</entry>
		      </row>

		      <row>
			<entry>RxD</entry>
			<entry>3</entry>
			<entry>reli&eacute;e &agrave;</entry>
			<entry>2</entry>
			<entry>TxD</entry>
		      </row>
		      
		      <row>
			<entry>DTR</entry>
			<entry>20</entry>
			<entry>reli&eacute;e &agrave;</entry>
			<entry>6</entry>
			<entry>DSR</entry>
		      </row>
		      
		      <row>
			<entry>DSR</entry>
			<entry>6</entry>
			<entry>reli&eacute;e &agrave;</entry>
			<entry>20</entry>
			<entry>DTR</entry>
		      </row>
		      
		      <row>
			<entry>SG</entry>
			<entry>7</entry>
			<entry>reli&eacute;e &agrave;</entry>
			<entry>7</entry>
			<entry>SG</entry>
		      </row>
		      
		      <row>
			<entry>DCD</entry>
			<entry>8</entry>
			<entry>reli&eacute;e &agrave;</entry>
			<entry>4</entry>
			<entry>RTS [a]</entry>
		      </row>
		      
		      <row>
			<entry>RTS</entry>
			<entry>4</entry>
			<entry></entry>
			<entry>5</entry>
			<entry>CTS</entry>
		      </row>
		      
		      <row>
			<entry>CTS</entry>
			<entry>5</entry>
			<entry>reli&eacute;e &agrave;</entry>
			<entry>8</entry>
			<entry>DCD</entry>
		      </row>
		    </tbody>
		  </tgroup>
		</informaltable>
                <para>Remarques :</para>
                <itemizedlist>
                  <listitem>
		    <para>[a] reliez les broches 4 et 5 entre elles sur le
                      connecteur et &agrave; la broche 8 de l'autre extr&eacute;mit&eacute; (c&ocirc;t&eacute; 
                      ordinateur).</para>
                  </listitem>
                </itemizedlist>
	      
	    </sect4>
	    
	    <sect4 id="term-std">
	      <title>C&acirc;bles RS-232C standard</title>
	      
	      <para>Un c&acirc;ble s&eacute;rie standard transmet directement les signaux
                RS-232C. Ce qui signifie que la broche &ldquo;&eacute;mission&rdquo;
                d'une extr&eacute;mit&eacute; est reli&eacute;e &agrave; la broche &ldquo;&eacute;mission&rdquo;
                de l'autre. C'est le c&acirc;ble que l'on utilise pour connecter un
                modem &agrave; un syst&egrave;me FreeBSD, et dont ont besoin certains 
                terminaux.</para>
	      
	    </sect4>
	  </sect3>
	  
	  <sect3 id="term-ports">
	    <title>Ports</title>
	    
	    <para>Les ports s&eacute;rie sont les p&eacute;riph&eacute;riques gr&acirc;ce auxquels 
              l'information est &eacute;chang&eacute;e entre le terminal et l'ordinateur
              FreeBSD h&ocirc;te. Cette section d&eacute;crit les diff&eacute;rents types de
              ports s&eacute;rie existant et comment ils sont adress&eacute;s par
              FreeBSD.</para>
	    
	    <sect4 id="term-portkinds">
	      <title>Types de ports</title>
	      
	      <para>Il y a diff&eacute;rents types de ports s&eacute;rie. Avant d'acheter ou
                de monter un c&acirc;ble, vous devez v&eacute;rifier qu'il soit adapt&eacute; aux
                ports de votre terminal et de votre machine FreeBSD.</para>
	      
	      <para>La plupart des terminaux ont des ports DB25. Les ordinateurs
                personnels, dont les PCs sous FreeBSD, ont des ports DB25 ou 
                DB9. Si vous avez une carte multi-ports s&eacute;rie sur votre PC,
                vous pouvez avoir des ports RJ-12 ou RJ-45.</para>
	      
	      <para>Consultez la documentation de votre mat&eacute;riel pour conna&icirc;tre
                les sp&eacute;cifications des ports que vous allez utiliser. Un coup
                d'oeil aux ports suffit souvent aussi.</para>
	      
	    </sect4>
	    
	    <sect4 id="term-portnames">
	      <title>Noms des ports</title>
	      
	      <para>Avec FreeBSD, vous acc&eacute;dez &agrave; chacun des ports s&eacute;rie par
                une entr&eacute;e dans le r&eacute;pertoire <filename>/dev</filename>. Il y
                a deux sortes d'entr&eacute;es:</para>
	      
		<itemizedlist>
		  
		  <listitem>
		    <para>Les ports d'appel entrant sont appel&eacute;s
		      <filename>/dev/ttyd<replaceable>X</replaceable></filename>
                      o&ugrave; <emphasis remap=it>X</emphasis> est le num&eacute;ro du port,
                      &agrave; partir de z&eacute;ro. Vous utilisez habituellement les ports
                      d'appel entrant pour les terminaux. Avec ces ports, la 
                      ligne s&eacute;rie doit &eacute;mettre le signal &ldquo;Data Carrier 
                      Detect&rdquo; (DCD)&nbsp;-&nbsp;d&eacute;tection de 
                      porteuse&nbsp;-&nbsp;pour qu'ils fonctionnent.</para>
		  </listitem>
		  
		  <listitem>
		    <para>Les ports d'appel sortant sont appel&eacute;s
		     <filename>/dev/cuaa<replaceable>X</replaceable></filename>.
                     Vous n'utilisez normalement pas les ports d'appel sortant 
                     pour les terminaux, mais pour les modems. Vous pouvez les
                     utiliser avec un terminal, si le c&acirc;ble s&eacute;rie ou le terminal
                     ne supportent pas le signal de d&eacute;tection de 
                     porteuse.</para>
		  </listitem>
		  
		</itemizedlist>
	      
	      <para>Reportez-vous aux pages de manuel de
                 <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry>
                 pour plus d'informations.</para>
	      
	      <para>Si vous connectez un terminal au premier port s&eacute;rie
		(<devicename>COM1</devicename> en langage DOS), vous utiliserez
                alors <filename>/dev/ttyd0</filename> pour faire r&eacute;f&eacute;rence au
                terminal. S'il est sur le second port s&eacute;rie (aussi appel&eacute;
		<devicename>COM2</devicename>), ce sera
		<filename>/dev/ttyd1</filename>, et ainsi de suite.</para>
	      
	      <para>Notez bien que vous devrez peut-&ecirc;tre configurer votre
                noyau pour y inclure le support de chaque port s&eacute;rie, en
                particulier si vous avez une carte s&eacute;rie multi-ports. Voyez
                le chapitre <link linkend="kernelconfig">Configurer le noyau
                de FreeBSD</link> pour plus d'informations.</para>
	      
	    </sect4>
	  </sect3>
	</sect2>
	
	<sect2 id="term-config">
	  <title>Configuration</title>
	  
	  <para>Cette section d&eacute;crit ce que vous devez faire pour configurer
            votre syst&egrave;me FreeBSD pour pouvoir ouvrir une session depuis un
            terminal. Elle suppose que vous avez d&eacute;j&agrave; configur&eacute; votre noyau
            pour y inclure le support du port s&eacute;rie auquel votre terminal est
            connect&eacute;&nbsp;-&nbsp;et que vous avez branch&eacute; ce dernier.</para>
	  
	  <para>En un mot, vous devez demander au programme 
            <command>init</command>, qui contr&ocirc;le le lancement et l'ex&eacute;cution
            des processus, de lancer un processus <command>getty</command>, 
            lequel se chargera de lire le nom d'utilisateur au d&eacute;but de la
            session et lancera &agrave; son tour le programme 
            <command>login</command>.</para>
	  
	  <para>Pour cela, vous devez &eacute;diter le fichier
            <filename>/etc/ttys</filename>. Commencez par utiliser 
            <command>su</command> pour devenir super-utilisateur. Modifiez
            ensuite de la fa&ccedil;on suivante <filename>/etc/ttys</filename>:</para>

	    <procedure>
	      <step>
		<para>Ajoutez &agrave; <filename>/etc/ttys</filename> une ligne pour
		  l'entr&eacute;e du r&eacute;pertoire <filename>/dev</filename> correspondant
                  au port s&eacute;rie, si elle n'y est pas d&eacute;j&agrave;.</para>
	      </step>
	      
	      <step>
		<para>Pr&eacute;cisez qu'il faut ex&eacute;cuter
                  <filename>/usr/libexec/getty</filename> sur ce port et donnez
		  le type de &ldquo;<emphasis remap=tt>getty</emphasis>&rdquo;
                  appropri&eacute;, tel qu'il est d&eacute;fini dans le fichier
		  <filename>/etc/gettytab</filename>.</para>
	      </step>
	      
	      <step>
		<para>Donnez le type de terminal par d&eacute;faut.</para>
	      </step>
	      
	      <step>
		<para>Activez le port avec &ldquo;on&rdquo;.</para>
	      </step>
	      
	      <step>
		<para>Indiquez si le port doit &ecirc;tre 
                  &ldquo;secure&rdquo;.</para>
	      </step>
	      
	      <step>
		<para>Faites relire le fichier <filename>/etc/ttys</filename>
                   par <command>init</command>.</para>
	      </step>
	    </procedure>
	  
	  <para>En option, vous pouvez d&eacute;finir un type de 
            <emphasis remap=tt>getty</emphasis> sur-mesure pour l'&eacute;tape 2 en
            ajoutant une entr&eacute;e au fichier <filename>/etc/gettytab</filename>. 
            Ce document ne vous explique pas comment le faire. Vous &ecirc;tes invit&eacute;s
            &agrave; consulter les pages de manuel de
	    <citerefentry><refentrytitle>gettytab</refentrytitle><manvolnum>5</manvolnum></citerefentry> 
            et <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> 
	    pour plus d'informations.</para>
	  
	  <para>Les sections qui suivent d&eacute;taillent chacune de ces &eacute;tapes, Dans
            l'exemple que nous prendrons pour cela, nous connecterons deux 
            terminaux &agrave; notre syst&egrave;me: un Wyse-50 et un vieil IBM PC 286 avec
            un logiciel d'&eacute;mulation de terminal compatible VT-100. Nous
            connecterons le terminal Wyse au second port s&eacute;rie et le 286 au
            sixi&egrave;me port s&eacute;rie (sur une carte multi-ports).</para>
	  
	  <para>Pour plus d'informations sur le fichier
            <filename>/etc/ttys</filename>, lisez les pages de manuel de
            <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry>.</para>
	  
	  <sect3 id="term-etcttys">
	    <title>Ajouter une entr&eacute;e &agrave; <filename>/etc/ttys</filename></title>
	    
	    <para>Vous devez d'abord ajouter une entr&eacute;e au fichier
	      <filename>/etc/ttys</filename>, &agrave; moins qu'il n'y en ait d&eacute;j&agrave;
	      une.</para>
	    
	    <para>Le fichier <filename>/etc/ttys</filename> liste tous les
              ports de votre syst&egrave;me FreeBSD sur lesquels vous voulez autoriser
              l'ouverture de session. Par exemple, la premi&egrave;re console virtuelle
	      <filename>ttyv0</filename> a une entr&eacute;e dans ce fichier. Vous 
              pouvez ouvrir une session &agrave; la console en utilisant cette entr&eacute;e.
              Il y a des entr&eacute;es dans le fichier pour les consoles virtuelles,
              les ports s&eacute;rie et les &ldquo;pseudo-tty&rdquo;s. Pour les
              terminaux physiques, n'indiquez que l'entr&eacute;e
	      <filename>/dev</filename> du port s&eacute;rie, sans le
	      &ldquo;<filename>/dev/</filename>&rdquo;.</para>
	    
	    <para>A l'installation de votre syst&egrave;me FreeBSD, le fichier
	      <filename>/etc/ttys</filename> contient les entr&eacute;es pour les
              quatre premiers ports s&eacute;rie: de <filename>ttyd0</filename> &agrave;
	      <filename>ttyd3</filename>. Si vous connectez un terminal
              &agrave; l'un de ces ports, vous n'avez pas d'entr&eacute;e &agrave; ajouter.</para>
	    
	    <PARA>Dans notre exemple, le Wyse-50 va sur le second port s&eacute;rie,
	      <filename>ttyd1</filename>, qui est d&eacute;j&agrave; dans le fichier. Il nous
              suffit d'ajouter une entr&eacute;e pour le PC 286 reli&eacute; au sixi&egrave;me port
              s&eacute;rie. Voici un extrait du fichier <filename>/etc/ttys</filename>
              apr&egrave;s que nous ayons ajout&eacute; cette nouvelle entr&eacute;e:</para>

	      <programlisting>
ttyd1   "/usr/libexec/getty std.9600"   unknown off secure
ttyd5
	      </programlisting>
	    
	  </sect3>
	  
	  <sect3 id="term-getty">
             <title>D&eacute;finir le type de    
               <emphasis remap=tt>getty</emphasis></title>
	    
	    <para>Nous devons ensuite pr&eacute;ciser quel est le programme &agrave; ex&eacute;cuter
              pour g&eacute;rer les ouvertures de session depuis le terminal. Le 
              programme standard de FreeBSD pour cela est
	      <filename>/usr/libexec/getty</filename>. C'est lui qui affiche
	      l'invite <prompt>login:</prompt>.</para>
	    
	    <para>Le programme <command>getty</command> a un argument
	      (optionnel), le type de <replaceable>getty</replaceable>. Un
	      type de <replaceable>getty</replaceable> d&eacute;crit les
	      caract&eacute;ristiques de la ligne sur laquelle est le terminal, telle
              sa vitesse en bps et le type de contr&ocirc;le de parit&eacute; utilis&eacute;.
	      le programme <command>getty</command> lit ces caract&eacute;ristiques
	      dans le fichier <filename>/etc/gettytab</filename>.</para>
	    
	    <para>Le fichier <filename>/etc/gettytab</filename> contient un
              grand nombre d'entr&eacute;es pour des terminaux anciens et d'autres
              plus r&eacute;cents. Dans presque tous les cas, les entr&eacute;es qui
              commencent par <literal>std</literal> fonctionneront avec les
              terminaux physiques. Ces entr&eacute;es ignorent le contr&ocirc;le de parit&eacute;.
              Il y a un entr&eacute;e <literal>std</literal> pour chaque vitesse en
              bps de 110 &agrave; 115200. Vous pouvez bien entendu ajouter vos propres
              entr&eacute;es &agrave; ce fichier.
	      Les pages de manuel de 
              <citerefentry><refentrytitle>gettytab</refentrytitle><manvolnum>5</manvolnum></citerefentry> 
              vous donnent plus d'informations.</para>
	    
	    <para>Quand vous d&eacute;finissez le type de 
              <replaceable>getty</replaceable> dans le fichier
              <filename>/etc/ttys</filename>, v&eacute;rifiez que les param&egrave;tres
	      de communication du terminal soient les m&ecirc;mes.</para>
	    
	    <para>Dans notre exemple, le Wyse-50 n'utilise pas de contr&ocirc;le de
              parit&eacute; et se connecte &agrave; 38400 bps. Le PC n'utilise pas de
              contr&ocirc;le de parit&eacute; et se connecte &agrave; 19200 bps. Voici le fichier
	      <filename>/etc/ttys</filename> avec les d&eacute;finitions 
              correspondantes (juste ce qui concerne les deux terminaux qui nous
	      int&eacute;ressent):</para>

	      <programlisting>
ttyd1   "/usr/libexec/getty std.38400"   unknown off secure
ttyd5   "/usr/libexec/getty std.19200"
	      </programlisting>

	    <para>Remarquez que le second champ&nbsp;-&nbsp;celui qui indique quel
	      programme ex&eacute;cuter&nbsp;-&nbsp;est entre guillemets. C'est important,
	      parce que sans cela le type donn&eacute; en argument de 
              <command>getty</command> serait interpr&eacute;t&eacute; comme troisi&egrave;me 
              champ.</para>
	    
	  </sect3>
	  
	  <sect3 id="term-deftermtype">
	    <title>D&eacute;finir le type de terminal par d&eacute;faut</title>
	    
	    <para>Le troisi&egrave;me champ du fichier <filename>/etc/ttys</filename>
              donne le type de terminal par d&eacute;faut sur le port. Pour les ports
              d'appel entrant, vous y mettez typiquement
	      &ldquo;<literal>unknown</literal>&rdquo;&nbsp;-&nbsp;inconnu&nbsp;-&nbsp;ou
              <literal>dialup</literal>&nbsp;-&nbsp;appel&nbsp;-&nbsp;parce que les 
              utilisateurs peuvent s'y connecter avec n'importe quel type de
              terminal ou de logiciel. Pour les terminaux physiques, le type
              de terminal ne varie pas, vous pouvez donc indiquer un vrai type
              de terminal dans ce champ.</para>
	    
	    <para>Habituellement, les utilisateurs emploient le programme
              <command>tset</command> depuis leur fichier
	      <filename>.login</filename> ou <filename>.profile</filename>
              pour r&eacute;cup&eacute;rer le type de terminal et demander de le pr&eacute;ciser
              si n&eacute;cessaire. En d&eacute;finissant le type de terminal dans le fichier
	      <filename>/etc/ttys</filename>, vous leur &eacute;vitez qu'on leur pose
	      cette question.</para>
	    
	    <para>Pour savoir quels types de terminaux sont reconnus par
               FreeBSD, consultez le fichier
	      <filename>/usr/share/misc/termcap</filename>. Il liste environ
              600 terminaux. Vous pouvez en ajouter si vous le d&eacute;sirez. Voyez
              les pages de manuel de 
	      <citerefentry><refentrytitle>termcap</refentrytitle><manvolnum>5</manvolnum></citerefentry> 
              pour plus d'informations.</para>
	    
	    <para>Dans notre exemple, le Wyse-50 est un terminal de type
              Wyse-50 (bien qu'il puisse &eacute;muler d'autres types de terminaux,
              nous le laisseront en mode Wyse-50). Le PC 286 PC utilise
              Procomm qui sera configur&eacute; pour &eacute;muler une VT-100. Voici les
              entr&eacute;es ad&eacute;quates, quoiqu'encore incompl&egrave;tes du fichier
	      <filename>/etc/ttys</filename>:</para>

	      <programlisting>
ttyd1   "/usr/libexec/getty std.38400"   wy50  off secure
ttyd5   "/usr/libexec/getty std.19200"   vt100
	      </programlisting>
	    
	  </sect3>
	  
	  <sect3 id="term-enable">
	    <title>Activer le port</title>
	    
	    <para>Le champ suivant de <filename>/etc/ttys</filename>, le
              quatri&egrave;me, indique s'il faut activer le port. Si vous y mettez 
	      <literal>on</literal>, alors le processus <command>init</command>
              d&eacute;marrera le programme mentionn&eacute; par le second champ,
	      <command>getty</command>, qui affichera l'invite de session.
	      Si vous y mettez <literal>off</literal>, il n'y aura pas de
	      <command>getty</command>, et donc pas d'ouverture de session
	      sur le port.</para>
	    
	    <para>Vous devez donc bien s&ucirc;r pr&eacute;ciser <literal>on</literal>
	      dans ce champ. Voici de nouveau le fichier
              <filename>/etc/ttys</filename>. Nous avons activ&eacute; les deux
	      ports avec <literal>on</literal>:</para>

	      <programlisting>
ttyd1   "/usr/libexec/getty std.38400"   wy50  on secure
ttyd5   "/usr/libexec/getty std.19200"	 vt100 on
	      </programlisting>
	    
	  </sect3>
	  
	  <sect3 id="term-secure">
	    <title>D&eacute;finir les ports s&eacute;curis&eacute;s</title>
	    
	    <para>Nous voici arriv&eacute; au dernier champ (enfin, presque: il y a
	      un indicateur <literal>window</literal> optionnel, mais nous ne
              nous en pr&eacute;ocupperons pas). Le dernier champ indique si le port 
              est s&eacute;curis&eacute;.</para>
	    
	    <para>Que veut dire &ldquo;s&eacute;curis&eacute;&rdquo;?</para>
	    
	    <para>Cela veut dire que le compte super-utilisateur (ou tout compte
	      avec un IDentifiant utilisateur de 0) peut ouvrir une session sur
              ce port.  Les ports non-s&eacute;curis&eacute;s n'autorisent pas l'ouverture de
              session super-utilisateur.</para>
	    
	    <para>Comment utiliser les ports s&eacute;curis&eacute;s et non s&eacute;curis&eacute;s?</para>
	    
	    <para>Lorsqu'un port est non s&eacute;curis&eacute;, le terminal qui y est
              connect&eacute; n'autorise pas l'ouverture de session super-utilisateur.
              Les gens qui connaissent le mot de passe super-utilisateur de
              votre syst&egrave;me FreeBSD devront d'abord se connecter sous un compte
              utilisateur ordinaire. Ils devront ensuite utiliser la commande 
	      <command>su</command> pour avoir les droits du 
              super-utilisateur.</para>
	    
	    <para>Gr&acirc;ce &agrave; cela, vous aurez deux enregistrements pour pouvoir
              rep&eacute;rer les acc&egrave;s super-utilisateur ill&eacute;gitimes: les deux
              commandes <command>login</command> et <command>su</command>
              rapportent leur emploi dans le fichier de trace syst&egrave;me 
              (les ouvertures de sessions sont aussi enregistr&eacute;es dans le 
              fichier <filename>wtmp</filename>).</para>
	    
	    <para>Lorsque le port est s&eacute;curis&eacute;, l'ouverture de session 
              super-utilisateur est autoris&eacute;e depuis le terminal. Les gens
              qui connaissent le mot de passe super-utilisateur peuvent
              directement se connecter en tant que tel.
	      Vous n'avez plus les traces potentiellement utiles de
              l'ouverture de session et de l'utilisation de
              <command>su</command>.</para>
	    
	    <para>Que devez-vous utiliser?</para>
	    
	    <para>Utilisez &ldquo;non s&eacute;curis&eacute;&rdquo;. Utilisez 
              &ldquo;non s&eacute;curis&eacute;&rdquo; <emphasis>m&ecirc;me</emphasis> pour les
              terminaux qui ne sont <emphasis>pas</emphasis> accessibles &agrave; tout
              le monde ou sont dans des locaux ferm&eacute;s &agrave; cl&eacute;. Il est facile
              d'ouvrir une session et d'utiliser <command>su</command> quand
              vous avez besoin des droits du super-utilisateur.</para>
	    
	    <para>Voici finalement les entr&eacute;es compl&egrave;tes du fichier
	      <filename>/etc/ttys</filename> accompagn&eacute;es d'un commentaire
	      qui indique o&ugrave; se trouvent les terminaux:</para>

	      <programlisting>
ttyd1   "/usr/libexec/getty std.38400"   wy50  on insecure # Cuisine
ttyd5   "/usr/libexec/getty std.19200"   vt100 on insecure # Salle de bains
	      </programlisting>
	    
	  </sect3>
	  
	  <sect3 id="term-hup">
	    <title>Obliger <command>init</command> &agrave; relire le fichier
	      <filename>/etc/ttys</filename></title>
	    
	    <para>Quand vous d&eacute;marrez FreeBSD, le premier processus,
              <command>init</command>, lit le fichier 
	      <filename>/etc/ttys</filename> et d&eacute;marre les programmes
	      list&eacute;s pour chacun des ports activ&eacute;s, pour afficher
              l'invite de session.</para>
	    
	    <para>Apr&egrave;s avoir modifi&eacute; <filename>/etc/ttys</filename>, vous
              aimeriez ne pas avoir &agrave; red&eacute;marrer le syst&egrave;me pour 
              qu'<command>init</command> voit vos modifications. C'est pourquoi
              <command>init</command> relit <filename>/etc/ttys</filename> 
              lorsqu'il re&ccedil;oit un signal SIGHUP (&ldquo;hang up&rdquo;&nbsp;-&nbsp;raccrocher).</para>
	    
	    <para>Donc, apr&egrave;s avoir sauvegard&eacute; vos modifications au fichier
	      <filename>/etc/ttys</filename>, envoyez un 
              <literal>SIGHUP</literal> &agrave; <command>init</command> en tapant:
	      <informalexample>
 	       <screen>&prompt.root; <userinput>kill -HUP 1</userinput></screen>
	      </informalexample> (Le processus <command>init</command>
	      a <emphasis>toujours</emphasis> l'IDentifiant de 
              processus 1.)</para>
	    
	    <para>Si la configuration est correcte, les c&acirc;bles en place, les 
              terminaux sous tension, vous devriez voir les invites de session.
	      Vos terminaux sont pr&ecirc;ts &agrave; &ecirc;tre utilis&eacute;s pour la premi&egrave;re 
              fois!</para>
	    
	  </sect3>
	</sect2>
	
	<sect2
	  id="term-debug">
	  <title>R&eacute;gler les probl&egrave;mes li&eacute;s &agrave; votre connection</title>
	  
	  <para>M&ecirc;me en ayant port&eacute; la plus m&eacute;ticuleuse attention aux d&eacute;tails,
             il peut toujours y avoir quelque chose qui ne va pas lorsque vous
             installez un terminal. Voici une liste de sympt&ocirc;mes et de 
             suggestions de solutions.</para>
	  
	    <variablelist>
	      <varlistentry><term>L'invite de session n'appara&icirc;t pas.</term>
		<listitem>
		  <para>V&eacute;rifiez que le terminal est branch&eacute; et sous tension. Si
                    c'est un ordinateur personnel utilis&eacute; comme terminal,
                    v&eacute;rifiez qu'il utilise bien le logiciel d'&eacute;mulation de
                    terminal sur le bon port.</para>
		  
		  <para>Assurez-vous que le c&acirc;ble est solidement raccord&eacute; sur le
                    terminal et sur la machine FreeBSD. V&eacute;rifiez que c'est le
                    bon type de c&acirc;ble.</para>
		  
		  <para>Contr&ocirc;lez que le terminal et FreeBSD utilisent la m&ecirc;me
                    vitesse en bps et le m&ecirc;me contr&ocirc;le de parit&eacute;. Si c'est un
                    terminal vid&eacute;o, v&eacute;rifiez que les contr&ocirc;les de luminosit&eacute; et
                    de contraste ne soient pas au minimum. Si c'est un terminal
                    papier, v&eacute;rifiez qu'il y ait du papier et de l'encre.</para>
		  
		  <para>V&eacute;rifiez qu'il y ait bien un processus
                    <command>getty</command> qui s'ex&eacute;cute pour ce terminal.
                    Tapez:</para>
		  
		    <informalexample>
		      <screen>&prompt.root; <userinput>ps -axww|grep getty</userinput></screen>
		    </informalexample> 
                    <para>pour avoir la liste des processus
                    <command>getty</command> actifs. Vous devriez voir une
		    entr&eacute;e pour le terminal. Par exemple, la ligne 
                    suivante:</para>
		  
		    <informalexample>
		      <screen>22189  d1  Is+    0:00.03 /usr/libexec/getty std.38400 ttyd1</screen>
		    </informalexample> 
                    <para>montre qu'il y a un <command>getty</command> qui
                    s'ex&eacute;cute sur le port s&eacute;rie <literal>ttyd1</literal> et
		    utilise l'entr&eacute;e <literal>std.38400</literal> de
		    <filename>/etc/gettytab</filename>.</para>
		  
		  <para>S'il n'y a pas de processus <command>getty</command> 
                    actif, assurez-vous que vous avez activ&eacute; le port dans
		    <filename>/etc/ttys</filename>. Avez-vous aussi bien 
		    ex&eacute;cut&eacute; <command>kill -HUP 1</command>?</para>
		</listitem>
	      </varlistentry>
	      
	      <varlistentry><term>Il y a n'importe quoi &agrave; la place de l'invite
		  de session.</term>
		
		<listitem>
		  <para>V&eacute;rifiez que le terminal et FreeBSD d&eacute;finissent la
                    m&ecirc;me vitesse et le m&ecirc;me contr&ocirc;le de parit&eacute;. Assurez-vous
                    que le processus <command>getty</command> utilise le bon
		    type de <replaceable>getty</replaceable>. Dans le cas
		    contraire, corrigez
		    <filename>/etc/ttys</filename> et ex&eacute;cutez
                    <command>kill -HUP 1</command>.</para>
		</listitem>
	      </varlistentry>
	      
	      <varlistentry><term>Les caract&egrave;res sont redoubl&eacute;s; le mot de passe
		  s'affiche quand on le tape.</term>
		
		<listitem>
		  <para>Passez le terminal (ou le logiciel d'&eacute;mulation de 
                    terminal) du mode &ldquo;half duplex&rdquo; ou &ldquo;echo
                    local&rdquo; en mode &ldquo;full
		    duplex&rdquo;.</para>
		</listitem>
	      </varlistentry>
	    </variablelist>
	  
	  
	</sect2>
      </sect1>
      
      <sect1 id="dialup">
	<title>Connexions t&eacute;l&eacute;phoniques</title>
	
	<para><emphasis>Contribution de &a.ghelmer;.</emphasis></para>
	
	<para>Ce document donne des indications sur la configuration d'un
          syst&egrave;me FreeBSD pour qu'il accepte des connexions entrantes par 
          modem. Ce document est bas&eacute; sur l'exp&eacute;rience de son auteur avec
          les versions 1.0, 1.1 et 1.1.5.1 de FreeBSD (et l'exp&eacute;rience de
          configuration de modems sur d'autres syst&egrave;mes d'exploitation de
          type Unix); il se peut cependant qu'il ne r&eacute;ponde pas &agrave; toutes
          vos questions et ne vous donne pas d'exemple suffisamment
          adapt&eacute; &agrave; votre environnement. L'auteur ne saurait &ecirc;tre tenu
          responsable des d&eacute;gats que vous causeriez &agrave; vos syst&egrave;mes ou
          des donn&eacute;es que vous perdriez en essayant de suivre les suggestions
          qui vous sont donn&eacute;es ici.</para>
	
	<sect2 id="dialup-prereqs">
	  <title>Pr&eacute;requis</title>
	  
	  <para>Pour commencer, l'auteur suppose que vous connaissez d&eacute;j&agrave;
            FreeBSD. Il vous faudra un syst&egrave;me FreeBSD install&eacute;. Vous devez
            savoir &eacute;diter des fichiers dans un environnement Unix et lire
            les pages de manuel. Comme pr&eacute;cis&eacute; plus bas, il vous faudra des
            versions pr&eacute;cises de FreeBSD, un minimum de vocabulaire et
            conna&icirc;tre les modems et le c&acirc;blage.</para>
	  
	  <sect3>
	    <title>Version de FreeBSD</title>
	    
	    <para>On suppose tout d'abord que vous utilisez la version 1.1 de
              FreeBSD ou une version ult&eacute;rieure (y compris les versions 2.x).
	      La version 1.0 de FreeBSD comportait deux pilotes de p&eacute;riph&eacute;rique
              s&eacute;rie diff&eacute;rents, ce qui complique la situation. Le pilote de
              p&eacute;riph&eacute;rique s&eacute;rie (<devicename>sio</devicename>) a aussi &eacute;t&eacute;
              largement am&eacute;lior&eacute; avec chaque version successive de FreeBSD,
              les versions plus r&eacute;centes de FreeBSD ont donc en principe des
              pilotes meilleurs et plus efficaces que les versions plus
              anciennes.</para>
	    
	  </sect3>
	  
	  <sect3>
	    <title>Terminologie</title>
	    
	    <para>Une revue rapide de la terminologie:</para>
	    
	      <variablelist>
		<varlistentry><term>bps</term>
		  <listitem>
		    <para>Bits par seconde&nbsp;-&nbsp;la vitesse &agrave; laquelle les
		      informations sont transmises.</para>
		  </listitem>
		</varlistentry>
		
		<varlistentry><term>DTE</term>
		  
		  <listitem>
		    <para>Data Terminal Equipment&nbsp;-&nbsp;dispositif de traitement
                      de donn&eacute;es&nbsp;-&nbsp;Par exemple, votre ordinateur.</para>
		  </listitem>
		</varlistentry>
		
		<varlistentry><term>DCE</term>
		  
		  <listitem>
		    <para>Data Communications Equipment&nbsp;-&nbsp;dispositif de
                      communication&nbsp;-&nbsp;votre modem.</para>
		  </listitem>
		</varlistentry>
		
		<varlistentry><term>RS-232</term>
		  
		  <listitem>
		    <para>Standard EIA pour les communications s&eacute;rie 
                      physiques.</para>
		  </listitem>
		</varlistentry>
	      </variablelist>
	    
	    <para>S'il vous faut plus d'informations sur ces termes et sur les
              transmissions de donn&eacute;es en g&eacute;n&eacute;ral, l'auteur se rappelle avoir
	      lu que la <emphasis>Bible RS-232</emphasis> (quelqu'un conna&icirc;t
              l'ISBN?) est une bonne r&eacute;f&eacute;rence.</para>
	    
	    <para>Pour parler de la vitesse de transmission des informations,
              l'auteur n'utilise pas le terme &ldquo;baud&rdquo;. Baud d&eacute;signe
              le nombre de transitions d'&eacute;tat &eacute;lectrique qui peuvent se 
              produire sur une p&eacute;riode de temps donn&eacute;e, alors que
	      &ldquo;bps&rdquo; (bits par seconde) est le terme 
              &ldquo;correct&rdquo; &agrave; employer (au moins, il ne d&eacute;range pas
              autant les adeptes de la quadri-section capillaire).</para>
	    
	  </sect3>
	  
	  <sect3>
	    <title>Modems externes vs. modems internes</title>
	    
	    <para>Les modems externes semblent plus adapt&eacute;s aux communications
              &agrave; la demande, parce qu'ils peuvent &ecirc;tre configur&eacute;s de fa&ccedil;on
              quasi-permanente gr&acirc;ce &agrave; leurs param&egrave;tres enregistr&eacute;s en m&eacute;moire
              non volatile et disposent habituellement de voyants lumineux
              qui affichent les signaux RS-232 les plus importants. Les lumi&egrave;res
              impressionnent les visiteurs, mais elles sont aussi tr&egrave;s utiles
              pour savoir si les modems fonctionnent correctement.</para>
	    
	    <para>Les modems internes ne disposent pas g&eacute;n&eacute;ralement de m&eacute;moire
              non volatile, leur configuration peut se limiter au positionnement
              de cavaliers. Quand ils disposent de voyants, ils sont 
              la plupart du temps difficilement visibles quand le boitier est
              referm&eacute;.</para>
	    
	  </sect3>
	  
	  <sect3>
	    <title>Modems et C&acirc;bles</title>
	    
	    <para>On suppose que vous avez un minumum de notions sur le
               sujet:</para> 
	    
	      <itemizedlist>
		
		<listitem>
		  <para>Vous savez connecter votre modem &agrave; votre ordinateur
                    de fa&ccedil;on &agrave; ce qu'ils puissent communiquer (&agrave; moins que vous
                    n'ayez un modem interne qui n'a pas besoin de c&acirc;ble).</para>
		</listitem>
		
		<listitem>
		  <para>Vous ma&icirc;trisez le jeu de commandes de votre modem, ou
                    savez o&ugrave; trouver les commandes dont vous avez besoin.</para>
		</listitem>
		
		<listitem>
		  <para>Vous savez configurer votre modem (a priori avec un
                    programme de communication pour terminal) de facon &agrave; d&eacute;finir
                    ses param&egrave;tres en m&eacute;moire non volatile.</para>
		</listitem>
		
	      </itemizedlist>
	    
	    <para>La premi&egrave;re &eacute;tape, connecter le modem, est g&eacute;n&eacute;ralement
              simple&nbsp;-&nbsp;la plupart des c&acirc;bles s&eacute;ries standard fonctionneront
              sans probl&egrave;me. Vous aurez besoin du c&acirc;ble avec les bons
              connecteurs (DB-25 ou DB-9, et m&acirc;le ou femelle) &agrave; chaque
              extr&eacute;mit&eacute;, et il vous faudra un c&acirc;ble DCE-&agrave;-DTE avec le
              brochage suivant:</para>
	    
	      <itemizedlist>
		
		<listitem>
		  <para>Donn&eacute;e &eacute;mise (&ldquo;Send Data&rdquo;, 
                     <abbrev>SD</abbrev>),</para>
		</listitem>
		
		<listitem>
		  <para>Donn&eacute;e re&ccedil;ue (&ldquo;Received Data&rdquo;, 
                     <abbrev>RD</abbrev>),</para>
		</listitem>
		
		<listitem>
		  <para>Demande d'&eacute;mission (&ldquo;Ready To Send&rdquo;,
                     <abbrev>RTS</abbrev>),</para>
		</listitem>
		
		<listitem>
		  <para>Pr&ecirc;t &agrave; &eacute;mettre (&ldquo;Clear To Send&rdquo;,
                     <abbrev>CTS</abbrev>),</para>
		</listitem>
		
		<listitem>
		  <para>Donn&eacute;es pr&ecirc;tes (&ldquo;Data Set Ready&rdquo;,
                     <abbrev>DSR</abbrev>),</para>
		</listitem>
		
		<listitem>
		  <para>Disponible (&ldquo;Data Terminal Ready&rdquo;,
                     <abbrev>DTR</abbrev>),</para>
		</listitem>
		
		<listitem>
		  <para>D&eacute;tection de porteuse(&ldquo;Carrier Detect&rdquo;,
                     <abbrev>CD</abbrev>),</para>
		</listitem>
		
		<listitem>
		  <para>Terre (&ldquo;Signal Ground&rdquo;,
                     <abbrev>SG</abbrev>).</para>
		</listitem>
		
	      </itemizedlist>
	    
	    <para>FreeBSD a besoin des signaux <abbrev>RTS</abbrev> et
	      <abbrev>CTS</abbrev> pour le contr&ocirc;le de flux mat&eacute;riel aux
              vitesses sup&eacute;rieures &agrave; 2400bps, du signal <abbrev>CD</abbrev> 
              pour savoir quand la ligne d&eacute;croche et quand elle raccroche et
              du signal <abbrev>DTR</abbrev> pour r&eacute;initialiser le modem en
              fin de session. Certains c&acirc;bles ne transmettent pas tous les
              signaux, donc, si vous avez des probl&egrave;mes, comme par exemple,
              si la session reste ouverte alors que la ligne a raccroch&eacute;,
              cela peut &ecirc;tre un probl&egrave;me de c&acirc;ble.</para>
	    
	    <para>Le deuxi&egrave;me pr&eacute;requis d&eacute;pend du type de modem(s) que vous
              utilisez. Si vous ne connaissez pas les commandes de votre
              modem par coeur, gardez le guide de r&eacute;f&eacute;rence ou le manuel 
              utilisateur de votre modem &agrave; port&eacute;e de main. Des exemples
              de commandes seront donn&eacute;s pour les modems externes
	      USR Sportster 14.400, qui peuvent vous servir de r&eacute;f&eacute;rence pour
              les commandes de votre propre modem.</para>
	    
	    <para>Enfin, vous devez savoir comment configurer votre modem pour
              qu'il marche correctement avec FreeBSD. Comme les autres syst&egrave;mes
              d'exploitation de type Unix, FreeBSD utilise les signaux mat&eacute;riels
              pour savoir quand la ligne a d&eacute;croch&eacute; ou raccroch&eacute; et pour 
              r&eacute;initialiser le modem quand la communication est termin&eacute;e. 
              FreeBSD vous &eacute;vite d'avoir &agrave; envoyer des commandes au modem ou
              &agrave; v&eacute;rifier ses informations d'&eacute;tat. Si vous avez l'habitude de
              connecter des modems &agrave; de syst&egrave;mes de discussions 
              (&ldquo;BBS&rdquo;) sur PC, cela vous semblera 
              peut-&ecirc;tre g&ecirc;nant.</para>
	    
	  </sect3>
	  
	  <sect3>
	    <title>A propos de l'interface s&eacute;rie</title>
	    
	    <para>FreeBSD supporte les interfaces de communication construites
              autour des NS8250, NS16450, NS16550, et NS16550A EIA RS-232C 
              (CCITT V.24). Les p&eacute;riph&eacute;riques 8250 et 16450 ont des tampon d'un
              caract&egrave;re. Le 16550 a un tampon de 16 caract&egrave;res, qui offre de
              meilleures performances. (Un bogue dans la version 16650 emp&ecirc;che
              de se servir du tampon de 16 caract&egrave;res, utilisez donc si possible
              le mod&egrave;le 16650A). Parce qu'un tampon d'un seul caract&egrave;re demande
              plus de traitement au syst&egrave;me d'exploitation qu'un tampon de 16
              caract&egrave;res, les cartes &agrave; base de 16650A sont recommand&eacute;es. Si le
              syst&egrave;me a de nombreux ports s&eacute;rie actifs ou si la charge doit &ecirc;tre
              importante, les cartes 16650A sont pr&eacute;f&eacute;rables pour avoir un taux
              d'erreur de communication plus faible.</para>
	    
	  </sect3>
	</sect2>
	
	<sect2>
	  <title>R&eacute;sum&eacute;</title>
	  
	  <para>Voici comment FreeBSD accepte des communications t&eacute;l&eacute;phoniques
            entrantes. Un processus <command>getty</command>, lanc&eacute; par
	    <command>init</command>, attend patiemment le moment d'ouvrir le
	    port s&eacute;rie qui lui est assign&eacute; (<filename>/dev/ttyd0</filename>,
            dans notre exemple). On peut le voir avec la commande
	    <command>ps ax</command>:</para>
	  
	    <informalexample>
	      <screen> 4850 ??  I      0:00.09 /usr/libexec/getty V19200 ttyd0</screen>
	    </informalexample>
	  
	  <para>Quand un utilisateur appelle, la connexion s'&eacute;tablit avec le
            modem. Le modem active le signal <abbrev>CD</abbrev>. Le noyau
            s'aper&ccedil;oit qu'une porteuse a &eacute;t&eacute; d&eacute;tect&eacute;e et ouvre le port via 
            <command>getty</command>. <command>getty</command> envoie l'invite
            <prompt>login:</prompt> &agrave; la vitesse initialement d&eacute;finie pour cette
            ligne. <command>getty</command> attend de recevoir des caract&egrave;res
            valides, et si, dans un configuration habituelle, il re&ccedil;oit
            n'importe quoi (probablement parce que la vitesse du modem et celle
	    de <command>getty</command> ne sont pas identiques), 
            <command>getty</command> essaie d'ajuster la vitesse jusqu'&agrave; ce 
            qu'il re&ccedil;oive des caract&egrave;res qui paraissent sens&eacute;s.</para>
	  
	  <para>Souhaitons que <command>getty</command> trouve la bonne vitesse
            et que l'utilisateur obtienne l'invite <prompt>login:</prompt>.
	    Une fois que l'utilisateur a r&eacute;pondu par son nom, 
            <command>getty</command> ex&eacute;cute
	    <filename>/usr/bin/login</filename>, qui termine l'ouverture de la
            session en demandant &agrave; l'utilisateur son mot de passe et en lan&ccedil;ant
            l'interpr&eacute;teur de commandes affect&eacute; &agrave; cet utilisateur.</para>
	  
	  <para>Passons donc &agrave; la configuration...</para>
	  
	</sect2>
	
	<sect2>
	  <title>Configuration du noyau</title>
	  
	  <para>Les noyaux de FreeBSD sont habituellement livr&eacute;s pr&ecirc;ts &agrave;
            tester la pr&eacute;sence de quatre ports s&eacute;rie, connus dans le monde
	    PC-DOS sous les noms de <devicename>COM1:</devicename>,
            <devicename>COM2:</devicename>, <devicename>COM3:</devicename>, 
            et <devicename>COM4:</devicename>. FreeBSD peut aussi g&eacute;rer les 
            cartes s&eacute;rie multi-ports &ldquo;passives&rdquo;, comme les cartes
            Boca 1008 et 2016 (reportez-vous s'il vous pla&icirc;t aux pages de manuel
            de <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> 
            pour avoir des informations sur la configuration du noyau si vous
            avez une carte s&eacute;rie multi-ports). Le noyau par d&eacute;faut ne recherche,
            quant &agrave; lui, que les ports COM standards.</para>
	  
	  <para>Pour v&eacute;rifier si votre noyau reconna&icirc;t vos ports s&eacute;rie,
            regardez les messages au d&eacute;marrage de votre syst&egrave;me, ou employez
            la commande <command>/sbin/dmesg</command> pour les lister ensuite.
	    Cherchez en particulier les messages qui commencent par
	    <literal>sio</literal>. Tuyau: pour ne voir que les messages qui
            comportent le mot <literal>sio</literal>, utilisez la 
            commande:</para>
	  
	    <informalexample>
	      <screen>&prompt.root; <userinput>/sbin/dmesg | grep 'sio'</userinput></screen>
	    </informalexample>
	  
	  <para>Par exemple, sur un syst&egrave;me avec quatre ports s&eacute;rie, voici les
            messages de d&eacute;marrage du noyau qui concernent les ports 
            s&eacute;rie:</para> 
	  
	    <informalexample>
	      <screen>sio0 at 0x3f8-0x3ff irq 4 on isa
sio0: type 16550A
sio1 at 0x2f8-0x2ff irq 3 on isa
sio1: type 16550A
sio2 at 0x3e8-0x3ef irq 5 on isa
sio2: type 16550A
sio3 at 0x2e8-0x2ef irq 9 on isa
sio3: type 16550A</screen>
	    </informalexample>
	  
	  <para>Si votre noyau ne reconnait pas tous vos ports s&eacute;rie, vous
            devrez probablement recompiler un noyau sur mesure pour votre
            syst&egrave;me.</para>
	  
	  <para>Lisez le chapitre du Manuel de l'Administrateur Syst&egrave;me BSD sur
	    &ldquo;G&eacute;n&eacute;rer les noyaux Berkeley avec Config&rdquo; [que vous
	    trouverez dans le r&eacute;pertoire 
            <filename>/usr/src/share/doc/smm</filename>] et les &ldquo;Options
            de Configuration de FreeBSD&rdquo; [dans 
            <filename>/sys/conf/options</filename> et dans
	    <filename>/sys/<replaceable>arch</replaceable>/conf/options.<replaceable>arch</replaceable></filename>, 
            ou <emphasis>arch</emphasis> vaut par exemple 
            <filename>i386</filename>] pour plus d'informations sur la 
            configuration et la recompilation des noyaux. Vous devrez peut-&ecirc;tre
            installer les sources du noyau, si vous ne l'avez pas d&eacute;j&agrave; fait,
            (<filename>srcdist/srcsys.??</filename> pour FreeBSD 1.1,
            <filename>srcdist/sys.??</filename> pour FreeBSD 1.1.5.1,
            ou les sources de toute la distribution pour FreeBSD 2.0) pour
            pouvoir configurer et recompiler des noyaux.</para>
	  
	  <para>Cr&eacute;ez un fichier de configuration du noyau pour votre syst&egrave;me
            (si vous ne l'avez pas d&eacute;j&agrave; fait) en allant dans le r&eacute;pertoire
	    <filename>/sys/i386/conf</filename>. Puis si, vous cr&eacute;ez un nouveau
            fichier de configuration, copiez le fichier
	    <filename>GENERICAH</filename> (ou <filename>GENERICBT</filename>,
	    si vous avez un contr&ocirc;leur SCSI BusTek avec FreeBSD 1.x) dans
	    <filename>VOTRESYS</filename>, o&ugrave; <filename>VOTRESYS</filename>
	    est le nom de votre syst&egrave;me, en majuscules. Editez le fichier, et
            modifiez les lignes:</para>
	  
	  <programlisting>
device		sio0	at isa? port "IO_COM1" tty irq 4 vector siointr
device		sio1	at isa? port "IO_COM2" tty irq 3 vector siointr
device		sio2	at isa? port "IO_COM3" tty irq 5 vector siointr
device		sio3    at isa? port "IO_COM4" tty irq 9 vector siointr
	  </programlisting>
	  
	  <para>Vous pouvez commenter ou supprimer les lignes pour les
            p&eacute;riph&eacute;riques que vous n'avez pas. Si vous avez une carte
            s&eacute;rie multi-ports, comme la carte Boca BB2016, reportez-vous 
            s'il vous pla&icirc;t aux pages de manuel de
	    <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry>
            pour avoir des informations compl&egrave;tes sur les lignes de 
            configuration pour les cartes s&eacute;rie multi-ports. Faites attention
            si vous partez d'un fichier de configuration utilis&eacute; pour une
            version ant&eacute;rieure de FreeBSD, parce que les indicateurs associ&eacute;s
            au p&eacute;riph&eacute;rique peuvent avoir chang&eacute; d'une version &agrave; l'autre.</para>

	  <note>
	    <para><literal>port "IO_COM1"</literal> est l'&eacute;quivalent de
	      <literal>port 0x3f8</literal>,
	      <symbol>IO_COM2</symbol> de <literal>0x2f8</literal>,
	      <symbol>IO_COM3</symbol> de <literal>0x3e8</literal> et
	      <symbol>IO_COM4</symbol> de <literal>0x2e8</literal>, qui sont
              les adresses respectives les plus courantes de ces ports s&eacute;rie;
	      les interruptions 4, 3, 5, et 9 sont les lignes d'interruption
              utilis&eacute;es habituellement. Notez aussi que les ports s&eacute;rie 
              ordinaires <emphasis>ne peuvent pas</emphasis> partager 
              d'interruption sur le bus ISA (les cartes multi-ports int&egrave;grent
              l'&eacute;lectronique n&eacute;cessaire pour permettre au 16550A de la carte de
              partager une ou deux lignes d'interruption).</para>
	  </note>
	  
	  <para>Quand vous avez termin&eacute; de corriger votre fichier de 
            configuration du noyau, utilisez le programme
	    <command>config</command> en suivant la documentation fournie par
	    &ldquo;G&eacute;n&eacute;rer les noyaux Berkeley avec Config&rdquo; et les pages
            de manuel de
	    <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> 
            pour cr&eacute;er le r&eacute;pertoire de compilation du noyau, puis compilez,
            intallez et testez votre nouveau noyau.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Fichiers sp&eacute;ciaux de p&eacute;riph&eacute;rique</title>
	  
	  <para>La plupart des p&eacute;riph&eacute;riques g&eacute;r&eacute;s par le noyau sont adress&eacute;s
          par l'interm&eacute;diaire de &ldquo;fichiers sp&eacute;ciaux de 
          p&eacute;riph&eacute;rique&rdquo;, qui se trouvent dans le r&eacute;pertoire
	  <filename>/dev</filename>. Les p&eacute;riph&eacute;riques
          <devicename>sio</devicename> sont adress&eacute;s via 
	  <filename>/dev/ttyd<replaceable>?</replaceable></filename> (liaisons
          entrantes) et
	  <filename>/dev/cua0<replaceable>?</replaceable></filename> (liaisons
          sortantes). Avec les versions 1.1.5 et ult&eacute;rieures de FreeBSD,
          il y a aussi des fichiers sp&eacute;ciaux d'initialisation
	  (<filename>/dev/ttyid<replaceable>?</replaceable></filename> et
	   <filename>/dev/cuai0<replaceable>?</replaceable></filename>) et
          des fichiers sp&eacute;ciaux de verrouillage
	  (<filename>/dev/ttyld<replaceable>?</replaceable></filename> et
	   <filename>/dev/cual0<replaceable>?</replaceable></filename>). Les
          fichiers d'initialisation sont utilis&eacute;s pour initialiser les 
          param&egrave;tres de communication du port chaque fois qu'il est ouvert,
	  comme <literal remap="tt">crtscts</literal> pour les modems qui
          emploient les signaux <literal>CTS/RTS</literal> pour le contr&ocirc;le
          de flux. Les fichiers de verrouillage sont utilis&eacute;s pour 
          verrouiller des indicateurs sur les ports pour emp&ecirc;cher les 
          utilisateurs ou les programmes de modifier certains param&egrave;tres; voyez
          les pages de manuel de
          <citerefentry><refentrytitle>termios</refentrytitle><manvolnum>4</manvolnum></citerefentry>, 
          <citerefentry><refentrytitle>sio</refentrytitle><manvolnum>4</manvolnum></citerefentry> et 
          <citerefentry><refentrytitle>stty</refentrytitle><manvolnum>1</manvolnum></citerefentry> 
          pour plus d'informations sur le param&eacute;trage des terminaux, le
          verrouillage et l'initialisation des p&eacute;riph&eacute;riques et la d&eacute;finition
          des options pour les terminaux, respectivement.</para>
	  
	  <sect3>
	    <title>Cr&eacute;er les fichiers sp&eacute;ciaux de p&eacute;riph&eacute;rique</title>
	    
	    <para>La proc&eacute;dure <command>MAKEDEV</command> du r&eacute;pertoire
	      <filename>/dev</filename> g&egrave;re les fichiers sp&eacute;ciaux de 
	      p&eacute;riph&eacute;rique. (Les pages de manuel 
              <citerefentry><refentrytitle>MAKEDEV</refentrytitle><manvolnum>8</manvolnum></citerefentry> 
              de FreeBSD 1.1.5 comportent pas mal d'erreurs sur ce qui concerne 
	      les ports <acronym>COM</acronym>, donc ignorez-les.) Pour utiliser
	      <command>MAKEDEV</command> pour cr&eacute;er les fichiers sp&eacute;ciaux de
              p&eacute;riph&eacute;rique pour les connexions sur
	      <devicename>COM1:</devicename> (port 0), allez avec
              <command>cd</command> dans <filename>/dev</filename> et tapez la
	      commande <command>MAKEDEV ttyd0</command>. De m&ecirc;me, pour cr&eacute;er
              les fichiers sp&eacute;ciaux de p&eacute;riph&eacute;rique pour  
	      <devicename>COM2:</devicename> (port 1), utilisez
              <command>MAKEDEV ttyd1</command>.</para>
	    
	    <para>La commande <command>MAKEDEV</command> ne cr&eacute;e pas uniquement 
              les fichiers 
              <filename>/dev/ttyd<replaceable>?</replaceable></filename>,
              mais aussi les fichiers
	      <filename>/dev/cua0<replaceable>?</replaceable></filename> 
              (et tous les fichiers d'initialisation et de verrouillage &agrave; partir
              de la version 1.1.5 de FreeBSD)
	      et supprime le fichier sp&eacute;cial pour le terminal physique
	      <filename>/dev/tty0<replaceable>?</replaceable></filename>, 
              s'il existe.</para>
	    
	    <para>Apr&egrave;s avoir cr&eacute;&eacute; les nouveaux fichiers sp&eacute;ciaux de 
              p&eacute;riph&eacute;rique, v&eacute;rifiez les droits sur ces fichiers (en 
              particulier sur les fichiers <filename>/dev/cua*</filename>)
              pour vous assurer que seuls les utilisateurs qui doivent y
              acc&eacute;der peuvent lire et &eacute;crire dessus&nbsp;-&nbsp;vous ne voulez
              probablement pas que l'utilisateur ordinaire puisse utiliser
              vos modems pour se connecter &agrave; l'ext&eacute;rieur. Les autorisations
              par d&eacute;faut sur les fichiers <filename>/dev/cua*</filename> 
              devraient suffire:</para>
	    
	    <informalexample>
	      <screen>crw-rw----    1 uucp     dialer    28, 129 Feb 15 14:38 /dev/cua01
crw-rw----    1 uucp     dialer    28, 161 Feb 15 14:38 /dev/cuai01
crw-rw----    1 uucp     dialer    28, 193 Feb 15 14:38 /dev/cual01</screen>
	    </informalexample>
	    
	    <para>Ces droits autorisent l'utilisateur <username>uucp</username>
	      et les utilisateurs du groupe <username>dialer</username> &agrave; se
              servir des p&eacute;riph&eacute;riques d'appel vers l'ext&eacute;rieur.</para>
	    
	  </sect3>
	</sect2>
	
	<sect2>
	  <title>Fichiers de Configuration</title>
	  
	  <para>Il y a trois fichiers de configuration du syst&egrave;me dans le
            r&eacute;pertoire <filename>/etc</filename> que vous devrez probablement
            &eacute;diter pour autoriser les acc&egrave;s t&eacute;l&eacute;phoniques &agrave; votre syst&egrave;me
            FreeBSD. Le premier, <filename>/etc/gettytab</filename>, contient
            les informations de configuration pour le &ldquo;d&eacute;mon&rdquo;
	    <filename>/usr/libexec/getty</filename>. Le second,
	    <filename>/etc/ttys</filename> contient les informations qui disent
	    &agrave; <filename>/sbin/init</filename> sur quels p&eacute;riph&eacute;riques
	    <filename>tty</filename> doivent s'ex&eacute;cuter des processus
            <command>getty</command>. Enfin, vous pouvez mettre les commandes
            d'initialisation de ports dans la proc&eacute;dure
	    <filename>/etc/rc.serial</filename> si vous utilisez FreeBSD
	    1.1.5.1 ou ult&eacute;rieurs; sinon, vous pouvez initialiser les ports
	    dans la proc&eacute;dure <filename>/etc/rc.local</filename>.</para>
	  
	  <para>Il y a deux &eacute;coles de pens&eacute;e pour ce qui concerne la 
            configuration des modems sous Unix. La premi&egrave;re pr&eacute;f&egrave;re
            configurer ses syst&egrave;mes et ses modems de fa&ccedil;on &agrave; ce que quelque 
            soit la vitesse &agrave; laquelle l'utilisateur se connecte, l'interface
	    RS-232 entre le syst&egrave;me et le modem travaille toujours &agrave; la m&ecirc;me
            vitesse. L'avantage de cette m&eacute;thode est que l'utilisateur distant
            obtient toujours imm&eacute;diatement l'invite de session. L'inconv&eacute;nient
            est que le syst&egrave;me ne sait pas quelle est la vitesse r&eacute;elle de la
            connexion, de sorte que les programmes plein-&eacute;cran comme Emacs
            n'adaptent pas leur mode d'affichage pour am&eacute;liorer leurs temps de
            r&eacute;ponse avec des connexions lentes.</para>
	  
	  <para>L'autre &eacute;cole configure les interfaces RS-232 de ses modems de
            fa&ccedil;on &agrave; ce qu'elles adaptent leur vitesse en fonction de la vitesse
            de la connexion de l'utilisateur. Par exemple, les connexions
	    V.32bis (14.4 Kbps) au modem feront fonctionner l'interface RS-232
	    du modem &agrave; 19.2 Kbps, alors que les connexions &agrave; 2400 bps la feront
	    fonctionner &agrave; 2400 bps. Comme <command>getty</command> ne comprend
            pas les informations que fournit le modem sur sa vitesse,
	    <command>getty</command> affiche le message <prompt>login:</prompt>
            &agrave; la vitesse initiale et consulte la r&eacute;ponse qu'il re&ccedil;oit. Si les
            utilisateurs voient n'importe quoi, ils sont cens&eacute;s savoir qu'ils
            doivent appuyer sur la touche <literal>&lt;Entr&eacute;e&gt;</literal>
            jusqu'&agrave; ce qu'ils obtiennent une invite lisible. Si les vitesses
            ne correspondent pas, <command>getty</command> re&ccedil;oit n'importe
            quoi quoi que l'utilisateur tape, essaie de passer &agrave; la vitesse
            suivante et renvoie l'invite <prompt>login:</prompt>. Cela peut
            durer ind&eacute;finiment, mais il suffit normalement d'un ou deux essais
            pour que l'utilisateur obtienne le message correct. Bien entendu,
            cette m&eacute;thode d'ouverture de session n'est pas aussi propre que la
            premi&egrave;re, mais un utilisateur dont la connexion est lente obtiendra
            de meilleurs temps de r&eacute;ponse des logiciels plein-&eacute;cran.</para>
	  
	  <para>L'auteur essaiera de donner des informations de configuration
            objectives, mais la m&eacute;thode qui consiste &agrave; ajuster la vitesse
            du modem &agrave; celle de la connexion a sa pr&eacute;f&eacute;rence.</para>
	  
	  <sect3>
	    <title><filename>/etc/gettytab</filename></title>
	    
	    <para><filename>/etc/gettytab</filename> est un fichier de type
              <citerefentry><refentrytitle>termcap</refentrytitle><manvolnum>5</manvolnum></citerefentry>
              qui contient les informations de configuration de
	      <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry>. 
              Reportez-vous s'il vous pla&icirc;t aux pages de manuel de
	      <citerefentry><refentrytitle>gettytab</refentrytitle><manvolnum>5</manvolnum></citerefentry>
              pour une description compl&egrave;te du format de ce fichier et la liste
              des fonctionnalit&eacute;s.</para>
	    
	    <sect4>
	      <title>Configuration &agrave; vitesse fix&eacute;e</title>
	      
	      <para>Si vous verrouillez la vitesse de communication avec votre
                modem &agrave; une valeur donn&eacute;e, vous n'aurez probablement pas &agrave;
                modifier le fichier <filename>/etc/gettytab</filename>.</para>
	      
	    </sect4>
	    
	    <sect4>
	      <title>Configuration avec adaptation de la vitesse</title>
	      
	      <para>Vous devrez d&eacute;finir une entr&eacute;e dans
		<filename>/etc/gettytab</filename> pour fournir &agrave;
                <command>getty</command> des informations sur la vitesse &agrave;
                laquelle vous voulez utiliser votre modem. Si vous avez un modem
		2400 bps, vous pouvez probablement utiliser l'entr&eacute;e
                <literal>D2400</literal>. Cette entr&eacute;e existe d&eacute;j&agrave; dans le 
                fichier <filename>gettytab</filename> de FreeBSD 1.1.5.1, vous
                n'avez pas besoin de l'ajouter, &agrave; moins qu'elle n'existe pas 
                dans votre version de FreeBSD:</para> 
	      
	      <programlisting>
#
# Terminaux (via t&eacute;l&eacute;phone) rapides
# s&eacute;lection 2400/1200/300 (dans l'un ou l'autre sens)
#
D2400|d2400|Acc&egrave;s-Rapide-2400:\
        :nx=D1200:tc=2400-baud:
3|D1200|Acc&egrave;s-Rapide-1200:\
        :nx=D300:tc=1200-baud:
5|D300|Acc&egrave;s-Rapide-300:\
        :nx=D2400:tc=300-baud:
	      </programlisting>
	      
	      <para>Si vous avez un modem plus rapide, vous devrez certainement
		ajouter une entr&eacute;e &agrave; <filename>/etc/gettytab</filename>; voici
                ce que vous pourriez utiliser pour un modem &agrave; 14.4 Kbps pour
                une vitesse maximum de l'interface de 19.2 Kbps:</para>
	      
	      <programlisting>
#
# Ajouts pour un modem V.32bis
#
um|V300|Modem Grande Vitesse &agrave; 300,8-bit:\
        :nx=V19200:tc=std.300:
un|V1200|Modem Grande Vitesse &agrave; 1200,8-bit:\
        :nx=V300:tc=std.1200:
uo|V2400|Modem Grande Vitesse &agrave; 2400,8-bit:\
        :nx=V1200:tc=std.2400:
up|V9600|Modem Grande Vitesse &agrave; 9600,8-bit:\
        :nx=V2400:tc=std.9600:
uq|V19200|Modem Grande Vitesse &agrave; 19200,8-bit:\
        :nx=V9600:tc=std.19200:
	      </programlisting>
	      
	      <para>Avec FreeBSD 1.1.5 et ult&eacute;rieurs, cela donnera une connexion
                8-bit sans contr&ocirc;le de parit&eacute;. Avec FreeBSD 1.1, ajoutez les
                param&egrave;tres <literal>:np:</literal> aux entr&eacute;es 
                <literal>std.<replaceable>xxx</replaceable></literal>
		en d&eacute;but de fichier, pour 8 bits, sans parit&eacute;; sinon, le
                param&egrave;trage par d&eacute;faut est &agrave; 7 bits, parit&eacute; paire.</para>
	      
	      <para>Avec l'exemple ci-dessus, la communication se fait 
                initialement &agrave; 19.2 Kbps (pour une connexion V.32bis), puis
                passe &agrave; 9600 bps (pour V.32), 2400 bps, 1200 bps, 300 bps, et de
                nouveau &agrave; 19.2 Kbps. Ce parcours des vitesses est impl&eacute;ment&eacute;  
                par la fonctionnalit&eacute; <literal>nx=</literal> (&ldquo;next
		table&rdquo;&nbsp;-&nbsp;table suivante). Chaque ligne 
                comporte une entr&eacute;e <literal>tc=</literal> (&ldquo;table
		continuation&rdquo;&nbsp;-&nbsp;suite de la table) pour utiliser
                le reste de la configuration &ldquo;standard&rdquo; pour
                une vitesse donn&eacute;e.</para>
	      
	      <para>Si vous avez un modem &agrave; 28.8 Kbps modem et/ou voulez 
                profiter de la compression sur un modem &agrave; 14.4 Kbps, 
                vous devez utiliser une vitesse de communication sup&eacute;rieure &agrave;
		19.2 Kbps. Voici un exemple d'entr&eacute;e
                <filename>gettytab</filename> commen&ccedil;ant &agrave; 57.6 Kbps:</para>
	      
	      <programlisting>
#
# Ajout pour un modem V.32bis ou V.34
# On commence &agrave; 57.6 Kbps
#
vm|V300|Modem Tr&egrave;s Grande Vitesse &agrave; 300,8-bit:\
        :nx=V19200:tc=std.300:
vn|V1200|Modem Tr&egrave;s Grande Vitesse &agrave; 1200,8-bit:\
        :nx=V300:tc=std.1200:
vo|V2400|Modem Tr&egrave;s Grande Vitesse &agrave; 2400,8-bit:\
        :nx=V1200:tc=std.2400:
vp|V9600|Modem Tr&egrave;s Grande Vitesse &agrave; 9600,8-bit:\
        :nx=V2400:tc=std.9600:
vq|V57600|Modem Tr&egrave;s Grande Vitesse &agrave; 57600,8-bit:\
        :nx=V2400:tc=std.9600:
	      </programlisting>
	      
	      <para>Si vous avez une CPU lente ou un syst&egrave;me tr&egrave;s charg&eacute; et pas
		de port s&eacute;rie &agrave; base de 16550, vous aurez peut-&ecirc;tre des erreurs
		&ldquo;silo&rdquo; de sio &agrave; 57.6 Kbps.</para>
	      
	    </sect4>
	  </sect3>
	  
	  <sect3
	    id="dialup-ttys">
	    <title><filename>/etc/ttys</filename></title>
	    
	    <para><filename>/etc/ttys</filename> est la liste des
              <filename>ttys</filename> qu'<command>init</command> doit g&eacute;rer.
	      <filename>/etc/ttys</filename> fournit aussi des informations
	       de s&eacute;curit&eacute; &agrave; <command>login</command> (le super-utilisateur
	      <username>root</username> ne peut ouvrir de session que sur des
              <filename>ttys</filename> mentionn&eacute;s comme
	      <literal>secure</literal>). Voyez les pages de manuel de
	      <citerefentry><refentrytitle>ttys</refentrytitle><manvolnum>5</manvolnum></citerefentry> pour plus d'informations.</para>
	    
	    <para>Vous devrez soit modifier les lignes existantes de
	      <filename>/etc/ttys</filename>, soit ajouter de nouvelles lignes,
              pour qu'<command>init</command> ex&eacute;cute automatiquement
              les processus <command>getty</command> sur vos nouveaux ports
	      d'appel. Le format g&eacute;n&eacute;ral de la ligne sera le m&ecirc;me, que vous
              utilisiez une configuration avec vitesse verrouilll&eacute;e ou 
	      non:</para>
	    
		<programlisting>
ttyd0   "/usr/libexec/getty xxx"   dialup on
	      </programlisting>
	    
	    <para>Le premier champ de la ligne ci-dessus est le fichier sp&eacute;cial
	      de p&eacute;riph&eacute;rique pour cette entr&eacute;e - <literal>ttyd0</literal> 
              signifie que <filename>/dev/ttyd0</filename> est le fichier que ce
              <command>getty</command> surveillera. Le second champ,
	      <literal>"/usr/libexec/getty
		<replaceable>xxx</replaceable>"</literal>
	      (<replaceable>xxx</replaceable> est &agrave; remplacer par la 
              fonctionnalit&eacute; initiale de <filename>gettytab</filename>) est le
	      processus qu'<command>init</command> lancera pour ce p&eacute;riph&eacute;rique.
	      Le troisi&egrave;me champ, <literal>dialup</literal>, est le type de
              terminal par d&eacute;faut. Le quatri&egrave;me param&egrave;tre,
	      <literal>on</literal>, indique &agrave; <command>init</command> que cette
              ligne est op&eacute;rationnelle. Il peut y avoir un cinqui&egrave;me param&egrave;tre,
	      <literal>secure</literal>, mais il ne faut l'utiliser que pour
              les terminaux qui sont physiquement &ldquo;s&eacute;curis&eacute;s&rdquo;, 
              comme la console syst&egrave;me.</para>
	    
	    <para>Le type de terminal par d&eacute;faut (<literal>dialup</literal> dans
              l'exemple pr&eacute;c&eacute;dent) peut d&eacute;pendre de vos pr&eacute;f&eacute;rences.
	      <literal>dialup</literal> est le terminal
              par d&eacute;faut traditionnel pour les lignes t&eacute;l&eacute;phoniques, de fa&ccedil;on
              &agrave; ce que les utilisateurs puissent adapter leur proc&eacute;dure 
              d'ouverture de session pour qu'elle sache que c'est un terminal
	      <literal>dialup</literal> et ajuste en cons&eacute;quence son type de
	      de terminal. L'auteur pr&eacute;f&egrave;re quant &agrave; lui utiliser
	      <literal>vt102</literal> comme type de terminal par d&eacute;faut sur
              son site, car ses utilisateurs emploient l'&eacute;mulation VT102 sur
              leurs syst&egrave;mes distants.</para>
	    
	    <para>Apr&egrave;s avoir modifi&eacute;
	      <filename>/etc/ttys</filename>, vous pouvez envoyer au processus
              <command>init</command> un signal <acronym>HUP</acronym>
              pour qu'il relise le fichier. Utilisez la commande:</para>
	    
	    <informalexample>
	      <screen>&prompt.root; <userinput>kill -1 1</userinput></screen>
	    </informalexample>
	    
	    <para>pour envoyer ce signal. Si c'est la premi&egrave;re fois que vous
              configurer ce syst&egrave;me, vous pouvez toutefois attendre que vos
              modems soient correctement configur&eacute;s et connect&eacute;s avant 
              d'envoyer un signal &agrave; <command>init</command>.</para>
	    
	    <sect4>
	      <title>Configuration &agrave; vitesse fix&eacute;e</title>
	      
	      <para>Dans une configuration o&ugrave; la vitesse est fix&eacute;e, il faut
                une entr&eacute;e destin&eacute;e &agrave; <command>getty</command> dans le fichier
                <filename>ttys</filename>. Avec un modem pour lequel la vitesse
                du port s&eacute;rie est fix&eacute;e &agrave; 19.2 Kbps, l'entr&eacute;e de
		<filename>ttys</filename> ressemblera &agrave;:</para>
	      
	      <programlisting>
ttyd0   "/usr/libexec/getty std.19200"   dialup on
	      </programlisting>
	      
	      <para>Si vous utilisez une vitesse diff&eacute;rente, remplacez
                l'entr&eacute;e <literal>std.19200</literal> par l'entr&eacute;e
                <literal>std.<replaceable>vitesse</replaceable></literal>
                appropri&eacute;e &agrave; la vitesse de transmission de votre modem
                d'apr&egrave;s la d&eacute;finition qui en est donn&eacute;e dans le fichier
                <filename>/etc/gettytab</filename>.</para>
	      
	    </sect4>
	    
	    <sect4>
	      <title>Configuration avec adaptation de la vitesse</title>
	      
	      <para>Dans une configuration o&ugrave; la vitesse s'adapte &agrave; celle
                de la connexion, l'entr&eacute;e dans votre fichier
                <filename>ttys</filename> doit faire r&eacute;f&eacute;rence &agrave; l'entr&eacute;e
		&ldquo;auto-baud&rdquo; (sic) initiale de
		<filename>/etc/gettytab</filename>. Avec l'exemple donn&eacute;
                plus haut pour une configuration avec adaptation de la
                vitesse commen&ccedil;ant &agrave; 19.2 Kbps (entr&eacute;e de 
		<filename>gettytab</filename> avec <literal>V19200</literal>
                pour point de d&eacute;part), l'entr&eacute;e de
		<filename>ttys</filename> ressemblera &agrave;:</para>
	      
	      <programlisting>
ttyd0   "/usr/libexec/getty V19200"   dialup on
	      </programlisting>
	    </sect4>
	  </sect3>
	  
	  <sect3>
	    <title><filename>/etc/rc.serial</filename> ou
	      <filename>/etc/rc.local</filename></title>
	    
	    <para>Les modems &agrave; haut d&eacute;bit, comme les modems V.32, V.32bis, 
              et V.34, doivent utiliser le contr&ocirc;le de flux mat&eacute;riel
	      (<filename>RTS/CTS</filename>). Vous pouvez ajouter des commandes
	      <command>stty</command> dans <filename>/etc/rc.serial</filename>,
              pour  FreeBSD 1.1.5.1 et ult&eacute;rieurs, ou
	      <filename>/etc/rc.local</filename> pour FreeBSD 1.1, pour
              positionner l'indicateur de contr&ocirc;le de flux mat&eacute;riel du noyau
	      de FreeBSD sur les ports o&ugrave; sont les modems.</para>
	    
	    <para>Voici un extrait d'un fichier 
	      <filename>/etc/rc.serial</filename> d'exemple pour un syst&egrave;me
                 FreeBSD 1.1.5.1:</para>
	    
	    <programlisting>
#!/bin/sh
#
# Configuration initiale des ports s&eacute;rie

stty -f /dev/ttyid1 crtscts
stty -f /dev/cuai01 crtscts
	    </programlisting>
	    	    
	    <para>Cela positionne l'indicateur <literal>crtscts</literal> 
              de <literal>termios</literal> pour les fichiers sp&eacute;ciaux
              d'initialisation des connexions entrantes et sortantes 
              sur le port s&eacute;rie num&eacute;ro 1
              (<devicename>COM2:</devicename>).</para>
	    
	    <para>Sur un vieux syst&egrave;me FreeBSD 1.1, ces entr&eacute;es devaient
              &ecirc;tre ajout&eacute;es au fichier <filename>/etc/rc.local</filename> pour
              positionner l'indicateur <literal>crtscts</literal> pour les
              p&eacute;riph&eacute;riques:</para>
	    
	    <programlisting>
# Configurer les ports s&eacute;rie pour utiliser le contr&ocirc;le de flux RTS/CTS
stty -f /dev/ttyd0 crtscts
stty -f /dev/ttyd1 crtscts
stty -f /dev/ttyd2 crtscts
stty -f /dev/ttyd3 crtscts
	    </programlisting>
	    
	    <para>Comme il n'y avait pas de fichiers sp&eacute;ciaux d'initialisation
	      dans FreeBSD 1.1, il suffisait de positionner les indicateurs
              pour les fichiers sp&eacute;ciaux de p&eacute;riph&eacute;riques, et d'esp&eacute;rer qu'ils
              ne seraient pas r&eacute;initialis&eacute;s par un petit malin.</para>
	    
	  </sect3>
	</sect2>
	
	<sect2>
	  <title>Configuration des modems</title>
	  
	  <para>Si vous avez un modem dont le param&eacute;trage est enregistr&eacute; en
            m&eacute;moire RAM non volatile, vous devrez utiliser un programme de 
            terminal (comme Telix sous PC-DOS ou <command>tip</command> sous
	    FreeBSD) pour d&eacute;finir ces param&egrave;tres. Connectez-vous au modem &agrave;
            la vitesse de communication initiale que
	    <command>getty</command> utilise et introduisez en m&eacute;moire RAM
            non volatile des valeurs telles que:</para>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>Le signal <abbrev>CD</abbrev> soit activ&eacute; quand la
                   ligne est active,</para>
	      </listitem>
	      
	      <listitem>
		<para>Le signal <abbrev>DTR</abbrev> soit activ&eacute; en cours de 
                  fonctionnement; quand le signal <abbrev>DTR</abbrev> tombe, la
                  ligne raccroche et le modem est r&eacute;initialis&eacute;,</para>
	      </listitem>
	      
	      <listitem>
		<para>Le signal <abbrev>CTS</abbrev> soit activ&eacute; en fin de
                   transmission,</para>
	      </listitem>
	      
	      <listitem>
		<para>Le contr&ocirc;le de flux <filename>XON/XOFF</filename> soit
                   d&eacute;sactiv&eacute;,</para>
	      </listitem>
	      
	      <listitem>
		<para>Le signal <abbrev>RTS</abbrev> soit activ&eacute; en fin de
                   r&eacute;ception,</para>
	      </listitem>
	      
	      <listitem>
		<para>Le modem soit en mode silencieux (pas de code 
                   retour),</para>
	      </listitem>
	      
	      <listitem>
		<para>Il n'y ait pas d'&eacute;cho des commandes.</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  
	  <para>Lisez s'il vous pla&icirc;t la documentation de votre modem
            pour savoir quelles commandes et/ou quels positionnements des
            cavaliers utiliser.</para>
	  
	  <para>Par exemple, pour passer ces param&egrave;tres &agrave; un modem externe
            USRobotics Sportster 14.400, il faudrait lui passer les commandes
	    suivantes:</para>
	  

	  <programlisting>
ATZ
AT&amp;C1&amp;D2&amp;H1&amp;I0&amp;R2&amp;W
	  </programlisting>
	  
	  <para>Vous pouvez aussi en profiter pour d&eacute;finir d'autres options
	    de configuration du modem, par exemple, s'il doit utiliser la norme
            V.42bis et/ou la compression MNP5.</para>
	  
	  <para>Il y a aussi des cavaliers &agrave; positionner sur le modem externe
            USR Sportster 14.400; pour d'autres modems, la configuration
            suivante peut peut-&ecirc;tre servir d'exemple:</para>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>Cavalier 1: HAUT - DTR normal,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cavalier 2: Pas d'importance (Codes retour
                  explicites/num&eacute;riques),</para>
	      </listitem>
	      
	      <listitem>
		<para>Cavalier 3: HAUT - Pas de code retour,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cavalier 4: BAS - Pas d'&eacute;cho, commandes hors-ligne,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cavalier 5: HAUT - R&eacute;ponse automatique,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cavalier 6: HAUT - D&eacute;tection de porteuse normale,</para>
	      </listitem>
	      
	      <listitem>
		<para>Cavalier 7: HAUT - Charger les valeurs par d&eacute;faut depuis
                  la NVRAM (m&eacute;moire non volatile),</para>
	      </listitem>
	      
	      <listitem>
		<para>Cavalier 8: Pas d'importance (Mode 
                  intelligent/passif).</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  
	  <para>Il vaut mieux d&eacute;sactiver les codes retours pour les connexions
            entrantes pour &eacute;viter les probl&egrave;mes qui peuvent se produire si
	    <command>getty</command> envoie une invite <prompt>login:</prompt> 
            alors que le modem est en mode commande et renvoie soit l'&eacute;cho de
            la commande soit un code retour. J'ai entendu dire que cela peut 
            engendrer une dialogue absurde et interminable entre 
	    <command>getty</command> et le modem.</para>
	  
	  
	  <sect3>
	    <title>Configuration &agrave; vitesse fix&eacute;e</title>
	    
	    <para>Pour une configuration &agrave; vitesse fix&eacute;e, vous devrez 
              configurer le modem pour qu'il communique toujours &agrave; la
              m&ecirc;me vitesse avec l'ordinateur, quelle que soit la vitesse
              de la ligne. Sur un modem externe USR Sportster
	      14.400, les commandes suivantes figeront la vitesse
              de communication entre le modem et l'ordinateur &agrave; la vitesse
              utilis&eacute;e pour envoyer ces commandes:</para>
	    
	    <programlisting>
ATZ
AT&amp;B1&amp;W
	    </programlisting>
	  </sect3>
	  
	  <sect3>
	    <title>Configuration avec adaptation de la vitesse</title>
	    
	    <para>Dans une configuration o&ugrave; la vitesse peut varier, vous
              devrez configurer votre modem pour qu'il ajuste sa vitesse
              de communication sur le port s&eacute;rie &agrave; la vitesse de l'appel
              entrant. Sur un modem externe USR Sportster 14.400, les
              commandes suivantes figeront la vitesse de transmission avec
              corrections d'erreur &agrave; la vitesse employ&eacute;e pour passer ces
              m&ecirc;mes commandes, mais autoriseront une vitesse variable pour
              les connexions sans correction d'erreur:</para>
	    
	    <programlisting>
ATZ
AT&amp;B2&amp;W
	    </programlisting>
	  </sect3>
	  
	  <sect3>
	    <title>V&eacute;rifier la configuration des modems</title>
	    
	    <para>La plupart des modems &agrave; haut d&eacute;bit disposent de commandes 
              pour afficher leurs param&egrave;tres op&eacute;rationnels courants sous 
              une forme plus ou moins lisible. Sur les modems externes 
	      USR Sportster 14.400, la commande <command>ATI5</command> 
              affiche les valeurs stock&eacute;es dans la RAM non volatile. Pour
              voir les valeurs r&eacute;ellement utilis&eacute;es (compte tenu de la
              position des cavaliers), utilisez les commandes
	      <command>ATZ</command> suivie de <command>ATI4</command>.</para>
	    
	    <para>Si vous avez une autre marque de modem, consultez le manuel
              de votre modem pour savoir comment v&eacute;rifier les param&egrave;tres de
              configuration de votre modem.</para>
	    
	  </sect3>
	</sect2>
	
	<sect2>
	  <title>En cas de probl&egrave;me</title>
	  
	  <para>Voici diff&eacute;rentes &eacute;tapes &agrave; suivre pour v&eacute;rifier le 
             fonctionnement des modems sur votre syst&egrave;me.</para>
	  
	  <sect3>
	    <title>Tester le syst&egrave;me FreeBSD</title>
	    
	    <para>Connectez le modem &agrave; votre syst&egrave;me FreeBSD, red&eacute;marrez le
              syst&egrave;me, et, si votre modem a des voyants d'&eacute;tat lumineux,
              regardez si le voyant <abbrev>DTR</abbrev> s'allume lorsque
              l'invite <prompt>login:</prompt> s'affiche &agrave; la console
	      syst&egrave;me - si c'est la cas, cela veut normalement dire que
	      FreeBSD a lanc&eacute; un processus <command>getty</command> sur le port
              de communication appropri&eacute; et attend que le modem re&ccedil;oive un
              appel.</para>
	     
	    <para>Si le voyant <abbrev>DTR</abbrev> ne s'allume pas, ouvrez une
              session &agrave; la console syst&egrave;me et passez la commande
	      <command>ps ax</command> pour voir si FreeBSD essaie bien de 
              lancer un processus <command>getty</command> sur le bon port.
	      Parmi les processus affich&eacute;s, vous devriez voir une ligne comme
	      celle-ci:</para>
	    
	    <informalexample>
	      <screen>  114 ??  I      0:00.10 /usr/libexec/getty V19200 ttyd0
  115 ??  I      0:00.10 /usr/libexec/getty V19200 ttyd1</screen>
	    </informalexample>
	    
	    <para>Si vous voyez autre chose, par exemple:
	    
	    <informalexample>
	      <screen>  114 d0  I      0:00.10 /usr/libexec/getty V19200 ttyd0</screen>
	    </informalexample>
	    
	    et que le modem n'a pas encore re&ccedil;u d'appel, cela veut dire que
	      <command>getty</command> a d&eacute;j&agrave; ouvert le port de communication.
	      Cela peut &ecirc;tre d&ucirc; &agrave; un probl&egrave;me de c&acirc;blage ou &agrave; un modem mal 
              configur&eacute;, parce que <command>getty</command> ne devrait pas
              pouvoir ouvrir le port de communication tant que le signal
	      <abbrev>CD</abbrev> (d&eacute;tection de porteuse) n'a pas &eacute;t&eacute; activ&eacute;
	      par le modem.</para>
	    
	    <para>S'il n'y a pas de processus <command>getty</command>
	      pr&ecirc;t &agrave; ouvrir le port 
              <filename>ttyd<replaceable>?</replaceable></filename> voulu,
              contr&ocirc;lez vos entr&eacute;es dans <filename>/etc/ttys</filename> pour
              voir s'il n'y a pas d'erreur. Consultez aussi le fichier de trace
	      <filename>/var/log/messages</filename> pour voir s'il y a des
	      messages d'<command>init</command> ou de 
	      <command>getty</command> indiquant un probl&egrave;me. S'il y a des
              messages, rev&eacute;rifiez les fichiers de configuration
	      <filename>/etc/ttys</filename> et
	      <filename>/etc/gettytab</filename>, et les fichiers sp&eacute;ciaux
	      de p&eacute;riph&eacute;riques <filename>/dev/ttyd?</filename> ad hoc, pour
              voir s'il y a des erreurs, s'il manque des entr&eacute;es ou des
              fichiers sp&eacute;ciaux.</para>
	    
	  </sect3>
	  
	  <sect3>
	    <title>Essayer de se connecter</title>
	    
	    <para>Essayez d'ouvrir une connexion par t&eacute;l&eacute;phone sur le syst&egrave;me;
              Veillez &agrave; utiliser 8 bits, pas de contr&ocirc;le de parit&eacute; et 
	      1 bit stop sur le syst&egrave;me distant. Si vous n'obtenez pas tout de
              suite l'invite, ou obtenez n'importe quoi, essayez d'appuyer
              plusieurs fois sur <literal>&lt;Entr&eacute;e&gt;</literal>, environ une
              fois par seconde. Si vous n'obtenez toujours pas l'invite
	      <prompt>login:</prompt>, essayez d'envoyer un 
              <command>Attn</command> (<command>BREAK</command>). Si vous
              utilisez un modem &agrave; haut d&eacute;bit, r&eacute;essayez de vous connecter 
              apr&egrave;s avoir verrouill&eacute; la vitesse de l'interface du modem,
	      (via <command>AT&amp;B1</command> sur un USR Sportster, par
	      exemple).</para>
	    
	    <para>Si cela ne marche toujours pas, v&eacute;rifiez encore le fichier
	      <filename>/etc/gettytab</filename> et contr&ocirc;lez que:</para>
	    
	      <itemizedlist>
		
		<listitem>
		  <para>Le nom de la fonctionnalit&eacute; initiale de
		    <filename>/etc/ttys</filename> pour cette liaison correspond
                    bien &agrave; celui d'une fonctionnalit&eacute; d&eacute;finie dans
		    <filename>/etc/gettytab</filename>,</para>
		</listitem>
		
		<listitem>
		  <para>Il y a une fonctionnalit&eacute; <filename>gettytab</filename> 
                    de nom diff&eacute;rent pour chaque entr&eacute;e
                    <literal>nx=</literal>,</para>
		</listitem>
		
		<listitem>
		  <para>Il y a une fonctionnalit&eacute; <filename>gettytab</filename> 
                    de nom diff&eacute;rent pour chaque entr&eacute;e
                    <literal>tc=</literal>,</para>
		</listitem>
		
	      </itemizedlist>
	    
	    <para>Si vous appelez mais que le modem sur le syst&egrave;me FreeBSD ne
              r&eacute;pond pas, assurez-vous que le modem est configur&eacute; pour r&eacute;pondre
              au t&eacute;l&eacute;phone lorsque le signal <abbrev>DTR</abbrev> est actif. Si
              le modem semble correctement configur&eacute;, v&eacute;rifiez que le signal
	      <abbrev>DTR</abbrev> est actif en regardant les voyants lumineux
	      du modem (s'il en a).</para>
	    
	    <para>Si vous avez tout pass&eacute; en revue plusieurs fois et que cela
              ne marche toujours pas, faites une pause et reprenez plus tard.
              Si vous en &ecirc;tes toujours au m&ecirc;me point, vous pouvez peut-&ecirc;tre
              envoyer un courrier &eacute;lectronique &agrave; la &a.questions; d&eacute;crivant
              votre modem et votre probl&egrave;me, et les bons samaritains de la
              liste essaieront de vous aider.</para>
	    
	  </sect3>
	</sect2>
	
	<sect2>
	  <title>Remerciements</title>
	  
	  <para>Merci aux personnes suivantes pour leurs conseils et leurs
             commentaires:</para>
	  
	    <variablelist>
	      <varlistentry><term>&a.kelly;</term>
		<listitem>
		  <para>pour nombre d'excellentes suggestions.</para>
		</listitem>
	      </varlistentry>
	    </variablelist>
	  
	  
	</sect2>
      </sect1>
      
      <sect1 id="dialout">
	<title>Service d'appel sortant</title>
	
	<para><emphasis>Informations reprises de la FAQ.</emphasis></para>
	
	<para>Cette section fournit des indications pour connecter votre
          machine &agrave; une autre machine par modem. Cela peut servir &agrave; ouvrir
          une session sur une machine distante.</para> 
	
	<para>C'est aussi utile pour vous connecter &agrave; un &ldquo;BBS&rdquo;.</para>
	
	<para>Ce type de connexion peut &ecirc;tre tr&egrave;s utile pour r&eacute;cup&eacute;rer un
          fichier sur l'Internet si vous avez des probl&egrave;mes avec PPP. Si vous
          avez besoin d'utiliser ftp et que PPP ne fonctionne pas, vous pouvez
          le faire en lan&ccedil;ant ftp sur la session terminal. Utilisez ensuite
          zmodem pour recevoir le fichier sur votre machine.</para> 
	
	<sect2>
	  <title>Pourquoi ne puis-je pas utiliser <command>tip</command> ou
	    <command>cu</command>?</title>
	  
	  <para>Sur votre syst&egrave;me, les programmes <command>tip</command>
	    et <command>cu</command> ne sont probablement ex&eacute;cutables que par
	    l'utilisateur <username>uucp</username> et le groupe
	    <username>dialer</username>. Vous pouvez vous servir du groupe
            <username>dialer</username> pour contr&ocirc;ler qui a acc&egrave;s &agrave; vos modems
            et &agrave; vos syst&egrave;mes distants. Ajoutez-vous donc au groupe
            <username>dialer</username>.</para> 
	  
	  <para>Vous pouvez aussi autoriser tout le monde &agrave; utiliser
	    <command>tip</command> et <command>cu</command> sur votre
            syst&egrave;me en tapant:</para>

	    <informalexample>
	      <screen>&prompt.root; <userinput>chmod 4511 /usr/bin/tip</userinput></screen>
	    </informalexample>

	  <para>Il est inutile de changer les droits sur la
             commande <command>cu</command>, car <command>cu</command> n'est
             qu'un lien physique sur <command>tip</command>.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Mon modem compatible Hayes n'est pas 
            support&eacute;, que puis-je faire?</title>
	  
	  <para>En fait, les pages de manuel de <command>tip</command>
	    ne sont pas &agrave; jour. Le support g&eacute;n&eacute;rique Hayes y est d&eacute;j&agrave; incorpor&eacute;.
	    Mettez simplement <literal>at=hayes</literal> dans votre fichier
	    <filename>/etc/remote</filename>.</para>
	  
	  <para>Le pilote Hayes n'est pas assez intelligent pour reconna&icirc;tre
            les possibilit&eacute;s &eacute;tendues des nouveaux messages des 
            modems&nbsp;-&nbsp;<literal>BUSY</literal>, 
            <literal>NO DIALTONE</literal>, ou <literal>CONNECT 115200</literal>            ne feront que lui poser des probl&egrave;mes. Vous devez d&eacute;sactiver ces
            messages quand vous utilisez <command>tip</command> (avec
	    <command>ATX0&amp;W</command>).</para>
	  
	  <para>Par ailleurs, le d&eacute;lai d'appel de <command>tip</command>
	    est de 60 secondes. Il devra &ecirc;tre inf&eacute;rieur sur votre modem, sinon
            tip pensera qu'il y a un probl&egrave;me de communication. Essayez
	    <command>ATS7=45&amp;W</command>.</para>
	  
	  <para>Tel que livr&eacute;, <command>tip</command> ne supporte pas 
            encore cela compl&egrave;tement. Pour y rem&eacute;dier, il faut &eacute;diter le fichier
	    <filename>tipconf.h</filename> du r&eacute;pertoire
	    <filename>/usr/src/usr.bin/tip/tip</filename>. Il vous faut
            bien &eacute;videmment le source pour cela.</para> 
	  
	  <para>Changez la ligne <literal>#define HAYES
	      0</literal> en <literal>#define HAYES
	      1</literal>. Puis <command>make</command> et
	    <command>make install</command>. Tout fonctionnera ensuite
	    sans probl&egrave;me.</para>
	  
	</sect2>
	
	<sect2
	  id="direct-at">
	  <title>Comment dois-je entrer toutes ces commandes AT?</title>
	  
	  <para>Mettez ce que l'on appelle une entr&eacute;e &ldquo;directe&rdquo;
            dans le fichier <filename>/etc/remote</filename>. Par exemple, 
            si votre modem est sur le premier port s&eacute;rie.
	    <filename>/dev/cuaa0</filename>, mettez la ligne suivante:</para>

	    <programlisting>
cuaa0:dv=/dev/cuaa0:br#19200:pa=none
	    </programlisting>

	  <para>Utilisez la vitesse en bps la plus rapide que votre modem
            accepte avec la fonctionnalit&eacute; br. Tapez alors
	    <command>tip cuaa0</command> et vous serez connect&eacute; &agrave; votre 
	    modem.</para>
	  
	  <para>S'il n'y a pas de fichier sp&eacute;cial 
            <filename>/dev/cuaa0</filename> sur votre syst&egrave;me, faites la
            chose suivante:</para>

	    <informalexample>
	      <screen>&prompt.root; <userinput>cd /dev</userinput>
&prompt.root; <userinput>MAKEDEV cuaa0</userinput></screen>
	    </informalexample>
	  
	  <para>Ou utilisez cu en tant que super-utilisateur avec la 
            commande:</para>

	    <informalexample>
	      <screen>&prompt.root; <userinput>cu -l<replaceable>ligne</replaceable> -s<replaceable>vitesse</replaceable></userinput></screen>
	    </informalexample>

	  <para><replaceable>ligne</replaceable> est le port s&eacute;rie
	    (e.g. <filename>/dev/cuaa0</filename>) 
            et <replaceable>vitesse</replaceable> est
	    la vitesse (e.g. <literal>57600</literal>). Quand vous avez fini
	    d'entrer vos commandes AT, tapez <command>~.</command>
	    pour quitter le programme.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Le signe <literal>@</literal> ne marche pas avec la fonctionnalit&eacute; pn!</title>
	  
	  <para>Le signe <literal>@</literal> comme num&eacute;ro de t&eacute;l&eacute;phone 
            dit &agrave; tip de lire le num&eacute;ro de t&eacute;l&eacute;phone 
            dans <filename>/etc/phones</filename>. Mais 
	    <literal>@</literal> est aussi un caract&egrave;re sp&eacute;cial dans les
            fichiers qui d&eacute;finissent des fonctionnalit&eacute;s,
            comme <filename>/etc/remote</filename>. Faites-le
            pr&eacute;c&eacute;der d'une barre oblique inverse:</para>

	    <programlisting>
pn=\@
	    </programlisting>
	  
	</sect2>
	
	<sect2>
	  <title>Comment puis-je appeler un num&eacute;ro de t&eacute;l&eacute;phone depuis la
             ligne de commande?</title>
	  
	  <para>Mettez ce que l'on appelle un entr&eacute;e &ldquo;g&eacute;n&eacute;rique&rdquo;
             dans votre fichier <filename>/etc/remote</filename>. Par 
             exemple:</para>

	    <programlisting>
tip115200|Appeler un num&eacute;ro de t&eacute;l&eacute;phone &agrave; 115200 bps:\
        :dv=/dev/cuaa0:br#115200:at=hayes:pa=none:du:
tip57600|Appeler un num&eacute;ro de t&eacute;l&eacute;phone &agrave; 57600 bps:\
        :dv=/dev/cuaa0:br#57600:at=hayes:pa=none:du:
	    </programlisting>
	  
	  <para>Vous pouvez alors faire la chose suivante:</para>

	    <informalexample>
	      <screen>&prompt.root; <userinput>tip -115200 5551234</userinput></screen>
	    </informalexample>

	  <para>Si vous pr&eacute;f&eacute;rez <command>cu</command> &agrave; <command>tip</command>,
	    mettez une entr&eacute;e g&eacute;n&eacute;rique pour cu:

	    <programlisting>
cu115200|Utiliser cu pour appeler un num&eacute;ro &agrave; 115200bps:\
        :dv=/dev/cuaa1:br#57600:at=hayes:pa=none:du:
	    </programlisting>
	    et tapez:

	    <informalexample>
	      <screen>&prompt.root; <userinput>cu 5551234 -s 115200</userinput></screen>
	    </informalexample></para>
	</sect2>
	
	<sect2>
	  <title>Dois-je pr&eacute;ciser la vitesse en bauds &agrave; chaque fois?</title>
	  
	  <para>Mettez un entr&eacute;e pour <literal>tip1200</literal> ou
	    <literal>cu1200</literal>, mais donnez-y la vitesse en bps
            voulue avec la fonctionnalit&eacute; br. <command>tip</command> pense
            que 1200 bps est une valeur par d&eacute;faut convenable et cherche donc
            une entr&eacute;e <literal>tip1200</literal>. Vous n'&ecirc;tes cependant pas
            oblig&eacute; d'y mettre la vitesse de 1200 bps.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Je me connecte &agrave; plusieurs machines par l'interm&eacute;diaire d'un
            concentrateur.</title>
	  
	  <para>Au lieu d'attendre d'&ecirc;tre connect&eacute; et de taper
	    <command>CONNECT &lt;h&ocirc;te&gt;</command> &agrave; chaque fois,
	    utilisez la fonctionnalit&eacute; <literal>cm</literal> de tip. Par
	    exemple, ces entr&eacute;es dans <filename>/etc/remote</filename>:

	    <programlisting>
pain|pain.deep13.com|la machine de Forrester:\
        :cm=CONNECT pain\n:tc=deep13:
muffin|muffin.deep13.com|la machine de Frank:\
        :cm=CONNECT muffin\n:tc=deep13:
deep13:le concentrateur de l'Institut Gizmonics:\
        :dv=/dev/cua02:br#38400:at=hayes:du:pa=none:pn=5551234:
	    </programlisting>
	  
	  vous permettent d'utiliser <command>tip pain</command>
          ou <command>tip muffin</command> pour vous connecter aux machines
          pain ou muffin; et <command>tip
	      deep13</command> pour acc&eacute;der &agrave; l'autre concentrateur.</para>
	  
	</sect2>
	
	<sect2>
	  <title>tip peut-il essayer d'appeler plusieurs num&eacute;ros pour
            se connecter &agrave; un m&ecirc;me site?</title>
	  
	  <para>C'est un probl&egrave;me fr&eacute;quent dans les universit&eacute;s qui ont une 
            batterie de modems et des milliers d'&eacute;tudiants qui essayent de
            s'en servir...</para>
	  
	  <para>D&eacute;finissez une entr&eacute;e pour votre universit&eacute; dans
	    <filename>/etc/remote</filename> et employez <literal>@</literal>
	   pour la fonctionnalit&eacute; <literal>pn</literal>:</para>

	    <programlisting>
super-universite:\
        :pn=\@:tc=dialout
dialout:\
        :dv=/dev/cuaa3:br#9600:at=courier:du:pa=none:
	    </programlisting>
	  
	  <para>Mettez ensuite les num&eacute;ros de t&eacute;l&eacute;phone de l'universit&eacute; dans
	    <filename>/etc/phones</filename>:</para>

	    <programlisting>
super-universite 5551111
super-universite 5551112
super-universite 5551113
super-universite 5551114
	    </programlisting>
	  
	  <para><command>tip</command> essayera d'appeler chacun de ces num&eacute;ros
             dans l'ordre, puis abandonnera la tentative. Si vous voulez
             continuer &agrave; essayer de vous connecter, ex&eacute;cutez
	    <command>tip</command> dans une boucle &ldquo;tant 
            que&rdquo;.</para>
	  
	</sect2>
	
	<sect2>
	  <title>pourquoi dois-je taper CTRL+P deux fois pour envoyer un
             seul CTRL+P?</title>
	  
	  <para>CTRL+P est le caract&egrave;re 
            d'&eacute;chappement&nbsp;-&nbsp;&ldquo;force&rdquo; par d&eacute;faut,
            pour dire &agrave; <command>tip</command> que le caract&egrave;re suivant est &agrave;
            comprendre tel quel. Vous pouvez changer de caract&egrave;re d'&eacute;chappement 
            avec la commande <command>~s</command>, qui signifie
	    &ldquo;d&eacute;finir une variable.&rdquo;</para>
	  
	  <para>Tapez <command>~sforce=<replaceable>caract&egrave;re</replaceable></command>
	    suivie d'un saut de ligne. <replaceable>caract&egrave;re</replaceable> peut
            &ecirc;tre n'importe quel caract&egrave;re. Si vous n'indiquez pas de
	    <replaceable>caract&egrave;re</replaceable>, alors le caract&egrave;re 
            d'&eacute;chappement est le caract&egrave;re &ldquo;nul&rdquo;, qui s'obtient en
            tapant CTRL+2 ou CTRL+barre d'espacement. Une bonne valeur
            &agrave; donner &agrave; <replaceable>caract&egrave;re</replaceable> est SHIFT+CTRL+6,
            que je n'ai jamais vue utilis&eacute;e ailleurs que sur certains 
            concentrateurs.</para>
	  
	  <para>vous pouvez aussi donner la valeur que vous voulez au caract&egrave;re
            d'&eacute;chappement en mettant la ligne suivante dans votre fichier
	    <filename>&#36;HOME/.tiprc</filename>:</para>

	    <programlisting>
force=&lt;caract&egrave;re&gt;
	    </programlisting>
	  
	</sect2>
	
	<sect2>
	  <title>Tout ce que je tape s'affiche tout &agrave; coup en 
            MAJUSCULES?</title>
	  
	  <para>Vous avez appuy&eacute; sur CTRL+A, c'est le caract&egrave;re 
            &ldquo;majuscules&rdquo; de <command>tip</command>, &agrave; l'usage
            particulier de ceux dont la touche &ldquo;Majuscules&rdquo; ne
            fonctionne pas. Utilisez <command>~s</command> comme pr&eacute;c&eacute;demment et
            donnez une valeur raisonnable &agrave; la variable 
            <literal>raisechar</literal>. Vous pouvez d'ailleurs lui donner la 
            m&ecirc;me valeur qu'au caract&egrave;re d'&eacute;chappement, si vous n'avez pas 
            l'intention de les utiliser l'un et l'autre.</para>
	  
	  <para>Voici une exemple de fichier <filename>.tiprc</filename> id&eacute;al
            pour les utilisateurs d'<command>Emacs</command> qui ont souvent
	    besoin de CTRL+2 et CTRL+A:</para>

	    <programlisting>
force=^^
raisechar=^^
	    </programlisting>

	    <para>^^ &eacute;quivaut &agrave; SHIFT+CTRL+6.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Comment puis-je transf&eacute;rer des fichiers avec
             <command>tip</command>?</title>
	  
	  <para>Si vous dialoguez avec un autre syst&egrave;me Unix,
            vous pouvez envoyer
            et recevoir des fichiers avec <command>~p</command> 
            (&ldquo;put&rdquo;) et <command>~t</command> (&ldquo;take&rdquo;).
            Ces commandes lancent
	    <command>cat</command> et <command>echo</command> sur le syst&egrave;me
            distant pour qu'il re&ccedil;oive et envoie des fichiers. La syntaxe
	    est:</para>

	    <cmdsynopsis>
	      <command>~p</command>
	      <arg choice="plain">fichier_local</arg>
	      <arg choice="opt">fichier_distant</arg>
	    </cmdsynopsis>

	    <cmdsynopsis>
	      <command>~t</command>
	      <arg choice="plain">fichier_distant</arg>
	      <arg choice="opt">fichier_local</arg>
	    </cmdsynopsis>
	  
	  <para>Il n'y a aucun contr&ocirc;le, vous devriez probablement utiliser un
            autre protocole, comme zmodem.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Comment puis-je utiliser <command>zmodem</command> avec
             <command>tip</command>?</title>
	  
	  <para>Pour r&eacute;cup&eacute;rer des fichiers, lancez le programmes de transfert
            sur la machine distante. Puis tapez <command>~C rz</command> pour
            commencer &agrave; les recevoir.</para>
	  
	  <para>Pour transmettre des fichiers, lancer le programme de r&eacute;ception
            sur la machine distante. Puis, tapez <command>~C sz 
            <replaceable>fichiers</replaceable></command> pour les lui 
            envoyer.</para>
	  
	</sect2>
      </sect1>
    </chapter>
<!--    
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-shorttag: nil
     sgml-always-quote-attributes: t 
     sgml-minimize-attributes: max
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End: 
-->       
