<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY date "$FreeBSD: www/fr/java/dists/11.sgml,v 1.6 2005/10/06 12:56:04 blackend Exp $">
<!ENTITY title "Projet &java; pour FreeBSD : &jdk; 1.1">
<!ENTITY % navinclude.developers "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.9

   Version francaise : Stephane Legrand <stephane@freebsd-fr.org>
   Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
   Version francaise (mise a jour) : Antoine Brodin <antoine.brodin@laposte.net>
-->

<html>
&header;

<table border="0">
      <tr>
	<td>
<P>La derni&egrave;re version est
<A HREF="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/jdk1.1.8_ELF.V1999-11-9.tar.gz">jdk1.1.8_ELF.V1999-11-9.tar.gz</A>.
pour ELF (FreeBSD versions 3 ou 4) ou pour les versions plus anciennes de la s&eacute;rie 2.2
<A HREF="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/local-distfiles/nate/JDK1.1/jdk1.1.8_AOUT.V1999-11-9.tar.gz">jdk1.1.8_AOUT.V1099-11-9.tar.gz</A>.
Les patches utilis&eacute;s pour la compilation des 2 versions sont disponibles
<A HREF="http://www.FreeBSD.org/~patrick/patches.tar.gz">ici</A>. Ils ne sont utiles que si vous avez le code source Java.

<P>Par ailleurs, les versions internationales du JRE&trade; sont
disponibles.
<UL>
<LI>
<A HREF="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/local-distfiles/nate/JDK1.1/jre1.1.8i_AOUT.V1999-11-9.tar.gz">jre1.1.8i_AOUT.V1999-11-9.tar.gz</A>
<LI>
<A HREF="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/local-distfiles/nate/JDK1.1/jre1.1.8i_ELF.V1999-11-9.tar.gz">jre1.1.8i_ELF.V1999-11-9.tar.gz</A>
</UL>

<P>Vous &ecirc;tes invit&eacute; &agrave; utiliser un site proche de chez vous,
      &agrave; moins que vous ne soyez limit&eacute; au http. Utilisez l'un de ces miroirs :
<UL>
<LI>
<A HREF="ftp://ftp.nuxi.com/pub/FreeBSD/JDK/">ftp://ftp.nuxi.com/pub/FreeBSD/JDK/</A>
<BR>Merci &agrave; David O'Brien (obrien@NUXI.com) qui m'a donn&eacute; un compte
sur sa machine. Le miroir devrait donc &ecirc;tre toujours correct.

<LI>
<A HREF="http://mirror.aarnet.edu.au/pub/FreeBSD/JDK/">http://mirror.aarnet.edu.au/pub/FreeBSD/JDK/</A>

<LI>
<A HREF="ftp://mirror.aarnet.edu.au/pub/FreeBSD/JDK/">ftp://mirror.aarnet.edu.au/pub/FreeBSD/JDK/</A>
<BR>Disponible uniquement en Australie/Nouvelle-Z&eacute;lande. Merci &agrave; Jason Andrade
(jason@dstc.edu.au) pour ce miroir par del&agrave; l'oc&eacute;an.

<LI>
<A HREF="ftp://ftp.se.FreeBSD.org/pub/FreeBSD/JDK/">ftp://ftp.se.FreeBSD.org/pub/FreeBSD/JDK/</A>
<BR>Merci &agrave; Johan Larsson (gozer@ludd.luth.se).

<LI>
<A HREF="ftp://ftp7.de.FreeBSD.org/pub/FreeBSD/JDK/">ftp://ftp7.de.FreeBSD.org/pub/FreeBSD/JDK/</A>
<BR><A HREF="http://ftp7.de.FreeBSD.org/pub/FreeBSD/JDK/">http://ftp7.de.FreeBSD.org/pub/FreeBSD/JDK/</A>
<BR>Merci &agrave; Oliver Fromme (olli@dorifer.heim3.tu-clausthal.de).

<LI>
<A HREF="ftp://ftp.gwdg.de/pub/freebsd/JDK/">ftp://ftp.gwdg.de/pub/freebsd/JDK/</A>
<BR><A HREF="http://ftp.gwdg.de/pub/freebsd/JDK/">http://ftp.gwdg.de/pub/freebsd/JDK/</A>
<BR>Merci &agrave; Eberhard Moenkeberg (emoenke@gwdg.de).

<LI>
<A HREF="ftp://nofinesse.lib.surrey.ac.uk/pub/FreeBSD/JDK/">ftp://nofinesse.lib.surrey.ac.uk/pub/FreeBSD/JDK/</A>
<BR>Merci &agrave; Jose Marques qui a mis en place une automatisation du processus.

<LI>
<A HREF="ftp://ftp.spline.net/pub/FreeBSD/JDK/">ftp://ftp.spline.net/pub/FreeBSD/JDK/</A>
<BR>Merci &agrave; Alexander Tatmaniants (tat@Spline.NET) .
</UL>

<P>Ces versions ne n&eacute;cessitent pas une licence Motif car elles ont &eacute;t&eacute; compil&eacute;es
avec une biblioth&egrave;que Motif qui autorise la distribution publique des binaires et
des librairies du JDK.

<H3>README.FreeBSD:</H3>
<PRE>
JDK1.1.8 pour FreeBSD
--------------------
Corrig&eacute;s dans cette version :
- l'impression &agrave; partir du JDK devrait maintenant fonctionner correctement.
- utilisation de la version en assembleur de l'interpr&eacute;teur. Les performances
  devrait &ecirc;tre meilleure.
- meilleure gestion des signaux comme DIVIDE et SIGFPE qui sont maintenant
  intercept&eacute;s et g&eacute;r&eacute;s correctement.
- la version ELF devrait mieux fonctionner avec les applications AWT/Swing. Le
  projet FreeBSD a fait don d'une version de Motif plus r&eacute;cente qui devrait &eacute;viter
  certaines erreurs &eacute;tranges sous interface X.

Pour avoir les meilleures r&eacute;sultats, il est recommand&eacute; d'utiliser les versions les plus r&eacute;centes de FreeBSD,
&agrave; savoir la 2.2.8 pour les versions a.out et FreeBSD 3.2R, afin de profiter
de ces am&eacute;liorations.

Si vous trouvez un bug ou si vous avez des corrections de bugs que vous voudriez voir int&eacute;gr&eacute;es, veuillez envoyer
un courrier &eacute;lectronique &agrave; 'java-port@FreeBSD.org' de mani&egrave;re &agrave; ce que nous puissions encore am&eacute;liorer les prochaines versions.

Limitations/Bugs connus :
------------------------------------
Le nombre de sockets qui peuvent &ecirc;tre utilis&eacute;es en m&ecirc;me temps est cod&eacute; en dur avec
l'ann&eacute;e (&agrave; la date d'aujourd'hui, ce nombre est &eacute;gal &agrave; 2000). Ce n'est pas sp&eacute;cialement une limitation du
noyau FreeBSD mais arriver &agrave; avoir un m&eacute;canisme dynamique n'est pas trivial et donc
aucun des d&eacute;veloppeurs n'a encore &eacute;crit le code et personne n'a
envoy&eacute; de patches &agrave; l'&eacute;quipe de d&eacute;veloppement. Si cette limitation a beaucoup d'importance pour vous,
nous serons ravi de recevoir tous les patches pour passer &agrave; un m&eacute;canisme dynamique qui permettrait de ne plus
limiter le nombre de descripteurs de fichiers (sockets).
------------------------------------
Pour r&eacute;aliser une distribution qui fonctionne sans X _et_ avec X, deux binaires
sont fournis. Le premier est li&eacute; sans X et est le binaire standard.
Le deuxi&egrave;me binaire est li&eacute; avec une version statique de X et avec
les librairies X partag&eacute;es. La version utilis&eacute;e est contr&ocirc;l&eacute;e par la variable
d'environnement DISPLAY qui est utilis&eacute;e par X afin de d&eacute;terminer
le p&eacute;riph&eacute;rique de sortie.
</PRE>
</td>
</tr>
</table>
&footer;
</BODY>
</HTML>
