<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/java/install.sgml,v 1.4 2004/01/08 00:26:44 stephane Exp $">
<!ENTITY title "Projet &java; pour FreeBSD : Comment effectuer l&quot;installation">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!-- 
  The FreeBSD French Documentation Project
  Original revision: 1.12

  Version francaise : Guillain
  Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
&header;
<table border="0">
<tr>
<td>
<p>Lorsque vous installez Java sous FreeBSD, vous avez le choix entre plusieurs
Kits de D&eacute;veloppement Java :</p>
</td>
</tr>
<tr>
<td>
<h3><a name="jdk">Le JDK natif sous FreeBSD</a></h3>

<p>C'est le r&eacute;sultat du travail de l'&eacute;quipe de portage sous FreeBSD de Java 2.
En utilisant les patches et le code source du JDK publi&eacute;s par Sun,
ce port compile un JDK natif pour FreeBSD.</p>

<p><code>cd /usr/ports/java/jdk14
<BR>make install clean
</code></p>

</td>
</tr>
<tr>
<td>
<h3><a name="linux-sun-jdk">JDK Sun pour Linux</a></h3>

<p>Ce port installe le Kit de D&eacute;veloppement Java 2 de Sun compil&eacute; pour Linux. Il tournera sous FreeBSD en utilisant la compatibilit&eacute; binaire avec Linux.</p>

<p><code>cd /usr/ports/java/linux-sun-jdk14
<BR>make install clean
</code></p>
</td>
</tr>
<tr>
<td>

<h3><a name="linux-ibm-jdk">JDK IBM pour Linux</a></h3>

<p>Il s'agit d'une impl&eacute;mentation de l'&eacute;dition standard du SDK Java 2
pour Linux d'IBM, version 1.4. Contient le compilateur IBM juste-&agrave;-temps (just-in-time),
am&eacute;lior&eacute; avec un Interpr&eacute;teur Mode Mixte et une
machine virtuelle Java 2 retravaill&eacute;e.</p>

<p><code>cd /usr/ports/java/linux-ibm-jdk14
<BR>make install clean
</code></p>
</td>
</tr>
<tr>
<td>

<h3><a name="linux-blackdown-jdk">JDK Blackdown pour Linux</a></h3>

<p>Kit du d&eacute;veloppeur Java Blackdown 1.4.1. Contient les machines
virtuelles du client Hotspot et du serveur, ainsi qu'une version am&eacute;lior&eacute;e de Java
Web Start 1.2, un plugin Java pour les navigateurs bas&eacute;s sur Mozilla et un plugin
Java pour les navigateurs Netscape 4.x.</p>

<p><code>cd /usr/ports/java/linux-blackdown-jdk14
<BR>make install clean
</code></p>
</td>
</tr>
<tr>
<td>

<p><b>Note :</b> Veuillez noter qu'en raison de la politique de licence actuelle de Sun, les binaires ne
peuvent &ecirc;tre redistribu&eacute;s et que vous &ecirc;tes seul autoris&eacute; &agrave; les utiliser/&eacute;tudier.
Pour les m&ecirc;mes raisons, vous devez r&eacute;cup&eacute;rer manuellement le code source et les patches
pour FreeBSD.</p>

<P>Si vous rencontrez des probl&egrave;mes, consultez le Manuel de r&eacute;f&eacute;rence de FreeBSD
au chapitre <A HREF="&enbase;/doc/&url.doc.langcode;/books/handbook/ports.html">installer des applications</A>
pour trouver de l'aide.</P>
</td>
</tr>
</table>
&footer;
</BODY>
</HTML>
