<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" [
<!ENTITY base CDATA "..">
<!ENTITY enbase "../&base;">
<!ENTITY date "$FreeBSD: www/fr/java/newsflash.sgml,v 1.4 2004/01/06 17:31:41 stephane Exp $">
<!ENTITY title "Projet &java; pour FreeBSD : flash info">
<!ENTITY % includes SYSTEM "../includes.sgml"> %includes;
]>

<!--
  The FreeBSD French Documentation Project
  Original revision: 1.37

  Version francaise : Guillain
  Version francaise (mise a jour) : Stephane Legrand <stephane@freebsd-fr.org>
  Version francaise (mise a jour) : Vincent Tougait <viny@scientiae.net>
-->

<html>
&header;
<table border="0">
      <tbody><tr>
	<td>

<h2>Ao&ucirc;t 2003</h2>
<ul>
<li><b>26 Ao&ucirc;t 2003</b>
<br>La Fondation FreeBSD
<a href="http://www.freebsdfoundation.org/press/20030825-java131.shtml">
annonce</a> le support natif du JDK 1.3.1 sous FreeBSD.</li>
</ul>

<h2>Mars 2003</h2>
<ul>
<li><b>7 Mars 2003 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti le troisi&egrave;me ensemble
de patches mis &agrave; jour (patches niveau 3) pour le &jdk; 1.4. Consultez
<a href="dists/14.html">la page JDK 1.4.x</a> pour plus de d&eacute;tails.</li>
</ul>

<h2>F&eacute;vrier 2003</h2>
<ul>
<li><b>12 F&eacute;vrier 2003 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un ensemble
de patches mis &agrave; jour (patches niveau 8) pour le JDK 1.3.1. Consultez
<a href="dists/13.html">la page JDK 1.3.x</a> pour plus de d&eacute;tails.</li>
<li><b>4 F&eacute;vrier 2003 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti le second ensemble
de patches mis &agrave; jour (patches niveau 2) pour le JDK 1.4. Consultez
<a href="dists/14.html">la page JDK 1.4.x</a> pour plus de d&eacute;tails.</li>
</ul>

<h2>Novembre 2002</h2>
<ul>
<li><b>15 Novembre 2002 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un premier ensemble
de patches mis &agrave; jour (patches niveau 1) pour le JDK 1.4.0. Consultez
<a href="dists/14.html">la page JDK 1.4.x</a> pour plus de d&eacute;tails.</li>
</ul>

<h2>Septembre 2002</h2>
<ul>
<li><b>18 Septembre 2002 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un ensemble
de patches mis &agrave; jour (patches niveau 11) pour le JDK 1.2.2. Consultez
<a href="dists/12.html">la page JDK 1.2.x</a> pour plus de d&eacute;tails.</li>
<li><b>17 Septembre 2002 :</b>
<br>Juste apr&egrave;s que Sun e&ucirc;t sorti J2SE 1.4.1 FCS, la version Linux a
&eacute;t&eacute; rendue disponible dans le syst&egrave;me de ports FreeBSD. Consultez
<a href="http://java.sun.com/j2se/1.4.1/">la page J2SE 1.4.1</a> pour plus de
d&eacute;tails.</li>
</ul>

<h2>Juillet 2002</h2>
<ul>
<li><b>26 Juillet 2002 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un ensemble
de patches mis &agrave; jour (patches niveau 7) pour le JDK 1.3.1. Consultez
<a href="dists/13.html">la page JDK 1.3.x</a> pour plus de d&eacute;tails.</li>
</ul>

<h2>F&eacute;vrier 2002</h2>
<ul>
<li><b>13 F&eacute;vrier 2002 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un ensemble
de patches mis &agrave; jour (patches niveau 6) pour le JDK 1.3.1. Consultez
<a href="dists/13.html">la page JDK 1.3.x</a> pour plus de d&eacute;tails.</li>
</ul>

<h2>D&eacute;cembre 2001</h2>
<ul>
<li><b>22 D&eacute;cembre 2001 :</b>
<br>
<p>Envoy&eacute; sur announce@freebsd.org :</p>

<p>
La Fondation FreeBSD a obtenu de Sun Microsystems une licence afin de distribuer
des versions natives FreeBSD du Kit de D&eacute;veloppement Java (JDK) et de
l'Environnement d'Execution Java (JRE). Gr&acirc;ce aux efforts de l'&eacute;quipe
Java de FreeBSD, ceux-ci devraient &ecirc;tre disponibles afin d'&ecirc;tre inclus
dans la version 4.5 de FreeBSD qui doit sortir en Janvier 2002.</p>

<p>
La disponibilt&eacute; d'une version distribuable de Java va b&eacute;n&eacute;ficier
aux utilisateurs finaux, aux utilisateurs commerciaux et aux d&eacute;deloppeurs qui
utilisent FreeBSD. La popularit&eacute; de Java ne cesse de cro&icirc;tre, et il est
est maintenant tr&egrave;s utilis&eacute; dans les applications web c&ocirc;t&eacute;
serveur, l'un des points forts de FreeBSD. Avec une distribution binaire de Java sous
licence officielle, FreeBSD devient une plate-forme id&eacute;ale pour l'&eacute;xecution,
le d&eacute;veloppement et le d&eacute;ploiement de solutions bas&eacute;es sur Java.</p>

<p>
Cet accord n'aurait pas pas &eacute;t&eacute; possible sans les efforts de
<a href="mailto:nate@FreeBSD.org">Nate Williams</a>. Non seulement Nate fut celui
qui d&eacute;marra le travail de portage de Java sous FreeBSD, mais il fut aussi celui
qui amena Sun Microsystems et la Fondation &agrave; n&eacute;gocier une licence.</p>

<p>
Vous pouvez trouver le texte complet de l'annonce
<a href="http://daily.daemonnews.org/view_story.php3?story_id=2602">ici</a>.</p></li>
</ul>

<h2>Octobre 2001</h2>
<ul>
<li><b>16 Octobre 2001 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un ensemble
de patches mis &agrave; jour (patches niveau 5) pour le JDK 1.3.1. Consultez
<a href="dists/13.html">la page JDK 1.3.x</a> pour plus de d&eacute;tails.</li>
</ul>

<h2>Septembre 2001</h2>
<ul>
<li><b>10 Septembre 2001 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un ensemble
de patches mis &agrave; jour (patches niveau 4) pour le JDK 1.3.1. Consultez
<a href="dists/13.html">la page JDK 1.3.x</a> pour plus de d&eacute;tails.</li>

<li><b>6 Septembre 2001 :</b>
<br><a href="mailto:sobomax@FreeBSD.org">Maxim Sobolev</a> a cr&eacute;&eacute; un
port du logiciel <a href="http://www.sun.com/forte/ffj/index.html">Forte[tm]
pour Java[tm]</a> de Sun, version 3.0 Community Edition qui est un environnement
de d&eacute;veloppement int&eacute;gr&eacute; (IDE). Il peut maintenant &ecirc;tre install&eacute; directement depuis le
r&eacute;pertoire ports/java/forte.

<p>Ce port peut &ecirc;tre utilis&eacute; soit avec le JDK 1.3.1 natif soit avec le JDK 1.3.1 version Linux.</p></li>
</ul>

<h2>Ao&ucirc;t 2001</h2>
<ul>
<li><b>27 Ao&ucirc;t 2001 :</b>
<br><a href="mailto:glewis@FreeBSD.org">Greg Lewis</a> a sorti un
port pour le tant attendu JDK 1.3.1. Il peut maintenant &ecirc;tre install&eacute; directement depuis
le r&eacute;pertoire ports/java/jdk13. Consultez la page <a href="dists/13.html">JDK 1.3.x</a>
pour plus de d&eacute;tails.

<p>A noter que cette version est uniquement &agrave; l'intention des d&eacute;veloppeurs et qu'il
n'est pas recommand&eacute; de l'utiliser pour un environnement de production.</p></li>
</ul>

<h2>Octobre 2000</h2>
<ul>
<li><b>14 Octobre 2000 :</b>
<br><a href="mailto:sobomax@FreeBSD.org">Maxim Sobolev</a> a cr&eacute;&eacute; un
port du JDK 1.2.2. Il peut maintenant &ecirc;tre install&eacute; directement depuis le r&eacute;pertoire
ports/java/jdk12-beta. Consultez la page <a href="dists/12.html">JDK 1.2.x</a> pour plus de d&eacute;tails.
<p>Tous les probl&egrave;mes indiqu&eacute;s ci-dessous sont cependant toujours d'actualit&eacute;.</p>
<p>Donc si vous avez un port de Java2 qui dort sur votre disque dur, c'est votre chance.</p></li>
</ul>

<h2>Septembre 2000</h2>
<ul>
<li><b>15 Septembre 2000 :</b> Du service des informations Java :
<br><a href="mailto:sean@stat.duke.edu">Sean O'Connell</a> et
<a href="mailto:gallatin@cs.duke.edu">Andrew Gallatin</a> ont cr&eacute;&eacute;s
des patches pour pouvoir utiliser le JDK 1.3 de IBM sur FreeBSD.
<br><a href="mailto:ernst@jollem.com">Ernst de Haan</a> a r&eacute;ussi &agrave; faire
fonctionner le JDK 1.3.0b9 de Sun version Linux sur FreeBSD 4.0-STABLE.
<p>Tous les d&eacute;tails sont <a href="dists/13.html">sur cette page</a>.</p></li>
</ul>
<h2>Ao&ucirc;t 2000</h2>
<ul>
<li><b>10 Ao&ucirc;t 2000 :</b> Depuis le 7 Ao&ucirc;t 2000, l'&eacute;quipe JDK de FreeBSD
a acc&egrave;s au JCK (Kit de Compatibilit&eacute; Java) de Sun,
ce qui va nous permettre de tester et (nous l'esp&eacute;rons !)
de sortir une version binaire utilisant les patches actuels.
Malheureusement, nous ne pouvons pas (pour des raisons l&eacute;gales) distribuer un JDK
qui n'a pas &eacute;t&eacute; test&eacute; avec le JCK contrairement &agrave; ce que nous avions pu faire
avec JDK 1.1.* .

<p>H&eacute;las, d'apr&egrave;s Sun (nous n'en avons pas encore l'exp&eacute;rience), utiliser le
JCK pour tester le port est un processus long et difficile.
Nous esp&eacute;rons que cela nous prendra moins des 3 mois pr&eacute;vus par Sun :(</p>

<p>Enfin, il y a toujours quelques probl&egrave;mes concernant Motif&reg; qui doivent &ecirc;tre
r&eacute;solus avant qu'une version publique ne soit possible. Sun travaille sur ce
point et nous devons essayer de contacter l'OpenGroup pour voir si nous pouvons
obtenir une exception sp&eacute;ciale pour la distribution binaire de Motif &agrave; utiliser avec le
JDK.</p></li>

</ul>
<h2>Mai 2000</h2>
<ul>
<li><b>3 Mai 2000 :</b> Le port natif du JDK 1.2.2 entre dans sa phase de test alpha
<br>Greg Lewis vient d'annonc&eacute; que le port natif du JDK 1.2.2
&eacute;tait entr&eacute; dans la phase de test alpha.
<br>Dans son &eacute;tat actuel, le port compile et fonctionne avec la plupart des versions de FreeBSD
(3.4, 4.0 et 5.0 sur x86) et le d&eacute;veloppement est en cours pour les autres versions (2.2.8 sur x86
et 4.0 sur alpha). La plupart des applications et des applets de d&eacute;mo fonctionnent.
<br>Nous recherchons actuellement des volontaires enthousiastes qui pourraient consacr&eacute;s un peu de temps
afin de tester ce nouveau port. Bien que cela ne soit pas une t&acirc;che triviale, des instructions
d&eacute;taill&eacute;es sont disponibles pour la compilation et l'utilisation du port.
<br>Les patches se trouvent comme d'habitude sur :
<br><a href="http://www.eyesbeyond.com/freebsddom/java/jdk.html">http://www.eyesbeyond.com/freebsddom/java/jdk.html</a>
<br>De plus amples informations, les probl&egrave;mes non r&eacute;solus et les instructions d&eacute;taill&eacute;es sont sur :
<br><a href="http://www.kjkoster.org/java/index.html">http://www.kjkoster.org/java/index.html</a></li>
<li><b>1er Mai 2000 :</b> Demande d'am&eacute;lioration (RFE) - en t&ecirc;te de classement
<br>Nous avons adress&eacute; une demande &agrave; Sun pour qu'il fournisse un port officiel du JDK2 sur FreeBSD. Nous sommes
actuellement &agrave; la <b>premi&egrave;re</b> place pour les r&eacute;sultats des votes. Si vous &ecirc;tes membre du
"Java Developer's Connection" (c'est gratuit), vous pouvez voter vous aussi
<a href="http://developer.java.sun.com/developer/bugParade/bugs/4288745.html">http://developer.java.sun.com/developer/bugParade/bugs/4288745.html</a></li>
</ul>
<h2>Mars 2000</h2>
<ul>
<li><b>22 Mars 2000 :</b> Les patches pour la version pre-alpha du JDK 1.2.2 sont disponibles.
<br>Greg Lewis a sorti les patches pre-alpha pour les utilisateurs Java
t&eacute;m&eacute;raires qui voudraient compiler leur propre version native du JDK&nbsp;1.2.2. Ce
n'est pas destin&eacute; aux cardiaques et ce JDK ne doit pas &ecirc;tre utilis&eacute;
sur des syst&egrave;mes en production. Cela &eacute;tant dit, la plupart des d&eacute;mos AWT et Swing semblent
fonctionner. Il reste encore &eacute;norm&eacute;ment de travail &agrave; faire et nous avons besoin de tous les testeurs que
nous pourrons trouver. Les patches et les instructions pour la compilation peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;s depuis
<a href="http://www.eyesbeyond.com/freebsd-jdk122-patches-latest.tar.gz">
http://www.eyesbeyond.com/freebsd-jdk122-patches-latest.tar.gz</a>. Les probl&egrave;mes non
r&eacute;solus et les r&eacute;sultats des tests sont disponibles sur
<a href="http://www.kjkoster.org/java/index.html">
http://www.kjkoster.org/java/index.html.</a></li>
</ul>
<h2>Janvier 2000</h2>
<ul>
<li><b>30 janvier 2000 :</b> JDK 1.2.2RC4 de Blackdown
<br>L'&eacute;quipe Blackdown de portage sous Linux a sorti la RC4 du JDK 1.2. Elle a
&eacute;t&eacute; test&eacute;e sous FreeBSD 3.4-STABLE et suivantes et elle fait tourner toutes les applets de d&eacute;mo
et les d&eacute;mos de jfc. Plusieurs personnes ont signal&eacute; quelques probl&egrave;mes avec
Apache JServ. En attendant d'&ecirc;tre ajout&eacute;e &agrave; l'arborescence des ports de FreeBSD, vous pouvez la trouver
sur <a href="http://www.jmcm.org/tech/ports/linux_jdk.html">
http://www.jmcm.org/tech/ports/linux_jdk.html</a>.  (Information rapport&eacute;e par Jose Marques)</li>
</ul>

<h2>Novembre 1999</h2><ul>
<li><b>28 novembre 1999 :</b> Requ&egrave;te pour am&eacute;lioration
<br>Nous avons lanc&eacute; une p&eacute;tition pour que Sun fournisse un portage officiel du JDK2 pour FreeBSD. Nous sommes actuellement en <b>seconde</b> position dans le compte des signatures. Si vous &ecirc;tes membre de la Java Developer's Connection (c'est gratuit), vous pouvez signer la p&eacute;tition sur <a href="http://developer.java.sun.com/developer/bugParade/bugs/4288745.html">http://developer.java.sun.com/developer/bugParade/bugs/4288745.html</a></li>

<li><b>9 novembre 1999 :</b> Une autre version de JDK1.1.8 pour corriger une classe sp&eacute;cifique de bugs sur le multicast.
<ul>
<li>
<a href="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/local-distfiles/nate/JDK1.1/jdk1.1.8_AOUT.V99-11-9.tar.gz">jdk1.1.8_AOUT.V99-11-9.tar.gz</a>.
Pour FreeBSD versions 2.2.* au format binaire A.OUT.</li>
<li>
<a href="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/local-distfiles/nate/JDK1.1/jdk1.1.8_ELF.V99-11-9.tar.gz">jdk1.1.8_ELF.V99-11-9.tar.gz</a>.
Pour FreeBSD versions 3.* et 4.* au format binaire ELF. Note : suite &agrave;
de nombreux changements dans -CURRENT, le JDK peut ne pas fonctionner correctement.</li>
</ul></li>
</ul>

<h2>Octobre 1999</h2><ul>

<li><b>11 octobre 1999 :</b> Le portage de Java2/JDK1.2 a repris.
Nous esp&eacute;rons, dans les semaines &agrave; venir, une premi&egrave;re version "alpha"
pour FreeBSD 3.3-stable/ELF.</li></ul>

<h2>Septembre 1999</h2><ul>
<li><b>22 septembre 1999 :</b> Encore une version du JDK1.1.8 afin de corriger
quelques bugs mineurs que des personnes ont trouv&eacute;s mais aussi pour l'acc&eacute;l&eacute;rer.
Pour plus de d&eacute;tails, reportez-vous au README.FreeBSD fourni avec cette version.
<ul>
<li>jdk1.1.8_AOUT.V99-9-22.tar.gz.
Pour FreeBSD versions 2.2.* au format binaire A.OUT.</li>
<li>jdk1.1.8_ELF.V99-9-22.tar.gz.
Pour FreeBSD versions 3.* et 4.* au format binaire ELF.</li>
</ul></li>
</ul>

<h2>Juillet 1999</h2><ul>
<li><b>19 juillet 1999 :</b> nouvelle version du JDK1.1.8 pour corriger quelques
bugs mineurs (mais ennuyeux). Premi&egrave;rement, le patch r&eacute;seau (voir plus loin) a &eacute;t&eacute;
incorpor&eacute; &agrave; la compilation, deuxi&egrave;mement, un bug ennuyeux de virgule flottante
a &eacute;t&eacute; trouv&eacute; et corrig&eacute;. Ce dernier concerne le code multi-thread :
les calculs en virgule flottante et bas&eacute;s sur le code pouvaient donner
des r&eacute;sultats compl&egrave;tement erron&eacute;s.
<ul>
<li>jdk1.1.8_AOUT.V99-7-19.tar.gz.
Pour FreeBSD versions 2.2.* au format binaire A.OUT.</li>
<li>jdk1.1.8_ELF.V99-7-19.tar.gz.
Pour FreeBSD versions 3.* et 4.* au format binaire ELF.</li>
</ul></li>

<li><b>2 juillet 1999 :</b> Mise en place de l'&eacute;quipe de portage "CommAPI" dont
le but est de distribuer librement
<a href="http://java.sun.com/products/javacomm/index.html">CommAPI pour JAVA</a>
pour la communaut&eacute; FreeBSD. Le projet est coordonn&eacute; par
<a href="mailto:jdricot@ulb.ac.be?subject=JAVA CommAPI: "> DRICOT Jean-Michel</a> et
sera h&eacute;berg&eacute; sur
<a href="http://student.ulb.ac.be/~jdricot/commapi/">http://student.ulb.ac.be/~jdricot/commapi/</a>.
N'h&eacute;sitez pas &agrave; le contacter si vous voulez faire partie du projet.</li>
</ul>

<h2>Juin 1999</h2><ul>
<li><b>8 juin 1999 :</b> Un bug mineur a &eacute;t&eacute; trouv&eacute; dans JDK1.1.8 qui
concerne les gens utilisant les sockets UDP. Si vous essayiez d'envoyer un paquet &agrave;
une adresse broadcast, le JDK de FreeBSD refusait avec une erreur de permission.
Cette erreur a &eacute;t&eacute; corrig&eacute;e et au lieu de sortir &agrave; nouveau une version compl&egrave;te,
un petit patch a &eacute;t&eacute; pr&eacute;vu pour ceux qui rencontrent ce
probl&egrave;me. Si vous &ecirc;tes de ceux-l&agrave;, n'h&eacute;sitez pas &agrave; t&eacute;l&eacute;charger le
fichier tar gzipp&eacute; et "d&eacute;tarer" le &agrave; l'endroit o&ugrave; est install&eacute; le JDK. Il
s'installera tout seul par dessus l'ancienne version. Si vous n'avez pas
ce probl&egrave;me, pas besoin d'appliquer le patch m&ecirc;me si &ccedil;a ne peut pas faire de mal.
<ul>
<li>
<a href="AOUT.netpatch.tar.gz">AOUT.netpatch.tar.gz</a>.
Pour FreeBSD versions 2.2.* au format binaire A.OUT.</li>
<li>
<a href="ELF.netpatch.tar.gz">ELF.netpatch.tar.gz</a>.
Pour FreeBSD versions 3.* et 4.* au format binaire ELF.</li>
</ul></li>

<li><b>3 juin 1999 :</b> JDK1.1.8 pour les versions A.OUT et ELF. Cette version
ajoute le support pour les versions ant&eacute;rieures &agrave; 3.*/ELF (sans avoir besoin de changement
dans le chargeur dynamique) et corrige &eacute;galement des bugs concernant le support de LOCALE et du fuseau horaire
pour toutes les versions de FreeBSD.
<ul>
<li>jdk1.1.8_AOUT.V99-6-3.tar.gz.
Pour FreeBSD versions 2.2.* au format binaire A.OUT.</li>
<li>jdk1.1.8_ELF.V99-6-3.tar.gz.
Pour FreeBSD versions 3.* et 4.* au format binaire ELF.</li>
</ul></li>

<li><b>1er juin 1999 :</b> Statut de JDK2
<ul>
<li>
Le travail sur JDK1.2/JDK2 avance assez lentement puisque l'&eacute;quipe de d&eacute;veloppement
focalise ses efforts sur des versions stables de JDK1. Pour la plupart des d&eacute;veloppement JDK2,
vous pouvez utiliser la version JDK1 avec
<a href="http://java.sun.com/products/jfc/index.html#download-swing">Swing</a>
pour JDK1, fourni par Sun, qui fonctionne tr&egrave;s bien sous FreeBSD.</li>
</ul></li>
</ul>

<h2>Avril 1999</h2><ul>
<li><b>16 avril 1999 :</b> Nouvelle version A.OUT de JDK1.1.7. Elle corrige des
probl&egrave;mes de compilation de la version de mars. Une nouvelle version ELF va voir le jour
dans un futur proche pour supporter des versions plus anciennes que la 3.0.
<ul>
<li>jdk1.1.7_AOUT.V99-4-16.tar.gz.
Pour FreeBSD versions 2.2.* au format binaire A.OUT.</li>
</ul></li>
</ul>

<h2>Mars 1999</h2><ul>
<li><b>26 mars 1999 :</b> Support de ELF pour JDK1.1.7 et nouvelle version A.OUT
qui corrige quelques bugs mineurs.
<ul>
<li>jdk1.1.7_AOUT.V99-3-24.tar.gz.
Pour FreeBSD versions 2.2.* au format binaire A.OUT.</li>
<li>jdk1.1.7_ELF.V99-3-25.tar.gz.
Pour FreeBSD versions 3.x et 4 en format binaire ELF. <b>Note</b> :
Requi&egrave;re les modifications effectu&eacute;es sur le chargeur dynamique pour supporter
la fonction dladdr() ajout&eacute;e le 24 mars 1999. Vous aurez besoin d'utiliser la 3.1-stable
ou la 4.0-current datant d'apr&egrave;s le 24 mars 1999. Si vous n'avez pas le binaire du
nouveau chargeur ou si vous n'utilisez pas -stable ou -current, vous pouvez le charger
depuis <a href="ld-elf.so.1">ici</a> et l'installer en tant que
/usr/libexec/ld-elf.so.1 (vous devez &ecirc;tre root pour faire ceci) :

<pre># install -c -s -o bin -g bin -m 555 -C -fschg <b>ld-elf.so.1</b> /usr/libexec</pre></li>
</ul></li>

<li><b>16 mars 1999 :</b> Mises &agrave; jour sur le d&eacute;veloppement actuel :
<ul>
<li>
ELF JDK1.1.7 : Une version ELF de JDK1.1.7 (pour utiliser sur FreeBSD 3.x et plus r&eacute;cents)
est en train d'entrer dans sa premi&egrave;re phase de tests. Une version b&eacute;ta
devrait &ecirc;tre disponible dans quelques semaines.</li>
<li>
JDK2 (alias JDK1.2) : Plusieurs personnes travaillent au portage de JDK2 sur
FreeBSD. Le travail n'avance pas vite &agrave; cause du manque de temps
que les d&eacute;veloppeurs peuvent consacrer au projet. La sortie de
JDK2 par Blackdown aidera au d&eacute;veloppement lorsqu'ils difuseront leurs sources.</li>
</ul></li>
</ul>
<h2>D&eacute;cembre 1998</h2><ul><li>
<b>21 d&eacute;cembre 1998 :</b> jdk1.1.7.V98-12-21.tar.gz.
<ul>
<li>
Version corrigeant des bugs de JDK1.1.7. Merci &agrave; Keith White d'avoir traqu&eacute; certains
bugs ennuyeux (et s&eacute;rieux) du JDK, notament le bug concernant le modulo. Dans
cette version, la limite &agrave; 256 descripteurs de fichiers est mont&eacute;e &agrave; 2048. JRE
est aussi nettement plus utilisable, de nouveau gr&acirc;ce &agrave; Keith.</li>
</ul></li>
</ul>

<h2>Novembre 1998</h2><ul><li>
<b>14 novembre 1998 :</b>jdk1.1.7.V98-11-5.tar.gz.
<ul>
<li>
Mise &agrave; jour vers JDK1.1.7. Les remerciements vont &agrave;
Patrick Gardella <a href="mailto:patrick@cre8tivegroup.com">patrick@cre8tivegroup.com</a>
qui a effectu&eacute; la plupart des tests sur cette version.</li>
</ul></li>
</ul>

<h2>Septembre 1998</h2><ul><li>
<b>23 septembre 1998 :</b> jdk1.1.6.V98-9-23.tar.gz.
<ul>
<li>
La compilation du 14 Ao&ucirc;t a mal li&eacute; jre &agrave; JDK et &agrave; JRE.
Une nouvelle version a donc &eacute;t&eacute; compil&eacute;e avec les liens corrects. Sinon,
aucun changement par rapport &agrave; la version pr&eacute;c&eacute;dente.</li>
</ul></li>
</ul>

<h2>Ao&ucirc;t 1998</h2><ul><li>
<b>22 ao&ucirc;t 1998 :</b>
<ul>
<li>
Mise &agrave; jour de la page listant les nombreux sites qui ont accept&eacute; d'&ecirc;tre mirroir du JDK
et de fournir un acc&egrave;s ftp. Merci &agrave; tous !</li>
</ul></li>

<li><b>14 ao&ucirc;t 1998 :</b> jdk1.1.6.V98-8-14.tar.gz.
<ul>
<li>
L'option SO_REUSEADDR est d&eacute;sormais correctement positionn&eacute;e dans les ServerSockets (cela doit
aussi affecter les autres sockets).</li>
</ul></li>
</ul>

<h2>Juillet 1998</h2><ul><li>
<b>21 juillet 1998 :</b> jdk1.1.6.V98-7-21.tar.gz.
<ul>
<li>
Portage mis &agrave; jour de JDK1.1.6. Les remerciements vont &agrave;
Keith White <a href="mailto:kwhite@site.uottawa.ca">kwhite@site.uottawa.ca</a>
qui a fait le plus gros travail afin que cette version voit le jour.</li>
<li>
Des 'nommages' plus standards pour java.version et autres.</li>
<li>
Correction des sockets UDP/Multicast.</li>
<li>
Le signal "abort error" devrait &ecirc;tre corrig&eacute; (touchons du bois).</li>
<li>
Ajout de l'encodage "KOI8-R" et "CP866".</li>
<li>
Les fuseaux horaires fonctionnent d&eacute;sormais correctement sous FreeBSD (cela n&eacute;cessite du code
natif mais celui-ci est inclus dans le JDK et donc ne devrait pas g&eacute;ner les utilisateurs. N&eacute;anmoins,
FreeBSD poss&egrave;de maintenant une des rares (la seule ?) machine virtuelle qui supporte correctement les fuseaux
horaires).</li>
<li>
sysRmdir() efface d&eacute;sormais correctement les r&eacute;pertoires.</li>
<li>
Lien vers la librairie xpg4 afin de supporter les localisations CJK.</li>
</ul></li>
</ul>

<h2>Mai 1998</h2><ul><li>
<b>5 mai 1998 :</b>
<ul>
<li>
Mise &agrave; jour de la page pour inclure les instructions d'acquisition de JWS de Sun (Java Work
Shop) fonctionnant sous FreeBSD.</li>
</ul></li>
</ul>

<h2>F&eacute;vrier 1998</h2><ul><li>
<b>25 f&eacute;vrier 1998 :</b> jdk1.1.5.V98-2-25.tar.gz.
<ul>
<li>
La compilation de JDK sur 2.2.2 devrait fonctionner &agrave; nouveau.</li>
<li>
AWT d&eacute;finit maintenant correctement le nom des fen&ecirc;tres.</li>
<li>
Correction d'un bug obscure qui pouvait provoquer un core lorsque l'on clique
plusieurs fois sur un bouton de bo&icirc;te de dialogue.</li>
<li>
Correction d'un bug dans lequel SHMEM n'&eacute;tait pas lib&eacute;r&eacute; lors de l'utilisation d'images, causant une perte m&eacute;moire.</li>
</ul>

<b>12 f&eacute;vrier 1998 :</b>
<ul>
<li>
Johan Larsson a fournit gracieusement un miroir ftp pour le
JDK. Donc si vous avez HTTP en horreur, n'h&eacute;sitez pas &agrave; vous
le procurer depuis ce site.</li>
<li>
Remplacement du logo "Steaming Cup of Java" ("Tasse fumante de Java") par le logo "Jump to Java" ("Passez &agrave; Java")
qui est plus acceptable politiquement (et l&eacute;galement) pour les avocats de SUN.</li>
</ul>

<b>9 f&eacute;vrier 1998 :</b>jdk1.1.5.V98-2-8.tar.gz.
<ul>
<li>
Correction de bugs dans Process.waitFor()</li>
<li>
Modification de la fa&ccedil;on dont la biblioth&egrave;que Motif &eacute;tait li&eacute;e. Cela permettra &agrave; quiconque
poss&eacute;dant la biblioth&egrave;que Motif (statique ou dynamique) de compiler son propre JDK, une fois
que le patch sera sorti. Si leur licence Motif le permet, ils pourront aussi
mettre les versions binaires &agrave; disposition.</li>
<li>
Les lectures non bloquantes sur les PIPE n'&eacute;taient pas fiables sur toutes les versions
du syst&egrave;me d'exploitation.</li>
<li>
Le multicast fonctionne d&eacute;sormais.</li>
</ul></li>
</ul>

<h2>Janvier 1998</h2><ul><li>
<b>janvier 1998 :</b>
<ul>
<li>
Mise en place de l'&eacute;quipe de portage de "JDK" pour FreeBSD qui cr&eacute;e de nouvelles
versions de JDK pour FreeBSD.</li>
<li>
Nouveau binaire JDK1.1.5 contenant Motif statiquement compil&eacute; (malheureusement,
cette version a &eacute;t&eacute; perdue suite &agrave; un crash disque du serveur ftp ).</li>
</ul></li>
</ul>

</td>
</tr></tbody>
</table>

&footer;
</body>
</html>
