Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/remote-install/*.po
Languages: es_es, pt_br

source: To boot <application>mfsBSD</application> image properly, it must be placed on the first (bootable) device of the given machine. This may be accomplished using this example providing that <filename>sda</filename> is the first bootable disk device:
es_es: Para iniciar correctamente la imagen <application>mfsBSD</application>, debe colocarse en el primer dispositivo (bootable) de la máquina en cuestión. Se puede hacer utilizando este ejemplo, siempre que <filename>sda</filename> sea el primer dispositivo de arranque:
pt_br: Para inicializar corretamente a imagem <application>mfsBSD</application>, ela deve ser colocada no primeiro dispositivo (inicializável) da máquina em questão. Isso pode ser feito usando este exemplo, desde que o <filename>sda</filename> seja o primeiro dispositivo de disco inicializável:

source: If all went well, the image should now be in the <acronym>MBR</acronym> of the first device and the machine can be rebooted. Watch for the machine to boot up properly with the <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> tool. Once it has came back on-line, it should be possible to access it over <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> as user <systemitem class="username">root</systemitem> with the configured password.
es_es: Si todo ha ido bien, la imagen debe estar en el <acronym>MBR</acronym> del primer dispositivo y la máquina se puede reiniciar. Observe que la máquina se inicializa correctamente con la herramienta <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Una vez que esté en línea, debería ser posible acceder a ella con <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> como usuario <systemitem class="username">root</systemitem> con la contraseña configurada.
pt_br: Se tudo correu bem, a imagem deve estar agora no <acronym>MBR</acronym> do primeiro dispositivo e a máquina pode ser reinicializada. Observe a máquina inicializar corretamente com a ferramenta <citerefentry><refentrytitle>ping </refentrytitle><manvolnum>8</manvolnum></citerefentry>. Uma vez que tenha retornado on-line, deve ser possível acessá-la com o <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> como o usuário <systemitem class="username"> root </systemitem> usando a senha configurada.

source: Installation of the FreeBSD Operating System
es_es: Instalación del sistema operativo FreeBSD
pt_br: Instalação do sistema operacional do FreeBSD

source: The <application>mfsBSD</application> has been successfully booted and it should be possible to log in through <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>. This section will describe how to create and label slices, set up <application>gmirror</application> for RAID-1, and how to use <application>sysinstall</application> to install a minimal distribution of the FreeBSD operating system.
es_es: <application>mfsBSD</application> se ha iniciado correctamente y debería ser posible iniciar sesión a través de <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>. En esta sección se describe cómo crear y etiquetar slices, configurar <application>gmirror</application> para RAID-1 y cómo utilizar <application>sysinstall</application> para instalar una distribución mínima de FreeBSD.
pt_br: O <application>mfsBSD</application> foi inicializado com sucesso e deve ser possível efetuar login através do <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Esta seção descreverá como criar e rotular os slices, configurar o <application>gmirror</application> para o RAID-1 e como usar o <application>sysinstall</application> para instalar uma distribuição mínima do sistema operacional FreeBSD.

source: Preparation of Hard Drives
es_es: Preparación de los discos duros
pt_br: Preparação de Discos Rígidos

source: The first task is to allocate disk space for FreeBSD, i.e.: to create slices and partitions. Obviously, the currently running system is fully loaded in system memory and therefore there will be no problems with manipulating hard drives. To complete this task, it is possible to use either <application>sysinstall</application> or <citerefentry><refentrytitle>fdisk</refentrytitle><manvolnum>8</manvolnum></citerefentry> in conjunction to <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: La primera tarea es asignar espacio en disco para FreeBSD, es decir: crear slices y particiones. Obviamente, el sistema que está actualmente en ejecución se encuentra completamente cargado en la memoria del sistema y, por lo tanto, no habrá problemas al manipular los discos duros. Para completar esta tarea, es posible usar <application>sysinstall</application> o <citerefentry><refentrytitle>fdisk</refentrytitle><manvolnum>8</manvolnum></citerefentry> en conjunto con <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
pt_br: A primeira tarefa é alocar espaço em disco para o FreeBSD, ou seja: criar slices e partições. Obviamente, o sistema atualmente em execução é totalmente carregado na memória do sistema e, portanto, não haverá problemas com a manipulação dos discos rígidos. Para completar esta tarefa, é possível usar <application>sysinstall</application> ou <citerefentry><refentrytitle>fdisk</refentrytitle><manvolnum>8</manvolnum></citerefentry> em conjunto com o <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: At the start, mark all system disks as empty. Repeat the following command for each hard drive:
es_es: Al principio, marque todos los discos del sistema como vacíos. Repita el siguiente comando para cada disco duro:
pt_br: No início, marque todos os discos do sistema como vazios. Repita o seguinte comando para cada disco rígido:

source: Next, create slices and label them with your preferred tool. While it is considered easier to use <application>sysinstall</application>, a powerful and also probably less buggy method will be to use standard text-based <trademark class="registered">UNIX</trademark> tools, such as <citerefentry><refentrytitle>fdisk</refentrytitle><manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry>, which will also be covered in this section. The former option is well documented in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/install-steps.html">Installing FreeBSD</link> chapter of the FreeBSD Handbook. As it was mentioned in the introduction, this article will present how to set up a system with RAID-1 and <application>ZFS</application> capabilities. Our set up will consist of a small <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> mirrored <filename>/</filename> (root), <filename>/usr</filename> and <filename>/var</filename> dataset, and the rest of the disk space will be allocated for a <citerefentry><refentrytitle>zpool</refentrytitle><manvolnum>8</manvolnum></citerefentry> mirrored <application>ZFS</application> file system. Please note, that the <application>ZFS</application> file system will be configured after the FreeBSD operating system is successfully installed and booted.
es_es: A continuación, cree las slices y etiquételas con su herramienta preferida. A pesar de que se considera más fácil usar <application>sysinstall</application>, un método potente y probablemente menos defectuoso será usar herramientas estándar de <trademark class="registered">UNIX</trademark> basadas en texto, como <citerefentry><refentrytitle>fdisk</refentrytitle><manvolnum>8</manvolnum></citerefentry> y <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry>, también tratadas en esta sección. La primera opción está bien documentada en el capítulo de <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/install-steps.html">Instalación de FreeBSD</link> del Manual de FreeBSD. Como se mencionó en la introducción, este artículo explicará cómo configurar un sistema con RAID-1 y <application>ZFS</application>. Nuestra configuración consistirá en una pequeña partición <filename>/</filename> (raíz), con un conjunto de datos compuesto por <filename>/usr</filename> y <filename>/var</filename>, todos en mirror con <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> y el resto del espacio en disco asignado a un sistema de archivos <application>ZFS</application> en mirror con <citerefentry><refentrytitle>zpool</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Por favor, tenga en cuenta que el sistema de archivos <application>ZFS</application> se configurará después de que el sistema operativo FreeBSD se instale y se inicie correctamente.
pt_br: Em seguida, crie as slices e atribua um label usando sua ferramenta preferida. Embora seja considerado mais fácil usar o <application>sysinstall</application>, um método poderoso e provavelmente com menos bugs será usar as ferramentas padrões de console <trademark class="registered">UNIX</trademark>, como o <citerefentry><refentrytitle>fdisk</refentrytitle><manvolnum>8</manvolnum></citerefentry> e o <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry>, o qual também será abordado nesta seção. A primeira opção está bem documentada no capítulo <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/install-steps.html">Instalando o FreeBSD</link> do Handbook do FreeBSD. Como foi mencionado na introdução, este artigo apresentará como configurar um sistema com recursos RAID-1 e <application>ZFS</application>. Nossa configuração consistirá de uma pequena partição <filename>/</filename> (root) , de um dataset composto por um <filename>/usr</filename> e um <filename>/var</filename> , todos espelhados com o <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry>, e o restante do espaço em disco alocado para um sistema de arquivos <citerefentry><refentrytitle>zpool</refentrytitle><manvolnum>8</manvolnum></citerefentry> espelhado do <application>ZFS</application>. Por favor, observe que o sistema de arquivos<application>ZFS</application> será configurado depois que o sistema operacional FreeBSD for instalado e inicializado com sucesso.

source: The following example will describe how to create slices and labels, initialize <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> on each partition and how to create a <application>UFS2</application> file system in each mirrored partition:
es_es: El siguiente ejemplo describirá cómo crear slices y etiquetas, inicializar <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> en cada partición y cómo crear un sistema de archivos <application>UFS2</application> en cada partición en mirror:
pt_br: O exemplo a seguir descreverá como criar slices e labels, inicializar o <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> em cada partição e como criar um sistema de arquivos <application>UFS2</application> em cada partição espelhada:

source: Create a slice covering the entire disk and initialize the boot code contained in sector 0 of the given disk. Repeat this command for all hard drives in the system.
es_es: Cree una slice que use todo el disco e inicialice el boot code del sector 0 del disco seleccionado. Repita este comando para todos los discos duros en el sistema.
pt_br: Crie uma slice cobrindo todo o disco e inicialize o código de inicialização contido no setor 0 do disco fornecido. Repita este comando para todos os discos rígidos no sistema.

source: Write a standard label for each disk including the bootstrap code.
es_es: Escriba una etiqueta estándar para cada disco, incluido el código de arranque.
pt_br: Escreva um label padrão para cada disco, incluindo o código de bootstrap.

source: Now, manually edit the label of the given disk. Refer to the <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page in order to find out how to create partitions. Create partitions <literal>a</literal> for <filename>/</filename> (root) file system, <literal>b</literal> for swap, <literal>d</literal> for <filename>/var</filename>, <literal>e</literal> for <filename>/usr</filename> and finally <literal>f</literal> which will later be used for <application>ZFS</application>.
es_es: Ahora, manualmente edite la etiqueta del disco. Consulte la página de manual <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry> para saber cómo crear particiones. Cree las particiones siguientes: <literal>a</literal> para el sistema de archivos <filename>/</filename> (raíz), <literal>b</literal> para swap, <literal>d</literal> para <filename>/var</filename>, <literal>e</literal> para <filename>/usr</filename> y finalmente <literal>f</literal>, que luego será utilizada para <application>ZFS</application>.
pt_br: Agora, edite manualmente o label do disco fornecido. Consulte a página de manual do <citerefentry><refentrytitle>bsdlabel</refentrytitle><manvolnum>8</manvolnum></citerefentry>para descobrir como criar partições. Crie as partições <literal>a</literal> para o sistema de arquivos <filename>/</filename> (root) , <literal>b</literal> para swap, <literal>d</literal> para <filename>/var </filename>,<literal>e</literal> para <filename>/usr</filename> e finalmente <literal>f</literal>, que será usado posteriormente para o <application>ZFS</application>.

source: Import the recently created label for the second hard drive, so both hard drives will be labeled in the same way.
es_es: Importe la etiqueta creada recientemente para el segundo disco duro, de modo que ambos discos estén etiquetados de la misma manera.
pt_br: Importe o label recém-criado para o segundo disco rígido, para que ambos os discos sejam rotulados da mesma maneira.

source: Initialize <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> on each partition.
es_es: Inicialice <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> en cada partición.
pt_br: Inicialize o <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> em cada partição.

source: Note that <option>-F</option> is used for the swap partition. This instructs <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> to assume that the device is in the consistent state after the power/system failure.
es_es: Tenga en cuenta que <option>-F</option> se utiliza para la partición swap. Esto le indica a <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum></citerefentry> que asuma que el dispositivo está consistente después de un fallo de alimentación/sistema.
pt_br: Note que <option>-F</option> é usado para a partição de swap. Isso instrui o <citerefentry><refentrytitle>gmirror</refentrytitle><manvolnum>8</manvolnum> </citerefentry> a assumir que o dispositivo está no estado consistente após a falha de energia/sistema.

source: Create a <application>UFS2</application> file system on each mirrored partition.
es_es: Cree un sistema de archivos <application>UFS2</application> en cada partición duplicada.
pt_br: Crie um sistema de arquivos <application>UFS2</application> em cada partição espelhada.

source: System Installation
es_es: Instalación del sistema
pt_br: Instalação do sistema

source: This is the most important part. This section will describe how to actually install the minimal distribution of FreeBSD on the hard drives that we have prepared in the previous section. To accomplish this goal, all file systems need to be mounted so <application>sysinstall</application> may write the contents of FreeBSD to the hard drives:
es_es: Esta es la parte más importante. Esta sección describirá cómo instalar la distribución mínima de FreeBSD en los discos duros que hemos preparado en la sección anterior. Para lograr este objetivo, todos los sistemas de archivos deben montarse, para que <application>sysinstall</application> pueda escribir el contenido de FreeBSD en los discos duros:
pt_br: Esta é a parte mais importante. Esta seção irá descrever como instalar a distribuição mínima do FreeBSD nos discos rígidos que preparamos na seção anterior. Para atingir este objetivo, todos os sistemas de arquivos precisam ser montados para que o <application>sysinstall</application> possa gravar o conteúdo do FreeBSD nos discos rígidos:

source: When you are done, start <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Select the <guimenuitem>Custom</guimenuitem> installation from the main menu. Select <guimenuitem>Options</guimenuitem> and press <keycap>Enter</keycap>. With the help of arrow keys, move the cursor on the <literal>Install Root</literal> item, press <keycap>Space</keycap> and change it to <filename>/mnt</filename>. Press <keycap>Enter</keycap> to submit your changes and exit the <guimenuitem>Options</guimenuitem> menu by pressing <keycap>q</keycap>.
es_es: Cuando haya terminado, inicie <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Seleccione la instalación <guimenuitem>Custom</guimenuitem> en el menú principal. Seleccione <guimenuitem>Options</guimenuitem> y presione <keycap>Enter</keycap>. Con la ayuda de las teclas de dirección, mueva el cursor sobre el elemento <literal>Install Root</literal>, presione <keycap>Space</keycap> y cámbielo a <filename>/mnt</filename>. Presione <keycap>Enter</keycap> para aceptar sus cambios y salga del menú <guimenuitem>Options</guimenuitem> presionando <keycap>q</keycap>.
pt_br: Quando terminar, inicie o <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Selecione a instalação <guimenuitem>Personalizada</guimenuitem> no menu principal. Selecione <guimenuitem>Opções</guimenuitem> e pressione <keycap>Enter</keycap>. Com a ajuda das teclas direcionais, mova o cursor para o item <literal>Install Root</literal>, pressione <keycap>Espaço</keycap> e altere-o para <filename>/mnt</filename>. Pressione <keycap>Enter</keycap> para enviar suas alterações e sair do menu <guimenuitem>Opções</guimenuitem> pressionando <keycap>q</keycap>.

source: Note that this step is very important and if skipped, <application>sysinstall</application> will be unable to install FreeBSD.
es_es: Tenga en cuenta que este paso es muy importante y, si se omite, <application>sysinstall</application> no podrá instalar FreeBSD.
pt_br: Note que este passo é muito importante e se for ignorado, o <application>sysinstall</application> não poderá instalar o FreeBSD.

source: Go to the <guimenuitem>Distributions</guimenuitem> menu, move the cursor with the arrow keys to <option>Minimal</option>, and check it by pressing <keycap>Space</keycap>. This article uses the Minimal distribution in order to save network traffic, because the system itself will be installed over <application>ftp</application>. Exit this menu by choosing <option>Exit</option>.
es_es: Vaya al menú <guimenuitem>Distributions</guimenuitem>, mueva el cursor con las teclas de dirección a <option>Minimal</option> y compruébelo presionando la tecla <keycap>Espacio</keycap>. Este artículo utiliza la distribución mínima para ahorrar tráfico de red, ya que el sistema se instalará por <application>ftp</application>. Salga de este menú seleccionando <option>Exit</option>.
pt_br: Vá para o menu <guimenuitem>Distributions</guimenuitem>, mova o cursor com as teclas de seta para <option>Minimal</option> e selecione-o pressionando <keycap>Space</keycap>. Este artigo usa a distribuição mínima para salvar o tráfego de rede, porque o próprio sistema será instalado por <application>ftp</application>. Saia deste menu escolhendo <option>Exit</option>.

source: The <guimenuitem>Partition</guimenuitem> and <guimenuitem>Label</guimenuitem> menus will be skipped, as these are useless now.
es_es: Los menús <guimenuitem>Partition</guimenuitem> y <guimenuitem>Label</guimenuitem> se omitirán, ya que son inútiles ahora.
pt_br: Os menus <guimenuitem>Partition</guimenuitem> e <guimenuitem>Label</guimenuitem> serão ignorados, pois são inúteis agora.

source: In the <guimenuitem>Media</guimenuitem> menu, select <option>FTP</option>. Select the nearest mirror and let <application>sysinstall</application> assume that the network is already configured. You will be returned back to the <guimenuitem>Custom</guimenuitem> menu.
es_es: En el menú <guimenuitem>Media</guimenuitem>, seleccione <option>FTP</option>. Seleccione el mirror más cercano y deje que <application>sysinstall</application> asuma que la red ya está configurada. Volverá al menú <guimenuitem>Custom</guimenuitem>.
pt_br: No menu <guimenuitem>Media</guimenuitem>, selecione <option>FTP</option>. Selecione o espelho mais próximo e deixe o <application>sysinstall</application> assumir que a rede já está configurada. Você retornará ao menu <guimenuitem>Personalizar</guimenuitem>.

source: Finally, perform the system installation by selecting the last option, <guimenuitem>Commit</guimenuitem>. Exit <application>sysinstall</application> when it finishes the installation.
es_es: Finalmente, realice la instalación del sistema seleccionando la última opción, <guimenuitem>Commit</guimenuitem>. Salga de <application>sysinstall</application> cuando finalice la instalación.
pt_br: Finalmente, realize a instalação do sistema selecionando a última opção, <guimenuitem>Commit</guimenuitem>. Saia do <application>sysinstall </application> quando terminar a instalação.

source: Post Installation Steps
es_es: Pasos posteriores a la instalación
pt_br: Etapas pós-instalação

source: The FreeBSD operating system should be installed now; however, the process is not finished yet. It is necessary to perform some post installation steps in order to allow FreeBSD to boot in the future and to be able to log in to the system.
es_es: El sistema operativo FreBSD ya debería estar instalado; sin embargo, el proceso aún no ha terminado. Es necesario realizar algunos pasos posteriores a la instalación para permitir que FreeBSD se inicie en el futuro y pueda iniciar sesión en el sistema.
pt_br: O sistema operacional do FreeBSD deve estar instalado agora; no entanto, o processo ainda não está concluído. É necessário executar algumas etapas pós-instalação para permitir que o FreeBSD inicialize no futuro e consiga efetuar o login no sistema.

source: You must now <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> into the freshly installed system in order to finish the installation. Use the following command:
es_es: Ahora debe usar el comando <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> en el sistema recién instalado. Use el siguiente comando:
pt_br: Você deve agora executar <citerefentry><refentrytitle>chroot</refentrytitle><manvolnum>8</manvolnum></citerefentry> para o sistema recém-instalado para concluir a instalação. Use o seguinte comando:

source: To complete our goal, perform these steps:
es_es: Para completar nuestro objetivo, siga estos pasos:
pt_br: Para completar nosso objetivo, execute estas etapas:
