Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/remote-install/*.po
Languages: es_es, pt_br

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@mailbox.org, 2019
pt_br: Edson Brandi, ebrandi@FreeBSD.org, 2018 Lucas Andrade, slucasandrade@protonmail.ch, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: Remote Installation of the FreeBSD Operating System Without a Remote Console
es_es: Instalación remota del sistema operativo FreeBSD sin una consola remota
pt_br: Instalação Remota do Sistema Operacional FreeBSD Sem um Console Remoto

source: This article documents the remote installation of the FreeBSD operating system when the console of the remote system is unavailable. The main idea behind this article is the result of a collaboration with Martin Matuska <email>mm@FreeBSD.org</email> with valuable input provided by Paweł Jakub Dawidek <email>pjd@FreeBSD.org</email>.
es_es: Este artículo documenta la instalación remota del sistema operativo FreeBSD cuando la consola del sistema remoto no está disponible. La idea principal detrás de este artículo es el resultado de la colaboración con Martin Matuska <email>mm@FreeBSD.org</email> y con información valiosa proporcionada por Paweł Jakub Dawidek <email>pjd@FreeBSD.org</email>.
pt_br: Este artigo documenta a instalação remota do sistema operacional FreeBSD quando o console do sistema remoto não está disponível. A idéia principal por trás deste artigo é o resultado de uma colaboração com Martin Matuska <email>mm@FreeBSD.org</email> com informações valiosas fornecidas por Paweł Jakub Dawidek <email>pjd@FreeBSD.org</email>.

source: Background
es_es: Antecedentes

source: There are many server hosting providers in the world, but very few of them are officially supporting FreeBSD. They usually provide support for a <trademark class="registered">Linux</trademark> distribution to be installed on the servers they offer.
es_es: Hay muchos proveedores de hosting en el mundo, pero muy pocos soportan oficialmente FreeBSD. Por lo general, dan soporte para instalar una distribución de <trademark class="registered">Linux</trademark> en los servidores que ofrecen.
pt_br: Existem muitos provedores de hospedagem de servidores no mundo, mas poucos deles oferecem suporte oficial ao FreeBSD. Eles geralmente fornecem suporte para uma distribuição <trademark class="registered">Linux</trademark> para ser instalada nos servidores que eles oferecem.

source: In some cases, these companies will install your preferred <trademark class="registered">Linux</trademark> distribution if you request it. Using this option, we will attempt to install FreeBSD. In other cases, they may offer a rescue system which would be used in an emergency. It is possible to use this for our purposes as well.
es_es: En algunos casos, estas compañías instalarán su distribución favorita de <trademark class="registered">Linux</trademark> si lo solicita. Utilizando esta opción, intentaremos instalar FreeBSD. En otros casos, pueden ofrecer un sistema de rescate que se podría usar en caso de emergencia. También es posible usar esta opción para nuestros propósitos.
pt_br: Em alguns casos, estas empresas instalarão sua distribuição <trademark class="registered">Linux</trademark> preferida se você solicitá-la. Usando esta opção, tentaremos instalar o FreeBSD. Em outros casos, eles podem oferecer um sistema de recuperação para ser usado em uma emergência. É possível usá-la para os nossos propósitos também.

source: This article covers the basic installation and configuration steps required to bootstrap a remote installation of FreeBSD with RAID-1 and <application>ZFS</application> capabilities.
es_es: Este artículo cubre los pasos básicos de instalación y configuración necesarios para iniciar una instalación remota de FreeBSD con RAID-1 y <application>ZFS</application>.
pt_br: Este artigo aborda as etapas básicas de instalação e configuração necessárias para inicializar uma instalação remota do FreeBSD com suporte para RAID-1 e <application>ZFS</application>.

source: Introduction
es_es: Introducción
pt_br: Introdução

source: This section will summarize the purpose of this article and better explain what is covered herein. The instructions included in this article will benefit those using services provided by colocation facilities not supporting FreeBSD.
es_es: Esta sección resumirá el propósito del artículo y explicará mejor lo que se trata en este documento. Las instrucciones incluidas beneficiarán a quienes utilicen los servicios proporcionados por las instalaciones de colocación de servidores que no admiten FreeBSD.
pt_br: Esta seção resumirá o objetivo deste artigo e explicará melhor o que é tratado aqui. As instruções incluídas neste artigo beneficiarão aqueles usuários que usam serviços fornecidos por provedores de colocation que não suportam o FreeBSD.

source: As we have mentioned in the <link linkend="background">Background</link> section, many of the reputable server hosting companies provide some kind of rescue system, which is booted from their <acronym>LAN</acronym> and accessible over <application>SSH</application>. They usually provide this support in order to help their customers fix broken operating systems. As this article will explain, it is possible to install FreeBSD with the help of these rescue systems.
es_es: Como hemos mencionado en la sección de <link linkend="background">Antecedentes</link>, muchas de las empresas más respetadas de hosting ofrecen algún tipo de sistema de rescate, que se inicia desde su <acronym>LAN</acronym> y es accesible por <application>SSH</application>. Por lo general, dan este soporte para ayudar a sus clientes a reparar sistemas operativos dañados. Como se explicará en este artículo, es posible instalar FreeBSD con la ayuda de estos sistemas de rescate.
pt_br: Como mencionamos na seção <link linkend="background">​​Background</link>, muitas das empresas de hospedagem de servidores renomadas fornecem algum tipo de sistema de recuperação, que é inicializado a partir de sua <acronym>LAN</acronym> e acessível por <application>SSH</application>. Eles normalmente fornecem esse suporte para ajudar seus clientes a consertar sistemas operacionais quebrados. Como este artigo explicará, é possível instalar o FreeBSD com a ajuda destes sistemas de recuperação.

source: The next section of this article will describe how to configure, and build minimalistic FreeBSD on the local machine. That version will eventually be running on the remote machine from a ramdisk, which will allow us to install a complete FreeBSD operating system from an <acronym>FTP</acronym> mirror using the <application>sysinstall</application> utility.
es_es: La siguiente sección del artículo describirá cómo configurar y compilar una versión minimalista de FreeBSD en la máquina local. Esa versión finalmente se ejecutará en la máquina remota desde ramdisk, lo que nos permitirá instalar un sistema operativo FreeBSD completo desde un mirror <acronym>FTP</acronym> usando la utilidad <application>sysinstall</application>.
pt_br: A próxima seção deste artigo descreverá como configurar e compilar uma versão mínima do FreeBSD na máquina local. Essa versão eventualmente será executada na máquina remota a partir de um ramdisk, o que nos permitirá instalar um sistema operacional completo do FreeBSD a partir de um espelho <acronym>FTP</acronym>usando o utilitário<application>sysinstall</application>.

source: The rest of this article will describe the installation procedure itself, as well as the configuration of the <application>ZFS</application> file system.
es_es: El resto del artículo describirá el proceso de instalación, así como la configuración del sistema de archivos <application>ZFS</application>.
pt_br: O restante deste artigo descreverá o procedimento de instalação em si, bem como a configuração do sistema de arquivos <application>ZFS</application>.

source: Requirements
es_es: Requisitos
pt_br: Requisitos

source: To continue successfully, you must:
es_es: Para continuar con éxito, debe:
pt_br: Para continuar com sucesso, você deve:

source: Have a network accessible operating system with <application>SSH</application> access
es_es: Tener un sistema operativo accesible por la red con acceso <application>SSH</application>
pt_br: Ter um sistema operacional acessível pela rede com acesso <application>SSH</application>

source: Understand the FreeBSD installation process
es_es: Entender el proceso de instalación de FreeBSD
pt_br: Entender o processo de instalação do FreeBSD

source: Be familiar with the <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry> utility
es_es: Estar familiarizado con la utilidad <citerefentry><refentrytitle>sysinstall</refentrytitle><manvolnum>8</manvolnum></citerefentry>
pt_br: Familiarizar-se com o utilitário <citerefentry><refentrytitle>sysinstall</refentrytitle> <manvolnum>8</manvolnum></citerefentry>

source: Have the FreeBSD installation <acronym>ISO</acronym> image or <acronym>CD</acronym> handy
es_es: Tener a mano la imagen <acronym>ISO</acronym> o el <acronym>CD</acronym> de instalación de FreeBSD
pt_br: Ter a imagem <acronym>ISO</acronym> de instalação do FreeBSD ou o <acronym> CD </acronym> de instalação à mão

source: Preparation - <application>mfsBSD</application>
es_es: Preparación - <application>mfsBSD</application>
pt_br: Preparação - <application>mfsBSD</application>

source: Before FreeBSD may be installed on the target system, it is necessary to build the minimal FreeBSD operating system image which will boot from the hard drive. This way the new system can be accessed from the network, and the rest of the installation can be done without remote access to the system console.
es_es: Antes de poder instalar FreeBSD en el sistema de destino, es necesario crear la imagen mínima de FreeBSD que se iniciará desde el disco duro. De esta manera, se puede acceder al nuevo sistema desde la red, y el resto de la instalación se puede hacer sin acceso remoto a la consola del sistema.
pt_br: Antes que o FreeBSD possa ser instalado no sistema de destino, é necessário construir a imagem mínima do sistema operacional FreeBSD que será inicializada a partir do disco rígido. Dessa forma, o novo sistema pode ser acessado a partir da rede e o restante da instalação pode ser feito sem acesso remoto ao console do sistema.

source: The <application>mfsBSD</application> tool-set can be used to build a tiny FreeBSD image. As the name of <application>mfsBSD</application> suggests (<quote>mfs</quote> means <quote>memory file system</quote>), the resulting image runs entirely from a ramdisk. Thanks to this feature, the manipulation of hard drives will not be limited, therefore it will be possible to install a complete FreeBSD operating system. The <application>mfsBSD</application> <uri xlink:href="http://mfsbsd.vx.sk/">home page</uri> includes pointers to the latest release of the toolset.
es_es: El conjunto de herramientas <application>mfsBSD</application> se puede usar para construir una imagen pequeña de FreeBSD. Como sugiere el nombre de <application>mfsBSD</application> (<quote>mfs</quote> significa <quote>sistema de archivos en memoria</quote>), la imagen resultante se ejecuta completamente desde ramdisk. Gracias a esta característica, la manipulación de los discos duros no estará limitada, por lo que será posible instalar un sistema operativo completo FreeBSD. La <uri xlink:href="http://mfsbsd.vx.sk/">página web</uri> de <application>mfsBSD</application> incluye indicaciones a la última versión del conjunto de herramientas.
pt_br: O conjunto de ferramentas <application>mfsBSD</application> pode ser usado para construir uma pequena imagem do FreeBSD. Como o nome <application>mfsBSD</application> sugere (<quote>mfs</quote> significa <quote>sistema de arquivos em memória</quote>), a imagem resultante é executada inteiramente de um ramdisk. Graças a este recurso, a manipulação de discos rígidos não será limitada, portanto, será possível instalar um sistema operacional completo do FreeBSD. A <uri xlink:href="http://mfsbsd.vx.sk/">página inicial</uri> do <application>mfsBSD</application> inclui links para a versão mais recente do conjunto de ferramentas.

source: Please note that the internals of <application>mfsBSD</application> and how it all fits together is beyond the scope of this article. The interested reader should consult the original documentation of <application>mfsBSD</application> for more details.
es_es: Tenga en cuenta que los aspectos internos de <application>mfsBSD</application> están fuera del alcance de este artículo. El lector interesado debe consultar la documentación oficial de <application>mfsBSD</application> para obtener más detalles.
pt_br: Por favor, note que os detalhes de como o <application>mfsBSD</application> funciona internamente e como tudo se encaixa está além do escopo deste artigo. O leitor interessado deve consultar a documentação original do <application>mfsBSD</application> para mais detalhes.

source: Download and extract the latest <application>mfsBSD</application> release and change your working directory to the directory where the <application>mfsBSD</application> scripts will reside:
es_es: Descargue y extraiga la última versión de <application>mfsBSD</application> y cambie su directorio de trabajo al directorio donde se encuentren los scripts de <application>mfsBSD</application>:
pt_br: Faça o download e extraia a versão mais recente do <application>mfsBSD</application> e altere seu diretório de trabalho para o diretório em que os scripts <application>mfsBSD</application> residirão:

source: Configuration of <application>mfsBSD</application>
es_es: Configuración de <application>mfsBSD</application>
pt_br: Configuração do <application>mfsBSD</application>

source: Before booting <application>mfsBSD</application>, a few important configuration options have to be set. The most important that we have to get right is, naturally, the network setup. The most suitable method to configure networking options depends on whether we know beforehand the type of the network interface we will use, and the network interface driver to be loaded for our hardware. We will see how <application>mfsBSD</application> can be configured in either case.
es_es: Antes de iniciar <application>mfsBSD</application>, deben establecerse algunas opciones de configuración importantes. Lo más importante que tenemos que configurar bien es, naturalmente, la configuración de red. El método más adecuado para configurar las opciones de red dependerá de si conocemos previamente el tipo de interfaz de red que usaremos, y el controlador de red que se cargará para nuestro hardware. Veremos cómo se puede configurar <application>mfsBSD</application> en cualquier caso.
pt_br: Antes de inicializar o <application>mfsBSD</application>, algumas opções importantes de configuração precisam ser definidas. O mais importante que temos que acertar é, naturalmente, a configuração da rede. O método mais adequado para configurar opções de rede depende se sabemos de antemão o tipo de interface de rede que usaremos e o driver da interface de rede a ser carregado para o nosso hardware. Vamos ver como o <application>mfsBSD</application> pode ser configurado em ambos os casos.

source: Another important thing to set is the <systemitem class="username">root</systemitem> password. This can be done by editing <filename>conf/loader.conf</filename>. Please see the included comments.
es_es: Otra cosa importante es establecer la contraseña del usuario <systemitem class="username">root</systemitem>. Esto se puede hacer editando <filename>conf/loader.conf</filename>. Por favor lea los comentarios incluidos.
pt_br: Outra coisa importante para definir é a senha do usuário <systemitem class="username">root</systemitem>. Isto pode ser feito editando o <filename>conf/loader.conf</filename>. Por favor, veja os comentários incluídos no arquivo.

source: The <filename>conf/interfaces.conf</filename> method
es_es: El método <filename>conf/interfaces.conf</filename>
pt_br: O método <filename>conf/interfaces.conf</filename>

source: When the installed network interface card is unknown, it is possible to use the auto-detection features of <application>mfsBSD</application>. The startup scripts of <application>mfsBSD</application> can detect the correct driver to use, based on the MAC address of the interface, if we set the following options in <filename>conf/interfaces.conf</filename>:
es_es: Cuando se desconoce la tarjeta de red instalada, es posible utilizar las funciones de detección automática de <application>mfsBSD</application>. Los scripts de inicio de <application>mfsBSD</application> pueden detectar el controlador correcto, según la dirección MAC de la interfaz, si configuramos las siguientes opciones en <filename>conf/interfaces.conf</filename>:
pt_br: Quando a placa de rede instalada é desconhecida, é possível usar os recursos de detecção automática do <application>mfsBSD</application>. Os scripts de inicialização do <application>mfsBSD</application> podem detectar o driver correto a ser usado, com base no endereço MAC da interface, se configurarmos as seguintes opções em <filename>conf/interfaces.conf</filename>:

source: Do not forget to add the <literal>defaultrouter</literal> information to <filename>conf/rc.conf</filename>:
es_es: No olvide agregar <literal>defaultrouter</literal> a <filename>conf/rc.conf</filename>:
pt_br: Não esqueça de adicionar a informação <literal>defaultrouter</literal> ao <filename>conf/rc.conf</filename>:

source: The <filename>conf/rc.conf</filename> Method
es_es: El método <filename>conf/rc.conf</filename>
pt_br: O método <filename>conf/rc.conf</filename>

source: When the network interface driver is known, it is more convenient to use <filename>conf/rc.conf</filename> for networking options. The syntax of this file is the same as the one used in the standard <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> file of FreeBSD.
es_es: Cuando se conoce el controlador de la interfaz de red, es más conveniente utilizar <filename>conf/rc.conf</filename> para las opciones de red. La sintaxis de este fichero es la misma que la utilizada en el fichero <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> de FreeBSD.
pt_br: Quando o driver da interface de rede é conhecido, é mais conveniente usar <filename>conf/rc.conf</filename> para opções de rede. A sintaxe deste arquivo é a mesma usada no arquivo padrão <citerefentry><refentrytitle>rc.conf </refentrytitle><manvolnum>5</manvolnum></citerefentry> do FreeBSD.

source: For example, if you know that a <citerefentry><refentrytitle>re</refentrytitle><manvolnum>4</manvolnum></citerefentry> network interface is going to be available, you can set the following options in <filename>conf/rc.conf</filename>:
es_es: Por ejemplo, si sabe que una interfaz de red <citerefentry><refentrytitle>re</refentrytitle><manvolnum>4</manvolnum></citerefentry> estará disponible, puede configurar las siguientes opciones en <filename>conf/rc.conf</filename>:
pt_br: Por exemplo, se você souber que uma interface de rede <citerefentry><refentrytitle>re</refentrytitle><manvolnum>4</manvolnum></citerefentry> estará disponível, você pode definir as seguintes opções em <filename>conf/rc.conf</filename>:

source: Building an <application>mfsBSD</application> Image
es_es: Creando una imagen de <application>mfsBSD</application>
pt_br: Construindo uma imagem do <application>mfsBSD</application>

source: The process of building an <application>mfsBSD</application> image is pretty straightforward.
es_es: El proceso de creación de una imagen de <application>mfsBSD</application> es bastante sencillo.
pt_br: O processo de construção de uma imagem <application>mfsBSD</application> é bastante simples.

source: The first step is to mount the FreeBSD installation <acronym>CD</acronym>, or the installation <acronym>ISO</acronym> image to <filename>/cdrom</filename>. For the sake of example, in this article we will assume that you have downloaded the FreeBSD 10.1-RELEASE <acronym>ISO</acronym>. Mounting this ISO image to the <filename>/cdrom</filename> directory is easy with the <citerefentry><refentrytitle>mdconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry> utility:
es_es: El primer paso es montar el <acronym>CD</acronym> de instalación de FreeBSD, o la imagen <acronym>ISO</acronym> de instalación en <filename>/cdrom</filename>. Por ejemplo, en este artículo asumiremos que ha descargado la ISO FreeBSD 10.1-RELEASE. Montar esta imagen <acronym>ISO</acronym> en el directorio <filename>/cdrom</filename> es fácil con la utilidad <citerefentry><refentrytitle>mdconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry>:
pt_br: O primeiro passo é montar o <acronym>CD</acronym> de instalação do FreeBSD, ou a imagem <acronym>ISO</acronym> de instalação em <filename>/cdrom </filename>. Por exemplo, neste artigo vamos supor que você tenha baixado o <acronym>ISO</acronym> do FreeBSD 10.1-RELEASE. Montar esta imagem ISO no diretório <filename>/cdrom</filename> é fácil de se fazer com o utilitário <citerefentry><refentrytitle>mdconfig</refentrytitle><manvolnum>8</manvolnum></citerefentry>:

source: Since the recent FreeBSD releases do not contain regular distribution sets, it is required to extract the FreeBSD distribution files from the distribution archives located on the <acronym>ISO</acronym> image:
es_es: Como las versiones recientes de FreeBSD no contienen los sets regulares de la distribución, es necesario extraerlos de la imagen <acronym>ISO</acronym>:
pt_br: Como as versões recentes do FreeBSD não contêm conjuntos de distribuição regulares, é necessário extrair os arquivos de distribuição do FreeBSD dos arquivos de distribuição localizados na imagem <acronym>ISO</acronym>:

source: Next, build the bootable <application>mfsBSD</application> image:
es_es: A continuación, genere la imagen <application>mfsBSD</application> de arranque:
pt_br: Em seguida, construa a imagem <application>mfsBSD</application> inicializável:

source: The above <command>make</command> has to be run from the top level of the <application>mfsBSD</application> directory tree, for example <filename>~/mfsbsd-2.1/</filename>.
es_es: El comando <command>make</command> anterior debe ejecutarse desde el nivel superior del árbol de directorios de <application>mfsBSD</application>, por ejemplo <filename>~/mfsbsd-2.1/</filename>.
pt_br: O <command>make</command> acima deve ser executado a partir do nível superior da árvore de diretórios do <application>mfsBSD</application>, por exemplo, <filename>~/mfsbsd-2.1/</filename>.

source: Booting <application>mfsBSD</application>
es_es: Iniciando <application>mfsBSD</application>
pt_br: Inicializando o <application>mfsBSD</application>

source: Now that the <application>mfsBSD</application> image is ready, it must be uploaded to the remote system running a live rescue system or pre-installed <trademark class="registered">Linux</trademark> distribution. The most suitable tool for this task is <application>scp</application>:
es_es: Ahora que la imagen <application>mfsBSD</application> está lista, se debe cargar en el sistema remoto ejecutando el sistema de recuperación o una distribución de <trademark class="registered">Linux</trademark> preinstalada. La herramienta más adecuada para esta tarea es <application>scp</application>:
pt_br: Agora que a imagem <application>mfsBSD</application> está pronta, ela deve ser carregada para o sistema remoto executando o sistema de recuperação ou uma distribuição <trademark class="registered">Linux</trademark> pré-instalada. A ferramenta mais adequada para essa tarefa é o <application>scp</application>:
