Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/remote-install/*.po
Languages: es_es, pt_br

source: Copy the <literal>GENERIC</literal> kernel to the <filename>/boot/kernel</filename> directory:
es_es: Copie el kernel <literal>GENERIC</literal> al directorio <filename>/boot/kernel</filename>:
pt_br: Copie o kernel <literal>GENERIC</literal> para o diretório <filename>/boot/kernel</filename>:

source: Create the <filename>/etc/rc.conf</filename>, <filename>/etc/resolv.conf</filename> and <filename>/etc/fstab</filename> files. Do not forget to properly set the network information and to enable <application>sshd</application> in <filename>/etc/rc.conf</filename>. The contents of <filename>/etc/fstab</filename> will be similar to the following:
es_es: Cree los ficheros <filename>/etc/rc.conf</filename>, <filename>/etc/resolv.conf</filename> y <filename>/etc/fstab</filename>. No olvide configurar correctamente la información de red y habilitar <application>sshd</application> en <filename>/etc/rc.conf</filename>. El contenido de <filename>/etc/fstab</filename> será similar al siguiente:
pt_br: Crie os arquivos <filename>/etc/rc.conf</filename>, <filename>/etc/resolv.conf </filename> e <filename>/etc/fstab</filename>. Não se esqueça de configurar corretamente as informações de rede e ativar o <application>sshd</application> em <filename>/etc/rc.conf</filename>. O conteúdo do <filename>/etc/fstab</filename> será semelhante ao seguinte:

source: Create <filename>/boot/loader.conf</filename> with the following contents:
es_es: Cree <filename>/boot/loader.conf</filename> con el siguiente contenido:
pt_br: Crie o <filename>/boot/loader.conf</filename> com o seguinte conteúdo:

source: Perform the following command, which will make <application>ZFS</application> available on the next boot:
es_es: Ejecute el siguiente comando, hará que <application>ZFS</application> se encuentre disponible en el siguiente arranque:
pt_br: Execute o seguinte comando, que disponibilizará o <application>ZFS</application> na próxima inicialização:

source: Add additional users to the system using the <citerefentry><refentrytitle>adduser</refentrytitle><manvolnum>8</manvolnum></citerefentry> tool. Do not forget to add a user to the <systemitem class="groupname">wheel</systemitem> group so you may obtain root access after the reboot.
es_es: Agregue usuarios adicionales al sistema usando la herramienta <citerefentry><refentrytitle>adduser</refentrytitle><manvolnum>8</manvolnum></citerefentry>. No olvide agregar un usuario al grupo <systemitem class="groupname">wheel</systemitem> para que pueda obtener acceso al usuario root después del reinicio.
pt_br: Adicione usuários adicionais ao sistema usando a ferramenta <citerefentry><refentrytitle>adduser</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Não se esqueça de adicionar um usuário ao grupo <systemitem class="groupname">wheel</systemitem> para que você possa obter acesso root após a reinicialização.

source: Double-check all your settings.
es_es: Vuelva a comprobar todas sus configuraciones.
pt_br: Verifique todas as suas configurações.

source: The system should now be ready for the next boot. Use the <citerefentry><refentrytitle>reboot</refentrytitle><manvolnum>8</manvolnum></citerefentry> command to reboot your system.
es_es: El sistema debería estar listo para el siguiente arranque. Use el comando <citerefentry><refentrytitle>reboot</refentrytitle><manvolnum>8</manvolnum></citerefentry> para reiniciar su sistema.
pt_br: O sistema deve estar pronto para a próxima inicialização. Use o comando <citerefentry><refentrytitle>reboot</refentrytitle><manvolnum>8</manvolnum></citerefentry> para reinicializar seu sistema.

source: If your system survived the reboot, it should now be possible to log in. Welcome to the fresh FreeBSD installation, performed remotely without the use of a remote console!
es_es: Si su sistema sobrevivió al reinicio, ahora debería poder iniciar sesión. ¡Bienvenido a la nueva instalación de FreeBSD, realizada de forma remota sin el uso de una consola remota!
pt_br: Se o seu sistema sobreviveu à reinicialização, agora deve ser possível efetuar login. Bem-vindo à nova instalação do FreeBSD, executada remotamente sem o uso de um console remoto!

source: The only remaining step is to configure <citerefentry><refentrytitle>zpool</refentrytitle><manvolnum>8</manvolnum></citerefentry> and create some <citerefentry><refentrytitle>zfs</refentrytitle><manvolnum>8</manvolnum></citerefentry> file systems. Creating and administering <application>ZFS</application> is very straightforward. First, create a mirrored pool:
es_es: El único paso que queda es configurar <citerefentry><refentrytitle>zpool</refentrytitle><manvolnum>8</manvolnum></citerefentry> y crear algunos sistemas de archivos <citerefentry><refentrytitle>zfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Crear y administrar <application>ZFS</application> es muy sencillo. Primero, cree un pool reflejado:
pt_br: O único passo restante é configurar o <citerefentry><refentrytitle>zpool</refentrytitle><manvolnum>8</manvolnum></citerefentry> e criar algum sistemas de arquivos <citerefentry><refentrytitle>zfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Criar e administrar o <application>ZFS </application> é muito simples. Primeiro, crie um pool espelhado:

source: Next, create some file systems:
es_es: A continuación, cree algunos sistemas de archivos:
pt_br: Em seguida, crie alguns sistemas de arquivos:

source: That is all. If you are interested in more details about <application>ZFS</application> on FreeBSD, please refer to the <link xlink:href="https://wiki.freebsd.org/ZFS">ZFS</link> section of the FreeBSD Wiki.
es_es: Eso es todo. Si está interesado en obtener más información sobre <application>ZFS</application> en FreeBSD, consulte la sección <link xlink:href="https://wiki.freebsd.org/ZFS">ZFS</link> de la wiki de FreeBSD.
pt_br: Isso é tudo. Se você está interessado em mais detalhes sobre o <application>ZFS</application>no FreeBSD, por favor consulte a seção <link xlink:href="https://wiki.freebsd.org/ZFS">ZFS</link> do o Wiki do FreeBSD.

source: <year>2008</year> <holder>The FreeBSD Documentation Project</holder>
pt_br: <year>2008</year> <holder>Projeto de Documentação do FreeBSD</holder>
