Repository: freebsd/freebsd-doc
Catalog: *.ISO8859-1/articles/leap-seconds/*.po
Languages: es_es, nl_nl, pt_br

# _
source: translator-credits
es_es: Federico Caminiti demian.fc@gmail.com Sergio Carlavilla carlavilla@mailbox.org, 2019
nl_nl: vertaling
pt_br: Nilton José Rizzo, rizzo@rizzo.eng.br, 2018 Edson Brandi, ebrandi@FreeBSD.org, 2018 Danilo G. Baio, dbaio@FreeBSD.org, 2018

source: FreeBSD Support for Leap Seconds
es_es: Soporte para segundos intercalares en FreeBSD
nl_nl: Ondersteuning voor schrikkelseconden in FreeBSD
pt_br: Suporte do FreeBSD a Leap Seconds

source: $FreeBSD: head/en_US.ISO8859-1/articles/leap-seconds/article.xml 51243 2017-11-30 14:49:53Z ygy $
pt_br: $FreeBSD$

source: Introduction
es_es: Introducción
nl_nl: Introductie
pt_br: Introdução

source: A <emphasis>leap second</emphasis> is an one second adjustment made at specific times of year to UTC to synchronize atomic time scales with variations in the rotation of the Earth. This article describes how FreeBSD interacts with leap seconds.
es_es: Un <emphasis>segundo intercalar</emphasis> es un ajuste de un segundo realizado en momentos específicos del año a UTC para sincronizar escalas de tiempo atómicas con variaciones en la rotación de la Tierra. Este artículo describe cómo FreeBSD interactúa con segundos intercalares.
pt_br: Um <emphasis>leap second</emphasis> é o ajuste de um segundo feito em momentos específicos do ano para sincronizar a escala atômica de tempo do UTC com a variação da rotação da terra. Esse artigo descreve como o FreeBSD interage com o leap seconds.

source: As of this writing, the next leap second will occur at 2015-Jun-30 23:59:60 UTC. This leap second will occur during a business day for North and South America and the Asia/Pacific region.
es_es: En el momento de escribir estas líneas, el próximo segundo intercalar ocurrirá el 30 de junio del 2015 a las 23:59:60 UTC. Este segundo intercalar ocurrirá durante un dí­a laboral para América del Norte y del Sur y la región Asia/Pací­fico.
nl_nl: Op het moment van schrijven zal de volgende schrikkelseconde plaatsvinden op 2015-juni-30 23:59:60 UTC. Deze schrikkelseconde zal plaatsvinden op een werkdag voor Noord- en Zuid-Amerika en het Aziatische/Pacifische gebied.
pt_br: No momento em que este artigo está sendo escrito, a próxima ocorrência do leap second irá acontecer em 30 de junho de 2015 as 23:59:60 UTC. Esse leap second ira ocorrer durante um dia útil para as Américas do Norte e do Sul e a região da Ásia/Pacifico.

source: Leap seconds are announced by <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> on <link xlink:href="http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16">Bulletin C</link>.
es_es: Los segundos intercalares son anunciados por el <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> en el <link xlink:href="http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16">Boletín C</link>.
nl_nl: Schrikkelseconden worden aangekondigd door <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> op <link xlink:href="http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16">Bulletin C</link>.
pt_br: Leap Seconds são anunciados pelo <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> no <link xlink:href="http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16">Bulletin C</link>.

source: Standard leap second behavior is described in <link xlink:href="https://tools.ietf.org/html/rfc7164#section-3">RFC 7164</link>. Also see <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
es_es: El comportamiento estándar de los segundos intercalares se describe en <link xlink:href="https://tools.ietf.org/html/rfclink7164#section-3">RFC 7164</link>. Véase también <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
nl_nl: Het standaardgedrag van schrikkelseconden is beschreven in <link xlink:href="https://tools.ietf.org/html/rfc7164#section-3">RFC 7164</link>. Zie ook <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
pt_br: O comportamento padrão do leap Seconds é descrito na <link xlink:href="https://tools.ietf.org/html/rfc7164#section-3">RFC 7164</link>. Veja também em <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry>.

source: Default Leap Second Handling on FreeBSD
es_es: Manejo por defecto de los segundos intercalares en FreeBSD
nl_nl: De standaardomgang met schrikkelseconden op FreeBSD
pt_br: Manipulação padrão do leap seconds no FreeBSD

source: The easiest way to handle leap seconds is with the <acronym>POSIX</acronym> time rules FreeBSD uses by default, combined with <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link>. When <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> is running and the time is synchronized with upstream <acronym>NTP</acronym> servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
es_es: La manera más fácil de manejar segundos intercalares es con las reglas de tiempo de <acronym>POSIX</acronym> que FreeBSD utiliza por defecto, combinadas con <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link>. Cuando <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> se esté ejecutando y el tiempo esté sincronizado con servidores remotos de <acronym>NTP</acronym> que manejen segundos intercalares correctamente, dicho segundo intercalar hará que el tiempo del sistema automáticamente repita el último segundo del dí­a. Ningún otro ajuste es necesario.
pt_br: A maneira mais fácil de manipular o leap seconds é com a regra de tempo <acronym>POSIX</acronym> que é utilizada por padrão pelo FreeBSD, combinada com o <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link>. Quando o <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> está sendo executado e o tempo é sincronizado com os servidores <acronym>NTP</acronym> de upstream que gerenciam o leap seconds corretamente, o leap second causará a repetição do último segundo do dia de forma automática. Nenhum outro ajuste será necessário.

source: If the upstream <acronym>NTP</acronym> servers do not handle leap seconds correctly, <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> will step the time by one second after the errant upstream server has noticed and stepped itself.
es_es: Si los servidores remotos de <acronym>NTP</acronym> no manejan los segundos intercalares correctamente, <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> aumentará el tiempo en un segundo, después de que el servidor errático lo haya notado y haya saltado él mismo ese segundo.
nl_nl: Als de bovenliggende <acronym>NTP</acronym>-servers schrikkelseconden niet correct afhandelen, zal <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> de tijd met één seconde laten verspringen nadat de foutieve bovenliggende server dit opgemerkt heeft en zelf is versprongen.
pt_br: Se os servidores de <acronym>NTP</acronym> upstream não gerenciarem o leap seconds corretamente, o <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> irá avançar em um segundo após o servidor se corrigir.

source: If <acronym>NTP</acronym> is not being used, manual adjustment of the system clock will be required after the leap second has passed.
es_es: Si no se usa <acronym>NTP</acronym>, se requerirá el ajuste manual del reloj del sistema una vez que el segundo intercalar haya pasado.
nl_nl: Als <acronym>NTP</acronym> niet wordt gebruikt, is het nodig om de systeemklok handmatig aan te passen nadat de schrikkelseconde is verstreken.
pt_br: Se o <acronym>NTP</acronym> não está sendo utilizado, será necessário um ajuste manual do relógio do sistema apois o leap seconds ter passado.

source: Cautions
es_es: Precauciones
nl_nl: Waarschuwingen
pt_br: Cuidados

source: Leap seconds are inserted at the same instant all over the world: <acronym>UTC</acronym> midnight. In Japan that is mid-morning, in the Pacific mid-day, in the Americas late afternoon, and in Europe at night.
es_es: Los segundos intercalares se insertan en el mismo instante en todo el mundo: a medianoche según <acronym>UTC</acronym>. En Japón esto ocurre a media mañana, en el Pacífico al mediodía, en América es por la tarde-noche y en Europa por la noche.
nl_nl: Schrikkelseconden worden wereldwijd op hetzelfde moment ingevoegd: middernacht <acronym>UTC</acronym>. In Japan is dit in het midden van de ochtend, in het Pacifisch gebied in het midden van de dag, in Amerika in de namiddag en in Europa in de nacht.
pt_br: Os Leap seconds são inseridos no mesmo instante em todo o mundo a meia noite <acronym>UTC</acronym>. No Japão será no meio da manhã e no Pacífico ao meio dia, nas Américas a tarde e na Europa à noite.

source: We believe and expect that FreeBSD, if provided correct and stable <acronym>NTP</acronym> service, will work as designed during this leap second, as it did during the previous ones.
es_es: Creemos y esperamos que FreeBSD, si se proporciona un servicio <acronym>NTP</acronym> correcto y estable, funcionará como se diseñó durante este segundo, como lo hizo durante los anteriores.
nl_nl: We geloven en verwachten dat FreeBSD, mits voorzien van een correcte en stabiele <acronym>NTP</acronym>-dienst, zal werken als ontworpen tijdens deze schrikkelseconde, zoals het tijdens de voorgaande deed.
pt_br: Nos acreditamos e esperamos que o FreeBSD, se provido de um serviço de <acronym>NTP</acronym> estável, irá funcionar como foi especificado durante o leap second, como aconteceu nos anteriores.

source: However, we caution that practically no applications have ever asked the kernel about leap seconds. Our experience is that, as designed, leap seconds are essentially a replay of the second before the leap second, and this is a surprise to most application programmers.
es_es: De todas formas, asumimos que prácticamente ninguna aplicación ha requerido información del kernel acerca del segundo intercalar. Nuestra experiencia es que, tal como está diseñado, el segundo intercalar es esencialmente una repetición del segundo antes del segundo intercalar, esto es una sorpresa para la mayoría de los programadores.
nl_nl: We waarschuwen echter dat praktisch geen enkele toepassing de kernel ooit om schrikkelseconden heeft gevraagd. Onze verwachting is dat, zoals ontworpen, schrikkelseconden in feite een herhaling zijn van de seconde voor de schrikkelseconde, wat een verassing is voor de meeste toepassingsprogrammeurs.
pt_br: Enrtetanto, nós alertamos que praticamente nenhum aplicativo nunca questionou o kernel sobre leap seconds. Nossa experiência é que, como projetado, leap seconds são, essencialmente, a repetição do último segundo antes do leap second, e isso é uma surpresa para a maioria dos programadores.

source: Other operating systems and other computers may or may not handle the leap-second the same way as FreeBSD, and systems without correct and stable <acronym>NTP</acronym> service will not know anything about leap seconds at all.
es_es: Otros sistemas operativos y computadoras pueden o no manejar el segundo intercalar de la misma forma que FreeBSD, y los sistemas sin un servicio <acronym>NTP</acronym> correcto y estable no sabrán nada sobre el segundo intercalar.
nl_nl: Andere besturingssystemen en computers kunnen de schrikkelseconde op een andere manier dan FreeBSD afhandelen, en systemen zonder correcte en stabiele <acronym>NTP</acronym>-dienst zullen in het geheel niks van schrikkelseconden weten.
pt_br: Outros sistemas operacionais e computadores podem ou não manipular o leap seconds da mesma maneira que o FreeBSD e sistemas sem um serviço correto e estável de <acronym>NTP</acronym> não terão conhecimento algum sobre a ocorrência de leap seconds.

source: It is not unheard of for computers to crash because of leap seconds, and experience has shown that a large fraction of all public <acronym>NTP</acronym> servers might handle and announce the leap second incorrectly.
es_es: No es extraño que las computadoras fallen a causa del segundo intercalar, y la experiencia ha demostrado que una gran parte de los servidores públicos de <acronym>NTP</acronym> pueden manejar y anunciar incorrectamente el segundo intercalar.
nl_nl: Het komt voor dat computers crashen vanwege schrikkelseconden, en ervaring laat zien dat een groot gedeelte van alle publieke <acronym>NTP</acronym>-servers de schrikkelseconde onjuist kunnen aankondigen en afhandelen.
pt_br: Não é inétido que os computadores travem por causa do leap seconds, e a experiência mostra que uma grande parte de todos os servidores públicos de <acronym>NTP</acronym> podem manipular e anunciar o leap seconds de forma incorreta.

source: Please try to make sure nothing horrible happens because of the leap second.
es_es: Por favor, intente asegurarse de que nada horrible suceda debido al segundo intercalar.
nl_nl: Probeer er alstublieft voor te zorgen dat er niks ergs gebeurt vanwege de schrikkelseconde.
pt_br: Por favor, tente garantir que nada horrível acontecerá por causa do leap seconds.

source: Testing
es_es: Pruebas
nl_nl: Testen
pt_br: Testando

source: It is possible to test whether a leap second will be used. Due to the nature of <acronym>NTP</acronym>, the test might work up to 24 hours before the leap second. Some major reference clock sources only announce leap seconds one hour ahead of the event. Query the <acronym>NTP</acronym> daemon:
es_es: Es posible probar si un segundo intercalar será usado. Debido a la naturaleza de <acronym>NTP</acronym>, la prueba puede funcionar hasta 24 horas antes del segundo intercalar. Algunas fuentes importantes de referencia de tiempo solo anuncian el segundo intercalar una hora antes del acontecimiento. Realice una consulta al demonio de <acronym>NTP</acronym>:
nl_nl: Het is mogelijk om te kijken of een schrikkelseconde zal worden gebruikt. Vanwege de aard van <acronym>NTP</acronym> kan de test tot 24 uur voor de schrikkelseconde werken. Sommige grote bronnen van referentieklokken kondigen schrikkelseconden slechts één uur van te voren aan. Ondervraag de daemon <acronym>NTP</acronym>:
pt_br: É possível testar se um leap seconds será utilizado. Devido a natureza do <acronym>NTP</acronym>, o teste deve funcionar até 24 horas antes do lead seconds. Algumas da principais fontes de referência de tempo somente anunciam o leap seconds uma hora antes do evento. Consulte o daemon do <acronym>NTP</acronym>:

source: Output that includes <literal>leap_add_sec</literal> indicates proper support of the leap second. Before the 24 hours leading up to the leap second, or after the leap second has passed, <literal>leap_none</literal> will be shown.
es_es: Una salida que incluya <literal>leap_add_sec</literal> indica el soporte para el segundo intercalar. Cuando falten más de 24 horas para el segundo intercalar, o cuando este haya pasado, <literal>leap_none</literal> será mostrado por pantalla.
nl_nl: Uitvoer die <literal>leap_add_sec</literal> bevat wijst op correcte ondersteuning van de schrikkelseconde. Voorafgaand aan de 24 uur die tot de schrikkelseconde leiden, of nadat de schrikkelseconde is verstreken, zal <literal>leap_none</literal> zichtbaar zijn.
pt_br: Uma saída que inclua <literal>leap_add_sec</literal> indica o suporte adequado ao leap second. Antes de 24 horas até a ocorrência do leap second, ou depois dele já ter ocorrido, a saída do comando irá mostrar <literal>leap_none</literal>.

source: Conclusion
es_es: Conclusión
nl_nl: Conclusie
pt_br: Conclusão

source: In practice, leap seconds are usually not a problem on FreeBSD. We hope that this overview helps clarify what to expect and how to make the leap second event proceed more smoothly.
es_es: En la práctica, los segundos intercalares no suelen ser un problema en FreeBSD. Esperamos que esta breve reseña ayude a clarificar qué esperar y cómo hacer que el segundo intercalar pase sin contratiempos.
nl_nl: In de praktijk zijn schrikkelseconden meestal geen probleem op FreeBSD. We hopen dat dit overzicht helpt met wat te verwachten en hoe schrikkelseconden gladder te laten verlopen.
pt_br: Na prática, o leap seconds não é um problema do FreeBSD. Esperamos que esta visão geral, ajude-o a esclarecer oque esperar e como tornar o evento de leap seconds o menos traumático possível.

source: A <emphasis>leap second</emphasis> is an ad-hoc one-second correction to synchronize atomic timescales with Earth rotation. This article describes how FreeBSD interacts with leap seconds.
nl_nl: Een <emphasis>schrikkelseconde</emphasis> is een ad-hoc correctie van één seconde om de atomaire tijd te synchroniseren met de omwenteling van de aarde. Dit artikel beschrijft hoe FreeBSD omgaat met schrikkelseconden.

source: The easiest way to handle leap seconds is with the <acronym>POSIX</acronym> time rules FreeBSD uses by default, combined with <link xlink:href="@@URL_RELPREFIX@@/doc/nl_NL.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link>. When <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> is running and the time is synchronized with upstream <acronym>NTP</acronym> servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
nl_nl: De eenvoudigste manier om met schrikkelseconden om te gaan is met de tijdregels van <acronym>POSIX</acronym> die FreeBSD standaard gebruikt, gecombineerd met <link xlink:href="@@URL_RELPREFIX@@/doc/nl_NL.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link>. Wanneer <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> draait en de tijd gesynchroniseerd is met de bovenliggende <acronym>NTP</acronym>-servers die schrikkelseconden correct afhandelen, zal de schrikkelseconde ervoor zorgen dat de systeemtijd automatisch de laatste seconde van de dag herhaalt. Er zijn geen andere aanpassingen nodig.
