freebsd/freebsd-doc/ja_JP.eucJP/man/man4/adv.4
.\"
.\" Copyright (c) 1998
.\" 	Justin T. Gibbs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: adv.4,v 1.1 1998/10/16 21:12:07 ken Exp %
.\" jpman %Id: adv.4,v 1.3 1999/08/15 14:19:54 horikawa Stab %
.\"
.Dd October 16, 1998
.Dt ADV 4 i386
.Os FreeBSD
.Sh 名称
.Nm adv
.Nd Advansys 社製 ISA/VL/EISA/PCI 8 ビット SCSI ホストアダプタドライバ
.Sh 書式
ISA または VL カードに対して:
.Cd controller isa0
.Cd controller "adv0 at isa? port ? cam irq ? drq ?"
.Pp
EISA カードに対して:
.Cd controller eisa0
.Cd controller adv0
.Pp
PCI カードに対して:
.Cd controller pci0
.Cd controller adv0
.Pp
SCSI バスに対して:
.Cd controller scbus0 at adv0
.Sh 解説
このドライバは、Advanced System Products, Inc. 社製の
.Tn ASC900 ,
.Tn ASC1000 ,
.Tn ASC1090 ,
.Tn ASC1200 ,
.Tn ASC3050 ,
.Tn ASC3150
ホストアダプタチップに接続された
8 ビット
.Tn SCSI
バスへのアクセスを提供します。
以下の表で、これらのチップを用いた AdvanSys 社製品、接続バスのタイプ、
最大同期転送速度、そのアダプタで同時に処理できる最大コマンド数を示します。
.Pp
.Bd -filled -offset indent
.Bl -column "ABP510/5150 " "ISA PnP " "Yes " "10MHz " "Commands " Footnotes
接続のための製品:
.Pp
.Em "Adapter       Bus   Floppy      MaxSync   Commands  Footnotes"
ABP510/5150   ISA     No         10MHz       240    1
ABP5140     ISA PnP   No         10MHz       16     1, 3
ABP5142     ISA PnP   Yes        10MHz       16     4
ABP920        PCI     No         10MHz       16
ABP930        PCI     No         10MHz       16     5
ABP930U       PCI     No         20MHz       16
ABP930UA      PCI     No         20MHz       16
ABP960        PCI     No         10MHz       16     2
ABP960U       PCI     No         20MHz       16     2
.El 
.Pp
脚注:
.Bl -enum -compact
.It
このボードは HP 社が 4020i CD-R ドライブと一緒に出荷しています。この
ボードには BIOS がありませんので、ブートデバイスを制御できませんが、
セカンダリ SCSI デバイスならなんでも制御できます。
.It
このボードは、Iomega 社が Jaz Jet PCI アダプタとして販売しています。
.It
このボードは、SIIG 社が i540 SpeedMaster として発売しています。
.It
このボードは、SIIG 社が i542 SpeedMaster として発売しています。
.It
このボードは、SIIG 社が Fast SCSI Pro PCI として発売しています。
.El
.Ed    
.Pp
.Bd -filled -offset indent
.Bl -column "ABP510/5150 " "ISA PnP " "Yes " "10MHz " Commands
単一チャネル製品:
.Pp
.Em "Adapter       Bus   Floppy      MaxSync   Commands"
ABP542        ISA     Yes        10MHz       240
ABP742       EISA     Yes        10MHz       240
ABP842        VL      Yes        10MHz       240
ABP940        PCI     No         10MHz       240
ABP940U       PCI     No         20MHz       240
ABP970        PCI     No         10MHz       240
ABP970U       PCI     No         20MHz       240
.El 
.Ed    
.Pp
.Bd -filled -offset indent
.Bl -column "ABP510/5150 " "ISA PnP " "Yes " "10MHz " "Commands " "Channels "
多重チャネル製品 (コマンドはチャネルごとに実行可能):
.Pp
.Em "Adapter       Bus   Floppy      MaxSync   Commands  Channels"
ABP752       EISA     Yes        10MHz       240      2
ABP852        VL      Yes        10MHz       240      2
ABP950        PCI     No         10MHz       240      2
ABP980        PCI     No         10MHz       240      4
ABP980U       PCI     No         20MHz       240      4
.El 
.Ed    
.Pp
ISA もしくは Vesa ローカルバス用アダプタに関しては、システムに接続する
カードごとにカーネル設定エントリ 1 つが必要です。ポートアドレス、
割り込み要求番号(irq)、
DMA リクエスト番号 (drq) に特定の値を指定することも可能です。
ワイルドカードの値が指定された場合、ドライバがデバイスに対して現在の
設定値を問い合わせて、その値を使います。ポートアドレスがワイルドカードである
場合、ドライバは指定可能なポートアドレスの位置に関する内部の表を引き、
アタッチされていないものの中で最初に見つけたものをアタッチします。これらの
カードで生じ得るポートアドレスは、0x110, 0x130, 0x150, 0x190, 0x210,
0x230, 0x250, 0x330 です。
.Pp
.Tn AdvanceWare
メニューはブート時にアクセス可能なものですが、この
メニューで指定されたターゲットごとの設定は、このドライバでも参照されます。
これには、同期/非同期転送、最大同期ネゴシエーション速度、切断、タグ付きキュー、
ホストアダプタの SCSI ID が含まれます。ターゲットごとに許可された
タグ付きトランザクションの最大数の大域設定は使用されません。というのは、
CAM SCSI システムは、デバイス間での公平なリソース割り当てを保証するのと
同時に、あるデバイスが受信できるタグの最大数を自動的に決定するからです。
.Sh 関連項目
.Xr adw 4 ,
.Xr aha 4 ,
.Xr ahb 4 ,
.Xr ahc 4 ,
.Xr cd 4 ,
.Xr da 4 ,
.Xr sa 4 ,
.Xr scsi 4
.Sh 作者
.Nm adv
ドライバは、
Advanced System Products, Inc. 社の
.An Bob Frey
が書いた Linux ドライバから
.An Justin T. Gibbs
が移植しました。
もともとのドライバを、FreeBSD での使用に適したライセンスで AdvanSys 社が
提供してくれたことに感謝致します。
.Sh 歴史
.Nm
ドライバは
.Fx 3.0
で登場しました。
