freebsd/freebsd-doc/ja_JP.eucJP/man/man4/adw.4
.\"
.\" Copyright (c) 1998
.\" 	Justin T. Gibbs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: adw.4,v 1.1 1998/10/16 21:12:07 ken Exp %
.\" jpman %Id: adw.4,v 1.3 1999/08/15 14:19:40 horikawa Stab %
.\"
.Dd October 16, 1998
.Dt ADW 4 i386
.Os FreeBSD
.Sh 名称
.Nm adw
.Nd Advansys 社製 PCI 16bit SCSI ホストアダプタドライバ
.Sh 書式
.Cd controller pci0
.Cd controller adw0
.Pp
SCSI バスに対して:
.Cd controller scbus0 at adw0
.Sh 解説
このドライバは、Advanced Systems Products, Inc. 社の
ABP940UW SCSI ホストアダプタボード上の
.Tn ASC3550 
に接続された 16 ビット
.Tn SCSI
バスへのアクセスを提供します。
このチップは Ultra SCSI (20MHz)、16 ビット転送、タグ付キュー機能、253 個を
上限とする SCSI トランザクションの同時実行をサポートしています。
.Pp
.Tn AdvanceWare
メニューはブート時にアクセス可能なものですが、この
メニューで指定されたターゲットごとの設定は、このドライバでも参照されます。
これには、同期/非同期転送、最大同期ネゴシエーション速度、ワイド転送、
切断、タグ付きキュー、
ホストアダプタボードの SCSI ID が含まれます。ターゲットごとに許可された
タグ付きトランザクションの最大数の大域設定は使用されません。というのは、
CAM SCSI システムは、デバイス間での公平なリソース割り当てを保証するのと
同時に、あるデバイスが受信できるタグの最大数を自動的に決定するからです。
.Sh 関連項目
.Xr adv 4 ,
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr da 4 ,
.Xr sa 4
.Sh 作者
.Nm
ドライバは、
Advanced System Products, Inc. 社の
.An Bob Frey
が書いた Linux ドライバから
.An Justin T. Gibbs
が移植しました。
もともとのドライバを、FreeBSD での使用に適したライセンスで AdvanSys 社が
提供してくれたことに感謝致します。
.Sh 歴史
.Nm
ドライバは
.Fx 3.0
で登場しました。
