freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ahb.4
.\"
.\" Copyright (c) 1994 Wilko Bulte
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: ahb.4,v 1.9 1998/10/16 04:41:38 ken Exp %
.\" jpman %Id: ahb.4,v 1.3 1999/11/19 15:20:40 horikawa Stab %
.\"
.Dd October 15, 1998
.Dt AHB 4 i386
.Os FreeBSD
.Sh 名称
.Nm ahb
.Nd Adaptec 社製 EISA SCSI ホストアダプタドライバ
.Sh 書式
.Cd controller ahb0
.Cd controller scbus0 at ahb0
.Sh 解説
このドライバは、
.Dq Em エンハンスト
モードに設定した Adaptec 174x ホストアダプタに接続された
.Tn SCSI
バスへのアクセスを提供します。
タグ付きキューイング、同期 SCSI 転送をサポートしています。
.Sh 警告 
Adaptec 174X は SCSI バスのターミネータの処理と使用するケーブルの長さ
に極めて敏感です。また、最近のいくつかのデバイスの操作に難が
あり、それら新型デバイスのスピードに対応できず、コントローラにおいて
タイミング上の問題が生じることがあります。この種の機器間の不整合に
対処するための機構は知られていません。
.Sh 関連項目
.Xr aha 4 ,
.Xr ahc 4 ,
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr da 4 ,
.Xr sa 4
.Sh 作者
.Nm
ドライバは、
.An Justin T. Gibbs 
が作成しました。
