freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ax.4
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: ax.4,v 1.2 1999/01/18 17:26:01 wpaul Exp %
.\" $FreeBSD$
.\"
.Dd January 2, 1999
.Dt AX 4 i386
.Os FreeBSD
.Sh 名称
.Nm ax
.Nd
ASIX Electronics AX88140A ファストイーサネットデバイスドライバ
.Sh 書式
.Cd "device ax0"
.Sh 解説
.Nm
ドライバは、ASIX AX88140A ファストイーサネットコントローラチップを用いた
PCI イーサネットアダプタと組み込みコントローラをサポートします。これには、
Alfa Inc. の GFC2204 や、CNet の Pro110B が含まれます。
.Pp
この ASIX チップはバスマスタ DMA を使用し、DEC 21x4x 類似になるように
設計されています。DEC チップと ASIX チップの唯一の大きな違いは、ASIX 
の受信器のフィルタが 2 つの特殊なレジスタを用いてプログラミングするの
に対し、DEC チップでは送信器の DMA エンジン経由で、特別のセットアップ
フレームをアップロードすることです。ASIX 受信フィルタは、
ローカルステーションのアドレスに対するフィルタエントリまるごと 1 つと 
64 ビットのマルチキャストハッシュテーブル 1 つだけをプログラミング
できます。一方、DEC のフィルタは、他にいくつかのオプションを
サポートします。ASIX ファストイーサネットコントローラは、外部 MII
トランシーバを使用することで、全 2 重もしくは半 2 重において、
10Mbps と 100Mbps の両方の速度をサポートします。
.Pp
.Nm
ドライバは次に示すメディアタイプをサポートします。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
メディアタイプとオプションの自動選択機能を使用します。
メディアオプションを
.Pa /etc/rc.conf
ファイルに追加することにより、自動選択されたモードをユーザ自身が変更
することができます。
.It 10baseT/UTP
10Mbps 動作を設定します。
.Ar mediaopt
オプションを指定して、
.Ar full-duplex
モードか
.Ar half-duplex
モードのいずれかを指定することもできます。
.It 100baseTX
100Mbps (ファストイーサネット) 動作を設定します。
.Ar mediaopt
オプションを指定して、
.Ar full-duplex
モードか
.Ar half-duplex
モードのいずれかを指定することもできます。
.El
.Pp
.Nm
ドライバは、次に示すメディアオプションをサポートしています。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
強制的に全 2 重動作を指定します。
.It half-duplex
強制的に半 2 重動作を指定します。
.El
.Pp
このデバイスの設定に関しこれ以上の情報が必要ならば、
.Xr ifconfig 8
を参照して下さい。
.Sh 診断
.Bl -diag
.It "ax%d: couldn't map memory"
致命的な初期化エラーが発生しました。
.It "ax%d: couldn't map interrupt"
致命的な初期化エラーが発生しました。
.It "ax%d: watchdog timeout"
このデバイスはネットワークへの応答を停止しました。もしくは、ネットワーク
への接続 (ケーブル) に問題があります。
.It "ax%d: no memory for rx list"
ドライバが、受信データのリングバッファへの mbuf 割り当てに失敗しました。
.It "ax%d: no memory for tx list"
ドライバが、パッドバッファ割り当ての際、もしくは mbuf チェーンをクラスタへ
入れる際に、送信データのリングバッファへの mbuf 割り当てに失敗しました。
.It "ax%d: chip is in D3 power state -- setting to D0"
このメッセージは電力管理をサポートしているアダプタのみに適用されます。
オペレーティングシステムによっては、シャットダウンの際にコントローラを
ローパワーモードにするものがあります。PCI BIOS の中には、チップに設定
する前に、チップをこの状態から元に戻すことができないものがあります。
D3 状態では、コントローラは自分の PCI 設定情報のすべてを失って
しまいますので、BIOS が間に合うようにフルパワーモードに戻さなかった場合、
正しくコントローラを設定できなくなります。ドライバはこの状態を検知して
アダプタを D0 (フルパワー) 状態に戻そうとします。しかし、完全に動作する
状況にドライバを戻すためには、これだけでは不十分である可能性があります。
起動時にこのメッセージが出てきて、ドライバがこのデバイスを
ネットワークインタフェースとしてアタッチし損なう場合、デバイスを正しく
設定させるために、もう 1 回ウォームブートさせる必要があります。
.Pp
この条件は、他のオペレーティングシステムの後にウォームブートさせる場合
のみ生じます。
.Fx
をブートする前にシステムの電源を切る場合、
カードは正しく設定されるはずです。
.El
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Rs
.%T ASIX AX81140A データシート
.%O http://www.asix.com.tw
.Re
.Sh 歴史
.Nm
デバイスドライバは、
.Fx 3.0
で初めて現れました。
.Sh 作者
.Nm
ドライバは
.An Bill Paul Aq wpaul@ctr.columbia.edu
が書きました。
