freebsd/freebsd-doc/ja_JP.eucJP/man/man4/bktr.4
.\"
.\"	%Id: bktr.4,v 1.2 1998/11/04 22:13:35 nsouch Exp %
.\" jpman %Id: bktr.4,v 1.3 2000/01/03 03:15:16 horikawa Stab %
.\"
.Dd January 28, 1998
.br
.in +0.5i
.Dt BKTR 4 i386
.Os FreeBSD 2.2
.Sh 名称
.Nm brooktree
.Nd ビデオキャプチャドライバ
.Sh 書式
.Nm device bktr0
.Pp
.Nm controller iicbus0
.Nm controller iicbb0
.Nm controller smbus0
.Sh 解説
.Nm bktr
ドライバは、低コスト、高パフォーマンスのボードで PCI
.Em ビデオ
キャプチャを提供します。
このドライバは、Matrox Meteor ドライバに基づいています。
bktr ドライバは
.Em Brooktree Bt848 Video Capture Chip
が載っているビデオカードのほとんどをサポートします。
.Pp
特に、次のカードが動作することが分かっています:
.br
.Em Hauppage Wincast TV
.br
.Em STB TV PCI Television Tuner
.br
.Em Miro PC TV
.br
.Em Intel Smart Video Recorder III
.Pp
このドライバは現在、次の機能をサポートします:
.br
.in +0.5i
PCI から PCI への DMA 転送
.br
クリッピング
.br
yuv
.br
rgb16
.br
rgb24
.br
rgb32
.in -0.5i
.Pp
これらのカードでは、チューナとほかの部品が I2C バスで内部接続されてい
ます。Brooktree848 チップは、そのバス上でそれらの部品をコントロールす
るマスタデバイスとして動作しています。
従って、
.Xr iicbus 4 ,
.Xr iicbb 4
と
.Xr smbus 4
コントローラの宣言はアクティブな bktr サポートに必須です。
.Pp
次のカーネルパラメータがドライバのさらなる設定に使用可能です:
.Pp
.Em options "BROOKTREE_ALLOC_PAGES=xxx"
はプローブに成功したときに、割り当てる連続したページの数を指定します。
カーネルが割り当てるページの数のデフォルトは 216 です。
これは、(216*4096) バイト使用可能であることを示しています。
.Pp
.Sh 作者
このドライバは
.An Jim Lowe Aq james@miller.cs.uwm.edu ,
.An Mark Tinguely Aq tinguely@plains.nodak.edu ,
.An Amancio Hasty Aq hasty@star-gate.com
とその他の人々の作業に基づいています。
.Sh 関連ファイル
.Bl -tag -width /usr/share/examples/meteor -compact
.It Pa /usr/share/examples/meteor
Meteor ドライバ (よく似た設計である) でできることの例
.It Pa /usr/ports/graphics/fxtv
bktr ドライバを利用する表示プログラム - 
.Em The X Window System
と
.Em The Ports Collection
がインストールされている必要があります。
.El
.Sh 関連項目
.Xr meteor 4
.Sh 歴史
.Nm
ドライバは
.Fx 2.2
で初めて現れました。
