freebsd/freebsd-doc/ja_JP.eucJP/man/man4/bt.4
.\"
.\" Copyright (c) 1994 Jordan Hubbard
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: bt.4,v 1.6 1998/10/16 21:33:34 ken Exp %
.\"	jpman %Id: bt.4,v 1.3 1999/11/19 15:20:29 horikawa Stab %
.\"
.Dd October 16, 1998
.Dt BT 4 i386
.Os FreeBSD
.Sh 名称
.Nm bt
.Nd Buslogic/Mylex MultiMaster SCSI ホストアダプタドライバ
.Sh 書式
.Cd "controller bt0 at isa? port ? cam irq ?"
.Cd controller scbus0 at bt0
.Sh 解説
このドライバは Buslogic/Mylex MultiMaster または互換コントローラに
接続された
.Tn SCSI
バスへのアクセスを提供します (訳注: 次の表でコマンドは
キューイング可能な CCBの個数です):
.Pp
.Bd -filled -offset indent
.Bl -column "BT-956CD " "ISA " "Commands " Description
MultiMaster "W" シリーズホストアダプタ:
.Pp
.Em "アダプタ  バス   コマンド 解説"
BT-948    PCI     192     ULtra SCSI-3
BT-958    PCI     192     Wide ULtra SCSI-3
BT-958D   PCI     192     Wide Differential ULtra SCSI-3
.El
.Bl -column "BT-956CD " "ISA " "Commands " Description
MultiMaster "C" シリーズホストアダプタ:
.Pp
.Em "アダプタ  バス   コマンド 解説"
BT-946C   PCI     100     Fast SCSI-2
BT-956C   PCI     100     Wide Fast SCSI-2
BT-956CD  PCI     100     Wide Differential Fast SCSI-2
BT-445C   VLB     100     Fast SCSI-2
BT-747C   EISA    100     Fast SCSI-2
BT-757C   EISA    100     Wide Fast SCSI-2
BT-757CD  EISA    100     Wide Differential Fast SCSI-2
BT-545C   ISA      50     Fast SCSI-2
BT-540CF  ISA      50     Fast SCSI-2
.El
.Bl -column "BT-956CD " "ISA " "Commands " Description
MultiMaster "S" シリーズホストアダプタ:
.Pp
.Em "アダプタ  バス   コマンド 解説"
BT-445S   VLB      30     Fast SCSI-2
BT-747S   EISA     30     Fast SCSI-2
BT-747D   EISA     30     Differential Fast SCSI-2
BT-757S   EISA     30     Wide Fast SCSI-2
BT-757D   EISA     30     Wide Differential Fast SCSI-2
BT-545S   ISA      30     Fast SCSI-2
BT-542D   ISA      30     Differential Fast SCSI-2
BT-742A   EISA     30     SCSI-2 (742A リビジョン H)
BT-542B   ISA      30     SCSI-2 (542B リビジョン H)
.El
.Bl -column "BT-956CD " "ISA " "Commands " Description
MultiMaster "A" シリーズホストアダプタ:
.Pp
.Em "アダプタ  バス   コマンド 解説"
BT-742A   EISA     30     SCSI-2 (742A リビジョン A - G)
BT-542B   ISA      30     SCSI-2 (542B リビジョン A - G)
.El
.Ed
.Pp
AMI FastDisk ホストアダプタは、真の BusLogic MultiMaster クローンなので
同様にこのドライバでサポートされます。
.Pp
タグ付きキューイングは、'W' シリーズのアダプタ、ファームウェアが
リビジョン 4.42 以上の 'C' シリーズアダプタ、ファームウェアが
リビジョン 3.35 以上の 'S' シリーズアダプタでサポートされます。
.Pp
ボードのファームウェアのリビジョンによっては、
特定デバイスへの高負荷でロックアップするかも知れません。
タグ付きキューイングが使われている場合には、特にこれが言えます。
あなたのアダプタで問題が起きた場合は、
Mylex のテクニカルサポートに連絡し、
そのコントローラ用の最新のファームウェアを使っている事を確認して下さい。
.Sh 関連項目
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr da 4 ,
.Xr sa 4
.Sh 作者
.An Julian Elischer
が Multimaster カード用のドライバを書き、
これが 386BSD パッチキットで配布されました。
.An Justin T. Gibbs
がそのドライバが書き直し、
新しいボードの機能を活用して FreeBSD 3.0R の CAM SCSI フレームワークで
動作するようにしました。
.Pp
Linux 用に完全かつ詳しく解説された Mylex/BusLogic MultiMaster ドライバを
書いてくれた Leonard N. Zubkoff に感謝します。
このドライバでの広範囲の MultiMaster コントローラと
ファームウェアリビジョン、他では書かれないようなそれらの癖の
サポートは彼の功績無しには不可能だったでしょう。
.Sh 関連ファイル
.Bl -tag -width /usr/share/man0/template.doc -compact
.It Pa sys/dev/buslogic/bt.c
ドライバ実装のコア
.It Pa sys/dev/buslogic/btreg.h
MultiMaster のレジスタセットとドライバのコアのデータ構造
.It Pa sys/pci/bt_pci.c
PCI バスドライバアタッチメント
.It Pa sys/i386/eisa/bt_eisa.c
EISA バスドライバアタッチメント
.It Pa sys/i386/isa/bt_isa.c
ISA/VL バスドライバアタッチメント
.El
.Sh 歴史
.Nm
ドライバは 386BSD パッチキットから登場しました。
