freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ccd.4
.\"	%NetBSD: ccd.4,v 1.5 1995/10/09 06:09:09 thorpej Exp %
.\"
.\" Copyright (c) 1994 Jason Downs.
.\" Copyright (c) 1994, 1995 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason Downs and Jason R. Thorpe.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" jpman %Id: ccd.4,v 1.3 2000/07/05 04:58:37 horikawa Stab %
.\" Based on Japanese translation by
.\" YABU (Shigeru Kasahara) <bush@jrtokyohosp.gr.jp> [man-jp 1289]
.Dd August 9, 1995
.Dt CCD 4
.Os NetBSD
.Sh 名称
.Nm ccd
.Nd 結合ディスクドライバ
.Sh 書式
.Cd "pseudo-device ccd 4"
.Sh 解説
.Nm
ドライバは、
1 つ以上のディスクやパーティションを結合し、
1 つの仮想ディスクにすることを可能にします。
.Pp
この文書は、読者がカーネルを構築できること、
カーネルの設定ファイルのなかでディスクと仮想デバイスを正しく設定できること、
ディスクパーティションを適切に切れることを前提としています。
.Pp
.Sq 生の
ディスクパーティションは、結合
.Pa すべきではありません
。構成要素のパーティションとしては、FS_BSDFFS タイプ (
.Xr disklabel 8
では、タイプ
.Dq 4.2BSD
と表示されます) のみ、カーネルは受け入れます。
.Pp
ccd サポートをカーネルに組み込むには、
カーネルの設定ファイル中に次のような行を挿入する必要があります:
.Bd -unfilled -offset indent
pseudo-device	ccd	4	# concatenated disk devices
.Ed
.Pp
引数は、ブート時にメモリを割り当てる
.Nm
の個数です。
この例では 4 を越える
.Nm
は設定できません。
.Pp
.Nm
は、直列に結合されているか、インタリーブされているかのいずれかです。
パーティションを直列に結合するには、
インタリーブファクタを 0 に設定します。
.Pp
.Nm 
を設定する、実行時に用いるユーティリティがあります。
詳細は
.Xr ccdconfig 8
を参照してください。
.Ss インタリーブファクタ
.Nm 
が適切にインタリーブされているなら、
.Dq ストライピング
効果が発生します。
これは、連続した読み書きの実行を高速化します。
インタリーブファクタは、
DEV_BSIZE (普通は 512 バイト) を単位としてあらわされます。
大容量の書き込みのためには、
最適なインタリーブファクタは普通はトラックの大きさであり、
大容量の読み込みのためには、だいたいトラックの 1/4 の数字となります
(ディスクの数と速度に依存して、大きく変わります)。
例えば、
2 つの Fast-Wide SCSI バスにつながれた 8 つの 7200 回転のディスクでは、
最適なインタリーブファクタは、
書き込みのためには 128、読み込みのためには 32 となります。
.Pp
構成要素となる全ディスクが同じジオメトリと大きさとなっていれば、
最適の速度が得られます。
最適のストライピング効果は、異った種類のディスクでは得られません。
.Pp
ニュースサーバのように、ランダムアクセスを主とする作業では、
もっと大きなインタリーブファクタ (例えば 65,536) が望ましいです。
シークタイムによって制限されているアプリケーションの高速化には、
.Nm
はあまり効果が無いことに注意してください。
インタリーブファクタを大きくすることにより、
1 つのディレクトリまたはファイルの読み込みのために
2 つのディスクヘッドのシークが必要となる可能性を、
少なくとも減らしはします。
.Ss ディスクミラーリング
.Nm
は、偶数のディスクに対して
.Dq ミラー
するように設定可能です。
必要なフラグについては、
.Xr ccdconfig 8
を参照してください。
ディスク不良に対しては、
.Xr dd 1 
を用いて復旧可能です。
.Pp
単一ディスクの
.Nm 
はオリジナルのパーティションと同じではないことに注意してください。
これは特に、2 個のディスクでミラーされた
.Nm
上にファイルシステムがあって片方のディスクが不良になったとすると、
残りのパーティションをマウントしてそのまま使うことはできないことを意味します。
この場合、単一ディスクの
.Nm
として使う必要があります。
.Sh 警告
.Nm
として使用している 1 個 (以上) のディスクが不良となった場合、
ディスクをミラーリングしているのでなければ、
ファイルシステム全体が失われます。
.Sh 関連ファイル
/dev/{,r}ccd* - ccd デバイスの特殊ファイル。
.Pp
.Sh 歴史
結合ディスクドライバは、もともと University of Utah で記述されました。
.Sh 関連項目
.Xr dd 1 ,
.Xr ccdconfig 8 ,
.Xr config 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr MAKEDEV 8 ,
.Xr mount 8 ,
.Xr newfs 8
