freebsd/freebsd-doc/ja_JP.eucJP/man/man4/daic.4
.\" Copyright (c) 1997 Martin Husemann <martin@rumolt.teuto.de>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: daic.4,v 1.1 1998/12/27 21:47:13 phk Exp %
.\" jpman %Id: daic.4,v 1.3 1999/12/29 19:03:49 horikawa Stab %
.\"
.\"	last edit-date: [Fri Jan 30 22:49:48 1998]
.\"
.\"	-mh	writing manual pages
.\"
.\"
.Dd January 30, 1998
.Dt daic 4
.Sh 名称
.Nm daic
.Nd EICON.Diehl active isdn カード用 isdn4bsd ドライバ
.Pp
.Nm
ドライバは古い Diehl active カード:
.Em S, SX, SXn, SCOM
そして
.Em QUADRO
をサポートします。
.Sh 書式
.Pp
以下のような設定行を用います
.Cd "daic0 at isa? iomem 0xd8000 irq 10"
.Pp
.Em QUADRO
カードについても同じ設定を用います。ドライバはボードの種類を検出して
4 つのポート全てを、ISDN4BSD システムのコントローラとして
アタッチします。
アタッチされた各々のポートは、isdnctl ユーティリティを使って表示できます。
.Sh 解説
.Nm
ドライバは isdn カードを ISDN4BSD カーネルサブシステムへ
インタフェースします。
それ以下のレイヤは全てカードによって扱われます。
このドライバは EICON.Diehl によって作られた、どこの国の
isdn プロトコルにおいても、あなたのカードが動作すると
思われますが、ドライバは DSS1 プロトコルにおいてしかテストされておらず、
カードインタフェースのある部分は isdn プロコトルに依存しています。
.Pp
.Nm 
ドライバは 1992 年より文書化されている Diehl の
.Nm ISDN-Karten Benutzerhandbuch
に準拠するよう作られています。
.Sh マイクロコードのダウンロード
どの active カードも使用する前にそれぞれのカードに適合した
オペレーティングソフトウェアを必要としますので、
ISDN4BSD を使用する前にダウンロードをしてください。
ダウンロードには isdnctl ユーティリティを用います。
例えばコントローラ番号 1 にファイル
.Nm te_etsi.sx
をダウンロードするには
.Nm "isdnctl -d te_etsi.sx 1"
とします。
使用可能なコントローラ (とポート) を全て表示するには、
.Nm "isdnctl -l"
としてください。
あなたの isdn インタフェースに合った正しい isdn プロトコルファイルを
選択する必要があります。詳細は Diehl の資料を参照してください。
.Pp
カードの起動プロセスでは、カード種別や使用するプロトコルに依存しない、
それ以外のファイルも処理します。
現在の Diehl によるソフトウェアの配布では、このファイルは
.Nm download.bin
と呼ばれており、
.Nm dev/ic/microcode/daic
以下のカーネルコンパイル用ディレクトリにコピーしておく必要があり、
またそのディレクトリで
.Nm make
を行なって、カーネルをコンパイルする際に必要となる
ヘッダファイルに変換しておく必要があります。
この操作を忘れると、カーネルのコンパイルに失敗するので、
忘れたことがわかるでしょう。
著作権による制限のため、このファイルを統合してドライバを配布することは
できません。しかしカードを持っていればファイルも持っています (または
Diehl のウェブサーバから取得できます)。
.Sh バグ
このドライバはまだ完成していません。NetBSD でのみこのドライバを
コンパイルすることが可能ですが、そこでさえも動いていません。
この問題は近いうちに修正され、ドライバは FreeBSD に移植されるでしょう。
.Sh 関連項目
.Xr isdnctl 1
