freebsd/freebsd-doc/ja_JP.eucJP/man/man4/de.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: de.4,v 1.5 1998/03/12 07:30:31 charnier Exp %
.\" jpman %Id: de.4,v 1.4 2000/05/11 12:10:13 isaki Stab %
.\"
.Dd January 19, 1997
.Dt DE 4 i386
.Os FreeBSD
.Sh 名称
.Nm de
.Nd 
DEC DC21x4x イーサネットデバイスドライバ
.Sh 書式
.Cd "device de0"
.Sh 解説
.Nm
ドライバは Digital Equipment DC21x4x 由来のそれ自身も含むイーサネットチップ
を積んだイーサネットアダプタをサポートするために用意されています。
.Pp
このドライバは DEC PCI DE435 カード, DEC EISA DE425, DEC DE450, DEC DE500,
SMC 8432, 9332, 9334, Cogent EM100FX, EM440TX, Asante, ZNYX ZX3xx や 21040
及び 21041 イーサネットコントローラあるいは 21140[A], 21141, 21142 及び
21143 ファスト 100Mbps イーサネットコントローラを積んだ他のカードをサポート
します。
.Pp
.Nm
ドライバは以下のメディアタイプをサポートしています:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxx
.It autoselect
メディアタイプとオプションの自動選択を可能にします。
.It 10baseT/UTP
10baseT ポート上で 10Mbps による動作にセットします。
.It 10base2/BNC
BNC ポート上で 10Mbps による動作にセットします。
.It 10base5/AUI
AUI ポート上で 10Mbps による動作にセットします。
.It 100baseTX
100Mbps (ファストイーサネット) による動作にセットします。
.It 100baseFX
100Mbps による動作にセットします。
.It 100baseT4
100Mbps による動作にセットします (4-pair cat-3 cable)。
.El
.Pp
.Nm
ドライバは以下のメディアオプションをサポートしています:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxx
.It full-duplex
全二重による動作にセットします。
.El
.Pp
利用できるメディアタイプは使用する個々のカードに依存します。セットアップ
ユーティリティによって特定のメディアタイプにはっきりとプログラムする
カードや変更できないカードがあります。
.Pp
あなたの特定のカードにサポートされているメディアタイプを列挙するために
.Xr ifconfig 8
コマンド、特に
.Fl m
フラグを使用します。
.Pp
古い設定方法である
.Dq ifconfig linkN
はサポートされていません。
.Sh 診断
.Bl -diag
.It "de%d: waking device from sleep/snooze mode"
21041 と 21140A チップはカードのサスペンド操作をサポートしています。
.It "de%d: error: desired IRQ of %d does not match device's actual IRQ of %d"
デバイスプローブは、ボードがカーネル設定ファイルに指定されたのとは異なる
割り込みで構成されていることを検出しました。
.It "de%d: not configured; limit of %d reached or exceeded"
1 台のマシンで許されている
.Nm
デバイスには 32 個の制限があります。
.It "de%d: not configured; 21040 pass 2.0 required (%d.%d found)"
.It "de%d: not configured; 21140 pass 1.1 required (%d.%d found)"
チップセットの一定のリビジョンはサポートされていません。
.El
.Sh 警告
21040 は EISA と PCI の両方のボードで利用できるので、カーネルコンフィグ
ファイルでの 21040 の定義の方法に注意すべきです。
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh 作者
.Nm
デバイスドライバは
.An Matt Thomas 
によって書かれました。
このマニュアルページは
.An David E. O'Brien 
によって書かれました。
