freebsd/freebsd-doc/ja_JP.eucJP/man/man4/dpt.4
.\"
.\" Copyright (c) 1998 Justin T. Gibbs
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: dpt.4,v 1.1 1998/10/16 22:00:55 ken Exp %
.\" jpman %Id: dpt.4,v 1.3 1999/10/06 10:51:50 horikawa Stab %
.\"
.Dd October 16, 1998
.Dt DPT 4 i386
.Os FreeBSD 3.0
.Sh 名称
.Nm dpt
.Nd DPT RAID コントローラ SCSI ドライバ
.Sh 書式
1 つ以上の EISA コントローラに対し
.Cd "controller eisa0"
.Cd "controller dpt0"
.Pp
1 つ以上の PCI コントローラに対し
.Cd "controller pci0"
.Cd "controller dpt0"
.Pp
PCI アダプタがメモリマップ I/O を使用できるようにするには
以下の指定を有効とする。
.Cd options DPT_ALLOW_MEMIO
.Pp
.Sh 解説
.Nm
ドライバは 
DPT Smart Cache Plus, Smart Cache III, Smart Raid III, Smart Cache IV, 
Smart RAID IV ファミリのサポートを提供します。
.Sh 関連ファイル
.Bl -tag -width /usr/share/man0/template.doc -compact
.It Pa sys/dev/dpt/dpt_scsi.c
コアドライバの実装
.It Pa sys/dev/dpt/dpt.h
レジスタセットとコアドライバのデータ構造
.It Pa sys/pci/dpt_pci.c
PCI バスドライバに付属するもの
.It Pa sys/i386/eisa/dpt_eisa.c
EISA バスドライバに付属するもの
.El
.Sh 関連項目
.Xr cd 4 ,
.Xr ch 4 ,  
.Xr scsi 4 ,
.Xr da 4 ,
.Xr sa 4
.Sh 作者
.Nm
ドライバは
.An Simon Shapiro
が記述し、
.An Justin T. Gibbs
が CAM SCSI システムに移植しました。
.Sh 歴史
.Nm
は
.Fx 2.2.6
で登場しました。
