freebsd/freebsd-doc/ja_JP.eucJP/man/man4/drum.4
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)drum.4	8.1 (Berkeley) 6/5/93
.\" jpman %Id: drum.4,v 1.3 1999/08/12 10:59:46 horikawa Stab %
.\"	%Id: drum.4,v 1.2 1997/03/07 02:49:22 jmg Exp %
.\"
.Dd June 5, 1993
.Dt DRUM 4
.Os BSD 4
.Sh 名称
.Nm drum
.Nd ページングデバイス
.Sh 解説
このファイルはシステムによって使用中のページングデバイスを参照します。
実際にはいずれかのディスクドライバのサブデバイスかもしれませんが、
複数のディスクドライブにまたがってインタリーブしてページングするシステムでは、
複数のドライブへアクセスする間接的なドライバになります。
.Sh 関連ファイル
.Bl -tag -width /dev/drum
.It Pa /dev/drum
.El
.Sh 歴史
.Nm
特殊ファイルは
.Bx 3.0
に初めて登場しました。
.Sh バグ
drum からの、インタリーブの境界をまたがる読み出しは禁止されています。
この境界は 0.5M バイトごとにあり、システムはこの境界をまたぐような
."\ 原文は .5Mbytes or so となっているが、 or so を無視
."\ See [man-jp-reviewer 1241] by mzaki@e-mail.ne.jp
ブロックを割り当てないので、通常はこれが問題になることはありません。
