freebsd/freebsd-doc/ja_JP.eucJP/man/man4/el.4
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: el.4,v 1.7 1998/10/22 14:12:55 bde Exp %
.\" jpman %Id: el.4,v 1.3 1999/08/18 16:40:09 horikawa Stab %
.\"
.Dd July 10, 1995
.Dt EL 4 i386
.Os FreeBSD
.Sh 名称
.Nm el
.Nd 3Com Etherlink 3C501 デバイスドライバのためのイーサネットドライバ
.Sh 書式
.Cd "device el0 at isa? port 0x300 net irq 9"
.Sh 解説
.Nm
インタフェースは、
3Com 3c501 8 ビット ISA イーサネットカードのサポートを提供します。
3c501 カードはかなり遅いことが知られていますので、
もし可能なら他のイーサネットカードを用いるべきです。
しかし、10 Mb/s イーサネットネットワークへのアクセスとしては安価です。
.Pp
有効な I/O ポートは 0x280-0x3f0 の範囲です。
.Sh バグ
ドライバはカードがカーネルと同じ IRQ に設定されていると仮定します。
これが正しいかどうか確かめるプローブやチェックは行われていません。
.Pp
現在、DMA はサポートしていません。
.Pp
現在、マルチキャストはサポートしていません。
.Sh 関連項目
.Xr ed 4 ,
.Xr eg 4 ,
.Xr ep 4 ,
.Xr ie 4 ,
.Xr intro 4 ,
.Xr le 4 ,
.Xr ifconfig 8
