freebsd/freebsd-doc/ja_JP.eucJP/man/man4/en.4
.\" $FreeBSD$
.Dd December 29, 1997
.Dt EN 4
.Os BSD
.Sh 名称
.Nm en
.Nd
Midway ベースの ATM インタフェースのデバイスドライバ
.Sh 書式
.Cd "device en0"
.Cd "pseudo-device atm"
.Sh 解説
.Nm
デバイスドライバは Efficient Networks, Inc. ENI-155 と
Adaptec ANA-59x0 を含む、Midway ベースの ATM インタフェースを
サポートしています。
Midway は
ALL5 SAR (Segmentation and Reassenbly: セル分割・組立サブレイヤ)
チップです。
.Pp
本ドライバは ATM PVC のみサポートしており、SVC や ATM-ARP
はサポートしていません。
.Pp
カードに IP の設定をするには以下の様にします:
.Dl # ifconfig en0 128.252.200.1 netmask 0xffffff00 up
ホストに PVC を加えるには ``route'' コマンドを使用する必要があります:
.Dl # route add -iface <remote IP address> -link en0:z.0.x.y
ここで、x と y は使用する VCI のバイト表現形式であり、
また z は次に示すフラグのバイト表現形式です。
.Dl 0x01 (AAL5 を使用)、
.Dl 0x02 (AAL5 を使用する場合、LLCSNAP ヘッダを使用する)
従って、パラメータが 3 の場合は AAL5 及び LLC/SNAP カプセル化
の使用を意味します。
BPF は LLC/SNAP カプセル化がされている場合のみ
使用可能であることに注意してください。
.Sh 使用例
2 つのホスト 128.252.200.1 と 128.252.200.2 があり、
これらが PVC # 201 (0xc9) の ATM で接続されていると
仮定しましょう。
このリンクを有効化するには次の様にコマンドを使用します:
.Dl ホスト 128.252.200.1 上で:
.Dl	# ifconfig en0 128.252.200.1 netmask 0xffffff00 up
.Dl	# route add -iface 128.252.200.2 -link en0:3.0.0.c9
.Pp
.Dl ホスト 128.252.200.2 上で:
.Dl	# ifconfig en0 128.252.200.2 netmask 0xffffff00 up
.Dl	# route add -iface 128.252.200.1 -link en0:3.0.0.c9
.Sh 診断
.Bl -diag
.It	"en0 <Efficient Networks ENI-155p> rev 0 int a irq 5 on pci0:16"
.It	"en0: ATM midway v0, board IDs 6.0, Utopia (pipelined), 512KB on-board RAM"
.It	"en0: maximum DMA burst length = 64 bytes"
.It	"en0: 7 32KB receive buffers, 8 32KB transmit buffers allocated"
.El
.Sh 警告
本ドライバは PCI において DMA を広範囲に使用します。
初期の PCI チップセットでは動作しないか、十分な性能が出ません。
.Sh 関連項目
.Xr ifconfig 8 , 
.Xr pvcsif 8 , 
.Xr pvctxctl 8 ,
.Xr route 8
.Sh 作者
1996 年、NetBSD において、Washington University の Chuck Cranor が 
EN ドライバを実装しました。
