freebsd/freebsd-doc/ja_JP.eucJP/man/man4/fd.4
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)fd.4	8.1 (Berkeley) 6/9/93
.\"	%Id: fd.4,v 1.4 1997/03/07 02:49:26 jmg Exp %
.\" jpman %Id: fd.4,v 1.3 1999/09/11 08:12:27 horikawa Stab %
.\" "
.Dd June 9, 1993
.Dt FD 4
.Os
.Sh 名称
.Nm fd ,
.Nm stdin ,
.Nm stdout ,
.Nm stderr
.Nd ファイル記述子ファイル
.Sh 解説
.Pa /dev/fd/0
から
.Pa /dev/fd/#
のファイルは、
ファイルシステムを介してアクセス可能なファイル記述子を参照します。
そのファイル記述子がオープンされていて、
オープンしようとするファイルのモードが
すでに存在する記述子のモードのサブセットであれば、呼び出し:
.Bd -literal -offset indent
fd = open("/dev/fd/0", mode);
.Ed
.Pp
と呼び出し:
.Bd -literal -offset indent
fd = fcntl(0, F_DUPFD, 0);
.Ed
.Pp
は等価になります。
.Pp
ファイル
.Pa /dev/stdin ,
.Pa /dev/stdout ,
.Pa /dev/stderr
をオープンすることは次の呼び出しと等価です:
.Bd -literal -offset indent
fd = fcntl(STDIN_FILENO,  F_DUPFD, 0);
fd = fcntl(STDOUT_FILENO, F_DUPFD, 0);
fd = fcntl(STDERR_FILENO, F_DUPFD, 0);
.Ed
.Pp
.Xr open 2
への
.Dv O_RDONLY , 
.Dv O_WRONLY ,
.Dv O_RDWR
以外のフラグは無視されます。
.Sh 関連ファイル
.Bl -tag -width /dev/stderr -compact
.It Pa /dev/fd/#
.It Pa /dev/stdin
.It Pa /dev/stdout
.It Pa /dev/stderr
.El
.Sh 関連項目
.Xr tty 4
