freebsd/freebsd-doc/ja_JP.eucJP/man/man4/fdc.4
.\"
.\" Copyright (c) 1994 Wilko Bulte
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: fdc.4,v 1.11 1998/12/27 13:40:51 phk Exp %
.\" jpman %Id: fdc.4,v 1.3 1999/09/11 08:12:37 horikawa Stab %
.\"
.Dd August 31, 1994
.Dt FDC 4 i386
.Os FreeBSD
.Sh 名称
.Nm fdc
.Nd
PCアーキテクチャのフロッピディスクコントローラドライバ
.Sh 書式
.Cd "controller fdc0 at isa? port" \&"IO_FD1\&" "bio flags 0x1 irq 6 drq 2"
.Cd "disk fd0 at fdc0 drive 0
.Cd "disk fd1 at fdc0 drive 1
.Sh 説明
このドライバは、フロッピディスクドライブおよび QIC40/80 
テープドライブへのアクセスを提供します。
/dev ディレクトリには、各フロッピディスクデバイス用に多数の
マイナデバイスが存在します。 デバイス名が英文字で終わる
/dev/fd* デバイスは、フロッピディスク上の 'パーティション' を
表すのに使用されます。
/dev/fd*.<数字> という名前のデバイスは、フロッピディスクの
サイズ (つまり、720KB や 1440KB など) を表します。後者は、
fdformat コマンドを使ってフロッピディスクをフォーマットするときや、
複数の記録密度のフロッピディスクを扱えるドライブで、異なる記録密度の
フロッピディスクにアクセスするとき (例: 1.44MB ドライブで 720KB
ディスクにアクセスするとき) に使われます。 
.Pp
通常は、フロッピドライブの設定を得るために、
システムの CMOS メモリに問い合わせます。
CMOS 内部に、この設定値を持たないマシンもいくつかあります。
こうしたマシンでは、
.Ql 0x1
という値のフラグを使用して、CMOS に問い合わせを行わずに、
1.44MB フロッピドライブを最初のユニットとして見せかけるように
してください。
.Sh ファイル 
.Bl -tag -width Pa -compact
.It /dev/fd*
フロッピディスクデバイスのノード
.\" floppy disk device nodes
.It /dev/fd*.<KB で表したサイズ >
フロッピディスクデバイスのノード。後に続く数字がフロッピディスクの
記憶容量を表しています。
.It Pa /sys/i386/conf/GENERIC
サンプルの generic カーネルの設定ファイル
.It Pa /sys/i386/isa/fd.c
フロッピドライバのソース
.El
.Sh 関連項目
.Xr fdformat 1 ,
.Xr disktab 5
