freebsd/freebsd-doc/ja_JP.eucJP/man/man4/fpa.4
.\"
.\" Copyright (c) 1995, Matt Thomas
.\" All rights reserved.
.\"
.\"	%Id: fpa.4,v 1.10 1998/03/12 07:30:16 charnier Exp %
.\" $FreeBSD$
.\"
.Dd March 13, 1995
.Dt FPA 4 i386
.Os FreeBSD
.Sh 名称
.Nm fpa ,
.Nm fea
.Nd DEC FDDI コントローラ用デバイスドライバ
.Sh 書式
.Cd "device fpa0"
.Cd "device fea0"
.Pp
.Tn FreeBSD
のみ:
.Cd "pseudo-device fddi"
.Sh 解説
.Nm fpa
と
.Nm fea
デバイスドライバは、それぞれ DEC DEFPA PCI FDDI コントローラと DEC DEFEA
EISA FDDI コントローラをサポートします。DAS 接続と SAS 接続も含め、
これらのコントローラと同等な製品もすべてサポートされます。
.Pp
.Sh 診断
.Bl -diag
.It "fea%d: error: desired IRQ of %d does not match device's actual IRQ (%d)"
デバイス検出によって、カーネルの設定ファイルに記述された IRQ とは異なる値が
DEFEA ボードに設定されていることが発見されました。
.It "fea%d: error: memory not enabled! ECU reconfiguration required"
デバイス検出によって、DEFEA ボード上のどのデバイスメモリも使用可能になって
いないことがわかりました。デバイスメモリを使わずに DEFEA ボードを設定する
ことは可能ですが、このデバイスドライバには最低 1K のデバイスメモリが設定
されていることが必要です。
ECU (EISA 設定ユーティリティ) を使えばこの設定を変更することができます。
.El
.Sh 警告
通常、このデバイスドライバで SMT フレームを受信することはできません。
しかし IFF_LINK1 フラグをセットすれば、このデバイスドライバで SMT
フレームを受信できるようになり、それらのフレームをバークレイパケット
フィルタに引き渡すようになります。
.Pp
.Sh 参照
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh 作者
.Nm fpa
と
.Nm fea
デバイスドライバおよびマニュアルは
.An Matt Thomas
によって作成されました。
