freebsd/freebsd-doc/ja_JP.eucJP/man/man4/i4b.4
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: i4b.4,v 1.1 1998/12/27 21:47:13 phk Exp %
.\"
.\"	last edit-date: [Sat Dec  5 18:38:11 1998]
.\" $FreeBSD$
.\" "
.Dd February 3, 1998
.Dt i4b 4
.Sh 名称
.Nm i4b
.Nd isdn4bsd 呼制御 ISDN ドライバ
.Sh FreeBSD での書式
.Cd pseudo-device \&"i4b\&"
.Sh NetBSD での書式
なし
.Sh 解説
.Nm
デバイスドライバは
.Xr isdnd 8
デーモンが isdn4bsd カーネル部分とメッセージを交換するのに使用します。
その目的は、呼 (call) の確立や制御、切断、
および様々な制御情報や状態情報にアクセスすることです。
.Pp
メッセージおよびメッセージパラメータは、インクルードファイル
.Em /usr/include/machine/i4b_ioctl.h
に記述されています。
.Pp
次の ioctl が利用可能です:
.Pp
.Bl -tag -width Ds -compact -offset indent
.It Ar I4B_CDID_REQ
交換局とのローカル D チャネルの単一のやりとりを一意に識別する
呼記述識別子 (CDID: Call Description IDentifier) を要求します。
.It Ar I4B_CONNECT_REQ
呼設定 (call setup) をリモート ISDN 加入者 (subscriber) に能動的に要求します。
.It Ar I4B_CONNECT_RESP
着呼 (incoming call) に対し、受け入れ、拒否、または無視すると応答します。
.It Ar I4B_DISCONNECT_REQ
能動的に呼を終了させます。
.It Ar I4B_CTRL_INFO_REQ
設置されている ISDN コントローラカードについての情報を要求します。
.It Ar I4B_DIALOUT_RESP
ダイヤルアウトを要求してきたドライバに対し、
呼設定に関する情報を与えます。
.It Ar I4B_TIMEOUT_UPD
動的に計算されるショートホールドモードのタイミングが変わった場合に、
カーネルのタイムアウト値を更新します。
.It Ar I4B_UPDOWN_IND
カーネルのユーザランドドライバにインタフェースのソフト的
アップ/ダウン状態変化を知らせます。
.It Ar I4B_CTRL_DOWNLOAD
アクティブなカードにファームウェアをダウンロードします。
.It Ar I4B_ACTIVE_DIAGNOSTIC
アクティブなカードからの診断情報を返します。
.El
.Pp
カーネルから得られる状態メッセージと
イベントメッセージには次のものがあります:
.Pp
.Bl -tag -width Ds -compact -offset indent
.It Ar MSG_CONNECT_IND
リモートの ISDN ユーザからの着呼を示します。
.It Ar MSG_CONNECT_ACTIVE_IND
着呼がローカルで受け入れられた後、
あるいは発呼 (outgoing call) がリモートに受け入れられた後で、
交換局がアクティブ接続を通知しました。
対応する B チャネルが交換されます。
.It Ar MSG_DISCONNECT_IND
呼は終了しました。
.It Ar MSG_DIALOUT_IND
ユーザランドインタフェースドライバがデーモンに
ダイヤルアウトするよう要求します
(典型的には、ネットワークインタフェースの送信キューにパケットが届く時です)。
.It Ar MSG_IDLE_TIMEOUT_IND
B チャネルのアイドルタイムアウトが起こったために、
isdn4bsd カーネルドライバが呼を終了させました。
.It Ar MSG_ACCT_IND
ネットワークドライバからのアカウンティング情報です。
.It Ar MSG_CHARGING_IND
カーネルからの課金情報です。
.El
.Pp
.Sh 関連項目
.Xr isdnd 8
.Sh 作者
.Nm
デバイスドライバと本マニュアルページは Hellmuth Michaelis が書きました。
彼の連絡先は、hm@kts.org です。
