freebsd/freebsd-doc/ja_JP.eucJP/man/man4/i4bctl.4
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: i4bctl.4,v 1.1 1998/12/27 21:47:13 phk Exp %
.\" jpman %Id: i4bctl.4,v 1.3 1999/12/29 15:19:17 horikawa Stab %
.\"
.\"	last edit-date: [Sat Dec  5 18:38:22 1998]
.\"
.Dd February 3, 1998
.Dt i4bctl 4
.Sh 名称
.Nm i4bctl
.Nd カーネル内の isdn4bsd を制御するためのデバイス
.Sh FreeBSD での書式
.Cd pseudo-device \&"i4bctl\&"
.Sh NetBSD での書式
なし
.Sh 解説
.Nm
は
.Xr isdndebug 8
ユーティリティによって使用されます。これにより、isdn4bsd パッケージと
呼ばれるカーネル内の ISDN を扱うレイヤについて、その現在のデバッグ
レベルやその他の情報を取得したり設定します。
.Sh 関連項目
.Xr isdndebug 8
.Sh 作者
.Nm
デバイスドライバとこのマニュアルページは Hellmuth Michaelis が
作成しました。hm@kts.org で彼に連絡できます。
