freebsd/freebsd-doc/ja_JP.eucJP/man/man4/i4bipr.4
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: i4bipr.4,v 1.1 1998/12/27 21:47:13 phk Exp %
.\" jpman %Id: i4bipr.4,v 1.3 1999/12/29 15:19:14 horikawa Stab %
.\"
.\"	last edit-date: [Sat Dec  5 18:38:34 1998]
.\"
.Dd July 6, 1998
.Dt i4bipr 4
.Sh 名称
.Nm i4bipr
.Nd ISDN B チャネルを用いた IP 伝送のための isdn4bsd ネットワークドライバ
.Sh FreeBSD での書式
.Cd pseudo-device \&"i4bipr\&" Op count
.Sh NetBSD での書式
なし
.Sh 解説
.Nm
ドライバは、オペレーティングシステム内の IP サブシステムと isdn4bsd
パッケージの仲介をすることによって、ISDN 接続を用いた IP パケットの
伝送を可能にします。
.Pp
このドライバは、先頭や後尾に何も追加せずに IP パケットを B チャネルの
HDLC パケットに載せてリモートサイトに送信します。
リモートサイトから受信された IP パケットはローカルな IP プロトコル
スタックに追加されます。
.Pp
B チャネルに載せられたパケットのフォーマットは次のようになります:
.Pp
.Dl (HDLC 開始フラグ) (IP パケット) (CRC) (HDLC 終了フラグ)
.Pp
リモートサイトへの IP パケットがドライバに届いたのにそこへの接続が
未確立であるときには、このドライバは
.Xr isdnd 8
デーモンと通信して接続を確立します。
.Pp
.Nm ipr
インタフェースに対して
.Xr tcpdump 1
コマンドを使えるようにするために、このドライバは
.Xr bpf 4
サブシステムと通信できます。
.Pp
このドライバは (IPR_VJ オプションを付けてコンパイルされているとき) 
Van Jacobsen ヘッダ圧縮の機能を持ちます。これは
.Xr ifconfig 8
の link0 および link1 オプションを使って制御できます:
.Pp 
.Bl -tag -width 15n -offset indent -compact
.It link0
このインタフェースからの送信パケットに VJ 圧縮を施し、受信パケットは
伸長される必要があると仮定します。
.It link1
受信パケットに Van Jacobsen 圧縮がなされているかどうかチェックします;
圧縮されていると思われるときは自動的に link0 がセットされます。
.El 
.Pp
デフォルトでは
.Em link1
が
.Em on
で
.Em link0
が
.Em off
です。
.Sh 関連項目
.Xr isdnd 8
.Xr isdnd.rc 5
.Xr bpf 4
.Xr tcpdump 1
.Sh 作者
.Nm
デバイスドライバとこのマニュアルページは Hellmuth Michaelis が
作成しました。hm@kts.org で彼に連絡できます。
