freebsd/freebsd-doc/ja_JP.eucJP/man/man4/i4bisppp.4
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: i4bisppp.4,v 1.1 1998/12/27 21:47:13 phk Exp %
.\" jpman %Id: i4bisppp.4,v 1.3 1999/12/29 15:19:20 horikawa Stab %
.\"
.\"	last edit-date: [Tue Dec 22 20:15:08 1998]
.\"
.Dd December 22, 1998
.Dt i4bisppp 4
.Sh 名称
.Nm i4bisppp
.Nd ISDN B-チャネルを用いた同期 PPP のための isdn4bsd ネットワークドライバ
.Sh FreeBSD での書式
.Cd pseudo-device \&"i4bisppp\&" Op count
.Sh NetBSD での書式
なし
.Sh 解説
.Nm
ドライバは、オペレーティングシステム内の IP サブシステムと isdn4bsd
パッケージの仲介をすることによって、ISDN 接続を用いた IP パケットの
伝送を可能にします。
.Pp
このドライバは、Serge Vakulenko による sppp のバックエンドと ISDN4BSD
パッケージを単に接続するためのレイヤです。
.Pp
リモート側への IP パケットがドライバに届いたのにそこへの接続が未確立で
あるときには、このドライバは
.Xr isdnd 8
デーモンと通信して接続を確立します。
.Pp
.Nm isp
インタフェースに対して
.Xr tcpdump 1
コマンドを使えるようにするために、このドライバは
.Xr bpf 4
サブシステムと通信できます。
.Pp
リモートサイトへ接続するために PPP が必要とするすべての段階を設定するには
.Xr spppcontrol 8
ユーティリティを用います。
.Sh LINK0 および LINK1
.Xr ifconfig 8
に渡された
.Em link0
および
.Em link1
フラグは、
.Nm isp
デバイスに対して次のような意味をもちます:
.Bl -tag -width link0 -compact
.Pp
.It Li link0 
接続を受け付けるように待ちます。
.Pp
.It Li link1
送信時に自動的にダイヤルします。
.El
.Pp
デフォルトでは
.Em link0 
および
.Em link1 
フラグは
.Em off
になっています。
.Pp
これらのフラグについての詳細な議論は
.Xr sppp 4
を参照して下さい。
.Pp
.Sh 関連項目
.Xr isdnd 8
.Xr isdnd.rc 5
.Xr spppcontrol 8
.Xr sppp 4
.Xr bpf 4
.Xr tcpdump 1
.Sh AUTHOR
.Nm
デバイスドライバは Joerg Wunsch が作成し、Gary Jennejohn が ISDN4BSD
に追加しました。
このマニュアルページは Hellmuth Michaelis が作成しました。hm@kts.org
で彼に連絡できます。
