freebsd/freebsd-doc/ja_JP.eucJP/man/man4/i4btel.4
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: i4btel.4,v 1.1 1998/12/27 21:47:14 phk Exp %
.\" jpman %Id: i4btel.4,v 1.3 1999/12/29 15:19:42 horikawa Stab %
.\"
.\"	last edit-date: [Sat Dec  5 18:39:31 1998]
.\"
.Dd February 3, 1998
.Dt i4btel 4
.Sh 名称
.Nm i4btel
.Nd isdn4bsd の ISDN B チャネル電話インタフェースドライバ
.Sh FreeBSD での書式
.Cd pseudo-device \&"i4btel\&" Op count
.Sh NetBSD での書式
なし
.Sh 解説
.Nm
ドライバは電話を扱うアプリケーションのために B チャネルとのインタフェース
を提供します。今のところ自動応答機をサポートするために
.Xr isdnd 8
によって使われています。このドライバは isdn4bsd パッケージの一部です。
.Sh 関連項目
.Xr isdnd 8
.Xr isdnd.rc 5
.Sh 作者
.Nm
デバイスドライバとこのマニュアルページは Hellmuth Michaelis が作成
しました。hm@kts.org で彼に連絡できます。
