freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ie.4
.\" jpman %Id: ie.4,v 1.3 1999/11/28 15:53:03 horikawa Stab %
.\"
.\" Copyright (c) 1994, Wilko Bulte
.\" All rights reserved.
.\"
.\"	%Id: ie.4,v 1.7 1998/10/22 14:12:55 bde Exp %
.\"
.Dd September 23, 1994
.Dt IE 4 i386
.Os
.Sh 名称
.Nm ie
.Nd
イーサーネットデバイスドライバ
.Sh 書式
.Cd "device ie0 at isa? port 0x360 net irq 7 iomem 0xd0000"
.Sh 解説
.Nm ie
ドライバは、8 ビット及び 16ビットの Intel i82586 チップをベースにした、
ISA イーサネットカードのサポートを提供します。
これは AT&T の Starlan 10 及び Starlan Fiber、
EN100、Intel EtherExpress 16、3COM 3C507 及び RACAL Interlan NI5210
をサポートします。
.Pp
.Sh 診断
.Bl -diag
.It "ie%d: unknown board type code %d"
i82586 チップは見つかりましたが、
ドライバはプローブ中に実際のボードタイプを決定できませんでした。
.It "ie%d: kernel configured maddr %x doesn't match board configured maddr %x"
デバイスプローブは、
カーネル設定ファイルに指定された maddr と異なる maddr を検出しました。
.It "ie%d: can't find shared memory"
デバイスプローブは、
共有メモリの大きさを得るためのアクセスができませんでした。
.It "ie%d: kernel configured msize %d doesn't match board configured msize %d"
デバイスプローブは、
共有メモリの大きさがカーネル設定ファイルに指定されたサイズと異なることを
検出しました。
.It "ie%d: kernel configured irq %d doesn't match board configured irq %d"
デバイスプローブは、
ボードの割り込み設定がカーネル設定ファイルに指定された設定と異なることを
検出しました。
.It "ie%d: reset"
Intel i82586 はドライバによりリセットされる必要がありました。
.It "ie%d: transceiver problem"
ドライバは、イーサーネットトランシーバに問題を検出しました。
これは、
外付けトランシーバを使用しているときにトランシーバケーブルが緩んでいる、
もしくは破損していることを意味します。
もしこの問題をカード上のトランシーバで経験した場合には、
カードが外付けトランシーバを使用するように
誤ってジャンパ設定されているかもしれません。
最悪の場合、オンボードトランシーバは壊れているかもしれません。
.It "ie%d: TDR detected an open %d clocks away"
ドライバは、
イーサーネットケーブルの回路がオープンになっていることを検出しました。
同軸ケーブルと終点抵抗を確認してください。
.It "ie%d: TDR detected a short %d clocks away"
ドライバは、
イーサーネットケーブルが短絡していることを検出しました。
同軸ケーブルと終端抵抗を確認してください。
.It "ie%d: TDR returned unknown status %x"
ドライバは、イーサーネットケーブル試験で不明な状態を得ました。
.It "ie%d: multicast address setup command failed"
カードは、マルチキャストモードに入れませんでした。
.It "ie%d: configure command failed"
カードは、設定中に正常に応答することを拒否しました。
.It "ie%d: individual address setup command failed"
イーサネットの MAC アドレスをプログラムすることに失敗しました。
.El
.Sh 警告
Racal Interlan NI5210 には、
共有メモリが 8K バイトのものと 16K バイトのものとがあります。
16K バイトのものを使用することを強く推奨します。
8K バイトカードは、追加の RAM チップを加えることにより、
16K バイトにすることができます。
.Pp
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh 作者
.Nm
デバイスドライバは、
.An William F. Jolitz
及び Lawrence Berkeley Laboratories のコードを基に
.An Garrett A. Wollman
が作成しました。
.Tn 3C507 
サポートは
.An Charles M. Hannum
が作成しました。
このマニュアルページは
.An Wilko C. Bulte
が記述しました。
