freebsd/freebsd-doc/ja_JP.eucJP/man/man4/iicsmb.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" jpman %Id: iicsmb.4,v 1.3 1999/09/11 08:13:21 horikawa Stab %
.Dd August 10, 1998
.Dt IICSMB 4
.Os FreeBSD
.Sh 名称
.Nm iicsmb
.Nd
I2C から SMB へのブリッジ
.Sh 書式
.Cd "device iicsmb0 at iicbus?"
.Pp
1 つ以上の smbus バスに対して:
.Cd "controller smbus0"
.Sh 解説
.Em iicsmb
ドライバは
.Xr iicbus 4
を介した
.Xr smbus 4
システム用の SMB コマンドをサポートしています。
.Pp
.Sh 関連項目
.Xr smbus 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で最初に登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
