freebsd/freebsd-doc/ja_JP.eucJP/man/man4/le.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: le.4,v 1.5 1998/10/22 14:12:55 bde Exp %
.\" $FreeBSD$
.\"
.Dd January 19, 1997
.Dt LE 4 i386
.Os FreeBSD
.Sh 名称
.Nm le
.Nd
DEC EtherWORKS II/III イーサネットデバイスドライバ
.Sh 書式
.Cd "device le0 at isa? port 0x300 net irq 5 iomem 0xd0000"
.Sh 解説
.Nm
ドライバは、後期の Digital Equipment EtherWORKS II
(DE200, DE201,  DE202, DE422) と DEC EtherWORKS III (DE203, DE204, DE205) NIC 
のサポートを提供します。
.Pp
.Nm
ドライバのための有効な IRQ 設定は 5, 10, 11, 15 です。
.Pp
.Sh 診断
.Bl -diag
.It "le%d: not configured -- too many devices"
1 台のマシンに許される
.Nm
デバイスの数には制限があります。
.It "le%d: lemac configuration error: expected IRQ 0x%x actual 0x%x"
検出された IRQ 値は、カーネル設定ファイルで指定される値と一致しません
でした。カードを変更するか、新しいカーネルを構築しなければなりません。 
.It "le%d: lemac configuration error: expected iomem 0x%x actual 0x%x"
検出された iomem 値は、カーネル設定ファイルで指定される値と一致しませ
んでした。 カードを変更するか、新しいカーネルを構築しなければなりません。
.It "le%d: reset: EEPROM checksum failed (0x%x)"
EEPROM 内の情報が正確であるということに
.Nm 
ドライバは依存します。このエラーが発生するならば、カードを変更してください。
.It "le%d: fatal RXD error, attempting recovery"
.It "le%d: recovery failed -- board disabled"
受信エラーが発生しました。ドライバは、このエラーから回復しようとします。
しかし、それが不可能な場合、ドライバはカードをシャットダウンします。 
.It "le%d: lance: warning: excessive collisions: TDR%dns (%d-%dm)"
極めて多くのイーサネットコリジョンが検出されました。ネットワークが非常
に混雑している場合かもしれません。あるいは、これは EtherWORKS カードに
よる問題を示唆するかもしれません。  
.El
.Pp
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr config 8 ,
.Xr ifconfig 8
.Rs
.%T "Building 4.3 BSD UNIX System with Config"
.Re
.Sh 歴史
.Nm
デバイスドライバは、
.Fx 2.0
で存在しました。
.Sh 作者
.Nm
デバイスドライバは、
.An Matt Thomas
が書きました。
このマニュアルページは、
.An David E. O'Brien
が書きました。
