freebsd/freebsd-doc/ja_JP.eucJP/man/man4/lkm.4
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: lkm.4,v 1.10 1998/03/12 07:30:17 charnier Exp %
.\" $FreeBSD$
.\"
.Dd January 17, 1996
.Dt LKM 4
.Os FreeBSD 2.0
.Sh 名称
.Nm lkm
.Nd カーネルモジュールを動的にロードする機能
.Sh 解説
動的にロードするカーネルモジュールを用いることにより、システム管理者は
実行中のシステムに動的に機能を加えたり取り除いたり出来ます。
更に、この機能によりソフトウェア開発者は
自らの変更をテストする為に頻繁に再起動をかける事を避けながら
カーネルの新しい構成部品を開発することもできます。
.Pp
多様なタイプのモジュールをシステムにロードすることが出来ます。
後述するように、定義されたモジュールのタイプが幾つかあり、
これらのタイプ毎に予め決められた方法でモジュールはシステムに付加されます。
その上、一般的なタイプもあって、このタイプについてはモジュールは
それ自体がローディングとアンローディングを処理するものと
します。
.Pp
.Tn FreeBSD
システムでは動的にロードするカーネルモジュールを広汎に利用していて、
大部分のファイルシステム、
.Tn NFS
クライアントとサーバ、全てのスクリーンセーバ、そして
.Tn iBCS2
や
.Tn Linux
エミュレータなどについて動的にロードするバージョンを
提供しています。
システムと共に配布されたモジュールは
.Pa /lkm
ディレクトリにあります。
.Pp
.Nm
インタフェースを利用するには
.Pa /dev/lkm
デバイスに対して
.Xr ioctl 2
システムコールを
発行します。
通常、動的にロードするカーネルモジュールに関わる全ての操作は、
.Xr modload 8
と
.Xr modunload 8
と
.Xr modstat 8
の
プログラムにより処理されます。
ユーザは直接
.Pa /dev/lkm
に関与する必要は無い筈です。
.Sh モジュールのタイプ
.Bl -ohang
.It Sy "システムコールモジュール"
システムコールは新しいシステムコールを
.Nm
インタフェースを通してロードすることにより置き換えること
が出来ます。
全てのシステムコールを置き換えることが出来ますが、しかし
.Xr ioctl 2
システムコールに関しては特に注意を払わなければなりません。
何故なら、このシステムコールがモジュールのロードとアンロードに
用いられているからです。
.Pp
システムコールモジュールがアンロードされるときには、
動的にロードされたモジュールにより置き換えられていたシステムコール
はシステムコールテーブルの適正な位置に戻されます。
.It Sy 仮想ファイルシステムモジュール
仮想ファイルシステムは
.Nm
インタフェースを通してロードできます。
.It Sy "デバイスドライバモジュール
新しいブロック型と文字型のデバイスドライバを
.Nm LKM
を用いて、システムにロードすることが出来ます。
デバイスドライバをロードする場合の主要な問題は
アクセスするデバイスに対応してドライバのデバイスノードが
存在しなければならないことです。
これらのデバイスノードを作成するには通常
ドライバのロードが成功した場合に
適切なプログラムを実行するよう
.Xr modload 8
に指定する事により行います。
.It Sy 実行クラス
イメージアクティベータ (image activator) としても知られています。
実行クラスとは、これにより
.Xr execve 2
システムコールが実行可能ファイルの形式を識別してメモリにロード
できるような機構です。
.It Sy 雑モジュール
雑モジュールは、いまのところ明確に定義された、あるいは
一般的となっている拡張のためのインタフェースがないモジュールです。
ユーザは固有のローダを書かなければなりません。
新しいモジュールのロード時およびアンロード時に、
そのモジュールを有効化および無効化するために
必要となるすべてのカーネルデータを、このローダが操作します。
.El
.Sh 関連ファイル
.Bl -tag -width /usr/share/examples/lkm -compact
.It Pa /dev/lkm
.Nm
インタフェースデバイス
.It Pa /lkm
システムと同梱されたモジュールのバイナリが置いてあるディレクトリ
.It Pa /usr/include/sys/lkm.h
モジュールタイプの定義が置いてあるファイル
.It Pa /usr/share/examples/lkm
2タイプのモジュールを実装しているソースコードの例
.Sh 関連項目
.Xr modload 8 ,
.Xr modstat 8 ,
.Xr modunload 8
.Sh バグ
モジュールが正しい初期化に失敗し、更にシステムがこの失敗を見つけることが
出来た場合には、システムは直ちにパニックによる再起動を行います。
.Pp
システムの内部のインタフェースが変更された場合には、
古いままのモジュールはしばしばこの変更を発見できないので、
このようなモジュールはロードされた時に
しばしばクラッシュするかまたは不可解な機能不全を起こします。
.Sh 作者
.Nm
の機能を最初に実装したのは
.An Terrence R. Lambert
です。
動的にロードするファイルシステムを実装したのは
.An Garrett Wollman
です。
動的にロードする実行クラスを実装したのは
.An David Greenman
と
.An Soren Schmidt
と
.An Garrett Wollman
です。
.Sh 歴史
この
.Nm
機能は
.Tn SunOS
4.1.3 が実装した動的にロードするカーネルモジュールと機能が類似するように
設計されています。
.\" Translated by Tetsuro Furuya (古谷 哲郎) <ht5t-fry@asahi-net.or.jp>, Dec 1999.
.\" ML Checked by MITSUNAGA Noriaki <mitchy@er.ams.eng.osaka-u.ac.jp>
.\" Final Checked by
