freebsd/freebsd-doc/ja_JP.eucJP/man/man4/lo.4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)lo.4	8.1 (Berkeley) 6/5/93
.\" jpman %Id: lo.4,v 1.3 2000/01/03 03:14:15 horikawa Stab %
.\"	%Id: lo.4,v 1.5 1997/02/22 13:24:37 peter Exp %
.\"
.Dd June 5, 1993
.Dt LO 4
.Os BSD 4.2
.Sh 名称
.Nm lo
.Nd ソフトウェアループバックネットワークインタフェース
.Sh 書式
.Cd "pseudo-device loop"
.\" lo.4,v 1.5 での原文は
.\"     .Sy pseudo-device
.\"     .Nm loop
.\" 表示が乱れるので、他のファイルにならって .Cd 使用
.\" docs/10495 で send-pr 済み
.\" SETA Takuji <sheta@kk.iij4u.or.jp> 1999/03/09
.Sh 解説
.Nm loop
インタフェースはソフトウェアループバック機構であり、
性能診断、ソフトウェア試験、ローカルな通信等に使用されます。
他のネットワークインタフェースと同様に、
ループバックインタフェースもそのインタフェースが使用する
それぞれのアドレスファミリのために割り当てられた
ネットワークアドレスを持つ必要があります。
これらのアドレスは
.Dv SIOCSIFADDR
.Xr ioctl 2
によって設定、または変更されます。
ループバックインタフェースは
最後のネットワークインタフェースとして設定される必要があります。
これはプロトコルが優先度の指標として
設定の順序を使用するかもしれないためです。
ループバックインタフェースはハードウェアインタフェースが
存在しない場合を除いて
.Em 最初に設定されるべきではありません。
.Sh 診断
.Bl -diag
.It lo%d: can't handle af%d.
インタフェースは不適当なアドレスファミリに含まれる
アドレス形式のメッセージを受け取りました。
パケットは捨てられました。
.El
.Sh 関連項目
.Xr inet 4 ,
.Xr intro 4
.\" .Xr ns 4
.Sh 歴史
.Nm
デバイスは
.Bx 4.2
に登場しました。
.Sh バグ
システムがループバックインタフェースを自動的に利用可能にした
以前のバージョンでは、
非標準のインターネットアドレス (127.1) を使用していました。
このアドレスの使用は現在では使わないよう勧められています。
かわりにローカルなネットワークのために予約されたホストアドレスを
使用する必要があります。
