freebsd/freebsd-doc/ja_JP.eucJP/man/man4/lpbb.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD$
.\" WORD: bit-banging ビット操作
.Dd October 25, 1998
.Dt LPBB 4
.Os FreeBSD
.Sh 名称
.Nm lpbb
.Nd
パラレルポート I2C ビット操作インタフェース
.Sh 書式
.Cd "controller iicbus"
.Cd "controller iicbb0"
.Pp
.Cd "device lpbb0 at ppbus?"
.Cd "device iic0 at iicbus?"
.Sh 解説
.Em lpbb
ドライバはフィリップスの正式な
I2C パラレルビット操作 (bit-banging) インタフェースをサポートします。
.\" 訳注: フィリップスの社名の訳は日本フィリップス社のウェブサイト
.\" (http://www.philips.co.jp/) で確認。ウェブサイト中ではオランダ本社
.\" は「フィリップス」として参照されている。
.Pp
.Bd -literal
 
                                        LS05 ピン 14 (Vcc) o      -------
                                                           |      |     |
            +--+--+---------------------+--+--+------------+------+-o 1 |
            |  |  |                     |  |  |           ===.1μF| +5V |
  -------- [R][R][R] 3x10kΩ   3x10kΩ [R][R][R]   LS05    |      |     |
  |      |  |  |  |                     |  |  |   ピン 7 o-+------+-o 2 |
  | 12 o-+--+  |  |   3|\\ 4             |  |  |    (Gnd)          | GND |
  | 17 o-+-----|--|----| >o-------------+--|--|--------------+    |     |
  |      |     |  |    |/        8 /|9     |  |     10 /|11  +----+-o 3 |
  | 15 o-+-----+--|--------------o< |------+--|------o< |----+    | SCL |
  |      |        |   1|\\ 2        \\|         |        \\|         |     |
  |  9 o-+--------|----| >o-------------------+--------------+----+-o 4 |
  |      |        |    |/                            6 /|5   |    | SDA |
  | 11 o-+--------+----------------------------------o< |----+    -------
  | 10 o-+-+                                           \\|         4 ピン
  | 13 o-+-+--oGND                                               コネクタ
  | 25 o-+-+
  | 25 o-+-+    ------------------ 部品リスト ---------------------------
  --------      | 1 - .1μF コンデンサ| 6 - 10kΩ 5% 抵抗               |
 25 ピン D 型   | 1 - 4 ピン コネクタ | 1 - 25 ピン D 型コネクタ (オス) |
コネクタ (オス) | 1 - 74LS05 オープンコレクタの 6 個のインバータ        |
 PC のプリンタ  ---------------------------------------------------------
 ポートへ
.Ed
.Pp
.Sh 関連項目
.Xr iicbus 4 ,
.Xr iicbb 4 ,
.Xr ppbus 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
から登場しました。
.Sh 作者
このマニュアルページは
.An Nicolas Souchu
が書きました。
