freebsd/freebsd-doc/ja_JP.eucJP/man/man4/mem.4
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)mem.4	5.3 (Berkeley) 5/2/91
.\" jpman %Id: mem.4,v 1.3 1999/08/13 08:27:34 horikawa Stab %
.\"	%Id: mem.4,v 1.3 1997/03/07 02:49:51 jmg Exp %
.\"
.Dd May 2, 1991
.Dt MEM 4 i386
.Os
.Sh 名称
.Nm mem ,
.Nm kmem
.Nd メモリファイル
.Sh 解説
特殊ファイル
.Nm /dev/mem
はコンピュータの物理メモリへのインタフェースです。
このファイルでのバイトオフセットは、物理メモリアドレスとして解釈されます。
このファイルへの読み書きは、メモリそのものへの読み書きと同等です。
.Nm /dev/mem
の範囲内のオフセットだけが許されます。
.Pp
.Nm /dev/mem
と同じやりかたで
.Nm /dev/kmem
インタフェースを通じてカーネルの仮想メモリにアクセスできます。
現在メモリにマップされているカーネル仮想アドレスのみが許されます。
.Pp
.Tn ISA
システムでは
.Tn I/O
メモリ空間が物理アドレス 0x000a0000 から始まり 0x00100000 まで続きます。
現在のプロセスのプロセス毎データの大きさは
.Dv UPAGES
で、仮想アドレス 0xf0000000 で終ります。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /dev/mem
.It Pa /dev/kmem
.El
.Sh 歴史
.Nm mem ,
.Nm kmem
ファイルは
.At v6
から登場しました。
