freebsd/freebsd-doc/ja_JP.eucJP/man/man4/mx.4
.\" Copyright (c) 1997, 1998
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: mx.4,v 1.2 1998/12/05 09:31:25 rnordier Exp %
.\" $FreeBSD$
.\"
.Dd November 5, 1998
.Dt MX 4 i386
.Os FreeBSD
.Sh 名称
.Nm mx
.Nd
Macronix 98713/98715/98725 ファストイーサネットデバイスドライバ
.Sh 書式
.Cd "device mx0"
.Sh 解説
.Nm
ドライバは Macronix 98713, 98713A, 98715, 98715A, 98725 
ファストイーサネットコントローラチップを塔載した PCI イーサネットアダプタ
やそれが組み込まれたコントローラをサポートします。NDC
Communications SOHOware SFA110, SVEC PN102-TX ファストイーサネットカード
などを含みます。
.Pp
Macronix のチップはバスマスタ DMA を用い、DEC 'tulip' 互換として
デザインされています。オリジナルの 98713 は 外部 PHY をコントロール
するための MII バス を用いていますが、98713A より上位のチップは NWAY
をサポートした内部トランシーバを用いています。Macronix のチップは DEC
21x4x コントローラとレジスタ互換であると公表されています。Macronix
コントローラはすべて、10, 100 Mbps を全二重または半二重通信でサポート
します。
.Pp
.Nm
ドライバは次のメディアタイプをサポートします。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
メディアタイプとオプションの自動選択を有効にします。
ユーザは、
.Pa /etc/rc.conf
ファイルにメディアオプションを加えることによって、
自動選択されたモードを手動で上書き可能です。
.It 10baseT/UTP
10Mbps に設定します。
.Ar mediaopt
オプションも
.Ar full-duplex
または
.Ar half-duplex 
モードを選択するために使用可能です。
.It 100baseTX
100Mbps (ファストイーサネット) に設定します。
.Ar mediaopt
オプションも
.Ar full-duplex
または
.Ar half-duplex
モードを選択するために使用可能です。
.El
.Pp
.Nm
ドライバは次のメディアオプションをサポートします。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
全二重通信に設定します。
.It half-duplex
半二重通信に設定します。
.El
.Pp
メディアタイプ 100baseTX はアダプタがサポートしている場合にのみ可能です。
このデバイスの設定に関するさらなる情報は
.Xr ifconfig 8
を参照してください。
.Sh 診断
.Bl -diag
.It "mx%d: couldn't map memory"
致命的な初期化エラーが発生しました。
.It "mx%d: couldn't map interrupt"
致命的な初期化エラーが発生しました。
.It "mx%d: watchdog timeout"
デバイスがネットワークに反応しなくなったか、
ネットワークとの接続 (ケーブル) に問題があります。
.It "mx%d: no memory for rx list"
ドライバはレシーバリング用の mbuf の確保に失敗しました。
.It "mx%d: no memory for tx list"
パッドバッファを確保、または mbuf チェインをクラスタに
縮めるときに、トランスミッタリング用の mbuf の確保に失敗しました。
.It "mx%d: chip is in D3 power state -- setting to D0"
パワーマネージメントをサポートするアダプタにのみ、このメッセージが出ま
す。シャットダウン時にコントローラをローパワーモードにするオペレーティング
システムがあり、チップ設定前にこの状態を解除しない PCI BIOS があります。
ます。D3 状態において、コントローラは PCI の設定すべてを失うので、BIOS 
がそのときにフルパワーモードに設定しなおさなければ、正しく設定すること
はできません。ドライバはこの状態を検出し、アダプタを D0 (フルパワー) 
状態に設定しなおそうとしますが、ドライバを完全に操作できる状態にするの
には至らないかもしれません。ブート時にこのメッセージが現れ、ドライバが
ネットワークインタフェースとしてデバイスをアタッチすることに失敗するの
なら、デバイスを適切に設定するために 2 度目のウォームブートを行う必要が
あります。
.Pp
他のオペレーティングシステムからウォームブートするときのみに、この状態は
起こります。
.Fx
のブート前にシステムの電源を切れば、カードが正常に設定されます。
.El
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Rs
.%T Macronix 98713/A, 98715/A, 98725 データシート
.%O http://www.macronix.com
.Re
.Rs
.%T Macronix 98713/A, 98715/A アプリケーションノート
.%O http://www.macronix.com
.Re
.Sh 歴史
.Nm
デバイスドライバは
.Fx 3.0
に初めて現れました。
.Sh 作者
.Nm
ドライバは
.An Bill Paul Aq wpaul@ctr.columbia.edu
が書きました。
.Sh バグ
Macronix アプリケーションノートによると、チップを通常動作に設定するに
は、ドライバはあるマジックナンバを CSR16 レジスタに書き込む必要があります。
そのマジックナンバはアプリケーションノートに書いてありますが、ビット
の正確な意味は書いてありません。
.Pp
98713A は 10Mbps 全二重通信モードに問題があるようです。
トランスミッタは動作しますが、レシーバは全体のパフォーマンスを著しく下
げるような不明なエラーを大量に出す傾向にあります。
98715A にはこの問題がありません。98713A のそれ以外のすべてのモードでは
正しく動作するようです。
