freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ncr.4
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: ncr.4,v 1.5 1998/09/18 04:36:48 jkoshy Exp %
.\" jpman %Id: ncr.4,v 1.3 1999/04/23 15:11:32 jsakai Stab %
.\"
.Dd July 10, 1996
.Dt NCR 4 i386
.Os
.Sh 名称
.Nm ncr
.Nd NCR 53C8xx SCSI ドライバ
.Sh 書式
.Cd "device ncr0"
.Sh 解説
.Nm
ドライバは
NCR/Symbios 53C810, 53C810a, 
53C815, 53C820, 53C825a, 53C860, 53C875, 53C875j, 53C885, 
53C895, 53C896 SCSI コントローラチップのサポートを提供します。
.Sh 注釈
NCR 5380 と 53C400 チップのサポートは
.Xr nca 4
ドライバによって提供されます。
.Sh 関連項目
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr nca 4 ,
.Xr sd 4 ,
.Xr st 4


