freebsd/freebsd-doc/ja_JP.eucJP/man/man4/pass.4
.\"
.\" Copyright (c) 1998 Kenneth D. Merry.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: pass.4,v 1.2 1998/10/16 00:26:22 ken Exp %
.\" $FreeBSD$
.\"
.Dd October 10, 1998
.Dt PASS 4
.Os FreeBSD 3.0
.Sh NAME
.Nm pass
.Nd CAM アプリケーションパススルードライバ
.Sh 書式
.Cd device pass0
.Cd device pass2 at scbus0 target 3 lun 0
.Sh 説明
.Nm pass
ドライバはユーザランドアプリケーションに CAM CCB を発行する方法を
提供します。
.Pp
.Nm pass
ドライバは CAM サブシステムへ直接アクセスすることを可能に
するため、このドライバへのアクセスを許可する場合、
システム管理者は用心するべきです。
このドライバは正しく使われないと、ユーザランドアプリケーションが
マシンをクラッシュさせたり、データの損失を引き起こすことを可能にする
かもしれません。
.Pp
.Nm pass
ドライバは検出されたすべての
.Tn SCSI
デバイスにアタッチされます。
そのため、
.Tn SCSI
デバイスにアクセスする一般的な方法を提供し、
そのデバイスに関連する "標準の" ペリフェラルドライバ
無しにユーザがアクセスすることを可能にします。
.Sh カーネルコンフィギュレーション
必要なのは、カーネルの中に 1 つの
.Nm pass
デバイスを設定することだけです;
.Nm pass
デバイスは
.Tn SCSI
デバイスが検出された分だけ割り当てられます。
.Sh IOCTLS
.Bl -tag -width 012345678901234
.It CAMIOCOMMAND
任意の種類の CAM CCB を受け取り、CAM トランスポートレイヤへ通過させます。
.It CAMGETPASSTHRU
XPT_GDEVLIST CCB を受け取り、該当するデバイスに対応するパススルーデバイス
を返します。この ioctl は
.Nm pass
ドライバで利用できますが、制限されたものです。この ioctl を
発行するときは、該当するデバイスがパススルーデバイスであること
をすでに知っていなければならないからです。
.Xr xpt 4
デバイスを経由してこの ioctl を発行したほうが便利でしょう。
.El
.Sh ファイル
.Bl -tag -width 01234567890 -compact
.It Pa /dev/pass Ns Ar n
.Nm pass
ドライバのためのキャラクタ型デバイスノードです。
CAM サブシステムを経由してアクセスされるデバイスそれぞれに
存在するべきです。
.El
.Sh 診断
ありません。
.Sh 関連項目
.Xr cam 3 ,
.Xr cam_cdbparse 3 ,
.Xr xpt 4 ,
.Xr camcontrol 8
.Sh 歴史
CAM パススルードライバは
.Fx 3.0
で初めて登場しました。
.Sh 作者
.An Kenneth Merry Aq ken@FreeBSD.ORG
.Sh バグ
パススルードライバを経由して非同期に CCB を送信する方法があれば
好ましいでしょう。そのためにはおそらく何らかの種類の read/write
インタフェースあるいは非同期の ioctl インタフェースが必要でしょう。
