freebsd/freebsd-doc/ja_JP.eucJP/man/man4/pn.4
.\" Copyright (c) 1997, 1998
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: pn.4,v 1.3 1999/01/11 15:38:25 wpaul Exp %
.\" $FreeBSD$
.\"
.Dd November 7, 1998
.Dt PN 4 i386
.Os FreeBSD
.Sh 名称
.Nm pn
.Nd
Lite-On 82c168/82c169 PNIC ファストイーサネットデバイスドライバ
.Sh 書式
.Cd "device pn0"
.Sh 解説
.Nm
ドライバは Lite-On 82c168、82c169 ファストイーサネットコントローラチップを
使用した PCI イーサネットアダプタ及び組み込みコントローラをサポートします。
これらの中には、LinkSys LNE100TX、
Bay Networks Netgear FA310TX リビジョン D1、
Matrox Networks FastNIC 10/100、また D-Link や Trendware をはじめとする、
いくつかのファストイーサネットカードが含まれます。
.Pp
バスマスタ DMA を使用する Lite-On チップは、
DEC の 'tulip' と似た動作をするように設計されています。
以前 DEC 21x4x デバイスを使用して設計していたたくさんのベンダが現在では
PNIC を代わりに使用しています。
このチップは内蔵トランシーバと MII バス経由の外部トランシーバの
両方をサポートしています。
Lite-On チップは EEPROM や MII アクセスが追加されましたが、
DEC 21x4x コントローラとレジスタ互換であるように設計されています。
PNIC コントローラは 10Mbps、100Mbps のそれぞれで全二重、半二重の双方を
サポートします。
.Pp
.Nm
ドライバは以下のメディアタイプをサポートします。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
メディアタイプとオプションの自動選択を許可します。ユーザは
.Pa /etc/rc.conf
ファイルにメディアオプションを追加することにより、手動で自動選択されたモードを
変更することができます。
.It 10baseT/UTP
10Mbps 動作に設定します。さらに、
.Ar mediaopt
オプションは
.Ar full-duplex
と
.Ar half-duplex のモードを設定するのに使えます。
.It 100baseTX
100Mbps (ファストイーサネット) 動作に設定します。
.Ar mediaopt
またオプションは、
.Ar full-duplex
もしくは
.Ar half-duplex
モードで動作するように設定することもできます。
.El
.Pp
.Nm
ドライバは以下のメディアオプションをサポートします。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
強制的に半二重モードでの動作にします。
.It half-duplex
強制的に半二重モードでの動作にします。
.El
.Pp
メディアタイプ 100baseTX は、
アダプタによってサポートされている場合にのみ使用可能だということに
注意してください。
このデバイスの設定に関するより情報については、
.Xr ifconfig 8 
も参照してください。
.Sh 診断
.Bl -diag
.It "pn%d: couldn't map memory"
致命的な初期化エラーが発生しました。
.It "pn%d: couldn't map interrupt"
致命的な初期化エラーが発生しました。
.It "pn%d: watchdog timeout"
デバイスがネットワークへの応答を停止したか、
ネットワークへの接続 (ケーブル) に問題があります。
.It "pn%d: no memory for rx list"
ドライバが受信呼出しのためのメモリバッファを確保できませんでした。
.It "pn%d: no memory for tx list"
ドライバが、送信のためのバッファを確保できなかったか、
送信バッファのメモリチェーンが壊れました。
.It "pn%d: chip is in D3 power state -- setting to D0"
このメッセージはパワーマネジメントをサポートしたカードでのみ発生します。
オペレーティングシステムによっては、シャットダウンの際にコントローラを
省電力モードにするものがあり、PCI BIOS によっては、
チップの設定をする前にこのモードからチップを戻すことができません。
コントローラは D3 状態ですべての
PCI コンフィギュレーションを失うため、BIOS がその時にフルパワーモードにセット
することができなければ正しい設定を行うことはできません。
ドライバはこの状況を検出して D0 (フルパワー) 状態に持っていこうとしますが、
これではドライバを通常の作動状態に復帰させることはできないでしょう。
もしこのメッセージが起動時に表示されて、
ドライバがデバイスをネットワークインタフェースとして認識することが
できなければ、
デバイスが正しく設定されるように二度目の再起動を行う必要があります。
.Pp
この状況は他の OS を使用していて再起動した (warm booting)
ときにだけ発生することに注意してください。もし電源を切ってから、最初に
.Fx 
を起動すれば、
カードは正しく設定されるでしょう。
.El
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Sh 歴史
.Nm
デバイスドライバは
.Fx 3.0
ではじめて登場しました。
.Sh 作者
.Nm
ドライバは
.An Bill Paul Aq wpaul@ctr.columbia.edu 
によって開発されました。
.Sh バグ
.Nm
ドライバは現在のところ、
MII バス経由の PNIC コントローラに接続されている外部トランシーバをもつ
カードしかサポートしていません。
これは
作者が内蔵トランシーバをテストするためのボードを入手できなかったためです。
現在出回っている PNIC の実装のほとんどは外部 PHY を使用しており、
したがってこのことは深刻な問題ではないでしょう。
ハードウェアが入手できるようになれば、
内蔵トランシーバをサポートするコードが追加されるかもしれません。
