freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ppc.4
.\" Copyright (c) 1998, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.\" jpman %Id: ppc.4,v 1.3 1999/09/26 12:24:37 horikawa Stab %
.\"
.\" WORD: phasis フェーズ
.\"
.Dd March 5, 1998
.Dt PPC 4
.Os FreeBSD
.Sh 名称
.Nm ppc
.Nd
パラレルポートチップセットドライバ
.Sh 書式
.Cd "controller ppc0 at isa? port? tty irq 7"
.Pp
1 つ以上の PPBUS バスに対して:
.Cd "controller ppbus at ppc0"
.Sh 解説
.Em ppc
ドライバは、
.Xr ppbus 4
システム用に、
様々なパラレルポートチップセットの低レベルのサポートを提供します。
.Pp
プローブフェーズの間に、ppc はパラレルポートチップセットの検出を行い、
それらの動作モード
(コンパチブル、ニブル、PS/2、EPP、ECP または他の混合モード)
に従ってプライベートなデータの初期化を行います。
スタートアップ時にブートインタフェースの
flags 変数によってモードが指定された場合には、
チップセットの動作モードは「flags」とその使用可能なモードによって
強制的に決定されます。
.Pp
アタッチフェーズでは、ppc は ppbus 構造体の割り当てを行い、
それを初期化して ppbus の attach 関数をコールします。
.Ss サポートされているフラグ
.Bl -item -offset indent
.It
ビット 0-4: チップセット強制モード
.Bd -literal
PPB_COMPATIBLE  0x0     /* セントロニクスコンパチブルモード */
PPB_NIBBLE      0x1     /* 反転 4 ビットモード */
PPB_PS2         0x2     /* PS/2 バイトモード */
PPB_EPP         0x4     /* EPP モード, 32 ビット */
PPB_ECP         0x8     /* ECP モード */
.Ed
.Pp
これらを組み合わせることにより混合モードとなります。
.It
ビット 5: EPP プロトコル (0 EPP 1.9, 1 EPP 1.7)
.It
ビット 6: IRQ の活性化 (1 IRQ 無効, 0 IRQ 有効)
.El
.Ss サポートされているチップセット
ppc はいくつかのパラレルポートチップセットを明示的にサポートしています。
それらでは検出と初期化のコードは仕様データシートに従って書かれています。
.Bl -bullet -offset indent
.It
SMC FDC37C665GT と FDC37C666GT チップセット
.It
Natsemi PC873xx ファミリ (PC87332 と PC87306)
.It
Winbond W83877xx ファミリ (W83877F と W83877AF)
.It
SMC ライクな混合モードのチップセット (
.Xr ppbus 4
参照)
.El
.Ss 新しいチップセットのサポートを追加する
あなたの一番新しいマザーボードについているチップセットをサポートしたいでしょう?
ISA バスではチップセットの仕様を取り寄せて、対応する
.Fn ppc_mychipset_detect ""
関数を書くだけで良いです。
そして汎用の
.Fn ppc_detect ""
関数にエントリを追加します。
.Pp
あなたの
.Fn ppc_mychipset_detect ""
関数では以下のことを確認してください。
.Va flags
ブート変数のモードフィールドがヌルでなければ、
動作モードは強制的に指定されたモードになり、他のモードは使用不可となります。
また、ppb->ppb_avm フィールドには、
そのチップセットで使用できるモードが含まれています。
.Sh 関連項目
.Xr ppbus 4
.Sh 歴史
.Nm
マニュアルページは
.Fx 3.0
で最初に登場しました。
.Sh 作者
このマニュアルは
.An Nicolas Souchu
が書きました。
