freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ppp.4
.\"	%NetBSD: ppp.4,v 1.1 1996/08/10 21:26:12 explorer Exp %
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From:	@(#)lo.4	8.1 (Berkeley) 6/5/93
.\" jpman %Id: ppp.4,v 1.3 2000/01/03 03:15:36 horikawa Stab %
.\"
.Dd August 10, 1996
.Dt PPP 4
.Os
.Sh 名称
.Nm ppp
.Nd point to point プロトコルネットワークインタフェース
.Sh 書式
.Cd "pseudo-device ppp" Op Ar count
.Sh 解説
.Nm ppp
インタフェースによって、
.Em point-to-point
プロトコルを用いたネットワークインタフェースとして、
シリアル回線を使用できます。
.Nm ppp
インタフェースはさまざまな種類の圧縮を使用でき、そして
.Xr sl 4
プロトコルよりも多くの機能を持っています。
.Sh 診断
.Bl -diag
.It ppp%d: af%d not supported.
インタフェースは不適当なアドレスファミリに含まれる
アドレス形式のメッセージを受け取りました。
パケットは捨てられました。
.El
.Sh 関連項目
.Xr inet 4 ,
.Xr intro 4 ,
.Xr sl 4 ,
.Xr pppd 8 ,
.Xr pppstats 8
.Sh バグ
現在は
.Xr ip 4
プロトコルのみがサポートされています。
