freebsd/freebsd-doc/ja_JP.eucJP/man/man4/sb.4
.\" Man page for the SoundBlaster driver
.\"
.\" Copyright (c) 1997, Alex Zepeda.
.\"
.\" This documentation is public domain, and is provided without warranty.
.\" Alex Zepeda, the "author" of this page is not responsible for any
.\" consequences of any sort of manipulation of this document.
.\" 
.\" SoundBlaster and any phrases including it's name are copyright
.\" Creative Labs, not me.
.\" 
.\" alex!@bigfoot.com
.\"
.\" $FreeBSD$
.Dd August 9, 1997
.Dt SB 4 i386
.Os FreeBSD
.Sh 名称
.Nm sb
.Nd Creative Labs SoundBlaster 及び互換デバイスドライバ
.Sh 書式
sb ドライバでサポートされている全てのサウンドカードには以下が必要です:
.Cd controller snd0
.Pp
SoundBlaster, SB Pro, SoundBlaster16, Pro Audio Spectrum (SB エミュレート)
のために:
.Cd "device sb0 at isa? port 0x220 irq 7 drq 1"
.Pp
SB16 固有のサポートのために:
.Cd "device sbxvi0 at isa? drq 5"
.Pp
SoundBlaster 16 における 16 ビット MIDI サポートのために:
.Cd "device sbmidi0 at isa? port 0x300"
.Pp
Jazz16 サポートを追加するために:
.Cd "options JAZZ16"
.Pp
Logitech SoundMan Games サポートを追加するために:
.Cd "options SM_GAMES"
.Pp
SG NX Pro mixer サポートを追加するために:
.Cd "options __SGNXPRO__"
.Pp
OPL-2/3 は SoundBlaster, SoundBlaster Pro, SB 16, Pro Audio
Spectrum で使われています。Yamaha OPL-2/OPL-3 FM サポートのために:
.Cd "device opl0  at isa? port 0x388"
.Sh 解説
このドライバは SoundBlaster 1.0 から SoundBlaster 16/SoundBlaster 32 
を含む SoundBlaster ファミリをカバーしています。awe ドライバは 
AWE32/64 の機能を提供しています。このドライバは FreeBSD 2.0-current 
バージョンから 3.0-current バージョンまで提供されています。
設定ファイルに conflicts キーワードを使うことによって、
複数のカードを同一の DMA を使用するように設定できます。
これは、複数のエミュレーションを行うボードに有用です。
.Sh バグ
SB16 は、別のドライバと同じ IRQ とアドレスを使うため、検出できない 
snd ドライバも存在するでしょう。
これは、衝突が発生しているとカーネルが考えるためです。
これは、sb16 デバイスの行に "confilicts" キーワードを用いれば回避できます。
.Pp
現在のバージョンは、デバイスをクローズして再度オープンすることなく
モードを変更する機能をサポートをしていません。この機能のサポートについては、
将来のバージョンに実装されるかもしれません。 
.Sh 関連項目
cdcontrol(1),  cdplay(1),  mixer(8)
.Sh 作者
オリジナルの SoundBlaster DSP, SoundBlaster 16 MIDI, Yamaha OPL-3 
デバイスは
.An Hannu Savolainen
が書きました。
SoundBlaster 16 DSP のコードは
.An J. Schuber Aq jsb@sth.ruhr-uni-bochum.de
が書きました。
OPL-3 ドライバに対する改良は
.An Rob Hooft Aq hooft@chem.ruu.nl
が行いました。
.Sh 歴史
Sound Galaxy NX Pro のサポートは Hunyue Yau が追加しました(Jan 6 1994)。
MV ProSonic/Jazz 16 の 16ビットサポートは JRA Gibson が追加しました
(April 1995)。 
Audio Excel DSP 16 サポートは Riccardo Facchetti が追加しました(March
24 1995)。  
