freebsd/freebsd-doc/ja_JP.eucJP/man/man4/sl.4
.\"	%NetBSD: sl.4,v 1.1 1996/08/10 21:26:14 explorer Exp %
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From:	@(#)lo.4	8.1 (Berkeley) 6/5/93
.\" $FreeBSD$
.\"
.\" WORD: header compression ヘッダ圧縮
.\" WORD: autodetection 自動検出
.\"
.Dd August 10, 1996
.Dt SL 4
.Os
.Sh 名称
.Nm sl
.Nd slip ネットワークインタフェース
.Sh 書式
.Cd "pseudo-device sl" Op Ar count
.Sh 解説
.Nm sl
インタフェースによって、
.Em slip
プロトコルを用いたネットワークインタフェースとして、
シリアル回線を使用できます。
.Nm sl
インタフェースは Van Jacobson TCP ヘッダ圧縮と
ICMP フィルタリングを使用できます。
この機能は、
.Xr ifconfig 8
コマンドに様々なリンクレベルフラグを用いることで準備されます:
.Pp
.Bl -tag -width LINK0X -compact
.It Em link0
VJ ヘッダ圧縮を有効にします。
.It Em link1
ICMP トラフィックを抑制します。
.It Em link2
VJ ヘッダ圧縮の自動検出を有効にします。
ドライバが最初の VJ 圧縮パケットを見つけるとすぐに
.Em link0
フラグを有効にします。
.El
.Sh 診断
.Bl -diag
.It sl%d: af%d not supported.
インタフェースは不適当なアドレスファミリに含まれる
アドレス形式のメッセージを受け取りました。
パケットは捨てられました。
.El
.Sh 関連項目
.Xr inet 4 ,
.Xr intro 4 ,
.Xr slattach 8 ,
.Xr sliplogin 8 ,
.Xr slstat 8
