freebsd/freebsd-doc/ja_JP.eucJP/man/man4/smp.4
.\" Copyright (c) 1997
.\"	Steve Passe <fsmp@FreeBSD.ORG>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the developer may NOT be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.Dd August 4, 1997
.\" jpman %Id: smp.4,v 1.3 1999/12/27 00:44:58 mitchy Stab %
.Dt SMP 4
.Os FreeBSD 3.0
.Sh 名称
.Nm SMP
.Nd FreeBSD 対称型マルチプロセッサカーネルの説明
.Sh 書式
.Nm SMP
.Sh 解説
.Nm 
カーネルは対称型マルチプロセッサのサポートを実装しています。

.Sh 互換性
.Nm
カーネルはインテルの MP 仕様 バージョン 1.4 に準拠したマザーボードをサポートしています。

.Sh バグ
きっとそうでしょう…

.Sh 関連項目
.Xr mptable 1 ,
.Xr dmesg 8

.Sh 歴史
.Nm
カーネルの初期の歴史は (ちゃんと) 記録されていません。
1997 年 4 月 26 日までは別の CVS ブランチで開発されており、
その時点で 3.0-current にマージされました。
この日までには Lite2 のカーネルコードは 3.0-current へマージされていました。

.Sh 作者
.An Steve Passe Aq fsmp@FreeBSD.org
