freebsd/freebsd-doc/ja_JP.eucJP/man/man4/snp.4
.\"
.\"  %Id: snp.4,v 1.14 1998/03/12 07:30:18 charnier Exp %
.\" $FreeBSD$
.\"
.Dd February 24, 1995
.Dt SNP 4
.Os FreeBSD
.Sh 名称
.Nm snp
.Nd tty 端末を覗き見るインタフェース
.Sh 書式
.Fd #include <sys/snoop.h>
.Ft int
.Fn ioctl fd SNPSTTY &dev
.Ft int
.Fn ioctl fd SNPGTTY &dev
.Ft int
.Fn ioctl fd FIONREAD &result
.Sh 解説
/dev/snp? はユーザが任意の tty 端末に接続してその端末での活動を監視することを
可能にする検査用のデバイスです。

所定の
.Nm snp
デバイスと監視すべき tty とを結合するには、
.Nm snp
デバイスをオープンしてから SNPSTTY ioctl システムコールを発行してください。
IOCTL システムコールに渡される引数は dev_t 型の変数のアドレスです。
引数の値に -1 へのポインタを指定することにより、
snp デバイスを tty から切り離すことが出来ます。
.Pp
SNPGTTY ioctl システムコールはオープンされている
.Nm snp
デバイスにその時点で結合されている tty に関する情報を返します。
.Pp
FIONREAD ioctl システムコールは読込みバッファに格納されている文字数
に等しい正の数を返します。
定義されている特別の値は以下の通りです:
.Bl -tag -width SNP_TTYCLOSE
.It Dv SNP_OFLOW
デバイスオーバフローが発生して、デバイスは切り離されました。
.It Dv SNP_TTYCLOSE
tty は結合されていません。
.It Dv SNP_DETACH
ユーザが
.Nm snp
デバイスを切り離したか又は tty デバイスがクローズされて切り離されました。
.Sh 関連項目
.Xr pty 4 ,
.Xr sio 4 ,
.Xr watch 8
.Sh 制限項目
スーパユーザだけが
.Nm snp
デバイスにアクセスできます。
.Sh バグ
行処理モードである間は、ユーザの入力は見えません。
監視している tty へは、シグナルを送れません。
.Sh 作者
.An Ugen J.S. Antsilevich Aq ugen@NetVision.net.il
.Sh 歴史
.Nm snp
デバイスは
.Fx 2.1
で初めて現れました。
.\" Translated by Tetsuro Furuya (古谷 哲郎) <ht5t-fry@asahi-net.or.jp>, Dec. 1999.
.\" ML Checked by Tetsuya Isaki (井崎哲也) <isaki@net.ipc.hiroshima-u.ac.jp>
.\" ML Checked by MORI Kouji (森 浩二) <moriko@hh.iij4u.or.jp>
.\" Final Checked by Kazuo Horikawa (堀川和雄) <k-horik@yk.rim.or.jp>
