freebsd/freebsd-doc/ja_JP.eucJP/man/man4/splash.4
.\"
.\" Copyright (c) 1999
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: splash.4,v 1.1.2.2 1999/02/10 14:49:52 yokota Exp %
.\" $FreeBSD$
.\"
.\" WORD: splash screen  起動画面
.\" WORD: welcome banner
.\" WORD: color depth    色数
.\"
.Dd February 9, 1999
.Dt SPLASH 4 i386
.Os FreeBSD
.Sh 名称
.Nm splash
.Nd
起動画面 (splash screen) とスクリーンセーバのインタフェース
.Sh 書式
.Cd "pseudo-device splash"
.Sh 解説
.Nm
疑似デバイスドライバは、カーネルに
起動画面とスクリーンセーバのサポートを加えます。
このドライバは起動画面のビットマップイメージを読み込みたい時や、
スクリーンセーバを使いたい時に必要です。
.Sh 起動画面 (SPLASH SCREEN)
システムが起動しようとしている時に、任意のビットマップイメージを
画面上に表示できます。
この画像はカーネルの初期化プロセスの間じゅう画面に表示され、
``Login'' プロンプトが画面に現れるか、
スクリーンセーバが読み込まれて初期化されるまで残ります。
また、この画像はキーを打つと消えますが、
カーネルがまだデバイスを検出している間は
すぐには消えないかもしれません。
.Pp
もしカーネルを読み込む際に
.Fl c
ないし
.Fl v
ブートオプションを指定すると、起動画面の画像は表示されません。
ただしそれでも画像は読み込まれていて、後でスクリーンセーバとして使えます。
下記を参照してください。
.Pp
ビットマップを表示するためには、ビットマップファイルと、
それに対応した起動画面イメージ復号モジュールが
ブートローダによって読み込まれていることが必要です。
現在、以下の復号モジュールが利用可能です:
.Pp
.Bl -tag -width splash_decoder -compact
.It Pa splash_bmp.ko
W*ndows BMP ファイル復号器。
BMP ファイルフォーマットにはさまざまな色数のものがありますが、
この復号器は現在のところ 256 色のビットマップのみを扱えます。
それ以外の色数のビットマップは表示できません。
.El
.Pp
.Sx 使用例
の節で起動画面の設定法を詳しく説明しています。
.Pp
VGA の標準的なビデオモードを使う場合には
ビットマップのサイズは 320x200 以下であることが必要です。
VESA モジュールを静的にリンクするか
もしくは VESA モジュールを読み込むかして、
カーネルの VESA モードサポートを有効にしているのなら
.Pq Xr vga 4 参照
、VESA BIOS とビデオカード上のビデオメモリの量にもよりますが、
最大で 1024x768 の解像度のビットマップを読み込むことができます。
.Sh スクリーンセーバ
.\" 原文 will activate は will be activated ？
スクリーンセーバはシステムがアイドル状態だと考えられる時に起動されます。
アイドル状態とは、
指定した時間の間、ユーザがキーを打たず、マウスも動かさなかった時です。
スクリーンセーバは選択可能なモジュールですので、
明示的にメモリに読み込まれている必要があります。
現在、以下のスクリーンセーバモジュールが利用可能です:
.Pp
.Bl -tag -width splash_module.ko -compact
.It Pa blank_saver.ko
これは単に画面を空白にするだけです。
.It Pa daemon_saver.ko
BSD デーモンのアニメーション。
.It Pa fade_saver.ko
画面が徐々に消えてゆきます。
.It Pa green_saver.ko
モニタが省電力モードを備えていれば、電源を切ります。
.It Pa logo_saver.ko
グラフィックによる BSD デーモンのアニメーション。
.It Pa rain_saver.ko
画面に夕立を描きます。
.It Pa snake_saver.ko
文字列でできた蛇を描きます。
.It Pa star_saver.ko
星が瞬きます。
.It Pa warp_saver.ko
星が素早く流れます。
.El
.Pp
スクリーンセーバモジュールは
.Xr kldload 1
を使って読み込みます:
.\" ここに余計な空行が入ってしまう
.Pp
.Dl kldload logo_saver
.Pp
以下のようにしてタイムアウトの秒数を指定できます:
.Pp
.Dl vidcontrol -t N
.Pp
また
.Pa /etc/rc.conf
ファイルの
.Ar saver
変数をあなたの選んだスクリーンセーバに設定し
タイムアウトを
.Ar blanktime
変数に設定できます。これによりシステム起動時に、
自動的にスクリーンセーバを読み込み、タイムアウトを設定できます。
.Pp
.Ar saver
キーを押すことで
スクリーンセーバを直ちに起動できます。
デフォルトは AT 拡張キーボードでは
.Em Shift-Pause
、AT 84 キーボードでは
.Em Shift-Ctrl-NumLock/Pause
です。
キーマップ
.Pq Xr kbdcontrol 1 、 Xr keymap 5 参照
を書き換えて
.Ar saver
機能をお好みのキーに割り当てることで、
.Ar saver
キーを変更できます。
.Pp
画面がテキストモードでない時にはスクリーンセーバは機能しません。
.Sh 起動画面をスクリーンセーバとして使う
起動画面の画像を読み込んでいてスクリーンセーバを読み込んでいない場合、
起動画面の画像をスクリーンセーバとして使い続けることができます。
画面を切り替えるまでの間隔は、上の
.Sx スクリーンセーバ
の節にあるやりかたで指定できます。
.\".Sh DRIVER CONFIGURATION
.Sh 関連ファイル
.Bl -tag -width /modules/splash_xxxx.ko -compact
.It /boot/loader.rc
ブートローダが読み込むスクリプト
.It /etc/rc.conf
システムの設定情報
.It /modules/splash_*.ko
起動画面イメージ復号モジュール
.It /modules/*_saver.ko
スクリーンセーバモジュール
.It /modules/vesa.ko
VESA サポートモジュール
.El
.Sh 使用例
起動画面やスクリーンセーバを読み込むためには、
カーネル設定ファイルに以下の行があることが必要です。
.Pp
.Dl pseudo-device splash
.Pp
以下の例は、ブートローダのプロンプトから起動画面の画像を
読み込む方法を示しています。
これらはプロンプトのところで手で打っても良いですし、
ブートローダのスクリプト
.Pa /boot/loader.rc 
.Pq Xr loader.rc 5 参照
に書いてもかまいません。
.Bd -literal -offset indent
load kernel
load -t splash_image_data chuck.bmp
load splash_bmp
.Ed
.Pp
2 行目で起動画面に使うビットマップイメージファイルを読み込みます。
上の例では、ファイル
.Pa chuck.bmp
が読み込まれます。
この行に
.Fl t Ar splash_image_data
というオプションを含めることが非常に重要です。
起動画面イメージ復号モジュールは、
既に読み込まれているはずのビットマップデータを探す時に
このタグ名を探すからです。
3 行目で起動画面イメージ復号モジュール
.Pa splash_bmp
を読み込んでいます。
.Pp
以下の例では、VESA モジュールを読み込んでいるので、
標準の VGA モードでは表示できないビットマップファイルも、
VESA ビデオモードを使って表示されるはずです。
.Bd -literal -offset indent
load kernel
load vesa
load -t splash_image_data chuck.bmp
load splash_bmp
.Ed
.Pp
もし VESA サポートがカーネルに静的にリンクされているなら、
VESA モジュールを読み込む必要はありません。
上の最初の例のように、ただビットマップファイルと
起動画面イメージ復号モジュールを読み込むだけで良いです。
.\".Sh DIAGNOSTICS
.Sh 警告
起動画面もスクリーンセーバも、コンソールドライバとして
.Xr syscons 4
を用いる場合にのみ有効です。
もうひとつのコンソールドライバ
.Xr pcvt 4
では利用できません。
.Sh バグ
スクリーンセーバが既に読み込まれている時に
他のスクリーンセーバを読み込んだ場合、
最初のスクリーンセーバは自動的には取り除かれずにメモリに残り、
カーネルのメモリを無駄に消費します。
.Sh 関連項目
.Xr vidcontrol 1 ,
.Xr syscons 4 ,
.Xr vga 4 ,
.Xr rc.conf 5 ,
.Xr kldload 8 ,
.Xr kldunload 8
.Sh 歴史
.Nm
ドライバは
.Fx 3.1
に初めて登場しました。
.Sh 作者
.Nm
ドライバとこのマニュアルページは
.An Kazutaka Yokota Aq yokota@FreeBSD.org
が書きました。
.Pa splash_bmp
モジュールは
.An Michael Smith Aq msmith@FreeBSD.org
と
.An Kazutaka Yokota
が書きました。
