freebsd/freebsd-doc/ja_JP.eucJP/man/man4/sr.4
.\"
.\" Copyright (c) 1996 John Hay.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by John Hay.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY John Hay ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL John Hay BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %Id: sr.4,v 1.10 1998/10/22 14:12:55 bde Exp %
.\"
.\" $FreeBSD$
.Dd July 4, 1996
.Dt SR 4 i386
.Os
.Sh 名称
.Nm sr
.Nd 同期 RISCom/N2 / WANic 400/405 デバイスドライバ
.Sh 書式
.Cd "device sr0 at isa? port 0x300 net irq 10 iomem 0xd0000"
.Cd "device sr1 at isa? port 0x310 net irq 11 flags 0x1 iomem 0xd0000"
.Pp
.Cd "pseudo-device sppp"
.Sh 解説
.Nm sr
ドライバは、HD64570 チップを使用した、
RISCom/N2 ISA カードと WANic 400/405 PCI カードをサポートします。
.Pp
リンクレベルの層に、標準の
.Tn FreeBSD
sppp コードを使用します。
デフォルトのプロトコルは PPP です。
Cisco HDLC プロトコルは
.Xr ifconfig 8
に
.Em link2
を追加することによって使用できます。
.Pp
.Em flags
フィールドは省略可能です。省略した場合、ドライバは次のように仮定します:
.Pp
.Bl -hang -offset indent
.It "カードには 2 ポートあります。"
.It "シリアルポートのクロックは外部のものを使用しており、"
送信と受信のクロックは同じです。
.El
.Pp
.Em flags
はビットフィールドであり、デフォルト以外の動作をさせるために使用します。
.Pp
.Bl -hang -offset indent
.It Em 0x01
カードには 1 ポートだけあります。
.It Em 0x10
ポート 0 で、送信と受信で別々の外部クロックを使用します。
.It Em 0x40
ポート 1 で、送信と受信で別々の外部クロックを使用します。
.El
.Pp
.Sh 番号
カーネル設定ファイルでは、カード毎に 1 行のみが必要です。
最初のカードのポートは sr0 から振られます。
次のカードの番号は、最初のカードの終った所から続けられます。
つまり、もし最初のカードが 2 ポートのカードなら、そのカードは sr0 と sr1
を使います。そして次のカードは sr2 から始まります。
.Pp
カードは IRQ 3, 4, 5, 7, 10, 11, 12, 15 のみをサポートします。
.Pp
iomem 領域は、16Kb ブロックであり、16Kb 境界から始まる必要があります。
.Pp
.Sh 診断
.Bl -diag
.It "sr%d: Warning illegal interrupt %d."
カードが指定された割り込みを使用できません。他の割り込みを選んでください。
.El
.Sh 関連ファイル
.Bl -tag -width /sys/i386/isa/ic/hd64570.h -compact
.It Pa /sys/i386/isa/ic/hd64570.h
.It Pa /sys/i386/isa/if_srregs.h
.It Pa /sys/i386/isa/if_sr.c
.It Pa /sys/pci/if_sr_p.c
.El
.Sh バグ
現時点で X.21 インタフェースだけを試験しています。
他のものでは、クロック選択コードを微調整する必要があるでしょう。
.Pp
このコードには、おそらく最適化の余地があります。
.Sh 関連項目
.Xr ar 4 ,
.Xr cx 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr lsdev 8
.Sh 作者
.Nm sr
デバイスドライバは
.An John Hay Aq jhay@FreeBSD.org
が作成しました。
