freebsd/freebsd-doc/ja_JP.eucJP/man/man4/su.4
.\"	%Id: su.4,v 1.11 1997/12/29 21:07:49 brian Exp %
.\" Copyright (c) 1996
.\"	Julian Elischer <julian@freebsd.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" jpman %Id: su.4,v 1.3 1999/10/06 10:52:01 horikawa Stab %
.\"	WORD:	address		指定する
.\"	WORD:	location	位置
.\"	WORD:	medium		仲介
.Dd August 27, 1993
.Dt SU 4
.Os FreeBSD
.Sh 名称
.Nm su
.Nd scsi ユーザレベルドライバ
.Sh 書式
.Cd "pseudo-device su"
.Sh 解説
.Nm su
ドライバは、scsi バス上の任意の位置を指定するためのサポートを、
プロセスに対して提供します、
マイナ番号は bus:target:lun と一対一に対応しています。
最下位の 3 ビットは lun で、次の 3 ビットは target です。
残りのビットは bus 番号です。
.Pp
SCSI アダプタは、このドライバが有効になる前に、
別にシステムに組み込まれていることが必要です。
.Pp
.Sh カーネルの設定
su のオプションには設定パラメータはありません。
あっても無視されます。
.Pp
.Sh IOCTL
.Nm
ドライバはそれ自身の ioctl 機能はありません、しかし、一般的な 
.Xr scsi 4
ioctl の仲介として機能します。
これらは、
.Em sys/scsiio.h
で述べられています。
.Sh 関連ファイル
.Bl -tag -width /dev/su0-0-0XXXXXXXXXXX -compact
.It Pa /dev/su[0-9]-[0-7]-[0-7]
su{x}-{y}-{z} は bus x, target y, lun z のデバイスの su デバイスです。
.El
.Sh 診断
すべての
.Xr scsi 4
のデバッグ ioctl は
.Nm
デバイスで動作します。
.Sh 関連項目
.Xr cd 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ssc 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh 歴史
.Nm
ドライバは 386BSD 0.1 で登場しました。
