freebsd/freebsd-doc/ja_JP.eucJP/man/man4/tl.4
.\" $FreeBSD$
\" Copyright (c) 1997, 1998
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: tl.4,v 1.2.2.1 1999/01/29 16:32:46 wpaul Exp %
.\"
.Dd May 1, 1998
.Dt TL 4 i386
.Os FreeBSD
.Sh 名称
.Nm tl
.Nd
Texas Instruments ThunderLAN イーサネットデバイスドライバ
.Sh 書式
.Cd "device tl0"
.Sh 解説
.Nm
ドライバは Texas Instruments ThunderLAN イーサネット
コントローラチップを利用した 
PCI イーサネットアダプタをサポートしています。
このドライバは Compaq Prosignia サーバ、
および Compaq Deskpro デスクトップ機のうち、
いくつかのモデルに組込まれている
組み込み型イーサネットコントローラをはじめとする、
数多くの Compaq PCI バスイーサネットアダプタに対応しています。
加えて、このドライバは
Olicom OC-2135/2138 をはじめ、OC-2325, OC-2326 10/100 TX UTP アダプタ、
Racore 8165 10/100baseTX, 8148 10baseT/100baseTX/100baseFX 
など多数のカードをサポートしています。
.Pp
ThunderLAN コントローラは、
最高 32 個の物理的インタフェース装置 (PHY) を
サポートする標準の MII インタフェースを持ちます。
また、MII アドレス 31 に結線されている内蔵型 10baseT PHY も持っています。
このインタフェースは、
10Mbps のみ利用するハードウェア構成で使用可能です。
100Mbps 用の構成においては、
National Semiconductor 社の DP83840A, 又は他社の MII 対応型 PHY が 
ThunderLan の MII に接続されていることでしょう。
DP83840A あるいは相当品が利用できる場合は、ThunderLan チップは
全二重または半二重による、10Mbps および 100Mbps の転送速度で機能します。
ThunderLAN の内蔵 PHY および DP83840A は、
オートネゴシエーションをサポートしています。
.Pp
.Nm
ドライバは次に挙げるメディアタイプをサポートしています:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
メディアタイプとオプションの自動選択を有効にします。
このオプションは、オートネゴシエーションをサポートした PHY が
附属している場合にのみ、利用可能であることに注意してください。
また、後に挙げるメディアオプションの指定によって
明示的に無効化されたモードに関しては、PHY は通告しません。
.It 10baseT/UTP
転送方式を 10Mbps に設定します。
.It 100baseTX
転送方式を 100Mbps (ファーストイーサネット) に設定します。
.It 10base5/AUI
AUI/BNC インタフェースを有効にします (組込み PHY がある場合のみ
利用できます)。
.El
.Pp
.Nm
ドライバは次に挙げるメディアオプションをサポートしています:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
強制的に全二重に設定します。
.It half-duplex
強制的に半二重に設定します。
.It hw-loopback
ハードウェアループバックモードを有効にします。
.El
.Pp
100baseTX メディアタイプは、PHY がサポートしている場合に限って
利用できることに注意してください。
このデバイスの設定に関する、さらに詳しい情報については
.Xr ifconfig 8
を参照してください。
.Sh 診断
.Bl -diag
.It "tl%d: couldn't map memory"
致命的な初期化エラーが発生しました。
.It "tl%d: couldn't map interrupt"
致命的な初期化エラーが発生しました。
.It "tl%d: device timeout"
デバイスはネットワークに対する応答を停止しました。
ネットワークへの接続 (ケーブル) に問題があります。
.It "tl%d: no memory for rx list"
ドライバは、mbuf をレシーバリングに割り当てられませんでした。
.It "tl%d: no memory for tx list"
パッドバッファを割り当てる際、
あるいは mbuf チェーンをクラスタに詰め込む際に、
ドライバは mbuf を送信リングに割り当てられませんでした。
.El
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Sh 歴史
.Nm
デバイスドライバは
.Fx 2.2 
で初めて登場しました。
.Sh 作者
.Nm
ドライバは
.An Bill Paul Aq wpaul@ctr.columbia.edu 
が書きました。
