freebsd/freebsd-doc/ja_JP.eucJP/man/man4/update.4
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: update.4,v 1.4 1997/03/07 02:49:37 jmg Exp %
.\" jpman %Id: update.4,v 1.3 1999/08/18 16:39:47 horikawa Stab %
.\"
.Dd February 11, 1996
.Dt UPDATE 4
.Os FreeBSD
.Sh 名称
.Nm update
.Nd 内部のファイルシステムのキャッシュを定期的にディスクに書き出す
.Sh 書式
.Nm update
.Sh 解説
.Nm update
カーネルプロセスは、
揮発性のファイルシステムデータのキャッシュをディスクに書き出すことで、
ディスクボリュームの完全性を守ることに一役買っています。
これはデフォルトでは 30 秒間隔で行なわれます。
この間隔は、
.Xr sysctl 8
を使って
.Va kern.update
変数を書き換えることで変えることができます。
.Nm update
プロセスは
.Xr sync 2
ファンクションコールがするのと同じ作業をします。
.Sh 関連項目
.Xr sync 2 ,
.Xr fsck 8 ,
.Xr init 8 ,
.Xr rc 8 ,
.Xr sync 8 ,
.Xr sysctl 8
.Sh バグ
クラッシュと同時に
.Xr sync
が起きるとファイルシステムのダメージの原因となりうるシステムがあります。
.Xr fsck 8
を参照してください。
.Sh 歴史
.Nm update
コマンドは
.At v6
で登場し、
通常、システムがマルチユーザモードに移行する際に /etc/rc から起動されました。
カーネルが起動する
.Nm update
プロセスは
.Fx 2.0
に初めて登場しました。
