freebsd/freebsd-doc/ja_JP.eucJP/man/man4/vga.4
.\"
.\" Copyright (c) 1999
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: vga.4,v 1.1.2.2 1999/02/10 14:49:52 yokota Exp %
.\" jpman %Id: vga.4,v 1.3 1999/08/18 16:40:13 horikawa Stab %
.\"
.Dd February 9, 1999
.Dt VGA 4
.Os FreeBSD
.Sh 名称
.Nm vga
.Nd
汎用ビデオカードインタフェース
.Sh 書式
.Cd "options" \&"VESA\&"
.Cd "options" \&"VESA_DEBUG=N\&"
.Cd "options" \&"VGA_ALT_SEQACCESS\&"
.Cd "options" \&"VGA_NO_FONT_LOADING\&"
.Cd "options" \&"VGA_NO_MODE_CHANGE\&"
.Cd "options" \&"VGA_SLOW_IOACCESS\&"
.Cd "options" \&"VM86\&"
.Cd "device vga0 at isa? port ? conflicts"
.Sh 解説
.Nm
ドライバは汎用ビデオカードドライバであり、
ビデオカードを利用できるようにします。
このドライバはコンソールドライバ
.Xr syscons 4
のために必要です。
コンソールドライバは
.Nm
ドライバを呼び出してビデオハードウェアを操作します
(ビデオモードの変更、フォントの読み込み、など)。
.Pp
ビデオカードは他のドライバと同じ範囲の I/O ポートを使用するかもしれないので、
キーワード
.Em conflicts
が必要です。
.Pp
.Nm
ドライバは次の規格のビデオカードをサポートします: MDA, CGA, EGA, VGA。
さらに、ビデオカードがサポートしていれば
VESA 拡張 BIOS を利用することもできます。
VESA サポートは静的にカーネルに含めておくことも、
独立したモジュールとして読み込むこともできます。
.Pp
VESA サポートをカーネルに静的にリンクするためには、
カーネル設定ファイルで
.Em VESA
オプション(以下参照) と
.Em VM86
オプションを定義することが必要です。
.Pp
.Nm vesa
モジュールは
.Xr kldload 8
を使って動的にカーネルに読み込むことができます。
このためには、
.Em VM86
オプションをカーネル設定ファイルで定義しておく必要があります。
.Sh ドライバの設定
.Ss カーネル設定オプション
.Nm
ドライバを制御するために、
以下のカーネル設定オプション
.Pq Xr config 8 参照
が使えます。
これらのオプションはある種の VGA カードとの互換性をとるためのものです。
.Bl -tag -width MOUSE
.It Em VGA_ALT_SEQACCESS
マウスポインタが正しく描画されない場合や、
あるいはフォントが VGA カードにうまく読み込めていないように思える場合には、
このオプションを試すと良いかも知れません。
ただしシステムによってはちらつきが生じるようになるかもしれません。
.It Em VGA_SLOW_IOACCESS
古い VGA カードを正しく動作させるためにこのオプションが必要かもしれません。
これによってドライバは VGA レジスタに対しバイト幅の I/O を行なうようになり、
若干動作が遅くなります。
.El
.Pp
以下のオプションはドライバに任意選択の機能を付け加えます。
.Bl -tag -width MOUSE
.It Em VESA
ドライバに VESA BIOS サポートを加えます。
もし VGA カードが VESA 拡張 BIOS 1.2 以降を持っていれば、
このオプションによって高解像度モードへの切替えに
VESA BIOS を利用するようになります。
このオプションを使用するには
.Em VM86
オプションも必要です。
.It Em VESA_DEBUG=N
VESA サポートのデバッグレベルを
.Fa N
にします。
デフォルトは 0 で、すべてのデバッグ出力は抑制されます。
.El
.Pp
以下のオプションは
.Nm
ドライバから機能を削り、カーネルの使用メモリを節約します。
.Bl -tag -width MOUSE
.It Em VGA_NO_FONT_LOADING
.Nm
ドライバは EGA や VGA のカードにソフトウェアフォントを読み込めます。
このオプションはこの機能を削ります。
.It Em VGA_NO_MODE_CHANGE
このオプションはドライバがビデオモードを変更できないようにします。
.El
.\".Sh 関連ファイル
.Sh 使用例
カーネル設定ファイルには普通は以下の記述があるはずです:
.Pp
.Dl "device vga0 at isa? port ? conflicts"
.Pp
VESA 拡張 BIOS サポートを有効にするためには、
カーネル設定ファイルに次の 3 行を含めてください。
.Pp
.Dl "options" \&"VM86\&"
.Dl "options" \&"VESA\&"
.Dl "device vga0 at isa? port ? conflicts"
.Pp
VESA サポートをカーネルに含めたくないが、たまには使いたい場合には、
次の 2 行をカーネル設定ファイルに加えてください:
.Pp
.Dl "options" \&"VM86\&"
.Dl "device vga0 at isa? port ? conflicts"
.Pp
そして使いたくなったら
.Nm vesa
モジュールを読み込んでください:
.Pp
.Dl kldload vesa
.Pp
.\".Sh 診断
.\".Sh 警告
.\".Sh バグ
.Sh 関連項目
.Xr syscons 4 ,
.Xr config 8 ,
.Xr kldload 8 ,
.Xr kldunload 8
.Sh 規格
.Rs
.%T "VESA BIOS Extension (VBE)"
.%A Video Electronics Standards Association
.Re
.Sh 歴史
.Nm
ドライバは
.Fx 3.1
に初めて登場しました。
.Sh 作者
.Nm
ドライバは
.ie t .An S\(/oren Schmidt Aq sos@FreeBSD.org
.el .An Soren Schmidt Aq sos@FreeBSD.org
と
.An Kazutaka Yokota Aq yokota@FreeBSD.org
が書きました。このマニュアルページは
.An Kazutaka Yokota
が書きました。
