freebsd/freebsd-doc/ja_JP.eucJP/man/man4/vn.4
.\"     %NetBSD: vnd.4,v 1.1 1995/12/30 18:10:48 thorpej Exp %
.\"
.\" Copyright (c) 1995 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed for the NetBSD Project
.\"     by Jason R. Thorpe.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" Original Revision: 1.2
.\" jpman %Id: vn.4,v 1.3 1999/08/18 16:40:07 horikawa Stab %
.Dd December 30, 1995
.Dt VN 4
.Os
.Sh 名称
.Nm vn
.Nd vnode ディスクドライバ
.Sh 書式
.Cd "pseudo-device vn" Op Ar count
.Sh 解説
.Nm
ドライバは、ファイルに対する、ディスクと同様のインタフェースを提供します。
このドライバは、スワップファイルだとか、
ミニルートやフロッピディスクイメージの作成などのような、
さまざまな応用に役立ちます。
.Pp
この文書は、あなたがカーネルの作りかたや、カーネル設定ファイルにおいて
どうやってディスクや疑似デバイスを正しく設定するか、
といったことに通じていることを前提にしています。
.Pp
.Nm vn
ドライバをサポートしたカーネルをコンパイルするためには、
カーネル設定ファイルに次のような行を追加する必要があります:
.Bd -unfilled -offset indent
pseudo-device   vn      4       #Vnode driver
.Ed
.Pp
.Ar count
はブート時にメモリを割り当てる
.Nm vn
ドライバの数です。
この例では、4 つを越えた分の
.Nm vn
ドライバは準備されません。
.Pp
.Nm vn
ドライバを実行時に設定するために使うユーティリティがあります。
詳しくは、
.Xr vnconfig 8
を参照して下さい。
.Sh バグ
対象となるファイルがローカルファイルシステムにない場合には、
.Nm
ドライバはうまく機能しません。
.Sh 関連ファイル
/dev/{,r}vn* - vn デバイスの特殊ファイル
.Pp
.Sh 歴史
vnode ディスクドライバのオリジナルは
ユタ大学 (the University of Utah) で書かれました。
.Sh 関連項目
.Xr config 8 ,
.Xr fsck 8 ,
.Xr MAKEDEV 8 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr vnconfig 8
