freebsd/freebsd-doc/ja_JP.eucJP/man/man4/vr.4
.\" Copyright (c) 1997, 1998
.\"     Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"     %Id: vr.4,v 1.2 1998/12/05 09:31:25 rnordier Exp %
.\" jpman %Id: vr.4,v 1.3 2000/01/06 12:54:50 horikawa Stab %
.\"
.Dd November 22, 1998
.Dt VR 4 i386
.Os FreeBSD
.Sh 名称
.Nm vr
.Nd
VIA Technologies VT3043 と VT86C100A イーサネットデバイスドライバ
.Sh 書式
.Cd "device vr0"
.Sh 解説
.Nm
ドライバは、VIA Technologies 社の VT3043 Rhine I と 
VT86C100A Rhine II のファーストイーサネットチップを搭載した 
PCI イーサネットカードのサポートを提供します。
このサポート範囲には、D-Link DFE530-TX やその他諸々の安価な
ファーストイーサネットカードが含まれます。
.Pp
VIA Rhine チップはバスマスタ DMAを使用し、DEC 21x4x "tulip" チップに
似たデザインのソフトウェアインタフェースを持っています。大きな違いは、
Rhine チップの受信フィルタの方がはるかに単純だということです。tulip の
ように、送信 DMA エンジン経由で特殊な設定フレームをダウンロードしたり
せずに、Rhine はレジスタ経由でプログラミングします。また、送信 DMA 
バッファ、受信 DMA バッファとも、longword で境界調整する必要があることも
違います。Rhine チップは、外部にある物理層デバイスとは MII バスを通して
接続されるように設計されています。また、10Mbps と 100Mbps の両方の
スピードが、全二重、半二重のどちらのモードでもサポートされています。
.Pp
.Nm
ドライバは次のようなメディアタイプをサポートします。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
メディアタイプやオプションの自動選択を使用可能にします。
ユーザは、
.Pa /etc/rc.conf
ファイルにメディアオプションを書き加えることで、
自動選択されたモードを手動で強制的に変更できます。
.It 10baseT/UTP
10Mbps に設定します。
.Ar mediaopt
は、
.Ar full-duplex
または
.Ar half-duplex
モードを選択するために使用可能です。
.It 100baseTX
100Mbps (ファストイーサネット) に設定します。
.Ar mediaopt
は
.Ar full-duplex
または
.Ar half-duplex
モードを選択するために使用可能です。
.El
.Pp
.Nm
ドライバは、次のメディアオプションをサポートしています。
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
full duplex に設定します。
.It half-duplex
half duplex に設定します。
.El
.Pp
アダプタがサポートしているときのみ、100baseTX メディアタイプは使用可能です。
このデバイスを設定するためにもっと多くの情報が必要な場合は
.Xr ifconfig 8
を参照してください。
.Sh 診断
.Bl -diag
.It "vr%d: couldn't map memory"
致命的な初期化エラーが起こりました。
.It "vr%d: couldn't map interrupt"
致命的な初期化エラーが起こりました。
.It "vr%d: watchdog timeout"
デバイスがネットワークに応答しなくなったか、ネットワークの
接続 (ケーブル) に問題があります。
.It "vr%d: no memory for rx list"
ドライバがレシーバリング用の mbuf の確保に失敗しました。
.It "vr%d: no memory for tx list"
パッドバッファを確保、または mbuf チェインをクラスタにまとめるときに、
トランスミッタリング用の mbuf の確保に失敗しました。
.It "vr%d: chip is in D3 power state -- setting to D0"
パワーマネージメントをサポートするアダプタにのみ、このメッセージが出ます。
オペレーティングシステムの中にはシャットダウン時にコントローラを
ローパワーモードにするものがあり、チップになにか新しく設定する前に
この状態から脱出しなければならないのですが、PCI BIOS の中にはこの脱出に
失敗してしまうものもあります。コントローラはこの D3 状態になると設定状態が
揮発してしまうので、もし BIOS が規定の時間内にもとの状態に戻せなかったら、
その後の設定は正常に実行できません。
ドライバはこの状態の検出し、アダプタを D0 (フルパワー) 状態に
戻そうとしますが、これでは、ドライバが完全に動作する状態に戻すためには
不十分かもしれません。
ブート時にこのメッセージが表示され、ドライバがこのデバイスを
ネットワークインタフェースとして接続できない場合は、さらに 1 回ウォームブート
させて、デバイスを適切に設定させる必要があります。
.Pp
他のオペレーティングシステムからウォームブートするときのみに、この状態は
起こります。
.Fx
のブートに先だってシステムをシャットダウンする場合、カードを正常に
設定しておく必要があります。
.El
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 , 
.Xr ifconfig 8
.Rs
.%T VIA Technologies VT86C100A データシート
.%O http://www.via.com.tw
.Re
.Sh 歴史
.Nm
デバイスドライバは
.Fx 3.0 
に初めて登場しました。
.Sh 作者
.Nm
ドライバは
.An Bill Paul Aq wpaul@ctr.columbia.edu
が書きました。
.Sh バグ
.Nm
ドライバは、送信前には常に、送信 mbuf チェーンを longword 境界に整列した
バッファへコピーすることにより、Rhine チップの暴走を避けます。
バッファ境界が正しくない場合、
チップは与えられたバッファアドレスを丸めてしまい、
間違った境界アドレスから DMAを開始してしまいます。
バッファのコピーはシステム性能を低下させますが、不可避です。
(Pentium II のような) 速いマシンでは、性能への影響はずっと少ないでしょう。
