freebsd/freebsd-doc/ja_JP.eucJP/man/man4/vx.4
.\"
.\" Copyright (c) 1996, Fred Gray
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed by David Greenman.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: vx.4,v 1.7 1998/03/12 07:30:39 charnier Exp %
.\" $FreeBSD$
.\"
.Dd January 15, 1996
.Dt VX 4 i386
.Os
.Sh 名称
.Nm vx
.Nd
PCI イーサネットデバイスドライバ
.Sh 書式
.Cd "device vx0"
.Sh 解説
.Nm vx
ドライバは、
3Com の 3c590 と 3c595、すなわち EtherLink III と Fast EtherLink III の
PCI イーサネットカードを、10 Mbps モードでサポートします。
次の
.Xr ifconfig 8
コマンドへの link フラグによって、媒体を選択可能です。
.Pp
.Bl -tag -width LINK0X -compact
.It Em link0
AUI ポートを使用します。
.It Em link1
BNC ポートを使用します。
.It Em link2
UTP ポートを使用します。
.El
.Sh 診断
.Bl -diag
.It "vx%d: not configured; kernel is built for only %d devices."
システムにあるアダプタ数に対して、カーネル設定ファイル内の
デバイス数が十分ではありません。
設定ファイルにデバイスを追加し、
カーネルを再構築してリブートして下さい。
.Pp
他のすべての診断はハードウェアの問題かドライバのバグを示しています。
.Sh 警告
初期のいくつかの 3c590 カードには問題があり、
受信あふれの被害を受けます。
その結果として、パケット損失を引き起こします。
作者は、3 Com から提供される情報を基に、
このようなリビジョンの検査を実装しようとしました。
しかし、検査の出力の大部分は疑わしい警告にすぎません。
.Pp
カードのバスマスタリング機能を使用せず
ポーリングモードの I/O のみを使用することから、
このドライバの性能はいくらか制限されます。
.Sh バグ
.Nm vx
ドライバはいくつかのシステム上でワームブートの後、アダプタを正しく
リセットしないことが知られています。
.Pp
.Nm vx
ドライバは、サポートしているとされるカードのすべてのモデルで
徹底的にテストを行なっているわけではありません。
.Sh 歴史
.Nm vx
デバイスドライバは
.Fx 2.1
で最初に登場しました。
これは
.Nm ep
ドライバに由来していて、多くの制限を継承しています。
.Sh 作者
.Nm vx
デバイスドライバとこのマニュアルページは、
.An Herb Peyerl
の作業とその他の多くの人の援助を基に
.An Fred Gray Aq fgray@rice.edu
によって書かれました。
