freebsd/freebsd-doc/ja_JP.eucJP/man/man4/wd.4
.\"
.\" Copyright (c) 1994 Wilko Bulte
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"     %Id: wd.4,v 1.10 1998/10/22 14:12:55 bde Exp %
.\" jpman %Id: wd.4,v 1.3 1999/08/18 16:40:15 horikawa Stab %
.\"
.Dd August 31, 1994
.Dt WD 4 i386
.Os FreeBSD
.Sh 名称
.Nm wd
.Nd
一般的な WD100x/IDE ディスクコントローラ用ドライバ
.Sh 書式
.Cd "controller wdc0 at isa? port" \&"IO_WD1\&" bio irq 14
.Cd "disk wd0 at wdc0 drive 0
.Cd "disk wd1 at wdc0 drive 1
.Pp
CMD640b IDE コントローラ用:
.Cd "options"  \&"CMD640\&"
.Sh 解説
このドライバで、Western Digital WD100x シリーズをエミュレートする
コントローラに接続されたディスクにアクセスできるようになります。
これには、WD1003 ST412 コントローラ、WD1007 ESDI コントローラ、
そしてほとんどのマザーボードにある一般的な IDE コントローラを含みます。
.Pp
WD100x シリーズとの互換性については、通常、コントローラの資料に説明があります。
.Pp
.Ar flags
パラメータを使って、ドライバにヒントや指令を伝えることができます。
.Pp
16 ビット整数のフラグがドライブ毎にあり、
それぞれに 4 (訳注: 実際には 6) 個のビットフィールドがあります:
.\" By mzaki@e-mail.ne.jp (Mar 1 1999)
.Bl -tag -width 0x0000 -offset 1c
.It 0x8000
ドライブの 32 ビット転送機能が使えれば使います。
.It 0x4000
ドライブがスリープモードから脱しているところであるようならば、
混乱しているとみなして再初期化します。
.It 0x2000
最近の PCI チップセットにあるバスマスタ DMA 機能があるか調べて利用します。
.It 0x1000
デフォルトの CHS アドレッシングではなく、LBA アドレッシングを使います。
.It 0x0f00
ヘッドの数を ((flags & 0xf00)>>8) と見なして、
それに合うようにシリンダ数を計算し直します。
.It 0x00ff
ドライブのマルチセクタ転送モードが使えれば使います。
最大で (flags & 0x00ff) セクタの転送を試みます。
.El
.Pp
このフラグは drive 行に 16 ビット整数で指定するか、
あるいは controller 行に 32 ビット整数で指定します。
この場合、上位 16 ビットが番号の大きなドライブに適用されます。
.Pp
.Dq Dv CMD640
オプションによって、CMD640b IDE コントローラの欠陥に対処するようになります。
このオプションが指定されていて、
かつ PCI サブシステムがこのチップを検出した場合には、
プライマリとセカンダリのコントローラは同時には使われません。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /dev/wd*
ディスクのブロックデバイスノード
.It Pa /dev/rwd*
ディスクのキャラクタデバイスノード
.It Pa /sys/i386/conf/GENERIC
.\" 原文
.\" sample generic kernel config file for (a.o.) wd based systems
.\" の a.o. ってなんでしょう？
wd によるシステムのためのジェネリックカーネルの設定ファイルのサンプル
.It Pa /sys/i386/isa/wd.c
ドライバのソース
.El
.Sh 関連項目
.Xr bad144 8
.Sh 注釈
このコントローラとディスクの組合わせは、
自動的にバッドブロックを処理をするための機構を備えていません。
バッドブロックを調べるには
.Xr bad144 8
を実行する必要があります。
