freebsd/freebsd-doc/ja_JP.eucJP/man/man4/ze.4
.\"
.\" Copyright (c) 1997 David E. O'Brien
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %Id: ze.4,v 1.6 1998/10/22 14:12:55 bde Exp %
.\" jpman %Id: ze.4,v 1.3 1999/11/28 15:52:45 horikawa Stab %
.\"
.Dd January 19, 1997
.Dt ZE 4 i386
.Os FreeBSD
.Sh 名称
.Nm ze
.Nd
IBM/National Semiconductor PCMCIA イーサネットデバイスドライバ
.Sh 書式
.Cd "device ze0 at isa? port 0x300 net irq 5 iomem 0xd8000"
.Sh 解説
.Nm
ドライバは、IBM/National Semiconductor ベースの
PCMCIA イーサネットコントローラのサポートを提供します。
これは IBM Thinkpad 用
IBM Credit Card adapter I 及び II や，National `InfoMover' NE4100
PCMCIA カードを含みます。
.Nm
ドライバは National Semiconductor DS8390 イーサネットアダプタ用の
デバイスドライバに基づいています。
.Sh 診断
.Bl -diag
.It "ze%d: device timeout, isr=%02x, imr=%02x, imask=%04x"
デバイスがネットワークに応答しなくなりました。または、ネットワーク接続
(ケーブル) に問題があります。   
.It "ze%d: shared memory corrupt - invalid packet length %d"
このエラーは、イーサネットドライバチップが初期リビジョンで、負荷が高い
場合にときどき見られます。パケット長のバイトオーダが切り替わってしまう
ためです。
.El
.Sh 警告
このドライバは IBM Credit Card Adapter for Ethernet に対してのみ動作す
ることが知られています。
PCMCIA コンフィギュレーションオプションレジスタ (COR) の位置決定を、
IBM のカードで予想されている値にハードコーディングするかわりに、
コンフィギュレーションタプルを解析するようドライバを修正すれば、
他の PCMCIA カードでもおそらく動作するでしょう。
.Sh バグ
現在、 このドライバはマルチキャストをサポートしていません。
.Sh 関連項目
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
デバイスドライバは
.Fx 1.1.5
から登場しました。
.Sh 作者
.Nm
デバイスドライバは 
.An Keith Moore 
が書きました。もともと
.An David Greenman 
の成果に基づいており、Keith が PCMCIA の変更と追加をしました。
それを
.An Jordan Hubbard 
が
.Fx 1.1.5
に合わせて改造しました。
このマニュアルページは 
.An David E. O'Brien
が書きました。
