freebsd/freebsd-doc/ja_JP.eucJP/man/man4/zero.4
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@freebsd.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mike Pritchard and
.\"	contributors.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: zero.4,v 1.2 1997/03/07 02:49:38 jmg Exp %
.\" jpman %Id: zero.4,v 1.3 1999/12/17 05:29:55 mitchy Stab %
.\"
.Dd April 7, 1996
.Dt ZERO 4
.Os
.Sh 名称
.Nm zero
.Nd zero デバイス
.Sh 解説
.Nm
デバイスは普通のファイルのように (いくらでも) データを受け入れ、
読み出せますが、書き込まれたデータは捨て去られます。
また、読み出すとナルバイトを際限なく返します。
.Sh 関連ファイル
.Bl -tag -width /dev/zero
.It Pa /dev/zero
.El
.Sh 関連項目
.Xr null 4
.Sh 歴史
.Nm
デバイスは
.Bx 4.4
から登場しました。
