Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/gjournal-desktop/_index.po
Languages: es, pt_br

source: The journal probably fills up before it has a chance to get committed (flushed) to disk. Keep in mind the size of the journal depends on the usage load, and not the size of the data provider. If your disk activity is high, you need a larger partition for the journal. See the note in the <<understanding-journaling>> section.
es: Es probable que el journaling se llene antes de tener la oportunidad de grabarse (flushed) el disco. Ten en cuenta que el tamaño del journal depende del uso, no del tamaño del provider de datos. Si la actividad del disco es alta, necesitas una partición más grande para el journal. Consulta la nota en la sección <<understanding-journaling>>.
pt_br: O journal provavelmente fica cheio antes de ter a chance de ser confirmado (gravado) no disco. Lembre-se de que o tamanho do journal depende da carga de uso e não do tamanho do provedor de dados. Se a atividade do disco for intensa, será necessário uma partição maior para o journal. Consulte a nota na seção <<understanding-journaling,Compreendendo o Journaling>> para mais informações.

source: I made some mistake during configuration, and I cannot boot normally now. Can this be fixed some way?
es: Cometí algún error durante la configuración, y ahora no puedo arrancar. ¿Se puede arreglar esto de alguna manera?
pt_br: Eu cometi algum erro durante a configuração e não consigo inicializar normalmente agora. Isso pode ser resolvido de alguma forma?

source: You either forgot (or misspelled) the entry in [.filename]#/boot/loader.conf#, or there are errors in your [.filename]#/etc/fstab# file. These are usually easy to fix. Press kbd:[Enter] to get to the default single user shell. Then locate the root of the problem:
es: Has olvidado (o te has equivocado al escribir) la entrada en [.filename]#/boot/loader.conf# o hay errores en tu fichero [.filename]#/etc/fstab#. Normalmente son fáciles de arreglar. Presiona kbd:[Enter] para obtener un shell por defecto en modo usuario único. Después localiza la raíz del problema:
pt_br: Parece que você esqueceu (ou digitou incorretamente) a entrada no arquivo [.filename]#/boot/loader.conf# ou existem erros no arquivo [.filename]#/etc/fstab#. Esses erros geralmente são fáceis de corrigir. Pressione kbd:[Enter] para acessar o shell do sistema no modo de usuário unico. Em seguida, localize a raiz do problema:

source: If the `geom_journal_load` entry is missing or misspelled, the journaled devices are never created. Load the module manually, mount all partitions, and continue with multi-user boot:
es: Si la entrada `geom_journal_load` no está o está mal escrita, no se crearán los dispositivos que utilizan journaling. Carga el módulo manualmente, monta todas las particiones y continúa con el arranque en modo multiusuario:
pt_br: Se a entrada `geom_journal_load` estiver ausente ou digitada incorretamente, os dispositivos com journaling não serão criados. Carregue o módulo manualmente, monte todas as partições e continue com a inicialização em modo multiusuário:

source: If, on the other hand, this entry is correct, have a look at [.filename]#/etc/fstab#. You will probably find a misspelled or missing entry. In this case, mount all remaining partitions by hand and continue with the multi-user boot.
es: Si, por otro lado, esta entrada es correcta, echa un vistazo al archivo [.filename]#/etc/fstab#. Probablemente encontrarás una entrada que está mal escrita o directamente no está. En este caso, monta todas las particiones restantes a mano y continúa con el arranque en modo multiusuario.
pt_br: Por outro lado, se essa entrada estiver correta, verifique o arquivo [.filename]#/etc/fstab#. Provavelmente você encontrará uma entrada ausente ou digitada incorretamente. Nesse caso, monte todas as partições restantes manualmente e continue com a inicialização em modo multiusuário.

source: Can I remove journaling and return to my standard file system with Soft Updates?
es: ¿Puedo eliminar el journaling y volver a mi sistema de archivos estándar con Soft Updates?
pt_br: Posso remover o registro no journal e retornar ao meu sistema de arquivos padrão com o Soft Updates?

source: Sure. Use the following procedure, which reverses the changes. The partitions you created for the journal providers can then be used for other purposes, if you so wish.
es: Por supuesto. Utiliza el siguiente procedimiento, el cual revierte los cambios. Las particiones que has creado para los journal providers se pueden usar para otros fines, si así lo deseas.
pt_br: Claro. Use o seguinte procedimento, que reverte as alterações. As partições que você criou para os provedores de journal podem ser usadas para outros fins, se desejar.

source: Login as `root` and switch to single user mode:
es: Haz login como `root` y entra en modo usuario único:
pt_br: Faça login como `root` e altere para o modo de usuário único:

source: Unmount the journaled partitions:
es: Desmonta las particiones que tengan journaling:
pt_br: Desmonte as partições journaled:

source: Synchronize the journals:
es: Sincroniza los journals:
pt_br: Sincronize os journals:

source: Stop the journaling providers:
es: Para los journaling providers:
pt_br: Pare os provedores de journaling:

source: Clear journaling metadata from all the devices used:
es: Borra los metadatos de journaling de datos los dispositivos que utilice:
pt_br: Limpe os metadados de journaling de todos os dispositivos usados:

source: Clear the file system journaling flag, and restore the Soft Updates flag:
es: Borra el flag de journaling del sistema de archivos y restaure el flag de Soft Updates:
pt_br: Limpe o sinalizador de journaling do sistema de arquivos e restaure a flag do Soft Updates:

source: Remount the old devices by hand:
es: Vuelve a montar los dispositivos antiguos a mano:
pt_br: Remonte os dispositivos antigos à mão:

source: Edit [.filename]#/etc/fstab# and restore it to its original state:
es: Edita [.filename]#/etc/fstab# y restáuralo a su estado original:
pt_br: Edite o arquivo [.filename]#/etc/fstab# e restaure-o para seu estado original:

source: Finally, edit [.filename]#/boot/loader.conf#, remove the entry that loads the `geom_journal` module and reboot.
es: Por último, edita [.filename]#/boot/loader.conf#, elimina la entrada que carga el módulo `geom_journal` y reinicia.
pt_br: Finalmente, edite o arquivo [.filename]#/boot/loader.conf#, remova a entrada que carrega o módulo `geom_journal` e reinicie o sistema.

source: Further Reading
es: Lecturas adicionales
pt_br: Leitura Adicional

source: Journaling is a fairly new feature of FreeBSD, and as such, it is not very well documented yet. You may however find the following additional references useful:
es: El Journaling es una característica relativamente nueva en FreeBSD, y como tal, todavía no está muy bien documentada. Sin embargo, puedes encontrar útiles las siguientes referencias:
pt_br: O journaling é um recurso relativamente novo no FreeBSD e, portanto, ainda não está muito bem documentado. No entanto, você pode encontrar as seguintes referências adicionais úteis:

source: A extref:{handbook}[new section on journaling, geom-gjournal] is now part of the FreeBSD Handbook.
es: Una extref:{handbook}[nueva sección sobre journaling, geom-gjournal] forma parte ahora del FreeBSD Handbook.
pt_br: A extref:{handbook}[nova seção sobre journaling, geom-gjournal] agora faz parte do FreeBSD Handbook.

source: https://lists.freebsd.org/pipermail/freebsd-current/2006-June/064043.html[This post] in {freebsd-current} by man:gjournal[8]'s developer, `{pjd}`.
pt_br: https://lists.freebsd.org/pipermail/freebsd-current/2006-June/064043.html[Esta mensagem] na {freebsd-current} enviada por um desenvolvedor do man:gjournal[8]'s, `{pjd}`.

source: https://lists.freebsd.org/pipermail/freebsd-questions/2008-April/173501.html[This post] in {freebsd-questions} by `{ivoras}`.
pt_br: https://lists.freebsd.org/pipermail/freebsd-questions/2008-April/173501.html[Esta mensagem] na {freebsd-questions} enviada por `{ivoras}`.

source: The manual pages of man:gjournal[8] and man:geom[8].
es: Las páginas del manual de man:gjournal[8] y de man:geom[8].
pt_br: As páginas de manual man:gjournal[8] e man:geom[8].

source: GEOM_JOURNAL: Journal 2948326772: ad0s1g contains journal. GEOM_JOURNAL: Journal 3193218002: ad0s1h contains journal. GEOM_JOURNAL: Journal 3193218002: ad0s1d contains data. GEOM_JOURNAL: Journal ad0s1d clean. GEOM_JOURNAL: Journal 2948326772: ad0s1f contains data. GEOM_JOURNAL: Journal ad0s1f clean.
es: ad0: 76293MB XEC XE800JD-00HBC0 08.02D08 at ata0-master SATA150 GEOM_JOURNAL: Journal 2948326772: ad0s1g contains journal. GEOM_JOURNAL: Journal 3193218002: ad0s1h contains journal. GEOM_JOURNAL: Journal 3193218002: ad0s1d contains data. GEOM_JOURNAL: Journal ad0s1d clean. GEOM_JOURNAL: Journal 2948326772: ad0s1f contains data. GEOM_JOURNAL: Journal ad0s1f clean.
