Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/gjournal-desktop/_index.po
Languages: es, pt_br

source: Now, move the highlight to the disk name at the top of the screen and press kbd:[C] to create a new partition for [.filename]#/usr#. This new partition should be smaller by 1 GB (if you intend to journal [.filename]#/usr# only), or 2 GB (if you intend to journal both [.filename]#/usr# and [.filename]#/var#). From the pop-up that appears, opt to create a file system, and type [.filename]#/usr# as the mount point.
es: Ahora, mueve la fila resaltada al nombre del disco en la parte superior de la pantalla y presiona la tecla kbd:[C] para crear una nueva partición para [.filename]#/usr#. Esta nueva partición debe ser 1 GB más pequeña (si deseas añadir journaling en [.filename]#/usr# solo), o 2 GB (si deseas añadir journaling tanto en [.filename]#/usr# como en [.filename]#/var#). Desde la ventana emergente, elige crear un sistema de archivos y escribe [.filename]#/usr# como punto de montaje.
pt_br: Agora, mova o destaque para o nome do disco no topo da tela e pressione kbd:[C] para criar uma nova partição para [.filename]#/usr#. Essa nova partição deve ser menor em 1 GB (se você pretende jornalizar apenas [.filename]#/usr#) ou 2 GB (se você pretende jornalizar tanto [.filename]#/usr# quanto [.filename]#/var#). No pop-up que aparece, opte por criar um sistema de arquivos e digite [.filename]#/usr# como ponto de montagem.

source: Should you journal the [.filename]#/var# partition? Normally, journaling makes sense on quite large partitions. You may decide not to journal [.filename]#/var#, although doing so on a typical desktop will cause no harm. If the file system is lightly used (quite probable for a desktop) you may wish to allocate less disk space for its journal.
es: ¿Deberías añadir journaling a la partición [.filename]#/var#? Normalmente, el journaling tiene sentido en particiones que sean bastante grandes. Puedes decidir no añadir journaling a [.filename]#/var#, hacerlo en un ordenador de escritorio no causará ningun daño. Si no se hace un uso intensivo del sistema de archivos (bastante probable para un ordenador de escritorio), es posible que prefieras asignar menos espacio en disco al journaling.
pt_br: Você deve jornalizar a partição [.filename]#/var#? Normalmente, o journaling faz sentido em partições bastante grandes. Você pode optar por não jornalizar [.filename]#/var#, embora fazê-lo em um desktop típico não cause problemas. Se o sistema de arquivos tiver um uso leve (o que é bastante provável para um desktop), você pode desejar alocar menos espaço em disco para o seu journal.

source: In our example, we journal both [.filename]#/usr# and [.filename]#/var#. You may of course adjust the procedure to your own needs.
es: En nuestro ejemplo, utilizamos journaling tanto en [.filename]#/usr# como en [.filename]#/var#. Por supuesto puedes ajustar este procedimiento según tus propias necesidades.
pt_br: No nosso exemplo, nós aplicamos o journaling nas partições [.filename]#/usr# e [.filename]#/var#. Você pode, é claro, ajustar o procedimento de acordo com suas próprias necessidades.

source: To keep things as easy going as possible, we are going to use sysinstall to create the partitions required for journaling. However, during installation, sysinstall insists on asking a mount point for each partition you create. At this point, you do not have any mount points for the partitions that will hold the journals, and in reality you __do not even need them__. These are not partitions that we are ever going to mount somewhere.
es: Para mantener las cosas lo más sencillas posible, vamos a utilizar sysinstall para crear las particiones necesarias para el journaling. Sin embargo, durante la instalación, sysinstall insiste en pedirte un punto de montaje para cada partición que crees. En este punto, no tienes ningún punto de montaje para las particiones que mantendrán el journal, y en realidad, __ni siquiera las necesitas__. Estas particiones nunca van a ser montadas.
pt_br: Para facilitar o processo o máximo possível, vamos usar o sysinstall para criar as partições necessárias para o journaling. No entanto, durante a instalação, o sysinstall insiste em solicitar um ponto de montagem para cada partição que você cria. Neste momento, você não possui nenhum ponto de montagem para as partições que irão armazenar os journals e, na realidade, você nem mesmo precisa deles. Essas não são partições que serão montadas em algum lugar.

source: To avoid these problems with sysinstall, we are going to create the journal partitions as swap space. Swap is never mounted, and sysinstall has no problem creating as many swap partitions as needed. After the first reboot, [.filename]#/etc/fstab# will have to be edited, and the extra swap space entries removed.
es: Para evitar estos problemas con sysinstall, vamos a crear las particiones de journal como particiones swap. La partición swap no se monta nunca, y sysinstall no tiene problemas para crear tantas particiones swap como sea necesario. Después del primer reinicio, será necesario editar el archivo [.filename]#/etc/fstab#, y eliminar las entradas swap.
pt_br: Para evitar esses problemas com o sysinstall, vamos criar as partições de journal como espaço de swap. O swap nunca é montado, e o sysinstall não tem problemas em criar quantas partições de swap forem necessárias. Após o primeiro reinício, será necessário editar o arquivo [.filename]#/etc/fstab# e remover as entradas de espaço de swap adicionais.

source: To create the swap, again use the arrow keys to move the highlight to the top of Disklabel screen, so that the disk name itself is highlighted. Then press kbd:[N], enter the desired size (_1024M_), and select "swap space" from the pop-up menu that appears. Repeat for every journal you wish to create. In our example, we create two partitions to provide for the journals of [.filename]#/usr# and [.filename]#/var#. The final result is shown in the following screenshot:
es: Para crear la partición swap, utiliza de nuevo las teclas de flechas para resaltar la parte superior de la pantalla de Disklabel, de forma que el nombre del disco en sí esté resaltado. Después presiona kbd:[N], introduce el tamaño deseado (_1024M_) y selecciona "swap space" en el menú pop-up que aparecerá. Repite para cada journal que quieras crear. En nuestro ejemplo, creamos dos particiones para proporcionar el journal de [.filename]#/usr# y [.filename]#/var#. El resultado final se muestra en la siguiente captura de pantalla:
pt_br: Para criar a partição de swap, novamente use as teclas de seta para mover o destaque para o topo da tela do Disklabel, de modo que o próprio nome do disco seja destacado. Em seguida, pressione kbd:[N], insira o tamanho desejado (_1024M_) e selecione "swap space" no menu pop-up que aparece. Repita esse processo para cada journal que você deseja criar. No nosso exemplo, criaremos duas partições para fornecer os journals de [.filename]#/usr# e [.filename]#/var#. O resultado final é mostrado na captura de tela a seguir:

source: When you have completed creating the partitions, we suggest you write down the partition names, and mount points, so you can easily refer to this information during the configuration phase. This will help alleviate mistakes that may damage your installation. The following table shows our notes for the sample configuration:
es: Cuando hayas terminado de crear las particiones, te sugerimos que anotes los nombres de las particiones y los puntos de montaje para que puedas consultar fácilmente esa información durante la fase de configuración. Esto ayudará a reducir los errores que puedan dañar tu instalación. La siguiente tabla muestra nuestras notas para la configuración de ejemplo:
pt_br: Quando você tiver concluído a criação das partições, sugerimos que anote os nomes das partições e os pontos de montagem para que você possa se referir facilmente a essas informações durante a fase de configuração. Isso ajudará a evitar erros que possam danificar sua instalação. A tabela a seguir mostra nossas anotações para a configuração de exemplo:

source: Partitions and Journals
es: Particiones y journals
pt_br: Partições e Journals

source: Partition
es: Partición
pt_br: Partição

source: Mount Point
es: Punto de Montaje
pt_br: Ponto de Montagem

source: Continue the installation as you would normally do. We would however suggest you postpone installation of third party software (packages) until you have completely setup journaling.
es: Continua con la instalación como lo harías normalmente. Sin embargo, te sugerimos que pospongas la instalación de software (packages) de terceros hasta que hayas configurado completamente el journaling.
pt_br: Continue a instalação como você normalmente faria. No entanto, sugerimos que você adie a instalação de softwares de terceiros (pacotes) até ter configurado completamente o journaling.

source: Booting for the first time
es: Arrancando por primera vez
pt_br: Inicializando pela primeira vez

source: Your system will come up normally, but you will need to edit [.filename]#/etc/fstab# and remove the extra swap partitions you created for the journals. Normally, the swap partition you will actually use is the one with the "b" suffix (i.e. ad0s1b in our example). Remove all other swap space entries and reboot so that FreeBSD will stop using them.
es: Tu sistema se iniciará como lo haría normalmente, pero deberás editar el archivo [.filename]#/etc/fstab# para eliminar las particiones swap que creaste para los journals. Normalmente, la partición swap que usarás es la que tiene el sufijo "b" (por ejemplo, ad0s1b en nuestro ejemplo). Elimina el reto de particiones swap y reinicia para que FreeBSD deje de utilizarlas.
pt_br: Seu sistema inicializará normalmente, mas você precisará editar o arquivo [.filename]#/etc/fstab# e remover as partições de swap extras que você criou para os journals. Normalmente, a partição de swap que você realmente usará é aquela com o sufixo "b" (por exemplo, ad0s1b em nosso exemplo). Remova todas as outras entradas de espaço de swap e reinicie para que o FreeBSD deixe de usá-las.

source: When the system comes up again, we will be ready to configure journaling.
es: Cuando el sistema vuelva a arrancar, entonces estaremos listos para configurar el journaling.
pt_br: Quando o sistema voltar a funcionar, estaremos prontos para configurar o journaling.

source: Setting Up Journaling
es: Configurando el journaling
pt_br: Configurando o journaling

source: Executing `gjournal`
es: Ejecutando `gjournal`
pt_br: Executando o comando `gjournal`

source: Having prepared all the required partitions, it is quite easy to configure journaling. We will need to switch to single user mode, so login as `root` and type:
es: Habiendo preparado ya las particiones necesarias, es bastante sencillo configurar el journaling. Necesitaremos cambiar al modo de usuario único así que haz login como `root` y teclea:
pt_br: Depois de preparar todas as partições necessárias, é bastante fácil configurar o journaling. Será necessário mudar para o modo de usuário único (single user mode). Para isso, faça o login como `root` e digite o seguinte comando:

source: Press kbd:[Enter] to get the default shell. We will need to unmount the partitions that will be journaled, in our example [.filename]#/usr# and [.filename]#/var#:
es: Presiona kbd:[Enter] para obtener el shell por defecto. Necesitaremos desmontar las particiones a las que aplicaremos journaling, en nuestro ejemplo [.filename]#/usr# y [.filename]#/var#:
pt_br: Pressione kbd:[Enter] para obter o shell padrão. Agora, você precisará desmontar as partições que serão jornalizadas, no nosso exemplo [.filename]#/usr# e [.filename]#/var#:

source: Load the module required for journaling:
es: Cargue el módulo requerido por el journaling:
pt_br: Carregue o módulo necessário para o journaling:

source: Now, use your notes to determine which partition will be used for each journal. In our example, [.filename]#/usr# is [.filename]#ad0s1f# and its journal will be [.filename]#ad0s1g#, while [.filename]#/var# is [.filename]#ad0s1d# and will be journaled to [.filename]#ad0s1h#. The following commands are required:
es: Ahora, utiliza tus notas para determinar qué partición se utilizará con cada journal. En nuestro ejemplo, [.filename]#/usr# es [.filename]#ad0s1f# y su journal será [.filename]#ad0s1g#, mientras que [.filename]#/var# es [.filename]#ad0s1d# y utilizará el journal en [.filename]#ad0s1h#. Se necesitarán los siguientes comandos:
pt_br: Agora, use suas anotações para determinar qual partição será usada para cada journal. No nosso exemplo, [.filename]#/usr# é [.filename]#ad0s1f# e seu journal será [.filename]#ad0s1g#, enquanto [.filename]#/var# é [.filename]#ad0s1d# e será jornalizada em [.filename]#ad0s1h#. Os seguintes comandos são necessários:

source: If the last sector of either partition is used, `gjournal` will return an error. You will have to run the command using the `-f` flag to force an overwrite, i.e.:
es: Si se utiliza el último sector de cualquier partición, `gjournal` devolverá un error. Tendrás que ejecutar el comando utilizando el flag `-f` para forzar una sobrescritura, es decir:
pt_br: Se o último setor de qualquer uma das partições estiver em uso, o `gjournal` retornará um erro. Nesse caso, você precisará executar o comando usando a opção `-f` para forçar a sobrescrita. Por exemplo:

source: Since this is a new installation, it is highly unlikely that anything will be actually overwritten.
es: Dado que se trata de una instalación nueva, es poco probable que se sobrescriba algo.
pt_br: Como esta é uma nova instalação, é altamente improvável que qualquer coisa seja realmente sobrescrita.

source: At this point, two new devices are created, namely [.filename]#ad0s1d.journal# and [.filename]#ad0s1f.journal#. These represent the [.filename]#/var# and [.filename]#/usr# partitions we have to mount. Before mounting, we must however set the journal flag on them and clear the Soft Updates flag:
es: En este punto, se crean dos nuevos dispositivos, con los nombres [.filename]#ad0s1d.journal# y [.filename]#ad0s1f.journal#. Estos representan las particiones [.filename]#/var# y [.filename]#/usr# que tenemos que montar. Antes de realizar el montaje, debemos establecer la flag de journal y borrar la flag de Soft Updates:
pt_br: Neste ponto, dois novos dispositivos são criados, chamados [.filename]#ad0s1d.journal# e [.filename]#ad0s1f.journal#. Eles representam as partições [.filename]#/var# e [.filename]#/usr# que devemos montar. No entanto, antes de montá-los, precisamos definir a flag de journaling neles e desativar a flag de Soft Updates:

source: Now, mount the new devices manually at their respective places (note that we can now use the `async` mount option):
es: Ahora, monta los nuevos dispositivos manualmente en sus respectivas ubicaciones (ten en cuenta que ahora podemos usar la opción de montaje `async`):
pt_br: Agora, monte manualmente os novos dispositivos em seus respectivos locais (observe que agora podemos usar a opção de montagem `async`):

source: Edit [.filename]#/etc/fstab# and update the entries for [.filename]#/usr# and [.filename]#/var#:
es: Edita [.filename]#/etc/fstab# y actualiza las entradas para [.filename]#/usr# y [.filename]#/var#:
pt_br: Edite o arquivo [.filename]#/etc/fstab# e atualize as entradas para [.filename]#/usr# e [.filename]#/var#:

source: Make sure the above entries are correct, or you will have trouble starting up normally after you reboot!
es: ¡Asegúrate de que las entradas anteriores sean correctas, o tendrás problemas para arrancar después de reiniciar!
pt_br: Certifique-se de que as entradas acima estão corretas ou você terá problemas para inicializar normalmente após o reboot!

source: Finally, edit [.filename]#/boot/loader.conf# and add the following line so the man:gjournal[8] module is loaded at every boot:
es: Por último, edita [.filename]#/boot/loader.conf# y añade la siguiente línea para que el módulo man:gjournal[8] se cargue en cada arranque:
pt_br: Por fim, edite o arquivo [.filename]#/boot/loader.conf# e adicione a seguinte linha para carregar o módulo man:gjournal[8] em cada inicialização do sistema:

source: Congratulations! Your system is now set for journaling. You can either type `exit` to return to multi-user mode, or reboot to test your configuration (recommended). During the boot you will see messages like the following:
es: ¡Felicidades! Tu sistema ahora está configurado para utilizar el journaling. Puedes escribir `exit` para volver al modo multiusuario o reiniciar para probar su configuración (recomendado). Durante el arranque verás mensajes como los siguientes:
pt_br: Parabéns! Seu sistema está agora configurado para o journaling. Você pode digitar `exit` para retornar ao modo multiusuário ou reiniciar para testar sua configuração (recomendado). Durante a inicialização, você verá mensagens como as seguintes:

source: After an unclean shutdown, the messages will vary slightly, i.e.:
es: Después de un apagado forzoso, el mensaje variará ligeramente, por ejemplo:
pt_br: Após um encerramento não limpo, as mensagens variam ligeiramente, ou seja:

source: This usually means that man:gjournal[8] used the information in the journal provider to return the file system to a consistent state.
es: Normalmente esto significa que man:gjournal[8] ha utilizado la información del journal provider para devolver al sistema de ficheros a un estado consistente.
pt_br: Isso geralmente significa que o man:gjournal[8] utilizou as informações no journal provider para restaurar o sistema de arquivos a um estado consistente.

source: Journaling Newly Created Partitions
es: Añadiendo journaling a las nuevas particiones
pt_br: Fazendo journaling de partições recém-criadas

source: While the above procedure is necessary for journaling partitions that already contain data, journaling an empty partition is somewhat easier, since both the data and the journal provider can be stored in the same partition. For example, assume a new disk was installed, and a new partition [.filename]#/dev/ad1s1d# was created. Creating the journal would be as simple as:
es: Si bien el procedimiento anterior es necesario para las particiones con journaling que ya contengan datos, añadir journaling a una partición vacía es un poco más sencillo, ya que tanto los datos como el provider se pueden almacenar en la misma partición. Por ejemplo, supongamos que has instalado un nuevo disco, y que has creado una nueva partición, [.filename]#/dev/ad1s1d# . Crear el journal sería tan simple como:
pt_br: Enquanto o procedimento acima é necessário para jornalizar partições que já contêm dados, jornalizar uma partição vazia é um pouco mais fácil, pois tanto o provedor de dados quanto o provedor de journal podem ser armazenados na mesma partição. Por exemplo, suponha que um novo disco tenha sido instalado e uma nova partição [.filename]#/dev/ad1s1d# tenha sido criada. Criar o journal seria tão simples quanto:

source: The journal size will be 1 GB by default. You may adjust it by using the `-s` option. The value can be given in bytes, or appended by `K`, `M` or `G` to denote Kilobytes, Megabytes or Gigabytes respectively. Note that `gjournal` will not allow you to create unsuitably small journal sizes.
es: El tamaño por defecto del journal será de 1 GB. Puedes ajustarlo utilizando la opción `-s`. El valor se puede introducir en bytes o añadiéndole `K`, `M` or `G` para representar Kilobytes, Megabytes o Gigabytes respectivamente. Date cuenta de que `gjournal` no te permitirá crear tamaños de journal que no sean apropiados por ser demasiado pequeños.
pt_br: O tamanho do journal será de 1 GB por padrão. Você pode ajustá-lo usando a opção `-s`. O valor pode ser dado em bytes, ou pode ser seguido por `K`, `M` ou `G` para representar Kilobytes, Megabytes ou Gigabytes, respectivamente. Note que o `gjournal` não permitirá que você crie tamanhos de journal excessivamente pequenos e inadequados.

source: For example, to create a 2 GB journal, you could use the following command:
es: Por ejemplo, para crear un journal de 2 GB, puede usar el siguiente comando:
pt_br: Por exemplo, para criar um journal de 2 GB, você poderia usar o seguinte comando:

source: You can then create a file system on your new partition, and enable journaling using the `-J` option:
es: Puedes crear un sistema de archivos en tu nueva partición y habilitar el journaling utilizando la opción `-J`:
pt_br: Em seguida, você pode criar um sistema de arquivos na sua nova partição e habilitar o journaling usando a opção `-J`:

source: Building Journaling into Your Custom Kernel
es: Añadiendo soporte de journaling en un kernel personalizado
pt_br: Adicionando suporte ao journaling no seu kernel personalizado

source: If you do not wish to load `geom_journal` as a module, you can build its functions right into your kernel. Edit your custom kernel configuration file, and make sure it includes these two lines:
es: Si no deseas cargar `geom_journal` como un módulo, puedes añadir la funcionalidad directamente a tu kernel. Edita el archivo de configuración del kernel personalizado y asegúrate de que incluyes estas dos líneas:
pt_br: Se você não deseja carregar `geom_journal` como um módulo, você pode incorporar suas funções diretamente no seu kernel. Edite o arquivo de configuração do seu kernel personalizado e verifique se ele inclui as seguintes linhas:

source: Rebuild and reinstall your kernel following the relevant extref:{handbook}[instructions in the FreeBSD Handbook., kernelconfig]
es: Recompila e instala tu kernel siguiendo las instrucciones de extref:{handbook}[instructions in the FreeBSD Handbook., kernelconfig]
pt_br: Recompile e reinstale o seu kernel seguindo as instruções relevantes no Handbook do FreeBSD

source: Do not forget to remove the relevant "load" entry from [.filename]#/boot/loader.conf# if you have previously used it.
es: No te olvides de eliminar la entrada "load" apropiada de [.filename]#/boot/loader.conf# si es que la has usado anteriormente.
pt_br: Não se esqueça de remover a entrada relevante de "load" do arquivo [.filename]#/boot/loader.conf# se você a tiver usado anteriormente.

source: Troubleshooting Journaling
es: Resolución de problemas del journaling
pt_br: Solução de problemas com journaling

source: The following section covers frequently asked questions regarding problems related to journaling.
es: En la siguiente sección se analizan las preguntas más frecuentes relacionadas con los problemas relacionados con el journaling.
pt_br: A seção a seguir aborda as perguntas mais frequentes relacionadas a problemas relacionados ao journaling.

source: I am getting kernel panics during periods of high disk activity. How is this related to journaling?
es: Durante los periodos de mucha actividad en el disco estoy teniendo un kernel panic. ¿Está relacionado con el journaling?
pt_br: Estou recebendo um kernel panic durante períodos de alta atividade de disco. Como isso está relacionado ao journaling?
