<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content="HTML Tidy, see www.w3.org" />
<title>FreeBSD/sparc64 5.2-RELEASE Installationsanleitung</title>
<meta name="GENERATOR" content="Modular DocBook HTML Stylesheet Version 1.7" />
<link rel="STYLESHEET" type="text/css" href="docbook.css" />
</head>
<body class="ARTICLE" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#840084"
alink="#0000FF">
<div class="ARTICLE">
<div class="TITLEPAGE">
<h1 class="TITLE"><a id="AEN2" name="AEN2">FreeBSD/sparc64 5.2-RELEASE
Installationsanleitung</a></h1>

<h3 class="CORPAUTHOR">The FreeBSD Project</h3>

<p class="COPYRIGHT">Copyright &copy; 2000, 2001, 2002, 2003 The FreeBSD Documentation
Project</p>

<p class="COPYRIGHT">Copyright &copy; 2002, 2003 The FreeBSD German Documentation
Project</p>

<hr />
</div>

<blockquote class="ABSTRACT">
<div class="ABSTRACT"><a id="AEN15" name="AEN15"></a>
<p>Dieser Artikel enth&auml;lt eine kurze Anleitung f&uuml;r die Installation von
FreeBSD/sparc64 5.2-RELEASE, dabei wird besonderen Wert auf den Bezug einer FreeBSD
gelegt. Au&szlig;erdem enth&auml;lt er einige Tips zur Fehlersuche sowie Antworten zu
einigen h&auml;ufig gestellten Fragen.</p>
</div>
</blockquote>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="INSTALL" name="INSTALL">1. Wie installiere ich FreeBSD</a></h2>

<p>In diesem Kapitel erfahren Sie, wie Sie FreeBSD installieren. Der Schwerpunkt liegt
dabei auf dem Bezug der FreeBSD 5.2-RELEASE Distribution und dem Start der Installation.
Im Kapitel <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/install.html"
target="_top">``Installing FreeBSD''</a> des <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/" target="_top">FreeBSD
Handbuch</a> finden Sie genauere Informationen &uuml;ber das Installationsprogramm,
einschlie&szlig;lich einer ausf&uuml;hrlichen, bebilderten Installationsleitung.</p>

<p>Wenn Sie eine &auml;ltere Version von FreeBSD aktualisieren wollen, sollten Sie <a
href="#UPGRADING">Abschnitt 3</a>, Aktualisierung von FreeBSD, lesen.</p>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="GETTING-STARTED" name="GETTING-STARTED">1.1. Der
Einstieg</a></h3>

<p>Bevor Sie mit der Installation beginnen, sollten Sie auf jeden Fall alle Anleitungen,
die Sie zusammen mit FreeBSD erhalten haben. Eine &Uuml;bersicht der zu dieser
FreeBSD-Version geh&ouml;renden Dokumente finden Sie in <tt
class="FILENAME">README.TXT</tt>, die sich normalerweise an der gleichen Stelle wie diese
Datei befindet. Die meisten der dort erw&auml;hnten Dokumente, wie die Release Notes und
Liste der unterst&uuml;tzten Ger&auml;te, stehen auch im Men&uuml; Dokumentation des
Installationsprogramms zur Verf&uuml;gung.</p>

<p>Die elektronischen Versionen des FreeBSD <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/faq/" target="_top">FAQ</a> und
des <a href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/"
target="_top">Handbuchs</a> sind auch auf der <a href="http://www.FreeBSD.org/"
target="_top">FreeBSD Project Web site</a> erh&auml;ltlich, wenn Sie einen
Internet-Zugang haben.</p>

<p>Der Umfang der Dokumentation schreckt zwar im ersten Moment etwas ab, aber die Zeit,
die Sie f&uuml;r die Lekt&uuml;re brauchen, wird sich lohnen. Au&szlig;erdem ist es
vorteilhaft, die zur Verf&uuml;gung stehenden Ressourcen zu kennen, wenn w&auml;hrend der
Installation ein Problem auftreten sollte.</p>

<p>Irgend etwas kann immer schiefgehen und wenn Ihnen das passiert, sollten Sie einen
Blick in <a href="#TROUBLE">Abschnitt 4</a> werfen, wo Sie hilfreiche Informationen
finden k&ouml;nnen. Sie sollten ebenfalls einen Blick auf die aktuelle Version von <tt
class="FILENAME">ERRATA.TXT</tt> werfen, bevor Sie mit der Installation beginnen, da Sie
dort Informationen &uuml;ber alle die Probleme finden, die seit der Ver&ouml;ffentlichung
gefunden wurden.</p>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Das Installationsprogramm f&uuml;r FreeBSD tut sein m&ouml;glichstes,
um Sie vor Datenverlusten zu bewahren, trotzdem ist es denkbar, da&szlig; Sie Ihre <span
class="emphasis"><i class="EMPHASIS">gesamte Festplatte l&ouml;schen</i></span>, wenn Sie
einen Fehler machen. Stellen Sie sicher, da&szlig; Sie ein brauchbares Backup haben,
bevor Sie die Installation durchf&uuml;hren.</p>
</blockquote>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN40" name="AEN40">1.2. Hardware-Anforderungen</a></h3>

<p>FreeBSD f&uuml;r UltraSPARC unterst&uuml;tzt die in <tt
class="FILENAME">HARDWARE.TXT</tt> genannten Systeme.</p>

<p>Sie ben&ouml;tigen auf jeden Fall eine eigene Festplatte f&uuml;r FreeBSD/sparc64. Zum
jetzigen Zeitpunkt ist es nicht m&ouml;glich, eine Festplatte mit einem anderen
Betriebssystem zu teilen.</p>

<p>Wenn Sie noch nie Ger&auml;te f&uuml;r FreeBSD konfiguriert haben, sollten Sie auf
jeden Fall einen Blick in die Datei <tt class="FILENAME">HARDWARE.TXT</tt> werfen, hier
finden Sie Informationen, welche Ger&auml;te von FreeBSD unterst&uuml;tzt werden.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="FLOPPIES" name="FLOPPIES">1.3. Erzeugung der
Bootdisketten</a></h3>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="START-INSTALLATION" name="START-INSTALLATION">1.4.
FreeBSD-Installation von CD oder via Internet</a></h3>

<p>Die meisten sparc64 Systeme booten automatisch von Festplatte. Wenn Sie FreeBSD
installieren wollen, m&uuml;ssen Sie den Startvorgang abbrechen, um zur OpenBoot
Eingabeaufforderung zu gelangen.</p>

<p>Dazu m&uuml;ssen Sie das System und auf die Boot-Meldung warten. Diese ist zwar
modellabh&auml;ngig, sollte aber wie folgt aussehen:</p>

<pre class="SCREEN">
Sun Blade 100 (UltraSPARC-IIe), Keyboard Present
Copyright 1998-2001 Sun Microsystems, Inc.  All rights reserved.
OpenBoot 4.2, 128 MB memory installed, Serial #51090132.
Ethernet address 0:3:ba:b:92:d4, Host ID:  830b92d4.
</pre>

<p>Wenn Ihr System jetzt von Festplatte startet, m&uuml;ssen Sie die Tastenkombination <b
class="KEYCAP">L1</b>+<b class="KEYCAP">A</b> oder <b class="KEYCAP">Stop</b>+<b
class="KEYCAP">A</b> dr&uuml;cken. Wenn Sie eine serielle Konsole verwenden, m&uuml;ssen
Sie ein <tt class="COMMAND">BREAK</tt> senden (z.B. durch die Eingabe von <tt
class="COMMAND">~#</tt> in <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=tip&sektion=1&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">tip</span>(1)</span></a> oder <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=cu&sektion=1&manpath=FreeBSD+5.2-RELEASE"><span
 class="CITEREFENTRY"><span class="REFENTRYTITLE">cu</span>(1)</span></a>). Danach
sollten Sie die Eingabeaufforderung von OpenBoot sehen, die wie folgt aussieht:</p>

<pre class="SCREEN">
<samp class="PROMPT">ok</samp>     <a id="PROMPT-SINGLE"
name="PROMPT-SINGLE"><b>(1)</b></a>
<samp class="PROMPT">ok {0}</samp>     <a id="PROMPT-SMP"
name="PROMPT-SMP"><b>(2)</b></a>
</pre>

<div class="CALLOUTLIST">
<dl compact="COMPACT">
<dt><a href="#PROMPT-SINGLE"><b>(1)</b></a></dt>

<dd>Diese Variante wird auf Systemen mit nur einer CPU benutzt.</dd>

<dt><a href="#PROMPT-SMP"><b>(2)</b></a></dt>

<dd>Diese Varianten wird von SMP Systemen benutzt, die Zahl ist die Nummer der aktiven
CPU.</dd>
</dl>
</div>

<p>Legen Sie die CD ein, und geben Sie jetzt an der Eingabeaufforderung von OpenBoot <tt
class="COMMAND">boot cdrom</tt> ein.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN214" name="AEN214">1.5. Details zu den
Installationsarten</a></h3>

<p>Wenn Sie die erste Meldung des Installationsprogramms vor sich haben, k&ouml;nnen Sie
sich einfach die diversen Men&uuml;s ansehen und Ihren eigenen Weg finden. Wenn Sie
FreeBSD noch nie installiert haben, sollten Sie auf jeden Fall einen Blick in die Texte
werfen, die im Submen&uuml; Dokumentation zur Verf&uuml;gung stehen. Das gleiche gilt
f&uuml;r die allgemeinen Informationen, die im Hauptmen&uuml; unter ``Usage'' zu finden
sind.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Wenn Sie ein Problem haben, dr&uuml;cken Sie einfach <b
class="KEYCAP">F1</b>, um sich die Onlinehilfe f&uuml;r die jeweilige Situation
anzusehen.</p>
</blockquote>
</div>

<p>Unabh&auml;ngig davon, ob Sie schon einmal FreeBSD installiert haben, empfehlen wir
Ihnen die Benutzung der ``Standard'' Installation. Damit ist sichergestellt, da&szlig;
Sie alle wichtigen Einstellungen treffen k&ouml;nnen und nichts vergessen. Wenn Sie schon
mehr Erfahrung mit der Installation von FreeBSD haben und <span class="emphasis"><i
class="EMPHASIS">genau</i></span> wissen, was Sie tun, k&ouml;nnen Sie auch die
Men&uuml;punkte ``Express'' oder ``Custom'' w&auml;hlen. Wenn Sie ein bestehendes System
aktualisieren wollen, sollten Sie den Men&uuml;punkt ``Upgrade'' nutzen.</p>

<p>Das Installationsprogramm von FreeBSD unterst&uuml;tzt die folgenden
Installationsmedien: Disketten, DOS-Partitionen, Bandlaufwerke, CDROM, FTP, NFS und UFS
Partitionen. In den n&auml;chsten Kapiteln finden Sie Informationen, was Sie bei der
Installation von diesen Medien beachten m&uuml;ssen.</p>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN253" name="AEN253">1.5.1. Installation von einem CDROM im
Netzwerk</a></h4>

<p>Wenn Sie von einem lokalen CDROM installieren wollen, sollten Sie nicht dieses Kapitel
lesen, sondern <a href="#START-INSTALLATION">Abschnitt 1.4</a>. Wenn in Ihrem System kein
CDROM vorhanden ist und Sie eine FreeBSD CD benutzen wollen, die in einem CDROM Laufwerk
eines anderen Systems liegt und Sie dieses System &uuml;ber ein Netzwerk erreichen
k&ouml;nnen, dann gibt es mehrere M&ouml;glichkeiten:</p>

<ul>
<li>
<p>Wenn Sie bei der Installation von FreeBSD die Daten direkt per FTP vom CDROM eines
anderen FreeBSD Systems beziehen wollen, ist das sehr einfach: Benutzen Sie <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=vipw&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">vipw</span>(8)</span></a>, um die
folgende Zeile in die Pa&szlig;wortdatei des anderen Systems einzuf&uuml;gen:</p>

<pre class="SCREEN">
ftp:*:99:99::0:0:FTP:/cdrom:/sbin/nologin
</pre>

<p>Auf der Maschine, auf der das Installationsprogramm l&auml;uft, wechseln Sie in das
Men&uuml; Options, um die Einstellung Release Name auf den Wert <var
class="LITERAL">any</var> zu &auml;ndern. Danach k&ouml;nnen Sie <var
class="LITERAL">Media Type</var> auf den Wert <var class="LITERAL">FTP</var> setzen. In
der Auswahl der FTP-Server w&auml;hlen Sie den Punkt ``URL'' und geben als Wert <tt
class="FILENAME">ftp://<var class="REPLACEABLE">machine</var></tt> an.</p>

<div class="WARNING">
<blockquote class="WARNING">
<p><b>Warnung:</b> Durch diese &Auml;nderung kann jedes System im lokalen Netzwerk oder
sogar im Internet eine ``anonymous FTP'' Verbindung zu dem System mit dem CDROM aufbauen,
was nicht unbedingt erw&uuml;nscht ist.</p>
</blockquote>
</div>
</li>

<li>
<p>Alternativ k&ouml;nnen Sie NFS benutzen, um den Inhalt des CDROM direkt f&uuml;r die
Maschine, auf der Sie installieren wollen, zu exportieren. Dazu mu&szlig; auf dem System
mit dem CDROM die Datei <tt class="FILENAME">/etc/exports</tt> um einen Eintrag erweitert
werden. Dieser Eintrag erlaubt zum Beispiel der Maschine <tt
class="HOSTID">ziggy.foo.com</tt>, das CDROM w&auml;hrend der Installation direkt per NFS
zu mounten:</p>

<pre class="SCREEN">
/cdrom          -ro             ziggy.foo.com
</pre>

<p>Das System mit dem CDROM mu&szlig; nat&uuml;rlich als NFS Server konfiguriert sein.
Wenn Sie nicht wissen, wie man das System so konfiguriert, sollten Sie vielleicht eine
andere Variante benutzen, falls Sie nicht bereit sind, die Onlinehilfe zu <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=rc.conf&sektion=5&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">rc.conf</span>(5)</span></a> zu
lesen und das System entsprechend zu konfigurieren. Wenn das gelingt, sollten Sie in der
Lage sein, <tt class="FILENAME"><var class="REPLACEABLE">cdrom-system</var>:/cdrom</tt>
als Pfad f&uuml;r die NFS Installation anzugeben, also z.B. <tt
class="FILENAME">wiggy:/cdrom</tt>.</p>
</li>
</ul>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN286" name="AEN286">1.5.2. Installation von Disketten</a></h4>

<p>Wenn Sie wirklich von Diskette installieren wollen, weil Ihre Hardware nicht
unterst&uuml;tzt wird oder Sie es vorziehen, Dinge auf die harte Tour zu erledigen,
m&uuml;ssen Sie zun&auml;chst einmal die Disketten f&uuml;r die Installation
vorbereiten.</p>

<p>Der erste Schritt ist die Erstellung der Bootdisketten, wie in <a
href="#FLOPPIES">Abschnitt 1.3</a> beschrieben.</p>

<p>Der zweite Schritt ist, einen Blick in <a href="#LAYOUT">Abschnitt 2</a> zu werfen.
Das Kapitel ``Distribution Format'' ist besonders wichtig, da Sie hier erfahren, welche
Dateien Sie auf Diskette &uuml;bertragen m&uuml;ssen und welche Sie ignorieren
k&ouml;nnen.</p>

<p>Danach brauchen Sie so mindestens so viele 1.44 MByte Disketten, da&szlig; Sie alle
Dateien im Verzeichnis <tt class="FILENAME">bin</tt> (binary distribution) auf Disketten
unterbringen k&ouml;nnen. Wenn Sie Disketten mit DOS vorbereiten, <span
class="emphasis"><i class="EMPHASIS">m&uuml;ssen</i></span> Sie sie mit dem MS-DOS Befehl
<tt class="FILENAME">FORMAT</tt> formatieren. Wenn Sie Windows benutzen, benutzen Sie die
Option Formatieren des Dateimanagers.</p>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Neue Disketten sind in der Regel ``vorformatiert''. Das ist zwar eine
sehr angenehme Variante, allerdings haben uns viele Anwender von F&auml;llen berichtet,
in denen es Probleme mit diesen vorformatierten Disketten gab. Im Zweifelsfalle sollten
Sie auch diese Disketten selbst formatieren, um wirklich sicher zu gehen.</p>
</blockquote>
</div>

<p>Wenn Sie die Disketten auf einem anderen FreeBSD System erzeugen, kann eine
Formatierung nicht schaden, obwohl die Disketten kein DOS-Dateisystem enthalten
m&uuml;ssen. Sie k&ouml;nnen die Programme <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=disklabel&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">disklabel</span>(8)</span></a> und
<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=newfs&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">newfs</span>(8)</span></a>
benutzen, um auf den Disketten ein UFS Dateisystem anzulegen. Dazu sind die folgenden
Befehle notwendig:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">fdformat -f 1440 fd0.1440</kbd>
<samp class="PROMPT">#</samp> <kbd
class="USERINPUT">disklabel -w -r fd0.1440 floppy3</kbd>
<samp class="PROMPT">#</samp> <kbd
class="USERINPUT">newfs -t 2 -u 18 -l 1 -i 65536 /dev/fd0</kbd>
</pre>

<p>Nachdem Sie die Disketten formatiert haben, m&uuml;ssen Sie die Dateien auf die
Disketten kopieren. Die Dateien der einzelnen Distributionen sind so aufgeteilt worden,
da&szlig; f&uuml;nf von Ihnen auf eine normale 1.44 MByte Diskette passen. Nehmen Sie
sich ihren Diskettenstapel, kopieren Sie so viele Dateien wie m&ouml;glich auf jede
Diskette, bis Sie alle gew&uuml;nschten Distributionen auf die Disketten verteilt haben.
Dabei sollten jede Distribution in ein eigenes Verzeichnis auf der Diskette haben, also
z.B. <tt class="FILENAME">a:\bin\bin.inf</tt>, <tt class="FILENAME">a:\bin\bin.aa</tt>,
<tt class="FILENAME">a:\bin\bin.ab</tt>, ...</p>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Die Datei <tt class="FILENAME">bin.inf</tt> mu&szlig; auf der ersten
Diskette des <tt class="FILENAME">bin</tt> Satzes liegen, da das Installationsprogramm
sie auswertet, um die Anzahl der Dateien f&uuml;r diese Distribution zu erfahren. Wenn
Sie andere Distributionen auf Diskette kopieren, <span class="emphasis"><i
class="EMPHASIS">mu&szlig;</i></span> die Datei <tt class="FILENAME">distname.inf</tt>
immer auf der ersten Diskette des jeweiligen Diskettensatzes liegen. Dies wird auch in
<tt class="FILENAME">README.TXT</tt> erkl&auml;rt.</p>
</blockquote>
</div>

<p>Wenn Sie bei der Installation den Dialog Medien erreicht haben, w&auml;hlen Sie Punkt
``Floppy'' aus und folgen Sie danach den Anweisungen.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN356" name="AEN356">1.5.4. Installation von einem QIC/SCSI
Bandlaufwerk</a></h4>

<p>Wenn Sie vom Band installieren, erwartet das Installationsprogramm, da&szlig; die
Dateien im tar-Format auf dem Band liegen. Um ein solches Band anzulegen, m&uuml;ssen Sie
sich zun&auml;chst alle Dateien f&uuml;r die Distributionen besorgen, die Sie
installieren wollen und sie dann mit <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=tar&sektion=1&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">tar</span>(1)</span></a> auf Band
schreiben, ungef&auml;hr so:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cd <var
class="REPLACEABLE">/where/you/have/your/dists</var></kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">tar cvf /dev/rsa0 <var
class="REPLACEABLE">dist1</var> .. <var class="REPLACEABLE">dist2</var></kbd>
</pre>

<p>Bei der eigentlichen Installation m&uuml;ssen Sie darauf achten, da&szlig; Sie in
einem tempor&auml;ren Verzeichnis (das Sie selbst bestimmen k&ouml;nnen) genug Platz
f&uuml;r den <span class="emphasis"><i class="EMPHASIS">gesamten</i></span> Inhalt des
Bandes lassen. Da man nicht beliebig auf den Inhalt eines Bandes zugreifen kann, braucht
diese Art der Installation eine Menge tempor&auml;ren Speicherplatz. Sie sollten davon
ausgehen, da&szlig; Sie die gleiche Menge tempor&auml;ren Speicherplatz ben&ouml;tigen,
wie Sie vorher auf das Band geschrieben haben.</p>

<div class="NOTE">
<blockquote class="NOTE">
<p><b>Anmerkung:</b> Bei dieser Art der Installation m&uuml;ssen sich das Band im
Laufwerk befinden, <span class="emphasis"><i class="EMPHASIS">bevor</i></span> Sie von
den Disketten booten. Andernfalls kann es sein, da&szlig; die Installation das Laufwerk
nicht ``erkennt''.</p>
</blockquote>
</div>

<p>Der letzte Schritt ist die Erzeugung der Bootdisketten, siehe <a
href="#FLOPPIES">Abschnitt 1.3</a>.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="FTPNFS" name="FTPNFS">1.5.5. Netzwerk-Installation mit FTP oder
NFS</a></h4>

<p>Wenn Sie die Bootdisketten erzeugt haben, wie in <a href="#FLOPPIES">Abschnitt 1.3</a>
beschrieben, k&ouml;nnen Sie die restliche Installation &uuml;ber eine
Netzwerk-Verbindung durchf&uuml;hren, wobei drei Arten von Netzwerkverbindungen
unterst&uuml;tzt werden: seriell, parallel, oder Ethernet.</p>

<div class="SECT4">
<hr />
<h5 class="SECT4"><a id="AEN382" name="AEN382">1.5.5.1. Serielle Schnittstelle</a></h5>

<p>Die Unterst&uuml;tzung f&uuml;r SLIP ist sehr rudiment&auml;r und auf feste
Verbindungen, wie ein Nullmodemkabel zwischen zwei Rechnern, beschr&auml;nkt. Der Grund
f&uuml;r die Einschr&auml;nkung ist, da&szlig; Sie bei SLIP keine W&auml;hlverbindung
aufbauen k&ouml;nnen. Wenn Sie sich einw&auml;hlen m&uuml;ssen oder sonst in irgendeiner
Form die Verbindung aufbauen m&uuml;ssen, sollten Sie PPP verwenden.</p>

<p>Wenn Sie PPP verwenden, m&uuml;ssen Sie die IP-Adresse und die DNS-Informationen
f&uuml;r Ihres Internet-Providers kennen, da Sie diese im ersten Teil des
Installationsvorgangs ben&ouml;tigen. Es kann auch sein, da&szlig; Sie Ihre eigene
IP-Adresse kennen m&uuml;ssen, allerdings unterst&uuml;tzt PPP dynamisch zugewiesene
IP-Adressen und sollte daher in der Lage sein, diese Information selbst herauszufinden,
sofern Ihr Internet-Provider dies unterst&uuml;tzt.</p>

<p>Weiterhin m&uuml;ssen Sie die notwendigen ``AT Befehle'' f&uuml;r die Anwahl kennen,
da sich die Unterst&uuml;tzung f&uuml;r die Anwahl auf eine einfache Terminalemulation
beschr&auml;nkt.</p>
</div>

<div class="SECT4">
<hr />
<h5 class="SECT4"><a id="AEN388" name="AEN388">1.5.5.2. Parallele Schnittstelle</a></h5>

<p>Falls Sie &uuml;ber eine feste Verbindung zu einem anderen FreeBSD oder Linux System
verf&uuml;gen, sollten Sie eine Installation &uuml;ber ein ``Laplink'' Kabel an den
parallelen Schnittstellen in Betracht ziehen. Die &Uuml;bertragungsgeschwindigkeit der
parallelen Schnittstelle liegt deutlich &uuml;ber dem Maximum einer seriellen
Schnittstelle (bis zu 50 KByte/sec), was die Installation deutlich beschleunigt. Im
Normalfall ist es auch nicht notwendig, ``echte'' IP Adressen zu benutzen, wenn Sie eine
Punkt-zu-Punkt Verbindung &uuml;ber ein paralleles Kabel verwenden, verwenden Sie einfach
die in RFC1918 definierten Adre&szlig;bereiche f&uuml;r die beiden Seiten der Verbindung
(z.B. <tt class="HOSTID">10.0.0.1</tt>, <tt class="HOSTID">10.0.0.2</tt>, etc).</p>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Wenn Sie statt einem FreeBSD System einen Linux-Rechner am anderen
Ende der Leitung haben, m&uuml;ssen Sie im Dialog TCP/IP setup im Feld ``extra options
for ifconfig'' den Wert <var class="OPTION">link0</var> angeben, da Linux eine leicht
abweichende Variante des PLIP-Protokolls benutzt.</p>
</blockquote>
</div>
</div>

<div class="SECT4">
<hr />
<h5 class="SECT4"><a id="AEN399" name="AEN399">1.5.5.3. Ethernet</a></h5>

<p>FreeBSD unterst&uuml;tzt viele h&auml;ufig verwendete Netzwerkkarten, eine
&Uuml;bersicht ist Teil der FreeBSD Hardware Notes. Diese finden Sie in der Datei <tt
class="FILENAME">HARDWARE.TXT</tt> im Men&uuml; Dokumentation des Installationsprogramms
und auf der CD. Wenn Sie eine der unterst&uuml;tzten PCMCIA-Netzwerkkarten benutzen,
sollten Sie diese einstecken, <span class="emphasis"><i class="EMPHASIS">bevor</i></span>
Sie den Laptop einschalten. Der Wechsel der Karten im Betrieb wird w&auml;hrend der
Installation leider zur Zeit nicht unterst&uuml;tzt.</p>

<p>Sie m&uuml;ssen Sie den Namen und die IP-Adresse Ihres Systems sowie die <var
class="OPTION">Netzmaske</var> f&uuml;r Ihr Netzwerk kennen. Diese Angaben k&ouml;nnen
Sie von Ihrem Systemadministrator erhalten. Wenn Sie andere System mit deren Namen und
nicht mit ihren IP-Adressen ansprechen wollen, brauchen Sie zus&auml;tzlich die Adresse
eines Nameservers und unter Umst&auml;nden auch die Adresse des Gateways, das Sie
ansprechen m&uuml;ssen, um den Nameserver abzufragen (wenn Sie PPP verwenden, ist das die
IP-Adresse Ihres Internet-Providers). Wenn Sie einen HTTP-Proxy f&uuml;r FTP (Details
dazu finden Sie weiter unten) verwenden wollen, brauchen Sie auch die Adresse des
Proxies.</p>

<p>Wenn Sie die Antworten auf diese Fragen nicht kennen, sollten Sie auf jeden Fall mit
Ihrem Systemadministrator reden, <span class="emphasis"><i
class="EMPHASIS">bevor</i></span> Sie diese Installationsart ausprobieren. Wenn Sie in
einem aktiven Netzwerk einfach irgendeine IP-Adresse oder Netzmaske nutzen, ist ein
Fehlschlag so gut wie sicher; au&szlig;erdem k&ouml;nnen Sie sich schon mal auf einem
Anschi&szlig; durch Ihren Systemadministrator einstellen.</p>

<p>Wenn die Netzwerkverbindung erst einmal steht, k&ouml;nnen Sie die Installation
&uuml;ber NFS oder FTP fortsetzen.</p>
</div>

<div class="SECT4">
<hr />
<h5 class="SECT4"><a id="AEN409" name="AEN409">1.5.5.4. Tips zur Installation &uuml;ber
NFS</a></h5>

<p>Die Installation &uuml;ber NFS ist einfach: Kopieren Sie die Daten aus der FreeBSD
Distribution auf irgendeinen Server und geben Sie diesen als als Installationsmedium
an.</p>

<p>Wenn dieser Server nur Verbindungen von einem ``privileged port'' erlaubt (die
Standardeinstellung f&uuml;r Sun und Linux Workstations), m&uuml;ssen Sie im Men&uuml;
Option diese Einstellung aktivieren, bevor Sie mit der Installation fortfahren.</p>

<p>Wenn Sie eine schlechte Netzwerkanbindung und daher unter niedrigen
&Uuml;bertragungsraten leiden, sollten Sie die Einstellung ``NFS Slow'' aktivieren.</p>

<p>Eine weitere Voraussetzung f&uuml;r die Installation &uuml;ber NFS ist, da&szlig; der
Server ``subdir mounts'' unterst&uuml;tzen mu&szlig;. Wenn die FreeBSD Distribution zum
Beispiel im Verzeichnis <tt class="FILENAME">wiggy:/usr/archive/stuff/FreeBSD</tt>, dann
mu&szlig; <tt class="HOSTID">wiggy</tt> den direkten Zugriff auf <tt
class="FILENAME">/usr/archive/stuff/FreeBSD</tt> erlauben, nicht nur <tt
class="FILENAME">/usr</tt> oder <tt class="FILENAME">/usr/archive/stuff</tt>.</p>

<p>Bei FreeBSD erlauben Sie diese Art des Zugriffs durch die Angabe der Option <var
class="OPTION">-alldirs</var> in der Datei <tt class="FILENAME">/etc/exports</tt>. Bei
anderen NFS Servern gibt es &auml;hnliche Konventionen. Wenn Sie die Meldung <var
class="LITERAL">Permission Denied</var> erhalten, liegt es meistens daran, da&szlig;
diese Einstellung nicht richtig ist.</p>
</div>

<div class="SECT4">
<hr />
<h5 class="SECT4"><a id="AEN427" name="AEN427">1.5.5.5. Tips zur Installation &uuml;ber
FTP</a></h5>

<p>Wenn Sie &uuml;ber FTP installieren, k&ouml;nnen Sie jeden Server benutzen, auf dem
eine aktuelle Version von FreeBSD verf&uuml;gbar. Eine Liste passender Server f&uuml;r
fast jeden Ort der Welt wird Ihnen w&auml;hrend der Installation angezeigt.</p>

<p>Wenn Sie von einem Server installieren wollen, der nicht in dieser Liste steht oder
wenn Sie Problem mit dem DNS haben, k&ouml;nnen Sie auch eine URL angeben, wenn Sie den
Punkt ``URL'' aus der Liste ausw&auml;hlen. Da eine URL sowohl einen Hostname als auch
eine Adresse enthalten kann, k&ouml;nnen Sie eine URL dieser Art verwenden, wenn Sie
keinen Zugriff auf einen Nameserver haben:</p>

<pre class="SCREEN">
ftp://216.66.64.162/pub/FreeBSD/releases/sparc64/4.2-RELEASE
</pre>

<p>Sie k&ouml;nnen eine dieser drei Varianten der FTP-Installation nutzen:</p>

<ul>
<li>
<p>FTP: Diese Variante nutzt bei der Daten&uuml;bertragung den ``aktiven'' Modus, bei dem
der Server eine Verbindung zum Client aufbaut. Diese Variante funktioniert meistens
nicht, wenn ein Firewall im Spiel ist; allerdings unterst&uuml;tzen &auml;ltere Server
meistens nur diese Methode. Wenn Ihre Verbindungen im passiven Modus steckenbleiben,
sollten Sie diese Variante versuchen.</p>
</li>

<li>
<p>FTP Passive: Diese Variante nutzt den FTP-Modus "Passive", damit der Server keine
Verbindungen zum Client aufbaut. Sie sollten diese Variante verwenden, wenn Ihr Netzwerk
durch eine Firewall abgesichert ist, da die meisten Firewalls die vom Server ausgehenden
Verbindungen nicht erlauben.</p>
</li>

<li>
<p>FTP via an HTTP proxy: Mit dieser Option weisen Sie FreeBSD an, eine HTTP-Verbindung
zu einem Proxy aufzubauen, wenn es Daten per FTP &uuml;bertragen will. Der Proxy
&uuml;bersetzt die Anforderungen und schickt Sie zum eigentlichen FTP Server. Diese
Methode sollten Sie verwenden, wenn ein Firewall FTP vollst&auml;ndig verbietet,
daf&uuml;r aber einen HTTP Proxy zur Verf&uuml;gung stellt. Bei dieser Variante
m&uuml;ssen Sie nicht nur den FTP-Server, sondern auch den Namen des Proxy-Servers
angeben.</p>

<p>Falls Sie einen echten FTP Proxy benutzen, der nicht auf HTTP aufsetzt, sollten Sie
die folgende URL wie folgt angeben:</p>

<pre class="SCREEN">
<kbd class="USERINPUT">ftp://foo.bar.com:<var
class="REPLACEABLE">port</var>/pub/FreeBSD</kbd>
</pre>

<p>Dabei m&uuml;ssen Sie f&uuml;r <var class="REPLACEABLE">port</var> die Portnummer des
FTP-Proxy-Servers eingeben.</p>
</li>
</ul>
</div>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN470" name="AEN470">1.6. Fragen und Antworten f&uuml;r
Benutzer von UltraSPARC</a></h3>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="LAYOUT" name="LAYOUT">2. Format der Distribution</a></h2>

<p>Ein Verzeichnis mit einer typischen FreeBSD Distribution sieht ungef&auml;hr so aus
(das exakte Aussehen h&auml;ngt von der jeweiligen Version, Architektur und andere
Faktoren ab):</p>

<pre class="SCREEN">
ERRATA.HTM      README.TXT      compat1x        dict            kernel
ERRATA.TXT      RELNOTES.HTM    compat20        doc             manpages
HARDWARE.HTM    RELNOTES.TXT    compat21        docbook.css     packages
HARDWARE.TXT    base            compat22        filename.txt    ports
INSTALL.HTM     boot            compat3x        floppies        proflibs
INSTALL.TXT     catpages        compat4x        games           src
README.HTM      cdrom.inf       crypto          info            tools
</pre>

<p>Wenn Sie dieses Verzeichnis f&uuml;r eine CD-, FTP- oder NFS-Installation nutzen
wollen, brauchen Sie nur die beiden 1.44 MByte gro&szlig;en Bootdisketten zu erstellen
(wie das geht, ist in <a href="#FLOPPIES">Abschnitt 1.3</a> beschrieben), von diesen zu
booten, und dann den Anweisungen zu folgen. Alle anderen Dateien, die f&uuml;r die
Installation notwendig sind, werden auf der Grundlage Ihrer Angaben automatisch geholt.
Wenn Sie FreeBSD noch nie installiert haben, sollten Sie dieses Dokument (die
Installationsanleitung) komplett durchlesen.</p>

<p>Wenn Sie eine der anderen Varianten der Installation nutzen oder einfach nur wissen
wollen, wie eine Distribution aufgebaut ist, finden Sie hier weitere Informationen zum
Inhalt einiger der Verzeichnisse:</p>

<ol type="1">
<li>
<p>Die <tt class="FILENAME">*.TXT</tt> und <tt class="FILENAME">*.HTM</tt> Dateien
enthalten Dokumentationen (dieses Dokument ist zum Beispiels in <tt
class="FILENAME">INSTALL.TXT</tt> und <tt class="FILENAME">INSTALL.HTM</tt> enthalten),
die Sie vor der Installation lesen sollten. Die <tt class="FILENAME">*.TXT</tt> Dateien
enthalten normaler Text, die <tt class="FILENAME">*.HTM</tt> Dateien enthalten HTML und
k&ouml;nnen mit fast jedem Web Browser gelesen werden. Einige Distributionen stellen die
Dokumentationen auch in anderen Formaten bereit, z.B. PDF oder PostScript.</p>
</li>

<li>
<p><tt class="FILENAME">docbook.css</tt> ist ein Cascading Style Sheet (CSS), der von
einigen Browsern zur Formatierung der HTML Dokumentation benutzt wird.</p>
</li>

<li>
<p>Die Verzeichnisse <tt class="FILENAME">base</tt>, <tt class="FILENAME">catpages</tt>,
<tt class="FILENAME">crypto</tt>, <tt class="FILENAME">dict</tt>, <tt
class="FILENAME">doc</tt>, <tt class="FILENAME">games</tt>, <tt
class="FILENAME">info</tt>, <tt class="FILENAME">manpages</tt>, <tt
class="FILENAME">proflibs</tt>, und <tt class="FILENAME">src</tt> enthalten die
Hauptkomponenten der FreeBSD Distribution. Diese sind auf kleine Dateien aufgeteilt
wurden, damit sie (zur Not) auch auf Disketten passen.</p>
</li>

<li>
<p>Die Verzeichnisse <tt class="FILENAME">compat1x</tt>, <tt
class="FILENAME">compat20</tt>, <tt class="FILENAME">compat21</tt>, <tt
class="FILENAME">compat22</tt>, <tt class="FILENAME">compat3x</tt>, und <tt
class="FILENAME">compat4x</tt> enthalten Dateien, die zur Ausf&uuml;hrung von Programmen
f&uuml;r &auml;lteren FreeBSD Versionen notwendig sind. Auch diese Dateien liegen im <tt
class="FILENAME">.tar.gz</tt> Format vor und k&ouml;nnen direkt bei der Installation
installiert werden. Falls Sie sie nachtr&auml;glich installieren wollen, nutzen Sie das
<tt class="FILENAME">install.sh</tt> Script in dem jeweiligen Verzeichnis.</p>
</li>

<li>
<p>Das Verzeichnis <tt class="FILENAME">floppies/</tt> enth&auml;lt die Images der
Bootdisketten. Informationen, wie man diese Images benutzt, finden Sie in <a
href="#FLOPPIES">Abschnitt 1.3</a>.</p>
</li>

<li>
<p>Die Verzeichnisse <tt class="FILENAME">packages</tt> und <tt
class="FILENAME">ports</tt> enthalten die FreeBSD Packages bzw. Ports Collection. Sie
k&ouml;nnen Packages aus diesem Verzeichnis installieren, indem Sie den folgenden Befehl
eingeben:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp><kbd
class="USERINPUT">/stand/sysinstall configPackages</kbd>
</pre>

<p>Alternativ k&ouml;nnen Sie auch die Namen einzelner Dateien aus <tt
class="FILENAME">packages</tt> an das Programm <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=pkg_add&sektion=1&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">pkg_add</span>(1)</span></a>
&uuml;bergeben.</p>

<p>Die Ports Collection kann wie jede andere Distribution installiert werden und belegt
dann rund 100 MByte Plattenplatz. Weitere Informationen &uuml;ber die Ports Collection
finden Sie auf <a href="http://www.FreeBSD.org/ports/"
target="_top">http://www.FreeBSD.org/ports/</a>. Wenn Sie die <tt
class="FILENAME">doc</tt> Distribution installiert haben, sind diese Informationen auch
unter <tt class="FILENAME">/usr/share/doc/handbook</tt> verf&uuml;gbar.</p>
</li>

<li>
<p>Zum guten Schlu&szlig;: Das Verzeichnis <tt class="FILENAME">tools</tt> enth&auml;lt
diverse DOS-Programme zur Ermittlung der Plattengeometrie, zur Installation von
Bootmanager, und so weiter. Sie brauchen diese Programme nicht unbedingt, sie werden nur
mitgeliefert, um Ihnen das Leben etwas einfacher zu machen.</p>
</li>
</ol>

<p>Das Verzeichnisses einer typischen Distribution (in diesem Fall <tt
class="FILENAME">info</tt>) enth&auml;lt die folgenden Dateien:</p>

<pre class="SCREEN">
CHECKSUM.MD5    info.ab         info.ad         info.inf        install.sh
info.aa         info.ac         info.ae         info.mtree
</pre>

<p>Die Datei <tt class="FILENAME">CHECKSUM.MD5</tt> enth&auml;lt MD5 Pr&uuml;fsummen
f&uuml;r die anderen Dateien. Sie wird nur gebraucht, falls Sie vermuten, da&szlig; eine
Datei besch&auml;digt wurde. Diese Datei wird vom Installationsprogramm nicht verwendet
und mu&szlig; auch nicht zusammen mit den anderen Dateien dieser Distribution kopiert
werden. Die Dateien mit den Namen <tt class="FILENAME">info.a*</tt> sind Teile eines
einzigen .tar.gz Archiv, dessen Inhalt Sie sich mit dem folgenden Befehl anzeigen lassen
k&ouml;nnen:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cat info.a* | tar tvzf -</kbd>
</pre>

<p>W&auml;hrend der Installation werden diese Dateien automatisch zusammengesetzt und
ausgepackt.</p>

<p>Die Datei <tt class="FILENAME">info.inf</tt> wird vom Installationsprogramm genutzt,
um die Anzahl der Dateiteile zu ermitteln, die es beschaffen und zusammensetzen
mu&szlig;. Wenn Sie eine Distribution auf Diskette kopieren, <span class="emphasis"><i
class="EMPHASIS">m&uuml;ssen</i></span> Sie die <tt class="FILENAME">.inf</tt> Datei auf
die erste Diskette kopieren.</p>

<p>Die Datei <tt class="FILENAME">info.mtree</tt> ist ebenfalls optional und als
Information f&uuml;r den Benutzer gedacht. Sie enth&auml;lt die MD5 Pr&uuml;fsummen der
<span class="emphasis"><i class="EMPHASIS">ungepackten</i></span> Dateien in der
Distribution und kann sp&auml;ter vom Programm <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=mtree&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">mtree</span>(8)</span></a> genutzt
werden, um &Auml;nderungen an den Datei oder Dateirechten aufzusp&uuml;ren. Wenn Sie das
bei der <tt class="FILENAME">base</tt> Distribution machen, haben Sie eine sehr wirksame
Methode, um Ihr System auf trojanische Pferde zu untersuchen.</p>

<p>Zum guten Schlu&szlig;: Mit der Datei <tt class="FILENAME">install.sh</tt> k&ouml;nnen
Sie eine Distribution nachtr&auml;glich installieren. Wenn Sie zum Beispiel die info
Distribution nachtr&auml;glich von CD installieren wollen, kommen Sie mit den folgenden
Befehlen zum Ziel:</p>

<pre class="SCREEN">
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">cd /cdrom/info</kbd>
<samp class="PROMPT">#</samp> <kbd class="USERINPUT">sh install.sh</kbd>
</pre>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="UPGRADING" name="UPGRADING">3. Aktualisierung einer
FreeBSD-Installation</a></h2>

<p>In diesem Abschnitt erfahren Sie, wie Sie Ihre FreeBSD-Installation aktualisieren
k&ouml;nnen, ohne den Quellcode zu verwenden.</p>

<div class="WARNING">
<blockquote class="WARNING">
<p><b>Warnung:</b> Die Programme, die zur Aktualisierung von FreeBSD verwendet werden,
treffen alle m&ouml;glichen Vorkehrungen, um Datenverluste zu vermeiden. Allerdings ist
es immer noch m&ouml;glich, da&szlig; Sie bei diesem Schritte <span class="emphasis"><i
class="EMPHASIS">den kompletten Festplatteninhalt</i></span> verlieren. Sie sollten die
letzte Sicherheitsabfrage nicht best&auml;tigen, bevor Sie ein ad&auml;quates Backup
aller Daten angelegt haben.</p>
</blockquote>
</div>

<div class="IMPORTANT">
<blockquote class="IMPORTANT">
<p><b>Wichtig:</b> Diese Anleitung geht davon aus, da&szlig; Sie das <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span
class="REFENTRYTITLE">sysinstall</span>(8)</span></a>-Programm der <span
class="emphasis"><i class="EMPHASIS">NEUEN</i></span> FreeBSD-Version zur Aktualisierung
verwenden. Die Verwendung der falschen <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span
class="REFENTRYTITLE">sysinstall</span>(8)</span></a>-Version f&uuml;hrt zu Problemen und
hat in der Vergangenheit schon System unbrauchbar gemacht. Ein typischer Fehler ist die
Verwendung des <a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span
class="REFENTRYTITLE">sysinstall</span>(8)</span></a>-Programms des installierten
Systems, um das System auf eine neuere FreeBSD-Version zu aktualisieren. Sie sollten das
<span class="emphasis"><i class="EMPHASIS">nicht</i></span> versuchen.</p>
</blockquote>
</div>

<div class="WARNING">
<blockquote class="WARNING">
<p><b>Warnung:</b> Sie sollten nicht versuchen, Ihr System mit der Upgrade-Funktion von
<a
href="http://www.FreeBSD.org/cgi/man.cgi?query=sysinstall&sektion=8&manpath=FreeBSD+5.2-RELEASE">
<span class="CITEREFENTRY"><span class="REFENTRYTITLE">sysinstall</span>(8)</span></a>
von FreeBSD 4-STABLE auf FreeBSD 5.2-RELEASE zu aktualisieren. Einige in FreeBSD 4-STABLE
vorhandene Dateien f&uuml;hren zu Problemen, sie werden aber bei dieser Art der
Aktualisierung nicht entfernt. Ein drastisches Beispiel ist ein veraltetes <tt
class="FILENAME">/usr/include/g++</tt>, das dazu f&uuml;hren kann, da&szlig; C++
Programme nicht korrekt (oder gar nicht) &uuml;bersetzt werden.</p>

<p>Diese Anleitung zur Aktualisierung ist nur f&uuml;r Benutzer gedacht, die schon einen
halbwegs aktuellen FreeBSD 5-CURRENT Snapshot installiert haben.</p>
</blockquote>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN674" name="AEN674">3.1. Einf&uuml;hrung</a></h3>

<p>Bei der Aktualisierung werden die vom Benutzer ausgew&auml;hlten Distributionen durch
die entsprechenden Distributionen der neuen FreeBSD-Version ersetzt. Die normalen
Konfigurationsdateien des Systems, Benutzerdaten, installierte Packages und andere
Software werden nicht aktualisiert.</p>

<p>Systemadministratoren, die eine Aktualisierung planen, sollten dieses Kapitel komplett
lesen, bevor sie die Aktualisierung durchf&uuml;hren, um das Risiko eines Fehlschlags
oder Datenverlustes zu vermeiden.</p>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN678" name="AEN678">3.1.1. &Uuml;bersicht</a></h4>

<p>Um eine Distribution zu aktualisieren, wird die neue Version dieser Komponente
&uuml;ber die alte Version kopiert. Die zur alten Version geh&ouml;renden Dateien werden
nicht gel&ouml;scht.</p>

<p>Die Systemkonfiguration bleibt erhalten, da die urspr&uuml;nglichen Versionen der
nachfolgend aufgef&uuml;hrten Dateien gesichert und zur&uuml;ckgespielt werden:</p>

<p><tt class="FILENAME">Xaccel.ini</tt>, <tt class="FILENAME">XF86Config</tt>, <tt
class="FILENAME">adduser.conf</tt>, <tt class="FILENAME">aliases</tt>, <tt
class="FILENAME">aliases.db</tt>, <tt class="FILENAME">amd.map</tt>, <tt
class="FILENAME">crontab</tt>, <tt class="FILENAME">csh.cshrc</tt>, <tt
class="FILENAME">csh.login</tt>, <tt class="FILENAME">csh.logout</tt>, <tt
class="FILENAME">cvsupfile</tt>, <tt class="FILENAME">dhclient.conf</tt>, <tt
class="FILENAME">disktab</tt>, <tt class="FILENAME">dm.conf</tt>, <tt
class="FILENAME">dumpdates</tt>, <tt class="FILENAME">exports</tt>, <tt
class="FILENAME">fbtab</tt>, <tt class="FILENAME">fstab</tt>, <tt
class="FILENAME">ftpusers</tt>, <tt class="FILENAME">gettytab</tt>, <tt
class="FILENAME">gnats</tt>, <tt class="FILENAME">group</tt>, <tt
class="FILENAME">hosts</tt>, <tt class="FILENAME">hosts.allow</tt>, <tt
class="FILENAME">hosts.equiv</tt>, <tt class="FILENAME">hosts.lpd</tt>, <tt
class="FILENAME">inetd.conf</tt>, <tt class="FILENAME">localtime</tt>, <tt
class="FILENAME">login.access</tt>, <tt class="FILENAME">login.conf</tt>, <tt
class="FILENAME">mail</tt>, <tt class="FILENAME">mail.rc</tt>, <tt
class="FILENAME">make.conf</tt>, <tt class="FILENAME">manpath.config</tt>, <tt
class="FILENAME">master.passwd</tt>, <tt class="FILENAME">motd</tt>, <tt
class="FILENAME">namedb</tt>, <tt class="FILENAME">networks</tt>, <tt
class="FILENAME">newsyslog.conf</tt>, <tt class="FILENAME">nsmb.conf</tt>, <tt
class="FILENAME">nsswitch.conf</tt>, <tt class="FILENAME">pam.conf</tt>, <tt
class="FILENAME">passwd</tt>, <tt class="FILENAME">periodic</tt>, <tt
class="FILENAME">ppp</tt>, <tt class="FILENAME">printcap</tt>, <tt
class="FILENAME">profile</tt>, <tt class="FILENAME">pwd.db</tt>, <tt
class="FILENAME">rc.conf</tt>, <tt class="FILENAME">rc.conf.local</tt>, <tt
class="FILENAME">rc.firewall</tt>, <tt class="FILENAME">rc.local</tt>, <tt
class="FILENAME">remote</tt>, <tt class="FILENAME">resolv.conf</tt>, <tt
class="FILENAME">rmt</tt>, <tt class="FILENAME">sendmail.cf</tt>, <tt
class="FILENAME">sendmail.cw</tt>, <tt class="FILENAME">services</tt>, <tt
class="FILENAME">shells</tt>, <tt class="FILENAME">skeykeys</tt>, <tt
class="FILENAME">spwd.db</tt>, <tt class="FILENAME">ssh</tt>, <tt
class="FILENAME">syslog.conf</tt>, <tt class="FILENAME">ttys</tt>, <tt
class="FILENAME">uucp</tt></p>

<p>Die zur neuen Version geh&ouml;renden Versionen dieser Dateien werden im Verzeichnis
<tt class="FILENAME">/etc/upgrade/</tt> abgelegt. Sie sollten einen Blick auf diese
Dateien werfen und gegebenenfalls die Neuerungen in das bestehende System einarbeiten.
Allerdings gibt es viele Wechselwirkungen zwischen den einzelnen Dateien; daher empfehlen
wir Ihnen, alle lokalen Anpassungen in die neuen Dateien einzutragen und dann diese zu
verwenden.</p>

<p>W&auml;hrend der Aktualisierung werden Sie gebeten, ein Verzeichnis anzugeben, in dem
Kopien aller Dateien aus dem Verzeichnis <tt class="FILENAME">/etc/</tt> abgelegt werden.
Falls Sie &Auml;nderungen in anderen Dateien vorgenommen haben, k&ouml;nnen Sie diese aus
diesem Verzeichnis restaurieren.</p>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN752" name="AEN752">3.2. Vorgehensweise</a></h3>

<p>In diesem Abschnitt finden Sie Details zur Vorgehensweise bei der Aktualisierung,
dabei wird ein besonderes Augenmerk auf die Punkte gelegt, bei denen besonders stark vor
einer normalen Installation abgewichen wird.</p>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN755" name="AEN755">3.2.1. Datensicherung</a></h4>

<p>Sie sollten Kopien der Benutzerdaten und Konfigurationsdateien anlegen, bevor Sie das
System aktualisieren. Das Programm zur Aktualisierung versucht, Fehler und
Fehlbedienungen so weit wie m&ouml;glich zu verhindern, aber es ist immer noch
m&ouml;glich, da&szlig; Daten oder Konfigurationsinformationen teilweise oder
vollst&auml;ndig gel&ouml;scht werden.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN758" name="AEN758">3.2.2. Mounten der Dateisysteme</a></h4>

<p>Im <var class="LITERAL">disklabel editor</var> werden die vorhandenen Dateisysteme
aufgef&uuml;hrt. Sie sollten vor dem Beginn der Aktualisierung eine Liste der vorhandenen
Ger&auml;tenamen und der dazugeh&ouml;rigen Mountpoints anlegen. Die Namen der
Mountpoints m&uuml;ssen hier angegeben werden. Sie d&uuml;rfen das ``newfs flag''
f&uuml;r die Dateisysteme <span class="emphasis"><i class="EMPHASIS">auf gar keinen
Fall</i></span> aktivieren, da Sie sonst Daten verlieren werden.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="AEN764" name="AEN764">3.2.3. Auswahl der Distributionen</a></h4>

<p>Es gibt keine Einschr&auml;nkungen bei der Auswahl der zu aktualisierenden
Distributionen. Allerdings sollten Sie die Distribution <var class="LITERAL">base</var>
auf jeden Fall aktualisieren; wenn Sie die Onlinehilfe installiert hatten, sollte auch
die Distribution <var class="LITERAL">man</var> aktualisieren. Wenn Sie zus&auml;tzliche
Funktionalit&auml;t hinzuf&uuml;gen wollen, k&ouml;nnen Sie auch Distributionen
ausw&auml;hlen, die bisher noch nicht installiert waren.</p>
</div>

<div class="SECT3">
<hr />
<h4 class="SECT3"><a id="FSTAB" name="FSTAB">3.2.4. Nach der Installation</a></h4>

<p>Sobald die Installation abgeschlossen ist, werden Sie aufgefordert, die neuen
Konfigurationsdatei zu pr&uuml;fen. Zu diesem Zeitpunkt sollten Sie &uuml;berpr&uuml;fen,
ob die neue Konfiguration korrekt ist. Dabei sollten Sie besonders auf die Inhalte der
Dateien <tt class="FILENAME">/etc/rc.conf</tt> und <tt class="FILENAME">/etc/fstab</tt>
achten.</p>
</div>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN774" name="AEN774">3.3. Aktualisierung &uuml;ber den
Quellcode</a></h3>

<p>Wenn Sie an einer flexibleren und ausgefeilteren M&ouml;glichkeit zur Aktualisierung
Ihres Systems interessiert sind, sollten Sie einen Blick in das Kapitel <a
href="http://www.FreeBSD.org/doc/de_DE.ISO8859-1/books/handbook/cutting-edge.html"
target="_top">The Cutting Edge</a> des FreeBSD Handbuchs werfen. Bei dieser Variante
erzeugen Sie FreeBSD aus dem Quellcode komplett neu. Diese Variante braucht eine
verl&auml;&szlig;liche Netzwerkverbindung, mehr Plattenplatz und mehr Zeit, bietet aber
Vorteile f&uuml;r Netzwerke und andere komplexe Installationen. Sie entspricht
ungef&auml;hr der Vorgehensweise, die f&uuml;r die Entwicklungszweige -STABLE und
-CURRENT verwendet wird.</p>

<p><tt class="FILENAME">/usr/src/UPDATING</tt> enth&auml;lt wichtige Informationen, wenn
Sie ein FreeBSD System mit Hilfe des Quellcodes aktualisieren m&ouml;chten. Hier finden
Sie eine Liste aller Probleme, die durch &Auml;nderungen in FreeBSD auftreten k&ouml;nnen
und die Aktualisierung beeinflussen k&ouml;nnten.</p>
</div>
</div>

<div class="SECT1">
<hr />
<h2 class="SECT1"><a id="TROUBLE" name="TROUBLE">4. Erste Hilfe</a></h2>

<div class="SECT2">
<h3 class="SECT2"><a id="REPAIRING" name="REPAIRING">4.1. Reparatur einer FreeBSD
Installation</a></h3>

<p>Bei FreeBSD gibt es im Hauptmen&uuml; des Installationsprogramms den Punkt ``Fixit''.
Wenn Sie diese Option benutzen wollen, brauchen Sie entweder eine Diskette, die Sie aus
dem Image <tt class="FILENAME">fixit.flp</tt> erzeugt haben; oder die CD mit dem ``live
filesystem'', das ist normalerweise die zweite CD der FreeBSD Distribution.</p>

<p>Um fixit zu benutzen, m&uuml;ssen Sie zuerst von der <tt
class="FILENAME">kern.flp</tt> Diskette booten, dann die Option ``Fixit'' ausw&auml;hlen
und dann die Fixit Diskette oder CD einlegen, wenn Sie dazu aufgefordert werden. Danach
wird eine Shell gestartet, in der viele Programme zur &Uuml;berpr&uuml;fung, Reparatur
und Analyse von Dateisystem und ihren Inhalten zur Verf&uuml;gung stehen. Sie finden
diese Programme in den Verzeichnissen <tt class="FILENAME">/stand</tt> und <tt
class="FILENAME">/mnt2/stand</tt>. Allerdings <span class="emphasis"><i
class="EMPHASIS">brauchen</i></span> Sie Erfahrung mit der Administration von
Unix-Systemen, um diese Option sinnvoll einsetzen zu k&ouml;nnen.</p>
</div>

<div class="SECT2">
<hr />
<h3 class="SECT2"><a id="AEN794" name="AEN794">4.2. Typische Probleme bei der
Installation auf UltraSPARC Systemen</a></h3>
</div>
</div>
</div>

<hr />
<p align="center"><small>Diese Datei und andere Dokumente zu dieser Version sind bei <a
href="ftp://ftp.FreeBSD.org/pub/FreeBSD/development/sparc64/">ftp://ftp.FreeBSD.org/pub/FreeBSD/development/sparc64/</a>verfuegbar.</small></p>

<p align="center"><small>Wenn Sie Fragen zu FreeBSD haben, lesen Sie erst die <a
href="http://www.FreeBSD.org/docs.html">Dokumentation,</a> bevor Sie sich an &#60;<a
href="mailto:de-bsd-questions@de.FreeBSD.org">de-bsd-questions@de.FreeBSD.org</a>&#62;
wenden.</small></p>

<p align="center"><small>Wenn Sie Fragen zu dieser Dokumentation haben, wenden Sie sich
an &#60;<a
href="mailto:de-bsd-translators@de.FreeBSD.org">de-bsd-translators@de.FreeBSD.org</a>&#62;.</small></p>

<br />
<br />
</body>
</html>

