freebsd/freebsd-doc/documentation/manual-pages/ru/man5/finger.conf.5
.\" Copyright (c) 2000 Mark Knight <markk@knigma.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.bin/finger/finger.conf.5,v 1.6 2005/02/09 18:04:22 ru Exp %
.\" $FreeBSDru: frdp/doc/ru_RU.KOI8-R/man/man5/finger.conf.5,v 1.1 2007/10/31 11:25:03 ru Exp $
.\" $FreeBSD$
.\"
.Dd 16 августа 2000
.Dt FINGER.CONF 5
.Os
.Sh НАЗВАНИЕ
.Nm finger.conf
.Nd файл определения псевдонимов для
.Xr finger 1
.Sh ОПИСАНИЕ
Необязательный файл
.Nm
используется для задания псевдонимов, которые могут быть опрошены
локальными и сетевыми пользователями.
Это может оказаться полезным, если регистрационное имя пользователя
в системе отличается от его предпочитаемого почтового адреса, или для
определения виртуальных регистрационных имён, которые могут быть опрошены.
.Pp
Строки, начинающиеся с ``#'', являются комментариями.
Остальные строки должны состоять из псевдонима и целевого имени,
на которое он ссылается, разделённых двоеточием.
Целевое имя может быть либо регистрационным именем пользователя, либо
ссылкой на другой псевдоним, либо путём к файлу, доступному на чтение всем.
.Pp
Если псевдоним указывает на файл, то при запросе псевдонима будет выведено
содержимое этого файла.
.Sh ФАЙЛЫ
.Bl -tag -width /etc/finger.conf -compact
.It Pa /etc/finger.conf
файл определения псевдонимов для
.Xr finger 1
.El
.Sh ПРИМЕРЫ
.Bd -literal
# /etc/finger.conf alias definition file
#
# Формат псевдоним:(пользователь|псевдоним)
#
# Индивидуальные псевдонимы
#
markk:mkn
john.smith:dev329
john:dev329
sue:/etc/finger/sue.txt
#
# Network status message
#
status:/usr/local/etc/status.txt
#
# Административные перенаправления
#
root:admin
postmaster:admin
abuse:admin
#
# В настоящее время, 'sod' является системным администратором.
#
admin:sod
.Ed
.Sh СМОТРИ ТАКЖЕ
.Xr finger 1
.Sh ИСТОРИЯ
Поддержка файла
.Nm
была добавлена Mark Knight <markk@knigma.org> и впервые появилась во
.Fx 4.2 .
