Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network/_index.po
Languages: ru

source: This chapter delves into the topic of network configuration and performance, showcasing the robust networking capabilities of the FreeBSD operating system.
ru: Эта глава рассматривает тему настройки сети и производительности, демонстрируя мощные сетевые возможности операционной системы FreeBSD.

source: Part I. Getting Started
ru: В начале

source: Chapter 7. Network
ru: Глава 7. Сеть

source: Network
ru: Сеть

source: Synopsis
ru: Обзор

source: This chapter delves into the topic of network configuration and performance, showcasing the robust networking capabilities of the FreeBSD operating system. Whether working with wired or wireless networks, this chapter provides a comprehensive guide to configuring and optimizing network connectivity in FreeBSD.
ru: Эта глава углубляется в тему настройки сети и производительности, демонстрируя мощные сетевые возможности операционной системы FreeBSD. Независимо от работы с проводными или беспроводными сетями, эта глава предоставляет всеобъемлющее руководство по настройке и оптимизации сетевого подключения в FreeBSD.

source: Before diving into the details, it is beneficial for readers to have a basic understanding of networking concepts such as protocols, network interfaces, and addressing.
ru: Прежде чем углубляться в детали, читателям будет полезно иметь базовое понимание сетевых концепций, таких как протоколы, сетевые интерфейсы и адресация.

source: This chapter covers:
ru: Эта глава охватывает:

source: The ability to configure wired networks in FreeBSD, including network interface setup, addressing, and customization options.
ru: Возможности настройки проводных сетей в FreeBSD, включая настройку сетевых интерфейсов, адресацию и параметры конфигурации.

source: The skills to configure wireless networks in FreeBSD, encompassing wireless network interface setup, security protocols, and troubleshooting techniques.
ru: Навыки, необходимые для настройки беспроводных сетей в FreeBSD, включая настройку беспроводных сетевых интерфейсов, протоколы безопасности и методы устранения неполадок.

source: FreeBSD's networking capabilities and its reputation for excellent network performance.
ru: Возможности сетевых подключений FreeBSD и её репутация в области превосходной сетевой производительности.

source: An understanding of various network services and protocols supported by FreeBSD, with configuration instructions for DNS, DHCP and more.
ru: Понимание различных сетевых служб и протоколов, поддерживаемых FreeBSD, с инструкциями по настройке DNS, DHCP и других.

source: More information about how to make advanced network configurations in crossref:advanced-networking[advanced-networking,Advanced Networking].
ru: Дополнительная информация о настройке расширенных конфигураций сети приведена в разделе crossref:advanced-networking[advanced-networking,Сложные вопросы работы в сети].

source: Setting up the Network
ru: Настройка сети

source: Setting up a wired or wireless connection is a common task for a FreeBSD user. This section will show how to identify the wired and wireless network adapters and how to configure them.
ru: Настройка проводного или беспроводного подключения — распространённая задача для пользователя FreeBSD. В этом разделе показано, как определить проводные и беспроводные сетевые адаптеры и как их настроить.

source: Before starting with the configuration it is necessary to know the following network data:
ru: Прежде чем приступить к настройке, необходимо знать следующие сетевые данные:

source: If the network has DHCP
ru: Есть ли в сети DHCP

source: If the network does not have DHCP, the static IP to be used
ru: Если в сети нет DHCP, используемый статический IP-адрес

source: The netmask
ru: Маска сети

source: The IP address of the default gateway
ru: IP-адрес шлюза по умолчанию

source: The network connection may have been configured at installation time by man:bsdinstall[8].
ru: Сетевое соединение могло быть настроено во время установки с помощью man:bsdinstall[8].

source: Identify Network Adapters
ru: Определение сетевых адаптеров

source: FreeBSD supports a wide variety of network adapters for both wired and wireless networks. Check the Hardware Compatibility List for the used link:https://www.freebsd.org/releases/[FreeBSD release] to see if the network adapter is supported.
ru: FreeBSD поддерживает широкий спектр сетевых адаптеров как для проводных, так и для беспроводных сетей. Проверьте link:https://www.freebsd.org/releases/[список совместимости оборудования] для используемого выпуска FreeBSD, чтобы убедиться, что сетевой адаптер поддерживается.

source: To get the network adapters used by our system execute the following command:
ru: Чтобы получить список сетевых адаптеров, используемых в системе, выполните следующую команду:

source: The output should be similar to the following:
ru: Вывод должен быть похож на следующий:

source: The text before the '@' symbol is the name of the driver controlling the device. In this case these are man:em[4] and man:iwn[4].
ru: Текст перед символом '@' — это название драйвера, управляющего устройством. В данном случае это man:em[4] и man:iwn[4].

source: Shows the name of the vendor
ru: Показывает название производителя

source: Shows the name of the device
ru: Показывает название устройства

source: It is only necessary to load the network interface card module if FreeBSD has not detected it correctly.
ru: Требуется загружать модуль сетевой карты только в том случае, если FreeBSD не определил его правильно.

source: For example, to load the man:alc[4] module, execute the following command:
ru: Например, для загрузки модуля man:alc[4] выполните следующую команду:

source: Alternatively, to load the driver as a module at boot time, place the following line in [.filename]#/boot/loader.conf#:
ru: В качестве альтернативы, для загрузки драйвера как модуля во время загрузки, добавьте следующую строку в [.filename]#/boot/loader.conf#:

source: Wired Networks
ru: Проводные сети

source: Once the right driver is loaded the network adapter needs to be configured. FreeBSD uses the driver name followed by a unit number to name the network interface adapter. The unit number represents the order in which the adapter is detected at boot time, or is later discovered.
ru: После загрузки нужного драйвера необходимо настроить сетевой адаптер. В FreeBSD для именования сетевого интерфейса используется имя драйвера, за которым следует номер устройства. Номер устройства указывает порядок обнаружения адаптера при загрузке или позднее.

source: For example, `em0` is the first network interface card (NIC) on the system using the man:em[4] driver.
ru: Например, `em0` — это первая сетевая карта (NIC) в системе, использующая драйвер man:em[4].

source: To display the network interface configuration, enter the following command:
ru: Для отображения конфигурации сетевого интерфейса введите следующую команду:

source: In this example, the following devices were displayed:
ru: В этом примере были отображены следующие устройства:

source: `em0`: The Ethernet interface.
ru: `em0`: Интерфейс Ethernet.

source: `lo0`: The loop interface is a software loopback mechanism which may be used for performance analysis, software testing, and/or local communication. More information in man:lo[4].
ru: `lo0`: Интерфейс loop представляет собой механизм программной петли (loopback), который может использоваться для анализа производительности, тестирования программного обеспечения и/или локального взаимодействия. Подробнее см. в man:lo[4].

source: The example shows that `em0` is up and running.
ru: Пример показывает, что `em0` работает и активен.

source: The key indicators are:
ru: Ключевые показатели:

source: `UP` means that the interface is configured and ready.
ru: `UP` означает, что интерфейс настроен и готов к работе.

source: The interface has an IPv4 Internet (`inet`) address, `192.168.1.19`.
ru: Интерфейс имеет IPv4 адрес в Интернете (`inet`) — `192.168.1.19`.

source: The interface has an IPv6 Internet (`inet6`) address, `fe80::21f:16ff:fe0f:275a%em0`.
ru: Интерфейс имеет IPv6-адрес (`inet6`) в Интернете: `fe80::21f:16ff:fe0f:275a%em0`.

source: It has a valid subnet mask (`netmask`), where `0xffffff00` is the same as `255.255.255.0`.
ru: У него есть действительная маска подсети (`netmask`), где `0xffffff00` эквивалентно `255.255.255.0`.

source: It has a valid broadcast address, `192.168.1.255`.
ru: У него есть корректный широковещательный адрес, `192.168.1.255`.

source: The MAC address of the interface (`ether`) is `00:1f:16:0f:27:5a`.
ru: MAC-адрес интерфейса (`ether`) — `00:1f:16:0f:27:5a`.

source: The physical media selection is on autoselection mode (`media: Ethernet autoselect (1000baseT <full-duplex>)`).
ru: Выбор физической среды находится в режиме автоопределения (`media: Ethernet autoselect (1000baseT <full-duplex>)`).

source: The status of the link (`status`) is `active`, indicating that the carrier signal is detected. For `em0`, the `status: no carrier` status is normal when an Ethernet cable is not plugged into the interface.
ru: Состояние соединения (`status`) имеет значение `active`, что указывает на обнаружение несущего сигнала. Для `em0` состояние `status: no carrier` является нормальным, если кабель Ethernet не подключен к интерфейсу.

source: If the man:ifconfig[8] output had shown something similar to the next output it would indicate the interface has not been configured:
ru: Если вывод man:ifconfig[8] показал что-то похожее на следующий результат, это означало бы, что интерфейс не настроен:

source: Configuring Static IPv4 Address
ru: Настройка статического IPv4-адреса

source: This section provides a guide to configuring a static IPv4 address on a FreeBSD system.
ru: В этом разделе представлено руководство по настройке статического IPv4-адреса в системе FreeBSD.

source: The network interface card configuration can be performed from the command line with man:ifconfig[8] but will not persist after a reboot unless the configuration is also added to [.filename]#/etc/rc.conf#.
ru: Настройку сетевой интерфейсной карты можно выполнить из командной строки с помощью man:ifconfig[8], но она не сохранится после перезагрузки, если конфигурация также не добавлена в [.filename]#/etc/rc.conf#.

source: If the network was configured during installation by man:bsdinstall[8], some entries for the network interface card (NICs) may be already present. Double check [.filename]#/etc/rc.conf# before executing man:sysrc[8].
ru: Если сеть была настроена во время установки с помощью man:bsdinstall[8], некоторые записи для сетевой интерфейсной карты (NIC) могут уже присутствовать. Проверьте [.filename]#/etc/rc.conf# перед выполнением man:sysrc[8].

source: The IP address can be set executing the following command:
ru: IP-адрес можно задать, выполнив следующую команду:

source: To make the change persist across reboots execute the following command:
ru: Чтобы изменение сохранялось после перезагрузки, выполните следующую команду:

source: Add the default router executing the following command:
ru: Добавьте маршрут по умолчанию, выполнив следующую команду:

source: Add the DNS records to [.filename]#/etc/resolv.conf#:
ru: Добавьте DNS-записи в [.filename]#/etc/resolv.conf#:

source: Then restart `netif` and `routing` executing the following command:
ru: Затем перезапустите `netif` и `routing`, выполнив следующую команду:

source: The connection can be tested using man:ping[8]:
ru: Соединение можно проверить с помощью man:ping[8]:

source: Configuring Dynamic IPv4 Address
ru: Настройка динамического IPv4-адреса

source: If the network has a DHCP server, it is very easy to configure the network interface to use DHCP. FreeBSD uses man:dhclient[8] as the DHCP client. man:dhclient[8] will automatically provide the IP, the netmask and the default router.
ru: Если в сети есть DHCP-сервер, то настроить сетевой интерфейс для использования DHCP очень просто. FreeBSD использует man:dhclient[8] в качестве DHCP-клиента. man:dhclient[8] автоматически предоставит IP-адрес, маску сети и маршрутизатор по умолчанию.

source: To make the interface work with DHCP execute the following command:
ru: Чтобы настроить интерфейс для работы с DHCP, выполните следующую команду:

source: man:dhclient[8] can be used manually by running the following command:
ru: man:dhclient[8] можно использовать вручную, выполнив следующую команду:

source: In this way it can be verified that the address assignment using DHCP works correctly.
ru: Таким образом можно убедиться, что назначение адреса с помощью DHCP работает корректно.

source: man:dhclient[8] client can be started in background. This can cause trouble with applications depending on a working network, but it will provide a faster startup in many cases.
ru: Клиент man:dhclient[8] может быть запущен в фоновом режиме. Это может вызвать проблемы с приложениями, зависящими от рабочей сети, но во многих случаях обеспечит более быстрый запуск.

source: To execute man:dhclient[8] in background execute the following command:
ru: Для выполнения man:dhclient[8] в фоновом режиме выполните следующую команду:

source: Then restart `netif` executing the following command:
ru: Затем перезапустите `netif`, выполнив следующую команду:

source: IPv6 is the new version of the well-known IP protocol, also known as IPv4.
ru: IPv6 — это новая версия широко известного протокола IP, также известного как IPv4.

source: IPv6 provides several advantages over IPv4 as well as many new features:
ru: IPv6 предоставляет несколько преимуществ по сравнению с IPv4, а также множество новых функций:

source: Its 128-bit address space allows for 340,282,366,920,938,463,463,374,607,431,768,211,456 addresses. This addresses the IPv4 address shortage and eventual IPv4 address exhaustion.
ru: Его 128-битное адресное пространство позволяет использовать 340 282 366 920 938 463 463 374 607 431 768 211 456 адресов. Это решает проблему нехватки IPv4-адресов и неизбежного исчерпания IPv4-адресного пространства.

source: Routers only store network aggregation addresses in their routing tables, thus reducing the average space of a routing table to 8192 entries. This addresses the scalability issues associated with IPv4, which required every allocated block of IPv4 addresses to be exchanged between Internet routers, causing their routing tables to become too large to allow efficient routing.
ru: Маршрутизаторы хранят в своих таблицах маршрутизации только агрегированные сетевые адреса, что сокращает средний размер таблицы маршрутизации до 8192 записей. Это решает проблемы масштабируемости, связанные с IPv4, где каждый выделенный блок IPv4-адресов должен был обмениваться между интернет-маршрутизаторами, что приводило к чрезмерному увеличению их таблиц маршрутизации и затрудняло эффективную маршрутизацию.

source: Address autoconfiguration (http://www.ietf.org/rfc/rfc4862.txt[RFC4862]).
ru: Автоконфигурация адресов (http://www.ietf.org/rfc/rfc4862.txt[RFC4862]).

source: Mandatory multicast addresses.
ru: Обязательные multicast-адреса.

source: Built-in IPsec (IP security).
ru: Встроенный IPsec (безопасность IP).

source: Simplified header structure.
ru: Упрощённая структура заголовка.

source: Support for mobile IP.
ru: Поддержка мобильного IP.

source: IPv6-to-IPv4 transition mechanisms.
ru: Механизмы перехода с IPv6 на IPv4.

source: FreeBSD includes the http://www.kame.net/[KAME project] IPv6 reference implementation and comes with everything needed to use IPv6.
ru: FreeBSD включает в себя эталонную реализацию IPv6 от http://www.kame.net/[проекта KAME] и поставляется со всем необходимым для работы с IPv6.

source: This section focuses on getting IPv6 configured and running.
ru: Этот раздел посвящён настройке и запуску IPv6.

source: There are three different types of IPv6 addresses:
ru: Существует три различных типа IPv6-адресов:

source: A packet sent to a unicast address arrives at the interface belonging to the address.
ru: Пакет, отправленный на одноадресный (unicast) адрес, поступает на интерфейс, принадлежащий этому адресу.

source: These addresses are syntactically indistinguishable from unicast addresses but they address a group of interfaces. The packet destined for an anycast address will arrive at the nearest interface.
ru: Эти адреса синтаксически неотличимы от одноадресных, но они обозначают группу интерфейсов. Пакет, предназначенный для адреса anycast, будет доставлен на ближайший интерфейс.

source: These addresses identify a group of interfaces. A packet destined for a multicast address will arrive at all interfaces belonging to the multicast group. The IPv4 broadcast address, usually `xxx.xxx.xxx.255`, is expressed by multicast addresses in IPv6.
ru: Эти адреса идентифицируют группу интерфейсов. Пакет, предназначенный для multicast-адреса, будет доставлен на все интерфейсы, входящие в multicast-группу. IPv4 широковещательный адрес, обычно `xxx.xxx.xxx.255`, в IPv6 выражается через multicast-адреса.

source: When reading an IPv6 address, the canonical form is represented as `x:x:x:x:x:x:x:x`, where each `x` represents a 16 bit hex value. An example is `FEBC:A574:382B:23C1:AA49:4592:4EFE:9982`.
ru: При чтении IPv6-адреса каноническая форма представляется как `x:x:x:x:x:x:x:x`, где каждый `x` соответствует 16-битному шестнадцатеричному значению. Пример: `FEBC:A574:382B:23C1:AA49:4592:4EFE:9982`.

source: Often, an address will have long substrings of all zeros. A `::` (double colon) can be used to replace one substring per address. Also, up to three leading ``0``s per hex value can be omitted. For example, `fe80::1` corresponds to the canonical form `fe80:0000:0000:0000:0000:0000:0000:0001`.
ru: Часто в адресе встречаются длинные последовательности нулей. Для замены одной такой последовательности в адресе можно использовать `::` (двойное двоеточие). Кроме того, в каждом шестнадцатеричном числе можно опустить до трёх ведущих нулей. Например, `fe80::1` соответствует канонической форме `fe80:0000:0000:0000:0000:0000:0000:0001`.

source: A third form is to write the last 32 bits using the well known IPv4 notation. For example, `2002::10.0.0.1` corresponds to the hexadecimal canonical representation `2002:0000:0000:0000:0000:0000:0a00:0001`, which in turn is equivalent to `2002::a00:1`.
ru: Третья форма записи — указание последних 32 битов в известной IPv4 нотации. Например, `2002::10.0.0.1` соответствует шестнадцатеричной канонической записи `2002:0000:0000:0000:0000:0000:0a00:0001`, которая, в свою очередь, эквивалентна `2002::a00:1`.

source: To view a FreeBSD system's IPv6 address execute the following command:
ru: Чтобы просмотреть IPv6-адрес системы FreeBSD, выполните следующую команду:

source: In this example, the `em0` interface is using `fe80::21f:16ff:fe0f:275a%em0`, an auto-configured link-local address which was automatically generated from the MAC address.
ru: В этом примере интерфейс `em0` использует `fe80::21f:16ff:fe0f:275a%em0` — автоматически сконфигурированный link-local адрес, который был автоматически сгенерирован из MAC-адреса.

source: Some IPv6 addresses are reserved. A list of reserved addresses can be checked in the following table:
ru: Некоторые IPv6-адреса зарезервированы. Список зарезервированных адресов можно посмотреть в следующей таблице:

source: Example IPv6 Reserved Addresses
ru: Пример зарезервированных адресов IPv6

source: Description
ru: Описание

source: Notes
ru: Заметки

source: unspecified
ru: не указано

source: Equivalent to `0.0.0.0` in IPv4.
ru: Эквивалентно `0.0.0.0` в IPv4.

source: loopback address
ru: loopback-адрес (адрес обратной петли)

source: Equivalent to `127.0.0.1` in IPv4.
ru: Эквивалент `127.0.0.1` в IPv4.

source: IPv4 mapped IPv6 address
ru: IPv4-отображенный IPv6-адрес

source: The lower 32 bits are the IPv4 address for compatibility with IPv4 hosts and routers.
ru: Младшие 32 бита представляют IPv4-адрес для совместимости с хостами и маршрутизаторами, поддерживающих только IPv4.

source: Equivalent to 169.254.0.0/16 in IPv4.
ru: Эквивалентно 169.254.0.0/16 в IPv4.

source: Unique local addresses are intended for local communication and are only routable within a set of cooperating sites.
ru: Уникальные локальные адреса предназначены для локального взаимодействия и доступны для маршрутизации только в пределах группы взаимодействующих сайтов.

source: All global unicast addresses are assigned from this pool. The first 3 bits are `001`.
ru: Все глобальные одноадресные адреса выделяются из этого пула. Первые 3 бита имеют значение `001`.

source: IPv6 address prefix for use in documentation.
ru: Адресный префикс IPv6 для использования в документации.

source: For further information on the structure of IPv6 addresses, refer to http://www.ietf.org/rfc/rfc4291.txt[RFC4291].
ru: Для получения дополнительной информации о структуре IPv6-адресов обратитесь к http://www.ietf.org/rfc/rfc4291.txt[RFC4291].

source: Configuring Static IPv6 Address
ru: Настройка статического IPv6-адреса

source: To configure a FreeBSD system as an IPv6 client with a static IPv6 address it is necessary to set the IPv6 address.
ru: Для настройки системы FreeBSD в качестве IPv6-клиента со статическим IPv6-адресом необходимо установить IPv6-адрес.

source: Execute the following commands to meet the requirements:
ru: Выполните следующие команды для выполнения требований:

source: To assign a default router, specify its address executing the following command:
ru: Чтобы назначить маршрутизатор по умолчанию, укажите его адрес, выполнив следующую команду:

source: To configure an additional IPv6 anycast address, specify the anycast address as an `_aliasN`, as specified in man:rc.conf[5], followed by the `anycast` option:
ru: Для настройки дополнительного IPv6 anycast-адреса укажите адрес anycast как `_aliasN`(указано в man:rc.conf[5]) с добавлением опции `anycast`:

source: Keep in mind that the applications can't bind to anycast addresses; in that case you need to use an alias address instead.
ru: Имейте в виду, что приложения не могут привязываться к anycast-адресам; в этом случае необходимо использовать алиас-адрес.

source: Configuring Dynamic IPv6 Address
ru: Настройка динамического адреса IPv6

source: To dynamically configure the IPv6 address of the interface using crossref:glossary[slaac-glossary,SLAAC], execute the following commands:
ru: Для динамической настройки IPv6-адреса интерфейса с использованием crossref:glossary[slaac-glossary,SLAAC], выполните следующие команды:

source: Note that when IPv6 packet forwarding is enabled (i.e., `ipv6_gateway_enable=YES`), the system will not configure a SLAAC address unless the `net.inet6.ip6.rfc6204w3` man:sysctl[8] variable is set to 1.
ru: Обратите внимание, что при включённой IPv6-маршрутизации (т.е. `ipv6_gateway_enable=YES`), система не будет настраивать SLAAC-адрес, если переменная man:sysctl[8] `net.inet6.ip6.rfc6204w3` не установлена в 1.

source: Router Advertisement and Host Auto Configuration
ru: Объявление маршрутизатора и автонастройка хоста

source: This section demonstrates how to setup man:rtadvd[8] on an IPv6 router to advertise the IPv6 network prefix and default route.
ru: Этот раздел демонстрирует, как настроить man:rtadvd[8] на IPv6-маршрутизаторе для объявления префикса IPv6-сети и маршрута по умолчанию.

source: To enable man:rtadvd[8], execute the following command:
ru: Чтобы включить man:rtadvd[8], выполните следующую команду:

source: It is important to specify the interface on which to do IPv6 router advertisement. For example, to tell man:rtadvd[8] to use `em0`:
ru: Важно указать интерфейс, на котором будет выполняться IPv6-анонсирование маршрутизатора. Например, чтобы указать man:rtadvd[8] использовать `em0`:
