Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/books/handbook/network/_index.po
Languages: ru

source: Next, create the configuration file, [.filename]#/etc/rtadvd.conf# as seen in this example:
ru: Далее создайте файл конфигурации [.filename]#/etc/rtadvd.conf#, как показано в этом примере:

source: Replace `em0` with the interface to be used and `2001:db8:1f11:246::` with the prefix of the allocation.
ru: Замените `em0` на используемый интерфейс и `2001:db8:1f11:246::` на префикс выделенного диапазона.

source: For a dedicated `/64` subnet, nothing else needs to be changed. Otherwise, change the `prefixlen#` to the correct value.
ru: Для выделенной подсети `/64` больше ничего менять не нужно. В противном случае измените значение `prefixlen#` на соответствующее.

source: IPv6 and IPv4 Address mapping
ru: Соответствие адресов IPv6 и IPv4

source: When IPv6 is enabled on a server, there may be a need to enable IPv4 mapped IPv6 address communication. This compatibility option allows for IPv4 addresses to be represented as IPv6 addresses. Permitting IPv6 applications to communicate with IPv4 and vice versa may be a security issue.
ru: Когда на сервере включен IPv6, может возникнуть необходимость разрешить использование IPv4-отображенных IPv6-адресов. Эта опция совместимости позволяет представлять IPv4-адреса в виде IPv6-адресов. Разрешение IPv6-приложениям взаимодействовать с IPv4 и наоборот может представлять угрозу безопасности.

source: This option may not be required in most cases and is available only for compatibility. This option will allow IPv6-only applications to work with IPv4 in a dual stack environment. This is most useful for third party applications which may not support an IPv6-only environment.
ru: Эта опция может не требоваться в большинстве случаев и доступна только для совместимости. Она позволит IPv6-приложениям работать с IPv4 в двухстековой среде. Это особенно полезно для сторонних приложений, которые могут не поддерживать IPv6-окружение.

source: To enable this feature execute the following command:
ru: Для включения этой функции выполните следующую команду:

source: Wireless Networks
ru: Беспроводные сети

source: Most wireless networks are based on the link:https://en.wikipedia.org/wiki/IEEE_802.11[IEEE(R) 802.11 standards].
ru: Большинство беспроводных сетей основаны на стандартах link:https://en.wikipedia.org/wiki/IEEE_802.11[IEEE(R) 802.11].

source: FreeBSD supports networks that operate using link:https://en.wikipedia.org/wiki/IEEE_802.11a-1999[802.11a], link:https://en.wikipedia.org/wiki/IEEE_802.11b-1999[802.11b], link:https://en.wikipedia.org/wiki/IEEE_802.11g-2003[802.11g] and link:https://en.wikipedia.org/wiki/IEEE_802.11n-2009[802.11n].
ru: FreeBSD поддерживает сети, работающие по стандартам link:https://en.wikipedia.org/wiki/IEEE_802.11a-1999[802.11a], link:https://en.wikipedia.org/wiki/IEEE_802.11b-1999[802.11b], link:https://en.wikipedia.org/wiki/IEEE_802.11g-2003[802.11g] и link:https://en.wikipedia.org/wiki/IEEE_802.11n-2009[802.11n].

source: link:https://en.wikipedia.org/wiki/IEEE_802.11ac-2013[802.11ac] support on FreeBSD is currently under development.
ru: link:https://en.wikipedia.org/wiki/IEEE_802.11ac-2013[802.11ac] поддержка в FreeBSD в настоящее время находится в стадии разработки.

source: A basic wireless network consists of multiple stations communicating with radios that broadcast in either the 2.4GHz or 5GHz band, though this varies according to the locale and is also changing to enable communication in the 2.3GHz and 4.9GHz ranges.
ru: Базовая беспроводная сеть состоит из нескольких станций, взаимодействующих через радиомодули, работающие в диапазоне 2,4 ГГц или 5 ГГц, хотя это может различаться в зависимости от региона и также меняется для обеспечения связи в диапазонах 2,3 ГГц и 4,9 ГГц.

source: There are three basic steps to configure a wireless network:
ru: Настройка беспроводной сети включает три основных этапа:

source: Scan and select an access point
ru: Сканировать и выбрать точку доступа

source: Authenticate the station
ru: Аутентификация станции

source: Configure an IP address or use DHCP.
ru: Настройте IP-адрес или используйте DHCP.

source: The following sections discuss each step.
ru: Следующие разделы описывают каждый шаг.

source: Quick Start to Connect to a Wireless Network
ru: Быстрое начало работы: подключение к беспроводной сети

source: Connecting FreeBSD to an existing wireless network is a very common situation.
ru: Подключение FreeBSD к существующей беспроводной сети — весьма распространённая ситуация.

source: This Quick Start procedure shows the steps required to connect to a network using basic authentication. A more detailed procedure is given in the next section.
ru: Эта процедура быстрого старта показывает шаги, необходимые для подключения к сети с использованием базовой аутентификации. Более подробная процедура приведена в следующем разделе.

source: The first step is to obtain the Service Set Identifier (SSID) and Pre-Shared Key (PSK) for the wireless network from the network administrator.
ru: Первый шаг — получить Service Set Identifier (SSID) и Pre-Shared Key (PSK) для беспроводной сети у администратора сети.

source: The second step is to add an entry for this network to [.filename]#/etc/wpa_supplicant.conf#.
ru: Второй шаг — добавить запись для этой сети в файл [.filename]#/etc/wpa_supplicant.conf#.

source: If the file does not exist, create it. Consult man:wpa_supplicant.conf[5] for details on formatting entries in this file.
ru: Если файл не существует, создайте его. Подробности о форматировании записей в этом файле см. в man:wpa_supplicant.conf[5].

source: Is the SSID of the wireless network. Replace it with the name of the wireless network.
ru: Это SSID беспроводной сети. Замените его на имя беспроводной сети.

source: Is the PSK of the wireless network. Replace it with the password of the wireless network.
ru: Это PSK беспроводной сети. Замените его на пароль от беспроводной сети.

source: The third step is to add the network interface entry to configure the network on startup. Obtain the network device interface by using the sysctl `net.wlan.devices`. In the listing below, the output of this sysctl shows the network device interface is "iwn0".
ru: Третий шаг — добавить запись о сетевом интерфейсе для настройки сети при загрузке. Получите имя сетевого интерфейса с помощью sysctl `net.wlan.devices`. В приведённом ниже примере вывод этой команды показывает, что сетевым интерфейсом является "iwn0".

source: In the sysrc line that follows, replace "iwn0" with the output of the sysctl command if needed.
ru: В следующей строке с командой sysrc замените "iwn0" на вывод команды sysctl, если это необходимо.

source: And the last step is to restart the `netif` service executing the following command:
ru: И последний шаг — перезапуск службы `netif` выполнением следующей команды:

source: Basic Wireless Configuration
ru: Базовая настройка беспроводной сети

source: This section provides a more detailed example of configuring a wireless network card. To find out what wireless network cards are in the system check the section crossref:network[config-identify-network-adapter, Identify Network Adapters].
ru: Эта секция предоставляет детальный пример настройки беспроводной сетевой карты. Чтобы узнать, какие беспроводные сетевые карты есть в системе, ознакомьтесь с разделом crossref:network[config-identify-network-adapter, Идентификация сетевых адаптеров].

source: Since the regulatory situation is different in various parts of the world, it is necessary to correctly set the domains that apply to your location to have the correct information about what channels can be used.
ru: Поскольку нормативные требования различаются в разных частях мира, необходимо правильно настроить домены, соответствующие вашему местоположению, чтобы получить корректную информацию о доступных каналах.

source: The available region definitions can be found in [.filename]#/etc/regdomain.xml#. To set the data at runtime, use `ifconfig`:
ru: Доступные определения регионов можно найти в [.filename]#/etc/regdomain.xml#. Для установки данных во время выполнения используйте `ifconfig`:

source: To persist the settings, add it to [.filename]#/etc/rc.conf#:
ru: Чтобы сохранить настройки, добавьте их в [.filename]#/etc/rc.conf#:

source: Scan Wireless Networks
ru: Сканирование беспроводных сетей

source: Available wireless networks can be scanned using man:ifconfig[8].
ru: Доступные беспроводные сети можно просканировать с помощью man:ifconfig[8].

source: To list the wireless networks execute the following command:
ru: Для вывода списка беспроводных сетей выполните следующую команду:

source: SSID/MESH ID identifies the name of the network.
ru: SSID/MESH ID идентифицирует название сети.

source: BSSID identifies the MAC address of the access point.
ru: BSSID идентифицирует MAC-адрес точки доступа.

source: CAPS field identifies the type of each network and the capabilities of the stations operating there (see the definition of `list scan` in man:ifconfig[8] for more details).
ru: Поле `CAPS` определяет тип каждой сети и возможности работающих в ней станций (подробности см. в определении `list scan` в man:ifconfig[8]).

source: Connection and Authentication to a Wireless Network
ru: Подключение и аутентификация в беспроводной сети

source: Once a wireless network has been selected from the list of scanned networks, it is necessary to perform the connection and the authentication. In the vast majority of wireless networks, authentication is done with a password configured in the router. Other schemes require cryptographic handshakes to be completed before data traffic can flow, either using pre-shared keys or secrets, or more complex schemes that involve backend services such as RADIUS.
ru: После выбора беспроводной сети из списка обнаруженных необходимо выполнить подключение и аутентификацию. В подавляющем большинстве беспроводных сетей аутентификация осуществляется с помощью пароля, настроенного в маршрутизаторе. Другие схемы требуют выполнения криптографического рукопожатия перед началом передачи данных, используя либо предварительно распределённые ключи или секреты, либо более сложные схемы, включающие серверные службы, такие как RADIUS.

source: Authenticate with WPA2/WPA/Personal
ru: Аутентификация с WPA2/WPA/Personal

source: The authentication process in a wireless network is managed by man:wpa_supplicant[8].
ru: Процесс аутентификации в беспроводной сети управляется с помощью man:wpa_supplicant[8].

source: The man:wpa_supplicant[8] configuration will be made in the [.filename]#/etc/wpa_supplicant.conf# file. For more information, see man:wpa_supplicant.conf[5].
ru: Конфигурация man:wpa_supplicant[8] задаётся в файле [.filename]#/etc/wpa_supplicant.conf#. Подробнее см. man:wpa_supplicant.conf[5].

source: Once the scanning of the wireless networks has been carried out, a network has been chosen and have the password (PSK), that information will be added to the file [.filename]#/etc/wpa_supplicant.conf# as in the following example:
ru: После завершения сканирования беспроводных сетей, выбора сети и получения пароля (PSK), эта информация будет добавлена в файл [.filename]#/etc/wpa_supplicant.conf#, как показано в следующем примере:

source: SSID scan technique. Only need to use this option if the network is hidden.
ru: Метод сканирования SSID. Используйте эту опцию только если сеть скрыта.

source: Network name.
ru: Имя сети.

source: Password of the wireless network.
ru: Пароль беспроводной сети.

source: The next step will be to configure the wireless connection in the file [.filename]#/etc/rc.conf#.
ru: Следующим шагом будет настройка беспроводного соединения в файле [.filename]#/etc/rc.conf#.

source: To use a static address it will be necessary to execute the following command:
ru: Для использования статического адреса необходимо выполнить следующую команду:

source: To use a dynamic address it will be necessary to execute the following command:
ru: Для использования динамического адреса необходимо выполнить следующую команду:

source: Then restart the network executing the following command:
ru: Затем перезапустите сеть, выполнив следующую команду:

source: More information on how to perform more advanced methods of authentication can be obtained at crossref:advanced-networking[network-advanced-wireless,"Wireless Advanced Authentication"].
ru: Дополнительная информация о более сложных методах аутентификации доступна в crossref:advanced-networking[network-advanced-wireless,"Расширенная аутентификация беспроводных сетей"].

source: Authenticate with Open Networks
ru: Аутентификация в открытых сетях

source: It is important that the user is *very* careful when connecting to open networks without any kind of authentication.
ru: Важно, чтобы пользователь был *очень* осторожен при подключении к открытым сетям без какой-либо аутентификации.

source: Once the wireless network scan is done and the SSID of the wireless network is selected, execute the following command:
ru: После завершения сканирования беспроводной сети и выбора SSID выполните следующую команду:

source: And then execute man:dhclient[8] to get the address configured:
ru: Затем выполните man:dhclient[8], чтобы настроить адрес:

source: Using Both Wired and Wireless Connections
ru: Использование проводного и беспроводного подключений одновременно

source: A wired connection provides better performance and reliability, while a wireless connection provides flexibility and mobility. Laptop users typically want to roam seamlessly between the two types of connections.
ru: Проводное соединение обеспечивает лучшую производительность и надежность, тогда как беспроводное соединение предоставляет гибкость и мобильность. Пользователи ноутбуков, как правило, хотят свободно переключаться между этими двумя типами соединений.

source: On FreeBSD, it is possible to combine two or even more network interfaces together in a "failover" fashion. This type of configuration uses the most preferred and available connection from a group of network interfaces, and the operating system switches automatically when the link state changes.
ru: На FreeBSD можно объединить два или более сетевых интерфейса в режиме "отказоустойчивости". Такой тип конфигурации использует наиболее предпочтительное и доступное соединение из группы сетевых интерфейсов, а операционная система автоматически переключается при изменении состояния канала.

source: Link aggregation and failover is covered in crossref:advanced-networking[network-aggregation,"Link Aggregation and Failover"] and an example for using both wired and wireless connections is provided at crossref:advanced-networking[networking-lagg-wired-and-wireless,"Failover Mode Between Ethernet and Wireless Interfaces"].
ru: Агрегация и отказоустойчивость каналов описаны в crossref:advanced-networking[network-aggregation,"Агрегация и отказоустойчивость каналов"], а пример использования как проводных, так и беспроводных соединений приведен в crossref:advanced-networking[networking-lagg-wired-and-wireless,"Режим отказоустойчивости между проводными и беспроводными интерфейсами"].

source: Hostname
ru: Имя сайта

source: The hostname represents the fully qualified domain name (FQDN) of the host on the network.
ru: Имя хоста представляет собой полностью определённое доменное имя (FQDN) хоста в сети.

source: If no hostname is set for the host, FreeBSD will call itself `Amnesiac`.
ru: Если для хоста не задано имя, FreeBSD назовет себя `Amnesiac`.

source: Check The Current Hostname
ru: Проверить текущее имя хоста

source: man:hostname[1] can be used to check the current hostname:
ru: man:hostname[1] может использоваться для проверки текущего имени хоста:

source: Change Hostname
ru: Изменить имя хоста

source: To change the hostname of the host and persist it across reboots execute the following command:
ru: Для изменения имени хоста с сохранением после перезагрузки выполните следующую команду:

source: The DNS could be understood as a link:https://en.wikipedia.org/wiki/Telephone_directory[telephone directory] in which an IP is identified to a hostname and vice versa.
ru: DNS можно представить как link:https://en.wikipedia.org/wiki/Telephone_directory[телефонный справочник], в котором IP-адрес сопоставляется с именем хоста и наоборот.

source: There are three files that handle how a FreeBSD system interact with the DNS. These three files are man:hosts[5], man:resolv.conf[5] and man:nsswitch.conf[5]
ru: Существует три файла, которые управляют взаимодействием системы FreeBSD с DNS. Эти три файла: man:hosts[5], man:resolv.conf[5] и man:nsswitch.conf[5]

source: Unless otherwise stated in the [.filename]#/etc/nsswitch.conf# file, FreeBSD will look at the addresses in the [.filename]#/etc/hosts# file and then the DNS information in the [.filename]#/etc/resolv.conf# file.
ru: Если иное не указано в файле [.filename]#/etc/nsswitch.conf#, FreeBSD сначала проверит адреса в файле [.filename]#/etc/hosts#, а затем DNS-информацию в файле [.filename]#/etc/resolv.conf#.

source: The man:nsswitch.conf[5] file specifies how the nsdispatch (name-service switch dispatcher) should operate.
ru: Файл man:nsswitch.conf[5] определяет, как должен работать nsdispatch (диспетчер переключения службы имен).

source: By default, the hosts section of the [.filename]#/etc/nsswitch.conf# file will be as follows:
ru: По умолчанию раздел hosts в файле [.filename]#/etc/nsswitch.conf# будет выглядеть следующим образом:

source: For example, in case of using the man:nscd[8] service. The order of preference could be changed by leaving the line as follows:
ru: Например, в случае использования службы man:nscd[8]. Порядок предпочтения можно изменить, оставив строку следующей:

source: Local addresses
ru: Локальные адреса

source: The [.filename]#/etc/hosts# file is a simple text database who provide host name to IP address mappings. Entries for local computers connected via a LAN can be added to this file for simplistic naming purposes instead of setting up a DNS server. Additionally, [.filename]#/etc/hosts# can be used to provide a local record of Internet names, reducing the need to query external DNS servers for commonly accessed names.
ru: Файл [.filename]#/etc/hosts# представляет собой простую текстовую базу данных, которая сопоставляет имена хостов с IP-адресами. В него можно добавить записи для локальных компьютеров, подключенных через LAN, чтобы использовать простые имена вместо настройки DNS-сервера. Кроме того, [.filename]#/etc/hosts# может использоваться для хранения локальных записей интернет-имен, что уменьшает необходимость запрашивать внешние DNS-серверы для часто используемых имен.

source: For example, in the case of having a local instance of package:www/gitlab-ce[] in a local environment, it could be added as follows to the file [.filename]#/etc/hosts#:
ru: Например, если в локальной среде имеется локальный экземпляр package:www/gitlab-ce[], его можно добавить следующим образом в файл [.filename]#/etc/hosts#:

source: Configuring the Nameserver
ru: Настройка сервера имен

source: How a FreeBSD system accesses the Internet Domain Name System (DNS) is controlled by man:resolv.conf[5].
ru: Как система FreeBSD обращается к системе доменных имен (DNS) в Интернете, управляется с помощью man:resolv.conf[5].

source: The most common entries to [.filename]#/etc/resolv.conf# are:
ru: Наиболее распространённые записи в [.filename]#/etc/resolv.conf#:

source: The IP address of a name server the resolver should query. The servers are queried in the order listed with a maximum of three.
ru: IP-адрес сервера имен, к которому должен обращаться резолвер. Серверы опрашиваются в указанном порядке, максимум три.

source: Search list for hostname lookup. This is normally determined by the domain of the local hostname.
ru: Список поиска для разрешения имён хостов. Обычно определяется доменом локального имени хоста.

source: The local domain name.
ru: Локальное доменное имя.

source: A typical [.filename]#/etc/resolv.conf# looks like this:
ru: Типичный файл [.filename]#/etc/resolv.conf# выглядит следующим образом:

source: Only one of the `search` and `domain` options should be used.
ru: Должна использоваться только одна из опций — `search` или `domain`.

source: When using DHCP, man:dhclient[8] usually rewrites [.filename]#/etc/resolv.conf# with information received from the DHCP server.
ru: При использовании DHCP man:dhclient[8] обычно перезаписывает [.filename]#/etc/resolv.conf# информацией, полученной от DHCP-сервера.

source: If the machine in which the configuration is being made is *not* a DNS server, man:local-unbound[8] can be used to improve DNS lookup performance.
ru: Если машина, в которой производится настройка, *не* является DNS-сервером, для улучшения производительности DNS-запросов можно использовать man:local-unbound[8].

source: To enable it at boot time execute the following command:
ru: Чтобы включить его при загрузке, выполните следующую команду:

source: To start the man:local-unbound[8] service execute the following command:
ru: Чтобы запустить службу man:local-unbound[8], выполните следующую команду:

source: Troubleshooting
ru: Устранение неполадок

source: When troubleshooting hardware and software configurations, check the simple things first.
ru: При устранении неполадок в конфигурации оборудования и программного обеспечения сначала проверяйте самые простые вещи.

source: Is the network cable plugged in?
ru: Вставлен ли сетевой кабель?

source: Are the network services properly configured?
ru: Правильно ли настроены сетевые службы?

source: Is the firewall configured correctly?
ru: Настроен ли межсетевой экран правильно?

source: Is the NIC supported by FreeBSD?
ru: Поддерживается ли сетевая карта (NIC) в FreeBSD?

source: Is the router working correctly?
ru: Работает ли маршрутизатор правильно?

source: Before sending a bug report, always check the Hardware Notes in the link:https://www.freebsd.org/releases/[FreeBSD release page], update the version of FreeBSD to the latest STABLE version, check the mailing list archives, and search the Internet.
ru: Прежде чем отправить отчёт об ошибке, всегда проверяйте раздел "Аппаратные требования" на странице link:https://www.freebsd.org/releases/[релиза FreeBSD], обновите версию FreeBSD до последней STABLE версии, проверьте архивы списков рассылки и выполните поиск в Интернете.

source: Troubleshooting in Wired Networks
ru: Устранение неполадок в проводных сетях

source: If the card works, yet performance is poor, read through man:tuning[7]. Also, check the network configuration as incorrect network settings can cause slow connections.
ru: Если карта работает, но производительность низкая, ознакомьтесь с man:tuning[7]. Также проверьте настройки сети, так как неправильные параметры могут быть причиной медленного соединения.

source: `No route to host` messages occur if the system is unable to route a packet to the destination host. This can happen if no default route is specified or if a cable is unplugged. Check the output of `netstat -rn` and make sure there is a valid route to the host. If there is not, read crossref:advanced-networking[network-routing,"Gateways and Routes"].
ru: Сообщения `No route to host` возникают, если система не может найти маршрут для пакета до целевого хоста. Это может произойти, если не указан маршрут по умолчанию или если кабель отключен. Проверьте вывод команды `netstat -rn` и убедитесь, что существует действительный маршрут до хоста. Если его нет, ознакомьтесь с разделом crossref:advanced-networking[network-routing,"Шлюзы и маршруты"].
