freebsd/freebsd-doc/documentation/manual-pages/ja/man1/whereis.1
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Copyright 2002	Joerg Wunsch
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)whereis.1	8.2 (Berkeley) 12/30/93
.\" %FreeBSD: src/usr.bin/whereis/whereis.1,v 1.22 2004/07/02 22:22:34 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd August 22, 2002
.Dt WHEREIS 1
.Os
.Sh 名称
.Nm whereis
.Nd プログラムのパスを表示します
.Sh 書式
.Nm
.Op Fl abmqsux
.Op Fl BMS Ar dir ... Fl f
.Ar program ...
.Sh 解説
.Nm
は標準のバイナリディレクトリやマニュアルページそして、特定のプログラム
のソースファイルディレクトリを検索し、指定されたプログラムのパスが
見つかれば表示します。
与えられたプログラム名は、はじめにパス名部分が取り除かれ、
.Xr gzip 1
.Xr compress 1 ,
.Xr bzip2 1
のいずれかによる拡張子をひとつ削除し、
ソースコード制御システムのためのファイル名のはじめの
.Ql s.\&
や最後の
.Ql ,v
を外し、パス名にされます。
.Pp
検索されるディレクトリは
.Xr sysctl 8
に文字列
.Dq user.cs_path
を与えた時に返される文字列と
.Pa /usr/libexec ,
.Pa /usr/games
および現在のユーザの
.Ev $PATH
です。マニュアルは、デフォルトでは
.Ev $MANPATH
にしたがって検索されます。プログラムソースは、
.Pa /usr/src
や
.Pa /usr/ports
の全てのサブディレクトリを含む、標準の場所のリストにあるものとされます。
.Pp
以下のようなオプションが利用可能です。
.Bl -tag -width indent
.It Fl B
バイナリを検索するためのディレクトリを指定します。
.Fl f
オプションが必要です。
.It Fl M
マニュアルページを検索するためのディレクトリを指定します。
.Fl f
オプションが必要です。
.It Fl S
プログラムソースを検索するためのディレクトリを指定します。
.Fl f
オプションが必要です。
.It Fl a
要求された各タイプで最初に合致するものを報告する代りに、
合致するものすべてを報告します。
.It Fl b
バイナリを検索します。
.It Fl f
.Fl B ,
.Fl M ,
.Fl S
オプションが指定された後で、ディレクトリのリストの境界を設定し、
.Ar program
リストのはじめを指定します。
.It Fl m
マニュアルページを検索します。
.It Fl q
.Pq Dq 寡黙
。
通常の出力行の前に付くユーティリティ名の出力を抑制します。
シェルコマンド行のバッククォート置換で使うと便利かもしれません。
.Sx 使用例
を参照してください。
.It Fl s
ソースディレクトリを検索します。
.It Fl u
.Dq unusual
エントリを検索します。
ファイルは、要求されたそれぞれのタイプのエントリが少なくとも 1 個もない場合に
普通でない (unusual) といわれます。
普通でないエントリの名前だけが表示されます。
.It Fl x
ソースディレクトリを検索する際に、
.Dq 高価
なツールを使用しません。
通常は、ソースディレクトリリストのすべての第 1 階層のサブディレクトリを
検索しても見付からなかった場合、
.Nm
は代りに
.Xr locate 1
がエントリを見付けるように依頼します。
この処理はより長い時間を費しますので、
.Fl x
で無効化できます。
.El
.Sh 実行例
以下では、
.Pa /usr/bin
以下のドキュメントがない全てのユーティリティを見つけます。
.Dl whereis -m -u /usr/bin/*
.Pp
.Xr ls 1
のソースコードディレクトリに移動します。
.Pp
.Dl cd `whereis -sq ls`
.Pp
.Sh 関連項目
.Xr find ,
.Xr locate 1 ,
.Xr man 1 ,
.Xr which 1 ,
.Xr sysctl 8
.Sh 歴史
.Nm
ユーティリティは、
.Bx 3.0
で導入されました。この版は
.Bx 4.4
で失われた歴史的な機能を再実装しました。
.Sh 作者
.Nm
コマンドのこの実装は、
.An J\(:org Wunsch
が記述しました。
.Sh バグ
.Nm
ユーティリティのこの再実装は、歴史的バージョンのバグとは互換性がありません。
しかしながら、
.Fx 2.2
から
.Fx 4.5
の間に出荷されたバージョンとは互換であると信じられています。
.Pp
.Nm
ユーティリティは、
.Fl a
オプション指定時には、無関係なソースエントリを表示する場合があります。
