<!-- $Id: commercial.sgml,v 1.4 1998-12-29 02:00:05 jesusr Exp $ -->
<!-- The FreeBSD Documentation Spanish Project -->
  <sect>
    <heading>Aplicaciones Comerciales<label id="commercial"></heading>

    <p><bf/NOTA/ Esta secci&oacute;n est&aacute; todav&iacute;a poco 
    desarrollada, por lo que esperamos que las compa&ntilde;&iacute;as nos 
    ayuden a completarla :) . El grupo de FreeBSD no tiene ning&uacute;n 
    inter&eacute;s financiero en ninguna de las empresas aqu&iacute; listadas, 
    simplemente est&aacute;n como servicio p&uacute;blico (y creemos que el 
    inter&eacute;s comercial por FreeBSD puede tener efectos
    muy positivos en la viabilidad a largo t&eacute;rmino). Animamos a las
    empresas desarrolladoras de software que nos env&iacute;en su 
    informaci&oacute;n para ser incluidas en esta lista.

    <sect1>
      <heading>D&oacute;nde puedo obtener Motif para FreeBSD?</heading>

      <p>Contacta con <ref id="xig" name="Xi Graphics"> 
      para obtener uns distribuci&oacute;n de Motif 2.0 para FreeBSD

      <p>Esta distribuci&oacute;n incluye:
      <itemize>
         <item>OSF/Motif manager, xmbind, panner, wsm.

         <item>Kit de desarrollo con, mrm, xm, xmcxx, include y
         ficheros Imake.

         <item>Librer&iacute;as est&aacute;ticas y din&aacute;micas.

         <item>Applets demostrativos.

         <item>P&aacute;ginas man preformateadas.
      </itemize>

      <p>Asegurate de especificar que deseas la distribuci&oacute;n para FreeBSD
      cuando hagas el pedido. Tambi&eacute;n se distribuyen versiones para BSDI
      y Linux por <em>Xi Graphics</em>. Actualmente la distribuci&oacute;n 
      consta de cuatro diskettes. En un futuro pr&oacute;ximo, esto 
      cambiar&aacute; y se distribuir&aacute; un unico CD contentiendo las 
      distribuciones para todos los sistemas.

    <sect1>
      <heading>D&oacute;nde puedo conseguir CDE para FreeBSD?</heading>

      <p>Contacta con <ref id="xig" name="Xi Graphics"> para la
      distribucion CDE 1.0.10 para FreeBSD. Incluye Motif 1.2.5, 
      y puede ser usada con Motif 2.0.

      <p>Este es un CDROM unificado para FreeBSD y Linux.

    <sect1>
      <heading>Hay alg&uacute;n servidor X comercial de altas prestaciones?
      <label id="xig"></heading>

      <p>S&iacute;, <url url="http://www.xig.com" name="Xi Graphics"> vende
      su producto Accelerated-X para FreeBSD.

      <p>Este servidor X de altas prestaciones ofrece una f&aacute;cil
      configuraci&oacute;n, soporte para m&uacute;ltiples tarjetas de 
      v&iacute;deo concurrentes y se distribuye solo en forma binaria en un 
      paquete unificado que incluye el software para FreeBSD y Linux.

      <p>Hay una versi&oacute;n demo para testear.

      <descrip>
        <tag/Mas informaci&oacute;n/
        <url url="http://www.xig.com/" name="Xi Graphics WWW page">

        <tag/o/ <url url="mailto:sales@xig.com" name="Sales"> o
        <url url="mailto:support@xig.com" name="Support"> direcci&oacute;n de
        correo.

        <tag/o/ telefono (800) 946 7433  o +1 303 298-7478.
      </descrip>

    <sect1>
      <heading>Hay alg&uacute;n sistema de base de datos para FreeBSD?</heading>

      <p>S&iacute;! Conectic Software Systems ha portado su sistema de base de
      datos C/base y C/books para FreeBSD 2.0.5 y superiores, y Sleepycat
      Software vende una versi&oacute;n soportada comercialmente de la
      librer&iacute;a de base de datos DB.

      <descrip>
        <tag/Para mas informaci&oacute;n/
        <url url="http://www.conetic.com/" name="Conetic Software Systems">

        <tag/o mail/
        <url url="mailto:info@conetic.com" name="direcci&oacute;n de email de
        informaci&oacute;n">,

        <tag/y/
        <url url="http://www.sleepycat.com/" name = "Sleepycat Software">.
      </descrip>

  </sect>

