<!-- $Id: hardware.sgml,v 1.8 1999-05-31 13:01:05 jesusr Exp $ -->
<!-- The FreeBSD Documentation Spanish Project -->
  <sect>
    <heading>Compatibilidad hardware <label id="hardware"></heading>

    <sect1>
      <heading>&iquest;Qu&eacute; tipo de discos duros soporta FreeBSD?</heading>

      <p>FreeBSD soporta discos duros EIDE y SCSI (con controladoras
      compatibles; mira en la siguiente secci&oacute;n), y todos los discos
      usando el interface original "Western Digital" (MFM, RLL, ESDI y
      por supuesto IDE). Algunas controladoras ESDI que usan interfaces
      propietarios quiz&aacute;s no funcionen correctamente.

    <sect1>
      <heading>&iquest;Qu&eacute; controladoras SCSI est&aacute;n soportadas?</heading>

      <p>FreeBSD soporta las siguientes controladoras SCSI:

      <descrip>
        <tag/Adaptec/
          AH-1505 &lt;ISA&gt; <newline>
          AH-152x Series &lt;ISA&gt; <newline>
          AH-154x Series &lt;ISA&gt; <newline>
          AH-174x Series &lt;EISA&gt; <newline>
          Sound Blaster SCSI (AH-152x compat) &lt;ISA&gt; <newline>
          AH-2742/2842 Series &lt;ISA/EISA&gt; <newline>
          AH-2820/2822/2825 Series (Narrow/Twin/Wide) &lt;VLB&gt; <newline>
          AH-294x and aic7870 MB controllers (Narrow/Twin/Wide) &lt;PCI&gt;
          <newline>
          AH-394x (Narrow/Twin/Wide)

        <tag/Buslogic/
          BT-445 Series &lt;VLB&gt; <newline>
          BT-545 Series &lt;ISA&gt; <newline>
          BT-742 Series &lt;EISA&gt;<newline>
          BT-747 Series &lt;EISA&gt;<newline>
          BT-946 Series &lt;PCI&gt; <newline>
          BT-956 Series &lt;PCI&gt; <newline>

        <tag/Future Domain/
          TMC-950 Series &lt;ISA&gt; <newline>

        <tag/PCI Generic/
          NCR 53C81x based controllers &lt;PCI&gt; <newline>
          NCR 53C82x based controllers &lt;PCI&gt; <newline>
          NCR 53C860/75 based controllers &lt;PCI&gt; <newline>

        <tag/ProAudioSpectrum/
          Zilog 5380 based controllers &lt;ISA&gt; <newline>
          Trantor 130 based controllers &lt;ISA&gt; <newline>

        <tag/DTC/
          DTC 3290 EISA SCSI in AHA-154x emulation.<newline>

        <tag/Seagate/
          ST-01/02 Series &lt;ISA&gt;<newline>

        <tag/UltraStor/
          UH-14f Series &lt;ISA&gt;<newline>
          UH-24f Series &lt;EISA&gt; <newline>
          UH-34f Series &lt;VLB&gt;<newline>

        <tag/Western Digital/
          WD7000 &lt;ISA&gt; &lt;No scatter/gather&gt;
      </descrip>

    <sect1>
      <heading>&iquest;Qu&eacute; lectores CD-ROM soporta FreeBSD?</heading>

      <p>Cualquier disco SCSI conectado a una controladora soportada es
      soportado.

      <p>Los siguientes interfaces de CD-ROM propietarios son tambi&eacute;n
      soportados:

      <itemize>
        <item>Mitsumi LU002 (8bit), LU005 (16bit) and FX001D (16bit 2x Speed).
        <item>Sony CDU 31/33A<newline>
        <item>Sound Blaster Non-SCSI CD-ROM<newline>
        <item>Matsushita/Panasonic CD-ROM<newline>
        <item>ATAPI compatible IDE CD-ROMs<newline>
      </itemize>

      <p>Todas las tarjetas no SCSI son conocidas por ser extremadamente
      lentas comparadas con los discos SCSI, y algunos CDROM ATAPI quiz&aacute;s
      no funcionen correctamente.

      <p>A partir de la versi&oacute;n 2.2 de FreeBSD en CDROM de Walnut Creek 
      se soporta el arranque directo (boot) desde el propio CD.

    <sect1>
      <heading>&iquest;Soporta FreeBSD discos ZIP?</heading>

      <p>FreeBSD soporta los ZIP SCSI externos. Las unidades ZIP solo pueden
      funcionar en los ID's SCSI 5 y 6, pero si la BIOS de tu controladora
      lo soporta, puedes arrancar desde &eacute;l. No sabemos que controladoras
      dejan arrancar desde ID's diferentes de la 0 o 1... mira en tu
      documentaci&oacute;n y hazmelo saber si te funciona.

      <p>Los discos Zip ATAPI (IDE) son soportados en FreeBSD 2.2.6 y
      releases posteriores.

      <p>FreeBSD ha incluido el soporte de discos ZIP por puerto paralelo
      desde la versi&oacute;n 3.0. Si est&aacute;s usando una versi&oacute;n
      actualizada, debes asegurarte de que tu configuraci&oacute;n del kernel
      incluye los drivers <tt>scbus0</tt>, <tt>da0</tt>, <tt>ppbus0</tt> y
      <tt>vp0</tt> (el kernel GENERIC los contiene todos excepto vp0).
      Con todos estos drivers presentes, el disco por puerto paralelo
      deber&iacute;a estar disponible como /dev/da0s4. Los discos se pueden
      montar usando <tt>mount /dev/da0s4 /mnt</tt> o (para discos dos)
      <tt>mount_msdos /dev/da0s4 /mnt</tt>.

      <p>Tambi&eacute;n mira <ref id="jaz" name="en disco removibles">,
      y <ref id="disklabel" name="esta nota en 'formatting'">.

    <sect1>
      <heading>&iquest;Soporta FreeBSD JAZ, EZ y otros discos removibles?</heading>

      <p>Aparte de la versi&oacute;n IDE de EZ, todos estos son dispositivos
      SCSI, por lo que deber&iacute;an funcionar sin problemas ya que FreeBSD
      los toma como discos SCSI y el IDE EZ tambi&eacute;n deber&iacute;a 
      funcionar sin problemas ya que se toma como un disco IDE estandard.

      <p><label id="jaz">No estoy seguro de como soporta FreeBSD el cambio
      de soporte mientras est&aacute; funcionando. Deber&aacute;s, desde 
      luego, desmontar la unidad antes de poder cambiar el soporte, y estar 
      seguro de que todas las unidades externas est&aacute;n encendidas antes 
      de arrancar el ordenador con FreeBSD para que este pueda reconocerlas.

      <p>Mira <ref id="disklabel" name="esta nota en 'formatting'">.

    <sect1>
      <heading>&iquest;Qu&eacute; tarjetas serie multipuerto son soportadas por FreeBSD?</heading>

      <p>Hay una lista de ellas en la secci&oacute;n <htmlurl
      url="../../handbook/install.html#INSTALL-HW" name="dispositivos varios">
      del manual (handbook).

      <p>Algunas tarjetas "sin nombre" tambi&eacute;n han funcionado, 
      especialmente las que dicen ser compatibles AST.

      <p>Mira la p&aacute;gina 
      <htmlurl url="http://www.freebsd.org/cgi/man.cgi?sio"
      name="sio"> para obtener m&aacute;s informaci&oacute;n sobre la 
      configuraci&oacute;n de estas tarjetas.

    <sect1>
      <heading>Tengo un tipo de rat&oacute;n no habitual. &iquest;C&oacute;mo lo configuro?<label id="busmouse"></heading>

      <p>FreeBSD soporta el "bus mouse" y el "InPort bus mouse" de
      fabricantes como Microsoft, Logitech y ATI. El driver de mouse 
      esti&aacute; compilado en el GENERIC kernel (kernel por defecto que 
      carga el sistema). Si est&aacute;s haciendote un kernel a medida que 
      incluya el driver de rat&oacute;n, asegurate de a&ntilde;adir la 
      siguiente l&iacute;nea en el fichero de configuraci&oacute;n del kernel:

      <verb>
        device mse0 at isa? port 0x23c tty irq5 vector mseintr
      </verb>

    <sect1>
      <heading>&iquest;C&oacute;mo uso mi PS/2 (``mouse port'' o ``teclado'')?<label id="ps2mouse"></heading>

      <p>Si est&aacute;s usando una versi&oacute;n reciente de FreeBSD, el 
      driver necesario, psm, est&aacute; incluido y activado en el kernel. El 
      propio kernel deber&iacute;a detectar tu rat&oacute;n PS/2 en el momento 
      de arrancar.

      <p>Si est&aacute;s usando una versi&oacute;n antigua, solo tienes que 
      activarlo en la configuraci&oacute;n del kernel en el momento de la 
      instalaci&oacute;n del sistema. Si este ya est&aacute; instalado, 
      escribe -c en el prompt boot: y act&iacute;valo. Por defecto, este 
      driver est&aacute; desactivado.

      <p>Si est&aacute;s usando alguna de las versiones mas antiguas, tendras 
      que a&ntilde;adir la siguiente l&iacute;nea en el fichero de 
      configuraci&oacute;n del kernel y compilar uno nuevo:

      <verb>
        device psm0 at isa? port "IO_KBD" conflicts tty irq 12 vector psmintr
      </verb>

      <p>Mira la secci&oacute;n <url url="../../handbook/kernelconfig.html"
      name="configuracion del kernel"> si no tienes experiencia en la
      creaci&oacute;n de nuevos kernel.
         
      <p>Una vez el kernel detecta correctamente el dispositivo psm0 al
      arrancar, aseg&uacute;rate de que existe una entrada en /dev para este
      dispositivo. Puedes hacerlo tecleando:

      <verb>
        cd /dev; sh MAKEDEV psm0
      </verb>

    <sect1>
      <heading>&iquest;Es posible hacer uso del rat&oacute;n fuera de X Windows?<label id="moused"></heading>

      <p>Si est&aacute;s usando el driver por defecto de la c&oacute;nsola, 
      syscons, puedes usar el rat&oacute;n en las c&oacute;nsolas de texto 
      para realizar cut & paste. Ejecuta el demonio (daemon) de rat&oacute;n 
      moused y arranca el rat&oacute;n en la c&oacute;nsola virtual:

      <verb>
        moused -p /dev/xxxx -t yyyy 
        vidcontrol -m on
      </verb>

      <p>Donde <tt>xxxx</tt> es el nombre del dispositivo del rat&oacute;n y
       <tt>yyyy</tt> es un tipo de protocolo para el rat&oacute;n. Mira en
      <htmlurl url="http://www.freebsd.org/cgi/man.cgi?moused" name="moused">
      para saber los tipos de protocolo soportados.  

      <p>Si quieres ejecutar el demonio moused automaticamente al arrancar
      el sistema, fija las siguientes variables en <tt>/etc/sysconfig</tt>
      (para versi&oacute;n 2.2.1).

      <verb>
	mousedtype="yyyy"
	mousedport="xxxx"
	mousedflags=""
      </verb>

      En versiones 2.2.2 o superiores, fija las siguientes variables en
      <tt>/etc/rc.conf</tt>.

      <verb>
	moused_type="yyyy"
	moused_port="xxxx"
	moused_flags=""
      </verb>

      <p>A partir de la versi&oacute;n 2.2.6, el demonio del rat&oacute;n es 
      capaz de determinar automaticamente el protocolo correcto a utilizar. Solo
      tienes que especificar <tt>auto</tt> como el protocolo a usar.

      <p>Cuando el demonio de rat&oacute;n est&aacute; funcionando, el acceso 
      al rat&oacute;n necesita ser coordinado con otros programas como 
      X Window. Mira en <ref id="x-and-moused" name="esta secci&oacute;n"> 
      para mas informaci&oacute;n.

    <sect1>
      <heading>&iquest;C&oacute;mo hago un cut & paste con el rat&oacute;n en una c&oacute;nsola de texto?</heading>

      <p>Una vez tienes el demonio del rat&oacute;n funcionando (mira
      <ref id="moused" name="la secci&oacute;n anterior">, pulsa el 
      bot&oacute;n 1 (izquierdo) y mueve el rat&oacute;n para seleccionar la 
      regi&oacute;n de texto.
      A continuaci&oacute;n, pulsa el bot&oacute;n 2 (medio) o 3 (derecho) 
      para hacer un paste (pegar) de la regi&oacute;n seleccionada en el lugar 
      en el que tengamos situado el cursor.

      <p>En versiones 2.2.6 o superiores, pulsando el bot&oacute;n 2 hara un 
      paste del texto seleccionado. Pulsando el bot&oacute;n 3 extenderemos 
      la regi&oacute;n seleccionada de texto. Si tu rat&oacute;n no tiene el 
      bot&oacute;n medio, puedes emularlo o "remapear" (reconfigurar) los 
      botones de tu rat&oacute;n con las opciones del demonio moused. MIra en
      <htmlurl url="http://www.freebsd.org/cgi/man.cgi?moused" name="moused">
      para mas informaci&oacute;n.

    <sect1>
      <heading>Mi rat&oacute;n tiene una rueda de desplazamiento y botones. &iquest;Puedo usarlo?</heading>

      <p>La respuesta es, desafortunadamente, "depende". Estos ratones con
      caracter&iacute;sticas adicionales requieren en muchos casos drivers 
      propios y especializados. A no ser que el driver de dispositivo o el 
      programa de usuario tenga soporte espec&iacute;fico, el rat&oacute;n 
      se comportar&aacute; como un rat&oacute;n normal y corriente.

    <sect1>
      <heading>&iquest;C&oacute;mo uso el mouse/trackball/touchpad en mi port&aacute;til?</heading>

      <p>Por favor, <ref id="ps2mouse" name="mira en la respuesta
      anterior">.  Mira tambi&eacute;n <ref id="pao" name="esta nota"> en la
      secci&oacute;n de ordenadores port&aacute;tiles.

    <sect1>
      <heading>&iquest;Qu&eacute; tipo de dispositivos de cinta son soportados?</heading>

      <p>FreeBSD soporta SCSI, QIC-36 (con controladora QIC-02) y
      QIC-40/80.  Esto inclye dispositivos de 8mm (conocidos como Exabyte)
      y dispositivos DAT. Los QIC-40/80 son conocidos por ser lentos.

      <p>Algunos de los primeros dispositivos de 8mm no son totalmente
      compatibles con SCSI2 por lo que pueden no trabajar correctamente
      en FreeBSD.

    <sect1>
      <heading>&iquest;Soporta FreeBSD "tape changers"?</heading>

      <p>FreeBSD 2.2 soporta SCSI changers usando el dispositivo <htmlurl
      url="http://www.freebsd.org/cgi/man.cgi?ch(4)" name="ch"> y el comando
      <htmlurl url="http://www.freebsd.org/cgi/man.cgi?chio" name="chio">
      . Los comandos de como controlar el "changer" estan en el man
      <htmlurl url="http://www.freebsd.org/cgi/man.cgi?chio"
      name="chio">.

    <sect1>
      <heading>&iquest;Qu&eacute; tarjetas de sonido son soportadas por FreeBSD?</heading>

      <p>FreeBSD soporta las tarjetas SoundBlaster, SoundBlaster Pro,
      SoundBlaster 16, Pro Audio Spectrum 16, AdLib y Gravis Ultrasound.
      Hay tambi&eacute;n soporte limitado para la tarjeta MPU-401 y compatibles
      midi. Las tarjetas SoundBlaster 16 ASP todav&iacute;a no son soportadas. 
      El Microsoft Sound System s&iacute; est&aacute; soportado.

      <p><bf/NOTA/ Esto es solo para sonido!. Este driver no soporta
      CD-ROMs, SCSI o joysticks en estas tarjetas, a excepci&oacute;n de la
      SoundBlaster. El interface SCSI de SoundBlaster y algunos CD-ROMs
      no SCSI son soportados, pero no podr&aacute;s arrancar el sistema desde 
      ellos.

    <sect1>
      <heading>&iquest;Qu&eacute; tarjetas de red soporta FreeBSD?</heading>

      <p>Mira la secci&oacute;n de 
      <htmlurl url="../../handbook/install:nics.html"
      name="tarjetas Ethernet"> en el manual para una lista m&aacute;s completa.

      <descrip>
        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?de(4)"
        name="de"> driver/
        DEC DC21x40 and compatible PCI controllers<newline>
        (including 21140 100bT cards) <newline>

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?ed(4)"
        name="ed"> driver/ NE2000 and 1000<newline>
        WD/SMC 8003, 8013 and Elite Ultra (8216)<newline>
        3Com 3c503 <newline>
        HP 27247B and 27252A <newline>
        And clones of the above <newline>

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?le(4)"
        name="le"> driver/
        DEC EtherWORKS II and EtherWORKS III controllers. <newline>

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?ie(4)"
        name="ie"> driver/
        AT&amp;T EN100/StarLAN 10 <newline>
        3COM 3c507 Etherlink 16/TP<newline>
        NI5210 <newline>
        Intel EtherExpress <newline>

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?is(4)"
        name="is"> driver/
        Isolan AT 4141-0 <newline>
        Isolink 4110 <newline>

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?el(4)"
        name="el"> driver/
        3com 3c501 (does not support Multicast or DMA)

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?eg(4)"
        name="eg"> driver/
        3com 3c505 Etherlink/+

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?ze(4)"
        name="ze"> driver/
        IBM PCMCIA credit card adapter

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?lnc(4)"
        name="lnc"> drive/
        Lance/PCnet cards (Isolan, Novell NE2100, NE32-VL)(*)

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?ep(4)"
        name="ep"> driver/
        3com 3c509 (Must disable PNP support on card)

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?cx(4)"
        name="cx"> driver/
        Cronyx/Sigma multiport Sync/Async (Cisco and PPP framing)

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?zp(4)"
        name="zp"> driver/
        3Com PCMCIA Etherlink III (aka 3c589)(A-C only)

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?fea(4)"
        name="fea"> driver/
        DEC DEFEA EISA FDDI controller

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?fpa(4)"
        name="fpa"> driver/
        DEC DEFPA PCI FDDI controller

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?fe(4)"
        name="fe"> driver/
        Fujitsu MB86960A/MB86965A Ethernet cards
      </descrip>

      <p><bf/NOTA/      Los drivers marcados con (*) pueden tener problemas.

      <p><bf/NOTA/      3C598D NO esta soportada todav&iacute;a.

      <p><bf/NOTA/ FreeBSD tambi&eacute;n soporta TCP/IP sobre l&iacute;neas 
      paralelo.  En estos momentos, no somos compatibles con otras versiones, 
      pero esperamos corregirlo en un futuro cercano. Encontrar&aacute;s 
      m&aacute;s informaci&oacute;n sobre este tema en la p&aacute;gina man 
      de lp(4).

      <p><bf/NOTA/ Algunas de estas tarjetas requieren una partici&oacute;n DOS
      en el disco duro para ejecutar el programa de configuraci&oacute;n.

    <sect1>
      <heading>No tengo coprocesador matem&aacute;tico - &iquest;es malo?</heading>

      <p><tt /NOTA/ Esto solo afectar&aacute; a los ordenadores 
      386/486SX/486SLC.  El resto de los microprocesadores tienen un 
      coprocesador integrado.

      <p>En general, esto no causar&aacute; problemas, pero hay ciscunstancias 
      en las que podr&aacute;s echarlo de menos. Especialmente si trabajas en
      entorno X Window. Si puedes, te recomendamos que compres uno y lo
      instales en tu ordenador.

    <sect1>
      <heading>&iquest;Qu&eacute; otros dispositivos soporta FreeBSD 2.X?</heading>

      <p>Aqu&iacute; hay una lista de drivers que no se han podido catalogar en
      las categor&iacute;as anteriores.

      <descrip>
        <tag><tt/b004.c/</tag>
        Driver for B004 compatible Transputer boards <newline>

        <tag>``ctx'' driver</tag>
              Driver for CORTEX-I Frame grabber <newline>

        <tag>``gp'' driver</tag>
              Driver for National Instruments AT-GPIB and<newline>
              AT-GPIB/TNT boards

        <tag>``pca'' driver</tag>
              Driver for PC speakers to allow the playing of audio files

        <tag>``spigot'' driver</tag>
              Driver for the Creative Labs Video Spigot

        <tag><htmlurl url="http://www.freebsd.org/cgi/man.cgi?gsc(4)"
                name="gsc"> driver</tag>
              Driver for the Genuis GS-4500 Hand scanner

        <tag><htmlurl url="http://www.freebsd.org/cgi/man.cgi?joy(4)"
                name="joy"> driver</tag>
              Driver for a joystick

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?labpc(4)"
                name="labpc"> driver/
              Driver for National Instrument's Lab-PC and Lab-PC+

        <tag/``uart'' driver/
              Stand-alone 6850 UART for MIDI

        <tag/<htmlurl url="http://www.freebsd.org/cgi/man.cgi?psm(4)"
        name="psm"> driver/ PS/2 mouse port

        <tag><tt/tw.c/</tag>
        Driver for the X-10 POWERHOUSE <newline>
      </descrip>

    <sect1>
      <heading>&iquest;Soporta FreeBSD el "power management" en mi port&aacute;til?</heading>

      <p>FreeBSD soporta APM en algunas m&aacute;quinas. Por favor, mira en
      el fichero de configuraci&oacute;n del kernel <tt/LINT/ y busca la parabra
      <htmlurl url="http://www.freebsd.org/cgi/man.cgi?apm" name="APM">

    <sect1>
      <heading>Soluciones para problemas espec&iacute;ficos de hardware</heading>
      <p>Esta secci&oacute;n contiene soluiones para problemas especificos 
      encontrados por otros usuarios.
      <sect2>
       <heading>Sistemas Micron se cuelgan al arrancar</heading>
       <p>Algunas placas base Micron tienen una implementaci&oacute;n de PCI 
       en la BIOS que no es estandard, lo que provoca que FreeBSD no pueda 
       encontrar los dispositivos PCI en las direcciones en las que 
       deber&iacute;an estar.
       <p>Desactiva la opci&oacute;n "Plug and Play Operating System" en la BIOS
       para solucionar el problema. Puedes encontrar m&aacute;s 
       informaci&oacute;n en:
       <htmlurl
         url="http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron"
         name="http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron">
       </sect2>
    </sect1>

    <sect1>
      <heading>Tengo una de las controladoras Adaptec m&aacute;s nuevas y 
      FreeBSD no puede encontrarla</heading>

      <p>Las nuevas controladoras Adaptec con chipset de la serie AIC789x son 
      soportados bajo la nueva CAM SCSI que hace su debut en la version 3.0
      de FreeBSD. Los parches para las versiones 3.0-CURRENT y 2.2-STABLE
      est&aacute;n en:
      <url url="ftp://ftp.freebsd.org/pub/FreeBSD/development/cam/" 
      name="ftp://ftp.freebsd.org/pub/FreeBSD/development/cam/">.
      Un disco de arranque con soporte CAM est&aacute; disponible en:
      <url url="http://www.freebsd.org/ ~abial/cam-boot/"
      name="http://www.freebsd.org/~abial/cam-boot/">. En ambos casos lee el 
      fichero README antes de empezar.

    <sect1>
      <heading>Tengo un m&oacute;dem interno Plug & Play y FreeBSD no lo encuentra</heading>
   
      <p>Necesitar&aacute;s a&ntilde;adir el ID del modem PnP a la lista de ID 
      PnP en el driver serie. Para activar el soporte PnP, compila un nuevo 
      kernel con <tt/controller pnp0/ en el fichero de configuraci&oacute;n y 
      rebota el sistema. El kernel mostrar&aacute; por pantalla los IDs de 
      todos los dispositivos PnP que encuentre. Copia el ID del m&oacute;dem 
      en la tabla del fichero <tt>/sys/i386/isa/sio.c</tt>, sobre la 
      l&iacute;nea 1200. Busca la cadena "SUP1310" en la estructura 
      "siopnp_ids[]" para encontrar la tabla. Genera un nuevo kernel, 
      instalalo y rearranca. Tu m&oacute;dem deber&iacute;a ser encontrado.

      <p>Quiz&aacute;s tengas que configurar manualmente los dispositivos PnP 
      usando el comando "pnp" en la configuraci&oacute;n de arranque usandolo 
      de la siguiente manera:
   <verb>
   pnp 1 0 enable os irq0 3 drq0 0 port0 0x2f8
   </verb>

    <sect1>
      <heading>&iquest;C&oacute;mo obtengo el prompt "boot:" en una c&oacute;nsola serie?</heading>

      <p><enum>
      <item>Crea un nuevo kernel con <tt/options COMCONSOLE/.
      <item>Crea el fichero /boot.config y pon <tt/-P/ como &uacute;nico texto
      en el fichero.
      <item>Desconecta el teclado del ordenador.
      </enum></p>

      <p>Mira el fichero <tt>/usr/src/sys/i386/boot/biosboot/README.serial</tt>
      para mas informaci&oacute;n.

    <sect1>
      <heading>&iquest;Porqu&eacute; no funciona mi tarjeta de red PCI 3Com con mi 
      ordenador Micron?</heading>
      <p>>Algunas placas base Micron tienen una implementaci&oacute;n de PCI 
      en la BIOS que no es estandard, lo que provoca que FreeBSD no pueda 
      encontrar los dispositivos PCI en las direcciones en las que 
      deber&iacute;an estar.
      <p>Para solucionar el problema, desactiva la opci&oacute;n 
      "Plug and Play Operating System" en la BIOS.
      <p>Puedes encontrar m&aacute;s informaci&oacute;n sobre este problema en 
      <htmlurl
       url="http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron"
      name="http://cesdis.gsfc.nasa.gov/linux/drivers/vortex.html#micron">

    <sect1>
      <heading>&iquest;Soporta FreeBSD "Symmetric Multiproccessing (SMP)?</heading>
      <p>SMP est&aacute; soportado a partir de la versi&oacute;n 3.0-STABLE
  </sect>

