<!-- $Id: serial.sgml,v 1.7 1999-06-09 01:04:54 jesusr Exp $ -->
<!-- The FreeBSD Documentation Spanish Project -->
  <sect>
    <heading>Comunicaciones serie<label id="serial"></heading>

    <p>Esta secci&oacute;n responde las preguntas mas frecuentes sobre las
    comunicaciones serie con FreeBSD. PPP y SLIP se tratan en la
    secci&oacute;n <ref id="networking" name="Networking">.

    <sect1>
      <heading>&iquest;C&oacute;mo se si FreeBSD ha encontrado mis puertos serie?</heading>

      <p>Cuando el kernel de FreeBSD arranca, testear&aacute; los puertos serie
      del sistema que est&eacute;n configurados en el kernel. Puedes estar 
      atento a los mensajes de la c&oacute;nsola o ejecutar el comando:

      <verb>
        dmesg | grep sio
      </verb>

      <p>una vez el sistema est&eacute; en funcionamiento.

      <p>Aqu&iacute; tienes un ejemplo del resultado de la ejecuci&oacute;n 
      del comando:

      <verb>
        sio0 at 0x3f8-0x3ff irq 4 on isa
        sio0: type 16550A
        sio1 at 0x2f8-0x2ff irq 3 on isa
        sio1: type 16550A
      </verb>

      <p>Esto muestra dos puertos serie. El primero en la irq 4 usando
      la direcci&oacute;n <tt/0x3f8/, y tiene una UART 16550A. El segundo usa
      el mismo tipo de chip pero est&aacute; en la irq 3 y usa la 
      direcci&oacute;n <tt/0x2f8/. Los m&oacute;dems internos son tratados 
      como puertos serie, exceptuando que siempre tienen un m&oacute;dem 
      adjuntado al puerto.

      <p>El kernel <tt/GENERIC/ incluye soporte para dos puertos serie
      usando la misma irq y direcci&oacute;n que en el ejemplo anterior. Si 
      estas opciones no son correctar para tu sistema, o si has a&ntilde;adido 
      m&oacute;dems internos o tienes m&aacute;s puertos serie de los que 
      est&aacute;n configurados en el kernel, solo tienes que reconfigurar el 
      kernel. Mira en la secci&oacute;n
      <ref id="make-kernel" name="about building a kernel"> para m&aacute;s 
      detalles.

    <sect1>
      <heading>&iquest;C&oacute;mo se si FreeBSD ha encontrado mi m&oacute;dem interno?</heading>

      <p>Respondido en la secci&oacute;n anterior.

    <sect1>
      <heading>He actualizado a 2.0.5 y mi <tt/tty0X/ no existen!</heading>

      <p>No te preocupes, han sido integrados en los dispositivos <tt/ttydX/.
      Tendr&aacute;s que modificar algunos ficheros antiguos de 
      configuraci&oacute;n.

    <sect1>
      <heading>&iquest;C&oacute;mo accedo a los puertos serie en FreeBSD?</heading>

      <p>El tercer puerto serie, <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?sio" name="sio2"> (conocido
      como COM3 en DOS), est&aacute; en <tt>/dev/cuaa2</tt> para dispositivos de
      salida (dial-out) y en <tt>/dev/ttyd2</tt> para dispositivos de
      entrada (dial-in). Cu&aacute;l es la diferencia entre estas dos clases de
      dispositivos?.

      <p>Usas los <tt/ttydX/ para los entrantes. Al abrir <tt>/dev/ttydX</tt>
      en "blocking mode", un proceso esperar&aacute; para que el dispositivo
      <tt/cuaaX/ correspondiente se vuelva inactivo. Cuando abres un
      dispositivo <tt/cuaaX/, se asegura de que el puerto serie no est&aacute;
      en uso por un dispositivo <tt/ttydX/. Si el puerto est&aacute; disponible,
      se lo "roba" al dispositivo <tt/ttydX/. Al mismo tiempo, el dispositivo
      <tt/cuaaXX/ no se preocupa de la detecci&oacute;n de portadora. Con este
      esquema, y un m&oacute;dem en respuesta autom&aacute;tica, puedes 
      recibir usuarios remotos y puedes hacer conexiones externas con el mismo 
      m&oacute;dem, mientras el sistema se preocupa de evitar los posible 
      conflictos.

    <sect1>
      <heading>&iquest;C&oacute;mo activo el soporte de tarjetas serie multipuerto?</heading>

      <p>Otra vez, en la secci&oacute;n de configuraci&oacute;n del kernel 
      tienes la informaci&oacute;n. Para una tarjeta multipuerto, pon una 
      l&iacute;nea <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?sio" 
      name="sio"> para cada puerto serie de la tarjeta en el fichero de 
      configuraci&oacute;n del kernel. Especifica la irq y vector solo en una 
      de las l&iacute;neas.
      Todos los puertos de la tarjeta compartir&aacute;n la misma irq. Por
      consistencia, usa el &uacute;ltimo puerto serie para especificar la irq. 
      De la misma manera, especifica la opci&oacute;n <tt/COM&lowbar;MULTIPORT/.

      <p>El siguiente ejemplo es para una tarjeta AST 4-port en la irq 7:

      <verb>
        options "COM_MULTIPORT"
        device sio4 at isa? port 0x2a0 tty flags 0x781
        device sio5 at isa? port 0x2a8 tty flags 0x781
        device sio6 at isa? port 0x2b0 tty flags 0x781
        device sio7 at isa? port 0x2b8 tty flags 0x781 irq 7 vector siointr
      </verb>

      <p>Los flags indican que el puerto master tiene un n&uacute;mero menor 
      de 7 (<tt/0x700/), los diagn&oacute;sticos est&aacute;n activados durante
      el testeo (<tt/0x080/), y los puertos comparten una irq (<tt/0x001/).

    <sect1>
      <heading>&iquest;Puede manejar FreeBSD tarjetas multipuerto compartiendo irq?</heading>

      <p>Todav&iacute;a no. Tendr&aacute;s que usar una irq diferente para cada
      tarjeta.

    <sect1>
      <heading>&iquest;Puedo cambiar los par&aacute;metros serie por defecto para un puerto?</heading>

      <p>El dispositivo <tt/ttydX/ (o <tt/cuaaX/) es el que querr&aacute;s abrir
      para tus aplicaciones. Cuando un proceso abre el dispositivo, 
      tendr&aacute; una serie de configuraciones I/O por defecto. Puedes ver 
      estas configuraciones con el comando:

      <verb>
        stty -a -f /dev/ttyd1
      </verb>

      Cuando le cambias la configuraci&oacute;n a este dispositivo, este cambio
      se mantiene hasta que el dispositivo se cierra. Cuando se reabre,
      vuelve a la configuraci&oacute;n por defecto. Para hacer cambios sobre la
      configuraci&oacute;n por defecto, puedes abrir y ajustar las opciones del
      "estado inicial" del dispositivo. Por ejemplo, para poner el
      dispositivo tty5 en modo <tt/CLOCAL/, 8 bits, y contro del flujo
      <tt>XON/XOFF</tt>, haz

      <verb>
        stty -f /dev/ttyid5 clocal cs8 ixon ixoff
      </verb>

      <p>Un buen lugar para hacer esto es en <tt>/etc/rc.serial</tt>. Ahora,
      una aplicaci&oacute;n tendr&aacute; esta configuraci&oacute;n por 
      defecto cuando abra el puerto <tt/ttyd5/.

      <p>Tambi&eacute;n puedes prevenir o limitar ciertos cambios que pretenda
      hacer una aplicaci&oacute;n. Para ello, ajusta el "lock state" del
      dispostivo. Por ejemplo, para bloquear la velocidad del puerto
      <tt/ttyd5/ a 57600 bps, haz:

      <verb>
        stty -f /dev/ttyld5 57600
      </verb>

      <p>Ahora, una aplicaci&oacute;n que abre <tt/ttyd5/ e intenta cambiar la
      velocidad del puerto no podr&aacute; hacerlo.

      <p>Naturalmente, deber&iacute;as hacer que el estado inicial y el estado 
      de bloqueo sean solo de escritura para el usuario <tt/root/. El script
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?MAKEDEV"
      name="MAKEDEV"> <bf/NO/ hace esto cuando crea el dispositivo.

    <sect1>
      <heading>&iquest;C&oacute;mo puedo activar logins de entrada en mi m&oacute;dem?</heading>

      <p>Quieres hacerte proveedor de Internet, eh?. Primero, 
      necesitar&aacute;s uno o mas m&oacute;dems que puedan responder 
      autom&aacute;ticamente. Tu m&oacute;dem necesitar&aacute; activar el 
      carrier-detect s&oacute;lo cuando detecte una portadora y no tenerla 
      activada continuamente. Necesitar&aacute; cortar la comunicaci&oacute;n
      y resetearse &eacute;l mismo cuando la l&iacute;nea <tt/DTR/ pase de on 
      a off.
      Probablemente usar&iacute;a <tt>RTS/CTS</tt> para el control de flujo.
      Finalmente, debe usar una velocidad constante entre el ordenador y 
      &eacute;l mismo, pero deber&iacute;a negociar la velocidad entre 
      &eacute;l mismo y el m&oacute;dem remoto.

      <p>Para muchos m&oacute;dems compatibles Hayes, este comando 
      crear&aacute; estas configuraciones y las grabar&aacute; en la memoria no
      vol&aacute;til:

      <verb>
        AT &amp;C1 &amp;D3 &amp;K3 &amp;Q6 S0=1 &amp;W
      </verb>

      <p>Mira la secci&oacute;n <ref id="direct-at" name="enviar comandos AT"> 
      para saber como enviar estas configuraciones al m&oacute;dem sin 
      necesidad de un programa terminal de DOS.

      <p>A continuaci&oacute;n, a&ntilde;ade una l&iacute;nea en el fichero 
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?ttys" name="/etc/ttys"> 
      para el m&oacute;dem. Este fichero lista todos los puertos en los que el 
      sistema operativo esperar&aacute; los logins. La l&iacute;nea 
      ser&iacute;a como esta:

      <verb>
        ttyd1 "/usr/libexec/getty std.57600" dialup on insecure
      </verb>

      <p>Esta l&iacute;nea indica que el segundo puerto serie 
      <tt>/dev/ttyd1</tt> tiene un m&oacute;dem conectado, la velocidad es de 
      57600 bps y sin paridad (<tt/std.57600/. El tipo de terminal para este 
      puerto es "dialup".
      El puerto est&aacute; "on" y es inseguro (lo que significa que los logins
      como root no son permitidos).

      <p>Muchos usuarios, ponen un sus ficheros .profile o .login un
      prompt para el tipo de terminal. El ejemplo muestra el puerto como
      inseguro. Para ser root en ese puerto, hacer el login como un usuario
      normal, y ejecutar el comando su. Si en lugar de inseguro, el terminal
      es seguro (secure), puedes hacer login como root directamente.

      <p>Despues de modificar el fichero <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?ttys" name="/etc/ttys">,
      necesitas lanzar una se&ntilde;al <tt/HUP/ al proceso <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?init" name="init">:

      <verb>
        kill -HUP 1
      </verb>

      <p>Esto fuerza al proceso init a releer el fichero <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?ttys" name="/etc/ttys">.
      El proceso init arrancar&aacute; los procesos getty en todos los puertos
      configurados como "on". Puedes ver si los logins est&aacute;n disponibles
      en los puertos tecleando:

      <verb>
        ps -ax | grep '[t]tyd1'
      </verb>

      <p>deber&iacute;as ver algo como:

      <verb>
        747 ??  I      0:00.04 /usr/libexec/getty std.57600 ttyd1
      </verb>

    <sect1>
      <heading>&iquest;C&oacute;mo puedo conectar un dumb terminal a un FreeBSD?</heading>

      <p>Si est&aacute;s usando otro ordenador como terminal en tu sistema 
      FreeBSD, usa un cable null m&oacute;dem entre los dos puertos serie. Si 
      ya est&aacute;s usando un terminal, mira en las instrucciones del mismo.

      <p>A continuaci&oacute;n, modifica el fichero
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?ttys" name="/etc/ttys">
      Por ejemplo, si est&aacute;s instalando un terminal WYSE-50 en el quinto 
      puerto serie, usa una l&iacute;nea como esta:

      <verb>
        ttyd4 "/usr/libexec/getty std.38400" wyse50 on secure
      </verb>

      <p>Este ejemplo muestra que el puerto <tt>/dev/ttyd4</tt> tiene un
      terminal Wyse50 conectado a 38400 bps sin paridad y los logins de
      root son permitidos.

    <sect1>
      <heading>&iquest;Porqu&eacute; no puedo ejecutar <tt/tip/ o <tt/cu/?</heading>

      <p>En tu sistema, los programas <htmlurl 
      url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip"> y <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?cu" name="cu"> son probablemente
      ejecutables solo por <htmlurl 
      url="http://www.FreeBSD.org/cgi/man.cgi?uucp"
      name="uucp"> y el grupo <tt/dialer/. Puedes usar el grupo <tt/dialer/
      para controlar quien tiene acceso al m&oacute;dem o sistemas remotos. 
      S&oacute;lo tienes que a&ntilde;adirte tu mismo al grupo dialer.

      <p>Alternativamente, puedes dejar que todos los usuarios de tu sistema
      ejecuten <tt/tip/ y <tt/cu/ tecleando:

      <verb>
        # chmod 4511 /usr/bin/cu
        # chmod 4511 /usr/bin/tip
      </verb>

    <sect1>
      <heading>Mi m&oacute;dem hayes no est&aacute; soportado. &iquest;Que puedo hacer?</heading>

      <p>Actualmente, el man de <htmlurl 
      url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip"> est&aacute;
      anticuado. Hay un dialer Hayes gen&eacute;rico. Solo usa
      ``<tt/at=hayes/'' en tu fichero <htmlurl 
      url="http://www.FreeBSD.org/cgi/man.cgi?remote" name="/etc/remote">.

      <p>El driver Hayes no es tan desarrollado como para reconocer algunas
      de las caracter&iacute;sticas avanzadas de los m&oacute;dems modernos,
      mensajes como <tt/BUSY/, <tt/NO DIALTONE/ o <tt/CONNECT 115200/ lo 
      pueden confundir.
      Deber&iacute;as anular estos mensajes cuando uses <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip"> (utilizando
      la cadena <tt/ATX0&amp;W/).

      <p>Tambi&eacute;n, el timeout de llamada para <tt/tip/ est&aacute; en 60 
      segundos. Tu m&oacute;dem deber&iacute;a usar algo menor, o tip puede 
      pensar que hay un problema de comunicaci&oacute;n. Intenta con 
      <tt/ATS7=45&amp;W/.

    <sect1>
      <heading>
        &iquest;C&oacute;mo puedo introducir estos comandos AT?<label id="direct-at">
      </heading>

      <p>Haz lo que se llama una entrada <tt/directa/ en el fichero
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?remote"
      name="/etc/remote">. Por ejemplo, si tu m&oacute;dem est&aacute; 
      conectado al primer puerto serie, <tt>/dev/cuaa0</tt>, escribe la 
      siguiente l&iacute;nea:

      <verb>
        cuaa0:dv=/dev/cuaa0:br#19200:pa=none
      </verb>

      <p>Usa la velocidad m&aacute;s alta que soporte tu m&oacute;dem en la 
      secci&oacute;n br.
      A continuaci&oacute;n teclea <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip cuaa0">
      y estar&aacute;s conectado al m&oacute;dem.

      <p>Si no existe el dispositivo <tt>/dev/cuaa0</tt> en tu sistema
      , teclea lo siguiente:

      <verb>
        # cd /dev
        # ./MAKEDEV cuaa0
      </verb>

      <p>O usa el comando cu como root con los siguientes par&aacute;metros:

      <verb>
        # cu -l``line'' -s``speed''
      </verb>

      <p>con line siendo el puerto serie (por ejemplo <tt>/dev/cuaa0</tt>>)
      y speed siendo la velocidad (por ejemplo <tt>57600</tt>. Cuando
      termines de entrar los comandos AT, pulsa la tecla <tt>.</tt> para
      salir.

    <sect1>
      <heading>El s&iacute;mbolo <tt/@/ no funciona correctamente!</heading>

      <p>El s&iacute;mbolo <tt/@/ en la opci&oacute;n de n&uacute;meros de 
      tel&eacute;fono indica a tip que busque en el fichero <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?phones(5)" name="phone(5)"> un 
      n&uacute;mero de tel&eacute;fono determinado. Pero el s&iacute;mbolo 
      <tt/@/ es tambi&eacute;n un car&aacute;cter especial en otros ficheros y 
      opciones como <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?remote"
      name="/etc/remote">. Pon una contrabarra junto al car&aacute;cter:

      <verb>
        pn=\@
      </verb>

    <sect1>
      <heading>&iquest;C&oacute;mo puedo llamar desde la l&iacute;nea de comandos?</heading>

      <p>Pon lo que se llama una entrada <tt/gen&eacute;rica/ en el fichero
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?remote"
      name="/etc/remote">. Por ejemplo:

      <verb>
        tip115200|Dial any phone number at 115200 bps:\
        :dv=/dev/cuaa0:br#115200:at=hayes:pa=none:du:
        tip57600|Dial any phone number at 57600 bps:\
        :dv=/dev/cuaa0:br#57600:at=hayes:pa=none:du:
      </verb>

      <p>Entonces puedes hacer cosas como <tt/tip -115200 5551234/. Si
      prefieres usar <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?cu" 
      name="cu"> antes que <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip">, usa una
      entrada gen&eacute;rica de cu:

      <verb>
        cu115200|Use cu to dial any number at 115200bps:\
        :dv=/dev/cuaa1:br#57600:at=hayes:pa=none:du:
      </verb>

      <p>y teclea ``<tt/cu 5551234 -s 115200/''.

    <sect1>
      <heading>&iquest;Tengo que teclear la velocidad cada vez que hago esto?</heading>

      <p>Pon una entrada para <tt/tip1200/ o <tt/cu1200/, pero puedes usar
      la velocidad que mejor se amolde a tus necesidades. <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip"> piensa que
      una buena velocidad por defecto es 1200 bps ya que busca una entrada
      <tt/tip1200/. No tienes por que usar 1200 bps.

    <sect1>
      <heading>Accedo a diferentes hosts a trav&eacute;s de un servidor de terminales.</heading>

      <p>En lugar de esperar a que est&eacute;s conectado y teclear
      <tt/CONNECT &lt;host&gt;/ cada vez, usa la opci&oacute;n <tt/cm/ de tip. 
      Por ejemplo, estas entradas en el fichero <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?remote" name="/etc/remote">:

      <verb>
        pain|pain.deep13.com|Forrester's machine:\
        :cm=CONNECT pain\n:tc=deep13:
        muffin|muffin.deep13.com|Frank's machine:\
        :cm=CONNECT muffin\n:tc=deep13:
        deep13:Gizmonics Institute terminal server:\
        :dv=/dev/cua02:br#38400:at=hayes:du:pa=none:pn=5551234:
      </verb>

      <p>Esto har&aacute; que puedas teclear <tt/tip pain/ o <tt/tip muffin/ 
      para conectarte a las m&aacute;quinas pain o muffin.

    <sect1>
      <heading>&iquest;Puede tip intentar m&aacute;s de una l&iacute;nea para cada lugar?</heading>

      <p>Este es un problema habitual en universidades con diferentes 
      l&iacute;neas de m&oacute;dem y unos cientos de usuarios intentado 
      usarlas...

      <p>Haz una entrada para tu universidad en el fichero <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?remote" name="/etc/remote">
      y usa <tt>\@</tt> para la opci&oacute;n <tt/pn/:

      <verb>
        big-university:\
        :pn=\@:tc=dialout
        dialout:\
        :dv=/dev/cuaa3:br#9600:at=courier:du:pa=none:
      </verb>

      <p>Entonces, lista los n&uacute;meros de tel&eacute;fono de la 
      universidad en el fichero <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?phones" name="/etc/phones">:

      <verb>
        big-university 5551111
        big-university 5551112
        big-university 5551113
        big-university 5551114
      </verb>

      <p><htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?tip"
      name="tip"> intentar&aacute; cada uno de estos n&uacute;meros en el 
      orden en el que est&eacute;n listados. Si quieres que se realicen 
      reintentos, ejecuta <tt/tip/ en una bucle while.

    <sect1>
      <heading>&iquest;Porqu&eacute; tengo que teclea CTRL+P dos veces para enviar CTRL+P una vez?</heading>

      <p>CTRL+P es el car&aacute;cter por defecto de "forzar", usado para 
      indicarle al programa
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip">
      que el pr&oacute;ximo car&aacute;cter es un dato literal. Puedes 
      configurar el car&aacute;cter "forzar" a cualquier otro car&aacute;cter 
      con el escape <tt/~s/, el cual significa "poner una variable".

      <p>Teclea <tt/~sforce=&lt;single-char&gt;/ seguido de una nueva
      l&iacute;nea. <tt/&lt;single-char&gt;/ es cualquier car&aacute;cter 
      simple. Si dejas libre <tt/&lt;single-char&gt;/ entonces el 
      car&aacute;cter de forzar es el caracter nul, al cual puedes acceder 
      tecleando CTRL+2 o CTRL+SPACE. Un valor m&aacute;s adecuado para
      <tt/&lt;single-char&gt;/ es SHIFT+CTRL+6, el cual solo es usado en
      algunos servidores de terminales.

      <p>Puedes tener el car&aacute;cter de forzar donde quieras, especificando
      lo siguiente en tu fichero <tt>&dollar;HOME/.tiprc</tt>

      <verb>
        force=<single-char>
      </verb>

    <sect1>
      <heading>De repente, todo lo que tecleo es en may&uacute;sculas</heading>

      <p>Has debido pulsar CTRL+A, <htmlurl
      url="http://www.FreeBSD.org/cgi/man.cgi?tip" name="tip"> tiene este
      car&aacute;cter especial para gente que tenga la tecla caps-lock 
      estropeada. Usa <tt/~s/ como en la secci&oacute;n anterior y pon la 
      variable "raisechar" a un valor razonable. De hecho, puedes ponerla al 
      mismo valor que que el car&aacute;cter de forzar, si no esperas usar 
      estas caracter&iacute;sticas.

      <p>Aqui hay un ejemplo del fichero .tiprc perfecto para usuarios de
      Emacs que necesiten teclear CTRL+2 y CTRL+A muchas veces:

      <verb>
        force=^^
        raisechar=^^
      </verb>

      <p>El simbolo ^^ es SHIFT+CTRL+6.

    <sect1>
      <heading>&iquest;C&oacute;mo puedo hacer transferecia de ficheros con <tt/tip/?</heading>

      <p>Si est&aacute;s conectado con otro sistema UNIX, puedes enviar y 
      recibir ficheros con <tt/~p/ (put) y <tt/~t/ (take). Estos comandos 
      ejecutan
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?cat" name="cat"> y
      <htmlurl url="http://www.FreeBSD.org/cgi/man.cgi?echo" name="echo">
      en el sistema remoto para aceptar y enviar ficheros. La sintaxis es:

      <verb>
        ~p <local-file> [<remote-file>]
        ~t <remote-file> [<local-file>]
      </verb>

      <p>No hay chequeo de errores, por lo que es mejor usar otro protocolo
      como zmodem.

    <sect1>
      <heading>&iquest;C&oacute;mo puedo usar zmodem con <tt/tip/?</heading>

      <p>Primero, instala uno de los programas zmodem de la colecci&oacute;n de
      ports (por ejemplo
      <htmlurl url="http://www.FreeBSD.org/cgi/ports.cgi?^lrzsz" name="lrzsz">
      y <htmlurl url="http://www.FreeBSD.org/cgi/ports.cgi?^rzsz"
      name="rzsz">).

      <p>Para recibir ficheros, inicia el programa de env&iacute;o en la parte
      remota. A continuaci&oacute;n, pulsa enter y teclea
      <tt/~C rz/'' (or ``<tt/~C lrz/'' si instalaste lrzsz) para empezar
      a recibir localmente.

      <p>Para enviar ficheros, inicia el programa de recepci&oacute;n en la 
      parte remota. A continuaci&oacute;n pulsa enter y teclea
      <tt/~C sz &lt;files&gt;/'' (o <tt/~C lsz &lt;files&gt;/) para enviarlos
      al sistema remoto.

    <sect1>
       <heading>FreeBSD parece que no puede encontrar mis puertos series 
       a&uacute;n cuando la configuraci&oacute;n es correcta.</heading>

       <p>Las placas bases y tarjetas con UARTs de Acer no son detectadas
       correctamente por FreeBSD durante la fase de detecci&oacute;n serie. 
       Obten un parche de 
       <url url="http://www.lemis.com/serial-port-patch.html"
       name="www.lemis.com"> para solucionar el problema.
           

  </sect>

