freebsd/freebsd-doc/documentation/manual-pages/ja/man5/devd.conf.5
.\"
.\" Copyright (c) 2002 M. Warner Losh
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/devd/devd.conf.5,v 1.8 2003/03/03 11:51:30 ru Exp %
.\"
.\" The section on comments was taken from named.conf.5, which has the
.\" following copyright:
.\" Copyright (c) 1999-2000 by Internet Software Consortium
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND INTERNET SOFTWARE CONSORTIUM DISCLAIMS
.\" ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL INTERNET SOFTWARE
.\" CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\"
.\" $FreeBSD$
.\"
.\" WORDS
.\" statement		ステートメント
.\" general syntax	一般的な文法
.\" appeal to		〜にとって便利な(文脈で流しました)
.\" C-style		C 形式(の)
.\" C++-style		C++ 形式(の)
.\" nest		ネスト(する)
.\"
.Dd October 17, 2002
.Dt DEVD.CONF 5
.Os
.Sh 名称
.Nm devd.conf
.Nd
.Xr devd 8
用の設定ファイル
.Sh 解説
.Ss 一般的な文法
.Xr devd 8
設定ファイルの内容には、ステートメントとコメントの大きく 2 種類があります。
ステートメントの終りは全てセミコロンです。
ステートメントの多くはサブステートメントを持つことが出来ますが、
サブステートメントの終りもセミコロンです。
.Pp
次のステートメントがサポートされています:
.Bl -tag -width ".Ic options"
.It Ic options
.Xr devd 8
の処理で適用されるさまざまなオプションやパラメータを指定します。
.It Ic attach
各種デバイスの照合基準とその基準に適合したデバイスを新規にアタッチするときに
実行するアクションを指定します。
.It Ic detach
各種デバイスの照合基準とその基準に適合したデバイスを新規にデタッチするときに
実行するアクションを指定します。
.It Ic nomatch
適合するデバイスドライバが現状カーネルにロードされていない (新しい)
デバイスについて、
各種の照合基準と適合したデバイスに対して実行するアクションを指定します。
.El
.Pp
ステートメントは設定ファイル中にどの順番でも、また必要な数だけ
何度でも、書くことが出来ます。
文法及びそれぞれのステートメントやそのサブステートメントの意味について、
以下に詳しく説明します。
.Pp
コメントは設定ファイル中で空白を入れられる場所にならば、どこにでも
入れることが出来ます。
全てのプログラマにとって便利なように、コメントは C、C++、shell/Perl のどの
形式でも書くことが出来るようになっています。
.Pp
C 形式のコメントは
.Ql /*
(slash, star) の 2 文字で始まり
.Ql */
(star, slash) で終ります。
この形式のコメントはこれらの文字で完全に区切ることが出来るので、
行の一部や複数行にまたがるコメントに使用することが出来ます。
.Pp
C 形式のコメントは、ネストすることが出来ません。
例えば、次の例は最初の
.Ql */
でコメントが完全に終了するので無効です:
.Bd -literal -offset indent
/* ここからコメントが始まります。
   ここはまだ、コメントの内部です。
/* ここでコメントをネストしようとしていますが、これは間違いです。*/
   ここは、もうコメントの内部ではありません。*/
.Ed
.Pp
C++ 形式のコメントは
.Ql //
(slash, slash) の 2 文字で始まり、物理行の終りまでになります。
この形式のコメントは物理行をまたぐことが出来ません。つまり、
論理的に 1 つのコメントでも複数行にまたがる場合には、それぞれの行に
.Ql //
を入れなくてはなりません。
例えば:
.Bd -literal -offset indent
// ここからコメントが始まります。次の行は
// 新しいコメントです。たとえ、論理的に
// 前のコメントの一部であったとしても、です。
.Ed
.Sh 関連ファイル
.Bl -tag -width ".Pa /etc/devd.conf" -compact
.It Pa /etc/devd.conf
.Xr devd 8
設定ファイル
.El
.Sh 関連項目
.Xr devd 8
