freebsd/freebsd-doc/documentation/manual-pages/ja/man5/device.hints.5
.\" Copyright (c) 2001
.\" Kazutaka YOKOTA <yokota@zodiac.mech.utsunomiya-u.ac.jp>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man5/device.hints.5,v 1.10 2003/09/19 22:27:54 jb Exp %
.\" $FreeBSD$
.\"
.\" WORDS
.\" hints,hint		ヒント
.\" boot loader		boot loader
.\" start address	スタートアドレス
.\" most often		よく
.\"
.Dd October 7, 2001
.Dt DEVICE.HINTS 5
.Os
.Sh 名称
.Nm device.hints
.Nd デバイスリソースヒント
.Sh 解説
.Nm
ファイルは、システムの起動時に boot
.Xr loader 8
によって読み込まれ、その内容がカーネルに渡されます。
その内容には、カーネルの起動動作を制御するいろいろな変数が含まれます。
それらの変数は、主に
.Dq デバイスヒント
です。
.\" .Dq device hints ,
.\" and other control variables.
.Pp
ファイルの一行で一つの変数を定義します。
.Ql #
の文字で始まる行はコメントで、boot loader には無視されます。
.Pp
boot loader がファイルを読み込んでからは、
.Ic show
コマンドでその値を確認することが出来ます。
また、boot loader の
.Ic set
や
.Ic unset
コマンドを用いて、新しい変数を追加したり既存の変数を変更・削除したり
することが出来ます。
.Xr ( loader 8
参照)
.Pp
システムが起動してからは
.Xr kenv 1
コマンドで、これらの変数を表示させることが出来ます。
.Sh デバイスヒント
デバイスヒント変数は、デバイスドライバがデバイスをセットアップするのに
使用されます。
これらは ISA デバイスドライバがよく利用していて、
ドライバが適切なデバイスをプローブするのにどこを見るかや、
どのリソースを使うのかを指定するのに使われています。
.Pp
デバイスヒント行は、次のようになっています:
.Pp
.Sm off
.D1 Li hint. Ar driver Li . Ar unit Li . Ar keyword Li = Qq Ar value
.Sm on
.Pp
ここで
.Ar driver
はデバイスドライバの名称、
.Ar unit
はユニット番号、
.Ar keyword
はその行のヒントのキーワードです。
キーワードには次のものがあります:
.Pp
.Bl -tag -width ".Li disabled" -compact -offset indent
.It Li at
デバイスがアタッチされるバスを指定します。
.It Li port
デバイスが使用する I/O ポートのスタートアドレスを指定します。
.It Li portsize
デバイスが使用するポート数です。
.It Li irq
使用する割り込みライン番号です。
.It Li drq
DMA チャネル番号です。
.It Li maddr
デバイスが使用する物理メモリアドレスを指定します。
.It Li msize
デバイスが使用する物理メモリサイズを指定します。
.It Li flags
デバイスのいろいろなフラグビットを設定します。
.It Li disabled
.Qq 1
に設定するとデバイスを使用不可にすることが出来ます。
.El
.Pp
デバイスドライバによっては、これらのキーワードの一つもしくは
それ以上のヒント行が必須になることもあるかもしれませんし、
ここのリストにないキーワードが使えるかもしれません。
使用可能なキーワードや設定可能な値については個々のデバイスドライバの
マニュアルページを参照してください。
.\" .Sh CONTROL VARIABLES
.\" Lines not starting with
.\" .Dq hint.
.\" specify other control variables for the kernel.
.\" They look:
.\" .Pp
.\" .Dl <name>="<value>"
.\" XXX
.\" WE SHOULD LIST AVAILABLE VARIABLE NAMES AND THEIR POSSIBLE VALUES HERE!
.\" .Pp
.Sh 関連ファイル
.Bl -tag -width ".Pa /sys/ Ns Ar ARCH Ns Pa /conf/GENERIC.hints" -compact
.It Pa /boot/device.hints
デバイスリソースヒントファイル
.It Pa /sys/ Ns Ar ARCH Ns Pa /conf/GENERIC.hints
.Pa GENERIC
カーネル用のサンプルリソースヒントファイル
.It Pa /sys/ Ns Ar ARCH Ns Pa /conf/NOTES
カーネル設定ファイルやデバイスリソースヒントに関する注
.El
.Sh 使用例
次の例は、ISA バス上の
.Xr sio 4
ドライバのリソースを設定するものです:
.Bd -literal -offset indent
hint.sio.0.at="isa"
hint.sio.0.port="0x3F8"
hint.sio.0.flags="0x10"
hint.sio.0.irq="4"
.Ed
.Pp
次の例は、ACPI ドライバを使用不可にするものです:
.Bd -literal -offset indent
hint.acpi.0.disabled="1"
.Ed
.\" .Pp
.\" A control variable may look like:
.\" .Pp
.\" .Bd -literal -offset indent
.\" debug.acpi.layer="ACPI_RESOURCES"
.\" .Ed
.Sh 関連項目
.Xr kenv 1 ,
.Xr loader.conf 5 ,
.Xr loader 8
.Sh 歴史
.Nm
ファイルは
.Fx 5.0
に初めて登場しました。
