freebsd/freebsd-doc/documentation/manual-pages/ja/man5/loader.conf.5
.\" Copyright (c) 1999 Daniel C. Sobral
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sys/boot/forth/loader.conf.5,v 1.21 2004/05/16 22:51:36 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd April 18, 1999
.Dt LOADER.CONF 5
.Os
.Sh 名称
.Nm loader.conf
.Nd "システムブートストラップの設定情報"
.Sh 解説
ファイル
.Nm
は、システムのブートストラップに関する記述的な情報を含みます。
これを通じて、ブートすべきカーネル、カーネルに渡すパラメータ、
ロードすべき追加のモジュールを指定可能であり、また、一般的に、
.Xr loader 8
で記述されているすべての変数を設定可能です。
.Pp
.Nm
が自動的に処理されるようにするために、
ファイル
.Pa /boot/loader.rc
は次の 2 行を含む必要があります。
.Pp
.Dl include /boot/loader.4th
.Dl start
.Pp
インストール時に
.Pa /boot/loader.rc
が存在しない場合、前述の行を含むものが組み込まれることになります。
.Sh 文法
.Nm
の書式は、明らかに
.Xr rc.conf 5
の書式を受け継いだものであり、
.Xr sh 1
を起源とするものですが、特別な方法で扱われる設定があります。
また、設定の動作がサフィックスによって定義されるものもあり、
その場合、プレフィックスは、制御対象のモジュールを指定します。
.Pp
一般的な解釈の規則は次の通りです:
.Bl -bullet
.It
空白と空行は無視されます。
.It
記号 # は、行の残りがコメントであるという印です。
.It
各行には 1 個の設定のみ存在可能です。
.El
.Pp
すべての設定は、次の書式です:
.Pp
.Dl variable="value"
.Pp
特殊な扱いを受ける設定のクラスに属すのでなければ、
おのおのの設定は
.Xr loader 8
の環境変数の値を設定します。
特殊な扱いを受ける設定は、ここに列挙しています。
ここで、
.Qq *
で始まる設定は、ロードされるモジュールを定義し、
任意のプレフィックスを持ちえます。
そのプレフィックスがモジュールを指定します。
共通のプレフィックスを持つような設定はすべて、
同一のモジュールを参照します。
.Bl -tag -width Ar
.It Ar exec
即時に
.Xr loader 8
のコマンドを実行します。
このタイプの設定は、
.Xr loader 8
以外のプログラムでは処理できませんので、使用は避けるべきです。
複数個指定すると、別々に処理されます。
.It Ar loader_conf_files
現在のファイルのすぐ後に処理すべき、追加の設定ファイルを定義します。
.It Ar kernel
ロードすべきカーネルの名前です。
カーネルの名前を設定しないと、
追加のモジュールはロードされません。
.It Ar kernel_options
カーネルに渡されるフラグです。
.It Ar password
実行継続許可前にパスワード確認が要求するパスワードを提供します。
.It Ar verbose_loading
.Dq YES
に設定すると、モジュールがロードされる際にその名前が表示されます。
.It Ar *_load
.Dq YES
に設定すると、そのモジュールがロードされます。
名前を定義しないと (後述)、モジュールの名前はプレフィックスと同じになります。
.It Ar *_name
モジュールの名前を定義します。
.It Ar *_type
モジュールのタイプを定義します。
なにも指定しないと、デフォルトの kld モジュールになります。
.It Ar *_flags
モジュールに渡されるフラグとパラメータです。
.It Ar *_before
モジュールのロード前に実行すべきコマンドです。
この設定の使用は避けるべきです。
.It Ar *_after
モジュールのロード後に実行すべきコマンドです。
この設定の使用は避けるべきです。
.It Ar *_error
モジュールのロードに失敗した場合に実行されるコマンドです。
ブートストラップ処理を異常終了させる特殊な値
.Dq abort
以外では、この設定の使用は避けるべきです。
.El
.Pp
.Em 警告:
開発者はこれらのサフィックスを kernel 環境変数 (変更可能変数) に
一切使ってはいけません。
さもないと衝突します。
.Sh デフォルト設定
ほとんどの
.Nm
のデフォルト設定は無視可能です。
少数の重要または有用なものを次に示します:
.Bl -tag -width bootfile -offset indent
.It Va bitmap_load
.Pq Dq NO
.Dq YES
に設定すると、ビットマップがロードされ、ブート中に画面に表示されます。
.It Va bitmap_name
.Pq Dq Pa /boot/splash.bmp
ロードされるビットマップの名前です。
他の名前を使用することも可能です。
.It Va console
.Pq Dq vidconsole
.Dq comconsole
シリアルコンソールを選択します。
.Dq vidconsole
ビデオコンソールを選択します。
.Dq nullconsole
mute コンソールを選択します。
(ビデオコンソールもシリアルポートも持たないシステムで有用です。)
.\" mute コンソールなんて言葉ないかな ? oh:2002/12/12
.\" +selects a mute console
.\" +(useful for systems with neither a video console nor a serial port).
.It Va kernel
.Pq Dq Pa /boot/kernel/kernel
.It Va loader_conf_files
.Pq Dq Pa /boot/loader.conf /boot/loader.conf.local
.It Va splash_bmp_load
.Pq Dq NO
.Dq YES
に設定すると、起動画面モジュールをロードし、
ブート中に bmp イメージを画面に表示することを可能にします。
.It Va splash_pcx_load
.Pq Dq NO
.Dq YES
に設定すると、起動画面モジュールをロードし、
ブート中に pcx イメージを画面に表示することを可能にします。
.It Va vesa_load
.Pq Dq NO
.Dq YES
に設定すると、vesa モジュールをロードし、
VGA を越える解像度のビットマップを表示可能とします。
.El
.Sh 関連ファイル
.Bl -tag -width /boot/defaults/loader.conf -compact
.It Pa /boot/defaults/loader.conf
デフォルト設定 -- このファイルを変更しないでください。
.It Pa /boot/loader.4th
loader が使用するコマンドを定義し、
.Nm
を読み込んで処理します。
.It Pa /boot/loader.conf
ユーザが定義した設定です。
.It Pa /boot/loader.conf.local
共通の loader.conf と共に使用する、サイトのマシン固有の設定です。
.It Pa /boot/loader.rc
.Nm
を自動的に処理する指示を含みます。
.El
.Sh 関連項目
.Xr boot 8 ,
.Xr loader 8 ,
.Xr loader.4th 8
.Sh 歴史
ファイル
.Nm
は
.Fx 3.2
ではじめて登場しました。
.Sh 作者
このマニュアルページは
.An Daniel C. Sobral Aq dcs@FreeBSD.org
によって書かれました。
