freebsd/freebsd-doc/documentation/manual-pages/ja/man5/motd.5
.\"	%NetBSD: motd.5,v 1.2 1994/12/28 18:58:53 glass Exp %
.\"
.\" This file is in the public domain.
.\" %FreeBSD: src/share/man/man5/motd.5,v 1.5 2001/07/14 19:41:09 schweikh Exp %
.\"
.\" $FreeBSD$
.Dd February 13, 1997
.Dt MOTD 5
.Os
.Sh 名称
.Nm motd
.Nd 今日のメッセージを含むファイル
.Sh 解説
通常、ユーザがログインした後のシェル実行前に、
.Xr login 1
は
.Pa /etc/motd
ファイルを表示します。
このファイルは、一般的にはシステムに関する重要なアナウンスのために使用します。
システム起動時に、カーネルバージョン文字列を含む行が
このファイルの前に付きます。
.Pp
個々のユーザはこのファイルの表示を抑制することができます。
そのためには、
.Dq Pa .hushlogin
という名前のファイルをホームディレクトリに置くか、
.Xr login.conf 5
で制御します。
.Sh 関連ファイル
.Bl -tag -width $HOME/.hushlogin -compact
.It Pa /etc/motd
今日のメッセージ。
.It Pa $HOME/.hushlogin
.Pa /etc/motd
の出力を抑制。
.El
.Sh 使用例
.Bd -literal
FreeBSD 2.1.6.1-RELEASE (GENERIC) #0: Sun Dec 29 03:08:31 PST 1996

/home is full.  Please cleanup your directories.
.Ed
.Sh 関連項目
.Xr login 1 ,
.Xr login.conf 5
