freebsd/freebsd-doc/documentation/manual-pages/ja/man5/msdosfs.5
.\" %FreeBSD: src/share/man/man5/msdosfs.5,v 1.4 2003/02/24 22:53:23 ru Exp %
.\" Written by Tom Rhodes
.\" This file is in the public domain.
.\"
.\" $FreeBSD$
.\"
.\" WORD: MS-DOS based		MS-DOS ベースの
.\" WORD: partition number	パーティション番号
.\" WORD: mount point		マウントポイント
.\" WORD: advised		推奨される
.\"
.Dd December 26, 2002
.Dt MSDOSFS 5
.Os
.Sh 名称
.Nm msdosfs
.Nd MS-DOS ファイルシステム
.Sh 書式
.Cd "options MSDOSFS"
.Sh 解説
.Nm
ドライバは
.Fx
カーネルが
.Tn MS-DOS
ベースのファイルシステムを
読み書きできるようにするためのものです。
.Pp
最も一般的な使用法は、次の通りです:
.Pp
.Dl "mount_msdosfs /dev/ad0sN /mnt"
.Pp
ここで
.Ar N
はパーティション番号で、
.Pa /mnt
はマウントポイントです。
ユーザによっては、
.Pa /dos
ディレクトリを作成して
.Nm
のマウントポイントにすることもあります。
こうすることでファイルシステムを明確にして、
よりアクセスしやすくする助けになります。
.Pp
また、
.Pa /etc/fstab
に次のようなエントリを定義することもできます:
.Bd -literal
/dev/ad0sN		/dos	msdosfs		rw	0	0
.Ed
.Pp
これによって
システム起動時に
.Tn MS-DOS
ベースのパーティションを
.Pa /dos
マウントポイントにマウントするようになります。
.Pa /mnt
を永続的なマウントポイントとして使用することは推奨されていません。
ここは、フロッピや ZIP ディスクの一時的なマウントポイントにするための
場所だからです。
.Fx
のディレクトリ構成につきましては
.Xr hier 7
を参照してください。
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr mount 8 ,
.Xr mount_msdosfs 8 ,
.Xr umount 8
.Rs
.%T "The FreeBSD Handbook"
.%O "http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/"
.Re
.Sh 作者
このマニュアルページは
.An Tom Rhodes Aq trhodes@FreeBSD.org
によって書かれました。
