<!--
  The FreeBSD Documentation Project
  The FreeBSD Brazilian Portuguese Documentation Project

  Original revision: r38826
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % articles.ent PUBLIC "-//FreeBSD//ENTITIES DocBook FreeBSD Articles Entity Set//PTBR">
%articles.ent;
]>

<article>
  <articleinfo>
    <title>Como obter o melhor resultado para as suas perguntas na
    lista de discuss&atilde;o FreeBSD-Question</title>

    <author>
      <firstname>Greg</firstname>
      <surname>Lehey</surname>

      <affiliation>
	<address><email>grog@FreeBSD.org</email></address>
      </affiliation>
    </author>

    <pubdate> $FreeBSD$ </pubdate>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.microsoft;
      &tm-attrib.netscape;
      &tm-attrib.opengroup;
      &tm-attrib.qualcomm;
      &tm-attrib.general;
    </legalnotice>

    <abstract>
      <para>Este documento prove informa&ccedil;&otilde;es 
	&uacute;teis para as pessoas que planejam enviar 
	um email para a lista de discuss&atilde;o
	FreeBSD-questions.  Os avisos e conselhos foram elaborados com
	o com objetivo de maximizar as chances de que o leitor receba
	respostas &uacute;teis para as suas mensagens.</para>

      <para>Este documento &eacute; enviado regularmente para a lista
	de discuss&atilde;o FreeBSD-questions.</para>
    </abstract>
  </articleinfo>

  <sect1>
    <title id="Introduction">Introdu&ccedil;&atilde;o</title>

    <para>A lista de discuss&atilde;o 
      <literal>FreeBSD-questions</literal> &eacute;
      mantida pelo projeto FreeBSD para ajudar as pessoas que possuem
      perguntas referentes ao uso cotidiano do FreeBSD.
      Diferentemente da lista <literal>FreeBSD-hackers</literal>, na
      qual s&atilde;o discutidas quest&otilde;es mais 
      avan&ccedil;adas, tais como os rumos
      a serem seguidos no desenvolvimento futuro do FreeBSD.</para>

    <note>
      <para>O termo <quote>hacker</quote> n&atilde;o est&aacute; 
	relacionado com pessoas que invadem os computadores de outras
	pessoas.  O termo correto para este tipo de atividade &eacute;
	<quote>cracker</quote>, por&eacute;m a imprensa popular 
	insiste em confundi-los.  Os hackers do FreeBSD desaprovam 
	fortemente as atividades de <literal>cracking</literal> 
	(quebra de seguran&ccedil;a), e n&atilde;o se envolvem com 
	as mesmas.  Para uma descri&ccedil;&atilde;o mais abrangente 
	sobre hackers, consulte o artigo
	<ulink url="http://www.catb.org/~esr/faqs/hacker-howto.html">
	Como se tornar um hacker</ulink>, de autoria de Eric
	Raymond.</para>
    </note>

    <para>A FreeBSD-questions se destina a ajudar tanto as pessoas 
      que buscam auxilio na lista (os
      <quote>rec&eacute;m-chegados</quote>), quanto as que respondem
      as perguntas enviadas (os <quote>hackers</quote>).</para>

    <para>Inevitavelmente &eacute; normal ocorrerem alguns atritos
      na lista, os quais s&atilde;o decorrentes dos diferentes 
      pontos de vista dos dois grupos predominantes.  Os
      rec&eacute;m-chegados acusam os hackers de serem arrogantes, de
      se considerarem melhores que os outros, e de serem
      in&uacute;teis, enquanto os hackers acusam os
      rec&eacute;m-chegados de serem est&uacute;pidos, de serem
      incapazes de lerem a documenta&ccedil;&atilde;o, e de esperarem
      que tudo lhe seja dado em uma bandeja de prata.  &Eacute; claro,
      existem elementos verdadeiros nas afirma&ccedil;&otilde;es de
      ambas as partes, por&eacute;m estes pontos de vista, na maior
      parte das vezes, levam ambas as partes a uma
      sensa&ccedil;&atilde;o de frustra&ccedil;&atilde;o.</para>

    <para>Neste documento, eu gostaria de fazer algo para aliviar
      esta frustra&ccedil;&atilde;o e auxili&aacute;-los para que 
      obtenham melhores resultados para as suas perguntas na 
      FreeBSD-questions.  Na sess&atilde;o seguinte, eu mostrarei 
      como enviar uma pergunta, e depois disso, iremos ver como 
      responder a uma.</para>
  </sect1>

  <sect1>
    <title id="subscribe">Como se cadastrar na
      FreeBSD-questions</title>

    <para>A FreeBSD-questions &eacute; uma lista de discuss&atilde;o 
      por email, logo voc&ecirc; precisa ter acesso a uma conta de 
      email.  Para se inscrever v&aacute; at&eacute; a <ulink 
      url="&a.questions.url;">p&aacute;gina web de 
      informa&ccedil;&otilde;es da lista de discuss&atilde;o
      FreeBSD-questions</ulink>.  Na se&ccedil;&atilde;o denominada
      <quote>Subscribing to freebsd-questions</quote> (Inscrevendo-se
      na freebsd-question) preencha o campo <quote>Your email
      address</quote> com o seu endere&ccedil;o de email; os outros
      campos s&atilde;o opcionais.</para>

    <note>
      <para>O campo de password no formul&aacute;rio de
      inscri&ccedil;&atilde;o prov&ecirc; apenas uma seguran&ccedil;a
      leve, mas que deve evitar que outras pessoas brinquem com a sua
      inscri&ccedil;&atilde;o.  <emphasis>N&atilde;o utilize nenhum
      password que voc&ecirc; j&aacute; fa&ccedil;a uso em outros
      servi&ccedil;os e/ou sites</emphasis>, pois eventualmente ele
      ser&aacute; enviado de volta para voc&ecirc; em texto
      simples.</para> 
    </note>

    <para>Voc&ecirc; ir&aacute; receber uma mensagem de
      confirma&ccedil;&atilde;o do <application>mailman</application>;
      siga as instru&ccedil;&otilde;es contidas no email para 
      completar a sua inscri&ccedil;&atilde;o.</para>

    <para>Por &uacute;ltimo, quando voc&ecirc; receber a mensagem de
      boas vindas (<quote>Welcome</quote>) do
      <application>mailman</application> contendo os detalhes da 
      lista e o seu password para a &aacute;rea de assinantes, 
      <emphasis>por favor, salve uma c&oacute;pia</emphasis>.  Se 
      no futuro voc&ecirc; desejar sair da lista, voc&ecirc; 
      ir&aacute; precisar destas informa&ccedil;&otilde;es.  
      Veja a pr&oacute;xima se&ccedil;&atilde;o para maiores 
      detalhes.</para>
  </sect1>

  <sect1>
    <title id="unsubscribe">Como se descadastrar da 
      FreeBSD-questions?</title>

    <para>Quando voc&ecirc; se cadastrou na FreeBSD-questions, 
      voc&ecirc; recebeu uma mensagem de boas vindas do 
      <application>mailman</application>.  Nesta mensagem, no meio de
      outras coisas, est&atilde;o as instru&ccedil;&otilde;es de 
      como se descadastrar.  Aqui est&aacute; uma mensagem 
      t&iacute;pica:</para>

  <literallayout class="monospaced">
Welcome to the freebsd-questions@freebsd.org mailing list!

To post to this list, send your email to:

  freebsd-questions@freebsd.org

General information about the mailing list is at:

  http://lists.freebsd.org/mailman/listinfo/freebsd-questions

If you ever want to unsubscribe or change your options (e.g., switch 
to or from digest mode, change your password, etc.), visit your
subscription page at:

http://lists.freebsd.org/mailman/options/freebsd-questions/grog%40lemsi.de

You can also make such adjustments via email by sending a message to:

  freebsd-questions-request@freebsd.org

with the word `help' in the subject or body (don't include the
quotes), and you will get back a message with instructions.

You must know your password to change your options (including changing
the password, itself) or to unsubscribe.  It is:

  12345

Normally, Mailman will remind you of your freebsd.org mailing list
passwords once every month, although you can disable this if you
prefer.  This reminder will also include instructions on how to
unsubscribe or change your account options.  There is also a button on
your options page that will email your current password to you.
</literallayout>
		
    <para>A partir da url especificada na sua mensagem de boas vindas
      (<quote>Welcome</quote>) voc&ecirc; deve visitar a p&aacute;gina
      de gerenciamento de conta (<quote>Account management
      page</quote>) e entrar com a sua requisi&ccedil;&atilde;o de
      cancelamento da sua inscri&ccedil;&atilde;o 
      (<quote>Unsubscribe</quote>) na lista
      de discuss&atilde;o FreeBSD-questions.</para>

    <para>Uma mensagem de confirma&ccedil;&atilde;o ser&aacute;
      enviada para voc&ecirc; pelo <application>mailman</application>;
      siga as instru&ccedil;&otilde;es contidas nesta mensagem para
      finalizar o processo de cancelamento.</para>

    <para>Se voc&ecirc; j&aacute; fez isso, e ainda continua
      recebendo mensagens da lista, envie uma mensagem para
      <email>freebsd-questions-request@FreeBSD.org</email> pedindo
      ajuda e eles ir&atilde;o resolver as coisas para voc&ecirc;.
      <emphasis>N&atilde;o</emphasis> envie a sua mensagem para a
      FreeBSD-questions:  eles n&atilde;o podem
      ajud&aacute;-lo.</para>
  </sect1>

  <sect1>
    <title id="askwho">Devo perguntar na <literal>-questions</literal>
      ou na <literal>-hackers</literal>?</title>

    <para>Duas listas de discuss&atilde;o lidam com quest&otilde;es
      gerais sobre o FreeBSD, <literal>FreeBSD-questions</literal> e
      <literal>FreeBSD-hackers</literal>.  Em alguns casos, n&atilde;o
      &eacute; realmente muito simples saber para qual dos grupos
      voc&ecirc; deve perguntar.  O crit&eacute;rio seguinte deve
      ajuda-lo nessa decis&atilde;o para 99% de todas as
      d&uacute;vidas, entretanto:</para>

    <orderedlist>
      <listitem>
	<para>Se a pergunta &eacute; de natureza geral, pergunte na
	  <literal>FreeBSD-questions</literal>.  Exemplos de perguntas
	  desta natureza s&atilde;o as perguntas sobre a
	  instala&ccedil;&atilde;o do FreeBSD ou sobre o uso
	  especifico de algum utilit&aacute;rio &unix;.</para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; acredita que a pergunta est&aacute;
	  relacionada a uma falha, mas voc&ecirc; n&atilde;o tem
	  certeza disso ou n&atilde;o sabe como procur&aacute;-lo,
	  envie a mensagem para a <literal>FreeBSD-questions
	</literal>.</para>
      </listitem>

      <listitem>
	<para>Se a pergunta se relaciona a uma falha, e voc&ecirc; tem
	  <emphasis>certeza</emphasis> de que &eacute; uma falha (por
	  exemplo, voc&ecirc; pode destacar o lugar no c&oacute;digo
	  fonte onde ele ocorre, e voc&ecirc; talvez tenha uma
	  corre&ccedil;&atilde;o), ent&atilde;o envie a mensagem para
	  a <literal>FreeBSD-hackers</literal>.</para>
      </listitem>

      <listitem>
	<para>Se a pergunta se relaciona a melhorias para o FreeBSD, e
	  voc&ecirc; pode fazer sugest&otilde;es sobre como
	  implement&aacute;-las, ent&atilde;o envie a mensagem para a
	  <literal>FreeBSD-hackers</literal>.</para>
      </listitem>
    </orderedlist>

    <para>Existe um grande n&uacute;mero de outras listas de
      discuss&atilde;o especializadas, por exemplo,
      <literal>FreeBSD-isp</literal>, a qual trata dos interesses dos
      ISPs (Provedores de Servi&ccedil;o Internet) que rodam o
      FreeBSD.  No caso de voc&ecirc; ser um ISP, isso n&atilde;o
      significa que deve enviar automaticamente suas perguntas para a
      <literal> FreeBSD-isp</literal>.  O crit&eacute;rio acima
      continua v&aacute;lido, e voc&ecirc; deve continuar seguindo-o,
      uma vez que voc&ecirc; ir&aacute; obter melhores resultados
      desta forma.</para>
  </sect1>

  <sect1>
    <title id="before">Antes de enviar uma pergunta</title>

    <para>Voc&ecirc; pode (e deve) fazer algumas coisas voc&ecirc;
      mesmo antes de fazer uma pergunta em uma lista de
      discuss&atilde;o:</para>

    <itemizedlist>
      <listitem>
        <para>Tente resolver o problema sozinho.  Se voc&ecirc;
	  enviar uma pergunta a qual mostre que voc&ecirc; j&aacute;
	  tentou resolver o problema, geralmente ir&aacute; atrair
	  mais a aten&ccedil;&atilde;o das pessoas que lerem a sua
	  pergunta.  Al&eacute;m disso, ao tentar resolver o problema,
	  voc&ecirc; ir&aacute; refor&ccedil;ar o seu dom&iacute;nio
	  do FreeBSD, o que ir&aacute; eventualmente possibilitar que
	  voc&ecirc; o utilize para ajudar outras pessoas, respondendo
	  as perguntas que elas enviarem para as listas de
	  discuss&atilde;o.</para>
      </listitem>

      <listitem>
        <para>Leia as p&aacute;ginas de manual, e a
	documenta&ccedil;&atilde;o do FreeBSD (elas est&atilde;o
	instaladas em <filename>/usr/doc</filename> ou
	acess&iacute;veis via WWW em <ulink
	URL="http://www.FreeBSD.org"> http://www.FreeBSD.org</ulink>),
	especialmente o <ulink
	URL="&url.books.handbook;/index.html">handbook</ulink> e o
	<ulink URL="&url.books.faq;/index.html">FAQ</ulink>.</para>
      </listitem>

      <listitem>
        <para>Navegue ou fa&ccedil;a uma busca no hist&oacute;rico da
	  lista para ver se a sua pergunta ou uma semelhante a ela
	  j&aacute; n&atilde;o foi feita (e possivelmente respondida)
	  antes.  Voc&ecirc; pode navegar e/ou realizar buscas no
	  hist&oacute;rico das listas de discuss&atilde;o nos URLs
	  <ulink
	  URL="http://www.FreeBSD.org/mail">http://www.FreeBSD.org/mail
	  </ulink> e <ulink
	  URL="http://www.FreeBSD.org/search/search.html#mailinglists">
	  http://www.FreeBSD.org/search/search.html#mailinglists</ulink>
	  respectivamente.  Isto tamb&eacute;m pode ser feito em
	  outros locais, como por exemplo em <ulink
	  URL="http://marc.theaimsgroup.com">http://marc.theaimsgroup.com
	  </ulink>.</para>
      </listitem>

      <listitem>
        <para>Utilize um mecanismo de busca como o <ulink
	  URL="http://www.google.com">Google</ulink> ou o <ulink
	  URL="http://www.yahoo.com">Yahoo</ulink> para procurar
	  respostas para a sua d&uacute;vida.  O Google possui uma
	  <ulink URL="http://www.google.com/bsd">interface especifica
	  para buscas relacionadas aos *BSDs</ulink>.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1>
    <title id="submit">Como enviar uma pergunta</title>

    <para>Quando enviar uma pergunta para a FreeBSD-questions,
      considere os seguintes pontos:</para>

    <itemizedlist>
      <listitem>
	<para>Lembre-se que ningu&eacute;m &eacute; pago para
	  responder as suas perguntas sobre FreeBSD.  Eles o fazem de
	  boa vontade.  Voc&ecirc; pode influenciar positivamente esta
	  boa vontade atrav&eacute;s do envio de uma pergunta bem
	  formulada fornecendo a maior quantidade poss&iacute;vel de
	  informa&ccedil;&otilde;es relevantes.  Voc&ecirc; pode
	  influenciar de forma negativa esta boa vontade ao enviar uma
	  pergunta incompleta, ileg&iacute;vel ou rude.  &Eacute;
	  perfeitamente poss&iacute;vel enviar uma mensagem para a
	  FreeBSD-questions e n&atilde;o obter nenhuma resposta mesmo
	  que voc&ecirc; siga estas regras.  Mas &eacute; muito mais
	  prov&aacute;vel que voc&ecirc; n&atilde;o obtenha a resposta
	  se voc&ecirc; n&atilde;o as seguir.  No restante deste
	  documento, veremos como obter o m&aacute;ximo de resultado
	  para as suas perguntas na FreeBSD-questions.</para>
      </listitem>

      <listitem>
	<para>Nem todos que respondem as perguntas sobre FreeBSD
	  l&ecirc;em todas as mensagens: Eles olham para o assunto da
	  mensagem e decidem se os interessa.  Claramente, &eacute; de
	  seu interesse especificar o campo assunto de forma adequada.
	  <quote>Problema com o FreeBSD</quote> ou
	  <quote>Ajudem-me</quote> n&atilde;o s&atilde;o adequados.
	  Se voc&ecirc; n&atilde;o especificar um assunto, muitas
	  pessoas n&atilde;o se incomodar&atilde;o em ler a sua
	  mensagem.  Se o assunto da sua mensagem n&atilde;o for
	  espec&iacute;fico o suficiente, as pessoas que podem
	  responder a sua duvida podem n&atilde;o se interessar em ler
	  a sua mensagem.<para>
      </listitem>

      <listitem>
	<para>Formate sua mensagem de forma que ela seja
	  leg&iacute;vel, e POR FAVOR, N&Atilde;O GRITE!!!!!.
	  N&oacute;s sabemos que muitas pessoas n&atilde;o tem a
	  l&iacute;ngua inglesa como seu idioma nativo, e tentamos
	  fazer concess&otilde;es para estas pessoas, mas &eacute;
	  realmente doloroso tentar ler uma mensagem cheia de erros
	  tipogr&aacute;ficos ou sem nenhuma quebra de linha.</para>

	<para>N&atilde;o subestime o efeito de uma mensagem de email
	  mal formatada, e n&atilde;o apenas na lista de
	  discuss&atilde;o FreeBSD-questions.  A sua mensagem de email
	  &eacute; tudo que as outras pessoas v&ecirc;em de
	  voc&ecirc;, e se ela for mal formatada, possui apenas uma
	  linha por par&aacute;grafo, &eacute; mal escrita, ou
	  est&aacute; cheia de erros, ela dar&aacute; as outras
	  pessoas uma impress&atilde;o negativa de voc&ecirc;.</para>

	<para>Muitas das mensagens mal formatadas v&ecirc;m de <ulink
	  url="http://www.lemis.com/email.html">clientes de email
	  ruins ou mal configurados</ulink>.  Os clientes de email a
	  seguir s&atilde;o conhecidos por enviar mensagens mal
	  formatadas:</para>

	<itemizedlist>
	  <listitem>
	    <para>cc:Mail</para>
	  </listitem>

	  <listitem>
	    <para>&eudora;</para>
	  </listitem>

	  <listitem>
	    <para>exmh</para>
	  </listitem>

	  <listitem>
	    <para>&microsoft; Exchange</para>
	  </listitem>

	  <listitem>
	    <para>&microsoft; Internet Mail</para>
	  </listitem>

	  <listitem>
	    <para>&microsoft; &outlook;</para>
	  </listitem>

	  <listitem>
	    <para>&netscape;</para>
	  </listitem>
	</itemizedlist>

	<para>Como voc&ecirc; pode ver, os clientes de email do mundo
	  Microsoft s&atilde;o ofensores freq&uuml;entes.  Sempre que
	  for poss&iacute;vel utilize um cliente de email &unix;.  Se
	  voc&ecirc; precisar utilizar um cliente de email no ambiente
	  Microsoft, tenha certeza de que o configurou corretamente.
	  Tente n&atilde;o utilizar o <acronym>MIME</acronym>:  muitas
	  pessoas usam clientes de email que n&atilde;o se entendem
	  bem com mensagens em formato MIME.</para>
      </listitem>

      <listitem>
	<para>Certifique-se de que sua data e hora, assim como o seu
	  fuso hor&aacute;rio est&atilde;o corretamente configurados.
	  Isso pode parecer besteira, uma vez que sua mensagem ainda
	  estar&aacute; l&aacute;, mas muitas pessoas que voc&ecirc;
	  esta tentando alcan&ccedil;ar come&ccedil;am o dia com
	  centenas de mensagens para ler.  Eles freq&uuml;entemente
	  ordenam as mensagens que chegaram por assunto e por data e
	  se a sua mensagem n&atilde;o vier antes da primeira
	  resposta, eles podem assumir que a mensagem est&aacute;
	  faltando e n&atilde;o se incomodar&atilde;o em
	  procura-la.</para>
      </listitem>

      <listitem>
	<para>N&atilde;o inclua perguntas que n&atilde;o se relacionam
	  em uma mesma mensagem.  Primeiro, uma mensagem longa tende a
	  espantar as pessoas, e segundo, &eacute; mais dif&iacute;cil
	  de conseguir que as pessoas que podem responder a todas as
	  suas perguntas leiam a mensagem.</para>
      </listitem>

      <listitem>
	<para>Forne&ccedil;a o maior n&uacute;mero de
	  informa&ccedil;&otilde;es relevantes quanto poss&iacute;vel.
	  Esta &eacute; uma &aacute;rea dif&iacute;cil, e n&oacute;s
	  precisamos detalhar quais informa&ccedil;&otilde;es
	  voc&ecirc; deve enviar, mas aqui est&aacute; um
	  come&ccedil;o:</para>
	
	<itemizedlist>
	  <listitem>
	    <para>Em praticamente todos os casos &eacute; importante
	      saber qual a vers&atilde;o do FreeBSD que voc&ecirc;
	      est&aacute; utilizando.  Um caso particular &eacute; o
	      FreeBSD-Current, para o qual voc&ecirc; deve fornecer
	      tamb&eacute;m a data do c&oacute;digo, embora as
	      perguntas sobre o ramo -Current n&atilde;o devam ser
	      encaminhadas para a lista FreeBSD-questions.</para>
	  </listitem>

	  <listitem>
	    <para>No caso de qualquer problema que <emphasis>possa
	      estar </emphasis> relacionado a hardware, envie
	      informa&ccedil;&otilde;es sobre o seu hardware.  No caso
	      de d&uacute;vida, assuma que seu problema pode ser
	      causado por um problema de hardware e nos envie suas
	      especifica&ccedil;&otilde;es.  Que tipo de CPU
	      voc&ecirc; est&aacute; utilizando?  Qual o clock do
	      processador?  Qual a placa m&atilde;e?  Qual a
	      quantidade de mem&oacute;ria f&iacute;sica instalada?
	      Quais outros perif&eacute;ricos voc&ecirc; possui?  Ao
	      responder perguntas como essa voc&ecirc; ter&aacute; uma
	      lista com as informa&ccedil;&otilde;es b&aacute;sicas a
	      enviar.</para>

	    <para>H&aacute; uma chamada de julgamento aqui,
	      naturalmente, a sa&iacute;da do comando &man.dmesg.8;
	      freq&uuml;entemente &eacute; muito &uacute;til, uma vez
	      que ele nos diz n&atilde;o apenas que componentes de
	      hardware que voc&ecirc; esta utilizando, como
	      tamb&eacute;m qual a vers&atilde;o do FreeBSD.</para>
	  </listitem>

	  <listitem>
	    <para>Se voc&ecirc; obtiver uma mensagem de erro,
	      n&atilde;o diga <quote>Eu recebi uma mensagem de
	      erro</quote>, diga (por exemplo) <quote>Eu recebi a
	      mensagem de erro 'No route to host'</quote>.</para>
	  </listitem>

	  <listitem>
	    <para>Se o seu sistema deu um panic, n&atilde;o diga
	      <quote>Meu sistema sofre um panic</quote>, diga (por
	      exemplo) <quote>Meu sistema sofreu um panic e a mensagem
	      de erro foi 'free vnode isn't'</quote>.</para>
	  </listitem>

	  <listitem>
	    <para>Se voc&ecirc; esta com dificuldades na
	      instala&ccedil;&atilde;o do FreeBSD, por favor nos diga
	      que hardware voc&ecirc; possui.  Em particular, &eacute;
	      importante conhecer os IRQs e os endere&ccedil;os de I/O
	      das placas que voc&ecirc; tem instalado na sua
	      m&aacute;quina.</para>
	  </listitem>

	  <listitem>
	    <para>Se voc&ecirc; est&aacute; com dificuldades para
	      colocar o PPP para rodar, descreva a sua
	      configura&ccedil;&atilde;o.  Qual vers&atilde;o do PPP
	      voc&ecirc; est&aacute; utilizando?  Qual tipo de
	      autentica&ccedil;&atilde;o voc&ecirc; esta usando?
	      Voc&ecirc; possui um IP din&acirc;mico ou
	      est&aacute;tico?  Quais tipos de mensagens voc&ecirc;
	      tem no seu arquivo de log?</para>
	  </listitem>
	</itemizedlist>
      </listitem>

      <listitem>
          <para>A maioria das informa&ccedil;&otilde;es que
	    voc&ecirc; precisa fornecer s&atilde;o as sa&iacute;das de
	    programas, tais como &man.dmesg.8;, ou mensagens de
	    console, as quais usualmente aparecem no
	    <filename>/var/log/messages</filename>.  N&atilde;o tente
	    copiar estas informa&ccedil;&otilde;es digitando-as
	    novamente; isto &eacute; realmente desnecess&aacute;rio, e
	    voc&ecirc; estar&aacute; cometendo um erro.  Ao enviar o
	    conte&uacute;do de um arquivo de log, fa&ccedil;a uma
	    c&oacute;pia do arquivo e utilize um editor de textos para
	    cortar as partes desnecess&aacute;rias, deixando apenas as
	    que forem relevantes para a interpreta&ccedil;&atilde;o do
	    problema, ou simplesmente copie e cole o trecho relevante
	    para a sua mensagem.  Para enviar a sa&iacute;da de
	    comandos, como o &man.dmesg.8;, redirecione a sa&iacute;da
	    do comando para um arquivo e inclua-o em sua mensagem.
	    Por exemplo,</para>

	<screen>&prompt.user; <userinput>dmesg &gt; /tmp/dmesg.out</userinput></screen>

	<para>Este comando redireciona as informa&ccedil;&otilde;es
	  para o arquivo <filename>/tmp/dmesg.out</filename>.</para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; fez tudo isso, e continua sem receber uma
	  resposta, podem existir outras raz&otilde;es.  Por exemplo,
	  o problema pode ser muito complicado e ningu&eacute;m
	  conhece a resposta, ou ent&atilde;o a pessoa que conhece a
	  resposta est&aacute; offline.  Se voc&ecirc; n&atilde;o
	  obtiver uma resposta depois de, digamos, uma semana, pode
	  ser &uacute;til reenviar a mensagem.  Se voc&ecirc;
	  n&atilde;o obtiver resposta para a sua segunda mensagem,
	  significa que voc&ecirc; provavelmente n&atilde;o ir&aacute;
	  obter uma nesta lista.  Reenviar a mesma pergunta diversas
	  vezes para a mesma lista apenas ir&aacute; torn&aacute;-lo
	  impopular.</para>
      </listitem>
    </itemizedlist>

    <para>Para resumir, vamos assumir que voc&ecirc; conhece a
      resposta para as seguintes quest&otilde;es (sim, ambas
      s&atilde;o sobre o mesmo assunto).  Escolha qual destas duas
      perguntas voc&ecirc; estaria mais preparado para
      responder:</para>

    <example>
      <title>Mensagem 1</title>

      <literallayout class="monospaced">Subject: HELP!!?!??
Eu simplesmente n&atilde;o consigo colocar o raio do FreeBSD para funcionar,
e eu sou geralmente bom nisso, mas eu nunca vi nada t&atilde;o dif&iacute;cil de
instalar, ele simplesmente n&atilde;o funciona, n&atilde;o importa o que eu fa&ccedil;a.
Por que voc&ecirc;s rapazes n&atilde;o me dizem o que eu estou fazendo errado?
</literallayout>
    </example>

    <example>
      <title>Mensagem 2</title>

    <literallayout class="monospaced">Subject: Problemas para instalar o FreeBSD

Eu comprei um CD do FreeBSD 2.1.5 na Walnut Creek, e eu estou tendo
muita dificuldade para instala-lo.  Eu possuo um 486 66Mhz com 16 Mb de
mem&oacute;ria, uma controladora SCSI Adaptec 1540A, um HD de 1.2GB Quantum
Fireball e um drive cd cdrom Toshiba 3501XA.  A instala&ccedil;&atilde;o funciona
perfeitamente,  mas quando eu dou boot no sistema, eu recebo a
mensagem <quote>Missing Operating System</quote>.</literallayout>
    </example>
  </sect1>

  <sect1>
    <title id="followup">Como fazer um follow up em uma
      pergunta</title>


    <para>Frequentemente voc&ecirc; pode desejar enviar alguma
      informa&ccedil;&atilde;o adicional para uma pergunta que
      voc&ecirc; j&aacute; enviou.  A melhor forma de fazer isto
      &eacute; dando um replay na sua mensagem original.  Isto tem 3
      vantagens></para>

    <orderedlist>
      <listitem>
	<para>Voc&ecirc; inclui o texto original da mensagem, assim as
	  pessoas ir&atilde;o saber sobre oque voc&ecirc; esta
	  falando.  N&atilde;o se esque&ccedil;a de remover as partes
	  desnecess&aacute;rias da mensagem original.</para>
      </listitem>

      <listitem>
	<para>O texto na linha de assunto permanecer&aacute; o mesmo
	  (voc&ecirc; se lembrou de colocar um, n&atilde;o lembrou?).
	  Muitos clientes de email ir&atilde;o ordenar as mensagens
	  pelo assunto.  Isto ajuda a manter as mensagens de um mesmo
	  grupo juntas.</para>
      </listitem>

      <listitem>
	<para>Os n&uacute;meros de refer&ecirc;ncia da mensagem no
	  cabe&ccedil;alho ir&atilde;o apontar para a mensagem
	  anterior.  Alguns clientes de email, como, por exemplo, o
	  <ulink url="http://www.mutt.org/">mutt</ulink>, podem
	  agrupar as mensagens por <emphasis>thread</emphasis>,
	  mostrando o relacionamento exato entre as mensagens.</para>
      </listitem>
    </orderedlist>
  </sect1>

  <sect1>
    <title id="answer">Como responder uma pergunta</title>


    <para>Antes que voc&ecirc; responda uma pergunta para
      FreeBSD-questions, considere:</para>

    <orderedlist>
      <listitem>
	<para>Muitos dos pontos relacionados ao envio de uma pergunta,
	  tamb&eacute;m se aplicam quando respondemos &agrave; uma.
	  Leia os t&oacute;picos anteriores.</para>
      </listitem>

      <listitem>
	<para>Algu&eacute;m j&aacute; respondeu a pergunta?  A melhor
	  forma de verificar isso &eacute; ordenando as mensagens pelo
	  campo assunto:  Ent&atilde;o (esperamos) voc&ecirc;
	  ir&aacute; ver a pergunta seguida por qualquer resposta,
	  todas juntas.</para>
	
	<para>Se algu&eacute;m j&aacute; tiver respondido a pergunta,
	  isso n&atilde;o significa automaticamente que voc&ecirc;
	  n&atilde;o deve enviar outra.  Mas tenha o bom senso de ler
	  todas as respostas j&aacute; enviadas antes de enviar as
	  suas.</para>
      </listitem>

      <listitem>
	<para>Voc&ecirc; tem algo para contribuir alem daquilo que
	  j&aacute; foi dito ?  Em geral, respostas como <quote>Sim,
	  eu tamb&eacute;m</quote> n&atilde;o ajudam muito, mas
	  &eacute; claro existem exce&ccedil;&otilde;es, como por
	  exemplo quando algu&eacute;m est&aacute; descrevendo um
	  problema que esta tendo, e que ele n&atilde;o sabe se foi
	  ocasionado por uma falha dele ou se alho est&aacute; errado
	  com o hardware ou com o software que ele est&aacute; usando.
	  Se voc&ecirc; enviar uma resposta do tipo <quote>eu
	  tamb&eacute;m</quote>, voc&ecirc; tamb&eacute;m deve incluir
	  qualquer outra informa&ccedil;&atilde;o relevante que
	  voc&ecirc; tenha.</para>
      </listitem>

      <listitem>
	<para>Voc&ecirc; tem certeza de que entendeu a pergunta?
	  Muito freq&uuml;entemente, a pessoa que faz uma pergunta
	  esta confusa ou n&atilde;o se expressou muito bem.  Mesmo
	  com a melhor compreens&atilde;o do sistema, &eacute;
	  f&aacute;cil enviar uma mensagem que n&atilde;o responda a
	  pergunta.  Isto n&atilde;o ajuda: voc&ecirc; ir&aacute;
	  deixar a pessoa que enviou a pergunta mais frustrada ou
	  confusa do que antes.  Se ningu&eacute;m mais tiver
	  respondido, e voc&ecirc; tamb&eacute;m n&atilde;o tiver
	  certeza, voc&ecirc; sempre pode solicitar maiores
	  informa&ccedil;&otilde;es.</para>
      </listitem>

      <listitem>
	<para>Voc&ecirc; tem certeza de que a resposta est&aacute;
	  correta?  Se n&atilde;o, espere um dia ou mais.  Se
	  ningu&eacute;m mais aparecer com uma resposta melhor,
	  voc&ecirc; pode enviar a sua resposta e dizer, por exemplo,
	  <quote>Eu n&atilde;o tenho certeza se estou correto, mas
	  como ningu&eacute;m mais respondeu...  Porque voc&ecirc;
	  n&atilde;o tenta substituir o seu CDROM ATAPI por
	  outro?</quote>.</para>
      </listitem>

      <listitem>
	<para>A menos que tenha uma boa raz&atilde;o para fazer
	  diferente, responda para a pessoa que enviou a pergunta e
	  para a FreeBSD-questions.  Muitas pessoas inscritas na lista
	  s&atilde;o <quote>observadoras</quote>: Elas aprendem
	  atrav&eacute;s da leitura das mensagens enviadas e
	  respondidas pelas outras pessoas.  Se voc&ecirc; deixar uma
	  mensagem que &eacute; de interesse geral fora da lista,
	  voc&ecirc; estar&aacute; privando estas pessoas dessa
	  informa&ccedil;&atilde;o.  Seja cuidadoso como as respostas
	  em grupo;  muitas pessoas enviam mensagens com centenas de
	  endere&ccedil;os em CCs.  Se este &eacute; o caso, tenha
	  certeza de ajustar as linhas Cc: de forma apropriada.</para>
      </listitem>

      <listitem>
	<para>Inclua o texto relevante da mensagem original.  Mantenha
	  o m&iacute;nimo necess&aacute;rio do texto original, mas
	  n&atilde;o corte demais.  Ele precisa ser conciso o
	  suficiente para que uma pessoa que n&atilde;o tenha lido a
	  mensagem original entender sobre o que voc&ecirc;
	  est&aacute; falando.</para>
      </listitem>

      <listitem>
	<para>Utilize alguma t&eacute;cnica para identificar qual
	  parte da mensagem veio da mensagem original e qual parte foi
	  adicionada por voc&ecirc;.  Eu pessoalmente acho que
	  adicionar <quote><literal>&gt; </literal></quote> no inicio
	  de cada linha da mensagem original &eacute; o que funciona
	  melhor.  Procure deixar um espa&ccedil;o em branco depois do
	  <quote><literal>&gt; </literal></quote> e sempre use uma
	  linha vazia entre a sua resposta e o texto original, isso
	  deixar&aacute; sua mensagem mais leg&iacute;vel.</para>
      </listitem>

      <listitem>
	<para>Coloque sua resposta no local correto (Depois do texto
	  ao qual ela se aplica).  &Eacute; muito dif&iacute;cil ler
	  uma sequ&ecirc;ncia de mensagens, onde as respostas vem
	  antes do texto ao qual elas se aplicam.</para>
      </listitem>

      <listitem>
	<para>A maioria dos clientes de email altera a linha de
	assunto em uma resposta adicionando um texto como <quote>Re:
	</quote> ao inicio da linha.  Se o seu cliente n&atilde;o
	fizer isso de forma autom&aacute;tica voc&ecirc; deve
	faz&ecirc;-lo manualmente.</para>
      </listitem>

      <listitem>
	<para>Se a pessoa que enviou a pergunta n&atilde;o respeitou
	  as conven&ccedil;&otilde;es de formata&ccedil;&atilde;o
	  (linhas muito longas, Linha de assunto inapropriada, etc),
	  <emphasis>por favor</emphasis>, corrija-a.  No caso do uso
	  de uma linha de assunto inapropriada (como, por exemplo,
	  <quote>Ajudem-me!!??</quote>), altere a linha de assunto
	  para algo relacionado ao assunto da mensagem, mas mantenha
	  uma indica&ccedil;&atilde;o de qual era o assunto original,
	  por exemplo,<quote>Re: Dificuldades com o PPP em modo
	  s&iacute;ncrono (era: Ajudem-me!!??)</quote>.  Desta forma
	  as outras pessoas que est&atilde;o tentando acompanhar a
	  discuss&atilde;o ir&atilde;o ter menos dificuldades para
	  acompanh&aacute;-la.</para>
	
	<para>Nesses casos, &eacute; apropriado dizer o que voc&ecirc;
	  fez e porque voc&ecirc; o fez, mas tente a n&atilde;o ser
	  rude.  Se voc&ecirc; acreditar que n&atilde;o pode responder
	  sem ser rude, simplesmente n&atilde;o responda.</para>

	<para>Se voc&ecirc; quiser responder uma mensagem por causa
	  de sua m&aacute; formata&ccedil;&atilde;o, responda-a
	  apenas para quem a enviou, e n&atilde;o para a lista.
	  Se voc&ecirc; preferir, na resposta voc&ecirc; pode apenas
	  recomendar que ele leia este artigo.</para>
      </listitem>
    </orderedlist>
  </sect1>
</article>
