<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: n.nn
-->

    <chapter>
      <title>Administration R&eacute;seau Avanc&eacute;e</title>
      &trans.a.haby;
      
      <sect1 id="routing">
	<title>Passerelles et routes</title>
	
	<para><emphasis>Contribution de &a.gryphon;.<!-- <br> -->6 Octobre
	    1995.</emphasis></para>
	
	<para>Pour qu'une machine puisse en contacter une autre, il faut
          que soit install&eacute; un m&eacute;canisme qui d&eacute;crive comment aller de l'une
          &agrave; l'autre. C'est ce que l'on appelle le routage. Une
	  &ldquo;route&rdquo; est d&eacute;finie par deux adresses : une 
	  &ldquo;destination&rdquo; et une &ldquo;passerelle&rdquo;. Cette
          paire signifie que pour atteindre cette 
          <emphasis>destination</emphasis>, vous devez passer par cette
	  <emphasis>passerelle</emphasis>. Il y a trois sorte de destinations:
	  les machines elles-m&ecirc;mes, les sous-r&eacute;seaux, et 
          <foreignphrase>default</foreignphrase>&nbsp;-&nbsp;la destination 
          &ldquo;par d&eacute;faut&rdquo;. La <foreignphrase>default 
          route</foreignphrase>&nbsp;-&nbsp;&ldquo;route par 
          d&eacute;faut&rdquo;&nbsp;-&nbsp;est utilis&eacute;e
          lorsqu'aucune autre route n'est applicable. Nous parlerons un peu plus
          des routes par d&eacute;faut par la suite. Il y a aussi trois sortes de
          passerelles: les machines elles-m&ecirc;mes, les interfaces (aussi appel&eacute;es
	  &ldquo;liens&rdquo;), et les adresses Ethernet mat&eacute;riel.</para>
	
	<sect2>
	  <title>Un exemple</title>
	  
	  <para>Pour illustrer diff&eacute;rents aspects du routage, nous utiliserons
            l'exemple suivant, qui est le r&eacute;sultat de la commande
	    <command>netstat -r</command>:</para>
	  
	  <informalexample>
	    <screen>Destination      Gateway            Flags     Refs     Use     Netif Expire

default          outside-gw         UGSc       37      418      ppp0
localhost        localhost          UH          0      181       lo0
test0            0:e0:b5:36:cf:4f   UHLW        5    63288       ed0     77
10.20.30.255     link#1             UHLW        1     2421 
foobar.com       link#1             UC          0        0 
host1            0:e0:a8:37:8:1e    UHLW        3     4601       lo0
host2            0:e0:a8:37:8:1e    UHLW        0        5       lo0 =>
host2.foobar.com link#1             UC          0        0
224              link#1             UC          0        0</screen>
	  </informalexample>
	  
	  <para>Les deux premi&egrave;res lignes d&eacute;finissent la route par d&eacute;faut (dont 
            nous parlerons dans la section suivante) et la route
	    <hostid>localhost</hostid>.</para>
	  
	  <para>L'interface (colonne <literal>Netif</literal>) qu'il est 
            indiqu&eacute; d'utiliser pour <literal>localhost</literal> est
	    <devicename>lo0</devicename>, que l'on appelle aussi interface
            <foreignphrase>loopback</foreignphrase>&nbsp;-&nbsp;&ldquo;en 
            boucle&rdquo;. Ce qui signifie que tout
            le trafic vers cette destination doit rester interne, au lieu d'&ecirc;tre
            envoy&eacute; sur le r&eacute;seau local, puisqu'il reviendra de toute fa&ccedil;on &agrave; son
            point de d&eacute;part.</para>
	  
	  <para>Les adresses <hostid role="mac">0:e0:...</hostid> sautent 
            ensuite aux yeux. Ce sont les adresses Ethernet mat&eacute;riel. FreeBSD
            reconna&icirc;tra automatiquement toute machine
	    (<hostid>test0</hostid> dans l'exemple) sur le r&eacute;seau Ethernet local
            et ajoutera une route vers celle-ci, directement via l'interface
            Ethernet, <devicename>ed0</devicename>. Il y a aussi un d&eacute;lai
	    (colonne <literal>Expire</literal>) associ&eacute; &agrave; ce type de route,
            qui sert lorsque nous n'entendons plus parler de cette machine
            pendant un certain temps. Dans ce cas, la route est automatiquement
            supprim&eacute;e. Ces machines sont identifi&eacute;es par un m&eacute;canisme appel&eacute; RIP
	    (<foreignphrase>Routing Information 
            Protocol</foreignphrase>&nbsp;-&nbsp;&ldquo;protocole 
            d'information de routage&rdquo;), qui construit les routes vers les
            machines locales en d&eacute;terminant le chemin le plus court.</para>
	  
	  <para>FreeBSD ajoutera aussi de routes de sous-r&eacute;seau pour le 
            sous-r&eacute;seau local (<hostid role="ipaddr">10.20.30.255</hostid> est
            l'adresse de diffusion du sous-r&eacute;seau 
            <hostid role="ipaddr">10.20.30</hostid>, et
	    <hostid role="domainname">foobar.com</hostid> est le nom de 
            domaine associ&eacute; &agrave; ce sous-r&eacute;seau). La d&eacute;nomination
	    <literal>link#1</literal> se rapporte &agrave; la premi&egrave;re interface
            Ethernet de la machine. Vous constaterez qu'il n'y a pas d'autre
            interface associ&eacute;e &agrave; ces routes.</para> 
	  
	  <para>Ces deux types de routes sont automatiquement configur&eacute;es
            par un &ldquo;d&eacute;mon&rdquo; appel&eacute; <command>routed</command>. 
            Si ce dernier ne tourne pas, il ne pourra y avoir que des routes
            statiques (i.e. explicitement d&eacute;finies).</para>
	  
	  <para>La ligne <literal>host1</literal> se rapporte &agrave; notre machine,
            qui est identifi&eacute;e par son interface Ethernet. Comme nous sommes
            l'&eacute;metteur, FreeBSD sait qu'il faut utiliser l'interface &ldquo;en
            boucle&rdquo;, plut&ocirc;t que d'envoyer les donn&eacute;es sur l'interface
            Ethernet.</para>
	  
	  <para>Les deux lignes <literal>host2</literal> montrent ce qui ce
            passe quand on utilise un alias avec <command>ifconfig</command>
            (voyez la section sur Ethernet pour savoir pour quelles raisons
             on peut vouloir faire cela). Le symbole <literal>=&gt;</literal>
            qui suit l'interface <devicename>lo0</devicename> indique que non
            seulement nous utilisons la &ldquo;boucle&rdquo; (puisque c'est
            aussi une adresse qui se rapporte &agrave; la machine locale), mais que 
            c'est, plus pr&eacute;cisement, un alias. Ce type de route n'appara&icirc;t
            que sur la machine pour laquelle est d&eacute;fini l'alias; sur toutes
            les autres machines du r&eacute;seau local, il n'y aura qu'une ligne
	    <literal>link#1</literal> pour cette machine.</para>
	  
	  <para>La derni&egrave;re ligne (sous-r&eacute;seau destinataire 
          <literal>224</literal>) concerne le 
          <foreignphrase>MultiCasting</foreignphrase>&nbsp;-&nbsp;diffusion sur 
          plusieurs r&eacute;seaux, dont nous parlerons dans une
	  autre section.</para>
	  
	  <para>L'autre colonne dont il faut parler est la colonne
            <literal>Flags</literal>. Chaque route a diff&eacute;rentes 
            caract&eacute;ristiques que d&eacute;crit cette colonne. Voici une courte table
            qui liste certains de ces indicateurs et leurs 
            significations:</para>
	  
	  <informaltable frame="none">
	    <tgroup cols="2">
	      <tbody>
		<row>
		  <entry>U</entry>
		  <entry>Active (&ldquo;Up&rdquo;): La route est 
                    active.</entry>
		</row>
		
		<row>
		  <entry>H</entry>
		  <entry>H&ocirc;te: La destination de la route est une 
                    machine.</entry>
		</row>
	      
		<row>
		  <entry>G</entry>
		  <entry>Passerelle (&ldquo;Gateway&rdquo;): Envoyer tout ce
                    qui regarde cette destination sur la machine distante 
                    indiqu&eacute;e, qui saura &agrave; qui transmettre ensuite.</entry>
		</row>
	      
		<row>
		  <entry>S</entry>
		  <entry>Statique: Cette route a &eacute;t&eacute; configur&eacute;e &agrave; la main et 
                    non g&eacute;n&eacute;r&eacute;e automatiquement par le syst&egrave;me.</entry>
		</row>
	      
		<row>
		  <entry>C</entry>
		  <entry>Clone: G&eacute;n&eacute;rer une nouvelle route sur la base de
                    celle-ci pour les machines auxquelles nous nous connectons.
                    Ce type de route est normalement utilis&eacute; pour les r&eacute;seaux
                    locaux.</entry>
		</row>
	      
		<row>
		  <entry>W</entry>
		  <entry>Clon&eacute;e (&ldquo;WasCloned&rdquo;): Cette route a &eacute;t&eacute; 
                    auto-configur&eacute;e (Clone) &agrave; partir d'une route pour le
                    r&eacute;seau local.</entry>
		</row>
	      
		<row>
		  <entry>L</entry>
		  <entry>Link: La route fait r&eacute;f&eacute;rence &agrave; une adresse Ethernet
                    mat&eacute;rielle.</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>
	  
	</sect2>
	
	<sect2>
	  <title>Routes par d&eacute;faut</title>
	  
	  <para>Quand le syst&egrave;me local doit &eacute;tablir une connexion avec une
             machine distante, il consulte la table de routage pour voir
             s'il y a d&eacute;j&agrave; une route connue. Si la machine distante appartient
             &agrave; un sous-r&eacute;seau auquel il sait comment se connecter (routes
             clon&eacute;es), alors le syst&egrave;me teste s'il peut se connecter via
             cette interface.</para>
	  
	  <para>Si toutes les routes connues &eacute;chouent, il reste au syst&egrave;me une
            derni&egrave;re option: la route &ldquo;par d&eacute;faut&rdquo;. C'est un type
            particulier de route passerelle (c'est g&eacute;n&eacute;ralement la seule du
            syst&egrave;me), auquel est toujours associ&eacute; l'indicateur
	    <literal>c</literal>. Pour les machines du r&eacute;seau local, cette
            fonction de passerelle est affect&eacute;e &agrave; la machine qui est directement
            connect&eacute;e au monde ext&eacute;rieur (que ce soit par une liasion PPP, ou
            via un dispositif mat&eacute;riel reli&eacute; &agrave; une ligne d&eacute;di&eacute;e).</para>
	  
	  <para>Si vous configurez la route par d&eacute;faut sur la machine qui 
            fonctionne comme passerelle vers le monde ext&eacute;rieur, la route par
            d&eacute;faut sera la passerelle du site de votre Fournisseur d'Acc&egrave;s 
            Internet (FAI).</para>
	  
	  <para>Examinons un exemple de route par d&eacute;faut. Voici une 
            configuration habituelle:
	    
	    <literallayout>
[Local2]  &lt;--ether--&gt;  [Local1]  &lt;--PPP--&gt; [ISP-Serv]  &lt;--ether--&gt;  [T1-GW]
	    </literallayout></para>
	  
	  <para>Les machines <hostid>Local1</hostid> et <hostid>Local2</hostid>
            sont sur votre site, la premi&egrave;re &eacute;tant votre connexion PPP au
            concentrateur de votre fournisseur d'acc&egrave;s. Le r&eacute;seau local de
            votre fournisseur d'acc&egrave;s comporte entre autres un dispositif
            (T1-GW) reli&eacute; &agrave; son point d'entr&eacute;e sur l'Internet.</para> 
	  
	  <para>Les routes par d&eacute;faut sur chacune de vos machines seront:</para>

	  <informaltable frame="none">
	    <tgroup cols="3">
	      <thead>
		<row>
		  <entry>h&ocirc;te</entry>
		  <entry>passerelle par d&eacute;faut</entry>
		  <entry>interface</entry>
		</row>
	      </thead>
	      
	      <tbody>
		<row>
		  <entry>Local2</entry>
		  <entry>Local1</entry>
		  <entry>Ethernet</entry>
		</row>

		<row>
		  <entry>Local1</entry>
		  <entry>T1-GW</entry>
		  <entry>PPP</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>
	  
	  <para>On demande souvent &ldquo;Pourquoi (ou comment) d&eacute;finir T1-GW 
            comme passerelle par d&eacute;faut pour Local1, plut&ocirc;t que le serveur du
            fournisseur auquel elle est connect&eacute;e?&rdquo;.</para> 

	  <para>N'oubliez pas que l'interface PPP utilise, de votre c&ocirc;t&eacute; de la
            connexion, une adresse sur le r&eacute;seau local de votre fournisseur. Les
            routes vers les autres machines sur le r&eacute;seau local de votre
            fournisseur seront g&eacute;n&eacute;r&eacute;es automatiquement. Vous savez d&eacute;j&agrave; comment
            atteindre la machine T1-GW, il n'y a donc pas besoin d'une &eacute;tape
            interm&eacute;diaire qui passe par le serveur de votre fournisseur.</para>
	  
	  <para>Derni&egrave;re remarque, il est habituel d'attribuer l'adresse <hostid
	      role="ipaddr">...1</hostid> &agrave; la passerelle sur votre r&eacute;seau 
            local. Donc (dans notre exemple), si votre espace d'adresses de 
            classe C local est <hostid role="ipaddr">10.20.30</hostid> et celui 
            de votre fournisseur <hostid role="ipaddr">10.9.9</hostid>, alors
            les routes par d&eacute;faut sont:</para>
	  
	  <informaltable frame="none">
	    <tgroup cols="2">
              <tbody>
                <row>
                  <entry>Local2 (10.20.30.2)</entry>
                  <entry>--&gt; Local1 (10.20.30.1)</entry>
                </row>
                <row>
                  <entry>Local1 (10.20.30.1, 10.9.9.30)</entry>
                  <entry>--&gt; T1-GW (10.9.9.1)</entry>
                </row>
              </tbody>
            </tgroup>
	  </informaltable>
	  
	</sect2>
	
	<sect2>
	  <title>Machines sur deux r&eacute;seaux</title>
	  
	  <para>Il y a un autre type de de configuration dont il faut parler,
            c'est celle d'une machine qui est connect&eacute;e &agrave; deux r&eacute;seaux 
            diff&eacute;rents. Techniquement, une machine qui sert de passerelle (comme
            dans l'exemple ci-dessus, en utilisant une connexion PPP) est une
            machine sur deux r&eacute;seaux. Mais l'on utilise de fait cette expression
            (<foreignphrase>dual-homed host</foreignphrase>) pour d&eacute;signer les
            machines qui sont sur deux r&eacute;seaux locaux diff&eacute;rents.</para>
	  
	  <para>Selon le cas, cette machine peut avoir deux cartes Ethernet, 
            chacune ayant une adresse sur l'un des deux sous-r&eacute;seaux. Elle peut
            aussi avoir une seule carte Ethernet, on utilise alors un alias avec
            <command>ifconfig</command>. Le premier cas de figure correspond &agrave;
            deux r&eacute;seaux Ethernet physiquement s&eacute;par&eacute;s, alors qu'on  utilise la
            deuxi&egrave;me configuration lorsqu'il n'y a qu'un seul segment physique,
            mais deux sous-r&eacute;seaux logiquement distincts.</para>
	  
	  <para>Dans les deux cas, les tables de routage sont d&eacute;finies de telle
            sorte que chaque sous-r&eacute;seau sache que cette machine est la 
            passerelle (<foreignphrase>inbound 
            route</foreignphrase>&nbsp;-&nbsp;route entrante) vers l'autre 
            sous-r&eacute;seau. Cette configuration, o&ugrave; la machine sert de pont entre
            les deux sous-r&eacute;seaux, est souvent employ&eacute;e quand il faut mettre en
            place un dispositif de s&eacute;curit&eacute;&nbsp;-&nbsp;filtrage de paquets ou
            coupe-feu&nbsp;-&nbsp;dans l'une, ou dans les deux, 
            directions.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Propagation de route</title>
	  
	  <para>Nous avons d&eacute;j&agrave; expliqu&eacute; comment d&eacute;finir nos routes vers le
            monde ext&eacute;rieur, mais pas comment le monde ext&eacute;rieur sait comment
            nous joindre.</para>
	  
	  <para>Nous savons d&eacute;j&agrave; comment renseigner les tables de routage pour
            que tout le trafic pour un espace d'adresses donn&eacute; (un sous-r&eacute;seau
            de classe C dans notre exemple) soit envoy&eacute; &agrave; une machine pr&eacute;cise
            de ce r&eacute;seau, qui transmettra les paquets entrants.</para>
	  
	  <para>Lorsqu'il attribue une espace d'adresses &agrave; votre site, votre
            fournisseur d'acc&egrave;s d&eacute;finit ses tables de routage de sorte que tout
            le trafic destin&eacute; &agrave; votre sous-r&eacute;seau vous soit envoy&eacute; sur votre
            liaison PPP. Mais comment les autres sites &agrave; l'autre bout du pays
            savent-ils qu'ils doivent passer par votre fournisseur 
            d'acc&egrave;s.</para>
	  
	  <para>Il existe un m&eacute;canisme (assez semblable au syst&egrave;me d'information
            distribu&eacute; du DNS) qui enregistre tous les espaces d'adresses 
            affect&eacute;s, et d&eacute;finit leur point de connexion &agrave; la dorsale Internet.
            Le <foreignphrase>Backbone</foreignphrase>&nbsp;-&nbsp;&ldquo;dorsale&rdquo;&nbsp;&nbsp;comprend
            les liaisons principales qui v&eacute;hiculent le trafic Internet &agrave; travers
            le pays et le monde entier. Chaque machine de la dorsale dispose 
            d'un ensemble de tables ma&icirc;tresses, qui aiguillent le trafic pour
            un r&eacute;seau donn&eacute; vers le transporteur correspondant sur la dorsale,
            et de l&agrave;, par l'interm&eacute;diaire de fournisseurs d'acc&egrave;s 
            successifs, jusqu'&agrave; votre sous-r&eacute;seau.</para>
	  
	  <para>C'est le r&ocirc;le de votre fournisseur d'acc&egrave;s d'annoncer aux sites
            de la dorsale qu'il est le point de connexion (et donc la route
            entrante) de votre site. C'est ce que l'on appelle la propagation
            de route.</para>
	  
	</sect2>
	
	<sect2>
	  <title>En cas de probl&egrave;me</title>
	  
	  <para>Il peut arriver qu'il y ait un probl&egrave;me avec la propagation de
            route et que certains sites ne puissent vous atteindre. La commande
            probablement la plus utile pour savoir si une route commence &agrave;
            avoir des d&eacute;faillances est la commande
	    <citerefentry><refentrytitle>traceroute</refentrytitle><manvolnum>8</manvolnum></citerefentry>. 
            Elle peut aussi vous servir lorsque vous n'arrivez apparemment pas &agrave;
            vous connecter &agrave; une autre machine (i.e. lorsque
	    <citerefentry><refentrytitle>ping</refentrytitle><manvolnum>8</manvolnum></citerefentry> &eacute;choue).</para>
	  
	  <para>La commande
            <citerefentry><refentrytitle>traceroute</refentrytitle><manvolnum>8</manvolnum></citerefentry>
            prend comme param&egrave;tre le nom de la machine avec laquelle vous 
            essayer d'&eacute;tablir une connexion. Elle vous donne la liste des
            passerelles interm&eacute;diaires jusqu'&agrave; la machine cible, ou jusqu'&agrave;
            ce qu'il n'y ait plus de liaison.</para>
	  
	  <para>Pour plus d'informations, voyez les pages de manuel de
	    <citerefentry><refentrytitle>traceroute</refentrytitle><manvolnum>8</manvolnum></citerefentry>.</para>
	  
	</sect2>
      </sect1>
      
      <sect1 id="nfs">
	<title>NFS</title>
	
	<para><emphasis>Contribution de &a.jlind;.</emphasis></para>
	
	<para>Certaines cartes Ethernet ISA ont des limites qui peuvent poser
          de s&eacute;rieux probl&egrave;mes sur un r&eacute;seau, en particulier avec NFS. Ce
          n'est pas une particularit&eacute; propre &agrave; FreeBSD, mais elle affecte aussi
          les syst&egrave;mes FreeBSD.</para>
	
	<para>Ce probl&egrave;me ce produit pratiquement tout le temps quand les 
          syst&egrave;mes (FreeBSD) PC sont sur  le m&ecirc;me r&eacute;seau que des stations de
          travail tr&egrave;s performantes, comme celles de Silicon Graphics, Inc., 
          et Sun Microsystems, Inc. Les montages NFS se font sans difficult&eacute;
          et certaines op&eacute;rations r&eacute;ussissent, puis tout-&agrave;-coup, il semble que
          le serveur ne r&eacute;ponde pas au client, bien que les &eacute;changes avec les
          autres syst&egrave;mes continuent &agrave; se d&eacute;rouler normalement. Cela se 
          manifeste sur la machine cliente, que ce soit un syst&egrave;me FreeBSD ou 
          une station de travail. Sur de nombreux syst&egrave;mes, il n'y a pas moyen
          d'arr&ecirc;ter proprement le client une fois que ce probl&egrave;me appara&icirc;t, la
          seule solution est souvent de r&eacute;initialiser le client, parce que le
          probl&egrave;me NFS ne peut &ecirc;tre r&eacute;solu.</para>

	<para>Bien que la solution &ldquo;correcte&rdquo; soit d'installer une
          carte Ethernet plus performante et de plus grande capacit&eacute; sur le
          syst&egrave;me FreeBSD, il y a une solution de contournement simple qui
          fournit un palliatif satisfaisant. Si le syst&egrave;me FreeBSD est le
	  <emphasis>serveur</emphasis>, utilisez l'option 
          <option>-w=1024</option> avec <command>mount</command> sur le client.
          Si le syst&egrave;me FreeBSD est le <emphasis>client</emphasis>, alors montez
          le syst&egrave;me de fichiers NFS avec l'option <option>-r=1024</option>. 
          Vous pouvez mettre ces options dans le quatri&egrave;me champ de l'entr&eacute;e
	  <filename>fstab</filename> sur le client, pour les montages 
          automatiques, ou avec le param&egrave;tre <option>-o</option> de la commande
          <command>mount</command> pour les montages manuels.</para>
	
	<para>Il faut noter qu'il existe un probl&egrave;me diff&eacute;rent, que l'on 
          confond parfois avec le pr&eacute;c&eacute;dent, qui peut se produire lorsque les
          serveurs et les clients NFS sont sur des r&eacute;seaux diff&eacute;rents. Si c'est 
          le cas, <emphasis>assurez-vous</emphasis> que vos routeurs 
          transmettent bien les informations UDP n&eacute;cessaires, ou vous n'irez
          nulle part, quoi que vous fassiez par ailleurs.</para>
	
	<para>Dans les exemples qui suivent, <hostid>fastws</hostid> est le nom           de la station de travail (interface) de haute performance et
	  <hostid>freebox</hostid> celui de la machine (interface) FreeBSD 
          avec une carte Ethernet moins performante. 
          <filename>/sharedfs</filename> est le syst&egrave;me de fichiers NFS qui
          sera export&eacute; (voyez <command>man exports</command>), et
          <filename>/project</filename> le point de montage pour ce syst&egrave;me
          de fichiers export&eacute;, sur le client. Dans tous les cas,
	  des options suppl&eacute;mentaires, comme <option>hard</option> ou 
          <option>soft</option> et <option>bg</option> seront peut-&ecirc;tre
          n&eacute;cessaires pour vos applications.</para>
	
	<para>Exemple lorsque le syst&egrave;me FreeBSD (<hostid>freebox</hostid>) est
          le client: dans <filename>/etc/fstab</filename> de 
          <hostid>freebox</hostid>:

	  <programlisting>
fastws:/sharedfs /project nfs rw,-r=1024 0 0
	  </programlisting>

          commande de montage manuel sur <hostid>freebox</hostid>:

	  <informalexample>
	    <screen>&prompt.root; <userinput>mount -t nfs -o -r=1024 fastws:/sharedfs /project</userinput></screen>
	  </informalexample></para>
	
	<para>Exemple lorsque le syst&egrave;me FreeBSD (<hostid>freebox</hostid>) est
          le serveur: dans <filename>/etc/fstab</filename> de 
          <hostid>fastws</hostid>:

	  <programlisting>
freebox:/sharedfs /project nfs rw,-w=1024 0 0
	    </programlisting>

          commande de montage manuel sur <hostid>fastws</hostid>:

	  <informalexample>
	    <screen>&prompt.root; <userinput>mount -t nfs -o -w=1024 freebox:/sharedfs /project</userinput></screen>
	  </informalexample></para>
	
	<para>Presque toutes les cartes Ethernet 16-bit permettront d'utiliser
          les restrictions ci-dessus &agrave; la taille du tampon de 
          lecture/&eacute;criture.</para>
	
	<para>Pour ceux que cela int&eacute;resse, voici ce qui provoque le probl&egrave;me,
          ce qui explique aussi qu'il ne soit pas r&eacute;cup&eacute;rable. NFS utilise
          habituellement une taille de &ldquo;bloc&rdquo; de 8k (bien qu'il
          arrive qu'il les fragmente en plus petits morceaux). Comme la taille
          maximum d'un paquet Ethernet est de 1500 bits, le block NFS
          est r&eacute;parti sur plusieurs paquets Ethernet, bien qu'il soit toujours
          vu comme un ensemble par les couches sup&eacute;rieures du code, et doit &ecirc;tre
          re&ccedil;u, assembl&eacute; et &ldquo;acquitt&eacute;&rdquo; comme tel. Les stations de
          travail performantes peuvent traiter les paquets qui composent le
          &ldquo;bloc&rdquo; NFS, les uns apr&egrave;s les autres, pratiquement
          aussi rapidement que le standard le permet. Sur les cartes plus
          petites et de moindre capacit&eacute;, les derniers paquets d'un m&ecirc;me groupe
          &eacute;crasent les pr&eacute;c&eacute;dents, avant qu'ils aient &eacute;t&eacute; transmis,
          et l'ensemble ne peut &ecirc;tre reconstruit et acquitt&eacute;. En cons&eacute;quence, 
          le d&eacute;lai est d&eacute;pass&eacute;
          sur la station de travail, et elle recommence l'op&eacute;ration, mais elle
          renvoie tous les 8k, et le ph&eacute;nom&egrave;ne se reproduit &agrave; l'infini.</para>
	
	<para>En d&eacute;finissant la taille de &ldquo;bloc&rdquo; en de&ccedil;&agrave; de la 
          taille d'un paquet Ethernet, nous sommes s&ucirc;rs que chaque paquet 
          Ethernet entier sera acquitt&eacute; individuellement, ce qui &eacute;vite la
          situation d'inter-bloquage.</para>
	
	<para>Il peut toujours y avoir &eacute;crasement lorsque des stations de 
          travail performantes surchargent un syst&egrave;me PC de donn&eacute;es, mais avec
          les meilleures cartes, de tels &eacute;crasements ne sont pas syst&eacute;matiques
          pour les &ldquo;unit&eacute;s&rdquo; NFS. En cas d'&eacute;crasement, les blocs
          affect&eacute;s sont retransmis, et il y a de fortes chances qu'ils soient
          re&ccedil;us, assembl&eacute;s et acquitt&eacute;s.</para>
	
      </sect1>
      
      <sect1 id="diskless">
	<title>Station sans disque dur</title>
	
	<para><emphasis>Contribution de &a.martin;.</emphasis></para>
	
	<para><filename>netboot.com</filename>/<filename>netboot.rom</filename> 
          vous permettent de d&eacute;marrer votre machine FreeBSD via le r&eacute;seau et
          d'ex&eacute;cuter FreeBSD sans disque dur sur le client. Avec la version 2.0,
          il est maintenant possible d'avoir de l'espace de pagination local. Il          est toujours possible de paginer via NFS.</para>
	
	<para>Les cartes Ethernet support&eacute;es sont: Western Digital/SMC 8003,
	  8013, 8216 et compatibles; NE1000/NE2000 et compatibles (il faut
	  recompiler).</para>
	
	<sect2>
	  <title>Configuration</title>
	  
	    <procedure>
	      
	      <step>
		<para>Choisissez la machine qui sera votre serveur. Cette 
                  machine doit disposer de suffisamment d'espace disque pour y
                  mettre les ex&eacute;cutables de FreeBSD 2.0 et les services bootp,
                  tftp, et NFS. Machines test&eacute;es:</para>
	      
		  <itemizedlist>
		    
		    <listitem>
		      <para>HP9000/8xx sous HP-UX 9.04 ou ult&eacute;rieurs (cela ne
                        marche pas avec les versions ant&eacute;rieures &agrave; la 
                        9.04).</para>
		    </listitem>
		    
		    <listitem>
		      <para>Sun/Solaris 2.3. (vous devrez peut-&ecirc;tre vous 
                        procurer bootp).</para>
		    </listitem>
		    
		  </itemizedlist>
		  
	      </step>
	      
	      <step>
		<para>Installez un serveur bootp pour fournir au client son
                  adresse IP, son masque de r&eacute;seau et une passerelle:</para>

		  <programlisting>
sans-disque:\
        :ht=ether:\
        :ha=0000c01f848a:\
        :sm=255.255.255.0:\
        :hn:\
        :ds=192.1.2.3:\
        :ip=192.1.2.4:\
        :gw=192.1.2.5:\
        :vm=rfc1048:
		  </programlisting>
	      </step>
	      
	      <step>
		<para>Installez un serveur TFTP (sur la m&ecirc;me machine que le 
                  serveur bootp) pour fournir au client les informations de
                  d&eacute;marrage. Le nom du fichier de configuration est
		  <filename>cfg.<replaceable>X.X.X.X</replaceable></filename> 
                  (ou
		  <filename>/tftpboot/cfg.<replaceable>X.X.X.X</replaceable></filename>, 
                  il cherchera les deux), o&ugrave; <replaceable>X.X.X.X</replaceable>
                  est l'adresse IP du client. Ce fichier peut contenir n'importe
                  quelles commandes netboot valides. Dans la version 2.0, les
                  commandes de netboot sont les suivantes:</para>

	      <informaltable frame="none">
		<tgroup cols="2">
		  <tbody>
		    <row>
		      <entry>help</entry>
		      <entry>affiche une liste d'aide</entry>
		    </row>

		    <row>
		      <entry>ip <option><replaceable>X.X.X.X</replaceable></option></entry>
		      <entry>affiche/d&eacute;finit l'adresse IP du client</entry>
		    </row>

		    <row>
		      <entry>server <option><replaceable>X.X.X.X</replaceable></option></entry>
		      <entry>affiche/d&eacute;finit l'adresse IP du serveur 
                        bootp/tftp</entry>
		    </row>

		    <row>
		      <entry>netmask <option><replaceable>X.X.X.X</replaceable></option></entry>
		      <entry>affiche/d&eacute;finit le masque de r&eacute;seau</entry>
		    </row>

		    <row>
		      <entry>hostname <replaceable>nom</replaceable></entry>
		      <entry>affiche/d&eacute;finit le nom de machine</entry>
		    </row>

		    <row>
		      <entry>kernel <option><replaceable>nom</replaceable></option></entry>
		      <entry>affiche/d&eacute;finit le nom du noyau</entry>
		    </row>

		    <row>
		      <entry>rootfs <option><replaceable>ip:/fs</replaceable></option></entry>
		      <entry>affiche/d&eacute;finit le nom du syst&egrave;me de fichiers 
                        racine</entry>
		    </row>

		    <row>
		      <entry>swapfs <option><replaceable>ip:/fs</replaceable></option></entry>
		      <entry>affiche/d&eacute;finit le nom du syst&egrave;me de fichiers 
                        de pagination</entry>
		    </row>

		    <row>
		      <entry>swapsize <option><replaceable>taille</replaceable></option></entry>
		      <entry>d&eacute;finit la taille de l'espace de pagination de la 
                        station sans disque dur en Koctets</entry>

		    </row>

		    <row>
		      <entry>diskboot</entry>
		      <entry>d&eacute;marrer depuis le disque</entry>
		    </row>

		    <row>
		      <entry>autoboot</entry>
		      <entry>continuer le processus de d&eacute;marrage</entry>
		    </row>

		    <row>
		      <entry>trans
			<option>on</option>|<option>off</option></entry>
		      <entry>active/d&eacute;sactive 
                        l'&eacute;metteur-r&eacute;cepteur&nbsp;-&nbsp;<foreignphrase>transceiver</foreignphrase></entry>
		    </row>

		    <row>
		      <entry>flags
			<option>b</option><option>c</option><option>d</option><option>h</option><option>s</option><option>v</option></entry>
		      <entry>d&eacute;finit les indicateurs de d&eacute;marrage</entry>
		    </row>
		  </tbody>
		</tgroup>
	      </informaltable>
	      
		  <para>Un fichier <filename>cfg</filename> pour une machine
                    sans disque peut typiquement contenir:</para>

		  <programlisting>
rootfs 192.1.2.3:/rootfs/monclient
swapfs 192.1.2.3:/swapfs
swapsize 20000
hostname monclient.mondomain
		  </programlisting>

		  <para>Un fichier <filename>cfg</filename> pour une machine
                    avec espace de pagination local peut par exemple
                    contenir:</para>

		  <programlisting>
rootfs 192.1.2.3:/rootfs/monclient
hostname monclient.mondomain
		  </programlisting>
	      </step>
	      
	      <step>
		<para>V&eacute;rifiez que votre serveur NFS exporte bien le syst&egrave;me de
                  fichiers racine (et le syst&egrave;me de fichiers de pagination, le
                  cas &eacute;ch&eacute;ant) vers le client, et que ces syst&egrave;mes de fichiers 
                  sont accessibles avec les droits super-utilisateur sur le
                  client. Le fichier <filename>/etc/exports</filename> sur un 
                  syst&egrave;me FreeBSD ressemblera typiquement &agrave;:</para>

		  <programlisting>
/rootfs/monclient -maproot=0:0 monclient.mondomain
/swapfs -maproot=0:0 monclient.mondomain
		  </programlisting>

	      <para>Et sur HP-UX:</para>

		  <programlisting>
/rootfs/myclient -root=monclient.mondomain
/swapfs -root=monclient.mondomain
		  </programlisting>
	      </step>
	      
	      <step>
		<para>Si vous paginez via NFS (configuration sans aucun disque 
                  dur), cr&eacute;ez un fichier de pagination pour votre client avec
		  <command>dd</command>. Si votre commande
                  <command>swapfs</command> a pour argument le syst&egrave;me de 
                  fichiers <filename>/swapfs</filename> et 20000 comme taille, 
                  comme dans l'exemple ci-dessus, le fichier de pagination du
                  client s'appelera
		  <filename>/swapfs/swap.<replaceable>X.X.X.X</replaceable></filename>
                  o&ugrave; <replaceable>X.X.X.X</replaceable> est l'adresse IP du
                  client, e.g.:</para>

		  <informalexample>
		    <screen>&prompt.root; <userinput>dd if=/dev/zero of=/swapfs/swap.192.1.2.4 bs=1k count=20000</userinput></screen>
		  </informalexample>

	      <para>Comme l'espace de pagination du client peut contenir des
                  informations sensibles, d&egrave;s lors qu'il y a pagination, veillez
                  &agrave; restreindre les droits en lecture et en &eacute;criture sur ce 
                  fichier pour &eacute;viter les acc&egrave;s non autoris&eacute;s:</para>
	      
		  <informalexample>
		    <screen>&prompt.root; <userinput>chmod 0600 /swapfs/swap.192.1.2.4</userinput></screen>
		  </informalexample>
	      </step>
	      
	      <step>
		<para>Recopiez le syst&egrave;me de fichiers racine sur le r&eacute;pertoire 
                  qui servira de syst&egrave;me de fichiers racine pour le client 
		  (<filename>/rootfs/monclient</filename> dans l'exemple
		  ci-dessus).
		  
		  <itemizedlist>
		    
		    <listitem>
		      <para>Sur les syst&egrave;mes HP-UX: Le serveur doit &ecirc;tre soit
			HP-UX 9.04 ou ult&eacute;rieur pour les machines de la gamme
                        HP9000/800. Les versions ant&eacute;rieures ne permettent pas
                        de cr&eacute;er de fichiers sp&eacute;ciaux de p&eacute;riph&eacute;rique via
			NFS.</para>
		    </listitem>
		    
		    <listitem>
		      <para>Lorsque vous recopiez <filename>/dev</filename> dans
			<filename>/rootfs/monclient</filename>, faites attention
                        au fait que certains syst&egrave;mes (HP-UX) ne cr&eacute;eront pas 
                        les fichiers sp&eacute;ciaux de p&eacute;riph&eacute;rique dont FreeBSD a 
                        besoin. Vous devrez peut-&ecirc;tre passer en mode 
                        mono-utilisateur au premier d&eacute;marrage (appuyez sur 
                        Ctrl-c pendant la phase de d&eacute;marrage),
			<command>cd /dev</command> puis
			<command>sh ./MAKEDEV all</command>
			sur le client, pour r&eacute;gler ce probl&egrave;me.</para>
		    </listitem>
		    
		  </itemizedlist>
		  
		</para>
	      </step>
	      
	      <step>
		<para>Lancez <command>netboot.com</command> sur le client
		  ou copiez le fichier <filename>netboot.rom</filename>
		  dans une EPROM.</para>
	      </step>
	      
	    </procedure>
	  
	</sect2>
	
	<sect2>
	  <title>Utiliser des syst&egrave;mes de fichiers <filename>/</filename> and
	    <filename>/usr</filename> partag&eacute;s</title>
	  
	  <para>Cette fa&ccedil;on de faire n'est pas actuellement officiellement
            sanctionn&eacute;e, mais j'ai utilis&eacute; un syst&egrave;me de fichiers
	    <filename>/usr</filename> partag&eacute; et un syst&egrave;me de fichiers
	    <filename>/</filename> individuel sur chaque client. Si quelqu'un
            a des suggestions sur la fa&ccedil;on propre de le faire, qu'il me la
            communique, ou &agrave; l'&a.core;.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Compiler netboot pour des configurations particuli&egrave;res</title>
	  
	  <para>Netboot peut &ecirc;tre compil&eacute; pour supporter les cartes NE1000/2000 
            en modifiant sa configuration dans le fichier
	    <filename>/sys/i386/boot/netboot/Makefile</filename>. Voyez les
            commentaires au d&eacute;but de ce fichier.</para>
	  
	</sect2>
      </sect1>
      
      <sect1 id="isdn">
	<title>ISDN</title>
	
	<para><emphasis>Derni&egrave;res modifications de &a.wlloyd;</emphasis>.</para>
	
	<para>Il y a de bonnes informations sur la technologie et le mat&eacute;rial
          ISDN sur
	  <ulink url="http://alumni.caltech.edu/~dank/isdn/">la page ISDN de
          Dan Kegel</ulink>.</para>
	
	<para>Voici un aper&ccedil;u simple et rapide &agrave; propos de l'ISDN:</para>
	
	  <itemizedlist>
	    
	    <listitem>
	      <para>Si vous habitez en Europe, je vous sugg&egrave;re d'&eacute;tudier la
                section sur les cartes ISDN.</para> 
	    </listitem>
	    
	    <listitem>
	      <para>Si vous envisagez d'utiliser l'ISDN avant tout pour vous
                connecter &agrave; l'Internet par l'interm&eacute;diaire d'un Fournisseur
                d'Acc&egrave;s Internet et d'une ligne t&eacute;l&eacute;phonique non d&eacute;di&eacute;e, je vous
                conseille de lire la section sur les Adaptateurs Terminaux. 
                C'est la solution la plus souple, et qui vous posera le moins de
                probl&egrave;mes, si vous changer de fournisseur.</para> 
	    </listitem>
	    
	    <listitem>
	      <para>Si vous interconnectez deux r&eacute;seaux locaux ou si vous vous 
                connectez &agrave; l'Internet avec une liaison ISDN d&eacute;di&eacute;e, je vous 
                sugg&egrave;re d'envisager un pont/routeur autonome.</para>
	    </listitem>
	    
	  </itemizedlist>
	
	<para>Le co&ucirc;t est un facteur d&eacute;terminant de la solution que vous 
          choisirez. Les options ci-dessous sont envisag&eacute;es de la plus ch&egrave;re &agrave;
          la moins ch&egrave;re.</para>
	
	
	<sect2>
	  <title>Cartes ISDN</title>
	  
	  <para><emphasis>Contribution originale de &a.hm;.</emphasis></para>
	  
	  <para>Cette section ne s'applique qu'aux utilisateurs Europ&eacute;ens de
            l'ISDN. Les cartes support&eacute;es ne sont pas encore(?) disponibles pour
            les normes Nord-Am&eacute;ricaines.</para>
	  
	  <para>Vous devez savoir que le code est largement en cours de
            d&eacute;veloppement. En particulier, il n'y a de pilotes sp&eacute;cifiques que
            pour les cartes de deux constructeurs.</para>
	  
	  <para>Les cartes ISDN pour PC supportent toute la bande passante de 
            l'ISDN, 128Kbs. Ces cartes sont souvent les &eacute;quipements ISDN les
            moins chers.</para>
	  
	  <para>Sous FreeBSD 2.1.0 et 2.1.5, il y a un premier code ISDN 
            inachev&eacute; dans le r&eacute;pertoire <filename>/usr/src/gnu/isdn</filename>.
            Ce code est obsol&egrave;te et ne doit pas &ecirc;tre utilis&eacute;. Si vous voulez
            emprunter cette voie, procurez-vous le code 
            <filename>bisdn</filename>. Ce code a &eacute;t&eacute; retir&eacute; de l'arborescence 
            des sources depuis FreeBSD 2.2.</para>
	  
	  <para>Le logiciel ISDN <filename>bisdn</filename> pour 
              FreeBSD 2.1-release, FreeBSD-current et NetBSD se trouve sur
	      <ulink 
              url="ftp://hub.freebsd.org/pub/bisdn">hub.freebsd.org</ulink>.
              la version la plus r&eacute;cente se trouve sur ce serveur ftp dans le
              r&eacute;pertoire <filename>isdn</filename>, dans le fichier
	      <filename>bisdn-097.tar.gz</filename>.</para>
	  
	  <para>Il y a des pilotes pour les cartes suivantes:</para>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>Toutes les cartes Teles (passives) et compatibles sont
                  actuellement support&eacute;es avec les protocoles EuroISDN (DSS1) et
                  1TR6.</para>
	      </listitem>
	      
	      <listitem>
		<para>Dr. Neuhaus - Niccy 1016</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  <para>Le logiciel <filename>bisdn</filename> pr&eacute;sentent quelques
            limitations. Les fonctionnalit&eacute;s suivantes, habituellement associ&eacute;es
            &agrave; l'ISDN, ne sont pas support&eacute;es:</para>
	  
	    <itemizedlist>
	      
	      <listitem>
		<para>Pas de support PPP, HDLC de base uniquement. Cela signifie
                  qu'il n'est pas possible de se connecter &agrave; la plupart des
                  routeurs autonomes.</para>
	      </listitem>
	      
	      <listitem>
		<para>Le protocole de contr&ocirc;le des 
                  ponts&nbsp;-&nbsp;<foreignphrase>Bridging Control 
                  Protocol</foreignphrase>&nbsp;-&nbsp;n'est pas 
                  support&eacute;.</para>
	      </listitem>
	      
	      <listitem>
		<para>Support pour une seule carte, uniquement.</para>
	      </listitem>
	      
	      <listitem>
		<para>Pas de bande passante &agrave; la demande.</para>
	      </listitem>
	      
	      <listitem>
		<para>Pas de liaison des canaux.</para>
	      </listitem>
	      
	    </itemizedlist>
	  
	  
	  <para>Il existe une liste de diffusion. Pour vous y inscrire, envoyez
	    un courrier &eacute;lectronique &agrave; &a.majordomo; et avec:

	    <programlisting>
subscribe freebsd-isdn
	    </programlisting>

	    comme texte de votre message.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Adaptateurs terminaux ISDN</title>
	  
	  <para>Les adapteurs terminaux&nbsp;-&nbsp;Terminal adapters(TA), sont
            l'&eacute;quivalent ISDN des modems pour les lignes t&eacute;l&eacute;phoniques
            ordinaires.</para>
	  
	  <para>La plupart des adaptateurs utilisent le jeu de commandes
            standard des modems Hayes et peuvent &ecirc;tre utilis&eacute;s &agrave; la vol&eacute;e 
            en remplacement d'un modem.</para>
	  
	  <para>Un adaptateur fonctionne essentiellement comme un modem sinon 
            que la vitesse de la connexion est bien plus rapide qu'avec votre
            vieux modem. Vous devrez configurer <link linkend="ppp">PPP</link>
            exactement comme pour un modem. Assurez-vous d'utiliser la vitesse
            la plus &eacute;lev&eacute;e possible sur le port s&eacute;rie.</para>
	  
	  <para>Le principal avantage des adaptateurs terminaux pour vous
            connecter &agrave; votre Fournisseur d'Acc&egrave;s Internet est de pouvoir
            utiliser PPP en mode dynamique. Comme l'espace d'adressage IP
            disponible devient de plus en plus restreint, la plupart des
            fournisseurs ne proposent plus d&eacute;sormais d'adresse IP statique.
            La plupart des routeurs autonomes ne peuvent pas fonctionner avec
            l'allocation dynamique d'adresse IP.</para> 
	  
	  <para>Les fonctionnalit&eacute;s et la stabilit&eacute; de la connexion des
            adaptateurs reposent compl&egrave;tement sur le &ldquo;d&eacute;mon&rdquo; PPP 
            que vous ex&eacute;cuter. Cela vous permet de passer simplement d'un modem
            &agrave; l'ISDN sur une machine FreeBSD, si vous avez d&eacute;j&agrave; configur&eacute; PPP.
            De ce fait, cependant, les probl&egrave;mes que vous rencontrez avec PPP
            persisteront aussi.</para>
	  
	  <para>Si vous voulez le maximum de stabilit&eacute;, utilisez <link
	    linkend="ppp">PPP int&eacute;gr&eacute; au noyau</link> au lieu de <link
	    linkend="userppp">PPP en mode utilisateur</link>.</para>
	  
	  <para>On sait que les adapteurs suivants fonctionnent avec
            FreeBSD:</para>
	  
	  <para>
	    <itemizedlist>
	      
	      <listitem>
		<para>Motorola BitSurfer et Bitsurfer Pro</para>
	      </listitem>
	      
	      <listitem>
		<para>Adtran</para>
	      </listitem>
	      
	    </itemizedlist>
	  </para>
	  
	  <para>La plupart des adaptateurs terminaux fonctionneront probablement
            aussi, les fabricants d'adaptateurs font en sorte que leurs produits
            acceptent la plupart des commandes AT des modems.</para>
	  
	  <para>Le vrai probl&egrave;me avec les adaptateurs externes est que, comme 
            pour les modems, il vous faut une bonne carte s&eacute;rie.</para>
	  
	  <para>Vous devriez lire la section <link linkend="uart">Ports 
            s&eacute;rie</link> de ce manuel pour comprendre en d&eacute;tail le 
            fonctionnement des p&eacute;riph&eacute;riques s&eacute;rie et les diff&eacute;rences entre
            les ports s&eacute;rie synchrones et asynchrones.</para>
	  
	  <para>Un adaptateur sur un port s&eacute;rie PC standard (asynchrone)
            vous limite &agrave; 115.2Kbs, bien que vous ayez une liaison &agrave; 128Kbs.
            Pour utiliser les 128Kbs que peut atteindre l'ISDN, il vous faut
            relier l'adaptateur &agrave; une carte s&eacute;rie synchrone.</para>
	  
	  <para>N'imaginez pas qu'il vous suffise d'acheter un adaptateur 
            interne pour &eacute;viter l'alternative synchrone/asynchrone. Les 
            adaptateurs internes incluent simplement une puce port s&eacute;rie 
            standard. Tout ce que vous y gagnerez sera d'&eacute;conomiser un
            c&acirc;ble s&eacute;rie et de r&eacute;cup&eacute;rer une prise &eacute;lectrique.</para>
	  
	  <para>Une carte synchrone avec un adaptateur est au moins aussi rapide
            qu'un routeur autonome, et pilot&eacute;e par une simple machine FreeBSD,
            probablement plus souple.</para>
	  
	  <para>Le choix entre carte synchrone/adaptateur ou routeur autonome
            est largement question de dogme. Cela a &eacute;t&eacute; quelque peu discut&eacute;
            dans les listes de diffusion. Je vous sugg&egrave;re de regarder dans les
	    <ulink
	      url="http://www.freebsd.org/search.html">archives</ulink> pour
	    suivre l'int&eacute;gralit&eacute; du d&eacute;bat.</para>
	  
	</sect2>
	
	<sect2>
	  <title>Ponts/Routeurs ISDN autonomes</title>
	  
	  <para>Les ponts ou les routeurs ISDN  ne sont en rien propres &agrave; 
            FreeBSD ou &agrave; tout autre syst&egrave;me d'exploitation. Pour une description
            compl&egrave;te de la technologie des ponts et des routeurs, reportez-vous
            s'il vous pla&icirc;t &agrave; un ouvrage de r&eacute;f&eacute;rence sur les r&eacute;seaux.</para>
	  
	  <para>Dans le contexte de ce manuel, j'utiliserai indiff&eacute;remment les
            termes routeur et pont.</para>
	  
	  <para>Comme le prix des ponts/routeurs ISDN d'entr&eacute;e de gamme baisse
            continuellement, il est probable qu'ils deviennent un choix plus
            courant. Un routeur ISDN est une petite bo&icirc;te que se branche
            directement sur votre r&eacute;seau (ou votre carte) Ethernet, et g&egrave;re sa
            propre connexion aux autres ponts/routeurs. Il int&egrave;gre le logiciel
            n&eacute;cessaire au support du protocole PPP et d'autres 
            protocoles.</para>
	  
	  <para>Un routeur vous procurera une liaison plus rapide qu'un 
            adaptateur standard, puisqu'il utilisera toute la connexion
            ISDN synchrone.</para>
	  
	  <para>Le principale probl&egrave;me avec les ponts et les routeurs ISDN est
            encore l'interop&eacute;rabilit&eacute; entre les mat&eacute;riels des diff&eacute;rents 
            constructeurs. Si vous envisagez de vous connecter &agrave; un fournisseur
            d'acc&egrave;s Internet, je vous recommande d'en discuter avec lui.</para>
	  
	  <para>Si vous envisagez de relier entre eux deux r&eacute;seaux locaux, i.e.:
            le r&eacute;seau de votre domicile et le r&eacute;seau de votre bureau, c'est la 
            solution la plus simple et qui demande le moins de maintenance. 
            Etant donn&eacute; que vous achetez les &eacute;quipements pour les deux
            extr&eacute;mit&eacute;s de la liaison, vous &ecirc;tes s&ucirc;r que cela 
            fonctionnera.</para>
	  
	  <para>Pour connecter par exemple votre ordinateur &agrave; domicile ou
            le r&eacute;seau d'une agence &agrave; celui du si&egrave;ge, vous pourriez
            utiliser la configuration qui suit.</para>
	  
	  <example>
	    <title>R&eacute;seau d'agence ou &agrave; domicile</title>
	  
	  <para>R&eacute;seau Ethernet 10 Base T. Connecter le routeur au c&acirc;ble r&eacute;seau
            avec un 
            &eacute;metteur-r&eacute;cepteur&nbsp;-&nbsp;<foreignphrase>transceiver</foreignphrase>&nbsp;-&nbsp;AUI/10BT, 
           si n&eacute;cessaire.</para>

	  <!-- This should be a graphic -->
	  <programlisting>
---Station de travail Sun
|
---Machine FreeBSD
|
---Windows 95 (N'avouez pas qu'elle est &agrave; vous)
|
Routeur autonome
   |
Liaison ISDN BRI 
	  </programlisting>

	  <para>Si vous n'avez qu'un seul ordinateur &agrave; domicile ou dans 
            l'agence, vous pouvez utiliser une paire torsad&eacute;e crois&eacute;e pour 
            le connecter directement au routeur.</para>
	  </example>
	  
	  <example>
	    <title>Si&egrave;ge ou autre r&eacute;seau</title>
	  
	  <para>R&eacute;seau Ethernet paire torsad&eacute;e.</para>

	    <!-- This should be a graphic -->
	    <programlisting>
    -------Serveur Novell 
    | H |
    |   ---Sun      
    |   |
    | U ---FreeBSD
    |   |
    |   ---Windows 95
    | B |
    |___---Routeur autonome
                |
        Liaison ISDN BRI 
	    </programlisting>
	  </example>
	  
	  <para>Un s&eacute;rieux avantage de la plupart des ponts/routeurs est qu'ils
            vous permettent d'avoir deux connexions PPP <emphasis>s&eacute;par&eacute;es et 
            ind&eacute;pendantes</emphasis> en m&ecirc;me temps. Ce n'est pas possible avec
            la plupart des adaptateurs, sauf certains mod&egrave;les particuliers
            (co&ucirc;teux) qui ont deux ports s&eacute;rie. Ne confondez pas cela avec
            avec le couplage de canaux, MPP, etc.</para>
	  
	  <para>Ce peut &ecirc;tre une fonctionnalit&eacute; tr&egrave;s utile, par exemple si vous
            avez une connexion ISDN Internet d&eacute;di&eacute;e au bureau et voudriez en
            profiter mais ne voulez pas acqu&eacute;rir de nouvelle ligne ISDN.
            Un routeur au bureau peut g&eacute;rer un canal B d&eacute;di&eacute; 
            (64 Kbs) vers l'Internet et utiliser l'autre canal B pour une
            autre connexion. Le deuxi&egrave;me canal B peut &ecirc;tre utilis&eacute; pour
            des connexions entrantes, sortantes ou dynamiquement li&eacute;e
            au premier canal B pour augmenter la bande passante.</para>
	  
	  <para>Un pont Ethernet vous permettra aussi de transmettre autre 
            chose que du trafic IP, vous pourrez aussi faire passer de l'IPX/SPX
            ou tout autre protocole que vous utilisiez.</para>
	  
	</sect2>
      </sect1>
    </chapter>
<!--    
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-shorttag: nil
     sgml-always-quote-attributes: t 
     sgml-minimize-attributes: max
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End: 
-->       
