<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous
FreeBSD Entities//EN"> %freebsd;
<!ENTITY % newsgroups PUBLIC "-//FreeBSD//ENTITIES DocBook Newsgroup Entities//ES"> %newsgroups;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//ES"> %mailing-lists;
<!ENTITY % not.published "IGNORE">
]>

<article lang=es>
  <articleinfo>
    <title>Contribuir a FreeBSD</title>

    <pubdate>$FreeBSD$</pubdate>

    <abstract>
      <para>En &eacute;ste art&iacute;culo se describen las diferentes 
        maneras en las que una persona o entidad pueden ayudar al 
        Proyecto FreeBSD.</para>
    </abstract>

    <authorgroup>
      <author>
	<firstname>Jordan</firstname>
	<surname>Hubbard</surname>
	<contrib>Enviado por </contrib>
      </author>
    </authorgroup>
  </articleinfo>

  <indexterm><primary>contributing</primary></indexterm>

  <para>&iquest;Quiere ayudar a mejorar FreeBSD?   &iexcl;Eso es 
    genial!   FreeBSD <emphasis>depende</emphasis> del esfuerzo de 
    base de usuarios y usuarias para sobrevivir.  Su ayuda no 
    s&oacute;lamente muy apreciada sino que es <emphasis>vital 
     </emphasis> para el cont&iacute;nuo crecimiento de FreeBSD.</para>

  <para>Contrariamente a lo que pudiera usted creer, no hace falta ser 
    un brujo de la programaci&oacute;n o un amigo &iacute;ntimo del 
    core team de FreeBSD para su trabajo sea aceptado.  El desarrollo 
    de FreeBSD est&aacute; al cargo de un gran grupo internacional de 
    voluntarios y voluntarias en cont&iacute;nuo crecimiento, de muy 
    diversas edades y expertos en distintos campos del 
    conocimiento.  Siempre hay m&aacute;s trabajo por hacer que gente 
    disponible para hacerlo y una mano m&aacute;s siempre es 
    bienvenida.</para> 

  <para>El proyecto FreeBSD tiene el compromiso de mantener un 
    sistema operativo completo, no simplemente un kernel o unas 
    cuantas aplicaciones sueltas.  Por lo tanto nuestra lista de 
    <filename>TAREAS PENDIENTES</filename> (<quote>TODO</quote>)  
    incluye una vasta lista de tareas: desde documentaci&oacute;n, 
    prueba de versiones preliminares hasta el desarrollo del sistema 
    de instalaci&oacute;n y el desarrollo del kernel en aspectos 
    altamente especializados.  Casi con total seguridad puede usted 
    ayudar al proyecto sea cual sea su preparaci&oacute;n y el 
    &aacute;rea en la que disponga de experiencia o 
    inter&eacute;s.</para>

  <para>Invitamos a las empresas que tienen proyectos relacionados 
    con FreeBSD a que se pongan en contacto con nosotros.  &iquest;Necesitan 
    una extensi&oacute;n concreta para hacer que su producto funcione?   
    Estaremos encantados de escuchar sus peticiones (suponiendo que no sean 
    demasiado esot&eacute;ricas).  &iquest;Su proyecto es interesante y/o  
    beneficioso para su empresa y para FreeBSD?  
    &iexcl;H&aacute;ganoslo saber!   Podemos trabajar conjuntamente en 
    algunos aspectos del mismo.  El mundo del software libre est&aacute;
    cambiando muchas de las normas establecidas sobre c&oacute;mo el software 
    deber&iacute;a ser desarrollado, vendido y mantenido as&iacute; que 
    le rogamos encarecidamente que al menos le d&eacute; un segundo 
    vistazo.</para> 

  <sect1 id="contrib-what">
    <title>Qu&eacute; es lo que hace falta</title>
    
    <para>La siguiente lista de tareas y subproyectos representa 
      de alg&uacute;n modo la amalgama de listas de <filename>TAREAS 
       PENDIENTES</filename> y peticiones de usuarios.</para>

    <sect2 id="non-programmer-tasks">
      <title>Tareas en Curso para No Programadores</title>

      <para>Una gran parte de quienes trabajan en FreeBSD no 
        son programadores.  El Proyecto incluye escritores de 
        documentaci&oacute;n, dise&ntilde;adores y t&eacute;cnicos de 
        soporte.  Los &uacute;nicos requisitos necesarios son poner 
        algo de su tiempo y ganas de aprender.</para> 

      <orderedlist>
	<listitem>
          <para>Lea cuidadosamente las FAQ y el Handbook cada cierto 
            tiempo.  Si algo est&aacute; mal explicado, desfasado o 
            sencillamente completamente equivocado h&aacute;ganoslo 
            saber.  A&uacute;n mejor, env&iacute;enos la 
            correcci&oacute;n (no es dif&iacute;cil aprender SGML pero 
            no hay problema si lo env&iacute;a en ASCII).</para>
	</listitem>

	<listitem>
          <para>Ayude a traducir la documentaci&oacute;n de FreeBSD a 
            su lengua materna.  Si ya existe documentaci&oacute;n en su 
            idioma puede ayudar a traducir otros documentos o a mantener 
            al d&iacute;a los que ya existan.  Antes de nada consulte <ulink
	    url="../../books/fdp-primer/translations.html">Translations
	    FAQ</ulink> en el <quote>FreeBSD Documentation Project 
             Primer</quote>.  El hecho de traducir 
            <emphasis>algo</emphasis> no implica la obligaci&oacute;n 
            de traducir <emphasis>todo</emphasis>: al ser una tarea 
            voluntaria puede usted traducir tanto o tan poco como 
            prefiera.  Cuando alguien empieza a traducir casi siempre 
            hay alguien que se une.  Si s&oacute;lo tiene tiempo o 
            ganas para traducir una parte de la documentaci&oacute;n 
            por favor, traduzca las instrucciones de instalaci&oacute;n.</para> 
	</listitem>

	<listitem>
          <para>Lea la &a.questions; y el &ng.misc; 
            de vez en cuando (o incluso regularmente).  Compartir sus 
            conocimientos mientras ayuda a la gente a resolver sus 
            problemas puede ser muy gratificante. &iexcl;Puede ser que 
            incluso aprenda usted tambi&eacute;n algo nuevo!   Esos foros 
            pueden ser tambi&eacute;n un importante foco de ideas para 
            nuevas cosas en las que trabajar.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2 id="ongoing-programmer-tasks">
      <title>Tareas en Curso para Programadores</title>
       <para>La mayor&iacute;a de las tareas aqu&iacute; expuestas 
        requieren una considerable cantidad de tiempo o un conocimiento 
        profundo del kernel de FreeBSD o ambas cosas.  Existen, sin embargo, 
        multitud de tareas muy &uacute;tiles que son ideales para 
        <quote>hackers de fin de semana</quote>.</para>

      <orderedlist>
	<listitem>
          <para>Si utiliza FreeBSD-CURRENT y tiene una buena 
            conexi&oacute;n con Internet existe una m&aacute;quina 
            llamada <hostid 
	    role="fqdn">current.FreeBSD.org</hostid> que genera 
            diariamente (en teor&iacute;a, la frecuencia puede variar) 
            una distribuci&oacute;n completa.   
            Intente instalar la &uacute;ltima versi&oacute;n 
            desde ella e informe de cualquier anomal&iacute;a en el 
            proceso.</para>  
	</listitem>

	<listitem>
	  <para>Lea la &a.bugs;.  Puede encontrar alg&uacute;n 
            problema sobre el que hacer un comentario constructivo o 
            sobre el que probar parches.  Puede incluso intentar 
            arreglarlo usted.</para> 
	</listitem>

	<listitem>
          <para>Si sabe de alguna correcci&oacute;n que ha sido 
            aplicada con &eacute;xito a -CURRENT pero que a&uacute;n 
            no haya sido inclu&iacute;da en -STABLE tras un 
            per&iacute;odo de tiempo razonable (por lo general un par 
            de semanas) env&iacute;e al committer responsable un 
            (educado) mensaje record&aacute;ndoselo.</para>
	</listitem>

	<listitem>
          <para>Mueva software de terceras partes a 
	    <filename>src/contrib</filename> en el &aacute;rbol de 
	    fuentes.</para>
	</listitem>

	<listitem>
          <para>Aseg&uacute;rese de que el c&oacute;digo de 
	  <filename>src/contrib</filename> est&aacute; 
	    actualizado.</para>
	</listitem>

	<listitem>
          <para>Compile el &aacute;rbol de fuentes (o s&oacute;lo una 
            parte del mismo) con una cantidad extra de <quote>warnings
            </quote> activadas y dep&uacute;relas.</para>
	</listitem>

	<listitem>
          <para>Corrija <quote>warnings</quote> en los ports 
            en los que aparecen cosas en desuso como  
	    <function>gets()</function> o que incluyen  
	    <filename>malloc.h</filename>.</para>
	</listitem>

	<listitem>
          <para>Si ha enviado alg&uacute;n port env&iacute;e sus 
            parches a los autores originales: le har&aacute; la 
            vida m&aacute;s f&aacute;cil cuando liberen la siguiente 
            versi&oacute;n.</para> 
	</listitem>

	<listitem>
          <para>Consiga copias de est&aacute;ndares formales como 
            POSIX.  Hay enlaces relacionados con esos est&aacute;ndares 
            en el sitio web del <ulink
	    url="http://www.FreeBSD.org/projects/c99/index.html">FreeBSD
	    C99 & Posix Standards Conformance Project</ulink>.  
            Compare el funcionamiento interno de FreeBSD con el que 
            exije el est&aacute;ndar.  Si hay diferencias, en especial 
            en alg&uacute;n rinc&oacute;n sutil y oscuro de la 
            especificaci&oacute;n, env&iacute;e un PR (<quote>Problem 
             Report</quote>).  Si es capaz de aventurar una soluci&oacute;n 
            incluya un parche en el PR.  Si cree que el est&aacute;ndar es 
            incorrecto p&oacute;ngase en contacto con los responsables del 
            mismo para que tengan en cuenta su propuesta.</para>  
	</listitem>

	<listitem>
          <para>&iexcl;Sugiera nuevas tareas para &eacute;sta 
            lista!</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>Trabajo en la <quote>PR Database</quote></title>

      <indexterm><primary>base de datos de informes de 
        problemas (PR)</primary></indexterm>

      <para>La <ulink
	url="http://www.FreeBSD.org/cgi/query-pr-summary.cgi">lista 
	de PR de FreBSD</ulink> muestra los informes de problemas 
        activos as&iacute; como las peticiones de mejoras 
        que han enviado los usuarios de FreeBSD.  La <quote>PR 
         database</quote> incluye tanto problemas que han de ser 
        corregidos por programadores como por no programadores.  
        Busque entre los PR que est&aacute;n abiertos, puede haber 
        alguno que le interese. Algunos pueden ser tareas muy 
        sencillas que s&oacute;lo necesiten una mirada adicional 
        para confirmar que la soluci&oacute;n adjunta es la 
        adecuada.  Otras, por el contrario, pueden llegar a ser 
        much&iacute;simo m&aacute;s complejas o incluso no 
        inclu&iacute;r una soluci&oacute;n.</para>    

      <para>Comience con un PR no haya sido a&uacute;n 
        asignado.  Si el PR ya ha sido asignado a alguien pero 
        cree que puede ayudar env&iacute;e un correo electr&oacute;nico 
        a la persona responsable del PR y preg&uacute;ntele si puede 
        colaborar (tal vez ya exista un parche listo para ser probado 
        o puedan contrastar ideas).</para>
    </sect2>
  </sect1>

  <sect1 id="contrib-how">
    <title>C&oacute;mo Colaborar</title>

    <para>Las colaboraciones al sistema generalmente pueden 
      catalogarse en las siguientes 5 categor&iacute;as:</para>

    <sect2 id="contrib-general">
      <title>Informes de Errores y Comentarios Generales</title>

      <para>Las ideas o sugerencias de inter&eacute;s 
        t&eacute;cnico <emphasis>general</emphasis> deben 
        enviarse a &a.hackers;. En consecuencia, si le interesan 
        ese tipo de cuestiones (&iexcl;y no le importa recibir un 
        <emphasis>gran</emphasis> volumen de correo!) deber&iacute;a 
        suscribirse a la &a.hackers; enviando un correo electr&oacute;nico 
        a &a.majordomo;.  Consulte el <ulink 
	url="../../books/handbook/eresources.html#ERESOURCES-MAIL">
	FreeBSD Handbook</ulink> para m&aacute;s informaci&oacute;n sobre 
        &eacute;sta y otras listas de correo.</para>

      <para>Si encuentra un error o quiere enviar un cambio concreto 
        por favor utilice el programa &man.send-pr.1; o su <ulink
	url="../../../../send-pr.html">equivalente en la 
         web</ulink> (N. del T.: El interfaz web de send-pr fu&eacute; 
        desactivado a causa del <quote>spam</quote>).  Trate de 
        rellenar todos los campos del informe de errores.  A menos que 
        exceda de 65KB puede inclu&iacute;r los parches directamente en 
        el informe. Si es posible aplicar el parche al &aacute;rbol de 
        fuentes no olvide inclu&iacute;r <literal>[PATCH]</literal> en 
        la sin&oacute;psis del informe.  Cuando incluya parches 
        <emphasis>no</emphasis> <quote>copie y pegue</quote> ya que 
        las tabulaciones son transformadas en espacios, haciendo el 
        parche in&uacute;til.  Considere la posibilidad de comprimir 
        los parches mediante &man.uuencode.1; si sobrepasan los 
        20KB.</para> 

      <para>Tras rellenar el informe deber&iacute;a recibir un mensaje 
        de confirmaci&oacute;n junto con un n&uacute;mero de 
        seguimiento.  Conserve ese n&uacute;mero por si en alg&uacute;n 
        momento pudiera a&ntilde;adir nueva informaci&oacute;n sobre el 
        problema enviando correo a 
	<email>bug-followup@FreeBSD.org</email>.  Utilice el n&uacute;mero 
        como asunto del mensaje (por ejemplo, <literal>"Re:
	kern/3377"</literal>.  As&iacute; deber&iacute;a enviarse la  
        informaci&oacute;n adicional sobre cualquier PR.</para> 

      <para>Si no recibe confirmaci&oacute;n en un per&iacute;odo de 
        tiempo razonable (entre 3 d&iacute;as y una semana, dependiendo 
        de su tipo de conexi&oacute;n) o si por alguna raz&oacute;n no 
        puede utilizar el comando &man.send-pr.1;, puede solicitar que 
        alguien lo haga por usted enviando un correo a &a.bugs;.</para> 

      <para>No olvide consultar <ulink
  	URL="../../articles/problem-reports/article.html">&eacute;ste 
  	<quote>article</quote></ulink> sobre c&oacute;mo escribir buenos 
        informes de problemas.</para>
    </sect2>

    <sect2>
      <title>Cambios en la Documentaci&oacute;n</title>

      <indexterm><primary>env&iacute;os de 
        documentaci&oacute;n</primary></indexterm>

      <para>Los cambios en la documentaci&oacute;n son revisados por 
        la &a.doc;.  Por favor, consulte <ulink
	url="../../books/fdp-primer/index.html">FreeBSD Documentation
	Project Primer</ulink> para recibir instrucciones 
        detalladas.  Env&iacute;e nuevos contenidos o cambios sobre 
        los ya existentes (&iexcl;incluso los peque&ntilde;os son 
        bienvenidos!) mediante &man.send-pr.1; tal y como se detalla 
        en <link
	linkend="contrib-general">Informes de Error y Comentarios 
	Generales</link>.</para>
    </sect2>

    <sect2>
      <title>Cambios al C&oacute;digo Fuente ya Existente</title>

      <indexterm><primary>FreeBSD-CURRENT</primary></indexterm>

      <para>A&ntilde;adir cambios o modificar el c&oacute;digo fuente 
        existente es un tema delicado y depende mucho de hasta 
        qu&eacute; punto est&eacute; usted al d&iacute;a sobre el 
        estado actual del desarrollo de FreeBSD.  Hay una versi&oacute;n 
        en desarrollo permanente de FreeBSD conocida como 
        <quote>FreeBSD-CURRENT</quote>, disponible de muy diversas 
        formas para mayor comodidad de los desarrolladores que 
        est&aacute;n trabajando activamente en el 
        sistema.  Consulte el <ulink 
	url="../../books/handbook/current-stable.html">FreeBSD
	Handbook</ulink>, donde se explica c&oacute;mo obtener y 
        utilizar FreeBSD-CURRENT.</para> 

      <para>Si trabaja con versiones anticuadas de los fuentes 
        desafortunadamente significar&aacute; que sus cambios 
        podr&iacute;an con frecuencia resultar demasiado obsoletos 
        o demasiado divergentes para una f&aacute;cil reintegraci&oacute;n 
        dentro de FreeBSD. &Eacute;sta posibilidad puede minimizarse 
        suscribi&eacute;ndose a la &a.announce; y a la &a.current;, 
        donde tienen lugar los debates sobre el estado actual del 
        sistema.</para> 

      <para>Asumiendo que puede manejarse con seguridad con unos fuentes 
        totalmente actualizados sobre los que aplicar sus cambios, el 
        siguiente paso es generar los <quote>diffs</quote> que enviar&aacute; 
        al equipo de FreeBSD.  H&aacute;galo con el comando 
        &man.diff.1;.</para>

      <para>El formato &man.diff.1; que preferimos para el env&iacute;o 
        de parches es la salida unificada generada por <command>diff 
        -u</command>. Sin embargo, para parches que implican cambios 
        sustanciales en una regi&oacute;n de c&oacute;digo una salida 
        contextual de <quote>diff</quote> generada por <command>diff 
        -c</command> resultar&aacute; m&aacute;s legible y en consecuencia 
        preferible.</para>

      <indexterm>
        <primary><command>diff</command></primary>
      </indexterm>

      <para>Por ejemplo:</para>

      <para>
	<screen>&prompt.user; <userinput>diff -c ficheroant&iacute;guo ficheronuevo</userinput></screen> 

	o 

	<screen>&prompt.user; <userinput>diff -c -r directorioant&iacute;guo directorionuevo</userinput></screen> 

        generar&iacute;an un conjunto de <quote>diffs</quote> contextuales 
        de fichero fuente o la jerarqu&iacute;a de directorios.</para>

      <para>Del mismo modo 
        <screen>&prompt.user; <userinput>diff -u ficheroant&iacute;guo ficheronuevo</userinput></screen>   
        o 
        <screen>&prompt.user; <userinput>diff -u -r directorioant&iacute;guo directorionuevo</userinput></screen>

        nos dar&iacute;an el mismo resultado excepci&oacute;n hecha 
        del formato unificado de los <quote>diffs</quote> 
        resultantes.</para>

      <para>Consulte la p&aacute;gina man de &man.diff.1; para m&aacute;s 
        detalles.</para>

      <para>Una vez que disponga de un conjunto de <quote>diffs
        </quote> (que deber&iacute;a probar con el comando 
        &man.patch.1;) puede enviarlos para que sean inclu&iacute;dos en 
        FreeBSD. Utilice el programa &man.send-pr.1; tal y como se muestra 
	<link linkend="contrib-general">Informes de Errores y Comentarios 
	Generales</link>. &iexcl;<emphasis>No</emphasis> se limite simplemente 
        a enviar sus <quote>diffs</quote> a la &a.hackers; o se 
        perder&aacute;n!   Agradecemos inmensamente su colaboraci&oacute;n 
        (&iexcl;&eacute;ste es un proyecto que funciona gracias al 
        trabajo desinteresado de mucha gente!). Estamos muy ocupados, 
        as&iacute; que no podemos atender inmediatamente todos y cada uno 
        de los env&iacute;os recibidos, pero permanecer&aacute;n en la 
        <quote>PR database</quote> hasta que lo hagamos.  Etiquete sus 
        env&iacute;os incluyendo <literal>[PATCH]</literal> en la 
        sin&oacute;psis del informe.</para> 

      <indexterm>
        <primary><command>uuencode</command></primary>
      </indexterm>

      <para>Si lo considera oportuno (&eacute;sto es, si ha 
        a&ntilde;adido borrado o renombrado ficheros) 
        empaquete sus cambios en un fichero <command>tar
        </command> y ejecute el programa &man.uuencode.1; 
        sobre &eacute;l.  Puede usar tambi&eacute;n ficheros 
        creados con &man.shar.1;</para> 

      <para>Si su cambio puede tener un cariz potencialmente 
        delicado &eacute;sto es, no est&aacute; seguro de bajo 
        qu&eacute; tipo de <quote>licencia</quote> ser&iacute;a 
        su distribuci&oacute;n ulterior o simplemente no est&aacute; 
        listo para liberarlo sin una revisi&oacute;n exhaustiva, 
        deber&iacute;a enviarlo directamente a &a.core; en lugar de 
        usar &man.send-pr.1;.  El &a.core; incluye un grupo de gente 
        mucho m&aacute;s peque&ntilde;o que lleva a cabo la mayor 
        parte del trabajo diario en FreeBSD.  Tenga en cuenta que 
        el &a.core;  est&aacute; <emphasis>muy ocupado</emphasis> y 
        por lo tanto s&oacute;lo deber&iacute;a envi&aacute;rsele 
        correo cuando sea estrictamente necesario.</para> 

      <para>Consulte la p&aacute;ginas <quote>man</quote> de 
        &man.intro.9; y &man.style.9; para saber m&aacute;s acerca 
        del estilo de codificaci&oacute;n requerido.  Le 
        agradecer&iacute;amos mucho que al menos tuviera en cuenta 
        esa informaci&oacute;n antes de enviar c&oacute;digo.</para> 
    </sect2>

    <sect2>
      <title>New Code or Major Value-Added Packages</title>

      <para>En el caso de una contribuci&oacute;n significativa o de 
        gran impacto, o si se trata de a&ntilde;adir una nueva 
        caracter&iacute;stica importante a FreeBSD, enviar ficheros 
        tar tratados con <quote>uuencode</quote> o por el contrario 
        ponerlos a disposici&oacute;n de otras personas en un sitio 
        web o FTP se convierte en algo pr&aacute;cticamente 
        imprescindible.  Si no dispone de acceso a un sitio web o 
        FTP  pregunte en la lista apropiada de FreeBSD para que 
        alguien se lo facilite.</para>

      <para>Cuando se trabaja con un gran volumen de c&oacute;digo 
        el espinoso tema de la <quote>licencia</quote> invariablemente 
        sale a la palestra. Las <quote>licencias</quote> admitidas 
        para la inclusi&oacute;n de c&oacute;digo en FreeBSD 
        son:</para>

      <orderedlist>
  <indexterm><primary>La Licencia BSD</primary></indexterm>
	<listitem>
	  <para>La licencia BSD.  &Eacute;sta licencia es la preferida 
            a causa de su naturaleza carente de <quote>requerimientos 
             a&ntilde;adidos</quote> y su atractivo general para la 
             empresa. Lejos de buscar evitar el uso comercial, el 
             Proyecto FreeBSD recomienda vivamente la participaci&oacute;n 
             de entidades comerciales que pudieran en casos determinados 
             dedicar parte de sus recursos a FreeBSD.</para>  
	</listitem>

  <indexterm><primary>GPL</primary><see>GNU General Public License</see></indexterm>
  <indexterm><primary>GNU General Public License</primary></indexterm>
	<listitem>
	  <para>La GNU General Public License, o <quote>GPL</quote>.
            &Eacute;sta licencia no es tan popular debido al esfuerzo 
            a&ntilde;adido que requiere de cualquiera que usara el 
            c&oacute;digo con fines comerciales, pero dada la ingente 
            cantidad de c&oacute;digo GPL que usamos habitualmente 
            (el compilador, el ensamblador, el procesador de texto,
             etc) ser&iacute;a est&uacute;pido rechazar contribuciones 
            bajo &eacute;sta licencia.  El c&oacute;digo bajo licencia 
            GPL tambi&eacute;n se incluye bajo una parte diferenciada 
            del &aacute;rbol, pudiendo ser  
	    <filename>/sys/gnu</filename> o   
	    <filename>/usr/src/gnu</filename>, y es por tanto 
            f&aacute;cilmente identificable para quienes la licencia 
            GPL suponga un problema.</para> 
	</listitem>
      </orderedlist>

      <para>Todo lo que vaya bajo cualquier otro tipo de licencia 
        requiere que &eacute;sta deba ser cuidadosamente revisada 
        antes de que su inclusi&oacute;n en FreeBSD sea llevada a 
        consideraci&oacute;n. Las aportaciones bajo licencias 
        comerciales particularmente restrictivas en vigor por lo 
        general son rechazadas aunque siempre se recomienda a los 
        autores que hagan p&uacute;blicamente accesible su trabajo 
        usando sus propios medios.</para>  

      <para>Para poner su trabajo bajo la licencia <quote>BSD</quote>  
        inserte el siguiente texto al principio de todos y cada uno 
        de los ficheros de c&oacute;digo que quiera amparar bajo la 
        misma, reemplazando el texto entre  
	<literal>%%</literal> con la informaci&oacute;n 
        apropiada:</para>

      <programlisting>Copyright (c) %%a&ntilde;os_exactos%%
        %%su_nombre%%, %%su_estado/pa&iacute;s%%  %%su_c&oacute;digo_postal%%.  
	All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
1. Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer as
   the first lines of this file unmodified.
2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

THIS SOFTWARE IS PROVIDED BY %%su_nombre%% ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL %%su_nombre%% BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

        &#36;Id&#36;</programlisting>

      <para>Para su comodidad existe una copia de &eacute;ste texto en
	<filename>/usr/share/examples/etc/bsd-style-copyright</filename>.</para>
    </sect2>

    <sect2>
      <title>Dinero, Hardware o Acceso a Internet</title>

      <para>Estamos encantados de aceptar donaciones econ&oacute;micas 
        para ayudar a impulsar el Proyecto FreeBSD y, como en cualquier 
        proyecto mantenido por voluntarios, un poco puede hacer 
        mucho.  Tambi&eacute;n son muy importantes las donaciones de 
        hardware para ampliar nuestra lista de hardware soportado, 
        dado que normalmente andamos cortos de fondos con los que 
        comprar ese tipo de material.</para>

      <sect3>
	<title><anchor id="donations">Donaci&oacute;n de Fondos</title>

        <para>La Fundaci&oacute;n FreeBSD es una fundaci&oacute;n sin 
          &aacute;nimo de lucro y exenta de impuestos creada para 
          impulsar los objetivos del Proyecto FreeBSD.  Como una entidad 
          501(c)3, la Fundaci&oacute;n est&aacute; 
          pr&aacute;cticamente exenta del pago del impuesto federal 
          de la renta de los EEUU as&iacute; como del del Estado de 
          Colorado. Las donaciones a una entidad libre de impuestos 
          suelen ser deducibles en la declaraci&oacute;n federal de 
          impuestos.</para>

        <para>Las donaciones pueden enviarse mediante cheque a:
	  <address>
	    The FreeBSD Foundation
	    <street>7321 Brockway Dr.</street>
	    <city>Boulder</city>, <state>CO</state> <postcode>80303</postcode>
	    <country>USA</country>
	  </address>
	</para>

        <para>La Fundaci&oacute;n FreeBSD puede tambi&eacute;n aceptar 
          donaciones via web mediante PayPal.  Para hacer una 
          donaci&oacute;n visite la p&aacute;gina web <ulink 
	  url="http://www.freebsdfoundation.org">de la 
	  Fundaci&oacute;n</ulink>.</para>

        <para>Puede encontrar m&aacute;s informaci&oacute;n sobre 
          la Fundaci&oacute;n en <ulink
	  url="http://people.FreeBSD.org/~jdp/foundation/announcement.html">The
	  FreeBSD Foundation -- an Introduction</ulink>.  Puede enviar correo
          electr&oacute;nico a la Fundaci&oacute;n a 
	  <email>bod@FreeBSDFoundation.org</email>.</para>
      </sect3>

      <sect3>
        <title>Donaci&oacute;n de Hardware</title>
  <indexterm><primary>donaciones</primary></indexterm>

        <para>El Proyecto FreeBSD acepta encantado donaciones de 
          hardware que le resulte &uacute;til.  Si desea donar 
          hardware por favor p&oacute;ngase en contacto con la <ulink
	  url="http://www.FreeBSD.org/donations/">Donations Liaison
	  Office</ulink>.</para>
      </sect3>

      <sect3>
        <title>Donaci&oacute;n de Acceso a Internet</title>

        <para>Nunca viene mal una nueva r&eacute;plica para sitios 
          FTP, WWW o <command>cvsup</command>.  Si desea ofrecer 
          alguno de esos servicios por favor consulte el siguiente 
          art&iacute;culo <ulink  
	  url="../../articles/hubs/index.html">Mirroring FreeBSD</ulink>
	  para m&aacute;s informaci&oacute;n.</para>
      </sect3>
    </sect2>
  </sect1>

</article>

<!-- 
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
