<!DOCTYPE HTML PUBLIC "-//FreeBSD//DTD HTML 4.01 Transitional-Based Extension//EN" [
<!ENTITY base CDATA "../..">
<!ENTITY date "$FreeBSD: www/fr/releases/4.3R/notes.sgml,v 1.4 2005/10/06 12:56:08 blackend Exp $">
<!ENTITY title "Notes sur la version 4.3 de FreeBSD">
<!ENTITY % navinclude.download "INCLUDE">
]>

<!--
   The FreeBSD French Documentation Project
   Original revision: 1.3
   Version francaise : Frederic F Eliot, Stephane Legrand
-->

<html>
&header;

<pre>
                                 NOTES DE VERSION
                           Version 4.3-RELEASE de FreeBSD

Il est indispensable de nous contacter en utilisant la commande
send-pr en cas d'&eacute;chec total ou de "crash" lors de l'installation
de FreeBSD (pour ceux qui pr&eacute;f&egrave;rent une interface Web, consultez
aussi http://www.freebsd.org/send-pr.html).

Pour plus d'informations sur FreeBSD et l'organisation des r&eacute;pertoires
de la version 4.3 (surtout si vous faites une installation &agrave; partir
de disquettes !), consultez le fichier ABOUT.TXT. Consultez les
fichiers INSTALL.TXT et HARDWARE.TXT pour les instructions concernant
l'installation.


Table des mati&egrave;res:
------------------
1. Quoi de neuf depuis la version 4.2 ?
   1.1 CHANGEMENTS DANS LE NOYAU
   1.2 CORRECTIONS LIEES A LA SECURITE
   1.3 CHANGEMENTS DANS LES PROGRAMMES UTILISATEURS

2. Configurations support&eacute;es
   2.1 Contr&ocirc;leurs de disques
   2.2 Cartes Ethernet
   2.3 FDDI
   2.4 ATM
   2.5 Divers

3. Vous procurer FreeBSD
   3.1 FTP/Courrier &eacute;lectronique
   3.2 CDROM

4. Mise &agrave; jour des versions ant&eacute;rieures de FreeBSD

5. Signaler des probl&egrave;mes, faire des suggestions, soumettre du code

6. Remerciements


1. Quoi de neuf depuis la version 4.2 ?
---------------------------------------

1.1. CHANGEMENTS DANS LE NOYAU
------------------------------

L'&eacute;criture combin&eacute;e pour les dumps en cas de crash a &eacute;t&eacute; impl&eacute;ment&eacute;e.
Cette fonction est utile lorsque le cache en &eacute;criture est d&eacute;sactiv&eacute;
sur les disques SCSI et IDE et o&ugrave; les gros dumps m&eacute;moire pouvait
prendre jusqu'&agrave; une heure.

Le gestionnaire de p&eacute;riph&eacute;rique pccard et pccardc(8) supportent
maintenant des "types de beep" multiples lors de l'insertion et de
l'enl&egrave;vement des cartes.

Le gestionnaire de p&eacute;riph&eacute;rique twe(4) pour les contr&ocirc;leurs 3Ware
Escalade a &eacute;t&eacute; mis &agrave; jour.

Le gestionnaire de p&eacute;riph&eacute;rique an(4) pour les cartes Cisco Aironet
supporte d&eacute;sormais le chiffrement "Wired Equivalent Privacy (WEP)"
qu'il est possible d'activer via ancontrol(8).

Les gestionnaires de p&eacute;riph&eacute;riques wi(4) et an(4) sont maintenant
par d&eacute;faut en mode BSS (infrastructure). Le mode par d&eacute;faut &eacute;tait
auparavant le mode ad-hoc.

Le gestionnaire de p&eacute;riph&eacute;rique ray(4), qui supporte les cartes
r&eacute;seaux sans fil Webgear Aviator a &eacute;t&eacute; ajout&eacute;. Les interfaces ray(4)
peuvent &ecirc;tre contr&ocirc;l&eacute;es via raycontrol(8).

Le support des contr&ocirc;leurs RAID PCI-SCSI de la famille Adaptec FSA
a &eacute;t&eacute; ajout&eacute; avec le gestionnaire de p&eacute;riph&eacute;rique aac(4).

Les cartes PCCARD Linksys Fast Ethernet support&eacute;es par le gestionnaire
de p&eacute;riph&eacute;rique ed(4) recqui&egrave;rent d&eacute;sormais l'ajout du flag 0x80000
dans le fichier de configuration pccard.conf(5). Ce flag n'est pas
optionnel. Ces cartes Linksys ne seront pas reconnues sans ce flag.

Une erreur dans le gestionnaire de p&eacute;riph&eacute;rique ed(4) qui pouvait
provoquer une panique avec les paquets tr&egrave;s courts et le BPF ou le
relais activ&eacute; a &eacute;t&eacute; corrig&eacute;.

Une erreur dans le syst&egrave;me de fichier FFS qui pouvait provoquer
une corruption du superblock sur les tr&egrave;s grands syst&egrave;mes de fichiers
a &eacute;t&eacute; corrig&eacute;.

Le syst&egrave;me de fichier ISO-9660 supporte d&eacute;sormais une routine de
conversion de caract&egrave;res que l'on peut charger dynamiquement. Le
port sysutils/cd9660_unicode contient un jeu de conversions courantes.

Une nouvelle fonction de hashage NFS (bas&eacute;e sur l'algorithme de
hashage de Fowler/Noll/Vo) a &eacute;t&eacute; impl&eacute;ment&eacute;e afin d'am&eacute;liorer les
performances NFS en am&eacute;liorant l'efficacit&eacute; des tables de hashage
de nfsnode.

Le gestionnaire de p&eacute;riph&eacute;rique cs(4) a &eacute;t&eacute; mis &agrave; jour.

Am&eacute;liorations et corrections d'erreurs dans bridge(4) et dummynet(4).

Mise &agrave; jour du gestionnaire de p&eacute;riph&eacute;rique ahc(4). En plus d'autres
am&eacute;liorations, la compatibilit&eacute; avec le mode "RAID Port" et les
syst&egrave;mes avec des cartes AAA et ARO a &eacute;t&eacute; am&eacute;lior&eacute;e ainsi que les
performances. Quelques erreurs ont &eacute;galement &eacute;t&eacute; corrig&eacute;es dont
un cas rare d'arr&ecirc;t du syst&egrave;me avec les contr&ocirc;leurs Ultra2/U160.

Le gestionnaire de p&eacute;riph&eacute;rique cd(4) supporte d&eacute;sormais les
op&eacute;rations en &eacute;criture. Cela permet l'&eacute;criture sur les DVD-RAM, PD
et disques similaires qui sont reconnus en tant que p&eacute;riph&eacute;riques
de type CD. Notez que ce changement ne concerne que les p&eacute;riph&eacute;riques
avec &eacute;criture en acc&egrave;s al&eacute;atoire et pas les p&eacute;riph&eacute;riques avec
&eacute;criture s&eacute;quentielle comme les CD-R qui sont support&eacute;s par
cdrecord(1).

La proc&eacute;dure "make buildkernel" a l&eacute;g&egrave;rement chang&eacute;. Elle obtient
le nom de(s) configuration(s) &agrave; construire &agrave; partir de la variable
KERNCONF (KERNEL est toujours valide mais obsol&egrave;te). Le nom du
noyau install&eacute; peut &ecirc;tre modifi&eacute; avec la variable INSTKERNEL. La
variable NO_KERNELCLEAN emp&ecirc;che le "nettoyage" (qui est d&eacute;sormais
fait via un "make clean" plut&ocirc;t que "config -r") du r&eacute;pertoire de
compilation du noyau.

La fonction kobj a &eacute;t&eacute; mise &agrave; jour depuis la version -CURRENT pour
un meilleur support des gestionnaires de p&eacute;riph&eacute;riques audios.

Des gestionnaires de p&eacute;riph&eacute;riques diff&eacute;rents pour les SoundBlaster
8 et les Soundblaster 16 remplacent l'ancien gestionnaire unique.

Ajout d'un gestionnaire de p&eacute;riph&eacute;rique pour le ESS Maestro-3/Allegro.
Cependant, en raison de restrictions li&eacute;es &agrave; la licence, il ne peut
&ecirc;tre compil&eacute; avec le noyau. Pour utiliser ce gestionnaire, ajouter
la ligne suivante au fichier /boot/loader.conf :

   snd_maestro3_load="YES"

Le gestionnaire de p&eacute;riph&eacute;rique pcm(4) supporte d&eacute;sormais les
composants audios CMedia CMI8338/CMI8738 ainsi que CS4281.

Lorsque les modules audios sont compil&eacute;s, on peut d&eacute;sormais charger
tous les gestionnaires et l'infrastructure n&eacute;cessaire avec "kldload
snd".

Mise &agrave; jour du gestionnaire de p&eacute;riph&eacute;rique isp(4).

Mise &agrave; jour de ipfilter avec la version 3.4.16.

ipfw(8) a une nouvelle fonction ("me") qui permet la reconnaissance
des paquets sur les interfaces avec des adresses IP dynamiques.

Correction de quelques erreurs dans TCP pour le ACK diff&eacute;r&eacute;.

TCP supporte d&eacute;sormais la modification NewReno sur l'algorithme
"TCP Fast Recovery". Cette fonction peut &ecirc;tre contr&ocirc;l&eacute;e via la
variable sysctl net.inet.tcp.newreno.

TCP utilise d&eacute;sormais un timeout plus agressif pour les segments
SYN initiaux. Cela permet aux essais de connexions initiaux d'&ecirc;tre
abandonn&eacute;s plus rapidement.

Les messages ICMP UNREACH_FILTER_PROHIB peuvent d&eacute;sormais RST les
connexions TCP avec l'&eacute;tat SYN_SENT si les num&eacute;ros de s&eacute;quences
corrects sont renvoy&eacute;s. Cela peut &ecirc;tre contr&ocirc;l&eacute; via la variable
sysctl net.inet.tcp.icmp_may_rst.

Une nouvelle variable sysctl net.inet.ip.check_interface, par d&eacute;faut
d&eacute;sactiv&eacute;e (d&eacute;faut &agrave; "off"), permet &agrave; IP de v&eacute;rifier qu'un paquet
entrant arrive sur une interface qui poss&egrave;de une adresse correspondant
&agrave; l'adresse de destination du paquet.

Mise &agrave; jour du gestionnaire de p&eacute;riph&eacute;riques ata(4).

Pour permettre une configuration plus flexible, les diverses options
du gestionnaire de p&eacute;riph&eacute;riques ata(4) sont maintenant configurables
au boot plut&ocirc;t que dans la configuration du noyau.

Le gestionnaire de p&eacute;riph&eacute;riques ata(4) supporte d&eacute;sormais les
modes ATA66 et ATA100 sur les jeux de composants Acer Alladin.

kqueue(2) a &eacute;t&eacute; &eacute;tendu &agrave; la couche des p&eacute;riph&eacute;riques et quelques
erreurs ont &eacute;t&eacute; corrig&eacute;es.

Quelques corrections dans la gestion des signaux pour Linux. Cela
am&eacute;liore la compatibilit&eacute; avec les programmes utilisant beaucoup
les signaux fonctionnant sous &eacute;mulation Linux.

Support des crashdump pour les disques utilisant le gestionnaire
de p&eacute;riph&eacute;riques ida.

Quelques modifications dans la gestion des files d'attente, une
am&eacute;lioration des acc&egrave;s concurrents et quelques corrections afin
d'am&eacute;liorer la stabilit&eacute; pour le gestionnaire de p&eacute;riph&eacute;riques
mly(4).

Plusieurs corrections d'erreurs mineures dans le code des r&eacute;seaux
VLAN.

Quelques corrections d'erreurs dans Vinum.

Changements sp&eacute;cifiques &agrave; l'architecture Alpha :

   Correction d'une erreur dans le code d&eacute;pendant de la machine pour
   les AlphaServer 1000 et 1000A. Cette erreur avait pour cons&eacute;quence
   de permettre uniquement aux syst&egrave;mes AS1000 &eacute;quip&eacute;s de EV4 et
   AS1000A &eacute;quip&eacute;s de EV5 de fonctionner.

   Confirmation que la carte m&egrave;re API UP1100 fonctionne correctement.

   Confirmation que le serveur API CS20 1U fonctionne correctement.

   Support du AlphaServer 2100A ("Lynx").

   Les AlphaServer 4000 et 4100 refusent de d&eacute;marrer depuis les
   CD-ROM ou les disquettes d'installation FreeBSD. Pour contourner
   ce probl&egrave;me, il est possible de copier l'image de la disquette
   2.88 Mo avec "dd" sur un disque dur et de d&eacute;marrer l'installation
   depuis ce disque. Une fois que sysinstall(8) est lanc&eacute;, une
   installation normale peut &ecirc;tre effectu&eacute;e. Des probl&egrave;mes similaires
   ont &eacute;t&eacute; observ&eacute;s sur les AlphaServer 1200 et 8400.

   Pour les AlphaServer 4100, les cartes adaptateurs avec passerelle
   PCI peuvent causer des probl&egrave;mes. De plus, la possibilit&eacute; de
   d&eacute;marrer depuis un adaptateur peut &ecirc;tre influenc&eacute; par la position
   de la carte adaptateur sur un connecteur PCI sp&eacute;cifique. Veuillez
   utilisez 'send-pr' pour rapporter tous les probl&egrave;mes de ce type
   que vous pourriez rencontrer.


1.2. CORRECTIONS LIEES A LA SECURITE
------------------------------------

Plusieurs corrections ont &eacute;t&eacute; apport&eacute;es &agrave; l'impl&eacute;mentation Kerberos
IV sur des probl&egrave;mes li&eacute;s aux variables d'environnement, &agrave; un
possible d&eacute;bordement de tampon m&eacute;moire et &agrave; une r&eacute;&eacute;criture des
fichiers de tickets.

telnet(1) fait maintenant une meilleure s&eacute;curisation de son
environnement.

Plusieurs vuln&eacute;rabilit&eacute;s dans procfs(4) ont &eacute;t&eacute; corrig&eacute;es (voir
l'alerte de s&eacute;curit&eacute; FreeBSD-SA-00:77).

Une erreur dans ipfw(8) et ip6fw(8) o&ugrave; des segments TCP de r&eacute;ception
pouvaient &ecirc;tre trait&eacute;s de fa&ccedil;on incorrecte comme faisant partie
d'une connexion &eacute;tablie a &eacute;t&eacute; corrig&eacute;e (voir l'alerte de s&eacute;curit&eacute;
FreeBSD-SA-01:08).

Une erreur dans crontab(8) qui pouvait permettre aux utilisateurs
de lire n'importe quel fichier du syst&egrave;me avec une syntaxe crontab(5)
valide a &eacute;t&eacute; corrig&eacute;e (voir l'alerte de s&eacute;curit&eacute; FreeBSD-SA-01:09).

Une vuln&eacute;rabilit&eacute; dans inetd(8) qui pouvait permettre l'acc&egrave;s en
lecture sur les 16 premiers octets des fichiers accessibles au
groupe wheel a &eacute;t&eacute; corrig&eacute;e (voir l'alerte de s&eacute;curit&eacute; FreeBSD-SA-01:11).

Une erreur dans periodic(8) qui donnait lieu &agrave; une utilisation de
fichiers temporaires non s&eacute;curis&eacute;s a &eacute;t&eacute; corrig&eacute;e (voir l'alerte
de s&eacute;curit&eacute; FreeBSD-SA-01:12).

Pour corriger un d&eacute;bordement de tampon m&eacute;moire qui pouvait &ecirc;tre
exploit&eacute; &agrave; distance, BIND a &eacute;t&eacute; mis &agrave; jour avec la version 8.2.3
(voir l'alerte de s&eacute;curit&eacute; FreeBSD-SA-01:18).

OpenSSH peut maintenant pr&eacute;venir (au lieu de juste jouer sur des
limites de connexion) une attaque qui pouvait conduire &agrave; deviner
la clef du serveur (pas la clef du client) en reg&eacute;n&eacute;rant la clef
du serveur lorsqu'un &eacute;chec RSA est d&eacute;tect&eacute; (voir l'alerte de s&eacute;curit&eacute;
FreeBSD-SA-01:24).

Une erreur dans ICMP qui pouvait permettre &agrave; un attaquant d'interrompre
les "sessions" TCP et UDP a &eacute;t&eacute; corrig&eacute;e.

Une erreur dans timed(8) qui pouvait le faire planter si certains
paquets mal form&eacute;s &eacute;taient envoy&eacute;s a &eacute;t&eacute; corrig&eacute;e (voir l'alerte
de s&eacute;curit&eacute; FreeBSD-SA-01:28).

Une erreur dans rwhod(8) qui pouvait le faire planter si certains
paquets mal form&eacute;s &eacute;taient envoy&eacute;s a &eacute;t&eacute; corrig&eacute;e (voir l'alerte
de s&eacute;curit&eacute; FreeBSD-SA-01:29).

Un trou de s&eacute;curit&eacute; dans les impl&eacute;mentations FreeBSD de FFS et de
EXT2FS qui permettait l'apparition de certaines conditions pouvant
laisser les utilisateurs avoir acc&egrave;s &agrave; des donn&eacute;es non autoris&eacute;es
a &eacute;t&eacute; corrig&eacute; (voir l'alerte de s&eacute;curit&eacute; FreeBSD-SA-01:30).

Une vuln&eacute;rabilit&eacute; exploitable &agrave; distance dans ntpd(8) a &eacute;t&eacute; corrig&eacute;e
(voir l'alerte de s&eacute;curit&eacute; FreeBSD-SA-01:31).

Un trou de s&eacute;curit&eacute; dans le cache de fragment de IPFilter a &eacute;t&eacute;
corrig&eacute; (voir l'alerte de s&eacute;curit&eacute; FreeBSD-SA-01:32).

Des d&eacute;bordements de tampon m&eacute;moire dans glob(3) qui pouvait permettre
l'ex&eacute;cution de code quelconque sur un serveur FTP ont &eacute;t&eacute; corrig&eacute;s.
De plus, pour pr&eacute;venir certaines formes d'attaques DOS, glob(3)
permet maintenant de sp&eacute;cifier une limite sur le nombre de chemins
trouv&eacute;s qu'il retourne. ftpd(8) utilise d&eacute;sormais cette fonctionnalit&eacute;
(voir l'alerte de s&eacute;curit&eacute; FreeBSD-SA-01:33).

Les num&eacute;ros de s&eacute;quence initiaux dans TCP sont maintenant totalement
al&eacute;atoires avec l'utilisation d'un algorithme provenant de OpenBSD.

De nombreux programmes ont vus leurs cha&icirc;nes de formatage pour les
sorties corrig&eacute;es de mani&egrave;re &agrave; r&eacute;duire le risque de vuln&eacute;rabilit&eacute;s.

De nombreux programmes qui utilisent des fichiers temporaires le
font maintenant de mani&egrave;re plus s&eacute;curis&eacute;e.


1.3. CHANGEMENTS DANS LES PROGRAMMES UTILISATEURS
-------------------------------------------------

newfs(1) impl&eacute;mente d&eacute;sormais l'&eacute;criture combin&eacute;e ce qui peut rendre
la cr&eacute;ation des nouveaux syst&egrave;mes de fichier jusqu'&agrave; 7 fois plus
rapide.

Plusieurs d&eacute;bordements de tampon m&eacute;moire dans config(8) ont &eacute;t&eacute;
corrig&eacute;s.

Mise &agrave; jour de binutils avec la version 2.10.1.

Mise &agrave; jour de OpenSSL avec la version 0.9.6.

OpenSSL supporte d&eacute;sormais les optimisations en assembleur d&eacute;pendant
de la machine qui sont activ&eacute;s avec les nouvelles variables Makefile
CPUTYPE/MACHINE_CPU.

file(1) fait maintenant partie des contributions et a &eacute;t&eacute; mis &agrave;
jour avec la version 3.33.

groff(1) et ses utilitaires associ&eacute;s ont &eacute;t&eacute; mis &agrave; jour avec la
version 1.16.1 de la FSF.

indent(1) a gagn&eacute; quelques nouvelles options de formatage.

sysinstall(8) utilise maintenant des d&eacute;fauts plus intuitifs gr&acirc;ce
&agrave; des nouvelles fonctions pour les dialogues.

sysinstall(8) pr&eacute;serve maintenant correctement le contenu de
/etc/mail lors d'une mise &agrave; jour binaire.

La partition racine par d&eacute;faut dans sysinstall(8) est maintenant
de 100 Mo.

libdisk peut d&eacute;sormais effectuer la configuration au moment de
l'installation du lanceur de d&eacute;marrage boot0 pour i386.

rm(1) -v affiche maintenant le chemin complet du fichier supprim&eacute;.

Am&eacute;liorations mineures de lpr(1), lpq(1) et lpd(8).

Mise &agrave; jour de OpenSSH avec la version 2.3.0. Cette version ajoute
le support de l'algorithme de chiffrement Rijndael.

Ajout de la compatibilit&eacute; avec Kerberos pour OpenSSH.

OpenSSH a &eacute;t&eacute; modifi&eacute; pour &ecirc;tre plus r&eacute;sistant aux analyses de
traffic en exigeant que les caract&egrave;res "non-r&eacute;p&eacute;t&eacute;s" sont toujours
retourn&eacute;s dans un paquet nul ainsi qu'en compl&eacute;tant les mots de
passe envoy&eacute;s de fa&ccedil;on &agrave; ce que aucun indice au sujet de la longueur
des mots de passe ne puisse &ecirc;tre d&eacute;couvert.

syslogd(8) supporte d&eacute;sormais une facilit&eacute; "LOG_CONSOLE" (d&eacute;sactiv&eacute;
par d&eacute;faut) qui peut &ecirc;tre utilis&eacute;e pour enregistrer la sortie de
/dev/console.

cdcontrol(1) utilise maintenant la variable d'environnement CDROM
pour trouver le p&eacute;riph&eacute;rique par d&eacute;faut.

Tous les packages et les ports contiennent maintenant une directive
"origine" qui permet plus facilement aux programmes tels que
pkg_version(1) de d&eacute;terminer le r&eacute;pertoire o&ugrave; un package a &eacute;t&eacute;
compil&eacute;.

pkg_info(1) accepte maintenant une option -g afin de v&eacute;rifier la
concordance entre un package install&eacute; et sa somme de contr&ocirc;le (son
CRC) enregistr&eacute; (pour voir si le package a &eacute;t&eacute; modifi&eacute; apr&egrave;s son
installation). Naturellement, ce m&eacute;canisme est seulement aussi
s&eacute;curis&eacute; que le contenu de /var/db/pkg dans le cas o&ugrave; cela est
utilis&eacute; &agrave; des fins d'audit.

pkg_create(1) et pkg_add(1) peuvent maintenant &ecirc;tre utilis&eacute;s avec
des packages compress&eacute;s avec bzip2(1). pkg_add(1) utilise la variable
d'environnement PACKAGEROOT pour trouver un site miroir pour les
nouveaux packages.

pkg_info(1) supporte maintenant les jokers pour les noms des packages
install&eacute;s. L'option -G emp&ecirc;che ce comportement et l'option -x permet
l'utilisation des expressions r&eacute;guli&egrave;res au lieu des jokers shell.

Ajout de pkg_sign(1) et pkg_check(1) pour signer et v&eacute;rifier les
signatures sur les fichiers des packages binaires.

Ajout de pkg_update(1), un utilitaire pour mettre &agrave; jour les packages
install&eacute;s et leurs d&eacute;pendances.

pkg_delete(1) peut maintenant utiliser les jokers ou les expressions
r&eacute;guli&egrave;res pour les noms de package. De plus, il supporte l'option
-a pour supprimer tous les packages et l'option -i pour une
confirmation interactive &agrave; la mani&egrave;re de rm(1).

pkg_create(1) enregistre maintenant les d&eacute;pendances dans l'ordre
des d&eacute;pendances et non plus dans l'ordre sp&eacute;cifi&eacute; sur la ligne de
commande. Cela am&eacute;liore le fonctionnement de la commande "pkg_add
-r".

pkg_version(1) a maintenant une routine de comparaison de num&eacute;ro
de version qui correspond au Manuel des Porteurs de Logiciels. Il
a &eacute;galement une option -t pour les simples tests de comparaisons
( =, < ou > ).

Mise &agrave; jour de awk de gawk-3.0.4 vers gawk-3.0.6. Cela corrige
plusieurs erreurs mineures et apporte quelques am&eacute;liorations pour
les performances.

Peu apr&egrave;s la r&eacute;ception du signal SIGINFO (normalement un control-T
depuis le terminal de contr&ocirc;le) fsck(8) affiche maintenant une
ligne qui indique le num&eacute;ro de phase courante et des informations
sur la progression de la phase courante.

pwd(1) peut maintenant servir de realpath(1), un programme pour
r&eacute;soudre des noms de chemins en noms de chemins physiques.

Mise &agrave; jour de gcc(1) avec la version 2.95.3.

gcc(1) utilise maintenant une libgcc unifi&eacute;e plut&ocirc;t qu'une pour
les programmes avec thread et une autre pour les programmes sans
thread. /usr/lib/libgcc_r.a peut &ecirc;tre supprim&eacute;.

Am&eacute;lioration de config(8) sur la conversion de divers avertissements
qui auraient dus &ecirc;tre des erreurs en erreurs fatales avec un code
de retour. Cela permet de s'assurer qu'un "make buildkernel" ne
les ignore pas silencieusement et compile un noyau bugg&eacute; sans que
personne ne puisse lire les erreurs.

Dans /etc/ssh/sshd_config, le param&egrave;tre ConnectionsPerPeriod est
obsol&egrave;te et remplac&eacute; par MaxStartups.

find(1) accepte maintenant l'option -empty qui retourne "vrai" si
un fichier ou un r&eacute;pertoire est vide.

find(1) accepte maintenant les primitives -iname et -ipath pour la
recherche insensible &agrave; la casse et les primitives -regexp et -iregexp
pour la recherche avec expression r&eacute;guli&egrave;re. L'option -E permet
d'utiliser les expressions r&eacute;guli&egrave;res &eacute;tendues.

ldconfig(8) v&eacute;rifie maintenant les permissions et le propri&eacute;taire
du r&eacute;pertoire pour une meilleure s&eacute;curit&eacute;. Ces v&eacute;rifications peuvent
&ecirc;tre d&eacute;sactiv&eacute;es avec l'option -i.

Mise &agrave; jour de sendmail(8) et des utilitaires associ&eacute;s de la version
8.11.1 vers la version 8.11.3. Veuillez consulter le fichier
/usr/src/contrib/sendmail/RELEASE_NOTES pour de plus amples
informations.

Nouvelles options pour make.conf : SENDMAIL_MC et SENDMAIL_ADDITIONAL_MC.
Veuillez consulter le fichier /etc/defaults/make.conf pour de plus
amples informations.

Le Makefile de /etc/mail supporte d&eacute;sormais : la nouvelle option
SENDMAIL_MC de make.conf, la possibilit&eacute; de g&eacute;n&eacute;rer les fichiers
.cf &agrave; partir des fichiers .mc, la reconstruction des fichiers "map",
la reconstruction du fichier d'alias et la possibilit&eacute; d'arr&ecirc;ter,
de lancer ou de red&eacute;marrer sendmail.

vidcontrol(1) accepte maintenant un param&egrave;tre -g pour s&eacute;lectionner
une g&eacute;om&eacute;trie de texte personnalis&eacute;e avec le mode texte trame
VESA_800x600.

L'appel rfork_thread(3) a &eacute;t&eacute; ajout&eacute; en tant qu'aide &agrave; la fonction
rfork(2). L'utilisation de cette fonction devrait &eacute;viter
l'impl&eacute;mentation de code complexe d'&eacute;change de pile.

La distribution compat3x a &eacute;t&eacute; mise &agrave; jour pour inclure les librairies
pr&eacute;sentes dans FreeBSD 3.5.1-RELEASE.

Mise &agrave; jour de gperf avec la version 2.7.2.

Comme la plupart des autres utilitaires r&eacute;seaux du syst&egrave;me, lpr(1),
lpd(8), syslogd(8), et logger(1) sont maintenant compatibles avec
IPv6.

Lors de la suppression de plusieurs packages, pkg_delete(1) essaye
maintenant de les supprimer dans l'ordre des d&eacute;pendances plut&ocirc;t
que dans l'ordre sp&eacute;cifi&eacute; sur la ligne de commande.

burncd(8) supporte d&eacute;sormais une option -m pour le mode multi-session
(le comportement par d&eacute;faut est maintenant de fermer les disques
en session unique). Une option -l pour prendre une liste de fichiers
images &agrave; partir d'un nom de fichier a &eacute;galement &eacute;t&eacute; ajout&eacute;e, "-"
peut &ecirc;tre utilis&eacute; en tant que nom de fichier pour l'entr&eacute;e standard.

tar(1) supporte d&eacute;sormais la variable TAR_RSH, principalement pour
permettre l'utilisation de ssh(1) en tant qu'agent de transport.

Plusieurs erreurs dans make(1), notamment un comportement erron&eacute;
avec les suffixes nuls, des hypoth&egrave;ses erron&eacute;es sur les permissions
du r&eacute;pertoire courant et des d&eacute;bordements de tampon m&eacute;moire potentiels
ont &eacute;t&eacute; corrig&eacute;es.

La nouvelle variable CPUTYPE de make.conf contr&ocirc;le les optimisations
de compilation sp&eacute;cifiques au processeur dans diverses parties de
code comme OpenSSL.

La configuration au moment du d&eacute;marrage de syscons a &eacute;t&eacute; d&eacute;plac&eacute;e
vers un rc.syscons ind&eacute;pendant de la machine.

login(1) exporte d&eacute;sormais les variables d'environnement positionn&eacute;es
par les modules PAM.

ipfstat(8) supporte d&eacute;sormais l'option -t pour activer un affichage
&agrave; la mani&egrave;re de top(1).

tftpd(8) accepte maintenant les options -c et -C qui permettent au
serveur d'effectuer un chroot(2) bas&eacute; sur l'adresse IP du client.
tftp(1) et tftpd(8) peut maintenant transf&eacute;rer des fichiers plus
grand que 65535 blocs.

L'utilitaire lastlogin(1), qui affiche la derni&egrave;re date de connexion
de chaque utilisateur, a &eacute;t&eacute; import&eacute; de NetBSD.

/usr/src/share/examples/BSD_daemon/ contient maintenant une image
vectorielle de Beastie.

Mise &agrave; jour de bc de la version 1.04 &agrave; la version 1.06.

savecore(8) supporte maintenant une option -k pour emp&ecirc;cher la
suppression d'une image de crash apr&egrave;s l'avoir sauvegarder. Elle
permet &eacute;galement d'essayer d'&eacute;viter l'&eacute;criture de larges blocs
compos&eacute;s de z&eacute;ros dans les fichiers images de crash pour &eacute;conomiser
de l'espace et du temps.

Mise &agrave; jour de tcsh avec la version 6.10.

La valeur par d&eacute;faut de la variable CVS_RSH (utilis&eacute;e par cvs(1))
est maintenant ssh au lieu de rsh.

disklabel(8) supporte maintenant des tailles de partitions exprim&eacute;es
en kilo-octets, m&eacute;ga-octets ou giga-octets en plus des nombres de
secteurs.

Mise &agrave; jour de Kerberos IV avec la version 1.0.5.

Mise &agrave; jour de Heimdal avec la version 0.3e.

dump(8) supporte maintenant l'h&eacute;ritage du flag "nodump" &agrave; travers
une hi&eacute;rarchie de fichiers.

Mise &agrave; jour du client ISC DHCP avec la version 2.0pl5.

stty(1) supporte maintenant un caract&egrave;re de contr&ocirc;le "erase2" de
mani&egrave;re &agrave; ce que &agrave; la fois "delete" et "backspace" puissent &ecirc;tre
utilis&eacute;s pour effacer des caract&egrave;res.

split(1) peut maintenant fractionner un fichier sup&eacute;rieur &agrave; 2 Go.

Quelques mises &agrave; jour et corrections d'erreurs pour units(1).

netstat(1) garde maintenant trace des paquets entrant et sortant
pour chaque adresse de chaque interface.

netstat(1) accepte maintenant une option -W qui permet de ne pas
couper les adresses m&ecirc;me si elles sont trop longues pour l'affichage
de la colonne de texte.

sockstat(1) a maintenant les options -c et -l pour respectivement
avoir la liste des connect&eacute;s et la liste des sockets en &eacute;coute.

De nombreuses pages de manuel ont &eacute;t&eacute; am&eacute;lior&eacute;es &agrave; la fois dans
leurs pr&eacute;sentations et dans leurs contenus.

"lprm -" fonctionne maintenant aussi pour les files d'impression
distantes.

mergemaster(8) peut maintenant utiliser un fichier /etc/mergemaster.rc
et propose &eacute;galement &agrave; l'utilisateur de lancer les commandes
recommand&eacute;es (tels que "newaliases") si besoin.

ftpd(8) supporte maintenant une option -r pour un mode lecture
seule et une option -E pour d&eacute;sactiver EPSV. Plusieurs corrections
ont &eacute;t&eacute; apport&eacute;es pour r&eacute;duire les fuites d'informations et il est
d&eacute;sormais possible de sp&eacute;cifier les ports au moment de la compilation.

rc(8) a maintenant la structure pour g&eacute;rer les d&eacute;pendances entre
les variables rc.conf(5).

Les ports TCP par d&eacute;faut utilis&eacute;s par libfetch pour les t&eacute;l&eacute;chargements
FTP en mode passif ont &eacute;t&eacute; modifi&eacute;s. Cela affecte le comportement
de fetch(1) qui accepte l'option -U pour revenir &agrave; l'ancien
comportement.

portmap(8) a maintenant une option -h pour indiquer les adresses
IP sur lesquelles il peut se lier. Cette option peut &ecirc;tre sp&eacute;cifi&eacute;e
plusieurs fois et est typiquement n&eacute;cessaire pour les serveurs &agrave;
h&eacute;bergements multiples.

Mise &agrave; jour de GNATS avec la version 3.113.

tail(1) peut maintenant fonctionner avec des fichiers sup&eacute;rieurs
&agrave; 2 Go.


2. Configurations support&eacute;es
----------------------------

FreeBSD fonctionne avec une tres grande vari&eacute;t&eacute; de PC &agrave; base de
bus ISA, VLB, EISA, MCA et PCI allant du 386sx aux machines de type
Pentium (notez que les 386sx ne sont pas recommand&eacute;s). Les
configurations avec p&eacute;riph&eacute;riques IDE, divers contr&ocirc;leurs SCSI,
cartes r&eacute;seaux et cartes s&eacute;ries sont aussi support&eacute;es.

Ci-dessous figure une liste de p&eacute;riph&eacute;riques qui sont connus pour
fonctionner avec FreeBSD. D'autres configurations peuvent aussi
fonctionner mais pour l'instant nous n'en avons simplement pas eu
la confirmation.


2.1. Contr&ocirc;leurs disques
------------------------

IDE
ATA

Contr&ocirc;leurs ISA SCSI Adaptec 1535
Contr&ocirc;leurs ISA SCSI de s&eacute;rie Adaptec 154x
Contr&ocirc;leurs MCA SCSI de s&eacute;rie Adaptec 164x
Contr&ocirc;leurs EISA SCSI de s&eacute;rie Adaptec 174x en mode standard ou avanc&eacute;.
Contr&ocirc;leurs EISA/VLB/PCI SCSI de s&eacute;rie Adaptec
274X/284X/2920C/294x/2950/3940/3950 (Narrow/Wide/Twin)
Contr&ocirc;leurs SCSI int&eacute;gr&eacute;s Adaptec AIC7850, AIC7860, AIC7880, AIC789x.
Contr&ocirc;leurs ISA SCSI de s&eacute;rie Adaptec 1510 (ne fonctionne pas pour les
p&eacute;riph&eacute;riques de d&eacute;marrage)
Contr&ocirc;leurs ISA SCSI de s&eacute;rie Adaptec 152x
Les cartes bas&eacute;es sur Adaptec AIC-6260 et AIC-6360, ce qui inclus
les cartes SCSI AHA-152x et Soundblaster.

Les contr&ocirc;leurs SCSI RAID Adaptec 2100s, 2400A, 3200S et 3400S.

Les contr&ocirc;leurs RAID de la famille Adaptec FSA :
    Adaptec AAC-2622
    Adaptec AAC-364
    Adaptec AAC-3642
    Dell PERC 2/QC
    Dell PERC 2/Si
    Dell PERC 3/Di
    Dell PERC 3/QC
    Dell PERC 3/Si
    HP NetRAID-4M

Contr&ocirc;leurs Advansys SCSI (tout mod&egrave;les).

Contr&ocirc;leurs Buslogic MultiMaster :

[ notez que les adaptateurs BusLogic/Mylex "Flashpoint" ne sont
PAS encore support&eacute;s pour l'instant ]

Adaptateurs H&ocirc;tes de s&eacute;rie BusLogic MultiMaster "W" :
    BT-948, BT-958, BT-958D
Adaptateurs H&ocirc;tes de s&eacute;rie BusLogic MultiMaster "C" :
    BT-946C, BT-956C, BT-956CD, BT-445C, BT-747C, BT-757C, BT-757CD, BT-545C,
    BT-540CF
Adaptateurs H&ocirc;tes de s&eacute;rie BusLogic MultiMaster "S" :
    BT-445S, BT-747S, BT-747D, BT-757S, BT-757D, BT-545S, BT-542D, BT-742A,
    BT-542B
Adaptateurs H&ocirc;tes de s&eacute;rie BusLogic MultiMaster "A" :
    BT-742A, BT-542B

Les contr&ocirc;leurs AMI Fastdisk reconnus comme vrais clones de Buslogic
MultiMaster sont aussi support&eacute;s.

Les adaptateurs Bus Buslogic/Bustek BT-640 et Storage Dimensions
SDC3211B, SDC3211F Microchannel (MCA) sont aussi support&eacute;s.

Les contr&ocirc;leurs SCSI/RAID DPT SmartCACHE Plus, SmartCACHE III,
SmartRAID III, SmartCACHE IV et SmartRAID IV SCSI/RAID sont support&eacute;s.

Les contr&ocirc;leurs SCSI RAID DPT SmartRAID V et VI :
    PM1554, PM2554, PM2654, PM2865, PM2754, PM3755, PM3757

Les contr&ocirc;leurs RAID AMI MegaRAID Express et de la famille Enterprise :
    MegaRAID Series 418
    MegaRAID Enterprise 1200 (Series 428)
    MegaRAID Enterprise 1300 (Series 434)
    MegaRAID Enterprise 1400 (Series 438)
    MegaRAID Enterprise 1500 (Series 467)
    MegaRAID Enterprise 1600 (Series 471)
    MegaRAID Elite 1500 (Series 467)
    MegaRAID Elite 1600 (Series 493)
    MegaRAID Express 100 (Series 466WS)
    MegaRAID Express 200 (Series 466)
    MegaRAID Express 300 (Series 490)
    MegaRAID Express 500 (Series 475)
    Dell PERC
    Dell PERC 2/SC
    Dell PERC 2/DC
    Dell PERC 3/DCL
    HP NetRAID-1si
    HP NetRAID-3si
    HP Embedded NetRAID
Le d&eacute;marrage &agrave; partir des ces contr&ocirc;leurs est support&eacute;.

Les contr&ocirc;leurs RAID Mylex DAC960 et DAC1100 utilisant les
micrologiciels (firmware) 2.x, 3.x, 4.x et 5.x :
    DAC960P
    DAC960PD
    DAC960PDU
    DAC960PL
    DAC960PJ
    DAC960PG
    AcceleRAID 150
    AcceleRAID 250
    eXtremeRAID 1100
Le d&eacute;marrage &agrave; partir des ces contr&ocirc;leurs est support&eacute;. Les
adaptateurs EISA ne sont pas support&eacute;s.

Les contr&ocirc;leurs RAID Mylex PCI-SCSI RAID utilisant le micrologiciel
(firmware) 6.x :
    AcceleRAID 160
    AcceleRAID 170
    AcceleRAID 352
    eXtremeRAID 2000
    eXtremeRAID 3000
Les contr&ocirc;leurs compatibles Mylex non list&eacute;s ci-dessus devraient
&eacute;galement fonctionner mais cela n'a pas &eacute;t&eacute; v&eacute;rifi&eacute;.

Les contr&ocirc;leurs ATA RAID 3ware Escalade. Toutes les s&eacute;ries 5000,
6000 et 7000 sont support&eacute;es.

Les contr&ocirc;leurs PCI SCSI SymBios (anciennement NCR) 53C810, 53C810a,
53C815, 53C820, 53C825a, 53C860, 53C875, 53C875j, 53C885, 53C895 et
53C896 :
        ASUS SC-200
        Data Technology DTC3130 (toutes variantes)
	     Diamond FirePort (tous)
        cartes NCR (toutes)
        cartes Symbios (toutes)
        Tekram DC390W, 390U et 390F
        Tyan S1365

Les adaptateurs h&ocirc;tes SCSI PC-card bas&eacute;s sur le NCR 53C500 :
    IO DATA PCSC-DV
    KME KXLC002 (TAXAN ICD-400PN, etc.), KXLC004
    Macnica Miracle SCSI-II mPS110
    Media Intelligent MSC-110, MSC-200
    NEC PC-9801N-J03R
    New Media Corporation BASICS SCSI
    Qlogic Fast SCSI
    RATOC REX-9530, REX-5572 (en SCSI seulement)

Les adaptateurs h&ocirc;tes SCSI ISA/PC-card bas&eacute;s sur les TMC 18C30, 18C50 :
    Future Domain SCSI2GO
    Cartes PCMCIA IBM SCSI
    ICM PSC-2401 SCSI
    Melco IFC-SC
    RATOC REX-5536, REX-5536AM, REX-5536M, REX-9836A

Les contr&ocirc;leurs Qlogic et variantes :
    Adaptateurs h&ocirc;tes SCSI Qlogic 1020, 1040 et Ultra SCSI
    Contr&ocirc;leurs SCSI double Qlogic 1240
    Contr&ocirc;leurs Qlogic 1080 Ultra2 LVD et 1280 Double Ultra2 LVD
    Contr&ocirc;leurs LVD Qlogic 12160 Ultra3
    Contr&ocirc;leurs SCSI Qlogic 2100 et Qlogic 2200 Fibre Channel
    Les variantes de Performance Technology SBS440 ISP1000
    Les variantes de Performance Technology SBS450 ISP1040
    Les variantes de Performance Technology SBS470 ISP2100
    Les variantes de Antares Microsystems P-0033 ISP2100

Les contr&ocirc;leurs SCSI EISA DTC 3290 en mode d'&eacute;mulation 1542.

Les adaptateurs h&ocirc;tes PC-Card SCSI bas&eacute;s sur le Workbit Ninja SCSI-3:
    Alpha-Data AD-PCS201
    IO DATA CBSC16

Avec tous les contr&ocirc;leurs SCSI support&eacute;s, les p&eacute;riph&eacute;riques SCSI-I
& SCSI-II sont int&eacute;gralement support&eacute;s, y compris les disques durs,
les disques optiques, les lecteurs de bandes (ce qui inclus les
DAT et Exabyte 8mm), les changeurs de media, les p&eacute;riph&eacute;riques de
processeurs et les lecteurs CDROM. Les lecteurs WORM supportant
les commandes CDROM sont support&eacute;s avec acc&egrave;s en lecture seule par
le gestionnaire de p&eacute;riph&eacute;riques CDROM. Le support en &eacute;criture des
WORM/CD-R/CD-RW est fournis par cdrecord qui est dans l'arbre des
ports.

Les syst&egrave;mes de type CD-ROM suivants sont actuellement support&eacute;s :
(cd)    Interface SCSI (ce qui inclus les ProAudio Spectrum et
        SoundBlaster SCSI)
(matcd) Matsushita/Panasonic (Creative SoundBlaster) avec interface
        propri&eacute;taire (mod&egrave;les 562/563)
(scd)   Interfaces propri&eacute;taires Sony (tout mod&egrave;les)
(acd)   Interfaces ATAPI IDE

Ci-dessous figurent les gestionnaires de p&eacute;riph&eacute;riques qui &eacute;taient
support&eacute;s par l'ancien sous-syst&egrave;me SCSI mais qui ne SONT PAS encore
support&eacute;s par le nouveau sous-syst&egrave;me CAM SCSI :

  Contr&ocirc;leurs SCSI NCR5380/NCR53400 ("ProAudio Spectrum").

  Contr&ocirc;leurs SCSI UltraStor 14F, 24F et 34F.

  Contr&ocirc;leurs SCSI Seagate ST01/02.

  Contr&ocirc;leurs SCSI Future Domain 8xx/950.

  Contr&ocirc;leurs SCSI WD7000.

  [ Note : Des travaux sont en cours afin de porter le gestionnaire
    de p&eacute;riph&eacute;rique Ultrastor qur la nouvelle plate-forme CAM SCSI,
    mais il n'y a aucune estimation quand &agrave; la date de sa disponibilit&eacute;
    ni m&ecirc;me s'il sera disponible un jour. ]

Gestionnaire de p&eacute;riph&eacute;riques non maintenus, qui peuvent ou non
fonctionner avec votre mat&eacute;riel :

  (mcd)   Interface CD-ROM propri&eacute;taire Mitsumi (tout mod&egrave;les)


2.2. Cartes Ethernet
--------------------

Les cartes Fast Ethernet Adaptec Duralink PCI bas&eacute;es sur les
contr&ocirc;leurs Fast Ethernet Adaptec AIC-6915 ainsi que celles list&eacute;es
ci-dessous :

  ANA-62011 64-bit single port 10/100baseTX
  ANA-62022 64-bit dual port 10/100baseTX
  ANA-62044 64-bit quad port 10/100baseTX
  ANA-69011 32-bit single port 10/100baseTX
  ANA-62020 64-bit single port 100baseFX

Les cartes Allied-Telesis AT1700 et RE2000

Les cartes r&eacute;seau PCI Gigabit Ethernet Alteon Networks bas&eacute;es sur
le jeu de composants Tigon 1 et Tigon 2 ainsi que celles list&eacute;es
ci-dessous :

  3Com 3c985-SX (Tigon 1 et 2)
  Alteon AceNIC 1000baseSX (Tigon 1 et 2)
  Alteon AceNIC 1000baseT (Tigon 2)
  DEC/Compaq EtherWORKS 1000
  Farallon PN9000SX
  NEC Ethernet Gigabit
  Netgear GA620 (Tigon 2)
  Netgear GA620T (Tigon 2, 1000baseT)
  Silicon Graphics Ethernet Gigabit

AMD PCnet/PCI (79c970 et 53c974 ou 79c974)
AMD PCnet/FAST, PCnet/FAST+, PCnet/FAST III, PCnet/PRO,
PCnet/Home et HomePNA.

Les interfaces Ethernet SMC Elite 16 WD8013 et la plupart des clones
WD8003E, WD8003EBT, WD8003W, WD8013W, WD8003S, WD8003SBT et WD8013EBT.
SMC Elite Ultra. SMC Etherpower II.

Les cartes Fast Ethernet Realtek 8129/8139 ainsi que celles list&eacute;es
ci-dessous :
  Allied Telesyn AT2550
  Allied Telesyn AT2500TX
  Genius GF100TXR (RTL8139)
  NDC Communications NE100TX-E
  OvisLink LEF-8129TX
  OvisLink LEF-8139TX
  Netronix Inc. EA-1210 NetEther 10/100
  KTX-9130TX 10/100 Fast Ethernet
  Accton "Cheetah" EN1207D (MPX 5030/5038; clone RealTek 8139)
  SMC EZ Card 10/100 PCI 1211-TX

Les cartes Fast Ethernet PNIC Lite-On 82c168/82c169 dont :
  LinkSys EtherFast LNE100TX
  NetGear FA310-TX Rev. D1
  Matrox FastNIC 10/100
  Kingston KNE110TX

Les cartes r&eacute;seau Fast Ethernet Macronix 98713, 98713A, 98715, 98715A
et 98725 :
  Accton EN1217 (98715A)
  Adico AE310TX (98715A)
  Compex RL100-TX
  CNet Pro120A (98713 ou 98713A)
  CNet Pro120B (98715)
  NDC Communications SFA100A (98713A)
  SVEC PN102TX (98713)

Les cartes r&eacute;seau Fast Ethernet Macronix/Lite-On PNIC II LC82C115 dont
celle ci-dessous :
  LinkSys EtherFast LNE100TX Version 2

Les cartes r&eacute;seau Fast Ethernet Winbond W89C840F dont celle ci-dessous :
  Trendware TE100-PCIE

Les cartes r&eacute;seau Fast Ethernet VIA Technologies VT3043 "Rhine I" et
VT86C100A "Rhine II" dont celles ci-dessous :
  Hawking Technologies PN102TX
  D-Link DFE-530TX
  AOpen/Acer ALN-320

Les cartes r&eacute;seau PCI Fast Ethernet Silicon Integrated Systems SiS
900 et SiS 7016.

Les cartes r&eacute;seau PCI Fast Ethernet Sundance Technologies ST201
donc celle ci-dessous :
  D-Link DFE-550TX

Les cartes r&eacute;seau PCI Ethernet Gigabit SysKonnect SK-984x dont
celles ci-dessous :
  SK-9841 1000baseLX single mode fiber, single port
  SK-9842 1000baseSX multimode fiber, single port
  SK-9843 1000baseLX single mode fiber, dual port
  SK-9844 1000baseSX multimode fiber, dual port

Les cartes r&eacute;seau PCI Texas Instruments ThunderLAN dont celles ci-dessous :
  Compaq Netelligent 10, 10/100, 10/100 Proliant, 10/100 Dual-Port
  Compaq Netelligent 10/100 TX Embedded UTP, 10 T PCI UTP/Coax, 10/100 TX UTP
  Compaq NetFlex 3P, 3P Integrated, 3P w/ BNC
  Olicom OC-2135/2138, OC-2325, OC-2326 10/100 TX UTP
  Racore 8165 10/100baseTX
  Racore 8148 10baseT/100baseTX/100baseFX multi-personality

Les cartes r&eacute;seau PCI Fast Ethernet bas&eacute;es sur ADMtek Inc. AL981
Les cartes r&eacute;seau PCI Fast Ethernet bas&eacute;es sur ADMtek Inc. AN985
Les cartes r&eacute;seau USB Ethernet bas&eacute;es sur ADMtek Inc. AN986 dont :
  LinkSys USB100TX
  Billionton USB100
  Melco Inc. LUA-TX
  D-Link DSB-650TX
  SMC 2202USB

Les cartes r&eacute;seau USB Ethernet bas&eacute;es sur CATC USB-EL1210A dont :
  CATC Netmate
  CATC Netmate II
  Belkin F5U111

Les cartes r&eacute;seau USB Ethernet bas&eacute;es sur Kawasaki LSI KU5KUSB101B dont :
  LinkSys USB10T
  Entrega NET-USB-E45
  Peracom USB Ethernet Adapter
  3Com 3c19250
  ADS Technologies USB-10BT
  ATen UC10T
  Netgear EA101
  D-Link DSB-650
  SMC 2102USB
  SMC 2104USB
  Corega USB-T

Les cartes r&eacute;seau PCI ASIX Electronics AX88140A dont :
  Alfa Inc. GFC2204
  CNet Pro110B

Les cartes r&eacute;seau bas&eacute;es sur DEC DC21040, DC21041 ou DC21140 (SMC Etherpower
8432T, DE245, etc)

Les cartes r&eacute;seau Fast Ethernet bas&eacute;es sur DEC/Intel 21143 dont :
  DEC DE500-BA
  s&eacute;ries Compaq Presario 7900 avec Ethernet int&eacute;gr&eacute;
  D-Link DFE-570TX
  Kingston KNE100TX
  Ethernet int&eacute;gr&eacute; LinkSys EtherFast 10/100 Instant GigaDrive

Les cartes r&eacute;seau PCI Fast Ethernet Davicom DM9100 et DM9102 dont :
  Jaton Corporation XpressNet

Fujitsu MB86960A/MB86965A dont :
  CONTEC C-NET(PC)C Ethernet
  Eiger Labs EPX-10BT
  Fujitsu FMV-J182, FMV-J182A, MBH10302, MBH10303 Ethernet PCMCIA
  Fujitsu Towa LA501 Ethernet
  HITACHI HT-4840-11
  NextCom J Link NC5310
  RATOC REX-5588, REX-9822, REX-4886, REX-R280
  TDK LAK-CD021, LAK-CD021A, LAK-CD021BX

Les cartes HP PC Lan+ (mod&egrave;les num&eacute;ros : 27247B et 27252A).

Intel EtherExpress 16
Intel EtherExpress Pro/10
Intel EtherExpress Pro/100B PCI Fast Ethernet
Intel InBusiness 10/100 PCI Network Adapter
Intel PRO/100+ Management Adapter

Isolan AT 4141-0 (16 bit)
Isolink 4110     (8 bit)

Interfaces Ethernet Novell NE1000, NE2000 et NE2100.

Les cartes r&eacute;seau PCI &eacute;mulant les NE2000 : RealTek 8029, NetVin
5000, Winbond W89C940, Surecom NE-34, VIA VT86C926.

Les cartes 3Com 3C501

3Com 3C503 Etherlink II

3Com 3c505 Etherlink/+

Les cartes 3Com 3C507 Etherlink 16/TP

3Com 3C509, 3C529 (MCA), 3C579,
3C589/589B/589C/589D/589E/XE589ET/574TX/574B (PC-card/PCMCIA),
3C590/592/595/900/905/905B/905C PCI,
3C556/556B MiniPCI,
et EISA (Fast) Etherlink III / (Fast) Etherlink XL

Les cartes serveur 3Com 3c980/3c980B Fast Etherlink XL

Les cartes 3Com 3cSOHO100-TX OfficeConnect

Les cartes r&eacute;seau bas&eacute;es sur Crystal Semiconductor CS89x0 dont :
  IBM Etherjet ISA

Les cartes Ethernet/FastEthernet PC-Card (PCMCIA) compatibles NE2000
dont :
  Les cartes Ethernet AR-P500
  Accton EN2212/EN2216/UE2216(OEM)
  Allied Telesis CentreCOM LA100-PCM_V2
  Cartes 10BaseT AmbiCom
  BayNetworks NETGEAR FA410TXC Fast Ethernet
  CNet BC40
  COREGA Ether PCC-T/EtherII PCC-T/FEther PCC-TXF/PCC-TXD
  Compex Net-A
  CyQ've ELA-010
  D-Link DE-650/660
  Danpex EN-6200P2
  ELECOM Laneed LD-CDL/TX
  IO DATA PCLA/TE, PCET/TX, PCET/TX-R
  IBM Creditcard Ethernet I/II
  IC-CARD Ethernet/IC-CARD+ Ethernet
  Linksys EC2T/PCMPC100, EtherFast 10/100 PC Card (PCMPC100,V2,V3)
  Melco LPC-T/LPC2-T/LPC2-TX/LPC3-TX/LPC3-CLX
  NDC Ethernet Instant-Link
  National Semiconductor InfoMover NE4100
  Cartes Ethernet PC 10BaseT Network Everywhere
  Planex FNW-3600-T
  Socket LP-E
  Surecom EtherPerfect EP-427
  Cartes Ethernet TDK LAK-CD031, Grey Cell GCS2000
  Telecom Device SuperSocket RE450T

PC-Card Ethernet Megahertz X-Jack CC-10BT

Adaptateurs Xircom CreditCard (16bit) et similaires
    Accton EN2226/Fast EtherCard (version 16-bit)
    Compaq Netelligent 10/100 PC Card
    Intel EtherExpress PRO/100 Mobile Adapter (version 16-bit)
    Xircom 10/100 Network PC Card
    carte Xircom Realport + modem (partie Ethernet)
    Xircom CreditCard Ethernet 10/100
    Xircom CreditCard 10Base-T "CreditCard Ethernet Adaptor IIps" (PS-CE2-10)
    Xircom CreditCard Ethernet 10/100 + modem (partie Ethernet)

Les cartes Ethernet National Semiconductor DP8393X (SONIC)
    NEC PC-9801-83, -84, -103 et -104
    NEC PC-9801N-25 et -J02R


2.3. FDDI
---------

Les cartes r&eacute;seau DEC FDDI (DEFPA/DEFEA)


2.4. ATM
--------

   o Interfaces h&ocirc;tes ATM
        - Adaptateurs FORE Systems, Inc. PCA-200E ATM PCI
        - Adaptateurs Efficient Networks, Inc. ENI-155p ATM PCI

   o Les protocoles ATM de transmission de signaux
        - Le protocole de transmission de signaux ATM Forum UNI 3.1
        - Le protocole de transmission de signaux ATM Forum UNI 3.0
        - La d&eacute;claration d'adresses ATM Forum ILMI
        - Le protocole de transmission de signaux propri&eacute;taire de FORE Systems SPANS
        - Les canaux virtuels permanents (PVCs)

   o mod&egrave;les IETF "IP et ARP classiques sous ATM"
        - RFC 1483, "Encapsulation Multiprotocoles sous ATM Couche d'Adaptation 5"
        - RFC 1577, "IP et ARP classiques sous ATM"
        - RFC 1626, "MTU IP par d&eacute;faut pour utilisation sous ATM AAL5"
        - RFC 1755, "Support des transmissions de signaux ATM pour IP sous ATM"
        - RFC 2225, "IP et ARP classiques sous ATM"
        - RFC 2334, "Protocole de synchronisation de serveur de cache (SCSP)"
        - Internet Draft draft-ietf-ion-scsp-atmarp-00.txt,
                "Un service ATMARP distribu&eacute; utilisant SCSP"

   o Interface Sockets ATM


2.5. Divers
-----------

Les cartes s&eacute;rie 4 ports AST utilisant le partage d'IRQ.

Les cartes s&eacute;rie 8 ports ARNET utilisant le partage d'IRQ.
Carte s&eacute;rie haute vitesse ARNET (maintenant Digiboard) Sync 570/i.

Les cartes s&eacute;rie 4-Port Boca BB1004 (Modems NON support&eacute;s)
Les cartes s&eacute;rie 6-Port Boca IOAT66 (Modems support&eacute;s)
Les cartes s&eacute;rie 8-Port Boca BB1008 (Modems NON support&eacute;s)
Les cartes s&eacute;rie 16-Port Boca BB2016 (Modems support&eacute;s)

Carte Comtrol Rocketport.

Carte s&eacute;rie Cyclades Cyclom-y.

Les carte s&eacute;rie STB 4 ports utilisant le partage d'IRQ.

Les cartes s&eacute;rie SDL Communications Riscom/8.
Les cartes s&eacute;rie synchrones haute vitesse SDL Communications
RISCom/N2 et N2pci.

Les cartes s&eacute;rie multiport Stallion : EasyIO, EasyConnection 8/32 &
8/64, ONboard 4/16 et Brumby.

Les cartes/modules d'extension s&eacute;rie Specialix SI/XIO/SX ISA, EISA
et PCI.

Les cartes son Adlib, SoundBlaster, SoundBlaster Pro, ProAudioSpectrum,
Gravis UltraSound et Roland MPU-401. (gestionnaire de p&eacute;riph&eacute;riques snd)

Advance Asound 100, 110 et Logic ALS120
C-Media CMI-8x38
Crystal Semiconductor CS461x/462x/428x
Crystal Semiconductor CS4281
ENSONIQ AudioPCI ES1370/1371
ESS ES1868, ES1869, ES1879 et ES1888
ESS Maestro-1, Maestro-2 et Maestro-2E
ESS Maestro-3/Allegro
ForteMedia fm801
Gravis UltraSound MAX/PnP
MSS/WSS Compatible DSPs
NeoMagic 256AV/ZX
OPTi 931/82C931
SoundBlaster, Soundblaster Pro, Soundblaster AWE-32, Soundblaster AWE-64
Trident 4DWave DX/NX
VIA Technologies VT82C686A
Yamaha DS1 et DS1e
(gestionnaire de p&eacute;riph&eacute;riques newpcm)

Connectix QuickCam
Matrox Meteor Video
Creative Labs Video Spigot
Cortex1
cartes Hauppauge Wincast/TV (PCI)
STB TV PCI
Intel Smart Video Recorder III
Cartes de captures vid&eacute;os bas&eacute;es sur la puce Brooktree Bt848 / Bt878.

Les lecteurs CD-R HP4020, HP6020, Philips CDD2000/CDD2660 et Plasmon.

Les souris PS/2

Joystick PC Standard

Contr&ocirc;leurs X-10 power

GPIB et les gestionnaires de p&eacute;riph&eacute;riques Transputer.

Les scanners &agrave; main Genius et Mustek.

Les cartes reconfigurables bas&eacute;es sur Xilinx XC6200 compatibles
avec HOT1 de Virtual Computers (www.vcc.com)

Support pour le r&eacute;cepteur exp&eacute;rimental Loran-C de Dave Mills.

Cartes r&eacute;seau sans fil Lucent Technologies WaveLAN/IEEE 802.11
PCMCIA et ISA &agrave; vitesse standard (2Mbps) et &agrave; vitesse acc&eacute;l&eacute;r&eacute;e
(6Mbps) et cartes similaires
Les cartes PC LAN sans fil 3COM 3crwe737A AirConnect
Cabletron RoamAbout 802.11 DS
Compaq WL100
Cartes LAN sans fil Corega KK PCC-11, PCCA-11
Cartes sans fil Laneed
ELECOM Air@Hawk/LD-WL11/PCC
Cartes sans fil Farallon Skyline 11Mbps
ICOM SL-1100
Les cartes PC LAN sans fil Intel PRO/Wireless 2011
IO Data WN-B11/PCM
Melco Airconnect WLI-PCM-L11
NCR WaveLAN/IEEE 802.11
Carte sans fil NEC CMZ-RT-WP, PC-WL/11C, PK-WL001
PLANEX GeoWave/GW-NS110
TDK LAK-CD011WL
Note: Les versions ISA de ces cartes sont en fait des cartes PCMCIA
combin&eacute;es avec une carte passerelle ISA vers PCMCIA, donc les deux
p&eacute;riph&eacute;riques fonctionnent avec le m&ecirc;me gestionnaire.

Cartes sans fil 802.11 de s&eacute;ries Aironet 4500/4800. Les cartes PCMCIA,
PCI et ISA sont toutes support&eacute;es.
Cartes sans fil 11Mbps 802.11 de s&eacute;ries Cisco Systems Aironet 340
(inclu les mod&egrave;les 340, 341 et 342)

Les cartes radio Webgear Aviator 2.4GHz.

Toshiba Mobile HDD MEHDD20A (Type II)

Panasonic Flash ATA BN-040ABP3

Hewlett Packard M820e (CD-writer)


3. Obtenir FreeBSD
------------------

Vous pouvez obtenir FreeBSD de plusieurs fa&ccedil;ons :


3.1. FTP/Courrier &eacute;lectronique
------------------------------

Vous pouvez obtenir FreeBSD via FTP ainsi que les diff&eacute;rents packages
optionels sur `ftp.freebsd.org' - le site officiel FreeBSD.

Pour conna&icirc;tre les sites mirroirs FreeBSD veuillez consulter le
fichier MIRROR.SITES. Veuillez obtenir FreeBSD via ftp &agrave; partir du
site mirroir le plus proche de vous. Les nouveaux sites mirroirs
sont toujours bienvenue ! Veuillez contacter freebsd-admin@FreeBSD.org
pour obtenir plus de d&eacute;tails afin de devenir un site mirroir
officiel.

Si vous n'avez pas acc&egrave;s a Internet et que le courrier &eacute;lectronique
est votre seul recours, vous pouvez alors r&eacute;cup&eacute;rer les fichiers
en envoyant un mail a `ftpmail@ftpmail.vix.com' - en utilisant le
mot-clef "help" dans votre message afin d'obtenir plus d'informations
pour r&eacute;cup&eacute;rer les fichiers en utilisant cette m&eacute;thode. Veuillez
toutefois noter que des dizaines de megaoctets seront envoy&eacute;s a
travers le courrier &eacute;lectronique et que donc cette solution doit
&ecirc;tre utilis&eacute;e en DERNIER recours !


3.2. CDROM
----------

Les CDROMS de FreeBSD 4.x-RELEASE peuvent &ecirc;tre command&eacute;s &agrave; :

        BSDi / Walnut Creek CDROM
        4041 Pike Lane, Suite D
        Concord CA  94520
        USA
        +1-800-786-9907, +1-925-674-0783, +1-925-674-0821 (FAX)

Ou via Internet &agrave; orders@cdrom.com ou http://www.cdrom.com.
Leur catalogue actuel peut &ecirc;tre obtenu via ftp &agrave; :

        ftp://ftp.cdrom.com/cdrom/catalog

Le co&ucirc;t par distribution sur CD-ROM est de $39.95 ou $24.95 avec
un abonnement FreeBSD. Les CDs FreeBSD SNAPshot, quand ils sont
disponibles, co&ucirc;tent $39.95 ou $14.95 avec un abonnement FreeBSD-SNAP
(les abonnements -RELEASE et -SNAP sont compl&egrave;tement s&eacute;par&eacute;s). Avec
un abonnement, vous recevrez les mises &agrave; jour automatiquement d&egrave;s
leurs sorties. Votre carte de cr&eacute;dit sera factur&eacute;e lorsque les CDs
vous sont envoy&eacute;s et vous pouvez annuler votre abonnement &agrave; tout
moment sans aucune autre obligation.

Les frais de ports (par commande et non par CD) sont de $5 aux USA,
Canada ou Mexique et de $9.00 ailleurs. Les cartes VISA, Mastercard,
Discover, American Express sont accept&eacute;es ainsi que les ch&egrave;ques en
dollars Am&eacute;ricain et sont envoy&eacute;s COD pour les envois aux USA.
Pour les r&eacute;sidents en Californie, veuillez ajouter les taxes locales
de 8.25%.

Si vous n'&ecirc;tes pas satisfait de votre commande, pour quelque raison
que ce soit, vous pouvez renvoyer les CDs.


4. Mise &agrave; jour de versions pr&eacute;c&eacute;dentes de FreeBSD
-------------------------------------------------

Si vous voulez mettre &agrave; jour votre version ant&eacute;rieure de FreeBSD,
qui est probablement la version 3.0, vous serez peut &ecirc;tre affect&eacute;
par diff&eacute;rents probl&egrave;mes qui d&eacute;pendront bien s&ucirc;r de la m&eacute;thode de
mise &agrave; jour que vous aurez choisi. Il y a deux fa&ccedil;ons habituelles
de mettre &agrave; jour les distributions FreeBSD :

        o Utiliser les sources, via /usr/src
        o Utiliser l'option de mise &agrave; jour (binaire) de sysinstall.

Veuillez consulter le fichier UPGRADE.TXT pour plus d'informations,
de pr&eacute;f&eacute;rence avant de commencer votre mise &agrave; jour.


5. Signaler des probl&egrave;mes, faire des suggestions, soumettre du code.
--------------------------------------------------------------------

Vos suggestions, rapport de bugs et contributions de code sont
toujours les bienvenues - n'h&eacute;sitez pas &agrave; nous signaler tous
probl&egrave;mes que vous pouvez rencontrer (de pr&eacute;f&eacute;rence avec la solution
trouv&eacute;e, si vous pouvez !).

La m&eacute;thode pr&eacute;f&eacute;r&eacute;e pour soumette vos rapports de bugs &agrave; partir
d'une machine poss&eacute;dant un acc&egrave;s au courrier &eacute;lectronique est
d'utiliser la commande send-pr ou d'utiliser le script CGI sur
http://www.freebsd.org/send-pr.html. Les rapports de bugs seront
enregistr&eacute;s par notre cher programme de gestion de bugs et nous
vous assurons que nous ferons tout notre possible pour r&eacute;pondre &agrave;
tous les rapport de bugs d&egrave;s que possible. Les rapports enregistr&eacute;s
sont aussi visibles sur notre site WEB dans la section support et
sont par cons&eacute;quent utiles &agrave; la fois en tant que rapports de bugs
et en tant qu'"avertissements" pour les autres utilisateurs concernant
des probl&egrave;mes potentiels auxquels il faut pr&ecirc;ter attention.

Si, pour certaines raisons, vous ne pouvez pas utiliser la commande
send-pr pour soumettre votre rapport de bug, vous pouvez essayer de
l'envoyer &agrave; :

                freebsd-bugs@FreeBSD.org

Veuillez noter que send-pr est un script shell qui serait facile
&agrave; porter sur un autre syst&egrave;me. Nous vous serions tr&egrave;s reconnaissant
de l'utiliser car cela rend plus facile le suivi du probl&egrave;me
rapport&eacute;. Toutefois, avant de le soumettre, veuillez essayer de
vous assurer que le probl&egrave;me n'a pas &eacute;t&eacute; corrig&eacute; depuis que vous
l'avez decouvert.


D'autre part, pour toutes autres questions ou support technique,
veuillez envoyer un courrier &eacute;lectronique &agrave; :

                freebsd-questions@FreeBSD.org

Si vous suivez attentivement le d&eacute;roulement du d&eacute;velopement de la
version -stable, n'h&eacute;sitez pas &agrave; rejoindre la liste de diffusion
-stable, afin d'&ecirc;tre au courant des derniers changements et nouvelles
qui pourraient affecter l'utilisation et la maintenance de votre
syst&egrave;me :

		freebsd-stable@FreeBSD.org


De plus, &eacute;tant une &eacute;quipe constitu&eacute;e de volontaires, nous somme
toujours heureux d'accueillir de nouveaux b&eacute;n&eacute;voles pr&ecirc;ts &agrave; nous
apporter leur aide - il y a d&eacute;j&agrave; bien trop d'am&eacute;liorations &agrave; apporter
et de projets pour notre &eacute;quipe actuelle ! Pour nous contacter sur
des questions techniques ou afin de nous offrir votre aide, veuillez
envoyer un courrier &eacute;lectronique &agrave; :

                freebsd-hackers@FreeBSD.org


Veuillez noter que ces listes de diffusion peuvent avoir un nombre
*impressionnant* de messages et si vous poss&eacute;dez un acc&egrave;s lent ou
co&ucirc;teux et si vous &ecirc;tes seulement int&eacute;ress&eacute; par les informations
importantes au sujet de FreeBSD, il est peut-&ecirc;tre plus dans votre
int&eacute;r&ecirc;t de vous abonner &agrave; :

                freebsd-announce@FreeBSD.org


Toutes les listes de diffusion sont librement accessibles &agrave; tout
le monde souhaitant s'y inscrire. Veuillez envoyer un courrier
&eacute;lectronique &agrave; l'adresse MajorDomo@FreeBSD.org en incluant le
mot-clef `help' dans le corps de votre message. Vous recevrez plus
d'informations concernant l'abonnement aux divers listes, l'acc&egrave;s
aux archives, etc. Il y a un certain nombre de listes destin&eacute;es &agrave;
diff&eacute;rents groupes sp&eacute;cialis&eacute;s qui ne sont pas mentionn&eacute;es ici,
donc envoyez un courrier &eacute;lectronique &agrave; majordomo pour plus
d'informations !


6. Remerciements
----------------

FreeBSD represente le travail cumul&eacute; de plusieurs centaines, voir
milliers, d'individus de toutes nationalit&eacute;s qui ont travaill&eacute;s
tr&egrave;s dur pour vous apporter cette nouvelle version. Pour une liste
compl&egrave;te des membres du projet FreeBSD, veuillez consulter:

        http://www.freebsd.org/handbook/staff.html

ou, si vous avez t&eacute;l&eacute;charg&eacute; la documentation :

        file:/usr/share/doc/handbook/staff.html

Des remerciements particuliers vont aux milliers d'utilisateurs et
de testeurs de FreeBSD &agrave; travers le monde, sans qui cette nouvelle
distribution n'aurait simplement pas &eacute;t&eacute; possible.

                        Le projet FreeBSD
</pre>

<p></p><a href="../index.html">Page d'accueil des versions</a>
&footer;
</body>
</html>
