freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ac.8
.\"
.\" Copyright (c) 1994 Simon J. Gerraty
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/ac/ac.8,v 1.19 2004/07/02 23:12:39 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd March 15, 1994
.Dt AC 8
.Os
.Sh 名称
.Nm ac
.Nd 接続時間の計測
.Sh 書式
.Nm
.Op Fl dp
.\".Op Fl c Ar console
.Op Fl t Ar tty
.Op Fl w Ar wtmp
.Op Ar users ...
.Sh 解説
.\" Nm ac から ac 削除。
.\" オリジナルで Ac が \&Ac となっていたのは Ac が mdoc コマンド
.\" Angle close quote(see mdoc(7)) であるため
.\" horikawa@jp.freebsd.org 1997/11/03
もしファイル
.Pa /var/log/wtmp
が存在すれば、個々のログイン時刻とログアウト時刻の記録が、各々
.Xr login 1
と
.Xr init 8
によって書き込まれます。
.Nm
ユーティリティはこれらの記録を検査し、ログイン全ての累積接続時間 (時間単位) を
標準出力に書き出します。
.Pp
オプションは次の通りです。
.Bl -tag -width indentXXX
.It Fl d
接続時間を 24 時間単位で表示します。
.\" .It Fl c Ar console
.\" .Ar console
.\" を、ローカル X セッション (ut_host が ":0.0" の場合)
.\" を始めるデバイス名として使います。
.\" .Ar console
.\" 上に記録されたログインはどれも、コンパイル時に COMPAT_SUNOS が
.\" 定義されていない限り、これらの X セッションは無視されます。
.It Fl p
各々のユーザの合計を表示します。
.It Fl t Ar tty
特定の tty からのログインだけを計測します。
.Ar tty
が '!' で始まっている場合はそれ以外の tty
を示し、'*' で終っている場合は、同様な全ての tty を示します。
複数の
.Fl t
フラグを指定しても構いません。
.It Fl w Ar wtmp
接続時間のデータを、デフォルトファイル
.Pa /var/log/wtmp
の代りに
.Ar wtmp
から読み込みます。
.It Ar users ...
与えられたユーザの合計だけを表示します。
.El
.Pp
もし、引数が与えられなければ、
.Nm
はログインセッションが
.Pa wtmp
に記録された全てのアカウントの合計接続時間を表示します。
.Pp
デフォルトの
.Pa wtmp
ファイルは、切り捨て (truncate) をしない限り、際限なく増加します。
これは通常、
.Xr cron 8
によって起動されるデイリースクリプトによって切り捨てが行われます。
デイリースクリプトは
.Pa wtmp
ファイルの改名と巡回 (rotate) を行い、
一週間分のデータを手元に保持します。
.Pa /var/log/wtmp
が存在しなければ、ログインや接続時間の計測は行われません。
.Pp
例えば
.Bd -literal -offset
ac -p -t "ttyd*" > modems
ac -p -t "!ttyd*" > other
.Ed
.Pp
とすると、
.Pa modems
に記録された時間と、
.Pa other
のそれで、別の料金を請求することもできます。
.Sh 診断
.Ex -std
.Sh 関連ファイル
.Bl -tag -width /var/log/wtmp -compact
.It Pa /var/log/wtmp
接続時間アカウントファイル
.El
.Sh 関連項目
.Xr login 1 ,
.Xr utmp 5 ,
.Xr init 8 ,
.Xr sa 8
.\" .Sh 注
.\" もし COMPAT_SUNOS が定義されていると
.\" .Nm ac
.\" は ut_host が ":0.0" のエントリが本当のログインセッションではない
.\" という事実を無視します。
.\" 通常はこのようなエントリは、
.\" .Pa wtmp
.\" ファイルが巡回されたときにログインしているユーザの場合を除いて
.\" 無視されます。
.\" この場合、ut_host が ":0.0" のログインが、
.\" それ以前にコンソールへのログインがないのに現われるかもしれません。
.\" もし誰もコンソールにログインしていなければ、そのユーザは
.\" .Pa wtmp
.\" のもっとも早いタイムスタンプの時に既にログインしていたと思われます。
.\" .Pa console
.\" を使うことで、
.\" .Nm ac
.\" はユーザのログアウトを識別し、正しく処理できるようになります。
.\" .Pa console
.\" のデフォルト値はコンパイル時の正しい値です。
