freebsd/freebsd-doc/ja_JP.eucJP/man/man8/accton.8
.\" %FreeBSD: src/usr.sbin/accton/accton.8,v 1.6 1999/08/28 23:20:35 mpp Exp %
.\"
.\" Original Revision: 1.5
.\" jpman %Id: accton.8,v 1.3 1997/07/27 12:02:03 horikawa Stab %
.Dd May 21, 1993
.Dt ACCTON 8
.Os
.Sh 名称
.Nm accton
.Nd システムのアカウンティングの許可/禁止
.Sh 書式
.Nm accton
.Op Ar acctfile
.Sh 解説
.Nm
コマンドはシステムのアカウンティングのオン/オフを切り換えます。
もし
.Ar acctfile
引数を付けて呼び出された場合、
システムのアカウンティングが許可されます。
.Xr execve 2
システムコールで開始され、その後システムを終了した
全てのプロセスの記録が
.Ar acctfile
ファイルに格納されます。
.Xr sa 8
コマンドがアカウンティング記録の検査に使われるかもしれません。
もし引数が与えられなかった場合、システムアカウンティングは禁止されます。
.Sh 関連ファイル
.Bl -tag -width /var/account/acct
.It Pa /var/account/acct
デフォルトのアカウンティングファイル
.El
.Sh 関連項目
.Xr lastcomm 1 ,
.Xr acct 2 ,
.Xr sa 8
