freebsd/freebsd-doc/ja_JP.eucJP/man/man8/adding_user.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)adduser.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man8/adding_user.8,v 1.3 1999/08/28 00:21:00 peter Exp %
.\" jpman %Id: adding_user.8,v 1.3 1997/07/22 16:44:29 horikawa Stab %
.\"
.Dd June 5, 1993
.Dt ADDING_USER 8
.Os BSD 4
.Sh 名称
.Nm adding_user
.Nd 新規ユーザ登録のためのプロシージャ
.Sh 解説
新規ユーザはログイン名を選ばなければなりません。
ここで、ログイン名は既に
.Pa /etc/passwd
や
.Pa /etc/aliases 
に登録されているものであってはいけません。
また、ハイフン
.Ql Fl
文字で始まるものも使えません。
メーラを混乱させないためにも、全ての文字は英小文字でドット
.Ql \&.
文字を含まないことが、強く推奨されています。
アカウントは、パスワードファイルを一行編集することで加えることが
できます。これを行う時は、パスワードファイルはロックされていなければ
なりません。このロックは、
.Xr chpass 1
や
.Xr vipw 8 
を使うことで可能です。
.Pp
新規ユーザには、グループとユーザ id を与えます。
ログイン名とユーザ id は、システム全体やしばしばシステムグループで
一意でなければなりません。これは、ファイルのアクセスを制御するために
使われるからです。
典型的には、似たようなプロジェクトで働いているユーザは同じグループに
入ります。
University of California の Berkley 校では、システムスタッフ・
学部・大学院・大きなプロジェクトのための特別なプロジェクトのグループが
あります。
.Pp
新規ユーザ
\*(lqernie\*(rq
のための骨格となるアカウントは、以下のようになります。
.Bd -literal
ernie::25:30::0:0:Ernie Kovacs,508 Evans Hall,x7925,
	642-8202:/a/users/ernie:/bin/csh
.Ed
.Pp
個々のフィールドの解説は、
.Xr passwd 5 
を参照してください。
.Pp
新規ユーザに始めるにあたっていくつかの助けを与えることは良いことです。
このために、いくつかの骨格となるファイルを与えてあげれます。
.Pa /bin/sh 
ユーザには、
.Pa \&.profile
を、
.Pa /bin/csh 
ユーザには、
.Pa \&.cshrc
や
.Pa \&.login
を与えれば良いでしょう。
.Pa /usr/share/skel
ディレクトリに、そのようなファイルの骨格の定義を置いておけます。
新規ユーザは、これらのファイルの複製を与えられます。
ここで、例えば
.Xr tset 1
をログインする度に自動的に実行するように設定できます。
.Sh 関連ファイル
.Bl -tag -width /etc/master.passwdxx -compact
.It Pa /etc/master.passwd
ユーザデータベース
.It Pa /usr/share/skel
ログインディレクトリのための骨格データ
.El
.Sh 関連項目
.Xr chpass 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr aliases 5 ,
.Xr passwd 5 ,
.Xr adduser 8 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Sh バグ
ユーザ情報は (段々とそうなってきていますが)、別のところに
記憶するべきです。
.Sh 歴史
.Nm
手続きは
.Bx 3.0 
から導入されました．
