freebsd/freebsd-doc/ja_JP.eucJP/man/man8/adduser.8
.\" Copyright (c) 1995-1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\" Copyright (c) 2002 Michael Telahun Makonnen <makonnen@pacbell.net>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/adduser/adduser.8,v 1.50 2003/06/20 19:23:55 mtm Exp %
.\" $FreeBSD$
.\"
.Dd August 14, 2002
.Dt ADDUSER 8
.Os
.Sh 名称
.Nm adduser
.Nd 新しいユーザを加えるためのコマンド
.Sh 書式
.Nm
.Op Fl CENhq
.Op Fl G Ar groups
.Op Fl L Ar login_class
.Op Fl d Ar partition
.Op Fl f Ar file
.Op Fl g Ar login_group
.Op Fl k Ar dotdir
.Op Fl m Ar message_file
.Op Fl s Ar shell
.Op Fl u Ar uid_start
.Op Fl w Ar type
.Sh 解説
.Nm
ユーティリティは新しいユーザを加えるための、
.Xr pw 8
コマンドを利用して実装されたシェルスクリプトです。
パスワード, グループ, シェル等のデータベースをチェックし、
passwd/group の登録を行い、
ホーム
ディレクトリとドットファイルを作成し、
新しいユーザに歓迎メッセージを送ります。
2 つの動作モードをサポートします。
すなわち、
1 度に 1 人ずつのユーザを追加するコマンドラインでの対話モードと、
新規ユーザのリストをファイルで与えてユーザの介在無しに
動作するバッチモードです。
.Sh 制限事項
.Bl -tag -width indent
.It username
ログイン名です。
.Xr pw 8
が受け付けるログイン名に制限されます。
一般に、英小文字と数字のみ使用可能です。
長さは 16 文字までです。
この制限の理由は、歴史的な物です。
美的な理由からこの制限を破りたいとする人々はいつもいましたが、
.Ux
における基本的なパラメータを変更するほどの重要な理由ではありま
せんでした。
.Pa /usr/include/utmp.h
ファイル内の
.Dv UT_NAMESIZE
パラメータを変更し、全てを再コンパイルすることで、変更できますが、
コンパイル済みのプログラムや名前の 8 文字制限を前提としたソースコード、
そして NIS については、問題が起こるでしょう。 NIS のプロトコルは、
ユーザ名を 8 文字と定めています。電子メールアドレスとして、もっと長い
ログイン名を必要とする場合には、別名を
.Pa /etc/mail/aliases
ファイルに定義することができます。
.It "full name"
典型的には gecos フィールドとして知られ、
通常はユーザの完全な名前を格納します。
さらに、コンマで区切った値のリスト、
例えば職場の番号や職場と家の電話番号を格納可能です。
名前にアンパサンドが含まれる場合、
他のプログラムが表示するときに、
これを先頭を大文字にしたログイン名で置き換えます。
.Ql \&:
(コロン) は、使えません。
.It shell
シェルデータベースに定義されている有効なシェル
.Pq Pa /etc/shells
だけが有効です。
さらに、シェルのベース名だけが必要であり、フルパスは必要ではありません。
.It UID
自動生成されますが、自分で指定することもできます。
ただし、32000 よりも小さい数字でなければなりません。
.It "GID/login group"
自動生成されますが、自分で指定することもできます。
ただし、32000 よりも小さい数字でなければなりません。
.It password
空のパスワード、パスワード無効化、ランダム生成パスワード、
素のテキストで指定するパスワードのいずれかを選択可能です。
パスワードは
.Xr crypt 3
を利用して暗号化されます。
.El
.Sh 一意なグループ
ひょっとして、あなたは、この方法ではできても他のほとんどの方法ではう
まく行かないことがあるのを見逃しているかもしれません。個々のユーザを
そのユーザ独自のグループに入れることで、
通常の 022 の代りに umask を 002 としておいても
安全になり、ホームディレクトリにファイルを作っても、他の人にファイル
を読まれる心配がなくなります。
.Pp
共有場所を作るためには、 (freefall における cvs や ncvs のように)
UID/GID を別に設けて、ユーザを個別にその新しいグループに入れることで、
その場所へのアクセスを可能とすべきです。
.Pp
この uid/gid の管理モデルは、たくさんのユーザをグループにまとめるよ
り柔軟性があり、共有場所で仕事をする時に umask をいじり回さずにすみ
ます。
.Pp
この方法をほぼ 10 年間使っていますが、ほとんどの場合に使えることがわ
かり、じゃまになったことはありませんでした。 (Rod Grimes)
.Sh 設定
.Nm
ユーティリティは設定情報を
.Pa /etc/adduser.conf
から読み取ります。
このファイルが存在しない場合、規定のデフォルトを使用します。
このファイルは手で編集可能ですが、
.Fl C
コマンドライン引数を使用する方が安全です。
この引数を使用すると、
.Nm
は対話的入力を開始し、問い合わせに対する回答を
.Pa /etc/adduser.conf
に保存し、ユーザデータベースを変更せずに確認しつつ終了します。
コマンドラインで指定したオプションは、このファイルに保存したものに優先します。
.Sh オプション
.Bl -tag -width indent
.It Fl C
新規設定ファイルを作成して終了します。
このオプションは
.Fl f
と排他です。
.It Fl d Ar partition
ホームパーティション。
ユーザディレクトリを見付けるデフォルトパーティションです。
.It Fl E
アカウントを無効化します。
このオプションは、文字列
.Dq Li *LOCKED*
をパスワードフィールドの前に付けることで、アカウントをロックします。
アカウントのアンロックは、スーパユーザが次の
.Xr pw 8
コマンドコマンドを使用して行います:
.Pp
.D1 Nm pw Cm unlock Op Ar name | uid
.It Fl f Ar file
生成するアカウントのリストを
.Ar file
から得ます。
.Ar file
が
.Dq Fl
の場合、リストを標準入力から得ます。
このオプションが指定された場合、
.Nm
はバッチモードで動作し、ユーザ入力を求めません。
あるアカウント処理中にエラーが発生した場合、
メッセージを標準エラーに書き込み、次のアカウントに取り組みます。
入力ファイルの書式は後述します。
.It Fl g Ar login_group
通常は、ログイングループが指定されない場合、
ユーザ名と同じであると仮定されます。
このオプションは、
.Ar login_group
をデフォルトとします。
.It Fl G Ar groups
追加グループ。
このオプションは、ユーザに付与する追加グループを指定します。
ユーザは、ログイングループに加え、これらのグループのメンバです。
.It Fl h
オプションの要約を表示して、終了します。
.It Fl k Ar directory
.Ar directory
のファイルを新規ユーザのホームディレクトリへコピーします。
.Pa dot.foo
は
.Pa .foo
にリネームされます。
.It Fl L Ar login_class
デフォルトログインクラスを設定します。
.It Fl m Ar file
.Ar file
の歓迎メッセージを送ります。
.Ar file
に
.Cm no
を指定すると、新規ユーザへメッセージを送りません。
メッセージファイルが
.Nm
スクリプトの内部変数を参照可能であることに注意してください。
.It Fl N
デフォルト設定ファイルを読み取りません。
.It Fl q
最小のユーザフィードバック。
特に、ランダムパスワードは標準出力にエコーされません。
.It Fl s Ar shell
新規ユーザのデフォルトシェル。
.Ar shell
引数は、シェルのベース名であることが必要であり、フルパスであっては
.Em なりません
。
シェルが正当なシェルであるとみなされるためには、
.Pa /etc/shells
に含まれるか、特殊シェル
.Em nologin
であることが必要です。
.It Fl u Ar uid
.Ar uid
から開始する UID を使用します。
.It Fl w Ar type
パスワードタイプ。
どのようなタイプのパスワードを生成するかを、
.Nm
ユーティリティはユーザに許しています。
.Ar type
引数は以下の値のうちのいずれかです:
.Bl -tag -width ".Cm random"
.It Cm no
パスワードの無効化。
暗号化文字列の代りに、パスワードフィールドは単一の
.Ql *
文字になります。
スーパユーザが手動でパスワードを有効化するまで、ユーザはログインできません。
.It Cm none
空文字列をパスワードとして使用します。
.It Cm yes
ユーザが提供した文字列をパスワードとして利用します。
対話モードでは、ユーザはパスワード入力を求められます。
バッチモードでは、最後 (10 番目) のフィールドがパスワードだとみなされます。
.It Cm random
ランダム文字列を生成し、これをパスワードとします。
パスワードは標準出力へエコーされます。
さらに、
.Va randompass
変数を介して、ファイルへ含めることが可能です。
.El
.El
.Sh フォーマット
.Fl f
オプション使用時には、アカウント情報は特定の書式で格納する必要があります。
空行または
.Ql #
で開始する行は無視されます。
他のすべての行は、コロン
.Pq Ql \&:
で区切られた 10 個のフィールド (後述) から成ります。
コマンドラインオプションは、これらの値に優先しません。
パスワードフィールドのみが、
.Ql \&:
文字を文字列の一部として持つことができます。
.Pp
.Sm off
.D1 Ar name : uid : gid : class : change : expire : gecos : home_dir : shell : password
.Sm on
.Bl -tag -width ".Ar password"
.It Ar name
ログイン名。
このフィールドは空であってはなりません。
.It Ar uid
数値のログインユーザ ID。
このフィールドが空の場合、自動生成されます。
.It Ar gid
数値のプライマリグループ ID。
このフィールドが空の場合、ユーザ名と同じ名前のグループが生成され、
その GID が使用されます。
.It Ar class
ログインクラス。
このフィールドは空であっても構いません。
.It Ar change
パスワードエージング。
このアカウントのパスワードを変更する日付を表現します。
このフィールドの書式は、
.Xr pw 8
への
.Fl p
引数のものと同じです。
これは
.Ar dd Ns - Ns Ar mmm Ns - Ns Ar yy Ns Op Ar yy
であり、
.Ar dd
は日、
.Ar mmm
は数値またはアルファベットの月で
.Dq Li 10
や
.Dq Li Oct
、
.Ar yy Ns Op Ar yy
は 4 桁または 2 桁の年です。
現在の日付からの相対で時を指定したい場合、次の書式を使用します:
.No + Ns Ar n Ns Op Ar mhdwoy
。
ここで、
.Ar n
は数値であり、この後に分・時間・日・週・月・年を続け、
これらけの期間が経過したらパスワードが変更されねばならないことを示します。
このフィールドを空にすることで、この機能をオフにできます。
.It Ar expire
アカウントの満了。
このフィールドは、アカウントの満了日を表現します。
指定した日付より後にはアカウントは使用できません。
このフィールドの書式は、パスワードエージングのものと同じです。
このフィールドを空にすることで、この機能をオフにできます。
.It Ar gecos
ユーザの完全な名前と追加情報。
.It Ar home_dir
ホームディレクトリ。
このフィールドが空の場合、
ホームパーティションにユーザ名を追加することで自動生成されます。
.It Ar shell
ログインシェル。
このフィールドは、有効なログインシェルのフルパスを含むことが必要です。
.It Ar password
ユーザパスワード。
このフィールドは素のテキスト文字列を含み、
ユーザデータベースに置かれる前に暗号化されます。
パスワードタイプが
.Cm yes
であり、このフィールドが空の場合、
このアカウントは空のパスワードになるものとみなされます。
パスワードタイプが
.Cm random
でありこのフィールドが空では
.Em ない
場合、この内容がパスワードとして使用されます。
.Fl p
オプションが引数
.Cm no
または
.Cm none
と共に使用された場合、このフィールドは無視されます。
このフィールドを
.Ql \&:
で終端させないように。
これはパスワードの一部とみなされてしまいます。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa /etc/adduser.message" -compact
.It Pa /etc/master.passwd
ユーザのデータベース
.It Pa /etc/group
グループのデータベース
.It Pa /etc/shells
シェルデータベース
.It Pa /etc/login.conf
ログインクラスデータベース
.It Pa /etc/adduser.conf
.Nm
用の設定ファイル
.It Pa /etc/adduser.message
.Nm
用のメッセージファイル
.It Pa /usr/share/skel
ログインディレクトリの雛型
.It Pa /var/log/adduser
.Nm
のログ記録ファイル
.El
.Sh 関連項目
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr aliases 5 ,
.Xr group 5 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr shells 5 ,
.Xr pw 8 ,
.Xr pwd_mkdb 8 ,
.Xr rmuser 8 ,
.Xr vipw 8 ,
.Xr yp 8
.Sh 歴史
.Nm
ユーティリティは
.Fx 2.1
から導入されました．
.Sh 作者
.An -nosplit
マニュアルページと Perl による元のスクリプトは
.An Wolfram Schneider Aq wosch@FreeBSD.org
が書きました。
追加機能を持つ、Bourne シェルスクリプトで書かれた置き換えスクリプトと、
これに伴なうマニュアルページの更新を
.An Mike Makonnen Aq mtm@identd.net
が行いました。
.Sh バグ
.Va $username
や
.Va $randompass
といった変数を新規ユーザへ送るメッセージ中で
.Nm
が正しく展開できるために、
メッセージファイルの各行をシェルで評価する必要があります。
これは、メッセージファイル中にシェルコマンドを格納可能であることを意味します。
.Nm
ユーティリティは、攻撃者がこの機能を使用する可能性を柔らげるために、
root ユーザ所有の root ユーザのみが書き込み可能なファイル以外を評価する
ことを拒否します。
さらに、シェル特殊文字やオペレータは、
メッセージファイルで使用する場合、エスケープする必要があります。
.Pp
また、パスワードエージングとアカウント満了時は、
現在のところバッチモードでのみ設定可能です。
対話モードでもユーザが設定可能となるべきです。
