freebsd/freebsd-doc/ja_JP.eucJP/man/man8/adduser.8
.\" Copyright (c) 1995-1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %Id: adduser.8,v 1.12.2.8 1998/03/18 16:14:48 hoek Exp %
.\" jpman %Id: adduser.8,v 1.4 1997/08/07 17:53:51 ken Stab %
.\"
.Dd January 9, 1995
.Dt ADDUSER 8
.Os FreeBSD 2.1
.Sh 名称
.Nm adduser
.Nd 新しいユーザを加えるためのコマンド
.Sh 解説
.Nm adduser
.Oo
.Fl batch Ar username
.Op Ar group Ns , Ns Op Ar group,...
.Op Ar class
.Op Ar fullname 
.Op Ar password 
.Oc
.br
.Op Fl check_only
.br
.Op Fl class Ar login_class
.br
.Op Fl config_create
.br
.Op Fl dotdir Ar dotdir
.br
.Op Fl group Ar login_group
.br
.Op Fl h | help
.br
.Op Fl home Ar home
.br
.Op Fl message Ar message_file
.br
.Op Fl noconfig
.br
.Op Fl shell Ar shell
.br
.Op Fl s | silent | q | quiet
.br
.Op Fl uid Ar uid_start
.br
.Op Fl v | verbose
.Sh 解説
.Nm 
は新しいユーザを加えるための簡単なプログラムです。
.Nm
はパスワード, グループ, シェル等のデータベースをチェックし、 
passwd/group の登録を行い、
.Ev HOME
ディレクトリとドットファイルを作成し、
新しいユーザに歓迎メッセージを送ります。
.Sh 制限事項
.Bl -tag -width Ds -compact
.It Sy username
ログイン名は、小文字もしくは数字だけからなる最大 8 文字の文字列でな
ければなりません (
.Xr setlogin 2
のバグの章を参照してください)。この制限の理由は、 ``歴史的な'' 物で
す。美的な理由からこの制限を破りたいとする人々はいつもいましたが、 
UNIX における基本的なパラメータを変更するほどの重要な理由ではありま
せんでした。
.Pa /usr/include/utmp.h
ファイル内の
.Dv UT_NAMESIZE 
パラメータを変更し、全てを再コンパイルすることで、変更できますが、コ
ンパイル済みのプログラムや名前の8文字制限を前提としたソースコード、
そして NIS については、問題が起こるでしょう。 NIS のプロトコルは、ユー
ザ名を 8 文字と定めています。電子メールアドレスとして、もっと長いロ
グイン名を必要とする場合には、別名を
.Pa /etc/aliases
ファイルに定義することができます。
.It Sy fullname
姓と名です。
.Ql Pa \:
(コロン) は、使えません。
.It Sy shell
シェルデータベースに定義されている有効なシェル、もしくは、 sliplogin 
と pppd だけが有効です。
.It Sy uid
自動生成されますが、自分で指定することもできます。ただし、 32000 よ
りも小さい数字でなければなりません。
.It Sy gid/login group
あなたが指定したものです。さもなければ、自動的に生成されます。
.It Sy password
定義した時には、パスワードは
.Xr crypt 3
を利用して暗号化されます。
.El
.Sh 一意なグループ
ひょっとして、あなたは、この方法ではできても他のほとんどの方法ではう
まく行かないことがあるのを見逃しているかもしれません。個々のユーザを
そのユーザ独自のグループに入れることで、 umask を 002 としておいても
安全になり、ホームディレクトリにファイルを作っても、他の人にファイル
を読まれる心配がなくなります。
.Pp
共有場所を作るためには、 (freefall における cvs や ncvs のように) 
uid/gid を別に設けて、ユーザを個別にその新しいグループに入れることで、
その場所へのアクセスを可能とすべきです。
.Pp
この uid/gid の管理モデルは、たくさんのユーザをグループにまとめるよ
り柔軟性があり、共有場所で仕事をする時に umask をいじり回さずにすみ
ます。
.Pp
この方法をほぼ 10 年間使っていますが、ほとんどの場合に使えることがわ
かり、じゃまになったことはありませんでした。 (Rod Grimes)
.Sh 設定
.Bl -enum
.It
内部変数を読込みます。
.It
設定ファイル (/etc/adduser.conf) を読込みます。
.It
コマンドラインオプションを解析します。
.El
.Sh オプション
.Bl -tag -width Ds
.It Sy -batch username [group[,group]...] [class] [fullname] [password]
バッチモードです。
列挙されるグループは、ユーザがメンバとなる二番目のグループであり、
デフォルトのログイングループ以外のものを書きます。
ヌル文字列の引数を埋め草として使用することができ、
この場合デフォルト値の動作となります。
.It Sy -check_only
/etc/passwd, /etc/group, /etc/shells をチェックし、終了します。
.It Sy -class Ar login_class
デフォルトのログインクラスを設定します。
.It Sy -config_create
新しい設定を設定ファイルに書込み、メッセージファイルを作成して、
終了します。
.It Sy -dotdir Ar directory
ファイルを
.Ar directory 
から、新しいユーザの
.Ev HOME
ディレクトリへコピーします。
.Ql Pa dot.foo
というファイルは、
.Ql Pa .foo
という名前に変更されます。
.Ar directory 
として
.Ar no 
が指定された場合には、コピーを行いません。セキュリティ的な理由から全
てのファイルはオーナに対して読み書き可能となり、グループや他の人達に
対しては書込み可能にはなりません。また、以下のファイルは、オーナに
対してのみ読み書き実行可能となります。
.Pa .rhost , 
.Pa .Xauthority , 
.Pa .kermrc , 
.Pa .netrc , 
.Pa Mail ,
.Pa prv , 
.Pa iscreen , 
.Pa term 
.It Sy -group Ar login_group
ログイングループの指定です。
.Ar USER
はユーザ名がログイングループとして使用されることを意味します。
.It Sy -help,-h,-?
オプションの要約を表示して、終了します。
.It Sy -home Ar partition
全てのユーザがホームディレクトリを持つデフォルトのディレクトリ (home
partition) を指定します。
.It Sy -message Ar file
新しいユーザに
.Ar file
の歓迎メッセージを送ります。
.Ar file
が
.Ar no 
であった時にはメッセージは送りません。
.It Sy -noconfig
デフォルトの設定ファイルを読みません。
.It Sy -shell Ar shell 
新しいユーザに対するデフォルトのシェルを指定します。
.It Sy -silent,-s,-quiet,-q
警告や質問、バグの報告を少ししか行いません。
.It Sy -uid Ar uid
ユーザ id を
.Ar uid
かそれ以上にします。
.It Sy -verbose,-v
警告と質問をたくさん行います。初心者ユーザにはおすすめです。
.Sh フォーマット
.Bl -tag -width Ds -compact
.Ql Pa #
はコメントです。
.It Sy 設定ファイル
.Nm 
はこのファイルを読み書きします。
より詳しくは、
.Pa /etc/adduser.conf
を見てください。
.It Sy メッセージファイル
このファイル内では変数は評価されます。
より詳しくは、
.Pa /etc/adduser.message
を見てください。
.El
.Sh 使用例
.Pp
$ adduser
.Pp
adduser を会話モードで動かします。
.Pp
$ adduser -batch baerenkl guest,staff,baer '' 'Teddy II' qwerty7
.Pp
ユーザ名 'baerenkl' ログイングループ名 'baerenkl' のユーザを作成
します。このユーザは、 guest, staff, baer グループにも入っています。
デフォルトのログインクラスを用います。
このユーザーの本名 (氏名) は 'Teddy II' であり、パスワードは 'qwerty7' 
です (が、こんなパスワードを使ってはいけません !)。
.Ev HOME
ディレクトリは、
.Pa /home/baerenkl
に作られ、全てのファイルやディレクトリが、
.Pa /usr/share/skel
から、
.Pa /home/baerenkl
にコピーされます。ユーザ 'baerenklau' に対して、歓迎メッセージが送ら
れます。
.Pp
$ adduser -uid 5000 -group guest -message no -batch vehlefan
.Pp
ユーザ 'vehlefan' を作成します。ログイングループは guest で ユーザ 
id は 5000 以上で利用可能な最小のもの (例えば、5007など) となります。
他に入っているグループはなく、本名もパスワードもありません。歓迎
メッセージも送られません。
.Sh 関連ファイル
.Bl -tag -width /etc/master.passwdxx -compact
.It Pa /etc/master.passwd
ユーザのデータベース
.It Pa /etc/group
グループのデータベース
.It Pa /etc/shells
シェルデータベース
.It Pa /etc/login.conf
ログインクラスデータベース
.It Pa /etc/adduser.conf
adduser 用の設定ファイル
.It Pa /etc/adduser.message
adduser 用のメッセージファイル
.It Pa /usr/share/skel
ログインディレクトリの雛型
.It Pa /var/log/adduser
adduser の ログ記録ファイル
.El
.Sh 関連項目
.Xr chpass 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr setlogin 2 ,
.Xr yp 4 ,
.Xr aliases 5 ,
.Xr group 5 ,
.Xr login.conf 5 ,
.Xr passwd 5 ,
.Xr shells 5 ,
.Xr addgroup 8 ,
.Xr pwd_mkdb 8 ,
.Xr rmgroup 8 ,
.Xr rmuser 8 ,
.Xr vipw 8
.\" .Sh バグ
.Sh 歴史
.Nm
コマンドは
.Fx 2.1 
から導入されました．
