freebsd/freebsd-doc/ja_JP.eucJP/man/man8/amq.8
.\"
.\" Copyright (c) 1997-1998 Erez Zadok
.\" Copyright (c) 1990 Jan-Simon Pendry
.\" Copyright (c) 1990 Imperial College of Science, Technology & Medicine
.\" Copyright (c) 1990 The Regents of the University of California.
.\" All rights reserved.
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Jan-Simon Pendry at Imperial College, London.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%W% (Berkeley) %G%
.\"
.\" %Id: amq.8,v 1.3 1998/09/12 04:04:57 obrien Exp %
.\"
.\" jpman %Id: amq.8,v 1.3 1997/08/11 14:26:54 horikawa Stab %
.\"
.Dd March 16, 1991
.Dt AMQ 8
.Os
.Sh 名称
.Nm amq
.Nd 自動マウントシステムへの問い合わせツール
.Sh 書式
.Nm amq
.Op Fl fmpsuvTU
.Op Fl h Ar hostname
.Op Fl l Ar log_file
.Op Fl x Ar log_options
.Op Fl D Ar debug_options
.Op Fl M Ar mountmap_entry
.Op Fl P Ar program_number
.Op Ar directory ...
.Pp
.Sh 解説
.Nm amq
は、現在の
.Xr amd 8
の動作状況を知るための簡単な手段を提供します。
.Nm amd
との通信は
.Tn RPC
によって行われます。現在のプロトコルでは、 3 つのモード
がサポートされています。デフォルトでは、マウントポイントと自動
マウントされたファイルシステムのリストが出力されます。
別のホストの状態を知るときは、
.Fl h
オプションで
.Ar hostname
を指定します。
.Pp
ディレクトリ名が与えられると、デフォルトの出力ではファイルシステム
ごとの情報が表示されます。
.Sh オプション
.Bl -tag -width flag
.It Fl f
自動マウントシステムに内部キャッシュを破棄するように要求します。
.It Fl h  Ar hostname
.Ar hostname
で指定されたホストに問い合わせを行います。デ
フォルトでは、ローカルホストが使われます。
.Tn HP-UX
クラスタでは、デフォルトでルートサーバに問い合わせが行わ
れます。これは通常、自動マウントシステムがルートサーバで動
いているからです。
.It Fl l Ar log_file
.Nm amd
に対し、
.Ar log_file
をログファイル名として使用するように指示します。
セキュリティのために、これは
.Nm amd
が起動したときと同じログファイルである必要があります。
それゆえ本オプションが有効なのは、
日々の cron ジョブによってログファイルがローテートおよび圧縮するために、
.Nm amd
のファイルハンドルをリフレッシュするときに限られます。
.It Fl m
マウントされたファイルシステムのリストを、
各ファイルシステムへの参照回数と
マウント時に起きたエラーを含めて表示するように、自動マウント
システムに要求します。
.It Fl p
リモートもしくはローカルに実行されている
.Nm amd
のプロセス ID を返します。
ローカルの
.Nm amd
プロセスにシグナルを送る必要があるときに便利であり、
プロセステーブルを探さなくて済みます。
本オプションは
.Pa ctl-amd
スクリプトの中で使用されています。
.It Fl s
自動マウントシステムに、システムの統計情報を表示するように要求します。
.It Fl u
情報を表示する代わりに、
指定したファイルシステムをアンマウントするよう
自動マウントシステムに要求します。この要求によって、
必ずアンマウントが実行されるわけではありません。
単にそのファイルシステムのマウントが、
タイムアウトするにすぎません。
タイムアウトは
.Nm amd
のメインスケジューラに検出され、結果として
普通にタイムアウトしたときと同じことが行われます。
.It Fl v
自動マウントシステムに、バージョン情報を提供するように要求します。これは、
.Nm amd
の
.Fl v
オプションで得られる情報の一部です。
.It Fl x Ar log_options
自動マウンタに対し、
.Ar log_options
に指定されたロギングオプションを今から使用するように指示します。
.It Fl D Ar log_options
自動マウンタに対し、
.Ar debug_options
に指定されたデバッギングオプションを今から使用するように指示します。
.It Fl M  Ar mountmap_entry
マウントマップエントリを
.Nm amd
に渡し、評価されるまで待ちます。これによりマウントが発生する可能性があります。
本オプションはセキュリティ面で非常に危険です。
デフォルトでは、
.Nm amd
と
.Nm amq
は本オプションをサポートしていません。
本オプションを有効にするためには、
.Nm am-utils
を
.Ar --enable-amq-mount
付きで構築する必要があります。
.It Fl P Ar program_number
別の RPC プログラム番号
.Ar program_number 
で登録している
.Nm amd 
に接続し、その自動マウンタのインスタンスに対して他のすべての操作を適用します。
複数コピーの
.Nm amd
を実行していて、それぞれを別個に管理する必要があるときに有用です。
指定しない場合には、
.Nm amq
は
.Nm amd
のデフォルトのプログラム番号 300019 を使用します。
セキュリティのため、
.Nm amd
が使用可能な別のプログラム番号は 300019 から 300029 まで (両端含む)
に限定されています。
.It Fl T
.Nm amd
に対して TCP でのみ通信しようとします。
通常
.Nm amq
は TCP を使用しようとし、失敗すると UDP を使用しようとします。
.It Fl U
.Nm amd
に対して UDP (コネクションレス) でのみ通信しようとします。
通常
.Nm amq
は TCP を使用しようとし、失敗すると UDP を使用しようとします。
.El
.Sh 関連ファイル
.Bl -tag -width amq.x
.It Pa amq.x
RPCのプロトコル記述
.El
.Sh 警告
.Nm amq
は、Sunが登録しているRPCプログラム番号(十進数で300019)を使っています。
これは通常、
.Pa /etc/rpc
には含まれていません。
.Pp
.Sh 関連項目
.Xr amd.conf 5 ,
.Xr amd 8 ,
.Xr ctl-amd 8 
.Xr amd 8
.Sh 作者
.An Jan-Simon Pendry Aq jsp@doc.ic.ac.uk ,
Department of Computing, Imperial College, London, UK.
.Pp
.An Erez Zadok Aq ezk@cs.columbia.edu ,
Department of Computer Science, Columbia University, New York, USA.
.Pp
.An am-utils の、他の作者および貢献者は、
am-utils とともに配布されている
.Nm AUTHORS 
ファイルに記述されています。
.Sh 歴史
.Nm amq
は、はじめに 4.4BSD で導入されました。
