freebsd/freebsd-doc/ja_JP.eucJP/man/man8/arp.8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)arp.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/arp/arp.8,v 1.8.2.3 2001/03/05 10:45:20 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 6, 1993
.Dt ARP 8
.Os BSD 4.3
.Sh 名称
.Nm arp
.Nd アドレス解決の表示と制御
.Sh 書式
.Nm
.Op Fl n
.Ar hostname
.Nm
.Op Fl n
.Fl a
.Nm
.Fl d Ar hostname
.Op Cm proxy
.Nm
.Fl d
.Fl a
.Nm
.Fl s Ar hostname ether_addr
.Op Cm temp
.Op Cm pub
.Nm
.Fl S Ar hostname ether_addr
.Op Cm temp
.Op Cm pub
.Nm
.Fl f Ar filename
.Sh 解説
.Nm
プログラムは
アドレス解決プロトコル
.Pq Xr arp 4
で使われる、インターネットからイーサネットへのアドレス変換テーブルの
表示と変更をします。
フラグなしの場合、プログラムは
.Ar hostname
に対する現在の
.Tn ARP
エントリを表示します。
ホストは名前か、インターネットドット表記の数字で指定します。
.Pp
有効なオプション:
.Bl -tag -width indent
.It Fl a
プログラムは現在の
.Tn ARP
エントリを全て表示もしくは消去します。
.It Fl d
スーパユーザならば
.Fl d
を指定して
.Ar hostname
に対応したホストのエントリを消去することができます。
公表された ARP エントリを消去する場合には、
.Cm proxy
キーワードが必要となる場合があります。
.Fl a
フラグと組み合わせて全エントリを消去することができます。
.It Fl n
ネットワークアドレスを数値で表示します (通常
.Nm
はアドレスをシンボルで表示しようとします)。
.It Fl s Ar hostname ether_addr
.Ar hostname
に対するホストについての
.Tn ARP
エントリを、
イーサネットアドレス
.Ar ether_addr
で作成します。
イーサネットアドレスはコロンで区切った六つの 16 進バイトで表現します。
このエントリは、語
.Cm temp
がコマンド中にない限り永久的なものになります。
語
.Cm pub
があれば、エントリは「公表」されます; すなわち、このシステムが
.Tn ARP
サーバとして動作することになり、
.Ar hostname
を問い合わせる要求に対して、そのホストのアドレスが自分自身でなくても、
返答することになります。
このケース
(訳注: pub を指定して ARP サーバとして動作させる場合)
では
.Ar ether_addr
を
.Cm auto
として与えることができます。
この様に指定した場合、
自ホストのインターフェースを調べ、
そのうちの 1 つが指定したホストと同じサブネットに属していれば、
そのインターフェースのイーサネットアドレスが使用されることになります。
.It Fl S Ar hostname ether_addr
このホストに関する、すでにある
.Tn ARP
エントリが最初に削除されることを除いて、
.Fl s
と同様です。
.It Fl f
ファイル
.Ar filename
を読み込んで、複数のエントリを
.Tn ARP
テーブルに設定します。
ファイル中のエントリは
.Pp
.Bd -ragged -offset indent -compact
.Ar hostname ether_addr
.Op Cm temp
.Op Cm pub
.Ed
.Pp
の形式になります。ここで引数の意味は上で与えられた通りです。
.El
.Sh 関連項目
.Xr inet 3 ,
.Xr arp 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
コマンドは
.Bx 4.3
から登場しました。
