freebsd/freebsd-doc/ja_JP.eucJP/man/man8/asf.8
.\" Copyright (c) 2003 Greg Lehey.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" This software is provided by Greg Lehey ``as is'' and
.\" any express or implied warranties, including, but not limited to, the
.\" implied warranties of merchantability and fitness for a particular purpose
.\" are disclaimed.  in no event shall Greg Lehey be liable
.\" for any direct, indirect, incidental, special, exemplary, or consequential
.\" damages (including, but not limited to, procurement of substitute goods
.\" or services; loss of use, data, or profits; or business interruption)
.\" however caused and on any theory of liability, whether in contract, strict
.\" liability, or tort (including negligence or otherwise) arising in any way
.\" out of the use of this software, even if advised of the possibility of
.\" such damage.
.\"
.\" %FreeBSD: src/usr.sbin/asf/asf.8,v 1.6 2004/06/13 18:03:40 ru Exp %
.\" $FreeBSD$
.\"
.Dd June 8, 2003
.Os
.Dt ASF 8
.Sh 名称
.Nm asf
.Nd シンボルファイルを追加する
.Sh 書式
.Nm
.Op Fl afksx
.Op Ar modules-path Op Ar outfile
.Sh 解説
デフォルトでは、
.Nm
は
.Xr kldstat 8
の出力を標準入力から読み込み、カレントディレクトリの
.Pa modules
サブディレクトリ以下にあるサブディレクトリ内の KLD から、
シンボルファイルを追加するための
.Xr gdb 1
コマンドのリストを標準出力に書き出します。
この時のカレントディレクトリは、
カーネルを構築したディレクトリを想定しています。
これにより
.Xr gdb 1
がデバック環境にシンボルをロードできるようになります。
.Pp
.Ar modules-path
が指定されていれば、
.Nm
はモジュールディレクトリとして、デフォルトである
.Pa modules
の代わりに
.Ar modules-path
を使います。
これは、標準でないところ (すなわち
.Pa /usr/src
や
.Pa /usr/obj
ではないところ) で構築している場合に有用です。
.Pp
.Ar outfile
が指定されていれば、
.Nm
は標準出力の代わりに
.Ar outfile
に書き出します。
.Sh オプション
以下のオプションで
.Nm
の動作を変更します:
.Bl -tag -width indent
.It Fl a
明示的に指定された
.Ar outfile
に書き出す時に、上書きするのではなくファイルに追加します。
.It Fl f
各モジュールが
.Ar modules-path
の何処にあっても正確なパスを決めるために、
各モジュールのパスを安易に推測する代わりに、
.Xr find 1
と同じ方法で探索を行います。
.It Fl k
標準入力から読み込む代わりに、
.Xr kldstat 8
を実行してそこから情報を読み込みます。
.It Fl s
モジュールパスに (推測した) サブディレクトリを付けません。
.It Fl x
通常
.Nm
は
.Ao Ar module Ac Ns Pa .ko.debug
という形の名前で KLD を探します。
.Fl x
オプションは
.Nm
に
.Ao Ar module Ac Ns Pa .ko
という形の名前で KLD を探すように指示します。
.El
.Sh 歴史
.Nm
ユーティリティは
.Fx 5.2
ではじめて登場しました。
.Sh 作者
.An Greg Lehey Aq grog@FreeBSD.org
.Sh バグ
モジュールパスを指定しなくても
.Ar outfile
に書き出せるようにすべきです。
.Sh 関連項目
.Xr gdb 1 ,
.Xr kldstat 8
