freebsd/freebsd-doc/ja_JP.eucJP/man/man8/atacontrol.8
.\"
.\" Copyright (c) 2000,2001,2002 S��en Schmidt <sos@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/atacontrol/atacontrol.8,v 1.20.2.1 2002/12/18 22:43:57 trhodes Exp %
.\"
.\" $FreeBSD$
.Dd May 17, 2001
.Dt ATACONTROL 8
.Os
.Sh 名称
.Nm atacontrol
.Nd ATA デバイスドライバのコントロールプログラム
.Sh 書式
.Nm
.Aq Ar command
.Ar args
.Pp
.Nm
.Ic attach
.Ar channel
.Nm
.Ic detach
.Ar channel
.Nm
.Ic reinit
.Ar channel
.Nm
.Ic create
.Ar type Oo Ar interleave Oc Ar disk0 ... diskN
.Nm
.Ic delete
.Ar raid
.Nm
.Ic rebuild
.Ar raid
.Nm
.Ic status
.Ar raid
.Nm
.Ic mode
.Ar channel
.Op Ar mastermode slavemode
.Nm
.Ic info
.Ar channel
.Nm
.Ic cap
.Ar channel device
.Nm
.Ic enclosure
.Ar channel device
.Nm
.Ic list
.Sh 解説
.Nm
ユーティリティは
.Fx
.Xr ata 4
サブシステムへのアクセスとコントロールをユーザに提供する
コントロールプログラムです。
.Pp
.Nm
ユーティリティは使い方を誤ると、
深刻なシステム障害やデータの損失を引き起こすことがあるので、
このコマンドは十分な注意の上に使用するようにして下さい!
.Pp
引数
.Ar channel
は、操作する ATA チャネルの番号です。
以下のコマンドがサポートされています:
.Bl -tag -width "rebuild"
.It Ic attach
ATA
.Ar channel
に接続します。チャネル上のデバイスはブート時と同様に検出され、接続されます。
.It Ic detach
ATA
.Ar channel
を切り離します。
チャネル上のデバイスはカーネルから取り除かれ、未処理の転送等は失敗として
システムに返されます。
.It Ic reinit
ATA
.Ar channel
を再初期化します。
チャネル上のデバイスはリセットされ、
ATA のドライバが内部で記憶しているパラメータに初期化されます。
故障もしくは検出に反応しなくなったデバイス、または物理的に取り外された
デバイスはカーネルから取り除かれます。
そしてまた、リセット中にデバイスが検出・接続されることもあります。
.It Ic create
.Ar type
の
ATA RAID
を作成します。
タイプは
.Cm RAID0
(ストライプ),
.Cm RAID1
(ミラー),
.Cm RAID0+1 ,
.Cm SPAN
(JBOD) のいずれかです。
RAID に
.Cm RAID0
の部分がある場合、
.Ar interleave
をセクタ数の単位で指定することが必要です。
RAID は
.Bk -words
.Ar disk0 ... diskN
.Ek
という名前の独立したディスクから構成されます。
.Pp
ATA ドライバはどんなコントローラのディスク上にでも ATA RAID を作成可能ですが、
制限があります。
アレイからブート可能なのは、Promise や Highpoint といった
.Dq 本物
の ATA RAID コントローラにそのアレイが接続されている場合か、
RAID が
.Cm RAID1
または
.Cm SPAN
と宣言されている場合です。
SPAN の場合には、ブートするパーティションが SPAN の最初の
ディスクにある必要があります。
.It Ic delete
RAID 対応 ATA コントローラの RAID アレイを削除します。
.It Ic rebuild
RAID 対応 ATA コントローラの RAID1 アレイを再構成します。
.It Ic status
ATA RAID の状態を取得します。
.It Ic mode
2つのモード引数がない場合、両方のデバイスの現在の転送モードが表示されます。
モード引数が与えられた場合、転送モードをそのモードに変更するように、
ATAドライバに要求します。ハードウェアがそれらのモードをサポートしていないときは
ATAドライバは要求を拒否します。
モードは、
.Dq Li PIO3 ,
.Dq Li udma2 ,
.Dq Li udma100
のように指定します。文字の大小は関係ありません。
もし、デバイスモードの 1 つを変更しないときは、そのモードのところに
.Dq Li 変更無し
の意味、引数
.Dq Li XXX
を使います。
.Pp
現在サポートされているモードは、
.Dq Li BIOSDMA ,
.Dq Li PIO0 (alias BIOSPIO) ,
.Dq Li PIO1 ,
.Dq Li PIO2 ,
.Dq Li PIO3 ,
.Dq Li PIO4 ,
.Dq Li WDMA2 ,
.Dq Li UDMA2 (UDMA33 の別名) ,
.Dq Li UDMA4 (UDMA66 の別名) ,
.Dq Li UDMA5 (UDMA100 の別名) ,
.Dq Li UDMA6 (UDMA133 の別名)
です。
.It Ic info
.Ar channel
に接続されたデバイスの情報を表示します。
デバイス名とメーカ/バージョンを表示します。
.It Ic cap
.Ar channel device
のデバイスの詳細を表示します。
デバイス 0 はマスタを、デバイス 1 はスレーブを意味します。
.It Ic enclosure
.Ar channel device
のエンクロージャの詳細を表示します。
デバイス 0 はマスタを、デバイス 1 はスレーブを意味します。
ファンの RPM 速度、エンクロージャ温度、5V と 12V のレベルを表示します。
.It Ic list
すべての有効なコントローラ上の、すべての接続されているデバイスについて、
情報を表示します。
.El
.Sh 使用例
デバイスの現在のアクセスモードを見るには、次のコマンドラインを使用します:
.Pp
.Dl atacontrol mode 0
.Pp
この結果、デバイスのモードが次のような文字列で表示されます:
.Pp
.Dl Master = WDMA2
.Dl Slave  = PIO4
.Pp
これは、ata0-master は DMA モード、
ata0-slave は PIO モードであることなどを示します。
上記のような文字列を使用することで、atacontrol でモード設定可能です。
例えば次のようにします:
.Pp
.Dl atacontrol mode 0 PIO4 PIO4
.Pp
atacontrol が戻るときには、新規モードが設定されています。
.Sh 関連項目
.Xr ata 4
.Sh 歴史
.Nm
ユーティリティは、
.Fx 4.6 
ではじめて登場しました。
.Sh 作者
.An -nosplit
.Nm
ユーティリティは、
.An S\(/oren Schmidt
.Aq sos@FreeBSD.org 
が書きました。
.Pp
このマニュアルページは、
.An S\(/oren Schmidt
.Aq sos@FreeBSD.org 
が書きました。
