freebsd/freebsd-doc/ja_JP.eucJP/man/man8/atm.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) %FreeBSD: src/sbin/atm/atm/atm.8,v 1.3 1999/08/28 00:12:16 peter Exp %
.\" $FreeBSD$
.\"
.\"
.\" WORD: attach アタッチ
.\" WORD: open オープン
.\" WORD: close クローズ
.\" WORD: prefix プレフィックス
.\" WORD: transmit 送出
.\" WORD: ATM Adaptation Layer		ATM アダプテーションレイヤ
.\" WORD: Virtual Channel Identifier	仮想チャネル識別子
.\" WORD: Virtual Path Identifier	仮想パス識別子
.\" WORD: Virtual Channel Connection	仮想チャネル接続
.\" WORD: End System Identifier		エントシステム識別子
.\" WORD: Protocol Data Unit		プロトコルデータユニット
.\" 
.\" 
.de EX		\"Begin example
.ne 5
.if n .sp 1
.if t .sp .5
.nf
.in +.5i
..
.de EE
.fi
.in -.5i
.if n .sp 1
.if t .sp .5
..
.TH ATM 8 "1998-08-20" "HARP"
.SH 名称
atm \- HARP ATM インタフェースに関する、ユーザ設定と表示のコマンド
.SH 書式
インタフェース管理サブコマンド:
.in +10
.ti -5
.B atm attach
<interface> <sigmgr>
.ti -5
.B atm detach
<interface>
.ti -5
.B atm set MAC
<interface> <MAC/ESI address>
.ti -5
.B atm set netif
<interface> <prefix> <count>
.ti -5
.B atm set prefix
<interface> <NSAP prefix>
.ti -5
.B atm show config
[<interface>]
.ti -5
.B atm show interface
[<interface>]
.ti -5
.B atm show netif
[<netif>]
.ti -5
.B atm show stats interface
[<interface> [phy | dev | atm | aal0 | aal4 | aal5 | driver]]
.sp
.ti -10
VCC 管理サブコマンド:
.ti -5
.B atm add PVC
<interface> <vpi> <vci> <aal> <encaps> <owner> ...
.ti -5
.B atm delete PVC
<interface> <vpi> <vci>
.ti -5
.B atm delete SVC
<interface> <vpi> <vci>
.ti -5
.B atm show stats VCC
[<interface> [<vpi> [<vci>]]]
.ti -5
.B atm show VCC
[<interface> [<vpi> [<vci>] | SVC | PVC]]
.sp
.ti -10
IP 管理サブコマンド:
.ti -5
.B atm add ARP
[<netif>] <host> <ATM address>
.ti -5
.B atm add PVC
<interface> <vpi> <vci> <aal> <encaps> IP <netif> <host> | dynamic
.ti -5
.B atm delete ARP
[<netif>] <host>
.ti -5
.B atm set arpserver
<netif> <ATM address> | local [<IP prefix> ...] 
.ti -5
.B atm show ARP
[<host>]
.ti -5
.B atm show arpserver
[<netif>]
.ti -5
.B atm show IPVCC
[<host> | <netif>]
.ti -5
.sp
.ti -10
その他のサブコマンド:
.ti -5
.B atm help
.ti -5
.B atm show version
.in -10
.fi
.SH 解説
.I atm
は Host ATM Research Platform (HARP) ネットワーキングソフトウェアの状態を
設定および表示します。
サブコマンドは、いくつかのカテゴリに分類されます:
.PP
\fIインタフェース管理\fP サブコマンドは、ATM インタフェースを制御します。
機能としては、シグナリングマネージャのインタフェースへの割り当て、
ATM アドレスの設定、
(複数の) ネットワークインタフェースと (単一の) インタフェースとの関連付け、
インタフェースの情報の表示があります。
.PP
\fIVCC 管理\fP サブコマンドは、
ATM 仮想チャネル接続 (Virtual Channel Connection; VCC) を管理します。
機能としては、VCC のオープン・クローズ・情報の表示があります。
.PP
\fIIP 管理\fP サブコマンドは、
IP と ATM ソフトウェアの間のインタフェースを管理します。
機能としては、ATMARP キャッシュの表示と操作、
IP に接続した PVC のオープン、
ATMARP サーバのネットワークインタフェースへの割り当て、
IP VCC の情報の表示があります。
.PP
\fIその他\fP のサブコマンドは、ATM ソフトウェアのバージョン表示と
\fIatm\fP コマンドのヘルプ表示があります。
.SS "シグナリングマネージャ"
シグナリングマネージャには VCC のオープンとクローズの責任があります。
4 種のシグナリングマネージャがサポートされています:
.PP
.in +10
.ti -5
PVC - PVC にのみ対応。
.ti -5
SPANS - FORE 独自のシグナリングプロトコルである SPANS をサポート。
.ti -5
UNI 3.0 - ATM Forum の
\fIATM User-Network Interface Specification, Version 3.0\fP
のシグナリングプロトコルをサポート。
.ti -5
UNI 3.1 - ATM Forum の
\fIATM User-Network Interface Specification, Version 3.1\fP
のシグナリングプロトコルをサポート。
.in -10
.PP
4 種すべてのシグナリングマネージャが PVC のオープンとクローズをサポートします
(\fIadd\fP と \fIdelete\fP のサブコマンドを参照)。
.PP
物理インタフェース上で VCC を作成可能とするには、
物理インタフェース 1 個に対し、
シグナリングマネージャ 1 個をアタッチする必要があります
(\fIattach\fP サブコマンド参照)。
.SS "物理インタフェースおよびネットワークインタフェース"
次の 2 種類のインタフェースがサポートされています:
それぞれ物理インタフェースとネットワークインタフェースです。
物理インタフェースは ATM ネットワークへの物理的な接続点を表現します。
物理インタフェースは、自身に関連付けられた ATM アドレスを持ちます。
ただし、PVC のみのシグナリングマネージャが使用されているときは例外です。
.PP
ネットワークインタフェースは論理インタフェースです。
1 個以上のネットワークインタフェースを 1 個の物理インタフェースに
関連付けられます。
各ネットワークインタフェースは、自身に関連付けられた IP アドレスを持ちます。
UNI が制御するインタフェースでは、
1 個の物理インタフェースに
256 個までのネットワークインタフェースを関連付けることができます。
この場合、ネットワークインタフェースと ATM アドレスの対応は、
物理インタフェースの ATM アドレスのセレクタフィールド (最後のバイト)
によって行われます。
PVC のみのインタフェースでは、
各物理インタフェースに 256 個までの論理インタフェースを
関連付けることが可能です。
SPANS もしくは PVC のシグナリングマネージャが制御するインタフェースでは、
各物理インタフェースには単一のネットワークインタフェースのみが
関連付けられる必要があります。
.SS "キーワードと文書の約束"
キーワードを十分区別できるだけの先頭部分を与えるだけで、
コマンドとサブコマンドのキーワードを短縮できます。
よって、\fIatm sh v\fB は \fIatm show vcc\fB と同じ結果になります。
.PP
すべてのキーワードは大文字小文字の区別がありません。
.PP
\fIatm\fP コマンドにホストアドレスを与える必要があるときには、
DNS での名前でも、ドット付き 10 進数形式による IP アドレスでも使用可能です。
.PP
ATM アドレスは 16 進数の文字列として指定します。
前に "0x" を付けてもかまいません。
アドレス内のフィールドはピリオドで区切ってもかまいません。
ピリオドは読み易さのためだけにあり、単に無視されます。
SPANS アドレスは 8 バイト長であり、NSAP 形式アドレスは 20 バイト長です。
先行する 0 を含めて、全アドレスを指定する必要があります。
例:
.in +5
0x47.0005.80.ffe100.0000.f21a.0170.0020481a0170.00 (NSAP 形式)
.br
0x00000010.f2050aa9 (SPANS 形式)
.in -5
.fi
.SH サブコマンド
.SS インタフェース管理サブコマンド:
.in +5
.ti -5
\fIatm add PVC <interface> <vpi> <vci> <aal> <encaps> <owner> ...\fP
.in -5
.PP
\fIadd PVC\fP サブコマンドの形式は PVC の所有者に依存して変化します。
"IP 管理サブコマンド" を参照してください。
.PP
\fIatm attach <interface> <sigmgr>\fP
.PP
ここで:
.in +10
.ti -5
\fI<interface>\fP は、
シグナリングマネージャをアタッチする物理インタフェースを指定します。
.ti -5
\fI<sigmgr>\fP は、どのシグナリングマネージャをアタッチするかを指定します。
有効な指定は、"SIGPVC", "SPANS", "UNI30", "UNI31" です。
.in -10
.PP
このコマンドは、シグナリングマネージャをインタフェースにアタッチします。
この処理が完了するまで、VCC のオープンおよびクローズはできません。
1 度に 1 個のシグナリングマネージャのみインタフェースにアタッチ可能です。
.PP
\fIatm detach <interface>\fP
.PP
ここで:
.in +10
.ti -5
\fI<interface>\fP は、
シグナリングマネージャをデタッチする物理インタフェースを指定します。
.in -10
.PP
このコマンドは、インタフェースからシグナリングマネージャをデタッチします。
このシグナリングマネージャが作成した全 VCC はクローズされ、
再度 (同じもしくは異った) シグナリングマネージャが作成されるまで
新規の VCC は作成できません。
.PP
\fIatm set MAC <interface> <MAC/ESI address>\fP
.PP
ここで:
.in +10
.ti -5
\fI<interface>\fP は、
MAC アドレスが設定される物理インタフェースを指定します。
.ti -5
\fI<MAC/ESI address>\fP は、
インタフェースの NSAP アドレスの 6 バイト MAC 部分を指定します。
MAC アドレスは 12 文字の 16 進数文字列により指定され、
先頭に "0x" を付けてもかまいません。
アドレス中のフィールドをピリオドで区切ってもかまいません。
.in -10
.PP
このコマンドは、UNI が制御するインタフェースの MAC アドレスを設定します。
20 バイトの NSAP 形式アドレスのうち、
先頭 13 バイト (プレフィックス) が
\fIatm set prefix\fP コマンドもしくは ILMI デーモン (\fIilmid\fP (8))
によって設定され、
次の 6 バイト (エンドシステム識別子 (End System Identifier; ESI)) が
本コマンドにより設定され、
最後のバイト (セレクタ) が
どのネットワークインタフェースがアドレスに関連付けられているかによって
決定されます。
.PP
\fIatm set MAC\fP コマンドを使用して、
インタフェースハードウェア中の MAC アドレスを上書き可能です。
.PP
\fIatm set netif <interface> <prefix> <count>\fP
.PP
ここで:
.in +10
.ti -5
\fI<interface>\fP は、ネットワークインタフェース (複数可) を関連付ける
物理インタフェースを指定します。
.ti -5
\fI<prefix>\fP は、ネットワークインタフェース名の不変部分を指定します。
.ti -5
\fI<count>\fP は、作成するネットワークインタフェース数を指定します。
.in -10
.PP
このコマンドは 1 個以上のネットワークインタフェースを作成し、
これらを指定した物理インタフェースに関連付けます。
ネットワークインタフェース名は、プレフィックスとカウントから決定されます。
名前は <prefix><nn> の形式となり、
<prefix> は \fIset\fP サブコマンドで指定するプレフィックスであり、
<nn> は 0 から <count>-1 の範囲の値です。例えば、コマンド:
.PP
.ti +5
atm set netif hfa0 ni 2
.PP
は ni0 と ni1 という名称の 2 個のネットワークインタフェースを作成し、
これらを物理インタフェース hfa0 と関連付けます。
.PP
\fIatm set prefix <interface> <NSAP prefix>\fP
.PP
ここで:
.in +10
.ti -5
\fI<interface>\fP は、
NSAP プレフィックスを設定する物理インタフェースを指定します。
.ti -5
\fI<NSAP prefix>\fP は、
インタフェースの NSAP アドレスの先頭 13 バイトを指定します。
プレフィックスは16 進数文字列により指定され、
先頭に "0x" を付けてもかまいません。
プレフィックス中のフィールドをピリオドで区切ってもかまいません。
.in -10
.PP
このコマンドは、UNI が制御するインタフェースのアドレスを設定します。
20 バイトの NSAP 形式アドレスのうち、
先頭 13 バイト (プレフィックス) が本コマンドにより設定され、
次の 6 バイト (エンドシステム識別子 (End System Identifier; ESI)) が
物理インタフェースから得られる MAC アドレスになるかまたは
\fIset MAC\fP サブコマンドにより設定され、
最後のバイト (セレクタ) が
どのネットワークインタフェースがアドレスに関連付けられているかによって
決定されます。
.PP
UNI が制御するインタフェースがアクティブになる前に、
NSAP プレフィックスを設定する必要があります。
これは、ILMI デーモン (\fIilmid\fP (8)) もしくは
\fIset prefix\fP サブコマンドにより実現されます。
.PP
.I atm show config [<interface>]
.PP
次の情報を表示します:
.PP
.B Interface
\- 物理インタフェース名。
.PP
.B Vendor
\- アダプタベンダ名。
.PP
.B Model
\- アダプタのモデル。
.PP
.B Media
\- アダプタが使用する通信媒体。
.PP
.B Bus
\- アダプタがアタッチされているバスのタイプ。
.PP
.B Serial No.
\- アダプタのシリアル番号。
.PP
.B MAC address
\- インタフェースの MAC アドレス。
\fIatm set MAC\fP コマンドを使用して
インタフェースの実効 MAC アドレスを変更した場合であっても、
これはアダプタのハードウェアにエンコードされた MAC アドレスです。
.PP
.B Hardware version
\- インタフェースが報告するハードウェアリビジョンレベル。
.PP
.B Firmware version
\- インタフェースが報告するファームウェアリビジョンレベル。
.PP
\fIshow config\fP サブコマンドでパラメータを指定しない場合、
全物理インタフェースの設定が表示されます。
インタフェース名を指定すると、指定したインタフェースの設定だけが表示されます。
.PP
.I atm show interface [<interface>]
.PP
次の情報を表示します:
.PP
.B Interface
\- 物理インタフェース名。
.PP
.B Sigmgr
\- インタフェースにアタッチされたシグナリングマネージャ名。
シグナリングマネージャがアタッチされていない場合、ダッシュ (-) が表示されます。
.PP
.B State
\- インタフェースのシグナリングマネージャの状態。
各シグナリングマネージャは、それぞれの状態の組み合わせを保持します。
それらを示します:
.in +21
.ti -16
PVC:
.ti -11
ACTIVE\ ---\ シグナリングマネージャはアクティブです。
.ti -11
DETACH\ ---\ シグナリングマネージャはデタッチされているところです。
.ti -16
SPANS:
.ti -11
ACTIVE\ ---\ シグナリングマネージャはアクティブです。
.ti -11
DETACH\ ---\ シグナリングマネージャはデタッチされているところです。
.ti -11
INIT\ -----\ シグナリングマネージャの初期状態。
.ti -11
PROBE\ ----\ シグナリングマネージャは
ATM スイッチと接続を行っているところです。
.ti -16
UNI 3.0 または UNI 3.1:
.ti -11
NULL\ -----\ シグナリングマネージャの初期状態。
.ti -11
ADR_WAIT\ -\ シグナリングマネージャは
NSAP プレフィックスが設定されるのを待っているところです。
.ti -11
INIT\ -----\ シグナリングマネージャはスイッチとの接続を確立しているところです。
.ti -11
ACTIVE\ ---\ シグナリングマネージャはアクティブです。
.ti -11
DETACH\ ---\ シグナリングマネージャはデタッチされているところです。
.ti -21
.PP
.B ATM address
\- インタフェースの ATM アドレス。
.PP
.B Network interfaces
\- 物理インタフェースに関連付けられたネットワークインタフェース名
(存在する場合)。
.PP
\fIshow interface\fP サブコマンドでパラメータを指定しない場合、
全物理インタフェースの設定が表示されます。
インタフェース名を指定すると、指定したインタフェースの設定だけが表示されます。
.PP
.I atm show netif [<netif>]
.PP
次の情報を表示します:
.PP
.B Net Intf
\- ネットワークインタフェース名。
.PP
.B IP Address
\- ネットワークインタフェースの IP アドレス。
.PP
\fIshow netif\fP サブコマンドでパラメータを指定しない場合、
全物理インタフェースの設定が表示されます。
インタフェース名を指定すると、指定したインタフェースの設定だけが表示されます。
.PP
\fIatm show stats interface [<interface> [phy | dev | atm | aal0 |
aal4 | aal5 | driver]]\fP
.PP
1 個以上のインタフェースに関連する統計情報を表示します。
対象を示すキーワード
(\fIphy\fP, \fIdev\fP, \fIatm\fP, \fIaal0\fP,
\fIaal4\fP, \fIaal5\fP, \fIdriver\fP) を指定して、
表示する統計情報のスコープを変更可能です。
.PP
対象を表すキーワードを指定しないと、次の情報を表示します:
.PP
.B Interface
\- 物理 ATM インタフェース名。
.PP
.B Input PDUs
\- インタフェースで受信した
プロトコルデータユニット (Protocol Data Unit; PDU) 数。
.PP
.B Input Bytes
\- インタフェースで受信したバイト数。
.PP
.B Input Errs
\- インタフェースに発生した入力エラー数。
.PP
.B Output PDUs
\- インタフェースから送出した
プロトコルデータユニット (Protocol Data Unit; PDU) 数。
.PP
.B Output Bytes
\- インタフェースから送出したバイト数。
.PP
.B Output Errs
\- インタフェースに発生した出力エラー数。
.PP
.B Cmd Errs
\- インタフェースに発生したコマンドエラー数。
.PP
対象を表すキーワードを指定すると、その対象の統計情報が表示されます。
表示される情報はアダプタ依存です。
要求した統計情報が利用不能なアダプタの場合、エラーが報告されます。
.PP
\fIshow stats interface\fP サブコマンドでパラメータを指定しない場合、
全 ATM インタフェースの統計情報が表示されます。
インタフェース名を指定すると、
指定したインタフェースの統計情報だけが表示されます。
.PP
.SS VCC 管理サブコマンド:
.PP
\fIatm delete PVC <interface> <vpi> <vci>\fP
.br
\fIatm delete SVC <interface> <vpi> <vci>\fP
.PP
ここで:
.in +10
.ti -5
\fIPVC\fP は、クローズする VCC として PVC を指定します。
.ti -5
\fISVC\fP は、クローズする VCC として SVC を指定します。
.ti -5
\fI<interface>\fP は、
クローズする VCC が終端する物理インタフェースを指定します。
.ti -5
\fI<vpi>\fP は、VCC の仮想パス識別子 (Virtual Path Identifier; VPI)
を指定します。
.ti -5
\fI<vci>\fP は、VCC の仮想チャネル識別子 (Virtual Channel Identifier; VCI)
を指定します。
.in -10
.PP
このコマンドは、VCC をクローズします。
2 個の形式の違いは、
1 番目の形式が VCC は PVC
(\fIadd PVC\fP サブコマンドで作成されたものです)
であると指定するのに対し、
2 番目の形式が VCC は SVC であると指定することだけです。
予約された VCC (VCI 値が 32 未満のもの) は、このコマンドでクローズできません。
.PP
\fIatm show stats VCC [<interface> [<vpi> [<vci>]]]\fP
.PP
次の情報を表示します:
.PP
.B Interface
\- VCC が終端する物理インタフェース。
.PP
.B VPI
\- VCC の仮想パス識別子 (Virtual Path Identifier; VPI)。
.PP
.B VCI
\- VCC の仮想チャネル識別子 (Virtual Channel Identifier; VCI)。
.PP
.B Input PDUs
\- VCC で受信した
プロトコルデータユニット (Protocol Data Unit; PDU) 数。
.PP
.B Input Bytes
\- VCC で受信したバイト数。
.PP
.B Input Errs
\- VCC で発生した入力エラー数。
.PP
.B Output PDUs
\- VCC から送出した
プロトコルデータユニット (Protocol Data Unit; PDU) 数。
.PP
.B Output Bytes
\- VCC から送出したバイト数。
.PP
.B Output Errs
\- VCC で発生した出力エラー数。
.PP
.\" show status VCC の誤り？
\fIshow VCC\fP サブコマンドでパラメータを指定しない場合、
アクティブな VCC すべてが表示されます。
インタフェース名を指定すると、
指定したインタフェースのアクティブな VCC すべてが表示されます。
インタフェースと VPI を指定すると、
指定したインタフェースの VPI に対するアクティブな VCC すべてが表示されます。
インタフェースと VPI と VCI が指定された場合、
指定されたインタフェースの指定された VCC だけが表示されます
(SPANS は SVC を単方向と見なしますので、実際には 2 個の VCC になり得ます)。
.PP
\fIatm show VCC [<interface> [<vpi> [<vci>] | SVC | PVC]]\fP
.PP
次の情報を表示します:
.PP
.B Interface
\- VCC が終端する物理インタフェース。
.PP
.B VPI
\- VCC の仮想パス識別子 (Virtual Path Identifier; VPI)。
.PP
.B VCI
\- VCC の仮想チャネル識別子 (Virtual Channel Identifier; VCI)。
.PP
.B AAL
\- VCC で使用している ATM アダプテーションレイヤ (ATM Adaptation Layer; AAL)。
表示される値は、ヌルと AAL の 1 から 5 です。
.PP
.B Type
\- VCC が SVC か PVC かを指定します。
.PP
.B Dir
\- VCC の情報の流れの方向。
VCC は、入力・出力・双方向のいずれかになり得ます。
.PP
.B State
\- シグナリングマネージャが報告する、VCC の状態。
各シグナリングマネージャは、それぞれの状態の組み合わせを保持します。
それらを示します:
.in +21
.ti -16
PVC:
.ti -11
NULL\ -----\ 状態はありません。
.ti -11
ACTIVE\ ---\ VCC はアクティブです。
.ti -11
FREE\ -----\ VCC はクローズされ、
シグナリングマネージャは自己の資源が解放されることを待っています。
.ti -16
SPANS:
.ti -11
NULL\ -----\ 状態はありません。
.ti -11
ACTIVE\ ---\ VCC は PVC であり、アクティブです。
.ti -11
ACT_DOWN\ -\ VCC は PVC であり、インタフェースがダウンしています。
.ti -11
POPEN\ ----\ VCC はオープンされるところです。
.ti -11
R_POPEN\ --\ VCC はリモートホストによってオープンされるところです。
.ti -11
OPEN\ -----\ VCC はアクティブです。
.ti -11
CLOSE\ ----\ VCC はクローズされるところです。
.ti -11
ABORT\ ----\ VCC は中断 (abort) するところです。
.ti -11
FREE\ -----\ VCC はクローズされ、
シグナリングマネージャは自己の資源が解放されることを待っています。
.ti -16
UNI 3.0 または UNI 3.1:
.ti -11
NULL\ -----\ 状態はありません。
.ti -11
C_INIT\ ---\ VCC が開始 (initiate) されるところです。
.ti -11
C_OUT_PR\ -\ 外向きの VCC リクエストが進行しています。
.ti -11
C_PRES\ ---\ VCC がネットワークにより開始されるところです。
.ti -11
CONN_REQ\ -\ VCC リクエストが HARP ユーザに受理されました。
.ti -11
C_IN_PR\ --\ 内向きの VCC リクエストが進行しています。
.ti -11
ACTIVE\ ---\ VCC はアクティブです。
.ti -11
REL_REQ\ --\ VCC はクローズされるところです。
.ti -11
REL_IND\ --\ ネットワークが VCC をクリアしています。
.ti -11
SSCF_REC\ -\ シグナリングチャネルの SSCF セッションはエラーから回復中です。
.ti -11
FREE\ -----\ VCC はクローズされ、
シグナリングマネージャは自己の資源が解放されることを待っています。
.ti -11
ACT_DOWN\ -\ VCC は PVC であり、インタフェースがダウンしています。
.ti -21
.PP
.B Encaps
\- VCC で有効となっているカプセル化。
表示されるカプセル化は、ヌルか LLC/SNAP です。
.PP
.B Owner
\- VCC の所有者 (複数可) です。
VCC を使用している機能 (function) 名を表示します。
.PP
.B Destination
\- VCC のリモートエンドにあるホストの ATM アドレス。
.PP
\fIshow VCC\fP サブコマンドでパラメータを指定しない場合、
アクティブな VCC すべてが表示されます。
インタフェース名を指定すると、
指定したインタフェースのアクティブな VCC すべてが表示されます。
インタフェースと VPI を指定すると、
指定したインタフェースの VPI に対するアクティブな VCC すべてが表示されます。
インタフェースと VPI と VCI が指定された場合、
指定されたインタフェースの指定された VCC だけが表示されます
(SPANS は SVC を単方向と見なしますので、実際には 2 個の VCC になり得ます)。
.PP
.SS IP 管理サブコマンド:
\fIatm add ARP [<netif>] <host> <ATM address>\fP
.PP
ここで:
.in +10
.ti -5
\fI<netif>\fP は、
ATMARP エントリが関連付けられるネットワークインタフェース名であり、
省略可能です。
名前を指定しないと、
追加されるホストの IP アドレスに依存して、
ネットワークインタフェースが選択されます。
.ti -5
\fI<host>\fP は、ATMARP テーブルに追加されるホストの
ホスト名もしくは IP アドレスです。
.ti -5
\fI<ATM address>\fP は、ホストの ATM アドレスです。
.in -10
.PP
このコマンドは、ATM の ATMARP テーブルにエントリを追加します。
指定したホストの IP アドレスは、指定した ATM アドレスと関連付けられます。
IP がそのホストに対してデータを送出する必要があるとき、
指定した ATM アドレスを使用して SVC をオープンします。
.PP
ATMARP テーブルのエントリには永続的の印が付けられ、
エイジングの対象にはなりません。
.PP
.in +5
.ti -5
\fIatm add PVC <interface> <vpi> <vci> <aal> <encaps> IP <netif> <host> | dynamic\fP
.in -5
.PP
ここで:
.in +10
.ti -5
\fI<interface>\fP は、PVC が終端する物理インタフェースを指定します。
.ti -5
\fI<vpi>\fP は、PVC の仮想パス識別子 (Virtual Path Identifier; VPI)
を指定します。
.ti -5
\fI<vci>\fP は、PVC の仮想チャネル識別子 (Virtual Channel Identifier; VCI)
を指定します。
.ti -5
\fI<aal>\fP は、PVC のATM アダプテーションレイヤ (ATM Adaptation Layer; AAL)
を指定します。
使用可能な値は、"null" か、
ヌル AAL を表す "AAL0" か、
AAL 1 を表す "AAL1" か、
AAL 2 を表す "AAL2" か、
AAL 3/4 を表す "AAL3", "AAL4", "AAL3/4" のいずれかか、
AAL 5 を表す "AAL5" です。
.ti -5
\fI<encaps>\fP は、PVC のカプセル化を指定します。
指定可能な値は、
カプセル化無しを表す "null" または "none" か、
LLC/SNAP カプセル化を表す "LLC/SNAP", "LLC", "SNAP" のいずれかです。
.ti -5
\fIIP\fP は、PVC の所有者が IP であることを指定します。
.ti -5
\fI<netif>\fP は、PVC が関連付けられるネットワークインタフェースを指定します。
ネットワークインタフェースが存在することと、
指定された物理インタフェースと関連付けられていることが必要です。
.ti -5
\fI<host> | dynamic\fP は、
PVC の彼方にあるホストのアドレスを指定するか、
逆 ARP でアドレスを決定する必要がある場合には語 "dynamic" を指定します。
"dynamic" を指定する場合、LLC/SNAP カプセル化もまた指定する必要があります。
.PP
このコマンドは、指定した属性の PVC を作成し、IP にアタッチします。
.PP
\fIatm delete ARP [<netif>] <host>\fP
.PP
ここで:
.in +10
.ti -5
\fI<netif>\fP は、
ATMARP エントリが関連付けられるネットワークインタフェース名であり、
省略可能です。
名前を指定しないと、
関連付けられているネットワークインタフェースにかかわらず、
指定したホストをキャッシュエントリから削除します。
.ti -5
\fI<host>\fP は、ATMARP テーブルから削除されるホストの
ホスト名もしくは IP アドレスです。
.PP
このコマンドは、指定したホストのエントリを ATMARP テーブルから削除します。
.PP
\fIatm set arpserver <netif> <ATM address> | local [<IP prefix> ...]\fP
.PP
ここで:
.in +10
.ti -5
\fI<netif>\fP は、
ATMARP サーバアドレスが設定されるネットワークインタフェースを指定します。
.ti -5
\fI<ATM address>\fP は、
ATMARP サービスを提供するホストの ATM アドレスを指定します。
ATM アドレスではなく "local" が指定された場合、
このコマンドが発行されたホストが ATMARP サーバになります。
.ti -5
\fI<IP prefix> ...\fP は、
ATMARP サーバの情報提供対象となる IP プレフィックスのリストであり、
省略可能です。
IP プレフィックスは、
ドット付き 10 進数の IP アドレス、
続いてスラッシュ、
続いて IP アドレスの何ビットが意味があるかを示す数字により指定されます。
例えば 10.0.0.0/8 は、
IP ネットワーク 10 の全アドレスに対して ATMARP サーバがサービスすることを
表現します。
ネットワークインタフェースが属する IP サブネットワークは、
自動的に含まれます。
.in -10
.PP
このコマンドは、
ネットワークインタフェースに対して ATMARP サーバのアドレスを設定します。
.PP
.I atm show ARP [<host>]
.PP
次の情報を表示します:
.PP
.B Net Intf
\- エントリに対応するトラフィックが使用するネットワークインタフェース名。
.PP
.B Flags
.\" 最初の \- ... は消し忘れ？
\- エントリが有効であるか、そして永続的であるかを示すフラグ。
\- ATMARP エントリの更なる情報を示すフラグ。
フラグの文字の意味は次の通りです:
.PP
.in +5
P - エントリは永続的です。
.br
R - エントリはリフレッシュされました。
.br
V - エントリは有効です。
.in -5
.PP
.B Age
\- エントリが有効なままでいる残り時間 (分)。
.PP
.B Origin
\- ATMARP エントリのソース。
表示される値は次の通りです:
.in +16
.ti -11
LOCAL\ ----\ このエントリは、このホストのインタフェース用です。
.ti -11
PERM\ -----\ このエントリは、永続的です。
\fIadd ARP\fP コマンドで作成したエントリに対して使用されます。
.ti -11
REG\ ------\ このエントリは、
あるホストが ATMARP サーバに登録した結果として作成されました。
.ti -11
SCSP\ -----\ このエントリは、SCSP を介して学習しました。
.ti -11
LOOKUP\ ---\ このエントリは、
あるホストが ATMARP 検索 (lookup) を実行した結果として作成されました。
.ti -11
PEER_RSP\ -\ このエントリは、
あるホストが InARP リクエストに応答した結果として作成されました。
.ti -11
PEER_REQ\ -\ このエントリは、
あるホストが InARP リクエストを送信した結果として作成されました。
.in -5
.PP
.B ATM address
\- エントリが参照するホストの ATM アドレス。
.PP
.B IP address
\- エントリが参照するホストの IP アドレスまたはドメイン名。
.PP
\fIshow ARP\fP サブコマンドでパラメータを指定しない場合、
ATMARP テーブルすべてが表示されます。
ホスト名もしくは IP アドレスが指定されると、
指定したホストに関する情報のみが表示されます。
.PP
このコマンドは、動的に学習した情報
(あれやこれやの形式の ATMARP によるもの、または SCSP によるもの) と、
ユーザが設定した情報 (\fIadd ARP\fP サブコマンドによるもの) の両方を表示します。
.PP
.I atm show arpserver [<netif>]
.PP
次の情報を表示します:
.PP
.B Net Intf
\- 情報表示対象のネットワークインタフェース。
.PP
.B State
\- ATMARP サーバへの接続状態。
表示される値は次の通りです:
.in +16
.ti -11
NOT_CONF\ -\ インタフェースに対して ATMARP サーバが設定されていません。
.ti -11
SERVER\ ---\ このホストが ATMARP サーバです。
.ti -11
PEND_ADR\ -\ インタフェースに対して ATM アドレスが設定されていません。
.ti -11
POPEN\ ----\ このホストが
ATMARP サーバに対して VCC をオープンしようとしています。
.ti -11
REGISTER\ -\ このホストは、
ATMARP サーバに対してオープンされた VCC を持っていて、
サーバに対して登録作業中です。
.ti -11
ACTIVE\ ---\ ATMARP サーバへの接続はアクティブです。
.in -16
.PP
.B ATM Address
\- ATMARP サーバの ATM アドレス。
.PP
\fIshow arpserver\fP サブコマンドでパラメータを指定しない場合、
全ネットワークインタフェースに関する ATMARP サーバが表示されます。
インタフェース名を指定すると、
指定したネットワークインタフェースに関する情報のみ表示されます。
.PP
.I atm show IPVCC [<host> | <netif>]
.PP
次の情報を表示します:
.PP
.B Net Intf
\- VCC が終端するネットワークインタフェース名。
.PP
.B VPI
\- VCC の仮想パス識別子 (Virtual Path Identifier; VPI)。
.PP
.B VCI
\- VCC の仮想チャネル識別子 (Virtual Channel Identifier; VCI)。
.PP
.B State
\- VCC の状態。
表示される値は次の通りです:
.in +15
.ti -10
PMAP\ ----\ ホストは送信すべき IP パケットを持っていて、
ATMARP マッピングを待っています。
.ti -10
POPEN\ ---\ VCC はオープンされているところです。
.ti -10
PACCEPT\ -\ リモートホストからの VCC が受理されているところです。
.ti -10
ACTPENT\ -\ PVC はオープンですが、ATMARP 情報はまだ利用できません。
.ti -10
ACTIVE\ --\ VCC はアクティブです。
.in -15
.PP
.B Flags
\- フラグは、VCC に関する更なる情報を表示します。
フラグの文字の意味は次の通りです:
.PP
.in +5
S - VCC は SVC です。
.br
P - VCC は PVC です。
.br
L - VCC は LLC/SNAP カプセル化を使用します。
.br
M - VCC の IP-to-ATM アドレスマッピングは有効です。
.br
N - VCC に関するアイドルタイムアウトはありません。
.in -5
.PP
.B IP Address
\- VCC のリモートエンドのホストの名前と IP アドレス。
.PP
\fIshow IPVCC\fP サブコマンドでパラメータを指定しない場合、
アクティブな VCC すべてが表示されます。
ホスト名を指定すると、指定したホストのアクティブな VCC が表示されます。
ネットワークインタフェース名を指定すると、
指定したネットワークインタフェースのアクティブな VCC が表示されます。
.PP
.SS その他のサブコマンド:
.I atm help
.PP
サブコマンドとパラメータとともに、atm コマンドとの書式を表示します。
.PP
.I atm show version
実行中の HARP ソフトウェアのバージョンを表示します。
.fi
.SH 関連項目
\fIilmid\fP (8); \fIscspd\fP (8); \fIatmarpd\fP (8)
.fi
.SH バグ
物理インタフェースとネットワークインタフェースに混乱しないようにしてください。
.PP
バグは harp-bugs@magic.net に報告してください。
.fi
.SH COPYRIGHT
Copyright (c) 1994-1998, Network Computing Services, Inc.
.fi
.SH 作者
John Cavanaugh, Network Computing Services, Inc.
.br
Mike Spengler, Network Computing Services, Inc.
.br
Joe Thomas, Network Computing Services, Inc.
.fi
.SH 謝辞
本ソフトウェアは、
Defense Advanced Research Projects Agency (DARPA) の協力により開発されました。
.SH 日本語訳
堀川和雄 <horikawa@jp.FreeBSD.org>
