freebsd/freebsd-doc/ja_JP.eucJP/man/man8/atmarpd.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) %FreeBSD: src/usr.sbin/atm/atmarpd/atmarpd.8,v 1.3.2.1 2001/01/18 16:06:05 ru Exp %
.\" jpman %Id: atmarpd.8,v 1.3 1998/12/19 20:11:02 vanitas Stab %
.\"
.\"
.Dd August 04, 1998
.Dt ATMARPD 8
.Os
.Sh 名称
.Nm atmarpd
.Nd "ATMARP/SCSP インタフェースデーモン"
.Sh 書式
.Nm
.Op Fl d
.Op Fl l Aq Ar log_file
.Aq Ar net_intf
.Ar ...
.Sh 解説
.Nm
は、
Host ATM Research Platform (HARP) ネットワーキングソフトウェア用に、
カーネル内の ATMARP サーバと SCSP デーモンとの間のインタフェースを提供します。
.Nm
は ATMARP キャッシュをカーネルから定期的に読み込み、
更新されたエントリを
.Xr scspd 8
に渡すことにより、
リモートサーバに伝播させます。
.Nm
はまた
リモートサーバが
.Xr scspd 8
へ送った更新エントリを受け取り、
新規エントリと、現在のエントリよりも新しいエントリを、
カーネル内の ATMARP キャッシュにインストールします。
ATMARP キャッシュが同期される前に、
.Nm
と
.Xr scspd 8
の両方が走行している必要があります。
.Pp
.Nm
が実行を開始すると、
自己に与えられたコマンドラインを解析し、バックグラウンドに移行します。
.Pp
コマンドラインオプションは次の通りです:
.Bl -tag -width "-l <log_file>"
.It Fl l Aq Ar log_file
ログメッセージをシステムのログではなく
.Aq Ar log_file
という名前のファイルに書き込むように、
.Nm
に指定します。
.It Fl d
.Nm
をデバッグモードで実行することを指定します。
デバッグモードでは、
.Nm
はバックグラウンドにはなりません。
ログメッセージは、
ログファイルではなく、標準出力に書かれます。
.It Aq Ar net_intf
ホストが ATMARP サービスを提供し、
SCSP を使用してキャッシュを同期する
ネットワークインタフェース (複数可) を指定します。
複数のネットワークインタフェース名を指定した場合、
指定した全インタフェース上のサーバのために、
.Nm
は
.Xr scspd 8
に対するインタフェースを提供します。
.El
.Sh シグナル処理
次のシグナルを使用して
.Nm
を制御できます:
.Bl -tag -width indent
.It Dv SIGINT
デバッグ情報をファイルにダンプします。
.Dv SIGINT
を受信すると、
.Nm
は制御ブロックのサマリをテキストファイルにダンプします (
.Sx 関連ファイル
参照)。
.El
.Sh 関連ファイル
.Bl -tag -width indent
.It Xo
.Sm off
.Pa /tmp/atmarpd.
.Aq Ar pid
.IP "/tmp/atmarpd.<pid>.<seq>.out"
.Pa \&.
.Aq Ar seq
.Pa .out
.Sm on
.Xc
デバッグ情報をダンプするファイルの名前です。
.Nm
が
.Dv SIGINT
シグナルを受信すると、
制御ブロックのサマリをこのファイルに書き込みます。
.Aq Ar pid
はデーモンのプロセス ID であり、
.Aq Ar seq
はダンプがとられるごとに増えるシーケンス番号です。
.El
.Sh 関連項目
.Xr atm 8 ,
.Xr scspd 8
.Rs
.%T "Classical IP and ARP over ATM"
.%O "RFC 1577"
.Re
.Rs
.%T "Classical IP and ARP over ATM"
.%O "RFC 2225"
.Re
.Rs
.%T "Server Cache Synchronization Protocol (SCSP)"
.%O "RFC 2334"
.Re
.Rs
.%T "A Distributed ATMARP Service Using SCSP"
.%O "draft\-ietf\-ion\-scsp\-atmarpd\-00.txt"
.Re
.Sh バグ
あるネットワークインタフェースに対し
複数の
.Nm
のインスタンスが同時に実行されると、
予測できない結果となります。
.Pp
バグは
.Aq harp\-bugs@magic.net
に報告してください。
.Sh 著作権
Copyright (c) 1994-1998, Network Computing Services, Inc.
.Sh 作者
.An John Cavanaugh ,
Network Computing Services, Inc.
.An Mike Spengler ,
Network Computing Services, Inc.
.An Joe Thomas ,
Network Computing Services, Inc.
.Sh 謝辞
本ソフトウェアは、
Defense Advanced Research Projects Agency (DARPA) の協力により開発されました。
.Sh 日本語訳
.An 堀川和雄 Aq horikawa@jp.FreeBSD.org
