freebsd/freebsd-doc/ja_JP.eucJP/man/man8/atrun.8
.\" %Id: atrun.man,v 1.1.6.2 1998/07/07 04:49:55 jkoshy Exp %
.\" jpman %Id: atrun.8,v 1.2 1997/04/23 02:43:41 yugawa Stab %
.Dd April 12, 1995
.Dt ATRUN 8
.Os "FreeBSD 2.1"
.Sh 名称
.Nm atrun
.Nd ジョブキューのなかから予定時刻になったものを実行
.Sh 書式
.Nm atrun
.Op Fl l Ar load_avg
.Op Fl d
.Sh 解説
.Nm
コマンドは
.Xr at 1
でキューに入れたジョブを実行するコマンドです。
.Pp
.Xr atrun 8
が5分毎に起動されるようにするために、
root の
.Xr crontab 5
ファイル
.Pa /etc/crontab
に、
.nf
*/5     *       *       *       *       root    /usr/libexec/atrun
.fi
という設定を含めておく必要があります。
.Pp
呼び出しが起きるたびに
.Nm
は、小文字のキューの中のジョブのうち、
実行開始時間を過ぎたものすべてを開始します。
さらに、直前の1分間の負荷平均値(load avarage)が指定した限界値より小さい場合、
優先順位が最も高いバッチジョブ(大文字のキューで表されます)ひとつを
開始します。
.\" 上記の記述はオリジナルの英語版では、"A maximum of one batch jobs (denoted
.\" by uppercase queues) are started each time atrun is invoded." となっている。
.\" この記述だけでは非常にわかりにくいが、at(1) を見ると、バッチジョブには
.\" A 〜 Z のキューがあり、A 〜 Z の順番で nice 値が高くなる(優先度が低くなる)
.\" と書かれている。そこで、実際に試して見ると、同一のキューに登録されたジョブ
.\" は登録された順番に実行されるが、異なるキューに登録されたジョブは登録された
.\" 順番とは関係なく、より nice 値が低い(優先度の高い)ジョブから実行される
.\" ので、上記の記述とした。
.\" 2.2.1-RELEASE 対象
.\" By yugawa@orleans.rim.or.jp (Apr 23 1997)
.\" RELENG22-980710-SNAP(2.2.7 直前)でこの部分の記述は変更されたが、
.\" "A maximum of one batch jobs" の句は依然として残っているので、
.\" この句の訳はそのままにしてある。
.\" By kuma@jp.freebsd.org (Jul 10 1998)
.Sh オプション
.Bl -tag -width indent
.It Fl l Ar load_avg
負荷の上限を指定する。負荷がこの上限を越えている場合、バッチジョブは実行さ
れない。デフォルトの値は 1.5。
.It Fl d
デバッグ用。
.Xr syslog 3
を使う代わりに標準エラー出力にエラーメッセージを吐き出す。
.El
.Sh 警告
.Nm
を動かすためには
.Xr cron 8
デーモンを起動しておかねばなりません。
.Sh 関連ファイル
.Bl -tag -width /var/at/spool -compact
.It Pa /var/at/spool
出力ファイルを保管しておくディレクトリ
.It Pa /var/at/jobs
ジョブファイルを保管しておくディレクトリ
.El
.Sh 関連項目
.Xr at 1 ,
.Xr crontab 1 ,
.Xr syslog 3 ,
.Xr crontab 5 ,
.Xr cron 8
.Sh バグ
.Nm
の機能は
.Xr cron 8 
に統合されるべきです。
