freebsd/freebsd-doc/ja_JP.eucJP/man/man8/badsect.8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)badsect.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/badsect/badsect.8,v 1.21 2004/07/02 21:45:00 ru Exp %
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt BADSECT 8
.Os
.Sh 名称
.Nm badsect
.Nd バッドセクタを含むファイルを作成する
.Sh 書式
.Nm
.Ar bbdir sector ...
.Sh 解説
.Nm
ユーティリティはバッドセクタを含むファイルを作成します。
正規の方法では、バッドセクタは、標準フォーマッタがバッドセクタの
フォワーディングテーブルをドライバに提供する事によって、
アクセス不能にされます。
ドライバがバッドブロッキング標準をサポートしている場合、
この方法を使ってバッドセクタを取り除く方がより望ましい選択です。
何故ならバッドブロックフォワーディングはパックを完全に見せ、
そのようなパックは
.Xr dd 1
でコピー可能だからです。
また
.Nm
で採用しているテクニックはファイルシステムの i-list や
スワップ領域のバッドブロック回復ができないという点で、
バッドブロックフォワーディングと比べて汎用性に欠けます。
.Pp
突然バッドとなったセクタをバッドセクタテーブルに追加するためには、
ディスクによっては現在のところ、
標準の
.Tn DEC
フォーマッタを実行する必要があります。
このため、新たに生じたバッドブロックを扱う場合、
およびドライバがバッドブロッキング標準をサポートしていない場合には、
.Nm
が有効でしょう。
.Pp
.Nm
ユーティリティは、
現在アクセスされていないファイルシステムに対して次のように使用します。
まず、ファイルシステムをマウントし、そのルート
ディレクトリに移動します。ここに
.Li BAD
という名前のディレクトリを作ります。
.Nm
コマンドに、引数として、このディレクトリと追加したいすべて
のバッドセクタを指定して実行します
(セクタ番号はファイルシステムの先頭からの相対で指定しなければなりませんが、
システムがコンソールエラーメッセージに表示するのは相対セクタ番号であるため
難しくはありません)。
その後、ルートディレクトリに移動し、
そのファイルシステムをアンマウントしてから
.Xr fsck 8
を実行します。
バッドセクタは 2 つのファイル、
あるいはバッドセクタファイルとフリーリストとして表示されます。
.Xr fsck 8
に対して、問題を起こしたバッドセクタを含むファイルを削除し、
.Pa BAD/ Ns Em nnnnn
を
.Em 削除しないように
指示してください。
以上の操作によりバッドセクタは
.Li BAD
ファイルにのみにあることになります。
.Pp
.Nm
ユーティリティは
.Xr mknod 2
の引数に指定されたセクタ番号を指定してコールします。
そして、指定したバッドセクタを含むブロックを最初のブロックとし、
バッドセクタ番号をその名前とするイリーガルなファイルを作ります。
.Xr fsck 8
は、このファイルを発見すると
.Dq Li "HOLD BAD BLOCK \&?"
と聞いてきます。
これに対して y と答えると、
.Xr fsck 8
はその inode を、バッドブロックを含む
通常ファイルにコンバートします。
.Sh 関連項目
.Xr fsck 8
.Sh 診断
.Nm
ユーティリティは、
きわどい領域やファイルシステム外のブロックの処理を拒否します。
また、ブロックが既に使用されている場合には警告を表示します。
.Sh バグ
あるファイルシステムフラグメント中の複数のセクタがバッドとなった場合、
そのうちの 1 つだけを
.Nm
で指定しなければなりません。
バッドセクタファイル中のブロックは、
ファイルシステムフラグメント中の全てのセクタをカバーするからです。
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.1
から登場しました。
