freebsd/freebsd-doc/ja_JP.eucJP/man/man8/badsect.8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"    This product includes software developed by the University of
.\"    California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)badsect.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/badsect/badsect.8,v 1.10.2.3 2001/03/05 19:33:37 ru Exp %
.\" jpman %Id: badsect.8,v 1.2 1997/03/31 13:30:12 horikawa Stab %
.\"
.Dd June 5, 1993
.Dt BADSECT 8
.Os BSD 4
.Sh 名称
.Nm badsect
.Nd バッドセクタ上にファイルを作る
.Sh 書式
.Nm
.Ar bbdir sector ...
.Sh 解説
.Nm
はバッドセクタを含むファイルを作成します。
通常のフォーマッタは、バッドセクタをアクセスできないようにします。
このとき、フォーマッタはドライバ用にバッドセクタのフォワーディングテーブルを
作ります。
もしドライバが標準でバッドブロックをサポートしているならば、
バッドブロックを孤立させるためにはその方法を使用すべきです。
なぜならばバッドブロックフォワーディングはパックを完全に見せ、
そのようなパックは
.Xr dd 1
でコピー可能だからです。
本プログラムで採用している方法はバッドブロックフォワーディングよりは
一般的ではありません。
なぜならば
.Nm
はファイルシステムの i-list のバッドブロックを回復することができませんし、
スワップ領域のバッドブロックも回復することができないからです。
.Pp
突然バッドとなったセクタをバッドセクタテーブルに追加するためには、
ディスクによっては現在のところ、
標準の
.Tn DEC
フォーマッタを実行する必要があります。
このため、新たに生じたバッドブロックを扱う場合、
およびドライバがバッドブロッキング標準をサポートしていない場合には、
.Nm
は有効かも知れません。
.Pp
.Nm
は現在アクセスされていないファイルシステムに対して次のように使用します。
.Nm
を使うには、まず、ファイルシステムをマウントし、そのルート
ディレクトリに移動します。ここに
.Li BAD
という名前のディレクトリを作ります。
.Nm
コマンドに、引数として、このディレクトリと追加したいすべて
のバッドセクタを指定して実行します
(セクタ番号はファイルシステムの先頭からの相対で指定しなければなりませんが、
システムがコンソールエラーメッセージに表示するのは相対セクタ番号であるため
難しくはありません)。
その後、ルートディレクトリに移動し、
そのファイルシステムをアンマウントしてから
.Xr fsck 8
を実行します。
fsck はバッドセクタを含むファイルを削除しますが、
.Pa BAD/ Ns Em nnnnn
は削除
.Em しないように
してください。
以上の操作によりバッドセクタは
.Li BAD
ファイルにのみにあることになります。
.Pp
.Nm
は
.Xr mknod 2
の引数にセクタ番号を指定してコールすることで、
最初のブロックが指定したバッドセクタを含んだ特別なファイルを作ります。
このファイルの名前はバッドセクタの番号です。
.Xr fsck 8
は、このファイルを発見すると
.Dq Li "HOLD BAD BLOCK \&?"
と聞いてきます。
これに対して y と答えると、
.Xr fsck 8
はその inode を、バッドブロックを含む
通常ファイルにコンバートします。
.Sh 関連項目
.Xr fsck 8
.Sh 診断
.Nm
は、危険な領域のブロックやファイルシステム外のブロックを追加しません。
また、ブロックが既に使用されている場合には警告を表示します。
.Sh バグ
あるファイルシステムフラグメント中の複数のセクタがバッドとなった場合、
そのうちの 1 つだけを
.Nm
に指定しなければなりません。
バッドセクタファイル中のブロックは、
ファイルシステムフラグメント中の全てのセクタをカバーするからです。
.Sh 歴史
.Nm
コマンドは
.Bx 4.1
から登場しました。
