freebsd/freebsd-doc/ja_JP.eucJP/man/man8/boot_i386.8
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software written and contributed
.\" to Berkeley by William Jolitz.
.\"
.\" Almost completely rewritten for FreeBSD 2.1 by Joerg Wunsch.
.\"
.\" Substantially revised for FreeBSD 3.1 by Robert Nordier.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_i386.8	8.2 (Berkeley) 4/19/94
.\" %FreeBSD: src/sbin/reboot/boot_i386.8,v 1.16.2.6 1999/10/15 12:52:02 phantom Exp %
.\"
.\" jpman %Id: boot_i386.8,v 1.5 1997/12/04 18:33:50 ken Exp %
.\"
.\"
.Dd April 19, 1994
.Dt BOOT 8 i386
.Os
.Sh 名称
.Nm boot
.Nd
システム立上げ時の手続き
.Sh 解説
.Sy 電源断とクラッシュからの回復。
通常、電源復旧時とクラッシュ発生後には、システムは自動的にリブートし
ます。ファイルシステムの整合性チェックが自動実行され、途中で失敗しな
ければ、システムはマルチユーザ・モードに移行します。
.Pp
.Sy コールドスタート。
大多数の i386 PC
は、まずフロッピドライブ 0 (ドライブ A: ともいう) からのブートを試み、
それに失敗すると、
ハードディスクドライブ 0 (ドライブ C: もしくは BIOS のドライブ 0x80 ともいう)
からブートしようとします。いくつかの BIOS では、この
デフォルトの順序を変えたり、CD-ROM デバイスをブートデバイスとして
含めることができます。
.Pp
デフォルトでは 3 段階のブートストラップが使用され、
ブートブロック (ブートストラップの 第 1 および 第 2 段階) から、
これとは別の第 3 段階のブートストラッププログラム
.Xr loader 8
へと自動的に制御が移行されます。
この第 3 段階では、
ブート処理において、
ブートブロックにおいて可能なことよりも洗練された制御を提供します。
ブートブロックには、
ディスクやスライスの限られた空間しか与えられないという制約があります。
.Pp
しかしながら、第 3 段階をまったく使用せずに済ますこともできます。
このようにするには、ブートブロックパラメータファイル
.Pa /boot.config
においてカーネル名を指定するか、
.Xr loader 8
が起動される前の短い待ち時間 (文字
.Dv - ,
.Dv \e ,
.Dv \&| ,
.Dv /
のいずれかが表示されている間) にキーを打ちます。
第 3 段階をロードできない場合にも、第 2 段階においてブートが試みられます。
.Pp
本サブセクションの残りの部分では、ブートブロックについてのみ扱います。
.Pa loader
プログラムの文書は別にあります。
.Pp
ブートブロックがロードされたあとで、次のようなプロンプトが現れます。
.Bd -literal
>> FreeBSD/i386 BOOT
Default: 0:wd(0,a)/kernel
boot:
.Ed
.Pp
自動ブートにおいては、フロッピ
もしくはハードディスクのパーティション
.Ql a
から
.Pa /kernel
をロードしようとします。
この動作は 
.Ql boot:
というプロンプトが出ている間なら、キーボードから適当な文字を入力する
ことで中断できます。以下にあげるような入力はブート動作に対する指示と
して受付けられます。
.Bl -tag -width 10x
.It \&?
ブートファイルを探す際のヒントとして、デフォルトのブートデバイスの
ルートディレクトリにあるファイルの名前を表示します。
(パスの最後の部分に
.Dv \&?
を指定することもできます。この場合、任意のサブディレクトリの一覧となります。)
.Pp
.It bios_drive:interface(unit,part) filename Op Fl aCcDdghPrsv
ブートファイルとブートフラグを指定します。
.Bl -tag -width 10x -compact
.It bios_drive
BIOS によって認識されるドライブ番号です。 1 つ目のドライブに対しては 
0 、 2 つ目のドライブに対しては 1 、などです。
.It interface
そこからブートするコントローラのタイプです。ブートファイルのイメージ
をロードするのには BIOS の機能を使用するので、そのコントローラに対す
る BIOS サポートが必要となることに注意して下さい。
.Pp
サポートされているインタフェースを以下にあげます。
.Bl -tag -width "wdXX" -compact
.It wd
WD100[2367] とその互換コントローラ上の ST506, IDE, ESDI, RLL ディスク
.It fd
5 1/4" または 3 1/2" 高密度 フロッピ
.It da
サポートされている SCSI コントローラ上の SCSI ディスク
.\".It cd
.\"CDROM からのブート
.El
.It unit
使用されているインタフェース上のドライブのユニット番号です。 1 つ
目のドライブに対しては 0 、 2 つ目のドライブに対しては 1 、などです。
.It part
ディスク上の BSD 部分内のパーティション文字です。詳しくは
.Xr disklabel 8  
を参照して下さい。慣例として、パーティション
.Ql a
のみが ブート可能なイメージを含んでいます。ディスクにスライス
.Pq Dq fdisk  パーティション
か設けられていた場合、任意のスライスからブート可能です。
デフォルトでは、アクティブスライスから、
これがない場合は最初の
.Fx
スライスからのブートとなります。
.It filename
ブートファイルの (指定されたパーティションのルートディレクトリからの
相対) パス名です。デフォルトでは
.Pa /kernel 
となります。シンボリックリンクはサポートされていません (ハードリンク
は使用できます)。
.It Fl acCdDghPrsv
ブートフラグです。
.Bl -tag -width "-CXX" -compact
.It Fl a
カーネル初期化中に、ルートファイルシステムとしてマウントされるデバイスを
尋ねて来るようにします。
.It Fl C
CDROM からブートします。
.It Fl c
ロードしたカーネルに対し、ハードウェアのパラメータを変更するため、 
UserConfig を実行します。
USERCONFIG, INTRO_USERCONFIG, VISUAL_USERCONFIG
のいずれかのオプション付きでカーネルが構築された場合、
スクリプト中に
.Ic quit
コマンドがあったとしても、UserConfig 中にとどまります。
.It Fl D
シングルとデュアルのコンソール設定を切り替えます。シングル設定では、
下記の
.Fl h
オプションの状態によって、コンソールは内部ディスプレイかシリアルポートの
いずれかになります。デュアルコンソール設定では、内部ディスプレイ
とシリアルポートの両方が、
.Fl h
オプションの状態によらず、同時にコンソールになります。しかし、
デュアルコンソール設定は、ブートプロンプトの間だけでしか効果を持ちません。
一旦カーネルがロードされると、
.Fl h
オプションによって指定されたコンソールが唯一のコンソールになります。
.It Fl d
カーネルの初期化のできる限り早い段階で DDB カーネルデバッガ
.Pq Xr ddb 4 を参照
に入ります。
.It Fl g
GDB リモートデバッギングプロトコルを使用します。
.It Fl h
内部コンソールとシリアルコンソールの切替えを行います。これを使用して
コンソールデバイスを変更できます。例えば、内部コンソールからブートし
た場合、カーネルがコンソールデバイスとしてシリアルポートを使用するよ
うにするため、
.Fl h
オプションを使用できます。反対に、シリアルポートからブートした場合、
カーネルがコンソールとして代わりに内部ディスプレイを使用するようにす
るため、このオプションを使用できます。
シリアルポートドライバ
.Xr sio 4
には、このオプションに優先するフラグがあります。
そのフラグが設定されると、ここで記述した
.Fl h
オプションとは無関係に、シリアルポートが常にコンソールとして使用されます。
更なる詳細については、マニュアルページ
.Xr sio 4 
を参照してください。
.It Fl P
キーボードを検出します。キーボードが発見できなかった場合には、
.Fl D
と
.Fl h
オプションが自動的にセットされます。
.It Fl r
ルートファイルシステムを含むデバイスとしてスタティックに config され
たデフォルトを使用します
.Pq Xr config 8 を参照
。
.It Fl s
シングルユーザ・モードで立上がるようになります。コンソールが
.Dq insecure
.Pq Xr ttys 5 を参照
に設定されていた場合には、root のパスワードを入力しなければなり
ません。
.It Fl v
デバイス検出の際 (そしてその後も) 、詳細を出力します。
.El
.El
.El
.Pp
デフォルトを設定するため、BIOS ドライブ番号, コントローラタイプ, 
ユニット番号, パーティション, カーネルファイル名と
有効なオプションを
.Pa /boot.config
に書くこともできます。
.Ql boot:
プロンプトでタイプするように、 1 行で書いてください。
.Sh 関連ファイル
.Bl -tag -width /kernel.old.config -compact
.It Pa /boot.config
ブートブロックに対するパラメータ (必須ではない)
.It Pa /boot/boot1
第 1 段階のブートストラップ
.It Pa /boot/boot2
第 2 段階のブートストラップ
.It Pa /boot/loader
第 3 段階のブートストラップ
.It Pa /kernel
デフォルトカーネル
.It Pa /kernel.old
普通は非デフォルトカーネル (必須ではない)
.El
.Sh 関連項目
.Xr ddb 4 ,
.Xr ttys 5 ,
.Xr btxld 8 ,
.Xr config 8 ,
.Xr disklabel 8 ,
.Xr halt 8 ,
.Xr loader 8 ,
.Xr reboot 8 ,
.Xr shutdown 8
.Sh 診断
ディスク関連のエラーが発生すると、
第 2 段階のブートストラップがエラーを報告します。
BUOS が返すものと同じエラーコードを使用し、
例えば
.Dq Disk error 0x1 (lba=0x12345678)
などと報告します。
エラーコードの一部のリストを示します:
.Bl -tag -width "0x80" -compat
.It 0x1
不正な引数
.It 0x2
アドレスマークが見付かりません
.It 0x4
セクタが見付かりません
.It 0x8
DMA オーバラン
.It 0x9
64K 境界を越えて DMA を試みました
.It 0xc
不正なメディア
.It 0x10
訂正できない CRC/ECC エラー
.It 0x20
コントローラの異常
.It 0x40
シークの失敗
.It 0x80
タイムアウト
.El
.Pp
重要な注釈:
BIOS が提供する伝統的なディスクインタフェースの制約のため、
ブートフェーズにアクセスされるブート関連の全ファイルと構造
(カーネルを含みます) は、ディスク上で
(BIOS が理解するジオメトリにおいて)
シリンダ 1023 以下に置かれることが必要です。
第 2 段階のブートストラップが
.Dq Disk error 0x1
を報告する場合、通常はこの条件が満されていないことを意味します。
.Sh バグ
このバージョンの
.Bx
で使用されているディスクラベルのフォーマットは、他のアーキテクチャで
使用されている物とは全く異なっています。
.Pp
空間の制約により、
.Fl P
オプションにより起動されるキーボード検出は、BIOS が
.Dq 拡張
キーボードを検出したかを単にテストするだけです。
.Dq XT/AT
キーボード (F11, F12 キーなどを持ちません) を接続した場合、
検出は失敗します。
.Pp
まだ記述されていない機能があります。
