freebsd/freebsd-doc/ja_JP.eucJP/man/man8/bootpef.8
.\" %FreeBSD: src/libexec/bootpd/tools/bootpef/bootpef.8,v 1.4 2002/07/06 19:18:38 charnier Exp %
.\"
.\" bootpef.8
.\" $FreeBSD$
.Dd December 4, 1993
.Dt BOOTPEF 8
.Os
.Sh 名称
.Nm bootpef
.Nd "BOOTP エクステンションファイルコンパイラ"
.Sh 書式
.Bk -words
.Nm
.Op Fl c Ar chdir\-path
.Op Fl d Ar debug\-level
.Op Fl f Ar config\-file
.Op Ar client\-name ...
.Ek
.Sh 解説
.Nm
ユーティリティは、
.%T "RFC 1497"
(tag 18) で示されている
.Em エクステンションパス
ファイルを作成します。
.Ar client\-name
が指定されていれば、
.Nm
はそれらのクライアントのためだけのエクステンションファイルを
コンパイルします。
.Sh オプション
.Bl -tag -width indent
.It Fl c Ar chdir\-path
.Nm
がエクステンションファイルを作るカレントディレクトリを指定します。
これは、エクステンションファイル名が相対パスで指定され、
.Nm
が TFTP サーバと同じカレントディレクトリ (一般には
.Pa /tftpboot )
を使う
必要がある場合に有効です。
.It Fl d Ar debug\-level
生成されるデバッグメッセージの量を制御する変数
.Ar debug\-level
を設定します。たとえば、
.Fl d Ar 4
はデバッグレベルを 4 にセットします。
.It Fl f Ar config\-file
各クライアントに送られるオプションデータを指示する
設定ファイルの名前を設定します。
.El
.Sh 関連項目
.Xr bootpd 8 ,
.Xr tftpd 8
.Rs
.%O RFC951
.%T "BOOTSTRAP PROTOCOL (BOOTP)"
.Re
.Rs
.%O RFC1497
.%T "BOOTP Vendor Information Extensions"
.Re
