freebsd/freebsd-doc/ja_JP.eucJP/man/man8/bootparamd.8
.\" @(#)bootparamd.8
.\" %FreeBSD: src/usr.sbin/bootparamd/bootparamd/bootparamd.8,v 1.6.2.1 2000/03/06 11:35:41 sheldonh Exp %
.\"
.\" jpman %Id: bootparamd.8,v 1.3 1997/07/26 21:54:02 horikawa Stab %
.Dd November 8, 1989
.Dt BOOTPARAMD 8
.Os
.Sh 名称
.Nm bootparamd
.Nd ブートパラメータサーバ
.Sh 書式
.Nm
.Op Fl ds
.Op Fl r Ar router
.Op Fl f Ar file
.Sh 解説
.Nm bootparamd
は、ディスクレスクライアントの起動時に必要な情報を提供するサーバプロセスです。
.Pa /etc/bootparams
ファイルの内容を参照します。
.Pp
このバージョンでは
.Pa /etc/bootparams
ファイルにおいてホストの別名を使う事ができます。
起動中のクライアントが発行した whoami リクエストに対し返されるホスト名は
.Pa /etc/bootparams
中の名前であり、正式名ではありません。
この方法により、長いホスト名を扱う事のできないマシンに対しても、
起動に失敗する事の無い短い名前を答える事ができます。
.Sh オプション
.Bl -tag -width Fl
.It Fl d
デバッグ情報を出力します。
.It Fl s
デバッグ情報を syslog にて記録します。
.It Fl r Ar router
デフォルトルータを、ホスト名もしくは IP アドレスで指定します。
無指定時のデフォルトルータはサーバが動作しているマシンになります。
.It Fl f Ar file
.Pa /etc/bootparams
の代わりに使用するブートパラメータファイル名を指定します。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/bootparams -compact
.It /etc/bootparams
.El
.Sh バグ
syslog への出力情報が多少冗長すぎるかもしれません。
.Sh 作者
.An Klas Heggemann Aq klas@nada.kth.se
が作成しました。
