freebsd/freebsd-doc/ja_JP.eucJP/man/man8/bootptest.8
.\" %FreeBSD: src/libexec/bootpd/tools/bootptest/bootptest.8,v 1.2 1999/08/28 23:08:16 mpp Exp %
.\"
.\" bootptest.8
.\" jpman %Id: bootptest.8,v 1.3 1997/10/11 07:41:11 horikawa Stab %
.TH BOOTPTEST 8 "10 June 1993" "MAINTENANCE COMMANDS"
.SH 名称
bootptest \- BOOTP に質問を送り、応答を出力する
.SH 書式
.LP
.B bootptest
[
.B \-f
.I bootfile
]
[
.B \-h
]
[
.B \-m
.I magic_number
]
.I server\-name
.RI [ template-file ]
.SH 解説
.B bootptest
は、BOOTP リクエストを
.I server\-name
で指定されたホストに送ります。このとき、応答が得られるか、10 個の
リクエストが無応答に終わるまで 1 秒間隔で連続してリクエストを送信します。
応答を受けとると、
.B bootptest
は追加の応答を得るためにもう 1 秒待ちます。
.SH オプション
.TP
.B \-f
.I bootfile
リクエストのブートファイルフィールドを 
.IR bootfile
で埋めます。
.TP
.B \-h
クライアントの識別にハードウェア (Ethernet) アドレスを用います。
デフォルトでは、クライアントがすでにその IP アドレスを知っていると
いうことを示すようにリクエスト内に IP アドレスがコピーされます。
.TP
.B \-m
.I magic-number
ベンダオプションフィールドの第 1 ワードを
.IR magic-number
で初期化します。
.LP
.I template-file
が指定されると、 
.B bootptest
はリクエストパケットのオプションエリアを初期化するために
このファイルの内容(バイナリデータ)を使用します。
.SH クレジット
.LP
bootptest プログラムは独自の創作物と創作派生物の組み合わせです。
メインプログラムモジュール (bootptest.c) は
Gordon W. Ross <gwr@mc.com> 独自の創作物です。
パケット表示モジュール (print-bootp.c) は BSD の tcpdump プログラム
から持ってきたファイルを一部変更したものです。
.LP
このプログラムは
University of California、
Lawrence Berkeley Laboratory と
その貢献者により開発されたソフトウェアを含んでいます。
(print-bootp.c の著作権表示を参照のこと)
.SH 関連項目
.LP
bootpd(8)
.SH リファレンス
.TP
RFC951
BOOTSTRAP PROTOCOL (BOOTP)
.TP
RFC1048
BOOTP Vendor Information Extensions
