freebsd/freebsd-doc/ja_JP.eucJP/man/man8/bootpd.8
.\" Copyright (c) 1988, 1989, 1991 Carnegie Mellon University
.\"
.\"	%Header: /home/ncvs/src/libexec/bootpd/bootpd.8,v 1.4.2.6 1998/06/03 04:35:16 jkoshy Exp %
.\" jpman %Id: bootpd.8,v 1.4 1997/10/11 07:39:12 horikawa Stab %
.\"
.TH BOOTPD 8 "November 06, 1993" "Carnegie Mellon University"
.SH 名称
bootpd, bootpgw \- インターネットブートプロトコルサーバ/ゲートウェイ
.SH 書式
.B bootpd
[
.B \-i
.B \-s
.B \-t
timeout
.B \-d
level
.B \-c
chdir\-path
]
[
.I bootptab
[
.I dumpfile
] ]
.br
.B bootpgw
[
.B \-i
.B \-s
.B \-t
timeout
.B \-d
level
] server
.SH 解説
.I bootpd
は RFC951, RFC1532, RFC1533 で定義された
インターネットブートプロトコル (BOOTP) サーバを実装したものです。
.I bootpgw
は、要求と応答を、あるサブネット上のクライアントと、
別のサブネット上の BOOTP サーバ (すなわち
.IR bootpd
) との間で転送するのに使われる、単純な BOOTP ゲートウェイを実装しています。
.I bootpd
または
.I bootpgw
は BOOTREPLY パケットを転送しますが、
.I bootpgw
だけが BOOTREQUEST パケットを転送します。
.PP
各々のネットワークセグメントにつき、通常一つのホストで、
以下の行のどれかをファイル
.IR /etc/inetd.conf
に含めることにより、
.I bootpd
あるいは
.I bootpgw
が
.I inetd
から起動されるように設定されます:
.IP
bootps dgram udp wait root /usr/libexec/bootpd bootpd /etc/bootptab
.br
bootps dgram udp wait root /usr/libexec/bootpgw bootpgw server
.PP
この動作モードは「inetd モード」と呼ばれ、
ブート要求が到着した時にだけ
.I bootpd
(あるいは
.IR bootpgw
) を開始します。
もし最後にパケットを受信してから 15 分以内に別のパケットを受信しないのなら、
システムの資源を浪費しないように終了します。
.B \-t
オプションがこのタイムアウト時間を制御します (オプション参照)。
.PP
他の通常のコマンドのように単にシェルから起動することで、
.I bootpd
(あるいは
.IR bootpgw
) を「スタンドアローンモード」(
.IR inetd
なし) で実行することも可能です。
.I bootpd
が大きなコンフィギュレーションデータベースのもとで使われる時には、
inetd モードでの起動時の遅延が
クライアントの要求に対する素早い応答を妨げるので、
スタンドアローンモードは特に役に立ちます。
(例えば
.IR /etc/rc.local
から
.I bootpd
を呼びだすことによって、
スタンドアローンモードで自動的に起動することができます)
.I bootpgw
は設定ファイルを読まないので、
起動時の遅延はかなり小さく、
スタンドアローンモードはあまり役に立ちません。
.PP
どちらのプログラムも、inetd から呼び出されたかシェルから呼び出されたかを
自動的に検出し、自動的に適当なモードを選択します。
.B \-s
と
.B \-i
オプションは各々、スタンドアローンモードと inetd モードを強制するのに
使います (オプション参照)
.SH オプション
.TP
.BI \-t \ timeout
.I bootpd
あるいは
.I bootpgw
プロセスが終了する前に BOOTP パケットを待つ
.I timeout
値 (分単位) を指定します。
もし
.I timeout
分内にパケットを受信しなければ、プログラムは終了します。
timeout の値が 0 の場合は「永遠に実行する」という意味です。
スタンドアローンモードでは、このオプションは 0 に強制されます。
.TP
.BI \-d \ debug\-level
生成されるデバッグメッセージの量を制御する変数
.I debug\-level
を設定します。
例えば、-d4 あるいは -d 4 では、デバッグレベルが 4 に設定されます。
古いバージョンの
.IR bootpd
との互換性のため、数字のパラメータを省略 (つまり、-d だけ) すると
単にデバッグレベルを一つだけ増加させます。
.TP
.BI \-c \ chdir\-path
クライアントのブートファイルの存在とサイズを検査する間に
.I bootpd
で使われるカレントディレクトリを設定します。
クライアントのブートファイルが相対パス名で指定されていて、
.I bootpd
が TFTP サーバと同じカレントディレクトリ (典型的には /tftpboot)
を必要とするときに有用です。
このオプションは
.IR bootpgw
によっては認識されません。
.TP
.B \-i
強制的に inetd モードにします。
このオプションは時代遅れですが、古いバージョンの
.IR bootpd
との互換性のために残してあります。
.TP
.B \-s
強制的にスタンドアローンモードにします。
このオプションは時代遅れですが、
古いバージョンの
.IR bootpd
との互換性のために残してあります。
.TP
.I bootptab
.I bootpd
がロードする
設定ファイルの名前を指定します (
.RI bootpd
のみ)。
これはあらかじめ知っているクライアントと
そのクライアントのオプションに関するデータベースです。
.TP
.I dumpfile
.I bootpd
が、SIGUSR1 シグナルを受信したときに
内部データベースをダンプするファイルの名前を指定します (
.RI bootpd
のみ)。
このオプションは
.I bootpd
が -DDEBUG フラグ付きでコンパイルされたときだけ認識されます。
.TP
.I server
.I bootpgw
が受信した全ての BOOTREQUEST パケットを転送する、
BOOTP サーバの名前を指定します (
.RI bootpgw
のみ)。
.SH 操作
.PP
.I bootps
ポートに送られたどんなパケットも取り込んで
どんな BOOTREPLY パケットも単純に転送するという点で
.I bootpd
と
.I bootpgw
の双方が似た動きをします。
BOOTREQUEST の扱いは違います。
.PP
.I bootpgw
は動作開始時に、コマンド行パラメタとして名前を与えられた
BOOTP サーバのアドレスを決めます。
.I bootpgw
が BOOTREQUEST パケットを受信したとき、
パケットの「ゲートウェイアドレス」と「ホップ数」フィールドを設定し、
パケットを前に決めたアドレスの BOOT サーバへ転送します。
要求パケットは、
クライアントが少くとも 3 秒は待っているとパケットが示している時にだけ
転送されます。
.PP
.I bootpd
は動作開始時に設定ファイル (通常
.IR /etc/bootptab
) を読みこみます。
これで、あらかじめ知っているクライアントと
クライアントのオプションに関する内部データベースを初期化します。
この内部データベースは、
.I bootpd
が回線切断シグナル (SIGHUP) を受信したとき、
または設定ファイルが変更されたことを
発見したときに、再読み込みが行なわれます。
.PP
.I bootpd
が BOOTREQUEST パケットを受信したとき、
クライアントの要求に一致するデータベースエントリを探します。
もしそのクライアントをあらかじめ知っていれば
.I bootpd
は前に見付けたデータベースエントリを使って BOOTREPLY パケットを構成し、
(ひょっとしたらゲートウェイを使って) クライアントに返答を送ります。
もしクライアントが未知ならば、(debug > 0 のときは注意を出して)
要求は捨てられます。
.PP
.I bootpd
が -DDEBUG オプションでコンパイルされていれば、
SIGUSR1 シグナルを送ると内部データベースをファイル
.I /tmp/bootpd.dump
か、コマンド行パラメータで指定されたダンプファイルに
にダンプします。
.PP
初期化の時どちらのプログラムも、
(普通は
.IR /etc/services
を使う)
.I getservbyname
を呼ぶことで UDP ポート番号を決定します。
二つのサービス名 (とポート番号) が使われます:
.IP
bootps \- BOOTP サーバ待機ポート
.br
bootpc \- BOOTP クライアント届け先ポート
.LP
もしポート番号が
.I getservbyname
を使って決定できないときには、
デフォルト値は bootps=67 と bootpc=68 です。
.SH 関連ファイル
.TP 20
/etc/bootptab
.IR bootpd
によって読み込まれるデータベースファイル。
.TP
/tmp/bootpd.dump
.IR bootpd
によって生成されるデバッグダンプファイル。
.TP
/etc/services
インターネットサービス番号。
.TP
/tftpboot
TFTP サーバと
.IR bootpd
で使われる典型的カレントディレクトリ。

.SH バグ
各々のホストエントリは 1024 文字を越えてはいけません。

.SH 功労者
.PP
この配布版は現在、 Walter L. Wimer <walt+@cmu.edu> によって
保守されています。
.PP
オリジナルの BOOTP サーバは
スタンフォード大学の Bill Croft によって 1986 年 1 月に作成されました。
.PP
現在のバージョンの
.I bootpd
は第一に、Carnegie Mellon University の David Kovar,
Drew D. Perkins, Walter L. Wimer の仕事にるものです。
.TP
機能拡張とバグフィクスは以下の方の貢献によります:
(アルファベット順)
.br
Danny Backx <db@sunbim.be>
.br
John Brezak <brezak@ch.hp.com>
.br
Frank da Cruz <fdc@cc.columbia.edu>
.br
David R. Linn <drl@vuse.vanderbilt.edu>
.br
Jim McKim <mckim@lerc.nasa.gov>
.br
Gordon W. Ross <gwr@mc.com>
.br
Jason Zions <jazz@hal.com>
.SH 関連項目
.LP
bootptab(5), inetd(8), tftpd(8)
.LP
DARPA Internet Request For Comments:
.TP 10
RFC951
Bootstrap Protocol
.TP 10
RFC1532
Clarifications and Extensions for the Bootstrap Protocol
.TP 10
RFC1533
DHCP Options and BOOTP Vendor Extensions
