freebsd/freebsd-doc/ja_JP.eucJP/man/man8/bootpef.8
.\" %FreeBSD: src/libexec/bootpd/tools/bootpef/bootpef.8,v 1.2 1999/08/28 23:08:11 mpp Exp %
.\"
.\" bootpef.8
.\" jpman %Id: bootpef.8,v 1.2 1997/05/17 16:59:57 horikawa Stab %
.TH BOOTPEF 8 "4 Dec 1993" "MAINTENANCE COMMANDS"
.SH 名称
bootpef \- BOOTP エクステンションファイルコンパイラ
.SH 書式
.LP
.B bootpef
.RI [ "-c chdir" ]
.RI [ "-d debug-level" ]
.RI [ "-f config-file" ]
.RI [ client-name " [...]]"
.SH 解説
.B bootpef
は、RFC 1497 (tag 18) で示されている
.I エクステンションパス
ファイルを作成します。
.I client-name
が指定されていれば、
.I bootpef
はそれらのクライアントのためだけのエクステンションファイルを
コンパイルします。
.SH オプション
.TP
.BI \-c \ chdir\-path
.I bootpef
がエクステンションファイルを作るカレントディレクトリを指定します。
これは、エクステンションファイル名が相対パスで指定され、
.I bootpef
が TFTP サーバと同じカレントディレクトリ (一般には /tftpboot) を使う
必要がある場合に有効です。
.TP
.BI \-d \ debug\-level
生成されるデバッグメッセージの量を制御する変数
.I debug\-level
を設定します。たとえば、-d4 や -d 4 はデバッグレベルを 4 にセットします。
.TP
.BI \-f \ config\-file
各クライアントに送られるオプションデータを指示する
設定ファイルの名前を設定します。
.SH 関連項目
bootpd(8), tftpd(8)
.SH リファレンス
.TP
RFC951
BOOTSTRAP PROTOCOL (BOOTP)
.TP
RFC1497
BOOTP Vendor Information Extensions
