freebsd/freebsd-doc/ja_JP.eucJP/man/man8/btxld.8
.\" Copyright (c) 1998 Robert Nordier
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
.\" OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
.\" OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
.\" EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/btxld/btxld.8,v 1.2.2.1 2000/12/08 15:27:58 ru Exp %
.\" $FreeBSD$
.\"
.Dd September 12, 1998
.Dt BTXLD 8
.Os
.Sh "名称"
.Nm btxld
.Nd BTX クライアント用リンクエディタ
.Sh "書式"
.Nm
.Op Fl qv
.Op Fl b Ar file
.Op Fl E Ar address
.Op Fl e Ar address
.Op Fl f Ar format
.Op Fl l Ar file
.Op Fl o Ar filename
.Op Fl P Ar page
.Op Fl W Ar page
.Ar file
.Sh "解説"
.Nm
ユーティリティは、指定したクライアント実行形式ファイルを、
BTX ローダプログラム、BTX カーネルとともに結合して、ブート時にロード
するのに適した複合オブジェクトファイルを生成します。
.Pp
オプションは以下のとおりです。
.Bl -tag -width indent
.It Fl q
Quiet: 警告メッセージの出力を抑止します。
.It Fl v
Verbose: 処理されるファイルに関する情報を表示します。
.It Fl b Ar file
クライアントとともに結合する BTX カーネルを指定します。
.It Fl E Ar address
クライアントのエントリポイントを設定します。
.It Fl e Ar address
BTX ローダのエントリポイントを設定します。
.It Fl f Ar format
出力形式を指定します。ここで、
.Ar format
は
.Sq bin ,
.Sq aout ,
.Sq elf
のうちのいずれかです。
.It Fl l Ar file
クライアントと結合させる BTX ローダを指定します。
.It Fl o Ar filename
出力ファイル名を指定します。デフォルトは、
.Dq a.out
です。
.It Fl P Ar page
クライアントのセグメントで、
.Sq present
とマークすべき最初のページを指定します。ここで、
.Ar page
は 0 か 1 のいずれかです。
.It Fl W Ar page
クライアントのセグメントで、
.Sq writable
とマークすべき最初のページを指定します。ここで、
.Ar page
は 0 も指定可能ですが、クライアントイメージの .text セグメント
と .data セグメントを結合したものが占めるページ数を越えてはいけません。
.El
.Sh "関連項目"
.Xr ld 1 ,
.Xr boot 8
.Sh "診断"
終了ステータスが 0 ならば成功で、>0 ならばエラーです。
.Sh "作者"
.An Robert Nordier Aq rnordier@FreeBSD.org
