freebsd/freebsd-doc/ja_JP.eucJP/man/man8/burncd.8
.\"
.\" Copyright (c) 2000,2001,2002 S��en Schmidt <sos@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer,
.\"    without modification, immediately at the beginning of the file.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/burncd/burncd.8,v 1.24 2002/12/12 17:26:01 ru Exp %
.\" $FreeBSD$
.\".
.Dd October 18, 2002
.Os
.Dt BURNCD 8
.Sh 名称
.Nm burncd
.Nd ATAPI CD-R/RW ドライバの制御
.Sh 書式
.Nm
.Op Fl delmnpqtv
.Op Fl f Ar device
.Op Fl s Ar speed
.Op Ar command
.Op Ar command Ar
.Sh 解説
.Nm
ユーティリティは ATAPI cd ドライバを用いて CD-R/RW メディアを
焼きつけるために使用されます。
.Pp
利用可能なオプションとオペランド:
.Pp
.Bl -tag -width XXXXXXXXXXXX
.It Fl d
DAO (ディスクアットワンス) モードで CD-R/RW を焼きます。
.It Fl e
終了時にメディアを排出します。
.It Fl f Ar device
焼きつけ過程において使用するデバイスを設定します。
.It Fl F
警告にかかわらず操作を強行します。
.It Fl l
指定したファイルから、イメージファイルの一覧を読み取ります。
.It Fl m
マルチセッションモードのディスクを閉じます
(指定しない場合には、シングルセッションとしてディスクを閉じます)。
.It Fl n
DAO モードにおいて、データトラック間にギャップを書き込みません。
.It Fl p
オーディオトラックに対して高域補正を行います。
.It Fl q
静かにします。進捗状況を出力しません。
.It Fl s Ar speed
焼きつけデバイスの速さを設定します。
デフォルトは 1 に設定されます。
ドライブの最高速度を指定するために
.Dq Li max
を指定してください。
.It Fl t
書き込みテストを行います。メディアに対して
実際に書き込みは行いません。
.It Fl v
冗長になり、追加の進捗メッセージを表示します。
.El
.Pp
.Ar command
は以下のどれか一つになります。
.Pp
.Bl -tag -width XXXXXXXXXXXX
.It Cm msinfo
メディア上の最後のトラックの最初の LBA と、
メディア上の次に書き込み可能なアドレスを表示します。
これは、
追加セッション付の ISO ファイルシステムに追加データを追記するときに、
.Xr mkisofs 8
の
.Fl C
スイッチで使用します。
.It Cm blank
CD-RW メディアを消去します。
高速な消去方法を使用するため、データは物理的には上書きされず、
後で使う際にメディアが空である事を示す領域のみ上書きします。
.It Cm erase
CD-RW メディアを消去します。
メディア全体を消去します。
完了までに 1 時間かかることもあります。
.It Cm format dwd+rw
DVD+RW メディアを、デフォルトの最大サイズで 2048 バイトブロックで、
フォーマットします。
この操作は長時間を要し得ます。
処理中に進捗報告がなされます。
.It Cm fixate
TOC が作成されメディアが普通の CD ドライブで使用できるように
メディアを固定します。
ドライバはデフォルトではシングルセッションメディアを作成します (
.Fl m
を参照してください)。
このコマンドが終了した時にプログラムが終了するように
.Nm
に渡される最後のコマンドとしてください。
DAO モードでは無視されます (
.Fl d
オプションを参照してください)。
.It Cm raw | audio
コマンドラインで続いて指定されるイメージファイルを
オーディオ (raw mode) トラックとして処理するように
書き込みモードを設定します。
.It Cm data | mode1
コマンドラインで続いて指定されるイメージファイルを
データ (mode1) トラックとして処理するように
書き込みモードを設定します。
.It Cm mode2
コマンドラインで後続するイメージファイルに対し、
書き込みモードがデータ (mode2) トラックを生成するようにします。
.It Cm XAmode1
コマンドラインで後続するイメージファイルに対し、
書き込みモードがデータ (XAmode1) トラックを生成するようにします。
.It Cm XAmode2
コマンドラインで後続するイメージファイルに対し、
書き込みモードがデータ (XAmode2) トラックを生成するようにします。
.It Cm vcd
コマンドラインで後続するイメージファイルに対し、
書き込みモードが VCD/SVCD トラックを生成するようにします。
これは、自動的に DAO
.Pq Fl d
と
.Dq ギャップ無し
.Pq Fl n
モードを設定します。
.It Cm dvdrw
後続するイメージから DVD+RW を書き込むモードに設定します。
DVD は単一トラックのみを持ちます。
.It Ar file
他の全ての引数はメディアに書き込むためのイメージファイルとして
扱われます。
.Fl l
オプション指定時には、
イメージの一覧を含むファイルとして扱われます。
.El
.Pp
ファイルの長さが現在のメディアのブロックサイズの倍数でない場合
ブロックサイズの要求に合わせるために 0 が詰められます。
慣習的なファイル名
.Fl
は標準入力を指し、1 度だけ使用可能です。
.Sh 使用例
データ CD-R を焼きつけるための典型的な使い方:
.Pp
.Dl "burncd -f /dev/acd0c data file1 fixate"
.Pp
オーディオ CD-R を焼きつけるための典型的な使い方:
.Pp
.Dl "burncd -f /dev/acd0c audio file1 file2 file3 fixate"
.Pp
オーディオ CD-R を DAO モードで焼きつけるための典型的な使い方:
.Pp
.Dl "burncd -f /dev/acd0c -d audio file1 file2 file3"
.Pp
ミックスモード CD-R を焼きつけるための典型的な使い方:
.Pp
.Dl "burncd -f /dev/acd0c data file1 audio file2 file3 fixate"
.Pp
圧縮イメージファイルを標準入力から読んで焼きつけるための典型的な使い方:
.Pp
.Dl "gunzip -c file.iso.gz | burncd -f /dev/acd0c data - fixate"
.Pp
前述の例では、データ CD-R に焼きつけられるファイルは
ISO9660 ファイルシステムであることが仮定されています。
.Fx
Ports Collection にて入手可能な
.Xr mkisofs 8
は、指定されたディレクトリツリーから ISO9660 ファイルシステムイメージ
を作成するために広く使用されています。
.Sh バグ
多分あります。みつけたら報告してください。
.Sh 歴史
.Nm
ユーティリティは
.Fx 4.0
で登場しました。
.Sh 作者
.Nm
ユーティリティとこのマニュアルページは
.An S\(/oren Schmidt ,
Denmark
.Aq sos@FreeBSD.org
により提供されました。
