freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ccdconfig.8
.\"	$NetBSD: ccdconfig.8,v 1.1.2.1 1995/11/11 02:43:33 thorpej Exp %
.\"
.\" Copyright (c) 1995 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason R. Thorpe.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: ccdconfig.8,v 1.5 1998/06/04 06:41:26 charnier Exp %
.\"
.\" jpman %Id: ccdconfig.8,v 1.3 1997/07/28 10:00:39 konuma Stab %
.Dd July 17, 1995
.Dt CCDCONFIG 8
.Os FreeBSD
.Sh 名称
.Nm ccdconfig
.Nd 結合ディスクドライバ用設定ユーティリティ
.Sh 書式
.Nm ccdconfig
.Op Fl cv
.Ar ccd
.Ar ileave
.Op Ar flags
.Ar dev
.Op Ar
.Nm ccdconfig
.Fl C
.Op Fl v
.Op Fl f Ar config_file
.Nm ccdconfig
.Fl u
.Op Fl v
.Ar ccd
.Op Ar
.Nm ccdconfig
.Fl U
.Op Fl v
.Op Fl f Ar config_file
.Nm ccdconfig
.Fl g
.Op Fl M Ar core
.Op Fl N Ar system
.Oo
.Ar ccd Oo ...
.Oc
.Oc
.Sh 解説
.Nm
は結合ディスクデバイス (concatenated disk device, ccd) の動的な設定および
解除を行う場合に使用します。ccd の詳細については、
.Xr ccd 4
を参照して下さい。
.Pp
以下のオプションが使用できます。
.Bl -tag -width indent
.It Fl c
ccd の設定を行います。
.Nm
のデフォルトの動作です。
.It Fl C
設定ファイルに書かれている全てのデバイスの設定を行います。
.It Fl f Ar config_file
全てのデバイスの設定あるいは解除を行う時に、デフォルトの
.Pa /etc/ccd.conf
ではなく、
.Pa config_file
から設定情報を読み込みます。
.It Fl g
ccd の設定ファイルとして使用できる形式で、現在の ccd の設定を出力します。
引数が指定されていなければ、設定されている全ての ccd について出力します。
引数が指定されていれば、指定された ccd についてのみ出力します。
.It Fl M Ar core
名前リストに対応する値の展開に、デフォルトの
.Pa /dev/mem
ではなく、
.Pa core
を使用します。
.It Fl N Ar system
(
.Xr getbootfile 3
により判断される)
現在稼働中のカーネルの代わりに
.Ar system
をカーネルとして使用します。
.It Fl u
ccd の設定を解除します。
.It Fl U
ccd 設定ファイルに書かれている全ての ccd デバイスの設定を解除します。
.It Fl v
より冗長な出力を行います。
.El
.Pp
ccd は、コマンド行ないし ccd 設定ファイルにて、ccd の名前、インタリーブ
ファクタ、ccd 設定フラグ、ひとつ以上のデバイスのリストの情報により
定義されます。フラグは、十進数、十六進数、コンマで区切られた名前のリスト、
.Dq none
のいずれかで表すことができます。
フラグには以下の物があります。
.\" 以下の表の部分のマクロはオリジナルの英語版とは異なるが、こちらの方が
.\" きれいに(見やすい形で)フォーマットされるので、変更した。
.\" マクロ自体は NetBSD の ccdconfig.8 の日本語版を参考にした。
.\" 2.2.2-RELEASE 対象
.\" By yugawa@orleans.rim.or.jp (May 20 1997)
.\"
.\" "-offset indent" 追加。
.\" 2.2.2-RELEASE 対象
.\" By konuma@de.mtex.co.jp (Jul 28 1997)
.Pp
.Bl -tag -width "CCDF_UNIFORM 0x02" -ffset intent -compact -offset indent
.It "CCDF_SWAP    0x01"
dmmax (swap の単位ブロックの最大値) 単位でインタリーブします
.It "CCDF_UNIFORM 0x02"
ディスク間で均一なインタリーブ動作になります
.It "CCDF_MIRROR  0x04"
データのミラーリングを行います
.It "CCDF_PARITY  0x08"
パリティ検査を行います (現状では使用できません)
.El
.Pp
設定ファイルのフォーマットは、コマンド行から指定する場合と
同一の形式になります。コマンド行から指定する場合も、
設定ファイルから指定する場合も、
.Pa flags
引数はオプションです。
.Bd -unfilled -offset indent
#
# /etc/ccd.conf
# Configuration file for concatenated disk devices
#
.Pp
# ccd           ileave  flags   component devices
ccd0            16      none    /dev/sd2e /dev/sd3e
.Ed
.Pp
.Sh 使用例
コマンド行から以下のコマンドを実行した場合、ccd0 を
(/dev/sd2e, /dev/sd3e, /dev/sd4e, /dev/sd5e の) 四つの要素から
構成され、32 ブロックごとにインタリーブする ccd として設定します。
.Bd -unfilled -offset indent
# ccdconfig ccd0 32 0 /dev/sd2e /dev/sd3e /dev/sd4e /dev/sd5e
.Ed
.Pp
.Sh 関連ファイル
.Bl -tag -width /etc/ccd.conf -compact
.It Pa /etc/ccd.conf
デフォルトの ccd 設定ファイル
.El
.Sh 関連項目
.Xr ccd 4 ,
.Xr rc 8
.Sh 歴史
.Nm
コマンドは
.Nx 1.0a
から登場しました。
