freebsd/freebsd-doc/ja_JP.eucJP/man/man8/chkgrp.8
.\" Copyright (c) 1998 Dag-Erling Coidan Smorgav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer
.\"    in this position and unchanged.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/chkgrp/chkgrp.8,v 1.7.2.3 2001/08/16 15:55:42 ru Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/chkgrp.8,v 1.8 2001/05/14 01:09:46 horikawa Exp $
.\"
.Dd May 5, 1998
.Dt CHKGRP 8
.Os
.Sh 名称
.Nm chkgrp
.Nd グループファイルの構文をチェックする
.Sh 書式
.Nm chkgrp
.Op Ar groupfile
.Sh 解説
.Nm
ユーティリティ
は与えられたファイルか、ファイルが与えられなければシステムワイドな
グループファイルを調べてエラーを探します。特に、空行でも
コメント行でもない各エントリについて、コロンで区切られる 4 つの
フィールドから成ること、それらのフィールドはいずれも空白文字を
含まないこと、3 番目のフィールド (グループ ID) は数字であることを
チェックします。
.Sh 関連ファイル
.Bl -tag -width /dev/group -compact
.It Pa /etc/group
グループデータベースファイル
.El
.Sh 関連項目
.Xr getgrent 3 ,
.Xr group 5
.Sh 診断
エラーが見つかる度に、
.Nm
は調べているファイルの名前とエラーのあった行番号を含む
エラーメッセージを出力します。エラーがなければ、何も出力しません。
.Pp
.Nm
ユーティリティはグループファイルにエラーが見つかれば
.Dv EX_DATAERR
を、見つからなければ
.Dv EX_OK
を返します。
.Sh 歴史
.Nm
コマンドは
.Fx 3.0
で登場しました。
.Sh 作者
.Nm
と本マニュアルページは
.ie t .An Dag-Erling Co\(:idan Sm\(/orgav Aq des@FreeBSD.org
.el .An Dag-Erling Coidan Smorgav Aq des@FreeBSD.org
が作成しました。
.Sh バグ
フィールド内に可能な / 不可能な文字をもっと徹底的にチェックし、
グループ ID の範囲もチェックするべきです。
