freebsd/freebsd-doc/ja_JP.eucJP/man/man8/chkprintcap.8
.\" Copyright 1997 Massachusetts Institute of Technology
.\"
.\" Permission to use, copy, modify, and distribute this software and
.\" its documentation for any purpose and without fee is hereby
.\" granted, provided that both the above copyright notice and this
.\" permission notice appear in all copies, that both the above
.\" copyright notice and this permission notice appear in all
.\" supporting documentation, and that the name of M.I.T. not be used
.\" in advertising or publicity pertaining to distribution of the
.\" software without specific, written prior permission.  M.I.T. makes
.\" no representations about the suitability of this software for any
.\" purpose.  It is provided "as is" without express or implied
.\" warranty.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY M.I.T. ``AS IS''.  M.I.T. DISCLAIMS
.\" ALL EXPRESS OR IMPLIED WARRANTIES WITH REGARD TO THIS SOFTWARE,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT
.\" SHALL M.I.T. BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/lpr/chkprintcap/chkprintcap.8,v 1.2.2.1 1999/08/29 15:43:04 peter Exp %
.\" jpman %Id: chkprintcap.8,v 1.3 1998/10/10 09:05:17 yohta Stab %
.Dd November 30, 1997
.Dt CHKPRINTCAP 8
.Os
.Sh 名称
.Nm chkprintcap
.Nd プリントスプーラデータベースのエントリの正当性をチェックする
.Sh 書式
.Nm chkprintcap
.Op Fl d
.Op Fl f Ar printcap
.Sh 解説
.Nm chkprintcap
は
.Xr printcap 5
データベース
(引数
.Ar printcap
で指定されるファイルか、
デフォルトでは
.Pa /etc/printcap )
を調べて、いろいろと不正なエントリを探します。
現在、以下のチェックが実装されています :
.Bl -enum -offset indent
.It
.Sq Li tc=
参照が正しく展開されたか
.It
.Sq Li tc=
参照がループを形成しなかったか
.It
2 つのプリンタが同じスプールディレクトリを共有していないか
.Po
.Sq Li sd=
ケーパビリティ
.Pc
.El
.Pp
.Nm chkprintcap
は処理を終えるまでに遭遇したエラーの数と同じ終了ステータスで終了します。
(場合によっては、
ファイル全体が調査されるより前に処理が中止されることもあります。)
.Pp
.Fl d
フラグを与えると、
.Nm chkprintcap
は存在しないスプールディレクトリを、モード
.Sq Li u=rwx,go=rx
(0755), グループ
.Sq Li daemon ,
データベースの
.Sq Li du=
ケーパビリティで指定される所有者 (デフォルトは 1 で、これはユーザ
.Sq Li daemon
にあたります) で作成しようとします。
.Sh 関連項目
.Xr lpr 1 ,
.Xr printcap 5 ,
.Xr lpd 8
.Sh 作者
.Nm chkprintcap
コマンドは
.An Garrett A. Wollman Aq wollman@lcs.mit.edu
が作成しました。
.Sh バグ
正当性チェックが十分とはいえません。最低限、
スプールディレクトリの所有者とモードもチェックするべきです。
.Xr lpd 8
を失敗させ得るような値を持つ他のパラメータも診断するべきです。
