freebsd/freebsd-doc/ja_JP.eucJP/man/man8/chroot.8
.\" Copyright (c) 1988, 1991, 1993
.\"   The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)chroot.8  8.1 (Berkeley) 6/9/93
.\" %FreeBSD: src/usr.sbin/chroot/chroot.8,v 1.5.2.1 2000/12/08 15:28:00 ru Exp %
.\"
.\" jpman %Id: chroot.8,v 1.2 1997/03/31 13:31:37 horikawa Stab %
.\"
.Dd June 9, 1993
.Dt CHROOT 8
.Os BSD 4.3
.Sh 名称
.Nm chroot
.Nd 指定したディレクトリをルートディレクトリとみなして、コマンドを実行する
.Sh 書式
.Nm
.Ar newroot
.Op Ar command
.Sh 解説
.Nm
コマンドは、ルートディレクトリを 
.Ar newroot
に変更して 
.Ar command
を実行 (exec) します。
.Ar command
が指定されなかった場合は、自分のシェルのコピーが用いられます。
.Pp
コマンドやシェルは自分の実ユーザ ID で実行されることに注意してください
.Sh 環境変数
以下の環境変数が 
.Nm
から参照されます:
.Bl -tag -width SHELL
.It Ev SHELL
もしこの変数がセットされていれば、実行 (exec) するシェルの名前として
この文字列が用いられます。もし
.Ev SHELL
がセットされていない場合は
.Pa /bin/sh
が用いられます。
.El
.Sh 関連項目
.Xr chdir 2 ,
.Xr chroot 2 ,
.Xr environ 7
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.4 
から登場しました。
