freebsd/freebsd-doc/ja_JP.eucJP/man/man8/clri.8
.\" Copyright (c) 1980, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)clri.8	8.2 (Berkeley) 4/19/94
.\" %FreeBSD: src/sbin/clri/clri.8,v 1.14 2004/04/09 19:58:26 markm Exp %
.\" $FreeBSD$
.\"
.Dd April 19, 1994
.Dt CLRI 8
.Os
.Sh 名称
.Nm clri
.Nd inode をクリアする
.Sh 書式
.Nm
.Ar special_device inode_number ...
.Sh 解説
.Bf -symbolic
通常は
.Xr fsck 8
でファイルシステムの修復を行なうので、
.Nm
ユーティリティは古いもの (obsolete)
となっています。
.Ef
.Pp
.Nm
ユーティリティは、指定した特殊ファイル
.Ar special_device
上にあるファイルシステムの、指定された
inode 番号の inode を 0 でクリアします。
クリアされた inode や、以前その inode によって
使用されていたブロックを再使用できるようにするために、普通は
.Nm
を実行したあとで
.Xr fsck 8
をそのファイルシステムに対して実行します。
.Pp
このコマンドは主に、なんらかの原因によって
.Xr fsck 8
が適切に処理することのできなくなったファイルを削除するためにあります。
一度削除されれば、
そのあとのファイルシステム上のつじつま合わせは
.Xr fsck 8
が行ってくれることが期待できます。
.Sh 関連項目
.Xr fsck 8 ,
.Xr fsdb 8
.Sh バグ
オープンされているファイルに対して
.Nm
を実行しても、
そのファイルをクローズする際にキャッシュからディスクに
inode が書き戻されるために、その効果が失われてしまいます。
