freebsd/freebsd-doc/ja_JP.eucJP/man/man8/comcontrol.8
.\" %FreeBSD: src/sbin/comcontrol/comcontrol.8,v 1.15.2.4 2001/08/01 06:01:51 obrien Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/comcontrol.8,v 1.11 2001/05/14 01:09:46 horikawa Exp $
.Dd May 15, 1994
.Dt COMCONTROL 8
.Os FreeBSD
.Sh 名称
.Nm comcontrol
.Nd 特殊 tty デバイスの制御
.Sh 書式
.Nm
.Ar special_device
.Op dtrwait Ar number
.Op drainwait Ar number
.Sh 解説
.Nm
は、指定した tty デバイスの特別な設定内容を表示/変更するのに
用いられます。
デバイス名以外の引数 (または標準入力を表す "-") が指定されない場合、
制御可能な全ての項目が表示されます。
.Nm
をこのように利用する際には、
当該デバイスの読み取り許可だけが必要になります。
設定を変更できるのはスーパユーザだけです。
.Pp
以下のオプションが利用可能です:
.Bl -tag -width width
.It Cm dtrwait Ar number
DTR が落ちたあと待機する時間を設定します。
単位は 100 分の 1 秒です。
デフォルトは 300 すなわち 3 秒です。
このオプションは主として、モデムをリセットした後に
適切な復帰時間を置くのに用いられます。
.It Cm drainwait Ar number
出力が出てくるまでの待機時間を設定します。
単位は秒です。
デフォルトは 5 分です。
0 は無限に待ち続けます。
このオプションは主に、
待ち時間上限値を指定してモデムのハングを回避するのに用いられます。
.El
.Pp
.Nm
の標準的な使い方は、スタートアップスクリプト
.Pa /etc/rc.serial
の中に
.Nm
の起動を含めておくことです。
.Sh 関連項目
.Xr stty 1 ,
.Xr sio 4
.Sh 関連ファイル
.Bl -tag -width /dev/ttyd? -compact
.It Pa /dev/ttyd?
ダイヤルインデバイス。結線した端末(hardwired terminals)。
.It Pa /dev/cuaa?
ダイヤルアウトデバイス。
.El
.Sh 作者
Christopher G. Demetriou
.Sh 歴史
オリジナルは 386BSD 0.1 に対する cgd の com パッケージパッチの
バージョン 0.2.1 です。
かつては双方向制御機能を持っていましたが、
現在ではこれらは標準機能となり、制御できるものはほとんどありません。
