freebsd/freebsd-doc/ja_JP.eucJP/man/man8/comsat.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)comsat.8	8.1 (Berkeley) 6/4/93
.\" %FreeBSD: src/libexec/comsat/comsat.8,v 1.6.2.1 2000/12/08 13:52:25 ru Exp %
.\" jpman %Id: comsat.8,v 1.2 1997/03/31 13:32:20 horikawa Stab %
.\"
.Dd June 4, 1993
.Dt COMSAT 8
.Os BSD 4.2
.Sh 名称
.Nm comsat
.Nd biff サーバ
.Sh 書式
.Nm
.Sh 解説
.Nm
は受信メールのレポートを受け取り、
サービスを要求しているユーザに対して通知を行なうサーバプロセスです。
.Nm
は、
.Dq biff
サービス仕様 (
.Xr services 5
および
.Xr inetd 8
を参照) に関連するデータグラムポートのメッセージを受信します。
1 行メッセージは次の形式です:
.Pp
.Dl user@mailbox-offset[:mailbox-name]
.Pp
もし、この
.Em user
がシステムにログインしていて、割り当てられた端末の所有者実行ビットが (
.Dq Li biff y
によって) ON になっていれば、
.Em offset
はメールボックスのシークオフセットとして使用され、
メッセージの先頭 7 行か、もしくは 560 文字がユーザの端末に表示されます。
.Dq From ,
.Dq \&To ,
.Dq Date ,
.Dq Subject
以外のメッセージヘッダの一部とみなされる行は、
表示されるメッセージに含まれません。
.Pp
mailbox-name を省略した場合, システム標準のメールボックスを監視します。
.Sh 関連ファイル
.Bl -tag -width /var/mail/user -compact
.It Pa /var/run/utmp
誰がどの端末でログオンしたかを識別します。
.It Pa /var/mail/user
システム標準のメールボックスです。
.El
.Sh 関連項目
.Xr biff 1 ,
.Xr inetd 8
.Sh バグ
メッセージヘッダのフィルタリングは誤りがちです。
表示される情報は、最低限のものです。
.Pp
現在ログインしているマシン以外のマシンへのメールの到着は、
ユーザに通知されるべきです。
.Pp
スクリーン表示を分かりやすくするために、通知は別のウィンドウに
表示されるべきです。
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
