freebsd/freebsd-doc/ja_JP.eucJP/man/man8/conscontrol.8
.\"
.\" Copyright (c) 2001 Jonathan Lemon <jlemon@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/conscontrol/conscontrol.8,v 1.4 2002/07/06 19:32:42 charnier Exp %
.\"
.\" $FreeBSD$
.Dd October 23, 2001
.Dt CONSCONTROL 8
.Os
.Sh 名称
.Nm conscontrol
.Nd 物理コンソールデバイスの制御
.Sh 書式
.Nm
.Op Cm list
.Nm
.Cm mute on | off
.Nm
.Cm add | delete
.Ar console
.Sh 解説
.Nm
ユーティリティは、仮想コンソールデバイスの背後にある物理デバイスを
検査したり変更したりするために使用します。
引数を指定しないと
(または
.Cm list
コマンドのみを指定すると)、
現在のコンソール設定が表示されます。
.Pp
論理コンソールには 2 種類あります。
それは、
.Pa /dev/console
で表現される高レベルコンソールと、低レベルコンソールです。
低レベルコンソールは、カーネルの
.Xr printf 9
と
.Xr ddb 4
デバッガサポートに使用され、高レベルコンソールは
.Xr syslogd 8
などのユーザプログラムに使用されます。
複数デバイスサポートは、低レベルコンソールに対してのみ実装されています。
高レベルコンソールは、コンソールリストの最初のデバイスに設定されます。
.Pp
複数コンソールサポートの起動は、ブートローダから
.Fl D
フラグをカーネルに渡すか、システムブート完了後に
.Nm
を使用してコンソールデバイスのリストを変更することで可能です。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Cm add | delete Ar console
論理コンソールに対し、物理デバイスを追加または削除します。
対象デバイスは、低レベルコンソール操作をサポートすることが必要です。
デバイスを追加すると、それはコンソールデバイスリストの先頭に置かれます。
最初のデバイスが、高レベルコンソールとして使用されます。
.It Cm mute on | off
コンソールのミュート状態を変更します。
コンソールのミュートが
.Cm on
の場合、すべてのコンソール出力が抑制されます。
.El
.Sh 関連項目
.Xr sio 4 ,
.Xr syscons 4 ,
.Xr boot 8 ,
.Xr loader 8
.Sh 歴史
.Nm
ユーティリティが最初に登場したのは
.Fx 5.0
です
.Sh 作者
.An Jonathan Lemon
