freebsd/freebsd-doc/ja_JP.eucJP/man/man8/cron.8
.\"/* Copyright 1988,1990,1993 by Paul Vixie
.\" * All rights reserved
.\" *
.\" * Distribute freely, except: don't remove my name from the source or
.\" * documentation (don't take credit for my work), mark your changes (don't
.\" * get me blamed for your possible bugs), don't alter or remove this
.\" * notice.  May be sold if buildable source is provided to buyer.  No
.\" * warrantee of any kind, express or implied, is included with this
.\" * software; use at your own risk, responsibility for damages (if any) to
.\" * anyone resulting from the use of this software rests entirely with the
.\" * user.
.\" *
.\" * Send bug reports, bug fixes, enhancements, requests, flames, etc., and
.\" * I'll try to keep a version up to date.  I can be reached as follows:
.\" * Paul Vixie          <paul@vix.com>          uunet!decwrl!vixie!paul
.\" */
.\" 
.\" %FreeBSD: src/usr.sbin/cron/cron/cron.8,v 1.7.2.4 2001/05/28 23:37:26 babkin Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/cron.8,v 1.9 2001/05/14 01:09:47 horikawa Exp $
.\" 
.Dd December 20, 1993
.Dt CRON 8
.Os
.Sh 名称
.Nm cron
.Nd 定期的にコマンドを実行するデーモン (Vixie Cron)
.Sh 書式
.Nm
.Oo
.Fl s
.Oc
.Oo
.Fl o
.Oc
.Oo
.Fl x
.Ar debugflag Ns Op , Ns Ar ...
.Oc
.Sh 解説
.Nm
は、通常は
.Pa /etc/rc
もしくは
.Pa /etc/rc.local
から起動されます。このコマンドは実行するとすぐに返ってくるので、起動時に
`&' をつける必要はありません。
.Pp
.Nm
は、
.Pa /var/cron/tabs
ディレクトリの下から
.Pa /etc/passwd
内のアカウント名と同じ名前の crontab ファイルを探し、見つかったファイルを
メモリに読み込みます。
.Nm
は、別のフォーマットの
.Pa /etc/crontab (
.Xr crontab 5
を参照してください)
も調べます。このあと、
.Nm
は 1 分おきに目覚めて
読み込んでいるすべての crontab ファイルを調べ、各コマンドをその時刻に
実行させるべきかどうかを調べます。コマンドを実行する場合には、出力がメールで 
crontab ファイルの所有者 (もしくは crontab ファイル内の環境変数
.Ev MAILTO
で指定されたユーザ) に送られます。
.Pp
さらに、
.Nm
は 1 分おきにスプールディレクトリの最終更新時刻 (
.Pa /etc/crontab
の最終更新時刻も ) が変わっているかどうかを調べます。もし
変化があれば、すべての crontab ファイルの最終更新時刻を調べ、変更のあった
ものを読み直します。このため、crontab ファイルを変更したときに
.Nm
をリスタートさせる必要はありません。
.Xr crontab 1
コマンドが crontab
ファイルを変更したときにスプールディレクトリの最終更新時刻も更新されることに
注意して下さい。
.Pp
使用可能なオプションは次の通りです:
.Bl -tag -width indent
.It Fl s
ローカルタイムゾーンの GMT との差が変わる場合を、特別に扱います。
例えば、標準時から夏時間への移行がこれに該当します。
.Pp
GMT との差が変わる時間に実行されるジョブは、直観通りに扱われます。
すなわち、
無くなる期間 (例えば標準時から夏時間への移行) か
繰り返される期間 (例えばその逆) にジョブが該当するならば、
次の 2 つの方法のいずれかで扱われます: 
.Pp
第 1 の方法は、
毎時の時間間隔で実行されるジョブ用で、
無くなるまたは繰り返される期間と重なる期間に実行されるジョブ用です。
言い換えれば、GMT との差の変更の 1 時間以内にそのジョブが実行されていた場合
(かつ cron が再起動されず、
.Xr crontab 5
がその後変更されない場合) か、
変更後で次の 1 時間に実行されていたであろう場合です。
これらは、いつも通りに動作します。
すなわち、無くなる時間を飛ばしますし、増えた時間にも実行されます。
.Pp
第 2 の方法は、より低い頻度で実行されるジョブ用です。
それらは、正確に 1 度だけ実行され、飛ばされませんし 2 度実行されません
(ただし、cron が再起動されたり、ユーザの
.Xr crontab 5
が期間中に変更される場合は例外です)。
GMT との差の変更のために 1 期間が無くなってしまう場合、
古いタイムゾーンにおいて実行されたであろう時刻と絶対的に同じ時刻において、
そのようなジョブは実行されます。
例えば、正確に 1 時間が無くなる場合、
無くなった時点は、
次の 1 時間において
.Xr crontab 5
で指定される最初の分になります。
.It Fl o
ローカルタイムゾーンの GMT との差が変わる場合を、特別に扱いません。
古い (デフォルトの) 動作と互換です。
.Fl o
と
.Fl s
の両方のオプションが指定された場合、最後に指定されたオプションが有効です。
.El
.Sh 関連項目
.Xr crontab 1 ,
.Xr crontab 5 
.Sh 作者
.An Paul Vixie Aq paul@vix.com
