freebsd/freebsd-doc/ja_JP.eucJP/man/man8/cvsbug.8
.\" -*- nroff -*-
.\" ---------------------------------------------------------------------------
.\"    man page for send-pr (by Heinz G. Seidl, hgs@cygnus.com)
.\"    updated Feb 1993 for GNATS 3.00 by Jeffrey Osier, jeffrey@cygnus.com
.\"
.\"    This file is part of the Problem Report Management System (GNATS)
.\"    Copyright 1992 Cygnus Support
.\"
.\"    This program is free software; you can redistribute it and/or
.\"    modify it under the terms of the GNU General Public
.\"    License as published by the Free Software Foundation; either
.\"    version 2 of the License, or (at your option) any later version.
.\"
.\"    This program is distributed in the hope that it will be useful,
.\"    but WITHOUT ANY WARRANTY; without even the implied warranty of
.\"    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
.\"    General Public License for more details.
.\"
.\" ---------------------------------------------------------------------------
.\" %FreeBSD: src/contrib/cvs/man/cvsbug.8,v 1.2.6.1 2000/10/31 09:37:50 obrien Exp %
.\" $FreeBSD$
.nh
.TH CVSBUG 8 xVERSIONx "February 1993"
.SH 名称
cvsbug \- CVS に関する Problem Report (PR) をサポートサイトに送る
.SH 書式
.B cvsbug
[
.I site
]
[
.B \-f
.I problem-report
]
[
.B \-t
.I mail-address
]
.br
.in +0.8i
[
.B \-P
]
[
.B \-L
]
[
.B \-\-request-id
]
[
.B \-v
]
.SH 解説
.\"
.\" 以下の日本語訳は、同じく FreeBSD jpman にて既に訳されていた
.\" send-pr.1 から かなりの部分を流用している。sakai@jp.freebsd.org 1997.6.16
.\"
.B cvsbug
は、サポートサイトに対して
.I problem reports 
.\" SITE ADMINISTRATORS - change this if you use a local default
(PR) を送るために使うツールです。大抵の場合は正しい
.I site
がデフォルトとなっているはずです。この引数は、問題を引き起こした事象
のカテゴリに対して責任をもつサポートサイトを指し示します。いくつかの
サイトはデフォルトとしてローカルアドレスを使っていることでしょう。
.I site
は、
.BR aliases (5)
を使って定義されます。
.LP
.B cvsbug
を実行すると、エディタが起動されて用意されているテンプレートを (いくつ
かのフィールドにもっともらしいデフォルトの値をあてはめてから) 読み込ま
れます。エディタを終了すると、
.B cvsbug
はサポートサイトの
.I Problem Report Management System
(\fBGNATS\fR) に完了した形式のレポートをメールで送ります。サポートサイトで
は、PR は問題のカテゴリと \fIsubmitter-id\fR とに従って唯一の番号が
割り当てられ、\fBGNATS\fR データベースに保存されています。
\fBGNATS\fR はメールを受け取ったことを知らせるために、
問題のカテゴリの引用と PR 番号とを自動的に返送します。
.LP
PR が速やかに処理されるようにするためには、
あなた(独自)の \fIsubmitter-id\fR と、
問題分野を識別する有効なカテゴリを記入する必要があります。(カテゴリは
.B `cvsbug -L'
で見ることができます。)
.LP
あなたのサイトにある
.B cvsbug
テンプレートは、あらかじめ submitter-id をカスタマイズしておく
必要があります (そのために `\|\fBinstall-sid\fP \fIsubmitter-id\fP\|' を
実行することは
.B cvsbug
のインストール手順の一部になっています )。
もしこれがまだ設定されていなければ、
あなたのシステム管理者に submitter-id 設定をお願いするか、次のコマンド
.B `cvsbug \-\-request\-id'
を実行してあなたのサポートサイトに submitter-id を要求して下さい。
あなたのサイトがユーザサイト間で区別できない、あるいは
あなたがサポートサイトと結び付きを持っていない場合は、このフィールドに
.B `net'
と指定して下さい。
.LP
より正確な問題の記述やより完全な情報があればあるほど、
サポートチームは問題をより早く解決することができます。
.SH オプション
.TP
.BI \-f " problem-report"
すでに記入した PR ファイルを \fIproblem-report\fR に指定できます。
.B cvsbug
はエディタを起動せずにファイルを送ります。
.I problem-report
が
.BR `\|\-\|'
のときは
.B cvsbug
は、標準入力から読み込みます。
.TP
.BI \-t " mail-address"
PR を送るサイトのメールアドレスを変更します。
デフォルトのメールアドレスは、
デフォルトサイトのものが使われます。特殊な状況を除き、このオプションではなく、
.I site
を使って下さい。
.TP
.B \-P
環境変数
.B PR_FORM 
で指定されたテンプレートを標準出力に出力します。
.B PR_FORM
が定義されていないときは、標準のブランク PR テンプレートが使われます。
メールは送られません。
.TP
.B -L
使用できるカテゴリが表示されます。メールは送られません。
.TP
.B \-\-request\-id
デフォルトサイトか、
.I site
が指定されればそのサイトに
.IR submitter-id 
を要求します。もしユーザがそのサイトと関係なければ、
.I submitter-id
として
.BR net
を使って下さい。
.TP
.B \-v
.B cvsbug
のバージョンを表示します。
.LP
注:
PR を提出するためには、PR を直接メールするのではなく、
.B cvsbug
を使いましょう。テンプレートと
.B cvsbug
の両方を使うことによって、すべての必要な情報がサポートサイトに確実に届きます。
.SH 環境変数
.B EDITOR
テンプレートに対して起動するエディタ
.br
デフォルト:
.B vi
.sp
もし
.B PR_FORM
が設定されていれば、編集する PR のテンプレートのファイル名として
使われます。
部分的に完成したテンプレートから始めるために
これを使うことができます (たとえば、すでに identification フィールドを
埋めてあるテンプレートなどです)。
.SH PR の記入方法
PR が形式に従っていれば、
プログラムは簡単に PR を扱うことができます。
以下のガイドラインを覚えておきましょう:
.IP \(bu 3m 
それぞれの PR には
.B 一つの問題
だけを記述しましょう。
.IP \(bu 3m
フォローアップメールには、
自動返送されて来るメールと同じサブジェクトを使いましょう。サブジェクトは、
カテゴリ、PR 番号、元の概要の行から構成されています。
これによってサポートサイト
は、特定の PR を複数のメールメッセージと結びつけ、またそれらを自動的に
記録することができます。
.IP \(bu 3m 
サブジェクトや、概要の行はできるだけ正確するようにしましょう。
.IP \(bu 3m 
サブジェクトや概要の行は機密扱いではありません。
公開されるバグリストはサブジェクトと概要の行から編集するので、
機密情報はここに書かないでください。
.LP
詳しくは、GNU 
.B Info 
ファイルの
.B cvsbug.info
か、RP について詳しく書かれている
\fIReporting Problems With cvsbug\fR\ 
のドキュメントなどを参照してください。
.SH テストケース、コード、その他の記入方法
小さなサンプルコードを送りましょう。
大きなテストケースや問題となっているソースコードを送りたい場合にには、
サポートサイトに連絡を取り、指示を受けて下さい。
.SH 関連ファイル
.ta \w'/tmp/pbad$$  'u
/tmp/p$$        編集しているときに使う PR のコピー
.br
/tmp/pf$$       テスト目的で使う、空の PR テンプレートコピー
.br
/tmp/pbad$$     捨てられた PR のファイル
.SH インストールとコンフィギュレーション
.B INSTALL
インストールガイドを参照してください。
.SH 関連項目
.BR gnats (l),
.BR query-pr (1),
.BR edit-pr (1),
.BR gnats (8),
.BR queue-pr (8),
.BR at-pr (8),
.BR mkcat (8),
.BR mkdist (8).
.SH 作者
Jeffrey Osier, Brendan Kehoe, Jason Merrill, Heinz G. Seidl (Cygnus
Support)
.SH COPYING
Copyright (c) 1992, 1993 Free Software Foundation, Inc.
.PP
Permission is granted to make and distribute verbatim copies of
this manual provided the copyright notice and this permission notice
are preserved on all copies.
.PP
Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the
entire resulting derived work is distributed under the terms of a
permission notice identical to this one.
.PP
Permission is granted to copy and distribute translations of this
manual into another language, under the above conditions for modified
versions, except that this permission notice may be included in
translations approved by the Free Software Foundation instead of in
the original English.
