freebsd/freebsd-doc/ja_JP.eucJP/man/man8/daemon.8
.\" Copyright (c) 1999 Berkeley Software Design, Inc. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Berkeley Software Design Inc's name may not be used to endorse or
.\"    promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY BERKELEY SOFTWARE DESIGN INC ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL BERKELEY SOFTWARE DESIGN INC BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/daemon/daemon.8,v 1.3 2003/02/05 19:16:18 trhodes Exp %
.\"
.\" $FreeBSD$
.Dd August 30, 2001
.Dt DAEMON 8
.Os
.Sh 名称
.Nm daemon
.Nd 制御端末から切り離して実行する
.Sh 書式
.Nm
.Op Fl cf
.Ar command arguments ...
.Sh 解説
.Nm
ユーティリティは、制御端末から自分自身を切り離し、
引数で指定されたプログラムを実行します。
.Pp
オプションは次の通りです:
.Bl -tag -width indent
.It Fl c
現在の作業ディレクトリをルートディレクトリ
.Pq Dq Pa / 
に変更します。
.It Fl f
標準入力、標準出力ならびに標準エラー出力を
.Pa /dev/null 
にリダイレクトします。
.El
.Sh 診断
.Nm
ユーティリティは
.Xr daemon 3
ライブラリルーチンがエラーを返した場合は 1 で終了し、
エラーを返さなかった場合は 0 で終了します。
指定したコマンドが実行できなかった場合、
.Fl f
フラグが指定されていなければ標準エラー出力にエラーメッセージを
表示します。
.Sh 関連項目
.Xr daemon 3 ,
.Xr exec 3 ,
.Xr termios 4 ,
.Xr tty 4
.Sh 歴史
.Nm
ユーティリティは
.Fx 4.7
で初めて登場しました。
