freebsd/freebsd-doc/ja_JP.eucJP/man/man8/dev_mkdb.8
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)dev_mkdb.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/dev_mkdb/dev_mkdb.8,v 1.5 1999/12/27 08:01:11 peter Exp %
.\"
.\" jpman %Id: dev_mkdb.8,v 1.2 1997/05/23 07:36:35 mitchy Stab %
.\"
.Dd June 6, 1993
.Os
.Dt DEV_MKDB 8
.Sh 名称
.Nm dev_mkdb
.Nd
.Pa /dev
のデータベースを作成する
.Sh 書式
.Nm dev_mkdb
.Sh 解説
.Nm
コマンドは、
.Pa /var/run/dev.db
に
.Xr db 3
のハッシュデータベースを
作成します。このデータベースには、
.Pa /dev
ディレクトリ内のすべてのキャラクタ型特殊ファイルと
ブロック型特殊ファイルの名前が含まれており、
キーとしてファイルタイプと
.Fa st_rdev
フィールドが使われています。
.Pp
キーの構造体は mode_t, dev_t の順であり、0 で
パディングされています。
mode_t はファイルタイプ (st_mode & S_IMFT) であり、
dev_t はst_rdev フィールドそのものです。
.Pp
.Sh 関連ファイル
.Bl -tag -width /var/run/dev.db -compact
.It Pa /dev
デバイスのディレクトリ
.It Pa /var/run/dev.db
データベースファイル
.El
.Sh 関連項目
.Xr ps 1 ,
.Xr stat 2 ,
.Xr db 3 ,
.Xr devname 3 ,
.Xr ttyname 3
.Sh 歴史
.Nm
コマンドは
.Bx 4.4
から登場しました。
