freebsd/freebsd-doc/ja_JP.eucJP/man/man8/devd.8
.\"
.\" Copyright (c) 2002 M. Warner Losh.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/devd/devd.8,v 1.12 2004/07/07 19:57:14 ru Exp %
.\"
.\" $FreeBSD$
.Dd October 17, 2002
.Dt DEVD 8
.Os
.Sh 名称
.Nm devd
.Nd デバイス状態変化検出デーモン
.Sh 書式
.Nm
.Op Fl Ddn
.Sh 解説
.Nm
デーモンを使って、あるカーネルイベントが起こった時にユーザランドの
プログラムが起動するように設定することができます。
.Pp
次のオプションが使用できます。
.Bl -tag -width indent
.It Fl D
デバッグメッセージを有効にします。
.It Fl d
デーモンではなく、フォアグラウンドで起動します。
.It Fl n
デーモンを起動する前にペンディングになっているイベントをすべて無視して
デーモンをすぐに起動します。
.El
.Sh 実装に関する注
.Nm
ユーティリティは
常時バックグラウンドで走るシステムデーモンです。
デバイスツリーにデバイスが追加されたり、削除されたりすると
.Nm
は、
.Xr devd.conf 5
で指定されたアクションを実行します。
例えば
.Nm
は、
イーサネットアダプタがシステムに追加された時に
.Xr dhclient 8
を起動して、
そのアダプタが外された時には
.Xr dhclient 8
インスタンスを停止するということができます。
また例えば
.Nm
にテーブルを利用させることで、
システムに追加された認識できないデバイスの正しいドライバを特定し、
.Xr kldload 8
でロードすることもできます。
.Pp
.Nm
ユーティリティは
.Xr devctl 4
デバイスドライバをフックします。
このデバイスドライバは、デバイスコンフィギュレーションシステムを
フックしていて、デバイスツリーにノードが追加・削除された時には
このデバイスから
.Nm
にイベント情報が配信されます。
.Nm
がそのメッセージをバースするとアクションリストから
最も一致度の高いアクションを選択して、それを実行します。
ほとんどの普通のユーザにはデフォルトのハンドラで充分ですが、
より詳しいユーザが動作の細かいところまでを変更することも
できるようになっています。
.Pp
.Nm
ユーティリティは
ファイル
.Pa /etc/devd.conf
を読み込んで処理を行います。
このファイルのフォーマットについては
.Xr devd.conf 5
に詳しく書いてありますが、
基本的なところをここでさらっておきます。
.Ic options
セクションには、設定ファイルをサーチするディレクトリを
2 つ以上設定することができます。
ここで設定したディレクトリにあるファイルはすべてパースされます。
このようなファイルは、サードパーティがインストールして
ユーザの他の設定ファイルを変更せずに
.Nm
システムをフックするためのものです。
.Pp
.Nm
が受け取ったメッセージはすべて
.Pa /var/run/devd.pipe
の
.Ux
ドメインソケットに転送されます。
.Sh 関連項目
.Xr devctl 4 ,
.Xr devd.conf 5
.Sh 作者
.An M. Warner Losh
