freebsd/freebsd-doc/ja_JP.eucJP/man/man8/digictl.8
.\" %FreeBSD: src/usr.sbin/digictl/digictl.8,v 1.6 2002/07/14 14:42:56 charnier Exp %
.\"
.\" $FreeBSD$
.Dd June 20, 2001
.Dt DIGICTL 8
.Os
.Sh 名称
.Nm digictl
.Nd
.Tn Digiboard
デバイスの制御
.Sh 書式
.Nm
.Fl a
.Cm disable | enable | query
.Ar device ...
.Nm
.Op Fl d Ar debug
.Op Fl ir
.Ar ctrl-device ...
.Sh 解説
.Nm
ユーティリティは、指定した
.Ar ctrl-device
という名前でインストールされている
.Tn Digiboard
に対する制御を提供し、個別の digiboard
.Ar device
に対する制御も提供します。
digiboard
.Ar ctrl-device
は、通常は、
.Sm off
.Pa /dev/digi Ar N Pa .ctl
.Sm on
という形式です。
.Ar N
はカード番号であり、最初にアタッチされたカードに対し
.Dq 0
から開始します。
digiboard
.Ar device
は、通常は、
.Sm off
.Pa /dev/cua Oo Pa il Oc Pa D Ar N Pa \&. Ar P
.Sm on
か
.Sm off
.Pa /dev/tty Oo Pa il Oc Pa D Ar N Pa \&. Ar P
.Sm on
という形式です。
.Ar N
はカード番号であり、
.Ar P
はポート番号です。
.Pp
次のフラグが認識されます:
.Bl -tag
.It Fl a Cm disable | enable | query
指定したポート (複数指定可能) の
.Em ALTPIN
設定を、無効化・有効化・問い合わせします。
.Pp
ALTPIN を有効にすると、CD と DSR の線が論理的に反転されます。
シリアルポートを 8 芯 RJ45 ケーブルに繋ぐときに有用です
(10 芯全部ある RJ45 ケーブルは非常に稀です)。
.Pp
1 回 ALTPIN を設定すると、発呼および着呼の両方のデバイスに適用されます。
.It Fl d Ar debug
.Dv DEBUG
定義付きでドライバをコンパイル済の場合、
.Ar debug
変数に含まれる次のビットが、digiboard ドライバの診断を有効にします。
.Bl -tag -width ".No 1024 ( Em MODEM )"
.It 1 ( Em INIT )
カードのアタッチ、デタッチ、初期化の間の診断。
.It 2 ( Em OPEN )
ポートのオープン時の診断。
.It 4 ( Em CLOSE )
ポートのクローズ時の診断。
.It 8 ( Em SET )
tty デバイスフラグ設定時の診断。
.It 16 ( Em INT )
カードイベント処理時の診断。
.It 32 ( Em READ )
ポート読み取りの戻り値の報告。
.It 64 ( Em WRITE )
ポート書き込みの戻り値の報告。
.It 128 ( Em RX )
受信キューフロー制御の報告。
.It 256 ( Em TX )
送信キューフロー制御の報告。
.It 512 ( Em IRQ )
割り込み中の診断 (これらの設定時には注意してください)。
.It 1024 ( Em MODEM )
モデム状態フラグの設定時の診断。
.It 2048 ( Em RI )
RING 受信時の報告。
.El
.It Fl i
カードの識別文字列とタイプ ID を表示します。
.It Fl r
カードを再初期化します。
外部ポートモジュールを持つボードでは、モジュールを挿抜し、
このスイッチを使用することで動的にポート数を再プローブ可能です。
カードを再初期化しますので、カード上の全ポートのクローズが必要です。
.Pp
digi モジュール全体を再ロードする代りに、
カードを再初期化する方が好ましいです。
なぜならば、アタッチ済の全ボードに影響する代りに、
再初期化の影響は指定したボードに限定されるからです。
.El
.Sh バグ
すべての既存のポートをクローズすることなくボードを再初期化できるべきです。
.Sh 歴史
.Nm
ユーティリティが最初に登場したのは
.Fx 5.0
です。
