freebsd/freebsd-doc/ja_JP.eucJP/man/man8/diskpart.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)diskpart.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/diskpart/diskpart.8,v 1.5.2.1 2000/12/08 15:28:03 ru Exp %
.\"
.\" jpman %Id: diskpart.8,v 1.3 1997/10/11 07:43:12 horikawa Stab %
.\"
.Dd June 6, 1993
.Dt DISKPART 8
.Os BSD 4
.Sh 名称
.Nm diskpart
.Nd デフォルトのディスクパーティションサイズを求める
.Sh 書式
.Nm
.Op Fl p
.Op Fl d
.Op Fl s Ar size
.Ar disk-type
.Sh 解説
.Nm
は、Berkeley で適用されたデフォルト規則に従い、
ディスクパーティションサイズを計算するのに使用されます。
.Pp
使用可能なオプションとオペランド：
.Bl -tag -width Fl
.It Fl p
デバイスドライバへ取り込み可能な形式のテーブルが作成されます。
.It Fl d
ディスク情報記述ファイル
.Pa /etc/disktab
への取り込みが可能な形式のエントリが作成されます。例については
.Xr disktab 5
を参照してください。
.It Fl s Ar size
.Fl s
オプションで指定された
.Ar size
にディスクサイズを制限することを指示します。
.El
.Pp
不良セクタフォワーディングを行うディスクでは、
このための領域は通常ディスクの最後のパーティションに確保されますが、
この領域は作成されるテーブルには影響を与えません。
不良セクタフォワーディングのためには、テーブルの複製コピーのための
1トラックと、不良セクタをマップするための 126 セクタのプールを確保す
るのに十分なトラック数が予約されます。
シリンダ数の倍数でないとしても、ディスクの最後に不良
セクタ置換やその他の制御エリアのための領域を確保する目的で、
.Fl s
オプションを使うことも出来ます。
.Pp
ディスクのパーティションサイズは、ディスク全体のサイズに基づいて、下
のテーブルのように決定されます (値はすべてセクタ単位です)。
.Ql c
パーティションは、慣例として物理ディスク全体をアクセスするために使われます。
デバイスドライバのテーブルは、
.Ql c
パーティション中に不良セクタフォワーディングテーブルに予約された
領域を含めますが、disktab ファイルやデフォルトフォーマットで
用いられる `c'パーティションからは、予約領域が除外されます。
普通は、
.Ql g
パーティションが使われるか、もしくは
.Ql d ,
.Ql e ,
.Ql f
パーティションが使われるかのどちらかになります。
.Ql g
と
.Ql f
パーティションは可変サイズで、固定サイズパーティションが配置された
残りの領域全体を占めることになります。
20M バイト以下のディスクに対しては、
.Nm
は
.Dq Li disk too small, calculate by hand
のメッセージを出して終了します。
.Bl -column Partition 20-60\ MB 61-205\ MB 206-355\ MB 356+\ MB
Partition	20-60 MB	61-205 MB	206-355 MB	356+ MB
a	15884	15884	15884	15884
b	10032	33440	33440	66880
d	15884	15884	15884	15884
e	unused	55936	55936	307200
h	unused	unused	291346	291346
.El
.Pp
不明なディスクタイプが指定されたとき、
.Nm
はジオメトリ情報を求めるプロンプトを出します。
.Sh 関連項目
.Xr disktab 5
.Sh バグ
デフォルトのパーティションサイズのほとんどは(RP06 のような)過去の遺
物に基づいているので、満足のいかない配置になるかもしれません。
.Pp
.Fl d
フラグを使用すると、代替ディスク名は出力されません。
.Sh 歴史
.Nm
は
.Bx 4.2
から登場しました。
