freebsd/freebsd-doc/ja_JP.eucJP/man/man8/dmesg.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)dmesg.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/dmesg/dmesg.8,v 1.5.2.4 2001/08/16 11:35:42 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/dmesg.8,v 1.12 2001/08/19 10:25:06 horikawa Exp $
.\"
.Dd June 5, 1993
.Dt DMESG 8
.Os
.Sh 名称
.Nm dmesg
.Nd システムメッセージバッファの表示
.Sh 書式
.Nm
.Op Fl a
.Op Fl M Ar core
.Op Fl N Ar system
.Sh 解説
.Nm
はシステムメッセージバッファの内容を表示します。
.Pp
オプション
.Fl N
も
.Fl M
も指定されない場合、
.Xr sysctl 3
インタフェースを使用して、現在実行中のカーネルから、バッファが読み取られます。
そうでない場合、指定したコアファイル (またはデフォルトのもの)
から、指定したカーネルイメージ (またはデフォルトのイメージ)
中の名前リストを使用して、バッファが読み取られます。
.Pp
オプションとしては、以下のものがあります:
.Bl -tag -width indent
.It Fl a
メッセージバッファ中の全データを表示します。
これには、すべての syslog レコードと、
.Pa /dev/console
出力が含まれます。
.It Fl M
表示されるシステムメッセージバッファが含まれるファイルを指定します。
デフォルトは
.Pa /dev/kmem
です。
.It Fl N
ネームリストが含まれるファイルを指定します。
デフォルトはシステムがブートに使用したカーネルです。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa /var/run/dmesg.boot" -compact
.It Pa /var/run/dmesg.boot
通常は、起動時にファイルシステムがマウントされたすぐ後の、
バッファ内容のスナップショット
.El
.Sh 関連項目
.Xr sysctl 3 ,
.Xr syslogd 8
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
から登場しました。
