freebsd/freebsd-doc/ja_JP.eucJP/man/man8/dumpfs.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)dumpfs.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/dumpfs/dumpfs.8,v 1.14 2004/07/02 21:45:01 ru Exp %
.\" $FreeBSD$
.\"
.Dd January 19, 2003
.Dt DUMPFS 8
.Os
.Sh 名称
.Nm dumpfs
.Nd ファイルシステムの情報のダンプ
.Sh 書式
.Nm
.Op Fl m
.Op Ar filesys No \&| Ar device
.Sh 解説
.Nm
ユーティリティは、指定したファイルシステムまたはスペシャルデバイスの、
スーパブロックやシリンダグループの情報を表示します。
ただし
.Fl m
が指定された場合は除きます。
表示は非常に長く、詳細なものです。
このコマンドは、ファイルシステムのブロックサイズや最小空き容量などの
ファイルシステムに関する情報を調べるのにもっともよく使われます。
.Pp
.Fl m
が指定された場合、
.Xr newfs 8
コマンドが同じファイルシステム生成できるように、
ファイルシステムを整列させます。
.Sh 関連項目
.Xr disktab 5 ,
.Xr fs 5 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr newfs 8 ,
.Xr tunefs 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.2
から登場しています。
