freebsd/freebsd-doc/ja_JP.eucJP/man/man8/dumpon.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)swapon.8	8.1 (Berkeley) 6/5/93
.\" jpman %Id: dumpon.8,v 1.3 1997/08/16 13:12:52 horikawa Stab %
.\"	%Id: dumpon.8,v 1.3 1996/08/23 00:55:54 mpp Exp %
.\"
.Dd May 12, 1995
.Dt DUMPON 8
.Os FreeBSD 2.1
.Sh 名称
.Nm dumpon
.Nd クラッシュダンプ用デバイスの指定
.Sh 書式
.Nm dumpon
.Op Fl v
.Ar special_file
.Sh 解説
.Nm dumpon
は、パニック時にカーネルがクラッシュダンプをセーブするデバイスを
指定するのに用いられます。
安全のため、
.Xr config 8
への入力において
.Dq dumps on
記述がされていない限り、
システムはダンプエリアなしで開始します。
ダンプデバイスは、設定ファイル中で指定された
スワップエリアのひとつでなければならず、
また、少なくとも物理メモリ分のサイズがなければなりません。
普通、
.Nm dumpon
は、システムのマルチユーザ初期化ファイル
.Pa /etc/rc
の中で
.Xr savecore 8
の実行前に呼び出されます。
.Fl v
オプションを指定すると、
.Nm
はその処理に関する詳細情報を出力します。
.Pp
.Nm
プログラムの動作は、
.Xr sysctl 3
の MIB 変数
.Dq kern.dumpdev
に指定された
.Ar special_file
のデバイス番号を設定するか、
あるいは
.Ar special_file
が文字列
.Dq Li off
の場合は
.Dv NODEV
(ダンプはとらないことを意味します)
を設定する、というものです。
.Sh 関連項目
.Xr sysctl 3 ,
.Xr init 8 ,
.Xr rc 8 ,
.Xr savecore 8
.Sh 関連ファイル
.Bl -tag -width /dev/[ws]d?b -compact
.It Pa /dev/[ws]d?b
標準のページングデバイス
.El
.Sh バグ
クラッシュダンプをとるときには
既にファイルシステムレイヤは動作していないので、
クラッシュダンプを直接ファイルに落すことはできません。
.Sh 歴史
.Nm
コマンドは
.Fx 2.1
で登場しました。
