freebsd/freebsd-doc/ja_JP.eucJP/man/man8/dump.8
.\" Copyright (c) 1980, 1991, 1993
.\"	 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)dump.8	8.3 (Berkeley) 5/1/95
.\" %FreeBSD: src/sbin/dump/dump.8,v 1.27.2.4 2001/03/04 11:00:52 obrien Exp %
.\"
.\" $FreeBSD$
.Dd May 1, 1995
.Dt DUMP 8
.Os BSD 4
.Sh 名称
.Nm dump ,
.Nm rdump
.Nd ファイルシステムのバックアップ
.Sh 書式
.Nm
.Op Fl 0123456789acknu
.Op Fl B Ar records
.Op Fl b Ar blocksize
.Op Fl d Ar density
.Op Fl f Ar file
.Op Fl h Ar level
.Op Fl s Ar feet
.Op Fl T Ar date
.Ar filesystem
.Nm
.Op Fl W Li \&| Fl w
.Pp
.in \" XXX
(
.Bx 4.3
形式のオプションは後方互換性のために実装されていますが、
ここでは説明していません。)
.Sh 解説
.Nm
は、ファイルシステムを調べて
バックアップする必要のあるファイルを決定します。
これらのファイルは、指定されたディスク、テープや、
その他の記憶メディアへ保存のためコピーされます
(リモートバックアップについては、
.Fl f
オプションを参照)。
ダンプの大きさが記録メディアの容量より大きい場合は、
複数ボリュームに分割します。
たいていのメディアの容量は、メディアの終りを通知されるまで
書き込んでみることで決定します。
この方法は、
.Fl a
オプションにより強制的に使用することもできます。
.Pp
メディアの終りを正しく通知できないメディア (一部の
カートリッジ・テープドライブ等) の容量は、
テープ長と記録密度やブロック数のオプションから求め、
各ボリュームはすべて同じ容量を持つものとします。
デフォルトでは、
オペレータにメディア交換を要求した後の各ボリュームにも
同じ出力ファイル名を使用します。
.Pp
.Nm
は、次のオプションをサポートしています。
.Bl -tag -width Ds
.It Fl 0\-9
ダンプレベル。
レベル 0 はフルバックアップを意味し、ファイルシステム全体をコピー
することを保証します (ただし以下の
.Fl h
オプションにも注意して下さい)。
0 より大きなレベル番号はインクリメンタルバックアップを意味し、
前回のダンプ (今回指定したものより低いレベルのダンプ)
以降に作られたか修正されたすべてのファイルをコピーします。
デフォルトのレベルは 0 です。
.It Fl B Ar records
ボリュームあたりの 1 KB ブロック数です。
このオプションは、テープ長と記録密度を基にしたテープ容量より
優先されます。
.It Fl a
.Dq オートサイズ
全てのテープ長の考慮をせず、メディアの終了を通知されるまで、強制的に
書き込みを続けます。現在のほとんどのテープドライブでは、この方法により
もっとも良い結果が得られます。特に、使いかけのテープに追加したり、
ハードウェア圧縮機能のあるテープドライブ(圧縮率がどの程度になるか不確かな
もの)を使用したりする場合にこのオプションを使用することをお薦めします。
.It Fl b Ar blocksize
ダンプレコードあたりのブロックサイズを K バイト単位で指定します。
.It Fl c
カートリッジテープドライブ用に、記録密度とテープ長のデフォルトをそれぞれ
8000 bpi、1700 feet に変更します。
.It Fl h Ar level
ダンプレベルが
.Ar level 
以上の時に、ユーザが指定した
.Dq nodump
フラグ
.Pq Dv UF_NODUMP
に従います (h: honor the flag)。
デフォルトの honor レベルは 1 ですから、
そのようなファイルは、インクリメンタルダンプからは省かれますが、
フルバックアップには含まれます。
.It Fl d Ar density
テープの記録密度を
.Ar density
に設定します。デフォルトは 1600BPI です。
.It Fl f Ar file
バックアップの出力先ファイルを指定します。
出力先ファイルとしては、
.Pa /dev/rsa0
(テープドライブ)や
.Pa /dev/fd1
(フロッピーディスクドライブ)のようなデバイスファイル、
通常ファイル、
.Ql Fl
(標準出力)を指定することができます。
複数のファイル名を、コンマで区切って一つの引数として指定する
ことができます。
各ファイルは、リストされた順に一つのダンプボリュームに使用されます。
指定した名前の数より多くのボリュームが必要な場合、
メディアの交換を要求した後、最後のファイル名を残りのすべての
ボリュームに使用します。
ファイル名が、
.Dq host:file 
または、
.Dq user@host:file 
の形式である場合、
.Nm
は、
.Xr rmt 8 
を使用してリモートホスト上の指定されたファイルに書き込みます。
リモートの
.Xr rmt 8
のデフォルトのパス名は
.Pa /etc/rmt
ですが、環境変数
.Ev RMT
の値が優先されます。
.It Fl k
リモートのテープサーバとの通信でケルベロス認証を使います。
(このオプションが有効な状態で
.Nm
がコンパイルされた場合にのみ利用できます。)
.It Fl n
.Nm
がオペレータに注意を促す時に、
.Xr wall 1 
に似た方法で
.Dq operator
グループに属するすべてのユーザにメッセージを送ります。
.It Fl s Ar feet
テープの容量を計算する時に記録密度とともに使います。
この容量を超えた場合に、
.Nm
は新しいテープを要求します。
このオプションはやや控え目に指定することをお勧めします。
デフォルトのテープの長さは、2300 フィートです。
.It Fl T Ar date
.Pa /etc/dumpdates
から得られた日時の代わりに、指定された date をダンプの起点として
使います。date の形式は
.Xr ctime 3
のそれと同じです。このオプションは期間を指定してバックアップを
取るダンプスクリプトで有用です。
.Fl T
オプションは
.Fl u
オプションと同時には指定できません。
.It Fl u
ダンプが成功した後で、
.Pa /etc/dumpdates
ファイルを更新します。
.Pa /etc/dumpdates
は人が読めるファイルであり、各行に以下のレコードが
フリーフォーマットで記録されています : 
ファイルシステム名、インクリメントレベル、
.Xr ctime 3
形式のダンプ日付。
各レベルとファイルシステムごとにエントリが一つだけ存在します。
必要なら、
.Pa /etc/dumpdates
の各フィールドを編集しても構いません。
.It Fl W
.Nm
は、ダンプの必要があるファイルシステムをオペレータに表示します。
この情報は
.Pa /etc/dumpdates
と
.Pa /etc/fstab 
ファイルから集められます。
.Nm
は、
.Pa /etc/dumpdates
の中の各ファイルシステム毎に最新のダンプ日付とレベルを示し、
ダンプするべきファイルシステムを明らかにします。
.Fl W
オプションが指定された場合、その他のすべてのオプションは無視され、
.Nm
は直ちに終了します。
.It Fl w
W と同様ですが、ダンプの必要のあるファイルシステムのみを表示します。
.El
.Pp
.Nm
は、通常ファイルおよびディレクトリのユーザ
.Dq nodump
フラグ
.Pq Dv UF_NODUMP
を尊重します。
ディレクトリに
.Dq nodump
の印が付いていると、このディレクトリと、
その配下の全ファイルとディレクトリが、バックアップされなくなります。
ディレクトリの
.Dq nodump
フラグを、
.Nm
はこのように伝播させます。
.Pp
.Nm
は、以下に示す場合にオペレータの介入を要求します : 
テープの終了、
ダンプの終了、
テープ書き込みエラー、
テープオープンエラー、
ディスク読み込みエラー (32 回を越えた場合)。
処理を続けられない時や何か大変まずい事態になった場合には、
.Nm
は、
.Fl n
オプションがあればすべてのオペレータへ警告したうえで、
.Em dump
の制御端末上でオペレータとやりとりします。
.Nm
コマンドからのすべての質問には、
.Dq yes
または
.Dq no 
で適切に答えなければなりません。
.Pp
フルダンプの実施には多くの時間と労力がかかるので、
.Nm
は各テープボリュームの先頭にチェックポイントを設定します。
何らかの理由により、あるボリュームの書き込みを失敗した場合には、
テープの巻き戻し、排出、新しいテープのマウントの後で、
.Nm
はオペレータの許可の下でチェックポイントから実行を再開します。
.Pp
.Nm
は処理の進行を定期的にオペレータに報告します。
報告には、少なめに推定される書き込みブロック数、
必要なテープ数、完了までの時間、テープ交換までの時間、
を含みます。
.Nm
に使っている端末が使用中であることが他人にも分かるように、
このメッセージは冗長になっています。
.Pp
ディスクに壊滅的なトラブルが起きた時に、
バックアップテープやファイルからディスクを復元するために
必要な時間は、
インクリメンタルダンプを適当なシーケンスで実行する事によって
最小にする事ができます。
最小のテープ数でこれを行なう効果的な方法を示します。
.\"	staggering
.Bl -bullet -offset indent
.It
常にレベル 0 のバックアップから開始します。例えば以下の通りです。
.Bd -literal -offset indent
/sbin/dump -0u -f /dev/nrsa0 /usr/src
.Ed
.Pp
これを一ヵ月か二ヵ月毎に新しいテープに対して実施し、
ずっと保存します。
.It
0 レベルのダンプの後は、アクティブなファイルシステムのダンプを、
修正ハノイの塔アルゴリズムによる
次の様なダンプレベルシーケンスによって、毎日行います。
.Bd -literal -offset indent
3 2 5 4 7 6 9 8 9 9 ...
.Ed
.Pp
毎日のダンプには、一週間毎に繰り返し使われる事になる
一定の数のテープを使う事ができます。
週毎にレベル 1 ダンプを行ない、毎日のハノイ・シーケンスは
レベル 3 から開始します。
週毎のダンプには、ダンプするファイルシステム毎に、これも繰り返し
使われる事になる一定数のテープを使います。
.El
.Pp
何ヵ月かの後、毎日と毎週のテープはダンプサイクルから順に外し、
新品のテープを導入すべきです。
.Sh 環境変数
環境変数
.Ev RMT
は、リモートの
.Xr rmt 8
プログラムのパス名を決定するのに用いられます。
.Sh 関連ファイル
.Bl -tag -width /etc/dumpdates -compact
.It Pa /dev/rsa0
デフォルトのダンプテープユニット
.It Pa /etc/dumpdates
ダンプの日付を記録するファイル
.It Pa /etc/fstab
ダンプテーブル : ファイルシステムと頻度を決めるファイル
.It Pa /etc/group
.Em operator
グループを検索する
.El
.Sh 関連項目
.Xr fstab 5 ,
.Xr restore 8 ,
.Xr rmt 8
.Sh 診断
詳しいメッセージがたくさん出ます。
.Pp
正常時は終了コード 0 で終了します。
開始時のエラーは終了コード 1 で、
異常終了は終了コード 3 で表されます。
.Sh バグ
32 個未満のファイルシステムからの読み取りエラーは無視されます。
.Pp
各リール (ボリューム) ごとに新たなプロセスが作られ、
リールを書き終った親プロセスは
テープ全体の書き込みが終るまで待っています。
.Pp
現状では、
.Xr physio 9
スライスのリクエストは 64 KB の塊になります。したがって、それより大きな
テープのブロックサイズを使用することはできず、
.Nm
はこれが発生するのを防ぎます。
.Pp
.Nm
の
.Fl W
や
.Fl w
オプションは、
.Pa /etc/fstab 
にリストされていても、
.Pa /etc/dumpdates 
に記録のないファイルシステムについては報告しません。
.Pp
.Nm
コマンドが、
ダンプシーケンスについて知っていて、
使い散らかしたテープの使用履歴を管理でき、
どのテープをマウントすれば良いかオペレータに教えてくれ、
.Xr restore 
を実行するオペレータをもっと助けてくれたら、
もっと使いやすいでしょうね。
.Pp
セキュリティ的な歴史により、
.Nm
は、root 以外のユーザでリモートバックアップを行うことはできません。
これは、
.Fx
の今後のバージョンでは修正されるでしょう。
現状では、(従来通り) setuid されていれば正常に動作しますが、
セキュリティ的なリスクを伴います。
.Sh 歴史
.Nm
コマンドは、
.At v6
から登場しました。
