freebsd/freebsd-doc/ja_JP.eucJP/man/man8/dumpon.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)swapon.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/dumpon/dumpon.8,v 1.30 2004/07/18 09:57:47 maxim Exp %
.\" $FreeBSD$
.\"
.Dd May 12, 1995
.Dt DUMPON 8
.Os
.Sh 名称
.Nm dumpon
.Nd クラッシュダンプ用デバイスの指定
.Sh 書式
.Nm
.Op Fl v
.Ar special_file
.Nm
.Op Fl v
.Cm off
.Sh 解説
.Nm
ユーティリティは、パニック時にカーネルがクラッシュダンプをセーブするデバイスを
指定するのに用いられます。
.Pp
通常、
.Nm
はシステムのマルチユーザ初期化ファイル
.Pa /etc/rc
の中で呼び出され、ブート時の設定ファイル
.Pa /etc/rc.conf
の変数
.Dq dumpdev
によって制御されます。
.Pp
ほとんどのシステムでは、
指定したダンプデバイスは、
少なくとも物理メモリと同容量である必要があります。
ダンプに追加ヘッダが追加されるとしても、
プラットフォーム BIOS が典型的にはいくばくかのメモリを取ってしまいますので、
システムで使用可能な実際の RAM 容量よりもダンプサイズを大きくすることは
通常不要です。
.Pp
.Fl v
フラグは
.Nm
にその処理に関する詳細情報を出力させます。
.Sh 実装に関する注
ファイルシステムの状態のカーネル内部表現が信用できない状態で、
.Xr panic 9
条件が発生し得ます。
このため、システムスワップデバイスであって、ファイルシステムを含ま
.Em ない
デバイスの 1 つを、ダンプデバイスとして使用すべきです。
.Pp
.Nm
ユーティリティは
.Ar special_file
をオープンし、それに対して
.Dv DIOCSKERNELDUMP
.Xr ioctl 2
リクエストを行うことでカーネルクラッシュダンプを保存します。
.Ar special_file
がテキスト文字列
.Dq Li off
の場合、
.Nm
は
.Dv DIOCSKERNELDUMP
.Xr ioctl 2
を
.Pa /dev/null
に対して実行するので、カーネルはクラッシュダンプを保存しません。
.Pp
.Nm
はカーネル初期化中には使用できませんので、
カーネル初期化中のシステムパニックのダンプ生成用には、
.Xr loader 8
が提供する
.Va dumpdev
変数を使用してください。
.Sh 関連項目
.Xr fstab 5 ,
.Xr rc.conf 5 ,
.Xr config 8 ,
.Xr init 8 ,
.Xr loader 8 ,
.Xr rc 8 ,
.Xr savecore 8 ,
.Xr swapon 8 ,
.Xr panic 9
.Sh 関連ファイル
.Bl -tag -width "/dev/{ad,da}?s?b" -compact
.It Pa /dev/{ad,da}?s?b
標準のスワップ領域
.It Pa /etc/rc.conf
ブート時のシステム設定
.El
.Sh バグ
クラッシュダンプをとるときには
既にファイルシステムレイヤは動作していないので、
クラッシュダンプを直接ファイルに落すことはできません。
.Sh 歴史
.Nm
ユーティリティは
.Fx 2.1
で登場しました。
