freebsd/freebsd-doc/ja_JP.eucJP/man/man8/edquota.8
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)edquota.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/edquota/edquota.8,v 1.22 2004/08/07 04:27:50 imp Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 6, 1993
.Dt EDQUOTA 8
.Os
.Sh 名称
.Nm edquota
.Nd ユーザの割り当て制限を変更する
.Sh 書式
.Nm
.Op Fl u
.Op Fl f Ar fspath
.Op Fl p Ar proto-username
.Ar username ...
.Nm
.Op Fl u
.Fl e
.Sm off
.Ar fspath Op : Ar bslim Op : Ar bhlim Op : Ar islim Op : Ar ihlim
.Sm on
.Op Fl e Ar ...
.Ar username ...
.Nm
.Fl g
.Op Fl f Ar fspath
.Op Fl p Ar proto-groupname
.Ar groupname ...
.Nm
.Fl g
.Fl e
.Sm off
.Ar fspath Op : Ar bslim Op : Ar bhlim Op : Ar islim Op : Ar ihlim
.Sm on
.Op Fl e Ar ...
.Ar groupname ...
.Nm
.Fl t
.Op Fl u
.Op Fl f Ar fspath
.Nm
.Fl t
.Fl g
.Op Fl f Ar fspath
.Sh 解説
.Nm
ユーティリティは割り当て制限を変更するエディタです。
デフォルトで (または
.Fl u
オプションが指定された場合) は、
コマンドラインから 1 人以上のユーザを指定できます。
それぞれのユーザの現在の割り当て制限を、
.Tn ASCII
テキストで記述した一時ファイルが作成されます。
ユーザ割り当て制限が設定されているファイルシステムは
.Pa /etc/fstab
の記述から検索します。
次に、
作成された
.Tn ASCII
ファイルを編集できるようにエディタが起動されます。
環境変数
.Ev EDITOR
で指定されていなければ、
.Xr vi 1
が起動されます。
.Pp
このエディタ上で、
割り当て制限を変更したり、
追加したりできます。
割り当て制限値を 0 に設定することは、
割り当て制限を行わないことを示します。
ハードリミット値を 1 に設定することは、
ファイルを作成できないようにすることを意味します。
ソフトリミット値を 1 に設定し、
ハードリミットを 0 に設定することは、
一時的な用途にのみ割り当てを許可することを意味します (
.Fl t
の項を参照)。
現在使用量は参考のためにのみ出力され、
変更しても意味はありません。
.Pp
エディタを終了すると、
.Nm
は一時ファイルを読み込み、
変更を反映するよう割り当て制限用バイナリファイルを書き換えます。
.Pp
.Fl p
オプションが指定された場合、
.Nm
は、指定されたユーザに proto-username に対する設定をコピーします。
これは、
複数のユーザに割り当て制限を設定する一般的な方法です。
制限を設定するユーザとして数字で uid の範囲 (例えば、1000-2000) が
指定されたとき、
.Nm
は、指定された範囲の uid のユーザについて設定をコピーします。
これにより、まとめてユーザにデフォルトの制限を設定することが出来ます。
制限を設定する uid は、
.Pa /etc/passwd
に書かれていない値でも構いません。
.Pp
.Fl e
.Sm off
.Ar fspath Op : Ar bslim Op : Ar bhlim Op : Ar islim Op : Ar ihlim
.Sm on
オプションのうち 1 個以上が指定された場合、
.Nm
は、
.Ar fspath
で示されるファイルシステムに対し
.Ar bslim , bhlim , islim , ihlim
で定義される制限を非対話的に設定します。
ここで
.Ar bslim
はブロック数のソフト制限、
.Ar bhlim
はブロック数のハード制限、
.Ar islim
はファイル数のソフト制限、
.Ar ihlim
はファイル数のハード制限です。
.Ar bslim , bhlim , islim , ihlim
値のいずれかが省略された場合、それは 0 と仮定され、
制限無しとなることを示します。
.Pp
.Fl f
オプションが指定された場合、
.Nm
は
.Ar fspath
で指定されたファイルシステムのみの制限を読み取って変更します。
.Ar fspath
引数は、特殊デバイスでもファイルシステムマウントポイントでも構いません。
本オプションの第一義は、全ファイルシステムの制限レコードを書き換えてしまう
.Fl p
オプションの影響範囲を設定することです。
.Pp
.Fl g
オプションが指定された場合、
.Nm
はコマンドラインで指定された 1 つ以上のグループに
対する割り当て制限を変更します。
.Fl p
オプションを
.Fl g
オプションと
いっしょに使用することにより、
.Fl p
オプションで指定したグループの設定を
他のグループにコピーすることができます。
同様に、
.Fl e
オプションを
.Fl g
オプションといっしょに使用することにより、
列挙したグループの集合の制限を非対話的に設定することができます。
.Pp
ユーザはある一定の猶予期間だけ、
ソフトリミットを超えてファイルシステムを利用することができます。
猶予期間を過ぎるとソフトリミットは
ハードリミットと同じ意味を持つようになり、
それ以上のファイルの割り当てができなくなります。
デフォルトの猶予期間は
.In ufs/ufs/quota.h
で定義されています。
.Fl t
オプションにより猶予期間を変更することができます。
デフォルトで、
あるいは
.Fl u
オプションを
指定して起動した場合は、
.Pa /etc/fstab
に指定してあるすべてのユーザ割り当て制限に対して猶予期間が設定されます。
.Fl g
オプションを指定して
起動した場合は、
.Pa /etc/fstab
に指定してあるすべてのグループ割り当て制限に対して猶予期間が設定されます。
猶予期間は、
日、
時、
分、
秒を指定して設定することができます。
猶予期間を 0 に設定することは、
デフォルトの猶予期間を指定したものとみなされます。
また、
猶予期間を 1 秒に設定することは、
猶予期間なしとみなされます。
.Pp
スーパユーザのみが割り当て制限を変更することができます。
.Sh 関連ファイル
.Bl -tag -width quota.group -compact
.It Pa quota.user
ファイルシステムのルートにあるユーザ割り当て制限に関するデータ
.It Pa quota.group
ファイルシステムのルートにあるグループ割り当て制限に関するデータ
.It Pa /etc/fstab
ファイルシステムの名前と位置を読み取る
.El
.Sh 関連項目
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr quotacheck 8 ,
.Xr quotaon 8 ,
.Xr repquota 8
.Sh 診断
アクセス不可能なファイルに対して、様々なメッセージを出力します。
