freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fdcontrol.8
.\" 
.\" Copyright (C) 1994 by Joerg Wunsch, Dresden
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
.\" OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
.\" BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
.\" LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE
.\" USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/fdcontrol/fdcontrol.8,v 1.9.2.1 2000/12/08 15:28:05 ru Exp %
.\"
.\" jpman %Id: fdcontrol.8,v 1.3 1997/08/16 13:14:53 horikawa Stab %
.Dd May 22, 1994
.Os
.Dt FDCONTROL 8
.Sh 名称
.Nm fdcontrol
.Nd フロッピディスクパラメータの変更
.Sh 書式
.Nm
.Op Fl d Ar 0|1
.Ar device
.Nm
.Op Fl s
.Ar device
.Sh 解説
.Nm
は
.Ar device
で指定したフロッピディスクデバイスの実行時の振る舞いを変更します。
.Ar device
はキャラクタデバイスでなければなりません。
.Pp
現在のところ
.Nm
では、
フロッピディスクドライブのデバイスパラメータの指定
.Po
.Fl s ,
これがデフォルトモードでもあります
.Pc
や、フロッピドライバが
.Em DEBUG
オプション付きでカーネルに組み込まれている場合には
ドライバのデバッグレベルの変更
.Pq Fl d
を行なうことができます。
.Pp
これらの操作は他に悪影響を及ぼす可能性があるため、
この中で行なわれる
.Xr ioctl 2
コマンドの実行はスーパユーザに限定されています。
.Pp
新しいパラメータ指定を要求すると、
.Nm
は調整可能な各パラメータをユーザに問い合わせてきます。
これらは現在使われている値がデフォルト値となっています。
.Sh 診断
内部で呼び出される
.Xr ioctl 2
のエラーコードが
.Xr warn 3
によって表示されます。
.Sh バグ
.Nm
コマンドは現在開発途上です。
ユーザインタフェースはややお粗末で、将来は変更される可能性があります。
コマンドラインから何でも変更できるようなオプション整備も必要でしょう。
.Pp
現実のドライバはデバッグレベルとして
.Pq 0 and 1
しかサポートしていません。
デバッグレベル 1 にすると非常に多量の出力を生成するので、
よく注意して使わないと syslog をあふれさせかねません。
.Sh 関連項目
.Xr ioctl 2 ,
.Xr warn 3 ,
.Xr fdc 4
.Sh 歴史
.Nm
は現在開発途上です。
そのユーザインタフェースと全体機能は、
将来改良あるいは変更される可能性があります。
.Sh 作者
本プログラムは
.if n Joerg Wunsch,
.if t J\(:org Wunsch,
Dresden
から寄贈されました。
