freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ffsinfo.8
.\" Copyright (c) 2000 Christoph Herrmann, Thomas-Henning von Kamptz
.\" Copyright (c) 1980, 1989, 1993 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Christoph Herrmann and Thomas-Henning von Kamptz, Munich and Frankfurt.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors, as well as Christoph
.\"      Herrmann and Thomas-Henning von Kamptz.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $TSHeader: src/sbin/ffsinfo/ffsinfo.8,v 1.3 2000/12/12 19:30:55 tomsoft Exp $
.\" %FreeBSD: src/sbin/ffsinfo/ffsinfo.8,v 1.14 2004/01/23 05:13:22 cperciva Exp %
.\"
.\" $FreeBSD$
.Dd September 8, 2000
.Dt FSINFO 8
.Os
.Sh 名称
.Nm ffsinfo
.Nd 既存の UFS ファイルシステムのすべてのメタ情報をダンプする
.Sh 書式
.Nm
.Op Fl g Ar cylinder_group
.Op Fl i Ar inode
.Op Fl l Ar level
.Op Fl o Ar outfile
.Ar special | file
.Sh 解説
.Nm ffsinfo
ユーティリティは
.Xr dumpfs 8
ユーティリティを拡張したものです。
.Pp
出力は
.Pa outfile
ファイルに追加されます。
この時、比較的大きな出力ファイルとなります。
指定したファイルシステムの 2% ほどになることも珍しくありません。
.Pp
以下のオプションが指定できます:
.Bl -tag -width indent
.It Fl g Ar cylinder_group
指定されたシリンダグループの情報のみダンプするよう制限します。
ここで
.Ar 0
は、最初のシリンダグループを意味し、
.Ar -1
は最後のシリンダグループを意味します。
.It Fl i Ar inode
特定の inode の情報のみをダンプするよう制限します。
指定可能な最小の inode は
.Ar 2
です。
このオプションが省略されて、シリンダグループが定義されていた場合、
そのシリンダグループ内の inode のみがダンプされます。
.It Fl l Ar level
ダンプされる詳細レベルを指定します。
この値のデフォルト値は
.Ar 255
で、以下の表の値の
.Dq ビット論理和
で表されます:
.Pp
.Bl -hang -width indent -compact
.It Ar 0x001
イニシャルスーパブロック
.It Ar 0x002
各シリンダグループ内のスーパブロックのコピー
.It Ar 0x004
イニシャルシリンダグループ内のシリンダグループのサマリ情報
.It Ar 0x008
シリンダグループ情報
.It Ar 0x010
inode 割り当てビットマップ
.It Ar 0x020
フラグメント割り当てビットマップ
.It Ar 0x040
クラスタのマップおよびサマリ情報
.It Ar 0x100
inode 情報
.It Ar 0x200
インダイレクトブロックダンプ
.El
.It Fl o Ar outfile
ダンプの出力先ファイルを変更します。
現在のデフォルトは
.Pa /var/tmp/ffsinfo
です。
.Fl
が指定された場合、出力は stdout に対して送られます。
.El
.Sh 使用例
.Dl ffsinfo -l 1023 /dev/vinum/testvol
.Pp
は、
.Pa /dev/vinum/testvol
のすべての有効な情報をダンプします。
.Sh バグ
スナップショットは通常のファイルと同じように扱われます。
これらも、何がダンプされるかの総量を独立して制御するために、
スナップショット特有のダンプレベルが設定されるべきです。
またスナップショットをファイルシステムとしてダンプするように
多少拡張することも、おそらく有用でしょう。
.Sh 関連項目
.Xr disklabel 8 ,
.Xr dumpfs 8 ,
.Xr fsck 8 ,
.Xr growfs 8 ,
.Xr newfs 8 ,
.Xr tunefs 8 ,
.Xr vinum 8
.Sh 作者
.An Christoph Herrmann Aq chm@FreeBSD.org
.An Thomas-Henning von Kamptz Aq tomsoft@FreeBSD.org
.An The GROWFS team Aq growfs@Tomsoft.COM
.Sh 歴史
.Nm
ユーティリティは
.Fx 4.4
で初めて登場しました。
