freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fingerd.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)fingerd.8	8.1 (Berkeley) 6/4/93
.\" %FreeBSD: src/libexec/fingerd/fingerd.8,v 1.4 1999/08/28 23:08:18 mpp Exp %
.\" jpman %Id: fingerd.8,v 1.2 1997/05/21 00:55:57 mitchy Stab %
.\"
.Dd June 4, 1993
.Dt FINGERD 8
.Os BSD 4.3
.Sh 名称
.Nm fingerd
.Nd 他のホストからの finger 要求に応えるサーバプログラム
.Sh 書式
.Nm fingerd
.Op Fl s
.Op Fl l
.Op Fl p Ar filename
.Sh 解説
.Nm
は、ネットワークの各サイト上の name と finger プログラムとの
インタフェースを提供する、
.%T RFC1196
で規定されるプロトコルを実現するデーモンプログラムです。
このプログラムはシステムあるいは特定の人について
人間的で親しみやすい状況報告をするものです。
特別なフォーマットは規定されておらず、プロトコルは 1 行ずつ
コマンドラインのような形式でやりとりされます。
.Pp
.Nm
は、
.Tn TCP
の 79 番ポートを見張っている
.Xr inetd 8
から開始されます。接続されると、
.Aq Tn CRLF
で区切られたコマンドライン 1 行を受け取ります。これは
.Xr finger 1
に送られ、処理されます。
.Nm
は、出力が終わるとすぐに接続を切ります。
.Pp
もし、そのコマンドラインがヌルの (つまり
.Aq Tn CRLF
だけが送られた) 場合、
.Xr finger
は
.Dq デフォルト
の出力を行ないます。デフォルトは、その時にシステムにログインしている全ての
人のリストです。
.Pp
もし、ユーザ名が指定されると (たとえば
.Pf eric Aq Tn CRLF
) 出力は、その人に関する詳細な情報だけとなります。これには、
ログインしている/いないの情報も含まれます。
コマンドラインの
.Dq names
は、
.Dq ログイン名
と
.Dq ユーザ名
のどちらでもかまいません。
名前が曖昧な場合は、マッチするものすべてについて表示されます。
.Pp
.Nm
に渡す引数として、
.Pa /etc/inetd.conf
の中で指定できるオプションは以下のとおりです:
.Bl -tag -width indent
.It Fl s
secureモードを有効にします。ユーザ名なしの問い合わせと、他の
リモートホストへの問い合わせの転送は拒否されます。
.It Fl l
ログをとります。問い合わせをしたホストの名前を
.Xr syslog 3
を通して LOG_NOTICE の優先度で報告します。
.It Fl p
ローカルの情報提供元としてデフォルト以外のプログラムを使います。
.Nm
によって起動されるデフォルトのローカルプログラムは、
.Xr finger 1 
です。カスタマイズされたローカルサーバを指定することにより、
システム管理者はリモートサイトに提供する情報を
さらにコトロールできます。
.El
.Sh 関連項目
.Xr finger 1 ,
.Xr inetd 8
.Sh バグ
サーバに
.Tn TIP
や、同じくらい見識の狭い
.Tn TELNET Ns \-protocol
ユーザプログラムで直接コネクトすると、
サーバに意味の無いネゴシエーションオプションを送ることになり
不正なコマンドライン解釈を行う可能性があります。
.Nm
は、
.Tn IAC
のものをフィルタリングして除くべきであり、おそらく
受け取った全てのオプションコマンドを否定するよう
.Pq Tn IAC 拒否
をするべきです。
.Sh 歴史
.Nm
コマンドは
.Bx 4.3
から登場しました。
