freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fixmount.8
.\"
.\" Copyright (c) 1997-1998 Erez Zadok
.\" Copyright (c) 1990 Jan-Simon Pendry
.\" Copyright (c) 1990 Imperial College of Science, Technology & Medicine
.\" Copyright (c) 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Jan-Simon Pendry at Imperial College, London.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%W% (Berkeley) %G%
.\"
.\" %Id: fixmount.8,v 1.3 1998/09/12 04:04:58 obrien Exp %
.\" jpman %Id: fixmount.8,v 1.3 1998/11/21 14:55:42 horikawa Stab %
.\"
.Dd February 26, 1993
.Dt FIXMOUNT 8
.Os
.Sh "名称"
.Nm fixmount
.Nd リモートマウントエントリを修正する
.Sh "書式"
.Nm
.Op Fl adervq
.Op Fl h Ar name
.Ar host
\&...
.Sh "解説"
.Nm
は、
.Xr showmount 8
の一種で、
リモートの
.Xr mountd 8
デーモンの中の腐ったマウントエントリを削除することができます。
オプションで指定するアクションは、
.Ar host 
それぞれに対して順次適用されます。
.Sh "オプション"
.Bl -tag -width Ds
.It Fl a Fl d Fl e
このオプションは、ローカルホストに属すエントリのみが表示されるという
点を除けば、
.Xr showmount 8
のそれのように動作します。
.It Fl r
.Ar host
上のリモートマウントエントリで現在のマウントと一致しないもの、
すなわちクラッシュにより残されてしまったエントリや、
不適切なマウントプロトコルの結果生じたエントリなどを削除します。
実際にマウントされているかどうかは、
.Pa /etc/mtab
にあるエントリを用いて確認します。
.It Fl v
リモートのマウントを確認します。
腐ったエントリひとつひとつについて通知メッセージが表示される
点を除けば、
.Fl r
と同様です。
リモートマウントテーブルは変更されません。
.It Fl A
リモートの mountd に対して、
.Em すべて
のファイルシステムがアンマウントされてしまっていることを宣言する
コマンドを発行します。このコマンドは十分注意して用いるべきです。
というのは、
ローカルで今なおマウントしているファイルシステムの有無に
かかわらず、ローカルシステムに属すリモートマウントエントリの
すべてを削除してしまうからです。
.It Fl v
静かにします。タイムアウトや、
.Dq Program not Registered
すなわち、リモートホストが RPC をサポートしていないことや、
.Nm mountd
を実行していないことによるエラーメッセージを抑止します。
.It Fl h Ar name
ローカルホスト名が
.Ar name
であるかのように振舞います。
これは、ローカルホスト名が変更されたあとで、古い名前を使っている rmtab
エントリがリモートマシン上に残っている場合に有用です。
残念ながら、mountd のほとんどは、このようなエントリの削除をうまく
扱うことができません。ですから、このオプションは、
.Fl v
だけと組み合わせて使うと有用です。
.Pp
このオプションは、リモートで記録されたホスト名とローカルのホスト名を
アドレスで比較する際の時間を節約することにもなります。
.Sh "関連ファイル"
.Bl -tag -width /axx
.It Pa /etc/mtab
現在のマウントのリスト。
.It Pa /etc/rmtab
.Tn NFS
サーバ上にある、リモートマウントエントリのバックアップファイル。
.El
.Sh "関連項目"
.Xr mtab 5 ,
.Xr rmtab 5 ,
.Xr mountd 8 ,
.Xr showmount 8
.Sh "バグ"
.Pa /etc/mtab
それ自身の情報を確認しようとすることは一切しません。
.Pp
スワップファイルのマウントは
.Pa /etc/mtab
に記録されないため、
そのようなマウントが実際に生じているかどうかを判断するために、
SunOS 固有の判断の工夫を用いています (文字列
.Ql swap 
を
.Ql root
と置換して、その結果のパスを確認しています)。
.Pp
サーバ上のシンボリックリンクは、リモートエントリのパスと
.Pa /etc/mtab
の中のパスとが異なる原因になります。
このような事象の発生を捕まえるには、
.Em ローカルの
マウントポイントがリモートエントリと同一の場合に、ファイルシステムが
マウントされていると考えることです。
例えば、SunOS のディスクレスクライアント上の
.Ic server:/export/share/sunos.4.1.1
は、実際は
.Pa /usr/share
です。
ローカルのマウントポイントが同様に
.Pa /usr/share
であるから、このマウントを正しく扱うことができるのです。
.Pp
ローカルホスト名 (または名前の逆引きが返すもの) が変更された後で、
リモートの
.Nm mountd
の中の無効(stale)エントリをクリアする方法はありません。
このような場合の面倒を見るためには、リモートの
.Pa /etc/rmtab
を編集し、
.Nm mountd
を再スタートさせる必要があります。
.Pp
.Nm mountd
呼び出しの RPC タイムアウトの変更は、再コンパイルするしかありません。
クライアントハンドル生成のデフォルトは 2 秒で、RPC 呼び出しの
デフォルトは 5 秒です。
.Sh "作者"
.An Jan-Simon Pendry Aq jsp@doc.ic.ac.uk ,
Department of Computing, Imperial College, London, UK.
.Pp
.An Erez Zadok Aq ezk@cs.columbia.edu ,
Department of Computer Science, Columbia University, New York, USA.
.Pp
.An 他の作者
と
.Nm am-utils
に貢献した人のリストは、
.Nm am-utils
とともに配布されるファイル
.Nm AUTHORS 
の中にあります。
.Sh "歴史"
.Nm
ユーティリティは
.Fx 3.0
で登場しました。
