freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fore_dnld.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) %FreeBSD: src/sbin/atm/fore_dnld/fore_dnld.8,v 1.1.2.2 2000/03/03 14:59:51 sheldonh Exp %
.\" jpman %Id: fore_dnld.8,v 1.3 1998/11/21 14:56:04 horikawa Stab %
.\"
.\" WORD: COPYRIGHT	著作権[.SH]
.\" WORD: current directory	カレントディレクトリ
.\"
.de EX		\"Begin example
.ne 5
.if n .sp 1
.if t .sp .5
.nf
.in +.5i
..
.de EE
.fi
.in -.5i
.if n .sp 1
.if t .sp .5
..
.TH FORE_DNLD 8 "1996-12-03" "HARP"
.SH 名称
fore_dnld \- FORE Systems 社のマイクロコードをホスト ATM アダプタに
ダウンロードする
.SH 書式
.B fore_dnld
[-i intf]
[-d path]
[-f objfile]
.sp
.fi
.SH 解説
.I fore_dnld
は、FORE Systems 社のマイクロコードをホスト ATM アダプタに
ダウンロードします。
.fi
.SH オプション
.TP
.B \-i intf
どの ATM インタフェースにマイクロコードをダウンロードするかを指定します。
デフォルトでは、FORE Systems 社のホストアダプタすべてにマイクロコード
をロードします。
.TP
.B -d path
"objfile" の名前の前に付けるパスを指定します。
デフォルトでは、カレントディレクトリを使います。
.TP
.B -f objfile
マイクロコードのバイナリファイルを指定します。デフォルトでは、
SBA-200 アダプタには "sba200.obj" を、
SBA-200E アダプタには "sba200e.obj" を、
PCA-200E アダプタには "pca200e.bin" を使用します。
.fi
.SH 注
.PP
FORE Systems 社によって配布されるマイクロコードは、直接 SBA ホスト ATM 
アダプタにダウンロードできるようになっていません。提供された
マイクロコードを "objcopy" コマンドで処理して、ダウンロードに適した
イメージを生成する必要があります。"objcopy" の引数は、"-S -l -Fcoff"
です。PCA ホスト ATM アダプタ用に FORE Systems 社から配布される
マイクロコードについては、とくに処理する必要はありません。
.SH 関連項目
.PP
~fore/etc/objcopy - FORE Systems 社が配布するマイクロコードを処理するコマンド
.PP
~fore/etc/sba200*.ucode* - SBA アダプタ用に FORE Systems 社が提供するマイクロコード
.PP
~fore/i386/pca200e.bin - PCA アダプタ用に FORE Systems 社が提供するマイクロコード
.PP
~harp/doc/Install - HARP のインストール指示書
.fi
.SH バグ
.PP
知られているものはありません。
.fi
.SH 著作権
Copyright (c) 1994-1998, Network Computing Services, Inc.
.fi
.SH 作者
John Cavanaugh, Minnesota Supercomputer Center, Inc.
.br
Mike Spengler, Minnesota Supercomputer Center, Inc.
.br
Joe Thomas, Minnesota Supercomputer Center, Inc.
.fi
.SH 謝辞
本ソフトウエアは Defense Advanced Research Projects Agency (DARPA) の
協力(契約番号 F19628-92-C-0072 及び F19628-95-C-0215)により
開発されました。
