freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fore_dnld.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) %FreeBSD: src/sbin/atm/fore_dnld/fore_dnld.8,v 1.7 2003/07/31 14:26:07 harti Exp %
.\" $FreeBSD$
.\"
.\" WORD: current directory	カレントディレクトリ
.\"
.Dd December 3, 1996
.Dt FORE_DNLD 8
.Os
.Sh 名称
.Nm fore_dnld
.Nd "FORE Systems 社のマイクロコードをホスト ATM アダプタにダウンロードする"
.Sh 書式
.Nm
.Op Fl 3
.Op Fl i Ar intf
.Op Fl d Ar path
.Op Fl f Ar objfile
.Op Fl r
.Sh 解説
.Nm
ユーティリティは、FORE Systems 社のマイクロコードをホスト ATM アダプタに
ダウンロードします。
.Sh オプション
.Bl -tag -width indent
.It Fl i Ar intf
どの ATM インタフェースにマイクロコードをダウンロードするかを指定します。
デフォルトでは、FORE Systems 社のホストアダプタすべてにマイクロコード
をロードします。
.It Fl d Ar path
.Ar objfile
の名前の前に付けるパスを指定します。
デフォルトでは、カレントディレクトリを使います。
.It Fl f Ar objfile
マイクロコードのバイナリファイルを指定します。デフォルトでは、
SBA-200 アダプタには
.Pa sba200.obj
を、
SBA-200E アダプタには
.Pa sba200e.obj
を、
PCA-200E アダプタには
.Pa pca200e.bin
を使用します。
.El
.Sh 注
PCA200E アダプタに対しては、コマンドラインでファイルを指定しない場合、
組み込みのバージョン 4.1.12 マイクロコードが使用されます。
.Fl 3
オプション指定時には、バージョン 3.0.1 マイクロコードが使用されます。
.Pp
FORE Systems 社によって配布されるマイクロコードは、直接 SBA ホスト ATM
アダプタにダウンロードできるようになっていません。提供された
マイクロコードを
.Xr objcopy 1
コマンドで処理して、ダウンロードに適した
イメージを生成する必要があります。
.Xr objcopy 1
の引数は、
.Dq Li "-S -l -Fcoff"
です。
.Pp
PCA ホスト ATM アダプタ用に FORE Systems 社から配布される
マイクロコードについては、とくに処理する必要はありません。
.Sh 関連ファイル
.Bl -tag -width indent
.It Pa ~fore/etc/objcopy
FORE Systems 社が配布するマイクロコードを処理するコマンド
.It Pa ~fore/etc/sba200*.ucode*
SBA アダプタ用に FORE Systems 社が提供するマイクロコード
.It Pa ~fore/i386/pca200e.bin
PCA アダプタ用に FORE Systems 社が提供するマイクロコード
.It Pa ~harp/doc/Install
HARP のインストール指示書
.El
.Sh バグ
知られているものはありません。
.Sh COPYRIGHT
Copyright (c) 1994-1998, Network Computing Services, Inc.
.Sh 作者
.An John Cavanaugh ,
Minnesota Supercomputer Center, Inc.
.An Mike Spengler ,
Minnesota Supercomputer Center, Inc.
.An Joe Thomas ,
Minnesota Supercomputer Center, Inc.
.Sh 謝辞
本ソフトウエアは Defense Advanced Research Projects Agency (DARPA) の
協力 (契約番号 F19628-92-C-0072 及び F19628-95-C-0215) により
開発されました。
