freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fsck.8
.\"
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)fsck.8	8.4 (Berkeley) 5/9/95
.\" %FreeBSD: src/sbin/fsck/fsck.8,v 1.14.2.2 2000/12/18 15:38:20 ru Exp %
.\" jpman %Id: fsck.8,v 1.2 1997/04/24 00:30:54 mutoh Stab %
.\"
.Dd November 15, 1996
.Dt FSCK 8
.Os BSD 4
.Sh 名称
.Nm fsck
.Nd ファイルシステムの整合性チェックと対話的修正
.Sh 書式
.Nm
.Fl p
.Op Fl f
.Op Fl m Ar mode
.Op Ar filesystem
.Ar ...
.Nm
.Op Fl ny
.Op Fl b Ar block#
.Op Fl c Ar level
.Op Fl l Ar maxparallel
.Op Fl m Ar mode
.Op Ar filesystem
.Ar ...
.Sh 解説
.Nm
の最初の書式は、標準のファイルシステムのセットや指定された
ファイルシステムの状態を整えるのに使われます。
通常は、自動リブートの間に
.Pa /etc/rc
スクリプトの中で使用されます。
この時
.Nm
は
.Pa /etc/fstab
を読んで、チェックするファイルシステムを決定します。
fstab 内の ``rw,'' ``rq,'' ``ro'' のいずれかのオプションで
マウントされる、 0 以外のパス番号をもつパーティションのみが
チェックの対象です。
パス番号 1 を持つファイルシステム 
(通常はルートファイルシステムだけです) は、
一つずつ順番にチェックされます。
パス 1 が完了すると、残りのすべてのファイルシステムは、
ディスクドライブごとに一つのプロセスを使ってチェックされます。
ファイルシステムが含まれるディスクドライブは、
デバイス名のうち最後が数字である最も長い文字列として認識されます。
残りの文字列はパーティションを示すと解釈されます。
.Pp
preen モードでは、各ファイルシステムのスーパブロックの
クリーン (clean) フラグを調べ、
クリーンでないファイルシステムのみをチェックします。
ファイルシステムがクリーンとマークされるのは、
アンマウントされた時、読み取り専用でマウントされた時、
.Nm
が成功裏に実行された時です。
.Fl f
オプションを指定した場合、クリーンフラグの状態にかかわらず
ファイルシステムをチェックします。
.Pp
カーネルは、ハードウェアやソフトウェアに障害が起きない限り、
ファイルシステムには限定された無害な不整合しか起こさない様に
動作します。
それらの不整合には以下の物があります。
.Pp
.Bl -item -compact -offset indent
.It
参照されない inode
.It
inode のリンクカウントが多すぎる
.It
フリーマップ中にないフリー (空き) ブロック
.It
フリーマップとファイルの両方にあるブロック
.It
スーパブロック内の数値の異常
.El
.Pp
.Fl p
オプション付の
.Nm
では、上記の不整合のみを修正します。その他の不整合を発見すると、
.Nm
は異常終了のステータスを返して終了し、自動リブートは失敗します。
不整合を修正するたびに、ファイルシステムと修正内容が表示されます。
ファイルシステムの修正に成功した後で、
.Nm
はファイルシステム中のファイル数、使用中ブロックとフリーブロックの数、
フラグメントの割合を表示します。
.Pp
.Nm
がファイルシステムをチェックしている間に
.Dv QUIT
シグナルを送ると、
.Nm
はチェックを続けますが、終了時に異常終了のステータスを返し、
自動リブートを失敗させます。
これは、自動リブートによるファイルシステムチェックは行いたいが、
チェック完了後にマルチユーザモードに移行したくない場合に有用です。
.Pp
.Fl p
オプションなしでは、
.Nm
はファイルシステムの状態の検査をおこない、それを対話的に修正します。
ファイルシステムに不整合がある場合、修正を実施する前にオペレータへ
確認を求めます。
.Fl p
オプションでは直せない修正では、データが失われる可能性があることに
注意すべきです。
失われるデータの量とその致命度は、診断メッセージから判断して下さい。
デフォルト動作では、修正を実行する前に、オペレータが
.Li yes
か
.Li no 
と応答するまで待ちます。
オペレータにファイルシステムの書き込み権限がない場合、
.Nm
は、
.Fl n
オプションの動作をデフォルトにします。
.Pp
.Nm
は、以前使われていた
.Em check , dcheck , fcheck ,
.Em icheck
の組み合わせよりもより詳しい不整合チェックを行ないます。
.Pp
.Nm
は以下のフラグを解釈します。
.Bl -tag -width indent
.It Fl b
指定した番号のブロックをファイルシステムの
スーパブロックとして使用します。
ブロック番号 32 は普通、代替スーパブロックになっています。
.It Fl c
ファイルシステムを指定したレベルへ変換します。
ファイルシステムのレベルは、上げることのみが可能です。
.Bl -tag -width indent
以下の 4 レベルが定義されています。
.It 0
ファイルシステムは、旧フォーマットです (静的テーブル)。
.It 1
ファイルシステムは、新フォーマットです (動的テーブル)。
.It 2
ファイルシステムは 32 ビットの UID と GID を用い、
短いシンボリックリンクは inode 内へ格納し、
ディレクトリはファイルタイプを示す追加フィールドを持ちます。
.It 3
maxcontig が 1 より大きい場合、
連続ブロックをみつけるためのフリーセグメントマップを作成します。
maxcontig が 1 の場合、既存のセグメントマップを削除します。
.El
.Pp
対話モードでは、
.Nm
は、変換の内容を表示して、実際に変換するかどうかを問い合わせます。
no と答えると、ファイルシステムへのそれ以上の操作は行われません。
preen モード (
.Fl p
オプション) では、変換内容を表示しますが、変換が可能なら
ユーザへの問い合わせなしに実行します。
preen モードでの変換は、すべてのファイルシステムを一度に
変換してしまう場合に便利です。
ファイルシステムのフォーマットは、
.Xr dumpfs 8 
の出力の最初の行から決定することができます。
.It Fl f
preen モードの場合でも、
.Sq クリーン
なファイルシステムをチェックするようにします。
.It Fl l
同時チェックの並列度を、指定した数に制限します。
デフォルト値はディスク数であり、
ディスク毎に一つのプロセスが実行されます。
これより小さい値を指定すると、
各ディスクを、ファイルシステムを一つずつ
ラウンドロビン方式でチェックします。
.It Fl m
.Pa lost+found
ディレクトリを作る時のモードとして、デフォルトの 1777 の代わりの
値を 8 進数で指定します。
失われたファイルをすべてのユーザには見せたくないシステムでは、
より制限の厳しい 700 を使うべきです。
.It Fl n
.Nm
からの
.Ql CONTINUE? 
を除くすべての問い合わせに no と答えます。
このオプション使用時、ファイルシステムへの書き込みオープンを行いません。
.It Fl p
ファイルシステムを整えます(上記参照)。
.It Fl y
.Nm
からのすべての質問に yes と答えます。
このオプションは、
修正によって新たな不整合を生むような誤った修正に対しても無制限な
許可を与えてしまうものですから、
十分に用心して使用すべきです。
.\"     お手上げにつき、意訳しました by TM
.\"(訳注)とくに問題がないと判断したので，この意訳をそのままとしました。
.\" 2.2.1R 対象(1997/04/23) Takeshi MUTOH <mutoh@info.nara-k.ac.jp>
.El
.Pp
ファイルシステムを指定せずに
.Nm
を実行すると
.Pa /etc/fstab 
ファイルから読み込まれたファイルシステムのリストが対象になります。
.Pp
.Bl -enum -compact
ファイルシステムは、以下の点について検査されます。
.It
二つ以上の inode やフリーマップにより使用されているブロック
.It
ファイルシステム領域外の inode により使用されているブロック
.It
不正なリンクカウント
.It
サイズのチェック:
.Bl -item -offset indent -compact
.It 
サイズが DIRBLKSIZ の倍数でないディレクトリ
.It
切り詰め (truncate) が部分的に行われているファイル
.El
.It
不正な inode フォーマット
.It
どこにも登録されていないブロック
.It
ディレクトリのチェック:
.Bl -item -offset indent -compact
.It 
割り当てされていない inode を指すファイル
.It
範囲外の inode 番号
.It
割り当てられていないブロック (穴) を持つディレクトリ
.It
最初の 2 つのエントリが `.' と `..' でないか、
不正な inode 番号を持つディレクトリ
.El
.It
スーパブロックのチェック:
.Bl -item -offset indent -compact
.It 
ファイルシステムにあるよりも多い inode ブロック数
.It
不正なフリーブロックマップフォーマット
.It
フリーブロックやフリー inode の総数の誤り
.El
.El
.Pp
親ディレクトリの無いファイルやディレクトリ (割り当て
られているが参照されていない) は、
オペレータへの問い合わせのあとで
.Pa lost+found
ディレクトリへ配置されます。
その際のファイル名は inode 番号になります。
.Pa lost+found
ディレクトリが存在しない場合、新たに作成されます。
スペースが不足している場合は、そのサイズが拡張されます。
.Pp
ブロックデバイスとバッファキャッシュの内容は一致しないかもしれないので、
必ずロー (raw) デバイスを指定してください。
.Sh 関連ファイル
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
チェックを行なうファイルシステムのデフォルトリストを含む
.El
.Sh 診断
.Nm
の出す診断メッセージは、
.Rs
.%T "Fsck \- The UNIX File System Check Program"
.Re
の Appendix A にすべて列挙され説明されています。
.Sh 関連項目
.Xr fs 5 ,
.Xr fstab 5 ,
.Xr fsdb 8 ,
.Xr newfs 8 ,
.Xr reboot 8
