freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fsck_msdosfs.8
.\"	$NetBSD: fsck_msdos.8,v 1.9 1997/10/17 11:19:58 ws Exp $
.\" %FreeBSD: src/sbin/fsck_msdosfs/fsck_msdosfs.8,v 1.13 2004/05/17 08:35:40 ru Exp %
.\"
.\" Copyright (C) 1995 Wolfgang Solfrank
.\" Copyright (c) 1995 Martin Husemann
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Martin Husemann
.\"	and Wolfgang Solfrank.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.\" $FreeBSD$
.Dd August 13, 1995
.Dt FSCK_MSDOSFS 8
.Os
.Sh 名称
.Nm fsck_msdosfs
.Nd DOS/Windows (FAT) ファイルシステムの一貫性チェッカ
.Sh 書式
.Nm
.Fl p
.Op Fl f
.Ar filesystem ...
.Nm
.Op Fl fny
.Ar filesystem ...
.Sh 解説
.Nm
ユーティリティは
.Tn FAT
ファイルシステム (もっと一般的には
.Tn DOS
ファイルシステムとして知られている)
を検証し修復します。
.Pp
.Nm
の最初の書式は、指定されたファイルシステムを整えます。
これは通常、自動リブートの際 FAT ファイルシステムが検出されると、
.Pa /etc/rc
から
.Xr fsck 8
によって起動されます。
ファイルシステムを整えている際、
.Nm
は、普通の矛盾を自動的に修復します。
さらに深刻な問題が発見された場合、
.Nm
は、それらを修復しようとはせずに、
修復が失敗したことを示して終了します。
.Pp
.Nm
の 2 番目の形式は、指定されたファイルシステムをチェックし、
変更前に確認を常に取りながら、検出された全ての矛盾を修復しようとします。
.Pp
以下のオプションが利用できます:
.Bl -tag -width indent
.It Fl F
ラッパ
.Xr fsck 8
と互換性のある動作をし、
フォアグラウンドですぐにファイルシステムをきれいにしなければならないか、
バックグラウンドに回しても構わないかを判断しようとします。
FAT (MS-DOS) ファイルシステムのクリーニングは、
常にフォアグラウンドで行われなければなりません。
このオプションでは、常に 0 以外の終了コードが返ります。
.It Fl f
preen の時に
.Dq クリーンな
ファイルシステムを
.Nm
に強制的に確認させます。
.It Fl n
.Nm
は、
.Dq Li CONTINUE?
以外の全ての質問に
.Dq Li no
と答えるものとみなして動作します。
.It Fl p
指定されたファイルシステムを整えます。
.It Fl y
.Nm
は、全ての質問に
.Dq Li yes
と答えるものとみなして
動作します。
.El
.Sh 関連項目
.Xr fsck 8 ,
.Xr fsck_ffs 8 ,
.Xr mount_msdosfs 8
.Sh バグ
.Nm
ユーティリティは、現状開発途上です。
.\" jpman 2002/11/07 mdoc/doc-syms で .Ud を「現状開発途上です」とする
.Sh 歴史
.Nm
ユーティリティは
.Fx 4.4
で初めて登場しました。
