freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fsck_ffs.8
.\"
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)fsck.8	8.4 (Berkeley) 5/9/95
.\" %FreeBSD: src/sbin/fsck_ffs/fsck_ffs.8,v 1.31 2004/07/02 21:45:01 ru Exp %
.\"
.\" $FreeBSD$
.Dd April 24, 2001
.Dt FSCK_FFS 8
.Os
.Sh 名称
.Nm fsck_ffs ,
.Nm fsck_ufs
.Nd ファイルシステムの整合性チェックと対話的修正
.Sh 書式
.Nm
.Op Fl BFpfny
.Op Fl b Ar block#
.Op Fl c Ar level
.Op Fl m Ar mode
.Ar filesystem
.Ar ...
.Sh 解説
指定したディスクパーティションやファイルシステムをチェックします。
preen モードでは、各ファイルシステムのスーパブロックの
クリーン (clean) フラグを調べ、
クリーンでないファイルシステムのみをチェックします。
ファイルシステムがクリーンとマークされるのは、
アンマウントされた時、読み取り専用でマウントされた時、
.Nm
が成功裏に実行された時です。
.Fl f
オプションを指定した場合、クリーンフラグの状態にかかわらず
ファイルシステムをチェックします。
.Pp
カーネルは、ハードウェアやソフトウェアに障害が起きない限り、
ファイルシステムには限定された無害な不整合しか起こさない様に
動作します。
それらの不整合には以下の物があります。
.Pp
.Bl -item -compact -offset indent
.It
参照されない inode
.It
inode のリンクカウントが多すぎる
.It
フリーマップ中にないフリー (空き) ブロック
.It
フリーマップとファイルの両方にあるブロック
.It
スーパブロック内の数値の異常
.El
.Pp
.Fl p
オプション付の
.Nm
では、上記の不整合のみを修正します。その他の不整合を発見すると、
.Nm
は異常終了のステータスを返して終了し、自動リブートは失敗します。
不整合を修正するたびに、ファイルシステムと修正内容が表示されます。
ファイルシステムの修正に成功した後で、
.Nm
はファイルシステム中のファイル数、使用中ブロックとフリーブロックの数、
フラグメントの割合を表示します。
.Pp
.Nm
がファイルシステムをチェックしている間に
.Dv QUIT
シグナルを送ると、
.Nm
はチェックを続けますが、終了時に異常終了のステータスを返し、
自動リブートを失敗させます。
これは、自動リブートによるファイルシステムチェックは行いたいが、
チェック完了後にマルチユーザモードに移行したくない場合に有用です。
.Pp
.Nm
が
.Dv SIGINFO
シグナルを受信すると (
.Xr stty 1
の
.Dq status
引数を参照してください)、
現在チェック中のデバイスと現在フェーズ番号とフェーズ固有の進捗情報を示す行が、
標準出力へ書かれます。
.Pp
.Fl p
オプションなしでは、
.Nm
はファイルシステムの状態の検査をおこない、それを対話的に修正します。
ファイルシステムに不整合がある場合、修正を実施する前にオペレータへ
確認を求めます。
.Fl p
オプションでは直せない修正では、データが失われる可能性があることに
注意すべきです。
失われるデータの量とその致命度は、診断メッセージから判断して下さい。
デフォルト動作では、修正を実行する前に、オペレータが
.Li yes
か
.Li no 
と応答するまで待ちます。
オペレータにファイルシステムの書き込み権限がない場合、
.Nm
は、
.Fl n
オプションの動作をデフォルトにします。
.Pp
.Nm
は以下のフラグを解釈します。
.Bl -tag -width indent
.It Fl F
ファイルシステムをすぐにフォアグラウンドでクリーンにする必要があるか、
それともバックグラウンドにして遅らせることができるかどうかを判定します。
バックグラウンドクリーニングのためには、
ソフトアップデートで実行しており、
フォアグラウンドでのチェックが必要という印が付いておらず、
バックグラウンドチェックの終了時にマウントされ書き込みされることが必要です。
これらの条件に合致すると、
.Nm
は終了状態 0 で終了します。
そうでない場合には非 0 の終了状態で終了します。
ファイルシステムがクリーンの場合、
非 0 の値で終了し、フォアグラウンドのチェックにおいて
ファイルシステムがクリーンであることが確認され報告されるようにします。
.Fl F
フラグ付きで起動された場合、
クリーンアップはなにも実行されないことに注意してください。
.Nm
が実施するのは、
フォアグラウンドとバックグラウンドのいずれが必要であるかの判定と、
適切な終了コードでの終了だけです。
.It Fl B
指定された、もしかすると使用中かもしれないファイルシステムに対し、
チェックを実施します。
実施可能な修正は preen モード 
.Fl ( p
フラグ参照) での実行時のものに限定されます。
予期しないエラーがみつかると、
ファイルシステムにはフォアグラウンドチェックが必要という印が付けられ、
.Nm
は更なるクリーニングを試みずに終了します。
.It Fl b
指定した番号のブロックをファイルシステムの
スーパブロックとして使用します。
ブロック番号 32 は普通、代替スーパブロックになっています。
.It Fl c
ファイルシステムを指定したレベルへ変換します。
ファイルシステムのレベルは、上げることのみが可能です。
以下の 4 レベルが定義されています。
.Bl -tag -width indent
.It 0
ファイルシステムは、旧フォーマットです (静的テーブル)。
.It 1
ファイルシステムは、新フォーマットです (動的テーブル)。
.It 2
ファイルシステムは 32 ビットの UID と GID を用い、
短いシンボリックリンクは inode 内へ格納し、
ディレクトリはファイルタイプを示す追加フィールドを持ちます。
.It 3
maxcontig が 1 より大きい場合、
連続ブロックをみつけるためのフリーセグメントマップを作成します。
maxcontig が 1 の場合、既存のセグメントマップを削除します。
.El
.Pp
対話モードでは、
.Nm
は、変換の内容を表示して、実際に変換するかどうかを問い合わせます。
no と答えると、ファイルシステムへのそれ以上の操作は行われません。
preen モードでは、変換内容を表示しますが、変換が可能なら
ユーザへの問い合わせなしに実行します。
preen モードでの変換は、すべてのファイルシステムを一度に
変換してしまう場合に便利です。
ファイルシステムのフォーマットは、
.Xr dumpfs 8 
の出力の最初の行から決定することができます。
.It Fl f
preen モードの場合でも、
.Sq クリーン
なファイルシステムをチェックするようにします。
.It Fl m
.Pa lost+found
ディレクトリを作る時のモードとして、デフォルトの 1777 の代わりの
値を 8 進数で指定します。
失われたファイルをすべてのユーザには見せたくないシステムでは、
より制限の厳しい 700 を使うべきです。
.It Fl n
.Nm
からの
.Ql CONTINUE? 
を除くすべての問い合わせに no と答えます。
このオプション使用時、ファイルシステムへの書き込みオープンを行いません。
.It Fl p
ファイルシステムを整えます (上記参照)。
.It Fl y
.Nm
からのすべての質問に yes と答えます。
このオプションは、
修正によって新たな不整合を生むような誤った修正に対しても無制限な
許可を与えてしまうものですから、
十分に用心して使用すべきです。
.\"     お手上げにつき、意訳しました by TM
.\"(訳注)とくに問題がないと判断したので、この意訳をそのままとしました。
.\" 2.2.1R 対象(1997/04/23) Takeshi MUTOH <mutoh@info.nara-k.ac.jp>
.El
.Pp
ファイルシステムは、以下の点について検査されます。
.Pp
.Bl -enum -compact
.It
二つ以上の inode やフリーマップにより使用されているブロック
.It
ファイルシステム領域外の inode により使用されているブロック
.It
不正なリンクカウント
.It
サイズのチェック:
.Bl -item -offset indent -compact
.It
サイズが DIRBLKSIZ の倍数でないディレクトリ
.It
切り詰め (truncate) が部分的に行われているファイル
.El
.It
不正な inode フォーマット
.It
どこにも登録されていないブロック
.It
ディレクトリのチェック:
.Bl -item -offset indent -compact
.It
割り当てされていない inode を指すファイル
.It
範囲外の inode 番号
.It
割り当てられていないブロック (穴) を持つディレクトリ
.It
最初の 2 つのエントリが `.' と `..' でないか、
不正な inode 番号を持つディレクトリ
.El
.It
スーパブロックのチェック:
.Bl -item -offset indent -compact
.It
ファイルシステムにあるよりも多い inode ブロック数
.It
不正なフリーブロックマップフォーマット
.It
フリーブロックやフリー inode の総数の誤り
.El
.El
.Pp
親ディレクトリの無いファイルやディレクトリ (割り当て
られているが参照されていない) は、
オペレータへの問い合わせのあとで
.Pa lost+found
ディレクトリへ配置されます。
その際のファイル名は inode 番号になります。
.Pa lost+found
ディレクトリが存在しない場合、新たに作成されます。
スペースが不足している場合は、そのサイズが拡張されます。
.Sh 関連ファイル
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
チェックを行なうファイルシステムのデフォルトリストを含む
.El
.Sh 診断
.Ex -std
.Pp
.Nm
の出す診断メッセージは、
.Rs
.%T "Fsck \- The UNIX File System Check Program"
.Re
の Appendix A にすべて列挙され説明されています。
.Sh 関連項目
.Xr fs 5 ,
.Xr fstab 5 ,
.Xr fsck 8 ,
.Xr fsdb 8 ,
.Xr newfs 8 ,
.Xr reboot 8
