freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fsinfo.8
.\"
.\" Copyright (c) 1997-1998 Erez Zadok
.\" Copyright (c) 1993 Jan-Simon Pendry.
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)fsinfo.8	8.1 (Berkeley) 6/28/93
.\" jpman %Id: fsinfo.8,v 1.2 1997/06/06 10:17:38 bobson Stab %
.\"
.Dd June 28, 1993
.Dt FSINFO 8
.Os
.Sh 名称
.Nm fsinfo
.Nd サイト規模 (サイト単位) のファイルシステム情報の管理
.Pp
.Sh 書式
.Nm \&fsinfo
.Op Fl v
.Op Fl a Ar autodir
.Op Fl b Ar bootparams
.Op Fl d Ar dumpsets
.Op Fl e Ar exports
.Op Fl f Ar fstabs
.Op Fl h Ar hostname
.Op Fl m Ar automounts
.Op Fl I Ar dir
.Op Fl D Ar string[=string]]
.Op Fl U Ar string[=string]]
.Ar config 
\&...
.Sh 解説
.Nm
は、システム設定ファイルを読み込んで、
.Nm amd
、
.Nm mount
、
.Nm mountd
の管理情報 (設定ファイル) を生成します。
.Pp
.Nm
コマンドの詳細は、Amd --- The 4.4BSD Automounter に記述されています。
.Pp
.Sh 関連項目
.Xr  amd 8 ,
.Xr  mount 8 ,
.Xr  mountd 8
.Pp
.Sh 歴史
.Nm
は 4.4BSD で追加されました。
