freebsd/freebsd-doc/ja_JP.eucJP/man/man8/fsinfo.8
.\"
.\" Copyright (c) 1997-2003 Erez Zadok
.\" Copyright (c) 1993 Jan-Simon Pendry.
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)fsinfo.8	8.1 (Berkeley) 6/28/93
.\"	$Id: fsinfo.8,v 1.14 2004-04-24 16:05:05 kuriyama Exp $
.\"	%FreeBSD: src/contrib/amd/fsinfo/fsinfo.8,v 1.9 2004/01/04 10:56:22 charnier Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 26, 1999
.Dt FSINFO 8
.Os
.Sh 名称
.Nm fsinfo
.Nd サイト規模 (サイト単位) のファイルシステム情報の管理
.Sh 書式
.Nm
.Op Fl qv
.Op Fl a Ar autodir
.Op Fl b Ar bootparams_prefix
.Op Fl d Ar dumpsets_prefix
.Op Fl e Ar exports_prefix
.Op Fl f Ar fstabs_prefix
.Op Fl h Ar hostname
.Op Fl m Ar automounts_prefix
.Op Fl I Ar dir
.Oo
.Fl D
.Ar name Ns Op = Ns Ar string
.Oc
.Op Fl U Ar name
.Ar config ...
.Sh 解説
.Nm
は、システム設定ファイルを読み込んで、
.Xr amd 8 ,
.Xr mount 8 ,
.Xr mountd 8
の管理情報 (設定ファイル) を生成します。
.Pp
次のオプションを使用可能です:
.Bl -tag -width Fl
.It Fl a Ar autodir
自動マウンタのマウントポイントのディレクトリ名を指定します。
デフォルトは
.Pa /a
です。
.It Fl b Ar bootparams_prefix
.Pa bootparams
ファイルのプレフィックスを指定します。
指定しないと、このファイルは生成されません。
このファイルは、対象マシン用に構成され、
.Ar bootparams_prefix
文字列が前に付く
.Pa bootparams
という名前のファイルに置かれます。
生成されたファイルは、
対象マシンから起動可能なディスクレスクライアントを記述した
エントリのリストです。
.It Fl d Ar dumpsets_prefix
.Pa dumpsets
ファイルのプレフィックスを指定します。
指定しないと、ファイルは生成されません。
このファイルは対象マシン用であり、
.Ar dumpsets_prefix
文字列が前に付く
.Pa dumpsets
という名前のファイルに置かれます。
このファイルは
.Tn Imperial College
のローカルバックアップシステムに使用されます。
.It Fl e Ar exports_prefix
.Pa exports
ファイルのプレフィックスを定義します。
指定しないと、このファイルは生成されません。
設定ファイルでディスクを持つものとして定義される各マシンに対して、
.Pa exports
ファイルが構築され、マシン名の前に
.Ar exports_prefix
文字列を付けた名前が与えられます。
マシンがディスクレスとして定義される場合、
このマシンに対してはファイルは生成されません。
これらのファイルは、そのマシン上のディレクトリで、
クライアントに対してエクスポートするものに関するエントリを含みます。
.It Fl f Ar fstabs_prefix
.Pa fstab
ファイルのプレフィックスを定義します。
このプレフィックスが定義された場合のみ、このファイルが生成されます。
設定ファイル中で定義される各マシンに対し、
.Pa fstab
ファイルを生成し、マシン名の前に
.Ar fstabs_prefix
文字列を付けた名前を与えます。
これらのファイルは、
ブート時にマウントするファイルシステムとパーティションに関するエントリを
含みます。
.It Fl h Ar hostname
処理対象マシンのホスト名を定義します。
指定しないと、
.Xr gethostname 3
が返すローカルマシン名になります。
.It Fl m Ar automounts_prefix
自動マウンタファイルのプレフィックスを定義します。
このオプションを指定した場合のみ、マップが生成されます。
設定ファイルで定義されるネットワーク用のマウントマップは、
各マップの名前の前に
.Ar automounts_prefix
文字列を付けた名前のファイルに置きます。
.It Fl q
静かなモードを選択します。
生成されたエラーメッセージだけが表示されます。
.It Fl v
冗長モードを選択します。
これが有効になると、より多くのメッセージが表示され、
意味解析フェーズ実行時に発見したすべての情報を表示します。
各冗長メッセージは標準出力に出力される際、文字 `#' で開始します。
.It Fl D Xo
.Ar name Ns Op = Ns Ar string
.Xc
設定ファイルを読み込むときのプリプロセッサ用に、シンボル
.Ar name
を定義します。
.Em #define
ディレクティブと等価です。
.It Fl I Ar dir
このオプションは、設定ファイルのためにプリプロセッサに渡されます。
インクルードファイルを探すディレクトリを指定します。
.It Fl U Ar name
シンボル
.Ar name
の初期定義を除去します。
.Fl D
オプションの逆です。
.It Ar config
1 個以上の設定ファイルを
.Nm fsinfo
の入力として渡します。
.El
.Pp
.Nm
コマンドの詳細は、Amd --- The 4.4BSD Automounter と
.Xr info 1
の
.Nm amd
セクションに記述されています。
.Sh 関連項目
.Xr  amd 8 ,
.Xr  mount 8 ,
.Xr  mountd 8
.Sh 歴史
.Nm
は
.Bx 4.4
で追加されました。
