freebsd/freebsd-doc/ja_JP.eucJP/man/man8/gensetdefs.8
.\"
.\" %FreeBSD: src/usr.bin/gensetdefs/gensetdefs.8,v 1.2 1999/08/28 01:01:42 peter Exp %
.\" jpman %Id: gensetdefs.8,v 1.3 2000/04/02 04:10:23 horikawa Stab %
.\"
.Dd March 10, 1999
.Dt GENSETDEFS 8
.Os
.Sh 名称
.Nm gensetdefs
.Nd リンカ集合の定義を作成する
.Sh 書式
.Nm gensetdefs
.Ar file ...
.Sh 解説
.Nm
コマンドは、ELF カーネルを作成する際に必要となる
リンカ集合の定義を作成するための、特別な目的のためのプログラムです。
引数
.Ar file
は ELF オブジェクトファイルの名前です。
コマンドはオブジェクトファイル中のセクション名を調べ、
セクション名の先頭に
.Dv .set.
を付けたもののテーブルを作成します。
これが、リンカ集合を表します。
最後に、
.Dv count
個の要素を持つ各集合
.Dv foo
に対し、
.Fn DEFINE_SET foo count ;
という行を標準出力に出力します。
.Pp
このコマンドは
.Tn i386
向けの一般的な makefile である
.Pa /sys/i386/conf/Makefile.i386
など、カーネルの makefile で使用されます。
.Sh 関連項目
.Xr config 8
.Sh 作者
.Nm
コマンドは
.An John D. Polstra
が記述しました。
