freebsd/freebsd-doc/ja_JP.eucJP/man/man8/getty.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)getty.8	8.1 (Berkeley) 6/4/93
.\" %FreeBSD: src/libexec/getty/getty.8,v 1.15 2002/12/23 16:04:50 ru Exp %
.\" $FreeBSD$
.\" "
.Dd June 4, 1993
.Dt GETTY 8
.Os
.Sh 名称
.Nm getty
.Nd 端末のモードを設定する
.Sh 書式
.Nm
.Oo
.Ar type
.Op Ar tty
.Oc
.Sh 解説
.Nm
ユーティリティは、
.Xr init 8
から呼ばれ、tty 回線をオープンしたあと初期化
し、ログイン名を読んで
.Xr login 1
を起動します。
.Pp
.Ar tty
は、端末にどの
.Pa /dev
の特殊デバイスファイルを使うかを指定します (例：``ttyh0'')。
引数がないか
.Sq Fl
ならば、tty 回線はファイル記述子 0 としてオープンされます。
.Pp
.Ar type
は、
.Nm
が端末回線を特別に扱うようにするために使われます。
この
.Ar type
は、
.Xr gettytab 5
のデータベースのインデックスとして使われ、
回線の特徴を決定します。引数が与えられないか、データベースにマッチする
テーブルがなければ、
.Em default
テーブルが使われます。もし、
.Pa /etc/gettytab
ファイルがなければ、システムのデフォルトが使われます。
テーブルにより指示されれば、
.Nm
は端末画面をクリアし、
バナーヘッダを表示し、
ログインプロンプトを表示します。通常、このプロンプトのなかに
システムのホスト名が含まれます。
.Pp
.Nm
のデフォルトの行動は、大抵の場合、適当な
.Pa gettytab
テーブルを作成することによって、回避したり修正したりすることができます。
.Pp
.Nm
ユーティリティはタイムアウト時間を設定することができます。これによって、
ログイン名がすぐに入力されないような場合に、ダイヤル回線を切断
することができます。
.Sh 診断
.Bl -diag
.It "ttyxx: No such device or address."
.It "ttyxx: No such file or address."
.Pp
.Pa ttys
ファイルのなかで有効にされていた端末がオープンできませんでした。
必要な回線がシステムに設定されていなかったか、
関係するデバイスがブート時のシステム設定の際に組み込まれなかったか、
もしくは
.Pa /dev
に特殊ファイルがありませんでした。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/gettytab -compact
.It Pa /etc/gettytab
.It Pa /etc/ttys
.El
.Sh 関連項目
.Xr login 1 ,
.Xr ioctl 2 ,
.Xr tty 4 ,
.Xr gettytab 5 ,
.Xr ttys 5 ,
.Xr init 8
.Sh 歴史
.Nm
ユーティリティは
.At v6
から登場しました。
