freebsd/freebsd-doc/ja_JP.eucJP/man/man8/growfs.8
.\" Copyright (c) 2000 Christoph Herrmann, Thomas-Henning von Kamptz
.\" Copyright (c) 1980, 1989, 1993 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Christoph Herrmann and Thomas-Henning von Kamptz, Munich and Frankfurt.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors, as well as Christoph
.\"      Herrmann and Thomas-Henning von Kamptz.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $TSHeader: src/sbin/growfs/growfs.8,v 1.3 2000/12/12 19:31:00 tomsoft Exp $
.\" %FreeBSD: src/sbin/growfs/growfs.8,v 1.22.2.1 2005/03/01 09:23:35 jkoshy Exp %
.\"
.\" $FreeBSD$
.Dd September 8, 2000
.Dt GROWFS 8
.Os
.Sh 名称
.Nm growfs
.Nd 既存の UFS ファイルシステムのサイズを拡張する
.Sh 書式
.Nm
.Op Fl Ny
.Op Fl s Ar size
.Ar special
.Sh 解説
.Nm
ユーティリティは
.Xr newfs 8
プログラムを拡張したものです。
.Nm
を実行する前に、ディスクは
.Xr bsdlabel 8
を用いて大きなサイズに設定されていなければなりません。
ファイルシステムが置かれたスライスの境界を越えて拡張したい場合、
.Nm
の実行前に
.Xr fdisk 8
を使用して、当該スライスの大きさを変えてください。
もしボリュームを使っている場合は、
.Xr vinum 8
を用いてディスクを大きくする必要があります。
.Nm
は指定されたスペシャルファイル上のファイルシステムのサイズを拡張します。
現在
.Nm
ユーティリティは、マウントされていないファイルシステムの拡張しかできません。
マウントされたファイルシステムを拡張しようとしないでください。
システムがパニックするかもしれませんし、
そうするとファイルシステムはもはや使えなくなるでしょう。
.Xr newfs 8
で使用したほとんどのオプションは変更できません。
実際、ファイルシステムのサイズを大きくすることしかできません。
その他の変更を行う場合は
.Xr tunefs 8
を使用してください。
.Pp
以下のオプションが使用できます:
.Bl -tag -width indent
.It Fl N
.Dq テストモード
実際にファイルシステムを大きくすることなく、新しいファイルシステムの
パラメータを表示します。
.It Fl y
.Dq エキスパートモード
通常
.Nm
は、データのバックアップを取ったかを尋ねたり、
.Ar special
が現在マウントされているかどうかや、指定されたファイルシステムに
アクティブなスナップショットがあるかどうかのテストを行います。
しかし、このモードではこれらが抑制されます。
このオプションは最大の注意を払って使って下さい。
.It Fl s Ar size
拡張後のファイルシステムの、セクタ単位の
.Ar size
を指定します。
この値のデフォルトは
.Ar special
内で指定されている raw パーティションのサイズです
(言い換えれば
.Nm
はファイルシステムのサイズを、パーティション全体まで拡張します)。
.El
.Sh 使用例
.Dl growfs -s 4194304 /dev/vinum/testvol
.Pp
は、
.Pa /dev/vinum/testvol
に十分な領域がある場合、2GB に
.Pa /dev/vinum/testvol
を拡張します。
.Sh バグ
.Nm
ユーティリティは
.Fx
3.x から動き始めました。
.Fx
3.x のみにおいて
.Nm
は、ファイルシステムがマウントされているかどうかを正しく認識できずに
エラーメッセージを出して終了することがあります。
その場合は、ファイルシステムがマウントされていないことを確認して、
.Nm
.Fl y
をしてください。
(安全のため、) 拡張した後、
.Xr fsck 8
をすることもお勧めします。
.Pp
ある一定の制限以上に拡張するには、最初のシリンダグループに
いくらかの空きブロックがあることが必要です。
最初のシリンダグループに空きが無い場合、
新規に使用可能なシリンダグループに重要なデータ構造が移動されます。
.Fx
3.x では後で
.Xr fsck 8
が問題となります。よって、
.Fx
3.x
で
.Nm
を使用するには
.Xr fsck 8
のパッチが必要となります。
.Fx 4.4
からはこのパッチは既に
.Fx
に組み込まれています。
この構造の再配置を避けるには、最初のシリンダグループに対して
.Nm ffsinfo
.Fl g Ar 0
.Fl l Ar 4
を行って、CYLINDER GROUP
.Em cgr0
の CYLINDER SUMMARY (内部 cs) 内の
.Em nbfree
に十分なブロックがあるかどうかを確認することを、現在ではお勧めします。
経験上、デフォルトのファイルシステムのパラメータに対して、
全ファイルシステムのサイズの 2GB 毎に 1 ブロック必要です。
.Pp
通常、
.Nm
はこの重要な構造をディスクに書き込んでから後で再度読み取り、
更なる更新を行います。
.Fl N
を使用すると、この読み取り操作は予期せぬデータを返してしまいます。
このような理由で、この部分は実際にはシミュレートできないので、
テストモードではスキップします。
.Sh 関連項目
.Xr bsdlabel 8 ,
.Xr dumpfs 8 ,
.Xr fdisk 8 ,
.Xr ffsinfo 8 ,
.Xr fsck 8 ,
.Xr newfs 8 ,
.Xr tunefs 8 ,
.Xr vinum 8
.Sh 作者
.An Christoph Herrmann Aq chm@FreeBSD.org
.An Thomas-Henning von Kamptz Aq tomsoft@FreeBSD.org
.An The GROWFS team Aq growfs@Tomsoft.COM
.Sh 歴史
.Nm
ユーティリティは
.Fx 4.4
ではじめて登場しました。
