freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ibcs2.8
.\"
.\" Copyright (c) 1995 Lyndon Nerenberg
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sys/modules/ibcs2/ibcs2.8,v 1.10 1999/08/28 00:47:15 peter Exp %
.\"
.\" jpman %Id: ibcs2.8,v 1.3 1997/09/08 08:46:54 kuma Stab %
.Dd November 27, 1995
.Dt IBCS2 8
.Os FreeBSD
.Sh 名称
.Nm ibcs2
.Nd SCO および ISC バイナリのための iBCS2 ランタイムサポートをロードする
.Sh 書式
.Nm ibcs2
.Sh 解説
.Nm
ユーティリティは iBCS2 互換プログラムの
カーネルランタイムサポートをロードします。
本ランタイムサポートの範囲は iBCS2 システムコールインタフェースの
エミュレーションに限定されており、完全サポートには程遠いです。
COFF バイナリおよび共有ライブラリはサポートされていますが、
FreeBSD での配布には共有ライブラリは提供されていません。
.Sh 関連ファイル
.Bl -tag -width /usr/share/examples/ibcs2/* -compact
.It Pa /modules/ibcs2.ko
.It Pa /modules/ibcs2_coff.ko
iBCS2 ローダブルカーネルモジュール。
.Pp
.It Pa /usr/share/examples/ibcs2/*
エミュレータ検査用のサンプルオブジェクトファイル。
.Sh 関連項目
.Xr kld 4 ,
.Xr kldload 8
.Sh バグ
エミュレータは全く不完全です。
.Pp
動的にリンクされたバイナリを実行するにあたり、
既存の SCO システムの共有ライブラリへのアクセスが不可欠です。
.Pp
使用にあたりソースコードを読むことが不可欠です。
