freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ifconfig.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)ifconfig.8	8.3 (Berkeley) 1/5/94
.\"	%Id: ifconfig.8,v 1.9.2.4 1998/06/08 02:02:31 danny Exp %
.\" jpman %Id: ifconfig.8,v 1.2 1997/03/31 14:09:47 horikawa Stab %
.\"
.Dd February 13, 1996
.Dt IFCONFIG 8
.Os BSD 4.2
.Sh 名称
.Nm ifconfig
.Nd ネットワークインタフェースのパラメータの設定を行なう
.Sh 書式
.Nm ifconfig
.Ar interface address_family
.Oo
.Ar address
.Op Ar dest_address
.Oc
.Op Ar parameters
.Nm ifconfig
.Op Fl m
.Ar interface
.Op Ar protocol_family
.Nm ifconfig
.Fl a
.Op Fl m
.Op Fl d
.Op Fl u
.Op Ar protocol_family
.Nm ifconfig
.Fl l
.Op Fl d
.Op Fl u
.Sh 解説
.Nm
は、ネットワークインタフェースに対してネットワークアドレス
の割り当てを行ない、ネットワークインタフェースのパラメータの設定を行ないます。
.Nm
は、システム立ち上げ
時に、マシンが備える各ネットワークインタフェースに対してネットワークアドレス
を割り当てるように使用しなければなりません。また、一旦各ネットワークインタフェ
ースに対し設定したネットワークアドレスを再定義したり、パラメータの設定を
変えたりすることも可能です。
.Pp
.Nm
のオペランドを以下に示します。
.Bl -tag -width Ds
.It Ar Address
.Tn DARPA-Internet
ファミリでは、アドレスはホスト名データベース
.Xr hosts 5
に登録されているホスト名であるか、もしくは
インターネット標準の
.Dq ドット表記
です。
.\" ゼロックスネットワークシステム(tm)ファミリでは、
.\" アドレスは
.\" .Ar net:a.b.c.d.e.f
.\" という形式です。
.\" ここで
.\" .Ar net
.\" は割り当てるネットワーク番号(10進数)、
.\" 残りの
.\" .Ar a
.\" から
.\" .Ar f
.\" までは
.\" ホスト番号を表す 6 バイトであり 16 進数で指定します。
.\" ホスト番号は 10Mb/s イーサネットインタフェースでは省略可能です。
.\" ホスト番号指定を省略した場合には、
.\" 一番目のインタフェースのハードウェア物理アドレスを
.\" すべてのインタフェースにおいて使用します。
.\" .Tn ISO
.\" ファミリでは、
.\" ゼロックスファミリと同じ長さのアドレスを、
.\" 長い 16 進数の文字列で指定します。
.\" 違いは、
.\" ドットが続いた場合にはそのバイトはゼロを表すことと、
.\" ドットはオプションであることです
.\" (ドットはネットワークバイトオーダの長い数字列を
.\" 注意深く扱うために使用します)。
.It Ar address_family
他のパラメータの解釈に影響するネットワークアドレスファミリを指定します。
インタフェースが異なるプロトコルの送信を異なる名前付け体系で
受けることがあるので、アドレスファミリを指定しておくことをお勧めします。
本コマンドでサポートされるプロトコルファミリは、
.Dq inet ,
.Dq atalk ,
.\".Dq iso ,
.Dq ipx
.\" .Dq ns
です。
.It Ar Interface
インタフェースパラメータは、
.Dq name unit
の形式で表現されます。
例えば
.Dq en0
です。
.El
.Pp
.Nm
では以下のパラメータが利用できます:
.Bl -tag -width dest_addressxx
.It Cm alias
指定したインタフェースに、ネットワークアドレスを追加して指定します。
これはネットワーク番号を変更した際に、以前のアドレスに送られるパケットを
受けとりたい場合などに便利です。
.It Cm arp
アドレス解決プロトコル (ARP) を用いてネットワークレベルのアドレスとリンクレベル
のアドレスの対応を取ることを可能にします (デフォルト)。この機能は、
.Tn DARPA
インターネットアドレスと 10Mb/s イーサネットアドレスの間の対応を取るように
作られています。
.It Fl arp
アドレス解決プロトコルの使用を禁止します。
.It Cm broadcast
ネットワークに対するブロードキャストアドレスを指定します。
ブロードキャストアドレスのデフォルト値は、
ホスト部のビットがすべて 1 になったアドレスです。
.It Cm debug
ドライバ依存のデバッグモードを有効にします。
通常コンソールへのエラーログを有効にします。
.It Fl debug
ドライバ依存のデバッグモードを無効にします。
.It Cm delete
指定したネットワークアドレスを無効にします。本機能は、alias で不正なアドレスを
指定した場合や、すでに指定したアドレスが必要ない場合などに使用します。
誤った NS アドレスをホスト部分とともに指定した場合には、
NS アドレスを全て無効にすることにより再度ホスト部分を指定可能となります。
.It Cm dest_address
point to point 接続を行なう場合、相手のアドレスを指定します。
.It Cm down
指定したネットワークインタフェースに ``down'' とマークします。``down'' と
マークされたインタフェースに対しては、システムはメッセージの送信を行ない
ません。可能であれば、そのインタフェースは受信も不可能となるように
リセットされます。この動作は、そのインタフェースを用いる
ルーティングを使用しないよう自動的に設定するものではありません。
.\" .It Cm ipdst
.\" リモートネットワーク向け NS パケットをカプセル化している IP パケットを
.\" 受信する、インターネットホストを指定するために使用します。
.\" 外見上 point to point リンクが構成され、
.\" 指定されたアドレスは、
.\" デスティネーションの NS アドレスとネットワークアドレスとされます。
.\" .Tn CLNP
.\" パケットの IP カプセル化はこれとは異なった方法で実現されます。
.It Cm media Ar type
インタフェースのメディアタイプを
.Ar type
に設定します。
インタフェースによっては、
複数の異なった物理メディアコネクタのうちのいずれかを
排他的に使用することをサポートします。
例えば、10Mb/s イーサネットインタフェースには
.Tn AUI
とツイストペアコネクタをサポートするものがあります。
メディアタイプを
.Dq 10base5/AUI
に設定すると、AUI ポートを現在のアクティブなコネクタとします。
また
.Dq 10baseT/UTP
に設定すると、ツイストペアをアクティブにします。
使用可能なタイプの完全なリストは、
インタフェースドライバ固有のマニュアルページを参照してください。
.It Cm mediaopt Ar opts
インタフェースのメディアオプションを設定します。
.Ar opts
はコンマで区切ったオプションリストで、インタフェースに適用されます。
使用可能なオプションの完全なリストは、
インタフェースドライバ固有のマニュアルページを参照してください。
.It Fl mediaopt Ar opts
インタフェースのメディアオプションを無効にします。
.It Cm metric Ar n
インタフェースのルーティングメトリックを
.Ar n
で指定します。初期値は 0 です。
ルーティングメトリックは、ルーティングプロトコル
.Pq Xr routed 8
で使用されます。
.It Cm mtu Ar n
そのインタフェースの最大転送単位 (mtu) を
.Ar n
に設定します。デフォルト値はインタフェースに依存します。
mtu はインタフェースに送られるパケットの大きさを制限するのに用いられます。
mtu を設定できなかったり、設定出来る値の範囲に制限のある
インタフェースがあります。
.It Cm netmask Ar mask
.\" (inet と ISO)
(inet のみ)
ネットワークをサブネットワークに細分割する際に、ネットワークアドレスとして
リザーブするアドレスを指定します。
mask が指定する部分は、
アドレスのネットワーク部とサブネット部です。
サブネット部はアドレスのホスト部の一部です。
mask は、0x ではじまる16進数、
ドット表記のインターネットアドレス形式、
ネットワークテーブル 
.Xr networks 5
に記述されている仮想ネットワーク名のいずれかで指定できます。
mask での 32ビットアドレスにおける 1 であるビットの部分は、
ネットワーク部もしくはサブネット部として使用します。
0 であるビットの部分はホスト部として使用します。
mask は少なくともネットワーク部を含む必要があり、
サブネット部はネットワーク部に連続する必要があります。
.\" see
.\" Xr eon 5 .
.\" .It Cm nsellength Ar n
.\" .Pf ( Tn ISO
.\" のみ)
.\" .Tn NSAP
.\" に後続するローカル識別に使用するバイト数を指定します。
.\" この部分は
.\" .Tn NET
.\" (Network Entity Title)
.\" として扱われます。
.\" バイト数のデフォルト値は 1 であり、US
.\" .Tn GOSIP
.\" 準拠です。
.\" ifconfig コマンドで設定するISO アドレスが、
.\" .Tn NSAP
.\" です。
.\" 例えば
.\" .Tn US GOSIP
.\" では、20 文字の 16 進数を
.\" .Tn ISO NSAP
.\" において指定し、
.\" インタフェースに割り当てる必要があります。
.\" .Tn AFI
.\" 37 タイプアドレスにおいて、数字が 1 とは異なると便利であるのは、
.\" それなりの理由があります。
.\" .It Cm trailers
.\" trailers は、データ送出時の ``trailer'' リンクレベルパケットカプセル化を
.\" 要求します (デフォルト)。もしネットワークインタフェースが
.\" .Cm trailers
.\" をサポートしている場合、可能
.\" であればシステムは、受信者によるメモリ間コピーの回数を最小になるように、
.\" 出力メッセージのカプセル化を行ないます。アドレス解決プロトコル
.\" (
.\" .Xr arp 4
.\" 参照; 現在 10Mb/s イーサネットのみ)
.\" をサポートする
.\" ネットワーク上では、本フラグは、
.\" 他のシステムが本ホストに対してメッセージを送出
.\" する場合に trailers の処理をすることを要求することを示しています。
.\" 同様に、trailer 要求を行ったホストに対しても、
.\" trailer カプセル化したパケットを送出します。
.\" これは現在インターネットプロトコルを用いている場合に限られます。
.\" .It Fl trailers
.\" ``trailer'' リンクレベルカプセル化を無効にします。 
.It Cm link[0-2]
インタフェースのリンクレベルでの特殊な処理を有効にします。3 つのオプション
の実際の効果はインタフェース依存です。しかしながら、これらのオプションは、
一般的には特殊なオペレーションモードを選択するのに用いられます。この例として、
SLIP 使用時のデータ圧縮や、イーサネットカードのコネクタ選択を行います。
各ドライバごとのマニュアルページに
詳細が記してあるので、詳しくはそちらの方を参照して下さい。
.It Fl link[0-2]
上記の link[0-2] の指定を無効にします。
.It Cm up
指定したネットワークインタフェースに ``up'' とマークします。
本オプションは、
``ifconfig down'' を行なった後にインタフェースを有効にするのに用いられます。
最初にインタフェースにアドレスを設定した場合には、自動的に本指定はされたものと
して扱います。もし、down とマークされていたインタフェースがリセットされた場合、
ハードウェアは再初期化されます。
.El
.Pp
.Nm
は引数としてネットワークインタフェース以外に何のオプションも与えられない場合、
ネットワークインタフェースの現在の設定状態を表示します。
もしプロトコルファミリが指定されている場合、
.Nm
はプロトコルファミリに特有の情報についてのみ表示します。
.Pp
インタフェース名の前に
.Fl m
フラグが渡されると、
.Nm
は、指定されたインタフェースに関し、
サポートされているメディアを全て表示します。
.Pp
オプションとして、インタフェース名の代りに
.Fl a
フラグを指定できます。そうすると、
.Nm
はシステム上の全インタフェースを表示します。
.Fl d
はこれを down したインタフェースに限定し、
.Fl u
はこれは up したインタフェースに限定します。
.Pp
The
.Fl l
フラグを使用するとシステム上の使用可能な全インタフェースのリストを、
その他の情報は付加せずに表示します。
このフラグは他のフラグとは排他的ですが、
.Fl d
(down したインタフェースのみをリスト)
と
.Fl u 
(up したインタフェースのみをリスト)
は例外です。
.Pp
スーパユーザのみがネットワークインタフェースの設定を変更できます。
.Sh 診断
指定したインタフェースが存在しない、
要求したアドレスが未知のものである、
ユーザがネットワークインタフェースの設定を変更する権限を持っていない、
といったメッセージを表示します。
.Sh 関連項目
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr rc 8 ,
.Xr routed 8
.\" .Xr eon 5
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
