freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ifconfig.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)ifconfig.8	8.3 (Berkeley) 1/5/94
.\" %FreeBSD: src/sbin/ifconfig/ifconfig.8,v 1.27.2.10 2001/07/04 00:12:17 brooks Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/ifconfig.8,v 1.18 2001/05/26 02:41:04 horikawa Exp $
.\"
.Dd February 13, 1996
.Dt IFCONFIG 8
.Os BSD 4.2
.Sh 名称
.Nm ifconfig
.Nd ネットワークインタフェースのパラメータの設定を行なう
.Sh 書式
.Nm
.Op Fl L
.Ar interface
.Op Ar address_family
.Oo
.Ar address Ns Op Cm / Ns Ar prefixlength
.Op Ar dest_address
.Oc
.Op Ar parameters
.Nm
.Fl a
.Op Fl L
.Op Fl d
.Op Fl u
.Op Ar address_family
.Nm
.Fl l
.Op Fl d
.Op Fl u
.Op Ar address_family
.Nm
.Op Fl L
.Op Fl d
.Op Fl u
.Sh 解説
.Nm
は、ネットワークインタフェースに対してネットワークアドレス
の割り当てを行ない、ネットワークインタフェースのパラメータの設定を行ないます。
.Nm
は、システム立ち上げ
時に、マシンが備える各ネットワークインタフェースに対してネットワークアドレス
を割り当てるように使用しなければなりません。また、一旦各ネットワークインタフェ
ースに対し設定したネットワークアドレスを再定義したり、パラメータの設定を
変えたりすることも可能です。
.Pp
以下のオプションを使用可能です:
.Bl -tag -width indent
.It Ar address
.Tn DARPA Ns -Internet
ファミリでは、アドレスはホスト名データベース
.Xr hosts 5
に登録されているホスト名であるか、もしくは
インターネット標準の
.Dq ドット表記
です。
.Pp
CIDR 表現 (スラッシュ表現としても知られています) もまた、
ネットマスクの表現に使用可能です。
つまり、
.Li 192.168.0.1/16
のようなアドレスを指定可能です。
.\" ゼロックスネットワークシステム(tm)ファミリでは、
.\" アドレスは
.\" .Ar net:a.b.c.d.e.f
.\" という形式です。
.\" ここで
.\" .Ar net
.\" は割り当てるネットワーク番号(10進数)、
.\" 残りの
.\" .Ar a
.\" から
.\" .Ar f
.\" までは
.\" ホスト番号を表す 6 バイトであり 16 進数で指定します。
.\" ホスト番号は IEEE 802 プロトコル (Ethernet, FDDI, Token Ring)
.\" インタフェースでは省略可能です。
.\" ホスト番号指定を省略した場合には、
.\" 一番目のインタフェースのハードウェア物理アドレスを
.\" すべてのインタフェースにおいて使用します。
.\" .Tn ISO
.\" ファミリでは、
.\" ゼロックスファミリと同じ長さのアドレスを、
.\" 長い 16 進数の文字列で指定します。
.\" 違いは、
.\" ドットが続いた場合にはそのバイトはゼロを表すことと、
.\" ドットはオプションであることです
.\" (ドットはネットワークバイトオーダの長い数字列を
.\" 注意深く扱うために使用します)。
.It Ar address_family
他のパラメータの解釈に影響するネットワーク
.Ar "address family"
を指定します。
インタフェースが異なるプロトコルの送信を異なる名前付け体系で
受けることがあるので、アドレスファミリを指定しておくことをお勧めします。
本コマンドでサポートされるプロトコルファミリは、
.Dq inet ,
.Dq inet6 ,
.Dq atalk ,
.Dq ether ,
.\".Dq iso ,
.Dq ipx
.\" .Dq ns
です。
.It Ar dest_address
ポイントツーポイントリンクにおける他端のアドレスを指定します。
.It Ar interface
インタフェースパラメータは、
.Dq name unit
の形式で表現されます。
例えば
.Dq en0
です。
.El
.Pp
.Nm
では以下のパラメータが利用できます:
.Bl -tag -width indent
.It Cm add
.Cm alias
パラメータの別名です。
BSD/OS との互換性のために導入されました。
.It Cm alias
指定したインタフェースに、ネットワークアドレスを追加して指定します。
これはネットワーク番号を変更した際に、以前のアドレスに送られるパケットを
受けとりたい場合などに便利です。
アドレスが、
本インタフェースの最初のネットワークアドレスと同じサブネット上の場合、
ネットマスク 0xffffffff を指定する必要があります。
.It Fl alias
指定したネットワークアドレスを無効にします。本機能は、alias で不正なアドレスを
指定した場合や、すでに指定したアドレスが必要ない場合などに使用します。
誤った NS アドレスをホスト部分とともに指定した場合には、
NS アドレスを全て無効にすることにより再度ホスト部分を指定可能となります。
.It Cm anycast
(inet6 のみ)
設定されるアドレスはエニーキャスト (anycast) アドレスであると指定します。
現在の仕様では、ルータのみがエニーキャストアドレスに設定可能です。
エニーキャストアドレスは、
出力 IPv6 パケットの送信元アドレスとしては使用されません。
.It Cm arp
アドレス解決プロトコル (ARP) を用いてネットワークレベルのアドレスとリンクレベル
のアドレスの対応を取ることを可能にします (デフォルト)。この機能は、
.Tn DARPA
インターネットアドレスと
.Tn IEEE
802 の 48 ビット MAC アドレス (Ethernet, FDDI, Token Ring のアドレス)
の間の対応を取るように作られています。
.It Fl arp
アドレス解決プロトコルの使用を禁止します。
.It Cm broadcast
ネットワークに対するブロードキャストアドレスを指定します。
ブロードキャストアドレスのデフォルト値は、
ホスト部のビットがすべて 1 になったアドレスです。
.It Cm debug
ドライバ依存のデバッグモードを有効にします。
通常コンソールへのエラーログを有効にします。
.It Fl debug
ドライバ依存のデバッグモードを無効にします。
.It Cm delete
.Fl -alias
パラメータの別名です。
.It Cm down
指定したネットワークインタフェースに
.Dq down
とマークします。
.Dq down
と
マークされたインタフェースに対しては、システムはメッセージの送信を行ない
ません。可能であれば、そのインタフェースは受信も不可能となるように
リセットされます。この動作は、そのインタフェースを用いる
ルーティングを使用しないよう自動的に設定するものではありません。
.It Cm ether
.Dq lladdr
パラメータの別名。
.\" .It Cm ipdst
.\" リモートネットワーク向け NS パケットをカプセル化している IP パケットを
.\" 受信する、インターネットホストを指定するために使用します。
.\" 外見上 point to point リンクが構成され、
.\" 指定されたアドレスは、
.\" デスティネーションの NS アドレスとネットワークアドレスとされます。
.\" .Tn CLNP
.\" パケットの IP カプセル化はこれとは異なった方法で実現されます。
.It Cm lladdr Ar addr
インタフェースにリンクレベルアドレスを設定します。
例えばイーサネットインタフェースに新規 MAC アドレスを
設定するために使用可能ですが、
使用される機構はイーサネットインタフェースに限ったものではありません。
アドレス
.Ar addr
は、コロン区切りの 16 進数の連続で指定します。
本オプション指定時にインタフェースが既に up である場合、
インタフェースを一時的に down にしてから再度 up にします。
これは、下位のイーサネットハードウェアの受信フィルタが
正しくプログラムされたことを保証するためです。
.It Cm media Ar type
ドライバがメディア選択能力を持つ場合、
インタフェースのメディアタイプを
.Ar type
に設定します。
インタフェースによっては、
複数の異なった物理メディアコネクタのうちのいずれかを
排他的に使用することをサポートします。
例えば、10Mb/s Ethernet インタフェースには
.Tn AUI
とツイストペアコネクタをサポートするものがあります。
メディアタイプを
.Dq 10base5/AUI
に設定すると、AUI ポートを現在のアクティブなコネクタとします。
また
.Dq 10baseT/UTP
に設定すると、ツイストペアをアクティブにします。
使用可能なタイプの完全なリストは、
インタフェースドライバ固有の文書やマニュアルページを参照してください。
.It Cm mediaopt Ar opts
ドライバがメディア選択能力を持つ場合、
インタフェースのメディアオプションを設定します。
.Ar opts
はコンマで区切ったオプションリストで、インタフェースに適用されます。
使用可能なオプションの完全なリストは、
インタフェースドライバ固有のマニュアルページを参照してください。
.It Fl mediaopt Ar opts
インタフェースのメディアオプションを無効にします。
.It Cm tunnel Ar src_addr Ar dest_addr
(IP トンネルデバイスのみ)
IP トンネルインタフェース (gif) 用の、
物理的な始点アドレスと終点アドレスを設定します。
引数
.Ar src_addr
と
.Ar dest_addr
は、カプセル化する IPv4/IPv6 ヘッダ用の、外部の始点/終点として解釈されます。
.It Cm deletetunnel
以前に
.Cm tunnel
で設定した IP トンネルインタフェースの、
物理的な始点アドレスと終点アドレスの設定を解除します。
.Cm tunnel .
.It Cm vlan Ar vlan_tag
インタフェースが vlan 擬似インタフェースの場合、vlan タグ値を
.Ar vlan_tag
に設定します。
この値は 16 ビット数値であり、vlan インタフェースから送られるパケットの
802.1Q vlan ヘッダの作成に使用されます。
.Cm vlan
と
.Cm vlandev
は同時に設定される必要があることに注意してください。
.It Cm vlandev Ar iface
インタフェースが vlan 擬似デバイスの場合、物理インタフェース
.Ar iface
を関連付けます。
vlan インタフェースから送信されるパケットは、
802.1Q vlan カプセル化付きで、指定された物理インタフェース
.Ar iface
へ向けて転換 (divert) されます。
親インタフェースが受信した 802.1Q カプセル化付きのパケットに
正しい vlan タグが付いていた場合、
そのパケットは関連付けられた vlan 擬似インタフェースへ転換されます。
vlan インタフェースは、
親インタフェースのフラグと親のイーサネットアドレスが割り当てられます。
.Cm vlandev
と
.Cm vlan
は同時に設定される必要があります。
vlan インタフェースが既に物理インタフェースと関連付けられている場合、
このコマンドは失敗します。
別の物理インタフェースへ関連付けを変更するには、
既存の関連付けをまずクリアする必要があります。
.Pp
注: vlan インタフェースで
.Ar link0
フラグをセットした場合、vlan 擬似インタフェースの振舞いが変わります:
親インタフェースが自身の vlan タグの挿入と取り出しをサポートすること、
vlan インタフェースが親に対して無修正でパケットを渡すべきことを、
.Ar link0
は vlan インタフェースに対して通知します。
.It Fl vlandev Ar iface
ドライバが vlan 擬似ドライバの場合、物理インタフェース
.Ar iface
どドライバとの関連付けを解除します。
これにより、vlan インタフェースとその親との間のリンクを破壊し、
vlan タグとフラグとリンクアドレスをクリアし、
インタフェースをシャットダウンします。
.It Cm metric Ar n
インタフェースのルーティングメトリックを
.Ar n
で指定します。初期値は 0 です。
ルーティングメトリックは、ルーティングプロトコル
.Pq Xr routed 8
で使用されます。
.It Cm mtu Ar n
そのインタフェースの最大転送単位 (mtu) を
.Ar n
に設定します。デフォルト値はインタフェースに依存します。
mtu はインタフェースに送られるパケットの大きさを制限するのに用いられます。
mtu を設定できなかったり、設定出来る値の範囲に制限のある
インタフェースがあります。
.It Cm netmask Ar mask
.\" (inet と ISO)
(inet のみ)
ネットワークをサブネットワークに細分割する際に、ネットワークアドレスとして
リザーブするアドレスを指定します。
mask が指定する部分は、
アドレスのネットワーク部とサブネット部です。
サブネット部はアドレスのホスト部の一部です。
mask は、0x ではじまる16進数、
ドット表記のインターネットアドレス形式、
ネットワークテーブル 
.Xr networks 5
に記述されている仮想ネットワーク名のいずれかで指定できます。
mask での 32ビットアドレスにおける 1 であるビットの部分は、
ネットワーク部もしくはサブネット部として使用します。
0 であるビットの部分はホスト部として使用します。
mask は少なくともネットワーク部を含む必要があり、
サブネット部はネットワーク部に連続する必要があります。
.Pp
ネットマスクはまた、CIDR 表現で、アドレスの後に指定可能です。
更なる情報については、前述の
.Ar address
オプションを参照してください。
.It Cm prefixlen Ar len
(inet6 のみ)
.Ar len
ビットを、ネットワークからサブネットワークへの分割用に予約すると、
指定します。
.Ar len
は整数であることが必要であり、
文法的な理由で 0 から 128 の間であることが必要です。
現在の IPv6 の割り当て規則では、ほぼ常に 64 です。
本パラメータを省略すると、64 が使用されます。
.\" see
.\" Xr eon 5 .
.\" .It Cm nsellength Ar n
.\" .Pf ( Tn ISO
.\" のみ)
.\" .Tn NSAP
.\" に後続するローカル識別に使用するバイト数を指定します。
.\" この部分は
.\" .Tn NET
.\" (Network Entity Title)
.\" として扱われます。
.\" バイト数のデフォルト値は 1 であり、US
.\" .Tn GOSIP
.\" 準拠です。
.\" ifconfig コマンドで設定するISO アドレスが、
.\" .Tn NSAP
.\" です。
.\" 例えば
.\" .Tn US GOSIP
.\" では、20 文字の 16 進数を
.\" .Tn ISO NSAP
.\" において指定し、
.\" インタフェースに割り当てる必要があります。
.\" .Tn AFI
.\" 37 タイプアドレスにおいて、数字が 1 とは異なると便利であるのは、
.\" それなりの理由があります。
.It Cm range Ar netrange
Appletalk において
.Ar netrange
に返答するようにインタフェースを設定します。
書式は
.Ar startnet Ns - Ns Ar endnet
です。
Appletalk は netmask ではなくこの方法を使用しますが、
.Fx
の内部においては netmask の集合として実装しています。
.It Cm remove
.Fl alias
パラメータの別名です。
BSD/OS との互換性のために導入されました。
.It Cm phase
これに続く引数は、
インタフェースに接続された Appletalk ネットワークの
バージョン (フェーズ) を指定します。
1 または 2 が許されています。
.It Cm link Ns Xo
.Op Cm 0 Ns - Ns Cm 2
.Xc
指定したインタフェースのリンクレベルでの特殊な処理を有効にします。
3 つのオプション
の実際の効果はインタフェース依存です。しかしながら、これらのオプションは、
一般的には特殊なオペレーションモードを選択するのに用いられます。この例として、
SLIP 使用時のデータ圧縮や、Ethernet カードのコネクタ選択を行います。
各ドライバごとのマニュアルページに
詳細が記してあるので、詳しくはそちらの方を参照して下さい。
.It Fl link Ns Xo
.Op Cm 0 Ns - Ns Cm 2
.Xc
指定したインタフェースのリンクレベルでの特殊な処理を無効にします。
.It Cm up
指定したネットワークインタフェースに
.Dq up
とマークします。
本オプションは、
.Dq ifconfig down
を行なった後にインタフェースを有効にするのに用いられます。
最初にインタフェースにアドレスを設定した場合には、自動的に本指定はされたものと
して扱います。もし、down とマークされていたインタフェースがリセットされた場合、
ハードウェアは再初期化されます。
.It Cm ssid Ar ssid
IEEE 802.11 無線インタフェース用であり、
希望するサービスセット識別子 (SSID; 別名はネットワーク名)
を設定します。
SSID は、32 文字までの文字列であり、
通常の文字列の形式か
.Sq 0x
を前に付けた 16 進数の形式で、指定可能です。
更に、SSID に
.Sq -
を設定することで、これを消去可能です。
.It Cm nwid Ar ssid
.Dq ssid
パラメータの別名。
NetBSD との互換性のためにあります。
.It Cm stationname Ar name
IEEE 802.11 無線インタフェース用であり、
このステーションの名前を設定します。
ステーション名は、本当は IEEE 802.11 プロトコルの一部ではないようですが、
すべてのインタフェースがこれをサポートしているようです。
そのようなものですから、
同じもしくは実際的に同じ機器にとってのみ有用であるようです。
.It Cm station Ar name
.Dq stationname
パラメータの別名。
BSD/OS との互換性のためにあります。
.It Cm channel Ar number
IEEE 802.11 無線インタフェース用であり、
希望するチャネルを設定します。
チャネルの範囲は 1 から 14 ですが、
アダプタがどの地域用に製造されたかに、利用可能な選択肢は依存します。
チャネルを 0 に設定すると、アダプタのデフォルト設定になります。
アドホックモード以外では、多くのアダプタがこの設定を無視します。
.It Cm authmode Ar mode
IEEE 802.11 無線インタフェース用であり、
インフラストラクチャモードでの希望する認証モードを設定します。
すべてのアダプタがすべてのモードをサポートしているわけではありません。
正当なモードは
.Dq none ,
.Dq open ,
.Dq shared
です。
モードは、大文字小文字を区別しません。
.It Cm powersave
IEEE 802.11 無線インタフェース用であり、省電力モードを有効にします。
.It Cm -powersave
IEEE 802.11 無線インタフェース用であり、省電力モードを無効にします。
.It Cm powersavesleep Ar sleep
IEEE 802.11 無線インタフェース用であり、
希望する最大省電力スリープ時間をミリ秒で指定します。
.It Cm wepmode Ar mode
IEEE 802.11 無線インタフェース用であり、希望する WEP モードを設定します。
すべてのアダプタがすべてのモードをサポートしているわけではありません。
正当なモードは
.Dq off ,
.Dq on ,
.Dq mixed
です。
.Dq mixed
モードは、暗号化トラフィックと非暗号化トラフィックの両方を許す
アクセスポイントとの関係を許すことを、アダプタに明示的に指定します。
両方を許すアダプタにおける
.Dq on
は、
アクセスポイントが暗号化接続のみを許可することが必要であることを意味します。
他のアダプタにおける
.Dq on
は、一般的に
.Dq mixed
の別名です。
モードは、大文字小文字を区別しません。
.It Cm weptxkey Ar index
IEEE 802.11 無線インタフェース用であり、送信に使用する WEP 鍵を設定します。
.It Cm wepkey Ar key|index:key
IEEE 802.11 無線インタフェース用であり、選択された WEP 鍵を設定します。
.Ar index
が指定されない場合、鍵 1 が設定されます。
WEP 鍵の長さは、5 文字または 13 文字 (40 ビットまたは 104 ビット) であり、
ローカルネットワークとアダプタの機能に依存します。
通常の文字列の形式か
.Sq 0x
を前に付けた 16 進数の形式で、指定可能です。
鍵は、
.Sq -
を設定することで、これを消去可能です。
WEP がサポートされていれば、最低 4 個の鍵があります。
アダプタによっては 4 個を越える鍵をサポートするものもあります。
そのような場合、最初の 4 個の鍵 (1-4) が標準の一時鍵となり、
他の鍵がアダプタ固有の鍵となります
後者は、例えば、NVRAM に格納される永続鍵です。
.It Cm wep
.Dq wepmode on
の別の指定方法。
BSD/OS との互換性のためにあります。
.It Cm -wep
.Dq wepmode off
の別の指定方法。
BSD/OS との互換性のためにあります。
.It Cm nwkey key
以下の、別の指定方法。
.Pp
``wepmode on weptxkey 1 wepkey 1:key wepkey 2:- wepkey 3:- wepkey 4:-''.
.Pp
NetBSD との互換性のためにあります。
.It Cm nwkey n:k1,k2,k3,k4
以下の、別の指定方法。
.Pp
``wepmode on weptxkey n wepkey 1:k1 wepkey 2:k2 wepkey 3:k3 wepkey 4:k4''.
.Pp
NetBSD との互換性のためにあります。
.It Cm -nwkey
.Dq wepmode off
の別の指定方法。
.Pp
NetBSD との互換性のためにあります。
.El
.Pp
.Nm
は引数としてネットワークインタフェース以外に何のオプションも与えられない場合、
ネットワークインタフェースの現在の設定状態を表示します。
プロトコルファミリが指定されている場合、
.Nm
はプロトコルファミリに特有の情報についてのみ表示します。
.Pp
ドライバがメディア選択をサポートする場合、
サポートされているメディアのリストが出力に含まれます。
.Pp
オプションとして、インタフェース名の代りに
.Fl L
フラグを指定すると、IPv6 用のアドレスの生存時間が、
時刻オフセット文字列として表示されます
.Pp
.Fl a
フラグを指定できます。そうすると、
.Nm
はシステム上の全インタフェースを表示します。
.Fl d
フラグはこれを down したインタフェースに限定し、
.Fl u
フラグはこれは up したインタフェースに限定します。
引数を指定しないと、
.Fl a
が暗黙的に指定されます。
.Pp
.Fl l
フラグを使用するとシステム上の使用可能な全インタフェースのリストを、
その他の情報は付加せずに表示します。
このフラグは他のフラグとは排他的ですが、
.Fl d
(down したインタフェースのみをリスト)
と
.Fl u 
(up したインタフェースのみをリスト)
は例外です。
.Pp
スーパユーザのみがネットワークインタフェースの設定を変更できます。
.Sh 注
メディア選択システムは比較的新しく、いくつかのドライバのみサポートしています
(必要があるものも限られています)。
.Sh 診断
指定したインタフェースが存在しない、
要求したアドレスが未知のものである、
ユーザがネットワークインタフェースの設定を変更する権限を持っていない、
といったメッセージを表示します。
.Sh バグ
IPv6 ノード間のいくつかの基本的な通信用に、
IPv6 リンクローカルのアドレスが必要です。
これらを
.Nm
で手動で削除すると、カーネルが非常に奇妙な動作を示すことがあります。
よって、このような手動削除は、強く非推奨です。
.Sh 関連項目
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr rc 8 ,
.Xr routed 8
.\" .Xr eon 5
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
