freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ifmcstat.8
.\" Copyright (c) 1996 WIDE Project. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modifications, are permitted provided that the above copyright notice
.\" and this paragraph are duplicated in all such forms and that any
.\" documentation, advertising materials, and other materials related to
.\" such distribution and use acknowledge that the software was developed
.\" by the WIDE Project, Japan. The name of the Project may not be used to
.\" endorse or promote products derived from this software without
.\" specific prior written permission. THIS SOFTWARE IS PROVIDED ``AS IS''
.\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT
.\" LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE.
.\"
.\"	%FreeBSD: src/usr.sbin/ifmcstat/ifmcstat.8,v 1.1.2.1 2000/04/20 15:22:16 phantom Exp %
.\" jpman %Id: ifmcstat.8,v 1.3 2000/04/04 04:07:51 horikawa Stab %
.\"
.Dd May 21, 1998
.Dt IFMCSTAT 8
.Os KAME
.Sh 名称
.Nm ifmcstat
.Nd インタフェース毎のマルチキャストグループ管理統計を出力する
.Sh 書式
.Nm
.\"
.Sh 解説
.Nm
はカーネル内のマルチキャストグループ情報を出力します。
.Pp
コマンドラインオプションはありません。
.\"
.\" .Sh SEE ALSO
.\" RFC2080 -- IPng for IPv6. G. Malkin, R. Minnear. January 1997.
