freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ifmcstat.8
.\"	$KAME: ifmcstat.8,v 1.3 2000/10/15 11:43:57 itojun Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, 1998, and 1999 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/ifmcstat/ifmcstat.8,v 1.1.2.3 2001/08/16 15:55:59 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd May 21, 1998
.Dt IFMCSTAT 8
.Os
.Sh 名称
.Nm ifmcstat
.Nd インタフェース毎のマルチキャストグループ管理統計を出力する
.Sh 書式
.Nm
.Sh 解説
.Nm
はカーネル内のマルチキャストグループ情報を出力します。
.Nm netstat Fl ina
からの出力に似ていますが、同じではありません。
.Pp
コマンドラインオプションはありません。
.Pp
root のみが
.Nm
を使用可能です。
.Sh 関連項目
.Xr netstat 1
.Rs
.%A G. Malkin
.%A R. Minnear
.%R IPng for IPv6
.%N RFC2080
.Re
