freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ilmid.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) %FreeBSD: src/sbin/atm/ilmid/ilmid.8,v 1.3.2.1 2001/01/22 17:46:05 ru Exp %
.\" jpman %Id: ilmid.8,v 1.3 1998/12/23 21:22:41 vanitas Stab %
.\"
.\"
.Dd September 14, 1998
.Dt ILMID 8
.Os
.Sh 名称
.Nm ilmid
.Nd "単純な ILMI ATM アドレス登録デーモン"
.Sh 書式
.Nm
.Op Fl d Ar level
.Op Fl f
.Op Fl r
.Sh 解説
.Nm
は、ATM ネットワークスイッチに ILMI ATM アドレス登録手続きを行う、
HARP ATM デーモンです。
通常、ブート時に、ATM スタートアップスクリプトから起動されます。
.Pp
UNI シグナリングマネージャがアタッチされた ATM インタフェース毎に、
.Nm
は ILMI PVC (VPI = 0, VCI = 16) をオープンし、
インタフェースの ATM アドレスをスイッチに登録します。
アドレス登録手続きの一部として、
ATM スイッチはエンドシステム (ローカルホスト) に対し、
エンドシステム ATM アドレスの
.Dq "ネットワークプレフィックス"
部分を通知します。
また、
.Nm
はスイッチに対し、エンドシステムのアドレスの
.Dq "ユーザ部分"
(典型的にはインタフェースカードの MAC アドレス) を通知します。
.Sh オプション
.Bl -tag -width indent
.It Fl d Ar level
オプションのプロトコルトレースのために、デバッグレベルを指定します。
メッセージは
.Pa /var/log/ilmid
に書き込まれます。
.It Fl f
.Nm
をフォアグラウンドで動作させます。
.It Fl r
.Nm
に、オープン可能な全 ATM インタフェースに対して coldStart TRAP を発行させ、
終了します。
.El
.Sh 注
このデーモンは、ATM Forum ILMI 仕様に完全には合致していません。
特に、
ATM アドレステーブルが空であることを保証するための、
ネットワークサイドに対する問い合わせを、まったく行いません。
また、ILMI の一部として指定されている ATM Forum MIB も、
まったく実装していません。
.Pp
.Nm
は、シグナル
.Dv SIGUSR1
を受信するとデバッグレベルを増加させ、
シグナル
.Dv SIGUSR2
を受信するとデバッグレベルを減少させます。
.Sh 関連項目
ILMI プロトコルとアドレス登録手続きの詳細については、
ATM Forum の
.%T "ATM User-Network Interface, Version 3.1 (UNI 3.1) Specification"
を参照してください。
.Sh バグ
バグは
.Aq harp\-bugs@magic.net
に報告してください。
.Sh COPYRIGHT
Copyright (c) 1994-1998, Network Computing Services, Inc.
.Sh 作者
.An John Cavanaugh ,
Network Computing Services, Inc.
.An Mike Spengler ,
Network Computing Services, Inc.
.An Joseph Thomas ,
Network Computing Services, Inc.
.Sh 謝辞
本ソフトウェアは、
Defense Advanced Research Projects Agency (DARPA) の協力により開発されました。
.Sh 日本語訳
.An 堀川和雄 Aq horikawa@jp.FreeBSD.org
