freebsd/freebsd-doc/ja_JP.eucJP/man/man8/intro.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)intro.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/share/man/man8/intro.8,v 1.3.2.3 2002/04/12 16:25:18 trhodes Exp %
.\" $FreeBSD$
.\"
.Dd December 11, 1993
.Dt INTRO 8
.Os
.Sh 名称
.Nm intro
.Nd システムメンテナンスおよび操作コマンドの紹介
.Sh 解説
本セクションにはシステムの操作とメンテナンスに関連した情報が記載されています。
新しいファイルシステムを作成する時に使用する
.Ql Xr newfs ,
ファイルシステムの整合性をチェックする
.Ql Xr fsck ,
ディスクの使用を制限するための
.Ql Xr edquota ,
システムのバックアップを行なう
.Ql Xr dump ,
ディスクの内容が壊れた時にファイルをリカバーする
.Ql Xr restore
について解説されています。
ディスクやテープをフォーマットする場合には、
そのシステムが運用されている特定のアーキテクチャ用の
.Ql Xr format
のマニュアルを参照する必要があります。
.Ql Xr inetd
や
.Ql Xr ftpd
のようなネットワークに関連したサービスについても解説されています。
システムのクラッシュダンプをどのように解析するかについて理解するには
.Ql Xr crash
のセクションを参照する必要があります。
.Pp
すべてのコマンドは終了ステータスを設定します。
別途記述 (まれです) が無い限り、
値 0 はコマンドが完全に成功したことを表し、>0 の値はエラーを表します。
コマンドによっては、
.Xr sysexits 3
で定義されたエラーコードを使用して失敗の種類を記述しようとしますが、
他のコマンドは好き勝手な >0 値 (典型的には 1) を単に設定します。
このような値の多くはマニュアルに記述されていません。
.Sh 歴史
.Nm
セクションのマニュアルページは
.Bx 4.2
から登場しました。
