freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ipf.8
.\" %FreeBSD: src/contrib/ipfilter/man/ipf.8,v 1.3 2000/02/10 03:17:49 peter Exp %
.TH IPF 8
.\" jpman %Id: ipf.1,v 1.3 1998/10/15 12:27:39 kuma Stab %
.SH 名称
ipf \- IP パケット入出力用のパケットフィルタリストを変更する
.SH 書式
.B ipf
[
.B \-AdDEInoPrsUvVyzZ
] [
.B \-l
<block|pass|nomatch>
] [
.B \-F
<i|o|a|s|S>
]
.B \-f
<\fIfilename\fP>
[
.B \-f
<\fIfilename\fP>
[...]]
.SH 解説
.PP
\fBipf\fP は列挙されたファイルをオープンし ("\-" は標準入力として扱います)、
そのファイルを解釈して、
パケットフィルタルールセットに対し追加または削除するルールセットを求めます。
.PP
\fBipf\fP が処理する各ルールは、解釈に問題がなければ、
カーネル内部のリストに追加されます。
ルールは、\fBipf\fP に与えられた時の出現順に一致する順序で
内部リストの最後に追加されます。
.SH オプション
.TP
.B \-A
リストを、動作中のリストに変更を加えるものとします (デフォルト)。
.TP
.B \-d
デバッグモードをオンにします。
各フィルタルールを処理するごとに、フィルタルールの 16 進数ダンプを作成します。
.TP
.B \-D
(フィルタが有効な場合) フィルタを無効にします。
ローダブルカーネルバージョンでは動作しません。
.TP
.B \-E
(フィルタが無効な場合) フィルタを有効にします。
ローダブルカーネルバージョンでは動作しません。
.TP
.BR \-F \0<i|o|a>
このオプションは、どのフィルタリストを捨てるのかを指定します。
パラメータは、"i" (input; 入力), "o" (output; 出力),
"a" (all; 全フィルタルールの除去)
のいずれかです。
レター一文字でも、またはそのレターで開始する語でも
どちらを用いてもかまいません。
実行オプションを指定するコマンドラインにおいて、
このオプションの位置は他のオプションの前でも後でもかまいません。
.TP
.BR \-F \0<s|S>
状態テーブルからエントリを消すために、
\fB-F\fP オプションは、"s" (完全に確立していない接続に関する状態情報の除去)
か "S" (すべての接続に関する状態情報の除去) と共に使用します。
2 つのオプションのどちらか片方のみ指定可能です。
完全に確立された接続は、\fBipfstat -s\fP 出力で 4/4 と表示され、
どちらかの方向にずれている場合にはもう完全には確立していないことを示します。
.TP
.BR \-f \0<filename>
このオプションは、パケットフィルタルールリストを変更するための入力を、
\fBipf\fP がどのファイルから得るのかを指定します。
.TP
.B \-I
リストを、動作中ではないリストに変更を加えるものとします。
.TP
.B \-l \0<pass|block|nomatch>
\fB-l\fP フラグを使用すると、パケットのデフォルトログ動作を切り替えます。
このオプションに対する有効な引数は、
\fBpass\fP, \fBblock\fP, \fBnomatch\fP のいずれかです。
オプションが設定されたとき、
フィルタリングから抜け出した、
いずれかの分類にマッチするパケットは、ログされます。
これが最も有用なのは、
ロードしたルールのいずれにもマッチしなかった全パケットをログする場合です。
.TP
.B \-n
このフラグ (無変更) は、\fBipf\fP が実際に ioctl を呼び出すことと、
現在実行中のカーネルを変更することを妨げます。
.TP
.B \-o
(デフォルトの) 入力リストに対してではなく、
出力リストに対してデフォルトでルールを追加/削除するように強制します。
.TP
.B \-P
認証ルールテーブルの一時エントリに、ルールを追加します。
.TP
.B \-r
マッチするフィルタルールを、内部リストに追加するのではなく、削除します。
.TP
.B \-s
使用中の活動フィルタリストを「他」のものと交換します。
.TP
.B \-U
(SOLARIS 2 のみ)
IP パケットとしては認識されないような
データストリームを伴っているパケットをブロックします。
このようなパケットはコンソールに表示されます。
.TP
.B \-v
冗長モードをオンにします。ルール処理に関する情報を表示します。
.TP
.B \-V
バージョン情報を表示します。
ipf バイナリに組み込まれたバージョン情報を表示します。
これは、(実行中/存在する場合には) カーネルコードから取り出します。
カーネル中に存在する場合、現在の状態が表示されます
(ログ取得が有効か、デフォルトフィルタリング等)。
.TP
.B \-y
IP フィルタが管理しているカーネル内インタフェースリストと、
現在のインタフェース状態リストとを、手動で再同期します。
.TP
.B \-z
入力ファイル中の各ルールに対し、統計情報を 0 にリセットし、
0 にする前の統計情報を表示します。
.TP
.B \-Z
フィルタリングのみに使用されるカーネル内全体統計情報を 0 にします
(断片化と状態の統計には無関係です)。
.DT
.SH 関連ファイル
/dev/ipauth
.br
/dev/ipl
.br
/dev/ipstate
.SH 関連項目
ipftest(1), mkfilters(1), ipf(4), ipl(4), ipf(5), ipfstat(8), ipmon(8), ipnat(8)
.SH 診断
.PP
カーネル内のパケットフィルタリストを実際に更新するには、
root として実行する必要があります。
.SH バグ
.PP
バグをみつけたら、darrenr@cyber.com に電子メールを送ってください。
