freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ipfstat.8
.\" %FreeBSD: src/contrib/ipfilter/man/ipfstat.8,v 1.8 2004/06/21 22:53:03 darrenr Exp %
.\" $FreeBSD$
.TH ipfstat 8
.SH 名称
ipfstat \- パケットフィルタ統計とフィルタリストのレポート
.SH 書式
.B ipfstat
[
.B \-6aAfghIinosv
] [
.B \-d
<device>
]

.B ipfstat -t
[
.B \-C
] [
.B \-D
<addrport>
] [
.B \-P
<protocol>
] [
.B \-S
<addrport>
] [
.B \-T
<refresh time>
] [
.B \-d
<device>
]
.SH 解説
.PP
\fBipfstat\fP コマンドはシンボル
\fB_fr_flags\fP, \fB_frstats\fP, \fB_filterin\fP, \fB_filterout\fP を用いて
/dev/kmem を調べます。
このコマンドが実行できかつ機能しうるためには、/dev/kmem とカーネル
そのものを読める必要があります。
カーネルの名前は、デフォルトでは \fB/kernel\fP とつけられています。
.PP
\fBipfstat\fP のデフォルトの動作は、カーネルがフィルタを通して
パケットをやりとりする間に蓄積された統計を取り出して表示することです。
.SH オプション
.TP
.B \-6
IPv6 用のフィルタリストを、使用可能であれば、表示します。
.TP
.B \-a
アカウンティングを行なっているフィルタリストを表示します。
更に、それぞれのルールに対してカウントされたバイト数を表示します。
.TP
.B \-A
パケット認証統計を表示します。
.TP
.B \-C
\fB\-t\fP オプションと組み合わせる場合のみ、本オプションは有効です。
top において、"closed" の状態も表示します。
通常、CLOSE_WAIT のプロトコル状態になった TCP 接続は、表示されません。
本オプションを有効にすると、すべての状態のエントリが表示されます。
.TP
.BR \-d \0<device>
カーネルとのインタフェースを行なう為、\fB/dev/ipl\fP の代わりに、
device を用います。
.TP
.BR \-D \0<addrport>
\fB\-t\fP オプションと組み合わせる場合のみ、本オプションは有効です。
top 形式の状態表示対象のエントリを、
終点 IP アドレスとポートが addport 引数にマッチするもののみに限定します。
addrport の指定は ipaddress[,port] という形式です。
ipaddress と port は、数値か文字列 "any"
(それぞれ、任意の IP アドレスまたは任意のポートを指定) です。
\fB\-D\fP オプションが指定されない場合、"\fB\-D\fP any,any" になります。
.TP
.B \-f
フラグメントの状態情報 (統計) と、もしも存在していたら、(カーネル内に)
保存された状態情報を表示します。
.TP
.B \-g
設定済みのグループを表示します
(アクティブのものと非アクティブのものの両方)。
.TP
.B \-h
ルール毎にそれぞれがヒットを記録する回数を表示します。
\fB\-i\fP とともに用います。
.TP
.B \-i
カーネルの IP 処理の入力側に用いられるフィルタリストを表示します。
.TP
.B \-I
「非アクティブ」フィルタリストの詳細を取り出す処理と、
「アクティブ」フィルタリストの詳細を取り出す処理を切り替えます。
\fB\-i\fP とともに用いる為のものです。
.TP
.B \-n
ルールがプリントされる時にそれぞれの「ルール番号」が示されます。
.TP
.B \-o
カーネルの IP 処理の出力側に用いられるフィルタリストを表示します。
.TP
.BR \-P \0<protocol>
\fB\-t\fP オプションと組み合わせる場合のみ、本オプションは有効です。
top 形式の状態表示対象のエントリを、
特定のプロトコルにマッチするもののみに限定します。
引数は、プロトコル名 (\fB/etc/protocols\fP で定義されるもの) か、
プロトコル番号です。
本オプションを指定しないと、すべてのプロトコルの状態エントリが指定されます。
.TP
.B \-s
パケット/フローの状態情報 (統計のみ) を表示します；
.TP
.B \-sl
(カーネル内に) 保存された状態情報が存在すれば、これを表示します
(統計は表示しません)。
.TP
.BR \-S \0<addrport>
\fB\-t\fP オプションと組み合わせる場合のみ、本オプションは有効です。
top 形式の状態表示対象のエントリを、
始点 IP アドレスとポートが addport 引数にマッチするもののみに限定します。
addrport の指定は ipaddress[,port] という形式です。
ipaddress と port は、数値か文字列 "any"
(それぞれ、任意の IP アドレスまたは任意のポートを指定) です。
\fB\-S\fP オプションが指定されない場合、"\fB\-S\fP any,any" になります。
.TP
.B \-t
状態表の表示を、\fBtop(1)\fP がプロセス表を表示する方法で行います。
状態は、何種類かの方法でソート可能です。
本オプションは、\fBncurses(3)\fP が必要であり、
本オプションが組み込まれていることが必要です。
本オプションは、すべてのオペレーティングシステムで使用可能とは限りません。
top モードの ipfstat で使用可能なキーについての更なる情報は、後述します。
.TP
.BR \-T \0<refreshtime>
\fB\-t\fP オプションと組み合わせる場合のみ、本オプションは有効です。
本オプションは、top 形式の状態表示の更新頻度を指定します。
refreshtime は、更新間隔を秒単位で指定し、正整数を指定可能です。
デフォルト (そして最小更新間隔) は 1 です。
.TP
.B \-v
冗長モードで起動します。より多くのデバッグ情報を表示します。
.SH 概要
\fBipfstat\fP の役割は、現在のカーネルの統計を表示することです。
この統計は、カーネルに出入りするパケットにいくつかのフィルタが
(存在する場合には) 適切に適用される結果として集められたものです。
これは、コマンドラインパラメータが指定されていない時のデフォルトの
動作です。
.PP
このコマンドは \fB\-i\fP か \fB\-o\fP とともに与えられた時は、
その時点でインストールされカーネルに使用されている
適切なフィルタルールリストを、
取り出して表示するでしょう。
.SH TOP 形式の状態表示
\fB\-t\fP オプションを使用すると、
\fBipfstat\fP は top 形式の状態表示モードになります。
このモードでは、
状態表の表示を、\fBtop\fP がプロセス表を表示する方法で行います。
\fB\-C\fP, \fB\-D\fP, \fB\-P\fP, \fB\-S\fP, \fB\-T\fP の
コマンドラインオプションを使うことで、
状態エントリの制限と表示更新の頻度を指定可能です。
.PP
top モードでは、次のキーを使用して、表示情報を変更可能です:
.TP
\fBd\fP を使うと、表示する情報を選択します。
.TP
\fBl\fP を使うと、画面を再描画します。
.TP
\fBq\fP を使うと、プログラムを終了します。
.TP
\fBs\fP を使うと、ソートに使用する基準を変更します。
.TP
\fBr\fP を使うと、ソートに使用する基準を反転します。
.PP
状態エントリのプロトコル番号・IP パケット数・
バイト数・生存時間で、状態をソート可能です。
デフォルトでは、バイト数でソートします。
状態は、降順でソートされますが、
\fBr\fP キーを使用することで昇順でソート可能です。
.SH TOP 形式の状態表示の制約
現在のところ、始点・終点・プロトコルの各フィルタおよび更新間隔は、
対話的に変更できません。
コマンドラインから実行する必要があります。
.PP
画面は最低 80 桁必要ですが、このことはチェックされません。
.PP
ソートおよびフィルタの基準にマッチする、
最初の X-5 エントリだけが表示されます (ここで X は画面の行数です。
より多くのエントリを見る方法はありません)。
.PP
IPv6 サポートはありません。
.PP
.SH 関連ファイル
/dev/kmem
.br
/dev/ipl
.br
/dev/ipstate
.br
/kernel
.SH 関連項目
ipf(8)
.SH バグ
知られていません。
