freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ipfstat.8
.\" %FreeBSD: src/contrib/ipfilter/man/ipfstat.8,v 1.3.2.1 2000/07/19 14:28:04 darrenr Exp %
.TH ipfstat 8
.\" jpman %Id: ipfstat.8,v 1.3 1998/10/14 10:49:51 horikawa Stab %
.SH 名称
ipfstat \- パケットフィルタ統計とフィルタリストのレポート
.SH 書式
.B ipfstat
[
.B \-aAfghIinosv
] [
.B \-d
<device>
]
.SH 解説
.PP
\fBipfstat\fP コマンドはシンボル
\fB_fr_flags\fP, \fB_frstats\fP, \fB_filterin\fP, \fB_filterout\fP を用いて
/dev/kmem を調べます。
このコマンドが実行できかつ機能しうるためには、/dev/kmem とカーネル
そのものを読める必要があります。
カーネルの名前は、デフォルトでは \fB/kernel\fP とつけられています。
.PP
\fBipfstat\fP のデフォルトの動作は、カーネルがフィルタを通して
パケットをやりとりする間に蓄積された統計を取り出して表示することです。
.SH オプション
.TP
.B \-a
アカウンティングを行なっているフィルタリストを表示します。
更に、それぞれのルールに対してカウントされたバイト数を表示します。
.TP
.B \-A
パケット認証統計を表示します。
.TP
.BR \-d \0<device>
カーネルとのインタフェースを行なう為、\fB/dev/ipl\fP の代わりに、
device を用います。
.TP
.B \-f
フラグメントの状態情報 (統計) と、もしも存在していたら、(カーネル内に)
保存された状態情報を表示します。
.TP
.B \-g
設定済みのグループを表示します
(アクティブのものと非アクティブのものの両方)。
.TP
.B \-h
ルール毎にそれぞれがヒットを記録する回数を表示します。
\fB\-i\fP とともに用います。
.TP
.B \-i
カーネルの IP 処理の入力側に用いられるフィルタリストを表示します。
.TP
.B \-I
「非アクティブ」フィルタリストの詳細を取り出す処理と、
「アクティブ」フィルタリストの詳細を取り出す処理を切り替えます。
\fB\-i\fP とともに用いる為のものです。
.TP
.B \-n
ルールがプリントされる時にそれぞれの「ルール番号」が示されます。
.TP
.B \-o
カーネルの IP 処理の出力側に用いられるフィルタリストを表示します。
.TP
.B \-s
パケット/フローの状態情報 (統計のみ) を表示します。
.TP
.B \-sl
(カーネル内に) 保存された状態情報が存在すれば、これを表示します。
.TP
.BR \-S \0<addrport>
\fB\-t\fP オプションと組み合わせる場合のみ、本オプションは有効です。
状態表示対象のエントリを、
始点 IP アドレスとポートが addport 引数にマッチするもののみに限定します。
addrport の指定は ipaddress[,port] という形式です。
ipaddress と port は、数値か文字列 "any"
(それぞれ、任意の IP アドレスまたは任意のポートを指定) です。
\fB\-S\fP オプションが指定されない場合、\fB\-S\fP any,any になります。
.TP
.B \-t
状態表の表示を、\fBtop(1)\fP がプロセス表を表示する方法で行います。
状態は、何種類かの方法でソート可能です。
本オプションは、\fBncurses(3)\fP が必要であり、
本オプションが組み込まれていることが必要です。
本オプションは、すべてのオペレーティングシステムで使用可能とは限りません。
top モードの ipfstat で使用可能なキーについての更なる情報は、後述します。
.TP
.BR \-T \0<refreshtime>
\fB\-t\fP オプションと組み合わせる場合のみ、本オプションは有効です。
本オプションは、状態表示の更新頻度を指定します。
refreshtime は、更新間隔を秒単位で指定し、正整数を指定可能です。
デフォルト (そして最小更新間隔) は 1 です。
.TP
.B \-v
冗長モードで起動します。より多くのデバッグ情報を表示します。
.SH 概要
\fBipfstat\fP の役割は、現在のカーネルの統計を表示することです。
この統計は、カーネルに出入りするパケットにいくつかのフィルタが
(存在する場合には) 適切に適用される結果として集められたものです。
これは、コマンドラインパラメータが指定されていない時のデフォルトの
動作です。
.PP
このコマンドは \fB\-i\fP か \fB\-o\fP とともに与えられた時は、
その時点でインストールされカーネルに使用されている
適切なフィルタルールリストを、
取り出して表示するでしょう。
.SH 関連ファイル
/dev/kmem
.br
/dev/ipl
.br
/dev/ipstate
.br
/kernel
.SH 関連項目
ipf(8)
.SH バグ
知られていません。
