freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ipfs.8
.\" $FreeBSD$
.TH IPFS 8
.SH 名称
ipfs \- NAT と状態テーブルのための情報を保存/復旧する
.SH 書式
.B ipfs
[-nv] -l
.PP
.B ipfs
[-nv] -u
.PP
.B ipfs
[-nv] [
.B \-d
<\fIdirname\fP>
] -R
.PP
.B ipfs
[-nv] [
.B \-d
<\fIdirname\fP>
] -W
.PP
.B ipfs
[-nNSv] [
.B \-f
<\fIfilename\fP>
] -r
.PP
.B ipfs
[-nNSv] [
.B \-f
<\fIfilename\fP>
] -w
.PP
.B ipfs
[-nNSv]
.B \-f
<\fIfilename\fP>
.B \-i
<if1>,<if2>
.SH 解説
.PP
\fBipfs\fP は、
\fIkeep state\fP を使って
NAT エントリのために作られた状態情報とルールを、
ロックして (変更をされることを避けて)、ディスクに保存します。
これにより、システムがリブートしても、
その後にこの情報を復旧すれば、結果として接続は維持されます。
.SH オプション
.TP
.B \-d
.B \-R
と
.B \-W
オプションで状態情報を保存するデフォルトの
ディレクトリを変更します。
.TP
.B \-n
カーネル内またはディスク上に保存された情報に影響する可能性のある
処理を実際には実行しません。
.TP
.B \-v
処理内容の説明を饒舌に行います。
.TP
.B \-N
NAT 情報を処理します。
.TP
.B \-S
フィルタ状態情報を処理します。
.TP
.B \-u
カーネル内の状態テーブルのロックを解除します。
.TP
.B \-l
カーネル内の状態テーブルをロックします。
.TP
.B \-r
指定されたファイルから情報を読んでカーネルにロードします。
状態テーブルがロックされている必要があり、終了後もロック状態を変更しません。
.TP
.B \-w
カーネルから情報を読んで指定されたファイルに書き込みます。
状態テーブルがロックされている必要があり、終了後もロック状態を変更しません。
.TP
.B \-R
保存された状態情報があれば、
\fIipstate.ipf\fP と \fIipnat.ipf\fP から読み込み
すべて復旧します。
これらのファイルは、
.B \-d
オプションが指定されていない場合、
\fI/var/db/ipf\fP ディレクトリから読まれます。
状態テーブルはこの処理の最初にロックされ、
終了後、ロックは解除されます。
.TP
.B \-W
カーネル内に状態情報があれば、
\fIipstate.ipf\fP と \fIipnat.ipf\fP に保存します。
これらのファイルは、
.B \-d
オプションが指定されていない場合、
\fI/var/db/ipf\fP ディレクトリに書かれます。
状態テーブルはこの処理の最初にロックされ、
終了後、ロックは解除されます。
.DT
.SH 関連ファイル
/var/db/ipf/ipstate.ipf
.br
/var/db/ipf/ipnat.ipf
.br
/dev/ipl
.br
/dev/ipstate
.br
/dev/ipnat
.SH 関連項目
ipf(8), ipl(4), ipmon(8), ipnat(8)
.SH 診断
.PP
-W と -R 処理は、ロックをセットしても解除するべきでないかもしれません。
以前の状態に戻すべきでしょう。
いまのところフラグメントテーブル情報は保存されません。
.SH バグ
.PP
もし見つけたら darrenr@pobox.com 宛に電子メールを送ってください。
