freebsd/freebsd-doc/ja_JP.eucJP/man/man8/IPXrouted.8
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Copyright (c) 1995 John Hay.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/IPXrouted/IPXrouted.8,v 1.8 2000/03/01 14:07:47 sheldonh Exp %
.\"
.\" jpman %Id: IPXrouted.8,v 1.3 1997/07/27 13:00:54 horikawa Stab %
.\"
.Dd Oct 11, 1995
.Dt IPXROUTED 8
.Os FreeBSD
.Sh 名称
.Nm IPXrouted
.Nd IPX Routing Information Protocol デーモン
.Sh 書式
.Nm IPXrouted
.Op Fl N
.Op Fl q
.Op Fl s
.Op Fl S
.Op Fl t
.Op Ar logfile
.Sh 解説
.Nm
は IPX 経路テーブルを扱うために、ブート時に起動されます。
IPX 経路デーモンは、カーネルの経路テーブルエントリを最新に
保つために Novell の IPX Routing Information Protocol を用います。
.Pp
使用可能なオプション:
.Bl -tag -width logfile
.It Fl N
GetNearestServer SAP 要求に対して応答しません。
.It Fl q
(下記の
.Fl s
オプションとは反対に) 経路情報を提供しません。
.It Fl s
ネットワークをつなぐルータであるないにかかわらず、
.Nm
が強制的に経路情報を提供するようにします。
.It Fl S
Service Advertizing Protocol
.Nm (SAP)
情報を提供しません。デフォルトでは
.Nm SAP
情報を提供します。
.It Fl t
送信・受信されたすべてのパケットを標準出力に表示します。
加えて、
.Nm
は制御端末から切り離されないので、キーボードからの
割り込みはプロセスを kill することになります。
.It Ar logfile
.Nm IPXrouted
の
行動が記録されるファイル名を指定します。
このログには、経路テーブルのすべての変更についての情報や、 
経路の変更に関わる最近の送受信メッセージの履歴が記録されます。
.El
.Pp
通常、
.Nm
は経路情報パケットを listen します。
ホストが複数の IPX ネットワークに接続されている場合には、
直接接続されているホストやネットワークすべてに経路テーブルの
コピーを定期的に提供します。
.Pp
.Nm
が起動されると、
.Dv SIOCGIFCONF
.Xr ioctl 2
を用いて、システムに組み込まれ、
.Dq up
となっているインタフェースを探します
(ソフトウェアループバックインタフェースは無視されます)。
インタフェースが複数ある場合には、そのホストがネットワーク間で
パケットを転送するとみなします。
そして
.Nm
は各インタフェースに
.Em リクエスト
パケットを送信し(インタフェースがサポートしていれば 
ブロードキャストパケットを用います)、他のホストから
.Em リクエスト
と
.Em レスポンス
のパケットが来るのを listen し続けます。
.Pp
.Em リクエスト
パケットを受け取ると、内部のテーブルに基づく情報から返答パケットを
作成します。
作成された
.Em レスポンス
パケットは既知の経路の一覧を含み、各々は
.Dq hop count
metric を持っています(16 以上の count は
.Dq 無限大
(到達不可能)
を示します)。
返答された各々の経路に関する metric は、送信元からの
.Em "相対的な" 
metric を提供します。
.Pp
以下の条件を一つでも満たす場合、
.Nm
が受け取った
.Em レスポンス
パケットは経路テーブルの更新に使われます:
.Bl -bullet
.It
宛先となるネットワークやホストへの経路テーブルエントリが
存在せず、 metric が宛先が到達可能であるとしている
(hop count が無限大でない)とき。
.It
パケットの送信元ホストが、保持している経路テーブルエントリ内の
ルータと同じであるとき。
すなわち更新された情報が、
宛先へのパケットが経由するネットワーク間ルータからもたらされたとき。
.It
経路テーブル内に存在するエントリがしばらくの間(定義では 90 秒)
更新されず、その経路が現在の経路と少なくとも同じ程度効率的であるとき。
.It
現在経路テーブル内に保持しているものよりも、新しい経路のほうが短いとき。
この判断にはテーブル内の経路の metric と新しい経路の metric が
比較されます。
.El
.Pp
更新が受け入れられた場合、
.Nm
は変更を内部テーブルに記録し、
.Em レスポンス
パケットをすべての直接つながったホストとネットワークに流します。
.Xr routed 8
は、カーネルの経路テーブルを更新する前に、不安定な状態から
抜け出せるようにするために、しばらくの間(30 秒以内)待ちます。
.Pp
.Nm
は入ってくるパケットを処理するだけではなく、経路テーブル
エントリを定期的にチェックします。
エントリが 3 分間更新されなかった場合、エントリの metric は 
無限大に設定され、削除予定の印がつけられます。
実際の削除は、エントリの無効化が他のルータに伝わるのを確実に
するために、さらに 60 秒後に行われます。
.Pp
ネットワークをつなぐルータとなっているホストは、 30 秒ごとに
直接つながったすべてのホストとネットワークに自分の 
経路テーブルを提供します。
.Pp
.Nm
が SIGINFO シグナルを受け取った場合、RIP と SAP テーブルの
現在の内容がファイル /var/log/ipxrouted.dmp に追加されます。
.Sh 関連項目
.Xr ipx 3
.Sh 歴史
