freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdnmonitor.8
.\"
.\" Copyright (c) 1999 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: isdnmonitor.8,v 1.13 2004-09-24 05:47:39 metal Exp $
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdnmonitor/isdnmonitor.8,v 1.17 2004/07/02 23:12:44 ru Exp %
.\"
.\"	last edit-date: [Mon Dec 13 23:04:25 1999]
.\" $FreeBSD$
.\"
.Dd September 25, 1999
.Dt ISDNMONITOR 8
.Os
.Sh 名称
.Nm isdnmonitor
.Nd isdn4bsd / isdnd リモート監視ツール
.Sh 書式
.Nm
.Op Fl c
.Op Fl d Ar debuglevel
.Op Fl f Ar filename
.Op Fl h Ar hostspec
.Op Fl l Ar pathname
.Op Fl p Ar portspec
.Sh 解説
.Nm
ユーティリティは、
isdn4bsd パッケージがサポートする ISDN デバイスのすべての
ISDN 関連の接続や切断を管理する ISDN デーモン
.Xr isdnd 8
をリモートで監視するために用いられます。
.Pp
オプションは以下の通りです:
.Bl -tag -width Ds
.It Fl c
(curses の) 全画面モードでの操作に切り替わります。
このモードでは
.Nm
は
.Xr isdnd 8
の全画面モードとほぼ同じように振る舞います。
全画面モードでは、制御文字
.Em Control-L
を入力すると表示が更新され、
.Em 復帰文字 (Carriage-Return)
または
.Em Enter
でコマンドウィンドウを表示します。
.Nm
は、コマンドウィンドウが開いている間はメッセージを受け付けないので、
5 秒間どのコマンドキーも押されなければ、このコマンドウィンドウは自動的
に閉じます。
.Pp
コマンドウィンドウが開いている時は、
.Em タブ
か
.Em スペース
で次のメニュー項目へ進みます。
コマンドを実行するには、ハイライト表示されたメニュー項目に対し
.Em Return
か
.Em Enter
を入力するか、実行する項目に対応する数字を入力するか、メニュー項目記述
の大文字を入力してください。
.It Fl d
.Nm
をデバッグ機能つきでコンパイルしているとき、このオプションはデバッグレ
ベルを指定します。
.\" デバッグレベルは以下の値の和です:
.\" .Pp
.\" .Bl -tag -width Ds -compact -offset indent
.\" .It Ar 0x001
.\" 一般的なデバッグ。
.\" .It Ar 0x002
.\" 速度計算。
.\" .It Ar 0x004
.\" タイミング計算。
.\" .It Ar 0x008
.\" 状態遷移。
.\" .It Ar 0x010
.\" 再試行処理。
.\" .It Ar 0x020
.\" ダイヤル。
.\" .It Ar 0x040
.\" プロセス処理。
.\" .It Ar 0x080
.\" isdn4bsd カーネルの入出力呼び出し。
.\" .It Ar 0x100
.\" コントローラとチャネルのビジー / フリーメッセージ。
.\" .It Ar 0x200
.\" 設定ファイル isdnmonitor.rc の処理。
.\" .El
.\" .Pp
.\" この値の設定に際して、
.\" .Xr sscanf 3
.\" ライブラリルーチンがサポートする基数のどれでも使用できます。
.Pp
さらに、このオプションでは引数として文字「n」を与えて、
全画面表示にデバッグメッセージを表示させないようにもできます。
.Pp
.It Fl f
このオプションが指定されると
.Nm
は通常の出力とデバッグ - が有効な場合 - 出力を引数で指定されたファイル
に書き出します。
.It Fl l
.Xr isdnd 8
と
.Nm
の間の通信に使う UNIX ドメインのソケット名を指定します。
.It Fl h
監視すべき
.Xr isdnd 8
が動いているマシンのホスト名かドット表記の IP アドレスを指定します。
.It Fl p
.Fl h
オプションと共に用いられ、リモートのポート番号を指定します。
.El
.Sh 環境変数
次の環境変数が
.Nm
の実行に影響します:
.Bl -tag -width Ds
.It Ev TERM
全画面表示モードで実行するときの端末タイプです。
より詳しくは
.Xr environ 7
を参照してください。
.El
.Sh 使用例
最初に試すときは、ローカルで動いている isdnd を監視するためには、
次のコマンドで
.Nm
を実行してください:
.Bd -literal -offset indent
isdnmonitor -h localhost
.Ed
.Sh 診断
終了ステータスは成功時には 0、エラー時には 1 です。
.Sh 関連項目
.Xr isdnd 8
.Sh バグ
まだ 1 つ (以上) 残っているでしょう。
.Sh 作者
.An -nosplit
この
.Nm
ユーティリティは
.An Martin Husemann
と
.An Hellmuth Michaelis Aq hm@kts.org
が作成しました。
本マニュアルページは
.An Hellmuth Michaelis
が作成しました。
