freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdndebug.8
.\"
.\" Copyright (c) 1997, 2000 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: isdndebug.8,v 1.15 2003-10-13 02:42:27 horikawa Exp $
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdndebug/isdndebug.8,v 1.17 2003/09/14 13:41:58 ru Exp %
.\"
.\"	last edit-date: [Wed May 31 10:15:07 2000]
.\"
.\" $FreeBSD$
.Dd May 29, 1999
.Dt ISDNDEBUG 8
.Os
.Sh 名称
.Nm isdndebug
.Nd isdn4bsd カーネル変数と統計情報の表示と制御
.Sh 書式
.Nm
.Op Fl c
.Op Fl e
.Op Fl g
.Op Fl l Ar layer
.Op Fl m
.Op Fl q
.Op Fl r
.Op Fl s Ar value
.Op Fl u Ar unit
.Op Fl z
.Op Fl C
.Op Fl Q
.Sh 解説
.Nm
ユーティリティは isdn4bsd パッケージの一部であり、
isdn4bsd カーネル部分のデバッグ出力レベルを制御するのに使われます。
isdn4bsd カーネルの各レイヤは、
本ユーティリティを用いて操作できるデバッグマスクを使います。
.Pp
.Nm
の第 2 の用途はチップセット固有のエラーカウンタの表示とリセットと、
D チャネルレイヤ 2 (Q.921 LAPD プロトコル) の統計情報とエラーカウンタの
表示とリセットです。
.Pp
次のオプションが利用可能です:
.Bl -tag -width Ds
.It Fl c
チップセット固有の統計情報やエラーカウンタを表示します。
.It Fl e
選択したレイヤのデバッグマスクを、エラーのみ表示するように設定します。
.It Fl g
選択したレイヤのデバッグマスクを取得します。
.It Fl l
コマンドを適用するレイヤを指定します。
デフォルトではすべてのレイヤに適用します。
.It Fl m
選択したレイヤのデバッグマスクを、
起こりうるデバッグメッセージすべてを表示するように設定します (最大の出力)。
.It Fl q
Q.921 (D チャネルレイヤ 2) フレームの受信/送信の統計情報を表示します。
.It Fl r
選択したレイヤのデバッグマスクを
コンパイル時のデフォルトに設定します (リセット)。
.It Fl s
選択したレイヤのデバッグマスクを value に設定します。value には
.Xr sscanf 3
がサポートする基数のいずれでも指定できます。
.It Fl u
フラグ -c, -q, -C, -Q の単位量を設定します。
.It Fl z
選択したレイヤのデバッグマスクを、何も出力しないように設定します (0)。
.It Fl H
チップセット固有の統計情報およびエラーカウンタを 0 にリセットします。
.It Fl Q
Q.921 (D チャネルレイヤ 2) フレームの受信/送信の統計情報を、
0 にリセットします。
.El
.Sh 関連ファイル
/dev/i4bctl
.Sh 使用例
コマンド:
.Bd -literal -offset indent
isdndebug -g
.Ed
.Pp
は、すべての ISDN レイヤの現在のデバッグレベルを表示します。
.Sh 作者
.Nm
ユーティリティと本マニュアルページは
.An Hellmuth Michaelis Aq hm@kts.org
が作成しました。
