freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdndebug.8
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdndebug/isdndebug.8,v 1.1.2.2 1999/08/29 15:41:52 peter Exp %
.\"
.\"	last edit-date: [Sat Dec  5 18:13:34 1998]
.\"
.\"	-hm	writing manual pages
.\"	-hm	getting uptodate
.\"
.\"
.\" jpman %Id: isdndebug.8,v 1.3 1999/02/06 15:30:25 horikawa Stab %
.Dd July 9, 1998
.Dt isdndebug 8
.Sh 名称
.Nm isdndebug
.Nd isdn4bsd カーネル内部のデバッグ操作を制御する
.Sh 書式
.Nm
.Op Fl e
.Op Fl g
.Op Fl h
.Op Fl l Ar layer
.Op Fl m
.Op Fl r
.Op Fl s Ar value
.Op Fl u Ar unit
.Op Fl z
.Op Fl H
.Sh 解説
.Nm isdndebug
は isdn4bsd パッケージの一部であり、
isdn4bsd カーネル部分のデバッグ出力を制御するのに使われます。
isdn4bsd カーネルの各レイヤは、
本ユーティリティを用いて操作できるデバッグマスクを使います。
.Pp
.Nm
の第 2 の用途は HSCX エラーカウンタの表示とリセットです。
.Pp
次のオプションが利用可能です:
.Bl -tag -width Ds
.It Fl e
選択したレイヤのデバッグマスクを、エラーのみ表示するように設定します。
.It Fl g
選択したレイヤのデバッグマスクを取得します。
.It Fl h
HSCX エラーカウンタを表示します。
.It Fl l
コマンドを適用するレイヤを指定します。
デフォルトではすべてのレイヤに適用します。
.It Fl m
選択したレイヤのデバッグマスクを、
起こりうるデバッグメッセージすべてを表示するように設定します (最大の出力)。
.It Fl r
選択したレイヤのデバッグマスクを
コンパイル時のデフォルトに設定します (リセット)。
.It Fl s
選択したレイヤのデバッグマスクを value に設定します。value には
.Xr sscanf 3
がサポートする基数のいずれでも指定できます。
.It Fl u
フラグ -h と -H の単位量を設定します。
.It Fl z
選択したレイヤのデバッグマスクを、何も出力しないように設定します (ゼロ)。
.It Fl H
HSCX エラーカウンタを 0 にリセットします。
.Pp
.Sh 関連ファイル
/dev/i4bctl
.Sh 使用例
コマンド:
.Bd -literal -offset indent
isdndebug -g
.Ed
.Pp
は、すべての ISDN レイヤの現在のデバッグレベルを表示します。
.Sh 作者
.Nm
ユーティリティと本マニュアルページは
.An Hellmuth Michaelis Aq hm@kts.org
が作成しました。
