freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdntelctl.8
.\"
.\" Copyright (c) 1997, 1998 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdntelctl/isdntelctl.8,v 1.1.2.1 1999/08/29 15:42:12 peter Exp %
.\" jpman %Id: isdntelctl.8,v 1.3 1999/02/07 01:48:07 yohta Stab %
.\" WORD: sound format	音の形式 [isdntelctl.8]
.\"
.\"	last edit-date: [Mon Dec 14 11:34:51 1998]
.\"
.Dd December 14, 1998
.Dt isdntelctl 8
.Sh 名称
.Nm isdntelctl
.Nd isdn4bsd 電話の音の形式変換を制御する
.Sh 書式
.Nm
.Op Fl c
.Op Fl g
.Op Fl u Ar unit
.Op Fl A
.Op Fl U
.Sh 解説
.Nm isdntelctl
は isdn4bsd パッケージの一部であり、/dev/i4btel インタフェースの持つ
音の形式を変換する機能を設定するために使用します。
.Pp
次のオプションが利用可能です:
.Bl -tag -width Ds
.It Fl c
電話入力キューを空にします。
.It Fl g
現在使われている音の形式を取得します。
.It Fl u
/dev/i4btel のユニット番号を設定します。
デフォルト値は 0 で、デバイス
/dev/i4btel0
にアクセスします。
.It Fl A
音の形式を A-Law に設定します。
.It Fl U
音の形式を u-Law に設定します。
.Pp
.Sh 関連ファイル
/dev/i4btel<n>

.Sh 規格
A-Law および u-Law は ITU Recommendation G.711 に示されています。

.Sh 使用例
コマンド:
.Bd -literal -offset indent
isdntelctl -g
.Ed
.Pp
は、デバイス /dev/i4btel0 にて現在使われている音の形式を表示します。

.Sh 作者
.Nm
ユーティリティと本マニュアルページは Hellmuth Michaelis が作成しました。
彼の連絡先は hm@kts.org です。
