freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdndecode.8
.\"
.\" Copyright (c) 1998, 2000 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: isdndecode.8,v 1.14 2004-09-24 05:47:39 metal Exp $
.\"
.\"	last edit-date: [Mon Feb 21 16:15:09 2000]
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdndecode/isdndecode.8,v 1.16 2004/07/02 23:12:43 ru Exp %
.\"
.\" $FreeBSD$
.\" isdndecode.8 と isdntrace.8 は共通部分が多いため、相互に参照
.\" すると便利です。
.Dd February 21, 2000
.Dt ISDNDECODE 8
.Os
.Sh 名称
.Nm isdndecode
.Nd isdn4bsd ISDN プロトコルデコードユーティリティ
.Sh 書式
.Nm
.Op Fl a
.Op Fl b
.Op Fl d
.Op Fl f Ar filename
.Op Fl h
.Op Fl i
.Op Fl l
.Op Fl o
.Op Fl p Ar filename
.Op Fl u Ar number
.Op Fl x
.Op Fl B
.Op Fl P
.Op Fl R Ar unit
.Op Fl T Ar unit
.Sh 解説
.Nm
ユーティリティは isdn4bsd パッケージの一部であり、
D チャネル上のレイヤ 1, 2, 3 のプロトコルアクティビティの
詳細なニーモニック表記と、
B チャネルアクティビティの 16 進数ダンプを、
ユーザに提供するために使用されます。
.Pp
受動動作がサポートされているカード 2 枚および
容易に作成可能なケーブルと共に本ユーティリティを使用することにより、
S0 バス上のトラフィックを完全に監視して、
S0 バスアナライザ機能を提供することもできます。
.Pp
.Nm
ユーティリティは、受動動作がサポートされているカードでのみ動作します。
.Pp
次のオプションを使用可能です:
.Bl -tag -width Ds
.It Fl a
2 枚の受動カードとカスタムケーブルを使用して、
.Nm
をアナライズモードで動作させます。
カスタムケーブルは、isdn4bsd ソース配布物中のファイル
.Em cable.txt
に記述されている方法で作成可能です。
片方のカードが S0 バスの送信方向におけるレシーバとして動作し、
もう片方のカードが S0 バスの受信方向におけるレシーバとして動作します。
この設定により、完全なトラフィック監視が可能となります。
.It Fl b
B チャネルのトレースをオンにします (デフォルトではオフです)。
.It Fl d
D チャネルのトレースをオフにします (デフォルトではオンです)。
.It Fl f
トレース出力を書き込むファイル名として
.Ar filename
を使用します
(デフォルトのファイル名は isdndecode<n> であり、
n はデコードに使用するユニット番号です)。
.It Fl h
ヘッダ表示をオフにします (デフォルトではオンです)。
.It Fl i
レイヤ 1 アクティビティを監視するために、
レイヤ 1 (I.430) INFO シグナルを表示します (デフォルトではオフです)。
.It Fl l
レイヤ 2 (Q.921) フレームの表示をオフにします (デフォルトではオンです)。
.It Fl o
デコード出力のファイルへの書き込みをオフにします (デフォルトではオンです)。
.It Fl p
オプション -B および -P で使用するファイル名として
.Ar filename
を使用します
(デフォルトのファイル名は isdntracebin<n> であり、
n はデコードに使用するユニット番号です)。
.It Fl u
デコードに使用するコントローラカードのユニット番号として、
.Ar number
を使用します
(デフォルトでは 0 です)。
.It Fl x
未知のプロトコル選択値を持つレイヤ 3 パケットをデコードします。
.It Fl B
後でアナライズするためまたは遠隔アナライズするために、
デコード前のバイナリデコードデータをファイルに書き込みます
(デフォルトではオフです)。
.It Fl P
デバイスからではなく、ファイルから、デコード前のバイナリデコードデータを
読み込みます (デフォルトではオフです)。
.It Fl R
アナライズモードにおいて、受信インタフェースユニット番号として、
.Ar unit
を使用します。
.It Fl T
アナライズモードにおいて、送信インタフェースユニット番号として、
.Ar unit
を使用します。
.El
.Pp
USR1 シグナルが
.Nm
プロセスに送信されると、
現在使用されているログファイルが再オープンされますので、
ログファイルの回転を行うことができます。
.Pp
デコード出力は明確なはずです。
ISDN プロトコルトレース時に、
次の標準的なテキストを持っていると非常に便利でしょう:
.Pp
.Bl -tag -width Ds -compact -offset indent
.It Ar I.430
ISDN BRI レイヤ 1 プロトコルの記述。
.It Ar Q.921
ISDN D チャネルレイヤ 2 プロトコルの記述。
.It Ar Q.931
ISDN D チャネルレイヤ 3 プロトコルの記述。
.El
.Sh 関連ファイル
.Bl -tag -width daddeldi -compact
.It Pa /dev/i4btrc<n>
ISDN カードユニット <n> のデコードメッセージを
カーネルから取り出すために使用するデバイスファイル。
.El
.Sh 使用例
コマンド:
.Bd -literal -offset indent
isdndecode -f /var/tmp/isdn.decode
.Ed
.Pp
は、D チャネルのトレースを受動コントローラ 0 上で開始します。
この際、B チャネルのトレース以外はすべて有効にされ、
すべては出力ファイル /var/tmp/isdn.decode へ書き込まれます。
.Sh 関連項目
.Xr isdnd 8
.Sh バグ
まだ 1 個残っています。
.Sh 規格
ITU Recommendations I.430, Q.920, Q.921, Q.930, Q.931
.Pp
ITU Recommendation Q.932 (03/93), Q.950 (03/93)
.Pp
ETSI Recommendation ETS 300 179 (10/92), ETS 300 180 (10/92)
.Pp
ETSI Recommendation ETS 300 181 (04/93), ETS 300 182 (04/93)
.Pp
ITU Recommendation X.208, X.209
.Sh 作者
.Nm
ユーティリティと本マニュアルページは
.An Hellmuth Michaelis Aq hm@kts.org
が書きました。
