freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdntel.8
.\"
.\" Copyright (c) 1997, 1999 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	last edit-date: [Mon Dec 13 23:05:59 1999]
.\"	
.\" %FreeBSD: src/usr.sbin/i4b/isdntel/isdntel.8,v 1.9.2.2 2000/12/27 16:23:10 ru Exp %
.\"
.\"	%Id: isdntel.8,v 1.9 1999/12/13 22:11:55 hm Exp %
.\"
.\" $FreeBSD$
.\" WORD: answering machine	留守番マシン [isdntel.8]
.\" "
.Dd July 11, 1998
.Dt ISDNTEL 8
.Os
.Sh 名称
.Nm isdntel
.Nd isdn4bsd 電話応答管理ユーティリティ
.Sh 書式
.Nm
.Op Fl a Ar aliasfile
.Op Fl d Ar spooldir
.Op Fl p Ar playcommand
.Op Fl t Ar timeout
.Sh 解説
.Nm
は着信した電話音声メッセージに対し、
「留守番マシン」としての機能を提供するのに使用されます。
.Pp
次のオプションがサポートされています:
.Bl -tag -width Ds
.It Fl a
電話番号のエイリアスを含むエイリアスファイルのパス名として、
.Ar aliasfile
を用います。デフォルトのパスは
.Em /etc/isdn/isdntel.alias
です。
エイリアス項目の書式は、数字列に 1 個以上のスペースかタブが続いたもので、
行の残りがエイリアス文字列と見なされます。
空白文字、タブ、または「#」文字で開始される行はコメントになります。
.It Fl d
.Xr isdnd 8
が呼び出す "answ" スクリプトによって着信した音声メッセージ
が格納されるディレクトリとして、
.Ar spooldir
を用います。
デフォルトのディレクトリは
.Em /var/isdn
です。
音声メッセージファイル名の形式は次の通りです:
.Pp
.Dl YYMMDDhhmmss-dest_number-source_number-length_in_secs
.Dl "(訳注: 年月日時分秒-着信番号-発信番号-秒数)"
.It Fl p
音声メッセージをオーディオ出力装置へ再生させるために実行する
コマンド文字列として、
.Ar playcommand
を用います。
文字
.Em %s
は現在選択されているファイル名に置き換えられます。
デフォルトの文字列は
.Dq Li cat %s \&| alaw2ulaw >/dev/audio
です。
.It Fl t
キーボードからの操作が無い時に、
プログラムにスプールディレクトリを読み直させる秒数を
.Ar timeout
で指定します。
.El
.Pp
画面出力は明確なはずです。もし不明なことがあればソースを調べて下さい。
.Sh 関連項目
.Xr isdnd 8 ,
.Xr isdnd.rc 5 ,
.Xr i4btel 4
.Sh バグ
まだ 2 つ以上残っています。
.Sh 作者
.Nm
ユーティリティと本マニュアルページは
.An Hellmuth Michaelis Aq hm@kts.org
が作成しました。
