freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdnphone.8
.\"
.\" Copyright (c) 1999, 2002 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdnphone/isdnphone.8,v 1.9 2002/08/27 14:46:22 hm Exp %
.\"
+.\"	last edit-date: [Tue Aug 27 16:42:12 2002]
.\"
.\"
.\" $FreeBSD$
.Dd August 27, 2002
.Dt ISDNPHONE 8
.Os
.Sh 名称
.Nm isdnphone
.Nd isdn4bsd での電話ダイヤル等
.Sh 書式
.Nm
.Op Fl d
.Op Fl h
.Op Fl k Ar string
.Op Fl n Ar number
.Op Fl u Ar unit
.Op Fl v
.Op Fl w
.Sh 解説
.Nm
は isdn4bsd パッケージの一部あり、電話制御インタフェース
.Pa /dev/i4bteld Ns Aq Ar n
のダイヤルとハングアップを扱います。
.Pp
コマンドラインパラメータを使用してダイヤルアウトとハングアップをするために、
オプションが提供されています。
これらのオプションを指定しない場合、
curses ベースの全画面インタフェースを起動します。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Fl d
デバッグメッセージ表示を有効にします。
.It Fl h
指定したインタフェースにおいて、
開いているかもしれない電話接続をハングアップします。
.It Fl k
指定された文字列を、キーパッドファシリティ情報要素と共に、送ります。
.It Fl n
選択されたインタフェースにおいて、指定した番号に対してダイヤルします。
.It Fl u
使用するインタフェースを指定するために、ユニット番号を設定します。
.It Fl v
ダイヤルの結果メッセージを冗長にします (-n および -w)
.It Fl w
(-n オプションを使用した) ダイヤル後、最初の結果メッセージを待ちます。
.El
.Sh 関連ファイル
.Bl -tag -width indent -compact
.It Pa /dev/i4bteld Ns Aq Ar n
.El
.Sh 使用例
コマンド
.Dl "isdnphone -n 1234"
.Pp
は、
.Pa /dev/i4btel0
で呼を確立するために、番号 1234 へダイヤルします。
.Sh 作者
.Nm
ユーティリティとこのマニュアルページは、
.An Hellmuth Michaelis Aq hm@FreeBSD.org
が記述しました。
