freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdntrace.8
.\"
.\" Copyright (c) 1997, 2000 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: isdntrace.8,v 1.13 2003-03-10 00:02:03 horikawa Exp $
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdntrace/isdntrace.8,v 1.19 2002/12/27 12:15:37 schweikh Exp %
.\"
.\"	last edit-date: [Wed Nov  1 15:52:28 2000]
.\"
.\" $FreeBSD$
.\" isdndecode.8 と isdntrace.8 は共通部分が多いため、相互に参照
.\" すると便利です。
.Dd October 19, 1998
.Dt ISDNTRACE 8
.Os
.Sh 名称
.Nm isdntrace
.Nd isdn4bsd ISDN プロトコルトレースユーティリティ
.Sh 書式
.Nm
.Op Fl a
.Op Fl b
.Op Fl d
.Op Fl f Ar filename
.Op Fl h
.Op Fl i
.Op Fl l
.Op Fl n Ar number
.Op Fl o
.Op Fl p Ar filename
.Op Fl r
.Op Fl u Ar number
.Op Fl x
.Op Fl B
.Op Fl F
.Op Fl P
.Op Fl R Ar unit
.Op Fl T Ar unit
.Sh 解説
.Nm
ユーティリティは isdn4bsd パッケージの一部であり、
D チャネル上のレイヤ 1, 2, 3 のプロトコルアクティビティのニーモニック表記と、
B チャネルアクティビティの 16 進数ダンプを、
ユーザに提供するために使用されます。
.Pp
受動動作がサポートされているカード 2 枚および
容易に作成可能なケーブルと共に本ユーティリティを使用することにより、
S0 バス上のトラフィックを完全に監視して、
S0 バスアナライザ機能を提供することもできます。
.Pp
.Nm
ユーティリティは、受動動作がサポートされているカードでのみ動作します。
.Pp
.Em 注
.Pp
すべてのファイルは、ユーザが指定してもデフォルトであっても、
タイムスタンプ文字列が -yyyymmdd-hhmmss の形式で追加されます。
この形式は、ハイフン、4 桁の年、2 桁の月と日、ハイフン、
2 桁の時間と分と秒です。
トレースファイルは上書きされることはありません。
1 秒以内に新規ファイルが必要な場合、ファイル名生成機構は 1 秒間眠ります。
.Pp
プログラムが USR1 シグナルを送られた場合、
ユーザが指定した新規ファイルまたはデフォルトのファイル名に、
新規の日付とタイムスタンプを付けたものが、生成されてオープンされます。
.Pp
次のオプションを使用可能です:
.Bl -tag -width Ds
.It Fl a
2 枚の受動カードとカスタムケーブルを使用して、
.Nm
をアナライズモードで動作させます。
カスタムケーブルは、isdn4bsd ソース配布物中のファイル
.Em cable.txt
に記述されている方法で作成可能です。
片方のカードが S0 バスの送信方向におけるレシーバとして動作し、
もう片方のカードが S0 バスの受信方向におけるレシーバとして動作します。
この設定により、完全なトラフィック監視が可能となります。
.It Fl b
B チャネルのトレースをオンにします (デフォルトではオフです)。
.It Fl d
D チャネルのトレースをオフにします (デフォルトではオンです)。
.It Fl f
トレース出力を書き込むファイル名として
.Ar filename
を使用します
(デフォルトのファイル名は isdntrace<n> であり、
n はトレースに使用するユニット番号です)。
.It Fl h
ヘッダ表示をオフにします (デフォルトではオンです)。
.It Fl i
レイヤ 1 アクティビティを監視するために、
レイヤ 1 (I.430) INFO シグナルを表示します (デフォルトではオフです)。
.It Fl l
レイヤ 2 (Q.921) フレームの表示をオフにします (デフォルトではオンです)。
.It Fl n
本オプションは数値引数を取り、
表示されるフレームの最小フレームサイズをオクテットで指定します
(デフォルトは 0)。
.It Fl o
トレース出力のファイルへの書き込みをオフにします (デフォルトではオンです)。
.It Fl p
オプション -B および -P で使用するファイル名として
.Ar filename
を使用します
(デフォルトのファイル名は isdntracebin<n> であり、
n はトレースに使用するユニット番号です)。
.It Fl r
パケットの生の 16 進数ダンプを、
デコードされたプロトコル情報の前に表示することを、オフにします
(デフォルトではオンです)。
.It Fl u
トレースに使用するコントローラカードのユニット番号として、
.Ar number
を使用します
(デフォルトでは 0 です)。
.It Fl x
Q.931 プロトコル識別を持たないパケットの表示をオンにします
(デフォルトではオフです)。
.It Fl B
後でアナライズするためまたは遠隔アナライズするために、
デコード前のバイナリトレースデータをファイルに書き込みます
(デフォルトではオフです)。
.It Fl F
オプション -P (バイナリデータファイルの再生) が使用されたときだけ、
本オプションを使用可能です。
オプション -F を指定すると、ファイルが終了しても再生を終了せずに、
更なるデータが入力ファイルから利用できるようになるまで待つようにさせます。
.Pp
(ディスクスペースを節約するために)
トレースデータをバイナリ形式で収集しているときに、
監視機構もまた必要な場合に、本オプションが有用です
(デフォルトではオフです)。
.It Fl P
デバイスからではなく、ファイルから、デコード前のバイナリトレースデータを
読み込みます (デフォルトではオフです)。
.It Fl R
アナライズモードにおいて、受信インタフェースユニット番号として、
.Ar unit
を使用します。
.It Fl T
アナライズモードにおいて、送信インタフェースユニット番号として、
.Ar unit
を使用します。
.El
.Pp
USR1 シグナルが
.Nm
プロセスに送信されると、
現在使用されているログファイルが再オープンされますので、
ログファイルの回転を行うことができます。
.Pp
トレース出力は明確なはずです。
ISDN プロトコルトレース時に、
次の標準的なテキストを持っていると非常に便利でしょう:
.Pp
.Bl -tag -width Ds -compact -offset indent
.It Ar I.430
ISDN BRI レイヤ 1 プロトコルの記述。
.It Ar Q.921
ISDN D チャネルレイヤ 2 プロトコルの記述。
.It Ar Q.931
ISDN D チャネルレイヤ 3 プロトコルの記述。
.It Ar 1TR6
ドイツ固有の ISDN レイヤ 3 プロトコルの記述。
(注意: 1TR6 プロトコルのデコードが含まれていますが、サポートされていません。
なぜなら作者が 1TR6 ベースの ISDN 装置をもう持っていないためです。)
.El
.Pp
.Nm
ユーティリティは、プロトコル分別器 (Protocol Discriminator) を見て、
使用されているレイヤ 3 プロトコルを自動的に検出します
(Q.931/1993 pp. 53 参照)。
.Sh 関連ファイル
.Bl -tag -width daddeldi -compact
.It Pa /dev/i4btrc<n>
ISDN カードユニット <n> のトレースメッセージを
カーネルから取り出すために使用するデバイスファイル。
.El
.Sh 使用例
コマンド:
.Bd -literal -offset indent
isdntrace -f /var/tmp/isdn.trace
.Ed
.Pp
は、D チャネルのトレースを受動コントローラ 0 上で開始します。
この際、B チャネルのトレース以外はすべて有効にされ、
すべては出力ファイル
/var/tmp/isdn.trace-yyyymmdd-hhmmss
へ書き込まれます。
(yyyymmdd と hhmmss は現在の日付と時刻の値で置き換えられます)。
.Sh 関連項目
.Xr isdnd 8
.Sh バグ
まだ 1 個以上残っています。
.Sh 規格
ITU Recommendations I.430, Q.920, Q.921, Q.930, Q.931
.Pp
FTZ Richtlinie 1TR3, Band III
.Pp
ITU Recommendation Q.932 (03/93), Q.950 (03/93)
.Pp
ETSI Recommendation ETS 300 179 (10/92), ETS 300 180 (10/92)
.Pp
ETSI Recommendation ETS 300 181 (04/93), ETS 300 182 (04/93)
.Pp
ITU Recommendation X.208, X.209
.Sh 作者
.An -nosplit
.Nm
ユーティリティは
.An Gary Jennejohn Aq gj@FreeBSD.org
と
.An Hellmuth Michaelis Aq hm@FreeBSD.org
が書きました。
.Pp
本マニュアルページは
.An Hellmuth Michaelis
が書きました。
