freebsd/freebsd-doc/ja_JP.eucJP/man/man8/isdntelctl.8
.\"
.\" Copyright (c) 1997, 1999 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: isdntelctl.8,v 1.9 1999/12/13 22:11:55 hm Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/isdntelctl.8,v 1.7 2001/05/14 01:09:49 horikawa Exp $
.\" WORD: sound format	音の形式 [isdntelctl.8]
.\"
.\" %FreeBSD: src/usr.sbin/i4b/isdntelctl/isdntelctl.8,v 1.8.2.3 2001/07/22 12:41:01 dd Exp %
.\"
.\"	last edit-date: [Mon Dec 13 23:06:45 1999]
.\"
.Dd April 21, 1999
.Dt ISDNTELCTL 8
.Os
.Sh 名称
.Nm isdntelctl
.Nd isdn4bsd 電話の音の形式変換を制御する
.Sh 書式
.Nm
.Op Fl c
.Op Fl g
.Op Fl u Ar unit
.Op Fl A
.Op Fl U
.Op Fl N
.Sh 解説
.Nm
は isdn4bsd パッケージの一部であり、/dev/i4btel インタフェースの持つ
音の形式を変換する機能を設定するために使用します。
.Pp
次のオプションが利用可能です:
.Bl -tag -width Ds
.It Fl c
電話入力キューを空にします。
.It Fl g
現在使われている音の形式を取得します。
.It Fl u
/dev/i4btel のユニット番号を設定します。
デフォルト値は 0 で、デバイス
/dev/i4btel0
にアクセスします。
.It Fl A
A-law (ISDN 回線) から u-law (ユーザランド) への変換を行います。
.It Fl U
u-law (ISDN 回線) から A-law (ユーザランド) への変換を行います。
.It Fl N
音声変換において、書式変換無しに設定します。
.El
.Pp
回線からは、電話のデータストリームはビット反転書式で出力されますので、
どんな場合でも
.Xr i4btel 4
ドライバがビット反転処理を行います。
.Pp
更に、A-law から u-law へ、u-law から A-law へ、全く変換無しの、
i4btel ドライバのいずれかの変換動作を
.Nm
ユーティリティを使用して指定可能です。
.Sh 関連ファイル
/dev/i4btel<n>
.Sh 規格
A-Law および u-Law は ITU Recommendation G.711 に示されています。
.Sh 使用例
コマンド:
.Bd -literal -offset indent
isdntelctl -g
.Ed
.Pp
は、デバイス /dev/i4btel0 にて現在使われている音の形式を表示します。
.Sh 関連項目
.Xr i4btel 4 ,
.Xr g711conv 1 ,
.Xr isdnd 8 ,
.Xr isdnd.rc 5
.Sh 作者
.Nm
ユーティリティと本マニュアルページは
.An Hellmuth Michaelis Aq hm@kts.org
が作成しました。
