freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ispcvt.8
.\" Copyright (c) 1992, 1995 Hellmuth Michaelis
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Hellmuth Michaelis
.\" 4. The name authors may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" @(#)ispcvt.1, 3.20, Last Edit-Date: [Tue Apr  4 12:35:54 1995]
.\" %FreeBSD: src/usr.sbin/pcvt/ispcvt/ispcvt.8,v 1.9.2.2 2000/12/14 14:10:38 ru Exp %
.\"
.\" jpman %Id: ispcvt.8,v 1.3 1997/09/09 04:05:01 yugawa Stab %
.\"
.Dd April 4, 1995
.Dt ISPCVT 8
.Os FreeBSD
.Sh 名称
.Nm ispcvt
.Nd 現在のビデオドライバが pcvt ドライバか否かを確認する
.Sh 書式
.Nm
.Op Fl c
.Op Fl d Ar device
.Op Fl v
.Sh 解説
.Nm
は、カーネルに組み込まれた現在のビデオドライバが
pcvt ドライバか否かを確認する手段を提供します。
ドライバのメジャー及びマイナリリース番号も確認します。
さらに、
.Nm
は、現在実行中のカーネルに組み込まれたドライバをコンパイルした時の、
すべてのコンパイル時オプション
.Dq Ar PCVT_XXXXXX
を表示する事も可能です。
.Pp
オプションは以下の通りです:
.Bl -tag -width Ds
.It Fl d
チェックを行うデバイスを指定します。
.It Fl v
冗長に表示するよう指定します。
成功すると、名前とリビジョンを報告します。
失敗すると、どの比較に失敗したかを報告します。
.It Fl c
現在実行中のカーネルをコンパイルした時の、
.Dq Ar PCVT_XXXXXX
を #define した値を全て表示します。
.Fl v
と
.Fl c
を共に指定すると、コンパイル時オプションの冗長な一覧を表示します。
.Sh 診断
.Bl -tag -width Ds -compact
.Pp
.It Sy 0
ドライバは pcvt であり、メジャー及びマイナ番号が一致
.It Sy 1
open または ioctl システムコールに失敗
.It Sy 2
ドライバの名前が不一致
.It Sy 3
名称は一致、しかしリリースメジャー番号が不一致
.It Sy 4
名称とメジャー番号は一致、しかしマイナ番号が不一致
.It Sy 5
使用方法の誤り
.El
.Pp
.Sh バグ
既知のものは有りません。
.Sh 関連項目
.Xr pcvt 4
