freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kernbb.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/kernbb/kernbb.8,v 1.9.2.2 2000/12/14 12:18:10 ru Exp %
.\"
.\" jpman %Id: kernbb.8,v 1.3 1997/08/16 13:16:53 horikawa Stab %
.\"
.Dd May 22, 1995
.Dt KERNBB 8
.Os FreeBSD
.Sh 名称
.Nm kernbb
.Nd カーネルの基本ブロックプロファイルバッファのダンプを生成する
.Sh 書式
.Nm
.Sh 解説
.Nm
は、動作中のカーネルの基本ブロックプロファイリングバッファを
ダンプするのに用いられるツールです。
.Pp
動作中のカーネルにおいて、ソースファイルのうちの少なくとも 1 つは
.Fl a
オプション付きでコンパイルされている必要があります。
.Pp
出力形式は ASCII であり、1 行に 1 レコードずつ表示されます。
各レコードは以下のフィールドから成ります: ファイル名、行番号、
手続き名、アドレス、実行回数、基本ブロックのバイト数での長さ、
そして前の 2 つの欄の積です。
.Sh 関連ファイル
.Bl -tag -width /dev/kmemx -compact
.It Pa /kernel
デフォルトのシステム
.It Pa /dev/kmem
デフォルトのメモリ
.El
.Sh 関連項目
.Xr cc 1
.Sh 作者
.Nm 
コマンドは
.An Poul-Henning Kamp
がカーネルサポートとともに記述しました。
