freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kernbb.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/kernbb/kernbb.8,v 1.18 2003/02/24 22:53:25 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd May 22, 1995
.Dt KERNBB 8
.Os
.Sh 名称
.Nm kernbb
.Nd カーネルの基本ブロックプロファイルバッファのダンプを生成する
.Sh 書式
.Nm
.Sh 解説
.Nm
ユーティリティは、動作中のカーネルの基本ブロックプロファイリングバッファを、
.Xr gcov 1
ツールが使用するファイルへダンプするのに用いられます。
.Pp
動作中のカーネルにおいて、ソースファイルのうちの少なくとも 1 つは
.Fl Fl test-coverage
および
.Fl Fl profile-arcs
オプション付きでコンパイルされている必要があります。
.Pp
出力は、
.Xr gcc 1
がカーネル中に組み込んだファイル名に格納されます。
絶対パス名に対して書き込めない場合、
ファイル名のディレクトリ名部分が捨てられ、
カレントディレクトリにおいて、ファイル名のベース名にファイルが格納されます。
.Pp
出力ファイル名は
.Pa *.da
であり、
.Xr gcov 1
プログラムは数値を取り出してソースファイルとマージし、
実際の実行カウントを表示します。
.Sh 関連ファイル
.Bl -tag -width /boot/kernel/kernel -compact
.It Pa /boot/kernel/kernel
デフォルトのシステム
.It Pa /dev/kmem
デフォルトのメモリ
.El
.Sh 関連項目
.Xr cc 1 ,
.Xr gcov 1
.Sh 作者
.Nm
ユーティリティは
.An Poul-Henning Kamp
がカーネルサポートとともに記述しました。
.Sh バグ
このなかには、魔術や GCC の内部知識が盛沢山です。
