freebsd/freebsd-doc/ja_JP.eucJP/man/man8/keyserv.8
.\" @(#)keyserv.1m 1.21 93/07/14 SMI; from SVr4
.\" jpman %Id: keyserv.8,v 1.3 1998/10/10 09:06:17 yohta Stab %
.\"macro stdmacro
.\" Copyright 1989 AT&T
.\" @(#)keyserv.8c 1.8 89/03/29 SMI;
.\".TH KEYSERV 8C "9 September 1987"
.Dd September 14, 1992
.Dt KEYSERV 8
.Os
.Sh 名称
.Nm keyserv
.Nd プライベートな暗号鍵を格納するサーバ
.Sh 書式
.Nm keyserv 
.Op Fl d
.Op Fl D
.Op Fl n
.Op Fl p Ar path
.Op Fl v
.\" .Sh 可用性
.\" SUNWcsu
.\" .Sh 解説
.Nm
デーモンは、
ログインした各ユーザのプライベートな暗号鍵を格納するために使用されます。
これらの暗号鍵は、
安全な NFS などの安全なネットワークサービスにアクセスするために使用されます。
.Pp
通常、デーモン起動時に、root の鍵がファイル
.Pa /etc/.rootkey
から読み取られます。
これは、パスワードを入力する人が周囲にいないとき、
電源切断によるリブートが発生する場合に有用です。
.Pp
秘密鍵を持たないクライアントが
.Nm keyserv
を呼び出した場合、ユーザ
.Em nobody 
の鍵がデフォルトの鍵の代わりに使用されます。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Fl d
.Em nobody
に対するデフォルトの鍵の使用を禁止します。
.It Fl D
デバッグモードで実行し、
.Nm keyserv
に対するすべての要求をログします。
.It Fl n
root の秘密鍵を
.Pa /etc/.rootkey
から読み取りません。
代りに、
.Nm
はユーザにパスワードの入力をうながし、これを使用して
.Pa /etc/publickey
データベースに格納された root の鍵を復号し、
復号した鍵を将来使用するために
.Pa /etc/.rootkey
に格納します。
このオプションが有用なのは、
.Pa /etc/.rootkey
ファイルが古くなったり、壊れた場合です。
.It Fl p Ar path
.Pa libdes.so.3
を検索する場所を指定します。
デフォルトは
.Pa /usr/lib
です。
.It Fl v
DES サポートの状態を表示します (有効/無効)。
.El
.Sh 関連ファイル
.Bl -tag -width /usr/lib/libdes.so.3 -compact
.It Pa /etc/.rootkey
.It Pa /usr/lib/libdes.so.3
.El
.Sh 関連項目
.Xr keylogin 1 ,
.Xr keylogout 1 ,
.Xr publickey 5
