freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kget.8
.\" Copyright (c) 1999 Andrzej Bialecki <abial@freebsd.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/kget/kget.8,v 1.3.2.4 2001/07/22 11:32:24 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/kget.8,v 1.8 2001/05/14 01:09:49 horikawa Exp $
.\"
.Dd February 20, 1999
.Dt KGET 8
.Os FreeBSD
.Sh 名称
.Nm kget
.Nd カーネルの変更情報を書き出す
.Sh 書式
.Nm
.Ar filename
.Sh 解説
.Nm
ユーティリティは、ユーザコンフィグ (-c) セッションで変更された
すべてのデバイス設定情報を、見たり保存したりできるようにします。
もっとも典型的には、この情報は /boot/kernel.conf ファイルに書き込まれて、
/boot/loader.rc で ("load -t userconfig_script /boot/kernel.conf" として)
読み込まれます。これにより、
システムがブートする度にユーザが入力しなければいけない、
という手間を省くことができます。
.Pp
.Nm
はカーネルからデータを取り寄せるために
.Xr sysctl 3
インタフェースを使います。
とにかく
.Va machdep.uc_devlist
シンボルがないといけません。
もしないのであれば、このユーティリティを使う前に
カーネルを更新する必要があるのでしょう。
.Pp
使用法:
.Nm
.Ar filename
.Pp
.Ar filename
は通常のファイル (上書きされます) か、もしくは - です。
後者の場合は標準出力を使用します。
.Sh バグ
きっといくつかあるでしょう。
.Sh 関連項目
.Xr sysctl 3
.Sh 歴史
.Nm
コマンドは
.An Andrzej Bialecki
による PicoBSD 配布の一部として
.Fx 3.1
に登場しました。
