freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kgmon.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)kgmon.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/kgmon/kgmon.8,v 1.7.2.2 2001/07/22 12:41:08 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/kgmon.8,v 1.6 2001/05/14 01:09:50 horikawa Exp $
.\"
.Dd June 6, 1993
.Dt KGMON 8
.Os BSD 4.2
.Sh 名称
.Nm kgmon
.Nd オペレーティングシステムのプロファイルバッファのダンプを生成する
.Sh 書式
.Nm
.Op Fl Bbhpr
.Op Fl M Ar core
.Op Fl N Ar system
.Sh 解説
.Nm
は、オペレーティングシステムのプロファイリングを行うときに使うツールです。
引数を指定しないときは、
.Nm
はオペレーティングシステムのプロファイリングの状態、
つまり、実行中か停止中か未設定か
.Pf ( Xr config 8
を参照)を示します。
.Fl p
が指定されると、
.Nm
はオペレーティングシステムからプロファイルデータを取り出し、後で
.Xr gprof 1
で分析できるようにファイル
.Pa gmon.out
を作ります。
.Pp
オプションは以下の通りです:
.Bl -tag -width Ds
.It Fl B
高精度のプロファイルデータの収集を再開します。
.It Fl b
低精度のプロファイルデータの収集を再開します。
.It Fl h
プロファイルデータの収集を停止します。
.It Fl p
プロファイルバッファの内容をファイル
.Pa gmon.out
にダンプします。
.It Fl r
プロファイルバッファのすべての内容をリセットします。このとき
.Fl p
が指定
されていると、バッファの内容をリセットする前に
.Pa gmon.out
に出力します。
.It Fl M
名前のリストに関連する値を取り出す際、デフォルトの
.Dq /dev/kmem
のかわりに
指定した core を使います。
.It Fl N
名前のリストを取り出す際に、デフォルトの
.Dq /kernel
のかわりに
指定した system を使います。
.El
.Pp
.Fl B ,
.Fl b ,
.Fl h
のいずれも指定されなければ、プロファイル収集の状態は変化しません。
たとえば、プロファイルデータの収集中に
.Fl p
が指定されると、
プロファイリングは一時的に中断され、
オペレーティングシステムのプロファイルバッファがダンプされ、
すぐにプロファイリングが再開されます。
.Sh 関連ファイル
.Bl -tag -width /dev/kmem -compact
.It Pa /kernel
デフォルトのカーネルファイル名
.It Pa /dev/kmem
デフォルトのメモリファイル
.El
.Sh 関連項目
.Xr gprof 1 ,
.Xr config 8
.Sh 診断
.Pa /dev/kmem
にリードパーミッションしか持たないユーザは、プロファイル収集
の状態を変更することができません。
.Pa gmon.out
ファイルを得ることはできますが、
プロファイリング実行中には、
データに矛盾がでる可能性があるという警告が表示されます。
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
