freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kldconfig.8
.\"
.\" Copyright (c) 2001 Peter Pentchev
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/kldconfig/kldconfig.8,v 1.2.2.1 2001/08/01 05:52:36 obrien Exp %
.\"
.\" $FreeBSD$
.Dd June 15, 2001
.Dt KLDCONFIG 8
.Os
.Sh 名称
.Nm kldconfig
.Nd カーネルモジュールの検索パスの表示、修正
.Sh 書式
.Nm
.Op Fl dfimnUv
.Op Fl S Ar name
.Op Ar path ...
.Nm
.Fl r
.Sh 解説
.Nm
は、
.Xr kldload 8
ユーティリティや
.Xr kldload 2
システムコールによってモジュールをロードする時にカーネルが使用する
検索パスを表示したり、修正したりします。
.Pp
以下のオプションが利用できます:
.Bl -tag -width indent
.It Fl d
指定されたパスを、モジュール検索パスから取り除きます。
.It Fl f
追加しようとしたパスが既に検索パスに含まれていたり、
取り除こうとしたパスが検索パスに含まれていなくても、
診断メッセージを表示しないようにします。
これは、スタートアップ / シャットダウンスクリプトの中で
まだマウントされていないファイルシステムへのパスを追加しようとしたり、
スタートアップの際に追加されたかもしれないパスを
シャットダウンスクリプトの中で無条件に取り除く場合に有用です。
.It Fl i
指定したパスを、検索パスの最後ではなく最初に追加します。
このオプションは、パスを追加する時のみ使用できます。
.It Fl m
モジュール検索パスを指定されたパスの組で置き換えるのではなく、
新しいエントリを
.Dq マージ
します。
.It Fl n
実際にはモジュール検索パスに変更を加えません。
.It Fl r
現在の検索パスを表示します。
このオプションは、パスが指定された場合は使用できません。
.It Fl S Ar name
デフォルトの
.Va kern.module_path
の代わりに使用する sysctl 名を指定します。
.It Fl U
検索パスを
.Dq ユニーク化
します。
もしディレクトリが複数回含まれている場合は、最初のものだけが残されます。
このオプションは
.Fl m
を指定したことにもなります。
.It Fl v
冗長な出力: 新しいモジュール検索パスを表示します。
パスが変更されていて
.Fl v
フラグが複数回指定されていた場合は、古いパスも表示します。
.El
.Sh 関連ファイル
.Bl -tag -width indent
.It Pa /boot/kernel , /boot/modules , /modules
カーネルによって使用されるデフォルトのモジュール検索パス
.El
.Sh 診断
.Nm
ユーティリティは成功した場合 0 とともに終了し、
エラーの場合 0 以外を返します。
.Sh 関連項目
.Xr kldload 2 ,
.Xr kldload 8 ,
.Xr sysctl 8
.Sh 歴史
.Nm
ユーティリティは
.Fx 4.4
で初めて登場しました。
.Sh 作者
.An Peter Pentchev Aq roam@FreeBSD.org
