freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kldload.8
.\"
.\" Copyright (c) 1997 Doug Rabson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/kldload/kldload.8,v 1.20 2002/10/09 06:46:54 jmallett Exp %
.\"
.\" $FreeBSD$
.\"
.Dd April 25, 1997
.Dt KLDLOAD 8
.Os
.Sh 名称
.Nm kldload
.Nd カーネルにファイルをロードする
.Sh 書式
.Nm
.Op Fl v
.Ar
.Sh 解説
.Nm
ユーティリティは、カーネルリンカを用いて
.Ar file Ns Pa .ko
をカーネルにロードします。
複数モジュールが指定された場合、いくつかが失敗したとしても、
すべてをロードしようとします。
.Pp
以下のオプションが利用できます :
.Bl -tag -width indent
.It Fl v
出力を冗長にします。
.El
.Sh 診断
.Ex -std
.Sh モジュールの自動ロード
モジュールによっては (ipfw, ipf など)、それらの動作が
.Xr rc.conf 5
で有効に設定されていると、ブート時に自動的にロードされます。
.Xr loader.conf 5
に追加することでも、モジュールを自動的にロード可能です。
.Sh 関連ファイル
.Bl -tag -width /boot/kernel -compact
.It Pa /boot/kernel
ローダブルモジュールを格納するディレクトリ。
モジュールの拡張子は
.Pa .ko
である必要があります。
.El
.Sh 関連項目
.Xr kldload 2 ,
.Xr loader.conf 5 ,
.Xr rc.conf 5 ,
.Xr kldstat 8 ,
.Xr kldunload 8
.Sh 歴史
.Nm
ユーティリティは
.Fx 3.0
に初めて登場し、
.Xr lkm 4
インタフェースを置き換えました。
.Sh 作者
.An Doug Rabson Aq dfr@FreeBSD.org
