freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kldstat.8
.\"
.\" Copyright (c) 1997 Doug Rabson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/kldstat/kldstat.8,v 1.7.2.2 2000/07/01 07:56:00 ps Exp %
.\" jpman %Id: kldstat.8,v 1.3 1998/10/08 15:19:42 horikawa Stab %
.\"
.Dd April 25, 1997
.Dt KLDSTAT 8
.Os
.Sh 名称
.Nm kldstat
.Nd 動的カーネルリンカの状態を表示
.Sh 書式
.Nm kldstat
.Op Fl v
.Op Fl i Ar id
.Op Fl n Ar name
.Sh 解説
.Nm
ユーティリティはカーネルに動的にリンクされたファイルの状態を表示します。
.Pp
以下のオプションが利用できます :
.Bl -tag -width indentXX
.It Fl v
出力を冗長にします。
.It Fl i Ar id
指定した ID のファイルの状態のみを表示します。
.It Fl n Ar name
指定した名前のファイルの状態のみを表示します。
.El
.Sh 診断
.Nm
ユーティリティは、成功時には状態 0 で、
エラー発生時には 0 以外の状態で終了します。
.Sh 関連項目
.Xr kldstat 2 ,
.Xr kldload 8 ,
.Xr kldunload 8
.Sh 歴史
.Nm
コマンドは
.Fx 3.0
に初めて登場し、
.Xr lkm 4
インタフェースを置き換えました。
.Sh 作者
.An Doug Rabson Aq dfr@FreeBSD.org
