freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kldunload.8
.\"
.\" Copyright (c) 1997 Doug Rabson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/kldunload/kldunload.8,v 1.12 2002/07/06 19:33:23 charnier Exp %
.\" $FreeBSD$
.\"
.\" WORD: unload    アンロードする
.\"
.Dd April 25, 1997
.Dt KLDUNLOAD 8
.Os
.Sh 名称
.Nm kldunload
.Nd カーネルからファイルをアンロードする
.Sh 書式
.Nm
.Op Fl v
.Fl i Ar id
.Nm
.Op Fl v
.Op Fl n
.Ar name
.Sh 解説
.Nm
ユーティリティはすでに
.Xr kldload 8
でロードされているファイルをアンロードします。
.Pp
以下のオプションが利用できます :
.Bl -tag -width indentXX
.It Fl v
出力を冗長にします。
.It Fl i Ar id
指定した ID のファイルをアンロードします。
.It Fl n Ar name
指定した名前のファイルをアンロードします。
.It Ar name
指定した名前のファイルをアンロードします。
.El
.Sh 診断
.Nm
ユーティリティは、成功時には状態 0 で、
エラー発生時には 0 以外の状態で終了します。
.Sh 関連項目
.Xr kldunload 2 ,
.Xr kldload 8 ,
.Xr kldstat 8
.Sh 歴史
.Nm
ユーティリティは
.Fx 3.0
に初めて登場し、
.Xr lkm 4
インタフェースを置き換えました。
.Sh 作者
.An Doug Rabson Aq dfr@FreeBSD.org
