freebsd/freebsd-doc/ja_JP.eucJP/man/man8/kvm_mkdb.8
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)kvm_mkdb.8	8.1 (Berkeley) 6/9/93
.\"
.\" Original Revision: 1.4
.\" jpman %Id: kvm_mkdb.8,v 1.3 1997/09/04 16:37:09 horikawa Stab %
.\"
.Dd June 9, 1993
.Dt KVM_MKDB 8
.Os
.Sh 名称
.Nm kvm_mkdb
.Nd カーネルデータベースの作成
.Sh 書式
.Nm kvm_mkdb
.Op file
.Sh 解説
.Nm
は、指定されたファイルに関する情報を含むデータベースを
.Pa /var/db
に作成します。
ファイルが指定されない場合は、デフォルトで
.Pa /kernel
が用いられます。
作成されるファイル名は ``kvm_filename.db'' となります。
ここで ``filename'' は読み込んだファイルの名前です。
様々なライブラリルーチンがこのデータベースを参照します。
現在格納されている情報は、カーネルの名前リストだけです。
名前リストは
.Xr kvm_nlist 3
関数で利用されますが、将来はこのデータベースに
現システムに関する他の静的情報も含まれるようになるでしょう。
.Sh 関連ファイル
.Bl -tag -width /var/db/kvm_kernel.db -compact
.It Pa /kernel
.It Pa /var/db/kvm_kernel.db
.El
.Sh 関連項目
.Xr kvm_nlist 3
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.4
で初めて登場しました。
