freebsd/freebsd-doc/ja_JP.eucJP/man/man8/lastlogin.8
.\" %FreeBSD: src/usr.sbin/lastlogin/lastlogin.8,v 1.2.2.1 2001/03/12 11:00:15 ru Exp %
.\"	%NetBSD: lastlogin.8,v 1.3 1998/02/06 06:20:39 perry Exp %
.\"
.\" Copyright (c) 1996 John M. Vinopal
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by John M. Vinopal.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 11, 1996
.\" jpman %Id: lastlogin.8,v 1.3 2001/03/24 02:49:45 horikawa Stab %
.Dt LASTLOGIN 8
.Os
.Sh 名称
.Nm lastlogin
.Nd ユーザの最後にログインした時刻を表示
.Sh 書式
.Nm
.Op Ar user ...
.Sh 解説
.Nm
は、
.Ar user
で指定されたそれぞれのユーザ、もしくはデフォルトで全てのユーザの
最新のログインセッションを表示します。
出力の各行にはユーザ名、セッションを処理した tty、ホスト名、
セッションの開始時刻が含まれています。
.Pp
一人以上の
.Ar user
が指定された場合、コマンドラインで指定された順番で
各ユーザのセッション情報が出力されます。
そうでない場合は、全ユーザの情報が uid でソートされて出力されます。
.Pp
.Nm
は
.Xr last 1
と異なり、最新のログインセッションの情報しか出力しません。
通常の使用では、最新ログイン情報データベースは
切り替えも削除もされません。
.Sh 関連ファイル
.Bl -tag -width /var/log/lastlog -compact
.It Pa /var/log/lastlog
最新ログイン情報データベース
.El
.Sh 関連項目
.Xr last 1 ,
.Xr lastlog 5 ,
.Xr ac 8
.Sh 作者
.An John M. Vinopal
が 1996 年 1 月にこのプログラムを書き
.Nx
プロジェクトに寄贈しました。
