freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ldconfig.8
.\"
.\" Copyright (c) 1993 Paul Kranenburg
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Paul Kranenburg.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/ldconfig/ldconfig.8,v 1.19.2.6 2001/06/15 14:01:26 schweikh Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/ldconfig.8,v 1.20 2001/05/14 01:09:50 horikawa Exp $
.\"
.Dd October 3, 1993
.Dt LDCONFIG 8
.Os FreeBSD
.Sh 名称
.Nm ldconfig
.Nd 共有ライブラリのキャッシュを設定する
.Sh 書式
.Nm
.Op Fl aout | Fl elf
.Op Fl Rimrsv
.Op Fl f Ar hints_file
.Op Ar directory | Ar
.Sh 解説
.Nm
は、ダイナミックリンカ
が、複数のディレクトリから利用可能な共有ライブラリを素早く捜し出すために
使う
.Dq ヒント
の集合を準備するために使われます。
コマンドは、組み込みのシステムディレクトリと
コマンドラインで指定された任意の
.Ar ディレクトリ
(を指定された順番) で共有ライブラリを探し、
その結果を
システムファイル
に保存します。
これは、
ダイナミックリンカ
が要求された共有ライブラリを読み込む際のディレクトリ検索操作
オーバヘッドをあらかじめ払っていることになります。
.Pp
コマンドラインにて指定するファイル名は共有ライブラリを検査するディレクトリ
を含むことが期待されます。
各ディレクトリのパス名は行の先頭から始まる必要があります。
空行およびコメント文字
.Ql \&#
から始まる行は無視されます。
.Pp
セキュリティ上の理由から、
誰でも書き込み可能またはグループ書き込み可能なディレクトリと、
root が所有しないディレクトリに対しては、
警告メッセージを生成してスキップします。
ただし、
.Fl i
オプションが存在する場合は、例外です。
.Pp
共有ライブラリは、実行されようとするプログラムによって必要とされる
ならば、利用可能なものが自動的に読み込まれることになります。
これは、実行形式に検索パスを保存する必要性を無くします。
.Pp
.Ev LD_LIBRARY_PATH
環境変数は、キャッシュから使用するディレクトリ (や、その順序関係) を
上書きしたり、共有ライブラリを探す追加のディレクトリを
指定するために使われます。
.Ev LD_LIBRARY_PATH
は、共有ライブラリを読み込む必要がある時、
ダイナミックリンカ
によって検索されるディレクトリパスのリストを
コロン
.Sq \&:
で区切って指定します。
これは、
.Xr ld 1 
における
.Fl L
オプションと、実行時点では等価です。
.Pp
.Nm
は典型的にはブート時の手続きのひとつとして実行されます。
.Pp
以下のオプションが
.Nm
で認識されます。
.Bl -tag -width indent
.It Fl aout
a.out 形式の共有ライブラリに対するヒントを生成します。
.It Fl elf
ELF 形式の共有ライブラリに対するヒントを生成します。
.It Fl R
以前に設定したディレクトリを再度検索します。
以前作成したヒントファイルをオープンし、
ヘッダからディレクトリリストを取り出します。
コマンドラインに指定したパス名も処理します。
これが、パラメータ無指定時のデフォルト動作です。
.It Fl f Ar hints_file
標準のファイルの代りに、
特定のヒントファイルを読み込んだり、更新したり、その両方を
行ったりします。
このオプションは、テストのために提供されています。
.It Fl i
安全ではないモードで実行します。
セキュリティチェックは実行されません。
.It Fl m
ヒントファイルの内容を指定されたディレクトリで見付かったものに
置き換える代りに、新しいディレクトリの内容を
.Dq 併合 (merge)
します。
以前の
.Nm
の実行によってヒントファイル内に記録されているディレクトリも、
新しい共有ライブラリのために再び検索されます。
.It Fl r
現在のヒントファイルの中身について、標準出力に表示します。
ヒントファイルは変更されません。
ヒントファイル中のディレクトリリストが組み込まれます。
.It Fl s
共有ライブラリのために、システムの組み込みディレクトリ
.Pq Dq /usr/lib
を検索しません。
.It Fl v
冗長モードに切り替えます。
.El
.Sh セキュリティ
.Ev セット uid (set-user-Id)
プログラムのアドレス空間に共有ライブラリを読み込む時には、
特別の注意をしなければなりません。
そのようなプログラムが実行される時はいつでも、
ダイナミックリンカ
はヒントファイルからだけ共有ライブラリを読み込みます。
特に、
.Ev LD_LIBRARY_PATH
は、ライブラリを探すためには使われません。
従って、ldconfig の役割には 2 つあります。
素早い検索のためにヒント集合を作成することに加えて、
共有オブジェクトが共有ライブラリを安全に読み込むことができる
ディレクトリの集まりを特定することも、その役割です。
.Sh 環境変数
.Bl -tag -width OBJFORMATxxx -compact
.It Ev OBJFORMAT
.Pa /etc/objformat
(後述) に優先し、
.Fl aout
と
.Fl elf
のどちらがデフォルトであるかを決定します。
設定されている場合、値は
.Ql aout
もしくは
.Ql elf
のいずれかである必要があります。
.El
.Sh 関連ファイル
.Bl -tag -width /var/run/ld-elf.so.hintsxxx -compact
.It Pa /var/run/ld.so.hints
a.out ダイナミックリンカの標準ヒントファイル。
.It Pa /var/run/ld-elf.so.hints
ELF ダイナミックリンカの標準ヒントファイル。
.It Pa /etc/ld.so.conf
伝統的な設定ファイルであり、
.Fl aout
付きで起動した場合のためにディレクトリ名を格納します。
.It Pa /etc/ld-elf.so.conf
伝統的な設定ファイルであり、
.Fl elf
付きで起動した場合のためにディレクトリ名を格納します。
.It Pa /etc/objformat
.Fl aout
と
.Fl elf
のどちらがデフォルトであるかを決定します。
存在する場合、
.Ql OBJFORMAT=aout
か
.Ql OBJFORMAT=elf
のいずれかの 1 行から成る必要があります。
.Sh 関連項目
.Xr ld 1 ,
.Xr link 5
.Sh 歴史
.Nm
ユーティリティは SunOS 4.0 で初めて現れました。
現在の形は、
.Fx 1.1
からです。
.Sh バグ
.Fl aout
指定時には、実行されないセキュリティチェックがあります
(例えば、追加されたディレクトリの root の所有権)。
