freebsd/freebsd-doc/ja_JP.eucJP/man/man8/linux.8
.\"
.\" Copyright (c) 1997
.\" The FreeBSD Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sys/modules/linux/linux.8,v 1.8.2.1 2000/12/27 13:50:33 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/linux.8,v 1.13 2001/05/14 01:09:50 horikawa Exp $
.Dd January 9, 1997
.Dt LINUX 8
.Os FreeBSD
.Sh 名称
.Nm linux
.Nd Linux イメージアクチベータのモジュールを読み込む
.Sh 書式
.Nm
.Sh 解説
.Nm
は、Linux イメージアクチベータのモジュールを読み込みます。
.Sh 関連ファイル
.Bl -tag -width /modules/linux.ko
.It Pa /modules/linux.ko
Linux イメージアクチベータの読み込み可能カーネルモジュール
.El
.Sh 関連項目
.Xr kld 4 ,
.Xr kldload 8 ,
.Xr kldstat 8 ,
.Xr kldunload 8
