freebsd/freebsd-doc/ja_JP.eucJP/man/man8/locate.updatedb.8
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mike Pritchard.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.bin/locate/locate/locate.updatedb.8,v 1.7.2.2 2001/07/22 10:14:51 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/locate.updatedb.8,v 1.6 2001/05/14 01:09:50 horikawa Exp $
.Dd February 11, 1996
.Dt LOCATE.UPDATEDB 8
.Os BSD 4.4
.Sh 名称
.Nm locate.updatedb
.Nd locate データベースの更新
.Sh 書式
.Nm /usr/libexec/locate.updatedb
.Sh 解説
.Nm locate.updatedb
は、
.Xr locate 1
で使用されるデータベースの更新を行います。
通常は、
.Pa /etc/periodic/weekly/310.locate
スクリプト
により週に一度実行されます。
.Pp
新規に構築されるデータベースの内容は、
.Pa /etc/locate.rc
ファイル
を用いて設定することが出来ます。
.Sh 関連ファイル
.Bl -tag -width /var/db/locate.database -compact
.It Pa /var/db/locate.database
デフォルトのデータベース
.It Pa /etc/locate.rc
設定ファイル
.El
.Sh ENVIRONMENT
.Bl -tag -width /var/db/locate.database -compact
.It Pa LOCATE_CONFIG
設定ファイルのパス
.El
.Sh 関連項目
.Xr locate 1 ,
.Xr periodic 8
.Rs
.%A Woods, James A.
.%D 1983
.%T "Finding Files Fast"
.%J ";login"
.%V 8:1
.%P pp. 8-10
.Re
