freebsd/freebsd-doc/ja_JP.eucJP/man/man8/lpc.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)lpc.8	8.5 (Berkeley) 4/28/95
.\" %FreeBSD: src/usr.sbin/lpr/lpc/lpc.8,v 1.8.2.10 2002/06/25 23:08:36 gad Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 20, 2001
.Dt LPC 8
.Os
.Sh 名称
.Nm lpc
.Nd ラインプリンタの制御を行う
.Sh 書式
.Nm
.Op Ar command Op Ar argument ...
.Sh 解説
.Nm
は、システム管理者がラインプリンタの動作を制御するために使われます。
各ラインプリンタの設定は
.Pa /etc/printcap
で行います。
.Nm
は以下の目的で利用します。
.Bl -bullet -offset indent
.It
プリンタの利用可能/不可能の設定を行う
.It
スプールキューへのジョブ投入可能/不可能の設定を行う
.It
スプールキュー内のジョブの順番を並べ直す
.It
プリンタ、スプールのキュー、およびプリンタデーモンのステータスを調べる
.It
プリンタキューのステータスメッセージを変更する
(ステータスメッセージは、
.Xr lpq 1
ユーティリティを使用してユーザが見ることができます)
.El
.Pp
引数なしの場合、
.Nm
は標準入力からコマンドを読むためにプロンプトを出します。
引数をつけた場合、第 1 引数をコマンドとし、残りの引数を
そのコマンドのパラメータと解釈します。
標準入力をリダイレクトして、
.Nm
にファイルからコマンドを読み込ませることもできます。
コマンドは略して書くことができます。
利用可能なコマンドを以下に列挙します。
.Pp
.Bl -tag -width indent -compact
.It Ic \&? Op Ar command ...
.It Ic help Op Ar command ...
引数で指定したコマンドの簡単な説明を表示します。引数がないときはコマンド
の一覧を表示します。
.Pp
.It Ic abort Brq Cm all | Ar printer
ローカルホスト上の動作中のスプールデーモンをただちに終了させ、指定した
プリンタをプリントアウトできないように (
.Xr lpr 1
が新しいデーモンをスタートさせないように) します。
.Pp
.It Ic clean Brq Cm all | Ar printer
ローカルマシン上の指定したプリンタのキューから、出力できない (すなわち、
完全なプリンタジョブの形になっていない) テンポラリファイル、データファイル、
コントロールファイルをすべて削除します。
本コマンドは、各プリンタキューに対し、
スプールディレクトリ中の
.Pa core
ファイルも探し、
発見されたものを列挙します。
本コマンドは
.Pa core
ファイルを削除しません。
.Ic tclean
コマンドも参照してください。
.Pp
.It Ic disable Brq Cm all | Ar printer
指定したプリンタのキューをオフにします。これにより、
.Xr lpr 1
によって新しいプリンタジョブがキューに入らないようになります。
.Pp
.It Ic down Bro Cm all | Ar printer ... Brc Cm -msg Ar message ...
.It Ic down Bro Cm all | Ar printer Brc Ar message ...
指定したプリンタのキューをオフにし、プリントアウトできないようにし、
プリンタのステータスファイルに
.Ar message
を書きます。
複数のプリンタキューを指定する場合、
新規ステータスメッセージとなるテキストとプリンタリストを分離するために、
.Ic -msg
引数が必要です。
メッセージは引用符で囲む必要はなく、残りの引数は
.Xr echo 1
と同様に扱われます。通常、この
コマンドはプリンタをダウンさせ、ユーザに対しそのダウンの理由を
.Xr lpq 1
ユーティリティによって説明させるために使われます。
.Pp
.It Ic enable Brq Cm all | Ar printer
指定したプリンタ用のキューのスプーリングを行うようにします。これは、
.Xr lpr 1
で新しいプリンタジョブをスプールキューに挿入することができるよ
うにします。
.Pp
.It Ic exit
.It Ic quit
.Nm
を終了させます。
.Pp
.It Ic restart Brq Cm all | Ar printer
新しいプリンタデーモンの再スタートを試みます。このコマンドは、異常な
状態になって突然デーモンが死に、キュー内にジョブが残ったままになった場合に
有効です。この状態が起きたときには、
.Xr lpq 1
は現在デーモンが動いていないことを報告します。
もしあなたがスーパユーザなら、現在動いているデーモンを先に殺してください
(つまり、動かなくなったデーモンを殺してから再スタートさせるわけです)。
.Pp
.It Ic setstatus Bro Cm all | Ar printer Brc Cm -msg Ar message ...
指定したプリンタのステータスメッセージを設定します。
新規ステータスメッセージとなるテキストとプリンタリストを分離するために、
.Ic -msg
引数が必要です。
印刷を無効化した後にプリンタキューがもはやアクティブではなく、
.Xr lpq 1
ユーティリティの出力中にユーザが見るメッセージを変更したい場合、
通常このコマンドを使用して、ステータスメッセージを変更します。
.Pp
.It Ic start Brq Cm all | Ar printer
指定したプリンタを出力可能にしてスプールデーモンをスタートさせます。
.Pp
.It Ic status Brq Cm all | Ar printer
ローカルマシン上のデーモンとキューの状態を表示します。
.Pp
.It Ic stop Brq Cm all | Ar printer
現行のジョブが終了したあとでデーモンのスプーリングをストップさせ、
プリントアウトできないようにします。
.Pp
.It Ic tclean Brq Cm all | Ar printer
本コマンドは、
.Ic clean
コマンドのテスト実行を行います。
同じチェックが行われますが、同様の
.Ic clean
コマンドが入力された場合に実行する事柄を、本コマンドは表示します。
本コマンドは、いかなるファイルも削除しません。
.Ic clean
は特権コマンドですが、
.Ic tclean
は制限がありません。
.Pp
.It Ic topq Ar printer Xo
.Op Ar jobnum ...
.Op Ar user ...
.Xc
引数に並べた順番で、ジョブをキューの先頭に移動させます。
.Pp
.It Ic up Brq Cm all | Ar printer
すべての状態を可能状態(enable)にし、新しいプリンタデーモンをスタートさせます。
.Ic down
の逆です。
.El
.Sh 関連ファイル
.Bl -tag -width /var/spool/*/lockx -compact
.It Pa /etc/printcap
プリンタの設定を記述するファイル
.It Pa /var/spool/*
スプールディレクトリ
.It Pa /var/spool/*/lock
プリンタキューの制御を行うためのロックファイル
.El
.Sh 関連項目
.Xr lpq 1 ,
.Xr lpr 1 ,
.Xr lprm 1 ,
.Xr printcap 5 ,
.Xr chkprintcap 8 ,
.Xr lpd 8
.Sh 診断
.Bl -diag
.It "?Ambiguous command"
コマンド指定が省略し過ぎのため、複数のコマンドにマッチしています。
.It "?Invalid command"
マッチするコマンドがありません。
.It "?Privileged command"
"operator" グループのメンバか root でなければこのコマンドは
実行できません。
.El
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
