freebsd/freebsd-doc/ja_JP.eucJP/man/man8/lpd.8
\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)lpd.8	8.3 (Berkeley) 4/19/94
.\" %FreeBSD: src/usr.sbin/lpr/lpd/lpd.8,v 1.14 2000/03/01 14:09:16 sheldonh Exp %
.\"
.\" jpman %Id: lpd.8,v 1.2 1997/03/31 13:34:37 horikawa Stab %
.\"
.Dd April 19, 1994
.Dt LPD 8
.Os BSD 4.2
.Sh 名称
.Nm lpd
.Nd ラインプリンタ・スプーラ・デーモン
.Sh 書式
.Nm lpd
.Op Fl dl
.Op Ar port#
.Sh 解説
.Nm
はラインプリンタのためのデーモン (スプール領域を管理するプログラム) で、
通常はブート時に
.Xr rc 8
ファイルから起動されます。このデーモンは、接続されているプリンタの情報を
.Xr printcap 5
ファイルを一通り読み込むことによって取得し、クラッシュ後に残っていた
ファイルがあれば印刷します。その後、システムコールの
.Xr listen 2
と
.Xr accept 2
を用いてキュー内のファイルの印刷・スプール領域へのファイル転送・
キューの表示・キューからのジョブの削除などの要求を受け付けます。
何か要求があると lpd は子プロセスを fork してその要求を処理するので、
親プロセスは続けて次の要求待ちをできるようになっています。
.Pp
使用できるオプション:
.Bl -tag -width Ds
.It Fl d
インターネットで listen するソケットにて
.Dv SO_DEBUG
をオンにします (
.Xr setsockopt 2
参照)。
.It Fl l
.Fl l
オプションを
つけると、
.Nm
はネットワークから受けとった正当な要求について記録をとるようになります。
これはデバッグを行う際に有用です。
.It Ar "port#"
他のプロセスと接続するのに用いる
インターネットポート番号は通常
.Xr getservbyname 3
を使って取得しますが、引数
.Ar port#
を使って変更することも可能です。
.El
.Pp
プリンタへのアクセス制限は二つの手段を用いて行われます。第一に、全ての要求は
.Pa /etc/hosts.equiv
ファイルもしくは
.Pa /etc/hosts.lpd
ファイルに列挙さ
れているマシンからのものでなければなりません。
第二に、アクセスされるプリンタに関する
.Xr printcap
エントリに
.Li rs
特性の指定があると、
.Em lpr
からの要求はそのプリンタが接続されているマシンにアカウントを持つ
ユーザのものしか受け付けられなくなります。
.Pp
各スプールディレクトリ内に
.Em minfree
というファイルを作成し、空きとして残しておくディスクのブロック数を
書いておけば、ラインプリンタキューがディスクを使い尽くしてしまわないよう
にできます。
.Em minfree
ファイルは任意のテキストエディタを使って
編集できます。
.Pp
このデーモンは、プリンタへのアクセスを
排他的に行うためのロック (後述) を行ったうえで
ファイルの処理を開始し、スプール
ディレクトリの中に
.Em cf
で始まる名前のファイルがあるかどうかを調べます。
.Em cf
ファイルの内容は印刷すべきファイルの名前もしくは印刷以外で行うべき
何らかの動作を示しています。ファイル中の各行はキー文字から始まっており、
その行の残りの部分と合わせてどのような動作を行うべきかを表しています。
.Bl -tag -width Ds
.It J
ジョブ名 (job name)。バーストページに印刷されるジョブ名として用いられる文字列。
.It C
分類 (classification)。バーストページに印刷される分類行に用いられる
文字列。
.It L
リテラル (literal)。この行はパスワードファイルから取り出した ID 情報を
保持しており、この行があると見出しページが印刷されます。
.It T
表題 (title)。
.Xr pr 1
で表題として使用される文字列。
.It H
ホスト名 (host name)。
.Xr lpr 1
が実行されたマシンの名前。
.It P
人物 (person)。
.Xr lpr 1
を実行した人物のログイン名。これは
.Xr lprm 1
がジョブの所有権を調べる際に使用されます。
.It M
現在の印刷ジョブが完了した時、指定のユーザにメールを送ります。
.It f
整形済みファイル (formatted file)。すでに整形済みである印刷ファイルの名前。
.It l
``f'' とほぼ同じですが、制御文字を通すことと改ページを行わない点が異なります。
.It p
フィルタとして
.Xr pr 1
を使用して印刷すべきであるファイルの名前。
.It t
troff ファイル。ファイルの内容が
.Xr troff 1
の出力結果であることを示します。
.It n
ditroff ファイル。ファイルの内容がデバイス独立troff
の出力結果であることを示します。
.It r
DVI ファイル。ファイルの内容が
.Xr TeX l
の出力する DVI 形式であることを示します。
.It g
graph ファイル。ファイルの内容が
.Xr plot 3
の生成したデータであることを示します。
.It c
cifplot ファイル。ファイルの内容が
.Em cifplot
の生成したデータであることを示します。
.It v
ファイルの内容がラスタイメージであることを示します。
.It r
ファイルの内容が FORTRAN のキャリッジ制御文字を伴った
テキストデータであることを示します。
.It \&1
troff R フォント。デフォルトのものに代えて使用するフォントファイルの名前。
.It \&2
troff I フォント。デフォルトのものに代えて使用するフォントファイルの名前。
.It \&3
troff B フォント。デフォルトのものに代えて使用するフォントファイルの名前。
.It \&4
troff S フォント。デフォルトのものに代えて使用するフォントファイルの名前。
.It W
幅 (width)。
.Xr pr 1
および他のテキストフィルタが使用するページ幅 (文字数) を変更します。
.It I
字下げ (indent)。字下げの文字数が ASCII で書かれています。
.It U
リンク解除 (unlink)。印刷完了時に消去するファイルの名前。
.It N
ファイル名 (file name)。印刷中のファイルの名前。ファイルが標準
入力の場合 (
.Xr lpr
がパイプラインの中で実行された場合) は空白になっています。
.It Z
ロケールです。
.Xr pr 1
が使用するロケール文字列です。
.El
.Pp
何らかのファイルがオープンできない場合、
.Xr syslog 3
を通じて
.Em LOG_LPR
機能分類でメッセージが記録されます。
.Nm
は最大 20 回まで目的のファイルのオープンを試みますが、それでも失敗すると
そのファイルに関わる印刷処理は飛ばします。
.Pp
.Nm
は、ロックファイルを排他的にアクセスする目的あるいは複数のデーモンが同時
にアクティブになるのを回避する目的で
.Xr flock 2
を使用します。デーモンが kill されたり異常終了した場合でもロックファイルを
削除する必要はありません。ロックファイルは普通に読むことができる ASCII 形式で
書かれており、2 行からなります。1 行目はデーモンのプロセスIDで、2 行目は
現在実行中であるジョブの制御ファイル名です。2 行目は
.Xr lpq 1
および
.Xr lprm 1
が使用できるよう、常に
.Nm
の現在の状態を示すように更新されています。
.Sh 関連ファイル
.Bl -tag -width "/var/spool/*/minfree" -compact
.It Pa /etc/printcap
プリンタ記述ファイル
.It Pa /var/spool/*
スプールディレクトリ群
.It Pa /var/spool/*/minfree
最低限残しておく空き領域の設定
.It Pa /dev/lp*
ラインプリンタデバイス
.It Pa /var/run/printer
ローカルな要求のためのソケット
.It Pa /etc/hosts.equiv
プリンタへのアクセスを許可されているマシンの一覧
.It Pa /etc/hosts.lpd
プリンタへのアクセスは許可されているが、同一の管理権限下には
置かれていないマシンの一覧
.El
.Sh 関連項目
.Xr lpq 1 ,
.Xr lpr 1 ,
.Xr lprm 1 ,
.Xr setsockopt 2 ,
.Xr syslog 3 ,
.Xr hosts.lpd 5 ,
.Xr printcap 5 ,
.Xr lpc 8 ,
.Xr pac 8
.Rs
.%T "4.2 BSD Line Printer Spooler Manual"
.Re
.Sh 歴史
.Nm
プログラムは
.At v6
から登場しました。
