freebsd/freebsd-doc/ja_JP.eucJP/man/man8/lptcontrol.8
.\"
.\" lptcontrol - a utility for manipulating the lpt driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" %FreeBSD: src/usr.sbin/lptcontrol/lptcontrol.8,v 1.12.2.3 2001/03/06 14:21:17 ru Exp %
.\"
.\" $FreeBSD$
.Dd September 3, 1994
.Dt LPTCONTROL 8
.Os FreeBSD
.Sh 名称
.Nm lptcontrol 
.Nd lpt プリンタドライバ操作ユーティリティ
.Sh 書式
.Nm
.Fl i | p | e | s
.Op Fl d Ar device
.Sh 解説
.Nm
コマンドは、各
.Xr lpt 4
デバイスの割り込み駆動モード/拡張モード/
ポーリングモードを設定するために用いられます。
プリンタがあるモードから別のモードへ切り替えられると、
その切り替えは次回デバイスがオープンされたときに有効になります。
.Pp
拡張モードとは、パラレルポートインタフェースがサポート可能な任意のものです。
ECP/ISA パラレルポートにおいては、FIFO+DMA または ECP でしょう。
.Pp
以下のコマンドラインオプションがサポートされています:
.Bl -tag -width indent 
.It Fl i
割り込み駆動モードにします。
.It Fl p
ポーリングモードにします。
.It Fl e
拡張モードにします。
.It Fl s
標準モードにします。すなわち、拡張モードをオフにします。
.It Fl d Ar device
.Ar device
で指定されたプリンタデバイスのモードを設定します。
.Ar device
のデフォルト値は
.Pa /dev/lpt0
です。
.El
.Pp
.Fl i ,
.Fl p
.Fl e
のいずれか 1 つを必ず指定しなければなりません。
.Sh 関連ファイル
.Bl -tag -width /sys/i386/conf/GENERIC -compact
.It Pa /dev/lpt?
プリンタデバイス。
.It Pa /dev/lpctl?
プリンタ制御デバイス。
.It Pa /sys/i386/conf/GENERIC
カーネル設定ファイル。
.El
.Sh バグ
きっといくつかあるでしょう。
.Sh 関連項目
.Xr lpt 4 
.Sh 作者
.An Geoffrey M. Rehmet
.Sh 歴史
.Nm
は
.Fx 1.1.5
で初めて登場しました。
