freebsd/freebsd-doc/ja_JP.eucJP/man/man8/lptcontrol.8
.\"
.\" lptcontrol - a utility for manipulating the lpt driver
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" %FreeBSD: src/usr.sbin/lptcontrol/lptcontrol.8,v 1.20.2.2 2005/02/27 15:40:17 brueffer Exp %
.\"
.\" $FreeBSD$
.Dd February 22, 2005
.Dt LPTCONTROL 8
.Os
.Sh 名称
.Nm lptcontrol
.Nd lpt プリンタドライバ操作ユーティリティ
.Sh 書式
.Nm
.Fl e | i | p | s
.Op Fl d Ar control_device
.Sh 解説
.Nm
ユーティリティは、各
.Xr lpt 4
デバイスの割り込み駆動モード/拡張モード/標準モード/
ポーリングモードを設定するために用いられます。
プリンタがあるモードから別のモードへ切り替えられると、
その切り替えは次回デバイスがオープンされたときに有効になります。
.Pp
拡張モードとは、パラレルポートインタフェースがサポート可能な任意のものです。
ECP/ISA パラレルポートにおいては、FIFO+DMA または ECP でしょう。
.Pp
以下のコマンドラインオプションがサポートされています:
.Bl -tag -width indent
.It Fl e
拡張モードにします。
.It Fl i
割り込み駆動モードにします。
.It Fl p
ポーリングモードにします。
.It Fl s
標準モードにします。
すなわち、拡張モードをオフにします。
.It Fl d Ar control_device
.Ar control_device
で指定されたプリンタ制御デバイスのモードを設定します。
.Ar control_device
のデフォルト値は
.Pa /dev/lpt0
です。
.El
.Pp
.Fl e , i , p , s
のいずれか 1 つを必ず指定しなければなりません。
.Sh 関連ファイル
.Bl -tag -width /sys/i386/conf/GENERIC -compact
.It Pa /dev/lpt?
プリンタデバイス。
.It Pa /dev/lpt?.ctl
プリンタ制御デバイス。
.It Pa /sys/i386/conf/GENERIC
カーネル設定ファイル。
.It Pa /boot/device.hints
パラレルポートチップセットドライバ
.Xr ppc 4
用のデバイスヒント。
.El
.Sh バグ
制御デバイスのデバイス名は、本来オプション引数で指定されるべきもの
だったのですが、オプションで指定するようになっています。
そのためオプション引数が1個だった場合、それはデバイス名として解釈されます。
.Sh 関連項目
.Xr lpt 4 ,
.Xr ppc 4 ,
.Xr device.hints 5
.Sh 作者
.An Geoffrey M. Rehmet
.Sh 歴史
.Nm
ユーティリティは
.Fx 1.1.5
ではじめて登場しました。
