freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mailwrapper.8
.\" $FreeBSD$
.\"     %NetBSD: mailwrapper.8,v 1.6 1999/03/25 16:40:17 is Exp %
.\" %FreeBSD: src/usr.sbin/mailwrapper/mailwrapper.8,v 1.11 2003/02/24 22:53:25 ru Exp %
.\"
.\" Copyright (c) 1998
.\"     Perry E. Metzger.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"     This product includes software developed for the NetBSD Project
.\"     by Perry E. Metzger.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" The following requests are required for all man pages.
.Dd December 16, 1998
.Dt MAILWRAPPER 8
.Os
.Sh 名称
.Nm mailwrapper
.Nd 設定ファイルにしたがって適切な MTA ソフトウェアを起動する
.Sh 書式
特殊です。以下を参照してください。
.Sh 解説
かつて、容易に使うことのできるメール転送エージェント (MTA) は
.Xr sendmail 8
のみでした。このため、たとえば
.Xr mail 1
のように、ほとんどのメールユーザエージェント (MUA) は
.Xr sendmail 8
が期待するパスと呼び出し規則を持っていました。
.Pp
しかし時代は変わりました。現在の
.Ux
システムにおいては、管理者は
いくつか入手可能な MTA のなかから好きなものを使いたいと思うかもしれません。
.Pp
しかし、システムで通常使われている MUA ソフトウェアを全て修正するのは
困難でしょう。
そこで、代替 MTA のほとんどはフロントエンド
メッセージ提示プログラムを用意しています。これにより代替 MTA は
.Xr sendmail 8
と同じ呼び出し規則を使い、
.Pa /usr/sbin/sendmail
にある
.Xr sendmail 8
の代わりに利用することができます。
.Pp
.Xr sendmail 8
は通常、自身にリンクされた
.Xr mailq 1
と
.Xr newaliases 1
という名前のエイリアスを持ちます。sendmail は、その
.Va argv[0]
が
.Dq mailq
であるか
.Dq newaliases
であるかによって違った振る舞いをすることを認識しており、
それぞれに見合った動作をします。
通常、代替 MTA は、呼ばれた名前によってその挙動を変えるプログラムや、あるいは
それと似たような機能を提供する一連のプログラムを通して
sendmail に似た機能を提供します。
.Pp
たとえ、代替 MTA をインストールする際に
.Xr sendmail 8
を置き換える手助けをしてくれるプログラムがあったにしても、
本質的にそのようなプログラムは、システムの設定を
.Pa /usr
ディレクトリに頑張ってインストールしたプログラムに依存したものに
するだけのことです。
このことは、多くの管理者にとって設定に関する問題の原因となります。
なぜなら、
.Pa /usr
で既に提供されているものをそのままにして、新しい MTA をインストール
したいと思うかもしれないからです
(このようにしたいのは、たとえば古いシステムの上に
新しいバージョンのシステムをインストールする際に生じる、アップグレードの
問題を回避したいからでしょう)。
また、複数のマシン間で
.Pa /usr
を共有もしているのかもしれません。そうであれば、
読取り専用の
.Pa /usr
ディレクトリ中に暗黙のうちに設定情報を置いてしまうことは避けたいでしょう。
.Pp
.Nm
は
.Pa /usr/sbin/sendmail
を置き換え、そして、
.Pa /etc/mail/mailer.conf
に置かれた設定情報に基づいて
.Xr sendmail 8
の代わりとなる適切な MTA を起動するために設計されたものです。
これにより管理者は、実行時にシステム上でどの MTA が起動されるべきかを
設定することができます。
.Pp
.Xr sendmail 8
を置き換えるときには、他の設定ファイルも変更要かもしれません。
例えば、置き換えた MTA が
.Xr mailq 1
で
.Fl A
オプションをサポートしない場合、
.Pa /etc/periodic.conf
で
.Va daily_status_include_submit_mailq
をオフにするべきです。
.Sh 関連ファイル
.Nm
のための設定は
.Pa /etc/mail/mailer.conf
に保存されています。
.Pa /usr/sbin/sendmail
は一般的に
.Nm
へのシンボリックリンクとして設定されており、通常単体では起動できません。
.Sh 診断
設定ファイルが見つからない場合や、設定ファイルの内容が不適切であった場合、
もしくは、
.Nm
を起動する際に指定した名前とその振る舞いとの対応関係が設定ファイル中に
含まれていない場合、
.Nm
ユーティリティはエラーを返し、メッセージを表示します。
.Sh 関連項目
.Xr mail 1 ,
.Xr mailq 1 ,
.Xr newaliases 1 ,
.Xr mailer.conf 5 ,
.Xr periodic.conf 5 ,
.Xr sendmail 8
.Sh 歴史
.Nm
ユーティリティは
.Nx 1.4
ではじめて登場し、
.Fx 4.0
に移植されました。
.Sh 作者
Perry E. Metzger <perry@piermont.com>
.Sh バグ
このプログラムは消極的な理由により存在しています。このようなプログラムを
使う代わりに、メールをどのように送信するかを決めるコマンドを
標準化するべきであり、
.Xr mailq 1
のように「異なる名前で起動されたとき異なる動作をする」ものは排除
するべきです。
