freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mailstats.8
.\" Copyright (c) 1998 Sendmail, Inc.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	@(#)mailstats.8	8.8 (Berkeley) 11/13/1998
.\"
.Dd April 25, 1996
.Dt MAILSTATS 1
.Os BSD 3
.\" jpman %Id: mailstats.8,v 1.2 1997/05/21 07:42:38 yugawa Stab %
.Dd August 13, 1996
.Dt MAILSTATS 8
.Os
.Sh 名称
.Nm mailstats
.Nd メールの統計情報を表示する
.Sh 書式
.Nm mailstats
.Op Fl o
.if \nP .Op Fl p
.Op Fl C Ar cffile
.Op Fl f Ar stfile
.Sh 解説
.Nm mailstats
は、現在のメールの統計情報を表示します。
.Pp
まず、統計が開始された時刻が
.Xr ctime 3 
で指定されるフォーマットで表示されます。
次に、各メーラの状態が 1 行で表示されます。
それぞれ空白で区切られた次のフィールドからなります:
.Pp
.Bl -tag -width 10n -offset indent -compact
.It Sy M
メーラ番号。
.It Sy msgsfr
メーラからのメッセージ数。
.It Sy bytes_from
メーラからのキロバイト数。
.It Sy msgsto
メーラへのメッセージ数。
.It Sy bytes_to
メーラへのキロバイト数。
.It Sy msgsrej
拒否されたメッセージ数。
.It Sy msgsdis
捨てられたメッセージ数。
.It Sy Mailer
メーラ名。
.El
.Pp
この表示の後、
すべてのメーラの総計行が表示されますが、
等号
.Pq Dq \&=
文字のみからなる行によりその前の情報と分けられます。
.Pp
オプションは以下の通りです:
.Bl -tag -width Ds
.It Fl C
デフォルトの
.Nm sendmail
.Dq cf
ファイルの代りに指定されたファイルを読みます。
.It Fl f
.Nm sendmail
.Dq cf
ファイルで指定されている統計情報ファイルの代りに、
指定された統計情報ファイルを読みます。
.if \nP \
\{
.It Fl p
プログラムが読み取る形式で情報を出力し、統計情報をクリアします。
.\}
.It Fl o
出力においてメーラ名を表示しません。
.El
.Pp
.Nm mailstats
は成功時には 0 で、エラー時には >0 で終了します。
.Sh 関連ファイル
.Bl -tag -width /var/log/sendmail.st -compact
.ie \nP .It Pa /etc/mail/sendmail.cf
.el .It Pa /etc/sendmail.cf
デフォルトの
.Nm sendmail
.Dq cf
ファイル
.ie \nP .It Pa /etc/mail/statistics
.el .It Pa /var/log/sendmail.st
デフォルトの
.Nm sendmail
統計情報ファイル
.El
.Sh 関連項目
.Xr mailq 1 ,
.Xr sendmail 8
