freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mailstats.8
.\"/*
.\" * Copyright (c) 1996 John M. Vinopal
.\" * All rights reserved.
.\" *
.\" * Redistribution and use in source and binary forms, with or without
.\" * modification, are permitted provided that the following conditions
.\" * are met:
.\" * 1. Redistributions of source code must retain the above copyright
.\" *    notice, this list of conditions and the following disclaimer.
.\" * 2. Redistributions in binary form must reproduce the above copyright
.\" *    notice, this list of conditions and the following disclaimer in the
.\" *    documentation and/or other materials provided with the distribution.
.\" * 3. All advertising materials mentioning features or use of this software
.\" *    must display the following acknowledgement:
.\" *	This product includes software developed for the NetBSD Project
.\" *	by John M. Vinopal.
.\" * 4. The name of the author may not be used to endorse or promote products
.\" *    derived from this software without specific prior written permission.
.\" *
.\" * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" * IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" * SUCH DAMAGE.
.\" */
.\"	%Id: mailstats.8,v 1.2.2.4 1997/11/10 03:00:05 peter Exp %
.\" jpman %Id: mailstats.8,v 1.2 1997/05/21 07:42:38 yugawa Stab %
.Dd August 13, 1996
.Dt MAILSTATS 8
.Os
.Sh 名称
.Nm mailstats
.Nd sendmail の利用統計を表示する
.Sh 書式
.Nm mailstats
.Op Fl o
.Op Fl C Ar sendmail.cf
.Op Fl f Ar sendmail.st
.Sh 解説
.Nm mailstats
は、sendmail を利用したメッセージのサイズなどの
統計情報をメーラ毎に表示します。
出力の各行は、
.Fl o
フラグが指定された場合を除き、
メーラ番号、受け取ったメール数、受け取ったバイト数、
送ったメール数、送ったバイト数、メーラの種類から構成されています。
メーラの一般的な物には smtp や local (例えば、
.Nm mail.local
等のローカルに配送されるメールを処理するプログラム) があります。
.Pp
統計情報は
.Nm sendmail
統計ファイル
.Ar sendmail.st
から読み込まれます。
.Ar sendmail.st
の場所は
.Ar sendmail.cf
で定義されていますが、
.Fl f
フラグで指定することもできます。
同様に、メーラの種類も
.Ar sendmail.cf
で定義されています。統計情報は、累積されていきます。情報をリセットするには
統計ファイルの内容を消す必要があります。
.Sh 関連ファイル
.Bl -tag -width /var/log/sendmail.st -compact
.It Pa /etc/sendmail.cf
sendmail 設定ファイル
.It Pa /var/log/sendmail.st
メール統計情報データベース
.El
.Sh 関連項目
.Xr mail.local 8 ,
.Xr sendmail 8
