freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mail.local.8
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)mail.local.8	8.2 (Berkeley) 12/11/93
.\"	%Id: mail.local.8,v 1.4 1996/09/22 21:54:05 wosch Exp %
.\" jpman %Id: mail.local.8,v 1.2 1997/03/31 13:35:26 horikawa Stab %
.\"
.Dd December 11, 1993
.Dt MAIL.LOCAL 8
.Os
.Sh 名称
.Nm mail.local
.Nd メールボックスにメールを格納する
.Sh 書式
.Nm mail.local
.Op Fl f Ar from
.Op Fl b
.Ar user ...
.Sh 解説
.Nm mail.local
は EOF がくるまで標準入力から読み込みを行い、
それらを各
.Ar user
の
.Pa mail
ファイルに追加します。
.Ar user
は、有効なユーザ名でなければなりません。
.Pp
オプション:
.Bl -tag -width xxxfrom
.It Fl f Ar from
送り手の名前を指定します。
.It Fl b
.Dq biff
サービスに通知する事をやめます。
.El
.Pp
メールボックスのなかの個々のメッセージは、
空行に続く
``From ''
という文字列からはじまる行によって区切られます。
``From'' という文字列、送り手 (sender) の名前、
時刻 (time stamp) を含む行が配送されたメールそれぞれに
付加されます。
空行がそれぞれのメッセージに追加されます。
大なり記号
(``>'') は ``From '' によって誤って別のメッセージとして処理
される可能性のある行の行頭に付加されます。
.Pp
メールファイルはメールが追加されている間は
.Xr flock 2
によって排他的にロックされます。
.Pp
.Xr getservbyname 3
が ``biff'' を返すと、
biff サーバにメールの配送が伝えられます。
.Pp
.Nm mail.local
は成功すれば 0 を、失敗すれば 0 より大きな値を返します。
.Sh 環境変数
.Bl -tag -width indent
.It Ev TZ
タイムスタンプを記録する際に適切なタイムゾーンを設定します。
.El
.Sh 関連ファイル
.Bl -tag -width /tmp/local.XXXXXX -compact
.It Pa /tmp/local.XXXXXX
テンポラリファイル
.It Pa /var/mail/user
ユーザのメールボックスディレクトリ
.El
.Sh 関連項目
.Xr mail 1 ,
.Xr flock 2 ,
.Xr getservbyname 3 ,
.Xr comsat 8 ,
.Xr sendmail 8
.Sh 歴史
スーパセットの
.Nm mail.local
(メールボックスを読む際、配送時と同様に扱います) は
.At v7
から、
.Nm mail
として現れました。
