freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mail.local.8
.\" Copyright (c) 1998-2001, 2003 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	$Id: mail.local.8,v 1.15 2004-10-10 08:30:48 metal Exp $
.\"
.\" $FreeBSD$
.\"
.TH MAIL.LOCAL 8 "$Date: 2004-10-10 08:30:48 $"
.SH 名称
.B mail.local
\- メールボックスにメールを格納する
.SH 書式
.B mail.local
.RB [ \-7 "] [" \-B "] [" \-b "] [" \-d "] [" \-D
.IR mbdb ]
.RB [ \-l "] [" \-s "] [" \-f 
\fIfrom\fR|\fB\-r\fR
.IR from ]
.RB [ \-h
\fIfilename\fR ]
.I "user ..."
.SH 解説
.B mail.local
は EOF がくるまで標準入力から読み込みを行い、
それらを各
.I user
の
.B mail
ファイルに追加します。
.I user
は、有効なユーザ名でなければなりません。
.PP
オプション:
.TP 1i
.B \-7
LMTP モードにおいて 8BITMIME サポートを通知しません。
.TP
.B \-B
.B biff
サービスに通知する事をやめます。
.TP
.B \-b
メールボックスが制限を越えた場合に、
一時的なエラーを返すのではなく永続的なエラーを返します。
.TP
.B \-d
これが配送であることを指定します (後方互換性のためです)。
本オプションは無効果です。
.TP 
.BI \-D " mbdb"
ローカルの受信者名の検索に使用される、
メールボックスデータベースの名前を指定します。
本オプションのデフォルトは "pw" であり、
これは getpwnam() を使用することを意味します。
.TP
.BI \-f " from"
送信者名を指定します。
.TP
.B \-l
LMTP モードをオンにします。
.TP
.B \-s
.B success
状態を返す前にメールボックスをディスクにコミットするために使用する、
fsync(2)
呼び出しを無効にします。
.TP
.BI \-r " from"
送信者名を指定します (後方互換性のためです)。
\-f と同じです。
.TP
.BI \-h " filename"
入って来るメールを、システムのメールスプールディレクトリではなく、
ユーザホームディレクトリの \fIfilename\fR に格納します。
.PP
以下のオプションは
.B mail.local
が -DHASHSPOOL 付きでコンパイルされている場合にのみ指定可能です。
.TP
.BI \-H " hashtypehashdepth"
ハッシュされたメールディレクトリを選択します。
有効なハッシュの型は
ユーザ名の
.B u
と MD5 の
.B m
(-DHASHSPOOLMD5 を付けてコンパイルする必要があります) です。
例:
.BI \-H " u2"
は、深さ 2 でのユーザ名でのハッシュを選択します。
注: ハッシュの型と深さの間に空白があってはいけません。
.TP
.BI \-p " path"
代わりのメールスプールのパスを指定します。
.TP
.BI \-n
LMTP モードで受信者のアドレスのドメイン部分を削除しないように指定します。
.PP
メールボックスのなかの個々のメッセージは、
空行に続く
``From ''
という文字列からはじまる行によって区切られます。
``From ''、 送り手 (sender) の名前、
時刻 (time stamp) を含む行が配送された各メッセージの前に
付加されます。
メッセージのあとには空行が追加されます。
メッセージ中に ``From '' デリミタ行と勘違いされそうな行があったときには
(つまり、空白行に続いて ``From '' の 5 文字があったとき)
大なり記号 (``>'') がそれらの行頭に付加されます。
.PP
メールファイルはメールが追加されている間は
flock(2)
によって排他的にロックされます。
メールボックスがロックされている間、
.B user.lock
が作成されますが、これは古い MUA との互換性のためです。
.PP
getservbyname(3)
が ``biff'' を返すと、
biff サーバにメールの配送が伝えられます。
.PP
.B mail.local
は成功すれば 0 を、失敗すれば 0 より大きな値を返します。
.SH 環境変数
.IP TZ
タイムスタンプを記録する際に適切なタイムゾーンを設定します。
.SH 関連ファイル
.PD 0.2v
.TP 2.2i
/tmp/local.XXXXXX
テンポラリファイル
.TP
/var/mail/user
ユーザのデフォルトのメールボックスディレクトリ
.TP
/var/mail/user.lock
ユーザのデフォルトのメールボックスロックファイル
.PD
.SH 関連項目
mail(1),
flock(2),
getservbyname(3),
comsat(8),
sendmail(8)
.SH 警告
.B mail.local
は、空行に続く "^From " 行のみをエスケープします。
"From " で開始するすべての行をエスケープすべき場合には、
sendmail.cf ファイル中のローカルメーラ用 'E'フラグを使用してください。
.SH 歴史
.B mail.local
のスーパセット
(メールを配送するだけでなく、メールボックスを読むこともできます) は
Version 7 AT&T UNIX
から、
.B mail
として現れました。
.\" %FreeBSD: src/contrib/sendmail/mail.local/mail.local.8,v 1.13 2004/08/01 01:16:15 gshapiro Exp %
