freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mail.local.8
.\" Copyright (c) 1998 Sendmail, Inc.  All rights reserved.
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	@(#)mail.local.8	8.7 (Berkeley) 5/19/1998
.\" jpman %Id: mail.local.8,v 1.2 1997/03/31 13:35:26 horikawa Stab %
.\"
.Dd May 19, 1998
.Dt MAIL.LOCAL 8
.Os
.Sh 名称
.Nm mail.local
.Nd メールボックスにメールを格納する
.Sh 書式
.Nm mail.local
.Op Fl f Ar from
.Op Fl b
.Op Fl s
.Ar user ...
.Sh 解説
.Nm mail.local
は EOF がくるまで標準入力から読み込みを行い、
それらを各
.Ar user
の
.Pa mail
ファイルに追加します。
.Ar user
は、有効なユーザ名でなければなりません。
.Pp
オプション:
.Bl -tag -width xxxfrom
.It Fl f Ar from
送り手の名前を指定します。
.It Fl b
.Dq biff
サービスに通知する事をやめます。
.It Fl s
.Dq success
状態を返す前にメールボックスをディスクにコミットするために使用する、
.Xr fsync 2
呼び出しを無効にします。
.El
.Pp
メールボックスのなかの個々のメッセージは、
空行に続く
``From ''
という文字列からはじまる行によって区切られます。
``From'' という文字列、送り手 (sender) の名前、
時刻 (time stamp) を含む行が配送されたメールそれぞれに
付加されます。
空行がそれぞれのメッセージに追加されます。
大なり記号
(``>'') は ``From '' によって誤って別のメッセージとして処理
される可能性のある行の行頭に付加されます
(それは、空白行に続く行で ``From '' という 5 文字で始まる行です)。
.Pp
メールファイルはメールが追加されている間は
.Xr flock 2
によって排他的にロックされます。
メールボックスがロックされている間、
.Pa user.lock
が作成されますが、これは古い MUA との互換性のためです。
.Pp
.Xr getservbyname 3
が ``biff'' を返すと、
biff サーバにメールの配送が伝えられます。
.Pp
.Nm mail.local
は成功すれば 0 を、失敗すれば 0 より大きな値を返します。
.Sh 環境変数
.Bl -tag -width indent
.It Ev TZ
タイムスタンプを記録する際に適切なタイムゾーンを設定します。
.El
.Sh 関連ファイル
.Bl -tag -width /tmp/local.XXXXXX -compact
.It Pa /tmp/local.XXXXXX
テンポラリファイル
.It Pa /var/mail/user
ユーザのメールボックスディレクトリ
.It Pa /var/mail/user.lock
ユーザメールボックスのロックファイル
.El
.Sh 関連項目
.Xr mail 1 ,
.Xr flock 2 ,
.Xr getservbyname 3 ,
.Xr comsat 8 ,
.Xr sendmail 8
.Sh 歴史
スーパセットの
.Nm mail.local
(メールボックスを読む際、配送時と同様に扱います) は
.At v7
から、
.Nm mail
として現れました。
