freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mailstats.8
.\" Copyright (c) 1998-2002 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	$Id: mailstats.8,v 8.30 2002/04/12 00:42:33 ca Exp %
.\"
.\" $FreeBSD$
.TH MAILSTATS 8 "$Date: 2002-07-21 05:44:33 $"
.SH 名称
.B mailstats
\- メールの統計情報を表示する
.SH 書式
.B mailstats
.RB [ \-c "] [" \-o "] [" \-p "] [" \-P ]
.RB [ \-C
.IR cffile ]
.RB [ \-f
.IR stfile ]
.SH 解説
.B mailstats
は、現在のメールの統計情報を表示します。
.PP
まず、統計が開始された時刻が
ctime(3)
で指定されるフォーマットで表示されます。
次に、各メーラの状態が 1 行で表示されます。
それぞれ空白で区切られた次のフィールドからなります:
.sp
.RS
.PD 0.2v
.TP 1.2i
.B M
メーラ番号。
.TP
.B msgsfr
メーラからのメッセージ数。
.TP
.B bytes_from
メーラからのキロバイト数。
.TP
.B msgsto
メーラへのメッセージ数。
.TP
.B bytes_to
メーラへのキロバイト数。
.TP
.B msgsrej
(check_* ルールセットによって) 拒否されたメッセージ数。
.TP
.B msgsdis
(check_* ルールセットによって) 捨てられたメッセージ数。
.TP
.B Mailer
メーラ名。
.PD
.RE
.PP
この表示の後、
すべてのメーラの総計行が表示されます (前に ``T'' が付きます)。
これらは、等号
(``='')
文字のみからなる行によりその前の情報と分けられます。
文字 ``C'' が前に付く他の行は、TCP 接続数を示します。
.PP
オプションは以下の通りです:
.TP
.B \-C
デフォルトの
.B sendmail
設定
ファイルの代りに指定されたファイルを読みます。
.TP
.B \-c
デフォルトの
.B sendmail
設定ファイルの代りに submit.cf を使用します。
.TP
.B \-f
.B sendmail
設定
ファイルで指定されている統計情報ファイルの代りに、
指定された統計情報ファイルを読みます。
.TP
.B \-P
プログラムが読み取る形式で情報を出力しますが、統計情報をクリアしません。
.TP
.B \-p
プログラムが読み取る形式で情報を出力し、統計情報をクリアします。
.TP
.B \-o
出力においてメーラ名を表示しません。
.PP
.B mailstats
は成功時には 0 で、エラー時には >0 で終了します。
.SH 関連ファイル
.PD 0.2v
.TP 2.5i
/etc/mail/sendmail.cf
デフォルトの
.B sendmail
設定
ファイル
.TP
/etc/mail/statistics
デフォルトの
.B sendmail
統計情報ファイル
.PD
.SH 関連項目
mailq(1),
sendmail(8)
