freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mail.local.8
.\" Copyright (c) 1998, 1999 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	%Id: mail.local.8,v 8.14 1999/08/26 15:49:20 ca Exp %
.\"
.\" %FreeBSD: src/contrib/sendmail/mail.local/mail.local.8,v 1.5.6.1 2000/08/27 17:31:19 gshapiro Exp %
.\"
.\" jpman %Id: mail.local.8,v 1.2 1997/03/31 13:35:26 horikawa Stab %
.\"
.TH MAIL.LOCAL 8 "%Date: 1999/08/26 15:49:20 %"
.SH 名称
.B mail.local
\- メールボックスにメールを格納する
.SH 書式
.B mail.local
.RB [ \-7 "] [" \-B "] [" \-d "] [" \-l "] [" \-s "] [" \-f 
.IR from "] " "user ..."
.SH 解説
.B mail.local
は EOF がくるまで標準入力から読み込みを行い、
それらを各
.I user
の
.B mail
ファイルに追加します。
.I user
は、有効なユーザ名でなければなりません。
.PP
オプション:
.TP 1i
.B \-7
LMTP モードにおいて 8BITMIME サポートを通知しません。
.TP 
.B \-B
.B biff
サービスに通知する事をやめます。
.TP 
.B \-b
メールボックスが制限を越えた場合に、
一時的なエラーを返すのではなく永続的なエラーを返します。
.TP 
.B \-d
これが配送であることを指定します (後方互換性のためです)。
.TP 
.BI \-f " from"
送信者名を指定します。
.TP
.B \-l
LMTP モードをオンにします。
.TP
.B \-s
.B success
状態を返す前にメールボックスをディスクにコミットするために使用する、
fsync(2)
呼び出しを無効にします。
.TP 
.BI \-r " from"
送信者名を指定します (後方互換性のためです)。
.PP
メールボックスのなかの個々のメッセージは、
空行に続く
``From ''
という文字列からはじまる行によって区切られます。
``From'' 、送り手 (sender) の名前、
時刻 (time stamp) を含む行が配送された各メッセージの前に
付加されます。
メッセージのあとには空行が追加されます。
メッセージ中に ``From '' デリミタ行と勘違いされそうな行があったときには
(つまり、空白行に続いて ``From '' の 5 文字があったとき)
大なり記号 (``>'') がそれらの行頭に付加されます。
.PP
メールファイルはメールが追加されている間は
flock(2)
によって排他的にロックされます。
メールボックスがロックされている間、
.B user.lock
が作成されますが、これは古い MUA との互換性のためです。
.PP
getservbyname(3)
が ``biff'' を返すと、
biff サーバにメールの配送が伝えられます。
.PP
.B mail.local
は成功すれば 0 を、失敗すれば 0 より大きな値を返します。
.SH 環境変数
.IP TZ
タイムスタンプを記録する際に適切なタイムゾーンを設定します。
.SH 関連ファイル
.PD 0.2v
.TP 2.2i
/tmp/local.XXXXXX
テンポラリファイル
.TP
/var/mail/user
ユーザのメールボックスディレクトリ
.TP
/var/mail/user.lock
ユーザメールボックスのロックファイル
.PD
.SH 関連項目
mail(1),
flock(2),
getservbyname(3),
comsat(8),
sendmail(8)
.SH 歴史
.B mail.local
のスーパセット
(メールを配送するだけでなく、メールボックスを読むこともできます) は
Version 7 AT&T UNIX 
から、
.B mail
として現れました。
