freebsd/freebsd-doc/ja_JP.eucJP/man/man8/MAKEDEV.8
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)MAKEDEV.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/share/man/man8/man8.i386/MAKEDEV.8,v 1.10.2.3 1999/09/22 21:45:48 phantom Exp %
.\"
.\" jpman %Id: MAKEDEV.8,v 1.3 1997/07/22 09:19:04 mutoh Stab %
.Dd June 5, 1993
.Dt MAKEDEV 8 i386
.Os
.Sh 名称
.Nm MAKEDEV
.Nd システムとデバイス特殊ファイルの作成
.Sh 書式
.Nm
name ...
.Sh 解説
このシェルスクリプト
.Nm
は、
.Pa /dev
ディレクトリにあり、通常の特殊ファイルを作成するのに
使われます。
特殊ファイルに関するより徹底した議論が必要ならば、
.Xr intro 4
をご覧ください。
.Pp
.Nm
は、何個かのデバイス名を引数に取ります。
ここでのデバイス名は、デバイスに対する、よくある省略形です。
.Dq std
と
.Dq local
という、二つの特殊デバイスがあります。
前者はそのアーキテクチャの標準デバイスを作成します。
後者はローカルサイトの固有のデバイスの為のもので、
シェルファイル
.Dq MAKEDEV.local
を実行します。
.Pp
i386 アーキテクチャでは次のデバイスをサポートします。
ここで、ハッシュ記号 (
.Dq #
) を伴ったデバイス名は、
ハッシュ記号をユニット番号で置き換えます。
.Bl -tag -width indent
.It std
標準デバイス (console, drum, fd/*, klog, kmem, mem, null,
stderr, stdin, stdout, tty) です。
.It local
コンフィギュレーション固有のデバイスです。
.It tty#
標準 PC COM ポートです。
.It fd#
.Dq フロッピ
ディスクドライブ (3 1/2, 5 1/4) です。
.It pty#
32 対の仮想端末マスタとスレーブです。
.It da#
SCSI ディスクドライブです。
.It sa#
SCSI テープドライブです。
.It vty#
syscons/pcvt/codrv のための 12 の仮想コンソールの組です。
.It wd#
.Dq ウィンチェスタ
ディスクドライブ (ST506, IDE, ESDI, RLL など) です。
.It wt#
QIC-インタフェースの (つまり、SCSI ではない) 3M カートリッジテープです。
.El
.Sh 関連ファイル
.Bl -tag -width /dev/xxxx -compact
.It Pa /dev
特殊ファイルのディレクトリ
.Sh 関連項目
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
