freebsd/freebsd-doc/ja_JP.eucJP/man/man8/makewhatis.local.8
.\" Copyright (c) April 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/gnu/usr.bin/man/makewhatis/makewhatis.local.8,v 1.8.2.3 2001/08/16 10:14:57 ru Exp %
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/makewhatis.local.8,v 1.6 2001/05/14 01:09:50 horikawa Exp $
.Dd April 26, 1996
.Dt MAKEWHATIS.LOCAL 8
.Os
.Sh 名称
.Nm makewhatis.local , catman.local
.Nd ローカルファイルシステムに対して makewhatis または catman を開始する
.Sh 書式
.Nm /usr/libexec/makewhatis.local
.Op options
.Ar directories ...
.Nm /usr/libexec/catman.local
.Op options
.Ar directories ...
.Sh 解説
.Nm
は
.Xr makewhatis 1
を開始しますが、
.Nm
が実行されるシステムに物理的にマウントされているファイルシステムだけを
対象とします。
読み書き可能な NFS マウントされた /usr ディレクトリに対し
.Pa periodic weekly
から makewhatis を起動すると NFS サーバを殺してしまうでしょう --
すべての NFS クライアントが makewhatis を同時に開始してしまうからです!
ですから、
.Xr cron 8
へのラッパにこのプログラムを使用し、直接 makewhatis を呼ばないで下さい。
.Nm catman.local
は
.Nm
と同様の目的で使用されますが、
.Xr catman 1
用です。
.Sh 関連ファイル
.Bl -tag -width /etc/periodic/weekly/320.whatis.XXX -compact
.It Pa /etc/periodic/weekly/320.whatis
毎週
.Nm
を実行します。
.It Pa /etc/periodic/weekly/330.catman
毎週
.Nm catman.local
を実行します。
.El
.Sh 関連項目
.Xr catman 1 ,
.Xr find 1 ,
.Xr makewhatis 1 ,
.Xr cron 8 ,
.Xr periodic 8
.Sh 歴史
.Nm
コマンドは
.Fx 2.2
から登場しました。
