freebsd/freebsd-doc/ja_JP.eucJP/man/man8/makemap.8
.\" Copyright (c) 1998-2000 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     %Id: makemap.8,v 8.21.16.5 2000/12/29 18:12:20 gshapiro Exp %
.\"
.\" jpman %Id: makemap.8,v 1.3 1997/07/26 21:58:03 horikawa Stab %
.\" Original Revision: 1.1.1.2.6.2
.TH MAKEMAP 8 "November 16, 1992"
.SH 名称
.B makemap
\- sendmail 用のデータベースマップを作成する
.SH 書式
.B makemap
.RB [ \-C
.IR file ]
.RB [ \-N ]
.RB [ \-c
.IR cachesize ]
.RB [ \-d ]
.RB [ \-e ]
.RB [ \-f ]
.RB [ \-l ]
.RB [ \-o ]
.RB [ \-r ]
.RB [ \-s ]
.RB [ \-u ]
.RB [ \-v ]
.I 
maptype mapnam
.SH 解説
.B makemap
は、
sendmail(8)
がキー付きマップを検索する際に用いるデータベースマップを作成します。
これは標準入力から読み込みを行い、指定された
.I mapname
に出力を行います。
.PP
コンパイル方法に依存しますが、
.B makemap
は最大 3 種類のデータベースフォーマットを扱います。
扱うフォーマットは
.I maptype
で指定します。
.I maptype
には、以下のようなものがあります。
.PP
.TP
dbm
DBM
フォーマットマップ。
ndbm(3)
ライブラリが必要です。
.TP
btree
B-Treeフォーマットマップ。
新しい Berkeley DB
ライブラリが必要です。
.TP
hash
ハッシュフォーマットマップ。
同じく
Berkeley DB
ライブラリが必要です。
.PP
すべてのフォーマットで、
.B makemap
は標準入力から空白文字で区切られた 2 つの単語を読み込みます。
最初の単語はデータベースキーで、2番目の単語がその値です。
値が
``%\fIn\fP''
(n は数字) という文字列を含んでいると、sendmail がパラメータ置換を行います。
``%'' という文字を含めるには、``%%'' とする必要があります。
空行や ``#'' から始まる行は無視されます。
.PP
.I TrustedUser
オプションが sendmail の設定ファイル中で設定されており、
.B makemap
が root に起動された場合、生成されたファイルは指定された
.IR TrustedUser
の所有となります。
.PP
.SS フラグ
.TP
.B \-C
TrustedUser オプションを見付けるために、
指定した
.B sendmail
設定ファイルを使用します。
.TP
.B \-N
文字列の終端記号として、ヌル文字もマップに含めます。
これは、sendmail.cf の ``K'' 行における \-N フラグと一致していなければ
なりません。
.TP
.B \-c
指定したハッシュと B-Tree キャッシュサイズを使用します。
.TP
.B \-d
マップ中に重複するキーが存在することを許します。
B-Treeフォーマットマップでのみ可能です。
2 つの同じキーが読まれた場合、両方ともマップに挿入されます。
.TP
.B \-e
空の値を許します (右側の値)。
.TP
.B \-f
通常、キーのなかのすべての大文字は、
すべて小文字として記録されますが、
このフラグを指定することによってこの動作を行わないように指定できます。
これは、sendmail.cf 中の
.B K
行における
\-f フラグと一致していなければなりません。
.TP
.B \-l
サポートされているマップタイプを列挙します。
.TP
.B \-o
すでにあるファイルに追加が行われます。
すでに存在するファイルを引数として指定することができます。
.TP
.B \-r
すでに存在しているキーを置き換えます。
通常はすでに入力したキーをさらに繰り返して入力しても、
.B makemap
は警告を出力し、データベースには取り込みません。
.TP
.B \-s
生成されるマップの安全チェックを無視します。
これには、
だれでも書き込めるディレクトリへのハードリンクおよびシンボリックのチェックも
含まれます。
.TP
.B \-u
データベースの内容を、標準出力へダンプ (アンマップ) します。
.TP
.B \-v
処理の内容を詳細に表示します。
.SH 関連項目
sendmail(8)
.SH 歴史
.B makemap
コマンドは
4.4BSD
から登場しました。
