freebsd/freebsd-doc/ja_JP.eucJP/man/man8/makekey.8
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)makekey.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/libexec/makekey/makekey.8,v 1.9.2.1 2000/12/08 13:52:29 ru Exp %
.\" $FreeBSD$
.\"
.Dd December 11, 1993
.Dt MAKEKEY 8
.Os
.Sh 名称
.Nm makekey
.Nd 暗号キーやパスワードを作成する
.Sh 書式
.Nm
.Sh 解説
.Nm
は標準入力から読み込んだキーと隠しキー (salt) を暗号化し、
結果を標準出力へ書き込みます。
キーは 8 バイト、隠しキーは 2 バイトであることが期待されます。
キーと隠しキーはどんな文字を含んでよいか、
どうやって暗号化計算が行なわれるか、の詳しい情報は
.Xr crypt 3
を参照のこと。
.Sh 関連項目
.Xr login 1 ,
.Xr crypt 3
.Sh 歴史
.Nm
コマンドは
.At v7
から登場しました。
