freebsd/freebsd-doc/ja_JP.eucJP/man/man8/manctl.8
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/manctl/manctl.8,v 1.9 1999/11/27 17:15:51 charnier Exp %
.\" jpman %Id: manctl.8,v 1.3 1997/08/16 13:22:57 horikawa Stab %
.Dd January 1, 1996
.Dt MANCTL 8
.Os FreeBSD
.Sh 名称
.Nm manctl
.Nd マニュアルページの取り扱い
.Sh 書式
.Nm manctl
.Op Fl compress
.Op Fl uncompress
.Op Fl purge
.Op Fl help
.Ar path ...
.Sh 解説
.Nm manctl
はディレクトリパスにあるマニュアルページを圧縮あるいは圧縮解凍します。
可能なら、.so マクロはハードリンクで置き換えられます。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.Bl -tag -width -indent
.It Fl help
オプション一覧を表示して終了します。
.It Fl compress
非圧縮マニュアルページを圧縮します(.so は除去します)。
.It Fl uncompress
圧縮マニュアルページを解凍します。
.It Fl purge
フォーマット済の古いマニュアルページを一掃します(未実装)。
.El
.Sh 関連項目
.Xr catman 1 ,
.Xr man 1
