freebsd/freebsd-doc/ja_JP.eucJP/man/man8/map-mbone.8
.TH MAP-MBONE 8
.\" jpman %Id: map-mbone.8,v 1.2 1997/06/06 10:31:25 bobson Stab %
.UC 5
.SH 名称
map-mbone \- マルチキャストコネクションマップを表示する
.SH 書式
.B /usr/sbin/map-mbone
[
.B \-d
.I debug_level
] [
.B \-f 
] [
.B \-g 
] [
.B \-n 
] [
.B \-r 
.I retry_count
] [
.B \-t 
.I timeout_count
] [
.B starting_router
]
.SH 解説
.I map-mbone
は、
.I starting_router
で指定したマルチキャストルータから到達可能なすべてのマルチキャストルータに
ついて表示します。
コマンドラインに何の指定もない場合、デフォルトのマルチキャストルータ
.I starting_router
は、ローカルホスト(localhost)になります。
.PP
.I map-mbone
は、ASK_NEIGHBORS IGMP メッセージを送信することで、
隣接するマルチキャストルータのデータ取得を行ないます。
指定したマルチキャストルータからの応答があった場合には、
その応答の中にあるバージョン番号と隣接するマルチキャストルータのアドレス一覧が
出力されます。応答したルータが、
最新のマルチキャストバージョン番号を持つ場合には、
.I map-mbone
は、そのルータに対してメトリック、スレッショルド、フラグのような追加情報を
要求します。
隣接するマルチキャストルータに新たな事象が発生し、フルーディングオプションが
使用可能な場合、
.I map-mbone
は、隣接するそれらのマルチキャストルータそれぞれに対して新たな情報を求めます。
また、マルチキャストルータの検索は、マルチキャストルータが
それ以上みつからないという状態になるまで継続します。
.br
.ne 5
.SH オプション
.PP
"\-d" オプションは、デバッグレベルを設定します。デバッグレベルが
デフォルトレベルである 0 よりも大きい場合、追加デバッグメッセージが画面に
出力されます。デバッグレベルにかかわらず、エラーについてはエラーメッセージが
出力され、
.I map-mbone
は終了します。
デバッグレベルが 0 でない場合、以下の効果があります。
.IP "level 1"
パケットの警告が標準エラー出力に対して出力されます。
.IP "level 2"
すべてのレベル 1 のメッセージに加えて、ネットワークダウンの情報が
標準エラー出力に対して出力されます。
.IP "level 3"
すべてのレベル 2 のメッセージに加えて、すべてのパケットタイムアウトの情報が
標準エラー出力に対して出力されます。
.PP
"\-f" オプションは、フルーディングオプションを設定します。フルーディング
オプションを有効にすることで、再帰的に隣接するマルチキャストルータを検索
することを許可します。そして、starting_router が指定されない場合には、
このオプションはデフォルトでは有効になっています。
.PP
"\-g" オプションは、GraphEdフォーマットにしたがったグラフ出力を有効にします。
.PP
"\-n" オプションは、マルチキャストルータの名前の検索に DNS を使わないように
設定します。
.PP
"\-r retry_count" オプションは、隣接ルータに対するリトライ制限を設定します。
デフォルトではリトライ回数は 1 です。
.PP
"\-t timeout_count" オプションは、リトライ間隔を秒単位で設定します。
デフォルトのリトライ間隔は 2 秒です。
.PP
.SH 注意
.I map-mbone
は root のみ実行可能です。
.PP
.SH 関連項目
.BR mrouted (8) ,
.BR mrinfo (8) ,
.BR mtrace (8)
.PP
.SH 作者
Pavel Curtis
