freebsd/freebsd-doc/ja_JP.eucJP/man/man8/map-mbone.8
.\" %FreeBSD: src/usr.sbin/mrouted/map-mbone.8,v 1.11 2002/07/14 14:44:24 charnier Exp %
.\"
.\" $FreeBSD$
.Dd May 8, 1995
.Dt MAP-MBONE 8
.Os
.Sh 名称
.Nm map-mbone
.Nd マルチキャストコネクションマッパ
.Sh 書式
.Nm
.Op Fl d Ar debug_level
.Op Fl f
.Op Fl g
.Op Fl n
.Op Fl r Ar retry_count
.Op Fl t Ar timeout_count
.Op Ar starting_router
.Sh 解説
.Nm
ユーティリティは、
.Ar starting_router
で指定したマルチキャストルータから到達可能なすべてのマルチキャストルータに
ついて表示します。
コマンドラインに何の指定もない場合、デフォルトのマルチキャストルータ
.Ar starting_router
は、ローカルホスト(localhost)になります。
.Pp
.Nm
ユーティリティは、ASK_NEIGHBORS IGMP メッセージを送信することで、
隣接するマルチキャストルータのデータ取得を行ないます。
指定したマルチキャストルータからの応答があった場合には、
その応答の中にあるバージョン番号と隣接するマルチキャストルータのアドレス一覧が
出力されます。応答したルータが、
最新のマルチキャストバージョン番号を持つ場合には、
.Nm
は、そのルータに対してメトリック、スレッショルド、フラグのような追加情報を
要求します。
隣接するマルチキャストルータに新たな事象が発生し、フルーディングオプションが
使用可能な場合、
.Nm
は、隣接するそれらのマルチキャストルータそれぞれに対して新たな情報を求めます。
また、マルチキャストルータの検索は、マルチキャストルータが
それ以上みつからないという状態になるまで継続します。
以下のオプションを使用可能です。
.Bl -tag -width indent
.It Fl d
デバッグレベルを設定します。デバッグレベルが
デフォルトレベルである 0 よりも大きい場合、追加デバッグメッセージが画面に
出力されます。デバッグレベルにかかわらず、エラーについてはエラーメッセージが
出力され、
.Nm
は終了します。
デバッグレベルが 0 でない場合、以下の効果があります。
.Bl -tag -width indent
.It "level 1"
パケットの警告が標準エラー出力に対して出力されます。
.It "level 2"
すべてのレベル 1 のメッセージに加えて、ネットワークダウンの情報が
標準エラー出力に対して出力されます。
.It "level 3"
すべてのレベル 2 のメッセージに加えて、すべてのパケットタイムアウトの情報が
標準エラー出力に対して出力されます。
.El
.It Fl f
フルーディングオプションを設定します。フルーディング
オプションを有効にすることで、再帰的に隣接するマルチキャストルータを検索
することを許可します。そして、starting_router が指定されない場合には、
このオプションはデフォルトでは有効になっています。
.It Fl g
GraphEdフォーマットにしたがったグラフ出力を有効にします。
.It Fl n
マルチキャストルータの名前の検索に DNS を使わないように
設定します。
.It Fl r Ar retry_count
隣接ルータに対するリトライ制限を設定します。
デフォルトではリトライ回数は 1 です。
.It Fl t Ar timeout_count
リトライ間隔を秒単位で設定します。
デフォルトのリトライ間隔は 2 秒です。
.El
.Sh 注意
.Nm
ユーティリティは root のみ実行可能です。
.Sh 関連項目
.Xr mrinfo 8 ,
.Xr mrouted 8 ,
.Xr mtrace 8
.Sh 作者
.An Pavel Curtis
