freebsd/freebsd-doc/ja_JP.eucJP/man/man8/memcontrol.8
.\" Copyright (c) 1999 Chris Costello
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/memcontrol/memcontrol.8,v 1.3.2.2 2001/07/22 12:41:12 dd Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/memcontrol.8,v 1.5 2001/05/14 01:09:50 horikawa Exp $
.Dd September 28, 1999
.Dt MEMCONTROL 8
.Os FreeBSD
.Sh 名称
.Nm memcontrol
.Nd "メモリに応じたシステムキャッシュの挙動の制御"
.Sh 書式
.Nm
.Ar list
.Op Fl a
.Pp
.Nm
.Ar set
.Fl b Ar base
.Fl l Ar length
.Fl o Ar owner
.Ar attribute
.Pp
.Nm
.Ar clear
.Fl o Ar owner
.Pp
.Nm
.Ar clear
.Fl b Ar base
.Fl l Ar length
.Sh 解説
サポートしている多くのシステムアーキテクチャは、
書き込まれるメモリ領域に応じて異なる振舞いをするように、
CPU キャッシュをプログラム可能です。
.Pp
.Nm
はこの機構に対するインタフェースを提供し、
システムの物理メモリの範囲ごとに、
CPU キャッシュの挙動を変更可能とします。
.Pp
この範囲というのは、普通は大きさも境界も 2 のべき乗になっていますが、
その配置を決めるルールはアーキテクチャによって様々です。
.Nm
プログラムはこのルールを強要しようとはしませんが、
間違った組合せを設定しようとすればシステムが拒絶するでしょう。
.Bl -tag -width clear
.It Ar list
メモリ範囲を一覧します。
.Bl -tag -width xxxxxx
.It Op Fl a
たとえ無効であっても、全てのメモリ範囲を一覧します
.El
.It Ar set
メモリ範囲の属性を設定します。
.Bl -tag -width xxxxxx
.It Fl b Ar base
メモリ範囲の開始アドレス
.It Fl l Ar length
メモリ範囲のバイト単位の長さ (2 のべき乗で)
.It Fl o Ar owner
この設定を示す owner 識別テキスト (最大 7 文字)
.\" owner は原文にはない
.It Ar attribute
このメモリ範囲に適用する属性。
.Ar uncacheable
.Ar write-combine
.Ar write-through
.Ar write-back
.Ar write-protect
の内の 1 つ
.El
.It Ar clear
メモリ範囲の属性を消去します。
owner を指定するか、開始アドレス/長さの組合せを指定して消去します。
.Pp
owner に基づいて消去する場合:
.Bl -tag -width xxxxxx
.It Fl o Ar owner
この owner に所属する全てのメモリ範囲を消去
.El
.Pp
開始アドレス/長さの組によって消去する場合:
.Bl -tag -width xxxxxx
.It Fl b Ar base
メモリ範囲の開始アドレス
.It Fl l Ar length
メモリ範囲のバイト単位の長さ (2 のべき乗で)
.El
.Pp
開始アドレスと長さは今あるメモリ範囲と正確に合致しなければなりません。
.El
.Sh 関連項目
.Xr mem 4
