freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mixer.8
.\" Copyright (c) 1997
.\"	Mike Pritchard <mpp@FreeBSD.ORG>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY MIKE PRITCHARD AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" jpman %Id: mixer.8,v 1.3 1997/08/16 13:24:56 horikawa Stab %
.Dd January 9, 1997
.Dt MIXER 8
.Os
.Sh 名称
.Nm mixer
.Nd サウンドカードのミキサ値の設定/表示
.Sh 書式
.Nm
.Nm mixer
.Ar setting
.Op Ar lvalue:rvalue
.Nm mixer
.Ar +rec | -rec
.Op Ar device
.Sh 解説
.Nm
コマンドはサウンドカードのミキサの設定を変更あるいは表示するのに
用いられます。
サウンドカードからの録音の開始および停止の制御にも用いられます。
変更可能なミキサ設定は以下の通りです:
.Pp
vol, bass, treble, synth, pcm, speaker, mic, cd, mix, 
pcm2, rec, igain, ogain, line1, line2, line3
.Pp
必ずしも全てのサウンドカードで上記全ての項目が設定可能なわけではありません。
.Pp
.Nm
が引数なしで起動されると、
そのサウンドカードでサポートされている全項目が表示されます。
引数
.Ar setting
が指定されると、その
.Ar setting
の設定値だけが表示されます。
.Pp
ミキサの設定項目
.Ar setting
の設定値を変更する場合、オプションにより、
.Ar lvalue:rvalue
の形式で左右のチャネル設定を指定できます。
.Ar lvalue
および
.Ar rvalue
引数の値は 0 から 100 までです。
.Pp
録音を開始するには
.Ar +rec
引数を用い、録音を停止するには
.Ar -rec 
引数を用います。オプション引数
.Ar device
により別のミキサデバイスを指定することもできます。
デフォルトのデバイスは
.Pa /dev/mixer
です。
.Sh 関連ファイル
.Bl -tag -width /dev/mixer -compact
.It Pa /dev/mixer
デフォルトのミキサデバイス
.Sh 関連項目
.Xr cdcontrol 1 ,
.Xr cdplay 1
.Sh 歴史
.Nm
コマンドは
.Fx 2.0.5
で初めて登場しました。
.Sh 作者
.An Craig Metz Aq cmetz@thor.tjhsst.edu
と
.An Hannu Savolainenl
。
このマニュアルページは
.An Mike Pritchard Aq mpp@FreeBSD.ORG
によって記述されました。
