freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mixer.8
.\" Copyright (c) 1997
.\"	Mike Pritchard <mpp@FreeBSD.ORG>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY MIKE PRITCHARD AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/mixer/mixer.8,v 1.10.2.5 2001/04/23 15:12:50 greid Exp %
.\"
.\" jpman %Id: mixer.8,v 1.3 1997/08/16 13:24:56 horikawa Stab %
.Dd January 9, 1997
.Dt MIXER 8
.Os
.Sh 名称
.Nm mixer
.Nd サウンドカードのミキサ値の設定/表示
.Sh 書式
.Nm
.Op Fl f Ar device
.Op Fl s
.Oo
.Oo Ar dev
.Op Ar lvol Ns Op : Ns Ar rvol
.Cm | recsrc |
.Sm off
.Eo \&{
.Cm ^ | + | - | =
.Sm on
.Ec \&} Ns Cm rec
.Ar rdev
.Oc
.Ar ...
.Oc
.Sh 解説
.Nm
コマンドはサウンドカードのミキサデバイスのレベルを変更あるいは表示するのに
用いられます。
サウンドカードからの録音の開始および停止の制御にも用いられます。
変更可能なミキサデバイスは以下の通りです:
.Pp
.Bd -ragged -offset indent
vol, bass, treble, synth, pcm, speaker, mic, cd, mix, 
pcm2, rec, igain, ogain, line1, line2, line3
.Ed
.Pp
必ずしも上記全てのミキサデバイスが設定可能なわけではありません。
.Pp
.Nm
が引数なしで起動されると、
サポートされている全デバイスが現在の値と共に表示されます。
引数
.Ar dev
が指定されると、その
.Ar dev
の設定値だけが表示されます。
.Pp
ミキサの値
.Ar dev
を変更する場合、オプションにより
.Ar lvol Ns Op : Ns Ar rvol
の形式で左右のチャネル設定を指定できます。
.Ar lvol
および
.Ar rvol
引数の値は 0 から 100 までです。
.Ar dev
を省略してチャネル設定のみを含めると、メインボリュームレベルを変更します。
.Pp
録音デバイスを変更するには以下のいずれかを行ないます:
.Pp
.Fl s
フラグが使われた場合、現在のミキサ値が表示されます。
この書式は、将来
.Nm
を (前述のように) 起動するときにコマンドライン引数として使用できるものです。
.Bl -tag -width =rec -offset indent
.It Cm ^rec
.Ar rdev
が録音可能デバイスであるかどうかを切り替える
.It Cm +rec
.Ar rdev
を可能な録音デバイスに加える
.It Cm -rec
.Ar rdev
を可能な録音デバイスから取り除く
.It Cm =rec
録音デバイスを
.Ar rdev
と設定する
.El
.Pp
上記コマンドは内部マスク上で動作します。
全オプションが解析されると、
設定がなされてからサウンドカードのマスクが読まれます。
これにより、サウンドカードが録音デバイスに何を使用しているのかを
「正確」に知ることができます。
.Pp
オプション recsrc は現在の録音デバイスを表示します。
.Pp
オプション
.Fl f
.Pa /dev/mixer
は
.Ar device
をミキサデバイスとしてオープンします。
.Sh 関連ファイル
.Bl -tag -width /dev/mixer -compact
.It Pa /dev/mixer
デフォルトのミキサデバイス
.El
.Sh 関連項目
.Xr cdcontrol 1
.Sh 歴史
.Nm
コマンドは
.Fx 2.0.5
で初めて登場しました。
.Sh 作者
.An -nosplit
.An Craig Metz Aq cmetz@thor.tjhsst.edu
と
.An Hannu Savolainenl
がオリジナルのソースを作成しました。
ほとんどを
.An John-Mark Gurney Aq jmg@FreeBSD.org
が書き直しました。
このマニュアルページは
.An Mike Pritchard Aq mpp@FreeBSD.org
が記述しました。
