freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mknetid.8
.\" Copyright (c) 1995, 1996
.\"	Bill Paul <wpaul@ctr.columbia.edu>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: mknetid.8,v 1.1.1.1 1996/06/25 20:26:38 wpaul Exp %
.\" jpman %Id: mknetid.8,v 1.3 1997/08/16 13:26:57 horikawa Stab %
.\"
.Dd June 23, 1996
.Dt MKNETID 8
.Os
.Sh 名称
.Nm mknetid
.Nd netid マップデータの生成
.Sh 書式
.Nm mknetid
.Op Fl q
.Op Fl g Ar group_file
.Op Fl p Ar passwd_file
.Op Fl h Ar hosts_file
.Op Fl n Ar netid_file
.Op Fl d Ar domain
.Sh 解説
.Nm mknetid
は以下のファイル
.Xr group 5 ,
.Xr passwd 5 ,
.Xr hosts 5 ,
.Xr netid 5
の内容を処理し、NIS マップ
.Pa netid.byname
を生成するのに用いる形式に変換します。
このマップは、OS に依存しない形式でユーザとホスト双方の信用情報を
保持するために用いられます。
.Pp
.Nm mknetid
コマンドは重複した netid の出現をチェックし、それらを除去します。
.Pp
.Nm mknetid
コマンドは結果を標準出力に出力します。
通常は NIS マップを再構築する際に
.Nm /var/yp/Makefile
からのみ呼び出されます。
.Pp
.Sh オプション
.Nm mknetid
コマンドには以下のオプションがあります:
.Bl -tag -width flag
.It Fl q
通常、
.Nm mknetid
は重複した netid を見つけると警告メッセージを表示しますが、
このオプションにより「静粛」モードとなり、警告は抑制されます。
他のエラーメッセージはそのまま表示されます。
.It Fl g Ar group-file
.Fl g
オプションはグループ情報ファイルの場所を指定するのに用いられます。
コンパイル済みのデフォルト値は
.Pa /etc/group
です。
.It Fl p Ar passwd-file
.Fl p
オプションはパスワード情報ファイルの場所を指定するのに用いられます。
コンパイル済みのデフォルト値は
.Pa /etc/passwd
です。
.It Fl h Ar hosts-file
.\" ↑原文では .It Fl h Ar group-file となっているが、おそらく
.\" cut&paste ミスと思われる。  sakai@jp.freebsd.org  (Jun 12, 1997)
.Fl h
オプションはホストデータベースファイルの場所を指定するのに用いられます。
コンパイル済みのデフォルト値は
.Pa /etc/hosts
です。
.It Fl n Ar netid-file
.Fl n
オプションは netid 情報ファイルの場所を指定するのに用いられます。
コンパイル済みのデフォルト値は
.Pa /etc/netid
です。
注: netid データベースが見つからなくてもエラーにはなりません。
FreeBSD で Secure RPC がサポートされるようになるまでは、
ほとんどのシステムでは netid データベースは存在しないことでしょう。
.It Fl d Ar domain
.Nm mknetid
コマンドが netid レコードを生成する際、デフォルトでは、
システムのドメイン名を用います。
もしシステムのドメイン名が設定されていないなら、
.Fl d
オプションによってコマンドラインからドメイン名を指定しなければなりません。
ドメイン名が設定されている場合、
.Fl d
オプションによってその設定値を上書きすることもできます。
.El
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /var/yp/Makefile
NIS データベースを構築するために
.Nm yp_mkdb
および
.Nm mknetid
を呼び出す Makefile
.It Pa /etc/group
デフォルトのグループデータベースファイル
.It Pa /etc/passwd
デフォルトのパスワードデータベースファイル
.It Pa /etc/hosts
デフォルトのホストデータベースファイル
.It Pa /etc/netid
デフォルトの netid データベースファイル
.El
.Sh 関連項目
.Xr yp 4 ,
.Xr yp_mkdb 8
.Sh 作者
Bill Paul <wpaul@ctr.columbia.edu>
