freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mknetid.8
.\" Copyright (c) 1995, 1996
.\"	Bill Paul <wpaul@ctr.columbia.edu>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/libexec/mknetid/mknetid.8,v 1.15 2003/01/01 18:48:44 schweikh Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 23, 1996
.Dt MKNETID 8
.Os
.Sh 名称
.Nm mknetid
.Nd netid マップデータの生成
.Sh 書式
.Nm
.Op Fl q
.Op Fl g Ar group_file
.Op Fl p Ar passwd_file
.Op Fl h Ar hosts_file
.Op Fl n Ar netid_file
.Op Fl d Ar domain
.Sh 解説
.Nm
ユーティリティは以下のファイル
.Xr group 5 ,
.Xr passwd 5 ,
.Xr hosts 5 ,
.Xr netid 5
の内容を処理し、
.Tn NIS
マップ
.Pa netid.byname
を生成するのに用いる形式に変換します。
このマップは、OS に依存しない形式でユーザとホスト双方の信用情報を
保持するために用いられます。
.Pp
.Nm
ユーティリティは重複した netid の出現をチェックし、それらを除去します。
.Pp
.Nm
ユーティリティは結果を標準出力に出力します。
通常は
.Tn NIS
マップを再構築する際に
.Pa /var/yp/Makefile
からのみ呼び出されます。
.Sh オプション
.Nm
ユーティリティには以下のオプションがあります:
.Bl -tag -width indent
.It Fl q
通常、
.Nm
は重複した netid を見つけると警告メッセージを表示しますが、
このオプションにより「静粛」モードとなり、警告は抑制されます。
他のエラーメッセージはそのまま表示されます。
.It Fl g Ar group_file
.Fl g
オプションはグループ情報ファイルの場所を指定するのに用いられます。
コンパイル済みのデフォルト値は
.Pa /etc/group
です。
.It Fl p Ar passwd_file
パスワード情報ファイルの場所を指定します。
コンパイル済みのデフォルト値は
.Pa /etc/passwd
です。
.It Fl h Ar hosts_file
ホストデータベースファイルの場所を指定するのに用いられます。
コンパイル済みのデフォルト値は
.Pa /etc/hosts
です。
.It Fl n Ar netid_file
netid 情報ファイルの場所を指定します。
コンパイル済みのデフォルト値は
.Pa /etc/netid
です。
注: netid データベースが見つからなくてもエラーにはなりません。
.Fx
で
.Tn Secure RPC
がサポートされるようになるまでは、
ほとんどのシステムでは netid データベースは存在しないことでしょう。
.It Fl d Ar domain
.Nm
ユーティリティが netid レコードを生成する際、デフォルトでは、
システムのドメイン名を用います。
もしシステムのドメイン名が設定されていないなら、
.Fl d
オプションによってコマンドラインからドメイン名を指定しなければなりません。
ドメイン名が設定されている場合、
.Fl d
オプションによってその設定値を上書きすることもできます。
.El
.Sh 関連ファイル
.Bl -tag -width /var/yp/Makefile -compact
.It Pa /var/yp/Makefile
.Tn NIS
データベースを構築するために
.Nm yp_mkdb
および
.Nm
を呼び出す Makefile
.It Pa /etc/group
デフォルトのグループデータベースファイル
.It Pa /etc/passwd
デフォルトのパスワードデータベースファイル
.It Pa /etc/hosts
デフォルトのホストデータベースファイル
.It Pa /etc/netid
デフォルトの netid データベースファイル
.El
.Sh 関連項目
.Xr yp 8 ,
.Xr yp_mkdb 8
.Sh 作者
.An Bill Paul Aq wpaul@ctr.columbia.edu
