freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mknod.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mknod.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/sbin/mknod/mknod.8,v 1.26 2003/12/29 00:37:52 alfred Exp %
.\"
.\" $FreeBSD$
.\"
.Dd December 11, 1993
.Dt MKNOD 8
.Os
.Sh 名称
.Nm mknod
.Nd 特殊ファイルを作成する
.Sh 書式
.Nm
.Ar name
.Op Cm c | Cm b
.Ar major minor
.Op Ar owner : Ns Ar group
.Sh 解説
.Nm
ユーティリティはデバイス特殊ファイルを作成します。
手動でノードを作成するには、以下の 4 つの引数が必要です。
.Bl -tag -width indent
.It Ar name
デバイスファイル名です。たとえば
.Dq sd
は SCSI ディスクで、
.Dq pty
は疑似端末です。
.It Cm b | Cm c
デバイスのタイプを指定します。
ブロック型のデバイスは、
.Cm b
を指定します。
テープやディスク等がこれに該当しますが、
ブロック型特殊デバイス (cooked) とキャラクタ型特殊デバイス (raw) の
両方の特殊ファイルが必要です。
キャラクタ型のデバイスは、
.Cm c
を指定します。
端末や疑似デバイス等がこれに該当します。
.It Ar major
メジャーデバイス番号を指定します。
メジャーデバイス番号は、
どのデバイスドライバエントリを使用すべきをカーネルに示します。
メジャーデバイス番号とデバイスの対応を知るには、
.Pa /usr/src/sys/conf/majors
を見てください。
.It Ar minor
マイナデバイス番号を指定します。
マイナデバイス番号は、
デバイスのどのサブユニットが
特殊ファイルに対応するのかをカーネルに示します。
例えば、サブユニットは
ファイルシステムのパーティションだったり端末ラインだったりします。
.It Ar owner : Ns Ar group
.Ar owner
.Ar group
オペランドの組はオプションですが、
どちらかが指定された場合には両方の指定が必要です。
.Ar owner
は数値のユーザ ID でもユーザ名でも良いです。
そのユーザ名が数値のユーザ ID にもある場合には、
オペランドはユーザ名として使用されます。
.Ar group
は数値のグループ ID でもグループ名でも良いです。
ユーザ名と同様、
そのグループ名が数値のグループ ID にもある場合には、
オペランドはグループ名として使用されます。
.El
.Pp
メジャーデバイス番号およびマイナデバイス番号とも
.Xr strtoul 3
が受け付ける任意の形式で指定可能です。
.Ql 0x
で始めることにより 16 進数と、
.Ql 0
で始めることにより 8 進数であると解釈させる事が出来ます。
.Pp
.Nm
ツールは、
.Xr devfs 5
がマウントされているディレクトリの下で、ダミーの引数を使って呼び出すことで
削除されたデバイスノードを再作成するのに使えます。
例:
.Bd -literal -offset indent
mknod cd0 c 0 0
.Ed
.Pp
ここで
.Fa cd0
は削除されたデバイスノードの名前です。
.Sh 互換性
.Xr chown 8
のような機能は
.Fx
固有です。
.Sh 関連項目
.Xr mkfifo 1 ,
.Xr mknod 2 ,
.Xr chown 8
.Sh 歴史
.Nm
ユーティリティは
.At v6
から登場しました。
