freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mld6query.8
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: mld6query.8,v 1.3 1999/08/20 10:00:06 itojun Exp %
.\" $FreeBSD$
.\"	%FreeBSD: src/usr.sbin/mld6query/mld6query.8,v 1.1.1.1.2.1 2000/07/15 07:38:52 kris Exp %
.\"
.Dd May 17, 1998
.Dt MLD6QUERY 8
.Os KAME
.\"
.Sh 名称
.Nm mld6query
.Nd マルチキャストリスナ問い合わせメッセージを送信する
.\"
.Sh 書式
.Nm
.Op Fl dr
.Ar intface
.Op Ar maddr
.\"
.Sh 解説
.Nm
は、
.Ar maddr
が示すマルチキャストアドレスを対象とした
マルチキャストリスナ探索 (MLD) 問い合わせパケットを、
インタフェース
.Ar intface
へ向けて送ります。
.Ar maddr
を省略すると、
リンクローカル全ノードマルチキャストアドレス (ff02::1) が
使用されます。
.Pp
問い合わせを送信すると、
.Nm
は最大 10 秒間応答を待ちます。
応答が返ってきたら、
.Nm
は応答とその種類を出力し、それから他の応答を待ちます。
.Pp
このプログラムはデバッグ用にのみ提供されるものです。
通常の使用には必要ありません。
.Pp
.Fl d
オプションをつけると、
.Nm
は MLD 問い合わせパケットではなく MLD 完了パケットを送信します。 
同様に
.Fl r
オプションをつけると、
MLD レポートパケットが送信されます。
.Fl dr
オプションはデバッグ用にだけ存在しています。
.\"
.Sh 戻り値
このプログラムは成功時には終了ステータス 0 で終了し、失敗時には
終了ステータスは 0 以外で終了します。
.\"
.\" .Sh SEE ALSO
.\"
.Sh 歴史
.Nm
コマンドは、WIDE/KAME IPv6 プロトコルスタックキットで
最初に登場しました。
.Sh バグ
.Nm mld6query
はリンクローカルスコープにないマルチキャストアドレスのことは
考慮していません。
