freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mlxcontrol.8
.\"
.\" Copyright (c) 2000 Michael Smith
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/mlxcontrol/mlxcontrol.8,v 1.3.2.2 2000/12/08 15:28:29 ru Exp %
.\"
.Dd April 10, 2000
.\" jpman %Id: mlxcontrol.8,v 1.3 2000/10/22 15:22:22 yt-kage Stab %
.Dt MLXCONTROL 8
.Os
.Sh 名称
.Nm mlxcontrol
.Nd Mylex DAC ファミリ RAID 管理ユーティリティ
.Sh 書式
.Nm
.Aq command
.Op args
.Nm
status
.Op Fl qv
.Op Ar drive
.Nm
rescan
.Ar controller
.Op Ar controller ...
.Nm
detach
.Ar drive
.Op Ar drive ...
.Nm
detach
.Fl a
.Nm
check
.Ar drive
.Nm
config
.Ar controller
.Nm
help
.Ar command
.Sh 解説
.Nm
ユーティリティは、
.Xr mlx 4
ドライバに接続されたデバイスの状態監視と管理機能を提供します。
.Pp
コントローラ名は "mlxN" の形式で、
N はコントローラのユニット番号です。
ドライブ名は "mlxdN" の形式で、
N はドライブのユニット番号です。
デバイスノードへのパスを指定してはいけません。
.Pp
.Bl -tag -width status
.It status
コントローラとシステムドライブの状態を表示します。
もし 1 つ以上ドライブが指定されれば、
それらのドライブについての情報のみを表示します。
ドライブの指定がなければ、システム中の全てのコントローラと
ドライブについての情報を表示します。
.Fl v
フラグをつけると、ずっと詳細な情報を表示します。
.Fl q
フラグをつけると一切出力しません。
このコマンドは、
調べた全てのドライブがオンラインであれば 0、
危険なドライブがあれば 1、
オフラインなドライブがあれば 2 を返します。
.It rescan
1 つ以上のコントローラを再走査して、
接続されていないシステムドライブ
(つまり切り離されたドライブやドライバ初期化以後に作られたドライブ)
を探します。
.Fl a
フラグをつけると、システム中の全てのコントローラを再走査します。
.It detach
1 つ以上のシステムドライブを切り離します。
このコマンドが成功するためには、
ドライブがアンマウントされていなくてはならず、そして、
他のどのユーティリティからもオープンされていてはなりません。
.Fl a
フラグをつけると、
指定されたコントローラから全てのシステムドライブを切り離します。
.It check
冗長性システムドライブ (例えば、RAID1 や RAID5) に対して、
一貫性検査と修復の作業を始めます。
コントローラはシステムドライブを走査して全ての不整合を修復します。
このコマンドはただちに終了しますので、
検査の進捗を見るには
.Ar status
コマンドを使ってください。
.It config
指定されたコントローラの現在の設定を表示します。
このコマンドは、将来のリリースではシステムドライブを
設定に追加したり、設定から削除したりできるようになるでしょう。
.It help
.Ar command
の使用方法を表示します。
.Sh バグ
.Ar config
コマンドはまだシステムドライブの設定の変更をサポートしていません。
.Pp
エラーログの抽出はまだサポートされていません。
.Sh 作者
.\" should be use '.Nm'
mlxcontrol ユーティリティは
.An Michael Smith
.Aq msmith@FreeBSD.org
が書きました。
