freebsd/freebsd-doc/ja_JP.eucJP/man/man8/modload.8
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/modload/modload.8,v 1.11.2.2 2000/03/03 11:43:13 sheldonh Exp %
.\" jpman %Id: modload.8,v 1.2 1997/04/25 00:25:43 mutoh Stab %
.\"
.Dd September 22, 1994
.Dt MODLOAD 8
.Os
.Sh 名称
.Nm modload
.Nd カーネルモジュールの読み込みを行う
.Sh 書式
.Nm modload
.Op Fl dquv
.Op Fl A Ar kernel
.Op Fl e Ar entry
.Op Fl p Ar postinstall
.Op Fl o Ar output_file
.Ar input_file
.Sh 解説
.Nm modload
は、ローダブルカーネルモジュールを稼働中のシステムに読み込み
ます。入力ファイルはオブジェクトファイル (.o) です。
.Pp
オプションとしては、以下のものがあります。
.Bl -tag -width indent
.It Fl d
デバッグオプションです。
.Nm modload
自体をデバッグする時に指定します。
.It Fl q
沈黙モード。メッセージをほとんど表示しません。
.It Fl u
モジュールが読み込まれた後で、ファイル
.Pq Ar output_file
を削除します。出力ファイルが指定されていない時は、このオプションは一時
ファイルを消去する前まで利用します。
.It Fl v
読み込み処理の詳細を表示します。
.It Fl A Ar kernel
外部シンボル参照を解決するためにリンカに使わせるファイルを指定します。
必ず、現在動いているカーネルの
シンボルを含むファイルを指定しなければなりません。
それ以外のファイルを指定すると、システムがクラッシュするでしょう。
.It Fl e Ar entry
ローダブルモジュールのエントリポイントを指定します。
この文字列はモジュールがリンクされる時に
.Xr ld 1
に渡されます。
デフォルトのモジュールエントリポイント名は モジュール名に `_mod' を
追加したものです。
.It Fl p Ar postinstall
ローダブルモジュールの読み込みが成功した後に起動するシェルスクリプト、
またはプログラムを指定します。
このスクリプトまたはプログラムには 3 つの引数が渡されます。
1 つ目はモジュール ID (10 進 )、 2 つ目はモジュールタイプ (16 進 ) です。
ローダブルモジュールがデバイスドライバならば、
3 つ目の引数としてメジャー番号が渡されます。
ローダブルモジュールがシステムコールならば、
3 つ目の引数としてシステムコール番号が渡されます。
.It Fl o Ar output_file
リンカが作成する出力ファイルの名前を指定します。このオプションが
指定されていない時は、 /tmp ディレクトリ内のファイルが使われます。
その名前は、モジュール名に `.out' という拡張子が付けられたものです。
.El
.Sh 関連ファイル
.Bl -tag -width /usr/include/sys/lkm.h -compact
.It Pa /kernel
外部参照を解決するためにリンカに使わせるデフォルトのファイル。
.It Pa /usr/include/sys/lkm.h
モジュールタイプが定義されているファイル。
.\" .It Pa output file.
.\" リンカが作成するデフォルトの出力ファイル。
.Sh 診断
.Nm
は、成功時には 0、エラー発生時には 0 以外の値で終了します。
.Sh 関連項目
.Xr ld 1 ,
.Xr lkm 4 ,
.Xr modstat 8 ,
.Xr modunload 8
.Sh 歴史
.Nm
コマンドは
.Tn "SunOS 4.1.3"
の対応するコマンドと類似した機能になるように設計しました。
.Sh 作者
.Bl -tag
.An Terrence R. Lambert Aq terry@cs.weber.edu
.El
.Sh バグ
ローダブルデバイスドライバでは、
キャラクタデバイスまたはブロックデバイスのどちらかのエントリを確保できますが、
両方を確保することはできません。
