freebsd/freebsd-doc/ja_JP.eucJP/man/man8/modstat.8
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: modstat.8,v 1.2.8.2 1997/07/30 06:42:43 charnier Exp %
.\" jpman %Id: modstat.8,v 1.3 1997/09/08 07:02:33 seki Stab %
.\"
.Dd June 7, 1993
.Dt MODSTAT 8
.Os
.Sh 名称
.Nm modstat
.Nd 組み込んだカーネルモジュールのステータスを表示する
.Sh 書式
.Nm modstat
.Op Fl i Ar id
.Op Fl n Ar name
.Sh 解説
.Nm
は、カーネルに組み込んだローダブルカーネルモジュールの
ステータスを表示します。
.Pp
オプションとしては以下のものがあります:
.Bl -tag -width indent
.It Fl i Ar id
指定した ID のモジュールのみ表示する
.It Fl n Ar name
指定した名前のモジュールのみ表示する
.El
.Sh 診断
.Nm
は、成功したときは 0、失敗したときは 0 以外の状態にて終了します。
.Sh 関連項目
.Xr lkm 4 ,
.Xr modload 8 ,
.Xr modunload 8
.Sh 歴史
.Nm
コマンドは、
.Tn "SunOS 4.1.3" 
の対応するコマンドと同じ機能になるように設計されました。
.Sh 作者
.Bl -tag
Terrence R. Lambert, terry@cs.weber.edu
.El
