freebsd/freebsd-doc/ja_JP.eucJP/man/man8/modunload.8
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/modunload/modunload.8,v 1.8.2.1 1999/08/29 15:14:12 peter Exp %
.\" jpman %Id: modunload.8,v 1.2 1997/04/30 00:37:42 mutoh Stab %
.\"
.Dd June 7, 1993
.Dt MODUNLOAD 8
.Os
.Sh 名称
.Nm modunload
.Nd カーネルモジュールを取り外す
.Sh 書式
.Nm modunload
.Op Fl i Ar module_id
.Op Fl n Ar module_name
.Sh 解説
.Nm
は、カーネルに組み込んだ読み込み可能カーネルモジュールを
稼働中のシステムから取り外します。
.Ar module_id
と
.Ar module_name
は、
.Xr modstat 8
で表示される ID と名前です。
.Pp
以下のオプションのどちらか一方を指定する必要があります。
.Bl -tag -width indent
.It Fl i Ar module_id
指定した ID
.Ar module_id 
のモジュールを取り外す
.It Fl n Ar module_name
指定した名前
.Ar module_name 
のモジュールを取り外す
.El
.Sh 診断
.Nm
は、成功したときは0、失敗したときは0以外の値になります。
.Sh 関連項目
.Xr lkm 4 ,
.Xr modload 8 ,
.Xr modstat 8
.Sh 歴史
.Nm
コマンドは、
.Tn "SunOS 4.1.3"
の対応するコマンドと同じ機能になるように設計されました。
.Sh 作者
.Bl -tag
.An Terrence R. Lambert Aq terry@cs.weber.edu
.El
