freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mountd.8
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mountd.8	8.4 (Berkeley) 4/28/95
.\"	%Id: mountd.8,v 1.14.2.1 1999/04/08 14:04:30 ghelmer Exp %
.\"
.\" jpman %Id: mountd.8,v 1.3 1997/05/19 17:06:05 horikawa Stab %
.\"
.Dd April 28, 1995
.Dt MOUNTD 8
.Os
.Sh 名称
.Nm mountd
.Nd リモートの
.Tn NFS
マウント要求に対するサービスを行うデーモン
.Sh 書式
.Nm mountd
.Op Fl 2dlnr
.Op Ar exportsfile
.Sh 解説
.Nm
は、他のクライアントマシンからの
.Tn NFS
マウント要求のためのサーバです。
.Nm
は、
.Tn NFS
サーバの仕様で示されているポート
番号でサービス要求を待ちます。詳細は RFC1094
.%T "Network File System Protocol Specification"
の Appendix A と
.%T "NFS: Network File System Version 3 Protocol Specification" 
の Appendix I
を参照してください。
.Pp
.Nm
では、以下のオプションや引数を指定できます:
.Bl -tag -width indent
.It Fl 2
このサーバからファイルシステムをマウントするクライアントに対し、
管理者はバージョン 2
.Tn NFS
プロトコルのみの使用を強制できます。
.It Fl d
デバッグ情報を出力します。
.It Fl l
成功した
.Nm
要求を記録します。
.It Fl n
非 root からのマウント要求を許可します。
このオプションは、
クライアントが PC であるなど、それがどうしても必要な
場合にのみ使うようにしてください。
その場合、自動的に vfs.nfs.nfs_privport sysctl フラグがクリアされます。
このフラグはカーネルが NFS 要求を受け付けるのが、
予約されたポートからのみか否かを制御します。
.It Fl r
通常ファイルに対するマウント RPC 要求を許可します。
これは、マウントプロトコルの仕様によると危険なようですが、
いくつかのディスクレスワークステーションは、スワップファイルをマウント
しようとしますし、それが通常ファイルであることを期待しています。
通常ファイルは
.Pa /etc/exports
で指定できないので、スワップが置かれようとしているファイルシステム全体
が、
.Fl alldirs
フラグとともに公開されていなければなりません。
.It Ar exportsfile
exports ファイルの置き場所を指定します。
.El
.Pp
起動されると、
.Nm
は
.Xr mount 2
システムコールによって、公開するホストアドレスとオプションを
カーネル内にロードします。
公開設定ファイルを変更した場合は、
.Nm
に対して回線切断シグナルを送って
公開設定情報を再ロードする必要があります。
.Dv SIGHUP
を送ったあと(例:
kill \-s HUP `cat /var/run/mountd.pid`
)、exports ファイルにエラーがあるかどうか、
.Nm
の出力をチェックしてください。
.Pp
動作中のカーネルは
.Tn NFS
を組み込んでいないものであると判明した場合、
.Nm
は、
.Xr vfsload 3
を用いる
.Xr kldload 8
コマンドを使って、
.Tn NFS
を含むローダブルカーネルモジュールのロードを試みます。
これが失敗するか、
.Tn NFS
KLD が使用できない場合は、
.Nm
はエラー終了します。
.Sh 関連ファイル
.Bl -tag -width /var/run/mountd.pid -compact
.It Pa /etc/exports
公開設定ファイル (エクスポートファイル)
.It Pa /var/run/mountd.pid
現在実行中の
.Nm
のプロセス id
.Tn ID
.It Pa /var/db/mountdtab
現在マウントされているリモートファイルシステムのリスト
.El
.Sh 関連項目
.Xr nfsstat 1 ,
.Xr exports 5 ,
.Xr kldload 8 ,
.Xr nfsd 8 ,
.Xr portmap 8 ,
.Xr showmount 8
.Sh 歴史
.Nm
ユーティリティは 
.Bx 4.4 
から登場しています。
