freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_smbfs.8
.\" $Id: mount_smbfs.8,v 1.3 2003-08-17 22:32:44 horikawa Exp $
.\" %FreeBSD: src/contrib/smbfs/mount_smbfs/mount_smbfs.8,v 1.2 2003/07/31 11:50:01 simon Exp %
.\" $FreeBSD$
.Dd March 10, 2000
.Dt MOUNT_SMBFS 8
.Os
.Sh 名称
.Nm mount_smbfs
.Nd "SMB ファイルサーバから共有資源をマウントする"
.Sh 書式
.Nm
.Op Fl E Ar cs1 : Ns Ar cs2
.Op Fl I Ar host
.Op Fl L Ar locale
.Op Fl M Ar crights : Ns Ar srights
.Op Fl N
.Op Fl O Ar cowner : Ns Ar cgroup Ns / Ns Ar sowner : Ns Ar sgroup
.Op Fl R Ar retrycount
.Op Fl T Ar timeout
.Op Fl W Ar workgroup
.Op Fl c Ar case
.Op Fl d Ar mode
.Op Fl f Ar mode
.Op Fl g Ar gid
.Op Fl n Ar opt
.Op Fl u Ar uid
.Sm off
.No // Ar user No @ Ar server No / Ar share
.Sm on
.Ar node
.Sh 解説
.Nm
コマンドは、SMB/CIFS プロトコルを使用し、
リモートサーバから共有資源をマウントします。
.Pp
オプションは次の通りです:
.Bl -tag -width indent
.It Fl E Ar cs1 : Ns Ar cs2
ローカル
.Pq Ar cs1
とサーバ
.Pq Ar cs2
の文字集合を指定します。
.It Fl I Ar host
NetBIOS の名前リゾルバを使用せずに、直接
.Ar host
に接続します。
.Ar host
は、有効な DNS 名か IP アドレスのいずれも可能です。
.It Fl L Ar locale
大文字小文字の変換ルーチンに
.Ar locale
を使用します。
すなわち、大文字小文字の変換用のロケールを設定します。
デフォルトでは、
.Nm
は、環境変数
.Ev LC_*
を使用して判定を試みます。
.It Fl M Ar crights : Ns Ar srights
新規作成された接続に対して、アクセス権を設定します。
理論については
.Xr nsmb 8
を参照してください。
.It Fl N
パスワードを問い合わせません。
実行時に、
.Nm
は
.Pa ~/.nsmbrc
ファイルを読み込み、追加の設定パラメータとパスワードを得ます。
パスワードが見付からない場合、
.Nm
は入力を促します。
.It Fl O Ar cowner : Ns Ar cgroup Ns / Ns Ar sowner : Ns Ar sgroup
新規作成された接続に対して、所有者/グループ属性を割り当てます。
理論については
.Xr nsmb 8
を参照してください。
.It Fl R Ar retrycount
SMB リクエスタが接続を落す前に何回リトライすべきかを指定します。
.It Fl T Ar timeout
各要求に対するタイムアウトを秒単位で指定します。
.It Fl W Ar workgroup
本オプションは、認証要求で使用するワークグループを指定します。
.It Fl c Ar case
名前の表現に影響する、
.Ar case
オプションを設定します。
.Ar case
は、以下のうちのいずれかです:
.Bl -tag -width ".Em Value"
.It Em 値
.Em 意味
.It Cm l
すべての既存のファイル名を小文字に変換します。
新規に作成されたファイルの名前は、小文字になります。
.It Cm u
すべての既存のファイル名を大文字に変換します。
新規に作成されたファイルの名前は、大文字になります。
.El
.It Fl f Ar mode , Fl d Ar mode
ファイルとディレクトリに対して割り当てられる権限を指定します。
値は 8 進数値で指定する必要があります。
ファイルモードのデフォルト値は、マウントポイントから取得されます。
ディレクトリモードのデフォルト値は、
ファイルモードに読み取り権限があるところに、
実行権限を追加したものとなります。
.Pp
これらの権限は、SMB サーバから認可される権限とは
異なる可能性があることに注意してください。
.It Fl u Ar uid , Fl g Ar gid
ファイルに割り当てるユーザ ID とグループ ID を指定します。
デフォルトは、ボリュームがマウントされるディレクトリの、
所有者 ID とグループ ID です。
.It No // Ns Ar user Ns @ Ns Ar server Ns / Ns Ar share
.Nm
コマンドは、
.Ar server
をリモートコンピュータの NetBIOS 名、
.Ar user
をリモートユーザ名、
.Ar share
をリモートサーバ上の資源名として、それぞれ使用します。
.It Ar node
マウントポイントのパスです。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa ~/.nsmbrc" -compact
.It Pa ~/.nsmbrc
接続に対する静的なパラメータと他の情報を保持します。
詳細は
.Pa /usr/share/examples/smbfs/dot.nsmbrc
を参照してください。
.El
.Sh 使用例
次の使用例は、SMB サーバ
.Em SAMBA
にユーザ
.Em GUEST
で共有資源
.Em PUBLIC
と
.Em TMP
をマウントするために接続する方法を示しています:
.Bd -literal -offset indent
mount_smbfs -I samba.mydomain.com //guest@samba/public /smb/public
mount_smbfs -I 192.168.20.3 -E koi8-r:cp866 //guest@samba/tmp /smb/tmp
.Ed
.Pp
smbfs のマウントのために
.Xr fstab 5
を使用可能です:
.Pp
.Dl "//guest@samba/public    /smb/public     smbfs  rw,noauto 0   0"
.Sh バグ
バグは作者に報告してください。
.Sh 作者
.An Boris Popov Aq bp@butya.kz ,
.Aq bp@FreeBSD.org
