freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount.8
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mount.8	8.8 (Berkeley) 6/16/94
.\" %FreeBSD: src/sbin/mount/mount.8,v 1.68 2004/05/17 08:35:42 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd April 7, 2003
.Dt MOUNT 8
.Os
.Sh 名称
.Nm mount
.Nd ファイルシステムをマウントする
.Sh 書式
.Nm
.Op Fl adfpruvw
.Op Fl F Ar fstab
.Op Fl o Ar options
.Op Fl t Ar ufs | external_type
.Nm
.Op Fl dfpruvw
.Ar special | node
.Nm
.Op Fl dfpruvw
.Op Fl o Ar options
.Op Fl t Ar ufs | external_type
.Ar special node
.Sh 解説
.Nm
ユーティリティは
.Xr mount 2
システムコールを使用して、
.Ar "スペシャルデバイス"
かリモートノード (rhost:path) を
ファイルシステムツリーの
.Ar node
へ接合します。
もし
.Ar special
または
.Ar node
が指定されなかった場合には、
.Xr fstab 5
ファイルから適切な情報を取得します。
.Pp
システムは、現在マウントしているファイルシステムのリストを管理しています。
.Nm
コマンドを引数を与えずに実行すると、このリストが表示されます。
.Pp
オプションとしては以下のものがあります:
.Bl -tag -width indent
.It Fl a
.Xr fstab 5
に記述されているファイルシステムを
すべてマウントします。
例外は、
.Dq noauto
が指定されているもの、
.Fl t
フラグにて除外されているもの (後述)、
既にマウントされているもの
(ルートファイルシステムは伝統的なシングルユーザモードの動作を保つ
ために除外されます) です。
通常、これはシステムの起動時に実行されます。
.It Fl d
システムコールの実行以外のすべてのことを行ないます。
このオプションを
.Fl v
とともに指定することで、
.Nm
コマンドが何をしようとしているのかを確認することができます。
.It Fl F Ar fstab
使用する
.Pa fstab
ファイルを指定します。
.It Fl f
ファイルシステムのマウント状態を読み書き可能から読み込み専用へ
変更しようとするときに、
すでにオープンされているファイルへの書き込み許可を強制的に取り消します。
また、正常かどうか不明なファイルシステムも強制的に読み書き可能に
マウントします (危険なため注意して使って下さい)。
.It Fl o
オプションは
.Fl o
の後にコンマで区切って指定します。
衝突するオプションが指定された場合、最も右側のオプションが効果があります。
以下のオプションが指定できます:
.Bl -tag -width indent
.It Cm acls
アクセス制御リスト、すなわち ACLS を有効にします。
これは、
.Xr setfacl 1
と
.Xr getfacl 1
コマンドでカスタマイズできます。
.It Cm async
指定したファイルシステムのすべての
.Tn I/O
を非同期に行います。
このフラグを指定することは非常に
.Em 危険
ですので、
システムクラッシュ時にファイルシステムを
作り直す用意ができていないかぎりは使うべきではありません。
.It Cm current
.Fl u
フラグとともに使用された場合、
マウントされているファイルシステムに対する現在の効果を指定することと同じです。
.It Cm force
.Fl f
オプションと同じです。
ファイルシステムのマウント状態を読み書き可能から読み込み専用へ
変更しようとするときに、
すでにオープンされているファイルへの書き込み許可を強制的に取り消します。
また、正常かどうか不明なファイルシステムも強制的に読み書き可能に
マウントします (危険なため注意して使って下さい)。
.It Cm fstab
.Fl u
フラグとともに使用された場合、
ファイルシステムに対して
.Xr fstab 5
に列挙されている全オプションを指定することと同じです。
.It Cm multilabel
指定されたファイルシステムでマルチラベル Mandatory Access Control、
すなわち MAC を有効にします。
ファイルシステムがマルチラベル操作をサポートしていれば、
そのファイルシステム内では
全オブジェクトに対して 1 つのラベルを使うのではなく、
各オブジェクトに対して個々のラベルが保持されます。
.Xr tunefs 8
の
.Fl l
フラグの代わりです。
マルチラベルマウントフラグをマウント時に自動的に設定することに関しての
更なる情報は
.Xr mac 4
を参照して下さい。
.It Cm noasync
メタデータ I/O を同期に行い、データ I/O を非同期に行います。
これがデフォルトです。
.It Cm noatime
ファイル読み取り時に、ファイルアクセス時刻を更新しません。
このオプションが便利なのは、
多くのファイルを持ち、(ほとんどの場合重要ではない) ファイルアクセス時刻
を更新するよりも性能が重要であるファイルシステムです。
このオプションは現在ローカルファイルシステムでのみサポートされています。
.It Cm noauto
.Nm
が
.Fl a
フラグ付きで動作しているときに、このファイルシステムをスキップします。
.It Cm noclusterr
リード時のクラスタリングを無効にします。
.It Cm noclusterw
ライト時のクラスタリングを無効にします。
.It Cm nodev
ファイルシステム上のキャラクタスペシャルデバイスや
ブロックスペシャルデバイスを解釈しません。
このオプションは、サーバが自分自身以外のアーキテクチャ用の
スペシャルデバイスを含むファイルシステムを持っている場合に有用です。
ユーザがスーパユーザ権限を持たないときには、
本オプションが自動的に設定されます。
.It Cm noexec
マウントしているファイルシステム上のバイナリの
実行を許可しません。
このオプションは、サーバが自分自身以外のアーキテクチャ用の
バイナリを含むファイルシステムを持っている場合に有用です。
.It Cm nosuid
実効ユーザ ID (set-user-ID) セット、
実効グループ ID (set-group-ID) セットビットの
効果をなくします。
注意:
.Xr suidperl 1
のような suid/sgid ラッパが
誰でも使えるようにシステムにインストールされている場合には、価値がありません。
ユーザがスーパユーザ権限を持たないときには、
本オプションが自動的に設定されます。
.It Cm nosymfollow
マウントされたファイルシステムにおいては、シンボリックリンクを追跡しません。
.It Cm ro
.Fl r
と同じく、マウントするファイルシステムを読み込み専用とします
(スーパユーザでも書き込みできなくなります)。
.It Cm sync
ファイルシステムのすべての
.Tn I/O
を同期的に行います。
.It Cm snapshot
本オプションにより、指定したファイルシステムのスナップショットを取得可能です。
.Fl u
フラグは、本オプションに必須です。
スナップショットファイルは、
スナップショットが取られるファイルシステム上に作成される必要があります。
ファイルシステムごとに、最大 20 個のスナップショットを作成可能です。
アクティブスナップショットはスーパブロックに記録されますので、
アンマウントと再マウントを跨いだりシステムリブートを跨いても、
これらは永続します。
スナップショットがもう要らなくなったら、
.Xr rm 1
コマンドで削除可能です。
スナップショットの削除順序は任意ですが、
スナップショットに含まれていた空間すべてを取り返せないかもしれません。
なぜなら、解放されるブロックを他のスナップショットが必要としているかも
しれないためです。
schg フラグはスナップショット上に設定されますので、
root ユーザでなくともこれらのファイルに書き込み可能です。
アンリンクコマンドはスナップショットファイルに対して例外であり、
schg フラグが設定されていても削除可能とすることで、
スナップショットファイル削除前に schg フラグをクリアしなくても
良いようになっています。
.Pp
スナップショットの取得後、次の 3 つの事柄を実行可能です:
.Pp
.Bl -enum -compact
.It
スナップショットに
.Xr fsck 8
を実行できます。
マウントされていたときのファイルシステムがクリーンな場合、
スナップショットに対する fsck はクリーン (かつ無変更の) 結果が
得られるはずです。
これが、本質的にはバックグラウンド fsck 処理の動作です。
.Pp
.It
スナップショットに
.Xr dump 8
を実行できます。
スナップショットのタイムスタンプ時のファイルシステムと一致するダンプが
得られるでしょう。
.Pp
.It
ファイルシステムの凍結したイメージとして、スナップショットをマウントします。
スナップショット
.Pa /var/snapshot/snap1
をマウントするには次のようにします。
.Bd -literal
mdconfig -a -t vnode -f /var/snapshot/snap1 -u 4
mount -r /dev/md4 /mnt
.Ed
.Pp
凍結した
.Pa /var
ファイルシステムは
.Pa /mnt
にあり、検査可能となりました。
すべてが、スナップショットがとられた時期と同じ状況にあります。
例外は、以前のスナップショットが長さ 0 のファイルとして見えることです。
マウントしたスナップショットに関する処理が完了したら、次のようにします。
.Bd -literal
umount /mnt
mdconfig -d -u 4
.Ed
.Pp
より詳しいことは
.Pa /usr/src/sys/ufs/ffs/README.snapshot
に書いてあります。
.El
.It Cm suiddir
マウントされたファイルシステムにおけるディレクトリに
SUID ビットがセットされると、
新規ファイルの所有者をディレクトリの所有者に設定します。
新規ディレクトリは親ディレクトリのビットを継承します。
実行ビットはファイルから取り除かれ、
ファイルは root の所有とはなりません。
.Pp
この機能は PC ユーザに対して ftp, SAMBA, netatalk のサービスを行う
ファイルサーバのためにデザインされました。
これはシェルユーザに対してセキュリティホールとなりますので、
特にホームディレクトリを持つシェルマシンでは使用すべきではありません。
このオプションが動作するためには、カーネルの SUIDDIR オプションが必要です。
UFS ファイルシステムのみがこのオプションをサポートします。
詳細は
.Xr chmod 2
を参照してください。
.It Cm update
.Fl u
と同じく、すでにマウントされているファイルシステムの状態を変化させることを
指示します。
.It Cm union
マウントポイント以下の名前空間に、マウントされたファイルシステムのルートと
マウントポイントに元から存在するディレクトリの両方が見えるようにします。
名前を検索するときは、マウントしたファイルシステムが先に検索されます。
ファイルが存在しない
ために検索が失敗した場合は、既存のディレクトリがアクセスされます。
ファイル等の作成は、すべて
マウントしたファイルシステム上に対して行われます。
.El
.Pp
.Nm
が内部で知っているファイルシステムタイプ
.Fl ( t
オプションを参照) 以外の、ファイルシステムタイプに固有のオプションは、
コンマで区切って指定します。
このオプションは、オプションの前に
.Dq \&-
(ダッシュ記号) をつけて区別します。
値を持つオプションは、
-option=valueの形で指定します。
たとえば、
.Bd -literal -offset indent
mount -t unionfs -o -b /sys $HOME/sys
.Ed
.Pp
では、
.Nm
コマンドは以下と同じものを実行します:
.Bd -literal -offset indent
/sbin/mount_unionfs -b /sys $HOME/sys
.Ed
.Pp
ファイルシステムタイプに固有な追加オプションで、
内部的には分からないもの (下記
.Fl t
オプションを参照してください) は、関連する
.Pa /sbin/mount_ Ns Sy XXX
ユーティリティのマニュアルページに記述されているかもしれません。
.It Fl p
マウント情報を
.Xr fstab 5
の形式で表示します。暗黙的に
.Fl v
オプションを指定します。
.It Fl r
ファイルシステムを読み込み専用でマウントします
(スーパユーザでも書き込みは行えません)。
これは、
.Fl o
オプションで
.Cm ro
を指定するのと同じです。
.It Fl t Ar ufs | external_type
.Fl t
のあとの引数にはファイルシステムタイプを指定します。
デフォルトは、
.Ar ufs
です。
.Fl t
オプションによって、
.Nm
コマンドの操作が、指定した特定のタイプのファイルシステムに対してのみ
行われるように指示することができます。
2つ以上のタイプを指定するにはコンマで区切ります。
ファイルシステムリスト
の先頭に
.Dq no
という文字をつけることに
よって、
.Nm
コマンドの操作の対象と
.Em しない
ファイルシステムタイプを指定することができます。
以下に例を示します:
.Bd -literal -offset indent
mount -a -t nonfs,nullfs
.Ed
.Pp
は、
.Tn NFS
と
.Tn NULLFS
を除いた、すべてのファイルシステムをマウントします。
.Pp
type を内部で解釈できない場合、
.Nm
は
.Pa /sbin/mount_ Ns Sy XXX
というプログラムを実行しようとします。
.Sy XXX
の部分が type になります。たとえば nfs ファイルシステムは、
.Pa /sbin/mount_nfs
というプログラムによってマウント
されます。
.Pp
ほとんどのファイルシステムは、
まだ存在せず、カーネルモジュールが使用可能な場合、
カーネルが動的にロードします。
.It Fl u
.Fl u
フラグは、すでにマウントしているファイルシステム
の状態の変更を指示します。
ファイルシステムを読み込み専用から読み書き可能へ、またその逆へも変更することを
含めて、すでに説明したすべてのオプション
.Fl ( o
オプション)
の内容を変更することができます。
読み書き可能なファイルシステムを読み出し専用に変更する場合、
書き込みのためにオープンしているファイルがあるときには、
.Fl f
オプションを指定しなければ変更に失敗します。
どのオプションを適用するかを決定する際、最初に
.Fl o
オプションの引数を適用し、最後に
.Fl r ,
.Fl w
オプションが適用されます。
.It Fl v
詳細なメッセージを表示します。
.It Fl w
ファイルシステムを読み書き可能とします。
.El
.Sh 診断
多岐に渡りますが、ほぼ全てが自明です。
.Pp
.Dl XXXXX filesystem is not available
.Pp
カーネルはそのファイルシステムタイプをサポートしていません。
ファイルシステムのサポートは、
静的 (カーネルコンパイル時) もしくは動的 (
.Xr kldload 8
によってカーネルモジュールとしてロードされる) です。
.Sh 環境変数
.Bl -tag -width ".Ev PATH_FSTAB"
.It Ev PATH_FSTAB
環境変数
.Ev PATH_FSTAB
が設定されていると、すべての操作は指定されたファイルに対して実行されます。
プロセス環境やメモリアドレス空間が
.Dq 汚染されている
とみなされる場合には
.Ev PATH_FSTAB
は尊重されません (更なる情報は
.Xr issetugid 2
を参照してください)。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
ファイルシステムテーブル
.El
.Sh 関連項目
.Xr getfacl 1 ,
.Xr setfacl 1 ,
.Xr mount 2 ,
.Xr acl 3 ,
.Xr mac 4 ,
.Xr fstab 5 ,
.Xr kldload 8 ,
.Xr mount_cd9660 8 ,
.Xr mount_devfs 8 ,
.Xr mount_ext2fs 8 ,
.Xr mount_fdescfs 8 ,
.Xr mount_hpfs 8 ,
.Xr mount_linprocfs 8 ,
.Xr mount_msdosfs 8 ,
.Xr mount_nfs 8 ,
.Xr mount_ntfs 8 ,
.Xr mount_nullfs 8 ,
.Xr mount_nwfs 8 ,
.Xr mount_portalfs 8 ,
.Xr mount_procfs 8 ,
.Xr mount_smbfs 8 ,
.Xr mount_std 8 ,
.Xr mount_udf 8 ,
.Xr mount_umapfs 8 ,
.Xr mount_unionfs 8 ,
.Xr umount 8
.Sh バグ
異常なファイルシステムをマウントすると、
システムクラッシュを引き起こすことがあります。
.Sh 警告
.Nm
に成功した後にマウントされたファイルシステムから
.Pa ..\&
がアクセス可能かどうかは、
元のマウントポイントのパーミッションが決定します。
全ユーザが双方向にマウントポイントを行き来可能とするために最低限必要な
パーミッションは 0111 (全員が実行可能) です。
.Sh 歴史
.Nm
ユーティリティは
.At v1
から登場しています。
