freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_ext2fs.8
.\" Copyright (c) 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/mount_ext2fs/mount_ext2fs.8,v 1.13 2002/08/21 18:10:56 trhodes Exp %
.\" $FreeBSD$
.\"
.Dd January 31, 1996
.Dt MOUNT_EXT2FS 8
.Os
.Sh 名称
.Nm mount_ext2fs
.Nd ext2fs ファイルシステムをマウントする
.Sh 書式
.Nm
.Op Fl o Ar options
.Ar special
.Ar node
.Sh 解説
.Nm
ユーティリティは ext2fs ファイルシステムの
.Ar special
デバイスをファイルシステムツリーの
.Ar node
に接続します。
.Pp
通常このコマンドは、ブート時に
.Xr mount 8
によって実行されます。
.Pp
オプションは、次の通りです:
.Bl -tag -width indent
.It Fl o
.Fl o
フラグの後には、コンマで区切ったオプション文字列を指定することができます。
指定可能なオプションとその意味は、
.Xr mount 8
マニュアルページを参照して下さい。
.El
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh 歴史
.Nm
ユーティリティの機能は
.Fx 2.2
から登場しました。
