freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_ntfs.8
.\"
.\" Copyright (c) 1993,1994 Christopher G. Demetriou
.\" Copyright (c) 1999 Semen Ustimenko
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/mount_ntfs/mount_ntfs.8,v 1.6.2.5 2001/08/01 08:32:31 obrien Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/mount_ntfs.8,v 1.7 2001/07/29 05:15:28 horikawa Exp $
.\" revision 1.2.2.2 に追従済
.Dd January 3, 1999
.Dt MOUNT_NTFS 8
.Os FreeBSD
.Sh 名称
.Nm mount_ntfs
.Nd NTFS ファイルシステムをマウントする
.Sh 書式
.Nm
.Op Fl a
.Op Fl i
.Op Fl u Ar uid
.Op Fl g Ar gid
.Op Fl m Ar mask
.Pa special
.Pa node
.Sh 解説
.Nm
コマンドは、デバイス
.Pa special
中の NTFS ファイルシステムを、グローバルファイルシステム名前空間の
.Pa node
で示される位置へ接続します。
通常、このコマンドはブート時に
.Xr mount 8
により実行されます。
任意のユーザが、
自己が所有するディレクトリ上に
NTFS ファイルシステムをマウントするために使用することも可能です (もちろん、
ファイルシステムを含むデバイスへの適切なアクセス権限が必要です)。
.Pp
オプションは次の通りです:
.Bl -tag -width Ds
.It Fl a
.Fn readdir
においても、MS-DOS 8.3 形式の名前を返す振舞いを強制します。
.It Fl i
POSIX 名以外のすべての名前に対し、
名前検索で大文字小文字を区別しないようにします。
.It Fl u Ar uid
ファイルシステム中のファイルの所有者を
.Ar uid
に設定します。
デフォルトの所有者は、
ファイルシステムがマウントされたディレクトリの所有者です。
.It Fl g Ar gid
ファイルシステム中のファイルのグループを
.Ar gid
に設定します。
デフォルトのグループは、
ファイルシステムがマウントされたディレクトリのグループです。
.It Fl m Ar mask
ファイルシステム中のファイルの、最大のパーミッションを指定します。
.El
.Sh 特徴
NTFS のファイル属性は、次のようにアクセスされます:
.Bd -literal -offset indent
foo[[:ATTRTYPE]:ATTRNAME]
.Ed
.Pp
.Sq ATTRTYPE
は、ボリュームの $AttrDef ファイルに列挙されている識別子のうちのひとつです。
デフォルトは $DATA です。
.Sq ATTRNAME
は属性の名前です。デフォルトは none です。
.Sh 使用例
.Pa /dev/ad1s1
の ntfs ボリュームをマウントするには、次のようにします:
.Bd -literal -offset indent
# mount_ntfs /dev/ad1s1 /mnt
.Ed
.Pp
ボリューム名を (Unicode で) 取得するには、次のようにします:
.Bd -literal -offset indent
# cat /mnt/\\$Volume:\\$VOLUME_NAME
.Ed
.Pp
ディレクトリの生のデータを読み込むには、次のようにします:
.Bd -literal -offset indent
# cat /mnt/foodir:\\$INDEX_ROOT:\\$I30
.Ed
.Sh 書き込み
書き込み能力には制限があります。
制限:
ファイルは非常駐である必要があり、
疎であっては (未初期化領域を持っていては) なりません
圧縮ファイルもまたサポートしていません。
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh 警告
このユーティリティが提供する NTFS ボリュームへのアクセスは、
ほぼ読み込み専用アクセスだけです。
.Sx 書き込み
の節を参照してください。
.Sh 歴史
.Nm
が最初に登場したのは
.Fx 3.0
です。
.Sh 作者
NTFS のカーネル実装と、
.Nm
と、マニュアルを、
.An Semen Ustimenko Aq semenu@FreeBSD.org
が記述しました。
