freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_udf.8
.\" Copyright (c) 2002
.\"     Scott Long <scottl@FreeBSD.org>
.\"	Jeroen Ruigrok van der Werven <asmodai@wxs.nl>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/mount_udf/mount_udf.8,v 1.4 2002/12/12 05:56:36 trhodes Exp %
.\"
.\" $FreeBSD$
.Dd March 23, 2002
.Dt MOUNT_UDF 8
.Os
.Sh 名称
.Nm mount_udf
.Nd UDF ファイルシステムのマウント
.Sh 書式
.Nm
.Op Fl v
.Op Fl o Ar options
.Ar special | node
.Sh 解説
.Nm
ユーティリティは、デバイス
.Ar special
上の UDF ファイルシステムを、グローバルファイルシステムの名前空間の
.Ar node
の示す位置に接続します。
.Pp
オプションは次の通りです:
.Bl -tag -width indent
.It Fl o
.Fl o
フラグの後には、コンマで区切ったオプション文字列を指定します。
指定可能なオプションとその意味は、
.Xr mount 8
マニュアルページを参照して下さい。
以下に示す UDF 特有のオプションが使用可能です:
.It Fl v
UDF ファイルシステムのマウントに関して冗長に報告します。
.El
.Sh 関連項目
.Xr cdcontrol 1 ,
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh 歴史
.Nm
ユーティリティは、
.Fx 5.0
で初めて登場しました。
