freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_cd9660.8
.\" Copyright (c) 1993, 1994
.\"     The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Christopher G. Demetriou.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mount_cd9660.8	8.3 (Berkeley) 3/27/94
.\" %FreeBSD: src/sbin/mount_cd9660/mount_cd9660.8,v 1.12.2.5 2002/03/22 12:53:35 murray Exp %
.\"
.\" $FreeBSD$
.Dd March 27, 1994
.Dt MOUNT_CD9660 8
.Os
.Sh 名称
.Nm mount_cd9660
.Nd ISO-9660 ファイルシステムのマウント
.Sh 書式
.Nm
.Op Fl begjrv
.Op Fl o Ar options
.Op Fl s Ar startsector
.Ar special | node
.Sh 解説
.Nm
コマンドは、デバイス名
.Pa special
上の ISO-9660 ファイルシステムを、
グローバルファイルシステムの名前空間の
.Pa node
の示す位置に接続します。
通常このコマンドは、ブート時に
.Xr mount 8
によって実行されます。
.Pp
オプションは、次の通りです:
.Bl -tag -width indent
.It Fl b
補助ボリューム記述フラグ欄のチェックを緩めます。
この欄に誤った値が設定されている、Joliet フォーマットのディスクがあります。
.It Fl e
拡張属性を使用します。
.It Fl g
ファイルのバージョン番号を取り除きません (デフォルトでは、ディスク上に
異なったバージョン番号を持つファイルが存在する場合、最新のものだけが
見えます)。
どちらの場合でも、明示的にバージョン番号を指定しなくてもファイルを
オープンする事が出来ます。
.It Fl j
ファイルシステムに含まれる Joliet 拡張を使用しません。
.It Fl o
.Fl o
フラグの後には、コンマで区切ったオプション文字列を指定することができます。
指定可能なオプションとその意味は、
.Xr mount 8
マニュアルページを参照して下さい。
次に示す cd9660 特有のオプションを使用可能です:
.Pp
.Bl -tag -width "nostrictjoliet" -compact
.It Cm extatt
.Fl e
と同じです。
.It Cm gens
.Fl g
と同じです。
.It Cm nojoliet
.Fl j
と同じです。
.It Cm norrip
.Fl r
と同じです。
.It Cm nostrictjoliet
.Fl b
と同じです。
.El
.It Fl r
ファイルシステムに含まれるロックリッジ拡張 (Rockridge extension) を
使用しません。
.It Fl s Ar startsector
ファイルシステム開始位置を
.Ar startsector
とします。
通常、対象のデバイスが CD-ROM ドライブの場合、
.Nm
はデータを持つ CD-ROM の最後のトラックを見つけて、
ファイルシステム開始位置をそこであるとします。
デバイスが CD-ROM でない場合もしくは目録が判明しない場合、
ファイルシステムはセクタ 0 から開始されます。
このオプションはこの動作を変更するものです。
.Ar startsector
は CD-ROM ブロック、すなわち 2048 バイトが単位であることに注意して下さい。
これは
.Xr cdcontrol 1
の
.Cm info
コマンドの例が示す通りです。
ここで正しい
.Ar startsector
を指定することで、マルチセッション CD の任意のセッションをマウント可能です。
.It Fl v
どのセクタから開始するかについての決定について冗長に報告します。
.El
.Sh 使用例
次のコマンドで、Kodak Photo-CD をマウント可能です:
.Pp
.Dl "mount_cd9660 -o rw -v -s 0 /dev/cd0c /cdrom"
.Sh 関連項目
.Xr cdcontrol 1 ,
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh バグ
POSIX デバイスノードマッピングは、現在サポートしていません。
.Pp
ロックリッジ拡張 (Rockridge extension) で使用している場合、
バージョン番号を取り除きません。
この場合、ロックリッジ名を持たないファイルをバージョン番号なしで
アクセスすると、バージョン番号の最も大きいファイルではなく、
小さいファイルをアクセスします。
.Pp
ECMA はサポートしていません。
.Sh 歴史
.Nm
ユーティリティは、
.Bx 4.4
で最初に登場しました。
