freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_std.8
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/mount_std/mount_std.8,v 1.9.2.6 2001/12/14 15:17:52 ru Exp %
.\" $FreeBSD$
.\"
.Dd May 13, 1996
.Dt MOUNT_STD 8
.Os
.Sh 名称
.Nm mount_std ,
.Nm mount_fdesc ,
.Nm mount_kernfs ,
.Nm mount_linprocfs ,
.Nm mount_procfs
.Nd
.Dq 標準
ファイルシステムをマウントする
.Sh 書式
.Nm mount_ Ns Ar fsname
.Op Fl o Ar options
.Ar "fs"
.Ar mount_point
.Sh 解説
.Nm
は ``標準'' ファイルシステムをファイルシステムにマウントする一般的な機構です。
.Nm
は現在以下のファイルシステムをサポートしています:
.Nm fdesc ,
.Nm kernfs ,
.Nm linprocfs ,
.Nm procfs
。
``標準'' ファイルシステムは:
.Bl -enum -offset indent
.It
標準の
.Fl o
オプションだけを受け付けます
.Dq ro
.Pq Dq rdonly ,
.Dq rw ,
.Dq nodev ,
.Dq noexec ,
.Dq nosuid ,
.Dq union
。
.It
ユーザに見える名前と同じ、カーネルファイルシステムモジュール名を持ちます。
.It
.Nm
では特別な処理を行う必要は有りません。
.El
.Pp
オプションを以下に示します:
.Bl -tag -width indent
.It Fl o
.Fl o
フラグの後には、コンマで区切ったオプション文字列を指定することができます。
指定可能なオプションとその意味は、
.Xr mount 8
マニュアルページを参照して下さい。
.El
.Pp
.Nm
は 0 番目のコマンドライン引数(呼ばれたコマンド名)を検査し、
マウントすべきファイルシステムを判定します。
これが
.Dq Li _ Ns Ar fsname
で終らない場合、
.Nm
は(
.Xr mount 8
と同じく)、ファイルシステムタイプの名前のみが 0 番目の引数に格納されていると
見倣します。
.Nm
は、この様にマウントされる分散ファイルシステムのコマンドへの
適切なリンクとして、通常はインストールされます。
各ファイルシステムの機能に関しては、
.Nm mount_ Ns Ar fsname
を御覧下さい。
.Pp
ファイルシステムに関する詳細は以下のマニュアルページを参照下さい:
.Xr fdesc 5 ,
.Xr kernfs 5 ,
.Xr linprocfs 5 ,
.Xr procfs 5
。
.Sh 診断
.Bl -diag
.It argv[0] must end in _fsname
.Nm
コマンドが
.Dq Li mount_std
の 0 番目の引数のコマンドとして呼ばれました。
.It vfsload(%s)
.Nm
は %s ファイルシステムタイプを実装するカーネルモジュールをロードできません。
.It %s filesystem not available
固有のファイルシステムタイプがカーネル中に存在せず、
ロード可能なモジュールが見付かりません。
.El
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr getvfsbyname 3 ,
.Xr fdesc 5 ,
.Xr fstab 5 ,
.Xr kernfs 5 ,
.Xr linprocfs 5 ,
.Xr procfs 5 ,
.Xr mount 8
.Sh 警告
``標準'' ファイルシステムは NFS エクスポートできません。
.Sh 歴史
.Nm
は
.Fx 2.2
から登場しました。
ロード可能なファイルシステムモジュールは
.Fx 2.0
から登場しました。
.Dq fdesc ,
.Dq kernfs ,
.Dq procfs
ファイルシステムタイプは
.Fx 2.0
から登場しました;
.Dq linprocfs
ファイルシステムタイプは
.Fx 4.0
から登場しました。
