freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mountd.8
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mountd.8	8.4 (Berkeley) 4/28/95
.\"	%Id: mountd.8,v 1.5.2.3 1997/05/14 08:19:20 dfr Exp %
.\" jpman %Id: mountd.8,v 1.3 1997/05/19 17:06:05 horikawa Stab %
.\"
.Dd April 28, 1995
.Dt MOUNTD 8
.Os
.Sh 名称
.Nm mountd
.Nd リモートの
.Tn NFS
マウント要求に対するサービスを行うデーモン
.Sh 書式
.Nm /sbin/mountd
.Op Fl 2nr
.Op Ar exportsfile
.Sh 解説
.Nm mountd
は、他のクライアントマシンからの
.Tn NFS
マウント要求のためのサーバです。
.Nm mountd
は、
.Tn NFS
サーバの仕様で示されているポート
番号でサービス要求を待ちます。詳細は RFC1094
.%T "Network File System Protocol Specification"
の Appendix A と
.%T "NFS: Network File System Version 3 Protocol Specification" 
の Appendix I
を参照してください。
.Pp
.Nm mountd
では、以下のオプションや引数を指定できます:
.Bl -tag -width Ds
.It Fl 2
.Fl 2
オプションを使用すると、
このサーバからファイルシステムをマウントするクライアントに対し、
管理者はバージョン 2 NFS プロトコルのみの使用を強制できます。
.It Fl n
このオプションは、非ルートからのマウント要求を許可します。
このオプションは、
クライアントが PC であるなど、それがどうしても必要な
場合にのみ使うようにしてください。
その場合、自動的に vfs.nfs.nfs_privport sysctl フラグがクリアされます。
このフラグはカーネルが nfs 要求を受け付けるのが、
予約されたポートからのみか否かを制御します。
.It Fl r
.Fl r
オプションは，レギュラーファイルに対するマウント RPC 要求を許可します。
これは，マウントプロトコルの仕様によると危険なようですが，
いくつかのディスクレスワークステーションは，スワップファイルをマウント
しようとしますし，それがレギュラーファイルであることを期待しています。
レギュラーファイルは，
.Pa /etc/exports ,
で指定できないので，スワップが置かれようとしているファイルシステム全体
が，
.Fl alldirs
フラグとともに公開されていなければなりません。
.Ar exportsfile
には、公開する(
.Tn NFS
エキスポートする)
ファイルシステムを記述したファイル
(公開設定ファイル:エキスポートファイル)のある場所を
指定します。
.\" ↓以下の文も原文に対応が無い
.\" デフォルトは
.\" .Pa /etc/exports
.\" です。
.El
.Pp
起動されると、
.Nm mountd
は
.Xr mount 2
システムコールによって、公開するホストアドレスとオプションを
カーネル内にロードします。
公開設定ファイルを変更した場合は、
.Nm mountd
に対して回線切断シグナルを送って
公開設定情報を再ロードする必要があります。
.Dv SIGHUP
を送ったあと(例:
kill -HUP `cat /var/run/mountd.pid`
)、エキスポートファイルにエラーがあるかどうか、
syslogの出力をチェックしてください。
.Pp
動作中のカーネルは
.Tn NFS
を組み込んでいないものであると判明した場合、
.Nm mountd
は、
.Xr vfsload 3
を用いる
.Xr modload 8
コマンドを使って、
.Tn NFS
を含むローダブルカーネルモジュールのロードを試みます。
これが失敗するか、
.Tn NFS LKM
が使用できない場合は、
.Nm mountd
はエラー終了します。
.\" ↓使用例の章は原文には存在しないのでコメントアウトする -- jpman J.Sakai
.\" .Sh 使用例
.\" .Pa /etc/exports
.\" の例:
.\" .Pp
.\" .Bd -literal -offset indent
.\" /home/aino -alldirs
.\" .Ed
.\" .Pp
.\" これは、
.\" .Pa /home/aino
.\" 以下のファイルシステムをすべて
.\" .Tn NFS
.\" で公開しています。
.\" 詳細は、
.\" .Xr exports 5
.\" を参照してください。
.Sh 関連ファイル
.Bl -tag -width /var/run/mountd.pid -compact
.It Pa /etc/exports
公開設定ファイル(エキスポートファイル)
.It Pa /var/run/mountd.pid
現在実行中の
.Nm mountd
のプロセス id
.Tn ID
.It Pa /var/db/mountdtab
現在マウントされているリモートファイルシステムのリスト
.El
.Sh 関連項目
.Xr nfsstat 1 ,
.Xr exports 5 ,
.Xr modload 8 ,
.Xr nfsd 8 ,
.Xr portmap 8 ,
.Xr showmount 8
.Sh 歴史
.Nm mountd
ユーティリティは 
.Bx 4.4 
から登場しています。
