freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_umapfs.8
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry and from John Heidemann of the UCLA Ficus project.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)mount_umap.8	8.4 (Berkeley) 5/1/95
.\" %FreeBSD: src/sbin/mount_umapfs/mount_umapfs.8,v 1.21 2004/07/02 21:45:04 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd May 1, 1995
.Dt MOUNT_UMAPFS 8
.Os
.Sh 名称
.Nm mount_umapfs
.Nd ファイルシステム層のサンプルファイルシステム
.Sh 書式
.Nm
.Op Fl o Ar options
.Fl u Ar uid-mapfile
.Fl g Ar gid-mapfile
.Ar target
.Ar mount-point
.Sh 解説
.Nm
ユーティリティは、
ローカルシステムとは異なる uid, gid を使用するファイルシステムの
サブツリーをマウントするために使用します。
そのようなファイルシステムには、別のサイトの NFS や
別のパスワードを使用する場所から持って来たリムーバブルメディア上の
ファイルシステムがあります。
.Pp
.Nm
ユーティリティはユーザが提供するファイルのセットを使用し、
サブツリーの元の環境とローカルの環境との uid, gid の対応を取ります。
例えば、ユーザ smith は、元の環境では uid 1000 を持ち、ローカル環境では
uid 2000 を持つとします。
.Nm
ユーティリティは、
smith のオリジナルの環境で持っているファイルを次のようにマップさせます:
uid 1000 が所有するファイルを、実際には uid 2000 が所有者である
かのように見せます。
.Pp
以下のオプションを使用可能です:
.Bl -tag -width indent
.It Fl o
.Fl o
のあとに、コンマで区切ってオプション文字列を指定することができます。
可能なオプションとその意味は
.Xr mount 8
を参照してください。
.It Ar target
ローカルシステムの名前空間において、サブツリーの現在位置。
.It Ar mount-point
マップされたサブツリーが置かれるディレクトリ。
.It Fl u Ar uid-mapfile
.It Fl g Ar gid-mapfile
識別子の対応が記述されます。
それぞれのファイルの 1 行目には、そのファイルがいくつの対応を
持っているかを記述します。
2 行目からは、各行に対応を記述します。
最初の項目はローカル環境での id で、次の項目がオリジナル環境での id で、
項目は空白で区切ります。
.Ar uid-mapfile
にはすべての uid の対応を、
.Ar gid-mapfile
にはすべての gid の対応を記述するべきです。
.Ar uid-mapfile
に記載されない uid は NOBODY と、
.Ar gid-mapfile
に記載されない gid は NULLGROUP と扱われます。
uid の対応は 64 個まで、gid の対応は 16 個まで記述することができます。
.El
.Pp
マップファイルはファイル階層のどこにでも置くことができますが、
ファイルの所有者は root で、root のみが書き込めるようにしておかなければ
なりません。
.Nm
ユーティリティは、もしこれらのファイルの所有者や権限が
不適切な場合はサブツリーをマップしません。
もしマップファイルの 1 行目の対応数と実際の対応数が異なる場合も、
実行を停止します。
.Pp
.Nm
ユーティリティで作られるファイルシステム層は、簡単なファイルシステム層の
例となっています。
商品としての利用は考えられていません。
そのため、あまり洗練された実装ではありません。
.Sh 関連項目
.Xr mount 8 ,
.Xr mount_nullfs 8
.Sh バグ
本ファイルシステムタイプは、まだ完全にはサポートされていません
(注: 機能しないということです) し、
実際のところ使用するとシステム上のデータを破壊するかもしれません。
自己責任において使用してください。
猛犬注意。
濡れていて滑ります。
.Pp
危険性を減らすためには、このコードもまた所有者を必要としています -
真面目なハッカーの方はメールを
.Aq hackers@freebsd.org
に送って
引き継ぎの意思を宣言してください。
.Sh 歴史
.Nm
は
.Bx 4.4
から実装されました。
