freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_nwfs.8
.\" %FreeBSD: src/sbin/mount_nwfs/mount_nwfs.8,v 1.7.2.4 2001/03/05 19:33:46 ru Exp %
.\" $FreeBSD$
.Dd October 14, 1999
.Dt MOUNT_NWFS 8
.Os FreeBSD
.Sh 名称
.Nm mount_nwfs
.Nd NetWare ファイルサーバから NetWare ボリュームをマウントする
.Sh 書式
.Nm
.Op Fl Chv
.Fl S Ar server
.Fl U Ar user
.Op Fl connection\ options
.Fl V Ar volume
.Op Fl M Ar mode
.Op Fl c Ar case
.Op Fl d Ar mode
.Op Fl f Ar mode
.Op Fl g Ar gid
.Op Fl l Ar locale
.Op Fl n Ar os2
.Op Fl u Ar uid
.Op Fl w Ar scheme
.Ar node
.Nm
.Op Fl options
.Ar /server:user/volume[/path]
.Ar node
.Sh 解説
.Nm
コマンドは NetWare サーバのボリュームをマウントすることを可能にします。
既にあるコネクションを使用することも新しくコネクションを作成することも
可能であり、もし使用可能なコネクションが見つからなければ新しいコネクションを
作成しようとします。コネクションはそれを参照しているものを数えているので、
最後のマウントボリュームが解放されるとコネクションは閉じられます。また、
.Xr ncplogin 1 
を用いて、なにもマウントせずに、コネクションを作成可能です
(マウント用に、このコネクションを後から使用可能です)。
.Pp
コマンドラインのふたつの形式に注意してください。ひとつ目の形式では、サーバと
ユーザは
.Fl S
及び
.Fl U
オプションによって指定されます。ふたつ目の形式では、サーバとユーザは
.Xr mount 8
コマンドの引数の
.Ar special
の部分で指定されます (
.Fl S ,
.Fl U ,
.Fl V
はこの場合には使われません)。これにより、
.Xr fstab 5
ファイルを使用可能になります (
.Sx 使用例
を参照してください)。
.Pp
オプションは以下の通りです。
.Bl -tag -width indent
.It Fl S Ar server
接続する NetWare サーバ名を指定します。ネイティブ IP を使用する場合は同様に
.Fl A
オプションが必要です。
.It Fl U Ar user
ログインに使用するユーザ名を指定します。
.It Fl connection\ options
詳細は
.Xr ncplogin 1
を参照してください。
.It Fl V Ar volume
マウントするボリューム名を指定します。
ボリューム名は、すべてのオプションの後かつ
.Ar mount-point 
の手前で、指定することもできます。
.It Ar node
マウントボリュームへのパスを指定します。
.It Fl c Ar case
.Ar case 
オプションは名前の表記に作用します。
.Ar case 
は以下のどれかひとつを使用します。
.Bl -tag -width "ValueXX"
.It Em 値
.Em 意味
.It l
すべての既存のファイル名を小文字に変換します。
OS2 の名前空間で新しく作られたファイルは小文字の名前
になります。これは DOS 名前空間でボリュームをマウント
するときのデフォルトです。
.It L
'l' と同じですが、ファイルシステムを大文字小文字に
敏感でないようにしようとします。うまく動作しないかも
しれません。
.It n
大文字小文字の変換を行ないません。
.Em 注意 !
DOS 名前空間でこのオプションを使用するのは、
最終手段にしてください。DOS 名前空間で小文字の
ファイル名を作成すると、予期しない結果になります。
これは OS2 名前空間をマウントするときのデフォルト
です。
.It u
すべての既存のファイル名を大文字に変換します。
OS2 の名前空間で新しく作られたファイルは大文字の名前
になります。
.It U
'u' と同様ですが、ファイルシステムを大文字小文字に
敏感でないようにしようとします。うまく動作しないかも
しれません。
.El
.It Fl f Ar mode , Fl d Ar mode
ファイルやディレクトリにつけられるパーミッションを指定します。
値は 8 進数で指定される必要があります。ファイルモードの既定値はマウント
ポイントのものが用いられ、ディレクトリの場合は読み込みパーミッションがある
場合に実行パーミッションが付加されます。
.Pp
これらの許可情報は NetWare サーバが認めるものとは異なったものでありうる
ということに注意してください。
.It Fl n Ar namespace
.Ar namespace 
で指定した名前空間を使用しません。
現在のところ
.Ar OS2
だけをここに指定可能です。
.It Fl v
バージョン番号を表示します。
.It Fl u Ar uid , Fl g Ar gid
ファイルにつけられる所有者 ID とグループ ID を指定します。
既定値ではボリュームがマウントされているディレクトリの
所有者 ID とグループ ID が使用されます。
.It Fl l Ar locale
文字の変換に使用するロケールを設定します。
.Nm
は既定値として、環境変数
.Ev LC_* 
を参照します。
.It Fl w Ar scheme
NetWare と
.Fx 
の間でファイル名を変換するための
.Ar scheme 
を指定します。現在は、
.Ar koi2cp866 
と
.Ar asis 
だけをここに指定可能です。変換方法はコンパイル時に
.Pa config.mk
ファイルで許可されていることが必要であることに注意してください。
.It Fl M Ar mode
詳細は
.Xr ncplogin 1 
を参照してください。
このオプションが省略されると、コネクションのパーミッションには
ディレクトリモード
.Pq Fl d
オプションが仮定されます。
.El
.Sh 関連ファイル
.Bl -tag -width /var/log/wtmp -compact
.It Pa ~/.nwfsrc
はコネクションその他に関して静的なパラメータを保持します。
詳細は
.Pa /usr/share/examples/nwclient/dot.nwfsrc
を参照してください。
.El
.Sh 注
NCP コネクションが確立される前に、カーネルは IPX サポートを含むように
設定され、IPXrouted と KLD nwfs.ko が読み込まれていることが必要です。
.Sh 使用例
次の例は NetWare サーバ
.Em nwserv
に、ユーザ名
.Em GUEST
として接続し、ボリューム
.Em SYS
と
.Em VOL1 
をマウントすることを説明しています。
.Bd -literal -offset indent
mount_nwfs -S nwserv -U guest -V sys /nw/s1/sys
mount_nwfs /nwserv:guest/sys /nw/s1/sys
mount -t nwfs /nwserv:guest/vol1 /nw/s1/vol1
mount -t nwfs /nwserv:boris/sys/home/boris /home/boris/nw/home
.Ed
.Pp
最後の例はボリュームのサブディレクトリだけをマウントし、
NetaWare の 'map root' コマンドと等価です。
.Pp
また
.Xr fstab 5
を、nwfs でのマウントに使用することもできます。
.Bd -literal -offset indent
/nwserv:guest/sys       /nw/s1/sys     nwfs  rw,noauto 0   0
/nwserv:guest/vol1      /nw/s1/vol2    nwfs  rw,noauto 0   0
.Ed
.Sh 歴史
.Nm
ユーティリティが最初に登場したのは
.Fx 4.0
です。
.Sh バグ
若干存在します。
.Sh CREDITS
.Fx 
での NetWare クライアントの開発では、下記のソースを使用しました。
.Pp
NetWare NDK に関する文書
.Pp
Ncpfs for Linux - 
.An Volker Lendecke Aq lendecke@math.uni\-goettingen.de
が書きました。
彼のコードの一部を、BSD スタイルのライセンスで公開することを認めてくれました。
.Pp
"Interrupt List" は
.An Ralf Brown 
からのものです。
.Pp
また、
.Pa /sys
のたくさんのファイルを使用しています。
.Sh 作者
.An Boris Popov Aq bp@butya.kz ,
.Aq rbp@chat.ru
