freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_msdosfs.8
.\"	%NetBSD: mount_msdos.8,v 1.13 1998/02/06 05:57:00 perry Exp %
.\"
.\" Copyright (c) 1993,1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/mount_msdosfs/mount_msdosfs.8,v 1.30 2004/05/17 08:35:42 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd April 7, 1994
.Dt MOUNT_MSDOSFS 8
.Os
.Sh 名称
.Nm mount_msdosfs
.Nd MS-DOS ファイルシステムをマウントする
.Sh 書式
.Nm
.Op Fl o Ar options
.Op Fl u Ar uid
.Op Fl g Ar gid
.Op Fl m Ar mask
.Op Fl M Ar mask
.Op Fl s
.Op Fl l
.Op Fl 9
.\".Op Fl G
.Op Fl L Ar locale
.Op Fl D Ar dos-codepage
.Op Fl W Ar table
.Pa special
.Pa node
.Sh 解説
.Nm
コマンドは、デバイス名
.Pa special
上の MS-DOS ファイルシステムを、
グローバルファイルシステムの名前空間の
.Pa node
の示す位置に接続します。
通常このコマンドは、ブート時に
.Xr mount 8
によって実行されますが、
任意のユーザが、
自分の所有する任意のディレクトリに
MS-DOS ファイルシステムをマウントするために使うこともできます。
(もちろん、
そのファイルシステムを含むデバイスに対して
適切なアクセスを行えることが条件ですが。)
.Pp
オプションは以下のものが使用できます:
.Bl -tag -width Ds
.It Fl o Ar options
指定されたマウントオプション
.Ar options
を
.Xr mount 8
の記述通りに使用します。
下記の MSDOS ファイルシステム固有のオプションが使用可能です:
.Bl -tag -width indent
.It Cm longnames
Windows 95 の長いファイル名が見えるように強制します。
.It Cm shortnames
古い MS-DOS 8.3 スタイルのファイル名のみが見えるように強制します。
.It Cm nowin95
Windows 95 の拡張ファイル情報を完全に無視します。
.El
.It Fl u Ar uid
ファイルシステム上のファイルの所有者を
.Ar uid
にします。デフォルトの所有者はファイルシステムがマウントされるディレクトリの
所有者です。
.It Fl g Ar gid
ファイルシステム上のファイルのグループを
.Ar gid
にします。デフォルトのグループはファイルシステムがマウントされるディレクトリの
グループです。
.It Fl m Ar mask
ファイルシステム上のファイルの最大のパーミッションを指定します。
(例えば、
.Ar mask
.Li 755
は、デフォルトで、
.\" ここでの by default は「MS-DOS の『ファイル属性』として特別な指定
.\" がないとき」という意味であると思われる。意味がわかりにくいが、原文
.\" もわかりにくいので、特に説明を補わない。
.\"	by <seki@sysrap.cs.fujitsu.co.jp>
所有者がファイルの読み書き実行の権限を持ち、
他のユーザが読みと実行の権限だけを持つことを指定します。
8 進のファイルモードに関しては
.Xr chmod 1
を御覧下さい。)
.Ar mask
の下位 9 ビットのみが使用されます。
.Ar -M
が指定され、
.Ar -m
が省略された場合には、前者の値が使用されます。
デフォルトの
.Ar mask
は、
ファイルシステムがマウントされるディレクトリから取得されます。
.It Fl M Ar mask
ファイルシステム中のディレクトリの最大ファイルパーミッションを指定します。
.Ar -m
が指定され、
.Ar -M
が省略された場合には、前者の値が使用されます。
詳細は、前のオプションの記述を参照してください。
.It Fl s
Win'95 のロングファイル名を無視し、生成しないよう、強制します。
.It Fl l
Win'95 のロングファイル名のリストおよび生成を強制し、
生成/修正/アクセス日を分離するように強制します。
.Pp
.Fl s
も
.Fl l
も指定されない場合、
.Nm
は既存の Win'95 のロングファイル名から
マウントすべきファイルシステムのルートディレクトリを探してマウントします。
このようなエントリが見付からなかった場合で、
短い DOS ファイル名が見付かった場合、
.Fl s
がデフォルトです。そうでない場合、
.Fl l
が仮定されます。
.It Fl 9
ファイルを削除およびリネームするときにおいても、
特殊な Win'95 のディレクトリエントリを無視します。
これは
.Fl s
を強制します。
.\".It Fl G
.\"This option causes the file system to be interpreted as an Atari-Gemdos
.\"file system. The differences to the MS-DOS file system are minimal and
.\"limited to the boot block. This option enforces
.\".Fl s .
.It Fl L Ar locale
DOS と Win'95 のファイル名変換において使用される
ロケール名を指定します。
デフォルトでは ISO 8859-1 がローカルな文字セットと仮定されます。
.It Fl D Ar dos-codepage
DOS のファイル名を変換する時に使用する、
MS-DOS コードページ (IBM/OEM コードページとも呼ばれます) の名前を指定します。
.It Fl W Ar table
.Bf Em
このオプションは後方互換性のためだけに維持されており、
将来削除されます。
このオプションを使用しないでください。
.Ef
.Pp
変換表には次のようなテキストファイル名を指定します:
.Pa iso22dos , iso72dos , koi2dos , koi8u2dos
。
.El
.Sh 使用例
.Pa /dev/ad1s1
にあるロシア語 MSDOS ファイルシステムをマウントする場合:
.Pp
.Dl "mount_msdosfs -L ru_RU.KOI8-R -D CP866 /dev/ad1s1 /mnt"
.Pp
.Pa /dev/ad1s1
にある日本語 MSDOS ファイルシステムをマウントする場合:
.Pp
.Dl "mount_msdosfs -L ja_JP.eucJP -D CP932 /dev/ad1s1 /mnt"
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Pp
List of Localized MS Operating Systems:
.Pa http://www.microsoft.com/globaldev/reference/oslocversion.mspx
。
.Sh 警告
Win'95 で使用しているものと同様の手続きを使用して注意しているにもかかわらず、
.Fl 9
フラグを使用するとファイルシステムを破壊することがあります。
.Pp
.Fx 2.1
およびそれ以前のバージョンでは 16K より大きなクラスタサイズを扱えませんでした。
MS-DOS ファイルシステムをマウントするだけで、
そのファイルシステムを破壊してしまうことがありました。
16K より大きなクラスタサイズは
1G より大きなファイルシステムでは避けようがありませんし、
1G より大きなファイルシステムを FIPS で縮めたときにも発生し得ます。
.Sh 歴史
.Nm
は
.Fx 2.0
にて初めて登場しました。
この元になった、
.Nm mount_pcfs
は
.Fx 1.0
にて登場しましたが、
よりそれらしい名前の
.Nm
が出来たため廃止されました。
.Pp
文字コード変換ルーチンは 2003 年に
.An Ryuichiro Imura Aq imura@ryu16.org
が追加しました。
