freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mount_portalfs.8
.\"
.\" Copyright (c) 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)mount_portal.8	8.3 (Berkeley) 3/27/94
.\" %FreeBSD: src/usr.sbin/mount_portalfs/mount_portalfs.8,v 1.14 2004/08/07 04:27:50 imp Exp %
.\"
.\" $FreeBSD$
.\"
.\"
.Dd March 27, 1994
.Dt MOUNT_PORTALFS 8
.Os
.Sh 名称
.Nm mount_portalfs
.Nd ポータルデーモンをマウントする
.Sh 書式
.Nm
.Op Fl o Ar options
.Ar /etc/portal.conf
.Ar mount_point
.Sh 解説
.Nm
ユーティリティは、ポータルデーモンが提供するインスタンスを
ファイルシステムの名前空間に付加します。
慣例的なマウントポイントは
.Pa /p
です。このコマンド
は、通常、ブート時に
.Xr mount 8
によって実行されます。
.Pp
オプション:
.Bl -tag -width indent
.It Fl o
オプションは
.Fl o
のあとにオプション文字列をコンマで区切って並べることにより指定します。
指定できるオプションとそれらの意味は
.Xr mount 8
を参照してください。
.El
.Pp
ポータルデーモンは
.Em open
サービスを提供します。ポータルマウントポイント下で
オブジェクトをオープンすると、ポータルデーモンは設定ファイル中で指定
されたルールに従って動的にそのオブジェクトを生成します。
この機構を使えば、ソケットなどの記述子をファイルシステムの
名前空間の中で使うことができるようになります。
.Pp
ポータルデーモンは、オープンしようとするオブジェクトのフルパス名を
与えることによって動作します。デーモンは、設定ファイル中のルールに従って
適切な記述子を生成し、この記述子を open システムコールの
戻り値として
呼び出しプロセスに返します。
.Sh 名前空間
慣例に従い、ポータルデーモンは名前空間を部分名前空間に分割します。
それぞれの部分名前空間は特定の型のオブジェクトを扱います。
.Pp
次の部分名前空間が実装されています:
.Pa tcplisten ,
.Pa tcp ,
.Pa fs
。
.Pa tcplisten
名前空間はスラッシュで区切られるホスト名とポートを与えられ、
指定されたホスト名とポートの組にバインドされる TCP/IP ソケットを作成します。
ホスト名は "ANY" を指定することが可能であり、
この場合他のどんなホストであってもこのソケットに接続可能です。
ポート番号 0 を指定すると動的にポートを割り当てます。
返されるファイル記述子を使用して
.Xr getsockname 2
を呼び出すことで、割り当てられたポートを得られます。
特権ポートに対するバインドは、スーパユーザのみ可能です。
.Pa tcp
名前空間はホスト名とポート番号(スラッシュ``/''で区切られる)
を与えられることで
.Tn TCP/IP
接続を確立します。
.Pa fs
名前空間は、ルートディレクトリまで戻ってそこからたどった名前の
ファイルをオープンします。
これは chroot によってルートディレクトリが変更された環境において、
もとのファイルシステムをアクセスする手法を安全に提供するために使用できます。
.Sh 設定ファイル
設定ファイルはルールのリストによって構成されます。
それぞれのルールは 1 行に書かれ、空白で区切られた 2 つ以上のフィールドからなります。
ハッシュ記号 (``#'') から行末までは無視されます。
空行も無視されます。
.Pp
第 1 フィールドはパス名のプレフィックスで、要求されたパス名と比較されます。
一致するものが見つかると、第 2 フィールドがデーモンに渡されてどの型の
オブジェクトを生成するかが示されます。
その後に続くフィールドは生成関数に渡されます。
.Bd -literal -offset indent
# @(#)portal.conf       5.1 (Berkeley) 7/13/92
tcplisten/	tcplisten tcplisten/
tcp/            tcp tcp/
fs/             file fs/
.Ed
.Sh 関連ファイル
.Bl -tag -width /p/* -compact
.It Pa /p/*
慣例的なマウントポイント
.El
.Sh 関連項目
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh 警告
このファイルシステムは
.Tn NFS
によってエクスポートすることはできません。
.Sh 歴史
.Nm
は
.Bx 4.4
から登場しました。
