freebsd/freebsd-doc/ja_JP.eucJP/man/man8/moused.8
.\" Copyright (c) 1996
.\"	Mike Pritchard <mpp@FreeBSD.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mike Pritchard.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: moused.8,v 1.1.2.2 1997/09/29 06:36:12 charnier Exp %
.\"
.\" jpman %Id: moused.8,v 1.3 1997/07/22 16:52:17 horikawa Stab %
.Dd December 16, 1996
.Dt MOUSED 8
.Os FreeBSD
.Sh 名称
.Nm moused
.Nd マウスデータをコンソールドライバに渡す
.Sh 書式
.Nm
.Op Fl DRcdfs
.Op Fl S Ar baudrate
.Fl p Ar port
.Fl t Ar mousetype
.Sh 解説
マウスデーモンは、シリアルポートからマウスデータを受け取り、
データを解釈し、コンソールドライバに ioctl で渡します。
.Pp
以下のオプションがあります。
.Bl -tag -width indent
.It Fl D
シリアルポートの DTR を下げます。
.It Fl R
シリアルポートの RTS を下げます。
.It Fl S Ar baudrate
シリアルポートの速度を指定します (1200 ボーから 9600 ボー
が指定できます ) 。
.It Fl c
ChordMiddle オプションを有効にします。
.It Fl d
デバッグ用のメッセージを有効にします。
.It Fl f
デーモンにならずに、フォアグラウンドプロセスとして実行します。
.It Fl p Ar port
マウスと通信するためのシリアルポートとして
.Ar port
を使います。
.It Fl s
シリアルラインのために 9600 ボーを選びます。
.It Fl t Ar mousetype
シリアルポートにつながっているマウスの形式を指定します。
有効なマウスの形式は、以下のものです。
.Pp
.Bl -tag -compact -width mousesystemsxxx
.It microsoft
マイクロソフトマウス
.It mousesystems
マウスシステムマウス
.It mmseries
MM Series マウス
.It logitech
ロジテックマウス
.It busmouse
バスマウス
.It mouseman
Logitech MouseMan と TrackMan
.It ps/2
PS/2 マウス
.It mmhittab
MM HitTablet
.El
.El
.Sh 使用例
.Pp
.Dl moused -t microsoft -p /dev/mouse 
.Dl vidcontrol -m on
.Pp
マウスデーモンを、シリアルデバイス
.Pa /dev/mouse
に対し、マイクロソフトマウス、マウスポインタ有効の条件で開始します。
.Sh 関連項目
.Xr vidcontrol 1 ,
.Xr keyboard 4 ,
.Xr pcvt 4 ,
.Xr screen 4 ,
.Xr sysmouse 4
.Sh 作者
.Nm
コマンドは、
.An Michael Smith
によって書かれました。
このマニュアルは、
.An Mike Pritchard .Aq mpp@FreeBSD.org
によって書かれました。
.Sh 歴史
.Nm
コマンドは、
.Fx 2.2 
から導入されました。
