freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mrinfo.8
.\" jpman %Id: mrinfo.8,v 1.2 1997/05/25 15:18:08 horikawa Stab %
.TH MRINFO 8
.UC 5
.SH 名称
mrinfo \- マルチキャストルータの設定情報を表示する
.SH 書式
.B /usr/sbin/mrinfo
[
.B \-d
.I debug_level
] [
.B \-r 
.I retry_count
] [
.B \-t 
.I timeout_count
] 
.B multicast_router

.SH 解説
.I mrinfo
は、
.I multicast_router
で指定したマルチキャストルータの設定情報を表示します。
.PP
.I mrinfo
は、ASK_NEIGHBORS IGMP メッセージを送信することで隣接するマルチキャスト
ルータのデータ取得を行ないます。指定したマルチキャストルータからの応答が
あった場合には、バージョン番号と隣接するマルチキャストルータのアドレス一
覧が応答に含まれます。応答したルータが最新のマルチキャストバージョン番号を
持つ場合には、
.I mrinfo
はメトリック、スレッシュホールド、フラグのような追加情報を要求します。指
定したマルチキャストルータからの返答があると、当該ルータから取得した設定
情報が標準出力に表示されます。
.br
.ne 5
.SH 起動
.PP
"\-d" オプションはデバッグレベルを設定します。デバッグレベルがデフォルト
レベルであるところの 0 よりも大きい場合、追加デバッグメッセージが画面に出力
されます。デバッグレベルにかかわらず、エラーについてはエラーメッセージ
が出力され、
.I mrinfo
は終了します。
デバッグレベルが 0 でない場合、以下の効果が期待できます:
.IP "level 1"
パケットウォーニングが標準エラー出力に対して出力されます。
.IP "level 2"
レベル 1 のすべてのメッセージに加えて、ネットワークダウンについて標準エラー
出力に対して出力されます。
.IP "level 3"
レベル 2 のすべてのメッセージに加えて、パケットタイムアウトのすべての情報が
標準エラー出力に対して出力されます。
.PP
"\-r retry_count" オプションは隣接ルータに対するリトライ制限を設定します。
デフォルトではリトライ回数は 3 です。
.PP
"\-t timeout_count" 
オプションは隣接ルータからの返答を待つ時間(タイムアウト)を秒単位で設定
します。デフォルトのタイムアウトは 4 秒です。
.PP
.SH 出力例
.nf
.I mrinfo mbone.phony.dom.net
127.148.176.10 (mbone.phony.dom.net) [version 3.3]:
 127.148.176.10 -> 0.0.0.0 (?) [1/1/querier]
 127.148.176.10 -> 127.0.8.4 (mbone2.phony.dom.net) [1/45/tunnel]
 127.148.176.10 -> 105.1.41.9 (momoney.com) [1/32/tunnel/down]
 127.148.176.10 -> 143.192.152.119 (mbone.dipu.edu) [1/32/tunnel]
.fi
.PP
指定したマルチキャストルータに隣接する個々のルータの IP アドレスが
表示されます。
指定したルータの IP アドレスに続き、隣接するルータの IP アドレスと名前
が表示されます。その後の括弧内には、メトリック(接続コスト)、スレッシュ
ホールド(マルチキャストパケット生存時間)が表示されます。問い合わせを受けた
マルチキャストルータが新しいバージョンの場合には、接続タイプ(tunnel, srcrt)
および接続状態(disabled, down)が表示されます。
.PP
.SH 注意
.I mrinfo
は、root で実行して下さい。
.PP
.SH 関連項目
.BR mrouted (8) ,
.BR map-mbone (8) ,
.BR mtrace (8)
.PP
.SH 作者
Van Jacobson
