freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mrinfo.8
.\" %FreeBSD: src/usr.sbin/mrouted/mrinfo.8,v 1.14 2002/12/27 12:15:38 schweikh Exp %
.\"
.\" $FreeBSD$
.Dd May 8, 1995
.Dt MRINFO 8
.Os
.Sh 名称
.Nm mrinfo
.Nd マルチキャストルータの設定情報を表示する
.Sh 書式
.Nm
.Op Fl d Ar debug_level
.Op Fl r Ar retry_count
.Op Fl t Ar timeout_count
.Ar multicast_router
.Sh 解説
.Nm
ユーティリティは、
.Ar multicast_router
で指定したマルチキャストルータの設定情報を表示します。
.Pp
.Nm
ユーティリティは、
ASK_NEIGHBORS IGMP メッセージを送信することで隣接するマルチキャスト
ルータのデータ取得を行ないます。指定したマルチキャストルータからの応答が
あった場合には、バージョン番号と隣接するマルチキャストルータのアドレス一
覧が応答に含まれます。応答したルータが最新のマルチキャストバージョン番号を
持つ場合には、
.Nm
はメトリック、スレッシュホールド、フラグのような追加情報を要求します。指
定したマルチキャストルータからの返答があると、当該ルータから取得した設定
情報が標準出力に表示されます。
.Pp
以下のオプションを使用可能です:
.Bl -tag -width indent
.It Fl d
デバッグレベルを設定します。デバッグレベルがデフォルト
レベルであるところの 0 よりも大きい場合、追加デバッグメッセージが画面に出力
されます。デバッグレベルにかかわらず、エラーについてはエラーメッセージ
が出力され、
.Nm
は終了します。
デバッグレベルが 0 でない場合、以下の効果が期待できます:
.Bl -tag -width indent
.It "level 1"
パケットウォーニングが標準エラー出力に対して出力されます。
.It "level 2"
レベル 1 のすべてのメッセージに加えて、ネットワークダウンについて標準エラー
出力に対して出力されます。
.It "level 3"
レベル 2 のすべてのメッセージに加えて、パケットタイムアウトのすべての情報が
標準エラー出力に対して出力されます。
.El
.It Fl r Ar retry_count
隣接ルータに対するリトライ制限を設定します。
デフォルトではリトライ回数は 3 です。
.It Fl t Ar timeout_count
隣接ルータからの返答を待つ時間(タイムアウト)を秒単位で設定
します。デフォルトのタイムアウトは 4 秒です。
.El
.Sh 出力例
.Bd -literal
.Nm mrinfo Ar mbone.phony.dom.net
127.148.176.10 (mbone.phony.dom.net) [version 3.3]:
 127.148.176.10 -> 0.0.0.0 (?) [1/1/querier]
 127.148.176.10 -> 127.0.8.4 (mbone2.phony.dom.net) [1/45/tunnel]
 127.148.176.10 -> 105.1.41.9 (momoney.com) [1/32/tunnel/down]
 127.148.176.10 -> 143.192.152.119 (mbone.dipu.edu) [1/32/tunnel]
.Ed
.Pp
指定したマルチキャストルータに隣接する個々のルータの IP アドレスが
表示されます。
指定したルータの IP アドレスに続き、隣接するルータの IP アドレスと名前
が表示されます。その後の括弧内には、メトリック(接続コスト)、スレッシュ
ホールド(マルチキャストパケット生存時間)が表示されます。問い合わせを受けた
マルチキャストルータが新しいバージョンの場合には、接続タイプ(tunnel, srcrt)
および接続状態(disabled, down)が表示されます。
.Sh 注意
.Nm
ユーティリティは、root で実行して下さい。
.Sh 関連項目
.Xr mrouted 8 ,
.Xr map-mbone 8 ,
.Xr mtrace 8
.Sh 作者
.An Van Jacobson
