freebsd/freebsd-doc/ja_JP.eucJP/man/man8/mtest.8
.\"
.\" %FreeBSD: src/usr.sbin/mtest/mtest.8,v 1.7 2002/07/14 14:44:27 charnier Exp %
.\"
.\" The following requests are required for all man pages.
.\"
.\" $FreeBSD$
.Dd December 15, 1996
.Os
.Dt MTEST 8
.Sh 名称
.Nm mtest
.Nd マルチキャストメンバシップソケット操作と ioctl のテスト
.Sh 書式
.Nm
.Sh 解説
.Nm
ユーティリティはマルチキャストメンバシップソケット操作と ioctl のテストを行なう
簡単なプログラムです。
以下のコマンドを対話的に受け取ります:
.Bl -tag -width "a ifname e.e.e.e.e.e" -compact -offset indent
.It Ic j Ar g.g.g.g Ar i.i.i.i
アドレス
.Ar i.i.i.i
を持つインタフェース上で、IP グループアドレス
.Ar g.g.g.g
に加わります。
.Ar i.i.i.i
に 0.0.0.0 を指定するとデフォルトインタフェースを使用します。
.It Ic l Ar g.g.g.g Ar i.i.i.i
アドレス
.Ar i.i.i.i
を持つインタフェース上で、IP グループアドレス
.Ar g.g.g.g
から抜けます。
.It Ic a Ar ifname Ar e.e.e.e.e.e
インタフェース
.Ar ifname
上で、イーサネットグループアドレス
.Ar e.e.e.e.e.e
に加わります。
.It Ic d Ar ifname Ar e.e.e.e.e.e
インタフェース
.Ar ifname
上で、イーサネットグループアドレス
.Ar e.e.e.e.e.e
から抜けます。
.It Ic m Ar ifname Ar 1/0
インタフェース
.Ar ifname
で、ALLMULTI モードをセットあるいはリセットします。
.It Ic p Ar ifname Ar 1/0
インタフェース
.Ar ifname
で、promiscuous モードをセットあるいはリセットします。
.It Ic ?\&
有効なコマンド一覧を表示します。
.It Ic q
プログラムを終了します。
.El
.\" .Sh SEE ALSO
.Sh 作者
.An Steve Deering
.Sh バグ
コマンドパーサはそれほど柔軟性をもっていません。
