freebsd/freebsd-doc/ja_JP.eucJP/man/man8/named-xfer.8
.\" ++Copyright++ 1985
.\" -
.\" Copyright (c) 1985
.\"    The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" 	This product includes software developed by the University of
.\" 	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" -
.\" Portions Copyright (c) 1993 by Digital Equipment Corporation.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies, and that
.\" the name of Digital Equipment Corporation not be used in advertising or
.\" publicity pertaining to distribution of the document or software without
.\" specific, written prior permission.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND DIGITAL EQUIPMENT CORP. DISCLAIMS ALL
.\" WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS.   IN NO EVENT SHALL DIGITAL EQUIPMENT
.\" CORPORATION BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\" -
.\" Portions Copyright (c) 1999 by Check Point Software Technologies, Inc.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies, and that
.\" the name of Check Point Software Technologies Incorporated not be used
.\" in advertising or publicity pertaining to distribution of the document
.\" or software without specific, written prior permission.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND CHECK POINT SOFTWARE TECHNOLOGIES
.\" INCORPORATED DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE,
.\" INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS.
.\" IN NO EVENT SHALL CHECK POINT SOFTWARE TECHNOLOGIES INCORPORATED
.\" BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR
.\" ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER
.\" IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT
.\" OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\" --Copyright--
.\"
.\"	from named.8	6.6 (Berkeley) 2/14/89
.\"
.\" $FreeBSD$
.Dd June 26, 1993
.Dt NAMED-XFER 8
.Os BSD 4
.Sh 名称
.Nm named-xfer
.Nd ゾーン転送のための補助エージェント
.Sh 書式
.Nm named-xfer
.Fl z Ar zone_to_transfer
.Fl f Ar db_file
.Fl s Ar serial_no
.Op Fl d Ar debuglevel
.Op Fl l Ar debug_log_file
.Op Fl i Ar ixfr_file
.Op Fl t Ar trace_file
.Op Fl p Ar port#
.Op Fl C Ar class
.Op Fl S
.Op Fl q 
.Op Fl x Ar src_address
.Op Fl T Ar tsig_file
.Ar nameserver
.Op Sy axfr | ixfr
.Sh 解説
.Nm
は、
.Xr named 8
によって実行される補助プログラムです。
インターネットネームサーバから呼び出されて、ゾーン情報を受け取ります。
直接実行されることはまれであり、ゾーン転送の問題を解決するために
システム管理者によってのみ実行されることがある程度です。
インターネットネームドメインシステムについての詳細は、
RFC 1033、1034、1035 を参照してください。
.Pp
オプションとしては、以下のものがあります:
.Bl -tag -width Fl
.It Fl z Ar zone_to_transfer
転送されるゾーン名を指定します。
.It Fl f Ar db_file
プライマリサーバからゾーンが転送された際に、ゾーンの情報をダンプ (格納) する
.Ar db_file
のファイル名を指定します。
.It Fl s Ar serial_no
転送されるゾーンの情報のシリアル番号を指定します。プライマリサーバから
得た
.Sy SOA RR
が、このシリアル番号よりも高いシリアル番号を持たない
場合は、転送は中止されます。
.It Fl d Ar debuglevel
デバッグ情報を出力します。
.Ar debuglevel
出力されるメッセージのレベルを決定します。
.It Fl l Ar debug_log_file
デバッグメッセージのログファイルを指定します。デフォルトでは
システムに依存しますが、通常は
.Pa /var/tmp
または
.Pa /usr/tmp
です。このオプションは
.Fl d
と同時に指定されたときのみ適用されますので注意してください。
.It Fl i Ar ixfr_file
.Ar ixfr_file
の名前を指定します。
Incremental Zone Transfer (IXFR) によりゾーン変更内容を
プライマリサーバから受信すると、
このゾーン変更内容をこのファイルにダンプ (格納) します。
.It Fl t Ar trace_file
ゾーン情報転送のプロトコルトレースを格納するトレースファイル
.Ar trace_file
を指定します。
このオプションはネームサーバそのものをデバッグする人にとってのみ
有益なのかもしれません。
.It Fl p Ar port#
デフォルト以外のポート番号を使用するときに指定します。
デフォルトの標準ポートナンバーは
``domain'' サービスの
.Xr getservbyname 3
の返す値になります。
.It Fl C Ar class
使用中のクラスを定義します。
デフォルトは 'IN' です。
.It Fl S
SOA レコードと NS レコードの転送のみを許可し、
ゾーンに対して A レコードを結合します。
SOA レコードは
.Xr named 8
によって読み込まれませんが、
NS レコードをいつ検証するのかを決定するのに使用されます。
詳しくは
.Xr named 8
の
.Dq Li stubs
を参照してください。
.It Fl q 
named-xfer が静かになるようにします。
.It Fl x Ar src_address
この問い合わせに使用する、始点アドレスを指定します。
.It Fl T Ar tsig_file
named-xfer に対し、TSIG 情報を送るファイルを指定します。
次の書式の複数エントリです:
.Pp
.Bl -hang -width "IP address" -compact
.It IP address
このアドレスに接続するとき、TSIG 鍵を使用します。
.It key name
.It algorithm
157 (HMAC-MD5) が唯一のサポートされたアルゴリズムです。
.It key data
base64
.El
.Pp
named-xfer は、このファイルが一時的なものであることを期待し、
使用後にこれを明示的に削除します。
.El
.Pp
付加的な引数としてネームサーバのアドレスを、いわゆる
.Dq dotted-quad
構文で
.Em のみ
、とります。ネームサーバのアドレスの省略は許されません。
少なくとも一つのアドレスを指定しなくてはなりません。
ネームサーバのアドレスが複数指定されると、最初のサーバが転送を失敗すると、
順番にサーバを切り替えて転送を試みます。
ネームサーバアドレスの後の
.Sy axfr
または
.Sy ixfr
は、実行するゾーン転送タイプを指定します。
全ゾーン転送には
.Sy axfr
を使用し、インクリメンタルゾーン転送には
.Sy ixfr
を使用してください。
.Sh 関連項目
.Xr hostname 7,
.Xr named 8 ,
.Xr resolver 3 ,
.Xr resolver 5 ,
RFC 882, RFC 883, RFC 973, RFC 974, RFC 1033, RFC 1034, RFC 1035,
RFC 1123, RFC 1995
.Dq Name Server Operations Guide for Sy BIND .
