freebsd/freebsd-doc/ja_JP.eucJP/man/man8/named.8
.\" ++Copyright++ 1985, 1996
.\" -
.\" Copyright (c) 1985, 1996
.\"    The Regents of the University of California.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" 	This product includes software developed by the University of
.\" 	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" -
.\" Portions Copyright (c) 1993 by Digital Equipment Corporation.
.\" 
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies, and that
.\" the name of Digital Equipment Corporation not be used in advertising or
.\" publicity pertaining to distribution of the document or software without
.\" specific, written prior permission.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS" AND DIGITAL EQUIPMENT CORP. DISCLAIMS ALL
.\" WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS.   IN NO EVENT SHALL DIGITAL EQUIPMENT
.\" CORPORATION BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\" -
.\" --Copyright--
.\"
.\"	@(#)named.8	6.6 (Berkeley) 2/14/89
.\" jpman %Id: named.8,v 1.4 1997/11/11 13:59:51 horikawa Stab %
.\"
.Dd February 1, 1996
.Dt NAMED 8 
.Os BSD 4
.Sh 名称
.Nm named 
.Nd インターネットドメインネームサーバ (DNS)
.Sh 書式
.Nm NAMED
.Op Fl d Ar debuglevel
.Op Fl p Ar port# 
.Oo Fl Po 
.Cm b Ns \&| Ns Cm c
.Pc
.Ar config_file
.Oc
.Op Fl f q r v
.Op Fl u Ar user_name
.Op Fl g Ar group_name
.Op Fl t Ar directory
.Op Fl w Ar directory
.Op Ar config_file
.Sh 解説
.Ic named
はインターネットドメインネームサーバです。
インターネットドメインネームシステムの詳細な情報については
RFC 1033, 1034, 1035 を参照してください。
パラメータがない場合は
.Ic named
はデフォルトの設定ファイルである
.Pa /etc/namedb/named.conf
の初期化データを読み込み、問い合わせに対し待機します。
コマンド行の最後に与えられた
.Ar config_file
引数は
.Dq Fl b
または
.Dq Fl c
フラグを使用して指定された
.Ar config_file
を無効にします。
.Pp
.Sy 注:
.Nm named 
のいくつかのオプションと多くの動作は、設定ファイルの中で
制御できます。更なる情報はこの
.Sy BIND
配布物に含まれる設定ファイルガイドを参照してください。
.Pp
指定できるオプションは以下の通りです。
.Bl -tag -width Fl
.It Fl d Ar debuglevel
デバッグ情報を出力します。
.Ar debuglevel 
は表示するメッセージのレベルを決定する数字です。もし負の値の場合、
.Ar debuglevel
は
.Dq 1
に設定されます。
.Pp
.Sy 注:
新しいデバッグの枠組は古いバージョンの
.Nm NAMED
よりもかなり洗練されています。
設定ファイルの
.Dq Li logging
宣言は (問い合わせや内/外への転送などの) 多くの種類にわたるイベント
それぞれに対して、複数の別々なデバッグレベルを設定することができます。
これらの広範囲にわたる新しい機能に関する更なる情報は、この
.Sy BIND
配布物に含まれる設定ファイルガイドを参照してください。
.It Fl p Ar port#
指定されたリモートポート番号を使用します。このポート番号は
.Nm NAMED
が問い合わせを送る番号です。デフォルトの値は標準のポート番号、つまり
.Xr getservbyname 3 
が
.Dq Li domain
に対して返すポート番号です。
.Pp
.Sy 注:
以前は、
.Dq Fl p Ar port# Ns Op Ar \&/localport#
という文法が使用でき、1 つ目のポートが
.Em remote 
サーバへの接続に使用され、2 つ目のポートが
.Nm NAMED 
の
.Em local 
サーバに対するポート番号として使用されました。
現在の使用法は古い使用法から
.Ar localport#
の指定を除いたものと同等です。この機能は
設定ファイルの
.Dq Li options
宣言にある
.Dq Li listen-on
節で指定できます。
.It Xo Fl Po 
.Cm b Ns \&| Ns Cm c
.Pc Ar config_file
.Xc
代わりの
.Ar config_file
を使用します。
この引数はコマンド行の最後に指定された
.Ar config_file
によって上書きされます。
デフォルトの値は
.Pa /etc/namedb/named.conf
です。
.It Fl f
このプロセスを表で動かし、
.Xr fork 2
やデーモン化をしません (デフォルトではデーモン化をします)。
.It Fl q
.Nm NAMED 
が
.Li QRYLOG 
を定義してコンパイルされている場合に、
すべての問い合わせのトレースを行ないます。
.Pp
.Sy 注: 
設定ファイルの
.Dq Li logging 
宣言で
.Dq Li queries
.Em logging category 
する方が賛成され、このオプションは反対されています。
更なる情報は、この
.Sy BIND
配布物に含まれる設定ファイルガイドを参照してください。
.It Fl r
再帰的なネームサーバの問い合わせを抑止します。
問い合わせに対してはローカルゾーン (プライマリもしくはセカンダリ) からのみ
回答されます。
この指定はルートサーバにて使用することができます。
デフォルトでは再帰的な問い合わせを行ないます。
.Pp
.Sy 注: 
このオプションは設定ファイルの
.Dq Li options
宣言の
.Dq Li recursion 
節によって上書きされ、またそちらのほうが推奨されています。
.It Fl v
バージョンを報告し、終了します。
.It Fl u Ar user_name
ユーザを指定すると、初期化後のサーバがこのユーザで動作します。
値はユーザ名または数字のユーザ ID どちらでも構いません。
.Dq Fl g
フラグが指定されていなかった場合、
指定されたユーザのプライマリグループがグループ ID として使用されます
(initgroups() が呼ばれるため、ユーザの所属するすべてのグループがサーバに
渡されます)。
.Pp
.It Fl g Ar group_name
グループを指定すると、初期化後のサーバがこのグループで動作します。
値はグループ名または数字のグループ ID どちらでも構いません。
.Pp
.It Fl t Ar directory
サーバがコマンド行引数を処理したらすぐに chroot() するべき
ディレクトリを指定します。
.Pp
.It Fl w Ar directory
サーバの作業ディレクトリを設定します。設定ファイルの
.Dq Li options
宣言の
.Dq Li directory 
節はコマンド行で指定したあらゆる値を上書きします。
デフォルトの作業ディレクトリはカレントディレクトリ
.Pq Dq \&. 
です。
.El
.Pp
それ以外の引数は上で述べたとおり、
古い実装との互換性のために、設定ファイルの名前として扱われます。この引数は
.Dq Fl b
または
.Dq Fl c
フラグを使用して指定される
.Ar config_file
を無効にします。
特に引数が与えられなければ、デフォルトの設定ファイルが使用されます
.Pq Pa /etc/namedb/named.conf
。
.Ss マスタファイル形式
マスタファイルは制御情報とゾーン中のオブジェクトの
資源レコードのリストからなり、次の形式を取ります。
.Bd -literal -offset indent
$INCLUDE <filename> <opt_domain>
$ORIGIN <domain>
$TTL <ttl>
<domain> <opt_ttl> <opt_class> <type> <resource_record_data>
.Ed
.Pp
ここで、
.Bl -tag -width "opt_domain  " 
.It Ar domain
ルートの場合は
.Dq Li \&. 
を、現在の起点の場合は
.Dq Li @ 
を、それら以外では通常のドメイン名を指定します。
.Ar domain
が
.Dq Li \&.
で終って
.Em いない
通常のドメイン名である場合は、
現在の起点がドメインに追加されます。
ドメイン名が
.Dq Li \&.
で終っている場合は変更されません。
.It Ar opt_domain
このフィールドにはインクルードファイル中のデータの起点を定義します。
これはインクルードファイルの最初の行の前に
.Li $ORIGIN 
宣言を置くことと等価です。
このフィールドはオプショナルです。
.Ar opt_domain
フィールドやインクルードファイル中の
.Li $ORIGIN 
宣言はそのファイル自身の現在の起点を変更することはありません。
.It Ar ttl
明示的な TTL (time-to-live) を持たない
将来のレコードのためのデフォルトの TTL を、整数値で指定します。
.It Ar opt_ttl
このフィールドはオプションであり、
time-to-live を整数値で指定します。
設定されない場合、TTL は最後の $TTL 文から取得されます。
$TTL 文が存在しない場合、SOA の最小値が使用され、警告が生成されます。
.It opt_class
オブジェクトのアドレスの型を指定します。
現在はDARPAインターネットに接続するオブジェクトである
.Dv IN
のみがサポートされています。
.It Ar type
このフィールドには以下のトークンのうちひとつが含まれます。
括弧中におのおの
.Ar resource_record_data
フィールドに指定すべきデータを示しています。
.Bl -tag -width "HINFO    "  -offset indent
.It Dv A
ホストアドレス (4つ組ドット IP アドレス)
.It Dv NS
権威があるネームサーバ (ドメイン)
.It Dv MX
メールエクスチェンジャ (ドメイン)
優先順位 (0..32767) に引続き指定します。
優先順位は小さい値が優先順位の高いことを示します。
.It Dv CNAME
別名に対応した正式名 (ドメイン)
.It Dv SOA
オーソリティゾーンデータの開始を示します。
(ホストの属するドメイン、メンテナのドメインアドレス、
シリアル番号、その後にリフレッシュ、リトライ、有効期限、最小 TTL
(RFC 883 と RFC 2308 を参照)
の各値を秒で指定したパラメータが続く)。
.It Dv NULL
ヌルリソースレコード (形式やデータはありません)
.It Dv RP
いくつかのドメイン名の責任者 (メールアドレスか参照できるテキスト)
.It Dv PTR
ドメイン名のポインタ (ドメイン)
.It Dv HINFO
ホスト情報 (CPUタイプ、OSタイプ)
.El
.El
.Pp
通常は行末でリソースレコードは終了しますが、
左括弧と右括弧で囲まれた場合は複数行にまたがることが可能となります。
セミコロンから行末まではコメントとして扱われます。
.Pp
.Sy 注:
ここには示されていませんが、このほかのタイプのリソースレコードも存在します。
リソースレコードのすべてのタイプを知るには
.Sy BIND
Operations Guide
.Pq Dq BOG
を参照する必要があるでしょう。
新しい RFC にていくつかのリソースタイプが標準化されていますが、
このバージョンの
.Sy BIND
ではまだ実装されていません。
.Ss SOA レコード形式
各マスタゾーンファイルはそのゾーンの SOA レコードで始まらなければなりません。
以下に SOA レコードの例を示します。
.Bd -literal
@	IN	SOA	ucbvax.Berkeley.EDU. rwh.ucbvax.Berkeley.EDU. (
				1989020501	; serial
				10800	; refresh
				3600	; retry
				3600000	; expire
				86400 )	; minimum
.Ed
.Pp
SOA ではシリアル番号 (serial) を指定します。
シリアル番号はマスタファイルを更新するたびに変更する必要があります。
シリアル番号は小数点つきの数字を指定することもできますが、
整数への変換は乗算や加算ではなく文字列としてつなげて行っているため、
.Em あまり
賢い方法とはいえません。
年月日と 0〜99 のシリアル番号を使用することで、
このフィールドのサイズである符号なしの 32 ビット以内に収まります。
(このやり方は 4294 年には考え直す必要があることは確かですが、
それについては心配する必要はないでしょう)。
.Pp
セカンダリサーバは秒で指定されたリフレッシュ時間 (refresh) の間隔で
シリアル番号をチェックします。
シリアル番号に変更があれば、新しいデータを読み込むために
ゾーン情報が転送されます。
リフレッシュ時間が過ぎてもマスタサーバに接続できない場合は、
リトライ時間 (retry) の間隔でリフレッシュが試みられます。
期限切れ時間 (expire) が過ぎてマスタサーバに接続できない場合は、
セカンダリサーバはそのゾーンのすべてのデータを破棄します。
.Sh 注
ブートファイルでの
.Dq Li domain
と
.Dq Li suffixes
の指定は廃止され、
もっと便利なリゾルバベースの実装、すなわち部分的な形のドメイン名
(partially-qualified domain names) の接尾辞に置き変えられました。
以前のメカニズムでは多くの状況下で失敗することがあり、
特にローカルネームサーバが完全な情報を持っていない場合に失敗しました。
.Pp
以下に各シグナルを
.Xr kill 1
コマンドによってサーバに送った場合の効果を示します。
.Pp
.Bl -tag -width "SIGWINCH" 
.It Dv SIGHUP
サーバは
.Pa named.conf
を読み、データベースをロードし直します。
サーバがコンパイルオプションの
.Li FOCED_RELOAD
を定義されてコンパイルされている場合は、
.Dv SIGHUP
を送るとサーバはすべてのセカンダリゾーンのシリアル番号もチェックします。
通常、シリアル番号は SOA 中に指定された間隔でのみチェックされます。
.It Dv SIGINT
現在のデータベースとキャッシュの内容を
.Dq Pa /var/tmp/named_dump.db
または
.Dv _PATH_DUMPFILE
の値にダンプします。
.It Dv SIGILL
サーバが -DSTATS 付きでコンパイルされていれば、
統計データを
.Pa named.stats
にダンプします。
統計データはこのファイルの末尾に追加されます。
.It Dv SIGSYS
サーバがプロファイリング (サーバの fork, chdir と exit) を
有効にされてコンパイルされていれば、
プロファイリングデータを
.Pa /var/tmp
にダンプします。
.It Dv SIGTERM
更新されたデータが存在すればこれを保存し、サーバをシャットダウンします
.It Dv SIGUSR1
デバッグ機能を有効にします。
.Dv SIGUSR1
が送られるたびにデバッグレベルが上がります。
.Po Dv SIGUSR1
がない古いシステムでは
.Dv SIGEMT
が使われます。
.Pc
.It Dv SIGUSR2
デバッグ機能を完全に無効にします。
.Po Dv SIGUSR2
がない古いシステムでは
.Dv SIGFPE
が使われます。
.Pc
.It Dv SIGWINCH
すべてのサーバに入力される問い合わせの
.Xr syslog 8
による
ログ採取の有無を切り替えます。
(ログ採取はサーバが
.Li QRYLOG
オプションを指定されて
コンパイルされている必要があります。)
.Sh 関連ファイル
.Bl -tag -width "/var/tmp/named_dump.db (_PATH_DUMPFILE)   " -compact
.It Pa /etc/namedb/named.conf
デフォルトのネームサーバの設定ファイル
.It Pa /var/run/named.pid Pq Dv _PATH_PIDFILE
プロセス ID
.It Pa /var/tmp/named_dump.db Pq Dv _PATH_DUMPFILE
ネームサーバデータベースのダンプ
.It Pa /var/tmp/named.run Pq file:  Dv _PATH_DEBUG
デバッグ出力
.It Pa /var/tmp/named.stats Pq file:  Dv _PATH_STATS
ネームサーバの統計データ
.El
.Sh 関連項目
.Xr gethostbyname 3 ,
.Xr hostname 7 ,
.Xr kill 1 ,
.Xr resolver 3 , 
.Xr resolver 5 , 
.Xr signal 2 ,
RFC 882, RFC 883, RFC 973, RFC 974, RFC 1033, RFC 1034, RFC 1035, RFC 1123,
RFC 2308
.Dq Name Server Operations Guide for Sy BIND
