freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ndc.8
.\" Copyright (c) 1998,1999 by Internet Software Consortium
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND INTERNET SOFTWARE CONSORTIUM DISCLAIMS
.\" ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL INTERNET SOFTWARE
.\" CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\"
.\" $FreeBSD$
.Dd December 31, 1998
.Dt NDC 8 
.Os BSD 4
.Sh 名称
.Nm ndc 
.Nd ネームサーバデーモン制御プログラム
.Sh 書式
.Nm ndc
.Op Fl c Ar channel
.Op Fl l Ar localsock
.Op Fl p Ar pidfile
.Op Fl d
.Op Fl q
.Op Fl s
.Op Fl t
.Op Ar command
.Sh 解説
このコマンドを使用する事により、システム管理者はネームサーバを制御可能です。
.Ar command
を指定しないと、
.Ic ndc
は、EOF を読み込むまでの間コマンド入力を促します。
.Pp
オプションは次の通りです:
.Bl -tag -width Fl
.It Fl c Ar channel
制御チャネルのランデブポイントを指定します。
デフォルトは
.Pa /var/run/ndc
です (UNIX ドメインソケットであり、サーバのデフォルトの制御チャネルです)。
要求する制御チャネルが TCP/IP ソケットの場合、
.Ar channel
引数の書式は
.Sy ipaddr/port
になります (例えば
.Sy 127.0.0.1/54
は、ローカルホストの TCP ポート 54 になります。)
.It Fl l Ar localsock
本オプションは、クライアント側の制御チャネルを特定のアドレスに
.Xr bind 2
します。
特定のアドレス以外からの接続を拒否するように、サーバを設定可能です。
書式は
.Ar channel
のものと同じです (上述参照)。
.It Fl p Ar pidfile
古いネームサーバとの後方互換性のため、制御通信用に
.Ic ndc
は UNIX シグナルを使用可能です。
この機能は現在のネームサーバではオプションであり、いつかすべて消滅します。
使用可能な
.Ar command
の集合は、
シグナルによるインタフェースを使用した場合の方が狭いことに注意してください。
おそらく
.Ar pidfile
引数は
.Pa /var/run/named.pid
のようなものです。
.It Fl d
デバッグ出力を有効にします。主に開発者が興味を持つものです。
.It Fl q
プロンプトと結果のテキスト出力を抑制します。
.It Fl s
致命的でないエラー出力を抑制します。
.It Fl t
プロトコルとシステムのトレースを有効にします。
インストール時のデバッグに有用です。
.El
.Sh コマンド
いくつかのコマンドは
.Ic ndc
に組み込まれています。
ネームサーバがサポートする完全なコマンドセットは動的であり、これは
.Ar help
コマンド (後述参照) で確認できるはずです。
組み込みコマンドは次の通りです:
.Bl -tag -width Fl
.It Ar /help
組み込みコマンド用のヘルプを提供します。
.It Ar /exit
.Ic ndc
コマンドインタプリタから抜けます。
.It Ar /trace
トレース機能を切り替えます (前述の
.Fl t
の記述を参照)。
.It Ar /debug
デバッグ機能を切り替えます (前述の
.Fl d
の記述を参照)。
.It Ar /quiet
静寂機能を切り替えます (前述の
.Fl q
の記述を参照)。
.It Ar /silent
沈黙機能を切り替えます (前述の
.Fl s
の記述を参照)。
.El
.Sh 注釈
.Ar pidfile
モードで実行すると、
.Ar start
と
.Ar restart
のコマンドへの引数は、新しい
.Ic named
に対するコマンドラインとして渡されます。
.Ar channel
モードで実行すると、
.Ar start
コマンドは無く、
.Ar restart
コマンドは単にネームサーバに対して自己を
.Xr execvp 2
するよう通知します。
.Sh 作者
Paul Vixie (Internet Software Consortium)
.Sh 関連項目
.Xr named 8
