freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ndp.8
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: ndp.8,v 1.2 1999/10/07 05:26:13 itojun Exp %
.\"     %FreeBSD: src/usr.sbin/ndp/ndp.8,v 1.1.2.1 2000/04/20 15:24:40 phantom Exp %
.\" jpman %Id: ndp.8,v 1.4 2000/05/10 13:44:35 takaha Stab %
.\"
.\" WORD: neighbor discovery  近接探索
.Dd May 17, 1998
.Dt NDP 8
.Os KAME
.\"
.Sh 名称
.Nm ndp
.Nd IPv6 近接探索プロトコルを制御 / 診断する
.\"
.Sh 書式
.Nm ndp
.Fl a
.Op Fl ntl
.Nm ndp
.Fl A Ar wait
.Op Fl ntl
.Nm ndp
.Fl c
.Op Fl nt
.Nm ndp
.Fl d
.Op Fl nt
.Ar hostname
.Nm ndp
.Fl f
.Op Fl nt
.Ar filename
.Nm ndp
.Fl H
.Nm ndp
.Fl i
.Ar interface
.Nm ndp
.Fl p
.Nm ndp
.Fl P
.Nm ndp
.Fl r
.Nm ndp
.Fl R
.Nm ndp
.Fl s
.Op Fl nt
.Ar nodename
.Ar ether_addr
.Op temp
.\"
.Sh 解説
.Nm
コマンドは
近隣探索プロトコル (NDP) で使用される
アドレスマッピングテーブルを操作します。
.Bl -tag -width Ds
.It Fl a
現在存在する NDP エントリをダンプします。
.It Fl A Ar wait
.Fl a
.Pq NDP エントリのダンプ
を
.Ar wait
秒毎に繰り返します。
.It Fl c
全ての NDP エントリを削除します。
.It Fl d
指定された NDP エントリを削除します。
.It Fl f
.Ar filename
で指定されたファイルを解析します。
.It Fl H
ルーティングテーブルとデフォルトルータリストを
一致させます; リストの先頭のエントリをカーネルの
ルーティングテーブルリストにインストールします。
.It Fl i
指定されたインタフェースの ND 情報を表示します。
.It Fl l
数値での IPv6 アドレスを切り詰めません。
.It Fl n
数値アドレスからホスト名への解決を試みません。
.It Fl p
プレフィックスリストを表示します。
.It Fl P
プレフィックスリスト中の全てのエントリをフラッシュします。
.It Fl r
デフォルトルータリストを表示します。
.It Fl R
デフォルトルータリスト中の全てのエントリをフラッシュします。
.It Fl s
ノードに対する NDP エントリを登録します。
.It Fl t
.Xr tcpdump
の出力と統合可能にするために、
各エントリ毎にタイムスタンプを表示します。
.Fl A
とともに用いると有効です。
.El
.\"
.Sh 戻り値
.Nm
は成功時に 0 を、エラー時に 0 以外を返します。
.\"
.Sh 関連項目
.Xr arp 8
.\"
.Sh 歴史
.Nm
コマンドは WIDE Hydrangea IPv6 プロトコルスタックキットで
はじめて登場しました。
.\"
.\" .Sh BUGS
.\" (to be written)
