freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ndp.8
.\"	%FreeBSD: src/usr.sbin/ndp/ndp.8,v 1.13 2004/06/05 20:21:58 ru Exp %
.\"	$KAME: ndp.8,v 1.28 2002/07/17 08:46:33 itojun Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" WORD: neighbor discovery  近接探索
.Dd May 17, 1998
.Dt NDP 8
.Os
.\"
.Sh 名称
.Nm ndp
.Nd IPv6 近接探索プロトコルを制御 / 診断する
.\"
.Sh 書式
.Nm
.Op Fl nt
.Ar hostname
.Nm
.Op Fl nt
.Fl a | c | p
.Nm
.Op Fl nt
.Fl r
.Nm
.Op Fl nt
.Fl H | P | R
.Nm
.Op Fl nt
.Fl A Ar wait
.Nm
.Op Fl nt
.Fl d Ar hostname
.Nm
.Op Fl nt
.Fl f Ar filename
.Nm
.Op Fl nt
.Fl i
.Ar interface
.Op Ar flags ...
.Nm
.Op Fl nt
.Fl I Op Ar interface | Li delete
.Nm
.Op Fl nt
.Fl s Ar nodename etheraddr
.Op Li temp
.Op Li proxy
.\"
.Sh 解説
.Nm
ユーティリティは
近隣探索プロトコル (NDP) で使用される
アドレスマッピングテーブルを操作します。
.Bl -tag -width Ds
.It Fl a
現在存在する NDP エントリをダンプします。
次の情報が表示されます:
.Bl -tag -width NeighborXX
.It Neighbor
近隣の IPv6 アドレス。
.It Linklayer Address
近隣のリンク層アドレス。
アドレスが使用可能ではない場合
.Dq Li (incomplete)
となります。
.It Netif
近隣キャッシュエントリに関連付けられたネットワークインタフェース。
.It Expire
エントリの満了までの時間。
エントリは
.Dq Li permanent
であることも可能であり、この場合は永遠に満了しません。
.It S
近隣キャッシュエントリの状態であり、1 文字です:
.Pp
.Bl -tag -width indent -compact
.It N
Nostate
.It W
Waitdelete
.It I
Incomplete
.It R
Reachable
.It S
Stale
.It D
Delay
.It P
Probe
.It ?\&
未知の状態 (この状態にはならないはずです)。
.El
.It Flags
近隣キャッシュエントリのフラグであり、1 文字です。
フラグは次の通りです: ルータであり、近隣通知を代理
.Pq Dq p
。
このフィールドには 10 進数値が続くことがあります。
この数値は、現在の状態の間に、このノードが送出した NS プローブ数です。
.El
.It Fl A Ar wait
.Fl a
(NDP エントリのダンプ)
を
.Ar wait
秒毎に繰り返します。
.It Fl c
全ての NDP エントリを削除します。
.It Fl d
指定された NDP エントリを削除します。
.It Fl f
.Ar filename
で指定されたファイルを解析します。
.It Fl H
ルーティングテーブルとデフォルトルータリストを
一致させます; リストの先頭のエントリをカーネルの
ルーティングテーブルリストにインストールします。
.It Fl I
デフォルトルータが存在しないとき、
デフォルト経路として使用するデフォルトインタフェースを表示します。
.It Fl I Ar interface
デフォルトルータが存在しないとき、
デフォルト経路として使用するデフォルトインタフェースを指定します。
.Ar interface
がデフォルトとして使用されます。
.It Fl I Li delete
現在のデフォルトインタフェースをカーネルから削除します。
.It Fl i Ar interface Op Ar flags ...
指定されたインタフェースの ND 情報を表示します。
追加の引数として
.Ar flags
を指定すると、
.Nm
は、そのフラグをインタフェースに対して設定または削除します。
各フラグは、空白かタブ文字で区切る必要があります。
指定可能なフラグは次の通りです。
すべてのフラグは特殊文字
.Ql -
で開始可能であり、これはフラグを削除することを意味します。
この場合、
.Fl foo
の前に
.Fl -
が必要であることに注意してください。
.\"
.Pp
.Bl -tag -width Ds -compact
.It Ic nud
インタフェースの NUD
(Neighbor Unreachability Detection; 隣に到達不能であることの検知) を、
オンまたはオフにします。
通常、NUD はデフォルトでオンです。
.It Ic accept_rtadv
.Ar interface
で受信したルータ通知 (Router Advertisement) メッセージを
受理するかどうかを指定します。
このフラグがオンであったとしても、
.Li net.inet6.ip6.accept_rtadv
が非 0 でない限り、カーネルはルータ通知メッセージを受理しません。
このフラグはデフォルトで 1 です。
.It Ic prefer_source
出力パケット用の始点アドレス候補として
.Ar interface
上のアドレスを優先します。
始点アドレス選択のアルゴリズム全体に関する更なる詳細については、
KAME キットと共に提供される
.Pa IMPLEMENTATION
ファイルを参照してください。
.El
.It Fl n
数値アドレスからホスト名への解決を試みません。
.It Fl p
プレフィックスリストを表示します。
.It Fl P
プレフィックスリスト中の全てのエントリをフラッシュします。
.It Fl r
デフォルトルータリストを表示します。
.It Fl R
デフォルトルータリスト中の全てのエントリをフラッシュします。
.It Fl s
ノードに対する NDP エントリを登録します。
コマンド上で語
.Li temp
を指定しない限り、エントリは永続的です。
語
.Li proxy
を指定すると、このシステムは代理 NDP サーバとして動作します。
すなわち、ホストアドレスが自己のものでなくても、
.Ar hostname
に対する要求に応答します。
.It Fl t
.Xr tcpdump
の出力と統合可能にするために、
各エントリ毎にタイムスタンプを表示します。
.Fl A
とともに用いると有効です。
.El
.\"
.Sh 診断
.Ex -std
.\"
.Sh 関連項目
.Xr arp 8
.\"
.Sh 歴史
.Nm
ユーティリティは WIDE Hydrangea IPv6 プロトコルスタックキットで
はじめて登場しました。
.\"
.\" .Sh BUGS
.\" (to be written)
