freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ndp.8
.\"	%FreeBSD: src/usr.sbin/ndp/ndp.8,v 1.10 2003/08/05 14:57:11 ume Exp %
.\"	$KAME: ndp.8,v 1.15 2001/02/08 07:17:03 itojun Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.\" WORD: neighbor discovery  近接探索
.Dd May 17, 1998
.Dt NDP 8
.Os
.\"
.Sh 名称
.Nm ndp
.Nd IPv6 近接探索プロトコルを制御 / 診断する
.\"
.Sh 書式
.Nm
.Fl a
.Op Fl nt
.Nm
.Fl A Ar wait
.Op Fl nt
.Nm
.Fl c
.Op Fl nt
.Nm
.Fl d
.Op Fl nt
.Ar hostname
.Nm
.Fl f
.Op Fl nt
.Ar filename
.Nm
.Fl H
.Nm
.Fl I
.Op Cm delete | Ar interface
.Nm
.Fl i
.Ar interface
.Op Ar flags...
.Nm
.Fl p
.Nm
.Fl P
.Nm
.Fl r
.Nm
.Fl R
.Nm
.Fl s
.Op Fl nt
.Ar nodename
.Ar ether_addr
.Op Li temp
.Op Li proxy
.\"
.Sh 解説
.Nm
ユーティリティは
近隣探索プロトコル (NDP) で使用される
アドレスマッピングテーブルを操作します。
.Bl -tag -width Ds
.It Fl a
現在存在する NDP エントリをダンプします。
.It Fl A Ar wait
.Fl a
(NDP エントリのダンプ)
を
.Ar wait
秒毎に繰り返します。
.It Fl c
全ての NDP エントリを削除します。
.It Fl d
指定された NDP エントリを削除します。
.It Fl f
.Ar filename
で指定されたファイルを解析します。
.It Fl H
ルーティングテーブルとデフォルトルータリストを
一致させます; リストの先頭のエントリをカーネルの
ルーティングテーブルリストにインストールします。
.It Fl I Op Cm delete | Ar interface
デフォルトルータが存在しないとき、
デフォルト経路として使用するデフォルトインタフェースを表示または指定します。
引数を指定しないと、現在のデフォルトインタフェースが表示されます。
.Ar interface
を指定すると、そのインタフェースがデフォルトとして使用されます。
特別なキーワード
.Ic delete
を指定すると、現在のデフォルトインタフェースがカーネルから削除されます。
.It Fl i Ar interface Op Ar flags...
指定されたインタフェースの ND 情報を表示します。
追加の引数として
.Ar flags
を指定すると、そのフラグをインタフェースに対して設定または削除します。
指定可能なフラグは次の通りです。
すべてのフラグは特殊文字
.Ql -
で開始可能であり、これはフラグを削除することを意味します。
.\"
.Bl -tag -width Ds -compact
.It Xo
.Ic nud
.Xc
インタフェースの NUD
(Neighbor Unreachability Detection; 隣に到達不能であることの検知) を、
オンまたはオフにします。
通常、NUD はデフォルトでオンです。
.It Xo
.Ic accept_rtadv
.Xc
.Ar interface
で受信したルータ通知 (Router Advertisement) メッセージを
受理するかどうかを指定します。
このフラグがオンであったとしても、
.Li net.inet6.ip6.accept_rtadv
が非 0 でない限り、カーネルはルータ通知メッセージを受理しません。
このフラグはデフォルトで 1 です。
.El
.It Fl n
数値アドレスからホスト名への解決を試みません。
.It Fl p
プレフィックスリストを表示します。
.It Fl P
プレフィックスリスト中の全てのエントリをフラッシュします。
.It Fl r
デフォルトルータリストを表示します。
.It Fl R
デフォルトルータリスト中の全てのエントリをフラッシュします。
.It Fl s
ノードに対する NDP エントリを登録します。
コマンド上で語
.Li temp
を指定しない限り、エントリは永続的です。
語
.Li proxy
を指定すると、このシステムは代理 NDP サーバとして動作します。
すなわち、ホストアドレスが自己のものでなくても、
.Ar hostname
に対する要求に応答します。
.It Fl t
.Xr tcpdump
の出力と統合可能にするために、
各エントリ毎にタイムスタンプを表示します。
.Fl A
とともに用いると有効です。
.El
.\"
.Sh 戻り値
.Nm
は成功時に 0 を、エラー時に 0 以外を返します。
.\"
.Sh 関連項目
.Xr arp 8
.\"
.Sh 歴史
.Nm
ユーティリティは WIDE Hydrangea IPv6 プロトコルスタックキットで
はじめて登場しました。
.\"
.\" .Sh BUGS
.\" (to be written)
