freebsd/freebsd-doc/ja_JP.eucJP/man/man8/newfs.8
.\" Copyright (c) 1983, 1987, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)newfs.8	8.6 (Berkeley) 5/3/95
.\" %FreeBSD: src/sbin/newfs/newfs.8,v 1.67.2.1 2005/03/01 05:30:30 wes Exp %
.\"
.\" $FreeBSD$
.Dd May 18, 2002
.Dt NEWFS 8
.Os
.Sh 名称
.Nm newfs
.Nd 新しい UFS1/UFS2 ファイルシステムを作成する
.Sh 書式
.Nm
.Op Fl NUln
.Op Fl L Ar volname
.Op Fl O Ar filesystem-type
.Op Fl S Ar sector-size
.Op Fl T Ar disktype
.Op Fl a Ar maxcontig
.Op Fl b Ar block-size
.Op Fl c Ar blocks-per-cylinder-group
.Op Fl d Ar max-extent-size
.Op Fl e Ar maxbpg
.Op Fl f Ar frag-size
.Op Fl g Ar avgfilesize
.Op Fl h Ar avgfpdir
.Op Fl i Ar bytes
.Op Fl m Ar free-space
.Op Fl o Ar optimization
.Op Fl s Ar size
.Ar special
.Sh 解説
.Nm
ユーティリティは、
ファイルシステムを最初に使用する前に初期化およびクリアします。
.Nm
を走らせる前に、
.Xr bsdlabel 8
を使ってディスクラベルを書き込んでいなければなりません。
.Nm
ユーティリティは、指定した特殊ファイルにファイルシステムを作成します。
(しばしば
.Dq 特殊ファイル
を
.Dq ディスク
として扱いますが、特殊ファイルは物理ディスクである必要はありません。
事実、特殊である必要もありません。)
デフォルト値はたいてい妥当な値となりますが、
.Nm
にはこの値を変更するための数多くのオプションがあります。
.Pp
以下のオプションにて一般的な配置方針を定義します。
.Bl -tag -width indent
.It Fl L Ar volname
新規ファイルシステムにボリュームラベルを追加します。
.It Fl N
実際にはファイルシステムを構築せずに、ファイルシステム
パラメータの表示のみを行います。
.It Fl O Ar filesystem-type
UFS1 フォーマットのファイルシステムの構築には 1 を使用し、
UFS2 フォーマットのファイルシステムの構築には 2 を使用します。
デフォルトでは UFS2 フォーマットです。
.It Fl T Ar disktype
過去のものとの互換性のためのものです。
.It Fl U
ソフトアップデートを新規ファイルシステム上で有効にします。
.It Fl a Ar maxcontig
回転遅延 (rotational delay) を強制する前に
配置される連続ブロックの最大数を指定します。
デフォルトは 1 です。
このオプションをどのように設定するかについて、詳しくは
.Xr tunefs 8
を参照してください。
.It Fl b Ar block-size
ファイルシステムのブロックサイズをバイト単位で指定します。
2 のべき乗である必要があります。
デフォルトサイズは 16384 バイトであり、
可能な最小サイズは 4096 バイトです。
最適なブロックとフラグメントの比率は 8:1 です。
他の比率も可能ですが、お勧めできませんし、お粗末な結果となるかもしれません。
.It Fl c Ar blocks-per-cylinder-group
ファイルシステムのシリンダグループごとのシリンダ数を指定します。
デフォルトは、他のパラメータに許される最大値を計算するものです。
この値は、他の多くのパラメータ、
特にブロックサイズとバイトあたりの inode 数に依存します。
.It Fl d Ar max-extent-size
大きなファイルを格納するためにエクステントを使用することを、
ファイルシステムは選択できます。
本パラメータは使用可能な最大エクステントの大きさを指定します。
現在のところ、ファイルシステムのブロックサイズの 16 倍に制限されており、
これがデフォルト値となっています。
.It Fl e Ar maxbpg
単一のファイルが他のシリンダグループへまたがることを強制される前に、
1 つのシリンダグループから割り当てることのできる最大のブロック数を指定します。
デフォルト値は、シリンダグループのブロック数の約 1/4 です。
このオプションの詳細については、
.Xr tunefs 8
を参照してください。
.It Fl f Ar frag-size
ファイルシステムのフラグメントサイズをバイト単位で指定します。
.Ar blocksize Ns /8
から
.Ar blocksize
までの範囲の、2 のべき乗である必要があります。
デフォルトは 2048 バイトです。
.It Fl g Ar avgfilesize
ファイルシステム中の、ファイルサイズの平均の期待値。
.It Fl h Ar avgfpdir
ファイルシステム中の、ディレクトリあたりのファイル数の平均の期待値。
.It Fl i Ar bytes
ファイルシステム中の inode の密度を設定します。
デフォルトは、
.Pq 4 * Ar frag-size Pq フラグメントサイズ
バイトのデータ領域ごとに 1 つの
inode を作ります。
inode 数を少なくしたい場合は大きな値を指定し、
inode 数を多くしたい場合は小さな値を指定します。
各ファイルに対して inode が 1 個必要ですので、
ファイルシステム上の平均ファイルサイズを、
この値は事実上指定します。
.It Fl l
新しいファイルシステムでマルチラベル MAC を有効にします。
.It Fl m Ar free-space
通常のユーザからは保護されている領域のパーセンテージを
指定します。
これは最低限の空き領域のしきい値となります。
デフォルト値は
.In ufs/ffs/fs.h
にて
.Dv MINFREE
と定義され、現在 8% です。
このオプションの詳細については、
.Xr tunefs 8
を参照してください。
.It Fl n
新しいファイルシステムに .snap ディレクトリを作成しません。
結果として出来たファイルシステムはスナップショット生成をサポートしないので、
ライブモードでの
.Xr dump 8
や、バックグラウンド
.Xr fsck 8
は正しく動作しません。
伝統的な
.Xr fsck 8
やオフライン
.Xr dump 8
はこのファイルシステム上で動作します。
このオプションは、主に dump や fsck のサポートを要求しない
メモリファイルシステムや vnode ファイルシステムを対象としています。
.It Fl o Ar optimization
.Cm ( space
か
.Cm time )
。
ブロック確保に費す時間を最小にするか、
ディスク上のフラグメント領域を最小にするかを、
ファイルシステムに指示します。
デフォルトで minfree (前述) が 8% を下回る場合は、
.Cm space
(空間) の最小化が行われ、8% 以上ならば
.Cm time
(時間) の最小化が行われます。
このオプションの詳細については、
.Xr tunefs 8
を参照してださい。
.It Fl s Ar size
ファイルシステムサイズをセクタ単位で指定します。
デフォルト値は、
.Ar special
で指定される raw パーティションのサイズです (言い換えると、
.Nm
はパーティション全体をファイルシステムに使用します)。
.El
.Pp
次のオプションは、ディスクジオメトリの標準設定を変更します。
デフォルトの値はディスクラベルから得られます。
これらの値を変更するのは、
最初にファイルシステムを構築したときとは異なるタイプのディスク上で
ロウイメージを使用してファイルシステムを構築するようなときだけです
(たとえば、ライトワンスディスク上など)。
これらの値をデフォルトの
値から変更すると、標準のスーパブロックが壊れたときに、
.Xr fsck 8
が代替のスーパブロックを見つけることができなくなるので注意して
ください。
.Bl -tag -width indent
.It Fl S Ar sector-size
セクタサイズ (バイト単位) です (通常 512 以外は使用しません)。
.El
.Sh 使用例
.Dl newfs /dev/ad3s1a
.Pp
新規の UFS ファイルシステムを
.Pa ad3s1a
に作成します。
.Nm
ユーティリティは、
ブロックサイズに 16384 バイト、フラグメントサイズに 2048 バイト、
シリンダグループあたりのブロック数に最大数を使用します。
ほとんどのアプリケーションに対し、
これらの値は歴史的なデフォルト
(8192 バイトブロックと 1024 バイトフラグメント)
よりも良い性能となる傾向があります。
この大きなフラグメントサイズは、
小さなファイルを大量に含むファイルシステム上に、無駄な領域を生じさせえます。
.Sh 関連項目
.Xr fdformat 1 ,
.Xr disktab 5 ,
.Xr fs 5 ,
.Xr bsdlabel 8 ,
.Xr camcontrol 8 ,
.Xr dump 8 ,
.Xr dumpfs 8 ,
.Xr fsck 8 ,
.Xr mount 8 ,
.Xr tunefs 8 ,
.Xr vinum 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T A Fast File System for UNIX
.%J ACM Transactions on Computer Systems 2
.%V 3
.%P pp 181-197
.%D August 1984
.%O (reprinted in the BSD System Manager's Manual)
.Re
.Sh 歴史
.Nm
ユーティリティは、
.Bx 4.2
で登場しました。
