freebsd/freebsd-doc/ja_JP.eucJP/man/man8/newfs_msdos.8
.\" Copyright (c) 1998 Robert Nordier
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
.\" IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
.\" IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/newfs_msdos/newfs_msdos.8,v 1.7.2.5 2001/03/04 07:33:22 kris Exp %
.\" jpman %Id: newfs_msdos.8,v 1.3 1998/10/10 09:07:02 yohta Stab %
.\" 
.Dd July 6, 1998
.Dt NEWFS_MSDOS 8
.Os
.Sh 名称
.Nm newfs_msdos
.Nd 新規の MS-DOS (FAT) ファイルシステムを作成する
.Sh 書式
.Nm
.Op Fl N
.Op Fl B Ar boot
.Op Fl F Ar FAT-type
.Op Fl I Ar volid
.Op Fl L Ar label
.Op Fl O Ar OEM
.Op Fl S Ar sector-size
.Op Fl a Ar FAT-size
.Op Fl b Ar block-size
.Op Fl c Ar cluster-size
.Op Fl e Ar dirents
.Op Fl f Ar format
.Op Fl h Ar heads
.Op Fl i Ar info
.Op Fl k Ar backup
.Op Fl m Ar media
.Op Fl n Ar FATs
.Op Fl o Ar hidden
.Op Fl r Ar reserved
.Op Fl s Ar total
.Op Fl u Ar track-size
.Ar special
.Op Ar disktype
.Sh 解説
.Nm
ユーティリティは、FAT12, FAT16, FAT32 のいずれかのファイルシステムを、デバイス
.Ar special
上に作成します。この際、必要ならば
.Xr disktab 5
の
.Ar disktype
を使用して、ジオメトリを決定します。
.Pp
オプションを以下に示します:
.Bl -tag -width indent
.It Fl N
ファイルシステムを作成しません: パラメータを表示するだけです。
.It Fl B Ar boot
ブートストラップをファイルから取得します。
.It Fl F Ar FAT-type
FAT タイプ (12, 16, 32 のいずれか)。
.It Fl I Ar volid
ボリューム ID。
.It Fl L Ar label
ボリュームラベル (11 文字まで)。
ラベルを構成する文字は、
通常の DOS (8+3) ファイル名に許される文字のみにする必要があります。
.It Fl O Ar OEM
OEM 文字列 (8 文字まで)。
デフォルトは
\&"BSD  4.4"
です。
.It Fl S Ar sector-size
セクタあたりのバイト数。受け付ける値は、128 から 32768 までの、2 のべき乗です。
.It Fl a Ar FAT-size
FAT あたりのセクタ数。
.It Fl b Ar block-size
ファイルシステムのブロックサイズ (クラスタあたりのバイト数)。
この値は、受け付け可能なクラスタあたりのセクタ数 (後述) に、
分解可能である必要があります。
.It Fl c Ar cluster-size
クラスタあたりのセクタ数。受け付ける値は、1 から 128 までの、2 のべ乗です。
.It Fl e Ar dirents
ルートディレクトリのエントリ数 (FAT12 と FAT16 のみ)。
.It Fl f Ar format
標準 (フロッピディスク) フォーマットを指定します。
標準フォーマットは、(それぞれキロバイトでの容量で表現して)
160, 180, 320, 360, 640, 720, 1200, 1232, 1440, 2880 のいずれかです。
.It Fl h Ar heads
ドライブのヘッド数。
.It Fl i Ar info
ファイルシステム情報セクタの位置 (FAT32 のみ)。
値 0xffff は、情報セクタが無いことを意味します。
.It Fl k Ar backup
バックアップブートセクタの位置 (FAT32 のみ)。
値 0xffff は、バックアップセクタが無いことを意味します。
.It Fl m Ar media
メディア記述子 (受け付ける値は、0xf0 から 0xff まで)。
.It Fl n Ar FATs
FAT 数。受け付ける値は 1 から 16 までで、両端を含みます。デフォルトは 2 です。
.It Fl o Ar hidden
隠しセクタの数。
.It Fl r Ar reserved
予約セクタの数。
.It Fl s Ar total
ファイルシステムサイズ。
.It Fl u Ar track-size
トラックあたりのセクタ数。
.El
.Sh 注
FAT ファイルシステムパラメータは、
実際のファイルシステムの前にある「予約」セクタの始めの、
「ブートセクタの BPB (BIOS パラメータブロック)」に置かれます。
参照のために、この構造を以下に示します。
.Bd -literal
struct bsbpb {
    u_int16_t	bps;		/* [-S] セクタあたりのバイト数 */
    u_int8_t	spc;		/* [-c] セクタあたりのセクタ数 */
    u_int16_t	res;		/* [-r] 予約セクタ数 */
    u_int8_t	nft;		/* [-n] FAT 数 */
    u_int16_t	rde;		/* [-e] ルートディレクトリのエントリ数 */
    u_int16_t	sec;		/* [-s] 総セクタ数 */
    u_int8_t	mid;		/* [-m] メディア記述子 */
    u_int16_t	spf;		/* [-a] FAT あたりのセクタ数 */
    u_int16_t	spt;		/* [-u] トラックあたりのセクタ数 */
    u_int16_t	hds;		/* [-h] ドライブヘッド数 */
    u_int32_t	hid;		/* [-o] 隠しセクタ数 */
    u_int32_t	bsec;		/* [-s] ビッグ総セクタ数 */
};
/* FAT32 拡張 */
struct bsxbpb {
    u_int32_t	bspf;		/* [-a] FAT あたりのビッグセクタ数 */
    u_int16_t	xflg;		/* 制御フラグ */
    u_int16_t	vers;		/* ファイルシステムバージョン */
    u_int32_t	rdcl;		/* ルートディレクトリの開始クラスタ */
    u_int16_t	infs;		/* [-i] ファイルシステムの情報セクタ */
    u_int16_t	bkbs;		/* [-k] バックアップブートセクタ */
};
.Ed
.Sh 使用例
.Bd -literal -offset indent
newfs_msdos /dev/ad0s1
.Ed
.Pp
デフォルトパラメータを使用し、
.Pa /dev/ad0s1
にファイルシステムを作成します。
.Bd -literal -offset indent
newfs_msdos -f 1440 -L foo fd0
.Ed
標準 1.44M ファイルシステムを、ボリュームラベル "foo" にて、
.Pa /dev/fd0
に作成します。
.Sh 関連項目
.Xr disktab 5 ,
.Xr disklabel 8 ,
.Xr fdisk 8 ,
.Xr newfs 8
.Sh 診断
終了状態は、成功時には0 に、エラー時には 1 になります。
.Sh 歴史
.Nm
コマンドは、最初に
.Fx 3.0
に登場しました。
.Sh 作者
.An Robert Nordier Aq rnordier@FreeBSD.org
