freebsd/freebsd-doc/ja_JP.eucJP/man/man8/newsyslog.8
.\" This file contains changes from the Open Software Foundation.
.\"
.\"	from: @(#)newsyslog.8
.\" %FreeBSD: src/usr.sbin/newsyslog/newsyslog.8,v 1.44.2.1 2005/02/24 06:06:58 trhodes Exp %
.\"
.\" Copyright 1988, 1989 by the Massachusetts Institute of Technology
.\"
.\" Permission to use, copy, modify, and distribute this software
.\" and its documentation for any purpose and without fee is
.\" hereby granted, provided that the above copyright notice
.\" appear in all copies and that both that copyright notice and
.\" this permission notice appear in supporting documentation,
.\" and that the names of M.I.T. and the M.I.T. S.I.P.B. not be
.\" used in advertising or publicity pertaining to distribution
.\" of the software without specific, written prior permission.
.\" M.I.T. and the M.I.T. S.I.P.B. make no representations about
.\" the suitability of this software for any purpose.  It is
.\" provided "as is" without express or implied warranty.
.\"
.\" $FreeBSD$
.\"
.Dd February 24, 2005
.Dt NEWSYSLOG 8
.Os
.Sh 名称
.Nm newsyslog
.Nd システムのログファイルを保守し、適切なサイズに保つ
.Sh 書式
.Nm
.Op Fl CFnrsv
.Op Fl R Ar tagname
.Op Fl a Ar directory
.Op Fl f Ar config_file
.Op Ar
.Sh 解説
.Nm
ユーティリティは
.Xr cron 8
から定期的に実行されるようにスケジュールされるべきプログラムです。
実行されると、
.Nm
は必要に応じてログファイルを保存 (アーカイブ) します。
あるログファイルを保存する必要があると判断すると、
.Dq Va logfile
が空になり、
.Dq Va logfile Ns Li \&.0
に前回のログファイルが入り、
.Dq Va logfile Ns Li \&.1
に前々回のログが入り‥‥ といった具合に、
ユーザが指定した数の保存ログが残るよう、
.Nm
はファイルを再編します。
オプションにより、保存ログを圧縮してスペースを節約することもできます。
.Pp
ログが保存されるのは次の 3 つの場合です:
.Bl -enum -offset indent
.It
ログが設定サイズ (キロバイト単位で指定) より大きくなった。
.It
前回ログを保存してから指定した時間が経過した。
.It
ログ入れ替えを行う指定時間になった。
.El
.Pp
.Nm
の粒度は、このコマンドが
.Xr cron 8
からどの程度の頻度で実行されるかに依存しています。
.Nm
の実行は十分速いので、毎時間実行するようにスケジュールしても
悪影響はありませんし、
第 3 のモード (前述) はそうなっていることを仮定しています。
.Sh オプション
.Nm
では以下のオプションが利用できます:
.Bl -tag -width indent
.It Fl f Ar config_file
設定ファイルとして
.Pa /etc/newsyslog.conf
に代えて
.Ar config_file
を使用します。
.It Fl a Ar directory
アーカイブしたログファイルを書き込む
.Ar directory
を指定します。
相対パスを指定した場合、
これを各ログファイルのパスに後置したディレクトリに、
このログファイルのアーカイブログを書き込みます。
絶対パスを指定した場合、
すべてのアーカイブログは指定した
.Ar directory
に書き込まれます。
パス
.Ar directory
のコンポーネントが存在しない場合、
.Nm
が実行されるときに生成されます。
.It Fl v
.Nm
を詳細情報出力モードにします。
このモードでは、ログを入れ換えるあるいはそれをスキップするたびに、
そのログファイル名と理由を表示します。
.It Fl n
実際にログの入れ換えは行わず、このオプションが指定されない場合に
本来行うはずの処理内容を表示します。
.It Fl r
.Nm
は root として動作しなければならない、という制約を取り除きます。
もちろん、
.Nm
は
.Xr syslogd 8
に HUP シグナルを送れなくなりますから、
このオプションはデバッグにのみ用いるべきです。
.It Fl s
ログファイル入れ替え時に通常は送っていたはずの
デーモンプロセスへのシグナルを、一切送らないようにします。
入れ替えられるログファイルにとっては、
このオプションは通常次の意味も持ちます。
すなわち、このオプションが無かった場合に通知されるデーモンがいる場合
には、入れ替えられたログファイルは圧縮されないという意味です。
しかしながら、本オプションがもっとも有用なのはおそらく
.Fl R
オプションと共に指定された場合であり、この場合圧縮は行われます。
.It Fl C
1 回指定すると、存在しないが設定ファイルに
.Sy C
が指定されているログファイルを
.Nm
は作成します。
複数回指定すると、
.Nm
は存在しないファイルをすべて作成します。
ログファイルがコマンドライン上に指定されると、
.Fl C
もしくは
.Fl CC
は、これらのログファイルにのみ適用されます。
.It Fl F
ログを入れ替える条件に合致しないとしても、強制的に
.Nm
にログを入れ替えさせます。
システムの問題を診断しているときには、
このオプションの使用により、
問題のみを含む新しいログを提供できるので有用です。
.It Fl R Ar tagname
入れ換え条件が成立していなくても、
.Nm
が指定されたリストのファイルを入れ替えるべきことを指示します。
.Ar tagname
は、入れ替えられるログファイルに書き込まれるメッセージにのみ使用されます。
これが
.Fl F
オプションと違うのは、ひとつ以上のファイルを指定する必要があり、
.Nm
がこれらの指定されたファイルに対してのみ動作するという点です。
このオプションの主たる目的は、
複数のログファイルを書くデーモンやプログラムで、
それら自身の条件で入れ替えを引き起こしたいもののために使用することです。
このオプションを使用すると、入れ替えたいときにそれらは
.Nm
を実行でき、またシステム管理者が依然として入れ換え規則
(バックアップ保存数や圧縮の種類等) を指定可能とします。
デーモンが
.Nm
を
.Fl R
オプション付きで呼び出すとき、
.Nm
の呼び出し前にそのデーモンは全ログファイルがクローズされていることを
保証することと、
.Nm
が戻った後にログファイルをリオープンすることが必要です。
通常、呼び出しプロセスは
.Fl s
オプションも指定したいでしょうから、入れ替えを強制したプロセス自身には
.Nm
はシグナルを送らないでしょう。
シグナル処理を行わないということは、
.Nm
は通常シグナル送信後に数秒待ちますので、
.Nm
は高速に戻ることを意味します。
.El
.Pp
追加のコマンド行引数を指定すると、
.Nm
はこれらの引数にマッチするログファイルのみを検査します。
そうでない場合、設定ファイルに列挙された全ファイルを検査します。
.Sh 関連ファイル
.Bl -tag -width /etc/newsyslog.confxxxx -compact
.It Pa /etc/newsyslog.conf
.Nm
の設定ファイル
.El
.Sh バグ
セキュリティ侵害を見つけるためにログを自動的に読むことは、
まだ行っていません。
.Sh 作者
.An Theodore Ts'o ,
MIT Project Athena
.Pp
Copyright 1987, Massachusetts Institute of Technology
.Sh 互換性
以前のバージョンの
.Nm
ユーティリティは、グループ名の識別にドット (``.'') を使用していました。
.Fx 3.3
からは、これはコロン (``:'') 文字になりましたので、
ユーザ名とグループ名にドット文字を含めることが可能です。
後方互換性のために、ドット (``.'') 文字はまだ受け付けられます。
.Sh 関連項目
.Xr bzip 1 ,
.Xr gzip 1 ,
.Xr syslog 3 ,
.Xr newsyslog.conf 5 ,
.Xr chown 8 ,
.Xr syslogd 8
.Sh 歴史
.Nm
ユーティリティは、
.Nx
由来のもので、
.Fx 2.2
ではじめて登場しました。
