freebsd/freebsd-doc/ja_JP.eucJP/man/man8/newsyslog.8
.\" This file contains changes from the Open Software Foundation.
.\"
.\"	from: @(#)newsyslog.8
.\" %FreeBSD: src/usr.sbin/newsyslog/newsyslog.8,v 1.38 2002/12/27 12:15:38 schweikh Exp %
.\"
.\" Copyright 1988, 1989 by the Massachusetts Institute of Technology
.\"
.\" Permission to use, copy, modify, and distribute this software
.\" and its documentation for any purpose and without fee is
.\" hereby granted, provided that the above copyright notice
.\" appear in all copies and that both that copyright notice and
.\" this permission notice appear in supporting documentation,
.\" and that the names of M.I.T. and the M.I.T. S.I.P.B. not be
.\" used in advertising or publicity pertaining to distribution
.\" of the software without specific, written prior permission.
.\" M.I.T. and the M.I.T. S.I.P.B. make no representations about
.\" the suitability of this software for any purpose.  It is
.\" provided "as is" without express or implied warranty.
.\"
.\" $FreeBSD$
.\"
.Dd April 4, 2000
.Dt NEWSYSLOG 8
.Os
.Sh 名称
.Nm newsyslog
.Nd システムのログファイルを保守し、適切なサイズに保つ
.Sh 書式
.Nm
.Op Fl Fnrv
.Op Fl f Ar config_file
.Op Fl a Ar directory
.Op Ar
.Sh 解説
.Nm
ユーティリティは
.Xr cron 8
から定期的に実行されるようにスケジュールされるべきプログラムです。
実行されると、
.Nm
は必要に応じてログファイルを保存 (アーカイブ) します。
あるログファイルを保存する必要があると判断すると、
.Dq Va logfile
が空になり、
.Dq Va logfile Ns Li \&.0
に前回のログファイルが入り、
.Dq Va logfile Ns Li \&.1
に前々回のログが入り‥‥ といった具合に、
ユーザが指定した数の保存ログが残るよう、
.Nm
はファイルを再編します。
オプションにより、保存ログを圧縮してスペースを節約することもできます。
.Pp
ログが保存されるのは次の 3 つの場合です:
.Bl -enum -offset indent
.It
ログが設定サイズ (キロバイト単位で指定) より大きくなった。
.It
前回ログを保存してから指定した時間が経過した。
.It
ログ入れ替えを行う指定時間になった。
.El
.Pp
.Nm
の粒度は、このコマンドが
.Xr cron 8
からどの程度の頻度で実行されるかに依存しています。
.Nm
の実行は十分速いので、毎時間実行するようにスケジュールしても
悪影響はありませんし、
第 3 のモード (前述) はそうなっていることを仮定しています。
.Pp
起動されると、
.Nm
は設定ファイルを読み込んで、
どのログファイルが潜在的に保存されうるかを決定します。
デフォルトでは、この設定ファイルは
.Pa /etc/newsyslog.conf
です。
設定ファイルの各行には、
.Nm
が処理すべき特定のログファイルに関する情報を記述します。
各行は 5 つの必須フィールドと、4 つのオプションフィールドからなり、
それらは空白で区切られています。
空行や ``#'' で始まる行は無視されます。
``#'' が行の途中にある場合、
``#'' 文字とこの後の行の残りは無視されます。
この特殊な意味を避けるために、``#'' を ``\\'' でエスケープ可能です。
この場合、前の ``\\'' は削除され、``#'' は通常文字として扱われます。
設定ファイルの各フィールドは以下の通りです:
.Pp
.Bl -tag -width indent
.It Ar logfile_name
保存するシステムログファイル名。
.It Ar owner : Ns Ar group
このフィールドはオプションであり、
保存ファイルの所有者とグループ名を指定します。
.Ar owner
あるいは
.Ar group
が空白のままである場合でも ":" は必須です。
指定は数値、あるいは
.Pa /etc/passwd
か
.Pa /etc/group
にある名前で行います。
.It Ar mode
ログファイルと保存ログファイルのモードを指定します。
.It Ar count
ログファイルそのものに加えて保存しておく保存ファイルの数を指定します。
.It Ar size
ログファイルのサイズが
.Ar size
キロバイトに達すると、ログファイルは上記のように入れ換えられます。
このフィールドがアスタリスク
.Pq Ql \&*
で置き換えられると、ログファイル入れ換えに際して
そのサイズは考慮されなくなります。
.It Ar when
.Ar when
フィールドは、インターバル、特定の時刻、もしくは両方です。
.Ar when
フィールドがアスタリスク
.Pq Ql \&*
の場合、ログ入れ替えは
.Ar size
フィールドにのみ依存します。
そうでない場合、
.Ar when
フィールドは、オプションの、時間単位のインターバルからなります。
これに続けて、単一の
.So Li \&@ Sc
記号と制限された
.Tn ISO 8601
フォーマットで時刻を指定することもできますし、単一の
.So Li \&$ Sc
記号と時刻を指定し、日に 1 回か週に 1 回か月に 1 回の決まった時刻に
ログファイルを入れ替えるように指定することもできます。
.Pp
時刻を指定すると、指定した時刻の 1 時間以内に
.Nm
が実行された場合のみ、ログファイルを入れ替えます。
インターバル時間が指定された場合、
最後の入れ替えからその時間数が経過した場合に、ログファイルを入れ替えます。
時刻とインターバルの両方が指定された場合、入れ替えが実行されるには、
両方の条件が満たされることが必要です。
.Pp
タイムゾーンは指定できません。
現在の実装では、明確に分や秒の部分を指定することは、ほとんどできません。
「1 時間以内」であることのみ、比較するからです。
.Pp
.Sy ISO 8601 制限付時刻フォーマット
.Pp
制限付
.Tn ISO 8601
時刻の先行文字は
.So Li \&@ Sc
記号です。制約付
.Tn ISO 8601
フォーマットでの特定の時刻の指定は次の通りです:
.Sm off
.Oo
.Oo
.Oo
.Oo
.Oo
.Va \&cc
.Oc
.Va \&yy
.Oc
.Va \&mm
.Oc
.Va \&dd
.Oc
.Oo
.Li \&T
.Oo
.Va \&hh
.Oo
.Va \&mm
.Oo
.Va \&ss
.Oc
.Oc
.Oc
.Oc
.Oc です。
.Sm on
日付フィールドはオプションであり、デフォルトは現在の日付です。
時刻フィールドはオプションであり、デフォルトは午前 0 時です。
よって、今日が 1999 年 1 月 22 日の場合、次の日付指定はすべて同等です:
.Pp
.Bl -item -compact -offset indent
.It
.Sq Li 19990122T000000
.It
.Sq Li 990122T000000
.It
.Sq Li 0122T000000
.It
.Sq Li 22T000000
.It
.Sq Li T000000
.It
.Sq Li T0000
.It
.Sq Li T00
.It
.Sq Li 22T
.It
.Sq Li \&T
.It
.Sq Li \&
.El
.Pp
.Sy 日・週・月の時刻フォーマット
.Pp
日・週・月の時刻フォーマットの先行文字は
.So Li \&$ Sc
記号です。
日・週・月の指定の特定のフォーマットはそれぞれ次の通りです:
.Op Va D\&hh ,
.Op Va W\&w Ns Op Va D\&hh ,
.Op Va M\&dd Ns Op Va D\&hh
。
オプションの時刻フィールドのデフォルトは、午前 0 時です。
日と時間の指定の範囲は次の通りです:
.Pp
.Bl -tag -width Ds -compact -offset indent
.It Ar hh
時間であり、0 から 23 の範囲
.It Ar w
曜日であり、0 から 6 の範囲で、0 が日曜日
.It Ar dd
日であり、1 から 31 の範囲か、最終日を指定するための文字
.Em L
または
.Em l
.El
.Pp
以下に例を示します:
.Pp
.Bl -tag -width Ds -compact -offset indent
.It Ar $D0
毎晩午前 0 時に入れ替えます
.Ar ( @T00
と同じです)
.It Ar $D23
毎晩 23:00 に入れ替えます
.Ar ( @T23
と同じです)
.It Ar $W0D23
毎週日曜日の 23:00 に入れ替えます
.It Ar $W5D16
毎週金曜日の 16:00 に入れ替えます
.It Ar $M1D0
毎月最初の日の午前 0 時に入れ替えます
(その日の開始時点です;
.Ar @01T00
と同じです)
.It Ar $M5D6
毎月 5 日の 6:00 に入れ替えます
.Ar ( @05T06
と同じです)
.El
.Pp
.It Ar flags
このフィールドはオプションであり、
保存に際してログファイルに特別な処理を行うかどうかを指定します。
.Ar Z
フラグを指定すると、スペース節約のために
保存ファイルは
.Xr gzip 1
で圧縮されます。
.Ar J
フラグを指定すると、スペース節約のために
保存ファイルは
.Xr bzip2 1
で圧縮されます。
.Ar B
フラグはファイルがバイナリファイルであることを指示し、
ログファイルが入れ換わったという意味で
.Nm
が挿入する
.Tn ASCII
メッセージを含めないようにします。
.Ar -
は何も意味しませんが、
.Ar path_to_pid_file
フィールドが指定された場合には埋め草として使用可能です。
.Ar G
フラグは、指定した
.Ar logfile_name
がシェルパターンであることを示し、
このパターンにマッチする全ファイル名を
.Nm
がアーカイブすることを意味します。
文法とマッチ規則についての詳細は、
.Xr glob 3
を参照してください。
.Ar W
フラグは、
.Ar Z
フラグまたは
.Ar J
フラグと組み合わせると、本エントリに対する新規ジョブの前に、
直前に開始した圧縮ジョブの完了を
.Nm
が待つべきことを示します。
.Ar G
フラグと組み合わせて使用すると、
パターンに複数のログファイルがマッチし、これらが圧縮される場合、
同時には 1 個の圧縮ジョブしか実行されないことを保証します。
.It Ar path_to_pid_file
このオプションのフィールドは、
デーモンのプロセス ID を調べるために読むファイルを指定します。
このフィールドが存在する場合、
このファイルに書かれたプロセス ID に
.Ar signal_number
が送られます。
正しく認識するために、このフィールドは "/" から開始する必要があります。
.It Ar signal_number
このオプションフィールドは、
デーモンプロセスに送られるシグナル番号を指定します。
デフォルトで SIGHUP が送られます。
.El
.Sh オプション
.Nm
では以下のオプションが利用できます:
.Bl -tag -width indent
.It Fl f Ar config_file
設定ファイルとして
.Pa /etc/newsyslog.conf
に代えて
.Ar config_file
を使用します。
.It Fl a Ar directory
アーカイブしたログファイルを書き込む
.Ar directory
を指定します。
相対パスを指定した場合、
これを各ログファイルのパスに後置したディレクトリに、
このログファイルのアーカイブログを書き込みます。
絶対パスを指定した場合、
すべてのアーカイブログは指定した
.Ar directory
に書き込まれます。
パス
.Ar directory
のコンポーネントが存在しない場合、
.Nm
が実行されるときに生成されます。
.It Fl v
.Nm
を詳細情報出力モードにします。
このモードでは、ログを入れ換えるあるいはそれをスキップするたびに、
そのログファイル名と理由を表示します。
.It Fl n
実際にログの入れ換えは行わず、このオプションが指定されない場合に
本来行うはずの処理内容を表示します。
.It Fl r
.Nm
は root として動作しなければならない、という制約を取り除きます。
もちろん、
.Nm
は
.Xr syslogd 8
に HUP シグナルを送れなくなりますから、
このオプションはデバッグにのみ用いるべきです。
.It Fl F
ログを入れ替える条件に合致しないとしても、強制的に
.Nm
にログを入れ替えさせます。
システムの問題を診断しているときには、
このオプションの使用により、
問題のみを含む新しいログを提供できるので有用です。
.El
.Pp
追加のコマンド行引数を指定すると、
.Nm
はこれらの引数にマッチするログファイルのみを検査します。
そうでない場合、設定ファイルに列挙された全ファイルを検査します。
.Sh 関連ファイル
.Bl -tag -width /etc/newsyslog.confxxxx -compact
.It Pa /etc/newsyslog.conf
.Nm
の設定ファイル
.El
.Sh バグ
セキュリティ侵害を見つけるためにログを自動的に読むことは、
まだ行っていません。
.Sh 作者
.An Theodore Ts'o ,
MIT Project Athena
.Pp
Copyright 1987, Massachusetts Institute of Technology
.Sh 互換性
以前のバージョンの
.Nm
ユーティリティは、グループ名の識別にドット (``.'') を使用していました。
.Fx 3.3
からは、これはコロン (``:'') 文字になりましたので、
ユーザ名とグループ名にドット文字を含めることが可能です。
後方互換性のために、ドット (``.'') 文字はまだ受け付けられます。
.Sh 関連項目
.Xr gzip 1 ,
.Xr syslog 3 ,
.Xr chown 8 ,
.Xr syslogd 8
