freebsd/freebsd-doc/ja_JP.eucJP/man/man8/newsyslog.8
.\" This file contains changes from the Open Software Foundation.
.\"
.\"	from: @(#)newsyslog.8
.\" jpman %Id: newsyslog.8,v 1.3 1997/08/16 13:33:00 horikawa Stab %
.\"	%Id: newsyslog.8,v 1.1.1.1.2.3 1997/10/08 07:21:09 charnier Exp %
.\"
.\" Copyright 1988, 1989 by the Massachusetts Institute of Technology
.\" 
.\" Permission to use, copy, modify, and distribute this software
.\" and its documentation for any purpose and without fee is
.\" hereby granted, provided that the above copyright notice
.\" appear in all copies and that both that copyright notice and
.\" this permission notice appear in supporting documentation,
.\" and that the names of M.I.T. and the M.I.T. S.I.P.B. not be
.\" used in advertising or publicity pertaining to distribution
.\" of the software without specific, written prior permission.
.\" M.I.T. and the M.I.T. S.I.P.B. make no representations about
.\" the suitability of this software for any purpose.  It is
.\" provided "as is" without express or implied warranty.
.\"
.Dd "January 12, 1989"
.Dt NEWSYSLOG 8
.Os
.Sh 名称
.Nm newsyslog
.Nd システムのログファイルを保守し、適切なサイズに保つ
.Sh 書式
.Nm newsyslog
.Op Fl rnv
.Op Fl f Ar config_file
.Sh 解説
.Nm
は
.Xr cron 8
から定期的に実行されるようにスケジュールされるべきプログラムです。
実行されると、
.Nm
は必要に応じてログファイルを保存(アーカイブ)します。
あるログファイルを保存する必要があると判断すると、
.Nm
は、``logfile'' が空になり、``logfile.0'' に前回のログファイルが入り、
``logfile.1'' に前々回のログが入り‥‥ といった具合に、
ユーザが指定した数の保存ログが残るよう、ファイルを再編します。
オプションにより、保存ログを圧縮してスペースを節約することもできます。
.Pp
ログが保存される場合には 2 つの理由があります。
そのログファイルのサイズが予めセットしておいたキロバイト数より大きくなった、
もしくは、前回ログを保存してから指定した時間が経過した、という理由です。
.Nm
の粒度は、このコマンドが
.Xr cron 8
からどの程度の頻度で実行されるかに依存しています。
.Nm
の実行は十分速いので、毎時間実行するようにスケジュールしても
悪影響はありません。
.Pp
起動されると、
.Nm
はコンフィギュレーションファイルを読み込んで、
どのログファイルをチェックすべきかを決定します。
デフォルトでは、このコンフィギュレーションファイルは
.Pa /etc/newsyslog.conf
です。
コンフィギュレーションファイルの各行には、
.Nm
が処理すべき特定のログファイルに関する情報を記述します。
各行は 5 つの必須フィールドと、2 つのオプションフィールドから成り、
それらは空白で区切られています。
空行や ``#'' で始まる行は無視されます。
コンフィギュレーションファイルの各フィールドは以下の通りです:
.Pp
.Bl -tag -width indent
.It Ar logfile_name
保存するシステムログファイル名。
.It Ar owner.group
保存ファイルの所有者とグループ名を指定します。
.Ar owner
あるいは
.Ar group
が空白のままである場合でも "." は必須です。
指定は数値、あるいは
.Pa /etc/passwd
か
.Pa /etc/group
にある名前で行います。
.It Ar mode 
ログファイルと保存ログファイルのモードを指定します。
.It Ar count
ログファイルそのものに加えて保存しておく保存ファイルの数を指定します。
.It Ar size
ログファイルのサイズが
.Ar size
に達すると、ログファイルは上記のように入れ換えられます。
このフィールドが
.Ar *
で置き換えられると、ログファイル入れ換えに際して
そのサイズは考慮されなくなります。
.It Ar interval
.Ar interval
時間(60 分×interval の意)が経過すると、ログファイルが入れ換えられます。
このフィールドが
.Ar *
で置き換えられると、前回の入れ換えからの経過時間は考慮されません。
.It Ar flags
このフィールドはオプションであり、
保存に際してログファイルに特別な処理を行うかどうかを指定します。
.Ar Z
フラグを指定すると、スペース節約のために
保存ファイルは
.Xr gzip 1
で圧縮されます。
.Ar B
フラグはファイルがバイナリファイルであることを指示し、
ログファイルが入れ換わったという意味で
.Nm
が挿入する
.Tn ASCII
メッセージを含めないようにします。
.El
.Sh オプション
newsyslog では以下のオプションが利用できます:
.Bl -tag -width indent
.It Fl f Ar config_file
コンフィギュレーションファイルとして
.Pa /etc/newsyslog.conf
に代えて
.Ar config_file
を使用します。
.It Fl v
.Nm
を詳細情報出力モードにします。
このモードでは、ログを入れ換えるあるいはそれをスキップするたびに、
そのログファイル名と理由を表示します。
.It Fl n
実際にログの入れ換えは行わず、このオプションが指定されない場合に
本来行うはずの処理内容を表示します。
.It Fl r
.Nm
は root として動作しなければならない、という制約を取り除きます。
もちろん、
.Nm
は
.Xr syslogd 8
に HUP シグナルを送れなくなりますから、
このオプションはデバッグにのみ用いるべきです。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/newsyslog.confxxxx -compact
.It Pa /etc/newsyslog.conf
.Nm
のコンフィギュレーションファイル
.El
.Sh バグ
セキュリティ侵害を見つけるためにログを自動的に読むことは、
まだ行っていません。
.Sh 作者
.An Theodore Ts'o ,
MIT Project Athena
.Pp
Copyright 1987, Massachusetts Institute of Technology
.Sh 関連項目
.Xr gzip 1 ,
.Xr syslog 3 ,
.Xr syslogd 8
