freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nextboot.8
.\" Copyright (c) 2002 Gordon Tetlow
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/reboot/nextboot.8,v 1.4 2002/12/12 17:25:56 ru Exp %
.\"
.\" $FreeBSD$
.Dd November 4, 2002
.Dt NEXTBOOT 8
.Os
.Sh 名称
.Nm nextboot
.Nd 次のブートに対し、別のカーネルとブートフラグを指定
.Sh 書式
.Nm
.Op Fl f
.Op Fl o Ar options
.Fl k Ar kernel
.Nm
.Fl D
.Sh 解説
.Nm
ユーティリティは、次にマシンがブートするときに使用される、
別のカーネルやブートフラグを指定するためのものです。
.Xr loader 8
が新規カーネルの情報を読み取ると、
新規カーネルがマシンをハングさせてしまう場合に備えて
この情報は削除されます。
その情報でリブートすると、マシンは自動的に直前の設定に戻します。
.Pp
The options are as follows:
.Bl -tag -width ".Fl o Ar options"
.It Fl D
.Nm
をこのオプション付きで起動すると、既存の
.Nm
設定を削除します。
.It Fl f
正当性の確認を無効にします。
正当性の確認とは、
.Nm
設定の書き込みを行う前にカーネルが実在することを確認することを言います。
.It Fl k Ar kernel
このオプションにて、
カーネルおよびモジュールのロード元であるカーネルディレクトリを、
.Pa /boot
からの相対で指定します。
.It Fl o Ar options
このオプションは、
次のブートに使用されるカーネルフラグを渡すために使用します。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa /boot/nextboot.conf" -compact
.It Pa /boot/nextboot.conf
.Nm
設定が書き込まれる、設定ファイル。
.El
.Sh 使用例
.Nm
コマンドを使い、
.Pa GENERIC
カーネルでブートさせるには:
.Pp
.Dl "nextboot -k GENERIC"
.Pp
通常のカーネルでシングルユーザモードに入るようにするには:
.Pp
.Dl "nextboot -o ""-s"" -k kernel"
.Pp
既存の次回ブート設定を削除するには:
.Pp
.Dl "nextboot -D"
.Sh 関連項目
.Xr boot 8 ,
.Xr loader 8
.Sh 歴史
元々の
.Nm
マニュアルページは
.Fx 2.2
に登場しました。
同様の結果を実現するために、
非常に異なったインタフェースを使用していました。
.Pp
現在の版の
.Nm
は
.Fx 5.0
に登場しました。
.Sh 作者
このマニュアルページは
.An Gordon Tetlow Aq gordon@FreeBSD.org
が記述しました。
.Sh バグ
.Nm
コードは
.Xr loader 8
内に実装されています。
非常によくテストされたコードというわけではありません。
私が Forth で記述した最初の成果でもあります。
.Pp
最後に、ファイルシステムをチェックする前にそこに書き込むといった、
邪悪なことをしています。
ファイルシステムを壊してしまっても、私を責めないでください。
