freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nextboot.8
.\"	%Id: nextboot.8,v 1.3.2.1 1996/12/10 16:43:01 joerg Exp %
.\" jpman %Id: nextboot.8,v 1.3 1997/08/16 13:35:00 horikawa Stab %
.Dd July 9, 1996
.Dt NEXTBOOT 8
.\".Os BSD 4
.Sh 名称
.Nm nextboot
.Nd ブートディスクにデフォルトのブートストリングブロックをインストールする
.Sh 書式
.Nm
.Op Fl b
.Ar filename bootstring ...
.Pp
.Nm
.Op Fl ed
.Ar filename
.Bl -tag -width time
.It Fl b
ネームブロックをブートストラップする (最初に構成する) のに用いられます。
このオプションを指定しない場合、
.Nm
はマジックナンバをまだもっていないブロックへの書き込みを拒否します。
.It Fl d
マジックナンバ中のビットを変更して、既存のネームブロックを
一時的に無効化します。
.It Fl e
-d オプションで無効化されたブロックに、
有効なマジックナンバを再設定します。
.El
.Sh 前書き
FreeBSD の
.Nm
プログラムは、次回ブート時のブートブロックの動作を制御します。
正しいオプションと共にコンパイルされていれば、
ブートに用いるマジックナンバとデフォルトネームがあるかどうか、
ブートブロックはネームブロックをチェックします。
ブートブロックがそのようにコンパイルされている場合、
ブートが失敗したら再度ブートを試みないように
ブートブロックはブロックからネームを削除します。
ブートが成功した場合に
.Nm
を用いてブートストリングを再インストールするのは /etc/rc の仕事です。
これにより、リモートデバッギングや
新しく信頼のおけないカーネルをインストールするといった場合に、
一度だけのブートストリングを用いることができるようになります。
コンパイル時に、ネームブロックはディスクの 2 番目の物理ブロックとして
定義されています。
.Pp
.Sh 解説
.Nm
はまず、指定ディスクが fdisk テーブルを持ち、
そのテーブルで定義されている全パーティションがネームブロックを含んでいない
ことをチェックします。
ネームブロックが使われていないことが明らかになれば、
.Nm
は
引数に指定されたブートストリングを一つずつ、小さいマジックナンバを前につけ、
最後に NULL を加えてインストールします。
ストリングのリストの最後は 0xff バイトの列で区切られます。
ブートブロックがブートの度にネームブロックを書き戻す (write back) ように
コンパイルされている場合、
ブートブロックはブート毎に一つずつ供給されたネームをゼロクリアします。
これは 0xff に到達するまで続き、
その時点でコンパイル時に組み込まれたブートストリングに戻ります。
この時点で、ネームブロックはゼロクリアされたネームだけになります。
.Pp
使用例を示します:
.Bd -literal
   nextboot -b  /dev/rwd0 1:sd(0,a)/kernel.experimental wd(0,a)/kernel.old
.Ed
.Pp
これは、次回ブート時に実験カーネルを SCSI ディスクからブートしてみるよう、
ブートブトックに指示します。
何らかの理由でこれが失敗すると、その次のブートではカーネル
.Em /kernel.old
を IDE ドライブからブートしようと試みます。
(書き戻しオプションが有効であると仮定しています。)
これも失敗すると、コンパイル時に組み込まれたデフォルトが用いられます。
.Pp
書き戻し機能が無効化されている場合、nextboot はデフォルトのブートストリングを
変更する簡便な手段となります。
もしネームブロックで指定されたファイルが存在しないと、
ネームブロックの次のネームではなく、コンパイル時にブートブロックの中に
組み込まれたネームがブート用に用いられることに注意して下さい。
ネームブロックはブート毎に「一回だけ」チェックされます。
.Sh 関連項目
.Xr boot 8 ,
.Xr disklabel 8 ,
.Xr fdisk 8
.Sh バグ
プログラム全体にもっとユーザフレンドリにすべきです。
書き戻しの有効無効オプション設定はコンパイル時オプションではなく、
ディスク上にストアすべきです。
fdisk パーティションテーブルが存在しないディスク (つまり
純粋にディスクラベルだけのシステム) と共存できるように、
将来、この点に関して再考したいと考えています。
.Pp
書き戻しを有効とするか否かは実行時にネームブロックで指定し、
この機能を得るためにブートブロックを書き換える必要のないようにすべきです。
