freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nfsiod.8
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)nfsiod.8	8.2 (Berkeley) 2/22/94
.\" %FreeBSD: src/sbin/nfsiod/nfsiod.8,v 1.6.2.2 1999/08/29 15:14:59 peter Exp %
.\"
.\" jpman %Id: nfsiod.8,v 1.3 1997/08/10 18:33:51 horikawa Stab %
.Dd September 22, 1994
.Dt NFSIOD 8
.Os
.Sh 名称
.Nm nfsiod
.Nd ローカルな
.Tn NFS
のための非同期 I/O サーバ
.Pp
.Sh 書式
.Nm nfsiod
.Op Fl n Ar num_servers
.Pp
.Sh 解説
.Nm
は
.Tn NFS
クライアントマシン上で動作し、サーバに対する非同期 I/O 要求を処理します。
これによりパフォーマンスは向上しますが、
正しい動作のために必要とされているわけではありません。
.Pp
オプションは以下の通りです:
.Bl -tag -width indent
.It Fl n Ar num_server
サーバをいくつスタートさせるかを指定する。
.El
.Pp
何も引数が指定されなければ、サーバは1つだけスタートします。
.Pp
クライアントは、最大限並行処理を行うのに十分な数のデーモンを実行するべきです。
典型的には 4 つから 6 つです。
.Pp
動作中のカーネルに
.Tn NFS
サポートが含まれていないことを
.Nm
が検出した場合、
.Nm
は
.Xr kldload 8
に含まれる
.Xr vfsload 3
の機能を用いて、
.Tn NFS
コードを含むローダブルカーネルモジュールをロードしようとします。
これが失敗した場合、または
.Tn NFS
KLD が存在しない場合、
.Nm
はエラーを返して終了します。
.Pp
.Nm
は、成功すれば 0 を、エラーが起きると 0 より大きな値を返して終了します。
.Sh 関連項目
.Xr nfsstat 1 ,
.Xr nfssvc 2 ,
.Xr kldload 8 ,
.Xr mountd 8 ,
.Xr portmap 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.4
から登場しました。
