freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_bpf.8
.\" Copyright (c) 1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/bpf/ng_bpf.8,v 1.1.2.1 1999/12/06 22:06:55 archie Exp %
.\" $Whistle: ng_bpf.8,v 1.2 1999/12/03 01:57:12 archie Exp $
.\"
.Dd December 2, 1999
.\" jpman %Id: ng_bpf.8,v 1.3 2000/01/03 03:17:09 horikawa Stab %
.Dt NG_BPF 8
.Os FreeBSD 4.0
.Sh 名称
.Nm ng_bpf
.Nd Berkeley パケットフィルタ netgraph ノードタイプ
.Sh 書式
.Fd #include <net/bpf.h>
.Fd #include <netgraph/ng_bpf.h>
.Sh 解説
.Nm bpf
ノードタイプは、Berkeley パケットフィルタ (
.Xr bpf 8
参照) を、Netgraph ネットワークを通過するデータに適用可能にします。
各ノードは、任意に名前づけられたフックに対する任意の数の接続を許します。
各フックに対し、到着するデータにのみ適用される
.Xr bpf 8
フィルタプログラム、
マッチするパケットの宛先フック、
マッチしないパケットの宛先フック、
さまざまな統計カウンタが関連付けられます。
.Pp
.Xr bpf 8
プログラムは符号なし整数を返します。
これは、通常、返されるパケットのプレフィックス長として解釈されます。
このノードタイプにおいては、
0 が返されるときは、マッチしなかったことを意味します。
その場合は、
パケット全体が、マッチしない場合の宛先フックに送られます。
0 より大きな値が返されるときは、パケットはその長さに切り詰められ、
マッチした場合の宛先フックに送られます。
宛先フックのどちらかもしくは両方が、
空文字列であったり存在しないことも可能です。
この場合、パケットは捨てられます。
.Pp
新しいフックは、最初に、全てのパケットを捨てるように設定されます。
新しいフィルタは、
.Dv NGM_BPF_SET_FILTER
制御メッセージを使ってインストール可能です。
.Sh フック
このノードタイプは任意の名前を持った、いかなる数のフックをも
サポートします。
.Sh 制御メッセージ
このノードタイプは汎用制御メッセージをサポートし、
さらに以下のものをサポートします。
.Bl -tag -width foo
.It Dv NGM_BPF_SET_FILTER
このコマンドは、
到着したデータに適用するフィルタプログラムを、
フックにセットします。
次の構造体を引数として与えることが必要です。
.Bd -literal -offset 4n
struct ngm_bpf_hookprog {
  char            thisHook[NG_HOOKLEN+1];   /* フックの名称 */
  char            ifMatch[NG_HOOKLEN+1];    /* マッチ時の宛先フック */
  char            ifNotMatch[NG_HOOKLEN+1]; /* 非マッチ時の宛先フック */
  int32_t         bpf_prog_len;             /* プログラムの命令数 */
  struct bpf_insn bpf_prog[0];              /* bpf プログラム */
};
.Ed
.Pp
更新されるフックは、
.Dv thisHook
で指定されます。
BPF プログラムは、配列
.Dv bpf_prog
中の命令の並びです。
それは
.Dv bpf_prog_len
の長さでなければなりません。
マッチした到着パケットとマッチしなかった到着パケットは、
それぞれ、
.Dv ifMatch
と
.Dv ifNotMatch
の名前のフックに送られます。
このプログラムは、有効な
.Xr bpf 8
プログラムであることが必要であり、そうでない場合には
.Er EINVAL
が返されます。
.It Dv NGM_BPF_GET_FILTER
このコマンドは、フックの名称の ASCII 文字列を引数にとります。
上に示した、対応する
.Dv "struct ngm_bpf_hookprog"
を返します。
.It Dv NGM_BPF_GET_STATS
このコマンドは、フックの名称の ASCII 文字列を引数にとり、
フックに関連した統計値を
.Dv "struct ng_bpf_hookstat"
として返します。
.It Dv NGM_BPF_CLR_STATS
このコマンドは、フックの名称の ASCII 文字列を引数にとり、
フックに関連した統計値をクリアします。
.It Dv NGM_BPF_GETCLR_STATS
このコマンドは、
.Dv NGM_BPF_GET_STATS
と同様ですが、対象とした統計値がアトミックにクリアされます。
.El
.Sh シャットダウン
このノードは
.Dv NGM_SHUTDOWN
制御メッセージを受け取るか、
全てのフックの接続が切れたとき、
シャットダウンします。
.Sh バグ
ローダブルカーネルモジュールとして作成するとき、
このモジュールはファイル
.Dv "net/bpf_filter.c"
をインクルードします。
.Dv "net/bpf_filter.c"
が既にカーネル内に存在する場合、モジュールのロードは失敗すべきですが、
現在こうなっておらず、ファイルの複製されたコピーは干渉しません。
しかし、これは将来変更されるかもしれません。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr bpf 4 ,
.Xr ngctl 8
.Sh 作者
Archie Cobbs <archie@whistle.com>
