freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_cisco.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/cisco/ng_cisco.8,v 1.4 1999/12/21 01:25:07 julian Exp %
.\" $Whistle: ng_cisco.8,v 1.5 1999/01/25 23:46:26 archie Exp $
.\"
.Dd January 19, 1999
.\" jpman %Id: ng_cisco.8,v 1.3 1999/12/19 08:54:10 horikawa Stab %
.Dt NG_CISCO 8
.Os FreeBSD
.Sh 名称
.Nm ng_cisco
.Nd Cisco HDLC プロトコル netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_cisco.h>
.Sh 解説
.Nm cisco
ノードタイプは Cisco HDLC プロトコルを用いて、
パケットのカプセル化と非カプセル化を行います。
このプロトコルは、高速同期回線を行き来するパケットを伝送するための、
非常に単純なプロトコルです。
各パケットは Ethertype を前に付加しています。
これは、プロトコルを示しています。
また、
.Dq keep alive
と
.Dq inquire
ケーパビリティも存在します。
.Pp
.Dv downstream
フックは同期回線に接続する必要があります。ノードの反対側では、
.Dv inet ,
.Dv atalk ,
および
.Dv ipx
フックがそれぞれ 生 IP, AppleTalk, IPX パケットの送受信に使用されます。
一般的にこれらのフックは、
.Xr ng_iface 8
のノードの対応するフックに接続します。
.Sh IP 設定
IP トラフィックに対して適切に機能するために、ローカルの IP アドレスと 
netmask の設定を、ノードに正しく通知する必要があります。
これは、プロトコルが
.Dq inquire
パケットを含んでおり、
これに対する応答を準備しておく必要があるためです。
.Pp
このような調査 (inquire) パケットを受信したときはいつでも、ノードは
.Dv NGM_CISCO_GET_IPADDR
メッセージを
.Dv inet
フックに接続された対向に対して送ります (存在する場合) 。
対向が応答した場合には、応答をそのまま用います。
これで自動的に設定できます。
.Pp
対向が応答しない場合には、 IP アドレスと netmask として、
以前にキャッシュした値を利用します。
またいつでも、
.Dv NGM_CISCO_SET_IPADDR 
メッセージを使って、このキャッシュした値として設定することができ、
これが手動による設定になります。
.Pp
.Dv inet
フックが 
.Xr ng_iface 8 
ノードの 
.Dv inet
フックに接続している場合 (これは普段よくあることです) は、
.Xr ng_iface 8
が
.Dv NGM_CISCO_GET_IPADDR 
メッセージを理解するので、設定は自動的になります。
.Sh フック
本ノードタイプは次に挙げるフックをサポートしています:
.Pp
.Bl -tag -width foobarbazio
.It Dv downstream
同期回線への接続点。
.It Dv inet
IP フック。
.It Dv atalk
AppleTalk フック。
.It Dv ipx
IPX フック。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージに加え、
次のメッセージをサポートします:
.Bl -tag -width foo
.It Dv NM_CISCO_SET_IPADDR
このコマンドは、2 つの
.Dv struct in_addr
引数の配列をとります。
1 番目は対応するインタフェースの IP アドレス、2 番目は netmask です。
.It Dv NGM_CISCO_GET_IPADDR
このコマンドは、
.Dv NGM_CISCO_SET_IPADDR
で用いているものと同じフォーマットで IP 設定を返します。
IP アドレス照会パケットが受信されるときはいつでも、
このコマンドは同様に
.Dv inet
対向に対して、本ノードタイプによって
.Em 送り出されます。
.It Dv NGM_CISCO_GET_STATUS
構造体
.Dv "struct ngciscostat"
を返します :
.Bd -literal -offset 4n
struct ngciscostat {
  u_int32_t   seq_retries;       /* 非応答に対する再試行回数 */
  u_int32_t   keepalive_period;  /* 秒単位で */
};
.Ed
.El
.Sh シャットダウン
本ノードは、
.Dv NGM_SHUTDOWN
制御メッセージの受信時か、全フックが切り離されたときに、
シャットダウンします。
.Sh バグ
全ての機能が実装されているわけではありません。
例えば、ノードには遠隔端の IP アドレスと netmask について問い合せる
機能はサポートされていません。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr ng_iface 8 ,
.Xr ngctl 8 
.Rs
.%A D. Perkins
.%T "Requirements for an Internet Standard Point-to-Point Protocol"
.%O RFC 1547
.Re
.Sh LEGAL
.Tn Cisco
は Cisco Systems, Inc. の商標です。
.Sh 作者
.An Julian Elischer Aq julian@whistle.com ,
.An Archie Cobbs Aq archie@whistle.com
