freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_ether.8
.\" Copyright (c) 2000 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/share/man/man8/ng_ether.8,v 1.1 2000/01/25 20:26:52 archie Exp %
.\"
.\" jpman %Id: ng_ether.8,v 1.3 2000/06/06 10:01:17 okazaki Stab %
.Dd January 25, 2000
.Dt NG_ETHER 8
.Os FreeBSD
.Sh 名称
.Nm ng_ether
.Nd イーサネット netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_ether.h>
.Sh 解説
.Nm ether
netgraph ノードタイプは、イーサネットインタフェースを
.Xr netgraph 4 
ネットワーキングサブシステムと対話可能にします。
この機能を有効にするには、カーネルが
.Bd -literal
    options NETGRAPH
.Ed
.Pp
付きでコンパイルされている必要があります。
このようにすると、
システム上の各イーサネットインタフェースに対して、
netgraph ノードが自動的に作成されます。
ノードは、インタフェース名と同じ名前を持ちます。
また、ノードは永続的でもあります。
.Pp
サポートされている 2 個のフック
.Dv orphans
または
.Dv divert
のいずれかに接続が成されるまで、
イーサネットインタフェースは通常通り動作し続けます。
.Dv orphans
フックは、デバイスが受信する、未知または未サポートの
イーサタイプを持つイーサネットフレームを受信するために使用されます。
.Dv divert
フックは、デバイスが受信する
.Em 全
イーサネットフレームを転換 (divert) するために使用されます。
このフックが切断されるまで、
その他の点に関しては、インタフェースは黙り続けるように見えます。
.Pp
イーサネットフックは、
パケットをフックへ送信することにより、
イーサネットフレームの送信に使用可能です。
すべての場合、フレームは
標準の 14 バイトのイーサネットヘッダを持つ
生のイーサネットフレームです (ただしチェックサムはありません)。
.Sh フック
本ノードタイプは次のフックをサポートします:
.Pp
.Bl -tag -width orphans
.It Dv orphans
本フックは、デバイスが受信する、未知または未サポートの
イーサタイプを持つイーサネットフレームを送信します。
本フックで受信したフレームは、そのままワイヤに書き込まれます。
.It Dv divert
接続されると、
本フックは、デバイスが受信する全イーサネットフレームを送信します。
本フックで受信したフレームは、そのままワイヤに書き込まれます。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージのみをサポートします。
.Sh シャットダウン
本ノードは永続的です。
.Dv NGM_SHUTDOWN
制御メッセージを受信すると、全フックを切断します。
.Sh 使用例
次のコマンドは、
.Dv fxp0
インタフェースが受信する全パケットを、
デコードした 16 進数と ASCII の形式で、
標準出力へダンプします:
.\" 訳注: Bd ではなく Bl を使用。原文は rev. 1.3 で修正済み(doc/18292)。
.Bd -literal -offset indent
nghook -a fxp0: divert
.Ed
.Sh 関連項目
.Xr arp 4 ,
.Xr netgraph 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr nghook 8 ,
.Xr ngctl 8
.Sh 作者
.An Julian Elischer Aq julian@freebsd.org
