freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_frame_relay.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/frame_relay/ng_frame_relay.8,v 1.3.2.1 1999/11/17 07:23:43 julian Exp %
.\" $Whistle: ng_frame_relay.8,v 1.4 1999/01/25 23:46:26 archie Exp $
.\"
.\" jpman %Id: ng_frame_relay.8,v 1.3 1999/12/20 00:23:14 mitchy Stab %
.Dd January 19, 1999
.Dt NG_FRAME_RELAY 8
.Os FreeBSD 4.0
.Sh 名称
.Nm ng_frame_relay
.Nd フレームリレー netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_frame_relay.h>
.Sh 解説
.Nm frame_relay
ノードタイプは、フレームリレープロトコルを使用して、
パケットに対するカプセル化、カプセル化解除、多重化を行います。
1024 個までの DLCI をサポートします。
LMI プロトコルは、別のノードタイプが扱います (
.Xr ng_lmi 8
を参照してください)。
.Pp
.Dv downstream
フックは、同期回線、すなわちスイッチに接続されるべきです。
スイッチに接続すると、各 DLCI チャネルへ接続するために、フック
.Dv dlci0 ,
.Dv dlci1
〜
.Dv dlci1023
を利用可能です。
.Sh フック
本ノードタイプは次のフックをサポートします:
.Pp
.Bl -tag -width foobar
.It Dv downstream
同期回線への接続。
.It Dv dlciX
ここで X は 10 進数であり、0 から 1023 です。
本フックは、DLCI X のフレームリレー仮想チャネルに対応します。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージのみをサポートします。
.Sh シャットダウン
本ノードは、
.Dv NGM_SHUTDOWN
制御メッセージの受信時か、全フックが切断されたときに、シャットダウンします。
.Sh バグ
技術的には、両端の LMI プロトコルエンティティが DLCI X を活性状態とするまで、
DLCI X 上のフレームをスイッチに転送すべきではありません。
.Nm frame_relay
ノードタイプはこの制約を無視し、DLCI フック上で受信したデータを常に
.Dv downstream
へ渡します。
そうするのではなく、まず LMI ノードへ問い合わせるべきです。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr ng_lmi 8 ,
.Xr ngctl 8
.Sh 作者
Julian Elischer <julian@whistle.com>
