freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_iface.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/iface/ng_iface.8,v 1.5 1999/12/21 01:25:10 julian Exp %
.\" $Whistle: ng_iface.8,v 1.5 1999/01/25 23:46:26 archie Exp $
.\"
.Dd January 19, 1999
.\" jpman %Id: ng_iface.8,v 1.3 1999/12/19 08:54:22 horikawa Stab %
.Dt NG_IFACE 8
.Os FreeBSD
.Sh 名称
.Nm ng_iface
.Nd インタフェース netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_iface.h>
.Sh 解説
.Nm
ノードは、netgraph ノードとシステムネットワーキングインタフェースの
双方を兼ね備えています。
.Nm
ノードが作成される際、
.Xr ifconfig 8
によってアクセス可能な、
新規の point-to-point インタフェースが作成されます。
新規のインタフェースは
.Dv ng0 ,
.Dv ng1 
という具合に名前付けられます。
ノードには、そのインタフェースと同じ名前が割り当てられます。この名前が
すでに存在する場合には、ノードは無名となります。
.Pp
.Nm
ノードには、
サポートしている各プロトコルと一致したフックがそれぞれ 1 つだけ存在します。
インタフェースを通して送信されるパケットは、
対応するプロトコルに特有のフックから流れます。
同様に、フックで受信されたパケットは、
対応したプロトコルで受信されたパケットとして、インタフェースに現れます。
.Pp
現在サポートしているプロトコルは IP, IPX, AppleTalk, NS です。
KLD モジュールには、
標準では IP に対するサポートのみが組み込まれています。
.Pp
.Nm
ノードは Berkeley Packet Filter (BPF) をサポートしています。
.Sh フック
本ノードタイプは次に挙げるフックをサポートしています:
.Pp
.Bl -tag -width foobar
.It Dv inet
IP パケットの送信点および受信点。
.It Dv ipx
IPX パケットの送信点および受信点。
.It Dv atalk
AppleTalk パケットの送信点および受信点。
.It Dv ns
NS パケットの送信点および受信点。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージに加え、
次のメッセージをサポートします:
.Bl -tag -width foo
.It Dv NGM_IFACE_GET_IFNAME
このノードと一致しているインタフェースの名前を
.Dv "struct ng_iface_ifname"
で返します:
.Bd -literal -offset 4n
struct ng_iface_ifname {
  char  ngif_name[NG_IFACE_IFACE_NAME_MAX + 1];
};
.Ed
.It Dv NGM_IFACE_GET_IFADDRS
このインタフェースと関連したアドレスのリストを返します。
このリストは
.Fn ioctl
で
.Dv SIOCGIFCONF
を指定したときと同じフォーマットで返します。
.It Dv NGM_CISCO_GET_IPADDR
このメッセージは
.Xr ng_cisco 8
ノードタイプで定義されています;
詳細に関しては
.Xr ng_cisco 8
を参照してください。
.El
.Sh シャットダウン
現状において、
.Fx
はシステムネットワーキングインタフェースを
削除することは不可能なため、
.Nm
ノードは
.Em 永続的
なものとなっています。
つまり、一度作成されると決して消去されることはありません。
.Dv NGM_SHUTDOWN
制御メッセージを受信した場合、
全てのフックは切断されますが、ノードは破棄されません。
.Sh 関連項目
.Xr bpf 4 ,
.Xr netgraph 4 ,
.Xr ifconfig 8 ,
.Xr ng_cisco 8 ,
.Xr ng_ppp 8 ,
.Xr ng_rfc1490 8 ,
.Xr ngctl 8
.Sh 歴史
.Nm
ノードタイプは
.Fx 4.0
で実装されました。
.Sh 作者
.An Archie Cobbs Aq archie@whistle.com
