freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_lmi.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/lmi/ng_lmi.8,v 1.4 1999/12/21 01:25:12 julian Exp %
.\" $Whistle: ng_lmi.8,v 1.4 1999/01/25 23:46:27 archie Exp $
.\"
.\" jpman %Id: ng_lmi.8,v 1.3 1999/12/20 00:22:21 mitchy Stab %
.Dd January 19, 1999
.Dt NG_LMI 8
.Os FreeBSD
.Sh 名称
.Nm ng_lmi
.Nd フレームリレー LMI プロトコル netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_lmi.h>
.Sh 解説
.Nm lmi
ノードタイプは、フレームリレー LMI プロトコルを実行します。
ITU Annex A, ANSI Annex D, Group-of-four LMI タイプをサポートします。
また、LMI タイプの自動検出もサポートします。
.Pp
特定の LMI タイプを有効にするには、対応するフック (
.Dv annexA ,
.Dv annexD ,
.Dv group4
のいずれか) を、
.Xr ng_frame_relay 8
ノードの DLCI の 0 または 1023 へ接続します。
典型的には、Annex A と Annex D が DLCI 0 に存在し、
Group-of-four は DLCI 1023 に存在します。
.Pp
LMI タイプの自動検出を有効にするには、
.Dv auto0
フックを DLCI 0 へ接続し、
.Dv auto1023
フックを DLCI 1023 へ接続します。
ノードは、
どの LMI タイプがスイッチ上で実行されているかを自動的に判定して、
そのモードに移行しようとします。
.Pp
1 個の固定 LMI タイプまたは自動検出だけが、ある一時期には活性化可能です。
.Pp
LMI プロトコルと各 DLCI チャネルの現在の状態を問い合わせるために、
.Dv NGM_LMI_GET_STATUS
制御メッセージをいつでも使用可能です。
本ノードは、
.Dv NGM_TEXT_STATUS
制御メッセージもまたサポートします。
.Sh フック
本ノードタイプは次のフックをサポートします:
.Pp
.Bl -tag -width foobarbaz
.It Dv annexA
ITU Annex A LMI フック。
.It Dv annexD
ANSI Annex D LMI フック。
.It Dv group4
Group-of-four LMI フック。
.It Dv auto0
DLCI 0 に対する自動検出フック。
.It Dv auto1023
DLCI 1023 に対する自動検出フック。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージをサポートし、
更に次のものもサポートします:
.Bl -tag -width foo
.It Dv NGM_LMI_GET_STATUS
本コマンドは、状態情報を
.Dv "struct nglmistat"
構造体に入れて返します:
.Bd -literal -offset 4n
#define NGM_LMI_STAT_ARYSIZE   (1024/8)

struct nglmistat {
  u_char  proto[12];	/* 活性中のプロトコル (フック名と同じ) */
  u_char  hook[12];	/* 活性中のフック */
  u_char  fixed;	/* 固定 LMI モードにセットされているか */
  u_char  autod;	/* 現在自動検出モードか */
  u_char  seen[NGM_LMI_STAT_ARYSIZE];
			/* 見える DLCI のビットマップ */
  u_char  up[NGM_LMI_STAT_ARYSIZE];
			/* アップ状態の DLCI のビットマップ */
};
.Ed
.It Dv NGM_TEXT_STATUS
この汎用メッセージは、可読形式でノードの状態を返します。
.El
.Sh シャットダウン
本ノードは、
.Dv NGM_SHUTDOWN
制御メッセージの受信時か、全フックが切断されたときに、シャットダウンします。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr ng_frame_relay 8 ,
.Xr ngctl 8
.Rs
.%T "ANSI T1.617-1991 Annex D"
.Re
.Rs
.%T "ITU-T Q.933 Digital Subscriber Signaling System No. 1 - Signaling Specification for Frame Mode Basic Call Control, Annex A"
.Re
.Sh 歴史
.Nm
ノードタイプは
.Fx 4.0
で実装されました。
.Sh 作者
.An Julian Elischer Aq julian@whistle.com
