freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_pptpgre.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/pptpgre/ng_pptpgre.8,v 1.4 2000/03/10 20:38:24 archie Exp %
.\" $Whistle: ng_pptpgre.8,v 1.2 1999/12/08 00:20:53 archie Exp $
.\"
.\" jpman %Id: ng_pptpgre.8,v 1.3 2000/01/03 03:17:39 horikawa Stab %
.Dd November 29, 1999
.Dt NG_PPTPGRE 8
.Os FreeBSD
.Sh 名称
.Nm ng_pptpgre
.Nd PPTP GRE プロトコル netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_pptpgre.h>
.Sh 解説
.Nm pptpgre
ノードタイプは RFC 2637 に明記された PPTP プロトコルのための
Generic Routing Encapsulation (GRE) over IP を行ないます。
これはパケットのカプセル化、シーケンシング、確認応答、
適応型タイムアウトスライディングウィンドウの機構
と関係します。
このノードタイプは、いかなる TCP 制御プロトコルも操作しませんし、
PPTP で定義されるネゴシエーションも呼び出しません。
.Pp
このノードタイプの典型的な使い方は、
.Xr ng_ppp 8
ノードのリンクフックの一つへ上位の (
.Dv upper
) フックを接続し、
.Xr ng_ksocket 8
ノードの
.Dv "inet/raw/gre"
フックへ下位の (
.Dv lower
) フックを接続するというものでしょう。
.Sh フック
このノードタイプは以下のフックをサポートします。
.Pp
.Bl -tag -compact -width vjc_vjuncomp
.It Dv upper
上位のプロトコル階層への接続
.It Dv lower
下位のプロトコル階層への接続
.El
.Pp
.Sh 制御メッセージ
このノードタイプは汎用制御メッセージをサポートし、
さらに以下のものをサポートします。
.Bl -tag -width foo
.It Dv NGM_PPTPGRE_SET_CONFIG
このコマンドは、セッション用にノードをリセットし、設定します。
このコマンドは、
.Dv "struct ng_pptpgre_conf"
を引数にとります。
.Bd -literal -offset 0
/* セッションの設定 */
struct ng_pptpgre_conf {
    u_char      enabled;          /* トラフィックフロー有効化 */
    u_char      enableDelayedAck; /* 遅延確認応答有効化 */
    u_int16_t   cid;              /* 自分の call id */
    u_int16_t   peerCid;          /* 相手の call id */
    u_int16_t   recvWin;          /* 相手の受信ウィンドウサイズ */
    u_int16_t   peerPpd;          /* 相手のパケット処理遅延
                                     ( 1/10 秒単位 ) */
};

.Ed
.Dv enabled
フィールドは、ノードを通過するトラフィックを有効にします。
.Dv enableDelayedAck
フィールドは、遅延確認応答 (最大で 250 ミリ秒) を有効にします。
これは最適化に役立つので大抵はオンにされるべきです。
残りのフィールドは仮想的な PPTP 呼び出しを確立する過程で与えられます。
.It Dv NGM_PPTPGRE_GET_CONFIG
現在の設定を
.Dv "struct ng_pptpgre_conf"
として返します。
.El
.Sh シャットダウン
このノードは
.Dv NGM_SHUTDOWN
制御メッセージを受け取るか、
両方のフックの接続が切れたときにシャットダウンします。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr ng_ksocket 8 ,
.Xr ng_ppp 8 ,
.Xr ngctl 8
.Rs
.%A K. Hamzeh
.%A G. Pall
.%A W. Verthein
.%A J. Taarud
.%A W. Little
.%A G. Zorn
.%T "Point-to-Point Tunneling Protocol (PPTP)"
.%O RFC 2637
.Re
.Rs
.%A S. Hanks
.%A T. \&Li
.%A D. Farinacci
.%A P. Traina
.%T "Generic Routing Encapsulation over IPv4 networks"
.%O RFC 1702
.Re
.Sh 歴史
.Nm
ノードタイプは
.Fx 4.0
で実装されました。
.Sh 作者
.An Archie Cobbs Aq archie@whistle.com
