freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_rfc1490.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/rfc1490/ng_rfc1490.8,v 1.4 1999/12/21 01:25:18 julian Exp %
.\" $Whistle: ng_rfc1490.8,v 1.4 1999/01/25 23:46:27 archie Exp $
.\"
.Dd January 19, 1999
.\" jpman %Id: ng_rfc1490.8,v 1.3 1999/12/20 00:21:49 mitchy Stab %
.Dt NG_RFC1490 8
.Os FreeBSD
.Sh 名称
.Nm ng_rfc1490
.Nd RFC 1490 netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_rfc1490.h>
.Sh 解説
.Nm rfc1490
ノードタイプは、RFC 1490 (その後 RFC 2427 によって更新されています) に
従った、プロトコルのカプセル化、非カプセル化、そして多重化を行います。
このカプセル化タイプは、
フレームリレーにおける DLCI チャネルの上部にて、
しばしば用いられます。
.Pp
.Dv downstream
フックはカプセル化されたフレームの送信および受信に利用されます。
ノードの反対側では、
.Dv inet
と
.Dv ppp
フックがそれぞれ生 IP  フレームと PPP フレームの送信および受信に使用されます。
PPP フレームは RFC 1973 に従って送信および受信が行われます; 
特に
.Dv ppp
フックに到着するフレームは、PPP プロトコル番号から始まります。
.Pp
特に
.Dv inet
フックは
.Xr ng_iface 8
ノード内の
.Dv inet
フックに接続されます。
.Sh フック
本ノードタイプは次のフックをサポートします:
.Pp
.Bl -tag -width foobarbazum
.It Dv downstream
RFC 1490 対向エンティティへ接続します。
.It Dv inet
生 IP フレームの送信と受信を行います。
.It Dv ppp
PPP フレームの送信と受信を行います。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージのみをサポートします。
.Sh シャットダウン
本ノードは、
.Dv NGM_SHUTDOWN
制御メッセージの受信時か、全フックが切断されたときに、シャットダウンします。
.Sh バグ
RFC 1490 の全てが、実装されているわけではありません。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr ng_frame_relay 8 ,
.Xr ng_iface 8 ,
.Xr ngctl 8 
.Rs
.%A C. Brown, A. Malis
.%T "Multiprotocol Interconnect over Frame Relay"
.%O RFC 2427
.Re
.Rs
.%A W. Simpson
.%T "PPP in Frame Relay"
.%O RFC 1973
.Re
.Sh 歴史
.Nm
ノードタイプは
.Fx 4.0
で実装されました。
.Sh 作者
.An Julian Elischer Aq julian@whistle.com
