freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_tee.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/tee/ng_tee.8,v 1.5 1999/12/21 01:25:20 julian Exp %
.\" $Whistle: ng_tee.8,v 1.4 1999/01/25 23:46:27 archie Exp $
.\"
.Dd January 19, 1999
.\" jpman %Id: ng_tee.8,v 1.3 1999/12/27 00:45:07 mitchy Stab %
.Dt NG_TEE 8
.Os FreeBSD
.Sh 名称
.Nm ng_tee
.Nd netgraph ``tee'' ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_tee.h>
.Sh 解説
.Nm tee
ノードタイプには
.Xr tee 1
と同じような用途があります。
.Nm tee
ノードは、2 つの netgraph ノード間接続をデバッグするとき、
あるいは
.Dq 覗き見る
ときに役立ちます。
.Nm tee
ノードは
.Dv right 
および
.Dv left ,
.Dv right2left ,
.Dv left2right 
の、 4 つのフックを持っています。
.Dv right
で受信された全てのデータは
.Dv left
と
.Dv right2left 
.Em 両方の
フックに、無加工の状態で送り出されます。
同様に、
.Dv left
で受信された全てのデータは
.Dv right
と
.Dv left2right 
両方のフックに無加工の状態で送り出されます。
.Pp
パケットは
.Dv right2left
と
.Dv left2right
でも受信します;
受信した場合にはそれぞれ、
.Dv left
および
.Dv right
のフックへ、パケットは元のままで送り出されます。
.Sh フック
このノードタイプは次に挙げるフックをサポートしています:
.Pp
.Bl -tag -width foobarbarfoo
.It Dv right
右側にあるノードとの接続。
.It Dv left
左側にあるノードとの接続。
.It Dv right2left
右から左に流れるパケットのタップ。
.It Dv left2right
右から左に流れるパケットのタップ。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージに加え、
次のメッセージをサポートします。
.Bl -tag -width foo
.It Dv NGM_TEE_GET_STATS
統計を
.Dv "struct ng_tee_stats" 
の形で得ます。
.It Dv NGM_TEE_CLR_STATS
統計をクリアします。
.El
.Sh シャットダウン
本ノードは、
. NGM_SHUTDOWN
制御メッセージの受信時か、全フックが切り離されたときに、
シャットダウンします。
.Sh 関連項目
.Xr tee 1 ,
.Xr netgraph 4 ,
.Xr ngctl 8 
.Sh 作者
Julian Elischer <julian@whistle.com>
