freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_tty.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/tty/ng_tty.8,v 1.4 1999/12/21 01:25:20 julian Exp %
.\" $Whistle: ng_tty.8,v 1.5 1999/01/25 23:46:28 archie Exp $
.\"
.\" jpman %Id: ng_tty.8,v 1.2 1999/12/29 10:29:20 horikawa Stab %
.Dd January 19, 1999
.Dt NG_TTY 8
.Os FreeBSD
.Sh 名称
.Nm ng_tty
.Nd 回線規約でもある netgraph ノードタイプ
.Sh 書式
.Fd #include <sys/ttycom.h>
.Fd #include <netgraph/ng_message.h>
.Fd #include <netgraph/ng_tty.h>
.Sh 解説
.Nm tty
ノードタイプは、
netgraph ノードタイプであると同時に、回線規約でもあります。
新規ノードは、対応する回線規約
.Dv NETGRAPHDISC
が tty デバイス (
.Xr tty 4
参照) に登録された時に、生成されます。
.Pp
本ノードは、
.Dv hook
と呼ばれる単一のフックを持ちます。
tty デバイス上で受信される入力バイトは、このフックから送出され、
.Dv hook
上で受信されるフレームは tty デバイスから送出されます。
どちらの方向においても、データの修正は行われません。
回線規約が tty にインストールされている間は、
通常の読み込みと書き込みの操作は利用できず、
.Er EIO
を返します。
.Pp
本ノードは、オプションの「ホット文字
.Dq hot character
」をサポートします。
これを非 0 に設定すると、tty デバイスからの入力データは、
この文字が入力されるまで蓄えられます。
これにより、少数バイトを含む多数の mbuf の送信を避けられますが、
無限遅延を起こしてしまう可能性もあります。
デフォルトのホット文字は 0x7e であり、
.Xr ng_async 8
タイプノードに接続される
.Dv hook
と一貫性があります。
ホット文字は、送信データへの影響を持ちません。
.Pp
本ノードは、tty デバイスと同じ netgraph 名を、自己に与えようとします。
いかなる場合でも、ノードの情報は、netgraph の
.Xr ioctl 2
コマンド
.Dv NGIOCGINFO
で利用可能です。
本コマンドは、
.Dv NGM_NODEINFO
netgraph 制御メッセージに似た、単一の
.Dv "struct nodeinfo"
を返します。
.Sh フック
本ノードタイプは、次のフックをサポートします:
.Pp
.Bl -tag -width foobar
.It Dv hook
.Dv mbuf
構造体に格納された、任意のフレーム間境界の、
.Xr tty 4
シリアルデータ。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージをサポートし、
更に次のものもサポートします:
.Bl -tag -width foo
.It Dv NGM_TTY_SET_HOTCHAR
本コマンドは、単一の整数引数を取り、
下位 8 ビットからホット文字を設定します。
ホット文字 0 は、キューイングを無効にしますので、
全受信データは即座に転送されます。
.It Dv NGM_TTY_GET_HOTCHAR
下位 8 ビットに現在のホット文字を格納した、単一整数を返します。
.Sh シャットダウン
本ノードは、対応するデバイスがクローズされたとき
(またはデバイス上から回線規約がアンインストールされたとき) に、
シャットダウンします。
.Dv NGM_SHUTDOWN
制御メッセージは無効であり、常にエラー
.Er EOPNOTSUPP
を返します。
.Sh バグ
シリアルドライバコードもまた「ホット文字」の概念を持ちます。
この値は回線規約のもとに静的に定義されているため、変更不可能です。
それ故、0x7e (デフォルト) 以外のホット文字が
.Nm tty
ノード用に定義されると、
本ノードはこの情報をシリアルドライバへ伝える方法を持たないため、
準最適な性能になってしまいます。
.Sh 関連項目
.Xr ioctl 2 ,
.Xr netgraph 4 ,
.Xr tty 4 ,
.Xr ng_async 8 ,
.Xr ngctl 8
.Sh 歴史
.Nm
ノードタイプは
.Fx 4.0
で実装されました。
.Sh 作者
.An Archie Cobbs Aq archie@whistle.com
