freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_UI.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/UI/ng_UI.8,v 1.3 1999/12/21 01:25:04 julian Exp %
.\" $Whistle: ng_UI.8,v 1.4 1999/01/25 02:37:56 archie Exp $
.\"
.Dd January 19, 1999
.\" jpman %Id: ng_UI.8,v 1.3 1999/12/19 08:53:56 horikawa Stab %
.Dt NG_UI 8
.Os FreeBSD
.Sh 名称
.Nm ng_UI
.Nd UI netgraph ノードタイプ
.Sh 書式
.Fd #include <netgraph/ng_UI.h>
.Sh 解説
.Nm UI
ノードタイプは 2 つのフックを持ちます。
.Dv upstream
と
.Dv downstream 
です。
downstream で受信されるパケットは、
先頭のバイトに 0x03 (番号付け無し (unnumbered) の情報を示しています)
を持つ必要があります。
もし持たない場合には、パケットは破棄されます。
その後、このバイトは取り除かれます。そして、残ったパケットを
.Dv upstream
から外へ送り出します。
.Pp
逆に、
.Dv upstream
で受信されるパケットには、
.Dv downstream
フックから転送される前にバイト 0x03 が付加されます。
.Sh フック
本ノードタイプは次に挙げるフックをサポートしています:
.Pp
.Bl -tag -width foobar
.It Dv downstream
下流の接続点。ノードのこちら側のパケットは、
先頭のバイトに 0x03 を持ちます。
.It Dv upstream
上流の接続点。ノードのこちら側のパケットは、
先頭のバイト 0x03 が取り除かれます。
.El
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージのみをサポートします。
.Sh シャットダウン
本ノードは、
.Dv NGM_SHUTDOWN
制御メッセージの受信時か、両方のフックが切り離されたときに、
シャットダウンします。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr ngctl 8 
.Sh 歴史
.Nm
ノードタイプは
.Fx 4.0
で実装されました。
.Sh 作者
Julian Elischer <julian@whistle.com>
