freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ng_vjc.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\" 
.\" Author: Archie Cobbs <archie@whistle.com>
.\"
.\" %FreeBSD: src/sys/modules/netgraph/vjc/ng_vjc.8,v 1.8 2000/01/03 18:36:42 archie Exp %
.\" $Whistle: ng_vjc.8,v 1.4 1999/01/25 23:46:28 archie Exp $
.\"
.\" jpman %Id: ng_vjc.8,v 1.2 1999/12/29 10:29:26 horikawa Stab %
.Dd January 19, 1999
.Dt NG_VJC 8
.Os FreeBSD
.Sh 名称
.Nm ng_vjc
.Nd Van Jacobsen 圧縮 netgraph ノードタイプ
.Sh 書式
.Fd #include <net/slcompress.h>
.Fd #include <netgraph/ng_vjc.h>
.Sh 解説
.Nm vjc
ノードタイプは、Van Jacobsen 圧縮を行います。
これは、PPP や SLIP や他の point-to-point IP 接続において、
TCP パケットヘッダ圧縮に使用されます。
.Dv ip
フックは、本ノードの未圧縮側を表し、
.Dv vjcomp ,
.Dv vjuncomp ,
.Dv vjip
フックは、本ノードの圧縮側を表します。
.Dv ip
上で受信されたパケットは、必要に応じて圧縮され、あるいはそのまま通過します。
他の 3 つのフック上で受信されたパケットは、必要に応じて伸長されます。
また本ノードは
.Dq 常時そのまま通過する
モードも双方向にサポートします。
.Pp
Van Jacobsen 圧縮は、TCP パケットに対してのみ適用されます。
.Dq 通常の
(すなわち一般の) TCP パケットのみが、実際に圧縮されます。
これらは
.Dv vjcomp
フックから出力されます。
他の TCP パケットは、状態機械を通過しますが、圧縮されません。
これらは
.Dv vjuncomp
フック上に現れます。
他の非 TCP IP パケットは、無変更で
.Dv vjip
へ転送されます。
.Pp
.Xr ng_ppp 8
ノードへ接続されたとき、
.Dv ip ,
.Dv vjuncomp ,
.Dv vjcomp , 
.Dv vjip
フックは、それぞれ
.Xr ng_ppp 8
ノードの
.Dv vjc_ip ,
.Dv vjc_vjcomp ,
.Dv vjc_vjuncomp ,
.Dv vjc_ip
フックに接続されるべきです。
.Sh フック
本ノードタイプは次のフックをサポートします:
.Pp
.Bl -tag -width foobarbazi
.It Dv ip
上流 (upstream) の (非圧縮) IP パケット。
.It Dv vjcomp
下流 (downstream) の圧縮 TCP パケット。
.It Dv vjuncomp
下流 (downstream) の非圧縮 TCP パケット。
.It Dv vjip
下流 (downstream) の非圧縮 IP パケット。
.Sh 制御メッセージ
本ノードタイプは、汎用制御メッセージをサポートし、
更に次のものもサポートします:
.Bl -tag -width foo
.It Dv NGM_VJC_SET_CONFIG
本コマンドは、圧縮の状態をリセットし、指定された
.Dv "struct ngm_vjc_config"
引数に従って設定します。
この構造体は、次のフィールドを含みます:
.Bd -literal -offset 4n
struct ngm_vjc_config {
  u_char   enableComp;    /* 圧縮を有効化します */
  u_char   enableDecomp;  /* 伸長を有効化します */
  u_char   maxChannel;    /* 出力チャネル数 - 1 */
  u_char   compressCID;   /* 出力 CID の圧縮が OK */
};
.Ed
.Pp
.Dv enableComp
が 0 に設定されると、
.Dv ip
フック上で受信された全パケットが、無変更で
.Dv vjip
フックへ転送されます。
同様に、
.Dv enableDecomp
が 0 に設定されると、
.Dv vjip
フック上で受信された全パケットが無変更で
.Dv ip
フックへ転送され、
.Dv vjcomp
と
.Dv vjuncomp
のフック上ではパケットを受信しません。
ノードが最初に作成されたとき、圧縮と伸長は共に無効化され、
それ故本ノードは双方向
.Dq 通過
モードで動作します。
.Pp
圧縮有効化時には、
.Dv maxChannel
は出力圧縮チャネル数から 1 を減じた数に設定すべきであり、
3 以上 15 以下の値となります。
.Dv compressCID
フィールドは、
出力圧縮 TCP パケットの CID ヘッダフィールドを圧縮しても良いかを示します。
(a) 入力フレームの喪失可能性が無い場合と、
(b) フレーム喪失検出の信頼度が高く、
喪失が即時に対向の圧縮エンジンに通知される場合を除き、
この値は 0 であるべきです (後述の
.Dv NGM_VJC_RECV_ERROR
を参照してください)。
.It Dv NGM_VJC_GET_STATE
本コマンドは、
.Dv "struct slcompress"
構造体で記述される、ノードの現在の状態を返します。
この構造体は
.Pa net/slcompress.h
で定義されています。
.It Dv NGM_VJC_CLR_STATS
ノードの統計情報カウンタをクリアします。
.Dv NGM_VJC_SET_CONFIG
制御メッセージにより
.Dv enableComp
または
.Dv enableDecomp
のフィールドが 0 から 1 に変更されたときにも、統計情報はクリアされます。
.It Dv NGM_VJC_RECV_ERROR
対向が CID ヘッダフィールド圧縮を有効にしているとき、
受信フレームの喪失をチェックサム不良や他の理由によって検出した場合には、
ただちにこのメッセージをローカルの
.Nm vjc
ノードに送る必要があります。
この動作を行わないと、TCP ストリームデータが壊れます。
.Sh シャットダウン
本ノードは、
.Dv NGM_SHUTDOWN
制御メッセージの受信時か、全フックが切断されたときに、シャットダウンします。
.Sh バグ
Van Jacobsen 圧縮のカーネル実装における初期化ルーチンが
圧縮と伸長を両方同時に初期化してしまうため、
本ノードの圧縮と伸長を別々の操作で有効化できません。
一方が既に有効化されているときに他方を有効化するには、
まず両方を無効化してから、両方を有効化する必要があります。
これはもちろん、ノードの状態をリセットしてしまいます。
この制約は、将来のバージョンで解消されるかもしれません。
.Pp
ロード可能カーネルモジュールとして生成すると、
モジュールには、ファイル
.Pa net/slcompress.c
が組み込まれます。
.Pa net/slcompress.c
がカーネルに組み込み済の場合にはモジュールのロードは失敗すべきですが、
現在はそうなっておらず、
ファイルの複製間での干渉は起きません。
しかし、この動作は将来変わるかもしれません。
.Sh 関連項目
.Xr netgraph 4 ,
.Xr ng_ppp 8 ,
.Xr ng_iface 8 ,
.Xr ngctl 8
.Rs
.%A V. Jacobsen
.%T "Compressing TCP/IP Headers"
.%O RFC 1144
.Re
.Rs
.%A G. McGregor
.%T "The PPP Internet Control Protocol (IPCP)"
.%O RFC 1332
.Re
.Sh 歴史
.Nm
ノードタイプは
.Fx 4.0
で実装されました。
.Sh 作者
.An Archie Cobbs Aq archie@whistle.com
