freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ngctl.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\" 
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\" 
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/ngctl/ngctl.8,v 1.2.2.4 2000/03/06 11:36:35 sheldonh Exp %
.\" $Whistle: ngctl.8,v 1.6 1999/01/20 03:19:44 archie Exp $
.\"
.\" jpman %Id: ngctl.8,v 1.3 1999/12/17 05:27:44 mitchy Stab %
.Dd January 19, 1999
.Dt NGCTL 8
.Os FreeBSD 3
.Sh 名称
.Nm ngctl
.Nd netgraph 制御ユーティリティ
.Sh 書式
.Nm
.Op Fl d
.Op Fl f Ar filename
.Op Fl n Ar nodename
.Op Ar command ...
.Sh 解説
.Nm
ユーティリティは、netgraph コマンド発行に使用可能な、
.Em socket
タイプの netgraph ノードを作成します。
.Fl f
フラグを指定せず、
コマンドライン上で command を指定しない場合で標準入力が tty であるとき、
.Nm
は対話モードに入ります。そうでない場合、
.Nm
は与えられたコマンド (複数可) を実行し、すぐに終了します。
.Pp
ノードは、作成、削除、相互接続等が可能です。
ノードがバイナリ / ASCII 制御メッセージの変換をサポートしている場合、
そのノードに対して
.Tn ASCII
形式の制御メッセージを送信可能です。
.Pp
対話モードでは、
ソケットノードが受信したすべての制御メッセージとデータパケットを
.Nm
は表示します。
制御メッセージについては、
送出元のノードが変換をサポートしている場合には、
メッセージの引数は
.Tn ASCII
形式で表示されます。
.Pp
オプションは次の通りです:
.Bl -tag -width indent
.It Fl f Ar nodeinfo
指定したファイルからコマンドを読み込みます。
単一のダッシュは標準入力を示します。
空行および
.Dq #
から開始する行は無視されます。
.It Fl n Ar nodename
新規作成された netgraph ノードに
.Em nodename
を割り当てます。
デフォルト名は
.Em ngctlXXX
であり、 XXX はプロセス ID 番号です。
.It Fl d
デバッグ用冗長レベルを増加します。
.El
.Sh コマンド
.Nm
が現在サポートしているコマンドは次の通りです:
.Pp
.Bd -literal -offset indent -compact
connect    2 個のノードの接続
debug      デバッグ用冗長レベルの取得/設定
help       コマンドサマリの表示またはコマンドヘルプの取得
list       全ノードの情報表示
mkpeer     新規ノードを作成し既存ノードへ接続
msg        ノードに対する ASCII 形式メッセージの送信
name       ノードへの名前割り当て
read       ファイルからのコマンド読み込みと実行
rmhook     ノードフックの切断
show       ノード情報の表示
shutdown   ノードのシャットダウン
status     ノードからの可読形式の状態取得
types      組み込み済の全ノードタイプの表示
quit       プログラムの終了
.Ed
.Pp
コマンドには別名を持つものがあります。
例えば
.Dq ls
は
.Dq list
と同じです。
.Dq help
コマンドは、
使用可能なコマンドと、それらの用法と別名、短い解説を表示します。
.Sh 終了値
.Nm
ユーティリティは、成功時には 0 で終了し、エラー発生時には >0 で終了します。
.Sh 関連項目
.Xr netgraph 3 ,
.Xr netgraph 4 ,
.Xr nghook 8
.Sh 歴史
.Nm netgraph
システムのデザインと最初の実装は、Whistle Communications, Inc. で、
Whistle InterJet 向けにカスタマイズされた
.Fx 2.2
で行われました。
.Sh 作者
.An Archie Cobbs Aq archie@whistle.com
