freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nghook.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\"
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\"
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\"
.\"  %FreeBSD: src/usr.sbin/nghook/nghook.8,v 1.14 2003/08/13 07:43:08 harti Exp %
.\" $Whistle: nghook.8,v 1.4 1999/01/20 03:19:45 archie Exp $
.\"
.\" $FreeBSD$
.Dd January 19, 1999
.Dt NGHOOK 8
.Os
.Sh 名称
.Nm nghook
.Nd
.Xr netgraph 4
ノードへ接続する
.Sh 書式
.Nm
.Op Fl Sadlns
.Ar path
.Op Ar hookname
.Sh 解説
.Nm
ユーティリティは
.Xr ng_socket 4
ソケットタイプノードを作成し、これを
.Ar path
にあるノードのフック
.Ar hookname
へ接続します。
.Ar hookname
が省略されると、
.Dq debug
を指定したものとされます。
.Pp
接続されると、標準入力へ書き込まれる全データがこのノードに送られ、
このノードから受け取る全データが標準出力へ渡されます。
.Nm
ユーティリティは、標準入力に
.Dv EOF
を検知すると終了します。
.Pp
オプションは次の通りです:
.Pp
.Bl -tag -width indent
.It Fl S
デフォルトの 1 の代りに 0 を、出力ファイル記述子として使用します。
.It Fl a
各読み込みパケットを、生のバイナリではなく、人間が読める形式の
.Tn ASCII
で出力します。
.It Fl d
デバッグ用冗長レベルを増加します。
.It Fl l
全受信データを標準出力へ書き込むだけではなく、フックへ戻します。
.It Fl n
標準入力からのデータ読み込みを試みません。
.Nm
ユーティリティは、シグナルによって停止させられるまで、
ノードからの読み込みを続けます。
.It Fl s
デフォルトの 0 の代りに 1 を、入力ファイル記述子として使用します。
.El
.Sh バグ
全入力はバッファリングしないモードで読み込みますが、
入力のパケット化を制御する方法はありません。
.Sh 関連項目
.Xr netgraph 3 ,
.Xr netgraph 4 ,
.Xr ngctl 8
.Sh 歴史
.Em netgraph
システムのデザインと最初の実装は、Whistle Communications, Inc. で、
Whistle InterJet 向けにカスタマイズされた
.Fx 2.2
で行われました。
.Sh 作者
.An Archie Cobbs Aq archie@whistle.com
