freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nghook.8
.\" Copyright (c) 1996-1999 Whistle Communications, Inc.
.\" All rights reserved.
.\"
.\" Subject to the following obligations and disclaimer of warranty, use and
.\" redistribution of this software, in source or object code forms, with or
.\" without modifications are expressly permitted by Whistle Communications;
.\" provided, however, that:
.\" 1. Any and all reproductions of the source or object code must include the
.\"    copyright notice above and the following disclaimer of warranties; and
.\" 2. No rights are granted, in any manner or form, to use Whistle
.\"    Communications, Inc. trademarks, including the mark "WHISTLE
.\"    COMMUNICATIONS" on advertising, endorsements, or otherwise except as
.\"    such appears in the above copyright notice or in the software.
.\"
.\" THIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS "AS IS", AND
.\" TO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO
.\" REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,
.\" INCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
.\" WHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY
.\" REPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS
.\" SOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.
.\" IN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES
.\" RESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING
.\" WITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
.\" PUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY
.\" OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/nghook/nghook.8,v 1.16 2004/06/05 20:21:17 ru Exp %
.\" $Whistle: nghook.8,v 1.4 1999/01/20 03:19:45 archie Exp $
.\"
.\" $FreeBSD$
.Dd October 24, 2003
.Dt NGHOOK 8
.Os
.Sh 名称
.Nm nghook
.Nd
.Xr netgraph 4
ノードへ接続する
.Sh 書式
.Nm
.Op Fl adlnSs
.Op Fl m Ar msg
.Ar path
.Op Ar hookname
.Nm
.Fl e
.Op Fl n
.Op Fl m Ar msg
.Ar path
.Ar hookname
.Ar program
.Op Ar args ...
.Sh 解説
.Nm
ユーティリティは
.Xr ng_socket 4
ソケットタイプノードを作成し、これを
.Ar path
にあるノードのフック
.Ar hookname
へ接続します。
.Ar hookname
が省略されると、
.Dq Li debug
を指定したものとされます。
.Pp
.Fl e
オプションが指定されると、第 3 の引数はプログラムへのパスであると解釈され、
残りの引数を引数としてこのプログラムが実行されます。
このプログラムの実行前に
.Fl ( m
オプションで指定された) Netgraph メッセージがノードに送られます。
標準入力
.Fl ( n
オプションで閉じられない限り) と標準出力がフックに接続されて、
このプログラムが起動されます。
.Pp
.Fl e
オプションが指定されないと、
標準入力へ書き込まれる全データがこのノードに送られ、
このノードから受け取る全データが標準出力へ渡されます。
.Fl m
で指定されたメッセージは、ループに入る前に、ノードに送られます。
この場合、
.Nm
ユーティリティは、標準入力に
.Dv EOF
を検知すると終了します。
.Pp
オプションは次の通りです:
.Bl -tag -width indent
.It Fl a
各読み込みパケットを、生のバイナリではなく、人間が読める形式の
.Tn ASCII
で出力します。
.It Fl d
デバッグ用冗長レベルを増加します。
.It Fl e
第 3 の引数で指定されたプログラムを実行します。
.It Fl l
全受信データを標準出力へ書き込むだけではなく、フックへ戻します。
.It Fl m Ar msg
.Fl ( e
モードでの) プログラム実行前に、
指定された ASCII 制御メッセージをノードへ送ります。
本オプションは複数回指定可能です。
.It Fl n
標準入力からのデータ読み込みを試みません。
.Nm
ユーティリティは、シグナルによって停止させられるまで、
ノードからの読み込みを続けます。
.It Fl S
デフォルトの 1 の代りに 0 を、出力ファイル記述子として使用します。
.It Fl s
デフォルトの 0 の代りに 1 を、入力ファイル記述子として使用します。
.El
.Sh バグ
全入力はバッファリングしないモードで読み込みますが、
入力のパケット化を制御する方法はありません。
.Pp
ノードが
.Fl ( m
で指定された) メッセージに応答すると、その応答は失われます。
.Sh 関連項目
.Xr netgraph 3 ,
.Xr netgraph 4 ,
.Xr ngctl 8
.Sh 歴史
.Nm netgraph
システムのデザインと最初の実装は、Whistle Communications, Inc. で、
Whistle InterJet 向けにカスタマイズされた
.Fx 2.2
で行われました。
.Sh 作者
.An Archie Cobbs Aq archie@whistle.com
