freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nslookup.8
.\"
.\" ++Copyright++ 1985, 1989
.\" -
.\" Copyright (c) 1985, 1989
.\"    The Regents of the University of California.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" 	This product includes software developed by the University of
.\" 	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" -
.\" Portions Copyright (c) 1993 by Digital Equipment Corporation.
.\" 
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies, and that
.\" the name of Digital Equipment Corporation not be used in advertising or
.\" publicity pertaining to distribution of the document or software without
.\" specific, written prior permission.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS" AND DIGITAL EQUIPMENT CORP. DISCLAIMS ALL
.\" WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS.   IN NO EVENT SHALL DIGITAL EQUIPMENT
.\" CORPORATION BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\" -
.\" --Copyright--
.\"
.\"	@(#)nslookup.8	5.3 (Berkeley) 6/24/90
.\" jpman %Id: nslookup.8,v 1.2 1997/04/30 00:39:04 mutoh Stab %
.\"
.TH NSLOOKUP 8 "June 24, 1990"
.UC 6
.SH 名称
nslookup \- インターネットネームサーバに対話的に問い合わせる
.SH 書式
.B nslookup
[ 
.I \-option ...
]
[
.I host-to-find
| \- [
.I server
]] 
.SH 解説
.I nslookup
はインターネットネームサーバに問い合わせを行います。
.I nslookup
には対話モードと非対話モードの二つのモードがあります。
対話モードでは、
様々なホストやドメインの情報をネームサーバに対して問い合わせたり、
あるドメイン内のホスト一覧を表示することができます。
非対話モードでは、あるホストもしくはドメインの名前および
要求した情報のみが表示されます。
.sp 1
.SH 引数
次の場合は対話モードに入ります。
.IP a) 4
引数が与えられなかったとき(デフォルトのネームサーバを利用します)。
.IP b) 4
最初の引数がハイフン (\-) であり、二番目の引数がネームサーバの
ホスト名もしくは IP アドレスであるとき。
.LP
検索したいホストの名前もしくは IP アドレスが最初の引数として与えられた場合は、
非対話モードになります。
二番目の引数はオプションで、ネームサーバのホスト名もしくは IP アドレスを
指定します。
.LP
``set'' コマンドを使うオプションは、ホームディレクトリの .nslookuprc
ファイルに一行に一つずつ書くことでも指定できます。
オプションはコマンドラインで指定することも可能です。その場合、
前にハイフンをつけ、引数より先に書きます。たとえば、デフォルトの問い合わせを
ホスト情報に変更し、初期タイムアウトを 10 秒とするには、
.sp .5v
	nslookup \-query=hinfo  \-timeout=10
.sp .5v
とします。
.SH "対話 コマンド"
コマンドは control-C を入力することでいつでも中断できます。
終了するには、 control-D (EOF) もしくは exit を入力します。
コマンドラインの長さは 256 文字以下でなければなりません。
内部コマンドをホスト名として扱うには、
エスケープ文字 (\e) を頭につけます。
\fB注意:\fP 解釈できないコマンドはホスト名として扱われます。
.sp .5v
.IP "\fIhost\fP [\fIserver\fP]"
\fIhost\fP についての情報を現在のデフォルトサーバ、もしくは
\fIserver\fPが指定されている場合はそのサーバに問い合わせます。
\fIhost\fP が IP アドレスであり、問い合わせタイプが A もしくは PTR
であるときは、ホスト名が返されます。
\fIhost\fP が 名前であり、最後にピリオドがないときには、
その後ろにデフォルトのドメイン名が付加されます(この動作は、
\fBset\fP オプションの \fBdomain\fP, \fBsrchlist\fP,
\fBdefname\fP, \fBsearch\fP に依存します)。
現在のドメインにないホストについて調べるときには、
名前の末尾にピリオドを付加します。
.sp 1
.IP "\fBserver\fP \fIdomain\fP"
.ns
.IP "\fBlserver\fP \fIdomain\fP"
デフォルトサーバを \fIdomain\fP に変更します。
\fBlserver\fP は \fIdomain\fP に
ついての情報を探すのに初期サーバを使い、\fBserver\fPは
現在のデフォルトサーバを使います。
公式の答えが見つからないときには、答えを持つ可能性のある
サーバ名が返されます。
.sp 1
.IP \fBroot\fP
デフォルトサーバをドメイン名空間のルートサーバに変更します。
現在のところホスト ns.internic.net が使われます
(このコマンドは \fBlserver ns.internic.net\fP に同義です)。
ルートサーバ名は \fBset root\fP コマンドで変更できます。
.sp 1
.IP "\fBfinger\fP [\fIname\fP] [\fB>\fP \fIfilename\fP]"
.ns
.IP "\fBfinger\fP [\fIname\fP] [\fB>>\fP \fIfilename\fP]"
現在のホストにあるフィンガーサーバと接続します。
現在のホストは、以前の問い合わせが成功し、アドレス情報が
返されたときに定義されます(\fBset querytype=A\fP 参照)。
\fIname\fP はオプションです。
\fB>\fP と \fB>>\fP は普通に出力をリダイレクトするのに使えます。
.sp 1
.IP "\fBls\fR [\fIoption\fR] \fIdomain\fR [\fB>\fR \fIfilename\fR]"
.ns
.IP "\fBls\fR [\fIoption\fR] \fIdomain\fR [\fB>>\fR \fIfilename\fR]"
\fIdomain\fP について入手できる情報の一覧を出します。
オプションでファイル \fIfilename\fP を作成あるいは
\fIfilename\fP に追加できます。
デフォルトの出力にはホスト名とその IP アドレスが含まれます。
.I オプション
は下記のいずれかです。
.RS
.IP "\fB\-t \fIquerytype\fP" 4
指定したタイプの全レコードの一覧を出力します(下記の \fIquerytype\fP 参照)。
.IP \fB\-a\fP 4
そのドメイン内での、各ホストのエイリアス一覧を出力します。
\fB\-t\ \ CNAME\fP と同義です。
.IP \fB\-d\fP 4
そのドメインの全レコードの一覧を出力します。
\fB\-t\ \ ANY\fP と同義です。
.IP \fB\-h\fP 4
そのドメインの CPU 及び OS 情報を出力します。
\fB\-t\ \ HINFO\fP と同義です。
.IP \fB\-s\fP 4
そのドメイン内のホストの well-known サービスの一覧を出力します。
\fB\-t\ \ WKS\fP と同義です。
.P
出力がファイルにリダイレクトされるときには、サーバから 50 レコードを
受け取るたびに区切りが入れられます。
.RE
.sp 1
.IP "\fBview\fP \fIfilename\fP"
直前の \fBls\fP コマンドの出力を並べ変え、
\fImore\fP(1)
で出力します。
.sp 1
.ne 4
.IP "\fBhelp\fP"
.ns
.IP "\fB?\fP"
コマンドの簡単な要約を表示します。
.sp 1
.IP "\fBexit\fP"
プログラムを終了します。
.sp 1
.IP "\fBset\fP \fIkeyword\fP[=\fIvalue\fP]"
このコマンドは探索に影響するオプションを変更するのに使われます。
有効な keyword は以下の通りです。
.RS
.IP "\fBall\fP"
よく使われる \fBset\fP のオプションの現在の値を表示します。
現在のデフォルトサーバとホストに関する情報も表示されます。
.IP "\fBclass=\fIvalue\fR"
問い合わせのクラスを次のいずれかに変更します。
.RS
.IP IN 10
internet クラス。
.IP CHAOS 10
chaos クラス。
.IP HESIOD 10
MIT Athena Hesiod クラス。
.IP ANY 10
上記すべて。
.P
クラスは情報のプロトコルグループを特定します。
.br
(デフォルト = IN, 略記 = cl)
.RE
.IP "\fB[no]debug\fP"
デバッグモードにします。サーバに送られるパケットとそれに
対する返答について、より多くの情報が表示されます。
.br
(デフォルト = nodebug, 略記 = [no]deb)
.IP "\fB[no]d2\fP"
詳細なデバッグモードにします。
パケットごとに重要な全てのフィールドが表示されます。
.br
(デフォルト = nod2)
.IP "\fBdomain=\fIname\fR"
デフォルトドメイン名を \fIname\fP に変更します。
\fBdefname\fP , \fBsearch\fP オプションの設定に応じて、
探索要求されるホスト名にデフォルトドメイン名が付加されます。
デフォルトドメイン名が二つ以上の要素から
なるとき、ドメインサーチリストにはデフォルトドメインの親が含まれます。
たとえば、デフォルトドメイン名が
CC.Berkeley.EDU であるとき、サーチリストは
CC.Berkeley.EDU 及び Berkeley.EDU です。
異なるリストを指定するには、 \fBset srchlist\fP コマンドを使います。
このリストを表示するには、 \fBset all\fP コマンドを使います。
.br
(デフォルト = ホスト名から得た値, /etc/resolv.conf あるいは LOCALDOMAIN, 
略記 = do)
.IP "\fBsrchlist=\fIname1/name2/...\fR"
デフォルトドメイン名を \fIname1\fP にし、ドメインサーチリストを
\fIname1\fP, \fIname2\fP, ...に変更します。スラッシュ (/) で区切って
最大 6 つまで指定可能です。
たとえば
.sp .5v
 set\ srchlist=lcs.MIT.EDU/ai.MIT.EDU/MIT.EDU
.sp .5v
の場合、ドメインを lcs.MIT.EDU にし、サーチリストを上の 3 つの名前に
設定します。
このコマンドは、\fBset domain\fP コマンドによるデフォルトドメイン名と
サーチリストを上書きします。
リストを表示するには、 \fBset all\fP コマンドを使います。
.br
(デフォルト = ホスト名に基づく値, /etc/resolv.conf あるいは LOCALDOMAIN, 
略記 = srchl)
.IP "\fB[no]defname\fP"
これが設定されると、単一要素からなる問い合わせ(すなわちピリオドのないもの)
に対して、
指定したデフォルトドメイン名が付加されます。
.br
(デフォルト = defname, 略記 = [no]def)
.IP "\fB[no]search\fP"
問い合わせ要求にピリオドが少なくとも一つ含まれているが
ピリオドで終ってはいない場合、
答えが受け取れるまで、ドメインサーチリスト内のドメイン名を
付加します。
.br
(デフォルト = search, 略記 = [no]sea)
.IP "\fBport=\fIvalue\fR"
デフォルトのネームサーバの TCP/UDP ポートを \fIvalue\fP に変更します。
.br
(デフォルト = 53, 略記 = po)
.IP "\fBquerytype=\fIvalue\fR"
.ns
.IP "\fBtype=\fIvalue\fR"
.ns
問い合わせる情報の種類を変更します。情報は次のうちのいずれかです。
.RS
.IP A 10
ホストの IP アドレス。
.IP CNAME  10
別名に対する正式名。
.IP HINFO 10
ホストの CPU と OS の種類。
.IP MINFO 10
メールボックスもしくは、メールリストに関する情報。
.IP MX 10
メール交換ホスト。
.IP NS 10
その名前空間内のネームサーバ。
.IP PTR 10
問い合わせが IP アドレスであればホスト名、そうでなければ
それ以外の情報へのポインタ。
.IP SOA 10
ドメインの ``start-of-authority'' 情報。
.IP TXT 10
テキスト情報。
.IP UINFO 10
ユーザ情報。
.IP WKS 10
サポートする well-known サービス。
.P
他のタイプ (ANY, AXFR, MB, MD, MF, NULL) については、ドキュメント
RFC-1035 に書かれています。
.br
(デフォルト = A, 略記 = q, ty)
.RE
.IP "\fB[no]recurse\fP"
サーバが情報を持っていないときに、他のサーバに問い合わせるよう
指示します。
.br
(デフォルト = recurse, 略記 = [no]rec)
.IP \fBretry=\fInumber\fR
リトライ回数を \fInumber\fP 回とします。
要求に対する返答をある時間内 (\fBset timeout\fP で変更できる) に
受け取らなかったとき、タイムアウト期間は 2 倍にされ、
要求が再送されます。
retry の値は、あきらめるまでに要求を何回再送するかを決めます。
.br
(デフォルト = 4, 略記 = ret)
.IP \fBroot=\fIhost\fR
ルートネームサーバ名を \fIhost\fP に変更します。
これは \fBroot\fP コマンドに影響します。
.br
(デフォルト = ns.internic.net., 略記 = ro)
.IP \fBtimeout=\fInumber\fR
返答を待つ初期タイムアウト間隔を \fInumber\fP 秒に変更します。
リトライのたびにタイムアウト間隔は倍になります。
.br
(デフォルト = 5 seconds, 略記 = ti)
.IP "\fB[no]vc\fP"
サーバに 要求を出すときに常に 仮想回路
(virtual circuit) を使います。
.br
(デフォルト = novc, 略記 = [no]v)
.IP "\fB[no]ignoretc\fP"
パケットトランケーションエラーを無視します。
.br
(デフォルト = noignoretc, 略記 = [no]ig)
.RE
.SH 診断
問い合わせが失敗した場合、エラーメッセージが表示されます。
エラーには次のようなものがあります。
.IP "Timed out" 5
サーバに対する要求を、(\fBset timeout=\fIvalue\fR で変更できる)ある時間
の間に(\fBset retry=\fIvalue\fR で変更できる)ある回数だけ
リトライしましたが、応答しませんでした。
.IP "No response from server" 5
サーバマシンでネームサーバが動いていません。
.IP "No records" 5
ホスト名は正しいのですが、そのホストについて現在の問い合わせに
関する情報をサーバが持っていません。
問い合わせる情報は \fBset querytype\fP コマンドで指定できます。
.IP "Non-existent domain" 5
そのホスト名もしくはドメイン名が存在しません。
.IP "Connection refused" 5
.ns
.IP "Network is unreachable" 5
現在のところネームサーバもしくはフィンガーサーバに対して
接続できません。
このエラーは一般に \fBls\fP \fBfinger\fP 要求に対して起こります。
.IP "Server failure" 5
ネームサーバが内部でデータベースの矛盾を発見したため
正しい答えが返せませんでした。
.IP "Refused" 5
ネームサーバが要求に対するサービスを拒否しました。
.IP "Format error" 5
ネームサーバは要求パケットが適切なフォーマットになっていないと
判断しました。
\fInslookup\fP 内にエラーがあるのかもしれません。
.sp 1
.SH 関連ファイル
.ta \w'/usr/share/misc/nslookup.helpXXX'u
/etc/resolv.conf	ドメイン名の初期値とネームサーバのアドレスを記述するファイルです。
.br
$HOME/.nslookuprc	ユーザ用の初期化オプションを記述するファイルです。
.br
/usr/share/misc/nslookup.help	コマンドの要約です。
.SH 環境変数
.ta \w'HOSTALIASESXXXX'u
HOSTALIASES	ホスト名のエイリアスを記述したファイル。
.br
LOCALDOMAIN	デフォルトドメインを上書きします。
.SH 関連項目
resolver(3), resolver(5), named(8), 
.br
RFC-1034  ``Domain Names \- Concepts and Facilities''
.br
RFC-1035  ``Domain Names \- Implementation and Specification''
.SH 作者
Andrew Cherenson
