freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nslookup.8
.\"
.\" ++Copyright++ 1985, 1989
.\" -
.\" Copyright (c) 1985, 1989
.\"    The Regents of the University of California.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" 	This product includes software developed by the University of
.\" 	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" -
.\" Portions Copyright (c) 1993 by Digital Equipment Corporation.
.\" 
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies, and that
.\" the name of Digital Equipment Corporation not be used in advertising or
.\" publicity pertaining to distribution of the document or software without
.\" specific, written prior permission.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS IS" AND DIGITAL EQUIPMENT CORP. DISCLAIMS ALL
.\" WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS.   IN NO EVENT SHALL DIGITAL EQUIPMENT
.\" CORPORATION BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\" PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\" ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\" -
.\" --Copyright--
.\"
.\"	@(#)nslookup.8	5.3 (Berkeley) 6/24/90
.\" %FreeBSD: src/contrib/bind/doc/man/nslookup.8,v 1.2.2.1 2000/11/02 14:08:07 asmodai Exp %
.\"
.\" $FreeBSD$
.Dd June 24, 1990
.Dt NSLOOKUP 8
.Os BSD 4
.Sh 名称
.Nm nslookup
.Nd インターネットネームサーバに対話的に問い合わせる
.Sh 書式
.Nm nslookup
.Op Fl option Ar ...
.Op Ar host-to-find | Fl Op Ar server
.Sh 解説
.Ic nslookup
はインターネットネームサーバに問い合わせを行います。
.Ic nslookup
には対話モードと非対話モードの 2 つのモードがあります。
対話モードでは、
様々なホストやドメインの情報をネームサーバに対して問い合わせたり、
あるドメイン内のホスト一覧を表示することができます。
非対話モードでは、あるホストもしくはドメインの名前および
要求した情報のみが表示されます。
.Sh 引数
次の場合は対話モードに入ります。
.Bl -tag -width "a)  " 
.It a)
引数が与えられなかったとき(デフォルトのネームサーバを利用します)。
.It b)
最初の引数がハイフン (-) であり、2 番目の引数がネームサーバの
ホスト名もしくは IP アドレスであるとき。
.El
.Pp
検索したいホストの名前もしくは IP アドレスが最初の引数として与えられた場合は、
非対話モードになります。
2 番目の引数はオプションで、ネームサーバのホスト名もしくは IP アドレスを
指定します。
.Pp
.Dq Li set 
コマンドを使うオプションは、ホームディレクトリの
.Pa .nslookuprc 
ファイルに 1 行に 1 つずつ書くことでも指定できます。
オプションはコマンドラインで指定することも可能です。その場合、
前にハイフンをつけ、引数より先に書きます。たとえば、デフォルトの問い合わせを
ホスト情報に変更し、初期タイムアウトを 10 秒とするには、
.Bd -literal -offset indent
	nslookup -query=hinfo  -timeout=10
.Ed
とします。
.Sh 対話コマンド
コマンドは control-C を入力することでいつでも中断できます。
終了するには、 control-D 
.Pq Dv EOF 
もしくは 
.Li exit 
を入力します。
コマンドラインの長さは 256 文字以下でなければなりません。
内部コマンドをホスト名として扱うには、
エスケープ文字 
.Pq \e
を頭につけます。
.Sy 注意:
解釈できないコマンドはホスト名として扱われます。
.Bl -tag -width "lserver"
.It Ar host Op Ar server
.Ar host
についての情報を現在のデフォルトサーバ、もしくは
.Ar server
が指定されている場合はそのサーバに問い合わせます。
.Ar host 
が IP アドレスであり、問い合わせタイプが 
.Dv A 
もしくは
.Dv PTR
であるときは、ホスト名が返されます。
.Ar host が 名前であり、最後にピリオドがないときには、
その後ろにデフォルトのドメイン名が付加されます(この動作は、
.Ic set 
オプションの 
.Ic domain , srchlist , defname , search
に依存します)。
.Pp
現在のドメインにないホストについて調べるときには、
名前の末尾にピリオドを付加します。
.It Ic server Ar domain
.It Ic lserver Ar domain
デフォルトサーバを 
.Ar domain
に変更します。
.Ic lserver
は
.Ar domain
についての情報を探すのに初期サーバを使い、
.Ic server
は現在のデフォルトサーバを使います。
公式の答えが見つからないときには、答えを持つ可能性のある
サーバ名が返されます。
.It Ic root
デフォルトサーバをドメイン名空間のルートサーバに変更します。
現在のところホスト
.Li ns.internic.net
が使われます
(このコマンドは 
.Dq Ic lserver ns.internic.net
に同義です)。
ルートサーバ名は 
.Dq Ic set root
コマンドで変更できます。
.It Xo Ic finger Op Ar name 
.Op Ic > Ar filename
.Xc
.It Xo Ic finger Op Ar name 
.Op Ic >> Ar filename
.Xc
現在のホストにあるフィンガーサーバと接続します。
現在のホストは、以前の問い合わせが成功し、アドレス情報が
返されたときに定義されます(
.Dq Ic set querytype=A
参照)。
.Ar name はオプションです。
.Ic > 
と
.Ic >>
は普通に出力をリダイレクトするのに使えます。
.It Xo Ic ls Op Ar option 
.Ar domain Op Ic > Ar filename
.Xc
.It Xo Ic ls Op Ar option 
.Ar domain Op Ic >> Ar filename
.Xc
.Ar domain
について入手できる情報の一覧を出します。
オプションでファイル 
.Ar filename
を作成あるいは
.Ar filename 
に追加できます。
デフォルトの出力にはホスト名とその IP アドレスが含まれます。
.Ar option
は下記のいずれかです。
.RS
.Bl -tag -width "-a "
.It Fl t Ar querytype
指定したタイプの全レコードの一覧を出力します(下記の 
.Ar querytype 
参照)。
.It Fl a
そのドメイン内での、各ホストのエイリアス一覧を出力します。
.Dq Fl t Dv CNAME 
と同義です。
.It Fl d
そのドメインの全レコードの一覧を出力します。
.Dq Fl t Dv ANY 
と同義です。
.It Fl h
そのドメインの CPU 及び OS 情報を出力します。
.Dq Fl t Dv HINFO 
と同義です。
.It Fl s
そのドメイン内のホストの良く知られた (well-known) サービスの一覧を出力します。
.Dq Fl t Dv WKS 
と同義です。
.El
.Pp
出力がファイルにリダイレクトされるときには、サーバから 50 レコードを
受け取るたびにハッシュマークが表示されます。
.It Ic view Ar filename
直前の
.Ic ls
コマンドの出力を並べ変え、
.Xr more 1
で出力します。
.It Ic help
.It Ic ?
コマンドの簡単な要約を表示します。
.It Ic exit
プログラムを終了します。
.It Xo Ic set Ar keyword 
.Ns Op = Ns Ar value
.Xc
このコマンドは探索に影響するオプションを変更するのに使われます。
有効な keyword は以下の通りです。
.Bl -tag -width "class=v"
.It Ic all
よく使われる
.Ic set
のオプションの現在の値を表示します。
現在のデフォルトサーバとホストに関する情報も表示されます。
.It Ic class= Ns Ar value
問い合わせのクラスを次のいずれかに変更します。
.Bl -tag -width "HESIOD  "
.It Dv IN
インターネットクラス。
.It Dv CHAOS
chaos クラス。
.It Dv HESIOD
MIT Athena Hesiod クラス。
.It Dv ANY
上記すべて。
.El
.Pp
クラスは情報のプロトコルグループを特定します。
.Pp
(デフォルト = 
.Dv IN;
略記 = 
.Ic cl )
.It Xo Op Ic no
.Ns Ic debug
.Xc
デバッグモードにします。サーバに送られるパケットとそれに
対する返答について、より多くの情報が表示されます。
.Pp
(デフォルト = 
.Ic nodebug ;
略記 =
.Xo Op Ic no
.Ns Ic deb )
.Xc
.It Xo Op Ic no
.Ns Ic d2
.Xc
詳細なデバッグモードにします。
パケットごとに重要なすべてのフィールドが表示されます。
.Pp
(デフォルト = 
.Ic nod2 )
.It Ic domain= Ns Ar name
デフォルトドメイン名を 
.Ar name に変更します。
.Ic defname
と
.Ic search
オプションの設定に応じて、
探索要求されるホスト名にデフォルトドメイン名が付加されます。
デフォルトドメイン名が 2 つ以上の要素から
なるとき、ドメインサーチリストにはデフォルトドメインの親が含まれます。
たとえば、デフォルトドメイン名が
CC.Berkeley.EDU であるとき、サーチリストは
CC.Berkeley.EDU 及び Berkeley.EDU です。
異なるリストを指定するには、 
.Dq Ic set srchlist
コマンドを使います。
このリストを表示するには、
.Dq Ic set all
コマンドを使います。
.Pp
(デフォルト = 
.Xr hostname 1
から得た値, 
.Pa /etc/resolv.conf
あるいは
.Pa LOCALDOMAIN;
略記 = 
.Ic do )
.It Ic srchlist= Ns Ar name1/name2/...
デフォルトドメイン名を 
.Ar name1 
にし、ドメインサーチリストを
.Ar name1 , name2  , etc.
に変更します。スラッシュ (/) で区切って
最大 6 つまで指定可能です。
たとえば
.Bd -literal -offset indent
set srchlist=lcs.MIT.EDU/ai.MIT.EDU/MIT.EDU
.Ed
.Pp
の場合、ドメインを lcs.MIT.EDU にし、サーチリストを上の 3 つの名前に
設定します。
このコマンドは、
.Dq Ic set domain 
コマンドによるデフォルトドメイン名と
サーチリストを上書きします。
リストを表示するには、 
.Dq Ic set all
コマンドを使います。
.Pp
(デフォルト = 
.Xr hostname 1 
に基づく値, 
.Pa /etc/resolv.conf
あるいは
.Ev LOCALDOMAIN ; 
略記 = 
.Ic srchl )
.It Xo Op Ic no
.Ns Ic defname
.Xc
これが設定されると、単一要素からなる問い合わせ(すなわちピリオドのないもの)
に対して、
指定したデフォルトドメイン名が付加されます。
.Pp
(デフォルト = 
.Ic defname ;
略記 = 
.Xo Op Ic no
.Ns Ic defname )
.Xc
.It Xo Op Ic no 
.Ns Ic search
.Xc
問い合わせ要求にピリオドが少なくとも 1 つ含まれているが
ピリオドで終っては
.Em いない
場合、
答えが受け取れるまで、ドメインサーチリスト内のドメイン名を
付加します。
.Pp
(デフォルト = 
.Ic search ;
略記 = 
.Xo Op Ic no 
.Ns Ic sea )
.Xc
.It Ic port= Ns Ar value
デフォルトのネームサーバの TCP/UDP ポートを 
.Ar value
に変更します。
.Pp
(デフォルト = 53; 
略記 = 
.Ic \&po )
.It Ic querytype= Ns Ar value
.It Ic type= Ns Ar value
問い合わせる情報の種類を変更します。情報は次のうちのいずれかです。
.Bl -tag -width "HINFO   "
.It Dv A
ホストの IP アドレス。
.It Dv CNAME
別名に対する正式名。
.It Dv HINFO
ホストの CPU と OS の種類。
.It Dv MINFO
メールボックスもしくは、メールリストに関する情報。
.It Dv MX
メール交換ホスト。
.It Dv NS
その名前空間内のネームサーバ。
.It Dv PTR
問い合わせが IP アドレスであればホスト名、そうでなければ
それ以外の情報へのポインタ。
.It Dv SOA
ドメインの 
.Dq 権威開始 (start-of-authority)
情報。
.It Dv TXT
テキスト情報。
.It Dv UINFO
ユーザ情報。
.It Dv WKS
サポートする、よく知られたサービス。
.El
.Pp
他のタイプ
.Pq Dv ANY, AXFR, MB, MD, MF, NULL
については、ドキュメント
RFC-1035 に書かれています。
.Pp
(デフォルト = 
.Dv A ;
略記 = 
.Ic q, ty )
.It Xo Op Ic no
.Ns Ic recurse
.Xc
サーバが情報を持っていないときに、他のサーバに問い合わせるよう
指示します。
.Pp
(デフォルト = 
.Ic recurse ;
略記 = 
.Xo Op Ic no
.Ns Ic rec )
.Xc
.It Ic retry= Ns Ar number
リトライ回数を 
.Ar number
回とします。
要求に対する返答をある時間内 (
.Dq Ic  set timeout
で変更できる) に
受け取らなかったとき、タイムアウト期間は 2 倍にされ、
要求が再送されます。
retry の値は、あきらめるまでに要求を何回再送するかを決めます。
.Pp
(デフォルト = 4, 略記 = 
.Ic ret )
.It Ic root= Ns Ar host
ルートネームサーバ名を 
.Ar host
に変更します。
これは
.Dq Ic root
コマンドに影響します。
.Pp
(デフォルト = 
.Ic ns.internic.net ;
略記 = 
.Ic ro )
.It Ic timeout= Ns Ar number
返答を待つ初期タイムアウト間隔を
.Ar number
秒に変更します。
リトライのたびにタイムアウト間隔は倍になります。
.Pp
(デフォルト = 5 seconds; 略記 = 
.Ic ti )
.It Xo Op Ic no
.Ns Ic vc
.Xc
サーバに要求を出すときに、常に仮想回路
(virtual circuit) を使います。
.Pp
(デフォルト = 
.Ic novc ;
略記 = 
.Xo Op Ic no
.Ns Ic v )
.Xc
.It Xo Op Ic no
.Ns Ic ignoretc
.Xc 
パケットトランケーションエラーを無視します。
.Pp
(デフォルト = 
.Ic noignoretc ;
略記 =
.Xo Op Ic no
.Ns Ic ig )
.Xc 
.El
.El
.Sh 診断
問い合わせが失敗した場合、エラーメッセージが表示されます。
エラーには次のようなものがあります。
.Bl -tag -width "Timed"
.It Li Timed out
サーバに対する要求を、(
.Dq Ic set timeout= Ns Ar value
で変更できる)ある時間
の間に(
.Dq Ic set retry= Ns Ar value
で変更できる)ある回数だけ
リトライしましたが、応答しませんでした。
.It Li \&No response from server
サーバマシンでネームサーバが動いていません。
.It Li \&No records
ホスト名は正しいのですが、そのホストについて現在の問い合わせに
関する情報をサーバが持っていません。
問い合わせる情報は 
.Dq Ic set querytype
コマンドで指定できます。
.It Li Non-existent domain
そのホスト名もしくはドメイン名が存在しません。
.It Li Connection refused
.It Li Network is unreachable
現在のところネームサーバもしくはフィンガーサーバに対して
接続できません。
このエラーは一般に 
.Ic ls
と
.Ic finger
要求に対して起こります。
.It Li Server failure
ネームサーバが内部でデータベースの矛盾を発見したため
正しい答えが返せませんでした。
.It Li Refused
ネームサーバが要求に対するサービスを拒否しました。
.It Li Format error
ネームサーバは要求パケットが適切なフォーマットになっていないと
判断しました。
.Nm nslookup
内にエラーがあるのかもしれません。
.El
.Sh 関連ファイル
.Bl -tag -width "/usr/share/misc/nslookup.helpXXX" -compact
.It Pa /etc/resolv.conf
ドメイン名の初期値とネームサーバのアドレスを記述するファイルです。
.It Pa $HOME/.nslookuprc
ユーザ用の初期化オプションを記述するファイルです。
.It Pa /usr/share/misc/nslookup.help
コマンドの要約です。
.El
.Sh 環境変数
.Bl -tag -width "HOSTALIASESXXXX" -compact
.It Ev HOSTALIASES
ホスト名のエイリアスを記述したファイル。
.It Ev LOCALDOMAIN
デフォルトドメインを上書きします。
.Sh 関連項目
.Xr named 8 ,
.Xr resolver 3 , 
.Xr resolver 5 ;
RFC-1034,
.Dq Domain Names - Concepts and Facilities ;
RFC-1035,
.Dq Domain Names - Implementation and Specification
.Sh 作者
Andrew Cherenson
