freebsd/freebsd-doc/ja_JP.eucJP/man/man8/nsupdate.8
.\" %Id: nsupdate.8,v 8.4 1999/10/17 06:26:18 cyarnell Exp %
.\" jpman %Id: nsupdate.8,v 1.3 2000/05/02 03:35:10 horikawa Stab %
.\"
.\"Copyright (c) 1999 by Internet Software Consortium
.\"
.\"Permission to use, copy, modify, and distribute this software for any
.\"purpose with or without fee is hereby granted, provided that the above
.\"copyright notice and this permission notice appear in all copies.
.\"
.\"THE SOFTWARE IS PROVIDED "AS IS" AND INTERNET SOFTWARE CONSORTIUM DISCLAIMS
.\"ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES
.\"OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL INTERNET SOFTWARE
.\"CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL
.\"DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
.\"PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS
.\"ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\"SOFTWARE.
.Dd March 5, 1999
.Dt NSUPDATE 8 
.Os BSD 4
.Sh 名称
.Nm nsupdate 
.Nd 対話的に Internet ネームサーバを更新する
.Sh 書式
.Nm nsupdate
.Op Fl Ar k  keydir:keyname 
.Op Fl Ar d
.Op Fl Ar v
.Op Ar filename
.Sh 解説
.Ic nsupdate
は動的な更新をサポートした Internet ドメインネームサーバを更新する
ためのプログラムです。
.Ic nsupdate
は DNS のリソースレコード (RR) を追加したり削除したりする
メッセージを DNS サーバ
に伝えるために、DNS リゾルバライブラリを使用します。
.Ic nsupdate
は入力を
.Ar filename
もしくは、標準入力から読み取ります。
.Sh 引数
.Bl -tag -width Fl
.It Fl k
TSIG を用いて更新に署名します。
.It Fl d
デバッグモードを指定します。
.It Fl v
バーチャルサーキット - サーバとの通信に TCP を使用します。既定値では UDP を
使用します。
.Sh 入力書式
.Ic nsupdate
は 1 行ごとに 1 個の入力レコードを読みます。
それぞれの行は更新要求の対象になるリソースレコードです。
1 個の更新要求に含まれるすべてのドメイン名は、
同一の DNS ゾーンに含まれるものであることが必要です。
空行は、蓄積されたレコードを 1 個の更新要求としてまとめ、ゾーンの権威を
もつネームサーバへの送信を指示します。
追加レコードを続けることが可能です。
これらは、追加的な、完全に独立した更新要求になります。
最後の要求が送信されるためには、空行が入力の最後にあることが必要です。
.Pp
レコードはふたつの一般的な形式のうちのどちらかの形式です。
.Em 必要条件 (prerequisite)
レコードは、要求が処理される前に満たされていることが必要な条件を指示します。
.Em 更新情報 (update)
レコードは、DNS データベースになされる変更を指示します。
更新要求は、0 個以上の必要条件と、1 個以上の更新情報から成ります。
それぞれの更新要求は、すべての必要条件が満たされることが確認
されたあとで、すべての更新が実行されるという順番で、原子的に処理されます。
.Pp
.Ic nsupdate
は次のような入力レコードの書式を理解します。
.Pp

.Bl -ohang

.It Ic prereq nxdomain Va domain-name
.Va domain-name 
で指定したドメイン内に、どのような RR もないことを要求します。

.It Ic prereq yxdomain Va domain-name
.Va domain-name
で指定したドメイン内に、最低 1 個の RR が存在することを要求します。

.It Xo
.Ic prereq nxrrset Va domain-name Op class
.Va type
.Xc
.Va domain-name 
で指定したドメイン内に
.Va type
で指定した型の RR が存在しないことを要求します。

.It Xo
.Ic prereq yxrrset
.Va domain-name Op class
.Va type Op data...
.Xc
.Va domain-name 
で指定したドメイン内に、
.Va type
で指定した型の RR が存在することを要求します。
.Va data
が指定された場合は、正確にチェックが行なわれます。

.It Xo
.Ic update delete
.Va domain-name Op class
.Va Op type Op data...
.Xc
.Va domain-name 
で指定したドメイン名の RR を削除します。
もし
.Va type
(と、可能ならば
.Va data )
が指定されれば、該当されるレコードだけが削除されます。

.It Xo
.Ic update add
.Va domain-name ttl Op class
.Va type data...
.Xc
.Va ttl , type , data
で指定した RR を追加します。

.El

.Sh 使用例
下記の例は、
.Ic nsupdate
の対話的な使用例を示しています。
あるドメイン名のすべての A レコードを削除して、新しいレコードを
追加することによって、IP アドレスを変更します。
ここでは必要条件が指定されていないので、削除するレコードがなくても新しい
レコードが追加されます。
後に続く空行は要求を処理させるために必要であることに注意してください。
.Bd -literal -offset indent
$ nsupdate
> update delete test.example.com A
> update add test.example.com 3600 A 10.1.1.1
>

.Ed
.Pp
この例では、対象のドメインに A レコードまたは CNAME レコードがない場合に、
CNAME エイリアスがデータベースに追加されます。
.Bd -literal -offset indent
$ nsupdate
> prereq nxrrset www.example.com A
> prereq nxrrset www.example.com CNAME
> update add www.example.com 3600 CNAME test.example.com
>

.Ed
.Pp
この例では、nsupdate はディレクトリ "/var/named/keys" に存在するキー 
"mykey" で署名されます。
.Bd -literal -offset indent
$ nsupdate -k /var/named/keys:mykey
> update add ftp.example.com 60 A 192.168.5.1
>

.Ed

.Sh 診断
.Bl -ohang

.It Qq send error
一般に、権威のあるネームサーバに到達できなかったことを示します。

.It Qq failed update packet
一般に、ネームサーバが動的更新をサポートしていないためか、認証の失敗のために、
更新を拒否したことを示します。

.It Qq res_mkupdate: packet size = Va size
(また他のメッセージが表示されないとき)
更新は正常に受信されてネームサーバに認証されました。
しかし必要条件が更新を妨げたかもしれません。更新が行なわれているか
を確かめる方法は、デバッグモード
.Fl ( d )
を使用して、ネームサーバからの応答フィールドを確認するしかありません。

.Sh 関連ファイル
.It Pa /etc/resolv.conf
ドメイン名とネームサーバのアドレスの初期設定。
.Sh 関連項目
.Xr named 8 ,
.Xr resolver 3 , 
.Xr resolver 5 ;
RFC-1034,
.Dq Domain Names - Concepts and Facilities ;
RFC-1035,
.Dq Domain Names - Implementation and Specification ;
RFC-2136,
Dynamic Updates in the Domain Name System.
.Sh 作者
Brent Baccala
