freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ntpd.8
.\"
.\" %FreeBSD: src/usr.sbin/ntp/doc/ntpd.8,v 1.4.2.1 2000/06/22 08:47:34 sheldonh Exp %
.\"
.Dd January 10, 2000
.\" jpman %Id: ntpd.8,v 1.4 2000/06/02 11:03:54 takamune Stab %
.\" WORD: key file		鍵ファイル
.\" WORD: key number		鍵番号
.\" WORD: symmetric active	対称的アクティブ
.\" WORD: symmetric passive	対称的パッシブ
.Dt NTPD 8
.Os
.Sh 名称
.Nm ntpd
.Nd Network Time Protocol (NTP) デーモン
.Sh 書式
.Nm ntpd
.Op Fl aAbdgmx
.Op Fl c Ar conffile
.Op Fl f Ar driftfile
.Op Fl k Ar keyfile
.Op Fl l Ar logfile
.Op Fl p Ar pidfile
.Op Fl r Ar broadcastdelay
.Op Fl s Ar statsdir
.Op Fl t Ar trustedkey
.Op Fl v Ar variable
.Op Fl V Ar variable
.Sh 解説
.Nm
は、インターネットの標準時間サーバと同期をとって、システム時刻
(time-of-day) を設定し維持するオペレーティングシステムデーモンです。
.Nm
は、Network Time Protocol (NTP) バージョン
4 の完全な実装となっていますが、RFC 1305 で定義されているバージョン 3
に対する互換性も保っています。加えて、
各々 RFC 1059 と RFC 1119 で定義
されているバージョン 1 とバージョン 2 に対する互換性も保っています。
.Nm
は多くの計算を 64-bit 浮動小数点演算で行ない、約 232 ピコ秒の
絶対的な精度を保つ必要があるときだけ、比較的扱いにくい
64-bit 固定小数点操作を行ないます。
現在の普通のワークステーションやネットワークでは絶対的な精度は
達成できませんが、この精度は将来のナノ秒 CPU クロックやギガビット LAN
において必要となるでしょう。
.Pp
デーモンは対称的アクティブ/パッシブ、クライアント/サーバ、
ブロードキャスト/マルチキャスト、メニーキャストを含む
いくつかのモードのうちのいずれかで働くことができます。
ブロードキャスト/マルチキャスト、もしくはメニーキャストクライアントは、
リモートサーバを探し出し、サーバ-クライアント間の伝播遅延補正因子を計算して、
自動的
に自身に対する設定を行います。これにより、ローカルな環境に固有の詳細な設定
なしに、一群のワークステーションを
配置することが可能になります。
.Pp
通常、
.Nm
は、起動時に設定ファイル
.Xr ntp.conf 5
から同期ソースや動作モードを決めるために読込みます。
また、機能が限定されますが、コマンドラインから全ての動作を指定することにより、
設定ファイルを使わずに実行することもできます。
これは、
ローカルホスト
が、実行時にブロードキャストを待受ける (listen) ことで決定される全て
の通信相手 (peer) に対してブロードキャスト/マルチキャストクライアントまたは
メニーキャストクライアントとして設定される時には、特に適しています。
.Pp
.Nm
は
NetInfo サポートが組み込まれていて、
デフォルトの設定ファイルが読み込めず、また
.Fl c
オプションによるファイルの指定もされていない場合には、
設定を NetInfo より読み込もうとします。
.Pp
.Nm
デーモンの実行中は、
.Xr ntpq 8
および
.Xr ntpdc 8
プログラムを使用することで、デーモンのさまざまな内部変数を表示したり、
設定オプションを変更できます。
.Pp
.Nm
は起動時に
.Xr umask 2
の値を調べ、もしそれが 0 ならば、
022 に設定します。
.Pp
以下にあげるコマンドライン引数が使用可能です:
.Bl -tag -width indent
.It Fl a
認証モードを有効にします (デフォルト)。
.It Fl A
認証モード無効にします。
.It Fl b
NTP のブロードキャストメッセージを使って同期します。
.It Fl c Ar conffile
設定ファイルの名前とパスを指定します。
.It Fl d
デバッグモードを指定します。このフラグは何回指定してもかまいませんが、
回数が多いほど表示がより詳細になります。
.It Fl D Ar level
デバッグレベルを直接指定します。
.It Fl f Ar driftfile
ドリフトファイルの名前とパスを指定します。
.It Fl g
通常、デーモンはオフセットが
1000 秒の正気限界 (sanity limit) を越えている場合は終了します。
このオプションはこの制限を無視し、
どの時刻にも制限なく設定できるようにします。
しかしこれは一度のみ起り得ます。
この後は、制限を超過すると、デーモンは終了します。
.It Fl k Ar keyfile
NTP の認証鍵を含むファイルの名前とパスを指定します。
.It Fl l Ar logfile
ログファイルの名前とパスを指定します。
デフォルトはシステムログ機能です。
.It Fl m
224.0.1.1 の IP マルチキャストグループアドレス上の
NTP マルチキャストメッセージを利用して同期します
(マルチキャストカーネルが必要になります)。
.It Fl p Ar pidfile
デーモンのプロセス ID を記録するためのファイル名とパスを指定します。
.It Fl P
オペレーティングシステムによって設定される優先度制限を無視します。
意気地なしには推奨されません。
.It Fl r Ar broadcastdelay
ブロードキャスト/マルチキャストサーバとこのコンピュータ間の
デフォルト伝播遅延を指定します。
このオプションはプロトコルによって自動的に遅延を計算できない場合にのみ
必要となります。
.It Fl s Ar statsdir
統計機能によって作成されるファイルのディレクトリパスを指定します。
.It Fl t Ar key
鍵番号を信頼できる鍵 (trusted key) のリストに付け加えます。
.It Fl v Ar variable
.It Fl V Ar variable
デフォルトでリストされるシステム変数を追加します。
.It Fl x
通常、時刻を 128 ms よりも多く調節する場合は、
徐々に微調整するのではなく、単に合わせます。
このオプションは全ての場合において微調整するように強制します。
注意: 微調整の速度は 0.5 ms/s までに
制限されていますので、1 秒調節するのに 2000 秒の
償却期間が必要です。
このため、たくさんの秒数を調節するには、
償却に数時間や数日を要することもあります。
.El
.Ss 変数
NTP
プロトコルにより用いられるたいていの変数は、
.Xr ntpdc 8
(モード 7 メッセージ) と
.Xr ntpq 8
(モード 6 メッセージ) で、調べることができます。
現在は、ごくわずかの変数がモード 6 メッセージを通して変更可能です。
これらの変数は、
.Ic setvar
ディレクティブ
(
.Xr ntp.conf 5
マニュアルページの
.Qq その他のオプション
節で記述されています)
で作られた変数か、リープ警告 (leap warning) ビットのどちらかです。
リープ警告ビットは、
.Va leapwarning
変数で 1 ヶ月先までセットできます。
.Va leapwarning
と
.Va leapindication
変数の両方が通常のリープビットの解釈と少し違ったエンコーディングになっています:
.Bl -tag -width indent
.It 00
デーモンは同期源のリープビットを渡します (通常モードの動作)。
.It 01
.It 10
うるう秒 (leap second) が付加/削除されます (オペレータによるうるう秒の強制)。
.It 11
同期源からのリープ情報は無視されます (それゆえ
.Dv LEAP_NOWARNING
が与えられます)。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/ntp.drift -compact
.It Pa /etc/ntp.conf
デフォルトの設定ファイル名
.It Pa /etc/ntp.drift
デフォルトのドリフトファイル名
.It Pa /etc/ntp.keys
デフォルトの鍵ファイル名
.El
.Sh 関連項目
.Xr ntp.conf 5 ,
.Xr ntpdate 8 ,
.Xr ntpdc 8 ,
.Xr ntpq 8
.Pp
提供されているマニュアルページに加えて、
包括的なドキュメントが world wide web 上の
.Li http://www.ntp.org/
にあります。
このドキュメントのスナップショットが HTML 形式で
.Pa /usr/share/doc/ntp
にあります。
.Rs
.%A David L. Mills
.%T Network Time Protocol (Version 1)
.%O RFC1059
.Re
.Rs
.%A David L. Mills
.%T Network Time Protocol (Version 2)
.%O RFC1119
.Re
.Rs
.%A David L. Mills
.%T Network Time Protocol (Version 3)
.%O RFC1305
.Re
.Sh 歴史
コマンドは
Toronto 大学の
.An Dennis Ferguson
によって書かれました。
本文は Delaware 大学の
.An David Mills
により修正されました。
.Sh バグ
.Nm
はかなり大きくなってしまいました。巨大とは言いませんが、
ワークステーションで実行される高優先度のデーモンとして
望ましい大きさを超えてしまいました。
特に、高い階層 (stratum) のワークステーションよりは、
高負荷のプライマリサーバにあわせて、
かさばる凝った特徴の多くが設計されているからです。
