freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ntptrace.8
.\"
.\" %FreeBSD: src/usr.sbin/xntpd/doc/ntptrace.8,v 1.2.2.1 1999/08/29 15:49:15 peter Exp %
.\" jpman %Id: ntptrace.8,v 1.3 1997/09/12 02:34:26 seki Stab %
.\"
.Dd December 21, 1993
.Dt NTPTRACE 8
.Os
.Sh 名称
.Nm ntptrace
.Nd "NTP ホスト連鎖をたどりマスタ時刻ソースまで追跡する"
.Sh 書式
.Nm ntptrace
.Op Fl vdn
.Op Fl r Ar retries
.Op Fl t Ar timeout
.Op Ar server
.Sh 解説
.Nm ntptrace
は、与えられた
ネットワークタイムプロトコル (NTP) サーバが
どこから時刻を取得するのかを決定し、
NTP サーバの連鎖をたどってマスタ時刻ソースまで戻ります。
引数が与えられなかったときは、
.Dq localhost
から始めます。
.Pp
以下は、
.Nm
の出力の例です。
.Bd -literal
% ntptrace
localhost: stratum 4, offset 0.0019529, synch distance 0.144135
server2.bozo.com: stratum 2, offset 0.0124263, synch distance 0.115784
h.edu: stratum 1, offset 0.0019298, synch distance 0.011993, refid 'WWVB'
.Ed
.Pp
各行のフィールドは (左から右へ) 次のようになります:
ホスト名、ホストの階層 (stratum)、
そのホストとローカルホストの間の時刻のずれ (offset) 
(
.Nm
によって測定されたもの;
これが
.Dq localhost 
に対していつも 0 になるとは限らない理由です )、
ホストの
.Dq 同期距離
(synchronization distance)、
そして (階層が 1 のサーバのみですが)、参照時計 ID 。
すべての時間は秒単位です。
(同期距離とは、時計の時刻の精度を測ったものです。)
.Sh オプション
以下のオプションが使えます。
.Bl -tag -width indent
.It Fl d
デバッグ出力をオンにします。
.It Fl n
ホスト名の表示をオフにします; 代わりに、ホストの IP アドレスが
表示されます。これは、ネームサーバが落ちているときに必要になるでしょう。
.It Fl r Ar retries
ホスト毎の再送信の回数をセットします。デフォルトは 5 です。
.It Fl t Ar timeout
再送信のタイムアウト (秒単位) をセットします。デフォルト は 2 です。
.It Fl v
NTP サーバに関する詳細な情報を出力します。
.El
.Sh 関連項目
.Xr xntpd 8 ,
.Xr xntpdc 8
.Sh バグ
このプログラムは、複数の標本を取って精度を高めるような試みをしません。
