freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ntptime.8
.\"
.\" %FreeBSD: src/usr.sbin/ntp/doc/ntptime.8,v 1.1.2.3 2001/12/21 17:42:34 roberto Exp %
.\"
.\" $FreeBSD$
.Dd January 7, 2000
.\" WORD: time constant		時定数
.Dt NTPTIME 8
.Os
.Sh 名称
.Nm ntptime
.Nd カーネルの時刻変数を読み出す
.Sh 書式
.Nm ntptime
.Op Fl chr
.Op Fl e Ar est_error
.Op Fl f Ar frequency
.Op Fl m Ar max_error
.Op Fl o Ar offset
.Op Fl s Ar status
.Op Fl t Ar time_constant
.Sh 解説
このプログラムは
.Qo
高精度な時刻保持のためのカーネルモデル
.Qc
のページ (
.Pa /usr/share/doc/ntp
にある HTML 文書の一部)
に記載されている特別なカーネルに対して用いる時にのみ、役に立ちます。
このプログラムはもし使用可能であればシステムコール
.Fn gettime
と
.Xr adjtime 2
を用いて時刻に関するカーネル変数を読み出して表示します。
似たような表示は
.Xr ntpdc 8
プログラムの
.Ic kerninfo
コマンドを使用することにより得られます。
.Pp
以下のオプションが使用可能です:
.Bl -tag -width indent
.It Fl c
.Nm
自身の実行時刻を表示します。
.It Fl e Ar est_error
推定誤差をマイクロ秒で指定します。
.It Fl f Ar frequency
周波数オフセットを 100 万分の 1 で指定します。
.It Fl h
ヘルプ情報を表示します。
.It Fl l
リープビットを 0 から 3 のコードで指定します。
.It Fl m Ar max_error
最大誤差をマイクロ秒単位で指定します。
.It Fl o Ar offset
時計のオフセットをマイクロ秒で指定します。
.It Fl r
Unix および NTP 時刻を raw 形式で表示します。
.It Fl s Ar status
.It Fl t Ar time_constant
時定数を 0 から 4 の整数で指定します。
.El
.Sh 関連項目
.Xr adjtime 2 ,
.Xr ntpdc 8
