freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ntptrace.8
''' $Header
''' 
.\" jpman %Id: ntptrace.8,v 1.3 1997/09/12 02:34:26 seki Stab %
.de Sh
.br
.ne 5
.PP
\fB\\$1\fR
.PP
..
.de Sp
.if t .sp .5v
.if n .sp
..
.de Ip
.br
.ie \\n.$>=3 .ne \\$3
.el .ne 3
.IP "\\$1" \\$2
..
'''
'''     Set up \*(-- to give an unbreakable dash;
'''     string Tr holds user defined translation string.
'''     Greek uppercase omega is used as a dummy character.
'''
.tr \(*W-|\(bv\*(Tr
.ie n \{\
.ds -- \(*W-
.if (\n(.H=4u)&(1m=24u) .ds -- \(*W\h'-12u'\(*W\h'-12u'-\" diablo 10 pitch
.if (\n(.H=4u)&(1m=20u) .ds -- \(*W\h'-12u'\(*W\h'-8u'-\" diablo 12 pitch
.ds L" ""
.ds R" ""
.ds L' '
.ds R' '
'br\}
.el\{\
.ds -- \(em\|
.tr \*(Tr
.ds L" ``
.ds R" ''
.ds L' `
.ds R' '
'br\}
.TH NTPTRACE 8 LOCAL
.SH 名称
ntptrace - NTP ホスト連鎖をたどりマスタ時刻ソースまで追跡する
.SH 書式
.B ntptrace
[
.B -vdn
] [
.B -r
.I retries
] [
.B -t
.I timeout
] [
.I server
]
.SH 解説
.I ntptrace
は、与えられた
ネットワークタイムプロトコル (NTP) サーバが
どこから時刻を取得するのかを決定し、
NTP サーバの連鎖をたどってマスタ時刻ソースまで戻ります。
引数が与えられなかったときは、 ``localhost'' から始めます。
.PP
以下は、
.I ntptrace
の出力の例です。
.RS 2
.nf

% ntptrace
localhost: stratum 4, offset 0.0019529, synch distance 0.144135
server2.bozo.com: stratum 2, offset 0.0124263, synch distance 0.115784
usndh.edu: stratum 1, offset 0.0019298, synch distance 0.011993, refid 'WWVB'

.fi
.RE
各行のフィールドは (左から右へ):
ホスト名、ホストの階層 (stratum)、
そのホストとローカルホストの間の時刻のずれ (offset) 
(
.I ntptrace
によって測定されたもの; これが ``localhost'' に対して
いつも 0 になるとは限らない理由です) 、
ホストの ``同期距離'' (synch distance)、
そして、(階層が 1 のサーバのみですが) 参照時計 ID。
すべての時間は秒単位です。
(同期距離というのは、時計の時刻の良さの測度です。)
.SH オプション
.IP "\-d" 5
デバッグ出力をオンにします。
.IP "\-n" 5
ホスト名の印刷をオフにします; 代わりに、ホストの IP アドレスが
使われます。これは、ネームサーバが落ちているときに必要になるかも
しれません。
.IP "\-r retries" 5
各ホストに対する再送信の回数をセットします。デフォルト = 5。
.IP "\-t timeout" 5
再送信の制限時間 (秒単位) をセットします。デフォルト = 2。
.IP "\-v" 5
NTP サーバについての詳細な情報を出力します。
.SH 関連項目
xntpd(8), xntpdc(8)
.SH バグ
このプログラムは、複数の標本を取って正確さを増すような試みをしません。
