freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ntptrace.8
.\"
.\" %FreeBSD: src/usr.sbin/ntp/doc/ntptrace.8,v 1.1.2.2 2000/11/02 09:33:37 sheldonh Exp %
.\" jpman %Id: ntptrace.8,v 1.4 2000/05/18 11:21:27 takamune Stab %
.\"
.Dd January 6, 2000
.Dt NTPTRACE 8
.Os
.Sh 名称
.Nm ntptrace
.Nd NTP サーバ連鎖をたどりプライマリソースまで追跡する
.Sh 書式
.Nm ntptrace
.Op Fl vdn
.Op Fl r Ar retries
.Op Fl t Ar timeout
.Op Ar server
.Sh 解説
.Nm
は、与えられた
ネットワークタイムプロトコル (NTP) サーバが
どこから時刻を取得するのかを決定し、
NTP サーバの連鎖をたどってマスタ時刻ソースまで戻ります。
引数が与えられなかったときは、
.Dq localhost
から始めます。
.Pp
以下は、
.Nm
の出力の例です:
.Bd -literal
% ntptrace
localhost: stratum 4, offset 0.0019529, synch distance 0.144135
server2ozo.com: stratum 2, offset 0.0124263, synch distance 0.115784
usndh.edu: stratum 1, offset 0.0019298, synch distance 0.011993, refid 'WWVB'
.Ed
.Pp
各行のフィールドは (左から右へ) 次のようになります:
ホスト名、ホストの階層 (stratum)、
そのホストとローカルホストの間の時刻のオフセット
(
.Nm
によって測定されたもの;
これが
.Dq localhost
に対していつも 0 になるとは限らない理由です)、
ホストの
同期距離、
そして (階層が 1 のサーバのみですが) 参照クロック ID。
すべての時間は秒単位です。
同期距離とは、時計の時刻の精度を測ったものであるのに対して、
階層とはプライマリソースへ対するサーバのホップ数であることに注意してください。
これらの用語は RFC 1305 において正確に定義されています。
.Pp
以下のオプションが使用可能です:
.Bl -tag -width indent
.It Fl d
デバッグ出力をオンにします。
.It Fl n
ホスト名の表示をオフにします; 代わりに、ホストの IP アドレスが
表示されます。これは、ネームサーバが落ちているときに必要になるでしょう。
.It Fl r Ar retries
ホスト毎の再送信の回数をセットします。デフォルトは 5 です。
.It Fl t Ar timeout
再送信の制限時間 (秒単位) をセットします。デフォルトは 2 です。
.It Fl v
NTP サーバに関する詳細な情報を出力します。
.El
.Sh 関連項目
.Xr ntpd 8 ,
.Xr ntpdc 8
.Rs
.%A D L Mills
.%T Network Time Protocol (Version 3)
.%O RFC1305
.Re
.Sh バグ
このプログラムは、複数のサンプルを取って精度を高めるような試みをしません。
