freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pac.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)pac.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/lpr/pac/pac.8,v 1.4.2.1 2000/12/08 15:28:27 ru Exp %
.\"
.\" jpman %Id: pac.8,v 1.2 1997/05/03 13:43:12 horikawa Stab %
.\"
.Dd June 6, 1993
.Dt PAC 8
.Os BSD 4.2
.Sh 名称
.Nm pac
.Nd プリンタ/プロッタのアカウンティング情報
.Sh 書式
.Nm
.Op Fl P Ns Ar printer
.Op Fl c
.Op Fl m
.Op Fl p Ns Ar price
.Op Fl s
.Op Fl r
.Op Ar name ...
.Sh 解説
.Nm
は、プリンタ/プロッタのアカウンティングファイルを読み、
各ユーザが消費した紙の枚数 (通常の場合) や長さ (ラスタデバイスの場合)
の累計を計算し、各ユーザがどれだけ紙を使ったかを計算し、ページ数や紙の
長さや金額で表示します。
.Pp
オプションおよびオペランドとしては以下のものがあります:
.Bl -tag -width PPprinter
.It Fl P Ns Ar printer
指定したプリンタでのアカウンティングを見ます。
これをつけない場合は、デフォルトのプリンタ (サイト依存) か、
環境変数
.Ev PRINTER
の値が使われます。
.It Fl c
出力を金額でソートします。通常の場合、
出力は名前のアルファベット順にソートされます。
.It Fl m
アカウンティングファイル内のホスト名部分を無視します。
これにより、1 人のユーザが複数のマシン上から出力した分の料金
をひとまとめにすることができます。
.It Fl p Ns Ar price
単価をデフォルトの値 0.02 や
.Pa /etc/printcap
で指定した値のかわりに
.Ar price
にします。
.It Fl r
逆順にソートします。
.It Fl s
アカウント情報が要約され、要約したアカウントファイルに登録されます;
多忙なシステム上では、アカウントファイルが 1 日に何行も
増えるため、この要約が必要となります。
.It Ar names
.Ar name
のユーザのみについて統計をとります; 通常は紙を使用
したすべてのユーザの統計をとります。
.El
.Sh 関連ファイル
.Bl -tag -width /var/account/?_sum -compact
.It Pa /var/account/?acct
未加工のアカウントファイル
.It Pa /var/account/?_sum
要約されたアカウントファイル
.It Pa /etc/printcap
プリンタの特徴を記述したデータベース
.El
.Sh 関連項目
.Xr printcap 5
.Sh バグ
計算した料金と実際の値との関係はまだわかっていません。
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
から登場しました。
