freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pam_radius.8
.\" Copyright (c) 1999
.\"	Andrzej Bialecki <abial@FreeBSD.org>.  All rights reserved.
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libpam/modules/pam_radius/pam_radius.8,v 1.14 2003/11/12 17:47:23 sobomax Exp %
.\" $FreeBSD$
.\"
.Dd October 28, 2002
.Dt PAM_RADIUS 8
.Os
.Sh 名称
.Nm pam_radius
.Nd RADIUS 認証 PAM モジュール
.Sh 書式
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_radius
.Op Ar options
.Sh 解説
.Nm
モジュールは RADIUS (Remote Authentication Dial In User Service)
プロトコルに基づく認証サービスを提供する PAM
(Pluggable Authentication Module) の枠組みのモジュールです。
.Pp
.Nm
モジュールは次のオプションパラメータを受け付けます:
.Bl -tag -width Fl
.It Cm use_first_pass
を指定すると、
.Nm
は新しいパスワードの入力を求めずに、以前に入力されたパスワードを
使います。パスワードが入力されていない場合には、認証は失敗します。
.It Cm try_first_pass
を指定すると、
.Nm
は以前に入力されたパスワードがあれば、それを使います。パスワードが
入力されていなければ、
.Nm
は通常通り入力を求めます。
.It Cm echo_pass
は、
.Nm
パスワードの入力を求めるとき、エコーを有効のままにします。
.It Cm conf Ns = Ns Ar pathname
は RADIUS クライアント設定ファイルの標準以外の位置を指定します
(通常は
.Pa /etc/radius.conf
です)。
.It Cm nas_id Ns No = Ns Ar identifier
ホスト名の代りに送る NAS 識別子を指定します。
.It Cm template_user Ns No = Ns Ar username
は、セッションの環境をつくるテンプレートとして使用する
.Xr passwd 5
エントリをもつユーザ名を指定します。
このエントリは、提供されるユーザ名が、ローカルのパスワードデータベースに
存在しない場合に使用されます。
ユーザは提供されたユーザ名とパスワードで認証されますが、
システムでの資格は
.Ar username
に与えられたものとなります。すなわち、ログインクラス、ホームディレクトリ、
資源の制限などは、
.Ar username
に指定されたものが適用されます。
.Pp
このオプションが省略され、かつ与えられたユーザ名がシステムのデータベースに
存在しない (
.Xr getpwnam 3
を呼び出して決定されます) 場合には、認証に失敗します。
.It Cm nas_ipaddr Ns Op No = Ns Ar address
送られるべき NAS IP アドレスを指定します。
このオプションが存在するが値が指定されていなかった場合、
現在のホスト名に対応する IP アドレスが使用されます。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/radius.conf -compact
.It Pa /etc/radius.conf
.Nm
の標準 RADIUS クライアント設定ファイル。
.El
.Sh 関連項目
.Xr passwd 5 ,
.Xr radius.conf 5 ,
.Xr pam 8
.Sh 歴史
.Nm
モジュールは
.Fx 3.1
から登場しました。
.Nm
マニュアルページは
.Fx 3.3
から登場しました。
.Sh 作者
.An -nosplit
.Nm
マニュアルページは
.An Andrzej Bialecki Aq abial@FreeBSD.org
が書きました。
.Pp
.Nm
モジュールは
.An John D. Polstra Aq jdp@FreeBSD.org
が書きました。
