freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pam_opieaccess.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\" Copyright (c) 2002 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" Portions of this software were developed for the FreeBSD Project by
.\" ThinkSec AS and NAI Labs, the Security Research Division of Network
.\" Associates, Inc.  under DARPA/SPAWAR contract N66001-01-C-8035
.\" ("CBOSS"), as part of the DARPA CHATS research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libpam/modules/pam_opieaccess/pam_opieaccess.8,v 1.5.2.1 2002/07/03 21:41:30 des Exp %
.\"
.\" $FreeBSD$
.Dd January 21, 2002
.Dt PAM_OPIEACCESS 8
.Os
.Sh 名称
.Nm pam_opieaccess
.Nd OPIEAccess PAM モジュール
.Sh 書式
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_opieaccess
.Op Ar options
.Sh 解説
たとえ OPIE 認証が失敗しても (
.Xr pam_unix 8
モジュールのような) 他の手段を使用して
認証を確実に続行できるようにするために、
.Nm
モジュールは
.Xr pam_opie 8
PAM モジュールと統合して使用されます。
適切にこのモジュールを使用するために、
.Xr pam_opie 8
は control-flag 項を
.Dq Li sufficient
にしてください。
更に、
.Nm
は
.Xr pam_opie 8
のすぐ下に記述し control-flag 項を
.Dq Li requisite
にしてください。
.Pp
.Nm
モジュールが機能を提供する PAM カテゴリはただ 1 つで
認証 (authentication) です。
.Ar module-type
項のパラメータとしては、
.Dq Li auth
機能となります。
これはまた他の module-type に対しては
ヌル関数 (何もしない関数) を提供します。
.Ss OPIEAccess 認証モジュール
認証構成要素
.Pq Fn pam_sm_authenticate
は次の 2 つの場合に
.Dv PAM_SUCCESS
を戻します。
.Bl -enum
.It
ユーザが OPIE を有効にしていません。
.It
ユーザは OPIE を有効にしていて、リモートホストは
.Pa /etc/opieaccess
に信頼できるホストとして記述してあり、
ユーザは自分のホームディレクトリに
.Pa opiealways
というファイルを置いていません。
.El
.Pp
これら以外の場合は、この認証構成要素は
.Dv PAM_AUTH_ERR
を戻します。
.Pp
以下の options 項が認証モジュールに渡せます。
.Bl -tag -width ".Cm no_warn"
.It Cm debug
.Dv LOG_DEBUG
レベルのデバッグ情報を
.Xr syslog 3
で記録します。
.It Cm no_warn
ユーザへの警告メッセージを抑止します。
これらのメッセージはユーザの試みた認証を
拒絶した理由を含んでいます。
.El
.Sh 関連項目
.Xr opie 4 ,
.Xr opieaccess 5 ,
.Xr pam.conf 5 ,
.Xr pam 8 ,
.Xr pam_opie 8
.Sh 作者
.Nm
モジュールとこのマニュアルページは、
.Fx
プロジェクトのために
Security Research Division of Network
Associates, Inc. 社の
ThinkSec AS and NAI Labs 研究所 によって、
DARPA/SPAWAR contract N66001-01-C-8035
.Pq Dq CBOSS
契約に基づき
DARPA CHATS research program
の一環として開発されました。
.\" Translated by Tetsuro Furuya <ht5t-fry@asahi-net.or.jp> , Oct., 2002.
.\" Checked by Kazuo Horikawa <horikawa@jp.FreeBSD.org>  , Oct., 2002.
