freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pam_ssh.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\" Copyright (c) 2001-2003 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by ThinkSec AS and
.\" NAI Labs, the Security Research Division of Network Associates, Inc.
.\" under DARPA/SPAWAR contract N66001-01-C-8035 ("CBOSS"), as part of the
.\" DARPA CHATS research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/lib/libpam/modules/pam_ssh/pam_ssh.8,v 1.11 2003/02/09 21:20:44 des Exp %
.\"
.\" $FreeBSD$
.Dd November 26, 2001
.Dt PAM_SSH 8
.Os
.Sh 名称
.Nm pam_ssh
.Nd SSH 秘密鍵による認証およびセッションの管理
.Sh 書式
.Op Ar service-name
.Ar module-type
.Ar control-flag
.Pa pam_ssh
.Op Ar options
.Sh 解説
.Nm
は PAM 用 SSH 認証サービスモジュールであり、
認証とセッション管理の PAM の 2 つのカテゴリへの機能を提供します。
.Ar module-type
パラメータ中では
.Dq Li auth
.Dq Li session
と表現されます。
.Ss SSH 認証モジュール
SSH
認証コンポーネントは、ユーザの本人確認の関数
.Pq Fn pam_sm_authenticate 
を提供します。関数は、ユーザに対しパスフレーズを要求し、
それを使って該当ユーザの SSH キーが解読できるかを確かめます。
.Pp
この認証モジュールでは、次に示すオプションが利用できます。
.Bl -tag -width ".Cm use_first_pass"
.It Cm use_first_pass
この認証モジュールがスタック中で先頭にはないときに、
これよりも前のモジュールが、
ユーザのパスワードを入手している場合には、
そのパスワードをユーザの認証に利用します。
もし認証に失敗すると、この認証モジュールは
パスワードの要求をせずに、失敗を返します。
この認証モジュールがスタック中で先頭にある場合、
もしくは、これより前のモジュールがユーザのパスワードを
入手しなかった場合には、このオプションは無効になります。
.It Cm try_first_pass
このオプションは
.Cm use_first_pass 
オプションに似ていますが、
前のモジュールで得たパスワードが失敗した場合は
ユーザに他のパスワードを要求します。
.El
.Ss SSH セッション管理モジュール
SSH
セッション管理コンポーネントは
セッションの開始
.Pq Fn pam_sm_open_session
と終了
.Pq Fn pam_sm_close_session
の関数を提供します。
.Fn pam_sm_open_session
関数は SSH エージェントを開始させ、
認証過程で解読された秘密鍵をエージェントに渡します。
そして、エージェントが示した環境変数をセットします。
.Fn pam_sm_close_session
関数は前に開始された SSH エージェントに
.Dv SIGTERM 
を送って終了させます。
.Pp
このセッション管理モジュールでは、次に示すオプションが使用できます。
.Bl -tag -width ".Cm want_agent"
.It Cm want_agent
認証フェーズにおいてキーがまったく解読されなくても、エージェントを開始します。
.El
.Sh 関連ファイル
.Bl -tag -width ".Pa $HOME/.ssh/identity" -compact
.It Pa $HOME/.ssh/identity
SSH1 RSA 鍵
.It Pa $HOME/.ssh/id_rsa
SSH2 RSA 鍵
.It Pa $HOME/.ssh/id_dsa
SSH2 DSA 鍵
.El
.Sh 関連項目
.Xr ssh-agent 1 ,
.Xr pam.conf 5 ,
.Xr pam 8
.Sh 作者
.Nm
モジュールは元々
.An -nosplit
.An "Andrew J. Korty" Aq ajk@iu.edu
が書きました。
現在の
.Fx
Project 用の実装は ThinkSec AS および
NAI Labs, the Security Research Division of Network Associates, Inc. が
DARPA/SPAWAR contract N66001-01-C-8035
.Pq Dq CBOSS
契約に基づき
DARPA CHATS research program
の一環として開発されました。
このマニュアルページは
.An "Mark R V Murray" Aq markm@FreeBSD.ORG
が書きました。
