freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pccardc.8
.\"
.\" Copyright (c) 1998 Toshihiko ARAI <toshi@jp.FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Translated to English by Hiroki Sato <hrs@geocities.co.jp>
.\"
.\" %FreeBSD: src/usr.sbin/pccard/pccardc/pccardc.8,v 1.7.2.3 2000/12/08 15:28:33 ru Exp %
.\"
.\" jpman %Id: pccardc.8,v 1.3 1999/05/13 14:04:07 horikawa Stab %
.\" 原文である PAO の pccardc.8 をほぼそのまま利用しています
.Dd November 14, 1998
.Dt PCCARDC 8
.Os FreeBSD
.Sh 名称
.Nm pccardc
.Nd PC-CARD (PCMCIA) の制御とモニタを行うツール
.Sh 書式
.Nm
.Ar subcommand
.Op Ar arg ...
.Sh 解説
.Nm
は PC-CARD スロットの制御と、PCMCIA カードの設定や情報表示を行います。
.Nm
は次のサブコマンドを理解します:
.Pp
.Bl -tag -width pccardmem -compact
.It Ic beep
ビープタイプを設定します
.It Ic dumpcis
カードの CIS (複数可) を表示します
.It Ic enabler
デバイスドライバのイネーブラ
.It Ic help
コマンドのまとめを表示します
.It Ic pccardmem
pccard ドライバにメモリを割り当てます
.It Ic power
スロットの電源をオン/オフします
.It Ic rdattr
アトリビュートメモリを読み込みます
.It Ic rdmap
pcic マッピングを読み込みます
.It Ic rdreg
pcic レジスタを読み込みます
.It Ic wrattr
アトリビュートメモリへバイトを書き込みます
.It Ic wrreg
pcic レジスタへ書き込みます
.El
.Bl -enum
.It
.Ic beep Ar 0|1
.Pp
カード挿抜時のサウンド種別を設定します。
本サブコマンドは、
.Xr rc.conf 5
中の
.Va pccard_beep
に対応します。
.Ar beep_mode
に使用可能な値は次の通りです:
.Pp
.Bl -tag -width Ds -compact
.It Li 0
サイレントモード
.It Li 1
シンプルビープモード
.It Li 2
メロディモード
.El
.It
.Ic dumpcis
.Op Ar slot
.Pp
カードの不揮発性メモリ (EEPROM) に格納されている
.Em CIS
(Card Information Structure) タプルを表示します。
.Ar slot
は、どのスロットを読み込むのかを指定します。
オプションを指定しないと、利用可能なすべてのカードの CIS を表示します。
.It
.Ic enabler Ar slot driver
.Op Fl m Ar card addr size
.Op Fl a Ar iobase
.Op Fl i Ar irq
.Pp
「ポイントイネーブラ」です。
.Xr pccardd 8
によるドライバの割り当てがうまく動作しないときに、
手動でパラメータを設定するために使用します。
.Ar slot
で PC-CARD スロットを指定し、
.Ar driver
でデバイス名 ("ed0" や "sio2" など) を指定し、
それと同時に次のオプションの一部またはすべてを指定します:
.Bl -tag -width Ds
.It Fl m Ar card addr size
カードの共有メモリウィンドウをホストアドレスにマップします。
.Ar card
はカードのアドレス空間での共有メモリ開始アドレス (16 進数) であり、
.Ar addr
はホスト側のアドレス空間でのマップするメモリのアドレス (16 進数) であり、
.Ar size
はメモリウィンドウのサイズ (kb) です。
.It Fl a Ar iobase
.Ar iobase
は、I/O ウィンドウをマップするポート番号 (16 進数) を指定します。
.It Fl i Ar irq
.Ar irq
は、カードが割り込みに使用する IRQ (1 から 15 までの 10 進数) を指定します。
.El
.Pp
例えば
.Bd -literal
	enabler 0 ed0 -m 2000 d4000 16 -a 300 -i 3
.Ed
.Pp
は、スロット 0 を、ポート 0x300 で IRQ 3 にある
最初の NE200 イーサネットカードドライバに割り当て、
カード内の 0x2000 からの 16KB のメモリ領域を 0xd4000 にマップします。
.Pp
いままでにも壊れた CIS タプルのために認識できないカードを
この機能で使用することができたようです。また、動作報告
のまだ無いカードをテストするときにも有用でしょう。
それでも、新しいカードを正しく認識できないことが多いので、注意して下さい。
.It
.Ic help
.Pp
.Nm
のヘルプを表示します。
.It
.Ic pccardmem Ar addr
.Pp
PC-CARD コントローラ (PCIC) がカードをマップするために使用する
ホストアドレスを指定します。
PCIC は 16KB の連続するメモリを必要とするため、
指定可能なアドレスは次の 4 通りとなります:
.Pp
.Bl -tag -width 0xd0000 -compact
.It Ar 0xd0000
0xd0000-0xd3fff (デフォルト)
.It Ar 0xd4000
0xd4000-0xd7fff
.It Ar 0xd8000
0xd8000-0xdbfff
.It Ar 0xdc000
0xdc000-0xdffff
.El
.Pp
0xd0000 の代わりに "DEFAULT" を指定可能です。
このサブコマンドは、
.Xr rc.conf 5
の
.Va pccard_mem
に対応します。
.It
.Ic power Ar slot power_mode
.Pp
.Ar slot
で指定されるスロット中のカードの給電状態を変えます。
.Pp
.Bl -tag -width Ds
.It Li 0
給電をオフにします。
活性状態で抜くとカードが不安定になる場合、
本機能によりまず強制的に不活性状態として、安全にカードを取り除けます。
.It Li 1
給電をオンにし、カード挿入時と同様に活性状態にします。
.El
.Pp
.It
.Ic rdattr Ar slot offs length
.Pp
スロット
.Ar slot
で
.Ar offs
から開始する
.Ar length
バイトの不揮発性メモリ (EEPROM) を、16 進ダンプ表示します。
すべてのパラメータは 16 進数です。
.It
.Ic rdmap
.Op Ar slot
.Pp
PC-CARD スロットの 4 つのメモリウィンドウと 2 つの I/O ウィンドウの
ホストマシンへのマッピング状況を報告します。
.Ar slot
を指定しない場合には、システム上の全スロットに関して表示します。
.It
.Ic rdreg
.Op Ar slot
.Pp
.Ar slot
の 64 個のレジスタを表示します (デフォルトでは全スロットを対象とします)。
.It
.Ic wrattr Ar slot offs value
.Pp
カードの不揮発性メモリ (EEPROM) の、先頭からのオフセット
.Ar offs
(16 進数) の 1 バイトを
.Ar value
(16 進数) で書き換えます。変更結果はカードを抜いても保存されます。
.It
.Ic wrreg Ar slot reg value
.Pp
PC-CARD のレジスタへ書き込みます。
PC-CARD スロット番号は
.Ar slot
で指定し、レジスタ番号を
.Ar reg
(16 進数) で指定し、値を
.Ar value
(16 進数) で指定します。
.El
.Pp
.Sh 関連ファイル
.Bl -tag -width /etc/rc.conf -compact
.It Pa /etc/rc.conf
設定ファイル
.El
.Sh 関連項目
.Xr rc.conf 5 ,
.Xr pccardd 8
.Sh 作者
.An -nosplit
オリジナルバージョンを
.An Andrew McRae Aq andrew@mega.com.au
が記述しました。
.An Tatsumi Hosokawa Aq hosokawa@mt.cs.keio.ac.jp
がバグ修正と機能拡張を行いました。
このマニュアルページを
.An Toshihiko ARAI Aq toshi@jp.FreeBSD.org
が記述しました。
.Sh バグ
.Ic enabler
と
.Ic wrattr
の使用に際しては注意して下さい。
誤用すると、
システムを不安定にしたり、カードにダメージを与えるかもしれません。
