freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pccardd.8
.\"
.\" Copyright (c) 1994 Andrew McRae.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/pccard/pccardd/pccardd.8,v 1.17.2.3 2000/12/27 16:23:18 ru Exp %
.\"
.\" jpman %Id: pccardd.8,v 1.4 1997/07/26 22:04:06 horikawa Stab %
.\"
.Dd November 1, 1994
.Dt PCCARDD 8
.Os FreeBSD
.Sh 名称
.Nm pccardd
.Nd PC-CARD (PCMCIA) 管理デーモン
.Sh 書式
.Nm
.Op Fl d
.Op Fl v
.Op Fl z
.Op Fl i Ar IRQ
.Op Fl f Ar configfile
.Sh 解説
.Nm
は、普通ブート時に始動され、 PC-CARD カードの抜き差しを管理します。
.Pp
実行されると、
.Nm
は設定ファイル (デフォルト名は
.Pa /etc/defaults/pccard.conf
であり、これがユーザ設定ファイル
.Pa /etc/pccard.conf
をインクルードします)
を読み込み、カードのために利用可能な PC-CARD スロット
をスキャンします。
.Nm
は、その後、例えば新しいカードの挿入やカードの取り外しのような、
.Em "カードイベント" 
を待ちます。
.Pp
カードが挿入された時、以下のような動作が行われます。
.Bl -enum
.It
カーネルドライバはカードの挿入を検出し、カードに電源を供給します。
.It
.Nm
は、
.Em CIS
データをカードの属性メモリから読み込み、製造者名とカードの
バージョンを設定ファイルのカード記述と照合します。
.It
マッチするものが見付かると、ドライバが割り当てられます。
.It
ひとたび自由なドライバとデバイス実体が割り当てられると、
.Nm
は (必要であれば) ISA メモリブロックや入出力ポートのような資源を
共通の資源から割り当てます。
.It
PC-CARD スロットは、割り当てられた I/O とメモリコンテキストによって
設定され、カーネルドライバがカードに割り当てられます。
.It
割当が成功すると、例えばネットワークインタフェースを設定するための
.Xr ifconfig 8
等のような
特定のシェルコマンドがデバイスを設定するために実行されます。
それぞれ別々のコマンドを各カード・ドライバ・デバイスのために指定して良く、
その順序で実行されます。
.El
.Pp
.Nm
がカードの除去を発見した時には、以下の一連の操作が実行されます。
.Bl -enum
.It
カード除去に対して割り当てられたシェルコマンドが実行されます。
これは、除去されたカードに割り当てられたどんなデバイスも
リセットしようとします。
それぞれ別々のコマンドを各カード・ドライバ・デバイスのために指定して良いです。
.It
PC-CARD スロット資源は解放されます。
.El
.Pp
ひとたびカード/ドライバ実体が設定されると、
その実体に割り当てた資源を憶えておきます。
そして、カードが取り外され再び挿入された場合、
同じドライバを割り当てます。この主な理由は、一度ドライバがカードに
割り当てられると、ドライバの
.Fn 検査 (prove)
ルーチンが呼ばれ、
ドライバ固有のデータ領域は
カードに割り当てられた I/O ポートやメモリ資源によって初期化されるからです。
大多数のドライバは、ハードウエアから関連を解消されたり、その後で再び
違うパラメータで再割当されるように設計されていません。
これは、読み込み可能カーネルモジュールがサポートされた時に大きく変わ
るでしょう。
.Pp
SIGHUP は、
.Nm
に設定ファイルを再読み込みさせます。
.Pp
.Nm
が理解する実行時オプションは以下の通りです。
.Bl -tag -width Ds
.It Fl d
デーモンとして実行せず、フォアグランドジョブとして実行し、
エラーメッセージを表示します。
.It Fl v
設定ファイルを読み込んだ後で、そのまとめを出力します。
.It Fl z
デーモンとして実行することを、
カードがプローブされてアタッチされる後まで遅らせます。
.It Fl i Ar IRQ
利用可能な IRQ を設定します。
.Pa /etc/defaults/pccard.conf
および
.Pa /etc/pccard.conf
の "irq" 行に優先します。
.It Fl f Ar configfile
デフォルト設定ファイル
.Pa /etc/defaults/pccard.conf
とは異なった設定ファイルを指定します。
ファイルの形式は、
.Xr pccard.conf 5 
に詳細に記述されていますし、
.Nm
によって認識される PC-CARD カードがリストされています。
また、カードへのインタフェースとして使われるカーネルドライバと
デバイスについても詳細に書かれています。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/defaults/pccard.conf -compact
.It Pa /etc/defaults/pccard.conf
デフォルトの設定ファイル
.It Pa /etc/pccard.conf
ユーザの設定ファイル
.It Pa /var/run/pccardd.pid
現在実行中の
.Nm
のプロセス ID
.El
.Sh 関連項目
.Xr pccard.conf 5 ,
.Xr ifconfig 8
.Sh 作者
.An Andrew McRae Aq andrew@mega.com.au
によって開発されました。
.Sh バグ
.Nm
はカードのパラメータを設定することができますが、
特定のドライバがカードと動作することを保証しません。
.Pp
システム資源 (例えばネットワークマウントされているファイルシステム) が
カードに関連している場合は、カードを取り外すと問題が起こるかも知れません。
