freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pim6dd.8
.\"	$KAME: pim6dd.8,v 1.6 2000/07/10 08:52:59 itojun Exp $
.\"
.\" Copyright (C) 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/pim6dd/pim6dd.8,v 1.3.2.7 2001/03/06 14:21:29 ru Exp %
.\"
.\" $FreeBSD$
.Dd November 17, 1998
.Dt PIM6DD 8
.Os
.Sh 名称
.Nm pim6dd
.Nd PIM for IPv6 dense mode デーモン
.Sh 書式
.Nm
.Op Fl c Ar configfile
.Oo
.Fl d
.Sm off
.Op Ar debug_level Op , Ar ...
.Sm on
.Oc
.Sh 解説
.Nm
は IPv6 マルチキャスト経路制御デーモンであり、
PIMv2
(Protocol Independent Multicast Version 2: プロトコル非依存マルチキャスト)
for IPv6 の dense mode (密モード) をサポートします。
.Pp
.Nm
がサポートするオプションは次の通りです:
.Bl -tag -width Ds
.It Fl c Ar configfile
.Ar configfile
で、設定ファイルの別の置き場所を指定します。
デフォルトでは
.Pa /etc/pim6dd.conf
を使います。
.It Fl d
デバッグレベルを指定します。
このオプションが引数なしで指定された場合には、
全てのデバッグメッセージが出力されます。
出力するメッセージの集合を、オプションの引数で指定できます。
有効なデバッグレベルは次の通りです:
.Ic timeout , packets , interfaces , kernel ,
.Ic mfc , pim_detail , pim_hello , kernel ,
.Ic mfc , pim_detail , pim_hello , pim_jp ,
.Ic pim_graft , pim_asserts , pim_routes , pim_timers ,
.Ic rpf , pim , routes , routers ,
.Ic timers ,
.Ic asserts
。
.El
.Pp
.Nm
は全てのマルチキャスト可能なインタフェース、
つまり IFF_MULTICAST フラグがセットされたインタフェース
("ループバックインタフェース" 以外) に転送するように
自動的に設定されます。
このデフォルトの設定を変更するために、
設定コマンドを
.Pa /etc/pim6dd.conf
.Po
または
.Sq Fl c
オプションで指定される代替ファイル
.Pc
に書くことができます。
.\"
.Sh 関連ファイル
.Bl -tag -width /etc/pim6dd.conf -compact
.It Pa /etc/pim6dd.conf
デフォルトの設定ファイル。
.El
.Sh 関連項目
.Xr daemon 3 ,
.Xr pim6dd.conf 5
.Sh 歴史
.Nm
コマンドは、University of Oregon (オレゴン大学) で開発された
IPv4 マルチキャスト経路制御デーモンである、
.Nm pimdd
に基づいています。
.Nm pimdd
は University of Southern California (南カリフォルニア大学) で開発された
PIM sparse mode (疎モード)
.Nm pimd
に基づいています。
これら 2 つのプログラムの一部は
.Nm mrouted
に由来しています。
.Nm Mrouted
is COPYRIGHT 1989 by The Board of Trustees of
Leland Stanford Junior University.
.Pp
KAME Project (http://www.kame.net/) スタックに基づく
IPv6 および IPsec サポートは、
.Fx 4.0
で初めて統合されました。
.\"
.Sh バグ
.Nm
はユニキャスト経路制御の機構は含まれていないため、
システム上にユニキャスト経路制御デーモンが動作している必要があります。
.Pp
ユニキャスト経路の変更に追従するために、
.Nm
はカーネルのユニキャスト経路表を定期的に監視しています。
.Pp
.Nm
は、IPv6 ルータ上で使用する必要があります。
.Li net.inet6.ip6.forwarding
変数を
.Xr sysctl 8
で 1 に設定していることを確認してください。
.\"
