freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pim6sd.8
.\" Copyright (C) 1999 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%Id: pim6sd.8,v 1.6 2000/05/18 16:11:46 itojun Exp %
.\"	%FreeBSD: src/usr.sbin/pim6sd/pim6sd.8,v 1.3.2.5 2001/03/06 14:21:30 ru Exp %
.\" $FreeBSD$
.\"
.Dd June 10, 1999
.Dt PIM6SD 8
.Os
.Sh 名称
.Nm pim6sd
.Nd PIM for IPv6 sparse mode デーモン
.Sh 書式
.Nm
.Op Fl c Ar configfile
.Oo
.Fl d
.Sm off
.Op Ar debug_level Op , Ar ...
.Sm on
.Oc
.Op Fl f
.Sh 解説
.Nm
は IPv6 マルチキャスト経路制御デーモンであり、
PIMv2
(Protocol Independent Multicast Version 2: プロトコル非依存マルチキャスト)
for IPv6 の sparse mode (疎モード) をサポートします。
.Pp
.Nm
がサポートするオプションは次の通りです:
.Bl -tag -width Ds
.It Fl c Ar configfile
.Ar configfile
で設定ファイルの別の置き場所を指定します。
デフォルトでは
.Pa /etc/pim6sd.conf
を使います。
.It Fl d
デバッグレベルを指定します。
このオプションが引数なしで指定された場合には、
全てのデバッグメッセージが出力されます。
出力するメッセージの集合を、オプションの引数で指定できます。
有効なデバッグレベルは次の通りです:
.Ic mld_proto , mld_timer , mld_member , mld ,
.Ic switch , trace , mtrace , traceroute ,
.Ic timeout , callout , pkt , packets ,
.Ic interfaces , vif , kernel , cache ,
.Ic mfc , k_cache , k_mfc , rsrr ,
.Ic pim_detail , pim_hello , pim_neighbors , pim_register ,
.Ic registers , pim_join_prune , pim_j_p , pim_jp ,
.Ic pim_bootstrap , pim_bsr , bsr , bootstrap ,
.Ic pim_asserts , pim_cand_rp , pim_c_rp , pim_rp ,
.Ic rp , pim_routes , pim_routing , pim_mrt ,
.Ic pim_timers , pim_rpf , rpf , pim ,
.Ic routes , routing , mrt , routers ,
.Ic mrouters , neighbors , timers ,
.Ic asserts
。
.It Fl f
デーモンにはならず、フォアグラウンドで実行します。
このオプションはデバッグ用です。
.El
.Pp
.Nm
は全てのマルチキャスト可能なインタフェース、
つまり IFF_MULTICAST フラグがセットされたインタフェース
("ループバックインタフェース" 以外) に転送するように
自動的に設定されます。
このデフォルト設定を変更するために、
設定コマンドを
.Pa /etc/pim6sd.conf
.Po
または
.Sq Fl c
オプションで指定される代替ファイル
.Pc
に書くことができます。
.Pp
.Nm
プログラムは
.Dv SIGUSR1
シグナルを受け取ると、現在の経路制御情報をダンプファイルに書き出します。
これには PIM の隣接ルータ (neighbor)、
.Nm
内部のマルチキャスト経路表、
BSR と RP 関連の情報を含んでいます。
また、SIGINFO シグナルを受け取ると内部統計をファイルに書き出します。
.Pp
SIGUSR2 シグナルを受け取ると、
.Nm
は設定ファイルを読み直し、デバッグレベルをリセットします。
.Pp
.Nm
プログラムは自分のログを独自のファイル
.Pq Pa /var/log/pim6sd.log
に書き出します。
ログレベルは
.Fl d
コマンドラインオプションか、設定ファイルで設定できます。
.\"
.Sh 関連ファイル
.Bl -tag -width /etc/pim6sd.conf -compact
.It Pa /etc/pim6sd.conf
デフォルトの設定ファイル。
.It Pa /var/run/pim6sd.dump
.Nm
が内部状態を出力するファイル。
.It Pa /var/run/pim6sd.stat
.Nm
が内部統計を出力するファイル。
.It Pa /var/log/pim6sd.log
pim6sd 独自のログファイル。
.El
.Sh 関連項目
.Xr daemon 3 ,
.Xr pim6sd.conf 5
.Sh 歴史
.Nm
コマンドは LSIIT Laboratory の Michael Hoerdt が開発しました。
これは University of Southern California (南カリフォルニア大学) で
開発された
.Nm mrouted
由来の IPv4 PIM sparse mode
.Nm pimd
に基づいています。
.Nm Mrouted
is COPYRIGHT 1989 by The Board of Trustees of
Leland Stanford Junior University.
.Pp
KAME Project (http://www.kame.net/) スタックに基づく
IPv6 および IPsec サポートは、
.Fx 4.0
で初めて統合されました。
.\"
.Sh バグ
.Nm
はユニキャスト経路制御の機構は含まれていないため、
システム上にユニキャスト経路制御デーモンが動作している必要があります。
.Pp
ユニキャスト経路の変更に追従するために、
.Nm
はカーネルのユニキャスト経路表を定期的に監視しています。
