freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pnpinfo.8
.\" Copyright (c) 1996, Sujal M. Patel
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Sujal M. Patel
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/contrib/pnpinfo/pnpinfo.8,v 1.2.2.2 2001/03/06 16:54:05 ru Exp %
.\"
.\" $FreeBSD$
.Dd January 7, 1996
.Dt PNPINFO 8
.Os
.Sh 名称
.Nm pnpinfo
.Nd "Plug-n-Play ISA デバイスに関する情報の報告"
.Sh 書式
.Nm
.Sh 解説
.Nm
は Plug-n-Play ISA デバイスに関する情報を報告します。
ベンダ ID、シリアル番号、I/O ポート、IRQ といった情報は、
ISA PnP デバイス付きでカーネルを構築するときに有用です。
.Sh バグ
数個のタグが未実装です (99% の PnP カードには十分です)。
.Sh 関連項目
.Xr pnp 4
.Sh 歴史
.Nm
ユーティリティは
.Fx 2.2
にて初めて登場しました。
.Sh 作者
.An Sujal M. Patel Aq smpatel@umiacs.umd.edu
