freebsd/freebsd-doc/ja_JP.eucJP/man/man8/portmap.8
.\" Copyright (c) 1987 Sun Microsystems
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)portmap.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/portmap/portmap.8,v 1.7 2000/03/02 18:15:46 cwt Exp %
.\"
.\" Original Revision: 1.4
.\" jpman %Id: portmap.8,v 1.2 1997/03/31 14:54:58 horikawa Stab %
.\"
.Dd June 6, 1993
.Dt PORTMAP 8
.Os BSD 4.3
.Sh 名称
.Nm portmap
.Nd
.Tn RPC
プログラムおよびバージョンと
.Tn DARPA
ポート番号とのマップを行なう
.Sh 書式
.Nm portmap
.Op Fl d
.Op Fl v
.Sh 解説
.Nm
は、
.Tn RPC
プログラム番号を
.Tn DARPA
プロトコルポート番号に変換するサーバです。
.Tn RPC
呼び出しを用いる場合には、このプログラムを起動させなければなりません。
.Pp
.Tn RPC
サーバが起動すると、
.Tn RPC
サーバは
.Nm
にそのサーバが受信を待機しているポート番号とサーバの
.Tn RPC
プログラム番号を教えます。クライアントがプログラム番号を指定して
.Tn RPC
呼びだしを行なった場合、クライアントはサーバマシンの
.Nm
とコンタクトをとり、
.Tn RPC
パケットを送出すべきポート番号を決定します。
.Pp
.Nm
は、
.Tn RPC
サーバが起動される前に開始される必要があります。
.Pp
.Nm
は、
.Xr hosts_access 5 
アクセス制御をデフォルトで使用します。
アクセス制御パターンは IP アドレスのみを参照可能です。
.Pp
通常、
.Nm
は、他のデーモンと同様、フォークして起動された端末から自己を切り離します。
.Nm
は、
.Xr syslog 3
を用いてエラーを記録します。
.Pp
以下のオプションが使用可能です:
.Bl -tag -width Ds
.It Fl d
.Nm
をデーモンとして動作させるのを回避します。そして、エラーおよび
デバッグ情報を標準エラー出力に出力させます。
.It Fl v
アクセスコントロールチェックに関する冗長なログを取ります。
.El
.Sh 関連項目
.Xr hosts_access 5 ,
.Xr inetd.conf 5 ,
.Xr inetd 8 ,
.Xr rpcinfo 8
.Sh バグ
.Nm
プロセスが異常終了した場合、関連する全てのサーバを再起動
しなくてはなりません。
.Sh 歴史
.Nm
コマンドは
.Bx 4.3
から登場しました。
