freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pppstats.8
.\"	@(#) %FreeBSD: src/usr.sbin/pppstats/pppstats.8,v 1.10 2000/03/03 09:11:28 sheldonh Exp %
.\" jpman %Id: pppstats.8,v 1.2 1997/05/23 09:03:43 mitchy Stab %
.\"
.TH PPPSTATS 8 "26 June 1995"
.SH 名称
pppstats \- PPP の利用統計を表示する
.SH 書式
.B pppstats
[
.B -a
] [
.B -v
] [
.B -r
] [
.B -z
] [
.B -c
.I <count>
] [
.B -w
.I <secs>
] [
.I interface
]
.ti 12
.SH 解説
.B pppstats
は、指定した PPP インタフェースについて、
PPP に関連した統計情報を一定間隔で表示します。
インタフェースは無指定の場合は ppp0 になります。
表示は入力と出力のセクションに横方向に分割され、
それぞれのセクションで、
そのインタフェースで入出力されたパケットの属性と大きさの統計値を示します。
.PP
オプションには以下のものがあります:
.TP
.B -a
差分ではなく絶対値を表示するようにします。
このオプションを指定すると、
すべてのレポートは
リンクが成立してからの統計値を表示するようになります。
このオプションが未指定なら、
2 回目とそれ以降のレポートが、
前回のレポートからの統計を表示するようになります。
.TP
.B -c \fIcount
表示を
.I count
回繰り返します。
このオプションが指定されない場合、
.B -w
オプションが指定されていれば無限に繰り返し、
さもなくば 1 回だけ表示されます。
.TP
.B -r
使用中のパケット圧縮アルゴリズムによる圧縮率の統計値を要約して
追加表示します。
.TP
.B -v
Van Jacobson TCP ヘッダ圧縮アルゴリズムのパフォーマンスに関する
統計値を追加表示します。
.TP
.B -w \fIwait
繰り返して表示する際の間隔を
.B -w \fIwait
秒にします。
無指定時は 5 秒です。
.TP
.B -z
通常の表示に替えて、
使用中のパケット圧縮アルゴリズムの性能の統計値を表示します。
.PP
.B -z
オプションが指定されない場合、入力側には以下の項目が表示されます:
.TP
.B IN
このインタフェースで受信した総バイト数。
.TP
.B PACK
このインタフェースで受信したパケットの総数。
.TP
.B VJCOMP
このインタフェースで受信した、ヘッダ圧縮された TCP パケットの数。
.TP
.B VJUNC
このインタフェースで受信した、ヘッダの圧縮されていない TCP パケットの数。
.B -r
オプションが指定されたときは表示されません。
.TP
.B VJERR
このインタフェースで受信した、
破損した、あるいは不正にヘッダが圧縮された TCP パケットの数。
.B -r
オプションが指定されたときは表示されません。
.TP
.B VJTOSS
先行するエラーで受理されずに落された、
VJ ヘッダ圧縮された TCP パケットの数。
.B -v
オプションが指定されたときだけ表示されます。
.TP
.B NON-VJ
このインタフェースで受信した非 TCP パケットの総数。
.B -v
オプションが指定されたときだけ表示されます。
.TP
.B RATIO
使用中のパケット圧縮方法で達成された、
受信パケットの、圧縮時に対する非圧縮時の大きさの比率で表した圧縮率。
.B -r
オプションが指定されたときだけ表示されます。
.TP
.B UBYTE
受信した圧縮パケットの展開後のバイト総数。
.B -r
オプションが指定されたときだけ表示されます。
.PP
出力側には以下の項目が表示されます:
.TP
.B OUT
このインタフェースから送信された総バイト数。
.TP
.B PACK
このインタフェースから送信した総パケット数。
.TP
.B VJCOMP
このインタフェースから送信された、
TCP ヘッダを VJ 圧縮した TCP パケットの数。
.TP
.B VJUNC
このインタフェースから送信された、
TCP ヘッダを VJ 圧縮していない TCP パケットの数。
.B -r
オプションが指定されたときは表示されません。
.TP
.B NON-VJ
このインタフェースから送信された非 TCP パケットの総数。
.B -r
オプションが指定されたときは表示されません。
.TP
.B VJSRCH
VJ ヘッダ圧縮パケットのヘッダエントリをキャッシュで探索した回数。
.B -v
オプションが指定されているときだけ表示されます。
.TP
.B VJMISS
VJ ヘッダ圧縮パケットのヘッダエントリをキャッシュで探索して失敗した回数。
.B -v
オプションが指定されているときだけ表示されます。
.TP
.B RATIO
使用中のパケット圧縮方法で達成された、送信パケットの、
圧縮後に対する圧縮前の大きさの比率で表した圧縮率。
.B -r
オプションが指定されているときだけ表示されます。
.TP
.B UBYTE
送信した圧縮パケットの圧縮前のバイト総数。
.B -r
オプションが指定されているときだけ表示されます。
.PP
.B -z
オプションが指定されている場合は、
.B pppstats
は上記のものに替えて、
現在使用中のパケット圧縮アルゴリズムについて以下の項目を表示します。
パケット圧縮が使用されていない場合は、これらの項目はすべて 0 になります。
入力側で表示される項目は:
.TP
.B COMPRESSED BYTE
受信した圧縮パケットのバイト数。
.TP
.B COMPRESSED PACK
受信した圧縮パケットの数。
.TP
.B INCOMPRESSIBLE BYTE
受信した圧縮不可能な (非圧縮形式で送られた) パケットのバイト数。
.TP
.B INCOMPRESSIBLE PACK
受信した非圧縮パケットの数。
.TP
.B COMP RATIO
(圧縮可能なものと不可能なものの両方を含めた)
圧縮後に対する圧縮前の大きさの比率で表した、
受信パケットの目下の圧縮率。
.PP
出力側で表示される項目は:
.TP
.B COMPRESSED BYTE
送信された圧縮パケットのバイト数。
.TP
.B COMPRESSED PACK
送信された圧縮パケットの数。
.TP
.B INCOMPRESSIBLE BYTE
送信された
(非圧縮の形式で送信された)
圧縮不可能なパケットのバイト数。
.TP
.B INCOMPRESSIBLE PACK
送信された圧縮不可能なパケットの数。
.TP
.B COMP RATIO
外へ出て行くパケットの目下の圧縮率。
.SH 関連項目
pppd(8)
