freebsd/freebsd-doc/ja_JP.eucJP/man/man8/praliases.8
.\" Copyright (c) 1998-2000 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	%Id: praliases.8,v 8.15 2000/04/06 16:47:24 ca Exp %
.\"
.\" Original Revision: 1.1.1.2.6.1
.TH PRALIASES 8 "April 25, 1996"
.SH 名称
.B praliases
\- システムメールエイリアスの表示
.SH 書式
.B praliases
.RB [ \-C
.IR file ]
.RB [ \-f
.IR file ]
.RB [\c
.IR key
.IR ... ]
.SH 解説
.B praliases
ユーティリティは、
現在のシステムエイリアスを 1 行につき 1 つ
ずつ ( 但し項目順ではなく ) 表示します。
特別な内部的なエイリアス @:@ は、存在すれば表示されます。
.PP
オプションは次の通りです:
.TP
.B \-C
デフォルトの
.B sendmail
設定ファイルの代わりに、指定した sendmail 設定ファイルを読みます。
.TP
.B \-f
デフォルトの
.Nm sendmail
システムのエイリアスファイルの代わりに、
指定されたファイルを読みます。
.PP
コマンドライン上にひとつ以上のキーが指定された場合、
これらのキーに適合するエントリのみが表示されます。
.PP
.B praliases
ユーティリティは成功すると 0 、
エラーが発生すると 0 より大きな値を返します。
.SH 関連ファイル
.TP 2.5i
/etc/mail/sendmail.cf
デフォルトの
.Nm sendmail
設定ファイル。
.SH 関連項目
mailq(1),
sendmail(8)
