freebsd/freebsd-doc/ja_JP.eucJP/man/man8/prefix.8
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: prefix.8,v 1.4 2000/05/31 17:00:08 itojun Exp %
.\"	%FreeBSD: src/usr.sbin/prefix/prefix.8,v 1.2.2.5 2001/03/06 14:21:35 ru Exp %
.\"
.\" jpman %Id: prefix.8,v 1.3 2000/04/28 05:42:18 takaha Stab %
.Dd October 10, 1998
.Dt PREFIX 8
.Os
.Sh 名称
.Nm prefix
.Nd ネットワークインタフェースのプレフィックスを設定する
.Sh 書式
.Nm
.Bk -words
.Ar interface prefix
.Op Ar parameters
.Op Cm set | delete
.Nm
.Ar interface
.Cm matchpr Ar match_prefix
.Cm mp_len Ar match_prefix_len
.Cm usepr Ar use_prefix
.Cm up_uselen Ar use_prefix_len
.Op Ar parameters
.Op Cm add | change | setglobal
.Nm
.Fl a
.Op Fl d
.Op Fl u
.Cm matchpr Ar match_prefix
.Cm mp_len Ar match_prefix_len
.Cm usepr Ar use_prefix
.Cm up_uselen Ar use_prefix_uselen
.Op Ar parameters
.Op Cm add | change | setglobal
.Ek
.Sh 解説
.Nm
は、ネットワークインタフェースにプレフィックスを割り当てたり、
ネットワークインタフェースのプレフィックスを
リナンバリング (番号付け直し) するために、使用します。
.Nm
をブート時に使用し、
マシン上に存在する各インタフェースに対し、
ネットワークプレフィックスを定義する必要があります。
また、
複数のインタフェースのプレフィックスや他のプレフィックス関連パラメータを、
後でリナンバリングするためにも、使用可能です。
.Nm
はルータのみに有効なコマンドですから、
使用するには次の設定が必要です。
.Dl % sysctl -w net.inet6.ip6.forwarding=1
net.inet6.ip6.forwarding が 0 に設定されていると、
.Nm
コマンドは
.Er EPERM
エラーで失敗します。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Ar interface
.Ar prefix
を割り当てる対象またはリナンバリング対象の
.Ar interface
を指定します。
本パラメータは
.Dq 名前 ユニット
の形式の文字列であり、例えば
.Dq en0
です。
.It Ar prefix
ネットワークインタフェースに対して
.Ar prefix
を割り当て/削除します。
.It Cm prefixlen Ar len
IPv6 サブネット用識別子として
.Ar len
ビットを
.Ar prefix
中で予約することを指定します。
.Ar len
は整数であることが必要であり、
文法的な理由から 0 から 128 の範囲であることが必要です。
現在の IPv6 割り当て規則下では、この値はほぼ常に 64 です。
本パラメータが省略された場合、64 が使用されます。
.It Cm matchpr Ar match_prefix
.Cm add | change | setglobal
コマンド適用対象の割り当て済みプレフィックスとのマッチングに使用される、
.Ar match_prefix
を指定します。
.It Cm mp_len Ar match_prefix_len
割り当て済みプレフィックスとのマッチングに使用される
.Ar match_prefix
の開始部分を、10 進数のビット数で指定します。
.It Cm mp_minlen Ar match_prefix_minlen
.Ar match_prefix
とマッチ可能なプレフィックスの最短長を、10 進数のビット数で指定します。
.Ar match_prefix_minlen
よりも短いプレフィックス長の割り当て済プレフィックスに対しては、
.Cm add | change | setglobal
は適用されません。
.It Cm mp_maxlen Ar match_prefix_maxlen
.Ar match_prefix
とマッチ可能なプレフィックスの最大長を、10 進数のビット数で指定します。
.Ar match_prefix_manlen
よりも長いプレフィックス長の割り当て済プレフィックスに対しては、
.Cm add | change | setglobal
は適用されません。
.It Cm usepr Ar use_prefix
.Cm add | change | setglobal
コマンドで追加されるプレフィックスとして使用される
.Ar use_prefix
を指定します。
.It Cm up_uselen Ar use_prefix_uselen
.Cm add | change | setglobal
コマンドで追加されるプレフィックスの開始部分にコピーされる
.Ar use_prefix
の開始部分を、10 進数のビット数で指定します。
.It Cm up_keeplen Ar use_prefix_keeplen
.Ar use_prefix
において、
.Ar use_prefix_uselen
で指定された開始部分の直後の中間部分を、10 進数のビット数で指定します。
.Ar match_prefix
とマッチした既存プレフィックスでこれと同じビット位置の連続ビット部分が、
追加されるプレフィックスの同じビット位置にコピーされます。
.It Cm pltime Ar time
追加されるプレフィックスのプレフィックス推奨有効期間を、
.Ar time
に割り当てます。
.Ar time
に有効な値は、10 進数の秒数か、特殊フォーマット "d00h00m00s00" です。
ここで 00 は任意の 10 進数を取り、"d" は日数を、"h" は時間数を、"m" は
分数を、"s" は秒数を意味します。
また、特殊キーワード "infinity" も指定可能です。
.It Cm vltime Ar time
追加されるプレフィックスのプレフィックス最終有効期間を、
.Ar time
に割り当てます。
.Ar time
に有効な値は、
.Cm pltime
と同じです。
.It Cm raf_auto
追加されるプレフィックスに対し、
自律的アドレス自動設定を有効化します。
.It Fl raf_auto
追加されるプレフィックスに対し、
自律的アドレス自動設定を無効化します。
.It Cm raf_onlink
追加されるプレフィックスに、
割り当てられるインタフェースに対するオンリンク属性を持たせます。
.It Fl raf_onlink
追加されるプレフィックスに、
割り当てられるインタフェースに対するオンリンク属性を持たせません。
.It Cm rrf_decrprefd
pltime の減算を有効化します。
.It Fl rrf_decrprefd
pltime の減算を無効化します。
.It Cm rrf_decrvalid
vltime の減算を有効化します。
.It Fl rrf_decrvalid
vltime の減算を無効化します。
.El
.Sh 診断
メッセージが、
指定したインタフェースが存在しないこと、
要求されたプレフィックスが未知であること、
特権の無いユーザがインタフェース設定を変えようとしたことのいずれかを示します。
.Sh 関連項目
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr rc 8 ,
.Xr routed 8
.Rs
.%A M. Crawford
.%T Router Renumbering for IPv6
.%R internet-draft
.%N draft-ietf-ipngwg-router-renum-05.txt
.Re
.Sh 歴史
.Nm
コマンドは WIDE/KAME IPv6 プロトコルスタックキットではじめて登場しました。
.Pp
KAME Project (http://www.kame.net/) スタックを基とする
IPv6 および IPsec のサポートは、
.Fx 4.0
で始めて組み込まれました。
