freebsd/freebsd-doc/ja_JP.eucJP/man/man8/prefix.8
.\"	$KAME: prefix.8,v 1.6 2001/02/04 05:20:48 jinmei Exp $
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/prefix/prefix.8,v 1.2.2.9 2002/03/10 08:21:14 ume Exp %
.\"
.\" $FreeBSD$
.Dd October 10, 1998
.Dt PREFIX 8
.Os
.Sh 名称
.Nm prefix
.Nd ネットワークインタフェースのプレフィックスを設定する
.Sh 書式
.Nm
.Bk -words
.Ar interface prefix
.Ek
.Bk -words
.Op Cm set | delete
.Ek
.Sh 解説
.Nm
は、ネットワークインタフェースにプレフィックスを割り当てるために使用します。
現在、本コマンドは
.Xr ifconfig 8
のフロントエンドであり、使用はお勧めしません。
.Sh 関連項目
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr rc 8
.Sh 歴史
.Nm
コマンドは WIDE/KAME IPv6 プロトコルスタックキットではじめて登場しました。
以前、本コマンドはインタフェース識別子とは別にプレフィックスを
操作、すなわちプレフィックスの再番号割り当てのために使用されていました。
しかしながら、この操作機構はカーネル内の伝統的なアドレス管理エンジンに
とって不都合であることが分かってきました。
このため、KAME 開発者は 2001 年 2 月に、
プレフィックス操作機構を無効化し、
アドレス/プレフィックス操作全体を明確化することを決定しました。
それ以来、本コマンドはほぼ廃止される予定のものとなっています。
現在、全ユーザは
.Xr ifconfig 8
を使用すべきです。
.Pp
KAME Project (http://www.kame.net/) スタックを基とする
IPv6 および IPsec のサポートは、
.Fx 4.0
で始めて組み込まれました。
