freebsd/freebsd-doc/ja_JP.eucJP/man/man8/procctl.8
.\" %Id: procctl.8,v 1.3 1998/01/05 07:19:14 charnier Exp %
.\" jpman %Id: procctl.8,v 0.0 1998/09/12 16:02:39 horikawa Stab %
.Dd Nov 23, 1997
.Dt PROCCTL 1
.Os FreeBSD
.Sh NAME
.Nm procctl
.Nd clear procfs event flags
.Sh SYNOPSIS
.Nm procctl
.Ar command
.Op Ar ...
.Sh DESCRIPTION
.Nm Procctl
clears the
.Xr procfs 5
event mask used by
.Xr truss 1 .
This can be used in the event that a process is left stranded, since
the
.Xr procfs 5
events result in a non-killable process.
The options are a list of process ID's;
.Nm
goes through the list and clears the event masks for each specified process.
.Sh SEE ALSO
.Xr truss 1 ,
.Xr procfs 5
.Sh HISTORY
The
.Nm
command was written by
.An Sean Eric Fagan
for
.Bx Free .
