freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pstat.8
.\" Copyright (c) 1980, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)pstat.8	8.5 (Berkeley) 5/13/94
.\" %FreeBSD: src/usr.sbin/pstat/pstat.8,v 1.19.2.10 2002/07/12 09:12:49 des Exp %
.\"
.\" $FreeBSD$
.\"
.Dd October 7, 1995
.Dt PSTAT 8
.Os
.Sh 名称
.Nm pstat ,
.Nm swapinfo
.Nd システムデータ構造体を表示する
.Sh 書式
.Nm
.Op Fl Tfknst
.Op Fl M Ar core
.Op Fl N Ar system
.Pp
.Nm swapinfo
.Op Fl k
.Op Fl M Ar core
.Op Fl N Ar system
.Sh 解説
.Nm
は、オープンしているファイルのエントリ・
スワップ領域の利用状況・端末の状態・vnode データ構造体
を表示します。
.Pp
.Nm swapinfo
という名前で起動されると
.Fl s
オプションが指定されたことになり、このときは
.Fl k
オプションだけを指定することができます。
.Pp
オプションは以下の通りです:
.Bl -tag -width indent
.It Fl n
デバイスを表示するときに、名前ではなくデバイスのメジャー番号と
マイナ番号を使用します。
.It Fl k
.Ev BLOCKSIZE
環境変数での設定に関わらず、容量の表示をキロバイト単位
で行います。
.It Fl T
種々のシステムテーブルについて使用スロットと空きスロットの
数を表示します。システムの負荷が非常に重いとき、
システムテーブルがどれくらいの大きさになっているかを調べる
のに役立ちます。
.It Fl f
次のようなヘッダとともに、オープンしているファイルのテーブル
を表示します:
.Bl -tag -width indent
.It LOC
このテーブルエントリの core 中における位置
.It TYPE
このテーブルエントリが指すオブジェクトの型
.It FLG
その他の状態。以下のように記号化されています:
.Pp
.Bl -tag -width indent -compact
.It R
読み込み用にオープンされている
.It W
書き込み用にオープンされている
.It S
共有ロックが存在している
.It X
排他的ロックが存在している
.It I
データの準備ができたらプロセスグループにシグナルを送る
.It D
.Dv VDOOMED
.It F
.Dv VFREE
.It b
.Dv VTBFREE
.It O
.Dv VONWORKLST
.It M
.Dv VMOUNT
.El
.It CNT
オープンされたこのファイルのことを知っているプロセスの数
.It MSG
このファイルに向けられているメッセージの数
.It DATA
このファイルに関する vnode テーブルエントリもしくはソケット構造体の位置
.It OFFSET
ファイルオフセット
.Pf ( Xr lseek 2
参照)
.El
.It Fl s
カーネルに登録されたすべてのスワップ領域について、
利用状況に関する情報を表示します。第 1 の欄はパーティションのデバイス名
です。次の欄はそのパーティションで利用できる領域全体の大きさです。
.Ar Used
の欄は、現在使われているブロックの合計の大きさを示しています。
.Ar Available
の欄は、各パーティションに残っている領域の大きさを示しています。
.Ar Capacity
は領域の何%が使われているかを示します。
.Pp
2 つ以上のパーティションをスワップ領域としてシステムに
設定している場合は、すべての項目について最後の行に合計が
報告されます。
.Pp
.Fl ss
のようにオプションを再度指定すると、
スワップのビットマップ/ラディックスツリーの詳細を、システムは表示します。
.It Fl t
次のようなヘッダとともに、端末のテーブルを表示します。
.Bl -tag -width indent
.It RAW
raw な入力キューにある文字数
.It CAN
正規化された入力キューにある文字数
.It OUT
出力キューにある文字数
.It MODE
.Xr tty 4
を参照
.It ADDR
物理デバイスアドレス
.It DEL
正規化された入力キューにある区切り文字(改行)の数
.It COL
端末の計算した列の位置
.It STATE
その他の状態。以下のように記号化されています:
.Pp
.Bl -tag -width indent -compact
.It T
delay がタイムアウトしようとしている
.It O
オープンしている
.It F
DMA 中に出力キューがフラッシュされた
.It C
キャリアがオン
.It c
接続している
.It B
出力中のためビジー
.It A
プロセスは出力キューに空きができるのを待っている
.It a
プロセスは出力の完了を待っている
.It X
排他的な利用のためにオープンしている
.It S
出力が停止した (ixon フロー制御の場合)
.It m
出力が停止した (carrier フロー制御の場合)
.It o
出力が停止した (CTS フロー制御の場合)
.It d
出力が停止した (DSR フロー制御の場合)
.It K
入力が停止した
.It Y
入力イベントの際に SIGIO を送る
.It D
小文字 (lowercase) の
.Ql \e
が動作する状態
.It E
PRTRUBのため
.Ql \e.../
の中にいる
.It L
次の文字はリテラルである
.It P
中断された入力を再タイプしている (PENDIN)
.It N
タブ幅を数えている、FLUSHO を無視する
.It l
ブロックモード入力ルーチンは使用中
.It s
i/o が snoop された
.It Z
接続が失われた
.El
.It SESS
セッション構造体のカーネル内アドレス
.It PGID
この端末を制御端末としているプロセスグループ
.It DISC
回線規約;
.Ql term
(TTYDISC の場合),
.Ql ntty
(NTTYDISC の場合),
.Ql tab
(TABLDISC の場合),
.Ql slip
(SLIPDISC の場合),
.Ql ppp
(PPPDISC の場合)
のいずれか
.El
.It Fl M
デフォルトの
.Pa /dev/kmem
の代りに、指定したコアから名前リストに関連する値を取得する。
.It Fl N
デフォルトの
.Pa /kernel
の代りに、指定したシステムから名前リストを取得する。
.El
.Sh 関連ファイル
.Bl -tag -width /dev/memxxx -compact
.It Pa /kernel
名前リスト
.It Pa /dev/mem
デフォルトのテーブル情報源
.El
.Sh 関連項目
.Xr ps 1 ,
.Xr systat 1 ,
.Xr stat 2 ,
.Xr fs 5 ,
.Xr iostat 8 ,
.Xr vmstat 8
.Rs
.%T UNIX Implementation
.%A K. Thompson
.Re
.Sh バグ
.Tn NFS
スワップサーバはサポートしていません。
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
から登場しました。
