freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pwd_mkdb.8
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)pwd_mkdb.8	8.1 (Berkeley) 6/6/93
.\" jpman %Id: pwd_mkdb.8,v 1.3 1997/08/27 12:36:09 horikawa Stab %
.\"
.Dd June 6, 1993
.Dt PWD_MKDB 8
.Os
.Sh 名称
.Nm pwd_mkdb
.Nd パスワードデータベースを構築する
.Sh 書式
.Nm pwd_mkdb
.Op Fl c
.Op Fl p
.Op Fl d Ar directory
.Op Fl u Ar username
.Ar file
.Sh 解説
.Nm
は、指定されたファイルから
.Xr db 3
スタイルの、セキュリティのしっかりしたデータベースと
そうでないデータベースの 2 つを構築します。
そして、これらのデータベースは、それぞれ
.Pa /etc/spwd.db
と
.Pa /etc/pwd.db
にインストールされます。
このファイルは、
.Pa /etc/master.passwd
にインストールされます。このファイルは
正しいフォーマットでなければなりません (
.Xr passwd 5 
を参照) 。このシステムで使われるフォーマットは、旧来の
バージョン 7 スタイルのフォーマットとは異なるので注意を要します。
.Pp
オプションは以下の通りです。
.Bl -tag -width flag
.It Fl c
パスワードファイルが正しいフォーマットかどうかをチェックします。
どのファイルも変更、追加、削除を行ないません。
.It Fl p
バージョン 7 スタイルのパスワードファイルを作成し、
.Pa /etc/passwd
にインストールします。
.It Fl d Ar directory
.Pa /etc
の代わりに、指定された先のディレクトリにデータベースを保存します。
.It Fl u Ar username
指定したユーザのレコードだけ更新します。
単一ユーザに対してのみ作用するユーティリティは、このオプションを使用し、
データベース全体を再構築するオーバヘッドを避けることが出来ます。
.El
.Pp
2 つのデータベースの違いは、安全なバージョンでは、ユーザのパスワードが
暗号化されて入っており、安全でないバージョンでは、パスワードが ``*'' と
なっていることです。
.Pp
このデータベースは、 C ライブラリパスワードルーチンに使われます (
.Xr getpwent 3
を参照) 。
.Pp
.Nm
は成功したときは 0 を返し、失敗したときは 0 以外を返します。
.Sh ファイル
.Bl -tag -width Pa -compact
.It Pa /etc/pwd.db
セキュリティのないパスワードデータベースファイル
.It Pa /etc/pwd.db.tmp
一時ファイル。
.It Pa /etc/spwd.db
セキュリティのあるパスワードデータベースファイル。
.It Pa /etc/spwd.db.tmp
一時ファイル。
.It Pa /etc/master.passwd
現在のパスワードファイル。
.It Pa /etc/passwd
バージョン 7 フォーマットのパスワードファイル。
.El
.Sh バグ
パスワードファイルのアトミック (atomic; 不可分) な更新が必要なので、
.Nm
は、インストールに
.Xr rename 2
を使います。
しかし、コマンドラインで指定されたファイルが
.Pa /etc
ディレクトリと同じファイルシステム上に存在しなければなりません。
.Pp
複数の人が、
.Nm
を同時に異なるパスワードファイルに対して走らせると、
明らかにレース (race; 競合) になってしまいます。
.Nm
のフロントエンドである
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr vipw 8
では、この問題を避けるために必要なロック操作を行います。
.Sh 可搬性
以前のバージョンのシステムは、
.Nm pwd_mkdb ,
.Xr mkpasswd 8
と同様のプログラムを持っており、それはパスワードファイルに対して
.Xr dbm 3
スタイルのデータベースを構築しましたが、
これをインストールするために呼ぶプログラムに依存していました。
このプログラムは、以前のプログラムのユーザが機能の変化で
驚かないように名前が変えられました。
.Sh 関連項目
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr db 3 ,
.Xr getpwent 3 ,
.Xr passwd 5 ,
.Xr vipw 8
