freebsd/freebsd-doc/ja_JP.eucJP/man/man8/pxeboot.8
.\" Copyright (c) 1999 Doug White
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sys/boot/i386/pxeldr/pxeboot.8,v 1.7 2002/12/12 17:25:59 ru Exp %
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.\" $FreeBSD$
.Dd May 1, 2000
.Dt PXEBOOT 8
.Os
.Sh 名称
.Nm pxeboot
.Nd プリブート実行環境 (PXE) ブートローダ
.Sh 解説
.Nm
ブートローダは、システムの第 3 段階ブートストラップ
.Xr loader 8
の修正バージョンであり、
Intel のプリブート実行環境 (Preboot Execution Environment, PXE) システムで
動作するように構築されたものです。
PXE は、スマートなブート ROM の形態をとり、
Intel EtherExpress Pro/100 や 3Com 3c905c イーサネットカード、
それにイーサネットを装備した Intel マザーボードに組み込まれています。
PXE は、DHCP コンフィギュレーションをサポートし、
低レベルの NIC アクセスサービスを提供します。
.Nm
は、カーネルやモジュールそれに他のファイル群を、
UDP 上の NFS または TFTP 経由で (これはコンパイル時オプションで選択します)
取り出します。
.Nm
とメモリファイルシステムイメージ
あるいは NFS マウントしたルートファイルシステムと組み合わせることで、
ディスクレスマシンを容易に、EEPROM 焼き器なしで構築することができます。
.Pp
.Nm
バイナリは、DHCP サーバのコンフィギュレーションファイル中に指定することで、
他のブートファイルと同様にロードされます。
.\" 1.1.2.3 対応にともない削除
.\" しかし、PXE がサーバ応答を認識するには特別な DHCP オプションが必要です。
ISC DHCP v2 サーバ向けのコンフィギュレーションのサンプルを以下に示します:
.Bd -literal -offset indent
option domain-name "example.com";
option routers 10.0.0.1;
option subnet-mask 255.255.255.0;
option broadcast-address 10.0.0.255;
option domain-name-servers 10.0.0.1;
server-name "DHCPserver";
server-identifier 10.0.0.1;

default-lease-time 120;
max-lease-time 120;

subnet 10.0.0.0 netmask 255.255.255.0 {
       filename "pxeboot";
       range 10.0.0.10 10.0.0.254;
}

.Ed
.Nm
は、ディレクティブ
.Va next-server
および
.Va option root-path
を、サーバおよびファイル要求の NFS マウントパスとしてそれぞれ認識するか、
あるいは TFTP 要求を送るサーバとして認識します。
.Nm
は、他のファイルをロードする前に、指定したサーバから
.Pa /boot/loader.rc
を読み込むことを想定していることに注意してください。
.Pp
その他の点では、
.Nm
は
.Xr loader 8
と同じように振舞います。
.Pp
PXE はまだ成熟したものではないため、ファームウェアのバージョンによっては
正常に動作しない可能性があります。
.Nm
ブートローダは Intel ファームウェア version 0.99 上で綿密にテストされましたが、
より新しい 2.0 ファームウェアのプレリリースバージョンでは
問題があることが判明しています。
デバイス製造者の最新の安定リリースをチェックしてください。
.Pp
Intel の PXE 仕様および Wired for Management (WfM) システムに関する
更に詳細な情報については、
.Li http://developer.intel.com/ial/wfm/
を参照してください。
.Sh 関連項目
.Xr loader 8
.Sh 歴史
.Nm
ブートローダは
.Fx 4.1
に初めて登場しました。
.Sh 作者
.An -nosplit
.Nm
ブートローダの作者は
.An John Baldwin Aq jhb@FreeBSD.org
および
.An Paul Saab Aq ps@FreeBSD.org
です。このマニュアルページの著者は
.An Doug White Aq dwhite@FreeBSD.org
です。
