freebsd/freebsd-doc/ja_JP.eucJP/man/man8/quot.8
.\" Copyright (C) 1994 Wolfgang Solfrank.
.\" Copyright (C) 1994 TooLs GmbH.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by TooLs GmbH.
.\" 4. The name of TooLs GmbH may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY TOOLS GMBH ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL TOOLS GMBH BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
.\" OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
.\" ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/quot/quot.8,v 1.20 2003/02/18 03:34:32 trhodes Exp %
.\"
.\" $FreeBSD$
.\"
.Dd February 8, 1994
.Dt QUOT 8
.Os
.Sh 名称
.Nm quot
.Nd 各ユーザの利用しているディスク領域を表示する
.Sh 書式
.Nm
.Op Fl acfhknv
.Op Ar filesystem ...
.Sh 解説
.Nm
ユーティリティは、
各ローカルユーザのディスク利用に関する統計情報を集めるために使われます。
.Pp
以下のオプションが利用可能です。
.Bl -tag -width indent
.It Fl a
全てのマウントされたファイルシステムに関する統計情報を与えます。
.It Fl c
一行毎に 3 つのカラムを使って、ファイルあたりのブロック数と、
この分類に含まれるファイルの数と、このサイズ以下の
ファイルのブロック総数を集計します。
.It Fl f
個々のユーザに対して、ファイル数と利用されているスペースを表示します。
.It Fl h
個々のファイルのサイズに基づいて、ブロック数を推定します。
これは、 ( ファイル中の穴を計算しないので ) 正しい結果を与えないうえ、
高速でもないので、お勧めしません。
.It Fl k
報告する数値をキロバイト数にします。
デフォルトでは、全てのサイズは 512 バイト / ブロックで報告されます。
.It Fl n
標準入力から inode の一覧を (いくつかのオプションデータを加えて 1 行で)
与えることで、個々のファイルに対して持ち主を
( 入力行で与えられた残りの情報と共に ) 表示します。
これは歴史的にはパイプ中で以下のように使われました。
.Bd -literal -offset indent
.\" ncheck filesystem | sort +0n | quot -n filesystem
ls -i | sed -e 's,^  *,,' | sort -k 1n | quot -n filesystem
.Ed
.Pp
ファイルの報告とその持ち主を手に入れます。
.It Fl v
デフォルトの出力に加えて、30, 60, 90 日間アクセスされていないファイルの数
を報告します。
.El
.Sh 環境変数
.Bl -tag -width BLOCKSIZE
.It Ev BLOCKSIZE
環境変数
.Ev BLOCKSIZE
が設定されており、
.Fl k
オプションが指定されていない時、ブロックカウントはこのブロックサイズの単位
で表示されます。
.El
.Sh バグ
.Xr ncheck
(前記の例の
.Nm ls Fl i
よりはるかに使える) は
.Fx
には存在しません :-)
.Sh 関連項目
.Xr df 1 ,
.Xr quota 1 ,
.Xr getmntinfo 3 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh 歴史
この
.Nm
の実装は、
.An Wolfgang Solfrank
/ TooLs GmbH
によって行われました。
