freebsd/freebsd-doc/ja_JP.eucJP/man/man8/quotaon.8
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)quotaon.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/usr.sbin/quotaon/quotaon.8,v 1.4.2.1 2000/12/08 15:28:47 ru Exp %
.\"
.\" jpman %Id: quotaon.8,v 1.2 1997/05/15 08:52:36 mitchy Stab %
.\"
.Dd December 11, 1993
.Dt QUOTAON 8
.Os BSD 4.2
.Sh 名称
.Nm quotaon ,
.Nm quotaoff
.Nd ファイルシステム割り当て制限のオンとオフ
.Sh 書式
.Nm
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Nm quotaoff
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm quotaoff
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Sh 解説
.Nm
は、システムにファイルシステムの割り当て制限をオンにするように通
告します。
.Nm quotaoff
は、システムに指定されたファイルシステムのす
べての割り当て制限をオフにするように通告します。指定される
ファイルシステムは
.Pa /etc/fstab
にエントリがあり、かつ、マウントされていなければいけま
せん。
.Nm
は、指定されたファイルシステムのルートディレクトリに割り当て制限を書いた
ファイル
.Pa quota.user
と
.Pa quota.group
があるものとして動作します。このデフォルトのファイル名は
.Pa /etc/fstab
により変更することができます。デフォルトでユーザ
とグループの両方に対する割り当て制限が開始されます。
.Pp
オプションは以下のとおりです:
.Bl -tag -width indent
.It Fl a
ファイルシステム名のかわりに指定されると、
.Nm Ns / Ns Nm quotaoff
は 
.Pa /etc/fstab
に読み書き可能で割り当て制限が指定されているファイルシステム
をすべてオン/オフします。デフォルトでは、
.Pa /etc/fstab
で指定されている制限のみがオンになります。
.It Fl g
.Pa /etc/fstab
にグループ割り当て制限が指定してあるもののみオン/オフします。
.It Fl u
.Pa /etc/fstab
にユーザ割り当て制限が指定してあるもののみオン/オフします。
.It Fl v
.Nm
と
.Nm quotaoff
が各ファイルシステムの割り当て制限をオン/オフす
るときにメッセージを表示します。
.El
.Pp
.Fl g
と
.Fl u
の両方を指定すると、デフォルトの動作と同じになります。
.Sh 関連ファイル
.Bl -tag -width quota.group -compact
.It Pa quota.user
ファイルシステムのルートにあるユーザ割り当て制限に関するデータ
.It Pa quota.group
ファイルシステムのルートにあるグループ割り当て制限に関するデータ
.It Pa /etc/fstab
ファイルシステムの名前と位置を読み取る
.El
.Sh 関連項目
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr repquota 8
.Sh 歴史
.Nm
は
.Bx 4.2
で追加されました。
