freebsd/freebsd-doc/ja_JP.eucJP/man/man8/quotacheck.8
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)quotacheck.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/quotacheck/quotacheck.8,v 1.6.2.2 2001/03/05 19:33:54 ru Exp %
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt QUOTACHECK 8
.Os BSD 4.2
.Sh 名称
.Nm quotacheck
.Nd ファイルシステムの割り当て制限の一貫性の検査を行う
.Sh 書式
.Nm
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem
.Ar
.Nm
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Sh 解説
.Nm
は各ファイルシステムを調べ、現在のディスク使用量のテーブルを作成し、こ
れをディスクに保存されている割り当て制限情報ファイルと比較します。違い
が発見された場合、割り当て制限情報ファイルとシステムが持っている割り当
て制限情報のコピー(アクティブなファイルシステムを検査した場合)を更新し
ます。デフォルトでは、ユーザ割り当て制限とグループ割り当て制限の両方が
検査されます。
.Pp
使用可能なオプションは以下の通りです:
.Bl -tag -width indent
.It Fl a
ファイルシステム名の代りに
指定されると、
.Nm
は、
.Pa /etc/fstab
に読み書き可能で割り当て制限ありと設定されているファイルシステムをすべ
て検査します。デフォルトでは、
.Pa /etc/fstab
に書かれている種類の割り当て制限のみを検査します。
.It Fl g
.Pa /etc/fstab
にグループ割り当て制限が指定してあるもののみ検査します。
.It Fl u
.Pa /etc/fstab
にユーザ割り当て制限が指定してあるもののみ検査します。
.It Fl v
計算した値と記録されていた割り当て制限ファイルとの違いを報告します。
.El
.Pp
.Fl g
と
.Fl u
の両方を指定すると、デフォルトの動作と同じになります。
ファイルシステム上では、
.Xr fsck 8
と同様に
.Pa /etc/fstab
の中のパス番号を使って、並行して複数のファイルシステムを検査します。
.Pp
通常
.Nm
は何も表示しません。
.Pp
.Nm
は、チェックされるファイルシステムのルートディレクトリに割り当て制限を
書いたファイル
.Pa quota.user
と
.Pa quota.group
があるものとして動作します。このデフォルトのファイル名は
.Pa /etc/fstab
により変更することができます。もし、割り当て制限を書いたファイル
がなければ、
.Nm
が作成します。
これらのファイルは、
.Xr edquota 8
ユーティリティで編集すべきです。
.Pp
.Nm
は、通常
.Pa /etc/rc
からブート時に、
.Xr quotaon 8
が割り当て制限を開始する前に実行されます (
.Xr rc 8
参照)。
rc 起動手続きは、
.Pa /etc/rc.conf
変数
.Ar check_quotas
で制御されます。
.Pa /etc/rc
でこの機能を有効にすると、
.Pa /etc/rc.conf
中の
.Ar enable_quotas 
変数で、クォータ手続きも有効にすることが必要なことに注意してください。
.Pp
.Nm
は、各ユーザごとのディスク使用量を計算するために、rawデバイス
をアクセスします。そのため、
.Nm
の実行中にチェックされるファイルシステムを使用してはいけません。
.Sh 関連ファイル
.Bl -tag -width quota.group -compact
.It Pa quota.user
ファイルシステムのルートにあるユーザ割り当て制限に関するデータ
.It Pa quota.group
ファイルシステムのルートにあるグループ割り当て制限に関するデータ
.It Pa /etc/fstab
ファイルシステムの名前と位置を読み取る
.El
.Sh 関連項目
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr fsck 8 ,
.Xr quotaon 8 ,
.Xr repquota 8
.Sh 歴史
.Nm
は
.Bx 4.2
で追加されました。
