freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rarpd.8
.\" @(#) %FreeBSD: src/usr.sbin/rarpd/rarpd.8,v 1.9.2.2 2000/12/27 16:23:28 ru Exp % (LBL)
.\"
.\" Copyright (c) 1990, 1991, 1993 The Regents of the University of
.\" California. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that: (1) source code distributions
.\" retain the above copyright notice and this paragraph in its entirety, (2)
.\" distributions including binary code include the above copyright notice and
.\" this paragraph in its entirety in the documentation or other materials
.\" provided with the distribution, and (3) all advertising materials mentioning
.\" features or use of this software display the following acknowledgement:
.\" ``This product includes software developed by the University of California,
.\" Lawrence Berkeley Laboratory and its contributors.'' Neither the name of
.\" the University nor the names of its contributors may be used to endorse
.\" or promote products derived from this software without specific prior
.\" written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\" $FreeBSD$
.\"
.Dd July 19, 1993
.Dt RARPD 8
.Os
.Sh 名称
.Nm rarpd
.Nd 逆 ARP デーモン 
.Sh 書式
.Nm
.Op Fl afsv
.Op Ar interface
.Sh 解説
.Nm
は、
.Ar interface
に対応するイーサネットについて、逆 ARP 要求に対するサービスを提供します。
要求を受け付けると、
.Nm
はイーサネットアドレスより IP アドレス を、ホスト名を経由して対応づけます。
ホスト名に関しては、
.Xr ethers 5
データベースと
.Xr hosts 5
データベースの両者に登録されている必要があります。もしホスト名がどちらにも登録
されてない場合、変換処理は実行されず、返答も行われません。
.Pp
デフォルトでは、(
.Nm
が動作している) サーバがターゲットを
「ブート」できる場合にのみ要求が受け付けられます;
これはすなわち、
.Pa /tftpboot/\fIipaddr\fP*
に該当するファイルもしくはディレクトリ (ここで、
.Pa ipaddr
は、ターゲットの IP アドレスを16進数で記したものです)
が存在することを意味します。
例えば、IP アドレス 204.216.27.18 は、
.Pa /tftpboot/CCD81B12
、
.Pa /tftpboot/CCD81B12.SUN3
、あるいは、
.Pa /tftpboot/CCD81B12-boot
が存在する場合のみ、返答されます。
ただし、
.Fl s
フラグが指定された場合は、この制約はなくなります(下記参照)。
.Pp
通常の動作においては、
.Nm
は自分自身を fork し、バックグラウンドプロセスとして
実行します。例外およびエラーについては、発生事象を
.Xr syslog 3
を通じて報告します。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Fl a
システムに接続されているすべてのイーサネットについて listen() を行ないます。
本オプションが指定されてない場合は、ネットワークインタフェースを指定する必要が
あります。
.It Fl f
.Nm rarpd
をフォアグラウンドプロセスとして起動します。
.It Fl s
.Pa /tftpboot/\fIipaddr\fP*
のあるなしにかかわらず、
イーサネットアドレスと IP アドレスの対応付けがあれば全ての RARP 要求に対して
応答します。
.It Fl v
詳細なログを出力します。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/ethers -compact
.It Pa /etc/ethers
.It Pa /etc/hosts
.It Pa /tftpboot
.El
.Sh 関連項目
.Xr bpf 4
.Pp
RFC 903: Finlayson, R.; Mann, T.; Mogul, J.C.; Theimer, M.  Reverse Address 
Resolution Protocol.  1984 June; 4 p.
.Sh 作者
.An -nosplit
.An Craig Leres Aq leres@ee.lbl.gov
および
.An  Steven McCanne Aq mccanne@ee.lbl.gov .
Lawrence Berkeley Laboratory, University of California, Berkeley, CA.
.Sh バグ
.Nm
は、
.Pa /etc/ethers
で発見されたホスト名の解決に DNS を使用する事も出来ます。
このホスト名が DNS には登録されていないが、
.Pa /etc/hosts
には存在する場合、
DNS への問い合わせのため、RARP の応答に時間がかかる事になります。
この様な場合は、
.Pa /etc/host.conf
にて
.Pa /etc/hosts
を先に検索するように設定する事をお薦めします。
