freebsd/freebsd-doc/ja_JP.eucJP/man/man8/raycontrol.8
'\"
'\"Copyright (C) 2000
'\"Dr. Duncan McLennan Barclay, dmlb@ragnet.demon.co.uk.
'\"
'\" All rights reserved.
'\"
'\"Redistribution and use in source and binary forms, with or without
'\"modification, are permitted provided that the following conditions
'\"are met:
'\"1. Redistributions of source code must retain the above copyright
'\"   notice, this list of conditions and the following disclaimer.
'\"2. Redistributions in binary form must reproduce the above copyright
'\"   notice, this list of conditions and the following disclaimer in the
'\"   documentation and/or other materials provided with the distribution.
'\"3. Neither the name of the author nor the names of any co-contributors
'\"   may be used to endorse or promote products derived from this software
'\"   without specific prior written permission.
'\"
'\"THIS SOFTWARE IS PROVIDED BY DUNCAN BARCLAY AND CONTRIBUTORS ``AS IS'' AND
'\"ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
'\"IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
'\"ARE DISCLAIMED.  IN NO EVENT SHALL DUNCAN BARCLAY OR CONTRIBUTORS BE LIABLE
'\"FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
'\"DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
'\"OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
'\"HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
'\"LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
'\"OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
'\"SUCH DAMAGE.
'\"
'\" %FreeBSD: src/usr.sbin/raycontrol/raycontrol.8,v 1.5.2.1 2001/03/06 20:14:50 dmlb Exp %
'\"
'\"
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu> All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/raycontrol/raycontrol.8,v 1.5.2.1 2001/03/06 20:14:50 dmlb Exp %
.\"
.Dd March 21, 2000
.\" jpman %Id: raycontrol.8,v 1.3 2001/03/24 02:49:43 horikawa Stab %
.Dt RAYCONTROL 8
.Os FreeBSD
.Sh 名称
.Nm raycontrol
.Nd Raytheon Raylink/Webgear Aviator デバイスの設定
.Sh 書式
.Nm
.Fl i Ar iface Op Fl o
.Nm
.Fl i Ar iface Fl t Ar tx rate
.Nm
.Fl i Ar iface Fl n Ar network name
.Nm
.Fl i Ar iface Fl c Ar ap status
.Nm
.Fl i Ar iface Fl p Ar port type
.Nm
.Fl i Ar iface Fl m Ar mac address
.Nm
.Fl i Ar iface Fl d Ar max data length
.Nm
.Fl i Ar iface Fl r Ar RTS threshold
.Nm
.Fl i Ar iface Fl f Ar hopset
.Nm
.Fl i Ar iface Fl P Ar 0|1
.Nm
.Fl i Ar iface Fl S Ar max_sleep_duration
.Nm
.Fl i Ar iface Fl Z Ar zero signal cache
.Nm
.Fl i Ar iface Fl C Ar display signal cache
.Sh 解説
.Nm
コマンドは
.Xr ray 4
ドライバを介し、Raylink/Webgear ワイヤレスネットワークデバイスの
動作を制御します。
変更可能なほとんどのパラメータは、このカードが実装している
IEEE 802.11 プロトコルに関連するものです。
これにはステーション名、ステーションの動作がアドホックモードと
インフラストラクチャモードのどちらであるか、アドホックモードでの BBS
もしくはインフラストラクチャモードでの ESS が有効な場合に加入する
サービスセットのネットワーク名が含まれます。
.Nm
コマンドは、これらのパラメータの現在の設定を表示したり、
カードの統計情報カウンタの値をダンプしたりすることもできます。
.Pp
.Nm
に与えられる
.Ar iface
引数は Raylink/Webgear デバイスに関連付けられる論理インタフェース名で
あることが必要です (ray0, ray1 など)。
.Sh オプション
オプションは以下の通りです。
.Bl -tag -width Fl
.It Fl i Ar iface Op Fl o
指定した Raylink/Webgear インタフェースの現在の設定を表示します。
現在のカードの設定をドライバから取り出し、表示します。
このコマンドの結果は、カードの設定のスナップショットです。
.Fl o
フラグを追加することにより
.Nm
は、カードの設定の代わりに統計情報カウンタを表示します。
.It Fl i Ar iface Fl t Ar tx rate
指定したインタフェースの転送レートを設定します。
NIC は 2Mbps の最大転送レートをサポートしています。
次の表は正当な転送レートの設定とそれに対応する転送速度を示します:
.Bl -column "TX レート " "NIC 速度 " -offset indent
.Em "TX レート	NIC 速度"
1	超低速 (0.5Mbps)
2	低速 (1Mbps)
3	中速 (1.5Mbps)
4	高速 (2Mbps)
.El
.Pp
バージョン 4 のファームウェアはこの設定を無視するかも知れません。
IEEE 802.11 標準では 1Mbps か 2Mbps の動作しか許されていないこと、
および一般的に受け入れられている IEEE 802.11 の解釈では 2Mbps は
インフラストラクチャモードでのみ許されていることに注意してください。
.It Fl i Ar iface Fl n Ar network name
このステーションが加入を望んでいるサービスセットの名前を設定します。
.Ar network name
は 32 文字までの長さの任意のテキスト文字列です。
デフォルトの名前は文字列 "NETWORK_NAME" であり、
ステーションはこの名前でデフォルトの Webgear の
アドホックネットワークに接続できるはずです。
.It Fl i Ar iface Fl p Ar port type
指定されたインタフェースの
.Ar port type
を設定します。
.Ar port type
の正当な値は 0 (アドホックモード) と 1 (インフラストラクチャモード) です。
アドホックモードでは、ステーションは直接電波が届く範囲にある
他のステーション (これらもアドホックモードで動作していることが
必要です) と直接通信が可能です。
インフラストラクチャモードでは、ホストはアクセスポイントが
制御するサービスセットと関連付けられることが必要です。
このアクセスポイントはエンドステーション間のトラフィックを中継します。
デフォルトの設定は 0 (アドホックモード) です。
.Pp
アドホックモードの時、現在設定されているホップセット (
.Fl f
オプション参照) に
.Fl n
オプションで指定されるネットワークが存在しない場合、
ステーションはそのネットワーク名の BBS を作成します。
.It Fl i Ar iface Fl m Ar mac address
指定したインタフェースのステーションアドレスを設定します。
.Ar mac address
は、コロンで区切られる 6 つの 16 進数の並びとして指定されます。
例えば 00:60:1d:12:34:56 となります。
これにより新規アドレスがカード上にプログラムされ、
インタフェースも更新されます。
.It Fl i Ar iface Fl d Ar max_data_length
指定したインタフェースの最大転送フレームサイズを設定します。
.Ar max data length
は 350 から 2304 までの任意の数値か、
フラグメンテーションを無効にする -1 が設定できます。
デフォルトは -1 です。
.It Fl i Ar iface Fl r Ar RTS threshold
指定したインタフェースの RTS/CTS の閾値を設定します。
これは RTS/CTS ハンドシェーク境界に使用するバイト数を制御します。
.Ar RTS threshold
は -1 から 2047 までの任意の数値です。
デフォルトは -1 (無効) です。
.It Fl i Ar iface Fl f Ar hopset
指定したインタフェースに電波のホップセットを設定します。
.Ar hopset
は以下の表で示されるような国別コードとして指定することが必要です。
ホップセットにより RF チャネル数とそれらの周波数が変わりますが、
これは各地の当局によって指定される電波規制に依存しています。
.Bl -column "ホップセット ID " "国 " -offset indent
.Em "ホップセット ID	国"
1	アメリカ合衆国
2	ヨーロッパ
3	日本
4	韓国
5	スペイン
6	フランス
7	イスラエル
8	オーストラリア
9	日本 (テスト)
.El
.Pp
カードはどのホップセットでも動作するようプログラムできますが、
その RF 周波数帯を使用している他のユーザ (フランスなどでは軍です) からの
干渉や、他のユーザへの干渉を避けるためにも、
自分の地域のホップセットを使うことは意味のあることです。
.Pp
通信するためには、全てのステーションを同じホップセットに
設定しなければならないことに注意してください。
.It Fl i Ar iface Fl P Ar 0|1
指定したインタフェースの電源管理を有効または無効にします。
電源管理を有効にすると、スリープ/ウェークプロトコルを交互に
使用することによりモバイルステーションの省電力を助けますが、
受信遅延がいくぶん増加します。
デフォルトでは電源管理はオフになっています。
.Pp
電源管理が機能するためには、アクセスポイントとの協調が必要なことに
注意してください。アドホックモードでは電源管理は機能しません。
このパラメータの正当な値は 0 (オフ) と 1 (オン) です。
.It Fl i Ar iface Fl S Ar max_sleep_interval
電源管理が有効な時に使用するスリープ間隔を指定します。
.Ar max_sleep_interval
はミリ秒で指定します。
デフォルトは 100 です。
.It Fl i Ar iface Fl Z
.Nm ray
ドライバ内部で管理される信号強度キャッシュをクリアします。
.It Fl i Ar iface Fl C
.Nm ray
ドライバによって管理されている、キャッシュされた信号強度情報を
表示します。
ドライバは、他のホストから受信したパケットの信号強度とノイズレベルを
保持しています。
インフラストラクチャネットワークでは、キャッシュはアクセスポイントの
信号強度も格納しています。
.Pp
ドライバは、送信時に最適なアンテナを選ぶ際にもキャッシュを使用します。
.El
.Sh 関連項目
.Xr ray 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
コマンドは
.Fx 4.0
ではじめて登場しました。
.Sh 作者
.An -nosplit
.Nm
コマンドは
.An Duncan Barclay Aq dmlb@ragnet.demon.co.uk 
によって書かれました。
これは
.An Bill Paul Aq wpaul@ctr.columbia.edu
によって書かれた
.Nm wicontrol
コマンドを基にしています。
.Sh バグ
.Fl m ,
.Fl P ,
.Fl S
と
.Fl Z
オプションはまだ実装されていません。
テストのためのアクセスポイントがまだ利用できなかったからです。
.Pp
バージョン 5 のファームウェアとはテストしていません。
.Pp
バージョン 4 のファームウェアとでは、ホップセットの変更が
できないかも知れません。
.Pp
.Fl W
オプションはわざとドキュメント化していません。
