freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rbootd.8
.\" Copyright (c) 1988, 1992 The University of Utah and the Center
.\"	for Software Science (CSS).
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Center for Software Science of the University of Utah Computer
.\" Science Department.  CSS requests users of this software to return
.\" to css-dist@cs.utah.edu any improvements that they make and grant
.\" CSS redistribution rights.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rbootd.8    8.2 (Berkeley) 12/11/93
.\"	%Id: rbootd.8,v 1.3.2.1 1997/12/16 07:17:43 charnier Exp %
.\"
.\" Utah $Hdr: rbootd.man 3.1 92/07/06$
.\" Author: Jeff Forys, University of Utah CSS
.\" jpman %Id: rbootd.8,v 1.2 1997/03/31 14:57:40 horikawa Stab %
.\"
.Dd "December 11, 1993"
.Dt RBOOTD 8
.Os
.Sh 名称
.Nm rbootd
.Nd HP 社製ワークステーションのブート要求に対応するブートサーバ
.Sh 書式
.Nm rbootd
.Op Fl ad
.Op Fl i Ar interface
.Op config_file
.Sh 解説
.Nm
ユーティリティは、LAN 上の Hewlett-Packard 社製ワークステーションからの
ブート要求に対するサービスを行います。
全てのブートファイルはブートファイル用のディレクトリになければならず、
さらに、もしクライアントがブートリクエスト中にパス情報をつけていた場合は、
処理する前にそのパスは取り除かれます。デフォルトでは、
.Nm
は, そのコンフィグレーションファイル中にリストされているマシンからの
リクエストにのみ応答します。
.Pp
オプションとしては以下のものがあります:
.Bl -tag -width indent
.It Fl a
どのようなマシンからのブート要求にも応えます。このオプションが設定された
場合は、コンフィギュレーションファイルは無視されます。
.It Fl d
.Nm
をデバッグモードで起動します。受信および送信
されたパケットが端末に表示されるようになります。
.It Fl i Ar interface
指定したインタフェースに対してサービスを行います。
もし指定されていない場合には、
.Nm
はループバック以外のもっとも小さい番号の使用可能なインタフェースを
システムインタフェースリストから探します。
早いもの順で選ぶので、組合せはバラバラになります。
.El
.Pp
.Ar config_file
を指定すれば、 
.Nm
はデフォルトのコンフィギュレーションファイルではなく、こちらのファイルを
使用するようになります。
.Pp
コンフィギュレーションファイルは、各行に個々のマシンの設定を記述した
テキストファイルです。行の先頭は各マシンの Ethernet アドレスで始め、
そのあとにブートファイルの名前をオプションとして記述します。
Ethernet アドレスは 6 オクテッドの値を 16 進数で記述し、
各間を ``:'' で区切ります。
ブートファイルの名前は、ブートファイルディレクトリにあるファイルの名前です。
Ethernet アドレスとブートファイルの名前の間は、空白もしくはコンマで区切ら
なければなりません。
行中の ``#'' より後は無視します。
.Pp
コンフィギュレーションファイルの例を以下に示します:
.Bl -column 08:00:09:0:66:ad SYSHPBSD,SYSHPUX "# vandy (anything)"
.It #
.It # ethernet addr	boot file(s)	comments
.It #
.It 08:00:09:0:66:ad	SYSHPBSD	# snake (4.3BSD)
.It 08:00:09:0:59:5b		# vandy (anything)
.It 8::9:1:C6:75	SYSHPBSD,SYSHPUX	# jaguar (either)
.El
.Pp
.Nm
のログやエラーメッセージは
.Xr syslog 3
を使っています。スタートアップメッセージはつねにログに記録され、
致命的なエラー(もしくは
.Nm
を殺すようなシグナル)
が起こった場合にはサーバの終了メッセージもログに残します。
一般的には、致命的ではないエラーはそれによってひき起こされる動作を
無視するといった形で扱われます。
(例えばコンフィギュレーションファイル中の無効なEthernet アドレスは
その行が無効になる原因となります)。
.Pp
以下のシグナルを
.Xr kill 1
コマンドを使ってサーバプロセスに送ることで、
サーバプロセスに影響を与えることができます:
.Bl -tag -width SIGUSR1 -offset -compact
.It SIGHUP
アクティブな接続を切り、リコンフィグします。
.It SIGUSR1
デバッグモードをオンにします。すでにオンであれば何もしません。
.It SIGUSR2
デバッグモードをオフにします。すでにオフであれば何もしません。
.El
.Sh 関連ファイル
.Bl -tag -width /usr/libexec/rbootd -compact
.It /dev/bpf#
パケットフィルタのデバイス
.It /etc/rbootd.conf
コンフィギュレーションファイル
.It /tmp/rbootd.dbg
デバッグ出力
.It /usr/mdec/rbootd
ブートファイルを置くディレクトリ
.It /var/run/rbootd.pid
.Nm
のプロセス ID
.El
.Sh 関連項目
.Xr kill 1 ,
.Xr socket 2 ,
.Xr signal 3 ,
.Xr syslog 3
.Sh バグ
同一インタフェース上に複数のサーバが走った場合、
同一のパケットに対して各サーバが応答してしまいます。
