freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rc.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rc.8	8.2 (Berkeley) 12/11/93
.\" jpman %Id: rc.8,v 1.3 1997/08/16 13:37:00 horikawa Stab %
.\"	%Id: rc.8,v 1.2.2.1 1997/03/07 04:18:27 mpp Exp %
.\"
.Dd December 11, 1993
.Dt RC 8
.Os BSD 4
.Sh 名称
.Nm rc
.Nd 自動リブート処理とデーモン起動のためのコマンドスクリプト
.Sh 書式
.Nm rc
.Nm rc.local
.Sh 解説
.Nm rc
は自動リブート処理を制御するコマンドスクリプトで、
.Nm rc.local
は特定サイトに特化したコマンドを記述するスクリプトです。
.Pp
自動リブート処理の進行中、
.Nm rc
は
.Em autoboot
を引数として起動されます。
.Nm rc
はその最初の部分で
.Xr fsck 8
を
.Fl p
オプション付きで実行し、
前回のシステムシャットダウンによる些細なディスク不整合を全て「修繕」し、
ハードウェアあるいはソフトウェアの障害から生じた
重大なディスク不整合を調べます。
この自動チェックと修繕がうまくいくと、
.Nm rc
の第二部が開始します。
.Pp
.Nm rc
の第二部は
自動リブート処理が成功した後および
シングルユーザモードのシェルが終了して
.Nm rc
が起動された場合(
.Xr init 8
参照)に実行されます。
この第二部はシステムの全てのデーモンを起動し、
エディタファイルを保存し、
一時ディレクトリ
.Pa /tmp
をクリアします。
.Pp
.Nm rc.local
は
.Nm fsck
の成功後、他のコマンドを実行する直前に実行されます。
通常、
.Nm rc.local
ファイル中の最初のコマンドは
.Xr hostname 1
を用いてマシン名を定義し、
システムクラッシュの結果生成されたコアイメージがあれば
.Xr savecore 8
によってそれを保存します。
後者のコマンドが
.Nm rc.local
に含められているのは、
コアダンプを保存するディレクトリ位置が普通、サイト毎に異なっているからです。
.Pp
伝統に従い、スタートアップファイル
.Nm rc
および
.Nm rc.local
は
.Pa /etc
ディレクトリに置かれます。
.Sh 関連項目
.Xr init 8 ,
.Xr reboot 8 ,
.Xr savecore 8
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
で登場しました。
