freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rc.sendmail.8
.\" Copyright (c) 1995
.\"	Jordan K. Hubbard
.\" Copyright (c) 2002 The FreeBSD Project
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man8/rc.sendmail.8,v 1.6 2002/11/29 11:39:20 ru Exp %
.\"
.\" $FreeBSD$
.Dd March 30, 2002
.Dt RC.SENDMAIL 8
.Os
.Sh 名称
.Nm rc.sendmail
.Nd
.Xr sendmail 8
起動スクリプト
.Sh 解説
.Nm
スクリプトは、
.Xr sendmail 8
を起動するために、ブート時に
.Pa /etc/rc
が使用します。
本スクリプトは
.Xr sendmail 8
固有であることを意図しており、すべての MTA に汎用ではありません。
.Xr rc.conf 5
の
.Va mta_start_script
変数が
.Pa /etc/rc.sendmail
に設定されている場合のみ、本スクリプトが
.Pa /etc/rc
から呼ばれます。
.Pp
.Nm
は、実行すべき処理を指定する、省略可能な引数を取り得ます。
利用可能な処理は次の通りです:
.Bl -tag -width ".Cm restart-mspq"
.It Cm start
MTA と MSP キューランナを開始します。
.It Cm stop
MTA と MSP キューランナを停止します。
.It Cm restart
MTA と MSP キューランナを再開始します。
.It Cm start-mta
MTA だけを開始します。
.It Cm stop-mta
MTA だけを停止します。
.It Cm restart-mta
MTA だけを再開始します。
.It Cm start-mspq
MSP キューランナだけを開始します。
.It Cm stop-mspq
MSP キューランナだけを停止します。
.It Cm restart-mspq
MSP キューランナだけを再開始します。
.El
.Pp
処理を指定しない場合、
.Cm start
が仮定されます。
.Pp
.Nm
スクリプトは、
.Pa Makefile
のターゲット
.Cm start , stop ,
.Cm restart
を実現するために、
.Pa /etc/mail/Makefile
でも使用されます。
.Sh RC.CONF 変数
次の変数が、
.Nm
の動作に影響します。
これらは
.Pa /etc/defaults/rc.conf
で定義され、
.Pa /etc/rc.conf
で変更可能です。
.Bl -tag -width indent
.It Va sendmail_enable
.Pq Vt 文字列
.Dq Li YES
に設定すると、システムブート時に
.Xr sendmail 8
デーモンを起動します。
.Dq Li NO
に設定すると、到着メール監視用に
.Xr sendmail 8
デーモンを起動しません。
これは、
.Xr sendmail 8
デーモンがループバックインタフェースの SMTP ポートを監視することを止めません。
.Dq Li NONE
オプションは価値が低下しており、使用すべきではありません。
将来のリリースでは削除されます。
.It Va sendmail_flags
.Pq Vt 文字列
.Va sendmail_enable
が
.Dq Li YES
の場合、これらは
.Xr sendmail 8
デーモンに渡すフラグとなります。
.It Va sendmail_submit_enable
.Pq Vt ブール値
.Dq Li YES
に設定し
.Va sendmail_enable
を
.Dq NO
に設定すると、
.Va sendmail_flags
の代りに
.Va sendmail_submit_flags
を使用して
.Xr sendmail 8
を実行します。
ローカルホストのみに対して待機する SMTP サービスを介した
ローカルからのメール送信を許可することを意図しています。
これは、
.Xr sendmail 8
をユーザ ID 設定したバイナリとしないために必要です。
.Xr jail 2
システムの中では動作しません。
jail がローカルホストインタフェースへのバインドを許さないからです。
.It Va sendmail_submit_flags
.Pq Vt 文字列
.Va sendmail_enable
が
.Dq Li NO
に設定され、
.Va sendmail_submit_enable
が
.Dq Li YES
に設定された場合、これらは
.Xr sendmail 8
デーモンに渡されるフラグになります。
.It Va sendmail_outbound_enable
.Pq Vt ブール値
.Dq Li YES
に設定し
.Va sendmail_enable
と
.Va sendmail_submit_enable
の両方を
.Dq Li NO
に設定すると、
.Va sendmail_flags
の代りに
.Va sendmail_outbound_flags
を使用して
.Xr sendmail 8
を実行します。
SMTP サービスを待ち受けずに、ローカルのメールキュー管理が
出来るようにすることを意図しています。
.It Va sendmail_outbound_flags
.Pq Vt 文字列
.Va sendmail_enable
と
.Va sendmail_submit_enable
の両方を
.Dq Li NO
に設定し、
.Va sendmail_outbound_enable
を
.Dq Li YES
に設定すると、これらは
.Xr sendmail 8
デーモンに渡されるフラグになります。
.It Va sendmail_msp_queue_enable
.Pq Vt ブール値
.Dq Li YES
に設定すると、システムブート時に、クライアント (MSP) キューランナ
.Xr sendmail 8
デーモンを、起動します。
sendmail 8.12 では、コマンドラインからの送信には別のキューが使用されます。
クライアントキューランナは、
送信キューに何も置き忘れられないことを保証します。
.It Va sendmail_msp_queue_flags
.Pq Vt 文字列
.Va sendmail_msp_queue_enable
を
.Dq Li YES
に設定すると、これらは
.Xr sendmail 8
デーモンに渡されるフラグになります。
.El
.Pp
これらの変数は、
.Xr sendmail 8
の起動方法を次のように決定します:
.Pp
.Bd -literal -offset indent
# MTA
if (${sendmail_enable} == NONE)
        # Do nothing
else if (${sendmail_enable} == YES)
        start sendmail with ${sendmail_flags}
else if (${sendmail_submit_enable} == YES)
        start sendmail with ${sendmail_submit_flags}
else if (${sendmail_outbound_enable} == YES)
        start sendmail with ${sendmail_outbound_flags}
endif

# MSP Queue Runner
if (${sendmail_enable} != NONE &&
    [ -r /etc/mail/submit.cf] &&
    ${sendmail_msp_queue_enable} == YES)
        start sendmail with ${sendmail_msp_queue_flags}
endif
.Ed
.Pp
いかなる
.Xr sendmail 8
デーモンも起動しないようにするには、
.Pa /etc/rc.conf
で次の変数を設定します:
.Bd -literal -offset indent
sendmail_enable="NO"
sendmail_submit_enable="NO"
sendmail_outbound_enable="NO"
sendmail_msp_queue_enable="NO"
.Ed
.Sh 関連項目
.Xr rc.conf 5 ,
.Xr rc 8 ,
.Xr sendmail 8
.Sh 歴史
.Nm
ファイルは、
.Fx 4.6
で登場しました。
