freebsd/freebsd-doc/ja_JP.eucJP/man/man8/reboot.8
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)reboot.8	8.1 (Berkeley) 6/9/93
.\" %FreeBSD: src/sbin/reboot/reboot.8,v 1.10 2000/03/01 11:27:35 sheldonh Exp %
.\"
.\" jpman %Id: reboot.8,v 1.3 1997/06/06 11:35:27 bobson Stab %
.\"
.Dd June 9, 1993
.Dt REBOOT 8
.Os
.Sh 名称
.Nm reboot ,
.Nm halt ,
.Nm fastboot ,
.Nm fasthalt
.Nd システムを停止し、再起動する
.Sh 書式
.Nm halt
.Op Fl nqp
.Nm reboot
.Op Fl dnqp
.Nm fasthalt
.Op Fl nqp
.Nm fastboot
.Op Fl dnqp
.Sh 解説
.Nm halt
と
.Nm
は、ファイルシステムのキャッシュをディスクへ書き出し、
すべての実行中のプロセスに
.Dv SIGTERM
を
(そして、それに続いて
.Dv SIGKILL
を) 送ります。
そして、システムを停止 (
.Nm halt
) したり、再起動 (
.Nm
) したりします。
その動作は
.Xr wtmp 5
ファイルに記入されます。
それはログインのアカウンティングファイルへのシャットダウン記録の書き出し
を含んでいます。
.Pp
オプションとしては以下のものがあります。
.Bl -tag -width indent
.It Fl d
システムへクラッシュダンプ作成を要求します。
本オプションはリブート時のみにサポートされています。
その前に
.Xr dumpon 8
によりダンプデバイスが指定されているのでない限り、無効です。
.It Fl n
システムのキャッシュがディスクへ書き出されません。
このオプションは使用すべきではありません。
.It Fl q
システムは、とにかく速く停止されたり、
再起動されたりします。そしてシステムのキャッシュの破棄だけが行われます (
.Fl n
が指定されなかった場合)。
このオプションは使用すべきではありません。
.It Fl p
システムは可能であれば電源を切ります。
これは、もちろん
.Nm
でも、
.Nm halt
と同じように振る舞うということです。
.El
.Pp
.Nm fasthalt
と
.Nm fastboot
は、それぞれ
.Nm halt
と
.Nm
の単なる別名にすぎません。
.Pp
通常、システムの停止や再起動を要する場合には、
ユーザに事前警告を与えて特定のプログラムを綺麗に停止する
.Xr shutdown 8
を使用します。
.Xr shutdown 8
は、ログインしているユーザにシステム停止の警告を与えます。
.Pp
.Sh 関連項目
.Xr wtmp 5 ,
.Xr boot 8 ,
.Xr dumpon 8 ,
.Xr savecore 8 ,
.Xr shutdown 8 ,
.Xr sync 8
.Sh 歴史
.Nm
コマンドは
.At v6
で追加されました。
