freebsd/freebsd-doc/ja_JP.eucJP/man/man8/renice.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)renice.8	8.1 (Berkeley) 6/9/93
.\" %FreeBSD: src/usr.bin/renice/renice.8,v 1.5.2.4 2001/08/16 13:17:01 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/renice.8,v 1.10 2001/08/10 02:12:55 horikawa Exp $
.\"
.Dd June 9, 1993
.Dt RENICE 8
.Os
.Sh 名称
.Nm renice
.Nd 走行中のプロセスの優先度を変更する
.Sh 書式
.Nm
.Ar priority
.Oo
.Op Fl p
.Ar pid ...
.Oc
.Oo
.Op Fl g
.Ar pgrp ...
.Oc
.Oo
.Op Fl u
.Ar user ...
.Oc
.Sh 解説
.Nm
は、1 つ以上の走行中プロセスのスケジュール優先度を変更します。
priority に後続するパラメータ
.Ar who
は、プロセス ID か、プロセスグループ ID か、ユーザ名として解釈されます。
プロセスグループに対する
.Nm
の実行は、そのグループに属するすべてのプロセスの優先度を変化させます。
ユーザ名に対する
.Nm
の実行は、そのユーザが所有するすべてのプロセスの優先度を変化させます。
デフォルトでは、プロセス ID で指定したプロセスのみが影響を受けます。
.Pp
.Nm
にてサポートされるオプションは以下のとおりです:
.Bl -tag -width Ds
.It Fl g
.Ar who
パラメータをプロセスグループ ID であると解釈させます。
.It Fl u
.Ar who
パラメータをユーザ名であると解釈させます。
.It Fl p
.Ar who
パラメータをプロセス ID であると解釈させます (デフォルト)。
.El
.Pp
たとえば、
.Bd -literal -offset
renice +1 987 -u daemon root -p 32
.Ed
.Pp
は、プロセス ID が 987, 32 のプロセスと、
ユーザ daemon, root が所有するすべてのプロセスの優先度を変更します。
.Pp
スーパユーザ以外のユーザは所有するプロセスについてのみ変更が可能で、
プロセスの ``nice 値'' を 0 から
.Dv PRIO_MAX
(20) の範囲内で単調に増加させることができます。
(これによりシステム管理者による命令が無効になるのを防ぎます。)
スーパユーザは、すべてのプロセスの優先度を
.Dv PRIO_MIN
(\-20) から
.Dv PRIO_MAX
(20) の範囲で自由に変更することができます。
よく用いられる値としては以下のものがあります:
20 (システム内のほかのプロセスすべてが走行しないときのみ走行する)、
0 (``基準'' となるスケジュール優先度)、
適当な負の値 (そのプロセスを素早く実行させる)
.Sh 関連ファイル
.Bl -tag -width /etc/passwd -compact
.It Pa /etc/passwd
ユーザ名とユーザ ID を関連づける
.El
.Sh 関連項目
.Xr nice 1 ,
.Xr rtprio 1 ,
.Xr getpriority 2 ,
.Xr setpriority 2
.Sh バグ
スーパユーザ以外のユーザは、たとえ以前に優先度を下げたプロセスであって
も優先度を上げることはできません。
.Sh 歴史
.Nm
は
.Bx 4.0
で追加されました。
