freebsd/freebsd-doc/ja_JP.eucJP/man/man8/repquota.8
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)repquota.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/repquota/repquota.8,v 1.4.2.2 2001/08/16 15:56:28 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/repquota.8,v 1.7 2001/05/14 01:09:57 horikawa Exp $
.\"
.Dd June 6, 1993
.Dt REPQUOTA 8
.Os
.Sh 名称
.Nm repquota
.Nd ファイルシステムの割り当て制限状況を表示する
.Sh 書式
.Nm
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Sh 解説
.Nm
は、指定されたファイルシステムのディスク使用状況と、
割り当て制限状況を表示します。
.Pp
オプションは以下のとおりです:
.Bl -tag -width indent
.It Fl a
.Pa /etc/fstab
に記述された全ファイルシステムに関する情報を表示します。
.It Fl g
グループ割り当て制限のみを表示します
(デフォルトでは、グループ、ユーザ両方の割り当て制限を表示します)。
.It Fl u
ユーザ割り当て制限のみを表示します (デフォルトでは、グループ、ユーザ
両方の割り当て制限を表示します)。
.It Fl v
個々のファイルシステムの割り当て (クォータ) を表示する前に、ヘッダ行を出
力します。
.El
.Pp
各ユーザやグループに関する現在の、ファイル数、サイズ (キロバイト単位)、
および割り当て制限
(
.Xr edquota 8
により設定される)が表示されます。
.Pp
operator グループに所属するユーザかスーパユーザのみが、このコマンドを
実行できます。
.Sh 関連ファイル
.Bl -tag -width quota.group -compact
.It Pa quota.user
ユーザの割り当て制限に関するデータ
(ファイルシステムのルートディレクトリに配置される)
.It Pa quota.group
グループの割り当て制限に関するデータ
(ファイルシステムのルートディレクトリに配置される)
.It Pa /etc/fstab
ファイルシステムの名前と位置を読み取る
.El
.Sh 関連項目
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr quotaon 8
.Sh 診断
アクセス不可能なファイルに関する様々なメッセージが出力されます。
.Sh 歴史
.Nm
は
.Bx 4.2
で追加されました。
