freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rescue.8
.\" Copyright (c) 2003 Tim Kientzle <kientzle@acm.org>
.\" Copyright (c) 2003 Simon L. Nielsen <simon@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/share/man/man8/rescue.8,v 1.1 2003/07/28 21:06:38 simon Exp %
.\" $FreeBSD$
.\"
.Dd July 23, 2003
.Os
.Dt RESCUE 8
.Sh 名称
.Nm rescue
.Nd 
.Pa /rescue
にある緊急用ユーティリティ
.Sh 解説
.Pa /rescue
ディレクトリには、ひどく損傷したシステムを復旧するのに使うための、
一般的なユーティリティのコレクションが納められています。
.Fx 5.2
から、 ダイナミックリンクされたルートへと移行したため、アップグレードの
失敗やディスクエラーのために、
.Pa /bin
や
.Pa /sbin
にある標準ツールが機能しなくなるという可能性が現実的となりました。
.Pa /rescue
にあるツールはスタティックリンクされているため、損傷に対してより強く
なっているはずです。
しかし、スタティックリンクされているために、
.Pa /rescue
にあるツールは、標準のユーティリティよりも機能が貧弱です。
特にロケール、
.Xr pam 3 、
及び nsswitch ライブラリを全面的に利用することはできません。
.Pp
もしシステムが起動に失敗して、次のようなプロンプトを表示した場合:
.Pp
.Dl "Enter full pathname of shell or RETURN for /bin/sh: "
.Pp
まず最初に、標準のシェルである
.Pa /bin/sh
の起動を試みます。
これに失敗したら、
.Nm
シェルである
.Pa /rescue/sh
の起動を試みます。
システムを復旧するには、最初にルートパーティションを読み書き可で
再マウントする必要があります。
これは次の
.Xr mount 8
コマンドで行うことが出来ます。
.Pp
.Dl "/rescue/mount -uw /"
.Pp
次の段階は、
.Pa /bin 、 /sbin 、
及び
.Pa /usr/lib
の中身を二重チェックして、可能なら
.Fx
の緊急用の、もしくは
.Dq "ライブファイルシステム"
CD-ROM (例えば、公式リリース版の
.Fx
ISO イメージの
.Li disc2
) をマウントし、ファイルをコピーします。
いったん
.Pa /bin/sh 、 /bin/ls 、
及び他の標準ユーティリティを首尾よく実行できるようになったなら、
標準のシステムで再起動を試みてください。
.Pp
.Pa /rescue
のツールは
.Xr crunchgen 1
を使ってコンパイルされており、これにより標準のユーティリティに比べると、
かなりコンパクトに出来ます。
容量が厳しい環境で
.Fx
システムをビルドするのに、
.Pa /rescue
を標準の
.Pa /bin
と
.Pa /sbin
ディレクトリの代替として使うことが出来ます。単純に
.Pa /bin
と
.Pa /sbin
を、
.Pa /rescue
へのシンボリックリンクに変更するのです。
.Pa /rescue
はスタティックリンクされているので、そのような環境では
.Pa /usr/lib
の大部分を省略してしまうことも可能です。
.Pp
今までの
.Pa /stand
とは対照的に、
.Pa /rescue
は
.Fx
のソース及びバイナリの標準のアップグレードにより更新されます。
.Sh 関連ファイル
.Bl -tag -width ".Pa /rescue" -compact
.It Pa /rescue
.Nm
階層のルート。
.El
.Sh 関連項目
.Xr crunchgen 1 ,
.Xr crash 8
.Sh 歴史
.Nm
ユーティリティは
.Fx 5.2
に初めて登場しました。
.Sh 作者
.An -nosplit
.Nm
システムは
.An Tim Kientzle Aq kientzle@acm.org
によって作成されました。
このマニュアルページは
.An Simon L. Nielsen Aq simon@FreeBSD.org
によって、
.An Tim Kientzle Aq kientzle@acm.org
のテキストを基にして書かれました。
.Sh バグ
.Nm
ツールの大部分は、相当に麻痺した状態のシステムでも動作します。
これの最もひどい例外は
.Nm
版の
.Xr vi 1
で、
今のところ
.Xr termcap 5
ファイルにアクセスできるように、
.Pa /usr
がマウントされている必要があります。
うまくいけば、そのうちフェイルセーフな
.Xr termcap 3
エントリが、
.Xr ncurses 3
ライブラリに追加されるでしょう。
そうすれば
.Pa /usr
がすぐにはマウントできないシステムでも、
.Pa /rescue/vi
が使用できるようになります。
それまでは、ファイルの編集が必要なのに
.Pa /usr
がマウントできない場合、
.Nm
版の
.Xr ed 1
エディタが
.Pa /rescue/ed
として使用できます。
