freebsd/freebsd-doc/ja_JP.eucJP/man/man8/restore.8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)restore.8	8.4 (Berkeley) 5/1/95
.\" %FreeBSD: src/sbin/restore/restore.8,v 1.47.2.1 2005/04/03 16:44:44 imp Exp %
.\"
.\" $FreeBSD$
.Dd May 1, 1995
.Dt RESTORE 8
.Os
.Sh 名称
.Nm restore ,
.Nm rrestore
.Nd "dump コマンドで作ったバックアップからファイルやファイルシステムをリストアする"
.Sh 書式
.Nm
.Fl i
.Op Fl dhmNuvy
.Op Fl b Ar blocksize
.Op Fl f Ar file | Fl P Ar pipecommand
.Op Fl s Ar fileno
.Nm
.Fl R
.Op Fl dNuvy
.Op Fl b Ar blocksize
.Op Fl f Ar file | Fl P Ar pipecommand
.Op Fl s Ar fileno
.Nm
.Fl r
.Op Fl dNuvy
.Op Fl b Ar blocksize
.Op Fl f Ar file | Fl P Ar pipecommand
.Op Fl s Ar fileno
.Nm
.Fl t
.Op Fl dhNuvy
.Op Fl b Ar blocksize
.Op Fl f Ar file | Fl P Ar pipecommand
.Op Fl s Ar fileno
.Op Ar
.Nm
.Fl x
.Op Fl dhmNuvy
.Op Fl b Ar blocksize
.Op Fl f Ar file | Fl P Ar pipecommand
.Op Fl s Ar fileno
.Op Ar
.Pp
.Nm rrestore
は
.\" .Nm を \fBrestore\fR で置き換えた。.Nm による改行を回避するため。
\fBrestore\fR
の別名です。
.Pp
.in \" XXX
.Pf ( Bx 4.3
形式のオプションは後方互換性のために実装されていますが、
ここでは説明していません。)
.Sh 解説
.Nm
ユーティリティは
.Xr dump 8
と逆の動作を行います。
ファイルシステムの完全なリストアを行うには、
まず、フルバックアップのリストアから始め、
続いてその上にインクリメンタルバックアップをリストアします。
フルまたは部分バックアップから、単一のファイルやディレクトリの部分ツリー
のみをリストア
することも可能です。
.Nm
ユーティリティは、ネットワークを介した動作も可能です。
これを行うには、以下で説明されている
.Fl f
と
.Fl P
フラグを参照してください。
コマンドに与えるその他の引数は、リストアされるファイルを指定するための
ファイルやディレクトリ名です。
.Fl h
フラグを指定していない限り (下記参照)、ディレクトリ名を指定することで、
そのディレクトリ中のファイルや
(再帰的に) サブディレクトリを指定することになります。
.Pp
以下のいずれか 1 つ (複数指定不可) のフラグが必要です:
.Bl -tag -width Ds
.It Fl i
バックアップからの対話的なリストアを行います。バックアップからディレクトリ情報
を読み取ると、
.Nm
はユーザに展開すべきファイルを選択させるために、
シェルに似たインタフェースでコマンドを受け付けます。
以下のコマンドが使用可能です。引数が必要なコマンドにおいて引数を省略すると、
デフォルトとしてカレントディレクトリが使われます。
.Bl -tag -width Fl
.It Ic add Op Ar arg
カレントディレクトリまたは指定した引数のファイルを、リストアするファイルの
リストに付け加えます。ディレクトリ名を指定した場合には、そのディレクトリの下の
すべてのファイルが展開リストに加えられます (コマンドラインに
.Fl h
フラグが指定されなかった場合)。
.Ic ls
でファイルのリストを表示するときに、展開リストに含まれているファイルの頭
には ``*'' がつけられています。
.It Ic \&cd Ar arg
カレントディレクトリを指定したディレクトリに移動します。
.It Ic delete Op Ar arg
カレントディレクトリまたは引数で指定したファイル名のファイルを、展開する
ファイルのリストから削除します。
ディレクトリ名を指定した場合には、そのディレクトリの下のすべてのファイルが
展開リストから削除されます (コマンドラインに
.Fl h
フラグが指定されなかった場合)。
ディレクトリ中のほとんどのファイルを展開する場合には、
ディレクトリ全体を展開リストに加えたあとで不要なファイルだけを
削除するのが一番便利なやりかたです。
.It Ic extract
展開ファイルリストにあるすべてのファイルをバックアップから展開します。
.Nm
ユーティリティは、どのボリュームをマウントしたいかをユーザにたずねます。
数個のファイルのみを展開するのにもっとも早い方法は、最終ボリュームから開始して
最初のボリュームへと戻ることです。
.It Ic help
利用できるコマンドの簡単な説明を表示します。
.It Ic \&ls Op Ar arg
カレントディレクトリまたは指定されたディレクトリのリストを表示します。
ディレクトリ名の後ろには ``/'' が付け加えられ、展開リストにあるファイルの前に
は ``*'' が加えられます。冗長フラグがセットされていた場合には、
各ディレクトリエントリにあわせて inode 番号も表示されます。
.It Ic pwd
カレントディレクトリのフルパス名を表示します。
.It Ic quit
即座に中断します。展開リストに何かファイルがあったとしても終了します。
.It Ic setmodes
展開リストにあるすべてのディレクトリの所有者、モード、時刻がセットされる
のみで、バックアップからはなにも展開されません。
これは、リストアを途中で中断してしまった時の後始末に有用です。
.It Ic verbose
冗長フラグ
.Fl v
の意味を反転します。冗長フラグがセットされている場合には、
.Ic ls
コマンドは、すべてのエントリに対してその inode 番号を表示します。
また、
.Nm
コマンドは、ファイルを展開するたびにその情報を表示します。
.It Ic what
ダンプヘッダ情報を表示します。
これには、日付、レベル、ラベル、
ダンプの元となったファイルシステムとホストが含まれます。
.El
.It Fl R
フルリストアを再開するために、マルチボリュームのテープのうち特定のものを
リストアすることを要求します
(下記
.Fl r
フラグを参照)。
これはリストア動作を中断したときに使われます。
.It Fl r
リストア (ファイルシステムの再構築) を行います。
レベル 0 バックアップのリストアの前には、リストア先となるファイルシステムは
.Xr newfs 8
で初期化しておき、マウントして、そのディレクトリへ
.Xr cd 1
で移動しておく必要があります。
レベル 0 バックアップのリストアに成功したら、
.Fl r
フラグを指定することで、
それに加えて必要なインクリメンタルバックアップをリストアすることができます。
.Fl r
フラグは対話的なファイルリストアを行わないため、注意して扱わないと
損害を与えることがあります (ディスクは言うに及ばず、精神的にも)。
次のように実行します:
.Bd -literal -offset indent
newfs /dev/da0s1a
mount /dev/da0s1a /mnt
cd /mnt

restore rf /dev/sa0
.Ed
.Pp
.Nm
は、インクリメンタルリストアのための情報を、ルートディレクトリの
.Pa restoresymtable
に記録します。このファイルは、すべての増分をリストアしたあとで削除すべきです。
.Pp
.Nm
ユーティリティを、
.Xr newfs 8
や
.Xr dump 8
と組み合わせることで、ファイルシステムのサイズやブロックサイズといった
パラメータを変更するのに使うことができます。
.It Fl t
指定したファイル名のファイルがバックアップ中にあれば、その名前を表示します。
ファイル名引数がない場合にはルートディレクトリを表示するため、
.Fl h
フラグを指定していない限り、バックアップ中のすべてのファイルを表示することに
なります。
.Fl t
フラグは、古くからあった
.Xr dumpdir 8
のかわりの機能を持つことに注意してください。
.It Fl x
メディアから、指定したファイルが読み出されます。
指定ファイルがディレクトリで、そのディレクトリの内容がバックアップ中に存在し、
かつ
.Fl h
フラグが指定されていないときには、ディレクトリの内容が再帰的に展開されます。
(可能であれば) ファイルの所有者、修正日時、モードもリストアされます。
もし引数が与えられていなければルートディレクトリを展開するため、
.Fl h
フラグを指定していない限り、結果的にバックアップ全体が展開されます。
.El
.Pp
以下の追加オプションを指定可能です:
.Bl -tag -width Ds
.It Fl b Ar blocksize
ダンプレコードあたりのキロバイト数です。
.Fl b
が指定されないときは、
.Nm
はメディアのブロックサイズを動的に求めようとします。
.It Fl d
冗長なデバッグ出力を標準エラーへ送ります。
.It Fl f Ar file
バックアップを
.Ar file
から読み込みます;
.Ar file
は、
.Pa /dev/sa0
(テープドライブ) や
.Pa /dev/da1c
(ディスクドライブ) といったスペシャルデバイスファイル、
通常のファイル、
.Sq Fl
(標準入力) のいずれかです。
ファイル名が
.Dq host:file
や
.Dq user@host:file
という形式である場合は、
.Nm
は
.Xr rmt 8
を用いて指定したファイルを指定のホストから読み取ります。
.It Fl P Ar pipecommand
.Ar pipecommand
で定義された
.Xr sh 1
スクリプト文字列をバックアップの各ボリュームに対する入力として実行するために
.Xr popen 3
を使います。
この子のパイプラインの
.Dv 標準出力
.Pq Pa /dev/fd/1
は
.Nm
の入力ストリームにリダイレクトされ、環境変数
.Ev RESTORE_VOLUME
には現在読み込まれているボリューム番号が設定されます。
ボリュームを 1 つロードする毎に、それがテープドライブ 1 つであるかのように、
.Ar pipecommand
スクリプトが開始されます。
.It Fl h
ディレクトリ名を指定された場合に、その中のファイルではなく、
ディレクトリそのものを展開するようにします。
これによって、ダンプからディレクトリのサブツリーを階層的に
展開してしまうことを防ぎます。
.It Fl m
展開を、ファイル名ではなく inode 番号によって行います。
これは数個のファイルのみを展開したい場合で、ファイルの完全なパス名を
再生することを防ぎたい場合に有用です。
.It Fl N
通常通り展開しますが、実際には変更をディスクへ書き込みません。
ダンプメディアの完全性の確認や他のテスト目的に使用可能です。
.It Fl s Ar fileno
マルチファイルテープの
.Ar fileno
から読みます。
ファイル番号は 1 から始まります。
.It Fl u
特定のタイプのファイルを作成する時に、
リストア先ディレクトリに既に同名のファイルが存在する場合には、
リストアは警告診断を生成し得ます。
この動作を抑制するために、
.Fl u
(アンリンク) フラグを指定すると、リストアは古いエントリを削除してから
新しいエントリを作成しようとします。
.It Fl v
普通、
.Nm
は何も表示せずにリストア動作を行います。
.Fl v
(verbose, 冗長) フラグを指定すると、
扱うファイルのタイプとファイル名が表示されます。
.It Fl y
エラーが発生したときに、リストア動作を中断するかどうかの問い合わせを
行いません。
これによって、不良ブロックをスキップして、可能なかぎり動作を継続します。
.El
.Sh 環境変数
.Bl -tag -width ".Ev TMPDIR"
.It Ev TAPE
バックアップを読み取るデバイス。
.It Ev TMPDIR
一時ファイルが作成されるディレクトリの名前。
.El
.Sh 関連ファイル
.Bl -tag -width "./restoresymtable" -compact
.It Pa /dev/sa0
デフォルトのテープドライブ
.It Pa /tmp/rstdir*
テープ中のディレクトリを保持するファイル
.It Pa /tmp/rstmode*
ディレクトリの所有者、モード、タイムスタンプ
.It Pa \&./restoresymtable
インクリメンタルリストア間で渡される情報
.El
.Sh 診断
リードエラーが発生すると
.Nm
ユーティリティはメッセージを表示します。
もし、
.Fl y
が指定されているか、あるいはユーザが
.Ql y
の応答をしたならば、
.Nm
はリストアを続行しようとします。
.Pp
バックアップが 1 巻より多くのテープボリュームに格納されていたならば、
.Nm
は次のボリュームをマウントすべき時点でそれをユーザに知らせます。
もし、
.Fl x
あるいは
.Fl i
フラグが指定されていたら、
.Nm
は、ユーザがマウントしたいのはどのボリュームであるかを問い合わせます。
少数のファイルを最も早く展開する方法は、最終ボリュームから開始して、
最初のボリュームへ向けて作業を進めることです。
.Pp
.Nm
は数多くの一貫性検査を行っていて、それを表示します。
ほとんどの検査結果の表示は自明であるか、あるいは「決して起こらない」ものです。
良くあるエラーを以下に示します。
.Pp
.Bl -tag -width Ds -compact
.It Converting to new file system format.
古い形式のファイルシステムで作られたダンプテープがロードされました。
その場合、自動的に新しいファイルシステムの形式に変換されます。
.Pp
.It <filename>: not found on tape
指定したファイル名はテープのディレクトリには記録されていましたが、
テープのなかに本体が見当たりませんでした。
このような事態が起きるのは、ファイルを探している間にテープのリードエラー
が発生した場合や、稼働中のファイルシステムにおいて作成したダンプテープ
を使った場合です。
.Pp
.It expected next file <inumber>, got <inumber>
ディレクトリに記録されていなかったファイルが示されます。
稼働中のファイルシステムにおいて作成したダンプを使った場合に発生することが
あります。
.Pp
.It Incremental dump too low
インクリメンタルリストアを行う際に、ダンプが直前のインクリメンタルダンプ
よりも以前に書かれたものであったり、増分レベルが低すぎるダンプがロード
された場合に表示されます。
.Pp
.It Incremental dump too high
インクリメンタルリストアを行う際に、ダンプが直前のインクリメンタルダンプ
の続きの範囲から開始していなかったり、あるいは増分レベルが高すぎる
ダンプがロードされた場合に表示されます。
.Pp
.It Tape read error while restoring <filename>
.It Tape read error while skipping over inode <inumber>
.It Tape read error while trying to resynchronize
テープ (あるいはその他の媒体) のリードエラーが発生しました。
ファイル名が表示されていたならば、その内容はおそらく部分的に不正なものに
なっているでしょう。
もし inode がスキップされたり、テープの resynchronize (再同期) が試みら
れていたならば、展開されたファイルには問題はありません。しかし、テープ
上からいくつかのファイルを見付けることができないかもしれません。
.Pp
.It resync restore, skipped <num> blocks
ダンプのリードエラーが発生した後に、おそらく
.Nm
は自分自身で再同期をとらなければなりません。
このメッセージはスキップしたブロックの個数を表示します。
.El
.Sh 関連項目
.Xr dump 8 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr rmt 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.2
で登場しました。
.Sh バグ
使用中のファイルシステムから作成されたダンプから
インクリメンタルリストアを行うと、
.Nm
ユーティリティが誤動作を起こすことがあります。
.Pp
フルリストアの終了後にはレベル 0 ダンプを行う必要があります。
.Nm
はユーザコードで動作するので、inode の割り当てを制御することができません。
したがって、ファイルの内容が変更されていない場合でも、新しい inode 割り当てを
新しいディレクトリ集合に反映させるためには、
フルダンプを行わなければなりません。
.Pp
ネットワークを介したリストアを行う場合、
root 権限で restore を実行する必要があります。
これは、以前の dump と restore のセキュリティ上の歴史によるものです。
(restore は root に setuid されて使われるように書かれていますが、
restore のコードから全てのバグが取れているとは思わないので、
setuid にて使用する場合は自己の責任において行って下さい。)
.Pp
一時ファイル
.Pa /tmp/rstdir*
と
.Pa /tmp/rstmode*
は、ダンプの日付とプロセス ID に基づいて、ユニークに生成されます
.Pf ( Xr mktemp 3
を参照してください)。ただし
.Fl r
または
.Fl R
が使用された場合は例外です。
これは、中断された
.Fl r
の動作を
.Fl R
によって再開可能とするためであり、
別々の処理において同一の一時ファイルを使用することが必要であるためです。
他の場合には、ファイルはユニークです。
これは、同時に 2 個の異なったダンプが開始する可能性があるためであり、
別々の処理が衝突しないようにすべきだからです。
