freebsd/freebsd-doc/ja_JP.eucJP/man/man8/revnetgroup.8
.\" Copyright (c) 1995
.\"	Bill Paul <wpaul@ctr.columbia.edu>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/libexec/revnetgroup/revnetgroup.8,v 1.7.2.1 2000/12/08 13:52:30 ru Exp %
.\" $FreeBSD$
.\"
.Dd October 24, 1995
.Dt REVNETGROUP 8
.Os
.Sh 名称
.Nm revnetgroup
.Nd "逆ネットグループデータを生成する"
.Sh 書式
.Nm
.Fl u
.Op Fl f Ar netgroup_file
.Nm
.Fl h
.Op Fl f Ar netgroup_file
.Sh 解説
.Nm
は
.Xr netgroup 5
フォーマットのファイル内容を処理し、
.Pa 逆ネットグループ
と呼ばれる形式に変換します。
元のファイルでは、あるグループが含むメンバを示す形式で
ネットグループのメンバが示されます。
逆ネットグループフォーマットでは、
あるメンバが属するグループを示します。
この情報は
.Pa netgroup.byuser
と
.Pa netgroup.byhosts
の
.Tn NIS
マップを作成するために使用します。
これらの逆ネットグループマップは、ネットグループの参照、
特に
.Fn innetgr
ライブラリ関数を高速化するために使用されます。
.Pp
例えば、標準の
.Pa /etc/netgroup
ファイルはネットグループとそのメンバリストを列挙します。
ここで、ネットグループは
.Em キー
であるとし、メンバ名を
.Em データ
であるとします。
これに対し、逆の
.Pa netgroup.byusers
データベースは、ユニークなメンバをキーとし、
メンバが属するネットグループをデータとします。
ユーザとホストに属する情報を保持する別々のデータベースを作成します;
これにより、ネットグループユーザ名参照とネットグループホスト名参照が
独立のキー空間にて実行されます。
.Pp
あらかじめ逆ネットグループデータベース
(およびこれに対応する
.Tn NIS
マップ)を構築することにより、
要求ごとに
.Xr getnetgrent 3
ライブラリ関数が依存関係を処理しなくても良くなります。
これは、ユーザ数及びホスト数が多いネットワークでは重要です。
なぜなら、巨大なネットグループデータベースの処理は多大な時間を要するからです。
.Pp
.Nm
コマンドは結果を標準出力に表示します。
通常は
.Pa /var/yp/Makefile
から呼ばれるだけであり、
これは
.Tn NIS
ネットグループマップを構築する時です。
.Pp
.Sh オプション
.Nm
コマンドは以下のオプションをサポートします:
.Bl -tag -width indent
.It Fl u
.Pa netgroup.byuser 
を生成します;
元のネットグループファイルのユーザ名情報のみが処理されます。
.It Fl h
.Pa netgroup.byhost
を生成します;
元のネットグループファイルのホスト名情報のみが処理されます。(
.Fl u
か
.Fl h
のいずれかを指定する必要が有ります。)
.It Op Fl f Ar netgroup_file
.Nm
コマンドは
.Pa /etc/netgroup
をデフォルトの入力ファイルとします。
.Fl f
フラグにて、ユーザは別の入力ファイルを指定できます。``-'' を
入力ファイルとして指定すると、
.Nm
は標準入力を読みます。
.El
.Sh 関連ファイル
.Bl -tag -width /var/yp/Makefile -compact
.It Pa /var/yp/Makefile
.Tn NIS
データベースを構築するために
.Nm yp_mkdb
と
.Nm
を呼び出す Makefile。
.It Pa /etc/netgroup
デフォルトのネットグループデータベースファイル。
ほとんどの場合、
.Tn NIS
マスタサーバにだけ有ります。
.El
.Sh 関連項目
.Xr getnetgrent 3 ,
.Xr yp 4 ,
.Xr netgroup 5 ,
.Xr yp_mkdb 8 
.Sh 作者
.An Bill Paul Aq wpaul@ctr.columbia.edu
