freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rlogind.8
.\" Copyright (c) 1983, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)rlogind.8	8.1 (Berkeley) 6/4/93
.\"	%Id: rlogind.8,v 1.4.2.3 1998/02/18 11:48:06 markm Exp %
.\" jpman %Id: rlogind.8,v 1.2 1997/05/23 00:50:03 mutoh Stab %
.\"
.Dd June 4, 1993
.Dt RLOGIND 8
.Os BSD 4.2
.Sh 名称
.Nm rlogind
.Nd リモートログインのサーバ
.Sh 書式
.Nm
.Op Fl Daln
.Sh 解説
.Nm
は、
.Xr rlogin 1
のためのサーバです。サーバは信頼できるホストからの
特権ポート番号に基づいた認証を用いて、リモートログイン機能を提供します。
.Nm
では、以下のオプションが使用可能です。
.Bl -tag -width indent
.It Fl D
TCP_NODELAY ソケットオプションを設定します。これは、いくつかの
ネットワークトラフィックの増大に対して、応答性を向上します。
.It Fl a
検証のために、ホスト名を問い合わせます。
.It Fl l
ユーザがスーパユーザとしてログインしない限り、
一般ユーザの
.Dq Pa .rhosts
による、あらゆる認証を禁止します。
.It Fl n
キープアライブメッセージを禁止します。
.El
.Pp
Kerberos を使っている時には、以下のようなオプションが利用可能です。
.Bl -tag -width indent
.It Fl k
Kerberos 認証を利用可能にします。
.It Fl v
vacuous モードを利用可能にします。
.It Fl x
.Xr rlogin 1
セッションで流される全てのデータに
.Tn DES
暗号化を施します。このオプションを利用すると、応答性や CPU に負荷が
かかりますが、機密性は向上します。
.El
.Pp
.Nm 
は、``login'' サービスの仕様に基づく番号のポートで、要求を受け付けます。
詳しくは
.Xr services 5
を参照してください。
サービスの要求を受け取ると、以下のプロトコルを開始します。
.Bl -enum
.It
サーバはクライアントの要求元ポート番号を調べます。
もしポート番号が512〜1023の範囲外であれば、サーバは接続を切断します。
.It
サーバはクライアントの要求元アドレスを調べ、それに対応するホスト名を
求めます (
.Xr gethostbyaddr 3 ,
.Xr hosts 5 ,
.Xr named 8 
を参照してください)。
ホスト名を決定できなければ、ドット表記法によるホストアドレスを
用います。
ホスト名がサーバと同じドメインに属しているか (ドメイン名の最後の二つの
構成要素に基づいて判断します)、あるいは
.Fl a
オプションが指定されていたら、
ホスト名に対するアドレスを調べて、ホスト名とアドレスが一致しているか
どうかを検証します。
アドレスの検証に失敗した場合は、通常の認証作業は行いません。
.El
.Pp
要求元ポートの番号を調べ終えたら、
.Nm
は、
.Xr rshd 8
で説明している認証作業を開始します。
そして、疑似ターミナル (
.Xr pty 4
を参照のこと) を割り当てると共に、
ファイルディスクリプタを操作して、
この疑似ターミナルのスレーブ側がログインプロセスの
.Em stdin ,
.Em stdout ,
.Em stderr
になるようにします。
認証作業が成功した場合には、
.Xr login 1
プログラムに
.Fl f
オプションを指定してログインプロセスを生成します。
自動認証作業に失敗した場合には、
通常のターミナルラインからのログインの場合と同様に、
ユーザに問い合わせをします。
.Pp
ログインプロセスの親プロセスは、疑似ターミナルのマスター側を操作します。
すなわちログインプロセスと、クライアント側の
.Xr rlogin 1
プログラムを実体化したものとの間で処理を行います。
通常の処理においては、
.Ql ^S/^Q
のような機能を提供したり、割り込み信号をリモートプログラムへと伝えるために
.Xr pty 4
で説明しているパケットプロトコルを起動します。
ログインプロセスは、クライアントのターミナルの通信速度や
環境変数
.Ql Ev TERM
で指定されているターミナルタイプを伝えます。
.Xr environ 7
を参照してください。
クライアント側に端末の画面、あるいはウィンドウの大きさを問い合わます。
また、クライアント側からウィンドウサイズの変更が疑似ターミナルへ
伝えられます。
.Pp
トランスポートレベルのキープアライブメッセージは、オプション
.Fl n
が指定されていない限り出力されます。
キープアライブメッセージを利用すると、クライアントがクラッシュしたり、
通信不能になってしまった時に、セッションをタイムアウトで
終了することが可能になります。
.Sh 診断
すべての診断メッセージは、ネットワーク接続が切断された後に、最初に 1 の値
のバイトが付加されて通知されます。
.Xr login 1
が起動された後にエラーが発生しない場合、
処理成功の通知のために、NULL バイトを返します。
.Bl -tag -width Ds
.It Sy Try again.
サーバが
.Xr fork 2
に失敗したことを表します。
.El
.Sh 関連項目
.Xr login 1 ,
.Xr ruserok 3 ,
.Xr hosts 5 ,
.Xr nologin 5 ,
.Xr rshd 8 
.Sh 関連ファイル
.Bl -tag -width /etc/hostsxxxxxxxx -compact
.It Pa /etc/hosts
.It Pa /etc/hosts.equiv
.It Pa $HOME/.rhosts
.It Pa /etc/nologin
.El
.Sh バグ
このコマンドが用いている認証手続きは、それぞれのクライアントマシンと
接続媒体が完全であるということを仮定したものです。これはセキュリティホールに
なりやすいのですが、``オープン'' な環境においては有用な方針です。
.Pp
全てのデータについて暗号化を行なう機能が実装されるべきです。
.Pp
もっと発展性のあるプロトコルが用いられるべきです。
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
