freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmail.8
.\" Copyright (c) 1998, 1999 Sendmail, Inc. and its suppliers.
.\"	 All rights reserved.
.\" Copyright (c) 1983, 1990
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	%Id: rmail.8,v 8.1.16.2 2000/12/29 18:12:22 gshapiro Exp %
.\"
.\" jpman %Id: rmail.8,v 1.2 1997/05/16 07:57:46 yugawa Stab %
.TH RMAIL 8 "%Date: 2000/12/29 18:12:22 %"
.SH 名称
rmail
\- uucpで送られてきたメールを処理する
.SH 書式
.B rmail
.I 
.RB [ \-D
.IR domain ]
.RB [ \-T ]
user ...
.SH 解説
.B rmail
は
uucp(1)
経由で受けとったメールを解釈し、
mail.local(8)
によって生成される ``From'' 行を、``return-path!sender''
という一行に変換して
sendmail(8)
に渡します。
.PP
.B rmail
は、明らかに
uucp(1)
と
sendmail(8)
で使われるように設計されています。
.SS フラグ
.TP
.B \-D
指定した
.I domain
を、``UUCP'' のデフォルトドメインとして使用します。
.TP
.B \-T
デバッグを有効にします。
.SH 関連項目
uucp(1),
mail.local(8),
sendmail(8)
.SH 歴史
.B rmail
プログラムは
4.2BSD
から登場しました。
.SH バグ
.B rmail
は
/bin 
に置くべきではありません。
