freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmail.8
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)rmail.8	6.10 (Berkeley) 4/29/93
.\" jpman %Id: rmail.8,v 1.2 1997/05/16 07:57:46 yugawa Stab %
.\"	%Id: rmail.8,v 1.2.8.1 1997/02/28 07:54:43 mpp Exp %
.\"
.Dd April 29, 1993
.Dt RMAIL 8
.Os BSD 4.2
.Sh 名称
.Nm rmail
.Nd uucpで送られてきたメールを処理する
.Sh 書式
.Nm rmail
.Ar user ...
.Sh 解説
.Nm rmail
は
.Xr uucp 1 
経由で受けとったメールを解釈し、
.Xr mail.local 8
によって生成される``From''行を、``return-path!sender''
という一行に変換して
.Xr sendmail  8 
に渡します。
.Pp
.Nm rmail
は、明らかに
.Xr uucp
と
.Xr sendmail  
で使われるように設計されています。
.Sh 関連項目
.Xr uucp 1 ,
.Xr mail.local 8 ,
.Xr sendmail 8
.Sh 歴史
.Nm rmail
プログラムは
.Bx 4.2 
から登場しました。
.Sh バグ
.Nm rmail
は
.Pa /bin 
に置くべきではありません。
