freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmail.8
.\" Copyright (c) 1998 Sendmail, Inc.  All rights reserved.
.\" Copyright (c) 1983, 1990
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"	@(#)rmail.8	6.14 (Berkeley) 5/19/1998
.\" jpman %Id: rmail.8,v 1.2 1997/05/16 07:57:46 yugawa Stab %
.\"
.Dd May 19, 1998
.Dt RMAIL 8
.Os BSD 4.2
.Sh 名称
.Nm rmail
.Nd uucpで送られてきたメールを処理する
.Sh 書式
.Nm rmail
.Ar user ...
.Sh 解説
.Nm
は
.Xr uucp 1 
経由で受けとったメールを解釈し、
.Xr mail.local 8
によって生成される``From''行を、``return-path!sender''
という一行に変換して
.Xr sendmail  8 
に渡します。
.Pp
.Nm
は、明らかに
.Xr uucp 1
と
.Xr sendmail 8
で使われるように設計されています。
.Sh 関連項目
.Xr uucp 1 ,
.Xr mail.local 8 ,
.Xr sendmail 8
.Sh 歴史
.Nm
プログラムは
.Bx 4.2 
から登場しました。
.Sh バグ
.Nm
は
.Pa /bin 
に置くべきではありません。
