freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmextattr.8
.\"-
.\" Copyright (c) 2000, 2001 Robert N. M. Watson
.\" Copyright (c) 2002 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by Poul-Henning
.\" Kamp and Network Associates Laboratories, the Security Research Division
.\" of Network Associates, Inc. under DARPA/SPAWAR contract N66001-01-C-8035
.\" ("CBOSS"), as part of the DARPA CHATS research program
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/extattr/rmextattr.8,v 1.4 2003/02/24 22:53:25 ru Exp %
.\"
.\" $FreeBSD$
.Dd August 30, 2000
.Dt RMEXTATTR 8
.Os
.Sh 名称
.Nm getextattr ,
.Nm lsextattr ,
.Nm rmextattr ,
.Nm setextattr
.Nd 拡張属性の操作
.Sh 書式
.Nm getextattr
.Op Fl fhqsx
.Ar attrnamespace
.Ar attrname
.Ar filename ...
.Nm lsextattr
.Op Fl fhq
.Ar attrnamespace
.Ar filename ...
.Nm rmextattr
.Op Fl fhq
.Ar attrnamespace
.Ar attrname
.Ar filename ...
.Nm setextattr
.Op Fl fhnq
.Ar attrnamespace
.Ar attrname
.Ar attrvalue
.Ar filename ...
.Sh 解説
これらのユーティリティは、
ファイルおよびディレクトリ中の指定された拡張属性を操作するための
ユーザツールです。
.Ar attrnamespace
引数は取り出し対象の属性の名前空間であり、
正当な値は
.Cm user
および
.Cm system
です。
.Ar attrname
引数は属性名、
.Ar filename
引数はターゲットファイルまたはディレクトリの名前、
.Ar attrvalue
引数は属性に格納する文字列です。
.Pp
次のオプションが使用可能です:
.Bl -tag -width indent
.It Fl f
(強制) 各ファイル名に対するエラーを無視し、残りの引数に対して処理を続行します。
.It Fl h
(非追跡) ファイルがシンボリックリンクの場合、
リンクで指されるファイルではなくリンク自身に対して操作を実行します。
.It Fl n
.Dv ( NUL
終端) 出力中の内容の部分を
.Dv NUL
終端します。
.It Fl q
(静寂) パス名を表示せず、エラーメッセージを抑制します。
.It Fl s
(文字列化) 非表示文字をエスケープし、出力をクォートで括ります。
.It Fl x
(16 進数) 出力を 16 進数で表示します。
.El
.Sh 使用例
.Bd -literal
setextattr system md5 `md5 -q /boot/kernel/kernel` /boot/kernel/kernel
getextattr system md5 /boot/kernel/kernel
lsextattr system /boot/kernel/kernel
rmextattr system md5 /boot/kernel/kernel
.Ed
.Sh 関連項目
.Xr extattr 2 ,
.Xr extattr 3 ,
.Xr extattrctl 8 ,
.Xr extattr 9
.Sh 歴史
拡張属性サポートは、
.Tn TrustedBSD
Project の一部として開発され、
.Fx 5.0
で導入されました。
各ファイルやディレクトリが追加ラベルを持つことを必要とするような
セキュリティ拡張のために、この開発が行われました。
.Sh 作者
.An Robert N M Watson
.An Poul-Henning Kamp
.Sh バグ
.Nm setextattr
ユーティリティは、属性に対して文字列を設定するためだけに使用できます。
