freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmt.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rmt.8	8.3 (Berkeley) 6/1/94
.\" %FreeBSD: src/usr.sbin/rmt/rmt.8,v 1.5.2.4 2001/08/16 15:56:28 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 1, 1994
.Dt RMT 8
.Os
.Sh 名称
.Nm rmt
.Nd リモートプログラムから磁気テープの操作を行なうためのプロトコルモジュール
.Sh 書式
.Nm
.Sh 解説
.Nm
は、リモートダンプおよびリストアを行なうプログラムから、プロセス間
通信を用いて磁気テープドライブを操作するために用いられます。
.Nm
は、通常は
.Xr rexec 3
もしくは
.Xr rcmd 3
からの呼び出しに応じて起動されます。
.Pp
.Nm
は、磁気テープの操作要求を受け付け、コマンドを実行します。その後、
状態を返却します。
全ての応答は、
.Tn ASCII
文字列および以下の 2 つの形式を組み合わせて行なわれます。
コマンド実行が成功した場合は、以下の応答があります。
.Bd -ragged -offset indent
.Sm off
.Sy A Ar number No \en
.Sm on
.Ed
.Pp
.Ar number
は、10 進の
.Tn ASCII
表現です。コマンド実行が失敗した場合には、以下の
応答があります。
.Bd -ragged -offset indent
.Sm off
.Xo Sy E Ar error-number
.No \en Ar error-message
.No \en
.Xc
.Sm on
.Ed
.Pp
.Ar error-number
は、
.Xr intro 2
に記述のあるエラー番号であり、
.Ar error-message
は、
.Xr perror 3
によって出力されるエラー文字列です。プロトコルは、以下のコマンドを含み、
コマンドと引数の間、もしくは引数間ではスペースは挿入されません。
.Ql \en
の表示は、その部分で改行が要求されています:
.Bl -tag -width Ds
.Sm off
.It Xo Sy \&O Ar device
.No \en Ar mode No \en
.Xc
.Sm on
指定された
.Ar device
を
.Ar mode
で指定された属性でオープンします。
.Ar device
は
フルパスで指定され、
.Ar mode
は
.Xr open 2
で用いられる 10 進の
.Tn ASCII
表現です。
すでにデバイスがオープンされていた場合、
そのデバイスは一旦クローズされ、再びオープンされます。
.Sm off
.It Xo Sy C Ar device No \en
.Xc
.Sm on
現在オープンされているデバイスをクローズします。
.Ar device
指定は無視されます。
.Sm off
.It Xo Sy L
.Ar whence No \en
.Ar offset No \en
.Xc
.Sm on
指定された引数を用いて、
.Xr lseek 2
を実行します。返却値の意味は、
.Xr lseek
システムコールのそれと同じです。
.Sm off
.It Sy W Ar count No \en
.Sm on
オープンされているデバイスに対し、データを書き込みます。
.Nm
は、要求元から
.Ar count
バイトのデータを読み込みます。予期しない EOF を
読み込んだ場合、異常終了します。本コマンドの返却値は、
.Xr write 2
システムコールと同じです。
.Sm off
.It Sy R Ar count No \en
.Sm on
オープンされてるデバイスから
.Ar count
バイトだけのデータを読み込みます。
.Ar count
がデータバッファのサイズ (10kバイト) を超える場合、
データバッファサイズに切り詰められます。
.Nm
は
.Xr read 2
システムコールを実行し、読み込みが成功すると
.Sm off
.Sy A Ar count-read No \en
.Sm on
と返答します。そうでなければ、
標準的な形式でエラーが返却されます。読み込みが成功すると、読み込まれたデータ
は要求元に送信されます。
.Sm off
.It Xo Sy I Ar operation
.No \en Ar count No \en
.Xc
.Sm on
指定された引数を用いて
.Xr ioctl 2
の
.Dv MTIOCOP
リクエストを実行します。引数は、10 進の
.Tn ASCII
表現に置き換えられ、
.Xr ioctl 2
で使用する構造体のメンバ
.Ar mt_op
および
.Ar mt_count
にそれぞれ格納されます。操作が成功した場合の返却値は、引数
.Ar count
の値です。
.It Sy S
.Xr ioctl 2
システムコールの
.Dv MTIOCGET
リクエストを用い、オープンされている
デバイスの状態を返却します。操作が成功すると、ステータスバッファのサイズと
ともに ``ack'' が送信されます。それからステータスバッファが (バイナリ形式で)
送信されます。
.El
.Pp
上記以外のコマンドを
.Nm
が受信した場合、
.Nm
は終了します。
.Sh 診断
全ての返答は、上記の通りです。
.Sh 関連項目
.Xr rcmd 3 ,
.Xr rexec 3 ,
.Xr mtio 4 ,
.Xr rdump 8 ,
.Xr rrestore 8
.Sh バグ
本コマンドをリモートファイルアクセスプロトコルとして使用しないで下さい。
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
