freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmuser.8
.\" Copyright 1995, 1996
.\"     Guy Helmer, Madison, South Dakota 57042.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY GUY HELMER ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL GUY HELMER BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	%Id: rmuser.8,v 1.1.2.3 1997/09/02 06:31:52 charnier Exp %
.\" jpman %Id: rmuser.8,v 1.3 1997/07/22 16:58:06 horikawa Stab %
.\"
.Dd July 16, 1996
.Dt RMUSER 8
.Os
.Sh 名称
.Nm rmuser
.Nd システムからユーザを削除する
.Sh 書式
.Nm rmuser
.Op Ar username
.Sh 解説
.Nm
は、ユーザの
.Xr crontab 1
エントリ (存在すれば) と
.Xr at 1
ジョブを削除し、ローカルのパスワードファイルからユーザのエントリを
削除します。そして、ホームディレクトリがユーザ所有であれば削除し、
存在すればメールを削除します。ユーザ名は
.Pa /etc/group
の全てのグループから削除されます。
グループが空になりかつグループ名とユーザ名が等しければ、
グループも削除されます ( これは、
.Xr adduser 8 
がユーザ 1 人に対して唯一のグループを与えているためです ) 。
.Pp
.Nm
は、
ユーザ id が 0 であるユーザ ( 典型的には root です ) の削除は拒否します。
この仕様は、
.Nm
作成時に良い考えのように思えました。
.Pp
.Nm
は、選択されたユーザのパスワードファイルエントリを表示し、
本当に消したいユーザであるのか尋ねます。ユーザのホームディレクトリが
(他のユーザのものでなく) ユーザ所有であれば、
.Nm
はユーザのホームディレクトリ以下の全てを消してもいいのかどうか
訊いてきます。
.Pp
以下のオプションが利用可能です。
.Pp
.Bl -tag -width username
.It Ar \&username
消去するユーザを指定します。
指定されていなければ、
.Nm
は、対話的に消去するユーザを尋ねます。
.Sh 関連ファイル
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/master.passwd
.It Pa /etc/passwd
.It Pa /etc/group
.It Pa /etc/spwd.db
.It Pa /etc/pwd.db
.El
.Sh 関連項目
.Xr at 1 ,
.Xr chpass 1 ,
.Xr crontab 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr group 5 ,
.Xr passwd 5 ,
.Xr addgroup 8 ,
.Xr adduser 8 ,
.Xr pwd_mkdb 8 ,
.Xr rmgroup 8 ,
.Xr vipw 8
.Sh 歴史
.Nm
コマンドは、
.Fx 2.1.5 
から導入されました。
.\" .Sh 作者
.\" Guy Helmer, Madison, South Dakota
