freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmuser.8
.\" Copyright 1995, 1996, 1997
.\"     Guy Helmer, Ames, Iowa 50014.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY GUY HELMER ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL GUY HELMER BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/adduser/rmuser.8,v 1.21 2003/02/16 18:04:06 mtm Exp %
.\" $FreeBSD$
.\"
.Dd May 10, 2002
.Dt RMUSER 8
.Os
.Sh 名称
.Nm rmuser
.Nd システムからユーザを削除する
.Sh 書式
.Nm
.Op Fl vy
.Op Fl f Ar file
.Op Ar username ...
.Sh 解説
.Nm
ユーティリティは、コマンドラインまたはファイルから提供される、
ひとり以上のユーザの削除を行います。
システムからユーザを削除するときにこのユーティリティは以下を行います:
.Bl -enum
.It
ユーザの
.Xr crontab 1
エントリ (存在すれば) を削除します。
.It
ユーザの
.Xr at 1
ジョブを削除します。
.It
ユーザが所有する全プロセスに
.Dv SIGKILL
を送ります。
.It
システムのローカルパスワードファイルからユーザのエントリを削除します。
.It
ホームディレクトリがユーザ所有であれば削除します。
この際、実際のホームディレクトリまでのパスに存在するシンボリックリンク
も削除します。
.It
.Pa /var/mail
より、
存在すれば入力メールと POP デーモンのメールファイルを削除します。
.It
ユーザが所有する全ファイルを
.Pa /tmp , /var/tmp , /var/tmp/vi.recover
から削除します。
.It
ユーザ名を
.Pa /etc/group
の全てのグループから削除します。
(グループが空になりかつグループ名とユーザ名が等しければ、
グループも削除されます。これは、
.Xr adduser 8
がユーザ 1 人に対して唯一のグループを与えているためです)。
.El
.Pp
.Nm
ユーティリティは、
ユーザ id が 0 であるユーザ (典型的には root です) の削除は拒否します。
この仕様は、ある動作 (つまり、ユーザの全プロセスを殺したり
ユーザのホームディレクトリを削除すること) が実行システムにダメージを
与えうることを考慮しています。
UID が 0 であるユーザを削除することが必要な場合は、
.Xr vipw 8
を参照し、パスワードファイルを直接編集する方法を調べてください。
.Pp
.Fl y
オプションと共に
.Nm
が起動されていない場合、
選択されたユーザのパスワードファイルエントリを表示し、
本当に消したいユーザであるのか尋ねます。
その後、ユーザのホームディレクトリを消しても良いのかどうか確認します。
答が肯定であった場合、
ホームディレクトリと配下のすべてのファイルとサブディレクトリは、
それらがユーザ所有であった場合にのみ削除されます。
更なる詳細は
.Xr pw 8
を参照してください。
.Pp
.Nm
の動作中、現在なにをやっているかをユーザに知らせます。
エラーが発生すると、標準エラー出力にそれを表示し、
.Nm
が動作継続可能であれば動作を継続します。
.Pp
以下のオプションが利用可能です。
.Pp
.Bl -tag -width ".Ar username"
.It Fl f Ar file
.Nm
ユーティリティは、削除対象のユーザリストを
.Ar file
から得ます。
このファイルは 1 行に 1 ユーザを含みます。
ハッシュ記号
.Pq Ql #
を含むこれ以降はコメントとみなされ、処理されません。
ファイルの所有者が UID 0 のユーザ以外の場合か、
所有者以外から書き込み可能である場合、
.Nm
は継続を拒否します。
.It Fl v
冗長モードを有効にします。
通常は、削除されたユーザごとに 1 行が出力に含まれます。
このオプション付きの場合、
.Nm
は処理進捗に関しておしゃべりになります。
.It Fl y
すべての問い合わせに暗黙的に
.Dq Li yes
と答えます。
現在のところ、指定したユーザを削除するかどうかの確認と、
ホームディレクトリを削除するかどうかの確認が含まれます。
本オプションを使うには、
.Fl f
オプションを使うか、
コマンドライン引数として 1 人以上のユーザを指定する必要があります。
.It Ar username
消去するユーザを指定します。
指定されていなければ、
.Nm
は、対話的に消去するユーザを尋ねます。
.El
.Sh 関連ファイル
.Bl -tag -compact
.It Pa /etc/master.passwd
.It Pa /etc/passwd
.It Pa /etc/group
.It Pa /etc/spwd.db
.It Pa /etc/pwd.db
.El
.Sh 関連項目
.Xr at 1 ,
.Xr chpass 1 ,
.Xr crontab 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr group 5 ,
.Xr passwd 5 ,
.Xr adduser 8 ,
.Xr pw 8 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Sh 歴史
.Nm
ユーティリティは、
.Fx 2.2
から導入されました。
.Sh バグ
.Nm
ユーティリティは、包括的にファイルシステムを検索して
削除されたユーザの全ファイルを消すわけではありません;
あらゆる規模のシステムにおいてもこのようなことをしてしまうと、
法外なほど遅くなり I/O 負荷がかかります。また、
.Nm
ユーティリティは、ユーザが
.Pa /tmp
や
.Pa /var/tmp
に作成したシンボリックリンクを削除できません。
なぜなら、
.Bx 4.4
ファイルシステムではシンボリクリンクを誰が作成したかの情報
を持たないからです。
さらに、
.Pa /var/mail
には、
.Pa /var/mail/ Ns Ar username
でも
.Pa /var/mail/.pop. Ns Ar username
でもないファイルで、削除されたユーザ所有ではないものの、
削除すべきファイルが有るかもしれません。
.Pp
.Nm
ユーティリティは YP/NIS については何も知りませんので、
ローカルパスワードファイルに対してのみ動作します。
