freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rmuser.8
.\" Copyright 1995, 1996, 1997
.\"     Guy Helmer, Ames, Iowa 50014.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY GUY HELMER ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL GUY HELMER BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/adduser/rmuser.8,v 1.16 2002/07/14 14:42:12 charnier Exp %
.\" $FreeBSD$
.\"
.Dd February 23, 1997
.Dt RMUSER 8
.Os
.Sh 名称
.Nm rmuser
.Nd システムからユーザを削除する
.Sh 書式
.Nm
.Op Fl y
.Op Ar username
.Sh 解説
.Nm
ユーティリティ
は以下を行います。
.Bl -enum
.It
ユーザの
.Xr crontab 1
エントリ (存在すれば) を削除します。
.It
ユーザの
.Xr at 1
ジョブを削除します。
.It
ユーザが所有する全プロセスに SIGKILL を送ります。
.It
システムのローカルパスワードファイルからユーザのエントリを削除します。
.It
ホームディレクトリがユーザ所有であれば削除します。
この際、実際のホームディレクトリまでのパスに存在するシンボリックリンク
も削除します。
.It
.Pa /var/mail
より、
存在すれば入力メールと pop デーモンのメールファイルを削除します。
.It
ユーザが所有する全ファイルを
.Pa /tmp ,
.Pa /var/tmp ,
.Pa /var/tmp/vi.recover ,
から削除します。
.It
ユーザ名を
.Pa /etc/group
の全てのグループから削除します。
(グループが空になりかつグループ名とユーザ名が等しければ、
グループも削除されます。これは、
.Xr adduser 8
がユーザ 1 人に対して唯一のグループを与えているためです)。
.El
.Pp
.Nm
ユーティリティは、
ユーザ id が 0 であるユーザ (典型的には root です) の削除は丁寧に拒否します。
この仕様は、ある動作 (つまり、ユーザの全プロセスを殺したり
ユーザのホームディレクトリを削除すること) が実行システムにダメージを
与えうることを考慮しています。
ユーザ id が 0 であるユーザを削除することが必要な場合は、
.Xr vipw 8
を参照し、パスワードファイルを直接編集する方法を調べてください。
これにより、望みのユーザの
.Xr passwd 5
エントリを手動で削除可能です。
.Pp
「断言的」に実行されていない場合 (つまり
.Fl y
オプションが指定されていない場合) は、
.Nm
は、選択されたユーザのパスワードファイルエントリを表示し、
本当に消したいユーザであるのか尋ねます。ユーザのホームディレクトリが
ユーザ所有であれば、
.Nm
はユーザのホームディレクトリ以下の全てを消してもいいのかどうか
訊いてきます。
.Pp
.Nm
の動作中、現在なにをやっているかをユーザに知らせます。
エラーが発生すると、標準エラー出力にそれを表示し、
.Nm
が動作継続可能であれば動作を継続します。
.Pp
以下のオプションが利用可能です。
.Pp
.Bl -tag -width username
.It Fl y
断言します - 問われる質問は全て断言 (すなわち肯定) します。
このオプションを指定する場合にはユーザ名も指定する必要があります。
.It Ar \&username
消去するユーザを指定します。
指定されていなければ、
.Nm
は、対話的に消去するユーザを尋ねます。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/master.passwd -compact
.It Pa /etc/master.passwd
.It Pa /etc/passwd
.It Pa /etc/group
.It Pa /etc/spwd.db
.It Pa /etc/pwd.db
.El
.Sh 関連項目
.Xr at 1 ,
.Xr chpass 1 ,
.Xr crontab 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr group 5 ,
.Xr passwd 5 ,
.Xr adduser 8 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Sh 歴史
.Nm
ユーティリティは、
.Fx 2.2
から導入されました。
.\" .Sh 作者
.\" Guy Helmer, Ames, Iowa
.Sh バグ
.Nm
ユーティリティは、包括的にファイルシステムを検索して
削除されたユーザの全ファイルを消すわけではありません;
あらゆる規模のシステムにおいてもこのようなことをしてしまうと、
法外なほど遅くなり I/O 負荷がかかります。また、
.Nm
ユーティリティは、ユーザが
.Pa /tmp
や
.Pa /var/tmp
に作成したシンボリックリンクを削除できません。
なぜなら、
.Bx 4.4
ファイルシステムではシンボリクリンクを誰が作成したかの情報
を持たないからです。
さらに、
.Pa /var/mail
には、
.Pa /var/mail/username
でも
.Pa /var/mail/.pop.username
でもないファイルで、削除されたユーザ所有ではないものの、
削除すべきファイルが有るかもしれません。
.Pp
.Nm
ユーティリティは NIS (Yellow Pages) については何も知りませんので、
ローカルパスワードファイルに対してのみ動作します。
