freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rndcontrol.8
.\"
.\" Copyright (c) 1995
.\"	Mark Murray.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Mark Murray
.\"	and Theodore Ts'o
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY MARK MURRAY AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL MARK MURRAY OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/rndcontrol/rndcontrol.8,v 1.8.2.2 2000/03/06 11:37:07 sheldonh Exp %
.\" jpman %Id: rndcontrol.8,v 1.3 1997/08/16 13:39:03 horikawa Stab %
.\"
.Dd October 20, 1995
.Dt RNDCONTROL 8
.Os FreeBSD 2
.Sh 名称
.Nm rndcontrol 
.Nd /dev/random デバイス操作ユーティリティ
.Sh 書式
.Nm rndcontrol
.Op Fl q
.Op Fl s Ar irq_no
.Op Fl c Ar irq_no
.Sh 解説
.Nm
コマンドは、カーネルが管理する「エントロピーのたまり場」を
乱数化するためにどの割り込みを使用するかを設定するのに用いられます。
デバイス
.Pa /dev/random
と
.Pa /dev/urandom
がこの乱数源とのユーザインタフェースになります。
いかなる変更も直ちに有効になります。
.Sh オプション
以下のコマンドラインオプションがサポートされています:
.Bl -tag -width indent 
.It Fl q
エラー以外の全ての出力を抑制します。
.It Fl s  Ar n
IRQ
.Ar n
を乱数源として使用します。
このオプションを複数使用して、複数の IRQ を指定することもできます。
.It Fl c  Ar n
IRQ
.Ar n
を乱数源として使用するのをやめます。
このオプションを複数使用して、複数の IRQ を指定することもできます。
.El
.Pp
デフォルトではどの IRQ も使用しません。
.Pp
.Sh 関連ファイル
.Bl -tag -width /dev/urandom -compact
.It Pa /dev/random
安全な乱数デバイス
.It Pa /dev/urandom
乱数デバイス
.El
.Sh バグ
きっと何かあるでしょう。
.Sh 関連項目
.Xr random 4 
.Sh 作者
.An Theodore Ts'o
がコアとなるコードを書きました。
.An Mark Murray
がこのコードを FreeBSD に移植し、
サポートルーチンを書き、マニュアルページを作成しました。
.Sh 歴史
.Nm
は
.Fx 2.1.5
で初めて登場しました。
