freebsd/freebsd-doc/ja_JP.eucJP/man/man8/route6d.8
.\"	%FreeBSD: src/usr.sbin/route6d/route6d.8,v 1.1.2.2 2000/10/29 00:18:04 kris Exp %
.\"	%KAME: route6d.8,v 1.8 2000/05/31 17:00:09 itojun Exp %
.\" Copyright (c) 1996 WIDE Project. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modifications, are permitted provided that the above copyright notice
.\" and this paragraph are duplicated in all such forms and that any
.\" documentation, advertising materials, and other materials related to
.\" such distribution and use acknowledge that the software was developed
.\" by the WIDE Project, Japan. The name of the Project may not be used to
.\" endorse or promote products derived from this software without
.\" specific prior written permission. THIS SOFTWARE IS PROVIDED ``AS IS''
.\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT
.\" LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE.
.\"
.\" jpman %Id: route6d.8,v 1.3 2000/05/02 03:35:46 horikawa Stab %
.Dd January 31, 1997
.Dt ROUTE6D 8
.Os KAME
.Sh 名称
.Nm route6d
.Nd RIP6 ルーティングデーモン
.Sh 書式
.Nm route6d
.Op Fl adDhlqsS
.Bk -words
.Op Fl R Ar routelog
.Ek
.Bk -words
.Op Fl A Ar prefix/preflen,if1[,if2...]
.Ek
.Bk -words
.Op Fl L Ar prefix/preflen,if1[,if2...]
.Ek
.Bk -words
.Op Fl N Ar if1[,if2...]
.Ek
.Bk -words
.Op Fl O Ar prefix/preflen,if1[,if2...]
.Ek
.Bk -words
.Op Fl T Ar if1[,if2...]
.Ek
.Bk -words
.Op Fl t Ar tag
.Ek
.\"
.Sh 解説
.Nm
は RIP over IPv6 をサポートするルーティングデーモンです。
.Pp
オプションは以下の通りです。
.Bl -tag -width indent
.\"
.It Fl a
静的に定義された経路のエイジングを有効にします。
このオプションが指定されると、静的に定義された経路は、
あたかも
.Nm
の開始時にその経路を受け取ったかのように、
対応する経路更新情報が到着しないと削除されことになります。
.\"
.It Fl R Ar routelog
このオプションは
.Nm
にファイル
.Ar routelog
へ経路の変更 (追加/削除) を記録させます。
.\"
.It Fl A Ar prefix/preflen,if1[,if2...]
このオプションは経路の集約のために使用されます。
.Ar prefix/preflen
は集約される経路のプレフィックスとプレフィックス長を指定します。
経路を通知する時、
.Nm
は、集約に含まれる特定の経路をフィルタし、集約された経路
.Ar prefix/preflen 
を、コンマで区切られたリストで指定されたインタフェース
.Ar if1[,if2...] 
へ通知します。
.Nm
は、カーネルルーティングテーブル内に、
.Ar prefix/preflen
への静的な経路を
.Dv RTF_REJECT
フラグ付で作成します。
.\"
.It Fl d
デバックメッセージの出力を有効にします。
このオプションは
.Nm
に
.Pq デーモンモードではなく
フォアグラウンドモードで動作するようにも指示します。
.\"
.It Fl D
デバッグメッセージの拡張出力を有効にします。
このオプションは
.Nm
に
.Pq デーモンモードではなく
フォアグラウンドモードで動作するようにも指示します。
.\"
.It Fl h
split horizon 処理を無効にします。
.\"
.It Fl l
.Nm
はデフォルトでは安全上の理由からサイトローカルの経路を交換しません。
これはサイトローカルのアドレス空間はあいまいであり
.Pq 仕様は現在もまだ検討中です
 、サイトローカルの境界を定義する良い方法がないためです。
.Fl l
オプションを指定すると、
.Nm
はサイトローカルアドレスも変更します。
.Fl l
オプションは全てのインタフェースが同じサイト内にあると仮定しているため、
このオプションはサイトの境界ルータでは使用してはいけません。
.\"
.It Fl L Ar prefix/preflen,if1[,if2...]
インタフェース
.Ar if1,[if2...] 
から到着する経路をフィルタします。
.Nm
は
.Ar prefix/preflen 
の範囲内の経路を受け入れます。
.Fl L
オプションが複数指定された場合、
オプションのうちのどれかひとつに適合する任意の経路が受け入れられます。
.Li ::/0
は特別にデフォルト経路として扱われ、
.Do
0 以上のプレフィクス長を持つ任意の経路
.Dc 
とはなりません。
任意の経路を受け入れたい場合には、
.Fl L
オプションを指定してはいけません。
例えば、
.Do
.Fl L
.Li 3ffe::/16,if1
.Fl L
.Li ::/0,if1
.Dc
が指定されると、
.Nm
はデフォルト経路と 6bone テストアドレスを受け入れますが、それ以外は拒否します。
.\"
.It Fl N Ar if1[,if2...]
.Ar if1,[if2...]
で指定されたインタフェース上では、経路を待ち受けず、通知もしません。
.\"
.It Fl O Ar prefix/preflen,if1[,if2...]
.Ar if1,[if2...] 
で指定されたインタフェースへの経路通知を制限します。
このオプションを指定すると、
.Nm
は
.Ar prefix/preflen 
に適合する経路のみを通知します。
.\"
.It Fl q
.Nm
を待ち受けモードにします。
通知は送信されません。
.\"
.It Fl s
.Nm
を起動された時にカーネルルーティングテーブル内に存在する
静的に定義された経路を通知するようにします。
通知は一般的な split horizon 規則に従います。
.\"
.It Fl S
このオプションは split horizon が適用されないことを除けば
.Fl s
オプションと同じです。
.\"
.It Fl T Ar if1[,if2...]
.Ar if1,[if2...] 
へはデフォルト経路のみを通知します。
.\"
.It Fl t Ar tag
発信元となる経路エントリに経路タグ
.Ar tag
をつけます。
.Ar tag
は 10 進数でも、
.Li 0 
を前置する 8 進数でも、
.Li 0x 
を前置する 16 進数も指定可能です。
.\"
.El
.Pp
シグナル
.Dv SIGINT
か
.Dv SIGUSR1 
の受信により、
.Nm
は現在の内部状態を
.Pa /var/run/route6d_dump 
にダンプをとります。
.\"
.Sh 関連ファイル
.Bl -tag -width /var/run/route6d_dump -compact
.Dv SIGINT
や
.Dv SIGUSR1
に対して
.It Pa /var/run/route6d_dump
へ内部状態のダンプをとります。
.El
.\"
.Sh 関連項目
.Rs
.%A G. Malkin
.%A R. Minnear
.%T RIPng for IPv6
.%R RFC2080
.%D January 1997
.Re
.\"
.Sh 注
.Nm
はリンクローカルアドレスを使用して相手と通信をするために、
RFC2292 で定義された IPv6 advanced API を使用します。
.Pp
.Nm
は内部的にはインタフェース識別子をリンクローカルアドレス
.Po
.Li fe80::xx
と
.Li ff02::xx
.Pc
の 32 から 63 ビットに埋め込みますので、それらは内部状態のダンプファイル
.Pq Pa /var/run/route6d_dump 
で見ることで出来るでしょう。
.Pp
ルーティングテーブルの操作は IPv6 の実装毎に異なります。
現在、
.Nm
は WIDE Hydrangea/KAME IPv6 kernel に従い、
他のプラットホームでは動作出来ません。
.Pp
現在の
.Nm
は、更新が連続到着しても、引き起こされる更新の頻度を減らしません。
