freebsd/freebsd-doc/ja_JP.eucJP/man/man8/route.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)route.8	8.3 (Berkeley) 3/19/94
.\" %FreeBSD: src/sbin/route/route.8,v 1.17.2.1 2000/10/06 08:54:04 ru Exp %
.\"
.\" jpman %Id: route.8,v 1.3 1997/07/28 05:33:13 konuma Stab %
.\"
.Dd March 19, 1994
.Dt ROUTE 8
.Os BSD 4.4
.Sh 名称
.Nm route
.Nd マニュアルでルーティングテーブルを操作する
.Sh 書式
.Nm route
.Op Fl dnqtv
.Ar command
.Oo
.Op Ar modifiers
.Ar args
.Oc
.Sh 解説
.Nm
はネットワークルーティングテーブルを
マニュアルで操作するユーティリティです。
通常は、
.Xr routed 8
のようなシステムルーティングテーブル管理デーモンが
保守をしているので、マニュアルでの操作は必要ありません。
.Pp
.Nm
ユーティリティは指定できるオプションは少数ですが、
強力なコマンド言語をサポートしています。ユーザは
.Xr route 4
において解説されているプログラム可能なインタフェイスを通して、
任意の要求を指定することができます。
.Pp
以下のオプションを使用可能です:
.Bl -tag -width indnent
.It Fl n
レポートの出力において、ホスト名とネットワーク名のシンボル名での表示を
抑止します。
(シンボル名と数字によるアドレスの変換処理には時間がかかり、
またネットワークが正常に動作している必要があります。
そのため、特にネットワークの動作の修正中には、
変換処理を行なわない方が好都合かもしれません。)
.It Fl v
(冗長モード) 詳細な情報を出力します。
.It Fl q
全ての出力を行ないません。
.El
.Pp
.Nm
ユーティリティでは以下の 6 つのコマンドを提供しています。
.Pp
.Bl -tag -width Fl -compact
.It Cm add
ルートを追加します。
.It Cm flush
全てのルートを削除します。
.It Cm delete
指定されたルートを削除します。
.It Cm change
ルートの属性 (ゲートウェイなど) を変更します。
.It Cm get
ある宛先に対するルートを検索し、表示します。
.It Cm monitor
ルーティング情報ベースの変更、ルーティング検索の失敗、
ネットワーク分割の疑いなどの情報を継続的に報告します。
.El
.Pp
monitor コマンドは以下の書式です。
.Pp
.Bd -filled -offset indent -compact
.Nm route Op Fl n
.Cm monitor
.Ed
.Pp
flush コマンドは以下の書式です。
.Pp
.Bd -filled -offset indent -compact
.Nm route Op Fl n
.Cm flush
.Op Ar family
.Ed
.Pp
.Cm flush
コマンドが指定されると、
.Nm
は全てのゲートウェイのエントリにおけるルーティングテーブルを削除します。
アドレスファミリが
.Fl osi ,
.Fl xns ,
.Fl atalk ,
.Fl inet6 ,
.Fl inet
のいずれかの修飾子によって指定されている場合、
そのアドレスファミリの宛先を持つルートだけが削除されます。
.Pp
その他のコマンドは以下の書式です。
.Pp
.Bd -filled -offset indent -compact
.Nm route Op Fl n
.Ar command
.Op Fl net No \&| Fl host
.Ar destination gateway
.Op Ar netmask
.Ed
.Pp
ここで
.Ar destination
は宛先のホストもしくはネットワークです。
.Ar gateway
はパケットがルートされるべき次の中継点です。
ある特定のホストへのルートは、
.Ar destination
で指定されたインターネットアドレスを解釈することによって、
ネットワークへのルートと区別されます。
オプションの修飾子
.Fl net ,
.Fl host
が指定されると、
.Ar destination
をそれぞれネットワークもしくはホストとして強制的に解釈します。
これらの修飾子がないなら、
.Ar destination
に INADDR_ANY 
.Pq Li 0.0.0.0
の
.Dq ローカルアドレス部
が含まれるか
.Ar destination
がネットワークのシンボル名である場合はネットワークへのルート、
その他の場合はホストへのルートと想定します。
.Ar destination
は、
.Ar host Ns / Ns Ar bits
の書式でも指定可能です。
.Pp
例えば、
.Li 128.32
は
.Fl host Li 128.0.0.32
として解釈されます。
.Li 128.32.130
は
.Fl host Li 128.32.0.130
として、
.Fl net Li 128.32
は
.Li 128.32.0.0
として、
.Fl net Li 128.32.130
は
.Li 128.32.130.0
として解釈されます。
.Li 192.168.0.0/16
は
.Li 192.168.0.0 Fl netmask Li 255.255.0.0
として解釈されます。
.Pp
.Ar destination
に対する
.Ar default
指定は、
.Fl net Li 0.0.0.0
と同じ意味であり、デフォルト経路です。
.Pp
宛先がゲートウェイとして動作する中継点なしで、
あるインタフェイスから直接到達可能な場合、
.Fl interface
修飾子を指定しなければなりません。
この場合、指定されたゲートウェイは共通なネットワーク上の
ローカルホストのアドレスとなり、
そのインタフェイスが転送に使用されることを示します。
また、インタフェイスが point to point 接続の場合、
インタフェイスをその名前で指定できます。
この場合、ローカルやリモートのアドレスが変更されても
そのルートは有効のまま残ります。
.Pp
オプションの修飾子
.Fl xns ,
.Fl osi ,
.Fl atalk ,
.Fl link 
はそれに続いて指定されるアドレスが、それぞれ
.Tn XNS ,
.Tn OSI ,
.Tn AppleTalk
アドレスファミリである、もしくはリンクレベルのアドレスであることを指定します。
これらの場合、名前はシンボル名ではなく、
数字によって指定をおこなわなければなりません。
.Pp
オプションの修飾子
.Fl netmask
はネットマスクオプションつきの
.Tn OSI
.Tn ESIS
プロトコルによるリダイレクトの効果を実現するためのものです。
つまり、ネットワークインタフェイスの暗黙のネットマスクとは異なる
ネットマスクをもつサブネットを手動で追加します。
(この方法によらない場合は、OSPF や ISIS ルーティングプロトコルによって
通信します。)
この修飾子に続いて、アドレスパラメータ 
(これはネットワークマスクとして解釈されます) を指定します。
AF_INET の場合に生成される暗黙のネットワークマスクは、
このオプションを
.Ar destination
パラメータに続いて指定することによって、上書きすることができます。
.Pp
.Dv AF_INET6
では、
.Fl mask
修飾子の代りに
.Fl prefixlen
修飾子が使用可能です。IPv6 では非連続なマスクが許されないためです。
例えば
.Fl prefixlen Li 32
はネットワークマスク
.Li ffff:ffff:0000:0000:0000:0000:0000:0000
の使用を指定します。
prefixlen のデフォルト値は 64 であり、
集約可能  (aggregatable) アドレスと共に動作可能となっています。
ただし、
.Cm default
指定時には 0 が仮定されます。
この修飾子は
.Dv AF_INET6
アドレスファミリのみで動作可能なことに注意してください。
.Pp
ルートにはいくつかのフラグがあり、
そのルートを使う宛先にデータを送信する時のプロトコルの動作に
影響をおよぼします。
これらのフラグは以下の修飾子によってセット (もしくはクリア) できます。
.Bd -literal
-cloning   RTF_CLONING    - 使用中のルートを新たにひとつ生成する。
-xresolve  RTF_XRESOLVE   - (外部からの検索に対して) 使用中である旨のメッ
                            セージを発行する。
-iface    ~RTF_GATEWAY    - 宛先が直接到達可能。
-static    RTF_STATIC     - 手動でルートを追加する。
-nostatic ~RTF_STATIC     - カーネルかデーモンによってルートが追加された
                            ように振舞う。
-reject    RTF_REJECT     - マッチした場合に ICMP unreachable を出力する。
-blackhole RTF_BLACKHOLE  - (更新中に) 何も報告せずにパケットを捨てる。
-proto1    RTF_PROTO1     - プロトコルに特有のフラグ #1 をセットする。
-proto2    RTF_PROTO2     - プロトコルに特有のフラグ #2 をセットする。
-llinfo    RTF_LLINFO     - プロトコルアドレスからリンクアドレスへの変換の
                            正当性をチェックする。
.Ed
.Pp
オプションの修飾子
.Fl rtt ,
.Fl rttvar ,
.Fl sendpipe ,
.Fl recvpipe ,
.Fl mtu ,
.Fl hopcount ,
.Fl expire ,
.Fl ssthresh
によって TCP や TP4 のトランスポートレベルのプロトコルによる
ルーティングのエントリ中でメインテナンスされる値の初期値を指定します。
これらは各々の修飾子の前に
.Fl lock
メタ修飾子を指定することによって、個別にその値をロックすることができます。
また
.Fl lockrest
メタ修飾子をつけることによって、
その後に続く全ての値をロックすることもできます。
.Pp
.Cm change
もしくは
.Cm add
コマンドにおいて、
.Ar destination
もしくは
.Ar gateway
がルートを特定するのに不十分であった場合 
(たとえば
.Tn ISO
のケースにおいて、複数のインタフェイスが同じアドレスを持っているような場合)、
.Fl ifp
や
.Fl ifa
修飾子を使うことによって、
インタフェイスやインタフェイスアドレスを特定することができます。
.Pp
.Ar destination
や
.Ar gateway
で指定された全てのシンボル名は、まずホスト名として
.Xr gethostbyname 3
を使用して検索されます。検索に失敗した場合は、その名前をネットワーク名と見なし
.Xr getnetbyname 3
によって検索されます。
.Pp
.Nm
はルーティングソケットと新しいメッセージタイプである
RTM_ADD,
RTM_DELETE,
RTM_GET,
RTM_CHANGE
を使います。
ルーティングテーブルの変更はスーパユーザのみがおこなうことができます。
.Sh 診断
.Bl -tag -width Ds
.It Sy "add [host \&| network ] %s: gateway %s flags %x"
指定されたルートがテーブルに追加されました。
出力された値は
.Xr ioctl 2
の呼出しの中で使われたルーティングテーブルのエントリからのものです。
指定されたゲートウェイアドレスがそのゲートウェイのプライマリアドレス 
(
.Xr gethostbyname 3
によって返される最初のもの) でなかった場合、
ゲートウェイアドレスがシンボル名に加えて、数字でも表示されます。
.It Sy "delete [ host \&| network ] %s: gateway %s flags %x" 
指定されたルートがテーブルから削除されました。
.It Sy "%s %s done"
.Cm flush
コマンドが指定された場合、削除された各ルーティングテーブルエントリが
この形式のメッセージで報告されます。
.It Sy "Network is unreachable"
指定されたゲートウェイが直接到達可能なネットワーク上にないために、
ルートの追加に失敗しました。
hop 数が 1 であるゲートウェイを指定しなければなりません。
.It Sy "not in table"
テーブルにないエントリを削除しようとしました。
.It Sy "routing table overflow"
ルートの追加を試みましたが、システムの資源が少なく、
新しいエントリを作成するためのメモリを割り当てられませんでした。
.El
.Sh 関連項目
.Xr netintro 4 ,
.Xr route 4 ,
.Xr IPXrouted 8 ,
.Xr routed 8
.\" .Xr XNSrouted 8
.\" Xr esis 4 ,
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
.Sh バグ
最初の段落は多少
.Xr routed 8
の能力を大げさに書いています。
