freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpc.umntall.8
.\"
.\" Copyright (c) 1999 Martin Blapp
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/rpc.umntall/rpc.umntall.8,v 1.6 2000/03/06 09:45:35 sheldonh Exp %
.\"
.\" jpman %Id: rpc.umntall.8,v 1.4 2000/05/10 13:48:03 takaha Stab %
.Dd November 17, 1999
.Dt RPC.UMNTALL 8
.Os
.Sh 名称
.Nm rpc.umntall
.Nd アンマウントされた NFS ファイルシステムを NFS サーバに通知する
.Sh 書式
.Nm rpc.umntall
.Op Fl e Ar expire
.Op Fl h Ar host
.Op Fl k
.Op Fl p Ar remotepath
.Op Fl v
.Sh 解説
.Nm
は
.Tn NFS
RPC 仕様で提案されているコマンドです。
.Rs
.%T "NFS Version 3 Protocol Specification"
.%O "RFC 1813, Appendix I"
.Re
を参照してください。
本コマンドは、遠隔手続き呼び出しを使用し、
リモート NFS サーバ上の
.Pa /var/db/mountdtab
からマウントエントリを削除します。
本コマンドは、システムの起動時とシャットダウン時に、
パラメータ無しに自動的に呼び出されます。
これにより、古くて無効になったエントリを
.Xr showmount 8
が表示しないよう保証します。
.Nm
コマンドはクライアント側にのみ必要です。
クライアント側では、
.Xr mount_nfs 8
がマウントエントリを現在の日付と共に
.Pa /var/db/mounttab
に追加し、
.Xr umount 8
が今度はエントリを削除します。
.Nm
コマンドは、クラッシュや不適切なシャットダウンによって
この表に残ってしまった全エントリの面倒を見ます。
.Pp
オプションは次の通りです:
.Bl -tag -width indentxxx
.It Fl e Ar expire
実際にはマウントされていないエントリまたは
.Ar expire
(秒) よりも古いエントリを、
.Pa /var/db/mounttab
からすべて削除します。
DNS が変更された場合、
または長期間サービスが提供されなかった場合、これにあてはまります。
デフォルトの無効化時間は 86400 秒 (1 日) です。
.It Fl h Ar host
特定のホスト名のみ削除します。
UMNTALL RPC を NFS サーバへ送ります。
.It Fl k
既存の NFS ファイルシステム用のエントリを保持します。
mounttab からの NFS ファイルシステムとカーネルのマウントリストを比較し、
既存のマウントエントリへは RPC を送信しません。
これはシステム起動時に有用です。
既にマウント済の NFS ファイルシステムが存在する可能性がありますので、
RPC UMOUNT の呼び出しは良くありません。
ユーザが「シングルユーザモード」へリブートしてから、
システムを再起動する場合、これにあてはまります。
.It Fl p Ar path
特定のマウントパスのみ削除します。
UMOUNT RPC を NFS サーバへ送ります。
本コマンドは
.Fl host
オプションを暗黙的に指定します。
.It Fl v
冗長になり、
mounttab の各エントリの処理毎に、追加情報が表示されます。
.El
.Sh 関連ファイル
.Bl -tag -width /var/db/mounttab -compact
.It Pa /var/db/mounttab
マウント済みの NFS ファイルシステム
.El
.Sh 歴史
.Nm
は
.Fx 4.0
ではじめて登場しました。
.Sh 関連項目
.Xr mount_nfs 8 ,
.Xr mountd 8 ,
.Xr umount 8
.Sh 作者
.An Martin Blapp Aq mb@imp.ch
