freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpc.ypxfrd.8
.\" Copyright (c) 1995, 1996
.\"	Bill Paul <wpaul@ctr.columbia.edu>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/rpc.ypxfrd/rpc.ypxfrd.8,v 1.7.2.1 1999/08/29 15:48:03 peter Exp %
.\" jpman %Id: rpc.ypxfrd.8,v 1.3 1997/09/04 17:48:28 horikawa Stab %
.\"
.Dd June 2, 1996
.Dt RPC.YPXFRD 8
.Os
.Sh 名称
.Nm rpc.ypxfrd
.Nd "NIS マップ転送サーバ"
.Sh 書式
.Nm rpc.ypxfrd
.Op Fl p Ar path
.Sh 解説
.Nm
デーモンは NIS マスタサーバから NIS スレーブサーバへの巨大な NIS
マップの配布を高速化するためのに使われます。通常、マップの転送はいくつ
かの手順を経ます:
.Bl -bullet -offset indent
.It
マスタサーバが
.Xr yppush 8
を呼び出し、スレーブサーバが転送を開始するよう指示します。
.It
スレーブサーバは、
.Xr ypxfr 8
を起動します。
.Xr ypxfr 8
は、マスタサーバから yp_all() を使ってマップの内容をすべて読みます。
.It
次に
.Xr ypxfr 8
は、
.Xr db 3
ライブラリを使ってサーバから受け取ったデータをハッシュし新しいマップ
データベースファイルを作成します。
.It
全てのデータを書き終えてから、
.Xr ypxfr 8
は、新しいファイルを置き換え、ローカルマシンの
.Xr ypserv 8
宛にデータベースハンドルを更新するよう YPPROC_CLEAR を送ります。
.El
.Pp
巨大なマップが含まれている場合、この処理に数分かかることがあります。
たとえば、数万のエントリのあるパスワードデータベースでは、数メガバイト
のディスクを消費し、
.Xr db 3
ライブラリがハッシュテーブルに全てのエントリをソートし納めるのに
長時間かかります。さらに、マップファイルは2セットあります:
.Pa master.passwd.by{name,uid}
と
.Pa passwd.by{name,uid}
です。
.Pp
.Nm
サーバは NIS スレーブサーバがマスターサーバのマップファイルを
コピーし、マップファイルの構築を行わないことで、転送処理を高速化し
ます。
.Nm
は、単に RPC ベースのファイル転送プロトコルを実装しているだけです。
十分に高速なスレーブサーバが数メガバイトのファイルからマップを構築する
のに数分かかるのにたいし、転送では数秒しかかかりません。
.Pp
.Nm
サーバは、
.Xr ypserv 8
と同じアクセス制限メカニズムを使っています。
したがって、
.Xr securenets 5
データベースで許されているスレーブサーバのみがファイルを転送できます。
さらに、reserved ポートを使うスレーブサーバのみが、
.Pa master.passwd
マップを転送することを許されています。
.Sh オプション
オプションは以下の通りです:
.Bl -tag -width indent
.It Fl p Ar path
このオプションにより、デフォルトの NIS データベースへのパスを変更しま
す。デフォルトパスは、
.Pa /var/yp
です。
.El
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /var/yp/[domainname]/[maps]
ある NIS ドメインの NIS マップ群。
.El
.Sh 関連項目
.Xr yp 4 ,
.Xr yppush 8 ,
.Xr ypserv 8 ,
.Xr ypxfr 8
.Sh バグ
.Bx Free
の
.Nm
プロトコルは SunOS で使われているものと互換性がありません。これは残念な
ことではありますが、避けることが出来ません: Sun のプロトコルは
自由に入手することは出来ず、さらに入手できたとしても、
SunOS NIS v2 の実装ではマップデータベースに ndbm パッケージを使ってお
り、
.Bx Free
の実装で使われている Berkeley DB パッケージではないため不便です。
これらの二つのパッケージ間のフォーマットは非常に異なっています。
さらに、 ndbm はバイトオーダの問題があり、ビッグエンディアンのシステムで
作った ndbm データベースはリトルエンディアンのシステムでは読むことが出来
ません。
.Sh 作者
.An Bill Paul Aq wpaul@ctr.columbia.edu
