freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpc.rquotad.8
.\" 
.\" Copyright (c) 1994 Theo de Raadt
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Theo de Raadt.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/libexec/rpc.rquotad/rpc.rquotad.8,v 1.7 2000/01/23 02:18:15 mpp Exp %
.\"
.\" jpman %Id: rpc.rquotad.8,v 1.3 1997/09/04 17:40:03 horikawa Stab %
.\"
.Dd June 22, 1994
.Dt RPC.RQUOTAD 8
.Os BSD 4.3
.Sh 名称
.Nm rpc.rquotad 
.Nd リモートの quota (割り当て制限) サーバ
.Sh 書式
.Nm /usr/libexec/rpc.rquotad
.Sh 解説
.Nm
は、リモートマシンへ NFS マウントされているファイルシステムについて
ユーザに対するローカルマシンでの割り当て制限値を返す
.Xr rpc 3
サーバです。
.Xr quota 1
は、リモートファイルシステムの割り
当て制限値を表示するために本サーバを用います。
.Nm
は通常
.Xr inetd 8
から起動されます。
.Pp
.Nm
.Pa /usr/include/rpcsvc/rquota.x
で定義される
.Tn RPC
プロトコルを使用します。
.Sh バグ
.Bx 4.4
と
.Fx
はグループに対する割り当て制限をサポートしていますが、
rqutoa プロトコルはこれをサポートしていません。
.Sh 関連項目
.Xr quota 1
