freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpc.statd.8
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1995 A.R.Gordon, andrew.gordon@net-tel.co.uk
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/rpc.statd/rpc.statd.8,v 1.7 1999/08/28 01:19:38 peter Exp %
.\" jpman %Id: rpc.statd.8,v 1.3 1997/09/04 17:44:05 horikawa Stab %
.\"
.Dd September 19, 1995
.Dt RPC.STATD 8
.Os
.Sh 名称
.Nm rpc.statd 
.Nd ホストステータス監視デーモン
.Sh 書式
.Nm rpc.statd
.Op Fl d
.Sh 解説
.Nm
は、他のホスト上の rpc.statd デーモンと協調してステータスの監視
サービスを提供するデーモンです。
デーモンは、ローカルホスト上で動くプログラム (たとえば
.Xr rpc.lockd 8
NFS ファイルロックデーモン) からのリクエストを受け取り、
指定したホストのステータスを監視します。
監視中のホストがクラッシュし再起動すると、リモートのデーモンは
そのことをローカルデーモンに対し知らせ、さらにローカルデーモンが
監視サービスをリクエスト
したローカルプログラムに対して知らせます。
逆に、もしこのホストがクラッシュし再起動すると、
.Nm
は再起動時に、クラッシュ時に監視していた全てのホストに対してクラッシュ
が起こったことを知らせます。
.Pp
.Nm
のオプションは以下のとおりです:
.Bl -tag -width indent
.It Fl d
syslog を通してデバッグ情報を書くようになります。
デーモンへの全ての RPC トランザクションが記録されます。
このメッセージは level が LOG_DEBUG で facility が LOG_DAEMON として
記録されます。
エラーの状態は、このオプションに関わらず、log level が LOG_ERR で
facility が LOG_DAEMON として syslog を通して記録されます。
.El
.Pp
.Nm
デーモンは
.Xr inetd 8
から起動してはいけません。これは、プロトコルが、システムの開始時に
デーモンが起動されていることを仮定しているためです。
デーモンは
.Xr rc 8
によりネットワークの開始後に起動されるべきです。
.Sh 関連ファイル
.Bl -tag -width /usr/include/rpcsvc/sm_inter.x -compact
.It Pa /var/db/statd.status
現在監視しているホストの不揮発レコード
.It Pa /usr/include/rpcsvc/sm_inter.x
ローカルアプリケーションが監視リクエストを登録するために使う RPC プロトコル
の仕様。
.El
.Sh 関連項目
.Xr syslog 3 ,
.Xr rc 8 ,
.Xr rpc.lockd 8
.Sh バグ
監視中のホストが (致命的なハードウェア障害などのため) 永久に見えなくなっ
たことをデーモンが知る手段はありませんが、
ホストや中間のルータの一時的な障害は知ることは出来ます。
現在の実装では、リトライは 10 分間隔、つぎは 1 時間ごとに行い、最後に 24 時間
経つとあきらめます。

プロトコルでは、監視関係の確立に、
ローカルとリモートの両方のデーモンで対称に監視リクエストを行うことを
要求しています。
これは NFS のロックプロトコルの場合は便利ですが、
おそらく他のアプリケーション用の監視システムとしての
有用性が低下しています。

現在の実装では、各監視ホストにつき 1Kbytes の領域が
ステータスファイル内 (VM 内にも) に確保されます。このため、
多くのクライアントを抱える NFS サーバでは非効率的であるかもしれません。
.Sh 標準
実装は、
X/Open CAE Specification
C218, "Protocols for X/Open PC Interworking: XNFS, Issue 4", ISBN 1 872630 66 9
をもとにしています。
