freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpc.lockd.8
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1995 A.R.Gordon, andrew.gordon@net-tel.co.uk
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/rpc.lockd/rpc.lockd.8,v 1.8 1999/08/28 01:19:35 peter Exp %
.\" Original Revision: 1.6
.\" jpman %Id: rpc.lockd.8,v 1.3 1997/09/04 17:38:06 horikawa Stab %
.\"
.Dd September 24, 1995
.Dt RPC.LOCKD 8
.Os
.Sh 名称
.Nm rpc.lockd
.Nd NFS ファイルロックデーモン
.Sh 書式
.Nm rpc.lockd
.Op Fl d Op Ar debug_level
.Sh 解説
.Nm
デーモンは、NFS 環境において、
ファイルやレコードのロックサービスを提供します。
.Pp
.Nm
のオプションは以下のとおりです:
.Bl -tag -width indent
.It Fl d
syslog を通してデバッグ情報を書くようになります。
デーモンへの全ての RPC トランザクションが記録されます。
このメッセージは level が LOG_DEBUG で facility が LOG_DAEMON として
記録されます。 debug_level が指定されない場合には 1 が使われます。
debug_level が 1 の場合、1 つのプロトコル操作につき
1 行のログが作成されます。これより高いデバッグレベルを指定すると、
その操作の引数とデーモンの内部動作も出力するようになります。
.El
.Pp
エラーの状態は、デバッグレベルに関係なく、log level が LOG_ERR で
facility が LOG_DAEMON として syslog を通して記録されます。
.Pp
.Nm
デーモンは
.Xr inetd 8
から起動してはいけません。これは、プロトコルが、システムの開始時に
デーモンが起動されていることを仮定しているためです。
デーモンは
.Xr rc 8
によりネットワークの開始後に起動されるべきです。
.Sh 関連ファイル
.Bl -tag -width /usr/include/rpcsvc/nlm_prot.x -compact
.It Pa /usr/include/rpcsvc/nlm_prot.x
ネットワークロックマネージャプロトコルの RPC プロトコル仕様。
.El
.Sh 関連項目
.Xr syslog 3 ,
.Xr rc 8 ,
.Xr rpc.statd 8
.Sh バグ
現在の実装では、プロトコルのサーバ側しかありません
(つまり、他の OS 上のクライアントは
.Bx Free
ファイルサーバ上にロックを
確立することはできますが、OS が
.Bx Free
上のクライアントがロックを
確立する手段がありません)。
.Pp
プロトコルのバージョン 1, 2, 3 が実装されていますが、
バージョン 2 (Unix systems) および 3 (PC-NFS clients)
が一般的であり、バージョン 1 のクライアントが見つからなかったため
バージョン 1 についてはテストされていません。
.Sh 標準
実装は、
X/Open CAE Specification
C218, "Protocols for X/Open PC Interworking: XNFS, Issue 4", ISBN 1 872630 66 9
をもとにしています。
