freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpc.rusersd.8
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/libexec/rpc.rusersd/rpc.rusersd.8,v 1.6 1999/08/28 00:09:55 peter Exp %
.\" $FreeBSD$
.\"
.Dd June 7, 1993
.Dt RPC.RUSERSD 8
.Os BSD 4.3
.Sh 名称
.Nm rpc.rusersd 
.Nd ログインしているユーザに関する情報のサーバ
.Sh 書式
.Nm /usr/libexec/rpc.rusersd
.Sh 解説
.Nm
は、システムに現在ログインしているユーザに関する情報を
返すサーバです。
.Pp
現在ログインしているユーザについて、
.Xr rusers 1
を用いることで問い合わせることが出来ます。
.Nm
デーモンは、通常
.Xr inetd 8 
から起動されます。
.Pp
.Nm
は、
.Pa /usr/include/rpcsvc/rnusers.x 
に定義された
.Tn RPC
プロトコルを使用します。
.Sh 関連項目
.Xr rusers 1 ,
.Xr w 1 ,
.Xr who 1 ,
.Xr inetd 8
