freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpcbind.8
.\" @(#)rpcbind.1m 1.19 92/09/14 SMI; from SVr4
.\" Copyright 1989 AT&T
.\" Copyright 1991 Sun Microsystems, Inc.
.\" %FreeBSD: src/usr.sbin/rpcbind/rpcbind.8,v 1.5 2002/11/27 15:33:47 ru Exp %
.\"
.\" $FreeBSD$
.Dd September 14, 1992
.Dt RPCBIND 8
.Os
.Sh 名称
.Nm rpcbind
.Nd ユニバーサルアドレスから RPC プログラム番号へのマッパ
.Sh 書式
.Nm
.Op Fl adhiLls
.Sh 解説
.Nm
ユーティリティは、
.Tn RPC
プログラム番号からユニバーサルアドレスへ変換するサーバです。
当該マシン上のサーバが
.Tn RPC
呼び出し可能であるためには、
このプログラムが当該ホスト上で動作していることが必要です。
.Pp
ある
.Tn RPC
サービスが起動されると、それが待機しているアドレスと、
それが提供できる
.Tn RPC
プログラム番号を
.Nm
に対して通知します。
あるプログラム番号に対してクライアントが
.Tn RPC
呼び出しをしたいとき、クライアントは最初にサーバマシン上の
.Nm
にコンタクトし、どのアドレスに
.Tn RPC
要求を遅るべきかを決定します。
.Pp
他の RPC サービスの前に
.Nm
が起動される必要があります。
通常は、標準の
.Tn RPC
サーバはポートモニタによって起動されますので、
.Nm
はポートモニタより前に起動されることが必要です。
.Pp
.Nm
が起動されると、
ある名前からアドレスへの変換呼び出しが正しく機能するかチェックします。
失敗する場合、ネットワーク設定データベースが壊れているのかもしれません。
このような状況では
.Tn RPC
サービスは正しく機能できませんので、
.Nm
は状況報告後に終了します。
.Pp
.Nm
ユーティリティは、スーパユーザによってのみ起動可能です。
.Sh オプション
.Bl -tag -width indent
.It Fl a
デバッグ時
.Pq Fl d
に、エラーが発生すると中断します。
.It Fl d
デバッグモードで実行します。
このモードでは、
.Nm
は開始時にフォークせず、動作中に追加情報を表示し、
.Fl a
も指定されている場合にはエラー時に中断します。
このオプションを指定すると、
名前からアドレスへの変換の一貫性確認の詳細が表示されます。
.It Fl h
UDP 要求に対してバインドする、特定の IP アドレスを指定します。
本オプションは複数回指定可能であり、
典型的には、マルチホームのホストで実行するときに必要となります。
.Fl h
オプションを指定しないと、
.Nm
は
.Dv INADDR_ANY
に対してバインドします。
これは、
.Nm
が UPD パケットを返す IP アドレスが、
受け付けた IP アドレスとは異なるために、
マルチホームホストでは問題となり得ます。
IP アドレスを
.Fl h
で指定すると、
.Nm
は自動的に
.Li 127.0.0.1
と IPv6 が有効な場合には
.Li ::1
をリストに追加します。
.It Fl i
.Dq 安全ではない
モード。
どんなホストからでも SET および UNSET の呼び出しを許可します。
通常、セキュリティ上の理由から、
.Nm
はこれらの要求をループバックインタフェースからのみ受け付けます。
以前のバージョンの RPC ライブラリでコンパイルされたために
これらの要求をループバックインタフェースを使わずに実行するプログラムでは、
この変更が必要です。
.It Fl L
ループバックインタフェースを介した古いスタイルのローカル接続を許可します。
このフラグを指定しないと、
ローカル接続はローカルソケット
.Pa /var/run/rpcbind.sock
を介したもののみ許されます。
.It Fl l
libwrap 接続記録を有効にします。
.It Fl s
可能な限り早期に
.Nm
をユーザデーモンに転換させます。
こうすることにより、
.Nm
が非特権ポートを外向き接続に使うようになり、
特権を持たないクライアントが
.Nm
を使用することで特権ポートからサービスへ接続することを防ぎます。
.El
.Sh 注
.Nm
が再起動された場合、すべての RPC サーバを再起動する必要があります。
.Sh 関連項目
.Xr rpcbind 3 ,
.Xr rpcinfo 8
.Sh 関連ファイル
.Bl -tag -width /var/run/rpcbind.sock -compact
.It Pa /var/run/rpcbind.sock
.El
