freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpcinfo.8
.\" @(#)rpcinfo.1m 1.23 93/03/29 SMI; from SVr4
.\" Copyright 1989 AT&T
.\" Copyright 1991 Sun Microsystems, Inc.
.\" %NetBSD: rpcinfo.8,v 1.6 2000/06/02 23:19:38 fvdl Exp %
.\" %FreeBSD: src/usr.bin/rpcinfo/rpcinfo.8,v 1.9 2002/10/16 15:38:28 charnier Exp %
.\" $FreeBSD$
.Dd August 18, 1992
.Dt RPCINFO 8
.Os
.Sh 名称
.Nm rpcinfo
.Nd RPC に関する情報を表示する
.Sh 書式
.Nm
.Op Fl m | s
.Op Ar host
.Nm
.Op Ar host
.Nm
.Fl T Ar transport
.Ar host prognum
.Op Ar versnum
.Nm
.Fl l
.Op Fl T Ar transport
.Ar host prognum
.Op Ar versnum
.Nm
.Op Fl n Ar portnum
.Fl u
.Ar host prognum
.Op Ar versnum
.Nm
.Op Fl n Ar portnum
.Op Fl t
.Ar host prognum
.Op Ar versnum
.Nm
.Fl a Ar serv_address
.Fl T Ar transport
.Ar prognum
.Op Ar versnum
.Nm
.Fl b
.Op Fl T Ar transport
.Ar prognum versnum
.Nm
.Fl d
.Op Fl T Ar transport
.Ar prognum versnum
.Sh 解説
.Nm
ユーティリティは、RPC サーバに対して
RPC 呼び出しを行ない、得られた情報を表示します。
.Pp
最初の書式では、
.Nm
は
.Nm rpcbind
により
.Ar host
に登録されたすべての RPC サービスのリストを表示します。
.Ar host
が指定されない場合、ローカルホストがデフォルトの値となります。
オプション
.Fl s
が使用されたときは、情報は簡潔な形式で表示されます。
.Pp
2 番目の書式では、
.Nm
は
.Nm rpcbind
バージョン 2 により登録された全ての RPC サービスのリストを表示します。
最初の書式と 2 番目の書式とで、情報の形式が異なることにも注意して下さい。
この理由は、2 番目の書式では、表示する情報を集めるのに使用するプロトコル
(
.Nm rpcbind
プロトコルのバージョン 2) がより古いからです。
.Pp
3 番目の書式は、指定した
.Ar host
に対し、
.Ar prognum
と
.Ar versnum
の手続き 0 の RPC 呼び出しを行ない、応答を受信したかどうかを報告します。
.Ar transport
は、指定したサービスに接触するために用いる必要があるトランスポートです。
このサービスのリモートアドレスは、リモートへの
.Nm rpcbind
呼び出しを行ない取得します。
.Pp
引数
.Ar prognum
は PPC プログラム番号を表す数値です。
.Ar versnum
を指定した場合、
.Nm
は指定した
.Ar prognum
の該当バージョンを呼び出そうとします。この指定がない場合、
次のようにします。
まず、バージョン番号が存在しないと考えられる場合、
.Nm
はバージョン 0 を呼び出し、指定した
.Ar prognum
に対し登録されたバージョン番号全てを探し出そうと試みます。
バージョン番号が存在するならば、代わりに
.Nm
は極めて高いバージョン番号で呼び出しこの情報を得ようと試み、
そして登録されたバージョンそれぞれを呼び出そうとします。
注意:
バージョン番号は、
オプション
.Fl b ,
.Fl d
に必要です。
.Sh オプション
.Bl -tag -width indent
.It Fl T Ar transport
サービスを要求する際のトランスポートを指定します。このオプションが
指定されていない場合、
.Nm
は環境変数
.Ev NETPATH
で指定するトランスポートを使用します。これが set されていないか、
この値が空の場合、
.Xr netconfig 5
データベースの中のトランスポートを使用します。
これは汎用のオプションであり、
.Sx 書式
で示された他のオプションといっしょに使用できます。
.It Fl a Ar serv_address
.Ar serv_address
を (ユニバーサルな) アドレスとして使用し、
.Ar transport
上のサービスを使い、指定した
.Ar prognum
の手続き 0 を ping し、受けとった応答を報告します。
オプション
.Fl a
には、オプション
.Fl T
が必要です。
.Pp
.Ar versnum
の指定がない場合、
.Nm
は、そのプログラム番号で利用可能なバージョン番号全てを
ping しようとします。
このオプションにより、サービスのアドレスを見つけ出すための
リモート
.Nm rpcbind
呼び出しを避けることができます。
.Ar serv_address
は与えられたトランスポートのユニバーサルアドレス形式で指定します。
.It Fl b
指定した
.Ar prognum
と
.Ar versnum
の手続き 0 に対し RPC ブロードキャストを行ない、応答したホスト全てを
報告します。
.Ar transport
が指定されている場合、指定されたトランスポート上でのみ
ブロードキャストします。
どのトランスポートもブロードキャストをサポートしていない場合、
エラーメッセージを表示します。他のシステムに対し悪影響を及ぼす可能性が
あるため、ブロードキャストの使用は節度を持って行なわねばなりません。
.It Fl d
指定した
.Ar prognum
と
.Ar versnum
を持つ RPC サービスの登録を削除します。
.Ar transport が指定された場合、
そのトランスポート上のサービスのみを登録解除します。それ以外の場合、
登録されたトランスポート全ての上のサービスを登録解除します。
スーパユーザを除き、サービスの所有者のみが登録を削除できます。
スーパユーザは任意のサービスを削除できます。
.It Fl l
指定された
.Ar host
の上にある、与えられた
.Ar prognum
と
.Ar versnum
を持つエントリのリストを表示します。
リモート
.Nm rpcbind
に接触する際に用いたものと同じプロトコルファミリの中の
全てのトランスポートに対し、エントリを返されます。
.It Fl m
指定した
.Ar host
に対する
.Nm rpcbind
操作の統計情報表を表示します。
この表は
.Nm rpcbind
の各バージョン (バージョン 2, 3, 4) における統計情報を表示します。
それは、
各手続きがリクエストされ、サービスが成功した回数、
行なわれたリモート呼び出しリクエストの回数とタイプ、
処理した RPC アドレス検出に関する情報を与えてくれます。
これは、
.Ar host
上の RPC 活動をモニタするのに有益です。
.It Fl n Ar portnum
.Fl t ,
.Fl u
のためのポート番号として、
.Nm rpcbind
により与えられるポート番号を使わずに、
.Ar portnum
を代わりに使用します。
このオプションを使用することで、サービスのアドレスを見つけ出すための
リモート
.Nm rpcbind
呼び出しを避けることができます。
このオプションは
.Fl a
オプションにより非推奨にされました。
.It Fl p
.Nm rpcbind
プロトコルのバージョン 2 を用い、ホスト
.Ar host
上の
.Nm rpcbind
を探査し、登録された RPC プログラム全てのリストを表示します。
.Ar host
の指定がない場合、ローカルホストをデフォルトとします。
注意:
.Nm rpcbind
プロトコルのバージョン 2 は、かつて、ポートマッパ (portmapper)
プロトコルという名前で知られていました。
.It Fl s
.Ar host
上の、登録された RPC プログラム全ての簡潔なリストを表示します。
.Ar host
の指定がない場合、ローカルホストをデフォルトとします。
.It Fl t
TCP を用いて、指定した
.Ar host
上の
.Ar prognum
の手続き 0 に対して RPC 呼び出しを行ない、応答があったかどうかを
報告します。このオプションは、3 番目の書式で示した
.Fl T
オプションにより非推奨になりました。
.It Fl u
UDP を用いて、指定した
.Ar host
上の
.Ar prognum
の手続き 0 に対して RPC 呼び出しを行ない、応答があったかどうかを
報告します。このオプションは、3 番目の書式で示した
.Fl T
オプションにより非推奨になりました。
.El
.Sh 使用例
ローカルマシンに登録されている全ての RPC
サービスを見るには、次のようにします。
.Pp
.Dl "example% rpcinfo"
.Pp
ホスト名
.Dq klaxon
を持つマシン上の
.Nm rpcbind
に登録されている全ての RPC サービスを見るには、次のようにします。
.Pp
.Dl "example% rpcinfo klaxon"
.Pp
上記のコマンドにより表示される情報は、かなり長くなる可能性が
あります。オプション
.Fl s
を使うことで、より簡潔なリストを表示させることができます。
.Pp
.Dl "example$ rpcinfo -s klaxon"
.Pp
.Bl -column "program" "version(s)" "unix,tcp,udp,tcp6,udp6" "nlockmgr" "super-user"
.It "program	version(s)	netid(s)	service	owner"
.It "100000	2,3,4	unix,tcp,udp,tcp6,udp6	rpcbind	super-user"
.It "100008	1	udp,tcp,udp6,tcp6	walld	super-user"
.It "100002	2,1	udp,udp6	rusersd	super-user"
.It "100001	2,3,4	udp,udp6	rstatd	super-user"
.It "100012	1	udp,tcp	sprayd	super-user"
.It "100007	3	udp,tcp	ypbind	super-user"
.El
.Pp
トランスポート TCP に対し、名前
.Dq klaxon
を持つマシン上にプログラム番号
.Ar prognum
とバージョン
.Ar versnum
を持つ RPC サービスが登録されているかどうかを示すには、
次のようにします。
.Dl "example% rpcinfo -T tcp klaxon prognum versnum"
.Pp
ローカルマシン上で、
.Nm rpcbind
プロトコルのバージョン 2 により登録された全ての RPC サービスを
表示させるには、次のようにします。
.Dl "example% rpcinfo -p"
.Pp
全てのトランスポートに対し、
バージョン 1 の
.Nm walld
(プログラム番号 100008)
サービスの登録を削除するには、次のようにします。
.Pp
.Dl "example# rpcinfo -d 100008 1"
または、
.Dl "example# rpcinfo -d walld 1"
.Sh 関連項目
.Xr rpc 3 ,
.Xr netconfig 5 ,
.Xr rpc 5 ,
.Xr rpcbind 8
