freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rpcinfo.8
.\"	from: @(#)rpcinfo.8c	2.2 88/08/03 4.0 RPCSRC; from 1.24 88/02/25 SMI
.\" %FreeBSD: src/usr.bin/rpcinfo/rpcinfo.8,v 1.5.2.1 2000/12/08 15:14:03 ru Exp %
.\" $FreeBSD$
.\"
.Dd December 17, 1987
.Dt RPCINFO 8
.Os
.Sh 名称
.Nm rpcinfo
.Nd RPC に関する情報を表示する
.Sh 書式
.Nm
.Fl p
.Op Ar host
.Nm
.Op Fl n Ar portnum
.Fl u Ar host
.Ar program
.Op Ar version
.Nm
.Op Fl n Ar portnum
.Fl t Ar host 
.Ar program
.Op Ar version
.Nm
.Fl b
.Ar program version
.Nm
.Fl d
.Ar program version
.Sh 解説
.Nm
は、
.Tn RPC
サーバに対して
.Tn RPC
呼び出しを行ない、得られた情報を表示します。
.Sh オプション
.Bl -tag -width indent
.It Fl p
指定されたホスト上のポートマッパーを検出し、そこに登録されている全ての
.Tn RPC
プログラムの一覧を出力します。
.Ar host
が指定されない場合、
.Xr hostname 1
コマンドをオプション無しで実行した時に出力されるホスト名が 
.Ar host
として採用されます。
.It Fl u
.Tn UDP
プロトコルを用いて、指定したホスト上のプログラムの手続き 0 に対して
.Tn RPC
呼び出しを行ないます。そして、応答があったかどうかを報告します。
.It Fl t
.Tn TCP
プロトコルを用いて、指定したホスト上のプログラムの手続き 0 に対して
.Tn RPC
呼び出しを行ないます。そして、応答があったかどうかを報告します。
.It Fl n
.Fl t
や
.Fl u
オプション使用時に、ポートマッパーに与えられたポート番号のかわり
に、引数
.Ar portnum
で指定した番号をポート番号として用います。
.It Fl b
.Tn UDP
プロトコルを用いて、引数
.Ar program
および
.Ar version
で指定したプログラムに対し、手続き 0 に
.Tn RPC
ブロードキャストを行ないます。そして、応答のあった全てのホストにつ
いてのレポートを出力します。
.It Fl d
引数
.Ar program
および
.Ar version
で指定したプログラムの
.Tn RPC
サービスへの登録を削除します。
本オプションは、スーパユーザのみ指定可能です。
.El
.Pp
引数
.Ar program
は、名称・番号のいずれでも構いません。
.Pp
もし引数
.Ar version
が指定されると、
.Nm
は引数
.Ar program
で指定されたプログラムのそのバージョンの呼び出しを試みます。
.Ar version
が指定されなかった場合、
.Nm
は
.Ar program
で指定されたプログラムに対してバージョン 0 呼びだしを行なうことで、
全ての登録されているバージョンについて検索を試みます
(バージョン 0 は存在しないと仮定してのものです。もし存在すれば
.Ar rpcinfo
は極端に高いバージョンを使って情報を得ようとします)。
.Fl b
および
.Fl d
オプションには、バージョン番号の指定が必要であることに注意して下さい。
.Sh 使用例
ローカルマシンに登録されている全ての
.Tn RPC
サービスを見るには、次のようにします:
.Pp
.Dl example% rpcinfo -p
.Pp
ホスト名 klaxon 上に登録されている全ての
.Tn RPC
サービスを見るには、次のようにします:
.Pp
.Dl example% rpcinfo -p klaxon
.Pp
NIS サービス (Yellow Page サービス) が稼働している
ローカルネットワーク上に接続されているマシンすべてを表示するには、
次のようにします:
.Pp
.Dl example% rpcinfo -b ypserv 'version' | uniq
.Pp
\&'version' のところには、上記
.Fl p
オプションの結果から得られた現在の NIS サービス
(Yellow Page サービス)
のバージョンを使います。
.Pp
バージョン 1 の
.Nm walld
サービスを削除するには、次のようにします:
.Pp
.Dl example% rpcinfo -d walld 1
.Sh 関連項目
.Xr rpc 5 ,
.Xr portmap 8
.Rs
.%T "RPC Programming Guide"
.Re
.Sh バグ
SunOS 3.0 以前のリリースでは、ネットワークファイルシステム (
.Tn NFS
) がポートマッパーに登録されていません。そのため
.Nm
は、そのような OS が稼働しているマシンに対して
.Tn RPC
呼び出しを行なうことが出来ません。
