freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rrenumd.8
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: rrenumd.8,v 1.1.1.1 1999/08/08 23:31:38 itojun Exp %
.\"     %FreeBSD: src/usr.sbin/rrenumd/rrenumd.8,v 1.2 2000/03/12 19:50:12 shin Exp %
.\"
.\" jpman %Id: rrenumd.8,v 1.3 2000/04/26 12:31:04 takaha Stab %
.Dd Sep 7, 1998
.Dt RRENUMD 8
.Os KAME
.Sh 名称
.Nm rrenumd
.Nd ルータリナンバリングデーモン
.Sh 書式
.Nm
.Oo
.Fl c Ar conf_file | Fl s
.Oc
.Op Fl P Ar policy
.Op Fl df
.Sh 解説
.Nm
はサイト内のサブネットにプレフィックスを割り当て、
サブネットのリナンバリング (番号付け直し) を行います。
.Pp
本プログラムは起動時に自己をデーモン化します。
また、
.Fl s
指定時には標準入力から設定情報を読み込み、
.Fl c Ar conf_file
指定時には
.Ar conf_file
から設定情報を読み込みます。
.Pp
設定情報の内容は
.Xr rrenumd.conf 5
に記述されています。
.Pp
設定が成功すると、
.Nm
は定期的に、ルータリナンバリングメッセージを、設定された宛先に送信します。
メッセージには、リナンバリングされるように設定されたプレフィックスを含みます。
.Bl -tag -width indent
.\"
.It Fl d
デバッグモード。
.It Fl f
フォアグラウンドモード。
デーモンになりません。
.It Fl s
スクリプトモード。
設定情報は標準入力から取得されます。
.It Fl P Ar policy
.Ar policy
は、rrenumd セッション用の IPsec ポリシを指定します。
詳細は
.Xr ipsec 4
と
.Xr ipsec_set_policy 3
を参照してください。
.It Fl c Ar conf_file
設定情報が保持されている設定ファイルを指定します。
.Sh 戻り値
成功時には 0 で、失敗時には非 0 で、プログラムは終了します。
.El
.Sh 関連項目
.Xr daemon 3 ,
.Xr rrenumd.conf 5
.Sh 歴史
.Nm
コマンドは KAME IPv6 プロトコルスタックキットではじめて登場しました。
.\" .Sh BUGS
.\" (to be written)
