freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rtadvd.8
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: rtadvd.8,v 1.1.1.1 1999/08/08 23:31:42 itojun Exp %
.\"     %FreeBSD: src/usr.sbin/rtadvd/rtadvd.8,v 1.3 2000/03/01 14:08:26 sheldonh Exp %
.\" jpman %Id: rtadvd.8,v 1.3 2000/05/01 16:04:12 yt-kage Stab %
.\"
.Dd May 17, 1998
.Dt RTADVD 8
.Os KAME
.Sh 名称
.Nm rtadvd
.Nd ルータ通知デーモン
.Sh 書式
.Nm
.Op Fl c Ar configfile
.Op Fl P Ar policy
.Op Fl dDfs
.Ar interface ...
.Sh 解説
.Nm rtadvd
は指定された
.Ar interfaces
に対して
ルータ通知パケットを通知します。
.Pp
このプログラムは実行時に自身をデーモン化します。
そして、定期的にルータ通知パケットを自発的に送信します。
プログラムがホストからのルータ要請パケットを受け取ると、
ルータ通知パケットにより応答します。
.Pp
通知インタフェースと呼ばれる各インタフェースに対する
ルータ通知の内容は、
.Xr rtadvd.conf 5
で記述されています。
.Pp
設定ファイル中でインタフェースに対する記述が存在しない、または
設定ファイルが存在しない場合には、
.Nm
は全てのパラメータに対してデフォルト値を設定します。
特に、
.Nm
は全てのインタフェースの経路を経路表より取得し、
リンク上のプレフィックスとして通知します。
.Pp
.Nm rtadvd
は経路表を監視します。
デフォルトでは、
もしインタフェースダイレクト経路が
通知しているインタフェースに追加もしくは削除された場合、
.Nm
は対応するプレフィックスを通知リストへ追加もしくは削除します。
この機能を有効としたくない場合、
.Ic Fl s
コマンドラインオプションを起動時に指定する必要があります。
.Pp
また、
.Nm rtadvd
はルータリナンバリング (ルータの番号付け直し) パケットを受け取り、
これらのパケットの内容にしたがって
動作しているシステムでルータリナンバリングを
実行することができます。
.\" ルータリナンバリングだけではわかりにくいので訳注を追加
.\" 4.0-RELEASE 対象
.\" By takaha@eurus.dti.ne.jp (Apr 16 2000)
.Bl -tag -width indent
.\"
.It Fl c
設定ファイルとして代わりの場所
.Ar configfile
を指定します。
デフォルトでは
.Pa /etc/rtadvd.conf
が使用されます。
.It Fl P
.Nm
がルータリナンバリングメッセージを受け取ることを指定します。
また、rrenumd セッションに対して IPsec ポリシを指定します。
ルータリナンバリングはシステムの IPv6 プレフィックスを
変更することができるので、そのメッセージは IPsec によって
保護されなければなりません。
.Ar policy
の詳細に関しては、
.Xr ipsec 4
と
.Xr ipsec_set_policy 3
を参照してください。
.It Fl d
デバッグオプションです。
.It Fl D
より詳細なデバッグモードです。
.It Fl f
フォアグランドモードです。デーモン化しません。
.It Fl s
静的プレフィックスモードです。
経路表を監視しません。
.El
.Sh 戻り値
プログラムは成功時に 0 を、エラー時に 0 以外を返します。
.Sh 関連ファイル
.Bl -tag -width /etc/rtadvd.conf -compact
.It Pa /etc/rtadvd.conf
デフォルトの設定ファイル。
.El
.Sh 関連項目
.Xr daemon 3 ,
.Xr rtadvd.conf 5 ,
.Xr rtsol 8
.Sh 歴史
.Nm
コマンドは　WIDE Hydrangea IPv6 プロトコルスタックキットで
はじめて登場しました。
.Sh 警告
上流方向に対してルータ通知を実行してはいけません。
下流方向に対してのみ通知することができます。
誤って上流方向に通知した場合、
そのサブネットにおいて icmp6 の向け直しの嵐を
見ることになるでしょう。
これは仕様であり、仕様ではルータ通知はサブネットの終端のホストに対して、
デフォルトの対外的なルータとなることが仮定されています。
