freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rtadvd.8
.\"	%FreeBSD: src/usr.sbin/rtadvd/rtadvd.8,v 1.3.2.4 2001/03/06 14:21:41 ru Exp %
.\"	$KAME: rtadvd.8,v 1.9 2000/05/27 13:37:01 jinmei Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 17, 1998
.Dt RTADVD 8
.Os
.Sh 名称
.Nm rtadvd
.Nd ルータ通知デーモン
.Sh 書式
.Nm
.Op Fl c Ar configfile
.Op Fl dDfRs
.Op Fl dDfs
.Ar interface ...
.Sh 解説
.Nm
は指定された
.Ar interfaces
に対して
ルータ通知パケットを送信します。
.Pp
このプログラムは実行時に自身をデーモン化します。
そして、定期的にルータ通知パケットを送信します。
また、エンドホストが送信したルータ要請メッセージに対しても、これで応答します。
.Pp
ルータ通知は、インタフェース毎に設定可能であり、
.Xr rtadvd.conf 5
で記述されています。
.Pp
設定ファイル中でインタフェースに対する記述が存在しない、または
設定ファイルが存在しない場合には、
.Nm
は全てのパラメータに対してデフォルト値を設定します。
特に、
.Nm
は全てのインタフェースの経路を経路表より取得し、
リンク上のプレフィックスとして通知します。
.Pp
.Nm
はまた、経路表を監視します。
デフォルトでは、
もしインタフェースダイレクト経路が
通知しているインタフェースに追加もしくは削除された場合で、
設定ファイルに静的なプレフィックスが指定されていない場合、
.Nm
は対応するプレフィックスを通知リストへ追加もしくは削除します。
この機能を有効としたくない場合、
.Fl s
オプションを起動時に指定可能です。
さらに、通知中のインタフェースの状態が変わった場合、
最新状態に基づいて、
.Nm
はルータ通知を開始または停止します。
.Pp
コマンドラインオプションは次の通りです:
.Bl -tag -width indent
.\"
.It Fl c
設定ファイルとして代わりの場所
.Ar configfile
を指定します。
デフォルトでは
.Pa /etc/rtadvd.conf
が使用されます。
.It Fl d
デバッグ情報を表示します。
.It Fl D
より詳細なデバッグ情報を表示します。
.It Fl f
フォアグランドモードです (デバッグ時に有用です)。
.\" .It Fl m
.\" モバイル IPv6 サポートを有効にします。
.\" ルータ通知オプションの内容と、
.\" 許可された設定ディレクティブの内容を、変更します。
.It Fl R
ルータリナンバリング (ルータの番号付け直し) 要求を受け付けます。
これを有効にする場合、セキュリティ上の理由から、IPsec の設定をお勧めします。
.It Fl s
静的プレフィックスモードです。
経路表を監視しません。
.El
.Pp
シグナル
.Dv SIGUSR1
を受信すると、
.Nm
は現在の内部状態を
.Pa /var/run/rtadvd.dump
へダンプします。
.Pp
.Nm
を綺麗に殺したい場合には
.Dv SIGTERM
を使用してください。
この場合、
ルータ有効期間 (lifetime) 0 のルータ通知を、
.Nm
は、すべてのインタフェースに送信します
.Pq RFC2461 6.2.5 による
。
.Sh 戻り値
.Nm
プログラムは成功時に 0 を、エラー時に 0 以外を返します。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /etc/rtadvd.conf
デフォルトの設定ファイル。
.It Pa /var/run/rtadvd.pid
現在実行中の
.Nm
の PID を含みます。
.It Pa /var/run/rtadvd.dump
.Nm
の内部状態をここにダンプします。
.El
.Sh 関連項目
.Xr daemon 3 ,
.Xr rtadvd.conf 5 ,
.Xr rtsol 8
.Sh 歴史
.Nm
コマンドは　WIDE Hydrangea IPv6 プロトコルスタックキットで
はじめて登場しました。
.Sh 警告
ルータ通知は、下流方向に対してのみ通知すべきです。
誤って上流方向に通知した場合、
そのサブネットにおいて
.Xr icmp6 4
リダイレクトパケットの嵐を引き起すでしょう。
これは、(仕様によると) 通知を行うルータが、
サブネット内のエンドホストにとってのデフォルトルータになるものと
されているからです。
