freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rtadvd.8
.\"	%FreeBSD: src/usr.sbin/rtadvd/rtadvd.8,v 1.14 2003/08/15 19:13:53 ume Exp %
.\"	$KAME: rtadvd.8,v 1.24 2002/05/31 16:16:08 jinmei Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 17, 1998
.Dt RTADVD 8
.Os
.Sh 名称
.Nm rtadvd
.Nd ルータ通知デーモン
.Sh 書式
.Nm
.Op Fl dDfMRs
.Op Fl c Ar configfile
.Ar interface ...
.Sh 解説
.Nm
は指定された
.Ar interfaces
に対して
ルータ通知パケットを送信します。
.Pp
このプログラムは実行時に自身をデーモン化します。
そして、定期的にルータ通知パケットを送信します。
また、エンドホストが送信したルータ要請メッセージに対しても、これで応答します。
.Pp
ルータ通知は、インタフェース毎に設定可能であり、
.Xr rtadvd.conf 5
で記述されています。
.Pp
設定ファイル中でインタフェースに対する記述が存在しない、または
設定ファイルが存在しない場合には、
.Nm
は全てのパラメータに対してデフォルト値を設定します。
特に、
.Nm
は全てのインタフェースの経路を経路表より取得し、
リンク上のプレフィックスとして通知します。
.Pp
.Nm
はまた、経路表を監視します。
もしインタフェースダイレクト経路が
通知しているインタフェースに追加された場合で、
設定ファイルに静的なプレフィックスが指定されていない場合、
.Nm
は対応するプレフィックスを通知リストへ追加します。
.Pp
同様に、インタフェースダイレクト経路が削除された場合、
.Nm
は 0 の最終有効期間と推奨有効期間のプレフィックスを通知開始し、
これを受信するホストがリナンバリング時に
新規プレフィックスへ切り替えることを助けます。
0 の最終有効期間が受信されたホストにおいて、
自動構成されたアドレスが即時に無効化可能ではないことに注意してください。
仕様によれば、ホストは一定期間はアドレスを保持することになっており、
これは典型的には 2 時間です。
0 の最終有効期間が意図するところは、アドレスの価値を低下させ、
価値が低下していない新規アドレスを新規接続の始点アドレスとして
使用すべきことを示すことです。
この動作は 2 時間継続します。
その後、
.Nm
はプレフィックスを完全に通知リストから削除し、
後続する通知にはこのプレフィックス情報は含まれなくなります。
.Pp
さらに、通知中のインタフェースの状態が変わった場合、
最新状態に基づいて、
.Nm
はルータ通知を開始または停止します。
.Pp
.Fl s
オプションを使用してこの動作を無効化できます。
この場合
.Nm
は経路表を監視せず、上述のすべての機能が抑制されます。
.Pp
基本的には、ホストは、
ルータ通知メッセージを如何なる時にも送出しては「なりません」
(RFC 2461 の 6.2.3 節)。
しかしながら、プレフィックス情報やリンク MTU といったパラメータの通知を
ホストに許すと有用な場合があります。
よって、すべての通知を行っているインタフェース上で
ルータの有効期間を明示的に 0 に設定している場合、
.Nm
を起動可能です。
.Pp
コマンドラインオプションは次の通りです:
.Bl -tag -width indent
.\"
.It Fl c
設定ファイルとして代わりの場所
.Ar configfile
を指定します。
デフォルトでは
.Pa /etc/rtadvd.conf
が使用されます。
.It Fl d
デバッグ情報を表示します。
.It Fl D
より詳細なデバッグ情報を表示します。
.It Fl f
フォアグラウンドモードです (デバッグ時に有用です)。
本オプションが指定された場合、ログメッセージは stderr へダンプされます。
.It Fl M
.\" Specify an interface to join the all-routers site-local multicast group.
.\" は join to the ... group の意味？
.\" horikawa@jp.FreeBSD.org 2001/07/08
全ルータサイトローカルマルチキャストグループに加入するよう、
インタフェースに指示します。
デフォルトでは、
.Nm
は、通知を行うインタフェースで最初にコマンドラインに登場するものに加入します。
本オプションは、ルーティングリナンバリングサポートを有効にする
.Fl R
オプションと共に指定した場合のみ有用です。
.It Fl R
ルータリナンバリング (ルータの番号付け直し) 要求を受け付けます。
これを有効にする場合、セキュリティ上の理由から、IPsec の設定をお勧めします。
本オプションは、現在無効化されており、
.Nm
は、警告メッセージを表示して無視します。
.It Fl s
静的プレフィックスモードです。
経路表を監視しません。
.El
.Pp
シグナル
.Dv SIGUSR1
を受信すると、
.Nm
は現在の内部状態を
.Pa /var/run/rtadvd.dump
へダンプします。
.Pp
.Nm
を綺麗に殺したい場合には
.Dv SIGTERM
を使用してください。
この場合、
.Pq RFC 2461 の 6.2.5 節に従って
ルータ有効期間 (lifetime) 0 のルータ通知を、
.Nm
は、すべてのインタフェースに送信します。
.Sh 戻り値
.Nm
プログラムは、成功時には 0 で終了し、失敗時には >0 で終了します。
.Sh 関連ファイル
.Bl -tag -width Pa -compact
.It Pa /etc/rtadvd.conf
デフォルトの設定ファイル。
.It Pa /var/run/rtadvd.pid
現在実行中の
.Nm
の PID を含みます。
.It Pa /var/run/rtadvd.dump
.Nm
の内部状態をここにダンプします。
.El
.Sh 関連項目
.Xr rtadvd.conf 5 ,
.Xr rtsol 8
.Sh 歴史
.Nm
コマンドは　WIDE Hydrangea IPv6 プロトコルスタックキットで
はじめて登場しました。
.Sh バグ
以前の記述でのユーザへの推奨は、望まない
.Xr icmp6 4
リダイレクトメッセージを避けるために、ルータ通知メッセージを
.Nm
が上流リンクへ通知しないようにするというものでした。
しかしながら、IETF ipng ワーキンググループでの後の議論によると、
到達性を保証するために、
ネットワークトポロジに依存せずに全ルータはメッセージを通知すべきです。
