freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rtquery.8
.\" %FreeBSD: src/sbin/routed/rtquery/rtquery.8,v 1.8.2.1 1999/08/29 15:15:36 peter Exp %
.\" jpman %Id: rtquery.8,v 1.2 1997/06/12 07:55:04 yugawa Stab %
.Dd June 1, 1996
.Dt RTQUERY 8
.Os BSD 4.4
.Sh 名称
.Nm rtquery
.Nd ルーティングデーモンが持つルーティングテーブルの問い合わせ
.Sh 書式
.Nm rtquery
.Op Fl np1
.Op Fl w Ar timeout
.Op Fl r Ar addr
.Op Fl a Ar secret
.Ar host
.Ar
.Nm rtquery
.Op Fl t Ar op
.Ar host
.Ar
.Sh 解説
.Nm
は、RIP ネットワークルーティングデーモン、すなわち、
.Xr routed 8
あるいは
.Xr gated 8
へ
.Em request
ないし
.Em poll
コマンドを送る事によりそのルーティングテーブルの問い合わせを行います。
返答のあった全てのルーティング
.Em 応答
パケットについてのルーティング情報が数値およびシンボル名を用いて表示されます。
.Pp
デフォルトでは、
.Nm
は
.Em request
コマンドを使用します。
.Fl p
オプションが指定された場合、
.Nm
は
.Em poll
コマンドを使用します。
これは、
.Xr gated 8
でサポートされている、RIP プロトコルへの文書化されていない拡張コマンドです。
.Xr gated 8
への問い合わせを行う場合は、
.Em request
コマンドより
.Em poll
コマンドを使用する事をお薦めします。なぜなら、応答が Split Horizon や
Poisoned Reverse の影響を受けることがなく、また、ある種のバージョンの
.Xr gated 8
は、
.Em request
に対して返答を行わないからです。
.Nm routed
は
.Em poll
コマンドに対しては返答しませんが、
.Nm
からの
.Em request
コマンドを認識し、完全な返答をします。
.Pp
.Nm
は、
.Nm routed
のトレース機能を有効にしたり無効にしたりする場合にも用いられます。
.Pp
以下のオプションを使用可能です:
.Bl -tag -width indent
.It Fl n
通常、ネットワークおよびホスト番号はシンボル名および数値の両方で表示されます。
.Fl n
オプションはネットワークおよびホスト番号を数値のみで表示します。
.It Fl p
.Xr gated 8
から得られる完全なルーティング情報を得るために
.Em Poll
コマンドを使用します。
これは、
.Xr gated 8
のみでサポートされている、RIP プロトコルへの文書化されていない拡張コマンドです。
.It Fl 1
RIP バージョン 2 ではなく、RIP バージョン 1 を使用して問い合わせを行います。
.It Fl w Ar timeout
各ホストから返答を待つ猶予時間を変更します。
デフォルトでは、返答があるまで 15 秒間待ちます。
.It Fl r Ar addr
到達先
.Em addr
への経路を問い合わせます。
.It Fl a Ar passwd=XXX
.It Fl a Ar md5_passwd=XXX|KeyID
問い合わせの際に、指定されたクリアテキストないし MD5 のパスワードを
使用します。
.It Fl t Ar op
トレース方法を変更します。
.Em op
には、以下のうちのひとつを指定します。
通常、UID 0 以外のプロセスからの問い合わせや、遠隔ネットワークからの
問い合わせは、システムのログにメッセージを記録するだけで、無視されます。
.Xr gated 8 
は、大抵、これらのデバッグの問い合わせを無視します。
.El
.Bl -tag -width Ds -offset indent-two
.It Em on=tracefile
トレースを有効にし、指定されたファイルに記録します。このファイルは、
通常、デーモンが実行を開始した時に指定されるか、一般的な、
.Pa /etc/routed.trace
等の決まった名前でなければなりません。
.It Em more
デバッグレベルを増加させます。
.It Em off
トレースを無効にします。
.It Em dump
デーモンのルーティングテーブルを現在のトレースファイルにダンプします。
.El
.Sh 関連項目
.Xr gated 8 ,
.Xr routed 8
.Rs
.%T Routing Information Protocol, RIPV1
.%O RFC1058
.Re
.Rs
.%T Routing Information Protocol, RIPv2
.%O RFC1723
.Re
