freebsd/freebsd-doc/ja_JP.eucJP/man/man8/rtsold.8
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     %Id: rtsold.8,v 1.4 1999/09/30 00:57:15 jinmei Exp %
.\"	%FreeBSD: src/usr.sbin/rtsold/rtsold.8,v 1.1 1999/12/28 02:37:13 shin Exp %
.\"
.\" jpman %Id: rtsold.8,v 1.3 2000/04/26 12:31:12 takaha Stab %
.\" WORD: mobility	可搬性 [WIDE IPv6 working group]
.\" WORD:
.Dd May 17, 1998
.Dt RTSOLD 8
.Os KAME
.\"
.Sh 名称
.Nm rtsold
.Nd ルータ要請デーモン
.\"
.Sh 書式
.Nm
.Op Fl dDfm1
.Ar interface ...
.Nm rtsol
.Op Fl dD
.Ar interface ...
.\"
.Sh 解説
.Nm
は、ICMPv6 ルータ要請メッセージを、指定されたインタフェース上で送信します。
ノードがリンクに (再) 接続された場合、
.Nm
は、リンクローカルスコープの全ルータ宛マルチキャストアドレスへ、
ルータ要請メッセージを送信します。
これは、
新規ルータを発見して非リンクローカルアドレスを取得することを目的としています。
.Lp
特に
.Nm
は、次のいずれかのイベント後に、
最大 3 個のルータ要請を単一インタフェースから送信します:
.Bl -bullet -compact
.It
.Nm
デーモンの起動直後。
.It
一時的なインタフェース障害後のインタフェース立ち上げ。
.Nm
は、定期的にインタフェースの状態が活動中か否かを調べ、
このイベントを検出します。
ネットワークカードとドライバによっては、
ユーザがリンク状態を引き出すことを許さないものがあることに注意してください。
このような場合、
.Nm
はインタフェース状態の変化を検出できません。
.It
.Fl m
オプションが指定され、
.Nm
デーモンがインタフェース状態を取得できない場合、1 分毎。
この機能は IPv6 近隣探索仕様に適合しませんが、
可搬ステーション用に提供されています。
ルータ通知のデフォルトインターバルは 10 分単位ですが、
これは可搬ステーションにとってはやや長いです。
この機能はこのようなステーション用に提供されており、
ステーションが他のリンクに接続された後
すみやかに新しいルータを発見できるようにします。
.El
.Lp
ひとたび
.Nm
がルータ要請を送信して有効なルータ通知を受信すると、
前述のいずれかのイベントが発生するまで、
このインタフェースからはもう要請を送信しなくなります。
.Lp
インタフェース上でルータ要請を送信するとき、
このインタフェースがリンク層アドレスを持つ場合には、
.Nm
は始点リンク層アドレスオプションを含めます。
.Pp
シグナル
.Dv SIGUSR1
を受信すると、
.Nm
は現在の内部状態を
.Pa /var/tmp/rtsold.dump
にダンプします。
.\"
.Sh オプション
.Bl -tag -width indent
.\"
.It Fl d
デバッギングを有効にします。
.It Fl D
より多くのデバッギングを有効にし、内部タイマ情報も表示します。
.It Fl f
.Fl f
は、
.Nm
がデーモンになることを妨げます (フォアグラウンドモード)。
.Xr syslog 3
の代りに標準エラー出力に対して、警告メッセージが生成されます。
.It Fl m
可搬サポートを有効にします。
本オプションが指定されると、ノードがインタフェースに (再) 接続された時、
ルータ通知を行っていたデフォルトルータに対して、
.Nm
はプローブパケットを送信します。
更に、本オプションが指定された場合には、
.Dv SIOCGIFMEDIA
ioctl をサポートしないインタフェース上で、
.Nm
は定期的にルータ要請を送信します。
.It Fl 1
1 回だけ調べます。
有効なルータ通知パケットが全インタフェース上で 1 度以上到着するまで、
ルータ要請パケットを送ってから、終了します。
.El
.Pp
プログラムを
.Nm rtsol
として起動すると、
.Do
.Nm
.Fl f1
.Ar interfaces
.Dc
のように動作します。
.Sh 戻り値
成功時には 0 で、失敗時には非 0 で、プログラムは終了します。
.\"
.Sh 関連ファイル
.Bl -tag -width /var/run/rtsold.dump -compact
.It Pa /var/run/rtsold.pid
現在実行中の
.Nm rtsold
の PID。
.It Pa /var/tmp/rtsold.dump
ここに内部状態をダンプします。
.El
.\"
.Sh 関連項目
.Xr rtadvd 8 ,
.Xr sysctl 8
.\"
.Sh 歴史
.Nm
コマンドは、WIDE/KAME IPv6 プロトコルスタックキットではじめて登場した
.Nm rtsol
を元にしています。
.Nm rtsol
は現在
.Xr rtsold 8
に組み込まれています。
.\" .Sh BUGS
.\" (to be written)
