freebsd/freebsd-doc/ja_JP.eucJP/man/man8/sa.8
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/sa/sa.8,v 1.11.2.3 2001/08/16 15:56:31 ru Exp %
.\" $FreeBSD$
.\"
.Dd February 25, 1994
.Dt SA 8
.Os
.Sh 名称
.Nm sa
.Nd システムアカウント統計情報を表示する
.Sh 書式
.Nm
.Op Fl abcdDfijkKlmnqrstu
.Op Fl v Ar cutoff
.Op Ar file ...
.Sh 解説
.Nm
は、システムアカウント統計情報の表示と、アカウント情報ファイルの
維持管理を行います。
.Pp
.Nm
を使えば、
.Pa /var/account/acct
に含まれる情報を、
サマリファイル
.Pa /var/account/savacct
と
.Pa /var/account/usracct
に
凝縮して収めることができます。これらのファイルには、コマンド名やユーザ ID
にもとづいたシステムの統計情報が記録されます。これらのサマリファイルは、
.Pa /var/account/acct
が 1 日に数百ブロックも大きくなるような利用者の多い
システムでは必要になります。
通常、アカウント情報ファイルの前にサマリファイルを読み込むため、
レポートには全ての保存されている情報が含まれます。
.Pp
.Ar file
が与えられると、
.Pa /var/account/acct
のかわりにそのファイル
が読み込まれます。各ファイルが読み込まれたあと、サマリファイルを更新する
必要があればディスクにセーブされます。最後のファイルが処理されたあと、
報告が表示されます。
.Pp
個々のオプションで指定されるものを除いて、以下に示すラベルが出力で使わ
れます。
.Pp
.Bl -tag -width k*sec
.It avio
実行時の I/O 操作の平均回数
.It cp
ユーザ時間とシステム時間の合計(単位:分)
.It cpu
.Dv cp
と同じ
.It k
CPU 時間1秒あたりのメモリ使用量(単位:KB)
.It k*sec
CPU 時間で積分したメモリ使用量(単位:1KB秒)
.It re
実時間(単位:分)
.It s
システム時間(単位:分)
.It tio
I/O 操作の合計回数
.It u
ユーザ時間(単位:分)
.El
.Pp
オプション:
.Bl -tag -width Ds
.It Fl a
全コマンド名を表示します。表示できない文字を含んだコマンドなども含みます。
デフォルトでは表示できない文字を含むコマンドは、``***other'' に含まれます。
.It Fl b
コマンド統計情報を表示する場合、ユーザ時間とシステム時間の合計を
コマンドの呼び出し回数で割った値でソートして表示します。
.It Fl c
表示される呼び出し回数・実時間・CPU 時間それぞれに関して、コマン
ド全体に対するそのコマンドの割合をパーセンテージ表示します。
.It Fl d
コマンド統計情報を表示する場合は、ディスク I/O 操作の平均回数でソートします。
ユーザ統計情報を表示する場合は、各ユーザのコマンドあたりのディスクI/O操作回数を表示します。
.It Fl D
コマンド統計を表示する場合は、ディスク I/O 操作の合計回数でソートします。
.It Fl f
.Fl v
を使用する際、ユーザに問い合わせを行いません。
.It Fl i
サマリファイルを読みません。
.It Fl j
各コマンドの合計時間(単位:分)の代わりに、
各コマンドの消費時間(合計時間/呼び出し回数; 単位:秒)を
表示します。
.It Fl k
コマンド統計情報を表示する場合は、CPU 時間 1 秒あたりのメモリ使用量で
ソートします。ユーザ統計を表示する場合は、
CPU 時間 1 秒あたりのメモリ使用量を表示します。
.It Fl K
コマンド統計を表示する場合は、CPU 時間で積分したメモリ使用量を表示し、
これでソートします。
.It Fl l
システム時間とユーザ時間を別々に表示します。普通は合計して表示されます。
.It Fl m
コマンド統計情報のかわりに、ユーザ統計を表示します。
.It Fl n
呼び出し回数でソートします。
.It Fl q
エラーメッセージ以外の出力は行いません。
.It Fl r
逆順でソートします。
.It Fl s
データをサマリファイルに加えたあと、アカウント情報ファイルを空にします。
.It Fl t
各コマンドごとに、実時間/CPU 時間(システムとユーザ時間)の値を表示します。
CPU時間が小さすぎる場合は、``*ignore*'' が表示されます。
.It Fl u
他のオプションを打ち消して、アカウント情報ファイルからユーザ ID、
CPU を使用した合計秒数、合計メモリ使用量、I/O 操作回数、コマンド名
を表示します。
.It Fl v Ar cutoff
.Pp
.Ar cutoff
時間以下のコマンドについて、
コマンド名を表示し、
ユーザに問い合わせを行います。返答として ``y'' で始まる文字列を入力すると、
そのコマンドは ``**junk**'' に分類されます。このオプションは、報告の
なかから意味のないコマンドを取り除くために使われます。
.El
.Pp
デフォルトでは、コマンド統計を表示します。
各行には、コマンドの呼び出し回数、コマンドの経過時間(分)、
ユーザ時間とシステム時間を合計した CPU 時間、
平均の I/O 操作回数、CPU 時間 1 秒あたりのメモリ使用量、
コマンド名が列挙されます。
.Fl m
が指定された場合は、ユーザ統計を表示します。
それぞれの行は、各ユーザのユーザ名、コマンド実行回数、
合計 CPU 時間(分)、合計I/O操作回数、
CPU 時間で積分したメモリ使用量から構成されています。もし
.Fl u
が指定されると、アカウント情報
ファイルに記録されている各エントリを表示します。
各行は、ユーザ ID、CPU 時間(秒)、CPU 時間で積分したメモリ使用量、
I/O 操作回数、コマンド名から構成されています。
.Pp
.Fl u
が指定されると、
.Fl q
を除いて、他のオプションは無視されます。
.Fl m
が指定されると、
.Fl b ,
.Fl d ,
.Fl i ,
.Fl k ,
.Fl q ,
.Fl s
フラグだけが認識されます。
.Sh 診断
.Ex -std
.Sh 関連ファイル
.Bl -tag -width /var/account/usracct -compact
.It Pa /var/account/acct
生のアカウント情報ファイル
.It Pa /var/account/savacct
コマンドごとのサマリデータベースファイル
.It Pa /var/account/usracct
ユーザごとのサマリデータベースファイル
.El
.Sh 関連項目
.Xr lastcomm 1 ,
.Xr acct 5 ,
.Xr ac 8 ,
.Xr accton 8
.Sh バグ
このプログラムのオプションには不合理なものがいっぱいあります。特に
オプション文字は、機能とあまり関係がありません。
.Pp
各ラベルにはもっと一貫性があるべきです。
.Pp
仮想メモリ(VM)システムでは、CPU 時間で積分したメモリの使用量は記録されません。
.Sh 警告
この
.Nm
のオプションは、オリジナルの
.Nm
をもとに
していますが、内部的にもですが明らかに外部的にも変更点があります。特に
.Fl q
が追加され、
.Fl m
は以前よりも多くのオプションが利用可能です。
.Pp
サマリファイルのフォーマットはオリジナルのもの
から変更されていますが、ユーザ id が 32ビットに
なってアカウントのフォーマットも変更されている
ので、これは問題ありません。
.Sh 作者
.An Chris G. Demetriou Aq cgd@postgres.berkeley.edu
