freebsd/freebsd-doc/ja_JP.eucJP/man/man8/savecore.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From: @(#)savecore.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/savecore/savecore.8,v 1.20 2003/09/04 10:07:01 dougb Exp %
.\" $FreeBSD$
.\"
.Dd September 23, 1994
.Dt SAVECORE 8
.Os
.Sh 名称
.Nm savecore
.Nd オペレーティングシステムのコアダンプを保存する
.Sh 書式
.Nm
.Fl c
.Nm
.Fl C
.Op Fl v
.Op Ar directory device
.Nm
.Op Fl fkvz
.Op Ar directory Op Ar device ...
.Ar directory
.Sh 解説
.Nm
ユーティリティは、コアダンプをディレクトリ
.Fa directory
内へ、
.Ar directory
引数が指定されない場合は現在の作業ディレクトリへコピーし、
リブートメッセージとコアダンプ情報をシステムログに書き出します。
.Pp
オプションは以下の通りです:
.Bl -tag -width indent
.It Fl C
ダンプが存在するかどうかチェックし、
状態を示すために短かいメッセージを表示します。
終了値 0 はダンプが存在することを意味し、
1 は存在しないことを意味します。
このオプションは、
.Op Fl v
オプションとのみ互換です。
.It Fl c
ダンプをクリアし、これ以降起動される
.Nm
でそれが用いられないようにします。
.It Fl f
ダンプがクリア済でも、強制的にダンプをとります。
.It Fl k
ダンプを保存した後、クリアしません。
.It Fl v
より詳しいデバッグ情報を出力します。
.It Fl z
コアダンプとカーネルを圧縮します (
.Xr gzip 1
参照)。
.El
.Pp
.Nm
ユーティリティは、
.Ar device
引数で指定される各デバイス上と
.Pa /etc/fstab
で
.Dq dump
または
.Dq swap
と記録されている各デバイス上で、ダンプを探します。
.Nm
ユーティリティは、様々な方法を用いてコアダンプが完全であることを確認します。
このチェックにパスすると、
.Nm
はコアイメージを
.Ar directory Ns Pa /vmcore.#
に保存し、コアの情報を
.Ar directory Ns Pa /info.#
に保存します。
``#'' はファイル
.Ar directory Ns Pa /bounds
先頭からの行数で、
.Nm
が正常に実行されるたびにインクリメントされてファイルに書き戻されます。
.Pp
.Nm
ユーティリティはまた、
コピーを作る前にディスク容量が足りているかどうかチェックします。
.Ar directory
を含むファイルシステムのディスク容量が不足している場合、
あるいは、
.Ar directory Ns Pa /minfree
が存在し、ファイル生成後のそのファイルシステムの
(非スーパユーザに対する)残りキロバイト数が
このファイル先頭行の数値より小さい場合、
コピー作成は試みられません。
.Pp
.Nm
がカーネルとコアダンプのコピーに成功すると、
コアダンプはクリアされ、その後の
.Nm
では用いられないようになります。
.Pp
.Nm
ユーティリティは、初期化ファイル
.Pa /etc/rc
の最終段階付近で呼び出されることを想定しています (
.Xr rc 8
参照)。
.Sh バグ
minfree コードは圧縮の効果と疎なファイルを考慮していません。
.Sh 関連項目
.Xr gzip 1 ,
.Xr getbootfile 3 ,
.Xr dumpon 8 ,
.Xr syslogd 8
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.1
で登場しました。
