freebsd/freebsd-doc/ja_JP.eucJP/man/man8/scspd.8
.\"
.\" ===================================
.\" HARP  |  Host ATM Research Platform
.\" ===================================
.\"
.\"
.\" This Host ATM Research Platform ("HARP") file (the "Software") is
.\" made available by Network Computing Services, Inc. ("NetworkCS")
.\" "AS IS".  NetworkCS does not provide maintenance, improvements or
.\" support of any kind.
.\"
.\" NETWORKCS MAKES NO WARRANTIES OR REPRESENTATIONS, EXPRESS OR IMPLIED,
.\" INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS FOR A PARTICULAR PURPOSE, AS TO ANY ELEMENT OF THE
.\" SOFTWARE OR ANY SUPPORT PROVIDED IN CONNECTION WITH THIS SOFTWARE.
.\" In no event shall NetworkCS be responsible for any damages, including
.\" but not limited to consequential damages, arising from or relating to
.\" any use of the Software or related support.
.\"
.\" Copyright 1994-1998 Network Computing Services, Inc.
.\"
.\" Copies of this Software may be made, however, the above copyright
.\" notice must be reproduced on all copies.
.\"
.\" @(#) %FreeBSD: src/usr.sbin/atm/scspd/scspd.8,v 1.1.2.1 1999/08/29 15:39:54 peter Exp %
.\"
.\" WORD: Server Cache Synchronization Protocol サーバキャッシュ同期プロトコル
.\" WORD: Cache Alignment	キャッシュアラインメント
.\" WORD: finite state machine	有限状態機械
.\"
.\" jpman %Id: scspd.8,v 1.3 1998/12/23 21:23:41 vanitas Stab %
.\"
.\"
.de EX		\"Begin example
.ne 5
.if n .sp 1
.if t .sp .5
.nf
.in +.5i
..
.de EE
.fi
.in -.5i
.if n .sp 1
.if t .sp .5
..
.TH SCSPD 8 "1998-08-21" "HARP"

.SH 名称
scspd \- SCSP デーモン
.SH 書式
.B scspd
[\fB-f\fP <cfg-file>]
[\fB-d\fP]
[\fB-T\fP<options>]

.SH 解説
\fIscspd\fP は、
Host ATM Research Platform (HARP) ネットワーキングソフトウェア用の、
サーバキャッシュ同期プロトコル (Server Cache Synchronization Protocol; SCSP)
の実装のひとつです。
\fIscspd\fP は、
あるホスト上の (1 つ以上の) サーバの (1 つ以上の) キャッシュと、
リモートホスト上のサーバのキャッシュを同期させます。
SCSP は多くの異なったプロトコルに対して定義されますが、
現在のバージョンの \fIscspd\fP は ATMARP のみサポートします。
.PP
\fIscspd\fP と \fIatmarpd\fP を使用すると、
単一の ATM LIS に対して複数の ATMARP サーバを提供することが可能となります。
例えば、
長距離リンクで接続される複数のローカルエリア ATM ネットワークにより、
LIS が構成される場合に有用でしょう。
各ローカルエリアネットワークは各自の ATMARP サーバを持つことができ、
すべてのサーバのキャッシュは SCSP により同期されます。
このような場合、もし長距離リンクが切断されても、
ローカルエリアネットワーク上のホストは他のローカルホストとの接続性を保ちます
(全ローカルホストはローカルの ATMARP サーバを使用するからです)。
長距離リンクが回復すると、SCSP はサーバのキャッシュを再同期し、
リモートホストとの接続性を回復します。
ATMARP キャッシュが同期される前に、
\fIscspd\fP と \fIatmarpd\fP の両方が走行している必要があります。
.PP
\fIscspd\fP は、
RFC 2334, \fIServer Cache Synchronization Protocol (SCSP)\fP
および
draft-ietf-ion-scspd-atmarpd-00.txt,
\fIA Distributed ATMARP Service using SCSP\fP
に示されるように SCSP を実装しています。

\fIscspd\fP が実行を開始すると、
自己に与えられたコマンドラインを解析し、バックグラウンドに移行します。

.SH 用語
SCSP に関する用語には混乱しやすいものがあります。
この文書では、次の定義を使用します:

\fBクライアントサーバ\fP もしくは \fBローカルサーバ\fP は、
\fIscspd\fP と同じホストで実行されているサーバを意味します。
このサーバのキャッシュは、複数のリモートサーバと同期されます。
\fBサーバ\fP という言葉が単独で使用される場合、
「クライアントサーバ」を意味します。

\fBリモートサーバ\fP は、
\fIscspd\fP が実行されているホストとは別のホスト上で実行されているサーバを
意味します。

\fB直接接続されたサーバ\fP (Directly Connected Server; DCS) は、
\fIscspd\fP が直接通信を行うリモートサーバを意味します。
リモートサーバもまた SCSP の実装のひとつを実行しているでしょう。

\fBキャッシュアラインメント\fP (Cache Alignment; CA) には、
2 つの意味があります。
キャッシュアラインメントプロトコルは SCSP プロトコル仕様の一部であり、
キャッシュアラインメント有限状態機械 (FSM) は
キャッシュアラインメントプロトコルを実装する有限状態機械です。

.SH オプション
コマンドラインオプションは次の通りです:
.IP "\fB-f\fP <cfg-file>" 15
設定ファイルの名前を指定します。
このオプションを指定しないと、
\fIscspd\fP はファイル /etc/scspd.conf を探します。
.IP "\fB-d\fP" 15
\fIscspd\fP をデバッグモードで実行することを指定します。
デバッグモードでは、デーモンはバックグラウンドにはなりません。
ログメッセージは、
設定ファイルに指定されたログファイルではなく、標準出力に書かれます。
.IP "\fB-T\fP<options>" 15
実行に際して、指定したイベントとメッセージをトレースするよう、
\fIscspd\fP に指示します。
\fB-T\fP フラグの後には、次に示すオプションを 1 つ以上付けます:
.in +4
.ti -4
\fBc\fP\ -\ \fIscspd\fP の CA 有限状態機械 (FSM) をトレースします。
.ti -4
\fBh\fP\ -\ \fIscspd\fP の Hello FSM をトレースします。
.ti -4
\fBi\fP\ -\ \fIscspd\fP のクライアントインタフェース FSM をトレースします。
.ti -4
\fBC\fP\ -\ CA, CSUS, CSU リクエストと CSU リプライのメッセージを
トレースします。
.ti -4
\fBH\fP\ -\ Hello メッセージをトレースします。
.ti -4
\fBI\fP\ -\ \fIscspd\fP のクライアントと相互にやりとりする
インタフェースメッセージをトレースします。
.in -4
.SH 設定

設定ファイルは、一連の設定文から成ります。
これらの文は、\fIscspd\fP がキャッシュの同期を行う対象となる、
ローカルおよびリモートの両方のサーバに関する情報を指定します。
\fIscspd\fP の設定方法については、
RFC 2334, \fIServer Cache Synchronization Protocol (SCSP)\fP および
draft-ietf-ion-scspd-atmarpd-00.txt, \fIA Distributed ATMARP Service
using SCSP\fP が役立つでしょう。

コメント以外の設定文はセミコロンで終端します。
文によってはブロックを持ち、ブレース ("{" と "}") で区切ります。
設定文のキーワードは大文字小文字の区別はありませんが、
パラメータには区別のあるものがあります  (例えばインタフェース名)。
設定文は複数行に渡ることが可能です。

.SS コメント
3 種類のコメントを使用可能です:

\fB# コメント\fP: "#" から行末までのすべての文字は無視されます。

\fBC コメント\fP: "/*" と "*/" の間のすべての文字は無視されます。

\fBC++ コメント\fP: "//" から行末までのすべての文字は無視されます。

.SS 文
\fIscspd\fP が理解する設定文を示します:

Server <name> {
.in +5
Protocol <protocol ID>;
.br
Netif <if_name>;
.br
ServerGroupID <ID>;
.br
FamilyID <ID>;
.br
DCS {
.in +5
ATMaddr <ATM address>;
.br
ID <host>;
.br
CAReXmitInt <int>;
.br
CSUSReXmitInt <int>;
.br
CSUReXmitInt <int>;
.br
CSUReXmitMax <cnt>;
.br
HelloDead <cnt>;
.br
HelloInt <int>;
.br
Hops <cnt>;
.in -5
};
.in -5
};
.sp
Log {
.in +5
File <file name>;
.br
Syslog;
.in -5
};
.PP
設定ファイル内でホストアドレスを指定する必要があるところでは、
DNS での名前でも、10 進数をドットで繋ぐ IP アドレスの形式でも、
どちらでも使用可能です。
.PP
ATM アドレスは 16 進数の文字列として指定します。
前に "0x" を付けてもかまいません。
アドレス内のフィールドはピリオドで区切ってもかまいません。
ピリオドは読みやすさのためだけにあり、単に無視されます。
ATM アドレスの長さは 20 バイトです。
先行する 0 を含めて、全アドレスを指定する必要があります。
例:
.in +5
0x47.0005.80.ffe100.0000.f21a.0170.0020481a0170.00
.in -5

.SS Server 文
\fBserver\fP 文はクライアントサーバを指定します。
このクライアントサーバのキャッシュは、
リモートホスト上で実行されている他のサーバのキャッシュと同期されます。
\fIscspd\fP によってキャッシュが同期される各クライアントサーバごとに、
1 つの \fBserver\fP 文を設定ファイルに書きます。
\fBserver\fP 文の書式は次の通りです:
.ti +5
\fBServer <name> { <statements> };\fP

name は \fBserver\fP 文で指定する必要がありますが、
\fIscspd\fP はこれを使用しません。
サーバの用途に関する短い記述を与えるものと期待されています。

\fBserver\fP 文は、いくつかの副文を持ち、\fIscspd\fP の設定の詳細を指定します。
副文を示します:
.IP "\fBProtocol ATMARP;\fP" 5
現在のバージョンの \fIscspd\fP がサポートする唯一のプロトコルは ATMARP です。
\fBprotocol\fP 文は常に指定する必要があります。
.IP "\fBNetif <intf>;\fP" 5
\fBnetif\fP 文は、クライアントサーバがサービスを提供している
ATM ネットワークインタフェース名を指定します。
\fBnetif\fP 文は常に指定する必要があります。
.IP "\fBServerGroupID <ID>;\fP" 5
\fBServerGroupID\fP 文は、
\fIscspd\fP が同期を行うサーバ群に対する識別子を指定します。
ID は 10 進数として指定され、範囲は 0 - 65,535 です。
SCSP セッションにより同期されるキャッシュを持つ全サーバにおいて、
サーバグループ ID は同一である必要があります。
つまり、ホストのサーバグループ ID は、
\fBserver\fP 文内で指し示されるすべての直接接続されたサーバ (DCS)
において同一である必要があるということです。
\fBServerGroupID\fP 文は常に指定する必要があります。
.IP "\fBFamilyID <ID>;\fP" 5
\fBfamilyID\fP 文は、
ホスト群間で実行される並列 SCSP セッションのファミリに対する識別子を指定します
(ファミリとはすなわち、
異なったプロトコル ID ではあっても同一のサーバ集合である、
SCSP セッションの集合です)。
ID は 10 進数として指定され、範囲は 0 - 65,535 です。
ファミリ ID は現在 \fIscspd\fP は使用しません。

.SS DCS 文
\fBDCS\fP 文は \fBserver\fP 文の副文であり、
直接接続されたサーバ (DCS) の特性を指定します。
\fBserver\fP 文は、
\fIscspd\fP が情報交換する DCS ごとに 1 つの \fBDCS\fP 文を持ちます。
\fBDCS\fP 文は多くの副文を持ち、
DCS の設定に関する詳細を指定します。
それらを次に示します:
.IP "\fBATMaddr <ATM address>;\fP" 5
\fBATMaddr\fP 文は DCS の ATM アドレスを指定します。
\fBATMaddr\fP 文は常に指定する必要があります。
.IP "\fBID <host>;\fP" 5
\fBID\fP 文は DCS の SCSP 識別子を指定します。
ATMARP における ID は、
DCS の ATM インタフェースに関連付けられた IP アドレスまたは DNS での名前です。
\fBID\fP 文は常に指定する必要があります。
.IP "\fBCAReXmitInt <int>;\fP" 5
\fBCAReXmitInt\fP 文は、
CA メッセージの再送間隔時間を指定します。
CA メッセージが送信されて確認応答が CAReXmitint 秒以内に受信されない場合、
メッセージが再送されます。
\fBCAReXmitInt\fP のデフォルト値は 3 秒です。
.IP "\fBCSUSReXmitInt <int>;\fP" 5
\fBCSUSReXmitInt\fP 文は、
CSU Solicit メッセージの再送間隔時間を指定します。
CSUS メッセージが送信されたとき、
CSUS によりリクエストされた Cache State Advertisement (CSA) が
CSUSReXmitInt 秒以内に受信されないと、
別の CSUS メッセージによる再リクエストが発生します。
\fBCSUSReXmitInt\fP のデフォルト値は 3 秒です。
\fBCSUSReXmitInt\fP と \fBCSUReXmitInt\fP に関して
混乱しないようにしてください。
.IP "\fBCSUReXmitInt <int>;\fP" 5
\fBCSUReXmitInt\fP 文は、
CSU リクエストメッセージの再送間隔時間を指定します。
CSU リクエストメッセージが送信されたとき、
CSUReXmitInt 秒以内に CSU リプライメッセージによって確認応答が返されない CSA
は再送されます。
\fBCSUReXmitInt\fP のデフォルト値は 2 秒です。
\fBCSUReXmitInt\fP と \fBCSUSReXmitInt\fP に関して
混乱しないようにしてください。
.IP "\fBCSUReXmitMax <cnt>;\fP" 5
\fBCSUReXmitMax\fP 文は、前述のように CSA が再送される回数を指定します。
この回数を越えると、SCSP は CSA を諦めて捨ててしまいます。
\fBCSUReXmitMax\fP のデフォルト値は 5 です。
.IP "\fBHelloDead <cnt>;\fP" 5
\fBHelloDead\fP 文は、
Hello メッセージに入れられて DCS に送られる、Hello Dead Factor を指定します。
HelloDead * HelloInt 秒間 DCS からなにも受信しない場合、
"DCS down" 状態が検出されます。
\fBHelloDead\fP のデフォルト値は 3 です。
.IP "\fBHelloInt <int>;\fP" 5
\fBHelloInt\fP 文は、
Hello メッセージに入れられて DCS に送られる、Hello Interval を指定します。
\fBHelloInt\fP のデフォルト値は 3 秒です。
.IP "\fBHops <cnt>;\fP" 5
\fBHops\fP 文は (DCS から DCS への) ホップ数を指定し、
ローカルサーバを起点とする CSA の中に指定されます。
この値は最小でもサーバグループの直径である必要があります。
すなわち、
サーバ群中の全サーバに CSA が伝播するのに十分な大きさが必要ということです。
\fBHops\fP のデフォルト値は 3 です。

.SS Log 文
\fBlog\fP 文は、\fIscspd\fP の操作情報をどのようにログするかを指定します。
\fIscspd\fP は、ログ情報をファイルに書き込むことができますし、
システムのログに書き込むこともできますし、両方とも行うことも可能です。
.IP "\fBFile <file name>;\fP" 5
\fBfile\fP 文は、\fIscspd\fP がログメッセージを
指定された名前のファイルに書き込むことを指定します。
ファイルが既に存在する場合、ログメッセージはファイルの最後に追加されます。
.IP "\fBSyslog;\fP" 5
\fBsyslog\fP 文は、\fIscspd\fP がログメッセージを
syslog ファシリティに書き込むことを指定します。
\fIscspd\fP は、ファシリティコード LOG_DAEMON を使用して、
メッセージを syslog に書き込みます。

.in -5
\fBlog\fP 文を指定しないと、\fIscspd\fP はログメッセージを
システムのログに書き込みます。
\fBfile\fP と \fBsyslog\fP の両方が指定されると、
指定された名前のファイルとシステムのログの両方に、
\fIscspd\fP はログメッセージを書き込みます。

.SS 使用例

\fIscspd\fP の簡単な設定ファイルの例は次のようになります:
.in +5
server atmarp_ni0 {
.in +5
protocol ATMARP;
.br
netif ni0;
.br
ServerGroupID 23;
.br
DCS {
.in +5
.br
ID 10.1.1.2;
.br
ATMaddr 0x47.0005.80.ffdc00.0000.0002.0001.002048061de7.00;
.br
hops 2;
.in -5
};
.in -5
};
.in -5

この設定では、ネットワークインタフェース ni0 上で実行されている
ATMARP サーバのキャッシュと、
IP アドレス 10.1.1.2 のホスト上で実行されている 2 番目のサーバのキャッシュとの
同期をとります。
ログメッセージはシステムのログに書き込まれます。


.SH シグナル処理
次のシグナルを使用して \fIscspd\fP を制御できます:

.IP \fBSIGHUP\fP 10
設定ファイルを再度読み込み、\fIscspd\fP を再スタートします。

.IP \fBSIGINT\fP 10
デバッグ情報をファイルにダンプします。
SIGINT を受信すると、
\fIscspd\fP は制御ブロックのサマリをテキストファイルにダンプします
(「\fB関連ファイル\fP」参照)。

.SH 関連ファイル

.IP "/etc/scspd.conf"
\fIscspd\fP のデフォルトの設定ファイルの名前です。
別の名前は、コマンドラインで \fB-f\fP オプションで指定可能です。

.IP "/tmp/scspd.<pid>.<seq>.out"
デバッグ情報をダンプするファイルの名前です。
\fIscspd\fP が SIGINT シグナルを受信すると、
制御ブロックのサマリをこのファイルに書き込みます。
<pid> はデーモンのプロセス ID であり、
<seq> はダンプがとられるごとに増えるシーケンス番号です。

.IP "/tmp/scspd.<pid>.trace"
トレースファイルです。
\fB-T\fP オプションがコマンドラインで指定されると、
\fIscspd\fP はトレース情報をこのファイルに書き込みます。

.SH 関連項目
\fIatm\fP (8);
\fIatmarpd\fP (8);
RFC 2334, \fIServer Cache Synchronization Protocol (SCSP)\fP;
draft-ietf-ion-scsp-atmarpd-00.txt, \fIA Distributed ATMARP Service
Using SCSP\fP


.SH バグ
\fIscspd\fP が終了して再スタートすると、
以前に同期されたキャッシュエントリがタイムアウトして
リフレッシュされるまでの期間、不安定になります。

バグは harp-bugs@magic.net に報告してください。

.SH COPYRIGHT
Copyright (c) 1994-1998, Network Computing Services, Inc.

.SH 作者
John Cavanaugh, Network Computing Services, Inc.
.br
Mike Spengler, Network Computing Services, Inc.
.br
Joe Thomas, Network Computing Services, Inc.
.fi
.SH 謝辞
本ソフトウェアは、
Defense Advanced Research Projects Agency (DARPA) の協力により開発されました。

.SH 日本語訳
堀川和雄 <horikawa@jp.FreeBSD.org>
