freebsd/freebsd-doc/ja_JP.eucJP/man/man8/sendmail.8
.\" Copyright (c) 1998-2002 Sendmail, Inc. and its suppliers.
.\"      All rights reserved.
.\" Copyright (c) 1983, 1997 Eric P. Allman.  All rights reserved.
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" By using this file, you agree to the terms and conditions set
.\" forth in the LICENSE file which can be found at the top level of
.\" the sendmail distribution.
.\"
.\"
.\"     %Id: sendmail.8,v 8.51.2.3 2003/12/01 17:02:00 ca Exp %
.\"
.\" $FreeBSD$
.\" WORD: recipient		受け手[sendmail.8]
.\" WORD: envelope sender	エンベロープ中の送り手[sendmail.8]
.\"
.TH SENDMAIL 8 "$Date: 2004-04-24 16:05:05 $"
.SH 名称
sendmail
\- 電子メール配送デーモン
.SH 書式
.B sendmail
.RI [ flags "] [" "address ..." ]
.br
.B newaliases
.br
.B mailq
.RB [ \-v ]
.br
.B hoststat
.br
.B purgestat
.br
.B smtpd
.SH 解説
.B sendmail
はメッセージを一人または複数の受け手
.RI ( recipient )
に送ります。必要ならばインターネットワークを
通してメッセージを正しい場所に転送します。
.PP
.B sendmail
はユーザインタフェースとして使われることは考慮されていません。
ユーザにとって使いやすいフロントエンドは別のプログラムで
提供されます。
.B sendmail
は、あらかじめメールとして整形されたメッセージ
を配送するためだけに使われます。
.PP
引数を指定せずに起動すると、
.B sendmail
は標準入力をファイルの終端まで、または `.'だけを含む行まで読み込み、
そこで確認したメッセージのコピーを、
列挙されたアドレスに送ります。アドレスの文法や内容にもとづいて
経路に使用するネットワークを決定します。
.PP
ローカルアドレスは、あるファイルの中を検索して適当なエイリアスを行います。
先頭にバックスラッシュ `\\' のついたアドレスについては、エイリアスは
行なわれません。
8.10 から、送り手はエイリアス展開の対象に含まれるようになりました。
つまり、`john' が `group' にメールを送る
際に、 `john' が `group' に含まれているならば、
送ったメッセージは `john' にも送られます。
.SS パラメータ
.TP
.B \-Ac
動作モードが最初のメール送信依頼であることを示していない場合でも、
submit.cf を使用します。
.TP
.B \-Am
動作モードが最初のメール送信依頼であることを示している場合でも、
sendmail.cf を使用します。
.TP
.BI \-B type
ボディのタイプを
.IR type
に設定します。現在有効なのは、
7BIT
か
8BITMIME
です。
.TP
.BI \-ba
ARPANET
モードに移行します。すべての入力行は CR-LF で終わらなければならず、
すべてのメッセージの末尾には CR-LF がつきます。また、``From:'' と ``Sender:''
フィールドは送り手の名前としてチェックされます。
.TP
.BI \-bd
デーモンモードで実行します。
.B sendmail
は
fork
を行い、バックグラウンドで動作し、ソケット番号 25 で
SMTP
コネクションを
待ちます。通常このモードは、
/etc/rc
から実行されています。
.TP
.B \-bD
フォアグラウンドで動作する以外は
.B \-bd
と同じです。
.TP
.B \-bh
継続的なホスト状況データベースの現在の値を表示します。
.TP
.B \-bH
継続的なホスト状況データベースから
期限切れのエントリを抹消します。
.TP
.B \-bi
エイリアスデータベースを初期化します。
.TP
.B \-bm
普通にメールを配送します(デフォルト)。
.TP
.B \-bp
メールキューのリストを表示します。
.TP
.B \-bP
キューの中のエントリ数を表示します。
共有メモリサポート付きの場合のみ、使用可能です。
.TP
.B \-bs
標準入出力で
RFC821
にもとづいた
SMTP
プロトコルを使います。この
フラグは、
.B \-ba
フラグのうち
SMTP
互換の全ての操作を含みます。
.TP
.B \-bt
アドレスのテストモードで起動します。このモードは対話
モードでアドレスを入力し、処理の過程を表示します。設定ファイル
をデバッグするのに使います。
.TP
.B \-bv
名前のチェックだけを行います。メッセージの収集や配送は行い
ません。ベリファイモードは、ユーザやメーリングリストが有効かどうかを確認する
ために使います。
.TP
.BI \-C file
別の設定ファイルを使います。
.B sendmail
は、別の設定ファイルを使用する場合には、
拡張された (ユーザ ID またはグループ ID が設定された) 権限を断念します。
.TP
.BI \-d category . level...
.I category
のデバッグフラグを
.IR level
に設定します。
.I category
は整数またはトピックを指定する名前であり、
.I level
は希望するデバッグ出力のレベルを指定する整数です。
一般的に、レベルが高いほど出力が多くなります。
コンマで分けることで複数のフラグを指定できます。
デバッグカテゴリの数値の表は sendmail ソースディストリビューションの
TRACEFLAGS ファイルで見つけることができます。
.br
オプション
.B \-d0.1
は
.B sendmail
のバージョンとコンパイル時に指定されたオプションを表示します。
.br
その他のカテゴリのほとんどは、ソースコードに書かれていますが、
.BR sendmail
のソースコードと合わせて使う場合にのみ有用です。
.ne 1i
.TP
.BI \-F fullname
送り手のフルネームを設定します。
.TP
.BI \-f name
``from'' に入る名前(つまり、エンベロープ中の送り手
.RI ( "envelope sender" )
の名前です)を設定します。
最初の送信依頼の間に From: ヘッダが失われている場合、
このアドレスは From: ヘッダの中でも用いられる場合があります。
エンベロープ中の送り手アドレスは、
メッセージ伝送状態の通知の受け手として
用いられ、また、Return-Path: ヘッダにも現れます。
.B \-f
は、``trusted'' なユーザ(普通は
.IR root ", " daemon ", " network
です)が使うか、
送り手が自分自身の名前を指定して使う場合のみ指定することができます。
それ以外の場合、X-Authentication-Warning ヘッダがメッセージに
付加されます。
.TP
.BI \-G
メッセージのリレー (ゲートウェイ) 送信。
例えば、
.BR rmail
が
.B sendmail
を呼ぶときがそうです。
.TP
.BI \-h N
ホップカウントを
.I N
に設定します。ホップカウントは、
メールが処理されるたびに増えていきます。ホップカウントが上限に達した
とき、メールは「エイリアスがループしている」という旨のエラーメッセージと
いっしょに送り返されます。
もしこのフラグが指定されなければ、メッセージの
なかの ``Received:'' 行がカウントされます。
.TP
.B \-i
入力されるメッセージ中の `.' だけを含む行を無視します。
このフラグは、データをファイルから読み込むような場合に使用する必要があります。
.TP
.BI "\-L " tag
syslog メッセージ中で使われる識別子を、指定した
.I tag
に設定します。
.TP
.BI "\-N " dsn
配送状況の通知条件を
.I dsn
に設定します。
.I dsn
には、
`never'
(何も通知しない)または、コンマで区切った、
`failure'
(配送が失敗した場合に通知する)
`delay'
(配送が遅れた場合に通知する)
`success'
(配送が正常に行われた場合に通知する)
の組み合わせを指定する事ができます。
.TP
.B \-n
エイリアスを行いません。
.TP
\fB\-O\fP \fIoption\fR=\fIvalue\fR
オプション
.I option
を、指定した
.I value
に設定します。この形式では長いオプション名が使用されます。
詳しくは後に記述します。
.TP
.BI \-o "x value"
オプション
.I x
を、指定した
.I value
に設定します。
この形式では、一文字のオプション名しか使用できません。
短いオプション名についてはこのマニュアルには記述されていません。
詳しくは、
.I "Sendmail Installation and Operation Guide"
を参照して下さい。
.TP
.BI \-p protocol
メッセージを受け取るために利用するプロトコル名を設定します。
設定できるのは、``UUCP'' のようなプロトコル名だけか
プロトコル+ホスト名、たとえば ``UUCP:ucbvax'' などです。
.TP
\fB\-q\fR[\fItime\fR]
キューのなかにあるメッセージを指定した時間間隔で処理します。
.I time
を省略した場合は、キューの内容を一度だけしか処理しません。
.I time
は、
秒を表す `s'、
分を表す `m' (デフォルト)、
時間を表す `h'、
日を表す `d'、
週を表す `w' の単位を付けた数字で指定します。
たとえば、
`\-q1h30m'
や
`\-q90m'
は、タイムアウトを 1 時間 30 分に設定します。
デフォルトでは、
.B sendmail
はデーモンとしてバックグラウンドで
実行されます。
このオプションは、問題なく
.B \-bd
と共に指定可能です。
.TP
\fB\-qp\fR[\fItime\fR] 
\fB\-q\fItime\fR と似ていますが、sendmail は、
キューを処理する子プロセスを定期的に fork するのではなく、
キューの処理とスリープを交互に行う 1 個の永続的な子プロセスを fork します。
スリープ時間は引数で指定します。
デフォルトは 1 秒です。
直前のキュー実行においてキューが空だった場合、
プロセスは常に最低 5 秒はスリープします。
.TP
\fB\-q\fRf
キューに保存されているメッセージを 1 度だけ処理します。
この際、fork() せずに、フォアグラウンドで実行します。
.TP
\fB\-q\fRG name
.I name
という名前のキューグループ中のジョブのみ処理します。
.TP
\fB\-q\fR[\fI!\fR]I\fIsubstr\fR
キュー ID の文字列に
.I substr
が含まれるジョブのみを処理します。
.I !
が指定されると、その逆となります。
.TP
\fB\-q\fR[\fI!\fR]R\fIsubstr\fR
受け手のリストの文字列に
.I substr
が含まれるジョブのみを処理します。
.I !
が指定されると、その逆となります。
.TP
\fB\-q\fR[\fI!\fR]S\fIsubstr\fR
送り手の文字列に
.I substr
が含まれるジョブのみを処理します。
.I !
が指定されると、その逆となります。
.TP
.BI "\-R " return
メッセージがバウンスした時に返送されるメッセージの量を設定します。
.I return
パラメータには、メッセージ全体を返送する場合は
`full'
を、ヘッダのみを返送する場合は
`hdrs'
を指定します。
.TP
.BI \-r name
.B \-f
フラグと同じですが、古い形式です。
.TP
.B \-t
受け手をメッセージから読み取ります。To:, Cc:, Bcc: フィールドが受け手
のアドレスとして読み込まれます。Bcc: フィールドはメッセージの転送前に
削除されます。
.TP
.BI "\-V " envid
オリジナルのエンベロープ ID を設定します。
これは、DSN をサポートするサーバ間では SMTP 上を伝達し、
DSN に従ったエラーメッセージの中で返送されます。
.TP
.B \-v
詳細モードに移行します。
エイリアスの展開などが報告されます。
.TP
.BI "\-X " logfile
指定された
.I logfile
に、メーラに出入りする情報すべてを記録します。
メーラをデバッグする際の
最後の手段としてのみ使ってください。非常に大量の情報があっという間に記録
されます。
.TP
.B \-\-
コマンドフラグ処理を停止し、残りの引数をアドレスとして使用します。
.SS オプション
.B sendmail
には、設定することができる多くの処理オプションがあります。
通常、これらのオプションはシステム管理者のみが使います。
オプションは、コマンドラインから
.B \-o
フラグを使って(短いオプション名で)指定したり、
.B \-O
フラグを使って(長いオプション名で)指定したり、
設定ファイルから指定することができます。ここに記述して
いるのは部分的なもので、コマンド行から指定する場合に便利な物だけを、
長いオプション名で示しています。完全なリスト(と詳細)は、
.I "Sendmail Installation and Operation Guide"
を参照してください。
オプションには以下の物があります。
.TP
.RI AliasFile= file
別のエイリアスファイルを使います。
.TP
HoldExpensive
接続するのに時間がかかるホストと接続するときは、
すぐに接続せず、リクエストはキューに入れられます。
.TP
.RI CheckpointInterval= N
.B sendmail
が、
.I N
個の配送に成功するたびにキューファイルに
チェックポイントを設定します(デフォルトは 10 個です)。これによって、
システムのクラッシュによって長いメーリングリストの配送が中断
されたときでも、再開時に同じ人に重複して配送されることを防ぎます。
.ne 1i
.TP
.RI DeliveryMode= x
配送モードを
.I x
に設定します。配送モードには
`i'
対話的(同期的)配送モード、
`b'
バックグラウンド(非同期的)配送モード、
`q'
キューモード(実際の配送は、キューが実行されるときに行われる)、
`d'
延期モード( \-D オプションで指定された
マップ (デフォルトはホストマップ) に対し
データベースの検索が行われない以外は
`q'
と同じ)があります。
.TP
.RI ErrorMode= x
エラー処理をモード
.I x
に設定します。有効なモードとして、
`m'
はエラーメッセージを送り返します。
`w'
はエラーメッセージを送り手の端末に書き出します
(送り手がログインしていなければ、メールを返します)。
`p'
は、エラーメッセージを端末に表示します(デフォルト)。
`q'
は、エラーメッセージを捨てます(exit コードだけを返します)。
`e'
は、BerkNet 用に特別処理をします。
もし、モード
`m'
や
`w'
を使っている場合に、エラーとなったメッセージが
エラーメールとして送り返されず、送り手が
.B sendmail
を実行している
マシン上のユーザならば、
メッセージのコピーは送り手のホームディレクトリにある
.I dead.letter
に追加されます。
.TP
SaveFromLine
メッセージのはじめに
UNIX-style
の
From 行を残します。
.TP
.RI MaxHopCount= N
メールがループしていると判断されない、最大のホップ数を
指定します。
.TP
IgnoreDots
`.' だけを含む行をメッセージの終わりとして解釈しません。
.TP
SendMimeErrors
エラーメッセージをMIMEフォーマットで送り返します。
設定されていない場合は、DSN (Delivery Status Notification: 配送状況通知) SMTP
拡張は無効になります。
.TP
.RI ConnectionCacheTimeout= timeout
コネクションキャッシュの
タイムアウトを設定します。
.TP
.RI ConnectionCacheSize= N
コネクションキャッシュのサイズを
設定します。
.TP
.RI LogLevel= n
ログレベルを設定します。
.TP
.RI MeToo= False
エイリアスに自分自身が含まれていても、``me''(送り手自身)には送りません。
.TP
CheckAliases
newaliases(1)
コマンドの実行の際、
エイリアスの右辺(エイリアスの値)の有効性をチェックします。
.TP
OldStyleHeaders
このオプションが設定されていれば、メッセージが古いスタイルのヘッダ
を持つことがあることを意味します。
このオプションが設定されていなければ、このメッセージが新しい
スタイルを持っていることが保証されます(2 つのアドレスの間は
スペースのかわり
にコンマで区切られます)。このオプションが設定されていると、
ヘッダのフォーマットをたいていの場合に
正しく決定する適応アルゴリズムが用いられます。
.TP
.RI QueueDirectory= queuedir
キューメッセージを保存するディレクトリを選択します。
.TP
.RI StatusFile= file
指定した名前のファイルに統計情報をセーブします。
.TP
.RI Timeout.queuereturn= time
キューのなかの配送されなかったメッセージのタイムアウト時間を設定します。
この時間内に(ホストのダウンなどにより)配送が行われなかったときには、
失敗した旨のメッセージが送り返されます。デフォルトは 5 日です。
.TP
.RI UserDatabaseSpec= userdatabase
セットした場合、ユーザデータベースを見て、
フォワード情報を得ます。
この方法をエイリアス機構の補助として使用する事ができます。
この方法は、データベースが分配されることを意図している点が異なります。
一方、エイリアスは、そのホストローカルでのみ有効です。
.B sendmail
が
USERDB
付きでコンパイルされていなければ使うことはできません。
.TP
ForkEachJob
キューを処理する間、各ジョブごとに
fork
を行います。メモリが少ないマシン
では便利です。
.TP
SevenBitInput
到着するメッセージを 7 ビットにします (8 ビット目は落します)。
.TP
.RI EightBitMode= mode
8 ビットの入力を 7 ビットの宛先へ送る場合の処理方法を
.IR mode
に設定します。
処理方法には、
m
(mime 化) 7 ビット MIME 形式へ変換、
p
(パス) 8 ビットのまま配送(プロトコルには違反します)、
s
(厳密) メッセージをバウンス、
があります。
.TP
.RI MinQueueAge= timeout
配送の試行の間、ジョブがキューに蓄積される時間を設定します。
.TP
.RI DefaultCharSet= charset
文字集合が特に指定されていない 8 ビットデータにラベル付けする際に
用いる、デフォルトの文字集合を設定します。
.TP
.RI DialDelay= sleeptime
コネクションの確立が失敗した場合に、再試行までに
.I sleeptime
だけスリープします。オンデマンドでダイヤル接続するサイトでの
使用に便利です。
.TP
.RI NoRecipientAction= action
受け手ヘッダ (To:, Cc:, Bcc:) がない場合の動作を
.I action
に設定します。
none
メッセージを変更しない、
add-to
エンベロープで指定された受け手を入れた To: ヘッダを加える、
add-apparrently-to
エンベロープで指定された受け手を入れた Apparrently-To: ヘッダを加える、
add-bcc
空の Bcc: ヘッダを加える、
add-to-undisclosed
`To: undisclosed-recipients:;'
というヘッダを加える、という動作を指定できます。
.TP
.RI MaxDaemonChildren= N
待ち受け SMTP デーモンが同時に生成する子プロセスの最大数を
.I N
に設定します。
.TP
.RI ConnectionRateThrottle= N
SMTP ポートへの 1 秒当りの最大コネクション数を
.I N
に設定します。
.PP
エイリアスのなかで最初の文字が `|' で始まるものは、メールの内容を
パイプでコマンドに送るものと解釈されます。
.B sendmail
に引数の間から空白文字を削除させないようにする場合は
名前をクォートする (" でくくる)必要があります。
以下に、例を示します:
.IP
msgs: "|/usr/bin/msgs -s"
.PP
エイリアスには、
.RI ``:include: filename ''
という文法もあります。
.B sendmail
は、
メールの受け手のリストを得るために、指定されたファイルを読みます。
以下に、例を示します:
.IP
poets: ":include:/usr/local/lib/poets.list"
.PP
上記の例の場合は、
.I /usr/local/lib/poets.list
を読み、`poets' のグループの
ためのアドレスリストを作ります。
.PP
.B sendmail
は、以下に示すような終了コードを返します。これらの
コードは、
.RI < sysexits.h >
に定義されています。
.TP
EX_OK
すべてのアドレスについて完全に成功しました。
.TP
EX_NOUSER
ユーザ名が認識できません。
.TP
EX_UNAVAILABLE
処理に必要なリソースを得ることができません。
.TP
EX_SYNTAX
アドレスに文法的な間違いがあります。
.TP
EX_SOFTWARE
引数が間違っているなどの、内部的なエラーです。
.TP
EX_OSERR
``cannot fork'''
のような、一時的な OS エラーです。
.TP
EX_NOHOST
ホスト名が認識できません。
.TP
EX_TEMPFAIL
メッセージはすぐには送られませんでしたが、
キューには入れられました。
.PP
.B newaliases
というコマンドで実行されると、
.B sendmail
はエイリアスデータベースを再構築します。
.B mailq
というコマンドで実行されると、
.B sendmail
はメールキューの内容を表示します。
.B hoststat
というコマンドで実行されると、
.B sendmail
は、継続的なホスト状態データベースの内容を表示します。
.B purgestat
というコマンドで実行されると、
.B sendmail
は、継続的なホスト状態データベースから期限切れのエントリを抹消します。
.B smtpd
というコマンドで実行されると、
.B \-bd
オプションを指定されたの同じように、
.B sendmail
はデーモンとして動作します。
.SH 注
.B sendmail
は、多くの問題の原因だと責められることがよくありますが、
実際のところ、それらの問題は、
ディレクトリのモードが過剰に許可された状態であるなど、
他の問題に起因するものです。このため、
.B sendmail
は、システムディレクトリとファイルのモードをチェックし、
それらディレクトリ、ファイルが信頼するに足るものかどうかを
決定します。
.B DontBlameSendmail
オプションを設定することにより、
このチェックをオフにし、システムのセキュリティを低下することも
できますが、基本的には、パーミッションの問題は修正されねばなりません。
詳細な情報は、

.I http://www.sendmail.org/tips/DontBlameSendmail.html

を参照して下さい。
.SH 関連ファイル
.I /etc/mail/sendmail.cf
それ自身を除き、以下のファイルのパスはすべて
.I /etc/mail/sendmail.cf
の内部で指定されています。以下の値は概略に過ぎません。
.PP
.TP
/etc/mail/aliases
エイリアス名の生データ
.TP
/etc/mail/aliases.db
エイリアス名のデータベース
.TP
/etc/mail/sendmail.cf
設定ファイル
.TP
/etc/mail/helpfile
ヘルプファイル
.TP
/etc/mail/statistics
統計情報ファイル
.TP
/var/spool/mqueue/*
テンポラリファイル
.SH 関連項目
mail(1),
syslog(3),
aliases(5),
mailaddr(7),
mail.local(8),
rc(8),
rmail(8)
.PP
DARPA
Internet Request For Comments
.IR RFC819 ,
.IR RFC821 ,
.IR RFC822 .
.IR "Sendmail Installation and Operation Guide" ,
No. 8, SMM.
.PP
http://www.sendmail.org/
.SH 歴史
.B sendmail
コマンドは
4.2BSD
から登場しました。
.\" %FreeBSD: src/contrib/sendmail/src/sendmail.8,v 1.12 2004/02/14 21:58:08 gshapiro Exp %
