freebsd/freebsd-doc/ja_JP.eucJP/man/man8/setpmac.8
.\" Copyright (c) 2003 Networks Associates Technology, Inc.
.\" All rights reserved.
.\" 
.\" This software was developed for the FreeBSD Project by Chris Costello
.\" at Safeport Network Services and Network Associates Labs, the
.\" Security Research Division of Network Associates, Inc. under
.\" DARPA/SPAWAR contract N66001-01-C-8035 ("CBOSS"), as part of the
.\" DARPA CHATS research program.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" 
.\" %FreeBSD: src/usr.sbin/setpmac/setpmac.8,v 1.3 2003/01/15 03:09:01 chris Exp %
.\" $FreeBSD$
.Dd JANUARY 14, 2003
.Os
.Dt SETPMAC 8
.Sh 名称
.Nm setpmac
.Nd 別の MAC プロセスラベルにおけるコマンド実行
.Sh 書式
.Nm
.Ar label
.Ar command
.Op Ar args Op Ar ...
.Sh 解説
.Nm
ユーティリティは、新規プロセスをフォークし、ラベルを
.Ar label
に設定しようとし、成功すると
.Ar command
を実行します。
.Sh 関連項目
.Xr mac 4 ,
.Xr maclabel 7 ,
.Xr getfmac 8 ,
.Xr getpmac 8 ,
.Xr setfmac 8
.Sh 作者
このソフトウェアは、
Network Associates Labs,
the Security Research Division of Network Associates Inc.
が、DARPA CHATS 研究プログラムの一部として、
DARPA/SPAWAR 契約 N66001-01-C-8035 ("CBOSS") のもとに、
.Fx
Project に寄贈しました。
