freebsd/freebsd-doc/ja_JP.eucJP/man/man8/showmount.8
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Rick Macklem at The University of Guelph.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)showmount.8	8.3 (Berkeley) 3/29/95
.\" %FreeBSD: src/usr.bin/showmount/showmount.8,v 1.17 2002/12/12 17:26:01 ru Exp %
.\" $FreeBSD$
.\"
.Dd March 29, 1995
.Dt SHOWMOUNT 8
.Os
.Sh 名称
.Nm showmount
.Nd NFS サーバに対する現在のリモート NFS マウントを表示する
.Sh 書式
.Nm
.Op Fl a | d
.Op Fl e3
.Op Ar host
.Sh 解説
.Nm
ユーティリティは、ホスト
.Ar host
上の
.Tn NFS
サーバの情報を表示します。
デフォルトでは、そのホストの
.Tn NFS
ファイルシステムをマウントしているすべての
クライアントのホスト名を表示します。プロトコルの詳細については、RFC1094,
.%T "NFS: Network File System Protocol Specification"
の Appendix A と、
.%T "NFS: Network File System Version 3 Protocol Specification"
の Appendix I を参照してください。
.Pp
次のオプションを使用可能です:
.Bl -tag -width indent
.It Fl a
以下のような形ですべてのマウントポイントを表示します:
.Bd -ragged -offset indent -compact
.Ar host : Ns Ar dirpath
.Ed
.It Fl d
クライアントのホスト名のかわりに、
マウントポイントのディレクトリパスを表示します。
.It Fl e
指定した
.Ar host
の公開設定 (NFS エクスポート) しているファイルシステムを表示します。
.It Fl 3
.Tn NFS
バージョン 3 と互換性のある、マウントプロトコルバージョン 3 を使用します。
.El
.Sh 関連項目
.Xr mount 8 ,
.Xr mountd 8 ,
.Xr mount_nfs 8
.Sh バグ
.Tn NFS
サーバはステートレス (クライアントの状態を持たない) なので、
サーバ上で実行しているマウントデーモンが分かるのは、
実際にマウントされているものだけです。
.Nm
ユーティリティは、マウントデーモンが報告するのと同じ程度の正確さでしか
情報を表示しません。
.Sh 歴史
.Nm
ユーティリティは
.Bx 4.4
から登場しました。
