freebsd/freebsd-doc/ja_JP.eucJP/man/man8/shutdown.8
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)shutdown.8	8.2 (Berkeley) 4/27/95
.\" %FreeBSD: src/sbin/shutdown/shutdown.8,v 1.12 1999/08/28 00:14:23 peter Exp %
.\"
.\" jpman %Id: shutdown.8,v 1.2 1997/05/13 00:55:09 mutoh Stab %
.\"
.Dd Dec 11, 1998
.Dt SHUTDOWN 8
.Os BSD 4
.Sh 名称
.Nm shutdown
.Nd 指定時刻にシステムを停止する
.Sh 書式
.Nm shutdown
.Op Fl
.Oo
.Fl h | Fl p |
.Fl r | Fl k
.Oc
.Oo
.Fl o
.Op Fl n
.Oc
.Ar time
.Op Ar warning-message ...
.Sh 解説
.Nm shutdown
は、自動的にシャットダウンするための手順をスーパユーザに提供します。
システムがシャットダウンされるときユーザに知らせるので、
こういったお知せを面倒がって行なわない
システム管理者やハッカーやグルといった人々から、ユーザを救います。
.Pp
以下のオプションを使用可能です:
.Bl -tag -width indent
.It Fl h
.Ar time
で指定された時間にシステムを停止します。
.It Fl p
.Ar time
で指定された時間にシステムを停止し、電源をオフします
.Pq ハードウェアサポートが必要です
。
.It Fl r
.Ar time
で指定された時間にシステムを再起動します。
.It Fl k
全ユーザを追い出します。
実際にはシステムを停止しませんが、
マルチユーザシステムのままでスーパユーザ以外のユーザをログインできなくします。
.It Fl o
.Fl h ,
.Fl p ,
.Fl r
のいずれかひとつが指定された場合、
.Nm
は
.Xr init 8
へシグナルを送る代りに、
.Xr halt 8
または
.Xr reboot 8
を実行します。
.It Fl n
.Fl o
オプションが指定されると、
ファイルシステムキャッシュのフラッシュを防ぐために、
.Fl n
オプションを
.Xr halt 8
または
.Xr reboot 8
に渡します。
本オプションはおそらく使用すべきではありません。
.It Ar time
.Nm
がシステムを停止させる時間を指定します。
.Ar now
を指定すると即時にシステムを停止します。
また、時間を指定する次の 2 つの書式があります:
.Ar +number
もしくは
.Ar yymmddhhmm
の形式です。現在のシステムの年・月・日の値がデフォルトになっています。
1 つめの書式は
.Ar number
分経過後をあらわし、2 つめの書式は停止する時刻を直接指定します。
.It Ar warning-message
その他の引数は現在ログイン中のユーザに送る警告メッセージとして扱われます。
.It Fl
もし
.Ql Fl
がオプションとして与えられると、警告メッセージを標準入力から読み取ります。
.El
.Pp
システム停止の 10 時間前から、ログイン中の全てのユーザの端末に
警告メッセージが表示されはじめ、終末が近付くにつれ頻繁になってきます。
システム停止の 5 分前、もしくは 5 分以内にシステム停止する場合には、
ただちに警告メッセージをコピーした
.Pa /var/run/nologin
が作られログインが禁止されます。
ユーザがログインしようとした際にこのファイルが存在する場合には、
.Xr login 1
はその内容を表示し終了します。このファイルは
.Nm
が終了する際に削除されます。
.Pp
システム停止時には、システムを停止した時間、実行者、理由が
システムログに記録されます。その後、対応するシグナルが
.Xr init 8
に送られ、システムを停止、再起動、シングルユーザ状態のいずれかにします
(この動作は上記のオプションに依存します)。
システムを停止する時間と警告メッセージは
.Pa /var/run/nologin
に置かれます。これをユーザにシステムを再開する時間や、なぜシステムを
停止するかなどを知らせるために使うべきです。
.Sh 関連ファイル
.Bl -tag -width /var/run/nologin -compact
.It Pa /var/run/nologin
login に誰にもログインさせないことを知らせます。
.El
.Sh 関連項目
.Xr login 1 ,
.Xr wall 1 ,
.Xr nologin 5 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr reboot 8
.Bd -literal -offset indent
.Sh 以前との互換性
以前との互換性のため、2 つめの書式で時と分をコロン (``:'')
で区切ることができます。
.Ed
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
から登場しました。
