freebsd/freebsd-doc/ja_JP.eucJP/man/man8/sicontrol.8
.\" %Id: sicontrol.8,v 1.3.2.2 1997/10/16 06:28:03 charnier Exp %
.\" jpman %Id: sicontrol.8,v 1.2 1997/06/17 17:49:35 saeki Stab %
.\" The following requests are required for all man pages.
.Dd September 26,1995
.Dt SICONTROL 8
.Os FreeBSD
.Sh 名称
.Nm sicontrol
.Nd Specialix 社 SI/XIO ドライバの設定とデバッグ
.Sh 書式
.Nm sicontrol
device
.Ar command Op Cm Ar param ...
.Sh 解説
.Nm sicontrol
は SI/XIO デバイスドライバの設定やモニタリングをおこなうために使用します。
.Pp
.Nm sicontrol
は
.Ar device
で指定されたポートを操作します。
.Pp
ドライバ全体の設定をおこなう際には、特別なデバイス名 `-' を
.Ar device
に指定します。
.Pp
必要であれば、デバイス名には '/dev/' が補完されます。
.Pp
以下のコマンドはドライバ全体の設定をおこなうので、
デバイス名に '-' を指定する必要があります。
.Bl -tag -width 4n
.It Cm int_throttle Op Cm value
「総合割り込みスロットル値」を設定します。
ホストアダプタ割り込みの 1 秒あたりの最大値は次のようにして求められます:
.Pp
.Ar "controller CPU clock / (8 * int_throttle)"
.Pp
ブート時のデフォルト値は 25000 で、ホストアダプタの CPU クロックは 
25MHz ですから、この場合の最大割り込みレートは約 125 回/秒になります。
.Pp
この値を下げると、ホストアダプタがオペレーティングシステムに
処理を要求するための割り込みのレートを増加させることができます。
.\"
.It Cm rxint_throttle Op Cm value
受信割り込みスロットル値を設定します。
ブート時のデフォルト値は 4 で、割り込みレートは約 25 回/秒になります。
.Pp
この値を下げると、ホストアダプタがオペレーティングシステムに受信 FIFO を
空にするよう要求する割り込みのレートを増加させることができます。
.\"
.It Cm nport
そのデバイスドライバの制御下にあるシリアルポートの数を返します。
.El
.Pp
以下のコマンドは個々のシリアルポートに対して実行されるため、
.Pa /dev
以下のデバイス名を指定する必要があります。
.Bl -tag -width 4n
.It Cm mstate
モデムが駆動する制御信号の、現在の状態を表示します。
.It Cm ccbstat
指定されたシリアルポートの "ccb" 構造体の、現在の内容を表示します。
これはドライバのデバッグや、シリアルポートが反応しない原因の調査以外には、
あまり使い道がありません。
.It Cm ttystat
指定されたシリアルポートに関するカーネル内部の "tty" 構造体の現在の内容を
表示します。これはドライバのデバッグ以外には、あまり使い道がありません。
.El
.\" The following requests should be uncommented and used where appropriate.
.\" This next request is for sections 2 and 3 function return values only.
.\" .Sh RETURN VALUES
.\" This next request is for sections 1, 6, 7 & 8 only
.\" .Sh ENVIRONMENT
.Sh 関連ファイル
.Bl -tag -width /dev/si_control -compact
.It Pa /dev/si_control
.Xr sicontrol 8
で使用される、ドライバ全体の制御ファイル
.It Pa /dev/ttyA*
ターミナル制御ポート
.It Pa /dev/ttyiA*
.Xr stty 1
で使用される、初期 termios ステートデバイス
.It Pa /dev/ttylA*
.Xr stty 1
で使用される、ロックされた termios ステートデバイス
.El
.\" .Sh EXAMPLES
.\" This next request is for sections 1, 6, 7 & 8 only
.\"     (command return values (to shell) and fprintf/stderr type diagnostics)
.Sh 診断
一般に自明です.....
.\" The next request is for sections 2 and 3 error and signal handling only.
.\" .Sh ERRORS
.Sh 関連項目
.Xr stty 1 ,
.Xr si 4 ,
.Xr termios 4 ,
.Xr tty 4 ,
.Xr comcontrol 8 .
.\" .Sh STANDARDS
.Sh 歴史
.Nm sicontrol
は
.An Andy Rutter Aq andy@acronym.co.uk
によって書かれた
.Nm siconfig
ユーティリティを基にしている部分が多少あります。
.Pp
Specialix International 社は、このデバイスドライバに関して、
いかなる形のサポートもおこないません。
.Sh 作者
Peter Wemm <peter@freebsd.org>
.Sh バグ
たくさんあるでしょう... :-)
