freebsd/freebsd-doc/ja_JP.eucJP/man/man8/sliplogin.8
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)sliplogin.8	8.2 (Berkeley) 1/5/94
\" %FreeBSD: src/usr.sbin/sliplogin/sliplogin.8,v 1.12.2.1 2000/12/08 15:28:57 ru Exp %
.\"
.\" jpman %Id: sliplogin.8,v 1.3 1997/07/26 22:10:08 horikawa Stab %
.\"
.Dd January 5, 1994
.Dt SLIPLOGIN 8
.Os
.Sh 名称
.Nm sliplogin
.Nd シリアル回線とネットワークインタフェースの対応づけ(アタッチ)を行う
.Sh 書式
.Nm
.Op Ar loginname Op Ar device
.Sh 解説
.Nm
は、標準入力 (もしくは、
.Ar device )
の tty 回線を用いて他のホストと Serial Line IP
.Pq Tn SLIP
による接続を確立するためのコマンドです。
そのために、まず
.Pa /etc/sliphome/slip.hosts
ファイルを検索し、引数
.Ar loginname
と一致するエントリを引き出します。
(ログイン名が省略された場合、コマンドを起動したユーザのログイン名が用い
られます)
ログイン名と一致するエントリが見つかった場合、回線は SLIP に適した設定
(8ビット透過な入出力) にされ、オプションの回線パラメータを使って
.Tn SLIP
回線に変換されます。
.Pp
回線パラメータのオプションは次のとおりです:
.Sq normal ,
.Sq compress ,
.Sq noicmp ,
.Sq autocomp
これらはそれぞれ、
.Sq 通常の設定 (ヘッダ圧縮をしない)
、
.Sq VJヘッダ圧縮を行う
、
.Sq ICMP パケットを無視する
、
.Sq VJヘッダ圧縮を自動設定する (相手がサポートしているときのみヘッダ圧縮する)
です。
.Pp
その後、
.Tn IP
アドレスやネットマスクなどの設定を行なう、
SLIP インタフェース初期化のためのシェルスクリプトが実行され
ます。
.Pp
通常、初期化のためのシェルスクリプトファイルは
.Pa /etc/sliphome/slip.login
ですが、特定のホスト向けの設定のために、
.Pa /etc/sliphome/slip.login. Ns Ar loginname
というシェルスクリプトファイルがあった場合は、そちらが実行されます。
スクリプトは、以下のパラメータとともに起動されます。
.Bl -tag -width slipunit
.It Em slipunit
回線に割り当てられる SLIP インタフェースです。例えば、
.Sy 0
の場合、割り当てられる SLIP インタフェースは
.Sy sl0
です。
.It Em speed
回線速度です。
.It Em args
.Ar loginname
を指定して起動する場合、
.Pa /etc/sliphome/slip.hosts
の対応エントリに記述されている引数です。
.El
.Pp
スーパユーザのみが、ネットワークインタフェースのアタッチを行うことが
出来ます。ネットワークインタフェースは、リモートホスト側で回線切断す
るか、ローカルホスト側の
.Nm
プロセスが終了した場合には自動的に対応づけが解消 (デタッチ) されます。
カーネル SLIP モジュールが設定されていた場合、このインタフェースを経由
して設定されている全ての経路は、同時に消滅します。
他の処理も行いたいサイトでは、回線の切断時に
.Pa /etc/sliphome/slip.logout
ファイルもしくは
.Pa /etc/sliphome/slip.logout. Ns Ar loginname
ファイルが有ればその内容が実行されますので、これを使って下さい。
起動時には、ログインスクリプトと同じ引数が与えられます。
.Ss /etc/sliphome/slip.hosts の書式
コメント (`#' で開始する行) および空白行 (もしくは空白で開始する行) は
無視されます。
他の行は、
.Ar loginname
で始まる必要があります。
しかし、他の引数については、そのログイン名に対応して実行される
.Pa  slip.login
ファイルに応じたものであれば、何でもかまいません。
引数は、スペースやタブで区切り、
.Xr sh 1
が解釈出来るクォートなどを用いてまとめます(ただし
.Ar loginname
はクォートできません)。
通常、各行は以下の形式で記述されます:
.Bd -literal -offset indent
loginname local-address remote-address netmask opt-args
.Ed
.Pp
.Em local-address
と
.Em remote-address
については、互いに接続される SLIP インタフェースに割り当てられる IP アドレスを
(ホスト名か数字で) 設定します。そして、
.Em netmask
については、適切な IP ネットマスクを設定します。これらの引数は、直接
.Xr ifconfig 8
に渡されます。
.Em opt-args
は、オプション引数であり、回線の設定に用いられます。
.Pp
.Sh FreeBSD での追加
追加の SLIP 設定用ファイル
.Pa /etc/sliphome/slip.slparms
があるかもしれません。
特定のホストに異なる設定が必要である場合、
ファイル
.Pa /etc/sliphome/slip.slparms. Ns Ar loginname
が存在すれば、代わりに使われます。
.Ss /etc/sliphome/slip.slparms* の書式
コメント (`#' で開始する行) および空白行 (もしくは空白で開始する行) は
無視されます。
このファイルには空白で区切られた 1 から 3 個の数字を書きます。
数字は順に、
.Ar keepalive ,
.Ar outfill ,
.Ar slunit
を意味します。
.Bl -tag -width keepalive
.It Ar keepalive
SLIP "keep alive" タイムアウト時間を秒単位で設定します。
FRAME_END がこの時間内に受信できない時、
.Nm
は回線を閉じて終了します。
省略時はタイムアウトは設定されません ( 0 です)。
.It Ar outfill
SLIP "out fill" タイムアウト時間を秒単位で設定します。
これにより、相手側の "keep alive" タイムアウトに必要な
FRAME_END をこの時間内に送信します。
省略時はタイムアウトは設定されません ( 0 です)。
.It Ar slunit
SLIP ユニット番号を直接指定します。
2 つのインタフェースが同じユニット番号にならないかチェックをしないので、
注意が必要です。
省略時は動的にユニット番号を割り当てます。
.El
.Pp
あとの 2 つのパラメータが省略されたときは、これに対応する SLIP の設定には影響が
ありません。最初の 2 つのパラメータが 0 であるときにも、これに対応する設定に
影響しません。
.Sh 使用例
通常、
.Nm
を使う場合、
リモートの SLIP サイトごとに
.Nm
をシェルフィールドに持つ
.Pa /etc/passwd
のエントリを作ります。例えば
.Bd -literal
Sfoo:ikhuy6:2010:1:slip line to foo:/tmp:/usr/sbin/sliplogin
.Ed
.Pp
(ここでは、リモートホスト
.Ar hostname
のアカウント名を
.Em Shostname
としています)
次に、
.Pa slip.hosts
に、以下のようなエントリを追加します:
.Pp
.Bd -literal -offset indent -compact
Sfoo	`hostname`	foo	netmask
.Ed
.Pp
ここで、
.Em `hostname`
は、
.Xr sh
によって評価されローカルホスト名となり、
.Em netmask
はローカルホストの IP ネットマスクです。
.Pp
注意事項があります。
.Nm
は、root に setuid しなければなりません。
セキュリティホールではありませんが、心がけの悪い奴が
.Nm
をつかって端末の回線を使えなくしたり、リモートの SLIP サイトのユーザの
アクセスを不可能にしたりすることができます。これを防ぐために、
.Nm
をユーザ
.Em root
グループ
.Em network
モード 4550 でインストールし、グループ
.Em network
のメンバのみが
.Nm
を実行可能とします。システム管理者は、
正当なユーザが正しいグループのメンバであることを確認すべきです。
.Sh 診断
.Nm
は、様々な情報を
.Em daemon
の facility コードでシステムログデーモン
.Xr syslogd 8
を通じて、 syslog に書き出します。
以下に問題の大きさ別にメッセージを列挙します。
.Pp
.Sy エラー
.Bl -tag -width Ds -compact
.It Sy ioctl (TCGETS): Em 理由
.Dv TCGETS
.Fn ioctl
を用いた回線のパラメータ取得が失敗しました。
.Pp
.It Sy ioctl (TCSETS): Em 理由
.Dv TCSETS
.Fn ioctl
を用いた回線のパラメータ設定が失敗しました。
.Pp
.It Sy /etc/sliphome/slip.hosts: Em 理由
.Pa /etc/sliphome/slip.hosts
ファイルがオープン出来ません。
.Pp
.It Sy access denied for Em user
.Em user
エントリが
.Pa /etc/sliphome/slip.hosts
にありません。
.El
.Pp
.Sy 報告
.Bl -tag -width Ds -compact
.It Sy "attaching slip unit" Em unit Sy for Ar loginname
.Tn SLIP
ユニット
.Em unit
は、アタッチに成功しました。
.El
.Sh 関連ファイル
.Ar /etc/sliphome/slip.hosts
ホストのログイン名とパラメータのリスト。
.Pp
.Ar /etc/sliphome/slip.login
接続がなされたときに実行されるスクリプト。
.Pp
.Ar /etc/sliphome/slip.login.loginname
.Ar loginname
によって接続がなされたときに実行されるスクリプト。
.Pp
.Ar /etc/sliphome/slip.logout
接続が失われたときに実行されるスクリプト。
.Pp
.Ar /etc/sliphome/slip.logout.loginname
.Ar loginname
によって接続が失われたときに実行されるスクリプト。
.Pp
.Ar /etc/sliphome/slip.slparms
追加のパラメータファイル。
.Pp
.Ar /etc/sliphome/slip.slparms.loginname
.Ar loginname
用の追加のパラメータファイル。
.Pp
.Ar /var/run/ttyXn.if
.Ar ttyXn
に対して sliplogin 処理がなされた時に使用されるネットワークインタフェース名
を格納します。
.Pp
.Ar /var/run/slX.pid
インタフェース slX を使用する sliplogin プロセスの PID を格納します。
.Pp
.Sh 関連項目
.Xr slattach 8 ,
.Xr syslogd 8 ,
.Pa /usr/share/examples/sliplogin
.Sh 歴史
.Nm
コマンドは、現在βテスト版です。
