freebsd/freebsd-doc/ja_JP.eucJP/man/man8/slstat.8
.\" Copyright (c) 1986 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	From: @(#)slstat.8	6.8 (Berkeley) 6/20/91
.\" %FreeBSD: src/usr.sbin/slstat/slstat.8,v 1.12.2.1 1999/08/29 15:48:17 peter Exp %
.\" jpman %Id: slstat.8,v 1.2 1997/05/24 05:28:27 mitchy Stab %
.\"
.Dd October 11, 1996
.Dt SLSTAT 8
.Os BSD 4
.Sh 名称
.Nm slstat
.Nd シリアル回線 IP (SLIP) の利用統計を表示する
.Sh 書式
.Nm
.Op Fl i Ar interval
.Op Fl vr
.Op Ar unit
.Sh 解説
.Nm
はシリアル回線インターネットプロトコル (SLIP) のトラフィックに関連する
カーネルの統計情報を表示します。
.Pp
オプションは、以下のとおりです:
.Bl -tag -width indent
.It Fl i
.Ar interval
秒毎に表示を繰り返します。
.Ar interval
が指定されない場合は、デフォルトの 5秒が使用されます。
.It Fl v
統計情報の追加フィールドを表示します。
.It Fl r
すべての値を、インターバルあたりの値ではなく、秒あたりの値で表示します。
.It Ar unit
.Tn SLIP
インタフェースを指定する 1 桁の数字です。デフォルトは
.Sy 0
で、インタフェース
.Sy sl0
が指定されます。
.El
.Pp
デフォルトでは
.Nm
は以下の情報を表示します:
.Pp
.Bl -tag -width indent
.It in
受信バイト数
.It out
送信バイト数
.It pack
送受信したパケット数
.It comp
送受信した圧縮されたパケット数
.It uncomp
送受信した圧縮されていないパケット数
.It unknwn
未知のタイプの入力パケット数
.It toss
エラーにより返された入力パケット数
.It other
その他の発信/返信 IP パケット数
.It err
入出力エラー数
.It search
コネクションステートのサーチ回数
.It miss
コネクションステートを発見できなかった回数
.It coll
clist での衝突の回数
( 1 日に 1 回か 2 回以上の ) 多数の衝突がある場合には
おそらく clist が不足しています。
param.c の
.Dv nclist
を増やしておく必要があります。
.El
.Sh 使用例
コマンド:
.Dl slstat -i 5
は 5 秒毎にシステムが何をしているかを表示します。
.Sh 関連項目
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr ps 1 ,
.Xr ststat 1 ,
.Xr iostat 8 ,
.Xr pppstats 8 ,
.Xr pstat 8
.Pp
.%T "Installing and Operating 4.3BSD"
の中の
``Interpreting system activity''
から始まる章
