freebsd/freebsd-doc/ja_JP.eucJP/man/man8/spkrtest.8
.\" Copyright (c) May 1995 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/spkrtest/spkrtest.8,v 1.8.2.1 2000/12/27 16:23:29 ru Exp %
.\" jpman %Id: spkrtest.8,v 1.3 1997/08/16 13:43:02 horikawa Stab %
.Dd July 23, 1995
.Dt SPKRTEST 8
.Os FreeBSD
.Sh 名称
.Nm spkrtest
.Nd スピーカドライバ用テストスクリプト
.Sh 解説
.Nm
はスピーカドライバ用の簡単に使えるテストスクリプトです。
.Sh 関連ファイル
.Bl -tag -width /dev/speakerxx
.It Pa /dev/speaker
スピーカデバイスファイル
.El
.Sh 関連項目
.Xr dialog 1 ,
.Xr perl 1 ,
.Xr spkr 4
.Sh 歴史
.Nm
スクリプトは
.Fx 1.0
で登場しました。
