freebsd/freebsd-doc/ja_JP.eucJP/man/man8/spppcontrol.8
.\" Copyright (C) 1997 by Joerg Wunsch, Dresden
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR(S) ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR(S) BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/sbin/spppcontrol/spppcontrol.8,v 1.6.2.4 2002/04/24 18:47:22 joerg Exp %
.\"
.\" $FreeBSD$
.Dd October 11, 1997
.Os
.Dt SPPPCONTROL 8
.Sh 名称
.Nm spppcontrol
.Nd sppp インタフェースのパラメータの表示または設定
.Sh 書式
.Nm
.Op Fl v
.Ar ifname
.Op Ar parameter Ns Op Li = Ns Ar value
.Op Ar ...
.Sh 解説
.Xr sppp 4
ドライバには、
.Xr ifconfig 8
にて調整可能な設定の他に、
多くの追加引数やオプションパラメータが必要となるかもしれません。
これらには、認証プロトコルのパラメータなどと、
他の調整可能なコンフィギュレーション変数があります。
.Nm
ユーティリティは、現在の設定を表示したり、
これらのパラメータを必要に応じて調整するために使用可能です。
.Pp
どのような用途においても、
.Nm
呼び出しにおいては、少なくともパラメータ
.Ar ifname
を指定して、インタフェースの名前を指定する必要があります。
このインタフェースに対して、設定がおこなわれるかまたは設定が表示されます。
.Xr ifconfig 8
または
.Xr netstat 1
を使用して、どのインタフェースが使用可能かを確認してください。
.Pp
他にパラメータを指定しない場合、
.Nm
は、
.Ar ifname
の現在の設定を列挙 (list) して終了します。
報告される設定にはインタフェースの現在の PPP フェーズも含まれ、その名は
.Em dead ,
.Em establish ,
.Em authenticate ,
.Em network ,
.Em terminate
のうちの 1 つです。
認証プロトコルがインタフェースに対して設定されている場合、
使用するプロトコル名と、使用するまたは期待されるシステム名と、
そして認証プロトコルに対して使用可能なオプションがあればそれを表示します。
認証に使用する秘密情報 (
.Em キー
とも呼ばれます) は、この機能が使用するシステムコールによって返されないため、
表示されません。
.Pp
追加のパラメータを指定する場合、スーパユーザの特権が必要になり、コマンドは
.Dq 設定 (set)
モードにて動作します。
オプション
.Fl v
が有効にならない限り、静かに動作します。
.Fl v
を指定すると、他のすべての動作をおこなった後、
最後に上述のように設定を表示します。
インタフェースが現在
.Em dead
フェーズ以外である場合、このモードを使用しようとしてもリジェクトされます。
インタフェースを強制的に
.Em dead
フェーズにするためには、
.Xr ifconfig 8
をパラメータ
.Cm down
付きで呼び出せば良いことに注意してください。
.Pp
現在サポートされているパラメータには次のものがあります:
.Bl -tag -offset indent -width indent
.It Ar authproto Ns Li = Ns Em protoname
相手と自分の両方の認証プロトコルを
.Ar protoname
に設定します。
プロトコル名は
.Dq Li chap ,
.Dq Li pap ,
.Dq Li none
のいずれかです。
最後の場合、
指定したインタフェースにおいて認証プロトコルは使用されなくなります。
この副作用として、
このインタフェースに関する認証関連の他のパラメータもまた消去されます
(つまり、システム名と認証における秘密情報を忘れてしまいます)。
.It Va myauthproto Ns Li = Ns Em protoname
上と同じですが、リンクの自分側にのみ作用します。
すなわち、
相手が認証者であり、かつ、
自分を認証してもらう必要がある場合に使用されるプロトコルです
.It Va hisauthproto Ns Li = Ns Em protoname
上と同じですが、リンクの相手側にのみ作用します。
.It Va myauthname Ns Li = Ns Em name
認証プロトコルにおける自分のシステム名を設定します。
.It Va hisauthname Ns Li = Ns Em name
認証プロトコルにおける相手のシステム名を設定します。
CHAP では、これはヒントとしてのみ使用され、
相手が違う名前を提供した場合には警告メッセージが表示されます。
PAP では、これは相手が相手自身であることを認めさせるときに使用すべき名前です
(相手の秘密情報と関連があります)。
.It Va myauthsecret Ns Li = Ns Em secret
認証フェーズにおいて使用する、自分の秘密情報 (キーとパスワード) を設定します。
CHAP では、これは相手のチャレンジに基づく
返答のハッシュ値を計算するために使用されます。
PAP では、これはシステム名とともにプレインテキストにて送信されます。
秘密情報にシェルのメタ文字 (や空白) を含む場合、
秘密情報をシェルからエスケープすることを忘れないようにしてください。
.It Va myauthkey Ns Li = Ns Em secret
上と同様です。
.It Va hisauthsecret Ns Li = Ns Em secret
上と同様ですが、
自分が認証者であり、かつ相手を認証する必要がある場合に使用されます。
.It Va hisauthkey Ns Li = Ns Em secret
上と同様です。
.It Va callin
相手から呼び出されるときにのみ、相手を認証する必要があり、
自分が呼び出す場合には不要であることを示します。
相手が対称的な認証プロトルを実装していない場合に、必要となります
(例えば Ascend ルータ)。
.It Va always
.Va callin
の逆です。どちらが呼び出す場合でも、
常に相手を認証する必要があることを示します。
これがデフォルトであり、
.Dq list
モードでは明示的に表示されません。
.It Va norechallenge
CHAP でのみ意味があります。
最初に CHAP 交換が成功したならば、相手に再チャレンジしません。
相手の実装が壊れていて、
接続が確立した後の再チャレンジを認識しない場合、対処として使用します。
.It Va rechallenge
CHAP において、接続がネットワークフェーズである間、
ランダムな間隔にて再チャレンジを送信します。
(現在、間隔は 300 からおよそ 800 秒です。)
これがデフォルトであり、
.Dq list
モードでは明示的に表示されません。
.It Ar lcp-timeout Ns \&= Ns Em timeout-value
LCP リスタートタイマの値を変更します。
値はミリ秒単位で指定します。
値は 10 から 20000 ms の間であることが必要です。
デフォルトは 3000 ms です。
.It Ar enable-vj
Van Jacobsen ヘッダ圧縮のネゴシエーションを有効化します
(デフォルトで有効です)。
.It Ar disable-vj
Van Jacobsen ヘッダ圧縮のネゴシエーションを無効化します
.It Ar enable-ipv6
IPv6 ネットワーク制御プロトコルのネゴシエーションを有効化します
(カーネルの IPv6 が有効な場合、デフォルトで有効です)
.It Ar disable-ipv6
IPv6 ネットワーク制御プロトコルのネゴシエーションを無効化します
IPv6 を有効可したカーネルでは、
すべての IPv4 インタフェースが自動的に IPv6 アドレスを割り当てられます。
本オプションにより、
リンクが IPv6 をネゴシエーションすることを運用として禁止できます。
IPv6 インタフェースの初期化には複数のパケットの送出を要しますので、
(ダイヤルオンデマンドのインタフェースでは)
望まないトラフィックコストがかかります。
.El
.Sh 使用例
.Bd -literal
# spppcontrol bppp0
bppp0:	phase=dead
	myauthproto=chap myauthname="uriah"
	hisauthproto=chap hisauthname="ifb-gw" norechallenge
	lcp-timeout=3000
	enable-vj
	enable-ipv6
.Ed
.Pp
.Li bppp0
の設定を表示します。
インタフェースは、現在
.Em dead
フェーズ、つまり LCP 層はダウンしているため、通信できません。
接続の両端は CHAP プロトコルを使用し、
当方のシステム名は
.Dq Li uriah
であるとリモート側に対して告げ、
リモート側は
.Dq Li ifb-gw
という名前で認証されると期待されます。
最初の CHAP 交換が成功すると、更なる CHAP チャレンジは送信されません。
おそらく CHAP に関する双方の秘密情報があるでしょうが、それらは表示されません。
.Bd -literal
# spppcontrol bppp0 \e
	authproto=chap \e
	myauthname=uriah myauthsecret='some secret' \e
	hisauthname=ifb-gw hisauthsecret='another' \e
	norechallenge
.Ed
.Pp
インタフェースを前の例の状態にするために、このように
.Nm
を呼び出したかもしれません。
.Sh 関連項目
.Xr netstat 1 ,
.Xr sppp 4 ,
.Xr ifconfig 8
.Rs
.%A B. Lloyd
.%A W. Simpson
.%T "PPP Authentication Protocols"
.%O RFC 1334
.Re
.Rs
.%A W. Simpson, Editor
.%T "The Point-to-Point Protocol (PPP)"
.%O RFC 1661
.Re
.Rs
.%A W. Simpson
.%T "PPP Challenge Handshake Authentication Protocol (CHAP)"
.%O RFC 1994
.Re
.Sh 歴史
.Nm
ユーティリティは
.Fx 3.0
に登場しました。
.Sh 作者
プログラムの記述を
.An J\(:org Wunsch,
Dresden がおこないました。
