freebsd/freebsd-doc/ja_JP.eucJP/man/man8/spray.8
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/spray/spray.8,v 1.5 1999/08/28 01:20:03 peter Exp %
.\"
.\" Original Revision: 1.3
.\" jpman %Id: spray.8,v 1.3 1997/07/22 16:59:25 horikawa Stab %
.Dd July 10, 1995
.Dt SPRAY 8
.Os FreeBSD
.Sh 名称
.Nm spray
.Nd たくさんのパケットをホストに送る
.Sh 書式
.Nm spray
.Op Fl c Ar count 
.Op Fl d Ar delay 
.Op Fl l Ar length
.Ar host 
.Sh 解説
.Nm spray
は複数の RPC パケットを
.Ar host
に送り、いくつのパケットが正しく受信され、それにはどのくらいの
時間がかかっているのかを記録します。
.Pp
以下のようなオプションがあります。
.Bl -tag -width indent
.It Fl c Ar count
.Ar count
個のパケットを送ります。
.It Fl d Ar delay
パケット送出間隔を
.Ar delay
マイクロ秒にします。
.It Fl l Ar length
RPC 呼び出しメッセージを保持するパケットの長さを
.Ar length
バイトに設定します。
RPC データは XDR を用いて符号化されるため、全ての
.Ar length
値が可能というわけではありません。
.Nm spray
は、もっとも近い可能な値に切り上げます。
.El
.Pp
.Nm spray 
は、ネットワークのテストや計測や管理のための利用を想定しています。
このコマンドは、
.Em "ネットワークにとても負荷をかけますので、利用には注意してください。"
.Ef
.Pp
.Sh 関連項目
.Xr netstat 1 ,
.Xr ifconfig 8 ,
.Xr ping 8 ,
.Xr rpc.sprayd 8
