freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ssh-keysign.8
.\" $OpenBSD: ssh-keysign.8,v 1.2 2002/06/10 16:56:30 stevesk Exp $
.\"
.\" Copyright (c) 2002 Markus Friedl.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Japanese translation: $Id: ssh-keysign.8,v 1.1 2002-08-19 02:24:45 horikawa Exp $
.\" by Yusuke Shinyama <yusuke at cs . nyu . edu>
.\"
.\" $FreeBSD$
.Dd May 24, 2002
.Dt SSH-KEYSIGN 8
.Os
.Sh 名称
.Nm ssh-keysign
.Nd ホストベース認証における ssh の補助プログラム
.Sh 書式
.Nm
.Sh 解説
.Nm
は、
.Xr ssh 1
がローカルホスト鍵にアクセスし、
SSH プロトコル バージョン 2 でホストベース認証をおこなうさいに
必要なデジタル署名を生成するのに使われます。
.Nm
は
.Xr ssh 1
によって呼び出されるもので、ユーザが直接実行するものではありません。
ホストベース認証の詳細については
.Xr ssh 1
および
.Xr sshd 8
を参照してください。
.Sh 関連ファイル
.Bl -tag -width Ds
.It Pa /etc/ssh/ssh_host_dsa_key, /etc/ssh/ssh_host_rsa_key
これらのファイルにはホストの秘密鍵が格納され、
デジタル署名を生成するのに使われます。
これらのファイルは root が所有し、root だけが読み込み可能にすべきであり、
これ以外の誰にも読ませてはいけません。
これらは root だけが読み込み可能なため、
ホストベース認証を使うときは、
.Nm
を setuid root にしておく必要があります。
.El
.Sh 関連項目
.Xr ssh 1 ,
.Xr ssh-keygen 1 ,
.Xr sshd 8
.Sh 作者
Markus Friedl <markus@openbsd.org>
.Sh 歴史
.Nm
は
.Ox 3.2
から導入されました。
.Sh 日本語訳
新山 祐介 (yusuke at cs . nyu . edu) 2002/6/21 (for 3.3p1)
.Pp
当マニュアルページは氏のご好意により
.Fx
日本語マニュアルに収録させていただいています。
翻訳についてのご意見、ご指摘がありましたら新山氏
(yusuke at cs . nyu . edu)、および
.Fx
jpman プロジェクト <man-jp@jp.FreeBSD.org> までお送りください。
