freebsd/freebsd-doc/ja_JP.eucJP/man/man8/sticky.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)sticky.8	8.1 (Berkeley) 6/5/93
.\" jpman %Id: sticky.8,v 1.3 1997/07/19 12:27:09 konuma Stab %
.\"	%Id: sticky.8,v 1.1.1.1.8.1 1997/03/07 04:18:28 mpp Exp %
.\"
.Dd June 5, 1993
.Dt STICKY 8
.Os BSD 4
.Sh 名称
.Nm sticky
.Nd スティッキーテキストと追加専用ディレクトリ
.Sh 解説
特別なファイルモード
.Em sticky bit
(mode S_ISVTX)
は、共有可能な実行ファイルやディレクトリのための
特別な取り扱いを示すために使われます。
ファイルのモードについての説明は、
.Xr chmod 2
や、
.Pa /usr/include/sys/stat.h
ファイルを参照してください。
.Sh 実行ファイルのスティッキーテキスト
スティッキービットが設定されている共有可能な実行ファイルは、
実行が終った後もスワップ領域から直ちには取り除かれません。
カーネルは、ファイルのテキストセグメントを将来の再利用のために蓄えるので、
そのプログラムを再ロードする必要がなくなります。
共有テキストセグメントは普通、利用後は、
頻繁に使われたものを残すキャッシュに置かれます。
したがって、 `スティッキービット' はよく使われるテキストイメージには
ほとんど効果がありません。
.Pp
共有可能な実行ファイルは、
.Fl n
と
.Fl z
オプションをローダ
.Xr ld 1 
で指定することで作成されます。
.Pp
スーパーユーザだけが、共有可能な実行ファイルにスティッキービットを
設定できます。
.Sh スティッキーディレクトリ
`スティッキービット' が設定されたディレクトリは追加専用ディレクトリ、
より正確にいえば、ファイルの削除が制限されたディレクトリになります。
スティッキーディレクトリのファイルの削除や名称変更が可能なのは、
そのディレクトリの書き込み権限を持つそのファイルの所有者か、
そのディレクトリの所有者か、スーパーユーザだけです。
この機能は、
.Pa /tmp
ディレクトリの様に、公共的に書き込み可能であるが、他人の任意のファイルを
消去したり、名称変更したりさせたくない場合には有効です。
.Pp
どんなユーザもスティッキーディレクトリを作成することができます。
ファイルモードの変更についての詳細は、
.Xr chmod 1
を参照してください。
.Sh バグ
スティッキーテキストを持つ実行ファイルのテキスト領域は、
スワップ領域に置かれるので、
この機能の濫用はスワップの不足を引き起こします。
.Pp
.Xr open 2
もしくは
.Xr mkdir 2
のどちらも、スティッキービットが設定されたファイルを作成できません。
.Sh 歴史
.Nm
コマンドは、 Version 32V AT&T UNIX から登場しました。
