freebsd/freebsd-doc/ja_JP.eucJP/man/man8/stlload.8
.\" Copyright (c) 1996 Greg Ungerer (gerg@stallion.oz.au).
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Greg Ungerer.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/stallion/stlload/stlload.8,v 1.5.2.3 2001/08/16 15:56:34 ru Exp %
.\"
.\" $FreeBSD: doc/ja_JP.eucJP/man/man8/stlload.8,v 1.7 2001/05/14 01:09:59 horikawa Exp $
.Dd December 2, 1996
.Os
.Dt STLLOAD 8 i386
.Sh 名称
.Nm stlload
.Nd "Stallion Technologies 製マルチポートシリアルボード用のダウンローダ"
.Sh 書式
.Nm
.Op Fl vhVR
.Op Fl i Ar image-file
.Op Fl c Ar control-device
.Op Fl r Ar rx-buf-size
.Op Fl t Ar tx-buf-size
.Op Fl B Ar boot-banner
.Op Fl b Ar unit-number
.Sh 解説
.Nm
は Stallion Technologies 製の
インテリジェント型マルチポートシリアルボードに
ファームウェアをダウンロードするのに用いられます。
ファームウェアのダウンロードを必要とするのは、
.Nm stli
ドライバを用いるボードだけです。
この中には
EasyConnection 8/64 と ONboard and Brumby ファミリのボードが
含まれます。
.Pp
ボードの型が異なれば、異なるファームウェアのイメージファイルが
必要となります。
正しくないファームウェアがボードにロードされた場合、動作に失敗するでしょう。
.Pp
ダウンロード処理は Stallion
.Nm stli
ドライバ制御用デバイス
.Pa /dev/staliomem?
を通じて行われます。
このデバイスは、ボードのシェアードメモリ領域を読み書きできる
ファイル型のデバイスを実現します。
また、ボードをリセットし、再始動する特殊な
.Em ioctl
群を実装しています。
.Pp
オプションは以下の通りです。
.Bl -tag -width indent
.It Fl v
冗長な出力を生成します。ダウンロードとスタートアップ処理の
各段階において、トレースが生成されます。
.It Fl h
使用法の情報を出力します。
.It Fl V
バージョン情報を出力します。
.It Fl R
ボードのリセットだけを行います。
ファームウェアのボードへのダウンロードを開始しません。
.It Fl i Ar image-file
ダウンロードするイメージファイルを指定します。
デフォルトのファームウェアイメージは、
.Pa /usr/libdata/stallion/cdk.sys
です。
.It Fl c Ar control-device
ファームウェアをダウンロードし、ボードを始動するのに用いる
ボード制御用デバイスを指定します。
デフォルトは
.Pa /dev/staliomem0
です。
.It Fl r Ar rx-buf-size
ボードのシェアードメモリ上の受信データバッファのサイズを指定します。
デフォルトではバッファは、シェアードメモリの使用できる最大量を
用いるように動的に調整されます。
.It Fl t Ar tx-buf-size
ボードのシェアードメモリ上の送信データバッファのサイズを指定します。
デフォルトではバッファは、シェアードメモリの使用できる最大量を
用いるように動的に調整されます。
.It Fl B Ar boot-banner
ダウンロード中のスレーブデバッグトレースフラグをイネーブルにします。
ファームウェアコードからのトレース出力をデバッグすることが、
これによって可能になります。
このトレースが出力されるのはボードのポート 0 で、このポートは
9600 ボー、 8 データビット、パリティ無しの 1 ストップビットに
セットされます。
.It Fl b Ar unit-number
ダウンロードするユニット (ボード) 番号を指定します。デフォルトでは
ボード 0 にダウンロードします。
.El
.Pp
.Nm
は
.Pa /etc/rc.serial
から起動されるのが典型的な用法です。
.Sh 関連ファイル
.Bl -tag -width /usr/libdata/stallion/2681.sys
.It Pa /usr/libdata/stallion/cdk.sys
EasyConnection 8/64 クラスのボード用ファームウェアコード
.It Pa /usr/libdata/stallion/2681.sys
ONboard and Brumby クラスのボード用ファームウェアコード
.It Pa /dev/staliomem?
ドライバボード制御用デバイス
.El
.Sh 関連項目
.Xr stl 4 ,
.Xr stli 4 ,
.Xr stlstats 8
.Sh 歴史
このプログラムのオリジナル版は
.An Greg Ungerer Aq gerg@stallion.com
によって開発されました。
