freebsd/freebsd-doc/ja_JP.eucJP/man/man8/stlstats.8
.\" Copyright (c) 1996 Greg Ungerer (gerg@stallion.oz.au).
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Greg Ungerer.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/stallion/stlstats/stlstats.8,v 1.5.2.1 2000/12/08 15:28:59 ru Exp %
.\"
.Dd December 2, 1996
.Os FreeBSD
.Dt STLSTATS 8 i386
.Sh 名称
.Nm stlstats
.Nd "Stallion Technologies 製マルチポートシリアルボードの統計情報を表示する"
.Sh 書式
.Nm
.Op Fl hVi
.Op Fl c Ar control-device
.Op Fl b Ar board-number
.Op Fl p Ar port-number
.Op Fl d Ar port-device
.Sh 解説
.Nm
は Stallion Technologies 製のマルチポートシリアルボードに接続されている
ポートに関する統計情報を表示するのに用いられます。
.Pp
.Nm
は通常フルスクリーンのメニュー操作型アプリケーションとして動作します。
ヘルプ行が
このスクリーンへの正当な入力文字を示すヘルプ行が各スクリーンの
最下部に表示されます。
.Pp
一般的に、数字キー ('0' から '9') は統計を表示するデバイスの番号を
指定します。
数字だけでは利用可能な全てのデバイスを指定するのに十分でない場合
(例えば、 16 ポートのパネルでは) 残りのデバイスをアクセスするのには
アルファベットの最初の方の文字を用います。'a' から 'f' までの文字が、
デバイス 10 から 15 までをアクセスするのに
用いられます。
.Pp
\&'q' キーは常に 1 レベル前のスクリーンに戻るのに用いられます。
前の画面に戻るのには、エスケープキーを用いることもできます。
.Pp
最初のスクリーンは ボード 0 のパネル 0 にある全ポートの表示画面です。
このスクリーンに表示される値は各ポートの情報の概要です。
表示される統計情報は、ドライバと TTY の状態フラグ、 termio フラグ
(cflag, iflag, oflag, lflag)、 RS-232 シグナル値 (TIOCM シグナル
定義による)、送受信した文字数の総計です。
.Pp
システムにインストールされた各パネルおよびボードについての
要約情報をこのスクリーンで見ることができます。
各ボードは数字キー ('0' から '7') でアクセスでき、各ボード上の
パネルは 'n' キーによって順次アクセスできます。
.Pp
ポートごとのスクリーンは特定のポートについてのいくぶん
詳しい情報を表示します。
このスクリーンは、ボードスクリーンから 'p' キーを押すことによって
移行することができます。
最初に表示されるポートはポート 0 です。
他のポートを表示するには、数字キーと英字キー
('0' から '9' と 'a' から 'f')
を使って下さい。
このスクリーンが表示するのは、ドライバと TTY の状態フラグ、
ハードウェア ID、 termio フラグ (cflag, iflag, oflag, lflag)、
送受信した文字数の総計、現在バッファにある文字、
発生したエラー (オーバーラン、パリティ、フレーミング、ロスト)
の回数、ソフトウェア的なフロー制御文字を送受信した字数、
ハードウェアによるフロー制御を実行した回数、
break を送受信した回数、
モデムの信号状態の変化、現在の RS-232 シグナル状態です。
.Pp
オプションは以下の通りです。
.Bl -tag -width indent
.It Fl h
使用法の情報を出力します。
.It Fl V
バージョン情報を出力します。
.It Fl i
ボードタイプの情報のみを表示します。
この出力は、ボードについて少量の情報を得る必要があるスクリプトや
プログラム (例えば、自動化されたダウンロードスクリプト) に
とって役立ちます。
.Nm
はフルスクリーンのインタラクティブモードに入りません。
.It Fl c Ar control-device
ポートの統計情報を集めるためのボード制御用デバイスを指定します。
デフォルトは
.Pa /dev/staliomem0
です。
.It Fl b Ar board-number
最初に表示するボード番号を指定します。
デフォルトではボード 0 を表示するようになっています。
.It Fl p Ar port-number
最初に表示するポート番号を指定します。
このオプションが指定されている場合、
.Nm
は (ボードの表示を省略して) 即座にポート表示スクリーンを表示します。
.It Fl d Ar port-device
最初に表示するポートのスペシャルデバイスファイル 
.Pf ( Pa /dev/ttyXXX )
を指定します。
ボードスクリーン表示を省略し、ポート統計スクリーンを
スタートアップ時に即座に表示します。
.El
.Sh FILES
.Bl -tag -width /dev/staliomem0
.It Pa /dev/staliomem0
統計情報収集に用いられる、ドライバ制御用のデバイス
.Sh 関連項目
.Xr stl 4 ,
.Xr stli 4 ,
.Xr stlload 8
.Sh 歴史
このプログラムのオリジナル版は
.An Greg Ungerer Aq gerg@stallion.com
によって開発されました。
