freebsd/freebsd-doc/ja_JP.eucJP/man/man8/stlstty.8
.\" Copyright (c) 1996-1998 Greg Ungerer (gerg@stallion.oz.au).
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Greg Ungerer.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/stallion/stlstty/Attic/stlstty.8,v 1.1.2.3 2001/12/21 09:51:30 ru Exp %
.\"
.\" $FreeBSD$
.Dd January 14, 1998
.Os
.Dt STLSTTY 8 i386
.Sh 名称
.Nm stlstty
.Nd "Stallion Technologies 社製マルチポートシリアルポートの拡張されたスイッチ"
.Sh 書式
.Nm
.Op Fl hV
.Op Ar switches
.Sh 解説
.Nm
は、Stallion Technologies 社製のマルチポートシリアルポート上で利用可能な
先進的なドライバスイッチを表示、設定するのに使用します。
.Pp
.Nm
によって設定可能である先進的なスイッチは、
Stallion Technologies 社製の一連のマルチポートシリアルボードのうち、
インテリジェントなボードでのみ利用可能です。
これには EasyConnection 8/64 (ISA と EISA) や ONboard、Brumby ボードが
含まれます。
EasyIO や EasyConnection 8/32、EasyConnection 8/64-PCI ボードでは
利用できません。
.Pp
もし
.Nm
コマンドラインにおいてスイッチの設定が指定されなかった場合は、
標準入力
となっているポートの全てのスイッチの現在の設定を表示します。
.Nm
コマンドラインにおいて 1 つ以上のスイッチが指定された場合は、
それらのスイッチがその指定に応じて設定されます。
.Pp
オプションは以下の通りです:
.Bl -tag -width indent
.It Fl h
使用方法を出力します。
.It Fl V
バージョン情報を出力します。
.El
.Sh スイッチ
全てのスイッチは、
.Nm
へのパラメータとしてスイッチ名を使用することで有効となります。
設定を無効にするには、スイッチ名の前に
.Fl
キャラクタをつけてください。
.Pp
.Nm
によって設定可能な全てのスイッチの設定は、
ポートのオープンやクローズに依らず維持されます。
一度スイッチが設定されれば、
.Nm
によって変更されるか、ボードもしくはシステムがリブートされるまで持続します。
.Pp
以下のスイッチが
.Nm
によって設定できます:
.Bl -tag -width indent
.It Cm maprts Pq Fl maprts
通常 DTR ピンに関連付けられている機能を、代わりに RTS ピンに割り振ります。
言い替えれば、RTS ピンは DTR ピンとして動作します。
これは、コネクタ上に全てのモデムの信号線を持っていないポートがあるボード
(例えば ONboard 16) に有用です。
.It Cm mapcts Pq Fl mapcts
通常 DCD ピンに関連付けられている機能を、代わりに CTS ピンに割り振ります。
言い替えれば、CTS ピンは DCD ピンとして動作します。
これは、コネクタ上に全てのモデムの信号線を持っていないポートがあるボード
(例えば ONboard 16) に有用です。
.It Cm rtslock Pq Fl rtslock
このポートにおいて、RTS ベースのフローコントロールをロックオンします。
通常の
.Xr stty 1
プログラムによって、どんなフローコントロールが設定されようとも、
そのポートには、RTS ベースの (ハードウェア) フローコントロールが
有効となります。
.It Cm ctslock Pq Fl ctslock
このポートにおいて、CTS ベースのフローコントロールをロックオンします。
通常の
.Xr stty 1
プログラムによって、どんなフローコントロールが設定されようとも、
そのポートには、CTS ベースの (ハードウェア) フローコントロールが
有効となります。
.It Cm loopback Pq Fl loopback
ポート UART の内部ループバックモードを有効にします。
このポートに送出される全てのデータは受信され、
このポートによって物理的に送出されることはありません。
.It Cm fakedcd Pq Fl fakedcd
ハードウェアピンの物理的な状態に関わらず、
DCD ピンは常にアサートされていると報告されます。
.It Cm dtrfollow Pq Fl dtrfollow
データがポートから送出される時のみ、DTR 信号がアサートされます。
これは RS-485 用ラインドライバと EasyConnection デュアルインタフェース
モジュールを組み合わせて使っている時に有用です。
.It Cm rximin Pq Fl rximin
スレーブプロセッサにおける、受信キャラクタを
.Dq 束ねる
アルゴリズムを
無効 (もしくは有効) にします。
デフォルトでは、スレーブプロセッサは受信データを束ねることで、
大きな固まりにしてホストへ送ることができます。
これは、アプリケーションから見える個々のキャラクタについて、
所要時間が増加することになります。
これは、遅延に敏感なアプリケーションやプロトコルにとって、
望まれない動作かもしれません。
受信キャラクタの遅延を減少させるには、
.Cm rximin
スイッチをオンにすべきです。
.It Cm rxitime Pq Fl rxitime
スレーブプロセッサの受信キャラクタのタイマを
無効 (もしくは有効) にします。
このタイマーは、スレーブプロセッサにおける、
データを
.Dq 束ねる
アルゴリズムの一部です。
このスイッチをオンにすることでタイマが最小になり、
受信データはホストに即座に送られるようになります。
.It Cm rxthold Pq Fl rxthold
このポートの UART 受信 FIFO を無効にします。
デフォルトでは、UART 受信 FIFO は、CPU のオーバヘッドを最小にするために
十分ハイレベルにプログラムされています。
いくつかのサードパーティのシリアルデバイスは、
フローコントロールの信号 (ハードウェアまたはソフトウェア) に
素早く返答せず、これによって UART の受信 FIFO がオーバランし、
データが消失するかもしれません。
このスイッチをオンにすることで、受信 FIFO の使用を無効にします。
.El
.Sh 関連項目
.Xr stl 4 ,
.Xr stli 4 ,
.Xr stlstats 8
.Sh 歴史
このプログラムは
.An Greg Ungerer Pq gerg@stallion.com
によって
最初に開発されました。
