freebsd/freebsd-doc/ja_JP.eucJP/man/man8/svr4.8
.\"
.\" Copyright (c) 2000, Alexey Zelkin
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer,
.\"    without modification, immediately at the beginning of the file.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.\" %FreeBSD: src/sys/modules/svr4/svr4.8,v 1.1.2.3 2001/12/21 10:07:20 ru Exp %
.\" $FreeBSD$
.\"
.Dd January 10, 2000
.Dt SVR4 8
.Os
.Sh 名称
.Nm svr4
.Nd SystemV エミュレータモジュールを読み込む
.Sh 書式
.Nm
.Sh 解説
.Nm
ユーティリティは SystemV エミュレータモジュールを読み込みます。
.Sh 関連ファイル
.Bl -tag -width /modules/svr4.ko
.It Pa /modules/svr4.ko
SystemV エミュレータローダブルカーネルモジュール。
.El
.Sh 関連項目
.Xr kld 4 ,
.Xr kldload 8 ,
.Xr kldstat 8 ,
.Xr kldunload 8
