freebsd/freebsd-doc/ja_JP.eucJP/man/man8/swapon.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)swapon.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/swapon/swapon.8,v 1.15.2.1 2000/12/08 14:04:20 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt SWAPON 8
.Os BSD 4
.Sh 名称
.Nm swapon
.Nd ページングやスワッピングに使用する追加デバイスを指定する
.Sh 書式
.Nm
.Fl a
.Nm
.Ar special_file ...
.Sh 解説
.Nm
は、ページングやスワッピングを行うための追加デバイス指定にて使用します。
システムは、ただ一つのデバイス上にページングやスワッピングして立ち上がるので、
起動時にはただ一つのディスクを要求します。
通常
.Nm
は、システムのマルチユーザモードの初期化ファイル 
.Pa /etc/rc
から起動され、全てのスワップデバイスを有効にし、
ページングとスワッピング動作を複数デバイスにインタリーブします。
.Pp
通常は、最初の書式を使用します:
.Bl -tag -width indent
.It Fl a
.Pa /etc/fstab
で、``noauto'' オプションが設定されていない、
``sw'' と指定されているすべてのスワップデバイスを使用可能にします。
.El
.Pp
二番目の書式は、システムスワップコンフィギュレーションテーブルに与えるように、
個々のブロックデバイスを指定します。
これにより、システムは指定されたデバイスのみをスワップ空間として利用します。
.Pp
.Sh 関連項目
.Xr swapon 2 ,
.Xr fstab 5 ,
.Xr init 8 ,
.Xr pstat 8 ,
.Xr rc 8 ,
.Xr vnconfig 8
.Sh 関連ファイル
.Bl -tag -width "/dev/{wd,da}?s?b" -compact
.It Pa /dev/{wd,da}?s?b
標準のページングデバイス
.It Pa /dev/vn0b
vnode ディスクページングデバイス
.It Pa /etc/fstab
ASCII 形式のファイルシステム記述テーブル
.It Pa /etc/vntab
ASCII 形式の vnode ファイルテーブル
.El
.Sh バグ
デバイスへのページングとスワッピングを停止する方法はありません。
ですから、
システム動作中にマウントされたデバイスのマウントを解除することは不可能です。
.Sh 歴史
.Nm
コマンドは
.Bx 4.0
から登場しました。
