freebsd/freebsd-doc/ja_JP.eucJP/man/man8/swapon.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)swapon.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/swapon/swapon.8,v 1.26 2003/02/28 00:55:18 keramida Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt SWAPON 8
.Os
.Sh 名称
.Nm swapon , swapoff , swapctl
.Nd ページングやスワッピングに使用するデバイスの指定
.Sh 書式
.Nm swapon Ar
.Nm swapon Fl a
.Nm swapoff Ar
.Nm swapoff Fl a
.Nm swapctl
.Op Fl AhklsU
.Oo
.Fl a Ar
|
.Fl d Ar
.Oc
.Sh 解説
.Nm swapon , swapoff , swapctl
ユーティリティはシステムのスワップデバイスを制御するために使用されます。
ブート時、マルチユーザモードにシステムが移行するときに、
.Pa /etc/fstab
の全スワップエントリが自動的に追加されます。
スワップデバイスは固定値のインタリーブを使用します。
最大のデバイス数は、カーネル設定オプション
.Dv NSWAPDEV
で設定され、典型的には 4 です。
優先度機構はありません。
.Pp
.Nm swapon
ユーティリティは、指定されたスワップデバイスをシステムに追加します。
.Fl a
オプションが使用されたときには、
.Dq noauto
オプションが設定されていない、
すべてのスワップデバイスが追加されます。
.Pp
.Nm swapoff
ユーティリティは、指定されたスワップデバイスをシステムから削除します。
.Fl a
オプションが使用されたときには、
.Dq noauto
オプションが設定されていない、
すべてのスワップデバイスが削除されます。
システム実行のために VM (メモリ + 残りのスワップデバイス) が不十分だと、
スワップデバイスの削除に
.Nm swapoff
ユーティリティは失敗して拒否します。
.Nm swapoff
ユーティリティは、
削除対象のデバイスにスワップアウトされたページを移動しますので、
一定帰還システム負荷が上昇し得ます。
これは、当該デバイスにどれだけのデータがスワップされていたかに依存します。
.Pp
.Nm swapctl
ユーティリティは、他の
.Bx
に親しんだ方々のためのものであり、
スワップの追加・削除・列挙に使用可能です。
.Nm swapctl
では
.Fl a
の用途は異なっており、
指定したデバイスリストを追加すべきことを意味することに注意してください。
.Fl d
オプションは、指定したデバイスリストを削除すべきことを意味します。
.Nm swapctl
に対する
.Fl A
および
.Fl U
のオプションは、
.Pa /etc/fstab
中の
.Dq noauto
オプションが設定されていないすべてのスワップデバイスに作用します。
.Pp
スワップ情報は、
.Xr swapinfo 8
プログラム、
.Nm pstat
.Fl s
または
.Nm swapctl
.Fl l
で生成可能です。
.Nm swapctl
ユーティリティは、スワップの列挙用に以下のオプションを取ります:
.Bl -tag -width indent
.It Fl h
値をメガバイト単位で出力します。
.It Fl k
値をキロバイト単位で出力します。
.It Fl l
システムスワップの印があるデバイスを列挙します。
.It Fl s
システムスワップのサマリ行を表示します。
.Pp
特にオーバライドしなければ、
.Dv BLOCKSIZE
環境変数が使用されます。
デフォルトで、512 バイトブロックが使用されます。
.Sh 診断
これらのユーティリティは、
.Xr swapon 2
に記述された理由で失敗することがあります。
.El
.Sh 関連項目
.Xr swapon 2 ,
.Xr fstab 5 ,
.Xr init 8 ,
.Xr mdconfig 8 ,
.Xr pstat 8 ,
.Xr rc 8
.Sh 関連ファイル
.Bl -tag -width ".Pa /dev/{ad,da}?s?b" -compact
.It Pa /dev/{ad,da}?s?b
標準のページングデバイス
.It Pa /dev/md?
メモリディスクデバイス
.It Pa /etc/fstab
.Tn ASCII
形式のファイルシステム記述テーブル
.El
.Sh 歴史
.Nm swapon
ユーティリティは
.Bx 4.0
から登場しました。
.Nm swapoff , swapctl
ユーティリティは
.Fx 5.1
から登場しました。
