freebsd/freebsd-doc/ja_JP.eucJP/man/man8/swapon.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)swapon.8	8.1 (Berkeley) 6/5/93
.\" %FreeBSD: src/sbin/swapon/swapon.8,v 1.22 2002/12/28 23:39:47 dillon Exp %
.\"
.\" $FreeBSD$
.\"
.Dd June 5, 1993
.Dt SWAPON 8
.Os
.Sh 名称
.Nm swapon , swapoff
.Nd ページングやスワッピングに使用するデバイスの指定
.Sh 書式
.Nm swap[on|off]
.Fl a
.Nm swap[on|off]
.Ar special_file ...
.Nm swapctl
.Fl lshk
.Nm swapctl
.Fl AU
.Nm swapctl
.Fl a
.Ar special_file ...
.Nm swapctl
.Fl d
.Ar special_file ...
.Sh 解説
.Nm swap[on,off,ctl]
ユーティリティはシステムのスワップデバイスを制御するために使用されます。
ブート時、マルチユーザモードにシステムが移行するときに、
.Pa /etc/fstab
の全スワップエントリが自動的に追加されます。
スワップデバイスはインタリーブされます。
またカーネルは、典型的には最大 4 スワップデバイスを扱えるように
設定されています。
優先度機構はありません。
.Pp
.Nm swapon
ユーティリティは、指定されたスワップデバイスをシステムに追加します。
.Fl a
オプションが使用されたときには、
``noauto'' オプションが設定されていない、
すべてのスワップデバイスが追加されます。
.Pp
.Nm swapoff
ユーティリティは、指定されたスワップデバイスをシステムから削除します。
.Fl a
オプションが使用されたときには、
``noauto'' オプションが設定されていない、
すべてのスワップデバイスが削除されます。
システム実行のために VM (メモリ + 残りのスワップデバイス) が不十分だと、
スワップデバイスの削除に
.Nm swapoff
は失敗して拒否します。
.Nm swapoff
は、削除対象のデバイスにスワップアウトされたページを移動しますので、
一定帰還システム負荷が上昇し得ます。
これは、当該デバイスにどれだけのデータがスワップされていたかに依存します。
.Pp
.Nm swapctl
ユーティリティは、他の BSD に親しんだ方々のためのものであり、
スワップの追加・削除・列挙に使用可能です。
.Nm swapctl
では
.Fl a
の用途は異なっており、
指定したデバイスリストを追加すべきことを意味することに注意してください。
.Fl d
オプションは、指定したデバイスリストを削除すべきことを意味します。
.Nm swapctl
に対する
.Fl A
および
.Fl D
のオプションは、
``noauto'' オプションが設定されていないすべてのスワップデバイスに作用します
.Pp
スワップ情報は、
.Nm swapinfo
プログラム、
.Nm pstat
.Fl s
または
.Nm swapctl
.Fl lshk
で生成可能です。
.Nm swapctl
ユーティリティは、スワップの列挙用に以下のオプションを取ります:
.Bl -tag -width indent
.It Fl l
システムスワップの印があるデバイスを列挙します。
.It Fl s
システムスワップのサマリ行を表示します。
.It Fl h
値をメガバイト単位で出力します。
.It Fl k
値をキロバイト単位で出力します。
.Pp
特にオーバライドしなければ、BLOCKSIZE 環境変数が使用されます。
デフォルトで、512 バイトブロックが使用されます。
.El
.Sh 関連項目
.Xr swapon 2 ,
.Xr fstab 5 ,
.Xr init 8 ,
.Xr mdconfig 8 ,
.Xr pstat 8 ,
.Xr rc 8
.Sh 関連ファイル
.Bl -tag -width "/dev/{ad,da}?s?b" -compact
.It Pa /dev/{ad,da}?s?b
標準のページングデバイス
.It Pa /dev/md?
メモリディスクデバイス
.It Pa /etc/fstab
ASCII 形式のファイルシステム記述テーブル
.El
.Sh 歴史
.Nm swapon
ユーティリティは
.Bx 4.0
から登場しました。
.Nm swapoff
ユーティリティは
.Fx 5.0
から登場しました。
