freebsd/freebsd-doc/ja_JP.eucJP/man/man8/sync.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)sync.8	8.1 (Berkeley) 5/31/93
.\" %FreeBSD: src/bin/sync/sync.8,v 1.14 2002/07/06 19:13:21 charnier Exp %
.\"
.\" $FreeBSD$
.Dd May 31, 1993
.Dt SYNC 8
.Os
.Sh 名称
.Nm sync
.Nd 未実行のディスク書き込みを強制実行する ( キャッシュのフラッシュ )
.Sh 書式
.Nm
.Sh 解説
.Xr reboot 8
または
.Xr halt 8
を使わずにプロセッサを停止する場合、全てのディスク書き込みが
適切に完了することを保証するため、停止に先だって
.Nm
ユーティリティを呼ぶことができます。
一般的には、システムをシャットダウンするには
.Xr reboot 8
もしくは
.Xr halt 8
を使うことが好ましいでしょう。
なぜならこれらのプログラムは、最終的な
.Nm
を実行する前に、内蔵時計の再同期や内部キャッシュの
フラッシュなどの追加動作を実行する場合があるからです。
.Pp
.Nm
ユーティリティは、
.Xr sync 2
ファンクションコールを利用します。
.Sh 関連項目
.Xr fsync 2 ,
.Xr sync 2 ,
.Xr syncer 4 ,
.Xr halt 8 ,
.Xr reboot 8
.Sh 歴史
.Nm
ユーティリティは
.At v4
から実装されました。
