freebsd/freebsd-doc/ja_JP.eucJP/man/man8/sysinstall.8
.\" Copyright (c) 1997
.\"	Jordan Hubbard <jkh@FreeBSD.org>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Jordan Hubbard AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Jordan Hubbard OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/sysinstall/sysinstall.8,v 1.59 2004/02/07 00:34:11 olgeni Exp %
.\"
.\" $FreeBSD$
.\"
.Dd August 9, 1997
.Dt SYSINSTALL 8
.Os
.Sh 名称
.Nm sysinstall
.Nd システムのインストール及び設定のためのツール
.Sh 書式
.Nm
.Op Ar var=value
.Op Ar function
.Op Ar ...
.Sh 解説
.Nm
ユーティリティは、
.Fx
システムのインストールと設定のためのユーティリティです。
これは
.Fx
インストーラのブートフロッピが最初に起動するプログラムであり、
新規に
.Fx
システムがインストールされた時には
.Pa /usr/sbin/sysinstall
に、後のシステム設定で使用するためにコピーされます。
.Pp
この
.Nm
ユーティリティは、引数なしで起動された場合には既定のモードで動作します。
このモードでは、インストール及び設定のためのメニューが存在します。
.Pp
しかし sysinstall のサブシステムを直接起動する必要がある場合には、
コマンドラインからそれを指定することもできます。インストールスクリプトを
実行することとコマンドラインからの指定はまったく同じことなので、
スクリプトの作成に関するセクションに目を通しておくと良いでしょう。
.Sh 注
.Nm
ユーティリティは、
.Xr libdisk 3
の機能を用いて MBR やディスクラベルを書くことと、新規および既存の
.Fx
システムに、配布ファイルや package
(訳注: FreeBSD の package system におけるパッケージを指す場合にこう表記します)
をインストールすることができるモノリシックな C プログラムに過ぎません。
また、このプログラムは
.Fx
インストールのための起動処理の中で実行されたときのために、
.Xr init 8
の代用として動作するための機能も併せ持っています。
これは自分以外のユーティリティのサポートがほとんどないと仮定し、
ファイルシステム操作のほとんどを、(たとえば
.Xr mount 2
のような) ユーティリティに相当するシステムコールを
直接呼び出すことによって行ないます。
.Pp
.Nm
ユーティリティは現在のところ、
システムコンソールや、カラー表示をサポートした端末
エミュレータで起動した場合に単純な ANSI ライングラフィックスや色を
使った操作を実現するために
.Xr dialog 3
を使用しています (xterm の新しいバージョンでは、temcap の
.Dq xterm-color
エントリを使用することでカラー表示をサポートします)。
.Pp
このプログラムはそろそろライフサイクルの終わりに来ており、新しい
ものによって置き換えられるかもしれません。
.Sh スクリプトの実行
.Nm
ユーティリティは、
そのさまざまなメニューを通じ対話的に操作することもできますし、外部の
スクリプトによってバッチモードで動作させることもできます。このような
スクリプトを読み込んで実行する方法には以下の 3 通りがあります:
.Bl -tag -width Ds
.It Sy "LOAD_CONFIG_FILE"
もし
.Nm
が、環境変数 (または Makefile 中に) LOAD_CONFIG_FILE に何らかの値が
セットされた状態でコンパイルされていれば、
.Nm
が非対話的なモードで起動された際に自動的に探して読み込むファイル名として
その値が用いられます。このオプションは、大きなサイトにおいて、
ほぼ同じ設定とインストールオプションで、ひとつの雛型に基づき
多数のマシンにインストールしたい場合のためのものです。
.It Sy "メインメニュー"
.Nm
が対話的に起動された場合、すなわち既定の方法で起動された場合、オプション
"load config file" を含むメインメニューを表示します。このオプションを
選択すると、スクリプトファイル名を尋ねるプロンプトが出され、続いてその
ファイルを DOS または UFS 形式のフロッピディスクから読み込みます。
.It Sy "コマンド行"
.Nm
がマルチユーザモードで動作している場合はコマンドライン引数のそれぞれが
スクリプトの指示であるとして扱われます。実行終了のリクエスト (たとえば
.Ar shutdown
指示など)、引数列の終わり、エラー発生のいずれかにより実行は終了します。
.Pp
たとえば、
.Bd -literal
/usr/sbin/sysinstall _ftpPath=ftp://ziggy/pub/ mediaSetFTP configPackages
.Ed
.Pp
は、
.Nm
を、インストールメディア FTP (サーバは `ziggy') で初期化し、続いて
package インストールエディタを起動し、それが終わると終了します。
.El
.Sh スクリプトの文法
スクリプトはひとつ以上の指示のリストです。それぞれの指示は以下の形をとります。
.Pp
.Ar var=value
.Pp
.Ar function
.Pp
.Ar #somecomment
.Pp
.Ar var=value
は、たとえば "ftpPass=FuNkYChiKn" のような、
.Nm
の内部変数の設定です。また、
.Ar function
は、"mediaSetFTP" のような
.Nm
の内部関数の名称であり、
.Ar #comment
はドキュメンテーションのために挿入する一行のコメントです
(sysinstall はこれを無視します)。
それぞれの指示は一行にひとつずつ書かれなければなりません。
関数は、既知の変数名を調べることで、その引数を得ます。
したがって、ある変数を必要とする関数を呼び出す前には、
関連する変数を予め設定しておく必要があります。
.Pp
各ディレクティブの前に
.Ar noError
変数を設定しておくことが可能です。
これにより、ディレクティブ自身は無視されるような場合においても、
エラーを検知可能とします。
.Ar noError
の値は、ディレクティブが処理されるたび自動的に、
デフォルトの "未設定" に戻ります。
.Pp
いつどの関数が、どの変数に依存するかを、
下の表に示します。
.Pp
.Sy "関数一覧" :
.Pp
.\"===kuma===========================================
.Bl -tag -width indent
.It configAnonFTP
匿名 FTP の設定メニューを起動します。
.Pp
.Sy 変数:
無し
.It configRouter
使用したいルーティングデーモンを選択します。必要ならサードパーティの
ものを使用することもできます。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It router
これには、たとえば
.Dq routed
や
.Dq gated
のように、希望するルーティングデーモンの名前を設定します。
設定されていなければ入力を求められます。
.El
.It configNFSServer
ホストを NFS サーバとして設定します。
.Pp
.Sy 変数:
なし
.It configNTP
ホストをネットワークタイムプロトコルのユーザとして設定します。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It ntpdate_flags
これには、
.Xr ntpdate 8
のオプションを設定します。同期をとるために使用するサーバの名前は
ここに設定してください。
.El
.It configPCNFSD
ホストを PC NFS をサポートするように設定します。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It pcnfsd_pkg
必要ならば PCNFSD の package 名を設定します (既定値としてハードコード
されたものが使用されます)。
.El
.It configPackages
対話的な package 管理画面を起動します。
.Pp
.Sy 変数:
なし
.It configUsers
システムにユーザやグループを追加します。
.Pp
.Sy 変数:
なし
.It configXSetup
X ウィンドウシステムの設定を行います。
.Pp
.Sy 変数:
なし
.It configXDesktop
X デスクトップの設定を行います。
.Pp
.Sy 変数:
なし
.It diskPartitionEditor
ディスクパーティション (MBR) エディタを起動します。
.Pp
.Sy 変数:
.Bl -tag -width findx
.It geometry
シリンダ数/ヘッド数/セクタ数の形式で書かれたディスクジオメトリを
設定します。
既定値: ジオメトリを変更しません。
.It partition
ディスクパーティションのタイプやサイズを設定します。この値が
.Ar free
であれば、
.Fx
のために使用可能な空き領域のみを使用します。
.Ar all
であれば、ディスク全体を
.Fx
に割り当てますが、正しいパーティションテーブルを作成します。
.Ar existing
であれば、既存の
.Fx
パーティションのうち、最初に見つかったものを使用します。
.Ar exclusive
であれば、ディスクを、
.Dq 危険な方法で専用化された
モードで使用します。
最後に、
.Ar somenumber
であれば、空き領域のうちの
.Ar somenumber
ブロックを新規の
.Fx
パーティションのために使用します。
既定値: 対話モードで起動します。
.It bootManager
は、次のどれかから選択する必要があります。
.Ar boot
は、ブートマネージャのインストールを指示します。
.Ar standard
は、ブートマネージャでない「標準の」DOS MBRのインストールを指示します。
.Ar none
は、ブートマネージャに対して何の操作も行わないことを指示します。
既定値: none です。
.It diskInteractive
設定すると、対話的なディスクパーティションエディタを起動します。
.El
.Pp
注意: この関数では実際のディスクへの書き込みは行われません。実際に
書き込みを行うためには、
.Ar diskPartitionWrite
操作を行う必要があります。
.It diskPartitionWrite
は、MBR に対する、待ち状態にあるすべての変更を行います (一般には
.Ar diskPartitionEditor
によって呼び出されます)。
.Pp
.Sy 変数:
無し
.It diskLabelEditor
ディスクラベルエディタを起動します。
スクリプトから動かすのはちょっと手品のようになります。
というのも、
.Ar diskPartitionEditor
関数で作成された各
.Fx
(タイプ 0xA5) パーティション中のすべてに対してラベルする必要が
本質的にあるためであり、
これはどのようにレイアウトされるかについての少数のルールを知る
必要があるためです。
スクリプトを作成して、
自動的にディスク空間の割り当てとパーティションを行う場合、
少なくとも一度はまず対話的にインストールを実行し、
スライス名がどうなるかを見てから、
これをスクリプトに埋め込むことをお勧めします。
.Pp
例えば、SCSI ディスクがあり、そのスライス 2 に
.Fx
を作成したとします (DOS パーティションはスライス 1 にあるとします)。
.Fx
全体のスライス名は
.Ar da0s2
になります (DOS プライマリパーティションは
.Ar da0s1
となります)。
更に、このパーティションに 500MB あり、
この空間をルートとスワップと var と usr のファイルシステムに
更に分割すると仮定します。
.Ar diskLabelEditor
関数呼び出しには、次の変数設定が伴うでしょう:
.Bl -tag -width findx
.It Li "da0s2-1=ufs 40960 /"
20MB ルートファイルシステム (すべての大きさは 512 バイトブロック数)。
.It Li "da0s2-2=swap 131072 /"
64MB スワップパーティション。
.It Li "da0s2-3=ufs 204800 /var"
100MB /var ファイルシステム。
.It Li "da0s2-4=ufs 0 /usr 1"
空き空間の残り (約 316MB) が /usr ファイルシステムで
ソフトアップデートを有効にします
(マウントポイント後の非 0 引数は、ソフトアップデートフラグ設定を意味します)。
.El
.Pp
新規パーティションを作成するのと同様に、
既存のパーティションのマウントや消去に、
.Ar diskLabelEditor
を使用可能です。
前の例の、DOS パーティションをマウントし、これに対応する
.Pa /etc/fstab
エントリを、新規インストールにおいて作成したいとします。
.Ar diskLabelEditor
関数の呼び出し前に、次の追加行を単に足せば良いです:
.Pp
.Dl "da0s1=/dos_c N"
.Pp
これは、最初のスライスを
.Pa /dos_c
にマウントしてこれを newfs しないよう、ラベルエディタに指示します (
.Nm
は DOS パーティションに対しては如何なる場合でも newfs を実行しません。
既存の UFS パーティションに対しても、ここに名前を書くことで実行できます。
2 番目のフィールドは省略不可です)。
.\" なんだかよくわかりません horikawa 2001/03/25
.\" 原文は
.\" not that sysinstall would attempt this for a DOS partition in
.\" any case, but it could just as easily be an existing UFS partition
.\" being named here and the 2nd field is non-optional
.Pp
.Ar diskInteractive
変数を設定することにより、
前述のように変数を使用した明示的なレイアウトを行う代りに、
ディスクラベルエディタが対話的なダイアログを使用してディスクを分割するよう、
要求できます。
.Pp
注:
.Ar diskLabelCommit
が呼び出される前は、
ファイルシステムデータは実際にディスクに書き込まれません。
.It diskLabelCommit
設定した、待ち状態であるディスクラベル情報をすべて書き込み、
.Ar diskLabelEditor
でマウントを設定したすべてのファイルシステムをマウントします。
.Pp
.Sy 変数:
なし
.It distReset
選択した配布ファイルのセットをリセットして、何も選択していない状態にします。
.Pp
.Sy 変数:
なし
.It distSetCustom
配布ファイルセットの選択を、予め用意されたセットからの選択でなく、
非対話モードでも「カスタム」で行うようにします。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It dists
読み込む配布ファイルのセットのリストを設定します。
値として使用できるのは以下の通りです。
.Bl -tag -width indentxx
.It Li base
基本バイナリファイルのセット
.It Li doc
様々な文書
.It Li games
ゲーム
.It Li manpages
フォーマット前のマニュアルページ
.It Li catpages
フォーマット済のマニュアルページ
.It Li proflibs
開発者のためのプロファイルされたライブラリ
.It Li dict
スペルチェックなどのツールのための辞書情報
.It Li info
GNU info ファイルとその他の追加文書
.It Li crypto
暗号化のためのバイナリとライブラリ
.It Li compat1x
.Fx
1.x との互換性
.It Li compat20
.Fx 2.0
との互換性
.It Li compat21
.Fx 2.1
との互換性
.It Li compat22
.Fx 2.2
及び
.Fx 3.0
の a.out バイナリ互換性
.It Li compat3x
.Fx
3.x
との互換性
(
.Fx 4.0
でのみ利用可能)
.It Li compat4x
.Fx
4.x
との互換性
.Fx ( 5.0
システムでのみ利用可能)
.It Li ports
ports コレクション
.It Li ssecure
/usr/src/secure
.It Li sbase
/usr/src/(トップレベルファイル)
.It Li scontrib
/usr/src/contrib
.It Li sgnu
/usr/src/gnu
.It Li setc
/usr/src/etc
.It Li sgames
/usr/src/games
.It Li sinclude
/usr/src/include
.It Li skrb5
/usr/src/kerberos5
.It Li slib
/usr/src/lib
.It Li slibexec
/usr/src/libexec
.It Li srelease
/usr/src/release
.It Li sbin
/usr/src/bin
.It Li ssbin
/usr/src/sbin
.It Li sshare
/usr/src/share
.It Li ssys
/usr/src/sys
.It Li subin
/usr/src/usr.bin
.It Li susbin
/usr/src/usr.sbin
.It Li ssmailcf
/usr/src/usr.sbin/sendmail/cf
.It Li XF86-xc
XFree86 の公式なソース
.It Li XF86-co
XFree86 に寄贈されたソース
.It Li Xbin
XFree86 バイナリ
.It Li Xcfg
XFree86 設定ファイル
.It Li Xdoc
XFree86 に関する文書
.It Li Xhtml
XFree86 に関する HTML 文書
.It Li Xlib
XFree86 ライブラリ
.It Li Xlk98
XFree86 PC98 向けサーバリンクキット
.It Li Xlkit
XFree86 一般向けサーバリンクキット
.It Li Xman
XFree86 マニュアルページ
.It Li Xprog
XFree86 開発者向け配布物
.It Li Xps
XFree86 に関する postscript 文書
.It Li Xset
XFree86 グラフィカルセットアップツール
.It Li PC98-Servers/X9480
XFree86 PC98 8-bit (256 色) PEGC-480 サーバ
.It Li PC98-Servers/X9EGC
XFree86 PC98 4-bit (16 色) EGC サーバ
.It Li PC98-Servers/X9GA9
XFree86 PC98 GA-968V4/PCI (S3 968) サーバ
.It Li PC98-Servers/X9GAN
XFree86 PC98 GANB-WAP (cirrus) サーバ
.It Li PC98-Servers/X9LPW
XFree86 PC98 PowerWindowLB (S3) サーバ
.It Li PC98-Servers/X9MGA
[記述無し]
.It Li PC98-Servers/X9NKV
XFree86 PC98 NKV-NEC (cirrus) サーバ
.It Li PC98-Servers/X9NS3
XFree86 PC98 NEC (S3) サーバ
.It Li PC98-Servers/X9SPW
XFree86 PC98 SKB-PowerWindow (S3) サーバ
.It Li PC98-Servers/X9SVG
[記述無し]
.It Li PC98-Servers/X9SVG
XFree86 PC98 Cyber9320, TGUI9680 サーバ
.It Li PC98-Servers/X9WEP
XFree86 PC98 WAB-EP (cirrus) サーバ
.It Li PC98-Servers/X9WS
XFree86 PC98 WABS (cirrus) サーバ
.It Li PC98-Servers/X9WSN
XFree86 PC98 WSN-A2F (cirrus) サーバ
.It Li Servers/X3DL
XFree86 3D Labs サーバ
.It Li Servers/X8514
XFree86 8514 サーバ
.It Li Servers/XAGX
XFree86 8 ビット AGX サーバ
.It Li Servers/XI128
XFree86 #9 Imagine I128 サーバ
.It Li Servers/XMa8
XFree86 ATI Mach8 サーバ
.It Li Servers/XMa32
XFree86 ATI Mach32 サーバ
.It Li Servers/XMa64
XFree86 ATI Mach64 サーバ
.It Li Servers/XMono
XFree86 monochrome サーバ
.It Li Servers/XP9K
XFree86 P9000 サーバ
.It Li Servers/XS3
XFree86 S3 サーバ
.It Li Servers/XS3V
XFree86 S3 Virge サーバ
.It Li Servers/XSVGA
XFree86 SVGA サーバ
.It Li Servers/XVG16
XFree86 VGA16 サーバ
.It Li Servers/XW32
XFree86 ET4000/W32, /W32i, /W32p サーバ
.It Li Servers/XTGA
TGA カード用サーバ (alpha アーキテクチャのみ)
.It Li Servers/Xnest
XFree86 ネスト X サーバ。
.It Li Servers/Xvfb
XFree86 仮想フレームバッファ X サーバ。
.It Li Xfnts
XFree86 基本フォントセット。
.It Li Xf100
XFree86 100DPI フォントセット。
.It Li Xfcyr
XFree86 キリル語フォントセット。
.It Li Xfscl
XFree86 スケーラブルフォントセット。
.It Li Xfnon
XFree86 非英語フォントセット。
.It Li Xfsrv
XFree86 フォントサーバ。
.El
.El
.It distSetDeveloper
標準開発者配布セットを選択します。
.Pp
.Sy 変数:
無し
.It distSetXDeveloper
標準 X 開発者配布セットを選択します。
.Pp
.Sy 変数:
無し
.It distSetKernDeveloper
標準カーネル開発者配布セットを選択します。
.Pp
.Sy 変数:
無し
.It distSetUser
標準ユーザ配布セットを選択します。
.Pp
.Sy 変数:
無し
.It distSetXUser
標準 X ユーザ配布セットを選択します。
.Pp
.Sy 変数:
無し
.It distSetMinimum
最小配布セットを選択します。
.Pp
.Sy 変数:
無し
.It distSetEverything
全部、つまり利用可能な配布すべてを選択します。
.Pp
.Sy 変数:
無し
.It distSetCRYPTO
暗号化のパーツ群を、対話的に選択します。
.Pp
.Sy 変数:
無し
.It distSetSrc
ソースのパーツ群を、対話的に選択します。
.Pp
.Sy 変数:
無し
.It distSetXF86
XFree86 のパーツ群を、対話的に選択します。
.Pp
.Sy 変数:
無し
.It distExtractAll
現在選択されている配布すべてをインストールします
(メディアデバイスが既に選択されていることが必要です)。
.Pp
.Sy 変数:
無し
.It docBrowser
(必要であれば) HTML 文書ブラウザをインストールし、
HTML 文書サブメニューに行きます。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It browserPackage
必要に応じてインストールを試みる、ブラウザの package 名です。
デフォルトは最新の links package です。
.It browserBinary
ブラウザバイナリ自身の名前です (
.Ar browserPackage
変数に優先させる場合)。デフォルトは links です。
.El
.It installCommit
ディスクに対する待ち状態の変更を、すべて実施します。
この関数は、本質的に、細粒度の "実施" 関数をまとめたものです。
.Pp
.Sy 変数:
無し
.It installExpress
「高速」インストールを開始します。
ユーザへの質問は少数です。
.Pp
.Sy 変数:
無し
.It installStandard
「標準」インストールを開始します。
利用可能なインストールタイプ中で、最もユーザフレンドリです。
.Pp
.Sy 変数:
無し
.It installUpgrade
アップグレードインストールを開始します。
.Pp
.Sy 変数:
無し
.It installFixitHoloShell
init として起動している場合、
「緊急ホログラフィックシェル」を VTY4 で起動します。
.Ar noHoloShell
を設定しない限りにおいては、
これはインストール処理の一部として自動的に実施されます。
.Pp
.Sy 変数:
無し
.It installFixitCDROM
"fixit" モードに入ります。
ライブファイルシステム CDROM がドライブにあるものと仮定します。
.Pp
.Sy 変数:
無し
.It installFixitFloppy
"fixit" モードに入ります。
fixit フロッピディスクが利用可能と仮定します (ユーザは問い合わせを受けます)。
.Pp
.Sy 変数:
無し
.It installFilesystems
インストールのファイルシステム初期化部分のみを実行します。
.Pp
.Sy 変数:
無し
.It installVarDefaults
全変数をデフォルトに初期化し、以前の設定を上書きします。
.Pp
.Sy 変数:
無し
.It loadConfig
#include 文のようなものであり、他の設定ファイルをロードできます。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It configFile
ロードするファイルの完全な形でのパス名です。
.El
.It mediaClose
メディアデバイスが開いている場合、閉じます。
.Pp
.Sy 変数 :
無し
.It mediaSetCDROM
インストールメディアとして
.Fx
CDROM を選択します。
.Pp
.Sy 変数:
無し
.It mediaSetFloppy
インストールメディアとして
作成済フロッピインストールセットを選択します。
.Pp
.Sy 変数:
無し
.It mediaSetDOS
インストールメディアとして
既存の DOS プライマリパーティションを選択します。
最初に見付かるプライマリパーティション (例 C:) を使用します。
.Pp
.Sy 変数:
無し
.It mediaSetTape
インストールメディアとしてテープデバイスを使用します。
.Pp
.Sy 変数:
無し
.It mediaSetFTP
インストールメディアとして FTP サイトを使用します。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It hostname
インストールされるホストの名前 (省略不可)。
.It domainname
インストールされるホストのドメイン名 (省略不可)。
.It defaultrouter
このホストのデフォルトルータ (省略不可)。
.It netDev
どのホストインタフェースを使用するか (例えば
.Ar ed0
や
.Ar ep0
です。省略不可)。
.It netInteractive
設定すると、関連するすべての設定変数を陶に設定していても、
対話的なネットワーク設定フォームを起動します (省略可)。
.It ipaddr
選択したホストインタフェースの IP アドレス (省略不可)。
.It netmask
選択したホストインタフェースのネットマスク (省略不可)。
.It _ftpPath
対象となる
.Fx
配布を保持する FTP サイトの完全な形での URL。例えば
.Ar ftp://ftp.FreeBSD.org/pub/FreeBSD/
。
.El
.It mediaSetFTPActive
.Ar mediaSetFTP
と同様ですが、「能動的」な FTP 転送モードを使用します。
.Pp
.Sy 変数:
.Ar mediaSetFTP
と同様です。
.It mediaSetFTPPassive
.Ar mediaSetFTP
と同様ですが、「受動的」な FTP 転送モードを使用します。
.Pp
.Sy 変数:
.Ar mediaSetFTP
と同様です。
.It mediaSetHTTP
.Ar mediaSetFTP
と同様ですが、HTTP プロキシを使用します。
.Pp
.Sy 変数:
.Ar mediaSetFTP
を参照してください。更に以下も使用します。
.Bl -tag -width indent
.It _httpPath
使用するプロキシ (host:port) (省略不可)。
.El
.It mediaSetUFS
インストールメディアとして、
(ラベルエディタでマウントされている) 既存の UFS パーティション
を選択します。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It ufs
対象となる
.Fx
配布を保持する、完全な /path 指定。
.El
.It mediaSetNFS
.Pp
.Sy 変数:
.Bl -tag -width indent
.It hostname
インストールされるホストの名前 (省略不可)。
.It domainname
インストールされるホストのドメイン名 (省略不可)。
.It defaultrouter
このホストのデフォルト経路 (省略不可)。
.It netDev
どのホストインタフェースを使用するか (例えば
.Ar ed0
や
.Ar ep0
です。省略不可)。
.It netInteractive
設定すると、関連するすべての設定変数を陶に設定していても、
対話的なネットワーク設定フォームを起動します (省略可)。
.It ipaddr
選択したホストインタフェースの IP アドレス (省略不可)。
.It netmask
選択したホストインタフェースのネットマスク (省略不可)。
.It nfs
対象となる
.Fx
配布を保持する、完全な hostname:/path 指定。
.El
.It mediaSetFTPUserPass
.Pp
.Sy 変数:
.Bl -tag -width indent
.It ftpUser
FTP サーバに接続する場合のユーザ名を設定します。
既定値: ftp
.It ftpPass
FTP サーバに接続する場合のパスワードを設定します。
既定値: user@host
.El
.It mediaSetCPIOVerbosity
.Pp
.Sy 変数:
.Bl -tag -width indent
.It cpioVerbose
cpio で展開を行う際のメッセージの冗長度を low, medium, high から選択します。
.El
.It mediaGetType
対話的にユーザにメディアタイプの指定を求めます。
.Pp
.Sy 変数:
無し
.It optionsEditor
オプション編集画面を起動します。
.Pp
.Sy 変数:
なし
.It packageAdd
package を取得してインストールしようと試みます (メディアが設定されている
必要があります)。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It package
bash-1.14.7 や ncftp-2.4.2 のようにインストールする package の名前
を指定します。
.El
.It addGroup
対話的なグループエディタを起動します。
.Pp
.Sy 変数:
なし
.It addUser
対話的なユーザエディタを起動します。
.Pp
.Sy 変数:
なし
.It shutdown
スクリプトの実行を停止して sysinstall を終了します。
.Pp
.Sy 変数:
なし
.It system
.Xr system 3
を用いて外部コマンドを実行します。
.Pp
.Sy 変数:
.Bl -tag -width indent
.It command
実行するコマンドの名前。ブートフロッピから起動されている場合は、
システム全体がインストールされている場合と比較して使用できるものが
大幅に限定されていることに注意してください。
.El
.It tcpMenuSelect
ネットワークデバイスを設定します。
.Pp
.Sy 変数 :
.Ar mediaSetFTP
と同様ですが、
.Ar _ftpPath
が使用されないことが違います。
.El
.Sh 配布メディア
次のファイルを使用して、初期システムインストール時の
.Nm
の動作を変更可能です。
.Bl -tag -width ".Pa packages/INDEX"
.It Pa cdrom.inf
プロパティを 1 行に 1 個ずつ記述するテキストファイルであり、
使用するメディアの内容を記述します。
各行の文法は、単に
.Dq Ar property No = Ar value
というものです。
現在のところ、次のプロバティだけが認識されます。
.Bl -tag -width ".Va CD_MACHINE_ARCH"
.It Va CD_VERSION
このプロパティは、このメディアボリュームの
.Fx
バージョンに設定すべきです。
例えば
.Dq Li "CD_VERSION = 4.6"
です。
.It Va CD_MACHINE_ARCH
このプロバティは、このボリューム上の内容のアーキテクチャに設定すべきです。
このプロバティは、通常、複数のアーキテクチャを含む
.Fx
製品でのみ使用され、
ユーザが Alpha package を i386 マシンにインストールしようとしたときに
より良いエラーメッセージを提供するようになります。
例えば
.Dq Li "CD_MACHINE_ARCH = alpha"
です。
.It Va VOLUME
マルチボリュームコレクション (例えば
.Fx
4-CD セット) では、各ディスクの
.Pa ports/INDEX
ファイルは、セットの完全な package インデックスを含むべきです。
.Pa INDEX
ファイルの最後のフィールドは、
どのボリュームにその package が含まれるのかを示し、この
.Va VOLUME
プロパティは現在のディスクのボリューム ID を定義します。
.El
.It Pa packages/INDEX
package インデックスファイルです。
各 package が、必要な依存関係等の追加メタデータと共に各行に列挙されます。
このインデックスは
.Xr ports 7
コレクションで
.Dq Li "make index"
を実行することにより生成されます。
複数ボリュームサポートが有効な場合、
どの package がどのメディアボリュームに含まれるのかを示す
追加フィールドが各行に追加されます。
.El
.Pp
.Fx
の完全なリリースの構築方法については、
.Xr release 7
を参照してください。
.Sh 関連ファイル
このユーティリティは
.Pa /etc/rc.conf ,
.Pa /etc/hosts ,
.Pa /etc/resolv.conf
の内容を、ネットワーク等の設定変更に応じて変更します。
.Sh 関連項目
十分に完全なソースツリーがオンライン上にあれば、
サンプルのインストールスクリプトについて
.Pa /usr/src/usr.sbin/sysinstall/install.cfg
を参照してください。
.Sh バグ
本ユーティリティは雛型であり、
期限切後も数年を生き延びており、大いに死すべきです。
.Sh 作者
.An Jordan K. Hubbard Aq jkh@FreeBSD.org
.Sh 歴史
このバージョンの
.Nm
は、
.Fx 2.0
から登場しました。
