freebsd/freebsd-doc/ja_JP.eucJP/man/man8/syslogd.8
.\" Copyright (c) 1983, 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)syslogd.8	8.1 (Berkeley) 6/6/93
.\"	%Id: syslogd.8,v 1.6.2.4 1997/09/19 22:27:26 brian Exp %
.\" jpman %Id: syslogd.8,v 1.3 1997/05/19 17:08:30 horikawa Stab %
.\"
.Dd October 12, 1995
.Dt SYSLOGD 8
.Os BSD 4.2
.Sh 名称
.Nm syslogd
.Nd システムメッセージの記録をとる
.Sh 書式
.Nm syslogd
.Op Fl ds
.Op Fl a Ar allowed_peer
.Op Fl f Ar config_file
.Op Fl m Ar mark_interval
.Op Fl p Ar log_socket
.Sh 解説
.Nm syslogd
はコンフィグレーションファイルに指定された通りに、システムコンソール、
ログファイル、他のマシンやユーザへのメッセージを読み込み、記録します。
オプションには以下のものがあります。
.Bl -tag -width Ds
.It Fl a Ar allowed_peer
.Ar allowed_peer
がこの
.Nm syslogd
に UDP データグラムを使用してログすることを許します。複数の
.Fl a
オプションを指定可能です。
.Pp
.Ar allowed_peer
は以下のいずれかです:
.Bl -tag -width "ipaddr/masklen[:service]XX"
.It Ar ipaddr/masklen Ns Op Ar :service
.Ar ipaddr
(通常のドット表記の 4 つ組)
からのデータグラムを受け付けます。
アドレス比較の際、
.Ar masklen
ビットを考慮します。
.Ar service
が指定された場合、パケット送出元が属すべき
UDP service の名前もしくは番号となります(
.Xr services 5
参照)。
.Ar service
に
.Ql \&*
を指定すると、全ての UDP ポートから送信されたパケットを受け付けます。
デフォルトの
.Ar service
は
.Ql syslog
です。
.Ar masklen
を指定しないと、
.Ar ipaddr
がクラス A もしくは B のアドレス範囲に属す場合にはそれぞれ
歴史的なクラス A もしくは B のネットマスクが使用され、
そうでない場合には 24 が使用されます。
.It Ar domainname Ns Op Ar :service
送信アドレスのアドレス逆引きにおいて
.Ar domainname
が得られたデータグラムを受け付けます。
.Ar service
の意味は前述の通りです。
.It Ar *domainname Ns Op Ar :service
上述の通りですが、送信ホスト名が
.Ar domainname
で
.Em 終る
全てのホストから受け付けます。
.El
.It Fl d
.Nm syslogd
をデバッグモードで実行します。これは恐らく、
.Nm syslogd
の開発者にのみ役立ちます。
.It Fl f
代りのコンフィグレーションファイルのパス名を指定します。
デフォルトは
.Pa /etc/syslog.conf
です。
.It Fl m
``mark''されたメッセージの間隔を分単位で指定します。
デフォルトは20分です。
.It Fl p
代りのログ用ソケットのパス名を指定します。
デフォルトは
.Pa /var/run/log
です。
.It Fl s
セキュアモードで操作します。リモートマシンからのログメッセージを受ける
ために listen しません。
.El
.Pp
.Nm syslogd
は起動時とhangupシグナルを受けとった時はいつでもコンフィグレーションファ
イルを読み込みます。
コンフィグレーションファイルのフォーマットに関する情報は、
.Xr syslog.conf 5
参照して下さい。
.Pp
.Nm syslogd
は
.Tn UNIX
ドメインソケット
.Pa /var/run/log、
.Pa /etc/services
で指定されるインタネットドメインソケット
およびスペシャルデバイス
.Pa /dev/klog
(カーネルメッセージを読むため）からメッセージを読み込みます。
.Pp
.Nm syslogd
はファイル
.Pa /var/run/syslog.pid
を作成し、プロセスIDを記録します。
これは
.Nm syslogd
のkillやコンフィグレーションファイルを読み込ませるために使えます。
.Pp
.Nm syslogd
に送られるメッセージは単一の行で構成されます。このメッセージは先頭に優
先順位コードを含んでいます。このコードは
.Sq Aq 5
のように括弧でくくられた十進数から構成されており、インクルードファイル
.Aq Pa sys/syslog.h
で定義されている優先順位に対応します。
.Sh 関連ファイル
.Bl -tag -width /var/run/syslog.pid -compact
.It Pa /etc/syslog.conf
コンフィグレーションファイル
.It Pa /var/run/syslog.pid
動作している
.Nm syslogd
のプロセスID
.It Pa /var/run/log
.Tn UNIX
ドメインデータグラムのログ用ソケットの名前
.It Pa /dev/klog
カーネルログ用のデバイス
.El
.Sh 関連項目
.Xr logger 1 ,
.Xr syslog 3 ,
.Xr services 5 ,
.Xr syslog.conf 5
.Sh 歴史
.Nm syslogd
コマンドは
.Bx 4.3
から登場しました。
.Pp
.Fl s
および
.Fl a
オプションは
.Fx 2.2
における拡張です。
.Sh バグ
UDPパケットで受けとったメッセージを記録する能力は認証されていないディ
スクを溢れさせるリモートサービスと等価であり、恐らくデフォルトで無効に
されるべきです。ある種の
.Nm syslogd
間の認証メカニズムが用意されるべきでしょう。
最悪の無駄遣いを避けるために、
.Fl a
オプションの使用を強く勧めます。
.Pp
.Fl a
のマッチングアルゴリズムは非常に効率的には見えません;
ドメイン名比較より、数値による IP アドレスを使用する方が高速です。
許可されたピアのリストの検索は線型に行なわれるため、
多くのメッセージを受け付けると予測されるピアグループは
.Fl a
リストの最初の方に置くべきです。
.Pp
ログ用ソケットは読み込み専用のルートファイルシステムの扱いを容易にする
ために
.Pa /dev
から移されました。このことは古いバイナリを混乱させるかもしれないので、
過渡期の間はシンボリックリンクが役に立つでしょう。
