freebsd/freebsd-doc/ja_JP.eucJP/man/man8/talkd.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)talkd.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/libexec/talkd/talkd.8,v 1.3 1999/08/28 23:08:18 mpp Exp %
.\" jpman %Id: talkd.8,v 1.2 1997/05/20 01:39:12 mutoh Stab %
.\"
.Dd December 11, 1993
.Dt TALKD 8
.Os BSD 4.3
.Sh 名称
.Nm talkd
.Nd 
.Xr talk 1
のためのデーモン
.\".Nd remote user communication server
.\"(訳中)上記原文とは異なった訳ですが、分かりやすいのでこのまま採用します。
.\" 2.2.1R 対象(1997/05/17) Takeshi MUTOH <mutoh@info.nara-k.ac.jp>
.Sh 書式
.Nm talkd
.Sh 解説
.Nm talkd
は、他のユーザの会話要求を、ユーザに通知するサーバです。
会話をしたい複数のクライアントからの
要求に応答する、いわば招待状の貯蔵庫として機能します。
通常の操作では、呼び出し元のクライアントは、サーバに
メッセージタイプが
.Dv LOOK_UP
.Pf ( Aq Pa protocols/talkd.h
参照) である
.Dv CTL_MSG
構造体のメッセージを送って、
接続の初期化を行います。すると、サーバはすでに呼び出し
が行われているかどうか内部テーブルを検索します (相手はメッセージ
のなかで指定されています)。
.Pp
検索に失敗すると、クライアントは
.Dv ANNOUNCE
メッセージを送り、サーバに呼び出す相手のログイン端末に通知を
ブロードキャストさせて接続要求を行います。
.Pp
相手が応答すると、ローカル
のサーバは内部テーブルの記録を用いて適切なアドレスで
接続を行い、呼び出し側と呼び出された側との間にストリーム型
の接続を確立して、そこで会話が行えるようにします。
.Sh 関連項目
.Xr talk 1 ,
.Xr write 1
.Sh 歴史
.Nm
コマンドは
.Bx 4.3
から登場しました。
