freebsd/freebsd-doc/ja_JP.eucJP/man/man8/tftpd.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)tftpd.8	8.1 (Berkeley) 6/4/93
.\" jpman %Id: tftpd.8,v 1.3 1997/07/22 17:00:36 horikawa Stab %
.\"
.Dd June 4, 1993
.Dt TFTPD 8
.Os BSD 4.2
.Sh 名称
.Nm tftpd
.Nd
インターネット TFTP (Trivial File Transfer Protocol) サーバ
.Sh 書式
.Nm /usr/libexec/tftpd
.Op Fl l
.Op Fl n
.Op Fl s Ar directory
.Op Ar directory ...
.Sh 解説
.Nm
は、インターネット TFTP プロトコル (
.Tn RFC 783
) を提供するサーバです。
.Tn TFTP
サーバは、 
.Ql tftp
サービス定義で指示されたポートを操作します。
.Xr services 5 
を参照してください。
このサーバは普通
.Xr inetd 8 
によって起動されます。
.Pp
.Xr tftp 1
の利用には、リモートシステムのアカウントやパスワードを必要としません。
認証情報がありませんので、
.Nm
はパブリックに読み込み可能なファイルだけしかアクセスを許可しません。
文字列 ``/\|\fB.\|.\fP\|/'' を含んだファイル、もしくは
``\|\fB.\|.\fP\|/'' から始まるファイルのアクセスは許可されません。
ファイルは、既に存在してパブリックに書き込み可能な場合だけ
書き込まれます。
.Dq パブリック (public)
という概念は、ネットワークを通して到達可能な全てのホストの全てのユーザ
を含むように拡張されている点に注意してください。
これは全てのシステムにおいて適当ではないかも知れないし、
そのことは tftp サービスを有効にする前に考慮すべきです。
サーバは、もっとも可能な限り小さな権限を持ったユーザ ID を
持たねばなりません。
.Pp
ファイルへのアクセス制限は、
.Nm
起動時のディレクトリリストを、
.Pa /etc/inetd.conf 
にサーバプログラムへの引数として 20 までのパス名を指定することにより可能です。
この場合、アクセスは、ファイル名がそこで与えられたディレクトリを
頭に付けたものに制限されます。
与えられたディレクトリは、相対ファイル指定要求に対しての探索パスと
しても利用されます。
.Pp
chroot オプションは、
.Nm
のアクセスを chroot されたファイルシステム
だけに制限することで、セキュリティを追加します。
これは、ブートサーバとして
.Fl s
を提供している OS から実行する時に便利です。
chroot の実行は root に制限されていますので、
.Nm
は root で
実行しなければなりません。しかしながら、 chroot した場合、
.Nm
はユーザ id を nobody に設定します。
.Pp
以下のようなオプションがあります。
.Bl -tag -width Ds
.It Fl l
全ての要求を、
.Xr syslog 3 
のファシリティ LOG_FTP を使って、ログ保存します。
注: syslog 設定ファイル
.Xr syslog.conf 5
においても、LOG_FTP メッセージのログ機能を有効とする必要があります。
.It Fl n
存在しない相対ファイル名に対する要求の否定応答を抑止します。
.It Fl s Ar directory
コマンドを受け取る前に
.Nm
を
.Pa directory
へ chroot させます。更に、ユーザ id を nobody にします。
.Pp
.Fl s
を使用しない場合、ユーザ id の変更は試みられません。
.Fl s
を使用しない場合は、
.Nm
を root で実行してはなりません。
.El
.Sh 関連項目
.Xr tftp 1 ,
.Xr inetd 8 ,
.Xr syslogd 8
.Sh 歴史
.Nm
コマンドは、
.Bx 4.2 
から導入されました。
