freebsd/freebsd-doc/ja_JP.eucJP/man/man8/timed.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)timed.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/timed/timed/timed.8,v 1.7.2.2 2000/12/08 15:29:00 ru Exp %
.\"
.\" jpman %Id: timed.8,v 1.2 1997/05/17 16:08:46 horikawa Stab %
.\"
.Dd June 6, 1993
.Dt TIMED 8
.Os BSD 4.3
.Sh 名称
.Nm timed
.Nd タイムサーバデーモン
.Sh 書式
.Nm
.Op Fl dtM
.Op Fl i Ar network
.Op Fl n Ar network
.Op Fl F Ar host1 host2 ...
.Sh 解説
.Nm
デーモンは、タイムサーバデーモンであり、通常はブート時に
.Xr rc.network 8
ファイル内の記述に従って起動されます。本コマンドにより、ホストと、
.Nm
を実行しているローカルネットワーク上のマシンとの時刻の同期を取ります。
これらのタイムサーバは、
マシン時刻の刻みを遅らせたり進ませたりすることで、それらのマシンの時計を
ネットワーク平均時間に補正します。
.Tn ICMP
タイムスタンプリクエストメッセージを用いることで、
マシン間の時刻差分を計測し、ネットワーク平均時間を計算します。
.Pp
次のオプションを使用可能です:
.Bl -tag -width indent
.It Fl d
デバッグモードを有効にします。
端末から切り離さないようにします。
.It Fl i Ar network
無視すべきネットワークリストに
.Ar network
を追加します。
他の、直接マシンに接続されているネットワークを
.Nm
は使用します。
複数のネットワークをリストに追加するために、本オプションを複数回指定可能です。
.It Fl F Ar host ...
信頼するホストのリストを作成します。
.Nm
は信頼するホストのみをマスタとして受け付けます。
信頼していないホストがマスタであると主張していると、
.Nm
はそのホストからの入力メッセージを抑制し、新規に選択を行います。
本オプションは、暗黙的に
.Fl M
オプションを指定します。
本オプションを指定しないと、
ネットワークに接続されている全ホストを信頼しません。
.It Fl M
必要ならば、ホストが
.Nm
マスタになることを許します。
.It Fl n Ar network
.Ar network
を許可されたネットワークのリストに追加します。
他の
他の、直接マシンに接続されているネットワークを
.Nm
は無視します。
複数のネットワークをリストに追加するために、本オプションを複数回指定可能です。
.It Fl t
受信メッセージのトレーシングを有効にし、ファイル
.It Pa /var/log/timed.log
へログします。
.Xr timedc 8
ユーティリティにより、
.Nm
実行中に、トレーシングのオンとオフを切り替え可能です。
.El
.Pp
.Fl n 
と
.Fl i
は排他であり、ホストが実際に接続されているネットワークを引数として要求します (
.Xr networks 5
を参照してください)。
どちらのフラグも指定しないと、全ネットワークに対して待機します。
.Pp
.Fl M 
と
.Fl F 
のどちらのフラグも指定せずに実行中の
.Nm
は、スレーブのままです。
.Fl F 
フラグを指定しないと、
.Nm
は全マシンを信頼できないものとします。
.Pp
.Nm
によって提供されるサービスは、マスタ−スレーブ構造に基づいて構成されています。
.Nm
がマシン上で動作し始めると、
.Nm
は、マスタサーバにネットワーク時刻を問い合わせ、自マシンの時刻を設定します。
この後、マスタサーバから送られる同期メッセージを定期的に受け取り、
マシン時間の補正が必要な場合には
.Xr adjtime 2
を呼び出します。
.Pp
本コマンドは、時刻を大域的に設定するために
.Xr date 1
と通信し、timed 制御プログラムである
.Xr timedc 8
と通信します。
マスタを実行しているマシンに到達不可能になると、
スレーブは、少なくとも
.Fl M
と
.Fl F
のフラグのどちらかを持つスレーブの中から新規にマスタを選択します。
.Pp
通常、起動時に
.Nm
は、接続されている各ネットワーク上のマスタタイムサーバをチェックします。
ただし、上述の
.Fl n
と
.Fl i
のオプションを指定された場合は別です。
本プログラムは、最初に見付けたサーバに同期サービスを要求します。
.Fl M
または
.Fl F
のフラグにより許される場合、
接続されているネットワーク上で、
信頼できるマスタサーバを検出できなかったのもに対し、
同期サービスを提供します。
その場合、サーバはトップレベルマスタによって計算された時刻を取得し、
他のマシンに通知します。
.Nm
は、スレーブとして動作中のネットワークに対し、
定期的にマスタの存在をチェックします。
そのネットワークに信頼できるマスタが存在しなくなった場合、
そのネットワーク上で選択処理を開始します。
.Pp
マシン群の同期をとるための 1つの方法として、
.Tn NTP
デーモンを用いてあるマシン
の時刻を遠距離の標準時刻や電波受信機の時刻に同期させ、かつ、信頼できる
マシンは自分自身だけであることを timed デーモンに
.Fl F Ar hostname
によって通知する、といったものがあります。
.Pp
カーネルによるシステムコンソールへのメッセージ出力は、
割り込み禁止にて行われます。
このことは、メッセージが出力されている
間はシステム時計が停止していることを示します。
ディスクやネットワークハードウェアに多くの問題を抱え、
その結果としてメッセージが出力するマシンは、正確な時刻を保持出来ません。
それぞれのメッセージは、多くは出力されるごとに 10ms 程度の時刻遅延
を引き起こします。タイムデーモンはこの結果を補正します。
.Pp
マシンが返答しないというシステムログメッセージは、通常、
当該マシンがクラッシュまたは動作停止したことを示します。
マシンの初期時刻設定時の返答失敗に関する不平は、大概の場合、
“マルチホーム” のマシンが複数のネットワークでタイムマスタを探した後、
別のネットワークにおいてスレーブになることを選択したことを示します。
.Sh 警告
もし
.Nm
や
.Tn NTP
のような 2 つ以上の時刻デーモンが同じ時計を更新しようとした場合に、
一時的に時刻がおかしくなる可能性があります。
.Nm
と他のタイムデーモンが同じマシン上で走行している場合には、
.Fl F
オプションを使用していることを確認して下さい。これは、
.Nm
がローカルマシンの時計を更新しないようにするためです。
.Pp
なお、このデーモンが使用するネットワークプロトコルは、
.Tn UDP/IP
ブロードキャストに基づいています。
ブロードキャスト範囲内で
.Tn TSP
プロトコルを用いるすべてのマシンは
協調しあわなければなりません。
ブロードキャストパケットが届くマシン間では、
.Fl F
フラグを使用する管理ドメインを 2 つ以上持つことはできません。
このルールに従わないと、通常、"信用できない" マシンに関する不平が
システムログに書かれます。
.Sh 関連ファイル
.Bl -tag -width /var/log/timed.masterlog -compact
.It Pa /var/log/timed.log
timed のトレースファイル
.It Pa /var/log/timed.masterlog
マスタ timed 用のトレースファイル
.El
.Sh 関連項目
.Xr date 1 ,
.Xr adjtime 2 ,
.Xr gettimeofday 2 ,
.Xr icmp 4 ,
.Xr networks 5 ,
.Xr timedc 8
.Rs
.%T "TSP: The Time Synchronization Protocol for UNIX 4.3BSD"
.%A R. Gusella
.%A S. Zatti
.Re
.Sh 歴史
.Nm
デーモンは
.Bx 4.3
から登場しました。
