freebsd/freebsd-doc/ja_JP.eucJP/man/man8/timedc.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)timedc.8	8.1 (Berkeley) 6/6/93
.\" %FreeBSD: src/usr.sbin/timed/timedc/timedc.8,v 1.6.2.3 2001/04/26 01:33:07 dd Exp %
.\"
.\" jpman %Id: timedc.8,v 1.3 1997/07/26 22:14:11 horikawa Stab %
.\"
.Dd June 6, 1993
.Dt TIMEDC 8
.Os BSD 4.3
.Sh 名称
.Nm timedc
.Nd timed の動作を制御する
.Sh 書式
.Nm
.Op Ar command Op Ar argument ...
.Sh 解説
.Nm
は、
.Xr timed 8
を制御するために使用します。具体的には、以下に示す機能を有します。
.Bl -bullet
.It
複数のマシン間の時刻の差の計測
.It 
マスタタイムサーバの所在の検索
.It
.Xr timed 8
が受信したメッセージのトレースの有効/無効の切り替え
.It
様々なデバッグ動作
.El
.Pp
.Nm
を引数なしで起動した場合、
.Nm
はプロンプトを表示し、標準入力からの
コマンド入力待ちの状態になります。起動時に引数を指定した場合、
.Nm
は、最初の引数をコマンドとして、残りの引数をそのコマンドのパラメータとして
解釈します。
また
.Nm
は、標準入力の代わりにリダイレクションを使用してファイルからコマンドを
読み込むこともできます。
コマンドは短縮可能です; 使用可能なコマンドは以下の通りです:
.Bl -tag -width Ds -compact
.It Ic \&? Op Ar command ...
.Pp
.It Ic help Op Ar command ...
引数リストに指定されたコマンドについての簡単な説明を表示します。
引数を指定しない場合は、
使用可能なコマンドの一覧を表示します。
.Pp
.It Ic clockdiff Ar host ...
.Nm
を実行したマシンの時刻と、引数で指定したマシンの時刻
の比較を行ない、その結果を表示します。
.Pp
.It Ic msite Op Ar host ...
.Ar host
で指定したホストのマスタタイムサーバを表示します。
.It Xo
.Ic trace
.Li \&{ Ar on Li \&|
.Ar off \&}
.Xc
.Xr timed 8
へのメッセージの
.Pa /var/log/timed.log
への記録の有効/無効を指定します。
.It Ic election Ar host1 Op Ar host2 ...
.Ar host
で指定したホスト上の timed デーモンに対し、"election" タイマをリセットし、
新たにマスタタイムサーバが選択されていることを確実にするよう要求します。
.Pp
.It Ic quit
timedc を終了します。
.El
.Pp
上記以外のコマンドも、
.Xr timed 8
のテストやデバッグのために実装してあります。
それらのコマンドについては、
.Nm
の help コマンドを用いたり、本コマンドのソースを参照するなどして調べて下さい。
.Sh 関連ファイル
.Bl -tag -width /var/log/timed.masterlog -compact
.It Pa /var/log/timed.log
timed 用のトレースファイル。
.It Pa /var/log/timed.masterlog
マスタ timed 用のログファイル。
.El
.Sh 関連項目
.Xr date 1 ,
.Xr adjtime 2 ,
.Xr icmp 4 ,
.Xr timed 8
.Rs
.%T "TSP: The Time Synchronization Protocol for UNIX 4.3BSD"
.%A R. Gusella
.%A S. Zatti
.Re
.Sh 診断
.Bl -diag
.It ?Ambiguous command
省略入力に該当するコマンドが複数存在します。
.It ?Invalid command
該当するコマンドが見つかりません。
.It ?Privileged command
本コマンドは、root 権限でのみ実行できます。
.El
.Sh 歴史
.Nm
コマンドは
.Bx 4.3
から登場しました。
