freebsd/freebsd-doc/ja_JP.eucJP/man/man8/traceroute6.8
.\"	$KAME: traceroute6.8,v 1.9 2002/08/30 03:56:20 onoe Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%FreeBSD: src/usr.sbin/traceroute6/traceroute6.8,v 1.10 2003/11/12 18:56:59 ume Exp %
.\"
.\" $FreeBSD$
.\"
.Dd May 17, 1998
.Dt TRACEROUTE6 8
.Os
.Sh 名称
.Nm traceroute6
.Nd IPv6 パケットが終点までにたどる経路を表示する
.\"
.Sh 書式
.Nm
.Bk -words
.Op Fl dIlnrv
.Ek
.Bk -words
.Op Fl f Ar firsthop
.Ek
.Bk -words
.Op Fl g Ar gateway
.Ek
.Bk -words
.Op Fl m Ar hoplimit
.Ek
.Bk -words
.Op Fl p Ar port
.Ek
.Bk -words
.Op Fl q Ar probes
.Ek
.Bk -words
.Op Fl s Ar src
.Ek
.Bk -words
.Op Fl w Ar waittime
.Ek
.Bk -words
.Ar target
.Op Ar datalen
.Ek
.\"
.Sh 解説
.Bl -tag -width Ds
.It Fl d
デバッグモードです。
.It Fl f Ar firsthop
トレースにおいて、何ホップをスキップするかを指定します。
.It Fl g Ar gateway
中間ゲートウェイ (
.Nm
はルーティングヘッダを使用)
を指定します。
.It Fl m Ar hoplimit
ホップ制限の最大を設定します。
.It Fl I
UDP データグラムの代りに ICMP6 ECHO を使用します。
.It Fl l
ホストのホスト名と数値アドレスの両方を表示します。
通常
.Nm
コマンドは
.Fl n
が指定されていない場合はホスト名のみを、
.Fl n
が指定されている場合は数値アドレスのみを表示します。
.It Fl m Ar hoplimit
最大ホップ数を指定します。
.It Fl n
数値アドレスからホスト名への解決を行いません。
.It Fl p Ar port
UDP ポート番号を
.Ar port
に設定します。
.It Fl q Ar probes
ホップ数あたりのプローブ回数を
.Ar probes
に設定します。
.It Fl r
.It Fl s Ar src
.Ar src
を始点 IPv6 アドレスとして用います。
.It Fl v
冗長になります。
.It Fl w Ar waittime
プローブ間の遅延時間を設定します。
.El
.\"
.Sh 戻り値
.Nm
ユーティリティは、成功時に 0 を、エラー時に 0 以外を返します。
.\"
.Sh 関連項目
.Xr ping 8 ,
.Xr ping6 8 ,
.Xr traceroute 8
.\"
.Sh 歴史
.Nm
ユーティリティは WIDE Hydrangea IPv6 プロトコルスタックキットで
はじめて登場しました。
