freebsd/freebsd-doc/ja_JP.eucJP/man/man8/tunefs.8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)tunefs.8	8.2 (Berkeley) 12/11/93
.\" %FreeBSD: src/sbin/tunefs/tunefs.8,v 1.8.2.1 1999/08/29 15:15:58 peter Exp %
.\" jpman %Id: tunefs.8,v 1.3 1997/07/26 22:16:10 horikawa Stab %
.\"
.Dd December 11, 1993
.Dt TUNEFS 8
.Os BSD 4.2
.Sh 名称
.Nm tunefs
.Nd 既存のファイルシステムをチューンする
.Sh 書式
.Nm tunefs
.Op Fl A
.Op Fl a Ar maxcontig
.Op Fl d Ar rotdelay
.Op Fl e Ar maxbpg
.Op Fl m Ar minfree
.Bk -words
.Op Fl n Ar enable | disable
.Op Fl o Ar optimize_preference
.Op Fl p
.Ek
.Op Ar special | Ar filesystem
.Sh 解説
.Nm tunefs
は、ファイルシステムのレイアウト方針に影響する動的なパラメータを
変更するために使います。変更するパラメータは以下のフラグで指定します:
.Bl -tag -width indent
.It Fl A
ファイルシステムはスーパブロックのバックアップをいくつか持っています。
このオプションを指定すると、全てのバックアップの内容は
プライマリスーパブロックと同じく変更されます。
これはかなりの危険を秘めています。実行する時は気をつけて下さい。
.It Fl a Ar maxcontig
回転遅延 (
.Fl d
を参照) が強制的に行われる前に連続して配置されるブロック数を指定します。
ほとんどのデバイスドライバはディスク転送のたびに割り込みが必要なので、
デフォルト値は 1 です。
一度の転送でいくつかのバッファをつないで転送できるデバイスドライバでは、
この値を最大の連結長にすべきです。
.It Fl d Ar rotdelay
同じディスクに対する転送完了割り込みサービスと
次の転送を開始する時間の期待値をミリ秒単位で指定します。
この値は、回転遅延によるファイル中のブロック間隔を決めるのに使います。
.It Fl e Ar maxbpg
単一のファイルが他のシリンダグループへまたがる前に、1 つのシリンダグループ
から割り当てることのできる最大のブロック数を指定します。
普通は、この値にはシリンダグループのブロック数の約 1/4 が使われます。
この値は、単一のファイルが 1 つのシリンダグループのブロックを使いつくして
しまうことを防ぐために指定します。
なぜなら、これによって、そのシリンダグループに続いて配置される
すべてのファイルのアクセス速度を低下させてしまうからです。
この制限によって、大きなファイルに対しては 1 つのシリンダに配置するよりも、
長いシークをより頻繁に行わせることがあります。
極端に大きなファイルのあるファイルシステムに対しては、
このパラメータは大きな値にすべきです。
.It Fl m Ar minfree
一般ユーザが利用することができない領域の割合を指定します。
これは最低限の空き領域のしきい値となります。
デフォルト値は 8% です。
この値はゼロにすることもできますが、10% のしきい値を設けた場合と比較し、
アクセスの効率が最大 3 倍まで落ちてしまいます。
5% 以下にすると常に最適化は space 優先になってしまい、
ファイル書き込みのオーバーヘッドがかなり増えます。
もしこの値を現在の空き領域より大きな値に引き上げると、
ファイルを削除してその値を満たすだけの空き領域を用意するまで、
ユーザはファイルを作成することができなくなります。
.It Fl n Ar enable | disable
ソフトアップデートをオン/オフします。
ファイルシステムのアンマウントが必要です。
.It Fl o Ar optimize_preference
ファイルシステムの最適化において、
ブロック割り当てにかかる時間を最小化するか、
もしくはディスク上のフラグメントサイズを最小にするかの
いずれかを選択できます。
space 優先の場合、
ファイル書き込みのオーバヘッドは大きくなります。
カーネルは通常、
ファイルシステムのフラグメントの割合に応じて自動的に優先を変化させます。
.It Fl p
このオプションは、
指定されたファイルシステムにおいて現在変更可能な設定のまとめを表示します。
詳細は
.Xr dumpfs 8
のマニュアルを参照してください。
.El
.Sh 関連項目
.Xr fs 5 ,
.Xr dumpfs 8 ,
.Xr newfs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T "A Fast File System for UNIX"
.%J "ACM Transactions on Computer Systems 2"
.%N 3
.%P pp 181-197
.%D August 1984
.%O "(reprinted in the BSD System Manager's Manual, SMM:5)"
.Re
.Sh バグ
このプログラムは、
マウントされているファイルシステムに対しても動作すべきです。
スーパブロックはバッファキャッシュ内に保存されていないため、
実行の影響は、それをマウントされていないファイルシステムに
対して実行したときのみ現れます。
ルートファイルシステムをチューンするには、チューン後に再起動する必要が
あります。
.\" Take this out and a Unix Demon will dog your steps from now until
.\" the time_t's wrap around.
.Pp
ファイルシステムをチューンする事はできても、ファイルの中身まではチュー
ンできません:-)
.Sh 歴史
.Nm
コマンドは
.Bx 4.2
から登場しました。
