freebsd/freebsd-doc/ja_JP.eucJP/man/man8/tzsetup.8
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/tzsetup/tzsetup.8,v 1.18 2004/07/02 23:12:58 ru Exp %
.\"
.\" $FreeBSD$
.Dd January 24, 1996
.Dt TZSETUP 8
.Os
.Sh 名称
.Nm tzsetup
.Nd ローカルタイムゾーンを設定する
.Sh 書式
.Nm
.Op Fl n
.Op Ar default
.Sh 解説
.Nm
ユーティリティは、タイムゾーン情報データベースを読み込み、
メニューをユーザに提供してタイムゾーンを選択させます。
ユーザはデータベースのレイアウトの詳細を知る必要はありません。
選択されたゾーンは、システムのデフォルトのゾーンとしてインストールされます。
また
.Nm
ユーティリティは、ハードウェアクロックが
.Tn UTC
でないシステムにおいてなんらかの修正が必要か否かを判定します。
.Pp
以下のオプションが使用可能です:
.Bl -tag -offset indent -width Fl
.It Fl n
ファイルの生成やコピーを行いません。
.El
.Pp
コマンドラインで
.Ar default
を指定することにより、メニューシステムを略すことができます;
これは主に、設定済のインストールスクリプトのためにあります。
.Sh タイムゾーンデータベース
タイムゾーンデータベースの内容は、
.Pa /usr/share/zoneinfo/zone.tab
でインデックスされます。
このファイルは、各タイムゾーンデータファイルに対し、
.Tn ISO
3166 領土コードと、
.Pf ( Tn ISO
6709 書式の)
おおよその地理的な位置と、領土内の場所を列挙します。
.Pp
データベースの管理者は、次の方針で管理を行います:
.Bl -enum -offset indent
.It
国または居住者のない地理的な領土おのおのに対し、
最低 1 個のゾーンを割り当てます。
.It
.Ux
の基準時点
.Pf ( Tn GMT
1970 年 1 月 1 日) からのタイムゾーンの履歴の記述されている、
区別するものおのおのに対し、
1 個のゾーンを割り当てます。
.It
各ゾーンの名前は、その中で最も人口の多い都市からとります
(可能であれば、データベースには 1970 年以前のその都市の歴史を含めます)。
.El
データベース
.Pq Pa /usr/src/share/zoneinfo/[a-z]*
のソースコードには、
さらに多くのコメントと歴史的な事情に関する文書への参照が含まれています。
.Sh バグ
.Nm
が
.Pa /etc/localtime
を生成または更新したときにすでに実行中であるプログラムは、
更新されたタイムゾーンを反映しません。
システムが最初に非
.Tn UTC
ハードウェアクロックに設定されたときには、
.Xr adjkerntz 8
を実行する必要があります (通常システム起動時に実行されます)。
これは、正しいタイムゾーンオフセットに関するカーネルの理解を
更新する必要があるためです。
.Sh 関連ファイル
.Bl -tag -width /usr/share/zoneinfo/zone.tab -compact
.It Pa /etc/localtime
現在のタイムゾーンのファイル
.It Pa /etc/wall_cmos_clock
.Xr adjkerntz 8
を見てください。
.It Pa /usr/share/misc/iso3166
.Tn ISO
3166 領土コードから名前へのマッピング
.It Pa /usr/share/zoneinfo
ゾーン情報ファイルを置くディレクトリ
.It Pa /usr/share/zoneinfo/zone.tab
タイムゾーンファイルから国と場所へのマッピング
.El
.Sh 関連項目
.Xr date 1 ,
.Xr adjtime 2 ,
.Xr ctime 3 ,
.Xr timezone 3 ,
.Xr tzfile 5 ,
.Xr adjkerntz 8 ,
.Xr zdump 8 ,
.Xr zic 8
.Sh 否認証明
各地に対して特定の国や領土と関連付けているのは、識別だけを目的としています。
なんらかの領土問題に対する
.Fx
Project の支持や拒否を意図しているのではありません。
