freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ugidfw.8
.\" Copyright (c) 2002, 2004 Networks Associates Technology, Inc.
.\" All rights reserved.
.\"
.\" This software was developed for the FreeBSD Project by Chris
.\" Costello at Safeport Network Services and NAI Labs, the Security
.\" Research Division of Network Associates, Inc. under DARPA/SPAWAR
.\" contract N66001-01-C-8035 ("CBOSS"), as part of the DARPA CHATS
.\" research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/ugidfw/ugidfw.8,v 1.6 2004/02/25 03:59:56 rwatson Exp %
.\"
.\" $FreeBSD$
.Dd February 24, 2004
.Dt UGIDFW 8
.Os
.Sh 名称
.Nm ugidfw
.Nd "ファイルシステムオブジェクトに対するファイアウォール的なアクセス制御"
.Sh 書式
.Nm
.Cm add
.Cm subject
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm object
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm mode
.Ar arswxn
.Nm
.Cm list
.Nm
.Cm set
.Ar rulenum
.Cm subject
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm object
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm mode
.Ar arswxn
.Nm
.Cm remove
.Ar rulenum
.Sh 解説
.Nm
ユーティリティは、UID および GID によるファイルシステムオブジェクトの
アクセスを管理するために、
.Xr ipfw 8
に似たインタフェースを提供します。
この機能は
.Xr mac_bsdextended 4
.Xr mac 9
ポリシによってサポートされています。
.Pp
引数は次の通りです:
.Bl -tag -width indent -offset indent
.It Cm add
新規の
.Nm
ルールを追加します。
.It Xo
.Cm add
.Cm subject
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm object
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm mode
.Ar arswxn
.Xc
ルール番号を自動的に選んで、新規のルールを追加します。
文法の情報に関しては
.Cm set
の記述を参照して下さい。
.It Cm list
システム上に現在あるすべての
.Nm
ルールリストを表示します。
.It Xo
.Cm set Ar rulenum
.Cm subject
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm object
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Cm mode
.Ar arswxn
.Xc
新規のルールを追加するか、既存のルールを修正します。
引数は次の通りです:
.Bl -tag -width ".Ar rulenum"
.It Ar rulenum
ルール番号。
小さいルール番号を持つエントリが先に適用されます。
最も頻繁にマッチするルールをリストの先頭に置く
(すなわち小さい番号にする) と、少々性能が良くなります。
.It Xo
.Cm subject
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Xc
ルールが適用されるためには、
操作を実行する主体が
.Ar uid
や
.Ar gid
で指定されるユーザやグループにマッチすることが必要です
.Cm ( not
が指定されている場合には、マッチ
.Em しない
ことが必要です)。
.It Xo
.Cm object
.Op Cm not
.Op Cm uid Ar uid
.Op Cm gid Ar gid
.Xc
ルールが適用されるためには、
オブジェクトが
.Ar uid
や
.Ar gid
で指定されるユーザやグループに所有されていることが必要です
.Cm ( not
が指定されている場合には、所有されて
.Em いない
ことが必要です)。
.It Cm mode Ar arswxn
.Xr chmod 1
と同様、各文字がアクセスモードを表現します。
ルールが適用される場合、
指定されたアクセス権限がオブジェクトに対して強制されます。
ルール中に文字が指定されていた場合、ルールはその操作を許可します。
逆に、文字が指定されていない場合、その操作は拒否されます。
各文字の定義は次の通りです:
.Pp
.Bl -tag -width ".Cm w" -compact -offset indent
.It Cm a
管理者操作
.It Cm r
読み取りアクセス
.It Cm s
ファイル属性に対するアクセス
.It Cm w
書き込みアクセス
.It Cm x
実行アクセス
.It Cm n
無し
.El
.El
.It Cm remove Ar rulenum
指定したルール番号を持つルールを無効化し、削除します。
.El
.Sh 関連項目
.Xr mac_bsdextended 4 ,
.Xr mac 9
.Sh 歴史
.Nm
ユーティリティが最初に登場したのは
.Fx 5.0
です。
.Sh 作者
このソフトウェアは、
NAI Labs,
the Security Research Division of Network Associates Inc.
が、DARPA CHATS 研究プログラムの一部として、
DARPA/SPAWAR 契約 N66001-01-C-8035
.Pq Dq CBOSS
のもとに、
.Fx
Project に寄贈しました。
