freebsd/freebsd-doc/ja_JP.eucJP/man/man8/umount.8
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)umount.8	8.2 (Berkeley) 5/8/95
.\" %FreeBSD: src/sbin/umount/umount.8,v 1.19 2004/03/04 00:52:16 brueffer Exp %
.\" $FreeBSD$
.\"
.Dd July 18, 2003
.Dt UMOUNT 8
.Os
.Sh 名称
.Nm umount
.Nd ファイルシステムのアンマウント
.Sh 書式
.Nm
.Op Fl fv
.Ar special | node | fsid
.Nm
.Fl a | A
.Op Fl F Ar fstab
.Op Fl fv
.Op Fl h Ar host
.Op Fl t Ar type
.Sh 解説
.Nm
ユーティリティは、
ファイルシステムをファイルシステムツリーから除去するために、
.Xr unmount 2
システムコールを呼び出します。
指定されるファイルシステムは、
.Ar special
デバイスか、リモートノード (rhost:path) か、マウントポイント
.Ar node
か、
.Dq mount -v
で報告されるファイルシステム ID
.Ar fsid
です。
.Ar special
か
.Ar node
のどちらか一方が指定されなかった時は、適当な情報が
.Xr fstab 5
ファイルから入手されます。
.Pp
以下のようなオプションがあります。
.Bl -tag -width indent
.It Fl a
.Xr fstab 5
に記述されているすべてのファイルシステムをアンマウントします。
.It Fl A
ルート以外で現在マウントされているファイルシステムをすべて
アンマウントします。
.It Fl F Ar fstab
使用する
.Pa fstab
ファイルを指定します。
.It Fl f
ファイルシステムを強制的にアンマウントします。
利用されているスペシャルデバイスは使い続けようとしますが、
更にアクセスしようとすると、すべてのファイルはエラーを返します。
ルートファイルシステムは強制的にアンマウントすることはできません。
.It Fl h Ar host
指定されたホストからマウントしているファイルシステムだけをアンマウント
します。
このオプションは
.Fl A
オプションを暗黙に指定し、
.Fl t
オプションで他のものを指定しなければ、
.Tn NFS
ファイルシステムだけを
アンマウントします。
.It Fl t Ar type
指定されたタイプのファイルシステムだけを扱うように指示します。
1 つ以上のタイプは、コンマ (``,'') で分けたリストで指定します。
ファイルシステム形式のリストは、
前に
.Dq no
を付けることで、その動作をそのファイルシステムに付いては行わない様に
指定することもできます。
例えば、
.Nm
コマンド
.Bd -literal -offset indent
umount -a -t nfs,nullfs
.Ed
.Pp
は、タイプが
.Tn NFS
と
.Tn NULLFS
であり、
.Xr fstab 5
ファイルに列挙されているすべてのファイルシステムをアンマウントします。
.It Fl v
冗長モードです。アンマウントされる各ファイルシステムの追加情報が
出力されます。
.El
.Sh 環境変数
.Bl -tag -width ".Ev PATH_FSTAB"
.It Ev PATH_FSTAB
環境変数
.Ev PATH_FSTAB
が設定されていると、すべての操作は指定されたファイルに対して実行されます。
プロセス環境やメモリアドレス空間が
.Dq 汚染されている
とみなされる場合には
.Ev PATH_FSTAB
は尊重されません (更なる情報は
.Xr issetugid 2
を参照してください)。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
ファイルシステムテーブル
.El
.Sh 関連項目
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh 歴史
.Nm
ユーティリティは
.At v6
から導入されました。
