freebsd/freebsd-doc/ja_JP.eucJP/man/man8/umount.8
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)umount.8	8.2 (Berkeley) 5/8/95
.\" %FreeBSD: src/sbin/umount/umount.8,v 1.5.2.1 1999/08/29 15:16:01 peter Exp %
.\" jpman %Id: umount.8,v 1.3 1997/07/22 17:06:06 horikawa Stab %
.\"
.Dd February 20, 1994
.Dt UMOUNT 8
.Os BSD 4
.Sh 名称
.Nm umount
.Nd ファイルシステムのアンマウント
.Sh 書式
.Nm umount
.Op Fl fv
.Ar special \&| node
.Nm umount
.Fl a | A
.Op Fl fv
.Op Fl h Ar host
.Op Fl t Ar type
.Sh 解説
.Nm
コマンドは、
.Ar "スペシャルデバイス (special device)"
もしくはリモートのノード (rhost:path) をファイルシステムツリーの
.Ar node 
の位置から除去するために、
.Xr unmount 2
システムコールを呼び出します。
.Ar special
か
.Ar node
のどちらか一方が指定されなかった時は、適当な情報が
.Xr fstab 5
ファイルから入手されます。
.Pp
以下のようなオプションがあります。
.Bl -tag -width indent
.It Fl a
.Xr fstab 5
に記述されているすべてのファイルシステムをアンマウントします。
.It Fl A
ルート以外で現在マウントされているファイルシステムをすべて
アンマウントします。
.It Fl f
ファイルシステムを強制的にアンマウントします。
利用されているスペシャルデバイスは使い続けようとしますが、
更にアクセスしようとすると、すべてのファイルはエラーを返します。
ルートファイルシステムは強制的にアンマウントすることはできません。
.It Fl h Ar host
指定されたホストからマウントしているファイルシステムだけをアンマウント
します。
このオプションは
.Fl A
オプションを暗黙に指定し、
.Fl t
オプションで他のものを指定しなければ、
.Tn NFS
ファイルシステムだけを
アンマウントします。
.It Fl t Ar type
指定されたタイプのファイルシステムだけを扱うように指示します。
1 つ以上のタイプは、コンマ (``,'') で分けたリストで指定します。
ファイルシステム形式のリストは、
前に
.Dq no
を付けることで、その動作をそのファイルシステムに付いては行わない様に
指定することもできます。
例えば、
.Nm
コマンド
.Bd -literal -offset indent
umount -a -t nfs,mfs
.Ed
.Pp
は、ファイルシステムのタイプが
.Tn NFS
と
.Tn MFS 
であるすべてのファイルをアンマウントします。
.It Fl v
冗長モードです。アンマウントされる各ファイルシステムの追加情報が
出力されます。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
ファイルシステムテーブル
.El
.Sh 関連項目
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh バグ
union ファイルシステムを使っている時は、
.Xr umount 8
は、常にマウントポイントであるノードを決定することができません。
この場合、アンマウントするために
.Xr mount 8 
で表示されるのと同じ形式で適切なディレクトリを指定してやる必要が
あります。
例えば、マウントエントリが以下のような場合、
.Bd -literal -offset indent
<above>/tmpdir on /cdrom (local, user mount)
.Ed
.Pp
アンマウントのためのコマンドは、
.Bd -literal -offset indent
umount '<above>/tmpdir'
.Ed
.Pp
となります。ここで、
.Ar /tmpdir 
は、マウントポイント
.Ar /cdrom 
からアンマウントされます。
.Sh 歴史
.Nm
コマンドは
.At v6 
から導入されました。
