freebsd/freebsd-doc/ja_JP.eucJP/man/man8/usbd.8
.\" %NetBSD: usbd.8,v 1.2 1998/07/13 11:01:50 augustss Exp %
.\" FreeBSD %FreeBSD: src/usr.sbin/usbd/usbd.8,v 1.2.2.1 1999/08/29 15:48:50 peter Exp %
.\" jpman %Id: usbd.8,v 1.3 1999/02/11 07:46:58 horikawa Stab %
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 12, 1998
.Dt USBD 8
.Os
.Sh 名称
.Nm usbd
.Nd USB の 抜き差しを管理する
.Sh 書式
.Nm
.Op Fl d
.Op Fl f Ar device
.Op Fl t Ar timeout
.Op Fl v
.Sh 解説
.Nm 
は USB 機器の取り付けと取り外しを扱います。
.Pp
オプションは次の通りです:
.Bl -tag -width Ds
.It Fl d
標準出力へのデバッグ情報を有効にします。また制御端末を切り放しません。
.It Fl e
1 回だけデバイスツリー探査を行い、終了します。
.It Fl f Ar device
USB コントローラデバイスファイルのパス名を指定します。
1 つより多くの USB コントローラを見るには、
このフラグを繰り返せば良いでしょう。
デフォルトは
.Pa /dev/usb0 ,
.Pa /dev/usb1 ,
.Pa /dev/usb2 ,
.Pa /dev/usb3
です。
.It Fl t Ar timeout
接続または切断による刺激なしに引き起こされる探査までの
タイムアウト間隔 (秒) を設定します。
タイムアウトに 0 を設定すると、タイムアウトしないことを意味します。
デフォルトは 30 です。
.It Fl v
冗長になります。
.El
.Sh 関連項目
.Xr usb 4
.Sh 歴史
.Nm 
コマンドは
.Nx 1.4
で登場しました。
