freebsd/freebsd-doc/ja_JP.eucJP/man/man8/usbd.8
.\" %NetBSD: usbd.8,v 1.2 1998/07/13 11:01:50 augustss Exp %
.\" jpman %Id: usbd.8,v 1.3 1999/02/11 07:46:58 horikawa Stab %
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/usbd/usbd.8,v 1.9.2.1 2000/04/02 21:14:13 n_hibma Exp %
.\"
.Dd July 12, 1998
.Dt USBD 8
.Os
.Sh 名称
.Nm usbd
.Nd USB の 抜き差しを管理する
.Sh 書式
.Nm
.Op Fl c Ar configfile
.Op Fl d
.Op Fl e
.Op Fl f Ar device
.Op Fl n
.Op Fl t Ar timeout
.Op Fl v
.Sh 解説
.Nm 
は USB 機器の取り付けと取り外しを扱います。
これは 2 つのことを行います。まず
.Pa /dev/usb0 ,
.Pa /dev/usb1
等のオープンを通じ、
接続されたハブからの変更要求をカーネルが処理するようにします。
この機能は、カーネルがカーネルスレッドを持つ場合には取り除かれます。
(複数の)
.Fl f Ar device
コマンド行オプションは、どのコントローラを処理するかを指定します。
通常本オプションは不要です。
.Pp
.Dq usb ,
.Dq ohci ,
.Dq uhci
のモジュールがロードされていない場合、これらは自動的にロードされます。
.Pp
第 2 の部分は、USB デバイスの着脱です。
デバイス
.Pa /dev/usb
がオープンされ、イベントがここから読み込まれます。
デバイス着脱時には、
.Pa /etc/usbd.conf
から読み込まれたアクションリストが、マッチするエントリに対して検索されます。
見付かると、対応するアクションが実行されます。
.Pp
コマンド行オプションは次の通りです:
.Bl -tag -width Ds
.It Fl c Ar filename
設定ファイルの名前です。デフォルトは
.Pa /etc/usbd.conf
です。
.It Fl d
標準出力へのデバッグ情報を有効にします。また制御端末を切り放しません。
.It Fl e
1 回だけデバイスツリー探査を行い、イベントキューを操作せずに終了します。
.It Fl f Ar device
USB コントローラデバイスファイルのパス名を指定します。
1 つより多くの USB コントローラを見るには、
このフラグを繰り返せば良いでしょう。
デフォルトは
.Pa /dev/usb0
から
.Pa /dev/usb3
です。
デバイス
.Pa /dev/usb
をここで使用しないでください。これはイベントのみで使用されます。
.It Fl n
/dev/usb のイベントを処理しません。
.It Fl t Ar timeout
接続または切断による刺激なしに引き起こされる探査までの
タイムアウト間隔 (秒) を設定します。
タイムアウトに 0 を設定すると、タイムアウトしないことを意味します。
デフォルトは 30 です。
.It Fl v
冗長になります。
フラグを繰り返すと
.Nm usbd
がより冗長になります。
.El
.Sh 関連ファイル
.Bl -tag -width /etc/usbd.conf -compact
.It Pa /etc/usbd.conf
.It /dev/usb
.It /dev/usb0
.It /dev/usb1
.It 等
.Sh 関連項目
.Xr usb 4 ,
.Xr usbd.conf 5
.Sh 歴史
.Nm 
コマンドは
.Nx 4.0
で登場しました。
.Sh 作者
.Nm
ドライバは
.An Lennart Augustsson Aq augustss@carlstedt.se
は
.Nx
プロジェクト用に記述しました。
.Nm usbd
のイベントキュー処理は
.An Nick Hibma Aq n_hibma@freebsd.org
が追加しました。
