freebsd/freebsd-doc/ja_JP.eucJP/man/man8/uuchk.8
''' %FreeBSD: src/gnu/libexec/uucp/uuchk/uuchk.8,v 1.2.2.1 1999/08/29 14:30:24 peter Exp %
.TH uuchk 1 "Taylor UUCP 1.06"
.SH 名称
uuchk \- UUCP の設定から得た情報を表示する
.SH 書式
.B uuchk
[-s system] [standard UUCP options]
.SH 解説
.B uuchk
プログラムは UUCP 設定ファイルを読み込み、
どんなことが書かれていたかをどちらかというと長めの表現で表示します。
UUCP の設定を行っているときに、
UUCP パッケージがあなたの期待通りに動作することを確認するために使用すると
便利です。
.SH オプション
以下のオプションを
.B uuchk
に与えることが可能です:
.TP 5
.B \-s, \-\-system
全システムではなく、指定したシステムに関する情報のみを表示します。
.B uuchk
プログラムは、標準の UUCP プログラムのオプションもサポートします。
.TP 5
.B \-x type
.TP 5
.B \-\-debug type
.TP 5
.B \-I file
.TP 5
.B \-\-config file
.TP 5
.B \-v, \-\-version
.TP 5
.B \-\-help
標準の UUCP オプション。
.SH 関連項目
uucp(1)
.SH 作者
Ian Lance Taylor (ian@airs.com).
このマニュアルページは Taylor UUCP 1.06 の Texinfo 文書に基いています。

