freebsd/freebsd-doc/ja_JP.eucJP/man/man8/uucico.8
''' %FreeBSD: src/gnu/libexec/uucp/uucico/uucico.8,v 1.8 1999/08/27 23:33:51 peter Exp %
.\" $FreeBSD$
.TH uucico 8 "Taylor UUCP 1.06"
.SH 名称
uucico \- UUCP ファイル転送デーモン
.SH 書式
.B uucico
[ options ]
.SH 解説
.I uucico
デーモンは、
.I uucp
(1) および
.I uux
(1) によってキューに蓄積されたファイル転送リクエストの処理をします。
.I uucico
は、(
.B \-r
オプションなしに)
.I uucp
あるいは
.I uux
が実行された時に実行を始めます。
また、典型的な方法として、
.I crontab
テーブルを用いて定期的に実行されます。

.B \-r1,
.B \-\-master,
.B \-s,
.B \-\-system
あるいは
.B \-S
オプションとともに起動された場合、デーモンはリモートシステムを呼び出し、
マスタモードで動作します。それ以外の場合は、デーモンはスレーブモードで
動作し、リモートシステムからの呼び出しを受け付けます。典型的な方法として、
UUCP 用の特別なログイン名が準備され、呼び出しを受けると
.I uucico
を自動的に起動するように設定されます。

.I uucico
が終了すると、
.B \-q
あるいは
.B \-\-nouuxqt
が指定されていなければ、
.I uuxqt
(8) デーモンを起動します。
.I uuxqt
(8) は、リモートシステムの
.I uux
(1) によって作成された作業を実行し、また、待機していたリモートファイルの
受信によりローカルに作成された作業を実行します。

呼び出しが失敗すると、
.I uucico
は、ある(設定可能な)時間が経過するまで、再呼び出しを拒否します。
この動作は、
.B -f,
.B --force
あるいは
.B -S
オプションにより無効にする事ができます。

.B \-l,
.B \-\-prompt,
.B \-e
あるいは
.B \-\-loop
オプションを使用する事で、
.I uucico
に独自の "login:" および "Password:" プロンプトを生成させる事ができます。
他のデーモンが呼び出して来た場合、このプロンプトを見て、通常通りに
ログインする事ができます。この場合、ログイン名およびパスワードは
.I /etc/passwd
ファイルではなく、
.I uucico
専用に準備されたリストによりチェックされます。一部のシステムでは、
.I uucico
が
.I /etc/passwd
ファイルを用いるようにする事も可能です。
.B \-l
あるいは
.B \--prompt
オプションを用いると、プロンプトを一回だけ生成し、そのセッションが
終了するとプロセスも終了します。
このモードでは、UUCP 管理者あるいはスーパユーザは
.B \-u
あるいは
.B \--login
オプションを用いてログイン名を指定する事ができます。この時、
.I uucico
は "login:" プロンプトを生成しません。
.B \-e
あるいは
.B \--loop
オプションを用いると、最初のセッションが終了すると再びプロンプトを生成
します。このモードでは、
.I uucico
は、ポートを永久的に制御します。

.I uucico
が SIGQUIT、SIGTERM あるいは SIGPIPE シグナルを受け取ると、
現在のリモートシステムとのやり取りを中断し、終了します。
.I uucico
が SIGHUP シグナルを受け取ると、現在のやり取りを中断しますが、
.B \-r1
あるいは
.B \-\-master
により起動された場合は、呼び出しを継続し、
.B \-e
あるいは
.B \-\-loop
により起動された場合は、他のシステムからの呼び出しを受け付けます。
.I uucico
が SIGINT シグナルを受け取った場合、現在のやり取りを終了し、
それ以上の呼び出しや受付を行いません。
.SH オプション
以下のオプションが
.I uucico
で使用可能です。
.TP 5
.B \-r1, \-\-master
マスタモードで動作します(他のシステムを呼び出します)。
.B \-s,
.B \-\-system
あるいは
.B \-S
が指定されていれば、このオプションが指定されたと見なされます。
システムが指定されていなければ、待機中の作業がある全てのシステムを呼び出します。
.TP 5
.B \-r0, \-\-slave
スレーブモードで動作します。デフォルトはこの設定です。
.TP 5
.B \-s system, \-\-system system
指定されたシステムを呼び出します。
.TP 5
.B \-S system
必要な待ち時間を無視して、指定されたシステムを呼び出します。
.B \-s system \-f
と等価です。
.TP 5
.B \-f, \-\-force
呼び出しに際して、必要な待ち時間を無視します。
.TP 5
.B \-l, \-\-prompt
"login:" と "Password:" を表示してログイン名とパスワードの入力を
要求します。このオプションにより、
.I uucico
を
.I inetd
(8) から起動することを容易にします。ログイン名およびパスワードは
UUCP パスワードファイルによりチェックされ、通常このファイルは
.I /etc/passwd
ファイルとは関連していません。
.B \-\-login 
オプションを用いてログイン名を指定する事ができます。この時、
.I uucico
は、パスワードの入力のみを要求します。
.TP 5
.B \-p port, \-\-port port
呼び出しあるいは待ち受けに使用するポートを指定します。
.TP 5
.B \-e, \-\-loop
ログイン/パスワードの要求とスレーブモードデーモンでの実行の無限ループ
に入ります。プログラムは自分自身では終了しないので、終了させるためには
.I kill
(1) を使用する必要があります。
.TP 5
.B \-w, \-\-wait
(
.B \-s,
.B \-\-system
あるいは
.B \-S
が指定されていればそのシステムへの、単に
.B \-r1
あるいは
.B \-\-master
が指定されていれば作業がある全てのシステムへの)呼び出しが終了すると、
.B \-\-loop
が指定された場合同様、無限ループに入ります。
.TP 5
.B \-q, \-\-nouuxqt
終了後に、
.I uuxqt
(8) デーモンの実行をしません。
.TP 5
.B \-c, \-\-quiet
その時間に全ての呼び出しが禁止されていた場合、呼び出しは行わず、
ログファイルにエラーメッセージも記録せず、
.I uustat
(1) で報告されるシステム状況も更新しません。
このオプションは、どのシステムが現在呼び出し可能であるかを気にせずに
全てのシステムへの呼び出しを試すような、自動ポーリングスクリプトから
使用する場合に便利でしょう。さらに、このオプションを使用すると、
作業が何もない事の記録も行いません。
.TP 5
.B \-C, \-\-ifwork
.B \-s,
.B \-\-system
あるいは
.B \-S
で指定されたシステムに対する作業がある場合のみ呼び出しを行います。
.TP 5
.B \-D, \-\-nodetach
制御端末の切り離しを行いません。通常、
.I uucico
は他のシステムの呼び出しや
.I uuxqt
の実行に先立ち、端末を切り離します。
このオプションはこの動作を防ぎます。
.TP 5
.B \-u name, \-\-login name
起動したユーザのログイン名の代わりに使用するログイン名を指定します。
このオプションは UUCP 管理者あるいはスーパユーザのみが使用できます。
.B \-\-prompt
とともに使用した場合、
.I uucico
は、ログイン名の入力待ちはせず、パスワードの入力だけを待ちます。
.TP 5
.B \-z, \-\-try-next
リモートシステムに接続したあとに呼び出しが失敗した場合、
単に終了するのではなく、次の選択肢を試行します。
.TP 5
.B \-i type, \-\-stdin type
標準入力を使用する場合のポートのタイプを指定します。サポートされる
唯一のタイプは TLI で、TLI ネットワークインタフェースをサポートしている
マシンでしか使用する事ができません。
.B \-iTLI
を指定すると、
.I uucico
は、入出力を行う時に TLI 呼び出しを使用します。
.TP 5
.B \-x type, \-X type, \-\-debug type
特定のデバッグタイプを指定します。タイプとしては、
abnormal, chat, handshake, uucp-proto, proto, port, 
config, spooldir, execute, incoming, outgoing があります。

コンマで区切ることで複数のデバッグタイプが指定可能です。そして、
.B \-\-debug
オプションは、1回のコマンド起動で複数回指定可能です。また、タイプとして
数字を指定することも可能です。
例えば、
.B \-\-debug 2
は、
.B \-\-debug abnormal,chat
と同じ意味です。

デバッグ出力は、デバッグファイルに記録されます。通常、デバッグファイルは、
/var/spool/uucp/Debug, /usr/spool/uucp/DEBUG,
/usr/spool/uucp/.Admin/audit.local のいずれかです。
.TP 5
.B \-I file, \-\-config file
使用する初期設定ファイルの指定を行います。
ただし、本オプションが使用可能かどうかは、
.I uucico
がどのようにコンパイルされたかによります。
.TP 5
.B \-v, \-\-version
バージョンを表示し、終了します。
.TP 5
.B \-\-help
ヘルプを表示し、終了します。
.SH 関連ファイル
関連ファイル名は、コンパイル時の指定ないしは初期設定ファイルにより
変化します。以下に挙げるものは、その一例です。

.br
/etc/uucp/config - 初期設定ファイル
.br
/etc/uucp/passwd - デフォルトの UUCP パスワードファイル
.br
/var/spool/uucp -
UUCP スプールディレクトリ
.br
/var/spool/uucp/Log -
UUCP ログファイル
.br
/var/spool/uucppublic -
デフォルトの UUCP パブリックディレクトリ
.br
/var/spool/uucp/Debug -
デバッグファイル
.SH 関連項目
kill(1), uucp(1), uux(1), uustat(1), uuxqt(8)
.SH 作者
Ian Lance Taylor
<ian@airs.com>
