freebsd/freebsd-doc/ja_JP.eucJP/man/man8/uuxqt.8
''' %FreeBSD: src/gnu/libexec/uucp/uuxqt/uuxqt.8,v 1.7 1999/08/27 23:34:07 peter Exp %
.\" $FreeBSD$
.TH uuxqt 8 "Taylor UUCP 1.05"
.SH 名称
uuxqt \- UUCP 実行デーモン
.SH 書式
.B uuxqt
[ options ]
.SH 解説
.B uuxqt
デーモンは、ローカルもしくはリモートシステムの
.I uux
(1) によって要求されたコマンドを実行します。このデーモンは
.I uucico
(8) によって自動的に実行開始されます。ただし、
.I uucico
(8) デーモンが
.B \-q
オプションか
.B \-\-nouuxqt
オプションを付加して実行された場合にはこの限りではありません。

通常は、
.I uucico
(8) から本コマンドを起動するため、本コマンドをユーザが直接実行する
必要はありません。しかし、処理キューの処理について、なんらかの融通を
きかせたい場合に本コマンドは有効です。

.I uuxqt
の複数同時起動については、初期化コマンドの
.I max-uuxqt
を用いることによって
同時起動最大数を制御することが出来ます。
.SH オプション
以下のオプションが 
.B uuxqt
で使用可能です。
.TP 5
.B \-c command, \-\-command command
引数
.I command
で指定したコマンドの要求のみを実行します。例:
.br
.in +0.5i
.nf
uuxqt --command rmail
.fi
.in -0.5i
.TP 5
.B \-s system, \-\-system system
指定したシステムからの要求のみを実行します。
.TP 5
.B \-x type, \-\-debug type
特定のデバッグタイプを有効にします。デバッグタイプとしては、
abnormal, chat, handshake, uucp-proto, proto, port,
config, spooldir, execute, incoming, outgoing が有効です。
なお、 
.I uuxqt
自体に意味のあるデバッグタイプは
abnormal, config, spooldir, execute
の 4 つだけです。

デバッグタイプに関しては、コンマで区切ることで複数指定が可能になります。
.B \-\-debug
によるデバッグタイプ指定は、
1 つのコマンドライン中に複数存在してもかまいません。
数字による指定を行なうと、先述のリスト中、先頭から指定した番号までの
デバッグタイプが有効になります。例えば、
.B \-\-debug 2
と指定した場合は、
.B \-\-debug abnormal,chat
と指定したのと同じです。

デバッグ出力は、デバッグファイルに記録されます。デバッグファイルは、通常は、
/var/spool/uucp/Debug, /var/spool/uucp/DEBUG,
/var/spool/uucp/.Admin/audit.local
のいずれかです。
.TP 5
.B \-I file, \-\-config 
使用する設定ファイルを指定します。しかし
このオプションが利用できるかできないかは
.I uuxqt
をどのようにコンパイルしたかに依存します。
.TP 5
.B \-v, \-\-version
バージョン情報を表示して終了します。
.TP 5
.B \-\-help
ヘルプメッセージを表示して終了します。
.SH 関連ファイル
ファイル名は、コンパイル時もしくは
設定ファイルによって変更可能です。
したがって、これは目安だと思って下さい。

.br
/etc/uucp/config - 設定ファイル。
.br
/var/spool/uucp -
UUCP スプールディレクトリ。
.br
/var/spool/uucp/Log -
UUCP ログ記録ファイル。
.br
/var/spool/uucppublic -
デフォルト時の UUCP パブリックディレクトリ。
.br
/var/spool/uucp/Debug -
デバッグ情報ファイル。
.SH 関連項目
uucp(1), uux(1), uucico(8)
.SH 作者
Ian Lance Taylor
(ian@airs.com)
