freebsd/freebsd-doc/ja_JP.eucJP/man/man8/vmstat.8
.\" Copyright (c) 1986, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)vmstat.8	8.1 (Berkeley) 6/6/93
.\"	%Id: vmstat.8,v 1.9 1997/08/25 06:40:05 charnier Exp %
.\" jpman %Id: vmstat.8,v 1.2 1997/05/29 07:57:00 yugawa Stab %
.\"
.Dd June 6, 1996
.Dt VMSTAT 8
.Os BSD 4
.Sh 名称
.Nm vmstat
.Nd 仮想メモリの統計情報を報告する
.Sh 書式
.Nm vmstat
.\" .Op Fl fimst
.Op Fl ims
.Op Fl c Ar count
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
.Op Ar disks
.Sh 解説
.Nm
は、プロセス、仮想メモリ、ディスク、トラップ、CPU の活動状況
などについてカーネルが持っている統計情報を報告します。
.Pp
オプション:
.Bl -tag -width indent
.It Fl c
表示を
.Ar count
回繰り返します。
最初の表示はリブート時からの統計で、
その後の表示は直前の表示から現在までの間の統計です。
.Ar wait
間隔を指定しないと、デフォルトは 1 秒となります。
.\" .It Fl f
.\" システムが起動してからの
.\" .Xr fork 2
.\" と
.\" .Xr vfork 2
.\" システムコールの回数と、それぞれのシステムコールで使われた
.\" 仮想メモリのページ数を表示します。
.It Fl i
システムが起動してから各デバイスで起こった割り込みの回数を表示します。
.It Fl M
名前に関するリストから値を取り出す際に、デフォルトの
.Pa /dev/kmem
の代わりに指定された
.Ar core 
を使います。
.It Fl N
名前のリストを取り出す際に、デフォルトの
.Pa /kernel
の代わりに指定された
.Ar system 
を使います。
.It Fl m
カーネルの動的メモリの利用状況について、確保したサイズ、利用のタイプの
順で一覧にして表示します。
.It Fl s
.Em sum
構造体の内容を表示し、システムが起動してから起こったいくつかの
種類のページング関連のイベントの合計を報告します。
.\" .It Fl t
.\" システムが起動してからのページインと際利用されたページ数、
.\" それぞれが要求した時間の合計を表示します。
.It Fl w
各表示の間で、
.Ar wait
秒ポーズします。
繰り返し回数
.Ar count
を指定していなければ、デフォルトでは無限に繰り返します。
.El
.Pp
デフォルトでは、
.Nm
は以下の情報を表示します。
.Pp
.Bl -tag -width indent
.It procs
以下の各状態でのプロセス数に関する情報
.Pp
.Bl -tag -width indent -compact
.It r
実行待ち行列にある状態
.It b
リソース確保 (i/o やページングなど) のためにブロックされている状態
.It w
実行可能または短期間のスリープ中 (20 秒以内) であるが、スワップされている状態
.El
.It memory
仮想メモリと実メモリの使用状況に関する情報を表示します。
実行中または最近 20 秒間で実行されたプロセスに属する仮想ページ
(1024 バイト単位で表示される) は、アクティブであるとみなします。
.Pp
.Bl -tag -width indent -compact
.It avm
アクティブな仮想ページ
.It fre	
フリーリストのサイズ
.El
.It page
ページフォルトとページングの活動状況に関する情報を表示します。
これらは 5 秒間の平均として、秒単位で表示します。
.Pp
.Bl -tag -width indent -compact
.It flt
ページフォルトの総数
.It re
要求されたページ数 (参照ビットをシミュレート)
.\" .It at
.\" アタッチされたページ数(フリーリストの中から見つけ出されたもの)
.It pi
ページインされたページ数
.It po
ページアウトされたページ数
.It fr
秒単位の開放されたページ数
.\" .It de
.\" 予期される短期的なメモリ不足
.It sr
クロックアルゴリズムによってスキャンされたページ数 (秒単位)
.El
.It disks
秒単位のディスク操作に関する情報 (このフィールドはシステム依存です)。
通常、ページングは使用可能なドライブにまたがって分割されます。
このフィールドのヘッダは、ディスク名の最初の文字とユニット番号です。
システムが 4 つ以上のディスクドライブを扱うように設定されている場合、
.Nm
は最初の 4 つのドライブしか表示しません。
.Nm
で特定のドライブを表示するには、コマンド行でドライブ名を指定します。
.It faults
最近 5 秒間のトラップ/割り込みの平均レート (秒単位)。
.Pp
.Bl -tag -width indent -compact
.It in
デバイス割り込み (クロック割り込みを含む) の回数
.It sy
システムコールの回数
.It cs
cpu のコンテキストスイッチの回数
.El
.It cpu
CPU 使用時間の内訳 (%)
.Pp
.Bl -tag -width indent -compact
.It us
通常およびそれより低い優先度のプロセスのユーザ時間
.It sy
システム時間
.It id
CPU アイドル時間
.El
.El
.Sh 使用例
コマンド:
.Dl vmstat -w 5
は、システムがどのように動作しているかを 5 秒おきに表示します。
5 秒おきにサンプリングされている統計情報があるため、
この間隔で表示するのがちょうどよいです。
その他の統計情報は 1 秒毎に変化します。
しばらく出力を続ければ、どれが毎秒計算し直されているかがわかるでしょう。
.Sh 関連ファイル
.Bl -tag -width /dev/kmemxxx -compact
.It Pa /kernel
デフォルトのカーネル名前リスト
.It Pa /dev/kmem
デフォルトのメモリファイル
.El
.Sh 関連項目
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr iostat 8 ,
.Xr pstat 8
.Pp
.%T "Installing and Operating 4.3BSD" 
の ``Interpreting system activity'' で始まるセクション
.Sh バグ
.Fl c
と
.Fl w
オプションは、デフォルトの出力を行うときにのみ有効です。
