freebsd/freebsd-doc/ja_JP.eucJP/man/man8/watch.8
.\"
.\" @(#)watch.8		1.1 (FreeBSD) 2/17/95
.\" %FreeBSD: src/usr.sbin/watch/watch.8,v 1.14.2.1 1999/10/30 14:57:33 phantom Exp %
.\"
.\" Original Revision: 1.14
.\" jpman %Id: watch.8,v 1.3 1997/07/22 17:07:53 horikawa Stab %
.\"
.Dd February 17, 1995
.Dt WATCH 8
.Os
.Sh 名称
.Nm watch
.Nd 別の tty 線を覗き見る
.Sh 書式
.Nm watch
.Op Fl ciotnW
.Op Ar tty
.\"  watch [-ciotnW] [<tty name>]
.Sh 解説
.Nm
は、特定の tty を通して流れてくる全てのデータをスーパユーザに
提供します。
.Nm
は、標準出力に出力します。
.Pp
以下のようなオプションがあります。
.Bl -tag -width indent
.It Fl c
閉じられた時点で再接続を行います。
.Nm
によって観察されている tty が閉じられたならば、自動的に同じ tty に
再接続します。
このオプションが指定されていない時は、
.Nm
は対話モードで実行されている時には新しい tty を要求し、
tty 制御を行わずに実行されている場合は終了します。
.It Fl i
対話モードにします。
対話モードは、
.Nm
が tty から実行された場合のデフォルトです。
出力がファイルにリダイレクションされている時は、
このオプションを指定することで対話モードにできます。
.It Fl o
あふれが発生した場合、再接続します。
観察している tty があふれた時の
.Nm
の振舞いは、観察している tty が閉じられた時の振舞いに似ています。
詳しい情報は、
.Xr snp 4 
を見てください。
.It Fl t
tty の観察を始めた時の日付と時間を表示します。
.It Fl n
観察する tty を対話的に変更できなくします。
これは、<control-X> による変更要求と、
現在の tty が閉じられたりあふれを起こした場合の自動プロンプトともに
無効にします。
プロンプトが表示される全ての場合、
.Nm
.\"(訳注)実際は文中の語でしたが、ここでは.Nmを使いました。
.\" 2.2.1R 対象(1997/04/28) Takeshi MUTOH <mutoh@info.nara-k.ac.jp>
は終了します。再接続フラグは、このオプションに影響されません。
.It Fl W
観察している tty への書き込みを許可します。
.It Ar tty
tty は、仮想 tty デバイスや仮想コンソールやシリアル線などのように、
tty 形式のデバイスとして指定しなければなりません。
名前には、前に "/dev/" をつけても構いません。
.Sh 操作
対話的モードで実行中は、全てのユーザの入力は以下のものを除いて、
捨てられます。
.Pp
.Bl -tag -width "XXXX" -compact
.It Sy "<control-G>"
.Nm
の終了。
.It Sy "<control-W>"
画面の消去。
.It Sy "<control-X>"
除き見る tty の変更。
.Sh 制限事項
スーパユーザだけが、
.Nm
を実行できます。
.Sh 関連項目
.Xr pty 4 ,
.Xr sio 4 ,
.Xr snp 4
.Sh バグ
端末エミュレーション機能はありません。
全てのユーザの出力はそのままの形で再構成されます。
.Sh 作者
.An Ugen J.S. Antsilevich Aq ugen@NetVision.net.il
.Sh 歴史
.Nm
は、
.Fx 2.1 
で、はじめて導入されました。
