freebsd/freebsd-doc/ja_JP.eucJP/man/man8/watch.8
.\"
.\" %FreeBSD: src/usr.sbin/watch/watch.8,v 1.29 2004/07/03 18:35:53 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd November 24, 2001
.Dt WATCH 8
.Os
.Sh 名称
.Nm watch
.Nd 別の tty 線を覗き見る
.Sh 書式
.Nm
.Op Fl cinotW
.Op Fl f Ar snpdev
.Op Ar tty
.Sh 解説
.Nm
ユーティリティは、
.Xr snp 4
を使用し、
特定の tty を通して流れてくる全てのデータをユーザが検査可能とします。
.Xr snp 4
デバイスが利用できない場合、
.Nm
はモジュール
.Pq Nm snp
のロードを試みます。
.Nm
ユーティリティは、標準出力に出力します。
.Pp
以下のようなオプションがあります。
.Bl -tag -width indent
.It Fl c
閉じられた時点で再接続を行います。
.Nm
によって観察されている tty が閉じられたならば、自動的に同じ tty に
再接続します。
このオプションが指定されていない時は、
.Nm
は対話モードで実行されている時には新しい tty を要求し、
tty 制御を行わずに実行されている場合は終了します。
.It Fl f Ar snpdev
本オプションが指定された場合、
.Nm
は
.Ar snpdev
を
.Xr snp 4
デバイスとして使用します。
本オプションが無い場合、
.Nm
は次に利用可能な
.Xr snp 4
を見付けようとします。
.It Fl i
対話モードにします。
対話モードは、
.Nm
が tty から実行された場合のデフォルトです。
出力がファイルにリダイレクションされている時は、
このオプションを指定することで対話モードにできます。
.It Fl n
観察する tty を対話的に変更できなくします。
これは、<control-X> による変更要求と、
現在の tty が閉じられたりあふれを起こした場合の自動プロンプトを、
無効にします。
プロンプトが表示される全ての場合、
.Nm
は終了します。
再接続フラグは、このオプションに影響されません。
本フラグの使用時には、<control-X> はそのまま端末に渡されます。
.It Fl o
あふれが発生した場合、再接続します。
観察している tty があふれた時の
.Nm
の振舞いは、観察している tty が閉じられた時の振舞いに似ています。
詳しい情報は、
.Xr snp 4
を見てください。
.It Fl t
tty の観察を始めた時の日付と時間を表示します。
.It Fl W
観察している tty への書き込みを許可します。
.It Ar tty
tty は、仮想 tty デバイスや仮想コンソールやシリアル線などのように、
tty 形式のデバイスとして指定しなければなりません。
名前には、前に
.Pa /dev/
をつけても構いません。
.El
.Sh 操作
対話的モードで実行中は、全てのユーザの入力は以下のものを除いて、
捨てられます。
.Pp
.Bl -tag -width "XXXX" -compact
.It Sy "<control-G>"
.Nm
の終了。
.It Sy "<control-W>"
画面の消去。
.It Sy "<control-X>"
覗き見る tty の変更が無効化されていなければ、覗き見る tty の変更。
無効化されている場合、control-X は他の制御文字と同様に端末に渡されます。
.El
.Sh 関連項目
.Xr pty 4 ,
.Xr sio 4 ,
.Xr snp 4 ,
.Xr kldload 8
.Sh バグ
端末エミュレーション機能はありません。
全てのユーザの出力はそのままの形で再構成されます。
.Sh 作者
.An Ugen J.S. Antsilevich Aq ugen@NetVision.net.il
.Sh 歴史
.Nm
ユーティリティは、
.Fx 2.1
で、はじめて導入されました。
