freebsd/freebsd-doc/ja_JP.eucJP/man/man8/wicontrol.8
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu> All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/wicontrol/wicontrol.8,v 1.6.2.6 2000/03/06 11:37:29 sheldonh Exp %
.\"
.\" jpman %Id: wicontrol.8,v 1.3 1999/07/31 05:08:56 kuma Stab %
.\"
.Dd April 21, 1999
.Dt WICONTROL 8
.Os FreeBSD 3.0
.Sh 名称
.Nm wicontrol
.Nd WaveLAN/IEEE デバイスの設定
.Sh 書式
.Nm wicontrol
.Fl i Ar iface Op Fl o
.Nm wicontrol
.Fl i Ar iface Fl t Ar tx rate
.Nm wicontrol
.Fl i Ar iface Fl n Ar network name
.Nm wicontrol
.Fl i Ar iface Fl s Ar station name
.Nm wicontrol
.Fl i Ar iface Fl c Ar 0|1
.Nm wicontrol
.Fl i Ar iface Fl q Ar SSID
.Nm wicontrol
.Fl i Ar iface Fl p Ar port type
.Nm wicontrol
.Fl i Ar iface Fl a Ar access point density
.Nm wicontrol
.Fl i Ar iface Fl m Ar mac address
.Nm wicontrol
.Fl i Ar iface Fl d Ar max data length
.Nm wicontrol
.Fl i Ar iface Fl r Ar RTS threshold
.Nm wicontrol
.Fl i Ar iface Fl f Ar frequency
.Nm wicontrol
.Fl i Ar iface Fl P Ar 0|1
.Nm wicontrol
.Fl i Ar iface Fl S Ar max_sleep_duration
.Sh 解説
.Nm
コマンドは、
.Xr wi 4
ドライバを介し、
WaveLAN/IEEE ワイヤレスネットワークデバイスの動作を制御します。
変更可能なほとんどのパラメータは、
WaveLAN が実装している IEEE 802.11 プロトコルに関連するものです。
これに含まれるのは、
ステーション名、
ステーションの動作がアドホック (ポイントツーポイント) と
BBS (サービスセット) のどちらであるか、
BSS モードが有効な場合には加入するサービスセットのネットワーク名 (IBSS)
です。
.Nm
コマンドを使用して、これらのパラメータの現在の設定を見ることができますし、
カードの統計情報カウンタの値をダンプできます。
.Pp
.Nm
に与えられる
.Ar iface
引数は、
WaveLAN/IEEE デバイスに関連付けられる論理インタフェース名であることが必要です
(wi0 や wi1 など)。
.Sh オプション
オプションを示します:
.Bl -tag -width Fl
.It Fl i Ar iface Op Fl o
指定した WaveLAN/IEEE インタフェースの現在の設定を表示します。
現在のカードの設定をドライバから取り出し、表示します。
追加の
.Fl o
フラグを使用すると、
.Nm
は、カードの設定の代りに統計情報カウンタを表示します。
.It Fl i Ar iface Fl t Ar tx rate
指定したインタフェースの転送レートを設定します。
転送レートとしての正当な値は、
インタフェースが標準の WaveLAN/IEEE であるか WaveLAN/IEEE Turbo アダプタ
かによって変わります。
標準の NIC でサポートする最大転送レートは 2Mbps ですが、
ターボ版の NIC では最大速度 6Mbps をサポートします。
次の表は、正当な転送レートの設定と対応する転送速度を示します:
.Bd -filled -offset indent
.Bl -column "TX rate " "NIC speed "
.Em "TX レート	NIC 速度"
1	固定低速 (1Mbps)
2	固定標準速 (2Mbps)
3	自動レート選択 (高速)
4	固定中速 (4Mbps)
5	固定高速 (6Mbps)
6	自動レート選択 (標準)
7	自動レート選択 (中速)
.El
.Ed
.Pp
標準の NIC は 1 から 3 までの設定のみサポートします。
ターボ版の NIC は前述の設定すべてをサポートします。
デフォルトのドライバの設定は 3 (自動レート選択) です。
.It Fl i Ar iface Fl n Ar network name
このステーションが加入を望んでいるサービスセット (IBSS) の名前を設定します。
.Ar network name
は、30 文字までの長さの任意のテキスト文字列です。
デフォルトの名前は文字列 "ANY" であり、
最初に利用可能となったアクセスポイントにステーションが接続することを
許します。
このオプション設定が動作するためには、
.Fl p
フラグを使用して、インタフェースを BSS モードにすることが必要です。
.Pp
注: WaveLAN のマニュアルによると、
空文字列を指定すると
ホストがすべてのアクセスポイントへ接続可能となるとあります。
一方、別のドライバを見たところ、文字列 "ANY" も同様に動作するとありました。
.It Fl i Ar iface Fl s Ar station name
指定したインタフェースの
.Ar station name
を設定します。
.Ar station name
は診断のために使用されます。
Lucent の WaveMANAGER ソフトウェアは、リモートホストの名前を調査可能です。
.It Fl i Ar iface Fl c Ar 0|1
ステーションがサービスセット (IBSS) を作成することを許します。
許される値は、0 (IBSS を作成しません) と 1 (IBSS の作成を有効にします) です。
デフォルトは 0 です。
.Pp
注: このオプションは実験的な目的でのみ提供されています:
ホストシステム上で IBSS の作成を有効にしても、
実際には動作していないようです。
.It Fl i Ar iface Fl q Ar SSID
指定したインタフェース上に作成する IBSS の名前 (SSID) を指定します。
.Ar SSID
は、30 文字までの長さの任意のテキスト文字列です。
.Pp
注: このオプションは実験的な目的でのみ提供されています:
ホストシステム上で IBSS の作成を有効にしても、
実際には動作していないようです。
.It Fl i Ar iface Fl p Ar port type
指定したインタフェースの
.Ar port type
を設定します。
.Ar port type
の正当な値は、1 (BSS モード) と 3 (アドホック) モードです。
アドホックモードでは、
あるステーションは直接電波が届く範囲の他のステーション
(これらもアドホックモードで動作していることが必要です) と直接通信可能です。
BSS モードでは、
アクセスポイントが制御するサービスセットとホストとが関連付けられることが
必要です。
アクセスポイントは、エンドステーション間のトラフィックを中継します。
デフォルトの設定は 3 (アドホックモード) です。
.It Fl i Ar iface Fl a Ar access_point_density
指定したインタフェースの
.Ar access point density
を指定します。
正当な値は、1 (低)、2 (中)、3 (高) です。
この設定は、電波モデムの閾値の設定に影響します。
.It Fl i Ar iface Fl m Ar mac address
指定したインタフェースのステーションアドレスを設定します。
.Ar mac address
は、コロンで区切られる 6 個の 16 進数の連続として指定されます。
例えば 00:60:1d:12:34:56 となります。
これにより、新規アドレスがカード上にプログラムされ、
インタフェースも更新されます。
.It Fl i Ar iface Fl d Ar max_data_length
指定したインタフェースの、送受信フレームサイズの最大を指定します。
.Ar max data length
は、350 から 2304 までの任意の数値です。デフォルトは 2304 です。
.It Fl i Ar iface Fl r Ar RTS threshold
指定したインタフェースの RTS/CTS 閾値を設定します。
これは、RTS/CTS ハンドシェーク境界に使用するバイト数を制御します。
.Ar RTS threshold
は 0 から 2047 までの任意の数値です。デフォルトは 2347 です。
.It Fl i Ar iface Fl f Ar frequency
指定したインタフェースの電波の周波数を設定します。
.Ar frequency
は次の表に示すチャネル ID で指定することが必要です。
利用可能な周波数は、各地の当局によって指定される電波規制に依存します。
既知の規制元としては、
FCC (米国)、ETSI (欧州)、フランス、日本があります。
表中の周波数は Mhz です。
.Bd -filled -offset indent
.Bl -column "チャネル ID " "FCC " "ETSI " "仏 " "日 "
.Em "チャネル ID	FCC	ETSI	仏	日"
1	2412	2412	-	-
2	2417	2417	-	-
3	2422	2422	-	-
4	2427	2427	-	-
5	2432	2432	-	-
6	2437	2437	-	-
7	2442	2442	-	-
8	2447	2447	-	-
9	2452	2452	-	-
10	2457	2457	2457	-
11	2462	2462	2462	-
12	-	2467	2467	-
13	-	2472	2472	-
14	-	-	-	2484
.El
.Ed
.Pp
不正なチャネルを指定すると、NIC はデフォルトチャネルに戻ります。
米国および欧州で販売されている NIC では、デフォルトチャネルは 3 です。
フランスで販売されている NIC では、デフォルトチャネルは 11 です。
日本で販売されている NIC では、利用可能なチャネルは 14 のみです。
2 つのステーションが通信するためには、
同一のチャネルに設定されていることが必要であることに注意してください。
.It Fl i Ar iface Fl P Ar 0|1
指定したインタフェースの電源管理を有効または無効にします。
電源管理を有効にすると、
交互にスリープ/ウェイクプロトコルを使用することにより、
モバイルステーションの省電力を助けます。
このために受信遅延がいくぶん増加します。
デフォルトでは、電源管理はオフです。
電源管理が機能するためには、
アクセスポイントとの協調が必要なことに注意してください。
アドホックモードでは動作しません。
また電源管理がサポートされているのは、
Lucent WavePOINT のバージョン 2.03 以降のファームウェア、
WaveLAN PCMCIA アダプタのバージョン 2.00 以降のファームウェアのみです。
古いリビジョンでは、電源管理の設定は黙って無視されます。
このパラメータにとって正当な値は、0 (オフ) と 1 (オン) です。
.It Fl i Ar iface Fl S Ar max_sleep_interval
電源管理が有効なときに使用するスリープ間隔を指定します。
.Ar max sleep interval
はミリ秒で指定します。デフォルトは 100 です。
.El
.Sh 関連項目
.Xr wi 4 ,
.Xr ifconfig 8
.Sh 歴史
.Nm
コマンドが最初に登場したのは
.Fx 3.0
です。
.Sh 作者
.Nm
コマンドは
.An Bill Paul Aq wpaul@ctr.columbia.edu
が記述しました。
