freebsd/freebsd-doc/ja_JP.eucJP/man/man8/wicontrol.8
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu> All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/wicontrol/wicontrol.8,v 1.37 2003/03/04 14:55:58 imp Exp %
.\"
.\" $FreeBSD$
.\"
.Dd March 4, 2003
.Dt WICONTROL 8
.Os
.Sh 名称
.Nm wicontrol
.Nd WaveLAN/IEEE デバイスの設定
.Sh 書式
.Nm
.Op Fl i
.Ar iface Op Fl o
.Nm
.Op Fl i
.Ar iface Fl t Ar tx_rate
.Nm
.Op Fl i
.Ar iface Fl n Ar network_name
.Nm
.Op Fl i
.Ar iface Fl s Ar station_name
.Nm
.Op Fl i
.Ar iface Fl c Cm 0 | 1
.Nm
.Op Fl i
.Ar iface Fl q Ar SSID
.Nm
.Op Fl i
.Ar iface Fl p Ar port_type
.Nm
.Op Fl i
.Ar iface Fl a Ar access_point_density
.Nm
.Op Fl i
.Ar iface Fl m Ar mac_address
.Nm
.Op Fl i
.Ar iface Fl d Ar max_data_length
.Nm
.Op Fl i
.Ar iface Fl e Cm 0 | 1
.Nm
.Op Fl i
.Ar iface Fl k Ar key
.Op Fl v Cm 1 | 2 | 3 | 4
.Nm
.Op Fl i
.Ar iface Fl T Cm 1 | 2 | 3 | 4
.Nm
.Op Fl i
.Ar iface Fl r Ar RTS_threshold
.Nm
.Op Fl i
.Ar iface Fl f Ar frequency
.Nm
.Op Fl i
.Ar iface Fl P Cm 0 | 1
.Nm
.Op Fl i
.Ar iface Fl S Ar max_sleep_duration
.Nm
.Op Fl i
.Ar iface Fl Z
(zero signal cache)
.Nm
.Op Fl i
.Ar iface Fl C
(display signal cache)
.Nm
.Op Fl i
.Ar iface Fl L
(list avail access points)
.Nm
.Op Fl i
.Ar iface Fl l
(dump associated stations)
.Sh 解説
.Nm
ユーティリティは、
.Xr wi 4
ドライバを介し、
WaveLAN/IEEE ワイヤレスネットワークデバイスの動作を制御します。
.Pp
IEEE 802.11 パラメータの設定にはこのプログラムを使うべきではありません。
これらの目的のためには代りに
.Xr ifconfig 8
を使用してください。
.Pp
.Nm
ユーティリティを使用して、
これらのパラメータの現在の設定を見ることができますし、
カードの統計情報カウンタの値をダンプできます。
.Pp
.Nm
に与えられる
.Ar iface
引数は、
WaveLAN/IEEE デバイスに関連付けられる論理インタフェース名であることが必要です
.Li ( wi0 , wi1
等)。
指定しない場合には
.Dq Li wi0
が仮定されます。
.Sh オプション
オプションを示します:
.Bl -tag -width indent
.It Oo Fl i Oc Ar iface Op Fl o
指定した WaveLAN/IEEE インタフェースの現在の設定を表示します。
現在のカードの設定をドライバから取り出し、表示します。
追加の
.Fl o
フラグを使用すると、
.Nm
は、カードの設定の代りに統計情報カウンタを表示します。
暗号化キーは、
.Nm
が root で実行された場合のみ表示されます。
.It Oo Fl i Oc Ar iface Fl t Ar tx_rate
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq mediaopt
を代わりに使用してください。
.Pp
指定したインタフェースの転送レートを設定します。
転送レートとしての正当な値は、
インタフェースが標準の WaveLAN/IEEE であるか WaveLAN/IEEE Turbo アダプタ
かによって変わります。
標準の NIC でサポートする最大転送レートは 2Mbps ですが、
ターボ版の NIC では最大速度 6Mbps をサポートします。
次の表は、正当な転送レートの設定と対応する転送速度を示します:
.\" Bl -column "TX レート " "NIC 速度 " -offset indent
.Bl -column ".Em TX\ レート " ".Em NIC\ 速度 " -offset indent
.Em "TX レート	NIC 速度"
.It Cm 1 Ta 固定低速 (1Mbps)
.It Cm 2 Ta 固定標準速 (2Mbps)
.It Cm 3 Ta 自動レート選択 (高速)
.It Cm 4 Ta 固定中速 (4Mbps)
.It Cm 5 Ta 固定高速 (6Mbps)
.It Cm 6 Ta 自動レート選択 (標準)
.It Cm 7 Ta 自動レート選択 (中速)
.El
.Pp
デフォルトのドライバの設定は
.Cm 3
(自動レート選択) です。
数値はカードごとに違います。
.It Oo Fl i Oc Ar iface Fl n Ar network_name
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq ssid
か
.Dq nwid
を代りに使用してください。
.Pp
このステーションが加入を望んでいるサービスセット (IBSS) の名前を設定します。
.Ar network_name
は、30 文字までの長さの任意のテキスト文字列です。
デフォルトの名前は文字列
.Dq Li ANY
であり、
最初に利用可能となったアクセスポイントにステーションが接続することを
許します。
このオプション設定が動作するためには、
.Fl p
フラグを使用して、インタフェースを BSS モードにすることが必要です。
.Pp
注: WaveLAN のマニュアルによると、
空文字列を指定すると
ホストがすべてのアクセスポイントへ接続可能となるとあります。
一方、別のドライバを見たところ、文字列
.Dq Li ANY
も同様に動作するとありました。
.It Oo Fl i Oc Ar iface Fl s Ar station_name
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq stationname
か
.Dq station
を代りに使用してください。
.Pp
指定したインタフェースの
ステーション名
を設定します。
.Ar station_name
は診断のために使用されます。
.Tn "Lucent WaveMANAGER"
ソフトウェアは、リモートホストの名前を調査可能です。
.It Oo Fl i Oc Ar iface Fl c Cm 0 | 1
このフラグは廃れたものです。
IBSS モードで IBSS ネットワークをサポートするファームウェアを持つカードでは、
IBSS ネットワークは自動的に作成されます。
.Pp
ステーションがサービスセット (IBSS) を作成することを許します。
許される値は、
.Cm 0
(IBSS を作成しません) と
.Cm 1
(IBSS の作成を有効にします) です。
デフォルトは
.Cm 0
です。
.Pp
注: このオプションは実験的な目的でのみ提供されています:
新しい Lucent ファームウェアのみがこれをサポートします。
.It Oo Fl i Oc Ar iface Fl q Ar SSID
このフラグは廃れたものです。
このパラメータを設定するための現在好まれる方法は、
.Xr ifconfig 8
から ssid を設定です。
.Pp
指定したインタフェース上に作成する IBSS の名前 (SSID) を指定します。
.Ar SSID
は、30 文字までの長さの任意のテキスト文字列です。
.Pp
注: このオプションは実験的な目的でのみ提供されています:
ホストシステム上で IBSS の作成を有効にしても、
実際には動作していないようです。
.It Oo Fl i Oc Ar iface Fl p Ar port_type
このフラグは廃れたものです。
このフラグは使われることはなかったでしょう。
このフラグを使わないでください。
その意味は使用するカードのタイプに依存し、
場合によってはカードにインストールしたファームウェアに依存します。
注意。
危険。
使用禁止。
代りに
.Xr ifconfig 8
の
.Dq media
や
.Dq mediaopt
のコマンドを使用してください。
.Pp
指定したインタフェースの
ポートタイプ
を設定します。
.Ar port type
の正当な値は、
.Cm 1
(BSS モード) と
.Cm 3
(アドホック) モードです。
アドホックモードでは、
あるステーションは直接電波が届く範囲の他のステーション
(これらもアドホックモードで動作していることが必要です) と直接通信可能です。
BSS モードでは、
アクセスポイントが制御するサービスセットとホストとが関連付けられることが
必要です。
アクセスポイントは、エンドステーション間のトラフィックを中継します。
デフォルトの設定は
.Cm 1
(BSS モード) です。
Lucent カードでの意味合いと、
Prism カードでの意味合いと、
Symbol カードでの意味合いはすべて違います。
このフラグを使用しないでください。
.It Oo Fl i Oc Ar iface Fl a Ar access_point_density
指定したインタフェースの
アクセスポイント密度
を指定します。
正当な値は、
.Cm 1
(低)、
.Cm 2
(中)、
.Cm 3
(高) です。
この設定は、電波モデムの閾値の設定に影響します。
.It Oo Fl i Oc Ar iface Fl m Ar mac_address
指定したインタフェースのステーションアドレスを設定します。
.Ar mac_address
は、コロンで区切られる 6 個の 16 進数の連続として指定されます。
例えば
.Dq Li 00:60:1d:12:34:56
となります。
これにより、新規アドレスがカード上にプログラムされ、
インタフェースも更新されます。
.It Oo Fl i Oc Ar iface Fl d Ar max_data_length
指定したインタフェースの、送受信フレームサイズの最大を指定します。
.Ar max_data_length
は、350 から 2304 までの任意の数値です。デフォルトは 2304 です。
.It Oo Fl i Oc Ar iface Fl e Cm 0 | 1
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq wepmode
オプションで置き換えられました。
.Pp
WEP 暗号化を有効化または無効化します。
使用可能な値は
.Cm 0
(暗号化無効) または
.Cm 1
(暗号化有効) です。
暗号化はデフォルトでは無効です。
.Pp
128 ビットおよび 64 ビットの WEP ともに破られています。
詳細は
.Sx バグ
の節を見てください。
.It Oo Fl i Oc Ar iface Fl k Ar key Op Fl v Cm 1 | 2 | 3 | 4
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq wepkey
を代りに使用すべきです。
.Pp
WEP 暗号化キーを設定します。
プログラム可能な暗号化キーは、デフォルトで 4 個あります。
個々のキーは
.Fl v
フラグで設定可能です。
.Fl v
フラグが指定されないと、最初のキーが設定されます。
暗号化キーは、通常テキスト (すなわち
.Dq Li hello )
または一連の 16 進数
(すなわち
.Dq Li 0x1234512345 )
のどちらかです。
WaveLAN Turbo Silver カードでは、キーは 40 ビットに制限されていますので、
キーは 5 文字までのテキスト文字列か 10 桁の 16 進数です。
WaveLAN Turbo Gold カードでは、キーは 104 ビットまでですので、
Silver カードでサポートされている書式に加え、
キーは 13 文字までのテキスト文字列か 26 桁の 16 進数がサポートされます。
最大限の可搬性のためには、16 進数形式の鍵を推奨します。
テキスト鍵から WEP 暗号へのマッピングは、通常、ドライバ固有です。
特に、
.Tn Windows
ドライバのマッピング方法は
.Fx
のものとは異なります。
.Pp
128 ビットおよび 64 ビットの WEP 暗号ともに破られています。
詳細は
.Sx バグ
の節を見てください。
.It Oo Fl i Oc Ar iface Fl T Cm 1 | 2 | 3 | 4
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq weptxkey
を代りに使用すべきです。
.Pp
4 個の WEP 暗号化キーのどれを使用して転送パケットを暗号化するかを指定します。
.Pp
128 ビットおよび 64 ビットの WEP ともに破られています。
詳細は
.Sx バグ
の節を見てください。
.It Oo Fl i Oc Ar iface Fl r Ar RTS_threshold
指定したインタフェースの RTS/CTS 閾値を設定します。
これは、RTS/CTS ハンドシェーク境界に使用するバイト数を制御します。
.Ar RTS_threshold
は 0 から 2347 までの任意の数値です。デフォルトは 2347 です。
.It Oo Fl i Oc Ar iface Fl f Ar frequency
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq channel
を代りに使用してください。
.Pp
指定したインタフェースの電波の周波数を設定します。
.Ar frequency
は次の表に示すチャネル ID で指定することが必要です。
利用可能な周波数は、各地の当局によって指定される電波規制に依存します。
既知の規制元としては、
FCC (米国)、ETSI (欧州)、フランス、日本があります。
表中の周波数は MHz です。
.Bl -column ".Em チャネル ID " ".Em FCC " ".Em ETSI " ".Em 仏 " ".Em 日 " -offset indent
.Em "チャネル ID	FCC	ETSI	仏	日"
.It Cm 1 Ta 2412	2412	-	2412
.It Cm 2 Ta 2417	2417	-	2417
.It Cm 3 Ta 2422	2422	-	2422
.It Cm 4 Ta 2427	2427	-	2427
.It Cm 5 Ta 2432	2432	-	2432
.It Cm 6 Ta 2437	2437	-	2437
.It Cm 7 Ta 2442	2442	-	2442
.It Cm 8 Ta 2447	2447	-	2447
.It Cm 9 Ta 2452	2452	-	2452
.It Cm 10 Ta 2457	2457	2457	2457
.It Cm 11 Ta 2462	2462	2462	2462
.It Cm 12 Ta -	2467	2467	2467
.It Cm 13 Ta -	2472	2472	2472
.It Cm 14 Ta -	-	-	2484
.El
.Pp
不正なチャネルを指定すると、NIC はデフォルトチャネルに戻ります。
米国および欧州で販売されている NIC では、デフォルトチャネルは
.Cm 3
です。
フランスで販売されている NIC では、デフォルトチャネルは
.Cm 11
です。
日本で販売されている NIC では、デフォルトチャネルは
.Cm 14
です。
これは、11Mbps 以前の NIC においては唯一利用可能なチャネルです。
2 つのステーションが通信するためには、
同一のチャネルに設定されていることが必要であることに注意してください。
.It Oo Fl i Oc Ar iface Fl P Cm 0 | 1
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq powersave
を代りに使用すべきです。
.Pp
指定したインタフェースの電源管理を有効または無効にします。
電源管理を有効にすると、
交互にスリープ/ウェイクプロトコルを使用することにより、
モバイルステーションの省電力を助けます。
このために受信遅延がいくぶん増加します。
デフォルトでは、電源管理はオフです。
電源管理が機能するためには、
アクセスポイントとの協調が必要なことに注意してください。
アドホックモードでは動作しません。
また電源管理がサポートされているのは、
Lucent WavePOINT のバージョン 2.03 以降のファームウェア、
WaveLAN PCMCIA アダプタのバージョン 2.00 以降のファームウェアのみです。
古いリビジョンでは、電源管理の設定は黙って無視されます。
このパラメータにとって正当な値は、
.Cm 0 
(オフ) と
.Cm 1
(オン) です。
.It Oo Fl i Oc Ar iface Fl S Ar max_sleep_interval
このフラグは廃れたものです。
.Xr ifconfig 8
の
.Dq powersleep
を代りに使用すべきです。
.Pp
電源管理が有効なときに使用するスリープ間隔を指定します。
.Ar max sleep interval
はミリ秒で指定します。デフォルトは 100 です。
.It Oo Fl i Oc Ar iface Fl Z
.Xr wi 4
ドライバ内部で管理される信号強度キャッシュをクリアします。
.It Oo Fl i Oc Ar iface Fl C
.Xr wi 4
ドライバ内部で管理されるキャッシュされた信号強度情報を表示します。
ドライバは、他のホストから受信するパケットに関し、
信号強度とノイズレベルに関する情報を維持します。
信号強度とノイズレベルの値は dBms の単位で表示されます。
信号品質値は、信号強度からノイズレベルを減じたものです
(すなわち、低ノイズで良い信号の場合、信号品質が向上します)。
.El
.Sh 関連項目
.Xr ipsec 4 ,
.Xr awi 4 ,
.Xr wi 4 ,
.Xr ifconfig 8
.Sh バグ
削除されるべき廃れたフラグが列挙されています。
これらのフラグは将来通告無しに削除されます。
.Pp
WEP 暗号法は破られています。
使用中のキーを、
多くの人が驚くような距離にいるような第三者が回復できてしまいます。
最も基本的で補助的なセキュリティ以外のことには WEP を信用しないでください。
IPSEC がより高度なセキュリティを提供しますので、
可能な限りそちらを使用してください。
アクセスポイントやアクセスポイントを通じて繋がるワイヤレスマシンを
信用しないでください。
なぜなら、これらを通じたトラフィックが妥当であることを、保証できないからです。
MAC アドレスは簡単に偽造できますので、
唯一のアクセス制限には使用しないでください。
.Pp
WEP への攻撃は受動的な攻撃であり、
これにはネットワーク上のパケットを覗き見できることだけが必要です。
受動的な攻撃は思ったよりも遠くからでも可能であり、
ポイントツーポイントアプリケーションで使用される特殊アンテナを使用すれば、
数マイル彼方からでも可能です。
5,000,000 から 6,000,000 のパケットだけで、
攻撃者は 128 ビット WEP ネットワークのキーを回復できてしまいます。
これは非常に多くのパケットのように聞こえますが、経験的には、
部分的に不可がかかったネットワークにおいて、
この量のトラフィックが数時間で生成されてしまいます。
あるキーが損なわれてしまったならば、
唯一の治療手段はこのキーの使用を止め、新しいキーを使用することだけです。
.Pp
この攻撃の詳細は
.Pa http://www.cs.rice.edu/~astubble/wep/wep_attack.html
を見てください。
.Pp
WEP を使わざるを得ない場合、
ランダムのキーバイトを使うべきであり、ASCII 文字に限定すべきではありません。
.Pp
現在のところ信号キャッシュは壊れています。
.Sh 歴史
.Nm
ユーティリティが最初に登場したのは
.Fx 3.0
です。
.Sh 作者
.Nm
ユーティリティは
.An Bill Paul Aq wpaul@ctr.columbia.edu
が記述しました。
