freebsd/freebsd-doc/ja_JP.eucJP/man/man8/wire-test.8
.\"
.\" Copyright (c) 1997-1999 Erez Zadok
.\" Copyright (c) 1990 Jan-Simon Pendry
.\" Copyright (c) 1990 Imperial College of Science, Technology & Medicine
.\" Copyright (c) 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Jan-Simon Pendry at Imperial College, London.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%W% (Berkeley) %G%
.\"
.\" %Id: wire-test.8,v 1.2 1999/01/10 21:54:44 ezk Exp %
.\" %FreeBSD: src/contrib/amd/wire-test/wire-test.8,v 1.3 1999/09/15 05:45:17 obrien Exp %
.\"
.\" jpman %Id: wire-test.8,v 1.3 1999/01/06 00:07:27 jsakai Stab %
.\"
.Dd February 26, 1993
.Dt WIRE-TEST 8
.Os
.Sh 名称
.Nm wire-test
.Nd ネットワークインターフェースとローカルの IP アドレスを調べる
.Sh 書式
.Nm
.Op Ar host
.Sh 解説
.Nm
は
.Nm amd
が最初の 2 つと見なすネットワークインターフェースと、使用する
ネットワーク名/番号、および
.Nm amd
が NFS マウントするのに使う IP アドレスを調べるのに使います。
.\" 査読者注: "network number" を「ネットワークアドレス」と訳すか
.\"   「ネットワーク番号」と訳すか、議論があったが、ここでは
.\"   後者を選択。(cf.[man-jp 1315]からのスレッド)  sakai@jp.freebsd.org
.Pp
.Ar host
が指定された場合には、
.Nm
は現在のクライアントから
.Tn NFS
サーバ
.Ar host
へ使用できる
.Tn NFS
プロトコルとバージョンの組合せを調べます。
指定されない場合の
.Ar host
のデフォルトは、
.Dq localhost
です。
.Sh 関連項目
.Xr amd 8 
.Sh 歴史
.Nm
ユーティリティは
.Fx 3.0
から登場しました。
