freebsd/freebsd-doc/ja_JP.eucJP/man/man8/wlconfig.8
.\" Original Revision: 1.5
.Dd December 26 1996
.Os
.Dt WLCONFIG 8
.Sh 名称
.Nm wlconfig
.Nd wavelan の設定パラメータを読み書きする
.Sh 書式
.Nm wlconfig 
.Ar ifname
.Op Ar param value ...
.Sh 解説
.Nm
コマンドは、NCR/AT&T Wavelan 無線 LAN カードのパラメータを読んだり、
設定したりするのに使うことができます。
カード内の不揮発性パラメータ格納エリア (Parameter Storage Area; PSA)
はこのプログラムで書き換えることができるので、DOS 用の
.Nm instconf.exe
は必要なくなります。また、ドライバに組み込まれたオプションの
信号強度キャッシュを問い合わせるためにも使えます。
.Pp
.Ar ifname
パラメータは wavelan インタフェース名を指定します (例えば
.Pa wl0
)。もしほかに引数がなければ、 PSA の現在の内容が読み込まれ、表示
されます。
.Pp
引数
.Ar param
と
.Ar value
はパラメータの値を変更するために使われます。
.Ar param value
の組はいくつでも指定できます。
.Bl -tag -width 15n -compat -offset indent
.It Va param
.Va value
.It irq
IRQ の値 (リセット後に有効)。 3, 4, 5, 6, 10, 11, 12, 15 のうちの
どれか一つ。
.It mac
固有の MAC の値 (イーサネットアドレス)。
.It macsel
(
.Sq mac
パラメータにより設定される)
.Sq soft
か、(工場で設定される)
.Sq default
のどちらか。
.It nwid
NWID はカードの無線モデムに渡される 2 バイトのパラメータです。
NWID により、同じ空間を共有して複数の論理的に分割された
ネットワークを運用することが可能になります。
異なった NWID を持ったパケットはモデムにより単に無視されます。
ハードウェアでは、NWID は不揮発性のメモリ 
(PSA もしくはプログラム可能な格納エリア; 
programmable storage area と呼ばれます) に長期間保存され、
ドライバが初期化される際にソフトウェアにより無線モデムに
渡されます。
このパラメータはスタートアップ時に渡されるデフォルトの
NWID を設定します。
.It currnwid
現在運用中の NWID を設定します (が、 PSA には保存されません)。
.It cache
ドライバはインタフェース毎に、送信側の MAC アドレスに対応する
「信号の強度、静けさ、品質」関連の固定サイズのキャッシュを維持しています。
入力パケットをキャッシュに格納する際に、パケット受信時に
これらの値を無線モデムから取り出してチェックした上で、
ドライバ内部のキャッシュに格納します。
特定の入ってくるパケットを遮断するのに使うことのできる二つの
sysctl 値 (iponly と multicast only) が存在します。
デフォルトでは、キャッシュの仕組みはユニキャストではない 
IP パケットのみを格納しますが、これは sysctl(8) で変更する
ことができます。
入ってくるパケットのうち遮断されないものはキャッシュを更新するので、
リモートシステムへのアンテナの信号強度をモニタすることができます。
値として指定できるコマンドは三つあります:
.Sq raw
は無線モデムのハードウェア値から生の信号強度データを表示します。
.Sq scale
は生のハードウェア値を 0..100% になるように倍率を調整します。
.Sq zero
は新しいサンプルを得ようとする場合にキャッシュをクリアします。
.El
.Pp
Wavelan カードの IRQ が間違っている場合には、インタフェースが
設定されたとしても機能しないであろうことに注意して下さい。
.Nm
プログラムは正しい値にカードを再設定するよう使われるべきです。
.Sh 使用例
NWID を 0x1234 に設定する :
.Bd -literal -offset
# wlconfig wl0 nwid 0x1234
.Ed
.Pp
現在の設定を表示する :
.Bd -literal -offset
# wlconfig wl0
Board type            : ISA
Base address options  : 0x300, 0x390, 0x3c0, 0x3e0
Waitstates            : 0
Bus mode              : ISA
IRQ                   : 10
Default MAC address   : 08:00:0e:20:3d:4b
Soft MAC address      : 00:00:00:00:00:00
Current MAC address   : Default
Adapter compatability : PC-AT 2.4GHz
Threshold preset      : 1
Call code required    : NO
Subband               : 2425MHz
Quality threshold     : 3
Hardware version      : 0 (Rel1/Rel2)
Network ID enable     : YES
NWID                  : 0xdead
Datalink security     : NO
Databus width         : 16 (variable)
Configuration state   : unconfigured
CRC-16                : 0x3c26
CRC status            : OK
.Pp
信号強度のキャッシュを倍率を調整して表示する :
.Bd -literal -offset
# wlconfig wl0 cache scale
.Ed
.Sh 関連項目
.Xr wl 4 ,
.Xr sysctl 8 .
.Sh 歴史
.Nm
コマンドのこの実装は完全に新規のもので、Hilink Internet のために
.An Michael Smith
により書かれ、
.An Jim Binkley &c
により更新されました。
