freebsd/freebsd-doc/ja_JP.eucJP/man/man8/yp_mkdb.8
.\" Copyright (c) 1995, 1996
.\"	Bill Paul <wpaul@ctr.columbia.edu>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/yp_mkdb/yp_mkdb.8,v 1.12.2.2 2000/12/27 16:23:32 ru Exp %
.\"
.\" jpman %Id: yp_mkdb.8,v 1.3 1997/05/19 17:09:21 horikawa Stab %
.\"
.Dd March 12, 1996
.Dt YP_MKDB 8
.Os
.Sh 名称
.Nm yp_mkdb
.Nd "NIS データベースを作成する"
.Sh 書式
.Nm
.Fl c
.Nm
.Fl u Ar dbname
.Nm
.Op Fl c
.Op Fl b
.Op Fl s
.Op Fl f
.Op Fl i Ar inputfile
.Op Fl o Ar outputfile
.Op Fl d Ar domainname
.Op Fl m Ar mastername
.Ar inputfile
.Ar dbname
.Sh 解説
.Nm
は
.Fx
の NIS サーバが使用する
.Xr db 3
スタイルのデータベースを作成します。
.Nm
はデータを
.Ar inputfile
から読み取り、
そのデータを
.Ar dbname
に
.Xr db 3
フォーマットで書き込みます (ハッシュテーブル法を使用します)。
入力は 'key data' の形式、
すなわち空白で区切られた 2 つの
.Tn ASCII
データフィールドである必要があります。
1 番目のフィールドはキーであるとされ、他は全てデータであるとされます。
通常、データベースが格納されるのは
.Pa /var/yp/[domainname]
です。ここで、
.Ar domainname
はサーバが対象とする NIS ドメイン名です。
.Nm
が起動されるのは、通常
.Pa /var/yp/Makefile
からです。
.Nm
で NIS データベースファイルをダンプし、内容検査を行えます。
セキュリティのため、
.Nm
が作成した全てのデータベースは、所有者のみ読み書き可能です
(通常所有者は root です)。
.Pp
以下のオプションをサポートしています:
.Bl -tag -width indent
.It Fl c
YPPROC_CLEAR リクエストをローカルホスト上の
.Xr ypserv 8
宛に送ることを
.Nm
に指示します。 
このシグナルにより、
サーバはオープンしているデータベースデスクリプタをクローズし、
データベースキャッシュをフラッシュします。
このフラグを単体で使用した場合、
サーバにシグナルを送るだけで他には何もしません。
データベース作成コマンドとともに使用した場合には、
.Nm
は新たなデータベースが成功裏に作成された後にのみシグナルを送ります。
.It Fl b
キーが
.Em YP_INTERDOMAIN
でありデータフィールドが空である特別なエントリの
データベースへの追加を
.Nm
に指示します。
このキーがマップ中に存在すると、
.Xr ypserv 8
における 'マッチ' 手続きの動作が何も言わずに変わります。
(キーにマッチするレコードをサーバが見付けられなかったことにより)
マッチ問い合わせが失敗した場合、
その要求されたマップに
.Em YP_INTERDOMAIN
キーが存在する場合には、
.Xr ypserv 8
は今度はそのエントリが DNS でマッチするか検索します。
この特別な振舞は
.Em hosts
マップだけに適用されることに注意して下さい。
他のマップに
.Fl b
フラグを使用しても効果はありません。
.It Fl s
このフラグは、キーが
.Em YP_SECURE
でありデータフィールドが空である特別なエントリを
データベースに追加するために使用します。
このキーがマップ中にあると、
.Xr ypserv 8
は問い合わせのために用意されたポート以外からの
クライアントからのアクセスを拒否します。
これは主に、特権アクセスのみに制限しなければならない
.Em master.passwd
マップのために使用します。
.It Fl f
このフラグを使用すると、
ソースファイル入力で ``+'' または ``-'' の文字で開始する行をフィルタします。
これらの文字は、
.Pa group ,
.Pa passwd ,
.Pa master.passwd
のマップで特殊な意味を持つため、
これらのマップのキーまたはデータの最初の文字として登場してはなりません。
.Fl f
フラグを使用すると、
``+'' または ``-'' の文字で開始するソース行を
.Nm
は拒否し、捨てた行を表示する警告メッセージを発行します。
.It Fl u Ar dbname
NIS データベースをダンプします('ほどき'ます)。
既に存在する NIS データベースの内容を検査するために使用可能です。
.It Fl i Ar inputfile
NIS マップ作成時に、キーが
.Em YP_INPUT_FILE
であり
.Ar inputfile
がエンコードされた特別なエントリをデータベース中に作成します。
.It Fl o Ar outputfile
NIS マップ作成時に、キーが
.Em YP_OUTPUT_FILE
で
.Ar outputfile
がエンコードされた特別なエントリをデータベース中に作成します。
.It Fl d Ar domainname
NIS マップ作成時に、キーが
.Em YP_DOMAIN_NAME
であり
.Ar domainname
がエンコードされた特別なエントリをデータベース中に作成します。
.It Fl m Ar mastername
NIS マップ作成時に、キーが
.Em YP_MASTER_NAME
であり
.Ar mastername
がエンコードされた特別なエントリをデータベース中に作成します。
データベース中のこのエントリは、
ドメイン中の NIS マスタサーバの名前を判定するために、
様々な NIS ユーティリティからしばしば使用されます。
デフォルトでは、
.Nm
はローカルホストが NIS マスタであるとします;
.Fl m
オプションをすればこのデフォルトを上書きできます。
.El
.Sh 関連ファイル
.Bl -tag -width /var/yp/Makefile -compact
.It Pa /var/yp/Makefile
.Nm
を呼び出し NIS データベースを作成する Makefile
.El
.Sh 関連項目
.Xr db 3 ,
.Xr ypserv 8
.Sh 作者
.An Bill Paul Aq wpaul@ctr.columbia.edu
