freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ypbind.8
.\" Copyright (c) 1991, 1993, 1995
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/ypbind/ypbind.8,v 1.15.2.1 2001/03/06 14:21:49 ru Exp %
.\"
.\" $FreeBSD$
.\"
.Dd April 9, 1995
.Dt YPBIND 8
.Os
.Sh 名称
.Nm ypbind
.Nd "NIS ドメインをバインドするデーモン"
.Sh 書式
.Nm ypbind
.Op Fl ypset
.Op Fl ypsetme
.Op Fl s
.Op Fl m
.Oo
.Fl S
.Sm off
.Ar domainname , server1 , server2 , ...
.Sm on
.Oc
.Sh 解説
.Nm
は NIS バインド情報を管理するプロセスです。
開始時にネットワークブロードキャストを行い、(
.Xr domainname 1
コマンドにより設定された) システムデフォルトドメインに対して
サービスする NIS サーバを探します。
返答を受け取ると、サーバのアドレス等の情報をファイル
.Pa /var/yp/binding
に格納します。
標準 C ライブラリ中の NIS ルーチンは、
NIS リクエストを処理する時にはこのファイルを使用します。
NIS クライアントは複数のドメインにバインドされる事がありうるため、
このようなファイルが複数ある場合があります。
.Pp
バインドされると、
.Nm
は DOMAIN_NONACK リクエストを NIS サーバ宛に 1 分置きに送ります。
リクエストに対する返答が得られない場合、
.Nm
はサーバがもう実行していないものとし、
別サーバにバインドされるまでネットワークブロードキャストを再開します。
.Nm
は、サーバが返答しなかったことを検知するたび
および新たなサーバにバインドされるたび、
警告メッセージを
.Xr syslog 3
の機能を使用して記録します。
.Pp
以下のオプションがサポートされています:
.Bl -tag -width indent
.It Fl ypset
.Xr ypset 8
コマンドを使用し、
指定されたドメインの特定の NIS サーバに
.Nm
を強制的にバインドする事は可能です。
しかし
.Nm
は、正確には誰が要求しているのかを知る事が出来ないため、
YPBINDPROC_SETDOM リクエストをデフォルトでは拒否します。
.Fl ypset
フラグを使用する事により、
.Nm
にあらゆるホストからの YPBINDPROC_SETDOM リクエストを受理させられます。
任意のユーザにより NIS クライアントのバインドがリセットされてしまうという
セキュリティ上の危険がありますので、
このオプションは診断目的および短い期間のみ使用すべきです。
.It Fl ypsetme
これは
.Fl ypset
フラグに似ていますが、YPBINDPROC_SETDOM リクエストがローカルホスト発の場合のみ
処理を許すという点のみ異なります。
.It Fl s
.Nm
を安全モードで実行します:
root 以外により実行されている NIS サーバ
(つまり、特権 TCP ポートを使用していないもの)へのバインドを拒否します。
.It Fl S Xo
.Sm off
.Ar domainname , server1 , server2 , server3 , ...
.Sm on
.Xc
システム管理者は
.Nm
を特定のドメインおよび NIS サーバグループへロック出来ます。
10 サーバまで指定できます。
domain/server 指定においては、コンマの間には空白を入れてはなりません。
このオプションを指定する事により、
ある 1 つのドメインおよび指定されたサーバのうちの 1 つにのみに
システムがバインドされる事を保証できます。
これは NIS サーバであり NIS クライアントでもあるシステムにて有用です:
システムがバインド可能なマシンの限定を、
しばしばセキュリティホールであるとされる
.Fl ypset
や
.Fl ypsetme
といったオプションを指定する必要無く行えます。
指定されるサーバの有効なエントリが、ローカルの
.Pa /etc/hosts
ファイルに存在する必要があります。
ホスト名の代わりに IP アドレスを指定しても構いません。
.Nm
が引数を解釈できない場合、
.Fl S
フラグを無視し、通常の動作を行います。
.Pp
.Nm
は
.Fl S
フラグにより指定されるドメイン名を、システムデフォルトドメインと解釈
することに注意して下さい。
.It Fl m
制限されたモードのサーバリストからのサーバ選択において、
.Nm
にブロードキャストではなく、
「メニーキャスト(many-cast)」を使用させます。
メニーキャストモードでは、制限されたリストで指定されるサーバの
YPPROC_DOMAIN_NONACK 手続きに対して直接通信し、
最も速く返答したサーバに対してバインドします。
NIS サーバがローカルにない NIS クライアントにおいて、
このモードが有用です。
.Fl m
フラグは上述の
.Fl S
フラグと組み合わせてのみ使用可能です (
.Fl S
フラグと組み合わせない場合には効果がありません)。
.El
.Sh 注
.Nm
は 2 番目のドメインのバインドを連続して保持しようとはしません。
2 番目のドメインのサーバが ping に応答しない場合、
.Nm
はあきらめる前に一度だけ新たなサーバを探してブロードキャストします。
クライアントプログラムがバインドされていないドメインを参照しようとした場合、
.Nm
は再度ブロードキャストしようとします。
これとは対称的に、クライアントプログラムが参照していようといまいと、
.Nm
はデフォルトドメインへのバインドを自動的に保持します。
.Sh 関連ファイル
.Bl -tag -width /etc/rc.conf -compact
.It Pa /var/yp/binding/[domainname].[version]
NIS ドメインに関連したバインド情報を保持するファイル。
.It Pa /etc/rc.conf
システムデフォルトのドメインと ypbind 開始オプションを指定する
設定ファイル。
.El
.Sh 関連項目
.Xr domainname 1 ,
.Xr syslog 3 ,
.Xr yp 4 ,
.Xr ypserv 8 ,
.Xr ypset 8
.Sh 作者
.An Theo de Raadt Aq deraadt@fsa.ca
