freebsd/freebsd-doc/ja_JP.eucJP/man/man8/ypinit.8
.\" Copyright (c) 1997
.\" 	Bill Paul <wpaul@ctr.columbia.edu>.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/ypserv/ypinit.8,v 1.4.2.1 1999/08/29 15:49:58 peter Exp %
.\" jpman %Id: ypinit.8,v 1.3 1998/10/10 14:46:05 horikawa Stab %
.\"
.\" WORD: populate 設定する
.\" WORD: export   提供する
.\"
.Dd November 10, 1997
.Dt YPINIT 8
.Os FreeBSD 3.0
.Sh 名称
.Nm ypinit
.Nd NIS データベースの構築とインストールを行なう
.Sh 書式
.Nm ypinit
.Fl m
.Op Ar domainname
.Nm ypinit
.Fl s
.Ar master_server
.Op Ar domainname
.Nm ypinit
.Fl u
.Op Ar domainname
.Sh 解説
.Nm
スクリプトは Network Information Service (NIS) の
マスタあるいはスレーブサーバ上でデータベースを設定します。
.Pp
マスタサーバにおいては、
.Nm
は
.Pa /var/yp/$DOMAINNAME
ディレクトリと
.Pa /var/yp/ypservers
ファイルを作成し、初期 NIS マップ一式を設定するために
.Pa /var/yp/Makefile
を呼び出します。
マップは、
.Xr yp_mkdb 8
コマンドを用いて、ローカルなソースファイルから作成されます。
スクリプトは、
指定されたドメインに対応するサーバのリストの入力をユーザに促します。
このリストは ypservers マップを設定するために使用されます。
.Pp
スレーブサーバにおいては、
.Nm
は
.Pa /var/yp/$DOMAINNAME
を作成し、マスタからの NIS マップのコピーを用いて設定します。
マップはマスタから
.Xr ypxfr 8
コマンドを使用して取得されます。
.Nm
スクリプトは、転送するマップのリストを 2 つの方法のうちの 1 つで取得します。
もしシステムが NIS クライアントとして設定されており
マスタサーバに結ばれているのであれば、
.Nm
は
.Xr ypwhich 1
コマンドを用いてマスタサーバから提供されるマップのリストを得ることができます。
システムが NIS マスタのクライアントとして設定されていない場合には、
.Nm
はハードコードされたマップのリストを用いるため、そのうちのいくつかは
マスタ上には実際には存在したり存在しなかったりするかもしれません。
システム管理者は、必要であればスクリプトを編集して、
マップのリストを変更することができます。あるいは個々のマップを
.Xr ypxfr 8
を用いてマスタから手動で転送することもできます。
.Sh オプション
.Nm
は以下のオプションをサポートしています。
.Bl -tag -width indent
.It Fl m Op Ar domainname
マスタサーバを設定します。デフォルトでは、スクリプトはシステムの
デフォルトドメインに対するサーバとして設定します。ユーザが
.Ar domainname
を明示的に指定することによって、このデフォルトを上書きすることができます。
ローカルファイルをテンプレートとして
.Xr yp_mkdb 8
コマンドを使うことにより、マップは最初から構築されます。
.It Fl s Ar master_server Op Ar domainname
.Ar master_name
をマスタとしてスレーブサーバを設定します。マップは
.Xr ypxfr 8
を用いて
.Ar master_server
からスレーブにコピーされます。
デフォルトでは、スクリプトはシステムの
デフォルトドメインに対するサーバとして設定します。ユーザが
.Ar domainname
を明示的に指定することによって、このデフォルトを上書きすることができます。
.It Fl u Op Ar domainname
マスタサーバ上の ypservers マップを更新します。新しいスレーブがドメインに
追加された時には、そのホスト名を ypservers マップに追加する必要があります。
これによりマスタ上の
.Xr yppush 8
がすべてのスレーブに対して更新を伝播できるようになります。
.Sh 関連ファイル
.Bl -tag -width /var/yp/master.passwd -compact
.It Pa /etc/bootparams
bootparams のソースファイル
.It Pa /etc/ethers
ethers のデータソースファイル
.It Pa /etc/group
group のソースファイル
.It Pa /etc/hosts
ホスト名/IP アドレスのソースファイル
.It Pa /etc/netid
RPC netid のソースファイル
.It Pa /etc/networks
networks のソースファイル
.It Pa /etc/protocols
protocols のソースファイル
.It Pa /etc/publickey
RPC 公開鍵/秘密鍵のソースファイル
.It Pa /etc/services
services データのソースファイル
.It Pa /var/yp/master.passwd
パスワードデータベースのソースファイル
.It Pa /var/yp/netgroup
netgroup データのソースファイル
.It Pa /var/yp/ypservers
ypservers のソースファイル (
.Nm
によって生成されます)
.El
.Sh 関連項目
.Xr yp 4 ,
.Xr mknetid 8 ,
.Xr revnetgroup 8 ,
.Xr yp_mkdb 8 ,
.Xr yppush 8 ,
.Xr ypserv 8 ,
.Xr ypxfr 8
.Sh 歴史
このバージョンの
.Nm
は
.Bx Open
の
.Nm
スクリプトに基づいています。
.Bx Free
においては
.Fx 3.0
から登場しました。
.Sh 作者
オリジナルのスクリプトは
.An Mats O Jansson Aq moj@stacken.kth.se
によって書かれました。
.Bx Free
用に
.An Bill Paul Aq wpaul@ctr.columbia.edu
によって変更されました。
