freebsd/freebsd-doc/ja_JP.eucJP/man/man8/yppoll.8
.\"	%NetBSD: yppoll.8,v 1.4 1997/07/30 22:55:00 jtc Exp %
.\"
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/yppoll/yppoll.8,v 1.4 1999/08/28 01:21:07 peter Exp %
.\" jpman %Id: yppoll.8,v 1.3 1998/10/10 14:46:24 horikawa Stab %
.\"
.Dd October 25, 1994
.Dt YPPOLL 8
.Os
.Sh 名称
.Nm yppoll
.Nd YP サーバから YP マップのバージョンを尋ねる
.Sh 書式
.Nm yppoll
.Op Fl h Ar host
.Op Fl d Ar domain
.Ar mapname
.Sh 解説
.Nm yppoll
は YP サーバプロセスに対して
.Ar mapname
のオーダ番号と、どのホストがマスタサーバなのかを尋ねます。
.Pp
オプションは以下のとおりです。
.Bl -tag -width indent
.It Fl h Ar host
.Ar host
上で動いている YP サーバプロセスに対して 
.Ar mapname
に関する情報を尋ねます。
もし
.Ar host
が指定されなかった場合、調査されるサーバは
.Xr ypwhich 1
によって返されるデフォルトサーバになります。
.It Fl d Ar domain
.Xr domainname 1
によって返されるデフォルトドメインではなく
.Ar domain
YP ドメインを使用します。
.El
.Sh 関連項目
.Xr domainname 1 ,
.Xr ypcat 1 ,
.Xr ypmatch 1 ,
.Xr ypwhich 1 ,
.Xr yp 4 ,
.Xr ypbind 8 ,
.Xr ypset 8
.Sh 作者
.An Theo De Raadt
と
.An John Brezak
