freebsd/freebsd-doc/ja_JP.eucJP/man/man8/zzz.8
.\" Copyright (c) 2003 Nate Lawson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" %FreeBSD: src/usr.sbin/zzz/zzz.8,v 1.2 2003/07/14 18:25:45 hmp Exp %
.\"
.\" $FreeBSD$
.Dd July 13, 2003
.Dt ZZZ 8
.Os
.Sh 名称
.Nm zzz
.Nd ACPI もしくは APM のシステムのサスペンド
.Sh 書式
.Nm
.Sh 解説
.Nm
ユーティリティは、
.Tn ACPI 
もしくは
.Tn APM
のサポートをチェックし、システムを適切にサスペンドします。
.Tn APM
に対しては
.Pp
.Dl apm -z
.Pp
が発行されます。
.Tn ACPI
に対しては、設定されたサスペンド状態が検索され、
それがサポートされているかチェックされ、
.Pp
.Dl acpiconf -s <state>
.Pp
が発行されます。
.Sh 関連項目
.Xr acpi 4 ,
.Xr apm 4 ,
.Xr acpiconf 8 ,
.Xr apm 8
.Sh
このマニュアルページは
.An Nate Lawson Aq njl@FreeBSD.ORG
が書きました。
