Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/fonts/_index.po
Languages: pt_br, ru

source: A description of the various font technologies in FreeBSD, and how to use them with different programs
pt_br: Uma descrição das diversas tecnologias de fontes no FreeBSD e como usá-las com diferentes programas
ru: Обзор технологий шрифтов в FreeBSD и способы их применения в разных программах

source: Fonts and FreeBSD
pt_br: Fontes e FreeBSD
ru: Шрифты и FreeBSD

source: Abstract
pt_br: Resumo
ru: Аннотация

source: This document contains a description of the various font files that may be used with FreeBSD and the syscons driver, X11, Ghostscript and Groff. Cookbook examples are provided for switching the syscons display to 80x60 mode, and for using type 1 fonts with the above application programs.
pt_br: Este documento contém uma descrição dos vários arquivos de fontes que podem ser usados com o FreeBSD e o driver syscons, X11, Ghostscript e Groff. Exemplos de receitas são fornecidos para alternar o display syscons para o modo 80x60 e para usar fontes type 1 com os programas de aplicativos mencionados acima.
ru: Этот документ содержит описание различных файлов шрифтов, которые могут использоваться с FreeBSD и драйвером системной консоли, системой X11, программами Ghostscript и Groff. Даются реально работающие примеры по переключению экрана системной консоли в режим 80x60 и использованию файлов шрифтов формата Type 1 с перечисленными выше прикладными программами.

source: Introduction
pt_br: Introdução
ru: Введение

source: There are many sources of fonts available, and one might ask how they might be used with FreeBSD. The answer can be found by carefully searching the documentation for the component that one would like to use. This is very time consuming, so this tutorial is an attempt to provide a shortcut for others who might be interested.
pt_br: Existem muitas fontes disponíveis e alguém pode perguntar como usá-las com o FreeBSD. A resposta pode ser encontrada pesquisando cuidadosamente a documentação do componente que deseja utilizar. Isso pode ser muito demorado, portanto, este tutorial é uma tentativa de fornecer um atalho para outras pessoas interessadas.
ru: Существует много мест, где можно найти файлы шрифтов, но встает вопрос о возможных способах их использования с FreeBSD. Ответ может быть найден в результате тщательного изучения документации по тем компонентам, которые вы собираетесь использовать. На это тратится очень много времени, и это пособие является попыткой дать готовые ответы для тех, кто заинтересуется такими вопросами.

source: Basic Terminology
pt_br: Terminologia Básica
ru: Основные термины

source: There are many different font formats and associated font file suffixes. A few that will be addressed here are:
pt_br: Existem muitos formatos diferentes de fontes e sufixos de arquivos de fontes associados. Alguns que serão abordados aqui são:
ru: Имеется множество различных форматов файлов шрифтов и соответствующих окончаний имен файлов. Здесь обсуждаются лишь следующие из них:

source: PostScript(R) type 1 fonts. The [.filename]#.pfa# is the __A__scii form and [.filename]#.pfb# the __B__inary form.
pt_br: Fontes PostScript(R) type 1. O arquivo [.filename]#.pfa# é a forma __A__scii e o arquivo [.filename]#.pfb# é a forma __B__inária.
ru: Файлы шрифтов PostScript(R) type 1. Файлы [.filename]#.pfa# являются текстовым (__A__scii) представлением, а [.filename]#.pfb# - двоичным (__B__inary).

source: The font metrics associated with a type 1 font.
pt_br: As métricas da fonte associado com a fonte type 1.
ru: Параметры (метрики) соответствующих шрифтов типа type 1.

source: The printer font metrics associated with a type 1 font.
pt_br: As métricas da fonte para impressora associadas com a fonte type 1.
ru: Метрики для принтеров соответствующих шрифтов типа type 1.

source: A TrueType(R) font
pt_br: Uma fonte TrueType(R)
ru: Файл шрифтов TrueType(R)

source: An indirect reference to a TrueType font (not an actual font)
pt_br: Uma referência indireta para uma fonte TrueType (não é realmente uma fonte)
ru: Неявная ссылка на файл шрифтов TrueType (реальной информации о шрифте здесь не содержится)

source: Bitmapped screen fonts
pt_br: Fontes de tela bitmapped
ru: Файлы экранных шрифтов с побитным представлением

source: The [.filename]#.fot# is used by Windows(R) as sort of a symbolic link to the actual TrueType(R) font ([.filename]#.ttf#) file. The [.filename]#.fon# font files are also used by Windows. I know of no way to use this font format with FreeBSD.
pt_br: O arquivo [.filename]#.fot# é usado pelo Windows(R) como um tipo de link simbólico para o arquivo de fonte TrueType(R) real ([.filename]#.ttf#). Os arquivos de fonte [.filename]#.fon# também são usados pelo Windows. Não conheço uma maneira de usar esse formato de fonte no FreeBSD.
ru: Файлы [.filename]#.fot# используются в Windows(R) в качестве некой символической ссылки на файл со шрифтом в формате TrueType(R) ([.filename]#.ttf#). Файлы шрифтов [.filename]#.fon# также используются в Windows(R). Мне неизвестно, как можно использовать этот формат шрифтов во FreeBSD.

source: What Font Formats Can I Use?
pt_br: Quais Formatos de Fonte eu Posso Utilizar?
ru: Какие форматы файлов шрифтов я могу использовать?

source: Which font file format is useful depends on the application being used. FreeBSD by itself uses no fonts. Application programs and/or drivers may make use of the font files. Here is a small cross reference of application/driver to the font type suffixes:
pt_br: O formato de arquivo de fonte mais adequado depende do aplicativo utilizado. O FreeBSD por si só não utiliza fontes. Programas de aplicativos e/ou drivers podem fazer uso dos arquivos de fonte. Aqui está uma pequena referência cruzada de aplicativos/drivers para os sufixos de tipo de fonte:
ru: То, файл шрифтов какого формата будет полезен, зависит от используемого приложения. Сама по себе FreeBSD шрифтов не использует. Прикладные программы и/или драйверы могут использовать файлы шрифтов. Вот краткий справочник по типам файлов шрифтов и приложениям/драйверам:

source: Application
pt_br: Aplicação
ru: Приложение

source: The [.filename]#.fnt# suffix is used quite frequently. I suspect that whenever someone wanted to create a specialized font file for their application, more often than not they chose this suffix. Therefore, it is likely that files with this suffix are not all the same format; specifically, the [.filename]#.fnt# files used by syscons under FreeBSD may not be the same format as a [.filename]#.fnt# one encounters in the MS-DOS(R)/Windows(R) environment. I have not made any attempt at using other [.filename]#.fnt# files other than those provided with FreeBSD.
pt_br: O sufixo [.filename]#.fnt# é bastante utilizado. Eu suspeito que sempre que alguém quisesse criar um arquivo de fonte especializado para seu aplicativo, na maioria das vezes escolhia esse sufixo. Portanto, é provável que os arquivos com esse sufixo não sejam todos do mesmo formato; especificamente, os arquivos [.filename]#.fnt# usados pelo syscons no FreeBSD podem não ser do mesmo formato que um [.filename]#.fnt# encontrado no ambiente MS-DOS(R)/Windows(R). Não fiz nenhuma tentativa de usar outros arquivos [.filename]#.fnt# além daqueles fornecidos com o FreeBSD.
ru: Окончание [.filename]#.fnt# используется достаточно часто. Я полагаю, что когда кто-нибудь собирается создать файл шрифтов для своего приложения, чаще всего выбирается именно это окончание. Поэтому файлы с таким окончанием не все имеют одинаковый формат; в частности, формат файлов [.filename]#.fnt#, используемых драйвером syscons во FreeBSD, может отличаться от формата файлов [.filename]#.fnt#, встречающихся в MS-DOS(R)/Windows(R). Я даже не пытался использовать другие файлы [.filename]#.fnt#, кроме тех, что поставляются с FreeBSD.

source: Setting a Virtual Console to 80x60 Line Mode
pt_br: Configurando um Console Virtual para o Modo de Linhas 80x60
ru: Настройка виртуальной консоли на режим работы 80x60

source: First, an 8x8 font must be loaded. To do this, [.filename]#/etc/rc.conf# should contain the line (change the font name to an appropriate one for your locale):
pt_br: Primeiramente, uma fonte 8x8 deve ser carregada. Para isso, o arquivo [.filename]#/etc/rc.conf# deve conter a linha (mude o nome da fonte para um apropriado para sua localização):
ru: Во-первых, должен быть загружен шрифт размера 8x8. Для этого файл [.filename]#/etc/rc.conf# должен содержать строчку (измените в ней имя файла со шрифтом на соответствующий вашей локализации):

source: The command to actually switch the mode is man:vidcontrol[1]:
pt_br: O comando para realmente mudar o modo é man:vidcontrol[1]:
ru: Команда для переключения режимов называется man:vidcontrol[1]:

source: Various screen-oriented programs, such as man:vi[1], must be able to determine the current screen dimensions. As this is achieved this through `ioctl` calls to the console driver (such as man:syscons[4]) they will correctly determine the new screen dimensions.
pt_br: Vários programas orientados a tela, como man:vi[1], devem ser capazes de determinar as dimensões atuais da tela. Como isso é alcançado por meio de chamadas `ioctl` para o driver do console (como man:syscons[4]), eles determinarão corretamente as novas dimensões da tela.
ru: Различные программы, ориентированные на работу с экраном, такие, как man:vi[1], должны уметь определять текущие размеры экрана. Так как это делается через вызовы `ioctl` к драйверу консоли (такому, как man:syscons[4]), то размеры будут определяться правильно.

source: To make this more seamless, one can embed these commands in the startup scripts so it takes place when the system boots. To do this is add this line to [.filename]#/etc/rc.conf#.
pt_br: Para tornar isso mais contínuo, é possível incorporar esses comandos nos scripts de inicialização para que ocorram durante a inicialização do sistema. Para fazer isso, adicione esta linha ao arquivo [.filename]#/etc/rc.conf#.
ru: Чтобы это проходило более гладко, можно включить эти команды в скрипты начальной загрузки, чтобы они выполнялись при запуске системы. Чтобы это сделать, добавьте такую строчку в [.filename]#/etc/rc.conf#.

source: References: man:rc.conf[5], man:vidcontrol[1].
pt_br: Referências: man:rc.conf[5], man:vidcontrol[1].
ru: Справочная информация: man:rc.conf[5], man:vidcontrol[1].

source: Using Type 1 Fonts with X11
pt_br: Usando fontes Type 1 com o X11
ru: Использование шрифтов type 1 с системой X11

source: X11 can use either the [.filename]#.pfa# or the [.filename]#.pfb# format fonts. The X11 fonts are located in various subdirectories under [.filename]#/usr/X11R6/lib/X11/fonts#. Each font file is cross referenced to its X11 name by the contents of [.filename]#fonts.dir# in each directory.
pt_br: O X11 pode usar fontes em formato [.filename]#.pfa# ou [.filename]#.pfb#. As fontes X11 estão localizadas em vários subdiretórios em [.filename]#/usr/X11R6/lib/X11/fonts#. Cada arquivo de fonte é cruzado com seu nome X11 pelos conteúdos de [.filename]#fonts.dir# em cada diretório.
ru: X11 может использовать файлы шрифтов в формате [.filename]#.pfa# или [.filename]#.pfb#. Шрифты для X11 располагаются в различных подкаталогах в [.filename]#/usr/X11R6/lib/X11/fonts#. На каждый файл со шрифтом имеется ссылка по его X11-имени в файле [.filename]#fonts.dir# в каждом таком каталоге.

source: There is already a directory named [.filename]#Type1#. The most straight forward way to add a new font is to put it into this directory. A better way is to keep all new fonts in a separate directory and use a symbolic link to the additional font. This allows one to more easily keep track of ones fonts without confusing them with the fonts that were originally provided. For example:
pt_br: Já existe um diretório chamado [.filename]#Type1#. A maneira mais direta de adicionar uma nova fonte é colocá-la neste diretório. Uma maneira melhor é manter todas as novas fontes em um diretório separado e usar um link simbólico para a fonte adicional. Isso permite que você mantenha um controle mais fácil das suas fontes sem confundir com as fontes fornecidas originalmente. Por exemplo:
ru: Существует каталог по имени [.filename]#Type1#. Самым простым способом добавить новый шрифт заключается в помещении его в этот каталог. Но лучше хранить все новые шрифты в отдельном каталоге и использовать символические ссылки для добавляемых шрифтов. Это позволяет легко управлять отдельными добавляемыми шрифтами, не путая их с изначально поставляемыми. Например:

source: Create a directory to contain the font files % mkdir -p /usr/local/share/fonts/type1 % cd /usr/local/share/fonts/type1
pt_br: Crie um diretório para conter os arquivos de fonte % mkdir -p /usr/local/share/fonts/type1 % cd /usr/local/share/fonts/type1
ru: Создаем каталог для файлов шрифтов % mkdir -p /usr/local/shared/fonts/type1 % cd /usr/local/shared/fonts/type1

source: Place the .pfa, .pfb and .afm files here
pt_br: Coloque aqui os arquivos .pfa, .pfb e .afm
ru: Помещаем сюда файлы .pfa, .pfb и .afm

source: One might want to keep readme files, and other documentation
pt_br: Pode ser desejável manter arquivos readme e outras documentações
ru: Кому-то может потребоваться хранить здесь также

source: for the fonts here also % cp /cdrom/fonts/atm/showboat/showboat.pfb . % cp /cdrom/fonts/atm/showboat/showboat.afm .
pt_br: para as fontes aqui também % cp /cdrom/fonts/atm/showboat/showboat.pfb . % cp /cdrom/fonts/atm/showboat/showboat.afm .
ru: cопроводительные файлы и документацию к шрифтам % cp /cdrom/fonts/atm/showboat/showboat.pfb . % cp /cdrom/fonts/atm/showboat/showboat.afm .

source: Maintain an index to cross reference the fonts % echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat >>INDEX
pt_br: Mantenha um índice para cruzar as fontes de referência. % echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat >>INDEX
ru: Обновление индексного файла со ссылками на файлы шрифтов % echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat >>INDEX

source: Now, to use a new font with X11, one must make the font file available and update the font name files. The X11 font names look like:
pt_br: Agora, para usar uma nova fonte com o X11, é necessário tornar o arquivo de fonte disponível e atualizar os arquivos de nome de fonte. Os nomes das fontes X11 se parecem com:
ru: Теперь, чтобы использовать новый шрифт с X11, нужно дать доступ к файлу шрифтов и обновить файлы и именами шрифтов. Имена шрифтов в X11 выглядят следующим образом:

source: A new name needs to be created for each new font. If you have some information from the documentation that accompanied the font, then it could serve as the basis for creating the name. If there is no information, then you can get some idea by using man:strings[1] on the font file. For example:
pt_br: Um novo nome precisa ser criado para cada nova fonte. Se você tiver alguma informação da documentação que acompanha a fonte, ela pode servir como base para criar o nome. Se não houver informações disponíveis, você pode ter uma ideia usando o comando man:strings[1] no arquivo de fonte. Por exemplo:
ru: Для каждого нового файла шрифтов необходимо создать новое имя. Если у вас есть какая-либо информация из сопроводительной документации к шрифту, то она может служить основой для создания имени. Если информации нет, то можно получить некоторую информацию от использования программы man:strings[1] над файлом шрифта. Например:

source: Using this information, a possible name might be:
pt_br: Usando essas informações, um possível nome poderia ser:
ru: Пользуясь этой информацией, можно составить возможное имя:

source: The components of our name are:
pt_br: Os componentes do nosso nome são:
ru: Компонентами нашего имени являются:

source: Foundry
pt_br: Companhia

source: Lets just name all the new fonts `type1`.
pt_br: Vamos apenas nomear todas as novas fontes como `type1`.
ru: Давайте называть все новые шрифты `type1`.

source: Family
pt_br: Família

source: The name of the font.
pt_br: O nome da fonte.
ru: Имя шрифта.

source: Weight
pt_br: Densidade

source: Normal, bold, medium, semibold, etc. From the man:strings[1] output above, it appears that this font has a weight of __medium__.
pt_br: Normal, negrito (bold), médio (medium), seminegrito (semibold), etc. Pelos resultados do comando man:strings[1] mostrados acima, parece que esta fonte tem um peso __médio__ (medium).
ru: Normal, bold, medium, semibold, и так далее. Из результата работы команды man:strings[1] похоже, что этот шрифт имеет ширину __medium__.

source: Slant
pt_br: Inclinação

source: __r__oman, __i__talic, __o__blique, etc. Since the _ItalicAngle_ is zero, _roman_ will be used.
pt_br: __r__omano (roman), __i__talico (italic), __o__blíquo (oblique), etc. Já que o ângulo de itálico (_ItalicAngle_) é zero, será usada a versão romana (_roman_).
ru: __r__oman, __i__talic, __o__blique, и так далее. Так как _ItalicAngle_ равен нулю, то будет использоваться __roman__.

source: Width
pt_br: Largura

source: Normal, wide, condensed, extended, etc. Until it can be examined, the assumption will be __normal__.
pt_br: Normal, ampla (wide), condensada (condensed), estendida (extended), etc. Até que possa ser examinada, a suposição será de que a fonte é __normal__.
ru: Normal, wide, condensed, extended, и так далее. Пока это не будет проверено, предполагаем __normal__.

source: Additional style
pt_br: Estilo Adicional
ru: Дополнительный стиль

source: Usually omitted, but this will indicate that the font contains decorative capital letters.
pt_br: Frequentemente omitido, mas isso indicará que a fonte possui letras maiúsculas decorativas.
ru: Обычно опускается, но он будет указывать, что в шрифте есть декоративные заглавные буквы.

source: Spacing
pt_br: Espaçamento

source: proportional or monospaced. _Proportional_ is used since _isFixedPitch_ is false.
pt_br: Proporcional (proportional) ou espaçamento fixo (monospaced). Será usada a versão _proporcional_, já que o valor de _isFixedPitch_ é falso.
ru: proportional или monospaced. Используется __proportional__, потому что _isFixedPitch_ равен false.

source: All of these names are arbitrary, but one should strive to be compatible with the existing conventions. A font is referenced by name with possible wild cards by an X11 program, so the name chosen should make some sense. One might begin by simply using
pt_br: Todos esses nomes são arbitrários, mas deve-se procurar ser compatível com as convenções existentes. Uma fonte é referenciada pelo nome, com possíveis curingas (wildcards) por um programa X11, então o nome escolhido deve fazer algum sentido. Pode-se começar simplesmente usando
ru: Все эти имена произвольны, но нужно стараться следовать существующим соглашениям. В программе для X11 на шрифт ссылаются по имени с применением шаблонов, так что в выбираемом имени это должно учитываться. Можно начать с простого использования

source: as the name, and then use man:xfontsel[1] to examine it and adjust the name based on the appearance of the font.
pt_br: esse nome, e depois usar o comando man:xfontsel[1] para examiná-lo e ajustar o nome com base na aparência da fonte.
ru: в качестве имени, а затем использовать man:xfontsel[1] для его проверки и изменения имени на основе того, как выглядит шрифт.

source: So, to complete our example:
pt_br: Então, para completar nosso exemplo:
ru: Итак, завершая наш пример:

source: Make the font accessible to X11 % cd /usr/X11R6/lib/X11/fonts/Type1 % ln -s /usr/local/share/fonts/type1/showboat.pfb .
pt_br: Torne a fonte acessível ao X11. % cd /usr/X11R6/lib/X11/fonts/Type1 % ln -s /usr/local/share/fonts/type1/showboat.pfb .
ru: Делаем шрифт доступным для X11 % cd /usr/X11R6/lib/X11/fonts/Type1 % ln -s /usr/local/shared/fonts/type1/showboat.pfb .

source: Edit fonts.dir and fonts.scale, adding the line describing the font and incrementing the number of fonts which is found on the first line. % ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq
pt_br: Edite o arquivo fonts.dir e fonts.scale, adicionando a linha que descreve a fonte e incrementando o número de fontes que é encontrado na primeira linha. % ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq
ru: Редактируем файлы fonts.dir and fonts.scale, добавляя строку, описывающую шрифт и увеличивая количество шрифтов в первой строке. % ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq

source: fonts.scale seems to be identical to fonts.dir... % cp fonts.dir fonts.scale
pt_br: O arquivo fonts.scale parece ser idêntico ao fonts.dir... % cp fonts.dir fonts.scale
ru: fonts.scale идентичен fonts.dir... % cp fonts.dir fonts.scale

source: Tell X11 that things have changed % xset fp rehash
pt_br: Informe ao X11 que as coisas mudaram. % xset fp rehash
ru: Указываем X11, что произошли изменения % xset fp rehash

source: Examine the new font % xfontsel -pattern -type1-*
pt_br: Examine a nova fonte % xfontsel -pattern -type1-*
ru: Проверяем новый шрифт % xfontsel -pattern -type1-*

source: References: man:xfontsel[1], man:xset[1], The X Windows System in a Nutshell, http://www.ora.com/[O'Reilly & Associates].
pt_br: Referências: man:xfontsel[1], man:xset[1], The X Windows System in a Nutshell, http://www.ora.com/[O'Reilly & Associates].
ru: Справочная информация: man:xfontsel[1], man:xset[1], The X Windows System in a Nutshell, http://www.ora.com/[O'Reilly & Associates].

source: Using Type 1 Fonts with Ghostscript
pt_br: Usando Fontes Type 1 com Ghostscript
ru: Использование шрифтов type 1 с пакетом Ghostscript

source: Ghostscript references a font via its [.filename]#Fontmap#. This must be modified in a similar way to the X11 [.filename]#fonts.dir#. Ghostscript can use either the [.filename]#.pfa# or the [.filename]#.pfb# format fonts. Using the font from the previous example, here is how to use it with Ghostscript:
pt_br: O Ghostscript referencia uma fonte por meio de seu arquivo [.filename]#Fontmap#. Este arquivo deve ser modificado de maneira semelhante ao arquivo [.filename]#fonts.dir# do X11. O Ghostscript pode usar fontes em formato [.filename]#.pfa# ou [.filename]#.pfb#. Usando a fonte do exemplo anterior, aqui está como usá-la com o Ghostscript:
ru: Ghostscript ссылается на шрифт через свой файл [.filename]#Fontmap#. Он должен быть подправлен так же, как и файл [.filename]#fonts.dir# в случае X11. Ghostscript может использовать файлы шрифтов в форматах [.filename]#.pfa# или [.filename]#.pfb#. Взяв шрифт из предыдущего примера, его можно использовать с Ghostscript вот так:

source: Put the font in Ghostscript's font directory % cd /usr/local/share/ghostscript/fonts % ln -s /usr/local/share/fonts/type1/showboat.pfb .
pt_br: Coloque a fonte no diretório de fontes do Ghostscript. % cd /usr/local/share/ghostscript/fonts % ln -s /usr/local/share/fonts/type1/showboat.pfb .
ru: Помещаем файл со шрифтом в каталог со шрифтами Ghostscript % cd /usr/local/shared/ghostscript/fonts % ln -s /usr/local/shared/fonts/type1/showboat.pfb .

source: Edit Fontmap so Ghostscript knows about the font % cd /usr/local/share/ghostscript/4.01 % ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq
pt_br: Edite o arquivo Fontmap para que o Ghostscript saiba sobre a fonte % cd /usr/local/share/ghostscript/4.01 % ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq
ru: Редактируем Fontmap, чтобы Ghostscript знал о шрифте % cd /usr/local/shared/ghostscript/4.01 % ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq
