Repository: freebsd/freebsd-doc
Catalog: documentation/content/*/articles/fonts/_index.po
Languages: pt_br, ru

source: Use Ghostscript to examine the font % gs prfont.ps Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS>Showboat DoFont Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< GS>quit
pt_br: Use o Ghostscript para examinar a fonte. % gs prfont.ps Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS>Showboat DoFont Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< GS>quit
ru: Используем Ghostscript для проверки шрифта % gs prfont.ps Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS>Showboat DoFont Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< GS>quit

source: References: [.filename]#fonts.txt# in the Ghostscript 4.01 distribution
pt_br: Referências: arquivo [.filename]#fonts.txt# na distribuição do Ghostscript 4.01
ru: Справочная информация: [.filename]#fonts.txt# из дистрибутива Ghostscript 4.01

source: Using Type 1 Fonts with Groff
pt_br: Usando Fontes Type 1 com o Groff
ru: Использование шрифтов в формате type 1 с программой Groff

source: Now that the new font can be used by both X11 and Ghostscript, how can one use the new font with groff? First of all, since we are dealing with type 1 PostScript(R) fonts, the groff device that is applicable is the _ps_ device. A font file must be created for each font that groff can use. A groff font name is just a file in [.filename]#/usr/share/groff_font/devps#. With our example, the font file could be [.filename]#/usr/share/groff_font/devps/SHOWBOAT#. The file must be created using tools provided by groff.
pt_br: Agora que a nova fonte pode ser usada tanto pelo X11 quanto pelo Ghostscript, como se pode usá-la com o groff? Em primeiro lugar, uma vez que estamos lidando com fontes PostScript(R) type 1, o dispositivo groff que é aplicável é o dispositivo _ps_. Um arquivo de fonte deve ser criado para cada fonte que o groff possa usar. Um nome de fonte groff é apenas um arquivo em [.filename]#/usr/share/groff_font/devps#. Em nosso exemplo, o arquivo de fonte poderia ser [.filename]#/usr/share/groff_font/devps/SHOWBOAT#. O arquivo deve ser criado usando ferramentas fornecidas pelo groff.
ru: Теперь, когда новый шрифт может быть использован как с X11, так и в Ghostscript, как использовать его с программой Groff? Во-первых, так как мы имеем дело со PostScript(R)-шрифтами формата type 1, то подходящим устройством Groff является __ps__. Для каждого шрифта, который может использоваться программой Groff, должен быть создан файл шрифта. Имя шрифта для Groff является просто именем файла из каталога [.filename]#/usr/shared/groff_font/devps#. В нашем примере файлом шрифта может быть [.filename]#/usr/shared/groff_font/devps/SHOWBOAT#. Файл должен быть создан с помощью утилит, поставляемых с программой Groff.

source: The first tool is `afmtodit`. This is not normally installed, so it must be retrieved from the source distribution. I found I had to change the first line of the file, so I did:
pt_br: A primeira ferramenta é `afmtodit`. Ela não costuma ser instalada por padrão, então é necessário obtê-la da distribuição de origem. Descobri que precisei alterar a primeira linha do arquivo, então fiz o seguinte:
ru: Первой утилитой является `afmtodit`. Обычно она не устанавливается, так что она должна быть получена из дистрибутива с исходными текстами. Я обнаружил, что нужно изменить первую строку файла, что я делал так:

source: This tool will create the groff font file from the metrics file ([.filename]#.afm# suffix.) Continuing with our example:
pt_br: Essa ferramenta criará o arquivo de fonte do groff a partir do arquivo de métricas (sufixo [.filename]#.afm#). Continuando com nosso exemplo:
ru: Эта утилита создаст файл шрифтов для Groff из файла метрик (с окончанием [.filename]#.afm#). Продолжая с нашим примером:

source: Many .afm files are in Mac format... ^M delimited lines We need to convert them to UNIX(R) style ^J delimited lines % cd /tmp % cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' >showboat.afm
pt_br: Muitos arquivos .afm estão no formato Mac, com linhas delimitadas por ^M. É necessário convertê-los para o estilo UNIX(R), com linhas delimitadas por ^J. % cd /tmp % cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' >showboat.afm
ru: Многие файлы .afm в формате Mac ... строки разделены символом ^M. Нам нужно преобразовать их в разделитель ^J в стиле UNIX(R) % cd /tmp % cat /usr/local/shared/fonts/type1/showboat.afm | tr '\015' '\012' >showboat.afm

source: Now create the groff font file % cd /usr/share/groff_font/devps % /tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT
pt_br: Agora crie o arquivo de fonte do groff. % cd /usr/share/groff_font/devps % /tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT
ru: Теперь создаем файл шрифтов groff % cd /usr/share/groff_font/devps % /tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT

source: The font can now be referenced with the name SHOWBOAT.
pt_br: A fonte agora pode ser referenciada pelo nome SHOWBOAT.
ru: Теперь к шрифту можно обращаться по имени SHOWBOAT.

source: If Ghostscript is used to drive the printers on the system, then nothing more needs to be done. However, if true PostScript(R) printers are used, then the font must be downloaded to the printer in order for the font to be used (unless the printer happens to have the showboat font built in or on an accessible font disk.) The final step is to create a downloadable font. The `pfbtops` tool is used to create the [.filename]#.pfa# format of the font, and [.filename]#download# is modified to reference the new font. The [.filename]#download# must reference the internal name of the font. This can easily be determined from the groff font file as illustrated:
pt_br: Se o Ghostscript for usado para controlar as impressoras no sistema, então nada mais precisa ser feito. No entanto, se forem usadas impressoras PostScript(R) reais, a fonte deve ser baixada para a impressora para que a fonte seja usada (a menos que a impressora tenha a fonte showboat incorporada ou em um disco de fonte acessível). O último passo é criar uma fonte transferível. A ferramenta `pfbtops` é usada para criar o formato [.filename]#.pfa# da fonte, e o arquivo [.filename]#download# é modificado para referenciar a nova fonte. O arquivo [.filename]#download# deve fazer referência ao nome interno da fonte. Isso pode ser facilmente determinado a partir do arquivo de fonte do groff, como ilustrado:
ru: Если в системе для управления принтерами используется программа Ghostscript, то больше ничего делать не нужно. Однако, если используются настоящие PostScript(R)-принтеры, то для использования шрифта его нужно загрузить в принтер (если только в принтере шрифт showboat не встроен или не имеется на диске со шрифтами). Последний шаг заключается в создании загружаемого шрифта. Утилита `pfbtops` используется для создания шрифта в формате [.filename]#.pfa#, а файл для [.filename]#загрузки# изменяется для указания нового шрифта. Файл для [.filename]#загрузки# должен ссылаться на внутреннее имя шрифта. Оно может быть легко определено из файла шрифтов groff, как это показывается здесь:

source: Create the .pfa font file % pfbtops /usr/local/share/fonts/type1/showboat.pfb >showboat.pfa
pt_br: Crie o arquivo de fonte .pfa. % pfbtops /usr/local/share/fonts/type1/showboat.pfb >showboat.pfa
ru: Создание файла шрифта .pfa % pfbtops /usr/local/share/fonts/type1/showboat.pfb >showboat.pfa

source: Of course, if [.filename]#.pfa# is already available, just use a symbolic link to reference it.
pt_br: Claro, se o arquivo [.filename]#.pfa# já estiver disponível, basta usar um link simbólico para fazer referência a ele.
ru: Конечно, если файл [.filename]#.pfa# уже имеется, для его использования создаем символическую ссылку на него.

source: Get the internal font name % fgrep internalname SHOWBOAT internalname Showboat Tell groff that the font must be downloaded % ex download :$a Showboat showboat.pfa . :wq
pt_br: Obtenha o nome interno da fonte % fgrep internalname SHOWBOAT internalname Showboat Informe ao groff que a fonte deve ser baixada. % ex download :$a Showboat showboat.pfa . :wq
ru: Получение внутреннего имени шрифта % fgrep internalname SHOWBOAT internalname Showboat Указываем утилите groff, что шрифт должен быть загружен % ex download :$a Showboat showboat.pfa . :wq

source: To test the font:
pt_br: Para testar a fonte:
ru: Для тестирования шрифта:

source: % cd /tmp % cat >example.t <<EOF .sp 5 .ps 16 This is an example of the Showboat font: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R To use it for the first letter of a paragraph, it will look like: .sp 50p \s(48\f5H\s0\fRere is the first sentence of a paragraph that uses the showboat font as its first letter. Additional vertical space must be used to allow room for the larger letter. EOF % groff -Tps example.t >example.ps
pt_br: % cd /tmp % cat >exemplo.t <<EOF .sp 5 .ps 16 Este é um exemplo da fonte Showboat: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R Para usá-lo como a primeira letra de um parágrafo, ficará assim: .sp 50p \s(48\f5H\s0\fRqui está a primeira frase de um parágrafo que usa a fonte showboat como a primeira letra. Deve-se usar espaço vertical adicional para permitir espaço para a letra maior. EOF % groff -Tps example.t > exemplo.ps

source: To use ghostscript/ghostview % ghostview example.ps
pt_br: Para usar o ghostscript/ghostview % ghostview example.ps
ru: Для использования с ghostscript/ghostview % ghostview example.ps

source: To print it % lpr -Ppostscript example.ps
pt_br: Para imprimir: % lpr -Ppostscript example.ps
ru: Для его печати % lpr -Ppostscript example.ps

source: References: [.filename]#/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man#, man:groff_font[5], man:groff_char[7], man:pfbtops[1].
pt_br: Referências: [.filename]#/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man#, man:groff_font[5], man:groff_char[7], man:pfbtops[1].
ru: Справочная информация: [.filename]#/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man#, man:groff_font[5], man:groff_char[7], man:pfbtops[1].

source: Converting TrueType Fonts to a groff/PostScript Format For groff
pt_br: Convertendo Fontes TrueType para um Formato groff/PostScript para o Groff
ru: Преобразование файлов шрифтов TrueType в формат groff/PostScript для использования с groff

source: This potentially requires a bit of work, simply because it depends on some utilities that are not installed as part of the base system. They are:
pt_br: Isso pode requerer um pouco de trabalho, simplesmente porque depende de algumas ferramentas que não são instaladas como parte do sistema base. Elas são:
ru: Потенциально это требует некоторых усилий, просто потому что зависит некоторых утилит, которые в качестве части системы не устанавливаются. Это:

source: TrueType to PostScript conversion utilities. This allows conversion of a TrueType font to an ascii font metric ([.filename]#.afm#) file.
pt_br: Utilitários de conversão de TrueType para PostScript. Isso permite a conversão de uma fonte TrueType para um arquivo de métricas de fonte ascii ([.filename]#.afm#).
ru: Утилита для преобразования TrueType в PostScript. Она позволяет преобразовать шрифт TrueType в метрику шрифта в текстовом формате (файл [.filename]#.afm#).

source: Currently available at http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/[http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/]. Note: These files are PostScript programs and must be downloaded to disk by holding down kbd:[Shift] when clicking on the link. Otherwise, your browser may try to launch ghostview to view them.
pt_br: Disponível atualmente em http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/[http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/]. Observe: esses arquivos são programas PostScript e devem ser baixados para o disco mantendo pressionada a tecla kbd:[Shift] ao clicar no link. Caso contrário, o seu navegador pode tentar abrir o ghostview para visualizá-los.
ru: Доступна по адресу http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/[http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/]. Замечание: Эти файлы являются PostScript-программами и должны быть скачаны на диск щелчком на ссылке при нажатой клавише kbd:[Shift]. В противном случае для их просмотра ваш браузер может попытаться запустить программу ghostview.

source: The files of interest are:
pt_br: Os arquivos de interesse são:
ru: Интерес представляют следующие файлы:

source: The funny upper/lower case is due to their being intended also for DOS shells. [.filename]#ttf2pf.ps# makes use of the others as upper case, so any renaming must be consistent with this. (Actually, [.filename]#GS_TTF.PS# and [.filename]#PFS2AFM.PS# are supposedly part of the Ghostscript distribution, but it is just as easy to use these as an isolated utility. FreeBSD does not seem to include the latter.) You also may want to have these installed to [.filename]#/usr/local/share/groff_font/devps#(?).
pt_br: A utilização de letras maiúsculas e minúsculas engraçadas deve-se ao fato de serem destinadas também para shells do DOS. O arquivo [.filename]#ttf2pf.ps# faz uso dos outros em letras maiúsculas, então qualquer renomeação deve ser consistente com isso. (Na verdade, os arquivos [.filename]#GS_TTF.PS# e [.filename]#PFS2AFM.PS# supostamente fazem parte da distribuição do Ghostscript, mas é fácil usá-los como uma fonte isolada. O FreeBSD não parece incluir o último.) Você também pode querer tê-los instalados em [.filename]#/usr/local/share/groff_font/devps#(?).
ru: Смесь верхнего/нижнего регистров присутствует из-за того, что эти файлы предназначены и для DOS. [.filename]#ttf2pf.ps# использует остальные с именами в верхнем регистре, так что при переименовании это нужно учитывать. (На самом деле [.filename]#GS_TTF.PS# и [.filename]#PFS2AFM.PS# предположительно являются частью дистрибутива Ghostscript, но их легко использовать как отдельные утилиты. В поставку FreeBSD они не включены.) Вы можете также установить их в каталог [.filename]#/usr/local/shared/groff_font/devps#(?).

source: Creates font files for use with groff from ascii font metrics file. This usually resides in the directory, [.filename]#/usr/src/contrib/groff/afmtodit#, and requires some work to get going.
pt_br: A ferramenta `afmtodit` é utilizada para criar arquivos de fonte para o groff a partir de um arquivo métrico de fonte em formato ASCII ([.filename]#.afm#). Normalmente, essa ferramenta está localizada no diretório [.filename]#/usr/src/contrib/groff/afmtodit#, mas normalmente exige alguma configuração para funcionar corretamente.
ru: Создает файлы шрифтов для использования с программой Groff из текстовых файлов с метриками шрифта. Она обычно располагается в каталоге [.filename]#/usr/src/contrib/groff/afmtodit# и для ее использования требуется проделать некоторую работу.

source: If you are paranoid about working in the [.filename]#/usr/src# tree, simply copy the contents of the above directory to a work location.
pt_br: Se você está preocupado com a segurança de trabalhar no diretório [.filename]#/usr/src#, basta copiar o conteúdo do diretório acima para uma localização de trabalho.
ru: Если вы избегаете работать в дереве [.filename]#/usr/src#, просто скопируйте содержимое вышеупомянутого каталога во временный рабочий каталог.

source: In the work area, you will need to make the utility. Just type:
pt_br: Na área de trabalho, você precisará compilar o utilitário. Apenas digite:
ru: Во рабочем каталоге вам нужно построить утилиту. Просто введите такую команду:

source: You may also need to copy [.filename]#/usr/contrib/groff/devps/generate/textmap# to [.filename]#/usr/share/groff_font/devps/generate# if it does not already exist.
pt_br: Você também pode precisar copiar o arquivo [.filename]#/usr/contrib/groff/devps/generate/textmap# para [.filename]#/usr/share/groff_font/devps/generate# se ele ainda não existir.
ru: Вам может также потребоваться скопировать [.filename]#/usr/contrib/groff/devps/generate/textmap# в [.filename]#/usr/shared/groff_font/devps/generate#, если его не существует.

source: Once all these utilities are in place, you are ready to commence:
pt_br: Depois que todos esses utilitários estiverem no lugar, você está pronto para começar:
ru: Как только эти утилиты готовы, вы можете начать:

source: Create [.filename]#.afm# by typing:
pt_br: Crie o arquivo [.filename]#.afm# digitando:
ru: Создайте файл [.filename]#.afm# по такой команде:

source: Where, _TTF_name_ is your TrueType font file, _PS_font_name_ is the file name for [.filename]#.pfa#, _AFM_name_ is the name you wish for [.filename]#.afm#. If you do not specify output file names for the [.filename]#.pfa# or [.filename]#.afm# files, then default names will be generated from the TrueType font file name.
pt_br: Onde _TTF_nome_ é o nome do arquivo da sua fonte TrueType, _nome_fonte_PS_ é o nome do arquivo para [.filename]#.pfa#, _nome_AFM_ é o nome desejado para [.filename]#.afm#. Se você não especificar os nomes de arquivo de saída para os arquivos [.filename]#.pfa# ou [.filename]#.afm#, então nomes padrão serão gerados a partir do nome do arquivo da fonte TrueType.
ru: Здесь _TTF_name_ обозначает ваш файл со шрифтом TrueType, _PS_font_name_ является именем для файла [.filename]#.pfa#, _AFM_name_ задает имя для файла [.filename]#.afm#. Если вы не укажете имена выходных файлов, для форматов [.filename]#.pfa# или [.filename]#.afm#, то по умолчанию будут использоваться имена, получаемые из имени файла со шрифтом TrueType.

source: This also produces a [.filename]#.pfa#, the ascii PostScript font metrics file ([.filename]#.pfb# is for the binary form). This will not be needed, but could (I think) be useful for a fontserver.
pt_br: Isso também produz um arquivo [.filename]#.pfa#, o arquivo de métricas de fonte PostScript em formato ASCII ([.filename]#.pfb# é para a forma binária). Isso não será necessário, mas poderia (eu acredito) ser útil para um servidor de fontes.
ru: При этом также будет создан файл [.filename]#.pfa#, текстовый файл с метриками PostScript-шрифта (([.filename]#.pfb# для двоичного представления). Это не будет обязательно, но может быть (я думаю) полезным для сервера шрифтов.

source: For example, to convert the 30f9 Barcode font using the default file names, use the following command:
pt_br: Por exemplo, para converter a fonte de código de barras 30f9 usando o nome de arquivo padrão, use o seguinte comando:
ru: Например, для преобразования шрифта 30f9 Barcode с именами файлов по умолчанию, воспользуйтесь следующей командой:

source: If you want the converted fonts to be stored in [.filename]#A.pfa# and [.filename]#B.afm#, then use this command:
pt_br: Se você quer que as fontes convertidas sejam armazenadas em [.filename]#A.pfa# e [.filename]#B.afm#, use o seguinte comando:
ru: Если вы хотите, чтобы преобразованные шрифты сохранялись в файлы [.filename]#A.pfa# and [.filename]#B.afm#, то выдайте такую команду:

source: Create the groff PostScript file:
pt_br: Crie o arquivo groff PostScript:
ru: Создайте PostScript-файл для Groff:

source: Change directories to [.filename]#/usr/share/groff_font/devps# so as to make the following command easier to execute. You will probably need root privileges for this. (Or, if you are paranoid about working there, make sure you reference the files [.filename]#DESC#, [.filename]#text.enc# and [.filename]#generate/textmap# as being in this directory.)
pt_br: Acesse o diretório `/usr/share/groff_font/devps` para facilitar a execução do seguinte comando. É provável que você precise de privilégios de root para executá-lo. (Ou, se você é paranoico em relação a trabalhar lá, certifique-se de que os arquivos `DESC`, `text.enc` e `generate/textmap` estejam localizados neste diretório.)
ru: Смените текущий каталог на [.filename]#/usr/shared/groff_font/devps# для облегчения запуска упоминаемых далее программ. Для этого вам может понадобиться иметь привилегии администратора системы. (Или, если вы избегаете здесь работать, обязательно посмотрите файлы [.filename]#DESC#, [.filename]#text.enc# и [.filename]#generate/textmap# в этом каталоге.)

source: Where, [.filename]#file.afm# is the _AFM_name_ created by `ttf2pf.ps` above, and _PS_font_name_ is the font name used from that command, as well as the name that man:groff[1] will use for references to this font. For example, assuming you used the first `tiff2pf.ps` above, then the 3of9 Barcode font can be created using the command:
pt_br: Onde, [.filename]#file.afm# é o _AFM_name_ criado pelo `ttf2pf.ps` acima, e _PS_font_name_ é o nome da fonte usado no comando anterior, bem como o nome que man:groff[1] usará para referenciar essa fonte. Por exemplo, assumindo que você usou o primeiro `tiff2pf.ps` acima, a fonte Barcode 3of9 pode ser criada usando o comando:
ru: Здесь [.filename]#file.afm# является файлом _AFM_name_, созданным программой `ttf2pf.ps` выше, а _PS_font_name_ является именем шрифта, используемым в той команде, так же, как и имя, которое будет использовать утилита man:groff[1] для ссылки на этот шрифт. Например, полагая, что вы использовали первую команду `tiff2pf.ps` выше, то шрифт 3of9 Barcode может быть создан при помощи такой команды:

source: Ensure that the resulting _PS_font_name_ file (e.g., [.filename]#3of9# in the example above) is located in the directory [.filename]#/usr/share/groff_font/devps# by copying or moving it there.
pt_br: Certifique-se de que o arquivo _PS_font_name_ resultante (por exemplo, [.filename]#3of9# no exemplo acima) esteja localizado no diretório [.filename]#/usr/share/groff_font/devps# movendo ou copiando-o para lá.
ru: Проверьте, что полученный файл _PS_font_name_ (к примеру, [.filename]#3of9# из примера выше) расположен в каталоге [.filename]#/usr/shared/groff_font/devps#, скопировав или перенеся его сюда.
