<!--
     The FreeBSD Documentation Project
     The FreeBSD French Documentation Project

     $FreeBSD$
     Original revision: n.nn
-->

<chapter id="disks">
  <title>Disques</title>

  <para><emphasis>Contribution de &a.obrien; 26 April 1998</emphasis></para>
  &trans.a.haby;
    
  <para>Supposons que nous voulions ajouter un second disque SCSI &agrave; une machine
    qui n'a pour l'instant qu'un seul disque. Commen&ccedil;ons par arr&ecirc;ter l'ordinateur
    et installer le disque en suivant les instructions donn&eacute;es pour l'ordinateur,
    le contr&ocirc;leur et le disque. Comme il y a de nombreuses variantes pour ces
    proc&eacute;dures, les d&eacute;tails d&eacute;bordent le cadre de ce document.</para>

  <para>Ouvrons maintenant un session sous le compte
    super-utilisateur <username>root</username>. Apr&egrave;s
    avoir install&eacute; le disque, consultons le fichier
    <filename>/var/run/dmesg.boot</filename> 
    pour v&eacute;rifier que le disque a &eacute;t&eacute; reconnu. Dans notre exemple, le disque
    que nous venons d'ajouter sera le p&eacute;riph&eacute;rique <filename>sd1</filename> 
    que nous monterons sur le r&eacute;pertoire <filename>/1</filename>. (Si vous
    ajoutez un disque IDE, remplacez <filename>sd</filename> par 
   <filename>wd</filename>).</para>
  
  <para>Comme FreeBSD tourne sur des ordinateurs compatibles IBM-PC, il doit
    prendre en compte les partitions PC BIOS. Celles-ci sont diff&eacute;rentes des
    partitions BSD traditionnelles. Un disque PC peut avoir jusqu'&agrave; quatre
    partitions. Si le disque va &ecirc;tre r&eacute;serv&eacute; &agrave; FreeBSD, vous pouvez utiliser
    le mode <emphasis>d&eacute;di&eacute;</emphasis>. Sinon FreeBSD devra utiliser une des
    partitions PC BIOS. FreeBSD appelle les partitions PC BIOS
    <emphasis>tranches (&ldquo;slices&rdquo;)</emphasis> pour les distinguer
    des partitions BSD traditionnelles. Vous pouvez aussi utiliser des
    tranches sur un disque d&eacute;di&eacute; &agrave; FreeBSD, sur une machine o&ugrave; un autre
    syst&egrave;me d'exploitation est aussi install&eacute;. Cela &eacute;vite de perturber
    l'utilitaire <command>fdisk</command> de l'autre syst&egrave;me 
    d'exploitation.</para>

  <para>Dans le cas d'une tranche, le disque ajout&eacute; deviendra le p&eacute;riph&eacute;rique
    <filename>/dev/sd1s1e</filename>. Ce qui se lit: disque SCSI, num&eacute;ro
    d'unit&eacute; 1 (second disque SCSI), tranche 1 (partition PC BIOS 1), et
    partition BSD <filename>e</filename>. Dans le cas d'un disque d&eacute;di&eacute;, ce 
    sera simplement <filename>/dev/sd1e</filename>.</para>

  <sect1>
    <title>Utiliser sysinstall</title>

    <para>Vous pouvez utiliser <command>/stand/sysinstall</command> 
      et ses menus simples d'emploi pour
      partitionner et libeller le nouveau disque.
      Ouvrez une session sous le compte
      super-utilisateur <username>root</username> 
      ou servez-vous de la commande <command>su</command>. Lancez
      <command>/stand/sysinstall</command> et choisissez le menu
      <literal>Configure</literal> (Configurer). Dans le <literal>FreeBSD
      Configuration Menu</literal> (Menu de Configuration de FreeBSD),
      descendez dans la liste et s&eacute;lectionnez <literal>Partition</literal>.
      Vous devriez voir appara&icirc;tre la liste des disques durs de votre
      syst&egrave;me. Si <literal>sd1</literal> n'est pas dans la liste, il vous 
      faut v&eacute;rifier votre installation physique et le r&eacute;sultat de la
      commande <command>dmesg</command> dans le fichier
      <filename>/var/run/dmesg.boot</filename>.</para>
    
    <para>S&eacute;lectionnez <literal>sd1</literal> pour allez dans le
      <literal>FDISK Partition Editor</literal> (l'&eacute;diteur de
      Partition FDISK). Prenez l'option <literal>A</literal> pour utiliser
      tout le disque pour FreeBSD. Lorsque l'on vous demande si vous
      voulez vous garder la possibilit&eacute; de pouvoir coop&eacute;rer avec d'autres
      syst&egrave;mes d'exploitation (&ldquo;remain cooperative with any future 
      possible operating systems&rdquo;), r&eacute;pondez par l'affirmative
      (<literal>YES</literal>). Enregistrez vos modifications sur disque
      avec <command>W</command>. Quittez maintenant l'&eacute;diteur FDISK avec
      <command>q</command>. La prochaine question concernera l'enregistrement
      de d&eacute;marrage (&ldquo;Master Boot Record&rdquo;). Comme vous ajoutez un 
      disque &agrave; un syst&egrave;me d&eacute;j&agrave; op&eacute;rationnel, choisissez <literal>None</literal>
      (aucun).</para>

    <para>Allez maintenant dans le <literal>Disk Label Editor</literal> (l'&eacute;diteur
      de label du disque). C'est l&agrave; que vous allez cr&eacute;er les partitions BSD
      traditionnelles. Un disque peut avoir jusqu'&agrave; huit partitions, libell&eacute;es
      de a &agrave; h. Certains de ces labels ont des significations particuli&egrave;res.
      La partition <literal>a</literal> est la partition racine (<filename>/</filename>).
      Seul votre disque syst&egrave;me (e.g., celui &agrave; partir duquel vous d&eacute;marrez)
      doit avoir une partition <literal>a</literal>. La partition
      <literal>b</literal> sert &agrave; la pagination, vous pouvez avoir plusieurs
      disques avec des partitions de pagination. La partition <literal>c</literal> 
      d&eacute;signe la totalit&eacute; du disque en mode d&eacute;di&eacute;, ou toute la tranche FreeBSD
      dans le cas contraire. Les autres partitions sont &agrave; usage g&eacute;n&eacute;ral.</para>

    <para>L'&eacute;diteur de label de <command>sysinstall</command> d&eacute;finit par d&eacute;faut la
      partition <literal>e</literal> comme premi&egrave;re partition qui n'est ni
      racine, ni de pagination. Dans l'&eacute;diteur de label, cr&eacute;ez un seul
      syst&egrave;me de fichiers avec  l'option <command>C</command>. Quand on vous
      demande si ce sera un syst&egrave;me de fichier (FS) ou une partition de
      pagination, choisissez <literal>FS</literal> et indiquez un point de
      montage (e.g, <filename>/mnt</filename>). Lorsque vous ajoutez un 
      disque &agrave; un syst&egrave;me d&eacute;j&agrave; install&eacute;, <command>sysinstall</command> ne
      cr&eacute;e pas d'entr&eacute;e dans <filename>/etc/fstab</filename>, donc le nom
      que vous donnez au point de montage n'a pas d'importance.</para>

    <para>Vous pouvez maintenant &eacute;crire le nouveau label sur le disque et y
      cr&eacute;er un syst&egrave;me de fichiers. Faites-le avec la commande <command>W</command>. 
      Ne faites pas attention aux erreurs de <command>sysinstall</command>
      qui vous disent que la nouvelle partition ne peut pas &ecirc;tre mont&eacute;e. Quittez
      maintenant l'&eacute;diteur de label et <command>sysinstall</command>.</para>

    <para>La derni&egrave;re &eacute;tape consiste &agrave; &eacute;diter le fichier 
      <filename>/etc/fstab</filename> pour y ajouter une entr&eacute;e pour votre nouveau
      disque.</para>
  </sect1>

  <sect1>
    <title>Employer les utilitaires sur la ligne de commande</title>

    <sect2>
      <title>* Utiliser les tranches&nbsp;-&nbsp;&ldquo;slices&rdquo;</title>

      <para></para>
    </sect2>
    
    <sect2>
      <title>Disque d&eacute;di&eacute;</title>

      <para>Si le nouveau disque n'est pas destin&eacute; &agrave; &ecirc;tre partag&eacute; avec un autre
        syst&egrave;me d'exploitation, vous pouvez utiliser le mode <literal>d&eacute;di&eacute;</literal>. 
        Rappelez-vous que ce mode peut perturber les syst&egrave;mes d'exploitation Microsoft;
        cependant, ils ne toucheront pas au disque. OS/2 d'IBM, au contraire,
	&ldquo;s'approprie&rdquo; toute partition qu'il trouve et ne reconna&icirc;t
	pas.</para>
      
      <informalexample>
	<screen>&prompt.root; <userinput>dd if=/dev/zero of=/dev/rsd1 bs=1k count=1</userinput>
&prompt.root; <userinput>disklabel -Brw sd1 auto</userinput>
&prompt.root; <userinput>disklabel -e sd</userinput>1			# cr&eacute;er la partition `e'
&prompt.root; <userinput>newfs -d0 /dev/rsd1e</userinput>
&prompt.root; <userinput>mkdir -p /1</userinput>
&prompt.root; <userinput>vi /etc/fstab</userinput>				# ajouter une entr&eacute;e pour  /dev/sd1e
&prompt.root; <userinput>mount /1</userinput></screen>
    </informalexample>

	<para>Voici une autre m&eacute;thode:</para>
	
    <informalexample>
	<screen>&prompt.root; <userinput>dd if=/dev/zero of=/dev/rsd1 count=2</userinput>
&prompt.root; <userinput>disklabel /dev/rsd1 | disklabel -BrR sd1 /dev/stdin</userinput>
&prompt.root; <userinput>newfs /dev/rsd1e</userinput>
&prompt.root; <userinput>mkdir -p /1</userinput>
&prompt.root; <userinput>vi /etc/fstab</userinput>				# ajouter une entr&eacute;e pour /dev/sd1e
&prompt.root; <userinput>mount /1</userinput></screen>
      </informalexample>
    </sect2>
  </sect1>

  <sect1>
    <title>* Autres types de disques</title>
    
    <sect2>
      <title>* Disques Zip</title>

      <para></para>
    </sect2>

    <sect2>
      <title>* Disques Jazz</title>

      <para></para>
    </sect2>
    
    <sect2>
      <title>* Disques Sequest</title>

      <para></para>
    </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../handbook.sgml" "part" "chapter")
     End:
-->
